{"metadata":{"length":9,"arabic":{"title":"الشمائل المحمدية","author":"الإمام الترمذي","introduction":"باب ماجاء في تختم رسول الله صلى الله عليه وسلم"},"english":{"title":"Shama'il Muhammadiyah","author":"Imam Tirmidhi","introduction":"Stating That Rasoolullah Wore The Ring On His Right Hand"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":12,"bookId":16,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَهْلِ بْنِ عَسْكَرٍ الْبَغْدَادِيُّ، وَعَبْدُ اللهِ بْنُ عَبْدِ الرَّحْمَنِ، قَالا‏:‏ أَخْبَرَنَا يَحْيَى بْنُ حَسَّانَ، قَالَ‏:‏ حَدَّثَنَا سُلَيْمَانُ بْنُ بِلالٍ، عَنْ شَرِيكِ بْنِ عَبْدِ اللهِ بْنِ أَبِي نَمِرٍ، عَنِ إِبْرَاهِيمَ بْنِ عَبْدِ اللهِ بْنِ حُنَيْنٍ، عَنِ أَبِيهِ، عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ‏:‏ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَلْبَسُ خَاتَمَهُ فِي يَمِينِهِ‏.‏\n\nحَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، قَالَ‏:‏ حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، عَنْ سُلَيْمَانَ بْنِ بِلالٍ، عَنْ شَرِيكِ بْنِ عَبْدِ اللهِ بْنِ أَبِي نَمِرٍ، نَحْوَهُ‏.‏","english":{"narrator":"'Ali ibn Abi Talib said (may Allah be well pleased with him):","text":"“The Prophet (Allah bless him and give him peace) used to wear his signet ring on his right hand.”"}},{"id":2,"idInBook":2,"chapterId":12,"bookId":16,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ ، قَالَ : حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ ، عَنْ حَمَّادِ بْنِ سَلَمَةَ ، قَالَ : رَأَيْتُ ابْنَ أَبِي رَافِعٍ يَتَخَتَّمُ فِي يَمِينِهِ فَسَأَلْتُهُ عَنْ ذَلِكَ , فَقَالَ : رَأَيْتُ عَبْدَ اللَّهِ بْنَ جَعْفَرٍ يَتَخَتَّمُ فِي يَمِينِهِ وَقَالَ عَبْدُ اللَّهِ بْنُ جَعْفَرٍ : \n\" كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَخَتَّمُ فِي يَمِينِهِ \" .","english":{"narrator":"Hammad ibn Salama said:","text":"\"I saw Ibn Abi Rafi' wearing a signet ring on his right hand, so I asked him about that and he said: 'I saw 'Abdu llah ibn Ja'far wearing a signet ring on his right hand', and 'Abdullah ibn Ja'far said:\n'Allah’s Messenger (Allah bless him and give him peace) used to wear a signet ring on his right hand'.”"}},{"id":3,"idInBook":3,"chapterId":12,"bookId":16,"arabic":"حَدَّثَنَا يَحْيَى بْنُ مُوسَى، قَالَ‏:‏ حَدَّثَنَا عَبْدُ اللهِ بْنُ نُمَيْرٍ، قَالَ‏:‏ حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْفَضْلِ، عَنْ عَبْدِ اللهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ، عَنْ عَبْدِ اللهِ بْنِ جَعْفَرٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَتَخَتَّمُ فِي يَمِينِهِ‏.‏","english":{"narrator":"Abdullah ibn Ja'far said:","text":"“He (Allah bless him and give him peace) used to wear a signet ring on his right hand.”"}},{"id":4,"idInBook":4,"chapterId":12,"bookId":16,"arabic":"حَدَّثَنَا أَبُو الْخَطَّابِ زِيَادُ بْنُ يَحْيَى، قَالَ‏:‏ حَدَّثَنَا عَبْدُ اللهِ بْنُ مَيْمُونٍ، عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ، عَنْ أَبِيهِ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ‏:‏ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَتَخَتَّمُ فِي يَمِينِهِ‏.‏","english":{"narrator":"Jabir ibn ‘Abdi’llah said:","text":"\"The Prophet (Allah bless him and give him peace) used to wear a signet ring on his right hand.”"}},{"id":5,"idInBook":5,"chapterId":12,"bookId":16,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ حُمَيْدٍ الرَّازِيُّ، قَالَ‏:‏ حَدَّثَنَا جَرِيرٌ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنِ الصَّلتِ بْنِ عَبْدِ اللهِ، قَالَ‏:‏ كَانَ ابْنُ عَبَّاسٍ، يَتَخَتَّمُ فِي يَمِينِهِ، وَلا إِخَالُهُ إِلا قَالَ‏:‏ كَانَ رَسُولُ اللهِ صلى الله عليه وسلم يَتَخَتَّمُ فِي يَمِينِهِ‏.‏","english":{"narrator":"‘As-Salt ibn 'Abdi’llah said:","text":"“Ibn 'Abbas used to wear a signet ring on his right hand, without adornment, and he said: 'Allah’s Messenger (Allah bless him and give him peace) used to wear a signet ring on his right hand'.”"}},{"id":6,"idInBook":6,"chapterId":12,"bookId":16,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُمَرَ، قَالَ‏:‏ حَدَّثَنَا سُفْيان، عَنْ أَيُّوبَ بْنِ مُوسَى، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ‏:‏ أَنَّ النَّبِيَّ صلى الله عليه وسلم اتَّخَذَ خَاتَمًا مِنْ فِضَّةٍ، وَجَعَلَ فَصَّهُ مِمَّا يَلِي كَفَّهُ، وَنَقَشَ فِيهِ مُحَمَّدٌ رَسُولُ اللهِ، وَنَهَى أَنْ يَنْقُشَ أَحَدٌ عَلَيْهِ وَهُوَ الَّذِي سَقَطَ مِنْ مُعَيْقِيبٍ فِي بِئْرِ أَرِيسٍ‏.‏","english":{"narrator":"Ibn 'Umar said:","text":"\"The Prophet (Allah bless him and give him peace) chose a signet ring of silver, and put its stone in the part close to the\npalm of his hand. On it he engraved: “Muhammad is the Messenger of Allah,” and he forbade anyone  to engrave on it. It is the one that fell from Mu'aiqib into the well of Aris.”"}},{"id":7,"idInBook":7,"chapterId":12,"bookId":16,"arabic":"حَدَّثَنَا قتيبة بن سعيد ‏,‏ حَدَّثَنَا حاتم بن إسماعيل ‏,‏ عن جَعْفَرٍ بن محمد ‏,‏ عن أبيه ‏,‏ قَالَ‏:‏ كان الحسن والحسين يتختمان في يسارهما‏.‏","english":{"narrator":"Ja'far ibn Muhammad reports that his father said:","text":"\"Al-Hasan and al-Husain used to wear signet rings on their left hands.\""}},{"id":8,"idInBook":8,"chapterId":12,"bookId":16,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ عَبْدِ الرَّحْمَنِ، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى وَهُوَ ابْنُ الطَّبَّاعِ، قَالَ‏:‏ حَدَّثَنَا عَبَّادُ بْنُ الْعَوَّامِ، عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ‏:‏ أَنَّهُ صلى الله عليه وسلم كَانَ يَتَخَتَّمُ فِي يَمِينِهِ‏.‏\n\nقال أبو عيسى: هذا حديث غريب لا نعرفه من حديث سعيد بن أبي عروبة عن قتادة عن أنس عن النبي صلى الله عليه وسلم نحو هذا إلا من هذا الوجه. وروى بعض أصحاب قتادة عن قتادة عن أنس بن مالك عن النبي صلى الله عليه وسلم أنه كان يتختم في يساره هو حديث لا يصح أيضا.","english":{"narrator":"Anas ibn Malik said:","text":"“He (Allah bless him and give him peace) used to wear a signet ring on his right hand.”"}},{"id":9,"idInBook":9,"chapterId":12,"bookId":16,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدِ اللهِ الْمُحَارِبِيُّ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ‏:‏ اتَّخَذَ رَسُولُ اللهِ صلى الله عليه وسلم خَاتَمًا مِنْ ذَهَبٍ، فَكَانَ يَلْبَسُهُ فِي يَمِينِهِ، فَاتَّخَذَ النَّاسُ خَوَاتِيمَ مِنْ ذَهَبٍ فَطَرَحَهُ صلى الله عليه وسلم، وَقَالَ‏:‏ لا أَلْبَسُهُ أَبدًا فَطَرَحَ النَّاسُ خَوَاتِيمَهُمْ‏.‏","english":{"narrator":"Ibn 'Umar said:","text":"\"Allah’s Messenger (Allah bless him and give him peace) chose a signet ring of gold, and he used to wear it on his right hand. The people therefore chose signet rings of gold, so he threw it away (Allah bless him and give him peace) and said: 'I shall never wear it!' The people therefore threw their signet rings away.”"}}],"chapter":{"id":12,"bookId":16,"arabic":"باب ماجاء في تختم رسول الله صلى الله عليه وسلم","english":"Stating That Rasoolullah Wore The Ring On His Right Hand"}}