{"metadata":{"length":2,"arabic":{"title":"الشمائل المحمدية","author":"الإمام الترمذي","introduction":"باب ماجاء في صفة درع رَسُولِ اللهِصلى الله عليه وسلم"},"english":{"title":"Shama'il Muhammadiyah","author":"Imam Tirmidhi","introduction":"The Armor Of Rasoolullah"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":14,"bookId":16,"arabic":"حَدَّثَنَا أَبُو سَعِيدٍ عَبْدُ اللهِ بْنُ سَعِيدٍ الأَشَجُّ، قَالَ‏:‏ حَدَّثَنَا يُونُسُ بْنُ بُكَيْرٍ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنْ يَحْيَى بْنِ عَبَّادِ بْنِ عَبْدِ اللهِ بْنِ الزُّبَيْرِ، عَنْ أَبِيهِ، عَنْ جَدِّهِ عَبْدِ اللهِ بْنِ الزُّبَيْرِ، عَنِ الزُّبَيْرِ بْنِ الْعَوَّامِ، قَالَ‏:‏ كَانَ عَلَى النَّبِيِّ صلى الله عليه وسلم يَوْمَ أُحُدٍ دِرْعَانِ، فَنَهَضَ إِلَى الصَّخْرَةِ فَلَمْ يَسْتَطِعْ، فَأَقْعَدَ طَلْحَةَ تَحْتَهُ، وَصَعِدَ النَّبِيُّ صلى الله عليه وسلم حَتَّى اسْتَوَى عَلَى الصَّخْرَةِ، قَالَ‏:‏ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم، يَقُولُ‏:‏ أَوْجَبَ طَلْحَةُ‏.‏","english":{"narrator":"Az-Zubair ibn al-'Awwam said:","text":"\"The Prophet (Allah bless him and give him peace) wore two coats of mail on the Day of \nUhud, so he tried to climb the boulder but was not able. He therefore made Talha sit\nbeneath him, and the Prophet (Allah bless him and give him peace), climbed up until he stood upright on the rock.\" He said: \"I heard the Prophet say (Allah bless him and give\nhim peace): 'Talha performed a deed worthy of reward'!”"}},{"id":2,"idInBook":2,"chapterId":14,"bookId":16,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُمَرَ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ يَزِيدَ بْنِ خُصَيْفَةَ، عَنِ السَّائِب بْنِ يَزِيدَ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم، كَانَ عَلَيْهِ يَوْمَ أُحُدٍ دِرْعَانِ، قَدْ ظَاهَرَ بَيْنَهُمَا‏.‏","english":{"narrator":"As-Sa’ib ibn Yazid said:","text":"\"Allah’s Messenger (Allah bless him and give him peace) wore on the Day of Uhud two coats of mail between which he rendered support.”"}}],"chapter":{"id":14,"bookId":16,"arabic":"باب ماجاء في صفة درع رَسُولِ اللهِصلى الله عليه وسلم","english":"The Armor Of Rasoolullah"}}