{"metadata":{"length":2,"arabic":{"title":"الشمائل المحمدية","author":"الإمام الترمذي","introduction":"باب ما جاء في صفة مغفر رسول الله صلى الله عليه وسلم"},"english":{"title":"Shama'il Muhammadiyah","author":"Imam Tirmidhi","introduction":"The Helmet Of Rasoolullah"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":15,"bookId":16,"arabic":"حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ‏:‏ حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَنَسِ بْنِ مَالِكٍ‏:‏ أَنَّ النَّبِيَّ صلى الله عليه وسلم دَخَلَ مَكَّةَ وَعَلَيْهِ مِغْفَرٌ، فَقِيلَ لَهُ‏:‏ هَذَا ابْنُ خَطَلٍ مُتَعَلِّقٌ بِأَسْتَارِ الْكَعْبَةِ، فَقَالَ‏:‏ اقْتُلُوهُ‏.‏","english":{"narrator":"Anas ibn Malik said:","text":"\"The Prophet (Allah bless him and give him peace) entered Mecca wearing a helmet. He was told: 'This Ibn Khatal  is clinging to the curtains of the Ka'ba so he said: 'Kill him!'\""}},{"id":2,"idInBook":2,"chapterId":15,"bookId":16,"arabic":"حَدَّثَنَا عِيسَى بْنُ أَحْمَدَ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، قَالَ‏:‏ حَدَّثَنِي مَالِكُ بْنُ أَنَسٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم، دَخَلَ مَكَّةَ عَامَ الْفَتْحِ، وَعَلَى رَأْسِهِ الْمِغْفَرُ، قَالَ‏:‏ فَلَمَّا نَزَعَهُ جَاءَهُ رَجُلٌ، فَقَالَ لَهُ‏:‏ ابْنُ خَطَلٍ مُتَعَلِّقٌ بِأَسْتَارِ الْكَعْبَةِ، فَقَالَ‏:‏ اقْتُلُوهُ، قَالَ ابْنُ شِهَابٍ‏:‏ وَبَلَغَنِي أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم، لَمْ يَكُنْ يَوْمَئِذٍ مُحْرِمًا‏.‏","english":{"narrator":"Anas ibn Malik reported:","text":"“Allah’s Messenger (Allah bless him and give him peace) entered Mecca in the Year of Victory with the helmet on his head. When he took it off, a man came to him and told him: ‘Ibn Khatal  is clinging to the curtains of the Ka'ba,’ so he said: ‘Kill him!’ Ibn Shihab said: ‘It has also reached me that Allah’s Messenger (Allah bless him and give him peace) was not in the state of ritual consecration on that day.’”"}}],"chapter":{"id":15,"bookId":16,"arabic":"باب ما جاء في صفة مغفر رسول الله صلى الله عليه وسلم","english":"The Helmet Of Rasoolullah"}}