{"metadata":{"length":5,"arabic":{"title":"الشمائل المحمدية","author":"الإمام الترمذي","introduction":"باب ما جاء في عمامة رسول الله صلى الله عليه وسلم"},"english":{"title":"Shama'il Muhammadiyah","author":"Imam Tirmidhi","introduction":"The Turban Of Rasoolullah"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":16,"bookId":16,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنْ حَمَّادِ بْنِ سَلَمَةَ ‏(‏ح‏)‏ حَدَّثَنَا مَحْمُودُ بْنُ غَيْلانَ، قَالَ‏:‏ حَدَّثَنَا وَكِيعٌ، عَنْ حَمَّادِ بْنِ سَلَمَةَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ‏:‏ دَخَلَ النَّبِيُّ صلى الله عليه وسلم، مَكَّةَ يَوْمَ الْفَتْحِ، وَعَلَيْهِ عِمَامَةٌ سَوْدَاءُ‏.‏","english":{"narrator":"Jabir said:","text":"“The Prophet (Allah bless him and give him peace) entered Mecca on the Day of Victory wearing a black turban.”"}},{"id":2,"idInBook":2,"chapterId":16,"bookId":16,"arabic":"حَدَّثَنَا ابْنُ أَبِي عُمَرَ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنْ مُسَاوِرٍ الْوَرَّاقِ، عَنْ جَعْفَرِ بْنِ عَمْرِو بْنِ حُرَيْثٍ، عَنْ أَبِيهِ، قَالَ‏:‏ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يَخْطُبُ عَلَى الْمِنْبَرِ، وَعَلَيْهِ عِمَامَةٌ سَوْدَاءُ‏.‏","english":{"narrator":"'Amr ibn Huraith reported that his father said:","text":"\"I saw a black turban on the head of Allah’s Messenger (Allah bless him and give him peace).”"}},{"id":3,"idInBook":3,"chapterId":16,"bookId":16,"arabic":"حَدَّثَنَا مَحْمُودُ بْنُ غَيْلانَ، وَيُوسُفُ بْنُ عِيسَى، قَالا‏:‏ حَدَّثَنَا وَكِيعٌ، عَنْ مُسَاوِرٍ الْوَرَّاقِ، عَنْ جَعْفَرِ بْنِ عَمْرُو بْنِ حُرَيْثٍ، عَنْ أَبِيهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم، خَطَبَ النَّاسَ، وَعَلَيْهِ عِمَامَةٌ سَوْدَاءُ‏.‏","english":{"narrator":"'Amr ibn Huraith reported that his father said:","text":"\"The Prophet (Allah bless him and give him peace) addressed the people while wearing a black turban.”"}},{"id":4,"idInBook":4,"chapterId":16,"bookId":16,"arabic":"حَدَّثَنَا هَارُونُ بْنُ إِسْحَاقَ الْهَمْدَانِيُّ، قَالَ‏:‏ حَدَّثَنَا يَحْيَى بْنُ مُحَمَّدٍ الْمَدَنِيُّ، عَنْ عَبْدِ الْعَزِيزِ بْنِ مُحَمَّدٍ، عَنْ عُبَيْدِ اللهِ بْنِ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ‏:‏ كَانَ النَّبِيُّ صلى الله عليه وسلم، إِذَا اعْتَمَّ، سَدَلَ عِمَامَتَهُ بَيْنَ كَتِفَيْهِ‏.‏‏.‏","english":{"narrator":"Ibn 'Umar said:","text":"\"When the Prophet (Allah bless him and give him peace) donned a turban, he let his turban hang down between his shoulders.”"}},{"id":5,"idInBook":5,"chapterId":16,"bookId":16,"arabic":"حَدَّثَنَا يُوسُفُ بْنُ عِيسَى، قَالَ‏:‏ حَدَّثَنَا وَكِيعٌ، قَالَ‏:‏ حَدَّثَنَا أَبُو سُلَيْمَانَ وَهُوَ عَبْدُ الرَّحْمَنِ بْنُ الْغَسِيلِ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ‏:‏ أَنَّ النَّبِيَّ صلى الله عليه وسلم خَطَبَ النَّاسَ، وَعَلَيْهِ عِصَابَةٌ دَسْمَاءُ‏.‏","english":{"narrator":"Ibn 'Abbas said:","text":"“The Prophet (Allah bless him and give him peace) addressed the people while wearing a turban that was dasma’ ."}}],"chapter":{"id":16,"bookId":16,"arabic":"باب ما جاء في عمامة رسول الله صلى الله عليه وسلم","english":"The Turban Of Rasoolullah"}}