{"metadata":{"length":3,"arabic":{"title":"الشمائل المحمدية","author":"الإمام الترمذي","introduction":"باب ما جاء في جلسته صلى الله عليه وسلم"},"english":{"title":"Shama'il Muhammadiyah","author":"Imam Tirmidhi","introduction":"The Sitting Of Rasoolullah"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":20,"bookId":16,"arabic":"حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، قَالَ‏:‏ حَدَّثَنَا عَفَّانُ بْنُ مُسْلِمٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ اللهِ بْنُ حَسَّانَ، عَنْ، جَدَّتَيْهِ، عَنْ قَيْلَةَ بِنْتِ مَخْرَمَةَ، أَنَّهَا رَأَتْ رَسُولَ اللهِ صلى الله عليه وسلم فِي الْمَسْجِدِ، وَهُوَ قَاعِدٌ الْقُرْفُصَاءَ، قَالَتْ‏:‏ فَلَمَّا رَأَيْتُ رَسُولَ اللهِ صلى الله عليه وسلم، الْمُتَخَشِّعَ فِي الْجِلْسَةِ، أُرْعِدْتُ مِنَ الْفَرَقِ‏.‏","english":{"narrator":"'Abdu’llah ibn Hassan reported on the authority of his grandmothers:","text":"Qaila bint Makhrama said that she saw Allah’s Messenger (Allah bless him and give him peace) in the mosque squatting on his heels. She said: \"When I saw Allah’s Messenger (Allah bless him and give him peace) displaying humility in the mosque, I trembled with fright.\""}},{"id":2,"idInBook":2,"chapterId":20,"bookId":16,"arabic":"حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ الْمَخْزُومِيُّ، وَغَيْرُ وَاحِدٍ، قَالُوا‏:‏ حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ عَبَّادِ بْنِ تَمِيمٍ، عَنْ عَمِّهِ، أَنَّهُ رَأَى النَّبِيَّ صلى الله عليه وسلم مُسْتَلْقِيًا فِي الْمَسْجِدِ وَاضِعًا إِحْدَى رِجْلَيْهِ عَلَى الأُخْرَى‏.‏","english":{"narrator":"'Abbad ibn Tamim reported:","text":"His paternal uncle said that he saw the Prophet (Allah bless him and give him peace) lying on his back in the mosque, placing one of his legs over the other."}},{"id":3,"idInBook":3,"chapterId":20,"bookId":16,"arabic":"حَدَّثَنَا سَلَمَةُ بْنُ شَبِيبٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ اللهِ بْنُ إِبْرَاهِيمَ الْمَدَنِيُّ، قَالَ‏:‏ حَدَّثَنَا إِسْحَاقُ بْنُ مُحَمَّدٍ الأَنْصَارِيُّ، عَنْ رُبَيْحِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي سَعِيدٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ‏:‏ كَانَ رَسُولُ اللهِ صلى الله عليه وسلم إِذَا جَلَسَ فِي الْمَسْجِدِ، احْتَبَى بِيَدَيْهِ‏.‏","english":{"narrator":"Abu Sa'id al-Khudri said:","text":"“When Allah’s Messenger (Allah bless him and give him peace) sat in the mosque, he pressed his legs against his stomach with his hands.”"}}],"chapter":{"id":20,"bookId":16,"arabic":"باب ما جاء في جلسته صلى الله عليه وسلم","english":"The Sitting Of Rasoolullah"}}