{"metadata":{"length":7,"arabic":{"title":"الشمائل المحمدية","author":"الإمام الترمذي","introduction":"باب ما جاء في صفة فاكهة رسول الله صلى الله عليه وسلم"},"english":{"title":"Shama'il Muhammadiyah","author":"Imam Tirmidhi","introduction":"The Fruits Eaten By Rasoolullah"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":29,"bookId":16,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ بْنُ مُوسَى الْفَزَارِيُّ، قَالَ‏:‏ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللهِ، قَالَ‏:‏ كَانَ النَّبِيُّ صلى الله عليه وسلم، يَأْكُلُ الْقِثَّاءَ بِالرُّطَبِ‏.‏","english":{"narrator":"'Abdullah ibn Ja'far said:","text":"\"The Prophet (Allah bless him and give him peace) used to eat cucumbers with ripe dates.”"}},{"id":2,"idInBook":2,"chapterId":29,"bookId":16,"arabic":"حَدَّثَنَا عَبْدَةُ بْنُ عَبْدِ اللهِ الْخُزَاعِيُّ الْبَصْرِيُّ، قَالَ‏:‏ حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ، عَنْ سُفْيَانَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ‏:‏ أَنَّ النَّبِيَّ صلى الله عليه وسلم، كَانَ يَأْكُلُ الْبِطِّيخَ بِالرُّطَبِ‏.‏","english":{"narrator":"'A’isha said:","text":"(may Allah be well pleased with her):\n\"The Prophet (Allah bless him and give him peace) used to eat watermelon with ripe dates.”"}},{"id":3,"idInBook":3,"chapterId":29,"bookId":16,"arabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ يَعْقُوبَ، قَالَ‏:‏ حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، قَالَ‏:‏ حَدَّثَنَا أَبِي، قَالَ‏:‏ سَمِعْتُ حُمَيْدًا، أَوْ قَالَ‏:‏ حَدَّثَنِي حُمَيْدٌ، قَالَ وَهْبٌ‏:‏ وَكَانَ صَدِيقًا لَهُ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ‏:‏ رَأَيْتُ رَسُولَ اللهِ صلى الله عليه وسلم، يَجْمَعُ بَيْنَ الْخِرْبِزِ وَالرُّطَبِ‏.‏","english":{"narrator":"Anas ibn Malik said:","text":"\"I saw Allah’s Messenger (Allah bless him and give him peace) combine watermelon and ripe dates.”"}},{"id":4,"idInBook":4,"chapterId":29,"bookId":16,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْعَزِيزِ الرَّمْلِيُّ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ اللهِ بْنُ يَزِيدَ بْنِ الصَّلْتِ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنْ يَزِيدَ بْنِ رُومَانَ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ‏:‏ أَنَّ النَّبِيَّ صلى الله عليه وسلم أَكَلَ الْبِطِّيخَ بِالرُّطَبِ‏.‏","english":{"narrator":"A’isha(may Allah be well pleased with her) said:","text":"“The Prophet (Allah bless him and give him peace) ate watermelon with ripe dates.”"}},{"id":5,"idInBook":5,"chapterId":29,"bookId":16,"arabic":"حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكِ بْنِ أَنَسٍ ‏(‏ح‏)‏ وَحَدَّثَنَا إِسْحَاقُ بْنُ مُوسَى، قَالَ‏:‏ حَدَّثَنَا مَعْنٌ، قَالَ‏:‏ حَدَّثَنَا مَالِكٌ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ‏:‏ كَانَ النَّاسُ إِذَا رَأَوْا أَوَّلَ الثَّمَرِ جَاءُوا بِهِ إِلَى رَسُولِ اللهِ صلى الله عليه وسلم، فَإِذَا أَخَذَهُ رَسُولُ اللهِ صلى الله عليه وسلم، قَالَ‏:‏ اللَّهُمَّ بَارِكْ لَنَا فِي ثِمَارِنَا، وَبَارِكْ لَنَا فِي مَدِينَتِنَا، وَبَارِكْ لَنَا فِي صَاعِنَا وَفِي مُدِّنَا، اللَّهُمَّ إِنَّ إِبْرَاهِيمَ عَبْدُكَ وَخَلِيلُكَ وَنَبِيُّكَ، وَإِنِّي عَبْدُكَ وَنَبِيُّكَ، وَإِنَّهُ دَعَاكَ لِمَكَّةَ، وَإِنِّي أَدْعُوكَ لِلْمَدِينَةِ، بِمِثْلِ مَا دَعَاكَ بِهِ لِمَكَّةَ وَمِثْلِهِ مَعَهُ، قَالَ‏:‏ ثُمَّ يَدْعُو أَصْغَرَ وَلِيدٍ يَرَاهُ، فَيُعْطِيهِ ذَلِكَ الثَّمَرَ‏.‏","english":{"narrator":"Abu Huraira said:","text":"“When the people saw the first fruit  and Your Prophet, and I am Your servant and Your Prophet. He supplicated You on behalf of Mecca, and I supplicate You on behalf of Medina, for the like of what he supplicated You for on behalf of Mecca, and the like thereof as well!’ Then he would summon the youngest child he saw and give him that fruit.”"}},{"id":6,"idInBook":6,"chapterId":29,"bookId":16,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ حُمَيْدٍ الرَّازِيُّ، قَالَ‏:‏ حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُخْتَارِ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنْ أَبِي عُبَيْدَةَ بْنِ مُحَمَّدِ بْنِ عَمَّارِ بْنِ يَاسِرٍ، عَنِ الرُّبَيِّعِ بِنْتِ مُعَوِّذِ بْنِ عَفْرَاءَ، قَالَتْ‏:‏ بَعَثَنِي مُعَاذُ بْنُ عَفْرَاءَ بِقِنَاعٍ مِنْ رُطَبٍ وَعَلَيْهِ أَجْرٌ مِنْ قِثَّاءِ زُغْبٍ وَكَانَ النَّبِيُّ صلى الله عليه وسلم يُحِبُّ الْقِثَّاءَ، فَأَتَيْتُهُ بِهِ وَعِنْدَهُ حِلْيَةٌ قَدْ قَدِمَتْ عَلَيْهِ مِنَ الْبَحْرَيْنِ، فَمَلأَ يَدَهُ مِنْهَا فَأَعْطَانِيهِ‏.‏","english":{"narrator":"Ar-Rubai bint Mu'awwidh ibn 'Afra’ said:","text":"\"Mu'adh ibn 'Afra sent me with a tray of ripe dates, and on it there were pieces of fluffy cucumber. He  (Allah bless him and give him peace) used to love cucumbers, so I brought them to him. He had with him some ornaments that had come to him from Bahrain, so he took a handful of them and gave it to me.\""}},{"id":7,"idInBook":7,"chapterId":29,"bookId":16,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ‏:‏ حَدَّثَنَا شَرِيكٌ، عَنْ عَبْدِ اللهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ، عَنِ الرُّبَيِّعِ بِنْتِ مُعَوِّذِ بْنِ عَفْرَاءَ، قَالَتْ‏:‏ أَتيتُ النَّبِيَّ صلى الله عليه وسلم، بِقِنَاعٍ مِنْ رُطَبٍ، وَأَجْرٍ زُغْبٍ، فَأَعْطَانِي مِلْءَ كَفِّهِ حُلِيًّا أَوْ قَالَتْ‏:‏ ذَهَبًا‏.‏","english":{"narrator":"Ar-Rubai bint Mu'awwidh ibn 'Afra said:","text":"\"I brought the Prophet (Allah bless him and give him peace) a tray of ripe dates and fluffy cucumber, so he gave me a handful of ornaments, or she said: of gold.”"}}],"chapter":{"id":29,"bookId":16,"arabic":"باب ما جاء في صفة فاكهة رسول الله صلى الله عليه وسلم","english":"The Fruits Eaten By Rasoolullah"}}