{"metadata":{"length":3,"arabic":{"title":"الشمائل المحمدية","author":"الإمام الترمذي","introduction":"باب كيف كان كلام رسول الله صلى الله عليه وسلم"},"english":{"title":"Shama'il Muhammadiyah","author":"Imam Tirmidhi","introduction":"The Speech Of rasoolullah"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":33,"bookId":16,"arabic":"حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ الْبَصْرِيُّ، قَالَ‏:‏ حَدَّثَنَا حُمَيْدُ بْنُ الأَسْوَدِ، عَنِ أُسَامَةَ بْنِ زَيْدٍ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ‏:‏ مَا كَانَ رَسُولُ اللهِ صلى الله عليه وسلم يَسْرُدُ سرْدَكُمْ هَذَا، وَلَكِنَّهُ كَانَ يَتَكَلَّمُ بِكَلامٍ بَيِّنٍ فَصْلٍ، يَحْفَظُهُ مَنْ جَلَسَ إِلَيْهِ‏.‏","english":{"narrator":"'A’isha said (may Allah the Exalted be well pleased with her):","text":"\"Allah’s Messenger (Allah bless him and give him peace) would not speak on and on the way you do. Rather, he would pause periodically, so that those who sat with him would remember what he said.”"}},{"id":2,"idInBook":2,"chapterId":33,"bookId":16,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، قَالَ‏:‏ حَدَّثَنَا أَبُو قُتَيْبَةَ سَلْمُ بْنُ قُتَيْبَةَ، عَنْ عَبْدِ اللهِ بْنِ الْمُثَنَّى، عَنْ ثُمَامَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ‏:‏ كَانَ رَسُولُ اللهِ صلى الله عليه وسلم، يُعِيدُ الْكَلِمَةَ ثَلاثًا لِتُعْقَلَ عَنْهُ‏.‏","english":{"narrator":"Anas ibn Malik said:","text":"\"Allah’s Messenger (Allah bless him and give him peace) used to repeat each expression three times in order to make himself understood.”"}},{"id":3,"idInBook":3,"chapterId":33,"bookId":16,"arabic":"حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ، قَالَ‏:‏ حَدَّثَنَا جُمَيْعُ بْنُ عُمَرَ بْنِ عَبْدِ الرَّحْمَنِ الْعِجْلِيُّ، قَالَ‏:‏ حدَّثنِي رَجُلٌ مِنْ بَنِي تَمِيمٍ مِنْ وَلَدِ أَبِي هَالَةَ زَوْجِ خَدِيجَةَ يُكْنَى أَبَا عَبْدِ اللهِ، عَنِ ابْنٍ لأَبِي هَالَةَ، عَنِ الْحَسَنِ بْنِ عَلِيٍّ، قَالَ‏:‏ سَأَلْتُ خَالِي هِنْدُ بْنُ أَبِي هَالَةَ، وَكَانَ وَصَّافًا، فَقُلْتُ‏:‏ صِفْ لِي مَنْطِقَ رَسُولِ اللهِ صلى الله عليه وسلم، قَالَ‏:‏ كَانَ رَسُولُ اللهِ صلى الله عليه وسلم مُتَوَاصِلَ الأَحْزَانِ، دَائِمَ الْفِكْرَةِ، لَيْسَتْ لَهُ رَاحَةٌ، طَوِيلُ السَّكْتِ، لا يَتَكَلَّمُ فِي غَيْرِ حَاجَةٍ، يَفْتَتِحُ الْكَلامَ، وَيَخْتِمُهُ بِاسْمِ اللهِ تَعَالَى، وَيَتَكَلَّمُ بِجَوَامِعِ الْكَلِمِ، كَلامُهُ فَصْلٌ، لا فُضُولَ، وَلا تَقْصِيرَ، لَيْسَ بِالْجَافِي، وَلا الْمُهِينِ، يُعَظِّمُ النِّعْمَةَ وَإِنْ دَقَّتْ لا يَذُمُّ مِنْهَا شَيْئًا، غَيْرَ أَنَّهُ لَمْ يَكُنْ يَذُمُّ ذَوَّاقًا وَلا يَمْدَحُهُ، وَلا تُغْضِبُهُ الدُّنْيَا، وَلا مَا كَانَ لَهَا، فَإِذَا تُعُدِّيَ الْحَقُّ، لَمْ يَقُمْ لِغَضَبِهِ شَيْءٌ، حَتَّى يَنْتَصِرَ لَهُ، وَلا يَغْضَبُ لِنَفْسِهِ، وَلا يَنْتَصِرُ لَهَا، إِذَا أَشَارَ بِكَفِّهِ كُلِّهَا، وَإِذَا تَعَجَّبَ قَلَبَهَا، وَإِذَا تَحَدَّثَ اتَّصَلَ بِهَا، وَضَرَبَ بِرَاحَتِهِ الْيُمْنَى بَطْنَ إِبْهَامِهِ الْيُسْرَى، وَإِذَا غَضِبَ أَعْرَضَ وَأَشَاحَ، وَإِذَا فَرِحَ غَضَّ طَرْفَهُ، جُلُّ ضَحِكِهِ التَّبَسُّمُ، يَفْتَرُّ عَنْ مِثْلِ حَبِّ الْغَمَامِ‏.‏","english":{"narrator":"Al-Hasan ibn 'Ali said (may Allah the Exalted be well pleased with him and his father):","text":"“I said to my maternal uncle, Hind ibn Abi Hala, who was skilled at describing people: ‘Describe for me the manner of speech Allah’s Messenger (Allah bless him and give him peace)!’ He said: Allah’s Messenger (Allah bless him and give him peace) was constantly sympathetic with sorrows, persistent in thought, having no repose, prolonged in silence. He would not speak unnecessarily. He would introduce and conclude his speech with: 'Bismillahi ta'ala . His speech was concise, neither excessive nor abridged. It was neither uncouth nor contemptible. He would extol a blessing, however small, and he would not find fault with any aspect of it. He neither condemned nor praised those who enjoyed food and drink, and he would not be angered by this world. If the truth were overstepped, he would be so furious that he could do nothing but right the wrong. He would not be angry for his own sake or come to his own defense. When he beckoned, he beckoned with the whole of the palm of his hand, and when he was astonished, he turned it over, and when he spoke, he gestured with his hands, and placed his right palm over the base of his left thumb. When he was angry, he turned away and averted his face, and when he was happy, he lowered his gaze. Most of his laughter was in the form of a smile that revealed teeth as white as hailstones'.”"}}],"chapter":{"id":33,"bookId":16,"arabic":"باب كيف كان كلام رسول الله صلى الله عليه وسلم","english":"The Speech Of rasoolullah"}}