{"metadata":{"length":1,"arabic":{"title":"الشمائل المحمدية","author":"الإمام الترمذي","introduction":"حديث أم زرع"},"english":{"title":"Shama'il Muhammadiyah","author":"Imam Tirmidhi","introduction":"Hadith of Umm Zar`"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":38,"bookId":16,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ‏:‏ حَدَّثَنَا عِيسَى بْنُ يُونُسَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنِ أَخِيهِ عَبْدِ اللهِ بْنِ عُرْوَةَ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ‏:‏ جَلَسَتْ إِحْدَى عَشْرَةَ امْرَأَةً فَتَعَاهَدْنَ وَتَعَاقَدْنَ أَنْ لا يَكْتُمْنَ مِنْ أَخْبَارِ أَزْوَاجِهِنَّ شَيْئًا‏:‏ فَقَالَتِ الأُولَى‏:‏ زَوْجِي لَحْمُ جَمَلٍ غَثٍّ عَلَى رَأْسِ جَبَلٍ وَعْرٍ، لا سَهْلٌ فَيُرْتَقَى، وَلا سَمِينٌ فَيُنْتَقَلُ قَالَتِ الثَّانِيَةُ‏:‏ زَوْجِي لا أَبُثُّ خَبَرَهُ، إِنِّي أَخَافُ أَنْ لا أَذَرَهُ، إِنْ أَذْكُرْهُ أَذْكُرْ عُجَرَهُ، وَبُجَرَهُ قَالَتِ الثَّالِثَةُ‏:‏ زَوْجِي الْعَشَنَّقُ، إِنْ أَنْطِقْ أُطَلَّقْ، وَإِنْ أَسْكُتْ أُعَلَّقْ قَالَتِ الرَّابِعَةُ‏:‏ زَوْجِي كَلَيْلِ تِهَامَةَ، لا حَرٌّ، وَلا قُرٌّ، وَلا مَخَافَةَ، وَلا سَآمَةَ قَالَتِ الْخَامِسَةُ‏:‏ زَوْجِي إِنْ دَخَلَ فَهِدَ، وَإِنْ خَرَجَ أَسِدَ، وَلا يَسْأَلُ عَمَّا عَهِدَ قَالَتِ السَّادِسَةُ‏:‏ زَوْجِي إِنْ أَكَلَ لَفَّ، وَإِنْ شَرِبَ اشْتَفَّ، وَإِنِ اضْطَجَعَ الْتَفَّ، وَلا يُولِجُ الْكَفَّ، لِيَعْلَمَ الْبَثَّ قَالَتِ السَّابِعَةُ‏:‏ زَوْجِي عَيَايَاءُ، أَوْ غَيَايَاءُ طَبَاقَاءُ، كُلُّ دَاءٍ لَهُ دَاءٌ، شَجَّكِ، أَوْ فَلَّكِ، أَوْ جَمَعَ كُلا لَكِ قَالَتِ الثَّامِنَةُ‏:‏ زَوْجِي الْمَسُّ، مَسُّ أَرْنَبٍ وَالرِّيحُ، رِيحُ زَرْنَبٍ قَالَتِ التَّاسِعَةُ‏:‏ زَوْجِي رَفِيعُ الْعِمَادِ، طَوِيلُ النِّجَادِ عَظِيمُ الرَّمَادِ، قَرِيبُ الْبَيْتِ مِنَ النَّادِ قَالَتِ الْعَاشِرَةُ‏:‏ زَوْجِي مَالِكٌ، وَمَا مَالِكٌ مَالِكٌ خَيْرٌ مِنْ ذَلِكِ، لَهُ إِبِلٌ كَثِيرَاتُ الْمَبَارِكِ، قَلِيلاتُ الْمَسَارِحِ، إِذَا سَمِعْنَ صَوْتَ الْمِزْهَرِ، أَيْقَنَّ أَنَّهُنَّ هَوَالِكُ قَالَتِ الْحَادِيَةَ عَشْرَةَ‏:‏ زَوْجِي أَبُو زَرْعٍ وَمَا أَبُو زَرْعٍ‏؟‏ أَنَاسَ مِنْ حُلِيٍّ أُذُنَيَّ، وَمَلأَ مِنْ شَحْمٍ عَضُدَيَّ، وَبَجَّحَنِي، فَبَجَحَتْ إِلَيَّ نَفْسِي، وَجَدَنِي فِي أَهْلِ غُنَيْمَةٍ بِشَقٍّ فَجَعَلَنِي فِي أَهْلِ صَهِيلٍ، وَأَطِيطٍ وَدَائِسٍ وَمُنَقٍّ، فَعِنْدَهُ أَقُولُ، فَلا أُقَبَّحُ، وَأَرْقُدُ، فَأَتَصَبَّحُ، وَأَشْرَبُ، فَأَتَقَمَّحُ، أُمُّ أَبِي زَرْعٍ فَمَا أُمُّ أَبِي زَرْعٍ، عُكُومُهَا رَدَاحٌ، وَبَيْتُهَا فَسَاحٌ، ابْنُ أَبِي زَرْعٍ، فَمَا ابْنُ أَبِي زَرْعٍ، مَضْجَعُهُ كَمَسَلِّ شَطْبَةٍ، وَتُشْبِعُهُ ذِرَاعُ الْجَفْرَةِ، بِنْتُ أَبِي زَرْعٍ، فَمَا بِنْتُ أَبِي زَرْعٍ، طَوْعُ أَبِيهَا وَطَوْعُ أُمِّهَا، مِلْءُ كِسَائِهَا، وَغَيْظُ جَارَتِهَا، جَارِيَةُ أَبِي زَرْعٍ، فَمَا جَارِيَةُ أَبِي زَرْعٍ، لا تَبُثُّ حَدِيثَنَا تَبْثِيثًا، وَلا تُنَقِّثُ مِيرَتَنَا تَنْقِيثًا، وَلا تَمْلأُ بَيْتَنَا تَعْشِيشًا، قَالَتْ‏:‏ خَرَجَ أَبُو زَرْعٍ، وَالأَوْطَابُ تُمْخَضُ، فَلَقِيَ امْرَأَةً مَعَهَا وَلَدَانِ لَهَا، كَالْفَهْدَيْنِ، يَلْعَبَانِ مِنْ تَحْتِ خَصْرِهَا بِرُمَّانَتَيْنِ، فَطَلَّقَنِي وَنَكَحَهَا، فَنَكَحْتُ بَعْدَهُ رَجُلا سَرِيًّا، رَكِبَ شَرِيًّا، وَأَخَذَ خَطِّيًّا، وَأَرَاحَ عَلَيَّ نَعَمًا ثَرِيًّا، وَأَعْطَانِي مِنْ كُلِّ رَائِحَةٍ زَوْجًا، وَقَالَ‏:‏ كُلِي أُمَّ زَرْعٍ، وَمِيرِي أَهْلَكِ، فَلَوْ جَمَعْتُ كُلَّ شَيْءٍ أَعْطَانِيهِ، مَا بَلَغَ أَصْغَرَ آنِيَةِ أَبِي زَرْعٍ قَالَتْ عَائِشَةُ‏:‏ فَقَالَ لِي رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ كُنْتُ لَكِ كَأَبِي زَرْعٍ لأُمِّ زَرْعٍ‏.‏","english":{"narrator":"'A’isha said:","text":"\"Eleven women sat together and agreed that they would not conceal anything pertaining to their husbands. .”\n‘The second said: “I do not broadcast my husbands story ”\n‘The third said: “My husband is extremely tall and ill- natured ”\n‘The fourth said: “My husband is like the night of Tihama .”\n‘The fifth said: “If my husband comes in, he is relaxed like the lynx .\n‘The sixth said: “If my husband eats, he gorges and mixes all sorts of food .”\n‘The seventh said: “My husband is incompetent , sick with\nevery sickness ”\n‘The eighth said: “My husband is softness, the softness of a rabbit ”\n‘The ninth said: “My husband is of lofty status .”\n‘The tenth said: “My husband is Malik, and what is Malik? Malik is better than that. ”\n‘The eleventh said: “My husband is Abu Zar\", and what about Abu Zar'? He has made my ears dangle with jewelry. He has filled my upper arms with fat. He has made me happy, so my soul has become happy with me. He found me among the owners of little sheep and goats, in dire straits, so he put me among the owners of neighing . I therefore speak in his presence, for I shall not be rebuked. I sleep soundly until the morning arrives, and I shall drink until I satisfy my thirst.\n“The mother of Abu Zar so what about the mother of Abu Zar? Her bundles  are heavy, and her house is spacious.\n“The son of Abu Zar so what about the son of Abu Zar? His couch is like a palm-stick stripped of its leaves , and the foreleg of the lamb fills his stomach.\n“The daughter of Abu Zar, so what about the daughter of Abu Zar? She is obedient to her father and obedient to her mother. She fits perfectly into her clothes, and she is the rage of her female neighbor.\n“The maidservant of Abu Zar so what about the maidservant of Abu Zar? She does not broadcast our speech, nor does she scatter our provisions, nor does she fill our home with treachery and slander.”\n‘She said: “Abu Zar\" went out while the milkskins were being churned, and so he encountered a woman accompanied by two children of hers. Like a pair of lynxes, they were playing below her waist with a couple of lumps shaped like pomegranates. He therefore divorced me and married her, so I married a nobly generous man. He rode a sturdy horse and held a spear. He endowed me with rich benefits, and gave me a couple of every perfume. He said: ‘Eat, Umm Zar, and feed your relatives!’ Yet even if I collected everything that he gave me, it would not amount to the smallest of the vessels of Abu Zar'!”\n'A'isha said (may Allah be well pleased with her): “Allah’s Messenger (Allah bless him and give him peace) said to me: ‘I have been to you as Abu Zar was to Umm Zar'.”"}}],"chapter":{"id":38,"bookId":16,"arabic":"حديث أم زرع","english":"Hadith of Umm Zar`"}}