{"metadata":{"length":25,"arabic":{"title":"الشمائل المحمدية","author":"الإمام الترمذي","introduction":"باب ما جاء في عبادة النبي صلى الله عليه وسلم"},"english":{"title":"Shama'il Muhammadiyah","author":"Imam Tirmidhi","introduction":"Worship And Devotion Of Rasoolullah"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":40,"bookId":16,"arabic":"حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَبِشْرُ بْنُ مُعَاذٍ، قَالا‏:‏ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ زِيَادِ بْنِ عِلاقَةَ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، قَالَ‏:‏ صَلَّى رَسُولُ اللهِ صلى الله عليه وسلم، حَتَّى انْتَفَخَتْ قَدَمَاهُ، فَقِيلَ لَهُ‏:‏ أَتَتَكَلَّفُ هَذَا، وَقَدْ غَفَرَ اللَّهُ لَكَ مَا تَقَدَّمَ مِنْ ذَنْبِكَ وَمَا تَأَخَّرَ‏؟‏ قَالَ‏:‏ أَفَلا أَكُونُ عَبْدًا شَكُورًا‏.‏","english":{"narrator":"Al-Mughira ibn Shu'ba said (may Allah be well pleased with him):","text":"\"Allah’s Messenger (Allah bless him and give him peace) performed the ritual prayer until his feet became swollen, so he was asked: 'Must you burden yourself with this, when\nAllah has already forgiven you your former and your latter sins?' He replied: 'Shall I not be a thankful servant?'”"}},{"id":2,"idInBook":2,"chapterId":40,"bookId":16,"arabic":"حَدَّثَنَا أَبُو عَمَّارٍ الْحُسَيْنُ بْنُ حُرَيْثٍ، قَالَ‏:‏ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ‏:‏ كَانَ رَسُولُ اللهِ صلى الله عليه وسلم، يُصَلِّي حَتَّى تَرِمَ قَدَمَاهُ، قَالَ‏:‏ فَقِيلَ لَهُ‏:‏ أَتَفْعَلُ هَذَا وَقَدْ جَاءَكَ أَنَّ اللَّهَ تَعَالَى قَدْ غَفَرَ لَكَ مَا تَقَدَّمَ مِنْ ذَنْبِكَ وَمَا تَأَخَّرَ‏؟‏ قَالَ‏:‏ أَفَلا أَكُونُ عَبْدًا شَكُورًا‏.‏","english":{"narrator":"Abu Huraira said (may Allah be well pleased with him):","text":"\"Allah’s Messenger (Allah bless him and give him peace) used to perform the ritual prayer until his feet had begun to swell, so he was asked: 'Must you do this, when it has come to you that Allah has already forgiven you your former and your latter sins?’ He replied: 'Shall I not be a thankful servant?'”"}},{"id":3,"idInBook":3,"chapterId":40,"bookId":16,"arabic":"حَدَّثَنَا عِيسَى بْنُ عُثْمَانَ بْنِ عِيسَى بْنِ عَبْدِ الرَّحْمَنِ الرَّمْلِيُّ، قَالَ‏:‏ حَدَّثَنَا عَمِّي يَحْيَى بْنُ عِيسَى الرَّمْلِيُّ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ‏:‏ كَانَ رَسُولُ اللهِ صلى الله عليه وسلم يَقُومُ يُصَلِّي حَتَّى تَنْتَفِخَ قَدَمَاهُ فَيُقَالُ لَهُ‏:‏ يَا رَسُولَ اللهِ، تَفْعَلُ هَذَا وَقَدْ غَفَرَ اللَّهُ لَكَ مَا تَقَدَّمَ مِنْ ذَنْبِكَ وَمَا تَأَخَّرَ‏؟‏، قَالَ‏:‏ أَفَلا أَكُونُ عَبْدًا شَكُورًا‏.‏","english":{"narrator":"It is also reported from Abu Huraira, may Allah be well pleased with him that:","text":"Allah’s Messenger (Allah bless him and give him peace) used to stand performing the ritual prayer until his feet had begun to swell, so he would be asked: “O Messenger of Allah, must you do this, when Allah has already forgiven you your former and your latter sins?” He replied: “Shall I not be a thankful servant?”"}},{"id":4,"idInBook":4,"chapterId":40,"bookId":16,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، عَنِ الأَسْوَدِ بْنِ يَزِيدَ، قَالَ‏:‏ سَأَلْتُ عَائِشَةَ، عَنْ صَلاةِ رَسُولِ اللهِ صلى الله عليه وسلم بِاللَّيْلِ‏؟‏ فَقَالَتْ‏:‏ كَانَ يَنَامُ أَوَّلَ اللَّيْلِ ثُمَّ يَقُومُ، فَإِذَا كَانَ مِنَ السَّحَرِ أَوْتَرَ، ثُمَّ أَتَى فِرَاشَهُ، فَإِذَا كَانَ لَهُ حَاجَةٌ أَلَمَّ بِأَهْلِهِ، فَإِذَا سَمِعَ الأَذَانَ وَثَبَ، فَإِنْ كَانَ جُنُبًا أَفَاضَ عَلَيْهِ مِنَ الْمَاءِ، وَإِلا تَوَضَّأَ وَخَرَجَ إِلَى الصَّلاةِ‏.‏","english":{"narrator":"Al-Aswad ibn Yazid said:","text":"“I asked 'A'sha (may Allah be well pleased with her) about the nighttime ritual prayer of Allah’s Messenger (Allah bless him and give him peace), so she said: ‘He used to sleep at the beginning of the night. Then he would get up, and when it was the time before daybreak, he performed a witr . Then he came to his\nmattress, and if he had a need, he had sexual intercourse with his wife. When he heard the call to prayer, he sprang up, and if he was in a state of major ritual impurity, he poured\nwater over himself, and if not, he performed the minor ritual ablution and went out to the ritual prayer.”"}},{"id":5,"idInBook":5,"chapterId":40,"bookId":16,"arabic":"حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكِ بْنِ أَنَسٍ ‏(‏ح‏)‏ وَحَدَّثَنَا إِسْحَاقُ بْنُ مُوسَى الأَنْصَارِيُّ، قَالَ‏:‏ حَدَّثَنَا مَعْنٌ، عَنْ مَالِكٍ، عَنْ مَخْرَمَةَ بْنِ سُلَيْمَانَ، عَنْ كُرَيْبٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّهُ أَخْبَرَهُ، أَنَّهُ بَاتَ عِنْدَ مَيْمُونَةَ وَهِيَ خَالَتُهُ، قَالَ‏:‏ فَاضْطَجَعْتُ فِي عَرْضِ الْوِسَادَةِ، وَاضْطَجَعَ رَسُولُ اللهِ صلى الله عليه وسلم فِي طُولِهَا، فَنَامَ رَسُولُ اللهِ صلى الله عليه وسلم، حَتَّى إِذَا انْتَصَفَ اللَّيْلُ أَوْ قَبْلَهُ بِقَلِيلٍ أَوْ بَعْدَهُ بِقَلِيلٍ، فَاسْتَيْقَظَ رَسُولُ اللهِ صلى الله عليه وسلم، فَجَعَلَ يَمْسَحُ النَّوْمَ عَنْ وَجْهِهِ، ثُمَّ قَرَأَ الْعَشْرَ الآيَاتِ الْخَوَاتِيمَ مِنْ سُورَةِ آلِ عِمْرَانَ، ثُمَّ قَامَ إِلَى شَنٍّ مُعَلَّقٍ فَتَوَضَّأَ مِنْهَا، فَأَحْسَنَ الْوُضُوءَ، ثُمَّ قَامَ يُصَلِّي، قَالَ عَبْدُ اللهِ بْنُ عَبَّاسٍ‏:‏ فَقُمْتُ إِلَى جَنْبِهِ فَوَضَعَ رَسُولُ اللهِ صلى الله عليه وسلم، يَدَهُ الْيُمْنَى عَلَى رَأْسِي ثُمَّ أَخَذَ بِأُذُنِي الْيُمْنَى، فَفَتَلَهَا فَصَلَّى رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، ثُمَّ رَكْعَتَيْنِ، قَالَ مَعْنٌ‏:‏ سِتَّ مَرَّاتٍ ثُمَّ أَوْتَرَ، ثُمَّ اضْطَجَعَ حَتَّى جَاءَهُ الْمُؤَذِّنُ، فَقَامَ فَصَلَّى رَكْعَتَيْنِ خَفِيفَتَيْنِ، ثُمَّ خَرَجَ فَصَلَّى الصُّبْحَ‏.‏","english":{"narrator":"Ibn 'Abbas informed him that he spent the night in the home of Maimuna, his maternal aunt and he said:","text":"\"I reclined across the cushion and Allah’s\tMessenger (Allah bless him and give him peace) reclined lengthwise, whereupon Allah’s Messenger (Allah bless him and give him peace) slept until the middle of the night, or a little while before or after it. Allah’s Messenger (Allah bless him and give him peace) then woke up, wiped the sleep off his face, and recited the final ten verses of the Sura of the Family of ‘Imran\n. Then he approached a suspended waterskin, performed the minor ritual ablution and performed it well, after which he performed the ritual prayer.”\nAbdullah ibn 'Abbas said: “I got up and stood by his side, whereupon Allah’s Messenger (Allah bless him and give him peace) placed his right hand on my head, gripped my right ear and twisted it. After this he performed two cycles of ritual prayer, then two more cycles, then two more cycles, then two more cycles, then two more cycles, then two more cycles..” He (Ma'an) said: “... six times, after which he performed an odd-numbered cycle. Then he reclined until the muezzin came to him, whereupon he got up and performed two abbreviated cycles. Then he went out and performed the early-morning ritual prayer\"."}},{"id":6,"idInBook":6,"chapterId":40,"bookId":16,"arabic":"حَدَّثَنَا أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلاءِ، قَالَ‏:‏ حَدَّثَنَا وَكِيعٌ، عَنْ شُعْبَةَ، عَنْ أَبِي جَمْرَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ‏:‏ كَانَ النَّبِيُّ صلى الله عليه وسلم يُصَلِّي مِنَ اللَّيْلِ ثَلاثَ عَشْرَةَ رَكْعَةً‏.‏","english":{"narrator":"Ibn 'Abbas said:","text":"\"The Prophet (Allah bless him and give him peace) used to perform thirteen cycles of ritual prayer during the night.”"}},{"id":7,"idInBook":7,"chapterId":40,"bookId":16,"arabic":"حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ‏:‏ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنْ زُرَارَةَ بْنِ أَوْفَى، عَنْ سَعْدِ بْنِ هِشَامٍ، عَنْ عَائِشَةَ‏:‏ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ إِذَا لَمْ يُصَلِّ بِاللَّيْلِ، مَنَعَهُ مِنْ ذَلِكَ النَّوْمُ، أَوْ غَلَبَتْهُ عَيْنَاهُ، صَلَّى مِنَ النَّهَارِ ثِنْتَيْ عَشْرَةَ رَكْعَةً‏.‏","english":{"narrator":"A’isha said:","text":"\"If the Prophet (Allah bless him and give him peace) did not perform the ritual prayer during the night, because sleep had prevented him, or his eyes had been too weary, during the daytime, he would perform twelve cycles of ritual prayer during the daytime.”"}},{"id":8,"idInBook":8,"chapterId":40,"bookId":16,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاءِ، قَالَ‏:‏ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ يَعْنِي ابْنَ حَسَّانَ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم، قَالَ‏:‏ إِذَا قَامَ أَحَدُكُمْ مِنَ اللَّيْلِ فَلْيَفْتَتِحْ صَلاتَهُ بِرَكْعَتَيْنِ خَفِيفَتَيْنِ‏.‏","english":{"narrator":"Abu Huraira said:","text":"\"The Prophet said (Allah bless him and give him peace): 'If one of you gets up during the night, let him begin his ritual prayer with two abbreviated cycles.'”"}},{"id":9,"idInBook":9,"chapterId":40,"bookId":16,"arabic":"حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكِ بْنِ أَنَسٍ ‏(‏ح‏)‏ وَحَدَّثَنَا إِسْحَاقُ بْنُ مُوسَى، قَالَ‏:‏ حَدَّثَنَا مَعْنٌ، قَالَ‏:‏ حَدَّثَنَا مَالِكٌ، عَنْ عَبْدِ اللهِ بْنِ أَبِي بَكْرٍ، عَنْ أَبِيهِ، أَنَّ عَبْدَ اللهِ بْنَ قَيْسِ بْنِ مَخْرَمَةَ أَخْبَرَهُ، عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ، أَنَّهُ قَالَ‏:‏ لأَرْمُقَنَّ صَلاةَ النَّبِيِّ صلى الله عليه وسلم، فَتَوَسَّدْتُ عَتَبَتَهُ، أَوْ فُسْطَاطَهُ فَصَلَّى رَسُولُ اللهِ صلى الله عليه وسلم، رَكْعَتَيْنِ خَفِيفَتَيْنِ، ثُمَّ صَلَّى رَكْعَتَيْنِ طَوِيلَتَيْنِ، طَوِيلَتَيْنِ، طَوِيلَتَيْنِ، ثُمَّ صَلَّى رَكْعَتَيْنِ وَهُمَا دَونَ اللَّتَيْنِ قَبْلَهُمَا، ثُمَّ صَلَّى رَكْعَتَيْنِ وَهُمَا دُونَ اللَّتَيْنِ قَبْلَهُمَا، ثُمَّ صَلَّى رَكْعَتَيْنِ وَهُمَا دُونَ اللَّتَيْنِ قَبْلَهُمَا، ثُمَّ صَلَّى رَكْعَتَيْنِ وَهُمَا دُونَ اللَّتَيْنِ قَبْلَهُمَا، ثُمَّ أَوْتَرَ فَذَلِكَ ثَلاثَ عَشْرَةَ رَكْعَةً‏.‏","english":{"narrator":"Zaid ibn Khalid al-jahuhani said:","text":"“Determined to contemplate the ritual prayer of the Prophet (Allah bless him and give him peace) intently, for I laid my head on his doorstep or  his hair tent. Allah’s Messenger (Allah bless him and give him peace) then performed two brisk cycles of ritual prayer. After this he performed two long, long, long cycles. Then he performed two cycles that were shorter than the two before them. Then he performed two cycles that were shorter than the two that were before them. Then he performed two cycles that were shorter than the two that preceded them. Then he performed two cycles that were shorter than the two that were before them. Finally he performed a single-numbered cycle, which added up to a total of thirteen cycles.”"}},{"id":10,"idInBook":10,"chapterId":40,"bookId":16,"arabic":"حَدَّثَنَا إِسْحَاقُ بْنُ مُوسَى، قَالَ‏:‏ حَدَّثَنَا مَعْنٌ، قَالَ‏:‏ حَدَّثَنَا مَالِكٌ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّهُ أَخْبَرَهُ أَنَّهُ سَأَلَ عَائِشَةَ، كَيْفَ كَانَتْ صَلاةُ رَسُولِ اللهِ صلى الله عليه وسلم فِي رَمَضَانَ‏؟‏ فَقَالَتْ‏:‏ مَا كَانَ رَسُولُ اللهِ صلى الله عليه وسلم لِيَزِيدَ فِي رَمَضَانَ وَلا فِي غَيْرِهِ عَلَى إِحْدَى عَشْرَةَ رَكْعَةً، يُصَلِّي أَرْبَعًا، لا تَسْأَلْ عَنْ حُسْنِهِنَّ، وَطُولِهِنَّ، ثُمَّ يُصَلِّي أَرْبَعًا لا تَسْأَلْ عَنْ حُسْنِهِنَّ وَطُولِهِنَّ، ثُمَّ يُصَلِّي ثَلاثًا، قَالَتْ عَائِشَةُ‏:‏ قُلْتُ‏:‏ يَا رَسُولَ اللهِ، أَتَنَامُ قَبْلَ أَنْ تُوتِرَ‏؟‏ فَقَالَ‏:‏ يَا عَائِشَةُ، إِنَّ عَيْنَيَّ تَنَامَانِ، وَلا يَنَامُ قَلْبِي‏.‏","english":{"narrator":"Abu Salama ibn 'Abd ar-Rahman asked 'A’isha (may Allah the Exalted be well pleased with her):","text":"“How was the ritual prayer of Allah’s Messenger (Allah bless him and give him peace) during Ramadan?” so she said: “Neither in Ramadan nor in any other month would Allah’s Messenger (Allah bless him and give him peace) add to the total of eleven cycles of  ritual prayer. He would perform four — do not ask about their excellence or their length — then he would perform four — do not ask about their excellence or their length — and then he would perform three.”\n‘A'isha said (may Allah the Exalted be well pleased with her): “I said: ‘O Messenger of Allah, do you sleep before you perform the odd-numbered ritual prayer ?' He said: ‘O 'A'isha, my eyes may sleep, but my heart does not sleep!’”"}},{"id":11,"idInBook":11,"chapterId":40,"bookId":16,"arabic":"حَدَّثَنَا إِسْحَاقُ بْنُ مُوسَى، قَالَ‏:‏ حَدَّثَنَا مَعْنٌ، قَالَ‏:‏ حَدَّثَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ‏:‏ أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم، كَانَ يُصَلِّي مِنَ اللَّيْلِ إِحْدَى عَشْرَةَ رَكْعَةً، يُوتِرُ مِنْهَا بِوَاحِدَةٍ، فَإِذَا فَرَغَ مِنْهَا، اضْطَجَعَ عَلَى شِقِّهِ الأَيْمَنِ‏.‏","english":{"narrator":"'A’isha said (may Allah be well pleased with her):","text":"“Allah’s Messenger (Allah bless him and give him peace) used to perform eleven cycles of ritual prayer during the night, making one of them odd-numbered , and when he had finished, he would recline on his right side.”"}},{"id":12,"idInBook":12,"chapterId":40,"bookId":16,"arabic":"حَدَّثَنَا ابْنُ أَبِي عُمَرَ، قَالَ‏:‏ حَدَّثَنَا مَعْنٌ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، نَحْوَهُ ‏(‏ح‏)‏ وَحَدَّثَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، نَحْوَهُ‏.‏","english":{"narrator":"","text":"Two other chains have narrations similar to the previous one."}},{"id":13,"idInBook":13,"chapterId":40,"bookId":16,"arabic":"حَدَّثَنَا هَنَّادٌ، قَالَ‏:‏ حَدَّثَنَا أَبُو الأَحْوَصِ، عَنِ الأَعْمَشِ، عَنِ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ‏:‏ كَانَ رَسُولُ اللهِ صلى الله عليه وسلم، يُصَلِّي مِنَ اللَّيْلِ تِسْعَ رَكَعَاتٍ‏.‏\n\nحَدَّثَنَا مَحْمُودُ بْنُ غَيْلانَ، قَالَ‏:‏ حَدَّثَنَا يَحْيَى بْنُ آدَمَ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ الثَّوْرِيُّ، عَنِ الأَعْمَشِ، نَحْوَهُ‏.‏","english":{"narrator":"'A’isha said:","text":"\"Allah’s Messenger (Allah bless him and give him peace) used to perform nine cycles of ritual prayer during the night.”"}},{"id":14,"idInBook":14,"chapterId":40,"bookId":16,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ أَبِي حَمْزَةَ، رَجُلٍ مِنَ الأَنْصَارِ، عَنْ رَجُلٍ مِنْ بَنِي عَبْسٍ، عَنْ حُذَيْفَةَ بْنِ الْيَمَانِ، أَنَّهُ صَلَّى مَعَ النَّبِيِّ صلى الله عليه وسلم مِنَ اللَّيْلِ، قَالَ‏:‏ فَلَمَّا دَخَلَ فِي الصَّلاةِ، قَالَ‏:‏ اللَّهُ أَكْبَرُ ذُو الْمَلَكُوتِ وَالْجَبَرُوتِ، وَالْكِبْرِيَاءِ وَالْعَظَمَةِ، قَالَ‏:‏ ثُمَّ قَرَأَ الْبَقَرَةَ، ثُمَّ رَكَعَ رُكُوعَهُ نَحْوًا مِنْ قِيَامِهِ، وَكَانَ يَقُولُ‏:‏ سُبْحَانَ رَبِّيَ الْعَظِيمِ، سُبْحَانَ رَبِّيَ الْعَظِيمِ ثُمَّ رَفَعَ رَأْسَهُ، فَكَانَ قِيَامُهُ نَحْوًا مِنْ رُكُوعِهِ، وَكَانَ يَقُولُ‏:‏ لِرَبِّيَ الْحَمْدُ، لِرَبِّيَ الْحَمْدُ ثُمَّ سَجَدَ، فَكَانَ سُجُودُهُ نَحْوًا مِنْ قِيَامِهِ، وَكَانَ يَقُولُ‏:‏ سُبْحَانَ رَبِّيَ الأَعْلَى، سُبْحَانَ رَبِّيَ الأَعْلَى ثُمَّ رَفَعَ رَأْسَهُ، فَكَانَ مَا بَيْنَ السَّجْدَتَيْنِ نَحْوًا مِنَ السُّجُودِ، وَكَانَ يَقُولُ‏:‏ رَبِّ اغْفِرْ لِي، رَبِّ اغْفِرْ لِي حَتَّى قَرَأَ الْبَقَرَةَ، وَآلَ عِمْرَانَ، وَالنِّسَاءَ، وَالْمَائِدَةَ، أَوِ الأَنْعَامَ، شُعْبَةُ الَّذِي شَكَّ فِي الْمَائِدَةِ، وَالأَنْعَامِ‏.‏","english":{"narrator":"Hudhaifa ibn al-Yaman (may Allah be well pleased with him) performed the ritual prayer with the Prophet (Allah bless him and give him peace) during the night, and he said:","text":"“When he entered into the ritual prayer, he said: ‘Allah is Supremely Great .”\nAccording to Abu 'Isa: “Shu'ba is the one who entertained doubts about  al-Ma'ida and al- Anam.\""}},{"id":15,"idInBook":15,"chapterId":40,"bookId":16,"arabic":"حَدَّثَنَا أَبُو بَكْرٍ مُحَمَّدُ بْنُ نَافِعٍ الْبَصْرِيُّ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ، عَنِ إِسْمَاعِيلَ بْنِ مُسْلِمٍ الْعَبْدِيِّ، عَنْ أَبِي الْمُتَوَكِّلِ، عَنْ عَائِشَةَ، قَالَتْ‏:‏ قَامَ رَسُولُ اللهِ صلى الله عليه وسلم بِآيَةٍ مِنَ الْقُرْآنِ لَيْلَةً‏.‏","english":{"narrator":"'A’isha said (may Allah be well pleased with her):","text":"\"Allah’s Messenger (Allah bless him and give him peace) spent one whole night reciting a verse from the Qur’an.”\n\n\nCommentary:\nThe aayah is the last aayah of Surah Maa-idah:In tu-adh-dhib-hum fa-innahum 'ibaaduk. Wa in tagh-fir lahum fa-innaka antal azizul hakim.Translation: \"If Thou punish them, lo! they are Thy slaves, and if Thou forgive them, (lo! the are Thy slaves).Lo! Thou, only Thou, art Mighty, the wise\".Surah Maa-idah, 118.The Being that possesses great power, if He wills, He may forgive the criminal. The One that is all Wise, there is Wisdom and benefit in every act of His. The reason for Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam reciting this aayah while standing and also in the ruku and sajdah, and repeating it many times, is to bring to mind the two attributes of Allah, namely the attributes of justice and forgiveness. The whole scene on the day of qiyaamah will be of these two things. It is stated that Imaam Aa'zam Abu Hanifah RA. also recited the following aayah the whole night:Wamtaazul yauma ayyuhal mujrimun.Translation: \"But avaunt ye, O ye guilty, this day!\" Surah Yaseen, 58.In this aayah too the scene of qiyaamah is portrayed. That today the sinners should separate and distinguish themselves. What a severe and nerve-chilling command this is. Today they are together with the pious and holy people and benefiting from the barakaat (blessings) they receive, but at this moment the sinners will be separated from them. May the Most Merciful Allah with His Grace keep those pious souls under His shadow, otherwise it is really a time for great trials."}},{"id":16,"idInBook":16,"chapterId":40,"bookId":16,"arabic":"حَدَّثَنَا مَحْمُودُ بْنُ غَيْلانَ، قَالَ‏:‏ حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللهِ بْنِ مَسْعُودٍ، قَالَ‏:‏ صَلَّيْتُ لَيْلَةً مَعَ رَسُولِ اللهِ صلى الله عليه وسلم فَلَمْ يَزَلْ قَائِمًا حَتَّى هَمَمْتُ بِأَمْرِ سُوءٍ قِيلَ لَهُ‏:‏ وَمَا هَمَمْتَ بِهِ‏؟‏ قَالَ‏:‏ هَمَمْتُ أَنْ أَقْعُدَ وَأَدَعَ النَّبِيَّ صلى الله عليه وسلم‏.‏\n\nحَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ، قَالَ‏:‏ حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، نَحْوَهُ‏.‏","english":{"narrator":"'Abdullah said:","text":"“I performed the ritual prayer one night with Allah’s Messenger (All^ bless him and give him peace), and he remained standing until I almost did something bad.” He was asked: “What did you almost do?” He replied: “I nearly sat down and left the Prophet (Allah bless him and give him peace) in the lurch!”"}},{"id":17,"idInBook":17,"chapterId":40,"bookId":16,"arabic":"حَدَّثَنَا إِسْحَاقُ بْنُ مُوسَى الأَنْصَارِيُّ، قَالَ‏:‏ حَدَّثَنَا مَعْنٌ، قَالَ‏:‏ حَدَّثَنَا مَالِكٌ، عَنْ أَبِي النَّضْرِ، عَنْ أَبِي سَلَمَةَ، عَنْ عَائِشَةَ‏:‏ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يُصَلِّي جَالِسًا، فَيَقْرَأُ وَهُوَ جَالِسٌ، فَإِذَا بَقِيَ مِنْ قِرَاءَتِهِ قَدْرُ مَا يَكُونُ ثَلاثِينَ أَوْ أَرْبَعِينَ آيَةً، قَامَ فَقَرَأَ وَهُوَ قَائِمٌ، ثُمَّ رَكَعَ وَسَجَدَ، ثُمَّ صَنَعَ فِي الرَّكْعَةِ الثَّانِيَةِ مِثْلَ ذَلِكَ‏.‏","english":{"narrator":"'A’isha said (may Allah be well pleased with her):","text":"“The Prophet (Allah bless him and give him peace) used to perform the ritual prayer sitting down, so he would also recite the Qur’an while he was seated. If the amount of his recitation remaining was thirty or forty verses, he would rise and recite standing up, and then he would bow and prostrate. Then he would do likewise in the second cycle.”"}},{"id":18,"idInBook":18,"chapterId":40,"bookId":16,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، قَالَ‏:‏ حَدَّثَنَا هُشَيْمٌ، قَالَ‏:‏ حَدَّثَنَا خَالِدٌ الْحَذَّاءُ، عَنْ عَبْدِ اللهِ بْنِ شَقِيقٍ، قَالَ‏:‏ سَأَلْتُ عَائِشَةَ، عَنْ صَلاةِ رَسُولِ اللهِ صلى الله عليه وسلم، عَنْ تَطَوُّعِهِ، فَقَالَتْ‏:‏ كَانَ يُصَلِّي لَيْلا طَوِيلا قَائِمًا، وَلَيْلا طَوِيلا قَاعِدًا، فَإِذَا قَرَأَ وَهُوَ قَائِمٌ رَكَعَ وَسَجَدَ وَهُوَ قَائِمٌ، وَإِذَا قَرَأَ وَهُوَ جَالِسٌ رَكَعَ وَسَجَدَ وَهُوَ جَالِسٌ‏.‏","english":{"narrator":"'Abdullah ibn Shaqiq said:","text":"“I asked 'A’isha (may Allah be well pleased with her) about the voluntary ritual prayers of Allah’s Messenger (Allah bless him and give him peace), and she said: ‘He used to spend a long night performing the ritual prayer while standing, and a long night while sitting, so if he recited the Qur’an while standing, he would bow and prostrate from a standing position, and if he recited while sitting, he would bow and prostrate from a sitting position.”"}},{"id":19,"idInBook":19,"chapterId":40,"bookId":16,"arabic":"حَدَّثَنَا إِسْحَاقُ بْنُ مُوسَى الأَنْصَارِيُّ، قَالَ‏:‏ حَدَّثَنَا مَعْنٌ، قَالَ‏:‏ حَدَّثَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنِ السَّائِبِ بْنِ يَزِيدَ، عَنِ الْمُطَّلِبِ بْنِ أَبِي وَدَاعَةَ، عَنْ حَفْصَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم، قَالَتْ‏:‏ كَانَ رَسُولُ اللهِ يُصَلِّي فِي سُبْحَتِهِ قَاعِدًا، وَيَقْرَأُ بِالسُّورَةِ وَيُرَتِّلُهَا، حَتَّى تَكُونَ أَطْوَلَ مِنْ أَطْوَلَ مِنْهَا‏.‏","english":{"narrator":"Hafsa, the wife of the Prophet (Allah bless him and give him peace), said:","text":"“Allah’s Messenger (Allah bless him and give him peace) used to perform voluntary ritual prayer sitting down , and he would recite the Sura and pronounce it slowly, so that it would seem to be longer than one that was actually longer than it.”"}},{"id":20,"idInBook":20,"chapterId":40,"bookId":16,"arabic":"حَدَّثَنَا الْحَسَنُ بْنُ مُحَمَّدٍ الزَّعْفَرَانِيُّ، قَالَ‏:‏ حَدَّثَنَا الْحَجَّاجُ بْنُ مُحَمَّدٍ، عَنِ ابْنِ جُرَيْجٍ، قَالَ‏:‏ أَخْبَرَنِي عُثْمَانُ بْنُ أَبِي سُلَيْمَانَ، أَنَّ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ أَخْبَرَهُ، أَنَّ عَائِشَةَ أَخْبَرَتْهُ، أَنَّ النَّبِيَّ صلى الله عليه وسلم، لَمْ يَمُتْ، حَتَّى كَانَ أَكْثَرُ صَلاتِهِ وَهُوَ جَالِسٌ‏.‏","english":{"narrator":"A’isha said (may Allah be well pleased with her):","text":"“By the time the Prophet (Allah bless him and give him peace) died, he was performing most of his ritual prayers from a sitting position.”"}},{"id":21,"idInBook":21,"chapterId":40,"bookId":16,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، قَالَ‏:‏ حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، قَالَ‏:‏ حَدَّثَنَا أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ‏:‏ صَلَّيْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم، رَكْعَتَيْنِ قَبْلَ الظُّهْرِ، وَرَكْعَتَيْنِ بَعْدَهَا، وَرَكْعَتَيْنِ بَعْدَ الْمَغْرِبِ فِي بَيْتِهِ، وَرَكْعَتَيْنِ بَعْدَ الْعِشَاءِ فِي بَيْتِهِ‏.‏","english":{"narrator":"Ibn ‘'Umar said (may Allah be well pleased with him and his father):","text":"\"I performed two cycles of ritual prayer with Allah’s Messenger (Allah bless him and give him peace) before the noon prayer, and two cycles after it, and two cycles after the sunset prayer in his house, and two cycles after the evening prayer in his house.”"}},{"id":22,"idInBook":22,"chapterId":40,"bookId":16,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، قَالَ‏:‏ حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، قَالَ‏:‏ حَدَّثَنَا أَيُّوبُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ‏:‏ حَدَّثَتْنِي حَفْصَةُ‏:‏ أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم، كَانَ يُصَلِّي رَكْعَتَيْنِ حِينَ يَطْلُعُ الْفَجْرُ وَيُنَادِي الْمُنَادِي، قَالَ أَيُّوبُ‏:‏ وَأُرَاهُ، قَالَ‏:‏ خَفِيفَتَيْنِ‏.‏","english":{"narrator":"Ibn 'Umar said (may Allah be well pleased with him and his father):","text":"“Hafsa said:\n'Allah’s Messenger (Allah bless him and give him peace) used to perform two cycles of ritual prayer when the dawn was rising, and the caller  was calling'. And Ayyub said, “I think he described the two prayer cycles as abbreviated.”"}},{"id":23,"idInBook":23,"chapterId":40,"bookId":16,"arabic":"حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ‏:‏ حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ الْفَزَارِيُّ، عَنْ جَعْفَرِ بْنِ بُرْقَانَ، عَنْ مَيْمُونِ بْنِ مِهْرَانَ، عَنِ ابْنِ عُمَرَ، قَالَ‏:‏ حَفِظْتُ مِنْ رَسُولِ اللهِ صلى الله عليه وسلم، ثَمَانِيَ رَكَعَاتٍ‏:‏ رَكْعَتَيْنِ قَبْلَ الظُّهْرِ، وَرَكْعَتَيْنِ بَعْدَهَا، وَرَكْعَتَيْنِ بَعْدَ الْمَغْرِبِ، وَرَكْعَتَيْنِ بَعْدَ الْعِشَاءِ، قَالَ ابْنُ عُمَرَ‏:‏ وَحَدَّثَتْنِي حَفْصَةُ بِرَكْعَتَيِ الْغَدَاةِ، وَلَمْ أَكُنْ أَرَاهُمَا مِنَ النَّبِيِّ صلى الله عليه وسلم‏.‏","english":{"narrator":"Ibn 'Umar said (may Allah be well pleased with him and his father):","text":"\"I recall eight cycles performed by Allah’s Messenger (Allah bless him and give him peace): two cycles before the noon prayer and two cycles after it, two cycles after the sunset prayer, and two cycles after the evening prayer.”\nIbn ‘Umar said: “Hafsa also told me about the two cycles of the early-morning prayer , but I did not see them performed by the Prophet (Allah bless him and give him peace).”"}},{"id":24,"idInBook":24,"chapterId":40,"bookId":16,"arabic":"حَدَّثَنَا أَبُو سَلَمَةَ يَحْيَى بْنُ خَلَفٍ، قَالَ‏:‏ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ عَبْدِ اللهِ بْنِ شَقِيقٍ، قَالَ‏:‏ سَأَلتُ عَائِشَةَ، عَنْ صَلاةِ النَّبِيِّ صلى الله عليه وسلم، قَالَتْ‏:‏ كَانَ يُصَلِّي قَبْلَ الظُّهْرِ رَكْعَتَيْنِ وَبَعْدَهَا رَكْعَتَيْنِ، وَبَعْدَ الْمَغْرِبِ رَكْعَتَيْنِ، وَبَعْدَ الْعِشَاءِ رَكْعَتَيْنِ، وَقَبْلَ الْفَجْرِ ثِنْتَيْنِ‏.‏","english":{"narrator":"Abdullah ibn Shaqiq said:","text":"\"I asked 'A’isha (may Allah be well pleased with her) about the ritual prayer of Allah’s Messenger (Allah bless him and give him peace), and she said: 'He used to perform two cycles of ritual prayer before the noon prayer and two cycles after it, two cycles after the\nsunset prayer, two cycles after the evening prayer, and two before the dawn prayer.’”"}},{"id":25,"idInBook":25,"chapterId":40,"bookId":16,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، قَالَ‏:‏ سَمِعْتُ عَاصِمَ بْنَ ضَمْرَةَ، يَقُولُ‏:‏ سَأَلْنَا عَلِيًّا، عَنْ صَلاةِ رَسُولِ اللهِ صلى الله عليه وسلم مِنَ النَّهَارِ، فَقَالَ‏:‏ إِنَّكُمْ لا تُطِيقُونَ ذَلِكَ، قَالَ‏:‏ فَقُلْنَا‏:‏ مِنْ أَطَاقَ ذَلِكَ مِنَّا صَلَّى، فَقَالَ‏:‏ كَانَ إِذَا كَانَتِ الشَّمْسُ مِنْ هَهُنَا كَهَيْئَتِهَا مِنْ هَهُنَا عِنْدَ الْعَصْرِ صَلَّى رَكْعَتَيْنِ، وَإِذَا كَانَتِ الشَّمْسُ مِنْ هَهُنَا، كَهَيْئَتِهَا مِنْ هَهُنَا عِنْدَ الظُّهْرِ صَلَّى أَرْبَعًا، وَيُصَلِّي قَبْلَ الظُّهْرِ أَرْبَعًا، وَبَعْدَهَا رَكْعَتَيْنِ، وَقَبْلَ الْعَصْرِ أَرْبَعًا، يَفْصِلُ بَيْنَ كُلِّ رَكْعَتَيْنِ بِالتَّسْلِيمِ عَلَى الْمَلائِكَةِ الْمُقَرَّبِينَ وَالنَّبِيِّينَ، وَمَنْ تَبِعَهُمْ مِنَ الْمُؤْمِنِينَ وَالْمُسْلِمِينَ‏.‏","english":{"narrator":"'Asim ibn Damra said:","text":"“We asked 'Ali (may Allah ennoble his countenance) about the ritual prayer of Allah’s Messenger (Allah bless him and give him peace) in the daytime, and he said:\n‘You would be incapable of that,’ so we said: Anyone of us who is capable of that will perform it!’ He therefore said: ‘When the sun was from over here , at the time of the afternoon prayer, he used to perform two cycles of ritual prayer, and when the sun was from over here, like its appearance from over here, at the time of the midday prayer, he would perform four. He would also perform four cycles before the midday prayer and two after it, and four before the afternoon prayer, separating each pair of cycles with the salutation of peace upon the angels drawn near, and upon the Prophets and the believers and Muslims who follow them'.”"}}],"chapter":{"id":40,"bookId":16,"arabic":"باب ما جاء في عبادة النبي صلى الله عليه وسلم","english":"Worship And Devotion Of Rasoolullah"}}