{"metadata":{"length":6,"arabic":{"title":"الشمائل المحمدية","author":"الإمام الترمذي","introduction":"باب ماجاء في بكاء رسول الله صلى الله عليه وسلم"},"english":{"title":"Shama'il Muhammadiyah","author":"Imam Tirmidhi","introduction":"The Weeping Of Sayyidina Rasoolullah"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":45,"bookId":16,"arabic":"حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ اللهِ بْنُ الْمُبَارِكِ، عَنْ حَمَّادِ بْنِ سَلَمَةَ، عَنْ ثَابِتٍ، عَنْ مُطَرِّفٍ وَهُوَ ابْنُ عَبْدِ اللهِ بْنِ الشِّخِّيرِ، عَنْ أَبِيهِ، قَالَ‏:‏ أَتَيْتُ رَسُولَ اللهِ صلى الله عليه وسلم وَهُوَ يُصَلِّي، وَلِجَوْفِهِ أَزِيزٌ كَأَزِيزِ الْمِرْجَلِ مِنَ الْبُكَاءِ‏.‏","english":{"narrator":"'Abdullah ibn ash-Shikh-khir reported that his father said:","text":"\"I came to Allah’s Messenger (Allah bless him and give him peace) while he was performing the ritual prayer, and his inner body  was producing a humming sound like the humming of the cauldron due to his weeping.”"}},{"id":2,"idInBook":2,"chapterId":45,"bookId":16,"arabic":"حَدَّثَنَا مَحْمُودُ بْنُ غَيْلانَ، قَالَ‏:‏ حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنِ إِبْرَاهِيمَ، عَنْ عُبَيْدَةَ، عَنْ عَبْدِ اللهِ بْنِ مَسْعُودٍ، قَالَ‏:‏ قَالَ لِي رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ اقْرَأْ عَلَيَّ فَقُلْتُ‏:‏ يَا رَسُولَ اللهِ، أَقَرَأُ عَلَيْكَ وَعَلَيْكَ أُنْزِلَ، قَالَ‏:‏ إِنِّي أُحِبُّ أَنْ أَسْمَعَهُ مِنْ غَيْرِي، فَقَرَأْتُ سُورَةَ النِّسَاءِ، حَتَّى بَلَغْتُ وَجِئِنَا بِكَ عَلَى هَؤُلاءِ شَهِيدًا، قَالَ‏:‏ فَرَأَيْتُ عَيْنَيْ رَسُولِ اللهِ تَهْمِلانِ‏.‏","english":{"narrator":"'Abdu’llah ibn Mas'ud said (may Allah be well pleased with him):","text":"“Allah’s Messenger (Allah bless him and give him peace) told me: ‘Recite the Qur’an to me,’ so I said: ‘O Messenger of Allah, shall I recite the Qur’an to you when it was to you that it was revealed?’ He said: ‘I like to hear it from someone other than myself,’ so I recited the Sura of the Women ' (Al-Qur'an; 4:41). Then I saw the eyes of Allah’s Messenger bathed in tears.”"}},{"id":3,"idInBook":3,"chapterId":45,"bookId":16,"arabic":"حَدَّثَنَا قُتَيْبَةُ، قَالَ‏:‏ حَدَّثَنَا جَرِيرٌ، عَنْ عَطَاءِ بْنِ السَّائِبِ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللهِ بْنِ عَمْرٍو، قَالَ‏:‏ انْكسفَتِ الشَّمْسُ يَوْمًا عَلَى عَهْدِ رَسُولِ اللهِ صلى الله عليه وسلم، فَقَامَ رَسُولُ اللهِ صلى الله عليه وسلم يُصَلِّي، حَتَّى لَمْ يَكَدْ يَرْكَعُ ثُمَّ رَكَعَ، فَلَمْ يَكَدْ يَرْفَعُ رَأْسَهُ، ثُمَّ رَفَعَ رَأْسَهُ، فَلَمْ يَكَدْ أَنْ يَسْجُدَ، ثُمَّ سَجَدَ فَلَمْ يَكَدْ أَنْ يَرْفَعَ رَأْسَهُ، ثُمَّ رَفَعَ رَأْسَهُ، فَلَمْ يَكَدْ أَنْ يَسْجُدَ، ثُمَّ سَجَدَ فَلَمْ يَكَدْ أَنْ يَرْفَعَ رَأْسَهُ، فَجَعَلَ يَنْفُخُ وَيَبْكِي، وَيَقُولُ‏:‏ رَبِّ أَلَمْ تَعِدْنِي أَنْ لا تُعَذِّبَهُمْ وَأَنَا فِيهِمْ‏؟‏ رَبِّ أَلَمْ تَعِدْنِي أَنْ لا تُعَذِّبَهُمْ وَهُمْ يَسْتَغْفِرُونَ‏؟‏ وَنَحْنُ نَسْتَغْفِرُكَ فَلَمَّا صَلَّى رَكْعَتَيْنِ انْجَلَتِ الشَّمْسُ، فَقَامَ فَحَمِدَ اللَّهَ تَعَالَى، وَأَثْنَى عَلَيْهِ، ثُمَّ قَالَ‏:‏ إِنَّ الشَّمْسَ وَالْقَمَرَ آيَتَانِ مِنْ آيَاتِ اللهِ لا يَنْكَسِفَانِ لِمَوْتِ أَحَدٍ وَلا لِحَيَاتِهِ، فَإِذَا انْكَسَفَا، فَافْزَعُوا إِلَى ذِكْرِ اللهِ تَعَالَى‏.‏","english":{"narrator":"'Abdullah ibn ‘Uamr said:","text":"\"The sun was eclipsed one day in the era of Allah’s Messenger (Allah bless him and give him peace), so Allah’s Messenger (Allah bless him and give him peace) stood performing the ritual prayer, until he could hardly bow down, then he bowed down and could hardly raise his head, then he raised his head and could hardly prostrate himself, then he prostrated himself and could hardly raise his head, so he began to gasp and weep, saying: 'O my Lord, have You not promised me that You will not torment them while I am among them? O my Lord, have You not promised me that You will not torment them while they and we are appealing to You for forgiveness?' Then, once he had performed two cycles of ritual prayer, the sun became visible, so he stood up, praised Allah (Exalted is He) and extolled Him. Then he said: 'The sun and the moon are among the signs of Allah. They are not eclipsed because of someone’s death, nor because of his coming to life, so when they are eclipsed, you must seek refuge in the remembrance of Allah (Exalted is He)!'”"}},{"id":4,"idInBook":4,"chapterId":45,"bookId":16,"arabic":"حَدَّثَنَا مَحْمُودُ بْنُ غَيْلانَ، قَالَ‏:‏ حَدَّثَنَا أَبُو أَحْمَدَ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنْ عَطَاءِ بْنِ السَّائِبِ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ‏:‏ أَخَذَ رَسُولُ اللهِ صلى الله عليه وسلم ابْنَةً لَهُ تَقْضِي فَاحْتَضَنَهَا فَوَضَعَهَا بَيْنَ يَدَيْهِ، فَمَاتَتْ وَهِيَ بَيْنَ يَدَيْهِ وَصَاحَتْ أُمُّ أَيْمَنَ، فَقَالَ يَعْنِي صلى الله عليه وسلم‏:‏ أَتَبْكِينَ عِنْدَ رَسُولِ اللهِ‏؟‏ فَقَالَتْ‏:‏ أَلَسْتُ أَرَاكَ تَبْكِي‏؟‏ قَالَ‏:‏ إِنِّي لَسْتُ أَبْكِي، إِنَّمَا هِيَ رَحْمَةٌ، إِنَّ الْمُؤْمِنَ بِكُلِّ خَيْرٍ عَلَى كُلِّ حَالٍ، إِنَّ نَفْسَهُ تُنْزَعُ مِنْ بَيْنِ جَنْبَيْهِ، وَهُوَ يَحْمَدُ اللَّهَ تعالى ‏.‏","english":{"narrator":"Ibn Abbas said:","text":"“Allah’s Messenger (Allah bless him and give him peace) took hold of a daughter of his who was dying, then embraced her and she died in his arms. Umm Aiman cried, so he, meaning the Prophet (Allah bless him and give him peace), said: 'Are you weeping in the presence of Allah’s Messenger?’ She replied: 'Am I not seeing you weep?’ He said: 'I am not weeping. It is actually a mercy. The believer has every benefit in every situation. His soul is removed within him as he praises Allah (Almighty and Glorious is He)!'”"}},{"id":5,"idInBook":5,"chapterId":45,"bookId":16,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنْ عَاصِمِ بْنِ عُبَيْدِ اللهِ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم، قَبَّلَ عُثْمَانَ بْنَ مَظْعُونٍ وَهُوَ مَيِّتٌ وَهُوَ يَبْكِي أَوْ قَالَ‏:‏ عَيْنَاهُ تَهْرَاقَانِ‏.‏","english":{"narrator":"'A’isha said (may Allah be well pleased with her):","text":"“Allah’s Messenger (Allah bless him and give him peace) kissed 'Uthman ibn Maz'un when he was dead, and he was weeping.\" (or: “his eyes were shedding tears”).”"}},{"id":6,"idInBook":6,"chapterId":45,"bookId":16,"arabic":"حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، قَالَ‏:‏ أَخْبَرَنَا أَبُو عَامِرٍ، قَالَ‏:‏ حَدَّثَنَا فُلَيْحٌ وَهُوَ ابْنُ سُلَيْمَانَ، عَنْ هِلالِ بْنِ عَلِيٍّ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ‏:‏ شَهِدْنَا ابْنَةً لِرَسُولِ اللهِ صلى الله عليه وسلم، وَرَسُولُ اللهِ جَالِسٌ عَلَى الْقَبْرِ، فَرَأَيْتُ عَيْيَنْهِ تَدمَعَانِ، فَقَالَ‏:‏ أَفِيكُمْ رَجُلٌ لَمْ يُقَارِفِ اللَّيْلَةَ‏؟‏، قَالَ أَبُو طَلْحَةَ‏:‏ أَنَا، قَالَ‏:‏ انْزِلْ فَنَزَلَ فِي قَبْرِهَا‏.‏","english":{"narrator":"Anas ibn Malik said:","text":"“We saw Allah’s Messenger (Allah bless him and give him peace), sitting on the tomb of a daughter of his, and I saw his eyes shedding tears. Then he said: 'Is there any man among you who has not had intercourse with his wife tonight?’ Abu Talha said: ‘I haven't!’ He told him: ‘Come down,’ so he came down into her tomb.”"}}],"chapter":{"id":45,"bookId":16,"arabic":"باب ماجاء في بكاء رسول الله صلى الله عليه وسلم","english":"The Weeping Of Sayyidina Rasoolullah"}}