{"metadata":{"length":13,"arabic":{"title":"الشمائل المحمدية","author":"الإمام الترمذي","introduction":"باب ماجاء في تواضع رسول الله صلى الله عليه وسلم"},"english":{"title":"Shama'il Muhammadiyah","author":"Imam Tirmidhi","introduction":"The Humbleness Of Sayyidina Rasoolullah"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":47,"bookId":16,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، وَسَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ الْمَخْزُومِيُّ، وَغَيْرُ وَاحِدٍ، قَالُوا‏:‏ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللهِ، عَنِ ابْنِ عَبَّاسٍ، عَنْ عُمَرَ بْنِ الْخَطَّابِ، قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ لا تُطْرُونِي كَمَا أَطْرَتِ النَّصَارَى ابْنَ مَرْيَمَ، إِنَّمَا أَنَا عَبْدٌ، فَقُولُوا‏:‏ عَبْدُ اللهِ وَرَسُولُهُ‏.‏","english":{"narrator":"'Umar ibn al-Khattab said:","text":"“Allah’s Messenger said (Allah bless him and give him peace): ‘Do not extol me as the Christians extolled  Allah’s servant and His Messenger.’”"}},{"id":2,"idInBook":2,"chapterId":47,"bookId":16,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ‏:‏ حَدَّثَنَا سُوَيْدُ بْنُ عَبْدِ الْعَزِيزِ، عَنْ حُمَيْدٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ امْرَأَةً جَاءَتْ إِلَى النَّبِيِّ صلى الله عليه وسلم، فَقَالَتْ لَهُ‏:‏ إِنَّ لِي إِلَيْكَ حَاجَةً، فَقَالَ‏:‏ اجْلِسِي فِي أَيِّ طَرِيقِ الْمَدِينَةِ شِئْتِ، أَجْلِسْ إِلَيْكِ‏.‏","english":{"narrator":"Anas ibn Malik said (may Allah be well pleased with him):","text":"\"A woman came to the Prophet (Allah bless him and give him peace) and said to him: 'I am in need of you,' so he said: 'Sit in whichever road of the city you wish, and I shall sit with you!'\""}},{"id":3,"idInBook":3,"chapterId":47,"bookId":16,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ‏:‏ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ مُسْلِمٍ الأَعْوَرِ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ‏:‏ كَانَ رَسُولُ اللهِ صلى الله عليه وسلم يَعُودُ الْمَرِيضَ، وَيَشْهَدُ الْجَنَائِزَ، وَيَرْكَبُ الْحِمَارَ، وَيُجِيبُ دَعْوَةَ الْعَبْدِ، وَكَانَ يَوْمَ بَنِي قُرَيْظَةَ عَلَى حِمَارٍ مَخْطُومٍ بَحَبْلٍ مِنْ لِيفٍ، وَعَلَيْهِ إِكَافٌ مِنْ لِيفٍ‏.‏","english":{"narrator":"Anas ibn Malik said (may Allah be well pleased with him):","text":"\"Allah’s Messenger (Allah bless him and give him peace) used to visit the sick, attend funerals, ride a donkey, and accept invitations from slaves. On the Day of Banu Quraiza, he was mounted on a donkey bridled with a rope of palm- tree fibers and saddled with palm-tree fibers.”"}},{"id":4,"idInBook":4,"chapterId":47,"bookId":16,"arabic":"حَدَّثَنَا وَاصِلُ بْنُ عَبْدِ الأَعْلَى الْكُوفِيُّ، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، عَنِ الأَعْمَشِ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ‏:‏ كَانَ النَّبِيُّ صلى الله عليه وسلم، يُدْعَى إِلَى خُبْزِ الشَّعِيرِ، وَالإِهَالَةِ السَّنِخَةِ، فَيُجِيبُ وَلَقَدْ كَانَ لَهُ دِرْعٌ عِنْدَ يَهُودِيٍّ، فَمَا وَجَدَ مَا يَفُكُّهَا حَتَّى مَاتَ‏.‏","english":{"narrator":"Anas ibn Malik said (may Allah be well pleased with him):","text":"\"The Prophet (Allah bless him and give him peace) used to be invited to a meal of barley bread and rancid oil, and he would accept the invitation. He once had a breastplate which was being held in pledge by a certain Jew, and he (the Prophet) died before he could repay the debt so as to release it from the Jew's possession.”"}},{"id":5,"idInBook":5,"chapterId":47,"bookId":16,"arabic":"حَدَّثَنَا مَحْمُودُ بْنُ غَيْلانَ، قَالَ‏:‏ حَدَّثَنَا أَبُو دَاوُدَ الْحَفَرِيُّ، عَنْ سُفْيَانَ، عَنِ الرَّبِيعِ بْنِ صَبِيحٍ، عَنْ يَزِيدَ بْنِ أَبَانَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ‏:‏ حَجَّ رَسُولُ اللهِ صلى الله عليه وسلم، عَلَى رَحْلٍ رَثٍّ، وَعَلَيْهِ قَطِيفَةٌ، لا تُسَاوِي أَرْبَعَةَ دَرَاهِمَ، فَقَالَ‏:‏ اللَّهُمَّ اجْعَلْهُ حَجًّا، لا رِيَاءَ فِيهِ، وَلا سُمْعَةَ‏.‏","english":{"narrator":"Anas ibn Malik said (may Allah be well pleased with him):","text":"“Allah’s Messenger (Allah bless him and give him peace) performed the Pilgrimage on a shabby camel saddle, on which there was a velvet sheet worth less than four silver coins, so he said: ‘O Allah, make it a Pilgrimage devoid of hypocritical ostentation and no notoriety!'”"}},{"id":6,"idInBook":6,"chapterId":47,"bookId":16,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ عَبْدِ الرَّحْمَنِ، قَالَ‏:‏ حَدَّثَنَا عَفَّانُ، قَالَ‏:‏ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ حُمَيْدٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ‏:‏ لَمْ يَكُنْ شَخْصٌ أَحَبَّ إِلَيْهِمْ مِنْ رَسُولِ اللهِ صلى الله عليه وسلم، قَالَ‏:‏ وَكَانُوا إِذَا رَأَوْهُ لَمْ يَقُومُوا، لِمَا يَعْلَمُونَ مِنْ كَرَاهَتِهِ لِذَلِكَ‏.‏","english":{"narrator":"Anas ibn Malik (may Allah be well pleased with him) said:","text":"that there was no person dearer to them than Allah’s Messenger (Allah bless him and give him peace). He said: \"Nevertheless, when they saw him they would refrain from standing, because they knew how he abhorred having people rise for him.”"}},{"id":7,"idInBook":7,"chapterId":47,"bookId":16,"arabic":"حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ، قَالَ‏:‏ حَدَّثَنَا جُمَيْعُ بْنُ عُمَرَ بْنِ عَبْدِ الرَّحْمَنِ الْعِجْلِيُّ، قَالَ‏:‏ أَنْبَأَنَا رَجُلٌ مِنْ بَنِي تَمِيمٍ مِنْ وَلَدِ أَبِي هَالَةَ زَوْجِ خَدِيجَةَ، يُكْنَى أَبَا عَبْدِ اللهِ، عَنِ ابْنٍ لأَبِي هَالَةَ، عَنِ الْحَسَنِ بْنِ عَلِيٍّ، قَالَ‏:‏ سَأَلْتُ خَالِي هِنْدَ بْنَ أَبِي هَالَةَ، وَكَانَ وَصَّافًا عَنْ حِلْيَةِ رَسُولِ اللهِ صلى الله عليه وسلم، وَأَنَا أَشْتَهِي أَنْ يَصِفَ لِي مِنْهَا شَيْئًا، فَقَالَ‏:‏ كَانَ رَسُولُ اللهِ صلى الله عليه وسلم،‏:‏ -‏.‏\nقَالَ‏:‏ فَسَأَلْتُهُ عَنْ مَخْرَجِهِ كَيْفَ يَصْنَعُ فِيهِ‏؟‏ قَالَ‏:‏ كَانَ رَسُولُ اللهِ صلى الله عليه وسلم يَخْرِنُ لِسَانُهُ إِلا فِيمَا يَعْنِيهِ، وَيُؤَلِّفُهُمْ وَلا يُنَفِّرُهُمْ، وَيُكْرِمُ كَرَيمَ كُلِّ قَوْمٍ وَيُوَلِّيهِ عَلَيْهِمْ، وَيُحَذِّرُ النَّاسَ وَيَحْتَرِسُ مِنْهُمْ مِنْ غَيْرِ أَنْ يَطْوِيَ عَنْ أَحَدٍ مِنْهُمْ بِشْرَهُ وَخُلُقَهُ، وَيَتَفَقَّدُ أَصْحَابَهُ، وَيَسْأَلُ النَّاسَ عَمَّا فِي النَّاسِ، وَيُحَسِّنُ الْحَسَنَ وَيُقَوِّيهِ، وَيُقَبِّحُ الْقَبِيحَ وَيُوَهِّيهِ، مُعْتَدِلُ الأَمْرِ غَيْرُ مُخْتَلِفٍ، لا يَغْفُلُ مَخَافَةَ أَنْ يَغْفُلُوا أَوْ يَمِيلُوا، لِكُلِّ حَالٍ عِنْدَهُ عَتَادٌ، لا يُقَصِّرُ عَنِ الْحَقِّ وَلا يُجَاوِزُهُ الَّذِينَ يَلُونَهُ مِنَ النَّاسِ خِيَارُهُمْ، أَفْضَلُهُمْ عِنْدَهُ أَعَمُّهُمْ نَصِيحَةً، وَأَعْظَمُهُمْ عِنْدَهُ مَنْزِلَةً أَحْسَنُهُمْ مُوَاسَاةً وَمُؤَازَرَةً قَالَ‏:‏ فَسَأَلْتُهُ عَنْ مَجْلِسِهِ، فَقَالَ‏:‏ كَانَ رَسُولُ اللهِ صلى الله عليه وسلم لا يَقُومُ وَلا يَجَلِسُ، إِلا عَلَى ذِكْرٍ، وَإِذَا انْتَهَى إِلَى قَوْمٍ، جَلَسَ حَيْثُ يَنْتَهِي بِهِ الْمَجْلِسُ، وَيَأْمُرُ بِذَلِكَ، يُعْطِي كُلَّ جُلَسَائِهِ بِنَصِيبِهِ، لا يَحْسَبُ جَلِيسُهُ أَنَّ أَحَدًا أَكْرَمُ عَلَيْهِ مِنْهُ، مَنْ جَالَسَهُ أَوْ فَاوَضَهُ فِي حَاجَةٍ، صَابَرَهُ حَتَّى يَكُونَ هُوَ الْمُنْصَرِفُ عَنْهُ، وَمَنْ سَأَلَهُ حَاجَةً لَمْ يَرُدَّهُ إِلا بِهَا، أَوْ بِمَيْسُورٍ مِنَ الْقَوْلِ، قَدْ وَسِعَ النَّاسَ بَسْطُهُ وَخُلُقُهُ، فَصَارَ لَهُمْ أَبًا وَصَارُوا عِنْدَهُ فِي الْحَقِّ سَوَاءً، مَجْلِسُهُ مَجْلِسُ عِلْمٍ وَحِلْمٍ وَحَيَاءٍ وَأَمَانَةٍ وَصَبْرٍ، لا تُرْفَعُ فِيهِ الأَصْوَاتُ، وَلا تُؤْبَنُ فِيهِ الْحُرَمُ، وَلا تُثَنَّى فَلَتَاتُهُ، مُتَعَادِلِينَ، بَلْ كَانُوا يَتَفَاضَلُونَ فِيهِ بِالتَّقْوَى، مُتَوَاضِعِينَ يُوقِّرُونَ فِيهِ الْكَبِيرَ، وَيَرْحَمُونَ فِيهِ الصَّغِيرَ، وَيُؤْثِرُونَ ذَا الْحَاجَةِ، وَيَحْفَظُونَ الْغَرِيبَ‏.‏","english":{"narrator":"Al-Hasan ibn ‘Ali said:","text":"“I asked my maternal uncle, Hind ibn Abi Hala, who was an expert describer, about the finery of Allah’s Messenger (Allah bless him and give him peace), and I asked him to describe something of it for me, so he said: ‘Allah’s Messenger (Allah bless him and give him peace) was an honored dignitary, whose face shone with the radiance of the moon on the night of the full moon.’\" Then he related the tradition in its full length.\nAl-Hasan said: “I concealed it from al-Husain for some time, then I related it to him, so I found that he had beaten me to it.” He therefore asked him about what he had asked him about, and he found that he had asked his father about his entrance and his exit and his outward appearance, so he did not leave anything out of it.\nAl-Husain said: “I asked my father about the entry of Allah’s Messenger (Allah bless him and give him peace), so he said: ‘When Allah’s Messenger (Allah bless him and give him peace) betook himself to his residence, he divided his entry into three sections: a section for Allah’s sake, a section for his family’s sake, and a section for his own sake. Then he divided his section between himself and the people, so he was assigning that in particular to the common folk, and he was not keeping anything from them. His conduct in the section of the Community included preference for the people of excellent merit, with his permission, and its allotment according to the value of their excellent merit in the religion, for among them was the one burdened with one need, and among them was the one burdened with two needs, and among them was the one burdened with multiple needs. He would therefore preoccupy himself with them, and preoccupy them with what would benefit them and the Community, including questioning them about it and informing them of what would be appropriate for them. He would say: 'Let the one of you who is present inform the absentee, and notify me of the need of someone who is incapable of notification, for if someone notifies a Sultan of the need of someone who is incapable of its notification, Allah will establish his feet firmly on the Day of the Resurrection. Nothing but that will be mentioned in His presence, and it will not be accepted from anyone other than him. They will enter as seekers, and they will not separate except on the strength of an intuition, and they will emerge as guides (meaning to goodness).’”\nHe said: “Then I asked him about his exit: ‘How was he used to behaving in it?’ He said: ‘Allah’s Messenger (Allah bless him and give him peace) used to hold his tongue with regard to anything that did not concern him. He used to bring people together and not alienate them. He would honor the noble, generous man of every community, and put him in charge of them. He would caution people and be wary of them, without concealing his good humor and his natural disposition from anyone among them. He would watch out for his Companions, and he would ask people about their affairs. He would present the beautiful in a favorable light and strengthen it, and he would reveal the ugly for what it was and weaken it. He was equitable, not argumentative. He remained vigilant lest others be negligent or deviate from the right path. He had a means of dealing with every situation. He would neither fall short of the truth, nor overstep it. Those who followed him were the best of people. The most meritorious in his sight were those most receptive to sincere advice and most elevated in status those most generous in consolation and support.’”\nHe said: “Then I asked him about his session, so he said: ‘Allah’s Messenger (Allah bless him and give him peace) would neither stand up nor sit down without observing the remembrance of Allah. When he eventually joined a group of people, he would take whatever seat was available, and he instructed others to do the same. He would give each of his sitting companions his share of time and attention, and every one of them would feel equally honored. If someone sat with him, or conferred with him about a need, he would bear with him patiently, so that the person who had sought him out would be the first to leave. If someone asked him for something he needed, he would not send him away without what he had requested, or least some comforting words. His munificence and his good nature encompassed people such that he became a father to them, and they became truly equal in his presence. His session was a session of knowledge, forbearance, modesty, trust and patience. Voices were not raised there, there was no talk of women, and people’s lapses were not broadcast. They were on a par with one another, contending with each other only in piety, humbly revering the elderly and showing compassion for the young. They were solicitous to the needy, and took good care of the stranger.’”"}},{"id":8,"idInBook":8,"chapterId":47,"bookId":16,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ بَزِيعٍ، قَالَ‏:‏ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، قَالَ‏:‏ حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ لوْ أُهْدِيَ إِلَيَّ كُرَاعٌ لَقَبِلتُ، وَلوْ دُعِيتُ عَلَيْهِ لأَجَبْتُ‏.‏","english":{"narrator":"Anas ibn Malik said (may Allah be well pleased with him):","text":"“Allah’s Messenger said (Allah bless him and give him peace): 'If a sheep’s trotter were given to me, I would receive it, and if I were invited to eat it at someone’s home, I would accept the invitation!'”"}},{"id":9,"idInBook":9,"chapterId":47,"bookId":16,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرٍ، قَالَ‏:‏ جَاءَنِي رَسُولُ اللهِ صلى الله عليه وسلم لَيْسَ برَاكِبِ بَغْلٍ وَلا بِرْذَوْنٍ‏.‏","english":{"narrator":"Jabir said (may Allah be well pleased with him):","text":"“Allah’s Messenger (Allah bless him and give him peace) came to me riding neither a mule nor a hackney.”"}},{"id":10,"idInBook":10,"chapterId":47,"bookId":16,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ عَبْدِ الرَّحْمَنِ، قَالَ‏:‏ حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ‏:‏ أَنْبَأَنَا يَحْيَى بْنُ أَبِي الْهَيْثَمِ الْعَطَّارُ، قَالَ‏:‏ سَمِعْتُ يُوسُفَ بْنَ عَبْدِ اللهِ بْنِ سَلامٍ، قَالَ‏:‏ سَمَّانِي رَسُولُ اللهِ صلى الله عليه وسلم يُوسُفَ، وَأَقْعَدَنِي فِي حِجْرِهِ، وَمَسَحَ عَلَى رَأْسِي‏.‏","english":{"narrator":"Yusuf ibn 'Abdi’llah ibn Salam said:","text":"\"Allah’s Messenger (Allah bless him and give him peace) named me Yusuf, and he sat me on his lap and stroked my head.”"}},{"id":11,"idInBook":11,"chapterId":47,"bookId":16,"arabic":"حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، قَالَ‏:‏ حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ، قَالَ‏:‏ حَدَّثَنَا الرَّبِيعُ وَهُوَ ابْنُ صَبِيحٍ، قَالَ‏:‏ حَدَّثَنَا يَزِيدُ الرَّقَاشِيُّ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم، حَجَّ عَلَى رَحْلٍ رَثٍّ وَقَطِيفَةٍ، كُنَّا نَرَى ثَمَنَهَا أَرْبَعَةَ دَرَاهِمَ، فَلَمَّا اسْتَوَتْ بِهِ رَاحِلَتُهُ، قَالَ‏:‏ لَبَّيْكَ بِحَجَّةٍ لا سُمْعَةَ فِيهَا وَلا رِيَاءَ‏.‏","english":{"narrator":"Anas ibn Malik said (may Allah be well pleased with him):","text":"“Allah’s Messenger (Allah bless him and give him peace) performed the Pilgrimage on a shabby camel saddle and a tassled blanket, the price of which we reckoned to be four silver coins, so when his riding camel stood up straight with him, he said: ‘Doubly at Your service, with a Pilgrimage in which there is no notoriety and no hypocritical ostentation!'”"}},{"id":12,"idInBook":12,"chapterId":47,"bookId":16,"arabic":"حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَ‏:‏ حَدَّثَنَا مَعْمَرٌ، عَنْ ثَابِتٍ الْبُنَانِيِّ، وَعَاصِمٍ الأَحْوَلِ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَجُلا خَيَّاطًا دَعَا رَسُولَ اللهِ صلى الله عليه وسلم، فَقَرَّبَ مِنْهُ ثَرِيدًا عَلَيْهِ دُبَّاءُ، قَالَ‏:‏ فَكَانَ رَسُولُ اللهِ صلى الله عليه وسلم، يَأْخُذُ الدُّبَّاءَ، وَكَانَ يُحِبُّ الدُّبَّاءَ، قَالَ ثَابِتٌ‏:‏ فَسَمِعْتُ أَنَسًا، يَقُولُ‏:‏ فَمَا صُنِعَ لِي طَعَامٌ، أَقْدَرُ عَلَى أَنْ يُصْنَعَ فِيهِ دُبَّاءُ، إِلا صُنِعَ‏.‏","english":{"narrator":"Anas ibn Malik said (may Allah be well pleased with him):","text":"“A tailor invited Allah’s Messenger (Allah bless him and give him peace) and served him a dish of sopped bread, meat and broth, with some gourd on it. Allah’s Messenger (Allah bless him and give him peace) used to love gourd.” Thabit said; “Then I heard Anas say: ‘From then on, any dish that could be made with gourd was made for me!'”"}},{"id":13,"idInBook":13,"chapterId":47,"bookId":16,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ صَالِحٍ، قَالَ‏:‏ حَدَّثَنَا مُعَاوِيَةُ بْنُ صَالِحٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرَةَ، قَالَتْ‏:‏ قِيلَ لِعَائِشَةَ‏:‏ مَاذَا كَانَ يَعْمَلُ رَسُولُ اللهِ صلى الله عليه وسلم فِي بَيْتِهِ‏؟‏ قَالَتْ‏:‏ كَانَ بَشَرًا مِنَ الْبَشَرِ، يَفْلِي ثَوْبَهُ، وَيَحْلُبُ شَاتَهُ، وَيَخْدُمُ نَفْسَهُ‏.‏","english":{"narrator":"'Amra said:","text":"“'A'isha was asked: ‘What was Allah’s Messenger (Allah bless him and give him peace) accustomed to doing in his home?’ She said: ‘He was a normal human being. He used to examine his clothes for lice, milk his sheep and serve himself.’”"}}],"chapter":{"id":47,"bookId":16,"arabic":"باب ماجاء في تواضع رسول الله صلى الله عليه وسلم","english":"The Humbleness Of Sayyidina Rasoolullah"}}