{"metadata":{"length":9,"arabic":{"title":"الشمائل المحمدية","author":"الإمام الترمذي","introduction":"باب ماجاء في عيش رسول الله صلى الله عليه وسلم"},"english":{"title":"Shama'il Muhammadiyah","author":"Imam Tirmidhi","introduction":"The Living Of Sayyidina Rasoolullah"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":52,"bookId":16,"arabic":"حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ‏:‏ حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ سِمَاكِ بْنِ حَرْبٍ، قَالَ‏:‏ سَمِعْتُ النُّعْمَانَ بْنَ بَشِيرٍ، يَقُولُ‏:‏ أَلَسْتُمْ فِي طَعَامٍ وَشَرَابٍ مَا شِئِتُمْ‏؟‏ لَقَدْ رَأَيْتُ نَبِيَّكُمْ صلى الله عليه وسلم، وَمَا يَجِدُ مِنَ الدَّقَلِ، مَا يَمْلأُ بَطْنَهُ‏.‏","english":{"narrator":"An-Nu'man ibn Bashir say:","text":"“Do you not have what you want in the way of food and drink? I have seen your Prophet (Allah bless him and give him peace), and the poor-quality dates  that he finds are what fills his stomach.”"}},{"id":2,"idInBook":2,"chapterId":52,"bookId":16,"arabic":"حَدَّثَنَا هَارُونُ بْنُ إِسْحَاقَ، قَالَ‏:‏ حَدَّثَنَا عَبْدَةُ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ‏:‏ إِنْ كُنَّا آلَ مُحَمَّدٍ نَمكُثُ شَهْرًا مَا نَسْتَوْقِدُ بِنَارٍ، إِنْ هُوَ إِلا التَّمْرُ وَالْمَاءُ‏.‏","english":{"narrator":"A’isha said:","text":"‘We, Muhammad’s wives, would go an entire month without cooking anything over a fire, and with nothing to eat and drink but dates and water.”"}},{"id":3,"idInBook":3,"chapterId":52,"bookId":16,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ أَبِي زِيَادٍ، قَالَ‏:‏ حَدَّثَنَا سَيَّارٌ، قَالَ‏:‏ حَدَّثَنَا سَهْلُ بْنُ أَسْلَمَ، عَنْ يَزِيدَ بْنِ أَبِي مَنْصُورٍ، عَنْ أَنَسٍ، عَنْ أَبِي طَلْحَةَ، قَالَ‏:‏ شَكَوْنَا إِلَى رَسُولِ اللهِ صلى الله عليه وسلم، الْجُوعَ وَرَفَعْنَا عَنْ بُطُونِنَا عَنْ حَجَرٍ، فَرَفَعَ رَسُولُ اللهِ صلى الله عليه وسلم، عَنْ بَطْنِهِ عَنْ حَجَرَيْنِ قَالَ أَبُو عِيسَى‏:‏ هَذَا حَدِيثٌ غَرِيبٌ مِنْ حَدِيثِ أَبِي طَلْحَةَ لا نَعْرِفُهُ إِلا مِنْ هَذَا الْوَجْهِ، وَمَعْنَى قَوْلِهِ‏:‏ وَرَفَعْنَا عَنْ بُطُونِنَا عَنْ حَجَرٍ حَجَرٍ، كَانَ أَحَدُهُمْ يَشُدُّ فِي بَطْنِهِ الْحَجَرَ مِنَ الْجُهْدِ وَالضَّعْفِ الَّذِي بِهِ مِنَ الْجُوعِ‏.‏","english":{"narrator":"Abu Talha said:","text":"“We complained to Allah’s Messenger (Allah bless him and give him peace) of hunger, and we exposed our stomachs, each revealing a rock, so Allah’s Messenger (Allah bless him and give him peace) exposed his stomach, revealing two rocks.”"}},{"id":4,"idInBook":4,"chapterId":52,"bookId":16,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ، قَالَ‏:‏ حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ، قَالَ‏:‏ حَدَّثَنَا شَيْبَانُ أَبُو مُعَاوِيَةَ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ عُمَيْرٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ‏:‏ خَرَجَ رَسُولُ اللهِ صلى الله عليه وسلم، فِي سَاعَةٍ لا يَخْرُجُ فِيهَا، وَلا يَلْقَاهُ فِيهَا أَحَدٌ، فَأَتَاهُ أَبُو بَكْرٍ، فَقَالَ‏:‏ مَا جَاءَ بِكَ يَا أَبَا بَكْرٍ‏؟‏، قَالَ‏:‏ خَرَجْتُ أَلْقَى رَسُولَ اللهِ صلى الله عليه وسلم وَأَنْظُرُ فِي وَجْهِهِ، وَالتَّسْلِيمَ عَلَيْهِ، فَلَمْ يَلْبَثْ أَنْ جَاءَ عُمَرُ، فَقَالَ‏:‏ مَا جَاءَ بِكَ يَا عُمَرُ‏؟‏، قَالَ‏:‏ الْجُوعُ يَا رَسُولَ اللهِ، قَالَ صلى الله عليه وسلم‏:‏ وَأَنَا قَدْ وَجَدْتُ بَعْضَ ذَلِكَ، فَانْطَلَقُوا إِلَى مَنْزِلِ أَبِي الْهَيْثَمِ بْنِ التَّيْهَانِ الأَنْصَارِيِّ، وَكَانَ رَجُلا كَثِيرَ النَّخْلِ وَالشَّاءِ، وَلَمْ يَكُنْ لَهُ خَدَمٌ، فَلَمْ يَجِدُوهُ، فَقَالُوا لامْرَأَتِهِ‏:‏ أَيْنَ صَاحِبُكِ‏؟‏ فَقَالَتِ‏:‏ انْطَلَقَ يَسْتَعْذِبُ لَنَا الْمَاءَ، فَلَمْ يَلْبَثُوا أَنْ جَاءَ أَبُو الْهَيْثَمِ بِقِرْبَةٍ يَزْعَبُهَا، فَوَضَعَهَا ثُمَّ جَاءَ يَلْتَزِمُ النَّبِيَّ صلى الله عليه وسلم وَيُفَدِّيهِ بِأَبِيهِ وَأُمِّهِ، ثُمَّ انْطَلَقَ بِهِمْ إِلَى حَدِيقَتِهِ فَبَسَطَ لَهُمْ بِسَاطًا، ثُمَّ انْطَلَقَ إِلَى نَخْلَةٍ فَجَاءَ بِقِنْوٍ فَوَضَعَهُ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ أَفَلا تَنَقَّيْتَ لَنَا مِنْ رُطَبِهِ‏؟‏ فَقَالَ‏:‏ يَا رَسُولَ اللهِ، إِنِّي أَرَدْتُ أَنْ تَخْتَارُوا، أَوْ تَخَيَّرُوا مِنْ رُطَبِهِ وَبُسْرِهِ، فَأَكَلُوا وَشَرِبُوا مِنْ ذَلِكَ الْمَاءِ فَقَالَ صلى الله عليه وسلم‏:‏ هَذَا وَالَّذِي نَفْسِي بِيَدِهِ مِنِ النَّعِيمِ الَّذِي تُسْأَلُونَ عَنْهُ يَوْمَ الْقِيَامَةِ ظِلٌّ بَارِدٌ، وَرُطَبٌ طَيِّبٌ، وَمَاءٌ بَارِدٌ فَانْطَلَقَ أَبُو الْهَيْثَمِ لِيَصْنَعَ لَهُمْ طَعَامًا فَقَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ لا تَذْبَحَنَّ ذَاتَ دَرٍّ، فَذَبَحَ لَهُمْ عَنَاقًا أَوْ جَدْيًا، فَأَتَاهُمْ بِهَا فَأَكَلُوا، فَقَالَ صلى الله عليه وسلم‏:‏ هَلْ لَكَ خَادِمٌ‏؟‏، قَالَ‏:‏ لا، قَالَ‏:‏ فَإِذَا أَتَانَا، سَبْيٌ، فَأْتِنَا فَأُتِيَ النَّبِيُّ صلى الله عليه وسلم بِرَأْسَيْنِ لَيْسَ مَعَهُمَا ثَالِثٌ، فَأَتَاهُ أَبُو الْهَيْثَمِ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ اخْتَرْ مِنْهُمَا فَقَالَ‏:‏ يَا رَسُولَ اللهِ، اخْتَرْ لِي فَقَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ إِنَّ الْمُسْتَشَارَ مُؤْتَمَنٌ، خُذْ هَذَا، فَإِنِّي رَأَيْتُهُ يُصَلِّي، وَاسْتَوْصِ بِهِ مَعْرُوفًا فَانْطَلَقَ أَبُو الْهَيْثَمِ إِلَى امْرَأَتِهِ، فَأَخْبَرَهَا بِقَوْلِ رَسُولِ اللهِ صلى الله عليه وسلم، فَقَالَتِ امْرَأَتُهُ‏:‏ مَا أَنْتَ بِبَالِغٍ حَقَّ مَا، قَالَ فِيهِ النَّبِيُّ صلى الله عليه وسلم إِلا بِأَنْ تَعْتِقَهُ، قَالَ‏:‏ فَهُوَ عَتِيقٌ، فَقَالَ صلى الله عليه وسلم‏:‏ إِنَّ اللَّهَ لَمْ يَبْعَثْ نَبِيًّا وَلا خَلِيفَةً إِلا وَلَهُ بِطَانَتَانِ‏:‏ بِطَانَةٌ تَأْمُرُهُ بِالْمَعْرُوفِ وَتَنْهَاهُ عَنِ الْمُنْكَرِ، وَبِطَانَةٌ لا تَأْلُوهُ خَبَالا، وَمَنْ يُوقَ بِطَانَةَ السُّوءِ فَقَدْ وُقِيَ‏.‏","english":{"narrator":"Abu Huraira said:","text":"\"Allah’s Messenger (Allah bless him and give him peace) went out during an hour in which he did not usually go out, and in which no one used to meet him, but Abu Bakr came to him, so he said: “What has brought you forth, O Abu Bakr?” He replied: “I came out to meet Allah’s Messenger (Allah bless him and give him peace), behold his face, and greet him with the salutation of peace.” Shortly thereafter \"Umar came along, so he said: “What has brought you forth, O 'Umar?” He replied: “Hunger, O Messenger of Allah!” He said (Allah bless him and give him peace): “I have also experienced some of that!” Then they went to the house of Ibn at-Tihan al-Ansari, who was owned many date palms and sheep, but who had no servants, so they did not find him. They therefore asked his wife: “Where is your mate?” She said: “He has gone to draw sweet water for us.” They did not have to wait long before Abu’l-Haitham brought a waterskin that he was carrying full, so he set it down, and came to embrace the Prophet (Allah bless him and give him peace), offering his father and his mother as ransom for him. Then he took them to his garden, and spread a carpet for them. Then he went to a date palm, brought a bunch of dates and set it down. The Prophet said (Allah bless him and give him peace): “Have you not selected for us some of its ripe dates?” He replied: “O Messenger of Allah, I intended to let you choose or prefer some of its ripe and its unripe dates,” so they ate dates and drank from that water. Then the Prophet said (Allah bless him and give him peace): “By the One in whose Hand is my soul, this is some of the gracious favor about which you shall be asked on the Day of Resurrection: cool shade, good dates and cold water!” Then Abu’l-Haitham went to make a meal for them, so the Prophet said (Allah bless him and give him peace): “Do not slaughter a milch-animal for us.” He therefore slaughtered a young she-goat or a young billy goat, and brought it to them, so they ate. The Prophet said (Allah bless him and give him peace): “Do you have a servant?” When the answer was “No,” he said: “If a prisoner of war comes to us, come to us!” Then he (Allah bless him and give him peace) was brought two captives, unaccompanied by a third. Abu’l-Haitham then came to him, and the Prophet said (Allah bless him and give him peace): “Choose from the pair of them,” so he said: “O Messenger of Allah, choose for me!” The Prophet said (Allah bless him and give him peace): “The person whose opinion is requested deserves to be trusted. Take this one, for I have seen him performing the ritual prayer, and expect well of him!” Abu l-Haitham then went to his wife and told her what Allah’s Messenger had said, so his wife said: “You cannot arrive at the truth of what the Prophet (Allah bless him and give him peace) said about him, except by setting him free!” He said: “He is free, then!” The Prophet said (Allah bless him and give him peace): “Allah has not sent any Prophet, nor any Caliph, without his having two intimate friends: one who commands him to do what is right and fair, and forbids him to do what is wrong and unfair, and one who will spare no effort to corrupt him. If one is wary of the evil companion, he will be preserved from harm.”"}},{"id":5,"idInBook":5,"chapterId":52,"bookId":16,"arabic":"حدثنا عمر بن إسماعيل بن مجالد بن سعيد، حدثني أبي عن بيان حدثني قيس بن حازم، قال‏:‏ سمعت سعد بن أبي وقاص يقول‏:‏ إني لأَوْل رَجل أَهْرَقَ دَمًا فِي سَبِيلِ اللهِ ‏,‏ وَإِنْي لأَوْل رَجلٍ رَمَى بِسَهْمٍ فِى سَبِيلِ اللهِ َلقَدْ رَأَيْتُنِي أغزوا فِي الْعِصَابَةَ مِنْ أَصْحَابِ مُحَمْدٍ صلى الله عليه وسلم مَا نَأكُلْ إلاَّ وَرَقَ الشَجَرِ وَالْحُبْلَةَ حَتَّى تَقَرَحَتْ أَشْدَاقُنَا وَإِنْ أَحَدُنَا لَيَضَعُ كَمَا تَضَعُ الشَّاةُ وَالبَعِير وَأَصْبَحَتْ بَنُو أَسَدٍ يَعَزِّرُونَنِى فِي الدِّينِ ‏,‏ لَقَدْ خِبْتُ إذَنْ وَخَسِرْت وَضَلَ عَمَلِي‏.‏‏.‏","english":{"narrator":"Sa'd ibn Abi Waqqas said:","text":"“I am the first man who shed blood in the cause of Allah (Almighty and Glorious is He), and I am the first man who shot an arrow in Allah’s cause. I had seen myself going forth to war in the troop of the Companions of Muhammad (blessing and peace be upon him). We ate nothing but tree-leaves and a kind of bean-fruit until the corners of our mouths were covered with ulcers, and one of us would excrete as the sheep and the camel excrete. The Banu Asad started instructing me in the religion. I had therefore failed and lost my way, and my work had come to naught.”"}},{"id":6,"idInBook":6,"chapterId":52,"bookId":16,"arabic":"حدثنا محمد بن بشار ‏,‏ حدثنا صفوان بن عيسى ‏,‏ حدثنا محمد بن عمرو بن عيسى أبو نعامة العدوي ‏,‏ قال‏:‏ سمعت خَالِدِ بْنِ عُمَيْرٍ ‏,‏ وشويسًا ‏,‏ أبا الرقاد قالا‏:‏ بعث عمر بن الخطاب عُتْبَةُ بْنُ غَزْوَانَ وقَالَ انطلق أنت ومن معك ‏,‏ حتى إذا كنتم في أقصى أرض العرب ‏,‏ وأدنى بلاد أرض العجم ‏,‏ فأقبلوا حتى إذا كانوا بالمربد وجدوا هذا المكان ‏,‏ فقالوا‏:‏ ما هذه‏؟‏ هذه البصرة‏.‏ فسارواحتى إذا بلغوا حيال الجسر الصغير ‏,‏ فقالوا‏:‏ هاهنا أمرتم ‏,‏ فنزلوا فذكروا الحديث بطوله‏.‏‏.‏","english":{"narrator":"Khalid ibn 'Umair and Shuwais Abur-Ruqad said:","text":"“'Umar ibn al-Khattab dispatched 'Utba ibn Ghazwan, and he said: ‘Go away, you and whoever is with you, until you reach the most remote countries of the Arabs and the nearest countries of the non-Arabs!’ They therefore advanced until, when they reached al-Mirbad, they found this soft stone-like clay, so they said: ‘What is this?’ They were told: ‘This is Basra,’ so they traveled until they were in the vicinity of the small bridge. They said: ‘Here is our appointed destination,’ so they alighted and related the story from beginning to end. 'Utba ibn Ghazwan said: ‘I found myself the seventh of seven with Allah’s Messenger (Allah bless him and give him peace). We ate nothing but tree-leaves until the corners of our mouths were covered with ulcers, so I picked up a garment which I divided between me and Sa'd, for there was not one of us among those seven who was not the governor of a city, and you will put the governors to the test after us.”"}},{"id":7,"idInBook":7,"chapterId":52,"bookId":16,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ عَبْدِ الرَّحْمَنِ، قَالَ‏:‏ حَدَّثَنَا رَوْحُ بْنُ أَسْلَمَ أَبُو حَاتِمٍ الْبَصْرِيُّ، قَالَ‏:‏ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، قَالَ‏:‏ حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسٍ، قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ لَقَدْ أُخِفْتُ فِي اللهِ وَمَا يَخَافُ أَحَدٌ، وَلَقَدْ أُوذِيتُ فِي اللهِ وَمَا يُؤْذَى أَحَدٌ، وَلَقَدْ أَتَتْ عَلَيَّ ثَلاثُونَ مِنْ بَيْنِ لَيْلَةٍ وَيَوْمٍ، وَمَا لِي وَلِبِلالٍ طَعَامٌ يَأْكُلُهُ ذُو كَبِدٍ، إِلا شَيْءٌ يُوَارَيِهِ إِبِطُ بِلالٍ‏.‏","english":{"narrator":"Anas said:","text":"\"Allah’s Messenger said (Allah bless him and give him peace): “I have been put in fear for Allah’s sake, while no one was afraid, and I have been troubled for Allah’s sake, while no one was troubled. Thirty intervals between a night and a day came upon me, and for me and Bilal there was no food for the owner of a liver to eat, except something tucked beneath the Bilal’s armpit.”"}},{"id":8,"idInBook":8,"chapterId":52,"bookId":16,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ عَبْدِ الرَّحْمَنِ، قَالَ‏:‏ حَدَّثَنَا عَفَّانُ بْنُ مُسْلِمٍ، قَالَ‏:‏ حَدَّثَنَا أَبَانُ بْنُ يَزِيدَ الْعَطَّارُ، قَالَ‏:‏ حَدَّثَنَا قَتَادَةُ، عَنْ أَنَسِ بْنِ مَالِكٍ‏:‏ أَنَّ النَّبِيَّ صلى الله عليه وسلم، لَمْ يَجْتَمِعْ عِنْدَهُ غَدَاءٌ وَلا عَشَاءٌ مِنْ خُبْزٍ وَلَحْمٍ، إِلا عَلَى ضَفَفٍ‏.‏","english":{"narrator":"Anas ibn Malik said:","text":"\"Neither a morning nor an evening meal of bread and meat was assembled in the presence of the Prophet (Allah bless him and give him peace), except in the case of a repast attended by a throng.’”"}},{"id":9,"idInBook":9,"chapterId":52,"bookId":16,"arabic":"حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ بْنِ أَبِي فُدَيْكٍ، قَالَ‏:‏ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنْ مُسْلِمِ بْنِ جُنْدُبٍ، عَنْ نَوْفَلِ بْنِ إِيَاسٍ الْهُذَلِيِّ، قَال‏:‏ كَانَ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ لَنَا جَلِيسًا، وَكَانَ نِعْمَ الْجَلِيسُ، وَإِنَّهُ انْقَلَبَ بِنَا ذَاتَ يَوْمٍ، حَتَّى إِذَا دَخَلْنَا بَيْتَهُ وَدَخَلَ فَاغْتَسَلَ، ثُمَّ خَرَجَ وَأُتَيْنَا بِصَحْفَةٍ فِيهَا خُبْزٌ وَلَحْمٌ، فَلَمَّا وُضِعَتْ بَكَى عَبْدُ الرَّحْمَنِ، فَقُلْتُ لَهُ‏:‏ يَا أَبَا مُحَمَّدٍ، مَا يُبْكِيكَ‏؟‏ فَقَالَ‏:‏ هَلكَ رَسُولُ اللهِ صلى الله عليه وسلم، وَلَمْ يَشْبَعْ هُوَ وَأَهْلُ بَيْتِهِ مِنْ خُبْزِ الشَّعِيرِ فَلا أَرَانَا أُخِّرْنَا لِمَا هُوَ خَيْرٌ لَنَا‏.‏","english":{"narrator":"Nawfal ibn lyas al-Hudhali said:","text":"“Abd ar-Rahman ibn 'Awf was a table companion of ours, and an excellent table companion was he! After he had returned from a journey with us one day, we entered his house. Then he went inside and performed the major ritual ablution, and came out again. We brought a vessel containing bread and meat, and when it was served, Abd ar-Rahman wept, so I said: ‘O Abu Muhammad, what is making you weep?’ He replied: Allah’s Messenger (Allah bless him and give him peace) has died. When he was alive, he and the people of his household did not even eat their fill of barley-bread. But I do not think our  circumstances are any better for us.”"}}],"chapter":{"id":52,"bookId":16,"arabic":"باب ماجاء في عيش رسول الله صلى الله عليه وسلم","english":"The Living Of Sayyidina Rasoolullah"}}