{"metadata":{"length":6,"arabic":{"title":"الشمائل المحمدية","author":"الإمام الترمذي","introduction":"باب ماجاء في سن رسول الله صلى الله عليه وسلم"},"english":{"title":"Shama'il Muhammadiyah","author":"Imam Tirmidhi","introduction":"The Noble Age Of Sayyidina Rasoolullah"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":53,"bookId":16,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، قَالَ‏:‏ حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، قَالَ‏:‏ حَدَّثَنَا زَكَرِيَا بْنُ إِسْحَاقَ، قَالَ‏:‏ حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ‏:‏ مَكَثَ النَّبِيُّ صلى الله عليه وسلم بِمَكَّةَ ثَلاثَ عَشْرَةَ سَنَةً يُوحَى إِلَيْهِ، وَ بِالْمَدِينَةِ عَشْرًا، وَتُوُفِّيَ وَهُوَ ابْنُ ثَلاثٍ وَسِتِّينَ‏.‏","english":{"narrator":"Ibn Abbas said:","text":"“The Prophet (Allah bless him and give him peace) stayed in Mecca for thirteen years, during which he was inspired with Divine revelation, and in Medina for ten, and he died when he was sixty-three years of age.”"}},{"id":2,"idInBook":2,"chapterId":53,"bookId":16,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، عَنْ شُعْبَةَ، عَنْ أَبِي إِسْحَاقَ، عَنْ عَامِرِ بْنِ سَعْدٍ، عَنْ جَرِيرٍ، عَنْ مُعَاوِيَةَ، أَنَّهُ سَمِعَهُ يَخْطُبُ، قَالَ‏:‏ مَاتَ رَسُولُ اللهِ صلى الله عليه وسلم وَهُوَ ابْنُ ثَلاثٍ وَسِتِّينَ وَأَبُو بَكْرٍ وَعُمَرُ، وَأَنَا ابْنُ ثَلاثٍ وَسِتِّينَ سنة‏.‏","english":{"narrator":"Mu'awiya said in a sermon:","text":"\"The Prophet died (Allah bless him and give him peace) when he was sixty-three years of age, as did Abu Bakr and 'Umar, and I am now sixty-three years of age.”"}},{"id":3,"idInBook":3,"chapterId":53,"bookId":16,"arabic":"حَدَّثَنَا حُسَيْنُ بْنُ مَهْدِيٍّ الْبَصْرِيُّ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، عَنِ ابْنِ جُرَيْجٍ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ‏:‏ أَنَّ النَّبِيَّ صلى الله عليه وسلم، مَاتَ وَهُوَ ابْنُ ثَلاثٍ وَسِتِّينَ سَنَةً‏.‏","english":{"narrator":"'A’isha said:","text":"\"The Prophet died (Allah bless him and give him peace) when he was sixty-three years of age.”"}},{"id":4,"idInBook":4,"chapterId":53,"bookId":16,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، وَيَعْقُوبُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ، قَالا‏:‏ حَدَّثَنَا إِسْمَاعِيلُ بْنُ عُلَيَّةَ، عَنْ خَالِدٍ الْحَذَّاءِ، قَالَ‏:‏ أَنْبَأَنَا عَمَّارٌ مَوْلَى بَنِي هَاشِمٍ، قَالَ‏:‏ سَمِعْتُ ابْنَ عَبَّاسٍ، يَقُولُ‏:‏ تُوُفِّيَ رَسُولُ اللَّه ِصلى الله عليه وسلم، وَهُوَ ابْنُ خَمْسٍ وَسِتِّينَ‏.‏","english":{"narrator":"Ibn 'Abbas said:","text":"\"Allah’s Messenger died (Allah bless him and give him peace) when he was sixty-five years of age.”"}},{"id":5,"idInBook":5,"chapterId":53,"bookId":16,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، وَمُحَمَّدُ بْنُ أَبَانَ، قَالا‏:‏ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، قَالَ‏:‏ حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ دَغْفَلِ بْنِ حَنْظَلَةَ‏:‏ أَنَّ النَّبِيَّ صلى الله عليه وسلم، قُبِضَ وَهُوَ ابْنُ خَمْسٍ وَسِتِّينَ، قَالَ أَبُو عِيسَى‏:‏ وَدَغْفَلُ، لا نَعْرِفُ لَهُ سَمَاعًا مِنَ النَّبِيِّ صلى الله عليه وسلم، وَكَانَ فِي زَمَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏","english":{"narrator":"Daghfal ibn Hanzala said:","text":"\"The Prophet died (Allah bless him and give him peace) when he was sixty-five years of age.”"}},{"id":6,"idInBook":6,"chapterId":53,"bookId":16,"arabic":"حَدَّثَنَا إِسْحَاقُ بْنُ مُوسَى الأَنْصَارِيُّ، قَالَ‏:‏ حَدَّثَنَا مَعْنٌ، حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّهُ سَمِعَهُ، يَقُولُ‏:‏ كَانَ رَسُولُ اللهِ صلى الله عليه وسلم، لَيْسَ بِالطَّوِيلِ الْبَائِنِ، وَلا بِالْقَصِيرِ، وَلا بِالأَبْيَضِ الأَمْهَقِ، وَلا بِالآدَمِ، وَلا بِالْجَعْدِ الْقَطَطِ، وَلا بِالسَّبْطِ، بَعَثَهُ اللَّهُ تَعَالَى عَلَى رَأْسِ أَرْبَعِينَ سَنَةً، فَأَقَامَ بِمَكَّةَ عَشْرَ سِنِينَ، وَبِالْمَدِينَةِ عَشْرَ سِنِينَ، وَتَوَفَّاهُ اللَّهُ عَلَى رَأْسِ سِتِّينَ سَنَةً، وَلَيْسَ فِي رَأْسِهِ وَلِحْيَتِهِ عِشْرُونَ شَعَرَةً بَيْضَاءَ‏.‏\n\nحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكِ بْنِ أَنَسٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ أَنَسِ بْنِ مَالِكٍ، نَحْوَهُ‏.‏","english":{"narrator":"Anas ibn Malik said:","text":"“Allah’s Messenger (Allah bless him and give him peace) was neither very tall of stature, nor short. His skin was neither pale white, nor tawny, and his hair was neither crisply curled, nor lank. Allah (Exalted is He) sent him  at the end of forty years of life, so he stayed in Mecca for ten years and in Medina for ten years, and Allah took him unto Himself at the end of sixty years, with fewer than twenty white hairs on his head and in his beard.”"}}],"chapter":{"id":53,"bookId":16,"arabic":"باب ماجاء في سن رسول الله صلى الله عليه وسلم","english":"The Noble Age Of Sayyidina Rasoolullah"}}