{"metadata":{"length":14,"arabic":{"title":"الشمائل المحمدية","author":"الإمام الترمذي","introduction":"باب ماجاء في وفاة رسول الله صلى الله عليه وسلم"},"english":{"title":"Shama'il Muhammadiyah","author":"Imam Tirmidhi","introduction":"The Death Of Sayyidina Rasoolullah"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":54,"bookId":16,"arabic":"حَدَّثَنَا أَبُو عَمَّارٍ الْحُسَيْنُ بْنُ حُرَيْثٍ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَغَيْرُ وَاحِدٍ، قَالُوا‏:‏ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ‏:‏ آخِرُ نَظْرَةٍ نَظَرْتُهَا إِلَى رَسُولِ اللهِ صلى الله عليه وسلم، كَشْفُ السِّتَارَةِ يَوْمَ الاثْنَيْنِ، فَنَظَرْتُ إِلَى وَجْهِهِ كَأَنَّهُ وَرَقَةُ مُصْحَفٍ، وَالنَّاسُ خَلْفَ أَبِي بَكْرٍ، فَكَادَ النَّاسُ أَنْ يَضْطَربُوا، فَأَشَارَ إِلَى النَّاسِ أَنِ اثْبُتُوا، وَأَبُو بَكْرٍ يَؤُمُّهُمْ وَأَلْقَى السِّجْفَ، وَتُوُفِّيَ رَسُولُ اللهِ صلى الله عليه وسلم مِنْ آخِرِ ذَلِكَ الْيَوْمِ‏.‏","english":{"narrator":"Anas ibn Malik said:","text":"\"The last occasion when I caught sight of Allah’s Messenger (Allah bless him and give him peace) was the unveiling of the curtain on a Monday. I looked at his face as if it were a parchment of the Qur’an, as the people were performing the ritual prayer behind Abu Bakr. The people were about to get restless, so he gestured to them to keep calm, as Abu Bakr led them in prayer, and he cast the curtain aside. Allah’s Messenger (Allah bless him and give him peace) died at the end of that day.”"}},{"id":2,"idInBook":2,"chapterId":54,"bookId":16,"arabic":"حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ الْبَصْرِيُّ، قَالَ‏:‏ حَدَّثَنَا سُلَيْمُ بْنُ أَخْضَرَ، عَنِ ابْنِ عَوْنٍ، عَنِ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ‏:‏ كُنْتُ مُسْنِدَةً النَّبِيَّ صلى الله عليه وسلم، إِلَى صَدْرِي أَوْ قَالَتْ‏:‏ إِلَى حِجْرِي فَدَعَا بِطَسْتٍ لِيَبُولَ فِيهِ، ثُمَّ بِالَ، فَمَاتَ‏.‏","english":{"narrator":"A’isha said:","text":"\"I was resting the Prophet (Allah bless him and give him peace) on my chest (or: on my lap), when he called for a basin in which to urinate. Then he urinated and died soon after.”"}},{"id":3,"idInBook":3,"chapterId":54,"bookId":16,"arabic":"حَدَّثَنَا قُتَيْبَةُ ‏,‏ حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ الْهَادِ، عَنْ مُوسَى بْنِ سَرْجِسَ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ، أَنَّهَا قَالَتْ‏:‏ رَأَيْتُ رَسُولَ اللهِ صلى الله عليه وسلم، وَهُوَ بِالْمَوْتِ وَعِنْدَهُ قَدَحٌ فِيهِ مَاءٌ، وَهُوَ يُدْخِلُ يَدَهُ فِي الْقَدَحِ، ثُمَّ يَمْسَحُ وَجْهَهُ بِالْمَاءِ، ثُمَّ يَقُولُ‏:‏ اللَّهُمَّ أَعِنِّي عَلَى مُنْكَرَاتِ أَوْ قَالَ‏:‏ عَلَى سَكَرَاتِ الْمَوْتِ‏.‏","english":{"narrator":"A’isha said:","text":"\"I saw Allah’s Messenger (Allah bless him and give him peace) when he was at the point of death, and beside him there was a vessel containing water. He would dip his hand into the vessel, then wipe his face with the water, saying: 'O Allah, help me against the atrocities of death (or: the agonies of death)!’”"}},{"id":4,"idInBook":4,"chapterId":54,"bookId":16,"arabic":"حَدَّثَنَا الْحَسَنُ بْنُ الصَّبَّاحِ الْبَزَّازُ، قَالَ‏:‏ حَدَّثَنَا مُبَشِّرُ بْنُ إِسْمَاعِيلَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْعَلاءِ، عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ، عَنْ عَائِشَةَ، قَالَتْ‏:‏ لا أَغْبِطُ أَحَدًا بَهَوْنِ مَوْتٍ بَعْدَ الَّذِي رَأَيْتُ مِنْ شِدَّةِ مَوْتِ رَسُولِ اللهِ صلى الله عليه وسلم‏.‏\nقال أبو عيسى: سألت أبا زرعه فقلت له: من عبد الرحمن بن العلاء هذا؟\nفقال: هو عبد الرحمن بن العلاء اللجلاج.","english":{"narrator":"'A’isha said:","text":"\"No more will I envy anyone for an easy death now that I have seen how the Messenger of Allah (Allah bless him and give him peace) suffered in his passing.”"}},{"id":5,"idInBook":5,"chapterId":54,"bookId":16,"arabic":"حَدَّثَنَا أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلاءِ، قَالَ‏:‏ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ وَهُوَ ابْنُ الْمُلَيْكِيِّ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنْ عَائِشَةَ، قَالَتْ‏:‏ لَمَّا قُبِضَ رَسُولُ اللهِ صلى الله عليه وسلم، اخْتَلَفُوا فِي دَفْنِهِ، فَقَالَ أَبُو بَكْرٍ‏:‏ سَمِعْتُ مِنْ رَسُولِ اللهِ صلى الله عليه وسلم، شَيْئًا مَا نَسِيتُهُ، قَالَ‏:‏ مَا قَبَضَ اللَّهُ نَبِيًّا إِلا فِي الْمَوْضِعِ الَّذِي يُحِبُّ أَنْ يُدْفَنَ فِيهِ، ادْفِنُوهُ فِي مَوْضِعِ فِرَاشِهِ‏.‏","english":{"narrator":"A’isha said:","text":"\"When Allah’s Messenger died (Allah bless him and give him peace), they disagreed over where to bury him, so Abu Bakr said: “I heard Allah’s Messenger (Allah bless him and give him peace) say something I have never forgotten. He said: ‘Never has Allah taken a Prophet , but in the place where he would want to be buried.’ So bury him in the spot where his pallet is!'”"}},{"id":6,"idInBook":6,"chapterId":54,"bookId":16,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، وعياش العنبرى ‏,‏ وسوار بن عبد الله ‏,‏ وغير واحد ‏,‏ قالوا‏:‏ أخبرنا يحيي بن سعيد ‏,‏ عن سفيان الثورى ‏,‏ عن موسى بن أبي عائشة ‏,‏ عن عبيد الله ‏,‏ عن ابن عباس وعائشة‏:‏ أن أبا بكر قبل النبي صلى الله عليه وسلم بعدما مات‏.‏","english":{"narrator":"Ibn 'Abbas and ‘A’isha report:","text":"\"Abu Bakr kissed the Prophet (Allah bless him and give him peace) after he died.”"}},{"id":7,"idInBook":7,"chapterId":54,"bookId":16,"arabic":"حدثنا نصر بن علي الجهضمي، حدثنا مرحوم بن عبد العزيز العطار، عن يزيد بن بابنوس، عن عائشة أن أبا بكر دخل على النبي صلى الله عليه وسلم بعد وفاته فوضع فمه بين عينيه، ووضع يديه على ساعديه، وقال‏:‏ وانبياه ‏,‏ واصفياه، واخليلاه‏.‏","english":{"narrator":"A’isha said:","text":"\"Abu Bakr entered the presence of the Prophet (Allah bless him and give him peace) after his demise, whereupon he placed his mouth between his eyes, and his hands on his forearms, exclaiming: 'O Prophet! O best friend! O bosom friend!'”"}},{"id":8,"idInBook":8,"chapterId":54,"bookId":16,"arabic":"حَدَّثَنَا بِشْرُ بْنُ هِلالٍ الصَّوَّافُ الْبَصْرِيُّ، قَالَ‏:‏ حَدَّثَنَا جَعْفَرُ بْنُ سُلَيْمَانَ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، قَالَ‏:‏ لَمَّا كَانَ الْيَوْمُ الَّذِي دَخَلَ فِيهِ رَسُولُ اللهِ صلى الله عليه وسلم الْمَدِينَةَ أَضَاءَ مِنْهَا كُلُّ شَيْءٍ، فَلَمَّا كَانَ الْيَوْمُ الَّذِي مَاتَ فِيهِ أَظْلَمَ مِنْهَا كُلُّ شَيْءٍ، وَمَا نَفَضْنَا أَيْدِيَنَا مِنَ التُّرَابِ، وَإِنَا لَفِي دَفْنِهِ صلى الله عليه وسلم، حَتَّى أَنْكَرْنَا قُلُوبَنَا‏.‏","english":{"narrator":"Anas said:","text":"\"On the day when Allah’s Messenger (Allah bless him and give him peace) entered Medina, every part of it shone bright, and on the day when he died, every part of it was gloomy. We did not shake the dust off our hands, and we\nwere engaged in his burial until we no longer recognized our own hearts.”"}},{"id":9,"idInBook":9,"chapterId":54,"bookId":16,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمٍ، قَالَ‏:‏ حَدَّثَنَا عَامِرُ بْنُ صَالِحٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ‏:‏ تُوُفِّيَ رَسُولُ اللهِ صلى الله عليه وسلم يَوْمَ الاثْنَيْنِ‏.‏","english":{"narrator":"A’isha said:","text":"\"Allah’s Messenger died (Allah bless him and give him peace) on a Monday.”"}},{"id":10,"idInBook":10,"chapterId":54,"bookId":16,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُمَرَ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ، عَنْ أَبِيهِ، قَالَ‏:‏ قُبِضَ رَسُولُ اللهِ صلى الله عليه وسلم يَوْمَ الاثْنَيْنِ فَمَكَثَ ذَلِكَ الْيَوْمَ وَلَيْلَةَ الثُّلاثَاءِ، وَدُفِنَ مِنَ اللَّيْلِ، وَقَالَ سُفْيَانُ‏:‏ وَقَالَ غَيْرُهُ‏:‏ يُسْمَعُ صَوْتُ الْمَسَاحِي مِنْ آخِرِ اللَّيْلِ‏.‏","english":{"narrator":"Ja'far ibn Muhammad reported that his father said:","text":"\"Allah’s Messenger (Allah bless him and give him peace) died on Monday, after which he remained that day and Tuesday night, and he was buried during the night.”\nAccording to Sufyan , someone else said: “The sound of the iron shovels could be heard during the latter part of the night.”"}},{"id":11,"idInBook":11,"chapterId":54,"bookId":16,"arabic":"حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، عَنْ شَرِيكِ بْنِ عَبْدِ اللهِ بْنِ أَبِي نَمِرٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، قَالَ‏:‏ تُوُفِّيَ رَسُولُ اللهِ صلى الله عليه وسلم يَوْمَ الاثْنَيْنِ، وَدُفِنَ يَوْمَ الثُّلاثَاءِ‏.‏\nقَالَ أَبُو عِيسَى‏:‏ هَذَا حَدِيثٌ غَرِيبٌ‏.‏","english":{"narrator":"Abu Salama ibn 'Abd ar-Rahman ibn 'Awf said:","text":"\"Allah’s Messenger (Allah bless him and give him peace) died on Monday and he was buried on Tuesday.”"}},{"id":12,"idInBook":12,"chapterId":54,"bookId":16,"arabic":"حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ اللهِ بْنُ دَاوُدَ، قَالَ‏:‏ حَدَّثَنَا سَلَمَةُ بْنُ نُبَيْطٍ، عَنْ نُعَيْمِ بْنِ أَبِي هِنْدَ، عَنْ نُبَيْطِ بْنِ شَرِيطٍ، عَنْ سَالِمِ بْنِ عُبَيْدٍ، وَكَانَتْ لَهُ صُحْبَةٌ، قَالَ‏:‏ أُغْمِيَ عَلَى رَسُولِ اللهِ صلى الله عليه وسلم، فِي مَرَضِهِ فَأَفَاقَ، فَقَالَ‏:‏ حَضَرَتِ الصَّلاةُ‏؟‏ فَقَالُوا‏:‏ نَعَمْ فَقَالَ‏:‏ مُرُوا بِلالا فَلْيُؤَذِّنْ، وَمُرُوا أَبَا بَكْرٍ أَنْ يُصَلِّيَ للنَّاسِ أَوْ قَالَ‏:‏ بِالنَّاسِ، قَالَ‏:‏ ثُمَّ أُغْمِيَ عَلَيْهِ، فَأَفَاقَ، فَقَالَ‏:‏ حَضَرَتِ الصَّلاةُ‏؟‏ فَقَالُوا‏:‏ نَعَمْ فَقَالَ‏:‏ مُرُوا بِلالا فَلْيُؤَذِّنْ، وَمُرُوا أَبَا بَكْرٍ فَلْيُصَلِّ بِالنَّاسِ، فَقَالَتْ عَائِشَةُ‏:‏ إِنَّ أَبِي رَجُلٌ أَسِيفٌ، إِذَا قَامَ ذَلِكَ الْمَقَامَ بَكَى فَلا يَسْتَطِيعُ، فَلَوْ أَمَرْتَ غَيْرَهُ، قَالَ‏:‏ ثُمَّ أُغْمِيَ عَلَيْهِ فَأَفَاقَ فَقَالَ‏:‏ مُرُوا بِلالا فَلْيُؤَذِّنْ، وَمُرُوا أَبَا بَكْرٍ فَلْيُصَلِّ بِالنَّاسِ، فَإِنَّكُنَّ صَوَاحِبُ أَوْ صَوَاحِبَاتُ يُوسُفَ، قَالَ‏:‏ فَأُمِرَ بِلالٌ فَأَذَّنَ، وَأُمِرَ أَبُو بَكْرٍ فَصَلَّى بِالنَّاسِ، ثُمَّ إِنَّ رَسُولَ اللهِ صلى الله عليه وسلم، وَجَدَ خِفَّةً، فَقَالَ‏:‏ انْظُرُوا لِي مَنْ أَتَّكِئِ عَلَيْهِ، فَجَاءَتْ بَرِيرَةُ، وَرَجُلٌ آخَرُ، فَاتَّكَأَ عَلَيْهِمَا فَلَمَّا رَآهُ أَبُو بَكْرٍ ذَهَبَ لِينْكُصَ فَأَوْمَأَ إِلَيْهِ أَنْ يَثْبُتَ مَكَانَهُ، حَتَّى قَضَى أَبُو بَكْرٍ صَلاتَهُ‏.‏‏.‏\nثُمَّ إِنَّ رَسُولَ اللهِ صلى الله عليه وسلم قُبِضَ، فَقَالَ عُمَرُ‏:‏ وَاللَّهِ لا أَسْمَعُ أَحَدًا يَذْكُرُ أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم، قُبِضَ إِلا ضَرَبْتُهُ بِسَيْفِي هَذَا، قَالَ‏:‏ وَكَانَ النَّاسُ أُمِّيِّينَ لَمْ يَكُنْ فِيهِمْ نَبِيٌّ قَبْلَهُ، فَأَمْسَكَ النَّاسُ، فَقَالُوا‏:‏ يَا سَالِمُ، انْطَلِقْ إِلَى صَاحِبِ رَسُولِ اللهِ صلى الله عليه وسلم فَادْعُهُ، فَأَتَيْتُ أَبَا بَكْرٍ وَهُوَ فِي الْمَسْجِدِ فَأَتَيْتُهُ أَبْكِي دَهِشًا، فَلَمَّا رَآنِي، قَالَ‏:‏ أَقُبِضَ رَسُولُ اللهِ صلى الله عليه وسلم‏؟‏ قُلْتُ‏:‏ إِنَّ عُمَرَ، يَقُولُ‏:‏ لا أَسْمَعُ أَحَدًا يَذْكُرُ أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم قُبِضَ إِلا ضَرَبْتُهُ بِسَيْفِي هَذَا، فَقَالَ لِي‏:‏ انْطَلِقْ، فَانْطَلَقْتُ مَعَهُ، فَجَاءَ هُوَ وَالنَّاسُ قَدْ دَخَلُوا عَلَى رَسُولِ اللهِ صلى الله عليه وسلم، فَقَالَ‏:‏ يَا أَيُّهَا النَّاسُ، أَفْرِجُوا لِي، فَأَفْرَجُوا لَهُ فَجَاءَ حَتَّى أَكَبَّ عَلَيْهِ وَمَسَّهُ، فَقَالَ‏:‏ إِنَّكَ مَيِّتٌ وَإِنَّهُمْ مَيِّتُونَ، ثُمَّ قَالُوا‏:‏ يَا صَاحِبَ رَسُولِ اللهِ صلى الله عليه وسلم، أَقُبِضَ رَسُولُ اللهِ صلى الله عليه وسلم‏؟‏ قَالَ‏:‏ نَعَمْ، فَعَلِمُوا أَنْ قَدْ صَدَقَ، قَالُوا‏:‏ يَا صَاحِبَ رَسُولِ اللهِ صلى الله عليه وسلم، أَيُصَلَّى عَلَى رَسُولِ اللهِ‏؟‏ قَالَ‏:‏ نَعَمْ، قَالُوا‏:‏ وَكَيْفَ‏؟‏ قَالَ‏:‏ يَدْخُلُ قَوْمٌ فَيُكَبِّرُونَ وَيُصَلُّونَ، وَيَدْعُونَ، ثُمَّ يَخْرُجُونَ، ثُمَّ يَدْخُلُ قَوْمٌ فَيُكَبِّرُونَ وَيُصَلُّونَ وَيَدْعُونَ، ثُمَّ يَخْرُجُونَ، حَتَّى يَدْخُلَ النَّاسُ، قَالُوا‏:‏ يَا صَاحِبَ رَسُولِ اللهِ صلى الله عليه وسلم، أَيُدْفَنُ رَسُولُ اللهِ صلى الله عليه وسلم‏؟‏ قَالَ‏:‏ نَعَمْ، قَالُوا‏:‏ أَينَ‏؟‏ قَالَ‏:‏ فِي الْمكَانِ الَّذِي قَبَضَ اللَّهُ فِيهِ رُوحَهُ، فَإِنَّ اللَّهَ لَمْ يَقْبِضْ رُوحَهُ إِلا فِي مَكَانٍ طَيِّبٍ فَعَلِمُوا أَنْ قَدْ صَدَقَ، ثُمَّ أَمَرَهُمْ أَنْ يَغْسِلَهُ بَنُو أَبِيهِ، وَاجْتَمَعَ الْمُهَاجِرُونَ يَتَشَاوَرُونَ، فَقَالُوا‏:‏ انْطَلِقْ بِنَا إِلَى إِخْوانِنَا مِنَ الأَنْصَارِ نُدْخِلُهُمْ مَعَنَا فِي هَذَا الأَمْرِ، فَقَالَتِ الأَنْصَارُ‏:‏ مِنَّا أَمِيرٌ وَمِنْكُمْ أَمِيرٌ، فَقَالَ عُمَرُ بْنُ الْخَطَّابِ‏:‏ مَنْ لَهُ مِثْلُ هَذِهِ الثَّلاثِ ثَانِيَ اثْنَيْنِ إِذْ هُمَا فِي الْغَارِ إِذْ يَقُولُ لِصَاحِبِهِ لا تَحْزَنْ إِنَّ اللَّهَ مَعَنَا مَنْ هُمَا‏؟‏ قَالَ‏:‏ ثُمَّ بَسَطَ يَدَهُ فَبَايَعَهُ وَبَايَعَهُ النَّاسُ بَيْعَةً حَسَنَةً جَمِيلَةً‏.‏","english":{"narrator":"Salim ibn 'Ubaida said:","text":"“Allah’s Messenger (Allah bless him and give him peace) lost consciousness in his illness, then he regained consciousness and said: ‘Has the ritual prayer arrived?’ They said: ‘Yes,’ so he said: ‘Command Bilal to give the call to prayer, and command Abu Bakr to lead the people in prayer.’ Then he lost consciousness, and when he recovered, he said: ‘Has the ritual prayer arrived?’ They said: ‘Yes,’ so he said: ‘Command Bilal to give the call to prayer, and command Abu Bakr to lead the people in prayer.’ 'A'isha then said: ‘My father is a melancholy man. If he is given that responsibility, he will weep and lose command of himself. SO if only you would appoint someone else!'\nHe  said: “Then he lost consciousness and recovered, so he said: ‘Command Bilal to give the call to prayer, and command Abu Bakr to lead the people in prayer, for you are the female companions of Yusuf!’ Bilal was therefore commanded, so he gave the call to prayer, and Abu Bakr was commanded, so he led the people in prayer. Then Allah’s Messenger (Allah bless him and give him peace) felt light in the head, so he said: ‘Find me someone I can lean on!’ Barira and another man therefore came to him, so he leaned on them. When Abu Bakr saw him, the man was about to withdraw, but he signaled for him to stay in his place until Abu Bakr completed his ritual prayer. Then Allah’s Messenger died (Allah bless him and give him peace), so 'Umar said: ‘If I hear anyone mention that Allah’s Messenger (Allah bless him and give him peace) has died, I will strike him with this sword of mine!”’\nHe  said: “The people were unlettered folk among whom there had never come a prophet before, so they held their tongues. But then they said: ‘O Salim, go to the Companion of Allah’s Messenger (Allah bless him and give him peace) and summon him.’ So I went to see Abu Bakr, in the mosque. I came to him weeping and perplexed, so when he saw me, he said: ‘Has Allah’s Messenger died (Allah bless him and give him peace)?’ I replied: 'Umar says: “If anyone mentions that Allah’s Messenger (Allah bless him and give him peace) has died, I will strike him with this sword of mine!” He then said to me: ‘Go outside,’ so I went outside with him. Then he came and found the people in the presence of Allah’s Messenger (Allah bless him and give him peace).\n“He therefore said: ‘O people, get out of my way,’ so they got out of his way. Then he leaned over him and touched him, saying: “You will surely die, and they will surely die.\" .’” (Al-Qur'an.9:4O). Who are the two of them?’ Then he extended his hand, so they pledged allegiance to him, and the people paid him a beautiful homage.”"}},{"id":13,"idInBook":13,"chapterId":54,"bookId":16,"arabic":"حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ اللهِ بْنُ الزُّبَيْرِ، شَيْخٌ بَاهِلِيٌّ قَدِيمٌ بَصْرِيٌّ قَالَ‏:‏ حَدَّثَنَا ثَابِتٌ الْبُنَانِيُّ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ‏:‏ لَمَّا وَجَدَ رَسُولُ اللهِ صلى الله عليه وسلم، مِنْ كُرَبِ الْمَوْتِ مَا وَجَدَ، قَالَتْ فَاطِمَةُ‏:‏ وَاكَرْبَاهُ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ لا كَرْبَ عَلَى أَبِيكِ بَعْدَ الْيَوْمِ، إِنَّهُ قَدْ حَضَرَ مِنْ أَبِيكِ مَا لَيْسَ بِتَارِكٍ مِنْهُ أَحَدًا الْمُوافَاةُ يَوْمَ الْقِيَامَةِ‏.‏","english":{"narrator":"Anas ibn Malik said:","text":"\"When Allah’s Messenger (Allah bless him and give him peace) was enduring of the agony of death, Fatima (may Allah be well pleased with her) exclaimed: 'Alas for his agony!' to which the Prophet replied (Allah bless him and\ngive him peace): 'Your father will suffer no agony from this day forth. Your father has met the fate from which no one is exempt, and which precedes ones appearance before Allah\non the Day of Resurrection.'”"}},{"id":14,"idInBook":14,"chapterId":54,"bookId":16,"arabic":"حَدَّثَنَا أَبُو الْخَطَّابِ زِيَادُ بْنُ يَحْيَى الْبَصْرِيُّ، وَنَصْرُ بْنُ عَلِيٍّ، قَالا‏:‏ حَدَّثَنَا عَبْدُ رَبِّهِ بْنُ بَارِقٍ الْحَنَفِيُّ، قَالَ‏:‏ سَمِعْتُ جَدِّي أَبَا أُمِّي سِمَاكَ بْنَ الْوَلِيدِ يُحَدِّثُ، أَنَّهُ سَمِعَ ابْنَ عَبَّاسٍ، يُحَدِّثُ أَنَّهُ سَمِعَ رَسُولَ اللهِ صلى الله عليه وسلم، يَقُولُ‏:‏ مَنْ كَانَ لَهُ فَرَطَانِ مِنْ أُمَّتِي أَدْخَلَهُ اللَّهُ تَعَالَى بِهِمَا الْجَنَّةَ، فَقَالَتْ عَائِشَةُ‏:‏ فَمَنْ كَانَ لَهُ فَرَطٌ مِنْ أُمَّتِكَ‏؟‏ قَالَ‏:‏ وَمَنْ كَانَ لَهُ فَرَطٌ يَا مُوَفَّقَةُ قَالَتْ‏:‏ فَمَنْ لَمْ يَكُنْ لَهُ فَرَطٌ مِنْ أُمَّتِكَ‏؟‏ قَالَ‏:‏ فَأَنَا فَرَطٌ لأُمَّتِي، لَنْ يُصَابُوا بِمِثْلِي‏.‏","english":{"narrator":"Ibn 'Abbas (may Allah the Exalted be well pleased with him and his father) related that:","text":"he heard Allah’s Messenger say (Allah bless him and give him peace): 'If someone has two children from my Community who died an untimely death, Allah will cause him to enter the Garden of Paradise on their account,' so 'A'isha said (may Allah be well pleased with her): 'What about someone who has only one child from your Community who has died an untimely death?' He said: 'Also someone who has only one child who has died young, O favored one!' She said: 'So what about someone who does not have any child from your Community who has died as an infant?' He said: 'I am a child of my Community who died an untimely death. Never again will they be afflicted by the loss of the likes of me!'”"}}],"chapter":{"id":54,"bookId":16,"arabic":"باب ماجاء في وفاة رسول الله صلى الله عليه وسلم","english":"The Death Of Sayyidina Rasoolullah"}}