{"metadata":{"length":16,"arabic":{"title":"الشمائل المحمدية","author":"الإمام الترمذي","introduction":"باب ما جاء في لباس رسول الله صلى الله عليه وسلم"},"english":{"title":"Shama'il Muhammadiyah","author":"Imam Tirmidhi","introduction":"The Dressing Of Rasoolullah"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":8,"bookId":16,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ حُمَيْدٍ الرَّازِيُّ، قَالَ‏:‏ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى، وَأَبُو تُمَيْلَةَ، وَزَيْدُ بْنُ حُبَابٍ، عَنْ عَبْدِ الْمُؤْمِنِ بْنِ خَالِدٍ، عَنْ عَبْدِ اللهِ بْنِ بُرَيْدَةَ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ‏:‏ كَانَ أَحَبَّ الثِّيَابِ إِلَى رَسُولِ اللهِ صلى الله عليه وسلم الْقَمِيصُ‏.‏","english":{"narrator":"Umm ul Mu'mineen Umm Salama said:","text":"\"The apparel dearest to Allah’s Messenger (Allah bless him and give him peace) was the shirt .”"}},{"id":2,"idInBook":2,"chapterId":8,"bookId":16,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ‏:‏ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى، عَنْ عَبْدِ الْمُؤْمِنِ بْنِ خَالِدٍ، عَنْ عَبْدِ اللهِ بْنِ بُرَيْدَةَ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ‏:‏ كَانَ أَحَبَّ الثِّيَابِ إِلَى رَسُولِ اللهِ صلى الله عليه وسلم الْقَمِيصُ‏.‏","english":{"narrator":"Umm Salama said:","text":"\"The apparel dearest to Allah’s Messenger (Allah bless him and give him peace) was the shirt.”"}},{"id":3,"idInBook":3,"chapterId":8,"bookId":16,"arabic":"حَدَّثَنَا زِيَادُ بْنُ أَيُّوبَ الْبَغْدَادِيُّ، قَالَ‏:‏ حَدَّثَنَا أَبُو تُمَيْلَةَ، عَنْ عَبْدِ الْمُؤْمِنِ بْنِ خَالِدٍ، عَنْ عَبْدِ اللهِ بْنِ بُرَيْدَةَ، عَنْ أَمِّهِ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ‏:‏ كَانَ أَحَبَّ الثِّيَابِ إِلَى رَسُولِ اللهِ صلى الله عليه وسلم يَلْبَسُهُ، الْقَمِيصُ‏.‏","english":{"narrator":"Umm Salama said:","text":"\"The apparel dearest to Allah’s Messenger (Allah bless him and give him peace) was the shirt he used to wear.”"}},{"id":4,"idInBook":4,"chapterId":8,"bookId":16,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ مُحَمَّدِ بْنِ الْحَجَّاجِ، قَالَ‏:‏ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، قَالَ‏:‏ حَدَّثَنِي أَبِي، عَنْ بُدَيْلٍ يَعْنِي ابْنَ مَيْسَرَةَ الْعُقَيْلِيَّ، عَنْ شَهْرِ بْنِ حَوْشَبٍ، عَنْ أَسْمَاءَ بِنْتِ يَزِيدَ، قَالَتْ‏:‏ كَانَ كُمُّ قَمِيصِ رَسُولِ اللهِ صلى الله عليه وسلم إِلَى الرُّسْغِ‏.‏","english":{"narrator":"Asma bint Yazid said:","text":"“The sleeve of the shirt of Allah’s Messenger (Allah bless him and give him peace) extended to the wrist.”"}},{"id":5,"idInBook":5,"chapterId":8,"bookId":16,"arabic":"حَدَّثَنَا أَبُو عَمَّارٍ الْحُسَيْنُ بْنُ حُرَيْثٍ، قَالَ‏:‏ حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ‏:‏ حَدَّثَنَا زُهَيْرٌ، عَنْ عُرْوَةَ بْنِ عَبْدِ اللهِ بْنِ قُشَيْرٍ، عَنْ مُعَاوِيَةَ بْنِ قُرَّةَ، عَنْ أَبِيهِ، قَالَ‏:‏ أَتَيْتُ رَسُولَ اللهِ صلى الله عليه وسلم فِي رَهْطٍ مِنْ مُزَيْنَةَ لِنُبَايِعَهُ، وَإِنَّ قَمِيصَهُ لَمُطْلَقٌ، أَوْ قَالَ‏:‏ زِرُّ قَمِيصِهِ مُطْلَقٌ قَالَ‏:‏ فَأَدْخَلْتُ يَدِي فِي جَيْبِ قَمِيصِهِ، فَمَسَسْتُ الْخَاتَمَ‏.‏","english":{"narrator":"Mu'awiya ibn Qurra reported that his father said:","text":"“I came to Allah’s Messenger (Allah bless him and give him peace) in a group of fewer than ten men from the Muzaina tribe, so that we might pay homage to him, and his shirt was set loose (or: “the button of his shirt was set loose”), so I inserted my hand in the breast of his shirt and I touched the Seal.”"}},{"id":6,"idInBook":6,"chapterId":8,"bookId":16,"arabic":"حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ الْفَضْلِ، قَالَ‏:‏ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ حَبِيبِ بْنِ الشَّهِيدِ، عَنِ الْحَسَنِ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم خَرَجَ وَهُوَ يَتَّكِئُ عَلَى أُسَامَةَ بْنِ زَيْدٍ عَلَيْهِ ثَوْبٌ قِطْرِيٌّ، قَدْ تَوَشَّحَ بِهِ، فَصَلَّى بِهِمْ‏.‏","english":{"narrator":"Anas ibn Malik said:","text":"\"The Prophet (Allah bless him and give him peace) came out leaning on Usama ibn Zaid, wearing an outer garment of coarse cotton fabric, which he had thrown on loosely, then he led them in the ritual prayer.”"}},{"id":7,"idInBook":7,"chapterId":8,"bookId":16,"arabic":"حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ اللهِ بْنُ الْمُبَارَكِ، عَنْ سَعِيدِ بْنِ إِيَاسٍ الْجُرَيْرِيِّ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ‏:‏ كَانَ رَسُولُ اللهِ صلى الله عليه وسلم، إِذَا اسْتَجَدَّ ثَوْبًا سَمَّاهُ بِاسْمِهِ عِمَامَةً أَوْ قَمِيصًا أَوْ رِدَاءً، ثُمَّ يَقُولُ‏:‏ اللَّهُمَّ لَكَ الْحَمْدُ كَمَا كَسَوْتَنِيهِ، أَسْأَلُكَ خَيْرَهُ وَخَيْرَ مَا صُنِعَ لَهُ، وَأَعُوذُ بِكَ مِنْ شَرِّهِ وَشَرِّ مَا صُنِعَ لَهُ‏.‏\n\nحَدَّثَنَا هِشَامُ بْنُ يُونُسَ الْكُوفِيُّ، قَالَ‏:‏ حَدَّثَنَا الْقَاسِمُ بْنُ مَالِكٍ الْمُزَنِيُّ، عَنِ الْجُرَيْرِيِّ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنِ النَّبِيِّ صلى الله عليه وسلم، نَحْوَهُ‏.‏","english":{"narrator":"Abu Sa'id al-Khudri said:","text":"\"When Allah’s Messenger (Allah bless him and give him peace) donned a new garment, he would call it by its name, then he would say: 'O Allah praise be to You, as You have clothed me with it! I beg You for its goodness and the goodness of what it has been made for, and I take refuge with You from its evil and the evil of what it has been made for!’”"}},{"id":8,"idInBook":8,"chapterId":8,"bookId":16,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ‏:‏ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، قَالَ‏:‏ حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ‏:‏ كَانَ أَحَبَّ الثِّيَابِ إِلَى رَسُولِ اللهِ صلى الله عليه وسلم، يَلْبَسُهُ الْحِبَرَةُ‏.‏","english":{"narrator":"Anas ibn Malik said:","text":"“The apparel dearest to Allah’s Messenger (Allah bless him and give him peace) was the hibara  that he used to wear.”"}},{"id":9,"idInBook":9,"chapterId":8,"bookId":16,"arabic":"حَدَّثَنَا مَحْمُودُ بْنُ غَيْلانَ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنْ عَوْنِ بْنِ أَبِي جُحَيْفَةَ، عَنْ أَبِيهِ، قَالَ‏:‏ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم، وَعَلَيْهِ حُلَّةٌ حَمْرَاءُ، كَأَنِّي أَنْظُرُ إِلَى بَرِيقِ سَاقَيْهِ‏.‏","english":{"narrator":"Awn ibn Abi Juhaifa said that his father said:","text":"“I saw the Prophet (Allah bless him and give him peace) wearing a red garb, as if I were looking at the sheen of his legs.” Sufyan said: “I think it was a hibara .”"}},{"id":10,"idInBook":10,"chapterId":8,"bookId":16,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ خَشْرَمٍ، قَالَ‏:‏ حَدَّثَنَا عِيسَى بْنُ يُونُسَ، عَنْ إِسْرَائِيلَ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، قَالَ‏:‏ مَا رَأَيْتُ أَحَدًا مِنَ النَّاسِ أَحْسَنَ فِي حُلَّةٍ حَمْرَاءَ، مِنْ رَسُولِ اللهِ صلى الله عليه وسلم، إِنْ كَانَتْ جُمَّتُهُ لَتَضْرِبُ قَرِيبًا مِنْ مَنْكِبَيْهِ‏.‏","english":{"narrator":"Al-Bara’ ibn ‘Azib said:","text":"\"I never saw anyone among the people more handsome in a red garb than Allah’s Messenger (Allah bless him and give him peace), when the hair of his head was touching close to his shoulders.”"}},{"id":11,"idInBook":11,"chapterId":8,"bookId":16,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، قَالَ‏:‏ حَدَّثَنَا عُبَيْدُ اللهِ بْنُ إِيَادٍ، عَنْ أَبِيهِ، عَنْ أَبِي رِمْثَةَ، قَالَ‏:‏ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم، وَعَلَيْهِ بُرْدَانِ أَخْضَرَانِ‏.‏","english":{"narrator":"Abu Rimtha said:","text":"“I saw the Prophet (Allah bless him and give him peace) wearing two green garments.\""}},{"id":12,"idInBook":12,"chapterId":8,"bookId":16,"arabic":"حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، قَالَ‏:‏ حَدَّثَنَا عَفَّانُ بْنُ مُسْلِمٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ اللهِ بْنُ حَسَّانَ الْعَنْبَرِيُّ، عَنْ جَدَّتَيْهِ دُحَيْبَةَ، وَعُلَيْبَةَ، عَنْ قَيْلَةَ بِنْتِ مَخْرَمَةَ، قَالَتْ‏:‏ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم وَعَلَيْهِ أَسْمَالُ مُلَيَّتَيْنِ، كَانَتَا بِزَعْفَرَانٍ، وَقَدْ نَفَضَتْهُ وَفِي الْحَدِيثِ قِصَّةٌ طَوِيلَةٌ‏.‏","english":{"narrator":"Qaila bint Makhrama said:","text":"“I saw the Prophet (Allah bless him and give him peace) wearing the tatters of two sheets which had been dyed with saffron, but had lost their color....” (This tradition is part of a longer story.)"}},{"id":13,"idInBook":13,"chapterId":8,"bookId":16,"arabic":"حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ‏:‏ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، عَنْ عَبْدِ اللهِ بْنِ عُثْمَانَ بْنِ خُثَيْمٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ عَلَيْكُمْ بِالْبَيَاضِ مِنَ الثِّيَابِ، لِيَلْبِسْهَا أَحْيَاؤُكُمْ، وَكَفِّنُوا فِيهَا مَوْتَاكُمْ، فَإِنَّهَا مِنْ خِيَارِ ثِيَابِكُمْ‏.‏","english":{"narrator":"Ibn 'Abbas said:","text":"Allah’s Messenger said (Allah bless him and give him peace): “You should acquire white clothes, so that your living ones may wear them, and you can shroud your deceased in them, for they are among the best of your clothes.”"}},{"id":14,"idInBook":14,"chapterId":8,"bookId":16,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، عَنْ مَيْمُونِ بْنِ أَبِي شَبِيبٍ، عَنْ سَمُرَةَ بْنِ جُنْدُبٍ، قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ الْبَسُوا الْبَيَاضَ، فَإِنَّهَا أَطْهَرُ وَأَطْيَبُ، وَكَفِّنُوا فِيهَا مَوْتَاكُمْ‏.‏","english":{"narrator":"Samura ibn Jundub said:","text":"“Allah’s Messenger said (Allah bless him and give him peace): 'Wear white, for it is most pure and pleasant, and you must shroud your deceased therein'.”"}},{"id":15,"idInBook":15,"chapterId":8,"bookId":16,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ، قَالَ‏:‏ حَدَّثَنَا أَبِي، عَنْ مُصْعَبِ بْنِ شَيْبَةَ، عَنْ صَفِيَّةَ بِنْتِ شَيْبَةَ، عَنْ عَائِشَةَ، قَالَتْ‏:‏ خَرَجَ رَسُولُ اللهِ صلى الله عليه وسلم ذَاتَ غَدَاةٍ، وَعَلَيْهِ مِرْطٌ مِنْ شَعَرٍ أَسْودَ‏.‏","english":{"narrator":"","text":"'Aisha said;\n“Allah's Messenger (Allah bless him and give him peace) went out one early morning, wearing a wrap of black hair.”"}},{"id":16,"idInBook":16,"chapterId":8,"bookId":16,"arabic":"حَدَّثَنَا يُوسُفُ بْنُ عِيسَى، قَالَ‏:‏ حَدَّثَنَا وَكِيعٌ، قَالَ‏:‏ حَدَّثَنَا يُونُسُ بْنُ أَبِي إِسْحَاقَ، عَنْ أَبِيهِ، عَنِ الشَّعْبِيِّ، عَنْ عُرْوَةَ بْنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، عَنْ أَبِيهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم، لَبِسَ جُبَّةً رُومِيَّةً، ضَيِّقَةَ الْكُمَّيْنِ‏.‏","english":{"narrator":"Urwa ibn al-Mughira ibn Shu'ba said that his father said:","text":"“The Prophet (Allah bless him and give him peace) wore a Byzantine robe with narrow sleeves.”"}}],"chapter":{"id":8,"bookId":16,"arabic":"باب ما جاء في لباس رسول الله صلى الله عليه وسلم","english":"The Dressing Of Rasoolullah"}}