{"metadata":{"length":2,"arabic":{"title":"الشمائل المحمدية","author":"الإمام الترمذي","introduction":"باب ماجاء في عيش رسول الله صلى الله عليه وسلم"},"english":{"title":"Shama'il Muhammadiyah","author":"Imam Tirmidhi","introduction":"The Standard of Living of Rasoolullah"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":null,"bookId":16,"arabic":"حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا حماد بن زيد ‏,‏ عن أيوب ‏,‏ عن محمد بن سيرين ‏,‏ قال‏:‏ كُنَّا عِنْدَ أَبِى هُرَيْرَةَ رضي الله عنه وَعَلَيْهِ ثَوْبَانِ مُمَشَّقَانِ مِنْ كَتَّان فَتَمَخَّطَ في أحدهما‏.‏ فَقَالَ أَبُو هُرَيْرَةَ‏:‏ بَخْ بَخْ يَتَمَخَّطُ أَبُو هُرَيْرَةَ فِى الْكَتَّانِ‏.‏ لَقَدْ رَأَيْتُنِي وَإِنِّى لأَخِرُّ فِيمَا بَيْنَ مِنْبَرِ رَسُولِ اللهِ صلى الله عليه وسلم وحُجْرَةِ عَائِشَةَ رضي الله عنها مَغْشِيًّا عَلَيَّّ، فَيَجِىءُ الْجَائِى فَيَضَعُ رِجْلَهُ عَلَى عُنُقِى، يُرَى أَنّ بِي جْنُونٌا، وَمَا بِي جُنُونٍ، ومَا هو إِلاَّ الْجُوعُ‏.‏","english":{"narrator":"Muhammad ibn Sirin said:","text":"We were in the presence of Abu Huraira, and he was wearing two linen garments dyed with red clay. He blew his nose in one of them, then said: “Bravo! Bravo! Abu Huraira is blowing his nose in the linen! I had found myself (in the past) as I would drop between the pulpit of Allah’s Messenger (Allah bless him and give him peace) and the room of 'A'isha (may Allah be well pleased with her) falling unconscious, so the one who would come (by) would come then plant his foot on my neck, supposing I was afflicted with insanity, though I was not afflicted with insanity, and it was merely hunger.”"}},{"id":2,"idInBook":2,"chapterId":null,"bookId":16,"arabic":"حَدَّثَنَا قُتَيْبَةُ ‏,‏ حَدَّثَنَا جعفر بن سليمان الضبعي ‏,‏ عن مالك بن دينار قال‏:‏ مَا شَبِعَ رَسُولِ اللهِ صلى الله عليه وسلم مِنْ خُبْزٍ قَط ‏,‏ وَلَحم إِلاَّ عَلى ضفَفَ‏.‏","english":{"narrator":"Malik ibn Dinar said:","text":"\"Allah’s Messenger (Allah bless him and give him peace) never ate his fill of bread, nor of meat, except at a meal in the company of many diners.”"}}],"chapter":{"id":null,"bookId":16,"arabic":"باب ماجاء في عيش رسول الله صلى الله عليه وسلم","english":"The Standard of Living of Rasoolullah"}}