{"metadata":{"length":83,"arabic":{"title":"سنن النسائي","author":"الإمام أبو عبد الرحمن أحمد بن شعيب النسائي","introduction":"كتاب المزارعة"},"english":{"title":"Sunan al-Nasa'i","author":"Imam Ahmad ibn Shu'ayb al-Nasa'i","introduction":"The Book of Agriculture"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمٍ، قَالَ أَنْبَأَنَا حِبَّانُ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ شُعْبَةَ، عَنْ حَمَّادٍ، عَنْ إِبْرَاهِيمَ، عَنْ أَبِي سَعِيدٍ، قَالَ إِذَا اسْتَأْجَرْتَ أَجِيرًا فَأَعْلِمْهُ أَجْرَهُ‏.‏‏","english":{"narrator":"It was narrated that Abu Sa'eed said:","text":"\"When you hire a worker, tell him what his wages will be.\""}},{"id":2,"idInBook":2,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا مُحَمَّدٌ، قَالَ أَنْبَأَنَا حِبَّانُ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ حَمَّادِ بْنِ سَلَمَةَ، عَنْ يُونُسَ، عَنِ الْحَسَنِ، أَنَّهُ كَرِهَ أَنْ يَسْتَأْجِرَ الرَّجُلَ، حَتَّى يُعْلِمَهُ أَجْرَهُ‏.‏‏","english":{"narrator":"","text":"It was narrated from Al-Hasan that he disliked to hire a man without telling him what his wages would be."}},{"id":3,"idInBook":3,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمٍ، قَالَ أَنْبَأَنَا حِبَّانُ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ جَرِيرِ بْنِ حَازِمٍ، عَنْ حَمَّادٍ، - هُوَ ابْنُ أَبِي سُلَيْمَانَ - أَنَّهُ سُئِلَ عَنْ رَجُلٍ، اسْتَأْجَرَ أَجِيرًا عَلَى طَعَامِهِ قَالَ لاَ حَتَّى تُعْلِمَهُ‏.‏‏","english":{"narrator":"It was narrated from Hammad -Ibn Abi Sulaiman- that he was asked about a man who hired a worker in return for food and he said:","text":"\"No, not until he tells him (what his wages will be).\""}},{"id":4,"idInBook":4,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا مُحَمَّدٌ، قَالَ حَدَّثَنَا حِبَّانُ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ مَعْمَرٍ، عَنْ حَمَّادٍ، وَقَتَادَةَ، فِي رَجُلٍ قَالَ لِرَجُلٍ أَسْتَكْرِي مِنْكَ إِلَى مَكَّةَ بِكَذَا وَكَذَا فَإِنْ سِرْتُ شَهْرًا أَوْ كَذَا وَكَذَا شَيْئًا سَمَّاهُ فَلَكَ زِيَادَةُ كَذَا وَكَذَا فَلَمْ يَرَيَا بِهِ بَأْسًا وَكَرِهَا أَنْ يَقُولَ أَسْتَكْرِي مِنْكَ بِكَذَا وَكَذَا فَإِنْ سِرْتُ أَكْثَرَ مِنْ شَهْرٍ نَقَصْتُ مِنْ كِرَائِكَ كَذَا وَكَذَا‏.‏‏","english":{"narrator":"It was narrated from Hammad and Qatadah, concerning a man who said to another man:","text":"\"I will lease (something) from you until I reach Makkah for such and such a payment, and if I travel for a month or such and such -something that he named- I will give you such and such in addition.\" They did not see anything wrong with that, but they did not like it if he said: \"If I travel for more than a month I will deduct such and such from your lease.\""}},{"id":5,"idInBook":5,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمٍ، قَالَ أَنْبَأَنَا حِبَّانُ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنِ ابْنِ جُرَيْجٍ، قِرَاءَةً قَالَ قُلْتُ لِعَطَاءٍ عَبْدٌ أُؤَاجِرُهُ سَنَةً بِطَعَامِهِ وَسَنَةً أُخْرَى بِكَذَا وَكَذَا‏.‏‏ قَالَ لاَ بَأْسَ بِهِ وَيُجْزِئُهُ اشْتِرَاطُكَ حِينَ تُؤَاجِرُهُ أَيَّامًا أَوْ آجَرْتَهُ وَقَدْ مَضَى بَعْضُ السَّنَةِ قَالَ إِنَّكَ لاَ تُحَاسِبُنِي لِمَا مَضَى‏.‏‏","english":{"narrator":"It was narrated that Ibn Juraij said:","text":"\"I said to 'Ata': 'What if I hire a slave for a year in return for his food, and for another year, in return for such and such?' He said: 'There is nothing wrong with that, and you may stipulate your conditions of hiring even for a few days.' 'How about if I make a deal to hire him when part of the year has passed?' He said: 'Do not hold me to account for what has passed.'\""}},{"id":6,"idInBook":6,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا مُحَمَّدُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا خَالِدٌ، - هُوَ ابْنُ الْحَارِثِ - قَالَ قَرَأْتُ عَلَى عَبْدِ الْحَمِيدِ بْنِ جَعْفَرٍ أَخْبَرَنِي أَبِي، عَنْ رَافِعِ بْنِ أُسَيْدِ بْنِ ظُهَيْرٍ، عَنْ أَبِيهِ، أُسَيْدِ بْنِ ظُهَيْرٍ أَنَّهُ خَرَجَ إِلَى قَوْمِهِ إِلَى بَنِي حَارِثَةَ فَقَالَ يَا بَنِي حَارِثَةَ لَقَدْ دَخَلَتْ عَلَيْكُمْ مُصِيبَةٌ‏.‏‏ قَالُوا مَا هِيَ قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ كِرَاءِ الأَرْضِ‏.‏‏ قُلْنَا يَا رَسُولَ اللَّهِ إِذًا نُكْرِيهَا بِشَىْءٍ مِنَ الْحَبِّ‏.‏‏ قَالَ ‏‏\"‏‏ لاَ ‏‏\"‏‏‏.‏‏ قَالَ وَكُنَّا نُكْرِيهَا بِالتِّبْنِ فَقَالَ ‏‏\"‏‏ لاَ ‏‏\"‏‏‏.‏‏ وَكُنَّا نُكْرِيهَا بِمَا عَلَى الرَّبِيعِ السَّاقِي قَالَ ‏‏\"‏‏ لاَ ازْرَعْهَا أَوِ امْنَحْهَا أَخَاكَ ‏‏\"‏‏‏.‏‏ خَالَفَهُ مُجَاهِدٌ‏.‏‏","english":{"narrator":"It was narrated from Usaid bin Zuhair that he went out to his people, Banu Harithah, and said:","text":"\"O Banu Harithah, a calamity has befallen you.\" They said: \"What is it?\" He said: \"The Messenger of Allah has forbidden leasing land.\" We said: \"O Messenger of Allah, what if we lease it in return for some of the grain?\" He said, \"No.\" He said: \"We used to lease it in return for straw.\" He said: \"No.\" \"We used to lease it in return for what is planted on the banks of a stream that is used for irrigation.\" He said: \"No. Cultivate it (yourself) or give it to your brother.\""}},{"id":7,"idInBook":7,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ، قَالَ حَدَّثَنَا يَحْيَى، - وَهُوَ ابْنُ آدَمَ - قَالَ حَدَّثَنَا مُفَضَّلٌ، - وَهُوَ ابْنُ مُهَلْهَلٍ - عَنْ مَنْصُورٍ، عَنْ مُجَاهِدٍ، عَنْ أُسَيْدِ بْنِ ظُهَيْرٍ، قَالَ جَاءَنَا رَافِعُ بْنُ خَدِيجٍ فَقَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَاكُمْ عَنِ الْحَقْلِ - وَالْحَقْلُ الثُّلُثُ وَالرُّبُعُ - وَعَنِ الْمُزَابَنَةِ‏.‏‏ وَالْمُزَابَنَةُ شِرَاءُ مَا فِي رُءُوسِ النَّخْلِ بِكَذَا وَكَذَا وَسْقًا مِنْ تَمْرٍ‏.‏‏","english":{"narrator":"It was narrated that Usaid bin Zuhair said:","text":"\"Rafi' bin Khadij came to us and said: 'The Messenger of Allah has forbidden for you Al-Haql. Al-Haql is the third and the fourth. And Al-Muzabanah. Al-Muzabanah is to buy what is at the top of the date-palm trees in return for a certain number of Wasqs of dried dates.'\""}},{"id":8,"idInBook":8,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا مُحَمَّدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ مَنْصُورٍ، سَمِعْتُ مُجَاهِدًا، يُحَدِّثُ عَنْ أُسَيْدِ بْنِ ظُهَيْرٍ، قَالَ أَتَانَا رَافِعُ بْنُ خَدِيجٍ فَقَالَ نَهَانَا رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ أَمْرٍ كَانَ لَنَا نَافِعًا وَطَاعَةُ رَسُولِ اللَّهِ صلى الله عليه وسلم خَيْرٌ لَكُمْ نَهَاكُمْ عَنِ الْحَقْلِ وَقَالَ ‏‏\n\"‏‏ مَنْ كَانَتْ لَهُ أَرْضٌ فَلْيَمْنَحْهَا أَوْ لِيَدَعْهَا ‏‏\"‏‏‏.‏‏ وَنَهَى عَنِ الْمُزَابَنَةِ‏.‏‏ وَالْمُزَابَنَةُ الرَّجُلُ يَكُونُ لَهُ الْمَالُ الْعَظِيمُ مِنَ النَّخْلِ فَيَجِيءُ الرَّجُلُ فَيَأْخُذُهَا بِكَذَا وَكَذَا وَسْقًا مِنْ تَمْرٍ‏.‏‏","english":{"narrator":"It was narrated that Usaid bin Zuhair said:","text":"\"Rafi' bin Khadij came to us and said: 'The Messenger of Allah has forbidden something that was beneficial for us, but obedience to the Messenger of Allah is better for you.  He has forbidden Al-Haql (renting land in return for one-third or one-quarter of the produce) to you, and says: Whoever has land, let him give it (to someone else to cultivate it) or leave it. And he has forbidden Al-Muzabanah. Al-Muzabanah means when a man has a lot of date-palm trees and another man comes and takes it in return for a certain number of Wasqs of dried dates.'\""}},{"id":9,"idInBook":9,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنِي مُحَمَّدُ بْنُ قُدَامَةَ، قَالَ حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ مُجَاهِدٍ، عَنْ أُسَيْدِ بْنِ ظُهَيْرٍ، قَالَ أَتَى عَلَيْنَا رَافِعُ بْنُ خَدِيجٍ فَقَالَ - وَلَمْ أَفْهَمْ - فَقَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَاكُمْ عَنْ أَمْرٍ كَانَ يَنْفَعُكُمْ وَطَاعَةُ رَسُولِ اللَّهِ صلى الله عليه وسلم خَيْرٌ لَكُمْ مِمَّا يَنْفَعُكُمْ نَهَاكُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْحَقْلِ - وَالْحَقْلُ الْمُزَارَعَةُ بِالثُّلُثِ وَالرُّبُعِ - فَمَنْ كَانَ لَهُ أَرْضٌ فَاسْتَغْنَى عَنْهَا فَلْيَمْنَحْهَا أَخَاهُ أَوْ لِيَدَعْ وَنَهَاكُمْ عَنِ الْمُزَابَنَةِ‏.‏‏ وَالْمُزَابَنَةُ الرَّجُلُ يَجِيءُ إِلَى النَّخْلِ الْكَثِيرِ بِالْمَالِ الْعَظِيمِ فَيَقُولُ خُذْهُ بِكَذَا وَكَذَا وَسْقًا مِنْ تَمْرِ ذَلِكَ الْعَامِ‏.‏‏","english":{"narrator":"It was narrated that Usaid bin Zuhair said:","text":"\"Rafi' bin Khadij came to us and I was not sure what he meant. He said: 'The Messenger of Allah has forbidden to you something that used to benefit you, but obedience to the Messenger of Allah is better for you than that which benefits you. The Messenger of Allah has forbidden Al-Haql for you. Al-Haql means share-cropping the land in return for one-third or one-quarter (of the yield). So whoever has land that he does not need, let him give it to his brother (to cultivate it) or let him leave it. And he has forbidden to you Al-Muzabanah. Al-Muzabanah means when a man has a great number of datepalms and says: Take it in return for (a certain number of) Wasqs of dried dates this year.'\""}},{"id":10,"idInBook":10,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنِي إِبْرَاهِيمُ بْنُ يَعْقُوبَ بْنِ إِسْحَاقَ، قَالَ حَدَّثَنَا عَفَّانُ، قَالَ حَدَّثَنَا عَبْدُ الْوَاحِدِ، قَالَ حَدَّثَنَا سَعِيدُ بْنُ عَبْدُ الرَّحْمَنِ، عَنْ مُجَاهِدٍ، قَالَ حَدَّثَنِي أُسَيْدُ بْنُ رَافِعِ بْنِ خَدِيجٍ، قَالَ قَالَ رَافِعُ بْنُ خَدِيجٍ نَهَاكُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ أَمْرٍ كَانَ لَنَا نَافِعًا وَطَاعَةُ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنْفَعُ لَنَا قَالَ ‏‏\n\"‏‏ مَنْ كَانَتْ لَهُ أَرْضٌ فَلْيَزْرَعْهَا فَإِنْ عَجَزَ عَنْهَا فَلْيُزْرِعْهَا أَخَاهُ ‏‏\"‏‏‏.‏‏ خَالَفَهُ عَبْدُ الْكَرِيمِ بْنُ مَالِكٍ‏.‏‏","english":{"narrator":"Usaid bin Rafi' bin Khadij said:","text":"\"Rafi' bin Khadij said: 'The Messenger of Allah has forbidden something for you that used to be beneficial for us, but obedience to the Messenger of Allah is more beneficial for us. He said: \"Whoever has land let him cultivate it, and if he is unable to do so, let him give it to his brother to cultivate.\"'\""}},{"id":11,"idInBook":11,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ أَنْبَأَنَا عُبَيْدُ اللَّهِ، - يَعْنِي ابْنَ عَمْرٍو - عَنْ عَبْدِ الْكَرِيمِ، عَنْ مُجَاهِدٍ، قَالَ أَخَذْتُ بِيَدِ طَاوُسٍ حَتَّى أَدْخَلْتُهُ عَلَى ابْنِ رَافِعِ بْنِ خَدِيجٍ فَحَدَّثَهُ عَنْ أَبِيهِ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ نَهَى عَنْ كِرَاءِ الأَرْضِ‏.‏‏ فَأَبَى طَاوُسٌ فَقَالَ سَمِعْتُ ابْنَ عَبَّاسٍ لاَ يَرَى بِذَلِكَ بَأْسًا‏.‏‏ وَرَوَاهُ أَبُو عَوَانَةَ عَنْ أَبِي حَصِينٍ عَنْ مُجَاهِدٍ قَالَ قَالَ عَنْ رَافِعٍ مُرْسَلاً‏.‏‏","english":{"narrator":"It was narrated that Mujahid said:","text":"\"I took Tawus by the hand and brought him to Ibn Rafi' bin Khadij, and he told him, narrating from his father, that the Messenger of Allah forbade leasing land. Tawus rejected that and said: 'I heard Ibn 'Abbas (say) that he did not see anything wrong with that.'\""}},{"id":12,"idInBook":12,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي حَصِينٍ، عَنْ مُجَاهِدٍ، قَالَ قَالَ رَافِعُ بْنُ خَدِيجٍ نَهَانَا رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ أَمْرٍ كَانَ لَنَا نَافِعًا وَأَمْرُ رَسُولِ اللَّهِ صلى الله عليه وسلم عَلَى الرَّأْسِ وَالْعَيْنِ نَهَانَا أَنْ نَتَقَبَّلَ الأَرْضَ بِبَعْضِ خَرْجِهَا‏.‏‏ تَابَعَهُ إِبْرَاهِيمُ بْنُ مُهَاجِرٍ‏.‏‏","english":{"narrator":"(The previously mentioned chain) from Mujahid who said:","text":"\"Rafi' bin Khadij said: 'The Messenger of Allah forbade us to do something that was beneficial for us, (but we respect and obey the command of the Messenger of Allah). He forbade us to lease land in return for some of its produce.\""}},{"id":13,"idInBook":13,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، عَنْ عُبَيْدِ اللَّهِ، قَالَ حَدَّثَنَا إِسْرَائِيلُ، عَنْ إِبْرَاهِيمَ بْنِ مُهَاجِرٍ، عَنْ مُجَاهِدٍ، عَنْ رَافِعِ بْنِ خَدِيجٍ، قَالَ مَرَّ النَّبِيُّ صلى الله عليه وسلم عَلَى أَرْضِ رَجُلٍ مِنَ الأَنْصَارِ قَدْ عَرَفَ أَنَّهُ مُحْتَاجٌ فَقَالَ ‏‏\"‏‏ لِمَنْ هَذِهِ الأَرْضُ ‏‏\"‏‏‏.‏‏ قَالَ لِفُلاَنٍ أَعْطَانِيهَا بِالأَجْرِ‏.‏‏ فَقَالَ ‏‏\"‏‏ لَوْ مَنَحَهَا أَخَاهُ ‏‏\"‏‏‏.‏‏ فَأَتَى رَافِعٌ الأَنْصَارَ فَقَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَاكُمْ عَنْ أَمْرٍ كَانَ لَكُمْ نَافِعًا وَطَاعَةُ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنْفَعُ لَكُمْ‏.‏‏","english":{"narrator":"It was narrated that Rafi' bin Khadij said:","text":"\"The Prophet passed by the land of a man from among the Ansar who he knew was in need and said: 'Whose is this land?' He said: 'So and so's; he has given it to us in return for rent.' He said: 'Why did he not give it to his brother?'\" Rafi' came to the Ansar and said: \"The Messenger of Allah has forbidden something for you which was beneficial, but obedience to the command of the Messenger of Allah is more beneficial for you.\""}},{"id":14,"idInBook":14,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، قَالاَ حَدَّثَنَا مُحَمَّدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنْ مُجَاهِدٍ، عَنْ رَافِعِ بْنِ خَدِيجٍ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْحَقْلِ‏.‏‏","english":{"narrator":"It was narrated that Rafi' bin Khadij said:","text":"\"The Messenger of Allah forbade Al-Haql (renting land in return for one-third or one-quarter of the produce).\""}},{"id":15,"idInBook":15,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، عَنْ خَالِدٍ، - وَهُوَ ابْنُ الْحَارِثِ - قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الْمَلِكِ، عَنْ مُجَاهِدٍ، قَالَ حَدَّثَ رَافِعُ بْنُ خَدِيجٍ، قَالَ خَرَجَ إِلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَنَهَانَا عَنْ أَمْرٍ كَانَ لَنَا نَافِعًا فَقَالَ ‏‏\n\"‏‏ مَنْ كَانَ لَهُ أَرْضٌ فَلْيَزْرَعْهَا أَوْ يَمْنَحْهَا أَوْ يَذَرْهَا ‏‏\"‏‏‏.‏‏","english":{"narrator":"Rafi' bin Khadij said:","text":"\"The Messenger of Allah came out to us and forbade something for us that had been beneficial for us. He said: 'Whoever has land, let him cultivate it or give it to someone else (to cultivate), or leave it.'\""}},{"id":16,"idInBook":16,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ خَالِدٍ، قَالَ حَدَّثَنَا حَجَّاجٌ، قَالَ حَدَّثَنِي شُعْبَةُ، عَنْ عَبْدِ الْمَلِكِ، عَنْ عَطَاءٍ، وَطَاوُسٍ، وَمُجَاهِدٍ، عَنْ رَافِعِ بْنِ خَدِيجٍ، قَالَ خَرَجَ إِلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَنَهَانَا عَنْ أَمْرٍ كَانَ لَنَا نَافِعًا وَأَمْرُ رَسُولِ اللَّهِ صلى الله عليه وسلم خَيْرٌ لَنَا قَالَ ‏‏\n\"‏‏ مَنْ كَانَ لَهُ أَرْضٌ فَلْيَزْرَعْهَا أَوْ لِيَذَرْهَا أَوْ لِيَمْنَحْهَا ‏‏\"‏‏‏.‏‏ وَمِمَّا يَدُلُّ عَلَى أَنَّ طَاوُسًا لَمْ يَسْمَعْ هَذَا الْحَدِيثَ","english":{"narrator":"It was narrated from Tawus and Mujahid, that Rafi' bin Khadij said:","text":"\"The Messenger of Allah came out to us and forbade something for us that had been beneficial for us, but the command of Messenger of Allah is better for us. He said: 'Whoever has land, let him cultivate it or leave it or give it (to someone else to cultivate).'\""}},{"id":17,"idInBook":17,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ، قَالَ حَدَّثَنَا زَكَرِيَّا بْنُ عَدِيٍّ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَمْرِو بْنِ دِينَارٍ، قَالَ كَانَ طَاوُسٌ يَكْرَهُ أَنْ يُؤَاجِرَ أَرْضَهُ بِالذَّهَبِ وَالْفِضَّةِ وَلاَ يَرَى بِالثُّلُثِ وَالرُّبُعِ بَأْسًا فَقَالَ لَهُ مُجَاهِدٌ اذْهَبْ إِلَى ابْنِ رَافِعِ بْنِ خَدِيجٍ فَاسْمَعْ مِنْهُ حَدِيثَهُ‏.‏‏ فَقَالَ إِنِّي وَاللَّهِ لَوْ أَعْلَمُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْهُ مَا فَعَلْتُهُ وَلَكِنْ حَدَّثَنِي مَنْ هُوَ أَعْلَمُ مِنْهُ‏.‏‏ ابْنُ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم إِنَّمَا قَالَ ‏‏\n\"‏‏ لأَنْ يَمْنَحَ أَحَدُكُمْ أَخَاهُ أَرْضَهُ خَيْرٌ مِنْ أَنْ يَأْخُذَ عَلَيْهَا خَرَاجًا مَعْلُومًا ‏‏\"‏‏‏.‏‏ وَقَدِ اخْتُلِفَ عَلَى عَطَاءٍ فِي هَذَا الْحَدِيثِ فَقَالَ عَبْدُ الْمَلِكِ بْنُ مَيْسَرَةَ عَنْ عَطَاءٍ عَنْ رَافِعٍ وَقَدْ تَقَدَّمَ ذِكْرُنَا لَهُ‏.‏‏ وَقَالَ عَبْدُ الْمَلِكِ بْنُ أَبِي سُلَيْمَانَ عَنْ عَطَاءٍ عَنْ جَابِرٍ‏.‏‏","english":{"narrator":"It was narrated that 'Amr bin Dinar said:","text":"\"Tawus regarded it disliked renting out land for gold and silver, but he did not see anything wrong with leasing it in return for one-third or one-quarter (of the yield). Mujahid said to him: 'Go to Ibn Rafi' bin Khadij and listen to his Hadith.' He said: 'By Allah, if I knew that the Messenger of Allah had forbidden that I would not have done it. But my Hadith comes from one who is more knowledgeable than him. Ibn 'Abbas (said) that the Messenger of Allah said: \"If one of you were to give his land to his brother (to cultivate it), that would be better than taking an agreed portion of the yield.\"'\""}},{"id":18,"idInBook":18,"chapterId":null,"bookId":3,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، قَالَ حَدَّثَنَا عَبْدُ الْمَلِكِ، عَنْ عَطَاءٍ، عَنْ جَابِرٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏‏\n\"‏‏ مَنْ كَانَ لَهُ أَرْضٌ فَلْيَزْرَعْهَا فَإِنْ عَجَزَ أَنْ يَزْرَعَهَا فَلْيَمْنَحْهَا أَخَاهُ الْمُسْلِمَ وَلاَ يُزْرِعْهَا إِيَّاهُ ‏‏\"‏‏‏.‏‏","english":{"narrator":"It was narrated from 'Ata' from Jabir, that the Messenger of Allah said:","text":"\"Whoever has land, let him cultivate it. If he is unable to cultivate it, let him give it to his Muslim brother and not share-crop it with him.\""}},{"id":19,"idInBook":19,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا عَبْدُ الْمَلِكِ، عَنْ عَطَاءٍ، عَنْ جَابِرٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏‏\n\"‏‏ مَنْ كَانَتْ لَهُ أَرْضٌ فَلْيَزْرَعْهَا أَوْ لِيَمْنَحْهَا أَخَاهُ وَلاَ يُكْرِيهَا ‏‏\"‏‏‏.‏‏ تَابَعَهُ عَبْدُ الرَّحْمَنِ بْنُ عَمْرٍو الأَوْزَاعِيُّ‏.‏‏","english":{"narrator":"Jabir said:","text":"The Messenger of Allah said: \"Whoever has land, let him cultivate it or give it to his brother, and not lease it to him.\""}},{"id":20,"idInBook":20,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا هِشَامُ بْنُ عَمَّارٍ، عَنْ يَحْيَى بْنِ حَمْزَةَ، قَالَ حَدَّثَنَا الأَوْزَاعِيُّ، عَنْ عَطَاءٍ، عَنْ جَابِرٍ، قَالَ كَانَ لأُنَاسٍ فُضُولُ أَرَضِينَ يُكْرُونَهَا بِالنِّصْفِ وَالثُّلُثِ وَالرُّبُعِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏‏\n\"‏‏ مَنْ كَانَتْ لَهُ أَرْضٌ فَلْيَزْرَعْهَا أَوْ يُزْرِعْهَا أَوْ يُمْسِكْهَا ‏‏\"‏‏‏.‏‏ وَافَقَهُ مَطَرُ بْنُ طَهْمَانَ‏.‏‏","english":{"narrator":"It was narrated that Jabir said:","text":"\"Some people had some extra land which they leased out in return for half of the yield, or one-third, or one-quarter. The Messenger of Allah said: 'Whoever has land, let him cultivate it, or give it to his brother to cultivate or keep it (without cultivating it).'\""}},{"id":21,"idInBook":21,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا عِيسَى بْنُ مُحَمَّدٍ، - وَهُوَ أَبُو عُمَيْرِ بْنُ النَّحَّاسِ - وَعِيسَى بْنُ يُونُسَ - هُوَ الْفَاخُورِيُّ - قَالاَ حَدَّثَنَا ضَمْرَةُ، عَنِ ابْنِ شَوْذَبٍ، عَنْ مَطَرٍ، عَنْ عَطَاءٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ خَطَبَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏‏\n\"‏‏ مَنْ كَانَتْ لَهُ أَرْضٌ فَلْيَزْرَعْهَا أَوْ لِيُزْرِعْهَا وَلاَ يُؤَاجِرْهَا ‏‏\"‏‏‏.‏‏","english":{"narrator":"It was narrated that Jabir bin 'Abdullah said:","text":"\"The Messenger of Allah addressed us and said: 'Whoever has land, let him cultivate it or give it to someone else to cultivate, and let him not rent it out.'\""}},{"id":22,"idInBook":22,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنِي مُحَمَّدُ بْنُ إِسْمَاعِيلَ بْنِ إِبْرَاهِيمَ، عَنْ يُونُسَ، قَالَ حَدَّثَنَا حَمَّادٌ، عَنْ مَطَرٍ، عَنْ عَطَاءٍ، عَنْ جَابِرٍ، رَفَعَهُ نَهَى عَنْ كِرَاءِ الأَرْضِ،‏.‏‏ وَافَقَهُ عَبْدُ الْمَلِكِ بْنُ عَبْدِ الْعَزِيزِ بْنِ جُرَيْجٍ عَلَى النَّهْىِ عَنْ كِرَاءِ الأَرْضِ،‏.‏‏","english":{"narrator":"It was narrated from Jabir who attributed it to the Prophet:","text":"\"That he forbade leasing out land.\""}},{"id":23,"idInBook":23,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا الْمُفَضَّلُ، عَنِ ابْنِ جُرَيْجٍ، عَنْ عَطَاءٍ، وَأَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنِ الْمُخَابَرَةِ وَالْمُزَابَنَةِ وَالْمُحَاقَلَةِ وَبَيْعِ الثَّمَرِ حَتَّى يُطْعَمَ إِلاَّ الْعَرَايَا‏.‏‏ تَابَعَهُ يُونُسُ بْنُ عُبَيْدٍ‏.‏‏","english":{"narrator":"","text":"It was narrated from Jabir that the Prophet forbade Al-Mukhabarah, Al-Muzabanah and Al-Muhaqalah, and selling fruit until it is fit to eat (ripe enough), except in the case of Al-'Araya."}},{"id":24,"idInBook":24,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنِي زِيَادُ بْنُ أَيُّوبَ، قَالَ حَدَّثَنَا عَبَّادُ بْنُ الْعَوَّامِ، قَالَ حَدَّثَنَا سُفْيَانُ بْنُ حُسَيْنٍ، قَالَ حَدَّثَنَا يُونُسُ بْنُ عُبَيْدٍ، عَنْ عَطَاءٍ، عَنْ جَابِرٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنِ الْمُحَاقَلَةِ وَالْمُزَابَنَةِ وَالْمُخَابَرَةِ وَعَنِ الثُّنْيَا إِلاَّ أَنْ تُعْلَمَ‏.‏‏ وَفِي رِوَايَةِ هَمَّامِ بْنِ يَحْيَى كَالدَّلِيلِ عَلَى أَنَّ عَطَاءً لَمْ يَسْمَعْ مِنْ جَابِرٍ حَدِيثَهُ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏‏\n\"‏‏ مَنْ كَانَ لَهُ أَرْضٌ فَلْيَزْرَعْهَا ‏‏\"‏‏‏.‏‏","english":{"narrator":"","text":"It was narrated from Jabir that the Prophet forbade Al-Muhaqalah, Al-Muzabanah, Al-Mukhabarah and exceptions when selling, unless they were well-defined."}},{"id":25,"idInBook":25,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنِي أَحْمَدُ بْنُ يَحْيَى، قَالَ حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا هَمَّامُ بْنُ يَحْيَى، قَالَ سَأَلَ عَطَاءً سُلَيْمَانُ بْنُ مُوسَى قَالَ حَدَّثَ جَابِرٌ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏‏\n\"‏‏ مَنْ كَانَتْ لَهُ أَرْضٌ فَلْيَزْرَعْهَا أَوْ لِيُزْرِعْهَا أَخَاهُ وَلاَ يُكْرِيهَا أَخَاهُ ‏‏\"‏‏‏.‏‏ وَقَدْ رَوَى النَّهْىَ عَنِ الْمُحَاقَلَةِ يَزِيدُ بْنُ نُعَيْمٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ‏.‏‏","english":{"narrator":"Jabir narrated that the Messenger of Allah said:","text":"\"Whoever has land, let him cultivate it or give it to his brother to cultivate, and not lease it to his brother.\""}},{"id":26,"idInBook":26,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا مُحَمَّدُ بْنُ إِدْرِيسَ، قَالَ حَدَّثَنَا أَبُو تَوْبَةَ، قَالَ حَدَّثَنَا مُعَاوِيَةُ بْنُ سَلاَّمٍ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنِ يَزِيدَ بْنِ نُعَيْمٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنِ الْحَقْلِ‏.‏‏ وَهِيَ الْمُزَابَنَةُ‏.‏‏ خَالَفَهُ هِشَامٌ وَرَوَاهُ عَنْ يَحْيَى عَنْ أَبِي سَلَمَةَ عَنْ جَابِرٍ‏.‏‏","english":{"narrator":"It was narrated from Jabir bin 'Abdullah:","text":"\"The Prophet forbade Al-Haql and it is Al-Muzabanah.\""}},{"id":27,"idInBook":27,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا الثِّقَةُ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ مَسْعَدَةَ، عَنْ هِشَامِ بْنِ أَبِي عَبْدِ اللَّهِ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنِ الْمُزَابَنَةِ وَالْمُخَاضَرَةِ وَقَالَ ‏‏\n\"‏‏ الْمُخَاضَرَةُ بَيْعُ الثَّمَرِ قَبْلَ أَنْ يَزْهُوَ وَالْمُخَابَرَةُ بَيْعُ الْكَرْمِ بِكَذَا وَكَذَا صَاعٍ ‏‏\"‏‏‏.‏‏ خَالَفَهُ عَمْرُو بْنُ أَبِي سَلَمَةَ فَقَالَ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ‏.‏‏","english":{"narrator":"It was narrated from Jabir bin 'Abdullah that the Prophet forbade Al-Muzabanah and Al-Mukhadarah. He (one of the narrators) said:","text":"\"Al-Mukhadarah means selling fruit before it ripens and Al-Mukhabarah means selling grapes in return for a certain number of Sa's.\""}},{"id":28,"idInBook":28,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ عُمَرَ بْنِ أَبِي سَلَمَةَ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْمُحَاقَلَةِ وَالْمُزَابَنَةِ‏.‏‏ خَالَفَهُمَا مُحَمَّدُ بْنُ عَمْرٍو فَقَالَ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي سَعِيدٍ‏.‏‏","english":{"narrator":"It was narrated that Abu Hurairah said:","text":"\"The Messenger of Allah forbade Al-Muhaqalah and Al-Muzabanah.\""}},{"id":29,"idInBook":29,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ، قَالَ حَدَّثَنَا يَحْيَى، - وَهُوَ ابْنُ آدَمَ - قَالَ حَدَّثَنَا عَبْدُ الرَّحِيمِ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْمُحَاقَلَةِ وَالْمُزَابَنَةِ‏.‏‏ خَالَفَهُمُ الأَسْوَدُ بْنُ الْعَلاَءِ فَقَالَ عَنْ أَبِي سَلَمَةَ عَنْ رَافِعِ بْنِ خَدِيجٍ‏.‏‏","english":{"narrator":"It was narrated that Abu Sa'eed Al-Khudri said:","text":"\"The Messenger of Allah forbade Al-Muhaqalah and Al-Muzabanah.\""}},{"id":30,"idInBook":30,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا زَكَرِيَّا بْنُ يَحْيَى، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ يَزِيدَ بْنِ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ حُمْرَانَ، قَالَ حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ، عَنِ الأَسْوَدِ بْنِ الْعَلاَءِ، عَنْ أَبِي سَلَمَةَ، عَنْ رَافِعِ بْنِ خَدِيجٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الْمُحَاقَلَةِ وَالْمُزَابَنَةِ‏.‏‏ رَوَاهُ الْقَاسِمُ بْنُ مُحَمَّدٍ عَنْ رَافِعِ بْنِ خَدِيجٍ‏.‏‏","english":{"narrator":"","text":"It was narrated from Rafi' bin Khadij that the Messenger of Allah forbade Al-Muhaqalah and Al-Muzabanah."}},{"id":31,"idInBook":31,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا أَبُو عَاصِمٍ، قَالَ حَدَّثَنَا عُثْمَانُ بْنُ مُرَّةَ، قَالَ سَأَلْتُ الْقَاسِمَ عَنِ الْمُزَارَعَةِ، فَحَدَّثَ عَنْ رَافِعِ بْنِ خَدِيجٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الْمُحَاقَلَةِ وَالْمُزَابَنَةِ‏.‏‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ مَرَّةً أُخْرَى‏.‏‏","english":{"narrator":"It was narrated from 'Uthman bin Murrah who said:","text":"\"I asked Al-Qasim about Al-Muzara'ah, so he narrated from Rafi' bin Khadij that the Messenger of Allah forbade Al-Muhaqalah and Al-Muzabanah.\""}},{"id":32,"idInBook":32,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ قَالَ أَبُو عَاصِمٍ عَنْ عُثْمَانَ بْنِ مُرَّةَ، قَالَ سَأَلْتُ الْقَاسِمَ عَنْ كِرَاءِ الأَرْضِ، فَقَالَ قَالَ رَافِعُ بْنُ خَدِيجٍ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ كِرَاءِ الأَرْضِ‏.‏‏ وَاخْتُلِفَ عَلَى سَعِيدِ بْنِ الْمُسَيَّبِ فِيهِ","english":{"narrator":"","text":"Rafi' bin Khadij said that the Messenger of Allah forbade leasing land."}},{"id":33,"idInBook":33,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا يَحْيَى، عَنْ أَبِي جَعْفَرٍ الْخَطْمِيِّ، - وَاسْمُهُ عُمَيْرُ بْنُ يَزِيدَ - قَالَ أَرْسَلَنِي عَمِّي وَغُلاَمًا لَهُ إِلَى سَعِيدِ بْنِ الْمُسَيَّبِ أَسْأَلُهُ عَنِ الْمُزَارَعَةِ فَقَالَ كَانَ ابْنُ عُمَرَ لاَ يَرَى بِهَا بَأْسًا حَتَّى بَلَغَهُ عَنْ رَافِعِ بْنِ خَدِيجٍ حَدِيثٌ فَلَقِيَهُ فَقَالَ رَافِعٌ أَتَى النَّبِيُّ صلى الله عليه وسلم بَنِي حَارِثَةَ فَرَأَى زَرْعًا فَقَالَ ‏‏\"‏‏ مَا أَحْسَنَ زَرْعَ ظُهَيْرٍ ‏‏\"‏‏‏.‏‏ فَقَالُوا لَيْسَ لِظُهَيْرٍ‏.‏‏ فَقَالَ ‏‏\"‏‏ أَلَيْسَ أَرْضُ ظُهَيْرٍ ‏‏\"‏‏‏.‏‏ قَالُوا بَلَى وَلَكِنَّهُ أَزْرَعَهَا‏.‏‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏‏\"‏‏ خُذُوا زَرْعَكُمْ وَرُدُّوا إِلَيْهِ نَفَقَتَهُ ‏‏\"‏‏‏.‏‏ قَالَ فَأَخَذْنَا زَرْعَنَا وَرَدَدْنَا إِلَيْهِ نَفَقَتَهُ‏.‏‏ وَرَوَاهُ طَارِقُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ سَعِيدٍ وَاخْتُلِفَ عَلَيْهِ فِيهِ‏.‏‏","english":{"narrator":"It was narrated that Abu Ja'far Al-Khatmi - whose name was 'Umair bin Yazid - said:","text":"\"My paternal uncle sent me with a slave of his, to Sa'eed bin Al-Musayyab to ask him about Al-Muzara'ah. He said: 'Ibn 'Umar did not see anything wrong with it, until he heard the Hadith from Rafi' bin Khadij. Then he met him, and Rafi' said: \"The Prophet came to Banu Harithah and saw some crops. He said: 'How good are the crops of Zubair.' They said: 'It is not Zubair's.' He said: 'Is the land not Zubair's?' They said: 'No (it is not his), rather he is leasing it.' The Messenger of Allah said: 'Take your crops and give him what he spent.' So we took our crops, and gave him what he had spent.\""}},{"id":34,"idInBook":34,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ طَارِقٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ رَافِعِ بْنِ خَدِيجٍ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْمُحَاقَلَةِ وَالْمُزَابَنَةِ وَقَالَ ‏‏\n\"‏‏ إِنَّمَا يَزْرَعُ ثَلاَثَةٌ رَجُلٌ لَهُ أَرْضٌ فَهُوَ يَزْرَعُهَا أَوْ رَجُلٌ مُنِحَ أَرْضًا فَهُوَ يَزْرَعُ مَا مُنِحَ أَوْ رَجُلٌ اسْتَكْرَى أَرْضًا بِذَهَبٍ أَوْ فِضَّةٍ ‏‏\"‏‏‏.‏‏ مَيَّزَهُ إِسْرَائِيلُ عَنْ طَارِقٍ فَأَرْسَلَ الْكَلاَمَ الأَوَّلَ وَجَعَلَ الأَخِيرَ مِنْ قَوْلِ سَعِيدٍ","english":{"narrator":"It was narrated that Rafi' bin Khadij said:","text":"\"The Messenger of Allah forbade Al-Muhaqalah and Al-Muzabanah, and said: 'Only three may cultivate: A man who has land which he cultivates; a man who was given some land and cultivates what he was given; and a man who takes land on lease for gold or silver.'\""}},{"id":35,"idInBook":35,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، قَالَ أَنْبَأَنَا إِسْرَائِيلُ، عَنْ طَارِقٍ، عَنْ سَعِيدٍ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْمُحَاقَلَةِ قَالَ سَعِيدٌ فَذَكَرَهُ نَحْوَهُ‏.‏‏ رَوَاهُ سُفْيَانُ الثَّوْرِيُّ عَنْ طَارِقٍ‏.‏‏","english":{"narrator":"It was narrated that Sa'eed said:","text":"\"The Messenger of Allah forbade Al-Muhaqalah.\" Sa'eed said: \"And he narrated something similar.\" And Sufyan Ath-Thawri reported it from Tariq."}},{"id":36,"idInBook":36,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا مُحَمَّدُ بْنُ عَلِيٍّ، - وَهُوَ ابْنُ مَيْمُونٍ - قَالَ حَدَّثَنَا مُحَمَّدٌ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ طَارِقٍ، قَالَ سَمِعْتُ سَعِيدَ بْنَ الْمُسَيَّبِ، يَقُولُ لاَ يُصْلِحُ الزَّرْعَ غَيْرُ ثَلاَثٍ أَرْضٍ يَمْلِكُ رَقَبَتَهَا أَوْ مِنْحَةٍ أَوْ أَرْضٍ بَيْضَاءَ يَسْتَأْجِرُهَا بِذَهَبٍ أَوْ فِضَّةٍ‏.‏‏ وَرَوَى الزُّهْرِيُّ الْكَلاَمَ الأَوَّلَ عَنْ سَعِيدٍ فَأَرْسَلَهُ‏.‏‏","english":{"narrator":"It was narrated that Tariq said:","text":"\"I heard Sa'eed bin Al-Musayyab say: 'Cultivating land is not allowed except in three cases: Land which one owns, land which is given to one, or land which one rents in return for gold and silver.'\""}},{"id":37,"idInBook":37,"chapterId":null,"bookId":3,"arabic":"قَالَ الْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، عَنِ ابْنِ الْقَاسِمِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسِيَّبِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الْمُحَاقَلَةِ وَالْمُزَابَنَةِ‏.‏‏ وَرَوَاهُ مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ لَبِيبَةَ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ فَقَالَ عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ‏.‏‏","english":{"narrator":"","text":"It was narrated from Sa'eed bin Al-Musayyab that the Messenger of Allah forbade Al-Muhaqalah and Al-Muzabanah."}},{"id":38,"idInBook":38,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعْدِ بْنِ إِبْرَاهِيمَ، قَالَ حَدَّثَنِي عَمِّي، قَالَ حَدَّثَنَا أَبِي، عَنْ مُحَمَّدِ بْنِ عِكْرِمَةَ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ لَبِيبَةَ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ، قَالَ كَانَ أَصْحَابُ الْمَزَارِعِ يُكْرُونَ فِي زَمَانِ رَسُولِ اللَّهِ صلى الله عليه وسلم مَزَارِعَهُمْ بِمَا يَكُونُ عَلَى السَّاقِي مِنَ الزَّرْعِ فَجَاءُوا رَسُولَ اللَّهِ صلى الله عليه وسلم فَاخْتَصَمُوا فِي بَعْضِ ذَلِكَ فَنَهَاهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يُكْرُوا بِذَلِكَ وَقَالَ ‏‏\n\"‏‏ أَكْرُوا بِالذَّهَبِ وَالْفِضَّةِ ‏‏\"‏‏‏.‏‏ وَقَدْ رَوَى هَذَا الْحَدِيثَ سُلَيْمَانُ عَنْ رَافِعٍ فَقَالَ عَنْ رَجُلٍ مِنْ عُمُومَتِهِ‏.‏‏","english":{"narrator":"It was narrated that Sa'd bin Abi Waqqas said:","text":"\"At the time of the Messenger of Allah landowners used to lease their arable land in return for whatever grew on the banks of the streams for irrigation. They came to the Messenger of Allah and referred a dispute concerning such matters to him, and the Messenger of Allah forbade them to lease land on such terms, and said: 'Lease it for gold or silver.'\""}},{"id":39,"idInBook":39,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنِي زِيَادُ بْنُ أَيُّوبَ، قَالَ حَدَّثَنَا ابْنُ عُلَيَّةَ، قَالَ أَنْبَأَنَا أَيُّوبُ، عَنْ يَعْلَى بْنِ حَكِيمٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنْ رَافِعِ بْنِ خَدِيجٍ، قَالَ كُنَّا نُحَاقِلُ بِالأَرْضِ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَنُكْرِيهَا بِالثُّلُثِ وَالرُّبُعِ وَالطَّعَامِ الْمُسَمَّى فَجَاءَ ذَاتَ يَوْمٍ رَجُلٌ مِنْ عُمُومَتِي فَقَالَ نَهَانِي رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ أَمْرٍ كَانَ لَنَا نَافِعًا وَطَوَاعِيَةُ اللَّهِ وَرَسُولِهِ أَنْفَعُ لَنَا نَهَانَا أَنْ نُحَاقِلَ بِالأَرْضِ وَنُكْرِيَهَا بِالثُّلُثِ وَالرُّبُعِ وَالطَّعَامِ الْمُسَمَّى وَأَمَرَ رَبَّ الأَرْضِ أَنْ يَزْرَعَهَا أَوْ يُزْرِعَهَا وَكَرِهَ كِرَاءَهَا وَمَا سِوَى ذَلِكَ‏.‏‏ أَيُّوبُ لَمْ يَسْمَعْهُ مِنْ يَعْلَى‏.‏‏","english":{"narrator":"It was narrated that Rafi' bin Khadij said:","text":"\"At the time of the Messenger of Allah we used to lease land on the basis of Al-Muhaqalah, so we would lease it in return for one-third or one-quarter of the yield, or a specified amount of food (produce). One day, a man among my paternal uncles came and said 'The Messenger of Allah has forbidden me to do something that was beneficial for us, but obedience to Allah and His Messenger is more beneficial for us. He has forbidden us to lease land on the basis of Al-Muhaqalah and to lease it in return for one-third or one-quarter of the yield, and for a specified amount of food (produce). And he commanded the landowner to cultivate it (himself) or to give it to someone else to cultivate. He did not like leasing it or anything else.'\""}},{"id":40,"idInBook":40,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنِي زَكَرِيَّا بْنُ يَحْيَى، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ، قَالَ حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، قَالَ كَتَبَ إِلَىَّ يَعْلَى بْنُ حَكِيمٍ أَنِّي سَمِعْتُ سُلَيْمَانَ بْنَ يَسَارٍ، يُحَدِّثُ عَنْ رَافِعِ بْنِ خَدِيجٍ، قَالَ كُنَّا نُحَاقِلُ الأَرْضَ نُكْرِيهَا بِالثُّلُثِ وَالرُّبُعِ وَالطَّعَامِ الْمُسَمَّى‏.‏‏ رَوَاهُ سَعِيدٌ عَنْ يَعْلَى بْنِ حَكِيمٍ‏.‏‏","english":{"narrator":"It was narrated from Ayyub who said:","text":"\"Ya'la bin Al-Hakim wrote to me (saying): 'I heard Sulaiman bin Yasar narrating from Rafi' bin Khadij, who said: \"We used to lease land on the basis of Al-Muhaqalah, leasing it in return for one-third or one-quarter of the yield, and a specified amount of food (produce).\"'\""}},{"id":41,"idInBook":41,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، عَنْ سَعِيدٍ، عَنْ يَعْلَى بْنِ حَكِيمٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، أَنَّ رَافِعَ بْنَ خَدِيجٍ، قَالَ كُنَّا نُحَاقِلُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَزَعَمَ أَنَّ بَعْضَ عُمُومَتِهِ أَتَاهُ فَقَالَ نَهَانِي رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ أَمْرٍ كَانَ لَنَا نَافِعًا وَطَوَاعِيَةُ اللَّهِ وَرَسُولِهِ أَنْفَعُ لَنَا‏.‏‏ قُلْنَا وَمَا ذَاكَ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏‏\n\"‏‏ مَنْ كَانَتْ لَهُ أَرْضٌ فَلْيَزْرَعْهَا أَوْ لِيُزْرِعْهَا أَخَاهُ وَلاَ يُكَارِيهَا بِثُلُثٍ وَلاَ رُبُعٍ وَلاَ طَعَامٍ مُسَمًّى ‏‏\"‏‏‏.‏‏ رَوَاهُ حَنْظَلَةُ بْنُ قَيْسٍ عَنْ رَافِعٍ فَاخْتُلِفَ عَلَى رَبِيعَةَ فِي رِوَايَتِهِ‏.‏‏","english":{"narrator":"It was narrated that Rafi' bin Khadij said:","text":"\"We used to lease land on the basis of Al-Muhaqalah during the time of the Messenger of Allah.\" He said that one of his paternal uncles came to them and said: \"The Messenger of Allah has forbidden me to do something that was beneficial for us, but obedience to Allah and His Messenger is more beneficial.\" We said: \"What is that?\" He said: \"The Messenger of Allah said: 'Whoever has land, let him cultivate it (himself) or give it to his brother to cultivate, and not lease it in return for one-third or one-quarter of the yield nor a specified amount of food (produce).'\""}},{"id":42,"idInBook":42,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ، قَالَ حَدَّثَنَا حُجَيْنُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ حَنْظَلَةَ بْنِ قَيْسٍ، عَنْ رَافِعِ بْنِ خَدِيجٍ، قَالَ حَدَّثَنِي عَمِّي، أَنَّهُمْ كَانُوا يُكْرُونَ الأَرْضَ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم بِمَا يَنْبُتُ عَلَى الأَرْبِعَاءِ وَشَىْءٍ مِنَ الزَّرْعِ يَسْتَثْنِي صَاحِبُ الأَرْضِ فَنَهَانَا رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ ذَلِكَ‏.‏‏ فَقُلْتُ لِرَافِعٍ فَكَيْفَ كِرَاؤُهَا بِالدِّينَارِ وَالدِّرْهَمِ فَقَالَ رَافِعٌ لَيْسَ بِهَا بَأْسٌ بِالدِّينَارِ وَالدِّرْهَمِ‏.‏‏ خَالَفَهُ الأَوْزَاعِيُّ‏.‏‏","english":{"narrator":"It was narrated that Rafi' bin Khadij said:","text":"\"My paternal uncle told me that they used to lease land at the time of the Messenger of Allah in return for what grew on the banks of the streams, and a share of the crop stipulated by the owner of the land. But the Messenger of Allah forbade us that.\" I (Hanzalah) said to Rafi': \"How about leasing it in return for Dinars and Dirhams?\" Rafi' said: \"There is nothing wrong with (leasing it) for Dinars and Dirhams.\""}},{"id":43,"idInBook":43,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنِي الْمُغِيرَةُ بْنُ عَبْدِ الرَّحْمَنِ، قَالَ حَدَّثَنَا عِيسَى، - هُوَ ابْنُ يُونُسَ - قَالَ حَدَّثَنَا الأَوْزَاعِيُّ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ حَنْظَلَةَ بْنِ قَيْسٍ الأَنْصَارِيِّ، قَالَ سَأَلْتُ رَافِعَ بْنَ خَدِيجٍ عَنْ كِرَاءِ الأَرْضِ، بِالدِّينَارِ وَالْوَرِقِ فَقَالَ لاَ بَأْسَ بِذَلِكَ إِنَّمَا كَانَ النَّاسُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم يُؤَاجِرُونَ عَلَى الْمَاذِيَانَاتِ وَأَقْبَالِ الْجَدَاوِلِ فَيَسْلَمُ هَذَا وَيَهْلِكُ هَذَا وَيَسْلَمُ هَذَا وَيَهْلِكُ هَذَا فَلَمْ يَكُنْ لِلنَّاسِ كِرَاءٌ إِلاَّ هَذَا فَلِذَلِكَ زُجِرَ عَنْهُ فَأَمَّا شَىْءٌ مَعْلُومٌ مَضْمُونٌ فَلاَ بَأْسَ بِهِ‏.‏‏ وَافَقَهُ مَالِكُ بْنُ أَنَسٍ عَلَى إِسْنَادِهِ وَخَالَفَهُ فِي لَفْظِهِ‏.‏‏","english":{"narrator":"It was narrated that Hanzalah bin Qais Al-Ansari said:","text":"\"I asked Rafi' bin Khadij about leasing land in return for Dinars and silver. He said: 'There is nothing wrong with that. During the time of the Messenger of Allah they used to rent land to one another in return for what grew on the banks of streams and where the springs emerged - some areas of which might give good produce and some might give none at all - and the people did not lease land in any other way. So that was forbidden. But as for leases where the return is known and guaranteed, there is nothing wrong with that.'\""}},{"id":44,"idInBook":44,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا مَالِكٌ، عَنْ رَبِيعَةَ، عَنْ حَنْظَلَةَ بْنِ قَيْسٍ، قَالَ سَأَلْتُ رَافِعَ بْنَ خَدِيجٍ عَنْ كِرَاءِ الأَرْضِ، فَقَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ كِرَاءِ الأَرْضِ‏.‏‏ قُلْتُ بِالذَّهَبِ وَالْوَرِقِ قَالَ لاَ إِنَّمَا نَهَى عَنْهَا بِمَا يَخْرُجُ مِنْهَا فَأَمَّا الذَّهَبُ وَالْفِضَّةُ فَلاَ بَأْسَ‏.‏‏ رَوَاهُ سُفْيَانُ الثَّوْرِيُّ رضى الله عنه عَنْ رَبِيعَةَ وَلَمْ يَرْفَعْهُ‏.‏‏","english":{"narrator":"It was narrated that Hanzalah bin Qais said:","text":"\"I asked Rafi' bin Khadij about leasing land. He said: 'The Messenger of Allah forbade leasing land.' I said: 'For gold or silver?' He said: 'No, rather he forbade leasing it in return for what the land produces. As for gold and silver, there is nothing wrong with that.'\""}},{"id":45,"idInBook":45,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ، عَنْ وَكِيعٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ حَنْظَلَةَ بْنِ قَيْسٍ، قَالَ سَأَلْتُ رَافِعَ بْنَ خَدِيجٍ عَنْ كِرَاءِ الأَرْضِ الْبَيْضَاءِ، بِالذَّهَبِ وَالْفِضَّةِ فَقَالَ حَلاَلٌ لاَ بَأْسَ بِهِ ذَلِكَ فَرْضُ الأَرْضِ‏.‏‏ رَوَاهُ يَحْيَى بْنُ سَعِيدٍ عَنْ حَنْظَلَةَ بْنِ قَيْسٍ وَرَفَعَهُ كَمَا رَوَاهُ مَالِكٌ عَنْ رَبِيعَةَ‏.‏‏","english":{"narrator":"It was narrated that Hanzalah bin Qais said:","text":"\"I asked Rafi' bin Khadij about leasing uncultivated land in return for gold and silver. He said: '(It is) permissible and there is nothing wrong with that. That is the due of the land.'\""}},{"id":46,"idInBook":46,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا يَحْيَى بْنُ حَبِيبِ بْنِ عَرَبِيٍّ، فِي حَدِيثِهِ عَنْ حَمَّادِ بْنِ زَيْدٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ حَنْظَلَةَ بْنِ قَيْسٍ، عَنْ رَافِعِ بْنِ خَدِيجٍ، قَالَ نَهَانَا رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ كِرَاءِ أَرْضِنَا وَلَمْ يَكُنْ يَوْمَئِذٍ ذَهَبٌ وَلاَ فِضَّةٌ فَكَانَ الرَّجُلُ يُكْرِي أَرْضَهُ بِمَا عَلَى الرَّبِيعِ وَالأَقْبَالِ وَأَشْيَاءَ مَعْلُومَةٍ وَسَاقَهُ‏.‏‏ رَوَاهُ سَالِمُ بْنُ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ رَافِعِ بْنِ خَدِيجٍ وَاخْتُلِفَ عَلَى الزُّهْرِيِّ فِيهِ‏.‏‏","english":{"narrator":"It was narrated that Rafi' bin Khadij said:","text":"\"The Messenger of Allah forbade us to lease our land. At that time there was no gold nor silver. A man would lease his land in return for what grew on the banks of streams and where the springs emerged, and in return for something specific.\""}},{"id":47,"idInBook":47,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَسْمَاءَ، عَنْ جُوَيْرِيَةَ، عَنْ مَالِكٍ، عَنِ الزُّهْرِيِّ، أَنَّ سَالِمَ بْنَ عَبْدِ اللَّهِ، وَذَكَرَ، نَحْوَهُ‏.‏‏ تَابَعَهُ عُقَيْلُ بْنُ خَالِدٍ‏.‏‏","english":{"narrator":"","text":"It was narrated from Az-Zuhri that Salim bin 'Abdullah narrated something similar."}},{"id":48,"idInBook":48,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ بْنِ سَعْدٍ، قَالَ حَدَّثَنَا أَبِي، عَنْ جَدِّي، قَالَ أَخْبَرَنِي عُقَيْلُ بْنُ خَالِدٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يُكْرِي أَرْضَهُ حَتَّى بَلَغَهُ أَنَّ رَافِعَ بْنَ خَدِيجٍ كَانَ يَنْهَى عَنْ كِرَاءِ الأَرْضِ فَلَقِيَهُ عَبْدُ اللَّهِ فَقَالَ يَا ابْنَ خَدِيجٍ مَاذَا تُحَدِّثُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي كِرَاءِ الأَرْضِ فَقَالَ رَافِعٌ لِعَبْدِ اللَّهِ سَمِعْتُ عَمَّىَّ - وَكَانَا قَدْ شَهِدَا بَدْرًا - يُحَدِّثَانِ أَهْلَ الدَّارِ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ كِرَاءِ الأَرْضِ‏.‏‏ قَالَ عَبْدُ اللَّهِ فَلَقَدْ كُنْتُ أَعْلَمُ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّ الأَرْضَ تُكْرَى ثُمَّ خَشِيَ عَبْدُ اللَّهِ أَنْ يَكُونَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَحْدَثَ فِي ذَلِكَ شَيْئًا لَمْ يَكُنْ يَعْلَمُهُ فَتَرَكَ كِرَاءَ الأَرْضِ‏.‏‏ أَرْسَلَهُ شُعَيْبُ بْنُ أَبِي حَمْزَةَ‏.‏‏","english":{"narrator":"Salim bin Abdullah narrated that Abdullah bin Umar used to lease his land until he heard that Rafi bin Khadij forbade leasing land. Abdullah met him and said:","text":"\"O Ibn Khadij, what do you narrate from the Messenger of Allah about leasing land?\" Rafi said to Abdullah: \"I heard two of my uncles, who had been present at Badr, telling the people in the house, that the Messenger of Allah forbade leasing land.\" Abdullah said: \"I knew that at the time of the Messenger of Allah land used to be leased.\" Then Abdullah was concerned that the Messenger of Allah had decreed something and he had not known about it, so he stopped leasing land."}},{"id":49,"idInBook":49,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنِي مُحَمَّدُ بْنُ خَالِدِ بْنِ خَلِيٍّ، قَالَ حَدَّثَنَا بِشْرُ بْنُ شُعَيْبٍ، عَنْ أَبِيهِ، عَنِ الزُّهْرِيِّ، قَالَ بَلَغَنَا أَنَّ رَافِعَ بْنَ خَدِيجٍ، كَانَ يُحَدِّثُ أَنَّ عَمَّيْهِ، وَكَانَا، - يَزْعُمُ - شَهِدَا بَدْرًا أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ كِرَاءِ الأَرْضِ‏.‏‏ رَوَاهُ عُثْمَانُ بْنُ سَعِيدٍ عَنْ شُعَيْبٍ وَلَمْ يَذْكُرْ عَمَّيْهِ‏.‏‏","english":{"narrator":"It was narrated that Az-Zuhri said:","text":"\"We heard that Rafi bin Khadij used to narrate that his paternal uncles -whom he said had been present at Badr- (said) that the Messenger of Allah forbade leasing land.\""}},{"id":50,"idInBook":50,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ الْمُغِيرَةِ، قَالَ حَدَّثَنَا عُثْمَانُ بْنُ سَعِيدٍ، عَنْ شُعَيْبٍ، قَالَ الزُّهْرِيُّ كَانَ ابْنُ الْمُسَيَّبِ يَقُولُ لَيْسَ بِاسْتِكْرَاءِ الأَرْضِ بِالذَّهَبِ وَالْوَرِقِ بَأْسٌ وَكَانَ رَافِعُ بْنُ خَدِيجٍ يُحَدِّثُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ ذَلِكَ‏.‏‏ وَافَقَهُ عَلَى إِرْسَالِهِ عَبْدُ الْكَرِيمِ بْنُ الْحَارِثِ‏.‏‏","english":{"narrator":"It was narrated from Shu'aib:","text":"\"Az-Zuhri said: 'Ibn Al-Musayyab used to say: 'There is nothing wrong with leasing land in return for gold and silver, and Rafi bin Khadij used to narrate that the Messenger of Allah forbade that.''\""}},{"id":51,"idInBook":51,"chapterId":null,"bookId":3,"arabic":"قَالَ الْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، عَنِ ابْنِ وَهْبٍ، قَالَ أَخْبَرَنِي أَبُو خُزَيْمَةَ عَبْدُ اللَّهِ بْنُ طَرِيفٍ، عَنْ عَبْدِ الْكَرِيمِ بْنِ الْحَارِثِ، عَنِ ابْنِ شِهَابٍ، أَنَّ رَافِعَ بْنَ خَدِيجٍ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ كِرَاءِ الأَرْضِ‏.‏‏ قَالَ ابْنُ شِهَابٍ فَسُئِلَ رَافِعٌ بَعْدَ ذَلِكَ كَيْفَ كَانُوا يُكْرُونَ الأَرْضَ قَالَ بِشَىْءٍ مِنَ الطَّعَامِ مُسَمًّى وَيُشْتَرَطُ أَنَّ لَنَا مَا تُنْبِتُ مَاذِيَانَاتُ الأَرْضِ وَأَقْبَالُ الْجَدَاوِلِ‏.‏‏ رَوَاهُ نَافِعٌ عَنْ رَافِعِ بْنِ خَدِيجٍ وَاخْتُلِفَ عَلَيْهِ فِيهِ‏.‏‏","english":{"narrator":"It was narrated from Ibn Shihab that Rafi bin Khadij said:","text":"\"The Messenger of Allah forbade leasing land.\" Ibn Shihab said: \"Rafi was asked after that: 'How did they lease land?' He said: 'In return for a set amount of food (produce), and it was stipulated that we would have whatever grew on the banks of the streams and springs.'\""}},{"id":52,"idInBook":52,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ بَزِيعٍ، قَالَ حَدَّثَنَا فُضَيْلٌ، قَالَ حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، قَالَ أَخْبَرَنِي نَافِعٌ، أَنَّ رَافِعَ بْنَ خَدِيجٍ، أَخْبَرَ عَبْدَ اللَّهِ بْنَ عُمَرَ، أَنَّ عُمُومَتَهُ، جَاءُوا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم ثُمَّ رَجَعُوا فَأَخْبَرُوا أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ كِرَاءِ الْمَزَارِعِ‏.‏‏ فَقَالَ عَبْدُ اللَّهِ قَدْ عَلِمْنَا أَنَّهُ كَانَ كُلُّ صَاحِبَ مَزْرَعَةٍ يُكْرِيهَا عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم عَلَى أَنَّ لَهُ مَا عَلَى الرَّبِيعِ السَّاقِي الَّذِي يَتَفَجَّرُ مِنْهُ الْمَاءُ وَطَائِفَةٌ مِنَ التِّبْنِ لاَ أَدْرِي كَمْ هِيَ‏.‏‏ رَوَاهُ ابْنُ عَوْنٍ عَنْ نَافِعٍ فَقَالَ عَنْ بَعْضِ عُمُومَتِهِ‏.‏‏","english":{"narrator":"Rafi bin Khadij told Abdullah bin Umar that his paternal uncles went to the Messenger of Allah, then they came back and told them that the Messenger of Allah had forbidden leasing arable land. Abdullah said:","text":"\"We knew that he owned some arable land that he leased at the time of the Messenger of Allah in return for whatever grew on the banks of the streams of water, and for a certain amount of straw, I do not know how much it was.\" Ibn Awn reported it from Nafi but he said: \"From some of his paternal uncles.\""}},{"id":53,"idInBook":53,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنِي مُحَمَّدُ بْنُ إِسْمَاعِيلَ بْنِ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا يَزِيدُ، قَالَ أَنْبَأَنَا ابْنُ عَوْنٍ، عَنْ نَافِعٍ، كَانَ ابْنُ عُمَرَ يَأْخُذُ كِرَاءَ الأَرْضِ فَبَلَغَهُ عَنْ رَافِعِ بْنِ خَدِيجٍ، شَىْءٌ فَأَخَذَ بِيَدِي فَمَشَى إِلَى رَافِعٍ وَأَنَا مَعَهُ فَحَدَّثَهُ رَافِعٌ عَنْ بَعْضِ عُمُومَتِهِ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ كِرَاءِ الأَرْضِ‏.‏‏ فَتَرَكَ عَبْدُ اللَّهِ بَعْدُ‏.‏‏","english":{"narrator":"It was narrated from Nafi':","text":"\"Ibn 'Umar used to take rent for some land, then he heard something from Rafi' bin Khadij. He took me by the hand and went off to Rafi', and I was with him. Rafi' narrated to him from some of his paternal uncles, that the Messenger of Allah forbade leasing land, so 'Abdullah stopped (doing that) afterward.\""}},{"id":54,"idInBook":54,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ، قَالَ حَدَّثَنَا إِسْحَاقُ الأَزْرَقُ، قَالَ حَدَّثَنَا ابْنُ عَوْنٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّهُ كَانَ يَأْخُذُ كِرَاءَ الأَرْضِ حَتَّى حَدَّثَهُ رَافِعٌ عَنْ بَعْضِ عُمُومَتِهِ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ كِرَاءِ الأَرْضِ فَتَرَكَهَا بَعْدُ‏.‏‏ رَوَاهُ أَيُّوبُ عَنْ نَافِعٍ عَنْ رَافِعٍ وَلَمْ يَذْكُرْ عُمُومَتَهُ‏.‏‏","english":{"narrator":"","text":"It was narrated from Ibn 'Umar that he used to take rent for land until Rafi' narrated to him, from some of his paternal uncles, that the Messenger of Allah forbade leasing land. So he stopped doing that afterward."}},{"id":55,"idInBook":55,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ بَزِيعٍ، قَالَ حَدَّثَنَا يَزِيدُ، - وَهُوَ ابْنُ زُرَيْعٍ - قَالَ حَدَّثَنَا أَيُّوبُ، عَنْ نَافِعٍ، أَنَّ ابْنَ عُمَرَ، كَانَ يُكْرِي مَزَارِعَهُ حَتَّى بَلَغَهُ فِي آخِرِ خِلاَفَةِ مُعَاوِيَةَ أَنَّ رَافِعَ بْنَ خَدِيجٍ يُخْبِرُ فِيهَا بِنَهْىِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَتَاهُ وَأَنَا مَعَهُ فَسَأَلَهُ فَقَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَنْهَى عَنْ كِرَاءِ الْمَزَارِعِ فَتَرَكَهَا ابْنُ عُمَرَ بَعْدُ فَكَانَ إِذَا سُئِلَ عَنْهَا قَالَ زَعَمَ رَافِعُ بْنُ خَدِيجٍ أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنْهَا‏.‏‏ وَافَقَهُ عُبَيْدُ اللَّهِ بْنُ عُمَرَ وَكَثِيرُ بْنُ فَرْقَدٍ وَجُوَيْرِيَةُ بْنُ أَسْمَاءَ‏.‏‏","english":{"narrator":"It was narrated from Nafi' that Ibn 'Umar used to lease out his arable land until he heard at the end of Mu'awiyah's Khilafah, that Rafi' bin Khadij used to narrate, that the Messenger of Allah had forbidden that. He went to him -and I (Nafi') was with him- and asked him (about that). He said:","text":"\"The Messenger of Allah used to forbid leasing arable land.\" So Ibn 'Umar stopped (doing that) afterward. When he was asked about it he said: \"Rafi' bin Khadij said that the Prophet forbade that.\""}},{"id":56,"idInBook":56,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ بْنِ أَعْيَنَ، قَالَ حَدَّثَنَا شُعَيْبُ بْنُ اللَّيْثِ، عَنْ أَبِيهِ، عَنْ كَثِيرِ بْنِ فَرْقَدٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يُكْرِي الْمَزَارِعَ فَحُدِّثَ أَنَّ رَافِعَ بْنَ خَدِيجٍ يَأْثُرُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ نَهَى عَنْ ذَلِكَ‏.‏‏ قَالَ نَافِعٌ فَخَرَجَ إِلَيْهِ عَلَى الْبَلاَطِ وَأَنَا مَعَهُ فَسَأَلَهُ فَقَالَ نَعَمْ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ كِرَاءِ الْمَزَارِعِ‏.‏‏ فَتَرَكَ عَبْدُ اللَّهِ كِرَاءَهَا‏.‏‏","english":{"narrator":"It was narrated from Nafi' that 'Abdullah bin 'Umar used to lease arable land, then he was told that Rafi' bin Khadij narrated from the Messenger of Allah that he forbade that. Nafi' said:","text":"\"He went out to him (and met him) in Al-Balat, and I was with him. He asked him (about that) and he said: 'Yes, the Messenger of Allah forbade leasing arable land.' So 'Abdullah stopped leasing it.\""}},{"id":57,"idInBook":57,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا خَالِدٌ، - وَهُوَ ابْنُ الْحَارِثِ - قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ، عَنْ نَافِعٍ، أَنَّ رَجُلاً، أَخْبَرَ ابْنَ عُمَرَ، أَنَّ رَافِعَ بْنَ خَدِيجٍ، يَأْثُرُ فِي كِرَاءِ الأَرْضِ حَدِيثًا فَانْطَلَقْتُ مَعَهُ أَنَا وَالرَّجُلُ الَّذِي أَخْبَرَهُ حَتَّى أَتَى رَافِعًا فَأَخْبَرَهُ رَافِعٌ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ كِرَاءِ الأَرْضِ‏.‏‏ فَتَرَكَ عَبْدُ اللَّهِ كِرَاءَ الأَرْضِ‏.‏‏","english":{"narrator":"It was narrated from Nafi':","text":"\"A man told Ibn 'Umar that Rafi' bin Khadij had narrated a Hadith concerning leasing of land. He and I, along with the man who had told him that, went to Rafi', and he told us that the Messenger of Allah had forbidden leasing land. So 'Abdullah stopped leasing land.\""}},{"id":58,"idInBook":58,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ الْمُقْرِئُ، قَالَ حَدَّثَنَا أَبِي قَالَ، حَدَّثَنَا جُوَيْرِيَةُ، عَنْ نَافِعٍ، أَنَّ رَافِعَ بْنَ خَدِيجٍ، حَدَّثَ عَبْدَ اللَّهِ بْنَ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ كِرَاءِ الْمَزَارِعِ‏.‏‏","english":{"narrator":"","text":"It was narrated from Nafi' that Rafi' bin Khadij told 'Abdullah bin 'Umar that the Messenger of Allah forbade leasing arable land."}},{"id":59,"idInBook":59,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا هِشَامُ بْنُ عَمَّارٍ، قَالَ حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ، قَالَ حَدَّثَنَا الأَوْزَاعِيُّ، قَالَ حَدَّثَنِي حَفْصُ بْنُ عِنَانٍ، عَنْ نَافِعٍ، أَنَّهُ حَدَّثَهُ قَالَ كَانَ ابْنُ عُمَرَ يُكْرِي أَرْضَهُ بِبَعْضِ مَا يَخْرُجُ مِنْهَا فَبَلَغَهُ أَنَّ رَافِعَ بْنَ خَدِيجٍ يَزْجُرُ عَنْ ذَلِكَ وَقَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ ذَلِكَ قَالَ كُنَّا نُكْرِي الأَرْضَ قَبْلَ أَنْ نَعْرِفَ رَافِعًا ثُمَّ وَجَدَ فِي نَفْسِهِ فَوَضَعَ يَدَهُ عَلَى مَنْكِبِي حَتَّى دُفِعْنَا إِلَى رَافِعٍ فَقَالَ لَهُ عَبْدُ اللَّهِ أَسَمِعْتَ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنْ كِرَاءِ الأَرْضِ فَقَالَ رَافِعٌ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏‏\n\"‏‏ لاَ تُكْرُوا الأَرْضَ بِشَىْءٍ ‏‏\"‏‏‏.‏‏","english":{"narrator":"It was narrated from Nafi' that he narrated:","text":"\"Ibn 'Umar used to lease his land in return for some of its produce.  Then he heard that Rafi' bin Khadij warned against that. He said: 'The Messenger of Allah forbade that.' He said: 'We used to lease our land before we came to know Rafi'.' Then he (Ibn 'Umar) became unsure, so he put his hand on my shoulder and we went to Rafi'. 'Abdullah said to him: 'Did you hear the Prophet forbid leasing land?' Rafi' said: 'I heard the Prophet say: Do not lease land in return for anything.'\""}},{"id":60,"idInBook":60,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، عَنْ عَبْدِ الْوَهَّابِ، قَالَ حَدَّثَنَا هِشَامٌ، عَنْ مُحَمَّدٍ، وَنَافِعٍ، أَخْبَرَاهُ عَنْ رَافِعِ بْنِ خَدِيجٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ كِرَاءِ الأَرْضِ‏.‏‏ رَوَاهُ ابْنُ عُمَرَ عَنْ رَافِعِ بْنِ خَدِيجٍ‏.‏‏ وَاخْتُلِفَ عَلَى عَمْرِو بْنِ دِينَارٍ‏.‏‏","english":{"narrator":"","text":"It was narrated from Rafi' bin Khadij that the Messenger of Allah forbade leasing land."}},{"id":61,"idInBook":61,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ، قَالَ أَنْبَأَنَا وَكِيعٌ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرِو بْنِ دِينَارٍ، قَالَ سَمِعْتُ ابْنَ عُمَرَ، يَقُولُ كُنَّا نُخَابِرُ وَلاَ نَرَى بِذَلِكَ بَأْسًا حَتَّى زَعَمَ رَافِعُ بْنُ خَدِيجٍ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الْمُخَابَرَةِ‏.‏‏","english":{"narrator":"It was narrated that 'Amr bin Dinar said:","text":"\"I heard Ibn 'Umar say: 'We used to sell grain before it was ripe and before it was evident that it was free of disease and blight (by means of Al-Mukhabarah). We did not see anything wrong with that, until Rafi' bin Khadij said that the Messenger of Allah had forbidden Al-Mukhabarah.'\""}},{"id":62,"idInBook":62,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ خَالِدٍ، قَالَ حَدَّثَنَا حَجَّاجٌ، قَالَ قَالَ ابْنُ جُرَيْجٍ سَمِعْتُ عَمْرَو بْنَ دِينَارٍ، يَقُولُ أَشْهَدُ لَسَمِعْتُ ابْنَ عُمَرَ وَهُوَ يُسْأَلُ عَنِ الْخِبْرِ، فَيَقُولُ مَا كُنَّا نَرَى بِذَلِكَ بَأْسًا حَتَّى أَخْبَرَنَا عَامَ الأَوَّلِ ابْنُ خَدِيجٍ أَنَّهُ سَمِعَ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنِ الْخِبْرِ‏.‏‏ وَافَقَهُمَا حَمَّادُ بْنُ زَيْدٍ‏.‏‏","english":{"narrator":"'Amr bin Dinar said:","text":"\"I bear witness that I heard Ibn 'Umar asking about Al-Khibr (the agreement to Al-Mukhabarah) and he said: 'We did not see anything wrong with that, until Ibn Khadij told us earlier that he heard the Messenger of Allah forbidding Al-Khibr.'\" Hammad bin Zaid was in accord with the two of them."}},{"id":63,"idInBook":63,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا يَحْيَى بْنُ حَبِيبِ بْنِ عَرَبِيٍّ، عَنْ حَمَّادِ بْنِ زَيْدٍ، عَنْ عَمْرِو بْنِ دِينَارٍ، قَالَ سَمِعْتُ ابْنَ عُمَرَ، يَقُولُ كُنَّا لاَ نَرَى بِالْخِبْرِ بَأْسًا حَتَّى كَانَ عَامَ الأَوَّلِ فَزَعَمَ رَافِعٌ أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم نَهَى عَنْهُ‏.‏‏ خَالَفَهُ عَارِمٌ فَقَالَ عَنْ حَمَّادٍ عَنْ عَمْرٍو عَنْ جَابِرٍ‏.‏‏","english":{"narrator":"It was narrated that 'Amr bin Dinar said:","text":"\"I heard Ibn 'Umar say: 'We did not see anything wrong with Al-Khibr until last year, when Rafi' said that the Prophet of Allah forbade it.'\""}},{"id":64,"idInBook":64,"chapterId":null,"bookId":3,"arabic":"قَالَ حَدَّثَنَا حَرَمِيُّ بْنُ يُونُسَ، قَالَ حَدَّثَنَا عَارِمٌ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنْ كِرَاءِ الأَرْضِ‏.‏‏ تَابَعَهُ مُحَمَّدُ بْنُ مُسْلِمٍ الطَّائِفِيُّ‏.‏‏","english":{"narrator":"","text":"It was narrated from Jabir bin 'Abdullah that the Prophet forbade leasing land."}},{"id":65,"idInBook":65,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنِي مُحَمَّدُ بْنُ عَامِرٍ، قَالَ حَدَّثَنَا سُرَيْجٌ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ مُسْلِمٍ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ جَابِرٍ، قَالَ نَهَانِي رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْمُخَابَرَةِ وَالْمُحَاقَلَةِ وَالْمُزَابَنَةِ‏.‏‏ جَمَعَ سُفْيَانُ بْنُ عُيَيْنَةَ الْحَدِيثَيْنِ فَقَالَ عَنِ ابْنِ عُمَرَ وَجَابِرٍ‏.‏‏","english":{"narrator":"It was narrated that Jabir said:","text":"\"The Messenger of Allah forbade Al-Mukhabarah, Al-Muhaqalah and Al-Muzabanah.\""}},{"id":66,"idInBook":66,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْمِسْوَرِ، قَالَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، وَجَابِرٍ، نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ بَيْعِ الثَّمَرِ حَتَّى يَبْدُوَ صَلاَحُهُ وَنَهَى عَنِ الْمُخَابَرَةِ كِرَاءِ الأَرْضِ بِالثُّلُثِ وَالرُّبُعِ‏.‏‏ رَوَاهُ أَبُو النَّجَاشِيِّ عَطَاءُ بْنُ صُهَيْبٍ وَاخْتُلِفَ عَلَيْهِ فِيهِ‏.‏‏","english":{"narrator":"","text":"It was narrated from Ibn 'Umar and Jabir that the Messenger of Allah forbade selling fruits until it was clear that they were free of blemish, and (he forbade from) Al-Mukhabarah; leasing land in return for one-third or one-quarter (of the yield)."}},{"id":67,"idInBook":67,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا أَبُو بَكْرٍ، مُحَمَّدُ بْنُ إِسْمَاعِيلَ الطَّبَرَانِيُّ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ بَحْرٍ، قَالَ حَدَّثَنَا مُبَارَكُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ، قَالَ حَدَّثَنِي أَبُو النَّجَاشِيِّ، قَالَ حَدَّثَنِي رَافِعُ بْنُ خَدِيجٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ لِرَافِعٍ ‏‏\"‏‏ أَتُؤَاجِرُونَ مَحَاقِلَكُمْ ‏‏\"‏‏‏.‏‏ قُلْتُ نَعَمْ يَا رَسُولَ اللَّهِ نُؤَاجِرُهَا عَلَى الرُّبُعِ وَعَلَى الأَوْسَاقِ مِنَ الشَّعِيرِ‏.‏‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏‏\"‏‏ لاَ تَفْعَلُوا ازْرَعُوهَا أَوْ أَعِيرُوهَا أَوْ أَمْسِكُوهَا ‏‏\"‏‏‏.‏‏ خَالَفَهُ الأَوْزَاعِيُّ فَقَالَ عَنْ رَافِعٍ عَنْ ظُهَيْرِ بْنِ رَافِعٍ‏.‏‏","english":{"narrator":"Rafi' bin Khadij narrated that the Messenger of Allah said to Rafi':","text":"\"Do you rent out your arable land?\" I said: \"Yes, O Messenger of Allah. We rent it out in return for one-quarter, and in return for (a number of) Wasqs of barley.\" The Messenger of Allah said: \"Do not do that. Cultivate it (yourselves), or lend it, or keep it.\""}},{"id":68,"idInBook":68,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا هِشَامُ بْنُ عَمَّارٍ، قَالَ حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ، قَالَ حَدَّثَنِي الأَوْزَاعِيُّ، عَنْ أَبِي النَّجَاشِيِّ، عَنْ رَافِعٍ، قَالَ أَتَانَا ظُهَيْرُ بْنُ رَافِعٍ فَقَالَ نَهَانِي رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ أَمْرٍ كَانَ لَنَا رَافِقًا‏.‏‏ قُلْتُ وَمَا ذَاكَ قَالَ أَمْرُ رَسُولِ اللَّهِ صلى الله عليه وسلم وَهُوَ حَقٌّ سَأَلَنِي ‏‏\"‏‏ كَيْفَ تَصْنَعُونَ فِي مَحَاقِلِكُمْ ‏‏\"‏‏‏.‏‏ قُلْتُ نُؤَاجِرُهَا عَلَى الرُّبُعِ وَالأَوْسَاقِ مِنَ التَّمْرِ أَوِ الشَّعِيرِ‏.‏‏ قَالَ ‏‏\"‏‏ فَلاَ تَفْعَلُوا ازْرَعُوهَا أَوْ أَزْرِعُوهَا أَوْ أَمْسِكُوهَا ‏‏\"‏‏‏.‏‏ رَوَاهُ بُكَيْرُ بْنُ عَبْدِ اللَّهِ بْنِ الأَشَجِّ عَنْ أُسَيْدِ بْنِ رَافِعٍ فَجَعَلَ الرِّوَايَةَ لأَخِي رَافِعٍ‏.‏‏","english":{"narrator":"It was narrated that Rafi' said:","text":"\"Zuhair bin Rafi' came to us and said: 'The Messenger of Allah forbade me to do something that was convenient for us.' I said: 'What was that?' He said: 'The command of the Messenger of Allah is true. He asked me: What do you do with your land? I said: We rent it out in return for one-quarter (of the yield) and a number of Wasqs of dates or barley. He said: Do not do that. Cultivate it, give it to someone else to cultivate, or keep it.'\""}},{"id":69,"idInBook":69,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمٍ، قَالَ حَدَّثَنَا حِبَّانُ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، عَنْ لَيْثٍ، قَالَ حَدَّثَنِي بُكَيْرُ بْنُ عَبْدِ اللَّهِ بْنِ الأَشَجِّ، عَنْ أُسَيْدِ بْنِ رَافِعِ بْنِ خَدِيجٍ، أَنَّ أَخَا، رَافِعٍ قَالَ لِقَوْمِهِ قَدْ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم الْيَوْمَ عَنْ شَىْءٍ كَانَ لَكُمْ رَافِقًا وَأَمْرُهُ طَاعَةٌ وَخَيْرٌ نَهَى عَنِ الْحَقْلِ‏.‏‏","english":{"narrator":"It was narrated from Usaid bin Rafi' bin Khadij that the brother of Rafi' said to his people:","text":"\"Today the Messenger of Allah has forbidden something which was convenient for you, but following his command is an act of obedience (to Allah) and is good. He forbade Al-Haql.\""}},{"id":70,"idInBook":70,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا شُعَيْبُ بْنُ اللَّيْثِ، عَنِ اللَّيْثِ، عَنْ جَعْفَرِ بْنِ رَبِيعَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ هُرْمُزَ، قَالَ سَمِعْتُ أُسَيْدَ بْنَ رَافِعِ بْنِ خَدِيجٍ الأَنْصَارِيَّ، يَذْكُرُ أَنَّهُمْ مَنَعُوا الْمُحَاقَلَةَ وَهِيَ أَرْضٌ تُزْرَعُ عَلَى بَعْضِ مَا فِيهَا‏.‏‏ رَوَاهُ عِيسَى بْنُ سَهْلِ بْنِ رَافِعٍ‏.‏‏","english":{"narrator":"It was narrated that 'Abdur-Rahman bin Hurmuz said:","text":"\"I heard Usaid bin Rafi' bin Khadij Al-Ansari say that they did not allow Al-Muhaqalah, which is land that is cultivated in return for some of its produce.\""}},{"id":71,"idInBook":71,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمٍ، قَالَ أَنْبَأَنَا حِبَّانُ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ سَعِيدِ بْنِ يَزِيدَ أَبِي شُجَاعٍ، قَالَ حَدَّثَنِي عِيسَى بْنُ سَهْلِ بْنِ رَافِعِ بْنِ خَدِيجٍ، قَالَ إِنِّي لَيَتِيمٌ فِي حَجْرِ جَدِّي رَافِعِ بْنِ خَدِيجٍ وَبَلَغْتُ رَجُلاً وَحَجَجْتُ مَعَهُ فَجَاءَ أَخِي عِمْرَانُ بْنُ سَهْلِ بْنِ رَافِعِ بْنِ خَدِيجٍ فَقَالَ يَا أَبَتَاهُ إِنَّهُ قَدْ أَكْرَيْنَا أَرْضَنَا فُلاَنَةَ بِمِائَتَىْ دِرْهَمٍ‏.‏‏ فَقَالَ يَا بُنَىَّ دَعْ ذَاكَ فَإِنَّ اللَّهَ عَزَّ وَجَلَّ سَيَجْعَلُ لَكُمْ رِزْقًا غَيْرَهُ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَدْ نَهَى عَنْ كِرَاءِ الأَرْضِ‏.‏‏","english":{"narrator":"'Eisa bin Sahl bin Rafi' bin Khadij narrated:","text":"\"I was an orphan in the care of my grandfather Rafi' bin Khadij. I reached puberty and became a man, and I performed Hajj with him. My brother 'Imran bin Sahl bin Rafi' bin Khadij came and said: 'O my father, we have leased our land to so and so (a woman) for two hundred Dirhams.' He said: 'O my son, leave that (do not do it), for Allah will give you other provision. The Messenger of Allah forbade leasing land.'\""}},{"id":72,"idInBook":72,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا الْحُسَيْنُ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِسْحَاقَ، عَنْ أَبِي عُبَيْدَةَ بْنِ مُحَمَّدٍ، عَنِ الْوَلِيدِ بْنِ أَبِي الْوَلِيدِ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، قَالَ قَالَ زَيْدُ بْنُ ثَابِتٍ يَغْفِرُ اللَّهُ لِرَافِعِ بْنِ خَدِيجٍ أَنَا وَاللَّهِ، أَعْلَمُ بِالْحَدِيثِ مِنْهُ إِنَّمَا كَانَا رَجُلَيْنِ اقْتَتَلاَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏‏\"‏‏ إِنْ كَانَ هَذَا شَأْنُكُمْ فَلاَ تُكْرُوا الْمَزَارِعَ ‏‏\"‏‏‏.‏‏ فَسَمِعَ قَوْلَهُ ‏‏\"‏‏ لاَ تُكْرُوا الْمَزَارِعَ ‏‏\"‏‏‏.‏‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ كِتَابَةُ مُزَارَعَةٍ عَلَى أَنَّ الْبَذْرَ وَالنَّفَقَةَ عَلَى صَاحِبِ الأَرْضِ وَلِلْمُزَارِعِ رُبُعُ مَا يُخْرِجُ اللَّهُ عَزَّ وَجَلَّ مِنْهَا هَذَا كِتَابٌ كَتَبَهُ فُلاَنُ بْنُ فُلاَنِ بْنِ فُلاَنٍ فِي صِحَّةٍ مِنْهُ وَجَوَازِ أَمْرٍ لِفُلاَنِ بْنِ فُلاَنٍ إِنَّكَ دَفَعْتَ إِلَىَّ جَمِيعَ أَرْضِكَ الَّتِي بِمَوْضِعِ كَذَا فى مَدِينَةِ كَذَا مُزَارَعَةً وَهِيَ الأَرْضُ الَّتِي تُعْرَفُ بِكَذَا وَتَجْمَعُهَا حُدُودٌ أَرْبَعَةٌ يُحِيطُ بِهَا كُلِّهَا وَأَحَدُ تِلْكَ الْحُدُودِ بِأَسْرِهِ لَزِيقُ كَذَا وَالثَّانِي وَالثَّالِثُ وَالرَّابِعُ دَفَعْتَ إِلَىَّ جَمِيعَ أَرْضِكَ هَذِهِ الْمَحْدُودَةِ فِي هَذَا الْكِتَابِ بِحُدُودِهَا الْمُحِيطَةِ بِهَا وَجَمِيعِ حُقُوقِهَا وَشِرْبِهَا وَأَنْهَارِهَا وَسَوَاقِيهَا أَرْضًا بَيْضَاءَ فَارِغَةً لاَ شَىْءَ فِيهَا مِنْ غَرْسٍ وَ لاَ زَرْعٍ سَنَةً تَامَّةً أَوَّلُهَا مُسْتَهَلَّ شَهْرِ كَذَا مِنْ سَنَةِ كَذَا وَآخِرُهَا انْسِلاَخُ شَهْرِ كَذَا مِنْ سَنَةِ كَذَا عَلَى أَنْ أَزْرَعَ جَمِيعَ هَذِهِ الأَرْضِ الْمَحْدُودَةِ فِي هَذَا الْكِتَابِ الْمَوْصُوفُ مَوْضِعُهَا فِيهِ هَذِهِ السَّنَةَ الْمُؤَقَّتَةَ فِيهَا مِنْ أَوَّلِهَا إِلَى آخِرِهَا كُلَّ مَا أَرَدْتُ وَبَدَا لِي أَنْ أَزْرَعَ فِيهَا مِنْ حِنْطَةٍ وَشَعِيرٍ وَسَمَاسِمَ وَأُرْزٍ وَأَقْطَانٍ وَرِطَابٍ وَبَاقِلاَّ وَحِمَّصٍ وَلُوبِيَا وَعَدَسٍ وَمَقَاثِي وَمَبَاطِيخَ وَجَزَرٍ وَشَلْجَمٍ وَفِجْلٍ وَبَصَلٍ وَثُومٍ وَبُقُولٍ وَرَيَاحِينَ وَغَيْرِ ذَلِكَ مِنْ جَمِيعِ الْغَلاَّتِ شِتَاءً وَصَيْفًا بِبُذُورِكَ وَبَذْرِكَ وَجَمِيعُهُ عَلَيْكَ دُونِي عَلَى أَنْ أَتَوَلَّى ذَلِكَ بِيَدِي وَبِمَنْ أَرَدْتُ مِنْ أَعْوَانِي وَأُجَرَائِي وَبَقَرِي وَأَدَوَاتِي وَإِلَى زِرَاعَةِ ذَلِكَ وَعِمَارَتِهِ وَالْعَمَلِ بِمَا فِيهِ نَمَاؤُهُ وَمَصْلَحَتُهُ وَكِرَابُ أَرْضِهِ وَتَنْقِيَةُ حَشِيشِهَا وَسَقْىِ مَا يُحْتَاجُ إِلَى سَقْيِهِ مِمَّا زُرِعَ وَتَسْمِيدِ مَا يُحْتَاجُ إِلَى تَسْمِيدِهِ وَحَفْرِ سَوَاقِيهِ وَأَنْهَارِهِ وَاجْتِنَاءِ مَا يُجْتَنَى مِنْهُ وَالْقِيَامِ بِحَصَادِ مَا يُحْصَدُ مِنْهُ وَجَمْعِهِ وَدِيَاسَةِ مَا يُدَاسُ مِنْهُ وَتَذْرِيَتِهِ بِنَفَقَتِكَ عَلَى ذَلِكَ كُلِّهِ دُونِي وَأَعْمَلَ فِيهِ كُلِّهِ بِيَدِي وَأَعْوَانِي دُونَكَ عَلَى أَنَّ لَكَ مِنْ جَمِيعِ مَا يُخْرِجُ اللَّهُ عَزَّ وَجَلَّ مِنْ ذَلِكَ كُلِّهِ فِي هَذِهِ الْمُدَّةِ الْمَوْصُوفَةِ فِي هَذَا الْكِتَابِ مِنْ أَوَّلِهَا إِلَى آخِرِهَا فَلَكَ ثَلاَثَةُ أَرْبَاعِهِ بِحَظِّ أَرْضِكَ وَشِرْبِكَ وَبَذْرِكَ وَنَفَقَاتِكَ وَلِيَ الرُّبُعُ الْبَاقِي مِنْ جَمِيعِ ذَلِكَ بِزِرَاعَتِي وَعَمَلِي وَقِيَامِي عَلَى ذَلِكَ بِيَدِي وَأَعْوَانِي وَدَفَعْتَ إِلَىَّ جَمِيعَ أَرْضِكَ هَذِهِ الْمَحْدُودَةِ فِي هَذَا الْكِتَابِ بِجَمِيعِ حُقُوقِهَا وَمَرَافِقِهَا وَقَبَضْتُ ذَلِكَ كُلَّهُ مِنْكَ يَوْمَ كَذَا مِنْ شَهْرِ كَذَا مِنْ سَنَةِ كَذَا فَصَارَ جَمِيعُ ذَلِكَ فِي يَدِي لَكَ لاَ مِلْكَ لِي فِي شَىْءٍ مِنْهُ وَلاَ دَعْوَى وَلاَ طَلِبَةَ إِلاَّ هَذِهِ الْمُزَارَعَةَ الْمَوْصُوفَةَ فِي هَذَا الْكِتَابِ فِي هَذِهِ السَّنَةِ الْمُسَمَّاةِ فِيهِ فَإِذَا انْقَضَتْ فَذَلِكَ كُلُّهُ مَرْدُودٌ إِلَيْكَ وَإِلَى يَدِكَ وَلَكَ أَنْ تُخْرِجَنِي بَعْدَ انْقِضَائِهَا مِنْهَا وَتُخْرِجَهَا مِنْ يَدِي وَيَدِ كُلِّ مَنْ صَارَتْ لَهُ فِيهَا يَدٌ بِسَبَبِي أَقَرَّ فُلاَنٌ وَفُلاَنٌ وَكُتِبَ هَذَا الْكِتَابُ نُسْخَتَيْنِ‏.‏‏","english":{"narrator":"It was narrated that 'Urwah bin Az-Zubair said:","text":"\"Zaid bin Thabit said: 'May Allah forgive Rafi' bin Khadij. By Allah, I have more knowledge of the Hadith than him. We were two men who fought and the Messenger of Allah said: If this is how it is between you, then do not lease land. And he only heard the words: Do not lease land.'\""}},{"id":73,"idInBook":73,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا عَمْرُو بْنُ زُرَارَةَ، قَالَ أَنْبَأَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنَا ابْنُ عَوْنٍ، قَالَ كَانَ مُحَمَّدٌ يَقُولُ الأَرْضُ عِنْدِي مِثْلُ مَالِ الْمُضَارَبَةِ فَمَا صَلُحَ فِي مَالِ الْمُضَارَبَةِ صَلُحَ فِي الأَرْضِ وَمَا لَمْ يَصْلُحْ فِي مَالِ الْمُضَارَبَةِ لَمْ يَصْلُحْ فِي الأَرْضِ‏.‏‏ قَالَ وَكَانَ لاَ يَرَى بَأْسًا أَنْ يَدْفَعَ أَرْضَهُ إِلَى الأَكَّارِ عَلَى أَنْ يَعْمَلَ فِيهَا بِنَفْسِهِ وَوَلَدِهِ وَأَعْوَانِهِ وَبَقَرِهِ وَلاَ يُنْفِقَ شَيْئًا وَتَكُونَ النَّفَقَةُ كُلُّهَا مِنْ رَبِّ الأَرْضِ‏.‏‏","english":{"narrator":"Ibn 'Awn said:","text":"\"Muhammad used to say: 'In my view land is like the wealth put into a Mudarabah (limited partnership) contract. Whatever is valid with regard to the wealth put into a Mudarabah partnership, is valid with regard to land, and whatever is not valid with regard to the wealth put into a Mudarabah partnership, then it is not valid with regard to land.'\" He said: \"He did not see anything wrong with giving all of his land to the plowman on the basis that he would work with it himself, or with his children, and helpers, and oxen, and, that he would not spend anything on it; all expenses were to be paid by the owner of the land.\""}},{"id":74,"idInBook":74,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، رضى الله عَنْهُمَا أَنَّ النَّبِيَّ صلى الله عليه وسلم دَفَعَ إِلَى يَهُودِ خَيْبَرَ نَخْلَ خَيْبَرَ وَأَرْضَهَا عَلَى أَنْ يَعْمَلُوهَا مِنْ أَمْوَالِهِمْ وَأَنَّ لِرَسُولِ اللَّهِ صلى الله عليه وسلم شَطْرَ مَا يَخْرُجُ مِنْهَا‏.‏‏","english":{"narrator":"","text":"It was narrated from Ibn 'Umar that the Prophet gave the datepalms of Khaibar and their land to the Jews of Khaibar, on condition that they would take care of them at their expense, and the Messenger of Allah would have half of whatever they produced."}},{"id":75,"idInBook":75,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ، قَالَ حَدَّثَنَا شُعَيْبُ بْنُ اللَّيْثِ، قَالَ حَدَّثَنَا أَبِي، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم دَفَعَ إِلَى يَهُودِ خَيْبَرَ نَخْلَ خَيْبَرَ وَأَرْضَهَا عَلَى أَنْ يَعْمَلُوهَا بِأَمْوَالِهِمْ وَأَنَّ لِرَسُولِ اللَّهِ صلى الله عليه وسلم شَطْرَ ثَمَرَتِهَا‏.‏‏","english":{"narrator":"","text":"It was narrated from Ibn 'Umar that the Prophet gave the datepalms of Khaibar and their land to the Jews of Khaibar on condition that they would take care of them at their expense, and the Messenger of Allah would have half of their fruits."}},{"id":76,"idInBook":76,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ، قَالَ حَدَّثَنَا شُعَيْبُ بْنُ اللَّيْثِ، عَنْ أَبِيهِ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقُولُ كَانَتِ الْمَزَارِعُ تُكْرَى عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم عَلَى أَنَّ لِرَبِّ الأَرْضِ مَا عَلَى رَبِيعِ السَّاقِي مِنَ الزَّرْعِ وَطَائِفَةً مِنَ التِّبْنِ لاَ أَدْرِي كَمْ هُوَ‏.‏‏","english":{"narrator":"It was narrated from Nafi' that 'Abdullah bin 'Umar used to say:","text":"\"Arable land used to be leased out at the time of the Messenger of Allah on condition that the owner of the land would have whatever grew on the banks of the streams and a share of straw, I do not know how much it was.\""}},{"id":77,"idInBook":77,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ أَنْبَأَنَا شَرِيكٌ، عَنْ أَبِي إِسْحَاقَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الأَسْوَدِ، قَالَ كَانَ عَمَّاىَ يَزْرَعَانِ بِالثُّلُثِ وَالرُّبُعِ وَأَبِي شَرِيكَهُمَا وَعَلْقَمَةُ وَالأَسْوَدُ يَعْلَمَانِ فَلاَ يُغَيِّرَانِ‏.‏‏","english":{"narrator":"It was narrated that 'Abdur-Rahman bin Al-Aswad said:","text":"\"Two of my paternal uncles used to cultivate (land) in return for one-third or one-quarter of the crop, and my father was their partner. 'Alqamah and Al-Aswad knew about that and did not change anything.\""}},{"id":78,"idInBook":78,"chapterId":null,"bookId":3,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا الْمُعْتَمِرُ، قَالَ سَمِعْتُ مَعْمَرًا، عَنْ عَبْدِ الْكَرِيمِ الْجَزَرِيِّ، قَالَ قَالَ سَعِيدُ بْنُ جُبَيْرٍ قَالَ ابْنُ عَبَّاسٍ إِنَّ خَيْرَ مَا أَنْتُمْ صَانِعُونَ أَنْ يُؤَاجِرَ أَحَدُكُمْ أَرْضَهُ بِالذَّهَبِ وَالْوَرِقِ‏.‏‏","english":{"narrator":"Sa'eed bin Jubair said:","text":"\"Ibn 'Abbas said: 'The best thing you can do is for one of you to rent his land out in return for gold and silver.'\""}},{"id":79,"idInBook":79,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، وَسَعِيدِ بْنِ جُبَيْرٍ، أَنَّهُمَا كَانَا لاَ يَرَيَانِ بَأْسًا بِاسْتِئْجَارِ الأَرْضِ الْبَيْضَاءِ‏.‏‏","english":{"narrator":"","text":"It was narrated from Ibrahim and Sa'eed bin Jubair that they did not see anything wrong with renting uncultivated land."}},{"id":80,"idInBook":80,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا عَمْرُو بْنُ زُرَارَةَ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، قَالَ لَمْ أَعْلَمْ شُرَيْحًا كَانَ يَقْضِي فِي الْمُضَارِبِ إِلاَّ بِقَضَاءَيْنِ كَانَ رُبَّمَا قَالَ لِلْمُضَارِبِ بَيِّنَتَكَ عَلَى مُصِيبَةٍ تُعْذَرُ بِهَا‏.‏‏ وَرُبَّمَا قَالَ لِصَاحِبِ الْمَالِ بَيِّنَتَكَ أَنَّ أَمِينَكَ خَائِنٌ وَإِلاَّ فَيَمِينُهُ بِاللَّهِ مَا خَانَكَ‏.‏‏","english":{"narrator":"It was narrated that Muhammad said:","text":"\"I do not know that Shuraih ever ruled on Mudarabah disputes except in two ways. He would say to the Mudarib (the one who contributed his labor to the partnership): 'You must provide proof that a calamity befell you so that you may be excused.' Or he would say to the one who invested his money in the partnership: 'You must provide proof that your trustee betrayed his trust, otherwise his oath sworn by Allah that he did not betray you is sufficient.'\""}},{"id":81,"idInBook":81,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ حَدَّثَنَا شَرِيكٌ، عَنْ طَارِقٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، قَالَ لاَ بَأْسَ بِإِجَارَةِ الأَرْضِ الْبَيْضَاءِ بِالذَّهَبِ وَالْفِضَّةِ‏.‏‏ وَقَالَ إِذَا دَفَعَ رَجُلٌ إِلَى رَجُلٍ مَالاً قِرَاضًا فَأَرَادَ أَنْ يَكْتُبَ عَلَيْهِ بِذَلِكَ كِتَابًا كَتَبَ هَذَا كِتَابٌ كَتَبَهُ فُلاَنُ بْنُ فُلاَنٍ طَوْعًا مِنْهُ فِي صِحَّةٍ مِنْهُ وَجَوَازِ أَمْرِهِ لِفُلاَنِ بْنِ فُلاَنٍ أَنَّكَ دَفَعْتَ إِلَىَّ مُسْتَهَلَّ شَهْرِ كَذَا مِنْ سَنَةِ كَذَا عَشْرَةَ آلاَفِ دِرْهَمٍ وُضْحًا جِيَادًا وَزْنَ سَبْعَةٍ قِرَاضًا عَلَى تَقْوَى اللَّهِ فِي السِّرِّ وَالْعَلاَنِيَةِ وَأَدَاءِ الأَمَانَةِ عَلَى أَنْ أَشْتَرِيَ بِهَا مَا شِئْتُ مِنْهَا كُلَّ مَا أَرَى أَنْ أَشْتَرِيَهُ وَأَنْ أُصَرِّفَهَا وَمَا شِئْتُ مِنْهَا فِيمَا أَرَى أَنْ أُصَرِّفَهَا فِيهِ مِنْ صُنُوفِ التِّجَارَاتِ وَأَخْرُجَ بِمَا شِئْتُ مِنْهَا حَيْثُ شِئْتُ وَأَبِيعَ مَا أَرَى أَنْ أَبِيعَهُ مِمَّا أَشْتَرِيهِ بِنَقْدٍ رَأَيْتُ أَمْ بِنَسِيئَةٍ وَبِعَيْنٍ رَأَيْتُ أَمْ بِعَرْضٍ عَلَى أَنْ أَعْمَلَ فِي جَمِيعِ ذَلِكَ كُلِّهِ بِرَأْيِي وَأُوَكِّلَ فِي ذَلِكَ مَنْ رَأَيْتُ وَكُلُّ مَا رَزَقَ اللَّهُ فِي ذَلِكَ مِنْ فَضْلٍ وَرِبْحٍ بَعْدَ رَأْسِ الْمَالِ الَّذِي دَفَعْتَهُ الْمَذْكُورِ إِلَىَّ الْمُسَمَّى مَبْلَغُهُ فِي هَذَا الْكِتَابِ فَهُوَ بَيْنِي وَبَيْنَكَ نِصْفَيْنِ لَكَ مِنْهُ النِّصْفُ بِحَظِّ رَأْسِ مَالِكَ وَلِيَ فِيهِ النِّصْفُ تَامًّا بِعَمَلِي فِيهِ وَمَا كَانَ فِيهِ مِنْ وَضِيعَةٍ فَعَلَى رَأْسِ الْمَالِ فَقَبَضْتُ مِنْكَ هَذِهِ الْعَشَرَةَ آلاَفِ دِرْهَمٍ الْوُضْحَ الْجِيَادَ مُسْتَهَلَّ شَهْرِ كَذَا فِي سَنَةِ كَذَا وَصَارَتْ لَكَ فِي يَدِي قِرَاضًا عَلَى الشُّرُوطِ الْمُشْتَرَطَةِ فِي هَذَا الْكِتَابِ أَقَرَّ فُلاَنٌ وَفُلاَنٌ وَإِذَا أَرَادَ أَنْ يُطْلِقَ لَهُ أَنْ يَشْتَرِيَ وَيَبِيعَ بِالنَّسِيئَةِ كَتَبَ وَقَدْ نَهَيْتَنِي أَنْ أَشْتَرِيَ وَأَبِيعَ بِالنَّسِيئَةِ‏.‏‏","english":{"narrator":"It was narrated that Sa'eed bin Al-Musayyab said:","text":"\"There is nothing wrong with renting uncultivated land for gold and silver.\""}},{"id":82,"idInBook":82,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ سُفْيَانَ، قَالَ حَدَّثَنِي أَبُو إِسْحَاقَ، عَنْ أَبِي عُبَيْدَةَ، عَنْ عَبْدِ اللَّهِ، قَالَ اشْتَرَكْتُ أَنَا وَعَمَّارٌ، وَسَعْدٌ، يَوْمَ بَدْرٍ فَجَاءَ سَعْدٌ بِأَسِيرَيْنِ وَلَمْ أَجِئْ أَنَا وَلاَ عَمَّارٌ بِشَىْءٍ‏.‏‏","english":{"narrator":"It was narrated that 'Abdullah said:","text":"\"I formed a partnership with 'Ammar and Sa'd on the day of Badr. Sa'd brought two prisoners but 'Ammar and I did not bring anything.\""}},{"id":83,"idInBook":83,"chapterId":null,"bookId":3,"arabic":"أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ أَنْبَأَنَا ابْنُ الْمُبَارَكِ، عَنْ يُونُسَ، عَنِ الزُّهْرِيِّ، فِي عَبْدَيْنِ مُتَفَاوِضَيْنِ كَاتَبَ أَحَدُهُمَا قَالَ جَائِزٌ إِذَا كَانَا مُتَفَاوِضَيْنِ يَقْضِي أَحَدُهُمَا عَنِ الآخَرِ‏.‏‏","english":{"narrator":"It was narrated from Az-Zuhri concerning two slaves who were partners, and one of them quit, that he said:","text":"\"One of them may cover for the other if they were partners.\""}}],"chapter":{"id":null,"bookId":3,"arabic":"كتاب المزارعة","english":"The Book of Agriculture"}}