{"metadata":{"length":77,"arabic":{"title":"مسند الإمام أحمد بن حنبل","author":"الإمام أحمد بن حنبل","introduction":"مُسْنَدُ أَبِي بَكْرٍ الصِّدِّيقِ رَضِيَ اللَّهُ عَنْهُ"},"english":{"title":"Musnad Ahmad ibn Hanbal","author":"Imam Ahmad ibn Hanbal","introduction":"Musnad Abu Bakr as-Siddiq (ra)"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، قَالَ أَخْبَرَنَا إِسْمَاعِيلُ يَعْنِي ابْنَ أَبِي خَالِدٍ، عَنْ قَيْسٍ، قَالَ قَامَ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ يَا أَيُّهَا النَّاسُ إِنَّكُمْ تَقْرَءُونَ هَذِهِ الْآيَةَ ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا عَلَيْكُمْ أَنْفُسَكُمْ لَا يَضُرُّكُمْ مَنْ ضَلَّ إِذَا اهْتَدَيْتُمْ‏}‏ وَإِنَّا سَمِعْنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ النَّاسَ إِذَا رَأَوْا الْمُنْكَرَ فَلَمْ يُنْكِرُوهُ أَوْشَكَ أَنْ يَعُمَّهُمْ اللَّهُ بِعِقَابِهِ‏.‏","english":{"narrator":"It was narrated that Qais said:","text":"Abu Bakr stood up and praised and glorified Allah, then he said: O people, you recite this verse: `O you who believe! Take care of your ownselves. If you follow the (right) guidance (and enjoin what is right (Islamic Monotheism and all that Islam orders one to do) and forbid what is wrong (polytheism, disbelief and all that Islam has forbidden)] no hurt can come to you from those who are in error` (al-Ma'idah 5:105]. We heard the Messenger of Allah (ﷺ) say: `lf the people see evil and do not change it, soon Allah will send His punishment upon them all.`"}},{"id":2,"idInBook":2,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا وَكِيعٌ، قَالَ حَدَّثَنَا مِسْعَرٌ، وَسُفْيَانُ، عَنْ عُثْمَانَ بْنِ الْمُغِيرَةِ الثَّقَفِيِّ، عَنْ عَلِيِّ بْنِ رَبِيعَةَ الْوَالِبِيِّ، عَنْ أَسْمَاءَ بْنِ الْحَكَمِ الْفَزَارِيِّ، عَنْ عَلِيٍّ، رَضِيَ اللَّهُ عَنْهُ قَالَ كُنْتُ إِذَا سَمِعْتُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدِيثًا نَفَعَنِي اللَّهُ بِمَا شَاءَ مِنْهُ وَإِذَا حَدَّثَنِي عَنْهُ غَيْرِي اسْتَحْلَفْتُهُ فَإِذَا حَلَفَ لِي صَدَّقْتُهُ وَإِنَّ أَبَا بَكْرٍ رَضِيَ اللَّهُ عَنْهُ حَدَّثَنِي وَصَدَقَ أَبُو بَكْرٍ أَنَّهُ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا مِنْ رَجُلٍ يُذْنِبُ ذَنْبًا فَيَتَوَضَّأُ فَيُحْسِنُ الْوُضُوءَ قَالَ مِسْعَرٌ وَيُصَلِّي وَقَالَ سُفْيَانُ ثُمَّ يُصَلِّي رَكْعَتَيْنِ فَيَسْتَغْفِرُ اللَّهَ عَزَّ وَجَلَّ إِلَّا غَفَرَ لَهُ‏.‏","english":{"narrator":"It was narrated that ‘Ali said:","text":"If I heard a hadeeth from the Messenger of Allah (ﷺ) Allah benefitted me as He willed thereby. If someone else told me something from him I would ask him to swear, and if he swore I would believe him. Abu Bakr told me - and Abu Bakr told the truth - that he heard the Prophet (ﷺ) say: `There is no man who commits a sin, then does wudoo' and does it well - Mis'ar said: and prays; Sufyan said: then prays - two rak'ahs and asks Allah, may He be glorified and exalted, for forgiveness but He will forgive him.`"}},{"id":3,"idInBook":3,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا عَمْرُو بْنُ مُحَمَّدٍ أَبُو سَعِيدٍ يَعْنِي الْعَنْقَزِيَّ، قَالَ حَدَّثَنَا إِسْرَائِيلُ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، قَالَ اشْتَرَى أَبُو بَكْرٍ مِنْ عَازِبٍ سَرْجًا بِثَلَاثَةَ عَشَرَ دِرْهَمًا قَالَ فَقَالَ أَبُو بَكْرٍ لِعَازِبٍ مُرْ الْبَرَاءَ فَلْيَحْمِلْهُ إِلَى مَنْزِلِي فَقَالَ لَا حَتَّى تُحَدِّثَنَا كَيْفَ صَنَعْتَ حِينَ خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنْتَ مَعَهُ قَالَ فَقَالَ أَبُو بَكْرٍ خَرَجْنَا فَأَدْلَجْنَا فَأَحْثَثْنَا يَوْمَنَا وَلَيْلَتَنَا حَتَّى أَظْهَرْنَا وَقَامَ قَائِمُ الظَّهِيرَةِ فَضَرَبْتُ بِبَصَرِي هَلْ أَرَى ظِلًّا نَأْوِي إِلَيْهِ فَإِذَا أَنَا بِصَخْرَةٍ فَأَهْوَيْتُ إِلَيْهَا فَإِذَا بَقِيَّةُ ظِلِّهَا فَسَوَّيْتُهُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَفَرَشْتُ لَهُ فَرْوَةً وَقُلْتُ اضْطَجِعْ يَا رَسُولَ اللَّهِ فَاضْطَجَعَ ثُمَّ خَرَجْتُ أَنْظُرُ هَلْ أَرَى أَحَدًا مِنْ الطَّلَبِ فَإِذَا أَنَا بِرَاعِي غَنَمٍ فَقُلْتُ لِمَنْ أَنْتَ يَا غُلَامُ فَقَالَ لِرَجُلٍ مِنْ قُرَيْشٍ فَسَمَّاهُ فَعَرَفْتُهُ فَقُلْتُ هَلْ فِي غَنَمِكَ مِنْ لَبَنٍ قَالَ نَعَمْ قَالَ قُلْتُ هَلْ أَنْتَ حَالِبٌ لِي قَالَ نَعَمْ قَالَ فَأَمَرْتُهُ فَاعْتَقَلَ شَاةً مِنْهَا ثُمَّ أَمَرْتُهُ فَنَفَضَ ضَرْعَهَا مِنْ الْغُبَارِ ثُمَّ أَمَرْتُهُ فَنَفَضَ كَفَّيْهِ مِنْ الْغُبَارِ وَمَعِي إِدَاوَةٌ عَلَى فَمِهَا خِرْقَةٌ فَحَلَبَ لِي كُثْبَةً مِنْ اللَّبَنِ فَصَبَبْتُ يَعْنِي الْمَاءَ عَلَى الْقَدَحِ حَتَّى بَرَدَ أَسْفَلُهُ ثُمَّ أَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَوَافَيْتُهُ وَقَدْ اسْتَيْقَظَ فَقُلْتُ اشْرَبْ يَا رَسُولَ اللَّهِ فَشَرِبَ حَتَّى رَضِيتُ ثُمَّ قُلْتُ هَلْ أَنَى الرَّحِيلُ قَالَ فَارْتَحَلْنَا وَالْقَوْمُ يَطْلُبُونَا فَلَمْ يُدْرِكْنَا أَحَدٌ مِنْهُمْ إِلَّا سُرَاقَةُ بْنُ مَالِكِ بْنِ جُعْشُمٍ عَلَى فَرَسٍ لَهُ فَقُلْتُ يَا رَسُولَ اللَّهِ هَذَا الطَّلَبُ قَدْ لَحِقَنَا فَقَالَ ‏{‏لَا تَحْزَنْ إِنَّ اللَّهَ مَعَنَا‏}‏ حَتَّى إِذَا دَنَا مِنَّا فَكَانَ بَيْنَنَا وَبَيْنَهُ قَدْرُ رُمْحٍ أَوْ رُمْحَيْنِ أَوْ ثَلَاثَةٍ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ هَذَا الطَّلَبُ قَدْ لَحِقَنَا وَبَكَيْتُ قَالَ لِمَ تَبْكِي قَالَ قُلْتُ أَمَا وَاللَّهِ مَا عَلَى نَفْسِي أَبْكِي وَلَكِنْ أَبْكِي عَلَيْكَ قَالَ فَدَعَا عَلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ اللَّهُمَّ اكْفِنَاهُ بِمَا شِئْتَ فَسَاخَتْ قَوَائِمُ فَرَسِهِ إِلَى بَطْنِهَا فِي أَرْضٍ صَلْدٍ وَوَثَبَ عَنْهَا وَقَالَ يَا مُحَمَّدُ قَدْ عَلِمْتُ أَنَّ هَذَا عَمَلُكَ فَادْعُ اللَّهَ أَنْ يُنْجِيَنِي مِمَّا أَنَا فِيهِ فَوَاللَّهِ لَأُعَمِّيَنَّ عَلَى مَنْ وَرَائِي مِنْ الطَّلَبِ وَهَذِهِ كِنَانَتِي فَخُذْ مِنْهَا سَهْمًا فَإِنَّكَ سَتَمُرُّ بِإِبِلِي وَغَنَمِي فِي مَوْضِعِ كَذَا وَكَذَا فَخُذْ مِنْهَا حَاجَتَكَ قَالَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا حَاجَةَ لِي فِيهَا قَالَ وَدَعَا لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأُطْلِقَ فَرَجَعَ إِلَى أَصْحَابِهِ وَمَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا مَعَهُ حَتَّى قَدِمْنَا الْمَدِينَةَ فَتَلَقَّاهُ النَّاسُ فَخَرَجُوا فِي الطَّرِيقِ وَعَلَى الْأَجَاجِيرِ فَاشْتَدَّ الْخَدَمُ وَالصِّبْيَانُ فِي الطَّرِيقِ يَقُولُونَ اللَّهُ أَكْبَرُ جَاءَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَاءَ مُحَمَّدٌ قَالَ وَتَنَازَعَ الْقَوْمُ أَيُّهُمْ يَنْزِلُ عَلَيْهِ قَالَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْزِلُ اللَّيْلَةَ عَلَى بَنِي النَّجَّارِ أَخْوَالِ عَبْدِ الْمُطَّلِبِ لِأُكْرِمَهُمْ بِذَلِكَ فَلَمَّا أَصْبَحَ غَدَا حَيْثُ أُمِرَ قَالَ الْبَرَاءُ بْنُ عَازِبٍ أَوَّلُ مَنْ كَانَ قَدِمَ عَلَيْنَا مِنْ الْمُهَاجِرِينَ مُصْعَبُ بْنُ عُمَيْرٍ أَخُو بَنِي عَبْدِ الدَّارِ ثُمَّ قَدِمَ عَلَيْنَا ابْنُ أُمِّ مَكْتُومٍ الْأَعْمَى أَخُو بَنِي فِهْرٍ ثُمَّ قَدِمَ عَلَيْنَا عُمَرُ بْنُ الْخَطَّابِ فِي عِشْرِينَ رَاكِبًا فَقُلْنَا مَا فَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ هُوَ عَلَى أَثَرِي ثُمَّ قَدِمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبُو بَكْرٍ مَعَهُ قَالَ الْبَرَاءُ وَلَمْ يَقْدَمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى حَفِظْتُ سُوَرًا مِنْ الْمُفَصَّلِ قَالَ إِسْرَائِيلُ وَكَانَ الْبَرَاءُ مِنْ الْأَنْصَارِ مِنْ بَنِي حَارِثَةَ‏.‏","english":{"narrator":"It was narrated that al-Bara' bin 'Azib said:","text":"Abu Bakr bought a saddle from ‘Azib for thirteen dirhams, then Abu Bakr said to 'Azib. Tell al-Bara to carry it to my house. He said: No, not until you tell us what happened when the Messenger of Allah (ﷺ) went out and you were with him. Abu Bakr said: We started our journey at the beginning of the night and we hastened for one day and one night, until it was midday. I looked into the distance to see whether there was anywhere to seek shade, and I saw a rock, so I went to it and it had a little shade. I smoothed the ground for the Messenger of Allah (ﷺ) and spread a garment of camel hair for him, and said: Lie down and rest, O Messenger of Allah. So he lay down, and I went out to see if I could spot anyone looking for us. Then I saw a shepherd and I said: Who do you belong to, O boy? He said: To a man of Quraish. He mentioned his name and I recognised it. I said: Is there any milk in your sheep? He said: Yes | said: Will you milk some for me? He said: Yes. I told him to do that, so he caught a sheep, then I told him to brush the dust from its teat, then to brush the dust off his hands. I had a small vessel with me on the neck of which was a cloth. He milked a little bit of milk for me and I poured it into the vessel until it cooled down. Then I came to the Messenger of Allah (ﷺ). When I reached him, he had already woken up. I said: Drink, O Messenger of Allah. He drank until I was pleased, then I said: Is it time to move on? So we moved on and the people were coming after us but none of them caught up with us except Suraqah bin Malik bin Ju'shum, who was riding a horse of his, I said: O Messenger of Allah, someone has caught up with us. He said: `Do not be afraid, for Allah is with us.` When he got close to us, and there was no more between us and him then the length of a spear or two or three spears, I said: O Messenger of Allah, this pursuer has caught up with us, and I wept. He said: `Why are you weeping?` I said: I am not weeping for myself; rather I am weeping for you. The Messenger of Allah (ﷺ) prayed against him . Isra'eel said: al-Bara' was one of the Ansar from Banu Harithah."}},{"id":4,"idInBook":4,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا وَكِيعٌ، قَالَ قَالَ إِسْرَائِيلُ قَالَ أَبُو إِسْحَاقَ عَنْ زَيْدِ بْنِ يُثَيْعٍ، عَنْ أَبِي بَكْرٍ، أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَهُ بِبَرَاءَةٌ لِأَهْلِ مَكَّةَ لَا يَحُجُّ بَعْدَ الْعَامِ مُشْرِكٌ وَلَا يَطُوفُ بِالْبَيْتِ عُرْيَانٌ وَلَا يَدْخُلُ الْجَنَّةَ إِلَّا نَفْسٌ مُسْلِمَةٌ مَنْ كَانَ بَيْنَهُ وَبَيْنَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُدَّةٌ فَأَجَلُهُ إِلَى مُدَّتِهِ وَاللَّهُ بَرِيءٌ مِنْ الْمُشْرِكِينَ وَرَسُولُهُ قَالَ فَسَارَ بِهَا ثَلَاثًا ثُمَّ قَالَ لِعَلِيٍّ رَضِيَ اللَّهُ تَعَالَى عَنْهُ الْحَقْهُ فَرُدَّ عَلَيَّ أَبَا بَكْرٍ وَبَلِّغْهَا أَنْتَ قَالَ فَفَعَلَ قَالَ فَلَمَّا قَدِمَ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَبُو بَكْرٍ بَكَى قَالَ يَا رَسُولَ اللَّهِ حَدَثَ فِيَّ شَيْءٌ قَالَ مَا حَدَثَ فِيكَ إِلَّا خَيْرٌ وَلَكِنْ أُمِرْتُ أَنْ لَا يُبَلِّغَهُ إِلَّا أَنَا أَوْ رَجُلٌ مِنِّي‏.‏","english":{"narrator":"It was narrated from Abu Bakr:","text":"that the Prophet (ﷺ) sent him with Soorat Bara'ah (at-Taubah) to the people of Makkah, to say that no mushrik should perform Hajj after this year and no one should circumambulate the Ka'bah naked, and no one would enter Paradise except a Muslim, whoever had a covenant with the Messenger of Allah (ﷺ) for a specific time, it would last until the stated time, and Allah is free from (all) obligations to the Mushrikoon and so is His Messenger (cf. 9:3). He went around doing that for three days, then [the Prophet (ﷺ) said to ‘Ali; “Go and catch up with him; send Abu Bakr back to me and you convey it.” So he did that. And when Abu Bakr carme to the Prophet (ﷺ) , he wept and said: O Messenger of Allah, is there something the matter with me? He said: `There is nothing but good, but I was instructed that no one should convey it except me or a man from my family.”"}},{"id":5,"idInBook":5,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ يَزِيدَ بْنِ خُمَيْرٍ، عَنْ سُلَيْمِ بْنِ عَامِرٍ، عَنْ أَوْسَطَ، قَالَ خَطَبَنَا أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ فَقَالَ قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَقَامِي هَذَا عَامَ الْأَوَّلِ وَبَكَى أَبُو بَكْرٍ فَقَالَ أَبُو بَكْرٍ سَلُوا اللَّهَ الْمُعَافَاةَ أَوْ قَالَ الْعَافِيَةَ فَلَمْ يُؤْتَ أَحَدٌ قَطُّ بَعْدَ الْيَقِينِ أَفْضَلَ مِنْ الْعَافِيَةِ أَوْ الْمُعَافَاةِ عَلَيْكُمْ بِالصِّدْقِ فَإِنَّهُ مَعَ الْبِرِّ وَهُمَا فِي الْجَنَّةِ وَإِيَّاكُمْ وَالْكَذِبَ فَإِنَّهُ مَعَ الْفُجُورِ وَهُمَا فِي النَّارِ وَلَا تَحَاسَدُوا وَلَا تَبَاغَضُوا وَلَا تَقَاطَعُوا وَلَا تَدَابَرُوا وَكُونُوا إِخْوَانًا كَمَا أَمَرَكُمْ اللَّهُ تَعَالَى‏.‏","english":{"narrator":"It was narrated that Awsat said:","text":"Abu Bakr addressed us and said: The Messenger of Allah (ﷺ) stood last year where I am standing. Abu Bakr wept, then he said: Ask Allah to keep you safe and sound, for no one is given anything better, after certainly of faith, than well-being. And you should be truthful, for that goes with righteousness and they lead to Paradise. And beware of lying, for that goes with immorality and they lead to Hell. Do not envy one another, do not bear grudges against one another, do not sever ties with one another, do not turn away from one another; be brothers as Allah has commanded you.”"}},{"id":6,"idInBook":6,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، وَأَبُو عَامِرٍ قَالَا حَدَّثَنَا زُهَيْرٌ يَعْنِي ابْنَ مُحَمَّدٍ، عَنْ عَبْدِ اللَّهِ يَعْنِي ابْنَ مُحَمَّدِ بْنِ عَقِيلٍ، عَنْ مُعَاذِ بْنِ رِفَاعَةَ بْنِ رَافِعٍ الْأَنْصَارِيِّ، عَنْ أَبِيهِ، رِفَاعَةَ بْنِ رَافِعٍ قَالَ سَمِعْتُ أَبَا بَكْرٍ الصِّدِّيقَ، رَضِيَ اللَّهُ عَنْهُ يَقُولُ عَلَى مِنْبَرِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فَبَكَى أَبُو بَكْرٍ حِينَ ذَكَرَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ سُرِّيَ عَنْهُ ثُمَّ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي هَذَا الْقَيْظِ عَامَ الْأَوَّلِ سَلُوا اللَّهَ الْعَفْوَ وَالْعَافِيَةَ وَالْيَقِينَ فِي الْآخِرَةِ وَالْأُولَى‏.‏","english":{"narrator":"Rifa'ah bin Rafi' said:","text":"I heard Abu Bakr as-Siddeeq say on the minbar of the Messenger of Allah (ﷺ) : I heard the Messenger of Allah (ﷺ) say, and Abu Bakr wept when he remembered the Messenger of Allah (ﷺ) , then he recovered and said. I heard the Messenger of Allah (ﷺ) say, in this hot weather last year: `Ask Allah for forgiveness, well-being and certainty of faith in the Hereafter and in this world.”"}},{"id":7,"idInBook":7,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا أَبُو كَامِلٍ، قَالَ حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ سَلَمَةَ، عَنِ ابْنِ أَبِي عَتِيقٍ، عَنْ أَبِيهِ، عَنْ أَبِي بَكْرٍ الصِّدِّيقِ، رَضِيَ اللَّهُ عَنْهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ السِّوَاكُ مَطْهَرَةٌ لِلْفَمِ مَرْضَاةٌ لِلرَّبِّ‏.‏","english":{"narrator":"It was narrated from Abu Bakr that the prophet (ﷺ) said:","text":"`The siwak is cleansing to the mouth and pleasing to the Lord`"}},{"id":8,"idInBook":8,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ، قَالَ حَدَّثَنَا اللَّيْثُ، قَالَ حَدَّثَنِي يَزِيدُ بْنُ أَبِي حَبِيبٍ، عَنْ أَبِي الْخَيْرِ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، عَنْ أَبِي بَكْرٍ الصِّدِّيقِ، أَنَّهُ قَالَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلِّمْنِي دُعَاءً أَدْعُو بِهِ فِي صَلَاتِي قَالَ قُلْ اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْمًا كَثِيرًا وَلَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ وَارْحَمْنِي إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ و قَالَ يُونُسُ كَبِيرًا حَدَّثَنَاه حَسَنٌ الْأَشْيَبُ عَنْ ابْنِ لَهِيعَةَ قَالَ قَالَ كَبِيرًا‏.‏","english":{"narrator":"It was narrated from Abu Bakr as Siddeeq that he said to the Messenger of Allah (ﷺ) :","text":"Teach me a dua that I may say in my prayer. He said: `Say: O Allah, I have wronged myself greatly and no one forgives sins but you, grant me forgiveness from you and have mercy on me for you are the Oft Forgiving Most Merciful"}},{"id":9,"idInBook":9,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَ حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، رَضِيَ اللَّهُ عَنْهَا أَنَّ فَاطِمَةَ، وَالْعَبَّاسَ أَتَيَا أَبَا بَكْرٍ رَضِيَ اللَّهُ عَنْهُ يَلْتَمِسَانِ مِيرَاثَهُمَا مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُمَا حِينَئِذٍ يَطْلُبَانِ أَرْضَهُ مِنْ فَدَكَ وَسَهْمَهُ مِنْ خَيْبَرَ فَقَالَ لَهُمْ أَبُو بَكْرٍ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا نُورَثُ مَا تَرَكْنَا صَدَقَةٌ إِنَّمَا يَأْكُلُ آلُ مُحَمَّدٍ فِي هَذَا الْمَالِ وَإِنِّي وَاللَّهِ لَا أَدَعُ أَمْرًا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصْنَعُهُ فِيهِ إِلَّا صَنَعْتُهُ‏.‏","english":{"narrator":"It was narrated from 'A'ishah at Fatimah and al-'Abbas came to Abu Bakr seeking their inheritance from the Messenger of Allah (ﷺ). At that time they were asking for his land at Fadak and his share of Khaibar. Abu Bakr said to them:","text":"I heard the Messenger Allah (ﷺ) say: `Our (Prophets property is not to be inherited and whatever we leave behind is charity. Rather the family of Muhammad may take their provision from these properties.” By Allah, I will not change any of the charity of the Messenger of Allah (ﷺ) from how it was at the time of the Messenger of Allah (ﷺ) and I will do the same with it as the Messenger of Allah (ﷺ) did."}},{"id":10,"idInBook":10,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا أَبُو عَبْدِ الرَّحْمَنِ الْمُقْرِئُ، قَالَ حَدَّثَنَا حَيْوَةُ بْنُ شُرَيْحٍ، قَالَ سَمِعْتُ عَبْدَ الْمَلِكِ بْنَ الْحَارِثِ، يَقُولُ إِنَّ أَبَا هُرَيْرَةَ قَالَ سَمِعْتُ أَبَا بَكْرٍ الصِّدِّيقَ، رَضِيَ اللَّهُ عَنْهُ عَلَى هَذَا الْمِنْبَرِ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي هَذَا الْيَوْمِ مِنْ عَامِ الْأَوَّلِ ثُمَّ اسْتَعْبَرَ أَبُو بَكْرٍ وَبَكَى ثُمَّ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَمْ تُؤْتَوْا شَيْئًا بَعْدَ كَلِمَةِ الْإِخْلَاصِ مِثْلَ الْعَافِيَةِ فَاسْأَلُوا اللَّهَ الْعَافِيَةَ‏.‏","english":{"narrator":"Abu Hurairah said:","text":"I heard Abu Bakr as-Siddeeq on this minbar saying: I heard the Messenger of Allah (ﷺ) on this day last year-then Abu Bakr wept, then he said: I heard the Messenger of Allah (ﷺ) say: `You will not be given anything, after the word of sincerity (i.e., the Shahadah), like well-being, so ask Allah for well-being.”"}},{"id":11,"idInBook":11,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا عَفَّانُ، قَالَ حَدَّثَنَا هَمَّامٌ، قَالَ أَخْبَرَنَا ثَابِتٌ، عَنْ أَنَسٍ، أَنَّ أَبَا بَكْرٍ، حَدَّثَهُ قَالَ قُلْتُ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ فِي الْغَارِ وَقَالَ مَرَّةً وَنَحْنُ فِي الْغَارِ لَوْ أَنَّ أَحَدَهُمْ نَظَرَ إِلَى قَدَمَيْهِ لَأَبْصَرَنَا تَحْتَ قَدَمَيْهِ قَالَ فَقَالَ يَا أَبَا بَكْرٍ مَا ظَنُّكَ بِاثْنَيْنِ اللَّهُ ثَالِثُهُمَا‏.‏","english":{"narrator":"It was narrated from Anas that Abu Bakr told him:","text":"I said to the Prophet (ﷺ) when he was in the cave - on one occasion he said: when we were in the cave -: If one of them looks at his feet, he will see us beneath his feet.\nHe said: `O Abu Bakr, what do you think of two, of whom Allah is the third?`"}},{"id":12,"idInBook":12,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا رَوْحٌ، قَالَ حَدَّثَنَا ابْنُ أَبِي عَرُوبَةَ، عَنْ أَبِي التَّيَّاحِ، عَنِ الْمُغِيرَةِ بْنِ سُبَيْعٍ، عَنْ عَمْرِو بْنِ حُرَيْثٍ، عَنْ أَبِي بَكْرٍ الصِّدِّيقِ، قَالَ حَدَّثَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ الدَّجَّالَ يَخْرُجُ مِنْ أَرْضٍ بِالْمَشْرِقِ يُقَالُ لَهَا خُرَاسَانُ يَتَّبِعُهُ أَقْوَامٌ كَأَنَّ وُجُوهَهُمْ الْمَجَانُّ الْمُطْرَقَةُ‏.‏","english":{"narrator":"It was narrated that Abu Bakr as-Siddeeq said:","text":"The Messenger of Allah (ﷺ) said: `The Dajjal will emerge from a land in the east called Khurasan and he will be followed by peoples whose faces are like hammered shields.`"}},{"id":13,"idInBook":13,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا أَبُو سَعِيدٍ، مَوْلَى بَنِي هَاشِمٍ قَالَ حَدَّثَنَا صَدَقَةُ بْنُ مُوسَى، صَاحِبُ الدَّقِيقِ عَنْ فَرْقَدٍ، عَنْ مُرَّةَ بْنِ شَرَاحِيلَ، عَنْ أَبِي بَكْرٍ الصِّدِّيقِ، رَضِيَ اللَّهُ عَنْهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَدْخُلُ الْجَنَّةَ بَخِيلٌ وَلَا خَبٌّ وَلَا خَائِنٌ وَلَا سَيِّئُ الْمَلَكَةِ وَأَوَّلُ مَنْ يَقْرَعُ بَابَ الْجَنَّةِ الْمَمْلُوكُونَ إِذَا أَحْسَنُوا فِيمَا بَيْنَهُمْ وَبَيْنَ اللَّهِ عَزَّ وَجَلَّ وَفِيمَا بَيْنَهُمْ وَبَيْنَ مَوَالِيهِمْ‏.‏","english":{"narrator":"It was narrated thal Abu Bakr as-Siddeeq said:","text":"The Messenger of Allah (ﷺ) said: `No miser, cheater, traitor or person who mistreats his slaves will enter Paradise. The first to knock at the gates of Paradise will be the slaves, if they fulfil their duties towards Allah and towards their masters properly.”"}},{"id":14,"idInBook":14,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَبِي شَيْبَةَ، قَالَ عَبْد اللَّهِ وَسَمِعْتُهُ مِنْ عَبْدِ اللَّهِ بْنِ أَبِي شَيْبَةَ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، عَنِ الْوَلِيدِ بْنِ جُمَيْعٍ، عَنْ أَبِي الطُّفَيْلِ، قَالَ لَمَّا قُبِضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْسَلَتْ فَاطِمَةُ إِلَى أَبِي بَكْرٍ أَنْتَ وَرِثْتَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمْ أَهْلُهُ قَالَ فَقَالَ لَا بَلْ أَهْلُهُ قَالَتْ فَأَيْنَ سَهْمُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَقَالَ أَبُو بَكْرٍ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ اللَّهَ عَزَّ وَجَلَّ إِذَا أَطْعَمَ نَبِيًّا طُعْمَةً ثُمَّ قَبَضَهُ جَعَلَهُ لِلَّذِي يَقُومُ مِنْ بَعْدِهِ فَرَأَيْتُ أَنْ أَرُدَّهُ عَلَى الْمُسْلِمِينَ فَقَالَتْ فَأَنْتَ وَمَا سَمِعْتَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْلَمُ‏.‏","english":{"narrator":"It was narrated that Abu Tufail said:","text":"When the Messenger of Allah (ﷺ) died, Fatimah sent word to Abu Bakr saying: Are you the heir of the Messenger of Allah (ﷺ) or are his family? He said: No, rather his family (are his heirs). She said: Where is the share of the Messenger of Allah (ﷺ)? Abu Bakr said: I heard the Messenger of Allah (ﷺ) say: `If Allah grants some wealth to a Prophet, then takes his soul. He grants it to the one who took charge after him.` So I have decided to give the benefit of it to the Muslims. She said: That is fine, and you know best what you heard from the Messenger of Allah (ﷺ). Muhaqalah"}},{"id":15,"idInBook":15,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ إِسْحَاقَ الطَّالَقَانِيُّ، قَالَ حَدَّثَنِي النَّضْرُ بْنُ شُمَيْلٍ الْمَازِنِيُّ، قَالَ حَدَّثَنِي أَبُو نَعَامَةَ، قَالَ حَدَّثَنِي أَبُو هُنَيْدَةَ الْبَرَاءُ بْنُ نَوْفَلٍ، عَنْ وَالَانَ الْعَدَوِيِّ، عَنْ حُذَيْفَةَ، عَنْ أَبِي بَكْرٍ الصِّدِّيقِ، رَضِيَ اللَّهُ عَنْهُ قَالَ أَصْبَحَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ يَوْمٍ فَصَلَّى الْغَدَاةَ ثُمَّ جَلَسَ حَتَّى إِذَا كَانَ مِنْ الضُّحَى ضَحِكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ جَلَسَ مَكَانَهُ حَتَّى صَلَّى الْأُولَى وَالْعَصْرَ وَالْمَغْرِبَ كُلُّ ذَلِكَ لَا يَتَكَلَّمُ حَتَّى صَلَّى الْعِشَاءَ الْآخِرَةَ ثُمَّ قَامَ إِلَى أَهْلِهِ فَقَالَ النَّاسُ لِأَبِي بَكْرٍ أَلَا تَسْأَلُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا شَأْنُهُ صَنَعَ الْيَوْمَ شَيْئًا لَمْ يَصْنَعْهُ قَطُّ قَالَ فَسَأَلَهُ فَقَالَ نَعَمْ عُرِضَ عَلَيَّ مَا هُوَ كَائِنٌ مِنْ أَمْرِ الدُّنْيَا وَأَمْرِ الْآخِرَةِ فَجُمِعَ الْأَوَّلُونَ وَالْآخِرُونَ بِصَعِيدٍ وَاحِدٍ فَفَظِعَ النَّاسُ بِذَلِكَ حَتَّى انْطَلَقُوا إِلَى آدَمَ عَلَيْهِ السَّلَام وَالْعَرَقُ يَكَادُ يُلْجِمُهُمْ فَقَالُوا يَا آدَمُ أَنْتَ أَبُو الْبَشَرِ وَأَنْتَ اصْطَفَاكَ اللَّهُ عَزَّ وَجَلَّ اشْفَعْ لَنَا إِلَى رَبِّكَ قَالَ لَقَدْ لَقِيتُ مِثْلَ الَّذِي لَقِيتُمْ انْطَلِقُوا إِلَى أَبِيكُمْ بَعْدَ أَبِيكُمْ إِلَى نُوحٍ إِنَّ اللَّهَ اصْطَفَى آدَمَ وَنُوحًا وَآلَ إِبْرَاهِيمَ وَآلَ عِمْرَانَ عَلَى الْعَالَمِينَ قَالَ فَيَنْطَلِقُونَ إِلَى نُوحٍ عَلَيْهِ السَّلَام فَيَقُولُونَ اشْفَعْ لَنَا إِلَى رَبِّكَ فَأَنْتَ اصْطَفَاكَ اللَّهُ وَاسْتَجَابَ لَكَ فِي دُعَائِكَ وَلَمْ يَدَعْ عَلَى الْأَرْضِ مِنْ الْكَافِرِينَ دَيَّارًا فَيَقُولُ لَيْسَ ذَاكُمْ عِنْدِي انْطَلِقُوا إِلَى إِبْرَاهِيمَ عَلَيْهِ السَّلَام فَإِنَّ اللَّهَ عَزَّ وَجَلَّ اتَّخَذَهُ خَلِيلًا فَيَنْطَلِقُونَ إِلَى إِبْرَاهِيمَ فَيَقُولُ لَيْسَ ذَاكُمْ عِنْدِي وَلَكِنْ انْطَلِقُوا إِلَى مُوسَى عَلَيْهِ السَّلَام فَإِنَّ اللَّهَ عَزَّ وَجَلَّ كَلَّمَهُ تَكْلِيمًا فَيَقُولُ مُوسَى عَلَيْهِ السَّلَام لَيْسَ ذَاكُمْ عِنْدِي وَلَكِنْ انْطَلِقُوا إِلَى عِيسَى ابْنِ مَرْيَمَ فَإِنَّهُ يُبْرِئُ الْأَكْمَهَ وَالْأَبْرَصَ وَيُحْيِي الْمَوْتَى فَيَقُولُ عِيسَى لَيْسَ ذَاكُمْ عِنْدِي وَلَكِنْ انْطَلِقُوا إِلَى سَيِّدِ وَلَدِ آدَمَ فَإِنَّهُ أَوَّلُ مَنْ تَنْشَقُّ عَنْهُ الْأَرْضُ يَوْمَ الْقِيَامَةِ انْطَلِقُوا إِلَى مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَيَشْفَعَ لَكُمْ إِلَى رَبِّكُمْ عَزَّ وَجَلَّ قَالَ فَيَنْطَلِقُ فَيَأْتِي جِبْرِيلُ عَلَيْهِ السَّلَام رَبَّهُ فَيَقُولُ اللَّهُ عَزَّ وَجَلَّ ائْذَنْ لَهُ وَبَشِّرْهُ بِالْجَنَّةِ قَالَ فَيَنْطَلِقُ بِهِ جِبْرِيلُ فَيَخِرُّ سَاجِدًا قَدْرَ جُمُعَةٍ وَيَقُولُ اللَّهُ عَزَّ وَجَلَّ ارْفَعْ رَأْسَكَ يَا مُحَمَّدُ وَقُلْ يُسْمَعْ وَاشْفَعْ تُشَفَّعْ قَالَ فَيَرْفَعُ رَأْسَهُ فَإِذَا نَظَرَ إِلَى رَبِّهِ عَزَّ وَجَلَّ خَرَّ سَاجِدًا قَدْرَ جُمُعَةٍ أُخْرَى فَيَقُولُ اللَّهُ عَزَّ وَجَلَّ ارْفَعْ رَأْسَكَ وَقُلْ يُسْمَعْ وَاشْفَعْ تُشَفَّعْ قَالَ فَيَذْهَبُ لِيَقَعَ سَاجِدًا فَيَأْخُذُ جِبْرِيلُ عَلَيْهِ السَّلَام بِضَبْعَيْهِ فَيَفْتَحُ اللَّهُ عَزَّ وَجَلَّ عَلَيْهِ مِنْ الدُّعَاءِ شَيْئًا لَمْ يَفْتَحْهُ عَلَى بَشَرٍ قَطُّ فَيَقُولُ أَيْ رَبِّ خَلَقْتَنِي سَيِّدَ وَلَدِ آدَمَ وَلَا فَخْرَ وَأَوَّلَ مَنْ تَنْشَقُّ عَنْهُ الْأَرْضُ يَوْمَ الْقِيَامَةِ وَلَا فَخْرَ حَتَّى إِنَّهُ لَيَرِدُ عَلَيَّ الْحَوْضَ أَكْثَرُ مِمَّا بَيْنَ صَنْعَاءَ وَأَيْلَةَ ثُمَّ يُقَالُ ادْعُوا الصِّدِّيقِينَ فَيَشْفَعُونَ ثُمَّ يُقَالُ ادْعُوا الْأَنْبِيَاءَ قَالَ فَيَجِيءُ النَّبِيُّ وَمَعَهُ الْعِصَابَةُ وَالنَّبِيُّ وَمَعَهُ الْخَمْسَةُ وَالسِّتَّةُ وَالنَّبِيُّ وَلَيْسَ مَعَهُ أَحَدٌ ثُمَّ يُقَالُ ادْعُوا الشُّهَدَاءَ فَيَشْفَعُونَ لِمَنْ أَرَادُوا وَقَالَ فَإِذَا فَعَلَتْ الشُّهَدَاءُ ذَلِكَ قَالَ يَقُولُ اللَّهُ عَزَّ وَجَلَّ أَنَا أَرْحَمُ الرَّاحِمِينَ أَدْخِلُوا جَنَّتِي مَنْ كَانَ لَا يُشْرِكُ بِي شَيْئًا قَالَ فَيَدْخُلُونَ الْجَنَّةَ قَالَ ثُمَّ يَقُولُ اللَّهُ عَزَّ وَجَلَّ انْظُرُوا فِي النَّارِ هَلْ تَلْقَوْنَ مِنْ أَحَدٍ عَمِلَ خَيْرًا قَطُّ قَالَ فَيَجِدُونَ فِي النَّارِ رَجُلًا فَيَقُولُ لَهُ هَلْ عَمِلْتَ خَيْرًا قَطُّ فَيَقُولُ لَا غَيْرَ أَنِّي كُنْتُ أُسَامِحُ النَّاسَ فِي الْبَيْعِ وَالشِّرَاءِ فَيَقُولُ اللَّهُ عَزَّ وَجَلَّ أَسْمِحُوا لِعَبْدِي كَإِسْمَاحِهِ إِلَى عَبِيدِي ثُمَّ يُخْرِجُونَ مِنْ النَّارِ رَجُلًا فَيَقُولُ لَهُ هَلْ عَمِلْتَ خَيْرًا قَطُّ فَيَقُولُ لَا غَيْرَ أَنِّي قَدْ أَمَرْتُ وَلَدِي إِذَا مِتُّ فَأَحْرِقُونِي بِالنَّارِ ثُمَّ اطْحَنُونِي حَتَّى إِذَا كُنْتُ مِثْلَ الْكُحْلِ فَاذْهَبُوا بِي إِلَى الْبَحْرِ فَاذْرُونِي فِي الرِّيحِ فَوَاللَّهِ لَا يَقْدِرُ عَلَيَّ رَبُّ الْعَالَمِينَ أَبَدًا فَقَالَ اللَّهُ عَزَّ وَجَلَّ لِمَ فَعَلْتَ ذَلِكَ قَالَ مِنْ مَخَافَتِكَ قَالَ فَيَقُولُ اللَّهُ عَزَّ وَجَلَّ انْظُرْ إِلَى مُلْكِ أَعْظَمِ مَلِكٍ فَإِنَّ لَكَ مِثْلَهُ وَعَشَرَةَ أَمْثَالِهِ قَالَ فَيَقُولُ لِمَ تَسْخَرُ بِي وَأَنْتَ الْمَلِكُ قَالَ وَذَاكَ الَّذِي ضَحِكْتُ مِنْهُ مِنْ الضُّحَى‏.‏","english":{"narrator":"It was narrated that Abu Bakr as-Siddeeq said:","text":"One day the Messenger of Allah (ﷺ) got up and prayed Fajr, then he sat until the forenoon, then the Messenger of Allah (ﷺ) smiled. Then he sat where he was until he had prayed Zuhr, 'Asr and Maghrib, and he did not speak until he had prayed 'isha'. Then he got up and went to his family. The people said to Abu Bakr: Why don't you ask the Messenger of Allah (ﷺ) what is the matter? He did something today that he never did before. So he asked him and he said: `Yes, I was shown what is to come of this world and the Hereafter. The earlier and later generations were gathered in one place and the people got terrified because of that. They went to Adam when the sweat was about to reach their mouths, and they said: O Adam, you are the father of mankind and Allah, may He be glorified and exalted, chose you. Intercede for us with your Lord, He said: I am in the same position as you. Go to your father after your father, to Nooh, “Allah chose Adam, Nooh (Noah), the family of Ibraheem (Abraham) and the family of 'Imran above the 'Alameen (mankind and jinn) (of their times)` (Al 'Imran 3:33}.\n\nThen they will go to Nooh and will say: Intercede with your Lord for us, for Allah chose you and answered your supplication, and He did not leave one of the disbelievers on the Earth (cf. 71:26). He will say: I am not the one you want; go to Ibraheem for Allah, may He be glorified and exalted, took him as a close friend (khaleel). So they will go to Ibraheem but he will say: I am not the one you want; go to Moosa, for Allah, may He be glorified and exalted, spoke directly to him (cf. 4:164). But Moosa will say: I am not the one you want; go to 'Eesa Ibn Maryam, for he healed those born blind and the lepers, and he brought forth the dead. But 'Eesa will say: I am not the one you want; go to the leader of the sons of Adam, for he is the first one for whom the earth is split on the Day of Resurrection. Go to Muhammad, for he will intercede for you with your Lord, may He be glorified and exalted. Then (the Prophet) will go and Jibreel will come to his Lord and Allah, may He be glorified and exalted, will say: Give him permission and give him the glad tidings of Paradise. Jibreel will take him and he will fall down in prostration for a week. Allah, may He be glorified and exalted, will say: Raise your head, O Muhammad; speak and you will be heard, intercede and your intercession will be accepted. So he will raise his head, and when he looks at his Lord, may He be glorified and exalted, he will fall down in prostration for another week. Allah, may He be glorified and exalted, will say: Raise your head, O Muhammad; speak and you will be heard, intercede and your intersession will be accepted. He will start to fall down in prostration again, but Jibreel (peace be upon him) will take hold of his upper arms and Allah, may he be glorified and exalted, will inspire him to offer a supplication such as no human being was ever inspired with. He will say: `O Lord, You created me as the leader of the sons of Adam, and no boast; the first one for whom the earth is split on the Day of Resurrection, and no boast; there will come to my Cistern more people than there can be between San‘a’ and Allah (Eilat).` Then it will be said: Call the Siddeeq's so that they might intercede. Then it will be said: Call the Prophets. So one Prophet will come with a group, and another Prophet will come with five or six people, and another Prophet will come with nobody. Then it will be said: Call the martyrs so that they might intercede for whoever they want. When the martyrs do that, Allah, may He be glorified and exalted, will say: I am the Most Merciful of those who show mercy; I admit to My Paradise anyone who does not associate anything with Me.\n\nSo they will enter Paradise. Then Allah, may He be glorified and exalted, will say: Look in Hell; can you find anyone who ever did anything good? And they will find a man in Hell, and He will say to him: Did you ever do anything good? He will say: No, except that I was easy-going with people in buying and selling. And Allah, may He be glorified and exalted, will say: Be easy-going with My slave as he was easygoing with My slaves. Then they will bring a man out of Hell and He will say to him: Did you ever do anything good? He will say: No, except that l instructed my sons: When I die, burn me with fire, then grind me until I am like kohl powder. Then take me to the sea and scatter me in the wind, for by Allah the Lord of the Worlds will never be able to punish me. Allah, may He be glorified and exalted, will say: Why did you do that? He will say: For fear of You. And Allah, may He be glorified and exalted, will say: Look at the kingdom of the greatest king and you will have the like thereof and ten times as much. He will say: Are You making fun of me when You are the Sovereign? He (the Prophet (ﷺ) said: “That is what I was smiling at, at the time of the foremoon.`"}},{"id":16,"idInBook":16,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ، قَالَ حَدَّثَنَا زُهَيْرٌ يَعْنِي ابْنَ مُعَاوِيَةَ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي خَالِدٍ، قَالَ حَدَّثَنَا قَيْسٌ، قَالَ قَامَ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ فَحَمِدَ اللَّهَ عَزَّ وَجَلَّ وَأَثْنَى عَلَيْهِ فَقَالَ يَا أَيُّهَا النَّاسُ إِنَّكُمْ تَقْرَءُونَ هَذِهِ الْآيَةَ ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا عَلَيْكُمْ أَنْفُسَكُمْ لَا يَضُرُّكُمْ مَنْ ضَلَّ إِذَا اهْتَدَيْتُمْ‏}‏ إِلَى آخِرِ الْآيَةِ وَإِنَّكُمْ تَضَعُونَهَا عَلَى غَيْرِ مَوْضِعِهَا وَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ النَّاسَ إِذَا رَأَوْا الْمُنْكَرَ وَلَا يُغَيِّرُوهُ أَوْشَكَ اللَّهُ أَنْ يَعُمَّهُمْ بِعِقَابِهِ قَالَ وَسَمِعْتُ أَبَا بَكْرٍ رَضِيَ اللَّهُ عَنْهُ يَقُولُ يَا أَيُّهَا النَّاسُ إِيَّاكُمْ وَالْكَذِبَ فَإِنَّ الْكَذِبَ مُجَانِبٌ لِلْإِيمَانِ‏.‏","english":{"narrator":"Qais said:","text":"Abu Bakr stood up and praised and glorified Allah, then he said: O people, you recite this verse: “O you who believe! Take care of your ownselves. If you follow the (right) guidance...”  said: I heard Abu Bakr say: O people, beware of lying for lying is contrary to faith."}},{"id":17,"idInBook":17,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا هَاشِمٌ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي يَزِيدُ بْنُ خُمَيْرٍ، قَالَ سَمِعْتُ سُلَيْمَ بْنَ عَامِرٍ، رَجُلًا مِنْ حِمْيَرَ يُحَدِّثُ عَنْ أَوْسَطَ بْنِ إِسْمَاعِيلَ بْنِ أَوْسَطَ الْبَجَلِيِّ، يُحَدِّثُ عَنْ أَبِي بَكْرٍ، أَنَّهُ سَمِعَهُ حِينَ، تُوُفِّيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ الْأَوَّلِ مَقَامِي هَذَا ثُمَّ بَكَى ثُمَّ قَالَ عَلَيْكُمْ بِالصِّدْقِ فَإِنَّهُ مَعَ الْبِرِّ وَهُمَا فِي الْجَنَّةِ وَإِيَّاكُمْ وَالْكَذِبَ فَإِنَّهُ مَعَ الْفُجُورِ وَهُمَا فِي النَّارِ وَسَلُوا اللَّهَ الْمُعَافَاةَ فَإِنَّهُ لَمْ يُؤْتَ رَجُلٌ بَعْدَ الْيَقِينِ شَيْئًا خَيْرًا مِنْ الْمُعَافَاةِ ثُمَّ قَالَ لَا تَقَاطَعُوا وَلَا تَدَابَرُوا وَلَا تَبَاغَضُوا وَلَا تَحَاسَدُوا وَكُونُوا عِبَادَ اللَّهِ إِخْوَانًا‏.‏","english":{"narrator":"It was narrated from Awsat bin Isma'eel al-Bajali that he heard Abu Bakr, when the Prophet (ﷺ) had passed away, saying:","text":"The Messenger of Allah (ﷺ) stood last year in this place where I am standing. Then Abu Bakr wept, then he said: “You must adhere to the truth, for with it comes righteousness and they both lead to Paradise. And you must beware of lying for with it comes immorality and they both lead to Hell. Ask Allah to keep you safe and sound, for no one is given anything, after certain faith (yaqeen) that is better than being kept safe and sound.` Then he said: “Do not sever ties with one another, do not turn your backs on one another, do not bear grudges against one another, do not envy one another, and be, O slaves of Allah, brothers.`"}},{"id":18,"idInBook":18,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا عَفَّانُ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ دَاوُدَ بْنِ عَبْدِ اللَّهِ الْأَوْدِيِّ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، قَالَ تُوُفِّيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبُو بَكْرٍ فِي طَائِفَةٍ مِنْ الْمَدِينَةِ قَالَ فَجَاءَ فَكَشَفَ عَنْ وَجْهِهِ فَقَبَّلَهُ وَقَالَ فِدَاكَ أَبِي وَأُمِّي مَا أَطْيَبَكَ حَيًّا وَمَيِّتًا مَاتَ مُحَمَّدٌ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرَبِّ الْكَعْبَةِ فَذَكَرَ الْحَدِيثَ قَالَ فَانْطَلَقَ أَبُو بَكْرٍ وَعُمَرُ يَتَقَاوَدَانِ حَتَّى أَتَوْهُمْ فَتَكَلَّمَ أَبُو بَكْرٍ وَلَمْ يَتْرُكْ شَيْئًا أُنْزِلَ فِي الْأَنْصَارِ وَلَا ذَكَرَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ شَأْنِهِمْ إِلَّا وَذَكَرَهُ وَقَالَ وَلَقَدْ عَلِمْتُمْ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَوْ سَلَكَ النَّاسُ وَادِيًا وَسَلَكَتْ الْأَنْصَارُ وَادِيًا سَلَكْتُ وَادِيَ الْأَنْصَارِ وَلَقَدْ عَلِمْتَ يَا سَعْدُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ وَأَنْتَ قَاعِدٌ قُرَيْشٌ وُلَاةُ هَذَا الْأَمْرِ فَبَرُّ النَّاسِ تَبَعٌ لِبَرِّهِمْ وَفَاجِرُهُمْ تَبَعٌ لِفَاجِرِهِمْ قَالَ فَقَالَ لَهُ سَعْدٌ صَدَقْتَ نَحْنُ الْوُزَرَاءُ وَأَنْتُمْ الْأُمَرَاءُ‏.‏","english":{"narrator":"It was narrated that Humaid bin ‘Abdur-Rahman said:","text":"When the Messenger of Allah (ﷺ) died, Abu Bakr was in some other area of Madinah. He came and uncovered his face and kissed him, and said: May my father and mother be sacrificed for you; how good you look in life and in death. Muhammad (ﷺ) has died, by the Lord of the Ka'bah... Then Abu Bakr and ‘Umar came together to the people, Abu Bakr spoke and did not omit anything that was revealed concerning the Ansar or that the Messenger of Allah (ﷺ) had said concerning them but he mentioned it. And he said: You know that the Messenger of Allah (ﷺ) said: `If the people were to walk in one direction and the Ansar were to walk in another, I would walk in the direction of the Ansar.` I know, O Sa'd, that the Messenger of Allah (ﷺ) said, when you were sitting here: `Quraish are to be in charge of this affair (Islam), so the righteous people are but followers of the righteous of (Quraish), and the wrongdoers among the people are but followers of the wrongdoers of (Quraish).` Sa'd said to hümn: You have spoken the truth: we are advisers and you are leaders."}},{"id":19,"idInBook":19,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ عَيَّاشٍ، قَالَ حَدَّثَنَا الْعَطَّافُ بْنُ خَالِدٍ، قَالَ حَدَّثَنِي رَجُلٌ، مِنْ أَهْلِ الْبَصْرَةِ عَنْ طَلْحَةَ بْنِ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ الصِّدِّيقِ، قَالَ سَمِعْتُ أَبِي يَذْكُرُ، أَنَّ أَبَاهُ، سَمِعَ أَبَا بَكْرٍ، وَهُوَ يَقُولُ قُلْتُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا رَسُولَ اللَّهِ الْعَمَلُ عَلَى مَا فُرِغَ مِنْهُ أَوْ عَلَى أَمْرٍ مُؤْتَنَفٍ قَالَ بَلْ عَلَى أَمْرٍ قَدْ فُرِغَ مِنْهُ قَالَ قُلْتُ فَفِيمَ الْعَمَلُ يَا رَسُولَ اللَّهِ قَالَ كُلٌّ مُيَسَّرٌ لِمَا خُلِقَ لَهُ‏.‏","english":{"narrator":"It was narrated that Talhah bin 'Abdullah bin 'Abdur-Rahman bin Abi Bakr as-Siddeeq said:","text":"I heard my father say that his father heard Abu Bakr saying: I said to the Messenger of Allah (ﷺ) : O Messenger of Allah, are we striving for something that has already been decided or is it something to be decided as events unfold? He said: `Rather it is for something that has already been decided.` I said: So why should we strive, O Messenger of Allah? He said: “Each person will be enabled to do that for which he has been created.`"}},{"id":20,"idInBook":20,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي رَجُلٌ، مِنْ الْأَنْصَارِ مِنْ أَهْلِ الْفِقْهِ أَنَّهُ سَمِعَ عُثْمَانَ بْنَ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ يُحَدِّثُ أَنَّ رِجَالًا مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ تُوُفِّيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَزِنُوا عَلَيْهِ حَتَّى كَادَ بَعْضُهُمْ يُوَسْوِسُ قَالَ عُثْمَانُ وَكُنْتُ مِنْهُمْ فَبَيْنَا أَنَا جَالِسٌ فِي ظِلِّ أُطُمٍ مِنْ الْآطَامِ مَرَّ عَلَيَّ عُمَرُ رَضِيَ اللَّهُ عَنْهُ فَسَلَّمَ عَلَيَّ فَلَمْ أَشْعُرْ أَنَّهُ مَرَّ وَلَا سَلَّمَ فَانْطَلَقَ عُمَرُ حَتَّى دَخَلَ عَلَى أَبِي بَكْرٍ رَضِيَ اللَّهُ عَنْهُ فَقَالَ لَهُ مَا يُعْجِبُكَ أَنِّي مَرَرْتُ عَلَى عُثْمَانَ فَسَلَّمْتُ عَلَيْهِ فَلَمْ يَرُدَّ عَلَيَّ السَّلَامَ وَأَقْبَلَ هُوَ وَأَبُو بَكْرٍ فِي وِلَايَةِ أَبِي بَكْرٍ رَضِيَ اللَّهُ عَنْهُ حَتَّى سَلَّمَا عَلَيَّ جَمِيعًا ثُمَّ قَالَ أَبُو بَكْرٍ جَاءَنِي أَخُوكَ عُمَرُ فَذَكَرَ أَنَّهُ مَرَّ عَلَيْكَ فَسَلَّمَ فَلَمْ تَرُدَّ عَلَيْهِ السَّلَامَ فَمَا الَّذِي حَمَلَكَ عَلَى ذَلِكَ قَالَ قُلْتُ مَا فَعَلْتُ فَقَالَ عُمَرُ بَلَى وَاللَّهِ لَقَدْ فَعَلْتَ وَلَكِنَّهَا عُبِّيَّتُكُمْ يَا بَنِي أُمَيَّةَ قَالَ قُلْتُ وَاللَّهِ مَا شَعَرْتُ أَنَّكَ مَرَرْتَ وَلَا سَلَّمْتَ قَالَ أَبُو بَكْرٍ صَدَقَ عُثْمَانُ وَقَدْ شَغَلَكَ عَنْ ذَلِكَ أَمْرٌ فَقُلْتُ أَجَلْ قَالَ مَا هُوَ فَقَالَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ تَوَفَّى اللَّهُ عَزَّ وَجَلَّ نَبِيَّهُ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَبْلَ أَنْ نَسْأَلَهُ عَنْ نَجَاةِ هَذَا الْأَمْرِ قَالَ أَبُو بَكْرٍ قَدْ سَأَلْتُهُ عَنْ ذَلِكَ قَالَ فَقُمْتُ إِلَيْهِ فَقُلْتُ لَهُ بِأَبِي أَنْتَ وَأُمِّي أَنْتَ أَحَقُّ بِهَا قَالَ أَبُو بَكْرٍ قُلْتُ يَا رَسُولَ اللَّهِ مَا نَجَاةُ هَذَا الْأَمْرِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ قَبِلَ مِنِّي الْكَلِمَةَ الَّتِي عَرَضْتُ عَلَى عَمِّي فَرَدَّهَا عَلَيَّ فَهِيَ لَهُ نَجَاةٌ‏.‏","english":{"narrator":"It was narrated that az-Zuhri said:","text":"A man among the Ansar who was a man of knowledge told me that he heard 'Uthman bin 'Affan (may Allah have mercy on him) narrate that some of the Companions of the Prophet (ﷺ), when the Prophet (ﷺ) died, grieved so much that some of thern were almost unaware of what was going on around them. 'Uthman said: I was one of them. Whilst I was sitting in the shade of a small fort, ‘Umar passed by me and greeted me, and I did not realise that he had passed me or greeted me, ‘Umar went to Abu Bakr and said to him: Do you think it is right that I passed by ‘Uthman and greeted him and he did not return my greeting? He and Abu Bakr came, when Abu Bakr had been appointed caliph and they both greeted me. Then Abu Bakr said: Your brother ‘Umar came to me and told me that he passed by you and greeted you but you did not return his greeting; what made you do that? I said: I did not do that. 'Umar said: Yes, by Allah, you did that, but you have too much pride, O Banu Umayyah. I said: By Allah, I did not realise that you had passed me or greeted me. Abu Bakr said: 'Uthman is telling the truth; is something bothering you? I said: Yes. He said: What is it? 'Uthman said: Allah, may He be glorifică and exalted, has caused His Prophet (ﷺ) to die before we could ask him how we can save ourselves, Abu Bakr said: I asked him about that. ('Uthman] said: I went to him and said: May my father and mother be sacrificed for you, you were more deserving to ask it. Abu Bakr said: I said:O Messenger of Allah, what is salvation? The Messenger of Allah (ﷺ) said: “Whoever accepts this word from me that I asked my uncle to say but he rejected it, it is salvation for him.`"}},{"id":21,"idInBook":21,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا يَزِيدُ بْنُ عَبْدِ رَبِّهِ، قَالَ حَدَّثَنَا بَقِيَّةُ بْنُ الْوَلِيدِ، قَالَ حَدَّثَنِي شَيْخٌ، مِنْ قُرَيْشٍ عَنْ رَجَاءِ بْنِ حَيْوَةَ، عَنْ جُنَادَةَ بْنِ أَبِي أُمَيَّةَ، عَنْ يَزِيدَ بْنِ أَبِي سُفْيَانَ، قَالَ قَالَ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ حِينَ بَعَثَنِي إِلَى الشَّامِ يَا يَزِيدُ إِنَّ لَكَ قَرَابَةً عَسَيْتَ أَنْ تُؤْثِرَهُمْ بِالْإِمَارَةِ وَذَلِكَ أَكْبَرُ مَا أَخَافُ عَلَيْكَ فَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ وَلِيَ مِنْ أَمْرِ الْمُسْلِمِينَ شَيْئًا فَأَمَّرَ عَلَيْهِمْ أَحَدًا مُحَابَاةً فَعَلَيْهِ لَعْنَةُ اللَّهِ لَا يَقْبَلُ اللَّهُ مِنْهُ صَرْفًا وَلَا عَدْلًا حَتَّى يُدْخِلَهُ جَهَنَّمَ وَمَنْ أَعْطَى أَحَدًا حِمَى اللَّهِ فَقَدْ انْتَهَكَ فِي حِمَى اللَّهِ شَيْئًا بِغَيْرِ حَقِّهِ فَعَلَيْهِ لَعْنَةُ اللَّهِ أَوْ قَالَ تَبَرَّأَتْ مِنْهُ ذِمَّةُ اللَّهِ عَزَّ وَجَلَّ‏.‏","english":{"narrator":"It was narrated that Yazeed bin Abi Sufyan said:","text":"Abu Bakr said, when he sent me to Syria: O Yazeed, you have relatives and you may give them precedence in allocating positions of authority; that is the most serious thing I fear for you, because the Messenger of Allah (ﷺ) said: `Whoever is appointed in charge of any affairs of the Muslims and appoints over them anyone by way of favouritism, the curse of Allah be upon him and Allah will not accept any obligatory or nafl prayer from him until he admits him to Hell. And whoever allows anyone to transgress the sacred limits set by Allah has transgressed the sacred limits of Allah unlawfully, and on him will be the curse of Allah and Allah will forsake him.`"}},{"id":22,"idInBook":22,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ، قَالَ حَدَّثَنَا الْمَسْعُودِيُّ، قَالَ حَدَّثَنِي بُكَيْرُ بْنُ الْأَخْنَسِ، عَنْ رَجُلٍ، عَنْ أَبِي بَكْرٍ الصِّدِّيقِ، قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُعْطِيتُ سَبْعِينَ أَلْفًا يَدْخُلُونَ الْجَنَّةَ بِغَيْرِ حِسَابٍ وُجُوهُهُمْ كَالْقَمَرِ لَيْلَةَ الْبَدْرِ وَقُلُوبُهُمْ عَلَى قَلْبِ رَجُلٍ وَاحِدٍ فَاسْتَزَدْتُ رَبِّي عَزَّ وَجَلَّ فَزَادَنِي مَعَ كُلِّ وَاحِدٍ سَبْعِينَ أَلْفًا قَالَ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ فَرَأَيْتُ أَنَّ ذَلِكَ آتٍ عَلَى أَهْلِ الْقُرَى وَمُصِيبٌ مِنْ حَافَّاتِ الْبَوَادِي‏.‏","english":{"narrator":"lt was narrated that Abu Bakr as-Siddiq said:","text":"The Messenger of Allah (ﷺ) said: `I have been granted seventy thousand who will enter Paradise without being brought to account; their faces will be like the moon on the night when it is full and their hearts will be as the heart of one man. I asked my Lord, may He glorified and exalted, for more and He gave me more, with each one another seventy thousand.` Abu Bakr as-Siddeeq said: I thought that that referred to the people living in towns and included some of those living on the edge of the wilderness"}},{"id":23,"idInBook":23,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ عَطَاءٍ، عَنْ زِيَادٍ الْجَصَّاصِ، عَنْ عَلِيِّ بْنِ زَيْدٍ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عُمَرَ، قَالَ سَمِعْتُ أَبَا بَكْرٍ، يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ يَعْمَلْ سُوءًا يُجْزَ بِهِ فِي الدُّنْيَا‏.‏","english":{"narrator":"It was narrated that Ibn 'Umar said:","text":"I heard Abu Bakr say: The Messenger of Allah (ﷺ) said: `Whoever does an evil deed will be requited for it in this world.`"}},{"id":24,"idInBook":24,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا يَعْقُوبُ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، قَالَ قَالَ ابْنُ شِهَابٍ أَخْبَرَنِي رَجُلٌ، مِنْ الْأَنْصَارٍ غَيْرُ مُتَّهَمٍ أَنَّهُ سَمِعَ عُثْمَانَ بْنَ عَفَّانَ، يُحَدِّثُ أَنَّ رِجَالًا، مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ تُوُفِّيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَزِنُوا عَلَيْهِ حَتَّى كَادَ بَعْضُهُمْ أَنْ يُوَسْوِسَ قَالَ عُثْمَانُ فَكُنْتُ مِنْهُمْ فَذَكَرَ مَعْنَى حَدِيثِ أَبِي الْيَمَانِ عَنْ شُعَيْبٍ‏.‏","english":{"narrator":"Uthman bin 'Affan narrated that when the Messenger of Allah (ﷺ) died, some of the Companions of the Prophet (ﷺ) grieved for him so much that they were almost unaware of what was going on around thern. 'Uthman said:","text":"I was one of them... and he narrated a hadeeth similar to that of Abul Yaman from Shu'aib."}},{"id":25,"idInBook":25,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا يَعْقُوبُ، قَالَ حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، قَالَ ابْنُ شِهَابٍ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ، رَضِيَ اللَّهُ عَنْهَا زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخْبَرَتْهُ أَنَّ فَاطِمَةَ بِنْتَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَأَلَتْ أَبَا بَكْرٍ رَضِيَ اللَّهُ عَنْهُ بَعْدَ وَفَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَقْسِمَ لَهَا مِيرَاثَهَا مِمَّا تَرَكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِمَّا أَفَاءَ اللَّهُ عَلَيْهِ فَقَالَ لَهَا أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا نُورَثُ مَا تَرَكْنَا صَدَقَةٌ فَغَضِبَتْ فَاطِمَةُ عَلَيْهَا السَّلَام فَهَجَرَتْ أَبَا بَكْرٍ رَضِيَ اللَّهُ عَنْهُ فَلَمْ تَزَلْ مُهَاجِرَتَهُ حَتَّى تُوُفِّيَتْ قَالَ وَعَاشَتْ بَعْدَ وَفَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سِتَّةَ أَشْهُرٍ قَالَ وَكَانَتْ فَاطِمَةُ رَضِيَ اللَّهُ عَنْهَا تَسْأَلُ أَبَا بَكْرٍ نَصِيبَهَا مِمَّا تَرَكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ خَيْبَرَ وَفَدَكَ وَصَدَقَتِهِ بِالْمَدِينَةِ فَأَبَى أَبُو بَكْرٍ عَلَيْهَا ذَلِكَ وَقَالَ لَسْتُ تَارِكًا شَيْئًا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعْمَلُ بِهِ إِلَّا عَمِلْتُ بِهِ وَإِنِّي أَخْشَى إِنْ تَرَكْتُ شَيْئًا مِنْ أَمْرِهِ أَنْ أَزِيغَ فَأَمَّا صَدَقَتُهُ بِالْمَدِينَةِ فَدَفَعَهَا عُمَرُ إِلَى عَلِيٍّ وَعَبَّاسٍ فَغَلَبَهُ عَلَيْهَا عَلِيٌّ وَأَمَّا خَيْبَرُ وَفَدَكُ فَأَمْسَكَهُمَا عُمَرُ رَضِيَ اللَّهُ عَنْهُ وَقَالَ هُمَا صَدَقَةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَتَا لِحُقُوقِهِ الَّتِي تَعْرُوهُ وَنَوَائِبِهِ وَأَمْرُهُمَا إِلَى مَنْ وَلِيَ الْأَمْرَ قَالَ فَهُمَا عَلَى ذَلِكَ الْيَوْمَ‏.‏","english":{"narrator":"Urwah bin az-Zubair narrated that 'A'ishah, the wife of the Prophet (ﷺ) told him that Fatimah, the daughter of the Messenger of Allah (ﷺ), asked Abu Bakr, after the death of the Messenger of Allah (ﷺ), to give her her share of inheritance from that which the Messenger of Allah (ﷺ) had left behind, of the fai' that Allah had bestowed upon him. Abu Bakr said to her:","text":"The Messenger of Allah (ﷺ) said: “Our (Prophets') property is not to be inherited and whatever we leave behind is charity.` Fatimah got angry and kept away from Abu Bakr and she continued to do so until she died. Fatimah lived for six months after the Messenger of Allah (ﷺ), and she used to ask Abu Bakr for her share of that which the Messenger of Allah (ﷺ) had left behind of Khaibar and Fadak, and his charitable endowments in Madinah, but Abu Bakr refused to give her that. He said: I will not stop doing something that the Messenger of Allah (ﷺ) used to do; rather I will continue to do it. I am afraid that if I give up something that he did, I will go astray. As for his charitable endowment in Madinah, 'Umar gave it to 'Ali and 'Abbas, but ‘Ali took most of it. As for Khaibar and Fadak, 'Umar kept them and said: They are the charitable endowment of the Messenger of Allah (ﷺ) and were spent on his responsibilities and on emergencies. They were to be cared for by whoever became caliph, and this remains the case until today."}},{"id":26,"idInBook":26,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا حَسَنُ بْنُ مُوسَى، وَعَفَّانُ، قَالَا حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ عَلِيِّ بْنِ زَيْدٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ، رَضِيَ اللَّهُ عَنْهَا أَنَّهَا تَمَثَّلَتْ بِهَذَا الْبَيْتِ وَأَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ يَقْضِي وَأَبْيَضَ يُسْتَسْقَى الْغَمَامُ بِوَجْهِهِ رَبِيعُ الْيَتَامَى عِصْمَةٌ لِلْأَرَامِلِ فَقَالَ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ ذَاكَ وَاللَّهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ‏.‏","english":{"narrator":"It was narrated from 'A'ishah that she recited this line of poetry when Abu Bakr was dying:","text":"A white man by whose face rain may be sought, a refuge for orphans and protection for widows.\n\nAbu Bakr said: By Allah, that refers to the Messenger of Allah (ﷺ)."}},{"id":27,"idInBook":27,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَ أَخْبَرَنِي ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي أَبِي أَنَّ أَصْحَابَ النَّبِيِّ، صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَدْرُوا أَيْنَ يَقْبُرُونَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى قَالَ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَنْ يُقْبَرَ نَبِيٌّ إِلَّا حَيْثُ يَمُوتُ فَأَخَّرُوا فِرَاشَهُ وَحَفَرُوا لَهُ تَحْتَ فِرَاشِهِ‏.‏","english":{"narrator":"Ibn Juraij said:","text":"My father told me that the Companions of the Prophet (ﷺ) did not know where to bury the Prophet (ﷺ) until Abu Bakr said: I heard the Messenger of Allah (ﷺ) say: `A Prophet is not to be buried except where he died.” So they removed his bed and dug a grave for him beneath"}},{"id":28,"idInBook":28,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا حَجَّاجٌ، قَالَ حَدَّثَنَا لَيْثٌ، قَالَ حَدَّثَنِي يَزِيدُ بْنُ أَبِي حَبِيبٍ، عَنْ أَبِي الْخَيْرِ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ، عَنْ أَبِي بَكْرٍ الصِّدِّيقِ، رَضِيَ اللَّهُ عَنْهُ أَنَّهُ قَالَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلِّمْنِي دُعَاءً أَدْعُو بِهِ فِي صَلَاتِي قَالَ قُلْ اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْمًا كَثِيرًا وَلَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ وَارْحَمْنِي إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ‏.‏","english":{"narrator":"It was narrated from Abu Bakr as-Siddeeq that he said to the Messenger of Allah (ﷺ):","text":"Teach me a du'a` that I may say in my prayer. He said: `Say: O Allah. I have wronged myself greatly and no one forgives sins except You, so grant me forgiveness from You and have mercy on me, for You are the Oft-Forgiving, Most Merciful.`"}},{"id":29,"idInBook":29,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا حَمَّادُ بْنُ أُسَامَةَ، قَالَ أَخْبَرَنَا إِسْمَاعِيلُ، عَنْ قَيْسٍ، قَالَ قَامَ أَبُو بَكْرٍ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ يَا أَيُّهَا النَّاسُ إِنَّكُمْ تَقْرَءُونَ هَذِهِ الْآيَةَ ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا عَلَيْكُمْ أَنْفُسَكُمْ‏}‏ حَتَّى أَتَى عَلَى آخِرِ الْآيَةِ أَلَا وَإِنَّ النَّاسَ إِذَا رَأَوْا الظَّالِمَ لَمْ يَأْخُذُوا عَلَى يَدَيْهِ أَوْشَكَ اللَّهُ أَنْ يَعُمَّهُمْ بِعِقَابِهِ أَلَا وَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ النَّاسَ وَقَالَ مَرَّةً أُخْرَى وَإِنَّا سَمِعْنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ‏.‏","english":{"narrator":"It was narrated that Qais said:","text":"Abu Bakr stood up and praised and glorified Allah, then he said:O people, you recite this verse: `O you who believe! Take care of your ownselves...` (al-Ma’idah 5:105] until he reached the end of the verse. But if the people see an evildoer and do not stop him, soon Allah will send His punishment upon them all. But I heard the Messenger of Allah (ﷺ) say: “If the people...” And on another occasion he said: We heard the Messenger of Allah..."}},{"id":30,"idInBook":30,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، قَالَ أَخْبَرَنَا إِسْمَاعِيلُ بْنُ أَبِي خَالِدٍ، عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ، عَنْ أَبِي بَكْرٍ الصِّدِّيقِ، رَضِيَ اللَّهُ عَنْهُ قَالَ أَيُّهَا النَّاسُ إِنَّكُمْ تَقْرَءُونَ هَذِهِ الْآيَةَ ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا عَلَيْكُمْ أَنْفُسَكُمْ لَا يَضُرُّكُمْ مَنْ ضَلَّ إِذَا اهْتَدَيْتُمْ‏}‏ وَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ النَّاسَ إِذَا رَأَوْا الظَّالِمَ فَلَمْ يَأْخُذُوا عَلَى يَدَيْهِ أَوْشَكَ أَنْ يَعُمَّهُمْ اللَّهُ بِعِقَابِهِ‏.‏","english":{"narrator":"It was narrated that Abu Bakr as-Siddeeq said:","text":"O people, you recite this verse: `O you who believe! Take care of your own selves. If you follow the (right) guidance . I heard the Messenger of Allah (ﷺ) say: “If the people see an evildoer and do not stop him, soon Allah will send His punishment upon them all.”"}},{"id":31,"idInBook":31,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا يَزِيدُ، قَالَ أَخْبَرَنَا هَمَّامٌ، عَنْ فَرْقَدٍ السَّبَخِيِّ، وَعَفَّانُ، قَالَا حَدَّثَنَا مُرَّةُ الطَّيِّبُ، عَنْ أَبِي بَكْرٍ الصِّدِّيقِ، رَضِيَ اللَّهُ عَنْهُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَدْخُلُ الْجَنَّةَ سَيِّئُ الْمَلَكَةِ‏.‏","english":{"narrator":"t was narrated from Farqad as-Sabakhi and ' Affan said:","text":"Hammam told us: Farqad told us from Murrah at-Tayyib from Abu Bakr as-Siddeeq that the Prophet (ﷺ) said: `No one who mistreats his slaves will enter Paradise.”"}},{"id":32,"idInBook":32,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا صَدَقَةُ بْنُ مُوسَى، عَنْ فَرْقَدٍ السَّبَخِيِّ، عَنْ مُرَّةَ الطَّيِّبِ، عَنْ أَبِي بَكْرٍ الصِّدِّيقِ، رَضِيَ اللَّهُ عَنْهُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَدْخُلُ الْجَنَّةَ خَبٌّ وَلَا بَخِيلٌ وَلَا مَنَّانٌ وَلَا سَيِّئُ الْمَلَكَةِ وَأَوَّلُ مَنْ يَدْخُلُ الْجَنَّةَ الْمَمْلُوكُ إِذَا أَطَاعَ اللَّهَ وَأَطَاعَ سَيِّدَهُ‏.‏","english":{"narrator":"It was narrated from Farqad as-Sabakhi from Murrah at-Tayyib from Abu Bakr as-Siddeeq that the Prophet (ﷺ)said:","text":"“No one will enter Paradise who is treacherous, miserly, reminds people of his favours or mistreats his slaves. The first to enter Paradise will be the slave, if he obeys Allah and obeys his master.`"}},{"id":33,"idInBook":33,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا رَوْحٌ، قَالَ حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ، عَنْ أَبِي التَّيَّاحِ، عَنِ الْمُغِيرَةِ بْنِ سُبَيْعٍ، عَنْ عَمْرِو بْنِ حُرَيْثٍ، أَنَّ أَبَا بَكْرٍ الصِّدِّيقَ، رَضِيَ اللَّهُ عَنْهُ أَفَاقَ مِنْ مَرْضَةٍ لَهُ فَخَرَجَ إِلَى النَّاسِ فَاعْتَذَرَ بِشَيْءٍ وَقَالَ مَا أَرَدْنَا إِلَّا الْخَيْرَ ثُمَّ قَالَ حَدَّثَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ الدَّجَّالَ يَخْرُجُ مِنْ أَرْضٍ بِالْمَشْرِقِ يُقَالُ لَهَا خُرَاسَانُ يَتْبَعُهُ أَقْوَامٌ كَأَنَّ وُجُوهَهُمْ الْمَجَانُّ الْمُطْرَقَةُ‏.‏","english":{"narrator":"It was narrated from 'Amr bin Huraith that Abu Bakr as-Siddeeq recovered from a sickness and went out to the people. He apologised for something and said:","text":"We did not intend anything but good. Then he said: The Messenger of Allah (ﷺ) told us: `The Dajjal will emerge from a land in the East called Khurasan and he will be followed by people with faces like hammered shields.”"}},{"id":34,"idInBook":34,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا رَوْحٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ يَزِيدَ بْنِ خُمَيْرٍ، قَالَ سَمِعْتُ سُلَيْمَ بْنَ عَامِرٍ، رَجُلًا مِنْ أَهْلِ حِمْصَ وَكَانَ قَدْ أَدْرَكَ أَصْحَابَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ مَرَّةً قَالَ سَمِعْتُ أَوْسَطَ الْبَجَلِيَّ عَنْ أَبِي بَكْرٍ الصِّدِّيقِ رَضِيَ اللَّهُ عَنْهُ قَالَ سَمِعْتُهُ يَخْطُبُ النَّاسَ وَقَالَ مَرَّةً حِينَ اسْتُخْلِفَ فَقَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَامَ عَامَ الْأَوَّلِ مَقَامِي هَذَا وَبَكَى أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ فَقَالَ أَسْأَلُ اللَّهَ الْعَفْوَ وَالْعَافِيَةَ فَإِنَّ النَّاسَ لَمْ يُعْطَوْا بَعْدَ الْيَقِينِ شَيْئًا خَيْرًا مِنْ الْعَافِيَةِ وَعَلَيْكُمْ بِالصِّدْقِ فَإِنَّهُ فِي الْجَنَّةِ وَإِيَّاكُمْ وَالْكَذِبَ فَإِنَّهُ مَعَ الْفُجُورِ وَهُمَا فِي النَّارِ وَلَا تَقَاطَعُوا وَلَا تَبَاغَضُوا وَلَا تَحَاسَدُوا وَلَا تَدَابَرُوا وَكُونُوا إِخْوَانًا كَمَا أَمَرَكُمْ اللَّهُ عَزَّ وَجَلَّ‏.‏","english":{"narrator":"It was narrated that Yazeed bin Khumair said:","text":"I heard Sulaim bin 'Amir, a man from Homs who met the Companions of the Messenger of Allah (ﷺ), say - on one occasion he said: I heard Awsat al-Bajali narrate from Abu Bakr as-Siddeeq, he said: I heard him addressing the people - and on another occasion he said: when he was appointed as caliph - he said: The Messenger of Allah (ﷺ) stood last year where I am standing. Abu Bakr wept and said: “I ask Allah for pardon and well-being, for people are never given anything, after certainty of faith, that is better than well being. You should be truthful, for it leads to Paradise, and beware of lying, for it goes with immorality, and they lead to Hell. Do not sever ties with one another, do not hate one another, do not envy one another, do not turn your backs on one another; be brothers, as Allah, may He be glorified and exalted, has enjoined you.`"}},{"id":35,"idInBook":35,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا يَحْيَى بْنُ آدَمَ، قَالَ حَدَّثَنَا أَبُو بَكْرٍ يَعْنِي ابْنَ عَيَّاشٍ، عَنْ عَاصِمٍ، عَنْ زِرٍّ، عَنْ عَبْدِ اللَّهِ، أَنَّ أَبَا بَكْرٍ، وَعُمَرَ، رَضِيَ اللَّهُ عَنْهُمَا بَشَّرَاهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ سَرَّهُ أَنْ يَقْرَأَ الْقُرْآنَ غَضًّا كَمَا أُنْزِلَ فَلْيَقْرَأْهُ عَلَى قِرَاءَةِ ابْنِ أُمِّ عَبْدٍ\n\nقَالَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ حَدَّثَنَا أَبُو بَكْرٍ وَيَزِيدُ بْنُ عَبْدِ الْعَزِيزِ عَنِ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ قَالَ غَضًّا أَوْ رَطْبًا‏.‏","english":{"narrator":"It was narrated from 'Asim from Zirr from ‘Abdullah that Abu Bakr and ‘Umar gave him the glad tidings that the Messenger of Allah (ﷺ) said:","text":"`Whoever would like to recite the Qur'an fresh as it was revealed, let him recite it according to the recitation of Ibn Umm 'Abd.`\n\nUmar bin al-Khattab narrated that the Prophet (ﷺ) said... a similar report, in which he said: crisp or fresh."}},{"id":36,"idInBook":36,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا أَبُو سَعِيدٍ، مَوْلَى بَنِي هَاشِمٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، وَسَعِيدُ بْنُ سَلَمَةَ بْنِ أَبِي الْحُسَامِ، عَنْ عَمْرِو بْنِ أَبِي عَمْرٍو، عَنْ أَبِي الْحُوَيْرِثِ، عَنْ مُحَمَّدِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ، أَنَّ عُثْمَانَ، رَضِيَ اللَّهُ عَنْهُ قَالَ تَمَنَّيْتُ أَنْ أَكُونَ سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَاذَا يُنْجِينَا مِمَّا يُلْقِي الشَّيْطَانُ فِي أَنْفُسِنَا فَقَالَ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ قَدْ سَأَلْتُهُ عَنْ ذَلِكَ فَقَالَ يُنْجِيكُمْ مِنْ ذَلِكَ أَنْ تَقُولُوا مَا أَمَرْتُ عَمِّي أَنْ يَقُولَهُ‏.‏","english":{"narrator":"It was narrated from Muhammad bin Jubair bin Mut'im that 'Uthman said:","text":"I wish that I had asked the Messenger of Allah (ﷺ) what would save us from what the Shaitan whispers into our hearts. Abu Bakr said: I asked him about that and he said: `What can save you from that is to say what I told my uncle to say but he did not say it.`"}},{"id":37,"idInBook":37,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، عَنْ يُونُسَ، عَنِ الْحَسَنِ، أَنَّ أَبَا بَكْرٍ، رَضِيَ اللَّهُ عَنْهُ خَطَبَ النَّاسَ فَقَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا أَيُّهَا النَّاسُ إِنَّ النَّاسَ لَمْ يُعْطَوْا فِي الدُّنْيَا خَيْرًا مِنْ الْيَقِينِ وَالْمُعَافَاةِ فَسَلُوهُمَا اللَّهَ عَزَّ وَجَلَّ‏.‏","english":{"narrator":"It was narrated from al-Hasan that Abu Bakr addressed the people and said:","text":"The Messenger of Allah (ﷺ) said: `O people, the people are not given anything better in this world than certainty of faith and well-being, so ask Allah, may He be glorified and exalted, for them.`"}},{"id":38,"idInBook":38,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَبِي، عَنِ ابْنِ إِسْحَاقَ، قَالَ وَحَدَّثَنِي حُسَيْنُ بْنُ عَبْدِ اللَّهِ، عَنْ عِكْرِمَةَ، مَوْلَى ابْنِ عَبَّاسٍ عَنِ ابْنِ عَبَّاسٍ، قَالَ لَمَّا أَرَادُوا أَنْ يَحْفِرُوا، لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَانَ أَبُو عُبَيْدَةَ بْنُ الْجَرَّاحِ يَضْرَحُ كَحَفْرِ أَهْلِ مَكَّةَ وَكَانَ أَبُو طَلْحَةَ زَيْدُ بْنُ سَهْلٍ يَحْفِرُ لِأَهْلِ الْمَدِينَةِ فَكَانَ يَلْحَدُ فَدَعَا الْعَبَّاسُ رَجُلَيْنِ فَقَالَ لِأَحَدِهِمَا اذْهَبْ إِلَى أَبِي عُبَيْدَةَ وَلِلْآخَرِ اذْهَبْ إِلَى أَبِي طَلْحَةَ اللَّهُمَّ خِرْ لِرَسُولِكَ قَالَ فَوَجَدَ صَاحِبُ أَبِي طَلْحَةَ أَبَا طَلْحَةَ فَجَاءَ بِهِ فَلَحَدَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ‏.‏","english":{"narrator":"It was narrated that Ibn 'Abbas said:","text":"When they wanted to dig a grave for the Messenger of Allah (ﷺ), Abu 'Ubaidah bin al-Jarrah used to dig graves in the manner of the people of Makkah and Abu Talhah Zaid bin Sahl used to dig graves for the people of Madinah, and he would make a niche in the side of the grave. Al-'Abbas called two men and said to one of them, Go to Abu ‘Ubaidah; and to the other he said, Go to Abu Talhah. O Allah, choose for Your Messenger. The one who had been sent to Abu Talhah found him, so he came and dug a grave with a niche in its side for the Messenger of Allah (ﷺ)."}},{"id":39,"idInBook":39,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، حَدَّثَنَا عُمَرُ بْنُ سَعِيدٍ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، أَخْبَرَنِي عُقْبَةُ بْنُ الْحَارِثِ، قَالَ خَرَجْتُ مَعَ أَبِي بَكْرٍ الصِّدِّيقِ رَضِيَ اللَّهُ عَنْهُ مِنْ صَلَاةِ الْعَصْرِ بَعْدَ وَفَاةِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِلَيَالٍ وَعَلِيٌّ عَلَيْهِ السَّلَام يَمْشِي إِلَى جَنْبِهِ فَمَرَّ بِحَسَنِ بْنِ عَلِيٍّ يَلْعَبُ مَعَ غِلْمَانٍ فَاحْتَمَلَهُ عَلَى رَقَبَتِهِ وَهُوَ يَقُولُ وَا بِأَبِي شَبَهُ النَّبِيِّ لَيْسَ شَبِيهًا بِعَلِيِّ قَالَ وَعَلِيٌّ يَضْحَكُ‏.‏","english":{"narrator":"Uqbah bin al-Harith said:","text":"I went out with Abu Bakr following 'Asr prayer a few days after the death of the Prophet (ﷺ), and ‘Ali was walking beside him. He passed by al-Hasan bin ‘Ali who was playing with some boys. Abu Bakr carried him on his shoulder, saying: May my father be sacrificed for him, the one who looks like the Prophet (ﷺ) and does not look like 'Ali. He said: And ‘Ali smiled"}},{"id":40,"idInBook":40,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا أَسْوَدُ بْنُ عَامِرٍ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ جَابِرٍ، عَنْ عَامِرٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى، عَنْ أَبِي بَكْرٍ، قَالَ كُنْتُ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَالِسًا فَجَاءَ مَاعِزُ بْنُ مَالِكٍ فَاعْتَرَفَ عِنْدَهُ مَرَّةً فَرَدَّهُ ثُمَّ جَاءَهُ فَاعْتَرَفَ عِنْدَهُ الثَّانِيَةَ فَرَدَّهُ ثُمَّ جَاءَهُ فَاعْتَرَفَ الثَّالِثَةَ فَرَدَّهُ فَقُلْتُ لَهُ إِنَّكَ إِنْ اعْتَرَفْتَ الرَّابِعَةَ رَجَمَكَ قَالَ فَاعْتَرَفَ الرَّابِعَةَ فَحَبَسَهُ ثُمَّ سَأَلَ عَنْهُ فَقَالُوا مَا نَعْلَمُ إِلَّا خَيْرًا قَالَ فَأَمَرَ بِرَجْمِهِ‏.‏","english":{"narrator":"It was narrated from Jabir from 'Abdur-Rahman bin Abza that Abu Bakr 4 said:","text":"I was sitting with the Prophet (ﷺ) when Ma'iz bin Malik came and confessed (to adultery) in his presence once, and he sent him away. Then he came and admitted it in his presence a second time and he sent him away. Then he came and admitted it in his presence a third time and he sent him away. I said to him: If you confess a fourth time, he will stone you. Then he admitted it the fourth time, so he detained him and asked about him, and they said: We do not know anything but good about him. Then he ordered that he be stoned."}},{"id":41,"idInBook":41,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ عَيَّاشٍ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، قَالَ أَخْبَرَنِي يَزِيدُ بْنُ سَعِيدِ بْنِ ذِي، عَصْوَانَ الْعَنْسِيُّ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ اللَّخْمِيِّ، عَنْ رَافِعٍ الطَّائِيِّ، رَفِيقِ أَبِي بَكْرٍ فِي غَزْوَةِ السُّلَاسِلِ قَالَ وَسَأَلْتُهُ عَمَّا قِيلَ مِنْ بَيْعَتِهِمْ فَقَالَ وَهُوَ يُحَدِّثُهُ عَمَّا تَكَلَّمَتْ بِهِ الْأَنْصَارُ وَمَا كَلَّمَهُمْ بِهِ وَمَا كَلَّمَ بِهِ عُمَرُ بْنُ الْخَطَّابِ الْأَنْصَارَ وَمَا ذَكَّرَهُمْ بِهِ مِنْ إِمَامَتِي إِيَّاهُمْ بِأَمْرِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي مَرَضِهِ فَبَايَعُونِي لِذَلِكَ وَقَبِلْتُهَا مِنْهُمْ وَتَخَوَّفْتُ أَنْ تَكُونَ فِتْنَةٌ تَكُونُ بَعْدَهَا رِدَّةٌ‏.‏","english":{"narrator":"It was narrated that Rafi' atTaʼi, Abu Bakrʼs companion during the campaign of as-Salasil, said:","text":"I asked him about how they came to swear allegiance to Abu Bakr and he said - when telling him about what the Ansar said and what Abu Bakr said to them and what `Umar bin al-Khattab said to the Ansar when he reminded them that he had led them in prayer on the instructions of the Messenger of Allah (ﷺ) when he was sick. They swore allegiance to me because of that and I Accepted it from them, but I was concerned that there would be turmoil that would lead to apostasy,"}},{"id":42,"idInBook":42,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ عَيَّاشٍ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنِي وَحْشِيُّ بْنُ حَرْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، وَحْشِيِّ بْنِ حَرْبٍ، أَنَّ أَبَا بَكْرٍ، رَضِيَ اللَّهُ عَنْهُ عَقَدَ لِخَالِدِ بْنِ الْوَلِيدِ عَلَى قِتَالِ أَهْلِ الرِّدَّةِ وَقَالَ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ نِعْمَ عَبْدُ اللَّهِ وَأَخُو الْعَشِيرَةِ خَالِدُ بْنُ الْوَلِيدِ وَسَيْفٌ مِنْ سُيُوفِ اللَّهِ سَلَّهُ اللَّهُ عَزَّ وَجَلَّ عَلَى الْكُفَّارِ وَالْمُنَافِقِينَ‏.‏","english":{"narrator":"It was narrated from Wahshi bin Harb that Abu Bakr appointed Khalid bin al-Waleed as commander to fight the apostates and he said:","text":"I heard the Messenger of Allah (ﷺ) say: “What a good slave of Allah and member of the tribe Khalid bin al-Waleed is!  one of the swords of Allah that Allah, may He be glorified and exalted, has unsheathed against disbelievers and hypocrites.`"}},{"id":43,"idInBook":43,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا مُعَاوِيَةُ يَعْنِي ابْنَ صَالِحٍ، عَنْ سُلَيْمِ بْنِ عَامِرٍ الْكَلَاعِيِّ، عَنْ أَوْسَطَ بْنِ عَمْرٍو، قَالَ قَدِمْتُ الْمَدِينَةَ بَعْدَ وَفَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِسَنَةٍ فَأَلْفَيْتُ أَبَا بَكْرٍ يَخْطُبُ النَّاسَ فَقَالَ قَامَ فِينَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ الْأَوَّلِ فَخَنَقَتْهُ الْعَبْرَةُ ثَلَاثَ مِرَارٍ ثُمَّ قَالَ يَا أَيُّهَا النَّاسُ سَلُوا اللَّهَ الْمُعَافَاةَ فَإِنَّهُ لَمْ يُؤْتَ أَحَدٌ مِثْلَ يَقِينٍ بَعْدَ مُعَافَاةٍ وَلَا أَشَدَّ مِنْ رِيبَةٍ بَعْدَ كُفْرٍ وَعَلَيْكُمْ بِالصِّدْقِ فَإِنَّهُ يَهْدِي إِلَى الْبِرِّ وَهُمَا فِي الْجَنَّةِ وَإِيَّاكُمْ وَالْكَذِبَ فَإِنَّهُ يَهْدِي إِلَى الْفُجُورِ وَهُمَا فِي النَّارِ‏.‏","english":{"narrator":"Mu'awiyah bin Salih narrated from Sulaim bin 'Amir al-Kala'i, that Awsat bin 'Amr said:","text":"I came to Madinah one year after the death of the Messenger of Allah (ﷺ) and I found Abu Bakr addressing the people. He said: The Messenger of Allah (ﷺ) stood before us last year... and he wept and struggled to speak three times, then he said: 0 people, ask Allah for well-being for no one is given, after certainty of faith, anything like well being and nothing worse than doubt after disbelief. You should be truthful, for it guides to righteousness and they lead to Paradise. Beware of lying, for it guides to immorality and they both lead to Hell."}},{"id":44,"idInBook":44,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ مُيَسَّرٍ أَبُو سَعْدٍ الصَّاغَانِيُّ الْمَكْفُوفُ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، رَضِيَ اللَّهُ عَنْهَا قَالَتْ إِنَّ أَبَا بَكْرٍ رَضِيَ اللَّهُ عَنْهُ لَمَّا حَضَرَتْهُ الْوَفَاةُ قَالَ أَيُّ يَوْمٍ هَذَا قَالُوا يَوْمُ الِاثْنَيْنِ قَالَ فَإِنْ مِتُّ مِنْ لَيْلَتِي فَلَا تَنْتَظِرُوا بِي الْغَدَ فَإِنَّ أَحَبَّ الْأَيَّامِ وَاللَّيَالِي إِلَيَّ أَقْرَبُهَا مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ‏.‏","english":{"narrator":"Muhammad bin Muyassar Abu Sa'd as-Saghani al-Makfoot narrated:","text":"Hisham bin 'Lirwah narrated to us from his father that ‘Aʼishah said; When Abu Bakr was dying, he said: What day is it? They said: Monday. He said: if I die tonight, do not wait until tomorrow to bury me, for the dearest of days and nights to me is that which is closest to the Messenger of Allah (ﷺ)."}},{"id":45,"idInBook":45,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، حَدَّثَنَا عَمْرُو بْنُ مُرَّةَ، عَنْ أَبِي عُبَيْدَةَ، قَالَ قَامَ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ بَعْدَ وَفَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِعَامٍ فَقَالَ قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَقَامِي عَامَ الْأَوَّلِ فَقَالَ سَلُوا اللَّهَ الْعَافِيَةَ فَإِنَّهُ لَمْ يُعْطَ عَبْدٌ شَيْئًا أَفْضَلَ مِنْ الْعَافِيَةِ وَعَلَيْكُمْ بِالصِّدْقِ وَالْبِرِّ فَإِنَّهُمَا فِي الْجَنَّةِ وَإِيَّاكُمْ وَالْكَذِبَ وَالْفُجُورَ فَإِنَّهُمَا فِي النَّارِ‏.‏","english":{"narrator":"It was narrâted that Abu 'Ubaidah said:","text":"Abu Bakr stood up, one year after the death of the Messenger of Allah (ﷺ) and said: The Messenger of Allah (ﷺ) stood where I am standing last year and said: “Ask Allah for well being, for no one is given anything better than well-being. And you should be truthful and righteous, for they lead to Paradise. Beware of lying and immorality, for they lead to Hell.`"}},{"id":46,"idInBook":46,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا شُعْبَةُ، عَنْ عُثْمَانَ بْنِ الْمُغِيرَةِ، قَالَ سَمِعْتُ عَلِيَّ بْنَ رَبِيعَةَ، مِنْ بَنِي أَسَدٍ يُحَدِّثُ عَنْ أَسْمَاءَ، أَوْ ابْنِ أَسْمَاءَ مِنْ بَنِي فَزَارَةَ قَالَ قَالَ عَلِيٌّ رَضِيَ اللَّهُ عَنْهُ كُنْتُ إِذَا سَمِعْتُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَيْئًا نَفَعَنِي اللَّهُ بِمَا شَاءَ أَنْ يَنْفَعَنِي مِنْهُ وَحَدَّثَنِي أَبُو بَكْرٍ وَصَدَقَ أَبُو بَكْرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْ مُسْلِمٍ يُذْنِبُ ذَنْبًا ثُمَّ يَتَوَضَّأُ فَيُصَلِّي رَكْعَتَيْنِ ثُمَّ يَسْتَغْفِرُ اللَّهَ تَعَالَى لِذَلِكَ الذَّنْبِ إِلَّا غَفَرَ لَهُ وَقَرَأَ هَاتَيْنِ الْآيَتَيْنِ ‏{‏وَمَنْ يَعْمَلْ سُوءًا أَوْ يَظْلِمْ نَفْسَهُ ثُمَّ يَسْتَغْفِرْ اللَّهَ يَجِدْ اللَّهَ غَفُورًا رَحِيمًا‏}‏ ‏{‏وَالَّذِينَ إِذَا فَعَلُوا فَاحِشَةً أَوْ ظَلَمُوا أَنْفُسَهُمْ‏}‏ الْآيَةَ\n\nحَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ عُثْمَانَ مِنْ آلِ أَبِي عُقَيْلٍ الثَّقَفِيِّ إِلَّا أَنَّهُ قَالَ قَالَ شُعْبَةُ وَقَرَأَ إِحْدَى هَاتَيْنِ الْآيَتَيْنِ ‏{‏مَنْ يَعْمَلْ سُوءًا يُجْزَ بِهِ‏}‏ ‏{‏وَالَّذِينَ إِذَا فَعَلُوا فَاحِشَةً‏}‏‏.‏","english":{"narrator":"Ali said:","text":"If Heard something from the Messenger of Allah (ﷺ), Allah would benefit me thereby as He willed. Abu Bakr told me - and Abu Bakr spoke the truth - he said: The Messenger of Allah (ﷺ) said: `There is no Muslim who commits a sin then does wudu' and prays two rak'ahs then asks Allah for forgiveness for that sin, but He will forgive him.” And he recited these two verses: `And whoever does evil or wrongs himself but afterwards seeks Allah's forgiveness, he will find Allah Oft-Forgiving Most Merciful`  \n“And those who, when they have committed Fahishah (illegal sexual intercourse) or wronged themselves with evil, remember Allah and ask forgiveness for their sins;-and none can forgive sins but Allah - and do not persist in what (wrong) they have done, while they know` \n\nShu'bah said: I heard 'Uthman from the family of Abu 'Aqeel athThaqafi say--but he said. Shu'bah said: And he recited one of these two verses: `whosoever works evil, will have the recompense thereof`  or “And those who, when they have committed Fahishah (illegal sexual intercourse)...` [Al 'Imran 3:135)."}},{"id":47,"idInBook":47,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا بَهْزُ بْنُ أَسَدٍ، حَدَّثَنَا سَلِيمُ بْنُ حَيَّانَ، قَالَ سَمِعْتُ قَتَادَةَ، يُحَدِّثُ عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّ عُمَرَ، قَالَ إِنَّ أَبَا بَكْرٍ رَضِيَ اللَّهُ عَنْهُ خَطَبَنَا فَقَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَامَ فِينَا عَامَ أَوَّلَ فَقَالَ أَلَا إِنَّهُ لَمْ يُقْسَمْ بَيْنَ النَّاسِ شَيْءٌ أَفْضَلُ مِنْ الْمُعَافَاةِ بَعْدَ الْيَقِينِ أَلَا إِنَّ الصِّدْقَ وَالْبِرَّ فِي الْجَنَّةِ أَلَا إِنَّ الْكَذِبَ وَالْفُجُورَ فِي النَّارِ‏.‏","english":{"narrator":"‘Umar said:","text":"Abu Bakr -q. addressed us and said: The Messenger of Allah (ﷺ) stood among us last year and said: “Nothing is shared out among the people that is better than well-being after certainty of faith. Verily, truthfulness and righteousness lead to Paradise and verily lying and immorality lead to Hell.`"}},{"id":48,"idInBook":48,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ أَبَا إِسْحَاقَ، يَقُولُ سَمِعْتُ الْبَرَاءَ، قَالَ لَمَّا أَقْبَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ مَكَّةَ إِلَى الْمَدِينَةِ عَطِشَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَرُّوا بِرَاعِي غَنَمٍ قَالَ أَبُو بَكْرٍ الصِّدِّيقُ رَضِيَ اللَّهُ عَنْهُ فَأَخَذْتُ قَدَحًا فَحَلَبْتُ فِيهِ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُثْبَةً مِنْ لَبَنٍ فَأَتَيْتُهُ بِهِ فَشَرِبَ حَتَّى رَضِيتُ‏.‏","english":{"narrator":"Al-Bara` said:","text":"When the Messenger of Allah (ﷺ) came from Makkah to Madinah, the Messenger of Allah (ﷺ) got thirsty. They passed by a herd of sheep, Abu Bakr as Siddeeq said: I took a cup and milked a cupful of milk for the Messenger of Allah (ﷺ). I brought it to him and he drank until I was pleased,"}},{"id":49,"idInBook":49,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا بَهْزٌ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا يَعْلَى بْنُ عَطَاءٍ، قَالَ سَمِعْتُ عَمْرَو بْنَ عَاصِمٍ، يَقُولُ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ يَا رَسُولَ اللَّهِ عَلِّمْنِي شَيْئًا أَقُولُهُ إِذَا أَصْبَحْتُ وَإِذَا أَمْسَيْتُ وَإِذَا أَخَذْتُ مَضْجَعِي قَالَ قُلْ اللَّهُمَّ فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ أَوْ قَالَ اللَّهُمَّ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي وَشَرِّ الشَّيْطَانِ وَشِرْكِهِ\n\nحَدَّثَنَا عَفَّانُ حَدَّثَنَا شُعْبَةُ عَنْ يَعْلَى بْنِ عَطَاءٍ قَالَ سَمِعْتُ عَمْرَو بْنَ عَاصِمِ بْنِ عَبْدِ اللَّهِ فَذَكَرَ مَعْنَاهُ‏.‏","english":{"narrator":"Abu Hurairah said. Abu Bakr said:","text":"O Messenger of Allah, teach me something that I may say in the morning and in the evening and when I go to bed. He said: `Say: O Allah, Creator of the heavens and the earth. Knower of the unseen and the seen – or he said: O Allah, Knower of the unseen and the seen, Creator of the heavens and the earth - Lord and Sovereign of all things, I bear witness that there is no god but You; I seek refuge in You from the evil of my own self and the evil of the Shaitan and the shirk to which he calls people.”\n\nIt was narrated that Ya'la bin `Ata' said: I heard 'Amr bin 'Asim bin ‘Abdullah... a similar report."}},{"id":50,"idInBook":50,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ إِسْمَاعِيلَ، قَالَ سَمِعْتُ قَيْسَ بْنَ أَبِي حَازِمٍ، يُحَدِّثُ عَنْ أَبِي بَكْرٍ الصِّدِّيقِ، رَضِيَ اللَّهُ عَنْهُ أَنَّهُ خَطَبَ فَقَالَ يَا أَيُّهَا النَّاسُ إِنَّكُمْ تَقْرَءُونَ هَذِهِ الْآيَةَ وَتَضَعُونَهَا عَلَى غَيْرِ مَا وَضَعَهَا اللَّهُ ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا عَلَيْكُمْ أَنْفُسَكُمْ لَا يَضُرُّكُمْ مَنْ ضَلَّ إِذَا اهْتَدَيْتُمْ‏}‏ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ النَّاسَ إِذَا رَأَوْا الْمُنْكَرَ بَيْنَهُمْ فَلَمْ يُنْكِرُوهُ يُوشِكُ أَنْ يَعُمَّهُمْ اللَّهُ بِعِقَابِهِ‏.‏","english":{"narrator":"It was narrated from Abu Bakr as-Siddeeq that he delivered a khutbah and said:","text":"0 people, you recite this verse but you quote it inappropriately: “O you who believe! Take care of your own selves. If you follow the (right) guidance . I heard the Messenger of Allah (ﷺ) say: `If the people see evil and do not denounce it, soon Allah will send His punishment upon them ali.”"}},{"id":51,"idInBook":51,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ تَوْبَةَ الْعَنْبَرِيِّ، قَالَ سَمِعْتُ أَبَا سَوَّارٍ الْقَاضِيَ، يَقُولُ عَنْ أَبِي بَرْزَةَ الْأَسْلَمِيِّ، قَالَ أَغْلَظَ رَجُلٌ لِأَبِي بَكْرٍ الصِّدِّيقِ رَضِيَ اللَّهُ عَنْهُ قَالَ فَقَالَ أَبُو بَرْزَةَ أَلَا أَضْرِبُ عُنُقَهُ قَالَ فَانْتَهَرَهُ وَقَالَ مَا هِيَ لِأَحَدٍ بَعْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ‏.‏","english":{"narrator":"It was narrated that Abu Barzah al-Aslami said:","text":"A man spoke harshly to Abu Bakr asSiddeeq. Abu Barzah said: Shall I strike his neck? He [Abu Bakr, rebuked him and said: That is not for any one after the Messenger of Allah (ﷺ)."}},{"id":52,"idInBook":52,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، حَدَّثَنَا لَيْثٌ، حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، رَضِيَ اللَّهُ عَنْهَا زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهَا أَخْبَرَتْهُ أَنَّ فَاطِمَةَ بِنْتَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْسَلَتْ إِلَى أَبِي بَكْرٍ الصِّدِّيقِ رَضِيَ اللَّهُ عَنْهُ تَسْأَلُهُ مِيرَاثَهَا مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِمَّا أَفَاءَ اللَّهُ عَلَيْهِ بِالْمَدِينَةِ وَفَدَكَ وَمَا بَقِيَ مِنْ خُمُسِ خَيْبَرَ فَقَالَ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا نُورَثُ مَا تَرَكْنَا صَدَقَةٌ إِنَّمَا يَأْكُلُ آلُ مُحَمَّدٍ فِي هَذَا الْمَالِ وَإِنِّي وَاللَّهِ لَا أُغَيِّرُ شَيْئًا مِنْ صَدَقَةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ حَالِهَا الَّتِي كَانَتْ عَلَيْهَا فِي عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَأَعْمَلَنَّ فِيهَا بِمَا عَمِلَ بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَبَى أَبُو بَكْرٍ أَنْ يَدْفَعَ إِلَى فَاطِمَةَ مِنْهَا شَيْئًا فَوَجَدَتْ فَاطِمَةُ عَلَى أَبِي بَكْرٍ فِي ذَلِكَ فَقَالَ أَبُو بَكْرٍ وَالَّذِي نَفْسِي بِيَدِهِ لَقَرَابَةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَحَبُّ إِلَيَّ أَنْ أَصِلَ مِنْ قَرَابَتِي وَأَمَّا الَّذِي شَجَرَ بَيْنِي وَبَيْنَكُمْ مِنْ هَذِهِ الْأَمْوَالِ فَإِنِّي لَمْ آلُ فِيهَا عَنْ الْحَقِّ وَلَمْ أَتْرُكْ أَمْرًا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصْنَعُهُ فِيهَا إِلَّا صَنَعْتُهُ‏.‏","english":{"narrator":"It was narrated from 'Urwah bin az-Zubair that 'A'ishah the wife of the Prophet 35 told him:","text":"Fatimah the daughter of the Messenger of Allah (ﷺ) sent word to Abu Bakr as-Siddeeq, asking for her inheritance from the Messenger of Allah (ﷺ), of the fai` that Allah had granted to him in Madinah and Fadak, and what was left of the khurnus of Khaibar, Abu Bakr said: The Messenger of Allah (ﷺ) said: `We (Prophets) are not to be inherited from and whatever we leave behind is charity. Rather the family of Muhammad may take their provision from this wealth.` By Allah, I will not change any of the charity of the Messenger of Allah (ﷺ) from how it was at the time of the Messenger of Allah (ﷺ), and I will do the same with it as the Messenger of Allah (ﷺ) did. So Abu Bakr refused to give anything of it to Fatimah, and Fatimah was upset with Abu Bakr because of that. Abu Bakr said; By the One in Whose hand is my soul, the relatives of the Messenger of Allah (ﷺ) are dearer to me than my own relatives. As for the dispute between me and you concerning this wealth, I did not deviate from the truth concerning them and I will not leave anything that I saw the Messenger of Allah (ﷺ) do but I will do it the way he did it."}},{"id":53,"idInBook":53,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا أَبُو كَامِلٍ، حَدَّثَنَا أَبُو عَوَانَةَ، حَدَّثَنَا عُثْمَانُ بْنُ أَبِي زُرْعَةَ، عَنْ عَلِيِّ بْنِ رَبِيعَةَ، عَنْ أَسْمَاءَ بْنِ الْحَكَمِ الْفَزَارِيِّ، قَالَ سَمِعْتُ عَلِيًّا، كَرَّمَ اللَّهُ وَجْهَهُ قَالَ كُنْتُ إِذَا سَمِعْتُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدِيثًا نَفَعَنِي اللَّهُ بِهِ بِمَا شَاءَ أَنْ يَنْفَعَنِي مِنْهُ وَإِذَا حَدَّثَنِي غَيْرُهُ اسْتَحْلَفْتُهُ فَإِذَا حَلَفَ لِي صَدَّقْتُهُ وَحَدَّثَنِي أَبُو بَكْرٍ وَصَدَقَ أَبُو بَكْرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْ عَبْدٍ مُؤْمِنٍ يُذْنِبُ ذَنْبًا فَيَتَوَضَّأُ فَيُحْسِنُ الطُّهُورَ ثُمَّ يُصَلِّي رَكْعَتَيْنِ فَيَسْتَغْفِرُ اللَّهَ تَعَالَى إِلَّا غَفَرَ اللَّهُ لَهُ ثُمَّ تَلَا ‏{‏وَالَّذِينَ إِذَا فَعَلُوا فَاحِشَةً أَوْ ظَلَمُوا أَنْفُسَهُمْ‏}‏‏.‏","english":{"narrator":"It was narrated that Asma' bin  al-Hakam al-Fazari said:","text":"I heard ‘Ali say: If I heard a hadeeth from the Messenger of Allah (ﷺ), Allah benefitted me as He willed thereby. If someone else told me something from him I would ask him to swear, and if he swore I would believe him. Abu Bakr told me - and Abu Bakr told the truth - that he heard the Prophet (ﷺ) say: `There is no believer who commits a sin, then does wudoo` and does it well and prays two rak'ahs and asks Allah, may He be glorified and exalted, for forgiveness but Allah will forgive him.` Then he recited the verse: `And those who, when they have committed Fahishah (illegal sexual intercourse) or wronged themselves...` (Al ‘Imran 3:135)."}},{"id":54,"idInBook":54,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا أَبُو كَامِلٍ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، حَدَّثَنَا ابْنُ شِهَابٍ، عَنْ عُبَيْدِ بْنِ السَّبَّاقِ، عَنْ زَيْدِ بْنِ ثَابِتٍ، قَالَ أَرْسَلَ إِلَيَّ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ مَقْتَلَ أَهْلِ الْيَمَامَةِ فَقَالَ أَبُو بَكْرٍ يَا زَيْدُ بْنَ ثَابِتٍ أَنْتَ غُلَامٌ شَابٌّ عَاقِلٌ لَا نَتَّهِمُكَ قَدْ كُنْتَ تَكْتُبُ الْوَحْيَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَتَتَبَّعْ الْقُرْآنَ فَاجْمَعْهُ‏.‏","english":{"narrator":"It was narrated that Zaid bin Thabit said:","text":"Abu Bakr sent for me when many of the people of al-Yamamah were killed. Abu Bakr said: O Zaid bin Thabit, you are a wise young man and we trust you; you used to write down the Revelation for the Messenger of Allah (ﷺ). Seek out the Qur'an and collect it."}},{"id":55,"idInBook":55,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، رَضِيَ اللَّهُ عَنْهَا أَنَّ فَاطِمَةَ، وَالْعَبَّاسَ أَتَيَا أَبَا بَكْرٍ يَلْتَمِسَانِ مِيرَاثَهُمَا مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُمَا حِينَئِذٍ يَطْلُبَانِ أَرْضَهُ مِنْ فَدَكَ وَسَهْمَهُ مِنْ خَيْبَرَ فَقَالَ لَهُمَا أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا نُورَثُ مَا تَرَكْنَا صَدَقَةٌ وَإِنَّمَا يَأْكُلُ آلُ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي هَذَا الْمَالِ وَإِنِّي وَاللَّهِ لَا أَدَعُ أَمْرًا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصْنَعُهُ فِيهِ إِلَّا صَنَعْتُهُ‏.‏","english":{"narrator":"It was narrated from 'A'ishah that Fatimah and al-'Abbas came to Abu Bakr, seeking their inheritance from the Messenger of Allah (ﷺ). At that time they were seeking his land in Fadak and his share of Khaibar. Abu Bakr said to them:","text":"I heard the Messenger of Allah (ﷺ) say: `We (Prophets) are not to be inherited from and whatever we leave behind is charity. Rather the family of Muhammad; may take their provision from this wealth.` By Allah, I will not leave anything that I saw the Messenger of Allah (ﷺ) do with it but I will do it too."}},{"id":56,"idInBook":56,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا مُوسَى بْنُ دَاوُدَ، حَدَّثَنَا نَافِعٌ يَعْنِي ابْنَ عُمَرَ، عَنْ ابْنِ أَبِي مُلَيْكَةَ، قَالَ قِيلَ لِأَبِي بَكْرٍ رَضِيَ اللَّهُ عَنْهُ يَا خَلِيفَةَ اللَّهِ فَقَالَ أَنَا خَلِيفَةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا رَاضٍ بِهِ وَأَنَا رَاضٍ بِهِ وَأَنَا رَاضٍ‏.‏","english":{"narrator":"It was narrated that Ibn Abi Mulaikah said. It was said to Abu Bakr:","text":"O khaleefah (caliph) of Allah. He said: I am the khaleefah (lit. successor) of the Messenger of Allah (ﷺ) and I am pleased with that."}},{"id":57,"idInBook":57,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا عَفَّانُ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، أَنَّ فَاطِمَةَ، رَضِيَ اللَّهُ عَنْهَا قَالَتْ لِأَبِي بَكْرٍ مَنْ يَرِثُكَ إِذَا مِتَّ قَالَ وَلَدِي وَأَهْلِي قَالَتْ فَمَا لَنَا لَا نَرِثُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ النَّبِيَّ لَا يُورَثُ وَلَكِنِّي أَعُولُ مَنْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعُولُ وَأُنْفِقُ عَلَى مَنْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُنْفِقُ‏.‏","english":{"narrator":"It was narrated from Abu Salamah that Fatimah said to Abu Bakr:","text":"Who will inherit from you if you die? He Said: My children and my wife. She said: Then why can't we inherit from the Prophet (ﷺ). He said: I heard the Prophet (ﷺ) say: `The Prophet is not to be inherited from.” But I will sponsor those whom the Messenger of Allah (ﷺ) used to sponsor and I will spend on those on whom the Messenger of Allah used to spend."}},{"id":58,"idInBook":58,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا عَفَّانُ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا يُونُسُ بْنُ عُبَيْدٍ، عَنْ حُمَيْدِ بْنِ هِلَالٍ، عَنْ عَبْدِ اللَّهِ بْنِ مُطَرِّفِ بْنِ الشِّخِّيرِ، أَنَّهُ حَدَّثَهُمْ عَنْ أَبِي بَرْزَةَ الْأَسْلَمِيِّ، أَنَّهُ قَالَ كُنَّا عِنْدَ أَبِي بَكْرٍ الصِّدِّيقِ رَضِيَ اللَّهُ عَنْهُ فِي عَمَلِهِ فَغَضِبَ عَلَى رَجُلٍ مِنْ الْمُسْلِمِينَ فَاشْتَدَّ غَضَبُهُ عَلَيْهِ جِدًّا فَلَمَّا رَأَيْتُ ذَلِكَ قُلْتُ يَا خَلِيفَةَ رَسُولِ اللَّهِ أَضْرِبُ عُنُقَهُ فَلَمَّا ذَكَرْتُ الْقَتْلَ صَرَفَ عَنْ ذَلِكَ الْحَدِيثِ أَجْمَعَ إِلَى غَيْرِ ذَلِكَ مِنْ النَّحْوِ فَلَمَّا تَفَرَّقْنَا أَرْسَلَ إِلَيَّ بَعْدَ ذَلِكَ أَبُو بَكْرٍ الصِّدِّيقُ رَضِيَ اللَّهُ عَنْهُ فَقَالَ يَا أَبَا بَرْزَةَ مَا قُلْتَ قَالَ وَنَسِيتُ الَّذِي قُلْتُ قُلْتُ ذَكِّرْنِيهِ قَالَ أَمَا تَذْكُرُ مَا قُلْتَ قَالَ قُلْتُ لَا وَاللَّهِ قَالَ أَرَأَيْتَ حِينَ رَأَيْتَنِي غَضِبْتُ عَلَى الرَّجُلِ فَقُلْتَ أَضْرِبُ عُنُقَهُ يَا خَلِيفَةَ رَسُولِ اللَّهِ أَمَا تَذْكُرُ ذَاكَ أَوَكُنْتَ فَاعِلًا ذَاكَ قَالَ قُلْتُ نَعَمْ وَاللَّهِ وَالْآنَ إِنْ أَمَرْتَنِي فَعَلْتُ قَالَ وَيْحَكَ أَوْ وَيْلَكَ إِنَّ تِلْكَ وَاللَّهِ مَا هِيَ لِأَحَدٍ بَعْدَ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ‏.‏","english":{"narrator":"It was narrated from Abu Barzah al-Aslami that he said:","text":"We were with Abu Bakr as-Siddeeq when he was conducting some business of caliphate and he got very angry with one of the Muslims. When I saw that I said: O Khaleefah of the Messenger of Allah, shall I strike his neck? When I mentioned killing him, he changed the subject completely, When we parted, Abu Bakr as Siddeeq sent word to me after that and said: O Abu Barzah, what did you say? I said: I have forgotten what I said; remind me. He said: Don't you remember what you said? I said: No, by Allah. He said: Do you remember, when you saw me get angry with that man, you said: Shall I strike his neck, O khaleefah of the Messenger of Allah? Don't you remember that? would you really have done that? I said: Yes, by Allah. If you order me to do it now, I will do it. He said: Woe to you! By Allah, that is not for anyone after Muhammad (ﷺ)."}},{"id":59,"idInBook":59,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا عَفَّانُ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، قَالَ حَدَّثَنَا ابْنُ أَبِي عَتِيقٍ، عَنْ أَبِيهِ، قَالَ إِنَّ أَبَا بَكْرٍ الصِّدِّيقَ رَضِيَ اللَّهُ عَنْهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ السِّوَاكُ مَطْهَرَةٌ لِلْفَمِ مَرْضَاةٌ لِلرَّبِّ‏.‏","english":{"narrator":"Abu Bakr as-Siddeeq said:","text":"The Messenger of Allah (ﷺ) said: `The siwak is purifying for the mouth and pleasing to the Lord.”"}},{"id":60,"idInBook":60,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا عَفَّانُ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ يَعْلَى بْنِ عَطَاءٍ، قَالَ سَمِعْتُ عَمْرَو بْنَ عَاصِمِ بْنِ عَبْدِ اللَّهِ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ أَبُو بَكْرٍ يَا رَسُولَ اللَّهِ قُلْ لِي شَيْئًا أَقُولُهُ إِذَا أَصْبَحْتُ وَإِذَا أَمْسَيْتُ قَالَ قُلْ اللَّهُمَّ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ وَأَمَرَهُ أَنْ يَقُولَهُ إِذَا أَصْبَحَ وَإِذَا أَمْسَى وَإِذَا أَخَذَ مَضْجَعَهُ‏.‏","english":{"narrator":"Abu Hurairah said:","text":"Abu Bakr said: O Messenger of Allah, tell me something I may say in the morning and in the evening. He said: `Say: 'O Allah, Knower of the unseen and the seen, Creator of the heavens and the earth, Lord and Sovereign of all things, I bear witness that there is no god but You, I seek refuge in You from the evil of my own self and the evil of the Shuitart and the shirk to which he calls.` And he told him to say it in the morning and in the evening and when going to bed."}},{"id":61,"idInBook":61,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يَزِيدَ، حَدَّثَنَا نَافِعُ بْنُ عُمَرَ الْجُمَحِيُّ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي مُلَيْكَةَ، قَالَ قِيلَ لِأَبِي بَكْرٍ رَضِيَ اللَّهُ عَنْهُ يَا خَلِيفَةَ اللَّهِ فَقَالَ بَلْ خَلِيفَةُ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا أَرْضَى بِهِ‏.‏","english":{"narrator":"It was narrated that ‘Abdullah bin Abi Mulaikah said:","text":"It was said to Abu Bakr: O khaleefäh of Allah. He said: Rather slam] the khaleefah (lit successor) of Muhammad (ﷺ), and I am pleased with that,"}},{"id":62,"idInBook":62,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا مُوسَى بْنُ دَاوُدَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُؤَمَّلِ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، قَالَ كَانَ رُبَّمَا سَقَطَ الْخِطَامُ مِنْ يَدِ أَبِي بَكْرٍ الصِّدِّيقِ رَضِيَ اللَّهُ عَنْهُ قَالَ فَيَضْرِبُ بِذِرَاعِ نَاقَتِهِ فَيُنِيخُهَا فَيَأْخُذُهُ قَالَ فَقَالُوا لَهُ أَفَلَا أَمَرْتَنَا نُنَاوِلُكَهُ فَقَالَ إِنَّ حَبِيبِي رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَنِي أَنْ لَا أَسْأَلَ النَّاسَ شَيْئًا‏.‏","english":{"narrator":"It was narrated that Ibn Abi Mulaikah said:","text":"The halter fell from the hand of Abu Bakr as-Siddeeq. He struck the foreleg of his she-camel to make her kneel down, and they said to him: Why did you not tell us to pass it to you? He said: My beloved the Messenger of Allah (ﷺ) instructed me not to ask the people for anything."}},{"id":63,"idInBook":63,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا سُفْيَانُ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ أَبِي عُبَيْدَةَ، عَنْ أَبِي بَكْرٍ، رَضِيَ اللَّهُ عَنْهُ قَالَ قَامَ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ بَعْدَ وَفَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِعَامٍ فَقَالَ قَامَ فِينَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ الْأَوَّلِ فَقَالَ إِنَّ ابْنَ آدَمَ لَمْ يُعْطَ شَيْئًا أَفْضَلَ مِنْ الْعَافِيَةِ فَاسْأَلُوا اللَّهَ الْعَافِيَةَ وَعَلَيْكُمْ بِالصِّدْقِ وَالْبِرِّ فَإِنَّهُمَا فِي الْجَنَّةِ وَإِيَّاكُمْ وَالْكَذِبَ وَالْفُجُورَ فَإِنَّهُمَا فِي النَّارِ‏.‏","english":{"narrator":"It was narrated from Abu 'Ubaidah that Abu Bakr stood up one year after the death of the Messenger of Allah (ﷺ) and said:","text":"The Messenger of Allah (ﷺ) stood among us last year and said: `The son of Adam has not been given anything better than well-being, so ask Allah for well-being. You should be truthful and righteous, for they lead to Paradise, and you should beware of lying and immorality, for they lead to Hell.`"}},{"id":64,"idInBook":64,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يَزِيدَ، قَالَ أَخْبَرَنَا سُفْيَانُ بْنُ حُسَيْنٍ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، عَنْ أَبِي هُرَيْرَةَ، رَضِيَ اللَّهُ عَنْهُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَقُولُوا لَا إِلَهَ إِلَّا اللَّهُ فَإِذَا قَالُوهَا عَصَمُوا مِنِّي دِمَاءَهُمْ وَأَمْوَالَهُمْ إِلَّا بِحَقِّهَا وَحِسَابُهُمْ عَلَى اللَّهِ تَعَالَى قَالَ فَلَمَّا كَانَتْ الرِّدَّةُ قَالَ عُمَرُ لِأَبِي بَكْرٍ رَضِيَ اللَّهُ عَنْهُ تُقَاتِلُهُمْ وَقَدْ سَمِعْتَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ كَذَا وَكَذَا قَالَ فَقَالَ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ وَاللَّهِ لَا أُفَرِّقُ بَيْنَ الصَّلَاةِ وَالزَّكَاةِ وَلَأُقَاتِلَنَّ مَنْ فَرَّقَ بَيْنَهُمَا قَالَ فَقَاتَلْنَا مَعَهُ فَرَأَيْنَا ذَلِكَ رَشَدًا‏.‏","english":{"narrator":"It was narrated from Abu Hurairah that the Prophet (ﷺ) said:","text":"“I have been commanded to fight the people until they say La ilaha illallah, and if they say it then their blood and wealth are safe from me, except in cases dictated by sharee'ah, and their reckoning is with Allah.” When some people apostatized, ʼUmar said to Abu Bakr: Will you fight them when you heard the Messenger of Allah is say such and such? Abu Bakr said: By Allah, I will not separate prayer and zakah, and I shall certainly fight anyone who separates them. So we fought them alongside him and we realised that that was the right thing to do."}},{"id":65,"idInBook":65,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، قَالَ أَخْبَرَنَا إِسْمَاعِيلُ، عَنْ أَبِي بَكْرِ بْنِ أَبِي زُهَيْرٍ، قَالَ أُخْبِرْتُ أَنَّ أَبَا بَكْرٍ قَالَ يَا رَسُولَ اللَّهِ كَيْفَ الصَّلَاحُ بَعْدَ هَذِهِ الْآيَةِ ‏{‏لَيْسَ بِأَمَانِيِّكُمْ وَلَا أَمَانِيِّ أَهْلِ الْكِتَابِ مَنْ يَعْمَلْ سُوءًا يُجْزَ بِهِ‏}‏ فَكُلَّ سُوءٍ عَمِلْنَا جُزِينَا بِهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَفَرَ اللَّهُ لَكَ يَا أَبَا بَكْرٍ أَلَسْتَ تَمْرَضُ أَلَسْتَ تَنْصَبُ أَلَسْتَ تَحْزَنُ أَلَسْتَ تُصِيبُكَ اللَّأْوَاءُ قَالَ بَلَى قَالَ فَهُوَ مَا تُجْزَوْنَ بِهِ‏.‏","english":{"narrator":"It was narrated that Abu Bakr bin Abi Zuhair said:","text":"I was told that Abu Bakr said: O Messenger of Allah, how could we be in a good state after this verse: “It will not be in accordance with your desires (Muslims), nor those of the people of the Scripture (Jews and Christians), whosoever works evil, will have the recompense thereof` fan-Nisa' 4:123]? Will we be punished for every bad deed we do? There Messenger of Allah (ﷺ) said: `May Allah forgive you, O Abu Bakr, do you not fall sick? Do you not get exhausted? Do you not feel sad? Don't calamities befall you?` He said: Of course. He said: `That is the recompense you are given.`"}},{"id":66,"idInBook":66,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنَا ابْنُ أَبِي خَالِدٍ، عَنْ أَبِي بَكْرِ بْنِ أَبِي زُهَيْرٍ، أَظُنُّهُ قَالَ أَبُو بَكْرٍ يَا رَسُولَ اللَّهِ كَيْفَ الصَّلَاحُ بَعْدَ هَذِهِ الْآيَةِ قَالَ يَرْحَمُكَ اللَّهُ يَا أَبَا بَكْرٍ أَلَسْتَ تَمْرَضُ أَلَسْتَ تَحْزَنُ أَلَسْتَ تُصِيبُكَ اللَّأْوَاءُ قَالَ بَلَى قَالَ فَإِنَّ ذَاكَ بِذَاكَ \n\nحَدَّثَنَا يَعْلَى بْنُ عُبَيْدٍ حَدَّثَنَا إِسْمَاعِيلُ عَنْ أَبِي بَكْرٍ الثَّقَفِيِّ قَالَ قَالَ أَبُو بَكْرٍ يَا رَسُولَ اللَّهِ كَيْفَ الصَّلَاحُ بَعْدَ هَذِهِ الْآيَةِ ‏{‏مَنْ يَعْمَلْ سُوءًا يُجْزَ بِهِ‏}‏ فَذَكَرَ الْحَدِيثَ‏.‏","english":{"narrator":"Ibn Abi Khalid told us, from Abu Bakr bin Abi Zuhair - I think he said:","text":"Abu Bakr said: O Messenger of Allah, how could we be in a good state after this verse? He said: `May Allah have mercy on you, O Abu Bakr. Do you not fall sick? Do you not feel sad? Don't calamities befall you? Do you not...?” He said: Of course. He said: `That is for that.\n\nIt was narrated that Abu Bakr ath-Thaqafi said: Abu Bakr said: O Messenger of Allah, how could we be in a good state after this verse: `whosoever works evil, will have the recompense thereof` (an-Nisa' 4:123)?... and he narrated the same Hadeeth"}},{"id":67,"idInBook":67,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا ابْنُ أَبِي خَالِدٍ، عَنْ أَبِي بَكْرِ بْنِ أَبِي زُهَيْرٍ الثَّقَفِيِّ، قَالَ لَمَّا نَزَلَتْ ‏{‏لَيْسَ بِأَمَانِيِّكُمْ وَلَا أَمَانِيِّ أَهْلِ الْكِتَابِ مَنْ يَعْمَلْ سُوءًا يُجْزَ بِهِ‏}‏ قَالَ فَقَالَ أَبُو بَكْرٍ يَا رَسُولَ اللَّهِ إِنَّا لَنُجَازَى بِكُلِّ سُوءٍ نَعْمَلُهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَرْحَمُكَ اللَّهُ يَا أَبَا بَكْرٍ أَلَسْتَ تَنْصَبُ أَلَسْتَ تَحْزَنُ أَلَسْتَ تُصِيبُكَ اللَّأْوَاءُ فَهَذَا مَا تُجْزَوْنَ بِهِ‏.‏","english":{"narrator":"It was narrated that Abu Bakr bin Abi Zuhair ath-Thaqafi said:","text":"When the verse `It will not be in accordance with your desires (Muslims), nor those of the people of the Scripture (Jews and Christians), whosoever works evil, will have the recompense thereof`  was revealed, Abu Bakr to said: O Messenger of Allah, will we receive recompense for every bad deed we do? The Messenger of Allah (ﷺ) said: `May Allah have mercy on you, O Abu Bakr. Do you not become exhausted? Do you not feel sad? Don't calamities befall you? This is the recompense that you receive.”"}},{"id":68,"idInBook":68,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا أَبُو كَامِلٍ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، قَالَ أَخَذْتُ هَذَا الْكِتَابَ مِنْ ثُمَامَةَ بْنِ عَبْدِ اللَّهِ بْنِ أَنَسٍ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ أَبَا بَكْرٍ رَضِيَ اللَّهُ عَنْهُ كَتَبَ لَهُمْ إِنَّ هَذِهِ فَرَائِضُ الصَّدَقَةِ الَّتِي فَرَضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمُسْلِمِينَ الَّتِي أَمَرَ اللَّهُ عَزَّ وَجَلَّ بِهَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَنْ سُئِلَهَا مِنْ الْمُسْلِمِينَ عَلَى وَجْهِهَا فَلْيُعْطِهَا وَمَنْ سُئِلَ فَوْقَ ذَلِكَ فَلَا يُعْطِهِ فِيمَا دُونَ خَمْسٍ وَعِشْرِينَ مِنْ الْإِبِلِ فَفِي كُلِّ خَمْسِ ذَوْدٍ شَاةٌ فَإِذَا بَلَغَتْ خَمْسًا وَعِشْرِينَ فَفِيهَا ابْنَةُ مَخَاضٍ إِلَى خَمْسٍ وَثَلَاثِينَ فَإِنْ لَمْ تَكُنِ ابْنَةُ مَخَاضٍ فَابْنُ لَبُونٍ ذَكَرٌ فَإِذَا بَلَغَتْ سِتَّةً وَثَلَاثِينَ فَفِيهَا ابْنَةُ لَبُونٍ إِلَى خَمْسٍ وَأَرْبَعِينَ فَإِذَا بَلَغَتْ سِتَّةً وَأَرْبَعِينَ فَفِيهَا حِقَّةٌ طَرُوقَةُ الْفَحْلِ إِلَى سِتِّينَ فَإِذَا بَلَغَتْ إِحْدَى وَسِتِّينَ فَفِيهَا جَذَعَةٌ إِلَى خَمْسٍ وَسَبْعِينَ فَإِذَا بَلَغَتْ سِتَّةً وَسَبْعِينَ فَفِيهَا بِنْتَا لَبُونٍ إِلَى تِسْعِينَ فَإِذَا بَلَغَتْ إِحْدَى وَتِسْعِينَ فَفِيهَا حِقَّتَانِ طَرُوقَتَا الْفَحْلِ إِلَى عِشْرِينَ وَمِائَةٍ فَإِنْ زَادَتْ عَلَى عِشْرِينَ وَمِائَةٍ فَفِي كُلِّ أَرْبَعِينَ ابْنَةُ لَبُونٍ وَفِي كُلِّ خَمْسِينَ حِقَّةٌ فَإِذَا تَبَايَنَ أَسْنَانُ الْإِبِلِ فِي فَرَائِضِ الصَّدَقَاتِ فَمَنْ بَلَغَتْ عِنْدَهُ صَدَقَةُ الْجَذَعَةِ وَلَيْسَتْ عِنْدَهُ جَذَعَةٌ وَعِنْدَهُ حِقَّةٌ فَإِنَّهَا تُقْبَلُ مِنْهُ وَيَجْعَلُ مَعَهَا شَاتَيْنِ إِنْ اسْتَيْسَرَتَا لَهُ أَوْ عِشْرِينَ دِرْهَمًا وَمَنْ بَلَغَتْ عِنْدَهُ صَدَقَةُ الْحِقَّةِ وَلَيْسَتْ عِنْدَهُ إِلَّا جَذَعَةٌ فَإِنَّهَا تُقْبَلُ مِنْهُ وَيُعْطِيهِ الْمُصَدِّقُ عِشْرِينَ دِرْهَمًا أَوْ شَاتَيْنِ وَمَنْ بَلَغَتْ عِنْدَهُ صَدَقَةُ الْحِقَّةِ وَلَيْسَتْ عِنْدَهُ وَعِنْدَهُ بِنْتُ لَبُونٍ فَإِنَّهَا تُقْبَلُ مِنْهُ وَيَجْعَلُ مَعَهَا شَاتَيْنِ إِنْ اسْتَيْسَرَتَا لَهُ أَوْ عِشْرِينَ دِرْهَمًا وَمَنْ بَلَغَتْ عِنْدَهُ صَدَقَةُ ابْنَةِ لَبُونٍ وَلَيْسَتْ عِنْدَهُ إِلَّا حِقَّةٌ فَإِنَّهَا تُقْبَلُ مِنْهُ وَيُعْطِيهِ الْمُصَدِّقُ عِشْرِينَ دِرْهَمًا أَوْ شَاتَيْنِ وَمَنْ بَلَغَتْ عِنْدَهُ صَدَقَةُ ابْنَةِ لَبُونٍ وَلَيْسَتْ عِنْدَهُ ابْنَةُ لَبُونٍ وَعِنْدَهُ ابْنَةُ مَخَاضٍ فَإِنَّهَا تُقْبَلُ مِنْهُ وَيَجْعَلُ مَعَهَا شَاتَيْنِ إِنْ اسْتَيْسَرَتَا لَهُ أَوْ عِشْرِينَ دِرْهَمًا وَمَنْ بَلَغَتْ صَدَقَتُهُ بِنْتَ مَخَاضٍ وَلَيْسَ عِنْدَهُ إِلَّا ابْنُ لَبُونٍ ذَكَرٌ فَإِنَّهُ يُقْبَلُ مِنْهُ وَلَيْسَ مَعَهُ شَيْءٌ وَمَنْ لَمْ يَكُنْ عِنْدَهُ إِلَّا أَرْبَعٌ مِنْ الْإِبِلِ فَلَيْسَ فِيهَا شَيْءٌ إِلَّا أَنْ يَشَاءَ رَبُّهَا وَفِي صَدَقَةِ الْغَنَمِ فِي سَائِمَتِهَا إِذَا كَانَتْ أَرْبَعِينَ فَفِيهَا شَاةٌ إِلَى عِشْرِينَ وَمِائَةٍ فَإِنْ زَادَتْ فَفِيهَا شَاتَانِ إِلَى مِائَتَيْنِ فَإِذَا زَادَتْ وَاحِدَةٌ فَفِيهَا ثَلَاثُ شِيَاهٍ إِلَى ثَلَاثِ مِائَةٍ فَإِذَا زَادَتْ فَفِي كُلِّ مِائَةٍ شَاةٌ وَلَا تُؤْخَذُ فِي الصَّدَقَةِ هَرِمَةٌ وَلَا ذَاتُ عَوَارٍ وَلَا تَيْسٌ إِلَّا أَنْ يَشَاءَ الْمُصَدِّقُ وَلَا يُجْمَعُ بَيْنَ مُتَفَرِّقٍ وَلَا يُفَرَّقُ بَيْنَ مُجْتَمِعٍ خَشْيَةَ الصَّدَقَةِ وَمَا كَانَ مِنْ خَلِيطَيْنِ فَإِنَّهُمَا يَتَرَاجَعَانِ بَيْنَهُمَا بِالسَّوِيَّةِ وَإِذَا كَانَتْ سَائِمَةُ الرَّجُلِ نَاقِصَةً مِنْ أَرْبَعِينَ شَاةً وَاحِدَةً فَلَيْسَ فِيهَا شَيْءٌ إِلَّا أَنْ يَشَاءَ رَبُّهَا وَفِي الرِّقَةِ رُبْعُ الْعُشْرِ فَإِذَا لَمْ يَكُنْ الْمَالُ إِلَّا تِسْعِينَ وَمِائَةَ دِرْهَمٍ فَلَيْسَ فِيهَا شَيْءٌ إِلَّا أَنْ يَشَاءَ رَبُّهَا‏.‏","english":{"narrator":"It was narrated from Anas bin Malik that Abu Bakr wrote to thern saying:","text":"These are the types of charity (zakah) that the Messenger of Allah (ﷺ) made obligatory upon the Muslims and which Allah, may He be glorified and exalted, enjoined upon the Messenger of Allah (ﷺ). Whoever among the Muslims is asked to pay it in the proper manner, let him give it; whoever is asked for more than that, let him not give it. For less than twenty-five camels, for each five, one sheep (should be given). If the number reaches twenty-five, then one she-camel in its second year (should be given), up to thirty-five. If there is no she-camel in its second year, then a he-camel in its third year (may be given). If the number reaches thirty-six, then a she-camel in its third year (should be given), up to forty-five. If the number reaches forty-six, then a she-camel in its fourth year that has been bred to a stallion camel should be given, up to sixty, If the number reaches sixty-one, then a she-camel in its fifth year (should be given), up to seventy five. If the number reaches seventy-six, then two she-camels in their second year (should be given), up to ninety. If the number reaches ninety-one, then two she camels in their fourth year that have been bred to a stallion camel should be given, up to one hundred and twenty. If the number is more than one hundred and twenty, then for every forty camels, a she-camel limits third year should be given and for every fifty a she-camel in its fourth year. If the ages of the camels for zakah differ, if what is due is a she-camel in its fifth year but he does not own such a camel, but he has a she-camel in its fourth year, then that will be accepted from him and he should add to it two sheep, if available, or twenty dirhams. If what is due from him is a she-camel in its fourth year and he only has a she camel in its fifth year, it should be accepted from him and the zakat collector should give him back twenty dirhams or two sheep. If what is due from him is a shecamel in its fourth year, but he does not have such a cameland he has a she-camel in its third year, then it should be accepted from him and he should add to it two sheep, is available, or twenty dirhams. If what is due from him is a she camel in its second year, but he only has a he-camel in its third year, then it should be accepted from him and nothing should be added to it. If he has only four camels, no zakah is due unless the owner wants to give it. With regard to zakah on sheep in the pasture, if there are forty sheep, then one sheep is due as zakah, up to one hundred and twenty sheep. of there is one more than that, then two sheep are due, up to two hundred. If there is one more than that then three sheep are due, up to three hundred. If there is one more than that, then for every hundred sheep, one sheep is due No toothless or defective sheep should be taken as zakah and neither should a ram, unless the one who is giving allows that. Separate flocks should not be put together and flocks should not be divided so as to avoid or reduce zakah. If there are two partners [and the zakah-collector comes and takes zakah), they should settle the matter between them on a fair basis. If a man's flock is grazing if it is one less than forty, then no zakah is due on it unless the owner wants to give it. On silver the zakah is one quarter of one tenth; if the wealth is only one hundred and ninety dirhams, then no zakah is due on it unless the owner wants to give it."}},{"id":69,"idInBook":69,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَ أَهْلُ مَكَّةَ يَقُولُونَ أَخَذَ ابْنُ جُرَيْجٍ الصَّلَاةَ مِنْ عَطَاءٍ وَأَخَذَهَا عَطَاءٌ مِنْ ابْنِ الزُّبَيْرِ وَأَخَذَهَا ابْنُ الزُّبَيْرِ مِنْ أَبِي بَكْرٍ وَأَخَذَهَا أَبُو بَكْرٍ مِنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا رَأَيْتُ أَحَدًا أَحْسَنَ صَلَاةً مِنْ ابْنِ جُرَيْجٍ‏.‏","english":{"narrator":"Abdur-Razzaq said:","text":"The people of Makkah say: Ibn Juraij learned the prayer from 'Ata' and `Ata` learned it from Ibn az-Zubair and Ibn az-Zubair learned it from Abu Bakr and Abu Bakr learned it from the Prophet (ﷺ). I have never seen anyone who prays better than Ibn Juraij.\n\nThis is a report praising Ibn Juraij and is not a hadeeth; this was stated by Ahmad Shakir"}},{"id":70,"idInBook":70,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَ أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنِ ابْنِ عُمَرَ، عَنْ عُمَرَ، قَالَ تَأَيَّمَتْ حَفْصَةُ بِنْتُ عُمَرَ مِنْ خُنَيْسٍ أَوْ حُذَيْفَةَ بْنِ حُذَافَةَ شَكَّ عَبْدُ الرَّزَّاقِ وَكَانَ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِمَّنْ شَهِدَ بَدْرًا فَتُوُفِّيَ بِالْمَدِينَةِ قَالَ فَلَقِيتُ عُثْمَانَ بْنَ عَفَّانَ فَعَرَضْتُ عَلَيْهِ حَفْصَةَ فَقُلْتُ إِنْ شِئْتَ أَنْكَحْتُكَ حَفْصَةَ قَالَ سَأَنْظُرُ فِي ذَلِكَ فَلَبِثْتُ لَيَالِيَ فَلَقِيَنِي فَقَالَ مَا أُرِيدُ أَنْ أَتَزَوَّجَ يَوْمِي هَذَا قَالَ عُمَرُ فَلَقِيتُ أَبَا بَكْرٍ رَضِيَ اللَّهُ عَنْهُ فَقُلْتُ إِنْ شِئْتَ أَنْكَحْتُكَ حَفْصَةَ ابْنَةَ عُمَرَ فَلَمْ يَرْجِعْ إِلَيَّ شَيْئًا فَكُنْتُ أَوْجَدَ عَلَيْهِ مِنِّي عَلَى عُثْمَانَ فَلَبِثْتُ لَيَالِيَ فَخَطَبَهَا إِلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَنْكَحْتُهَا إِيَّاهُ فَلَقِيَنِي أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ فَقَالَ لَعَلَّكَ وَجَدْتَ عَلَيَّ حِينَ عَرَضْتَ عَلَيَّ حَفْصَةَ فَلَمْ أَرْجِعْ إِلَيْكَ شَيْئًا قَالَ قُلْتُ نَعَمْ قَالَ فَإِنَّهُ لَمْ يَمْنَعْنِي أَنْ أَرْجِعَ إِلَيْكَ شَيْئًا حِينَ عَرَضْتَهَا عَلَيَّ إِلَّا أَنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَذْكُرُهَا وَلَمْ أَكُنْ لِأُفْشِيَ سِرَّ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَوْ تَرَكَهَا لَنَكَحْتُهَا‏.‏","english":{"narrator":"It was narrated from Salim from Ibn ‘Umar that `Umar said:","text":"Hafsah bint 'Umar became the widow of Khunais or Hudhaifah bin Hudhafah - 'Abdur-Razzaq was not certain. He was one of the Companions of the Prophet (ﷺ) who were present at Badr, and he died in Madinah, I met 'Uthman bin `Affan and offered I Hafsah to him in marriage, I said: If you wish, I will marry Hafsah to you. He said: I will think about it. A few days passed, then he met me and said: I do not want to get married at present. 'Umar said: Then I met Abu Bakr and I said: If you wish, I will marry Hafsah the daughter of ‘Umar to you. He did not give any response to me, and I was more upset with him than with 'Uthman. A few days passed, then the Messenger of Allah (ﷺ) proposed marriage to her and he gave her in marriage to him. Abu Bakr met me and said: Perhaps you felt upset with me when you offered Hafsah to me in marriage and I did not give you any response? I said: Yes. He said: Nothing prevented me from giving you an answer when you offered her to me in marriage except that I heard the Messenger of Allah (ﷺ) mention her and I did not want to disclose the private matters of the Messenger of Allah (ﷺ). If he had not married her, I would have married her."}},{"id":71,"idInBook":71,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا إِسْحَاقُ بْنُ سُلَيْمَانَ، قَالَ سَمِعْتُ الْمُغِيرَةَ بْنَ مُسْلِمٍ أَبَا سَلَمَةَ، عَنْ فَرْقَدٍ السَّبَخِيِّ، عَنْ مُرَّةَ الطَّيِّبِ، عَنْ أَبِي بَكْرٍ الصِّدِّيقِ، رَضِيَ اللَّهُ عَنْهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَدْخُلُ الْجَنَّةَ سَيِّئُ الْمَلَكَةِ فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ أَلَيْسَ أَخْبَرْتَنَا أَنَّ هَذِهِ الْأُمَّةَ أَكْثَرُ الْأُمَمِ مَمْلُوكِينَ وَأَيْتَامًا قَالَ بَلَى فَأَكْرِمُوهُمْ كَرَامَةَ أَوْلَادِكُمْ وَأَطْعِمُوهُمْ مِمَّا تَأْكُلُونَ قَالُوا فَمَا يَنْفَعُنَا فِي الدُّنْيَا يَا رَسُولَ اللَّهِ قَالَ فَرَسٌ صَالِحٌ تَرْتَبِطُهُ تُقَاتِلُ عَلَيْهِ فِي سَبِيلِ اللَّهِ وَمَمْلُوكٌ يَكْفِيكَ فَإِذَا صَلَّى فَهُوَ أَخُوكَ‏.‏","english":{"narrator":"It was narrated that Abu Bakr as Siddeeq said:","text":"The Messenger of Allah (ﷺ) said: “No one who mistreats his slaves will enter Paradise.` Aman said: O Messenger of Allah, didn't you tell us that this ummah is the greatest in numbers of slaves and orphans? He said: `Yes, so treat them kindly as you treat your children and feed them from what you eat.` They said: What could benefit us in this world, O Messenger of Allah? He said: “A good horse which you keep ready for fighting for the sake of Allah and a slave to take care of you. If he prays (becomes Muslim), then he is your brother, if he prays, then he is your brother.”"}},{"id":72,"idInBook":72,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، قَالَ أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي ابْنُ السَّبَّاقِ، قَالَ أَخْبَرَنِي زَيْدُ بْنُ ثَابِتٍ، أَنَّ أَبَا بَكْرٍ، رَضِيَ اللَّهُ عَنْهُ أَرْسَلَ إِلَيْهِ مَقْتَلَ أَهْلِ الْيَمَامَةِ فَإِذَا عُمَرُ عِنْدَهُ فَقَالَ أَبُو بَكْرٍ إِنَّ عُمَرَ أَتَانِي فَقَالَ إِنَّ الْقَتْلَ قَدْ اسْتَحَرَّ بِأَهْلِ الْيَمَامَةِ مِنْ قُرَّاءِ الْقُرْآنِ مِنْ الْمُسْلِمِينَ وَأَنَا أَخْشَى أَنْ يَسْتَحِرَّ الْقَتْلُ بِالْقُرَّاءِ فِي الْمَوَاطِنِ فَيَذْهَبَ قُرْآنٌ كَثِيرٌ لَا يُوعَى وَإِنِّي أَرَى أَنْ تَأْمُرَ بِجَمْعِ الْقُرْآنِ فَقُلْتُ لِعُمَرَ وَكَيْفَ أَفْعَلُ شَيْئًا لَمْ يَفْعَلْهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ هُوَ وَاللَّهِ خَيْرٌ فَلَمْ يَزَلْ يُرَاجِعُنِي فِي ذَلِكَ حَتَّى شَرَحَ اللَّهُ بِذَلِكَ صَدْرِي وَرَأَيْتُ فِيهِ الَّذِي رَأَى عُمَرُ قَالَ زَيْدٌ وَعُمَرُ عِنْدَهُ جَالِسٌ لَا يَتَكَلَّمُ فَقَالَ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ إِنَّكَ شَابٌّ عَاقِلٌ لَا نَتَّهِمُكَ وَقَدْ كُنْتَ تَكْتُبُ الْوَحْيَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاجْمَعْهُ قَالَ زَيْدٌ فَوَاللَّهِ لَوْ كَلَّفُونِي نَقْلَ جَبَلٍ مِنْ الْجِبَالِ مَا كَانَ بِأَثْقَلَ عَلَيَّ مِمَّا أَمَرَنِي بِهِ مِنْ جَمْعِ الْقُرْآنِ فَقُلْتُ كَيْفَ تَفْعَلُونَ شَيْئًا لَمْ يَفْعَلْهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ‏.‏","english":{"narrator":"Ibn as-Sabbaq said that Zaid bin Thabit told him that Abu Bakr sent for him to tell him that a large number of people at al-Yamamah had been killed. He found ʼUmar with him and Abu Bakr said:","text":"‘Umar has come to me and told me that casualties were heavy at al-Yamamah among the Muslims who knew the Qur'an by heart, and I am afraid that more heavy casualties may take place among the Muslims who know the Qur'an by heart on other battlefields and a large part of the Qur’an may be lost. I  think that you [Abu Bakr should issue instructions that the Qur'an be collected. I said to ‘Umar. How can I do anything that the Messenger of Allah (ﷺ) did not do? He said: By Allah, it is a good thing. And he kept urging me to do that until Allah opened my heart to it and I came around to 'Umar's point of view. Zaid said: And ‘Umar was sitting with him, not speaking. Abu Bakr said: You are a wise young man and we trust you. You used to write down the revelation for the Messenger of Allah (ﷺ), so collect it. Zaid said: By Allah, if they had ordered me to move a mountain, that would not have been more difficult for me than what they instructed me to do of collecting the Qur'an. I said: How can you do anything that the Messenger of Allah (ﷺ) did not do?"}},{"id":73,"idInBook":73,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا يَحْيَى بْنُ حَمَّادٍ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنِ الْأَعْمَشِ، عَنْ إِسْمَاعِيلَ بْنِ رَجَاءٍ، عَنْ عُمَيْرٍ، مَوْلَى الْعَبَّاسِ عَنِ ابْنِ عَبَّاسٍ، قَالَ لَمَّا قُبِضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاسْتُخْلِفَ أَبُو بَكْرٍ خَاصَمَ الْعَبَّاسُ عَلِيًّا فِي أَشْيَاءَ تَرَكَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ شَيْءٌ تَرَكَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمْ يُحَرِّكْهُ فَلَا أُحَرِّكُهُ فَلَمَّا اسْتُخْلِفَ عُمَرُ اخْتَصَمَا إِلَيْهِ فَقَالَ شَيْءٌ لَمْ يُحَرِّكْهُ أَبُو بَكْرٍ فَلَسْتُ أُحَرِّكُهُ قَالَ فَلَمَّا اسْتُخْلِفَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ اخْتَصَمَا إِلَيْهِ قَالَ فَأَسْكَتَ عُثْمَانُ وَنَكَسَ رَأْسَهُ قَالَ ابْنُ عَبَّاسٍ فَخَشِيتُ أَنْ يَأْخُذَهُ فَضَرَبْتُ بِيَدِي بَيْنَ كَتِفَيْ الْعَبَّاسِ فَقُلْتُ يَا أَبَتِ أَقْسَمْتُ عَلَيْكَ إِلَّا سَلَّمْتَهُ لِعَلِيٍّ قَالَ فَسَلَّمَهُ لَهُ‏.‏","english":{"narrator":"It was narrated that Ibn 'Abbas said:","text":"When the Messenger of Allah (ﷺ) died and Abu Bakr was appointed as caliph, al-'Abbas disputed with ‘Ali concerning some things that the Messenger of Allah: had left behind. Abu Bakr said: It is something that the Messenger of Allah (ﷺ) left the way it is and I am not going to introduce any changes to it. When 'Umar was appointed as caliph, they referred the dispute to him and he said: It is something that Abu Bakr did not change and I am not going to change it. When 'Uthman was appointed as caliph, they referred the dispute to him and ‘Uthman remained quiet and lowered his head. Ibn 'Abbas said: I was afraid that he (‘Uthman) would take it back so I struck al-'Abbas between his shoulders and said: O my father, I insist that you give it to 'Ali. So he gave it to him."}},{"id":74,"idInBook":74,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا يَحْيَى بْنُ حَمَّادٍ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عَاصِمِ بْنِ كُلَيْبٍ، قَالَ حَدَّثَنِي شَيْخٌ، مِنْ قُرَيْشٍ مِنْ بَنِي تَيْمٍ قَالَ حَدَّثَنِي فُلَانٌ، وَفُلَانٌ، وَقَالَ، فَعَدَّ سِتَّةً أَوْ سَبْعَةً كُلُّهُمْ مِنْ قُرَيْشٍ فِيهِمْ عَبْدُ اللَّهِ بْنُ الزُّبَيْرِ قَالَ بَيْنَا نَحْنُ جُلُوسٌ عِنْدَ عُمَرَ إِذْ دَخَلَ عَلِيٌّ وَالْعَبَّاسُ رَضِيَ اللَّهُ عَنْهُمَا قَدْ ارْتَفَعَتْ أَصْوَاتُهُمَا فَقَالَ عُمَرُ مَهْ يَا عَبَّاسُ قَدْ عَلِمْتُ مَا تَقُولُ تَقُولُ ابْنُ أَخِي وَلِي شَطْرُ الْمَالِ وَقَدْ عَلِمْتُ مَا تَقُولُ يَا عَلِيُّ تَقُولُ ابْنَتُهُ تَحْتِي وَلَهَا شَطْرُ الْمَالِ وَهَذَا مَا كَانَ فِي يَدَيْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَدْ رَأَيْنَا كَيْفَ كَانَ يَصْنَعُ فِيهِ فَوَلِيَهُ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ مِنْ بَعْدِهِ فَعَمِلَ فِيهِ بِعَمَلِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ وَلِيتُهُ مِنْ بَعْدِ أَبِي بَكْرٍ رَضِيَ اللَّهُ عَنْهُ فَأَحْلِفُ بِاللَّهِ لَأَجْهَدَنَّ أَنْ أَعْمَلَ فِيهِ بِعَمَلِ رَسُولِ اللَّهِ وَعَمَلِ أَبِي بَكْرٍ ثُمَّ قَالَ حَدَّثَنِي أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ وَحَلَفَ بِأَنَّهُ لَصَادِقٌ أَنَّهُ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ النَّبِيَّ لَا يُورَثُ وَإِنَّمَا مِيرَاثُهُ فِي فُقَرَاءِ الْمُسْلِمِينَ وَالْمَسَاكِينِ و حَدَّثَنِي أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ وَحَلَفَ بِاللَّهِ إِنَّهُ صَادِقٌ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ النَّبِيَّ لَا يَمُوتُ حَتَّى يَؤُمَّهُ بَعْضُ أُمَّتِهِ وَهَذَا مَا كَانَ فِي يَدَيْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَدْ رَأَيْنَا كَيْفَ كَانَ يَصْنَعُ فِيهِ فَإِنْ شِئْتُمَا أَعْطَيْتُكُمَا لِتَعْمَلَا فِيهِ بِعَمَلِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَمَلِ أَبِي بَكْرٍ حَتَّى أَدْفَعَهُ إِلَيْكُمَا قَالَ فَخَلَوَا ثُمَّ جَاءَا فَقَالَ الْعَبَّاسُ ادْفَعْهُ إِلَى عَلِيٍّ فَإِنِّي قَدْ طِبْتُ نَفْسًا بِهِ لَهُ‏.‏","english":{"narrator":"It was narrated that 'Asim bin Kulaib said:","text":"An old man of Quraish, from Banu Taim, told me: So and so, and So and so told me - and he listed six or seven, all of whom were from Quraish, one of whom was 'Abdullah bin az-Zubair, - and said: Whilst we were sitting with ‘Umar, ‘Ali and al-'Abbas came in, and they had been raising their voices. ‘Umar said: Stop, O'Abbas! I know what you are going to say. You are going to say: He (the Prophet (ﷺ)) is the son of my brother and I should have half of the wealth. And I know what you are going to say, O 'Ali. You are going to say: His daughter is married to me and she should have half of the wealth. This is what the Messenger of Allah (ﷺ) had, and we saw how he managed it. Then Abu Bakr took charge of it after him, and he dealt with it in the same way as the Messenger of Allah (ﷺ) had dealt with it. Then I took charge after Abu Bakr and I swear by Allah that I will strive my best to deal with it as the Messenger of Allah (ﷺ) and Abu Bakr to dealt with it. Then he said: Abu Bakr told me and he swore by Allah that he was telling the truth, that he heard the Prophet (ﷺ) say: `The Prophet is not to be inherited from; rather his estate is to go to the poor and needy Muslims.` And Abu Bakr told me and swore by Allah that he was telling the truth, that the Prophet (ﷺ) Said: 'No Prophet dies until he has been led in prayer by one of his ummah.` This is what was in the possession of the Messenger of Allah (ﷺ) and we saw how he dealt with it. If you wish, I will give it to you to manage it in the same way as the Messenger of Al!ah (ﷺ) and Abu Bakr did, so that I can put it under your control. They discussed it privately, then they came and al-'Abbas said: Give it to ‘Ali, for I am happy for him to take control of it."}},{"id":75,"idInBook":75,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ عَطَاءٍ، قَالَ أَخْبَرَنَا مُحَمَّدُ بْنُ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ فَاطِمَةَ، رَضِيَ اللَّهُ عَنْهَا جَاءَتْ أَبَا بَكْرٍ وَعُمَرَ رَضِيَ اللَّهُ عَنْهُمَا تَطْلُبُ مِيرَاثَهَا مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَا إِنَّا سَمِعْنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنِّي لَا أُورَثُ‏.‏","english":{"narrator":"It was narrated from Abu Hurairah that Fatimah came to Abu Bakr and 'Umar to ask for her inheritance from the Messenger of Allah (ﷺ). They said:","text":"We heard the Messenger of Allah (ﷺ) say: “I am not to be inherited from.`"}},{"id":76,"idInBook":76,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ، قَالَ حَدَّثَنَا عِيسَى يَعْنِي ابْنَ الْمُسَيَّبِ، عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ، قَالَ إِنِّي لَجَالِسٌ عِنْدَ أَبِي بَكْرٍ الصِّدِّيقِ رَضِيَ اللَّهُ عَنْهُ خَلِيفَةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْدَ وَفَاةِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِشَهْرٍ فَذَكَرَ قِصَّةً فَنُودِيَ فِي النَّاسِ أَنَّ الصَّلَاةَ جَامِعَةٌ وَهِيَ أَوَّلُ صَلَاةٍ فِي الْمُسْلِمِينَ نُودِيَ بِهَا إِنَّ الصَّلَاةَ جَامِعَةٌ فَاجْتَمَعَ النَّاسُ فَصَعِدَ الْمِنْبَرَ شَيْئًا صُنِعَ لَهُ كَانَ يَخْطُبُ عَلَيْهِ وَهِيَ أَوَّلُ خُطْبَةٍ خَطَبَهَا فِي الْإِسْلَامِ قَالَ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ يَا أَيُّهَا النَّاسُ وَلَوَدِدْتُ أَنَّ هَذَا كَفَانِيهِ غَيْرِي وَلَئِنْ أَخَذْتُمُونِي بِسُنَّةِ نَبِيِّكُمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا أُطِيقُهَا إِنْ كَانَ لَمَعْصُومًا مِنْ الشَّيْطَانِ وَإِنْ كَانَ لَيَنْزِلُ عَلَيْهِ الْوَحْيُ مِنْ السَّمَاءِ‏.‏","english":{"narrator":"It was narrated that Qais bin Abi Hazim said:","text":"I was sitting with Abu Bakr as-Siddeeq, the successor of the Messenger of Allah (ﷺ), one month after the death of the Prophet (ﷺ) and he was telling a story, then the call went out among the people, `As-salatu jami'ah (prayer is about to begin),` and it was the first time that this call of `as-salatu jami'ah` went out to the people. The people gathered and he ascended the minbar, which was something that was made for him to deliver speeches, and it was the first speech he gave in Islam. He praised and glorified Allah, then he said: O People, I wish that someone else could have taken care of this for me, for if you compare my way to the way of your Prophet (ﷺ), I cannot be like him, for he was protected from the shaitan and the revelation used to come to him from heaven."}},{"id":77,"idInBook":77,"chapterId":1,"bookId":8,"arabic":"حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ، حَدَّثَنَا شَيْبَانُ، عَنْ لَيْثٍ، عَنْ مُجَاهِدٍ، قَالَ قَالَ أَبُو بَكْرٍ الصِّدِّيقُ رَضِيَ اللَّهُ عَنْهُ أَمَرَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ أَقُولَ إِذَا أَصْبَحْتُ وَإِذَا أَمْسَيْتُ وَإِذَا أَخَذْتُ مَضْجَعِي مِنْ اللَّيْلِ اللَّهُمَّ فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ أَنْتَ رَبُّ كُلِّ شَيْءٍ وَمَلِيكُهُ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ وَحْدَكَ لَا شَرِيكَ لَكَ وَأَنَّ مُحَمَّدًا عَبْدُكَ وَرَسُولُكَ أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي وَشَرِّ الشَّيْطَانِ وَشِرْكِهِ وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءًا أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ","english":{"narrator":"It was narrated that Mujahid said:","text":"Abu Bakr as-Siddeeq said: The Messenger of Allah (ﷺ) commanded me to say, in the morning, in the evening and when I went to bed at night: `O Allah, Creator of the heavens and the earth. Knower of the unseen and the seen. You are the Lord and Sovereign of all things. I bear witness that there is no god but You alone with no partner or associate, and that Muhammad is Your slave and Your Messenger. I seek refuge in You from the evil of my own self and the evil of the shaitan and the shirk to which he calls, and lest I wrong myself or wrong another Muslim.`"}}],"chapter":{"id":1,"bookId":8,"arabic":"مُسْنَدُ أَبِي بَكْرٍ الصِّدِّيقِ رَضِيَ اللَّهُ عَنْهُ","english":"Musnad Abu Bakr as-Siddiq (ra)"}}