{"metadata":{"length":8,"arabic":{"title":"مسند الإمام أحمد بن حنبل","author":"الإمام أحمد بن حنبل","introduction":"حَدِيثُ السَّقِيفَةِ"},"english":{"title":"Musnad Ahmad ibn Hanbal","author":"Imam Ahmad ibn Hanbal","introduction":"The Hadeeth of Saqeefah"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":3,"bookId":8,"arabic":"حَدَّثَنَا إِسْحَاقُ بْنُ عِيسَى الطَّبَّاعُ، حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، حَدَّثَنِي ابْنُ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، أَنَّ ابْنَ عَبَّاسٍ، أَخْبَرَهُ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ عَوْفٍ رَجَعَ إِلَى رَحْلِهِ قَالَ ابْنُ عَبَّاسٍ وَكُنْتُ أُقْرِئُ عَبْدَ الرَّحْمَنِ بْنَ عَوْفٍ فَوَجَدَنِي وَأَنَا أَنْتَظِرُهُ، وَذَلِكَ، بِمِنًى فِي آخِرِ حَجَّةٍ حَجَّهَا عُمَرُ بْنُ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ قَالَ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ إِنَّ رَجُلًا أَتَى عُمَرَ بْنَ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ فَقَالَ إِنَّ فُلَانًا يَقُولُ لَوْ قَدْ مَاتَ عُمَرُ رَضِيَ اللَّهُ عَنْهُ بَايَعْتُ فُلَانًا فَقَالَ عُمَرُ رَضِيَ اللَّهُ عَنْهُ إِنِّي قَائِمٌ الْعَشِيَّةَ فِي النَّاسِ فَمُحَذِّرُهُمْ هَؤُلَاءِ الرَّهْطَ الَّذِينَ يُرِيدُونَ أَنْ يَغْصِبُوهُمْ أَمْرَهُمْ قَالَ عَبْدُ الرَّحْمَنِ فَقُلْتُ يَا أَمِيرَ الْمُؤْمِنِينَ لَا تَفْعَلْ فَإِنَّ الْمَوْسِمَ يَجْمَعُ رَعَاعَ النَّاسِ وَغَوْغَاءَهُمْ وَإِنَّهُمْ الَّذِينَ يَغْلِبُونَ عَلَى مَجْلِسِكَ إِذَا قُمْتَ فِي النَّاسِ فَأَخْشَى أَنْ تَقُولَ مَقَالَةً يَطِيرُ بِهَا أُولَئِكَ فَلَا يَعُوهَا وَلَا يَضَعُوهَا عَلَى مَوَاضِعِهَا وَلَكِنْ حَتَّى تَقْدَمَ الْمَدِينَةَ فَإِنَّهَا دَارُ الْهِجْرَةِ وَالسُّنَّةِ وَتَخْلُصَ بِعُلَمَاءِ النَّاسِ وَأَشْرَافِهِمْ فَتَقُولَ مَا قُلْتَ مُتَمَكِّنًا فَيَعُونَ مَقَالَتَكَ وَيَضَعُونَهَا مَوَاضِعَهَا فَقَالَ عُمَرُ رَضِيَ اللَّهُ عَنْهُ لَئِنْ قَدِمْتُ الْمَدِينَةَ سَالِمًا صَالِحًا لَأُكَلِّمَنَّ بِهَا النَّاسَ فِي أَوَّلِ مَقَامٍ أَقُومُهُ فَلَمَّا قَدِمْنَا الْمَدِينَةَ فِي عَقِبِ ذِي الْحِجَّةِ وَكَانَ يَوْمَ الْجُمُعَةِ عَجَّلْتُ الرَّوَاحَ صَكَّةَ الْأَعْمَى فَقُلْتُ لِمَالِكٍ وَمَا صَكَّةُ الْأَعْمَى قَالَ إِنَّهُ لَا يُبَالِي أَيَّ سَاعَةٍ خَرَجَ لَا يَعْرِفُ الْحَرَّ وَالْبَرْدَ وَنَحْوَ هَذَا فَوَجَدْتُ سَعِيدَ بْنَ زَيْدٍ عِنْدَ رُكْنِ الْمِنْبَرِ الْأَيْمَنِ قَدْ سَبَقَنِي فَجَلَسْتُ حِذَاءَهُ تَحُكُّ رُكْبَتِي رُكْبَتَهُ فَلَمْ أَنْشَبْ أَنْ طَلَعَ عُمَرُ رَضِيَ اللَّهُ عَنْهُ فَلَمَّا رَأَيْتُهُ قُلْتُ لَيَقُولَنَّ الْعَشِيَّةَ عَلَى هَذَا الْمِنْبَرِ مَقَالَةً مَا قَالَهَا عَلَيْهِ أَحَدٌ قَبْلَهُ قَالَ فَأَنْكَرَ سَعِيدُ بْنُ زَيْدٍ ذَلِكَ فَقَالَ مَا عَسَيْتَ أَنْ يَقُولَ مَا لَمْ يَقُلْ أَحَدٌ فَجَلَسَ عُمَرُ رَضِيَ اللَّهُ عَنْهُ عَلَى الْمِنْبَرِ فَلَمَّا سَكَتَ الْمُؤَذِّنُ قَامَ فَأَثْنَى عَلَى اللَّهِ بِمَا هُوَ أَهْلُهُ ثُمَّ قَالَ أَمَّا بَعْدُ أَيُّهَا النَّاسُ فَإِنِّي قَائِلٌ مَقَالَةً قَدْ قُدِّرَ لِي أَنْ أَقُولَهَا لَا أَدْرِي لَعَلَّهَا بَيْنَ يَدَيْ أَجَلِي فَمَنْ وَعَاهَا وَعَقَلَهَا فَلْيُحَدِّثْ بِهَا حَيْثُ انْتَهَتْ بِهِ رَاحِلَتُهُ وَمَنْ لَمْ يَعِهَا فَلَا أُحِلُّ لَهُ أَنْ يَكْذِبَ عَلَيَّ إِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى بَعَثَ مُحَمَّدًا صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْحَقِّ وَأَنْزَلَ عَلَيْهِ الْكِتَابَ وَكَانَ مِمَّا أَنْزَلَ عَلَيْهِ آيَةُ الرَّجْمِ فَقَرَأْنَاهَا وَوَعَيْنَاهَا وَرَجَمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرَجَمْنَا بَعْدَهُ فَأَخْشَى إِنْ طَالَ بِالنَّاسِ زَمَانٌ أَنْ يَقُولَ قَائِلٌ لَا نَجِدُ آيَةَ الرَّجْمِ فِي كِتَابِ اللَّهِ عَزَّ وَجَلَّ فَيَضِلُّوا بِتَرْكِ فَرِيضَةٍ قَدْ أَنْزَلَهَا اللَّهُ عَزَّ وَجَلَّ فَالرَّجْمُ فِي كِتَابِ اللَّهِ حَقٌّ عَلَى مَنْ زَنَى إِذَا أُحْصِنَ مِنْ الرِّجَالِ وَالنِّسَاءِ إِذَا قَامَتْ الْبَيِّنَةُ أَوْ الْحَبَلُ أَوْ الِاعْتِرَافُ أَلَا وَإِنَّا قَدْ كُنَّا نَقْرَأُ لَا تَرْغَبُوا عَنْ آبَائِكُمْ فَإِنَّ كُفْرًا بِكُمْ أَنْ تَرْغَبُوا عَنْ آبَائِكُمْ أَلَا وَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تُطْرُونِي كَمَا أُطْرِيَ عِيسَى ابْنُ مَرْيَمَ عَلَيْهِ السَّلَام فَإِنَّمَا أَنَا عَبْدُ اللَّهِ فَقُولُوا عَبْدُ اللَّهِ وَرَسُولُهُ وَقَدْ بَلَغَنِي أَنَّ قَائِلًا مِنْكُمْ يَقُولُ لَوْ قَدْ مَاتَ عُمَرُ رَضِيَ اللَّهُ عَنْهُ بَايَعْتُ فُلَانًا فَلَا يَغْتَرَّنَّ امْرُؤٌ أَنْ يَقُولَ إِنَّ بَيْعَةَ أَبِي بَكْرٍ رَضِيَ اللَّهُ عَنْهُ كَانَتْ فَلْتَةً أَلَا وَإِنَّهَا كَانَتْ كَذَلِكَ أَلَا وَإِنَّ اللَّهَ عَزَّ وَجَلَّ وَقَى شَرَّهَا وَلَيْسَ فِيكُمْ الْيَوْمَ مَنْ تُقْطَعُ إِلَيْهِ الْأَعْنَاقُ مِثْلُ أَبِي بَكْرٍ رَضِيَ اللَّهُ عَنْهُ أَلَا وَإِنَّهُ كَانَ مِنْ خَبَرِنَا حِينَ تُوُفِّيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ عَلِيًّا وَالزُّبَيْرَ وَمَنْ كَانَ مَعَهُمَا تَخَلَّفُوا فِي بَيْتِ فَاطِمَةَ رَضِيَ اللَّهُ عَنْهَا بِنْتِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَتَخَلَّفَتْ عَنَّا الْأَنْصَارُ بِأَجْمَعِهَا فِي سَقِيفَةِ بَنِي سَاعِدَةَ وَاجْتَمَعَ الْمُهَاجِرُونَ إِلَى أَبِي بَكْرٍ رَضِيَ اللَّهُ عَنْهُ فَقُلْتُ لَهُ يَا أَبَا بَكْرٍ انْطَلِقْ بِنَا إِلَى إِخْوَانِنَا مِنْ الْأَنْصَارِ فَانْطَلَقْنَا نَؤُمُّهُمْ حَتَّى لَقِيَنَا رَجُلَانِ صَالِحَانِ فَذَكَرَا لَنَا الَّذِي صَنَعَ الْقَوْمُ فَقَالَا أَيْنَ تُرِيدُونَ يَا مَعْشَرَ الْمُهَاجِرِينَ فَقُلْتُ نُرِيدُ إِخْوَانَنَا هَؤُلَاءِ مِنْ الْأَنْصَارِ فَقَالَا لَا عَلَيْكُمْ أَنْ لَا تَقْرَبُوهُمْ وَاقْضُوا أَمْرَكُمْ يَا مَعْشَرَ الْمُهَاجِرِينَ فَقُلْتُ وَاللَّهِ لَنَأْتِيَنَّهُمْ فَانْطَلَقْنَا حَتَّى جِئْنَاهُمْ فِي سَقِيفَةِ بَنِي سَاعِدَةَ فَإِذَا هُمْ مُجْتَمِعُونَ وَإِذَا بَيْنَ ظَهْرَانَيْهِمْ رَجُلٌ مُزَمَّلٌ فَقُلْتُ مَنْ هَذَا فَقَالُوا سَعْدُ بْنُ عُبَادَةَ فَقُلْتُ مَا لَهُ قَالُوا وَجِعٌ فَلَمَّا جَلَسْنَا قَامَ خَطِيبُهُمْ فَأَثْنَى عَلَى اللَّهِ عَزَّ وَجَلَّ بِمَا هُوَ أَهْلُهُ وَقَالَ أَمَّا بَعْدُ فَنَحْنُ أَنْصَارُ اللَّهِ عَزَّ وَجَلَّ وَكَتِيبَةُ الْإِسْلَامِ وَأَنْتُمْ يَا مَعْشَرَ الْمُهَاجِرِينَ رَهْطٌ مِنَّا وَقَدْ دَفَّتْ دَافَّةٌ مِنْكُمْ يُرِيدُونَ أَنْ يَخْزِلُونَا مِنْ أَصْلِنَا وَيَحْضُنُونَا مِنْ الْأَمْرِ فَلَمَّا سَكَتَ أَرَدْتُ أَنْ أَتَكَلَّمَ وَكُنْتُ قَدْ زَوَّرْتُ مَقَالَةً أَعْجَبَتْنِي أَرَدْتُ أَنْ أَقُولَهَا بَيْنَ يَدَيْ أَبِي بَكْرٍ رَضِيَ اللَّهُ عَنْهُ وَقَدْ كُنْتُ أُدَارِي مِنْهُ بَعْضَ الْحَدِّ وَهُوَ كَانَ أَحْلَمَ مِنِّي وَأَوْقَرَ فَقَالَ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ عَلَى رِسْلِكَ فَكَرِهْتُ أَنْ أُغْضِبَهُ وَكَانَ أَعْلَمَ مِنِّي وَأَوْقَرَ وَاللَّهِ مَا تَرَكَ مِنْ كَلِمَةٍ أَعْجَبَتْنِي فِي تَزْوِيرِي إِلَّا قَالَهَا فِي بَدِيهَتِهِ وَأَفْضَلَ حَتَّى سَكَتَ فَقَالَ أَمَّا بَعْدُ فَمَا ذَكَرْتُمْ مِنْ خَيْرٍ فَأَنْتُمْ أَهْلُهُ وَلَمْ تَعْرِفْ الْعَرَبُ هَذَا الْأَمْرَ إِلَّا لِهَذَا الْحَيِّ مِنْ قُرَيْشٍ هُمْ أَوْسَطُ الْعَرَبِ نَسَبًا وَدَارًا وَقَدْ رَضِيتُ لَكُمْ أَحَدَ هَذَيْنِ الرَّجُلَيْنِ أَيَّهُمَا شِئْتُمْ وَأَخَذَ بِيَدِي وَبِيَدِ أَبِي عُبَيْدَةَ بْنِ الْجَرَّاحِ فَلَمْ أَكْرَهْ مِمَّا قَالَ غَيْرَهَا وَكَانَ وَاللَّهِ أَنْ أُقَدَّمَ فَتُضْرَبَ عُنُقِي لَا يُقَرِّبُنِي ذَلِكَ إِلَى إِثْمٍ أَحَبَّ إِلَيَّ مِنْ أَنْ أَتَأَمَّرَ عَلَى قَوْمٍ فِيهِمْ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ إِلَّا أَنْ تَغَيَّرَ نَفْسِي عِنْدَ الْمَوْتِ فَقَالَ قَائِلٌ مِنْ الْأَنْصَارِ أَنَا جُذَيْلُهَا الْمُحَكَّكُ وَعُذَيْقُهَا الْمُرَجَّبُ مِنَّا أَمِيرٌ وَمِنْكُمْ أَمِيرٌ يَا مَعْشَرَ قُرَيْشٍ فَقُلْتُ لِمَالِكٍ مَا مَعْنَى أَنَا جُذَيْلُهَا الْمُحَكَّكُ وَعُذَيْقُهَا الْمُرَجَّبُ قَالَ كَأَنَّهُ يَقُولُ أَنَا دَاهِيَتُهَا قَالَ وَكَثُرَ اللَّغَطُ وَارْتَفَعَتْ الْأَصْوَاتُ حَتَّى خَشِيتُ الِاخْتِلَافَ فَقُلْتُ ابْسُطْ يَدَكَ يَا أَبَا بَكْرٍ فَبَسَطَ يَدَهُ فَبَايَعْتُهُ وَبَايَعَهُ الْمُهَاجِرُونَ ثُمَّ بَايَعَهُ الْأَنْصَارُ وَنَزَوْنَا عَلَى سَعْدِ بْنِ عُبَادَةَ فَقَالَ قَائِلٌ مِنْهُمْ قَتَلْتُمْ سَعْدًا فَقُلْتُ قَتَلَ اللَّهُ سَعْدًا وَقَالَ عُمَرُ رَضِيَ اللَّهُ عَنْهُ أَمَا وَاللَّهِ مَا وَجَدْنَا فِيمَا حَضَرْنَا أَمْرًا هُوَ أَقْوَى مِنْ مُبَايَعَةِ أَبِي بَكْرٍ رَضِيَ اللَّهُ عَنْهُ خَشِينَا إِنْ فَارَقْنَا الْقَوْمَ وَلَمْ تَكُنْ بَيْعَةٌ أَنْ يُحْدِثُوا بَعْدَنَا بَيْعَةً فَإِمَّا أَنْ نُتَابِعَهُمْ عَلَى مَا لَا نَرْضَى وَإِمَّا أَنْ نُخَالِفَهُمْ فَيَكُونَ فِيهِ فَسَادٌ فَمَنْ بَايَعَ أَمِيرًا عَنْ غَيْرِ مَشُورَةِ الْمُسْلِمِينَ فَلَا بَيْعَةَ لَهُ وَلَا بَيْعَةَ لِلَّذِي بَايَعَهُ تَغِرَّةً أَنْ يُقْتَلَا قَالَ مَالِكٌ وَأَخْبَرَنِي ابْنُ شِهَابٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ أَنَّ الرَّجُلَيْنِ اللَّذَيْنِ لَقِيَاهُمَا عُوَيْمِرُ بْنُ سَاعِدَةَ وَمَعْنُ بْنُ عَدِيٍّ قَالَ ابْنُ شِهَابٍ وَأَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ أَنَّ الَّذِي قَالَ أَنَا جُذَيْلُهَا الْمُحَكَّكُ وَعُذَيْقُهَا الْمُرَجَّبُ الْحُبَابُ بْنُ الْمُنْذِرِ‏.‏","english":{"narrator":"It was narrated from `Ubaidullah bin ‘Abdullah bin `Utbah bin Mas`ood that Ibn `Abbas told him that ‘AbdurRahman bin ‘Awf went back to where he had halted. Ibn `Abbas said:","text":"I used to recite to ‘AbdurRahman bin ‘Awf, and he found me waiting for him. That was in Mina during the last Hajj performed by `Umar bin al-Khattab (رضي الله عنه) Abdur-Rahman bin `Awf said: A man came to `Umar bin al-Khattab and said: So and so is saying: If `Umar (رضي الله عنه) dies, I will swear allegiance to So and so. ʼUmar (رضي الله عنه) said: I will stand before the people today and warn them against these people who want to deprive them of their rights, `Abdur-Rahman said: I said: O Ameer al-Mu`mineen, do not do that, for the Hajj season brings together the riffraff and rabble among the people, and most of the people who gather around and listen to you will be of that type. Is you stand before the people, I am afraid that you will say something that they will spread and not understand it properly or interpret it properly. Rather wait until you come to Madinah, for it is the land of Hijrah and the Sunnah, and you will meet the most knowledgeable and noble people there, and you can say what you want to say with confidence; they wilt understand what you say and will interpret it correctly, `Umar (رضي الله عنه) said: If I reach Madinah safe and sound, I shall certainly talk to the people there in the first speech I deliver. When we came to Madinah at the end of Dhul-I-Iijah, it was a Friday. I set out early, ‘Umar did not care at what time he went out, because he did not pay attention to heat and cold and so on. I found Sa`eed bin Zaid at the right-hand corner of the minbar, he had got there before me. I sat down next to him, with my knee touching his knee, and it was not long before `Umar (رضي الله عنه)came. When I saw him, I said: He will certainly speak today on this minbar and say something that no one ever heard before. Sa`eed bin Zaid objected to that and said: What do you think he will say that no one said before? `Umar (رضي الله عنه)sat on the minbar, and when the mu`dhdhin fell silent, he stood up and praised and glorified Allah as He deserves, then he said: To proceed o people, I am going to tell you something that it has been decreed I should say. I do not know, perhaps it may signal my death. So whoever understands it and remembers it, let him narrate it to others wherever his mount takes him; whoever does not understand il, it is not permissible for him to tell lies about me. Allah, may He be blessed and exalted, sent Muhammad (ﷺ) with the truth and revealed the Book to him; among the things that were revealed to him was the verse of stoning  a ruler from among us and a ruler from among you, O Quraish. - I the narrator said to Malik; What does ‘I am the post on which the cainc! with a skin disease scratches itself and I am like a high class palm tree` mean? He said:It is as if he is saying, I am the smart one who has the answer. - Then there was a great deal of clamour and raised voices, to such an extent that I feared there would be a conflict, so I said: Hold out your hand, O Abu Bakr. So he held out his hand and I swore allegiance to him, and the Muhajireen swore allegiance to him, then the Ansar swore allegiance to him. Thus we surrounded Sa`d bin ‘Ubadah. One of them said: You have killed Sa`d i said: May Allah kill Sa’d! And `Umar (رضي الله عنه) said: By Allah, we never encountered any problem greater than the swearing of allegiance to Abu Bakr (رضي الله عنه) . We were afraid that if we left the people without having sworn allegiance to anyone, they might swear allegiance after we were gone, so we would either follow in their footsteps and swear allegiance to someone we were not pleased with, or we would disagree with them and that would cause trouble. If anyone swears allegiance to a leader without consulting the Muslims, there is no allegiance for him and no allegiance to the one who swore allegiance to him, lest both of them be killed. Malik said: Ibn Shihab told me, from `Urwah bin az-Zubair, that the men whom they met were `Uwaim bin Sa`idah and Ma`n bin `Adiyy. Ibn Shihab said. Sa`eed bin al-Musayyab told me that the one who said, I am the post on which the camel with a skin disease scratches itself and I am like a high class palm tree, was al-lubab bin al-Mundhir."}},{"id":2,"idInBook":2,"chapterId":3,"bookId":8,"arabic":"حَدَّثَنَا إِسْحَاقُ بْنُ عِيسَى، أَخْبَرَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَا أُخْبِرُكُمْ بِخَيْرِ دُورِ الْأَنْصَارِ بَنِي النَّجَّارِ ثُمَّ بَنِي عَبْدِ الْأَشْهَلِ ثُمَّ بَلْحَارِثِ بْنِ الْخَزْرَجِ ثُمَّ بَنِي سَاعِدَةَ وَقَالَ فِي كُلِّ دُورِ الْأَنْصَارِ خَيْرٌ‏.‏","english":{"narrator":"It was narrated from Yahya bin Sa`eed that he heard Anas bin Malik say:","text":"The Messenger of Allah (ﷺ)  said: “Shall I not tell you of the best tribe of the Ansar? Banun-Najjar, then Banu `Abdul Ashhal, then Banul-Harith bin al-Khazraj. then Banu Sa`idah.` and he said: `In each tribe of the Ansar there is goodness.”"}},{"id":3,"idInBook":3,"chapterId":3,"bookId":8,"arabic":"حَدَّثَنَا إِسْحَاقُ بْنُ عِيسَى، حَدَّثَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، رَضِيَ اللَّهُ عَنْهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمُتَبَايِعَانِ بِالْخِيَارِ مَا لَمْ يَتَفَرَّقَا أَوْ يَكُونُ الْبَيْعُ خِيَارًا‏.‏","english":{"narrator":"It was narrated that Ibn `Umar (رضي الله عنه) said:","text":"The Messenger of Allah   (ﷺ) said: “The two parties to a transaction have the option (of cancelling it) so long as they have not parted or there is a condition which gives the option to cancel.`"}},{"id":4,"idInBook":4,"chapterId":3,"bookId":8,"arabic":"حَدَّثَنَا إِسْحَاقُ بْنُ عِيسَى، أَنْبَأَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ حَبَلِ الْحَبَلَةِ‏.‏","english":{"narrator":"","text":"It was narrated from Ibn `Umar that  the Messenger of Allah (ﷺ) forbade selling the offspring of the offspring that is still in the womb of a camel."}},{"id":5,"idInBook":5,"chapterId":3,"bookId":8,"arabic":"حَدَّثَنَا إِسْحَاقُ بْنُ عِيسَى، أَنْبَأَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، رَضِيَ اللَّهُ عَنْهُ قَالَ كُنَّا نَتَبَايَعُ الطَّعَامَ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَيَبْعَثُ عَلَيْنَا مَنْ يَأْمُرُنَا بِنَقْلِهِ مِنْ الْمَكَانِ الَّذِي ابْتَعْنَاهُ فِيهِ إِلَى مَكَانٍ سِوَاهُ قَبْلَ أَنْ نَبِيعَهُ‏.‏","english":{"narrator":"It was narrated that Ibn `Umar (رضي الله عنه) said:","text":"We used to buy and sell foodstuff at the time of the Messenger of Allah (ﷺ), and he would send someone to tell us to transfer the food from the place we have bought it to another place before selling it."}},{"id":6,"idInBook":6,"chapterId":3,"bookId":8,"arabic":"حَدَّثَنَا إِسْحَاقُ بْنُ عِيسَى، أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، رَضِيَ اللَّهُ عَنْهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ ابْتَاعَ طَعَامًا فَلَا يَبِعْهُ حَتَّى يَسْتَوْفِيَهُ‏.‏","english":{"narrator":"It was narrated that Ibn `Umar (رضي الله عنه) said:","text":"The Messenger of Allah        (ﷺ)said: “Whoever buys foodstuff should not sell it until he takes possession of all of it.”"}},{"id":7,"idInBook":7,"chapterId":3,"bookId":8,"arabic":"حَدَّثَنَا إِسْحَاقُ بْنُ عِيسَى، أَنْبَأَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَعْتَقَ شِرْكًا لَهُ فِي عَبْدٍ فَكَانَ لَهُ مَا يَبْلُغُ ثَمَنَ الْعَبْدِ فَإِنَّهُ يُقَوَّمُ قِيمَةَ عَدْلٍ فَيُعْطَى شُرَكَاؤُهُ حَقَّهُمْ وَعَتَقَ عَلَيْهِ الْعَبْدَ وَإِلَّا فَقَدْ أَعْتَقَ مَا أَعْتَقَ‏.‏","english":{"narrator":"It was narrated from Ibn `Umar (رضي الله عنه) that the Messenger of Allah         (ﷺ) said:","text":"“If a person frees his share of a slave, and has enough Money to pay the full price of the slave, a fair price should be worked out for the slave, and his partners should be given their shares, then he may free the slave, otherwise he has freed only what he has freed.”"}},{"id":8,"idInBook":8,"chapterId":3,"bookId":8,"arabic":"حَدَّثَنَا سُفْيَانُ، عَنْ أَيُّوبَ، عَنْ سَعِيدٍ، قَالَ قُلْتُ لِابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُ رَجُلٌ لَاعَنَ امْرَأَتَهُ فَقَالَ فَرَّقَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَهُمَا وَذَكَرَ الْحَدِيثَ‏.‏","english":{"narrator":"It was narrated that Sa`eed said:","text":"I said to IbnʼUmar (رضي الله عنه): What about a man who engaged in li`an with his wife? He said: The Messenger of Allah (ﷺ)  would separate them - and he mentioned the hadeeth."}}],"chapter":{"id":3,"bookId":8,"arabic":"حَدِيثُ السَّقِيفَةِ","english":"The Hadeeth of Saqeefah"}}