{"metadata":{"length":15,"arabic":{"title":"مسند الإمام أحمد بن حنبل","author":"الإمام أحمد بن حنبل","introduction":"حَدِيثُ أَبِي رِمْثَةَ عَنْ النَّبِيَّ رَضِيَ اللَّهُ عَنْهُ"},"english":{"title":"Musnad Ahmad ibn Hanbal","author":"Imam Ahmad ibn Hanbal","introduction":""}},"hadiths":[{"id":1,"idInBook":1,"chapterId":31,"bookId":8,"arabic":"حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا سُفْيَانُ، عَنْ إِيَادِ بْنِ لَقِيطٍ السَّدُوسِيِّ، عَنْ أَبِي رِمْثَةَ، قَالَ خَرَجْتُ مَعَ أَبِي حَتَّى أَتَيْنَا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَأَيْتُ بِرَأْسِهِ رَدْعَ حِنَّاءٍ‏.‏","english":{"narrator":"","text":""}},{"id":2,"idInBook":2,"chapterId":31,"bookId":8,"arabic":"حَدَّثَنَا عَمْرُو بْنُ الْهَيْثَمِ أَبُو قَطَنٍ، وَأَبُو النَّضْرِ، قَالَا حَدَّثَنَا الْمَسْعُودِيُّ، عَنْ إِيَادِ بْنِ لَقِيطٍ، عَنْ أَبِي رِمْثَةَ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَدُ الْمُعْطِي الْعُلْيَا أُمَّكَ وَأَبَاكَ وَأُخْتَكَ وَأَخَاكَ ثُمَّ أَدْنَاكَ أَدْنَاكَ وَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ هَؤُلَاءِ بَنُو يَرْبُوعٍ قَتَلَةُ فُلَانٍ قَالَ أَلَا لَا تَجْنِي نَفْسٌ عَلَى أُخْرَى و قَالَ أَبِي قَالَ أَبُو النَّضْرِ فِي حَدِيثِهِ دَخَلْتُ الْمَسْجِدَ فَإِذَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ وَيَقُولُ يَدُ الْمُعْطِي الْعُلْيَا‏.‏","english":{"narrator":"","text":""}},{"id":3,"idInBook":3,"chapterId":31,"bookId":8,"arabic":"حَدَّثَنَا يُونُسُ، حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ سَلَمَةَ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، حَدَّثَنَا إِيَادُ بْنُ لَقِيطٍ، عَنْ أَبِي رِمْثَةَ، قَالَ أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعِنْدَهُ نَاسٌ مِنْ رَبِيعَةَ يَخْتَصِمُونَ فِي دَمٍ فَقَالَ الْيَدُ الْعُلْيَا أُمُّكَ وَأَبُوكَ وَأُخْتُكَ وَأَخُوكَ وَأَدْنَاكَ أَدْنَاكَ قَالَ فَنَظَرَ فَقَالَ مَنْ هَذَا مَعَكَ أَبَا رِمْثَةَ قَالَ قُلْتُ ابْنِي قَالَ أَمَا إِنَّهُ لَا يَجْنِي عَلَيْكَ وَلَا تَجْنِي عَلَيْهِ وَذَكَرَ قِصَّةَ الْخَاتَمِ‏.‏","english":{"narrator":"","text":""}},{"id":4,"idInBook":4,"chapterId":31,"bookId":8,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ إِيَادِ بْنِ لَقِيطٍ السَّدُوسِيِّ، قَالَ سَمِعْتُ أَبَا رِمْثَةَ التَّيْمِيَّ، قَالَ جِئْتُ مَعَ أَبِي إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ ابْنُكَ هَذَا قُلْتُ نَعَمْ قَالَ أَتُحِبُّهُ قُلْتُ نَعَمْ قَالَ أَمَا إِنَّهُ لَا يَجْنِي عَلَيْكَ وَلَا تَجْنِي عَلَيْهِ‏.‏","english":{"narrator":"","text":""}},{"id":5,"idInBook":5,"chapterId":31,"bookId":8,"arabic":"حَدَّثَنَا يُونُسُ، حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ سَلَمَةَ، عَنْ عَاصِمٍ، عَنْ أَبِي رِمْثَةَ، قَالَ أَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعِنْدَهُ نَاسٌ مِنْ رَبِيعَةَ يَخْتَصِمُونَ فِي دَمِ الْعَمْدِ فَسَمِعْتُهُ يَقُولُ أُمَّكَ وَأَبَاكَ وَأُخْتَكَ وَأَخَاكَ ثُمَّ أَدْنَاكَ فَأَدْنَاكَ ثُمَّ قَالَ فَنَظَرَ ثُمَّ قَالَ مَنْ هَذَا مَعَكَ يَا أَبَا رِمْثَةَ فَقُلْتُ ابْنِي قَالَ أَمَا إِنَّهُ لَا يَجْنِي عَلَيْكَ وَلَا تَجْنِي عَلَيْهِ قَالَ فَنَظَرْتُ فَإِذَا فِي نُغْضِ كَتِفِهِ مِثْلُ بَعْرَةِ الْبَعِيرِ أَوْ بَيْضَةِ الْحَمَامَةِ فَقُلْتُ أَلَا أُدَاوِيكَ مِنْهَا يَا رَسُولَ اللَّهِ فَإِنَّا أَهْلُ بَيْتٍ نُطَبِّبُ فَقَالَ يُدَاوِيهَا الَّذِي وَضَعَهَا‏.‏","english":{"narrator":"","text":""}},{"id":6,"idInBook":6,"chapterId":31,"bookId":8,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَبْدِ الْمَلِكِ، وَعَفَّانُ، قَالَا حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ إِيَادٍ، حَدَّثَنَا إِيَادٌ، عَنْ أَبِي رِمْثَةَ، قَالَ انْطَلَقْتُ مَعَ أَبِي نَحْوَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا رَأَيْتُهُ قَالَ لِي أَبِي هَلْ تَدْرِي مَنْ هَذَا قُلْتُ لَا فَقَالَ لِي أَبِي هَذَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاقْشَعْرَرْتُ حِينَ قَالَ ذَاكَ وَكُنْتُ أَظُنُّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَيْئًا لَا يُشْبِهُ النَّاسَ فَإِذَا بَشَرٌ لَهُ وَفْرَةٌ قَالَ عَفَّانُ فِي حَدِيثِهِ ذُو وَفْرَةٍ وَبِهَا رَدْعٌ مِنْ حِنَّاءٍ عَلَيْهِ ثَوْبَانِ أَخْضَرَانِ فَسَلَّمَ عَلَيْهِ أَبِي ثُمَّ جَلَسْنَا فَتَحَدَّثْنَا سَاعَةً ثُمَّ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِأَبِي ابْنُكَ هَذَا قَالَ إِي وَرَبِّ الْكَعْبَةِ قَالَ حَقًّا قَالَ أَشْهَدُ بِهِ فَتَبَسَّمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ضَاحِكًا مِنْ ثَبْتِ شَبَهِي بِأَبِي وَمِنْ حَلِفِ أَبِي عَلَيَّ ثُمَّ قَالَ أَمَا إِنَّهُ لَا يَجْنِي عَلَيْكَ وَلَا تَجْنِي عَلَيْهِ قَالَ وَقَرَأَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ‏{‏وَلَا تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَى‏}‏ قَالَ ثُمَّ نَظَرَ إِلَى مِثْلِ السِّلْعَةِ بَيْنَ كَتِفَيْهِ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي لَأَطَبُّ الرِّجَالِ أَلَا أُعَالِجُهَا لَكَ قَالَ لَا طَبِيبُهَا الَّذِي خَلَقَهَا‏.‏","english":{"narrator":"","text":""}},{"id":7,"idInBook":7,"chapterId":31,"bookId":8,"arabic":"حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ، عَنِ ابْنِ أَبْجَرَ، عَنْ إِيَادِ بْنِ لَقِيطٍ، عَنْ أَبِي رِمْثَةَ، قَالَ انْطَلَقْتُ مَعَ أَبِي وَأَنَا غُلَامٌ، إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَقَالَ لَهُ أَبِي إِنِّي رَجُلٌ طَبِيبٌ فَأَرِنِي هَذِهِ السِّلْعَةَ الَّتِي بِظَهْرِكَ قَالَ وَمَا تَصْنَعُ بِهَا قَالَ أَقْطَعُهَا قَالَ لَسْتَ بِطَبِيبٍ وَلَكِنَّكَ رَفِيقٌ طَبِيبُهَا الَّذِي وَضَعَهَا وَقَالَ غَيْرُهُ الَّذِي خَلَقَهَا‏.‏","english":{"narrator":"","text":""}},{"id":8,"idInBook":8,"chapterId":31,"bookId":8,"arabic":"حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي الرَّبِيعِ السَّمَّانُ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ إِيَادِ بْنِ لَقِيطٍ الْعِجْلِيِّ، عَنْ أَبِي رِمْثَةَ التَّيْمِيِّ، تَيْمَ الرِّبَابِ قَالَ أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَعِي ابْنِي فَأَرَانِيهِ إِيَّاهُ فَقُلْتُ لِابْنِي هَذَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخَذَتْهُ الرِّعْدَةُ هَيْبَةً لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ لَهُ يَا نَبِيَّ اللَّهِ إِنِّي رَجُلٌ طَبِيبٌ مِنْ أَهْلِ بَيْتٍ أَطِبَّاءَ فَأَرِنِي ظَهْرَكَ فَإِنْ تَكُنْ سِلْعَةً أَبُطُّهَا وَإِنْ تَكُ غَيْرَ ذَلِكَ أَخْبَرْتُكَ فَإِنَّهُ لَيْسَ مِنْ إِنْسَانٍ أَعْلَمَ بِجُرْحٍ أَوْ خُرَاجٍ مِنِّي قَالَ طَبِيبُهَا اللَّهُ وَعَلَيْهِ بُرْدَانِ أَخْضَرَانِ لَهُ شَعَرٌ قَدْ عَلَاهُ الْمَشِيبُ وَشَيْبُهُ أَحْمَرُ فَقَالَ ابْنُكَ هَذَا قُلْتُ إِي وَرَبِّ الْكَعْبَةِ قَالَ ابْنُ نَفْسِكَ قُلْتُ أَشْهَدُ بِهِ قَالَ فَإِنَّهُ لَا يَجْنِي عَلَيْكَ وَلَا تَجْنِي عَلَيْهِ‏.‏","english":{"narrator":"","text":""}},{"id":9,"idInBook":9,"chapterId":31,"bookId":8,"arabic":"حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، عَنْ عَلِيِّ بْنِ صَالِحٍ، حَدَّثَنِي إِيَادُ بْنُ لَقِيطٍ، عَنْ أَبِي رِمْثَةَ، قَالَ حَجَجْتُ فَرَأَيْتُ رَجُلًا جَالِسًا فِي ظِلِّ الْكَعْبَةِ فَقَالَ أَبِي تَدْرِي مَنْ هَذَا هَذَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا انْتَهَيْنَا إِلَيْهِ إِذَا رَجُلٌ ذُو وَفْرَةٍ بِهِ رَدْعٌ وَعَلَيْهِ ثَوْبَانِ أَخْضَرَانِ‏.‏","english":{"narrator":"","text":""}},{"id":10,"idInBook":10,"chapterId":31,"bookId":8,"arabic":"حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي عَمْرُو بْنُ مُحَمَّدِ بْنِ بُكَيْرٍ النَّاقِدُ، حَدَّثَنَا هُشَيْمٌ، غَيْرَ مَرَّةٍ قَالَ أَخْبَرَنِي عَبْدُ الْمَلِكِ بْنُ عُمَيْرٍ، عَنْ إِيَادِ بْنِ لَقِيطٍ، عَنْ أَبِي رِمْثَةَ التَّيْمِيِّ، أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَعِي ابْنٌ لِي فَقَالَ ابْنُكَ هَذَا قُلْتُ أَشْهَدُ بِهِ قَالَ لَا يَجْنِي عَلَيْكَ وَلَا تَجْنِي عَلَيْهِ قَالَ وَرَأَيْتُ الشَّيْبَ أَحْمَرَ‏.‏","english":{"narrator":"","text":""}},{"id":11,"idInBook":11,"chapterId":31,"bookId":8,"arabic":"حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي شَيْبَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ يَعْنِي ابْنَ إِبْرَاهِيمَ التُّسْتَرِيُّ، حَدَّثَنَا صَدَقَةُ بْنُ أَبِي عِمْرَانَ، عَنْ رَجُلٍ، هُوَ ثَابِتُ بْنُ مُنْقِذٍ عَنْ أَبِي رِمْثَةَ، قَالَ انْطَلَقْتُ أَنَا وَأَبِي، إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا كُنَّا فِي بَعْضِ الطَّرِيقِ فَلَقِينَاهُ فَقَالَ لِي أَبِي يَا بُنَيَّ هَذَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ وَكُنْتُ أَحْسَبُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يُشْبِهُ النَّاسَ فَإِذَا رَجُلٌ لَهُ وَفْرَةٌ بِهَا رَدْعٌ مِنْ حِنَّاءٍ عَلَيْهِ بُرْدَانِ أَخْضَرَانِ قَالَ كَأَنِّي أَنْظُرُ إِلَى سَاقَيْهِ قَالَ فَقَالَ لِأَبِي مَنْ هَذَا مَعَكَ قَالَ هَذَا وَاللَّهِ ابْنِي قَالَ فَضَحِكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِحَلِفِ أَبِي عَلَيَّ ثُمَّ قَالَ صَدَقْتَ أَمَا إِنَّكَ لَا تَجْنِي عَلَيْهِ وَلَا يَجْنِي عَلَيْكَ قَالَ وَتَلَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ‏{‏وَلَا تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَى‏}‏‏.‏","english":{"narrator":"","text":""}},{"id":12,"idInBook":12,"chapterId":31,"bookId":8,"arabic":"حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنَا مُحَمَّدُ بْنُ بَكَّارٍ، حَدَّثَنَا قَيْسُ بْنُ الرَّبِيعِ الْأَسَدِيُّ، عَنْ إِيَادِ بْنِ لَقِيطٍ، عَنْ أَبِي رِمْثَةَ، قَالَ انْطَلَقْتُ مَعَ أَبِي وَأَنَا غُلَامٌ، فَأَتَيْنَا رَجُلًا مِنْ الْهَاجِرَةِ جَالِسًا فِي ظِلِّ بَيْتِهِ وَعَلَيْهِ بُرْدَانِ أَخْضَرَانِ وَشَعْرُهُ وَفْرَةٌ وَبِرَأْسِهِ رَدْعٌ مِنْ حِنَّاءٍ قَالَ فَقَالَ لِي أَبِي أَتَدْرِي مَنْ هَذَا فَقُلْتُ لَا قَالَ هَذَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَتَحَدَّثْنَا طَوِيلًا قَالَ فَقَالَ لَهُ أَبِي إِنِّي رَجُلٌ مِنْ أَهْلِ بَيْتِ طِبٍّ فَأَرِنِي الَّذِي بِبَاطِنِ كَتِفِكَ فَإِنْ تَكُ سِلْعَةً قَطَعْتُهَا وَإِنْ تَكُ غَيْرَ ذَلِكَ أَخْبَرْتُكَ قَالَ طَبِيبُهَا الَّذِي خَلَقَهَا قَالَ ثُمَّ نَظَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَيَّ فَقَالَ لَهُ ابْنُكَ هَذَا قَالَ أَشْهَدُ بِهِ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ انْظُرْ مَا تَقُولُ قَالَ إِي وَرَبِّ الْكَعْبَةِ قَالَ فَضَحِكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِشَبَهِي بِأَبِي وَلِحَلِفِ أَبِي عَلَيَّ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا هَذَا لَا يَجْنِي عَلَيْكَ وَلَا تَجْنِي عَلَيْهِ‏.‏","english":{"narrator":"","text":""}},{"id":13,"idInBook":13,"chapterId":31,"bookId":8,"arabic":"حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي جَعْفَرُ بْنُ حُمَيْدٍ الْكُوفِيُّ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ إِيَادِ بْنِ لَقِيطٍ، عَنْ أَبِيهِ، عَنْ أَبِي رِمْثَةَ، قَالَ انْطَلَقْتُ مَعَ أَبِي نَحْوَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا رَأَيْتُهُ قَالَ أَبِي هَلْ تَدْرِي مَنْ هَذَا قُلْتُ لَا قَالَ هَذَا مُحَمَّدٌ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَاقْشَعْرَرْتُ حِينَ قَالَ ذَلِكَ وَكُنْتُ أَظُنُّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَيْءٌ لَا يُشْبِهُ النَّاسَ فَإِذَا بَشَرٌ ذُو وَفْرَةٍ وَبِهَا رَدْعُ حِنَّاءٍ وَعَلَيْهِ بُرَدَانِ أَخْضَرَانِ فَسَلَّمَ عَلَيْهِ أَبِي ثُمَّ جَلَسْنَا فَتَحَدَّثْنَا سَاعَةً ثُمَّ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِأَبِي ابْنُكَ هَذَا قَالَ إِي وَرَبِّ الْكَعْبَةِ قَالَ حَقًّا قَالَ أَشْهَدُ بِهِ فَتَبَسَّمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ضَاحِكًا مِنْ تَثْبِيتِ شَبَهِي بِأَبِي وَمِنْ حَلِفِ أَبِي عَلَيَّ ثُمَّ قَالَ أَمَا إِنَّهُ لَا يَجْنِي عَلَيْكَ وَلَا تَجْنِي عَلَيْهِ وَقَرَأَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ‏{‏وَلَا تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَى‏}‏ ثُمَّ نَظَرَ إِلَى مِثْلِ السِّلْعَةِ بَيْنَ كَتِفَيْهِ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي كَأَطَبِّ الرِّجَالِ أَلَا أُعَالِجُهَا لَكَ قَالَ لَا طَبِيبُهَا الَّذِي خَلَقَهَا‏.‏","english":{"narrator":"","text":""}},{"id":14,"idInBook":14,"chapterId":31,"bookId":8,"arabic":"حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي أَبِي وَأَبُو خَيْثَمَةَ زُهَيْرُ بْنُ حَرْبٍ قَالَا حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ إِيَادِ بْنِ لَقِيطٍ، عَنْ أَبِيهِ، عَنْ أَبِي رِمْثَةَ، قَالَ أَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَيْهِ بُرْدَانِ أَخْضَرَانِ‏.‏","english":{"narrator":"","text":""}},{"id":15,"idInBook":15,"chapterId":31,"bookId":8,"arabic":"حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي شَيْبَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ يَعْنِي ابْنَ حَازِمٍ، حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ عُمَيْرٍ، عَنْ إِيَادِ بْنِ لَقِيطٍ، عَنْ أَبِي رِمْثَةَ، قَالَ قَدِمْتُ الْمَدِينَةَ وَلَمْ أَكُنْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَخَرَجَ وَعَلَيْهِ ثَوْبَانِ أَخْضَرَانِ فَقُلْتُ لِابْنِي هَذَا وَاللَّهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجَعَلَ ابْنِي يَرْتَعِدُ هَيْبَةً لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي رَجُلٌ طَبِيبٌ وَإِنَّ أَبِي كَانَ طَبِيبًا وَإِنَّا أَهْلُ بَيْتِ طِبٍّ وَاللَّهِ مَا يَخْفَى عَلَيْنَا مِنْ الْجَسَدِ عِرْقٌ وَلَا عَظْمٌ فَأَرِنِي هَذِهِ الَّتِي عَلَى كَتِفِكَ فَإِنْ كَانَتْ سِلْعَةً قَطَعْتُهَا ثُمَّ دَاوَيْتُهَا قَالَ لَا طَبِيبُهَا اللَّهُ ثُمَّ قَالَ مَنْ هَذَا الَّذِي مَعَكَ قُلْتُ ابْنِي وَرَبِّ الْكَعْبَةِ فَقَالَ ابْنُكَ قَالَ ابْنِي أَشْهَدُ بِهِ قَالَ ابْنُكَ هَذَا لَا يَجْنِي عَلَيْكَ وَلَا تَجْنِي عَلَيْهِ‏.‏","english":{"narrator":"","text":""}}],"chapter":{"id":31,"bookId":8,"arabic":"حَدِيثُ أَبِي رِمْثَةَ عَنْ النَّبِيَّ رَضِيَ اللَّهُ عَنْهُ","english":""}}