{"metadata":{"length":152,"arabic":{"title":"مسند الإمام أحمد بن حنبل","author":"الإمام أحمد بن حنبل","introduction":"مُسْنَدُ عُثْمَانَ بْنِ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ"},"english":{"title":"Musnad Ahmad ibn Hanbal","author":"Imam Ahmad ibn Hanbal","introduction":"Musnad Uthman ibn Affan"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، حَدَّثَنَا عَوْفٌ، حَدَّثَنَا يَزِيدُ يَعْنِي الْفَارِسِيَّ، قَالَ أَبِي أَحْمَدُ بْنُ حَنْبَلٍ و حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا عَوْفٌ، عَنْ يَزِيدَ، قَالَ قَالَ لَنَا ابْنُ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُ قُلْتُ لِعُثْمَانَ بْنِ عَفَّانَ مَا حَمَلَكُمْ عَلَى أَنْ عَمَدْتُمْ، إِلَى الْأَنْفَالِ وَهِيَ مِنْ الْمَثَانِي وَإِلَى بَرَاءَةٌ وَهِيَ مِنْ الْمِئِينَ فَقَرَنْتُمْ بَيْنَهُمَا وَلَمْ تَكْتُبُوا قَالَ ابْنُ جَعْفَرٍ بَيْنَهُمَا سَطْرًا بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ وَوَضَعْتُمُوهَا فِي السَّبْعِ الطِّوَالِ مَا حَمَلَكُمْ عَلَى ذَلِكَ قَالَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ مِمَّا يَأْتِي عَلَيْهِ الزَّمَانُ يُنْزَلُ عَلَيْهِ مِنْ السُّوَرِ ذَوَاتِ الْعَدَدِ وَكَانَ إِذَا أُنْزِلَ عَلَيْهِ الشَّيْءُ يَدْعُو بَعْضَ مَنْ يَكْتُبُ عِنْدَهُ يَقُولُ ضَعُوا هَذَا فِي السُّورَةِ الَّتِي يُذْكَرُ فِيهَا كَذَا وَكَذَا وَيُنْزَلُ عَلَيْهِ الْآيَاتُ فَيَقُولُ ضَعُوا هَذِهِ الْآيَاتِ فِي السُّورَةِ الَّتِي يُذْكَرُ فِيهَا كَذَا وَكَذَا وَيُنْزَلُ عَلَيْهِ الْآيَةُ فَيَقُولُ ضَعُوا هَذِهِ الْآيَةَ فِي السُّورَةِ الَّتِي يُذْكَرُ فِيهَا كَذَا وَكَذَا وَكَانَتْ الْأَنْفَالُ مِنْ أَوَائِلِ مَا أُنْزِلَ بِالْمَدِينَةِ وَبَرَاءَةٌ مِنْ آخِرِ الْقُرْآنِ فَكَانَتْ قِصَّتُهَا شَبِيهًا بِقِصَّتِهَا فَقُبِضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَمْ يُبَيِّنْ لَنَا أَنَّهَا مِنْهَا وَظَنَنْتُ أَنَّهَا مِنْهَا فَمِنْ ثَمَّ قَرَنْتُ بَيْنَهُمَا وَلَمْ أَكْتُبْ بَيْنَهُمَا سَطْرًا بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ قَالَ ابْنُ جَعْفَرٍ وَوَضَعْتُهَا فِ السَّبْعِ الطِّوَالِ‏.‏","english":{"narrator":"It was narrated that Yazeed said:","text":"Ibn ‘Abbas (رضي الله عنه) said to us.  I said to ‘Uthman bin `Affan: What made you take al-Anfal, which is one of al-Mathani (the seven long soorahs), and Bara`ah, which is one of al-Mi`een (soorahs with one hundred verses or thereabouts), and put them next to one another and not write - Ibn Ja`far said: A line between them saying Bismillahir-Rahmanir-Raheem - and you put them with the seven long ones? What made you do that? `Uthman (رضي الله عنه)said: Sometimes many soorahs would be revealed (incomplete) to the Messenger of Allah (ﷺ) , and when something was revealed he would call one of the scribes to write it down for him and say: “Put this in the Soorah in which such and such is mentioned`; and verses would be revealed to him and he would say, `Put these verses in the soorah in which such and such is mentioned”; and a verse would be revealed to him and he would say: `Put this verse in the soorah in which such and such is mentioned.” Al-Anfal was one of the first soorahs to be revealed in Madinah and Bara`ah was one of the last soorahs of the Qur`an, and the stories and content of the two soorahs were similar. \nThen the Messenger of Allah (ﷺ)  passed away without having stated clearly to us that it was part of it, but we thought that it was, hence I put them together and I did not put between them the line Bismillahir-Rahmanir-Raheem. Ibn Ja`far said: I put it with the seven long ones."}},{"id":2,"idInBook":2,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، أَخْبَرَنِي أَبِي أَنَّ حُمْرَانَ، أَخْبَرَهُ قَالَ تَوَضَّأَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ عَلَى الْبَلَاطِ ثُمَّ قَالَ لَأُحَدِّثَنَّكُمْ حَدِيثًا سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْلَا آيَةٌ فِي كِتَابِ اللَّهِ مَا حَدَّثْتُكُمُوهُ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ تَوَضَّأَ فَأَحْسَنَ الْوُضُوءَ ثُمَّ دَخَلَ فَصَلَّى غُفِرَ لَهُ مَا بَيْنَهُ وَبَيْنَ الصَّلَاةِ الْأُخْرَى حَتَّى يُصَلِّيَهَا‏.‏","english":{"narrator":"It was narrated from Hisham bin `Urwah:","text":"My father told me that Humran told him: `Uthman (رضي الله عنه) did wudoo’ in al-Balat (a paved area in Madinah) then he said, i shall tell you a hadeeth that I heard from the Messenger of Allah (ﷺ) . Were it not for a verse in the Book of Allah, I would not have told you it. I heard the Prophet (ﷺ) say: `Whoever does wudoo’ and does it well, then goes in and prays, his sins between that prayer and the next will be forgiven, until he prays .”"}},{"id":3,"idInBook":3,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ مَالِكٍ، حَدَّثَنِي نَافِعٌ، عَنْ نُبَيْهِ بْنِ وَهْبٍ، عَنْ أَبَانَ بْنِ عُثْمَانَ، رَضِيَ اللَّهُ عَنْهُ عَنْ أَبِيهِ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْمُحْرِمُ لَا يَنْكِحُ وَلَا يُنْكِحُ وَلَا يَخْطُبُ‏.‏","english":{"narrator":"It was narrated from Aban bin `Uthman (رضي الله عنه) from his father that the Prophet  (ﷺ)  said:","text":"`The pilgrim in ihram should not get married, arrange a marriage or propose marriage.`"}},{"id":4,"idInBook":4,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا يَحْيَى، عَنِ ابْنِ حَرْمَلَةَ، قَالَ سَمِعْتُ سَعِيدًا يَعْنِي ابْنَ الْمُسَيَّبِ، قَالَ خَرَجَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ حَاجًّا حَتَّى إِذَا كَانَ بِبَعْضِ الطَّرِيقِ قِيلَ لِعَلِيٍّ رِضْوَانُ اللَّهِ عَلَيْهِمَا إِنَّهُ قَدْ نَهَى عَنْ التَّمَتُّعِ بِالْعُمْرَةِ إِلَى الْحَجِّ فَقَالَ عَلِيٌّ رَضِيَ اللَّهُ عَنْهُ لِأَصْحَابِهِ إِذَا ارْتَحَلَ فَارْتَحِلُوا فَأَهَلَّ عَلِيٌّ وَأَصْحَابُهُ بِعُمْرَةٍ فَلَمْ يُكَلِّمْهُ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ فِي ذَلِكَ فَقَالَ لَهُ عَلِيٌّ رَضِيَ اللَّهُ عَنْهُ أَلَمْ أُخْبَرْ أَنَّكَ نَهَيْتَ عَنْ التَّمَتُّعِ بِالْعُمْرَةِ قَالَ فَقَالَ بَلَى قَالَ فَلَمْ تَسْمَعْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَمَتَّعَ قَالَ بَلَى‏.‏","english":{"narrator":"It was narrated that Ibn Harmalah said:","text":"I heard Sa`eed . `Ali (رضي الله عنه) said to his companions. When he sets out, set out too. And ‘Ali and his companions entered ihram with the intention of doing `umrah and `Uthman (رضي الله عنه) did not say anything to him about that ‘Ali (رضي الله عنه) said to him: Have I not been told that you forbade tamattu` by doing `umrah first? He said. Of course. ‘Ali said: Did you not hear that the Messenger of Allah (ﷺ) did tamattu’?`Uthman said: Of course,"}},{"id":5,"idInBook":5,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا وَكِيعٌ، عَنْ إِسْرَائِيلَ، عَنْ عَامِرِ بْنِ شَقِيقٍ، عَنْ أَبِي وَائِلٍ، عَنْ عُثْمَانَ، رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَوَضَّأَ ثَلَاثًا ثَلَاثًا‏.‏","english":{"narrator":"","text":"It was narrated from `Uthman that the Messenger of Allah (ﷺ) did wudoo’ washing each part of the body three times."}},{"id":6,"idInBook":6,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي النَّضْرِ، عَنْ أَبُو أَنَسٍ، أَنَّ عُثْمَانَ، رَضِيَ اللَّهُ عَنْهُ تَوَضَّأَ بِالْمَقَاعِدِ ثَلَاثًا ثَلَاثًا وَعِنْدَهُ رِجَالٌ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَلَيْسَ هَكَذَا رَأَيْتُمْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَوَضَّأُ قَالُوا نَعَمْ‏.‏","english":{"narrator":"It was narrated from Abu Anas  that `Uthman (رضي الله عنه) did wudoo` in al-Maqa`id, washing each part of the body three times. Some of the Companions of the Messenger of Allah (ﷺ) were with him. He said:","text":"Didn`t you see the Messenger of Allah (ﷺ)  do wudoo like this? They said: Yes"}},{"id":7,"idInBook":7,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا سُفْيَانُ، وَعَبْدُ الرَّحْمَنِ، عَنْ سُفْيَانَ، عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ عُثْمَانَ، رَضِيَ اللَّهُ عَنْهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَفْضَلُكُمْ مَنْ تَعَلَّمَ الْقُرْآنَ وَعَلَّمَهُ‏.‏","english":{"narrator":"It was narrated that `Uthman (رضي الله عنه) said:","text":"The Messenger of Allah       (ﷺ)  said: `The best of you is the one who learns Qur`an and teaches it.”"}},{"id":8,"idInBook":8,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا شُعْبَةُ، عَنْ جَامِعِ بْنِ شَدَّادٍ، قَالَ سَمِعْتُ حُمْرَانَ بْنَ أَبَانَ، يُحَدِّثُ عَنْ عُثْمَانَ، رَضِيَ اللَّهُ عَنْهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَتَمَّ الْوُضُوءَ كَمَا أَمَرَهُ اللَّهُ عَزَّ وَجَلَّ فَالصَّلَوَاتُ الْمَكْتُوبَاتُ كَفَّارَاتٌ لِمَا بَيْنَهُنَّ‏.‏","english":{"narrator":"It was narrated that `Uthman (رضي الله عنه) said:","text":"The Messenger of Allah      (ﷺ) said: `Whoever does wudoo’ as Allah, may he be glorified and exalted, has commanded him, the prescribed prayers will be an expiation for  between them.”"}},{"id":9,"idInBook":9,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا وَكِيعٌ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، قَالَ قَالَ قَيْسٌ فَحَدَّثَنِي أَبُو سَهْلَةَ، أَنَّ عُثْمَانَ، رَضِيَ اللَّهُ عَنْهُ قَالَ يَوْمَ الدَّارِ حِينَ حُصِرَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَهِدَ إِلَيَّ عَهْدًا فَأَنَا صَابِرٌ عَلَيْهِ قَالَ قَيْسٌ فَكَانُوا يَرَوْنَهُ ذَلِكَ الْيَوْمَ‏.‏","english":{"narrator":"Abu Sahlah narrated that `Uthman (رضي الله عنه) said, on the Day of the House when he was besieged. The Messenger of Allah (ﷺ) gave me advice and I promised to comply with it, so I shall bear it with patience. Qais said:","text":"People thought that it was that day (when he was killed)."}},{"id":10,"idInBook":10,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَبْدُ الرَّحْمَنِ، حَدَّثَنَا سُفْيَانُ، وَعَبْدُ الرَّزَّاقِ، قَالَا حَدَّثَنَا سُفْيَانُ، عَنْ عُثْمَانَ بْنِ حَكِيمٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَمْرَةَ، عَنْ عُثْمَانَ بْنِ عَفَّانَ، رَضِيَ اللَّهُ عَنْهُ قَالَ عَبْدُ الرَّزَّاقِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ صَلَّى صَلَاةَ الْعِشَاءِ وَالصُّبْحِ فِي جَمَاعَةٍ فَهُوَ كَقِيَامِ لَيْلَةٍ وَقَالَ عَبْدُ الرَّحْمَنِ مَنْ صَلَّى الْعِشَاءَ فِي جَمَاعَةٍ فَهُوَ كَقِيَامِ نِصْفِ لَيْلَةٍ وَمَنْ صَلَّى الصُّبْحَ فِي جَمَاعَةٍ فَهُوَ كَقِيَامِ لَيْلَةٍ‏.‏","english":{"narrator":"It was narrated from `Uthman bin `Affan (رضي الله عنه) . `Abdur-Razzaq said:","text":"from the Prophet (ﷺ)  - that he said: `Whoever prays `Isha` and Fajr prayer in congregation, it is as if he spent the night in prayer (qiyamul-lail).” ‘Abdur-Rahman said: Whoever prays `Isha` in congregation, it is as if he spent half the night in prayer, and whoever prays Fajr in congregation, it is as if he spent the entire night in prayer,"}},{"id":11,"idInBook":11,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ عَمْرٍو، حَدَّثَنَا عَلِيُّ بْنُ الْمُبَارَكِ، عَنْ يَحْيَى يَعْنِي ابْنَ أَبِي كَثِيرٍ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ عُثْمَانَ بْنِ عَفَّانَ، رَضِيَ اللَّهُ عَنْهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ صَلَّى الْعِشَاءَ فِي جَمَاعَةٍ فَهُوَ كَمَنْ قَامَ نِصْفَ اللَّيْلِ وَمَنْ صَلَّى الصُّبْحَ فِي جَمَاعَةٍ فَهُوَ كَمَنْ قَامَ اللَّيْلَ كُلَّهُ‏.‏","english":{"narrator":"It was narrated from ‘Uthman bin `Affan (رضي الله عنه) that the Prophet        (ﷺ) said:","text":"“whoever prays ‘Isha in congregation is like one who spent half the night in prayer, and whoever prays Fajr in congregation is like one who spent the entire night in prayer.”"}},{"id":12,"idInBook":12,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا يُونُسُ يَعْنِي ابْنَ عُبَيْدٍ، حَدَّثَنِي عَطَاءُ بْنُ فَرُّوخَ، مَوْلَى الْقُرَشِيِّينَ أَنَّ عُثْمَانَ، رَضِيَ اللَّهُ عَنْهُ اشْتَرَى مِنْ رَجُلٍ أَرْضًا فَأَبْطَأَ عَلَيْهِ فَلَقِيَهُ فَقَالَ لَهُ مَا مَنَعَكَ مِنْ قَبْضِ مَالِكَ قَالَ إِنَّكَ غَبَنْتَنِي فَمَا أَلْقَى مِنْ النَّاسِ أَحَدًا إِلَّا وَهُوَ يَلُومُنِي قَالَ أَوَ ذَلِكَ يَمْنَعُكَ قَالَ نَعَمْ قَالَ فَاخْتَرْ بَيْنَ أَرْضِكَ وَمَالِكَ ثُمَّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَدْخَلَ اللَّهُ عَزَّ وَجَلَّ الْجَنَّةَ رَجُلًا كَانَ سَهْلًا مُشْتَرِيًا وَبَائِعًا وَقَاضِيًا وَمُقْتَضِيًا‏.‏","english":{"narrator":"‘Ata` bin Farrookh, the freed slave of the Qurashis, narrated that `Uthman (رضي الله عنه) bought some land from a man and the man did not seek payment for it. Then he met him and he said to him:","text":"What prevented you from coming and taking your money? He said: You were unfair to me; I never met anyone but he blamed me. `Uthman said: Is this the reason? He said: Yes.  ‘Uthman said: Then choose between your land or your money. Then `Uthman said: The Messenger of Allah (ﷺ)  said: “Allah, may He be glorified and exalted, admitted to Paradise a man who was easygoing in buying and selling, when paying off debt and when asking for a debt that was owed to him.”"}},{"id":13,"idInBook":13,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنَا يُونُسُ بْنُ عُبَيْدٍ، عَنْ أَبِي مَعْشَرٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، قَالَ كُنْتُ مَعَ ابْنِ مَسْعُودٍ وَهُوَ عِنْدَ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ فَقَالَ لَهُ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ مَا بَقِيَ لِلنِّسَاءِ مِنْكَ قَالَ فَلَمَّا ذُكِرَتْ النِّسَاءُ قَالَ ابْنُ مَسْعُودٍ ادْنُ يَا عَلْقَمَةُ قَالَ وَأَنَا رَجُلٌ شَابٌّ فَقَالَ لَهُ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى فِتْيَةٍ مِنْ الْمُهَاجِرِينَ فَقَالَ مَنْ كَانَ مِنْكُمْ ذَا طَوْلٍ فَلْيَتَزَوَّجْ فَإِنَّهُ أَغَضُّ لِلطَّرْفِ وَأَحْصَنُ لِلْفَرْجِ وَمَنْ لَا فَإِنَّ الصَّوْمَ لَهُ وِجَاءٌ‏.‏","english":{"narrator":"It was narrated that ‘Alqamah said:","text":"I was with Ibn Mas`ood when he was with ‘Uthman {رضي الله عنه}. `Uthman (رضي الله عنه) said to him: Do you still feel any desire towards women? When women were mentioned, Ibn Mas`ood said: Come closer, ‘Alqamah. I was a young man (at that time). `Uthman   (رضي الله عنه) said to him: The Messenger of Allah (ﷺ)  came out to some young men of the Muhajireen and said: “Whoever among you has the means to get married, let him do so, for it is more effective in lowering the gaze and guarding chastity, whoever cannot (do that), then fasting is a shield for him.`"}},{"id":14,"idInBook":14,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، وَبَهْزٌ، وَحَجَّاجٌ، قَالُوا حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ عَلْقَمَةَ بْنَ مَرْثَدٍ، يُحَدِّثُ عَنْ سَعْدِ بْنِ عُبَيْدَةَ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ، عَنْ عُثْمَانَ بْنِ عَفَّانَ، رَضِيَ اللَّهُ عَنْهُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ إِنَّ خَيْرَكُمْ مَنْ عَلَّمَ الْقُرْآنَ أَوْ تَعَلَّمَهُ قَالَ مُحَمَّدُ بْنُ جَعْفَرٍ وَحَجَّاجٌ فَقَالَ أَبُو عَبْدِ الرَّحْمَنِ فَذَاكَ الَّذِي أَقْعَدَنِي هَذَا الْمَقْعَدَ قَالَ حَجَّاجٌ قَالَ شُعْبَةُ وَلَمْ يَسْمَعْ أَبُو عَبْدِ الرَّحْمَنِ مِنْ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ وَلَا مِنْ عَبْدِ اللَّهِ وَلَكِنْ قَدْ سَمِعَ مِنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ أَبِي وَقَالَ بَهْزٌ عَنْ شُعْبَةَ قَالَ عَلْقَمَةُ بْنُ مَرْثَدٍ أَخْبَرَنِي وَقَالَ خَيْرُكُمْ مَنْ تَعَلَّمَ الْقُرْآنَ وَعَلَّمَهُ.\n\nحَدَّثَنَا عَفَّانُ حَدَّثَنَا شُعْبَةُ أَخْبَرَنِي عَلْقَمَةُ بْنُ مَرْثَدٍ وَقَالَ فِيهِ مَنْ تَعَلَّمَ الْقُرْآنَ أَوْ عَلَّمَهُ‏.‏","english":{"narrator":"It was narrated from `Uthman bin `Affan (رضي الله عنه) that the Prophet        (ﷺ) said:","text":"`The best of you is the one who teaches Qur`an or learns it.” Muhammad bin Ja`far and Hajjaj said: Abu `AbdurRahman said: That is what made me sit in this place (i.e., become a teacher). Hajjaj said: Shu`bah said: Abu `Abdur-Rahman did not hear (it) from `Uthman (رضي الله عنه) or from ‘Abdullah, but he heard it from ‘Ali (رضي الله عنه). My father said and Bahz said: (It was narrated from) Shu`bah who said: `AIqamah bin Marthad told me. “The best of you is the one who learns Qur`an and teaches it.`\n\n\n`Affan told us: Shu`bah told us: `Alqamah bin Marthad told me... and he said in it: “Whoever learns the Qur`an or teaches it.”"}},{"id":15,"idInBook":15,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، وَحَجَّاجٌ، قَالَا حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ دِينَارٍ، قَالَ سَمِعْتُ رَجُلًا، يُحَدِّثُ عَنْ عُثْمَانَ بْنِ عَفَّانَ، رَضِيَ اللَّهُ عَنْهُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ كَانَ رَجُلٌ سَمْحًا بَائِعًا وَمُبْتَاعًا وَقَاضِيًا وَمُقْتَضِيًا فَدَخَلَ الْجَنَّةَ‏.‏","english":{"narrator":"It was narrated that `Amr bin Deenar said:","text":"I heard a man narrate from `Uthman bin `Affan (رضي الله عنه) from the Prophet (ﷺ)  who said: `A man was easy-going when buying and selling, and when paying his dues and asking for what he was owe then he will enter Paradise.”"}},{"id":16,"idInBook":16,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ مُسْلِمِ بْنِ يَسَارٍ، عَنْ حُمْرَانَ بْنِ أَبَانَ، عَنْ عُثْمَانَ بْنِ عَفَّانَ، رَضِيَ اللَّهُ عَنْهُ أَنَّهُ دَعَا بِمَاءٍ فَتَوَضَّأَ وَمَضْمَضَ وَاسْتَنْشَقَ ثُمَّ غَسَلَ وَجْهَهُ ثَلَاثًا وَذِرَاعَيْهِ ثَلَاثًا ثَلَاثًا وَمَسَحَ بِرَأْسِهِ وَظَهْرِ قَدَمَيْهِ ثُمَّ ضَحِكَ فَقَالَ لِأَصْحَابِهِ أَلَا تَسْأَلُونِي عَمَّا أَضْحَكَنِي فَقَالُوا مِمَّ ضَحِكْتَ يَا أَمِيرَ الْمُؤْمِنِينَ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَعَا بِمَاءٍ قَرِيبًا مِنْ هَذِهِ الْبُقْعَةِ فَتَوَضَّأَ كَمَا تَوَضَّأْتُ ثُمَّ ضَحِكَ فَقَالَ أَلَا تَسْأَلُونِي مَا أَضْحَكَنِي فَقَالُوا مَا أَضْحَكَكَ يَا رَسُولَ اللَّهِ فَقَالَ إِنَّ الْعَبْدَ إِذَا دَعَا بِوَضُوءٍ فَغَسَلَ وَجْهَهُ حَطَّ اللَّهُ عَنْهُ كُلَّ خَطِيئَةٍ أَصَابَهَا بِوَجْهِهِ فَإِذَا غَسَلَ ذِرَاعَيْهِ كَانَ كَذَلِكَ وَإِنْ مَسَحَ بِرَأْسِهِ كَانَ كَذَلِكَ وَإِذَا طَهَّرَ قَدَمَيْهِ كَانَ كَذَلِكَ‏.‏","english":{"narrator":"It was narrated from Aban from `Uthman (رضي الله عنه) that he called for water and did wudoo`:","text":"he rinsed his mouth and nose, then he washed his face three times, his arms three times each, and wiped his head and the tops of his feet, then he smiled and said to his companions: Aren`t you going to ask me what made me smile? They said: What made you smile, O Ameer al-Mu`mineen? He said: I saw the Messenger of Allah (ﷺ)  call for water near this spot, then he did wudoo’ as I have done it, then he smiled and said: `Aren`t you going to ask me what made me smile?` They said: What made you smile, O Messenger of Allah (ﷺ)? He said: “If a person calls for (water for) wudoo’, then he washes his face, Allah will remove from him every sin that he committed with his face; when he washes his arms, the same applies; when he wipes his head, the same applies; when he purifies his feet, the same applies.”"}},{"id":17,"idInBook":17,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا بَهْزٌ، أَخْبَرَنَا مَهْدِيُّ بْنُ مَيْمُونٍ، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي يَعْقُوبَ، عَنِ الْحَسَنِ بْنِ سَعْدٍ، مَوْلَى حَسَنِ بْنِ عَلِيٍّ عَنْ رَبَاحٍ، قَالَ زَوَّجَنِي أَهْلِي أَمَةً لَهُمْ رُومِيَّةً فَوَقَعْتُ عَلَيْهَا فَوَلَدَتْ لِي غُلَامًا أَسْوَدَ مِثْلِي فَسَمَّيْتُهُ عَبْدَ اللَّهِ ثُمَّ وَقَعْتُ عَلَيْهَا فَوَلَدَتْ لِي غُلَامًا أَسْوَدَ مِثْلِي فَسَمَّيْتُهُ عُبَيْدَ اللَّهِ ثُمَّ طَبِنَ لَهَا غُلَامٌ لِأَهْلِي رُومِيٌّ يُقَالُ لَهُ يُوحَنَّسُ فَرَاطَنَهَا بِلِسَانِهِ قَالَ فَوَلَدَتْ غُلَامًا كَأَنَّهُ وَزَغَةٌ مِنْ الْوَزَغَاتِ فَقُلْتُ لَهَا مَا هَذَا قَالَتْ هُوَ لِيُوحَنَّسَ قَالَ فَرُفِعْنَا إِلَى أَمِيرِ الْمُؤْمِنِينَ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ قَالَ مَهْدِيٌّ أَحْسَبُهُ قَالَ سَأَلَهُمَا فَاعْتَرَفَا فَقَالَ أَتَرْضَيَانِ أَنْ أَقْضِيَ بَيْنَكُمَا بِقَضَاءِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى أَنَّ الْوَلَدَ لِلْفِرَاشِ وَلِلْعَاهِرِ الْحَجَرَ قَالَ مَهْدِيٌّ وَأَحْسَبُهُ قَالَ جَلَدَهَا وَجَلَدَهُ وَكَانَا مَمْلُوكَيْنِ\n\n حَدَّثَنَا شَيْبَانُ أَبُو مُحَمَّدٍ حَدَّثَنَا مَهْدِيُّ بْنُ مَيْمُونٍ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي يَعْقُوبَ عَنِ الْحَسَنِ بْنِ سَعْدٍ عَنْ رَبَاحٍ فَذَكَرَ الْحَدِيثَ قَالَ فَرَفَعْتُهُمَا إِلَى أَمِيرِ الْمُؤْمِنِينَ عُثْمَانَ بْنِ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ فَقَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى أَنَّ الْوَلَدَ لِلْفِرَاشِ فَذَكَرَ مِثْلَهُ‏.‏","english":{"narrator":"It was narrated from alHasan bin Sa`d, the freed slave of Hasan bin `Ali, that Rabah said:","text":"My masters married me to a Roman slave girl of theirs. I was intimate with her and she bore me a boy who was black like me and i named him `Abdullah. Then l was intimate with her again and she bore me a boy who was black like me, and I named him Ubaidullah. Then she was corrupted by a Roman slave of my masters, whose name was Yuhannas and he spoke to her in their language. Then she gave birth to a boy who looked like a lizard (i.e., was very fair). I said to her: What is this? She said: He is the child of Yohannas. So we referred the case to Ameer al-Mu`mineen `Uthman (رضي الله عنه) - Mahdi said: I think he said: And he asked then both- and they confessed. He said. Will you agree to me passing judgement between you according to the judgement of the Messenger of Allah (ﷺ) ? He said: The Messenger of Allah (ﷺ)  ruled that the child be attributed to the (husband of the) woman, and the fornicator gets nothing. Mahdi said: and I think he said: He flogged her and him, and they were both slaves,\n\n\nIt was narrated from Rabah... he mentioned a similar hadeeth. He said: I took them to Ameer al-Mu`mineen `Uthman bin `Affan {رضي الله عنه}, who said: The Messenger of Allah (ﷺ)  ruled that the child be attributed to (the husband of the woman... and he mentioned a similar report"}},{"id":18,"idInBook":18,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا أَبُو كَامِلٍ، حَدَّثَنَا إِبْرَاهِيمُ يَعْنِي ابْنَ سَعْدٍ، حَدَّثَنَا ابْنُ شِهَابٍ، عَنْ عَطَاءِ بْنِ يَزِيدَ، عَنْ حُمْرَانَ، قَالَ دَعَا عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ بِمَاءٍ وَهُوَ عَلَى الْمَقَاعِدِ فَسَكَبَ عَلَى يَمِينِهِ فَغَسَلَهَا ثُمَّ أَدْخَلَ يَمِينَهُ فِي الْإِنَاءِ فَغَسَلَ كَفَّيْهِ ثَلَاثًا ثُمَّ غَسَلَ وَجْهَهُ ثَلَاثَ مِرَارٍ وَمَضْمَضَ وَاسْتَنْثَرَ وَغَسَلَ ذِرَاعَيْهِ إِلَى الْمِرْفَقَيْنِ ثَلَاثَ مَرَّاتٍ ثُمَّ مَسَحَ بِرَأْسِهِ ثُمَّ غَسَلَ رِجْلَيْهِ إِلَى الْكَعْبَيْنِ ثَلَاثَ مِرَارٍ ثُمَّ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ تَوَضَّأَ نَحْوَ وُضُوئِي هَذَا ثُمَّ صَلَّى رَكْعَتَيْنِ لَا يُحَدِّثُ نَفْسَهُ فِيهِمَا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ حَدَّثَنَا إِبْرَاهِيمُ بْنُ نَصْرٍ التِّرْمِذِيُّ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ عَنِ ابْنِ شِهَابٍ عَنْ عَطَاءِ بْنِ يَزِيدَ عَنْ حُمْرَانَ مَوْلَى عُثْمَانَ أَنَّهُ رَأَى عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ دَعَا بِإِنَاءٍ فَذَكَرَ نَحْوَهُ‏.‏","english":{"narrator":"It was narrated that Humran said, `Uthman (رضي الله عنه) called for water when he was in al-Maqa`id. He poured some on his right hand and washed it, then he put his right hand in the vessel and washed his hands three times, then he washed his face three times, and he rinsed his mouth and nose, he washed his arms up to the elbows three times, then he wiped his head, then he washed his feet up to the ankles three times. Then he said:","text":"I heard the Messenger of Allah(ﷺ)  say: “Whoever does wudoo` as I have done wudoo’, then prays two rak`ahs in which he does not let his mind wander, will be forgiven his previous sins. \n\n\nIt was narrated from Humran, the freed slave of ‘Uthman, that he saw `Uthman (رضي الله عنه) call for a vessel,... and he mentioned a similar report."}},{"id":19,"idInBook":19,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا أَبُو قَطَنٍ، حَدَّثَنَا يُونُسُ يَعْنِي ابْنَ أَبِي إِسْحَاقَ، عَنْ أَبِيهِ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، قَالَ أَشْرَفَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ مِنْ الْقَصْرِ وَهُوَ مَحْصُورٌ فَقَالَ أَنْشُدُ بِاللَّهِ مَنْ شَهِدَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ حِرَاءٍ إِذْ اهْتَزَّ الْجَبَلُ فَرَكَلَهُ بِقَدَمِهِ ثُمَّ قَالَ اسْكُنْ حِرَاءُ لَيْسَ عَلَيْكَ إِلَّا نَبِيٌّ أَوْ صِدِّيقٌ أَوْ شَهِيدٌ وَأَنَا مَعَهُ فَانْتَشَدَ لَهُ رِجَالٌ قَالَ أَنْشُدُ بِاللَّهِ مَنْ شَهِدَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ بَيْعَةِ الرِّضْوَانِ إِذْ بَعَثَنِي إِلَى الْمُشْرِكِينَ إِلَى أَهْلِ مَكَّةَ قَالَ هَذِهِ يَدِي وَهَذِهِ يَدُ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ فَبَايَعَ لِي فَانْتَشَدَ لَهُ رِجَالٌ قَالَ أَنْشُدُ بِاللَّهِ مَنْ شَهِدَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ يُوَسِّعُ لَنَا بِهَذَا الْبَيْتِ فِي الْمَسْجِدِ بِبَيْتٍ فِي الْجَنَّةِ فَابْتَعْتُهُ مِنْ مَالِي فَوَسَّعْتُ بِهِ الْمَسْجِدَ فَانْتَشَدَ لَهُ رِجَالٌ قَالَ وَأَنْشُدُ بِاللَّهِ مَنْ شَهِدَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ جَيْشِ الْعُسْرَةِ قَالَ مَنْ يُنْفِقُ الْيَوْمَ نَفَقَةً مُتَقَبَّلَةً فَجَهَّزْتُ نِصْفَ الْجَيْشِ مِنْ مَالِي قَالَ فَانْتَشَدَ لَهُ رِجَالٌ وَأَنْشُدُ بِاللَّهِ مَنْ شَهِدَ رُومَةَ يُبَاعُ مَاؤُهَا ابْنَ السَّبِيلِ فَابْتَعْتُهَا مِنْ مَالِي فَأَبَحْتُهَا لِابْنِ السَّبِيلِ قَالَ فَانْتَشَدَ لَهُ رِجَالٌ‏.‏","english":{"narrator":"It was narrated that Abu Salamah bin `Abdul-Rahman said:","text":"`Uthman (رضي الله عنه) looked out from the house when he was under siege and said: I adjure by Allah anyone who was present with the Messenger of Allah (ﷺ) , on the day of Hira`, when the mountain shook beneath his feet; he kicked it with his foot and said: “Be still, Hira`, there is no one on you but a Prophet, a Siddiq or a martyr,` and i was with him. And some men testified to what he said. Then he said: I adjure by Allah anyone who was present with the Messenger of Allah (ﷺ) on the day of Bai’atul-Ridwan, when he had sent me to the mushrikeen, the people of Makkah; he said, `This is my hand and this is the hand of `Uthman,` and he swore allegiance on my behalf. And some men testified to what he said. Then he said:l adjure by Allah anyone who was present when the Messenger of Allah (ﷺ) said: `Who will expand the mosque by incorporating this house into it, in return for a house in Paradise?” and I bought it with my wealth and expanded the mosque by incorporating it into it. And some men testified to what he said. Then he said: I adjure by Allah anyone who saw the Messenger of Allah (ﷺ) on the day of the army of hardship (i.e., Tabook), when he said: `Who will spend today a spending that will be accepted by Allah?` and I equipped half of the army with my wealth. And some men testified to what he said, Then he said:I adjure by Allah anyone who saw the water of Roomah (a well) being sold to wayfarers, then I bought it with my own wealth and gave it to wayfarers for free.` And some men testified to what he said."}},{"id":20,"idInBook":20,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَنْبَأَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ، عَنْ حُمْرَانَ بْنِ أَبَانَ، قَالَ رَأَيْتُ عُثْمَانَ بْنَ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ تَوَضَّأَ فَأَفْرَغَ عَلَى يَدَيْهِ ثَلَاثًا فَغَسَلَهُمَا ثُمَّ مَضْمَضَ وَاسْتَنْثَرَ ثُمَّ غَسَلَ وَجْهَهُ ثَلَاثًا ثُمَّ غَسَلَ يَدَهُ الْيُمْنَى إِلَى الْمِرْفَقِ ثَلَاثًا ثُمَّ الْيُسْرَى مِثْلَ ذَلِكَ ثُمَّ مَسَحَ بِرَأْسِهِ ثُمَّ غَسَلَ قَدَمَهُ الْيُمْنَى ثَلَاثًا ثُمَّ الْيُسْرَى مِثْلَ ذَلِكَ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَوَضَّأَ نَحْوًا مِنْ وُضُوئِي هَذَا ثُمَّ قَالَ مَنْ تَوَضَّأَ وُضُوئِي هَذَا ثُمَّ صَلَّى رَكْعَتَيْنِ لَا يُحَدِّثُ فِيهِمَا نَفْسَهُ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ‏.‏","english":{"narrator":"It was narrated that  Humran bin Aban said:","text":"I saw `Uthman bin `Affan (رضي الله عنه) do wudoo`, He poured water onto his hands three times and washed them, then he rinsed his mouth and nose, then he washed his face three times, then he washed his right arm up to the elbow three times, then the left arm likewise, then he wiped his head, then he washed his right foot three times, then the left foot likewise. He said: I saw the Messenger of Allah (ﷺ)  do wudoo` similar to what I just did, then he said: “Whoever does wudoo` as I just did, then prays two rak’ahs without letting his mind wander, his previous sins will be forgiven”"}},{"id":21,"idInBook":21,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنْ نُبَيْهِ بْنِ وَهْبٍ، قَالَ أَرْسَلَ عُمَرُ بْنُ عُبَيْدِ اللَّهِ إِلَى أَبَانَ بْنِ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ أَيُكَحِّلُ عَيْنَيْهِ وَهُوَ مُحْرِمٌ أَوْ بِأَيِّ شَيْءٍ يُكَحِّلُهُمَا وَهُوَ مُحْرِمٌ فَأَرْسَلَ إِلَيْهِ أَنْ يُضَمِّدَهُمَا بِالصَّبِرِ فَإِنِّي سَمِعْتُ عُثْمَانَ بْنَ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ يُحَدِّثُ ذَلِكَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ‏.‏","english":{"narrator":"It was narrated that Nubaih bin Wahb said:","text":"`Umar bin `Ubaidullah sent word to Aban bin `Uthman (رضي الله عنه), (to ask) whether he could apply something to his eyes when he was in ihram - or (to ask) what he could apply to his eyes when he was in ihram. He sent word back to him telling him that he could apply aloes to them, and I heard `Uthman bin Affan(رضي الله عنه) narrating that from the Messenger of Allah (ﷺ) ."}},{"id":22,"idInBook":22,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَبْد اللَّهِ، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ، حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، حَدَّثَنَا عِمْرَانُ بْنُ حُدَيْرٍ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُبَيْدٍ، عَنْ حُمْرَانَ بْنِ أَبَانَ، عَنْ عُثْمَانَ بْنِ عَفَّانَ، رَضِيَ اللَّهُ عَنْهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ عَلِمَ أَنَّ الصَّلَاةَ حَقٌّ وَاجِبٌ دَخَلَ الْجَنَّةَ‏.‏","english":{"narrator":"It was narrated from `Uthman bin `Affan that the Prophet (ﷺ) said:","text":"“Whoever knows that prayer is an obligatory duty will enter Paradise.`"}},{"id":23,"idInBook":23,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ، حَدَّثَنِي أَبُو مَعْشَرٍ يَعْنِي الْبَرَّاءَ، وَاسْمُهُ، يُوسُفُ بْنُ يَزِيدَ حَدَّثَنَا ابْنُ حَرْمَلَةَ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، قَالَ حَجَّ عُثْمَانُ حَتَّى إِذَا كَانَ فِي بَعْضِ الطَّرِيقِ أُخْبِرَ عَلِيٌّ أَنَّ عُثْمَانَ نَهَى أَصْحَابَهُ عَنْ التَّمَتُّعِ بِالْعُمْرَةِ وَالْحَجِّ فَقَالَ عَلِيٌّ لِأَصْحَابِهِ إِذَا رَاحَ فَرُوحُوا فَأَهَلَّ عَلِيٌّ وَأَصْحَابُهُ بِعُمْرَةٍ فَلَمْ يُكَلِّمْهُمْ عُثْمَانُ فَقَالَ عَلِيٌّ رَضِيَ اللَّهُ عَنْهُ أَلَمْ أُخْبَرْ أَنَّكَ نَهَيْتَ عَنْ التَّمَتُّعِ أَلَمْ يَتَمَتَّعْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَمَا أَدْرِي مَا أَجَابَهُ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ‏.‏","english":{"narrator":"It was narrated that Sa`eed bin al-Musayyab said,  `Uthman went for Hajj, and when he was halfway there, `Ali was informed that `Uthman had told his companions not to do tamattu`, `Ali said to his companions:","text":"When he sets out, set out too. `Ali and his companions entered ihram for ‘Umrah, and `Uthman did not say anything to them. `Ali said: Have I not been told that you have forbidden tamattu.” Didn`t the Messenger of Allah (ﷺ) do tamattu`? He (the narrator) said: I do not know what answer `Uthman (رضي الله عنه) gave."}},{"id":24,"idInBook":24,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ مَالِكِ بْنِ أَوْسِ بْنِ الْحَدَثَانِ، قَالَ أَرْسَلَ إِلَيَّ عُمَرُ بْنُ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ فَبَيْنَا أَنَا كَذَلِكَ، إِذْ جَاءَهُ مَوْلَاهُ يَرْفَأُ فَقَالَ هَذَا عُثْمَانُ وَعَبْدُ الرَّحْمَنِ وَسَعْدٌ وَالزُّبَيْرُ بْنُ الْعَوَّامِ قَالَ وَلَا أَدْرِي أَذَكَرَ طَلْحَةَ أَمْ لَا يَسْتَأْذِنُونَ عَلَيْكَ قَالَ ائْذَنْ لَهُمْ ثُمَّ مَكَثَ سَاعَةً ثُمَّ جَاءَ فَقَالَ هَذَا الْعَبَّاسُ وَعَلِيٌّ رَضِيَ اللَّهُ عَنْهُمَا يَسْتَأْذِنَانِ عَلَيْكَ قَالَ ائْذَنْ لَهُمَا فَلَمَّا دَخَلَ الْعَبَّاسُ قَالَ يَا أَمِيرَ الْمُؤْمِنِينَ اقْضِ بَيْنِي وَبَيْنَ هَذَا وَهُمَا حِينَئِذٍ يَخْتَصِمَانِ فِيمَا أَفَاءَ اللَّهُ عَلَى رَسُولِهِ مِنْ أَمْوَالِ بَنِي النَّضِيرِ فَقَالَ الْقَوْمُ اقْضِ بَيْنَهُمَا يَا أَمِيرَ الْمُؤْمِنِينَ وَأَرِحْ كُلَّ وَاحِدٍ مِنْ صَاحِبِهِ فَقَدْ طَالَتْ خُصُومَتُهُمَا فَقَالَ عُمَرُ رَضِيَ اللَّهُ عَنْهُ أَنْشُدُكُمْ اللَّهَ الَّذِي بِإِذْنِهِ تَقُومُ السَّمَوَاتُ وَالْأَرْضُ أَتَعْلَمُونَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا نُورَثُ مَا تَرَكْنَا صَدَقَةٌ قَالُوا قَدْ قَالَ ذَلِكَ وَقَالَ لَهُمَا مِثْلَ ذَلِكَ فَقَالَا نَعَمْ قَالَ فَإِنِّي سَأُخْبِرُكُمْ عَنْ هَذَا الْفَيْءِ إِنَّ اللَّهَ عَزَّ وَجَلَّ خَصَّ نَبِيَّهُ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْهُ بِشَيْءٍ لَمْ يُعْطِهِ غَيْرَهُ فَقَالَ ‏{‏وَمَا أَفَاءَ اللَّهُ عَلَى رَسُولِهِ مِنْهُمْ فَمَا أَوْجَفْتُمْ عَلَيْهِ مِنْ خَيْلٍ وَلَا رِكَابٍ‏}‏ وَكَانَتْ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَاصَّةً وَاللَّهِ مَا احْتَازَهَا دُونَكُمْ وَلَا اسْتَأْثَرَ بِهَا عَلَيْكُمْ لَقَدْ قَسَمَهَا بَيْنَكُمْ وَبَثَّهَا فِيكُمْ حَتَّى بَقِيَ مِنْهَا هَذَا الْمَالُ فَكَانَ يُنْفِقُ عَلَى أَهْلِهِ مِنْهُ سَنَةً ثُمَّ يَجْعَلُ مَا بَقِيَ مِنْهُ مَجْعَلَ مَالِ اللَّهِ فَلَمَّا قُبِضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ أَنَا وَلِيُّ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْدَهُ أَعْمَلُ فِيهَا بِمَا كَانَ يَعْمَلُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيهَا‏.‏","english":{"narrator":"It was narrated that Malik bin Aws bin al-Hadathan said:","text":"`Umar bin al-Khattab (رضي الله عنه) sent for me, and whilst I was like that, his freed slave Yarfa` came and said: ‘Uthman, `Abdur-Rahman, Sa’d and az-Zubair bin al-`Awwam are here - (the narrator) said: I do not know whether he mentioned Talhah or not - and they are asking for permission to enter upon you. He said: Let them in. Then after a while, (Yarfa`) came and said: al-`Abbas and ‘Ali are asking permission to enter upon you. He said: Let them in. When al`Abbas came in, he said: O Ameer al-Mu`mineen, judge between me and this one. They had a dispute at that time concerning the fai’ (booty) that Allah had granted to His Messenger of the wealth of Banun-Nadeer, The people said: Judge between them, O Ameer al-Mu`mineen, and relieve each one of his opponent, for their dispute has gone on too long. ‘Umar (رضي الله عنه) said: I adjure you by Allah, by Whose Leave heaven and earth exist, do you know that the Messenger of Allah (ﷺ)  said, “We are not to be inherited from; what we leave behind is charity`? They said: He did say that. He said: I shall tell you about that fai`; Allah, may He be glorified and exalted, gave something exclusively to His Prophet (ﷺ) that He did not give to anyone else. And he quoted the verse: `And what Allah gave as booty (Fai’) to His Messenger\n(Muhammad (ﷺ)) from them - for this you made no expedition with either cavalry or camelry` . He said: `This was exclusively for the Messenger of Allah (ﷺ) and by Allah, he did not keep it to himself in exclusion of you and he did not prefer himself over you with regard to it. Rather he gave it to you and divided it among you until there was nothing left of it except this property. He spent on his family`s needs from this property for one year, then he took what was left and regarded it as the property of Allah. When the Messenger of Allah (ﷺ) passed away, Abu Bakr said: `I am the successor of the Messenger of Allah (ﷺ), I shall deal with it as the Messenger of Allah (ﷺ)  dealt with it."}},{"id":25,"idInBook":25,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنَا إِسْمَاعِيلُ أَبُو مَعْمَرٍ، حَدَّثَنَا يَحْيَى بْنُ سُلَيْمٍ الطَّائِفِيُّ، عَنْ إِسْمَاعِيلَ بْنِ أُمَيَّةَ، عَنْ مُوسَى بْنِ عِمْرَانَ بْنِ مَنَّاحٍ، عَنْ أَبَانَ بْنِ عُثْمَانَ، عَنْ عُثْمَانَ، رَضِيَ اللَّهُ عَنْهُ أَنَّهُ رَأَى جَنَازَةً فَقَامَ إِلَيْهَا وَقَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى جَنَازَةً فَقَامَ لَهَا‏.‏","english":{"narrator":"It was narrated from `Uthman that he saw a funeral and stood up for it and said:","text":"I saw the Messenger of Allah (ﷺ)  see a funeral and stand up for it."}},{"id":26,"idInBook":26,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنْ سَعِيدِ بْنِ عَبْدِ اللَّهِ بْنِ قَارِظٍ، عَنْ أَبِي عُبَيْدٍ، قَالَ شَهِدْتُ عَلِيًّا وَعُثْمَانَ رَضِيَ اللَّهُ عَنْهُمَا فِي يَوْمِ الْفِطْرِ وَالنَّحْرِ يُصَلِّيَانِ ثُمَّ يَنْصَرِفَانِ فَيُذَكِّرَانِ النَّاسَ فَسَمِعْتُهُمَا يَقُولَانِ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ صَوْمِ هَذَيْنِ الْيَوْمَيْنِ حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ أَخْبَرَنَا ابْنُ جُرَيْجٍ حَدَّثَنِي ابْنُ شِهَابٍ عَنْ عَطَاءِ بْنِ يَزِيدَ الْجُنْدَعِيِّ أَنَّهُ سَمِعَ حُمْرَانَ مَوْلَى عُثْمَانَ بْنِ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ قَالَ رَأَيْتُ أَمِيرَ الْمُؤْمِنِينَ عُثْمَانَ يَتَوَضَّأُ فَأَهْرَاقَ عَلَى يَدَيْهِ ثَلَاثَ مَرَّاتٍ ثُمَّ اسْتَنْثَرَ ثَلَاثَ مَرَّاتٍ وَمَضْمَضَ ثَلَاثًا وَذَكَرَ الْحَدِيثَ مِثْلَ مَعْنَى حَدِيثِ مَعْمَرٍ‏.‏","english":{"narrator":"It was narrated that Abu `Ubaid said:","text":"I saw `Ali and `Uthman (رضي الله عنه)on the day of (Eid) al-fitr and (Eid) al-Adhaa; they prayed, then when they finished they reminded the people. I heard them saying. The Messenger of Allah (ﷺ)  forbade fasting on these two days,\n\n\nIt was narrated from `Ata` bin Yazeed al-Junda`i that he heard Humran the freed slave of `Uthman bin `Affan (رضي الله عنه), say.  I saw Ameer al-Mu`mineen `Uthman do wudoo’; he poured water onto his hands three times, then he rinsed his nose three times and rinsed his mouth three times... and he mentioned the Hadeeth, similar to the Hadeeth of Ma`mar."}},{"id":27,"idInBook":27,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَنْبَأَنَا الْجُرَيْرِيُّ، عَنْ عُرْوَةَ بْنِ قَبِيصَةَ، عَنْ رَجُلٍ، مِنْ الْأَنْصَارِ عَنْ أَبِيهِ، أَنَّ عُثْمَانَ، رَضِيَ اللَّهُ عَنْهُ قَالَ أَلَا أُرِيكُمْ كَيْفَ كَانَ وُضُوءُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالُوا بَلَى فَدَعَا بِمَاءٍ فَتَمَضْمَضَ ثَلَاثًا وَاسْتَنْثَرَ ثَلَاثًا وَغَسَلَ وَجْهَهُ وَذِرَاعَيْهِ ثَلَاثًا وَمَسَحَ بِرَأْسِهِ وَغَسَلَ قَدَمَيْهِ ثَلَاثًا ثُمَّ قَالَ وَاعْلَمُوا أَنَّ الْأُذُنَيْنِ مِنْ الرَّأْسِ ثُمَّ قَالَ قَدْ تَحَرَّيْتُ لَكُمْ وُضُوءَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ‏.‏","english":{"narrator":"It was narrated from one of the Ansar, from his father, that `Uthman (رضي الله عنه) said:","text":"Shall l not show you how the Messenger of Allah (ﷺ)  did wudoo? They said: Yes. So he called for water, and he rinsed his mouth three times and his nose three times, and he washed his face and arms three times, and he wiped his head and washed his feet three times. Then he said: You should know that the ears are part of the head. Then he said: I have tried to do wudoo’ for you as the Messenger of Allah (ﷺ) did it."}},{"id":28,"idInBook":28,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا إِسْحَاقُ بْنُ يُوسُفَ، حَدَّثَنَا عَوْفٌ الْأَعْرَابِيُّ، عَنْ مَعْبَدٍ الْجُهَنِيِّ، عَنْ حُمْرَانَ بْنِ أَبَانَ، قَالَ كُنَّا عِنْدَ عُثْمَانَ بْنِ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ فَدَعَا بِمَاءٍ فَتَوَضَّأَ فَلَمَّا فَرَغَ مِنْ وُضُوئِهِ تَبَسَّمَ فَقَالَ هَلْ تَدْرُونَ مِمَّا ضَحِكْتُ قَالَ فَقَالَ تَوَضَّأَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَمَا تَوَضَّأْتُ ثُمَّ تَبَسَّمَ ثُمَّ قَالَ هَلْ تَدْرُونَ مِمَّ ضَحِكْتُ قَالَ قُلْنَا اللَّهُ وَرَسُولُهُ أَعْلَمُ قَالَ إِنَّ الْعَبْدَ إِذَا تَوَضَّأَ فَأَتَمَّ وُضُوءَهُ ثُمَّ دَخَلَ فِي صَلَاتِهِ فَأَتَمَّ صَلَاتَهُ خَرَجَ مِنْ صَلَاتِهِ كَمَا خَرَجَ مِنْ بَطْنِ أُمِّهِ مِنْ الذُّنُوبِ‏.‏","english":{"narrator":"It was narrated that Humran bin Aban said:","text":"We were with `Uthman bin `Affan (رضي الله عنه), he called for water and did wudoo’. When he had finished his wudoo`, he smiled and said: Do you know why I smiled?  He said: The Messenger of Allah (ﷺ) did wudoo` as I just did wudoo`, then he smiled and said: “Do you know why I smiled?` we said: Allah and His Messenger know best. He said: “If a person does wudoo and completes his wudoo’, then he starts to pray and completes his prayer, he will come out of his prayer free of sin as he came out of his mother`s womb.”"}},{"id":29,"idInBook":29,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا رَوْحٌ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ شَقِيقٍ، يَقُولُ كَانَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ يَنْهَى عَنْ الْمُتْعَةِ وَعَلِيٌّ رَضِيَ اللَّهُ عَنْهُ يُفْتِي بِهَا فَقَالَ لَهُ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ قَوْلًا فَقَالَ لَهُ عَلِيٌّ رَضِيَ اللَّهُ عَنْهُ لَقَدْ عَلِمْتَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَعَلَ ذَلِكَ قَالَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ أَجَلْ وَلَكِنَّا كُنَّا خَائِفِينَ قَالَ شُعْبَةُ فَقُلْتُ لِقَتَادَةَ مَا كَانَ خَوْفُهُمْ قَالَ لَا أَدْرِي‏.‏","english":{"narrator":"It was narrated that Qatadah said:","text":"I heard `Abdullah bin Shaqeeq say: `Uthman (رضي الله عنه) forbade tamattu` and `Ali enjoined it. `Uthman (رضي الله عنه) said something and ‘Ali (رضي الله عنه) said to him, You know that the Messenger of Allah (ﷺ) did that. `Uthman (رضي الله عنه) said: Yes, but we were in a state of fear . Shu`bah said: I said to Qatadah: What were they afraid of? He said: I do not know,"}},{"id":30,"idInBook":30,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، قَالَ قَالَ عَبْدُ اللَّهِ بْنُ شَقِيقٍ كَانَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ يَنْهَى عَنْ الْمُتْعَةِ وَعَلِيٌّ رَضِيَ اللَّهُ عَنْهُ يَأْمُرُ بِهَا فَقَالَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ لِعَلِيٍّ قَوْلًا ثُمَّ قَالَ عَلِيٌّ رَضِيَ اللَّهُ عَنْهُ لَقَدْ عَلِمْتَ أَنَّا قَدْ تَمَتَّعْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَجَلْ وَلَكِنَّا كُنَّا خَائِفِينَ‏.‏","english":{"narrator":"It was narrated that Qatadah said.  `Abdullah bin Shaqeeq said:","text":"`Uthman used to forbid mut’ah (of Hajj, i.e., tamattu`) and ‘Ali used to enjoin it. `Uthman said something to `Ali, then `Ali said: You know that we did tamattu` with the Messenger of Allah (ﷺ) . He said: Yes, but we were in a state of fear then."}},{"id":31,"idInBook":31,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا رَوْحٌ، حَدَّثَنَا كَهْمَسٌ، عَنْ مُصْعَبِ بْنِ ثَابِتٍ، عَنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، قَالَ قَالَ عُثْمَانُ بْنُ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ وَهُوَ يَخْطُبُ عَلَى مِنْبَرِهِ إِنِّي مُحَدِّثُكُمْ حَدِيثًا سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا كَانَ يَمْنَعُنِي أَنْ أُحَدِّثَكُمْ إِلَّا الضِّنُّ عَلَيْكُمْ وَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ حَرَسُ لَيْلَةٍ فِي سَبِيلِ اللَّهِ تَعَالَى أَفْضَلُ مِنْ أَلْفِ لَيْلَةٍ يُقَامُ لَيْلُهَا وَيُصَامُ نَهَارُهَا‏.‏","english":{"narrator":"It was narrated that ‘Abdullah bin az-Zubair said:","text":"`Uthman bin `Affan (رضي الله عنه) said, speaking from his minbar I am going to tell you a hadeeth that I heard from the Messenger of Allah (ﷺ) , nothing kept me from telling it to you except the fact that I care for you, I heard the Messenger of Allah (ﷺ) say: `Standing guard for one night for the sake of Allah, may He be exalted, is better than a thousand nights spent in prayer and  days spent fasting.”"}},{"id":32,"idInBook":32,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَبْدُ الْكَبِيرِ بْنُ عَبْدِ الْمَجِيدِ أَبُو بَكْرٍ الْحَنَفِيُّ، حَدَّثَنَا عَبْدُ الْحَمِيدِ يَعْنِي ابْنَ جَعْفَرٍ، عَنْ أَبِيهِ، عَنْ مَحْمُودِ بْنِ لَبِيدٍ، عَنْ عُثْمَانَ بْنِ عَفَّانَ، رَضِيَ اللَّهُ عَنْهُ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ بَنَى مَسْجِدًا لِلَّهِ عَزَّ وَجَلَّ بَنَى اللَّهُ لَهُ مِثْلَهُ فِي الْجَنَّةِ‏.‏","english":{"narrator":"It was narrated that `Uthman bin `Affan (رضي الله عنه) said:","text":"I heard the Messenger of Allah (ﷺ)  say: `Whoever builds a mosque for the sake of Allah, may He be glorified and exalted. Allah will build something like it for him in Paradise.”"}},{"id":33,"idInBook":33,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنْ سَعِيدِ بْنِ خَالِدِ بْنِ عَبْدِ اللَّهِ بْنِ قَارِظٍ، عَنْ أَبِي عُبَيْدٍ، مَوْلَى عَبْدِ الرَّحْمَنِ بْنِ أَزْهَرَ قَالَ رَأَيْتُ عَلِيًّا رَضِيَ اللَّهُ عَنْهُ وَعُثْمَانَ يُصَلِّيَانِ يَوْمَ الْفِطْرِ وَالْأَضْحَى ثُمَّ يَنْصَرِفَانِ يُذَكِّرَانِ النَّاسَ قَالَ وَسَمِعْتُهُمَا يَقُولَانِ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ صِيَامِ هَذَيْنِ الْيَوْمَيْنِ‏.‏\n\nقَالَ و سَمِعْت عَلِيًّا، رَضِيَ اللَّهُ عَنْهُ يَقُولُ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَبْقَى مِنْ نُسُكِكُمْ عِنْدَكُمْ شَيْءٌ بَعْدَ ثَلَاثٍ‏.‏","english":{"narrator":"It was narrated that Abu ‘Ubaid, the freed slave of ‘AbdurRahman bin Azhar, said:","text":"I saw `Ali (رضي الله عنه) and ‘Uthman (رضي الله عنه) praying on the day of al-Fitr and the day of al-Adha, then they reminded the people. And I heard them say: The Messenger of Allah (ﷺ)  forbade fasting on these two days. And I heard ‘Ali (رضي الله عنه) say: The Messenger of Allah (ﷺ) forbade anything of the sacrificial meat to be left after three days."}},{"id":34,"idInBook":34,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا صَفْوَانُ بْنُ عِيسَى، عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي مَرْيَمَ، قَالَ دَخَلْتُ عَلَى ابْنِ دَارَةَ مَوْلَى عُثْمَانَ قَالَ فَسَمِعَنِي أُمَضْمِضُ، قَالَ فَقَالَ يَا مُحَمَّدُ قَالَ قُلْتُ لَبَّيْكَ قَالَ أَلَا أُخْبِرُكَ عَنْ وُضُوءِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ رَأَيْتُ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ وَهُوَ بِالْمَقَاعِدِ دَعَا بِوَضُوءٍ فَمَضْمَضَ ثَلَاثًا وَاسْتَنْشَقَ ثَلَاثًا وَغَسَلَ وَجْهَهُ ثَلَاثًا وَذِرَاعَيْهِ ثَلَاثًا وَمَسَحَ بِرَأْسِهِ ثَلَاثًا وَغَسَلَ قَدَمَيْهِ ثُمَّ قَالَ مَنْ أَحَبَّ أَنْ يَنْظُرَ إِلَى وُضُوءِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَهَذَا وُضُوءُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ‏.‏","english":{"narrator":"It was narrated that Muhammad bin ‘Abdullah bin Abi Maryam said:","text":"I entered upon Ibn Darah, the freed slave of `Uthman, and he heard me rinsing my mouth. He said: O Muhammad! I said: Here I am. He said:Shall I not tell you about the wudoo’ of the Messenger of Allah (ﷺ)? I saw `Uthman when he was in al-Maqa`id. He called for water for wudoo’, then he rinsed his mouth three times, rinsed his nose three times, washed his face three times, washed his arms three times, wiped his head three times and washed his feet, then he said: Whoever would like to see how the Messenger of Allah (ﷺ) did wudoo’, this is how the Messenger of Allah (ﷺ) did wudoo`."}},{"id":35,"idInBook":35,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، وَعَفَّانُ الْمَعْنَى، قَالَا حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ أَبِي أُمَامَةَ بْنِ سَهْلٍ، قَالَ كُنَّا مَعَ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ وَهُوَ مَحْصُورٌ فِي الدَّارِ فَدَخَلَ مَدْخَلًا كَانَ إِذَا دَخَلَهُ يَسْمَعُ كَلَامَهُ مَنْ عَلَى الْبَلَاطِ قَالَ فَدَخَلَ ذَلِكَ الْمَدْخَلَ وَخَرَجَ إِلَيْنَا فَقَالَ إِنَّهُمْ يَتَوَعَّدُونِي بِالْقَتْلِ آنِفًا قَالَ قُلْنَا يَكْفِيكَهُمُ اللَّهُ يَا أَمِيرَ الْمُؤْمِنِينَ قَالَ وَبِمَ يَقْتُلُونَنِي إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا يَحِلُّ دَمُ امْرِئٍ مُسْلِمٍ إِلَّا بِإِحْدَى ثَلَاثٍ رَجُلٌ كَفَرَ بَعْدَ إِسْلَامِهِ أَوْ زَنَى بَعْدَ إِحْصَانِهِ أَوْ قَتَلَ نَفْسًا فَيُقْتَلُ بِهَا فَوَاللَّهِ مَا أَحْبَبْتُ أَنَّ لِي بِدِينِي بَدَلًا مُنْذُ هَدَانِي اللَّهُ وَلَا زَنَيْتُ فِي جَاهِلِيَّةٍ وَلَا فِي إِسْلَامٍ قَطُّ وَلَا قَتَلْتُ نَفْسًا فَبِمَ يَقْتُلُونَنِي حَدَّثَنَا عَبْد اللَّهِ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ حَدَّثَنَا أَبُو أُمَامَةَ بْنُ سَهْلِ بْنِ حُنَيْفٍ قَالَ إِنِّي لَمَعَ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ فِي الدَّارِ وَهُوَ مَحْصُورٌ وَقَالَ كُنَّا نَدْخُلُ مَدْخَلًا فَذَكَرَ الْحَدِيثَ مِثْلَهُ وَقَالَ قَدْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فَذَكَرَ الْحَدِيثَ مِثْلَهُ أَوْ نَحْوَهُ‏.‏","english":{"narrator":"It was narrated that Abu Umamah bin Sahl said:","text":"We were with ‘Uthman when he was under siege in the house. He went to the entrance of the house, from which his words could be heard in alBalat. He went to that entrance, then came out to us and said:They were threatening to kill me just now. We said: Allah will suffice you against them. O Ameer al-Mu`mineen. He said: Why would they kill me? I heard the Messenger of Allah (ﷺ)  say: `It is not permissible (to shed) the blood of a Muslim except in three cases: if a man disbelieves after becoming Muslim, or commits zina after being married, or kills someone and is executed in return.” By Allah, I have never wished to change my religion after Allah guided me; I never committed zina either during the Jahiliyyah or in Islam; and I have never killed anyone. So why would they kill me\n\n\nAbu Umamah bin Sahl bin Hunaif narrated: I was with `Uthman (رضي الله عنه) in the house when he was under siege. We would enter through an entrance... and he narrated a similar hadeeth. And he said: I heard the Messenger of Allah (ﷺ)  say:... and he narrated a similar hadeeth,"}},{"id":36,"idInBook":36,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَبْدُ الصَّمَدِ، حَدَّثَنَا الْقَاسِمُ يَعْنِي ابْنَ الْفَضْلِ، حَدَّثَنَا عَمْرُو بْنُ مُرَّةَ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، قَالَ دَعَا عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ نَاسًا مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيهِمْ عَمَّارُ بْنُ يَاسِرٍ فَقَالَ إِنِّي سَائِلُكُمْ وَإِنِّي أُحِبُّ أَنْ تَصْدُقُونِي نَشَدْتُكُمْ اللَّهَ أَتَعْلَمُونَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُؤْثِرُ قُرَيْشًا عَلَى سَائِرِ النَّاسِ وَيُؤْثِرُ بَنِي هَاشِمٍ عَلَى سَائِرِ قُرَيْشٍ فَسَكَتَ الْقَوْمُ فَقَالَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ لَوْ أَنَّ بِيَدِي مَفَاتِيحَ الْجَنَّةِ لَأَعْطَيْتُهَا بَنِي أُمَيَّةَ حَتَّى يَدْخُلُوا مِنْ عِنْدِ آخِرِهِمْ فَبَعَثَ إِلَى طَلْحَةَ وَالزُّبَيْرِ فَقَالَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ أَلَا أُحَدِّثُكُمَا عَنْهُ يَعْنِي عَمَّارًا أَقْبَلْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ آخِذًا بِيَدِي نَتَمَشَّى فِي الْبَطْحَاءِ حَتَّى أَتَى عَلَى أَبِيهِ وَأُمِّهِ وَعَلَيْهِ يُعَذَّبُونَ فَقَالَ أَبُو عَمَّارٍ يَا رَسُولَ اللَّهِ الدَّهْرَ هَكَذَا فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اصْبِرْ ثُمَّ قَالَ اللَّهُمَّ اغْفِرْ لِآلِ يَاسِرٍ وَقَدْ فَعَلْتُ‏.‏","english":{"narrator":"It was narrated that Salim bin Abul-Ja`d said, `Uthman (رضي الله عنه) called some of the Companions of the Messenger of Allah (ﷺ), among whom was ‘Ammar bin Yasir, and said:","text":"I am going to ask you something and I would like you to be honest with me. I adjure you by Allah, do you know that the Messenger of Allah (ﷺ) used to give Quraish precedence over all people and he gave precedence to Banu Hashim over all of Quraish? The people fell silent, then `Uthman said: If I had the keys of Paradise in my hand, I would have given them to Banu Umayyah  father and mother were being tortured. ‘Ammar`s father said: O Messenger of Allah (ﷺ), are we going to be like this forever? The Prophet (ﷺ) said to him: `Be patient.” Then he said: “O Allah, forgive the family of Yasir, and You have already done so.”"}},{"id":37,"idInBook":37,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَبْدُ الصَّمَدِ، حَدَّثَنَا حُرَيْثُ بْنُ السَّائِبِ، قَالَ سَمِعْتُ الْحَسَنَ، يَقُولُ حَدَّثَنِي حُمْرَانُ، عَنْ عُثْمَانَ بْنِ عَفَّانَ، رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ كُلُّ شَيْءٍ سِوَى ظِلِّ بَيْتٍ وَجِلْفِ الْخُبْزِ وَثَوْبٍ يُوَارِي عَوْرَتَهُ وَالْمَاءِ فَمَا فَضَلَ عَنْ هَذَا فَلَيْسَ لِابْنِ آدَمَ فِيهِ حَقٌّ‏.‏","english":{"narrator":"It was narrated from ‘Uthman bin `Affan (رضي الله عنه) that the Messenger of Allah (ﷺ) to said:","text":"`Everything apart from the shade of a house, a sack of bread, a garment to cover his `awrah and water, anything more than that the son of Adam has no right to.”"}},{"id":38,"idInBook":38,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بَكْرٍ، حَدَّثَنَا حُمَيْدٌ الطَّوِيلُ، عَنْ شَيْخٍ، مِنْ ثَقِيفٍ ذَكَرَهُ حُمَيْدٌ بِصَلَاحٍ ذَكَرَ أَنَّ عَمَّهُ أخْبَرَهُ أَنَّهُ رَأَى عُثْمَانَ بْنَ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ جَلَسَ عَلَى الْبَابِ الثَّانِي مِنْ مَسْجِدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَدَعَا بِكَتِفٍ فَتَعَرَّقَهَا ثُمَّ قَامَ فَصَلَّى وَلَمْ يَتَوَضَّأْ ثُمَّ قَالَ جَلَسْتُ مَجْلِسَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَكَلْتُ مَا أَكَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَصَنَعْتُ مَا صَنَعَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ‏.‏","english":{"narrator":"It was narrated that an old man of Thaqeef - Humaid said that he was righteous - said that his paternal uncle told him that he saw `Uthman (رضي الله عنه) sitting at the second door of the mosque of the Messenger of Allah (ﷺ) . He called for a shoulder  and ate its meat, then he got up and prayed, without doing wudoo’. Then he said:","text":"I sat where the Prophet (ﷺ) sat and I ate what the Prophet (ﷺ) ate, and I did what the Prophet (ﷺ) did."}},{"id":39,"idInBook":39,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا أَبُو سَعِيدٍ، مَوْلَى بَنِي هَاشِمٍ حَدَّثَنَا ابْنُ لَهِيعَةَ، حَدَّثَنَا زُهْرَةُ بْنُ مَعْبَدٍ، عَنْ أَبِي صَالِحٍ، مَوْلَى عُثْمَانَ أَنَّهُ حَدَّثَهُ قَالَ سَمِعْتُ عُثْمَانَ، بِمِنًى يَقُولُ يَا أَيُّهَا النَّاسُ إِنِّي أُحَدِّثُكُمْ حَدِيثًا سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ رِبَاطُ يَوْمٍ فِي سَبِيلِ اللَّهِ أَفْضَلُ مِنْ أَلْفِ يَوْمٍ فِيمَا سِوَاهُ فَلْيُرَابِطْ امْرُؤٌ كَيْفَ شَاءَ هَلْ بَلَّغْتُ قَالُوا نَعَمْ قَالَ اللَّهُمَّ اشْهَدْ‏.‏","english":{"narrator":"it was narrated that Abu Salih, the freed slave of `Uthman, said:","text":"I heard `Uthman in Mina saying:  O people, I shall tell you a hadeeth that I heard from the Messenger of Allah (ﷺ) . He said: `Standing guard on the border for one day for the sake of Allah is better than one thousand ordinary days, so let a man stand on guard at the border as much as he wants.” ? They said: Yes. He said: O Allah, bear witness."}},{"id":40,"idInBook":40,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا أَبُو سَعِيدٍ يَعْنِي مَوْلَى بَنِي هَاشِمٍ، حَدَّثَنَا عِكْرِمَةُ بْنُ إِبْرَاهِيمَ الْبَاهِلِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ أَبِي ذُبَابٍ، عَنْ أَبِيهِ، أَنَّ عُثْمَانَ بْنَ عَفَّانَ، رَضِيَ اللَّهُ عَنْهُ صَلَّى بِمِنًى أَرْبَعَ رَكَعَاتٍ فَأَنْكَرَهُ النَّاسُ عَلَيْهِ فَقَالَ يَا أَيُّهَا النَّاسُ إِنِّي تَأَهَّلْتُ بِمَكَّةَ مُنْذُ قَدِمْتُ وَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ تَأَهَّلَ فِي بَلَدٍ فَلْيُصَلِّ صَلَاةَ الْمُقِيمِ‏.‏","english":{"narrator":"`Abdullah bin ‘AbdurRahman bin Abi Dhubab narrated from his father that ‘Uthman bin ‘Affan (رضي الله عنه) prayed four rak`ahs in Mina and the people objected to that. He said:","text":"O people, I have taken a wife in Makkah since I came here, and I heard the Messenger of Allah (ﷺ)say: “Whoever takes a wife in a city should offer the prayer of one who is a resident (i.e., in full)."}},{"id":41,"idInBook":41,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا أَبُو سَعِيدٍ، مَوْلَى بَنِي هَاشِمٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ لَهِيعَةَ، حَدَّثَنَا مُوسَى بْنُ وَرْدَانَ، قَالَ سَمِعْتُ سَعِيدَ بْنَ الْمُسَيَّبِ، يَقُولُ سَمِعْتُ عُثْمَانَ، رَضِيَ اللَّهُ عَنْهُ يَخْطُبُ عَلَى الْمِنْبَرِ وَهُوَ يَقُولُ كُنْتُ أَبْتَاعُ التَّمْرَ مِنْ بَطْنٍ مِنْ الْيَهُودِ يُقَالُ لَهُمْ بَنُو قَيْنُقَاعَ فَأَبِيعُهُ بِرِبْحٍ فَبَلَغَ ذَلِكَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا عُثْمَانُ إِذَا اشْتَرَيْتَ فَاكْتَلْ وَإِذَا بِعْتَ فَكِلْ حَدَّثَنَا يَحْيَى بْنُ إِسْحَاقَ حَدَّثَنَا ابْنُ لَهِيعَةَ حَدَّثَنَا مُوسَى بْنُ وَرْدَانَ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ عُثْمَانَ بْنِ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ فَذَكَرَ مِثْلَهُ‏.‏","english":{"narrator":"Sa`eed bin al-Musayyab said. I heard ‘Uthman (رضي الله عنه) delivering a khutbah from the minbar. He said:","text":"I used to buy dates from one of the Jewish clans who were called Banu Qainuqa`, and sell them at a profit. News of that reached the Messenger of Allah (ﷺ)  who said: `O `Uthman, when you buy, take your dues with nothing extra, and when you sell, give (the other party`s) dues with nothing less.`\n\n\nMoosa bin Wardan narrated from Sa`eed bin al-Musayyab from ‘Uthman bin `Affan (رضي الله عنه)... and he mentioned a similar report."}},{"id":42,"idInBook":42,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عُبَيْدُ بْنُ أَبِي قُرَّةَ، حَدَّثَنَا ابْنُ أَبِي الزِّنَادِ، عَنْ أَبِيهِ، عَنْ أَبَانَ بْنِ عُثْمَانَ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ قَالَ بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ لَمْ يَضُرَّهُ شَيْءٌ‏.‏","english":{"narrator":"It was narrated from Aban bin `Uthman that his father said:","text":"The Messenger of Allah (ﷺ) said: `Whoever says in the Name of Allah, with whose name nothing on earth or in heaven can cause harm, and He is the All-Hearing, All-Knowing, nothing will harm him.`"}},{"id":43,"idInBook":43,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَبْدُ الْوَهَّابِ الْخَفَّافُ، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ مُسْلِمِ بْنِ يَسَارٍ، عَنْ حُمْرَانَ بْنِ أَبَانَ، أَنَّ عُثْمَانَ بْنَ عَفَّانَ، رَضِيَ اللَّهُ عَنْهُ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنِّي لَأَعْلَمُ كَلِمَةً لَا يَقُولُهَا عَبْدٌ حَقًّا مِنْ قَلْبِهِ إِلَّا حُرِّمَ عَلَى النَّارِ فَقَالَ لَهُ عُمَرُ بْنُ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ أَنَا أُحَدِّثُكَ مَا هِيَ هِيَ كَلِمَةُ الْإِخْلَاصِ الَّتِي أَعَزَّ اللَّهُ تَبَارَكَ وَتَعَالَى بِهَا مُحَمَّدًا صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَصْحَابَهُ وَهِيَ كَلِمَةُ التَّقْوَى الَّتِي أَلَاصَ عَلَيْهَا نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَمَّهُ أَبَا طَالِبٍ عِنْدَ الْمَوْتِ شَهَادَةُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ‏.‏","english":{"narrator":"It was narrated from Hurman bin Aban that `Uthman bin `Affan (رضي الله عنه) said:","text":"I heard the Messenger of Allah (ﷺ)  say: `I know a word which no one says, sincerely from the heart, but he will be forbidden to the Fire.” `Umar bin al-Khattab (رضي الله عنه) said to him: I will tell you what it is: it is the word of al-ikhlas by means of which Allah, may He be blessed and exalted, caused Muhammad (ﷺ) and his companions to prevail and it is the word of taqwa that the Prophet (ﷺ) of Allah  urged his uncle Abu Talib to say when he was dying, the testimony that there is no god but Allah."}},{"id":44,"idInBook":44,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَبْدُ الصَّمَدِ، حَدَّثَنِي أَبِي، حَدَّثَنَا الْحُسَيْنُ يَعْنِي الْمُعَلِّمَ، عَنْ يَحْيَى يَعْنِي ابْنَ أَبِي كَثِيرٍ، أَخْبَرَنِي أَبُو سَلَمَةَ، أَنَّ عَطَاءَ بْنَ يَسَارٍ، أخْبَرَهُ أَنَّ زَيْدَ بْنَ خَالِدٍ الْجُهَنِيَّ أَخْبَرَهُ أَنَّهُ، سَأَلَ عُثْمَانَ بْنَ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ قُلْتُ أَرَأَيْتَ إِذَا جَامَعَ امْرَأَتَهُ وَلَمْ يُمْنِ فَقَالَ عُثْمَانُ يَتَوَضَّأُ كَمَا يَتَوَضَّأُ لِلصَّلَاةِ وَيَغْسِلُ ذَكَرَهُ وَقَالَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلْتُ عَنْ ذَلِكَ عَلِيَّ بْنَ أَبِي طَالِبٍ رَضِيَ اللَّهُ عَنْهُ وَالزُّبَيْرَ بْنَ الْعَوَّامِ وَطَلْحَةَ بْنَ عُبَيْدِ اللَّهِ وَأُبَيَّ بْنَ كَعْبٍ فَأَمَرُوهُ بِذَلِكَ‏.‏","english":{"narrator":"Abu Salamah narrated that ‘Ata` bin Yasar told him that Zaid bin Khalid al-Juhani told him that he asked ‘Uthman bin `Affan (رضي الله عنه):","text":"What do you think if a man has intercourse with his wife but does not ejaculate? `Uthman(رضي الله عنه) Said. He should do wudoo` as for prayer and wash his private part. And `Uthman (رضي الله عنه) said: I heard it from the Messenger of Allah (ﷺ); I asked ‘Ali bin Abi Talib, az-Zubair bin al-` Awwam, Talhah bin `Ubaidullah and Ubayy bin Ka`b about that, and they told him to do the same."}},{"id":45,"idInBook":45,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عُبَيْدُ بْنُ أَبِي قُرَّةَ، قَالَ سَمِعْتُ مَالِكَ بْنَ أَنَسٍ، يَقُولُ نَرْفَعُ دَرَجَاتٍ مَنْ نَشَاءُ قَالَ بِالْعِلْمِ قُلْتُ مَنْ حَدَّثَكَ قَالَ زَعَمَ ذَاكَ زَيْدُ بْنُ أَسْلَمَ‏.‏","english":{"narrator":"`Ubaid bin Abi Qurrah said:","text":"I heard Malik bin Anas say: `We raise whom We will in degrees` |al-An’am 6.83). He said:  by means of knowledge. I said: Who told you that? He said. Zaid bin Aslam said that."}},{"id":46,"idInBook":46,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، حَدَّثَنَا مَسَرَّةُ بْنُ مَعْبَدٍ، عَنْ يَزِيدَ بْنِ أَبِي كَبْشَةَ، عَنْ عُثْمَانَ بْنِ عَفَّانَ، رَضِيَ اللَّهُ عَنْهُ قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي صَلَّيْتُ فَلَمْ أَدْرِ أَشَفَعْتُ أَمْ أَوْتَرْتُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِيَّايَ وَأَنْ يَتَلَعَّبَ بِكُمْ الشَّيْطَانُ فِي صَلَاتِكُمْ مَنْ صَلَّى مِنْكُمْ فَلَمْ يَدْرِ أَشَفَعَ أَوْ أَوْتَرَ فَلْيَسْجُدْ سَجْدَتَيْنِ فَإِنَّهُمَا تَمَامُ صَلَاتِهِ.\n\nحَدَّثَنَا يَحْيَى بْنُ مَعِينٍ وَزِيَادُ بْنُ أَيُّوبَ قَالَا حَدَّثَنَا سَوَّارٌ أَبُو عُمَارَةَ الرَّمْلِيُّ عَنْ مَسِيرَةَ بْنِ مَعْبَدٍ قَالَ صَلَّى بِنَا يَزِيدُ بْنُ أَبِي كَبْشَةَ الْعَصْرَ فَانْصَرَفَ إِلَيْنَا بَعْدَ صَلَاتِهِ فَقَالَ إِنِّي صَلَّيْتُ مَعَ مَرْوَانَ بْنِ الْحَكَمِ فَسَجَدَ مِثْلَ هَاتَيْنِ السَّجْدَتَيْنِ ثُمَّ انْصَرَفَ إِلَيْنَا فَأَعْلَمَنَا أَنَّهُ صَلَّى مَعَ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ وَحَدَّثَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ مِثْلَهُ نَحْوَهُ‏.‏","english":{"narrator":"It was narrated that `Uthman bin `Affan (رضي الله عنه) said:","text":"A man came to the Prophet (ﷺ)  and said: O Messenger of Allah (ﷺ), I prayed but I do not know whether I did an even number  or an odd number, let him prostrate twice, for that will complete his prayer.` \n\n\nIt was narrated that Masarrah bin Ma`bad said: Yazeed bin Abi Kabshah led us in praying `Asr, then he turned to us after the prayer and said: I prayed with Marwan bin al-Hakam and he did two prostrations like these, then he turned to us and told us that he prayed with ‘Uthman (رضي الله عنه), who narrated from the Prophet (ﷺ) ... and he mentioned a similar report."}},{"id":47,"idInBook":47,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا إِسْحَاقُ بْنُ سُلَيْمَانَ، قَالَ سَمِعْتُ مُغِيرَةَ بْنَ مُسْلِمٍ أَبَا سَلَمَةَ، يَذْكُرُ عَنْ مَطَرٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ عُثْمَانَ، رَضِيَ اللَّهُ عَنْهُ أَشْرَفَ عَلَى أَصْحَابِهِ وَهُوَ مَحْصُورٌ فَقَالَ عَلَامَ تَقْتُلُونِي فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا يَحِلُّ دَمُ امْرِئٍ مُسْلِمٍ إِلَّا بِإِحْدَى ثَلَاثٍ رَجُلٌ زَنَى بَعْدَ إِحْصَانِهِ فَعَلَيْهِ الرَّجْمُ أَوْ قَتَلَ عَمْدًا فَعَلَيْهِ الْقَوَدُ أَوْ ارْتَدَّ بَعْدَ إِسْلَامِهِ فَعَلَيْهِ الْقَتْلُ فَوَاللَّهِ مَا زَنَيْتُ فِي جَاهِلِيَّةٍ وَلَا إِسْلَامٍ وَلَا قَتَلْتُ أَحَدًا فَأُقِيدَ نَفْسِي مِنْهُ وَلَا ارْتَدَدْتُ مُنْذُ أَسْلَمْتُ إِنِّي أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ‏.‏","english":{"narrator":"It was narrated from Nafi` from Ibn `Umar, that Uthman (رضي الله عنه) looked out at his companions when he was under siege and said:","text":"Why do you want to kill me? I heard the Messenger of Allah (ﷺ) say: `It is not permissible to shed the blood of a Muslim man except in one of three cases; a man who commits zina after being married, so he is to be stoned, or a man who killed deliberately (committed murder), so he is to be killed in retaliation, or a man who apostatised after having become Muslim, so he is to be executed.” By Allah, I never committed zina either during the Jahiliyyah or in Islam, I never killed anyone such that my life should be taken in retaliation; and I never apostatised since [became Muslim bear witness that there is no god but Allah and that Muhammad is His slave and His Messenger,"}},{"id":48,"idInBook":48,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا حَسَنُ بْنُ مُوسَى، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ لَهِيعَةَ، حَدَّثَنَا أَبُو قَبِيلٍ، قَالَ سَمِعْتُ مَالِكَ بْنَ عَبْدِ اللَّهِ الْبَرْدَادِيَّ، يُحَدِّثُ عَنْ أَبِي ذَرٍّ، أَنَّهُ جَاءَ يَسْتَأْذِنُ عَلَى عُثْمَانَ بْنِ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ فَأَذِنَ لَهُ وَبِيَدِهِ عَصَاهُ فَقَالَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ يَا كَعْبُ إِنَّ عَبْدَ الرَّحْمَنِ تُوُفِّيَ وَتَرَكَ مَالًا فَمَا تَرَى فِيهِ فَقَالَ إِنْ كَانَ يَصِلُ فِيهِ حَقَّ اللَّهِ فَلَا بَأْسَ عَلَيْهِ فَرَفَعَ أَبُو ذَرٍّ عَصَاهُ فَضَرَبَ كَعْبًا وَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَا أُحِبُّ لَوْ أَنَّ لِي هَذَا الْجَبَلَ ذَهَبًا أُنْفِقُهُ وَيُتَقَبَّلُ مِنِّي أَذَرُ خَلْفِي مِنْهُ سِتَّ أَوَاقٍ أَنْشُدُكَ اللَّهَ يَا عُثْمَانُ أَسَمِعْتَهُ ثَلَاثَ مَرَّاتٍ قَالَ نَعَمْ‏.‏","english":{"narrator":"It was narrated from Abu Dharr that he came and asked permission to enter upon `Uthman bin ‘Affan (رضي الله عنه) He gave him permission and he had a stick in his hand ‘Uthman (رضي الله عنه) said. O Ka`b, `Abdur-Rahman has died and left behind wealth. What do you think of him? He said:","text":"If he paid the dues of Allah, then that is fine. Abu Dharr raised his stick and struck Ka`b, and said: I heard the Messenger of Allah (ﷺ) say: `I would not like to have this mountain in gold and spend it (for the sake of Allah) and Allah accept it from me, and leave behind six Ooqiyyah of it.” I adjure you by Allah, O `Uthman, did you hear him? -  three times, He said: Yes."}},{"id":49,"idInBook":49,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنَا يَحْيَى بْنُ مَعِينٍ، حَدَّثَنَا هِشَامُ بْنُ يُوسُفَ، حَدَّثَنِي عَبْدُ اللَّهِ بْنُ بَحِيرٍ الْقَاصُّ، عَنْ هَانِئٍ، مَوْلَى عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ قَالَ كَانَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ إِذَا وَقَفَ عَلَى قَبْرٍ بَكَى حَتَّى يَبُلَّ لِحْيَتَهُ فَقِيلَ لَهُ تَذْكُرُ الْجَنَّةَ وَالنَّارَ فَلَا تَبْكِي وَتَبْكِي مِنْ هَذَا فَقَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْقَبْرُ أَوَّلُ مَنَازِلِ الْآخِرَةِ فَإِنْ يَنْجُ مِنْهُ فَمَا بَعْدَهُ أَيْسَرُ مِنْهُ وَإِنْ لَمْ يَنْجُ مِنْهُ فَمَا بَعْدَهُ أَشَدُّ مِنْهُ قَالَ وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاللَّهِ مَا رَأَيْتُ مَنْظَرًا قَطُّ إِلَّا وَالْقَبْرُ أَفْظَعُ مِنْهُ‏.‏","english":{"narrator":"It was narrated that Hani`, the freed slave of `Uthman, (رضي الله عنه) said:","text":"`Uthman (رضي الله عنه) used to stand by a grave and weep until his beard became wet. It was said to him: You remember Paradise and Hell and you do not weep, but you weep for this? He said: The Messenger of Allah (ﷺ) said: `The grave is the first stage of the hereafter. If one is saved from it (i.e., its torments), then what comes after it is easier than it. But if one is not saved from it {i.e. its torments), then what comes after it is worse.` And the Messenger of Allah (ﷺ)  said: By Allah, I have never seen any frightening scene but the grave is more frightening than it.`"}},{"id":50,"idInBook":50,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا زَكَرِيَّا بْنُ عَدِيٍّ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ مَرْوَانَ، وَمَا إِخَالُهُ يُتَّهَمُ عَلَيْنَا قَالَ أَصَابَ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ رُعَافٌ سَنَةَ الرُّعَافِ حَتَّى تَخَلَّفَ عَنْ الْحَجِّ وَأَوْصَى فَدَخَلَ عَلَيْهِ رَجُلٌ مِنْ قُرَيْشٍ فَقَالَ اسْتَخْلِفْ قَالَ وَقَالُوهُ قَالَ نَعَمْ قَالَ مَنْ هُوَ قَالَ فَسَكَتَ قَالَ ثُمَّ دَخَلَ عَلَيْهِ رَجُلٌ آخَرُ فَقَالَ لَهُ مِثْلَ مَا قَالَ لَهُ الْأَوَّلُ وَرَدَّ عَلَيْهِ نَحْوَ ذَلِكَ قَالَ فَقَالَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ قَالُوا الزُّبَيْرَ قَالَ نَعَمْ قَالَ أَمَا وَالَّذِي نَفْسِي بِيَدِهِ إِنْ كَانَ لَخَيْرَهُمْ مَا عَلِمْتُ وَأَحَبَّهُمْ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدَّثَنَا عَبْد اللَّهِ حَدَّثَنَاه سُوَيْدٌ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ بِإِسْنَادِهِ مِثْلَهُ‏.‏","english":{"narrator":"It was narrated from Hisham bin `Urwah from his father from Marwan, and we have no reason to suspect hirn, who said,  `Uthman (رضي الله عنه) suffered a nosebleed in the year of the nosebleed, (which was so bad that, he stayed behind from Hajj and gave his final instructions (because he thought he was going to die). A man of Quraish entered upon him and said:","text":"Appoint a successor. He said: Are they suggesting that? He said: Yes. He said: Who are they suggesting? The man kept quiet. Then another man entered upon him and said something similar to what the first man said, and he gave the same response. Then `Uthman (رضي الله عنه) said: Are they suggesting az-Zubair? He said: Yes. He said. By the One in whose hand is my soul, indeed he is the best among them as far as I know, and the most beloved of them to the Messenger of Allah (ﷺ) .\n\n‘Abdullah told us: Suwaid told us: ` Ali bin Mus-hir told us similar report, with his isnad."}},{"id":51,"idInBook":51,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا زَكَرِيَّا بْنُ أَبِي زَكَرِيَّا، حَدَّثَنَا يَحْيَى بْنُ سُلَيْمٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ أُمَيَّةَ، عَنْ مُوسَى بْنِ عِمْرَانَ بْنِ مَنَّاحٍ، قَالَ رَأَى أَبَانُ بْنُ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ جَنَازَةً فَقَامَ لَهَا وَقَالَ رَأَى عُثْمَانُ بْنُ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ جَنَازَةً فَقَامَ لَهَا ثُمَّ حَدَّثَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى جَنَازَةً فَقَامَ لَهَا‏.‏","english":{"narrator":"It was narrated that Moosa bin ‘Imran bin Mannah said:","text":"Aban bin `Uthman (رضي الله عنه) saw a funeral and stood up for it. He said: `Uthman bin `Affan (رضي الله عنه) saw a funeral and stood up for it, then he narrated that the Messenger of Allah (ﷺ)  saw a funeral and stood up for it."}},{"id":52,"idInBook":52,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا حَسَنُ بْنُ مُوسَى، حَدَّثَنَا شَيْبَانُ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ، أَنَّ عَطَاءَ بْنَ يَسَارٍ، أَخْبَرَهُ عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ، أَخْبَرَهُ أَنَّهُ، سَأَلَ عُثْمَانَ بْنَ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ قَالَ قُلْتُ أَرَأَيْتَ إِذَا جَامَعَ الرَّجُلُ امْرَأَتَهُ وَلَمْ يُمْنِ فَقَالَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ يَتَوَضَّأُ كَمَا يَتَوَضَّأُ لِلصَّلَاةِ وَيَغْسِلُ ذَكَرَهُ قَالَ وَقَالَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلْتُ عَنْ ذَلِكَ عَلِيَّ بْنَ أَبِي طَالِبٍ وَالزُّبَيْرَ وَطَلْحَةَ وَأُبَيَّ بْنَ كَعْبٍ فَأَمَرُوهُ بِذَلِكَ‏.‏","english":{"narrator":"lt was narrated from Zaid bin Khalid al-Juhani that he asked `Uthman bin `Affan (رضي الله عنه):","text":"what do you think if a man has intercourse with his wife but does not ejaculate? `Uthman (رضي الله عنه) said: Let him do wudoo’ as for prayer, and wash his private part. And `Uthman (رضي الله عنه) said: I heard it from the Messenger of Allah (ﷺ) I asked ‘Ali bin Abi Talib (رضي الله عنه), az-Zubair, Talhah and Ubayy bin Ka`b about that and they told him to do the same thing."}},{"id":53,"idInBook":53,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا حَسَنُ بْنُ مُوسَى، حَدَّثَنَا شَيْبَانُ، عَنْ يَحْيَى، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ الْحَارِثِ التَّيْمِيِّ، قَالَ أَخْبَرَنِي مُعَاذُ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ حُمْرَانَ بْنَ أَبَانَ، أَخْبَرَهُ قَالَ أَتَيْتُ عُثْمَانَ بْنَ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ وَهُوَ جَالِسٌ فِي الْمَقَاعِدِ فَتَوَضَّأَ فَأَحْسَنَ الْوُضُوءَ ثُمَّ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ فِي هَذَا الْمَجْلِسِ تَوَضَّأَ فَأَحْسَنَ الْوُضُوءَ ثُمَّ قَالَ مَنْ تَوَضَّأَ مِثْلَ وُضُوئِي هَذَا ثُمَّ أَتَى الْمَسْجِدَ فَرَكَعَ فِيهِ رَكْعَتَيْنِ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ وَقَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَا تَغْتَرُّوا‏.‏","english":{"narrator":"Mu`adh bin ‘Abdur-Rahman narrated that Humran bin Aban told him:","text":"I came to ‘Uthman bin `Affan (رضي الله عنه) when he was sitting in al-Maqa`id. He did wudoo and did it well, then he said: I saw the Messenger of Allah (ﷺ) when he was in this place; he did wudoo’ and did it well, then he said: “Whoever does wudoo’ as I have done, then goes to the mosque and prays two rakats, his previous sins will be forgiven.” And he said: The Messenger of Allah (ﷺ) said: `Do not become complacent.”"}},{"id":54,"idInBook":54,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ حَفْصٍ بْنِ عُمَرَ التَّيْمِيُّ، قَالَ سَمِعْتُ أَبِي يَقُولُ، سَمِعْتُ عَمِّي، عُبَيْدَ اللَّهِ بْنَ عُمَرَ بْنِ مُوسَى يَقُولُ كُنْتُ عِنْدَ سُلَيْمَانَ بْنِ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ فَدَخَلَ شَيْخٌ مِنْ قُرَيْشٍ فَقَالَ سُلَيْمَانُ انْظُرْ إِلَى الشَّيْخِ فَأَقْعِدْهُ مَقْعَدًا صَالِحًا فَإِنَّ لِقُرَيْشٍ حَقًّا فَقُلْتُ أَيُّهَا الْأَمِيرُ أَلَا أُحَدِّثُكَ حَدِيثًا بَلَغَنِي عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ بَلَى قَالَ قُلْتُ لَهُ بَلَغَنِي أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَهَانَ قُرَيْشًا أَهَانَهُ اللَّهُ قَالَ سُبْحَانَ اللَّهِ مَا أَحْسَنَ هَذَا مَنْ حَدَّثَكَ هَذَا قَالَ قُلْتُ حَدَّثَنِيهِ رَبِيعَةُ بْنُ أَبِي عَبْدِ الرَّحْمَنِ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ عَمْرِو بْنِ عُثْمَانَ بْنِ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ قَالَ قَالَ لِي أَبِي يَا بُنَيَّ إِنْ وَلِيتَ مِنْ أَمْرِ النَّاسِ شَيْئًا فَأَكْرِمْ قُرَيْشًا فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ أَهَانَ قُرَيْشًا أَهَانَهُ اللَّهُ‏.‏","english":{"narrator":"’Ubaidullah bin Muhammad bin Hafs bin `Umar at-Taimi said:","text":"I heard my father say: I heard my paternal uncle `Ubaidullah bin ʼUmar bin Moosa say; I was with Sulaiman bin `Ali (رضي الله عنه) and an old man of Quraish came in. Sulaiman said: Look at the old man, give him a good seat, for Quraish have a right. I said: O Ameer, shall I not tell you a hadeeth that has reached me from the Messenger of Allah (ﷺ). He said: Yes, I said to him: I have heard that the Messenger of Allah  (ﷺ) said: `Whoever humiliates Quraish. Allah will humiliate him.” He said: Subhanallah, how good this is, Who told you this? I said: Rabee`ah bin Abi ‘Abdur. Rahman told me, from Sa’eed bin al-Musayyab, from ’Amr bin `Uthman bin `Affan (رضي الله عنه) who said. My father said to me: O my son, if you are put in a position of authority over the people, then honour Quraish, for I heard the Messenger of Allah (ﷺ) say: “Whoever humiliates Quraish, Allah will humiliate him.”  ."}},{"id":55,"idInBook":55,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبَانَ الْوَرَّاقُ، حَدَّثَنَا يَعْقُوبُ، عَنْ جَعْفَرِ بْنِ أَبِي الْمُغِيرَةِ، عَنِ ابْنِ أَبْزَى، عَنْ عُثْمَانَ بْنِ عَفَّانَ، رَضِيَ اللَّهُ عَنْهُ قَالَ قَالَ لَهُ عَبْدُ اللَّهِ بْنُ الزُّبَيْرِ حِينَ حُصِرَ إِنَّ عِنْدِي نَجَائِبَ قَدْ أَعْدَدْتُهَا لَكَ فَهَلْ لَكَ أَنْ تَحَوَّلَ إِلَى مَكَّةَ فَيَأْتِيَكَ مَنْ أَرَادَ أَنْ يَأْتِيَكَ قَالَ لَا إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ يُلْحَدُ بِمَكَّةَ كَبْشٌ مِنْ قُرَيْشٍ اسْمُهُ عَبْدُ اللَّهِ عَلَيْهِ مِثْلُ نِصْفِ أَوْزَارِ النَّاسِ‏.‏","english":{"narrator":"It was narrated from `Uthman bin `Affan (رضي الله عنه). `Abdullah bin az-Zubair said to him when he was besieged:","text":"I have camels that I have prepared for you; do you want to go to Makkah, then whoever wants to see you can come and see you? He said: No, I heard the Messenger of Allah (ﷺ) say: `A ram of Quraish whose name is ‘Abdullah will seek to commit profanity and wrongdoing in Makkah; he will have half of the burden of mankind`s sins.”"}},{"id":56,"idInBook":56,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بَكْرٍ، وَمُحَمَّدُ بْنُ جَعْفَرٍ، قَالَا حَدَّثَنَا سَعِيدٌ، عَنْ مَطَرٍ، وَيَعْلَى بْنِ حَكِيمٍ، عَنْ نَافِعٍ، عَنْ نُبَيْهِ بْنِ وَهْبٍ، عَنْ أَبَانَ بْنِ عُثْمَانَ بْنِ عَفَّانَ، عَنْ عُثْمَانَ بْنِ عَفَّانَ، رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَنْكِحُ الْمُحْرِمُ وَلَا يُنْكِحُ وَلَا يَخْطُبُ‏.‏","english":{"narrator":"It was narrated from `uthman bin `Affan (رضي الله عنه]that the Messenger of Allah (ﷺ) said:","text":"`The pilgrim in ihram should not get married, arrange a marriage or propose marriage.”"}},{"id":57,"idInBook":57,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا كَهْمَسٌ، حَدَّثَنَا مُصْعَبُ بْنُ ثَابِتٍ، عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، قَالَ قَالَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ وَهُوَ يَخْطُبُ عَلَى مِنْبَرِهِ إِنِّي مُحَدِّثُكُمْ حَدِيثًا سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَكُنْ يَمْنَعُنِي أَنْ أُحَدِّثَكُمْ بِهِ إِلَّا الضِّنُّ بِكُمْ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ حَرَسُ لَيْلَةٍ فِي سَبِيلِ اللَّهِ أَفْضَلُ مِنْ أَلْفِ لَيْلَةٍ يُقَامُ لَيْلُهَا وَيُصَامُ نَهَارُهَا‏.‏","english":{"narrator":"It was narrated that `Abdullah bin az-Zubair said:","text":"`Uthman bin `Affan (رضي الله عنه) said, speaking from his minbar:  I am going to tell you a hadeeth that I heard from the Messenger of Allah (ﷺ) ; nothing kept me from telling it to you except the fact that I care for you. I heard the Messenger of Allah (ﷺ) say: “Standing guard for one night for the sake of Allah, may He be exalted, is better than a thousand nights spent in prayer and  days spent fasting.`"}},{"id":58,"idInBook":58,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ خَالِدًا، عَنْ أَبِي بِشْرٍ الْعَنْبَرِيِّ، عَنْ حُمْرَانَ بْنِ أَبَانَ، عَنْ عُثْمَانَ بْنِ عَفَّانَ، رَضِيَ اللَّهُ عَنْهُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ مَاتَ وَهُوَ يَعْلَمُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ دَخَلَ الْجَنَّةَ‏.‏","english":{"narrator":"It was narrated from `Uthman bn `Affan (رضي الله عنه) that the Prophet (ﷺ) said:","text":"“Whoever dies knowing that there is no god but Allah will enter Paradise.”"}},{"id":59,"idInBook":59,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَفَّانُ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا أَيُّوبُ بْنُ مُوسَى، حَدَّثَنِي نُبَيْهُ بْنُ وَهْبٍ، أَنَّ عُمَرَ بْنَ عُبَيْدِ اللَّهِ بْنِ مَعْمَرٍ، رَمِدَتْ عَيْنُهُ وَهُوَ مُحْرِمٌ فَأَرَادَ أَنْ يُكَحِّلَهَا فَنَهَاهُ أَبَانُ بْنُ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ وَأَمَرَهُ أَنْ يُضَمِّدَهَا بِالصَّبِرِ وَزَعَمَ أَنَّ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ حَدَّثَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ فَعَلَ ذَلِكَ‏.‏","english":{"narrator":"","text":"Nubaih bin Wahb narrated that the eye of `Umar bin Ubaidullah became inflamed when he was in ihram, and he wanted to apply kohl to it, but Aban bin `Uthman (رضي الله عنه) forbade him to do that and told him to apply aloes to it. He said that `Uthman (رضي الله عنه) narrated from the Messenger of Allah (ﷺ) that he had done that."}},{"id":60,"idInBook":60,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَفَّانُ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا أَيُّوبُ بْنُ مُوسَى، عَنْ نُبَيْهِ بْنِ وَهْبٍ، أَنَّ عُمَرَ بْنَ عُبَيْدِ اللَّهِ، أَرَادَ أَنْ يُزَوِّجَ، ابْنَهُ وَهُوَ مُحْرِمٌ فَنَهَاهُ أَبَانُ وَزَعَمَ أَنَّ عُثْمَانَ، رَضِيَ اللَّهُ عَنْهُ حَدَّثَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْمُحْرِمُ لَا يَنْكِحُ وَلَا يُنْكِحُ‏.‏","english":{"narrator":"It was narrated from Nubaih bin Wahb that `Umar bin Ubaidullah wanted to arrange a marriage for his son when he was in Ihram, but Aban forbade him to do that and said that `Uthman narrated that the Messenger of Allah (ﷺ) said:","text":"`The pilgrim in ihram should not get married, arrange a marriage or propose marrіage.”"}},{"id":61,"idInBook":61,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَفَّانُ، حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ، قَالَ سَمِعْتُ مُحَمَّدَ بْنَ عَبْدِ اللَّهِ بْنِ أَبِي يَعْقُوبَ، يُحَدِّثُ عَنْ رَبَاحٍ، قَالَ زَوَّجَنِي أَهْلِي أَمَةً لَهُمْ رُومِيَّةً وَلَدَتْ لِي غُلَامًا أَسْوَدَ فَعَلِقَهَا عَبْدٌ رُومِيٌّ يُقَالُ لَهُ يُوحَنَّسُ فَجَعَلَ يُرَاطِنُهَا بِالرُّومِيَّةِ فَحَمَلَتْ وَقَدْ كَانَتْ وَلَدَتْ لِي غُلَامًا أَسْوَدَ مِثْلِي فَجَاءَتْ بِغُلَامٍ وَكَأَنَّهُ وَزَغَةٌ مِنْ الْوَزَغَاتِ فَقُلْتُ لَهَا مَا هَذَا فَقَالَتْ هُوَ مِنْ يُوحَنَّسَ فَسَأَلْتُ يُوحَنَّسَ فَاعْتَرَفَ فَأَتَيْتُ عُثْمَانَ بْنَ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ فَذَكَرْتُ ذَلِكَ لَهُ فَأَرْسَلَ إِلَيْهِمَا فَسَأَلَهُمَا ثُمَّ قَالَ سَأَقْضِي بَيْنَكُمَا بِقَضَاءِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْوَلَدُ لِلْفِرَاشِ وَلِلْعَاهِرِ الْحَجَرُ فَأَلْحَقَهُ بِي قَالَ فَجَلَدَهُمَا فَوَلَدَتْ لِي بَعْدُ غُلَامًا أَسْوَدَ‏.‏","english":{"narrator":"It was narrated that Rabah said:","text":"My masters married me to a Roman slave girl of theirs and she bore me a black boy. Then she fell in love with a Roman slave whose name was Yuhannas, and he spoke to her in their language. Then she got pregnant. She had borne me a child who was black like me, then she gave birth to a boy who looked like a lizard (i.e., was very fair). I said to her: What is this? She said: He is the child of Yuhannas. I asked Yuhannas and he admitted it, I went to ‘Uthman bin ‘Affan (رضي الله عنه) and told him about that. He sent for them and asked them, then he said: I will pass judgement between you according to the judgement of the Messenger of Allah (ﷺ); the child is to be attributed to the (husband of the) woman, and the fornicator gets nothing. He attributed the child to me and flogged them both. then later on she gave birth to a black chıld"}},{"id":62,"idInBook":62,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَفَّانُ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ أَبِي أُمَامَةَ بْنِ سَهْلٍ، قَالَ كُنْتُ مَعَ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ فِي الدَّارِ وَهُوَ مَحْصُورٌ قَالَ وَكُنَّا نَدْخُلُ مَدْخَلًا إِذَا دَخَلْنَاهُ سَمِعْنَا كَلَامَ مَنْ عَلَى الْبَلَاطِ قَالَ فَدَخَلَ عُثْمَانُ يَوْمًا لِحَاجَةٍ فَخَرَجَ إِلَيْنَا مُنْتَقِعًا لَوْنُهُ فَقَالَ إِنَّهُمْ لَيَتَوَعَّدُونِي بِالْقَتْلِ آنِفًا قَالَ قُلْنَا يَكْفِيكَهُمُ اللَّهُ يَا أَمِيرَ الْمُؤْمِنِينَ قَالَ فَقَالَ وَبِمَ يَقْتُلُونِي فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّهُ لَا يَحِلُّ دَمُ امْرِئٍ مُسْلِمٍ إِلَّا فِي إِحْدَى ثَلَاثٍ رَجُلٌ كَفَرَ بَعْدَ إِسْلَامِهِ أَوْ زَنَى بَعْدَ إِحْصَانِهِ أَوْ قَتَلَ نَفْسًا بِغَيْرِ نَفْسٍ فَوَاللَّهِ مَا زَنَيْتُ فِي جَاهِلِيَّةٍ وَلَا إِسْلَامٍ وَلَا تَمَنَّيْتُ بَدَلًا بِدِينِي مُذْ هَدَانِي اللَّهُ عَزَّ وَجَلَّ وَلَا قَتَلْتُ نَفْسًا فَبِمَ يَقْتُلُونِي‏.‏","english":{"narrator":"It was narrated that Abu Umamah bin Sahl said:","text":"I was with ‘Uthman (رضي الله عنه) in the house when he was under siege. We would go into an entryway where, when we entered it, we could hear what the people were saying in al-Balat. `Uthman (رضي الله عنه) entered it one day for some reason, then he came out with his face flushed and said: They were threatening to kill me just now. We said: Allah will suffice you against them, O Ameer al-Mu`mineen. He said: Why would they kill me? I heard the Messenger of Allah (ﷺ) say: “It is not permissible to shed the blood of a Muslim man except in one of three cases; a man who disbelieved after having become Muslim, or a man who committed zina after being married, or a man who killed a person not in retaliation of murder But by Allah, I never committed zina either during the Jahiliyyah or in Islam... I never wanted to change my religion since Allah, may He be glorified and exalted guided me, and I never killed anyone So why do they want to kill me?"}},{"id":63,"idInBook":63,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا إِسْحَاقُ بْنُ عِيسَى، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي الزِّنَادِ، ح وَسُرَيْجٌ وَحُسَيْنٌ قَالَا حَدَّثَنَا ابْنُ أَبِي الزِّنَادِ، عَنْ أَبِيهِ، عَنْ عَامِرِ بْنِ سَعْدٍ، قَالَ حُسَيْنُ ابْنُ أَبِي وَقَّاصٍ قَالَ سَمِعْتُ عُثْمَانَ بْنَ عَفَّانَ، رَضِيَ اللَّهُ عَنْهُ يَقُولُ مَا يَمْنَعُنِي أَنْ أُحَدِّثَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ لَا أَكُونَ أَوْعَى أَصْحَابِهِ عَنْهُ وَلَكِنِّي أَشْهَدُ لَسَمِعْتُهُ يَقُولُ مَنْ قَالَ عَلَيَّ مَا لَمْ أَقُلْ فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنْ النَّارِ وَقَالَ حُسَيْنٌ أَوْعَى صَحَابَتِهِ عَنْهُ‏.‏","english":{"narrator":"It was narrated that ‘Amir bin Sa`d said:","text":"Husain bin Abi Waqqas said: l heard `Uthman bin `Affan (رضي الله عنه) say: What prevented me from narrating from the Messenger of Allah (ﷺ)  was not the fact that was not the most knowledgeable of his Companions about what he said, but I bear witness that I heard him say: “Whoever says something about me that I did not say, let him take his place in Hell.” And he said: Husain was the most aware of his companions of what he said."}},{"id":64,"idInBook":64,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا هَاشِمٌ، حَدَّثَنَا لَيْثٌ، حَدَّثَنِي زُهْرَةُ بْنُ مَعْبَدٍ الْقُرَشِيُّ، عَنْ أَبِي صَالِحٍ، مَوْلَى عُثْمَانَ بْنِ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ قَالَ سَمِعْتُ عُثْمَانَ، رَضِيَ اللَّهُ عَنْهُ يَقُولُ عَلَى الْمِنْبَرِ أَيُّهَا النَّاسُ إِنِّي كَتَمْتُكُمْ حَدِيثًا سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَرَاهِيَةَ تَفَرُّقِكُمْ عَنِّي ثُمَّ بَدَا لِي أَنْ أُحَدِّثَكُمُوهُ لِيَخْتَارَ امْرُؤٌ لِنَفْسِهِ مَا بَدَا لَهُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ رِبَاطُ يَوْمٍ فِي سَبِيلِ اللَّهِ تَعَالَى خَيْرٌ مِنْ أَلْفِ يَوْمٍ فِيمَا سِوَاهُ مِنْ الْمَنَازِلِ‏.‏","english":{"narrator":"It was narrated that Abu Salih, the freed slave of ‘Uthman bin `Affan {رضي الله عنه) said:","text":"I heard `Uthman (رضي الله عنه) say on the minbar:  O people, I concealed from you a hadeeth that I heard from the Messenger of Allah (ﷺ) for fear that you would scatter away from me, then I thought that I should tell it to you, and let each one choose for himself what he thinks is best. I heard the Messenger of Allah (ﷺ) say: `Guarding the border for one day for the sake of Allah is better than a thousand other days doing other deeds.`"}},{"id":65,"idInBook":65,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا هَاشِمٌ، حَدَّثَنَا أَبُو جَعْفَرٍ الرَّازِيُّ، عَنْ عَبْدِ الْعَزِيزِ بْنِ عُمَرَ، رَضِيَ اللَّهُ عَنْهُ عَنْ صَالِحِ بْنِ كَيْسَانَ، عَنْ رَجُلٍ، عَنْ عُثْمَانَ بْنِ عَفَّانَ، رَضِيَ اللَّهُ عَنْهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْ مُسْلِمٍ يَخْرُجُ مِنْ بَيْتِهِ يُرِيدُ سَفَرًا أَوْ غَيْرَهُ فَقَالَ حِينَ يَخْرُجُ بِسْمِ اللَّهِ آمَنْتُ بِاللَّهِ اعْتَصَمْتُ بِاللَّهِ تَوَكَّلْتُ عَلَى اللَّهِ لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ إِلَّا رُزِقَ خَيْرَ ذَلِكَ الْمَخْرَجِ وَصُرِفَ عَنْهُ شَرُّ ذَلِكَ الْمَخْرَجِ‏.‏","english":{"narrator":"It was narrated that `Uthman bin `Affan (رضي الله عنه) said:","text":"The Messenger of Allah (ﷺ)  said: `There is no Muslim who leaves his house, intending to travel or otherwise, and says when leaving: `In the Name of Allah, I believe in Allah, I seek the protection of Allah, I put my trust in Allah, there is no strength and no power except with Allah, but he will be granted the goodness of that going out, and the evil of that going out will be diverted from him.”"}},{"id":66,"idInBook":66,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنِ الْحَجَّاجِ، عَنْ عَطَاءٍ، عَنْ عُثْمَانَ، رَضِيَ اللَّهُ عَنْهُ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَوَضَّأَ فَغَسَلَ وَجْهَهُ ثَلَاثًا وَيَدَيْهِ ثَلَاثًا وَمَسَحَ بِرَأْسِهِ وَغَسَلَ رِجْلَيْهِ غَسْلًا‏.‏","english":{"narrator":"It was narrated that `Uthman (رضي الله عنه) said:","text":"I saw the Messenger of Allah (ﷺ) as doing wudoo’. He washed his face three times and his hands three times, and he wiped his head and washed his feet."}},{"id":67,"idInBook":67,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا هَاشِمٌ، حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي أَبُو صَخْرَةَ، جَامِعُ بْنُ شَدَّادٍ قَالَ سَمِعْتُ حُمْرَانَ بْنَ أَبَانَ، يُحَدِّثُ أَبَا بُرْدَةَ فِي مَسْجِدِ الْبَصْرَةِ وَأَنَا قَائِمٌ، مَعَهُ أَنَّهُ سَمِعَ عُثْمَانَ بْنَ عَفَّانَ، رَضِيَ اللَّهُ عَنْهُ يُحَدِّثُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ مَنْ أَتَمَّ الْوُضُوءَ كَمَا أَمَرَهُ اللَّهُ عَزَّ وَجَلَّ فَالصَّلَوَاتُ الْخَمْسُ كَفَّارَةٌ لِمَا بَيْنَهُنَّ‏.‏","english":{"narrator":"Abu Sakhrah Jami’ bin Shaddad told me that he said:","text":"I heard Humran bin Aban tell Abu Burdah in the mosque of Basrah, when I was standing next to him, that he heard `Uthman bin `Affan (رضي الله عنه) narrating from the Prophet (ﷺ)  that he said: `Whoever does wudoo’ properly as enjoined by Allah, may He be glorified and exalted, the five prayers will be an expiation for whatever comes in between them.`"}},{"id":68,"idInBook":68,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا سُرَيْجٌ، حَدَّثَنَا ابْنُ أَبِي الزِّنَادِ، عَنْ أَبِيهِ، عَنْ أَبَانَ بْنِ عُثْمَانَ، قَالَ سَمِعْتُ عُثْمَانَ بْنَ عَفَّانَ، رَضِيَ اللَّهُ عَنْهُ وَهُوَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ قَالَ فِي أَوَّلِ يَوْمِهِ أَوْ فِي أَوَّلِ لَيْلَتِهِ بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ ثَلَاثَ مَرَّاتٍ لَمْ يَضُرَّهُ شَيْءٌ فِي ذَلِكَ الْيَوْمِ أَوْ فِي تِلْكَ اللَّيْلَةِ‏.‏","english":{"narrator":"It was narrated that Aban bin `Uthman said:","text":"I heard `Uthman bin `Affan (رضي الله عنه) say: The Messenger of Allah (ﷺ)  said: `Whoever says at the beginning of the day or the beginning of the night, ‘In the Name of Allah with Whose name nothing on earth or in heaven can cause harm, and he is the All-Hearing. All-Knowing.` three times, nothing will harm him during that day or that night.”"}},{"id":69,"idInBook":69,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَفَّانُ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، أَنْبَأَنَا أَبُو سِنَانٍ، عَنْ يَزِيدَ بْنِ مَوْهَبٍ، أَنَّ عُثْمَانَ، رَضِيَ اللَّهُ عَنْهُ قَالَ لِابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُ اقْضِ بَيْنَ النَّاسِ فَقَالَ لَا أَقْضِي بَيْنَ اثْنَيْنِ وَلَا أَؤُمُّ رَجُلَيْنِ أَمَا سَمِعْتَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ عَاذَ بِاللَّهِ فَقَدْ عَاذَ بِمَعَاذٍ قَالَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ بَلَى قَالَ فَإِنِّي أَعُوذُ بِاللَّهِ أَنْ تَسْتَعْمِلَنِي فَأَعْفَاهُ وَقَالَ لَا تُخْبِرْ بِهَذَا أَحَدًا‏.‏","english":{"narrator":"It was narrated from Yazeed bin Mawhab that `Uthman (رضي الله عنه) said to Ibn `Umar (رضي الله عنه). Judge between the people. He said:","text":"I will not judge between two people or lead two men in prayer. Did you not hear the Prophet (ﷺ) say, `Whoever seeks refuge with Allah has indeed sought refuge with a powerful one`?`Uthman (رضي الله عنه) said. Yes I did. He said: then I seek refuge with Allah lest you appoint me to some post. So Uthman (رضي الله عنه) let him off and said: Do not tell anyone else about this."}},{"id":70,"idInBook":70,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَفَّانُ، حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، عَنْ عُثْمَانَ بْنِ حَكِيمٍ، حَدَّثَنَا مُحَمَّدُ بْنُ الْمُنْكَدِرِ، عَنْ حُمْرَانَ، عَنْ عُثْمَانَ بْنِ عَفَّانَ، رَضِيَ اللَّهُ عَنْهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ تَوَضَّأَ فَأَحْسَنَ الْوُضُوءَ خَرَجَتْ خَطَايَاهُ مِنْ جَسَدِهِ حَتَّى تَخْرُجَ مِنْ تَحْتِ أَظْفَارِهِ‏.‏","english":{"narrator":"It was narrated that `Uthman bin `Affan said:","text":"The Messenger of Allah (ﷺ) said: “Whoever does wudoo` and does wudoo’ well, his sins come out of his body, even from beneath his nails.”"}},{"id":71,"idInBook":71,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنَاه سُوَيْدُ بْنُ سَعِيدٍ، سَنَةَ سِتٍّ وَعِشْرِينَ حَدَّثَنَا رِشْدِينُ بْنُ سَعْدٍ، عَنْ زُهْرَةَ بْنِ مَعْبَدٍ، عَنْ أَبِي صَالِحٍ، مَوْلَى عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ أَنَّ عُثْمَانَ قَالَ أَيُّهَا النَّاسُ هَجِّرُوا فَإِنِّي مُهَجِّرٌ فَهَجَّرَ النَّاسُ ثُمَّ قَالَ أَيُّهَا النَّاسُ إِنِّي مُحَدِّثُكُمْ بِحَدِيثٍ مَا تَكَلَّمْتُ بِهِ مُنْذُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى يَوْمِي هَذَا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ رِبَاطَ يَوْمٍ فِي سَبِيلِ اللَّهِ أَفْضَلُ مِنْ أَلْفِ يَوْمٍ مِمَّا سِوَاهُ فَلْيُرَابِطْ امْرُؤٌ حَيْثُ شَاءَ هَلْ بَلَّغْتُكُمْ قَالُوا نَعَمْ قَالَ اللَّهُمَّ اشْهَدْ‏.‏","english":{"narrator":"It was narrated from Abu Salih, the freed slave of `Uthman (رضي الله عنه), that `Uthman (رضي الله عنه.) said:","text":"O people, move on in the middle of the day, for I am moving on in the middle of the day. So the people moved on in the middle of the day. Then he said: O people, I shall tell you a hadith of which I have not spoken since I heard it from the Messenger of Allah (ﷺ) until this day. The Messenger of Allah (ﷺ), said: `Guarding the border for one day for the sake of Allah is better than a thousand other days, so let a man guard the border as much as he wants.` Have I conveyed the message to you? They said: Yes. He said. O Allah, bear witness."}},{"id":72,"idInBook":72,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا أَبُو الْمُغِيرَةِ، حَدَّثَنَا الْأَوْزَاعِيُّ، حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ التَّيْمِيِّ، حَدَّثَنِي شَقِيقُ بْنُ سَلَمَةَ، عَنْ حُمْرَانَ، قَالَ كَانَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ قَاعِدًا فِي الْمَقَاعِدِ فَدَعَا بِوَضُوءٍ فَتَوَضَّأَ ثُمَّ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَوَضَّأَ فِي مَقْعَدِي هَذَا ثُمَّ قَالَ مَنْ تَوَضَّأَ مِثْلَ وُضُوئِي هَذَا ثُمَّ قَامَ فَرَكَعَ رَكْعَتَيْنِ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَغْتَرُّوا‏.‏","english":{"narrator":"It was narrated that Humran said:","text":"Uthman was sitting in alMaqa`id. He called for water and did wudoo’, then he said: I saw the Messenger of Allah (ﷺ) doing wudoo` in this place where I am sitting then he said: “whoever does wudoo’ as I have done, then gets up and prays two rak`ahs, his previous sins will be forgiven.” And the Messenger of Allah (ﷺ) said: `Do not become complacent.`"}},{"id":73,"idInBook":73,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا أَبُو الْمُغِيرَةِ، حَدَّثَنَا أَرْطَاةُ يَعْنِي ابْنَ الْمُنْذِرِ، أَخْبَرَنِي أَبُو عَوْنٍ الْأَنْصَارِيُّ، أَنَّ عُثْمَانَ بْنَ عَفَّانَ، رَضِيَ اللَّهُ عَنْهُ قَالَ لِابْنِ مَسْعُودٍ هَلْ أَنْتَ مُنْتَهٍ عَمَّا بَلَغَنِي عَنْكَ فَاعْتَذَرَ بَعْضَ الْعُذْرِ فَقَالَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ وَيْحَكَ إِنِّي قَدْ سَمِعْتُ وَحَفِظْتُ وَلَيْسَ كَمَا سَمِعْتَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ سَيُقْتَلُ أَمِيرٌ وَيَنْتَزِي مُنْتَزٍ وَإِنِّي أَنَا الْمَقْتُولُ وَلَيْسَ عُمَرَ رَضِيَ اللَّهُ عَنْهُ إِنَّمَا قَتَلَ عُمَرَ وَاحِدٌ وَإِنَّهُ يُجْتَمَعُ عَلَيَّ‏.‏","english":{"narrator":"Abu ‘Awn al-Ansari narrated that `Uthman bin `Affan (رضي الله عنه) said to Ibn Mas`ood:","text":"Are you going to give up what I heard about you? He was apologetic, then `Uthman (رضي الله عنه) said: Woe to you! I heard and remembered and it is not as you heard; the Messenger of Allah (ﷺ) said: `A leader will be killed and a criminal will commit a crime.` I am the one who will be killed, not ‘Umar رضي الله عنه); rather ‘Umar (رضي الله عنه) was killed by one man, but a group of people will kill me"}},{"id":74,"idInBook":74,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا بِشْرُ بْنُ شُعَيْبٍ، حَدَّثَنِي أَبِي، عَنِ الزُّهْرِيِّ، حَدَّثَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عُبَيْدَ اللَّهِ بْنَ عَدِيِّ بْنِ الْخِيَارِ، أَخْبَرَهُ أَنَّ عُثْمَانَ بْنَ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ قَالَ لَهُ ابْنَ أَخِي أَدْرَكْتَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَقُلْتُ لَهُ لَا وَلَكِنْ خَلَصَ إِلَيَّ مِنْ عِلْمِهِ وَالْيَقِينِ مَا يَخْلُصُ إِلَى الْعَذْرَاءِ فِي سِتْرِهَا قَالَ فَتَشَهَّدَ ثُمَّ قَالَ أَمَّا بَعْدُ فَإِنَّ اللَّهَ عَزَّ وَجَلَّ بَعَثَ مُحَمَّدًا صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْحَقِّ فَكُنْتُ مِمَّنْ اسْتَجَابَ لِلَّهِ وَلِرَسُولِهِ وَآمَنَ بِمَا بُعِثَ بِهِ مُحَمَّدٌ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ هَاجَرْتُ الْهِجْرَتَيْنِ كَمَا قُلْتُ وَنِلْتُ صِهْرَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَبَايَعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَوَاللَّهِ مَا عَصَيْتُهُ وَلَا غَشَشْتُهُ حَتَّى تَوَفَّاهُ اللَّهُ عَزَّ وَجَلَّ‏.‏","english":{"narrator":"`Uthman bin `Affan (رضي الله عنه) said to his nephew:","text":"Did you meet the Messenger of Allah (ﷺ)? He said: No, but there reached me of his knowledge and certainty of faith that which would reach a virgin in her seclusion .He  recited the tashahhud then he said: Verily Allah, may He be glorified and exalted, sent Muhammad  with the truth and I was one of those who responded to (the call of) Allah and His Messenger, and I believed in that with which Muhammad (ﷺ) was sent. Then I migrated twice, and I also attained the honour of becoming the son-in law of the Messenger of Allah (ﷺ), I swore allegiance to the Messenger of Allah (ﷺ), and by Allah, I never disobeyed him or betrayed him until Allah, may He be glorified and exalted, took his soul in death."}},{"id":75,"idInBook":75,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ عَيَّاشٍ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، قَالَ وَأَخْبَرَنِي الْأَوْزَاعِيُّ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الْمَلِكِ بْنِ مَرْوَانَ، أَنَّهُ حَدَّثَهُ عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، أَنَّهُ دَخَلَ عَلَى عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ وَهُوَ مَحْصُورٌ فَقَالَ إِنَّكَ إِمَامُ الْعَامَّةِ وَقَدْ نَزَلَ بِكَ مَا تَرَى وَإِنِّي أَعْرِضُ عَلَيْكَ خِصَالًا ثَلَاثًا اخْتَرْ إِحْدَاهُنَّ إِمَّا أَنْ تَخْرُجَ فَتُقَاتِلَهُمْ فَإِنَّ مَعَكَ عَدَدًا وَقُوَّةً وَأَنْتَ عَلَى الْحَقِّ وَهُمْ عَلَى الْبَاطِلِ وَإِمَّا أَنْ نَخْرِقَ لَكَ بَابًا سِوَى الْبَابِ الَّذِي هُمْ عَلَيْهِ فَتَقْعُدَ عَلَى رَوَاحِلِكَ فَتَلْحَقَ بِمَكَّةَ فَإِنَّهُمْ لَنْ يَسْتَحِلُّوكَ وَأَنْتَ بِهَا وَإِمَّا أَنْ تَلْحَقَ بِالشَّامِ فَإِنَّهُمْ أَهْلُ الشَّامِ وَفِيهِمْ مُعَاوِيَةُ فَقَالَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ أَمَّا أَنْ أَخْرُجَ فَأُقَاتِلَ فَلَنْ أَكُونَ أَوَّلَ مَنْ خَلَفَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي أُمَّتِهِ بِسَفْكِ الدِّمَاءِ وَأَمَّا أَنْ أَخْرُجَ إِلَى مَكَّةَ فَإِنَّهُمْ لَنْ يَسْتَحِلُّونِي بِهَا فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ يُلْحِدُ رَجُلٌ مِنْ قُرَيْشٍ بِمَكَّةَ يَكُونُ عَلَيْهِ نِصْفُ عَذَابِ الْعَالَمِ فَلَنْ أَكُونَ أَنَا إِيَّاهُ وَأَمَّا أَنْ أَلْحَقَ بِالشَّامِ فَإِنَّهُمْ أَهْلُ الشَّامِ وَفِيهِمْ مُعَاوِيَةُ فَلَنْ أُفَارِقَ دَارَ هِجْرَتِي وَمُجَاوَرَةَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدَّثَنَاه عَلِيُّ بْنُ إِسْحَاقَ عَنِ ابْنِ الْمُبَارَكِ فَذَكَرَ الْحَدِيثَ وَقَالَ يُلْحِدُ‏.‏","english":{"narrator":"lt was narrated from al-Mugheerah bin Shu`bah that he entered upon `Uthman (رضي الله عنه) when he was under siege and said:","text":"You are the leader of the people and there has befallen you what you see, I am going to suggest to you three options, choose one of them. Either go out and fight them, because you have numbers and strength, and you are in the right and they are in the wrong; or we will make another door for you other than the door where they are, then you can mount your animal and go to Makkah, for they will not try to kill you there; or go to Syria, for the people of Syria are good people and among them is Mu`awiyah. `Uthman (رضي الله عنه) said: As for going out and fighting. I will never be the first successor of the Messenger of Allah (ﷺ)  to shed blood among his ummah; as for going out to Makkah because they will never try to kill me there, I heard the Messenger of Allah (ﷺ) say, “A man of Quraish will commit profanity in Makkah and half the punishment of the world will be upon him`, and I will never be that one; as for going to Syria, because they are the people of Syria and Mu`awiyah is among them, I shall never leave the land to which I migrated, where I am close to the Messenger of Allah (ﷺ) \n\nIt was narrated from Ibn al-Mubarak... and he mentioned the same hadeeth, and said `will commit profanity.”"}},{"id":76,"idInBook":76,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا حَجَّاجٌ، وَيُونُسُ، قَالَا حَدَّثَنَا لَيْثٌ، قَالَ حَجَّاجٌ حَدَّثَنِي يَزِيدُ بْنُ أَبِي حَبِيبٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي سَلَمَةَ، وَنَافِعِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ، عَنْ مُعَاذِ بْنِ عَبْدِ الرَّحْمَنِ التَّيْمِيِّ، عَنْ حُمْرَانَ، مَوْلَى عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ عَنْ عُثْمَانَ، أَنَّهُ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ تَوَضَّأَ فَأَسْبَغَ الْوُضُوءَ ثُمَّ مَشَى إِلَى صَلَاةٍ مَكْتُوبَةٍ فَصَلَّاهَا غُفِرَ لَهُ ذَنْبُهُ‏.‏","english":{"narrator":"It was narrated from Mu`adh bin ‘Abdur-Rahman at Taimi, from Humran the freed slave of `Uthman (رضي الله عنه), from `Uthman (رضي الله عنه), that he said:","text":"I heard the Messenger of Allah (ﷺ) say: “Whoever does wudoo` and does it properly, then goes and offers an obligatory prayer, his sins will be forgiven.`"}},{"id":77,"idInBook":77,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَفَّانُ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عَاصِمٍ، عَنِ الْمُسَيَّبِ، عَنْ مُوسَى بْنِ طَلْحَةَ، عَنْ حُمْرَانَ، قَالَ كَانَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ يَغْتَسِلُ كُلَّ يَوْمٍ مَرَّةً مِنْ مُنْذُ أَسْلَمَ فَوَضَعْتُ وَضُوءًا لَهُ ذَاتَ يَوْمٍ لِلصَّلَاةِ فَلَمَّا تَوَضَّأَ قَالَ إِنِّي أَرَدْتُ أَنْ أُحَدِّثَكُمْ بِحَدِيثٍ سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ قَالَ بَدَا لِي أَنْ لَا أُحَدِّثَكُمُوهُ فَقَالَ الْحَكَمُ بْنُ أَبِي الْعَاصِ يَا أَمِيرَ الْمُؤْمِنِينَ إِنْ كَانَ خَيْرًا فَنَأْخُذُ بِهِ أَوْ شَرًّا فَنَتَّقِيهِ قَالَ فَقَالَ فَإِنِّي مُحَدِّثُكُمْ بِهِ تَوَضَّأَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَذَا الْوُضُوءَ ثُمَّ قَالَ مَنْ تَوَضَّأَ هَذَا الْوُضُوءَ فَأَحْسَنَ الْوُضُوءَ ثُمَّ قَامَ إِلَى الصَّلَاةِ فَأَتَمَّ رُكُوعَهَا وَسُجُودَهَا كَفَّرَتْ عَنْهُ مَا بَيْنَهَا وَبَيْنَ الصَّلَاةِ الْأُخْرَى مَا لَمْ يُصِبْ مَقْتَلَةً يَعْنِي كَبِيرَةً‏.‏","english":{"narrator":"It was narrated that Humran said. `Uthman (رضي الله عنه) did ghusl every day since he became Muslim. I  brought water for him one day to do wudoo’ for prayer. After he did wudoo’, he said:","text":"I wanted to tell you a hadeeth that I heard from the  Messenger of Allah (ﷺ). Then I  decided not to tell it to you, al-Hakam bin al-`As said: O Ameer  al-Mu`mineen, if it is enjoining us  to do good we will do it and if it is warning us of a bad thing we will avoid it. He said: I will tell it to you  the Messenger of Allah (ﷺ)  did  wudoo in this manner, then he said: `Whoever does wudoo’ in this manner and does it well, then goes and prays, bowing and prostrating properly, it (the prayer) will  expiate his sins between that - prayer and the next, unless he does  or something serious` i.e., major sin."}},{"id":78,"idInBook":78,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَفَّانُ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ يُونُسَ، عَنْ عَطَاءِ بْنِ فَرُّوخَ، عَنْ عُثْمَانَ بْنِ عَفَّانَ، رَضِيَ اللَّهُ عَنْهُ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ أَدْخَلَ اللَّهُ الْجَنَّةَ رَجُلًا كَانَ سَهْلًا قَاضِيًا وَمُقْتَضِيًا وَبَائِعًا وَمُشْتَرِيًا‏.‏","english":{"narrator":"It was narrated that `Uthman bin `Affan (رضي الله عنه) said:","text":"I heard the Messenger of Allah (ﷺ) say:  “Allah admitted to Paradise a man who was easy-going in buying and selling, when paying off debt and when asking for a debt that was owed to him.”"}},{"id":79,"idInBook":79,"chapterId":4,"bookId":8,"arabic":"قَالَ حَدَّثَنَا عَفَّانُ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ إِبْرَاهِيمَ بْنِ الْمُهَاجِرِ، عَنْ عِكْرِمَةَ بْنِ خَالِدٍ، حَدَّثَنِي رَجُلٌ، مِنْ أَهْلِ الْمَدِينَةِ أَنَّ الْمُؤَذِّنَ، أَذَّنَ لِصَلَاةِ الْعَصْرِ قَالَ فَدَعَا عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ بِطَهُورٍ فَتَطَهَّرَ قَالَ ثُمَّ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ تَطَهَّرَ كَمَا أُمِرَ وَصَلَّى كَمَا أُمِرَ كُفِّرَتْ عَنْهُ ذُنُوبُهُ فَاسْتَشْهَدَ عَلَى ذَلِكَ أَرْبَعَةً مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَشَهِدُوا لَهُ بِذَلِكَ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ‏.‏","english":{"narrator":"It was narrated from ‘lkrimah bin Khalid:","text":"a man from Madinah told me that the mu`adhdhin gave the call to `Asr prayer and ‘Uthman (رضي الله عنه) called for water and purified himself, then he said: I heard the Messenger of Allah (ﷺ) say: \n`Whoever purifies himself as he has been enjoined and prays as he has been enjoined, his sins will be expiated.” Then he called four of the Companions of the Messenger of Allah (ﷺ)  to testify to that, and they testified that the Prophet (ﷺ)  had said that."}},{"id":80,"idInBook":80,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا ابْنُ الْأَشْجَعِيِّ، حَدَّثَنَا أَبِي، عَنْ سُفْيَانَ، عَنْ سَالِمٍ أَبِي النَّضْرِ، عَنْ بُسْرِ بْنِ سَعِيدٍ، قَالَ أَتَى عُثْمَانُ الْمَقَاعِدَ فَدَعَا بِوَضُوءٍ فَتَمَضْمَضَ وَاسْتَنْشَقَ ثُمَّ غَسَلَ وَجْهَهُ ثَلَاثًا وَيَدَيْهِ ثَلَاثًا ثَلَاثًا ثُمَّ مَسَحَ بِرَأْسِهِ وَرِجْلَيْهِ ثَلَاثًا ثَلَاثًا ثُمَّ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَكَذَا يَتَوَضَّأُ يَا هَؤُلَاءِ أَكَذَاكَ قَالُوا نَعَمْ لِنَفَرٍ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عِنْدَهُ‏.‏","english":{"narrator":"It was narrated that Busr bin Sa`eed said:","text":"`Uthman (رضي الله عنه) came to al-Maqa`id and called for water for wudoo`. He rinsed his mouth and nose, then he washed his face three times, then he washed his hands three times each, then he wiped his head and (washed) his feet three times each. Then he said: I saw the Messenger of Allah (ﷺ) doing wudoo` like this, O people, isn`t that true? They said: Yes - i.e., a group of the Companions of the Messenger of Allah (ﷺ)  who were with him."}},{"id":81,"idInBook":81,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْوَلِيدِ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنِي سَالِمٌ أَبُو النَّضْرِ، عَنْ بُسْرِ بْنِ سَعِيدٍ، عَنْ عُثْمَانَ بْنِ عَفَّانَ، رَضِيَ اللَّهُ عَنْهُ أَنَّهُ دَعَا بِمَاءٍ فَتَوَضَّأَ عِنْدَ الْمَقَاعِدِ فَتَوَضَّأَ ثَلَاثًا ثَلَاثًا ثُمَّ قَالَ لِأَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَلْ رَأَيْتُمْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَعَلَ هَذَا قَالُوا نَعَمْ قَالَ أَبِي هَذَا الْعَدَنِيُّ كَانَ بِمَكَّةَ مُسْتَمْلِيَ ابْنِ عُيَيْنَةَ ‏.‏","english":{"narrator":"It was narrated from `Uthman bin `Affan (رضي الله عنه )  that he called for water and did wudoo` in al-Maqa`id. He did wudoo’, washing each part three times, then he said to the Companions of the Messenger of Allah (ﷺ). Did you see the Messenger of Allah (ﷺ) doing {wudoo`) like this? They said:","text":"Yes."}},{"id":82,"idInBook":82,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا يَعْقُوبُ، حَدَّثَنَا أَبِي، عَنِ ابْنِ إِسْحَاقَ، حَدَّثَنِي مُحَمَّدُ بْنُ إِبْرَاهِيمَ بْنِ الْحَارِثِ التَّيْمِيُّ، عَنْ مُعَاذِ بْنِ عَبْدِ الرَّحْمَنِ التَّيْمِيِّ، عَنْ حُمْرَانَ بْنِ أَبَانَ، مَوْلَى عُثْمَانَ بْنِ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ قَالَ رَأَيْتُ عُثْمَانَ بْنَ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ دَعَا بِوَضُوءٍ وَهُوَ عَلَى بَابِ الْمَسْجِدِ فَغَسَلَ يَدَيْهِ ثُمَّ مَضْمَضَ وَاسْتَنْشَقَ وَاسْتَنْثَرَ ثُمَّ غَسَلَ وَجْهَهُ ثَلَاثَ مَرَّاتٍ ثُمَّ غَسَلَ يَدَيْهِ إِلَى الْمِرْفَقَيْنِ ثَلَاثَ مَرَّاتٍ ثُمَّ مَسَحَ بِرَأْسِهِ وَأَمَرَّ بِيَدَيْهِ عَلَى ظَاهِرِ أُذُنَيْهِ ثُمَّ مَرَّ بِهِمَا عَلَى لِحْيَتِهِ ثُمَّ غَسَلَ رِجْلَيْهِ إِلَى الْكَعْبَيْنِ ثَلَاثَ مَرَّاتٍ ثُمَّ قَامَ فَرَكَعَ رَكْعَتَيْنِ ثُمَّ قَالَ تَوَضَّأْتُ لَكُمْ كَمَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَوَضَّأَ ثُمَّ رَكَعْتُ رَكْعَتَيْنِ كَمَا رَأَيْتُهُ رَكَعَ قَالَ ثُمَّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ فَرَغَ مِنْ رَكْعَتَيْهِ مَنْ تَوَضَّأَ كَمَا تَوَضَّأْتُ ثُمَّ رَكَعَ رَكْعَتَيْنِ لَا يُحَدِّثُ فِيهِمَا نَفْسَهُ غُفِرَ لَهُ مَا كَانَ بَيْنَهُمَا وَبَيْنَ صَلَاتِهِ بِالْأَمْسِ‏.‏","english":{"narrator":"It was narrated that | Humran bin Aban, the freed slave of `Uthman bin `Affan (رضي الله عنه), said:","text":"I saw `Uthman bin `Affan رضي الله عنه call for water at the door of the mosque. He washed his hands, then he rinsed his mouth, and took water into his nose and blew it out; then he washed his face three times, then he washed his hands up to the elbows three times, then he wiped his head. Then he passed his hands over the outside of his ears, then passed them over his beard, then he washed his feet up to the ankles three times. Then he stood and prayed two rak`ahs, Then he said: I have done wudoo’ for you as I saw the Messenger of Allah (ﷺ)  do wudoo’, then I prayed two rak`ahs as I saw him do. When the Messenger of Allah (ﷺ)  had finished praying his two rak`ahs, he said: \n`Whoever does wudoo’ as I have done, then prays two rak`ahs in which he does not let his mind wander, will be forgiven whatever sins came between that and his previous prayer.`"}},{"id":83,"idInBook":83,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا مُعَاوِيَةُ بْنُ عَمْرٍو، حَدَّثَنَا زَائِدَةُ، عَنْ عَاصِمٍ، عَنْ شَقِيقٍ، قَالَ لَقِيَ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ الْوَلِيدَ بْنَ عُقْبَةَ فَقَالَ لَهُ الْوَلِيدُ مَا لِي أَرَاكَ قَدْ جَفَوْتَ أَمِيرَ الْمُؤْمِنِينَ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ فَقَالَ لَهُ عَبْدُ الرَّحْمَنِ أَبْلِغْهُ أَنِّي لَمْ أَفِرَّ يَوْمَ عَيْنَيْنِ قَالَ عَاصِمٌ يَقُولُ يَوْمَ أُحُدٍ وَلَمْ أَتَخَلَّفْ يَوْمَ بَدْرٍ وَلَمْ أَتْرُكْ سُنَّةَ عُمَرَ رَضِيَ اللَّهُ عَنْهُ قَالَ فَانْطَلَقَ فَخَبَّرَ ذَلِكَ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ قَالَ فَقَالَ أَمَّا قَوْلُهُ إِنِّي لَمْ أَفِرَّ يَوْمَ عَيْنَيْنَ فَكَيْفَ يُعَيِّرُنِي بِذَنْبٍ وَقَدْ عَفَا اللَّهُ عَنْهُ فَقَالَ ‏{‏إِنَّ الَّذِينَ تَوَلَّوْا مِنْكُمْ يَوْمَ الْتَقَى الْجَمْعَانِ إِنَّمَا اسْتَزَلَّهُمْ الشَّيْطَانُ بِبَعْضِ مَا كَسَبُوا وَلَقَدْ عَفَا اللَّهُ عَنْهُمْ‏}‏ وَأَمَّا قَوْلُهُ إِنِّي تَخَلَّفْتُ يَوْمَ بَدْرٍ فَإِنِّي كُنْتُ أُمَرِّضُ رُقَيَّةَ بِنْتَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ مَاتَتْ وَقَدْ ضَرَبَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِسَهْمِي وَمَنْ ضَرَبَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِسَهْمِهِ فَقَدْ شَهِدَ وَأَمَّا قَوْلُهُ إِنِّي لَمْ أَتْرُكْ سُنَّةَ عُمَرَ رَضِيَ اللَّهُ عَنْهُ فَإِنِّي لَا أُطِيقُهَا وَلَا هُوَ فَأْتِهِ فَحَدِّثْهُ بِذَلِكَ‏.‏","english":{"narrator":"It was narrated that Shaqeeq said:","text":"`Abdur-Rahman bin ‘Awf met al-Waleed bin `Uqbah. Al-Waleed said to him: Why do i see you keeping away from Ameer al-Mu`mineen `Uthman (-رضي الله عنه-)? `AbdurRahman said to him:Tell him that I did not flee on the day of ‘Ainain -’Asim said: The day of Uhud - and I did not stay behind on the day of Badr, and I did not turn away from the way of ‘Umar (رضي الله عنه). So he went and told that to ‘Uthman (رضي الله عنه), who said: \nAs for his saying that he did not flee on the day of  ‘Ainain, how could he shame me for a fault for which Allah has pardoned me and said: `Those of you who turned back on the day the two hosts met (i.e. the battle of Uhud), it was Shaitan (Satan) who caused them to backslide (run away from the battlefield) because of some (sins) they had earned. But Allah, indeed, has forgiven them` ? \nAs for his saying that I stayed behind on the day of Badr, was tending Ruqayyah, the daughter of the Messenger of Allah (ﷺ) , when she was dying, and the Messenger of Allah (ﷺ)  allocated to me a share (of the booty), and whoever was allocated a share by the Messenger of Allah (ﷺ)  was present.  As for his saying that he did not turn away from the way of ‘Umar ( رضي الله عنه), I cannot bear it and not even he could bear it. Go and tell him that,"}},{"id":84,"idInBook":84,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا إِسْحَاقُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي سَهْلٍ يَعْنِي عُثْمَانَ بْنَ حَكِيمٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي عَمْرَةَ، عَنْ عُثْمَانَ بْنِ عَفَّانَ، رَضِيَ اللَّهُ عَنْهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ صَلَّى الْعِشَاءَ فِي جَمَاعَةٍ كَانَ كَقِيَامِ نِصْفِ لَيْلَةٍ وَمَنْ صَلَّى الْعِشَاءَ وَالْفَجْرَ فِي جَمَاعَةٍ كَانَ كَقِيَامِ لَيْلَةٍ‏.‏","english":{"narrator":"It was narrated that `Uthman bin `Affan said:","text":"The Messenger of Allah (ﷺ) said:Whoever prays `Isha` in congregation, it will be like spending half the night in prayer (qiyam) and whoever prays `Isha` and Fajr in congregation, it will be like spending the whole night in prayer.`"}},{"id":85,"idInBook":85,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنَا أَيُّوبُ، عَنْ نَافِعٍ، عَنْ نُبَيْهِ بْنِ وَهْبٍ، قَالَ أَرَادَ ابْنُ مَعْمَرٍ أَنْ يُنْكِحَ، ابْنَهُ ابْنَةَ شَيْبَةَ بْنِ جُبَيْرٍ فَبَعَثَنِي إِلَى أَبَانَ بْنِ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ وَهُوَ أَمِيرُ الْمَوْسِمِ فَأَتَيْتُهُ فَقُلْتُ لَهُ إِنَّ أَخَاكَ أَرَادَ أَنْ يُنْكِحَ ابْنَهُ فَأَرَادَ أَنْ يُشْهِدَكَ ذَاكَ فَقَالَ أَلَا أُرَاهُ عِرَاقِيًّا جَافِيًا إِنَّ الْمُحْرِمَ لَا يَنْكِحُ وَلَا يُنْكِحُ ثُمَّ حَدَّثَ عَنْ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ بِمِثْلِهِ يَرْفَعُهُ‏.‏","english":{"narrator":"It was narrated that Nubaih bin Wahb said:","text":"Ibn Ma`mar wanted to marry his son to the daughter of Shaibah bin Jubair. So he sent me to Aban bin `Uthman who was the Ameer of Hajj. I came to him and said to him: Your brother wants to arrange his son`s marriage and wants you to witness it. He said: I think you are no more than an ill-mannered Iraqi. The pilgrim in ihram should not get married or arrange a marriage. Then he narrated a similar report from `Uthman (رضي الله عنه) and attributed it to the Prophet (ﷺ)"}},{"id":86,"idInBook":86,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ حُمْرَانَ، مَوْلَى عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ أَنَّ عُثْمَانَ تَوَضَّأَ بِالْمَقَاعِدِ فَغَسَلَ ثَلَاثًا ثَلَاثًا وَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ تَوَضَّأَ وُضُوئِي هَذَا ثُمَّ قَامَ إِلَى الصَّلَاةِ سَقَطَتْ خَطَايَاهُ يَعْنِي مِنْ وَجْهِهِ وَيَدَيْهِ وَرِجْلَيْهِ وَرَأْسِهِ‏.‏","english":{"narrator":"It was narrated from Humran, the freed slave of `Uthman (رضي الله عنه) that `Uthman did wudoo’ in al-Maqa`id, he washed each part of the body three times and said:","text":"I heard the Messenger of Allah (ﷺ) say:  “Whoever does wudoo’ as I have done then gets up to pray, his sins will fall away, i.e., from his face, his hands, his feet and his head.`"}},{"id":87,"idInBook":87,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ أَيُّوبَ بْنِ مُوسَى، عَنْ نُبَيْهِ بْنِ وَهْبٍ، قَالَ اشْتَكَى عُمَرُ بْنُ عُبَيْدِ اللَّهِ بْنِ مَعْمَرٍ عَيْنَيْهِ فَأَرْسَلَ إِلَى أَبَانَ بْنِ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ قَالَ سُفْيَانُ وَهُوَ أَمِيرٌ مَا يَصْنَعُ بِهِمَا قَالَ قَالَ ضَمَّدَهُمَا بِالصَّبِرِ فَإِنِّي سَمِعْتُ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ يُحَدِّثُ ذَلِكَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ‏.‏","english":{"narrator":"It was narrated that Nubaih bin Wahb said:","text":"`Umar bin `Ubaidullah bin Ma`mar had a problem in his eyes. He sent word to Aban bin `Uthman (رضي الله عنه) - Sufyan said: He was the Ameer (of Hajj) - to ask what he should do. He said: Apply aloes to them, for I heard ‘Uthman (رضي الله عنه) narrate that from the Messenger of Allah (ﷺ)."}},{"id":88,"idInBook":88,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي الْحَكَمُ بْنُ مُوسَى أَبُو صَالِحٍ، حَدَّثَنَا سَعِيدُ بْنُ مَسْلَمَةَ، عَنْ إِسْمَاعِيلَ بْنِ أُمَيَّةَ، عَنْ مُوسَى بْنِ عِمْرَانَ بْنِ مَنَّاحٍ، عَنْ أَبَانَ بْنِ عُثْمَانَ، رَضِيَ اللَّهُ عَنْهُ أَنَّهُ رَأَى جَنَازَةً مُقْبِلَةً فَلَمَّا رَآهَا قَامَ وَقَالَ رَأَيْتُ عُثْمَانَ يَفْعَلُ ذَلِكَ وَأَخْبَرَنِي أَنَّهُ رَأَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَفْعَلُهُ‏.‏","english":{"narrator":"It was narrated from Aban bin `Uthman (رضي الله عنه) that he saw a funeral coming towards him. When he saw it, stood up and said:","text":"I saw Uthman (رضي الله عنه) do that and he told me that he saw the Prophet (ﷺ) do that."}},{"id":89,"idInBook":89,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا سُفْيَانُ، عَنْ أَيُّوبَ بْنِ مُوسَى، عَنْ نُبَيْهِ بْنِ وَهْبٍ، عَنْ أَبَانَ بْنِ عُثْمَانَ، رَضِيَ اللَّهُ عَنْهُ عَنْ عُثْمَانَ، يَبْلُغُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَنْكِحُ الْمُحْرِمُ وَلَا يَخْطُبُ‏.‏","english":{"narrator":"It was narrated from `Aban bin `Uthman (رضي الله عنه) from ‘Uthman (رضي الله عنه), who attributed it to the Prophet (ﷺ) , that  said:","text":"`The pilgrim in ihram should not get married or propose marriage.`"}},{"id":90,"idInBook":90,"chapterId":4,"bookId":8,"arabic":"قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ أَيُّوبَ بْنِ مُوسَى بْنِ عَمْرِو بْنِ سَعِيدٍ، عَنْ نُبَيْهِ بْنِ وَهْبٍ، رَجُلٍ مِنْ الْحَجَبَةِ عَنْ أَبَانَ بْنِ عُثْمَانَ، رَضِيَ اللَّهُ عَنْهُ أَنَّهُ حَدَّثَ عَنْ عُثْمَانَ، رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَخَّصَ أَوْ قَالَ فِي الْمُحْرِمِ إِذَا اشْتَكَى عَيْنَهُ أَنْ يُضَمِّدَهَا بِالصَّبِرِ‏.‏","english":{"narrator":"","text":"It was narrated from Aban bin `Uthman (رضي الله عنه) that he narrated from `Uthman (رضي الله عنه) that  the Messenger of Allah (ﷺ)  granted a concession, or said concerning the pilgrim in ihram, if he has a problem in his eyes, that he may apply aloes to them."}},{"id":91,"idInBook":91,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنِ الْوَلِيدِ أَبِي بِشْرٍ، عَنْ حُمْرَانَ، عَنْ عُثْمَانَ، رَضِيَ اللَّهُ عَنْهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ مَاتَ وَهُوَ يَعْلَمُ أَنَّهُ لَا إِلَهَ إِلَّا اللَّهُ دَخَلَ الْجَنَّةَ‏.‏","english":{"narrator":"It was narrated that ‘Uthman (رضي الله عنه) said:","text":"“Whoever dies knowing that there is no God but Allah will enter Paradise.”"}},{"id":92,"idInBook":92,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا عَوْفُ بْنُ أَبِي جَمِيلَةَ، حَدَّثَنِي يَزِيدُ الْفَارِسِيُّ، حَدَّثَنَا ابْنُ عَبَّاسٍ، قَالَ قُلْتُ لِعُثْمَانَ مَا حَمَلَكُمْ عَلَى أَنْ عَمَدْتُمْ إِلَى سُورَةِ الْأَنْفَالِ وَهِيَ مِنْ الْمَثَانِي وَإِلَى سُورَةِ بَرَاءَةٌ وَهِيَ مِنْ الْمِئِينَ فَقَرَنْتُمْ بَيْنَهُمَا وَلَمْ تَكْتُبُوا بَيْنَهُمَا سَطْرَ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ فَوَضَعْتُمُوهَا فِي السَّبْعِ الطِّوَالِ فَمَا حَمَلَكُمْ عَلَى ذَلِكَ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِمَّا يَأْتِي عَلَيْهِ الزَّمَانُ وَهُوَ يُنْزَلُ عَلَيْهِ مِنْ السُّوَرِ ذَوَاتِ الْعَدَدِ فَكَانَ إِذَا أُنْزِلَ عَلَيْهِ الشَّيْءُ دَعَا بَعْضَ مَنْ يَكْتُبُ لَهُ فَيَقُولُ ضَعُوا هَذِهِ فِي السُّورَةِ الَّتِي يُذْكَرُ فِيهَا كَذَا وَكَذَا وَإِذَا أُنْزِلَتْ عَلَيْهِ الْآيَاتُ قَالَ ضَعُوا هَذِهِ الْآيَاتِ فِي السُّورَةِ الَّتِي يُذْكَرُ فِيهَا كَذَا وَكَذَا وَإِذَا أُنْزِلَتْ عَلَيْهِ الْآيَةُ قَالَ ضَعُوا هَذِهِ الْآيَةَ فِي السُّورَةِ الَّتِي يُذْكَرُ فِيهَا كَذَا وَكَذَا وَكَانَتْ سُورَةُ الْأَنْفَالِ مِنْ أَوَائِلِ مَا نَزَلَ بِالْمَدِينَةِ وَكَانَتْ سُورَةُ بَرَاءَةٌ مِنْ أَوَاخِرِ مَا أُنْزِلَ مِنْ الْقُرْآنِ قَالَ فَكَانَتْ قِصَّتُهَا شَبِيهًا بِقِصَّتِهَا فَظَنَنَّا أَنَّهَا مِنْهَا وَقُبِضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَمْ يُبَيِّنْ لَنَا أَنَّهَا مِنْهَا فَمِنْ أَجْلِ ذَلِكَ قَرَنْتُ بَيْنَهُمَا وَلَمْ أَكْتُبْ بَيْنَهُمَا سَطْرَ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ وَوَضَعْتُهَا فِي السَّبْعِ الطِّوَالِ‏.‏","english":{"narrator":"Ibn `Abbas (رضي الله عنه) told us. I said to ‘Uthman bin `Affan:","text":"What made you take al-Anfal, which is one of the Mathani and Bara`ah, which is one of al-mi’een, and put them next to one another and not write - Ibn Ja`far said: A line between them saying Bismillahir-Rahmanir-Raheem - and put it with the seven long ones? What made you do that? `Uthman (رضي الله عنه) said. Sometimes many soorahs would be revealed (incomplete) to the Messenger of Allah (ﷺ) , and when something was revealed he would call one of the scribes to write it down for him and say: `Put this in the soorah in which such and such is mentioned`; and verses would be revealed to him and he would say, `Put these verses in the soorah in which such and such is mentioned`; and a verse would be revealed to him and he would say: `Put this verse in the soorah in which such and such is mentioned.` Al-Anfal was one of the first soorahs to be revealed in Madinah and Bara`ah was one of the last soorahs of the Qur`an, and the content of the two soorahs was similar. Then the Messenger of Allah (ﷺ) passed away without having stated clearly to us that it was part of it, but we thought that it was, hence I put them together and I did not put between them the line Bismillahir-Rahmanir-Raheem, and I put it with the seven long ones."}},{"id":93,"idInBook":93,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ سُفْيَانَ، وَشُعْبَةَ، عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ، عَنْ سَعْدِ بْنِ عُبَيْدَةَ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ عُثْمَانَ، رَضِيَ اللَّهُ عَنْهُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ سُفْيَانُ أَفْضَلُكُمْ وَقَالَ شُعْبَةُ خَيْرُكُمْ مَنْ تَعَلَّمَ الْقُرْآنَ وَعَلَّمَهُ‏.‏","english":{"narrator":"It was narrated from `Uthman (رضي الله عنه) that The Prophet (ﷺ) said:","text":"“The best of you are those who learn Qur`an and teach it.`"}},{"id":94,"idInBook":94,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا وَكِيعٌ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، قَالَ قَالَ قَيْسٌ فَحَدَّثَنِي أَبُو سَهْلَةَ، أَنَّ عُثْمَانَ، قَالَ يَوْمَ الدَّارِ حِينَ حُصِرَ إِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَهِدَ إِلَيَّ عَهْدًا فَأَنَا صَابِرٌ عَلَيْهِ قَالَ قَيْسٌ فَكَانُوا يَرَوْنَهُ ذَلِكَ الْيَوْمَ‏.‏","english":{"narrator":"Abu Sahlah narrated that `Uthman (رضي الله عنه) said on the day of the house when he was under siege. The Prophet (ﷺ) solemnly advised me and I shall follow his advice with patience. Qais said:","text":"They thought it (his advice) was about that day."}},{"id":95,"idInBook":95,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا يَزِيدُ، أَنْبَأَنَا مَهْدِيُّ بْنُ مَيْمُونٍ، عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي يَعْقُوبَ، عَنِ الْحَسَنِ بْنِ سَعْدٍ، قَالَ حَدَّثَنِي رَبَاحٌ، قَالَ زَوَّجَنِي مَوْلَايَ جَارِيَةً رُومِيَّةً فَوَقَعْتُ عَلَيْهَا فَوَلَدَتْ لِي غُلَامًا أَسْوَدَ مِثْلِي فَسَمَّيْتُهُ عَبْدَ اللَّهِ ثُمَّ وَقَعْتُ عَلَيْهَا فَوَلَدَتْ لِي غُلَامًا أَسْوَدَ مِثْلِي فَسَمَّيْتُهُ عُبَيْدَ اللَّهِ ثُمَّ طَبِنَ لِي غُلَامٌ رُومِيٌّ قَالَ حَسِبْتُهُ قَالَ لِأَهْلِي رُومِيٌّ يُقَالُ لَهُ يُوحَنَّسُ فَرَاطَنَهَا بِلِسَانِهِ يَعْنِي بِالرُّومِيَّةِ فَوَقَعَ عَلَيْهَا فَوَلَدَتْ لَهُ غُلَامًا أَحْمَرَ كَأَنَّهُ وَزَغَةٌ مِنْ الْوَزَغَاتِ فَقُلْتُ لَهَا مَا هَذَا فَقَالَتْ هَذَا مِنْ يُوحَنَّسَ قَالَ فَارْتَفَعْنَا إِلَى عُثْمَانَ بْنِ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ وَأَقَرَّا جَمِيعًا فَقَالَ عُثْمَانُ إِنْ شِئْتُمْ قَضَيْتُ بَيْنَكُمْ بِقَضِيَّةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى أَنَّ الْوَلَدَ لِلْفِرَاشِ قَالَ حَسِبْتُهُ قَالَ وَجَلَدَهُمَا‏.‏","english":{"narrator":"It was narrated from al-Hasan bin Sa`d that Rabah said:","text":"My masters married me to a Roman slave girl of theirs. I was intimate with her and she bore me a boy who was black like me and I named him `Abdullah. Then I was intimate with her again and she bore me a boy who was black like me, and I named him ‘Ubaidullah. My masters had a Roman slave whose name was Yuhannas, who spoke to her in his language, i.e. the Roman language. Then he was intimate with her and she bore him a boy who was red like a lizard. I said to her: What is this? She said: He is the child of Yuhannas. So we referred the case to Ameer al Mu`mineen `Uthman (رضي الله عنه) and they both confessed. He said: Will you agree to me passing judgement between you according to the judgement of the Messenger of Allah (ﷺ) ?He said:The Messenger of Allah (ﷺ) ruled that the child be attributed to the (husband of the) woman. And he flogged them."}},{"id":96,"idInBook":96,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ جَامِعِ بْنِ شَدَّادٍ، قَالَ سَمِعْتُ حُمْرَانَ بْنَ أَبَانَ، يُحَدِّثُ أَبَا بُرْدَةَ فِي الْمَسْجِدِ أَنَّهُ سَمِعَ عُثْمَانَ بْنَ عَفَّانَ، يُحَدِّثُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ مَنْ أَتَمَّ الْوُضُوءَ كَمَا أَمَرَهُ اللَّهُ فَالصَّلَوَاتُ الْمَكْتُوبَاتُ كَفَّارَاتٌ لِمَا بَيْنَهُنَّ‏.‏","english":{"narrator":"It was narrated that Jami` bin Shaddad said:","text":"I heard Humran bin Aban telling Abu Burdah in the mosque that he heard `Uthman bin `Affan (رضي الله عنه) narrate from the Prophet (ﷺ)  that he said: “Whoever does wudoo’ properly as enjoined by Allah, the prescribed prayers will be expiations for whatever comes between them.`"}},{"id":97,"idInBook":97,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ سِمَاكِ بْنِ حَرْبٍ، قَالَ سَمِعْتُ عَبَّادَ بْنَ زَاهِرٍ أَبَا رُوَاعٍ، قَالَ سَمِعْتُ عُثْمَانَ، رَضِيَ اللَّهُ عَنْهُ يَخْطُبُ فَقَالَ إِنَّا وَاللَّهِ قَدْ صَحِبْنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي السَّفَرِ وَالْحَضَرِ وَكَانَ يَعُودُ مَرْضَانَا وَيَتْبَعُ جَنَائِزَنَا وَيَغْزُو مَعَنَا وَيُوَاسِينَا بِالْقَلِيلِ وَالْكَثِيرِ وَإِنَّ نَاسًا يُعْلِمُونِي بِهِ عَسَى أَنْ لَا يَكُونَ أَحَدُهُمْ رَآهُ قَطُّ‏.‏","english":{"narrator":"It was narrated that Simak Harb said:","text":"I heard Abbad bin Zahir Abu Ruwa` say: I heard ‘Uthman (رضي الله عنه) delivering a khutbah in which he said: By Allah, l accompanied the Messenger of Allah (ﷺ) whilst travelling and not traveling; he used to visit our sick, attend our funerals, go out on campaign with us and comfort us with whatever means he could. Some people tell me about him and perhaps none of them ever saw him."}},{"id":98,"idInBook":98,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنِي شُعَيْبٌ أَبُو شَيْبَةَ، قَالَ سَمِعْتُ عَطَاءً الْخُرَاسَانِيَّ، يَقُولُ سَمِعْتُ سَعِيدَ بْنَ الْمُسَيَّبِ، يَقُولُ رَأَيْتُ عُثْمَانَ قَاعِدًا فِي الْمَقَاعِدِ فَدَعَا بِطَعَامٍ مِمَّا مَسَّتْهُ النَّارُ فَأَكَلَهُ ثُمَّ قَامَ إِلَى الصَّلَاةِ فَصَلَّى ثُمَّ قَالَ عُثْمَانُ قَعَدْتُ مَقْعَدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَكَلْتُ طَعَامَ رَسُولِ اللَّهِ وَصَلَّيْتُ صَلَاةَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ‏.‏","english":{"narrator":"Sa`eed bin al-Musayyab said.:","text":"I saw `Uthman (رضي الله عنه ) sitting in al-Maqa`id. He called for food that had been touched by fire and ate it, then he got up to pray; he prayed, then `Uthman (رضي الله عنه) said: I sat where the Messenger of Allah (ﷺ)  sat and  ate the food that the Messenger of Allah (ﷺ) ate and I offered the prayer that the Messenger of Allah (ﷺ) offered."}},{"id":99,"idInBook":99,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا الضَّحَّاكُ بْنُ مَخْلَدٍ، حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ، حَدَّثَنِي أَبِي، عَنْ مَحْمُودِ بْنِ لَبِيدٍ، أَنَّ عُثْمَانَ، رَضِيَ اللَّهُ عَنْهُ أَرَادَ أَنْ يَبْنِيَ مَسْجِدَ الْمَدِينَةِ فَكَرِهَ النَّاسُ ذَاكَ وَأَحَبُّوا أَنْ يَدَعُوهُ عَلَى هَيْئَتِهِ فَقَالَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ بَنَى مَسْجِدًا لِلَّهِ بَنَى اللَّهُ لَهُ بَيْتًا فِي الْجَنَّةِ مِثْلَهُ‏.‏","english":{"narrator":"It was narrated from Mahmood bin Labeed That `Uthman (رضي الله عنه) wanted to build (an extension to) the mosque of Madinah, but the people objected to that and wanted to leave it as it was. `Uthman (رضي الله عنه) said:","text":"I heard the Messenger of Allah( ﷺ)  say: `Whoever builds a mosque for the sake of Allah, Allah will build for him a house like it in Paradise.`"}},{"id":100,"idInBook":100,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَبْدُ الْكَبِيرِ بْنُ عَبْدِ الْمَجِيدِ أَبُو بَكْرٍ الْحَنَفِيُّ، حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ، عَنْ أَبِيهِ، عَنْ مَحْمُودِ بْنِ لَبِيدٍ، عَنْ عُثْمَانَ بْنِ عَفَّانَ، رَضِيَ اللَّهُ عَنْهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ تَعَمَّدَ عَلَيَّ كَذِبًا فَلْيَتَبَوَّأْ بَيْتًا فِي النَّارِ‏.‏","english":{"narrator":"It was narrated that `Uthman bin `Affan (رضي الله عنه) said:","text":"The Messenger of Allah (ﷺ) said: `Whoever tells a lie about me deliberately, let him take up his abode in Hell.`"}},{"id":101,"idInBook":101,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنَا يُونُسُ، حَدَّثَنَا عَطَاءُ بْنُ فَرُّوخَ، مَوْلَى الْقُرَشِيِّينَ عَنْ عُثْمَانَ بْنِ عَفَّانَ، رَضِيَ اللَّهُ عَنْهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَدْخَلَ اللَّهُ رَجُلًا الْجَنَّةَ كَانَ سَهْلًا مُشْتَرِيًا وَبَائِعًا وَقَاضِيًا وَمُقْتَضِيًا‏.‏","english":{"narrator":"It was narrated that ‘Uthman bin `Affan(رضي الله عنه) said:","text":"The Messenger of Allah (ﷺ) said: `Allah admitted to Paradise a man who was easygoing in buying and selling, when paying off debt and when asking for a debt that was owed to him.`"}},{"id":102,"idInBook":102,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ، قَالَ كُنَّا مَعَ عُثْمَانَ وَهُوَ مَحْصُورٌ فِي الدَّارِ قَالَ وَلِمَ تَقْتُلُونَنِي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا يَحِلُّ دَمُ امْرِئٍ مُسْلِمٍ إِلَّا بِإِحْدَى ثَلَاثٍ رَجُلٌ كَفَرَ بَعْدَ إِسْلَامِهِ أَوْ زَنَى بَعْدَ إِحْصَانِهِ أَوْ قَتَلَ نَفْسًا فَيُقْتَلُ بِهَا‏.‏","english":{"narrator":"It was narrated that Abu Umamah bin Sahl bin Hunaif said. We were with Uthman when he was besieged in the house. He said:","text":"Why would they kill me? I heard the Messenger of Allah (ﷺ) say: `It is not permissible (to shed) the blood of a Muslim except in three cases: If a man disbelieves after becoming Muslim, or commits zina after being married or kills someone and is executed in retaliation.`"}},{"id":103,"idInBook":103,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنْ سَعِيدِ بْنِ خَالِدِ بْنِ عَبْدِ اللَّهِ بْنِ قَارِظٍ، عَنْ أَبِي عُبَيْدٍ، مَوْلَى عَبْدِ الرَّحْمَنِ بْنِ أَزْهَرَ قَالَ رَأَيْتُ عَلِيًّا وَعُثْمَانَ رَضِيَ اللَّهُ عَنْهُمَا يُصَلِّيَانِ يَوْمَ الْفِطْرِ وَالْأَضْحَى ثُمَّ يَنْصَرِفَانِ يُذَكِّرَانِ النَّاسَ قَالَ وَسَمِعْتُهُمَا يَقُولَانِ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ صِيَامِ هَذَيْنِ الْيَوْمَيْنِ‏.‏\nقَالَ وَسَمِعْتُ عَلِيًّا، يَقُولُ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَبْقَى مِنْ نُسُكِكُمْ عِنْدَكُمْ شَيْءٌ بَعْدَ ثَلَاثٍ‏.‏","english":{"narrator":"It was narrated that Abu ‘Ubaid, the freed slave of `AbdurRahman bin Azhar, said:","text":"l saw `Ali (رضي الله عنه) and `Uthman (رضي الله عنه) on the day of Eid al-Fitr and Eid al-Adha; they prayed, then when they finished they reminded the people. I heard them saying: The Messenger of Allah (ﷺ) forbade fasting on these two days. He said: And I heard ‘Ali say: The Messenger of Allah (ﷺ) forbade anything of the sacrificial meat to be left after three days."}},{"id":104,"idInBook":104,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا بَهْزٌ، حَدَّثَنَا أَبُو عَوَانَةَ، حَدَّثَنَا حُصَيْنٌ، عَنْ عَمْرِو بْنِ جَاوَانَ، قَالَ قَالَ الْأَحْنَفُ انْطَلَقْنَا حُجَّاجًا فَمَرَرْنَا بِالْمَدِينَةِ فَبَيْنَمَا نَحْنُ فِي مَنْزِلِنَا إِذْ جَاءَنَا آتٍ فَقَالَ النَّاسُ مِنْ فَزَعٍ فِي الْمَسْجِدِ فَانْطَلَقْتُ أَنَا وَصَاحِبِي فَإِذَا النَّاسُ مُجْتَمِعُونَ عَلَى نَفَرٍ فِي الْمَسْجِدِ قَالَ فَتَخَلَّلْتُهُمْ حَتَّى قُمْتُ عَلَيْهِمْ فَإِذَا عَلِيُّ بْنُ أَبِي طَالِبٍ وَالزُّبَيْرُ وَطَلْحَةُ وَسَعْدُ بْنُ أَبِي وَقَّاصٍ قَالَ فَلَمْ يَكُنْ ذَلِكَ بِأَسْرَعَ مِنْ أَنْ جَاءَ عُثْمَانُ يَمْشِي فَقَالَ أَهَاهُنَا عَلِيٌّ قَالُوا نَعَمْ قَالَ أَهَاهُنَا الزُّبَيْرُ قَالُوا نَعَمْ قَالَ أَهَاهُنَا طَلْحَةُ قَالُوا نَعَمْ قَالَ أَهَاهُنَا سَعْدٌ قَالُوا نَعَمْ قَالَ أَنْشُدُكُمْ بِاللَّهِ الَّذِي لَا إِلَهَ إِلَّا هُوَ أَتَعْلَمُونَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ يَبْتَاعُ مِرْبَدَ بَنِي فُلَانٍ غَفَرَ اللَّهُ لَهُ فَابْتَعْتُهُ فَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ إِنِّي قَدْ ابْتَعْتُهُ فَقَالَ اجْعَلْهُ فِي مَسْجِدِنَا وَأَجْرُهُ لَكَ قَالُوا نَعَمْ قَالَ أَنْشُدُكُمْ بِاللَّهِ الَّذِي لَا إِلَهَ إِلَّا هُوَ أَتَعْلَمُونَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ يَبْتَاعُ بِئْرَ رُومَةَ فَابْتَعْتُهَا بِكَذَا وَكَذَا فَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ إِنِّي قَدْ ابْتَعْتُهَا يَعْنِي بِئْرَ رُومَةَ فَقَالَ اجْعَلْهَا سِقَايَةً لِلْمُسْلِمِينَ وَأَجْرُهَا لَكَ قَالُوا نَعَمْ قَالَ أَنْشُدُكُمْ بِاللَّهِ الَّذِي لَا إِلَهَ إِلَّا هُوَ أَتَعْلَمُونَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَظَرَ فِي وُجُوهِ الْقَوْمِ يَوْمَ جَيْشِ الْعُسْرَةِ فَقَالَ مَنْ يُجَهِّزُ هَؤُلَاءِ غَفَرَ اللَّهُ لَهُ فَجَهَّزْتُهُمْ حَتَّى مَا يَفْقِدُونَ خِطَامًا وَلَا عِقَالًا قَالُوا اللَّهُمَّ نَعَمْ قَالَ اللَّهُمَّ اشْهَدْ اللَّهُمَّ اشْهَدْ اللَّهُمَّ اشْهَدْ ثُمَّ انْصَرَفَ‏.‏","english":{"narrator":"Al-Ahnaf said:","text":"We set out for Hajj, and passed by Madinah. Whilst we were in our camp, someone came to us and said: The people are in a panic in the mosque. My companion and I set out, and we found some people gathered around a group in the mosque. I pushed through them until I got to (that group), where I found ` Ali bin Abi Talib, Az-Zubair, Talhah and Sa`d bin Abi Waqqas. Soon ‘Uthman came walking and said: Is `Ali here? They said: Yes. He said: ls Az-Zubair here? They said: Yes. He said: ls Talhah here? They said: Yes. He said: ls Sa`d here? They said: Yes. He said: I adjure you by Allah, beside Whom there is no other god, do you know that the Messenger of Allah (ﷺ)  said: “Whoever buys the date-drying place of (the tribe of) Banu so- and-so, Allah will forgive him.” so I bought it and went to the Messenger of Allah (ﷺ) and said: I have bought it; he said: `Add it to our mosque and the reward for that will be yours”? They said: Yes. He said: I adjure you by Allah, beside Whom there is no other god, do you know that the Messenger of Allah (ﷺ) said: “Who will buy the well of Roomah?` so I bought it for such and such and went to the Messenger of Allah (ﷺ)  and said: I have bought it - meaning the well of Roomah, and he said: `Make it a water source for the Muslims and the reward for that will be yours`? They said: Yes. He said: I adjure you by Allah, beside Whom there is no other god, do you know that the Messenger of Allah (ﷺ)  looked at the faces of the people on the day of the army of hardship (Tabook) and said: “Whoever equips these men, Allah will forgive him,” so I equipped them until they were not without even reins or ropes? They said: By Allah, yes. He said: O Allah, bear witness, O Allah, bear witness; O Allah, bear witness. Then he left"}},{"id":105,"idInBook":105,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي سُلَيْمَانُ بْنُ عَتِيقٍ، عَنْ عَبْدِ اللَّهِ بْنِ بَابَيْهِ، عَنْ بَعْضِ بَنِي يَعْلَى بْنِ أُمَيَّةَ، قَالَ قَالَ يَعْلَى طُفْتُ مَعَ عُثْمَانَ فَاسْتَلَمْنَا الرُّكْنَ قَالَ يَعْلَى فَكُنْتُ مِمَّا يَلِي الْبَيْتَ فَلَمَّا بَلَغْنَا الرُّكْنَ الْغَرْبِيَّ الَّذِي يَلِي الْأَسْوَدَ جَرَرْتُ بِيَدِهِ لِيَسْتَلِمَ فَقَالَ مَا شَأْنُكَ فَقُلْتُ أَلَا تَسْتَلِمُ قَالَ فَقَالَ أَلَمْ تَطُفْ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ بَلَى قَالَ أَرَأَيْتَهُ يَسْتَلِمُ هَذَيْنِ الرُّكْنَيْنِ الْغَرْبِيَّيْنِ قُلْتُ لَا قَالَ أَفَلَيْسَ لَكَ فِيهِ أُسْوَةٌ حَسَنَةٌ قُلْتُ بَلَى قَالَ فَانْفُذْ عَنْكَ‏.‏","english":{"narrator":"It was narrated that one of the family of Ya`la bin Umayyah said:","text":"Ya`la said:I circumambulated  with ‘Uthman (رضي الله عنه) and he touched the corner. Ya`la said: I was next to the House and when I reached the western corner which is next to the Black Stone. I took his hand to touch it and he said: What is the matter with you? I said: Aren`t you going to touch it? He said: Did you not do tawaf with the Messenger of Allah (ﷺ) ” I said: Yes indeed. He said: Did you see him touch these two western corners? I said, No. He said: Don`t you have a good example in him? I said: Yes indeed. He said. Then stop bothering about that."}},{"id":106,"idInBook":106,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا أَبُو عَبْدِ الرَّحْمَنِ الْمُقْرِئُ، حَدَّثَنَا حَيْوَةُ، أَنْبَأَنَا أَبُو عَقِيلٍ، أَنَّهُ سَمِعَ الْحَارِثَ، مَوْلَى عُثْمَانَ يَقُولُ جَلَسَ عُثْمَانُ يَوْمًا وَجَلَسْنَا مَعَهُ فَجَاءَهُ الْمُؤَذِّنُ فَدَعَا بِمَاءٍ فِي إِنَاءٍ أَظُنُّهُ سَيَكُونُ فِيهِ مُدٌّ فَتَوَضَّأَ ثُمَّ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَوَضَّأُ وُضُوئِي هَذَا ثُمَّ قَالَ وَمَنْ تَوَضَّأَ وُضُوئِي ثُمَّ قَامَ فَصَلَّى صَلَاةَ الظُّهْرِ غُفِرَ لَهُ مَا كَانَ بَيْنَهَا وَبَيْنَ الصُّبْحِ ثُمَّ صَلَّى الْعَصْرَ غُفِرَ لَهُ مَا بَيْنَهَا وَبَيْنَ صَلَاةِ الظُّهْرِ ثُمَّ صَلَّى الْمَغْرِبَ غُفِرَ لَهُ مَا بَيْنَهَا وَبَيْنَ صَلَاةِ الْعَصْرِ ثُمَّ صَلَّى الْعِشَاءَ غُفِرَ لَهُ مَا بَيْنَهَا وَبَيْنَ صَلَاةِ الْمَغْرِبِ ثُمَّ لَعَلَّهُ أَنْ يَبِيتَ يَتَمَرَّغُ لَيْلَتَهُ ثُمَّ إِنْ قَامَ فَتَوَضَّأَ وَصَلَّى الصُّبْحَ غُفِرَ لَهُ مَا بَيْنَهَا وَبَيْنَ صَلَاةِ الْعِشَاءِ وَهُنَّ الْحَسَنَاتُ يُذْهِبْنَ السَّيِّئَاتِ قَالُوا هَذِهِ الْحَسَنَاتُ فَمَا الْبَاقِيَاتُ يَا عُثْمَانُ قَالَ هُنَّ لَا إِلَهَ إِلَّا اللَّهُ وَسُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَاللَّهُ أَكْبَرُ وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ‏.‏","english":{"narrator":"Alu’ Aqeel narrated  That he heard al Harith, the freed slave of `Uthman  (رضي الله عنه), say:","text":"`Uthman sat down one day and we sat down with him. The Mu’adhdhin came to him and `Uthman called for water in a vessel which I thought would contain one mudd. He did wudoo`, then he said: I saw the Messenger of Allah (ﷺ)  doing wudoo’ as I have just done it, then he said: `Whoever does wudoo` as I have just done, then gets up and prays Zuhr, will be forgiven for (whatever sins he committed) between it and Fajr; then if he prays `Asr. he will be forgiven so? (whatever sins he committed) between it and Zuhr, then if he prays Maghrib, he will be forgiven for (whatever sins he committed) between it and ‘Asr, then if he prays Isha‘, he will be forgiven for (whatever sins he committed) between it and Maghrib. Then he may spend the night indulging in physical pleasure, then if he gets up and does wudoo’ and prays Fajr, he will be forgiven for (whatever sins he committed) between it and `Isha`. These are the good deeds that remove the evil deeds (cf. 11:114).” They said: These are the good deeds, but what are the good righteous deeds that last (cf. 18:46), O` Uthman? He said: They are (the words)La Ilaha Illallah, wa subhanallah wal-hamdu Lillah wallahu akbar, wa la hawla wa la quwwata illa billah ( There is no god but Allah, praise be to Allah, Allah is most great and there is no power and no strength except with Allah)"}},{"id":107,"idInBook":107,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا حَجَّاجٌ، حَدَّثَنَا لَيْثٌ، حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، عَنْ يَحْيَى بْنِ سَعِيدِ بْنِ الْعَاصِ، أَنَّ سَعِيدَ بْنَ الْعَاصِ، أَخْبَرَهُ أَنَّ عَائِشَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعُثْمَانَ حَدَّثَاهُ أَنَّ أَبَا بَكْرٍ رَضِيَ اللَّهُ عَنْهُ اسْتَأْذَنَ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ مُضْطَجِعٌ عَلَى فِرَاشِهِ لَابِسٌ مِرْطَ عَائِشَةَ فَأَذِنَ لِأَبِي بَكْرٍ رَضِيَ اللَّهُ عَنْهُ وَهُوَ كَذَلِكَ فَقَضَى إِلَيْهِ حَاجَتَهُ ثُمَّ انْصَرَفَ ثُمَّ اسْتَأْذَنَ عُمَرُ رَضِيَ اللَّهُ عَنْهُ فَأَذِنَ لَهُ وَهُوَ عَلَى تِلْكَ الْحَالِ فَقَضَى إِلَيْهِ حَاجَتَهُ ثُمَّ انْصَرَفَ قَالَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ ثُمَّ اسْتَأْذَنْتُ عَلَيْهِ فَجَلَسَ وَقَالَ لِعَائِشَةَ رَضِيَ اللَّهُ عَنْهَا اجْمَعِي عَلَيْكِ ثِيَابَكِ فَقَضَى إِلَيَّ حَاجَتِي ثُمَّ انْصَرَفْتُ قَالَتْ عَائِشَةُ رَضِيَ اللَّهُ عَنْهَا يَا رَسُولَ اللَّهِ مَا لِي لَمْ أَرَكَ فَزِعْتَ لِأَبِي بَكْرٍ وَعُمَرَ كَمَا فَزِعْتَ لِعُثْمَانَ رَضِيَ اللَّهُ عَنْهُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ عُثْمَانَ رَجُلٌ حَيِيٌّ وَإِنِّي خَشِيتُ إِنْ أَذِنْتُ لَهُ عَلَى تِلْكَ الْحَالِ أَنْ لَا يَبْلُغَ إِلَيَّ فِي حَاجَتِهِ و قَالَ اللَّيْثُ وَقَالَ جَمَاعَةُ النَّاسِ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِعَائِشَةَ رَضِيَ اللَّهُ عَنْهَا أَلَا أَسْتَحْيِي مِمَّنْ يَسْتَحْيِي مِنْهُ الْمَلَائِكَةُ.\nحَدَّثَنَا يَعْقُوبُ حَدَّثَنَا أَبِي عَنْ صَالِحٍ قَالَ ابْنُ شِهَابٍ أَخْبَرَنِي يَحْيَى بْنُ سَعِيدِ بْنِ الْعَاصِ أَنَّ سَعِيدَ بْنَ الْعَاصِ أَخْبَرَهُ أَنَّ عُثْمَانَ وَعَائِشَةَ حَدَّثَاهُ أَنَّ أَبَا بَكْرٍ رَضِيَ اللَّهُ عَنْهُ اسْتَأْذَنَ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ مُضْطَجِعٌ عَلَى فِرَاشِهِ لَابِسٌ مِرْطَ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا فَذَكَرَ مَعْنَى حَدِيثِ عُقَيْلٍ‏.‏","english":{"narrator":"`A`ishah, the wife of the Prophet (ﷺ) and ‘Uthman  (رضي الله عنه) narrated that Abu Bakr asked for permission to enter upon the Messenger of Allah (SWT) when he was lying down on his bed, wearing the cover of `A`ishah. He gave permission to Abu Bakr (to enter) when he was like that, and he fulfilled his need then he went away. Then ‘Umar asked for permission to enter and he gave him permission (to enter) when he was like that, and he fulfilled his need then he went away. `Uthman said:","text":"Then I asked permission to enter and he set up and said to `A`ishah: `Cover yourself properly.` I fulfilled my need then I went away, `A`ishah said: O Messenger of Allah (ﷺ), why did I not see you stirring for Abu Bakr and ‘Umar as you did for `Uthman? The Messenger of Allah (SWT) said: ``Uthman is a shy man, and I was afraid that if I gave him permission to enter when I was in that state, he would not tell me of his need.` Al-Laith said: Some people said: The Messenger of Allah (ﷺ)  said to `A`ishah (رضي الله عنه): `Should I not feel shy before a man before whom the angels feel shy?`\n\nSa`eed bin al-`As narrated that `Uthman and `A`ishah narrated that Abu Bakr asked for permission to enter upon the Messenger of Allah (ﷺ) when he was lying down on his bed, wearing the cover of `A`ishah. And he narrated a hadeeth similar to that of ‘Uqail."}},{"id":108,"idInBook":108,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا يُونُسُ، حَدَّثَنَا لَيْثٌ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ عَبْدِ اللَّهِ يَعْنِي ابْنَ أَبِي سَلَمَةَ، وَنَافِعِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ، عَنْ مُعَاذِ بْنِ عَبْدِ الرَّحْمَنِ التَّيْمِيِّ، عَنْ حُمْرَانَ، مَوْلَى عُثْمَانَ عَنْ عُثْمَانَ بْنِ عَفَّانَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ تَوَضَّأَ فَأَسْبَغَ الْوُضُوءَ ثُمَّ مَشَى إِلَى صَلَاةٍ مَكْتُوبَةٍ فَصَلَّاهَا غُفِرَ لَهُ ذَنْبُهُ‏.‏","english":{"narrator":"It was narrated from Humran, the freed slave of ‘Uthman, that `Uthman bin `Affan said:","text":"I heard the Messenger of Allah (ﷺ) say: `Whoever does wudoo’ and does it properly, then goes to offer an obligatory prayer and offers it, his sins will be forgiven.”"}},{"id":109,"idInBook":109,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، حَدَّثَنَا عُبَيْدُ اللَّهِ يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ بْنِ مَوْهَبٍ، أَخْبَرَنِي عَمِّي، عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنُ مَوْهَبٍ عَنْ أَبِي هُرَيْرَةَ، رَضِيَ اللَّهُ عَنْهُ قَالَ رَاحَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ إِلَى مَكَّةَ حَاجًّا وَدَخَلَتْ عَلَى مُحَمَّدِ بْنِ جَعْفَرِ بْنِ أَبِي طَالِبٍ امْرَأَتُهُ فَبَاتَ مَعَهَا حَتَّى أَصْبَحَ ثُمَّ غَدَا عَلَيْهِ رَدْعُ الطِّيبِ وَمِلْحَفَةٌ مُعَصْفَرَةٌ مُفْدَمَةٌ فَأَدْرَكَ النَّاسَ بِمَلَلٍ قَبْلَ أَنْ يَرُوحُوا فَلَمَّا رَآهُ عُثْمَانُ انْتَهَرَ وَأَفَّفَ وَقَالَ أَتَلْبَسُ الْمُعَصْفَرَ وَقَدْ نَهَى عَنْهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَهُ عَلِيُّ بْنُ أَبِي طَالِبٍ رَضِيَ اللَّهُ عَنْهُ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَنْهَهُ وَلَا إِيَّاكَ إِنَّمَا نَهَانِي‏.‏","english":{"narrator":"It was narrated that Abu Hurairah (رضي الله عنه) said:","text":"`Uthman (رضي الله عنه) went to Makkah for Hajj. The wife of Muhammad bin Ja`far bin Abi Talib entered upon him (i.e., her husband) and he spent the night with her. Then the next morning, he (i.e., Muhammad bin Ja`far) came out smelling of perfume and wearing a wrapper saturated with safflower dye. He caught up with the people in weariness before they set out. When `Uthman saw him, he rebuked him and expressed disapproval, saying: Are you wearing something dyed with safflower when the Messenger of Allah (ﷺ)  forbade that? `Ali bin Abi Talib (رضي الله عنه) said to him: The Messenger of Allah (ﷺ) did not forbid it to him or you; he only forbade it to me."}},{"id":110,"idInBook":110,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي أَبِي وَأَبُو خَيْثَمَةَ قَالَا حَدَّثَنَا يَعْقُوبُ، قَالَ أَبِي فِي حَدِيثِهِ قَالَ أَخْبَرَنَا ابْنُ أَخِي ابْنِ شِهَابٍ، وَقَالَ أَبُو خَيْثَمَةَ، حَدَّثَنِي عَنْ عَمِّهِ، قَالَ أَخْبَرَنِي صَالِحُ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي فَرْوَةَ، أَنَّ عَامِرَ بْنَ سَعْدِ بْنِ أَبِي وَقَّاصٍ، أَخْبَرَهُ أَنَّهُ، سَمِعَ أَبَانَ بْنَ عُثْمَانَ، يَقُولُ قَالَ عُثْمَانُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ أَرَأَيْتَ لَوْ كَانَ بِفِنَاءِ أَحَدِكُمْ نَهَرٌ يَجْرِي يَغْتَسِلُ مِنْهُ كُلَّ يَوْمٍ خَمْسَ مَرَّاتٍ مَا كَانَ يَبْقَى مِنْ دَرَنِهِ قَالُوا لَا شَيْءَ قَالَ إِنَّ الصَّلَوَاتِ تُذْهِبُ الذُّنُوبَ كَمَا يُذْهِبُ الْمَاءُ الدَّرَنَ‏.‏","english":{"narrator":"Aban bin `Uthman said:","text":"‘Uthman said: I heard the Messenger of Allah (ﷺ) say:  “Do you think if there was a river in the courtyard of one of you and he washed himself in it five times each day, would any dirt remain on him? They said: Nothing [would remain on him). He said: `The (five daily) prayers take away sins as water takes away dirt.`"}},{"id":111,"idInBook":111,"chapterId":4,"bookId":8,"arabic":"قَالَ أَبُو عَبْد الرَّحْمَنِ وَجَدْتُ فِي كِتَابِ أَبِي حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ الْأَسْوَدِ، عَنْ حُصَيْنِ بْنِ عُمَرَ، عَنْ مُخَارِقِ بْنِ عَبْدِ اللَّهِ بْنِ جَابِرٍ الْأَحْمَسِيِّ، عَنْ طَارِقِ بْنِ شِهَابٍ، عَنْ عُثْمَانَ بْنِ عَفَّانَ، قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ غَشَّ الْعَرَبَ لَمْ يَدْخُلْ فِي شَفَاعَتِي وَلَمْ تَنَلْهُ مَوَدَّتِي‏.‏","english":{"narrator":"It was narrated that `Uthman bin, `Affan said:","text":"The Messenger of Allah (ﷺ)  said:   “Whoever betrays the Arabs will never receive my intercession or attain my love.`"}},{"id":112,"idInBook":112,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي عَبَّاسُ بْنُ مُحَمَّدٍ، وَأَبُو يَحْيَى الْبَزَّازُ قَالَا حَدَّثَنَا حَجَّاجُ بْنُ نُصَيْرٍ، حَدَّثَنَا شُعْبَةُ، عَنِ الْعَوَّامِ بْنِ مُرَاجِمٍ، مِنْ بَنِي قَيْسِ بْنِ ثَعْلَبَةَ عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ، عَنْ عُثْمَانَ، أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الْجَمَّاءَ لَتُقَصُّ مِنْ الْقَرْنَاءِ يَوْمَ الْقِيَامَةِ‏.‏","english":{"narrator":"It was narrated from `Uthman that the Messenger of Allah (ﷺ)  said:","text":"`The hornless animal will settle the score with the horned one on the day of Resurrection.`"}},{"id":113,"idInBook":113,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنَا شَيْبَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُبَارَكُ بْنُ فَضَالَةَ، حَدَّثَنَا الْحَسَنُ، قَالَ شَهِدْتُ عُثْمَانَ يَأْمُرُ فِي خُطْبَتِهِ بِقَتْلِ الْكِلَابِ وَذَبْحِ الْحَمَامِ‏.‏","english":{"narrator":"Al Hasan narrated:","text":"I saw `Uthman enjoining, in his khutbah, the killing of dogs and the slaughter of pigeons."}},{"id":114,"idInBook":114,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنْ مُغِيرَةَ، عَنْ أُمِّ مُوسَى، قَالَتْ كَانَ عُثْمَانُ مِنْ أَجْمَلِ النَّاسِ‏.‏","english":{"narrator":"It was narrated that Umm Moosa said:","text":"`Uthman was the most handsome of people."}},{"id":115,"idInBook":115,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، حَدَّثَنِي أَبِي، عَنْ أَبِيهِ، قَالَ كُنْتُ أُصَلِّي فَمَرَّ رَجُلٌ بَيْنَ يَدَيَّ فَمَنَعْتُهُ فَأَبَى فَسَأَلْتُ عُثْمَانَ بْنَ عَفَّانَ فَقَالَ لَا يَضُرُّكَ يَا ابْنَ أَخِي‏.‏","english":{"narrator":"Ibraheem bin Sa`d narrated:","text":"My father narrated that his father said:  I was praying and a man passed in front of me; I tried to stop him but he insisted. I asked `Uthman bin `Affan (about that) and he said. It does not affect you, O son of my brother."}},{"id":116,"idInBook":116,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنَا سُوَيْدٌ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، حَدَّثَنِي أَبِي، عَنْ أَبِيهِ، قَالَ قَالَ عُثْمَانُ إِنْ وَجَدْتُمْ فِي كِتَابِ اللَّهِ عَزَّ وَجَلَّ أَنْ تَضَعُوا رِجْلِي فِي الْقَيْدِ فَضَعُوهَا‏.‏","english":{"narrator":"Ibraheem bin Sa’d narrated:","text":"My father narrated; that his father said: Uthman said: If you find in the Book of Allah, may He be glorified and exalted, that you should put my feet in fetters, then do that."}},{"id":117,"idInBook":117,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ الْبَصْرِيُّ، حَدَّثَنَا الْمُغِيرَةُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ الْمَخْزُومِيُّ، حَدَّثَنِي أَبِي عَبْدُ الرَّحْمَنِ بْنُ الْحَارِثِ، عَنْ زَيْدِ بْنِ عَلِيِّ بْنِ حُسَيْنٍ، عَنْ أَبِيهِ، عَلِيِّ بْنِ حُسَيْنٍ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ، مَوْلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَفَ بِعَرَفَةَ وَهُوَ مُرْدِفٌ أُسَامَةَ بْنَ زَيْدٍ فَقَالَ هَذَا الْمَوْقِفُ وَكُلُّ عَرَفَةَ مَوْقِفٌ ثُمَّ دَفَعَ يَسِيرُ الْعَنَقَ وَجَعَلَ النَّاسُ يَضْرِبُونَ يَمِينًا وَشِمَالًا وَهُوَ يَلْتَفِتُ وَيَقُولُ السَّكِينَةَ أَيُّهَا النَّاسُ السَّكِينَةَ أَيُّهَا النَّاسُ حَتَّى جَاءَ الْمُزْدَلِفَةَ وَجَمَعَ بَيْنَ الصَّلَاتَيْنِ ثُمَّ وَقَفَ بِالْمُزْدَلِفَةِ فَوَقَفَ عَلَى قُزَحَ وَأَرْدَفَ الْفَضْلَ بْنَ الْعَبَّاسِ وَقَالَ هَذَا الْمَوْقِفُ وَكُلُّ مُزْدَلِفَةَ مَوْقِفٌ ثُمَّ دَفَعَ وَجَعَلَ يَسِيرُ الْعَنَقَ وَالنَّاسُ يَضْرِبُونَ يَمِينًا وَشِمَالًا وَهُوَ يَلْتَفِتُ وَيَقُولُ السَّكِينَةَ أَيُّهَا النَّاسُ السَّكِينَةَ وَذَكَرَ الْحَدِيثَ بِطُولِهِ‏.‏","english":{"narrator":"It was narrated from ‘Ubaidullah bin Abi Rafi’, the freed slave of the Messenger of Allah (ﷺ) , from `Ali bin Abi Talib (رضي الله عنه) that  The Messenger of Allah (ﷺ) stood in Arafah with Usamah bin Zaid riding behind him, and said:","text":"`This is the place of standing, and all of `Arafah is a place of standing.` Then he moved on at an unhurried pace, and the people started rushing right and left. He turned to them and said: `Calmly, O people; calmly, O people.” Then he came to al-Muzdalifah and put two prayers together, then he stood in al-Muzdalifah in a place called Quzah, with al-Fadl bin al-`Abbas riding behind him, and he said: “This is the place of standing and all of Muzdalifah is a place of standing.” Then he moved on at an unhurried pace and the people started rushing right and left. He turned to them and said: `Calmly, O people; calmly, O people.” he quoted the hadeeth at length."}},{"id":118,"idInBook":118,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يُونُسُ بْنُ أَبِي الْيَعْفُورِ الْعَبْدِيُّ، عَنْ أَبِيهِ، عَنْ مُسْلِمٍ أَبِي سَعِيدٍ، مَوْلَى عُثْمَانَ بْنِ عَفَّانَ أَنَّ عُثْمَانَ بْنَ عَفَّانَ، أَعْتَقَ عِشْرِينَ مَمْلُوكًا وَدَعَا بِسَرَاوِيلَ فَشَدَّهَا عَلَيْهِ وَلَمْ يَلْبَسْهَا فِي جَاهِلِيَّةٍ وَلَا إِسْلَامٍ وَقَالَ إِنِّي رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْبَارِحَةَ فِي الْمَنَامِ وَرَأَيْتُ أَبَا بَكْرٍ وَعُمَرَ رَضِيَ اللَّهُ عَنْهُمَا وَإِنَّهُمْ قَالُوا لِي اصْبِرْ فَإِنَّكَ تُفْطِرُ عِنْدَنَا الْقَابِلَةَ ثُمَّ دَعَا بِمُصْحَفٍ فَنَشَرَهُ بَيْنَ يَدَيْهِ فَقُتِلَ وَهُوَ بَيْنَ يَدَيْهِ‏.‏","english":{"narrator":"It was narrated from Muslim Abu Sa`eed, the freed slave of `Uthman bin `Affan (رضي الله عنه) that  `Uthman bin `Affan manumitted twenty slaves, and called for some pants and put them on; he had never worn them before, either during the Jahiliyyah or in Islam. And he said:","text":"I saw the Messenger of Allah (ﷺ) in a dream last night, and I saw Abu Bakr and `Umar (رضي الله عنهما) and they said to me, Be patient, for you will break your fast with us tomorrow. Then he called for a Mushaf and opened it, and he was killed with it in front of him."}},{"id":119,"idInBook":119,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ، وَأَبُو الرَّبِيعِ الزَّهْرَانِيُّ، قَالَا حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنِ الْحَجَّاجِ، عَنْ عَطَاءٍ، عَنْ عُثْمَانَ، قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَوَضَّأَ فَغَسَلَ وَجْهَهُ ثَلَاثًا وَيَدَيْهِ ثَلَاثًا وَغَسَلَ ذِرَاعَيْهِ ثَلَاثًا ثَلَاثًا وَمَسَحَ بِرَأْسِهِ وَغَسَلَ رِجْلَيْهِ غَسْلًا‏.‏","english":{"narrator":"It was narrated that `Uthman said:","text":"I saw the Messenger of Allah (ﷺ) do wudoo’: he washed his face three times and his hands three times, and he washed his arms three times each, and wiped his head, and washed his feet thoroughly."}},{"id":120,"idInBook":120,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي مُحَمَّدُ بْنُ إِسْحَاقَ الْمُسَيَّبِيُّ، حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ، عَنْ أَبِي مَوْدُودٍ، عَنْ مُحَمَّدِ بْنِ كَعْبٍ، عَنْ أَبَانَ بْنِ عُثْمَانَ، عَنْ عُثْمَانَ، أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ قَالَ بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ ثَلَاثَ مَرَّاتٍ لَمْ تَفْجَأْهُ فَاجِئَةُ بَلَاءٍ حَتَّى اللَّيْلِ وَمَنْ قَالَهَا حِينَ يُمْسِي لَمْ تَفْجَأْهُ فَاجِئَةُ بَلَاءٍ حَتَّى يُصْبِحَ إِنْ شَاءَ اللَّهُ‏.‏","english":{"narrator":"It was narrated from Aban bin `Uthman, from `Uthman, that  The Prophet (ﷺ) said:","text":"`Whoever says, `In the Name of Allah with Whose name nothing on earth or in heaven can cause harm, and he is the All-Hearing, All-Knowing.` three times, will not be struck unawares by calamity until night comes, and whoever says it in the evening will not be struck unawares by calamity until morning comes, in sha` Allah.”"}},{"id":121,"idInBook":121,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنَا الْحَكَمُ بْنُ مُوسَى، حَدَّثَنَا سَعِيدُ بْنُ مَسْلَمَةَ، عَنْ إِسْمَاعِيلَ بْنِ أُمَيَّةَ، عَنْ مُوسَى بْنِ عِمْرَانَ بْنِ مَنَّاحٍ، عَنْ أَبَانَ بْنِ عُثْمَانَ، أَنَّهُ رَأَى جَنَازَةً مُقْبِلَةً فَلَمَّا رَآهَا قَامَ فَقَالَ رَأَيْتُ عُثْمَانَ يَفْعَلُ ذَلِكَ وَخَبَّرَنِي أَنَّهُ رَأَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَفْعَلُهُ‏.‏","english":{"narrator":"","text":"It was narrated from Aban bin `Uthman that  He saw a funeral coming. When he saw it he stood up and said. I saw `Uthman doing that and he told me that he saw the Prophet (ﷺ) doing that."}},{"id":122,"idInBook":122,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنَا أَبُو إِبْرَاهِيمَ التَّرْجُمَانِيُّ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ، عَنِ ابْنِ أَبِي فَرْوَةَ، عَنْ مُحَمَّدِ بْنِ يُوسُفَ، عَنْ عَمْرِو بْنِ عُثْمَانَ بْنِ عَفَّانَ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الصُّبْحَةُ تَمْنَعُ الرِّزْقَ‏.‏","english":{"narrator":"It was narrated from `Amr bin `Uthman bin `Affan (رضي الله عنه) that his father said:","text":"The Messenger of Allah (ﷺ) said: “Sleeping early in the day leads to withholding of provision.”"}},{"id":123,"idInBook":123,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي سُرَيْجُ بْنُ يُونُسَ، حَدَّثَنَا مَحْبُوبُ بْنُ مُحْرِزٍ، عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ بْنِ فَرُّوخَ، عَنْ أَبِيهِ، قَالَ شَهِدْتُ عُثْمَانَ بْنَ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ دُفِنَ فِي ثِيَابِهِ بِدِمَائِهِ وَلَمْ يُغَسَّلْ‏.‏","english":{"narrator":"It was narrated from Ibraheem` bin `Abdullah bin Farrookh that his father said:","text":"I saw `Uthman bin `Affan (رضي الله عنه) buried in his clothes soaked with his blood. he was not washed."}},{"id":124,"idInBook":124,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي أَبُو يَحْيَى الْبَزَّازُ، مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ حَدَّثَنَا الْحَسَنُ بْنُ بِشْرِ بْنِ سَلْمٍ الْكُوفِيُّ، حَدَّثَنَا الْعَبَّاسُ بْنُ الْفَضْلِ الْأَنْصَارِيُّ، عَنْ هِشَامِ بْنِ زِيَادٍ الْقُرَشِيِّ، عَنْ أَبِيهِ، عَنْ مِحْجَنٍ، مَوْلَى عُثْمَانَ عَنْ عُثْمَانَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ أَظَلَّ اللَّهُ عَبْدًا فِي ظِلِّهِ يَوْمَ لَا ظِلَّ إِلَّا ظِلُّهُ أَنْظَرَ مُعْسِرًا أَوْ تَرَكَ لِغَارِمٍ‏.‏","english":{"narrator":"It was narrated from Mihjan the freed slave of `Uthman, that `Uthman  said:","text":"I heard the Messenger of Allah (ﷺ) say: “Allah will shade with His shade on the Day when there is no shade but His a person who gave more time to a debtor who was in difficulty or waived a debt for one who had a lot of debts.`"}},{"id":125,"idInBook":125,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي يَحْيَى بْنُ عُثْمَانَ يَعْنِي الْحَرْبِيَّ أَبُو زَكَرِيَّا، حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ، عَنْ رَجُلٍ، قَدْ سَمَّاهُ عَنْ مُحَمَّدِ بْنِ يُوسُفَ، عَنْ عَمْرِو بْنِ عُثْمَانَ بْنِ عَفَّانَ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الصُّبْحَةُ تَمْنَعُ الرِّزْقَ‏.‏","english":{"narrator":"It was narrated from ‘Amr bin `Uthman bin `Affan (رضي الله عنه) that his father said:","text":"The Messenger of Allah (ﷺ) said: “Sleeping early in the morning leads to withholding of provision.”"}},{"id":126,"idInBook":126,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ مَالِكٍ، حَدَّثَنِي نَافِعٌ، عَنْ نُبَيْهِ بْنِ وَهْبٍ، عَنْ أَبَانَ بْنِ عُثْمَانَ، عَنْ أَبِيهِ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْمُحْرِمُ لَا يَنْكِحُ وَلَا يُنْكِحُ وَلَا يَخْطُبُ‏.‏","english":{"narrator":"It was narrated from Aban bin `Uthman, from his father, that the Prophet       (ﷺ)said:","text":"“The pilgrim in ihram should not get married, arrange a marriage or propose marriage.`"}},{"id":127,"idInBook":127,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، حَدَّثَنِي نُبَيْهُ بْنُ وَهْبٍ، قَالَ بَعَثَنِي عُمَرُ بْنُ عُبَيْدِ اللَّهِ بْنِ مَعْمَرٍ وَكَانَ يَخْطُبُ بِنْتَ شَيْبَةَ بْنِ عُثْمَانَ عَلَى ابْنِهِ فَأَرْسَلَ إِلَى أَبَانَ بْنِ عُثْمَانَ وَهُوَ عَلَى الْمَوْسِمِ فَقَالَ أَلَا أُرَاهُ أَعْرَابِيًّا إِنَّ الْمُحْرِمَ لَا يَنْكِحُ وَلَا يُنْكِحُ أَخْبَرَنِي بِذَلِكَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ و حَدَّثَنِي نُبَيْهٌ عَنْ أَبِيهِ بِنَحْوِهِ‏.‏","english":{"narrator":"It was narrated from Nafiʼ; Nubaih bin Wahb told me:","text":"`Umar bin Ubaidullah bin Ma’mar proposed marriage on behalf of his son to the daughter of Shaibah bin `Uthman. He sent me to Aban bin `Uthman, who was the leader of the Hajj, and he  said: I think he must be a Bedouin. `The pilgrim in ihram should not get married or arrange a marriage.` ‘Uthman (رضي الله عنه) told me that from the Prophet (ﷺ) , and Nubaih told me something similar from his father."}},{"id":128,"idInBook":128,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي مُحَمَّدُ بْنُ أَبِي بَكْرٍ، حَدَّثَنَا زُهَيْرُ بْنُ إِسْحَاقَ، حَدَّثَنَا دَاوُدُ بْنُ أَبِي هِنْدٍ، عَنْ زِيَادِ بْنِ عَبْدِ اللَّهِ، عَنْ أُمِّ هِلَالٍ ابْنَةِ وَكِيعٍ، عَنْ نَائِلَةَ بِنْتِ الْفَرَافِصَةِ، امْرَأَةِ عُثْمَانَ بْنِ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ قَالَتْ نَعَسَ أَمِيرُ الْمُؤْمِنِينَ عُثْمَانُ فَأَغْفَى فَاسْتَيْقَظَ فَقَالَ لَيَقْتُلَنَّنِي الْقَوْمُ قُلْتُ كَلَّا إِنْ شَاءَ اللَّهُ لَمْ يَبْلُغْ ذَاكَ إِنَّ رَعِيَّتَكَ اسْتَعْتَبُوكَ قَالَ إِنِّي رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي مَنَامِي وَأَبُو بَكْرٍ وَعُمَرُ رَضِيَ اللَّهُ عَنْهُمَا فَقَالُوا تُفْطِرُ عِنْدَنَا اللَّيْلَةَ‏.‏","english":{"narrator":"It was narrated that Na`ilah bint al-Farafisah, the wife of `Uthman bin `Affan  (رضي الله عنه) said:","text":"Ameer al-Mu`mineen, `Uthman felt sleepy and had a brief nap. When he woke up, he said: The people will certainly kill me. I said: No, in sha Allah it will not go that far: your people will only ask you for an explanation. He said: I saw the Messenger of Allah (ﷺ) in my dream, and Abu Bakr and `Umar, (رضي الله عنهما) and they said: You will break your fast with us tonight."}},{"id":129,"idInBook":129,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي زِيَادُ بْنُ أَيُّوبَ، حَدَّثَنَا هُشَيْمٌ، قَالَ زَعَمَ أَبُو الْمِقْدَامِ عَنِ الْحَسَنِ بْنِ أَبِي الْحَسَنِ، قَالَ دَخَلْتُ الْمَسْجِدَ فَإِذَا أَنَا بِعُثْمَانَ بْنِ عَفَّانَ، رَضِيَ اللَّهُ عَنْهُ مُتَّكِئٌ عَلَى رِدَائِهِ فَأَتَاهُ سَقَّاءَانِ يَخْتَصِمَانِ إِلَيْهِ فَقَضَى بَيْنَهُمَا ثُمَّ أَتَيْتُهُ فَنَظَرْتُ إِلَيْهِ فَإِذَا رَجُلٌ حَسَنُ الْوَجْهِ بِوَجْنَتِهِ نَكَتَاتُ جُدَرِيٍّ وَإِذَا شَعْرُهُ قَدْ كَسَا ذِرَاعَيْهِ‏.‏","english":{"narrator":"It was narrated that al-Hasan bin Abil-Hasan said:","text":"l entered the mosque and I saw `Uthman bin `Affan (رضي الله عنه) reclining on his rida`. Two water carriers came to him and he judged between them. Then I came to him and looked at him; he was a handsome man with marks of smallpox on his face and his arms were covered with hair."}},{"id":130,"idInBook":130,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا وَكِيعٌ، حَدَّثَتْنِي أُمُّ غُرَابٍ، عَنْ بُنَانَةَ، قَالَتْ مَا خَضَبَ عُثْمَانُ قَطُّ‏.‏","english":{"narrator":"Umm Ghurab narrated that Bunanah said:","text":"’Uthman never dyed his hair."}},{"id":131,"idInBook":131,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ، حَدَّثَنَا أَبُو الْقَاسِمِ بْنُ أَبِي الزِّنَادِ، حَدَّثَنِي وَاقِدُ بْنُ عَبْدِ اللَّهِ التَّمِيمِيُّ، عَنْ مَنْ، رَأَى عُثْمَانَ بْنَ عَفَّانَ ضَبَّبَ أَسْنَانَهُ بِذَهَبٍ‏.‏","english":{"narrator":"","text":"Waqid bin ‘Abdullah At-Tameemi narrated from someone Who saw ‘Uthman bin ‘Affan (رضي الله عنه) with his teeth covered with gold."}},{"id":132,"idInBook":132,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا هُشَيْمُ بْنُ بُشَيْرٍ، إِمْلَاءً قَالَ أَنْبَأَنَا مُحَمَّدُ بْنُ قَيْسٍ الْأَسَدِيُّ، عَنْ مُوسَى بْنِ طَلْحَةَ، قَالَ سَمِعْتُ عُثْمَانَ بْنَ عَفَّانَ، رَضِيَ اللَّهُ عَنْهُ وَهُوَ عَلَى الْمِنْبَرِ وَالْمُؤَذِّنُ يُقِيمُ الصَّلَاةَ وَهُوَ يَسْتَخْبِرُ النَّاسَ يَسْأَلُهُمْ عَنْ أَخْبَارِهِمْ وَأَسْعَارِهِمْ‏.‏","english":{"narrator":"It was narrated that Moosa bin Talha said:","text":"I Heard ‘Uthman bin ‘Affan (رضي الله عنه) when he was on the minbar and the mu’adhdhin was giving the iqamah (call immediately preceding the prayer), asking the people about their news and business."}},{"id":133,"idInBook":133,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنِ ابْنِ شِهَابٍ، عَنِ السَّائِبِ بْنِ يَزِيدَ، أَنَّ عُثْمَانَ، رَضِيَ اللَّهُ عَنْهُ سَجَدَ فِي ص‏.‏","english":{"narrator":"","text":"It was narrated from as-Sa’ib bin Yazeed that ’Uthman (رضي الله عنه) Prostrated in Soorat Sad"}},{"id":134,"idInBook":134,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي سُرَيْجُ بْنُ يُونُسَ، حَدَّثَنَا مَحْبُوبُ بْنُ مُحْرِزٍ، بَيَّاعُ الْقَوَارِيرِ كُوفِيٌّ ثِقَةٌ كَذَا قَالَ سُرَيْجٌ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ يَعْنِي ابْنَ فَرُّوخَ عَنْ أَبِيهِ قَالَ صَلَّيْتُ خَلْفَ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ الْعِيدَ فَكَبَّرَ سَبْعًا وَخَمْسًا‏.‏","english":{"narrator":"It was narrated from Ibraheem bin ‘Abdullah - i.e. Ibn Farrookh - that his father said:","text":"I offered the Eid prayer behind `Uthman (رضي الله عنه) and he said the takbeer seven times and five times (i.e., in the first and second rak’ahs, respectively)."}},{"id":135,"idInBook":135,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَبْدُ الصَّمَدِ، حَدَّثَنَا سَالِمٌ أَبُو جُمَيْعٍ، حَدَّثَنَا الْحَسَنُ، وَذَكَرَ، عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ وَشِدَّةَ حَيَائِهِ فَقَالَ إِنْ كَانَ لَيَكُونُ فِي الْبَيْتِ وَالْبَابُ عَلَيْهِ مُغْلَقٌ فَمَا يَضَعُ عَنْهُ الثَّوْبَ لِيُفِيضَ عَلَيْهِ الْمَاءَ يَمْنَعُهُ الْحَيَاءُ أَنْ يُقِيمَ صُلْبَهُ‏.‏","english":{"narrator":"Al-Hasan mentioned `Uthman`s extreme shyness and said:","text":"If he was in a room with the door closed, and he took off his garment to pour water on himself, shyness prevented him from standing up straight."}},{"id":136,"idInBook":136,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ خَالِدٍ الصَّنْعَانِيُّ، حَدَّثَنِي أُمَيَّةُ بْنُ شِبْلٍ، وَغَيْرُهُ، قَالُوا وَلِيَ عُثْمَانُ ثِنْتَيْ عَشْرَةَ وَكَانَتْ الْفِتْنَةُ خَمْسَ سِنِينَ‏.‏","english":{"narrator":"Umayyah bin Shibl and others said:","text":"`Uthman held the position of caliph for twelve years and the turmoil lasted for five years."}},{"id":137,"idInBook":137,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا إِسْحَاقُ بْنُ عِيسَى بْنِ الطَّبَّاعِ، عَنْ أَبِي مَعْشَرٍ، قَالَ وَقُتِلَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ يَوْمَ الْجُمُعَةِ لِثَمَانِ عَشْرَةَ مَضَتْ مِنْ ذِي الْحِجَّةِ سَنَةَ خَمْسٍ وَثَلَاثِينَ وَكَانَتْ خِلَافَتُهُ ثِنْتَيْ عَشْرَةَ سَنَةً إِلَّا اثْنَيْ عَشَرَ يَوْمًا‏.‏","english":{"narrator":"It was narrated that Abu Ma`shar said:","text":"`Uthman (رضي الله عنه) was killed on the eighteenth of Dhul-Hijjah 35 AH, His caliphate lasted twelve years less twelve days."}},{"id":138,"idInBook":138,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ، قَالَ قَالَ أَبِي حَدَّثَنَا أَبُو عُثْمَانَ، أَنَّ عُثْمَانَ، رَضِيَ اللَّهُ عَنْهُ قُتِلَ فِي أَوْسَطِ أَيَّامِ التَّشْرِيقِ‏.‏","english":{"narrator":"","text":"Abu `Uthman narrated that ’Uthman (رضي الله عنه) was killed in the middle of the days of al-tashreeq."}},{"id":139,"idInBook":139,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا حَسَنُ بْنُ مُوسَى، حَدَّثَنَا أَبُو هِلَالٍ، حَدَّثَنَا قَتَادَةُ، أَنَّ عُثْمَانَ، قُتِلَ وَهُوَ ابْنُ تِسْعِينَ سَنَةً أَوْ ثَمَانٍ وَثَمَانِينَ‏.‏","english":{"narrator":"","text":"Qatadah narrated that `Uthman (رضي الله عنه) was killed when he was ninety years old or eighty-eight years old."}},{"id":140,"idInBook":140,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي جَعْفَرُ بْنُ مُحَمَّدِ بْنِ فُضَيْلٍ، حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا أَبُو خَلْدَةَ، عَنْ أَبِي الْعَالِيَةِ، قَالَ كُنَّا بِبَابِ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ فِي عَشْرِ الْأَضْحَى‏.‏","english":{"narrator":"lt was narrated that Abul ’Aliyah said:","text":"We were guarding The door of ‘Uthman (رضي الله عنه) for the first ten days of ."}},{"id":141,"idInBook":141,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ قَتَادَةَ، قَالَ صَلَّى الزُّبَيْرُ عَلَى عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ وَدَفَنَهُ وَكَانَ أَوْصَى إِلَيْهِ‏.‏","english":{"narrator":"It was narrated that Qatadah said:","text":"Az-Zubair offered the funeral prayer for `Uthman (رضي الله عنه) and buried him in accordance with his instructions."}},{"id":142,"idInBook":142,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا زَكَرِيَّا بْنُ عَدِيٍّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَمْرٍو، عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ، قَالَ قُتِلَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ سَنَةَ خَمْسٍ وَثَلَاثِينَ فَكَانَتْ الْفِتْنَةُ خَمْسَ سِنِينَ مِنْهَا أَرْبَعَةُ أَشْهُرٍ لِلْحَسَنِ رَضِيَ اللَّهُ عَنْهُ‏.‏","english":{"narrator":"It was narrated that ‘Abdullah bin Muhammad bin `Aqeel said:","text":"`Uthman (رضي الله عنه) was killed in 35 AH and the fitnah (turmoil) lasted for\nfive years including four months of al-Hasan`s rule."}},{"id":143,"idInBook":143,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا أَبُو خَلْدَةَ، عَنْ أَبِي الْعَالِيَةِ، قَالَ كُنَّا بِبَابِ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ فِي عَشْرِ الْأَضْحَى‏.‏","english":{"narrator":"It was narrated that Abul `Aliyah said:","text":"We were guarding the door of `Uthman (رضي الله عنه) for the first ten days of ."}},{"id":144,"idInBook":144,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ، حَدَّثَنِي الْقَاسِمُ بْنُ الْحَكَمِ بْنِ أَوْسٍ الْأَنْصَارِيُّ، حَدَّثَنِي أَبُو عُبَادَةَ الزُّرَقِيُّ الْأَنْصَارِيُّ، مِنْ أَهْلِ الْمَدِينَةِ عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَبِيهِ، قَالَ شَهِدْتُ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ يَوْمَ حُوصِرَ فِي مَوْضِعِ الْجَنَائِزِ وَلَوْ أُلْقِيَ حَجَرٌ لَمْ يَقَعْ إِلَّا عَلَى رَأْسِ رَجُلٍ فَرَأَيْتُ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ أَشْرَفَ مِنْ الْخَوْخَةِ الَّتِي تَلِي مَقَامَ جِبْرِيلَ عَلَيْهِ السَّلَام فَقَالَ أَيُّهَا النَّاسُ أَفِيكُمْ طَلْحَةُ فَسَكَتُوا ثُمَّ قَالَ أَيُّهَا النَّاسُ أَفِيكُمْ طَلْحَةُ فَسَكَتُوا ثُمَّ قَالَ يَا أَيُّهَا النَّاسُ أَفِيكُمْ طَلْحَةُ فَقَامَ طَلْحَةُ بْنُ عُبَيْدِ اللَّهِ فَقَالَ لَهُ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ أَلَا أَرَاكَ هَاهُنَا مَا كُنْتُ أَرَى أَنَّكَ تَكُونُ فِي جَمَاعَةٍ تَسْمَعُ نِدَائِي آخِرَ ثَلَاثِ مَرَّاتٍ ثُمَّ لَا تُجِيبُنِي أَنْشُدُكَ اللَّهَ يَا طَلْحَةُ تَذْكُرُ يَوْمَ كُنْتُ أَنَا وَأَنْتَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي مَوْضِعِ كَذَا وَكَذَا لَيْسَ مَعَهُ أَحَدٌ مِنْ أَصْحَابِهِ غَيْرِي وَغَيْرُكَ قَالَ نَعَمْ فَقَالَ لَكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا طَلْحَةُ إِنَّهُ لَيْسَ مِنْ نَبِيٍّ إِلَّا وَمَعَهُ مِنْ أَصْحَابِهِ رَفِيقٌ مِنْ أُمَّتِهِ مَعَهُ فِي الْجَنَّةِ وَإِنَّ عُثْمَانَ بْنَ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ هَذَا يَعْنِينِي رَفِيقِي مَعِي فِي الْجَنَّةِ قَالَ طَلْحَةُ اللَّهُمَّ نَعَمْ ثُمَّ انْصَرَفَ‏.‏","english":{"narrator":"It was narrated from Zaid bin Aslam that his father said:","text":"I saw `Uthman (رضي الله عنه) on the day he was besieged in the place where funerals were held; if a stone were to be thrown it would not have landed anywhere but on a man`s head. And I saw `Uthman (رضي الله عنه) look out of the window beside the place where Jibreel (عليه السلام) once stood, and he said: O people, is Talhah among you? They kept quiet. Then he said: O people, is Talhah among you? They kept quiet. Then he said: O people, is Talhah among you? Talhah bin `Ubaidullah stood up and ‘Uthman (رضي الله عنه) said to him: Are you there? I did not think that you would be in a group of people, hearing me call you three times and not answering me. I adjure you by Allah, O Talhah, do you remember the day when you and I were with the Messenger of Allah (ﷺ)  in such and such a place, and none of his Companions were with him except you and I. He said: Yes, . Then he went away."}},{"id":145,"idInBook":145,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي الْعَبَّاسُ بْنُ الْوَلِيدِ النَّرْسِيُّ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا سَعِيدٌ، حَدَّثَنَا قَتَادَةُ، عَنْ مُسْلِمِ بْنِ يَسَارٍ، عَنْ حُمْرَانَ بْنِ أَبَانَ، أَنَّهُ شَهِدَ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ تَوَضَّأَ يَوْمًا فَمَضْمَضَ وَاسْتَنْشَقَ وَغَسَلَ وَجْهَهُ ثَلَاثًا وَحَدَّثَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَ حَدِيثِ ابْنِ جَعْفَرٍ عَنْ سَعِيدٍ‏.‏","english":{"narrator":"","text":"It was narrated from Humran bin Aban that He saw `Uthman (رضي الله عنه) do wudoo` one day; he rinsed his mouth and his nose, and he washed his face three times... and he narrated a hadeeth from the Prophet (ﷺ) similar to the hadeeth of Ibn Ja`far from Sa’eed."}},{"id":146,"idInBook":146,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي وَهْبُ بْنُ بَقِيَّةَ الْوَاسِطِيُّ، أَنْبَأَنَا خَالِدٌ يَعْنِي ابْنَ عَبْدِ اللَّهِ، عَنِ الْجُرَيْرِيِّ، عَنْ عُرْوَةَ بْنِ قَبِيصَةَ، عَنْ رَجُلٍ، مِنْ الْأَنْصَارِ عَنْ أَبِيهِ، قَالَ كُنْتُ قَائِمًا عِنْدَ عُثْمَانَ بْنِ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ فَقَالَ أَلَا أُنَبِّئُكُمْ كَيْفَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَوَضَّأُ قُلْنَا بَلَى فَدَعَا بِمَاءٍ فَغَسَلَ وَجْهَهُ ثَلَاثًا وَمَضْمَضَ وَاسْتَنْشَقَ ثَلَاثًا ثُمَّ غَسَلَ يَدَيْهِ إِلَى مِرْفَقَيْهِ ثَلَاثًا ثُمَّ مَسَحَ بِرَأْسِهِ وَأُذُنَيْهِ وَغَسَلَ رِجْلَيْهِ ثَلَاثًا ثُمَّ قَالَ هَكَذَا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَوَضَّأُ‏.‏","english":{"narrator":"It was narrated from one of the Ansar that his father said:","text":"I was standing with ‘Uthman bin `Affan (رضي الله عنه) and he said: Shall I not tell you how the Messenger of Allah (ﷺ)  did wudoo`? We said: Yes indeed. He called for water and washed his face three times, rinsed his mouth and nose three times, then he washed his hands up to the elbow three times, then he wiped his head and his ears, and washed his feet three times. Then he said: This is how the Messenger of Allah (ﷺ)  did wudoo`."}},{"id":147,"idInBook":147,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي مُحَمَّدُ بْنُ أَبِي بَكْرِ بْنِ عَلِيٍّ الْمُقَدَّمِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الْأَنْصَارِيُّ، حَدَّثَنَا هِلَالُ بْنُ حِقٍّ، عَنِ الْجُرَيْرِيِّ، عَنْ ثُمَامَةَ بْنِ حَزْنٍ الْقُشَيْرِيِّ، قَالَ شَهِدْتُ الدَّارَ يَوْمَ أُصِيبَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ فَاطَّلَعَ عَلَيْهِمْ اطِّلَاعَةً فَقَالَ ادْعُوا لِي صَاحِبَيْكُمْ اللَّذَيْنِ أَلَّبَاكُمْ عَلَيَّ فَدُعِيَا لَهُ فَقَالَ نَشَدْتُكُمَا اللَّهَ أَتَعْلَمَانِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا قَدِمَ الْمَدِينَةَ ضَاقَ الْمَسْجِدُ بِأَهْلِهِ فَقَالَ مَنْ يَشْتَرِي هَذِهِ الْبُقْعَةَ مِنْ خَالِصِ مَالِهِ فَيَكُونَ فِيهَا كَالْمُسْلِمِينَ وَلَهُ خَيْرٌ مِنْهَا فِي الْجَنَّةِ فَاشْتَرَيْتُهَا مِنْ خَالِصِ مَالِي فَجَعَلْتُهَا بَيْنَ الْمُسْلِمِينَ وَأَنْتُمْ تَمْنَعُونِي أَنْ أُصَلِّيَ فِيهِ رَكْعَتَيْنِ ثُمَّ قَالَ أَنْشُدُكُمْ اللَّهَ أَتَعْلَمُونَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا قَدِمَ الْمَدِينَةَ لَمْ يَكُنْ فِيهَا بِئْرٌ يُسْتَعْذَبُ مِنْهُ إِلَّا رُومَةَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ يَشْتَرِيهَا مِنْ خَالِصِ مَالِهِ فَيَكُونَ دَلْوُهُ فِيهَا كَدُلِيِّ الْمُسْلِمِينَ وَلَهُ خَيْرٌ مِنْهَا فِي الْجَنَّةِ فَاشْتَرَيْتُهَا مِنْ خَالِصِ مَالِي فَأَنْتُمْ تَمْنَعُونِي أَنْ أَشْرَبَ مِنْهَا ثُمَّ قَالَ هَلْ تَعْلَمُونَ أَنِّي صَاحِبُ جَيْشِ الْعُسْرَةِ قَالُوا اللَّهُمَّ نَعَمْ‏.‏","english":{"narrator":"It was narrated that Thumamah bin Hazn al-Qushairi said:","text":"I was present at the house (of `Uthman) on the day `Uthman (رضي الله عنه) was killed. He looked out at them and said: Call for me your two companions who incited you against me. They were called for him and he said: I adjure you by Allah, do you know that when the Messenger of Allah (ﷺ)  came to Madinah, the mosque got too crowded for its people and he said: “Who will buy this piece of land with his own wealth and use it like the rest of the Muslims (i.e., donate it to the Muslims and share it with them) and he will have something better than it in Paradise?” So I bought it with my own wealth and donated it to the Muslims, but now you are preventing me from praying two rak’ahs in it! Then he said: I adjure you by Allah, do you know that when the Messenger of Allah (ﷺ) came to Madinah, there was no well good for drinking from except (the well of) Roomah. The Messenger of Allah (ﷺ) said: `Who will buy it with his own wealth and his bucket will be like that of the Muslims (i.e., donate the well to the Muslims and share it with them) and he will have something better than it in Paradise.” So I bought it with my own wealth, but now you are preventing me from drinking from it. Then he said: Do you know that I am the one who equipped the army of hardship (i.e., the army that went on the campaign of Tabook)? They said: By Allah, yes."}},{"id":148,"idInBook":148,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي أَبِي وَأَبُو خَيْثَمَةَ قَالَا حَدَّثَنَا مُعَاوِيَةُ بْنُ عَمْرٍو، حَدَّثَنَا زَائِدَةُ، عَنْ عَاصِمٍ، عَنْ شَقِيقٍ، قَالَ لَقِيَ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ الْوَلِيدَ بْنَ عُقْبَةَ فَقَالَ لَهُ الْوَلِيدُ مَا لِي أَرَاكَ قَدْ جَفَوْتَ أَمِيرَ الْمُؤْمِنِينَ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ قَالَ عَبْدُ الرَّحْمَنِ أَبْلِغْهُ فَذَكَرَ الْحَدِيثَ وَأَمَّا قَوْلُهُ إِنِّي تَخَلَّفْتُ يَوْمَ بَدْرٍ فَإِنِّي كُنْتُ أُمَرِّضُ رُقَيَّةَ بِنْتَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى مَاتَتْ وَقَدْ ضَرَبَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِسَهْمٍ وَمَنْ ضَرَبَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِسَهْمٍ فَقَدْ شَهِدَ فَذَكَرَ الْحَدِيثَ بِطُولِهِ إِلَى آخِرِهِ‏.‏","english":{"narrator":"It was narrated that Shaqeeq said:","text":"`Abdur-Rahman bin ‘Awf met al-Waleed bin `Uqbah Al-Waleed said to him: Why do I see you keeping away from Ameer al-Mu`mineen `Uthman (رضي الله عنه)? `AbdurRahman said to him. Tell him that I did not flee on the day of `Ainain - ` Asim said: The day of Uhud - and I did not stay behind on the day of Badr, and I did not turn away from the way of ‘Umar (رضي الله عنه). So he went and told that to `Uthman (رضي الله عنه), who said: As for his saying that he did not flee on the day of `Ainain, how could he shame me for a fault for which Allah has pardoned me and said: `Those of you who turned back on the day the two hosts met (i.e. the battle of Uhud), it was Shaitan (Satan) who caused them to backslide (run away from the battlefield) because of some (sins) they had earned. But Allah, indeed, has forgiven them.` ? As for his saying that I stayed behind on the day of Badr, I was tending Ruqayyah, the daughter of the Messenger of Allah (ﷺ), when she was dying, and the Messenger of Allah (ﷺ)  allocated to me a share (of the booty), and whoever was allocated a share by the Messenger of Allah (ﷺ)  was present.... and he quoted the hadeeth at length to the end."}},{"id":149,"idInBook":149,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا عَبْد اللَّهِ، حَدَّثَنِي سُفْيَانُ بْنُ وَكِيعٍ، حَدَّثَنِي قَبِيصَةُ، عَنْ أَبِي بَكْرِ بْنِ عَيَّاشٍ، عَنْ عَاصِمٍ، عَنْ أَبِي وَائِلٍ، قَالَ قُلْتُ لِعَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ كَيْفَ بَايَعْتُمْ عُثْمَانَ وَتَرَكْتُمْ عَلِيًّا رَضِيَ اللَّهُ عَنْهُ قَالَ مَا ذَنْبِي قَدْ بَدَأْتُ بِعَلِيٍّ فَقُلْتُ أُبَايِعُكَ عَلَى كِتَابِ اللَّهِ وَسُنَّةِ رَسُولِهِ وَسِيرَةِ أَبِي بَكْرٍ وَعُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَ فَقَالَ فِيمَا اسْتَطَعْتُ قَالَ ثُمَّ عَرَضْتُهَا عَلَى عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ فَقَبِلَهَا‏.‏","english":{"narrator":"It was narrated that Abu Wa`il said:","text":"I said to ‘AbdurRahman bin ‘Awf: How could you swear allegiance to ‘Uthman (رضي الله عنه)  and not to `Ali (رضي الله عنه)? He said: It is not my fault. I started with `Ali and said: I swear allegiance to you in accordance with the Book of Allah, the Sunnah of His Messenger, and the way of Abu Bakr and ʼUmar (رضي الله عنهما) . He said: As much as I can. Then I offered it to `Uthman (رضي الله عنه) and he accepted it."}},{"id":150,"idInBook":150,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ، حَدَّثَنَا لَيْثٌ، حَدَّثَنَا زُهْرَةُ بْنُ مَعْبَدٍ الْقُرَشِيُّ، عَنْ أَبِي صَالِحٍ، مَوْلَى عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ قَالَ سَمِعْتُ عُثْمَانَ يَقُولُ عَلَى الْمِنْبَرِ أَيُّهَا النَّاسُ إِنِّي كَتَمْتُكُمْ حَدِيثًا سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَرَاهِيَةَ تَفَرُّقِكُمْ عَنِّي ثُمَّ بَدَا لِي أَنْ أُحَدِّثَكُمُوهُ لِيَخْتَارَ امْرُؤٌ لِنَفْسِهِ مَا بَدَا لَهُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ رِبَاطُ يَوْمٍ فِي سَبِيلِ اللَّهِ خَيْرٌ مِنْ أَلْفِ يَوْمٍ فِيمَا سِوَاهُ مِنْ الْمَنَازِلِ\nحَدَّثَنَا أَبُو سَعِيدٍ مَوْلَى بَنِي هَاشِمٍ حَدَّثَنَا عِكْرِمَةُ بْنُ إِبْرَاهِيمَ بَاهِلِيٌّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ أَبِي ذُبَابٍ وَذَكَرَهُ‏.‏","english":{"narrator":"It was narrated that Abu Salih, the freed slave of `Uthman bin `Affan (رضي الله عنه) said:","text":"I heard `Uthman (رضي الله عنه) say on the minbar: O people, I concealed from you a hadeeth that I heard from the Messenger of Allah (ﷺ)  for fear that you would scatter away from me, then I thought that I should tell it to you, and let each one choose for himself what he thinks is best. I heard the Messenger of Allah (ﷺ) say: `Guarding the border for one day for the sake of Allah is better than a thousand other days doing other deeds.”\n\n`Abdullah bin ‘Abdur-Rahman bin Abi Dhubab narrated... A similar hadeeth]"}},{"id":151,"idInBook":151,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا أَبُو سَعِيدٍ، حَدَّثَنَا ابْنُ لَهِيعَةَ، أَخْبَرَنَا مُوسَى بْنُ وَرْدَانَ، قَالَ سَمِعْتُ سَعِيدَ بْنَ الْمُسَيَّبِ، يَقُولُ سَمِعْتُ عُثْمَانَ، يَخْطُبُ عَلَى الْمِنْبَرِ وَهُوَ يَقُولُ كُنْتُ أَبْتَاعُ التَّمْرَ مِنْ بَطْنٍ مِنْ الْيَهُودِ يُقَالُ لَهُمْ بَنُو قَيْنُقَاعٍ فَأَبِيعُهُ بِرِبْحِ الْآصُعِ فَبَلَغَ ذَلِكَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا عُثْمَانُ إِذَا اشْتَرَيْتَ فَاكْتَلْ وَإِذَا بِعْتَ فَكِلْ‏.‏","english":{"narrator":"Sa`eed bin al-Musayyab said:","text":"I heard ‘Uthman (رضي الله عنه) delivering a khutbah from the minbar. He said: I used to buy dates from one of the Jewish clans who were called Banu Qainuqa`, and sell them at a profit. News of that reached the Messenger of Allah (ﷺ) who said: `O `Uthman, when you buy, take your dues with nothing extra, and when you sell, give (the other party`s) dues with nothing less.`"}},{"id":152,"idInBook":152,"chapterId":4,"bookId":8,"arabic":"حَدَّثَنَا بِشْرُ بْنُ شُعَيْبِ بْنِ أَبِي حَمْزَةَ، حَدَّثَنِي أَبِي، عَنِ الزُّهْرِيِّ، حَدَّثَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عُبَيْدَ اللَّهِ بْنَ عَدِيِّ بْنِ الْخِيَارِ، أَخْبَرَهُ أَنَّ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ قَالَ لَهُ إِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَهُ إِنَّ اللَّهَ قَدْ بَعَثَ مُحَمَّدًا عَلَيْهِ الصَّلَاة وَالسَّلَامُ بِالْحَقِّ فَكُنْتُ مِمَّنْ اسْتَجَابَ لِلَّهِ وَلِرَسُولِهِ وَآمَنَ بِمَا بَعَثَ بِهِ مُحَمَّدًا عَلَيْهِ الصَّلَاة وَالسَّلَامُ ثُمَّ هَاجَرْتُ الْهِجْرَتَيْنِ وَنِلْتُ صِهْرَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَبَايَعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَوَاللَّهِ مَا عَصَيْتُهُ وَلَا غَشَشْتُهُ حَتَّى تَوَفَّاهُ اللَّهُ عَزَّ وَجَلَّ‏.‏","english":{"narrator":"`Ubaidullah bin `Adiyy bin al-Khiyar narrated that `Uthman (رضي الله عنه) said to him:","text":"Verily Allah, may He be glorified and exalted, sent Muhammad (ﷺ) with the truth and I was one of those who responded to (the call of) Allah and His Messenger, and I believed in that with which Muhammad (ﷺ) was sent. Then I migrated twice, and I also attained the honour of becoming the son-in-law of the Messenger of Allah (ﷺ); I swore allegiance to the Messenger of Allah (ﷺ), and by Allah, I never disobeyed him or betrayed him until Allah, may He be glorified and exalted, took his soul in death."}}],"chapter":{"id":4,"bookId":8,"arabic":"مُسْنَدُ عُثْمَانَ بْنِ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ","english":"Musnad Uthman ibn Affan"}}