{"metadata":{"length":9,"arabic":{"title":"الأدب المفرد","author":"الإمام محمد بن إسماعيل البخاري","introduction":"كتاب الرعاية"},"english":{"title":"Al-Adab Al-Mufrad","author":"Imam Muhammad ibn Ismail al-Bukhari","introduction":"Supervision"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":10,"bookId":15,"arabic":"حَدَّثَنَا عَارِمٌ، قَالَ‏:‏ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ قَالَ‏:‏ قَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ كُلُّكُمْ رَاعٍ، وَكُلُّكُمْ مَسْؤولٌ عَنْ رَعِيَّتِهِ، فَالأَمِيرُ رَاعٍ وَهُوَ مَسْؤُولٌ، وَالرَّجُلُ رَاعٍ عَلَى أَهْلِهِ وَهُوَ مَسْؤُولٌ، وَالْمَرْأَةُ رَاعِيَةٌ عَلَى بَيْتِ زَوْجِهَا وَهِيَ مَسْؤُولَةٌ، أَلاَ وَكُلُّكُمْ رَاعٍ، وَكُلُّكُمْ مَسْؤُولٌ عَنْ رَعِيَّتِهِ‏.‏","english":{"narrator":"","text":"Ibn 'Umar reported that the Prophet, may Allah bless him and grant\nhim peace, \"All of you are shepherds and each of you is responsible for\nhis flock. A man is the shepherd of the people of his house and he is responsible.\nA woman is the shepherd of the house of her husband and she is responsible.\nEach of you is a shepherd and each is responsible for his flock.\""}},{"id":2,"idInBook":2,"chapterId":10,"bookId":15,"arabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ‏:‏ حَدَّثَنَا إِسْمَاعِيلُ، قَالَ‏:‏ حَدَّثَنَا أَيُّوبُ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَبِي سُلَيْمَانَ مَالِكِ بْنِ الْحُوَيْرِثِ قَالَ‏:‏ أَتَيْنَا النَّبِيَّ صلى الله عليه وسلم وَنَحْنُ شَبَبَةٌ مُتَقَارِبُونَ، فَأَقَمْنَا عِنْدَهُ عِشْرِينَ لَيْلَةً، فَظَنَّ أَنَّا اشْتَهَيْنَا أَهْلِينَا، فَسَأَلْنَا عَنْ مَنْ تَرَكْنَا فِي أَهْلِينَا‏؟‏ فَأَخْبَرْنَاهُ، وَكَانَ رَفِيقًا رَحِيمًا، فَقَالَ‏:‏ ارْجِعُوا إِلَى أَهْلِيكُمْ فَعَلِّمُوهُمْ وَمُرُوهُمْ، وَصَلُّوا كَمَا رَأَيْتُمُونِي أُصَلِّي، فَإِذَا حَضَرَتِ الصَّلاَةُ، فَلْيُؤَذِّنْ لَكُمْ أَحَدُكُمْ، وَلْيَؤُمَّكُمْ أَكْبَرُكُمْ‏.‏","english":{"narrator":"Abu Sulayman Malik ibn al-Huwayrith said, \"We came to the Prophet,\nmay Allah bless him and grant him peace, being young men of a similar age.\nWe spent twenty nights with him. He thought that we desired our own people\nand he asked us about those of our family we had left behind, and we told\nhim. He was merciful and kind, and said, 'Go back to your family. Instruct\nand command them. Pray as you have seen me praying. When it is time for\nthe prayer, then let one of you give the adhan and let the oldest of you\nlead the payer.;:","text":""}},{"id":3,"idInBook":3,"chapterId":10,"bookId":15,"arabic":"حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ‏:‏ أَخْبَرَنَا شُعَيْبُ بْنُ أَبِي حَمْزَةَ، عَنِ الزُّهْرِيِّ، قَالَ‏:‏ أَخْبَرَنَا سَالِمٌ، عَنِ ابْنِ عُمَرَ، أَنَّهُ سَمِعَ رَسُولَ اللهِ صلى الله عليه وسلم يَقُولُ‏:‏ كُلُّكُمْ رَاعٍ، وَكُلُّكُمْ مَسْؤُولٌ عَنْ رَعِيَّتِهِ، الإِمَامُ رَاعٍ وَهُوَ مَسْؤُولٌ عَنْ رَعِيَّتِهِ، وَالرَّجُلُ رَاعٍ فِي أَهْلِهِ، وَالْمَرْأَةُ رَاعِيَةٌ فِي بَيْتِ زَوْجِهَا، وَالْخَادِمُ فِي مَالِ سَيِّدِهِ، سَمِعْتُ هَؤُلاَءِ عَنِ النَّبِيِّ صلى الله عليه وسلم، وَأَحْسَبُ النَّبِيَّ صلى الله عليه وسلم قَالَ‏:‏ وَالرَّجُلُ فِي مَالِ أَبِيهِ‏.‏","english":{"narrator":"","text":"Ibn 'Umar reported that he heard the Messenger of Allah, may Allah\nbless him and grant him peace, say, \"All of you are shepherds and each\nof you is responsible for his flock. A woman is the shepherd of the house\nof her husband and she is responsible as is the servant in regard to his\nmaster's property.\""}},{"id":4,"idInBook":4,"chapterId":10,"bookId":15,"arabic":"حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ قَالَ‏:‏ حَدَّثَنِي يَحْيَى بْنُ أَيُّوبَ، عَنْ عُمَارَةَ بْنِ غَزِيَّةَ، عَنْ شُرَحْبِيلَ مَوْلَى الأَنْصَارِ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ الأَنْصَارِيِّ قَالَ‏:‏ قَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ مَنْ صُنِعَ إِلَيْهِ مَعْرُوفٌ فَلْيُجْزِئْهُ، فَإِنْ لَمْ يَجِدْ مَا يُجْزِئُهُ فَلْيُثْنِ عَلَيْهِ، فَإِنَّهُ إِذَا أَثْنَى فَقَدْ شَكَرَهُ، وَإِنْ كَتَمَهُ فَقَدْ كَفَرَهُ، وَمَنْ تَحَلَّى بِمَا لَمْ يُعْطَ، فَكَأَنَّمَا لَبِسَ ثَوْبَيْ زُورٍ‏.‏","english":{"narrator":"","text":"Jabir ibn 'Abdullah al-Ansari reported that the Prophet, may Allah\nbless him and grant him peace, said, \"Whoever has a favour done for him\nshould repay it. If he cannot find anything he can use to repay it, he\nshould praise the one who did it. When he praises him, he thanks him. If\nhe is silent, he is ungrateful to him. If someone adorns himself with something\nhe has not been given, it is as if he was wearing a false garment.\""}},{"id":5,"idInBook":5,"chapterId":10,"bookId":15,"arabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ‏:‏ حَدَّثَنَا أَبُو عَوَانَةَ، عَنِ الأَعْمَشِ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عُمَرَ قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ مَنِ اسْتَعَاذَ بِاللَّهِ فَأَعِيذُوهُ، وَمَنْ سَأَلَ بِاللَّهِ فَأَعْطُوهُ، وَمَنْ أَتَى إِلَيْكُمْ مَعْرُوفًا فَكَافِئُوهُ، فَإِنْ لَمْ تَجِدُوا فَادْعُوا لَهُ، حَتَّى يَعْلَمَ أَنْ قَدْ كَافَأْتُمُوهُ‏.‏","english":{"narrator":"","text":"Ibn 'Umar reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"Anyone who seeks refuge in Allah will find\nrefuge with Him. Anyone who asks from Allah will be receive. Anyone who\ndoes a favour should repay it. If you do not find anything, then make supplication\nfor the doer of the favour so that he knows that you have repaid him.\""}},{"id":6,"idInBook":6,"chapterId":10,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ‏:‏ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، أَنَّ الْمُهَاجِرِينَ قَالُوا‏:‏ يَا رَسُولَ اللهِ، ذَهَبَ الأَنْصَارُ بِالأَجْرِ كُلِّهِ‏؟‏ قَالَ‏:‏ لاَ، مَا دَعَوْتُمُ اللَّهَ لَهُمْ، وَأَثْنَيْتُمْ عَلَيْهِمْ بِهِ‏.‏","english":{"narrator":"","text":"Anas reported that the Muhajirun said, \"Messenger of Allah, the\nAnsar have taken all the reward!\" He said, \"No, not as long as you make\nsupplication for them and praise them for it.\""}},{"id":7,"idInBook":7,"chapterId":10,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ‏:‏ حَدَّثَنَا الرَّبِيعُ بْنُ مُسْلِمٍ، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ زِيَادٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ لاَ يَشْكُرُ اللَّهَ مَنْ لاَ يَشْكُرُ النَّاسَ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and grant him peace, said, \"He who does not thank people does not thank Allah.\""}},{"id":8,"idInBook":8,"chapterId":10,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ‏:‏ حَدَّثَنَا الرَّبِيعُ بْنُ مُسْلِمٍ، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ زِيَادٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ قَالَ اللَّهُ تَعَالَى لِلنَّفَسِ‏:‏ اخْرُجِي، قَالَتْ‏:‏ لاَ أَخْرُجُ إِلاَّ كَارِهَةً‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"Allah ta'ala said to the self, 'Go forth.' It replied,\n'I only go forth reluctantly.'\""}},{"id":9,"idInBook":9,"chapterId":10,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ بْنُ أُوَيْسٍ قَالَ‏:‏ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ أَبِي الزِّنَادِ، عَنْ أَبِيهِ، عَنْ عُرْوَةَ، عَنْ أَبِي مُرَاوِحٍ، عَنْ أَبِي ذَرٍّ، عَنِ النَّبِيِّ صلى الله عليه وسلم، قِيلَ‏:‏ أَيُّ الأَعْمَالِ خَيْرٌ‏؟‏ قَالَ‏:‏ إِيمَانٌ بِاللَّهِ، وَجِهَادٌ فِي سَبِيلِهِ، قِيلَ‏:‏ فَأَيُّ الرِّقَابِ أَفْضَلُ‏؟‏ قَالَ‏:‏ أَغْلاَهَا ثَمَنًا، وَأَنْفَسُهَا عِنْدَ أَهْلِهَا، قَالَ‏:‏ أَفَرَأَيْتَ إِنْ لَمْ أَسْتَطِعْ بَعْضَ الْعَمَلِ‏؟‏ قَالَ‏:‏ فَتُعِينُ ضَائِعًا، أَوْ تَصْنَعُ لأَخْرَقَ، قَالَ‏:‏ أَفَرَأَيْتَ إِنْ ضَعُفْتُ‏؟‏ قَالَ‏:‏ تَدَعُ النَّاسَ مِنَ الشَّرِّ، فَإِنَّهَا صَدَقَةٌ تَصَدَّقُ بِهَا عَلَى نَفْسِكَ‏.‏","english":{"narrator":"","text":"Abu Dharr reported that the Prophet, may Allah bless him and grant\nhim peace, was asked, \"What action is best?\" He replied, \"Belief in Allah\nand jihad in His way.\" He was asked, \"Which slaves are best?\" He replied,\n\"The highest in price and most precious to their people.\" He said, \"What\ndo you think I should do if I am unable to fight?\" He replied, \"Help someone\nin trouble or work for someone who does not work.\" He asked, \"What do you\nthink that I should do if I am too weak (to act accordingly)?\" He replied,\n\"Spare people your evil. That is a sadaqa which you bestow on yourself.\""}}],"chapter":{"id":10,"bookId":15,"arabic":"كتاب الرعاية","english":"Supervision"}}