{"metadata":{"length":18,"arabic":{"title":"الأدب المفرد","author":"الإمام محمد بن إسماعيل البخاري","introduction":"كتاب الِانْبِسَاطِ إِلَى النَّاسِ"},"english":{"title":"Al-Adab Al-Mufrad","author":"Imam Muhammad ibn Ismail al-Bukhari","introduction":"Cheerfulness Towards People"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":12,"bookId":15,"arabic":"حَدَّثَنَا أَصْبَغُ قَالَ‏:‏ أَخْبَرَنِي ابْنُ وَهْبٍ قَالَ‏:‏ أَخْبَرَنِي خَالِدُ بْنُ حُمَيْدٍ، عَنْ خَالِدِ بْنِ يَزِيدَ، عَنْ سُلَيْمَانَ بْنِ رَاشِدٍ، عَنْ عَبْدِ اللهِ بْنِ رَافِعٍ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ الْمُؤْمِنُ مَرْآةُ أَخِيهِ، إِذَا رَأَى فِيهَا عَيْبًا أَصْلَحَهُ‏.‏","english":{"narrator":"","text":"Abu Hurayra said, \"A believer is the mirror of his brother. When\nhe sees a fault in it, he should correct it.\""}},{"id":2,"idInBook":2,"chapterId":12,"bookId":15,"arabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ حَمْزَةَ، قَالَ‏:‏ حَدَّثَنَا ابْنُ أَبِي حَازِمٍ، عَنْ كَثِيرِ بْنِ زَيْدٍ، عَنِ الْوَلِيدِ بْنِ رَبَاحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ الْمُؤْمِنُ مَرْآةُ أَخِيهِ، وَالْمُؤْمِنُ أَخُو الْمُؤْمِنِ، يَكُفُّ عَلَيْهِ ضَيْعَتَهُ، وَيَحُوطُهُ مِنْ وَرَائِهِ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"A believer is the mirror of his brother. A believer\nis the brother of another believer. He protects him against loss and defends\nhim behind his back.\""}},{"id":3,"idInBook":3,"chapterId":12,"bookId":15,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ عَاصِمٍ قَالَ‏:‏ حَدَّثَنِي حَيْوَةُ، قَالَ‏:‏ حَدَّثَنَا بَقِيَّةُ، عَنِ ابْنِ ثَوْبَانَ، عَنْ أَبِيهِ، عَنْ مَكْحُولٍ، عَنْ وَقَّاصِ بْنِ رَبِيعَةَ، عَنِ الْمُسْتَوْرِدِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ مَنْ أَكَلَ بِمُسْلِمٍ أُكْلَةً، فَإِنَّ اللَّهَ يُطْعِمُهُ مِثْلَهَا مِنْ جَهَنَّمَ، وَمَنْ كُسِيَ بِرَجُلٍ مُسْلِمٍ فَإِنَّ اللَّهَ عَزَّ وَجَلَّ يَكْسُوهُ مِنْ جَهَنَّمَ، وَمَنْ قَامَ بِرَجُلٍ مَقَامَ رِيَاءٍ وَسُمْعَةٍ فَإِنَّ اللَّهَ يَقُومُ بِهِ مَقَامَ رِيَاءٍ وَسُمْعَةٍ يَوْمَ الْقِيَامَةِ‏.‏","english":{"narrator":"","text":"Al-Mustawrid reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"If anyone eats a meal at the expense of a Muslim's\nhonour, Allah will feed him a like amount of Hellfire. If anyone clothes\nhimself with a garment at the expense of a Muslim's honour, Allah will\nclothe him with a like amount of Hellfire. If anyone achieves a position\nof showing-off and hypocrisy at the expense of a Muslim's honour, Allah\nwill put him in a position of showing-off and hypocrisy on the Day of Rising."}},{"id":4,"idInBook":4,"chapterId":12,"bookId":15,"arabic":"حَدَّثَنَا عَاصِمُ بْنُ عَلِيٍّ، قَالَ‏:‏ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنْ عَبْدِ اللهِ بْنِ السَّائِبِ، عَنْ أَبِيهِ، عَنْ جَدِّهِ قَالَ‏:‏ سَمِعْتُ رَسُولَ اللهِ صلى الله عليه وسلم، يَعْنِي، يَقُولُ‏:‏ لاَ يَأْخُذُ أَحَدُكُمْ مَتَاعَ صَاحِبِهِ لاَعِبًا وَلاَ جَادًّا، فَإِذَا أَخَذَ أَحَدُكُمْ عَصَا صَاحِبِهِ فَلْيَرُدَّهَا إِلَيْهِ‏.‏","english":{"narrator":"","text":"'Abdullah ibn as-Sa'ib reported that his grandfather said, \"I heard\nthe Messenger of Allah, may Allah bless him and grant him peace, say, 'None\nof you should take the goods of his companion, either in jest or seriously.\nWhen one of you takes his companion's staff, he should return it to him.'\""}},{"id":5,"idInBook":5,"chapterId":12,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، قَالَ‏:‏ أَخْبَرَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ أَبِي عَمْرٍو الشَّيْبَانِيِّ، عَنْ أَبِي مَسْعُودٍ الأَنْصَارِيِّ قَالَ‏:‏ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ‏:‏ إِنِّي أُبْدِعَ بِي فَاحْمِلْنِي، قَالَ‏:‏ لاَ أَجِدُ، وَلَكِنِ ائْتِ فُلاَنًا، فَلَعَلَّهُ أَنْ يَحْمِلَكَ، فَأَتَاهُ فَحَمَلَهُ، فَأَتَى النَّبِيَّ صلى الله عليه وسلم فَأَخْبَرَهُ، فَقَالَ‏:‏ مَنْ دَلَّ عَلَى خَيْرٍ فَلَهُ مِثْلُ أَجْرِ فَاعِلِهِ‏.‏","english":{"narrator":"","text":"Abu Mas'ud al-Ansari said, \"A man came to the Prophet, may Allah\nbless him and grant him peace, and said, 'My camel has become exhausted,\nso give me a mount.' He replied, 'I do not have any. But go to so-and-so\nand perhaps he will give you one.' He went to that man and he gave him\na mount. Then he went back to the Prophet, may Allah bless him and grant\nhim peace, and told him. He said, 'Whoever guides to good has the like\nof the reward of the person who actually does it.'\""}},{"id":6,"idInBook":6,"chapterId":12,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ عَبْدِ الْوَهَّابِ، قَالَ‏:‏ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، عَنْ هِشَامِ بْنِ زَيْدٍ، عَنْ أَنَسٍ، أَنَّ يَهُودِيَّةً أَتَتِ النَّبِيَّ صلى الله عليه وسلم بِشَاةٍ مَسْمُومَةٍ، فَأَكَلَ مِنْهَا، فَجِيءَ بِهَا، فَقِيلَ‏:‏ أَلاَ نَقْتُلُهَا‏؟‏ قَالَ‏:‏ لاَ، قَالَ‏:‏ فَمَا زِلْتُ أَعْرِفُهَا فِي لَهَوَاتِ رَسُولِ اللهِ صلى الله عليه وسلم‏.‏","english":{"narrator":"","text":"Anas reported that a Jewish woman brought the Prophet, may Allah\nbless him and grant him peace, poisoned sheep. He ate from it and she was\nbrought. It was asked, \"Should we not kill her?\" \"No,\" he replied."}},{"id":7,"idInBook":7,"chapterId":12,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلامٍ، قَالَ‏:‏ حَدَّثَنَا أَبُو مُعَاوِيَةَ، قَالَ‏:‏ حَدَّثَنَا هِشَامٌ، عَنْ وَهْبِ بْنِ كَيْسَانَ قَالَ‏:‏ سَمِعْتُ عَبْدَ اللهِ بْنَ الزُّبَيْرِ يَقُولُ عَلَى الْمِنْبَرِ‏:‏ ‏{‏خُذِ الْعَفْوَ‏}‏ وَأْمُرْ بِالْعُرْفِ وَأَعْرِضْ عَنِ الْجَاهِلِينَ، قَالَ‏:‏ وَاللَّهِ مَا أَمَرَ بِهَا أَنْ تُؤْخَذَ إِلاَّ مِنْ أَخْلاَقِ النَّاسِ، وَاللَّهِ لَآخُذَنَّهَا مِنْهُمْ مَا صَحِبْتُهُمْ‏.‏","english":{"narrator":"","text":"'Abdullah ibn az-Zubayr said on the minbar, \"Make allowances\nfor people and command what is right and turn away from the ignorant.\"\n(7:199) He said, \"By Allah, we are only commanded by this ayat to accept\npeople's character. By Allah, I will accept people's character as long\nas I am with them.\""}},{"id":8,"idInBook":8,"chapterId":12,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلامٍ، قَالَ‏:‏ أَخْبَرَنَا مُحَمَّدُ بْنُ فُضَيْلِ بْنِ غَزْوَانَ، عَنْ لَيْثٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ عَلِّمُوا وَيَسِّرُوا وَلاَ تُعَسِّرُوا، وَإِذَا غَضِبَ أَحَدُكُمْ فَلْيَسْكُتْ‏.‏","english":{"narrator":"","text":"Ibn 'Abbas reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"Teach and make things easy and not difficult.\nWhen one of you is angry, he should be silent.\""}},{"id":9,"idInBook":9,"chapterId":12,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سِنَانٍ، قَالَ‏:‏ حَدَّثَنَا فُلَيْحُ بْنُ سُلَيْمَانَ، قَالَ‏:‏ حَدَّثَنَا هِلاَلُ بْنُ عَلِيٍّ، عَنْ عَطَاءِ بْنِ يَسَارٍ قَالَ‏:‏ لَقِيتُ عَبْدَ اللهِ بْنَ عَمْرِو بْنِ الْعَاصِ فَقُلْتُ‏:‏ أَخْبِرْنِي عَنْ صِفَةِ رَسُولِ اللهِ صلى الله عليه وسلم فِي التَّوْرَاةِ، قَالَ‏:‏ فَقَالَ‏:‏ أَجَلْ وَاللَّهِ، إِنَّهُ لَمَوْصُوفٌ فِي التَّوْرَاةِ بِبَعْضِ صِفَتِهِ فِي الْقُرْآنِ‏:‏ ‏{‏يَا أَيُّهَا النَّبِيُّ إِنَّا أَرْسَلْنَاكَ شَاهِدًا وَمُبَشِّرًا وَنَذِيرًا‏}‏، وَحِرْزًا لِلأُمِّيِّينَ، أَنْتَ عَبْدِي وَرَسُولِي، سَمَّيْتُكَ الْمُتَوَكِّلَ، لَيْسَ بِفَظٍّ وَلاَ غَلِيظٍ، وَلاَ صَخَّابٍ فِي الأَسْوَاقِ، وَلاَ يَدْفَعُ بِالسَّيِّئَةِ السَّيِّئَةَ، وَلَكِنْ يَعْفُو وَيَغْفِرُ، وَلَنْ يَقْبِضَهُ اللَّهُ تَعَالَى حَتَّى يُقِيمَ بِهِ الْمِلَّةَ الْعَوْجَاءَ، بِأَنْ يَقُولُوا‏:‏ لاَ إِلَهَ إِلاَّ اللَّهُ، وَيَفْتَحُوا بِهَا أَعْيُنًا عُمْيًا، وَآذَانًا صُمًّا، وَقُلُوبًا غُلْفًا‏.‏","english":{"narrator":"'Ata' ibn Yasar said, \"I met 'Abdullah ibn 'Amr ibn al-'As and\nI said, 'Tell me about the description of the Messenger of Allah, may Allah\nbless him and grant him peace, in the Torah.' 'Yes,' he said, 'By Allah,\nhe is described in the Torah partly as he is described in the Qur'an:","text":"\"O\nProphet, We have sent you as a witness, a bearer of good news and a warner\nand a protection to the unlettered. You are My slave and Messenger. I have\ncalled you the trusty one who is neither coarse nor harsh nor loud in the\nmarkets. Allah Almighty will not take him until He has made the crooked\ncommunity straight by him so that they say, \"There is no god but Allah,\"\nand by it they will open blind eyes, deaf ears and covered hearts.'\""}},{"id":10,"idInBook":10,"chapterId":12,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ صَالِحٍ قَالَ‏:‏ حَدَّثَنِي عَبْدُ الْعَزِيزِ بْنُ أَبِي سَلَمَةَ، عَنْ هِلاَلِ بْنِ أَبِي هِلاَلٍ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ عَبْدِ اللهِ بْنِ عَمْرٍو قَالَ‏:‏ إِنَّ هَذِهِ الْآيَةَ الَّتِي فِي الْقُرْآنِ ‏{‏يَا أَيُّهَا النَّبِيُّ إِنَّا أَرْسَلْنَاكَ شَاهِدًا وَمُبَشِّرًا وَنَذِيرًا‏}‏ فِي التَّوْرَاةِ نَحْوَهُ‏.‏","english":{"narrator":"","text":"'Abdullah ibn 'Ata' said, \"This ayat which is in the Qur'an,\n'O Prophet, We have sent you as a witness, a bringer of good news and a\nwarner' (33:45) is found in the Torah in a similar form.\""}},{"id":11,"idInBook":11,"chapterId":12,"bookId":15,"arabic":"حَدَّثَنَا إِسْحَاقُ بْنُ الْعَلاَءِ، قَالَ‏:‏ حَدَّثَنَا عَمْرُو بْنُ الْحَارِثِ قَالَ‏:‏ حَدَّثَنِي عَبْدُ اللهِ بْنُ سَالِمٍ الأَشْعَرِيُّ، عَنْ مُحَمَّدٍ هُوَ ابْنُ الْوَلِيدِ الزُّبَيْدِيُّ، عَنِ ابْنِ جَابِرٍ وَهُوَ يَحْيَى بْنُ جَابِرٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرِ بْنِ نُفَيْرٍ حَدَّثَهُ، أَنَّ أَبَاهُ حَدَّثَهُ، أَنَّهُ سَمِعَ مُعَاوِيَةَ يَقُولُ‏:‏ سَمِعْتُ مِنَ النَّبِيِّ صلى الله عليه وسلم كَلاَمًا نَفَعَنِي اللَّهُ بِهِ، سَمِعْتُهُ يَقُولُ، أَوْ قَالَ‏:‏ سَمِعْتُ رَسُولَ اللهِ صلى الله عليه وسلم يَقُولُ‏:‏ إِنَّكَ إِذَا اتَّبَعْتَ الرِّيبَةَ فِي النَّاسِ أَفْسَدْتَهُمْ فَإِنِّي لاَ أَتَّبِعُ الرِّيبَةَ فِيهِمْ فَأُفْسِدَهُمْ‏.‏","english":{"narrator":"","text":"Mu'awiya said, \"I heard some words from the Prophet, may Allah\nbless him and grant him peace, by which Allah helped me.\" Jubayr ibn Nufayr\nsaid, \"I heard him say that he heard the Messenger of Allah, may Allah\nbless him and grant him peace, say, \"If you openly show your suspicions\nof people, you will corrupt them.' Therefore I do not show my suspicions\nof people openly so that I will not corrupt them.\""}},{"id":12,"idInBook":12,"chapterId":12,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدِ اللهِ، قَالَ‏:‏ حَدَّثَنَا حَاتِمٌ، عَنْ مُعَاوِيَةَ بْنِ أَبِي مُزَرِّدٍ، عَنْ أَبِيهِ قَالَ‏:‏ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُ‏:‏ سَمِعَ أُذُنَايَ هَاتَانِ، وَبَصُرَ عَيْنَايَ هَاتَانِ رَسُولَ اللهِ صلى الله عليه وسلم أَخَذَ بِيَدَيْهِ جَمِيعًا بِكَفَّيِّ الْحَسَنِ، أَوِ الْحُسَيْنِ صَلَوَاتُ اللهِ عَلَيْهِمَا وَقَدَمَيهِ عَلَى قَدَمِ رَسُولِ اللهِ صلى الله عليه وسلم، وَرَسُولُ اللهِ صلى الله عليه وسلم يَقُولُ‏:‏ ارْقَهْ، قَالَ‏:‏ فَرَقِيَ الْغُلاَمُ حَتَّى وَضَعَ قَدَمَيْهِ عَلَى صَدْرِ رَسُولِ اللهِ صلى الله عليه وسلم، ثُمَّ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ افْتَحْ فَاكَ، ثُمَّ قَبَّلَهُ، ثُمَّ قَالَ‏:‏ اللَّهُمَّ أَحِبَّهُ، فَإِنِّي أُحِبُّهُ‏.‏","english":{"narrator":"","text":"Abu Hurayra said, \"These two ears of mine have heard and these\ntwo eyes of mine have seen the Messenger of Allah, may Allah bless him\nand grant him peace, take the palms of al-Hasan - or al-Husayn -\nin both his hands. His feet were on the feet of the Messenger of Allah,\nmay Allah bless him and grant him peace. The Messenger of Allah, may Allah\nbless him and grant him peace, said, 'Climb up.' The boy climbed until\nhis feet reached the chest of the Messenger of Allah, may Allah bless him\nand grant him peace, and then the Messenger of Allah, may Allah bless him\nand grant him peace, said, 'Open your mouth.' Then he kissed him and said,\n'O Allah, love him for I love him!'\""}},{"id":13,"idInBook":13,"chapterId":12,"bookId":15,"arabic":"حَدَّثَنِا عَلِيُّ بْنُ عَبْدِ اللهِ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنْ إِسْمَاعِيلَ، عَنْ قَيْسٍ قَالَ‏:‏ سَمِعْتُ جَرِيرًا يَقُولُ‏:‏ مَا رَآنِي رَسُولُ اللهِ صلى الله عليه وسلم مُنْذُ أَسْلَمْتُ إِلاَّ تَبَسَّمَ فِي وَجْهِي، وَقَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ يَدْخُلُ مِنْ هَذَا الْبَابِ رَجُلٌ مِنْ خَيْرِ ذِي يَمَنٍ، عَلَى وَجْهِهِ مَسْحَةُ مَلَكٍ، فَدَخَلَ جَرِيرٌ‏.‏","english":{"narrator":"","text":"Jarir said, \"Since the time I became Muslim, the Messenger of Allah,\nmay Allah bless him and grant him peace, never saw me without smiling at\nme.\" The Messenger of Allah, may Allah bless him and grant him peace, said,\n\"A man from the best of Dhu Yaman will enter by this door whose face has\nbeen touched by an angel.\" Then Jarir came in."}},{"id":14,"idInBook":14,"chapterId":12,"bookId":15,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ عِيسَى، قَالَ‏:‏ حَدَّثَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، قَالَ‏:‏ أَخْبَرَنَا عَمْرُو بْنُ الْحَارِثِ، أَنَّ أَبَا النَّضْرِ حَدَّثَهُ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم قَالَتْ‏:‏ مَا رَأَيْتُ رَسُولَ اللهِ صلى الله عليه وسلم ضَاحِكًا قَطُّ حَتَّى أَرَى مِنْهُ لَهَوَاتِهِ، إِنَّمَا كَانَ يَتَبَسَّمُ صلى الله عليه وسلم، قَالَتْ‏:‏ وَكَانَ إِذَا رَأَى غَيْمًا أَوْ رِيحًا عُرِفَ فِي وَجْهِهِ، فَقَالَتْ‏:‏ يَا رَسُولَ اللهِ، إِنَّ النَّاسَ إِذَا رَأَوُا الْغَيْمَ فَرِحُوا، رَجَاءَ أَنْ يَكُونَ فِيهِ الْمَطَرُ، وَأَرَاكَ إِذَا رَأَيْتَهُ عُرِفَتْ فِي وَجْهِكَ الْكَرَاهَةُ‏؟‏ فَقَالَ‏:‏ يَا عَائِشَةُ، مَا يُؤْمِنِّي أَنْ يَكُونَ فِيهِ عَذَابٌ‏؟‏ عُذِّبَ قَوْمٌ بِالرِّيحِ، وَقَدْ رَأَى قَوْمٌ الْعَذَابَ مِنْهُ فَقَالُوا‏:‏ ‏{‏هَذَا عَارِضٌ مُمْطِرُنَا‏}‏‏.‏","english":{"narrator":"","text":"'A'isha said, \"I never saw the Prophet, may Allah bless him and\ngrant him peace, laugh until I could see his uvula. He used to smile, may\nAllah bless him and grant him peace.\" She said, \"When he saw a cloud or\nwind, distress could be seen in his face.\" She said, \"Messenger of Allah,\nwhen people see a cloud, they rejoice, hoping that there will be rain in\nit. Yet when you see it, I see distress in your face.\" He replied, \"'A'isha,\nwhat will assure me that there is no painful punishment in it? People have\nbeen punished by wind. Some people saw the punishment and stated, 'This\nis a rain cloud coming to us.'\""}},{"id":15,"idInBook":15,"chapterId":12,"bookId":15,"arabic":"حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ أَبُو الرَّبِيعِ، قَالَ‏:‏ حَدَّثَنَا إِسْمَاعِيلُ بْنُ زَكَرِيَّا، قَالَ‏:‏ حَدَّثَنَا أَبُو رَجَاءٍ، عَنْ بُرْدٍ، عَنْ مَكْحُولٍ، عَنْ وَاثِلَةَ بْنِ الأَسْقَعِ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ قَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ أَقِلَّ الضَّحِكَ، فَإِنَّ كَثْرَةَ الضَّحِكِ تُمِيتُ الْقَلْبَ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"Laugh little. Much laughter kills the heart.\""}},{"id":16,"idInBook":16,"chapterId":12,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ‏:‏ حَدَّثَنَا أَبُو بَكْرٍ الْحَنَفِيُّ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ، عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ اللهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ لاَ تُكْثِرُوا الضَّحِكَ، فَإِنَّ كَثْرَةَ الضَّحِكِ تُمِيتُ الْقَلْبَ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"Do not laugh a lot. Much laughter kills the heart.\""}},{"id":17,"idInBook":17,"chapterId":12,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى، قَالَ‏:‏ حَدَّثَنَا الرَّبِيعُ بْنُ مُسْلِمٍ، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ زِيَادٍ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ خَرَجَ النَّبِيُّ صلى الله عليه وسلم عَلَى رَهْطٍ مِنْ أَصْحَابِهِ يَضْحَكُونَ وَيَتَحَدَّثُونَ، فَقَالَ‏:‏ وَالَّذِي نَفْسِي بِيَدِهِ، لَوْ تَعْلَمُونَ مَا أَعْلَمُ لَضَحِكْتُمْ قَلِيلاً، وَلَبَكَيْتُمْ كَثِيرًا، ثُمَّ انْصَرَفَ وَأَبْكَى الْقَوْمَ، وَأَوْحَى اللَّهُ عَزَّ وَجَلَّ إِلَيْهِ‏:‏ يَا مُحَمَّدُ، لِمَ تُقَنِّطُ عِبَادِي‏؟‏، فَرَجَعَ النَّبِيُّ صلى الله عليه وسلم فَقَالَ‏:‏ أَبْشِرُوا، وَسَدِّدُوا، وَقَارِبُوا‏.‏","english":{"narrator":"","text":"Abu Hurayra said, \"The Prophet, may Allah bless him and grant him\npeace, went out to a group of his Companions who were laughing and talking.\nHe said, 'By the One in whose hand my soul is, if you knew what I knew,\nyou would laugh little and weep much.' Then he left and the people were\nweeping. Then Allah Almighty revealed to him, 'Muhammad! Why did you make\nMy slaves despair?' The Prophet, may Allah bless him and grant him peace,\nsaid, \"Give good news, guide people and draw near to one another.'\""}},{"id":18,"idInBook":18,"chapterId":12,"bookId":15,"arabic":"حَدَّثَنَا بِشْرُ بْنُ مُحَمَّدٍ، قَالَ‏:‏ أَخْبَرَنَا عَبْدُ اللهِ، قَالَ‏:‏ أَخْبَرَنَا أُسَامَةُ بْنُ زَيْدٍ قَالَ‏:‏ أَخْبَرَنِي مُوسَى بْنُ مُسْلِمٍ مَوْلَى ابْنَةِ قَارِظٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ رُبَّمَا حَدَّثَ عَنِ النَّبِيِّ صلى الله عليه وسلم، فَيَقُولُ‏:‏ حَدَّثَنِيهِ أَهْدَبُ الشُّفْرَيْنِ، أَبْيَضُ الْكَشْحَيْنِ، إِذَا أَقْبَلَ أَقْبَلَ جَمِيعًا، وَإِذَا أَدْبَرَ، أَدْبَرَ جَمِيعًا، لَمْ تَرَ عَيْنٌ مِثْلَهُ، وَلَنْ تَرَاهُ‏.‏","english":{"narrator":"","text":"Abu Hurayra said, \"When he faced someone, he faced him completely.\nWhen he turned away, he turned away completely. I have never seen anyone\nlike him and I will never see anyone like them.\""}}],"chapter":{"id":12,"bookId":15,"arabic":"كتاب الِانْبِسَاطِ إِلَى النَّاسِ","english":"Cheerfulness Towards People"}}