{"metadata":{"length":4,"arabic":{"title":"الأدب المفرد","author":"الإمام محمد بن إسماعيل البخاري","introduction":"كتاب الْمَشُورَةِ"},"english":{"title":"Al-Adab Al-Mufrad","author":"Imam Muhammad ibn Ismail al-Bukhari","introduction":"Consultation"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":13,"bookId":15,"arabic":"حَدَّثَنَا آدَمُ، قَالَ‏:‏ حَدَّثَنَا شَيْبَانُ أَبُو مُعَاوِيَةَ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ عُمَيْرٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ قَالَ النَّبِيُّ صلى الله عليه وسلم لأَبِي الْهَيْثَمِ‏:‏ هَلْ لَكَ خَادِمٌ‏؟‏ قَالَ‏:‏ لاَ، قَالَ‏:‏ فَإِذَا أَتَانَا سَبْيٌ فَأْتِنَا فَأُتِيَ النَّبِيُّ صلى الله عليه وسلم بِرَأْسَيْنِ لَيْسَ مَعَهُمَا ثَالِثٌ، فَأَتَاهُ أَبُو الْهَيْثَمِ، قَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ اخْتَرْ مِنْهُمَا، قَالَ‏:‏ يَا رَسُولَ اللهِ، اخْتَرْ لِي، فَقَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ إِنَّ الْمُسْتَشَارَ مُؤْتَمَنٌ، خُذْ هَذَا، فَإِنِّي رَأَيْتُهُ يُصَلِّي، وَاسْتَوْصِ بِهِ خَيْرًا، فَقَالَتِ امْرَأَتُهُ‏:‏ مَا أَنْتَ بِبَالِغٍ مَا قَالَ فِيهِ النَّبِيُّ صلى الله عليه وسلم إِلاَّ أَنْ تُعْتِقَهُ، قَالَ‏:‏ فَهُوَ عَتِيقٌ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ إِنَّ اللَّهَ لَمْ يَبْعَثْ نَبِيًّا وَلاَ خَلِيفَةً، إِلاَّ وَلَهُ بِطَانَتَانِ‏:‏ بِطَانَةٌ تَأْمُرُهُ بِالْمَعْرُوفِ وَتَنْهَاهُ عَنِ الْمُنْكَرِ، وَبِطَانَةٌ لاَ تَأْلُوهُ خَبَالاً، وَمَنْ يُوقَ بِطَانَةَ السُّوءِ فَقَدْ وُقِيَ‏.‏","english":{"narrator":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, asked Abu'l-Haytham:","text":"\"Do you have a servant?\" \"No,\" he\nreplied. He said, \"Come to us when we get some captives.\" The Prophet,\nmay Allah bless him and grant him peace, was brought only two captives.\nAbu'l-Haytham came to him and the Prophet, may Allah bless him and grant\nhim peace, said, \"Choose between them.\" \"Choose for me, Messenger of Allah,\"\nhe replied. The Prophet, may Allah bless him and grant him peace, said,\n\"The person who is consulted is in a position of trust. Take this one.\nI have seen him pray. Treat him well.\" Abu'l-Haytham's wife said, \"You\nwill not live up to the words of the Prophet, may Allah bless him and grant\nhim peace, about him until you set him free.\" \"He is free,\" he stated.\nThe Prophet, may Allah bless him and grant him peace, said, \"Allah did not send a Prophet or khalifa but that he has two confidants: a confidant who commands him to do what is correct and forbids what is bad, and a confidant who will not fall short in corrupting you. Anyone who is protected from the evil confidant has been protected.\""}},{"id":2,"idInBook":2,"chapterId":13,"bookId":15,"arabic":"حَدَّثَنَا صَدَقَةُ، قَالَ‏:‏ أَخْبَرَنَا ابْنُ عُيَيْنَةَ، عَنْ عُمَرَ بْنِ حَبِيبٍ، عَنْ عَمْرِو بْنِ دِينَارٍ قَالَ‏:‏ قَرَأَ ابْنُ عَبَّاسٍ‏:‏ وَشَاوِرْهُمْ فِي بَعْضِ الامْرِ‏.‏","english":{"narrator":"","text":"'Amir ibn Dinar said, \"Ibn 'Abbas recited (this ayat), 'Consult\nwith them about the matter.' (3:159)\""}},{"id":3,"idInBook":3,"chapterId":13,"bookId":15,"arabic":"حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ، قَالَ‏:‏ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنِ السَّرِيِّ، عَنِ الْحَسَنِ قَالَ‏:‏ وَاللَّهِ مَا اسْتَشَارَ قَوْمٌ قَطُّ إِلاَّ هُدُوا لأَفْضَلِ مَا بِحَضْرَتِهِمْ، ثُمَّ تَلاَ‏:‏ ‏{‏وَأَمْرُهُمْ شُورَى بَيْنَهُمْ‏}‏‏.‏","english":{"narrator":"","text":"Al-Hasan said, \"People never seek advice without being guided to\nthe best possibility available to them.\" Then he recited, \"and manage their\naffairs by mutual consultation.\" (42:38)"}},{"id":4,"idInBook":4,"chapterId":13,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ يَزِيدَ قَالَ‏:‏ حَدَّثَنِي سَعِيدُ بْنُ أَبِي أَيُّوبَ قَالَ‏:‏ حَدَّثَنِي بَكْرُ بْنُ عَمْرٍو، عَنْ أَبِي عُثْمَانَ مُسْلِمِ بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ قَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ مَنْ تَقَوَّلَ عَلَيَّ مَا لَمْ أَقُلْ، فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنَ النَّارِ وَمَنِ اسْتَشَارَهُ أَخُوهُ الْمُسْلِمُ، فَأَشَارَ عَلَيْهِ بِغَيْرِ رُشْدٍ فَقَدْ خَانَهُ وَمَنْ أُفْتِيَ فُتْيَا بِغَيْرِ ثَبْتٍ، فَإِثْمُهُ عَلَى مَنْ أَفْتَاهُ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"Anyone who attributes words to me which I did not\nsay should take his seat in the Fire. Anyone who gives his Muslim brother\nmisguided advice when they consult him has betrayed them. If anyone gives a fatwa\nwhich is not firm, the wrong action of that rests on the one who gave the\nfatwa.\""}}],"chapter":{"id":13,"bookId":15,"arabic":"كتاب الْمَشُورَةِ","english":"Consultation"}}