{"metadata":{"length":50,"arabic":{"title":"الأدب المفرد","author":"الإمام محمد بن إسماعيل البخاري","introduction":"كتاب حسن الخلق"},"english":{"title":"Al-Adab Al-Mufrad","author":"Imam Muhammad ibn Ismail al-Bukhari","introduction":"Excellence in Character"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":14,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ قَالَ‏:‏ حَدَّثَنِي أَخِي، عَنْ سُلَيْمَانَ بْنِ بِلاَلٍ، عَنْ إِبْرَاهِيمَ بْنِ أَبِي أُسَيْدٍ، عَنْ جَدِّهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ وَالَّذِي نَفْسِي بِيَدِهِ، لاَ تَدْخُلُوا الْجَنَّةَ حَتَّى تُسْلِمُوا، وَلاَ تُسْلِمُوا حَتَّى تَحَابُّوا، وَأَفْشُوا السَّلاَمَ تَحَابُّوا، وَإِيَّاكُمْ وَالْبُغْضَةَ، فَإِنَّهَا هِيَ الْحَالِقَةُ، لاَ أَقُولُ لَكُمْ‏:‏ تَحْلِقُ الشَّعْرَ، وَلَكِنْ تَحْلِقُ الدِّينَ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him\nand grant him peace, said, \"By the One in Whose Hand my soul is, you will not enter Paradise until you submit to Islam. And, you will not submit to Islam until you love one another.\nExtend the greeting to one another and you will love one another. Beware\nof hatred, for it is the razor. I do not tell you that it shaves the hair,\nbut it shaves away the deen.\""}},{"id":2,"idInBook":2,"chapterId":14,"bookId":15,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ عَاصِمٍ، قَالَ‏:‏ حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ قَالَ‏:‏ حَدَّثَنِي ابْنُ وَهْبٍ، عَنْ حَيْوَةَ بْنِ شُرَيْحٍ، عَنْ دَرَّاجٍ، عَنْ عِيسَى بْنِ هِلاَلٍ الصَّدَفِيِّ، عَنْ عَبْدِ اللهِ بْنِ عَمْرِو بْنِ الْعَاصِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ إِنَّ رُوحَ الْمُؤْمِنَيْنِ لَيَلْتَقِيَانِ فِي مَسِيرَةِ يَوْمٍ، وَمَا رَأَى أَحَدُهُمَا صَاحِبَهُ‏.‏","english":{"narrator":"","text":"'Abdullah ibn 'Amr ibn al-'As reported that the Prophet, may Allah bless him\nand grant him peace, said, \"The souls of two believers should\nmeet in the course of a day even if they do not actually see each other.\""}},{"id":3,"idInBook":3,"chapterId":14,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنْ إِبْرَاهِيمَ بْنِ مَيْسَرَةَ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ قَالَ‏:‏ النِّعَمُ تُكْفَرُ، وَالرَّحِمُ تُقْطَعُ، وَلَمْ نَرَ مِثْلَ تَقَارُبِ الْقُلُوبِ‏.‏","english":{"narrator":"Ibn `Abbas said:","text":"The favors are not recognized, (the familial ties of) the womb are severed, and we have not seen the like of the closeness of the hearts."}},{"id":4,"idInBook":4,"chapterId":14,"bookId":15,"arabic":"حَدَّثَنَا فَرْوَةُ بْنُ أَبِي الْمَغْرَاءِ، قَالَ‏:‏ حَدَّثَنَا الْقَاسِمُ بْنُ مَالِكٍ، عَنْ عَبْدِ اللهِ بْنِ عَوْنٍ، عَنْ عُمَيْرِ بْنِ إِسْحَاقَ قَالَ‏:‏ كُنَّا نَتَحَدَّثُ‏:‏ إِنَّ أَوَّلَ مَا يُرْفَعُ مِنَ النَّاسِ الأُلْفَةُ‏.‏","english":{"narrator":"","text":"'Umayr ibn Ishaq said, \"We used to say that the first thing to\nbe removed from people would be friendship.\""}},{"id":5,"idInBook":5,"chapterId":14,"bookId":15,"arabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ‏:‏ حَدَّثَنَا إِسْمَاعِيلُ، قَالَ‏:‏ حَدَّثَنَا أَيُّوبُ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ‏:‏ أَتَى النَّبِيُّ صلى الله عليه وسلم عَلَى بَعْضِ نِسَائِهِ وَمَعَهُنَّ أُمُّ سُلَيْمٍ، فَقَالَ‏:‏ يَا أَنْجَشَةُ، رُوَيْدًا سَوْقَكَ بِالْقَوَارِيرِ‏.‏","english":{"narrator":"","text":"Anas ibn Malik said, \"The Messenger of Allah, may Allah bless him\nand grant him peace, came upon a group of women which included Umm Sulaym.\nHe said, 'Anjasha!* Be gentle when you drive the glass vessels!\""}},{"id":6,"idInBook":6,"chapterId":14,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ صَالِحٍ قَالَ‏:‏ حَدَّثَنِي اللَّيْثُ قَالَ‏:‏ حَدَّثَنِي ابْنُ عَجْلاَنَ، عَنْ أَبِيهِ أَوْ سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ، قَالُوا‏:‏ يَا رَسُولَ اللهِ، إِنَّكَ تُدَاعِبُنَا‏؟‏ قَالَ‏:‏ إِنِّي لاَ أَقُولُ إِلا حَقًّا‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the people said, \"Messenger of Allah,\nyou joke with us!\" He replied, \"But I only speak the truth.\""}},{"id":7,"idInBook":7,"chapterId":14,"bookId":15,"arabic":"حَدَّثَنَا صَدَقَةُ، قَالَ‏:‏ أَخْبَرَنَا مُعْتَمِرٌ، عَنْ حَبِيبٍ أَبِي مُحَمَّدٍ، عَنْ بَكْرِ بْنِ عَبْدِ اللهِ قَالَ‏:‏ كَانَ أَصْحَابُ النَّبِيِّ صلى الله عليه وسلم يَتَبَادَحُونَ بِالْبِطِّيخِ، فَإِذَا كَانَتِ الْحَقَائِقُ كَانُوا هُمُ الرِّجَالَ‏.‏","english":{"narrator":"","text":"Bakr ibn 'Abdullah reported that the Companions of the Prophet,\nmay Allah bless him and grant him peace, used to throw melons at one another.\nHe said, \"If these were real, they would be men.\""}},{"id":8,"idInBook":8,"chapterId":14,"bookId":15,"arabic":"حَدَّثَنَا بِشْرُ بْنُ مُحَمَّدٍ، قَالَ‏:‏ أَخْبَرَنَا عَبْدُ اللهِ، قَالَ‏:‏ أَخْبَرَنَا عُمَرُ بْنُ سَعِيدِ بْنِ أَبِي حُسَيْنٍ، عَنِ ابْنِ أَبِي مُلَيْكَةَ قَالَ‏:‏ مَزَحَتْ عَائِشَةُ عِنْدَ رَسُولِ اللهِ صلى الله عليه وسلم، فَقَالَتْ أُمُّهَا‏:‏ يَا رَسُولَ اللهِ، بَعْضُ دُعَابَاتِ هَذَا الْحَيِّ مِنْ كِنَانَةَ، قَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ بَلْ بَعْضُ مَزْحِنَا هَذَا الْحَيُّ‏.‏","english":{"narrator":"","text":"Ibn Abi Mulayka said, \"'A'isha was joking with the Messenger of\nAllah, may Allah bless him and grant him peace. Her slave girl said, 'Messenger\nof Allah, some of the women who make jokes in this quarter are from Kinana!'\nThe Prophet, may Allah bless him and grant him peace, said, 'Rather some\nof our jokesters in this quarter.'\""}},{"id":9,"idInBook":9,"chapterId":14,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ حَدَّثَنَا خَالِدٌ هُوَ ابْنُ عَبْدِ اللهِ، عَنْ حُمَيْدٍ الطَّوِيلِ، عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ‏:‏ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صلى الله عليه وسلم يَسْتَحْمِلُهُ، فَقَالَ‏:‏ أَنَا حَامِلُكَ عَلَى وَلَدِ نَاقَةٍ، قَالَ‏:‏ يَا رَسُولَ اللهِ، وَمَا أَصْنَعُ بِوَلَدِ نَاقَةٍ‏؟‏ فَقَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ وَهَلْ تَلِدُ الإِبِلَ إِلاَّ النُّوقُ‏.‏","english":{"narrator":"","text":"Anas ibn Malik said, \"A man came to the Prophet, may Allah bless\nhim and grant him peace, to ask him for a mount. He said, 'I will give\nyou a she-camel's foal to ride.' He exclaimed, 'Messenger of Allah, what\ncan I do with a she-camel's foal?' The Messenger of Allah, may Allah bless\nhim and grant him peace, said, 'Are camels born from anything other than\nshe-camels?'\""}},{"id":10,"idInBook":10,"chapterId":14,"bookId":15,"arabic":"حَدَّثَنَا آدَمُ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، قَالَ‏:‏ حَدَّثَنَا أَبُو التَّيَّاحِ قَالَ‏:‏ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ يَقُولُ‏:‏ كَانَ النَّبِيُّ صلى الله عليه وسلم لَيُخَالِطُنَا، حَتَّى يَقُولَ لأَخٍ لِي صَغِيرٍ‏:‏ يَا أَبَا عُمَيْرٍ، مَا فَعَلَ النُّغَيْرُ‏؟‏‏.‏","english":{"narrator":"","text":"Anas ibn Malik said, \"The Prophet, may Allah bless him and grant\nhim peace, used to mix with us to the extent of asking a younger brother\nof mine, 'Abu 'Umayr! What has happened to the little sparrow?'\""}},{"id":11,"idInBook":11,"chapterId":14,"bookId":15,"arabic":"حَدَّثَنَا ابْنُ سَلامٍ، قَالَ‏:‏ حَدَّثَنَا وَكِيعٌ، عَنْ مُعَاوِيَةَ بْنِ أَبِي مُزَرِّدٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ‏:‏ أَخَذَ النَّبِيُّ صلى الله عليه وسلم بِيَدِ الْحَسَنِ أَوِ الْحُسَيْنِ رَضِيَ اللَّهُ عَنْهُمَا، ثُمَّ وَضَعَ قَدَمَيْهِ عَلَى قَدَمَيْهِ، ثُمَّ قَالَ‏:‏ تَرَقَّ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, took al-Hasan or al-Husayn by the hand and then\nput his feet on top of his own feet and said, \"Climb up.\""}},{"id":12,"idInBook":12,"chapterId":14,"bookId":15,"arabic":"حَدَّثَنَا أَبُو الوَلِيدِ قَالَ : حَدَّثَنَا شُعْبَةُ، عَنِ الْقَاسِمِ بْنِ أَبِي بَزَّةَ،قَالَ  سَمِعْتُ عَطَاءٍ الْكَيْخَارَانِيِّ، عَنْ أُمِّ الدَّرْدَاءِ، عَنْ أَبِي الدَّرْدَاءِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \n\" مَا مِنْ شَىْءٍ أَثْقَلُ فِي الْمِيزَانِ مِنْ حُسْنِ الْخُلُقِ\"‏","english":{"narrator":"","text":"Abu Ad-Darda' reported that the Prophet (ﷺ) said, \"Nothing is heavier on the scale than good character.\""}},{"id":13,"idInBook":13,"chapterId":14,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنْ مَسْرُوقٍ، عَنْ عَبْدِ اللهِ بْنِ عَمْرٍو قَالَ‏:‏ لَمْ يَكُنِ النَّبِيُّ صلى الله عليه وسلم فَاحِشًا وَلاَ مُتَفَحِّشًا، وَكَانَ يَقُولُ‏:‏ خِيَارُكُمْ أَحَاسِنُكُمْ أَخْلاَقًا‏.‏","english":{"narrator":"","text":"'Abdullah ibn 'Amr said, \"The Prophet, may Allah bless him and\ngrant him peace, was neither coarse nor loud. He used to say, \"The best\nof you is the one who has the best character.\""}},{"id":14,"idInBook":14,"chapterId":14,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ صَالِحٍ قَالَ‏:‏ حَدَّثَنِي اللَّيْثُ قَالَ‏:‏ حَدَّثَنِي يَزِيدُ بْنُ الْهَادِ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّهُ سَمِعَ النَّبِيَّ صلى الله عليه وسلم يَقُولُ‏:‏ أُخْبِرُكُمْ بِأَحَبِّكُمْ إِلَيَّ، وَأَقْرَبِكُمْ مِنِّي مَجْلِسًا يَوْمَ الْقِيَامَةِ‏؟‏ فَسَكَتَ الْقَوْمُ، فَأَعَادَهَا مَرَّتَيْنِ أَوْ ثَلاَثًا، قَالَ الْقَوْمُ‏:‏ نَعَمْ يَا رَسُولَ اللهِ، قَالَ‏:‏ أَحْسَنُكُمْ خُلُقًا‏.‏","english":{"narrator":"","text":"'Amr ibn Shu'ayb reported from his grandfather that the Prophet,\nmay Allah bless him and grant him peace, said, \"Shall I tell you about\nwho is most beloved to me and the one who will be seated closest to\nme on the Day of Judgment?\" The people were silent, so he repeated that two\nor three times. Then the people said, \"Yes, O Messenger of Allah.\" He said,\n\"The one among you with the best character.\""}},{"id":15,"idInBook":15,"chapterId":14,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ قَالَ‏:‏ حَدَّثَنِي عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، عَنْ مُحَمَّدِ بْنِ عَجْلاَنَ، عَنِ الْقَعْقَاعِ بْنِ حَكِيمٍ، عَنْ أَبِي صَالِحٍ السَّمَّانِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم قَالَ‏:‏ إِنَّمَا بُعِثْتُ لِأُتَمِّمَ صَالِحَ الأَخْلاقِ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"I was sent to perfect good character.\""}},{"id":16,"idInBook":16,"chapterId":14,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ قَالَ‏:‏ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا أَنَّهَا قَالَتْ‏:‏ مَا خُيِّرَ رَسُولُ اللهِ صلى الله عليه وسلم بَيْنَ أَمْرَيْنِ إِلاَّ اخْتَارَ أَيْسَرَهُمَا، مَا لَمْ يَكُنْ إِثْمًا، فَإِذَا كَانَ إِثْمًا كَانَ أَبْعَدَ النَّاسِ مِنْهُ، وَمَا انْتَقَمَ رَسُولُ اللهِ صلى الله عليه وسلم لِنَفْسِهِ، إِلاَّ أَنْ تُنْتَهَكَ حُرْمَةُ اللهِ تَعَالَى، فَيَنْتَقِمُ لِلَّهِ عَزَّ وَجَلَّ بِهَا‏.‏","english":{"narrator":"","text":"'A'isha said, \"The Messenger of Allah, may Allah bless him and\ngrant him peace, was never given a choice between two things but that he\nchose the easier of the two as long as it was not a wrong action. If it\nwas a wrong action, then he was the last person to do it. The Messenger\nof Allah, may Allah bless him and grant him peace, never took revenge on\nhis own behalf. But when the respect of Allah Almighty was violated, he\nwould take revenge on behalf of Allah Almighty.\""}},{"id":17,"idInBook":17,"chapterId":14,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، قَالَ‏:‏ أَخْبَرَنَا سُفْيَانُ، عَنْ زُبَيْدٍ، عَنْ مُرَّةَ، عَنْ عَبْدِ اللهِ قَالَ‏:‏ إِنَّ اللَّهَ تَعَالَى قَسَمَ بَيْنَكُمْ أَخْلاَقَكُمْ، كَمَا قَسَمَ بَيْنَكُمْ أَرْزَاقَكُمْ، وَإِنَّ اللَّهَ تَعَالَى يُعْطِي الْمَالَ مَنْ أَحَبَّ وَمَنْ لاَ يُحِبُّ، وَلاَ يُعْطِي الإِيمَانَ إِلاَّ مَنْ يُحِبُّ، فَمَنْ ضَنَّ بِالْمَالِ أَنْ يُنْفِقَهُ، وَخَافَ الْعَدُوَّ أَنْ يُجَاهِدَهُ، وَهَابَ اللَّيْلَ أَنْ يُكَابِدَهُ، فَلْيُكْثِرْ مِنْ قَوْلِ‏:‏ لاَ إِلَهَ إِلاَّ اللَّهُ، وَسُبْحَانَ اللهِ، وَالْحَمْدُ لِلَّهِ، وَاللَّهُ أَكْبَرُ‏.‏","english":{"narrator":"","text":"'Abdullah said, \"Allah Almighty allotted character between\nyou as He divided provision between you. Allah Almighty bestows wealth\non those He loves and those He does not love. He only bestows faith upon those who\nHe loves. Whoever is stingy about spending his wealth, fears to fight\nthe enemy, and is terrified of enduring the night should frequently repeat .\n'There is no god worthy of worship but Allah, Glory be to Allah, All praises are due to Allah, and\nAllah is the greatest.\""}},{"id":18,"idInBook":18,"chapterId":14,"bookId":15,"arabic":"حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، قَالَ‏:‏ حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ عَجْلاَنَ، عَنِ الْقَعْقَاعِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ لَيْسَ الْغِنَى عَنْ كَثْرَةِ الْعَرَضِ، وَلَكِنَّ الْغِنَى غِنَى النَّفْسِ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"Wealth does not mean having a lot of property, rather \nwealth is in being content.\""}},{"id":19,"idInBook":19,"chapterId":14,"bookId":15,"arabic":"حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، قَالَ‏:‏ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، وَسُلَيْمَانُ بْنُ الْمُغِيرَةِ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ قَالَ‏:‏ خَدَمْتُ النَّبِيَّ صلى الله عليه وسلم عَشْرَ سِنِينَ، فَمَا قَالَ لِي‏:‏ أُفٍّ، قَطُّ، وَمَا قَالَ لِي لِشَيْءٍ لَمْ أَفْعَلْهُ‏:‏ أَلاَ كُنْتَ فَعَلْتَهُ‏؟‏ وَلاَ لِشَيْءٍ فَعَلْتُهُ‏:‏ لِمَ فَعَلْتَهُ‏؟‏‏.‏","english":{"narrator":"","text":"Anas said, \"I served the Prophet, may Allah bless him and grant\nhim peace, for ten years. He never said 'uff' to me and he never questioned me\nabout anything I had not done, asking, 'Why didn't you do it?' or questioned me about something\nI had done, asking 'Why did you do that?'\""}},{"id":20,"idInBook":20,"chapterId":14,"bookId":15,"arabic":"حَدَّثَنَا ابْنُ أَبِي الاسْوَدِ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ عَمْرٍو، قَالَ‏:‏ حَدَّثَنَا سَحَّامَةُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ الأَصَمِّ قَالَ‏:‏ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ يَقُولُ‏:‏ كَانَ النَّبِيُّ صلى الله عليه وسلم رَحِيمًا، وَكَانَ لاَ يَأْتِيهِ أَحَدٌ إِلاَّ وَعَدَهُ، وَأَنْجَزَ لَهُ إِنْ كَانَ عِنْدَهُ، وَأُقِيمَتِ الصَّلاَةُ، وَجَاءَهُ أَعْرَابِيٌّ فَأَخَذَ بِثَوْبِهِ فَقَالَ‏:‏ إِنَّمَا بَقِيَ مِنْ حَاجَتِي يَسِيرَةٌ، وَأَخَافُ أَنْسَاهَا، فَقَامَ مَعَهُ حَتَّى فَرَغَ مِنْ حَاجَتِهِ، ثُمَّ أَقْبَلَ فَصَلَّى‏.‏","english":{"narrator":"","text":"Anas ibn Malik said, \"The Prophet, may Allah bless him and grant\nhim peace, was merciful. No one came to him but that he promised him\nsomething and carried out that promise, if he had anything to give. The\niqama for the prayer had been given when a bedouin came, took hold of\nhis garment, and stated, 'I am still not satisfied and I'm afraid of forgetting'. The Prophet went with him until the man had received\nwhat he wanted then he returned and prayed.\""}},{"id":21,"idInBook":21,"chapterId":14,"bookId":15,"arabic":"حَدَّثَنَا قَبِيصَةُ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ الْمُنْكَدِرِ، عَنْ جَابِرٍ قَالَ‏:‏ مَا سُئِلَ النَّبِيُّ صلى الله عليه وسلم شَيْئًا فَقَالَ‏:‏ لا‏.‏","english":{"narrator":"","text":"Jabir said, \"The Prophet, may Allah bless him and grant him peace,\nwas never asked for anything to which he said, 'No.'\""}},{"id":22,"idInBook":22,"chapterId":14,"bookId":15,"arabic":"حَدَّثَنَا فَرْوَةُ بْنُ أَبِي الْمَغْرَاءِ، قَالَ‏:‏ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ قَالَ‏:‏ أَخْبَرَنِي الْقَاسِمُ بْنُ مُحَمَّدٍ، عَنْ عَبْدِ اللهِ بْنِ الزُّبَيْرِ قَالَ‏:‏ مَا رَأَيْتُ امْرَأَتَيْنِ أَجْوَدَ مِنْ عَائِشَةَ، وَأَسْمَاءَ، وَجُودُهُمَا مُخْتَلِفٌ، أَمَّا عَائِشَةُ فَكَانَتْ تَجْمَعُ الشَّيْءَ إِلَى الشَّيْءِ، حَتَّى إِذَا كَانَ اجْتَمَعَ عِنْدَهَا قَسَمَتْ، وَأَمَّا أَسْمَاءُ فَكَانَتْ لاَ تُمْسِكُ شَيْئًا لِغَدٍ‏.‏","english":{"narrator":"","text":"'Abdullah ibn az-Zubayr said, \"I have never seen two women more\ngenerous than 'A'isha and Asma'. Their generosity was different. 'A'isha\nused to gather things and after they had been collected together, she would\nshare them out. Asma' would not keep anything for the next day.\""}},{"id":23,"idInBook":23,"chapterId":14,"bookId":15,"arabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ‏:‏ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ صَفْوَانَ بْنِ أَبِي يَزِيدَ، عَنِ الْقَعْقَاعِ بْنِ اللَّجْلاَجِ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ لاَ يَجْتَمِعُ غُبَارٌ فِي سَبِيلِ اللهِ وَدُخَانُ جَهَنَّمَ فِي جَوْفِ عَبْدٍ أَبَدًا، وَلاَ يَجْتَمِعُ الشُّحُّ وَالإِيمَانُ فِي قَلْبِ عَبْدٍ أَبَدًا‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"The dust of the path of Allah and the smoke\nof Hellfire are never joined together in the heart of a slave (of Allah). Belief and\nstinginess are never joined together in the heart of a slave (of Allah).\""}},{"id":24,"idInBook":24,"chapterId":14,"bookId":15,"arabic":"حَدَّثَنَا مُسْلِمٌ، قَالَ‏:‏ حَدَّثَنَا صَدَقَةُ بْنُ مُوسَى هُوَ أَبُو الْمُغِيرَةِ السُّلَمِيُّ، قَالَ‏:‏ حَدَّثَنَا مَالِكُ بْنُ دِينَارٍ، عَنْ عَبْدِ اللهِ بْنِ غَالِبٍ هُوَ الْحُدَّانِيُّ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ خَصْلَتَانِ لاَ يَجْتَمِعَانِ فِي مُؤْمِنٍ‏:‏ الْبُخْلُ وَسُوءُ الْخُلُقِ‏.‏","english":{"narrator":"Abu Sa'id al-Khudri reported that the Prophet, may Allah bless\nhim and grant him peace, said, \"Two qualities are not found together in\na believer:","text":"miserliness and ill-temper.\""}},{"id":25,"idInBook":25,"chapterId":14,"bookId":15,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ‏:‏ حَدَّثَنَا الأَعْمَشُ، عَنْ مَالِكِ بْنِ الْحَارِثِ، عَنْ عَبْدِ اللهِ بْنِ رَبِيعَةَ قَالَ‏:‏ كُنَّا جُلُوسًا عِنْدَ عَبْدِ اللهِ، فَذَكَرُوا رَجُلاً، فَذَكَرُوا مِنْ خُلُقِهِ، فَقَالَ عَبْدُ اللهِ‏:‏ أَرَأَيْتُمْ لَوْ قَطَعْتُمْ رَأْسَهُ أَكُنْتُمْ تَسْتَطِيعُونَ أَنْ تُعِيدُوهُ‏؟‏ قَالُوا‏:‏ لاَ، قَالَ‏:‏ فَيَدُهُ‏؟‏ قَالُوا‏:‏ لاَ، قَالَ‏:‏ فَرِجْلُهُ‏؟‏ قَالُوا‏:‏ لاَ، قَالَ‏:‏ فَإِنَّكُمْ لاَ تَسْتَطِيعُونَ أَنْ تُغَيِّرُوا خُلُقَهُ حَتَّى تُغَيِّرُوا خَلْقَهُ، إِنَّ النُّطْفَةَ لَتَسْتَقِرُّ فِي الرَّحِمِ أَرْبَعِينَ لَيْلَةً، ثُمَّ تَنْحَدِرُ دَمًا، ثُمَّ تَكُونُ عَلَقَةً، ثُمَّ تَكُونُ مُضْغَةً، ثُمَّ يَبْعَثُ اللَّهُ مَلَكًا فَيُكْتَبُ رِزْقَهُ وَخُلُقَهُ، وَشَقِيًّا أَوْ سَعِيدًا‏.‏","english":{"narrator":"'Abdullah ibn Rabi'a said:","text":"\"We used to sit with 'Abdullah and they mentioned a man together with aspects of his character. 'Abdullah said,\n'What would you think if you cut off his head? Would you be able to put\nit back on again?' 'No,' they replied. He said, 'And his hand?' 'No,' they\nsaid. 'And his foot?' they said. 'No,' he said. He said, 'You cannot change\nhis character until you change his physical form. The drop remains in the\nwomb for forty nights and then the blood congeals and then it becomes a\nblood clot and then a lump of flesh and then Allah sends an angel and\nhe records his provision, his character, and whether he will be\nhappy or miserable (in the Next World).'\""}},{"id":26,"idInBook":26,"chapterId":14,"bookId":15,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللهِ، قَالَ‏:‏ حَدَّثَنَا الْفُضَيْلُ بْنُ سُلَيْمَانَ النُّمَيْرِيُّ، عَنْ صَالِحِ بْنِ خَوَّاتِ بْنِ صَالِحِ بْنِ خَوَّاتِ بْنِ جُبَيْرٍ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حِبَّانَ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ إِنَّ الرَّجُلَ لَيُدْرِكُ بِحُسْنِ خُلُقِهِ دَرَجَةَ الْقَائِمِ بِاللَّيْلِ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"A man who is known for his good character\nhas the same degree as someone who stands at night in prayer.\""}},{"id":27,"idInBook":27,"chapterId":14,"bookId":15,"arabic":"حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ، قَالَ‏:‏ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ مُحَمَّدِ بْنِ زِيَادٍ قَالَ‏:‏ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُ‏:‏ سَمِعْتُ أَبَا الْقَاسِمِ صلى الله عليه وسلم يَقُولُ‏:‏ خَيْرُكُمْ إِسْلاَمًا أَحَاسِنُكُمْ أَخْلاَقًا إِذَا فَقِهُوا‏.‏","english":{"narrator":"","text":"Abu Hurayra said, \"I heard Abu'l-Qasim say, 'The best of you in\nIslam is the best of you in character when they possess understanding (of\nthe deen).\""}},{"id":28,"idInBook":28,"chapterId":14,"bookId":15,"arabic":"حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، قَالَ‏:‏ حَدَّثَنَا أَبِي، قَالَ‏:‏ حَدَّثَنَا الأَعْمَشُ قَالَ‏:‏ حَدَّثَنِي ثَابِتُ بْنُ عُبَيْدٍ قَالَ‏:‏ مَا رَأَيْتُ أَحَدًا أَجَلَّ إِذَا جَلَسَ مَعَ الْقَوْمِ، وَلاَ أَفْكَهَ فِي بَيْتِهِ، مِنْ زَيْدِ بْنِ ثَابِتٍ‏.‏","english":{"narrator":"","text":"Thabit ibn 'Ubayd said, \"I have not seen anyone more serious when\nhe sits with the people nor more jovial in his house than Zayd ibn Thabit.\""}},{"id":29,"idInBook":29,"chapterId":14,"bookId":15,"arabic":"حَدَّثَنَا صَدَقَةُ، قَالَ‏:‏ أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنْ دَاوُدَ بْنِ حُصَيْنٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ قَالَ‏:‏ سُئِلَ النَّبِيُّ صلى الله عليه وسلم‏:‏ أَيُّ الأَدْيَانِ أَحَبُّ إِلَى اللهِ عَزَّ وَجَلَّ‏؟‏ قَالَ‏:‏ الْحَنِيفِيَّةُ السَّمْحَةُ‏.‏","english":{"narrator":"","text":"Ibn 'Abbas said, \"The Prophet, may Allah bless him and grant him\npeace, was asked, 'Which religion does Allah Almighty love the most?' He\nreplied, 'The simple Hanifiyya one.'\""}},{"id":30,"idInBook":30,"chapterId":14,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ صَالِحٍ قَالَ‏:‏ حَدَّثَنِي مُوسَى بْنُ عَلِيٍّ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللهِ بْنِ عَمْرٍو قَالَ‏:‏ أَرْبَعُ خِلاَلٍ إِذَا أُعْطِيتَهُنَّ فَلاَ يَضُرُّكَ مَا عُزِلَ عَنْكَ مِنَ الدُّنْيَا‏:‏ حُسْنُ خَلِيقَةٍ، وَعَفَافُ طُعْمَةٍ، وَصِدْقُ حَدِيثٍ، وَحِفْظُ أَمَانَةٍ‏.‏","english":{"narrator":"'Abdullah ibn 'Amr said, \"There are four qualities such that if\nyou were to be given them, you will not be harmed even if the world were\nto be taken away from you. They are:","text":"good character, restraint in food,\ntruthful speech, and upholding a trust.\""}},{"id":31,"idInBook":31,"chapterId":14,"bookId":15,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ‏:‏ حَدَّثَنَا دَاوُدُ بْنُ يَزِيدَ قَالَ‏:‏ سَمِعْتُ أَبِي يَقُولُ‏:‏ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُ‏:‏ قَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ تَدْرُونَ مَا أَكْثَرُ مَا يُدْخِلُ النَّارَ‏؟‏ قَالُوا‏:‏ اللَّهُ وَرَسُولُهُ أَعْلَمُ، قَالَ‏:‏ الأَجْوَفَانِ‏:‏ الْفَرْجُ وَالْفَمُ، وَأَكْثَرُ مَا يُدْخِلُ الْجَنَّةَ‏؟‏ تَقْوَى اللهِ وَحُسْنُ الْخُلُقِ‏.‏","english":{"narrator":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"Do you know what it is that makes most people enter\nHellfire?\" \"Allah and His Messenger know best,\" they said. He said, \"The\ntwo empty ones:","text":"the genitals and the mouth. Do you know what it is that\nmakes most people enter Paradise? Taqwa of Allah and good character.\""}},{"id":32,"idInBook":32,"chapterId":14,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا أَبُو عَامِرٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْجَلِيلِ بْنُ عَطِيَّةَ، عَنْ شَهْرٍ، عَنْ أُمِّ الدَّرْدَاءِ قَالَتْ‏:‏ قَامَ أَبُو الدَّرْدَاءِ لَيْلَةً يُصَلِّي، فَجَعَلَ يَبْكِي وَيَقُولُ‏:‏ اللَّهُمَّ أَحْسَنْتَ خَلْقِي فَحَسِّنْ خُلُقِي، حَتَّى أَصْبَحَ، قُلْتُ‏:‏ يَا أَبَا الدَّرْدَاءِ، مَا كَانَ دُعَاؤُكَ مُنْذُ اللَّيْلَةِ إِلاَّ فِي حُسْنِ الْخُلُقِ‏؟‏ فَقَالَ‏:‏ يَا أُمَّ الدَّرْدَاءِ، إِنَّ الْعَبْدَ الْمُسْلِمَ يَحْسُنُ خُلُقُهُ، حَتَّى يُدْخِلَهُ حُسْنُ خُلُقِهِ الْجَنَّةَ، وَيَسِيءُ خُلُقُهُ، حَتَّى يُدْخِلَهُ سُوءُ خُلُقِهِ النَّارَ، وَالْعَبْدُ الْمُسْلِمُ يُغْفَرُ لَهُ وَهُوَ نَائِمٌ، قُلْتُ‏:‏ يَا أَبَا الدَّرْدَاءِ، كَيْفَ يُغْفَرُ لَهُ وَهُوَ نَائِمٌ‏؟‏ قَالَ‏:‏ يَقُومُ أَخُوهُ مِنَ اللَّيْلِ فَيَجْتَهِدُ فَيَدْعُو اللَّهَ عَزَّ وَجَلَّ فَيَسْتَجِيبُ لَهُ، وَيَدْعُو لأَخِيهِ فَيَسْتَجِيبُ لَهُ فِيهِ‏.‏","english":{"narrator":"","text":"Umm ad-Darda' said, \"Abu'd-Darda' stood up in the night to pray.\nHe was weeping and said, 'O Allah! You made my physical form good, so make\nmy character good!' until morning. I said, 'Abu'd-Darda', your only supplication\nfor the entire night was for good character!' He replied, 'Umm ad-Darda',\nthe Muslim perfects his character until good character\nenters him into Paradise; and taints his character until\nhis bad character enter him into Hellfire. The Muslim is forgiven while\nhe is asleep.' I asked, 'Abu'd-Darda', how can be forgiven while he is\nasleep?' He said, 'His brother arises in the night, performs the night\nprayer, and supplicates to Allah Almighty and is answered. He\nsupplicates for his Muslim brother and his supplication is answered.'\""}},{"id":33,"idInBook":33,"chapterId":14,"bookId":15,"arabic":"حَدَّثَنَا أَبُو النُّعْمَانِ، قَالَ‏:‏ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ زِيَادِ بْنِ عِلاَقَةَ، عَنْ أُسَامَةَ بْنِ شَرِيكٍ قَالَ‏:‏ كُنْتُ عِنْدَ النَّبِيِّ صلى الله عليه وسلم وَجَاءَتِ الأَعْرَابُ، نَاسٌ كَثِيرٌ مِنْ هَاهُنَا وَهَاهُنَا، فَسَكَتَ النَّاسُ لاَ يَتَكَلَّمُونَ غَيْرَهُمْ، فَقَالُوا‏:‏ يَا رَسُولَ اللهِ، أَعَلَيْنَا حَرَجٌ فِي كَذَا وَكَذَا‏؟‏ فِي أَشْيَاءَ مِنْ أُمُورِ النَّاسِ، لاَ بَأْسَ بِهَا، فَقَالَ‏:‏ يَا عِبَادَ اللهِ، وَضَعَ اللَّهُ الْحَرَجَ، إِلاَّ امْرَءًا اقْتَرَضَ امْرَءًا ظُلْمًا فَذَاكَ الَّذِي حَرِجَ وَهَلَكَ، قَالُوا‏:‏ يَا رَسُولَ اللهِ، أَنَتَدَاوَى‏؟‏ قَالَ‏:‏ نَعَمْ يَا عِبَادَ اللهِ تَدَاوَوْا، فَإِنَّ اللَّهَ عَزَّ وَجَلَّ لَمْ يَضَعْ دَاءً إِلاَّ وَضَعَ لَهُ شِفَاءً، غَيْرَ دَاءٍ وَاحِدٍ، قَالُوا‏:‏ وَمَا هِيَ يَا رَسُولَ اللهِ‏؟‏ قَالَ‏:‏ الْهَرَمُ، قَالُوا‏:‏ يَا رَسُولَ اللهِ، مَا خَيْرُ مَا أُعْطِيَ الإِنْسَانُ‏؟‏ قَالَ‏:‏ خُلُقٌ حَسَنٌ‏.‏","english":{"narrator":"","text":"Usama ibn Sharik said, \"I was with the Prophet, may Allah bless\nhim and grant him peace, when some bedouins came. There were many people\non all sides. The people were silent and no one spoke except them. They\nsaid, 'Messenger of Allah! We experience difficulty in such-and-such and\nsuch-and-such' and it was in things which are not harmful to people. He\nsaid, 'Servants of Allah! Allah has removed difficulty except in a case\nwhere a man slanders someone unjustly - that is the one who is in difficulty\nand destroyed.' They said, 'Messenger of Allah, can we make use of medical\ntreatment?' 'Yes, servants of Allah,' he replied, 'you can make use of\nmedical treatment. Allah Almighty did not create an illness but that He\nmade a cure for it - except for one disease.' They asked, 'And what\nis that, Messenger of Allah?' 'Old age,' he replied. They said, 'Messenger\nof Allah, what is the best thing that a man can be given?' He replied, 'Good character'.\""}},{"id":34,"idInBook":34,"chapterId":14,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ‏:‏ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، قَالَ‏:‏ أَخْبَرَنَا ابْنُ شِهَابٍ، عَنْ عُبَيْدِ اللهِ بْنِ عَبْدِ اللهِ بْنِ عُتْبَةَ، أَنَّ ابْنَ عَبَّاسٍ قَالَ‏:‏ كَانَ رَسُولُ اللهِ صلى الله عليه وسلم أَجْوَدَ النَّاسِ بِالْخَيْرِ، وَكَانَ أَجْوَدَ مَا يَكُونُ فِي رَمَضَانَ، حِينَ يَلْقَاهُ جِبْرِيلُ صلى الله عليه وسلم، وَكَانَ جِبْرِيلُ يَلْقَاهُ فِي كُلِّ لَيْلَةٍ مِنْ رَمَضَانَ، يَعْرِضُ عَلَيْهِ رَسُولُ اللهِ صلى الله عليه وسلم الْقُرْآنَ، فَإِذَا لَقِيَهُ جِبْرِيلُ كَانَ رَسُولُ اللهِ صلى الله عليه وسلم أَجْوَدَ بِالْخَيْرِ مِنَ الرِّيحِ الْمُرْسَلَةِ‏.‏","english":{"narrator":"","text":"Ibn 'Abbas said, \"The Messenger of Allah, may Allah bless him and\ngrant him peace, was the most generous of people in giving charity. He\nwas even more generous in Ramadan when Jibril, may Allah bless him and\ngrant him peace, used to meet him. Every night of Ramadan, Jibril used to\ncome to him and the Messenger of Allah, may Allah bless him and grant him\npeace, would read the Qur'an to him. When Jibril came to him, the Messenger\nof Allah, may Allah bless him and grant him peace, was more generous in\ngiving charity than the blowing wind.\""}},{"id":35,"idInBook":35,"chapterId":14,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، قَالَ‏:‏ أَخْبَرَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ شَقِيقٍ، عَنْ أَبِي مَسْعُودٍ الأَنْصَارِيِّ قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ حُوسِبَ رَجُلٌ مِمَّنْ كَانَ قَبْلَكُمْ، فَلَمْ يُوجَدْ لَهُ مِنَ الْخَيْرِ إِلاَّ أَنَّهُ كَانَ رَجُلاً يُخَالِطُ النَّاسَ وَكَانَ مُوسِرًا، فَكَانَ يَأْمُرُ غِلْمَانَهُ أَنْ يَتَجَاوَزُوا عَنِ الْمُعْسِرِ، قَالَ اللَّهُ عَزَّ وَجَلَّ‏:‏ فَنَحْنُ أَحَقُّ بِذَلِكَ مِنْهُ، فَتَجَاوَزَ عَنْهُ‏.‏","english":{"narrator":"","text":"Abu Mas'ud al-Ansari reported that the Messenger of Allah, may\nAllah bless him and grant him peace, said, \"Before your time a man was\ncalled to account and it was found that the only good thing he had done\nwas that he was easy in his business dealings with people. He used to order\nhis slaves to go easy with people who were in difficulty. Allah Almighty\nsaid, 'We are more entitled to do that than he is, so forgive him.'\""}},{"id":36,"idInBook":36,"chapterId":14,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، عَنِ ابْنِ إِدْرِيسَ قَالَ‏:‏ سَمِعْتُ أَبِي يُحَدِّثُ عَنْ جَدِّي، عَنْ أَبِي هُرَيْرَةَ‏:‏ سُئِلَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ مَا أَكْثَرُ مَا يُدْخِلُ الْجَنَّةَ‏؟‏ قَالَ‏:‏ تَقْوَى اللهِ، وَحُسْنُ الْخُلُقِ، قَالَ‏:‏ وَمَا أَكْثَرُ مَا يُدْخِلُ النَّارَ‏؟‏ قَالَ‏:‏ الأَجْوَفَانِ‏:‏ الْفَمُ وَالْفَرْجُ‏.‏","english":{"narrator":"Abu Hurayra reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"What is the most frequent reason for someone\nentering Paradise?\" He said, \"Taqwa and good character. He was asked,\n\"What is the most frequent reason for people entering the Hellfire?\" He replied,\n\"The two empty ones:","text":"the mouth and the genitals.\""}},{"id":37,"idInBook":37,"chapterId":14,"bookId":15,"arabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، قَالَ‏:‏ حَدَّثَنَا مَعْنٌ، عَنْ مُعَاوِيَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرٍ، عَنْ أَبِيهِ، عَنْ نَوَّاسِ بْنِ سَمْعَانَ الأَنْصَارِيِّ، أَنَّهُ سَأَلَ رَسُولَ اللهِ صلى الله عليه وسلم عَنِ الْبِرِّ وَالإِثْمِ‏؟‏ قَالَ‏:‏ الْبِرُّ حُسْنُ الْخُلُقِ، وَالإِثْمُ مَا حَكَّ فِي نَفْسِكَ وَكَرِهْتَ أَنْ يَطَّلِعَ عَلَيْهِ النَّاسُ‏.‏","english":{"narrator":"","text":"It is reported Nawwas ibn Sam'an asked the Messenger of Allah,\nmay Allah bless him and grant him peace, about righteousness and sin.\nHe said, \"Righteousness is good character and sin is what gnaws at your conscience and that which you dislike for other people to become\naware of.\""}},{"id":38,"idInBook":38,"chapterId":14,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ أَبِي الأَسْوَدِ، قَالَ‏:‏ حَدَّثَنَا حُمَيْدُ بْنُ الأَسْوَدِ، عَنِ الْحَجَّاجِ الصَّوَّافِ قَالَ‏:‏ حَدَّثَنِي أَبُو الزُّبَيْرِ، قَالَ‏:‏ حَدَّثَنَا جَابِرٌ قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ مَنْ سَيِّدُكُمْ يَا بَنِي سَلِمَةَ‏؟‏ قُلْنَا‏:‏ جُدُّ بْنُ قَيْسٍ، عَلَى أَنَّا نُبَخِّلُهُ، قَالَ‏:‏ وَأَيُّ دَاءٍ أَدْوَى مِنَ الْبُخْلِ‏؟‏ بَلْ سَيِّدُكُمْ عَمْرُو بْنُ الْجَمُوحِ، وَكَانَ عَمْرٌو عَلَى أَصْنَامِهِمْ فِي الْجَاهِلِيَّةِ، وَكَانَ يُولِمُ عَنْ رَسُولِ اللهِ صلى الله عليه وسلم إِذَا تَزَوَّجَ‏.‏","english":{"narrator":"Jabir reported:","text":"that the Messenger of Allah, may Allah bless him\nand grant him peace, said, \"Who is your chief, O Banu Salama?\" We replied, \"Judd ibn Qays, although we think that he is a miser.\" He said, \"What illness is worse than miserliness? Rather, your chief is 'Amr ibn al-Jamuh.\" And 'Amr was (serving) upon their idols during Jahilyyah and he used to arrange the marriage banquet of the Messenger of Allah if he married."}},{"id":39,"idInBook":39,"chapterId":14,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلامٍ، قَالَ‏:‏ حَدَّثَنَا هُشَيْمٌ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، قَالَ‏:‏ حَدَّثَنَا وَرَّادٌ كَاتِبُ الْمُغِيرَةِ قَالَ‏:‏ كَتَبَ مُعَاوِيَةُ إِلَى الْمُغِيرَةِ بْنِ شُعْبَةَ‏:‏ أَنِ اكْتُبْ إِلَيَّ بِشَيْءٍ سَمِعْتَهُ مِنْ رَسُولِ اللهِ صلى الله عليه وسلم، فَكَتَبَ إِلَيْهِ الْمُغِيرَةُ‏:‏ أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم كَانَ يَنْهَى عَنْ قِيلَ وَقَالَ، وَإِضَاعَةِ الْمَالِ، وَكَثْرَةِ السُّؤَالِ، وَعَنْ مَنْعٍ وَهَاتِ، وَعُقُوقِ الأُمَّهَاتِ، وَعَنْ وَأْدِ الْبَنَاتِ‏.‏","english":{"narrator":"","text":"Warrad, the scribe of al-Mughira ibn Shu'ba, said, \"Mu'awiya wrote\nto al-Mughira ibn Shu'ba, saying, 'Write down for me something which you\nheard the Messenger of Allah, may Allah bless him and grant him peace.'\nAl-Mughira wrote to him, ' The Messenger of Allah, may Allah bless him\nand grant him peace, used to forbid gossip, wasting money, asking too many\nquestions, refusing to give, disobedience to parents, and burying daughters\nalive.\""}},{"id":40,"idInBook":40,"chapterId":14,"bookId":15,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَبْدِ الْمَلِكِ قَالَ‏:‏ سَمِعْتُ ابْنَ عُيَيْنَةَ قَالَ‏:‏ سَمِعْتُ ابْنَ الْمُنْكَدِرِ، سَمِعْتُ جَابِرًا‏:‏ مَا سُئِلَ النَّبِيُّ صلى الله عليه وسلم عَنْ شَيْءٍ قَطُّ فَقَالَ‏:‏ لا‏.‏","english":{"narrator":"","text":"Jabir said, \"The Prophet, may Allah bless him and grant him peace,\nwas never asked for anything to which he said, 'No,'\""}},{"id":41,"idInBook":41,"chapterId":14,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ يَزِيدَ، قَالَ‏:‏ حَدَّثَنَا مُوسَى بْنُ عَلِيٍّ قَالَ‏:‏ سَمِعْتُ أَبِي يَقُولُ‏:‏ سَمِعْتُ عَمْرَو بْنَ الْعَاصِ قَالَ‏:‏ بَعَثَ إِلَيَّ النَّبِيُّ صلى الله عليه وسلم فَأَمَرَنِي أَنْ آخُذَ عَلَيَّ ثِيَابِي وَسِلاَحِي، ثُمَّ آتِيهِ، فَفَعَلْتُ فَأَتَيْتُهُ وَهُوَ يَتَوَضَّأُ، فَصَعَّدَ إِلَيَّ الْبَصَرَ ثُمَّ طَأْطَأَ، ثُمَّ قَالَ‏:‏ يَا عَمْرُو، إِنِّي أُرِيدُ أَنْ أَبْعَثَكَ عَلَى جَيْشٍ فَيُغْنِمُكَ اللَّهُ، وَأَرْغَبُ لَكَ رَغْبَةً مِنَ الْمَالِ صَالِحَةً، قُلْتُ‏:‏ إِنِّي لَمْ أُسْلِمْ رَغْبَةً فِي الْمَالِ، إِنَّمَا أَسْلَمْتُ رَغْبَةً فِي الإِسْلاَمِ فَأَكُونُ مَعَ رَسُولِ اللهِ صلى الله عليه وسلم، فَقَالَ‏:‏ يَا عَمْرُو، نِعْمَ الْمَالُ الصَّالِحِ لِلْمَرْءِ الصَّالِحِ‏.‏","english":{"narrator":"","text":"'Amr ibn al-'As said, \"The Prophet, may Allah bless him and grant\nhim peace, sent for me. He commanded me to put on my clothes and weapons and\ncome to him. I did that and came to him while he was doing wudu'. He looked\nat me and then lowered his eyes. He then said, ''Amr, I want to put you\nin charge of an army and Allah will give you booty. I will give you a correct\nportion of the spoils.' I said, 'I did not become Muslim out of the desire\nfor property. I became Muslim out of the desire for Islam and so that I\nwould be with the Messenger of Allah, may Allah bless him and grant him\npeace.' He said, ''Amr! Sound (legitimately acquired) wealth is very excellent for a righteous man!'\""}},{"id":42,"idInBook":42,"chapterId":14,"bookId":15,"arabic":"حَدَّثَنَا بِشْرُ بْنُ مَرْحُومٍ، قَالَ‏:‏ حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي شُمَيْلَةَ الأَنْصَارِيِّ الْقُبَائِيِّ، عَنْ سَلَمَةَ بْنِ عُبَيْدِ اللهِ بْنِ مِحْصَنٍ الأَنْصَارِيِّ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ مَنْ أَصْبَحَ آمِنًا فِي سِرْبِهِ، مُعَافًى فِي جَسَدِهِ، عِنْدَهُ طَعَامُ يَوْمِهِ، فَكَأَنَّمَا حِيزَتْ لَهُ الدُّنْيَا‏.‏","english":{"narrator":"","text":"Mihsan al-Ansari reported that the Prophet, may Allah bless him\nand grant him peace, said, \"When someone is secure in his property, healthy\nin his body and has his food for the day, it is as if he owned the entire\nworld.\""}},{"id":43,"idInBook":43,"chapterId":14,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ قَالَ‏:‏ حَدَّثَنِي سُلَيْمَانُ بْنُ بِلاَلٍ، عَنْ عَبْدِ اللهِ بْنِ سُلَيْمَانَ بْنِ أَبِي سَلَمَةَ الأَسْلَمِيِّ، أَنَّهُ سَمِعَ مُعَاذَ بْنَ عَبْدِ اللهِ بْنِ خُبَيْبٍ الْجُهَنِيَّ يُحَدِّثُ، عَنْ أَبِيهِ، عَنْ عَمِّهِ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم خَرَجَ عَلَيْهِمْ وَعَلَيْهِ أَثَرُ غُسْلٍ، وَهُوَ طَيِّبُ النَّفْسِ، فَظَنَنَّا أَنَّهُ أَلَمَّ بِأَهْلِهِ، فَقُلْنَا‏:‏ يَا رَسُولَ اللهِ، نَرَاكَ طَيِّبَ النَّفْسِ‏؟‏ قَالَ‏:‏ أَجَلْ، وَالْحَمْدُ لِلَّهِ، ثُمَّ ذُكِرَ الْغِنَى، فَقَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ إِنَّهُ لاَ بَأْسَ بِالْغِنَى لِمَنِ اتَّقَى، وَالصِّحَّةُ لِمَنِ اتَّقَى خَيْرٌ مِنَ الْغِنَى، وَطِيبُ النَّفْسِ مِنَ النِّعَمِ‏.‏","english":{"narrator":"","text":"Mu'adh ibn 'Abdullah ibn Khubayb al-Juhani related from his father\nthat his uncle said that the Messenger of Allah, may Allah bless him and\ngrant him peace, came out to them with the traces of ghusl on him. He was\ncheerful so we thought he had been with his wives. We said, 'Messenger of\nAllah, we see that you are cheerful.' He said, 'Yes, and praise be to Allah!'\nThen wealth was mentioned that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, 'There is no harm in wealth for someone\nwho has taqwa, but health for the person who has taqwa is even better than\nwealth. Cheerfulness is a blessing.'\""}},{"id":44,"idInBook":44,"chapterId":14,"bookId":15,"arabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، قَالَ‏:‏ حَدَّثَنَا مَعْنٌ، عَنْ مُعَاوِيَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرِ بْنِ نُفَيْرٍ، عَنْ أَبِيهِ، عَنِ النَّوَّاسِ بْنِ سَمْعَانَ الأَنْصَارِيِّ، أَنَّهُ سَأَلَ رَسُولَ اللهِ صلى الله عليه وسلم عَنِ الْبِرِّ وَالإِثْمِ‏؟‏ فَقَالَ‏:‏ الْبِرُّ حُسْنُ الْخُلُقِ، وَالإِثْمُ مَا حَكَّ فِي نَفْسِكَ وَكَرِهْتَ أَنْ يَطَّلِعَ عَلَيْهِ النَّاسُ‏.‏","english":{"narrator":"","text":"An-Nawwas ibn Sam'an al-Ansari reported that he asked the Messenger\nof Allah, may Allah bless him and grant him peace, about righteousness and\nsin. He said, \"Righteousness is good character and sin\nis what gnaws at your conscience and that which you dislike for other people to become\naware of.\""}},{"id":45,"idInBook":45,"chapterId":14,"bookId":15,"arabic":"حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ، قَالَ‏:‏ أَخْبَرَنَا حَمَّادٌ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ قَالَ‏:‏ كَانَ النَّبِيُّ صلى الله عليه وسلم أَحْسَنَ النَّاسِ، وَأَجْوَدَ النَّاسِ، وَأَشْجَعَ النَّاسِ، وَلَقَدْ فَزِعَ أَهْلُ الْمَدِينَةِ ذَاتَ لَيْلَةٍ، فَانْطَلَقَ النَّاسُ قِبَلَ الصَّوْتِ، فَاسْتَقْبَلَهُمُ النَّبِيُّ صلى الله عليه وسلم قَدْ سَبَقَ النَّاسَ إِلَى الصَّوْتِ وَهُوَ يَقُولُ‏:‏ لَنْ تُرَاعُوا، لَنْ تُرَاعُوا، وَهُوَ عَلَى فَرَسٍ لأَبِي طَلْحَةَ عُرْيٍ، مَا عَلَيْهِ سَرْجٌ، وَفِي عُنُقِهِ السَّيْفُ، فَقَالَ‏:‏ لَقَدْ وَجَدْتُهُ بَحْرًا، أَوْ إِنَّهُ لَبَحْرٌ‏.‏","english":{"narrator":"","text":"Anas reported that the Prophet, may Allah bless him and grant him\npeace, was the best of people, the most generous of people and most courageous\nof people. One night the people of Madina were alarmed by a noise and the\npeople went towards its source. The Prophet, may Allah bless him and grant\nhim peace, met them, having already reached the source of the noise before\nthem and he was saying, \"Do not be alarmed. Do not be alarmed.\" He was\nriding a horse belonging to Abu Talha without a saddle and a sword was\nhung around his neck. He said, \"I found it (the horse) like a great river\"\nor it was a great river (meaning its speed)."}},{"id":46,"idInBook":46,"chapterId":14,"bookId":15,"arabic":"حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا ابْنُ الْمُنْكَدِرِ، عَنْ أَبِيهِ، عَنْ جَابِرٍ قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ كُلُّ مَعْرُوفٍ صَدَقَةٌ، إِنَّ مِنَ الْمَعْرُوفِ أَنْ تَلْقَى أَخَاكَ بِوَجْهٍ طَلْقٍ، وَأَنْ تُفْرِغَ مِنْ دَلْوِكَ فِي إِنَاءِ أَخِيكَ‏.‏","english":{"narrator":"","text":"Jabir reported that the Messenger of Allah, may Allah bless him\nand grant him peace, said, \"Every act of kindness is sadaqa. Part of kindness\nis that you offer your brother a cheerful face and you pour some of your\nbucket into his water vessel.\""}},{"id":47,"idInBook":47,"chapterId":14,"bookId":15,"arabic":"حَدَّثَنَا الأُوَيْسِيُّ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي الزِّنَادِ، عَنْ أَبِيهِ، عَنْ عُرْوَةَ، عَنْ أَبِي مُرَاوِحٍ، عَنْ أَبِي ذَرٍّ‏:‏ سُئِلَ النَّبِيُّ صلى الله عليه وسلم‏:‏ أَيُّ الأَعْمَالِ خَيْرٌ‏؟‏ قَالَ‏:‏ إِيمَانٌ بِاللَّهِ، وَجِهَادٌ فِي سَبِيلِهِ، قَالَ‏:‏ فَأَيُّ الرِّقَابِ أَفْضَلُ‏؟‏ قَالَ‏:‏ أَغْلاَهَا ثَمَنًا، وَأَنْفَسُهَا عِنْدَ أَهْلِهَا، قَالَ‏:‏ أَفَرَأَيْتَ إِنْ لَمْ أَسْتَطِعْ بَعْضَ الْعَمَلِ‏؟‏ قَالَ‏:‏ تُعِينُ ضَائِعًا، أَوْ تَصْنَعُ لأَخْرَقَ، قَالَ‏:‏ أَفَرَأَيْتَ إِنْ ضَعُفْتُ‏؟‏ قَالَ‏:‏ تَدَعُ النَّاسَ مِنَ الشَّرِّ، فَإِنَّهَا صَدَقَةٌ تَصَدَّقَهَا عَلَى نَفْسِكَ‏.‏","english":{"narrator":"","text":"Abu Dharr reported that the Prophet, may Allah bless him and grant\nhim peace, was asked, \"Which is the best action?\" He replied, \"Belief in\nAllah and jihad in His Way.\" He was asked, \"Which slaves are best?\" He\nreplied, \"The highest in price and the most precious to their people.\"\nHe said, \"What do you think I should do if I am unable to fight?\" He said,\n\"Help someone in trouble or work for someone who does not work.\" He said,\n\"What do you think that I should do if I am too weak (to act accordingly)?\"\nHe said, \"Spare people your evil. That is a sadaqa which you bestow on\nyourself.\""}},{"id":48,"idInBook":48,"chapterId":14,"bookId":15,"arabic":"حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ قَالَ‏:‏ أَخْبَرَنِي سَعِيدُ بْنُ أَبِي بُرْدَةَ، سَمِعْتُ أَبِي يُحَدِّثُ، عَنْ جَدِّي، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ عَلَى كُلِّ مُسْلِمٍ صَدَقَةٌ، قَالَ‏:‏ أَفَرَأَيْتَ إِنْ لَمْ يَجِدْ‏؟‏ قَالَ‏:‏ فَلْيَعْمَلْ، فَلْيَنْفَعْ نَفْسَهُ، وَلْيَتَصَدَّقْ، قَالَ‏:‏ أَفَرَأَيْتَ إِنْ لَمْ يَسْتَطِعْ، أَوْ لَمْ يَفْعَلْ‏؟‏ قَالَ‏:‏ لِيُعِنْ ذَا الْحَاجَةِ الْمَلْهُوفَ، قَالَ‏:‏ أَفَرَأَيْتَ إِنْ لَمْ يَسْتَطِعْ، أَوْ لَمْ يَفْعَلْ‏؟‏ قَالَ‏:‏ فَلْيَأْمُرْ بِالْمَعْرُوفِ، قَالَ‏:‏ أَفَرَأَيْتَ إِنْ لَمْ يَسْتَطِعْ، أَوْ لَمْ يَفْعَلْ‏؟‏ قَالَ‏:‏ يُمْسِكْ عَنِ الشَّرِّ، فَإِنَّهَا لَهُ صَدَقَةٌ‏.‏","english":{"narrator":"","text":"Sa'id ibn Abi Burda related from his grandfather that the Prophet,\nmay Allah bless him and grant him peace, said, \"Every Muslim owes sadaqa.\"\nHe said, \"What do you think he should do if he cannot find anything to\ngive?\" He replied, \"He should find work and thus benefit himself and be\nable to give sadaqa.\" He said, \"What do you think he should do if he cannot\nor does not do that?\" He said, \"He should help someone with a great need.\"\nHe said, \"What do you think he should do if he cannot or does not do that?\"\nHe replied, \"He should command the good.\" He asked, \"What do you think\nhe should do if he cannot or does not do that?\" He replied, \"He should\nrefrain from evil. That is sadaqa for him.\""}},{"id":49,"idInBook":49,"chapterId":14,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلامٍ، قَالَ‏:‏ أَخْبَرَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ الْفَزَارِيُّ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ زِيَادِ بْنِ أَنْعُمٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ رَافِعٍ التَّنُوخِيِّ، عَنْ عَبْدِ اللهِ بْنِ عَمْرٍو، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم كَانَ يُكْثِرُ أَنْ يَدْعُوَ‏:‏ اللَّهُمَّ إِنِّي أَسْأَلُكَ الصِّحَّةَ، وَالْعِفَّةَ، وَالأَمَانَةَ، وَحُسْنَ الْخُلُقِ، وَالرِّضَا بِالْقَدَرِ‏.‏","english":{"narrator":"","text":"'Abdullah ibn 'Amr reported that the Messenger of Allah, may Allah\nbless him and grant him peace, used to supplicate, \"Oh Allah, I ask You\nfor health, restraint, trustworthiness, good character, and contentment\nwith the decree.\""}},{"id":50,"idInBook":50,"chapterId":14,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ السَّلامِ، قَالَ‏:‏ حَدَّثَنَا جَعْفَرٌ، عَنْ أَبِي عِمْرَانَ، عَنْ يَزِيدَ بْنِ بَابَنُوسَ قَالَ‏:‏ دَخَلْنَا عَلَى عَائِشَةَ فَقُلْنَا‏:‏ يَا أُمَّ الْمُؤْمِنِينَ، مَا كَانَ خُلُقُ رَسُولِ اللهِ صلى الله عليه وسلم‏؟‏ قَالَتْ‏:‏ كَانَ خُلُقُهُ الْقُرْآنَ، تَقْرَؤُونَ سُورَةَ الْمُؤْمِنِينَ‏؟‏ قَالَتِ‏:‏ اقْرَأْ‏:‏ ‏{‏قَدْ أَفْلَحَ الْمُؤْمِنُونَ‏}‏، قَالَ يَزِيدُ‏:‏ فَقَرَأْتُ‏:‏ ‏{‏قَدْ أَفْلَحَ الْمُؤْمِنُونَ‏}‏ إِلَى ‏{‏لِفُرُوجِهِمْ حَافِظُونَ‏}‏، قَالَتْ‏:‏ هَكَذَا كَانَ خُلُقُ رَسُولِ اللهِ صلى الله عليه وسلم‏.‏","english":{"narrator":"Yazid ibn Yabnus said, \"We went to 'A'isha and said, 'Umm al-Mu'minin,\nwhat was the character of the Messenger of Allah, may Allah bless him and\ngrant him peace, like?' She replied, 'His character was the Qur'an. Can\nyou recite the sura entitled \"The Believers\"?' She said, 'Recite:","text":"\"It is\nthe believers who are successful: those who are humble in their prayer;\nthose who turn away from worthless talk; those who actively pay zakat;\nthose who guard their private parts.\" (23:1-5)' She said, 'That was the\ncharacter of the Messenger of Allah, may Allah bless him and grant him\npeace.'\""}}],"chapter":{"id":14,"bookId":15,"arabic":"كتاب حسن الخلق","english":"Excellence in Character"}}