{"metadata":{"length":24,"arabic":{"title":"الأدب المفرد","author":"الإمام محمد بن إسماعيل البخاري","introduction":"كتاب اللعن"},"english":{"title":"Al-Adab Al-Mufrad","author":"Imam Muhammad ibn Ismail al-Bukhari","introduction":"Cursing"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":15,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ شَيْبَةَ قَالَ‏:‏ أَخْبَرَنِي ابْنُ أَبِي الْفُدَيْكِ، عَنْ كَثِيرِ بْنِ زَيْدٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللهِ قَالَ‏:‏ مَا سَمِعْتُ عَبْدَ اللهِ لاَعِنًا أَحَدًا قَطُّ، لَيْسَ إِنْسَانًا‏.‏ وَكَانَ سَالِمٌ يَقُولُ‏:‏ قَالَ عَبْدُ اللهِ بْنُ عُمَرَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ لاَ يَنْبَغِي لِلْمُؤْمِنِ أَنْ يَكُونَ لَعَّانًا‏.‏","english":{"narrator":"","text":"Salim ibn 'Abdullah said, \"I never heard 'Abdullah ever curse anything.\"\nSalim mentioned that 'Abdullah ibn 'Umar said, \"It is not fitting for a\nbeliever to be a curser.\""}},{"id":2,"idInBook":2,"chapterId":15,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلامٍ، قَالَ‏:‏ حَدَّثَنَا الْفَزَارِيُّ، عَنِ الْفَضْلِ بْنِ مُبَشِّرٍ الأَنْصَارِيِّ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ إِنَّ اللَّهَ لاَ يُحِبُّ الْفَاحِشَ الْمُتَفَحِّشَ، وَلاَ الصَّيَّاحَ فِي الاسْوَاقِ‏.‏","english":{"narrator":"","text":"Jabir ibn 'Abdullah reported that the Messenger of Allah, may Allah\nbless him and grant him peace, said, \"Allah does not love the loud and\ncoarse nor the one who shouts in the markets.\""}},{"id":3,"idInBook":3,"chapterId":15,"bookId":15,"arabic":"وَعَنْ عَبْدِ الْوَهَّابِ، عَنْ أَيُّوبَ، عَنْ عَبْدِ اللهِ بْنِ أَبِي مُلَيْكَةَ، عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا، أَنَّ يَهُودًا أَتَوُا النَّبِيَّ صلى الله عليه وسلم فَقَالُوا‏:‏ السَّامُ عَلَيْكُمْ، فَقَالَتْ عَائِشَةُ‏:‏ وَعَلَيْكُمْ، وَلَعَنَكُمُ اللَّهُ، وَغَضِبُ اللَّهُ عَلَيْكُمْ، قَالَ‏:‏ مَهْلاً يَا عَائِشَةُ، عَلَيْكِ بِالرِّفْقِ، وَإِيَّاكِ وَالْعُنْفَ وَالْفُحْشَ، قَالَتْ‏:‏ أَوَ لَمْ تَسْمَعْ مَا قَالُوا‏؟‏ قَالَ‏:‏ أَوَ لَمْ تَسْمَعِي مَا قُلْتُ‏؟‏ رَدَدْتُ عَلَيْهِمْ، فَيُسْتَجَابُ لِي فِيهِمْ، وَلاَ يُسْتَجَابُ لَهُمْ فِيَّ‏.‏","english":{"narrator":"","text":"'A'isha reported that some Jews came to the Prophet, may Allah\nbless him and grant him peace, and said, \"Poison ('sam' instead\nof 'salam') be upon you.\" 'A'isha said, \"And upon you and may the\ncurse of Allah and the anger of Allah be upon you!\" The Prophet said, \"Easy,\n'A'isha, you must be gentle. Beware of harshness and coarseness.\" She asked,\n\"Didn't you hear what they said?\" He said, \"Didn't you hear what I said?\nI repeated it to them and what I said about them will be accepted and what\nthey said about me will not be accepted.\""}},{"id":4,"idInBook":4,"chapterId":15,"bookId":15,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، قَالَ‏:‏ حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ، عَنِ الْحَسَنِ بْنِ عَمْرٍو، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ لَيْسَ الْمُؤْمِنُ بِالطَّعَّانِ، وَلاَ اللِّعَانِ، وَلاَ الْفَاحِشِ وَلاَ الْبَذِي‏.‏","english":{"narrator":"","text":"'Abdullah reported that the Prophet, may Allah bless him and grant\nhim peace, said, \"A believer is not a defamer nor a curser nor coarse nor\nobscene.\""}},{"id":5,"idInBook":5,"chapterId":15,"bookId":15,"arabic":"حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، قَالَ‏:‏ حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ، عَنْ عُبَيْدِ اللهِ بْنِ سَلْمَانَ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ لاَ يَنْبَغِي لِذِي الْوَجْهَيْنِ أَنْ يَكُونَ أَمِينًا‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"A person who is two-faced cannot be trusted.\""}},{"id":6,"idInBook":6,"chapterId":15,"bookId":15,"arabic":"حَدَّثَنَا عَمْرُو بْنُ مَرْزُوقٍ، قَالَ‏:‏ أَخْبَرَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، عَنْ أَبِي الأَحْوَصِ، عَنْ عَبْدِ اللهِ قَالَ‏:‏ أَلأَمُ أَخْلاَقِ الْمُؤْمِنِ الْفُحْشُ‏.‏","english":{"narrator":"","text":"'Abdullah said, \"The most blameworthy thing in a believer's character\nis coarseness.\""}},{"id":7,"idInBook":7,"chapterId":15,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْعَزِيزِ، قَالَ‏:‏ حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ قَالَ‏:‏ حَدَّثَنِي مُحَمَّدُ بْنُ عُبَيْدٍ الْكِنْدِيُّ الْكُوفِيُّ، عَنْ أَبِيهِ قَالَ‏:‏ سَمِعْتُ عَلِيَّ بْنَ أَبِي طَالِبٍ، صَلَوَاتُ اللهِ عَلَيْهِ، يَقُولُ‏:‏ لُعِنَ اللَّعَّانُونَ‏.‏","english":{"narrator":"","text":"'Ubayd al-Kindi al-Kufi reported that he heard 'Ali ibn Abi Talib\nsaid, \"The cursers are cursed.\""}},{"id":8,"idInBook":8,"chapterId":15,"bookId":15,"arabic":"حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، قَالَ‏:‏ أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ‏:‏ أَخْبَرَنِي زَيْدُ بْنُ أَسْلَمَ، عَنْ أُمِّ الدَّرْدَاءِ، عَنْ أَبِي الدَّرْدَاءِ قَالَ‏:‏ قَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ إِنَّ اللَّعَّانِينَ لاَ يَكُونُونَ يَوْمَ الْقِيَامَةِ شُهَدَاءَ، وَلا شُفَعَاءَ‏.‏","english":{"narrator":"","text":"Abu'd-Darda' reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"Those who curse will be neither witnesses nor intercessors\non the Day of Rising.\""}},{"id":9,"idInBook":9,"chapterId":15,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللهِ، قَالَ‏:‏ حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ، عَنِ الْعَلاَءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ قَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ لاَ يَنْبَغِي لِلصِّدِّيقِ أَنْ يَكُونَ لَعَّانًا‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"The true person must not be a curser.\""}},{"id":10,"idInBook":10,"chapterId":15,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ أَبِي ظَبْيَانَ، عَنْ حُذَيْفَةَ قَالَ‏:‏ مَا تَلاَعَنَ قَوْمٌ قَطُّ إِلاَّ حُقَّ عَلَيْهِمُ اللَّعْنَةُ‏.‏","english":{"narrator":"","text":"Hudhayfa said, \"People do not curse one another without that curse\ncoming true.\""}},{"id":11,"idInBook":11,"chapterId":15,"bookId":15,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ يَعْقُوبَ قَالَ‏:‏ حَدَّثَنِي يَزِيدُ بْنُ الْمِقْدَامِ بْنِ شُرَيْحٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ قَالَ‏:‏ أَخْبَرَتْنِي عَائِشَةُ، أَنَّ أَبَا بَكْرٍ لَعَنَ بَعْضَ رَقِيقِهِ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ يَا أَبَا بَكْرٍ، اللَّعَّانِينَ وَالصِّدِّيقِينَ‏؟‏ كَلاَّ وَرَبِّ الْكَعْبَةِ، مَرَّتَيْنِ أَوْ ثَلاَثًا، فَأَعْتَقَ أَبُو بَكْرٍ يَوْمَئِذٍ بَعْضَ رَقِيقِهِ، ثُمَّ جَاءَ النَّبِيُّ صلى الله عليه وسلم فَقَالَ‏:‏ لا أَعُودُ‏.‏","english":{"narrator":"","text":"'A'isha reported that Abu Bakr cursed one of his slaves and the\nProphet, may Allah bless him and grant him peace, said, \"Abu Bakr! The\ncursers and the true! No, by the Lord of the Ka'ba,\" and he repeated that\ntwo or three times. That very same day Abu Bakr freed one of his slaves.\nThe Prophet, may Allah bless him and grant him peace, came and said, \"Do\nnot do that again (i.e. curse someone).\""}},{"id":12,"idInBook":12,"chapterId":15,"bookId":15,"arabic":"حَدَّثَنَا مُسْلِمٌ، قَالَ‏:‏ حَدَّثَنَا هِشَامٌ، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ سَمُرَةَ قَالَ‏:‏ قَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ لاَ تَتَلاَعَنُوا بِلَعْنَةِ اللهِ، وَلاَ بِغَضَبِ اللهِ، وَلاَ بِالنَّارِ‏.‏","english":{"narrator":"","text":"Samura reported that the Prophet, may Allah bless him and grant\nhim peace, said, \"Do not curse one another with the curse of Allah, not\nthe anger of Allah nor with the Fire.\""}},{"id":13,"idInBook":13,"chapterId":15,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدٍ قَالَ‏:‏ عَبْدُ اللهِ بْنُ محمد قال حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ، حَدَّثَنَا يَزِيدُ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ قِيلَ‏:‏ يَا رَسُولَ اللهِ، ادْعُ اللَّهَ عَلَى الْمُشْرِكِينَ، قَالَ‏:‏ إِنِّي لَمْ أُبْعَثْ لَعَّانًا، وَلَكِنْ بُعِثْتُ رَحْمَةً‏.‏","english":{"narrator":"","text":"Abu Hurayra said, \"The Messenger of Allah, may Allah bless him\nand grant him peace, was asked, \"Messenger of Allah, invoke a curse for\nus against the idolaters.' He replied, 'I was not sent as a curser. I was\nsent as a mercy.'\""}},{"id":14,"idInBook":14,"chapterId":15,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ هَمَّامٍ‏:‏ كُنَّا مَعَ حُذَيْفَةَ، فَقِيلَ لَهُ‏:‏ إِنَّ رَجُلا يَرْفَعُ الْحَدِيثَ إِلَى عُثْمَانَ، فَقَالَ حُذَيْفَةُ‏:‏ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ‏:‏ لا يَدْخُلُ الْجَنَّةَ قَتَّاتٌ‏.‏","english":{"narrator":"","text":"Himam said, \"We were with Hudhayfa when he was told, 'A man has\na hadith going back to 'Uthman.' Hudhayfa said, 'I heard the Prophet, may\nAllah bless him and grant him peace, say, \"A mischief-maker will not enter\nthe Garden.\"'\""}},{"id":15,"idInBook":15,"chapterId":15,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا مُسَدَّدٌ، قَالَ‏:‏ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ اللهِ بْنُ عُثْمَانَ بْنِ خُثَيْمٍ، عَنْ شَهْرِ بْنِ حَوْشَبٍ، عَنْ أَسْمَاءَ بِنْتِ يَزِيدَ قَالَتْ‏:‏ قَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ أَلاَ أُخْبِرُكُمْ بِخِيَارِكُمْ‏؟‏ قَالُوا‏:‏ بَلَى، قَالَ‏:‏ الَّذِينَ إِذَا رُؤُوا ذُكِرَ اللَّهُ، أَفَلاَ أُخْبِرُكُمْ بِشِرَارِكُمْ‏؟‏ قَالُوا‏:‏ بَلَى، قَالَ‏:‏ الْمَشَّاؤُونَ بِالنَّمِيمَةِ، الْمُفْسِدُونَ بَيْنَ الأَحِبَّةِ، الْبَاغُونَ الْبُرَآءَ الْعَنَتَ‏.‏","english":{"narrator":"","text":"Asma' bint Yazid reported that the Prophet, may Allah bless him\nand grant him peace, said, \"Shall I tell you who is the best of you?\" \"Yes,,\"\nthey replied. He said, \"Those who remind you of Allah when you see them.\"\nHe went on to say, \"Shall I tell you who is the worst of you?\" \"Yes,\" they\nreplied. He said, \"Those who go about slandering, causing mischief between\nfriends in order to separate them, and desiring to lead the innocent into\nwrong action.\""}},{"id":16,"idInBook":16,"chapterId":15,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ‏:‏ حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، قَالَ‏:‏ حَدَّثَنَا أَبِي قَالَ‏:‏ سَمِعْتُ يَحْيَى بْنَ أَيُّوبَ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ مَرْثَدِ بْنِ عَبْدِ اللهِ، عَنْ حَسَّانَ بْنِ كُرَيْبٍ، عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ رَضِيَ اللَّهُ عَنْهُ قَالَ‏:‏ الْقَائِلُ الْفَاحِشَةَ، وَالَّذِي يُشِيعُ بِهَا، فِي الإِثْمِ سَوَاءٌ‏.‏","english":{"narrator":"","text":"'Ali ibn Abi Talib said, \"The person who says something indecent\nand the person who makes it known are equal as far as the wrong action\nis concerned.\""}},{"id":17,"idInBook":17,"chapterId":15,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا بِشْرُ بْنُ مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ اللهِ، قَالَ‏:‏ حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي خَالِدٍ، عَنْ شُبَيْلِ بْنِ عَوْفٍ قَالَ‏:‏ كَانَ يُقَالُ‏:‏ مَنْ سَمِعَ بِفَاحِشَةٍ فَأَفْشَاهَا، فَهُوَ فِيهَا كَالَّذِي أَبْدَاهَا‏.‏","english":{"narrator":"","text":"Shubayl ibn 'Awf said, \"It is said, 'Whoever hears something indecent\nand then spreads it is like the one who originated it.'\""}},{"id":18,"idInBook":18,"chapterId":15,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدٍ قَالَ حَدَّثَنَا قَبِيصَةُ، قَالَ‏:‏ حَدَّثَنَا حَجَّاجٌ، عَنِ ابْنِ جُرَيْجٍ، عَنْ عَطَاءٍ، أَنَّهُ كَانَ يَرَى النَّكَالَ عَلَى مَنْ أَشَاعَ الزِّنَا، يَقُولُ‏:‏ أَشَاعَ الْفَاحِشَةَ‏.‏","english":{"narrator":"","text":"'Ata thought that an exemplary punishment should be carried out\non anyone who makes adultery known. He said, \"He has made indecency known.\""}},{"id":19,"idInBook":19,"chapterId":15,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنْ عِمْرَانَ بْنِ ظَبْيَانَ، عَنْ أَبِي يَحْيَى حَكِيمِ بْنِ سَعْدٍ قَالَ‏:‏ سَمِعْتُ عَلِيًّا يَقُولُ‏:‏ لاَ تَكُونُوا عُجُلاً مَذَايِيعَ بُذُرًا، فَإِنْ مِنْ وَرَائِكُمْ بَلاَءً مُبَرِّحًا مُمْلِحًا، وَأُمُورًا مُتَمَاحِلَةً رُدُحًا‏.‏","english":{"narrator":"","text":"Hukaym ibn Sa'd heard 'Ali say, \"Do not be hasty, spreading and\ndivulging secrets. Ahead of you lies a severe, distressing affliction and\nevents which would take a long time explain - namely oppressive conflicts.\""}},{"id":20,"idInBook":20,"chapterId":15,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا بِشْرُ بْنُ مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ اللهِ، قَالَ‏:‏ حَدَّثَنَا إِسْرَائِيلُ بْنُ أَبِي إِسْحَاقَ، عَنْ أَبِي إِسْحَاقَ، عَنْ أَبِي يَحْيَى، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عَبَّاسٍ قَالَ‏:‏ إِذَا أَرَدْتَ أَنْ تَذْكُرَ عُيُوبَ صَاحِبِكَ، فَاذْكُرْ عُيُوبَ نَفْسِكَ‏.‏","english":{"narrator":"","text":"Ibn 'Abbas said, \"When you want to mention your companion's faults,\nremember your own faults.\""}},{"id":21,"idInBook":21,"chapterId":15,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا بِشْرُ بْنُ مُحَمَّدٍ، قَالَ‏:‏ أَخْبَرَنَا عَبْدُ اللهِ، قَالَ‏:‏ حَدَّثَنَا أَبُو مَوْدُودٍ، عَنْ زَيْدٍ مَوْلَى قَيْسٍ الْحَذَّاءِ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، فِي قَوْلِهِ عَزَّ وَجَلَّ‏:‏ ‏{‏وَلاَ تَلْمِزُوا أَنْفُسَكُمْ‏}‏، قَالَ‏:‏ لاَ يَطْعَنُ بَعْضُكُمْ عَلَى بَعْضٍ‏.‏","english":{"narrator":"","text":"Ibn 'Abbas spoke about the words of Allah Almighty, \"Do not\nfind fault with one another\" (49:11) and he said that these words mean,\n\"Do not attack one another.\""}},{"id":22,"idInBook":22,"chapterId":15,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا مُوسَى، قَالَ‏:‏ حَدَّثَنَا وُهَيْبٌ، قَالَ‏:‏ أَخْبَرَنَا دَاوُدُ، عَنْ عَامِرٍ قَالَ‏:‏ حَدَّثَنِي أَبُو جَبِيرَةَ بْنُ الضَّحَّاكِ قَالَ‏:‏ فِينَا نَزَلَتْ، فِي بَنِي سَلِمَةَ‏:‏ ‏{‏وَلاَ تَنَابَزُوا بِالأَلْقَابِ‏}‏، قَالَ‏:‏ قَدِمَ عَلَيْنَا رَسُولُ اللهِ صلى الله عليه وسلم وَلَيْسَ مِنَّا رَجُلٌ إِلاَّ لَهُ اسْمَانِ، فَجَعَلَ النَّبِيُّ صلى الله عليه وسلم يَقُولُ‏:‏ يَا فُلاَنُ، فَيَقُولُونَ‏:‏ يَا رَسُولَ اللهِ، إِنَّهُ يَغْضَبُ مِنْهُ‏.‏","english":{"narrator":"","text":"Ad-Dahhak said, \"It was about us (the Banu Salima) that these words\nwere revealed, 'Do not find fault with one another' (49:11)\" He\nwent on to say, \"The Messenger of Allah, may Allah bless him and grant\nhim peace, came to us and there was not a man among us who did not have\ntwo names. The Prophet, may Allah bless him and grant him peace, began\nto say, 'O so-and-so!' and they said, 'Messenger of Allah! That will make\nhim angry!'\""}},{"id":23,"idInBook":23,"chapterId":15,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدٍ قَالَ‏:‏ أخبرنا الْفَضْلُ بْنُ مُقَاتِلٍ، قَالَ‏:‏ حَدَّثَنَا يَزِيدُ بْنُ أَبِي حَكِيمٍ، عَنِ الْحَكَمِ قَالَ‏:‏ سَمِعْتُ عِكْرِمَةَ يَقُولُ‏:‏ لاَ أَدْرِي أَيُّهُمَا جَعَلَ لِصَاحِبِهِ طَعَامًا، ابْنُ عَبَّاسٍ أَوِ ابْنُ عَمِّهِ، فَبَيْنَا الْجَارِيَةُ تَعْمَلُ بَيْنَ أَيْدِيهِمْ، إِذْ قَالَ أَحَدُهُمْ لَهَا‏:‏ يَا زَانِيَةُ، فَقَالَ‏:‏ مَهْ، إِنْ لَمْ تَحُدَّكَ فِي الدُّنْيَا تَحُدُّكَ فِي الْآخِرَةِ، قَالَ‏:‏ أَفَرَأَيْتَ إِنْ كَانَ كَذَاكَ‏؟‏ قَالَ‏:‏ إِنَّ اللَّهَ لاَ يُحِبُّ الْفَاحِشَ الْمُتَفَحِّشَ‏.‏","english":{"narrator":"","text":"'Ikrima was heard to say, \"I do not know which o f them, either\nIbn 'Abbas or Ibn 'Umar, was giving his companions food, and a slavegirl\nwas working in their presence. One of them said to her, 'Harlot!' He said,\n'Easy! If she does not exact the hadd punishment (i.e. for slander) from\nyou in this world, she will take it from you in the Next World.' The man\nsaid, 'And what do you think if it (what I said) is the truth?' He replied,\n'Allah does not love anyone who greatly exceeds the sounds in speaking\nof indecencies.\""}},{"id":24,"idInBook":24,"chapterId":15,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ اللهِ بْنُ مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ سَابِقٍ، قَالَ‏:‏ حَدَّثَنَا إِسْرَائِيلُ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ لَيْسَ الْمُؤْمِنُ بِالطَّعَّانِ، وَلاَ اللِّعَانِ، وَلاَ الْفَاحِشِ، وَلاَ الْبَذِي‏.‏","english":{"narrator":"","text":"'Abdullah reported that the Prophet, may Allah bless him and grant\nhim peace, said. \"The believer is neither a defamer nor a curser nor outrageous\nnor obscene.\""}}],"chapter":{"id":15,"bookId":15,"arabic":"كتاب اللعن","english":"Cursing"}}