{"metadata":{"length":11,"arabic":{"title":"الأدب المفرد","author":"الإمام محمد بن إسماعيل البخاري","introduction":"كتاب المدح"},"english":{"title":"Al-Adab Al-Mufrad","author":"Imam Muhammad ibn Ismail al-Bukhari","introduction":"Praise"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":16,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا آدَمُ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، عَنْ خَالِدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرَةَ، عَنْ أَبِيهِ، أَنَّ رَجُلاً ذُكِرَ عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَأَثْنَى عَلَيْهِ رَجُلٌ خَيْرًا، فَقَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ وَيْحَكَ قَطَعْتَ عُنُقَ صَاحِبِكَ، يَقُولُهُ مِرَارًا، إِنْ كَانَ أَحَدُكُمْ مَادِحًا لاَ مَحَالَةَ فَلْيَقُلْ‏:‏ أَحْسَبُ كَذَا وَكَذَا، إِنْ كَانَ يَرَى أَنَّهُ كَذَلِكَ، وَحَسِيبُهُ اللَّهُ، وَلاَ يُزَكِّي عَلَى اللهِ أَحَدًا‏.‏","english":{"narrator":"","text":"Abu Bakr reported that a man was mentioned in the presence of the\nProphet, may Allah bless him and grant him peace, and someone praised him.\nThe Prophet, may Allah bless him and grant him peace, said, \"Woe to you!\nYou have cut off the head of your companion!\" and he repeated that several\ntimes. He went on, \"If one of you must praise someone, he should say, 'I\nconsider that so-and-so is such-and-such.' Allah is the One who will take\naccount of him if he thinks that he is indeed like that, No one can appropriate\nAllah's right to attest to someone's character.\""}},{"id":2,"idInBook":2,"chapterId":16,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، قَالَ‏:‏ حَدَّثَنَا إِسْمَاعِيلُ بْنُ زَكَرِيَّا قَالَ‏:‏ حَدَّثَنِي بُرَيْدُ بْنُ عَبْدِ اللهِ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى قَالَ‏:‏ سَمِعَ النَّبِيُّ صلى الله عليه وسلم رَجُلاً يُثْنِي عَلَى رَجُلٍ وَيُطْرِيهِ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ أَهْلَكْتُمْ، أَوْ قَطَعْتُمْ، ظَهْرَ الرَّجُلِ‏.‏","english":{"narrator":"","text":"Abu Musa reported that the Prophet, may Allah bless him and grant\nhim peace, heard a man praise another man and he was using exaggeration\nin his praise of him. The Prophet, may Allah bless him and grant him peace,\nsaid, \"You have destroyed - or broken - the man's back.\""}},{"id":3,"idInBook":3,"chapterId":16,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا قَبِيصَةُ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنْ عِمْرَانَ بْنِ مُسْلِمٍ، عَنْ إِبْرَاهِيمَ التَّيْمِيِّ، عَنْ أَبِيهِ قَالَ‏:‏ كُنَّا جُلُوسًا عِنْدَ عُمَرَ، فَأَثْنَى رَجُلٌ عَلَى رَجُلٍ فِي وَجْهِهِ، فَقَالَ‏:‏ عَقَرْتَ الرَّجُلَ، عَقَرَكَ اللَّهُ‏.‏","english":{"narrator":"","text":"Ibrahim at-Taymi reported that his father said, \"We were sitting\nwith 'Umar and one man praised another man to his face.\" He said, \"You\nhave wounded the man. May Allah wound you.\""}},{"id":4,"idInBook":4,"chapterId":16,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ السَّلامِ، قَالَ‏:‏ حَدَّثَنَا حَفْصٌ، عَنْ عُبَيْدِ اللهِ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَبِيهِ قَالَ‏:‏ سَمِعْتُ عُمَرَ يَقُولُ‏:‏ الْمَدْحُ ذَبْحٌ، قَالَ مُحَمَّدٌ‏:‏ يَعْنِي إِذَا قَبِلَهَا‏.‏","english":{"narrator":"","text":"Zayd ibn Aslam reported that his father heard 'Umar state, \"Praise\nis slaughter.\" The transmitter added, \"He meant when it is accepted.\""}},{"id":5,"idInBook":5,"chapterId":16,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللهِ قَالَ‏:‏ حَدَّثَنِي عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ‏:‏ نِعْمَ الرَّجُلُ أَبُو بَكْرٍ، نِعْمَ الرَّجُلُ عُمَرُ، نِعْمَ الرَّجُلُ أَبُو عُبَيْدَةَ، نِعْمَ الرَّجُلُ أُسَيْدُ بْنُ حُضَيْرٍ، نِعْمَ الرَّجُلُ ثَابِتُ بْنُ قَيْسِ بْنِ شَمَّاسٍ، نِعْمَ الرَّجُلُ مُعَاذُ بْنُ عَمْرِو بْنِ الْجَمُوحِ، نِعْمَ الرَّجُلُ مُعَاذُ بْنُ جَبَلٍ، قَالَ‏:‏ وَبِئْسَ الرَّجُلُ فُلاَنٌ، وَبِئْسَ الرَّجُلُ فُلاَنٌ حَتَّى عَدَّ سَبْعَةً‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"The best of men is Abu Bakr. The best of men is\n'Umar. The best of men is Abu 'Ubayda. The best of men is Usayd ibn Hudayr.\nThe best of men is Thabit ibn Qays ibn Shammas. The best of men is Mu'adh\nibn 'Amr ibn al-Jamuh. The best of men is Mu'adh ibn Jabal.\" Then he said,\n\"The worst of men is so-and-so. The worst of men is so-and-so,\" until he\nhad named seven men."}},{"id":6,"idInBook":6,"chapterId":16,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا إِبْرَاهِيمُ، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ فُلَيْحٍ، قَالَ‏:‏ حَدَّثَنَا أَبِي، عَنْ عَبْدِ اللهِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي يُونُسَ مَوْلَى عَائِشَةَ، أَنَّ عَائِشَةَ قَالَتِ‏:‏ اسْتَأْذَنَ رَجُلٌ عَلَى رَسُولِ اللهِ صلى الله عليه وسلم، فَقَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ بِئْسَ ابْنُ الْعَشِيرَةِ، فَلَمَّا دَخَلَ هَشَّ لَهُ وَانْبَسَطَ إِلَيْهِ، فَلَمَّا خَرَجَ الرَّجُلُ اسْتَأْذَنَ آخَرُ، قَالَ‏:‏ نِعْمَ ابْنُ الْعَشِيرَةِ، فَلَمَّا دَخَلَ لَمْ يَنْبَسِطْ إِلَيْهِ كَمَا انْبَسَطَ إِلَى الْآخَرِ، وَلَمْ يَهِشَّ إِلَيْهِ كَمَا هَشَّ لِلْآخَرِ، فَلَمَّا خَرَجَ قُلْتُ‏:‏ يَا رَسُولَ اللهِ، قُلْتُ لِفُلاَنٍ مَا قُلْتَ ثُمَّ هَشَشْتَ إِلَيْهِ، وَقُلْتَ لِفُلاَنٍ مَا قُلْتَ وَلَمْ أَرَكَ صَنَعْتَ مِثْلَهُ‏؟‏ قَالَ‏:‏ يَا عَائِشَةُ، إِنَّ مِنْ شَرِّ النَّاسِ مَنِ اتُّقِيَ لِفُحْشِهِ‏.‏","english":{"narrator":"","text":"'A'isha said, \"A man asked permission to come to the Messenger\nof Allah, may Allah bless him and grant him peace, and the Messenger of\nAllah said, 'He is an evil son of his tribe.' When the man came in, the\nProphet was courteous and cheerful towards him. When that man left, another\nman asked permission to come in. He said, 'He is an excellent son of his\ntribe.' When he came in, he was not cheerful towards him as he had been\ncheerful towards the other man. When he left, I said, 'Messenger of Allah,\nyou said what you said about so-and-so and yet you were courteous to him.\nYou said what you said about so-and-so and I did not see you do the same.'\nHe said, ''A'isha, the worst of people are those who are feared on account\nof their bad language.'\""}},{"id":7,"idInBook":7,"chapterId":16,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللهِ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ بْنُ سَعِيدٍ، عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، عَنْ مُجَاهِدٍ، عَنْ أَبِي مَعْمَرٍ قَالَ‏:‏ قَامَ رَجُلٌ يُثْنِي عَلَى أَمِيرٍ مِنَ الأُمَرَاءِ، فَجَعَلَ الْمِقْدَادُ يَحْثِي فِي وَجْهِهِ التُّرَابَ، وَقَالَ‏:‏ أَمَرَنَا رَسُولُ اللهِ صلى الله عليه وسلم أَنْ نَحْثِيَ فِي وُجُوهِ الْمَدَّاحِينَ التُّرَابَ‏.‏","english":{"narrator":"","text":"Abu Ma'mar said, \"A man began to praise one of the amirs. Al-Miqdad\nbegan to throw dirt in his face and said, 'The Messenger of Allah, may\nAllah bless him and grant him peace, commanded us to throw dust into the\nfaces of those who praise people.'\""}},{"id":8,"idInBook":8,"chapterId":16,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ‏:‏ حَدَّثَنَا حَمَّادٌ، عَنْ عَلِيِّ بْنِ الْحَكَمِ، عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ، أَنَّ رَجُلاً كَانَ يَمْدَحُ رَجُلاً عِنْدَ ابْنِ عُمَرَ فَجَعَلَ ابْنُ عُمَرَ يَحْثُو التُّرَابَ نَحْوَ فِيهِ، وَقَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ إِذَا رَأَيْتُمُ الْمَدَّاحِينَ فَاحْثُوا فِي وُجُوهِهِمُ التُّرَابَ‏.‏","english":{"narrator":"","text":"'Ata' ibn Abi Rabah reported that a man was praising another man\nin the presence of Ibn 'Umar. Ibn 'Umar began to throw dust towards his\nmouth. He said, \"The Messenger of Allah, may Allah bless him and grant\nhim peace, said, 'When you see those who praise people, throw dust in their\nfaces.'\""}},{"id":9,"idInBook":9,"chapterId":16,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا مُوسَى، قَالَ‏:‏ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ عَبْدِ اللهِ بْنِ شَقِيقٍ، عَنْ رَجَاءِ بْنِ أَبِي رَجَاءٍ، عَنْ مِحْجَنٍ الأَسْلَمِيِّ قَالَ رَجَاءٌ‏:‏ أَقْبَلْتُ مَعَ مِحْجَنٍ ذَاتَ يَوْمٍ حَتَّى انْتَهَيْنَا إِلَى مَسْجِدِ أَهْلِ الْبَصْرَةِ، فَإِذَا بُرَيْدَةُ الأَسْلَمِيُّ عَلَى بَابٍ مِنْ أَبْوَابِ الْمَسْجِدِ جَالِسٌ، قَالَ‏:‏ وَكَانَ فِي الْمَسْجِدِ رَجُلٌ يُقَالُ لَهُ‏:‏ سُكْبَةُ، يُطِيلُ الصَّلاَةَ، فَلَمَّا انْتَهَيْنَا إِلَى بَابِ الْمَسْجِدِ، وَعَلَيْهِ بُرْدَةٌ، وَكَانَ بُرَيْدَةُ صَاحِبَ مُزَاحَاتٍ، فَقَالَ‏:‏ يَا مِحْجَنُ أَتُصَلِّي كَمَا يُصَلِّي سُكْبَةُ‏؟‏ فَلَمْ يَرُدَّ عَلَيْهِ مِحْجَنٌ، وَرَجَعَ، قَالَ‏:‏ قَالَ مِحْجَنٌ‏:‏ إِنَّ رَسُولَ اللهِ صلى الله عليه وسلم أَخَذَ بِيَدِي، فَانْطَلَقْنَا نَمْشِي حَتَّى صَعِدْنَا أُحُدًا، فَأَشْرَفَ عَلَى الْمَدِينَةِ فَقَالَ‏:‏ وَيْلُ أُمِّهَا مِنْ قَرْيَةٍ، يَتْرُكُهَا أَهْلُهَا كَأَعْمَرَ مَا تَكُونُ، يَأْتِيهَا الدَّجَّالُ، فَيَجِدُ عَلَى كُلِّ بَابٍ مِنْ أَبْوَابِهَا مَلَكًا، فَلاَ يَدْخُلُهَا، ثُمَّ انْحَدَرَ حَتَّى إِذَا كُنَّا فِي الْمَسْجِدِ، رَأَى رَسُولُ اللهِ صلى الله عليه وسلم رَجُلاً يُصَلِّي، وَيَسْجُدُ، وَيَرْكَعُ، فَقَالَ لِي رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ مَنْ هَذَا‏؟‏ فَأَخَذْتُ أُطْرِيهِ، فَقُلْتُ‏:‏ يَا رَسُولَ اللهِ، هَذَا فُلاَنٌ، وَهَذَا‏.‏ فَقَالَ أَمْسِكْ، لاَ تُسْمِعْهُ فَتُهْلِكَهُ، قَالَ‏:‏ فَانْطَلَقَ يَمْشِي، حَتَّى إِذَا كَانَ عِنْدَ حُجَرِهِ، لَكِنَّهُ نَفَضَ يَدَيْهِ ثُمَّ قَالَ‏:‏ إِنَّ خَيْرَ دِينِكُمْ أَيْسَرُهُ، إِنَّ خَيْرَ دِينِكُمْ أَيْسَرُهُ ثَلاثًا‏.‏","english":{"narrator":"","text":"Raja' said. \"One day Mihjan and I went to the mosque of the people\nof Basra. Burayda al-Aslami was sitting there by one of the mosque doors.\nInside the mosque there was a man called Sabka who used to make the prayers\nlong. We came to the mosque door which had a fringed woollen cloth over\nit. Now Burayda was someone who made jokes. He said, 'Mihjan, don't you\npray as Sabka prays?' Mihjan did not answer and went back. Mihjan said,\n'The Messenger of Allah, may Allah bless him and grant him peace, once\ntook me by the hand and we went together to the top of Uhud. He looked\ndown on Madina and said, \"Woe to a town whose people will abandon it when\nit becomes very prosperous. Then the Dajjal will come to it and find two\nangels at each of its gates, so he will not enter it.\" Then he went down\nuntil we reached the mosque and the Messenger of Allah, may Allah bless\nhim and grant him peace, saw a man praying, prostrating and bowing. The\nMessenger of Allah, may Allah bless him and grant him peace, asked me,\n\"Who is this?\" and I began to praise him, saying, \"Messenger of Allah,\nthis is so-and-so and so-and-so.\" \"Stop!\" he said, \"Do not let him hear\nor you will destroy him.\"'\""}},{"id":10,"idInBook":10,"chapterId":16,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا حَجَّاجٌ، قَالَ‏:‏ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ عَلِيِّ بْنِ زَيْدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرَةَ، عَنِ الأَسْوَدِ بْنِ سَرِيعٍ قَالَ‏:‏ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فَقُلْتُ‏:‏ يَا رَسُولَ اللهِ، قَدْ مَدَحْتُ اللَّهَ بِمَحَامِدَ وَمِدَحٍ، وَإِيَّاكَ‏.‏ فَقَالَ‏:‏ أَمَا إِنَّ رَبَّكَ يُحِبُّ الْحَمْدَ، فَجَعَلْتُ أُنْشِدُهُ، فَاسْتَأْذَنَ رَجُلٌ طُوَالٌ أَصْلَعُ، فَقَالَ لِيَ النَّبِيُّ صلى الله عليه وسلم‏:‏ اسْكُتْ، فَدَخَلَ، فَتَكَلَّمَ سَاعَةً ثُمَّ خَرَجَ، فَأَنْشَدْتُهُ، ثُمَّ جَاءَ فَسَكَّتَنِي، ثُمَّ خَرَجَ، فَعَلَ ذَلِكَ مَرَّتَيْنِ أَوْ ثَلاَثًا، فَقُلْتُ‏:‏ مَنْ هَذَا الَّذِي سَكَّتَّنِي لَهُ‏؟‏ قَالَ‏:‏ هَذَا رَجُلٌ لاَ يُحِبُّ الْبَاطِلَ‏.‏","english":{"narrator":"","text":"Al-Aswad ibn Suray' said, \"I came to the Prophet, may Allah bless\nhim and grant him peace, and said, 'Messenger of Allah, I have praised\nAllah and you in poems of praise and eulogies.' He said, 'As far as your\nLord is concerned, He must be praised,' and so I began to recite them.\nThen a tall bald man asked for permission to enter. The Prophet, may Allah\nbless him and grant him peace, told me, 'Be silent.' The man came in and\nspoke for a time and then left. Then I recited again. Then the other man\ncame back and he made be silent again. Then the man left again. That happened\ntwo or three times. I asked, 'Who is this man for whom I must be silent?'\nHe replied, 'This is a man who does not like vain things.'\""}},{"id":11,"idInBook":11,"chapterId":16,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا عَلِيٌّ، قَالَ‏:‏ حَدَّثَنَا زَيْدُ بْنُ حُبَابٍ، قَالَ‏:‏ حَدَّثَنَا يُوسُفُ بْنُ عَبْدِ اللهِ بْنِ نُجَيْدِ بْنِ عِمْرَانَ بْنِ حُصَيْنٍ الْخُزَاعِيُّ قَالَ‏:‏ حَدَّثَنِي أَبِي نُجَيْدٌ، أَنَّ شَاعِرًا جَاءَ إِلَى عِمْرَانَ بْنِ حُصَيْنٍ فَأَعْطَاهُ، فَقِيلَ لَهُ‏:‏ تُعْطِي شَاعِرًا‏؟‏ فَقَالَ‏:‏ أُبْقِي عَلَى عِرْضِي‏.‏","english":{"narrator":"","text":"Abu Nujayd said, \"A poet came to 'Imran ibn Husayn and 'Imran gave\nhim something. 'Imran was asked, 'You give to a poet?' He said, 'I am preserving\nmy reputation (from his satire).'\""}}],"chapter":{"id":16,"bookId":15,"arabic":"كتاب المدح","english":"Praise"}}