{"metadata":{"length":10,"arabic":{"title":"الأدب المفرد","author":"الإمام محمد بن إسماعيل البخاري","introduction":"كتاب الزِّيَارَةِ"},"english":{"title":"Al-Adab Al-Mufrad","author":"Imam Muhammad ibn Ismail al-Bukhari","introduction":"Visitation"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":17,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ‏:‏ حَدَّثَنَا مُعَاذٌ، قَالَ‏:‏ حَدَّثَنَا ابْنُ عَوْنٍ، عَنْ مُحَمَّدٍ قَالَ‏:‏ كَانُوا يَقُولُونَ‏:‏ لاَ تُكْرِمْ صَدِيقَكَ بِمَا يَشُقُّ عَلَيْهِ‏.‏","english":{"narrator":"","text":"Ibn 'Awn reported, \"They used to say, 'Do not honour your guest\nin a way which will be burdensome for him.'\""}},{"id":2,"idInBook":2,"chapterId":17,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ اللهِ بْنُ عُثْمَانَ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ اللهِ بْنُ الْمُبَارَكِ، أَخْبَرَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ أَبِي سِنَانٍ الشَّامِيِّ، عَنْ عُثْمَانَ بْنِ أَبِي سَوْدَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ إِذَا عَادَ الرَّجُلُ أَخَاهُ أَوْ زَارَهُ، قَالَ اللَّهُ لَهُ‏:‏ طِبْتَ وَطَابَ مَمْشَاكَ، وَتَبَوَّأْتَ مَنْزِلاً فِي الْجَنَّةِ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"When a man visits his brothers, Allah tells him,\n'You have been good and your evening will be good and you can take your\nplace in the Garden.'\""}},{"id":3,"idInBook":3,"chapterId":17,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا بِشْرُ بْنُ مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ اللهِ بْنُ الْمُبَارَكِ، عَنِ ابْنِ شَوْذَبٍ قَالَ‏:‏ سَمِعْتُ مَالِكَ بْنَ دِينَارٍ يُحَدِّثُ، عَنْ أَبِي غَالِبٍ، عَنْ أُمِّ الدَّرْدَاءِ قَالَتْ‏:‏ زَارَنَا سَلْمَانُ مِنَ الْمَدَائِنِ إِلَى الشَّامِ مَاشِيًا، وَعَلَيْهِ كِسَاءٌ وَانْدَرْوَرْدُ، قَالَ‏:‏ يَعْنِي سَرَاوِيلَ مُشَمَّرَةً، قَالَ ابْنُ شَوْذَبٍ‏:‏ رُؤِيَ سَلْمَانُ وَعَلَيْهِ كِسَاءٌ مَطْمُومُ الرَّأْسِ سَاقِطُ الأُذُنَيْنِ، يَعْنِي أَنَّهُ كَانَ أَرْفَشَ‏.‏ فَقِيلَ لَهُ‏:‏ شَوَّهْتَ نَفْسَكَ، قَالَ‏:‏ إِنَّ الْخَيْرَ خَيْرُ الاخِرَةِ‏.‏","english":{"narrator":"","text":"Umm ad-Darda' said, \"Salman came from al-Mada'in (Ctesiphon) to\nSyria to visit us on foot wearing a shirt (kisa') and trousers.\" Shawdhab\nsaid, \"Salman was seen wearing a short with all his hair shaved off and\nhis large ears showing. He was told, 'You have made yourself ugly.' He\nreplied, \"The real good is the good of the Next World.'\""}},{"id":4,"idInBook":4,"chapterId":17,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ سَلامٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْوَهَّابِ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ أَنَسِ بْنِ سِيرِينَ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم زَارَ أَهْلَ بَيْتٍ مِنَ الأَنْصَارِ، فَطَعِمَ عِنْدَهُمْ طَعَامًا، فَلَمَّا خَرَجَ أَمَرَ بِمَكَانٍ مِنَ الْبَيْتِ، فَنُضِحَ لَهُ عَلَى بِسَاطٍ، فَصَلَّى عَلَيْهِ، وَدَعَا لَهُمْ‏.‏","english":{"narrator":"","text":"Anas ibn Malik reported that the Messenger of Allah, may Allah\nbless him and grant him peace, visited one of the houses of the Ansar and\nate some food with them. When he left, he asked for a place in the house\nand some water was sprinkled on a carpet for him. He prayed on it and made\nsupplication for them."}},{"id":5,"idInBook":5,"chapterId":17,"bookId":15,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ‏:‏ حَدَّثَنَا صَالِحُ بْنُ عُمَرَ الْوَاسِطِيُّ، عَنْ أَبِي خَلْدَةَ قَالَ‏:‏ جَاءَ عَبْدُ الْكَرِيمِ أَبُو أُمَيَّةَ إِلَى أَبِي الْعَالِيَةِ، وَعَلَيْهِ ثِيَابُ صُوفٍ، فَقَالَ أَبُو الْعَالِيَةِ‏:‏ إِنَّمَا هَذِهِ ثِيَابُ الرُّهْبَانِ، إِنْ كَانَ الْمُسْلِمُونَ إِذَا تَزَاوَرُوا تَجَمَّلُوا‏.‏","english":{"narrator":"","text":"'Abdulkarim Abu Umuyyah came to Abu Al'aliyah and on him were wool clothes. So Abu Al'aliyah said \"These are but the clothes of monks, as the Muslims, when visiting each other, would beautify themselves.‏\""}},{"id":6,"idInBook":6,"chapterId":17,"bookId":15,"arabic":"حَدَّثَنَا مُسَدَّدٌ ، عَنْ يَحْيَى ، عَنْ عَبْدِ الْمَلِكِ الْعَرْزَمِيِّ ، قَالَ : حَدَّثَنَا عَبْدُ اللَّهِ مَوْلَى أَسْمَاءَ ، قَالَ : \" أَخْرَجَتْ إِلَيَّ أَسْمَاءُ جُبَّةً مِنْ طَيَالِسَةٍ عَلَيْهَا لَبِنَةُ شِبْرٍ مِنْ دِيبَاجٍ ، وَإِنَّ فَرْجَيْهَا مَكْفُوفَانِ بِهِ ، فَقَالَتْ : هَذِهِ جُبَّةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، كَانَ يَلْبَسُهَا لِلْوُفُودِ ، وَيَوْمَ الْجُمُعَةِ.","english":{"narrator":"","text":"'Abdullah, the client of Asma', said, \"Asma' brought out to me a cloak of Tayalisah (a type of mantle) which had a collar border a span (wide) of brocade and verily it's two openings were hemmed with it (i.e. brocade). She said,\n'This is the of the cloak of the Messenger of Allah, may Allah bless him and grant him peace. He used to wear it for delegations and on Jumu'a.' \""}},{"id":7,"idInBook":7,"chapterId":17,"bookId":15,"arabic":"حَدَّثَنَا الْمَكِّيُّ، قَالَ‏:‏ حَدَّثَنَا حَنْظَلَةُ، عَنْ سَالِمِ بْنِ عَبْدِ اللهِ قَالَ‏:‏ سَمِعْتُ عَبْدَ اللهِ بْنَ عُمَرَ قَالَ‏:‏ وَجَدَ عُمَرُ حُلَّةَ إِسْتَبْرَقٍ، فَأَتَى بِهَا النَّبِيَّ صلى الله عليه وسلم فَقَالَ‏:‏ اشْتَرِ هَذِهِ، وَالْبَسْهَا عِنْدَ الْجُمُعَةِ، أَوْ حِينَ تَقْدِمُ عَلَيْكَ الْوُفُودُ، فَقَالَ عَلَيْهِ الصَّلاَةُ وَالسَّلاَمُ‏:‏ إِنَّمَا يَلْبَسُهَا مَنْ لاَ خَلاَقَ لَهُ فِي الْآخِرَةِ، وَأُتِيَ رَسُولُ اللهِ صلى الله عليه وسلم بِحُلَلٍ، فَأَرْسَلَ إِلَى عُمَرَ بِحُلَّةٍ، وَإِلَى أُسَامَةَ بِحُلَّةٍ، وَإِلَى عَلِيٍّ بِحُلَّةٍ، فَقَالَ عُمَرُ‏:‏ يَا رَسُولَ اللهِ، أَرْسَلْتَ بِهَا إِلَيَّ، لَقَدْ سَمِعْتُكَ تَقُولُ فِيهَا مَا قُلْتَ‏؟‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ تَبِيعُهَا، أَوْ تَقْضِي بِهَا حَاجَتَكَ‏.‏","english":{"narrator":"","text":"'Abdullah ibn 'Umar said, \"'Umar found a silk robe and brought\nit to the Prophet, may Allah bless him and grant him peace, and said, 'Buy\nthis and wear it on Jumu'ah and when delegations come to you.' The Prophet,\npeace be upon him, replied, 'Only someone who has no portion in the Next\nWorld wears this.' Then the Messenger of Allah, may Allah bless him and\ngrant him peace, was brought some robes and sent one robe to 'Umar, one\nto Usama, and one to 'Ali. 'Umar said, 'Messenger of Allah! You have sent\nthis to me when I heard you say what you said about it.' The Prophet, may\nAllah bless him and grant him peace, said, 'You can sell it or take care\nof your needs with it.'\""}},{"id":8,"idInBook":8,"chapterId":17,"bookId":15,"arabic":"حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، وَمُوسَى بْنُ إِسْمَاعِيلَ، قَالاَ‏:‏ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ، عَنْ أَبِي رَافِعٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ زَارَ رَجُلٌ أَخًا لَهُ فِي قَرْيَةٍ، فَأَرْصَدَ اللَّهُ لَهُ مَلَكًا عَلَى مَدْرَجَتِهِ، فَقَالَ‏:‏ أَيْنَ تُرِيدُ‏؟‏ قَالَ‏:‏ أَخًا لِي فِي هَذِهِ الْقَرْيَةِ، فَقَالَ‏:‏ هَلْ لَهُ عَلَيْكَ مِنْ نِعْمَةٍ تَرُبُّهَا‏؟‏ قَالَ‏:‏ لاَ، إِنِّي أُحِبُّهُ فِي اللهِ، قَالَ‏:‏ فَإِنِّي رَسُولُ اللهِ إِلَيْكَ، أَنَّ اللَّهَ أَحَبَّكَ كَمَا أَحْبَبْتَهُ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"A man visited a brother of his in a village, so\nAllah put an angel in wait for him on the road. He asked, 'Where are you\ngoing?' He replied, 'To a brother of mine in this village.' He said, 'Is\nhe responsible for some blessing you have?' He said, 'No, I love him for\nAllah.' He said, 'I am a messenger of Allah to you. Allah loves you as\nyou love him.'\""}},{"id":9,"idInBook":9,"chapterId":17,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ مَسْلَمَةَ، قَالَ‏:‏ حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ، عَنْ حُمَيْدِ بْنِ هِلاَلٍ، عَنْ عَبْدِ اللهِ بْنِ الصَّامِتِ، عَنْ أَبِي ذَرٍّ قُلْتُ‏:‏ يَا رَسُولَ اللهِ، الرَّجُلُ يُحِبُّ الْقَوْمَ وَلاَ يَسْتَطِيعُ أَنْ يَلْحَقَ بِعَمَلِهِمْ‏؟‏ قَالَ‏:‏ أَنْتَ يَا أَبَا ذَرٍّ مَعَ مَنْ أَحْبَبْتَ، قُلْتُ‏:‏ إِنِّي أُحِبُّ اللَّهَ وَرَسُولَهُ، قَالَ‏:‏ أَنْتَ مَعَ مَنْ أَحْبَبْتَ يَا أَبَا ذَرٍّ‏.‏","english":{"narrator":"","text":"Abu Dharr said, \"I asked, 'Messenger of Allah, what if a man loves\na people but cannot join them?' He replied, 'Abu Dharr, you are with the\none you love.' I said, 'I love Allah and His Messenger.' He said, 'Abu\nDharr, you are with the one you love.'\""}},{"id":10,"idInBook":10,"chapterId":17,"bookId":15,"arabic":"حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، قَالَ‏:‏ حَدَّثَنَا هِشَامٌ، قَالَ‏:‏ حَدَّثَنَا قَتَادَةُ، عَنْ أَنَسٍ، أَنَّ رَجُلاً سَأَلَ النَّبِيَّ صلى الله عليه وسلم فَقَالَ‏:‏ يَا نَبِيَّ اللهِ، مَتَى السَّاعَةُ‏؟‏ فَقَالَ‏:‏ وَمَا أَعْدَدْتَ لَهَا‏؟‏ قَالَ‏:‏ مَا أَعْدَدْتُ مِنْ كَبِيرٍ، إِلاَّ أَنِّي أُحِبُّ اللَّهَ وَرَسُولَهُ، فَقَالَ‏:‏ الْمَرْءُ مَعَ مَنْ أَحَبَّ‏.‏","english":{"narrator":"","text":"Anas reported that a man asked the Prophet, may Allah bless him\nand grant him peace, \"Prophet of Allah, when will the Final Hour come?\"\nHe said, \"Have you not made preparation for it?\" He replied, \" I am not\nprepared for a terrible event , but I love Allah and His Messenger.\" He\nsaid, \"A man is with the one he loves.\""}}],"chapter":{"id":17,"bookId":15,"arabic":"كتاب الزِّيَارَةِ","english":"Visitation"}}