{"metadata":{"length":10,"arabic":{"title":"الأدب المفرد","author":"الإمام محمد بن إسماعيل البخاري","introduction":"كتاب الصَّغِيرِ"},"english":{"title":"Al-Adab Al-Mufrad","author":"Imam Muhammad ibn Ismail al-Bukhari","introduction":"Children"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":19,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْعَزِيزِ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ كَانَ رَسُولُ اللهِ صلى الله عليه وسلم إِذَا أُتِيَ بِالزَّهْوِ قَالَ‏:‏ اللَّهُمَّ بَارِكْ لَنَا فِي مَدِينَتِنَا وَمُدِّنَا، وَصَاعِنَا، بَرَكَةً مَعَ بَرَكَةٍ، ثُمَّ نَاوَلَهُ أَصْغَرَ مَنْ يَلِيهِ مِنَ الْوِلْدَانِ‏.‏","english":{"narrator":"","text":"Abu Hurayra said, \"When the Messenger of Allah, may Allah bless\nhim and grant him peace, was brought new dates, he said, 'O Allah! Bless\nus in our city and in our mudd and sa', blessing upon blessing.' Then he\nwould give one to the youngest of the children with him.\""}},{"id":2,"idInBook":2,"chapterId":19,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللهِ، حَدَّثَنِي ابْنُ أَبِي الزِّنَادِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم قَالَ‏:‏ لَيْسَ مِنَّا مَنْ لَمْ يَرْحَمْ صَغِيرَنَا، وَيَعْرِفْ حَقَّ كَبِيرِنَا‏.‏","english":{"narrator":"","text":"'Amr ibn Shu'ayb reported from his grandfather that the Messenger\nof Allah, may Allah bless him and grant him peace, said, \"Anyone who does\nnot show mercy to our children nor acknowledge the right of our old people\nis not one of us.\""}},{"id":3,"idInBook":3,"chapterId":19,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ صَالِحٍ، قَالَ‏:‏ حَدَّثَنَا مُعَاوِيَةُ بْنُ صَالِحٍ، عَنْ رَاشِدِ بْنِ سَعْدٍ، عَنْ يَعْلَى بْنِ مُرَّةَ أَنَّهُ قَالَ‏:‏ خَرَجْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم، وَدُعِينَا إِلَى طَعَامٍ فَإِذَا حُسَيْنٌ يَلْعَبُ فِي الطَّرِيقِ، فَأَسْرَعَ النَّبِيُّ صلى الله عليه وسلم أَمَامَ الْقَوْمِ، ثُمَّ بَسَطَ يَدَيْهِ، فَجَعَلَ يَمُرُّ مَرَّةً هَا هُنَا وَمَرَّةً هَا هُنَا، يُضَاحِكُهُ حَتَّى أَخَذَهُ، فَجَعَلَ إِحْدَى يَدَيْهِ فِي ذَقْنِهِ وَالأُخْرَى فِي رَأْسِهِ، ثُمَّ اعْتَنَقَهُ فَقَبَّلَهُ، ثُمَّ قَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ حُسَيْنٌ مِنِّي وَأَنَا مِنْهُ، أَحَبَّ اللَّهُ مَنْ أَحَبَّ الْحَسَنَ وَالْحُسَيْنَ، سَبِطَانِ مِنَ الأَسْبَاطِ‏.‏","english":{"narrator":"","text":"Ya'la ibn Murra said, \"We went out with the Prophet, may Allah\nbless him and grant him peace, and we were invited to eat. Husayn was playing\nin the road and the Prophet, may Allah bless him and grant him peace, raced\nthe people and then spread out his arms. The boy began to run this way\nand that and the Prophet made him laugh until he caught hold of him. He\nput one of his hands under his chin and the other on his head and then\nembraced him. Then the Prophet, may Allah bless him and grant him peace,\nsaid, 'Husayn is from me and I am from Husayn. Allah loves anyone who loves al-Hasan and\nal-Husayn. They are two of my distinguished descendants.'\""}},{"id":4,"idInBook":4,"chapterId":19,"bookId":15,"arabic":"حَدَّثَنَا أَصْبَغُ قَالَ‏:‏ أَخْبَرَنِي ابْنُ وَهْبٍ قَالَ‏:‏ أَخْبَرَنِي مَخْرَمَةُ بْنُ بُكَيْرٍ، عَنْ أَبِيهِ، أَنَّهُ رَأَى عَبْدَ اللهِ بْنَ جَعْفَرٍ يُقَبِّلُ زَيْنَبَ بِنْتَ عُمَرَ بْنِ أَبِي سَلَمَةَ، وَهِيَ ابْنَةُ سَنَتَيْنِ أَوْ نَحْوَهُ‏.‏","english":{"narrator":"","text":"Bukayr reported that he saw 'Abdullah ibn Ja'far kissing Zaynab,\nthe daughter of 'Umar ibn Abi Salama when she was about two years old."}},{"id":5,"idInBook":5,"chapterId":19,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى، قَالَ‏:‏ أَخْبَرَنَا الرَّبِيعُ بْنُ عَبْدِ اللهِ بْنِ خُطَّافٍ، عَنْ حَفْصٍ، عَنِ الْحَسَنِ قَالَ‏:‏ إِنِ اسْتَطَعْتَ أَنْ لاَ تَنْظُرَ إِلَى شَعْرِ أَحَدٍ مِنْ أَهْلِكَ، إِلاَّ أَنْ يَكُونَ أَهْلَكَ أَوْ صَبِيَّةً، فَافْعَلْ‏.‏","english":{"narrator":"","text":"Al-Hasan said, \"If you avoid looking at the hair of anyone in your\nfamily except your wife or a little girl, then do so.\""}},{"id":6,"idInBook":6,"chapterId":19,"bookId":15,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ‏:‏ حَدَّثَنَا يَحْيَى بْنُ أَبِي الْهَيْثَمِ الْعَطَّارُ قَالَ‏:‏ حَدَّثَنِي يُوسُفُ بْنُ عَبْدِ اللهِ بْنِ سَلاَّمٍ قَالَ‏:‏ سَمَّانِي رَسُولُ اللهِ صلى الله عليه وسلم يُوسُفَ، وَأَقْعَدَنِي عَلَى حِجْرِهِ، وَمَسَحَ عَلَى رَأْسِي‏.‏","english":{"narrator":"","text":"Yusuf ibn 'Abdullah ibn Sallam said, \"The Messenger of Allah, may\nAllah bless him and grant him peace, named me Yusuf and let me sit in his\nroom and stroked my head.\""}},{"id":7,"idInBook":7,"chapterId":19,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلامٍ، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ خَازِمٍ، قَالَ‏:‏ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ قَالَتْ‏:‏ كُنْتُ أَلْعَبُ بِالْبَنَاتِ عِنْدَ النَّبِيِّ صلى الله عليه وسلم، وَكَانَ لِي صَوَاحِبُ يَلْعَبْنَ مَعِي، فَكَانَ رَسُولُ اللهِ صلى الله عليه وسلم إِذَا دَخَلَ يَنْقَمِعْنَ مِنْهُ، فَيُسَرِّبُهُنَّ إِلَيَّ، فَيَلْعَبْنَ مَعِي‏.‏","english":{"narrator":"","text":"'A'isha said, \"I used to play with dolls in the presence of the\nProphet, may Allah bless him and grant him peace, and my friends would\nplay with me. When the Messenger of Allah, may Allah bless him and grant\nhim peace, entered, they would hide from him and he would call them to\njoin me and they would play with me.\""}},{"id":8,"idInBook":8,"chapterId":19,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ سَعِيدٍ، قَالَ‏:‏ حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ حُمَيْدِ بْنِ أَبِي غَنِيَّةَ، عَنْ أَبِيهِ، عَنْ أَبِي الْعَجْلاَنِ الْمُحَارِبِيِّ قَالَ‏:‏ كُنْتُ فِي جَيْشِ ابْنِ الزُّبَيْرِ، فَتُوُفِّيَ ابْنُ عَمٍّ لِي، وَأَوْصَى بِجَمَلٍ لَهُ فِي سَبِيلِ اللهِ، فَقُلْتُ لِابْنِهِ‏:‏ ادْفَعْ إِلَيَّ الْجَمَلَ، فَإِنِّي فِي جَيْشِ ابْنِ الزُّبَيْرِ، فَقَالَ‏:‏ اذْهَبْ بِنَا إِلَى ابْنِ عُمَرَ حَتَّى نَسْأَلَهُ، فَأَتَيْنَا ابْنَ عُمَرَ، فَقَالَ‏:‏ يَا أَبَا عَبْدِ الرَّحْمَنِ، إِنَّ وَالِدِي تُوُفِّيَ، وَأَوْصَى بِجَمَلٍ لَهُ فِي سَبِيلِ اللهِ، وَهَذَا ابْنُ عَمِّي، وَهُوَ فِي جَيْشِ ابْنِ الزُّبَيْرِ، أَفَأَدْفَعُ إِلَيْهِ الْجَمَلَ‏؟‏ قَالَ ابْنُ عُمَرَ‏:‏ يَا بُنَيَّ، إِنَّ سَبِيلَ اللهِ كُلُّ عَمَلٍ صَالِحٍ، فَإِنْ كَانَ وَالِدُكَ إِنَّمَا أَوْصَى بِجَمَلِهِ فِي سَبِيلِ اللهِ عَزَّ وَجَلَّ، فَإِذَا رَأَيْتَ قَوْمًا مُسْلِمِينَ يَغْزُونَ قَوْمًا مِنَ الْمُشْرِكِينَ، فَادْفَعْ إِلَيْهِمُ الْجَمَلَ، فَإِنْ هَذَا وَأَصْحَابَهُ فِي سَبِيلِ غِلْمَانِ قَوْمٍ أَيُّهُمْ يَضَعُ الطَّابَعَ‏.‏","english":{"narrator":"","text":"Abu'l-'Ajlan al-Muharibi said, \"While I was in the army of Ibn\naz-Zubayr, a cousin of mine died and bequeathed one of his camels to be\nused in the Cause of Allah. I told his son, 'Give me the camel since I\nwas in the army of Ibn az-Zubayr.' He replied, 'Let us go to Ibn 'Umar\nand ask him about the matter.' We went to Ibn 'Umar and he said, 'Abu 'Abdu'r-Rahman,\nmy father died and bequeathed one of his camels to be used in the Cause\nof Allah. This is my cousin who is in the army of Ibn az-Zubayr. Shall\nI give him the camel?' Ibn 'Umar replied, 'My son, the Cause of Allah includes\nevery good action. if you father left his camel to be devoted to the Cause\nof Allah, I see that there are Muslim people who are carrying out expeditions\nagainst the idolaters, so give the camel to them. This man (Abu'l-'Ajlan)\nand his companions are sons of a people who wish to use the seal (i.e.\nthe seal authority, meaning to rule the people.).'\""}},{"id":9,"idInBook":9,"chapterId":19,"bookId":15,"arabic":"حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، قَالَ‏:‏ حَدَّثَنَا أَبِي، قَالَ‏:‏ حَدَّثَنَا الأَعْمَشُ قَالَ‏:‏ حَدَّثَنِي زَيْدُ بْنُ وَهْبٍ قَالَ‏:‏ سَمِعْتُ جَرِيرًا، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ مَنْ لاَ يَرْحَمِ النَّاسَ لاَ يَرْحَمْهُ اللَّهُ عَزَّ وَجَلَّ‏.‏","english":{"narrator":"","text":"Jarir reported that the Prophet, may Allah bless him and grant\nhim peace, said, \"Allah Almighty will not show mercy to the person who\ndoes not show mercy to other people.\""}},{"id":10,"idInBook":10,"chapterId":19,"bookId":15,"arabic":"حَدَّثَنَا حَجَّاجٌ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ قَالَ‏:‏ أَخْبَرَنِي عَبْدُ الْمَلِكِ قَالَ‏:‏ سَمِعْتُ قَبِيصَةَ بْنَ جَابِرٍ قَالَ‏:‏ سَمِعْتُ عُمَرَ، أَنَّهُ قَالَ‏:‏ مَنْ لاَ يَرْحَمُ لاَ يُرْحَمُ، وَلاَ يُغْفَرُ مَنْ لاَ يَغْفِرُ، وَلاَ يُعْفَ عَمَّنْ لَمْ يَعْفُ، وَلاَ يُوقَّ مَنْ لا يَتَوَقَّ‏.‏","english":{"narrator":"","text":"'Umar was heard to say, \"Anyone who does not show mercy will not\nbe shown mercy. Anyone who does not forgive will not be forgiven. Anyone\nwho does not pardon will not be pardoned or protected.\""}}],"chapter":{"id":19,"bookId":15,"arabic":"كتاب الصَّغِيرِ","english":"Children"}}