{"metadata":{"length":27,"arabic":{"title":"الأدب المفرد","author":"الإمام محمد بن إسماعيل البخاري","introduction":"كتاب صِلَةِ الرَّحِمِ"},"english":{"title":"Al-Adab Al-Mufrad","author":"Imam Muhammad ibn Ismail al-Bukhari","introduction":"Ties of Kinship"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":2,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ‏:‏ حَدَّثَنَا ضَمْضَمُ بْنُ عَمْرٍو الْحَنَفِيُّ، قَالَ‏:‏ حَدَّثَنَا كُلَيْبُ بْنُ مَنْفَعَةَ قَالَ‏:‏ قَالَ جَدِّي‏:‏ يَا رَسُولَ اللهِ، مَنْ أَبَرُّ‏؟‏ قَالَ‏:‏ أُمَّكَ وَأَبَاكَ، وَأُخْتَكَ وَأَخَاكَ، وَمَوْلاَكَ الَّذِي يَلِي ذَاكَ، حَقٌّ وَاجِبٌ، وَرَحِمٌ مَوْصُولَةٌ‏.‏","english":{"narrator":"","text":"Kulayb ibn Manfa'a reported that his grandfather asked, \"Messenger of\nAllah, towards whom should I be dutiful?\" He replied, \"Your mother, your\nfather, your sister and your brother. Then your mawla (client) has the next\nright against you and then your relatives who are connected.\""}},{"id":2,"idInBook":2,"chapterId":2,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ‏:‏ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ مُوسَى بْنِ طَلْحَةَ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ لَمَّا نَزَلَتْ هَذِهِ الْآيَةُ ‏{‏وَأَنْذِرْ عَشِيرَتَكَ الأَقْرَبِينَ‏}‏ قَامَ النَّبِيُّ صلى الله عليه وسلم فَنَادَى‏:‏ يَا بَنِي كَعْبِ بْنِ لُؤَيٍّ، أَنْقِذُوا أَنْفُسَكُمْ مِنَ النَّارِ‏.‏ يَا بَنِي عَبْدِ مَنَافٍ، أَنْقِذُوا أَنْفُسَكُمْ مِنَ النَّارِ‏.‏ يَا بَنِي هَاشِمٍ، أَنْقِذُوا أَنْفُسَكُمْ مِنَ النَّارِ‏.‏ يَا بَنِي عَبْدِ الْمُطَّلِبِ، أَنْقِذُوا أَنْفُسَكُمْ مِنَ النَّارِ‏.‏ يَا فَاطِمَةُ بِنْتَ مُحَمَّدٍ، أَنْقِذِي نَفْسَكِ مِنَ النَّارِ، فَإِنِّي لاَ أَمْلِكُ لَكِ مِنَ اللهِ شَيْئًا، غَيْرَ أَنَّ لَكُمْ رَحِمًا سَأَبُلُّهُمَا بِبِلاَلِهَا‏.‏","english":{"narrator":"","text":"Abu Hurayra said, \"When the following ayat was revealed ('Warn\nyour near relatives' (26:214)), the Prophet, may Allah bless him and\ngrant him peace, stood up and called out, saying, 'Banu Ka'b ibn Lu'ayy!\nSave yourselves from the Fire! Banu 'Abdu Manaf! Save yourselves from the\nFire! Banu Hashim! Save yourselves from the Fire! Banu 'Abdu'l-Muttalib!\nSave yourselves from the Fire! Fatima, daughter of Muhammad! Save yourselves\nfrom the Fire! I do not have anything for you in respect to Allah except\nfor the fact that you have ties of kinship.'\""}},{"id":3,"idInBook":3,"chapterId":2,"bookId":15,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ‏:‏ حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ بْنِ عَبْدِ اللهِ بْنِ مَوْهَبٍ قَالَ‏:‏ سَمِعْتُ مُوسَى بْنَ طَلْحَةَ يَذْكُرُ، عَنْ أَبِي أَيُّوبَ الأَنْصَارِيِّ، أَنَّ أَعْرَابِيًّا عَرَضَ عَلَى النَّبِيِّ صلى الله عليه وسلم فِي مَسِيرِهِ، فَقَالَ‏:‏ أَخْبِرْنِي مَا يُقَرِّبُنِي مِنَ الْجَنَّةِ، وَيُبَاعِدُنِي مِنَ النَّارِ‏؟‏ قَالَ‏:‏ تَعْبُدُ اللَّهَ وَلاَ تُشْرِكْ بِهِ شَيْئًا، وَتُقِيمُ الصَّلاَةَ، وَتُؤْتِي الزَّكَاةَ، وَتَصِلُ الرَّحِمَ‏.‏","english":{"narrator":"","text":"Abu Ayyub al-Ansari told him that a bedouin came to the Prophet, may\nAllah bless him and grant him peace, while he was travelling. He asked, \"Tell\nme what will bring me near to the Garden and keep me far from the Fire.\"\nHe replied, \"Worship Allah and do not associate anything with Him, perform\nthe prayer, pay zakat, and maintain ties of kinship.\""}},{"id":4,"idInBook":4,"chapterId":2,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ قَالَ‏:‏ حَدَّثَنِي سُلَيْمَانُ بْنُ بِلاَلٍ، عَنْ مُعَاوِيَةَ بْنِ أَبِي مُزَرِّدٍ، عَنْ سَعِيدِ بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم قَالَ‏:‏ خَلَقَ اللَّهُ عَزَّ وَجَلَّ الْخَلْقَ، فَلَمَّا فَرَغَ مِنْهُ قَامَتِ الرَّحِمُ، فَقَالَ‏:‏ مَهْ، قَالَتْ‏:‏ هَذَا مَقَامُ الْعَائِذِ بِكَ مِنَ الْقَطِيعَةِ، قَالَ‏:‏ أَلاَ تَرْضَيْنَ أَنْ أَصِلَ مَنْ وَصَلَكِ، وَأَقْطَعَ مَنْ قَطَعَكِ‏؟‏ قَالَتْ‏:‏ بَلَى يَا رَبِّ، قَالَ‏:‏ فَذَلِكَ لَكِ ثُمَّ قَالَ أَبُو هُرَيْرَةَ‏:‏ اقْرَؤُوا إِنْ شِئْتُمْ‏:‏ ‏{‏فَهَلْ عَسَيْتُمْ إِنْ تَوَلَّيْتُمْ أَنْ تُفْسِدُوا فِي الأَرْضِ وَتُقَطِّعُوا أَرْحَامَكُمْ‏}‏‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Messenger of Allah, may Allah bless him\nand grant him peace, said, \"Allah Almighty created creation. When He had\nfinished it, ties of kinship rose up. Allah said, 'Stop!' They said, 'This\nis the place for anyone seeking refuge with You from being cut off' Allah\nsaid, 'Are you not content that I should maintain connections with the one\nwho maintains connection with you and I should cut off the one who cuts you\noff?' It replied, 'Yes indeed, my Lord.' He said, 'You have that.'\""}},{"id":5,"idInBook":5,"chapterId":2,"bookId":15,"arabic":"حَدَّثَنَا الْحُمَيْدِيُّ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي سَعْدٍ، عَنْ مُحَمَّدِ بْنِ أَبِي مُوسَى، عَنِ ابْنِ عَبَّاسٍ قَالَ‏:‏ ‏{‏وَآتِ ذَا الْقُرْبَى حَقَّهُ وَالْمِسْكِينَ وَابْنَ السَّبِيلِ‏.‏‏.‏‏.‏‏}‏، قَالَ‏:‏ بَدَأَ فَأَمَرَهُ بِأَوْجَبِ الْحُقُوقِ، وَدَلَّهُ عَلَى أَفْضَلِ الأَعْمَالِ إِذَا كَانَ عِنْدَهُ شَيْءٌ فَقَالَ‏:‏ ‏{‏وَآتِ ذَا الْقُرْبَى حَقَّهُ وَالْمِسْكِينَ وَابْنَ السَّبِيلِ‏}‏، وَعَلَّمَهُ إِذَا لَمْ يَكُنْ عِنْدَهُ شَيْءٌ كَيْفَ يَقُولُ، فَقَالَ‏:‏ ‏{‏وَإِمَّا تُعْرِضَنَّ عَنْهُمُ ابْتِغَاءَ رَحْمَةٍ مِنْ رَبِّكَ تَرْجُوهَا فَقُلْ لَهُمْ قَوْلاً مَيْسُورًا‏}‏ عِدَّةً حَسَنَةً كَأَنَّهُ قَدْ كَانَ، وَلَعَلَّهُ أَنْ يَكُونَ إِنْ شَاءَ اللَّهُ، ‏{‏وَلاَ تَجْعَلْ يَدَكَ مَغْلُولَةً إِلَى عُنُقِكَ‏}‏ لاَ تُعْطِي شَيْئًا، ‏{‏وَلاَ تَبْسُطْهَا كُلَّ الْبَسْطِ‏}‏ تُعْطِي مَا عِنْدَكَ، ‏{‏فَتَقْعُدَ مَلُومًا‏}‏ يَلُومُكَ مَنْ يَأْتِيكَ بَعْدُ، وَلاَ يَجِدُ عِنْدَكَ شَيْئًا ‏{‏مَحْسُورًا‏}‏، قَالَ‏:‏ قَدْ حَسَّرَكَ مَنْ قَدْ أَعْطَيْتَهُ‏.‏","english":{"narrator":"Ibn 'Abbas spoke about the ayat, \"Give your relatives their\ndue, and the very poor and travellers\" (17:26), and said, \"He\nbegins by commanding the most pressing of the obligatory dues and He directs\nus to the best action if we have any money. He says:","text":"'Give your relatives\ntheir due, and the very poor and travellers.' He also teaches us what we\ncan say if we have nothing. He says, 'But if you do turn away from them,\nseeking the mercy you hope for from your Lord, then speak to them with words\nthat bring them ease' (17:28) in the form of an excellent promise. Things\nare as they are, but they might change if Allah wills. 'Do not keep your\nhand chained to your neck' and not give anything, 'but do not extend\nit either to its full extent' and give all you have, 'so that you\nsit there blamed' as those who come to you later and find you have nothing\nwill blame you, 'and destitute.' (17:29)\" He said, \"The person to\nwhom you have given everything has made you destitute.\""}},{"id":6,"idInBook":6,"chapterId":2,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدِ اللهِ، قَالَ‏:‏ حَدَّثَنَا ابْنُ أَبِي حَازِمٍ، عَنِ الْعَلاَءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ أَتَى رَجُلٌ النَّبِيَّ صلى الله عليه وسلم فَقَالَ‏:‏ يَا رَسُولَ اللهِ، إِنَّ لِي قَرَابَةً أَصِلُهُمْ وَيَقْطَعُونَ، وَأُحْسِنُ إِلَيْهِمْ وَيُسِيئُونَ إِلَيَّ، وَيَجْهَلُونَ عَلَيَّ وَأَحْلُمُ عَنْهُمْ، قَالَ‏:‏ لَئِنْ كَانَ كَمَا تَقُولُ كَأَنَّمَا تُسِفُّهُمُ الْمَلَّ، وَلاَ يَزَالُ مَعَكَ مِنَ اللهِ ظَهِيرٌ عَلَيْهِمْ مَا دُمْتَ عَلَى ذَلِكَ‏.‏","english":{"narrator":"","text":"Abu Hurayra said, \"A man came to the Prophet, may Allah bless him and\ngrant him peace, and said, 'Messenger of Allah! I have relatives with whom\nI maintain ties while they cut me off. I am good to them while they are bad\nto me. They behave foolishly towards me while I am forbearing towards them.'\nThe Prophet said, 'If things are as you said, it is as if you were putting\nhot ashes on them and you will not lack a supporter against them from Allah\nas long as you continue to do that.'\""}},{"id":7,"idInBook":7,"chapterId":2,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ قَالَ‏:‏ حَدَّثَنِي أَخِي، عَنْ سُلَيْمَانَ بْنِ بِلاَلٍ، عَنْ مُحَمَّدِ بْنِ أَبِي عَتِيقٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّ أَبَا الرَّدَّادِ اللَّيْثِيَّ أَخْبَرَهُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، أَنَّهُ سَمِعَ رَسُولَ اللهِ صلى الله عليه وسلم يَقُولُ‏:‏ قَالَ اللَّهُ عَزَّ وَجَلَّ‏:‏ أَنَا الرَّحْمَنُ، وَأَنَا خَلَقْتُ الرَّحِمَ، وَاشْتَقَقْتُ لَهَا مِنَ اسْمِي، فَمَنْ وَصَلَهَا وَصَلْتُهُ، وَمَنْ قَطَعَهَا بَتَتُّهُ‏.‏","english":{"narrator":"","text":"'Abdu'r-Rahman ibn 'Awf heard the Messenger of Allah, may Allah bless\nhim and grant him peace, say, \"Allah, the Almighty and Exalted, said, 'I\nam the Merciful (ar-Rahman). I have created ties of kinship and derives\na name for it from My Name. If anyone maintains ties of kinship, I maintain\nconnection with him, and I shall cut off anyone who cuts them off.'\""}},{"id":8,"idInBook":8,"chapterId":2,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ‏:‏ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عُثْمَانَ بْنِ الْمُغِيرَةِ، عَنْ أَبِي الْعَنْبَسِ قَالَ‏:‏ دَخَلْتُ عَلَى عَبْدِ اللهِ بْنِ عَمْرٍو فِي الْوَهْطِ يَعْنِي أَرْضًا لَهُ بِالطَّائِفِ، فَقَالَ‏:‏ عَطَفَ لَنَا النَّبِيُّ صلى الله عليه وسلم إِصْبَعَهُ فَقَالَ‏:‏ الرَّحِمُ شُجْنَةٌ مِنَ الرَّحْمَنِ، مَنْ يَصِلْهَا يَصِلْهُ، وَمَنْ يَقْطَعْهَا يَقْطَعْهُ، لَهَا لِسَانٌ طَلْقٌ ذَلْقٌ يَوْمَ الْقِيَامَةِ‏.‏","english":{"narrator":"","text":"Abu'l-'Anbas said, \"I visited 'Abdullah ibn 'Amr at al-Waht (some land\nof his in Ta'if). He said, 'The Prophet, may Allah bless him and grant him\npeace, pointed his finger towards us and said, \"Kinship (rahim) us\nderived from the All-Merciful (Rahman). When someone maintains the\nconnections of ties of kinship, they maintain connection with him. If someone\ncuts them off, they cut him off. They will have an unfettered, eloquent tongue\non the Day of Rising.\"'\""}},{"id":9,"idInBook":9,"chapterId":2,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ قَالَ‏:‏ حَدَّثَنِي سُلَيْمَانُ، عَنْ مُعَاوِيَةَ بْنِ أَبِي مُزَرِّدٍ، عَنْ يَزِيدَ بْنِ رُومَانَ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ‏:‏ الرَّحِمُ شُجْنَةٌ مِنَ اللهِ، مَنْ وَصَلَهَا وَصَلَهُ اللَّهُ، وَمَنْ قَطَعَهَا قَطَعَهُ اللَّهُ‏.‏","english":{"narrator":"","text":"'A'isha reported that the Prophet, may Allah bless him and grant him\npeace, said, \"Kinship (rahim) is derived from Allah. If anyone maintains\nties of kinship Allah maintains ties with him. If anyone cuts them off, Allah\ncuts him off.\""}},{"id":10,"idInBook":10,"chapterId":2,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ صَالِحٍ قَالَ‏:‏ حَدَّثَنِي اللَّيْثُ قَالَ‏:‏ حَدَّثَنِي عَقِيلٌ، عَنِ ابْنِ شِهَابٍ قَالَ‏:‏ أَخْبَرَنِي أَنَسُ بْنُ مَالِكٍ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم قَالَ‏:‏ مَنْ أَحَبَّ أَنْ يُبْسَطَ لَهُ فِي رِزْقِهِ، وَأَنْ يُنْسَأَ لَهُ فِي أَثَرِهِ، فَلْيَصِلْ رَحِمَهُ‏.‏","english":{"narrator":"","text":"Anas ibn Malik reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"Anyone who wants to have his provision expanded\nand his term of life prolonged should maintain ties of kinship.\""}},{"id":11,"idInBook":11,"chapterId":2,"bookId":15,"arabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ مَعْنٍ قَالَ‏:‏ حَدَّثَنِي أَبِي، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ سَمِعْتُ رَسُولَ اللهِ صلى الله عليه وسلم يَقُولُ‏:‏ مَنْ سَرَّهُ أَنْ يُبْسَطَ لَهُ فِي رِزْقِهِ، وَأَنْ يُنْسَأَ لَهُ فِي أَثَرِهِ، فَلْيَصِلْ رَحِمَهُ‏.‏","english":{"narrator":"","text":"Abu Hurayra heard that the Messenger of Allah, may Allah bless him and\ngrant him peace, say, \"Anyone who wants to have his provision expanded and\nhis term of life lengthened should maintain ties of kinship.\""}},{"id":12,"idInBook":12,"chapterId":2,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، قَالَ‏:‏ أَخْبَرَنَا سُفْيَانُ، عَنْ أَبِي إِسْحَاقَ، عَنْ مَغْرَاءَ، عَنِ ابْنِ عُمَرَ قَالَ‏:‏ مَنِ اتَّقَى رَبَّهُ، وَوَصَلَ رَحِمَهُ، نُسِّئَ فِي أَجَلِهِ، وَثَرَى مَالُهُ، وَأَحَبَّهُ أَهْلُهُ‏.‏","english":{"narrator":"","text":"Ibn 'Umar said, \"If someone fears his Lord and maintains ties of kinship,\nhis term of life will be prolonged, he will have abundant wealth and his\npeople will love him.\""}},{"id":13,"idInBook":13,"chapterId":2,"bookId":15,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ‏:‏ حَدَّثَنَا يُونُسُ بْنُ أَبِي إِسْحَاقَ قَالَ‏:‏ حَدَّثَنِي مَغْرَاءُ أَبُو مُخَارِقٍ هُوَ الْعَبْدِيُّ، قَالَ ابْنُ عُمَرَ‏:‏ مَنِ اتَّقَى رَبَّهُ، وَوَصَلَ رَحِمَهُ، أُنْسِئَ لَهُ فِي عُمْرِهِ، وَثَرَى مَالُهُ، وَأَحَبَّهُ أَهْلُهُ‏.‏","english":{"narrator":"","text":"Ibn 'Umar said, \"Whoever has taqwa of his Lord and maintains ties of kinship, his\nterm of life will be prolonged, his wealth will be abundant, and his family\nwill love him.\""}},{"id":14,"idInBook":14,"chapterId":2,"bookId":15,"arabic":"حَدَّثَنَا حَيْوَةُ بْنُ شُرَيْحٍ، قَالَ‏:‏ حَدَّثَنَا بَقِيَّةُ، عَنْ بَحِيرٍ، عَنْ خَالِدِ بْنِ مَعْدَانَ، عَنِ الْمِقْدَامِ بْنِ مَعْدِي كَرِبَ، أَنَّهُ سَمِعَ رَسُولَ اللهِ صلى الله عليه وسلم يَقُولُ‏:‏ إِنَّ اللَّهَ يُوصِيكُمْ بِأُمَّهَاتِكُمْ، ثُمَّ يُوصِيكُمْ بِأُمَّهَاتِكُمْ، ثُمَّ يُوصِيكُمْ بِآبَائِكُمْ، ثُمَّ يُوصِيكُمْ بِالأَقْرَبِ فَالأَقْرَبِ‏.‏","english":{"narrator":"","text":"It is reported that al-Miqdam ibn Ma'dikarib heard the Messenger of Allah,\nmay Allah bless him and grant him peace, say, \"Allah enjoins you to be dutiful\nto your mothers. Then He enjoins you to be dutiful to your mothers. Then\nHe enjoins you to be dutiful to your fathers. Then He enjoins you to be dutiful\nto your next closest relative and then to your next closest relative.\""}},{"id":15,"idInBook":15,"chapterId":2,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ‏:‏ حَدَّثَنَا الْخَزْرَجُ بْنُ عُثْمَانَ أَبُو الْخَطَّابِ السَّعْدِيُّ، قَالَ‏:‏ أَخْبَرَنَا أَبُو أَيُّوبَ سُلَيْمَانُ مَوْلَى عُثْمَانَ بْنِ عَفَّانَ قَالَ‏:‏ جَاءَنَا أَبُو هُرَيْرَةَ عَشِيَّةَ الْخَمِيسِ لَيْلَةَ الْجُمُعَةِ فَقَالَ‏:‏ أُحَرِّجُ عَلَى كُلِّ قَاطِعِ رَحِمٍ لَمَا قَامَ مِنْ عِنْدِنَا، فَلَمْ يَقُمْ أَحَدٌ حَتَّى قَالَ ثَلاَثًا، فَأَتَى فَتًى عَمَّةً لَهُ قَدْ صَرَمَهَا مُنْذُ سَنَتَيْنِ، فَدَخَلَ عَلَيْهَا، فَقَالَتْ لَهُ‏:‏ يَا ابْنَ أَخِي، مَا جَاءَ بِكَ‏؟‏ قَالَ‏:‏ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُ كَذَا وَكَذَا، قَالَتِ‏:‏ ارْجِعْ إِلَيْهِ فَسَلْهُ‏:‏ لِمَ قَالَ ذَاكَ‏؟‏ قَالَ‏:‏ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ‏:‏ إِنَّ أَعْمَالَ بَنِي آدَمَ تُعْرَضُ عَلَى اللهِ تَبَارَكَ وَتَعَالَى عَشِيَّةَ كُلِّ خَمِيسٍ لَيْلَةَ الْجُمُعَةِ، فَلاَ يَقْبَلُ عَمَلَ قَاطِعِ رَحِمٍ‏.‏","english":{"narrator":"","text":"Abu Ayyub Sulayman, the mawla of 'Uthman ibn 'Affan, said, \"Abu Hurayra\ncame to us on a Thursday evening, the night before Jumu'a. He said, 'Every\nindividual who severs ties of kinship is constricted when he leaves us. No\none left until he had said that three times. Then a young man went to one\nof his paternal aunts with whom he had severed ties two years previously.\nHe went to her and she asked him, 'Nephew! What has brought you?' He replied,\n'I heard Abu Hurayra say such-and-such.' She said, 'Go back to him and ask\nhim why he said that.' Abu Hurayra said, 'I heard the Prophet, may Allah\nbless him and grant him peace, say, \"The actions of the children of Adam\nare presented before Allah Almighty on Thursday evening, the night before\nJumu'a. He does not accept the actions of someone who has severed ties of\nkinship.\"'\""}},{"id":16,"idInBook":16,"chapterId":2,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عِمْرَانَ بْنِ أَبِي لَيْلَى، قَالَ‏:‏ حَدَّثَنَا أَيُّوبُ بْنُ جَابِرٍ الْحَنَفِيُّ، عَنْ آدَمَ بْنِ عَلِيٍّ، عَنِ ابْنِ عُمَرَ‏:‏ مَا أَنْفَقَ الرَّجُلُ عَلَى نَفْسِهِ وَأَهْلِهِ يَحْتَسِبُهَا إِلاَّ آجَرَهُ اللَّهُ تَعَالَى فِيهَا، وَابْدَأْ بِمَنْ تَعُولُ، فَإِنْ كَانَ فَضْلاً فَالأَقْرَبَ الأَقْرَبَ، وَإِنْ كَانَ فَضْلاً فَنَاوِلْ‏.‏","english":{"narrator":"","text":"Ibn 'Umar said, \"Nothing that a man spends on himself and his family,\nanticipating a reward from Allah, will fail to be rewarded by Allah Almighty.\nHe should begin with those whose support is his responsibility. If there\nis something left over, he should spend it on his next nearest relative and\nthen the next nearest. If there is still something left over, he can give\nit away.\""}},{"id":17,"idInBook":17,"chapterId":2,"bookId":15,"arabic":"حَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُوسَى، قَالَ‏:‏ أَخْبَرَنَا سُلَيْمَانُ أَبُو إِدَامٍ قَالَ‏:‏ سَمِعْتُ عَبْدَ اللهِ بْنَ أَبِي أَوْفَى يَقُولُ‏:‏ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ إِنَّ الرَّحْمَةَ لاَ تَنْزِلُ عَلَى قَوْمٍ فِيهِمْ قَاطِعُ رَحِمٍ‏.‏","english":{"narrator":"","text":"'Abdullah ibn 'Awfa reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"Mercy does not descend on a people when there is\nsomeone among them who severs ties of kinship.\""}},{"id":18,"idInBook":18,"chapterId":2,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ صَالِحٍ قَالَ‏:‏ حَدَّثَنِي اللَّيْثُ قَالَ‏:‏ حَدَّثَنِي عَقِيلٌ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي مُحَمَّدُ بْنُ جُبَيْرِ بْنِ مُطْعِمٍ، أَنَّ جُبَيْرَ بْنَ مُطْعِمٍ أَخْبَرَهُ، أَنَّهُ سَمِعَ رَسُولَ اللهِ صلى الله عليه وسلم يَقُولُ‏:‏ لاَ يَدْخُلُ الْجَنَّةَ قَاطِعُ رَحِمٍ‏.‏","english":{"narrator":"","text":"Jubayr ibn Mu'tim reported that he heard the Messenger of Allah, may\nAllah bless him and grant him peace, say, \"The one who severs ties of kinship\nwill not enter the Garden.\""}},{"id":19,"idInBook":19,"chapterId":2,"bookId":15,"arabic":"حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ قَالَ‏:‏ أَخْبَرَنِي مُحَمَّدُ بْنُ عَبْدِ الْجَبَّارِ قَالَ‏:‏ سَمِعْتُ مُحَمَّدَ بْنَ كَعْبٍ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يُحَدِّثُ، عَنْ رَسُولِ اللهِ صلى الله عليه وسلم قَالَ‏:‏ إِنَّ الرَّحِمَ شُجْنَةٌ مِنَ الرَّحْمَنِ، تَقُولُ‏:‏ يَا رَبِّ، إِنِّي ظُلِمْتُ، يَا رَبِّ، إِنِّي قُطِعْتُ، يَا رَبِّ، إِنِّي إِنِّي، يَا رَبِّ، يَا رَبِّ‏.‏ فَيُجِيبُهَا‏:‏ أَلاَ تَرْضَيْنَ أَنْ أَقْطَعَ مَنْ قَطَعَكِ، وَأَصِلَ مَنْ وَصَلَكِ‏؟‏‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Messenger of Allah, may Allah bless him\nand grant him peace, said, \"Ties of kinship (rahim) is derived from\nthe All-Merciful (ar-Rahman). They say. 'My Lord! I have been wronged!\nMy Lord! I have been cut off! My Lord! I have! I have!' Allah answers\nthem, 'Are you not content that I cut off the one who cuts you off and I\nmaintain connections with the one who maintains connections with you?'\""}},{"id":20,"idInBook":20,"chapterId":2,"bookId":15,"arabic":"حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ، قَالَ‏:‏ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، قَالَ‏:‏ حَدَّثَنَا سَعِيدُ بْنُ سَمْعَانَ قَالَ‏:‏ سَمِعْتُ أَبَا هُرَيْرَةَ يَتَعَوَّذُ مِنْ إِمَارَةِ الصِّبْيَانِ وَالسُّفَهَاءِ‏.‏ فَقَالَ سَعِيدُ بْنُ سَمْعَانَ‏:‏ فَأَخْبَرَنِي ابْنُ حَسَنَةَ الْجُهَنِيُّ أَنَّهُ قَالَ لأَبِي هُرَيْرَةَ‏:‏ مَا آيَةُ ذَلِكَ‏؟‏ قَالَ‏:‏ أَنْ تُقْطَعَ الأَرْحَامُ، وَيُطَاعَ الْمُغْوِي، وَيُعْصَى الْمُرْشِدُ‏.‏","english":{"narrator":"","text":"Sa'id ibn Sam'an heard Abu Hurayra seeking refuge from the power of children\nand fools. Sa'id said, \"Ibn Hasana al-Juhani told me that he asked Abu Hurayra,\n'What is the token of that?' He replied, 'That he severs ties of kinship,\nobeys someone who is in error, and disobeys the correct guide.'\""}},{"id":21,"idInBook":21,"chapterId":2,"bookId":15,"arabic":"حَدَّثَنَا آدَمُ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، قَالَ‏:‏ حَدَّثَنَا عُيَيْنَةُ بْنُ عَبْدِ الرَّحْمَنِ قَالَ‏:‏ سَمِعْتُ أَبِي يُحَدِّثُ، عَنْ أَبِي بَكْرَةَ قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ مَا مِنْ ذَنْبٍ أَحْرَى أَنْ يُعَجِّلَ اللَّهُ لِصَاحِبِهِ الْعُقُوبَةَ فِي الدُّنْيَا، مَعَ مَا يَدَّخِرُ لَهُ فِي الْآخِرَةِ، مِنْ قَطِيعَةِ الرَّحِمِ وَالْبَغْيِ‏.‏","english":{"narrator":"","text":"Abu Bakra reported that the Messenger of Allah, may Allah bless him and\ngrant him peace, said, \"There is no wrong action which Allah is swifter to\npunish in this world - in addition to the punishment which He has stored\nup for the wrongdoer in the Next World - than cutting off ties of kinship\nand injustice.\""}},{"id":22,"idInBook":22,"chapterId":2,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، قَالَ‏:‏ أَخْبَرَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، وَالْحَسَنِ بْنِ عَمْرٍو، وَفِطْرٍ، عَنْ مُجَاهِدٍ، عَنْ عَبْدِ اللهِ بْنِ عَمْرٍو قَالَ سُفْيَانُ لَمْ يَرْفَعْهُ الأَعْمَشُ إِلَى النَّبِيِّ صلى الله عليه وسلم، وَرَفَعَهُ الْحَسَنُ وَفِطْرٌ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ لَيْسَ الْوَاصِلُ بِالْمُكَافِئِ، وَلَكِنَّ الْوَاصِلَ الَّذِي إِذَا قُطِعَتْ رَحِمُهُ وَصَلَهَا‏.‏","english":{"narrator":"","text":"'Abdullah ibn 'Amr reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"The one who maintains ties of kinship is not the\none who reciprocates. The one who maintains ties of kinship is the one who,\nwhen his relatives cut him off, maintains ties of kinship.\""}},{"id":23,"idInBook":23,"chapterId":2,"bookId":15,"arabic":"حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيلَ، قَالَ‏:‏ حَدَّثَنَا عِيسَى بْنُ عَبْدِ الرَّحْمَنِ، عَنْ طَلْحَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْسَجَةَ، عَنِ الْبَرَاءِ قَالَ‏:‏ جَاءَ أَعْرَابِيٌّ فَقَالَ‏:‏ يَا نَبِيَّ اللهِ، عَلِّمْنِي عَمَلاً يُدْخِلُنِي الْجَنَّةَ، قَالَ‏:‏ لَئِنْ كُنْتَ أَقَصَرْتَ الْخُطْبَةَ لَقَدْ أَعْرَضْتَ الْمَسْأَلَةَ، أَعْتِقِ النَّسَمَةَ، وَفُكَّ الرَّقَبَةَ قَالَ‏:‏ أَوَ لَيْسَتَا وَاحِدًا‏؟‏ قَالَ‏:‏ لاَ، عِتْقُ النَّسَمَةِ أَنْ تَعْتِقَ النَّسَمَةَ، وَفَكُّ الرَّقَبَةِ أَنْ تُعِينَ عَلَى الرَّقَبَةِ، وَالْمَنِيحَةُ الرَّغُوبُ، وَالْفَيْءُ عَلَى ذِي الرَّحِمِ، فَإِنْ لَمْ تُطِقْ ذَلِكَ، فَأْمُرْ بِالْمَعْرُوفِ، وَانْهَ عَنِ الْمُنْكَرِ، فَإِنْ لَمْ تُطِقْ ذَلِكَ، فَكُفَّ لِسَانَكَ إِلاَّ مِنْ خَيْرٍ‏.‏","english":{"narrator":"","text":"Al-Bara' said, \"A bedouin came and said, 'Prophet of Allah! Teach me\nan action which will enable me to enter the Garden.' He said, \"The question\nis a broad one, even though you have asked it in only a few words. Free someone.\nSet a slave free.' He said, 'Are they not the same thing?' 'No,' he replied,\n'Freeing someone is setting someone free yourself. Setting a slave free is\nto contribute to the price of setting him free. Lend an animal for milking\nwhich has a lot of milk and treat your relatives kindly. If you cannot do\nthat, then command the good and forbid the bad. If you cannot do that, then\nrestrain your tongue from everything except what is good.\""}},{"id":24,"idInBook":24,"chapterId":2,"bookId":15,"arabic":"حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ‏:‏ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ قَالَ‏:‏ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ حَكِيمَ بْنَ حِزَامٍ أَخْبَرَهُ، أَنَّهُ قَالَ لِلنَّبِيِّ صلى الله عليه وسلم‏:‏ أَرَأَيْتَ أُمُورًا كُنْتُ أَتَحَنَّثُ بِهَا فِي الْجَاهِلِيَّةِ، مِنْ صِلَةٍ، وَعَتَاقَةٍ، وَصَدَقَةٍ، فَهَلْ لِي فِيهَا أَجْرٌ‏؟‏ قَالَ حَكِيمٌ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ أَسْلَمْتَ عَلَى مَا سَلَفَ مِنْ خَيْرٍ‏.‏","english":{"narrator":"","text":"Hakim ibn Hizam said to the Prophet, may Allah bless him and grant him\npeace, \"Do you think that the acts of worship which I used to do in the time\nof the Jahiliyya - maintaining relations with relatives, setting\nslaves free and sadaqa - will bring me a reward?\" Hakim said\nthat the Messenger of Allah, may Allah bless him and grant him peace, said,\n\"When you become Muslim, you keep the good actions you have already done.\""}},{"id":25,"idInBook":25,"chapterId":2,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، قَالَ‏:‏ أَخْبَرَنَا عَبْدَةُ، عَنْ عُبَيْدِ اللهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، رَأَى عُمَرُ حُلَّةً سِيَرَاءَ فَقَالَ‏:‏ يَا رَسُولَ اللهِ، لَوِ اشْتَرَيْتَ هَذِهِ، فَلَبِسْتَهَا يَوْمَ الْجُمُعَةِ، وَلِلْوُفُودِ إِذَا أَتَوْكَ، فَقَالَ‏:‏ يَا عُمَرُ، إِنَّمَا يَلْبَسُ هَذِهِ مَنْ لاَ خَلاَقَ لَهُ، ثُمَّ أُهْدِيَ لِلنَّبِيِّ صلى الله عليه وسلم مِنْهَا حُلَلٌ، فَأَهْدَى إِلَى عُمَرَ مِنْهَا حُلَّةً، فَجَاءَ عُمَرُ إِلَى رَسُولِ اللهِ صلى الله عليه وسلم فَقَالَ‏:‏ يَا رَسُولَ اللهِ، بَعَثْتَ إِلَيَّ هَذِهِ، وَقَدْ سَمِعْتُكَ قُلْتَ فِيهَا مَا قُلْتَ، قَالَ‏:‏ إِنِّي لَمْ أُهْدِهَا لَكَ لِتَلْبَسَهَا، إِنَّمَا أَهْدَيْتُهَا إِلَيْكَ لِتَبِيعَهَا أَوْ لِتَكْسُوَهَا، فَأَهْدَاهَا عُمَرُ لأَخٍ لَهُ مِنْ أُمِّهِ مُشْرِكٍ‏.‏","english":{"narrator":"","text":"Ibn 'Umar said, \"'Umar saw a silk robe for sale. He said, 'Messenger\nof Allah, would you buy this robe and wear it on Jumu'a and when delegations\nvisit you?' He replied, 'Only a person who has no portion in the Next World\ncould wear this.' Then the Messenger of Allah, may Allah bless him and grant\nhim peace, was given some robes made of the same material. He sent one of\nthe robes to 'Umar. 'Umar exclaimed, 'How can I wear it when you said what\nyou said about it?' The Prophet replied, 'I did not give it to you so that\nyou could wear it. You can sell it or give it to someone.' 'Umar sent it\nto one of his half-brothers by his mother who was still an idolater.\" (see\n26)"}},{"id":26,"idInBook":26,"chapterId":2,"bookId":15,"arabic":"حَدَّثَنَا عَمْرُو بْنُ خَالِدٍ، قَالَ‏:‏ حَدَّثَنَا عَتَّابُ بْنُ بَشِيرٍ، عَنْ إِسْحَاقَ بْنِ رَاشِدٍ، عَنِ الزُّهْرِيِّ قَالَ‏:‏ حَدَّثَنِي مُحَمَّدُ بْنُ جُبَيْرِ بْنِ مُطْعِمٍ، أَنَّ جُبَيْرَ بْنَ مُطْعِمٍ أَخْبَرَهُ، أَنَّهُ سَمِعَ عُمَرَ بْنَ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ يَقُولُ عَلَى الْمِنْبَرِ‏:‏ تَعَلَّمُوا أَنْسَابَكُمْ، ثُمَّ صِلُوا أَرْحَامَكُمْ، وَاللَّهِ إِنَّهُ لِيَكُونُ بَيْنَ الرَّجُلِ وَبَيْنَ أَخِيهِ الشَّيْءُ، وَلَوْ يَعْلَمُ الَّذِي بَيْنَهُ وَبَيْنَهُ مِنْ دَاخِلَةِ الرَّحِمِ، لَأَوْزَعَهُ ذَلِكَ عَنِ انْتِهَاكِهِ‏.‏","english":{"narrator":"","text":"Jubayr ibn Mut'im said that he heard 'Umar ibn al-Khattab say on the\nminbar, \"Learn your lineages so that you can maintain ties of kinship. By\nAllah, if there are some bad feelings between a man and his brother and he\nknows that there is kinship between him and that man, that will prevent him\nfrom breaking with him.\""}},{"id":27,"idInBook":27,"chapterId":2,"bookId":15,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ يَعْقُوبَ، قَالَ‏:‏ أَخْبَرَنَا إِسْحَاقُ بْنُ سَعِيدِ بْنِ عَمْرٍو، أَنَّهُ سَمِعَ أَبَاهُ يُحَدِّثُ، عَنِ ابْنِ عَبَّاسٍ، أَنَّهُ قَالَ‏:‏ احْفَظُوا أَنْسَابَكُمْ، تَصَلُوا أَرْحَامَكُمْ، فَإِنَّهُ لاَ بُعْدَ بِالرَّحِمِ إِذَا قَرُبَتْ، وَإِنْ كَانَتْ بَعِيدَةً، وَلاَ قُرْبَ بِهَا إِذَا بَعُدَتْ، وَإِنْ كَانَتْ قَرِيبَةً، وَكُلُّ رَحِمٍ آتِيَةٌ يَوْمَ الْقِيَامَةِ أَمَامَ صَاحِبِهَا، تَشْهَدُ لَهُ بِصِلَةٍ إِنْ كَانَ وَصَلَهَا، وَعَلَيْهِ بِقَطِيعَةٍ إِنْ كَانَ قَطَعَهَا‏.‏","english":{"narrator":"","text":"Ibn 'Abbas said, \"Keep a record of your lines of descent so that you\ncan maintain ties of kinship. He will not make his relatives distant when\nthey are close relatives, even if they live far away. He will not consider\nthem to be close relatives if they are distant ones, even if they live near\nto him. Every time of kinship will come on the Day of Rising in front of\neach individual and testify on his behalf that he has maintained that tie\nof kinship if he did indeed maintain it. It will testify against him that\nhe cut if off if he cut it off.\""}}],"chapter":{"id":2,"bookId":15,"arabic":"كتاب صِلَةِ الرَّحِمِ","english":"Ties of Kinship"}}