{"metadata":{"length":13,"arabic":{"title":"الأدب المفرد","author":"الإمام محمد بن إسماعيل البخاري","introduction":"كتاب رَحْمَةِ"},"english":{"title":"Al-Adab Al-Mufrad","author":"Imam Muhammad ibn Ismail al-Bukhari","introduction":"Mercy"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":20,"bookId":15,"arabic":"حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ قَبِيصَةَ بْنِ جَابِرٍ، عَنْ عُمَرَ قَالَ‏:‏ لاَ يُرْحَمُ مَنْ لاَ يَرْحَمُ، وَلاَ يُغْفَرُ لِمَنْ لاَ يَغْفِرُ، وَلاَ يُتَابُ عَلَى مَنْ لاَ يَتُوبُ، وَلاَ يُوقَّ مَنْ لا يُتَوَقَّ‏.‏","english":{"narrator":"","text":"'Umar was heard to say, \"Anyone who does not show mercy will not\nbe shown mercy. Anyone who does not forgive will not be forgiven. Anyone\nwho does not turn in repentance will not be turned to nor will he be protected\nor guarded.\""}},{"id":2,"idInBook":2,"chapterId":20,"bookId":15,"arabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ‏:‏ حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، قَالَ‏:‏ حَدَّثَنَا زِيَادُ بْنُ مِخْرَاقٍ، عَنْ مُعَاوِيَةَ بْنِ قُرَّةَ، عَنْ أَبِيهِ قَالَ‏:‏ قَالَ رَجُلٌ‏:‏ يَا رَسُولَ اللهِ، إِنِّي لَأَذْبَحُ الشَّاةَ فَأَرْحَمُهَا، أَوْ قَالَ‏:‏ إِنِّي لَأَرْحَمُ الشَّاةَ أَنْ أَذْبَحَهَا، قَالَ‏:‏ وَالشَّاةُ إِنْ رَحِمْتَهَا، رَحِمَكَ اللَّهُ مَرَّتَيْنِ‏.‏","english":{"narrator":"","text":"Mu'awiya ibn Qurra reported that his father said, \"A man said,\n'Messenger of Allah, I was going to slaughter a sheep and then I felt sorry\nfor it (or 'sorry for the sheep I was going to slaughter').' He said twice,\n'Since you showed mercy to the sheep, Allah will show mercy to you.'\""}},{"id":3,"idInBook":3,"chapterId":20,"bookId":15,"arabic":"حَدَّثَنَا آدَمُ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، عَنْ مَنْصُورٍ، سَمِعْتُ أَبَا عُثْمَانَ مَوْلَى الْمُغِيرَةِ بْنِ شُعْبَةَ يَقُولُ‏:‏ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُ‏:‏ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم الصَّادِقَ الْمَصْدُوقَ أَبَا الْقَاسِمِ صلى الله عليه وسلم يَقُولُ‏:‏ لاَ تُنْزَعُ الرَّحْمَةُ إِلا مِنْ شَقِيٍّ‏.‏","english":{"narrator":"","text":"Abu Hurayra said, \"I heard the Prophet, may Allah bless him and\ngrant him peace, the truthful confirmed one, Abu'l-Qasim, may Allah bless\nhim and grant him peace, say, 'Mercy is only removed from the one who is\ndestined for wretchedness.\""}},{"id":4,"idInBook":4,"chapterId":20,"bookId":15,"arabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ‏:‏ حَدَّثَنَا يَحْيَى، عَنْ إِسْمَاعِيلَ قَالَ‏:‏ أَخْبَرَنِي قَيْسٌ قَالَ‏:‏ أَخْبَرَنِي جَرِيرٌ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ مَنْ لا يَرْحَمُ النَّاسَ لا يَرْحَمُهُ اللَّهُ‏.‏","english":{"narrator":"","text":"Jarir reported that the Prophet, may Allah bless him and grant\nhim peace, said, \"Allah will not show mercy to a person who does not show\nmercy to other people.\""}},{"id":5,"idInBook":5,"chapterId":20,"bookId":15,"arabic":"حَدَّثَنَا حَرَمِيُّ بْنُ حَفْصٍ، قَالَ‏:‏ حَدَّثَنَا وُهَيْبٌ، قَالَ‏:‏ حَدَّثَنَا أَيُّوبُ، عَنْ عَمْرِو بْنِ سَعِيدٍ، عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ‏:‏ كَانَ النَّبِيُّ صلى الله عليه وسلم أَرْحَمَ النَّاسِ بِالْعِيَالِ، وَكَانَ لَهُ ابْنٌ مُسْتَرْضَعٌ فِي نَاحِيَةِ الْمَدِينَةِ، وَكَانَ ظِئْرُهُ قَيْنًا، وَكُنَّا نَأْتِيهِ، وَقَدْ دَخَنَ الْبَيْتُ بِإِذْخِرٍ، فَيُقَبِّلُهُ وَيَشُمُّهُ‏.‏","english":{"narrator":"","text":"Anas ibn Malik said, \"The Prophet, may Allah bless him and grant\nhim peace, was the most merciful of people towards members of his family.\nHe had his son (Ibrahim) suckled in part of Madina and the husband of his\nwet-nurse was a blacksmith. We used to go to him and the house would be\nfull of smoke from the bellows. He would kiss the child and take him in\nhis lap.\""}},{"id":6,"idInBook":6,"chapterId":20,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا مَرْوَانُ، قَالَ‏:‏ حَدَّثَنَا يَزِيدُ بْنُ كَيْسَانَ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ أَتَى النَّبِيَّ صلى الله عليه وسلم رَجُلٌ وَمَعَهُ صَبِيٌّ، فَجَعَلَ يَضُمُّهُ إِلَيْهِ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ أَتَرْحَمُهُ‏؟‏ قَالَ‏:‏ نَعَمْ، قَالَ‏:‏ فَاللَّهُ أَرْحَمُ بِكَ مِنْكَ بِهِ، وَهُوَ أَرْحَمُ الرَّاحِمِينَ‏.‏","english":{"narrator":"Abu Hurayra said, \"A man came to the Prophet, may Allah bless him\nand grant him peace, with a child which he began to embrace. The Prophet,\nmay Allah bless him and grant him peace, said. 'Do you show mercy towards\nme?' 'Yes,' the man replied. He said, 'Allah is more merciful towards you\nthan you are towards this child. He is the Most Merciful of the merciful.;:","text":""}},{"id":7,"idInBook":7,"chapterId":20,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ قَالَ‏:‏ حَدَّثَنِي مَالِكٌ، عَنْ سُمَيٍّ مَوْلَى أَبِي بَكْرٍ، عَنْ أَبِي صَالِحٍ السَّمَّانِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم قَالَ‏:‏ بَيْنَمَا رَجُلٌ يَمْشِي بِطَرِيقٍ اشْتَدَّ بِهِ الْعَطَشُ، فَوَجَدَ بِئْرًا فَنَزَلَ فِيهَا، فَشَرِبَ ثُمَّ خَرَجَ، فَإِذَا كَلْبٌ يَلْهَثُ، يَأْكُلُ الثَّرَى مِنَ الْعَطَشِ، فَقَالَ الرَّجُلُ‏:‏ لَقَدْ بَلَغَ هَذَا الْكَلْبَ مِنَ الْعَطَشِ مِثْلُ الَّذِي كَانَ بَلَغَنِي، فَنَزَلَ الْبِئْرَ فَمَلَأَ خُفَّاهُ، ثُمَّ أَمْسَكَهَا بِفِيهِ، فَسَقَى الْكَلْبَ، فَشَكَرَ اللَّهُ لَهُ، فَغَفَرَ لَهُ، قَالُوا‏:‏ يَا رَسُولَ اللهِ، وَإِنَّ لَنَا فِي الْبَهَائِمِ أَجْرًا‏؟‏ قَالَ‏:‏ فِي كُلِّ ذَاتِ كَبِدٍ رَطْبَةٍ أَجْرٌ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"One day a man became very thirsty while\nwalking down the road. He came across a well, went down into it, and drank\nand then climbed out. In front of him he found a dog panting, eating the\ndust out of thirst. The man said, 'This dog is as thirsty as I was.' He\nwent back down into the well and filled his shoe, putting it into his mouth\n(in order to climb back up) and then gave the dog water. Therefore Allah\nthanked him and forgave him.\" They said, \"Messenger of Allah, will we have\na reward on account of animals?\" He said, \"There is a reward on account\nof every living thing.\""}},{"id":8,"idInBook":8,"chapterId":20,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ قَالَ‏:‏ حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم قَالَ‏:‏ عُذِّبَتِ امْرَأَةٌ فِي هِرَّةٍ حَبَسَتْهَا حَتَّى مَاتَتْ جُوعًا، فَدَخَلَتِ فِيهَا النَّارَ، يُقَالُ، وَاللَّهُ أَعْلَمُ‏:‏ لاَ أَنْتِ أَطْعَمْتِيهَا، وَلاَ سَقِيتِيهَا حِينَ حَبَسْتِيهَا، وَلاَ أَنْتِ أَرْسَلْتِيهَا، فَأَكَلَتْ مِنْ خَشَاشِ الأَرْضِ‏.‏","english":{"narrator":"'Abdullah ibn 'Umar reported that the Messenger of Allah, may Allah\nbless him and grant him peace, said, \"A woman punished her cat by imprisoning\nit until it died of hunger and because of it, she entered the Fire. It\nwas said - and Allah knows best:","text":"'You did not feed it nor give it water\nwhen you imprisoned it nor did you release it and let it eat from the plants\nof the earth.\""}},{"id":9,"idInBook":9,"chapterId":20,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عُقْبَةَ، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ عُثْمَانَ الْقُرَشِيُّ، قَالَ‏:‏ حَدَّثَنَا حَرِيزٌ، قَالَ‏:‏ حَدَّثَنَا حِبَّانُ بْنُ زَيْدٍ الشَّرْعَبِيُّ، عَنْ عَبْدِ اللهِ بْنِ عَمْرِو بْنِ الْعَاصِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ ارْحَمُوا تُرْحَمُوا، وَاغْفِرُوا يَغْفِرُ اللَّهُ لَكُمْ، وَيْلٌ لأَقْمَاعِ الْقَوْلِ، وَيْلٌ لِلْمُصِرِّينَ الَّذِينَ يُصِرُّونَ عَلَى مَا فَعَلُوا وَهُمْ يَعْلَمُونَ‏.‏","english":{"narrator":"","text":"'Abdullah ibn al-'As reported that the Prophet, may Allah bless\nhim and grant him peace, said, \"Show mercy and you will be shown mercy.\nForgive and Allah will forgive you. Woe to the vessels that catch words\n(i.e. the ears). Woe to those who persist and consciously continue in what\nthey are doing.\""}},{"id":10,"idInBook":10,"chapterId":20,"bookId":15,"arabic":"حَدَّثَنَا مَحْمُودٌ، قَالَ‏:‏ حَدَّثَنَا يَزِيدُ، قَالَ‏:‏ أَخْبَرَنَا الْوَلِيدُ بْنُ جَمِيلٍ الْكِنْدِيُّ، عَنِ الْقَاسِمِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي أُمَامَةَ قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ مَنْ رَحِمَ وَلَوْ ذَبِيحَةً، رَحِمَهُ اللَّهُ يَوْمَ الْقِيَامَةِ‏.‏","english":{"narrator":"","text":"Abu Umama that the Messenger of Allah, may Allah bless him and\ngrant him peace, said, \"Anyone who shows mercy, even to an animal meant\nfor slaughtering, will be shown mercy by Allah on the Day of Rising.\""}},{"id":11,"idInBook":11,"chapterId":20,"bookId":15,"arabic":"حَدَّثَنَا طَلْقُ بْنُ غَنَّامٍ، قَالَ‏:‏ حَدَّثَنَا الْمَسْعُودِيُّ، عَنِ الْحَسَنِ بْنِ سَعْدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللهِ، عَنْ عَبْدِ اللهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَزَلَ مَنْزِلاً فَأَخَذَ رَجُلٌ بَيْضَ حُمَّرَةٍ، فَجَاءَتْ تَرِفُّ عَلَى رَأْسِ رَسُولِ اللهِ صلى الله عليه وسلم فَقَالَ‏:‏ أَيُّكُمْ فَجَعَ هَذِهِ بِبَيْضَتِهَا‏؟‏ فَقَالَ رَجُلٌ‏:‏ يَا رَسُولَ اللهِ، أَنَا أَخَذْتُ بَيْضَتَهَا، فَقَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ ارْدُدْ، رَحْمَةً لَهَا‏.‏","english":{"narrator":"","text":"'Abdullah reported that the Prophet, may Allah bless him and grant\nhim peace, stopped in a place and then someone took a bird's eggs and the\nbird began to beat its wings around the head of the Messenger of Allah,\nmay Allah bless him and grant him peace. He asked, \"Which of you has taken\nits eggs?\" A man said, \"Messenger of Allah, I have taken its eggs.\" The\nMessenger of Allah, may Allah bless him and grant him peace, said, \"Return\nthem out off mercy to the bird.\""}},{"id":12,"idInBook":12,"chapterId":20,"bookId":15,"arabic":"حَدَّثَنَا عَارِمٌ، قَالَ‏:‏ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ قَالَ‏:‏ كَانَ ابْنُ الزُّبَيْرِ بِمَكَّةَ وَأَصْحَابُ النَّبِيِّ صلى الله عليه وسلم يَحْمِلُونَ الطَّيْرَ فِي الأَقْفَاصِ‏.‏","english":{"narrator":"","text":"Hisham ibn 'Urwa reported that Ibn az-Zubayr was in Makka and the\nCompanions of the Prophet, may Allah bless him and grant him peace, were\ncarrying birds in cages."}},{"id":13,"idInBook":13,"chapterId":20,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى، قَالَ‏:‏ حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ قَالَ‏:‏ دَخَلَ النَّبِيُّ صلى الله عليه وسلم فَرَأَى ابْنًا لأَبِي طَلْحَةَ يُقَالُ لَهُ‏:‏ أَبُو عُمَيْرٍ، وَكَانَ لَهُ نُغَيْرٌ يَلْعَبُ بِهِ، فَقَالَ‏:‏ يَا أَبَا عُمَيْرٍ، مَا فَعَلَ أَوْ، أَيْنَ، النُّغَيْرُ‏؟‏‏.‏","english":{"narrator":"","text":"Anas said, \"The Prophet, may Allah bless him and grant him peace,\ncame in and saw a son of Abu Talha's called Abu 'Umayr. He had a sparrow\nwhich he used to play with.\" He said, \"Abu 'Umayr, what happened to (or\nwhere is) the little sparrow?'\""}}],"chapter":{"id":20,"bookId":15,"arabic":"كتاب رَحْمَةِ","english":"Mercy"}}