{"metadata":{"length":12,"arabic":{"title":"الأدب المفرد","author":"الإمام محمد بن إسماعيل البخاري","introduction":"كتاب ذات البين"},"english":{"title":"Al-Adab Al-Mufrad","author":"Imam Muhammad ibn Ismail al-Bukhari","introduction":"Social Behaviour"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":21,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ صَالِحٍ قَالَ‏:‏ حَدَّثَنِي اللَّيْثُ قَالَ‏:‏ حَدَّثَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ قَالَ‏:‏ أَخْبَرَنِي حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ أُمَّهَ أُمَّ كُلْثُومِ ابْنَةَ عُقْبَةَ بْنِ أَبِي مُعَيْطٍ أَخْبَرَتْهُ، أَنَّهَا سَمِعَتْ رَسُولَ اللهِ صلى الله عليه وسلم يَقُولُ‏:‏ لَيْسَ الْكَذَّابُ الَّذِي يُصْلِحُ بَيْنَ النَّاسِ، فَيَقُولُ خَيْرًا، أَوْ يَنْمِي خَيْرًا، قَالَتْ‏:‏ وَلَمْ أَسْمَعْهُ يُرَخِّصُ فِي شَيْءٍ مِمَّا يَقُولُ النَّاسُ مِنَ الْكَذِبِ إِلاَّ فِي ثَلاَثٍ‏:‏ الإِصْلاَحِ بَيْنَ النَّاسِ، وَحَدِيثِ الرَّجُلِ امْرَأَتَهُ، وَحَدِيثِ الْمَرْأَةِ زَوْجَهَا‏.‏","english":{"narrator":"","text":"Umm Kulthum, the daughter of 'Uqba ibn Abi Mu'ayt, reported that\nshe heard the Messenger of Allah, may Allah bless him and grant him peace,\nsay, \"Someone who makes peace between people by saying something good or\nrelates something good is not a liar.\""}},{"id":2,"idInBook":2,"chapterId":21,"bookId":15,"arabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ اللهِ بْنُ دَاوُدَ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ عَلَيْكُمْ بِالصِّدْقِ، فَإِنَّ الصِّدْقَ يَهْدِي إِلَى الْبِرِّ، وَإِنَّ الْبِرَّ يَهْدِي إِلَى الْجَنَّةِ، وَإِنَّ الرَّجُلَ يَصْدُقُ حَتَّى يُكْتَبَ عِنْدَ اللهِ صِدِّيقًا، وَإِيَّاكُمْ وَالْكَذِبَ، فَإِنَّ الْكَذِبَ يَهْدِي إِلَى الْفُجُورِ، وَالْفُجُورَ يَهْدِي إِلَى النَّارِ، وَإِنَّ الرَّجُلَ لَيَكْذِبُ حَتَّى يُكْتَبَ عِنْدَ اللهِ كَذَّابًا‏.‏","english":{"narrator":"","text":"'Abdullah reported that the Prophet, may Allah bless him and grant\nhim peace, said, \"You must be truthful. Truthfulness leads to dutifulness\nand dutifulness leads to the Garden. A man continues to tell the truth\nuntil he is written as a siddiq with Allah. Beware of lying. Lying leads\nto deviance and deviance leads to the Fire. A man continues to lie until\nhe is written as a liar with Allah.\""}},{"id":3,"idInBook":3,"chapterId":21,"bookId":15,"arabic":"حَدَّثَنَا قُتَيْبَةُ، قَالَ‏:‏ حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ مُجَاهِدٍ، عَنْ أَبِي مَعْمَرٍ، عَنْ عَبْدِ اللهِ قَالَ‏:‏ لاَ يَصْلُحُ الْكَذِبُ فِي جِدٍّ وَلاَ هَزْلٍ، وَلاَ أَنْ يَعِدَ أَحَدُكُمْ وَلَدَهُ شَيْئًا ثُمَّ لاَ يُنْجِزُ لَهُ‏.‏","english":{"narrator":"","text":"'Abdullah said, \"Lying is not correct, neither \nin seriousness nor in jest. None of you should promise his child something\nand then not give it to him.\""}},{"id":4,"idInBook":4,"chapterId":21,"bookId":15,"arabic":"حَدَّثَنَا آدَمُ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، عَنِ الأَعْمَشِ، عَنْ يَحْيَى بْنِ وَثَّابٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ الْمُؤْمِنُ الَّذِي يُخَالِطُ النَّاسَ، وَيَصْبِرُ عَلَى أَذَاهُمْ، خَيْرٌ مِنَ الَّذِي لاَ يُخَالِطُ النَّاسَ، وَلاَ يَصْبِرُ عَلَى أَذَاهُمْ‏.‏","english":{"narrator":"","text":"Ibn 'Umar reported that the Prophet, may Allah bless him and grant\nhim peace, said, \"The believer who mixes with people and endures their\ninjury is better than the person who does not mix with people nor endure\ntheir injury.\""}},{"id":5,"idInBook":5,"chapterId":21,"bookId":15,"arabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ‏:‏ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ سُفْيَانَ قَالَ‏:‏ حَدَّثَنِي الأَعْمَشُ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ لَيْسَ أَحَدٌ، أَوْ لَيْسَ شَيْءٌ، أَصْبَرَ عَلَى أَذًى يَسْمَعُهُ مِنَ اللهِ عَزَّ وَجَلَّ، وَإِنَّهُمْ لَيَدَّعُونَ لَهُ وَلَدًا، وَإِنَّهُ لَيُعَافِيهِمْ وَيَرْزُقُهُمْ‏.‏","english":{"narrator":"","text":"Abu Musa reported that the Prophet, may Allah bless him and grant\nhim peace, said, \"No one - nothing - is more patient in enduring\nan injury which he hears than Allah Almighty. They claim that He has a\nson, and yet He still cures them and provides for them.\""}},{"id":6,"idInBook":6,"chapterId":21,"bookId":15,"arabic":"حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، قَالَ‏:‏ حَدَّثَنَا أَبِي، قَالَ‏:‏ حَدَّثَنَا الأَعْمَشُ قَالَ‏:‏ سَمِعْتُ شَقِيقًا يَقُولُ‏:‏ قَالَ عَبْدُ اللهِ‏:‏ قَسَمَ النَّبِيُّ صلى الله عليه وسلم قِسْمَةً، كَبَعْضِ مَا كَانَ يَقْسِمُ، فَقَالَ رَجُلٌ مِنَ الأَنْصَارِ‏:‏ وَاللَّهِ، إِنَّهَا لَقِسْمَةٌ مَا أُرِيدَ بِهَا وَجْهَ اللهِ عَزَّ وَجَلَّ، قُلْتُ أَنَا‏:‏ لَأَقُولَنَّ لِلنَّبِيِّ صلى الله عليه وسلم، فَأَتَيْتُهُ، وَهُوَ فِي أَصْحَابِهِ، فَسَارَرْتُهُ، فَشَقَّ ذَلِكَ عَلَيْهِ صلى الله عليه وسلم وَتَغَيَّرَ وَجْهُهُ، وَغَضِبَ، حَتَّى وَدِدْتُ أَنِّي لَمْ أَكُنْ أَخْبَرَتْهُ، ثُمَّ قَالَ‏:‏ قَدْ أُوذِيَ مُوسَى بِأَكْثَرَ مِنْ ذَلِكَ فَصَبَرَ‏.‏","english":{"narrator":"","text":"'Abdullah said, \"The Prophet, may Allah bless him and grant him\npeace, swore an oath like one of the oaths that people swear and a man\nof the Ansar said, 'By Allah, it is not an oath by which the Face of Allah\nAlmighty is desired.\" I said, 'I will tell the Prophet, may Allah bless\nhim and grant him peace. I went to him while he was with his Companions\nand I spoke to him in confidence. It clearly affected him greatly, may\nAllah bless him and grant him peace, and his face changed colour so that\nI wished that I had not told him. Then he said, 'Musa was injured with\ngreater than that and he endured it.'\""}},{"id":7,"idInBook":7,"chapterId":21,"bookId":15,"arabic":"حَدَّثَنَا صَدَقَةُ، قَالَ‏:‏ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ أُمِّ الدَّرْدَاءِ، عَنْ أَبِي الدَّرْدَاءِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ أَلاَ أُنَبِّئُكُمْ بِدَرَجَةٍ أَفْضَلَ مِنَ الصَّلاَةِ وَالصِّيَامِ وَالصَّدَقَةِ‏؟‏ قَالُوا‏:‏ بَلَى، قَالَ‏:‏ صَلاَحُ ذَاتِ الْبَيْنِ، وَفَسَادُ ذَاتِ الْبَيْنِ هِيَ الْحَالِقَةُ‏.‏","english":{"narrator":"","text":"Abu'd-Darda' reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"Shall I tell you a degree better than prayer, fasting\nand sadaqa?\" \"Yes,\" they replied. He went to say, Improving a state of\nfriendship. Causing discord in a state of friendship is what shaves things\naway.\""}},{"id":8,"idInBook":8,"chapterId":21,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى، قَالَ‏:‏ حَدَّثَنَا عَبَّادُ بْنُ الْعَوَّامِ، قَالَ‏:‏ أَخْبَرَنَا سُفْيَانُ بْنُ الْحُسَيْنِ، عَنِ الْحَكَمِ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عَبَّاسٍ‏:‏ ‏{‏فَاتَّقُوا اللَّهَ وَأَصْلِحُوا ذَاتَ بَيْنِكُمْ‏}‏، قَالَ‏:‏ هَذَا تَحْرِيجٌ مِنَ اللهِ عَلَى الْمُؤْمِنِينَ أَنْ يَتَّقُوا اللَّهَ وَأَنْ يُصْلِحُوا ذَاتَ بَيْنِهِمْ‏.‏","english":{"narrator":"Regarding the ayat:","text":"\"Fear Allah and put things right between\nyou,\" (8:1), Ibn 'Abbas said, \"This is an injunction from Allah to\nthe believers to fear Allah and to put things right between them.\""}},{"id":9,"idInBook":9,"chapterId":21,"bookId":15,"arabic":"حَدَّثَنَا حَيْوَةُ بْنُ شُرَيْحٍ، قَالَ‏:‏ حَدَّثَنَا بَقِيَّةُ، عَنْ ضُبَارَةَ بْنِ مَالِكٍ الْحَضْرَمِيِّ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرِ بْنِ نُفَيْرٍ، أَنَّ أَبَاهُ حَدَّثَهُ، أَنَّ سُفْيَانَ بْنَ أُسَيْدٍ الْحَضْرَمِيَّ حَدَّثَهُ، أَنَّهُ سَمِعَ النَّبِيَّ صلى الله عليه وسلم يَقُولُ‏:‏ كَبُرَتْ خِيَانَةً أَنْ تُحَدِّثَ أَخَاكَ حَدِيثًا هُوَ لَكَ مُصَدِّقٌ، وَأَنْتَ لَهُ كَاذِبٌ‏.‏","english":{"narrator":"","text":"Sufyan ibn Usayd al-Hadrami reported that he heard the Prophet,\nmay Allah bless him and grant him peace, say, \"It is great treachery to\ntell something to your brother so that he believes you when you are lying\nto him.\""}},{"id":10,"idInBook":10,"chapterId":21,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ سَعِيدٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مُحَمَّدٍ الْمُحَارِبِيُّ، عَنْ لَيْثٍ، عَنْ عَبْدِ الْمَلِكِ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ لاَ تُمَارِ أَخَاكَ، وَلاَ تُمَازِحْهُ، وَلاَ تَعِدْهُ مَوْعِدًا فَتُخْلِفَهُ‏.‏","english":{"narrator":"","text":"Ibn 'Abbas reported that the Messenger of Allah, may Allah bless him and grant him peace, said, \"Do not dispute with your brother. Do not make fun of him. Do not make a promise to him and  then break it.\""}},{"id":11,"idInBook":11,"chapterId":21,"bookId":15,"arabic":"حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ عَجْلاَنَ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ شُعْبَتَانِ لاَ تَتْرُكُهُمَا أُمَّتِي‏:‏ النِّيَاحَةُ وَالطَّعْنُ فِي الأَنْسَابِ‏.‏","english":{"narrator":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"There are two courses that my Community will not\nabandon:","text":"wailing and attacking a person's lineage.\""}},{"id":12,"idInBook":12,"chapterId":21,"bookId":15,"arabic":"حَدَّثَنَا زَكَرِيَّا، قَالَ‏:‏ حَدَّثَنَا الْحَكَمُ بْنُ الْمُبَارَكِ، قَالَ‏:‏ حَدَّثَنَا زِيَادُ بْنُ الرَّبِيعِ قَالَ‏:‏ حَدَّثَنِي عَبَّادٌ الرَّمْلِيُّ قَالَ‏:‏ حَدَّثَتْنِي امْرَأَةٌ يُقَالُ لَهَا‏:‏ فُسَيْلَةُ، قَالَتْ‏:‏ سَمِعْتُ أَبِي يَقُولُ‏:‏ قُلْتُ‏:‏ يَا رَسُولَ اللهِ، أَمِنَ الْعَصَبِيَّةِ أَنْ يُعِينَ الرَّجُلُ قَوْمَهُ عَلَى ظُلْمٍ‏؟‏ قَالَ‏:‏ نَعَمْ‏.‏","english":{"narrator":"","text":"A woman called Fusayla said that she heard her father say, \"I asked,\n'Messenger of Allah, is it part of disobedience for a man to help his people\nin something which is unjust?' 'Yes,' he replied.\""}}],"chapter":{"id":21,"bookId":15,"arabic":"كتاب ذات البين","english":"Social Behaviour"}}