{"metadata":{"length":18,"arabic":{"title":"الأدب المفرد","author":"الإمام محمد بن إسماعيل البخاري","introduction":"كتاب الهجر"},"english":{"title":"Al-Adab Al-Mufrad","author":"Imam Muhammad ibn Ismail al-Bukhari","introduction":"Abandonment"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":22,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ صَالِحٍ قَالَ‏:‏ حَدَّثَنِي اللَّيْثُ قَالَ‏:‏ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ خَالِدٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَوْفِ بْنِ الْحَارِثِ بْنِ الطُّفَيْلِ، وَهُوَ ابْنُ أَخِي عَائِشَةَ لِأُمِّهَا، أَنَّ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا حُدِّثَتْ، أَنَّ عَبْدَ اللهِ بْنَ الزُّبَيْرِ قَالَ فِي بَيْعٍ، أَوْ عَطَاءٍ، أَعْطَتْهُ عَائِشَةُ‏:‏ وَاللَّهِ لَتَنْتَهِيَنَّ عَائِشَةُ أَوْ لَأَحْجُرَنَّ عَلَيْهَا، فَقَالَتْ‏:‏ أَهُوَ قَالَ هَذَا‏؟‏ قَالُوا‏:‏ نَعَمْ، قَالَتْ عَائِشَةُ‏:‏ فَهُوَ لِلَّهِ نَذْرٌ أَنْ لاَ أُكَلِّمَ ابْنَ الزُّبَيْرِ كَلِمَةً أَبَدًا، فَاسْتَشْفَعَ ابْنُ الزُّبَيْرِ بِالْمُهَاجِرِينَ حِينَ طَالَتْ هِجْرَتُهَا إِيَّاهُ، فَقَالَتْ‏:‏ وَاللَّهِ، لاَ أُشَفِّعُ فِيهِ أَحَدًا أَبَدًا، وَلاَ أُحَنِّثُ نَذْرِي الَّذِي نَذَرْتُ أَبَدًا‏.‏ فَلَمَّا طَالَ عَلَى ابْنِ الزُّبَيْرِ كَلَّمَ الْمِسْوَرَ بْنَ مَخْرَمَةَ وَعَبْدَ الرَّحْمَنِ بْنَ الأَسْوَدِ بْنِ يَغُوثَ، وَهُمَا مِنْ بَنِي زُهْرَةَ، فَقَالَ لَهُمَا‏:‏ أَنْشُدُكُمَا بِاللَّهِ إِلاَّ أَدْخَلْتُمَانِي عَلَى عَائِشَةَ، فَإِنَّهَا لاَ يَحِلُّ لَهَا أَنْ تَنْذِرَ قَطِيعَتِي، فَأَقْبَلَ بِهِ الْمِسْوَرُ وَعَبْدُ الرَّحْمَنِ مُشْتَمِلَيْنِ عَلَيْهِ بِأَرْدِيَتِهِمَا، حَتَّى اسْتَأْذَنَا عَلَى عَائِشَةَ فَقَالاَ‏:‏ السَّلاَمُ عَلَيْكِ وَرَحْمَةُ اللهِ وَبَرَكَاتُهُ، أَنَدْخُلُ‏؟‏ فَقَالَتْ عَائِشَةُ‏:‏ ادْخُلُوا، قَالاَ‏:‏ كُلُّنَا يَا أُمَّ الْمُؤْمِنِينَ‏؟‏ قَالَتْ‏:‏ نَعَمْ، ادْخُلُوا كُلُّكُمْ‏.‏ وَلاَ تَعْلَمُ عَائِشَةُ أَنَّ مَعَهُمَا ابْنَ الزُّبَيْرِ، فَلَمَّا دَخَلُوا دَخَلَ ابْنُ الزُّبَيْرِ فِي الْحِجَابِ، وَاعْتَنَقَ عَائِشَةَ وَطَفِقَ يُنَاشِدُهَا يَبْكِي، وَطَفِقَ الْمِسْوَرُ وَعَبْدُ الرَّحْمَنِ يُنَاشِدَانِ عَائِشَةَ إِلاَّ كَلَّمَتْهُ وَقَبِلَتْ مِنْهُ، وَيَقُولاَنِ‏:‏ قَدْ عَلِمْتِ أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم نَهَى عَمَّا قَدْ عَلِمْتِ مِنَ الْهِجْرَةِ، وَأَنَّهُ لاَ يَحِلُّ لِلرَّجُلِ أَنْ يَهْجُرَ أَخَاهُ فَوْقَ ثَلاَثِ لَيَالٍ‏.‏ قَالَ‏:‏ فَلَمَّا أَكْثَرُوا التَّذْكِيرَ وَالتَّحْرِيجَ طَفِقَتْ تُذَكِّرُهُمْ وَتَبْكِي وَتَقُولُ‏:‏ إِنِّي قَدْ نَذَرْتُ وَالنَّذْرُ شَدِيدٌ، فَلَمْ يَزَالُوا بِهَا حَتَّى كَلَّمَتِ ابْنَ الزُّبَيْرِ، ثُمَّ أَعْتَقَتْ بِنَذْرِهَا أَرْبَعِينَ رَقَبَةً، ثُمَّ كَانَتْ تَذْكُرُ بَعْدَ مَا أَعْتَقَتْ أَرْبَعِينَ رَقَبَةً فَتَبْكِي حَتَّى تَبُلَّ دُمُوعُهَا خِمَارَهَا‏.‏","english":{"narrator":"'Awf ibn al-Harith ibn at-Tufayl, the nephew of 'A'isha, reported\nthat 'A'isha was told that 'Abdullah ibn az-Zubayr had said about something\nwhich 'A'isha was selling - or giving away as a gift, \"By Allah, if\nshe does not stop, I will debar her from disposing of her property!\" She\nasked, \"Is that truly so?\" \"Yes,\" they replied. 'A'isha exclaimed, \"I vow\nto Allah that I will never again speak a single word to Ibn az-Zubayr!\" When this desertion lasted long, 'Abdullah bin Az-Zubair sought intercession from the Mahajireen with her, but she said:","text":"\"By Allah I will not ever accept the intercession of anyone for him, and I will not ever break my vow that I have vowed.\" When it went on long for Ibn Az-Zubair, he spoke to Al-Miswar bin Makhramah and 'Abdur-Rahman bin Al-Aswad bin Yaghut and they were from Bani Zuhrah. So he said to them: \"I beseech you in the Name of Allah that you enter me upon (the place of) 'Aishah because it is unlawful for her to vow to sever relations with me.\" So Al-Miswar and 'Abdur-Rahman approached with him under their upper garments until they sought her permission, saying: \"As-salamu 'alaiki wa rahmatullahi wa barakatuhu! Shall we come in?\" 'Aishah (May Allah be pleased with her) said: \"Come in,\" They asked: \"All of us, o mother of the believers?\" She said: \"Yes all of you,\" and she did know that Ibn Az-Zubair was with them. So, when they entered, Ibn Az-Zubair entered the screened place and hugged 'Aishah (May Allah be pleased with her) and began beseeching her and wept. And Al-Miswar and 'Abdur-Rahman began to plead her to but speak to him and to accept from him, also saying to her: \"You know that the Messenger Allah ﷺ forbade what you know of abandonment and that it is not permissible for a man to abandon his brother over three nights.\" He said: So when they did a great deal of reminding and urging, she began remind them and weep, saying: \"I have made a vow which is a matter of very serious nature.\" They persisted in their appeal till she spoke with 'Abdullah bin Az-Zubair. Then she freed forty slaves as an expiation for breaking her vow. Later on she would remember, after freeing forty slaves, then she would weep so much that her veil would become wet with tears."}},{"id":2,"idInBook":2,"chapterId":22,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ قَالَ‏:‏ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم قَالَ‏:‏ لاَ تَبَاغَضُوا، وَلاَ تَحَاسَدُوا، وَلاَ تَدَابَرُوا، وَكُونُوا عِبَادَ اللهِ إِخْوَانًا، وَلاَ يَحِلُّ لِمُسْلِمٍ أَنْ يَهْجُرَ أَخَاهُ فَوْقَ ثَلاَثِ لَيَالٍ‏.‏","english":{"narrator":"","text":"Anas ibn Malik reported that the Messenger of Allah, may Allah\nbless him and grant him peace, said, \"Do not hate one another nor envy\none another nor shun one another. Slaves of Allah, be brothers! It is not\nlawful for a Muslim to refuse to speak to his brother (Muslim) for more\nthan three nights.\""}},{"id":3,"idInBook":3,"chapterId":22,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ صَالِحٍ قَالَ‏:‏ حَدَّثَنِي اللَّيْثُ قَالَ‏:‏ حَدَّثَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ ثُمَّ الْجُنْدَعِيِّ، أَنَّ أَبَا أَيُّوبَ صَاحِبَ رَسُولِ اللهِ صلى الله عليه وسلم أَخْبَرَهُ أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم قَالَ‏:‏ لاَ يَحِلُّ لأَحَدٍ أَنْ يَهْجُرَ أَخَاهُ فَوْقَ ثَلاَثِ لَيَالٍ، يَلْتَقِيَانِ فَيَصُدُّ هَذَا وَيَصُدُّ هَذَا، وَخَيْرُهُمَا الَّذِي يَبْدَأُ بِالسَّلامِ‏.‏","english":{"narrator":"","text":"Abu Ayyub, the Companion of the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"It is not lawful for anyone to cut himself\noff from his Muslim brother for more than three nights so that when they\nmeet, one of them turns his face away in avoidance and the other one turns\nhis face away as well. The better of them is the one who initiates the\ngreeting.\""}},{"id":4,"idInBook":4,"chapterId":22,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى، قَالَ‏:‏ حَدَّثَنَا وُهَيْبٌ، قَالَ‏:‏ حَدَّثَنَا سُهَيْلٌ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ لاَ تَبَاغَضُوا، وَلاَ تَنَافَسُوا، وَكُونُوا عِبَادَ اللهِ إِخْوَانًا‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"Do not hate one another nor contend with\none another. Slaves of Allah, be brothers.\""}},{"id":5,"idInBook":5,"chapterId":22,"bookId":15,"arabic":"حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانَ قَالَ‏:‏ حَدَّثَنِي ابْنُ وَهْبٍ قَالَ‏:‏ أَخْبَرَنِي عَمْرٌو، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ سِنَانِ بْنِ سَعْدٍ، عَنْ أَنَسٍ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم قَالَ‏:‏ مَا تَوَادَّ اثْنَانِ فِي اللهِ جَلَّ وَعَزَّ أَوْ فِي الإِسْلاَمِ، فَيُفَرِّقُ بَيْنَهُمَا إِلاَّ بِذَنْبٍ يُحْدِثُهُ أَحَدُهُمَا‏.‏","english":{"narrator":"","text":"Anas reported that the Messenger of Allah, may Allah bless him\nand grant him peace, said, \"Two people do not love each other in Allah\nAlmighty or in Islam if the first wrong action that one of them does creates\na split between them.\""}},{"id":6,"idInBook":6,"chapterId":22,"bookId":15,"arabic":"حَدَّثَنَا أَبُو مَعْمَرٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ يَزِيدَ قَالَ‏:‏ قَالَتْ مُعَاذَةَ‏:‏ سَمِعْتُ هِشَامَ بْنَ عَامِرٍ الأَنْصَارِيَّ، ابْنَ عَمِّ أَنَسِ بْنِ مَالِكٍ، وَكَانَ قُتِلَ أَبُوهُ يَوْمَ أُحُدٍ، أَنَّهُ سَمِعَ رَسُولَ اللهِ صلى الله عليه وسلم قَالَ‏:‏ لاَ يَحِلُّ لِمُسْلِمٍ أَنْ يُصَارِمَ مُسْلِمًا فَوْقَ ثَلاَثٍ، فَإِنَّهُمَا نَاكِبَانِ عَنِ الْحَقِّ مَا دَامَا عَلَى صِرَامِهِمَا، وَإِنَّ أَوَّلَهُمَا فَيْئًا يَكُونُ كَفَّارَةً عَنْهُ سَبْقُهُ بِالْفَيْءِ، وَإِنْ مَاتَا عَلَى صِرَامِهِمَا لَمْ يَدْخُلاَ الْجَنَّةَ جَمِيعًا أَبَدًا، وَإِنْ سَلَّمَ عَلَيْهِ فَأَبَى أَنْ يَقْبَلَ تَسْلِيمَهُ وَسَلاَمَهُ، رَدَّ عَلَيْهِ الْمَلَكُ، وَرَدَّ عَلَى الْآخَرِ الشَّيْطَانُ‏.‏","english":{"narrator":"","text":"Hisham ibn 'Amir al-Ansari, the cousin of Anas ibn Malik whose\nfather was killed in the Battle of Uhud, that he heard the Messenger of\nAllah, may Allah bless him and grant him peace, say, \"It is not lawful\nfor a Muslim to snub another Muslim for more than three nights. As long\nas they are cut off from each other, they are turning away from the Truth.\nThe first of them to return to a proper state has his expiation for that\ninasmuch as he was the first to return to a proper state. If they die while\nthey are cut off from each other, neither of them will ever enter the Garden.\nIf one of them greets the other and he refuses to return the greeting or\naccept his greeting, then an angel returns the greeting to him and Shaytan\nanswers the other.\""}},{"id":7,"idInBook":7,"chapterId":22,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدَةُ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ إِنِّي لَأَعْرِفُ غَضَبَكِ وَرِضَاكِ، قَالَتْ‏:‏ قُلْتُ‏:‏ وَكَيْفَ تَعْرِفُ ذَلِكَ يَا رَسُولَ اللهِ‏؟‏ قَالَ‏:‏ إِنَّكِ إِذَا كُنْتِ رَاضِيَةً قُلْتِ‏:‏ بَلَى، وَرَبِّ مُحَمَّدٍ، وَإِذَا كُنْتِ سَاخِطَةً قُلْتِ‏:‏ لاَ، وَرَبِّ إِبْرَاهِيمَ، قَالَتْ‏:‏ قُلْتُ‏:‏ أَجَلْ، لَسْتُ أُهَاجِرُ إِلا اسْمَكَ‏.‏","english":{"narrator":"","text":"'A'isha mentioned that the Messenger of Allah, may Allah bless\nhim and grant him peace, told her, \"I can see you when you are angry or\npleased.\" She asked, \"How do you see that, Messenger of Allah?\" He replied,\n\"When you are pleased, you say, 'Yes, by the Lord of Muhammad.' But when\nyou are angry, you say, 'No, by the Lord of Ibrahim.'\" She said that she\nreplied, \"Yes, I only cut out your name.\""}},{"id":8,"idInBook":8,"chapterId":22,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ يَزِيدَ، قَالَ‏:‏ حَدَّثَنَا حَيْوَةُ قَالَ‏:‏ حَدَّثَنِي أَبُو عُثْمَانَ الْوَلِيدُ بْنُ أَبِي الْوَلِيدِ الْمَدَنِيُّ، أَنَّ عِمْرَانَ بْنَ أَبِي أَنَسٍ حَدَّثَهُ، عَنْ أَبِي خِرَاشٍ السُّلَمِيِّ، أَنَّهُ سَمِعَ رَسُولَ اللهِ صلى الله عليه وسلم يَقُولُ‏:‏ مَنْ هَجَرَ أَخَاهُ سَنَةً، فَهُوَ كَسَفْكِ دَمِهِ‏.‏","english":{"narrator":"","text":"Abu Khirash al-Aslami reported that he heard the Messenger of Allah,\nmay Allah bless him and grant him peace, say, \"Whoever snubs his brother\nfor a year has split his blood.\""}},{"id":9,"idInBook":9,"chapterId":22,"bookId":15,"arabic":"حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ، قَالَ‏:‏ أَخْبَرَنَا يَحْيَى بْنُ أَيُّوبَ قَالَ‏:‏ حَدَّثَنِي الْوَلِيدُ بْنُ أَبِي الْوَلِيدِ الْمَدَنِيُّ، أَنَّ عِمْرَانَ بْنَ أَبِي أَنَسٍ حَدَّثَهُ، أَنَّ رَجُلاً مِنْ أَسْلَمَ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم حَدَّثَهُ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ هِجْرَةُ الْمُسْلِمِ سَنَةً كَدَمِهِ، وَفِي الْمَجْلِسِ مُحَمَّدُ بْنُ الْمُنْكَدِرِ، وَعَبْدُ اللهِ بْنُ أَبِي عَتَّابٍ، فَقَالاَ‏:‏ قَدْ سَمِعْنَا هَذَا عَنْهُ‏.‏","english":{"narrator":"","text":"'Imran ibn Abi Anas reported from a man of Aslam who was one of\nthe Companions of the Prophet, may Allah bless him and grant him peace,\nthat the Prophet, may Allah bless him and grant him peace, said, \"Snubbing\na believer for a year is like spilling his blood.\""}},{"id":10,"idInBook":10,"chapterId":22,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ قَالَ‏:‏ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ، عَنْ أَبِي أَيُّوبَ الأَنْصَارِيِّ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم قَالَ‏:‏ لاَ يَحِلُّ لِمُسْلِمٍ أَنْ يَهْجُرَ أَخَاهُ فَوْقَ ثَلاَثَةِ أَيَّامٍ، يَلْتَقِيَانِ فَيُعْرِضُ هَذَا وَيُعْرِضُ هَذَا، وَخَيْرُهُمَا الَّذِي يَبْدَأُ بِالسَّلامِ‏.‏","english":{"narrator":"","text":"Abu Ayyub al-Ansari reported that the Messenger of Allah, may Allah\nbless him and grant him peace, said, \"It is not lawful for a Muslim to\nrefuse to speak to his (Muslim) brother for more than three days so that\nwhen they meet, one goes this way and the goes that way. The better of\nthe two is the one who initiates the greeting.\""}},{"id":11,"idInBook":11,"chapterId":22,"bookId":15,"arabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ يَزِيدَ، عَنْ مُعَاذَةَ، أَنَّهَا سَمِعَتْ هِشَامَ بْنَ عَامِرٍ يَقُولُ‏:‏ سَمِعْتُ رَسُولَ اللهِ صلى الله عليه وسلم يَقُولُ‏:‏ لاَ يَحِلُّ لِمُسْلِمٍ أَنْ يُصَارِمَ مُسْلِمًا فَوْقَ ثَلاَثِ لَيَالٍ، فَإِنَّهُمَا مَا صَارَمَا فَوْقَ ثَلاَثِ لَيَالٍ، فَإِنَّهُمَا نَاكِبَانِ عَنِ الْحَقِّ مَا دَامَا عَلَى صِرَامِهِمَا، وَإِنَّ أَوَّلَهُمَا فَيْئًا يَكُونُ كَفَّارَةً لَهُ سَبْقُهُ بِالْفَيْءِ، وَإِنْ هُمَا مَاتَا عَلَى صِرَامِهِمَا لَمْ يَدْخُلاَ الْجَنَّةَ جَمِيعًا‏.‏","english":{"narrator":"","text":"Hisham ibn 'Amir heard the Messenger of Allah, may Allah bless\nhim and grant him peace, say, \"It is not lawful for a Muslim to snub another\nMuslim for more than three nights. As long as they are cut off from each\nother, they are turning away from the Truth. The first of them to return\nto a proper state has his expiation for that inasmuch as he was the first\nto return to a proper state. If they die while they are cut off from one\nanother, neither of them will ever enter the Garden.\""}},{"id":12,"idInBook":12,"chapterId":22,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلامٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدَةُ، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو، قَالَ‏:‏ حَدَّثَنَا أَبُو سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ لاَ تَبَاغَضُوا، وَلاَ تَحَاسَدُوا، وَكُونُوا عِبَادَ اللهِ إِخْوَانًا‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"Do not hate one another and do not envy\none another. Let the slaves of Allah be brothers.\""}},{"id":13,"idInBook":13,"chapterId":22,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدٌ، قَالَ‏:‏ حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، قَالَ‏:‏ حَدَّثَنَا أَبِي، قَالَ‏:‏ حَدَّثَنَا الأَعْمَشُ، قَالَ‏:‏ حَدَّثَنَا أَبُو صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ تَجِدُ مِنْ شَرِّ النَّاسِ يَوْمَ الْقِيَامَةِ عِنْدَ اللهِ ذَا الْوَجْهَيْنِ، الَّذِي يَأْتِي هَؤُلاَءِ بِوَجْهٍ، وَهَؤُلاَءِ بِوَجْهٍ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"You will find that the worst of people in the sight\nof Allah on the Day of Rising will be the two-faced person who presents\none face to a group of people and another face to a different group of\npeople.\""}},{"id":14,"idInBook":14,"chapterId":22,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَ‏:‏ أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامٍ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ إِيَّاكُمْ وَ الظَّنَّ، فَإِنَّ الظَّنَّ أَكْذَبُ الْحَدِيثِ، وَلاَ تَنَاجَشُوا، وَلاَ تَحَاسَدُوا، وَلاَ تَبَاغَضُوا، وَلاَ تَنَافَسُوا، وَلاَ تَدَابَرُوا وَكُونُوا عِبَادَ اللهِ إِخْوَانًا‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"Beware of opinion. Opinion is the most\nlying form of speech. Do not try to ensnare one another (in sales) nor\nenvy one another nor hate one another nor shun one another. Rather be the\nslaves of Allah and brothers.\""}},{"id":15,"idInBook":15,"chapterId":22,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ قَالَ‏:‏ حَدَّثَنِي مَالِكٌ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم قَالَ‏:‏ تُفْتَحُ أَبْوَابُ الْجَنَّةِ يَوْمَ الِاثْنَيْنِ وَيَوْمَ الْخَمِيسِ، فَيُغْفَرُ لِكُلِّ عَبْدٍ لاَ يُشْرِكُ بِاللَّهِ شَيْئًا، إِلاَّ رَجُلٌ كَانَتْ بَيْنَهُ وَبَيْنَ أَخِيهِ شَحْنَاءُ، فَيُقَالُ‏:‏ أَنْظِرُوا هَذَيْنِ حَتَّى يَصْطَلِحَا‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"The gates of the Garden are opened on Mondays\nand Thursdays. Every person who does not associate anything with Allah\nis forgiven except for someone who has enmity between existing between\nhim and another man. It is said, 'Leave these two until they make peace.'\""}},{"id":16,"idInBook":16,"chapterId":22,"bookId":15,"arabic":"حَدَّثَنَا بِشْرُ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ اللهِ، قَالَ‏:‏ أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ قَالَ‏:‏ أَخْبَرَنِي أَبُو إِدْرِيسَ، أَنَّهُ سَمِعَ أَبَا الدَّرْدَاءِ يَقُولُ‏:‏ أَلاَ أُحَدِّثُكُمْ بِمَا هُوَ خَيْرٌ لَكُمْ مِنَ الصَّدَقَةِ وَالصِّيَامِ‏؟‏ صَلاَحُ ذَاتِ الْبَيْنِ، أَلاَ وَإِنَّ الْبُغْضَةَ هِيَ الْحَالِقَةُ‏.‏","english":{"narrator":"","text":"Abu'd-Darda' said, \"Shall I tell you about something better for\nyou than sadaqa and fasting? Improving the state of friendship. Hatred\nis what shaves things away.\""}},{"id":17,"idInBook":17,"chapterId":22,"bookId":15,"arabic":"حَدَّثَنَا سَعِيدُ بْنُ سُلَيْمَانَ، قَالَ‏:‏ حَدَّثَنَا أَبُو شِهَابٍ، عَنْ لَيْثٍ، عَنْ أَبِي فَزَارَةَ، عَنْ يَزِيدَ بْنِ الأَصَمِّ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ ثَلاَثٌ مَنْ لَمْ يَكُنَّ فِيهِ، غُفِرَ لَهُ مَا سِوَاهُ لِمَنْ شَاءَ، مَنْ مَاتَ لاَ يُشْرِكُ بِاللَّهِ شَيْئًا، وَلَمْ يَكُنْ سَاحِرًا يَتَّبِعُ السَّحَرَةَ، وَلَمْ يَحْقِدْ عَلَى أَخِيهِ‏.‏","english":{"narrator":"Ibn 'Abbas reported that the Prophet, may Allah bless him and grant\nhim peace, said, \"Three things are not concealed and He forgives everything\nelse to whomever He wills:","text":"the one who dies and has not associated anything\nwith Allah, the one who was not a sorcerer nor a follower of the sorcerers,\nand the one who did not have rancour towards his brother.\""}},{"id":18,"idInBook":18,"chapterId":22,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ قَالَ‏:‏ حَدَّثَنِي مُحَمَّدُ بْنُ هِلاَلِ بْنِ أَبِي هِلاَلٍ مَوْلَى ابْنِ كَعْبٍ الْمَذْحِجِيِّ، عَنْ أَبِيهِ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ قَالَ‏:‏ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ‏:‏ لاَ يَحِلُّ لِرَجُلٍ أَنْ يَهْجُرَ مُؤْمِنًا فَوْقَ ثَلاَثَةِ أَيَّامٍ، فَإِذَا مَرَّتْ ثَلاَثَةُ أَيَّامٍ فَلْيَلْقَهُ فَلْيُسَلِّمْ عَلَيْهِ، فَإِنْ رَدَّ عَلَيْهِ السَّلاَمَ فَقَدِ اشْتَرَكَا فِي الأَجْرِ، وَإِنْ لَمْ يَرُدَّ عَلَيْهِ فَقَدْ بَرِئ الْمُسْلِمُ مِنَ الْهِجْرَةِ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that he heard the Prophet, may Allah bless\nhim and grant him peace, say, \"It is not lawful for a Muslim man to refuse\nto speak to a believer for more than three days. When three days have passed,\nhe should meet him and greet him. If he returns the greeting, they share\nin the reward. If he does not return the greeting, the one who gives the\ngreeting is innocent of having severed relations.\""}}],"chapter":{"id":22,"bookId":15,"arabic":"كتاب الهجر","english":"Abandonment"}}