{"metadata":{"length":23,"arabic":{"title":"الأدب المفرد","author":"الإمام محمد بن إسماعيل البخاري","introduction":"كتاب السِّبَابِ"},"english":{"title":"Al-Adab Al-Mufrad","author":"Imam Muhammad ibn Ismail al-Bukhari","introduction":"Disparaging"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":24,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ أُمَيَّةَ، قَالَ‏:‏ حَدَّثَنَا عِيسَى بْنُ مُوسَى، عَنْ عَبْدِ اللهِ بْنِ كَيْسَانَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ قَالَ‏:‏ اسْتَبَّ رَجُلاَنِ عَلَى عَهْدِ رَسُولِ اللهِ صلى الله عليه وسلم، فَسَبَّ أَحَدُهُمَا وَالْآخَرُ سَاكِتٌ، وَالنَّبِيُّ صلى الله عليه وسلم جَالِسٌ، ثُمَّ رَدَّ الْآخَرُ‏.‏ فَنَهَضَ النَّبِيُّ صلى الله عليه وسلم، فَقِيلَ‏:‏ نَهَضْتَ‏؟‏ قَالَ‏:‏ نَهَضَتِ الْمَلاَئِكَةُ فَنَهَضْتُ مَعَهُمْ، إِنَّ هَذَا مَا كَانَ سَاكِتًا رَدَّتِ الْمَلاَئِكَةُ عَلَى الَّذِي سَبَّهُ، فَلَمَّا رَدَّ نَهَضَتِ الْمَلاَئِكَةُ‏.‏","english":{"narrator":"","text":"Ibn 'Abbas said, \"Two men defamed one another in the time of the\nMessenger of Allah, may Allah bless him and grant him peace. One of them\nreviled the other who remained silent. The Prophet, may Allah bless him\nand grant him peace, remained seated. Then the other man answered him back\nand the Prophet, may Allah bless him and grant him peace, got up. He was\nasked, \"You got up?\" He said, \"The angels left, so I left with them. While\nthis man was silent, the angels were answering the one who cursed him.\nWhen he answered, the angels left.\""}},{"id":2,"idInBook":2,"chapterId":24,"bookId":15,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، قَالَ‏:‏ حَدَّثَنَا رُدَيْحُ بْنُ عَطِيَّةَ، قَالَ‏:‏ حَدَّثَنَا إِبْرَاهِيمُ بْنُ أَبِي عَبْلَةَ، عَنْ أُمِّ الدَّرْدَاءِ أَنَّ رَجُلاً أَتَاهَا فَقَالَ‏:‏ إِنَّ رَجُلاً نَالَ مِنْكِ عِنْدَ عَبْدِ الْمَلِكِ، فَقَالَتْ‏:‏ إِنْ نُؤْبَنَ بِمَا لَيْسَ فِينَا، فَطَالَمَا زُكِّينَا بِمَا لَيْسَ فِينَا‏.‏","english":{"narrator":"","text":"Umm ad-Darda' reported that a man came up to her and said, \"A man\nhas said bad things about you in the presence of 'Abdu'l-Malik.' She said,\n\"We are suspected of something which we did not do. How often we have been\npraised for what we did not do!\""}},{"id":3,"idInBook":3,"chapterId":24,"bookId":15,"arabic":"حَدَّثَنَا شِهَابُ بْنُ عَبَّادٍ، قَالَ‏:‏ حَدَّثَنَا إِبْرَاهِيمُ بْنُ حُمَيْدٍ الرُّؤَاسِيُّ، عَنْ إِسْمَاعِيلَ، عَنْ قَيْسٍ قَالَ‏:‏ قَالَ عَبْدُ اللهِ‏:‏ إِذَا قَالَ الرَّجُلُ لِصَاحِبِهِ‏:‏ أَنْتَ عَدُوِّي، فَقَدْ خَرَجَ أَحَدُهُمَا مِنَ الإِسْلاَمِ، أَوْ بَرِئ مِنْ صَاحِبِهِ‏.‏","english":{"narrator":"","text":"'Abdullah said, \"When a man says to his companion, 'You are my\nenemy,' then one of them has left Islam or he is innocent of what his companion\nsaid.'\""}},{"id":4,"idInBook":4,"chapterId":24,"bookId":15,"arabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْوَاحِدِ، قَالَ‏:‏ حَدَّثَنَا لَيْثٌ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، أَظُنُّهُ رَفَعَهُ، شَكَّ لَيْثٌ، قَالَ‏:‏ فِي ابْنِ آدَمَ سِتُّونَ وَثَلاَثُمِئَةِ سُلاَمَى، أَوْ عَظْمٍ، أَوْ مَفْصِلٍ، عَلَى كُلِّ وَاحِدٍ فِي كُلِّ يَوْمٍ صَدَقَةٌ، كُلُّ كَلِمَةٍ طَيْبَةٍ صَدَقَةٌ، وَعَوْنُ الرَّجُلِ أَخَاهُ صَدَقَةٌ، وَالشَّرْبَةُ مِنَ الْمَاءِ يَسْقِيهَا صَدَقَةٌ، وَإِمَاطَةُ الأَذَى عَنِ الطَّرِيقِ صَدَقَةٌ‏.‏","english":{"narrator":"","text":"Ibn 'Abbas said, \"There are 360 joints and each of them owes sadaqa\nevery single day. Every good word is sadaqa. A man's helping his brother\nis sadaqa. A drink of water which he gives is sadaqa. Removing something\nharmful from the road is sadaqa.\""}},{"id":5,"idInBook":5,"chapterId":24,"bookId":15,"arabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، قَالَ‏:‏ حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، قَالَ‏:‏ حَدَّثَنَا الْعَلاَءُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ الْمُسْتَبَّانِ مَا قَالاَ فَعَلَى الْبَادِئِ، مَا لَمْ يَعْتَدِ الْمَظْلُومُ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"When two people revile each other, the responsibility\nfor what they say rests on the first to speak as long as the one who wronged\ndoes not become excessive.\""}},{"id":6,"idInBook":6,"chapterId":24,"bookId":15,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ عِيسَى، قَالَ‏:‏ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ‏:‏ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ سِنَانِ بْنِ سَعْدٍ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ الْمُسْتَبَّانِ مَا قَالاَ، فَعَلَى الْبَادِئِ، حَتَّى يَعْتَدِيَ الْمَظْلُومُ‏.‏","english":{"narrator":"","text":"As 423, but from Anas."}},{"id":7,"idInBook":7,"chapterId":24,"bookId":15,"arabic":"وَقَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ أَتَدْرُونَ مَا الْعَضْهُ‏؟‏ قَالُوا‏:‏ اللَّهُ وَرَسُولُهُ أَعْلَمُ، قَالَ‏:‏ نَقْلُ الْحَدِيثِ مِنْ بَعْضِ النَّاسِ إِلَى بَعْضٍ، لِيُفْسِدُوا بَيْنَهُمْ‏.‏","english":{"narrator":"","text":"The Prophet, may Allah bless him and grant him peace, said, \"Do you know what calumny is?\" They said, \"No, Allah and His Messenger know best.\" He said, \"Telling people what other people have said in order to create dissension between them.\""}},{"id":8,"idInBook":8,"chapterId":24,"bookId":15,"arabic":"وَقَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ إِنَّ اللَّهَ عَزَّ وَجَلَّ أَوْحَى إِلَيَّ أَنْ تَوَاضَعُوا، وَلاَ يَبْغِ بَعْضُكُمْ عَلَى بَعْضٍ‏.‏","english":{"narrator":"","text":"The Prophet, may Allah bless him and grant him peace, said, \"Allah\nAlmighty revealed to me that you should be humble and that you should not\nwrong one another.\""}},{"id":9,"idInBook":9,"chapterId":24,"bookId":15,"arabic":"حَدَّثَنَا عَمْرُو بْنُ مَرْزُوقٍ، قَالَ‏:‏ أَخْبَرَنَا عِمْرَانُ، عَنْ قَتَادَةَ، عَنْ يَزِيدَ بْنِ عَبْدِ اللهِ بْنِ الشِّخِّيرِ، عَنْ عِيَاضِ بْنِ حِمَارٍ قَالَ‏:‏ قُلْتُ‏:‏ يَا رَسُولَ اللهِ، الرَّجُلُ يَسُبُّنِي‏؟‏ قَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ الْمُسْتَبَّانِ شَيْطَانَانِ يَتَهَاتَرَانِ وَيَتَكَاذَبَانِ‏.‏","english":{"narrator":"","text":"'Iyad ibn Himar said, \"I said, 'Messenger of Allah, there is someone\nwho reviles me.' The Prophet, may Allah bless him and grant him peace,\nsaid, 'Those who revile one another are two shaytans who accuse one another\nand deny one another.'\""}},{"id":10,"idInBook":10,"chapterId":24,"bookId":15,"arabic":"حَدَّثَنَا أَحْمَدُ، قَالَ‏:‏ حَدَّثَنَا أَبِي قَالَ‏:‏ حَدَّثَنِي إِبْرَاهِيمُ، عَنْ حَجَّاجِ بْنِ حَجَّاجٍ، عَنْ قَتَادَةَ، عَنْ يَزِيدَ بْنِ عَبْدِ اللهِ، عَنْ عِيَاضِ بْنِ حِمَارٍ قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ إِنَّ اللَّهَ أَوْحَى إِلَيَّ أَنْ تَوَاضَعُوا حَتَّى لاَ يَبْغِيَ أَحَدٌ عَلَى أَحَدٍ، وَلاَ يَفْخَرَ أَحَدٌ عَلَى أَحَدٍ، فَقُلْتُ‏:‏ يَا رَسُولَ اللهِ، أَرَأَيْتَ لَوْ أَنَّ رَجُلاً سَبَّنِي فِي مَلَأٍ هُمْ أَنْقُصُ مِنِّي، فَرَدَدْتُ عَلَيْهِ، هَلْ عَلَيَّ فِي ذَلِكَ جُنَاحٌ‏؟‏ قَالَ‏:‏ الْمُسْتَبَّانِ شَيْطَانَانِ يَتَهَاتَرَانِ وَيَتَكَاذَبَانِ‏.‏\nقَالَ عِيَاضٌ‏:‏ وَكُنْتُ حَرْبًا لِرَسُولِ اللهِ صلى الله عليه وسلم فَأَهْدَيْتُ إِلَيْهِ نَاقَةً، قَبْلَ أَنْ أُسْلِمَ، فَلَمْ يَقْبَلْهَا وَقَالَ‏:‏ إِنِّي أَكْرَهُ زَبْدَ الْمُشْرِكِينَ‏.‏","english":{"narrator":"","text":"'Iyad ibn Himar reported that the Messenger of Allah, may Allah\nbless him and grant him peace, said, \"Allah has revealed to me that you\nshould be humble so that none of you will oppress anyone else and none\nof you will disdain another.' I said, 'Messenger of Allah, what do you\nthink I should do when a man reviles me in a low assembly and then I answer\nhim back? Do I incur any wrong action in doing that?' He replied, 'Two\nmen who revile one another are two shaytans who accuse one another and\ndeny one another.'\"\n\n'Iyad said, \"I was at war with the Messenger of Allah, may Allah bless him and grant him peace, and I gave him a she-camel before I became Muslim. He said, \"I dislike the froth of the idolaters.\""}},{"id":11,"idInBook":11,"chapterId":24,"bookId":15,"arabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى قَالَ‏:‏ أَخْبَرَنِي يَحْيَى بْنُ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ، عَنْ زَكَرِيَّا، عَنْ أَبِي إِسْحَاقَ، عَنْ مُحَمَّدِ بْنِ سَعْدِ بْنِ مَالِكٍ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ سِبَابُ الْمُسْلِمِ فُسُوقٌ‏.‏","english":{"narrator":"","text":"Sa'id ibn Malik reported that the Prophet, may Allah bless him\nand grant him peace, said, \"Reviling a Muslim is deviant behaviour.\""}},{"id":12,"idInBook":12,"chapterId":24,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سِنَانٍ، قَالَ‏:‏ أَخْبَرَنَا فُلَيْحُ بْنُ سُلَيْمَانَ، قَالَ‏:‏ حَدَّثَنَا هِلاَلُ بْنُ عَلِيٍّ، عَنْ أَنَسٍ قَالَ‏:‏ لَمْ يَكُنْ رَسُولُ اللهِ صلى الله عليه وسلم فَاحِشًا، وَلاَ لَعَّانًا، وَلاَ سَبَّابًا، كَانَ يَقُولُ عِنْدَ الْمَعْتَبَةِ‏:‏ مَا لَهُ تَرِبَ جَبِينُهُ‏.‏","english":{"narrator":"","text":"Anas said, \"The Messenger of Allah, may Allah bless him and grant\nhim peace, was neither coarse nor a curser nor a reviler, He used to say\nwhen he wanted to censure someone, 'What is wrong with him? May his brow\nbe dusty!'\""}},{"id":13,"idInBook":13,"chapterId":24,"bookId":15,"arabic":"حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، عَنْ زُبَيْدٍ قَالَ‏:‏ سَمِعْتُ أَبَا وَائِلٍ، عَنْ عَبْدِ اللهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم‏:‏ سِبَابُ الْمُسْلِمِ فُسُوقٌ، وَقِتَالُهُ كُفْرٌ‏.‏","english":{"narrator":"","text":"'Abdullah reported that the Prophet, may Allah bless him and grant\nhim peace, said, \"Reviling a Muslim is deviant behaviour and killing him\nis disbelief.\""}},{"id":14,"idInBook":14,"chapterId":24,"bookId":15,"arabic":"حَدَّثَنَا أَبُو مَعْمَرٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنِ الْحُسَيْنِ، عَنْ عَبْدِ اللهِ بْنِ بُرَيْدَةَ، قَالَ‏:‏ حَدَّثَنَا يَحْيَى بْنُ يَعْمَُرَ، أَنَّ أَبَا الأَسْوَدِ الدِّيلِيَّ حَدَّثَهُ، أَنَّهُ سَمِعَ أَبَا ذَرٍّ قَالَ‏:‏ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ‏:‏ لاَ يَرْمِي رَجُلٌ رَجُلاً بِالْفُسُوقِ، وَلاَ يَرْمِيهِ بِالْكُفْرِ، إِلاَّ ارْتَدَّتْ عَلَيْهِ، إِنْ لَمْ يَكُنْ صَاحِبُهُ كَذَلِكَ‏.‏","english":{"narrator":"","text":"Abu Dharr is reported as saying that he heard the Prophet, may\nAllah bless him and grant him peace, say, \"If a man accuses another man\nof deviance or accuses him of disbelief, that accusation will come back\non him if his companion is not as he said.\""}},{"id":15,"idInBook":15,"chapterId":24,"bookId":15,"arabic":"وَبِالسَّنَدِ، عَنْ أَبِي ذَرٍّ، سَمِعَ النَّبِيَّ صلى الله عليه وسلم يَقُولُ‏:‏ مَنِ ادَّعَى لِغَيْرِ أَبِيهِ وَهُوَ يَعْلَمُ فَقَدْ كَفَرَ، وَمَنِ ادَّعَى قَوْمًا لَيْسَ هُوَ مِنْهُمْ فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنَ النَّارِ، وَمَنْ دَعَا رَجُلاً بِالْكُفْرِ، أَوْ قَالَ‏:‏ عَدُوُّ اللهِ، وَلَيْسَ كَذَلِكَ إِلا حَارَتْ عَلَيْهِ‏.‏","english":{"narrator":"","text":"Abu Dharr states that he heard the Prophet, may Allah bless him\nand grant him peace, say, \"A person who knowingly claims a father other\nthan his own has disbelieved. A person who claims to be from a people when\nhe is not one of them will take his place in the Fire. A person who calls\na man an unbeliever or says, 'Enemy of Allah,' when that is not the case\nwill have that come back on him.\""}},{"id":16,"idInBook":16,"chapterId":24,"bookId":15,"arabic":"حَدَّثَنَا عُمَرُ، قَالَ‏:‏ حَدَّثَنَا أَبِي، قَالَ‏:‏ حَدَّثَنَا الأَعْمَشُ، قَالَ‏:‏ حَدَّثَنَا عَدِيُّ بْنُ ثَابِتٍ قَالَ‏:‏ سَمِعْتُ سُلَيْمَانَ بْنَ صُرَدٍ، رَجُلاً مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم، قَالَ‏:‏ اسْتَبَّ رَجُلاَنِ عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَغَضِبَ أَحَدُهُمَا، فَاشْتَدَّ غَضَبُهُ حَتَّى انْتَفَخَ وَجْهُهُ وَتَغَيَّرَ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ إِنِّي لَأَعْلَمُ كَلِمَةً لَوْ قَالَهَا لَذَهَبَ عَنْهُ الَّذِي يَجِدُ، فَانْطَلَقَ إِلَيْهِ الرَّجُلُ، فَأَخْبَرَهُ بِقَوْلِ النَّبِيِّ صلى الله عليه وسلم وَقَالَ‏:‏ تَعَوَّذْ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيمِ، وَقَالَ‏:‏ أَتَرَى بِي بَأْسًا، أَمَجْنُونٌ أَنَا‏؟‏ اذْهَبْ‏.‏","english":{"narrator":"","text":"Sulayman ibn Surad, one of the Companions of the Prophet, said,\n\"Two men reviled one another in the presence of the Prophet, may Allah\nbless him and grant him peace, and one of them became angry. He became\nso angry that his face puffed out and changed colour. The Prophet, may\nAllah bless him and grant him peace, said, 'I know some words which will\nmake what he feels depart if he says them.' The man came to him and told\nhim what the Prophet, may Allah bless him and grant him peace, had said,\nHe said, 'Seek refuge with Allah from the Accursed Shaytan.' He said, 'Do\nyou think that there is something wrong with me? Am I mad? Leave!'\""}},{"id":17,"idInBook":17,"chapterId":24,"bookId":15,"arabic":"حَدَّثَنَا خَلاَّدُ بْنُ يَحْيَى، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ، عَنْ عَمْرِو بْنِ سَلَمَةَ، عَنْ عَبْدِ اللهِ قَالَ‏:‏ مَا مِنْ مُسْلِمَيْنِ إِلاَّ بَيْنَهُمَا مِنَ اللهِ عَزَّ وَجَلَّ سِتْرٌ، فَإِذَا قَالَ أَحَدُهُمَا لِصَاحِبِهِ كَلِمَةَ هَجْرٍ فَقَدْ خَرَقَ سِتْرَ اللهِ، وَإِذَا قَالَ أَحَدُهُمَا لِلْآخَرِ‏:‏ أَنْتَ كَافِرٌ، فَقَدْ كَفَرَ أَحَدُهُمَا‏.‏","english":{"narrator":"","text":"'Abdullah said, \"There is a veil from Allah Almighty between every\ntwo Muslims. When one of them says ugly words to his companion, he has\nrent the veil of Allah. When one of them tells the other, 'You are an unbeliever,'\nthen one of them has disbelieved.\""}},{"id":18,"idInBook":18,"chapterId":24,"bookId":15,"arabic":"حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، قَالَ‏:‏ حَدَّثَنَا أَبِي، قَالَ‏:‏ حَدَّثَنَا الأَعْمَشُ، قَالَ‏:‏ حَدَّثَنَا مُسْلِمٌ، عَنْ مَسْرُوقٍ قَالَ‏:‏ قَالَتْ عَائِشَةُ‏:‏ صَنَعَ النَّبِيُّ صلى الله عليه وسلم شَيْئًا، فَرَخَّصَ فِيهِ، فَتَنَزَّهَ عَنْهُ قَوْمٌ، فَبَلَغَ ذَلِكَ النَّبِيَّ صلى الله عليه وسلم فَخَطَبَ، فَحَمِدَ اللَّهَ، ثُمَّ قَالَ‏:‏ مَا بَالُ أَقْوَامٍ يَتَنَزَّهُونَ عَنِ الشَّيْءِ أَصْنَعُهُ‏؟‏ فَوَاللَّهِ إِنِّي لَأَعْلَمُهُمْ بِاللَّهِ، وَأَشَدُّهُمْ لَهُ خَشْيَةً‏.‏","english":{"narrator":"","text":"'A'isha said, \"The Prophet, may Allah bless him and grant him peace,\ndid something and thereby created a dispensation for doing it. Some people\nstill refrained from doing. The Prophet, may Allah bless him and grant\nhim peace, heard about that and he gave a speech and praised Allah. Then\nhe said, 'What is wrong with people who restrain themselves from doing\nsomething which I do? By Allah, I know Allah better than they do and I\nfear Him more than they do!'\""}},{"id":19,"idInBook":19,"chapterId":24,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ الْمُبَارَكِ، قَالَ‏:‏ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ سَلْمٍ الْعَلَوِيِّ، عَنْ أَنَسٍ قَالَ‏:‏ كَانَ النَّبِيُّ صلى الله عليه وسلم قَلَّ مَا يُوَاجِهُ الرَّجُلَ بِشَيْءٍ يَكْرَهُهُ، فَدَخَلَ عَلَيْهِ يَوْمًا رَجُلٌ، وَعَلَيْهِ أَثَرُ صُفْرَةٍ، فَلَمَّا قَامَ قَالَ لأَصْحَابِهِ‏:‏ لَوْ غَيَّرَ، أَوْ نَزَعَ، هَذِهِ الصُّفْرَةَ‏.‏","english":{"narrator":"","text":"Anas said, \"The Prophet, may Allah bless him and grant him peace,\nrarely told a man something to his face which he disliked. One day a man\ncame to him with a trace of yellowish scent on him. When he stood up, he\nsaid to his Companions, 'If only he would change - or remove -\nthis yellow!'\""}},{"id":20,"idInBook":20,"chapterId":24,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْعَزِيزِ، قَالَ‏:‏ حَدَّثَنَا حُصَيْنٌ، عَنْ سَعْدِ بْنِ عُبَيْدَةَ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ قَالَ‏:‏ سَمِعْتُ عَلِيًّا رَضِيَ اللَّهُ عَنْهُ يَقُولُ‏:‏ بَعَثَنِي النَّبِيُّ صلى الله عليه وسلم وَالزُّبَيْرَ بْنَ الْعَوَّامِ، وَكِلاَنَا فَارِسٌ، فَقَالَ‏:‏ انْطَلِقُوا حَتَّى تَبْلُغُوا رَوْضَةَ كَذَا وَكَذَا، وَبِهَا امْرَأَةٌ مَعَهَا كِتَابٌ مِنْ حَاطِبٍ إِلَى الْمُشْرِكِينَ، فَأْتُونِي بِهَا، فَوَافَيْنَاهَا تَسِيرُ عَلَى بَعِيرٍ لَهَا حَيْثُ وَصَفَ لَنَا النَّبِيُّ صلى الله عليه وسلم، فَقُلْنَا‏:‏ الْكِتَابُ الَّذِي مَعَكِ‏؟‏ قَالَتْ‏:‏ مَا مَعِي كِتَابٌ، فَبَحَثْنَاهَا وَبَعِيرَهَا، فَقَالَ صَاحِبِي‏:‏ مَا أَرَى، فَقُلْتُ‏:‏ مَا كَذَبَ النَّبِيُّ صلى الله عليه وسلم، وَالَّذِي نَفْسِي بِيَدِهِ لَأُجَرِّدَنَّكِ أَوْ لَتُخْرِجِنَّهُ، فَأَهْوَتْ بِيَدِهَا إِلَى حُجْزَتِهَا وَعَلَيْهَا إِزَارٌ صُوفٌ، فَأَخْرَجَتْ، فَأَتَيْنَا النَّبِيَّ صلى الله عليه وسلم، فَقَالَ عُمَرُ‏:‏ خَانَ اللَّهَ وَرَسُولَهُ وَالْمُؤْمِنِينَ، دَعْنِي أَضْرِبْ عُنُقَهُ، وَقَالَ‏:‏ مَا حَمَلَكَ‏؟‏ فَقَالَ‏:‏ مَا بِي إِلاَّ أَنْ أَكُونَ مُؤْمِنًا بِاللَّهِ، وَأَرَدْتُ أَنْ يَكُونَ لِي عِنْدَ الْقَوْمِ يَدٌ، قَالَ‏:‏ صَدَقَ يَا عُمَرُ، أَوَ لَيْسَ قَدْ شَهِدَ بَدْرًا، لَعَلَّ اللَّهَ اطَّلَعَ إِلَيْهِمْ فَقَالَ‏:‏ اعْمَلُوا مَا شِئْتُمْ فَقَدْ وَجَبَتْ لَكُمُ الْجَنَّةُ، فَدَمَعَتْ عَيْنَا عُمَرَ وَقَالَ‏:‏ اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏","english":{"narrator":"","text":"'Ali said. \"The Prophet, may Allah bless him and grant him peace,\nsent for me and az-Zubayr ibn al-'Awwam while we were both on horseback\nand said, 'Go to such-and-such a meadow. There is a woman there who has\na letter with her from Hatib to the idolaters. Bring her to me.' We found\nher rising along on one of her camels as the Prophet, may Allah bless him\nand grant him peace, had described her. We said, ' the letter\nyou have with you.' 'I do not have any letter,' she replied. We searched\nand her camel. My companion said, 'I do not see it.' I said, 'The Prophet,\nmay Allah bless him and grant him peace, does not lie. By the One in whose\nhand my soul is, I will strip her unless she produces it!' She put her\nhand in the knot of her shawl - as she was wearing a black shawl -\nand brought it out. We went back to the Prophet, may Allah bless him and\ngrant him peace. 'Umar exclaimed, 'He (i.e. Hatim) has betrayed Allah,\nHis Messenger, and the believers! Let me strike off his head!' He asked,\n'What made you do it?' Hatim said, 'I believe in Allah, but I want to have\nsome authority with the people.' He said, ;He has spoken the truth, 'Umar.\nWas he not present at Badr? Perhaps Allah has looked on them and said,\n\"Do whatever you like. The Garden is guaranteed for you.\"' 'Umar wept and\nsaid, 'Allah and His Messenger know best.''\""}},{"id":21,"idInBook":21,"chapterId":24,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ، قَالَ‏:‏ حَدَّثَنَا مَالِكٌ، عَنْ عَبْدِ اللهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم قَالَ‏:‏ أَيُّمَا رَجُلٌ قَالَ لأَخِيهِ‏:‏ كَافِرٌ، فَقَدْ بَاءَ بِهَا أَحَدُهُمَا‏.‏","english":{"narrator":"","text":"'Abdullah ibn 'Umar reported that the Messenger of Allah, may Allah\nbless him and grant him peace, said, \"If a man says to his brother, 'You\nare an unbeliever,' it is true for one or the other of them.\""}},{"id":22,"idInBook":22,"chapterId":24,"bookId":15,"arabic":"حَدَّثَنَا سَعِيدُ بْنُ دَاوُدَ، قَالَ‏:‏ حَدَّثَنَا مَالِكٌ، أَنَّ نَافِعًا حَدَّثَهُ، أَنَّ عَبْدَ اللهِ بْنَ عُمَرَ أَخْبَرَهُ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم قَالَ‏:‏ إِذَا قَالَ لِلْآخَرِ‏:‏ كَافِرٌ، فَقَدْ كَفَرَ أَحَدُهُمَا، إِنْ كَانَ الَّذِي قَالَ لَهُ كَافِرًا فَقَدْ صَدَقَ، وَإِنْ لَمْ يَكُنْ كَمَا قَالَ لَهُ فَقَدْ بَاءَ الَّذِي قَالَ لَهُ بِالْكُفْرِ‏.‏","english":{"narrator":"","text":"'Abdullah ibn 'Umar reported that the Messenger of Allah, may Allah\nbless him and grant him peace, said, \"When someone says to another, 'Unbeliever!'\nthen one of them is an unbeliever. If the one to whom he says it is an\nunbeliever, he has spoke the truth. If that is not the case, then the one\nwho said it has brought down disbelief on himself.\""}},{"id":23,"idInBook":23,"chapterId":24,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنْ سُمَيٍّ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَتَعَوَّذُ مِنْ سُوءِ الْقَضَاءِ، وَشَمَاتَةِ الأعداء‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, used to seek refuge from an evil end and the glaoting\nof enemies."}}],"chapter":{"id":24,"bookId":15,"arabic":"كتاب السِّبَابِ","english":"Disparaging"}}