{"metadata":{"length":20,"arabic":{"title":"الأدب المفرد","author":"الإمام محمد بن إسماعيل البخاري","introduction":"كتاب السَّرَفِ فِي  الْبِنَاءِ"},"english":{"title":"Al-Adab Al-Mufrad","author":"Imam Muhammad ibn Ismail al-Bukhari","introduction":"Extravagance in Building"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":25,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ يُوسُفَ، قَالَ‏:‏ أَخْبَرَنَا مَالِكٌ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم قَالَ‏:‏ إِنَّ اللَّهَ يَرْضَى لَكُمْ ثَلاَثًا، وَيَسْخَطُ لَكُمْ ثَلاَثًا، يَرْضَى لَكُمْ‏:‏ أَنْ تَعْبُدُوهُ وَلاَ تُشْرِكُوا بِهِ شَيْئًا، وَأَنْ تَعْتَصِمُوا بِحَبْلِ اللهِ جَمِيعًا، وَأَنْ تَنَاصَحُوا مَنْ وَلاَّهُ اللَّهُ أَمْرَكُمْ، وَيَكْرَهُ لَكُمْ‏:‏ قِيلَ وَقَالَ، وَكَثْرَةَ السُّؤَالِ، وَإِضَاعَةَ الْمَالِ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"Allah is pleased with you about three things\nand He is angry with you about three things. He is pleased that you worship\nHim, not associating anything with Him, that you all take hold of the rope\nof Allah and that you give good counsel to those that Allah has put in\nauthority over you. He dislikes you engaging in chitchat, asking a lot\nof questions and squandering wealth.\""}},{"id":2,"idInBook":2,"chapterId":25,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ سَعِيدٍ، قَالَ‏:‏ حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، قَالَ‏:‏ حَدَّثَنَا إِسْمَاعِيلُ بْنُ زَكَرِيَّا، عَنْ عَمْرِو بْنِ قَيْسٍ الْمُلاَئِيِّ، عَنِ الْمِنْهَالِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، فِي قَوْلِهِ عَزَّ وَجَلَّ‏:‏ ‏{‏وَمَا أَنْفَقْتُمْ مِنْ شَيْءٍ فَهُوَ يَخْلُفُهُ وَهُوَ خَيْرُ الرَّازِقِينَ‏}‏، قَالَ‏:‏ فِي غَيْرِ إِسْرَافٍ، ولا تَقْتِيرٍ‏.‏","english":{"narrator":"","text":"In commenting on the words of Allah Almighty, \"Anything you\nspend will be replaced by Him. and He is the best of Providers,\" (34:39)\nIbn 'Abbas said, \"without extravagance or parsimony.\""}},{"id":3,"idInBook":3,"chapterId":25,"bookId":15,"arabic":"حَدَّثَنَا قَبِيصَةُ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنْ سَلَمَةَ، عَنْ مُسْلِمٍ الْبَطِينِ، عَنْ أَبِي الْعُبَيْدَيْنِ قَالَ‏:‏ سَأَلْتُ عَبْدَ اللهِ عَنِ الْمُبَذِّرِينَ، قَالَ‏:‏ الَّذِينَ يُنْفِقُونَ فِي غَيْرِ حَقٍّ‏.‏","english":{"narrator":"","text":"Abu'l-'Ubaydayn said, \"I asked 'Abdullah about those who squander\nand he said, 'They are those who spend incorrectly.'\""}},{"id":4,"idInBook":4,"chapterId":25,"bookId":15,"arabic":"حَدَّثَنَا عَارِمٌ، قَالَ‏:‏ حَدَّثَنَا هُشَيْمٌ، قَالَ‏:‏ حَدَّثَنَا حُصَيْنٌ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ‏:‏ ‏{‏الْمُبَذِّرِينَ‏}‏، قَالَ‏:‏ الْمُبَذِّرِينَ فِي غَيْرِ حَقٍّ‏.‏","english":{"narrator":"","text":"Ibn 'Abbas said that he said that \"the squanderers\" were those\nwho wasted money incorrectly."}},{"id":5,"idInBook":5,"chapterId":25,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ يُوسُفَ، قَالَ‏:‏ حَدَّثَنَا اللَّيْثُ، قَالَ‏:‏ حَدَّثَنَا ابْنُ عَجْلاَنَ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَبِيهِ قَالَ‏:‏ كَانَ عُمَرُ يَقُولُ عَلَى الْمِنْبَرِ‏:‏ يَا أَيُّهَا النَّاسُ، أَصْلِحُوا عَلَيْكُمْ مَثَاوِيكُمْ، وَأَخِيفُوا هَذِهِ الْجِنَّانَ قَبْلَ أَنْ تُخِيفَكُمْ، فَإِنَّهُ لَنْ يَبْدُوَ لَكُمْ مُسْلِمُوهَا، وَإِنَّا وَاللَّهِ مَا سَالَمْنَاهُنَّ مُنْذُ عَادَيْنَاهُنَّ‏.‏","english":{"narrator":"","text":"Zayd ibn Aslam reported from his father that 'Umar used to say\non the minbar, \"O people! Improve your homes but be careful about these\nhouse snakes  before they make you afraid. Those\namong them which are Muslim will not be clear to you and, by Allah, we\nhave not made peace with them since the time when we treated them as an\nenemy.\""}},{"id":6,"idInBook":6,"chapterId":25,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ مُوسَى، عَنْ إِسْرَائِيلَ، عَنْ أَبِي إِسْحَاقَ، عَنْ حَارِثَةَ بْنِ مُضَرِّبٍ، عَنْ خَبَّابٍ قَالَ‏:‏ إِنَّ الرَّجُلَ لَيُؤْجَرُ فِي كُلِّ شَيْءٍ، إِلا الْبِنَاءَ‏.‏","english":{"narrator":"","text":"Khabbab said, \"A man is rewarded for everything except building.\""}},{"id":7,"idInBook":7,"chapterId":25,"bookId":15,"arabic":"حَدَّثَنَا أَبُو حَفْصِ بْنُ عَلِيٍّ، قَالَ‏:‏ حَدَّثَنَا أَبُو عَاصِمٍ، قَالَ‏:‏ حَدَّثَنَا عَمْرُو بْنُ وَهْبٍ الطَّائِفِيُّ، قَالَ‏:‏ حَدَّثَنَا غُطَيْفُ بْنُ أَبِي سُفْيَانَ، أَنَّ نَافِعَ بْنَ عَاصِمٍ أَخْبَرَهُ، أَنَّهُ سَمِعَ عَبْدَ اللهِ بْنَ عَمْرٍو قَالَ لِابْنِ أَخٍ لَهُ خَرَجَ مِنَ الْوَهْطِ‏:‏ أَيَعْمَلُ عُمَّالُكَ‏؟‏ قَالَ‏:‏ لاَ أَدْرِي، قَالَ‏:‏ أَمَا لَوْ كُنْتَ ثَقَفِيًّا لَعَلِمْتَ مَا يَعْمَلُ عُمَّالُكَ، ثُمَّ الْتَفَتَ إِلَيْنَا فَقَالَ‏:‏ إِنَّ الرَّجُلَ إِذَا عَمِلَ مَعَ عُمَّالِهِ فِي دَارِهِ، وَقَالَ أَبُو عَاصِمٍ مَرَّةً‏:‏ فِي مَالِهِ، كَانَ عَامِلاً مِنْ عُمَّالِ اللهِ عَزَّ وَجَلَّ‏.‏","english":{"narrator":"","text":"'Abdullah ibn 'Amr was heard to say to a nephew of his who had\nleft al-Waht, \"Are your workers at work?\" \"I don't know,\" he replied. He\nsaid, \"If you were clever, you would work as your workers work.\" Then he\nturned towards us and said, \"When a man works with his workers in his house\n(and Abu 'Asim once said, 'in his property'), he is one of the workers\nof Allah Almighty.\""}},{"id":8,"idInBook":8,"chapterId":25,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنِي ابْنُ أَبِي الزِّنَادِ، عَنْ أَبِيهِ، عَنْ عَبْدِ الرَّحْمَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللهِ صلى الله عليه وسلم قَالَ‏:‏ لاَ تَقُومُ السَّاعَةُ حَتَّى يَتَطَاوَلَ النَّاسُ فِي الْبُنْيَانِ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"The Final Hour will not come until people\ncompete with one another in the height of their buildings.\""}},{"id":9,"idInBook":9,"chapterId":25,"bookId":15,"arabic":"أَخْبَرَنَا عَبْدُ اللهِ، قَالَ‏:‏ حَدَّثَنَا حُرَيْثُ بْنُ السَّائِبِ قَالَ‏:‏ سَمِعْتُ الْحَسَنَ يَقُولُ‏:‏ كُنْتُ أَدْخُلُ بُيُوتَ أَزْوَاجِ النَّبِيِّ صلى الله عليه وسلم فِي خِلاَفَةِ عُثْمَانَ بْنِ عَفَّانَ فَأَتَنَاوَلُ سُقُفَهَا بِيَدِي‏.‏","english":{"narrator":"","text":"Al-Hasan said, \"I used to go into the houses of the wives of the\nProphet, may Allah bless him and grant him peace, during the khalifate\nof 'Uthman ibn 'Affan, and I could touch their ceilings with my own hand.\""}},{"id":10,"idInBook":10,"chapterId":25,"bookId":15,"arabic":"وَبِالسَّنَدِ عَنْ عَبْدِ اللهِ، قَالَ‏:‏ أَخْبَرَنَا دَاوُدُ بْنُ قَيْسٍ قَالَ‏:‏ رَأَيْتُ الْحُجُرَاتِ مِنْ جَرِيدِ النَّخْلِ مَغْشِيًّا مِنْ خَارِجٍ بِمُسُوحِ الشَّعْرِ، وَأَظُنُّ عَرْضَ الْبَيْتِ مِنْ بَابِ الْحُجْرَةِ إِلَى بَابِ الْبَيْتِ نَحْوًا مِنْ سِتِّ أَوْ سَبْعِ أَذْرُعٍ، وَأَحْزِرُ الْبَيْتَ الدَّاخِلَ عَشْرَ أَذْرُعٍ، وَأَظُنُّ سُمْكَهُ بَيْنَ الثَّمَانِ وَالسَّبْعِ نَحْوَ ذَلِكَ، وَوَقَفْتُ عِنْدَ بَابِ عَائِشَةَ فَإِذَا هُوَ مُسْتَقْبِلٌ الْمَغْرِبَ‏.‏","english":{"narrator":"","text":"Dawud ibn Qays said, \"I saw that the rooms were made from the stumps\nof palm trees covered on the outside with smoothed hair. I think that the\nwidth of the house from the door of the room to the door of the house was\nabout six or seven spans. The width of the room inside was ten spans. I\nthink that the ceiling was between seven and eight, or there about. I stopped\nat the door of 'A'isha, which was facing the west.\""}},{"id":11,"idInBook":11,"chapterId":25,"bookId":15,"arabic":"وَبِالسَّنَدِ عَنْ عَبْدِ اللهِ، قَالَ‏:‏ أَخْبَرَنَا عَلِيُّ بْنُ مَسْعَدَةَ، عَنْ عَبْدِ اللهِ الرُّومِيِّ قَالَ‏:‏ دَخَلْتُ عَلَى أُمِّ طَلْقٍ فَقُلْتُ‏:‏ مَا أَقْصَرَ سَقْفَ بَيْتِكِ هَذَا‏؟‏ قَالَتْ‏:‏ يَا بُنَيَّ إِنَّ أَمِيرَ الْمُؤْمِنِينَ عُمَرَ بْنَ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ كَتَبَ إِلَى عُمَّالِهِ‏:‏ أَنْ لاَ تُطِيلُوا بِنَاءَكُمْ، فَإِنَّهُ مِنْ شَرِّ أَيَّامِكُمْ‏.‏","english":{"narrator":"'Abdullah ar-Rumi said, \"I visited Umm Talq and exclaimed, 'How\nlow the ceiling of your room is!' 'My son,' she replied, 'the Amir al-Mu'minin,\n'Umar ibn al-Khattab, may Allah be pleased with him, wrote to his workers\ntelling them:","text":"\"Do not make your buildings tall. That will come about in\nthe worst of your days.\"'\""}},{"id":12,"idInBook":12,"chapterId":25,"bookId":15,"arabic":"حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، قَالَ‏:‏ حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ، عَنِ الأَعْمَشِ، عَنْ سَلاَّمِ بْنِ شُرَحْبِيلَ، عَنْ حَبَّةَ بْنِ خَالِدٍ، وَسَوَاءَ بْنِ خَالِدٍ، أَنَّهُمَا أَتَيَا النَّبِيَّ صلى الله عليه وسلم وَهُوَ يُعَالِجُ حَائِطًا أَوْ بِنَاءً لَهُ، فَأَعَانَاهُ‏.‏","english":{"narrator":"","text":"It is reported that Habba ibn Khalid and Sawa' ibn Khalid came\nto the Prophet, may Allah bless him and grant him peace, while he was repairing\na wall - or a building - of his, and they helped him."}},{"id":13,"idInBook":13,"chapterId":25,"bookId":15,"arabic":"حَدَّثَنَا آدَمُ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ قَالَ‏:‏ دَخَلْنَا عَلَى خَبَّابٍ نَعُودُهُ، وَقَدِ اكْتَوَى سَبْعَ كَيَّاتٍ، فَقَالَ‏:‏ إِنَّ أَصْحَابَنَا الَّذِينَ سَلَفُوا مَضَوْا وَلَمْ تُنْقِصْهُمُ الدُّنْيَا، وَإِنَّا أَصَبْنَا مَا لاَ نَجِدُ لَهُ مَوْضِعًا إِلاَّ التُّرَابَ، وَلَوْلاَ أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَانَا أَنْ نَدْعُوَ بِالْمَوْتِ لَدَعَوْتُ بِهِ‏.‏","english":{"narrator":"","text":"Qays ibn Abi Hazm said, \"We went to visit Khubbab after he had\nbeen cauterised seven times. He said, 'Our Companions who came before us\nhave gone and this world did not cause the, loss. We have been struck by\nan affliction for which we find no place to put it down except the earth.\nIf it were no that the Prophet, may Allah bless him and grant him peace,\nforbade us to pray for death, we would pray for it.'\""}},{"id":14,"idInBook":14,"chapterId":25,"bookId":15,"arabic":"ثُمَّ أَتَيْنَاهُ مَرَّةً أُخْرَى، وَهُوَ يَبْنِي حَائِطًا لَهُ، فَقَالَ‏:‏ إِنَّ الْمُسْلِمَ يُؤْجَرُ فِي كُلِّ شَيْءٍ يُنْفِقُهُ إِلاَّ فِي شَيْءٍ يَجْعَلُهُ فِي التُّرَابِ‏.‏","english":{"narrator":"","text":"He continued, \"Then we came to him another time while he was building\na wall and his and he said, 'The Muslim is rewarded for everything on which\nhe spends money except for what he spends on dust.'"}},{"id":15,"idInBook":15,"chapterId":25,"bookId":15,"arabic":"حَدَّثَنَا عُمَرُ، قَالَ‏:‏ حَدَّثَنَا أَبِي، قَالَ‏:‏ حَدَّثَنَا الأَعْمَشُ، قَالَ‏:‏ حَدَّثَنَا أَبُو السَّفَرِ، عَنْ عَبْدِ اللهِ بْنِ عَمْرٍو قَالَ‏:‏ مَرَّ النَّبِيُّ صلى الله عليه وسلم، وَأَنَا أُصْلِحُ خُصًّا لَنَا، فَقَالَ‏:‏ مَا هَذَا‏؟‏ قُلْتُ‏:‏ أُصْلِحُ خُصَّنَا يَا رَسُولَ اللهِ، فَقَالَ‏:‏ الأَمْرُ أَسْرَعُ مِنْ ذَلِكَ‏.‏","english":{"narrator":"","text":"'Abdullah ibn 'Amr said, \"The Prophet, may Allah bless him and\ngrant him peace, went by while I was repairing a hut I owned. He said,\n'What is this?' I replied, 'I am mending my hut, may Allah bless him and\ngrant him peace.' He said, 'The business is too swift for that.'\""}},{"id":16,"idInBook":16,"chapterId":25,"bookId":15,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ وَقَبِيصَةُ قَالاَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، عَنْ خَمِيلٍ، عَنْ نَافِعِ بْنِ عَبْدِ الْحَارِثِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ مِنْ سَعَادَةِ الْمَرْءِ الْمَسْكَنُ الْوَاسِعُ، وَالْجَارُ الصَّالِحُ، وَالْمَرْكَبُ الْهَنِيءُ‏.‏","english":{"narrator":"","text":"Nafi' ibn al-Harith reported that the Prophet, may Allah bless\nhim and grant him peace, said, \"Part of a man's happiness is a spacious\ndwelling, a good neighbour, and a good mount.\""}},{"id":17,"idInBook":17,"chapterId":25,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى، قَالَ‏:‏ حَدَّثَنَا الضَّحَّاكُ بْنُ نِبْرَاسٍ أَبُو الْحَسَنِ، عَنْ ثَابِتٍ، أَنَّهُ كَانَ مَعَ أَنَسٍ بِالزَّاوِيَةِ فَوْقَ غُرْفَةٍ لَهُ، فَسَمِعَ الأَذَانَ، فَنَزَلَ وَنَزَلْتُ، فَقَارَبَ فِي الْخُطَا فَقَالَ‏:‏ كُنْتُ مَعَ زَيْدِ بْنِ ثَابِتٍ فَمَشَى بِي هَذِهِ الْمِشْيَةَ وَقَالَ‏:‏ أَتَدْرِي لِمَ فَعَلْتُ بِكَ‏؟‏ فَإِنَّ النَّبِيَّ صلى الله عليه وسلم مَشَى بِي هَذِهِ الْمِشْيَةَ وَقَالَ‏:‏ أَتَدْرِي لِمَ مَشَيْتُ بِكَ‏؟‏ قُلْتُ‏:‏ اللَّهُ وَرَسُولُهُ أَعْلَمُ، قَالَ‏:‏ لِيَكْثُرَ عَدَدُ خُطَانَا فِي طَلَبِ الصَّلاةِ‏.‏","english":{"narrator":"","text":"Thabit reported that he was with Anas in a corner above one of\nhis rooms. He said, \"We heard the adhan and he came down and I came down\nas well. He took short stops and said, 'I was with Zayd ibn Thabit and\nI walked with him in this fashion. He said, \"Do you know why I did it to\nyou? The Prophet, may Allah bless him and grant him peace, walked in this\nmanner and he said, 'Do you know why I walked with you?' I replied, 'Allah\nand His Messenger know best.' He said, 'So that there would be a greater\nnumber of steps in search of the prayer.'\"'\""}},{"id":18,"idInBook":18,"chapterId":25,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ يُونُسَ، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي الْفُدَيْكِ قَالَ‏:‏ حَدَّثَنِي عَبْدُ اللهِ بْنُ أَبِي يَحْيَى، عَنِ ابْنِ أَبِي هِنْدَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ لاَ تَقُومُ السَّاعَةُ حَتَّى يَبْنِيَ النَّاسُ بُيُوتًا، يُشَبِّهُونَهَا بِالْمَرَاحِلِ‏.‏\nقَالَ إِبْرَاهِيمُ‏:‏ يَعْنِي الثِّيَابَ الْمُخَطَّطَةَ‏.‏","english":{"narrator":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"The Final Hour will not come until people build\nhouses which are like coloured garments.\"\n\nIbrahim said:","text":"meaning striped clothes."}},{"id":19,"idInBook":19,"chapterId":25,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى، قَالَ‏:‏ حَدَّثَنَا أَبُو عَوَانَةَ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ عُمَيْرٍ، عَنْ وَرَّادٍ كَاتِبِ الْمُغِيرَةِ قَالَ‏:‏ كَتَبَ مُعَاوِيَةُ إِلَى الْمُغِيرَةِ‏:‏ اكْتُبْ إِلَيَّ مَا سَمِعْتَ مِنْ رَسُولِ اللهِ صلى الله عليه وسلم، فَكَتَبَ إِلَيْهِ‏:‏ إِنَّ نَبِيَّ اللهِ صلى الله عليه وسلم كَانَ يَقُولُ فِي دُبُرِ كُلِّ صَلاَةٍ‏:‏ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، اللَّهُمَّ لاَ مَانِعَ لِمَا أَعْطَيْتَ، وَلاَ مُعْطِيَ لَمَا مَنَعْتَ، وَلاَ يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ، وَكَتَبَ إِلَيْهِ‏:‏ إِنَّهُ كَانَ يَنْهَى عَنْ قِيلَ وَقَالَ، وَكَثْرَةِ السُّؤَالِ، وَإِضَاعَةِ الْمَالِ‏.‏ وَكَانَ يَنْهَى عَنْ عُقُوقِ الأُمَّهَاتِ، وَوَأْدِ الْبَنَاتِ، وَمَنْعٍ وَهَاتِ‏.‏","english":{"narrator":"","text":"Warrad, the scribe of al-Mughira ibn Shu'ba, said, \"Mu'awiya wrote\nto al-Mughira, saying, 'Write down for me what you heard the Messenger\nof Allah, may Allah bless him and grant him peace, say.' So he wrote to\nhim, 'The Prophet of Allah, may Allah bless him and grant him peace, used\nto say at the end of every prayer, \"There is no god but Allah alone with\nno partner. His is the Kingdom and His is the praise and He has power over\neverything. O Allah, none can withhold what You give nor can anyone give\nwhat You withhold. Nor will the wealth of someone with wealth help him\nagainst You.' He also write to him, 'He forbade gossip, asking too many\nquestions, and wasting money. He forbade disobeying mothers, burying daughters\nalive, and he forbade asking people (without real need).'\""}},{"id":20,"idInBook":20,"chapterId":25,"bookId":15,"arabic":"حَدَّثَنَا آدَمُ، قَالَ‏:‏ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ قَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ لَنْ يُنَجِّي أَحَدًا مِنْكُمْ عَمَلٌ، قَالُوا‏:‏ وَلاَ أَنْتَ يَا رَسُولَ اللهِ، قَالَ‏:‏ وَلاَ أَنَا، إِلاَّ أَنْ يَتَغَمَّدَنِي اللَّهُ مِنْهُ بِرَحْمَةٍ، فَسَدِّدُوا وَقَارِبُوا وَاغْدُوا وَرُوحُوا، وَشَيْءٌ مِنَ الدُّلْجَةِ، وَالْقَصْدَ الْقَصْدَ تَبْلُغُوا‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"None of you will be saved by his actions?\" \"Not\neven you, Messenger of Allah?\" they asked. \"Not even me,\" he replied, \"unless\nAllah covers me with mercy from Him. But act correctly and wisely and worship\nin the morning and evening and during part of the night. Keep to a middle\npath and you will arrive.\""}}],"chapter":{"id":25,"bookId":15,"arabic":"كتاب السَّرَفِ فِي  الْبِنَاءِ","english":"Extravagance in Building"}}