{"metadata":{"length":13,"arabic":{"title":"الأدب المفرد","author":"الإمام محمد بن إسماعيل البخاري","introduction":"كتاب الرِّفْقِ"},"english":{"title":"Al-Adab Al-Mufrad","author":"Imam Muhammad ibn Ismail al-Bukhari","introduction":"Compassion"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":26,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللهِ، قَالَ‏:‏ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم قَالَتْ‏:‏ دَخَلَ رَهْطٌ مِنَ الْيَهُودِ عَلَى رَسُولِ اللهِ صلى الله عليه وسلم فَقَالُوا‏:‏ السَّامُ عَلَيْكُمْ، قَالَتْ عَائِشَةُ فَفَهِمْتُهَا فَقُلْتُ‏:‏ عَلَيْكُمُ السَّامُ وَاللَّعْنَةُ، قَالَتْ‏:‏ فَقَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ مَهْلاً يَا عَائِشَةُ، إِنَّ اللَّهَ يُحِبُّ الرِّفْقَ فِي الأَمْرِ كُلِّهِ، فَقُلْتُ‏:‏ يَا رَسُولَ اللهِ، أَوَ لَمْ تَسْمَعْ مَا قَالُوا‏؟‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ قَدْ قُلْتُ‏:‏ وَعَلَيْكُمْ‏.‏","english":{"narrator":"","text":"'A'isha, the wife of the Prophet, may Allah bless him and grant\nhim peace, said, \"A group of Jews came to the Messenger of Allah, may Allah\nbless him and grant him peace, and said, \"Poison ('sam' instead of 'salam')\nbe upon you.\" 'A'isha said, \"I understood it and said, 'And poison be upon\nyou and the curse of Allah!' The Messenger of Allah, may Allah bless him\nand grant him peace, 'Easy, 'A'isha! Allah loves compassion in everything.'\nI said, 'Didn't you hear what they said?' The Messenger of Allah, may Allah\nbless him and grant him peace, replied, 'I already said, \"and upon you\".'\""}},{"id":2,"idInBook":2,"chapterId":26,"bookId":15,"arabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ‏:‏ حَدَّثَنَا أَبُو عَوَانَةَ، عَنِ الأَعْمَشِ، عَنْ تَمِيمِ بْنِ سَلَمَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ هِلاَلٍ، عَنْ جَرِيرِ بْنِ عَبْدِ اللهِ قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ مَنْ يُحْرَمُ الرِّفْقَ يُحْرَمُ الْخَيْرَ‏.‏","english":{"narrator":"","text":"Jarir ibn 'Abdullah reported that the Messenger of Allah, may Allah\nbless him and grant him peace, said, \"Whoever is denied compassion is denied\ngood.\""}},{"id":3,"idInBook":3,"chapterId":26,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا ابْنُ عُيَيْنَةَ، عَنْ عَمْرٍو، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنْ يَعْلَى بْنِ مَمْلَكٍ، عَنْ أُمِّ الدَّرْدَاءِ، عَنْ أَبِي الدَّرْدَاءِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ مَنْ أُعْطِيَ حَظَّهُ مِنَ الرِّفْقِ فَقَدْ أُعْطِيَ حَظَّهُ مِنَ الْخَيْرِ، وَمَنْ حُرِمَ حَظَّهُ مِنَ الرِّفْقِ، فَقَدْ حُرِمَ حَظَّهُ مِنَ الْخَيْرِ، أَثْقَلُ شَيْءٍ فِي مِيزَانِ الْمُؤْمِنِ يَوْمَ الْقِيَامَةِ حُسْنُ الْخُلُقِ، وَإِنَّ اللَّهَ لَيُبْغِضُ الْفَاحِشَ الْبَذِيَّ‏.‏","english":{"narrator":"","text":"Abu'd-Darda' reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"Whoever has been given his portion of compassion\nhas been given his portion of good. Whoever is denied given his portion\nof compassion has been denied his portion of good. Good character will\nbe the weightiest thing in the believer's balance on the Day of Rising.\nAllah hates a coarse, foul-mouthed person.\""}},{"id":4,"idInBook":4,"chapterId":26,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ عَبْدِ الْوَهَّابِ قَالَ‏:‏ حَدَّثَنِي أَبُو بَكْرِ بْنُ نَافِعٍ وَاسْمُهُ أَبُو بَكْرٍ مَوْلَى زَيْدِ بْنِ الْخَطَّابِ قَالَ‏:‏ سَمِعْتُ مُحَمَّدَ بْنَ أَبِي بَكْرِ بْنِ عَمْرِو بْنِ حَزْمٍ قَالَتْ عَمْرَةُ‏:‏ قَالَتْ عَائِشَةُ‏:‏ قَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ أَقِيلُوا ذَوِيِ الْهَيْئَاتِ عَثَرَاتِهِمْ‏.‏","english":{"narrator":"","text":"'A'isha reported that the Prophet, may Allah bless him and grant\nhim peace, said, \"Forgive right-acting people their slips.\""}},{"id":5,"idInBook":5,"chapterId":26,"bookId":15,"arabic":"حَدَّثَنَا الْغُدَانِيُّ أَحْمَدُ بْنُ عُبَيْدِ اللهِ، قَالَ‏:‏ حَدَّثَنَا كَثِيرُ بْنُ أَبِي كَثِيرٍ، قَالَ‏:‏ حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ لاَ يَكُونُ الْخُرْقُ فِي شَيْءٍ إِلاَّ شَانَهُ، وَإِنَّ اللَّهَ رَفِيقٌ يُحِبُّ الرِّفْقَ‏.‏","english":{"narrator":"","text":"Anas reported that the Prophet, may Allah bless him and grant him\npeace, said, \"If there is roughness in anything it is bound to disgrace\nit. Allah is compassionate and loves compassion.\""}},{"id":6,"idInBook":6,"chapterId":26,"bookId":15,"arabic":"حَدَّثَنَا عَمْرُو بْنُ مَرْزُوقٍ، قَالَ‏:‏ أَخْبَرَنَا شُعْبَةُ، عَنْ قَتَادَةَ قَالَ‏:‏ سَمِعْتُ عَبْدَ اللهِ بْنَ أَبِي عُتْبَةَ يُحَدِّثُ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ‏:‏ كَانَ رَسُولُ اللهِ صلى الله عليه وسلم أَشَدَّ حَيَاءً مِنَ الْعَذْرَاءِ فِي خِدْرِهَا، وَكَانَ إِذَا كَرِهَ شَيْئًا عَرَفْنَاهُ فِي وَجْهِهِ‏.‏","english":{"narrator":"","text":"Abu Sa'id al-Khudri said, \"The Messenger of Allah, may Allah bless\nhim and grant him peace, was more modest than a virgin in her tent. When\nhe disliked something, we recognised that in his face.\""}},{"id":7,"idInBook":7,"chapterId":26,"bookId":15,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، قَالَ‏:‏ حَدَّثَنَا زُهَيْرٌ، عَنْ قَابُوسَ، أَنَّ أَبَاهُ حَدَّثَهُ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ الْهَدْيُ الصَّالِحُ، وَالسَّمْتُ، وَالِاقْتِصَادُ جُزْءٌ مِنْ سَبْعِينَ جُزْءًا مِنَ النُّبُوَّةِ‏.‏","english":{"narrator":"","text":"Ibn 'Abbas reported that the Prophet, may Allah bless him and grant\nhim peace, said, \"Right guidance, good behaviour and aiming for what is\njust and correct is a seventieth part of prophethood.\""}},{"id":8,"idInBook":8,"chapterId":26,"bookId":15,"arabic":"حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، عَنِ الْمِقْدَامِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ‏:‏ كُنْتُ عَلَى بَعِيرٍ فِيهِ صُعُوبَةٌ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ عَلَيْكِ بِالرِّفْقِ، فَإِنَّهُ لاَ يَكُونُ فِي شَيْءٍ إِلا زَانَهُ، وَلاَ يُنْزَعُ مِنْ شَيْءٍ إِلا شَانَهُ‏.‏","english":{"narrator":"","text":"'A'isha, may Allah be pleased with her, said, \"I was on a camel\nwhich was somewhat intractable and the Prophet, may Allah bless him and\ngrant him peace, remarked, 'You must be compassionate. Whenever there is\ncompassion in something, it adorns it, and when it is removed from something\nit disgraces it.\""}},{"id":9,"idInBook":9,"chapterId":26,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ الْعَزِيزِ، قَالَ‏:‏ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، عَنْ أَبِي رَافِعٍ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ إِيَّاكُمْ وَالشُّحَّ، فَإِنَّهُ أَهْلَكَ مَنْ كَانَ قَبْلَكُمْ، سَفَكُوا دِمَاءَهُمْ، وَقَطَعُوا أَرْحَامَهُمْ، وَالظُّلْمُ ظُلُمَاتٌ يَوْمَ الْقِيَامَةِ‏.‏","english":{"narrator":"","text":"Sa'id al-Maqburi reported from his father that the Messenger of\nAllah, may Allah bless him and grant him peace, said, \"Beware of avarice.\nIt destroyed those before you. They shed one another's blood and broke\noff relations with their relatives. Injustice will appear as darkness on\nthe Day of Rising.\""}},{"id":10,"idInBook":10,"chapterId":26,"bookId":15,"arabic":"حَدَّثَنَا حَرَمِيُّ بْنُ حَفْصٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْوَاحِدِ، قَالَ‏:‏ حَدَّثَنَا سَعِيدُ بْنُ كَثِيرِ بْنِ عُبَيْدٍ قَالَ‏:‏ حَدَّثَنِي أَبِي قَالَ‏:‏ دَخَلْتُ عَلَى عَائِشَةَ أُمِّ الْمُؤْمِنِينَ رَضِيَ اللَّهُ عَنْهَا، فَقَالَتْ‏:‏ أَمْسِكْ حَتَّى أَخِيطَ نَقْبَتِي فَأَمْسَكْتُ فَقُلْتُ‏:‏ يَا أُمَّ الْمُؤْمِنِينَ، لَوْ خَرَجْتُ فَأَخْبَرْتُهُمْ لَعَدُّوهُ مِنْكِ بُخْلاً، قَالَتْ‏:‏ أَبْصِرْ شَأْنَكَ، إِنَّهُ لاَ جَدِيدَ لِمَنْ لاَ يَلْبَسُ الْخَلَقَ‏.‏","english":{"narrator":"","text":"Kathir ibn 'Ubayd said, \"I visited 'A'isha, the Umm al-Mu'minin,\nmay Allah be pleased with her. She said, 'Wait until I sew up my garment.'\nSo I waited and said, 'Umm al-Mu'minin, when I go out, I will tell them\nthat your enemy is miserliness.' She said, 'Look to your own business.\nThere are no new clothes for anyone who does not wear shabby clothes.'\""}},{"id":11,"idInBook":11,"chapterId":26,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى، قَالَ‏:‏ حَدَّثَنَا حَمَّادٌ، عَنْ حُمَيْدٍ، عَنِ الْحَسَنِ، عَنْ عَبْدِ اللهِ بْنِ مُغَفَّلٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ إِنَّ اللَّهَ رَفِيقٌ يُحِبُّ الرِّفْقَ، وَيُعْطِي عَلَيْهِ مَا لاَ يُعْطِي عَلَى الْعُنْفِ‏.‏","english":{"narrator":"","text":"'Abdullah ibn Mughaffal reported that the Prophet, may Allah bless\nhim and grant him peace, said, \"Allah is compassionate and loves compassion.\nHe gives for compassion what He goes not give for harshness.\""}},{"id":12,"idInBook":12,"chapterId":26,"bookId":15,"arabic":"حَدَّثَنَا آدَمُ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي التَّيَّاحِ قَالَ‏:‏ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ قَالَ‏:‏ قَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ يَسِّرُوا وَلاَ تُعَسِّرُوا، وَسَكِّنُوا ولا تُنَفِّرُوا‏.‏","english":{"narrator":"","text":"Anas ibn Malik reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"Make things easy and do not make things difficult.\nCalm people and do not arouse their aversion.\""}},{"id":13,"idInBook":13,"chapterId":26,"bookId":15,"arabic":"حَدَّثَنَا قُتَيْبَةُ، قَالَ‏:‏ حَدَّثَنَا جَرِيرٌ، عَنْ عَطَاءٍ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللهِ بْنِ عَمْرٍو قَالَ‏:‏ نَزَلَ ضَيْفٌ فِي بَنِي إِسْرَائِيلَ، وَفِي الدَّارِ كَلْبَةٌ لَهُمْ، فَقَالُوا‏:‏ يَا كَلْبَةُ، لاَ تَنْبَحِي عَلَى ضَيْفِنَا فَصِحْنَ الْجِرَاءُ فِي بَطْنِهَا، فَذَكَرُوا لِنَبِيٍّ لَهُمْ فَقَالَ‏:‏ إِنَّ مَثَلَ هَذَا كَمَثَلِ أُمَّةٍ تَكُونُ بَعْدَكُمْ، يَغْلِبُ سُفَهَاؤُهَا عُلَمَاءَهَا‏.‏","english":{"narrator":"","text":"'Abdullah ibn 'Amr said, \"A guest stayed among the tribe of Israel\nand there was a dog in the house. They said, 'Dog, do not bark at our guest.\nThe puppies were suckling from it. They mentioned it to one of their Prophets\nwho said, 'This is like a community which will come after you and whose\nfools will overcome its men of knowledge.\""}}],"chapter":{"id":26,"bookId":15,"arabic":"كتاب الرِّفْقِ","english":"Compassion"}}