{"metadata":{"length":8,"arabic":{"title":"الأدب المفرد","author":"الإمام محمد بن إسماعيل البخاري","introduction":"كتاب الاعتناء بالدنيا"},"english":{"title":"Al-Adab Al-Mufrad","author":"Imam Muhammad ibn Ismail al-Bukhari","introduction":"Attending to this world"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":27,"bookId":15,"arabic":"حَدَّثَنَا أَبُو الْوَلِيدِ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، عَنِ الْمِقْدَامِ بْنِ شُرَيْحٍ قَالَ‏:‏ سَمِعْتُ أَبِي قَالَ‏:‏ سَمِعْتُ عَائِشَةَ تَقُولُ‏:‏ كُنْتُ عَلَى بَعِيرٍ فِيهِ صُعُوبَةٌ، فَجَعَلْتُ أَضْرِبُهُ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ عَلَيْكِ بِالرِّفْقِ، فَإِنَّ الرِّفْقَ لاَ يَكُونُ فِي شَيْءٍ إِلاَّ زَانَهُ، وَلاَ يُنْزَعُ مِنْ شَيْءٍ إِلا شَانَهُ‏.‏","english":{"narrator":"","text":"'A'isha said, \"I was on a camel that was somewhat intractable and\nI began to beat it. The Prophet, may Allah bless him and grant him peace,\nsaid, 'You must be compassionate. Whenever there is compassion in something,\nit adorns it, and whenever it is removed from something it disgraces it.\""}},{"id":2,"idInBook":2,"chapterId":27,"bookId":15,"arabic":"حَدَّثَنَا صَدَقَةُ، أَخْبَرَنَا ابْنُ عُلَيَّةَ، عَنِ الْجُرَيْرِيِّ، عَنْ أَبِي نَضْرَةَ‏:‏ قَالَ رَجُلٌ مِنَّا يُقَالُ لَهُ‏:‏ جَابِرٌ أَوْ جُوَيْبِرٌ‏:‏ طَلَبْتُ حَاجَةً إِلَى عُمَرَ فِي خِلاَفَتِهِ، فَانْتَهَيْتُ إِلَى الْمَدِينَةِ لَيْلاً، فَغَدَوْتُ عَلَيْهِ، وَقَدْ أُعْطِيتُ فِطْنَةً وَلِسَانًا، أَوْ قَالَ‏:‏ مِنْطَقًا، فَأَخَذْتُ فِي الدُّنْيَا فَصَغَّرْتُهَا، فَتَرَكْتُهَا لاَ تَسْوَى شَيْئًا، وَإِلَى جَنْبِهِ رَجُلٌ أَبْيَضُ الشَّعْرِ أَبْيَضُ الثِّيَابِ، فَقَالَ لَمَّا فَرَغْتُ‏:‏ كُلُّ قَوْلِكَ كَانَ مُقَارِبًا، إِلاَّ وَقُوعَكَ فِي الدُّنْيَا، وَهَلْ تَدْرِي مَا الدُّنْيَا‏؟‏ إِنَّ الدُّنْيَا فِيهَا بَلاَغُنَا، أَوْ قَالَ‏:‏ زَادُنَا، إِلَى الْآخِرَةِ، وَفِيهَا أَعْمَالُنَا الَّتِي نُجْزَى بِهَا فِي الْآخِرَةِ، قَالَ‏:‏ فَأَخَذَ فِي الدُّنْيَا رَجُلٌ هُوَ أَعْلَمُ بِهَا مِنِّي، فَقُلْتُ‏:‏ يَا أَمِيرَ الْمُؤْمِنِينَ، مَنْ هَذَا الرَّجُلُ الَّذِي إِلَى جَنْبِكَ‏؟‏ قَالَ‏:‏ سَيِّدُ الْمُسْلِمِينَ أُبَيُّ بْنُ كَعْبٍ‏.‏","english":{"narrator":"","text":"Abu Nadra said, \"One of our men called Jabir or Jubayr said, 'I\nwent to 'Umar while he was Khalif to ask for something which I needed.\nI reached Madina during the night and went straight to him. I am someone\nwith intelligence and a ready tongue - or he said speech (meaning eloquence).\nI had looked at this world and thought little of it. I had abandoned it\nas not being worth anything. At 'Umar's side there was a man with white\nhair and white clothes. When I had finished speaking, he said, \"All that\nyou have said is correct except for your attack on this world. Do you know\nwhat this world is? This world is that in which we reach (or he said, 'where\nour provision is') the Next World. It contains our actions for which we\nwill be rewarded in the Next World.\" He said, \"A man who knows this world\nbetter than I do worked in it.\" I asked, \"Amir al-Mu'minin, who is this\nman at our side?\" He replied, 'The master of the Muslims, Ubayy ibn Ka'b.'\""}},{"id":3,"idInBook":3,"chapterId":27,"bookId":15,"arabic":"حَدَّثَنَا عَلِيٌّ، قَالَ‏:‏ حَدَّثَنَا مَرْوَانُ، قَالَ‏:‏ حَدَّثَنَا قِنَانُ بْنُ عَبْدِ اللهِ النَّهْمِيُّ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَوْسَجَةَ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ الأَشَرَةُ شَرٌّ‏.‏","english":{"narrator":"Al-Bara' b. `Azib said:","text":"The Messager of Allah, peace be upon him, said \"Pompousness is evil.\""}},{"id":4,"idInBook":4,"chapterId":27,"bookId":15,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ‏:‏ حَدَّثَنَا حَنَشُ بْنُ الْحَارِثِ، عَنْ أَبِيهِ قَالَ‏:‏ كَانَ الرَّجُلُ مِنَّا تُنْتَجُ فَرَسُهُ فَيَنْحَرُهَا فَيَقُولُ‏:‏ أَنَا أَعِيشُ حَتَّى أَرْكَبَ هَذَا‏؟‏ فَجَاءَنَا كِتَابُ عُمَرَ‏:‏ أَنْ أَصْلِحُوا مَا رَزَقَكُمُ اللَّهُ، فَإِنَّ فِي الامْرِ تَنَفُّسًا‏.‏","english":{"narrator":"","text":"Hanash ibn al-Harith reported that his father said, \"One of our\nmen had a mare which became pregnant which he then slaughtered, saying,\n'Will I live long enough to ride this horse?' Then we received 'Umar's\nletter telling us to attend to the provision that Allah has given us in\norder to make it thrive since there is still time in the business.\""}},{"id":5,"idInBook":5,"chapterId":27,"bookId":15,"arabic":"حَدَّثَنَا أَبُو الْوَلِيدِ، قَالَ‏:‏ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ هِشَامِ بْنِ زَيْدِ بْنِ أَنَسِ بْنِ مَالِكٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ إِنْ قَامَتِ السَّاعَةُ وَفِي يَدِ أَحَدِكُمْ فَسِيلَةٌ، فَإِنِ اسْتَطَاعَ أَنْ لاَ تَقُومَ حَتَّى يَغْرِسَهَا فَلْيَغْرِسْهَا‏.‏","english":{"narrator":"","text":"Anas ibn Malik reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"If the Final Hour comes while you have a shoot of a plant\nin your hands and it is possible to plant it before the Hour comes, you\nshould plant it.\""}},{"id":6,"idInBook":6,"chapterId":27,"bookId":15,"arabic":"حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ الْبَجَلِيُّ، قَالَ‏:‏ حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ قَالَ‏:‏ أَخْبَرَنِي يَحْيَى بْنُ سَعِيدٍ قَالَ‏:‏ أَخْبَرَنِي مُحَمَّدُ بْنُ يَحْيَى بْنِ حِبَّانَ، عَنْ دَاوُدَ بْنِ أَبِي دَاوُدَ قَالَ‏:‏ قَالَ لِي عَبْدُ اللهِ بْنُ سَلاَمٍ‏:‏ إِنْ سَمِعْتَ بِالدَّجَّالِ قَدْ خَرَجَ، وَأَنْتَ عَلَى وَدِيَّةٍ تَغْرِسُهَا، فَلاَ تَعْجَلْ أَنْ تُصْلِحَهَا، فَإِنَّ لِلنَّاسِ بَعْدَ ذَلِكَ عَيْشًا‏.‏","english":{"narrator":"","text":"Dawud ibn Abi Dawud said, \"'Abdullah ibn Salam said to me, 'If you\nhear that the Dajjal has come out while you are planting young palm trees,\nit is not too late to plant it, for people will still have livelihood\nafter that.\""}},{"id":7,"idInBook":7,"chapterId":27,"bookId":15,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ‏:‏ حَدَّثَنَا شَيْبَانُ، عَنْ يَحْيَى، عَنْ أَبِي جَعْفَرٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ ثَلاَثُ دَعَوَاتٍ مُسْتَجَابَاتٍ‏:‏ دَعْوَةُ الْمَظْلُومِ، وَدَعْوَةُ الْمُسَافِرِ، وَدَعْوَةُ الْوَالِدِ عَلَى وَلَدِهِ‏.‏","english":{"narrator":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"There are three supplications which are answered:","text":"the supplication of the person who is wronged, the supplication of the\ntraveller, and the supplication of a parent for his child."}},{"id":8,"idInBook":8,"chapterId":27,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ قَالَ‏:‏ حَدَّثَنِي ابْنُ أَبِي الزِّنَادِ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّهُ سَمِعَ النَّبِيَّ صلى الله عليه وسلم عَلَى الْمِنْبَرِ نَظَرَ نَحْوَ الْيَمَنِ فَقَالَ‏:‏ اللَّهُمَّ أَقْبِلْ بِقُلُوبِهِمْ، وَنَظَرَ نَحْوَ الْعِرَاقِ فَقَالَ مِثْلَ ذَلِكَ، وَنَظَرَ نَحْوَ كُلِّ أُفُقٍ فَقَالَ مِثْلَ ذَلِكَ، وَقَالَ‏:‏ اللَّهُمَّ ارْزُقْنَا مِنْ تُرَاثِ الأَرْضِ، وَبَارِكْ لَنَا فِي مُدِّنَا وَصَاعِنَا‏.‏","english":{"narrator":"","text":"Jabir reported that the Prophet, may Allah bless him and grant\nhim peace, on the minbar. He looked towards the Yemen and said, \"O Allah,\nbring their hearts,\" and he looked towards Iraq and said something similar.\nHe looked towards every horizon and said the like of that. He said, 'O\nAllah, provide for us out of the legacy of the earth and bless us in our\nmudd and our sa'.\""}}],"chapter":{"id":27,"bookId":15,"arabic":"كتاب الاعتناء بالدنيا","english":"Attending to this world"}}