{"metadata":{"length":8,"arabic":{"title":"الأدب المفرد","author":"الإمام محمد بن إسماعيل البخاري","introduction":"كتاب الظُّلْم"},"english":{"title":"Al-Adab Al-Mufrad","author":"Imam Muhammad ibn Ismail al-Bukhari","introduction":"Injustice"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":28,"bookId":15,"arabic":"حَدَّثَنَا بِشْرٌ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ اللهِ، قَالَ‏:‏ حَدَّثَنَا دَاوُدُ بْنُ قَيْسٍ، قَالَ‏:‏ حَدَّثَنَا عُبَيْدُ اللهِ بْنُ مِقْسَمٍ قَالَ‏:‏ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللهِ يَقُولُ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ اتَّقُوا الظُّلْمَ، فَإِنَّ الظُّلْمَ ظُلُمَاتٌ يَوْمَ الْقِيَامَةِ، وَاتَّقُوا الشُّحَّ، فَإِنَّ الشُّحَّ أَهْلَكَ مَنْ كَانَ قَبْلَكُمْ، وَحَمَلَهُمْ عَلَى أَنْ سَفَكُوا دِمَاءَهُمْ، وَاسْتَحَلُّوا مَحَارِمَهُمْ‏.‏","english":{"narrator":"","text":"Jabir ibn 'Abdullah reported that the Prophet, may Allah bless\nhim and grant him peace, said, \"Fear injustice. Injustice will appear as\ndarkness on the Day of Rising. Fear avarice. Avarice destroyed people before\nyou and led them to shed one another's blood and to make lawful what was\nunlawful for them.\""}},{"id":2,"idInBook":2,"chapterId":28,"bookId":15,"arabic":"حَدَّثَنَا حَاتِمٌ، قَالَ‏:‏ حَدَّثَنَا الْحَسَنُ بْنُ جَعْفَرٍ، قَالَ‏:‏ حَدَّثَنَا الْمُنْكَدِرُ بْنُ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ أَبِيهِ، عَنْ جَابِرٍ قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ يَكُونُ فِي آخِرِ أُمَّتِي مَسْخٌ، وَقَذْفٌ، وَخَسْفٌ، وَيُبْدَأُ بِأَهْلِ الْمَظَالِمِ‏.‏","english":{"narrator":"","text":"Jabir reported that the Messenger of Allah, may Allah bless him\nand grant him peace, said, \"During the final days of my community there\nwill be distortion, slander and tyranny, and it will begin with people\nwho commit injustices.\""}},{"id":3,"idInBook":3,"chapterId":28,"bookId":15,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ الْمَاجِشُونِ قَالَ‏:‏ أَخْبَرَنِي عَبْدُ اللهِ بْنُ دِينَارٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ الظُّلْمُ ظُلُمَاتٌ يَوْمَ الْقِيَامَةِ‏.‏","english":{"narrator":"","text":"Ibn 'Umar reported that the Prophet, may Allah bless him and grant\nhim peace, said, \"Injustice will appear as darkness on the Day of Rising.\""}},{"id":4,"idInBook":4,"chapterId":28,"bookId":15,"arabic":"حَدَّثَنَا مُسَدَّدٌ، وَإِسْحَاقُ قَالاَ‏:‏ حَدَّثَنَا مُعَاذٌ قَالَ‏:‏ حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، عَنْ أَبِي الْمُتَوَكِّلِ النَّاجِيِّ، عَنْ أَبِي سَعِيدٍ، عَنْ رَسُولِ اللهِ صلى الله عليه وسلم قَالَ‏:‏ إِذَا خَلَصَ الْمُؤْمِنُونَ مِنَ النَّارِ حُبِسُوا بِقَنْطَرَةٍ بَيْنَ الْجَنَّةِ وَالنَّارِ، فَيَتَقَاصُّونَ مَظَالِمَ بَيْنَهُمْ فِي الدُّنْيَا، حَتَّى إِذَا نُقُّوا وَهُذِّبُوا، أُذِنَ لَهُمْ بِدُخُولِ الْجَنَّةِ، فَوَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ، لَأَحَدُهُمْ بِمَنْزِلِهِ أَدَلُّ مِنْهُ فِي الدُّنْيَا‏.‏","english":{"narrator":"","text":"Abu Sa'id reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"When the believers are saved from the Fire,\nthey will be stopped on a bridge between the Garden and the Fire. They\nwere be interrogated concerning the injustices which occurred between them\nin this world. When they have been cleansed and they have been disciplined,\nthen they will be given permission to enter the Garden. By the One who\nholds the soul of Muhammad in His hand, one of them is better guided in\nhis position than he was in this world.\""}},{"id":5,"idInBook":5,"chapterId":28,"bookId":15,"arabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ‏:‏ حَدَّثَنَا يَحْيَى، عَنِ ابْنِ عَجْلاَنَ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ إِيَّاكُمْ وَالظُّلْمَ، فَإِنَّ الظُّلْمَ ظُلُمَاتٌ يَوْمَ الْقِيَامَةِ، وَإِيَّاكُمْ وَالْفُحْشَ، فَإِنَّ اللَّهَ لاَ يُحِبُّ الْفَاحِشَ الْمُتَفَحِّشَ، وَإِيَّاكُمْ وَالشُّحَّ، فَإِنَّهُ دَعَا مَنْ كَانَ قَبْلَكُمْ فَقَطَعُوا أَرْحَامَهُمْ، وَدَعَاهُمْ فَاسْتَحَلُّوا مَحَارِمَهُمْ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"Beware of injustice. Injustice will appear as darkness\non the Day of Rising. Beware of coarseness. Allah does not love those who\nare coarse and foul mouthed. Beware of avarice for it destroyed those before\nyou. They cut off their relatives. Allah summoned them and they made lawful\nwhat was unlawful.\""}},{"id":6,"idInBook":6,"chapterId":28,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ مَسْلَمَةَ، قَالَ‏:‏ حَدَّثَنَا دَاوُدُ بْنُ قَيْسٍ، عَنْ عُبَيْدِ اللهِ بْنِ مِقْسَمٍ، عَنْ جَابِرٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ إِيَّاكُمْ وَالظُّلْمَ، فَإِنَّ الظُّلْمَ ظُلُمَاتٌ يَوْمَ الْقِيَامَةِ، وَاتَّقُوا الشُّحَّ، فَإِنَّهُ أَهْلَكَ مَنْ كَانَ قَبْلَكُمْ، وَحَمَلَهُمْ عَلَى أَنْ سَفَكُوا دِمَاءَهُمْ، وَاسْتَحَلُّوا مَحَارِمَهُمْ‏.‏","english":{"narrator":"","text":"Jabir reported that the Prophet, may Allah bless him and grant\nhim peace, said, \"Beware of injustice. Injustice will appear as darkness\non the Day of Rising. Fear avarice. It destroyed those before you and caused\nthem to shed one another's blood and to make lawful what was unlawful.\""}},{"id":7,"idInBook":7,"chapterId":28,"bookId":15,"arabic":"حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، قَالَ‏:‏ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَاصِمٍ، عَنْ أَبِي الضُّحَى قَالَ‏:‏ اجْتَمَعَ مَسْرُوقٌ وَشُتَيْرُ بْنُ شَكَلٍ فِي الْمَسْجِدِ، فَتَقَوَّضَ إِلَيْهِمَا حِلَقُ الْمَسْجِدِ، فَقَالَ مَسْرُوقٌ‏:‏ لاَ أَرَى هَؤُلاَءِ يَجْتَمِعُونَ إِلَيْنَا إِلاَّ لِيَسْتَمِعُوا مِنَّا خَيْرًا، فَإِمَّا أَنْ تُحَدِّثَ عَنْ عَبْدِ اللهِ فَأُصَدِّقَكَ أَنَا، وَإِمَّا أَنْ أُحَدِّثَ عَنْ عَبْدِ اللهِ فَتُصَدِّقَنِي‏؟‏ فَقَالَ‏:‏ حَدِّثْ يَا أَبَا عَائِشَةَ، قَالَ‏:‏ هَلْ سَمِعْتَ عَبْدَ اللهِ يَقُولُ‏:‏ الْعَيْنَانِ يَزْنِيَانِ، وَالْيَدَانِ يَزْنِيَانِ، وَالرِّجْلاَنِ يَزْنِيَانِ، وَالْفَرْجُ يُصَدِّقُ ذَلِكَ أَوْ يُكَذِّبُهُ‏؟‏ فَقَالَ‏:‏ نَعَمْ، قَالَ‏:‏ وَأَنَا سَمِعْتُهُ، قَالَ‏:‏ فَهَلْ سَمِعْتَ عَبْدَ اللهِ يَقُولُ‏:‏ مَا فِي الْقُرْآنِ آيَةٌ أَجْمَعَ لِحَلاَلٍ وَحَرَامٍ وَأَمْرٍ وَنَهْيٍ، مِنْ هَذِهِ الْآيَةِ‏:‏ ‏{‏إِنَّ اللَّهَ يَأْمُرُ بِالْعَدْلِ وَالإِحْسَانِ وَإِيتَاءِ ذِي الْقُرْبَى‏}‏‏؟‏ قَالَ‏:‏ نَعَمْ، قَالَ‏:‏ وَأَنَا قَدْ سَمِعْتُهُ، قَالَ‏:‏ فَهَلْ سَمِعْتَ عَبْدَ اللهِ يَقُولُ‏:‏ مَا فِي الْقُرْآنِ آيَةٌ أَسْرَعَ فَرَجًا مِنْ قَوْلِهِ‏:‏ ‏{‏وَمَنْ يَتَّقِ اللَّهَ يَجْعَلْ لَهُ مَخْرَجًا‏}‏‏؟‏ قَالَ‏:‏ نَعَمْ، قَالَ‏:‏ وَأَنَا قَدْ سَمِعْتُهُ، قَالَ‏:‏ فَهَلْ سَمِعْتَ عَبْدَ اللهِ يَقُولُ‏:‏ مَا فِي الْقُرْآنِ آيَةٌ أَشَدَّ تَفْوِيضًا مِنْ قَوْلِهِ‏:‏ ‏{‏يَا عِبَادِيَ الَّذِينَ أَسْرَفُوا عَلَى أَنْفُسِهِمْ لاَ تَقْنَطُوا‏}‏ مِنْ رَحْمَةِ اللهِ‏؟‏ قَالَ‏:‏ نَعَمْ، قَالَ‏:‏ وَأَنَا سَمِعْتُهُ‏.‏","english":{"narrator":"Abu'd-Duha said:","text":"\"Masruq and Shutayr ibn Shakal met in the mosque.\nThe people sitting in circles in the mosque moved towards them. Masruq\nsaid, 'I can only think that these people are gathering around us in order\nto hear good from us. If you relate from 'Abdullah, I will confirm you.\nIf I relate from 'Abdullah, you can confirm me.' He said, 'Abu 'A'isha,\nrelate!' He said, 'Did you hear 'Abdullah say, \"The eyes commit fornication.\nThe hands commit fornication. The feet commit fornication, and then the\ngenitals either confirm or deny that?\"' 'Yes,' he replied, 'I have heard\nit.' He said, 'Did you hear 'Abdullah say, \"There is no ayat in the Qur'an\nwhich is greater in combining the halal and the haram and the command and the\nprohibition than this ayat: 'Indeed Allah commands to justice and doing good and\ngiving to relatives' (16.90)?\"' 'Yes,' he replied, 'I have heard it.' He\nsaid, 'Did you hear 'Abdullah say, \"There is no ayat in the Qur'an swifter\nin bringing relief than His words, \"Whoever has taqwa of Allah - He\nwill give him a way out\" (65:2)?' 'Yes,' he replied, 'I have heard it.'\nHe said, 'Did you hear 'Abdullah say, \"There is no ayat in the Qur'an stronger\nin entrusting things to Allah than His words, \"My slaves, you have transgressed\nagainst yourselves, do not despair of the mercy of Allah\" (39:53)?' 'Yes,'\nhe replied, 'I heard that.'\""}},{"id":8,"idInBook":8,"chapterId":28,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ الأعْلَى بْنُ مُسْهِرٍ، أَوْ بَلَغَنِي عَنْهُ، قَالَ‏:‏ حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الْعَزِيزِ، عَنْ رَبِيعَةَ بْنِ يَزِيدَ، عَنْ أَبِي إِدْرِيسَ الْخَوْلاَنِيِّ، عَنْ أَبِي ذَرٍّ، عَنِ النَّبِيِّ صلى الله عليه وسلم، عَنِ اللهِ تَبَارَكَ وَتَعَالَى قَالَ‏:‏ يَا عِبَادِي، إِنِّي قَدْ حَرَّمْتُ الظُّلْمَ عَلَى نَفْسِي، وَجَعَلْتُهُ مُحَرَّمًا بَيْنَكُمْ فَلاَ تَظَالَمُوا‏.‏ يَا عِبَادِي، إِنَّكُمُ الَّذِينَ تُخْطِئُونَ بِاللَّيْلِ وَالنَّهَارِ وَأَنَا أَغْفِرُ الذُّنُوبَ، وَلاَ أُبَالِي، فَاسْتَغْفِرُونِي أَغْفِرْ لَكُمْ‏.‏ يَا عِبَادِي، كُلُّكُمْ جَائِعٌ إِلاَّ مَنْ أَطْعَمْتُهُ، فَاسْتَطْعِمُونِي أُطْعِمْكُمْ‏.‏ يَا عِبَادِي، كُلُّكُمْ عَارٍ إِلاَّ مِنْ كَسَوْتُهُ، فَاسْتَكْسُونِي أَكْسُكُمْ‏.‏ يَا عِبَادِي، لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ، وَإِنْسَكُمْ وَجِنَّكُمْ، كَانُوا عَلَى أَتْقَى قَلْبِ عَبْدٍ مِنْكُمْ، لَمْ يَزِدْ ذَلِكَ فِي مُلْكِي شَيْئًا، وَلَوْ كَانُوا عَلَى أَفْجَرِ قَلْبِ رَجُلٍ، لَمْ يَنْقُصْ ذَلِكَ مِنْ مُلْكِي شَيْئًا، وَلَوِ اجْتَمَعُوا فِي صَعِيدٍ وَاحِدٍ فَسَأَلُونِي فَأَعْطَيْتُ كُلَّ إِنْسَانٍ مِنْهُمْ مَا سَأَلَ، لَمْ يَنْقُصْ ذَلِكَ مِنْ مُلْكِي شَيْئًا، إِلاَّ كَمَا يَنْقُصُ الْبَحْرُ أَنْ يُغْمَسَ فِيهِ الْخَيْطُ غَمْسَةً وَاحِدَةً‏.‏ يَا عِبَادِي، إِنَّمَا هِيَ أَعْمَالُكُمْ أَجْعَلُهَا عَلَيْكُمْ، فَمَنْ وَجَدَ خَيْرًا فَلْيَحْمَدِ اللَّهَ، وَمَنْ وَجَدَ غَيْرَ ذَلِكَ فَلاَ يَلُومُ إِلاَّ نَفْسَهُ كَانَ أَبُو إِدْرِيسَ إِذَا حَدَّثَ بِهَذَا الْحَدِيثِ جَثَى عَلَى رُكْبَتَيْهِ‏.‏","english":{"narrator":"Abu Dharr reported that the Prophet, may Allah bless him and grant\nhim peace, reported that Allah, the Blessed and Exalted, said:","text":"\"My slaves!\nI have forbidden injustice for Myself and I have made it forbidden among\nyou, so do not wrong one another.\n\n\"My slaves! You err by night and day and I forgive wrong actions and do not care. Ask me for forgiveness and I will forgive you.\n\n\"My slaves! All of you are hungry unless I have fed you, so ask Me to feed you, and I will feed you. All of you are naked unless I have clothed you, so ask Me to clothe you and I will clothe you.\n\n\"My slaves! If all of you, the first of you and the last of you, the jinn among you and the men among you, were to be as godfearing as the most godfearing heart of any one of you, that would not add anything to My kingdom. If they were to be as corrupt as the most corrupt heart of any one of you, that would not decrease anything in My kingdom. If they were to join together in one place and then ask of Me, and I gave every man among them what he asked for that, that would not reduce My kingdom at all, except as the sea is decreased if a needle is dipped into it.\n\n\"My slaves! It is only your actions which I have appointed for you. Whoever finds good should praise Allah. Whoever finds other than that should only blame himself.'\""}}],"chapter":{"id":28,"bookId":15,"arabic":"كتاب الظُّلْم","english":"Injustice"}}