{"metadata":{"length":47,"arabic":{"title":"الأدب المفرد","author":"الإمام محمد بن إسماعيل البخاري","introduction":"كتاب عيادة المرضى"},"english":{"title":"Al-Adab Al-Mufrad","author":"Imam Muhammad ibn Ismail al-Bukhari","introduction":"Visiting the Ill"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":29,"bookId":15,"arabic":"حَدَّثَنَا إِسْحَاقُ بْنُ الْعَلاَءِ، قَالَ‏:‏ حَدَّثَنَا عَمْرُو بْنُ الْحَارِثِ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ اللهِ بْنُ سَالِمٍ، عَنْ مُحَمَّدٍ الزُّبَيْدِيِّ، قَالَ‏:‏ حَدَّثَنَا سُلَيْمَانُ بْنُ عَامِرٍ، أَنَّ غُطَيْفَ بْنَ الْحَارِثِ أَخْبَرَهُ، أَنَّ رَجُلاً أَتَى أَبَا عُبَيْدَةَ بْنَ الْجَرَّاحِ، وَهُوَ وَجِعٌ، فَقَالَ‏:‏ كَيْفَ أَمْسَى أَجْرُ الأَمِيرِ‏؟‏ فَقَالَ‏:‏ هَلْ تَدْرُونَ فِيمَا تُؤْجَرُونَ بِهِ‏؟‏ فَقَالَ‏:‏ بِمَا يُصِيبُنَا فِيمَا نَكْرَهُ، فَقَالَ‏:‏ إِنَّمَا تُؤْجَرُونَ بِمَا أَنْفَقْتُمْ فِي سَبِيلِ اللهِ، وَاسْتُنْفِقَ لَكُمْ، ثُمَّ عَدَّ أَدَاةَ الرَّحْلِ كُلَّهَا حَتَّى بَلَغَ عِذَارَ الْبِرْذَوْنِ، وَلَكِنَّ هَذَا الْوَصَبَ الَّذِي يُصِيبُكُمْ فِي أَجْسَادِكُمْ يُكَفِّرُ اللَّهُ بِهِ مِنْ خَطَايَاكُمْ‏.‏","english":{"narrator":"","text":"Ghatif ibn al-Harith said that a man came to Abu 'Ubayda ibn al-Jarrah\nwhile he was in pain and asked, \"What is the reward of the amir?\" Abu 'Ubayda\nsaid, \"Do you know that for which you will be rewarded?\" The man replied,\n\"We will be rewarded for things which happen to us which we dislike.\" Abu\n'Ubayda said, \"Rather you will be rewarded for what you spend in the Cause\nof Allah and what is spent on you. Then there is a reckoning for all parts\nof the saddle, even the horse's bridle. Allah will remove your errors from\nyou for the sake of this fatigue which has afflicted your bodies.\""}},{"id":2,"idInBook":2,"chapterId":29,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ عَمْرٍو، قَالَ‏:‏ حَدَّثَنَا زُهَيْرُ بْنُ مُحَمَّدٍ، عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَلْحَلَةَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، وَأَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ مَا يُصِيبُ الْمُسْلِمَ مِنْ نَصَبٍ، وَلاَ وَصَبٍ، وَلاَّهَمٍّ، وَلاَ حَزَنٍ، وَلاَ أَذًى، وَلاَ غَمٍّ، حَتَّى الشَّوْكَةُ يُشَاكُهَا، إِلاَّ كَفَّرَ اللَّهُ بِهَا مِنْ خَطَايَاهُ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"A Muslim does not encounter fatigue, tiredness,\nconcern, sorrow, injury or grief, or even a thorn which pricks him without\nAllah expiating his errors for him by that.\""}},{"id":3,"idInBook":3,"chapterId":29,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى، قَالَ‏:‏ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَعِيدٍ، عَنْ أَبِيهِ قَالَ‏:‏ كُنْتُ مَعَ سَلْمَانَ، وَعَادَ مَرِيضًا فِي كِنْدَةَ، فَلَمَّا دَخَلَ عَلَيْهِ قَالَ‏:‏ أَبْشِرْ، فَإِنَّ مَرَضَ الْمُؤْمِنِ يَجْعَلُهُ اللَّهُ لَهُ كَفَّارَةً وَمُسْتَعْتَبًا، وَإِنَّ مَرَضَ الْفَاجِرِ كَالْبَعِيرِ عَقَلَهُ أَهْلُهُ ثُمَّ أَرْسَلُوهُ، فَلاَ يَدْرِي لِمَ عُقِلَ وَلِمَ أُرْسِلَ‏.‏","english":{"narrator":"","text":"'Abdu'r-Rahman ibn Sa'id reported that his father said, \"I waswith Salman when he visited a sick person in Kinda. When he went in, he\nsaid, 'Good news! Allah makes the illness of the believer an expiation for him and a restoration, whereas the illness of the corrupt person is like a camel whose people hobble it and the let it go. It does not know\nwhy it was hobbled or released.'\""}},{"id":4,"idInBook":4,"chapterId":29,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى، قَالَ‏:‏ حَدَّثَنَا حَمَّادٌ، قَالَ‏:‏ أَخْبَرَنَا عَدِيُّ بْنُ عَدِيٍّ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ لاَ يَزَالُ الْبَلاَءُ بِالْمُؤْمِنِ وَالْمُؤْمِنَةِ، فِي جَسَدِهِ وَأَهْلِهِ وَمَالِهِ، حَتَّى يَلْقَى اللَّهَ عَزَّ وَجَلَّ وَمَا عَلَيْهِ خَطِيئَةٌ‏.‏\nحدثنا محمد بن عبيد قال: حدثنا عمر بن طلحة، عن محمد بن عمرو مثله وزاد (في ولده).","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"Affliction will continue to trouble the believers,\nmen and women, in their bodies, their families, and their property until\nthey meet Allah Almighty purified of every wrong action.\""}},{"id":5,"idInBook":5,"chapterId":29,"bookId":15,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، قَالَ‏:‏ حَدَّثَنَا أَبُو بَكْرٍ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ جَاءَ أَعْرَابِيٌّ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ هَلْ أَخَذَتْكَ أُمُّ مِلْدَمٍ‏؟‏ قَالَ‏:‏ وَمَا أُمُّ مِلْدَمٍ‏؟‏ قَالَ‏:‏ حَرٌّ بَيْنَ الْجِلْدِ وَاللَّحْمِ، قَالَ‏:‏ لاَ، قَالَ‏:‏ فَهَلْ صُدِعْتَ‏؟‏ قَالَ‏:‏ وَمَا الصُّدَاعُ‏؟‏ قَالَ‏:‏ رِيحٌ تَعْتَرِضُ فِي الرَّأْسِ، تَضْرِبُ الْعُرُوقَ، قَالَ‏:‏ لاَ، قَالَ‏:‏ فَلَمَّا قَامَ قَالَ‏:‏ مَنْ سَرَّهُ أَنْ يَنْظُرَ إِلَى رَجُلٍ مِنْ أَهْلِ النَّارِ أَيْ‏:‏ فَلْيَنْظُرْهُ‏.‏","english":{"narrator":"","text":"Abu Hurayra said, \"A bedouin came and the Prophet, may Allah bless\nhim and grant him peace, asked, 'Has Umm Mildam (fever) got hold of you?'\n'What is Umm Mildam?' he asked. He said, 'The heat between the skin and\nthe flesh.' The bedouin said, 'No.' He asked, 'Have you got a headache?'\n'What is headache?' the man asked. He replied, 'A wind which appears in\nthe head and beats the veins.' 'No,' he said, When he stood up, he said,\n'Whoever wants to look at a man who is one of the people of the Fire,'\ni.e. 'let them look at that man.'\""}},{"id":6,"idInBook":6,"chapterId":29,"bookId":15,"arabic":"حَدَّثَنَا عِمْرَانُ بْنُ مَيْسَرَةَ، قَالَ‏:‏ حَدَّثَنَا ابْنُ فُضَيْلٍ، قَالَ‏:‏ حَدَّثَنَا حُصَيْنٌ، عَنْ شَقِيقِ بْنِ سَلَمَةَ، عَنْ خَالِدِ بْنِ الرَّبِيعِ قَالَ‏:‏ لَمَّا ثَقُلَ حُذَيْفَةُ سَمِعَ بِذَلِكَ رَهْطُهُ وَالأَنْصَارُ، فَأَتَوْهُ فِي جَوْفِ اللَّيْلِ أَوْ عِنْدَ الصُّبْحِ، قَالَ‏:‏ أَيُّ سَاعَةٍ هَذِهِ‏؟‏ قُلْنَا‏:‏ جَوْفُ اللَّيْلِ أَوْ عِنْدَ الصُّبْحِ، قَالَ‏:‏ أَعُوذُ بِاللَّهِ مِنْ صَبَاحِ النَّارِ، قَالَ‏:‏ جِئْتُمْ بِمَا أُكَفَّنُ بِهِ‏؟‏ قُلْنَا‏:‏ نَعَمْ، قَالَ‏:‏ \n\"لاَ تُغَالُوا بِالأَكْفَانِ، فَإِنَّهُ إِنْ يَكُنْ لِي عِنْدَ اللهِ خَيْرٌ بُدِّلْتُ بِهِ خَيْرًا مِنْهُ، وَإِنْ كَانَتِ الأُخْرَى سُلِبْتُ سَلْبًا سَرِيعًا‏.‏\" قال ابن إدريس أتيناه في بعض الليل.","english":{"narrator":"","text":"Khalid bin al-Rabi, reported that when the illness of Huzayfah became serious his group and the Ansar heard of it. They visited him at night or in the (early) morning. Sayyidina Huzayfah asked, \"What time is it?\" They said, \"It is midnight or nearing morning.\" He said, \"I seek refuge in Allah from the morning which heralds admittance to Hell.\" He then asked, \"Have you brought the cloth? Do no shroud me in costly (cloth), for if there is good for me with Allah then I will be given a better replacement but if it is the other way then even this will be taken away quickly\"."}},{"id":7,"idInBook":7,"chapterId":29,"bookId":15,"arabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، قَالَ‏:‏ حَدَّثَنَا عِيسَى بْنُ الْمُغِيرَةِ، عَنِ ابْنِ أَبِي ذِئْبٍ، عَنْ جُبَيْرِ بْنِ أَبِي صَالِحٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ إِذَا اشْتَكَى الْمُؤْمِنُ أَخْلَصَهُ اللَّهُ كَمَا يُخَلِّصُ الْكِيرُ خَبَثَ الْحَدِيدِ‏.‏","english":{"narrator":"","text":"It is reported by Ayeshah that the Prophet said, \"When a Believer falls ill, Allah cleans him of sin as a kiln removes the rust from iron\"."}},{"id":8,"idInBook":8,"chapterId":29,"bookId":15,"arabic":"حَدَّثَنَا بِشْرٌ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ اللهِ، قَالَ‏:‏ أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ قَالَ‏:‏ حَدَّثَنِي عُرْوَةُ، عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ مَا مِنْ مُسْلِمٍ يُصَابُ بِمُصِيبَةٍ، وَجَعٍ أَوْ مَرَضٍ، إِلاَّ كَانَ كَفَّارَةَ ذُنُوبِهِ، حَتَّى الشَّوْكَةُ يُشَاكُهَا، أَوِ النَّكْبَةُ‏.‏","english":{"narrator":"","text":"It is narrated by Ayeshah (ra) that the Prophet (ﷺ) said, \"when a Muslim is afflicted by an anxiety, pain or sickness then, because of \nthat, his sins are atoned. So much, so that if a thorn pricks him or he suffers a simple, minor injury (His sins are forgiven)”."}},{"id":9,"idInBook":9,"chapterId":29,"bookId":15,"arabic":"حَدَّثَنَا الْمَكِّيُّ، قَالَ‏:‏ حَدَّثَنَا الْجُعَيْدُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ بِنْتِ سَعْدٍ، أَنَّ أَبَاهَا قَالَ‏:‏ اشْتَكَيْتُ بِمَكَّةَ شَكْوَى شَدِيدَةً، فَجَاءَ النَّبِيُّ صلى الله عليه وسلم يَعُودُنِي، فَقُلْتُ‏:‏ يَا رَسُولَ اللهِ، إِنِّي أَتْرُكُ مَالاً، وَإِنِّي لَمْ أَتْرُكْ إِلاَّ ابْنَةً وَاحِدَةً، أَفَأُوصِي بِثُلُثَيْ مَالِي، وَأَتْرُكُ الثُّلُثَ‏؟‏ قَالَ‏:‏ لاَ، قَالَ‏:‏ أُوصِي النِّصْفَ، وَأَتْرُكُ لَهَا النِّصْفَ‏؟‏ قَالَ‏:‏ لاَ، قَالَ‏:‏ فَأَوْصِي بِالثُّلُثِ، وَأَتْرُكُ لَهَا الثُّلُثَيْنِ‏؟‏ قَالَ‏:‏ الثُّلُثُ، وَالثُّلُثُ كَثِيرٌ، ثُمَّ وَضَعَ يَدَهُ عَلَى جَبْهَتِي، ثُمَّ مَسَحَ وَجْهِي وَبَطْنِي، ثُمَّ قَالَ‏:‏ اللَّهُمَّ اشْفِ سَعْدًا، وَأَتِمَّ لَهُ هِجْرَتَهُ، فَمَا زِلْتُ أَجِدُ بَرْدَ يَدِهِ عَلَى كَبِدِي فِيمَا يَخَالُ إِلَيَّ حَتَّى السَّاعَةِ‏.‏","english":{"narrator":"It is narrated by Sayyidah Ayeshah daughter of Sad that her father Sad bin Abu Waqqas said:","text":"I was seriously ill at Makkah and the \nProphet visited me. I said to him \"Messenger of Allah, I shall leave behind me a good fortune and I have only a daughter (as my heir). Shall I bequeath two-thirds of my property to be spent in charity and leave one-third (for the heir)?\" He said, \"No!\" Then I asked, \"Shall I bequeath half and leave her half?\" He again said, \"No\". Then I asked, \"Shall I Bequeath one-third and leave two- third (for her)?\" the Prophet said,\"(You may bequeath) one-third, but even \none-third is much\". \n\nHe then placed his hand on my forehead and passed it over my face and \nstomach and made this supplication. \"O Allah, cure sad and completed his \nemigration.\" Ever since I have not ceased to sense the pleasant cool of his \nhand on my liver.\""}},{"id":10,"idInBook":10,"chapterId":29,"bookId":15,"arabic":"حَدَّثَنَا قَبِيصَةُ بْنُ عُقْبَةَ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ، عَنِ الْقَاسِمِ بْنِ مُخَيْمِرَةَ، عَنْ عَبْدِ اللهِ بْنِ عَمْرٍو، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ مَا مِنْ أَحَدٍ يَمْرَضُ، إِلاَّ كُتِبَ لَهُ مِثْلُ مَا كَانَ يَعْمَلُ وَهُوَ صَحِيحٌ‏.‏","english":{"narrator":"","text":"It is narrated by Abdullah bin Amr that Prophet (ﷺ) said, \"When a person falls ill then the reward of those deeds is also recorded for him which he used to perform when he was healthy."}},{"id":11,"idInBook":11,"chapterId":29,"bookId":15,"arabic":"حَدَّثَنَا عَارِمٌ، قَالَ‏:‏ حَدَّثَنَا سَعِيدُ بْنُ زَيْدٍ، قَالَ‏:‏ حَدَّثَنَا سِنَانٌ أَبُو رَبِيعَةَ، قَالَ‏:‏ حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ مَا مِنْ مُسْلِمٍ ابْتَلاَهُ اللَّهُ فِي جَسَدِهِ إِلاَّ كُتِبَ لَهُ مَا كَانَ يَعْمَلُ فِي صِحَّتِهِ، مَا كَانَ مَرِيضًا، فَإِنْ عَافَاهُ، أُرَاهُ قَالَ‏:‏ عَسَلَهُ، وَإِنْ قَبَضَهُ غَفَرَ لَهُ‏.‏\nحدثنا موسى قال: حدثنا حماد بن سلمة، عن ينام عن أني، عن النبي ﷺ مثله وزاد (قال: فإن شفاه عسله).","english":{"narrator":"","text":"Anas bin Maalik has reported that the Prophet (ﷺ) said, \"When Allah involves a Muslim in bodily [pain then he is credited with a reward for those deeds which he was used to do when he was healthy as long as he is ill. Thus, if Allah gives him healing, He washes him (clean of sins). But, if he causes him to die then he forgives him."}},{"id":12,"idInBook":12,"chapterId":29,"bookId":15,"arabic":"حَدَّثَنَا قُرَّةُ بْنُ حَبِيبٍ، قَالَ‏:‏ حَدَّثَنَا إِيَاسُ بْنُ أَبِي تَمِيمَةَ، عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ جَاءَتِ الْحُمَّى إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَتِ‏:‏ ابْعَثْنِي إِلَى آثَرِ أَهْلِكَ عِنْدَكَ، فَبَعَثَهَا إِلَى الأَنْصَارِ، فَبَقِيَتْ عَلَيْهِمْ سِتَّةَ أَيَّامٍ وَلَيَالِيهِنَّ، فَاشْتَدَّ ذَلِكَ عَلَيْهِمْ، فَأَتَاهُمْ فِي دِيَارِهِمْ، فَشَكَوْا ذَلِكَ إِلَيْهِ، فَجَعَلَ النَّبِيُّ صلى الله عليه وسلم يَدْخُلُ دَارًا دَارًا، وَبَيْتًا بَيْتًا، يَدْعُو لَهُمْ بِالْعَافِيَةِ، فَلَمَّا رَجَعَ تَبِعَتْهُ امْرَأَةٌ مِنْهُمْ فَقَالَتْ‏:‏ وَالَّذِي بَعَثَكَ بِالْحَقِّ إِنِّي لِمَنَ الأَنْصَارِ، وَإِنَّ أَبِي لِمَنَ الأَنْصَارِ، فَادْعُ اللَّهَ لِي كَمَا دَعَوْتَ لِلأَنْصَارِ، قَالَ‏:‏ مَا شِئْتِ، إِنْ شِئْتِ دَعَوْتُ اللَّهَ أَنْ يُعَافِيَكِ، وَإِنْ شِئْتِ صَبَرْتِ وَلَكِ الْجَنَّةُ، قَالَتْ‏:‏ بَلْ أَصْبِرُ، ولا أَجْعَلُ الْجَنَّةَ خَطَرًا‏.‏","english":{"narrator":"","text":"Abu Hurayrah said that fever presented itself before the Holy Prophet (ﷺ). It said to him, ’’Send me to those people with whom you have a very deep connection. The Prophet (ﷺ) sent it to the Ansar. So, fever gripped them for six days and six nights. Their feverish condition became very serious and the Prophet visited them at their homes. Thy complained of fever and the Holy Prophet (ﷺ) went to each house and prayed for their health. When he was returning, one of their women followed behind him and said, \"By Him who has sent you with the truth, I am of the Ansar and my father is also one of the Ansar. Just as you have prayed for the Ansar, pray for me too.\" The Prophet sg asked her, \"What is it that you wish? If you wish, I will pray to Allah that he grant you health but if you are patient then paradise is for you.\" She said, \"I will endure (fever) patiently and will not risk (my chance of) admission to paradise.\""}},{"id":13,"idInBook":13,"chapterId":29,"bookId":15,"arabic":"وَعَنْ عَطَاءٍ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ مَا مِنْ مَرَضٍ يُصِيبُنِي أَحَبَّ إِلَيَّ مِنَ الْحُمَّى، لأَنَّهَا تَدْخُلُ فِي كُلِّ عُضْوٍ مِنِّي، وَإِنَّ اللَّهَ عَزَّ وَجَلَّ يُعْطِي كُلَّ عُضْوٍ قِسْطَهُ مِنَ الأَجْرِ‏.‏","english":{"narrator":"","text":"Abu Hurayrah said that he did not like any illness more than fever because it went into each of his limbs. And, Allah grants each limb its share of reward."}},{"id":14,"idInBook":14,"chapterId":29,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنْ أَبِي نُحَيْلَةَ، قِيلَ لَهُ‏:‏ ادْعُ اللَّهَ، قَالَ‏:‏ اللَّهُمَّ انْقُصْ مِنَ الْمَرَضِ، وَلاَ تَنْقُصْ مِنَ الأَجْرِ، فَقِيلَ لَهُ‏:‏ ادْعُ، ادْعُ‏.‏ فَقَالَ‏:‏ اللَّهُمَّ اجْعَلْنِي مِنَ الْمُقَرَّبِينَ، وَاجْعَلْ أُمِّي مِنَ الْحُورِ الْعِينِ‏.‏","english":{"narrator":"","text":"It is reported by Abu wail that someone said to Abu Nuhaylah (when he was ill), \"Pray to Allah.\" So, he made this supplication, \"Oh Allah, lessen the illness but do not diminish the reward.\" He was again asked to supplicate Allah and he said, \"O Allah, let me be among the near ones and make my mother among the hoor (maids of Paradise)”."}},{"id":15,"idInBook":15,"chapterId":29,"bookId":15,"arabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ‏:‏ حَدَّثَنَا يَحْيَى، عَنْ عِمْرَانَ بْنِ مُسْلِمٍ أَبِي بَكْرٍ قَالَ‏:‏ حَدَّثَنِي عَطَاءُ بْنُ أَبِي رَبَاحٍ قَالَ‏:‏ قَالَ لِيَ ابْنُ عَبَّاسٍ‏:‏ أَلاَ أُرِيكَ امْرَأَةً مِنْ أَهْلِ الْجَنَّةِ‏؟‏ قُلْتُ‏:‏ بَلَى، قَالَ‏:‏ هَذِهِ الْمَرْأَةُ السَّوْدَاءُ أَتَتِ النَّبِيَّ صلى الله عليه وسلم فَقَالَتْ‏:‏ إِنِّي أُصْرَعُ، وَإِنِّي أَتَكَشَّفُ، فَادْعُ اللَّهَ لِي، قَالَ‏:‏ إِنْ شِئْتِ صَبَرْتِ وَلَكِ الْجَنَّةُ، وَإِنْ شِئْتِ دَعَوْتُ اللَّهَ أَنْ يُعَافِيَكَ، فَقَالَتْ‏:‏ أَصْبِرُ، فَقَالَتْ‏:‏ إِنِّي أَتَكَشَّفُ، فَادْعُ اللَّهَ لِي أَنْ لا أَتَكَشَّفَ، فَدَعَا لَهَا‏.‏","english":{"narrator":"","text":"Ata bin Abu Rabah said that Ibn Abbas asked him if he would like him to show him a woman who would go to paradise. So, he said that he would certainly like (him to show him the woman). Ibn Abbas said to him. \"This is a black woman who came to the Prophet and said to him, \"Messenger of Allah, I am subject to fits and become uncovered, so make a supplication to Allah to cure me, \"The Prophet (ﷺ) said to her, \"If you endure it patiently, you will be rewarded with paradise, but if you wish I will make a supplication to Allah to cure you.\" The woman said, ’I shall endure it. But, (when I get fits) I become uncovered, make supplication to Allah that I may not become uncovered. So, he made a supplication for her.\""}},{"id":16,"idInBook":16,"chapterId":29,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، قَالَ‏:‏ حَدَّثَنَا مَخْلَدٌ، عَنِ ابْنِ جُرَيْجٍ قَالَ‏:‏ أَخْبَرَنِي عَطَاءٌ، أَنَّهُ رَأَى أُمَّ زُفَرَ، تِلْكَ الْمَرْأَةُ، طَوِيلَةً سَوْدَاءَ عَلَى سُلَّمِ الْكَعْبَةِ‏.\n\nقَالَ‏:‏ وَأَخْبَرَنِي عَبْدُ اللهِ بْنُ أَبِي مُلَيْكَةَ، أَنَّ الْقَاسِمَ أَخْبَرَهُ، أَنَّ عَائِشَةَ أَخْبَرَتْهُ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَقُولُ‏:‏ مَا أَصَابَ الْمُؤْمِنَ مِنْ شَوْكَةٍ فَمَا فَوْقَهَا، فَهُوَ كَفَّارَةٌ‏.‏‏","english":{"narrator":"","text":"It is reported by Ibn Jurayj that Ata said to him, \"I saw the woman, Umm Zufar, on the steps of the Kabah. (She was) a black woman, tall in height\". \n\nAyeshah, said that the Prophet said, \"If a thorn pricks a Believer or he is hurt more than that then that is an expiation for his sins.\""}},{"id":17,"idInBook":17,"chapterId":29,"bookId":15,"arabic":"حَدَّثَنَا بِشْرٌ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ اللهِ، قَالَ‏:‏ حَدَّثَنَا عُبَيْدُ اللهِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللهِ بْنِ مَوْهَبٍ قَالَ‏:‏ حَدَّثَنِي عَمِّي عُبَيْدُ اللهِ بْنُ عَبْدِ اللهِ بْنِ مَوْهَبٍ قَالَ‏:‏ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ مَا مِنْ مُسْلِمٍ يُشَاكُ شَوْكَةً فِي الدُّنْيَا يَحْتَسِبُهَا، إِلاَّ قُصَّ بِهَا مِنْ خَطَايَاهُ يَوْمَ الْقِيَامَةِ‏.‏","english":{"narrator":"","text":"Abu Hurayrah reported the Messenger of Allah (ﷺ) as saying, \"if a thorn pricks a Muslim in this world and he hopes for the reward against it then Allah forgives him his sins on the day of Resurrection\"."}},{"id":18,"idInBook":18,"chapterId":29,"bookId":15,"arabic":"حَدَّثَنَا عُمَرُ، قَالَ‏:‏ حَدَّثَنَا أَبِي، قَالَ‏:‏ حَدَّثَنَا الأَعْمَشُ قَالَ‏:‏ حَدَّثَنِي أَبُو سُفْيَانَ، عَنْ جَابِرٍ قَالَ‏:‏ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ‏:‏ مَا مِنْ مُؤْمِنٍ وَلاَ مُؤْمِنَةٍ، وَلاَ مُسْلِمٍ وَلاَ مَسْلَمَةٍ، يَمْرَضُ مَرَضًا إِلاَّ قَصَّ اللَّهُ بِهِ عَنْهُ مِنْ خَطَايَاهُ‏.‏","english":{"narrator":"","text":"It is narrated by Jabir that he heard the Messenger of Allah (ﷺ) say, \"If a believing man or a believing woman or a Muslim man or Muslim woman falls ill then Allah, the exalted, forgives them their sins (because of their illness).\""}},{"id":19,"idInBook":19,"chapterId":29,"bookId":15,"arabic":"حَدَّثَنَا زَكَرِيَّا، قَالَ‏:‏ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ قَالَ‏:‏ دَخَلْتُ أَنَا وَعَبْدُ اللهِ بْنُ الزُّبَيْرِ عَلَى أَسْمَاءَ، قَبْلَ قَتْلِ عَبْدِ اللهِ بِعَشْرِ لَيَالٍ، وَأَسْمَاءُ وَجِعَةٌ، فَقَالَ لَهَا عَبْدُ اللهِ‏:‏ كَيْفَ تَجِدِينَكِ‏؟‏ قَالَتْ‏:‏ وَجِعَةٌ، قَالَ‏:‏ إِنِّي فِي الْمَوْتِ، فَقَالَتْ‏:‏ لَعَلَّكَ تَشْتَهِي مَوْتِي، فَلِذَلِكَ تَتَمَنَّاهُ‏؟‏ فَلاَ تَفْعَلْ، فَوَاللَّهِ مَا أَشْتَهِي أَنْ أَمُوتَ حَتَّى يَأْتِيَ عَلَيَّ أَحَدُ طَرَفَيْكَ، أَوْ تُقْتَلَ فَأَحْتَسِبَكَ، وَإِمَّا أَنْ تَظْفُرَ فَتَقَرَّ عَيْنِي، فَإِيَّاكَ أَنْ تُعْرَضَ عَلَيْكَ خُطَّةٌ، فَلاَ تُوَافِقُكَ، فَتَقْبَلُهَا كَرَاهِيَةَ الْمَوْتِ‏.‏ وإنما عنى ابن الزبير ليقتل فيُحزنُها ذلك.","english":{"narrator":"Hisham reported that his father ('Urwa ibn az-Zubayr) said, \"'Abdullah\nibn az-Zubayr and I went to visit Asma' ten nights before 'Abdullah was\nkilled. Asma' was in pain and 'Abdullah asked her, 'How are you feeling?'\n'In pain,' she replied. He said, 'I am near death.' She said, 'Perhaps\nyou desire my death and that is the reason you desire it? Do not do that.\nBy Allah, I do not want to die until I reach one of the two ends:","text":"either\nyou will be killed and I will leave you to Allah or you will win and I\nwill be content. Beware of having your portion presented to you and then\nyou do not agree with it. Accept it, even though you dislike death.\""}},{"id":20,"idInBook":20,"chapterId":29,"bookId":15,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ عِيسَى، قَالَ‏:‏ حَدَّثَنَا عَبْدُ اللهِ بْنُ وَهْبٍ قَالَ‏:‏ أَخْبَرَنِي هِشَامُ بْنُ سَعْدٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّهُ دَخَلَ عَلَى رَسُولِ اللهِ صلى الله عليه وسلم وَهُوَ مَوْعُوكٌ، عَلَيْهِ قَطِيفَةٌ، فَوَضَعَ يَدَهُ عَلَيْهِ، فَوَجَدَ حَرَارَتَهَا فَوْقَ الْقَطِيفَةِ، فَقَالَ أَبُو سَعِيدٍ‏:‏ مَا أَشَدَّ حُمَّاكَ يَا رَسُولَ اللهِ، قَالَ‏:‏ إِنَّا كَذَلِكَ، يَشْتَدُّ عَلَيْنَا الْبَلاَءُ، وَيُضَاعَفُ لَنَا الأَجْرُ، فَقَالَ‏:‏ يَا رَسُولَ اللهِ، أَيُّ النَّاسِ أَشَدُّ بَلاَءً‏؟‏ قَالَ‏:‏ الأَنْبِيَاءُ، ثُمَّ الصَّالِحُونَ، وَقَدْ كَانَ أَحَدُهُمْ يُبْتَلَى بِالْفَقْرِ حَتَّى مَا يَجِدُ إِلاَّ الْعَبَاءَةَ يَجُوبُهَا فَيَلْبَسُهَا، وَيُبْتَلَى بِالْقُمَّلِ حَتَّى يَقْتُلَهُ، وَلَأَحَدُهُمْ كَانَ أَشَدَّ فَرَحًا بِالْبَلاَءِ مِنْ أَحَدِكُمْ بِالْعَطَاءِ‏.‏","english":{"narrator":"","text":"Abu Sa'id al-Khudri reported that he came to the Messenger of Allah,\nmay Allah bless him and grant him peace, while he had a fever. He had a\ncovering over him. He placed his hand on him and discovered that it was\nhot above the covering. Abu Sa'id exclaimed, 'How hot your fever is, Messenger\nof Allah!' He said, 'We are like that. The affliction is hard on us, but\nthe reward is doubled for us.' He said, 'Messenger of Allah, which people\nhave the greatest affliction?' He replied, 'The Prophets, and then the\nrighteous. One of them was tested by poverty to such an extent that he\ncould only find a robe to cover himself with and he wore it. Another was\ntested by fleas until they killed him. They have greater joy in affliction\nthan one of you has in gifts.\""}},{"id":21,"idInBook":21,"chapterId":29,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ الْمُنْكَدِرِ، سَمِعَ جَابِرَ بْنَ عَبْدِ اللهِ يَقُولُ‏:‏ مَرِضْتُ مَرَضًا، فَأَتَانِي النَّبِيُّ صلى الله عليه وسلم يَعُودُنِي وَأَبُو بَكْرٍ وَهُمَا مَاشِيَانِ، فَوَجَدَانِي أُغْمِيَ عَلَيَّ، فَتَوَضَّأَ النَّبِيُّ صلى الله عليه وسلم ثُمَّ صَبَّ وَضُوءَهُ عَلَيَّ، فَأَفَقْتُ فَإِذَا النَّبِيُّ صلى الله عليه وسلم، فَقُلْتُ‏:‏ يَا رَسُولَ اللهِ، كَيْفَ أَصْنَعُ فِي مَالِي‏؟‏ كَيْفَ أَقْضِي فِي مَالِي‏؟‏ فَلَمْ يُجِبْنِي بِشَيْءٍ حَتَّى نَزَلَتْ آيَةُ الْمِيرَاثِ‏.‏","english":{"narrator":"","text":"Jabir ibn 'Abdullah said, \"I was ill, and the Prophet, may Allah\nbless him and grant him peace, came with Abu Bakr to visit me. They came\non foot. They found that I had fainted, so the Prophet, may Allah bless\nhim and grant him peace, did wudu' and then poured his wudu' water on me.\nI came to and the Prophet, may Allah bless him and grant him peace, was\nthere. I asked, 'Messenger of Allah, what should I do with my property?\nGive me a judgement regarding my property.' He did not give me any answer\nuntil the ayat of inheritance was revealed.\""}},{"id":22,"idInBook":22,"chapterId":29,"bookId":15,"arabic":"حَدَّثَنَا حَجَّاجٌ، قَالَ‏:‏ حَدَّثَنَا حَمَّادٌ، عَنْ عَاصِمٍ الأَحْوَلِ، عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ، عَنْ أُسَامَةَ بْنِ زَيْدٍ، أَنَّ صَبِيًّا لاَبْنَةِ رَسُولِ اللهِ صلى الله عليه وسلم ثَقُلَ، فَبَعَثَتْ أُمُّهُ إِلَى النَّبِيِّ صلى الله عليه وسلم، أَنَّ وَلَدِي فِي الْمَوْتِ، فَقَالَ لِلرَّسُولِ‏:‏ اذْهَبْ فَقُلْ لَهَا‏:‏ إِنَّ لِلَّهِ مَا أَخَذَ، وَلَهُ مَا أَعْطَى، وَكُلُّ شَيْءٍ عِنْدَهُ إِلَى أَجْلٍ مُسَمًّى، فَلْتَصْبِرْ وَلْتَحْتَسِبْ، فَرَجَعَ الرَّسُولُ فَأَخْبَرَهَا، فَبَعَثَتْ إِلَيْهِ تُقْسِمُ عَلَيْهِ لَمَا جَاءَ، فَقَامَ النَّبِيُّ صلى الله عليه وسلم فِي نَفَرٍ مِنْ أَصْحَابِهِ، مِنْهُمْ‏:‏ سَعْدُ بْنُ عُبَادَةَ، فَأَخَذَ النَّبِيُّ صلى الله عليه وسلم الصَّبِيَّ فَوَضَعَهُ بَيْنَ ثَنْدُوَتَيْهِ، وَلِصَدْرِهِ قَعْقَعَةٌ كَقَعْقَعَةِ الشَّنَّةِ، فَدَمَعَتْ عَيْنَا رَسُولِ اللهِ صلى الله عليه وسلم، فَقَالَ سَعْدٌ‏:‏ أَتَبْكِي وَأَنْتَ رَسُولُ اللهِ‏؟‏ فَقَالَ‏:‏ إِنَّمَا أَبْكِي رَحْمَةً لَهَا، إِنَّ اللَّهَ لاَ يَرْحَمُ مِنْ عِبَادِهِ إِلاَّ الرُّحَمَاءَ‏.‏","english":{"narrator":"","text":"Usama ibn Zayd reported that a child of one of the daughters of\nthe Messenger of Allah, may Allah bless him and grant him peace, was very\nill. His mother sent word to the Prophet, may Allah bless him and grant\nhim peace, to say that her child was dying. He told the messenger, \"Go\nand tell her that to Allah belongs what He takes and what He gives. Everything\nis with Him until a stated term. She should be patient and leave him to\nAllah.\" The messenger went back and told her. She sent to him again to\nplead with him to come. The Prophet, may Allah bless him and grant him\npeace, got up with a group of his Companions, including Sa'd ibn 'Ubada.\nThe Prophet, may Allah bless him and grant him peace, took the child and\nput him on his breast. The child was shaking like a leaf against his chest.\nThe Messenger of Allah, may Allah bless him and grant him peace, wept and\nSa'd said, \"Do you weep, Messenger of Allah?\" He replied, \"I weep out of\ncompassion for the child. Allah only shows mercy to those of His slaves\nwho are merciful.\""}},{"id":23,"idInBook":23,"chapterId":29,"bookId":15,"arabic":"حَدَّثَنَا الْحَسَنُ بْنُ وَاقِعٍ، قَالَ‏:‏ حَدَّثَنَا ضَمْرَةُ، عَنْ إِبْرَاهِيمَ بْنِ أَبِي عَبْلَةَ قَالَ‏:‏ مَرِضَتِ امْرَأَتِي، فَكُنْتُ أَجِيءُ إِلَى أُمِّ الدَّرْدَاءِ فَتَقُولُ لِي‏:‏ كَيْفَ أَهْلُكَ‏؟‏ فَأَقُولُ لَهَا‏:‏ مَرْضَى، فَتَدْعُو لِي بِطَعَامٍ، فَآكُلُ، ثُمَّ عُدْتُ فَفَعَلَتْ ذَلِكَ، فَجِئْتُهَا مَرَّةً فَقَالَتْ‏:‏ كَيْفَ‏؟‏ قُلْتُ‏:‏ قَدْ تَمَاثَلُوا، فَقَالَتْ‏:‏ إِنَّمَا كُنْتُ أَدْعُو لَكَ بِطَعَامٍ أَنْ كُنْتَ تُخْبِرُنَا عَنْ أَهْلِكَ أَنَّهُمْ مَرْضَى، فَأَمَّا أَنْ تَمَاثَلُوا فَلاَ نَدْعُو لَكَ بِشَيْءٍ‏.‏","english":{"narrator":"","text":"Ibrahim ibn Abi 'Abla said, \"My wife was ill and I used to go to\nUmm ad-Darda'. She asked me, 'How's your family?' 'Ill,' I replied. She\ncalled for some food for me and I ate. Then I went back and she did the\nsame thing again. I visited her yet again and she asked, 'How are they?'\n'They are almost well,' I replied. She said, 'I called for good for you\nwhen you told me that your family were ill. Since they are almost well\nknow, we will not call for anything for you.'\""}},{"id":24,"idInBook":24,"chapterId":29,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ، قَالَ‏:‏ حَدَّثَنَا خَالِدٌ الْحَذَّاءُ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم دَخَلَ عَلَى أَعْرَابِيٍّ يَعُودُهُ، فَقَالَ‏:‏ لاَ بَأْسَ عَلَيْكَ، طَهُورٌ إِنْ شَاءَ اللَّهُ، قَالَ‏:‏ قَالَ الأعْرَابِيُّ‏:‏ بَلْ هِيَ حُمَّى تَفُورُ، عَلَى شَيْخٍ كَبِيرٍ، كَيْمَا تُزِيرُهُ الْقُبُورَ، قَالَ‏:‏ فَنَعَمْ إِذًا‏.‏","english":{"narrator":"","text":"Ibn 'Abbas reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, went to visit a bedouin when he was ill and said,\n\"Do not worry. It is a purification if Allah so wills.\" He said that the\nbedouin said, \"It is a fever which boils in an old man and will cause him\nto visit the graves.\" \"It is a blessing then,\" he concluded."}},{"id":25,"idInBook":25,"chapterId":29,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْعَزِيزِ، قَالَ‏:‏ حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ، قَالَ‏:‏ حَدَّثَنَا يَزِيدُ بْنُ كَيْسَانَ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ مَنْ أَصْبَحَ الْيَوْمَ مِنْكُمْ صَائِمًا‏؟‏ قَالَ أَبُو بَكْرٍ‏:‏ أَنَا، قَالَ‏:‏ مَنْ عَادَ مِنْكُمُ الْيَوْمَ مَرِيضًا‏؟‏ قَالَ أَبُو بَكْرٍ‏:‏ أَنَا، قَالَ‏:‏ مَنْ شَهِدَ مِنْكُمُ الْيَوْمَ جَنَازَةً‏؟‏ قَالَ أَبُو بَكْرٍ‏:‏ أَنَا، قَالَ‏:‏ مَنْ أَطْعَمَ الْيَوْمَ مِسْكِينًا‏؟‏ قَالَ أَبُو بَكْرٍ‏:‏ أَنَا‏.‏\nقَالَ مَرْوَانُ‏:‏ بَلَغَنِي أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ‏:‏ مَا اجْتَمَعَ هَذِهِ الْخِصَالُ فِي رَجُلٍ فِي يَوْمٍ، إِلاَّ دَخَلَ الْجَنَّةَ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, asked, \"Which of you is fasting today?\" Abu Bakr\nsaid, \"I am.\" He asked, \"Which of you has visited a sick person today?\n\"I have,\" Abu Bakr stated. Then he asked, \"Who has attended a funeral today?\"\n\"I have,\" Abu Bakr said. He asked, \"Who has fed a poor person today?\" Abu\nBakr said, \"I have.\""}},{"id":26,"idInBook":26,"chapterId":29,"bookId":15,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ أَيُّوبَ، قَالَ‏:‏ حَدَّثَنَا شَبَابَةُ قَالَ‏:‏ حَدَّثَنِي الْمُغِيرَةُ بْنُ مُسْلِمٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ قَالَ‏:‏ دَخَلَ النَّبِيُّ صلى الله عليه وسلم عَلَى أُمِّ السَّائِبِ، وَهِيَ تُزَفْزِفُ، فَقَالَ‏:‏ مَا لَكِ‏؟‏ قَالَتِ‏:‏ الْحُمَّى أَخْزَاهَا اللَّهُ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ مَهْ، لاَ تَسُبِّيهَا، فَإِنَّهَا تُذْهِبُ خَطَايَا الْمُؤْمِنِ، كَمَا يُذْهِبُ الْكِيرُ خَبَثَ الْحَدِيدِ‏.‏","english":{"narrator":"","text":"Jabir said, \"The Prophet, may Allah bless him and grant him peace,\nvisited Umm as-Sa'ib while she was sighing. He asked, 'What is wrong with\nyou?' 'The fever,' she replied, \"May Allah debase it!' The Prophet, may\nAllah bless him and grant him peace, said, 'Gently! Do not curse it. It\nremoves the errors of the believer as the bellows remove the dross of iron.'\""}},{"id":27,"idInBook":27,"chapterId":29,"bookId":15,"arabic":"حَدَّثَنَا إِسْحَاقُ، قَالَ‏:‏ أَخْبَرَنَا النَّضْرُ بْنُ شُمَيْلٍ، قَالَ‏:‏ أَخْبَرَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ الْبُنَانِيِّ، عَنْ أَبِي رَافِعٍ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللهِ صلى الله عليه وسلم قَالَ‏:‏ يَقُولُ اللَّهُ‏:‏ اسْتَطْعَمْتُكَ فَلَمْ تُطْعِمَنِي، قَالَ‏:‏ فَيَقُولُ‏:‏ يَا رَبِّ، وَكَيْفَ اسْتَطْعَمْتَنِي وَلَمْ أُطْعِمْكَ، وَأَنْتَ رَبُّ الْعَالَمِينَ‏؟‏ قَالَ‏:‏ أَمَا عَلِمْتَ أَنَّ عَبْدِي فُلاَنًا اسْتَطْعَمَكَ فَلَمْ تُطْعِمْهُ‏؟‏ أَمَا عَلِمْتَ أَنَّكَ لَوْ كُنْتَ أَطْعَمْتَهُ لَوَجَدْتَ ذَلِكَ عِنْدِي‏؟‏ ابْنَ آدَمَ، اسْتَسْقَيْتُكَ فَلَمْ تَسْقِنِي، فَقَالَ‏:‏ يَا رَبِّ، وَكَيْفَ أَسْقِيكَ وَأَنْتَ رَبُّ الْعَالَمِينَ‏؟‏ فَيَقُولُ‏:‏ إِنَّ عَبْدِي فُلاَنًا اسْتَسْقَاكَ فَلَمْ تَسْقِهِ، أَمَا عَلِمْتَ أَنَّكَ لَوْ كُنْتَ سَقَيْتَهُ لَوَجَدْتَ ذَلِكَ عِنْدِي‏؟‏ يَا ابْنَ آدَمَ، مَرِضْتُ فَلَمْ تَعُدْنِي، قَالَ‏:‏ يَا رَبِّ، كَيْفَ أَعُودُكَ، وَأَنْتَ رَبُّ الْعَالَمِينَ‏؟‏ قَالَ‏:‏ أَمَا عَلِمْتَ أَنَّ عَبْدِي فُلاَنًا مَرِضَ، فَلَوْ كُنْتَ عُدْتَهُ لَوَجَدْتَ ذَلِكَ عِنْدِي‏؟‏ أَوْ وَجَدْتَنِي عِنْدَهُ‏؟‏‏.‏","english":{"narrator":"Abu Hurayra reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"Allah says:","text":"'I asked you for food and you\ndid not feed Me. He (His slave) will say, 'Lord, how could I feed You when\nYou did not ask me for food and You are the Lord of the universe?' He will\nsay, 'Do you not know that My slave so-and-so asked you for food and you\ndid not feed him? Do you not know that if you had fed him, you would have\nfound that action with Me? Son of Adam, I asked you for water and you did\nnot give Me water.' The slave will reply, 'O Lord, how could I give you\nwater when You are the Lord of the universe?' He will say, 'My slave so-and-so\nasked you for water and you did not give him water. Do you not know that\nif you had given him water, you would have found that action with Me? Son\nof Adam, I was ill and you did not visit Me.' He will say, 'O Lord, how\ncould I visit You when You are the Lord of the universe?' He will say,\n'Do you not know that My slave so-and-so was ill. If you had visited him\nyou would have found that action with Me (or you would have found Me with\nhim).\""}},{"id":28,"idInBook":28,"chapterId":29,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ‏:‏ حَدَّثَنَا أَبَانُ بْنُ يَزِيدَ، قَالَ‏:‏ حَدَّثَنَا قَتَادَةُ قَالَ‏:‏ حَدَّثَنِي أَبُو عِيسَى الأُسْوَارِيُّ، عَنْ أَبِي سَعِيدٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ عُودُوا الْمَرِيضَ، وَاتَّبَعُوا الْجَنَائِزَ، تُذَكِّرُكُمُ الآخِرَةَ‏.‏","english":{"narrator":"","text":"Abu Sa'id reported that the Prophet, may Allah bless him and grant\nhim peace, said, \"Visit the sick. Follow funeral processions. Remind yourselves\nof the Next World.\""}},{"id":29,"idInBook":29,"chapterId":29,"bookId":15,"arabic":"حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيلَ، قَالَ‏:‏ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عُمَرَ بْنِ أَبِي سَلَمَةَ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ ثَلاَثٌ كُلُّهُنَّ حَقٌّ عَلَى كُلِّ مُسْلِمٍ‏:‏ عِيَادَةُ الْمَرِيضِ، وَشُهُودُ الْجَنَازَةِ، وَتَشْمِيتُ الْعَاطِسِ إِذَا حَمِدَ اللَّهَ عَزَّ وَجَلَّ‏.‏","english":{"narrator":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"There are three things which are all a duty for\nevery Muslim:","text":"to visit the sick, to attend funerals, and to say, 'may Allah\nhave mercy on you' when someone sneezes if he praises Allah Almighty.\""}},{"id":30,"idInBook":30,"chapterId":29,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْوَهَّابِ، قَالَ‏:‏ حَدَّثَنَا أَيُّوبُ، عَنْ عَمْرِو بْنِ سَعِيدٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ قَالَ‏:‏ حَدَّثَنِي ثَلاَثَةٌ مِنْ بَنِي سَعْدٍ كُلُّهُمْ يُحَدِّثُ عَنْ أَبِيهِ أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم دَخَلَ عَلَى سَعْدٍ يَعُودُهُ بِمَكَّةَ، فَبَكَى، فَقَالَ‏:‏ مَا يُبْكِيكَ‏؟‏، قَالَ‏:‏ خَشِيتُ أَنْ أَمُوتَ بِالأَرْضِ الَّتِي هَاجَرْتُ مِنْهَا كَمَا مَاتَ سَعْدٌ، قَالَ‏:‏ اللَّهُمَّ اشْفِ سَعْدًا ثَلاَثًا، فَقَالَ‏:‏ لِي مَالٌ كَثِيرٌ، يَرِثُنِي ابْنَتَيْ، أَفَأُوصِي بِمَالِي كُلِّهِ‏؟‏ قَالَ‏:‏ لاَ، قَالَ‏:‏ فَبِالثُّلُثَيْنِ‏؟‏ قَالَ‏:‏ لاَ، قَالَ‏:‏ فَالنِّصْفُ‏؟‏ قَالَ‏:‏ لاَ، قَالَ‏:‏ فَالثُّلُثُ‏؟‏ قَالَ‏:‏ \"الثُّلُثُ، وَالثُّلُثُ كَثِيرٌ، إِنَّ صَدَقَتَكَ مِنْ مَالِكَ صَدَقَةٌ، وَنَفَقَتَكَ عَلَى عِيَالِكَ صَدَقَةٌ، وَمَا تَأْكُلُ امْرَأَتُكَ مِنْ طَعَامِكَ لَكَ صَدَقَةٌ، وَإِنَّكَ أَنْ تَدَعَ أَهْلَكَ بِخَيْرٍ\"، أَوْ قَالَ‏:‏ \"بِعَيْشٍ، خَيْرٌ مِنْ أَنْ تَدَعَهُمْ يَتَكَفَّفُونَ النَّاسَ\"، وَقَالَ بِيَدِهِ‏.‏","english":{"narrator":"","text":"Three of the Banu Sa'd related from their father that the Messenger\nof Allah, may Allah bless him and grant him peace, visited Sa'd (ibn Abi\nWaqqas) in Makka and Sa'd wept. He asked, \"Why are your weeping?\" Sa'd\nreplied, \"I fear that I will die in the land from which I have emigrated\nas Sa'd (ibn Khawla) died.\" The Prophet said, \"O Allah, heal Sa'd!\" three\ntimes. Sa'd said, \"I have a lot of property which my daughter will inherit.\nShall I will all of it away?\" \"No,\" he replied. Sa'd asked, \"Two-thirds?\"\n\"No,\" he replied. \"A half then?\" Sa'd asked. \"No,\" he answered. Sa'd asked,\n\"A third?\" \"A third,\" he said, \"but a third is a lot. What you give as\nsadaqa from your property is sadaqa. What you spend on your family is sadaqa.\nWhat your wife eats of your food is sadaqa for you. It is better for you\nto leave your family in a state of plenty (or he said \"livelihood\") than\nto leave them where they have to importune people.\""}},{"id":31,"idInBook":31,"chapterId":29,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْوَاحِدِ، قَالَ‏:‏ حَدَّثَنَا عَاصِمٌ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَبِي الأَشْعَثِ الصَّنْعَانِيِّ، عَنْ أَبِي أَسْمَاءَ قَالَ‏:‏ مَنْ عَادَ أَخَاهُ كَانَ فِي خُرْفَةِ الْجَنَّةِ، قُلْتُ لأَبِي قِلاَبَةَ‏:‏ مَا خُرْفَةُ الْجَنَّةِ‏؟‏ قَالَ‏:‏ جَنَاهَا، قُلْتُ لأَبِي قِلاَبَةَ‏:‏ عَنْ مَنْ حَدَّثَهُ أَبُو أَسْمَاءَ‏؟‏ قَالَ‏:‏ عَنْ ثَوْبَانَ، عَنْ رَسُولِ اللهِ صلى الله عليه وسلم‏ نحوه.","english":{"narrator":"","text":"Abu Qilaba reported from Abu'l-Ash'ath as-San'ani that Abu Asma'\nsaid, \"Whoever visits his brother is in a tent of the Garden.\" I (the transmitter)\nasked Abu Qilaba, \"What is the tent of the Garden?\" \"Its fruits,\" he replied.\nI said to Abu Qilaba, \"From whom did Asma' transmit?\" \"From Thawban from\nthe Messenger of Allah, may Allah bless him and grant him peace,\" he replied."}},{"id":32,"idInBook":32,"chapterId":29,"bookId":15,"arabic":"حَدَّثَنَا قَيْسُ بْنُ حَفْصٍ، قَالَ‏:‏ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ قَالَ‏:‏ أَخْبَرَنِي أَبِي، أَنَّ أَبَا بَكْرِ بْنَ حَزْمٍ، وَمُحَمَّدُ بْنُ الْمُنْكَدِرِ، فِي نَاسٍ مِنْ أَهْلِ الْمَسْجِدِ، عَادُوا عُمَرَ بْنَ الْحَكَمِ بْنِ رَافِعٍ الأَنْصَارِيَّ، قَالُوا‏:‏ يَا أَبَا حَفْصٍ، حَدِّثْنَا، قَالَ‏:‏ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللهِ قَالَ‏:‏ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ‏:‏ مَنْ عَادَ مَرِيضًا خَاضَ فِي الرَّحْمَةِ، حَتَّى إِذَا قَعَدَ اسْتَقَرَّ فِيهَا‏.‏","english":{"narrator":"","text":"Abu Bakr ibn Hazm and Muhammad ibn al-Munkadir were some people\nfrom the mosque who visited 'Umar ibn al-Hakam ibn Rafi' al-Ansari. They\nsaid, \"Abu Hafs! Relate to us!\" He said, \"I heard 'Abdullah say that he\nheard the Prophet, may Allah bless him and grant him peace, say, \"When\nsomeone visits a sick person, he dives into mercy to such an extent that\nwhen he sits with him, he settles in it.\""}},{"id":33,"idInBook":33,"chapterId":29,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ عَطَاءٍ قَالَ‏:‏ عَادَ ابْنُ عُمَرَ ابْنَ صَفْوَانَ، فَحَضَرَتِ الصَّلاَةُ، فَصَلَّى بِهِمُ ابْنُ عُمَرَ رَكْعَتَيْنِ، وَقَالَ‏:‏ إِنَّا سَفْرٌ‏.‏","english":{"narrator":"","text":"'Ata' said, \"Ibn 'Umar visited Ibn Safwan and the time came for\nthe prayer. So Ibn 'Umar prayed two rak'ats with them and then observed,\n'I am travelling.'\""}},{"id":34,"idInBook":34,"chapterId":29,"bookId":15,"arabic":"حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، قَالَ‏:‏ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، أَنَّ غُلاَمًا مِنَ الْيَهُودِ كَانَ يَخْدُمُ النَّبِيَّ صلى الله عليه وسلم فَمَرِضَ، فَأَتَاهُ النَّبِيُّ صلى الله عليه وسلم يَعُودُهُ، فَقَعَدَ عِنْدَ رَأْسِهِ فَقَالَ‏:‏ أَسْلِمْ، فَنَظَرَ إِلَى أَبِيهِ، وَهُوَ عِنْدَ رَأْسِهِ، فَقَالَ لَهُ‏:‏ أَطِعْ أَبَا الْقَاسِمِ صلى الله عليه وسلم، فَأَسْلَمَ، فَخَرَجَ النَّبِيُّ صلى الله عليه وسلم وَهُوَ يَقُولُ‏:‏ الْحَمْدُ لِلَّهِ الَّذِي أَنْقَذَهُ مِنَ النَّارِ‏.‏","english":{"narrator":"","text":"Anas reported that a Jewish boy used to serve the Prophet, may\nAllah bless him and grant him peace. The boy became ill and the Prophet,\nmay Allah bless him and grant him peace, went to visit him. He sat by his\nhead and said, \"Become a Muslim.\" The boy looked at his father who was\nalso sitting by his head. His father said to him, \"Obey Abu'l-Qasim (may\nAllah bless him and grant him peace).\" So the boy became a Muslim. The\nProphet, may Allah bless him and grant him peace, left saying, \"Praise\nbe to Allah who has saved him from the Fire!\""}},{"id":35,"idInBook":35,"chapterId":29,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ قَالَ‏:‏ حَدَّثَنِي مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ أَنَّهَا قَالَتْ‏:‏ لَمَّا قَدِمَ رَسُولُ اللهِ صلى الله عليه وسلم الْمَدِينَةَ وُعِكَ أَبُو بَكْرٍ وَبِلاَلٌ، قَالَتْ‏:‏ فَدَخَلْتُ عَلَيْهِمَا، قُلْتُ‏:‏ يَا أَبَتَاهُ، كَيْفَ تَجِدُكَ‏؟‏ وَيَا بِلاَلُ، كَيْفَ تَجِدُكَ‏؟‏ قَالَ‏:‏ وَكَانَ أَبُو بَكْرٍ إِذَا أَخَذَتْهُ الْحُمَّى يَقُولُ‏:‏كُلُّ امْرِئٍ مُصَبَّحٌ في أهْلِهِ... والمَوْتُ أدْنَى مِن شِرَاكِ نَعْلِهِ وَكانَ بلَالٌ إذَا أُقْلِعَ عنْه يَرْفَعُ عَقِيرَتَهُ فيَقولُ: أَلَا لَيْتَ شِعْرِي هلْ أبِيتَنَّ لَيْلَةً... بوَادٍ وحَوْلِي إذْخِرٌ وجَلِيلُوَهلْ أرِدَنْ يَوْمًا مِيَاهَ مِجَنَّةٍ... وهلْ تَبْدُوَنْ لي شَامَةٌ وطَفِيلُ قَالَ: قَالَتْ عَائِشَةُ: فَجِئْتُ رَسولَ اللَّهِ صَلَّى اللهُ عليه وسلَّمَ فأخْبَرْتُهُ، فَقَالَ: اللَّهُمَّ حَبِّبْ إلَيْنَا المَدِينَةَ كَحُبِّنَا مَكَّةَ أوْ أشَدَّ، وصَحِّحْهَا، وبَارِكْ لَنَا في صَاعِهَا ومُدِّهَا، وانْقُلْ حُمَّاهَا فَاجْعَلْهَا بالجُحْفَةِ.","english":{"narrator":"'A'isha (ra) said, \"When the Messenger of Allah, may Allah bless him and grant him peace, came to Madina, Abu Bakr (ra) and Bilal (ra) came down with a fever. I visited them and asked, 'Father, how are you? Bilal, how are you?' When Abu Bakr's (ra) fever worsened, he said:","text":"\"Every body is given the prayer to arise healthy among his people, yet death is nearer to him than his shoe-laces.\" And whenever Bilal’s (ra) fever subsided, he would recite, \"Would that I know that I will ever spend a night in a valley surrounded by Izkhir and Jaleel (two kinds of sweet smelling grass). And that I will arrive one day to the waters of Majannah and observe (the mountains) Shamah and Tafeel\" Ayshah (ra) went to the Prophet M, and informed him of what transpired with these two men. Thereupon, he made this supplication: \"O Allah, make us love Madinah as dearly as we love Makkah, or more than that. O Allah! Make it healthy for us and bless for us it sa' and mudd. And remove its fever putting it in al-Juhfah\""}},{"id":36,"idInBook":36,"chapterId":29,"bookId":15,"arabic":"حَدَّثَنَا مُعَلَّى، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ الْمُخْتَارِ، قَالَ‏:‏ حَدَّثَنَا خَالِدٌ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم دَخَلَ عَلَى أَعْرَابِيٍّ يَعُودُهُ، قَالَ‏:‏ وَكَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا دَخَلَ عَلَى مَرِيضٍ يَعُودُهُ قَالَ‏:‏ لاَ بَأْسَ طَهُورٌ إِنْ شَاءَ اللَّهُ، قَالَ‏:‏ ذَاكَ طَهُورٌ، كَلاَّ بَلْ هِيَ حُمَّى تَفُورُ، أَوْ تَثُورُ، عَلَى شَيْخٍ كَبِيرٍ، تُزِيرُهُ الْقُبُورَ، قَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ فَنَعَمْ إِذًا‏.‏","english":{"narrator":"","text":"Ibn 'Abbas reported that the Prophet, may Allah bless him and grant\nhim peace, went to visit a bedouin who was ill. When the Prophet, may Allah\nbless him and grant him peace, visited someone who was ill, he would say,\n'There is no harm in it. It is a purification, Allah willing.\" That man\nthen said, \"A purification! No, rather it is a fever which boils (or appears)\nin an old man and will cause him to visit the graces.\" The Prophet, may\nAllah bless him and grant him peace, said, \"Then yes (it is)\"."}},{"id":37,"idInBook":37,"chapterId":29,"bookId":15,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ عِيسَى، قَالَ‏:‏ حَدَّثَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، عَنْ حَرْمَلَةَ، عَنْ مُحَمَّدِ بْنِ عَلِيٍّ الْقُرَشِيِّ، عَنْ نَافِعٍ قَالَ‏:‏ كَانَ ابْنُ عُمَرَ إِذَا دَخَلَ عَلَى مَرِيضٍ يَسْأَلُهُ‏:‏ كَيْفَ هُوَ‏؟‏ فَإِذَا قَامَ مِنْ عِنْدِهِ قَالَ‏:‏ خَارَ اللَّهُ لَكَ، وَلَمْ يَزِدْهُ عَلَيْهِ‏.‏","english":{"narrator":"","text":"Nafi' reported that when Ibn 'Umar visited someone who was ill,\nhe would ask him how he was. When he left him, he would say, \"May Allah\nchoose what is best for you.\" He did not say more than that."}},{"id":38,"idInBook":38,"chapterId":29,"bookId":15,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ يَعْقُوبَ، قَالَ‏:‏ حَدَّثَنَا إِسْحَاقُ بْنُ سَعِيدِ بْنِ عَمْرِو بْنِ سَعِيدٍ، عَنْ أَبِيهِ قَالَ‏:‏ دَخَلَ الْحَجَّاجُ عَلَى ابْنِ عُمَرَ، وَأَنَا عِنْدَهُ، فَقَالَ‏:‏ كَيْفَ هُوَ‏؟‏ قَالَ‏:‏ صَالِحٌ، قَالَ‏:‏ مَنْ أَصَابَكَ‏؟‏ قَالَ‏:‏ أَصَابَنِي مَنْ أَمَرَ بِحَمْلِ السِّلاَحِ فِي يَوْمٍ لاَ يَحِلُّ فِيهِ حَمْلُهُ، يَعْنِي‏:‏ الْحَجَّاجَ‏.‏","english":{"narrator":"","text":"'Amr ibn Sa'id said, \"Al-Hajjaj visited Ibn 'Umar while I was with\nhim, He asked, 'How are you?' 'Sound,' he replied. He asked, 'What is wrong\nwith you?' He replied, \"I have been afflicted by the business of carrying\narms on a day when it is not lawful to carry them.' He was referring to\nal-Hajjaj.*\""}},{"id":39,"idInBook":39,"chapterId":29,"bookId":15,"arabic":"حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، قَالَ‏:‏ أَخْبَرَنَا بَكْرُ بْنُ مُضَرَ قَالَ‏:‏ حَدَّثَنِي عُبَيْدُ اللهِ بْنُ زَحْرٍ، عَنْ حِبَّانَ بْنِ أَبِي جَبَلَةَ، عَنْ عَبْدِ اللهِ بْنِ عَمْرِو بْنِ الْعَاصِ قَالَ‏:‏ لاَ تَعُودُوا شُرَّابَ الْخَمْرِ إِذَا مَرِضُوا‏.‏","english":{"narrator":"","text":"'Abdullah ibn 'Amr ibn al-'As said, \"Do not visit wine-drinkers\nwhen they are ill.\""}},{"id":40,"idInBook":40,"chapterId":29,"bookId":15,"arabic":"حَدَّثَنَا زَكَرِيَّا بْنُ يَحْيَى، قَالَ‏:‏ حَدَّثَنَا الْحَكَمُ بْنُ الْمُبَارَكِ قَالَ‏:‏ أَخْبَرَنِي الْوَلِيدُ هُوَ ابْنُ مُسْلِمٍ، قَالَ‏:‏ حَدَّثَنَا الْحَارِثُ بْنُ عُبَيْدِ اللهِ الأَنْصَارِيُّ قَالَ‏:‏ رَأَيْتُ أُمَّ الدَّرْدَاءِ، عَلَى رِحَالِهَا أَعْوَادٌ لَيْسَ عَلَيْهَا غِشَاءٌ، عَائِدَةً لِرَجُلٍ مِنْ أَهْلِ الْمَسْجِدِ مِنَ الأَنْصَارِ‏.‏","english":{"narrator":"","text":"Al-Harith ibn 'Abdullah al-Ansari said, \"I saw Umm ad-Darda' going to visit (a sick) Ansari man from the mosque and she was on her mount in an uncovered howdah.\""}},{"id":41,"idInBook":41,"chapterId":29,"bookId":15,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ‏:‏ أَخْبَرَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنِ الأَجْلَحِ، عَنْ عَبْدِ اللهِ بْنِ أَبِي الْهُذَيْلِ قَالَ‏:‏ دَخَلَ عَبْدُ اللهِ بْنُ مَسْعُودٍ عَلَى مَرِيضٍ يَعُودُهُ، وَمَعَهُ قَوْمٌ، وَفِي الْبَيْتِ امْرَأَةٌ، فَجَعَلَ رَجُلٌ مِنَ الْقَوْمِ يَنْظُرُ إِلَى الْمَرْأَةِ، فَقَالَ لَهُ عَبْدُ اللهِ‏:‏ لَوْ انْفَقَأَتْ عَيْنُكَ كَانَ خَيْرًا لَكَ‏.‏","english":{"narrator":"","text":"'Abdullah ibn Abi'l-Hudhayl said, \"'Abdullah ibn Mas'ud went to\nvisit a sick person with some other people. There was a woman in the room\nand one of the men began to look at her, 'Abdullah said to him, 'It would\nhave been better for you if your eyes had been gouged out.'\""}},{"id":42,"idInBook":42,"chapterId":29,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ الْمُبَارَكِ، قَالَ‏:‏ حَدَّثَنَا سَلْمُ بْنُ قُتَيْبَةَ، قَالَ‏:‏ حَدَّثَنَا يُونُسُ بْنُ أَبِي إِسْحَاقَ، عَنْ أَبِي إِسْحَاقَ قَالَ‏:‏ سَمِعْتُ زَيْدَ بْنَ أَرْقَمَ يَقُولُ‏:‏ رَمِدَتْ عَيْنِي، فَعَادَنِي النَّبِيُّ صلى الله عليه وسلم ثُمَّ قَالَ‏:‏ يَا زَيْدُ، لَوْ أَنَّ عَيْنَكَ لَمَّا بِهَا كَيْفَ كُنْتَ تَصْنَعُ‏؟‏ قَالَ‏:‏ كُنْتُ أَصْبِرُ وَأَحْتَسِبُ، قَالَ‏:‏ لَوْ أَنَّ عَيْنَكَ لَمَّا بِهَا، ثُمَّ صَبَرْتَ وَاحْتَسَبْتَ كَانَ ثَوَابُكَ الْجَنَّةَ‏.‏","english":{"narrator":"","text":"Zayd ibn Arqam said, \"I had a pain in my eyes and the Prophet,\nmay Allah bless him and grant him peace, visited me and said, 'Zayd, if\ntour eyes were to go blind because of their illness, what would you do?'\nHe said, 'I would be steadfast and reckon my reward to be with Allah.'\nHe said, 'If that happens to your eyes and you are steadfast and reckon\nyour reward to be with Allah, then your reward will be the Garden.'\""}},{"id":43,"idInBook":43,"chapterId":29,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى، قَالَ‏:‏ حَدَّثَنَا حَمَّادٌ، عَنْ عَلِيِّ بْنِ زَيْدٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، أَنَّ رَجُلاً مِنْ أَصْحَابِ مُحَمَّدٍ ذَهَبَ بَصَرُهُ، فَعَادُوهُ، فَقَالَ‏:‏ كُنْتُ أُرِيدُهُمَا لَأَنْظُرَ إِلَى النَّبِيِّ صلى الله عليه وسلم، فَأَمَّا إِذْ قُبِضَ النَّبِيُّ صلى الله عليه وسلم فَوَاللَّهِ مَا يَسُرُّنِي أَنَّ مَا بِهِمَا بِظَبْيٍ مِنْ ظِبَاءِ تَبَالَةَ‏.‏","english":{"narrator":"","text":"Al-Qasim ibn Muhammad reported that one of the Companions of Muhammad\nlost his eyesight and people visited him. He said, \"I used to look at the\nProphet, may Allah bless him and grant him peace, but now that the Prophet,\nmay Allah bless him and grant him peace, has died, by Allah, what has happened\nto\nmy eyes is as easy for me to bear as one of the gazelles of Tibala (in\nYemen).\""}},{"id":44,"idInBook":44,"chapterId":29,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ صَالِحٍ، وَابْنُ يُوسُفَ، قَالاَ‏:‏ حَدَّثَنَا اللَّيْثُ قَالَ‏:‏ حَدَّثَنِي يَزِيدُ بْنُ الْهَادِ، عَنْ عَمْرٍو مَوْلَى الْمُطَّلِبِ، عَنْ أَنَسٍ قَالَ‏:‏ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ‏:‏ قَالَ اللَّهُ عَزَّ وَجَلَّ‏:‏ إِذَا ابْتَلَيْتُهُ بِحَبِيبَتَيْهِ، يُرِيدُ عَيْنَيْهِ، ثُمَّ صَبَرَ عَوَّضْتُهُ الْجَنَّةَ‏.‏","english":{"narrator":"","text":"Anas said, \"I heard the Prophet, may Allah bless him and grant\nhim peace, say that Allah Almighty said, 'When I test him in his two precious\nones (i.e. his eyes) and he is steadfast, I will repay him with the Garden.'\""}},{"id":45,"idInBook":45,"chapterId":29,"bookId":15,"arabic":"حَدَّثَنَا خَطَّابٌ، قَالَ‏:‏ حَدَّثَنَا إِسْمَاعِيلُ، عَنْ ثَابِتِ بْنِ عَجْلاَنَ، وَإِسْحَاقَ بْنِ يَزِيدَ، قَالاَ‏:‏ حَدَّثَنَا إِسْمَاعِيلُ قَالَ‏:‏ حَدَّثَنِي ثَابِتٌ، عَنِ الْقَاسِمِ، عَنْ أَبِي أُمَامَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم‏:‏ يَقُولُ اللَّهُ‏:‏ يَا ابْنَ آدَمَ، إِذَا أَخَذْتُ كَرِيمَتَيْكَ، فَصَبَرْتَ عِنْدَ الصَّدْمَةِ وَاحْتَسَبْتَ، لَمْ أَرْضَ لَكَ ثَوَابًا دُونَ الْجَنَّةِ‏.‏","english":{"narrator":"","text":"Abu Umama reported that the Prophet, may Allah bless him and grant\nhim peace, said, \"Allah says, 'O son of Adam, when I take what is precious\nfrom you and you are steadfast in the face of the blow and reckon that\nyour reward is with Allah, the only reward which I am content for you to\nhave is the Garden.\""}},{"id":46,"idInBook":46,"chapterId":29,"bookId":15,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ عِيسَى، قَالَ‏:‏ حَدَّثَنَا عَبْدُ اللهِ بْنُ وَهْبٍ قَالَ‏:‏ أَخْبَرَنِي عَمْرٌو، عَنْ عَبْدِ رَبِّهِ بْنِ سَعِيدٍ قَالَ‏:‏ حَدَّثَنِي الْمِنْهَالُ بْنُ عَمْرٍو، عَنْ عَبْدِ اللهِ بْنِ الْحَارِثِ، عَنِ ابْنِ عَبَّاسٍ قَالَ‏:‏ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا عَادَ الْمَرِيضَ جَلَسَ عِنْدَ رَأْسِهِ، ثُمَّ قَالَ سَبْعَ مِرَارٍ‏:‏ أَسْأَلُ اللَّهَ الْعَظِيمَ، رَبَّ الْعَرْشِ الْعَظِيمِ، أَنْ يَشْفِيكَ، فَإِنْ كَانَ فِي أَجَلِهِ تَأْخِيرٌ عُوفِيَ مِنْ وَجَعِهِ‏.‏","english":{"narrator":"","text":"Ibn 'Abbas said, \"When the Prophet, may Allah bless him and grant\nhim peace, visited a sick person, he would sit by his head and then say\nseven times, 'I ask Allah the Immense, the Lord of the Immense Throne,\nto cure you.' If the time of the invalid had not yet come, he would be\ncured of his pain.\""}},{"id":47,"idInBook":47,"chapterId":29,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى، قَالَ‏:‏ حَدَّثَنَا الرَّبِيعُ بْنُ عَبْدِ اللهِ قَالَ‏:‏ ذَهَبْتُ مَعَ الْحَسَنِ إِلَى قَتَادَةَ نَعُودُهُ، فَقَعَدَ عِنْدَ رَأْسِهِ، فَسَأَلَهُ ثُمَّ دَعَا لَهُ قَالَ‏:‏ اللَّهُمَّ اشْفِ قَلْبَهُ، وَاشْفِ سَقَمَهُ‏.‏","english":{"narrator":"","text":"Ar-Rabi' ibn al-Hasan said, \"I went with al-Hasan to visit Qatada.\nHe sat by his head and asked after him and made supplication for him. He\nsaid, 'O Allah, heal his heart and cure him of his illness!\""}}],"chapter":{"id":29,"bookId":15,"arabic":"كتاب عيادة المرضى","english":"Visiting the Ill"}}