{"metadata":{"length":2,"arabic":{"title":"الأدب المفرد","author":"الإمام محمد بن إسماعيل البخاري","introduction":"كتاب مَوَالِي"},"english":{"title":"Al-Adab Al-Mufrad","author":"Imam Muhammad ibn Ismail al-Bukhari","introduction":"Mawlas (Clients of Manumission)"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":3,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، قَالَ‏:‏ حَدَّثَنَا وَائِلُ بْنُ دَاوُدَ اللَّيْثِيُّ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي حَبِيبٍ قَالَ‏:‏ قَالَ لِي عَبْدُ اللهِ بْنُ عُمَرَ‏:‏ مِمَّنْ أَنْتَ‏؟‏ قُلْتُ‏:‏ مِنْ تَيْمِ تَمِيمٍ، قَالَ‏:‏ مِنْ أَنْفُسِهِمْ أَوْ مِنْ مَوَالِيهِمْ‏؟‏ قُلْتُ‏:‏ مِنْ مَوَالِيهِمْ، قَالَ‏:‏ فَهَلاَّ قُلْتَ‏:‏ مِنْ مَوَالِيهِمْ إِذًا‏؟‏‏.‏","english":{"narrator":"","text":"'Abdu'r-Rahman ibn Habib said, \"'Abdullah ibn 'Umar asked me, 'Which\nclan are you from?' I replied, 'From Taym of Tamim.' He asked, 'One of themselves\nor one of their mawlas?' 'One of their mawlas,' I replied. He said, 'So why\ndid you not say, 'One of their mawlas'?\""}},{"id":2,"idInBook":2,"chapterId":3,"bookId":15,"arabic":"حَدَّثَنَا عَمْرُو بْنُ خَالِدٍ، قَالَ‏:‏ حَدَّثَنَا زُهَيْرٌ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ اللهِ بْنُ عُثْمَانَ قَالَ‏:‏ أَخْبَرَنِي إِسْمَاعِيلُ بْنُ عُبَيْدٍ، عَنْ أَبِيهِ عُبَيْدٍ، عَنْ رِفَاعَةَ بْنِ رَافِعٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ لِعُمَرَ رَضِيَ اللَّهُ عَنْهُ‏:‏ اجْمَعْ لِي قَوْمَكَ، فَجَمَعَهُمْ، فَلَمَّا حَضَرُوا بَابَ النَّبِيِّ صلى الله عليه وسلم دَخَلَ عَلَيْهِ عُمَرُ فَقَالَ‏:‏ قَدْ جَمَعْتُ لَكَ قَوْمِي، فَسَمِعَ ذَلِكَ الأَنْصَارُ فَقَالُوا‏:‏ قَدْ نَزَلَ فِي قُرَيْشٍ الْوَحْيُ، فَجَاءَ الْمُسْتَمِعُ وَالنَّاظِرُ مَا يُقَالُ لَهُمْ، فَخَرَجَ النَّبِيُّ صلى الله عليه وسلم، فَقَامَ بَيْنَ أَظْهُرِهِمْ فَقَالَ‏:‏ هَلْ فِيكُمْ مِنْ غَيْرِكُمْ‏؟‏ قَالُوا‏:‏ نَعَمْ، فِينَا حَلِيفُنَا وَابْنُ أُخْتِنَا وَمَوَالِينَا، قَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ حَلِيفُنَا مِنَّا، وَابْنُ أُخْتِنَا مِنَّا، وَمَوَالِينَا مِنَّا، وَأَنْتُمْ تَسْمَعُونَ‏:‏ إِنَّ أَوْلِيَائِي مِنْكُمُ الْمُتَّقُونَ، فَإِنْ كُنْتُمْ أُولَئِكَ فَذَاكَ، وَإِلاَّ فَانْظُرُوا، لاَ يَأْتِي النَّاسُ بِالأَعْمَالِ يَوْمَ الْقِيَامَةِ، وَتَأْتُونَ بِالأَثْقَالِ، فَيُعْرَضَ عَنْكُمْ، ثُمَّ نَادَى فَقَالَ‏:‏ يَا أَيُّهَا النَّاسُ، وَرَفَعَ يَدَيْهِ يَضَعَهُمَا عَلَى رُءُوسِ قُرَيْشٍ، أَيُّهَا النَّاسُ، إِنَّ قُرَيْشًا أَهْلُ أَمَانَةٍ، مَنْ بَغَى بِهِمْ، قَالَ زُهَيْرٌ‏:‏ أَظُنُّهُ قَالَ‏:‏ الْعَوَاثِرَ، كَبَّهُ اللَّهُ لِمِنْخِرَيْهِ، يَقُولُ ذَلِكَ ثَلاَثَ مَرَّاتٍ‏.‏","english":{"narrator":"Rifa'a ibn Rafi' reported that the Prophet, may Allah bless him and grant\nhim peace, said to 'Umar, \"Gather your people  for me.\" He\ndid so. When they reached the door of the Prophet, may Allah bless him and\ngrant him peace, 'Umar came to him and said, \"I have gathered my people for\nyou.\" The Ansar heard that and said, \"Revelation has been revealed about\nQuraysh.\" People came to see and hear what would be said to them .\nThe Prophet, may Allah bless him and grant him peace, came out and stood\nin the midst of them. He said, \"Are there those among you who are not of\nyou?\" They replied, \"Yes, there are those among us with whom we have made\ntreaties as well as our nephews and our mawlas.\" The Prophet said, \"Our ally\nis one of us. Our nephew is one of us. Our mawla is one of us.\" You who are\nlistening:","text":"our friends among you are those who have taqwa of Allah. If you\nare one of them, then that is good. If that is not the case, then look out.\nPeople will bring their actions on the Day of Rising and you will come with\nburdens and you will be shunned.\" Then he called out, \"O people!\" He raised\nhis hands and put them on the heads of Quraysh. \"O people! Quraysh are the\npeople of trustworthiness. If anyone who oppresses them (and one of the\ntransmitters thought that he said, 'faults them'), Allah will overturn him.\"\nHe repeated that three times."}}],"chapter":{"id":3,"bookId":15,"arabic":"كتاب مَوَالِي","english":"Mawlas (Clients of Manumission)"}}