{"metadata":{"length":66,"arabic":{"title":"الأدب المفرد","author":"الإمام محمد بن إسماعيل البخاري","introduction":"كتاب التصرف العام"},"english":{"title":"Al-Adab Al-Mufrad","author":"Imam Muhammad ibn Ismail al-Bukhari","introduction":"General Behavior"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ رَجَاءٍ، وَحَفْصُ بْنُ عُمَرَ، قَالاَ‏:‏ حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ قَالَ‏:‏ سَأَلْتُ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا‏:‏ مَا كَانَ يَصْنَعُ النَّبِيُّ صلى الله عليه وسلم فِي أَهْلِهِ‏؟‏ فَقَالَتْ‏:‏ كَانَ يَكُونُ فِي مِهْنَةِ أَهْلِهِ، فَإِذَا حَضَرَتِ الصَّلاةُ خَرَجَ‏.‏","english":{"narrator":"","text":"Al-Aswad said, \"I asked 'A'isha, may Allah be pleased with her,\n'What did the Prophet, may Allah bless him and grant him peace, do when\nhe was with his family?' She replied, 'He would do chores for his family,\nand when it was time for the prayer, he would go out.'\""}},{"id":2,"idInBook":2,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى، قَالَ‏:‏ حَدَّثَنَا مَهْدِيُّ بْنُ مَيْمُونٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ قَالَ‏:‏ سَأَلْتُ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا‏:‏ مَا كَانَ النَّبِيُّ صلى الله عليه وسلم يَعْمَلُ فِي بَيْتِهِ‏؟‏ قَالَتْ‏:‏ يَخْصِفُ نَعْلَهُ، وَيَعْمَلُ مَا يَعْمَلُ الرَّجُلُ فِي بَيْتِهِ‏.‏","english":{"narrator":"","text":"Hisham ibn 'Urwa said that his father said, \"I asked 'A'isha, may\nAllah be pleased with her, 'What did the Prophet, may Allah bless him and\ngrant him peace, do in his house?' She replied, 'He mended his sandals\nand worked as any man works in his house.'\""}},{"id":3,"idInBook":3,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا إِسْحَاقُ، قَالَ‏:‏ أَخْبَرَنَا عَبْدُ اللهِ بْنُ الْوَلِيدِ، عَنْ سُفْيَانَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ قَالَ‏:‏ سَأَلْتُ عَائِشَةَ‏:‏ مَا كَانَ النَّبِيُّ صلى الله عليه وسلم يَصْنَعُ فِي بَيْتِهِ‏؟‏ قَالَتْ‏:‏ مَا يَصْنَعُ أَحَدُكُمْ فِي بَيْتِهِ‏؟‏ قَالَتْ‏:‏ مَا يَصْنَعُ أَحَدُكُمْ فِي بَيْتِهِ، يَخْصِفُ النَّعْلَ، وَيَرْقَعُ الثَّوْبَ، وَيَخِيطُ‏.‏","english":{"narrator":"","text":"Hisham said, \"I asked 'A'isha, 'What did the Prophet, may Allah\nbless him and grant him peace, do in his house?' She replied, 'He did what\none of you would do in his house. He mended sandals and patched garments\nand sewed.\""}},{"id":4,"idInBook":4,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ قَالَ‏:‏ حَدَّثَنِي مُعَاوِيَةُ بْنُ صَالِحٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرَةَ، قِيلَ لِعَائِشَةَ رَضِيَ اللَّهُ عَنْهَا‏:‏ مَاذَا كَانَ رَسُولُ اللهِ صلى الله عليه وسلم يَعْمَلُ فِي بَيْتِهِ‏؟‏ قَالَتْ‏:‏ كَانَ بَشَرًا مِنَ الْبَشَرِ، يَفْلِي ثَوْبَهُ، وَيَحْلِبُ شَاتَهُ‏.‏","english":{"narrator":"","text":"'Amra reported that 'A'isha was asked, \"What did the Messenger\nof Allah, may Allah bless him and grant him peace, do in his house?\" She\nreplied, \"He was a man like other men. He removed the fleas from his garment\nand milked his sheep.\""}},{"id":5,"idInBook":5,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ‏:‏ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ ثَوْرٍ قَالَ‏:‏ حَدَّثَنِي حَبِيبُ بْنُ عُبَيْدٍ، عَنِ الْمِقْدَامِ بْنِ مَعْدِي كَرِبَ، وَكَانَ قَدْ أَدْرَكَهُ، قَالَ‏:‏ قَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ إِذَا أَحَبَّ أَحَدُكُمْ أَخَاهُ فَلْيُعْلِمْهُ أَنَّهُ أَحَبَّهُ‏.‏","english":{"narrator":"","text":"Al-Miqdam ibn Ma'dikarib reported that the Prophet, may Allah bless\nhim and grant him peace, said, \"When one of you has love for his brother,\nhe should inform him that he loves him.\""}},{"id":6,"idInBook":6,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا يَحْيَى بْنُ بِشْرٍ، قَالَ‏:‏ حَدَّثَنَا قَبِيصَةُ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنْ رَبَاحٍ، عَنْ أَبِي عُبَيْدِ اللهِ، عَنْ مُجَاهِدٍ قَالَ‏:‏ لَقِيَنِي رَجُلٌ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم فَأَخَذَ بِمَنْكِبِي مِنْ وَرَائِي، قَالَ‏:‏ أَمَا إِنِّي أُحِبُّكَ، قَالَ‏:‏ أَحَبَّكَ الَّذِي أَحْبَبْتَنِي لَهُ، فَقَالَ‏:‏ لَوْلاَ أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم قَالَ‏:‏ إِذَا أَحَبَّ الرَّجُلُ الرَّجُلَ فَلْيُخْبِرْهُ أَنَّهُ أَحَبَّهُ مَا أَخْبَرْتُكَ، قَالَ‏:‏ ثُمَّ أَخَذَ يَعْرِضُ عَلَيَّ الْخِطْبَةَ قَالَ‏:‏ أَمَا إِنَّ عِنْدَنَا جَارِيَةً، أَمَا إِنَّهَا عَوْرَاءُ‏.‏","english":{"narrator":"","text":"Mujahid said, \"One of the Companions of the Prophet, may Allah\nbless him and grant him peace, met me and took hold of my shoulder from\nbehind. He said, 'I love you,' and he went on to say, 'The One for whose\nsake I love you loves you.' He continued, 'If it had not been that the\nMessenger of Allah, may Allah bless him and grant him peace, said, \"When\na man has love for another man, he should tell him that he loves him,\"\nI would not have told you.'\""}},{"id":7,"idInBook":7,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى، قَالَ‏:‏ حَدَّثَنَا مُبَارَكٌ، قَالَ‏:‏ حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسٍ قَالَ‏:‏ قَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ مَا تَحَابَّا الرَّجُلاَنِ إِلاَّ كَانَ أَفْضَلُهُمَا أَشَدَّهُمَا حُبًّا لِصَاحِبِهِ‏.‏","english":{"narrator":"","text":"Anas reported that the Prophet, may Allah bless him and grant him\npeace, said, \"When two men have love for one another, the better of them\nis the one who has the strongest love for his companion.\""}},{"id":8,"idInBook":8,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ صَالِحٍ قَالَ‏:‏ حَدَّثَنِي مُعَاوِيَةُ، أَنَّ أَبَا الزَّاهِرِيَّةِ حَدَّثَهُ، عَنْ جُبَيْرِ بْنِ نُفَيْرٍ، عَنْ مُعَاذِ بْنِ جَبَلٍ أَنَّهُ قَالَ‏:‏ إِذَا أَحْبَبْتَ أَخًا فَلاَ تُمَارِهِ، وَلاَ تُشَارِّهِ، وَلاَ تَسْأَلْ عَنْهُ، فَعَسَى أَنْ تُوَافِيَ لَهُ عَدُوًّا فَيُخْبِرَكَ بِمَا لَيْسَ فِيهِ، فَيُفَرِّقَ بَيْنَكَ وَبَيْنَهُ‏.‏","english":{"narrator":"","text":"Mu'adh ibn Jabal said, \"When you have love for your brother, do\nnot quarrel with him or treat him badly nor ask questions about him, It\nmay be that an enemy of his will appear and say something about him which\nis not true and will thereby cause a split between you.\""}},{"id":9,"idInBook":9,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا الْمُقْرِئُ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، عَنْ عَبْدِ اللهِ بْنِ يَزِيدَ، عَنْ عَبْدِ اللهِ بْنِ عَمْرٍو، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ مَنْ أَحَبَّ أَخًا لِلَّهِ، فِي اللهِ، قَالَ‏:‏ إِنِّي أُحِبُّكَ لِلَّهِ، فَدَخَلاَ جَمِيعًا الْجَنَّةَ، كَانَ الَّذِي أَحَبَّ فِي اللهِ أَرْفَعَ دَرَجَةً لِحُبِّهِ، عَلَى الَّذِي أَحَبَّهُ لَهُ‏.‏","english":{"narrator":"","text":"'Abdullah ibn 'Amr reported that the Prophet, may Allah bless him\nand grant him peace, said, \"Anyone who has love for his brother in Allah\nand for Allah should say, 'I love you for Allah,' and they will both enter\nthe Garden. The one who has love for someone in Allah has a degree over\nthe one he loves because of his love.\""}},{"id":10,"idInBook":10,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، قَالَ‏:‏ أَخْبَرَنَا مُحَمَّدُ بْنُ مُسْلِمٍ قَالَ‏:‏ أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عِيَاضِ بْنِ خَلِيفَةَ، عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ، أَنَّهُ سَمِعَهُ بِصِفِّينَ يَقُولُ‏:‏ إِنَّ الْعَقْلَ فِي الْقَلْبِ، وَالرَّحْمَةَ فِي الْكَبِدِ، وَالرَّأْفَةَ فِي الطِّحَالِ، وَالنَّفَسَ فِي الرِّئَةِ‏.‏","english":{"narrator":"","text":"'Iyad ibn Khalifa heard 'Ali say at Siffin, \"The intellect is located\nin the heart. Mercy is located in the liver, Compassion is located in the\nspleen. The self (nafs) is located in the lungs.\""}},{"id":11,"idInBook":11,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، قَالَ‏:‏ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنِ الصَّقْعَبِ بْنِ زُهَيْرٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ قَالَ‏:‏ لاَ أَعْلَمُهُ إِلاَّ عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ عَبْدِ اللهِ بْنِ عَمْرٍو قَالَ‏:‏ كُنَّا جُلُوسًا عِنْدَ رَسُولِ اللهِ صلى الله عليه وسلم فَجَاءَ رَجُلٌ مِنْ أَهْلِ الْبَادِيَةِ عَلَيْهِ جُبَّةُ سِيجَانٍ، حَتَّى قَامَ عَلَى رَأْسِ النَّبِيِّ صلى الله عليه وسلم فَقَالَ‏:‏ إِنَّ صَاحِبَكُمْ قَدْ وَضَعَ كُلَّ فَارِسٍ، أَوْ قَالَ‏:‏ يُرِيدُ أَنْ يَضَعَ كُلَّ فَارِسٍ، وَيَرْفَعَ كُلَّ رَاعٍ، فَأَخَذَ النَّبِيُّ صلى الله عليه وسلم بِمَجَامِعِ جُبَّتِهِ فَقَالَ‏:‏ أَلاَ أَرَى عَلَيْكَ لِبَاسَ مَنْ لاَ يَعْقِلُ، ثُمَّ قَالَ‏:‏ إِنَّ نَبِيَّ اللهِ نُوحًا صلى الله عليه وسلم لَمَّا حَضَرَتْهُ الْوَفَاةُ قَالَ لِابْنِهِ‏:‏ إِنِّي قَاصٌّ عَلَيْكَ الْوَصِيَّةَ، آمُرُكَ بِاثْنَتَيْنِ، وَأَنْهَاكَ عَنِ اثْنَتَيْنِ‏:‏ آمُرُكَ بِلاَ إِلَهَ إِلاَّ اللَّهُ، فَإِنَّ السَّمَاوَاتِ السَّبْعَ وَالأَرَضِينَ السَّبْعَ، لَوْ وُضِعْنَ فِي كِفَّةٍ وَوُضِعَتْ لاَ إِلَهَ إِلاَّ اللَّهُ فِي كِفَّةٍ لَرَجَحَتْ بِهِنَّ، وَلَوْ أَنَّ السَّمَاوَاتِ السَّبْعَ وَالأَرَضِينَ السَّبْعَ كُنَّ حَلْقَةً مُبْهَمَةً لَقَصَمَتْهُنَّ لاَ إِلَهَ إِلاَّ اللَّهُ، وَسُبْحَانَ اللهِ وَبِحَمْدِهِ، فَإِنَّهَا صَلاَةُ كُلِّ شَيْءٍ، وَبِهَا يُرْزَقُ كُلُّ شَيْءٍ، وَأَنْهَاكَ عَنِ الشِّرْكِ وَالْكِبْرِ، فَقُلْتُ، أَوْ قِيلَ‏:‏ يَا رَسُولَ اللهِ، هَذَا الشِّرْكُ قَدْ عَرَفْنَاهُ، فَمَا الْكِبْرُ‏؟‏ هُوَ أَنْ يَكُونَ لأَحَدِنَا حُلَّةٌ يَلْبَسُهَا‏؟‏ قَالَ‏:‏ لاَ، قَالَ‏:‏ فَهُوَ أَنْ يَكُونَ لأَحَدِنَا نَعْلاَنِ حَسَنَتَانِ، لَهُمَا شِرَاكَانِ حَسَنَانِ‏؟‏ قَالَ‏:‏ لاَ، قَالَ‏:‏ فَهُوَ أَنْ يَكُونَ لأَحَدِنَا دَابَّةٌ يَرْكَبُهَا‏؟‏ قَالَ‏:‏ لاَ، قَالَ‏:‏ فَهُوَ أَنْ يَكُونَ لأَحَدِنَا أَصْحَابٌ يَجْلِسُونَ إِلَيْهِ‏؟‏ قَالَ‏:‏ لاَ، قَالَ‏:‏ يَا رَسُولَ اللهِ، فَمَا الْكِبْرُ‏؟‏ قَالَ‏:‏ سَفَهُ الْحَقِّ، وَغَمْصُ النَّاسِ‏.‏","english":{"narrator":"","text":"'Abdullah ibn 'Amr said, \"We were sitting with the Messenger of\nAllah, may Allah bless him and grant him peace, when a bedouin man wearing\na robe with a border approached him until he stood before the Messenger\nof Allah, may Allah bless him and grant him peace. He said, 'Your companion\nhas debased every horseman and elevates every shepherd.' The Prophet, may\nAllah bless him and grant him peace, took hold of the folds of his robe\nand said, 'I see that you are wearing the clothes of someone who is without\nintelligence.' Then he went on, 'When the Prophet Nuh, may Allah bless\nhim and grant him peace, he told his son, \"I will give you some instructions.\nI command you to things and I forbid you two things. I command you to say,\n'There is no god but Allah.' If the seven heavens and the seven earths\nwere a dark ring, they would be cut by 'There is no god but Allah' and\n'Glory be to Allah and by His praise.' It is the prayer of every thing\nand by it everything has its provision. And I forbid you to associate others\nwith and Allah and to be proud.'"}},{"id":12,"idInBook":12,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ‏:‏ حَدَّثَنَا يُونُسُ بْنُ الْقَاسِمِ أَبُو عُمَرَ الْيَمَامِيُّ، قَالَ‏:‏ حَدَّثَنَا عِكْرِمَةُ بْنُ خَالِدٍ قَالَ‏:‏ سَمِعْتُ ابْنَ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم يَقُولُ‏:‏ مَنْ تَعَظَّمَ فِي نَفْسِهِ، أَوِ اخْتَالَ فِي مِشْيَتِهِ، لَقِيَ اللَّهَ عَزَّ وَجَلَّ وَهُوَ عَلَيْهِ غَضْبَانُ‏.‏","english":{"narrator":"","text":"Ibn 'Umar reported that the Prophet, may Allah bless him and grant\nhim peace, said, \"If anyone behaves insolently or walks with an arrogant,\nhe will meet Allah Almighty covered with His anger.\""}},{"id":13,"idInBook":13,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللهِ، عَنْ عَبْدِ الْعَزِيزِ بْنِ مُحَمَّدٍ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ مَا اسْتَكْبَرَ مَنْ أَكَلَ مَعَهُ خَادِمُهُ، وَرَكِبَ الْحِمَارُ بِالأَسْوَاقِ، وَاعْتَقَلَ الشَّاةَ فَحَلَبَهَا‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"Someone who eats with his servant, rides\na donkey in the markets, and ties up his sheep and milks it is not proud.\""}},{"id":14,"idInBook":14,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى بْنُ بَحْرٍ، قَالَ‏:‏ حَدَّثَنَا عَلِيُّ بْنُ هَاشِمِ بْنِ الْبَرِيدِ، قَالَ‏:‏ حَدَّثَنَا صَالِحٌ بَيَّاعُ الأَكْسِيَةِ، عَنْ جَدَّتِهِ قَالَتْ‏:‏ رَأَيْتُ عَلِيًّا رَضِيَ اللَّهُ عَنْهُ اشْتَرَى تَمْرًا بِدِرْهَمٍ، فَحَمَلَهُ فِي مِلْحَفَتِهِ، فَقُلْتُ لَهُ، أَوْ قَالَ لَهُ رَجُلٌ‏:‏ أَحْمِلُ عَنْكَ يَا أَمِيرَ الْمُؤْمِنِينَ‏؟‏ قَالَ‏:‏ لاَ، أَبُو الْعِيَالِ أَحَقُّ أَنْ يَحْمِلَ‏.‏","english":{"narrator":"","text":"Salih, the garment-seller, reported that his grandmother said,\n\"I saw 'Ali, may Allah be pleased with him, buy fates for a dirham and\nput them in his blanket. I said to him (or a man said to him), 'I will\ncarry it for you, Amir al-Mu'minin.' He said, 'No, the father of the family\nis the one who is the most entitled to carry it.'\""}},{"id":15,"idInBook":15,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا عُمَرُ، قَالَ‏:‏ حَدَّثَنَا أَبِي، قَالَ‏:‏ حَدَّثَنَا الأَعْمَشُ، قَالَ‏:‏ حَدَّثَنَا أَبُو إِسْحَاقَ، عَنْ أَبِي مُسْلِمٍ الأَغَرِّ حَدَّثَهُ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، وَأَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ الْعِزُّ إِزَارِي، وَالْكِبْرِيَاءُ رِدَائِي، فَمَنْ نَازَعَنِي بِشَيْءٍ مِنْهُمَا عَذَّبْتُهُ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said that Allah Almighty said, \"Might is My wrapper and\npride is My cloak. I will punish anyone who contends with Me over either\nof them.\""}},{"id":16,"idInBook":16,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ‏:‏ حَدَّثَنَا إِسْمَاعِيلُ قَالَ‏:‏ حَدَّثَنِي أَبُو رَوَاحَةَ يَزِيدُ بْنُ أَيْهَمَ، عَنِ الْهَيْثَمِ بْنِ مَالِكٍ الطَّائِيِّ قَالَ‏:‏ سَمِعْتُ النُّعْمَانَ بْنَ بَشِيرٍ يَقُولُ عَلَى الْمِنْبَرِ، قَالَ‏:‏ إِنَّ لِلشَّيْطَانِ مَصَالِيًا وَفُخُوخًا، وَإِنَّ مَصَالِيَ الشَّيْطَانِ وَفُخُوخَهُ‏:‏ الْبَطَرُ بِأَنْعُمِ اللهِ، وَالْفَخْرُ بِعَطَاءِ اللهِ، وَالْكِبْرِيَاءُ عَلَى عِبَادِ اللهِ، وَاتِّبَاعُ الْهَوَى فِي غَيْرِ ذَاتِ اللهِ‏.‏","english":{"narrator":"","text":"An-Nu'man ibn Bashir was heard to say on the minbar, \"Shaytan has\nsnares and traps. The snares and traps of Shaytan are to exult ungratefully\nin the blessings of Allah, to boast about the gifts of Allah, to have pride\nat the expense of the slaves of Allah, and to follow passion for other\nthan the sake of Allah.\""}},{"id":17,"idInBook":17,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا عَلِيٌّ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ احْتَجَّتِ الْجَنَّةُ وَالنَّارُ، وَقَالَ سُفْيَانُ أَيْضًا‏:‏ اخْتَصَمَتِ الْجَنَّةُ وَالنَّارُ، قَالَتِ النَّارُ‏:‏ يَلِجُنِي الْجَبَّارُونَ، وَيَلِجُنِي الْمُتَكَبِّرُونَ، وَقَالَتِ الْجَنَّةُ‏:‏ يَلِجُنِي الضُّعَفَاءُ، وَيَلِجُنِي الْفُقَرَاءُ‏.‏ قَالَ اللَّهُ تَبَارَكَ وَتَعَالَى لِلْجَنَّةِ‏:‏ أَنْتِ رَحْمَتِي أَرْحَمُ بِكِ مَنْ أَشَاءُ، ثُمَّ قَالَ لِلنَّارِ‏:‏ أَنْتِ عَذَابِي أُعَذِّبُ بِكِ مَنْ أَشَاءُ، وَلِكُلِّ وَاحِدَةٍ مِنْكُمَا مِلْؤُهَا‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"The Garden and the Fire quarrelled and the Fire\nsaid, 'The tyrants will enter me and the proud will enter me.' The Garden\nretorted, 'The weak will enter me and the poor will enter me.' Allah Almighty\nsaid to the Garden, 'You are My mercy and I show you to whomever I will.'\nThen He said to the Fire, 'You are My punishment with which I will punish\nwhomever I will. Each of you will have your fill.'\""}},{"id":18,"idInBook":18,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا إِسْحَاقُ، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلِ، قَالَ‏:‏ حَدَّثَنَا الْوَلِيدُ بْنُ جَمِيعٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ قَالَ‏:‏ لَمْ يَكُنْ أَصْحَابُ رَسُولِ اللهِ صلى الله عليه وسلم مُتَحَزِّقِينَ، وَلاَ مُتَمَاوِتِينَ، وَكَانُوا يَتَنَاشَدُونَ الشِّعْرَ فِي مَجَالِسِهِمْ، وَيَذْكُرُونَ أَمْرَ جَاهِلِيَّتِهِمْ، فَإِذَا أُرِيدَ أَحَدٌ مِنْهُمْ عَلَى شَيْءٍ مِنْ أَمْرِ اللهِ، دَارَتْ حَمَالِيقُ عَيْنَيْهِ كَأَنَّهُ مَجْنُونٌ‏.‏","english":{"narrator":"","text":"Abu Salama ibn 'Abdu'r-Rahman said, \"The Companions of the Messenger\nof Allah, may Allah bless him and grant him peace, were neither niggardly\nnor weak (in worship). They used to recite poems to one another in their\ngatherings and they mentioned matters of the Jahiliyya. But when one of\nthem was asked about something concerning Allah, his eyes went around as\nif he were mad.\""}},{"id":19,"idInBook":19,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْوَهَّابِ، قَالَ‏:‏ حَدَّثَنَا هِشَامٌ، عَنْ مُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَجُلاً أَتَى النَّبِيَّ صلى الله عليه وسلم، وَكَانَ جَمِيلاً، فَقَالَ‏:‏ حُبِّبَ إِلَيَّ الْجَمَالُ، وَأُعْطِيتُ مَا تَرَى، حَتَّى مَا أُحِبُّ أَنْ يَفُوقَنِي أَحَدٌ، إِمَّا قَالَ‏:‏ بِشِرَاكِ نَعْلٍ، وَإِمَّا قَالَ‏:‏ بِشِسْعٍ أَحْمَرَ، الْكِبْرُ ذَاكَ‏؟‏ قَالَ‏:‏ لاَ، وَلَكِنَّ الْكِبْرَ مَنْ بَطَرَ الْحَقَّ، وَغَمَطَ النَّاسَ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that a man who was handsome came to the Prophet,\nmay Allah bless him and grant him peace, and said, \"I love beauty and I\nhave been given what you see so I do not want anyone to be superior to\nme (and he either said 'by the strap of a sandal' or 'by a red sandal-thong').\nIs that pride?\" \"No,\" he replied. \"Pride is when someone disdains the truth\nand is contemptuous of people.\""}},{"id":20,"idInBook":20,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، قَالَ‏:‏ أَخْبَرَنَا عَبْدُ اللهِ بْنُ الْمُبَارَكِ، عَنْ مُحَمَّدِ بْنِ عَجْلاَنَ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ يُحْشَرُ الْمُتَكَبِّرُونَ يَوْمَ الْقِيَامَةِ أَمْثَالَ الذَّرِّ فِي صُورَةِ الرِّجَالِ، يَغْشَاهُمُ الذُّلُّ مِنْ كُلِّ مَكَانٍ، يُسَاقُونَ إِلَى سِجْنٍ مِنْ جَهَنَّمَ يُسَمَّى‏:‏ بُولَسَ، تَعْلُوهُمْ نَارُ الأَنْيَارِ، وَيُسْقَوْنَ مِنْ عُصَارَةِ أَهْلِ النَّارِ، طِينَةَ الْخَبَالِ‏.‏","english":{"narrator":"","text":"'Amr ibn Shu'ayb reported via his father that his grandfather related\nthat the Prophet, may Allah bless him and grant him peace, said, \"On the\nDay of Rising, the proud will be gathered like specks in the form of men.\nAbasement will envelop them on every side. They will be driven to a prison\nin Jahannam called Bulas. The hottest of fires will rise over them. They\nwill have to drink the pus of the people of the Fire, the foul fluid that\ntheir skins excrete.\""}},{"id":21,"idInBook":21,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى قَالَ‏:‏ أَخْبَرَنِي ابْنُ أَبِي زَائِدَةَ، قَالَ‏:‏ أَخْبَرَنَا أَبِي، عَنْ خَالِدِ بْنِ سَلَمَةَ، عَنِ الْبَهِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ لَهَا‏:‏ دُونَكِ فَانْتَصِرِي‏.‏","english":{"narrator":"","text":"'A'isha reported that the Prophet, may Allah bless him and grant\nhim peace, said, \"Go ahead, take revenge.\""}},{"id":22,"idInBook":22,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا الْحَكَمُ بْنُ نَافِعٍ، قَالَ‏:‏ أَخْبَرَنَا شُعَيْبُ بْنُ أَبِي حَمْزَةَ، عَنِ الزُّهْرِيِّ قَالَ‏:‏ أَخْبَرَنِي مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ، أَنَّ عَائِشَةَ قَالَتْ‏:‏ أَرْسَلَ أَزْوَاجُ النَّبِيِّ صلى الله عليه وسلم فَاطِمَةَ إِلَى النَّبِيِّ صلى الله عليه وسلم، فَاسْتَأْذَنَتْ وَالنَّبِيُّ صلى الله عليه وسلم مَعَ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا فِي مِرْطِهَا، فَأَذِنَ لَهَا فَدَخَلَتْ، فَقَالَتْ‏:‏ إِنَّ أَزْوَاجَكَ أَرْسَلْنَنِي يَسْأَلْنَكَ الْعَدْلَ فِي بِنْتِ أَبِي قُحَافَةَ، قَالَ‏:‏ أَيْ بُنَيَّةُ، أَتُحِبِّينَ مَا أُحِبُّ‏؟‏ قَالَتْ‏:‏ بَلَى، قَالَ‏:‏ فَأَحِبِّي هَذِهِ، فَقَامَتْ فَخَرَجَتْ فَحَدَّثَتْهُمْ، فَقُلْنَ‏:‏ مَا أَغْنَيْتِ عَنَّا شَيْئًا فَارْجِعِي إِلَيْهِ، قَالَتْ‏:‏ وَاللَّهِ لاَ أُكَلِّمُهُ فِيهَا أَبَدًا‏.‏ فَأَرْسَلْنَ زَيْنَبَ زَوْجَ النَّبِيِّ صلى الله عليه وسلم، فَاسْتَأْذَنَتْ، فَأَذِنَ لَهَا، فَقَالَتْ لَهُ ذَلِكَ، وَوَقَعَتْ فِيَّ زَيْنَبُ تَسُبُّنِي، فَطَفِقْتُ أَنْظُرُ‏:‏ هَلْ يَأْذَنُ لِيَ النَّبِيُّ صلى الله عليه وسلم، فَلَمْ أَزَلْ حَتَّى عَرَفْتُ أَنَّ النَّبِيَّ صلى الله عليه وسلم لاَ يَكْرَهُ أَنْ أَنْتَصِرَ، فَوَقَعْتُ بِزَيْنَبَ، فَلَمْ أَنْشَبْ أَنْ أَثْخَنْتُهَا غَلَبَةً، فَتَبَسَّمَ رَسُولُ اللهِ صلى الله عليه وسلم، ثُمَّ قَالَ‏:‏ أَمَا إِنَّهَا ابْنَةُ أَبِي بَكْرٍ‏.‏","english":{"narrator":"","text":"'A'isha reported that the wives of the Prophet, may Allah bless\nhim and grant him peace, sent Fatima to the Prophet and she asked for permission\nto enter while the Prophet, may Allah bless him and grant him peace, was\nwith 'A'isha, may Allah be pleased with her, who was wearing a wool dress.\nHe gave her permission to enter and she came in. She said, \"Your wives\nhave sent me to ask you for justice regarding the daughter of Abu Quhafa\n(i.e. 'A'isha).\" He said, \"Daughter, do you love what I love?\" \"Yes,\" she\nreplied. He said, \"Then love this woman.\""}},{"id":23,"idInBook":23,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ‏:‏ حَدَّثَنَا حَمَّادُ بْنُ بَشِيرٍ الْجَهْضَمِيُّ، قَالَ‏:‏ حَدَّثَنَا عُمَارَةُ الْمَعْوَلِيُّ، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ يَكُونُ فِي آخِرِ الزَّمَانِ مَجَاعَةٌ، مَنْ أَدْرَكَتْهُ فَلاَ يَعْدِلَنَّ بِالأَكْبَادِ الْجَائِعَةِ‏.‏","english":{"narrator":"","text":"Abu Hurayra said, \"There will be a famine at the end of time and\nwhoever encounters it will not be just to those with hungry stomachs.\""}},{"id":24,"idInBook":24,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ‏:‏ حَدَّثَنَا شُعَيْبُ بْنُ أَبِي حَمْزَةَ، قَالَ‏:‏ حَدَّثَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ الأَنْصَارَ قَالَتْ لِلنَّبِيِّ صلى الله عليه وسلم‏:‏ اقْسِمْ بَيْنَنَا وَبَيْنَ إِخْوَانِنَا النَّخِيلَ، قَالَ‏:‏ لاَ، فَقَالُوا‏:‏ تَكْفُونَا الْمَؤُونَةَ، وَنُشْرِكُكُمْ فِي الثَّمَرَةِ‏؟‏ قَالُوا‏:‏ سَمِعْنَا وَأَطَعْنَا‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Ansar said to the Prophet, may Allah\nbless him and grant him peace, \"Divide the palm trees between us and our\nbrothers.\" \"No,\" he replied. He said, \"Spare us the trouble of their upkeep\nand we will let you share in the fruit.\" They replied, \"We hear and obey.\""}},{"id":25,"idInBook":25,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا أَصْبَغُ قَالَ‏:‏ أَخْبَرَنِي ابْنُ وَهْبٍ قَالَ‏:‏ أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَنَّ سَالِمًا أَخْبَرَهُ، أَنَّ عَبْدَ اللهِ بْنَ عُمَرَ أَخْبَرَهُ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ قَالَ عَامَ الرَّمَادَةِ، وَكَانَتْ سَنَةً شَدِيدَةً مُلِمَّةً، بَعْدَ مَا اجْتَهَدَ عُمَرُ فِي إِمْدَادِ الأعْرَابِ بِالإِبِلِ وَالْقَمْحِ وَالزَّيْتِ مِنَ الأَرْيَافِ كُلِّهَا، حَتَّى بَلَحَتِ الأَرْيَافُ كُلُّهَا مِمَّا جَهَدَهَا ذَلِكَ، فَقَامَ عُمَرُ يَدْعُو فَقَالَ‏:‏ اللَّهُمَّ اجْعَلْ رِزْقَهُمْ عَلَى رُءُوسِ الْجِبَالِ، فَاسْتَجَابَ اللَّهُ لَهُ وَلِلْمُسْلِمِينَ، فَقَالَ حِينَ نَزَلَ بِهِ الْغَيْثُ‏:‏ الْحَمْدُ لِلَّهِ، فَوَاللَّهِ لَوْ أَنَّ اللَّهَ لَمْ يُفْرِجْهَا مَا تَرَكْتُ بِأَهْلِ بَيْتٍ مِنَ الْمُسْلِمِينَ لَهُمْ سَعَةٌ إِلاَّ أَدْخَلْتُ مَعَهُمْ أَعْدَادَهُمْ مِنَ الْفُقَرَاءِ، فَلَمْ يَكُنِ اثْنَانِ يَهْلِكَانِ مِنَ الطَّعَامِ عَلَى مَا يُقِيمُ وَاحِدًا‏.‏","english":{"narrator":"","text":"'Abdullah ibn 'Umar reported that 'Umar ibn al-Khattab spoke in\nthe Year of the Drought*, which was a severe, disastrous year, after 'Umar\nhad done his best to help the Bedouins with camels, wheat and oil from\nthe fields to the point where all the fields were dried up as a result\nof those efforts. he stood up to make supplication, saying, \"O Allah! Provide\nthem at the tops of the mountains!\" Allah answered that supplication for\nhim and the Muslims. When abundant rain fell, he said, \"Praise belongs\nto Allah! By Allah, if Allah had not given us relief, I would not have\nleft the people of any Muslim's house with wealth without putting a like\nnumber of poor people with him. Two will not die with food which will support\none person.\""}},{"id":26,"idInBook":26,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا أَبُو عَاصِمٍ، عَنْ يَزِيدَ بْنِ أَبِي عُبَيْدٍ، عَنْ سَلَمَةَ بْنِ الأَكْوَعِ قَالَ‏:‏ قَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ ضَحَايَاكُمْ، لاَ يُصْبِحُ أَحَدُكُمْ بَعْدَ ثَالِثَةٍ، وَفِي بَيْتِهِ مِنْهُ شَيْءٌ‏.‏ فَلَمَّا كَانَ الْعَامُ الْمُقْبِلُ قَالُوا‏:‏ يَا رَسُولَ اللهِ، نَفْعَلُ كَمَا فَعَلْنَا الْعَامَ الْمَاضِيَ‏؟‏ قَالَ‏:‏ كُلُوا وَادَّخِرُوا، فَإِنَّ ذَلِكَ الْعَامَ كَانُوا فِي جَهْدٍ فَأَرَدْتُ أَنْ تُعِينُوا‏.‏","english":{"narrator":"","text":"Salama ibn al-Akwa' reported that the Prophet, may Allah bless\nhim and grant him peace, said, \"As for your sacrifices, none of you should\nhave any of it left in his house after a period of three days. When the\nfollowing year came, they aid, 'Messenger of Allah, should we do the same\nas we did last year?' He said, 'Eat and store up, That was a year in which\nwe were in difficulty and I wanted you to help.\""}},{"id":27,"idInBook":27,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا فَرْوَةُ بْنُ أَبِي الْمَغْرَاءِ، قَالَ‏:‏ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ قَالَ‏:‏ كُنْتُ جَالِسًا عِنْدَ مُعَاوِيَةَ، فَحَدَّثَ نَفْسَهُ، ثُمَّ انْتَبَهَ فَقَالَ‏:‏ لاَ حِلْمَ إِلاَّ تَجْرِبَةٌ، يُعِيدُهَا ثَلاثًا‏.‏","english":{"narrator":"","text":"Hisham ibn 'Urwa reported that his father said, \"I was sitting\nwith Mu'awiya and he muttered to himself and then came to his senses. [This\nis when he was ill.] He said, 'No one has forbearance without it being\nput to the test.' He repeated that three times.\""}},{"id":28,"idInBook":28,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، قَالَ‏:‏ حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، عَنِ ابْنِ زَحْرٍ، عَنْ أَبِي الْهَيْثَمِ، عَنْ أَبِي سَعِيدٍ قَالَ‏:‏ لاَ حَلِيمَ إِلاَّ ذُو عَثْرَةٍ، وَلاَ حَكِيمَ إِلاَّ ذُو تَجْرِبَةٍ‏.‏","english":{"narrator":"","text":"Abu Sa'id said, \"No one is forbearing unless he himself has made\na mistake., No one is wise unless he himself has been tested.\""}},{"id":29,"idInBook":29,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا سُلَيْمَانُ أَبُو الرَّبِيعِ، قَالَ‏:‏ حَدَّثَنَا جَرِيرُ بْنُ عَبْدِ الْحَمِيدِ، عَنْ لَيْثٍ، عَنْ مُحَمَّدِ بْنِ نَشْرٍ، عَنْ مُحَمَّدِ بْنِ الْحَنَفِيَّةِ، عَنْ عَلِيٍّ قَالَ‏:‏ لأَنْ أَجْمَعَ نَفَرًا مِنْ إِخْوَانِي عَلَى صَاعٍ أَوْ صَاعَيْنِ مِنْ طَعَامٍ، أَحَبُّ إِلَيَّ مِنْ أَنْ أَخْرُجَ إِلَى سُوقِكُمْ فَأُعْتِقَ رَقَبَةً‏.‏","english":{"narrator":"","text":"'Ali said, \"I prefer to have a group of my brothers join around\na\nsa' or two of food to going out to the market and setting a slave\nfree.\""}},{"id":30,"idInBook":30,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، قَالَ‏:‏ حَدَّثَنَا ابْنُ عُلَيَّةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ إِسْحَاقَ، عَنِ الزُّهْرِيِّ، عَنْ مُحَمَّدِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ، عَنْ أَبِيهِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم قَالَ‏:‏ شَهِدْتُ مَعَ عُمُومَتِي حِلْفَ الْمُطَيَّبِينَ، فَمَا أُحِبُّ أَنْ أَنْكُثَهُ، وَأَنَّ لِي حُمْرَ النَّعَمِ‏.‏","english":{"narrator":"","text":"'Abdu'r-Rahman ibn 'Awf reported that the Prophet, may Allah bless\nhim and grant him peace, said, \"I was present with my uncles at the alliance\nof the perfumed (Hilf al-Mutayyabin). I would not wish to break it, even for red camels.\""}},{"id":31,"idInBook":31,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ‏:‏ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ قَالَ‏:‏ آخَى النَّبِيُّ صلى الله عليه وسلم بَيْنَ ابْنِ مَسْعُودٍ وَالزُّبَيْرِ‏.‏","english":{"narrator":"","text":"Anas said, \"The Prophet, may Allah bless him and grant him peace,\nformed a pact of brotherhood between Ibn Mas'ud and az-Zubayr.\""}},{"id":32,"idInBook":32,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، قَالَ‏:‏ أَخْبَرَنَا ابْنُ عُيَيْنَةَ، قَالَ‏:‏ حَدَّثَنَا عَاصِمٌ الأَحْوَلُ، عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ‏:‏ حَالَفَ رَسُولُ اللهِ صلى الله عليه وسلم بَيْنَ قُرَيْشٍ وَالأَنْصَارِ فِي دَارِي الَّتِي بِالْمَدِينَةِ‏.‏","english":{"narrator":"","text":"Anas ibn Malik said, \"The Messenger of Allah, may Allah bless him\nand grant him peace, formed an alliance between Quraysh and the Ansar in\nmy house in Madina.\""}},{"id":33,"idInBook":33,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، قَالَ‏:‏ حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ قَالَ‏:‏ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ الْحَارِثِ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ قَالَ‏:‏ جَلَسَ النَّبِيُّ صلى الله عليه وسلم عَامَ الْفَتْحِ عَلَى دَرَجِ الْكَعْبَةِ، فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ، ثُمَّ قَالَ‏:‏ مَنْ كَانَ لَهُ حِلْفٌ فِي الْجَاهِلِيَّةِ، لَمْ يَزِدْهُ الإِسْلاَمُ إِلاَّ شِدَّةً، وَلاَ هِجْرَةَ بَعْدَ الْفَتْحِ‏.‏","english":{"narrator":"","text":"'Amr ibn Shu'ayb reported via his father that his grandfather,\n\"The Prophet, may Allah bless him and grant him peace, sat down on the\nsteps of the Ka'ba in the year of Conquest* and praised and glorified Allah.\nThen he said, 'Whoever is party to an alliance made in the Jahiliyya,\nIslam only increases its strength. There is no hijra after the Conquest.'\""}},{"id":34,"idInBook":34,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ أَبِي الأَسْوَدِ، قَالَ‏:‏ حَدَّثَنَا جَعْفَرُ بْنُ سُلَيْمَانَ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ قَالَ‏:‏ أَصَابَنَا مَعَ النَّبِيِّ صلى الله عليه وسلم مَطَرٌ، فَحَسَرَ النَّبِيُّ صلى الله عليه وسلم ثَوْبَهُ عَنْهُ حَتَّى أَصَابَهُ الْمَطَرُ، قُلْنَا‏:‏ لِمَ فَعَلْتَ‏؟‏ قَالَ‏:‏ لأَنَّهُ حَدِيثُ عَهْدٍ بِرَبِّهِ‏.‏","english":{"narrator":"","text":"Anas said, \"Rain fell on us while we were with the Prophet, may\nAllah bless him and grant him peace, took of his garment so that the rain\ncould fall on him. We said, 'Why did you do that?' He said, 'Because it\nhas newly come from its Lord.'\""}},{"id":35,"idInBook":35,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ قَالَ‏:‏ حَدَّثَنِي مَالِكٌ، عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَلْحَلَةَ، عَنْ حُمَيْدِ بْنِ مَالِكِ بْنِ خُثَيْمٍ أَنَّهُ قَالَ‏:‏ كُنْتُ جَالِسًا مَعَ أَبِي هُرَيْرَةَ بِأَرْضِهِ بِالْعَقِيقِ، فَأَتَاهُ قَوْمٌ مِنْ أَهْلِ الْمَدِينَةِ عَلَى دَوَابَّ، فَنَزَلُوا، قَالَ حُمَيْدٌ‏:‏ فَقَالَ أَبُو هُرَيْرَةَ‏:‏ اذْهَبْ إِلَى أُمِّي وَقُلْ لَهَا‏:‏ إِنَّ ابْنَكِ يُقْرِئُكِ السَّلاَمَ وَيَقُولُ‏:‏ أَطْعِمِينَا شَيْئًا، قَالَ‏:‏ فَوَضَعَتْ ثَلاَثَةَ أَقْرَاصٍ مِنْ شَعِيرٍ، وَشَيْئًا مِنْ زَيْتٍ وَمِلْحٍ فِي صَحْفَةٍ، فَوَضَعْتُهَا عَلَى رَأْسِي، فَحَمَلْتُهَا إِلَيْهِمْ، فَلَمَّا وَضَعْتُهُ بَيْنَ أَيْدِيهِمْ، كَبَّرَ أَبُو هُرَيْرَةَ وَقَالَ‏:‏ الْحَمْدُ لِلَّهِ الَّذِي أَشْبَعَنَا مِنَ الْخُبْزِ بَعْدَ أَنْ لَمْ يَكُنْ طَعَامُنَا إِلاَّ الأَسْوَدَانِ‏:‏ التَّمْرُ وَالْمَاءُ، فَلَمْ يُصِبِ الْقَوْمُ مِنَ الطَّعَامِ شَيْئًا، فَلَمَّا انْصَرَفُوا قَالَ‏:‏ يَا ابْنَ أَخِي، أَحْسِنْ إِلَى غَنَمِكَ، وَامْسَحْ الرُّغَامَ عَنْهَا، وَأَطِبْ مُرَاحَهَا، وَصَلِّ فِي نَاحِيَتِهَا، فَإِنَّهَا مِنْ دَوَابِّ الْجَنَّةِ، وَالَّذِي نَفْسِي بِيَدِهِ لَيُوشِكُ أَنْ يَأْتِيَ عَلَى النَّاسِ زَمَانٌ تَكُونُ الثُّلَّةُ مِنَ الْغَنَمِ أَحَبَّ إِلَى صَاحِبِهَا مِنْ دَارِ مَرْوَانَ‏.‏","english":{"narrator":"","text":"Humayd ibn Malik ibn Khuthaym said, \"I was sitting with Abu Hurayra\non some land he owned at 'Aqiq when some of the people of Madina came to\nhim on their animals and dismounted. Abu Hurayra said, 'Go to my mother\nand tell her, \"Your son sends you greetings and asks you to give us something\nto eat.\"'\""}},{"id":36,"idInBook":36,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، قَالَ‏:‏ حَدَّثَنَا وَكِيعٌ، قَالَ‏:‏ حَدَّثَنَا إِسْمَاعِيلُ الأَزْرَقُ، عَنْ أَبِي عُمَرَ، عَنِ ابْنِ الْحَنَفِيَّةِ، عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ‏:‏ الشَّاةُ فِي الْبَيْتِ بَرَكَةٌ، وَالشَّاتَانِ بَرَكَتَانِ، وَالثَّلاَثُ بَرَكَاتٌ‏.‏","english":{"narrator":"'Ali reported that the Prophet, may Allah bless him and grant him\npeace, said, \"One sheep in a house is a blessing, two sheep are two blessings\nand more sheep are all blessings.:","text":""}},{"id":37,"idInBook":37,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ قَالَ‏:‏ حَدَّثَنِي مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم قَالَ‏:‏ رَأْسُ الْكُفْرِ نَحْوَ الْمَشْرِقِ، وَالْفَخْرُ وَالْخُيَلاَءُ فِي أَهْلِ الْخَيْلِ وَالإِبِلِ، الْفَدَّادِينَ أَهْلِ الْوَبَرِ، وَالسَّكِينَةُ فِي أَهْلِ الْغَنَمِ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"The head (or summit) of disbelief lies\ntowards the east and the pride and arrogance lie in people who possess\nhorses and camels who are also coarse - the bedouins. Tranquillity\nlies in people who possess sheep.\""}},{"id":38,"idInBook":38,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا عَمْرُو بْنُ مَرْزُوقٍ، قَالَ‏:‏ أَخْبَرَنَا شُعْبَةُ، عَنْ عُمَارَةَ بْنِ أَبِي حَفْصَةَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ قَالَ‏:‏ عَجِبْتُ لِلْكِلاَبِ وَالشَّاءِ، إِنَّ الشَّاءَ يُذْبَحُ مِنْهَا فِي السَّنَةِ كَذَا وَكَذَا، وَيُهْدَى كَذَا وَكَذَا، وَالْكَلْبُ تَضَعُ الْكَلْبَةُ الْوَاحِدَةُ كَذَا وَكَذَا وَالشَّاءُ أَكْثَرُ مِنْهَا‏.‏","english":{"narrator":"","text":"Ibn 'Abbas said, \"I never cease to wonder at dogs and sheep. Such-and-such\na number of sheep were slaughtered in the year and such-and-such a number\nwere sacrificed for hajj. One bitch has a litter of such-and-such a number\nof puppies, and sheep have more than the dog.\""}},{"id":39,"idInBook":39,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا قَبِيصَةُ، قَالَ‏:‏ حَدَّثَنَا وَهْبُ بْنُ إِسْمَاعِيلَ، عَنْ مُحَمَّدِ بْنِ قَيْسٍ، عَنْ أَبِي هِنْدَ الْهَمْدَانِيِّ، عَنْ أَبِي ظَبْيَانَ قَالَ‏:‏ قَالَ لِي عُمَرُ بْنُ الْخَطَّابِ‏:‏ يَا أَبَا ظَبْيَانَ، كَمْ عَطَاؤُكَ‏؟‏ قُلْتُ‏:‏ أَلْفَانِ وَخَمْسُمِئَةٍ، قَالَ لَهُ‏:‏ يَا أَبَا ظَبْيَانَ، اتَّخِذْ مِنَ الْحَرْثِ وَالسَّابْيَاءِ مِنْ قَبْلِ أَنْ تَلِيَكُمْ غِلْمَةُ قُرَيْشٍ، لاَ يُعَدُّ الْعَطَاءُ مَعَهُمْ مَالاً‏.‏","english":{"narrator":"","text":"Abu Dhubyan related that 'Umar ibn al-Khattab asked him, \"Abu Dhubyan,\nhow large is your (soldier's) stipend?\" \"2500,\" he replied. He told him,\n\"Abu Dhubyan, it was taken from agriculture and increased livestock before\nthe lads of Quraysh were appointed over you. They do not consider the stipend\nto be income.\""}},{"id":40,"idInBook":40,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، سَمِعْتُ أَبَا إِسْحَاقَ، سَمِعْتُ عَبْدَةَ بْنَ حَزْنٍ يَقُولُ‏:‏ تَفَاخَرَ أَهْلُ الإِبِلِ وَأَصْحَابُ الشَّاءِ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ بُعِثَ مُوسَى وَهُوَ رَاعِي غَنَمٍ، وَبُعِثَ دَاوُدُ وَهُوَ رَاعٍ، وَبُعِثْتُ أَنَا وَأَنَا أَرْعَى غَنَمًا لأَهْلِي بِأَجْيَادِ‏.‏","english":{"narrator":"","text":"'Abda ibn Hazn said, \"The people of camels and the people of sheep\nvied with one another for glory. The Prophet, may Allah bless him and grant\nhim peace, said, 'Musa was sent, and he was a shepherd. Da'ud was sent,\nand he was a shepherd. I was sent, and I used to herd sheep for my people\nat Ajyad.'\""}},{"id":41,"idInBook":41,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ‏:‏ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عُمَرَ بْنِ أَبِي سَلَمَةَ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ الْكَبَائِرُ سَبْعٌ، أَوَّلُهُنَّ‏:‏ الإِشْرَاكُ بِاللَّهِ، وَقَتْلُ النَّفْسِ، وَرَمْيُ الْمُحْصَنَاتِ، وَالأعْرَابِيَّةُ بَعْدَ الْهِجْرَةِ‏.‏","english":{"narrator":"","text":"Abu Hurayra said, \"There are seven major wrong actions. The first\nof them is to associate things with Allah, then killing someone, slandering\nchaste women, and going back to live as a Bedouin after having made\nhijra.\""}},{"id":42,"idInBook":42,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ عَاصِمٍ، قَالَ‏:‏ حَدَّثَنَا حَيْوَةُ، قَالَ‏:‏ حَدَّثَنَا بَقِيَّةُ قَالَ‏:‏ حَدَّثَنِي صَفْوَانُ قَالَ‏:‏ سَمِعْتُ رَاشِدَ بْنَ سَعْدٍ يَقُولُ‏:‏ سَمِعْتُ ثَوْبَانَ يَقُولُ‏:‏ قَالَ لِي رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ لاَ تَسْكُنِ الْكُفُورَ، فَإِنَّ سَاكِنَ الْكُفُورِ كَسَاكِنِ الْقُبُورِ قَالَ أَحْمَدُ‏:‏ الْكُفُورُ‏:‏ الْقُرَى‏.‏","english":{"narrator":"","text":"Thawban said, \"The Messenger of Allah, may Allah bless him and\ngrant him peace, told me, 'Do not live the suburbs. The person who lives\nin the suburbs is like someone who lives in the graves.'\""}},{"id":43,"idInBook":43,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، قَالَ‏:‏ حَدَّثَنَا شَرِيكٌ، عَنِ الْمِقْدَامِ بْنِ شُرَيْحٍ، عَنْ أَبِيهِ قَالَ‏:‏ سَأَلْتُ عَائِشَةَ عَنِ الْبَدْوِ قُلْتُ‏:‏ وَهَلْ كَانَ النَّبِيُّ صلى الله عليه وسلم يَبْدُو‏؟‏ فَقَالَتْ‏:‏ نَعَمْ، كَانَ يَبْدُو إِلَى هَؤُلاَءِ التِّلاعِ‏.‏","english":{"narrator":"","text":"Shurayh said, \"I asked 'A'isha about going out to the desert. I\nsaid, 'Did the Prophet, may Allah bless him and grant him peace, go out\nto the desert?' 'Yes,' she replied, 'Yes, he went out to those hillside\nstreams.'\""}},{"id":44,"idInBook":44,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا أَبُو حَفْصِ بْنُ عَلِيٍّ، قَالَ‏:‏ حَدَّثَنَا أَبُو عَاصِمٍ، عَنْ عَمْرِو بْنِ وَهْبٍ قَالَ‏:‏ رَأَيْتُ مُحَمَّدَ بْنَ عَبْدِ اللهِ بْنِ أُسَيْدٍ إِذَا رَكِبَ، وَهُوَ مُحْرِمٌ، وَضَعَ ثَوْبَهُ عَنْ مَنْكِبَيْهِ، وَوَضَعَهُ عَلَى فَخِذَيْهِ، فَقُلْتُ‏:‏ مَا هَذَا‏؟‏ قَالَ‏:‏ رَأَيْتُ عَبْدَ اللهِ يَفْعَلُ مِثْلَ هَذَا‏.‏","english":{"narrator":"","text":"'Amr ibn Wahb said, \"I saw Muhammad ibn 'Abdullah ibn Usayd riding\nwhen he was in ihram. He placed his garment on his shoulder and he placed\nit on his thighs. I said, 'What is this?' He replied, 'I saw 'Abdullah\nact like this.'\""}},{"id":45,"idInBook":45,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَ‏:‏ أَخْبَرَنَا مَعْمَرٌ قَالَ‏:‏ أَخْبَرَنِي مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَبْدٍ الْقَارِيِّ، عَنْ أَبِيهِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ وَرَجُلاً مِنَ الأَنْصَارِ كَانَا جَالِسَيْنِ، فَجَاءَ عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ الْقَارِيِّ فَجَلَسَ إِلَيْهِمَا، فَقَالَ عُمَرُ‏:‏ إِنَّا لاَ نُحِبُّ مَنْ يَرْفَعُ حَدِيثَنَا، فَقَالَ لَهُ عَبْدُ الرَّحْمَنِ‏:‏ لَسْتُ أُجَالِسُ أُولَئِكَ يَا أَمِيرَ الْمُؤْمِنِينَ، قَالَ عُمَرُ‏:‏ بَلَى، فَجَالِسْ هَذَا وَهَذَا، وَلاَ تَرْفَعْ حَدِيثَنَا، ثُمَّ قَالَ لِلأَنْصَارِيِّ‏:‏ مَنْ تَرَى النَّاسَ يَقُولُونَ يَكُونُ الْخَلِيفَةَ بَعْدِي‏؟‏ فَعَدَّدَ الأَنْصَارِيُّ رِجَالاً مِنَ الْمُهَاجِرِينَ، لَمْ يُسَمِّ عَلِيًّا، فَقَالَ عُمَرُ‏:‏ فَمَا لَهُمْ عَنْ أَبِي الْحَسَنِ‏؟‏ فَوَاللَّهِ إِنَّهُ لَأَحْرَاهُمْ، إِنْ كَانَ عَلَيْهِمْ، أَنْ يُقِيمَهُمْ عَلَى طَرِيقَةٍ مِنَ الْحَقِّ‏.‏","english":{"narrator":"","text":"'Abdullah ibn 'Abdu'r-Rahman ibn 'Abdu'l-Qari reported that 'Umar\nibn al-Khattab and an Ansari man were sitting together when 'Abdu'r-Rahman\nibn 'Abdu'l-Qari came and sat with them. 'Umar said, \"We do not want to\nstop our conversation.\" 'Abdu'r-Rahman said, \"I will not sit with those\npeople, Amir al-Mu'minin.\" 'Umar said, \"Sit with so-and-so and so-and-so\nand do not stop our conversation. Then he asked the Ansari, \"Who do you\nthink should be the khalif after me?\" The Ansari counted off some men among\nthe Muhajirun, but did not mentioned 'Ali. 'Umar asked, \"What do they have\nagainst Abu'l-Hasan (i.e. 'Ali)? By Allah, if he were in charge of them,\nhe would be the best suited to set them on the Path of the Truth.\""}},{"id":46,"idInBook":46,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ‏:‏ حَدَّثَنَا أَبُو هِلاَلٍ، قَالَ‏:‏ حَدَّثَنَا الْحَسَنُ، أَنَّ رَجُلاً تُوُفِّيَ وَتَرَكَ ابْنًا لَهُ وَمَوْلًى لَهُ، فَأَوْصَى مَوْلاَهُ بِابْنِهِ، فَلَمْ يَأْلُوهُ حَتَّى أَدْرَكَ وَزَوَّجَهُ، فَقَالَ لَهُ‏:‏ جَهَّزْنِي أَطْلُبِ الْعِلْمَ، فَجَهَّزَهُ، فَأَتَى عَالِمًا فَسَأَلَهُ، فَقَالَ‏:‏ إِذَا أَرَدْتَ أَنْ تَنْطَلِقَ فَقُلْ لِي أُعَلِّمْكَ، فَقَالَ‏:‏ حَضَرَ مِنِّي الْخُرُوجُ فَعَلِّمْنِي، فَقَالَ‏:‏ اتَّقِ اللَّهَ وَاصْبِرْ، وَلاَ تَسْتَعْجِلْ‏.‏ قَالَ الْحَسَنُ‏:‏ فِي هَذَا الْخَيْرُ كُلُّهُ، فَجَاءَ وَلاَ يَكَادُ يَنْسَاهُنَّ، إِنَّمَا هُنَّ ثَلاَثٌ، فَلَمَّا جَاءَ أَهْلَهُ نَزَلَ عَنْ رَاحِلَتِهِ، فَلَمَّا نَزَلَ الدَّارَ إِذَا هُوَ بِرَجُلٍ نَائِمٍ مُتَرَاخٍ عَنِ الْمَرْأَةِ، وَإِذَا امْرَأَتُهُ نَائِمَةٌ، قَالَ‏:‏ وَاللَّهِ مَا أُرِيدُ مَا أَنْتَظِرُ بِهَذَا‏؟‏ فَرَجَعَ إِلَى رَاحِلَتِهِ، فَلَمَّا أَرَادَ أَنْ يَأْخُذَ السَّيْفَ قَالَ‏:‏ اتَّقِ اللَّهَ وَاصْبِرْ، وَلاَ تَسْتَعْجِلْ‏.‏ فَرَجَعَ، فَلَمَّا قَامَ عَلَى رَأْسِهِ قَالَ‏:‏ مَا أَنْتَظِرُ بِهَذَا شَيْئًا، فَرَجَعَ إِلَى رَاحِلَتِهِ، فَلَمَّا أَرَادَ أَنْ يَأْخُذَ سَيْفَهُ ذَكَرَهُ، فَرَجَعَ إِلَيْهِ، فَلَمَّا قَامَ عَلَى رَأْسِهِ اسْتَيْقَظَ الرَّجُلُ، فَلَمَّا رَآهُ وَثَبَ إِلَيْهِ فَعَانَقَهُ وَقَبَّلَهُ، وَسَاءَلَهُ قَالَ‏:‏ مَا أَصَبْتَ بَعْدِي‏؟‏ قَالَ‏:‏ أَصَبْتُ وَاللَّهِ بَعْدَكَ خَيْرًا كَثِيرًا، أَصَبْتُ وَاللَّهِ بَعْدَكَ‏:‏ أَنِّي مَشَيْتُ اللَّيْلَةَ بَيْنَ السَّيْفِ وَبَيْنَ رَأْسِكَ ثَلاَثَ مِرَارٍ، فَحَجَزَنِي مَا أَصَبْتُ مِنَ الْعِلْمِ عَنْ قَتْلِكَ‏.‏","english":{"narrator":"","text":"Al-Hasan related that a man died and left a son and a mawla. He\nappointed the mawla as his son's guardian. This was not remiss and continued\nto look after the lad until he came of age an then he found him a wife.\nThen the boy said to him, \"Equip me so that I can seek for knowledge.\"\nHe fitted him out. The boy then went to a man of knowledge and asked him\nto teach him. The man said, \"Tell me when you want to leave and I will\nteach you.\" The boy said, \"I feel should leave, so instruct me.\" The scholar\nsaid, \"Have taqwa of Allah. Have patience. Do not be hasty.\" Al-Hasan remarked\nthat this contains all good."}},{"id":47,"idInBook":47,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا أَبُو مَعْمَرٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْوَارِثِ، قَالَ‏:‏ حَدَّثَنَا يُونُسُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرَةَ، عَنْ أَشَجِّ عَبْدِ الْقَيْسِ قَالَ‏:‏ قَالَ لِيَ النَّبِيُّ صلى الله عليه وسلم‏:‏ إِنَّ فِيكَ لَخُلُقَيْنِ يُحِبُّهُمَا اللَّهُ، قُلْتُ‏:‏ وَمَا هُمَا يَا رَسُولَ اللهِ‏؟‏ قَالَ‏:‏ الْحِلْمُ وَالْحَيَاءُ، قُلْتُ‏:‏ قَدِيمًا كَانَ أَوْ حَدِيثًا‏؟‏ قَالَ‏:‏ قَدِيمًا، قُلْتُ‏:‏ الْحَمْدُ لِلَّهِ الَّذِي جَبَلَنِي عَلَى خُلُقَيْنِ أَحَبَّهُمَا اللَّهُ‏.‏","english":{"narrator":"","text":"Ashajj 'Abdu'l-Qays said, \"The Prophet, may Allah bless him and\ngrant him peace, said to me, 'You have two qualities which Allah loves.'\nI asked, 'What are they, may Allah bless him and grant him peace,?' He\nsaid, 'Forbearance and modesty.' I asked, 'Have I had them for a long time\nor are they new?' He replied, 'You have had them for a long time.' I said,\n'Praise be to Allah who fashioned me with two qualities which Allah loves!'\""}},{"id":48,"idInBook":48,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ أَبِي هَاشِمٍ، قَالَ‏:‏ حَدَّثَنَا إِسْمَاعِيلُ، قَالَ‏:‏ حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، قَالَ‏:‏ حَدَّثَنَا مَنْ لَقِيَ الْوَفْدَ الَّذِينَ قَدِمُوا عَلَى النَّبِيِّ صلى الله عليه وسلم مِنْ عَبْدِ الْقَيْسِ، وَذَكَرَ قَتَادَةُ أَبَا نَضْرَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ‏:‏ قَالَ النَّبِيُّ صلى الله عليه وسلم لأَشَجِّ عَبْدِ الْقَيْسِ‏:‏ إِنَّ فِيكَ لَخَصْلَتَيْنِ يُحِبُّهُمَا اللَّهُ‏:‏ الْحِلْمُ وَالأَنَاةُ‏.‏","english":{"narrator":"","text":"(As hadith above)"}},{"id":49,"idInBook":49,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ عَبْدِ الْوَهَّابِ، قَالَ‏:‏ أَخْبَرَنَا بِشْرُ بْنُ الْمُفَضَّلِ، قَالَ‏:‏ حَدَّثَنَا قُرَّةُ، عَنْ أَبِي جَمْرَةَ، عَنِ ابْنِ عَبَّاسٍ قَالَ‏:‏ قَالَ النَّبِيُّ صلى الله عليه وسلم لِلأَشَجِّ أَشَجِّ عَبْدِ الْقَيْسِ‏:‏ إِنَّ فِيكَ لَخَصْلَتَيْنِ يُحِبُّهُمَا اللَّهُ‏:‏ الْحِلْمُ وَالأنَاةُ‏.‏","english":{"narrator":"","text":"(As hadith above)"}},{"id":50,"idInBook":50,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا قَيْسُ بْنُ حَفْصٍ، قَالَ‏:‏ حَدَّثَنَا طَالِبُ بْنُ حُجَيْرٍ الْعَبْدِيُّ قَالَ‏:‏ حَدَّثَنِي هُودُ بْنُ عَبْدِ اللهِ بْنِ سَعْدٍ، سَمِعَ جَدَّهُ مَزِيدَةَ الْعَبْدِيَّ قَالَ‏:‏ جَاءَ الأَشَجُّ يَمْشِي حَتَّى أَخَذَ بِيَدِ النَّبِيِّ صلى الله عليه وسلم فَقَبَّلَهَا، فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم‏:‏ أَمَا إِنَّ فِيكَ لَخُلُقَيْنِ يُحِبُّهُمَا اللَّهُ وَرَسُولُهُ، قَالَ‏:‏ جَبْلاً جُبِلْتُ عَلَيْهِ، أَوْ خُلِقَا مَعِي‏؟‏ قَالَ‏:‏ لاَ، بَلْ جَبْلاً جُبِلْتَ عَلَيْهِ، قَالَ‏:‏ الْحَمْدُ لِلَّهِ الَّذِي جَبَلَنِي عَلَى مَا يُحِبُّ اللَّهُ وَرَسُولُهُ‏.‏","english":{"narrator":"","text":"Mazida al-'Abdi said, \"Ashajj came and took the hand of the Prophet,\nmay Allah bless him and grant him peace, and kissed it. The Prophet, may\nAllah bless him and grant him peace, told him, 'You have two qualities\nwhich Allah and His Messenger love.' He asked, 'Was I born with them or\nare they characteristics which I have acquired?' He said, 'No, they are\npart of the natural character on which you were formed.' Ashajj said, 'Praise\nbelongs to Allah who has created me with what Allah an His Messenger love!'\""}},{"id":51,"idInBook":51,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ‏:‏ حَدَّثَنَا فِطْرٌ، عَنْ أَبِي يَحْيَى قَالَ‏:‏ سَمِعْتُ مُجَاهِدًا، عَنِ ابْنِ عَبَّاسٍ قَالَ‏:‏ لَوْ أَنَّ جَبَلاً بَغَى عَلَى جَبَلٍ لَدُكَّ الْبَاغِي‏.‏","english":{"narrator":"","text":"Ibn 'Abbas said, \"If one mountain had acted tyrannically towards\nanother mountain, the aggressor would have been pulverised.\""}},{"id":52,"idInBook":52,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، قَالَ‏:‏ أَخْبَرَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم قَالَ‏:‏ احْتَجَّتِ النَّارُ وَالْجَنَّةُ، فَقَالَتِ النَّارُ‏:‏ يَدْخُلُنِي الْمُتَكَبِّرُونَ وَالْمُتَجَبِّرُونَ‏.‏ وَقَالَتِ الْجَنَّةُ‏:‏ لاَ يَدْخُلُنِي إِلاَّ الضُّعَفَاءُ الْمَسَاكِينُ‏.‏ فَقَالَ لِلنَّارِ‏:‏ أَنْتِ عَذَابِي، أَنْتَقِمُ بِكِ مِمَّنْ شِئْتُ، وَقَالَ لِلْجَنَّةِ‏:‏ أَنْتِ رَحْمَتِي أَرْحَمُ بِكِ مَنْ شِئْتُ‏.‏","english":{"narrator":"","text":"See hadith 554."}},{"id":53,"idInBook":53,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا عُثْمَانُ بْنُ صَالِحٍ، قَالَ‏:‏ أَخْبَرَنَا عَبْدُ اللهِ بْنُ وَهْبٍ، قَالَ‏:‏ حَدَّثَنَا أَبُو هَانِئٍ الْخَوْلاَنِيُّ، عَنْ أَبِي عَلِيٍّ الْجَنْبِيِّ، عَنْ فَضَالَةَ بْنِ عُبَيْدٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ ثَلاَثَةٌ لاَ يُسْأَلُ عَنْهُمْ‏:‏ رَجُلٌ فَارَقَ الْجَمَاعَةَ وَعَصَى إِمَامَهُ فَمَاتَ عَاصِيًا، فَلاَ تَسْأَلْ عَنْهُ، وَأَمَةٌ أَوْ عَبْدٌ أَبِقَ مِنْ سَيِّدِهِ، وَامْرَأَةٌ غَابَ زَوْجُهَا، وَكَفَاهَا مَؤُونَةَ الدُّنْيَا فَتَبَرَّجَتْ وَتَمَرَّجَتْ بَعْدَهُ‏.‏ وَثَلاَثَةٌ لاَ يُسْأَلُ عَنْهُمْ‏:‏ رَجُلٌ نَازَعَ اللَّهَ رِدَاءَهُ، فَإِنَّ رِدَاءَهُ الْكِبْرِيَاءُ، وَإِزَارَهُ عِزَّهُ، وَرَجُلٌ شَكَّ فِي أَمْرِ اللهِ، وَالْقُنُوطُ مِنْ رَحْمَةِ اللهِ‏.‏","english":{"narrator":"Fadala ibn 'Ubayd reported that the Prophet, may Allah bless him\nand grant him peace, said, \"Do not ask about three:","text":"a man who parts company\nwith the community, rebels the ruler and dies while he is a still a rebel.\nDo not ask about him. Or a slave or slavegirl who runs away from his master.\nOr a woman whose husband is absent and who has sufficient provision and\nthen displays her adornments to strangers and mixes freely. Do not ask\nabout three: a man who contends with Allah regarding His cloak. His cloak\nis pride and His wrapper is His might. Also a man who doubts the command\nof Allah. and someone who despairs of Allah's mercy.\""}},{"id":54,"idInBook":54,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا حَامِدُ بْنُ عُمَرَ، قَالَ‏:‏ حَدَّثَنَا بَكَّارُ بْنُ عَبْدِ الْعَزِيزِ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ كُلُّ ذُنُوبٍ يُؤَخِّرُ اللَّهُ مِنْهَا مَا شَاءَ إِلَى يَوْمِ الْقِيَامَةِ، إِلاَّ الْبَغْيَ، وَعُقُوقَ الْوَالِدَيْنِ، أَوْ قَطِيعَةَ الرَّحِمِ، يُعَجِّلُ لِصَاحِبِهَا فِي الدُّنْيَا قَبْلَ الْمَوْتِ‏.‏","english":{"narrator":"","text":"Bakkar ibn 'Abdu'l-'Aziz reported from his grandfather that the\nProphet, may Allah bless him and grant him peace, said, \"Allah will defer\nwhatever wrong actions He wills until the Day of Rising except for tyrannical\nbehaviour, disobeying parents or cutting off relatives. He will punish\nthe one who commits those things in this world before he dies.\""}},{"id":55,"idInBook":55,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدِ بْنِ مَيْمُونٍ، قَالَ‏:‏ حَدَّثَنَا مِسْكِينُ بْنُ بُكَيْرٍ الْحَذَّاءُ الْحَرَّانِيُّ، عَنْ جَعْفَرِ بْنِ بُرْقَانَ، عَنْ يَزِيدَ بْنِ الأَصَمِّ قَالَ‏:‏ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُ‏:‏ يُبْصِرُ أَحَدُكُمُ الْقَذَاةَ فِي عَيْنِ أَخِيهِ، وَيَنْسَى الْجِذْلَ، أَوِ الْجِذْعَ، فِي عَيْنِ نَفْسِهِ‏.‏","english":{"narrator":"","text":"Abu Hurayra said, \"One of you looks at the mote in his brother's\neye while forgetting the stump in his own eye.\""}},{"id":56,"idInBook":56,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا الْخَلِيلُ بْنُ أَحْمَدَ، قَالَ‏:‏ حَدَّثَنَا الْمُسْتَنِيرُ بْنُ أَخْضَرَ قَالَ‏:‏ حَدَّثَنِي مُعَاوِيَةُ بْنُ قُرَّةَ قَالَ‏:‏ كُنْتُ مَعَ مَعْقِلٍ الْمُزَنِيِّ، فَأَمَاطَ أَذًى عَنِ الطَّرِيقِ، فَرَأَيْتُ شَيْئًا فَبَادَرْتُهُ، فَقَالَ‏:‏ مَا حَمَلَكَ عَلَى مَا صَنَعْتَ يَا ابْنَ أَخِي‏؟‏ قَالَ‏:‏ رَأَيْتُكَ تَصْنَعُ شَيْئًا فَصَنَعْتُهُ، قَالَ‏:‏ أَحْسَنْتَ يَا ابْنَ أَخِي، سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ‏:‏ مَنْ أَمَاطَ أَذًى عَنْ طَرِيقِ الْمُسْلِمِينَ كُتِبَ لَهُ حَسَنَةٌ، وَمَنْ تُقُبِّلَتْ لَهُ حَسَنَةٌ دَخَلَ الْجَنَّةَ‏.‏","english":{"narrator":"","text":"Mu'awiya ibn Qurra said, \"I was with Ma'qil al-Muzn when he removed\nsomething harmful from the road. Then I saw something and went over to\nit. He asked. 'What made you do that, nephew?' He replied, 'I saw you do\nsomething, so I did it.' He said, 'Nephew, you have done well. I heard\nthe Prophet, may Allah bless him and grant him peace, say, \"Whoever removes\nsomething harmful from the road of the Muslims has a good deed written\nfor him. Anyone who has his good deed accepted will enter the Garden.\"'\""}},{"id":57,"idInBook":57,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا عَمْرُو بْنُ خَالِدٍ، قَالَ‏:‏ حَدَّثَنَا ضِمَامُ بْنُ إِسْمَاعِيلَ قَالَ‏:‏ سَمِعْتُ مُوسَى بْنَ وَرْدَانَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم يَقُولُ‏:‏ تَهَادُوا تَحَابُّوا‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"Give gifts and you will love one another.\""}},{"id":58,"idInBook":58,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى، قَالَ‏:‏ حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ، عَنْ ثَابِتٍ قَالَ‏:‏ كَانَ أَنَسٌ يَقُولُ‏:‏ يَا بَنِيَّ، تَبَاذَلُوا بَيْنَكُمْ، فَإِنَّهُ أَوَدُّ لِمَا بَيْنَكُمْ‏.‏","english":{"narrator":"","text":"Anas said to his son, Thabit, \"My son, exchange gifts, it will\nbring\nabout love between you.\""}},{"id":59,"idInBook":59,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ خَالِدٍ، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاقَ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ أَهْدَى رَجُلٌ مِنْ بَنِي فَزَارَةَ لِلنَّبِيِّ صلى الله عليه وسلم نَاقَةً، فَعَوَّضَهُ، فَتَسَخَّطَهُ، فَسَمِعْتُ النَّبِيَّ صلى الله عليه وسلم عَلَى الْمِنْبَرِ يَقُولُ‏:‏ يَهْدِي أَحَدُهُمْ فَأُعَوِّضُهُ بِقَدْرِ مَا عِنْدِي، ثُمَّ يَسْخَطُهُ وَايْمُ اللهِ، لاَ أَقْبَلُ بَعْدَ عَامِي هَذَا مِنَ الْعَرَبِ هَدِيَّةً إِلاَّ مِنْ قُرَشِيٍّ، أَوْ أَنْصَارِيٍّ، أَوْ ثَقَفِيٍّ، أَوْ دَوْسِيٍّ‏.‏","english":{"narrator":"","text":"Abu Hurayra said, \"A man from the Banu Fazara gave a camel tot\nhe Prophet, may Allah bless him and grant him peace, and he gave him something\nin exchange for it. That angered the man and I heard the Prophet, may Allah\nbless him and grant him peace, state on the minbar, 'One of you gives a\ngift and when I give him something in exchange he becomes angry. By Allah,\nafter this year, I will never accept a gift from any Arab except for Quraysh,\nthe Ansar, a Thaqifi or a Dawsi!'\""}},{"id":60,"idInBook":60,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، قَالَ‏:‏ حَدَّثَنَا زُهَيْرٌ، قَالَ‏:‏ حَدَّثَنَا مَنْصُورٌ، عَنْ رِبْعِيِّ بْنِ حِرَاشٍ، قَالَ‏:‏ حَدَّثَنَا أَبُو مَسْعُودٍ عُقْبَةُ قَالَ‏:‏ قَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ إِنَّ مِمَّا أَدْرَكَ النَّاسَ مِنْ كَلاَمِ النُّبُوَّةِ‏:‏ إِذَا لَمْ تَسْتَحِ فَاصْنَعْ مَا شِئْتَ‏.‏","english":{"narrator":"Abu Mas'ud 'Uqba reported that the Prophet, may Allah bless him\nand grant him peace, said, \"Part of what people have learned from the words\nof prophethood is the statement:","text":"'If you do not feel ashamed, do whatever\nyou like.\""}},{"id":61,"idInBook":61,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، قَالَ‏:‏ أَخْبَرَنَا سُفْيَانُ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ عَبْدِ اللهِ بْنِ دِينَارٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ الإِيمَانُ بِضْعٌ وَسِتُّونَ، أَوْ بِضْعٌ وَسَبْعُونَ، شُعْبَةً، أَفْضَلُهَا لاَ إِلَهَ إِلاَّ اللَّهُ، وَأَدْنَاهَا إِمَاطَةُ الأَذَى عَنِ الطَّرِيقِ، وَالْحَيَاءُ شُعْبَةٌ مِنَ الإيمَانِ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"Faith consists of sixty (or seventy) branches.\nThe best of them is 'There is no god but Allah.' The lowest of them is\nto remove harmful things from the road. Modesty is also a branch of faith.\""}},{"id":62,"idInBook":62,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ الْجَعْدِ، قَالَ‏:‏ أَخْبَرَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ عَبْدِ اللهِ بْنِ عُبَيْدِ اللهِ مَوْلَى أَنَسٍ قَالَ‏:‏ سَمِعْتُ أَبَا سَعِيدٍ قَالَ‏:‏ كَانَ النَّبِيُّ صلى الله عليه وسلم أَشَدَّ حَيَاءً مِنَ الْعَذْرَاءِ فِي خِدْرِهَا، وَكَانَ إِذَا كَرِهَ شَيْئًا عَرَفْنَاهُ فِي وَجْهِهِ‏.‏","english":{"narrator":"","text":"Abu Sa'id said, \"The Prophet, may Allah bless him and grant him\npeace, had more modesty than a virgin in her tent. When he disliked something,\nthat could be seen in his face.\""}},{"id":63,"idInBook":63,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللهِ، قَالَ‏:‏ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ قَالَ‏:‏ أَخْبَرَنِي يَحْيَى بْنُ سَعِيدِ بْنِ الْعَاصِ، أَنَّ سَعِيدَ بْنَ الْعَاصِ أَخْبَرَهُ، أَنَّ عُثْمَانَ وَعَائِشَةَ، حَدَّثَاهُ، أَنَّ أَبَا بَكْرٍ اسْتَأْذَنَ عَلَى رَسُولِ اللهِ صلى الله عليه وسلم، وَهُوَ مُضْطَجِعٌ عَلَى فِرَاشِ عَائِشَةَ لاَبِسًا مِرْطَ عَائِشَةَ، فَأَذِنَ لأَبِي بَكْرٍ وَهُوَ كَذَلِكَ، فَقَضَى إِلَيْهِ حَاجَتَهُ، ثُمَّ انْصَرَفَ‏.‏ ثُمَّ اسْتَأْذَنَ عُمَرُ رَضِيَ اللَّهُ عَنْهُ، فَأَذِنَ لَهُ وَهُوَ كَذَلِكَ، فَقَضَى إِلَيْهِ حَاجَتَهُ، ثُمَّ انْصَرَفَ‏.‏ قَالَ عُثْمَانُ‏:‏ ثُمَّ اسْتَأْذَنْتُ عَلَيْهِ، فَجَلَسَ وَقَالَ لِعَائِشَةَ‏:‏ اجْمَعِي إِلَيْكِ ثِيَابَكِ، قَالَ‏:‏ فَقَضَيْتُ إِلَيْهِ حَاجَتِي، ثُمَّ انْصَرَفْتُ، قَالَ‏:‏ فَقَالَتْ عَائِشَةُ‏:‏ يَا رَسُولَ اللهِ، لَمْ أَرَكَ فَزِعْتَ لأَبِي بَكْرٍ وَعُمَرَ رَضِيَ اللَّهُ عَنْهُمَا كَمَا فَزِعْتَ لِعُثْمَانَ‏؟‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ إِنَّ عُثْمَانَ رَجُلٌ حَيِيٌّ، وَإِنِّي خَشِيتُ إِنْ أَذِنْتُ لَهُ، وَأَنَا عَلَى تِلْكَ الْحَالِ، أَنْ لاَ يَبْلُغَ إِلَيَّ فِي حَاجَتِهِ‏.‏","english":{"narrator":"","text":"Sa'id ibn al-'As reported that 'Uthman and 'A'isha told him that\nAbu Bakr asked for permission to come in to the Messenger of Allah, may\nAllah bless him and grant him peace, while he was lying of 'A'isha's bed,\nwearing 'A'isha's woollen shirt. He gave Abu Bakr permission to enter while\nhe was like that. he gave him what he needed and then Abu Bakr left. Then\n'Umar, may Allah be pleased with him, asked for permission to come in and\nhe gave him permission to come in while he was like that. He gave him what\nhe needed and then 'Umar left. 'Uthman said, \"Then I asked for permission\nto come in and he sat up and told 'A'isha, 'Take your garment.' I told\nhim what I needed and then I left.' 'A'isha asked, 'Messenger of Allah,\nwhy did I see that you did not do for Abu Bakr and 'Umar what you did for\n'Uthman?' The Messenger of Allah, may Allah bless him and grant him peace,\nsaid, ''Uthman is a modest man and I feared that if I gave him permission\nto come in while I was in that state he would not tell me what he needed.'\""}},{"id":64,"idInBook":64,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، عَنْ مَعْمَرٍ، عَنْ ثَابِتٍ الْبُنَانِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ مَا كَانَ الْحَيَاءُ فِي شَيْءٍ إِلاَّ زَانَهُ، وَلاَ كَانَ الْفُحْشُ فِي شَيْءٍ إِلا شَانَهُ‏.‏","english":{"narrator":"","text":"Anas ibn Malik reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"Whenever there is modesty in a thing, it adorns\nit. Whenever there is outrage in a thing, it debases it.\""}},{"id":65,"idInBook":65,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ قَالَ‏:‏ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم مَرَّ بِرَجُلٍ يَعِظُ أَخَاهُ فِي الْحَيَاءِ، فَقَالَ‏:‏ دَعْهُ، فَإِنَّ الْحَيَاءَ مِنَ الإيمَانِ‏.‏- حَدَّثَنَا عَبْدُ اللهِ قَالَ‏:‏ حَدَّثَنِي عَبْدُ الْعَزِيزِ بْنُ أَبِي سَلَمَةَ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمٍ، عَنِ ابْنِ عُمَرَ قَالَ‏:‏ مَرَّ النَّبِيُّ صلى الله عليه وسلم عَلَى رَجُلٍ يُعَاتِبُ أَخَاهُ فِي الْحَيَاءِ، كَأَنَّهُ يَقُولُ‏:‏ أَضَرَّ بِكَ، فَقَالَ‏:‏ دَعْهُ، فَإِنَّ الْحَيَاءَ مِنَ الإِيمَانِ‏.‏","english":{"narrator":"","text":"Salim reported from his father that the Messenger of Allah, may\nAllah bless him and grant him peace, passed by a man who berating his brother\nabout his modesty. He told him, \"Let him be. Modesty is part of faith.\""}},{"id":66,"idInBook":66,"chapterId":30,"bookId":15,"arabic":"حَدَّثَنَا أَبُو الرَّبِيعِ قَالَ‏:‏ حَدَّثَنِي إِسْمَاعِيلُ قَالَ‏:‏ حَدَّثَنِي مُحَمَّدُ بْنُ أَبِي حَرْمَلَةَ، عَنْ عَطَاءٍ وَسُلَيْمَانَ ابْنَيْ يَسَارٍ، وَأَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّ عَائِشَةَ قَالَتْ‏:‏ كَانَ النَّبِيُّ صلى الله عليه وسلم مُضْطَجِعًا فِي بَيْتِي، كَاشِفًا عَنْ فَخِذِهِ أَوْ سَاقَيْهِ، فَاسْتَأْذَنَ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ، فَأَذِنَ لَهُ كَذَلِكَ، فَتَحَدَّثَ‏.‏ ثُمَّ اسْتَأْذَنَ عُمَرُ رَضِيَ اللَّهُ عَنْهُ، فَأَذِنَ لَهُ كَذَلِكَ، ثُمَّ تَحَدَّثَ‏.‏ ثُمَّ اسْتَأْذَنَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ، فَجَلَسَ النَّبِيُّ صلى الله عليه وسلم وَسَوَّى ثِيَابَهُ، قَالَ مُحَمَّدٌ‏:‏ وَلاَ أَقُولُ فِي يَوْمٍ وَاحِدٍ، فَدَخَلَ فَتَحَدَّثَ، فَلَمَّا خَرَجَ قَالَ‏:‏ قُلْتُ‏:‏ يَا رَسُولَ اللهِ، دَخَلَ أَبُو بَكْرٍ فَلَمْ تَهَشَّ وَلَمْ تُبَالِهِ، ثُمَّ دَخَلَ عُمَرُ فَلَمْ تَهَشَّ وَلَمْ تُبَالِهِ، ثُمَّ دَخَلَ عُثْمَانُ فَجَلَسْتَ وَسَوَّيْتَ ثِيَابَكَ‏؟‏ قَالَ‏:‏ أَلاَ أَسْتَحِي مِنْ رَجُلٍ تَسْتَحِي مِنْهُ الْمَلاَئِكَةُ‏؟‏‏.‏","english":{"narrator":"","text":"'A'isha said, \"The Prophet was lying down in my room with his thigh\nuncovered when Abu Bakr asked for permission to enter. He gave him permission\nto enter, remaining as he was. Then 'Umar asked for permission to come\nin and he gave him permission, remaining as he was. Then 'Uthman asked\nfor permission to enter and the Prophet, may Allah bless him and grant\nhim peace, sat up and arranged his garment, and then he came in and spoke.\nWhen he left, I said, 'Messenger of Allah, Abu Bakr came in and you did\nnot exert yourself nor concern yourself with him. Then 'Umar came in and\nyou did not exert yourself nor concern yourself with him. Then 'Uthman came\nin and you sat up and arranged your garment.' He said, 'Should I not be\nmodest before a man before whom the angels are modest?'\""}}],"chapter":{"id":30,"bookId":15,"arabic":"كتاب التصرف العام","english":"General Behavior"}}