{"metadata":{"length":135,"arabic":{"title":"الأدب المفرد","author":"الإمام محمد بن إسماعيل البخاري","introduction":"كتاب الدعاء"},"english":{"title":"Al-Adab Al-Mufrad","author":"Imam Muhammad ibn Ismail al-Bukhari","introduction":"Supplication"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى، قَالَ‏:‏ حَدَّثَنَا أَبُو عَوَانَةَ، قَالَ‏:‏ حَدَّثَنَا عُمَرُ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا أَصْبَحَ قَالَ‏:‏ أَصْبَحْنَا وَأَصْبَحَ الْحَمْدُ كُلُّهُ لِلَّهِ، لاَ شَرِيكَ لَهُ، لاَ إِلَهَ إِلاَّ اللَّهُ، وَإِلَيْهِ النُّشُورُ، وَإِذَا أَمْسَى قَالَ‏:‏ أَمْسَيْنَا وَأَمْسَى الْمُلْكُ لِلَّهِ، وَالْحَمْدُ كُلُّهُ لِلَّهِ، لاَ شَرِيكَ لَهُ، لاَ إِلَهَ إِلاَّ اللَّهُ، وَإِلَيْهِ الْمَصِيرُ‏.‏","english":{"narrator":"","text":"Abu Hurayra said, \"The Prophet, may Allah bless him and grant him\npeace, would say in the morning, 'We have reached the morning and the kingdom\nbelongs to Allah and all praise belongs to has no partner. There is no\ngod but Allah and to Him is the gathering.' In the evening he would say,\n'We have reached the evening and the kingdom belongs to Allah and all praise\nbelongs to Allah who has no partner. There is no god but Allah and to Him\nis the return.\""}},{"id":2,"idInBook":2,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، قَالَ‏:‏ أَخْبَرَنَا عَبْدَةُ، قَالَ‏:‏ أَخْبَرَنَا مُحَمَّدُ بْنُ عَمْرٍو، قَالَ‏:‏ حَدَّثَنَا أَبُو سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ إِنَّ الْكَرِيمَ ابْنَ الْكَرِيمِ ابْنِ الْكَرِيمِ ابْنِ الْكَرِيمِ، يُوسُفُ بْنُ يَعْقُوبَ بْنِ إِسْحَاقَ بْنِ إِبْرَاهِيمَ خَلِيلِ الرَّحْمَنِ تَبَارَكَ وَتَعَالَى، قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ لَوْ لَبِثْتُ فِي السِّجْنِ مَا لَبِثَ يُوسُفُ، ثُمَّ جَاءَنِي الدَّاعِي لَأَجَبْتُ، إِذْ جَاءَهُ الرَّسُولُ فَقَالَ‏:‏ ‏{‏ارْجِعْ إِلَى رَبِّكَ فَاسْأَلْهُ مَا بَالُ النِّسْوَةِ اللاَّتِي قَطَّعْنَ أَيْدِيَهُنَّ‏}‏، وَرَحْمَةُ اللهِ عَلَى لُوطٍ، إِنْ كَانَ لَيَأْوِي إِلَى رُكْنٍ شَدِيدٍ، إِذْ قَالَ لِقَوْمِهِ‏:‏ ‏{‏لَوْ أَنَّ لِي بِكُمْ قُوَّةً أَوْ آوِي إِلَى رُكْنٍ شَدِيدٍ‏}‏، فَمَا بَعَثَ اللَّهُ بَعْدَهُ مِنْ نَبِيٍّ إِلاَّ فِي ثَرْوَةٍ مِنْ قَوْمِهِ قَالَ مُحَمَّدٌ‏:‏ الثَّرْوَةُ‏:‏ الْكَثْرَةُ وَالْمَنَعَةُ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"The noble son of the noble son of the noble\nson of the noble son was Yusuf son of Ya'qub son of Ishaq son of Ibrahim,\nthe Khalil (close friend) of the Merciful, the blessed and Exalted.\" The\nMessenger of Allah, may Allah bless him and grant him peace, said, \"If\nI had remained in prison for as long as Yusuf remained in prison and then\nthe man with the invitation had come to me, I would have accepted it. When\nthe messenger came to him, he said, 'Go back to your master and enquire\nof him what happened about the women who cut their hands.' (12:50)\nAllah showed mercy to Lut when he sought refuge in a strong pillar when\nhe said to his people, 'If only I had the strength to combat you or\ncould seek refuge in a some powerful support!' (11:80) Allah did not\nsend any Prophet after him but that he was one of the wealthy of his people.\""}},{"id":3,"idInBook":3,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، قَالَ‏:‏ حَدَّثَنَا أَبِي، قَالَ‏:‏ حَدَّثَنَا الأَعْمَشُ قَالَ‏:‏ حَدَّثَنِي مَالِكُ بْنُ الْحَارِثِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ قَالَ‏:‏ كَانَ الرَّبِيعُ يَأْتِي عَلْقَمَةَ يَوْمَ الْجُمُعَةِ، فَإِذَا لَمْ أَكُنْ ثَمَّةَ أَرْسَلُوا إِلَيَّ، فَجَاءَ مَرَّةً وَلَسْتُ ثَمَّةَ، فَلَقِيَنِي عَلْقَمَةُ وَقَالَ لِي‏:‏ أَلَمْ تَرَ مَا جَاءَ بِهِ الرَّبِيعُ‏؟‏ قَالَ‏:‏ أَلَمْ تَرَ أَكْثَرَ مَا يَدْعُو النَّاسَ، وَمَا أَقَلَّ إِجَابَتَهُمْ‏؟‏ وَذَلِكَ أَنَّ اللَّهَ عَزَّ وَجَلَّ لاَ يَقْبَلُ إِلاَّ النَّاخِلَةَ مِنَ الدُّعَاءِ، قُلْتُ‏:‏ أَوَ لَيْسَ قَدْ قَالَ ذَلِكَ عَبْدُ اللهِ‏؟‏ قَالَ‏:‏ وَمَا قَالَ‏؟‏ قَالَ‏:‏ قَالَ عَبْدُ اللهِ‏:‏ لاَ يَسْمَعُ اللَّهُ مِنْ مُسْمِعٍ، وَلاَ مُرَاءٍ، وَلا لاعِبٍ، إِلا دَاعٍ دَعَا يَثْبُتُ مِنْ قَلْبِهِ، قَالَ‏:‏ فَذَكَرَ عَلْقَمَةَ‏؟‏ قَالَ‏:‏ نَعَمْ‏.‏","english":{"narrator":"","text":"'Abdu'r-Rahman ibn Yazid said, \"Ar-Rabi' used to go to 'Alqama\nevery Friday. When I was not there, they would send for me. Once he came\nwhen I was not there. 'Alqama met me and told me, 'Did you not see what\nar-Rabi' brought? He said, \"Do you not see how frequently people make supplication\nand how rarely they are answered? That is because Allah Almighty only accepts\nthe sincere supplication.\"' I asked, 'Didn't 'Abdullah say that?' He asked,\n'What did he say?' I said that 'Abdullah said, 'Allah does not listen to\nsomeone who wants other people to hear not someone who shows off nor who\nplays. He only listens to the one who makes a supplication firmly from\nhis heart.' He said, 'Did he mention 'Alqama?' 'Yes' was the answer.\""}},{"id":4,"idInBook":4,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدِ اللهِ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، عَنِ الْعَلاَءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم قَالَ‏:‏ إِذَا دَعَا أَحَدُكُمْ فَلاَ يَقُولُ‏:‏ إِنْ شِئْتَ، وَلْيَعْزِمِ الْمَسْأَلَةَ، وَلْيُعَظِّمِ الرَّغْبَةَ، فَإِنَّ اللَّهَ لاَ يَعْظُمُ عَلَيْهِ شَيْءٌ أَعْطَاهُ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"When one of you makes a supplication, he\nshould not say, 'If you wish.' He should be firm in asking and he should\nhave great hope. Allah does not think that anything that He gives is too\ngreat.'\""}},{"id":5,"idInBook":5,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، قَالَ‏:‏ أَخْبَرَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، عَنْ أَنَسٍ قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ إِذَا دَعَا أَحَدُكُمْ فَلْيَعْزِمْ فِي الدُّعَاءِ، وَلاَ يَقُلِ‏:‏ اللَّهُمَّ إِنْ شِئْتَ فَأَعْطِنِي، فَإِنَّ اللَّهَ لاَ مُسْتَكْرِهَ لَهُ‏.‏","english":{"narrator":"","text":"Anas reported that the Messenger of Allah, may Allah bless him\nand grant him peace, said, \"When one of you makes a supplication, he should\nbe firm in the supplication and not say, 'O Allah, if you like, give to\nme.' Allah cannot be forced against His will.\""}},{"id":6,"idInBook":6,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ فُلَيْحٍ قَالَ‏:‏ أَخْبَرَنِي أَبِي، عَنْ أَبِي نُعَيْمٍ وَهُوَ وَهْبٌ قَالَ‏:‏ رَأَيْتُ ابْنَ عُمَرَ وَابْنَ الزُّبَيْرِ يَدْعُوَانِ، يُدِيرَانِ بِالرَّاحَتَيْنِ عَلَى الْوَجْهِ‏.‏","english":{"narrator":"","text":"Abu Nu'aym, who is Wahb, said, \"I saw Ibn 'Umar and Ibn az-Zubayr\nmaking supplication, cupping their palms in front of their faces.\""}},{"id":7,"idInBook":7,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ‏:‏ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ سِمَاكِ بْنِ حَرْبٍ، عَنْ عِكْرِمَةَ، عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا، زَعَمَ أَنَّهُ سَمِعَهُ مِنْهَا، أَنَّهَا رَأَتِ النَّبِيَّ صلى الله عليه وسلم يَدْعُو رَافِعًا يَدَيْهِ يَقُولُ‏:‏ إِنَّمَا أَنَا بَشَرٌ فَلاَ تُعَاقِبْنِي، أَيُّمَا رَجُلٌ مِنَ الْمُؤْمِنِينَ آذَيْتُهُ أَوْ شَتَمْتُهُ فَلاَ تُعَاقِبْنِي فِيهِ‏.‏","english":{"narrator":"","text":"'A'isha say that she saw the Prophet, may Allah bless him and grant\nhim peace, making supplication with his hands raised, saying, 'I am a man,\nso do not punish me. If I harm any man of the believers or revile him,\ndo not punish me for that.'\""}},{"id":8,"idInBook":8,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا عَلِيٌّ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، قَالَ‏:‏ حَدَّثَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ قَدِمَ الطُّفَيْلُ بْنُ عَمْرٍو الدَّوْسِيُّ عَلَى رَسُولِ اللهِ صلى الله عليه وسلم فَقَالَ‏:‏ يَا رَسُولَ اللهِ، إِنَّ دَوْسًا قَدْ عَصَتْ وَأَبَتْ، فَادْعُ اللَّهَ عَلَيْهَا، فَاسْتَقْبَلَ رَسُولُ اللهِ صلى الله عليه وسلم الْقِبْلَةَ وَرَفَعَ يَدَيْهِ، فَظَنَّ النَّاسُ أَنَّهُ يَدْعُو عَلَيْهِمْ، فَقَالَ‏:‏ اللَّهُمَّ اهْدِ دَوْسًا، وَائْتِ بِهِمْ‏.‏","english":{"narrator":"","text":"Abu Hurayra said, \"At-Tufayl ibn 'Amr ad-Dawsi came to the Messenger\nof Allah, may Allah bless him and grant him peace, and said, 'Messenger\nof Allah, Daws have rebelled and rejected, so ask Allah to curse them.'\nThe Messenger of Allah, may Allah bless him and grant him peace, faced\nthe qibla and raised his hands and the people thought that he was going\nto curse them. He said, 'O Allah, guide Daws and lead them.'\""}},{"id":9,"idInBook":9,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، قَالَ‏:‏ أَخْبَرَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ قَالَ‏:‏ قَحَطَ الْمَطَرُ عَامًا، فَقَامَ بَعْضُ الْمُسْلِمِينَ إِلَى النَّبِيِّ صلى الله عليه وسلم يَوْمَ الْجُمُعَةِ، فَقَالَ‏:‏ يَا رَسُولَ اللهِ، قَحَطَ الْمَطَرُ، وَأَجْدَبَتِ الأَرْضُ، وَهَلَكَ الْمَالُ‏.‏ فَرَفَعَ يَدَيْهِ، وَمَا يُرَى فِي السَّمَاءِ مِنْ سَحَابَةٍ، فَمَدَّ يَدَيْهِ حَتَّى رَأَيْتُ بَيَاضَ إِبْطَيْهِ يَسْتَسْقِي اللَّهَ، فَمَا صَلَّيْنَا الْجُمُعَةَ حَتَّى أَهَمَّ الشَّابُّ الْقَرِيبُ الدَّارِ الرُّجُوعَ إِلَى أَهْلِهِ، فَدَامَتْ جُمُعَةٌ، فَلَمَّا كَانَتِ الْجُمُعَةُ الَّتِي تَلِيهَا، فَقَالَ‏:‏ يَا رَسُولَ اللهِ، تَهَدَّمَتِ الْبُيُوتُ، وَاحْتَبَسَ الرُّكْبَانُ‏.‏ فَتَبَسَّمَ لِسُرْعَةِ مَلاَلِ ابْنِ آدَمَ وَقَالَ بِيَدِهِ‏:‏ اللَّهُمَّ حَوَالَيْنَا، وَلاَ عَلَيْنَا، فَتَكَشَّطَتْ عَنِ الْمَدِينَةِ‏.‏","english":{"narrator":"","text":"Anas said, \"No rain fell for a year and so one of the Muslims went\nto the Prophet, may Allah bless him and grant him peace, on Jumu'a (Friday).\nHe said, 'Messenger of Allah, there has been no rain and the ground is\ndry and people's wealth has been destroyed.' He raised his hand when there\nwas not a cloud to be seen in the sky. He stretched out his arms until\nI could see the whiteness of his armpits and asked Allah for rain. As soon\nas we finished the prayer, (the rain was such that) the youth whose house\nwas near was afraid to return to his family. It last past Friday, The following\nFriday, they said, 'Messenger of Allah, the houses have fallen down and\nthe paths are blocked.' He smiled and observed how quickly the son of Adam\nbecomes discontented. He said while making a gesture with his hand, 'O\nAllah, around us and not on us.' And the rain cleared away from Madina.\""}},{"id":10,"idInBook":10,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا الصَّلْتُ، قَالَ‏:‏ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ سِمَاكٍ، عَنْ عِكْرِمَةَ، عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا، أَنَّهُ سَمِعَهُ مِنْهَا، أَنَّهَا رَأَتِ النَّبِيَّ صلى الله عليه وسلم يَدْعُو رَافِعًا يَدَيْهِ يَقُولُ‏:‏ اللَّهُمَّ إِنَّمَا أَنَا بَشَرٌ فَلاَ تُعَاقِبْنِي، أَيُّمَا رَجُلٌ مِنَ الْمُؤْمِنِينَ آذَيْتُهُ أَوْ شَتَمْتُهُ فَلا تُعَاقِبْنِي فِيهِ‏.‏","english":{"narrator":"","text":"'Ikrima heard 'A'isha, may Allah be pleased with her, say that\nshe saw the Prophet, may Allah bless him and grant him peace, raise his\nhands in supplication, saying, 'O Allah, I am only a man, so do not punish\nme. If I harm or revile a Muslim man, do not punish me for it!'\""}},{"id":11,"idInBook":11,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا عَارِمٌ، قَالَ‏:‏ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، قَالَ‏:‏ حَدَّثَنَا حَجَّاجٌ الصَّوَّافُ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ، أَنَّ الطُّفَيْلَ بْنَ عَمْرٍو قَالَ لِلنَّبِيِّ صلى الله عليه وسلم‏:‏ هَلْ لَكَ فِي حِصْنٍ وَمَنَعَةٍ، حِصْنِ دَوْسٍ‏؟‏ قَالَ‏:‏ فَأَبَى رَسُولُ اللهِ صلى الله عليه وسلم، لِمَا ذَخَرَ اللَّهُ لِلأَنْصَارِ، فَهَاجَرَ الطُّفَيْلُ، وَهَاجَرَ مَعَهُ رَجُلٌ مِنْ قَوْمِهِ، فَمَرِضَ الرَّجُلُ فَضَجِرَ أَوْ كَلِمَةٌ شَبِيهَةٌ بِهَا، فَحَبَا إِلَى قَرْنٍ، فَأَخَذَ مِشْقَصًا فَقَطَعَ وَدَجَيْهِ فَمَاتَ، فَرَآهُ الطُّفَيْلُ فِي الْمَنَامِ قَالَ‏:‏ مَا فُعِلَ بِكَ‏؟‏ قَالَ‏:‏ غُفِرَ لِي بِهِجْرَتِي إِلَى النَّبِيِّ صلى الله عليه وسلم، قَالَ‏:‏ مَا شَأْنُ يَدَيْكَ‏؟‏ قَالَ‏:‏ فَقِيلَ‏:‏ إِنَّا لاَ نُصْلِحُ مِنْكَ مَا أَفْسَدْتَ مِنْ يَدَيْكَ، قَالَ‏:‏ فَقَصَّهَا الطُّفَيْلُ عَلَى النَّبِيِّ صلى الله عليه وسلم، فَقَالَ‏:‏ اللَّهُمَّ وَلِيَدَيْهِ فَاغْفِرْ، وَرَفَعَ يَدَيْهِ‏.‏","english":{"narrator":"","text":"Jabir ibn 'Abdullah reported that at-Tufayl ibn 'Amr asked the\nProphet, may Allah bless him and grant him peace, \"Do you want a fortress\nand a citadel? The fortress of Daws.\" The Messenger of Allah, may Allah\nbless him and grant him peace, refused it because of what Allah had stored\nup for the Ansar. At-Tufayl made hijra and a man of his people made hijra\nwith him. The man fell ill and was in torment (or words to that effect)\nand he crawled over to a quiver, took out an arrow, sliced his veins and\ndied. At-Tufayl saw him a dream and asked him, \"What has been done to you?\"\nHe replied, \"I was forgiven because of my hijra to the Prophet, may Allah\nbless him and grant him peace.\" He asked, \"What happened to your hands?\"\nHe replied, \"It was said, 'We will not put right in you that part of your\nhands which you destroyed.'\" He said that at-Tufayl related that tot he\nProphet, may Allah bless him and grant him peace, and the Prophet said,\n\"O Allah, forgive his hands!\" and he raised his hands when he said it."}},{"id":12,"idInBook":12,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا أَبُو مَعْمَرٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْوَارِثِ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ صُهَيْبٍ، عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ‏:‏ كَانَ رَسُولُ اللهِ صلى الله عليه وسلم يَتَعَوَّذُ يَقُولُ‏:‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكَسَلِ، وَأَعُوذُ بِكَ مِنَ الْجُبْنِ، وَأَعُوذُ بِكَ مِنَ الْهَرَمِ، وَأَعُوذُ بِكَ مِنَ الْبُخْلِ‏.‏","english":{"narrator":"","text":"Anas ibn Malik said, \"The Messenger of Allah, may Allah bless him\nand grant him peace, used to seek refuge with Allah, saying, 'O Allah,\nI seek refuge with you from laziness. I seek refuge with You from cowardice.\nI seek refuge with you from senility. I seek refuge with You from miserliness.'\""}},{"id":13,"idInBook":13,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا خَلِيفَةُ بْنُ خَيَّاطٍ، قَالَ‏:‏ حَدَّثَنَا كَثِيرُ بْنُ هِشَامٍ، قَالَ‏:‏ حَدَّثَنَا جَعْفَرٌ، عَنْ يَزِيدَ بْنِ الأَصَمِّ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللهِ صلى الله عليه وسلم قَالَ‏:‏ قَالَ اللَّهُ عَزَّ وَجَلَّ‏:‏ أَنَا عِنْدَ ظَنِّ عَبْدِي، وَأَنَا مَعَهُ إِذَا دَعَانِي‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said that Allah Almighty said, \"I am according\nto My slave's opinion of Me, and I am with him when He calls on Me.'\""}},{"id":14,"idInBook":14,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ‏:‏ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، قَالَ‏:‏ حَدَّثَنَا حُسَيْنٌ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ اللهِ بْنُ بُرَيْدَةَ، عَنْ بُشَيْرِ بْنِ كَعْبٍ، عَنْ شَدَّادِ بْنِ أَوْسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ سَيِّدُ الاسْتِغْفَارِ‏:‏ اللَّهُمَّ أَنْتَ رَبِّي لاَ إِلَهَ إِلاَّ أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ، وَأَبُوءُ لَكَ بِذَنْبِي، فَاغْفِرْ لِي، فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ‏.‏ أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ‏.‏ إِذَا قَالَ حِينَ يُمْسِي فَمَاتَ دَخَلَ الْجَنَّةَ، أَوْ‏:‏ كَانَ مِنْ أَهْلِ الْجَنَّةِ، وَإِذَا قَالَ حِينَ يُصْبِحُ فَمَاتَ مِنْ يَوْمِهِ مِثْلَهُ‏.‏","english":{"narrator":"","text":"Shaddad ibn Aws reported that the Prophet, may Allah bless him\nand grant him peace, said, \"The best way of asking forgiveness is 'O Allah,\nYou are my Lord. There is no god but You. You created me and I am Your\nslave. I follow Your covenant and promise as much as I can. I acknowledge\nYour blessing and I confess to my wrong actions, so forgive me. Only You\ncan forgive wrong actions. I seek refuge with You from the evil of what\nI have done.' If he says it in the evening and then dies, he will enter\nthe Garden - or he said that he will be one of the people of the Garden.\nIf he says it in the morning and dies that day - it is the same.\""}},{"id":15,"idInBook":15,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللهِ، قَالَ‏:‏ حَدَّثَنَا ابْنُ نُمَيْرٍ، عَنْ مَالِكِ بْنِ مِغْوَلٍ، عَنِ ابْنِ سُوقَةَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ قَالَ‏:‏ إِنْ كُنَّا لَنَعُدُّ فِي الْمَجْلِسِ لِلنَّبِيِّ صلى الله عليه وسلم‏:‏ رَبِّ اغْفِرْ لِي، وَتُبْ عَلَيَّ، إِنَّكَ أَنْتَ التَّوَّابُ الرَّحِيمُ مِئَةَ مَرَّةٍ‏.‏","english":{"narrator":"","text":"Ibn 'Umar said, \"We used to say this a hundred times in the assembly\nof the Prophet, may Allah bless him and grant him peace, 'O Lord, forgive\nme and turn back to me (forgive me). You are the Ever-Turning back (to his slaves), the Merciful.'\""}},{"id":16,"idInBook":16,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، قَالَ‏:‏ حَدَّثَنَا خَالِدُ بْنُ عَبْدِ اللهِ، عَنْ حُصَيْنٍ، عَنْ هِلاَلِ بْنِ يَسَافٍ، عَنْ زَاذَانَ، عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ‏:‏ صَلَّى رَسُولُ اللهِ صلى الله عليه وسلم الضُّحَى ثُمَّ قَالَ‏:‏ اللَّهُمَّ اغْفِرْ لِي، وَتُبْ عَلَيَّ، إِنَّكَ أَنْتَ التَّوَّابُ الرَّحِيمُ، حَتَّى قَالَهَا مِئَةَ مَرَّةٍ‏.‏","english":{"narrator":"","text":"'A'isha said, \"The Messenger of Allah, may Allah bless him and\ngrant him peace, prayed the Duha prayer and then said, 'O Lord, forgive\nme and turn to me. You are the Ever-Turning back (to his slaves), the Merciful' a hundred times.\""}},{"id":17,"idInBook":17,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا أَبُو مَعْمَرٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْوَارِثِ، قَالَ‏:‏ حَدَّثَنَا حُسَيْنٌ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ اللهِ بْنُ بُرَيْدَةَ قَالَ‏:‏ حَدَّثَنِي بُشَيْرُ بْنُ كَعْبٍ الْعَدَوِيُّ قَالَ‏:‏ حَدَّثَنِي شَدَّادُ بْنُ أَوْسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ سَيِّدُ الاسْتِغْفَارِ أَنْ يَقُولَ‏:‏ اللَّهُمَّ أَنْتَ رَبِّي، لاَ إِلَهَ إِلاَّ أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ، وَأَبُوءُ لَكَ بِذَنْبِي، فَاغْفِرْ لِي، فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ، قَالَ‏:‏ مَنْ قَالَهَا مِنَ النَّهَارِ مُوقِنًا بِهَا، فَمَاتَ مِنْ يَوْمِهِ قَبْلَ أَنْ يُمْسِيَ فَهُوَ مِنْ أَهْلِ الْجَنَّةِ، وَمَنْ قَالَهَا مِنَ اللَّيْلِ وَهُوَ مُوقِنٌ بِهَا، فَمَاتَ قَبْلَ أَنْ يُصْبِحَ فَهُوَ مِنْ أَهْلِ الْجَنَّةِ‏.‏","english":{"narrator":"","text":"Similar to hadith 617 but with a slightly different wording."}},{"id":18,"idInBook":18,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا حَفْصٌ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ أَبِي بُرْدَةَ، سَمِعْتُ الأَغَرَّ، رَجُلٌ مِنْ جُهَيْنَةَ، يُحَدِّثُ عَبْدَ اللهِ بْنَ عُمَرَ قَالَ‏:‏ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ‏:‏ تُوبُوا إِلَى اللهِ، فَإِنِّي أَتُوبُ إِلَيْهِ كُلَّ يَوْمٍ مِئَةَ مَرَّةٍ‏.‏","english":{"narrator":"","text":"'Abdullah ibn 'Umar said, \"I heard the Prophet, may Allah bless\nhim and grant him peace, say, 'Turn in repentance to Allah. I turn to Him\na hundred times every day.\""}},{"id":19,"idInBook":19,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، قَالَ‏:‏ حَدَّثَنَا زُهَيْرٌ، قَالَ‏:‏ حَدَّثَنَا مَنْصُورٌ، عَنِ الْحَكَمِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ كَعْبِ بْنِ عُجْرَةَ قَالَ‏:‏ مُعَقِّبَاتٌ لاَ يَخِيبُ قَائِلُهُنَّ‏:‏ سُبْحَانَ اللهِ، وَالْحَمْدُ لِلَّهِ، وَلاَ إِلَهَ إِلاَّ اللَّهُ، وَاللَّهُ أَكْبَرُ، مِئَةَ مَرَّةٍ‏.‏ رَفَعَهُ ابْنُ أَبِي أُنَيْسَةَ وَعَمْرُو بْنُ قَيْسٍ‏.‏","english":{"narrator":"Ka'b ibn 'Ujra said, \"Those who repeat the supplications which\nfollow the prayers will not be disappointed. They are:","text":"'Glory be to Allah';\n'Praise be to Allah'; and 'There is no god but Allah' a hundred times.\""}},{"id":20,"idInBook":20,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ يَزِيدَ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ زِيَادٍ قَالَ لِي عَبْدُ اللهِ بْنُ يَزِيدَ‏:‏ سَمِعْتُ عَبْدَ اللهِ بْنَ عَمْرٍو، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ أَسْرَعُ الدُّعَاءِ إِجَابَةً دُعَاءُ غَائِبٍ لِغَائِبٍ‏.‏","english":{"narrator":"","text":"'Abdullah ibn 'Amr reported that the Prophet, may Allah bless him\nand grant him peace, said, \"The swiftest supplication to be answered is\nthe supplication of someone for another person who is not present.\""}},{"id":21,"idInBook":21,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا بِشْرُ بْنُ مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ اللهِ، قَالَ‏:‏ أَخْبَرَنَا حَيْوَةُ، قَالَ‏:‏ أَخْبَرَنَا شُرَحْبِيلُ بْنُ شَرِيكٍ الْمَعَافِرِيُّ، أَنَّهُ سَمِعَ أَبَا عَبْدِ الرَّحْمَنِ الْحُبُلِيَّ، أَنَّهُ سَمِعَ الصُّنَابِحِيَّ، أَنَّهُ سَمِعَ أَبَا بَكْرٍ الصِّدِّيقَ رَضِيَ اللَّهُ عَنْهُ‏:‏ إِنَّ دَعْوَةَ الأَخِ فِي اللهِ تُسْتَجَابُ‏.‏","english":{"narrator":"","text":"Abu Bakr as-Siddiq was heard to say, \"The supplication of a brother\nin Allah is answered.\""}},{"id":22,"idInBook":22,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، قَالَ‏:‏ حَدَّثَنَا يَحْيَى بْنُ أَبِي غَنِيَّةَ، قَالَ‏:‏ أَخْبَرَنَا عَبْدُ الْمَلِكِ بْنُ أَبِي سُلَيْمَانَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ صَفْوَانَ بْنِ عَبْدِ اللهِ بْنِ صَفْوَانَ، وَكَانَتْ تَحْتَهُ الدَّرْدَاءُ بِنْتُ أَبِي الدَّرْدَاءِ، قَالَ‏:‏ قَدِمْتُ عَلَيْهِمُ الشَّامَ، فَوَجَدْتُ أُمَّ الدَّرْدَاءِ فِي الْبَيْتِ، وَلَمْ أَجِدْ أَبَا الدَّرْدَاءِ، قَالَتْ‏:‏ أَتُرِيدُ الْحَجَّ الْعَامَ‏؟‏ قُلْتُ‏:‏ نَعَمْ، قَالَتْ‏:‏ فَادْعُ اللَّهَ لَنَا بِخَيْرٍ، فَإِنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَقُولُ‏:‏ إِنَّ دَعْوَةَ الْمَرْءِ الْمُسْلِمِ مُسْتَجَابَةٌ لأَخِيهِ بِظَهْرِ الْغَيْبِ، عِنْدَ رَأْسِهِ مَلَكٌ مُوَكَّلٌ، كُلَّمَا دَعَا لأَخِيهِ بِخَيْرٍ قَالَ‏:‏ آمِينَ، وَلَكَ بِمِثْلٍ، قَالَ‏:‏ فَلَقِيتُ أَبَا الدَّرْدَاءِ فِي السُّوقِ فَقَالَ مِثْلَ ذَلِكَ، يَأْثُرُ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏","english":{"narrator":"","text":"Safwan ibn 'Abdullah ibn Safwan, who was married to the daughter\nof Abu'd-Darda', said, \"I visited them in Syria and found Umm ad-Darda'\nin the house, but not Abu'd-Darda'. She asked, 'Are you intending to go\non hajj this year?' 'Yes,' I replied. She said, 'Make supplication to Allah\nand ask for good for us. The Prophet, may Allah bless him and grant him\npeace, said, \"The supplication of a Muslim man for his absent brother is\nanswered. At his head there is a guardian angel. Whenever he asks Allah\nto give his brother good, the angel says, 'Amen, and may you have the same.'\"'\nI met Abu'd-Darda' in the market and he said something similar which was\nrelated from the Prophet, may Allah bless him and grant him peace.\""}},{"id":23,"idInBook":23,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، وَشِهَابٌ، قَالاَ‏:‏ حَدَّثَنَا حَمَّادٌ، عَنْ عَطَاءِ بْنِ السَّائِبِ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللهِ بْنِ عَمْرٍو قَالَ‏:‏ قَالَ رَجُلٌ‏:‏ اللَّهُمَّ اغْفِرْ لِي وَلِمُحَمَّدٍ وَحْدَنَا، فَقَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ لَقَدْ حَجَبْتَهَا عَنْ نَاسٍ كَثِيرٍ‏.‏","english":{"narrator":"","text":"'Abdullah ibn 'Amr reported that a man said, \"O Allah, forgive\nme and Muhammad alone!\" The Prophet, may Allah bless him and grant him\npeace, said, \"You have veiled it from many people.\""}},{"id":24,"idInBook":24,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا جَنْدَلُ بْنُ وَالِقٍ، قَالَ‏:‏ حَدَّثَنَا يَحْيَى بْنُ يَعْلَى، عَنْ يُونُسَ بْنِ خَبَّابٍ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عُمَرَ قَالَ‏:‏ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَسْتَغْفِرُ اللَّهَ فِي الْمَجْلِسِ مِئَةَ مَرَّةٍ‏:‏ رَبِّ اغْفِرْ لِي، وَتُبْ عَلَيَّ، وَارْحَمْنِي، إِنَّكَ أَنْتَ التَّوَّابُ الرَّحِيمُ‏.‏","english":{"narrator":"","text":"Ibn 'Umar said, \"I heard the Prophet, may Allah bless him and grant\nhim peace, asking Allah to forgive him a hundred times in this assembly\nwith the words, 'O Allah, forgive me and turn to me and show mercy to me.\nYou are the Ever-Turning back (to his slaves), Merciful.'\""}},{"id":25,"idInBook":25,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا عُبَيْدُ بْنُ يَعِيشَ، قَالَ‏:‏ حَدَّثَنَا يُونُسُ، عَنِ ابْنِ إِسْحَاقَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ قَالَ‏:‏ إِنِّي لَأَدْعُو فِي كُلِّ شَيْءٍ مِنْ أَمْرِي حَتَّى أَنْ يُفْسِحَ اللَّهُ فِي مَشْيِ دَابَّتِي، حَتَّى أَرَى مِنْ ذَلِكَ مَا يَسُرُّنِي‏.‏","english":{"narrator":"","text":"Ibn 'Umar said, \"I make supplication in everything I do - even\nthat Allah will make the stride of my animal long so that I find ease in\nthat.\""}},{"id":26,"idInBook":26,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ‏:‏ حَدَّثَنَا عَمْرُو بْنُ عَبْدِ اللهِ أَبُو مُعَاوِيَةَ، قَالَ‏:‏ حَدَّثَنَا مُهَاجِرٌ أَبُو الْحَسَنِ، عَنْ عَمْرِو بْنِ مَيْمُونٍ الأَوْدِيِّ، عَنْ عُمَرَ أَنَّهُ كَانَ فِيمَا يَدْعُو‏:‏ اللَّهُمَّ تَوَفَّنِي مَعَ الأَبْرَارِ، وَلاَ تُخَلِّفْنِي فِي الأَشْرَارِ، وَأَلْحِقْنِي بِالأخْيَارِ‏.‏","english":{"narrator":"","text":"It is reported that 'Umar used to make supplication with his words,\n\") Allah, let me die with the pious and do not leave me among the evil.\nJoin me to the good.\""}},{"id":27,"idInBook":27,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، قَالَ‏:‏ حَدَّثَنَا أَبِي، قَالَ‏:‏ حَدَّثَنَا الأَعْمَشُ، قَالَ‏:‏ حَدَّثَنَا شَقِيقٌ قَالَ كَانَ عَبْدُ اللهِ يُكْثِرُ أَنْ يَدْعُوَ بِهَؤُلاَءِ الدَّعَوَاتِ‏:‏ رَبَّنَا أَصْلِحْ بَيْنَنَا، وَاهْدِنَا سَبِيلَ الإِسْلاَمِ، وَنَجِّنَا مِنَ الظُّلُمَاتِ إِلَى النُّورِ، وَاصْرِفْ عَنَّا الْفَوَاحِشَ مَا ظَهْرَ مِنْهَا وَمَا بَطَنَ، وَبَارِكْ لَنَا فِي أَسْمَاعِنَا وَأَبْصَارِنَا وَقُلُوبِنَا وَأَزْوَاجِنَا وَذُرِّيَّاتِنَا، وَتُبْ عَلَيْنَا إِنَّكَ أَنْتَ التَّوَّابُ الرَّحِيمُ، وَاجْعَلْنَا شَاكِرِينَ لِنِعْمَتِكَ، مُثْنِينَ بِهَا، قَائِلِينَ بِهَا، وَأَتْمِمْهَا عَلَيْنَا‏.‏","english":{"narrator":"It is related that 'Abdullah used to use these supplications a\nlot:","text":"'Our Lord, make peace between us and guide us on the path of Islam.\nSave us from the darkness (and bring us) to the light. Remove acts of deviance\nfrom us, both open and hidden. Bless us in our ears, our eyes, our hearts,\nour wives and our children. Turn to us. You are the Ever-Turning back (to his slaves), Most\nMerciful. Make us thankful for Your blessing and make us among those who\ngive praise for it and proclaim it. Perfect it for us.\""}},{"id":28,"idInBook":28,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ‏:‏ حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ، عَنْ ثَابِتٍ قَالَ‏:‏ كَانَ أَنَسٌ إِذَا دَعَا لأَخِيهِ يَقُولُ‏:‏ جَعَلَ اللَّهُ عَلَيْهِ صَلاَةَ قَوْمٍ أَبْرَارٍ لَيْسُوا بِظَلَمَةٍ وَلاَ فُجَّارٍ، يَقُومُونَ اللَّيْلَ، وَيَصُومُونَ النَّهَارَ‏.‏","english":{"narrator":"","text":"When Anas made supplication for his brother, he said, \"May Allah\nbless him with the blessing of those who are pious. They are neither unjust\nnor corrupt. They stand at night in prayer and fast in the day.\""}},{"id":29,"idInBook":29,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا ابْنُ نُمَيْرٍ، قَالَ‏:‏ حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ‏:‏ حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي خَالِدٍ قَالَ‏:‏ سَمِعْتُ عَمْرَو بْنَ حُرَيْثٍ يَقُولُ‏:‏ ذَهَبَتْ بِي أُمِّي إِلَى النَّبِيِّ صلى الله عليه وسلم، فَمَسَحَ عَلَى رَأْسِي، وَدَعَا لِي بِالرِّزْقِ‏.‏","english":{"narrator":"","text":"'Amr ibn al-Harith said, \"My mother took me to the Prophet, may\nAllah bless him and grant him peace, and stroked my head and prayed for\nprovision to be given to me.\""}},{"id":30,"idInBook":30,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى، قَالَ‏:‏ حَدَّثَنَا عُمَرُ بْنُ عَبْدِ اللهِ الرُّومِيُّ قَالَ‏:‏ أَخْبَرَنِي أَبِي، عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ‏:‏ قِيلَ لَهُ‏:‏ إِنَّ إِخْوَانَكَ أَتَوْكَ مِنَ الْبَصْرَةِ، وَهُوَ يَوْمَئِذٍ بِالزَّاوِيَةِ، لِتَدْعُوَ اللَّهَ لَهُمْ، قَالَ‏:‏ اللَّهُمَّ اغْفِرْ لَنَا، وَارْحَمْنَا، وَآتِنَا فِي الدُّنْيَا حَسَنَةً، وَفِي الْآخِرَةِ حَسَنَةً، وَقِنَا عَذَابَ النَّارِ، فَاسْتَزَادُوهُ، فَقَالَ مِثْلَهَا، فَقَالَ‏:‏ إِنْ أُوتِيتُمْ هَذَا، فَقَدْ أُوتِيتُمْ خَيْرَ الدُّنْيَا وَالآخِرَةِ‏.‏","english":{"narrator":"","text":"Anas ibn Malik was told, \"Your brothers have come to you from Basra\n(and that day he was at the zawiyya) wanting for you to make supplication\nto Allah for them.\" He said, \"O Allah, forgive them and show mercy to them.\nGive them good in this world and good in the Next World and protect them\nfrom the punishment of the Fire.\" They asked him to say more and he said\nrepeated the same thing. He said, \"If you are given this, you have been\ngiven the good of this world and the Next.\""}},{"id":31,"idInBook":31,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا أَبُو مَعْمَرٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْوَارِثِ، قَالَ‏:‏ حَدَّثَنَا أَبُو رَبِيعَةَ سِنَانٌ، قَالَ‏:‏ حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ قَالَ‏:‏ أَخَذَ النَّبِيُّ صلى الله عليه وسلم غُصْنًا فَ نَفَضَهُ فَلَمْ يَنْتَفِضْ، ثُمَّ نَفَضَهُ فَلَمْ يَنْتَفِضْ، ثُمَّ نَفَضَهُ فَانْتَفَضَ، قَالَ‏:‏ إِنَّ سُبْحَانَ اللهِ، وَالْحَمْدَ لِلَّهِ، وَلاَ إِلَهَ إِلاَّ اللَّهُ، يَنْفُضْنَ الْخَطَايَا كَمَا تَنْفُضُ الشَّجَرَةُ وَرَقَهَا‏.‏","english":{"narrator":"","text":"Anas ibn Malik said, \"The Prophet, may Allah bless him and grant\nhim peace, took a bough and shook it and not all the leaves fell off. Then\nhe shook it again and not all the leaves fell off. Then he shook it a third\ntime but not all the leaves fell off. He said, 'Saying, \"Glory be to Allah\nand praise be to Allah and there is no god but Allah\" makes errors fall\naway as the leaves of a tree fall away.'\""}},{"id":32,"idInBook":32,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ‏:‏ حَدَّثَنَا سَلَمَةُ قَالَ‏:‏ سَمِعْتُ أَنَسًا يَقُولُ‏:‏ أَتَتِ امْرَأَةٌ النَّبِيَّ صلى الله عليه وسلم تَشْكُو إِلَيْهِ الْحَاجَةَ، أَوْ بَعْضَ الْحَاجَةِ، فَقَالَ‏:‏ أَلاَ أَدُلُّكِ عَلَى خَيْرٍ مِنْ ذَلِكَ‏؟‏ تُهَلِّلِينَ اللَّهَ ثَلاَثِينَ عِنْدَ مَنَامِكِ، وَتُسَبِّحِينَ ثَلاَثًا وَثَلاَثِينَ، وَتَحْمَدِينَ أَرْبَعًا وَثَلاَثِينَ، فَتِلْكَ مِئَةٌ خَيْرٌ مِنَ الدُّنْيَا وَمَا فِيهَا‏.‏","english":{"narrator":"","text":"Anas reported that a woman came to the Prophet, to complain to\nhim of a need. He said, 'Shall I show you something better than that? You\nshould say, 'There is no god but Allah' 33 times when you go to sleep and\nsay 'Glory be to Allah' 33 times and say 'Praise be to Allah' 34 times\nand then that hundred is better than his world and all that it contains.'\""}},{"id":33,"idInBook":33,"chapterId":31,"bookId":15,"arabic":"وَقَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ مَنْ هَلَّلَ مِئَةً، وَسَبَّحَ مِئَةً، وَكَبَّرَ مِئَةً، خَيْرٌ لَهُ مِنْ عَشْرِ رِقَابٍ يُعْتِقُهَا، وَسَبْعِ بَدَنَاتٍ يَنْحَرُهَا‏.‏","english":{"narrator":"","text":"The Prophet, may Allah bless him and grant him peace, said, \"If\nsomeone says, 'There is no god but Allah' one hundred times, 'Glory be\nto Allah' one hundred times' and 'Allah is greater' one hundred times,\nthat is better than freeing ten slaves and slaughtering seven camels.\""}},{"id":34,"idInBook":34,"chapterId":31,"bookId":15,"arabic":"فَأَتَى النَّبِيَّ صلى الله عليه وسلم رَجُلٌ فَقَالَ‏:‏ يَا رَسُولَ اللهِ، أَيُّ الدُّعَاءِ أَفْضَلُ‏؟‏ قَالَ‏:‏ سَلِ اللَّهَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ، ثُمَّ أَتَاهُ الْغَدَ فَقَالَ‏:‏ يَا نَبِيَّ اللهِ، أَيُّ الدُّعَاءِ أَفْضَلُ‏؟‏ قَالَ‏:‏ سَلِ اللَّهَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ، فَإِذَا أُعْطِيتَ الْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ فَقَدْ أَفْلَحْتَ‏.‏","english":{"narrator":"","text":"A man came to the Prophet, may Allah bless him and grant him peace,\nand said, \"Messenger of Allah, what is the best supplication?\" He answered,\n\"Asking Allah for forgiveness and well-being in this world and the Next\nworld.\" Then he came to him the following day and asked, \"Prophet of Allah,\nwhat is the best supplication?\" He answered, \"Asking Allah for forgiveness\nand well-being in this world and the Next world. When you are given well-being\nin this world and the Next, then you have achieved success.\""}},{"id":35,"idInBook":35,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا آدَمُ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، عَنِ الْجُرَيْرِيِّ، عَنْ أَبِي عَبْدِ اللهِ الْعَنَزِيِّ، عَنْ عَبْدِ اللهِ بْنِ الصَّامِتِ، عَنْ أَبِي ذَرٍّ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ أَحَبُّ الْكَلاَمِ إِلَى اللهِ‏:‏ سُبْحَانَ اللهِ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ، سُبْحَانَ اللهِ وَبِحَمْدِهِ‏.‏","english":{"narrator":"Abu Dharr reported that the Prophet, may Allah bless him and grant\nhim peace, said, \"The words which Allah loves most are:","text":"'Glory be to Allah\nwho has no partner. His is the Kingdom and praise is His and He has power\nover all things. There is no power nor strength except by Allah. Glory be\nto Allah and by His praise.\""}},{"id":36,"idInBook":36,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا الصَّلْتُ بْنُ مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا مَهْدِيُّ بْنُ مَيْمُونٍ، عَنِ الْجُرَيْرِيِّ، عَنْ جَبْرِ بْنِ حَبِيبٍ، عَنْ أُمِّ كُلْثُومِ ابْنَةِ أَبِي بَكْرٍ، عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ‏:‏ دَخَلَ عَلَيَّ النَّبِيُّ صلى الله عليه وسلم وَأَنَا أُصَلِّي، وَلَهُ حَاجَةٌ، فَأَبْطَأْتُ عَلَيْهِ، قَالَ‏:‏ يَا عَائِشَةُ، عَلَيْكِ بِجُمَلِ الدُّعَاءِ وَجَوَامِعِهِ، فَلَمَّا انْصَرَفْتُ قُلْتُ‏:‏ يَا رَسُولَ اللهِ، وَمَا جُمَلُ الدُّعَاءِ وَجَوَامِعُهُ‏؟‏ قَالَ‏:‏ قُولِي‏:‏ اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنَ الْخَيْرِ كُلِّهِ، عَاجِلِهِ وَآجِلِهِ، مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ‏.‏ وَأَعُوذُ بِكَ مِنَ الشَّرِّ كُلِّهِ عَاجِلِهِ وَآجِلِهِ، مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمُ‏.‏ وَأَسْأَلُكَ الْجَنَّةَ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ، وَأَعُوذُ بِكَ مِنَ النَّارِ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ‏.‏ وَأَسْأَلُكَ مِمَّا سَأَلَكَ بِهِ مُحَمَّدٌ صلى الله عليه وسلم، وَأَعُوذُ بِكَ مِمَّا تَعَوَّذَ مِنْهُ مُحَمَّدٌ صلى الله عليه وسلم، وَمَا قَضَيْتَ لِي مِنْ قَضَاءٍ فَاجْعَلْ عَاقِبَتَهُ رُشْدًا‏.‏","english":{"narrator":"Umm Kulthum, the daughter of Abu Bakr, reported that 'A'isha said,\n\"The Prophet, may Allah bless him and grant him peace, came to me while\nI was praying when he needed something. I was taking a long time and he\nsaid, ''A'isha, you must make the comprehensive supplication.' When I finished,\nI asked, 'Messenger of Allah, what is the comprehensive supplication?'\nHe said, 'Say:","text":"\"O Allah, I ask You for all good, both sooner and later,\nwhat I know of it and what I do not know. I seek refuge with You from all\nevil, both sooner and later, what I know of it and what I do not know.\nI ask You for the Garden an d whatever words or actions bring one near\nto it. I seek refuge with You from the Fire and whatever words or actions\nbring one near to it. I ask You by what Muhammad asked You and I seek refuge\nfrom You by what Muhammad sought refuge from and whatever fate You have\ndecreed for me, make its end right guidance.\"'\""}},{"id":37,"idInBook":37,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانَ قَالَ‏:‏ حَدَّثَنِي ابْنُ وَهْبٍ قَالَ‏:‏ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، عَنْ دَرَّاجٍ، أَنَّ أَبَا الْهَيْثَمَ حَدَّثَهُ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ أَيُّمَا رَجُلٌ مُسْلِمٌ لَمْ يَكُنْ عِنْدَهُ صَدَقَةٌ، فَلْيَقُلْ فِي دُعَائِهِ‏:‏ اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ، عَبْدِكَ وَرَسُولِكَ، وَصَلِّ عَلَى الْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ، وَالْمُسْلِمِينَ وَالْمُسْلِمَاتِ، فَإِنَّهَا لَهُ زَكَاةٌ‏.‏","english":{"narrator":"","text":"Abu Sa'id al-Khudri reported that the Prophet, may Allah bless\nhim and grant him peace, said, \"If any Muslim does not have anything to\ngive as sadaqa, he should say in his supplication, 'O Allah, bless Muhammad,\nYour slave and Your Messenger and bless the believers, both men and women,\nand the Muslims, both men and women.' That will be sadaqa for him.\""}},{"id":38,"idInBook":38,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاءِ، قَالَ‏:‏ حَدَّثَنَا إِسْحَاقُ بْنُ سُلَيْمَانَ، عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ، مَوْلَى سَعِيدِ بْنِ الْعَاصِ، قَالَ‏:‏ حَدَّثَنَا حَنْظَلَةُ بْنُ عَلِيٍّ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ مَنْ قَالَ‏:‏ اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ، وَعَلَى آلِ مُحَمَّدٍ، كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَآلِ إِبْرَاهِيمَ، وَبَارِكْ عَلَى مُحَمَّدٍ، وَعَلَى آلِ مُحَمَّدٍ، كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَآلِ إِبْرَاهِيمَ، وَتَرَحَّمْ عَلَى مُحَمَّدٍ، وَعَلَى آلِ مُحَمَّدٍ، كَمَا تَرَحَّمْتَ عَلَى إِبْرَاهِيمَ وَآلِ إِبْرَاهِيمَ، شَهِدْتُ لَهُ يَوْمَ الْقِيَامَةِ بِالشَّهَادَةِ، وَشَفَعْتُ لَهُ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"If anyone says, 'O Allah, bless Muhammad and the\nfamily of Muhammad as You blessed Ibrahim and the family of Ibrahim. Shower\nblessings on Muhammad and the family of Muhammad as You showered blessings\non Ibrahim and the family of Ibrahim. Show mercy to Muhammad and the family\nof Muhammad as You showed mercy to Ibrahim and the family of Ibrahim,'\nI will testify for him on the Day of Rising and I will intercede for him.\""}},{"id":39,"idInBook":39,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ‏:‏ حَدَّثَنَا سَلَمَةُ بْنُ وَرْدَانَ قَالَ‏:‏ سَمِعْتُ أَنَسًا، وَمَالِكَ بْنَ أَوْسِ بْنِ الْحَدَثَانِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم خَرَجَ يَتَبَرَّزُ فَلَمْ يَجِدْ أَحَدًا يَتْبَعُهُ، فَخَرَجَ عُمَرُ فَاتَّبَعَهُ بِفَخَّارَةٍ أَوْ مِطْهَرَةٍ، فَوَجَدَهُ سَاجِدًا فِي مِسْرَبٍ، فَتَنَحَّى فَجَلَسَ وَرَاءَهُ، حَتَّى رَفَعَ النَّبِيُّ صلى الله عليه وسلم رَأْسَهُ فَقَالَ‏:‏ أَحْسَنْتَ يَا عُمَرُ حِينَ وَجَدْتَنِي سَاجِدًا فَتَنَحَّيْتَ عَنِّي، إِنَّ جِبْرِيلَ جَاءَنِي فَقَالَ‏:‏ مَنْ صَلَّى عَلَيْكَ وَاحِدَةً صَلَّى اللَّهُ عَلَيْهِ عَشْرًا، وَرَفَعَ لَهُ عَشْرَ دَرَجَاتٍ‏.‏","english":{"narrator":"","text":"Malik ibn Aws ibn al-Hadathan said, \"The Prophet, may Allah bless\nhim and grant him peace, went out to open ground to answer a call of nature\nand did not find anyone to follow him. 'Umar went out and followed him\nwith a clay pot or wudu' vessel. He found him prostrating in a river bed.\nHe fell back and sat behind him until the Prophet, may Allah bless him\nand grant him peace, lifted his head. He said, 'You have done well, 'Umar.\nWhen you found me prostrating, you went behind me. Jibril came to me and\nsaid, 'If someone says the prayer on you once, Allah will pray ten times\non him and raise him ten degrees.'\""}},{"id":40,"idInBook":40,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ‏:‏ حَدَّثَنَا يُونُسُ بْنُ أَبِي إِسْحَاقَ، عَنْ بُرَيْدِ بْنِ أَبِي مَرْيَمَ، سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ مَنْ صَلَّى عَلَيَّ وَاحِدَةً صَلَّى اللَّهُ عَلَيْهِ عَشْرًا، وَحَطَّ عَنْهُ عَشْرَ خَطِيئَاتٍ‏.‏","english":{"narrator":"","text":"Anas ibn Malik reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"If anyone says the prayer on me once, Allah prays\non him ten times and removes ten errors from him.\""}},{"id":41,"idInBook":41,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ شَيْبَةَ قَالَ‏:‏ أَخْبَرَنِي عَبْدُ اللهِ بْنُ نَافِعٍ الصَّائِغُ، عَنْ عِصَامِ بْنِ زَيْدٍ، وَأَثْنَى عَلَيْهِ ابْنُ شَيْبَةَ خَيْرًا، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم رَقَى الْمِنْبَرَ، فَلَمَّا رَقَى الدَّرَجَةَ الأُولَى قَالَ‏:‏ آمِينَ، ثُمَّ رَقَى الثَّانِيَةَ فَقَالَ‏:‏ آمِينَ، ثُمَّ رَقَى الثَّالِثَةَ فَقَالَ‏:‏ آمِينَ، فَقَالُوا‏:‏ يَا رَسُولَ اللهِ، سَمِعْنَاكَ تَقُولُ‏:‏ آمِينَ ثَلاَثَ مَرَّاتٍ‏؟‏ قَالَ‏:‏ لَمَّا رَقِيتُ الدَّرَجَةَ الأُولَى جَاءَنِي جِبْرِيلُ صلى الله عليه وسلم فَقَالَ‏:‏ شَقِيَ عَبْدٌ أَدْرَكَ رَمَضَانَ، فَانْسَلَخَ مِنْهُ وَلَمْ يُغْفَرْ لَهُ، فَقُلْتُ‏:‏ آمِينَ‏.‏ ثُمَّ قَالَ‏:‏ شَقِيَ عَبْدٌ أَدْرَكَ وَالِدَيْهِ أَوْ أَحَدَهُمَا فَلَمْ يُدْخِلاَهُ الْجَنَّةَ، فَقُلْتُ‏:‏ آمِينَ‏.‏ ثُمَّ قَالَ‏:‏ شَقِيَ عَبْدٌ ذُكِرْتَ عِنْدَهُ وَلَمْ يُصَلِّ عَلَيْكَ، فَقُلْتُ‏:‏ آمِينَ‏.‏","english":{"narrator":"","text":"Jabir ibn 'Abdullah reported that the Prophet, may Allah bless\nhim and grant him peace, went up the minbar. When he reached the first\nstep, he said, \"Amen\". When he ascended to the second step, he said, \"Amen,\"\nand when he stepped onto the third step, he said, \"Amen.\" They said, \"Messenger\nof Allah, we heard you say 'Amen' three times.\" He said, \"When I went up\nthe first step, Jibril, may Allah bless him and grant him peace, came to\nme and said, 'Wretched is the slave to whom Ramadan comes and when it passes\nfrom him is not forgiven.' I said, 'Amen.' Then he said, 'Wretched is the\nslave who has one or both of his parents alive and they do not let him\nenter the Garden.' I said, 'Amen.' Then he said, 'Wretched is a slave who\ndoes not bless you when you are mentioned in his presence,' and I said,\n'Amen.'\""}},{"id":42,"idInBook":42,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، قَالَ‏:‏ حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ قَالَ‏:‏ أَخْبَرَنِي الْعَلاَءُ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم قَالَ‏:‏ مَنْ صَلَّى عَلَيَّ وَاحِدَةً صلى الله عليه وسلم عَشْرًا‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"If anyone prays once on me, Allah will\npray ten times on him.'\""}},{"id":43,"idInBook":43,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدِ اللهِ، قَالَ‏:‏ حَدَّثَنَا ابْنُ أَبِي حَازِمٍ، عَنْ كَثِيرٍ يَرْوِيهِ، عَنِ الْوَلِيدِ بْنِ رَبَاحٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم رَقَى الْمِنْبَرَ فَقَالَ‏:‏ آمِينَ، آمِينَ، آمِينَ، قِيلَ لَهُ‏:‏ يَا رَسُولَ اللهِ، مَا كُنْتَ تَصْنَعُ هَذَا‏؟‏ فَقَالَ‏:‏ قَالَ لِي جِبْرِيلُ‏:‏ رَغِمَ أَنْفُ عَبْدٍ أَدْرَكَ أَبَوَيْهِ أَوْ أَحَدَهُمَا لَمْ يُدْخِلْهُ الْجَنَّةَ، قُلْتُ‏:‏ آمِينَ‏.‏ ثُمَّ قَالَ‏:‏ رَغِمَ أَنْفُ عَبْدٍ دَخَلَ عَلَيْهِ رَمَضَانُ لَمْ يُغْفَرْ لَهُ، فَقُلْتُ‏:‏ آمِينَ‏.‏ ثُمَّ قَالَ‏:‏ رَغِمَ أَنْفُ امْرِئٍ ذُكِرْتَ عِنْدَهُ فَلَمْ يُصَلِّ عَلَيْكَ، فَقُلْتُ‏:‏ آمِينَ‏.‏","english":{"narrator":"","text":"Similar to 644 except it has \"Shame on\" rather than \"Wretched is;\""}},{"id":44,"idInBook":44,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا عَلِيٌّ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ مَوْلَى آلِ طَلْحَةَ قَالَ‏:‏ سَمِعْتُ كُرَيْبًا أَبَا رِشْدِينَ، عَنِ ابْنِ عَبَّاسٍ، عَنْ جُوَيْرِيَةَ بِنْتِ الْحَارِثِ بْنِ أَبِي ضِرَارٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم خَرَجَ مِنْ عِنْدِهَا، وَكَانَ اسْمُهَا بَرَّةَ، فَحَوَّلَ النَّبِيُّ صلى الله عليه وسلم اسْمَهَا، فَسَمَّاهَا جُوَيْرِيَةَ، فَخَرَجَ وَكَرِهَ أَنْ يَدْخُلَ وَاسْمُهَا بَرَّةُ، ثُمَّ رَجَعَ إِلَيْهَا بَعْدَ مَا تَعَالَى النَّهَارُ، وَهِيَ فِي مَجْلِسِهَا، فَقَالَ‏:‏ مَا زِلْتِ فِي مَجْلِسِكِ‏؟‏ لَقَدْ قُلْتُ بَعْدَكِ أَرْبَعَ كَلِمَاتٍ ثَلاَثَ مَرَّاتٍ، لَوْ وُزِنَتْ بِكَلِمَاتِكِ وَزَنَتْهُنَّ‏:‏ سُبْحَانَ اللهِ وَبِحَمْدِهِ عَدَدَ خَلْقِهِ، وَرِضَا نَفْسِهِ، وَزِنَةَ عَرْشِهِ، وَمِدَادَ، أَوْ مَدَدَ، كَلِمَاتِهِ‏.‏","english":{"narrator":"Juwayriyya, the daughter of al-Harith ibn Abi Dirar, (whose name\nhad been Barra but the Prophet, may Allah bless him and grant him peace,\nhad renamed her Juwayriyya) reported that the Prophet, may Allah bless\nhim and grant him peace, had left her and he did not want to go back in\nwhile her name was Barra. Then he went back to her while it was late in\nthe day and found that she was still sitting. \"Are you still sitting?\"\nhe asked, \"After I left you I uttered four phrases three times. If they\nwere to be weighed against all your words, they would outweigh them. They\nare:","text":"'Glory be to Allah and by His praise in number as great as His creation\nand in accordance with His own pleasure and the weight of His Throne and\nthe extent of His words.'\""}},{"id":45,"idInBook":45,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا ابْنُ سَلاَمٍ، قَالَ‏:‏ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ اسْتَعِيذُوا بِاللَّهِ مِنْ جَهَنَّمَ، اسْتَعِيذُوا بِاللَّهِ مِنْ عَذَابِ الْقَبْرِ، اسْتَعِيذُوا بِاللَّهِ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ، اسْتَعِيذُوا بِاللَّهِ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"Seek refuge with Allah from Hellfire. Seek\nrefuge with Allah from the punishment of the grave. Seek refuge with Allah\nfrom the sedition of the Dajjal. Seek refuge with Allah from the trials\nof life and death.\""}},{"id":46,"idInBook":46,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا الْحَسَنُ بْنُ الرَّبِيعِ، قَالَ‏:‏ حَدَّثَنَا ابْنُ إِدْرِيسَ، عَنْ لَيْثٍ، عَنْ مُحَارِبِ بْنِ دِثَارٍ، عَنْ جَابِرٍ قَالَ‏:‏ كَانَ رَسُولُ اللهِ صلى الله عليه وسلم يَقُولُ‏:‏ اللَّهُمَّ أَصْلِحْ لِي سَمْعِي وَبَصَرِي، وَاجْعَلْهُمَا الْوَارِثَيْنِ مِنِّي، وَانْصُرْنِي عَلَى مَنْ ظَلَمَنِي، وَأَرِنِي مِنْهُ ثَأْرِي‏.‏","english":{"narrator":"","text":"Jabir reported that the Messenger of Allah, may Allah bless him\nand grant him peace, said, \"O Allah, let my hearing and sight be sound\nand make them remain sound until I die. Turn away from me the one who wrongs\nme and give me revenge on him.\""}},{"id":47,"idInBook":47,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى، قَالَ‏:‏ حَدَّثَنَا حَمَّادٌ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ كَانَ النَّبِيُّ صلى الله عليه وسلم يَقُولُ‏:‏ اللَّهُمَّ مَتِّعْنِي بِسَمْعِي وَبَصَرِي، وَاجْعَلْهُمَا الْوَارِثَ مِنِّي، وَانْصُرْنِي عَلَى عَدُوِّي، وَأَرِنِي مِنْهُ ثَأْرِي‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, used to say, \"O Allah, let me enjoy my sight and hearing\nand make them remain sound until I die. Turn away my enemy and grant me\nrevenge on him.\""}},{"id":48,"idInBook":48,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللهِ، قَالَ‏:‏ حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ، قَالَ‏:‏ حَدَّثَنَا سَعْدُ بْنُ طَارِقِ بْنِ أَشْيَمَ الأَشْجَعِيُّ قَالَ‏:‏ حَدَّثَنِي أَبِي قَالَ‏:‏ كُنَّا نَغْدُو إِلَى النَّبِيِّ صلى الله عليه وسلم، فَيَجِيءُ الرَّجُلُ وَتَجِيءُ الْمَرْأَةُ فَيَقُولُ‏:‏ يَا رَسُولَ اللهِ، كَيْفَ أَقُولُ إِذَا صَلَّيْتُ‏؟‏ فَيَقُولُ‏:‏ قُلِ‏:‏ اللَّهُمَّ اغْفِرْ لِي، وَارْحَمْنِي، وَاهْدِنِي، وَارْزُقْنِي، فَقَدْ جَمَعَتْ لَكَ دُنْيَاكَ وَآخِرَتَكَ‏.‏","english":{"narrator":"","text":"Tariq ibn Ashyam al-Ashja'i said, \"We used to go and visit the\nProphet, may Allah bless him and grant him peace. On one occasion a man\nand woman came and the man asked, 'Messenger of Allah, what should I say\nwhen I pray?' He replied, 'Say, \"O Allah, forgive me, show mercy to me,\nguide me and provide for me.; They will combine this world and the Next\nworld for you.'\""}},{"id":49,"idInBook":49,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا قُتَيْبَةُ، قَالَ‏:‏ حَدَّثَنَا اللَّيْثُ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ أَبِي الْحَسَنِ مَوْلَى أُمِّ قَيْسِ ابْنَةِ مِحْصَنٍ، عَنْ أُمِّ قَيْسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ لَهَا‏:‏ مَا قَالَتْ‏:‏ طَالَ عُمْرُهَا‏؟‏، وَلاَ نَعْلَمُ امْرَأَةً عُمِّرَتْ مَا عُمِّرَتْ‏.‏","english":{"narrator":"","text":"Umm Qays reported that the Prophet, may Allah bless him and grant\nhim peace, said to her, \"What she said will make her life long. They said,\n\"We do not know of any woman who was given the long life that she was given.\""}},{"id":50,"idInBook":50,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا عَارِمٌ، قَالَ‏:‏ حَدَّثَنَا سَعِيدُ بْنُ زَيْدٍ، عَنْ سِنَانٍ، قَالَ‏:‏ حَدَّثَنَا أَنَسٌ قَالَ‏:‏ كَانَ النَّبِيُّ صلى الله عليه وسلم يَدْخُلُ عَلَيْنَا، أَهْلَ الْبَيْتِ، فَدَخَلَ يَوْمًا فَدَعَا لَنَا، فَقَالَتْ أُمُّ سُلَيْمٍ خُوَيْدِمُكَ أَلاَ تَدْعُو لَهُ‏؟‏ قَالَ‏:‏ اللَّهُمَّ، أَكْثِرْ مَالَهُ وَوَلَدَهُ، وَأَطِلْ حَيَاتَهُ، وَاغْفِرْ لَهُ‏.‏","english":{"narrator":"","text":"Anas said, \"The Prophet, may Allah bless him and grant him peace,\nused to come to us, the people of his house. One day he came to us and\nmade supplication for us. Umm Sulaym said, 'Won't you make supplication\nfor your little servant?' He said, 'O Allah, give him a lot of wealth and\nchildren. Make him live long and forgive him.'"}},{"id":51,"idInBook":51,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ‏:‏ حَدَّثَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ قَالَ‏:‏ أَخْبَرَنِي ابْنُ عُبَيْدٍ مَوْلَى عَبْدِ الرَّحْمَنِ، وَكَانَ مِنَ الْقُرَّاءِ وَأَهْلِ الْفِقْهِ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم قَالَ‏:‏ يُسْتَجَابُ لأَحَدِكُمْ مَا لَمْ يَعْجَلْ، يَقُولُ‏:‏ دَعَوْتُ فَلَمْ يُسْتَجَبْ لِي‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"The supplication of any of you is answered\nas long as he does not get impatient and say, 'I made supplication and\nwas not answered.'\""}},{"id":52,"idInBook":52,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ، قَالَ‏:‏ حَدَّثَنَا مُعَاوِيَةُ، أَنَّ رَبِيعَةَ بْنَ يَزِيدَ حَدَّثَهُ، عَنْ أَبِي إِدْرِيسَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ يُسْتَجَابُ لأَحَدِكُمْ مَا لَمْ يَدْعُ بِإِثْمٍ أَوْ قَطِيعَةِ رَحِمٍ، أَوْ يَسْتَعْجِلَ فَيَقُولُ‏:‏ دَعَوْتُ فَلاَ أَرَى يَسْتَجِيبُ لِي، فَيَدَعُ الدُّعَاءَ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"The supplication of any of you is answered\nas long as he does not make supplication for something which is a wrong\naction or cutting off ties of kinship or become impatient and say, 'I made\nsupplication and was not answered,' and so he stops making supplication.'\""}},{"id":53,"idInBook":53,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ قَالَ‏:‏ حَدَّثَنِي اللَّيْثُ قَالَ‏:‏ حَدَّثَنِي ابْنُ الْهَادِ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ قَالَ‏:‏ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ‏:‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكَسَلِ وَالْمَغْرَمِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ، وَأَعُوذُ بِكَ مِنْ عَذَابِ النَّارِ‏.‏","english":{"narrator":"","text":"'Amr ibn Shu'ayb reported that his grandfather said, \"I heard the\nProphet, may Allah bless him and grant him peace, say, 'O Allah, I seek\nrefuge with You from laziness and debt. I seek refuge with You from the\ntrial of the Dajjal. I seek refuge with You from the punishment of the\nFire.'\""}},{"id":54,"idInBook":54,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى، قَالَ‏:‏ حَدَّثَنَا حَمَّادٌ، قَالَ‏:‏ أَخْبَرَنَا مُحَمَّدُ بْنُ زِيَادٍ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ كَانَ النَّبِيُّ صلى الله عليه وسلم يَتَعَوَّذُ بِاللَّهِ مِنْ شَرِّ الْمَحْيَا وَالْمَمَاتِ، وَعَذَابِ الْقَبْرِ، وَشَرِّ الْمَسِيحِ الدَّجَّالِ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, used to seek refuge with Allah from the evils of life\nand death and the punishment of the grave and the evil of the Dajjal.\""}},{"id":55,"idInBook":55,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ، قَالَ‏:‏ حَدَّثَنَا أَبُو الْمَلِيحِ صُبَيْحٌ، قَالَ‏:‏ حَدَّثَنَا أَبُو صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ مَنْ لَمْ يَسْأَلِ اللَّهَ غَضِبَ اللَّهُ عَلَيْهِ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"Allah is angry with someone who does not ask of\nHim.\""}},{"id":56,"idInBook":56,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ عَبْدِ الْعَزِيزِ، عَنْ أَنَسٍ قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ إِذَا دَعَوْتُمُ اللَّهَ فَاعْزِمُوا فِي الدُّعَاءِ، وَلاَ يَقُولَنَّ أَحَدُكُمْ‏:‏ إِنْ شِئْتَ فَأَعْطِنِي، فَإِنَّ اللَّهَ لاَ مُسْتَكْرِهَ لَهُ‏.‏","english":{"narrator":"","text":"Anas reported that the Messenger of Allah, may Allah bless him\nand grant him peace, said, \"When you call on Allah, be definite in your\nsupplication. None of you should say, 'If You will, give it to me.' No\none can force Allah.\""}},{"id":57,"idInBook":57,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ، قَالَ‏:‏ حَدَّثَنَا أَبُو دَاوُدَ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي الزِّنَادِ، عَنْ أَبِيهِ، عَنْ أَبَانَ بْنِ عُثْمَانَ قَالَ‏:‏ سَمِعْتُ عُثْمَانَ قَالَ‏:‏ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ‏:‏ مَنْ قَالَ صَبَاحَ كُلِّ يَوْمٍ، وَمَسَاءَ كُلِّ لَيْلَةٍ، ثَلاَثًا ثَلاَثًا‏:‏ بِسْمِ اللهِ الَّذِي لاَ يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الأَرْضِ وَلاَ فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ، لَمْ يَضُرَّهُ شَيْءٌ‏.‏","english":{"narrator":"","text":"'Uthman said that he heard the Prophet, may Allah bless him and\ngrant him peace, say, \"A person will not be harmed by anything if he says\nevery morning and evening 33 times, 'In the Name of Allah by whose Name\nnothing in the earth or the heaven is harmed. He is the All-Hearing, the\nAll-Knowing.'\""}},{"id":58,"idInBook":58,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ قَالَ‏:‏ حَدَّثَنِي مَالِكٌ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ قَالَ‏:‏ سَاعَتَانِ تُفْتَحُ لَهُمَا أَبْوَابُ السَّمَاءِ، وَقَلَّ دَاعٍ تُرَدُّ عَلَيْهِ دَعْوَتُهُ‏:‏ حِينَ يَحْضُرُ النِّدَاءُ، وَالصَّفُّ فِي سَبِيلِ اللهِ‏.‏","english":{"narrator":"Sahl ibn Sa'd said, \"There are two hours in which the gates of\nheaven are opened. At those times very rarely is the supplication of someone\nwho makes supplication rejected:","text":"when the call to prayer has been given\nand when in battle ranks in the Cause of Allah.\""}},{"id":59,"idInBook":59,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا عَمْرُو بْنُ خَالِدٍ قَالَ‏:‏ حَدَّثَنِي اللَّيْثُ، عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حِبَّانَ، عَنْ لُؤْلُؤَةَ، عَنْ أَبِي صِرْمَةَ قَالَ‏:‏ كَانَ رَسُولُ اللهِ صلى الله عليه وسلم يَقُولُ‏:‏ اللَّهُمَّ إِنِّي أَسْأَلُكَ غِنَايَ وَغِنَى مَوْلايَ‏.‏","english":{"narrator":"","text":"Abu Sirma reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, used to say, \"O Allah, I ask You to make me wealthy\nand make my mawla wealthy!\""}},{"id":60,"idInBook":60,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا يَحْيَى بْنُ مُوسَى، قَالَ‏:‏ حَدَّثَنَا وَكِيعٌ، قَالَ‏:‏ حَدَّثَنَا سَعْدُ بْنُ أَوْسٍ، عَنْ بِلاَلِ بْنِ يَحْيَى، عَنْ شُتَيْرِ بْنِ شَكَلِ بْنِ حُمَيْدٍ، عَنْ أَبِيهِ قَالَ‏:‏ قُلْتُ‏:‏ يَا رَسُولَ اللهِ، عَلِّمْنِي دُعَاءً أَنْتَفِعُ بِهِ، قَالَ‏:‏ قُلِ‏:‏ اللَّهُمَّ عَافِنِي مِنْ شَرِّ سَمْعِي، وَبَصَرِي، وَلِسَانِي، وَقَلْبِي، وَشَرِّ مَنِيِّي‏.‏","english":{"narrator":"Shakal ibn Humayd said, \"Messenger of Allah, teach me a supplication\nthat will benefit me.\" He said, \"Say:","text":"'O Allah, protect me from the evil\nof my sight and hearing, my tongue, my heart, and the evil of my desire.'\""}},{"id":61,"idInBook":61,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا قَبِيصَةُ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ عَبْدِ اللهِ بْنِ الْحَارِثِ، عَنْ طَلِيقِ بْنِ قَيْسٍ، عَنْ عَبْدِ اللهِ بْنِ عَبَّاسٍ قَالَ‏:‏ كَانَ النَّبِيُّ صلى الله عليه وسلم يَقُولُ‏:‏ اللَّهُمَّ أَعِنِّي وَلاَ تُعِنْ عَلَيَّ، وَانْصُرْنِي وَلاَ تَنْصُرْ عَلَيَّ، وَيَسِّرِ الْهُدَى لِي‏.‏","english":{"narrator":"","text":"'Abdullah ibn 'Abbas reported that the Messenger of Allah may Allah\nbless him and grant him peace, used to say, \"O Allah, help me and do not\nhelp against me. Support me and do not support anyone against me. Make\nguidance easy for me.\""}},{"id":62,"idInBook":62,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا أَبُو حَفْصٍ، قَالَ‏:‏ حَدَّثَنَا يَحْيَى، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ قَالَ‏:‏ سَمِعْتُ عَمْرَو بْنَ مُرَّةَ قَالَ‏:‏ سَمِعْتُ عَبْدَ اللهِ بْنَ الْحَارِثِ قَالَ‏:‏ سَمِعْتُ طَلِيقَ بْنَ قَيْسٍ، عَنِ ابْنِ عَبَّاسٍ قَالَ‏:‏ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَدْعُو بِهَذَا‏:‏ رَبِّ أَعِنِّي وَلاَ تُعِنْ عَلَيَّ، وَانْصُرْنِي وَلاَ تَنْصُرْ عَلَيَّ، وَامْكُرْ لِي وَلاَ تَمْكُرْ عَلَيَّ، وَيَسِّرْ لِيَ الْهُدَى، وَانْصُرْنِي عَلَى مَنْ بَغَى عَلَيَّ‏.‏ رَبِّ اجْعَلْنِي شَكَّارًا لَكَ، ذَكَّارًا لَكَ، رَاهِبًا لَكَ، مِطْوَاعًا لَكَ، مُخْبِتًا لَكَ، أَوَّاهًا مُنِيبًا، تَقَبَّلْ تَوْبَتِي، وَاغْسِلْ حَوْبَتِي، وَأَجِبْ دَعْوَتِي، وَثَبِّتْ حُجَّتِي، وَاهْدِ قَلْبِي، وَسَدِّدْ لِسَانِي، وَاسْلُلْ سَخِيمَةَ قَلْبِي‏.‏","english":{"narrator":"Ibn 'Abbas said, \"I heard the Prophet, may Allah bless him and\ngrant him peace, making supplication with these words:","text":"'O Allah, help me\nand do not help anyone against me. Devise for me and do not devise against\nme. Make guidance easy for me. Avert from me the one who attacks me. O\nLord, make me grateful to You, remember You, fearful of You, obedient to\nYou and humble to You, supplicating, penitent. Accept my repentance. Wash\naway my wrong actions and answer my supplication. Establish my proof and\nguide my heart. Make my tongue correct and make resentment flow out of\nmy heart.'\""}},{"id":63,"idInBook":63,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ قَالَ‏:‏ حَدَّثَنِي مَالِكٌ، عَنْ يَزِيدَ بْنِ زِيَادٍ، عَنْ مُحَمَّدِ بْنِ كَعْبٍ الْقُرَظِيِّ، قَالَ مُعَاوِيَةُ بْنُ أَبِي سُفْيَانَ عَلَى الْمِنْبَرِ‏:‏ إِنَّهُ لاَ مَانِعَ لِمَا أَعْطَيْتَ، وَلاَ مُعْطِيَ لِمَا مَنَعَ اللَّهُ، وَلاَ يَنْفَعُ ذَا الْجَدِّ مِنْهُ الْجَدُّ‏.‏ وَمَنْ يُرِدِ اللَّهُ بِهِ خَيْرًا يُفَقِّهْهُ فِي الدِّينِ، سَمِعْتُ هَؤُلاَءِ الْكَلِمَاتِ مِنَ النَّبِيِّ صلى الله عليه وسلم عَلَى هَذِهِ الأعْوَادِ‏.‏","english":{"narrator":"","text":"Mu'awiya ibn Abi Sufyan said on the minbar, \"None can withhold\nwhat You give nor give what Allah withholds. The effort of a person who\nmakes an effort does not benefit him. When Allah desires good for a person,\nHe gives him understanding in the deen.\" He added, \"I heard these words\nfrom the Prophet, may Allah bless him and grant him peace.\""}},{"id":64,"idInBook":64,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ‏:‏ حَدَّثَنَا الْهَيْثَمُ بْنُ جَمِيلٍ، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ مُسْلِمٍ، عَنِ ابْنِ أَبِي حُسَيْنٍ قَالَ‏:‏ أَخْبَرَنِي عَمْرُو بْنُ أَبِي سُفْيَانَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ إِنَّ أَوْثَقَ الدُّعَاءِ أَنْ تَقُولَ‏:‏ اللَّهُمَّ أَنْتَ رَبِّي، وَأَنَا عَبْدُكَ، ظَلَمْتُ نَفْسِي، وَاعْتَرَفْتُ بِذَنْبِي، لاَ يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ، رَبِّ اغْفِرْ لِي‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"The firmest supplication is to say, 'O Allah, you\nare my Lord and I am Your slave. I have wronged myself and I admit my wrong\naction. Only You forgive wrong actions, Lord, forgive me.'\""}},{"id":65,"idInBook":65,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا يَحْيَى بْنُ بِشْرٍ، قَالَ‏:‏ حَدَّثَنَا أَبُو قَطَنٍ، عَنِ ابْنِ أَبِي سَلَمَةَ يَعْنِي عَبْدَ الْعَزِيزِ، عَنْ قُدَامَةَ بْنِ مُوسَى، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ كَانَ رَسُولُ اللهِ صلى الله عليه وسلم يَدْعُو‏:‏ اللَّهُمَّ أَصْلِحْ لِي دِينِي الَّذِي هُوَ عِصْمَةُ أَمْرِي، وَأَصْلِحْ لِي دُنْيَايَ الَّتِي فِيهَا مَعَاشِي، وَاجْعَلِ الْمَوْتَ رَحْمَةً لِي مِنْ كُلِّ سُوءٍ، أَوْ كَمَا قَالَ‏.‏","english":{"narrator":"Abu Hurayra reported, \"The Messenger of , may Allah bless him and\ngrant him peace, used to use this supplication:","text":"'O Allah, make my deen\ncorrect - it is the support of my affairs. Make my deen correct -\nit contains my livelihood. Make death a mercy for me from every evil.'\""}},{"id":66,"idInBook":66,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا عَلِيٌّ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، قَالَ‏:‏ حَدَّثَنَا سُمَيٌّ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ كَانَ النَّبِيُّ صلى الله عليه وسلم يَتَعَوَّذُ مِنْ جَهْدِ الْبَلاَءِ، وَدَرَكِ الشَّقَاءِ، وَسُوءِ الْقَضَاءِ، وَشَمَاتَةِ الأعداء‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, used to seek refuge \"from the trouble of affliction, meeting\nwith wretchedness, an evil decree, and the gloating of enemies.\""}},{"id":67,"idInBook":67,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا عُبَيْدُ اللهِ، عَنْ إِسْرَائِيلَ، عَنْ أَبِي إِسْحَاقَ، عَنْ عَمْرِو بْنِ مَيْمُونٍ، عَنْ عُمَرَ قَالَ‏:‏ كَانَ النَّبِيُّ صلى الله عليه وسلم يَتَعَوَّذُ مِنَ الْخَمْسِ‏:‏ مِنَ الْكَسَلِ، وَالْبُخْلِ، وَسُوءِ الْكِبَرِ، وَفِتْنَةِ الصَّدْرِ، وَعَذَابِ الْقَبْرِ‏.‏","english":{"narrator":"'Umar said, \"The Prophet, may Allah bless him and grant him peace,\nused to seek refuge from five things:","text":"laziness, miserliness, bad pride,\nthe trial of what is in the breast, and the punishment of the grave.\""}},{"id":68,"idInBook":68,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ‏:‏ حَدَّثَنَا مُعْتَمِرٌ قَالَ‏:‏ سَمِعْتُ أَبِي قَالَ‏:‏ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ يَقُولُ‏:‏ كَانَ النَّبِيُّ صلى الله عليه وسلم يَقُولُ‏:‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْعَجْزِ وَالْكَسَلِ، وَالْجُبْنِ وَالْهَرَمِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ‏.‏","english":{"narrator":"","text":"Anas ibn Malik said, \"The Prophet, may Allah bless him and grant\nhim peace, used to say, 'O Allah, I seek refuge with You from incapacity,\nlaziness, cowardice and old age. I seek refuge with You from the trials\nof life and death. I seek refuge with You from the punishment of the grave.'\""}},{"id":69,"idInBook":69,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا الْمَكِّيُّ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ اللهِ بْنُ سَعِيدِ بْنِ أَبِي هِنْدَ، عَنْ عَمْرِو بْنِ أَبِي عَمْرٍو، عَنْ أَنَسٍ قَالَ‏:‏ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ‏:‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ، وَالْعَجْزِ وَالْكَسَلِ، وَالْجُبْنِ وَالْبُخْلِ، وَضَلَعِ الدَّيْنِ، وَغَلَبَةِ الرِّجَالِ‏.‏","english":{"narrator":"","text":"Anas said, \"I heard the Prophet, may Allah bless him and grant\nhim peace, say, 'O Allah, I seek refuge with You from concern, sorrow,\nincapacity, laziness, cowardice, miserliness, being deeply in debt and\nbeing overpowered by men.'\""}},{"id":70,"idInBook":70,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ عَبْدِ الْوَهَّابِ، قَالَ‏:‏ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الرَّحْمَنِ الْمَسْعُودِيُّ، عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ، عَنْ أَبِي الرَّبِيعِ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ كَانَ مِنْ دُعَاءِ النَّبِيِّ صلى الله عليه وسلم‏:‏ اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ، وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي، إِنَّكَ أَنْتَ الْمُقَدَّمُ وَالْمُؤَخِّرُ، لا إِلَهَ إِلا أَنْتَ‏.‏","english":{"narrator":"","text":"Abu Hurayra said, \"One of the supplications of the Prophet, may\nAllah bless him and grant him peace, was 'O Allah, forgive me for my past\nand future wrong actions, what I conceal and what I divulge, and what You\nknow of me. You are the One who puts ahead and delays. There is no god\nbut You.\""}},{"id":71,"idInBook":71,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا عَمْرُو بْنُ مَرْزُوقٍ، قَالَ‏:‏ أَخْبَرَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، عَنْ أَبِي الأَحْوَصِ، عَنْ عَبْدِ اللهِ قَالَ‏:‏ كَانَ النَّبِيُّ صلى الله عليه وسلم يَدْعُو‏:‏ اللَّهُمَّ إِنِّي أَسْأَلُكَ الْهُدَى، وَالْعَفَافَ، وَالْغِنَى‏.‏ وَقَالَ أَصْحَابُنَا، عَنْ عَمْرٍو وَالتُّقَى‏.‏","english":{"narrator":"","text":"'Abdullah said, \"The Prophet, may Allah bless him and grant him\npeace, used to make this supplication, 'O Allah, I ask You for guidance, abstention and wealth.'\" \n\nAnd it has been narrated \"and heedfulness.\""}},{"id":72,"idInBook":72,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا بَيَانٌ، قَالَ‏:‏ حَدَّثَنَا يَزِيدُ، قَالَ‏:‏ حَدَّثَنَا الْجُرَيْرِيُّ، عَنْ ثُمَامَةَ بْنِ حَزْنٍ قَالَ‏:‏ سَمِعْتُ شَيْخًا يُنَادِي بِأَعْلَى صَوْتِهِ‏:‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الشَّرِّ لاَ يَخْلِطُهُ شَيْءٌ، قُلْتُ‏:‏ مَنْ هَذَا الشَّيْخُ‏؟‏ قِيلَ‏:‏ أَبُو الدَّرْدَاءِ‏.‏","english":{"narrator":"","text":"Thumana ibn Huzn said, \"I heard a shaykh call out in a loud voice,\n'O Allah, I seek refuge with You from unadulterated evil.' I asked, 'Who\nis this shaykh?' I was told, 'Abu'd-Darda'.'\""}},{"id":73,"idInBook":73,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا أَبُو عَامِرٍ، قَالَ‏:‏ حَدَّثَنَا إِسْرَائِيلُ، عَنْ مَجْزَأَةَ، عَنْ عَبْدِ اللهِ بْنِ أَبِي أَوْفَى، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَقُولُ‏:‏ اللَّهُمَّ طَهِّرْنِي بِالثَّلْجِ وَالْبَرَدِ وَالْمَاءِ الْبَارِدِ، كَمَا يُطَهَّرُ الثَّوْبُ الدَّنِسُ مِنَ الْوَسَخِ، ثُمَّ يَقُولُ‏:‏ اللَّهُمَّ رَبَّنَا لَكَ الْحَمْدُ مِلْءَ السَّمَاءِ وَمِلْءَ الأَرْضِ، وَمِلْءَ مَا شِئْتَ مِنْ شَيْءٍ بَعْدُ‏.‏","english":{"narrator":"","text":"'Abdullah ibn Abi 'Awfa reported that the Prophet, may Allah bless\nhim and grant him peace, used to say, \"O Allah, purify me with ice, snow\nand cold water as the dirty garment is cleansed of dirt. O Allah, our Lord,\npraise is Yours in quantity as great as the sky and as great as the earth\nand as great as You wish from anything beyond that.\""}},{"id":74,"idInBook":74,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا عَمْرُو بْنُ مَرْزُوقٍ، قَالَ‏:‏ أَخْبَرَنَا شُعْبَةُ، قَالَ‏:‏ حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يُكْثِرُ أَنْ يَدْعُوَ بِهَذَا الدُّعَاءِ‏:‏ اللَّهُمَّ آتِنَا فِي الدُّنْيَا حَسَنَةً، وَفِي الْآخِرَةِ حَسَنَةً، وَقِنَا عَذَابَ النَّارِ‏.‏","english":{"narrator":"","text":"Anas reported that the Prophet, may Allah bless him and grant him\npeace, used to make supplication with this supplication, \"O Allah, give\nus good in this world and good in the Next World and protect us from the\npunishment of the Fire.\""}},{"id":75,"idInBook":75,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى، قَالَ‏:‏ حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ سَلَمَةَ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللهِ بْنِ أَبِي طَلْحَةَ، عَنْ سَعِيدِ بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ، كَانَ النَّبِيُّ صلى الله عليه وسلم يَقُولُ‏:‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْفَقْرِ وَالْقِلَّةِ وَالذِّلَّةِ، وَأَعُوذُ بِكَ أَنْ أَظْلِمَ أَوْ أُظْلَمَ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, used to say, \"O Allah, I seek refuge with You from poverty,\nneed and abasement. I seek refuge with You from being unjust or wronged.\""}},{"id":76,"idInBook":76,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ، قَالَ‏:‏ حَدَّثَنَا مُعْتَمِرٌ، عَنْ لَيْثٍ، عَنْ ثَابِتِ بْنِ عَجْلاَنَ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ أَبِي أُمَامَةَ قَالَ‏:‏ كُنَّا عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَدَعَا بِدُعَاءٍ كَثِيرٍ لاَ نَحْفَظُهُ، فَقُلْنَا‏:‏ دَعَوْتَ بِدُعَاءٍ لاَ نَحْفَظُهُ‏؟‏ فَقَالَ‏:‏ سَأُنَبِّئُكُمْ بِشَيْءٍ يَجْمَعُ ذَلِكَ كُلَّهُ لَكُمْ‏:‏ اللَّهُمَّ إِنَّا نَسْأَلُكَ مِمَّا سَأَلَكَ نَبِيُّكَ مُحَمَّدٌ صلى الله عليه وسلم، وَنَسْتَعِيذُكَ مِمَّا اسْتَعَاذَكَ مِنْهُ نَبِيُّكَ مُحَمَّدٌ صلى الله عليه وسلم، اللَّهُمَّ أَنْتَ الْمُسْتَعَانُ وَعَلَيْكَ الْبَلاَغُ، وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ، أَوْ كَمَا قَالَ‏.‏","english":{"narrator":"Abu Umama said, \"We were with the Prophet, may Allah bless him\nand grant him peace, and he made many supplications which we did not remember.\nWe said, 'You make supplications which we do not remember.' He said, 'I\nwill inform you of something which will combine all of them for you:","text":"\"O\nAllah, We ask You for what Your Prophet Muhammad asked You, and we seek\nrefuge with You from what Your Prophet Muhammad sought refuge. O Allah,\nYou are the One to whom one turns for help and You are the One who brings\nit about. There is no power nor strength except by Allah,\" or words to\nthat effect.'\""}},{"id":77,"idInBook":77,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، قَالَ‏:‏ حَدَّثَنَا اللَّيْثُ، عَنْ يَزِيدَ بْنِ الْهَادِ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ قَالَ‏:‏ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ‏:‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ النَّارِ‏.‏","english":{"narrator":"","text":"'Amr ibn Shu'ayb reported from his father that his grandfather said, \"I heard the\nProphet, may Allah bless him and grant him peace, say, 'O Allah, I seek\nrefuge with You from the trial of the Dajjal and I seek refuge with You\nfrom the trial of the Fire.'\""}},{"id":78,"idInBook":78,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، قَالَ‏:‏ حَدَّثَنَا أَبُو بَكْرٍ، عَنْ نُصَيْرِ بْنِ أَبِي الأَشْعَثِ، عَنْ عَطَاءِ بْنِ السَّائِبِ، عَنْ سَعِيدٍ قَالَ‏:‏ كَانَ ابْنُ عَبَّاسٍ يَقُولُ‏:‏ اللَّهُمَّ قَنَّعْنِي بِمَا رَزَقْتَنِي، وَبَارِكْ لِي فِيهِ، وَاخْلُفْ عَلَيَّ كُلَّ غَائِبَةٍ بِخَيْرٍ‏.‏","english":{"narrator":"","text":"Ibn 'Abbas used to say, \"O Allah, make me content with the provision\nYou have given me and bless me in it and appoint good for me in every thing\nwhich I do not have.\""}},{"id":79,"idInBook":79,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ عَبْدِ الْعَزِيزِ، عَنْ أَنَسٍ قَالَ‏:‏ كَانَ أَكْثَرُ دُعَاءِ النَّبِيِّ صلى الله عليه وسلم‏:‏ اللَّهُمَّ آتِنَا فِي الدُّنْيَا حَسَنَةً، وَفِي الْآخِرَةِ حَسَنَةً، وَقِنَا عَذَابَ النَّارِ‏.‏","english":{"narrator":"","text":"Anas said, \"The most frequent supplication of the Prophet, may\nAllah bless him and grant him peace, was, 'O Allah, give us good in this\nworld and good in the Next World and protect us from the punishment of\nthe Fire.'\""}},{"id":80,"idInBook":80,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا الْحَسَنُ بْنُ الرَّبِيعِ، قَالَ‏:‏ حَدَّثَنَا أَبُو الأَحْوَصِ، عَنِ الأَعْمَشِ، عَنْ أَبِي سُفْيَانَ، وَيَزِيدَ، عَنْ أَنَسٍ قَالَ‏:‏ كَانَ النَّبِيُّ صلى الله عليه وسلم يُكْثِرُ أَنْ يَقُولَ‏:‏ اللَّهُمَّ يَا مُقَلِّبَ الْقُلُوبِ، ثَبِّتْ قَلْبِي عَلَى دِينِكَ‏.‏","english":{"narrator":"","text":"Anas said, \"The Prophet, may Allah bless him and grant him peace,\nmost frequently said, \"O Allah, O Overturner of hearts, make my heart firm\nin Your deen.\""}},{"id":81,"idInBook":81,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا آدَمُ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، قَالَ‏:‏ حَدَّثَنَا رَجُلٌ مِنْ أَسْلَمَ يُقَالُ لَهُ‏:‏ مَجْزَأَةُ قَالَ‏:‏ سَمِعْتُ عَبْدَ اللهِ بْنَ أَبِي أَوْفَى، عَنِ النَّبِيِّ صلى الله عليه وسلم، أَنَّهُ كَانَ يَدْعُو‏:‏ اللَّهُمَّ لَكَ الْحَمْدُ مِلْءَ السَّمَاوَاتِ وَمِلْءَ الأَرْضِ، وَمِلْءَ مَا شِئْتَ مِنْ شَيْءٍ بَعْدُ، اللَّهُمَّ طَهِّرْنِي بِالْبَرْدِ وَالثَّلْجِ وَالْمَاءِ الْبَارِدِ، اللَّهُمَّ طَهِّرْنِي مِنَ الذُّنُوبِ، وَنَقِّنِي كَمَا يُنَقَّى الثَّوْبُ الأَبْيَضُ مِنَ الدَّنَسِ‏.‏","english":{"narrator":"'Abdullah ibn Abi Awfa reported that the Prophet, may Allah bless\nhim and grant him peace, used to use this supplication:","text":"'O Allah, praise\nis Yours in quantity as great as the heavens and in quantity as great as\nthe earth and in quantity as great as You wish from anything else. O Allah,\npurify me with ice, snow and cold water. O Allah, purify me from wrong\nactions and clean me as the white garment is cleansed of dirt.'\""}},{"id":82,"idInBook":82,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ الْغَفَّارِ بْنُ دَاوُدَ، قَالَ‏:‏ حَدَّثَنَا يَعْقُوبُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ عَبْدِ اللهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللهِ بْنِ عُمَرَ قَالَ‏:‏ كَانَ مِنْ دُعَاءِ رَسُولِ اللهِ صلى الله عليه وسلم‏:‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ زَوَالِ نِعْمَتِكَ، وَتَحَوُّلِ عَافِيَتِكَ، وَفُجَأَةِ نِقْمَتِكَ، وَجَمِيعِ سَخَطِكَ‏.‏","english":{"narrator":"","text":"'Abdullah ibn 'Umar said, \"One of the supplications of the Messenger\nof Allah was, 'O Allah, I seek refuge with You from the disappearance of\nYour blessing and from the loss of good health and Your sudden vengeance\nand all of Your anger.'\""}},{"id":83,"idInBook":83,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا خَلاَّدُ بْنُ يَحْيَى، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنِ الْمِقْدَامِ بْنِ شُرَيْحِ بْنِ هَانِئٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ‏:‏ كَانَ رَسُولُ اللهِ صلى الله عليه وسلم إِذَا رَأَى نَاشِئًا فِي أُفُقٍ مِنْ آفَاقِ السَّمَاءِ، تَرَكَ عَمَلَهُ، وَإِنْ كَانَ فِي صَلاَةٍ، ثُمَّ أَقْبَلَ عَلَيْهِ، فَإِنْ كَشَفَهُ اللَّهُ حَمِدَ اللَّهَ، وَإِنْ مَطَرَتْ قَالَ‏:‏ اللَّهُمَّ صَيِّبًا نَافِعًا‏.‏","english":{"narrator":"","text":"'A'isha said, \"When the Messenger of Allah, may Allah bless him\nand grant him peace, saw a cloud rising from the horizon, he would leave\nwhat he was doing, even if it was the prayer, and face towards it. If Allah\ndispersed it, he praised Allah, and if it rained, he said, 'O Allah, make\nit a useful fall!'\""}},{"id":84,"idInBook":84,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ‏:‏ حَدَّثَنَا يَحْيَى، عَنْ إِسْمَاعِيلَ قَالَ‏:‏ حَدَّثَنِي قَيْسٌ قَالَ‏:‏ أَتَيْتُ خَبَّابًا، وَقَدِ اكْتَوَى سَبْعًا، وَقَالَ‏:‏ لَوْلاَ أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم نَهَانَا أَنْ نَدْعُوَ بِالْمَوْتِ لَدَعَوْتُ‏ بِهِ.‏","english":{"narrator":"","text":"Isma'il ibn Qays said, \"I came to Khabbab when he had been cauterised\nseven times. He said, 'If it had not been that the Messenger of Allah,\nmay Allah bless him and grant him peace, had forbidden us to pray for death,\nI would have done so.'\""}},{"id":85,"idInBook":85,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ الصَّبَّاحِ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، عَنِ ابْنِ أَبِي مُوسَى، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم، أَنَّهُ كَانَ يَدْعُو بِهَذَا الدُّعَاءِ‏:‏ رَبِّ اغْفِرْ لِي خَطِيئَتِي وَجَهْلِي، وَإِسْرَافِي فِي أَمْرِي كُلِّهِ، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي، اللَّهُمَّ اغْفِرْ لِي خَطَئِي كُلَّهُ، وَعَمْدِي وَجَهْلِي وَهَزْلِي، وَكُلُّ ذَلِكَ عِنْدِي‏.‏ اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ، وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ، أَنْتَ الْمُقَدِّمُ وَأَنْتَ الْمُؤَخِّرُ، وَأَنْتَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ‏.‏","english":{"narrator":"","text":"Abu Musa reported that the Prophet, may Allah bless him and grant\nhim peace, used to make this supplication, \"O Allah, forgive my errors,\nmy ignorance and my excess in all my affairs, and what You know better\nthan me of these things. O Allah, forgive all my errors, what I do intentionally\nor out of my ignorance or in jest and in all that I do. O Allah, forgive\nme my past and future wrong actions, what I conceal of them and what I\ndivulge. You are the One who puts things ahead and the One who delays them.\nYou have power over all things.\""}},{"id":86,"idInBook":86,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا ابْنُ الْمُثَنَّى، قَالَ‏:‏ حَدَّثَنَا عُبَيْدُ اللهِ بْنُ عَبْدِ الْمَجِيدِ، قَالَ‏:‏ حَدَّثَنَا إِسْرَائِيلُ، قَالَ‏:‏ حَدَّثَنَا أَبُو إِسْحَاقَ، عَنْ أَبِي بَكْرِ بْنِ أَبِي مُوسَى، وَأَبِي بُرْدَةَ، أَحْسَبُهُ عَنْ أَبِي مُوسَى الأَشْعَرِيِّ، عَنِ النَّبِيِّ صلى الله عليه وسلم، أَنَّهُ كَانَ يَدْعُو‏:‏ اللَّهُمَّ اغْفِرْ لِي خَطِيئَتِي وَجَهْلِي وَإِسْرَافِي فِي أَمْرِي، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي، اللَّهُمَّ اغْفِرْ لِي هَزْلِي وَجَدِّي، وَخَطَئِي وَعَمْدِي، وَكُلُّ ذَلِكَ عِنْدِي‏.‏","english":{"narrator":"","text":"Abu Musa al-Ash'ari used to use this supplication, \"O Allah, forgive\nmy errors, my ignorance and my extravagance in my affairs and what You\nknow better than I do. O Allah, forgive me what I do both in jest and seriousness,\nmy errors and what I do intentionally and all that I do.\""}},{"id":87,"idInBook":87,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا أَبُو عَاصِمٍ، عَنْ حَيْوَةَ، قَالَ‏:‏ حَدَّثَنَا عُقْبَةُ بْنُ مُسْلِمٍ، سَمِعَ أَبَا عَبْدِ الرَّحْمَنِ الْحُبُلِيَّ، عَنِ الصُّنَابِحِيّ، عَنْ مُعَاذِ بْنِ جَبَلٍ قَالَ‏:‏ أَخَذَ بِيَدِي النَّبِيُّ صلى الله عليه وسلم فَقَالَ‏:‏ يَا مُعَاذُ، قُلْتُ‏:‏ لَبَّيْكَ، قَالَ‏:‏ إِنِّي أُحِبُّكَ، قُلْتُ‏:‏ وَأَنَا وَاللَّهِ أُحِبُّكَ، قَالَ‏:‏ أَلاَ أُعَلِّمُكَ كَلِمَاتٍ تَقُولُهَا فِي دُبُرِ كُلِّ صَلاَتِكَ‏؟‏ قُلْتُ‏:‏ نَعَمْ، قَالَ‏:‏ قُلِ‏:‏ اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ، وَشُكْرِكَ، وَحُسْنِ عِبَادَتِكَ‏.‏","english":{"narrator":"Mu'adh ibn Jabal said, \"The Prophet, may Allah bless him and grant\nhim peace, took my hand and then said, \"Mu'adh!' 'At your service!' I said.\nHe said, 'I love you.' I replied, 'And, by Allah, I love you.' He asked,\n'Shall I teach you some words to say at the end of your prayer?' 'Yes,'\nI replied. He said, 'Say:","text":"\"O Allah, help me to remember You and thank You\nand help me to the best manner of worshipping You.\"'\""}},{"id":88,"idInBook":88,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا مُسَدَّدٌ، وَخَلِيفَةُ قَالاَ‏:‏ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، قَالَ‏:‏ حَدَّثَنَا الْجُرَيْرِيُّ، عَنْ أَبِي الْوَرْدِ، عَنْ أَبِي مُحَمَّدٍ الْحَضْرَمِيِّ، عَنْ أَبِي أَيُّوبَ الأَنْصَارِيِّ قَالَ‏:‏ قَالَ رَجُلٌ عِنْدَ النَّبِيِّ صلى الله عليه وسلم‏:‏ الْحَمْدُ لِلَّهِ حَمْدًا كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ مَنْ صَاحِبُ الْكَلِمَةِ‏؟‏ فَسَكَتَ، وَرَأَى أَنَّهُ هَجَمَ مِنَ النَّبِيِّ صلى الله عليه وسلم عَلَى شَيْءٍ كَرِهَهُ، فَقَالَ‏:‏ مَنْ هُوَ‏؟‏ فَلَمْ يَقُلْ إِلاَّ صَوَابًا، فَقَالَ رَجُلٌ‏:‏ أَنَا، أَرْجُو بِهَا الْخَيْرَ، فَقَالَ‏:‏ وَالَّذِي نَفْسِي بِيَدِهِ، رَأَيْتُ ثَلاَثَةَ عَشَرَ مَلَكًا يَبْتَدِرُونَ أَيُّهُمْ يَرْفَعُهَا إِلَى اللهِ عَزَّ وَجَلَّ‏.‏","english":{"narrator":"","text":"Abu Ayyub al-Ansari said, \"A man said in the presence of the Prophet,\nmay Allah bless him and grant him peace, 'Praise belongs to Allah with\nblessed and abundant praise.; The Prophet, may Allah bless him and grant\nhim peace, said, 'Who said that?' The man was silent, thinking that it\nwas a reprimand from the Prophet, may Allah bless him and grant him peace,\nfor something he disliked. He asked again, 'Who was it? He said nothing\nincorrect.' The man said, 'I did, and I hope for good by it.' He said,\n'By the One in whose hand my soul is, I saw thirteen angels racing one\nanother to see which of them would take it to Allah Almighty.'\""}},{"id":89,"idInBook":89,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا أَبُو النُّعْمَانِ، قَالَ‏:‏ حَدَّثَنَا سَعِيدُ بْنُ زَيْدٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ صُهَيْبٍ قَالَ‏:‏ حَدَّثَنِي أَنَسٌ قَالَ‏:‏ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا أَرَادَ أَنْ يَدْخُلَ الْخَلاَءَ قَالَ‏:‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْخُبْثِ وَالْخَبَائِثِ‏.‏","english":{"narrator":"","text":"Anas said, \"When the Prophet, may Allah bless him and grant him\npeace, wanted to enter the lavatory, he said, 'O Allah, I seek refuge with\nYou from foulness and foul things.'\""}},{"id":90,"idInBook":90,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيلَ، قَالَ‏:‏ حَدَّثَنَا إِسْرَائِيلُ، عَنْ يُوسُفَ بْنِ أَبِي بُرْدَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ‏:‏ كَانَ رَسُولُ اللهِ صلى الله عليه وسلم إِذَا خَرَجَ مِنَ الْخَلاَءِ قَالَ‏:‏ غُفْرَانَكَ‏.‏","english":{"narrator":"","text":"'A'isha said, \"When the Messenger of Allah, may Allah bless him\nand grant him peace, left the lavatory, he said, 'Your forgiveness!'\""}},{"id":91,"idInBook":91,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، قَالَ‏:‏ حَدَّثَنَا بَكْرُ بْنُ سُلَيْمٍ الصَّوَّافُ قَالَ‏:‏ حَدَّثَنِي حُمَيْدُ بْنُ زِيَادٍ الْخَرَّاطُ، عَنْ كُرَيْبٍ مَوْلَى ابْنِ عَبَّاسٍ، قَالَ‏:‏ حَدَّثَنَا ابْنُ عَبَّاسٍ قَالَ‏:‏ كَانَ النَّبِيُّ صلى الله عليه وسلم يُعَلِّمُنَا هَذَا الدُّعَاءَ كَمَا يُعَلِّمُنَا السُّورَةَ مِنَ الْقُرْآنِ‏:‏ أَعُوذُ بِكَ مِنْ عَذَابِ جَهَنَّمَ، وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْقَبْرِ‏.‏","english":{"narrator":"Ibn 'Abbas said, \"The Prophet, may Allah bless him and grant him\npeace, used to teach us this supplication as he taught us the suras of\nthe Qur'an:","text":"'I seek refuge with You from the punishment of Hellfire, and\nI seek refuge with You from the punishment of the grave. I seek refuge\nwith You from the trial of the Dajjal and the I seek refuge from the trials\nof life and death. I seek refuge with You from the trial of the grave.'\""}},{"id":92,"idInBook":92,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللهِ، قَالَ‏:‏ حَدَّثَنَا ابْنُ مَهْدِيٍّ، عَنْ سُفْيَانَ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، عَنْ كُرَيْبٍ، عَنِ ابْنِ عَبَّاسٍ قَالَ‏:‏ بِتُّ عِنْدَ مَيْمُونَةَ، فَقَامَ النَّبِيُّ صلى الله عليه وسلم فَأَتَى حَاجَتَهُ، فَغَسَلَ وَجْهَهُ وَيَدَيْهِ ثُمَّ نَامَ، ثُمَّ قَامَ فَأَتَى الْقِرْبَةَ فَأَطْلَقَ شِنَاقَهَا، ثُمَّ تَوَضَّأَ وُضُوءًا بَيْنَ وُضُوءَيْنِ، لَمْ يُكْثِرْ وَقَدْ أَبْلَغَ، فَصَلَّى، فَقُمْتُ فَتَمَطَّيْتُ كَرَاهِيَةَ أَنْ يَرَى أَنِّي كُنْتُ أَبْقِيهِ، فَتَوَضَّأْتُ، فَقَامَ يُصَلِّي، فَقُمْتُ عِنْدَ يَسَارِهِ، فَأَخَذَ بِأُذُنِي فَأَدَارَنِي عَنْ يَمِينِهِ، فَتَتَامَّتْ صَلاَتُهُ مِنَ اللَّيْلِ ثَلاَثَ عَشْرَةَ رَكْعَةً، ثُمَّ اضْطَجَعَ فَنَامَ حَتَّى نَفَخَ، وَكَانَ إِذَا نَامَ نَفَخَ، فَآذَنَهُ بِلاَلٌ بِالصَّلاَةِ، فَصَلَّى وَلَمْ يَتَوَضَّأْ، وَكَانَ فِي دُعَائِهِ‏:‏ اللَّهُمَّ اجْعَلْ فِي قَلْبِي نُورًا، وَفِي سَمْعِي نُورًا، وَعَنْ يَمِينِي نُورًا، وَعَنْ يَسَارِي نُورًا، وَفَوْقِي نُورًا، وَتَحْتِي نُورًا، وَأَمَامِي نُورًا، وَخَلْفِي نُورًا، وَأَعْظِمْ لِي نُورًا‏.‏","english":{"narrator":"","text":"Ibn 'Abbas said, \"I spent the night at the house of my aunt. Maymuna.\nThe Prophet, may Allah bless him and grant him peace, got up to answer\na call of nature and then washed his hands and face and slept. Then he\ngot up and took the water-skin and loosened its strap and then did a medium\nsort of wudu' and no more but he did it adequately. Then he prayed. I stood\nup and went slowly, not wanting him to see that I was observing him. I\ndid wudu'. Then he stood up to pray and I stood at his left. He took my\nhand and brought me around to his right. His complete night prayer consisted\nof twelve rak'ats. Then he lay down and went to sleep until he snored.\nWhen he slept, he would snore. Bilal gave the adhan for the morning prayer\nand he prayed without doing wudu'. One of his supplications was, 'O Allah,\nput light in my heart and light in my hearing and light on my right and\nlight on my left and a light above me and a light behind me and a light\nin front of me and a light behind him and make my light great.'\""}},{"id":93,"idInBook":93,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللهِ قَالَ‏:‏ حَدَّثَنِي عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، عَنْ عَبْدِ الْمَجِيدِ بْنِ سُهَيْلِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ يَحْيَى بْنِ عَبَّادٍ أَبِي هُبَيْرَةَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنْ عَبْدِ اللهِ بْنِ عَبَّاسٍ قَالَ‏:‏ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا قَامَ مِنَ اللَّيْلِ، فَصَلَّى فَقَضَى صَلاَتَهُ، يُثْنِي عَلَى اللهِ بِمَا هُوَ أَهْلُهُ، ثُمَّ يَكُونُ مِنْ آخِرِ كَلاَمِهِ‏:‏ اللَّهُمَّ اجْعَلْ لِي نُورًا فِي قَلْبِي، وَاجْعَلْ لِي نُورًا فِي سَمْعِي، وَاجْعَلْ لِي نُورًا فِي بَصَرِي، وَاجْعَلْ لِي نُورًا عَنْ يَمِينِي، وَنُورًا عَنْ شِمَالِي، وَاجْعَلْ لِي نُورًا مِنْ بَيْنَ يَدَيَّ، وَنُورًا مِنْ خَلْفِي، وَزِدْنِي نُورًا، وَزِدْنِي نُورًا، وَزِدْنِي نُورًا‏.‏","english":{"narrator":"","text":"'Abdullah ibn 'Abbas said, \"When the Prophet, may Allah bless him\nand grant him peace, prayed the night prayer, and finished his prayer,\nglorifying Allah as he deserves, he said at the end of it, 'O Allah, give\nme a light in my heart and give me a light in my hearing and give me a\nlight in my sight. Give me a light on my right and a light on my left and\ngive me a light in front of me and a light behind me and increase me in\nlight. Increase me in light, and increase me in light.'\""}},{"id":94,"idInBook":94,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ قَالَ‏:‏ حَدَّثَنِي مَالِكٌ، عَنْ أَبِي الزُّبَيْرِ، عَنْ طَاوُسٍ الْيَمَانِيِّ، عَنْ عَبْدِ اللهِ بْنِ عَبَّاسٍ‏:‏ كَانَ رَسُولُ اللهِ صلى الله عليه وسلم إِذَا قَامَ إِلَى الصَّلاَةِ مِنْ جَوْفِ اللَّيْلِ قَالَ‏:‏ اللَّهُمَّ لَكَ الْحَمْدُ، أَنْتَ نُورُ السَّمَاوَاتِ وَالأَرْضِ وَمَنْ فِيهِنَّ، وَلَكَ الْحَمْدُ، أَنْتَ قَيَّامُ السَّمَاوَاتِ وَالأَرْضِ، وَلَكَ الْحَمْدُ أَنْتَ رَبُّ السَّمَاوَاتِ وَالأَرْضِ وَمَنْ فِيهِنَّ، أَنْتَ الْحَقُّ، وَوَعْدُكَ الْحَقُّ، وَلِقَاؤُكَ الْحَقُّ، وَالْجَنَّةُ حَقٌّ، وَالنَّارُ حَقٌّ، وَالسَّاعَةُ حَقٌّ‏.‏ اللَّهُمَّ لَكَ أَسْلَمْتُ، وَبِكَ آمَنْتُ، وَعَلَيْكَ تَوَكَّلْتُ، وَإِلَيْكَ أَنَبْتُ، وَبِكَ خَاصَمْتُ، وَإِلَيْكَ حَاكَمْتُ، فَاغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ، وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ، أَنْتَ إِلَهِي، لا إِلَهَ إِلا أَنْتَ‏.‏","english":{"narrator":"","text":"'Abdullah ibn 'Abbas said \"When the Messenger of Allah, may Allah\nbless him and grant him peace, rose to pray in the middle of the night,\nhe would say, 'O Allah, Yours is the praise. You are the light of the heavens\nand the earth and whoever is in them. Yours is the praise. You are the\nLord of the heavens and the earth and whoever is in them. You are the Truth\nand Your promise is true and the meeting with You is true. The Garden is\ntrue and the Fire is true and the Hour is true. O Allah, I have surrendered\nto You and I have believed in You. I have trusted in You and I repent to\nYou. I argue by You and I have come to You for judgement. Forgive me my\npast and future wrong actions, what I conceal and what I show. You are\nMy God. There is no god but You.\""}},{"id":95,"idInBook":95,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا الْوَلِيدُ بْنُ صَالِحٍ، قَالَ‏:‏ حَدَّثَنَا عُبَيْدُ اللهِ بْنُ عَمْرٍو، عَنْ زَيْدِ بْنِ أَبِي أُنَيْسَةَ، عَنْ يُونُسَ بْنِ خَبَّابٍ، عَنْ نَافِعِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ، عَنِ ابْنِ عَبَّاسٍ قَالَ‏:‏ كَانَ النَّبِيُّ صلى الله عليه وسلم يَدْعُو‏:‏ اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَافِيَةَ فِي دِينِي وَأَهْلِي، وَاسْتُرْ عَوْرَتِي، وَآمِنْ رَوْعَتِي، وَاحْفَظْنِي مِنْ بَيْنَ يَدَيَّ، وَمِنْ خَلْفِي، وَعَنْ يَمِينِي، وَعَنْ يَسَارِي، وَمِنْ فَوْقِي، وَأَعُوذُ بِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي‏.‏","english":{"narrator":"Ibn 'Abbas said, \"The Prophet, may Allah bless him and grant him peace, used to make this supplication:","text":"'O Allah, I ask You for pardon and good health in this world and the Next. O Allah, I ask You for good health\nin my deen and my family. Veil my faults and assuage my terror. Guard me before me, behind me, on my right and my left and above me. I seek refuge with You from unexpected destruction from beneath me.'\""}},{"id":96,"idInBook":96,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا عَلِيٌّ، قَالَ‏:‏ حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ أَيْمَنَ، قَالَ‏:‏ حَدَّثَنَا عُبَيْدُ بْنُ رِفَاعَةَ الزُّرَقِيُّ، عَنْ أَبِيهِ قَالَ‏:‏ لَمَّا كَانَ يَوْمُ أُحُدٍ وَانْكَفَأَ الْمُشْرِكُونَ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ اسْتَوُوا حَتَّى أُثْنِيَ عَلَى رَبِّي عَزَّ وَجَلَّ، فَصَارُوا خَلْفَهُ صُفُوفًا، فَقَالَ‏:‏ اللَّهُمَّ لَكَ الْحَمْدُ كُلُّهُ، اللَّهُمَّ لاَ قَابِضَ لِمَا بَسَطْتَ، وَلاَ مُقَرِّبَ لِمَا بَاعَدْتَ، وَلاَ مُبَاعِدَ لِمَا قَرَّبْتَ، وَلاَ مُعْطِيَ لِمَا مَنَعْتَ، وَلاَ مَانِعَ لِمَا أَعْطَيْتَ‏.‏ اللَّهُمَّ ابْسُطْ عَلَيْنَا مِنْ بَرَكَاتِكَ وَرَحْمَتِكَ وَفَضْلِكَ وَرِزْقِكَ، اللَّهُمَّ إِنِّي أَسْأَلُكَ النَّعِيمَ الْمُقِيمَ الَّذِي لاَ يَحُولُ وَلاَ يَزُولُ‏.‏ اللَّهُمَّ إِنِّي أَسْأَلُكَ النَّعِيمَ يَوْمَ الْعَيْلَةِ، وَالأَمْنَ يَوْمَ الْحَرْبِ، اللَّهُمَّ عَائِذًا بِكَ مِنْ سُوءِ مَا أَعْطَيْتَنَا، وَشَرِّ مَا مَنَعْتَ مِنَّا‏.‏ اللَّهُمَّ حَبِّبْ إِلَيْنَا الإِيمَانَ وَزَيِّنْهُ فِي قُلُوبِنَا، وَكَرِّهْ إِلَيْنَا الْكُفْرَ وَالْفُسُوقَ وَالْعِصْيَانَ، وَاجْعَلْنَا مِنَ الرَّاشِدِينَ‏.‏ اللَّهُمَّ تَوَفَّنَا مُسْلِمِينَ، وَأَحْيِنَا مُسْلِمِينَ، وَأَلْحِقْنَا بِالصَّالِحِينَ، غَيْرَ خَزَايَا وَلاَ مَفْتُونِينَ‏.‏ اللَّهُمَّ قَاتِلِ الْكَفَرَةَ الَّذِينَ يَصُدُّونَ عَنْ سَبِيلِكَ، وَيُكَذِّبُونَ رُسُلَكَ، وَاجْعَلْ عَلَيْهِمْ رِجْزَكَ وَعَذَابَكَ‏.‏ اللَّهُمَّ قَاتِلِ الْكَفَرَةَ الَّذِينَ أُوتُوا الْكِتَابَ، إِلَهَ الْحَقِّ‏.‏","english":{"narrator":"","text":"Rifa'a az-Zurqi said, \"In the Battle of Uhud when the idolaters\nretreated, the Messenger of Allah, may Allah bless him and grant him peace,\nsaid, 'Form straight ranks so that I can praise my Almighty Lord.' They\nformed in ranks behind him. He said, 'O Allah, all praise is due to You.\nO Allah, none can contract what You expand nor bring near what you put\nfar away. None can put far away what You bring near. None can give what\nYou withhold nor withhold what You give. O Allah, expand to us some of\nYour blessings, mercy and favour and give us provision! O Allah, I ask\nYou for the abiding blessing which is neither changed nor removed. O Allah,\nI ask You for blessing on the Day of Utter Poverty and security on the\nDay of Fear. O Allah, I seek refuge with You from the evil of what You\ngive us. O Allah, make us love belief and adorn our hearts with it. Make\nus hate disbelief, deviance and rebellion. Place us among the rightly-guided.\nO Allah, make us die Muslims and make us live as Muslims and join us to\nthe rightly, acting, who are neither disappointed nor afflicted. O Allah,\nfight the unbelievers who bar your path and who deny Your Messengers. Place\nYou abasement and punishment over them. O Allah, fight the unbelievers\nwho were given the Book, O Lord of Truth!'\""}},{"id":97,"idInBook":97,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا مُسْلِمٌ، قَالَ‏:‏ حَدَّثَنَا هِشَامٌ، قَالَ‏:‏ حَدَّثَنَا قَتَادَةُ، عَنْ أَبِي الْعَالِيَةِ، عَنِ ابْنِ عَبَّاسٍ قَالَ‏:‏ كَانَ النَّبِيُّ صلى الله عليه وسلم يَدْعُو عِنْدَ الْكَرْبِ‏:‏ لاَ إِلَهَ إِلاَّ اللَّهُ الْعَظِيمُ الْحَلِيمُ، لاَ إِلَهَ إِلاَّ اللَّهُ رَبُّ السَّمَاوَاتِ وَالأَرْضِ وَرَبِّ الْعَرْشِ الْعَظِيمِ‏.‏","english":{"narrator":"Ibn 'Abbas said, \"The Prophet, may Allah bless him and grant him\npeace, made the following supplication during affliction:","text":"'There is no\ngod but Allah, the Immense, the Forbearing. There is no god but Prophet,\nthe Lord of the heavens and the earth and the Lord of the Immense Throne.'\""}},{"id":98,"idInBook":98,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ عَمْرٍو، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْجَلِيلِ، عَنْ جَعْفَرِ بْنِ مَيْمُونٍ قَالَ‏:‏ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ أَبِي بَكْرَةَ، أَنَّهُ قَالَ لأَبِيهِ‏:‏ يَا أَبَتِ، إِنِّي أَسْمَعُكَ تَدْعُو كُلَّ غَدَاةٍ‏:‏ اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصَرِي، لاَ إِلَهَ إِلاَّ أَنْتَ، تُعِيدُهَا ثَلاَثًا حِينَ تُمْسِي، وَحِينَ تُصْبِحُ ثَلاَثًا، وَتَقُولُ‏:‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكُفْرِ وَالْفَقْرِ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، لاَ إِلَهَ إِلاَّ أَنْتَ، تُعِيدُهَا ثَلاَثًا حِينَ تُمْسِي، وَحِينَ تُصْبِحُ ثَلاَثًا، فَقَالَ‏:‏ نَعَمْ، يَا بُنَيَّ، سَمِعْتُ رَسُولَ اللهِ صلى الله عليه وسلم يَقُولُ بِهِنَّ، وَأَنَا أُحِبُّ أَنْ أَسْتَنَّ بِسُنَّتِهِ‏.‏","english":{"narrator":"'Abdu'r-Rahman ibn Abi Bakra reported that he said to his father,\n\"I heard you making this supplication every morning:","text":"'O Allah, make me\nhealthy in my body. O Allah, make me healthy in my hearing. O Allah, make\nme healthy in my sight. There is no god but You.' You repeat it three times\nin the evening and three times in the morning. And you say, 'O Allah, I seek\nrefuge with You from disbelief and poverty. O Allah, I seek refuge with\nYou from the punishment of the grave. There is no god but You,' and you\nrepeat it three times in the evening and three times in the morning.\" He\nreplied, :Yes, my son. I heard the Messenger of Allah, may Allah bless\nhim and grant him peace, say them and I like to follow his sunnah.\""}},{"id":99,"idInBook":99,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْعَزِيزِ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ الْخَطَّابِ بْنِ عُبَيْدِ اللهِ بْنِ أَبِي بَكْرَةَ قَالَ‏:‏ حَدَّثَنِي رَاشِدٌ أَبُو مُحَمَّدٍ، عَنْ عَبْدِ اللهِ بْنِ الْحَارِثِ قَالَ‏:‏ سَمِعْتُ ابْنَ عَبَّاسٍ يَقُولُ‏:‏ كَانَ النَّبِيُّ صلى الله عليه وسلم يَقُولُ عِنْدَ الْكَرْبِ‏:‏ لاَ إِلَهَ إِلاَّ اللَّهُ الْعَظِيمُ الْحَلِيمُ، لاَ إِلَهَ إِلاَّ اللَّهُ رَبُّ الْعَرْشِ الْعَظِيمِ، لاَ إِلَهَ إِلاَّ اللَّهُ رَبُّ السَّمَاوَاتِ وَرَبُّ الأَرْضِ وَرَبُّ الْعَرْشِ الْكَرِيمِ، اللَّهُمَّ اصْرِفْ شَرَّهُ‏.‏","english":{"narrator":"Ibn 'Abbas said, \"The Prophet, may Allah bless him and grant him peace, made the following supplication during affliction:","text":"'There is no\ngod but Allah, the Immense, the Forbearing. There is no god but Allah, Lord of the Immense Throne, there is no god but Allah, the Lord of the heavens and the earth and the Lord of the Immense Throne.' O Allah, avert its evil.\""}},{"id":100,"idInBook":100,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا مُطَرِّفُ بْنُ عَبْدِ اللهِ أَبُو الْمُصْعَبِ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي الْمَوَالِ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرٍ قَالَ‏:‏ كَانَ النَّبِيُّ صلى الله عليه وسلم يُعَلِّمُنَا الِاسْتِخَارَةَ فِي الأُمُورِ كَالسُّورَةِ مِنَ الْقُرْآنِ‏:‏ إِذَا هَمَّ بِالأَمْرِ فَلْيَرْكَعْ رَكْعَتَيْنِ ثُمَّ يَقُولُ‏:‏ اللَّهُمَّ إِنِّي أَسْتَخِيرُكَ بِعِلْمِكَ، وَأَسْتَقْدِرُكَ بِقُدْرَتِكَ، وَأَسْأَلُكَ مِنْ فَضْلِكَ الْعَظِيمِ، فَإِنَّكَ تَقْدِرُ وَلاَ أَقْدِرُ، وَتَعْلَمُ وَلاَ أَعْلَمُ، وَأَنْتَ عَلاَّمُ الْغُيُوبِ‏.‏ اللَّهُمَّ إِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الأَمْرَ خَيْرٌ لِي فِي دِينِي، وَمَعَاشِي، وَعَاقِبَةِ أمري، أَوْ قَالَ‏:‏ فِي عَاجِلِ أَمْرِي وَآجِلِهِ، فَاقْدُرْهُ لِي، وَإِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الأَمْرَ شَرٌّ لِي فِي دِينِي، وَمَعَاشِي، وَعَاقِبَةِ، أَوْ قَالَ‏:‏ عَاجِلِ، أَمْرِي وَآجِلِهِ فَاصْرِفْهُ عَنِّي وَاصْرِفْنِي عَنْهُ، وَاقْدُرْ لِيَ الْخَيْرَ حَيْثُ كَانَ، ثُمَّ رَضِّنِي، وَيُسَمِّي حَاجَتَهُ‏.‏","english":{"narrator":"","text":"Jabir said, \"The Prophet. may Allah bless him and grant him peace,\nused to teach us the istikhara in matters just as if it was a sura\nof the Qur'an. He said, 'When someone is concerned about something, he\nshould pray two rak'ats and then say, 'O Allah, I ask You for the good\nby Your knowledge and I ask You for strength by Your power and I ask You\nfor some of Your immense abundant favour, You have the power and I do not.\nYou know and I do not know. You are the Knower of the Unseen Worlds. O\nAllah, if You know that this affair is good for me in my deen, my livelihood\nand the end of my affair (or he said 'in the beginning of my affair') and\nits conclusion, then avert it from me and avert me from it. Decree for\nme the good wherever it is and then make me content.\" Then he should state\nwhat he needs.'\""}},{"id":101,"idInBook":101,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ بْنُ حَمْزَةَ قَالَ‏:‏ حَدَّثَنِي كَثِيرُ بْنُ زَيْدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَعْبٍ قَالَ‏:‏ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللهِ يَقُولُ‏:‏ دَعَا رَسُولُ اللهِ صلى الله عليه وسلم فِي هَذَا الْمَسْجِدِ، مَسْجِدِ الْفَتْحِ، يَوْمَ الِاثْنَيْنِ وَيَوْمَ الثُّلاَثَاءِ وَيَوْمَ الأَرْبِعَاءِ، فَاسْتُجِيبَ لَهُ بَيْنَ الصَّلاَتَيْنِ مِنْ يَوْمِ الأَرْبِعَاءِ قَالَ جَابِرٌ‏:‏ وَلَمْ يَنْزِلْ بِي أَمْرٌ مُهِمٌّ غائِظٌ إِلاَّ تَوَخَّيْتُ تِلْكَ السَّاعَةَ، فَدَعَوْتُ اللَّهَ فِيهِ بَيْنَ الصَّلاَتَيْنِ يَوْمَ الأَرْبِعَاءِ فِي تِلْكَ السَّاعَةِ، إِلا عَرَفْتُ الإجَابَةَ‏.‏","english":{"narrator":"","text":"Jabir ibn 'Abdullah said, \"The Messenger of Allah, may Allah bless\nhim and grant him peace, made supplication in this mosque, the Mosque of\nVictory, on Monday, Tuesday and Wednesday, and it was answered for him\nbetween the two prayers on Wednesday,\" Jabir said, \"Whenever anything severe\nand serious happened to me and I singled out that time and made supplication\nto Allah concerning it between the two prayers on Wednesday, I found the\nanswer.'\""}},{"id":102,"idInBook":102,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا عَلِيٌّ بْنِ خَلَفِ بْنِ خَلِيفَةَ قَالَ‏:‏ حَدَّثَنِي حَفْصُ ابْنُ أَخِي أَنَسٍ، عَنْ أَنَسٍ‏:‏ كُنْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم، فَدَعَا رَجُلٌ فَقَالَ‏:‏ يَا بَدِيعَ السَّمَاوَاتِ، يَا حَيُّ يَا قَيُّومُ، إِنِّي أَسْأَلُكَ‏.‏ فَقَالَ‏:‏ أَتَدْرُونَ بِمَا دَعَا‏؟‏ وَالَّذِي نَفْسِي بِيَدِهِ، دَعَا اللَّهَ بِاسْمِهِ الَّذِي إِذَا دُعِيَ بِهِ أَجَابَ‏.‏","english":{"narrator":"","text":"Anas said, \"I was with the Prophet, may Allah bless him and grant\nhim peace, when a man made supplication, saying, 'O Originator of the heavens!\nO Living, Self-Subsistent! I ask of You.' He said, 'Do you know by what\nhe has made supplication? By the One in whose hand my soul is, he has asked\nAllah by the Name that He answers when He is asked by it.\""}},{"id":103,"idInBook":103,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانَ، قَالَ‏:‏ حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ‏:‏ أَخْبَرَنِي عَمْرٌو، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ أَبِي الْخَيْرِ، أَنَّهُ سَمِعَ عَبْدَ اللهِ بْنَ عَمْرٍو قَالَ‏:‏ قَالَ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ لِلنَّبِيِّ صلى الله عليه وسلم‏:‏ عَلِّمْنِي دُعَاءً أَدْعُو بِهِ فِي صَلاَتِي، قَالَ‏:‏ قُلِ‏:‏ اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْمًا كَثِيرًا، وَلاَ يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ، فَاغْفِرْ لِي مِنْ عِنْدِكَ مَغْفِرَةً، إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ‏.‏","english":{"narrator":"","text":"'Abdullah ibn 'Amr was heard to say, \"Abu Bakr, may Allah be pleased\nwith him, said to the Prophet, may Allah bless him and grant him peace,\n'Teach me a supplication which I can use in my prayer.' He said, 'Say,\n\"O Allah, I have wronged myself greatly. Only You forgive wrong actions.\nForgive me with forgiveness directly from you. You are the Ever-Forgiving,\nMost Merciful.\"'\""}},{"id":104,"idInBook":104,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ، قَالَ‏:‏ حَدَّثَنَا عِيسَى بْنُ يُونُسَ، عَنِ الأَعْمَشِ، قَالَ‏:‏ حَدَّثَنَا ثُمَامَةُ بْنُ عُقْبَةَ قَالَ‏:‏ سَمِعْتُ الْحَارِثَ بْنَ سُوَيْدٍ يَقُولُ‏:‏ قَالَ عَبْدُ اللهِ بْنُ مَسْعُودٍ‏:‏ إِذَا كَانَ عَلَى أَحَدِكُمْ إِمَامٌ يَخَافُ تَغَطْرُسَهُ أَوْ ظُلْمَهُ، فَلْيَقُلِ‏:‏ اللَّهُمَّ رَبَّ السَّمَاوَاتِ السَّبْعِ، وَرَبَّ الْعَرْشِ الْعَظِيمِ، كُنْ لِي جَارًا مِنْ فُلاَنِ بْنِ فُلاَنٍ وَأَحْزَابِهِ مِنْ خَلاَئِقِكَ، أَنْ يَفْرُطَ عَلَيَّ أَحَدٌ مِنْهُمْ أَوْ يَطْغَى، عَزَّ جَارُكَ، وَجَلَّ ثَنَاؤُكَ، وَلا إِلَهَ إِلا أَنْتَ‏.‏","english":{"narrator":"","text":"'Abdullah ibn Mas'ud said, \"When there is a ruler in charge of\nyou whose arrogance or injustice is feared, you should say, 'O Allah, Lord\nof the Seven Heavens and Lord of the Immense Throne, be my Protector against\nso-and-so, the son of so-and-so, and his followers among Your creatures\nso that none of them exceeds the bounds towards me or oppresses me. Your\nprotection is mighty and Your praise is great. There is no god but You.'\""}},{"id":105,"idInBook":105,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ‏:‏ حَدَّثَنَا يُونُسُ، عَنِ الْمِنْهَالِ بْنِ عَمْرٍو قَالَ‏:‏ حَدَّثَنِي سَعِيدُ بْنُ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ قَالَ‏:‏ إِذَا أَتَيْتَ سُلْطَانًا مَهِيبًا، تَخَافُ أَنْ يَسْطُوَ بِكَ، فَقُلِ‏:‏ اللَّهُ أَكْبَرُ، اللَّهُ أَعَزُّ مِنْ خَلْقِهِ جَمِيعًا، اللَّهُ أَعَزُّ مِمَّا أَخَافُ وَأَحْذَرُ، وَأَعُوذُ بِاللَّهِ الَّذِي لاَ إِلَهَ إِلاَّ هُوَ، الْمُمْسِكُ السَّمَاوَاتِ السَّبْعَ أَنْ يَقَعْنَ عَلَى الأَرْضِ إِلاَّ بِإِذْنِهِ، مِنْ شَرِّ عَبْدِكَ فُلاَنٍ، وَجُنُودِهِ وَأَتْبَاعِهِ وَأَشْيَاعِهِ مِنَ الْجِنِّ وَالإِنْسِ، اللَّهُمَّ كُنْ لِي جَارًا مِنْ شَرِّهِمْ، جَلَّ ثَنَاؤُكَ، وَعَزَّ جَارُكَ، وَتَبَارَكَ اسْمُكَ، وَلاَ إِلَهَ غَيْرُكَ، ثَلاَثَ مَرَّاتٍ‏.‏","english":{"narrator":"","text":"Ibn 'Abbas said, \"When you go to an awesome ruler and fear that\nhe will attack you, say, 'Allah is greater. Allah is mightier than all\nHis creation and Allah is greater than all that is feared and all that\nyou are wary of. I seek refuge with Allah. There is no god but Him, the\nOne who keeps the seven heavens from falling onto the earth by nothing\nexcept His permission, from the evil of your slave so-and-so and his armies\nand followers and supporters, both among jinn and men. O Allah, be my protector\nagainst their evil. Your praise is great and Your protection is immense,\nBlessed is Your Name. There is no god but You' three times.\""}},{"id":106,"idInBook":106,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى، قَالَ‏:‏ حَدَّثَنَا سُكَيْنُ بْنُ عَبْدِ الْعَزِيزِ بْنِ قَيْسٍ، أَخْبَرَنِي أَبِي، أَنَّ ابْنَ عَبَّاسٍ حَدَّثَهُ قَالَ‏:‏ مَنْ نَزَلَ بِهِ هَمٌّ أَوْ غَمٌّ أَوْ كَرْبٌ أَوْ خَافَ مِنْ سُلْطَانٍ، فَدَعَا بِهَؤُلاَءِ اسْتُجِيبَ لَهُ‏:‏ أَسْأَلُكَ بِلاَ إِلَهَ إِلاَّ أَنْتَ، رَبُّ السَّمَاوَاتِ السَّبْعِ، وَرَبُّ الْعَرْشِ الْعَظِيمِ، وَأَسْأَلُكَ بِلاَ إِلَهَ إِلاَّ أَنْتَ، رَبُّ السَّمَاوَاتِ السَّبْعِ، وَرَبُّ الْعَرْشِ الْكَرِيمِ، وَأَسْأَلُكَ بِلاَ إِلَهَ إِلاَّ أَنْتَ رَبُّ السَّمَاوَاتِ السَّبْعِ وَالأَرَضِينَ السَّبْعِ وَمَا فِيهِنَّ، إِنَّكَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، ثُمَّ سَلِ اللَّهَ حَاجَتَكَ‏.‏","english":{"narrator":"Ibn 'Abbas said, \"Whoever has a worry, sorrow or grief or fears\na ruler, should use this supplication and he will be answered. It is:","text":"'I\nask You by (the words) \"There is no god but You, the Lord of the seven\nheavens and the Lord of the Immense Throne\" and I ask You by (the words)\n\"There is no god but You, the Lord of the seven heavens and the Lord of\nthe Immense Throne\" and I ask You by (the words) \"There is no god but You,\nthe Lord of the seven heavens and the seven earths and what is in them.\nYou have power over all things.'\" Then he should ask for what he needs.\""}},{"id":107,"idInBook":107,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا إِسْحَاقُ بْنُ نَصْرٍ، قَالَ‏:‏ حَدَّثَنَا حَمَّادُ بْنُ أُسَامَةَ، عَنْ عَلِيِّ بْنِ عَلِيٍّ قَالَ‏:‏ سَمِعْتُ أَبَا الْمُتَوَكِّلِ النَّاجِيَّ قَالَ‏:‏ قَالَ أَبُو سَعِيدٍ الْخُدْرِيُّ، عَنِ النَّبِيِّ صلى الله عليه وسلم‏:‏ مَا مِنْ مُسْلِمٍ يَدْعُو، لَيْسَ بِإِثْمٍ وَلاَ بِقَطِيعَةِ رَحِمٍ، إِلاَّ أَعْطَاهُ إِحْدَى ثَلاَثٍ‏:‏ إِمَّا أَنْ يُعَجِّلَ لَهُ دَعْوَتَهُ، وَإِمَّا أَنْ يَدَّخِرَهَا لَهُ فِي الْآخِرَةِ، وَإِمَّا أَنْ يَدْفَعَ عَنْهُ مِنَ السُّوءِ مِثْلَهَا، قَالَ‏:‏ إِذًا نُكْثِرُ، قَالَ‏:‏ اللَّهُ أَكْثَرُ‏.‏","english":{"narrator":"Abu Sa'id al-Khudri reported that the Prophet, may Allah bless\nhim and grant him peace, said, \"No Muslim makes supplication - unless\nhe is someone who has cut off his relatives - but that he is given\none of three things:","text":"either his supplication is answered quickly, or it\nis stored up for him in the Next World, or an evil equal to it is averted\nfrom him.\" It was said, \"Then many supplications will be made.\" He replied,\n\"Allah has more still to give.\""}},{"id":108,"idInBook":108,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا ابْنُ شَيْبَةَ قَالَ‏:‏ أَخْبَرَنِي ابْنُ أَبِي الْفُدَيْكِ قَالَ‏:‏ حَدَّثَنِي عُبَيْدُ اللهِ بْنُ مَوْهَبٍ، عَنْ عَمِّهِ عُبَيْدِ اللهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ مَا مِنْ مُؤْمِنٍ يَنْصُبُ وَجْهَهُ إِلَى اللهِ يَسْأَلُهُ مَسْأَلَةً، إِلاَّ أَعْطَاهُ إِيَّاهَا، إِمَّا عَجَّلَهَا لَهُ فِي الدُّنْيَا، وَإِمَّا ذَخَرَهَا لَهُ فِي الْآخِرَةِ مَا لَمْ يَعْجَلْ، قَالَ‏:‏ يَا رَسُولَ اللهِ، وَمَا عَجَلَتُهُ‏؟‏ قَالَ‏:‏ يَقُولُ‏:‏ دَعَوْتُ وَدَعَوْتُ، وَلاَ أُرَاهُ يُسْتَجَابُ لِي‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"No believer turns his face to Allah and asks Him\nfor something but that He gives it to him, either by giving it to him sooner\nin this world or storing it up for him in the Next World, as long as he\ndoes not try to make it come quickly.\" They asked, \"Messenger of Allah,\nwhat does 'making it come quickly' mean?\" He said, \"He says, 'I asked and\nasked and do not think that I will be answered.'\""}},{"id":109,"idInBook":109,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا عَمْرُو بْنُ مَرْزُوقٍ، قَالَ‏:‏ أَخْبَرَنَا عِمْرَانُ، عَنْ قَتَادَةَ، عَنْ سَعِيدِ بْنِ أَبِي الْحَسَنِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ لَيْسَ شَيْءٌ أَكْرَمَ عَلَى اللهِ مِنَ الدُّعَاءِ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"Nothing is dearer to Allah than supplication.\""}},{"id":110,"idInBook":110,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا خَلِيفَةُ، قَالَ‏:‏ حَدَّثَنَا أَبُو دَاوُدَ، قَالَ‏:‏ حَدَّثَنَا عِمْرَانُ، عَنْ قَتَادَةَ، عَنْ سَعِيدِ بْنِ أَبِي الْحَسَنِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ أَشْرَفُ الْعِبَادَةِ الدُّعَاءُ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"The noblest act of worship is supplication.\""}},{"id":111,"idInBook":111,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا أَبُو الْوَلِيدِ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، عَنْ مَنْصُورٍ، عَنْ ذَرٍّ، عَنْ يُسَيْعَ، عَنِ النُّعْمَانِ بْنِ بَشِيرٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ إِنَّ الدُّعَاءَ هُوَ الْعِبَادَةُ، ثُمَّ قَرَأَ‏:‏ ‏{‏ادْعُونِي أَسْتَجِبْ لَكُمْ‏}‏‏.‏","english":{"narrator":"","text":"An-Nu'man ibn Bashir reported that the Prophet, may Allah bless\nhim and grant him peace, said, \"Supplication is worship.' Then he recited,\n'Call on Me and I will answer you.'\""}},{"id":112,"idInBook":112,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا عُبَيْدُ اللهِ، عَنِ مُبَارَكِ بْنِ حَسَّانَ، عَنْ عَطَاءٍ، عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ‏:‏ سُئِلَ النَّبِيُّ صلى الله عليه وسلم‏:‏ أَيُّ الْعِبَادَةِ أَفْضَلُ‏؟‏ قَالَ‏:‏ دُعَاءُ الْمَرْءِ لِنَفْسِهِ‏.‏","english":{"narrator":"","text":"'A'isha said, \"The Prophet, may Allah bless him and grant him peace,\nwas asked, 'Which type of worship is best?' He replied, 'A man's supplication\nfor himself.'\""}},{"id":113,"idInBook":113,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا عَبَّاسٌ النَّرْسِيُّ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْوَاحِدِ، قَالَ‏:‏ حَدَّثَنَا لَيْثٌ قَالَ‏:‏ أَخْبَرَنِي رَجُلٌ مِنْ أَهْلِ الْبَصْرَةِ قَالَ‏:‏ سَمِعْتُ مَعْقِلَ بْنَ يَسَارٍ يَقُولُ‏:‏ انْطَلَقْتُ مَعَ أَبِي بَكْرٍ الصِّدِّيقِ رَضِيَ اللَّهُ عَنْهُ إِلَى النَّبِيِّ صلى الله عليه وسلم، فَقَالَ‏:‏ يَا أَبَا بَكْرٍ، لَلشِّرْكُ فِيكُمْ أَخْفَى مِنْ دَبِيبِ النَّمْلِ، فَقَالَ أَبُو بَكْرٍ‏:‏ وَهَلِ الشِّرْكُ إِلاَّ مَنْ جَعَلَ مَعَ اللهِ إِلَهًا آخَرَ‏؟‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ وَالَّذِي نَفْسِي بِيَدِهِ، لَلشِّرْكُ أَخْفَى مِنْ دَبِيبِ النَّمْلِ، أَلاَ أَدُلُّكَ عَلَى شَيْءٍ إِذَا قُلْتَهُ ذَهَبَ عَنْكَ قَلِيلُهُ وَكَثِيرُهُ‏؟‏ قَالَ‏:‏ قُلِ‏:‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ أَنْ أُشْرِكَ بِكَ وَأَنَا أَعْلَمُ، وَأَسْتَغْفِرُكَ لِمَا لا أَعْلَمُ‏.‏","english":{"narrator":"","text":"Maqil bin Yasar (ra) said that he came to the Prophet (ﷺ) with Abu Bakr (ra). He said, \"O Abu Bakr, polytheism enters your people more quietly (secretly) than the movement of ants.\" Abu Bakr asked, \"Is there a kind of polytheism besides associating anything with Allah?\" The Prophet (ﷺ) said,\" By him who has my life in his power, polytheism is more concealed than the movement of ants. Shall I not teach you something which if you say will eliminate minor or major (polytheism)?\" He then said, \"Say `O Allah! I seek refuge in you lest I associate anything with you while I know it, and I seek your forgiveness for what I do not know.’\""}},{"id":114,"idInBook":114,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا خَلِيفَةُ، قَالَ‏:‏ حَدَّثَنَا ابْنُ مَهْدِيٍّ، قَالَ‏:‏ حَدَّثَنَا الْمُثَنَّى هُوَ ابْنُ سَعِيدٍ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ قَالَ‏:‏ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا هَاجَتْ رِيحٌ شَدِيدَةٌ قَالَ‏:‏ اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِ مَا أُرْسِلَتْ بِهِ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا أُرْسِلَتْ بِهِ‏.‏","english":{"narrator":"Anas (ra) said that when a strong wind blew the Prophet (ﷺ) made this supplication:","text":"\"O Allah, I ask you from the good with which it is sent and I seek your protection from the evil with which it is sent\"."}},{"id":115,"idInBook":115,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ أَبِي بَكْرٍ، قَالَ‏:‏ حَدَّثَنَا مُغِيرَةُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ يَزِيدَ، عَنْ سَلَمَةَ قَالَ‏:‏ كَانَ إِذَا اشْتَدَّتِ الرِّيحُ يَقُولُ‏:‏ اللَّهُمَّ لاَقِحًا، لاَ عَقِيمًا‏.‏","english":{"narrator":"It is reported by Yazeed that when the wind was very strong Salamah (ra) made this supplication:","text":"\" O Allah cause this wind to bring rain and let it not be without benefit\"."}},{"id":116,"idInBook":116,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا ابْنُ أَبِي شَيْبَةَ، قَالَ‏:‏ حَدَّثَنَا أَسْبَاطٌ، عَنِ الأَعْمَشِ، عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى، عَنْ أَبِيهِ، عَنْ أَبِي قَالَ‏:‏ لاَ تَسُبُّوا الرِّيحَ، فَإِذَا رَأَيْتُمْ مِنْهَا مَا تَكْرَهُونَ فَقُولُوا‏:‏ اللَّهُمَّ إِنَّا نَسْأَلُكَ خَيْرَ هَذِهِ الرِّيحِ، وَخَيْرَ مَا فِيهَا، وَخَيْرَ مَا أُرْسِلَتْ بِهِ، وَنَعُوذُ بِكَ مِنْ شَرِّ هَذِهِ الرِّيحِ، وَشَرِّ مَا فِيهَا، وَشَرِّ مَا أُرْسِلَتْ بِهِ‏.‏","english":{"narrator":"Ubayy bin Kab (ra) said,\" Do not denounce wind. When you behold in it something that you dislike make this supplication:","text":"(O Allah! We ask you the good of this wind and the good of what is therein and the good with which it is sent.)"}},{"id":117,"idInBook":117,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا مُسَدَّدٌ، عَنْ يَحْيَى، عَنِ الأَوْزَاعِيِّ قَالَ‏:‏ حَدَّثَنِي الزُّهْرِيُّ قَالَ‏:‏ حَدَّثَنِي ثَابِتٌ الزُّرَقِيُّ قَالَ‏:‏ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ الرِّيحُ مِنْ رَوْحِ اللهِ، تَأْتِي بِالرَّحْمَةِ وَالْعَذَابِ، فَلاَ تَسُبُّوهَا، وَلَكِنْ سَلُوا اللَّهَ مِنْ خَيْرِهَا، وَتَعَوَّذُوا بِاللَّهِ مِنْ شَرِّهَا‏.‏","english":{"narrator":"","text":"It is stated by sayidina Abu Hurayrah (ra) that the Messenger of Allah (ﷺ) said \"Wind is the mercy of Allah. It brings mercy or punishment. Do not denounce it but ask Allah, the exalted, for the good of it and seek the protection of Allah from its evil.”"}},{"id":118,"idInBook":118,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، قَالَ‏:‏ حَدَّثَنَا الْحَجَّاجُ قَالَ‏:‏ حَدَّثَنِي أَبُو مَطَرٍ، أَنَّهُ سَمِعَ سَالِمَ بْنَ عَبْدِ اللهِ، عَنْ أَبِيهِ قَالَ‏:‏ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا سَمِعَ الرَّعْدَ وَالصَّوَاعِقَ قَالَ‏:‏ اللَّهُمَّ لاَ تَقْتُلْنَا بِصَعْقِكَ، وَلاَ تُهْلِكْنَا بِعَذَابِكَ، وَعَافِنَا قَبْلَ ذَلِكَ‏.‏","english":{"narrator":"It is reported by Salim bin Abdullah on the authority of his father (Abdullah bin Umar (ra)) that when the prophet (ﷺ) heard a thunder-clap or a thunder-bolt, he would make this supplication:","text":"“O Allah, slay us not with your lightening and destroy us not with your punishment. But, preserve us before that.”"}},{"id":119,"idInBook":119,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا بِشْرٌ، قَالَ‏:‏ حَدَّثَنَا مُوسَى بْنُ عَبْدِ الْعَزِيزِ قَالَ‏:‏ حَدَّثَنِي الْحَكَمُ قَالَ‏:‏ حَدَّثَنِي عِكْرِمَةُ، أَنَّ ابْنَ عَبَّاسٍ كَانَ إِذَا سَمِعَ صَوْتَ الرَّعْدِ قَالَ‏:‏ سُبْحَانَ الَّذِي سَبَّحْتَ لَهُ، قَالَ‏:‏ إِنَّ الرَّعْدَ مَلَكٌ يَنْعِقُ بِالْغَيْثِ، كَمَا يَنْعِقُ الرَّاعِي بِغَنَمِهِ‏.‏","english":{"narrator":"Ibn Abbas (ra) made this supplication when he heard a cloud burst:","text":"“Glory be to him whom you glorified.” He said that the thunderclap is an angel who yells at the rainclouds as a shepherd yells at his sheep/goats."}},{"id":120,"idInBook":120,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ قَالَ‏:‏ حَدَّثَنِي مَالِكُ بْنُ أَنَسٍ، عَنْ عَامِرِ بْنِ عَبْدِ اللهِ بْنِ الزُّبَيْرِ، عَنْ عَبْدِ اللهِ بْنِ الزُّبَيْرِ، أَنَّهُ كَانَ إِذَا سَمِعَ الرَّعْدَ تَرَكَ الْحَدِيثَ وَقَالَ‏:‏ سُبْحَانَ الَّذِي ‏{‏يُسَبِّحُ الرَّعْدُ بِحَمْدِهِ وَالْمَلاَئِكَةُ مِنْ خِيفَتِهِ‏}‏، ثُمَّ يَقُولُ‏:‏ إِنَّ هَذَا لَوَعِيدٌ شَدِيدٌ لأهْلِ الأرْضِ‏.‏","english":{"narrator":"Abdullah bin al-Zubayr (ra) stopped speaking when he heard a thunder-clap and said:","text":"“Glory be to him whose praise the thunderclap sings and the angels glorify in awe of him”. He used to say, then, that the thunder-clap is a stern warning for the dwellers of earth."}},{"id":121,"idInBook":121,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا آدَمُ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، قَالَ‏:‏ حَدَّثَنَا يَزِيدُ بْنُ خُمَيْرٍ قَالَ‏:‏ سَمِعْتُ سُلَيْمَ بْنَ عَامِرٍ، عَنْ أَوْسَطَ بْنِ إِسْمَاعِيلَ قَالَ‏:‏ سَمِعْتُ أَبَا بَكْرٍ الصِّدِّيقَ رَضِيَ اللَّهُ عَنْهُ بَعْدَ وَفَاةِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ قَامَ النَّبِيُّ صلى الله عليه وسلم عَامَ أَوَّلَ مَقَامِي هَذَا، ثُمَّ بَكَى أَبُو بَكْرٍ، ثُمَّ قَالَ‏:‏ عَلَيْكُمْ بِالصِّدْقِ، فَإِنَّهُ مَعَ الْبِرِّ، وَهُمَا فِي الْجَنَّةِ، وَإِيَّاكُمْ وَالْكَذِبَ، فَإِنَّهُ مَعَ الْفُجُورِ، وَهُمَا فِي النَّارِ، وَسَلُوا اللَّهَ الْمُعَافَاةَ، فَإِنَّهُ لَمْ يُؤْتَ بَعْدَ الْيَقِينِ خَيْرٌ مِنَ الْمُعَافَاةِ، وَلاَ تَقَاطَعُوا، وَلاَ تَدَابَرُوا، وَلاَ تَحَاسَدُوا، وَلاَ تَبَاغَضُوا، وَكُونُوا عِبَادَ اللهِ إِخْوَانًا‏.‏","english":{"narrator":"","text":"Awsat bin Ismail has narrated that he heard Abu Bakr (ra) say after the death of the Prophet (ﷺ) “This is the very place where the Prophet (ﷺ), had stood in the first year of Hijrah”. Saying that, he began to weep and added, \"Hold on to truth because that is piety and both these things will carry a man to paradise. And, keep away from falsehood because it is a very grave sin and both of them will carry one to hell. And ask Allah for security because nothing greater than it is given to anyone apart from belief, and do not sever ties among yourselves. Do not turn your backs to one another nor be jealous of one another. And do not harbor mutual hatred. And, live as slaves of Allah, brothers of one another.\""}},{"id":122,"idInBook":122,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا قَبِيصَةُ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنِ الْجُرَيْرِيِّ، عَنْ أَبِي الْوَرْدِ، عَنِ اللَّجْلاَجِ، عَنْ مُعَاذٍ قَالَ‏:‏ مَرَّ النَّبِيُّ صلى الله عليه وسلم عَلَى رَجُلٍ يَقُولُ‏:‏ اللَّهُمَّ إِنِّي أَسْأَلُكَ تَمَامَ النِّعْمَةِ، قَالَ‏:‏ هَلْ تَدْرِي مَا تَمَامُ النِّعْمَةِ‏؟‏ قَالَ‏:‏ تَمَامُ النِّعْمَةِ دُخُولُ الْجَنَّةِ، وَالْفَوْزُ مِنَ النَّارِ‏.‏ ثُمَّ مَرَّ عَلَى رَجُلٍ يَقُولُ‏:‏ اللَّهُمَّ إِنِّي أَسْأَلُكَ الصَّبْرَ، قَالَ‏:‏ قَدْ سَأَلْتَ رَبَّكَ الْبَلاَءَ، فَسَلْهُ الْعَافِيَةَ‏.‏ وَمَرَّ عَلَى رَجُلٍ يَقُولُ‏:‏ يَا ذَا الْجَلاَلِ وَالإِكْرَامِ، قَالَ‏:‏ سَلْ‏.‏","english":{"narrator":"Muaz (ra) said that the Prophet (ﷺ) passed by a man who was saying:","text":"“O Allah, I ask you for all of the blessing.” He asked the man whether he knew what all the blessing meant and he said that it meant admittance to paradise and safety from Hell. Then the Prophet (ﷺ) passed by another man who was saying: “O Allah! I ask you for patience”. The Prophet (ﷺ) said to him, \"You have asked your lord for trial and difficulty over yourself. So, now ask him also for safety (aafiyah)\". The Prophet (ﷺ) then came across a third man who said: “O owner of majesty and splendor!”. The Prophet (ﷺ) said to him, \"Make a request!\" (because you have called Allah by this great attribute)."}},{"id":123,"idInBook":123,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا فَرْوَةُ، قَالَ‏:‏ حَدَّثَنَا عَبِيدَةُ، عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ، عَنْ عَبْدِ اللهِ بْنِ الْحَارِثِ، عَنِ الْعَبَّاسِ بْنِ عَبْدِ الْمُطَّلِبِ، قُلْتُ‏:‏ يَا رَسُولَ اللهِ، عَلِّمْنِي شَيْئًا أَسْأَلُ اللَّهَ بِهِ، فَقَالَ‏:‏ يَا عَبَّاسُ، سَلِ اللَّهَ الْعَافِيَةَ، ثُمَّ مَكَثْتُ ثَلاَثًا، ثُمَّ جِئْتُ فَقُلْتُ‏:‏ عَلِّمْنِي شَيْئًا أَسْأَلُ اللَّهَ بِهِ يَا رَسُولَ اللهِ، فَقَالَ‏:‏ يَا عَبَّاسُ، يَا عَمَّ رَسُولِ اللهِ، سَلِ اللَّهَ الْعَافِيَةَ فِي الدُّنْيَا وَالآخِرَةِ‏.‏","english":{"narrator":"","text":"Abbas bin Abdul Mmuttalib (ra) said that he requested the Messenger of Allah (ﷺ) to teach him a supplication whereby he May request Allah for his needs. The Prophet (ﷺ) said,\"0 Abbas, ask Allah for aafiyah (security). After some days, he again met the Prophet (ﷺ) and asked,\" Teach me a supplication to beseech Allah for my want.\" He said, \"O Abbas! O uncle of the messenger of Allah! Ask Allah for aafiyah (security) in this world and the next.\""}},{"id":124,"idInBook":124,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، قَالَ‏:‏ حَدَّثَنَا أَبُو بَكْرٍ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ قَالَ‏:‏ قَالَ رَجُلٌ عِنْدَ النَّبِيِّ صلى الله عليه وسلم‏:‏ اللَّهُمَّ لَمْ تُعْطِنِي مَالاً فَأَتَصَدَّقَ بِهِ، فَابْتَلِنِي بِبَلاَءٍ يَكُونُ، أَوْ قَالَ‏:‏ فِيهِ أَجْرٌ، فَقَالَ‏:‏ سُبْحَانَ اللهِ، لاَ تُطِيقُهُ، أَلاَ قُلْتَ‏:‏ اللَّهُمَّ آتِنَا فِي الدُّنْيَا حَسَنَةً، وَفِي الْآخِرَةِ حَسَنَةً، وَقِنَا عَذَابَ النَّارِ‏.‏","english":{"narrator":"Anas (ra) said that a man made this supplication in the presence of the Prophet (ﷺ) \"O Allah, you have not bestowed upon me wealth so I cannot give Sadaqah, hence involve me in anxiety so that I may earn reward against that. The prophet said,\" Subhan Allah! You cannot endure difficulty. Why did you not make this supplication?:","text":"(O Allah, let us have the good of this world and the good of the hereafter and save us from the torment of the fire)."}},{"id":125,"idInBook":125,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، قَالَ‏:‏ حَدَّثَنَا زُهَيْرٌ، قَالَ‏:‏ حَدَّثَنَا حُمَيْدٌ، عَنْ أَنَسٍ قَالَ‏:‏ دَخَلَ، قُلْتُ لِحُمَيْدٍ النَّبِيُّ صلى الله عليه وسلم‏؟‏ قَالَ‏:‏ نَعَمْ، دَخَلَ عَلَى رَجُلٍ قَدْ جَهِدَ مِنَ الْمَرَضِ، فَكَأَنَّهُ فَرْخٌ مَنْتُوفٌ، قَالَ‏:‏ ادْعُ اللَّهَ بِشَيْءٍ أَوْ سَلْهُ، فَجَعَلَ يَقُولُ‏:‏ اللَّهُمَّ مَا أَنْتَ مُعَذِّبِي بِهِ فِي الْآخِرَةِ، فَعَجِّلْهُ فِي الدُّنْيَا، قَالَ‏:‏ سُبْحَانَ اللهِ، لاَ تَسْتَطِيعُهُ، أَوَ قَالَ‏:‏ لاَ تَسْتَطِيعُوا، أَلاَ قُلْتَ‏:‏ اللَّهُمَّ آتِنَا فِي الدُّنْيَا حَسَنَةً، وَفِي الْآخِرَةِ حَسَنَةً، وَقِنَا عَذَابَ النَّارِ‏؟‏ وَدَعَا لَهُ، فَشَفَاهُ اللَّهُ عَزَّ وَجَلَّ‏.‏","english":{"narrator":"Anas said that the Prophet (ﷺ) visited a sick man who had withered from sickness to such an extent that he could be compared to a bridling whose feathers had been plucked out. The Prophet (ﷺ) said to him, \"Make supplication for health.\" So, he began to supplicate Allah, \" O Allah whatever punishment you intend to give me in the hereafter, give it to me here, in this life\". The Prophet (ﷺ) said, \"Subhan Allah! You are not able to bear that. Why did you not make this supplication?:","text":"O Allah, grant us what is good in this world and what is good in the hereafter, and save us from the chastisement of the fire.\" Then the Prophet (ﷺ) made a supplication for him and Allah, the Mighty, the Gracious, gave him cure from sickness."}},{"id":126,"idInBook":126,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، قَالَ‏:‏ حَدَّثَنَا أَبِي، قَالَ‏:‏ حَدَّثَنَا الأَعْمَشُ قَالَ‏:‏ حَدَّثَنِي مُجَاهِدٌ، عَنْ عَبْدِ اللهِ بْنِ عَمْرٍو قَالَ‏:‏ يَقُولُ الرَّجُلُ‏:‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ جَهْدِ الْبَلاَءِ، ثُمَّ يَسْكُتُ، فَإِذَا قَالَ ذَلِكَ فَلْيَقُلْ‏:‏ إِلاَّ بَلاَءً فِيهِ عَلاءٌ‏.‏","english":{"narrator":"Abdullah bin Amir (ra) said that a man says:","text":"(O Allah, I seek refuge in you from the distress of trial and then stops. When he makes this supplication he should also say (except a trial that produces elevation of ranks)"}},{"id":127,"idInBook":127,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ سُمَيٍّ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَتَعَوَّذُ مِنْ جَهْدِ الْبَلاَءِ، وَدَرَكِ الشَّقَاءِ، وَشَمَاتَةِ الأعداء، وَسُوءِ الْقَضَاءِ‏.‏","english":{"narrator":"","text":"Abu Hurayrah (ra) has narrated that the Prophet (ﷺ) sought refuge in Allah from the distress of trial, being overtaken by a tribulation, malicious rejoicing of enemies, and perversity of fate."}},{"id":128,"idInBook":128,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ أَبِي بَكْرٍ، وَمُسْلِمٌ نَحْوَهُ، قَالاَ‏:‏ حَدَّثَنَا الأَسْوَدُ بْنُ شَيْبَانَ، عَنْ أَبِي نَوْفَلِ بْنِ أَبِي عَقْرَبَ، أَنَّ أَبَاهُ سَأَلَ النَّبِيَّ صلى الله عليه وسلم عَنِ الصَّوْمِ، فَقَالَ‏:‏ صُمْ يَوْمًا مِنْ كُلِّ شَهْرٍ، قُلْتُ‏:‏ بِأَبِي أَنْتَ وَأُمِّي، زِدْنِي، قَالَ‏:‏ زِدْنِي، زِدْنِي، صُمْ يَوْمَيْنِ مِنْ كُلِّ شَهْرٍ، قُلْتُ‏:‏ بِأَبِي أَنْتَ وَأُمِّي، زِدْنِي، فَإِنِّي أَجِدُنِي قَوِيًّا، فَقَالَ‏:‏ إِنِّي أَجِدُنِي قَوِيًّا، إِنِّي أَجِدُنِي قَوِيًّا، فَأَفْحَمَ، حَتَّى ظَنَنْتُ أَنَّهُ لَنْ يَزِيدَنِي، ثُمَّ قَالَ‏:‏ صُمْ ثَلاَثًا مِنْ كُلِّ شَهْرٍ‏.‏","english":{"narrator":"","text":"Abu Naufal bin Abu Aqrab has narrated on the authority of his father that he asked the Prophet (ﷺ) about (voluntary) fasts. He said,\"observe one fast every month.\" He submitted, \"May my father and mother be ransomed to you, permit me to keep more. \"The Prophet (ﷺ) repeated (in anger) what he had said, \"permit me to keep more, permit me to keep more.” He then added,\" keep two fasts every month\". But, Abu Nawafal’s father again requested, \"May my parents be ransomed to you, allow me to keep more because I find myself able (to observe more), I find myself able, I find myself able.\" He then maintained silence and it seemed that he would not give permission any more until he said,\" keep three fasts every month.\""}},{"id":129,"idInBook":129,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا أَبُو مَعْمَرٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ وَاصِلٍ مَوْلَى أَبِي عُيَيْنَةَ قَالَ‏:‏ حَدَّثَنِي خَالِدُ بْنُ عُرْفُطَةَ، عَنْ طَلْحَةَ بْنِ نَافِعٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ قَالَ‏:‏ كُنَّا مَعَ رَسُولِ اللهِ صلى الله عليه وسلم وَارْتَفَعَتْ رِيحٌ خَبِيثَةٌ مُنْتِنَةٌ، فَقَالَ‏:‏ أَتَدْرُونَ مَا هَذِهِ‏؟‏ هَذِهِ رِيحُ الَّذِينَ يَغْتَابُونَ الْمُؤْمِنِينَ‏.‏","english":{"narrator":"","text":"Jabir bin Abdullah (ra) said that they were with the Prophet (ﷺ)when a very stinking gush of wind blew over there. The Prophet (ﷺ) they asked his companions (ra) if they knew what that was. He added, \"It is the (stinking) air of those people who backbite the believers.\""}},{"id":130,"idInBook":130,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ‏:‏ حَدَّثَنَا فُضَيْلُ بْنُ عِيَاضٍ، عَنْ سُلَيْمَانَ، عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرٍ قَالَ‏:‏ هَاجَتْ رِيحٌ مُنْتِنَةٌ عَلَى عَهْدِ رَسُولِ اللهِ صلى الله عليه وسلم، فَقَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ إِنَّ نَاسًا مِنَ الْمُنَافِقِينَ اغْتَابُوا أُنَاسًا مِنَ الْمُسْلِمِينَ، فَبُعِثَتْ هَذِهِ الرِّيحُ لِذَلِكَ‏.‏","english":{"narrator":"","text":"Jabir (ra) said that (once) a bad smelling wind blew in the times of the prophet Ig. The Messenger of Allah (ﷺ) said,\" The hypocrites are backbiting the Muslims. That is why this wind blows\""}},{"id":131,"idInBook":131,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ صَالِحٍ قَالَ‏:‏ حَدَّثَنِي مُعَاوِيَةُ بْنُ صَالِحٍ، عَنْ كَثِيرِ بْنِ الْحَارِثِ، عَنِ الْقَاسِمِ بْنِ عَبْدِ الرَّحْمَنِ الشَّامِيِّ، سَمِعْتُ ابْنَ أُمِّ عَبْدٍ يَقُولُ‏:‏ مَنِ اغْتِيبَ عِنْدَهُ مُؤْمِنٌ فَنَصَرهُ جَزَاهُ اللَّهُ بِهَا خَيْرًا فِي الدُّنْيَا وَالْآخِرَةِ، وَمَنِ اغْتِيبَ عِنْدَهُ مُؤْمِنٌ فَلَمْ يَنْصُرْهُ جَزَاهُ اللَّهُ بِهَا فِي الدُّنْيَا وَالْآخِرَةِ شَرًّا، وَمَا الْتَقَمَ أَحَدٌ لُقْمَةً شَرًّا مِنَ اغْتِيَابِ مُؤْمِنٍ، إِنْ قَالَ فِيهِ مَا يَعْلَمُ، فَقَدِ اغْتَابَهُ، وَإِنْ قَالَ فِيهِ بِمَا لاَ يَعْلَمُ فَقَدْ بَهَتَهُ‏.‏","english":{"narrator":"","text":"It is reported by Qasim bin Abdur Rahman as-Shami that he heard Ibn Unm Abd say, \"If a believer is backbitten before someone and he helps the believer (by refuting backbiting) then Allah will reward him well in this world and the next. And, if a believer is backbitten before someone and he does not help him (by not refuting the backbiting) then Allah will give him a bad return for that in this world and the next. Further, if anyone does not take a morsel more than backbiting in his mouth and says that which he knows about him then he has backbitten him but if he says what he does not know about him then he has slandered him."}},{"id":132,"idInBook":132,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، قَالَ‏:‏ حَدَّثَنَا النَّضْرُ، قَالَ‏:‏ حَدَّثَنَا أَبُو الْعَوَّامِ عَبْدُ الْعَزِيزِ بْنُ رَبِيعٍ الْبَاهِلِيُّ، قَالَ‏:‏ حَدَّثَنَا أَبُو الزُّبَيْرِ مُحَمَّدٌ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ قَالَ‏:‏ كُنَّا مَعَ رَسُولِ اللهِ صلى الله عليه وسلم، فَأَتَى عَلَى قَبْرَيْنِ يُعَذَّبُ صَاحِبَاهُمَا، فَقَالَ‏:‏ إِنَّهُمَا لاَ يُعَذَّبَانِ فِي كَبِيرٍ، وَبَلَى، أَمَّا أَحَدُهُمَا فَكَانَ يَغْتَابُ النَّاسَ، وَأَمَّا الْآخَرُ فَكَانَ لاَ يَتَأَذَّى مِنَ الْبَوْلِ، فَدَعَا بِجَرِيدَةٍ رَطْبَةٍ، أَوْ بِجَرِيدَتَيْنِ، فَكَسَرَهُمَا، ثُمَّ أَمَرَ بِكُلِّ كِسْرَةٍ فَغُرِسَتْ عَلَى قَبْرٍ، فَقَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ أَمَا إِنَّهُ سَيُهَوَّنُ مِنْ عَذَابِهِمَا مَا كَانَتَا رَطْبَتَيْنِ، أَوْ لَمْ تَيْبَسَا‏.‏","english":{"narrator":"","text":"It is reported by Jabir bin Abdullah (ra) that they had accompanied the messenger of Allah when they came to two graves. Both the inmate of the graves were being punished. He said,\" They are being punished not for committing a grave sin. But, yes! (They are grave sins though on the face of it they are ordinary and it is easy to avoid them but their punishment is severe.) One of them was given to backbite other people while the other was not. Careful to clean himself of urine drops (over his body)\". He then asked for one or two branches of fresh date palm and split them and dug them on each grave. He said afterwards,\" Soon their punishment will be softened as long as the branches are green.\" Or he said, “Until they dry up.”"}},{"id":133,"idInBook":133,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا ابْنُ نُمَيْرٍ قَالَ‏:‏ حَدَّثَنِي أَبِي، قَالَ‏:‏ حَدَّثَنَا إِسْمَاعِيلُ، عَنْ قَيْسٍ قَالَ‏:‏ كَانَ عَمْرُو بْنُ الْعَاصِ يَسِيرُ مَعَ نَفَرٍ مِنْ أَصْحَابِهِ، فَمَرَّ عَلَى بَغْلٍ مَيِّتٍ قَدِ انْتَفَخَ، فَقَالَ‏:‏ وَاللَّهِ، لَأَنْ يَأْكُلَ أَحَدُكُمْ هَذَا حَتَّى يَمْلَأَ بَطْنَهُ، خَيْرٌ مِنْ أَنْ يَأْكُلَ لَحْمَ مُسْلِمٍ‏.‏","english":{"narrator":"","text":"It is reported by Qays that Amr bin al-Aas (ra) was going somewhere with his friends. They saw a dead mule whose belly had swollen up. Amr (ra)said,\" By Allah, it is better for one to eat to his full from this (dead mule) than to eat the flesh of a Muslim\" (He meant to say that to backbite anyone is worse than eating the meat of a dead animal)."}},{"id":134,"idInBook":134,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا عَمْرُو بْنُ خَالِدٍ، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ، عَنْ أَبِي عَبْدِ الرَّحِيمِ، عَنْ زَيْدِ بْنِ أَبِي أُنَيْسَةَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْهَضْهَاضِ الدَّوْسِيِّ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ جَاءَ مَاعِزُ بْنُ مَالِكٍ الأَسْلَمِيُّ، فَرَجَمَهُ النَّبِيُّ صلى الله عليه وسلم عِنْدَ الرَّابِعَةِ، فَمَرَّ بِهِ رَسُولُ اللهِ صلى الله عليه وسلم وَمَعَهُ نَفَرٌ مِنْ أَصْحَابِهِ، فَقَالَ رَجُلاَنِ مِنْهُمْ‏:‏ إِنَّ هَذَا الْخَائِنَ أَتَى النَّبِيَّ صلى الله عليه وسلم مِرَارًا، كُلُّ ذَلِكَ يَرُدُّهُ، حَتَّى قُتِلَ كَمَا يُقْتَلُ الْكَلْبُ، فَسَكَتَ عَنْهُمُ النَّبِيُّ صلى الله عليه وسلم حَتَّى مَرَّ بِجِيفَةِ حِمَارٍ شَائِلَةٌ رِجْلُهُ، فَقَالَ‏:‏ كُلاَ مِنْ هَذَا، قَالاَ‏:‏ مِنْ جِيفَةِ حِمَارٍ يَا رَسُولَ اللهِ‏؟‏ قَالَ‏:‏ فَالَّذِي نِلْتُمَا مِنْ عِرْضِ أَخِيكُمَا آنِفًا أَكْثَرُ، وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ فَإِنَّهُ فِي نَهْرٍ مِنْ أَنْهَارِ الْجَنَّةِ يَتَغَمَّسُ‏.‏","english":{"narrator":"","text":"It is reported by Abu Hurayrah (ra) that Maiz bin Maalik al-Aslami (ra) came to the Prophet (ﷺ) repeatedly (so that he may be given the prescribed punishment for the sin he had committed). When he came the fourth time, the Prophet (ﷺ) gave orders for Rajam and he was stoned to death. The Messenger of Allah (ﷺ) and a few of his companions afterwards passed by him. One of the companions remarked,\" How many times this perished man came to the Prophet, and each time he turned him away until he was stoned like a dog.\" The Prophet (ﷺ) did not say anything and walked ahead till they came to the corpse of a donkey with its legs in the air. He said,\"Eat some of this (corpse).\" They asked \"Messenger of Allah, from this dead donkey?\" He said to them.\" That you have just backbited your brother is more serious than eating some of it (the donkey's corpse). By him in whose hand the soul of Muhammad is, he (Mariz bin Maalik) is now among the rivers of paradise plunging into it\"."}},{"id":135,"idInBook":135,"chapterId":31,"bookId":15,"arabic":"حَدَّثَنَا إِسْحَاقُ، قَالَ‏:‏ أَخْبَرَنَا حَنْظَلَةُ بْنُ عَمْرٍو الزُّرَقِيُّ الْمَدَنِيُّ قَالَ‏:‏ حَدَّثَنِي أَبُو حَزْرَةَ قَالَ‏:‏ أَخْبَرَنِي عُبَادَةُ بْنُ الْوَلِيدِ بْنِ عُبَادَةَ بْنِ الصَّامِتِ قَالَ‏:‏ خَرَجْتُ مَعَ أَبِي وَأَنَا غُلاَمٌ شَابٌّ، فَنَلْقَى شَيْخًا، قُلْتُ‏:‏ أَيْ عَمِّ، مَا مَنَعَكَ أَنْ تُعْطِيَ غُلاَمَكَ هَذِهِ النَّمِرَةَ، وَتَأْخُذَ الْبُرْدَةَ، فَتَكُونُ عَلَيْكَ بُرْدَتَانِ، وَعَلَيْهِ نَمِرَةٌ‏؟‏ فَأَقْبَلَ عَلَى أَبِي فَقَالَ‏:‏ ابْنُكَ هَذَا‏؟‏ قَالَ‏:‏ نَعَمْ، قَالَ‏:‏ فَمَسَحَ عَلَى رَأْسِي وَقَالَ‏:‏ بَارَكَ اللَّهُ فِيكَ، أَشْهَدُ لَسَمِعْتُ رَسُولَ اللهِ صلى الله عليه وسلم يَقُولُ‏:‏ أَطْعِمُوهُمْ مِمَّا تَأْكُلُونَ، وَاكْسُوهُمْ مِمَّا تَكْتَسُونَ، يَا ابْنَ أَخِي، ذَهَابُ مَتَاعِ الدُّنْيَا أَحَبُّ إِلَيَّ مِنْ أَنْ يَأْخُذَ مِنْ مَتَاعِ الْآخِرَةِ، قُلْتُ‏:‏ أَيْ أَبَتَاهُ، مَنْ هَذَا الرَّجُلُ‏؟‏ قَالَ‏:‏ أَبُو الْيَسَر كَعْبِ بْنُ عَمْرٍو‏.‏","english":{"narrator":"","text":"Ubadah bin Walid said that he came out with his father Ubadah bin al-Samit and he was a young man at that time. They met an elderly \nShaikh who had a mantle over him and Maafi garments. His slave too had a mantle and Maafai. The narrator (Ubadah bin Walid) said,\" My uncle! In this way, you would have had a pair of good quality garments and he would have had one striped mantle\". The man turned to Ubadah bin al-Samit and asked,\" Is he your son?\" He said,\" yes\" Ubadah bin Walid said that the Shaikh stroked his head and said,\" May Allah bless you! I bear testimony that I heard the Messenger of Allah (ﷺ) say that we must feed the slaves the same thing that we eat and clothe them that which we wear. O son of my brother! It is more dear to me that I lose the possessions of this world than I lose anything of the hereafter\". Ubadah bin Walid asked his father who the Shaikh was and he said.\" He is Abu al-Yasr Kab bin Amr\""}}],"chapter":{"id":31,"bookId":15,"arabic":"كتاب الدعاء","english":"Supplication"}}