{"metadata":{"length":15,"arabic":{"title":"الأدب المفرد","author":"الإمام محمد بن إسماعيل البخاري","introduction":"كتاب الضيف والنفقة"},"english":{"title":"Al-Adab Al-Mufrad","author":"Imam Muhammad ibn Ismail al-Bukhari","introduction":"Guests and Spending"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":32,"bookId":15,"arabic":"حَدَّثَنَا عَبْدَةُ، قَالَ‏:‏ حَدَّثَنَا بَقِيَّةُ، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ زِيَادٍ قَالَ‏:‏ أَدْرَكْتُ السَّلَفَ، وَإِنَّهُمْ لَيَكُونُونَ فِي الْمَنْزِلِ الْوَاحِدِ بِأَهَالِيهِمْ، فَرُبَّمَا نَزَلَ عَلَى بَعْضِهُمُ الضَّيْفُ، وَقِدْرُ أَحَدِهِمْ عَلَى النَّارِ، فَيَأْخُذُهَا صَاحِبُ الضَّيْفِ لِضَيْفِهِ، فَيَفْقِدُ الْقِدْرَ صَاحِبُهَا فَيَقُولُ‏:‏ مَنْ أَخَذَ الْقِدْرَ‏؟‏ فَيَقُولُ صَاحِبُ الضَّيْفِ‏:‏ نَحْنُ أَخَذْنَاهَا لِضَيْفِنَا، فَيَقُولُ صَاحِبُ الْقِدْرِ‏:‏ بَارَكَ اللَّهُ لَكُمْ فِيهَا، أَوْ كَلِمَةً نَحْوَهَا قَالَ بَقِيَّةُ‏:‏ وَقَالَ مُحَمَّدٌ‏:‏ وَالْخُبْزُ إِذَا خَبَزُوا مِثْلُ ذَلِكَ، وَلَيْسَ بَيْنَهُمْ إِلاَّ جُدُرُ الْقَصَبِ‏.‏ قَالَ بَقِيَّةُ‏:‏ وَأَدْرَكْتُ أَنَا ذَلِكَ‏:‏ مُحَمَّدَ بْنَ زِيَادٍ وَأَصْحَابَهُ‏.‏","english":{"narrator":"","text":"Muhammad bin Ziyad said that he found that the predecessors (that is, the companions and their successors) lived together with their families. When a guest of one of them arrived and he found the cooking pot of another on the stove, he would take it serve his guest from it. When the owner of the cooking pot found it missing, he would enquire and the man who had taken it would tell him that he took it for his guest. There upon the owner would exclaim.\" May Allah bless it for you,\" or he would make a similar exclamation. \nAnd Muhammad said, when bread was baked (the one with the guest would take all of it). Their homes were separated by walls made of canes\". \nA narration of the Hadith, Baqiyyah, said,\" I too found (my teacher) Muhammad bin Ziyad and his colleagues observe this practice."}},{"id":2,"idInBook":2,"chapterId":32,"bookId":15,"arabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ اللهِ بْنُ دَاوُدَ، عَنْ فُضَيْلِ بْنِ غَزْوَانَ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَجُلاً أَتَى النَّبِيَّ صلى الله عليه وسلم، فَبَعَثَ إِلَى نِسَائِهِ، فَقُلْنَ‏:‏ مَا مَعَنَا إِلاَّ الْمَاءُ، فَقَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ مَنْ يَضُمُّ، أَوْ يُضِيفُ، هَذَا‏؟‏ فَقَالَ رَجُلٌ مِنَ الأَنْصَارِ‏:‏ أَنَا‏.‏ فَانْطَلَقَ بِهِ إِلَى امْرَأَتِهِ فَقَالَ‏:‏ أَكْرِمِي ضَيْفَ رَسُولِ اللهِ صلى الله عليه وسلم، فَقَالَتْ‏:‏ مَا عِنْدَنَا إِلاَّ قُوتٌ لِلصِّبْيَانِ، فَقَالَ‏:‏ هَيِّئِي طَعَامَكِ، وَأَصْلِحِي سِرَاجَكِ، وَنَوِّمِي صِبْيَانَكِ إِذَا أَرَادُوا عَشَاءً، فَهَيَّأَتْ طَعَامَهَا، وَأَصْلَحَتْ سِرَاجَهَا، وَنَوَّمَتْ صِبْيَانَهَا، ثُمَّ قَامَتْ كَأَنَّهَا تُصْلِحُ سِرَاجَهَا فَأَطْفَأَتْهُ، وَجَعَلاَ يُرِيَانِهِ أَنَّهُمَا يَأْكُلاَنِ، وَبَاتَا طَاوِيَيْنِ، فَلَمَّا أَصْبَحَ غَدَا إِلَى رَسُولِ اللهِ صلى الله عليه وسلم، فَقَالَ صلى الله عليه وسلم‏:‏ لَقَدْ ضَحِكَ اللَّهُ، أَوْ‏:‏ عَجِبَ، مِنْ فَعَالِكُمَا، وَأَنْزَلَ اللَّهُ‏:‏ ‏{‏وَيُؤْثِرُونَ عَلَى أَنْفُسِهِمْ وَلَوْ كَانَ بِهِمْ خَصَاصَةٌ وَمَنْ يُوقَ شُحَّ نَفْسِهِ فَأُولَئِكَ هُمُ الْمُفْلِحُونَ‏}‏‏.‏","english":{"narrator":"Abu Hurayrah (ra) said that a man came to the Messenger of Allah (ﷺ). He sent message to his homes that they should send him if they had anything (to entertain his guest). They all sent back a reply that they had nothing but water. The messenger of Allah ^ asked (his companions),\" Who will entertain this guest?\" One of the Ansar volunteered to serve the guest. This companion took him and said to his wife,\" Honour the guest of the Messenger of Allah.\" She responded that they only had the food of their children and nothing more. He said to her,\" Prepare to serve and set the lantern and send the children to sleep\". When they decided to have their meal, she laid the food on the cloth and set the lantern after putting her children to sleep. She then stood pretending to set right the lantern but, in the process, she extinguished it. Both husband and wife sat down leaving an impression on their guest that they were partaking the meal with him. Both of them passed the night in hunger. In the morning, that companion went to the Prophet (ﷺ) who said to him,\" Allah is pleased with your deed and revealed to me this verse:","text":"\" ... but give  preference over themselves, even though they are in privation. And whoever is protected from the stinginess of his soul - it is those who will be the successful.\" (al-Hashr,59:9)"}},{"id":3,"idInBook":3,"chapterId":32,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ يُوسُفَ، قَالَ‏:‏ حَدَّثَنَا اللَّيْثُ قَالَ‏:‏ حَدَّثَنِي سَعِيدٌ الْمَقْبُرِيُّ، عَنْ أَبِي شُرَيْحٍ الْعَدَوِيِّ قَالَ‏:‏ سَمِعَتْ أُذُنَايَ، وَأَبْصَرَتْ عَيْنَايَ، حِينَ تَكَلَّمَ النَّبِيُّ صلى الله عليه وسلم فَقَالَ‏:‏ مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيُكْرِمْ جَارَهُ، وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيُكْرِمْ ضَيْفَهُ جَائِزَتَهُ، قَالَ‏:‏ وَمَا جَائِزَتُهُ يَا رَسُولَ اللهِ‏؟‏ قَالَ‏:‏ يَوْمٌ وَلَيْلَةٌ، وَالضِّيَافَةُ ثَلاَثَةُ أَيَّامٍ، فَمَا كَانَ وَرَاءَ ذَلِكَ فَهُوَ صَدَقَةٌ عَلَيْهِ‏.‏ وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيَقُلْ خَيْرًا أَوْ لِيَصْمُتْ‏.‏","english":{"narrator":"","text":"Abu Shurayh at Adawi (ra) said that his ears heard eyes observed that The Messenger of Allah (ﷺ) was saying,\" he who believes in Allah and the last day should honour his neighbor. He who believes in Allah and the Last Day should take great care of the Jaizah his guest.\" (Jaizah is a provision for a guest that is superior to one’s everyday meal.) The narrator asked,\" what is his Jaizah, O messenger of Allah?\" The Prophet (ﷺ) said,\" his Jaizah, extends over one day and one night while (general) hospitality extends over three days. And beyond that t(that is after three days) is counted as Sadaqah (meaning, whatever the host spends after three days on his guest will be under the head of Sadaqah because hospitality ends at three days). And he who believes in Allah and the last day should speak a good word or keep silent.\""}},{"id":4,"idInBook":4,"chapterId":32,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ‏:‏ حَدَّثَنَا أَبَانُ بْنُ يَزِيدَ قَالَ‏:‏ حَدَّثَنِي يَحْيَى هُوَ ابْنُ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ الضِّيَافَةُ ثَلاَثَةُ أَيَّامٍ، فَمَا كَانَ بَعْدَ ذَلِكَ فَهُوَ صَدَقَةٌ‏.‏","english":{"narrator":"","text":"Abu Hurayrah (ra) has reported that the Messenger of Allah (ﷺ) said,\"Hospitality extends over three days and what is beyond that (more than three days) is Sadaqah."}},{"id":5,"idInBook":5,"chapterId":32,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ قَالَ‏:‏ حَدَّثَنِي مَالِكٌ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي شُرَيْحٍ الْكَعْبِيِّ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم قَالَ‏:‏ مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيَقُلْ خَيْرًا أَوْ لِيَصْمُتْ، وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيُكْرِمْ ضَيْفَهُ جَائِزَتَهُ يَوْمٌ وَلَيْلَةٌ‏.‏ وَالضِّيَافَةُ ثَلاَثَةُ أَيَّامٍ، فَمَا بَعْدَ ذَلِكَ فَهُوَ صَدَقَةٌ، وَلاَ يَحِلُّ لَهُ أَنْ يَثْوِيَ عِنْدَهُ حَتَّى يُحْرِجَهُ‏.‏","english":{"narrator":"","text":"Abu Shurayh al-Kabi al-Adawi (ra) has reported that the Messenger of Allah (ﷺ) said, \"He who believes in Allah and the last day should speak a good, decent conversation otherwise remain silent. And he who believes in Allah and the last day should honour his guest whose Jaizah (a provision for the guest better than one’s own meals) is the length of a day and a night. And hospitality extends for three days and whatever is beyond that (more than three days) is Sadaqah. it is not proper for a guest to tax his host by overstaying (so that he is tired of him)."}},{"id":6,"idInBook":6,"chapterId":32,"bookId":15,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، عَنِ الشَّعْبِيِّ، عَنِ الْمِقْدَامِ أَبِي كَرِيمَةَ الشَّامِيِّ قَالَ‏:‏ قَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ لَيْلَةُ الضَّيْفِ حَقٌّ وَاجِبٌ عَلَى كُلِّ مُسْلِمٍ، فَمَنْ أَصْبَحَ بِفِنَائِهِ فَهُوَ دَيْنٌ عَلَيْهِ إِنْ شَاءَ، فَإِنْ شَاءَ اقْتَضَاهُ، وَإِنْ شَاءَ تَرَكَهُ‏.‏","english":{"narrator":"","text":"Al-Miqdam Abu karimah al-Shamee (ra) has reported the prophet j|| as saying,\" If a guest arrives then it is Wajib on every Muslim to serve him the night’s meal. And, if a guest stays at his house until morning then the morning meal is a debt on him which the guest may receive or forsake.\""}},{"id":7,"idInBook":7,"chapterId":32,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ صَالِحٍ قَالَ‏:‏ حَدَّثَنِي اللَّيْثُ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ أَبِي الْخَيْرِ، عَنْ عُقْبَةَ بْنِ عَامِرٍ قَالَ‏:‏ قُلْتُ‏:‏ يَا رَسُولَ اللهِ، إِنَّكَ تَبْعَثُنَا فَنَنْزِلُ بِقَوْمٍ فَلاَ يَقْرُونَا، فَمَا تَرَى فِي ذَلِكَ‏؟‏ فَقَالَ لَنَا‏:‏ إِنْ نَزَلْتُمْ بِقَوْمٍ فَأُمِرَ لَكُمْ بِمَا يَنْبَغِي لِلضَّيْفِ فَاقْبَلُوا، فَإِنْ لَمْ يَفْعَلُوا فَخُذُوا مِنْهُمْ حَقَّ الضَّيْفِ الَّذِي يَنْبَغِي لَهُمْ‏.‏","english":{"narrator":"","text":"Uqbah bin Aamir (ra) said that he said to the Prophet (ﷺ),\" O Messenger of Allah, what do you say about a situation when you send us to a people who do not give us hospitality.\" He said,\" If you go to a people and they present you what a guest needs then accept it. But if they do not serve you then take from them the right of a guest that they ought to have given\"."}},{"id":8,"idInBook":8,"chapterId":32,"bookId":15,"arabic":"حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، قَالَ‏:‏ حَدَّثَنَا يَعْقُوبُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي حَازِمٍ قَالَ‏:‏ سَمِعْتُ سَهْلَ بْنَ سَعْدٍ، أَنَّ أَبَا أُسَيْدٍ السَّاعِدِيَّ دَعَا النَّبِيَّ صلى الله عليه وسلم فِي عُرْسِهِ، وَكَانَتِ امْرَأَتُهُ خَادِمَهُمْ يَوْمَئِذٍ، وَهِيَ الْعَرُوسُ، فَقَالَتْ، أَوْ قَالَ،‏:‏ أَتَدْرُونَ مَا أَنْقَعْتُ لِرَسُولِ اللهِ صلى الله عليه وسلم‏؟‏ أَنْقَعْتُ لَهُ تَمَرَاتٍ مِنَ اللَّيْلِ فِي تَوْرٍ‏.‏","english":{"narrator":"","text":"Abu Usayd as-Sa'idi invited the Prophet, may Allah bless him and\ngrant him peace, to his wedding. His wife, who was the bride, served them\nthat day. She said, \"Do you know what I served the Messenger of Allah,\nmay Allah bless him and grant him peace? I served him some dates which\nhad been infused in a pot overnight.\""}},{"id":9,"idInBook":9,"chapterId":32,"bookId":15,"arabic":"حَدَّثَنَا أَبُو مَعْمَرٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْوَارِثِ قَالَ‏:‏ حَدَّثَنِي الْجُرَيْرِيُّ، قَالَ‏:‏ حَدَّثَنَا أَبُو الْعَلاَءِ بْنُ عَبْدِ اللهِ، عَنْ نُعَيْمِ بْنِ قَعْنَبٍ قَالَ‏:‏ أَتَيْتُ أَبَا ذَرٍّ فَلَمْ أُوَافِقْهُ، فَقُلْتُ لِامْرَأَتِهِ‏:‏ أَيْنَ أَبُو ذَرٍّ‏؟‏ قَالَتْ‏:‏ يَمْتَهِنُ، سَيَأْتِيكَ الْآنَ، فَجَلَسْتُ لَهُ، فَجَاءَ وَمَعَهُ بَعِيرَانِ، قَدْ قَطَرَ أَحَدَهُمَا بِعَجُزِ الْآخَرِ، فِي عُنُقِ كُلِّ وَاحِدٍ مِنْهُمَا قِرْبَةٌ، فَوَضَعَهُمَا ثُمَّ جَاءَ، فَقُلْتُ‏:‏ يَا أَبَا ذَرٍّ، مَا مِنْ رَجُلٍ كُنْتُ أَلْقَاهُ كَانَ أَحَبَّ إِلَيَّ لُقْيًا مِنْكَ، وَلاَ أَبْغَضَ إِلَيَّ لُقْيًا مِنْكَ، قَالَ‏:‏ لِلَّهِ أَبُوكَ، وَمَا جَمَعَ هَذَا‏؟‏ قَالَ‏:‏ إِنِّي كُنْتُ وَأَدْتُ مَوْءُودَةً فِي الْجَاهِلِيَّةِ أَرْهَبُ إِنْ لَقِيتُكَ أَنْ تَقُولَ‏:‏ لاَ تَوْبَةَ لَكَ، لاَ مَخْرَجَ لَكَ، وَكُنْتُ أَرْجُو أَنْ تَقُولَ‏:‏ لَكَ تَوْبَةٌ وَمَخْرَجٌ، قَالَ‏:‏ أَفِي الْجَاهِلِيَّةِ أَصَبْتَ‏؟‏ قُلْتُ‏:‏ نَعَمْ، قَالَ‏:‏ عَفَا اللَّهُ عَمَّا سَلَفَ‏.‏ وَقَالَ لِامْرَأَتِهِ‏:‏ آتِينَا بِطَعَامٍ، فَأَبَتَ، ثُمَّ أَمَرَهَا فَأَبَتَ، حَتَّى ارْتَفَعَتْ أَصْوَاتُهُمَا، قَالَ‏:‏ إِيهِ، فَإِنَّكُنَّ لاَ تَعْدُونَ مَا قَالَ رَسُولُ اللهِ صلى الله عليه وسلم، قُلْتُ‏:‏ وَمَا قَالَ رَسُولُ اللهِ فِيهِنَّ‏؟‏ قَالَ‏:‏ إِنَّ الْمَرْأَةَ خُلِقَتْ مِنْ ضِلَعٍ، وَإِنَّكَ إِنْ تُرِدْ أَنْ تُقِيمَهَا تَكْسِرُهَا، وَإِنْ تُدَارِهَا فَإِنَّ فِيهَا أَوَدًا وَبُلْغَةً، فَوَلَّتْ فَجَاءَتْ بِثَرِيدَةٍ كَأَنَّهَا قَطَاةٌ، فَقَالَ‏:‏ كُلْ وَلاَ أَهُولَنَّكَ فَإِنِّي صَائِمٌ، ثُمَّ قَامَ يُصَلِّي، فَجَعَلَ يُهَذِّبُ الرُّكُوعَ، ثُمَّ انْفَتَلَ فَأَكَلَ، فَقُلْتُ‏:‏ إِنَّا لِلَّهِ، مَا كُنْتُ أَخَافُ أَنْ تَكْذِبَنِي، قَالَ‏:‏ لِلَّهِ أَبُوكَ، مَا كَذَبْتُ مُنْذُ لَقِيتَنِي، قُلْتُ‏:‏ أَلَمْ تُخْبِرْنِي أَنَّكَ صَائِمٌ‏؟‏ قَالَ‏:‏ بَلَى، إِنِّي صُمْتُ مِنْ هَذَا الشَّهْرِ ثَلاَثَةَ أَيَّامٍ فَكُتِبَ لِي أَجْرُهُ، وَحَلَّ لِيَ الطَّعَامُ‏.‏","english":{"narrator":"","text":"Nu'aym ibn Qa'nab said, \"I went to Abu Dharr and did not find him\nat home. I asked his wife, 'Where is Abu Dharr?' 'Fetching some things\nfor the house. He will be back presently.' I sat down to wait for him and\nhe came with two camels. One of them was lined up behind the other and\neach of the camels had a waterskin on its neck. Abu Dharr took them off.\nThen he came and I said, 'Abu Dharr! There was no man who I desired to meet more than you and there was none that I hated to meet more than you!' He said, 'Your father is for Allah! How can these two be joined together?' I replied, 'In the Jahiliyya, a buried a daughter alive and I feared that I would meet you and you would say, \"There is no way for you to repent. There is no way out.\" On the other hand, I used to hope that you would say, \"There is a way for you to repent. There is a way out.\"' He asked,\" Did you do that in the Jahiliyah?\" And Nuaym said \"Yes.\". Abu Dharr (ra) said,\" Allah has forgiven the sins committed earlier (before the Islamic times)\". \n\nHe then said to his wife,\" Bring us the meal.\" But she refused to do so. He \nthen commanded her but she again refused to bring it and their voices were \nsoon raised. Abu Dharr (ra) said,\" You will not go beyond what the Messenger \nof Allah (ﷺ) has said\". \n\nNuaym asked,\" What has the Messenger of Allah said about them?\" Abu Dharr (ra) said,\" The Messenger of Allah has said that a woman is created from a crooked rib and if you attempt to straighten it you will break it but if you leave her alone you will enjoy her while the crookedness remains in her\". \n\nHis wife then turned her back to them and went away and brought thareed as though she matched the bird Qatah (in swiftness). He then said,\" you go ahead, eat the food. And do not worry (about eating alone). For I am fasting,\" he stood up to offer prayers and hurried to the bowing posture. After he had \nfinished his prayer, he began to eat. Nuaym exclaimed, \"We belong to Allah! I had given no thought to it that you would lie to me. You said just now that you were fasting and you have come to eat\". \n\nHe said,\"Your father is for Allah! Ever since I have met you, I have not spoken a lie.\" Nuaym said, \"Did you not tell me that you were fasting?\" He said,\"Yes. I have kept three fasts in this month so that the reward for it is written down for me while it is lawful for me to eat too."}},{"id":10,"idInBook":10,"chapterId":32,"bookId":15,"arabic":"حَدَّثَنَا حَجَّاجٌ، قَالَ‏:‏ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَبِي أَسْمَاءَ، عَنْ ثَوْبَانَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ إِنَّ مِنْ أَفْضَلِ دِينَارٍ أَنْفَقَهُ الرَّجُلُ عَلَى عِيَالِهِ، وَدِينَارٌ أَنْفَقَهُ عَلَى أَصْحَابِهِ فِي سَبِيلِ اللهِ، وَدِينَارٌ أَنْفَقَهُ عَلَى دَابَّتِهِ فِي سَبِيلِ اللهِ‏.‏","english":{"narrator":"","text":"Thawban reported that the Prophet, may Allah bless him and grant\nhim peace, said, \"The best dinar a man spends is the dinar which he spends\non his family, the dinar which he spends on his companions in the Way of\nAllah, and the dinar which he spends on his riding animal in the Way of\nAllah.\""}},{"id":11,"idInBook":11,"chapterId":32,"bookId":15,"arabic":"حَدَّثَنَا حَجَّاجٌ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ قَالَ‏:‏ أَخْبَرَنِي عَدِيُّ بْنُ ثَابِتٍ قَالَ‏:‏ سَمِعْتُ عَبْدَ اللهِ بْنَ يَزِيدَ يُحَدِّثُ، عَنْ أَبِي مَسْعُودٍ الْبَدْرِيِّ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ مَنْ أَنْفَقَ نَفَقَةً عَلَى أَهْلِهِ، وَهُوَ يَحْتَسِبُهَا، كَانَتْ لَهُ صَدَقَةً‏.‏","english":{"narrator":"","text":"Abu Mas'ud al-Badri reported that the Prophet, may Allah bless\nhim and grant him peace, said, \"When someone spends something on his family\nand reckons its reward to be with Allah, then it is sadaqa for him.\""}},{"id":12,"idInBook":12,"chapterId":32,"bookId":15,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، قَالَ‏:‏ حَدَّثَنَا الْوَلِيدُ، قَالَ‏:‏ حَدَّثَنَا أَبُو رَافِعٍ إِسْمَاعِيلُ بْنُ رَافِعٍ، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ الْمُنْكَدِرِ، عَنْ جَابِرٍ قَالَ‏:‏ قَالَ رَجُلٌ‏:‏ يَا رَسُولَ اللهِ، عِنْدِي دِينَارٌ‏؟‏ قَالَ‏:‏ أَنْفِقْهُ عَلَى نَفْسِكَ، قَالَ‏:‏ عِنْدِي آخَرُ، فَقَالَ‏:‏ أَنْفِقْهُ عَلَى خَادِمِكَ، أَوْ قَالَ‏:‏ عَلَى وَلَدِكَ، قَالَ‏:‏ عِنْدِي آخَرُ، قَالَ‏:‏ ضَعْهُ فِي سَبِيلِ اللهِ، وَهُوَ أَخَسُّهَا‏.‏","english":{"narrator":"","text":"Jabir said, \"A man said, 'Messenger of Allah, I have a dinar.'\nHe said, 'Spend it on yourself.' The man said, 'I have another.' He said,\n'Spend it on your servant (or he said, 'on your child').' The man said,\n'I have another.' He said, 'Use it in the Way of Allah, but that is the\nleast form of sadaqa.'\""}},{"id":13,"idInBook":13,"chapterId":32,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنْ مُزَاحِمِ بْنِ زُفَرَ، عَنْ مُجَاهِدٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ أَرْبَعَةُ دَنَانِيرَ‏:‏ دِينَارًا أَعْطَيْتَهُ مِسْكِينًا، وَدِينَارًا أَعْطَيْتَهُ فِي رَقَبَةٍ، وَدِينَارًا أَنْفَقْتَهُ فِي سَبِيلِ اللهِ، وَدِينَارًا أَنْفَقْتَهُ عَلَى أَهْلِكَ، أَفْضَلُهَا الَّذِي أَنْفَقْتَهُ عَلَى أَهْلِكَ‏.‏","english":{"narrator":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"There are four dinars:","text":"a dinar which you give to\na poor person, a dinar you give to free a slave, a dinar you spend in the\nWay of Allah, and a dinar which you spend on your family. The best of them\nis the dinar which you spend on your family.\""}},{"id":14,"idInBook":14,"chapterId":32,"bookId":15,"arabic":"حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ‏:‏ حَدَّثَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ قَالَ‏:‏ حَدَّثَنِي عَامِرُ بْنُ سَعْدٍ، عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ أَنَّهُ أَخْبَرَهُ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ لِسَعْدٍ‏:‏ إِنَّكَ لَنْ تُنْفِقَ نَفَقَةً تَبْتَغِي بِهَا وَجْهَ اللهِ عَزَّ وَجَلَّ إِلاَّ أُجِرْتَ بِهَا، حَتَّى مَا تَجْعَلُ فِي فَمِ امْرَأَتِكَ‏.‏","english":{"narrator":"","text":"Sa'd ibn Abi Waqqas transmitted that the Prophet, may Allah bless\nhim and grant him peace, said to him, \"You do not spend anything by which\nyou desire the face of Allah Almighty but that you art rewarded for it,\neven what you place in your wife's mouth.\""}},{"id":15,"idInBook":15,"chapterId":32,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ قَالَ‏:‏ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي عَبْدِ اللهِ الأَغَرِّ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم قَالَ‏:‏ يَنْزِلُ رَبُّنَا تَبَارَكَ وَتَعَالَى فِي كُلِّ لَيْلَةٍ إِلَى السَّمَاءِ الدُّنْيَا، حِينَ يَبْقَى ثُلُثُ اللَّيْلِ الْآخَرُ، فَيَقُولُ‏:‏ مَنْ يَدْعُونِي فَأَسْتَجِيبَ لَهُ‏؟‏ مَنْ يَسْأَلُنِي فَأُعْطِيَهُ‏؟‏ مَنْ يَسْتَغْفِرُنِي فَأَغْفِرَ لَهُ‏؟‏‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"Our Lord, the Blessed and Exalted, descends\nto the lowest heaven every night when a third of the night remains. He\nsays, 'Who is calling on Me so that I can answer him? Who is asking Me\nfor something so that I can give to him? \"Who is asking Me for forgiveness\nso that I can forgive him?'\""}}],"chapter":{"id":32,"bookId":15,"arabic":"كتاب الضيف والنفقة","english":"Guests and Spending"}}