{"metadata":{"length":57,"arabic":{"title":"الأدب المفرد","author":"الإمام محمد بن إسماعيل البخاري","introduction":"كتاب الأقوال"},"english":{"title":"Al-Adab Al-Mufrad","author":"Imam Muhammad ibn Ismail al-Bukhari","introduction":"Sayings"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللهِ، قَالَ‏:‏ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ صَالِحِ بْنِ كَيْسَانَ، عَنِ ابْنِ شِهَابٍ قَالَ‏:‏ أَخْبَرَنِي ابْنُ أَخِي أَبِي رُهْمٍ كُلْثُومُ بْنُ الْحُصَيْنِ الْغِفَارِيُّ، أَنَّهُ سَمِعَ أَبَا رُهْمٍ، وَكَانَ مِنْ أَصْحَابِ رَسُولِ اللهِ صلى الله عليه وسلم الَّذِينَ بَايَعُوهُ تَحْتَ الشَّجَرَةِ، يَقُولُ‏:‏ غَزَوْتُ مَعَ رَسُولِ اللهِ صلى الله عليه وسلم غَزْوَةَ تَبُوكَ، فنُمْتُ لَيْلَةً بِالأَخْضَرِ، فَصِرْتُ قَرِيبًا مِنْهُ، فَأُلْقِيَ عَلَيْنَا النُّعَاسُ، فَطَفِقْتُ أَسْتَيْقِظُ وَقَدْ دَنَتْ رَاحِلَتِي مِنْ رَاحِلَتِهِ، فَيُفْزِعُنِي دُنُوُّهَا خَشْيَةَ أَنْ تُصِيبَ رِجْلَهُ فِي الْغَرْزِ، فَطَفِقْتُ أُؤَخِّرُ رَاحِلَتِي حَتَّى غَلَبَتْنِي عَيْنِي بَعْضَ اللَّيْلِ، فَزَاحَمَتْ رَاحِلَتِي رَاحِلَةَ رَسُولِ اللهِ صلى الله عليه وسلم، وَرِجْلُهُ فِي الْغَرْزِ، فَأَصَبْتُ رِجْلَهُ، فَلَمْ أَسْتَيْقِظْ إِلاَّ بِقَوْلِهِ‏:‏ حَسِّ، فَقُلْتُ‏:‏ يَا رَسُولَ اللهِ، اسْتَغْفِرْ لِي، فَقَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ سِرْ‏.‏ فَطَفِقَ رَسُولُ اللهِ صلى الله عليه وسلم يَسْأَلُنِي عَنْ مَنْ تَخَلَّفَ مِنْ بَنِي غِفَارٍ فَأُخْبِرُهُ، فَقَالَ، وَهُوَ يَسْأَلُنِي‏:‏ مَا فَعَلَ النَّفْرُ الْحُمُرُ الطِّوَالُ الثِّطَاطُ‏؟‏ قَالَ‏:‏ فَحَدَّثْتُهُ بِتَخَلُّفِهِمْ، قَالَ‏:‏ فَمَا فَعَلَ السُّودُ الْجِعَادُ الْقِصَارُ الَّذِينَ لَهُمْ نَعَمٌ بِشَبَكَةِ شَرَخٍ‏؟‏ فَتَذَكَّرْتُهُمْ فِي بَنِي غِفَارٍ، فَلَمْ أَذْكُرْهُمْ حَتَّى ذَكَرْتُ أَنَّهُمْ رَهْطٌ مِنْ أَسْلَمَ، فَقُلْتُ‏:‏ يَا رَسُولَ اللهِ، أُولَئِكَ مِنْ أَسْلَمَ، قَالَ‏:‏ فَمَا يَمْنَعُ أَحَدَ أُولَئِكَ، حِينَ يَتَخَلَّفُ، أَنْ يَحْمِلَ عَلَى بَعِيرٍ مِنْ إِبِلِهِ امْرَءًا نَشِيطًا فِي سَبِيلِ اللهِ‏؟‏ فَإِنَّ أَعَزَّ أَهْلِي عَلَيَّ أَنْ يَتَخَلَّفَ عَنِّي الْمُهَاجِرُونَ مِنْ قُرَيْشٍ وَالأَنْصَارُ، وَغِفَارٌ وَأَسْلَمُ‏.‏","english":{"narrator":"","text":"Abu Ruhm, one of the Companions of the Messenger of Allah, may\nAllah bless him and grant him peace, who had offered his allegiance to\nthe Prophet under the Tree  was heard to say, \"I went\non the expedition to Tabuk with the Messenger of Allah, may Allah bless\nhim and grant him peace. While we were travelling at night at al-Akhdar,\nI was near to the Prophet. A deep sleepiness overcame us, but I began to\nwake up when my camel wandered near to the Prophet's camel. I was worried\nthat when it came close, it would his foot in the stirrup. I began to pull\nmy camel back, but at a certain point in the night I feel asleep. Then\nmy camel jostled against the camel of the Messenger of Allah, may Allah\nbless him and grant him peace, while his foot was in stirrup, hitting his\nfoot. I did not wake up until he exclaimed, 'Ow!' I said, 'Messenger of\nAllah, ask for forgiveness for me!' The Messenger of Allah, may Allah bless\nhim and grant him peace, said, 'Never mind.'"}},{"id":2,"idInBook":2,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى، قَالَ‏:‏ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتِ‏:‏ اسْتَأْذَنَ رَجُلٌ عَلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ‏:‏ بِئْسَ أَخُو الْعَشِيرَةِ، فَلَمَّا دَخَلَ انْبَسَطَ إِلَيْهِ، فَقُلْتُ لَهُ‏؟‏ فَقَالَ‏:‏ إِنَّ اللَّهَ لاَ يُحِبُّ الْفَاحِشَ الْمُتَفَحِّشَ‏.‏","english":{"narrator":"","text":"'A'isha said, \"A man asked for permission to come in to see the\nProphet, may Allah bless him and grant him peace, and the Prophet remarked,\n'He is a bad brother of his tribe.' When the man came in, the Prophet was\ncheerful towards him. I asked the Prophet about that and he said, 'Allah\ndoes not love anyone who is obscene and coarse.'\""}},{"id":3,"idInBook":3,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، قَالَ‏:‏ أَخْبَرَنَا سُفْيَانُ قَالَ‏:‏ حَدَّثَنِي عَبْدُ الرَّحْمَنِ، عَنِ الْقَاسِمِ، عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ‏:‏ اسْتَأْذَنَتْ رَسُولَ اللهِ صلى الله عليه وسلم سَوْدَةُ لَيْلَةَ جَمْعٍ، وَكَانَتِ امْرَأَةً ثَقِيلَةً ثَبِطَةً، فَأَذِنَ لَهَا‏.‏","english":{"narrator":"","text":"'A'isha said, \"Sawda, who was a heavy, sluggish woman, asked for\npermission to come in (to see the Prophet) on the night of Jam' (Muzdalifa)\nand he gave her permission.\""}},{"id":4,"idInBook":4,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ‏:‏ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَاصِمِ بْنِ بَهْدَلَةَ، عَنْ أَبِي وَائِلٍ، عَنِ ابْنِ مَسْعُودٍ قَالَ‏:‏ لَمَّا قَسَّمَ رَسُولُ اللهِ صلى الله عليه وسلم غَنَائِمَ حُنَيْنٍ بِالْجِعْرَانَةِ ازْدَحَمُوا عَلَيْهِ، فَقَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ إِنَّ عَبْدًا مِنْ عِبَادِ اللهِ بَعَثَهُ اللَّهُ إِلَى قَوْمٍ، فَكَذَّبُوهُ وَشَجُّوهُ، فَكَانَ يَمْسَحُ الدَّمَ عَنْ جَبْهَتِهِ وَيَقُولُ‏:‏ اللَّهُمَّ اغْفِرْ لِقَوْمِي، فَإِنَّهُمْ لاَ يَعْلَمُونَ‏.‏ قَالَ عَبْدُ اللهِ بْنُ مَسْعُودٍ‏:‏ فَكَأَنِّي أَنْظُرُ إِلَى رَسُولِ اللهِ صلى الله عليه وسلم يَحْكِي الرَّجُلَ يَمْسَحُ عَنْ جَبْهَتِهِ‏.‏","english":{"narrator":"","text":"Ibn Mas'ud said, \"When the Messenger of Allah, may Allah bless\nhim and grant him peace, divided the booty of Hunayn at Ji'rana, the people\ncrowded up against him. Then the Messenger of Allah, may Allah bless him\nand grant him peace, said, 'Allah sent on of His slaves to a people and\nthey rejected him and wounded him in the head. He wiped the blood from\nhis brow, saying, \"O Allah, forgive my people for they do not know.\"'\""}},{"id":5,"idInBook":5,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا بِشْرُ بْنُ مُحَمَّدٍ، قَالَ‏:‏ أَخْبَرَنَا عَبْدُ اللهِ، قَالَ‏:‏ حَدَّثَنَا إِبْرَاهِيمُ بْنُ نَشِيطٍ، عَنْ كَعْبِ بْنِ عَلْقَمَةَ، عَنْ أَبِي الْهَيْثَمِ قَالَ‏:‏ جَاءَ قَوْمٌ إِلَى عُقْبَةَ بْنِ عَامِرٍ فَقَالُوا‏:‏ إِنَّ لَنَا جِيرَانًا يَشْرَبُونَ وَيَفْعَلُونَ، أَفَنَرْفَعُهُمْ إِلَى الإِمَامِ‏؟‏ قَالَ‏:‏ لاَ، سَمِعْتُ رَسُولَ اللهِ صلى الله عليه وسلم يَقُولُ‏:‏ مَنْ رَأَى مِنْ مُسْلِمٍ عَوْرَةً فَسَتَرَهَا، كَانَ كَمَنْ أَحْيَا مَوْءُودَةً مِنْ قَبْرِهَا‏.‏","english":{"narrator":"","text":"Abu'l-Haytham said, \"Some people came to 'Uqba ibn 'Amir and said,\n'We have some neighbours who drink (wine) and behave incorrectly. Shall\nwe bring them before the ruler?' 'No,' he replied, 'I heard the Messenger\nof Allah, may Allah bless him and grant him peace, say, \"Whoever sees the\nfault of a Muslim and then veils it, it is as if he brought girl buried\nalive back to life from her grave.''\""}},{"id":6,"idInBook":6,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ قَالَ‏:‏ حَدَّثَنِي مَالِكٌ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم قَالَ‏:‏ إِذَا سَمِعْتَ الرَّجُلَ يَقُولُ‏:‏ هَلَكَ النَّاسُ، فَهُوَ أَهْلَكُهُمْ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"When you hear a man saying, 'People are\ndestroyed,' then he has destroyed them.\""}},{"id":7,"idInBook":7,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللهِ، قَالَ‏:‏ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ قَالَ‏:‏ حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، عَنْ عَبْدِ اللهِ بْنِ بُرَيْدَةَ، عَنْ أَبِيهِ قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ لاَ تَقُولُوا لِلْمُنَافِقِ‏:‏ سَيِّدٌ، فَإِنَّهُ إِنْ يَكُ سَيِّدَكُمْ فَقَدْ أَسْخَطْتُمْ رَبَّكُمْ عَزَّ وَجَلَّ‏.‏","english":{"narrator":"","text":"'Abdullah ibn Burayda reported from his father that the Messenger\nof Allah, may Allah bless him and grant him peace, said, \"Do not call a\nhypocrite 'master'. He is not your master and you will have angered your\nLord, the Mighty and Exalted.\""}},{"id":8,"idInBook":8,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا مَخْلَدُ بْنُ مَالِكٍ، قَالَ‏:‏ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، قَالَ‏:‏ أَخْبَرَنَا مُبَارَكُ بْنُ فَضَالَةَ، عَنْ بَكْرِ بْنِ عَبْدِ اللهِ الْمُزَنِيِّ، عَنْ عَدِيِّ بْنِ أَرْطَأَةَ قَالَ‏:‏ كَانَ الرَّجُلُ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم إِذَا زُكِّيَ قَالَ‏:‏ اللَّهُمَّ لاَ تُؤَاخِذْنِي بِمَا يَقُولُونَ، وَاغْفِرْ لِي مَا لا يَعْلَمُونَ‏.‏","english":{"narrator":"","text":"'Adi ibn Arta' said, \"When one of the Companions of the Prophet,\nmay Allah bless him and grant him peace, was praised, he said in supplication\nto Allah), 'Do not take me to task for what they say and forgive me for\nwhat they do not know.'\""}},{"id":9,"idInBook":9,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ الأَوْزَاعِيِّ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِي قِلاَبَةَ، أَنَّ أَبَا عَبْدِ اللهِ قَالَ لأَبِي مَسْعُودٍ، أَوْ أَبُو مَسْعُودٍ قَالَ لأَبِي عَبْدِ اللهِ‏:‏ مَا سَمِعْتَ النَّبِيَّ صلى الله عليه وسلم فِي ‏(‏ زَعَمَ ‏)‏‏؟‏ قَالَ‏:‏ بِئْسَ مَطِيَّةُ الرَّجُلِ‏.‏","english":{"narrator":"","text":"Abu Qilaba reported that 'Abdullah said to Abu Mas'ud - or\nAbu Mas'ud said to 'Abdullah, \"What did you hear the Prophet, may Allah\nbless him and grant him peace, say about '(false) assertion?\" He said,\n\"It is a bad mount for a man.\""}},{"id":10,"idInBook":10,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا يَحْيَى بْنُ مُوسَى، قَالَ‏:‏ حَدَّثَنَا عُمَرُ بْنُ يُونُسَ الْيَمَامِيُّ، قَالَ‏:‏ حَدَّثَنَا يَحْيَى بْنُ عَبْدِ الْعَزِيزِ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَبِي الْمُهَلَّبِ أَنَّ عَبْدَ اللهِ بْنَ عَامِرٍ قَالَ‏:‏ يَا أَبَا مَسْعُودٍ، مَا سَمِعْتَ رَسُولَ اللهِ صلى الله عليه وسلم يَقُولُ فِي زَعَمُوا‏؟‏ قَالَ‏:‏ سَمِعْتُهُ يَقُولُ‏:‏ بِئْسَ مَطِيَّةُ الرَّجُلِ، وَسَمِعْتُهُ يَقُولُ‏:‏ لَعْنُ الْمُؤْمِنِ كَقَتْلِهِ‏.‏","english":{"narrator":"","text":"'Abdullah ibn 'Amr said, \"Abu Mas'ud, what did you hear the Messenger\nof Allah, may Allah bless him and grant him peace, say about 'People who\nmake false claims?\" He replied, \"I heard him say, 'A bad mount for a man'\nand I heard him say, 'Cursing a believer is like killing him.'\""}},{"id":11,"idInBook":11,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللهِ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ قَالَ‏:‏ قَالَ عَمْرٌو‏:‏ عَنِ ابْنِ عَبَّاسٍ‏:‏ لاَ يَقُولَنَّ أَحَدُكُمْ لِشَيْءٍ لاَ يَعْلَمُهُ‏:‏ اللَّهُ يَعْلَمُهُ ؛ وَاللَّهُ يَعْلَمُ غَيْرَ ذَلِكَ، فَيُعَلِّمَ اللَّهَ مَا لاَ يَعْلَمُ، فَذَاكَ عِنْدَ اللهِ عَظِيمٌ‏.‏","english":{"narrator":"","text":"Ibn 'Abbas said, \"None of you should say about a thing which he\ndoes not know, 'Allah knows it' when Allah may know that it is other than\nwhat he said and thus he (tries to) teach Allah what he does not know.\nThat is something terrible in Allah's sight.\""}},{"id":12,"idInBook":12,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا الْحَسَنُ بْنُ عُمَرَ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ عَلِيِّ بْنِ زَيْدٍ قَالَ‏:‏ حَدَّثَنِي يُوسُفُ بْنُ مِهْرَانَ، عَنِ ابْنِ عَبَّاسٍ قَالَ‏:‏ الْمَجَرَّةُ‏:‏ بَابٌ مِنْ أَبْوَابِ السَّمَاءِ، وَأَمَّا قَوْسُ قُزَحٍ‏:‏ فَأَمَانٌ مِنَ الْغَرَقِ بَعْدَ قَوْمِ نُوحٍ عَلَيْهِ السَّلامُ‏.‏","english":{"narrator":"","text":"Ibn Abbas said, \"The Milky Way is one of the gates of the heavens.\nThe rainbow is security from being destroyed by flood after the people\nof Nuh, peace be upon him.\""}},{"id":13,"idInBook":13,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا الْحُمَيْدِيُّ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ أَبِي حُسَيْنٍ وَغَيْرِهِ، عَنْ أَبِي الطُّفَيْلِ سَأَلَ ابْنُ الْكَوَّا عَلِيًّا عَنِ الْمَجَرَّةِ، قَالَ‏:‏ هُوَ شَرَجُ السَّمَاءِ، وَمِنْهَا فُتِحَتِ السَّمَاءُ بِمَاءٍ مُنْهَمِرٍ‏.‏","english":{"narrator":"","text":"Ibn al-Kawwa' asked 'Ali about the Milky Way. He said, \"It is the\nwater-trough (or loop of the bag) from which the heaven opens up flowing\nwater.\""}},{"id":14,"idInBook":14,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا عَارِمٌ، قَالَ‏:‏ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ‏:‏ الْقَوْسُ‏:‏ أَمَانٌ لأَهْلِ الأَرْضِ مِنَ الْغَرَقِ، وَالْمَجَرَّةُ‏:‏ بَابُ السَّمَاءِ الَّذِي تَنْشَقُّ مِنْهُ","english":{"narrator":"","text":"Ibn 'Abbas said, \"The rainbow is security for the people of the\nearth that they will not be drowned. The Milky Way is the door of the heavens\nand forms a furrow through it.\""}},{"id":15,"idInBook":15,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ قَالَ‏:‏ حَدَّثَنِي أَبُو الْحَارِثِ الْكَرْمَانِيُّ قَالَ‏:‏ سَمِعْتُ رَجُلاً قَالَ لأَبِي رَجَاءٍ‏:‏ أَقْرَأُ عَلَيْكَ السَّلاَمَ، وَأَسْأَلُ اللَّهَ أَنْ يَجْمَعَ بَيْنِي وَبَيْنَكَ فِي مُسْتَقَرِّ رَحْمَتِهِ، قَالَ‏:‏ وَهَلْ يَسْتَطِيعُ أَحَدٌ ذَلِكَ‏؟‏ قَالَ‏:‏ فَمَا مُسْتَقَرُّ رَحْمَتِهِ‏؟‏ قَالَ‏:‏ الْجَنَّةُ، قَالَ‏:‏ لَمْ تُصِبْ، قَالَ‏:‏ فَمَا مُسْتَقَرُّ رَحْمَتِهِ‏؟‏ قَالَ‏:‏ قُلْتُ‏:‏ رَبُّ الْعَالَمِينَ‏.‏","english":{"narrator":"","text":"Abu'l-Harith al-Kirmani heard a man say to Abu Raja', \"I greet\nyou and I ask Allah to join both of us together in the Abiding Abode of\nHis mercy.\" Abu Raja' said, \"Is anyone capable of that?\" He continued,\n\"What is the Abiding Abode of His mercy?\" \"The Garden,\" the man replied.\n\"That is not correct,\" he said. The man asked, \"Then what is the Abiding\nAbode of His mercy?\" \"The Lord of the Worlds,\" he replied."}},{"id":16,"idInBook":16,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ قَالَ‏:‏ حَدَّثَنِي مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ‏:‏ لاَ يَقُولَنَّ أَحَدُكُمْ‏:‏ يَا خَيْبَةَ الدَّهْرِ، فَإِنَّ اللَّهَ هُوَ الدَّهْرُ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"None of you should say, 'May time (ad-Dahr)\nbe disappointed. Allah is time (ad-Dahr).\""}},{"id":17,"idInBook":17,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدِ اللهِ، قَالَ‏:‏ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ، عَنْ أَبِي بَكْرِ بْنِ يَحْيَى الأَنْصَارِيِّ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ لاَ يَقُلْ أَحَدُكُمْ‏:‏ يَا خَيْبَةَ الدَّهْرِ، قَالَ اللَّهُ عَزَّ وَجَلَّ‏:‏ أَنَا الدَّهْرُ، أُرْسِلُ اللَّيْلَ وَالنَّهَارَ، فَإِذَا شِئْتُ قَبَضْتُهُمَا‏.‏ وَلاَ يَقُولَنَّ لِلْعِنَبِ‏:‏ الْكَرْمَ، فَإِنَّ الْكَرْمَ الرَّجُلُ الْمُسْلِمُ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"None of you should say, 'May time be disappointed!'\nAllah Almighty said, 'I am time (ad-Dahr). I send the night and\nthe day. If I so wished, I could take them away.' None of you should the\ngrape-vine 'karm\" (instead of 'inab). Karm* is the\nMuslim man.\""}},{"id":18,"idInBook":18,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا بِشْرُ بْنُ مُحَمَّدٍ، قَالَ‏:‏ أَخْبَرَنَا عَبْدُ اللهِ، قَالَ‏:‏ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ لَيْثٍ، عَنْ مُجَاهِدٍ قَالَ‏:‏ يُكْرَهُ أَنْ يُحِدَّ الرَّجُلُ إِلَى أَخِيهِ النَّظَرَ، أَوْ يُتْبِعَهُ بَصَرَهُ إِذَا وَلَّى، أَوْ يَسْأَلَهُ‏:‏ مِنْ أَيْنَ جِئْتَ، وَأَيْنَ تَذْهَبُ‏؟‏‏.‏","english":{"narrator":"","text":"Mujahid said, \"It is disliked for a man to stare at his brother\nor let his eye follow him when he turns his back or to ask, 'Where have\nyou come from? Where are you going?'\""}},{"id":19,"idInBook":19,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى، قَالَ‏:‏ حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم رَأَى رَجُلاً يَسُوقُ بَدَنَةً، فَقَالَ‏:‏ ارْكَبْهَا، فَقَالَ‏:‏ إِنَّهَا بَدَنَةٌ، قَالَ‏:‏ ارْكَبْهَا، قَالَ‏:‏ إِنَّهَا بَدَنَةٌ، قَالَ‏:‏ ارْكَبْهَا، قَالَ‏:‏ فَإِنَّهَا بَدَنَةٌ، قَالَ‏:‏ ارْكَبْهَا، وَيْلَكَ‏.‏","english":{"narrator":"","text":"Anas reported that the Prophet, may Allah bless him and grant him\npeace, saw a man driving a sacrificial camel. \"Ride it,\" he told him. The\nman replied, \"It is a sacrificial camel.\" \"Ride it,\" he repeated. The man\nsaid again, \"It is a sacrificial camel.\" \"Ride it,\" he repeated. The man\nsaid, \"It is a sacrificial camel.\" The Prophet said, \"Ride it, and bother\nyou!\""}},{"id":20,"idInBook":20,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، قَالَ‏:‏ حَدَّثَنَا أَبُو عَلْقَمَةَ عَبْدُ اللهِ بْنُ مُحَمَّدِ بْنِ عَبْدِ اللهِ بْنِ أَبِي فَرْوَةَ، حَدَّثَنِي الْمِسْوَرُ بْنُ رِفَاعَةَ الْقُرَظِيُّ قَالَ‏:‏ سَمِعْتُ ابْنَ عَبَّاسٍ، وَرَجُلٌ يَسْأَلُهُ، فَقَالَ‏:‏ إِنِّي أَكَلْتُ خُبْزًا وَلَحْمًا، فَهَلْ أَتَوَضَّأُ‏؟‏ فَقَالَ‏:‏ وَيْحَكَ، أَتَتَوَضَّأُ مِنَ الطَّيِّبَاتِ‏؟‏‏.‏","english":{"narrator":"","text":"Al-Miswar ibn Rifa'a al-Quruzi said, \"I heard a man ask Ibn 'Abbas,\n'Should I do wudu' after I have eaten bread and meat?' He replied, 'Woe\nto you! Would you do wudu' on account of good things?'\""}},{"id":21,"idInBook":21,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا عَلِيٌّ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ قَالَ‏:‏ حَدَّثَنِي أَبُو الزُّبَيْرِ، عَنْ جَابِرٍ قَالَ‏:‏ كَانَ رَسُولُ اللهِ صلى الله عليه وسلم يَوْمَ حُنَيْنٍ بِالْجِعْرَانَةِ، وَالتِّبْرُ فِي حِجْرِ بِلاَلٍ، وَهُوَ يَقْسِمُ، فَجَاءَهُ رَجُلٌ فَقَالَ‏:‏ اعْدِلْ، فَإِنَّكَ لاَ تَعْدِلُ، فَقَالَ‏:‏ وَيْلَكَ، فَمَنْ يَعْدِلُ إِذَا لَمْ أَعْدِلُ‏؟‏ قَالَ عُمَرُ‏:‏ دَعْنِي يَا رَسُولَ اللهِ، أَضْرِبُ عُنُقَ هَذَا الْمُنَافِقِ، فَقَالَ‏:‏ إِنَّ هَذَا مَعَ أَصْحَابٍ لَهُ، أَوْ‏:‏ فِي أَصْحَابٍ لَهُ، يَقْرَؤُونَ الْقُرْآنَ، لاَ يُجَاوِزُ تَرَاقِيَهُمْ، يَمْرُقُونَ مِنَ الدِّينِ كَمَا يَمْرُقُ السَّهْمُ مِنَ الرَّمِيَّةِ‏.‏","english":{"narrator":"","text":"Jabir said, \"The Messenger of Allah, may Allah bless him and grant\nhim peace, was at al-Ji'rana on the Day of the Battle of Hunayn with the\nspoils in the custody of Bilal. The Prophet was dividing them out. A man\ncame up to him and said, 'Be just! You are not being just!' The Prophet\nsaid, 'Bother you! Who will be just if I am not just?' 'Umar said, 'Messenger\nof Allah, let me strike off the head of the hypocrite!' The Prophet said,\n'This man is with his followers who recite the Qur'an and it does not go\nbeyond their throats. They pass through the deen as an arrow passes through\nthe target (i.e. nothing of it remains on the arrow).'\""}},{"id":22,"idInBook":22,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا سَهْلُ بْنُ بَكَّارٍ، قَالَ‏:‏ حَدَّثَنَا الأَسْوَدُ بْنُ شَيْبَانَ، عَنْ خَالِدِ بْنِ سُمَيْرٍ، عَنْ بَشِيرِ بْنِ نَهِيكٍ، عَنْ بَشِيرٍ، وَكَانَ اسْمُهُ زَحْمَ بْنَ مَعْبَدٍ، فَهَاجَرَ إِلَى النَّبِيِّ صلى الله عليه وسلم، فَقَالَ‏:‏ مَا اسْمُكَ‏؟‏ قَالَ‏:‏ زَحْمٌ، قَالَ‏:‏ بَلْ أَنْتَ بَشِيرٌ، قَالَ‏:‏ بَيْنَمَا أَنَا أَمْشِي مَعَ رَسُولِ اللهِ صلى الله عليه وسلم إِذْ مَرَّ بِقُبُورِ الْمُشْرِكِينَ فَقَالَ‏:‏ لَقَدْ سَبَقَ هَؤُلاَءِ خَيْرٌ كَثِيرٌ ثَلاَثًا، فَمَرَّ بِقُبُورِ الْمُسْلِمِينَ فَقَالَ‏:‏ لَقَدْ أَدْرَكَ هَؤُلاَءِ خَيْرًا كَثِيرًا ثَلاَثًا، فَحَانَتْ مِنَ النَّبِيِّ صلى الله عليه وسلم نَظْرَةٌ، فَرَأَى رَجُلاً يَمْشِي فِي الْقُبُورِ، وَعَلَيْهِ نَعْلاَنِ، فَقَالَ‏:‏ يَا صَاحِبَ السِّبْتِيَّتَيْنِ، أَلْقِ سِبْتِيَّتَيْكَ، فَنَظَرَ الرَّجُلُ، فَلَمَّا رَأَى النَّبِيَّ صلى الله عليه وسلم خَلَعَ نَعْلَيْهِ فَرَمَى بِهِمَا‏.‏","english":{"narrator":"","text":"Bashir ibn Ma'bad as-Sadusi (whose name was Zahim ibn Ma'bad) made\nhijra (emigration) to the Prophet, may Allah bless him and grant him peace,\nand the Prophet asked him, \"What is your name?\" \"Zahim,\" he replied. The\nProphet said, 'No, you are Bashir.\" Bashir said, \"While I was walking with\nthe Messenger of Allah, may Allah bless him and grant him peace, he passed\nthe graves of some idolaters. He said, 'These people have missed much good'\nthree times. Then he passed by the graves of the Muslims and observed,\n'These people have obtained much good.' The Prophet, may Allah bless him\nand grant him peace, suddenly looked up and saw a man wearing sandals walking\namong the graves. He said, 'You with the ox-hide sandals, take off your\nsandals!' When he saw the Prophet, may Allah bless him and grant him peace,\nhe removed his sandals and threw them away.'\""}},{"id":23,"idInBook":23,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي فُدَيْكٍ، عَنْ مُحَمَّدِ بْنِ هِلاَلٍ، أَنَّهُ رَأَى حُجَرَ أَزْوَاجِ النَّبِيِّ صلى الله عليه وسلم مِنْ جَرِيدٍ مَسْتُورَةً بِمُسُوحِ الشَّعْرِ، فَسَأَلْتُهُ عَنْ بَيْتِ عَائِشَةَ، فَقَالَ‏:‏ كَانَ بَابُهُ مِنْ وِجْهَةِ الشَّامِ، فَقُلْتُ‏:‏ مِصْرَاعًا كَانَ أَوْ مِصْرَاعَيْنِ‏؟‏ قَالَ‏:‏ كَانَ بَابًا وَاحِدًا، قُلْتُ‏:‏ مِنْ أَيِّ شَيْءٍ كَانَ‏؟‏ قَالَ‏:‏ مِنْ عَرْعَرٍ أَوْ سَاجٍ‏.‏","english":{"narrator":"","text":"Muhammad ibn Hilal reported that he saw the rooms of the wives\nof the Prophet, may Allah bless him and grant him peace. The rooms were\nmade of palm trunks covered with hair. The transmitter (Muhammad ibn Abi\nFudayk) said, \"I asked him about 'A'isha's room and he said, 'Its door\nfaced Syria.' I asked, 'Was it one or two spans?' 'Its door was one span,'\nhe replied. I asked, 'And what was it made of?' He said, 'From cypress\nor teak wood.'\""}},{"id":24,"idInBook":24,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، قَالَ‏:‏ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، عَنْ عَبْدِ اللهِ بْنِ أَبِي يَحْيَى، عَنْ سَعِيدِ بْنِ أَبِي هِنْدَ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ لاَ تَقُومُ السَّاعَةُ حَتَّى يَبْنِيَ النَّاسُ بُيُوتًا يُوشُونَهَا وَشْيَ الْمَرَاحِيلِ قَالَ إِبْرَاهِيمُ‏:‏ يَعْنِي الثِّيَابَ الْمُخَطَّطَةَ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"The Final Hour will not come until houses'\nadornments resemble painted garments.\""}},{"id":25,"idInBook":25,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلامٍ، قَالَ‏:‏ أَخْبَرَنَا مُحَمَّدُ بْنُ فُضَيْلِ بْنِ غَزْوَانَ، عَنْ عُمَارَةَ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ‏:‏ جَاءَ رَجُلٌ إِلَى رَسُولِ اللهِ صلى الله عليه وسلم فَقَالَ‏:‏ يَا رَسُولَ اللهِ، أَيُّ الصَّدَقَةِ أَفْضَلُ أَجْرًا‏؟‏ قَالَ‏:‏ أَمَا وَأَبِيكَ لَتُنَبَّأَنَّهُ‏:‏ أَنْ تَصَدَّقَ وَأَنْتَ صَحِيحٌ شَحِيحٌ تَخْشَى الْفَقْرَ، وَتَأْمُلُ الْغِنَى، وَلاَ تُمْهِلْ حَتَّى إِذَا بَلَغَتِ الْحُلْقُومَ قُلْتَ‏:‏ لِفُلاَنٍ كَذَا، وَلِفُلاَنٍ كَذَا، وَقَدْ كَانَ لِفلانٍ‏.‏","english":{"narrator":"","text":"Abu Hurayra said, \"A man came to the Messenger of Allah, may Allah\nbless him and grant him peace, and said, 'Messenger of Allah, which sadaqa\nhas the best reward?' He said, 'By your father, you will learn of it. It\nis that you give sadaqa while you are healthy and avaricious, fearful of\npoverty and desirous of wealth. You should not delay it until you are at\nthe point of death and then say, \"This much is for so-and-so. This much\nis for so-and-so. This much is for so-and-so.\"'\""}},{"id":26,"idInBook":26,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ قَالَ‏:‏ حَدَّثَنِي الأَعْمَشُ، عَنْ أَبِي إِسْحَاقَ، عَنْ أَبِي الأَحْوَصِ، عَنْ عَبْدِ اللهِ قَالَ‏:‏ إِذَا طَلَبَ أَحَدُكُمُ الْحَاجَةَ فَلْيَطْلُبْهَا طَلَبًا يَسِيرًا، فَإِنَّمَا لَهُ مَا قُدِّرَ لَهُ، وَلاَ يَأْتِي أَحَدُكُمْ صَاحِبَهُ فَيَمْدَحَهُ، فَيَقْطَعَ ظَهْرَهُ‏.‏","english":{"narrator":"","text":"'Abdullah said, \"When one of you seeks something he needs, he should\nask for something small. He will have what is decreed for him. None of\nyou should go to his companion and then praise him and thus break his back.\""}},{"id":27,"idInBook":27,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ‏:‏ حَدَّثَنَا إِسْمَاعِيلُ، عَنْ أَيُّوبَ، عَنْ أَبِي الْمَلِيحِ بْنِ أُسَامَةَ، عَنْ أَبِي عَزَّةَ يَسَارِ بْنِ عَبْدِ اللهِ الْهُذَلِيِّ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ إِنَّ اللَّهَ إِذَا أَرَادَ قَبْضَ عَبْدٍ بِأَرْضٍ، جَعَلَ لَهُ بِهَا، أَوْ‏:‏ فِيهَا أ حَاجَةً‏.‏","english":{"narrator":"","text":"Abu 'Izza Yassar ibn 'Abdullah al-Hudhali reported that the Prophet,\nmay Allah bless him and grant him peace, said, \"When Allah wants a slave\nto die in a particular country, he makes him have some reason for being\nthere.\""}},{"id":28,"idInBook":28,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى، قَالَ‏:‏ حَدَّثَنَا الصَّعْقُ قَالَ‏:‏ سَمِعْتُ أَبَا جَمْرَةَ قَالَ‏:‏ أَخْبَرَنِي أَبُو عَبْدِ الْعَزِيزِ قَالَ‏:‏ أَمْسَى عِنْدَنَا أَبُو هُرَيْرَةَ، فَنَظَرَ إِلَى نَجْمٍ عَلَى حِيَالِهِ فَقَالَ‏:‏ وَالَّذِي نَفْسُ أَبِي هُرَيْرَةَ بِيَدِهِ، لَيَوَدَّنَّ أَقْوَامٌ وَلَوْا إِمَارَاتٍ فِي الدُّنْيَا وَأَعْمَالاً أَنَّهُمْ كَانُوا مُتَعَلِّقِينَ عِنْدَ ذَلِكَ النَّجْمِ، وَلَمْ يَلُوا تِلْكَ الإِمَارَاتِ، وَلاَ تِلْكَ الأَعْمَالَ‏.‏ ثُمَّ أَقْبَلَ عَلَيَّ فَقَالَ‏:‏ لاَ بُلَّ شَانِئُكَ، أَكُلُّ هَذَا سَاغَ لأَهْلِ الْمَشْرِقِ فِي مَشْرِقِهِمْ‏؟‏ قُلْتُ‏:‏ نَعَمْ وَاللَّهِ، قَالَ‏:‏ لَقَدْ قَبَّحَ اللَّهُ وَمَكَرَ، فَوَالَّذِي نَفْسُ أَبِي هُرَيْرَةَ بِيَدِهِ، لَيَسُوقُنَّهُمْ حُمُرًا غِضَابًا، كَأَنَّمَا وُجُوهُهُمُ الْمَجَانُّ الْمُطْرَقَةُ، حَتَّى يُلْحِقُوا ذَا الزَّرْعِ بِزَرْعِهِ، وَذَا الضَّرْعِ بِضَرْعِهِ‏.‏","english":{"narrator":"","text":"Abu 'Abdu'l-'Aziz said, \"Abu Hurayra spent the night with us and\nlooked at a star before him. Then he said, 'By the One who holds Abu Hurayra\nin his hand, some people wish that they would be appointed commanders in\nthe earth while their actions are as if they were handing from that star.\nThey are not appointed to those positions of command not to those positions.'\nThen he turned to me and said, 'May the one who hates you not have good!\nIs all of this allowed by the people of the east in the east?' 'Yes, by\nAllah,' I replied. He said, 'May Allah make them ugly and drive them like\nangry camels as if their faces were beaten shields until they give the\nowner of a field his field and the owner of sheep his sheep!'\""}},{"id":29,"idInBook":29,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا مَطَرُ بْنُ الْفَضْلِ، قَالَ‏:‏ حَدَّثَنَا حَجَّاجٌ، قَالَ ابْنُ جُرَيْجٍ‏:‏ سَمِعْتُ مُغِيثًا يَزْعُمُ، أَنَّ ابْنَ عُمَرَ سَأَلَهُ‏:‏ مَنْ مَوْلاَهُ‏؟‏ فَقَالَ‏:‏ اللَّهُ وَفُلاَنٌ، قَالَ ابْنُ عُمَرَ‏:‏ لاَ تَقُلْ كَذَلِكَ، لاَ تَجْعَلْ مَعَ اللهِ أَحَدًا، وَلَكِنْ قُلْ‏:‏ فُلاَنٌ بَعْدَ اللهِ‏.‏","english":{"narrator":"Mughith claimed that Ibn 'Umar once asked him about his mawla and\nMughith replied, \"By Allah and so-and-so.\" Ibn 'Umar responded, \"Do not\nspeak like that. Do not put anyone with Allah. Say \"so-and-so:","text":"after you\nhave said, \"Allah.\""}},{"id":30,"idInBook":30,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنِ الأَجْلَحِ، عَنْ يَزِيدَ، عَنِ ابْنِ عَبَّاسٍ‏:‏ قَالَ رَجُلٌ لِلنَّبِيِّ صلى الله عليه وسلم‏:‏ مَا شَاءَ اللَّهُ وَشِئْتَ، قَالَ‏:‏ جَعَلْتَ لِلَّهِ نِدًّا، مَا شَاءَ اللَّهُ وَحْدَهُ‏.‏","english":{"narrator":"","text":"Ibn 'Abbas said, \"A man said, to the Prophet, 'Whatever Allah wills\nand you will.' He said, 'You have put an equal with Allah. It is what Allah\nalone wills.'\""}},{"id":31,"idInBook":31,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ صَالِحٍ قَالَ‏:‏ حَدَّثَنِي عَبْدُ الْعَزِيزِ بْنُ أَبِي سَلَمَةَ، عَنْ عَبْدِ اللهِ بْنِ دِينَارٍ قَالَ‏:‏ خَرَجْتُ مَعَ عَبْدِ اللهِ بْنِ عُمَرَ إِلَى السُّوقِ، فَمَرَّ عَلَى جَارِيَةٍ صَغِيرَةٍ تُغَنِّي، فَقَالَ‏:‏ إِنَّ الشَّيْطَانَ لَوْ تَرَكَ أَحَدًا لَتَرَكَ هَذِهِ‏.‏","english":{"narrator":"","text":"'Abdullah ibn Dinar said, \"I went out with 'Abdullah ibn 'Umar\nto the market. He passed by a small slave-girl who singing and remarked,\n'Shaytan. If he had left anyone, he would have left this girl.'\""}},{"id":32,"idInBook":32,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلامٍ، قَالَ‏:‏ أَخْبَرَنَا يَحْيَى بْنُ مُحَمَّدٍ أَبُو عَمْرٍو الْبَصْرِيُّ قَالَ‏:‏ سَمِعْتُ عَمْرًا مَوْلَى الْمُطَّلِبِ قَالَ‏:‏ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ يَقُولُ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ لَسْتُ مِنْ دَدٍ، وَلاَ الدَّدُ مِنِّي بِشَيْءٍ، يَعْنِي‏:‏ لَيْسَ الْبَاطِلُ مِنِّي بِشَيْءٍ‏.‏","english":{"narrator":"","text":"Anas ibn Malik heard the Messenger of Allah, may Allah bless him\nand grant him peace, say, \"I have nothing to do with diversions and diversions\nhave nothing to do with me.\" He meant that he does not do anything worthless.\""}},{"id":33,"idInBook":33,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، قَالَ‏:‏ أَخْبَرَنَا خَالِدُ بْنُ عَبْدِ اللهِ، قَالَ‏:‏ أَخْبَرَنَا عَطَاءُ بْنُ السَّائِبِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ‏:‏ ‏{‏وَمِنَ النَّاسِ مَنْ يَشْتَرِي لَهْوَ الْحَدِيثِ‏}‏، قَالَ‏:‏ الْغِنَاءُ وَأَشْبَاهُهُ‏.‏","english":{"narrator":"","text":"Ibn 'Abbas said about \"There are some people who trade in distracting\ntales\" (31:5) that it means singing and things like it."}},{"id":34,"idInBook":34,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، قَالَ‏:‏ أَخْبَرَنَا الْفَزَارِيُّ، وَأَبُو مُعَاوِيَةَ، قَالاَ‏:‏ أَخْبَرَنَا قِنَانُ بْنُ عَبْدِ اللهِ النَّهْمِيُّ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْسَجَةَ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ أَفْشُوا السَّلاَمَ تَسْلَمُوا، وَالأشَرَةُ شَرٌّ‏.‏","english":{"narrator":"","text":"Al-Bara' ibn 'Azib reported that the Messenger of Allah, may Allah\nbless him and grant him peace, said, \"Spread the greeting to people and\nyou will be safe. The saw is evil.\""}},{"id":35,"idInBook":35,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا عِصَامٌ، قَالَ‏:‏ حَدَّثَنَا حَرِيزٌ، عَنْ سَلْمَانَ بْنِ سُمَيْرٍ الأَلَهَانِيِّ، عَنْ فَضَالَةَ بْنِ عُبَيْدٍ، وَكَانَ بِجَمْعٍ مِنَ الْمَجَامِعِ، فَبَلَغَهُ أَنَّ أَقْوَامًا يَلْعَبُونَ بِالْكُوبَةِ، فَقَامَ غَضْبَانَ يَنْهَى عَنْهَا أَشَدَّ النَّهْيِ، ثُمَّ قَالَ‏:‏ أَلاَ إِنَّ اللاَّعِبَ بِهَا لَيَأْكُلُ ثَمَرَهَا، كَآكِلِ لَحْمِ الْخِنْزِيرِ، وَمُتَوَضِّئٍ بِالدَّمِ‏.‏ يَعْنِي بِالْكُوبَةِ‏:‏ النَّرْدَ‏.‏","english":{"narrator":"","text":"Fadala ibn 'Ubayd was at a meeting when he heard that some people\nwere playing backgammon. He got up in anger to forbid it in the strongest\npossible terms. Then he said, \"The one who plays in order to live on his\nwinnings is like a person who eats pig meat and does wudu' in blood.\""}},{"id":36,"idInBook":36,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ أَبِي الأَسْوَدِ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، قَالَ‏:‏ حَدَّثَنَا الْحَارِثُ بْنُ حَصِيرَةَ، قَالَ‏:‏ حَدَّثَنَا زَيْدُ بْنُ وَهْبٍ قَالَ‏:‏ سَمِعْتُ ابْنَ مَسْعُودٍ يَقُولُ‏:‏ إِنَّكُمْ فِي زَمَانٍ‏:‏ كَثِيرٌ فُقَهَاؤُهُ، قَلِيلٌ خُطَبَاؤُهُ، قَلِيلٌ سُؤَّالُهُ، كَثِيرٌ مُعْطُوهُ، الْعَمَلُ فِيهِ قَائِدٌ لِلْهَوَى‏.‏ وَسَيَأْتِي مِنْ بَعْدِكُمْ زَمَانٌ‏:‏ قَلِيلٌ فُقَهَاؤُهُ، كَثِيرٌ خُطَبَاؤُهُ، كَثِيرٌ سُؤَّالُهُ، قَلِيلٌ مُعْطُوهُ، الْهَوَى فِيهِ قَائِدٌ لِلْعَمَلِ، اعْلَمُوا أَنَّ حُسْنَ الْهَدْيِ، فِي آخِرِ الزَّمَانِ، خَيْرٌ مِنْ بَعْضِ الْعَمَلِ‏.‏","english":{"narrator":"","text":"Ibn Mas'ud was heard to say, \"You are living at a time when there\nare many men of understanding and few orators. There are few who ask and\nmany who give. In it there is more action than diversion. After you there\nwill come a time when there are few men of understanding and many orators.\nThere will be many who ask and few who give. Guidance in it directs action.\nKnow that right guidance at the end of time is better than some actions.\""}},{"id":37,"idInBook":37,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، قَالَ‏:‏ أَخْبَرَنَا خَالِدُ بْنُ عَبْدِ اللهِ، عَنِ الْجُرَيْرِيِّ، عَنْ أَبِي الطُّفَيْلِ، قَالَ‏:‏ قُلْتُ لَهُ‏:‏ رَأَيْتَ النَّبِيَّ صلى الله عليه وسلم‏؟‏ قَالَ‏:‏ نَعَمْ، وَلاَ أَعْلَمُ عَلَى ظَهْرِ الأَرْضِ رَجُلاً حَيًّا رَأَى النَّبِيَّ صلى الله عليه وسلم غَيْرِي، قَالَ‏:‏ وَكَانَ أَبْيَضَ، مَلِيحَ الْوَجْهِ‏.‏","english":{"narrator":"","text":"Abu't-Tufayl said, \"I was asked, 'Did you see the Prophet, may\nAllah bless him and grant him peace?' 'Yes,' I replied, 'and I do not know\nof any man left alive on the face of the earth except myself who saw the\nProphet, may Allah bless him and grant him peace.' He went on, 'The Prophet\nhad white skin and a handsome face.'\""}},{"id":38,"idInBook":38,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا فَرْوَةُ، قَالَ‏:‏ حَدَّثَنَا عَبِيدَةُ بْنُ حُمَيْدٍ، عَنْ قَابُوسَ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ الْهَدْيُ الصَّالِحُ، وَالسَّمْتُ الصَّالِحُ، وَالِاقْتِصَادُ، جُزْءٌ مِنْ خَمْسَةٍ وَعِشْرِينَ جُزْءًا مِنَ النُّبُوَّةِ‏.‏","english":{"narrator":"","text":"Ibn 'Abbas reported that the Prophet, may Allah bless him and grant\nhim peace, said, \"Right guidance, correct behaviour and being moderate\nform a twenty-fifth portion of prophethood.\""}},{"id":39,"idInBook":39,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ حَدَّثَنَا الْوَلِيدُ بْنُ أَبِي ثَوْرٍ، عَنْ سِمَاكٍ، عَنْ عِكْرِمَةَ قَالَ‏:‏ سَأَلْتُ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا‏:‏ هَلْ سَمِعْتِ رَسُولَ اللهِ صلى الله عليه وسلم يَتَمَثَّلُ شِعْرًا قَطُّ‏؟‏ فَقَالَتْ‏:‏ أَحْيَانًا، إِذَا دَخَلَ بَيْتَهُ يَقُولُ‏:‏ وَيَأْتِيكَ بِالأَخْبَارِ مَنْ لَمْ تُزَوِّدِ‏.‏","english":{"narrator":"","text":"It is related that 'Ikrima said, \"I asked 'A'isha, 'Did you ever\nhear the Messenger of Allah, may Allah bless him and grant him peace, quoting\npoetry?' She replied, 'Sometimes when he entered a house, he would say,\n\"News will come to you from someone you do not furnish with travel provisions.\"*'\""}},{"id":40,"idInBook":40,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنْ لَيْثٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ قَالَ‏:‏ إِنَّهَا كَلِمَةُ نَبِيٍّ‏:‏ وَيَأْتِيكَ بِالأَخْبَارِ مَنْ لَمْ تُزَوِّدِ***","english":{"narrator":"","text":"Ibn 'Abbas said, \"This is something that a Prophet said, 'News\nwill come to you from someone you do not furnish with travel provisions'\n(meaning that he had quoted it.\""}},{"id":41,"idInBook":41,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ‏:‏ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عُمَرَ بْنِ أَبِي سَلَمَةَ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم قَالَ‏:‏ إِذَا تَمَنَّى أَحَدُكُمْ فَلْيَنْظُرْ مَا يَتَمَنَّى، فَإِنَّهُ لاَ يَدْرِي مَا يُعْطَى‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"When one of you wishes for something, he\nshould look to what he desires. He does not know what he will be given.\""}},{"id":42,"idInBook":42,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا آدَمُ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، عَنْ سِمَاكٍ، عَنْ عَلْقَمَةَ بْنِ وَائِلٍ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ لاَ يَقُولَنَّ أَحَدُكُمُ‏:‏ الْكَرْمَ، وَقُولُوا الْحَبَلَةَ، يَعْنِي‏:‏ الْعِنَبَ‏.‏","english":{"narrator":"","text":"'Alqama ibn Wa'il reported that the Prophet, may Allah bless him\nand grant him peace, said, \"None of you should say 'kurm.' Rather\nuse 'habala' for grape-vines.\""}},{"id":43,"idInBook":43,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ خَالِدٍ، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاقَ، عَنْ عَمِّهِ مُوسَى بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ، مَرَّ النَّبِيُّ صلى الله عليه وسلم بِرَجُلٍ يَسُوقُ بَدَنَةً، فَقَالَ‏:‏ ارْكَبْهَا، فَقَالَ‏:‏ يَا رَسُولَ اللهِ، إِنَّهَا بَدَنَةٌ، فَقَالَ‏:‏ ارْكَبْهَا، قَالَ‏:‏ إِنَّهَا بَدَنَةٌ، قَالَ فِي الثَّالِثَةِ أَوْ فِي الرَّابِعَةِ‏:‏ وَيْحَكَ ارْكَبْهَا‏.‏","english":{"narrator":"","text":"See 772."}},{"id":44,"idInBook":44,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ شَرِيكٍ قَالَ‏:‏ حَدَّثَنِي أَبِي، عَنْ عَبْدِ اللهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ، عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدٍ، عَنْ عِمْرَانَ بْنِ طَلْحَةَ، عَنْ أُمِّهِ حَمْنَةَ بِنْتِ جَحْشٍ قَالَتْ‏:‏ قَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ مَا هِيَ‏؟‏ يَا هَنْتَاهُ‏.‏","english":{"narrator":"","text":"Hamna bint Jahsh said, \"The Prophet, may Allah bless him and grant\nhim peace, said, 'What is it, O person?'\""}},{"id":45,"idInBook":45,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا قُتَيْبَةُ، قَالَ‏:‏ حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ حَبِيبِ بْنِ صُهْبَانَ الأَسَدِيِّ‏:‏ رَأَيْتُ عَمَّارًا صَلَّى الْمَكْتُوبَةَ ثُمَّ قَالَ لِرَجُلٍ إِلَى جَنْبِهِ‏:‏ يَا هَنَاهْ، ثُمَّ قَامَ‏.‏","english":{"narrator":"","text":"Habib ibn Sabhan al-Asadi said, \"I saw 'Ammar praying the obligatory\nprayer. Then he said to a man at his side, 'O person!' Then he got up.\""}},{"id":46,"idInBook":46,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللهِ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنْ إِبْرَاهِيمَ بْنِ مَيْسَرَةَ، عَنْ عَمْرِو بْنِ الشَّرِيدِ، عَنْ أَبِيهِ قَالَ‏:‏ أَرْدَفَنِي النَّبِيُّ صلى الله عليه وسلم فَقَالَ‏:‏ هَلْ مَعَكَ مِنْ شِعْرِ أُمَيَّةَ بْنِ أَبِي الصَّلْتِ‏؟‏ قُلْتُ‏:‏ نَعَمْ‏.‏ فَأَنْشَدْتُهُ بَيْتًا، فَقَالَ‏:‏ هِيهِ، حَتَّى أَنْشَدْتُهُ مِئَةَ بَيْتٍ‏.‏","english":{"narrator":"","text":"Ash-Sharid said, \"The Prophet, may Allah bless him and grant him\npeace, rode with me behind him and said, \"Do you know any of the poetry\nof Umayya ibn Abi's-Salt?' 'Yes,' I replied and recited a line. 'Go on,'\nhe said, until I had recited a hundred lines.\""}},{"id":47,"idInBook":47,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ‏:‏ حَدَّثَنَا أَبُو دَاوُدَ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، عَنْ يَزِيدَ بْنِ خُمَيْرٍ قَالَ‏:‏ سَمِعْتُ عَبْدَ اللهِ بْنَ أَبِي مُوسَى قَالَ‏:‏ قَالَتْ عَائِشَةُ‏:‏ لاَ تَدَعْ قِيَامَ اللَّيْلِ، فَإِنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ لاَ يَذَرُهُ، وَكَانَ إِذَا مَرِضَ أَوْ كَسِلَ صَلَّى قَاعِدًا‏.‏","english":{"narrator":"","text":"'A'isha said, \"Do not forget to stand up at night to pray. The\nProphet, may Allah bless him and grant him peace, did not neglect to do\nit. If he was either ill or lazy, he prayed sitting down.\""}},{"id":48,"idInBook":48,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، قَالَ‏:‏ حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ قَالَ‏:‏ حَدَّثَنِي عَمْرُو بْنُ أَبِي عَمْرٍو قَالَ‏:‏ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ يَقُولُ‏:‏ كَانَ النَّبِيُّ صلى الله عليه وسلم يُكْثِرُ أَنْ يَقُولَ‏:‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ، وَالْعَجْزِ وَالْكَسَلِ، وَالْجُبْنِ وَالْبُخْلِ، وَضَلَعِ الدَّيْنِ، وَغَلَبَةِ الرِّجَالِ‏.‏","english":{"narrator":"","text":"Anas ibn Malik said, \"The Prophet, may Allah bless him and grant\nhim peace, used to often say, 'O Allah, I seek refuge with You from worry,\nsorrow, incapacity, laziness, cowardice, avarice, being overburdened by\ndebt and being overcome by other men.'\""}},{"id":49,"idInBook":49,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللهِ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ جُدْعَانَ قَالَ‏:‏ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ يَقُولُ‏:‏ كَانَ أَبُو طَلْحَةَ يَجْثُو بَيْنَ يَدَيْ رَسُولِ اللهِ صلى الله عليه وسلم وَيَنْثُرُ كِنَانَتَهُ وَيَقُولُ‏:‏ وَجْهِي لِوَجْهِكَ الْوِقَاءُ، وَنَفْسِي لِنَفْسِكَ الْفِدَاءُ‏.‏","english":{"narrator":"Anas ibn Malik said, \"Abu Talha used to kneel before the Messenger\nof Allah, may Allah bless him and grant him peace, and sprinkle water on\nhis quiver and say:","text":""}},{"id":50,"idInBook":50,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا مُعَاذُ بْنُ فَضَالَةَ، عَنْ هِشَامٍ، عَنْ حَمَّادٍ، عَنْ زَيْدِ بْنِ وَهْبٍ، عَنْ أَبِي ذَرٍّ قَالَ‏:‏ فَانْطَلَقَ النَّبِيُّ صلى الله عليه وسلم نَحْوَ الْبَقِيعِ، وَانْطَلَقْتُ أَتْلُوهُ، فَالْتَفَتَ فَرَآنِي فَقَالَ‏:‏ يَا أَبَا ذَرٍّ، فَقُلْتُ‏:‏ لَبَّيْكَ يَا رَسُولَ اللهِ، وَسَعْدَيْكَ، وَأَنَا فِدَاؤُكَ، فَقَالَ‏:‏ إِنَّ الْمُكْثِرِينَ هُمُ الْمُقِلُّونَ يَوْمَ الْقِيَامَةِ، إِلاَّ مَنْ قَالَ هَكَذَا وَهَكَذَا فِي حَقٍّ، قُلْتُ‏:‏ اللَّهُ وَرَسُولُهُ أَعْلَمُ، فَقَالَ‏:‏ هَكَذَا ثَلاَثًا، ثُمَّ عَرَضَ لَنَا أُحُدٌ فَقَالَ‏:‏ يَا أَبَا ذَرٍّ، فَقُلْتُ‏:‏ لَبَّيْكَ رَسُولَ اللهِ وَسَعْدَيْكَ، وَأَنَا فِدَاؤُكَ، قَالَ‏:‏ مَا يَسُرُّنِي أَنَّ أُحُدًا لِآلِ مُحَمَّدٍ ذَهَبًا، فَيُمْسِي عِنْدَهُمْ دِينَارٌ، أَوْ قَالَ‏:‏ مِثْقَالٌ، ثُمَّ عَرَضَ لَنَا وَادٍ، فَاسْتَنْتَلَ فَظَنَنْتُ أَنَّ لَهُ حَاجَةً، فَجَلَسْتُ عَلَى شَفِيرٍ، وَأَبْطَأَ عَلَيَّ‏.‏ قَالَ‏:‏ فَخَشِيتُ عَلَيْهِ، ثُمَّ سَمِعْتُهُ كَأَنَّهُ يُنَاجِي رَجُلاً، ثُمَّ خَرَجَ إِلَيَّ وَحْدَهُ، فَقُلْتُ‏:‏ يَا رَسُولَ اللهِ، مَنِ الرَّجُلُ الَّذِي كُنْتَ تُنَاجِي‏؟‏ فَقَالَ‏:‏ أَوَ سَمِعْتَهُ‏؟‏ قُلْتُ‏:‏ نَعَمْ، قَالَ‏:‏ فَإِنَّهُ جِبْرِيلُ أَتَانِي، فَبَشَّرَنِي أَنَّهُ مَنْ مَاتَ مِنْ أُمَّتِي لاَ يُشْرِكُ بِاللَّهِ شَيْئًا دَخَلَ الْجَنَّةَ، قُلْتُ‏:‏ وَإِنْ زَنَى وَإِنْ سَرَقَ‏؟‏ قَالَ‏:‏ نَعَمْ‏.‏","english":{"narrator":"","text":"Abu Dharr said, \"The Prophet, may Allah bless him and grant him\npeace, went towards al-Baqi' and I began to follow him. He turned and saw\nme and said, 'Abu Dharr!' I said, 'At your service, Messenger of Allah.\nMay I be your ransom.' He said, 'Those who are rich will be poor on the\nDay of Rising except those who say, \"Such-and-such and such-and-such is\nfor a right (which was performed).\"' I said, 'Allah and His Messenger know\nbest.' He said, 'That is how it is' three times. Then we came to Uhud.\nHe said, 'Abu Dharr!' I replied, 'At your service, Messenger of Allah.\nMay I be your ransom.' He said, 'It would not delight me if Uhud were to\nbecome gold for the family of Muhammad and then have them spend a night\nwith a dinar - or he said a mithqal.' Then we were at a wadi and he\nwent ahead, so I thought that he felt a call of nature, and so I sat down\nat the edge of the wadi. He was gone a long time and I feared for him.\nThen I heard him and it seemed as if he were talking to a man. Then he\ncame out to me my himself. I said, 'Messenger of Allah, who was the man\nyou were talking to?' 'Did you hear him?' he asked. I said, 'Yes.' He said,\n'That was Jibril. He came to me and gave me the good news that whoever\nof my community dies without associating anything with Allah will enter\nthe Garden.' I said, 'Even if he commits adultery or steals?' He said,\n'Yes.'\""}},{"id":51,"idInBook":51,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا قَبِيصَةُ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ قَالَ‏:‏ حَدَّثَنِي عَبْدُ اللهِ بْنُ شَدَّادٍ قَالَ‏:‏ سَمِعْتُ عَلِيًّا رَضِيَ اللَّهُ عَنْهُ يَقُولُ‏:‏ مَا رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يُفَدِّي رَجُلاً بَعْدَ سَعْدٍ، سَمِعْتُهُ يَقُولُ‏:‏ ارْمِ، فِدَاكَ أَبِي وَأُمِّي","english":{"narrator":"","text":"'Abdullah ibn Shaddad said, \"I heard 'Ali, may Allah be pleased\nwith him, say, 'I did not see the Prophet, may Allah bless him and grant\nhim peace, saying, (\"May my father and mother be) your ransom\" after Sa'd.\nI heard him say to him, \"May my father and mother be your ransom.\"'\""}},{"id":52,"idInBook":52,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ الْحَسَنِ، قَالَ‏:‏ أَخْبَرَنَا الْحُسَيْنُ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ اللهِ بْنُ بُرَيْدَةَ، عَنْ أَبِيهِ‏:‏ خَرَجَ النَّبِيُّ صلى الله عليه وسلم إِلَى الْمَسْجِدِ وَأَبُو مُوسَى يَقْرَأُ، فَقَالَ‏:‏ مَنْ هَذَا‏؟‏ فَقُلْتُ‏:‏ أَنَا بُرَيْدَةُ جُعِلْتُ فِدَاكَ، قَالَ‏:‏ قَدْ أُعْطِيَ هَذَا مِزْمَارًا مِنْ مَزَامِيرِ آلِ دَاوُدَ‏.‏","english":{"narrator":"","text":"'Abdullah ibn Burayda related that his father said, \"The Prophet,\nmay Allah bless him and grant him peace, went out to the mosque while Abu\nMusa was reciting and asked, 'Who is this?' 'I am Burayda,' I replied,\n'May I be your ransom!' He said, 'This man has been given one of the flutes\nof the family of Da'ud.'\""}},{"id":53,"idInBook":53,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا بِشْرُ بْنُ الْحَكَمِ، قَالَ‏:‏ حَدَّثَنَا مَحْبُوبُ بْنُ مُحْرِزٍ الْكُوفِيُّ، قَالَ‏:‏ حَدَّثَنَا الصَّعْبُ بْنُ حَكِيمٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ قَالَ‏:‏ أَتَيْتُ عُمَرَ بْنَ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ، فَجَعَلَ يَقُولُ‏:‏ يَا ابْنَ أَخِي، ثُمَّ سَأَلَنِي‏؟‏ فَانْتَسَبْتُ لَهُ، فَعَرَفَ أَنَّ أَبِي لَمْ يُدْرِكِ الإِسْلاَمَ، فَجَعَلَ يَقُولُ‏:‏ يَا بُنَيَّ يَا بُنَيَّ‏.‏","english":{"narrator":"","text":"As-Sa'b ibn Hakim reported that his grandfather said, \"I came to\n'Umar ibn al-Khattab, may Allah be pleased with him. He began to say, 'Nephew.'\nThen he questioned me and I told him my lineage and so he knew that my\nfather had not become Muslim. He began to say, 'My son, my son.'\""}},{"id":54,"idInBook":54,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدٌ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ اللهِ، قَالَ‏:‏ أَخْبَرَنَا جَرِيرُ بْنُ حَازِمٍ، عَنْ سَلْمٍ الْعَلَوِيِّ قَالَ‏:‏ سَمِعْتُ أَنَسًا يَقُولُ‏:‏ كُنْتُ خَادِمًا لِلنَّبِيِّ صلى الله عليه وسلم، قَالَ‏:‏ فَكُنْتُ أَدْخُلُ بِغَيْرِ اسْتِئْذَانٍ، فَجِئْتُ يَوْمًا، فَقَالَ‏:‏ كَمَا أَنْتَ يَا بُنَيَّ، فَإِنَّهُ قَدْ حَدَثَ بَعْدَكَ أَمْرٌ‏:‏ لا تَدْخُلَنَّ إِلا بِإِذْنٍ‏.‏","english":{"narrator":"","text":"Anas said, \"I used to serve the Prophet, may Allah bless him and\ngrant him peace.\" He continued, \"I used to enter without asking for permission\nto enter. One day I came and he said, 'My son, there is a new situation.\nYou should not come in unless you have permission.'\""}},{"id":55,"idInBook":55,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ صَالِحٍ قَالَ‏:‏ حَدَّثَنِي عَبْدُ الْعَزِيزِ بْنُ أَبِي سَلَمَةَ، عَنِ ابْنِ أَبِي صَعْصَعَةَ، عَنْ أَبِيهِ، أَنَّ أَبَا سَعِيدٍ الْخُدْرِيَّ قَالَ لَهُ‏:‏ يَا بُنَيَّ‏.‏","english":{"narrator":"","text":"Ibn Abi Sa'sa'sa reported from his father that Abu Sa'id al-Khudri\ncalled him \"my son\"."}},{"id":56,"idInBook":56,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ لاَ يَقُولَنَّ أَحَدُكُمْ‏:‏ خَبُثَتْ نَفْسِي، وَلَكِنْ لِيَقُلْ‏:‏ لَقِسَتْ نَفْسِي‏.‏","english":{"narrator":"","text":"'A'isha reported that the Prophet, may Allah bless him and grant\nhim peace, said, \"None of you should say, 'khabuthat nafsi'. He\nshould say, 'Laqisat nafsi.'\""}},{"id":57,"idInBook":57,"chapterId":33,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ قَالَ‏:‏ حَدَّثَنِي اللَّيْثُ قَالَ‏:‏ حَدَّثَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي أُمَامَة َ، عَنْ أَبِيهِ، عَنْ رَسُولِ اللهِ صلى الله عليه وسلم قَالَ‏:‏ لاَ يَقُولَنَّ أَحَدُكُمْ‏:‏ خَبُثَتْ نَفْسِي، وَلْيَقُلْ‏:‏ لَقِسَتْ نَفْسِي‏.‏","english":{"narrator":"","text":"Same with another isnad."}}],"chapter":{"id":33,"bookId":15,"arabic":"كتاب الأقوال","english":"Sayings"}}