{"metadata":{"length":31,"arabic":{"title":"الأدب المفرد","author":"الإمام محمد بن إسماعيل البخاري","introduction":"كتاب الأسْمَاءِ"},"english":{"title":"Al-Adab Al-Mufrad","author":"Imam Muhammad ibn Ismail al-Bukhari","introduction":"Names"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":34,"bookId":15,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ يَعْقُوبَ، قَالَ‏:‏ حَدَّثَنَا يَزِيدُ بْنُ الْمِقْدَامِ بْنِ شُرَيْحِ بْنِ هَانِئٍ الْحَارِثِيُّ، عَنْ أَبِيهِ الْمِقْدَامِ، عَنْ شُرَيْحِ بْنِ هَانِئٍ قَالَ‏:‏ حَدَّثَنِي هَانِئُ بْنُ يَزِيدَ، أَنَّهُ لَمَّا وَفَدَ إِلَى النَّبِيِّ صلى الله عليه وسلم مَعَ قَوْمِهِ، فَسَمِعَهُمُ النَّبِيُّ صلى الله عليه وسلم وَهُمْ يُكَنُّونَهُ بِأَبِي الْحَكَمِ، فَدَعَاهُ النَّبِيُّ صلى الله عليه وسلم فَقَالَ‏:‏ إِنَّ اللَّهَ هُوَ الْحَكَمُ، وَإِلَيْهِ الْحُكْمُ، فَلِمَ تَكَنَّيْتَ بِأَبِي الْحَكَمِ‏؟‏ قَالَ‏:‏ لاَ، وَلَكِنَّ قَوْمِي إِذَا اخْتَلَفُوا فِي شَيْءٍ أَتَوْنِي فَحَكَمْتُ بَيْنَهُمْ، فَرَضِيَ كِلاَ الْفَرِيقَيْنِ، قَالَ‏:‏ مَا أَحْسَنَ هَذَا، ثُمَّ قَالَ‏:‏ مَا لَكَ مِنَ الْوَلَدِ‏؟‏ قُلْتُ‏:‏ لِي شُرَيْحٌ، وَعَبْدُ اللهِ، وَمُسْلِمٌ، بَنُو هَانِئٍ، قَالَ‏:‏ فَمَنْ أَكْبَرُهُمْ‏؟‏ قُلْتُ‏:‏ شُرَيْحٌ، قَالَ‏:‏ فَأَنْتَ أَبُو شُرَيْحٍ، وَدَعَا لَهُ وَوَلَدِهِ‏.‏","english":{"narrator":"","text":"Hani' ibn Yazid related that when he came to the Prophet, may Allah\nbless him and grant him peace, with his people, the Prophet heard them\nusing the kunya Abu'l-Hakam. The Prophet, may Allah bless him and grant\nhim peace, called him and said, \"Allah is the Judge (al-Hakam) and He has\njudgement. Why have you been given the kunya Abu'l-Hakam?\" He said, \"When\nmy people disagree about something, they bring it to me and I judge between\nthem so that both parties are content.\" \"How excellent this!\" the Prophet\nexclaimed. Then he asked, \"Do you have any children?\" Hani' replied, \"I\nhave Shurayh, 'Abdullah and Muslim, the Banu Hani'.' He asked, \"Which of\nthem is the oldest?\" \"Shurayh,\" he replied. He said, \"You are Abu Shurayh,\"\nand he made supplication for him and his children."}},{"id":2,"idInBook":2,"chapterId":34,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ‏:‏ حَدَّثَنَا سَلْمُ بْنُ قُتَيْبَةَ، قَالَ‏:‏ حَدَّثَنَا حَمْلُ بْنُ بَشِيرِ بْنِ أَبِي حَدْرَدٍ قَالَ‏:‏ حَدَّثَنِي عَمِّي، عَنْ أَبِي حَدْرَدٍ قَالَ‏:‏ قَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ مَنْ يَسُوقُ إِبِلَنَا هَذِهِ‏؟‏ أَوْ قَالَ‏:‏ مَنْ يُبَلِّغُ إِبِلَنَا هَذِهِ‏؟‏ قَالَ رَجُلٌ‏:‏ أَنَا، فَقَالَ‏:‏ مَا اسْمُكَ‏؟‏ قَالَ‏:‏ فُلاَنٌ، قَالَ‏:‏ اجْلِسْ، ثُمَّ قَامَ آخَرُ، فَقَالَ‏:‏ مَا اسْمُكَ‏؟‏ قَالَ‏:‏ فُلاَنٌ، فقَالَ‏:‏ اجْلِسْ، ثُمَّ قَامَ آخَرُ، فَقَالَ‏:‏ مَا اسْمُكَ‏؟‏ قَالَ‏:‏ نَاجِيَةُ، قَالَ‏:‏ أَنْتَ لَهَا، فَسُقْهَا‏.‏","english":{"narrator":"","text":"'Abdullah Hudud related that the Prophet, may Allah bless him and\ngrant him peace, said, \"Who will drive these camels of ours?\" or \"Who will\ndeliver these camels of ours?\" A man said, \"I will.\" He asked, \"What is\nyour name?\" \"So-and-so,\" he said. He said, \"Sit down.\" Then another stood\nup and the Prophet asked, \"What is your name?\" The man said, \"So-and-so.\"\nHe said, \"Sit down.\" Then another man stood up and the Prophet said, \"What\nis your name?\" \"Najiyya (Rescuer),\" he said. \"The Prophet said, \"You will\ndo it. Drive them.\""}},{"id":3,"idInBook":3,"chapterId":34,"bookId":15,"arabic":"حَدَّثَنَا إِسْحَاقُ، قَالَ‏:‏ أَخْبَرَنَا جَرِيرٌ، عَنْ قَابُوسَ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ قَالَ‏:‏ أَقْبَلَ نَبِيُّ اللهِ صلى الله عليه وسلم مُسْرِعًا وَنَحْنُ قُعُودٌ، حَتَّى أَفْزَعَنَا سُرْعَتُهُ إِلَيْنَا، فَلَمَّا انْتَهَى إِلَيْنَا سَلَّمَ، ثُمَّ قَالَ‏:‏ قَدْ أَقْبَلْتُ إِلَيْكُمْ مُسْرِعًا، لِأُخْبِرَكُمْ بِلَيْلَةِ الْقَدْرِ، فَنَسِيتُهَا فِيمَا بَيْنِي وَبَيْنَكُمْ، فَالْتَمِسُوهَا فِي الْعَشْرِ الأوَاخِرِ‏.‏","english":{"narrator":"","text":"Ibn 'Abbas said, \"The Prophet of Allah, may Allah bless him and\ngrant him peace, came forward swiftly while we were sitting, He approached\nin such a manner that we wee alarmed by the speed with which he came towards\nus. When he reached us, he greeted us and said, 'I came swiftly to you\nto tell you about the Night of Power. I forgot it in the time it took me\nto get to you, so look for it in the last ten nights (of Ramadan).'\""}},{"id":4,"idInBook":4,"chapterId":34,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، قَالَ‏:‏ حَدَّثَنَا أَحْمَدُ، قَالَ‏:‏ حَدَّثَنَا هِشَامُ بْنُ سَعِيدٍ، قَالَ‏:‏ أَخْبَرَنَا مُحَمَّدُ بْنُ مُهَاجِرٍ قَالَ‏:‏ حَدَّثَنِي عَقِيلُ بْنُ شَبِيبٍ، عَنْ أَبِي وَهْبٍ، وَكَانَتْ لَهُ صُحْبَةٌ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ تَسَمَّوْا بِأَسْمَاءِ الأَنْبِيَاءِ، وَأَحَبُّ الأسْمَاءِ إِلَى اللهِ عَزَّ وَجَلَّ‏:‏ عَبْدُ اللهِ، وَعَبْدُ الرَّحْمَنِ، وَأَصْدَقُهَا‏:‏ حَارِثٌ، وَهَمَّامٌ، وَأَقْبَحُهَا‏:‏ حَرْبٌ، وَمُرَّةُ‏.‏","english":{"narrator":"","text":"Abu Wahb, a Companion, reported that the Prophet, may Allah bless\nhim and grant him peace, said, \"Name yourselves with the names of the Prophets.\nThe names which Allah Almighty loves most are 'Abdullah and 'Abdu'r-Rahman.\nThe most truthful names are Harith and Humam. The ugliest names are Harb\nand Murra.\""}},{"id":5,"idInBook":5,"chapterId":34,"bookId":15,"arabic":"حَدَّثَنَا صَدَقَةُ، قَالَ‏:‏ حَدَّثَنَا ابْنُ عُيَيْنَةَ، قَالَ‏:‏ حَدَّثَنَا ابْنُ الْمُنْكَدِرِ، عَنْ جَابِرٍ قَالَ‏:‏ وُلِدَ لِرَجُلٍ مِنَّا غُلاَمٌ فَسَمَّاهُ‏:‏ الْقَاسِمَ، فَقُلْنَا‏:‏ لاَ نُكَنِّيكَ أَبَا الْقَاسِمِ وَلاَ كَرَامَةَ، فَأُخْبِرَ النَّبِيُّ صلى الله عليه وسلم فَقَالَ‏:‏ سَمِّ ابْنَكَ عَبْدَ الرَّحْمَنِ‏.‏","english":{"narrator":"","text":"Jabir said, \"A man had a child and named him al-Qasim. We said,\n'We will not give you the kunya Abu'l-Qasim nor will we so honour you.\nThe Prophet, may Allah bless him and grant him peace, was told and said,\n'Call your son 'Abdu'r-Rahman.'\""}},{"id":6,"idInBook":6,"chapterId":34,"bookId":15,"arabic":"حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، قَالَ‏:‏ حَدَّثَنَا أَبُو غَسَّانَ قَالَ‏:‏ حَدَّثَنِي أَبُو حَازِمٍ، عَنْ سَهْلٍ قَالَ‏:‏ أُتِيَ بِالْمُنْذِرِ بْنِ أَبِي أُسَيْدٍ إِلَى النَّبِيِّ صلى الله عليه وسلم حِينَ وُلِدَ، فَوَضَعَهُ عَلَى فَخِذِهِ، وَأَبُو أُسَيْدٍ جَالِسٌ، فَلَهَى النَّبِيُّ صلى الله عليه وسلم بِشَيْءٍ بَيْنَ يَدَيْهِ، وَأَمَرَ أَبُو أُسَيْدٍ بِابْنِهِ فَاحْتُمِلَ مِنْ فَخِذِ النَّبِيِّ صلى الله عليه وسلم، فَاسْتَفَاقَ النَّبِيُّ صلى الله عليه وسلم فَقَالَ‏:‏ أَيْنَ الصَّبِيُّ‏؟‏ فَقَالَ أَبُو أُسَيْدٍ‏:‏ قَلَبْنَاهُ يَا رَسُولَ اللهِ، قَالَ‏:‏ مَا اسْمُهُ‏؟‏ قَالَ‏:‏ فُلاَنٌ، قَالَ‏:‏ لاَ، لَكِنِ اسْمُهُ الْمُنْذِرُ، فَسَمَّاهُ يَوْمَئِذٍ الْمُنْذِرَ‏.‏","english":{"narrator":"","text":"Sahl said, \"Al-Mundhir ibn Abi Usayd was brought to the Prophet,\nmay Allah bless him and grant him peace, when he was born and the Prophet\nplaced him on his thigh while Abu Usayd was seated near him. The Prophet,\nmay Allah bless him and grant him peace, was busy with something in front\nof him, so Abu Usayd told someone to take his son from the Prophet's leg.\nWhen the Prophet, may Allah bless him and grant him peace, became aware\nof it, he asked, 'Where is the child?' Abu Usayd replied, 'We sent him\nhome.' The Prophet asked, 'What is his name?' He replied, 'Such-and-such.'\nThe Prophet said, 'No, rather his name is al-Mundhir.' So we called him\nal-Mundhir from that day.\""}},{"id":7,"idInBook":7,"chapterId":34,"bookId":15,"arabic":"حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ‏:‏ حَدَّثَنَا شُعَيْبُ بْنُ أَبِي حَمْزَةَ، قَالَ‏:‏ حَدَّثَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ أَخْنَى الأسْمَاءِ عِنْدَ اللهِ رَجُلٌ تَسَمَّى مَلِكَ الأمْلاكِ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"The name which hates the most is that a\nman be called the King of Kings.\""}},{"id":8,"idInBook":8,"chapterId":34,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى، قَالَ‏:‏ حَدَّثَنَا الْقَاسِمُ بْنُ الْفَضْلِ، عَنْ سَعِيدِ بْنِ الْمُهَلَّبِ، عَنْ طَلْقِ بْنِ حَبِيبٍ قَالَ‏:‏ كُنْتُ أَشَدَّ النَّاسِ تَكْذِيبًا بِالشَّفَاعَةِ، فَسَأَلْتُ جَابِرًا، فَقَالَ‏:‏ يَا طُلَيْقُ، سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ‏:‏ يَخْرُجُونَ مِنَ النَّارِ بَعْدَ دُخُولٍ، وَنَحْنُ نَقْرَأُ الَّذِي تَقْرَأُ‏.‏","english":{"narrator":"","text":"Talq ibn Habib said, \"I was the most vehement person in denying\nintercession. I questioned Jabir and he said, 'Tulayq, I heard the Prophet,\nmay Allah bless him and grant him peace, say, \"They will come out of the\nFire after entering it,\" and we recite (the same Book) you recite.'\""}},{"id":9,"idInBook":9,"chapterId":34,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ عُثْمَانَ الْقُرَشِيُّ، قَالَ‏:‏ حَدَّثَنَا ذَيَّالُ بْنُ عُبَيْدِ بْنِ حَنْظَلَةَ قَالَ‏:‏ حَدَّثَنِي جَدِّي حَنْظَلَةُ بْنُ حِذْيَمَ قَالَ‏:‏ كَانَ النَّبِيُّ صلى الله عليه وسلم يُعْجِبُهُ أَنْ يُدْعَى الرَّجُلُ بِأَحَبِّ أَسْمَائِهِ إِلَيْهِ، وَأَحَبِّ كُنَاهُ‏.‏","english":{"narrator":"","text":"Hanzala ibn Hidhaym said, \"The Prophet, may Allah bless him and\ngrant him peace, used to like to call a man by the name that he liked best\nand by his favourite kunya.\""}},{"id":10,"idInBook":10,"chapterId":34,"bookId":15,"arabic":"حَدَّثَنَا صَدَقَةُ بْنُ الْفَضْلِ، قَالَ‏:‏ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ، عَنْ عُبَيْدِ اللهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ غَيْرَ اسْمَ عَاصِيَةَ وَقَالَ‏:‏ أَنْتِ جَمِيلَةُ‏.‏","english":{"narrator":"","text":"Ibn 'Umar said that the Prophet, may Allah bless him and grant\nhim peace, changed a woman's name from 'Asiya (rebellious), saying, \"You\nare Jamila (beautiful).\""}},{"id":11,"idInBook":11,"chapterId":34,"bookId":15,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللهِ، وَسَعِيدُ بْنُ مُحَمَّدٍ، قَالاَ‏:‏ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، قَالَ‏:‏ حَدَّثَنَا أَبِي، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ قَالَ‏:‏ حَدَّثَنِي مُحَمَّدُ بْنُ عَمْرِو بْنِ عَطَاءٍ، أَنَّهُ دَخَلَ عَلَى زَيْنَبَ بِنْتِ أَبِي سَلَمَةَ، فَسَأَلَتْهُ عَنِ اسْمِ أُخْتٍ لَهُ عِنْدَهُ‏؟‏ قَالَ‏:‏ فَقُلْتُ‏:‏ اسْمُهَا بَرَّةُ، قَالَتْ‏:‏ غَيِّرِ اسْمَهَا، فَإِنَّ النَّبِيَّ صلى الله عليه وسلم نَكَحَ زَيْنَبَ بِنْتَ جَحْشٍ وَاسْمُهَا بَرَّةُ، فَغَيَّرَ اسْمَهَا إِلَى زَيْنَبَ، وَدَخَلَ عَلَى أُمِّ سَلَمَةَ حِينَ تَزَوَّجَهَا، وَاسْمِي بَرَّةُ، فَسَمِعَهَا تَدْعُونِي‏:‏ بَرَّةَ، فَقَالَ‏:‏ لاَ تُزَكُّوا أَنْفُسَكُمْ، فَإِنَّ اللَّهَ هُوَ أَعْلَمُ بِالْبَرَّةِ مِنْكُنَّ وَالْفَاجِرَةِ، سَمِّيهَا زَيْنَبَ، فَقَالَتْ‏:‏ فَهِيَ زَيْنَبُ، فَقُلْتُ لَهَا‏:‏ سَمِّي، فَقَالَتْ‏:‏ غَيِّرْهُ إِلَى مَا غَيَّرَ إِلَيْهِ رَسُولُ اللهِ صلى الله عليه وسلم، فَسَمِّهَا زَيْنَبَ‏.‏","english":{"narrator":"Muhammad ibn 'Ata' related that he visited Zaynab bint Salama and\nshe asked him about the name of one of his sisters. He reports:","text":"\"I said,\n'Her name is Barra.' She said, 'Change her name. The Prophet, may Allah\nbless him and grant him peace, married Zaynab bint Jahsh. Her name was\nBarra and he changed it to Zaynab. I visited Umm Salama when she married\nhim and my name was Barra. He heard her call me Barra and said, 'Do not\nadorn yourselves. Allah is the One who knows those who are pious (barra)\namong you and those who are deviant. Call her Zaynab.' Umm Salama said,\n'She is Zaynab.' I said to Zaynab, 'Give her a name.' Zaynab said, 'Change\nit to what the Messenger of Allah, may Allah bless him and grant him peace,\nchanged it.'\" So he called her Zaynab."}},{"id":12,"idInBook":12,"chapterId":34,"bookId":15,"arabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، قَالَ‏:‏ حَدَّثَنَا زَيْدُ بْنُ حُبَابٍ قَالَ‏:‏ حَدَّثَنِي عُمَرُ بْنُ عُثْمَانَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ سَعِيدٍ الْمَخْزُومِيُّ، حَدَّثَنِي جَدِّي، عَنْ أَبِيهِ، وَكَانَ اسْمُهُ الصَّرْمَ، فَسَمَّاهُ النَّبِيُّ صلى الله عليه وسلم سَعِيدًا، قَالَ‏:‏ رَأَيْتُ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ مُتَّكِئًا فِي الْمَسْجِدِ‏.‏","english":{"narrator":"","text":"Ibn 'Abdu'r-Rahman ibn Sa'id al-Makhzumi, whose name was as-Surm,\nreported that the Messenger of Allah, may Allah bless him and grant him\npeace, named him Sa'id (happy). He related that he had seen 'Uthman reclining\nin the mosque."}},{"id":13,"idInBook":13,"chapterId":34,"bookId":15,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، عَنْ إِسْرَائِيلَ، عَنْ أَبِي إِسْحَاقَ، عَنْ هَانِئِ بْنِ هَانِئٍ، عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ‏:‏ لَمَّا وُلِدَ الْحَسَنُ رَضِيَ اللَّهُ عَنْهُ سَمَّيْتُهُ‏:‏ حَرْبًا، فَجَاءَ النَّبِيُّ صلى الله عليه وسلم فَقَالَ‏:‏ أَرُونِي ابْنِي، مَا سَمَّيْتُمُوهُ‏؟‏ قُلْنَا‏:‏ حَرْبًا، قَالَ‏:‏ بَلْ هُوَ حَسَنٌ‏.‏ فَلَمَّا وُلِدَ الْحُسَيْنُ رَضِيَ اللَّهُ عَنْهُ سَمَّيْتُهُ حَرْبًا، فَجَاءَ النَّبِيُّ صلى الله عليه وسلم فَقَالَ‏:‏ أَرُونِي ابْنِي، مَا سَمَّيْتُمُوهُ‏؟‏ قُلْنَا‏:‏ حَرْبًا، قَالَ‏:‏ بَلْ هُوَ حُسَيْنٌ‏.‏ فَلَمَّا وُلِدَ الثَّالِثُ سَمَّيْتُهُ‏:‏ حَرْبًا، فَجَاءَ النَّبِيُّ صلى الله عليه وسلم فَقَالَ‏:‏ أَرُونِي ابْنِي، مَا سَمَّيْتُمُوهُ‏؟‏ قُلْنَا‏:‏ حَرْبًا، قَالَ‏:‏ بَلْ هُوَ مُحْسِنٌ، ثُمَّ قَالَ‏:‏ إِنِّي سَمَّيْتُهُمْ بِأَسْمَاءِ وَلَدِ هَارُونَ‏:‏ شِبْرٌ، وَشَبِيرٌ، وَمُشَبِّرٌ‏.‏","english":{"narrator":"'Ali said, \"When al-Husayn was born, I named him Harb (war). The\nProphet came and said, 'Show me your son. What have you named him?' 'Harb,'\nwe replied. He said, \"He is Hasan.' When al-Husayn was born, I named him\nHarb. The Prophet, may Allah bless him and grant him peace, came and said,\n'Show me your son. What have you named him?' 'Harb,' we replied. He said,\n\"He is Husayn.' When we had a third son, I named him Harb. The Prophet,\nmay Allah bless him and grant him peace, came and said, 'Show me your son.\nWhat have you named him?' 'Harb,' we replied. He said, \"He is Muhassin.\"\nThen he said, 'I have named them according to the names of the sons of\nHarun:","text":"Shabr, Shubayr, and Mushabbir.'\""}},{"id":14,"idInBook":14,"chapterId":34,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سِنَانٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ اللهِ بْنُ الْحَارِثِ بْنِ أَبْزَى قَالَ‏:‏ حَدَّثَتْنِي أُمِّي رَائِطَةُ بِنْتُ مُسْلِمٍ، عَنْ أَبِيهَا قَالَ‏:‏ شَهِدْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم حُنَيْنًا، فَقَالَ لِي‏:‏ مَا اسْمُكَ‏؟‏ قُلْتُ‏:‏ غُرَابٌ، قَالَ‏:‏ لا، بَلِ اسْمُكَ مُسْلِمٌ‏.‏","english":{"narrator":"","text":"It is reported that al-Harith ibn Abza said, \"I was present at\nHunayn with the Prophet, may Allah bless him and grant him peace, and he\nasked me, 'What is your name?' 'Ghurab,' I replied. He said, 'No, your\nname is Muslim.'\""}},{"id":15,"idInBook":15,"chapterId":34,"bookId":15,"arabic":"حَدَّثَنَا عَمْرُو بْنُ مَرْزُوقٍ، قَالَ‏:‏ حَدَّثَنَا عِمْرَانُ الْقَطَّانُ، عَنْ قَتَادَةَ، عَنْ زُرَارَةَ بْنِ أَوْفَى، عَنْ سَعْدِ بْنِ هِشَامٍ، عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا، ذُكِرَ عِنْدَ رَسُولِ اللهِ صلى الله عليه وسلم رَجُلٌ يُقَالُ لَهُ‏:‏ شِهَابٌ، فَقَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ بَلْ أَنْتَ هِشَامٌ‏.‏","english":{"narrator":"","text":"'A'isha said, \"A man called Shihab (flame) was mentioned in the\npresence of the Messenger of Allah, may Allah bless him and grant him peace.\nThe Messenger of Allah, may Allah bless him and grant him peace, said,\n'Rather you are Hisham.'\""}},{"id":16,"idInBook":16,"chapterId":34,"bookId":15,"arabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ‏:‏ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ زَكَرِيَّا قَالَ‏:‏ حَدَّثَنِي عَامِرٌ، عَنْ عَبْدِ اللهِ بْنِ مُطِيعٍ قَالَ‏:‏ سَمِعْتُ مُطِيعًا يَقُولُ‏:‏ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ، يَوْمَ فَتْحِ مَكَّةَ‏:‏ لاَ يُقْتَلُ قُرَشِيٌّ صَبْرًا بَعْدَ الْيَوْمِ إِلَى يَوْمِ الْقِيَامَةِ، فَلَمْ يُدْرِكِ الإِسْلاَمَ أَحَدٌ مِنْ عُصَاةِ قُرَيْشٍ غَيْرُ مُطِيعٍ، كَانَ اسْمُهُ الْعَاصَ فَسَمَّاهُ النَّبِيُّ صلى الله عليه وسلم مُطِيعًا‏.‏","english":{"narrator":"","text":"Muti' said, \"I heard the Prophet, may Allah bless him and grant\nhim peace, say on the day of the Conquest of Makka, 'No Qurayshi will be\nkilled in custody from today until the Day of Rising.'\" None of the rebels\nof Quraysh except Muti' became Muslim. His name had been al-'As and the\nProphet, may Allah bless him and grant him peace, renamed him Muti' (obedient)."}},{"id":17,"idInBook":17,"chapterId":34,"bookId":15,"arabic":"حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ‏:‏ حَدَّثَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ قَالَ‏:‏ حَدَّثَنِي أَبُو سَلَمَةَ، أَنَّ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ يَا عَائِشُ، هَذَا جِبْرِيلُ يَقْرَأُ عَلَيْكِ السَّلاَمَ، قَالَتْ‏:‏ وَعَلَيْهِ السَّلاَمُ وَرَحْمَةُ اللهِ وَبَرَكَاتُهُ، قَالَتْ‏:‏ وَهُوَ يَرَى مَا لا أَرَى‏.‏","english":{"narrator":"","text":"'A'isha said that the Messenger of Allah, may Allah bless him and\ngrant him peace, said, \"'A'ish! Jibril sends you greetings.\" She said,\n\"And peace be upon him and the mercy of Allah.\" She remarked, \"He sees\nwhat I do not see.\""}},{"id":18,"idInBook":18,"chapterId":34,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عُقْبَةَ، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ إِبْرَاهِيمَ الْيَشْكُرِيُّ الْبَصْرِيُّ قَالَ‏:‏ حَدَّثَتْنِي جَدَّتِي أُمُّ كُلْثُومٍ بِنْتُ ثُمَامَةَ، أَنَّهَا قَدِمَتْ حَاجَّةً، فَإِنَّ أَخَاهَا الْمُخَارِقَ بْنَ ثُمَامَةَ قَالَ‏:‏ ادْخُلِي عَلَى عَائِشَةَ، وَسَلِيهَا عَنْ عُثْمَانَ بْنِ عَفَّانَ، فَإِنَّ النَّاسَ قَدْ أَكْثَرُوا فِيهِ عِنْدَنَا، قَالَتْ‏:‏ فَدَخَلْتُ عَلَيْهَا فَقُلْتُ‏:‏ بَعْضُ بَنِيكِ يُقْرِئُكِ السَّلاَمَ، وَيَسْأَلُكِ عَنْ عُثْمَانَ بْنِ عَفَّانَ، قَالَتْ‏:‏ وَعَلَيْهِ السَّلاَمُ وَرَحْمَةُ اللهِ، قَالَتْ‏:‏ أَمَّا أَنَا فَأَشْهَدُ عَلَى أَنِّي رَأَيْتُ عُثْمَانَ فِي هَذَا الْبَيْتِ فِي لَيْلَةٍ قَائِظَةٍ، وَنَبِيُّ اللهِ صلى الله عليه وسلم وَجِبْرِيلُ يُوحِي إِلَيْهِ، وَالنَّبِيُّ صلى الله عليه وسلم يَضْرِبُ كَفَّ، أَوْ كَتِفَ، ابْنِ عَفَّانَ بِيَدِهِ‏:‏ اكْتُبْ، عُثْمُ، فَمَا كَانَ اللَّهُ يُنْزِلُ تِلْكَ الْمَنْزِلَةَ مِنْ نَبِيِّهِ صلى الله عليه وسلم إِلاَّ رَجُلاً عَلَيْهِ كَرِيمًا، فَمَنْ سَبَّ ابْنَ عَفَّانَ فَعَلَيْهِ لَعْنَةُ اللهِ‏.‏","english":{"narrator":"","text":"Umm Kulthum, the daughter of Thumama, related that she went out\nto answer a call of nature,. Her brother, al-Makhariq ibn Thumama, said,\n\"Go to 'A'isha and ask her about 'Uthman ibn 'Affan. People have said a\nlot about him. She said, \"I went to her and said, 'One of your brothers\nsends you greetings and asks you about 'Uthman ibn 'Affan.' 'A'isha said,\n'Peace be upon and the mercy of Allah.' 'A'isha then went on, 'I testify\nthat I saw 'Uthman in this house one hot night when the Prophet, may Allah\nbless him and grant him peace, had received revelation through Jibril.\nThe Prophet, may Allah bless him and grant him peace, struck the palm -\nor held the hand - of Ibn 'Affan, saying, 'Write, 'Uthma! Allah has\nplaced in this house with His Prophet, may Allah bless him and grant him\npeace, only a man who is honoured with Him. If anyone curses Ibn 'Affan,\nthe curse of Allah is on him.'\""}},{"id":19,"idInBook":19,"chapterId":34,"bookId":15,"arabic":"حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، قَالَ‏:‏ حَدَّثَنَا الأَسْوَدُ بْنُ شَيْبَانَ، قَالَ‏:‏ حَدَّثَنَا خَالِدُ بْنُ سُمَيْرٍ قَالَ‏:‏ حَدَّثَنِي بَشِيرُ بْنُ نَهِيكٍ، قَالَ‏:‏ حَدَّثَنَا بَشِيرٌ قَالَ‏:‏ أَتَى النَّبِيَّ صلى الله عليه وسلم، فَقَالَ‏:‏ مَا اسْمُكَ‏؟‏ قَالَ‏:‏ زَحْمٌ، قَالَ‏:‏ بَلْ أَنْتَ بَشِيرٌ، فَبَيْنَمَا أَنَا أُمَاشِي النَّبِيَّ صلى الله عليه وسلم، فَقَالَ‏:‏ يَا ابْنَ الْخَصَاصِيَةِ، مَا أَصْبَحْتَ تَنْقِمُ عَلَى اللهِ‏؟‏ أَصْبَحْتَ تُمَاشِي رَسُولَ اللهِ صلى الله عليه وسلم، قُلْتُ‏:‏ بِأَبِي وَأُمِّي، مَا أَنْقِمُ عَلَى اللهِ شَيْئًا، كُلَّ خَيْرٍ قَدْ أَصَبْتُ‏.‏ فَأَتَى عَلَى قُبُورِ الْمُشْرِكِينَ فَقَالَ‏:‏ لَقَدْ سَبَقَ هَؤُلاَءِ خَيْرًا كَثِيرًا، ثُمَّ أَتَى عَلَى قُبُورِ الْمُسْلِمِينَ فَقَالَ‏:‏ لَقَدْ أَدْرَكَ هَؤُلاَءِ خَيْرًا كَثِيرًا، فَإِذَا رَجُلٌ عَلَيْهِ سِبْتِيَّتَانِ يَمْشِي بَيْنَ الْقُبُورِ، فَقَالَ‏:‏ يَا صَاحِبَ السِّبْتِيَّتَيْنِ، أَلْقِ سِبْتِيَّتَكَ، فَخَلَعَ نَعْلَيْهِ‏.‏","english":{"narrator":"","text":"Bashir ibn Nuhayk said, \"The Prophet, may Allah bless him and grant\nhim peace, came and said, 'What is your name?' 'Zahm,' I said. He said,\n'You are Bashir (bringer of good news).' While I was walking and keeping\npace with the Prophet, may Allah bless him and grant him peace, he said,\n'Ibn al-Khasasiyya! Are you resentful towards Allah? Do you keep pace with\nthe Messenger of Allah?' I said, 'May my mother and father be your ransom,\nI do not hold any resentment against Allah. I have every blessing.' The\nProphet came to the graves of the idolaters and said, 'These people have\nmissed a lot of good. Then he came to the graves of the Muslims and said,\n'These people have obtained much good.' There was a man wearing ox-hide\nsandals walking between the graves. The Prophet said, 'You with the ox-hide\nsandals! Remove your sandals!' So he removed his sandals.\""}},{"id":20,"idInBook":20,"chapterId":34,"bookId":15,"arabic":"حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، قَالَ‏:‏ حَدَّثَنَا عُبَيْدُ اللهِ بْنُ إِيَادٍ، عَنْ أَبِيهِ قَالَ‏:‏ سَمِعْتُ لَيْلَى امْرَأَةَ بَشِيرٍ تُحَدِّثُ، عَنْ بَشِيرِ ابْنِ الْخَصَاصِيَةِ، وَكَانَ اسْمُهُ زَحْمًا، فَسَمَّاهُ النَّبِيُّ صلى الله عليه وسلم بَشِيرًا‏.‏","english":{"narrator":"","text":"Part of previous hadith."}},{"id":21,"idInBook":21,"chapterId":34,"bookId":15,"arabic":"حَدَّثَنَا قَبِيصَةُ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ مَوْلَى آلِ طَلْحَةَ، عَنْ كُرَيْبٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ اسْمَ جُوَيْرِيَةَ كَانَ بَرَّةَ، فَسَمَّاهَا النَّبِيُّ صلى الله عليه وسلم جُوَيْرِيَةَ‏.‏","english":{"narrator":"","text":"Ibn 'Abbas said that Juwayriyya's name had been Barra and the Prophet,\nmay Allah bless him and grant him peace, had renamed her Juwayriyya."}},{"id":22,"idInBook":22,"chapterId":34,"bookId":15,"arabic":"حَدَّثَنَا عَمْرُو بْنُ مَرْزُوقٍ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، عَنْ عَطَاءِ بْنِ أَبِي مَيْمُونَةَ، عَنْ أَبِي رَافِعٍ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ كَانَ اسْمُ مَيْمُونَةَ بَرَّةَ، فَسَمَّاهَا النَّبِيُّ صلى الله عليه وسلم مَيْمُونَةَ‏.‏","english":{"narrator":"","text":"Abu Hurayra said, \"Maymuna's name was Barra and then the Prophet,\nmay Allah bless him and grant him peace, renamed her Maymuna.\""}},{"id":23,"idInBook":23,"chapterId":34,"bookId":15,"arabic":"حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، قَالَ‏:‏ حَدَّثَنَا أَبِي، قَالَ‏:‏ حَدَّثَنَا الأَعْمَشُ، قَالَ‏:‏ حَدَّثَنَا أَبُو سُفْيَانَ، عَنْ جَابِرٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ إِنْ عِشْتُ نَهَيْتُ أُمَّتِي، إِنْ شَاءَ اللَّهُ، أَنْ يُسَمِّي أَحَدُهُمْ بَرَكَةَ، وَنَافِعًا، وَأَفْلَحَ، وَلاَ أَدْرِي قَالَ‏:‏ رَافِعًا أَمْ لاَ‏؟‏، يُقَالُ‏:‏ هَا هُنَا بَرَكَةُ‏؟‏ فَيُقَالُ‏:‏ لَيْسَ هَا هُنَا، فَقُبِضَ النَّبِيُّ صلى الله عليه وسلم وَلَمْ يَنْهَ عَنْ ذَلِكَ‏.‏","english":{"narrator":"Jabir reported:","text":"\"The Prophet, may Allah bless him and grant him\npeace, said, 'If I will, I will prohibit my community, if Allah so wills,\nfrom any of them taking the name Baraka (blessing), Nafi' (Helper) or Aflah\n(Most Successful),' and I do not know if he said, Rafi' (one who elevates)\nor not. Someone asks, 'Is Baraka (blessing) here?' and is told, 'He (or\nit) is not here.' The Prophet, may Allah bless him and grant him peace,\ndied because he could forbid that (using those names).\""}},{"id":24,"idInBook":24,"chapterId":34,"bookId":15,"arabic":"حَدَّثَنَا الْمَكِّيُّ، قَالَ‏:‏ حَدَّثَنَا ابْنُ جُرَيْجٍ، عَنْ أَبِي الزُّبَيْرِ، سَمِعَ جَابِرَ بْنَ عَبْدِ اللهِ يَقُولُ‏:‏ أَرَادَ النَّبِيُّ صلى الله عليه وسلم أَنْ يَنْهَى أَنْ يُسَمَّى بِيَعْلَى، وَبِبَرَكَةَ، وَنَافِعٍ، وَيَسَارٍ، وَأَفْلَحَ، وَنَحْوَ ذَلِكَ، ثُمَّ سَكَتَ بَعْدُ عَنْهَا، فَلَمْ يَقُلْ شَيْئًا‏.‏","english":{"narrator":"","text":"Jabir ibn 'Abdullah said, \"The Prophet, may Allah bless him and\ngrant him peace, wanted to forbid people calling themselves Ya'la (to rise),\nBaraka (blessing), Nafi' (Helper), Yasar (good fortune), Aflah (most successful)\nand names like that. Then he was silent about that matter and did not say\nanything.\""}},{"id":25,"idInBook":25,"chapterId":34,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ‏:‏ حَدَّثَنَا عُمَرُ بْنُ يُونُسَ بْنِ الْقَاسِمِ، قَالَ‏:‏ حَدَّثَنَا عِكْرِمَةُ، عَنْ سِمَاكٍ أَبِي زُمَيْلٍ قَالَ‏:‏ حَدَّثَنِي عَبْدُ اللهِ بْنُ عَبَّاسٍ قَالَ‏:‏ حَدَّثَنِي عُمَرُ بْنُ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ قَالَ‏:‏ لَمَّا اعْتَزَلَ النَّبِيُّ صلى الله عليه وسلم نِسَاءَهُ، فَإِذَا أَنَا بِرَبَاحٍ غُلاَمِ رَسُولِ اللهِ صلى الله عليه وسلم، فَنَادَيْتُ‏:‏ يَا رَبَاحُ، اسْتَأْذِنْ لِي عَلَى رَسُولِ اللهِ صلى الله عليه وسلم‏.‏","english":{"narrator":"","text":"'Umar ibn al-Khattab said, \"When the Prophet, may Allah bless him\nand grant him peace, withdrew from his wives, I was with Rabah, the slave\nof the Messenger of Allah, may Allah bless him and grant him peace, and\nI called, 'Rabah, ask permission for me to come in to the Messenger of\nAllah, may Allah bless him and grant him peace.'\""}},{"id":26,"idInBook":26,"chapterId":34,"bookId":15,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ‏:‏ حَدَّثَنَا دَاوُدُ بْنُ قَيْسٍ قَالَ‏:‏ حَدَّثَنِي مُوسَى بْنُ يَسَارٍ‏:‏ سَمِعْتُ أَبَا هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ تَسَمُّوا بِاسْمِي، وَلاَ تُكَنُّوا بِكُنْيَتِي، فَإِنِّي أَنَا أَبُو الْقَاسِمِ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"Name yourselves with my name,\nbut do not use my kunya; I am Abu'l-Qasim.\""}},{"id":27,"idInBook":27,"chapterId":34,"bookId":15,"arabic":"حَدَّثَنَا آدَمُ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، عَنْ حُمَيْدٍ الطَّوِيلِ، عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ‏:‏ كَانَ النَّبِيُّ صلى الله عليه وسلم فِي السُّوقِ، فَقَالَ رَجُلٌ‏:‏ يَا أَبَا الْقَاسِمِ، فَالْتَفَتَ إِلَيْهِ النَّبِيُّ صلى الله عليه وسلم، فَقَالَ‏:‏ يَا رَسُولَ اللهِ، إِنَّمَا دَعَوْتُ هَذَا، فَقَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ سَمُّوا بِاسْمِي، وَلاَ تُكَنُّوا بِكُنْيَتِي‏.‏","english":{"narrator":"","text":"Anas ibn Malik said, \"The Prophet, may Allah bless him and grant\nhim peace, was in the market when a man said, 'Abu'l-Qasim!' The Prophet,\nmay Allah bless him and grant him peace, turned towards him. He said, 'Messenger\nof Allah, I was calling this man.' The Prophet, may Allah bless him and\ngrant him peace, said, 'Call yourselves with my name but do no use my kunya.'\""}},{"id":28,"idInBook":28,"chapterId":34,"bookId":15,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ‏:‏ حَدَّثَنَا يَحْيَى بْنُ أَبِي الْهَيْثَمِ الْقَطَّانُ قَالَ‏:‏ حَدَّثَنِي يُوسُفُ بْنُ عَبْدِ اللهِ بْنِ سَلاَّمٍ قَالَ‏:‏ سَمَّانِي النَّبِيُّ صلى الله عليه وسلم يُوسُفَ، وَأَقْعَدَنِي عَلَى حِجْرِهِ وَمَسَحَ عَلَى رَأْسِي‏.‏","english":{"narrator":"","text":"Yusuf ibn 'Abdullah ibn Sallam said, \"The Prophet, may Allah bless\nhim and grant him peace, named me Yusuf and let me sit in his room and\nstroked my head.\""}},{"id":29,"idInBook":29,"chapterId":34,"bookId":15,"arabic":"حَدَّثَنَا أَبُو الْوَلِيدِ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، عَنْ سُلَيْمَانَ، وَمَنْصُورٍ، وَفُلاَنٍ، سَمِعُوا سَالِمَ بْنَ أَبِي الْجَعْدِ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ، قَالَ‏:‏ وُلِدَ لِرَجُلٍ مِنَّا مِنَ الأَنْصَارِ غُلاَمٌ، وَأَرَادَ أَنْ يُسَمِّيَهُ مُحَمَّدًا، قَالَ شُعْبَةُ فِي حَدِيثِ مَنْصُورٍ‏:‏ إِنَّ الأَنْصَارِيَّ قَالَ‏:‏ حَمَلْتُهُ عَلَى عُنُقِي، فَأَتَيْتُ بِهِ النَّبِيَّ صلى الله عليه وسلم، وَفِي حَدِيثِ سُلَيْمَانَ‏:‏ وُلِدَ لَهُ غُلاَمٌ فَأَرَادُوا أَنْ يُسَمِّيَهُ مُحَمَّدًا، قَالَ‏:‏ تَسَمُّوا بِاسْمِي، وَلاَ تُكَنُّوا بِكُنْيَتِي، فَإِنِّي إِنَّمَا جُعِلْتُ قَاسِمًا، أَقْسِمُ بَيْنَكُمْ‏.‏ وَقَالَ حُصَيْنٌ‏:‏ بُعِثْتُ قَاسِمًا أَقْسِمُ بَيْنَكُمْ‏.‏","english":{"narrator":"Jabir ibn 'Abdullah said, \"One of our men among the Ansar had a\nson and wanted to call him Muhammad. The Ansari said, 'I put him on my\nshoulder and took him to the Messenger of Allah, may Allah bless him and grant him peace.\n[Another variant has:","text":"\"He had a son and they wanted to name him Muhammad.\"]\nThe Prophet said, 'Name yourselves with my name but do not use my kunya.\nI have been made the distributor (Qasim) to divide things between you.'\""}},{"id":30,"idInBook":30,"chapterId":34,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، قَالَ‏:‏ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدَ بْنِ عَبْدِ اللهِ بْنِ أَبِي بُرْدَةَ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى قَالَ‏:‏ وُلِدَ لِي غُلاَمٌ، فَأَتَيْتُ بِهِ النَّبِيَّ صلى الله عليه وسلم، فَسَمَّاهُ إِبْرَاهِيمَ، فَحَنَّكَهُ بِتَمْرَةٍ، وَدَعَا لَهُ بِالْبَرَكَةِ، وَدَفَعَهُ إِلَيَّ وَكَانَ أَكْبَرَ وَلَدِ أَبِي مُوسَى‏.‏","english":{"narrator":"","text":"Abu Musa said, \"I had a son and I brought him to the Prophet, may\nAllah bless him and grant him peace, and he named him Ibrahim. He chewed\nup a date and gave it to him and made supplication for him to be blessed\nand then gave him back to me.\" He was Abu Musa's oldest son."}},{"id":31,"idInBook":31,"chapterId":34,"bookId":15,"arabic":"حَدَّثَنَا عَلِيٌّ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَ‏:‏ أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّهُ أَتَى النَّبِيَّ صلى الله عليه وسلم فَقَالَ‏:‏ مَا اسْمُكَ‏؟‏ قَالَ‏:‏ حَزْنٌ، قَالَ‏:‏ أَنْتَ سَهْلٌ، قَالَ‏:‏ لاَ أُغَيِّرُ اسْمًا سَمَّانِيهِ أَبِي‏.‏ قَالَ ابْنُ الْمُسَيِّبِ‏:‏ فَمَا زَالَتِ الْحُزُونَةُ فِينَا بَعْدُ‏.‏","english":{"narrator":"","text":"Sa'id ibn al-Musayyab reported that his grandfather went to the\nProphet, may Allah bless him and grant him peace. He asked, \"What is your\nname?\" \"Hazn (rough),\" he replied. The Prophet said, \"You are Sahl (easy).\"\nHe said, \"I will not change a name which my father gave me.\" Ibn al-Musayyab\nsaid, \"Roughness (hazuna) remained among us afterwards.\""}}],"chapter":{"id":34,"bookId":15,"arabic":"كتاب الأسْمَاءِ","english":"Names"}}