{"metadata":{"length":14,"arabic":{"title":"الأدب المفرد","author":"الإمام محمد بن إسماعيل البخاري","introduction":"كتاب  الكُنْيَةِ"},"english":{"title":"Al-Adab Al-Mufrad","author":"Imam Muhammad ibn Ismail al-Bukhari","introduction":"Kunyas"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":35,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ جَابِرٍ قَالَ‏:‏ وُلِدَ لِرَجُلٍ مِنَّا غُلاَمٌ فَسَمَّاهُ الْقَاسِمَ، فَقَالَتِ الأَنْصَارُ‏:‏ لاَ نُكَنِّيكَ أَبَا الْقَاسِمِ، وَلاَ نُنْعِمُكَ عَيْنًا، فَأَتَى النَّبِيَّ صلى الله عليه وسلم فَقَالَ لَهُ‏:‏ مَا قَالَتِ الأَنْصَارُ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ أَحْسَنَتِ الأَنْصَارُ، تَسَمُّوا بِاسْمِي، وَلاَ تَكْتَنُوا بِكُنْيَتِي، فَإِنَّمَا أَنَا قَاسِمٌ‏.‏","english":{"narrator":"","text":"Jabir said, \"One of our men had a son and named him al-Qasim. The\nAnsar said, \"We will not give you the kunya of Abu'l-Qasim to make you\nhappy.' He went to the Prophet, may Allah bless him and grant him peace,\nand told him what the Ansar had said. The Prophet, may Allah bless him\nand grant him peace, said, 'The Ansar did well. Call yourselves with my\nname but do not use my kunya. I am Qasim (the divider).\""}},{"id":2,"idInBook":2,"chapterId":35,"bookId":15,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ‏:‏ حَدَّثَنَا فِطْرٌ، عَنْ مُنْذِرٍ قَالَ‏:‏ سَمِعْتُ ابْنَ الْحَنَفِيَّةِ يَقُولُ‏:‏ كَانَتْ رُخْصَةً لِعَلِيٍّ، قَالَ‏:‏ يَا رَسُولَ اللهِ، إِنْ وُلِدَ لِي بَعْدَكَ أُسَمِّيهِ بِاسْمِكَ، وَأُكَنِّيهِ بِكُنْيَتِكَ‏؟‏ قَالَ‏:‏ نَعَمْ‏.‏","english":{"narrator":"","text":"Ibn al-Hanafiyya was heard to say, \"There was an allowance made\nfor 'Ali. He asked, 'Messenger of Allah, if I have a son after you can\nI name him with your name and use your kunya?' Yes,' he replied.\""}},{"id":3,"idInBook":3,"chapterId":35,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ يُوسُفَ، قَالَ‏:‏ حَدَّثَنَا اللَّيْثُ قَالَ‏:‏ حَدَّثَنِي ابْنُ عَجْلاَنَ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ نَهَى رَسُولُ اللهِ صلى الله عليه وسلم أَنْ نَجْمَعَ بَيْنَ اسْمِهِ وَكُنْيَتِهِ، وَقَالَ‏:‏ أَنَا أَبُو الْقَاسِمِ، وَاللَّهُ يُعْطِي، وَأَنَا أَقْسِمُ‏.‏","english":{"narrator":"","text":"Abu Hurayra said, \"The Messenger of Allah, may Allah bless him\nand grant him peace, forbade for someone to have both his name and his\nkunya. He said, 'I am Abu'l-Qasim. Allah gives and I distribute.'\""}},{"id":4,"idInBook":4,"chapterId":35,"bookId":15,"arabic":"حَدَّثَنَا أَبُو عُمَرَ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ قَالَ‏:‏ كَانَ النَّبِيُّ صلى الله عليه وسلم فِي السُّوقِ، فَقَالَ رَجُلٌ‏:‏ يَا أَبَا الْقَاسِمِ، فَالْتَفَتَ النَّبِيُّ صلى الله عليه وسلم، فَقَالَ‏:‏ دَعَوْتُ هَذَا، فَقَالَ‏:‏ سَمُّوا بِاسْمِي، وَلاَ تُكَنُّوا بِكُنْيَتِي‏.‏","english":{"narrator":"","text":"See hadith 837."}},{"id":5,"idInBook":5,"chapterId":35,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ صَالِحٍ قَالَ‏:‏ حَدَّثَنِي اللَّيْثُ قَالَ‏:‏ حَدَّثَنِي عَقِيلٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، أَنَّ أُسَامَةَ بْنَ زَيْدٍ أَخْبَرَهُ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم بَلَغَ مَجْلِسًا فِيهِ عَبْدُ اللهِ بْنُ أُبَيِّ بْنُ سَلُولٍ، وَذَلِكَ قَبْلَ أَنْ يُسْلِمَ عَبْدُ اللهِ بْنُ أُبَيٍّ، فَقَالَ‏:‏ لاَ تُؤْذِينَا فِي مَجْلِسِنَا، فَدَخَلَ النَّبِيُّ صلى الله عليه وسلم عَلَى سَعْدِ بْنِ عُبَادَةَ فَقَالَ‏:‏ أَيْ سَعْدُ، أَلاَ تَسْمَعُ مَا يَقُولُ أَبُو حُبَابٍ‏؟‏، يُرِيدُ عَبْدَ اللهِ بْنَ أُبَيٍّ ابْنَ سَلُولٍ‏.‏","english":{"narrator":"","text":"Usama ibn Zayd reported that the Messenger of Allah, may Allah\nbless him and grant him peace, arrived at a gathering which included 'Abdullah\nibn Ubayy ibn Salul before 'Abdullah ibn Ubayy had become Muslim. He said,\n\"Do not bother us in our gathering.\" The Prophet, may Allah bless him and\ngrant him peace, went to Sa'd ibn 'Ubada and said, \"Sa'd, did you not hear\nwhat Abu Hubab said?\" He meant 'Abdullah ibn Ubayy ibn Salul."}},{"id":6,"idInBook":6,"chapterId":35,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ‏:‏ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ قَالَ‏:‏ كَانَ النَّبِيُّ صلى الله عليه وسلم يَدْخُلُ عَلَيْنَا، وَلِي أَخٌ صَغِيرٌ يُكَنَّى‏:‏ أَبَا عُمَيْرٍ، وَكَانَ لَهُ نُغَرٌ يَلْعَبُ بِهِ فَمَاتَ، فَدَخَلَ النَّبِيُّ صلى الله عليه وسلم فَرَآهُ حَزِينًا، فَقَالَ‏:‏ مَا شَأْنُهُ‏؟‏ قِيلَ لَهُ‏:‏ مَاتَ نُغَرُهُ، فَقَالَ‏:‏ يَا أَبَا عُمَيْرٍ، مَا فَعَلَ النُّغَيْرُ‏؟‏‏.‏","english":{"narrator":"","text":"Anas said, \"The Prophet, may Allah bless him and grant him peace,\nvisited us. I had a young brother who used the kunya of Abu 'Umayr. He\nhad a sparrow which he used to play with it and it had died. The Prophet,\nmay Allah bless him and grant him peace, came it and saw that he was sad.\nHe asked, 'What is wrong with him?' He was told, 'His sparrow has died.'\nThe Prophet said, 'Abu 'Umayr, what has happened to the little sparrow?'\""}},{"id":7,"idInBook":7,"chapterId":35,"bookId":15,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنْ مُغِيرَةَ، عَنْ إِبْرَاهِيمَ، أَنَّ عَبْدَ اللهِ كَنَّى عَلْقَمَةَ‏:‏ أَبَا شِبْلٍ، وَلَمْ يُولَدْ لَهُ‏.‏","english":{"narrator":"","text":"'Abdullah gave 'Alqama the kunya Abu Shibl when he had no children."}},{"id":8,"idInBook":8,"chapterId":35,"bookId":15,"arabic":"حَدَّثَنَا عَارِمٌ، قَالَ‏:‏ حَدَّثَنَا سُلَيْمَانُ الأَعْمَشُ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ قَالَ‏:‏ كَنَّانِي عَبْدُ اللهِ قَبْلَ أَنْ يُولَدَ لِي‏.‏","english":{"narrator":"","text":"'Alqama said, \"'Abdullah gave me a kunya before I had a child.\""}},{"id":9,"idInBook":9,"chapterId":35,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلامٍ، قَالَ‏:‏ حَدَّثَنَا أَبُو مُعَاوِيَةَ، قَالَ‏:‏ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ يَحْيَى بْنِ عَبَّادِ بْنِ حَمْزَةَ، عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ‏:‏ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فَقُلْتُ‏:‏ يَا رَسُولَ اللهِ، كَنَّيْتَ نِسَاءَكَ، فَاكْنِنِي، فَقَالَ‏:‏ تَكَنِّي بِابْنِ أُخْتِكِ عَبْدِ اللهِ‏.‏","english":{"narrator":"","text":"'A'isha said, \"I went to the Prophet, may Allah bless him and grant\nhim peace, and said, 'Messenger of Allah, you give your wives kunyas, so\ngive me a kunya.' He said, 'Take the kunya of your nephew, 'Abdullah.'\""}},{"id":10,"idInBook":10,"chapterId":35,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى، قَالَ‏:‏ حَدَّثَنَا وُهَيْبٌ، قَالَ‏:‏ حَدَّثَنَا هِشَامٌ، عَنْ عَبَّادِ بْنِ حَمْزَةَ بْنِ عَبْدِ اللهِ بْنِ الزُّبَيْرِ، أَنَّ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ‏:‏ يَا نَبِيَّ اللهِ، أَلاَ تُكَنِّينِي‏؟‏ فَقَالَ‏:‏ اكْتَنِي بِابْنِكِ، يَعْنِي‏:‏ عَبْدَ اللهِ بْنَ الزُّبَيْرِ، فَكَانَتْ تُكَنَّى‏:‏ أُمَّ عَبْدِ اللهِ‏.‏","english":{"narrator":"","text":"'A'isha said, \"Prophet of Allah, will you not give me a kunya?\"\nHe said, \"Use the kunya of your son,\" i.e. 'Abdullah ibn az-Zubayr. She\nwas given the kunya Umm 'Abdullah."}},{"id":11,"idInBook":11,"chapterId":35,"bookId":15,"arabic":"حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، قَالَ‏:‏ حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ قَالَ‏:‏ حَدَّثَنِي أَبُو حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، إِنْ كَانَتْ أَحَبَّ أَسْمَاءِ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ إِلَيْهِ لَأَبُو تُرَابٍ، وَإِنْ كَانَ لَيَفْرَحُ أَنْ يُدْعَى بِهَا، وَمَا سَمَّاهُ أَبَا تُرَابٍ إِلاَّ النَّبِيُّ صلى الله عليه وسلم، غَاضَبَ يَوْمًا فَاطِمَةَ، فَخَرَجَ فَاضْطَجَعَ إِلَى الْجِدَارِ إِلَى الْمَسْجِدِ، وَجَاءَهُ النَّبِيُّ صلى الله عليه وسلم يَتْبَعُهُ، فَقَالَ‏:‏ هُوَ ذَا مُضْطَجِعٌ فِي الْجِدَارِ، فَجَاءَ النَّبِيَّ صلى الله عليه وسلم وَقَدِ امْتَلَأَ ظَهْرُهُ تُرَابًا، فَجَعَلَ النَّبِيُّ صلى الله عليه وسلم يَمْسَحُ التُّرَابَ عَنْ ظَهْرِهِ وَيَقُولُ‏:‏ اجْلِسْ أَبَا تُرَابٍ‏.‏","english":{"narrator":"","text":"Sahl ibn Sa'd related that the name which 'Ali, may Allah be pleased\nwith him, liked best was Abu Turab and that he was happy when he was called\nthat. Only the Prophet, may Allah bless him and grant him peace, called\nhim that. One day 'Ali was cross with Fatima and went out and reclined\nagainst the wall of the mosque. The Prophet, may Allah bless him and grant\nhim peace, came to look for him and was told that he was leaning against\nthe wall. The Prophet, may Allah bless him and grant him peace, went up\nto him and found that his back was covered with dust. The Prophet, may\nAllah bless him and grant him peace, began to wipe the dust off his back\nand said, 'Sit down Abu Turab (father of dust)!'\""}},{"id":12,"idInBook":12,"chapterId":35,"bookId":15,"arabic":"حَدَّثَنَا أَبُو مَعْمَرٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْوَارِثِ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْعَزِيزِ، عَنْ أَنَسٍ قَالَ‏:‏ بَيْنَمَا النَّبِيُّ صلى الله عليه وسلم فِي نَخْلٍ لَنَا، نَخْلٍ لأَبِي طَلْحَةَ، تَبَرَّزَ لِحَاجَتِهِ، وَبِلاَلٌ يَمْشِي وَرَاءَهُ، يُكْرِمُ النَّبِيَّ صلى الله عليه وسلم أَنْ يَمْشِيَ إِلَى جَنْبِهِ، فَمَرَّ النَّبِيُّ صلى الله عليه وسلم بِقَبْرٍ فَقَامَ، حَتَّى تَمَّ إِلَيْهِ بِلاَلٌ، فَقَالَ‏:‏ وَيْحَكَ يَا بِلاَلُ، هَلْ تَسْمَعُ مَا أَسْمَعُ‏؟‏ قَالَ‏:‏ مَا أَسْمَعُ شَيْئًا، فَقَالَ‏:‏ صَاحِبُ هَذَا الْقَبْرِ يُعَذَّبُ، فَوُجِدَ يَهُودِيًّا‏.‏","english":{"narrator":"","text":"Anas said, \"While the Prophet, may Allah bless him and grant him\npeace, was in one of our palm groves where the trees belonged to Abu Talha,\nhe went out to answer a call of nature. Bilal was walking behind him. The\nProphet, may Allah bless him and grant him peace, honoured him by asking\nhim to walk at his side. The Prophet, may Allah bless him and grant him\npeace, passed by a grave and stood there until Bilal reached him. he said,\n'Woe to you, Bilal. Did you hear what I heard?' He replied, 'I did not\nhear anything.' He said, 'The man in the grave is being punished.' He found\nthat it was a Jew.\""}},{"id":13,"idInBook":13,"chapterId":35,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنْ إِسْمَاعِيلَ، عَنْ قَيْسٍ قَالَ‏:‏ سَمِعْتُ مُعَاوِيَةَ يَقُولُ لأَخٍ لَهُ صَغِيرٍ‏:‏ أَرْدِفِ الْغُلاَمَ، فَأَبَى، فَقَالَ لَهُ مُعَاوِيَةُ‏:‏ بِئْسَ مَا أُدِّبْتَ، قَالَ قَيْسٌ‏:‏ فَسَمِعْتُ أَبَا سُفْيَانَ يَقُولُ‏:‏ دَعْ عَنْكَ أَخَاكَ‏.‏","english":{"narrator":"","text":"Qays said, \"I heard Mu'awiya say to a young brother of his, 'Mount\nyour slave behind you.' He refused. Mu'awiya said to him, 'How badly you\nhave been taught!' I heard Abu Sufyan say, 'leave your brother alone.'\""}},{"id":14,"idInBook":14,"chapterId":35,"bookId":15,"arabic":"حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ قَالَ‏:‏ حَدَّثَنِي يَحْيَى بْنُ أَيُّوبَ، عَنْ مُوسَى بْنِ عَلِيٍّ، عَنْ أَبِيهِ، عَنْ عَمْرِو بْنِ الْعَاصِ قَالَ‏:‏ إِذَا كَثُرَ الأَخِلاَّءُ كَثُرَ الْغُرَمَاءُ، قُلْتُ لِمُوسَى‏:‏ وَمَا الْغُرَمَاءُ‏؟‏ قَالَ‏:‏ الْحُقُوقُ‏.‏","english":{"narrator":"","text":"Musa ibn 'Ali reported from his father that 'Amr ibn al-'As said,\n\"When you have a lot of close friends, you have a lot of creditors.\" The\ntransmitter asked Musa, \"What are creditors?\" \"Rights owed,\" he replied."}}],"chapter":{"id":35,"bookId":15,"arabic":"كتاب  الكُنْيَةِ","english":"Kunyas"}}