{"metadata":{"length":19,"arabic":{"title":"الأدب المفرد","author":"الإمام محمد بن إسماعيل البخاري","introduction":"كتاب الشِّعْرِ"},"english":{"title":"Al-Adab Al-Mufrad","author":"Imam Muhammad ibn Ismail al-Bukhari","introduction":"Poetry"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":36,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا أَبُو عَامِرٍ، قَالَ‏:‏ حَدَّثَنَا أَيُّوبُ بْنُ ثَابِتٍ، عَنْ خَالِدٍ هُوَ ابْنُ كَيْسَانَ قَالَ‏:‏ كُنْتُ عِنْدَ ابْنِ عُمَرَ، فَوَقَفَ عَلَيْهِ إِيَاسُ بْنُ خَيْثَمَةَ قَالَ‏:‏ أَلاَ أُنْشِدُكَ مِنْ شِعْرِي يَا ابْنَ الْفَارُوقِ‏؟‏ قَالَ‏:‏ بَلَى، وَلَكِنْ لاَ تُنْشِدْنِي إِلاَّ حَسَنًا‏.‏ فَأَنْشَدَهُ حَتَّى إِذَا بَلَغَ شَيْئًا كَرِهَهُ ابْنُ عُمَرَ، قَالَ لَهُ‏:‏ أَمْسِكْ‏.‏","english":{"narrator":"","text":"Khalid ibn Kaysan said, \"I was with Ibn 'Umar when Iyyas ibn Khaythama\ngot up and said to him, 'Shall I recite some poetry, Ibn al-Faruq?' 'Yes,'\nhe replied, 'but only recite good poetry to me.'\" He recited until he came\nto something which Ibn 'Umar disliked whereupon he told him to stop."}},{"id":2,"idInBook":2,"chapterId":36,"bookId":15,"arabic":"حَدَّثَنَا عَمْرُو بْنُ مَرْزُوقٍ، قَالَ‏:‏ أَخْبَرَنَا شُعْبَةُ، عَنْ قَتَادَةَ، سَمِعَ مُطَرِّفًا قَالَ‏:‏ صَحِبْتُ عِمْرَانَ بْنَ حُصَيْنٍ مِنَ الْكُوفَةِ إِلَى الْبَصْرَةِ، فَقَلَّ مَنْزِلٌ يَنْزِلُهُ إِلاَّ وَهُوَ يُنْشِدُنِي شِعْرًا، وَقَالَ‏:‏ إِنَّ فِي الْمَعَارِيضِ لَمَنْدُوحَةٌ عَنِ الْكَذِبِ‏.‏","english":{"narrator":"","text":"Mutarrif said, \"I accompanied 'Imran ibn Husayn from Kufa to Basra.\nVery rarely did he arrive at my house without reciting some poetry to me.\nHe said, 'Indirect speech accords great scope in avoiding lies.'\""}},{"id":3,"idInBook":3,"chapterId":36,"bookId":15,"arabic":"حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ‏:‏ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ قَالَ‏:‏ أَخْبَرَنِي أَبُو بَكْرِ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ مَرْوَانَ بْنَ الْحَكَمِ أَخْبَرَهُ، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ الأَسْوَدِ بْنِ عَبْدِ يَغُوثَ أَخْبَرَهُ، أَنَّ أُبَيَّ بْنَ كَعْبٍ أَخْبَرَهُ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم قَالَ‏:‏ إِنَّ مِنَ الشِّعْرِ حِكْمَةً‏.‏","english":{"narrator":"","text":"Ubayy ibn Ka'b mentioned that the Messenger of Allah, may Allah\nbless him and grant him peace, said, \"There is some wisdom in poetry.\""}},{"id":4,"idInBook":4,"chapterId":36,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا أَبُو هَمَّامٍ مُحَمَّدُ بْنُ الزِّبْرِقَانِ، قَالَ‏:‏ حَدَّثَنَا يُونُسُ بْنُ عُبَيْدٍ، عَنِ الْحَسَنِ، عَنِ الأَسْوَدِ بْنِ سَرِيعٍ‏:‏ قُلْتُ‏:‏ يَا رَسُولَ اللهِ، إِنِّي مَدَحْتُ رَبِّي عَزَّ وَجَلَّ بِمَحَامِدَ، قَالَ‏:‏ أَمَا إِنَّ رَبَّكَ يُحِبُّ الْحَمْدَ، وَلَمْ يَزِدْهُ عَلَى ذَلِكَ‏.‏","english":{"narrator":"","text":"Al-Aswad ibn Suray' said, \"Messenger of Allah, I have praised my\nLord, the Almighty and Exalted, in some words of praise.\" He said, \"Your\nLord loves praise,\" and did not say anything more."}},{"id":5,"idInBook":5,"chapterId":36,"bookId":15,"arabic":"حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، قَالَ‏:‏ حَدَّثَنَا أَبِي، قَالَ‏:‏ حَدَّثَنَا الأَعْمَشُ قَالَ‏:‏ سَمِعْتُ أَبَا صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ لَأَنْ يَمْتَلِئَ جَوْفُ رَجُلٍ قَيْحًا حَتَّى يَرِيَهُ، خَيْرٌ مِنْ أَنْ يَمْتَلِئَ شِعْرًا‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"It is better for a man to fill his belly\nwith oozing pus than to fill it with poetry.\""}},{"id":6,"idInBook":6,"chapterId":36,"bookId":15,"arabic":"حَدَّثَنَا سَعِيدُ بْنُ سُلَيْمَانَ، قَالَ‏:‏ حَدَّثَنَا مُبَارَكٌ، عَنِ الْحَسَنِ، عَنِ الأَسْوَدِ بْنِ سَرِيعٍ قَالَ‏:‏ كُنْتُ شَاعِرًا، فَأَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فَقُلْتُ‏:‏ أَلاَ أُنْشِدُكَ مَحَامِدَ حَمِدْتُ بِهَا رَبِّي‏؟‏ قَالَ‏:‏ إِنَّ رَبَّكَ يُحِبُّ الْمَحَامِدَ، وَلَمْ يَزِدْنِي عَلَيْهِ‏.‏","english":{"narrator":"","text":"Al-Aswad ibn Suray' said, \"I was a poet and went to the Prophet,\nmay Allah bless him and grant him peace, and asked, 'Shall I recite some\npraises I have written for my Lord?' He said, 'Your Lord loves praise,'\nand did not say anything more.\""}},{"id":7,"idInBook":7,"chapterId":36,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلامٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدَةُ، قَالَ‏:‏ أَخْبَرَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتِ‏:‏ اسْتَأْذَنَ حَسَّانُ بْنُ ثَابِتٍ رَسُولَ اللهِ صلى الله عليه وسلم فِي هِجَاءِ الْمُشْرِكِينَ، فَقَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ فَكَيْفَ بِنِسْبَتِي‏؟‏ فَقَالَ‏:‏ لَأَسُلَّنَّكَ مِنْهُمْ كَمَا تُسَلُّ الشَّعْرَةُ مِنَ الْعَجِينِ‏.‏","english":{"narrator":"","text":"'A'isha said, \"Hassan ibn Thabit asked the Messenger of Allah,\nmay Allah bless him and grant him peace, for permission to satirise the\nidolaters. The Messenger of Allah, may Allah bless him and grant him peace,\nsaid, 'And what about my lineage?' He said, 'I will extract you from them\nas a hair is taken from dough.'\""}},{"id":8,"idInBook":8,"chapterId":36,"bookId":15,"arabic":"وَعَنْ هِشَامٍ، عَنْ أَبِيهِ قَالَ‏:‏ ذَهَبْتُ أَسُبُّ حَسَّانَ عِنْدَ عَائِشَةَ، فَقَالَتْ‏:‏ لاَ تَسُبَّهُ، فَإِنَّهُ كَانَ يُنَافِحُ عَنْ رَسُولِ اللهِ صلى الله عليه وسلم‏.‏","english":{"narrator":"","text":"Hisham reported that his father said, \"I began to abuse Hassan\n in the presence of 'A'isha and she said, 'Do not abuse him.\nHe used to defend the Messenger of Allah, may Allah bless him and grant\nhim peace.'\""}},{"id":9,"idInBook":9,"chapterId":36,"bookId":15,"arabic":"حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ، عَنْ زِيَادٍ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي بَكْرٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الأَسْوَدِ، عَنْ أُبَيِّ بْنِ كَعْبٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ مِنَ الشِّعْرِ حِكْمَةٌ‏.‏","english":{"narrator":"","text":"See hadith 858."}},{"id":10,"idInBook":10,"chapterId":36,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلامٍ، قَالَ‏:‏ حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ زِيَادِ بْنِ أَنْعُمٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ رَافِعٍ، عَنْ عَبْدِ اللهِ بْنِ عَمْرٍو قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ الشِّعْرُ بِمَنْزِلَةِ الْكَلاَمِ، حَسَنُهُ كَحَسَنِ الْكَلامِ، وَقَبِيحُهُ كَقَبِيحِ الْكَلامِ‏.‏","english":{"narrator":"","text":"'Abdullah ibn 'Amr reported that the Messenger of Allah, may Allah\nbless him and grant him peace, said, \"Poetry is in the same position as\nspeech. The good of it is like good words and its bad part is like bad\nwords.\""}},{"id":11,"idInBook":11,"chapterId":36,"bookId":15,"arabic":"حَدَّثَنَا سَعِيدُ بْنُ تَلِيدٍ، قَالَ‏:‏ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ‏:‏ أَخْبَرَنِي جَابِرُ بْنُ إِسْمَاعِيلَ، وَغَيْرُهُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا، أَنَّهَا كَانَتْ تَقُولُ‏:‏ الشِّعْرُ مِنْهُ حَسَنٌ وَمِنْهُ قَبِيحٌ، خُذْ بِالْحَسَنِ وَدَعِ الْقَبِيحَ، وَلَقَدْ رَوَيْتُ مِنْ شِعْرِ كَعْبِ بْنِ مَالِكٍ أَشْعَارًا، مِنْهَا الْقَصِيدَةُ فِيهَا أَرْبَعُونَ بَيْتًا، وَدُونَ ذَلِكَ‏.‏","english":{"narrator":"","text":"'A'isha said, \"Poetry is both good and bad. Take the good and leave\nthe bad. I have related some of the poetry of Ka'b ibn Malik. That included\nan ode of forty verses and some less than that.\""}},{"id":12,"idInBook":12,"chapterId":36,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، قَالَ‏:‏ حَدَّثَنَا شَرِيكٌ، عَنِ الْمِقْدَامِ بْنِ شُرَيْحٍ، عَنْ أَبِيهِ قَالَ‏:‏ قُلْتُ لِعَائِشَةَ رَضِيَ اللَّهُ عَنْهَا‏:‏ أَكَانَ رَسُولُ اللهِ صلى الله عليه وسلم يَتَمَثَّلُ بِشَيْءٍ مِنَ الشِّعْرِ‏؟‏ فَقَالَتْ‏:‏ كَانَ يَتَمَثَّلُ بِشَيْءٍ مِنْ شِعْرِ عَبْدِ اللهِ بْنِ رَوَاحَةَ‏:‏ وَيَأْتِيكَ بِالأَخْبَارِ مَنْ لَمْ تُزَوِّدِ‏.‏","english":{"narrator":"Shurayh said, \"I ask 'A'isha, may Allah be pleased her with, 'Did\nthe Messenger of Allah, may Allah bless him and grant him peace, recite\nany poetry?' She said, 'He used to recite some of the poetry of 'Abdullah\nibn Rawaha:","text":""}},{"id":13,"idInBook":13,"chapterId":36,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى، قَالَ‏:‏ حَدَّثَنَا مُبَارَكٌ، قَالَ‏:‏ حَدَّثَنَا الْحَسَنُ، أَنَّ الأَسْوَدَ بْنَ سَرِيعٍ حَدَّثَهُ قَالَ‏:‏ كُنْتُ شَاعِرًا فَقُلْتُ‏:‏ يَا رَسُولَ اللهِ، امْتَدَحْتُ رَبِّي، فَقَالَ‏:‏ أَمَا إِنَّ رَبَّكَ يُحِبُّ الْحَمْدَ، وَمَا اسْتَزَادَنِي عَلَى ذَلِكَ‏.‏","english":{"narrator":"","text":"See hadith 859."}},{"id":14,"idInBook":14,"chapterId":36,"bookId":15,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ اللهِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ يَعْلَى قَالَ‏:‏ سَمِعْتُ عَمْرَو بْنَ الشَّرِيدِ، عَنِ الشَّرِيدِ قَالَ‏:‏ اسْتَنْشَدَنِي النَّبِيُّ صلى الله عليه وسلم شِعْرَ أُمَيَّةَ بْنِ أَبِي الصَّلْتِ، وَأَنْشَدْتُهُ، فَأَخَذَ النَّبِيُّ صلى الله عليه وسلم يَقُولُ‏:‏ هِيهِ، هِيهِ حَتَّى أَنْشَدْتُهُ مِئَةَ قَافِيَةٍ، فَقَالَ‏:‏ إِنْ كَادَ لَيُسْلِمُ‏.‏","english":{"narrator":"","text":"Ash-Sharid said, \"The Prophet, may Allah bless him and grant him\npeace, asked me to recite the poetry of Umayya ibn Abi's-Salt and I recited\nit. The Messenger of Allah, may Allah bless him and grant him peace, began\nto say, 'Go on, go on!' until I had recited a hundred lines.' The Prophet\nsaid, 'If only he had become Muslim.'\""}},{"id":15,"idInBook":15,"chapterId":36,"bookId":15,"arabic":"حَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُوسَى، قَالَ‏:‏ أَخْبَرَنَا حَنْظَلَةُ، عَنْ سَالِمٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ لأَنْ يَمْتَلِئَ جَوْفُ أَحَدِكُمْ قَيْحًا خَيْرٌ لَهُ مِنْ أَنْ يَمْتَلِئَ شِعْرًا‏.‏","english":{"narrator":"","text":"Ibn 'Umar reported that the Prophet, may Allah bless him and grant\nhim peace, said, \"It is better for one of you to fill his belly with pus\nthan to fill it with poetry.\""}},{"id":16,"idInBook":16,"chapterId":36,"bookId":15,"arabic":"حَدَّثَنَا إِسْحَاقُ، قَالَ‏:‏ أَخْبَرَنَا عَلِيُّ بْنُ الْحُسَيْنِ قَالَ‏:‏ حَدَّثَنِي أَبِي، عَنْ يَزِيدَ النَّحْوِيِّ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ‏:‏ ‏{‏وَالشُّعَرَاءُ يَتَّبِعُهُمُ الْغَاوُونَ‏}‏ إِلَى قَوْلِهِ‏:‏ ‏{‏وَأَنَّهُمْ يَقُولُونَ مَا لاَ يَفْعَلُونَ‏}‏، فَنَسَخَ مِنْ ذَلِكَ وَاسْتَثْنَى فَقَالَ‏:‏ ‏{‏إِلاَّ الَّذِينَ آمَنُوا‏}‏ إِلَى قَوْلِهِ‏:‏ ‏{‏يَنْقَلِبُونَ‏}‏‏.‏","english":{"narrator":"","text":"In respect of \"And as for the poets, is the misled who follow\nthem. Do you not see how they ramble on in every style and that they say\nthings which they do not do?\" (26:223-225), Ibn 'Abbas said that it\nwas abrogated and that an exception was made in His words, \"except for\nthose who believe and do right actions the kind of reversal they\nwill receive.\" (26:226)"}},{"id":17,"idInBook":17,"chapterId":36,"bookId":15,"arabic":"حَدَّثَنَا عَارِمٌ، قَالَ‏:‏ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ سِمَاكٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَجُلاً، أَوْ أَعْرَابِيًّا، أَتَى النَّبِيَّ صلى الله عليه وسلم فَتَكَلَّمَ بِكَلاَمٍ بَيِّنٍ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ إِنَّ مِنَ الْبَيَانِ سِحْرًا، وَإِنَّ مِنَ الشِّعْرِ حِكْمَةً‏.‏","english":{"narrator":"","text":"Ibn 'Abbas said that a man - or a bedouin - came to the\nProphet, may Allah bless him and grant him peace, and spoke some eloquent\nwords. The Prophet, may Allah bless him and grant him peace, said, \"There\nis some magic eloquence and some wisdom in poetry.\""}},{"id":18,"idInBook":18,"chapterId":36,"bookId":15,"arabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ قَالَ‏:‏ حَدَّثَنِي مَعْنٌ قَالَ‏:‏ حَدَّثَنِي عُمَرُ بْنُ سَلاَّمٍ، أَنَّ عَبْدَ الْمَلِكِ بْنَ مَرْوَانَ دَفَعَ وَلَدَهُ إِلَى الشَّعْبِيِّ يُؤَدِّبُهُمْ، فَقَالَ‏:‏ عَلِّمْهُمُ الشِّعْرَ يَمْجُدُوا وَيُنْجِدُوا، وَأَطْعِمْهُمُ اللَّحْمَ تَشْتَدُّ قُلُوبُهُمْ، وَجُزَّ شُعُورَهُمْ تَشْتَدُّ رِقَابُهُمْ، وَجَالِسْ بِهِمْ عِلْيَةَ الرِّجَالِ يُنَاقِضُوهُمُ الْكَلامَ‏.‏","english":{"narrator":"","text":"'Abdu'l-Malik ibn Marwan entrusted the teaching of his children\nto ash-Sha'bi and said, \"Teach them poetry so that they will possess dignity\nand vigor. Feed them meat so that their hearts will be strong. Cut off\ntheir hair so that their necks will be strong. Make them sit with men of\ndistinction who will contradict them in words.\""}},{"id":19,"idInBook":19,"chapterId":36,"bookId":15,"arabic":"حَدَّثَنَا قُتَيْبَةُ، قَالَ‏:‏ حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ يُوسُفَ بْنِ مَاهَكَ، عَنْ عُبَيْدِ بْنِ عُمَيْرٍ، عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ إِنَّ أَعْظَمَ النَّاسِ جُرْمًا إِنْسَانٌ شَاعِرٌ يَهْجُو الْقَبِيلَةَ مِنْ أَسْرِهَا، وَرَجُلٌ انْتَفَى مِنْ أَبِيهِ‏.‏","english":{"narrator":"","text":"'A'isha reported that the Prophet, may Allah bless him and grant\nhim peace, said, \"The greatest of criminals is the poet who satirises the\nentire tribe and a man who disclaims his father.\""}}],"chapter":{"id":36,"bookId":15,"arabic":"كتاب الشِّعْرِ","english":"Poetry"}}