{"metadata":{"length":13,"arabic":{"title":"الأدب المفرد","author":"الإمام محمد بن إسماعيل البخاري","introduction":"كتاب الْكَلامِ"},"english":{"title":"Al-Adab Al-Mufrad","author":"Imam Muhammad ibn Ismail al-Bukhari","introduction":"Words"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":37,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا أَبُو عَامِرٍ الْعَقَدِيُّ، قَالَ‏:‏ حَدَّثَنَا زُهَيْرٌ عَنْ زَيْدِ بْنِ أَسْلَمَ قَالَ‏:‏ سَمِعْتُ ابْنَ عُمَرَ يَقُولُ‏:‏ قَدِمَ رَجُلاَنِ مِنَ الْمَشْرِقِ خَطِيبَانِ عَلَى عَهْدِ رَسُولِ اللهِ صلى الله عليه وسلم، فَقَامَا فَتَكَلَّمَا ثُمَّ قَعَدَا، وَقَامَ ثَابِتُ بْنُ قَيْسٍ، خَطِيبُ رَسُولِ اللهِ صلى الله عليه وسلم فَتَكَلَّمَ، فَعَجِبَ النَّاسُ مِنْ كَلاَمِهِمَا، فَقَامَ رَسُولُ اللهِ صلى الله عليه وسلم يَخْطُبُ فَقَالَ‏:‏ يَا أَيُّهَا النَّاسُ، قُولُوا قَوْلَكُمْ، فَإِنَّمَا تَشْقِيقُ الْكَلاَمِ مِنَ الشَّيْطَانِ، ثُمَّ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ إِنَّ مِنَ الْبَيَانِ سِحْرًا‏.‏","english":{"narrator":"","text":"Ibn 'Umar said, \"Two men came from the east as orators in the time\nof the Messenger of Allah, may Allah bless him and grant him peace. They\nstood up, spoke and then sat down. Thabit ibn Qays, the orator of the Messenger\nof Allah, may Allah bless him and grant him peace, stood up and spoke and\nthe people liked what he said. The Messenger of Allah, may Allah bless\nhim and grant him peace, stood up and said, 'O people, say what you have\nto say. seeking to present words is the best manner is from Shaytan.' Then\nthe Messenger of Allah, may Allah bless him and grant him peace, said,\n'There is some magic in eloquence.'\""}},{"id":2,"idInBook":2,"chapterId":37,"bookId":15,"arabic":"حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ‏:‏ أَخْبَرَنِي حُمَيْدٌ، أَنَّهُ سَمِعَ أَنَسًا يَقُولُ‏:‏ خَطَبَ رَجُلٌ عِنْدَ عُمَرَ فَأَكْثَرَ الْكَلاَمَ، فَقَالَ عُمَرُ‏:‏ إِنَّ كَثْرَةَ الْكَلاَمِ فِي الْخُطَبِ مِنْ شَقَاشِقِ الشَّيْطَانِ‏.‏","english":{"narrator":"","text":"Anas said, \"A man gave a speech in the presence of 'Umar and said\na lot. 'Umar said, 'Too many words in orations comes from the skills of\nshaytan.'\""}},{"id":3,"idInBook":3,"chapterId":37,"bookId":15,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ إِسْحَاقَ، قَالَ‏:‏ حَدَّثَنَا يَحْيَى بْنُ حَمَّادٍ، قَالَ‏:‏ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عَاصِمِ بْنِ كُلَيْبٍ قَالَ‏:‏ حَدَّثَنِي سُهَيْلُ بْنُ ذِرَاعٍ قَالَ‏:‏ سَمِعْتُ أَبَا يَزِيدَ أَوْ مَعْنَ بْنَ يَزِيدَ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ‏:‏ اجْتَمِعُوا فِي مَسَاجِدِكُمْ، وَكُلَّمَا اجْتَمَعَ قَوْمٌ فَلْيُؤْذِنُونِي، فَأَتَانَا أَوَّلَ مَنْ أَتَى، فَجَلَسَ، فَتَكَلَّمَ مُتَكَلِّمٌ مِنَّا، ثُمَّ قَالَ‏:‏ إِنَّ الْحَمْدَ لِلَّهِ الَّذِي لَيْسَ لِلْحَمْدِ دُونَهُ مَقْصَدٌ، وَلاَ وَرَاءَهُ مَنْفَذٌ‏.‏ فَغَضِبَ فَقَامَ، فَتَلاَوَمْنَا بَيْنَنَا، فَقُلْنَا‏:‏ أَتَانَا أَوَّلَ مَنْ أَتَى، فَذَهَبَ إِلَى مَسْجِدٍ آخَرَ فَجَلَسَ فِيهِ، فَأَتَيْنَاهُ فَكَلَّمْنَاهُ، فَجَاءَ مَعَنَا فَقَعَدَ فِي مَجْلِسِهِ أَوْ قَرِيبًا مِنْ مَجْلِسِهِ، ثُمَّ قَالَ‏:‏ الْحَمْدُ لِلَّهِ الَّذِي مَا شَاءَ جَعَلَ بَيْنَ يَدَيْهِ، وَمَا شَاءَ جَعَلَ خَلْفَهُ، وَإِنَّ مِنَ الْبَيَانِ سِحْرًا، ثُمَّ أَمَرَنَا وَعَلَّمَنَا‏.‏","english":{"narrator":"","text":"Abu Yazid or Ma'n ibn Yazid reported that the Prophet, may Allah\nbless him and grant him peace, said, \"Gather in your mosques. When the\npeople are gathered, come and tell me.' The first of those to whom he came\nwas us and he sat down. One of the speakers spoke and said, 'Praise be\nto Allah. No praise can be directed to anyone except Him nor is there any\nescape without Him.' The Prophet got angry, stood up and we blamed one\nanother. Then he went to another mosque and sat in it. We sent to him and\nspoke to him. He came with us and sat where he had been sitting or near\nto it. Then he said, 'Praise be to Allah who puts whatever He wishes before\nHim and whatever He wishes behind Him. There is some magic in eloquence.'\nThen he commanded us and taught us.\""}},{"id":4,"idInBook":4,"chapterId":37,"bookId":15,"arabic":"حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، قَالَ‏:‏ حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ، قَالَ‏:‏ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ‏:‏ سَمِعْتُ عَبْدَ اللهِ بْنَ عَامِرِ بْنِ رَبِيعَةَ يَقُولُ‏:‏ قَالَتْ عَائِشَةُ‏:‏ أَرِقَ النَّبِيُّ صلى الله عليه وسلم ذَاتَ لَيْلَةٍ فَقَالَ‏:‏ لَيْتَ رَجُلاً صَالِحًا مِنْ أَصْحَابِي يَجِيئُنِي فَيَحْرُسَنِي اللَّيْلَةَ، إِذْ سَمِعْنَا صَوْتَ السِّلاَحِ، فَقَالَ‏:‏ مَنْ هَذَا‏؟‏ قَالَ‏:‏ سَعْدٌ يَا رَسُولَ اللهِ، جِئْتُ أَحْرُسُكَ، فَنَامَ النَّبِيُّ صلى الله عليه وسلم حَتَّى سَمِعْنَا غَطِيطَهُ‏.‏","english":{"narrator":"","text":"'A'isha said, \"The Prophet, may Allah bless him and grant him peace,\nwas sleepless one night and said, 'Would that a man of righteous action\namong my Companions would come and guard me tonight!' Then he heard the\nsound of weapons. He asked, 'Who is it?' 'Sa'd,' came the answer. Sa'd\nsaid, 'Messenger of Allah, I have come to guard you.' The Messenger of\nAllah, may Allah bless him and grant him peace, slept and we heard him\nsnore.\""}},{"id":5,"idInBook":5,"chapterId":37,"bookId":15,"arabic":"حَدَّثَنَا آدَمُ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ قَالَ‏:‏ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ يَقُولُ‏:‏ كَانَ فَزَعٌ بِالْمَدِينَةِ، فَاسْتَعَارَ النَّبِيُّ صلى الله عليه وسلم فَرَسًا لأَبِي طَلْحَةَ، يُقَالُ لَهُ‏:‏ الْمَنْدُوبُ، فَرَكِبَهُ، فَلَمَّا رَجَعَ قَالَ‏:‏ مَا رَأَيْنَا مِنْ شَيْءٍ، وَإِنْ وَجَدْنَاهُ لَبَحْرًا‏.‏","english":{"narrator":"","text":"Anas ibn Malik, \"There was some alarm in Madina and the Prophet,\nmay Allah bless him and grant him peace, borrowed a horse belonging to\nAbu Talha called al-Mandub. He rode it, and when he returned he said, 'We\ndid not see anything and he found the horse to be a sea.\""}},{"id":6,"idInBook":6,"chapterId":37,"bookId":15,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنْ عُبَيْدِ اللهِ، عَنْ نَافِعٍ قَالَ‏:‏ كَانَ ابْنُ عُمَرَ يَضْرِبُ وَلَدَهُ عَلَى اللَّحْنِ‏.‏","english":{"narrator":"","text":"Nafi' said, \"Ibn 'Umar used to strike his son for making grammatical\nmistakes.\""}},{"id":7,"idInBook":7,"chapterId":37,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى، قَالَ‏:‏ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ كَثِيرٍ أَبِي مُحَمَّدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَجْلاَنَ قَالَ‏:‏ مَرَّ عُمَرُ بْنُ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ بِرَجُلَيْنِ يَرْمِيَانِ، فَقَالَ أَحَدُهُمَا لِلْآخَرِ‏:‏ أسَبْتَ، فَقَالَ عُمَرُ‏:‏ سُوءُ اللَّحْنِ أَشَدُّ مِنْ سُوءِ الرَّمْيِ‏.‏","english":{"narrator":"","text":"'Abdu'r-Rahman ibn 'Ajlan said, \"'Umar ibn al-Khattab, may Allah\nbe pleased with him, passed by two men who were shooting. One man said\nto another, 'Do hit it (using the letter seen instead of saad).'\n'Umar observed, 'A bad grammatical mistake is worse than a bad shot.'\""}},{"id":8,"idInBook":8,"chapterId":37,"bookId":15,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، قَالَ‏:‏ حَدَّثَنَا عَنْبَسَةُ بْنُ خَالِدٍ، قَالَ‏:‏ حَدَّثَنَا يُونُسُ، عَنِ ابْنِ شِهَابٍ قَالَ‏:‏ أَخْبَرَنِي يَحْيَى بْنُ عُرْوَةَ بْنِ الزُّبَيْرِ، أَنَّهُ سَمِعَ عُرْوَةَ بْنَ الزُّبَيْرِ يَقُولُ‏:‏ قَالَتْ عَائِشَةُ زَوْجُ النَّبِيِّ صلى الله عليه وسلم‏:‏ سَأَلَ نَاسٌ النَّبِيَّ صلى الله عليه وسلم عَنِ الْكُهَّانِ، فَقَالَ لَهُمْ‏:‏ لَيْسُوا بِشَيْءٍ، فَقَالُوا‏:‏ يَا رَسُولَ اللهِ، فَإِنَّهُمْ يُحَدِّثُونَ بِالشَّيْءِ يَكُونُ حَقًّا‏؟‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ تِلْكَ الْكَلِمَةُ مِنَ الْحَقِّ يَخْطَفُهَا الشَّيْطَانُ، فَيُقَرْقِرُهُ بِأُذُنَيْ وَلِيِّهِ كَقَرْقَرَةِ الدَّجَاجَةِ، فَيَخْلِطُونَ فِيهَا بِأَكْثَرَ مِنْ مِئَةِ كِذْبَةٍ‏.‏","english":{"narrator":"","text":"'A'isha, the wife of the Prophet, may Allah bless him and grant\nhim peace, said, \"People asked the Prophet, may Allah bless him and grant\nhim peace, about soothsayers. He told them, 'They are nothing.' They said,\nBut, Messenger of Allah, they speak about things which are true!' The Prophet,\nmay Allah bless him and grant him peace, responded, 'That is a word which\nShaytan steals and then he mumbles it into the ear of his protege\nwith a sound like the clucking of a chicken. Then they mix a hundred lies\nwith it.'\""}},{"id":9,"idInBook":9,"chapterId":37,"bookId":15,"arabic":"حَدَّثَنَا آدَمُ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، عَنْ ثَابِتٍ الْبُنَانِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ‏:‏ كَانَ رَسُولُ اللهِ صلى الله عليه وسلم فِي مَسِيرٍ لَهُ، فَحَدَا الْحَادِي، فَقَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ ارْفُقْ يَا أَنْجَشَةُ وَيْحَكَ بِالْقَوَارِيرِ‏.‏","english":{"narrator":"","text":"Anas ibn Malik said, \"The Messenger of Allah, may Allah bless him\nand grant him peace, was on one of his journeys and the camel-drive was\nchanting (to make the camels move). The Prophet, may Allah bless him and\ngrant him peace, said, 'Gently, Anjasha! Be careful with the glass vessels\n(meaning the women).'\""}},{"id":10,"idInBook":10,"chapterId":37,"bookId":15,"arabic":"حَدَّثَنَا الْحَسَنُ بْنُ عُمَرَ، قَالَ‏:‏ حَدَّثَنَا مُعْتَمِرٌ قَالَ أَبِي‏:‏ حَدَّثَنَا ابْنُ عُمَرَ، عَنْ عُمَرَ، فِيمَا أَرَى شَكَّ أَبِي، أَنَّهُ قَالَ‏:‏ حَسْبُ امْرِئٍ مِنَ الْكَذِبِ أَنْ يُحَدِّثَ بِكُلِّ مَا سَمِعَ‏.‏","english":{"narrator":"","text":"'Umar said, \"A man is reckoned to be lying when he gives voice\nto all that he hears.\" He said, \"As for cases of indirect allusion, are\nthey enough to keep a Muslim from lying?\""}},{"id":11,"idInBook":11,"chapterId":37,"bookId":15,"arabic":"حَدَّثَنَا آدَمُ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ مُطَرِّفِ بْنِ عَبْدِ اللهِ بْنِ الشِّخِّيرِ قَالَ‏:‏ صَحِبْتُ عِمْرَانَ بْنَ حُصَيْنٍ إِلَى الْبَصْرَةِ، فَمَا أَتَى عَلَيْنَا يَوْمٌ إِلاَّ أَنْشَدْنَا فِيهِ الشِّعْرَ، وَقَالَ‏:‏ إِنَّ فِي مَعَارِيضِ الْكَلاَمِ لَمَنْدُوحَةٌ عَنِ الْكَذِبِ‏.‏","english":{"narrator":"","text":"Mutarrif ibn 'Imran ibn ash-Shakhir said, \"I accompanied 'Imran\nibn Husayn to Basra. Every day he used to recite poetry to us and he said,\n'Indirect allusions give ample scope to avoid lying.'\""}},{"id":12,"idInBook":12,"chapterId":37,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ صَالِحٍ قَالَ‏:‏ حَدَّثَنِي مُوسَى بْنُ عَلِيٍّ، عَنْ أَبِيهِ، عَنْ عَمْرِو بْنِ الْعَاصِ قَالَ‏:‏ عَجِبْتُ مِنَ الرَّجُلِ يَفِرُّ مِنَ الْقَدَرِ وَهُوَ مُوَاقِعُهُ، وَيَرَى الْقَذَاةَ فِي عَيْنِ أَخِيهِ وَيَدَعُ الْجِذْعَ فِي عَيْنِهِ، وَيُخْرِجُ الضَّغْنَ مِنْ نَفْسِ أَخِيهِ وَيَدَعُ الضَّغْنَ فِي نَفْسِهِ، وَمَا وَضَعْتُ سِرِّي عِنْدَ أَحَدٍ فَلُمْتُهُ عَلَى إِفْشَائِهِ، وَكَيْفَ أَلُومُهُ وَقَدْ ضِقْتُ بِهِ ذَرْعًا‏؟‏‏.‏","english":{"narrator":"","text":"'Amr ibn al-'As said, \"I am astonished at a man who flees from\nfate when he is all the time attacking it and who sees the mote in his\nbrother's eye and not the trunk in his own eye. He uncovers the rancour\nin his brother's heart and not the rancour in himself. I have never entrusted\nanyone with a secret of mine and then blamed him for divulging it. How\ncould I blame him when I have given him something he is incapable of doing?\""}},{"id":13,"idInBook":13,"chapterId":37,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ قَالَ‏:‏ حَدَّثَنِي أَخِي، عَنْ سُلَيْمَانَ بْنِ بِلاَلٍ، عَنْ عَلْقَمَةَ بْنِ أَبِي عَلْقَمَةَ، عَنْ أُمِّهِ، عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ‏:‏ مَرَّ رَجُلٌ مُصَابٌ عَلَى نِسْوَةٍ، فَتَضَاحَكْنَ بِهِ يَسْخَرْنَ، فَأُصِيبَ بَعْضُهُنَّ‏.‏","english":{"narrator":"","text":"'A'isha said, \"A man suffering from an affliction passed by some\nwomen and they laughed together, mocking him, and so one of them got that\nsame affliction.\""}}],"chapter":{"id":37,"bookId":15,"arabic":"كتاب الْكَلامِ","english":"Words"}}