{"metadata":{"length":19,"arabic":{"title":"الأدب المفرد","author":"الإمام محمد بن إسماعيل البخاري","introduction":"كتاب عاقبة الأمور"},"english":{"title":"Al-Adab Al-Mufrad","author":"Imam Muhammad ibn Ismail al-Bukhari","introduction":"Consequences"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":38,"bookId":15,"arabic":"حَدَّثَنَا بِشْرُ بْنُ مُحَمَّدٍ، قَالَ‏:‏ أَخْبَرَنَا عَبْدُ اللهِ، قَالَ‏:‏ أَخْبَرَنَا سَعْدُ بْنُ سَعِيدٍ الأَنْصَارِيُّ، عَنِ الزُّهْرِيِّ، عَنْ رَجُلٍ مِنْ بَلِيٍّ قَالَ‏:‏ أَتَيْتُ رَسُولَ اللهِ صلى الله عليه وسلم مَعَ أَبِي، فَنَاجَى أَبِي دُونِي، قَالَ‏:‏ فَقُلْتُ لأَبِي‏:‏ مَا قَالَ لَكَ‏؟‏ قَالَ‏:‏ إِذَا أَرَدْتَ أَمْرًا فَعَلَيْكَ بِالتُّؤَدَةِ حَتَّى يُرِيَكَ اللَّهُ مِنْهُ الْمَخْرَجَ، أَوْ حَتَّى يَجْعَلَ اللَّهُ لَكَ مَخْرَجًا‏.‏","english":{"narrator":"","text":"Az-Zuhri reported that a man from Bali said, \"I came to visit the\nMessenger of Allah, may Allah bless him and grant him peace, with my father.\nMy father spoke to him while I was not there. I said to my father, 'What\ndid he say to you?' He replied, 'When you desire something, then you must\nproceed slowly until Allah shows you a way out of it or until Allah makes\na way out for you.'\""}},{"id":2,"idInBook":2,"chapterId":38,"bookId":15,"arabic":"وَعَنِ الْحَسَنِ بْنِ عَمْرٍو الْفُقَيْمِيِّ، عَنْ مُنْذِرٍ الثَّوْرِيِّ، عَنْ مُحَمَّدِ ابْنِ الْحَنَفِيَّةِ قَالَ‏:‏ لَيْسَ بِحَكِيمٍ مَنْ لاَ يُعَاشِرُ بِالْمَعْرُوفِ مَنْ لاَ يَجِدُ مِنْ مُعَاشَرَتِهِ بُدًّا، حَتَّى يَجْعَلَ اللَّهُ لَهُ فَرَجًا أَوْ مَخْرَجًا‏.‏","english":{"narrator":"","text":"Muhammad ibn al-Hanafiyya said, \"Not wise is he who does not deal\ncorrectly with a person whose company he cannot avoid until Allah appoints\nfor him a release or a way out.\""}},{"id":3,"idInBook":3,"chapterId":38,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلامٍ، قَالَ‏:‏ حَدَّثَنَا الْفَزَارِيُّ، قَالَ‏:‏ حَدَّثَنَا قِنَانُ بْنُ عَبْدِ اللهِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْسَجَةَ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ مَنْ مَنَحَ مَنِيحَةً أَوْ هَدَّى زُقَاقًا، أَوْ قَالَ‏:‏ طَرِيقًا، كَانَ لَهُ عَدْلُ عِتَاقِ نَسَمَةٍ‏.‏","english":{"narrator":"","text":"Al-Bara' ibn 'Azib related that the Prophet, may Allah bless him\nand grant him peace, said, \"If anyone gives a gift or guides down a land\n- or a path - that, for him, is equivalent to freeing a slave.\""}},{"id":4,"idInBook":4,"chapterId":38,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدٌ، قَالَ‏:‏ أَخْبَرَنَا عَبْدُ اللهِ بْنُ رَجَاءٍ، قَالَ‏:‏ أَخْبَرَنَا عِكْرِمَةُ بْنُ عَمَّارٍ، عَنْ أَبِي زُمَيْلٍ، عَنْ مَالِكِ بْنِ مَرْثَدٍ، عَنْ أَبِيهِ، عَنْ أَبِي ذَرٍّ، يَرْفَعْهُ، قَالَ‏:‏ ثُمَّ قَالَ بَعْدَ ذَلِكَ‏:‏ لاَ أَعْلَمُهُ إِلاَّ رَفَعَهُ، قَالَ‏:‏ إِفْرَاغُكَ مِنْ دَلْوِكَ فِي دَلْوِ أَخِيكَ صَدَقَةٌ، وَأَمْرُكَ بِالْمَعْرُوفِ وَنَهْيُكَ عَنِ الْمُنْكَرِ صَدَقَةٌ، وَتَبَسُّمُكَ فِي وَجْهِ أَخِيكَ صَدَقَةٌ، وَإِمَاطَتُكَ الْحَجَرَ وَالشَّوْكَ وَالْعَظْمَ عَنْ طَرِيقِ النَّاسِ لَكَ صَدَقَةٌ، وَهِدَايَتُكَ الرَّجُلَ فِي أَرْضِ الضَّالَّةِ صَدَقَةٌ‏.‏","english":{"narrator":"","text":"Abu Dharr is reported as saying, \"Your putting some of the water\nfrom your bucket in your brother's bucket is sadaqa. Your removing stones.\nthorns and bones from people's path is sadaqa. Your guiding a man in a\nplace where there are no guides is sadaqa.\""}},{"id":5,"idInBook":5,"chapterId":38,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ قَالَ‏:‏ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ أَبِي الزِّنَادِ، عَنْ عَمْرِو بْنِ أَبِي عَمْرٍو، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم قَالَ‏:‏ لَعَنَ اللَّهُ مَنْ كَمَّهَ أَعْمَى عَنِ السَّبِيلِ‏.‏","english":{"narrator":"","text":"Ibn 'Abbas reported that the Messenger of Allah, may Allah bless him and grant him peace, said, \"Allah curses anyone who misguides a blind person and leads him away from the path.\""}},{"id":6,"idInBook":6,"chapterId":38,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبَانَ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ بَهْرَامَ، قَالَ‏:‏ حَدَّثَنَا شَهْرٌ قَالَ‏:‏ حَدَّثَنِي ابْنُ عَبَّاسٍ قَالَ‏:‏ بَيْنَمَا النَّبِيُّ صلى الله عليه وسلم بِفِنَاءِ بَيْتِهِ بِمَكَّةَ جَالِسٌ، إِذْ مَرَّ بِهِ عُثْمَانُ بْنُ مَظْعُونٍ، فَكَشَرَ إِلَى النَّبِيِّ صلى الله عليه وسلم، فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم‏:‏ أَلاَ تَجْلِسُ‏؟‏ قَالَ‏:‏ بَلَى، فَجَلَسَ النَّبِيُّ صلى الله عليه وسلم مُسْتَقْبِلَهُ، فَبَيْنَمَا هُوَ يُحَدِّثُهُ إِذْ شَخَصَ النَّبِيُّ صلى الله عليه وسلم بَصَرَهُ إِلَى السَّمَاءِ فَقَالَ‏:‏ أَتَانِي رَسُولُ اللهِ صلى الله عليه وسلم آنِفًا، وَأَنْتَ جَالِسٌ، قَالَ‏:‏ فَمَا قَالَ لَكَ‏؟‏ قَالَ‏:‏ ‏{‏إِنَّ اللَّهَ يَأْمُرُ بِالْعَدْلِ وَالإِحْسَانِ وَإِيتَاءِ ذِي الْقُرْبَى وَيَنْهَى عَنِ الْفَحْشَاءِ وَالْمُنْكَرِ وَالْبَغْيِ يَعِظُكُمْ لَعَلَّكُمْ تَذَكَّرُونَ‏}‏ قَالَ عُثْمَانُ‏:‏ وَذَلِكَ حِينَ اسْتَقَرَّ الإِيمَانُ فِي قَلْبِي وَأَحْبَبْتُ مُحَمَّدًا‏.‏","english":{"narrator":"","text":"Ibn 'Abbas told Shahr (ibn Hawshab), \"While the Prophet, may Allah\nbless him and grant him peace, was sitting in the courtyard of his house\nin Makka, 'Uthman ibn Maz'un passed by and smiled at the Prophet, may Allah\nbless him and grant him peace. The Prophet, may Allah bless him and grant\nhim peace, said to him, 'Why don't you sit down?' 'I will,' he said. So\nthe Prophet, may Allah bless him and grant him peace, sat facing him. While\nhe was conversing with him, the Prophet, may Allah bless him and grant\nhim peace, stared at the sky and said, 'A messenger from Allah, 'Abdullah\ncame to me just now when you sat sown?' He asked, 'What did he say to you?'\nHe said, 'Allah commands justice and doing good and giving to relatives.\nAnd He forbids indecency and doing wrong and tyranny. He warns you so that\nhopefully you will pay heed.' (16:90) 'Uthman said, 'That was when\nbelief was established in my heart and I loved Muhammad.'\""}},{"id":7,"idInBook":7,"chapterId":38,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ أَبِي الأَسْوَدِ، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ الطَّنَافِسِيُّ، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْعَزِيزِ، عَنْ أَبِي بَكْرِ بْنِ عُبَيْدِ اللهِ بْنِ أَنَسٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ مَنْ عَالَ جَارِيَتَيْنِ حَتَّى تُدْرِكَا، دَخَلْتُ أَنَا وَهُوَ فِي الْجَنَّةِ كَهَاتَيْنِ، وَأَشَارَ مُحَمَّدٌ بِالسَّبَّابَةِ وَالْوُسْطَى‏.‏","english":{"narrator":"","text":"Anas reported that the Prophet, may Allah bless him and grant him\npeace, said, \"I will enter the Garden with someone who brings up two daughters\nuntil they come of age, and we will be like these two,\" and he indicated\nhis index finger and middle finger."}},{"id":8,"idInBook":8,"chapterId":38,"bookId":15,"arabic":"وَبَابَانِ يُعَجَّلاَنِ فِي الدُّنْيَا‏:‏ الْبَغْيُ، وَقَطِيعَةُ الرَّحِمِ‏.‏","english":{"narrator":"\"Two doors come quickly in this world:","text":"outrage and cutting off\nrelatives.\""}},{"id":9,"idInBook":9,"chapterId":38,"bookId":15,"arabic":"حَدَّثَنَا شِهَابُ بْنُ مَعْمَرٍ الْعَوْقِيُّ، قَالَ‏:‏ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ إِنَّ الْكَرِيمَ ابْنَ الْكَرِيمِ ابْنِ الْكَرِيمِ ابْنِ الْكَرِيمِ يُوسُفُ بْنُ يَعْقُوبَ بْنِ إِسْحَاقَ بْنِ إِبْرَاهِيمَ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"The noble son of the noble son of the noble son\nof the noble one was Yusuf ibn Ya'qub ibn Ishaq ibn Ibrahim.\""}},{"id":10,"idInBook":10,"chapterId":38,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللهِ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم قَالَ‏:‏ إِنَّ أَوْلِيَائِي يَوْمَ الْقِيَامَةِ الْمُتَّقُونَ، وَإِنْ كَانَ نَسَبٌ أَقْرَبَ مِنْ نَسَبٍ، فَلاَ يَأْتِينِي النَّاسُ بِالأَعْمَالِ وَتَأْتُونَ بِالدُّنْيَا تَحْمِلُونَهَا عَلَى رِقَابِكُمْ، فَتَقُولُونَ‏:‏ يَا مُحَمَّدُ، فَأَقُولُ هَكَذَا وَهَكَذَا‏:‏ لاَ، وَأَعْرَضَ فِي كِلا عِطْفَيْهِ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"My friends on the Day of Rising will be\nthose with taqwa, even if one lineage is closer than another. People will\nnot bring me their actions. They will come carrying this world on their\nshoulders and they will call out, 'Muhammad!' I will say, 'no,' to such-and-such,\nand I will have full power over them.\""}},{"id":11,"idInBook":11,"chapterId":38,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ الْمُبَارَكِ، قَالَ‏:‏ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْمَلِكِ، قَالَ‏:‏ حَدَّثَنَا عَطَاءٌ، عَنِ ابْنِ عَبَّاسٍ قَالَ‏:‏ لاَ أَرَى أَحَدًا يَعْمَلُ بِهَذِهِ الْآيَةِ‏:‏ ‏{‏يَا أَيُّهَا النَّاسُ إِنَّا خَلَقْنَاكُمْ مِنْ ذَكَرٍ وَأُنْثَى‏}‏ حَتَّى بَلَغَ‏:‏ ‏{‏إِنَّ أَكْرَمَكُمْ عِنْدَ اللهِ أَتْقَاكُمْ‏}‏، فَيَقُولُ الرَّجُلُ لِلرَّجُلِ‏:‏ أَنَا أَكْرَمُ مِنْكَ، فَلَيْسَ أَحَدٌ أَكْرَمَ مِنْ أَحَدٍ إِلا بِتَقْوَى اللهِ‏.‏","english":{"narrator":"Ibn 'Abbas said, \"I do not know anyone who acts by this ayat:","text":"'Mankind!\nWe created you from a male and a female, and made you into peoples and\ntribes so that you might come to know each other. The noblest among you\nin Allah's sight is the one with the most taqwa.' (49:13) One man says\nto another man, 'I am more noble than you are.' No one is nobler than another\nperson except by taqwa.\""}},{"id":12,"idInBook":12,"chapterId":38,"bookId":15,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ‏:‏ حَدَّثَنَا جَعْفَرُ بْنُ بُرْقَانَ، عَنْ يَزِيدَ قَالَ‏:‏ قَالَ ابْنُ عَبَّاسٍ‏:‏ مَا تَعُدُّونَ الْكَرَمَ‏؟‏ وَقَدْ بَيَّنَ اللَّهُ الْكَرَمَ، فَأَكْرَمُكُمْ عِنْدَ اللهِ أَتْقَاكُمْ، مَا تَعُدُّونَ الْحَسَبَ‏؟‏ أَفْضَلُكُمْ حَسَبًا أَحْسَنُكُمْ خُلُقًا‏.‏","english":{"narrator":"","text":"Ibn 'Abbas said, \"What do you reckon to be nobility? Allah has\nmade nobility clear. The noblest of you in the sight of Allah is the one\nwith the greatest taqwa. What do you reckon as lineage? The best of you\nin lineage is the best of you in character.\""}},{"id":13,"idInBook":13,"chapterId":38,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ قَالَ‏:‏ حَدَّثَنِي اللَّيْثُ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ‏:‏ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ‏:‏ الأرْوَاحُ جُنُودٌ مُجَنَّدَةٌ، فَمَا تَعَارَفَ مِنْهَا ائْتَلَفَ، وَمَا تَنَاكَرَ مِنْهَا اخْتَلَفَ‏.‏","english":{"narrator":"","text":"'A'isha said, \"I heard the Messenger of Allah, may Allah bless\nhim and grant him peace, say, 'The arwah are a massed army. When they already\nknow each other, they are friendly. When they do not know each other, they\ndisagree.'\""}},{"id":14,"idInBook":14,"chapterId":38,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللهِ قَالَ‏:‏ حَدَّثَنِي سُلَيْمَانُ بْنُ بِلاَلٍ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ الأرْوَاحُ جُنُودٌ مُجَنَّدَةٌ، فَمَا تَعَارَفَ مِنْهَا ائْتَلَفَ، وَمَا تَنَاكَرَ مِنْهَا اخْتَلَفَ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"The spirits are massed armies. Those of\nthem that knew one another are friendly. Those that did not know one another\ndisagree.\""}},{"id":15,"idInBook":15,"chapterId":38,"bookId":15,"arabic":"حَدَّثَنَا يَحْيَى بْنُ صَالِحٍ الْمِصْرِيُّ، عَنْ إِسْحَاقَ بْنِ يَحْيَى الْكَلْبِيِّ، قَالَ‏:‏ حَدَّثَنَا الزُّهْرِيُّ، قَالَ‏:‏ أَخْبَرَنَا أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ أَبَا هُرَيْرَةَ قَالَ‏:‏ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ‏:‏ بَيْنَمَا رَاعٍ فِي غَنَمِهِ، عَدَا عَلَيْهِ الذِّئْبُ فَأَخَذَ مِنْهُ شَاةً، فَطَلَبَهُ الرَّاعِي، فَالْتَفَتَ إِلَيْهِ الذِّئْبُ فَقَالَ‏:‏ مَنْ لَهَا يَوْمَ السَّبُعِ‏؟‏ لَيْسَ لَهَا رَاعٍ غَيْرِي، فَقَالَ النَّاسُ‏:‏ سُبْحَانَ اللهِ، فَقَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ فَإِنِّي أُؤْمِنُ بِذَلِكَ، أَنَا وَأَبُو بَكْرٍ وَعُمَرُ‏.‏","english":{"narrator":"","text":"Abu Hurayra said, \"I heard the Prophet, may Allah bless him and\ngrant him peace, say, 'While a shepherd was tending to his sheep, a wolf\ncame and snatched one of the sheep. The shepherd went after the wolf which\nturned to him and said, 'Who will look after them on the 'Day of Wild Beasts'?\nThey will have no shepherd but me.' People said, 'Glory be to Allah!' The\nMessenger of Allah, may Allah bless him and grant him peace, said, 'I believe\nit - I, Abu Bakr and 'Umar.'\""}},{"id":16,"idInBook":16,"chapterId":38,"bookId":15,"arabic":"حَدَّثَنَا آدَمُ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، عَنِ الأَعْمَشِ قَالَ‏:‏ سَمِعْتُ سَعْدَ بْنَ عُبَيْدَةَ يُحَدِّثُ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ، عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ‏:‏ كَانَ النَّبِيُّ صلى الله عليه وسلم فِي جَنَازَةٍ، فَأَخَذَ شَيْئًا فَجَعَلَ يَنْكُتُ بِهِ فِي الأَرْضِ، فَقَالَ‏:‏ مَا مِنْكُمْ مِنْ أَحَدٍ إِلاَّ قَدْ كُتِبَ مَقْعَدُهُ مِنَ النَّارِ، وَمَقْعَدُهُ مِنَ الْجَنَّةِ، قَالُوا‏:‏ يَا رَسُولَ اللهِ، أَفَلاَ نَتَّكِلُ عَلَى كِتَابِنَا، وَنَدَعُ الْعَمَلَ‏؟‏ قَالَ‏:‏ اعْمَلُوا، فَكُلٌّ مُيَسَّرٌ لِمَا خُلِقَ لَهُ، قَالَ‏:‏ أَمَّا مَنْ كَانَ مِنْ أَهْلِ السَّعَادَةِ فَسَيُيَسَّرُ لِعَمَلِ السَّعَادَةِ، وَأَمَّا مَنْ كَانَ مِنْ أَهْلِ الشَّقَاوَةِ فَسَيُيَسَّرُ لِعَمَلِ الشَّقَاوَةِ، ثُمَّ قَرَأَ‏:‏ ‏{‏فَأَمَّا مَنْ أَعْطَى وَاتَّقَى وَصَدَّقَ بِالْحُسْنَى‏}‏‏.‏","english":{"narrator":"","text":"'Ali said, \"The Prophet, may Allah bless him and grant him peace,\nwas in a funeral procession an he picked up something and began to scratch\nthe ground with it. He said, 'There is none of you who does not have his\nseat written either in the Fire or in the Garden.' They said, 'Messenger\nof Allah, then should we not rely on what is written for us and abandon\naction?' 'Act.' he said. 'Every thing is easy if you were created for it.'\nHe added, 'As for someone who is one of the people of happiness, it is\neasy for him to perform the actions of happiness. As for someone who is\none of the people of wretchedness, it is easy for him to perform the actions\nof wretchedness.' Then he recited, 'As for him who gives out and has\ntaqwa and confirms the Good' (92:5-10)"}},{"id":17,"idInBook":17,"chapterId":38,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، عَنْ أُسَيْدِ بْنِ أَبِي أُسَيْدٍ، عَنْ أُمِّهِ قَالَتْ‏:‏ قُلْتُ لأَبِي قَتَادَةَ‏:‏ مَا لَكَ لاَ تُحَدِّثُ عَنْ رَسُولِ اللهِ صلى الله عليه وسلم كَمَا يُحَدِّثُ عَنْهُ النَّاسُ‏؟‏ فَقَالَ أَبُو قَتَادَةَ‏:‏ سَمِعْتُ رَسُولَ اللهِ صلى الله عليه وسلم يَقُولُ‏:‏ مَنْ كَذَبَ عَلَيَّ فَلْيُسَهِّلْ لِجَنْبِهِ مَضْجَعًا مِنَ النَّارِ، وَجَعَلَ رَسُولُ اللهِ صلى الله عليه وسلم يَقُولُ ذَلِكَ وَيَمْسَحُ الأرْضَ بِيَدِهِ‏.‏","english":{"narrator":"","text":"Usayd ibn Abi Usayd reported that his mother said, \"I said to Abu\nQatada, 'Why don't you relate something from the Messenger of Allah, may\nAllah bless him and grant him peace?' Abu Qatada said, 'I heard the Messenger\nof Allah, may Allah bless him and grant him peace, say, \"Whoever tells\nlies about me, eases the way for himself to a bed in the Fire.\" When the\nMessenger of Allah, may Allah bless him and grant him peace, said that,\nhe began to wipe his hand on the ground.'\""}},{"id":18,"idInBook":18,"chapterId":38,"bookId":15,"arabic":"حَدَّثَنَا آدَمُ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ قَالَ‏:‏ سَمِعْتُ عُقْبَةَ بْنَ صُهْبَانَ الأَزْدِيَّ يُحَدِّثُ، عَنْ عَبْدِ اللهِ بْنِ مُغَفَّلٍ الْمُزَنِيِّ قَالَ‏:‏ نَهَى رَسُولُ اللهِ صلى الله عليه وسلم عَنِ الْخَذْفِ، وَقَالَ‏:‏ إِنَّهُ لاَ يَقْتُلُ الصَّيْدَ، وَلاَ يُنْكِي الْعَدُوَّ، وَإِنَّهُ يَفْقَأُ الْعَيْنَ، وَيَكْسِرُ السِّنَّ‏.‏","english":{"narrator":"","text":"'Abdullah ibn Mughaffal al-Muzani said, \"The Messenger of Allah,\nmay Allah bless him and grant him peace, forbade slings. He said, 'They\ndo not kill game nor injure the enemy. They gouge the eye and break the\nteeth.'\""}},{"id":19,"idInBook":19,"chapterId":38,"bookId":15,"arabic":"حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، قَالَ‏:‏ حَدَّثَنَا اللَّيْثُ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، عَنْ ثَابِتِ بْنِ قَيْسٍ، أَنَّ أَبَا هُرَيْرَةَ قَالَ‏:‏ أَخَذَتِ النَّاسَ الرِّيحُ فِي طَرِيقِ مَكَّةَ، وَعُمَرُ حَاجٌّ، فَاشْتَدَّتْ، فَقَالَ عُمَرُ لِمَنْ حَوْلَهُ‏:‏ مَا الرِّيحُ‏؟‏ فَلَمْ يَرْجِعُوا بِشَيْءٍ، فَاسْتَحْثَثْتُ رَاحِلَتِي فَأَدْرَكْتُهُ، فَقُلْتُ‏:‏ بَلَغَنِي أَنَّكَ سَأَلْتَ عَنِ الرِّيحِ، وَإِنِّي سَمِعْتُ رَسُولَ اللهِ صلى الله عليه وسلم يَقُولُ‏:‏ الرِّيحُ مِنْ رَوْحِ اللهِ، تَأْتِي بِالرَّحْمَةِ، وَتَأْتِي بِالْعَذَابِ، فَلاَ تَسُبُّوهَا، وَسَلُوا اللَّهَ خَيْرَهَا، وَعُوذُوا مِنْ شَرِّهَا‏.‏","english":{"narrator":"","text":"Abu Hurayra said, \"A fierce wind blew when the people were on the\nroad to Makka while 'Umar was making hajj. 'Umar asked those around him,\n'What is the wind?' They did not give any answer. I urged my camel forward\nand I caught up with him and said, 'I have heard that you asked about the\nwind. I heard the Messenger of Allah, may Allah bless him and grant him\npeace, say, \"The wind (reeh) is from the spirit (ruh) of Allah. It\nbrings mercy and it brings punishment. Do not curse it. Ask Allah for the\ngood of it and seek refuge from its evil.\"'\""}}],"chapter":{"id":38,"bookId":15,"arabic":"كتاب عاقبة الأمور","english":"Consequences"}}