{"metadata":{"length":8,"arabic":{"title":"الأدب المفرد","author":"الإمام محمد بن إسماعيل البخاري","introduction":"كتاب عول البنات"},"english":{"title":"Al-Adab Al-Mufrad","author":"Imam Muhammad ibn Ismail al-Bukhari","introduction":"Looking after girls"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":4,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ يَزِيدَ، قَالَ‏:‏ حَدَّثَنَا حَرْمَلَةُ بْنُ عِمْرَانَ أَبُو حَفْصٍ التُّجِيبِيُّ، عَنْ أَبِي عُشَّانَةَ الْمَعَافِرِيِّ، عَنْ عُقْبَةَ بْنِ عَامِرٍ قَالَ‏:‏ سَمِعْتُ رَسُولَ اللهِ صلى الله عليه وسلم يَقُولُ‏:‏ مَنْ كَانَ لَهُ ثَلاَثُ بَنَاتٍ، وَصَبَرَ عَلَيْهِنَّ، وَكَسَاهُنَّ مِنْ جِدَتِهِ، كُنَّ لَهُ حِجَابًا مِنَ النَّارِ‏.‏","english":{"narrator":"","text":"'Uqba ibn 'Amir reported that he heard the Messenger of Allah, may Allah\nbless him and grant him peace, say, \"If someone has three daughters and is\npatient with them and clothes them from his wealth, they will be a shield\nagainst the Fire for him.\""}},{"id":2,"idInBook":2,"chapterId":4,"bookId":15,"arabic":"حَدَّثَنَا الْفَضْلُ بْنُ دُكَيْنٍ، قَالَ‏:‏ حَدَّثَنَا فِطْرٌ، عَنْ شُرَحْبِيلَ قَالَ‏:‏ سَمِعْتُ ابْنَ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ مَا مِنْ مُسْلِمٍ تُدْرِكُهُ ابْنَتَانِ، فَيُحْسِنُ صُحْبَتَهُمَا، إِلاَّ أَدْخَلَتَاهُ الْجَنَّةَ‏.‏","english":{"narrator":"","text":"Ibn 'Abbas reported that he heard the Messenger of Allah, may Allah bless\nhim and grant him peace, say, \"There is no Muslim who has two daughters and\ntakes good care of them but that he will enter the Garden.\""}},{"id":3,"idInBook":3,"chapterId":4,"bookId":15,"arabic":"حَدَّثَنَا أَبُو النُّعْمَانِ، قَالَ‏:‏ حَدَّثَنَا سَعِيدُ بْنُ زَيْدٍ قَالَ‏:‏ حَدَّثَنِي عَلِيُّ بْنُ زَيْدٍ قَالَ‏:‏ حَدَّثَنِي مُحَمَّدُ بْنُ الْمُنْكَدِرِ، أَنَّ جَابِرَ بْنَ عَبْدِ اللهِ حَدَّثَهُمْ قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ مَنْ كَانَ لَهُ ثَلاَثُ بَنَاتٍ، يُؤْوِيهِنَّ، وَيَكْفِيهِنَّ، وَيَرْحَمُهُنَّ، فَقَدْ وَجَبَتْ لَهُ الْجَنَّةُ الْبَتَّةَ، فَقَالَ رَجُلٌ مِنْ بَعْضِ الْقَوْمِ‏:‏ وَثِنْتَيْنِ، يَا رَسُولَ اللهِ‏؟‏ قَالَ‏:‏ وَثِنْتَيْنِ‏.‏","english":{"narrator":"","text":"Jabir ibn 'Abdullah reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"Anyone who has three daughters and provides\nfor them, clothes them and shows mercy to them will definitely enter the\nGarden.\" A man from the people said, \"And two daughters, Messenger of Allah?\"\nHe said, \"And two.\""}},{"id":4,"idInBook":4,"chapterId":4,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللهِ قَالَ‏:‏ حَدَّثَنِي عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ مُكْمِلٍ، عَنْ أَيُّوبَ بْنِ بَشِيرٍ الْمُعَاوِيِّ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم قَالَ‏:‏ لاَ يَكُونُ لأَحَدٍ ثَلاَثُ بَنَاتٍ، أَوْ ثَلاَثُ أَخَوَاتٍ، فَيُحْسِنُ إِلَيْهِنَّ، إِلاَّ دَخَلَ الْجَنَّةَ‏.‏","english":{"narrator":"","text":"Abu Sa'id al-Khudri said that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"No one has three daughters or three sisters\nand is good to them but that he will enter the Garden.\""}},{"id":5,"idInBook":5,"chapterId":4,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ صَالِحٍ قَالَ‏:‏ حَدَّثَنِي مُوسَى بْنُ عَلِيٍّ، عَنْ أَبِيهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ لِسُرَاقَةَ بْنِ جُعْشُمٍ‏:‏ أَلاَ أَدُلُّكَ عَلَى أَعْظَمِ الصَّدَقَةِ، أَوْ مِنْ أَعْظَمِ الصَّدَقَةِ‏؟‏ قَالَ‏:‏ بَلَى يَا رَسُولَ اللهِ، قَالَ‏:‏ ابْنَتُكَ مَرْدُودَةٌ إِلَيْكَ، لَيْسَ لَهَا كَاسِبٌ غَيْرُكَ‏.‏","english":{"narrator":"","text":"Musa ibn 'Ali reported that the Prophet, may Allah bless him and grant\nhim peace, said, \"Shall I show you the greatest sadaqa (or one of\nthe greatest forms of sadaqa)?\" He replied, \"Yes, indeed, Messenger\nof Allah!\" He went on, \"To provide for your daughter when she is returned\nto you and you are her sole source of provision.\""}},{"id":6,"idInBook":6,"chapterId":4,"bookId":15,"arabic":"حَدَّثَنَا بِشْرٌ، قَالَ‏:‏ أَخْبَرَنَا عَبْدُ اللهِ، قَالَ‏:‏ أَخْبَرَنَا مُوسَى قَالَ‏:‏ سَمِعْتُ أَبِي، عَنْ سُرَاقَةَ بْنِ جُعْشُمٍ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم قَالَ‏:‏ يَا سُرَاقَةُ مِثْلَهُ‏.‏","english":{"narrator":"","text":"Suraqa ibn Ju'shum reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said the like of previous hadith."}},{"id":7,"idInBook":7,"chapterId":4,"bookId":15,"arabic":"حَدَّثَنَا حَيْوَةُ بْنُ شُرَيْحٍ، قَالَ‏:‏ حَدَّثَنَا بَقِيَّةُ، عَنْ بَحِيرٍ، عَنْ خَالِدٍ، عَنِ الْمِقْدَامِ بْنِ مَعْدِي كَرِبَ، أَنَّهُ سَمِعَ رَسُولَ اللهِ صلى الله عليه وسلم يَقُولُ‏:‏ مَا أَطْعَمْتَ نَفْسَكَ فَهُوَ لَكَ صَدَقَةٌ، وَمَا أَطْعَمْتَ وَلَدَكَ فَهُوَ لَكَ صَدَقَةٌ، وَمَا أَطْعَمْتَ زَوْجَكَ فَهُوَ لَكَ صَدَقَةٌ، وَمَا أَطْعَمْتَ خَادِمَكَ فَهُوَ لَكَ صَدَقَةٌ‏.‏","english":{"narrator":"","text":"Al-Miqdam ibn Ma'dikarib heard the Messenger of Allah, may Allah bless\nhim and grant him peace, say, \"What you feed yourself is sadaqa for\nyou. What you feed your child is sadaqa for you. What you feed your\nwife is sadaqa is for you. What you feed your servant is sadaqa\nfor you.\""}},{"id":8,"idInBook":8,"chapterId":4,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ أَبِي شَيْبَةَ، قَالَ‏:‏ حَدَّثَنَا ابْنُ مَهْدِيٍّ، عَنْ سُفْيَانَ، عَنْ عُثْمَانَ بْنِ الْحَارِثِ أَبِي الرَّوَّاعِ، عَنِ ابْنِ عُمَرَ‏:‏ أَنَّ رَجُلاً كَانَ عِنْدَهُ، وَلَهُ بَنَاتٌ فَتَمَنَّى مَوْتَهُنَّ، فَغَضِبَ ابْنُ عُمَرَ فَقَالَ‏:‏ أَنْتَ تَرْزُقُهُنَّ‏؟‏‏.‏","english":{"narrator":"","text":"It is reported that there was a man who had daughters who was with Ibn\n'Umar when he wished that his daughters were dead. Ibn 'Umar became angry\nand said, \"While you are providing for them!\""}}],"chapter":{"id":4,"bookId":15,"arabic":"كتاب عول البنات","english":"Looking after girls"}}