{"metadata":{"length":33,"arabic":{"title":"الأدب المفرد","author":"الإمام محمد بن إسماعيل البخاري","introduction":"كتاب الْعُطَاسَ والتثاؤب"},"english":{"title":"Al-Adab Al-Mufrad","author":"Imam Muhammad ibn Ismail al-Bukhari","introduction":"Sneezing and Yawning"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":40,"bookId":15,"arabic":"حَدَّثَنَا آدَمُ، قَالَ‏:‏ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، قَالَ‏:‏ حَدَّثَنَا سَعِيدٌ الْمَقْبُرِيُّ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ إِنَّ اللَّهَ يُحِبُّ الْعُطَاسَ، وَيَكْرَهُ التَّثَاؤُبَ، فَإِذَا عَطَسَ فَحَمِدَ اللَّهَ فَحَقٌّ عَلَى كُلِّ مُسْلِمٍ سَمِعَهُ أَنْ يُشَمِّتَهُ، وَأَمَّا التَّثَاؤُبُ فَإِنَّمَا هُوَ مِنَ الشَّيْطَانِ، فَلْيَرُدَّهُ مَا اسْتَطَاعَ، فَإِذَا قَالَ‏:‏ هَاهْ، ضَحِكَ مِنْهُ الشَّيْطَانُ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"Allah loves sneezing and hates yawning. When one\nof you sneezes and praises Allah Almighty, it is a duty for every Muslim\nwho hears him to say to him, 'May Allah have mercy on you.' Yawning comes\nfrom Shaytan. When one of you yawns, he should control it as much as possible.\nWhen a man says, 'Aawh!,' Shaytan laughs at him.\""}},{"id":2,"idInBook":2,"chapterId":40,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى، عَنْ أَبِي عَوَانَةَ، عَنْ عَطَاءٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ قَالَ‏:‏ إِذَا عَطَسَ أَحَدُكُمْ فَقَالَ‏:‏ الْحَمْدُ لِلَّهِ، قَالَ الْمَلَكُ‏:‏ رَبَّ الْعَالَمِينَ، فَإِذَا قَالَ‏:‏ رَبَّ الْعَالَمِينَ، قَالَ الْمَلَكُ‏:‏ يَرْحَمُكَ اللَّهُ‏.‏","english":{"narrator":"","text":"Ibn 'Abbas said, \"When one of you sneezes and says, 'Praise be\nto Allah,' the angel says, 'The Lord of the Worlds.' When you say, 'The\nLord of the Worlds,' the angel says, 'May Allah have mercy on you.'\""}},{"id":3,"idInBook":3,"chapterId":40,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي سَلَمَةَ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ اللهِ بْنُ دِينَارٍ، عَنْ أَبِي صَالِحٍ السَّمَّانِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ إِذَا عَطَسَ فَلْيَقُلِ‏:‏ الْحَمْدُ لِلَّهِ، فَإِذَا قَالَ فَلْيَقُلْ لَهُ أَخُوهُ أَوْ صَاحِبُهُ‏:‏ يَرْحَمُكَ اللَّهُ، فَإِذَا قَالَ لَهُ‏:‏ يَرْحَمُكَ اللَّهُ فَلْيَقُلْ‏:‏ يَهْدِيكَ اللَّهُ وَيُصْلِحُ بَالَكَ‏.‏ قال أبو عبد الله: أثبت ما يروى في هذا الباب هذا الحديث الذي يروى عن ابي صالح السمان.","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"When one of you sneezes, he should say, 'Praise\nbe to Allah,' and his brother or companion should say to him, 'May Allah\nhave mercy on you.' Then he should say, 'May Allah guide you and put your\naffairs in order.'\""}},{"id":4,"idInBook":4,"chapterId":40,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلامٍ، قَالَ‏:‏ أَخْبَرَنَا الْفَزَارِيُّ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ زِيَادِ بْنِ أَنْعُمٍ الإِفْرِيقِيِّ قَالَ‏:‏ حَدَّثَنِي أَبِي، أَنَّهُمْ كَانُوا غُزَاةً فِي الْبَحْرِ زَمَنَ مُعَاوِيَةَ، فَانْضَمَّ مَرْكَبُنَا إِلَى مَرْكَبِ أَبِي أَيُّوبَ الأَنْصَارِيِّ، فَلَمَّا حَضَرَ غَدَاؤُنَا أَرْسَلْنَا إِلَيْهِ، فَأَتَانَا فَقَالَ‏:‏ دَعَوْتُمُونِي وَأَنَا صَائِمٌ، فَلَمْ يَكُنْ لِي بُدٌّ مِنْ أَنْ أُجِيبَكُمْ، لأَنِّي سَمِعْتُ رَسُولَ اللهِ صلى الله عليه وسلم يَقُولُ‏:‏ إِنَّ لِلْمُسْلِمِ عَلَى أَخِيهِ سِتَّ خِصَالٍ وَاجِبَةٍ، إِنْ تَرَكَ مِنْهَا شَيْئًا فَقَدْ تَرَكَ حَقًّا وَاجِبًا لأَخِيهِ عَلَيْهِ‏:‏ يُسَلِّمُ عَلَيْهِ إِذَا لَقِيَهُ، وَيُجِيبُهُ إِذَا دَعَاهُ، وَيُشَمِّتُهُ إِذَا عَطَسَ، وَيَعُودُهُ إِذَا مَرِضَ، وَيَحْضُرُهُ إِذَا مَاتَ، وَيَنْصَحُهُ إِذَا اسْتَنْصَحَهُ‏.‏ قَالَ : وَكَانَ مَعَنَا رَجُلٌ مَزَّاحٌ يَقُولُ لِرَجُلٍ أَصَابَ طَعَامَنَا : جَزَاكَ اللَّهُ خَيْرًا وَبِرًّا ، فَغَضِبَ عَلَيْهِ حِينَ أَكْثَرَ عَلَيْهِ ، فَقَالَ لِأَبِي أَيُّوبَ : مَا تَرَى فِي رَجُلٍ إِذَا قُلْتُ لَهُ : جَزَاكَ اللَّهُ خَيْرًا وَبِرًّا ، غَضِبَ وَشَتَمَنِي ؟ فَقَالَ أَبُو أَيُّوبَ : إِنَّا كُنَّا نَقُولُ : إِنَّ مَنْ لَمْ يُصْلِحْهُ الْخَيْرُ أَصْلَحْهُ الشَّرُّ ، فَاقْلِبْ عَلَيْهِ ، فَقَالَ لَهُ حِينَ أَتَاهُ : جَزَاكَ اللَّهُ شَرًّا وَعَرًّا ، فَضَحِكَ وَرَضِيَ وَقَالَ : مَا تَدَعُ مُزَاحَكَ ، فَقَالَ الرَّجُلُ : جَزَى اللَّهُ أَبَا أَيُّوبَ الْأَنْصَارِيَّ خَيْرًا","english":{"narrator":"","text":"'Abdu'r-Rahman ibn Ziyad ibn An'am al-Ifriqi said, \"My father told\nme that they were taking part in a sea raid in the time of Mu'awiya. He\nsaid, 'Our ship was right up against the ship of Abu Ayyub al-Ansari. When\nit was time for our midday meal, we invited him and he came over. He said,\n\"You invited me, but even though I am fasting, I cannot avoid accepting\nyour invitation because I heard the Messenger of Allah, may Allah bless\nhim and grant him peace, say, 'A Muslim owes six things to his brother.\nIf he neglects any of them, he has neglected an obligatory duty owed to\nhis brother. He should return his greeting when he greets him. He should\naccept when he gives him an invitation. He should ask for mercy on him\nwhen he sneezes. He should give him good counsel when he asks him for advice.'\"'\""}},{"id":5,"idInBook":5,"chapterId":40,"bookId":15,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللهِ، قَالَ‏:‏ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ قَالَ‏:‏ حَدَّثَنِي أَبِي، عَنْ حَكِيمِ بْنِ أَفْلَحَ، عَنِ ابْنِ مَسْعُودٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ أَرْبَعٌ لِلْمُسْلِمِ عَلَى الْمُسْلِمِ‏:‏ يَعُودُهُ إِذَا مَرِضَ، وَيَشْهَدُهُ إِذَا مَاتَ، وَيُجِيبُهُ إِذَا دَعَاهُ، وَيُشَمِّتُهُ إِذَا عَطَسَ‏.‏","english":{"narrator":"Ibn Mas'ud reported that the Prophet, may Allah bless him and grant\nhim peace, said, \"There are four things that one Muslim owes another Muslim:","text":"to visit him when he is ill, to be with him when he dies, to accept when\nhe invites him, and to ask for mercy on him when he sneezes.\""}},{"id":6,"idInBook":6,"chapterId":40,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، قَالَ‏:‏ أَخْبَرَنَا أَبُو الأَحْوَصِ، عَنْ أَشْعَثَ، عَنْ مُعَاوِيَةَ بْنِ سُوَيْدٍ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ قَالَ‏:‏ أَمَرَنَا رَسُولُ اللهِ صلى الله عليه وسلم بِسَبْعٍ، وَنَهَانَا عَنْ سَبْعٍ‏:‏ أَمَرَنَا بِعِيَادَةِ الْمَرِيضِ، وَاتِّبَاعِ الْجَنَائِزِ، وَتَشْمِيتِ الْعَاطِسِ، وَإِبْرَارِ الْمُقْسِمِ، وَنَصْرِ الْمَظْلُومِ، وَإِفْشَاءِ السَّلاَمِ، وَإِجَابَةِ الدَّاعِي‏.‏ وَنَهَانَا عَنْ‏:‏ خَوَاتِيمِ الذَّهَبِ، وَعَنْ آنِيَةِ الْفِضَّةِ، وَعَنِ الْمَيَاثِرِ، وَالْقَسِّيَّةِ، وَالإِسْتَبْرَقِ، وَالدِّيبَاجِ، وَالْحَرِيرِ‏.‏","english":{"narrator":"","text":"Al-Bara' ibn 'Azib said, \"The Messenger of Allah, may Allah bless\nhim and grant him peace, instructed us to do seven things and forbade us\nseven. He instructed us to visit the sick, to join funeral processions,\nto bless people who sneeze, to fulfil our oaths, to help the wronged, to\nreturn the greeting, and to accept invitations. He forbade us gold rings,\nsilver vessels, red (silk) saddle clothes, Qassi (silk and flax) garments,\nthick brocade, embroidered silk, and pure silk.\""}},{"id":7,"idInBook":7,"chapterId":40,"bookId":15,"arabic":"وَعَنْ إِسْمَاعِيلَ بْنِ جَعْفَرٍ، عَنِ الْعَلاَءِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم قَالَ‏:‏ حَقُّ الْمُسْلِمِ عَلَى الْمُسْلِمِ سِتٌّ، قِيلَ‏:‏ مَا هِيَ يَا رَسُولَ اللهِ‏؟‏ قَالَ‏:‏ إِذَا لَقِيتَهُ فَسَلِّمْ عَلَيْهِ، وَإِذَا دَعَاكَ فَأَجِبْهُ، وَإِذَا اسْتَنْصَحَكَ فَانْصَحْ لَهُ، وَإِذَا عَطَسَ فَحَمِدَ اللَّهَ فَشَمِّتْهُ، وَإِذَا مَرِضَ تَعُودُهُ، وَإِذَا مَاتَ فَاتَّبِعْهُ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"A Muslim owes another Muslim six duties.\"\nHe was asked, \"And what are they, Messenger of Allah?\" He said, \"To greet\nhim when he meets him, to accept when he gives him an invitation, to give\nhim good counsel when he asks for advice, to wish mercy on him when he\nsneezes and says, 'Praise be to Allah,' to visit him when he is ill, and\nto join the funeral procession when he dies.\""}},{"id":8,"idInBook":8,"chapterId":40,"bookId":15,"arabic":"حَدَّثَنَا طَلْقُ بْنُ غَنَّامٍ، قَالَ‏:‏ حَدَّثَنَا شَيْبَانُ، عَنْ أَبِي إِسْحَاقَ، عَنْ خَيْثَمَةَ، عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ‏:‏ مَنْ قَالَ عِنْدَ عَطْسَةٍ سَمِعَهَا‏:‏ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ عَلَى كُلِّ حَالٍ مَا كَانَ، لَمْ يَجِدْ وَجَعَ الضِّرْسِ وَلا الأُذُنٍ أَبَدًا‏.‏","english":{"narrator":"","text":"'Ali said, \"When someone hears a sneeze and says, 'Praise be to\nAllah, Lord of the Worlds, in every situation,' he will never get a toothache\nor earache.\""}},{"id":9,"idInBook":9,"chapterId":40,"bookId":15,"arabic":"حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيلَ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي سَلَمَةَ، قَالَ‏:‏ أَخْبَرَنَا عَبْدُ اللهِ بْنُ دِينَارٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ إِذَا عَطَسَ أَحَدُكُمْ فَلْيَقُلِ‏:‏ الْحَمْدُ لِلَّهِ، فَإِذَا قَالَ‏:‏ الْحَمْدُ لِلَّهِ، فَلْيَقُلْ لَهُ أَخُوهُ أَوْ صَاحِبُهُ‏:‏ يَرْحَمُكَ اللَّهُ، وَلْيَقُلْ هُوَ‏:‏ يَهْدِيكُمُ اللَّهُ وَيُصْلِحُ بَالَكُمْ‏.‏","english":{"narrator":"","text":"Abu Salih reported that the Prophet, may Allah bless him and grant\nhim peace, said, \"When one of you sneezes, he should say, 'Praise be to\nAllah.' When he says, 'Praise be to Allah, ' his brother or companion should\nsay to him, 'May Allah have mercy on you.' Then let the person who sneezed\nsay, 'May Allah guide you and put your affairs in order.'\""}},{"id":10,"idInBook":10,"chapterId":40,"bookId":15,"arabic":"حَدَّثَنَا عَاصِمٌ، قَالَ‏:‏ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ إِنَّ اللَّهَ يُحِبُّ الْعُطَاسَ، وَيَكْرَهُ التَّثَاؤُبَ، وَإِذَا عَطَسَ أَحَدُكُمْ وَحَمِدَ اللَّهَ كَانَ حَقًّا عَلَى كُلِّ مُسْلِمٍ سَمِعَهُ أَنْ يَقُولَ‏:‏ يَرْحَمُكَ اللَّهُ‏.‏ فَأَمَّا التَّثَاؤُبُ فَإِنَّمَا هُوَ مِنَ الشَّيْطَانِ، فَإِذَا تَثَاءَبَ أَحَدُكُمْ فَلْيَرُدَّهُ مَا اسْتَطَاعَ، فَإِنَّ أَحَدَكُمْ إِذَا تَثَاءَبَ ضَحِكَ مِنْهُ الشَّيْطَانُ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"Allah loves the sneeze and dislikes yawning. When\none you sneezes and praises Allah, it is a duty for every Muslim who hears\nhim to say, 'May Allah have mercy on you.;' As for the yawn, it comes from\nShaytan. When one of you yawns, he should repress it as much as possible.\nWhen one of you yawns, Shaytan laughs at him.\""}},{"id":11,"idInBook":11,"chapterId":40,"bookId":15,"arabic":"حَدَّثَنَا حَامِدُ بْنُ عُمَرَ، قَالَ‏:‏ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي جَمْرَةَ قَالَ‏:‏ سَمِعْتُ ابْنَ عَبَّاسٍ يَقُولُ إِذَا شُمِّتَ‏:‏ عَافَانَا اللَّهُ وَإِيَّاكُمْ مِنَ النَّارِ، يَرْحَمُكُمُ اللَّهُ‏.‏","english":{"narrator":"","text":"Ibn 'Abbas said, \"When someone is wished mercy, he should say,\n'May Allah protect us and you from the Fire. May Allah have mercy on you.'\""}},{"id":12,"idInBook":12,"chapterId":40,"bookId":15,"arabic":"حَدَّثَنَا إِسْحَاقُ، قَالَ‏:‏ أَخْبَرَنَا يَعْلَى، قَالَ‏:‏ أَخْبَرَنَا أَبُو مُنَيْنٍ وَهُوَ يَزِيدُ بْنُ كَيْسَانَ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ كُنَّا جُلُوسًا عِنْدَ رَسُولِ اللهِ صلى الله عليه وسلم فَعَطَسَ رَجُلٌ فَحَمِدَ اللَّهَ، فَقَالَ لَهُ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ يَرْحَمُكَ اللَّهُ، ثُمَّ عَطَسَ آخَرُ، فَلَمْ يَقُلْ لَهُ شَيْئًا، فَقَالَ‏:‏ يَا رَسُولَ اللهِ، رَدَدْتَ عَلَى الْآخَرِ، وَلَمْ تَقُلْ لِي شَيْئًا‏؟‏ قَالَ‏:‏ إِنَّهُ حَمِدَ اللَّهَ، وَسَكَتَّ‏.‏","english":{"narrator":"","text":"Abu Hurayra said, \"We were sitting with the Messenger of Allah,\nmay Allah bless him and grant him peace, when a man sneezed and praised\nAllah. The Messenger of Allah, may Allah bless him and grant him peace,\nsaid to him, 'May Allah have mercy on you.' Then another man sneezed but\nthe Prophet did not say anything to him. The man, 'Messenger of Allah!\nyou responded to the other man, but did not say anything to me!' The Prophet\nreplied, 'He praised Allah and you were silent.'\""}},{"id":13,"idInBook":13,"chapterId":40,"bookId":15,"arabic":"حَدَّثَنَا آدَمُ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، قَالَ‏:‏ حَدَّثَنَا سُلَيْمَانُ التَّيْمِيُّ قَالَ‏:‏ سَمِعْتُ أَنَسًا يَقُولُ‏:‏ عَطَسَ رَجُلاَنِ عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَشَمَّتَ أَحَدَهُمَا، وَلَمْ يُشَمِّتِ الْآخَرَ، فَقَالَ‏:‏ شَمَّتَّ هَذَا وَلَمْ تُشَمِّتْنِي‏؟‏ قَالَ‏:‏ إِنَّ هَذَا حَمِدَ اللَّهَ، وَلَمْ تَحْمَدْهُ‏.‏","english":{"narrator":"","text":"Similar to 930, but from Anas."}},{"id":14,"idInBook":14,"chapterId":40,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلامٍ، قَالَ‏:‏ حَدَّثَنَا رِبْعِيُّ بْنُ إِبْرَاهِيمَ هُوَ أَخُو ابْنِ عُلَيَّةَ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِسْحَاقَ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ جَلَسَ رَجُلاَنِ عِنْدَ النَّبِيِّ صلى الله عليه وسلم أَحَدُهُمَا أَشْرَفُ مِنَ الْآخَرِ، فَعَطَسَ الشَّرِيفُ مِنْهُمَا فَلَمْ يَحْمَدِ اللَّهَ، وَلَمْ يُشَمِّتْهُ، وَعَطَسَ الْآخَرُ فَحَمِدَ اللَّهَ، فَشَمَّتَهُ النَّبِيُّ صلى الله عليه وسلم، فَقَالَ الشَّرِيفُ‏:‏ عَطَسْتُ عِنْدَكَ فَلَمْ تُشَمِّتْنِي، وَعَطَسَ هَذَا الْآخَرُ فَشَمَّتَّهُ، فَقَالَ‏:‏ إِنَّ هَذَا ذَكَرَ اللَّهَ فَذَكَرْتُهُ، وَأَنْتَ نَسِيتَ اللَّهَ فَنَسِيتُكَ‏.‏","english":{"narrator":"","text":"Abu Hurayra said, \"Two men sat in the presence of the Prophet may\nAllah bless him and grant him peace, and one of them was from a noble family\nthan the other. The nobler of the two sneezed and did not praise Allah,\nso the Prophet did not ask for mercy for him. Then the other man sneezed\nand praised Allah, so the Prophet, may Allah bless him and grant him peace,\nasked for mercy on him. The noble man said, 'I sneezed in your presence\nand you did not ask for mercy for me. This other than sneezed and you asked\nfor mercy on him.' The Prophet said, 'This man mentioned Allah, so I mentioned\nhim. You forgot Allah, so I forgot you.'\""}},{"id":15,"idInBook":15,"chapterId":40,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللهِ بْنِ عُمَرَ، أَنَّهُ كَانَ إِذَا عَطَسَ فَقِيلَ لَهُ‏:‏ يَرْحَمُكَ اللَّهُ، فَقَالَ‏:‏ يَرْحَمُنَا اللَّهُ وَإِيَّاكُمْ، وَيَغْفِرُ لَنَا وَلَكُمْ‏.‏","english":{"narrator":"","text":"Nafi' said that when 'Abdullah ibn 'Umar sneezed, they said\nto him, \"May Allah have mercy on you,\" and Ibn 'Umar said, \"May He have\nmercy on us and you. May He forgive us and you.\""}},{"id":16,"idInBook":16,"chapterId":40,"bookId":15,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنْ عَطَاءٍ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ عَبْدِ اللهِ قَالَ‏:‏ إِذَا عَطَسَ أَحَدُكُمْ فَلْيَقُلِ‏:‏ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ، وَلْيَقُلْ مَنْ يَرُدُّ‏:‏ يَرْحَمُكَ اللَّهُ، وَلْيَقُلْ هُوَ‏:‏ يَغْفِرُ اللَّهُ لِي وَلَكُمْ‏.‏","english":{"narrator":"","text":"'Abdullah said, \"When one of you sneezes, he should say, 'Praise\nbe to Allah, the Lord of the Worlds.' Let anyone responding to him say\n'May Allah have mercy on you.' Then the person who sneezed should say'May\nAllah forgive me and you.'\""}},{"id":17,"idInBook":17,"chapterId":40,"bookId":15,"arabic":"حَدَّثَنَا عَاصِمُ بْنُ عَلِيٍّ، قَالَ‏:‏ حَدَّثَنَا عِكْرِمَةُ، قَالَ‏:‏ حَدَّثَنَا إِيَاسُ بْنُ سَلَمَةَ، عَنْ أَبِيهِ قَالَ‏:‏ عَطَسَ رَجُلٌ عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَقَالَ‏:‏ يَرْحَمُكَ اللَّهُ، ثُمَّ عَطَسَ أُخْرَى، فَقَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ هَذَا مَزْكُومٌ‏.‏","english":{"narrator":"","text":"Iyas ibn Salama related that his father said, \"A man sneezed in\nthe presence of the Prophet, may Allah bless him and grant him peace, and\nthe Prophet said, 'May Allah have mercy on you.' Then the man sneezed again\nand the Prophet, may Allah bless him and grant him peace, said, 'This man\nhas a cold.'\""}},{"id":18,"idInBook":18,"chapterId":40,"bookId":15,"arabic":"حَدَّثَنَا عَارِمٌ، قَالَ‏:‏ حَدَّثَنَا عُمَارَةُ بْنُ زَاذَانَ قَالَ‏:‏ حَدَّثَنِي مَكْحُولٌ الأَزْدِيُّ قَالَ‏:‏ كُنْتُ إِلَى جَنْبِ ابْنِ عُمَرَ، فَعَطَسَ رَجُلٌ مِنْ نَاحِيَةِ الْمَسْجِدِ، فَقَالَ ابْنُ عُمَرَ‏:‏ يَرْحَمُكَ اللَّهُ إِنْ كُنْتَ حَمِدْتَ اللَّهَ‏.‏","english":{"narrator":"","text":"Makhul al-Azdi said, \"I was beside Ibn 'Umar when a man sneezed\non one side of the mosque. Ibn 'Umar said, 'May Allah have mercy on you\nif you praised Allah.'\""}},{"id":19,"idInBook":19,"chapterId":40,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلامٍ، قَالَ‏:‏ أَخْبَرَنَا مَخْلَدٌ، قَالَ‏:‏ أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي ابْنُ أَبِي نَجِيحٍ، عَنْ مُجَاهِدٍ، أَنَّهُ سَمِعَهُ يَقُولُ‏:‏ عَطَسَ ابْنٌ لِعَبْدِ اللهِ بْنِ عُمَرَ، إِمَّا أَبُو بَكْرٍ، وَإِمَّا عُمَرُ، فَقَالَ‏:‏ آبَّ، فَقَالَ ابْنُ عُمَرَ‏:‏ وَمَا آبَّ‏؟‏ إِنَّ آبَّ اسْمُ شَيْطَانٍ مِنَ الشَّيَاطِينِ جَعَلَهَا بَيْنَ الْعَطْسَةِ وَالْحَمْدِ‏.‏","english":{"narrator":"","text":"Mujahid said, \"When a son of 'Abdullah ibn 'Umar, either Abu Bakr\nor 'Umar, sneezed, he said, 'Ab!' Ibn 'Umar said, 'What is this \"Ab\"? Ab\nis the name of one of the shaytans who comes between the sneeze and the\npraise.'\""}},{"id":20,"idInBook":20,"chapterId":40,"bookId":15,"arabic":"حَدَّثَنَا أَبُو الْوَلِيدِ، قَالَ‏:‏ حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ قَالَ‏:‏ حَدَّثَنِي إِيَاسُ بْنُ سَلَمَةَ قَالَ‏:‏ حَدَّثَنِي أَبِي قَالَ‏:‏ كُنْتُ عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَعَطَسَ رَجُلٌ، فَقَالَ‏:‏ يَرْحَمُكَ اللَّهُ، ثُمَّ عَطَسَ أُخْرَى، فَقَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ هَذَا مَزْكُومٌ‏.‏","english":{"narrator":"","text":"See hadith 935."}},{"id":21,"idInBook":21,"chapterId":40,"bookId":15,"arabic":"حَدَّثَنَا قُتَيْبَةُ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ عَجْلاَنَ، عَنِ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ شَمِّتْهُ وَاحِدَةً وَثِنْتَيْنِ وَثَلاَثًا، فَمَا كَانَ بَعْدَ هَذَا فَهُوَ زُكَامٌ‏.‏","english":{"narrator":"","text":"Abu Hurayra said, \"Wish mercy on a person once, twice and three\ntimes. Anything more than that is a cold.\""}},{"id":22,"idInBook":22,"chapterId":40,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنْ حَكِيمِ بْنِ الدَّيْلَمِ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى قَالَ‏:‏ كَانَ الْيَهُودُ يَتَعَاطَسُونَ عِنْدَ النَّبِيِّ صلى الله عليه وسلم رَجَاءَ أَنْ يَقُولَ لَهُمْ‏:‏ يَرْحَمُكُمُ اللَّهُ، فَكَانَ يَقُولُ‏:‏ يَهْدِيكُمُ اللَّهُ، وَيُصْلِحُ بَالَكُمْ‏.‏ (...) حدثنا أبو حفص بن علي قال: حدثنا يحيى قال: حدثنا سفيان قال: حدثني حكيم بن الديلم قال: حدثني أبو بردة, عن أبيه, مثله","english":{"narrator":"","text":"Abu Musa said, \"The Jews used to sneeze in the presence of the\nProphet, may Allah bless him and grant him peace, hoping that he would\nsay to them, 'May Allah have mercy on you.' He used to say to them, 'May\nAllah guide you and put you in order.'\""}},{"id":23,"idInBook":23,"chapterId":40,"bookId":15,"arabic":"حَدَّثَنَا فَرْوَةُ، وَأَحْمَدُ بْنُ إِشْكَابَ، قَالاَ‏:‏ حَدَّثَنَا الْقَاسِمُ بْنُ مَالِكٍ الْمُزَنِيُّ، عَنْ عَاصِمِ بْنِ كُلَيْبٍ، عَنْ أَبِي بُرْدَةَ قَالَ‏:‏ دَخَلْتُ عَلَى أَبِي مُوسَى، وَهُوَ فِي بَيْتِ ابْنَتِهِ أُمِّ الْفَضْلِ بْنِ الْعَبَّاسِ، فَعَطَسْتُ فَلَمْ يُشَمِّتْنِي، وَعَطَسَتْ فَشَمَّتَهَا، فَأَخْبَرْتُ أُمِّي، فَلَمَّا أَتَاهَا وَقَعَتْ بِهِ وَقَالَتْ‏:‏ عَطَسَ ابْنِي فَلَمْ تُشَمِّتْهُ، وَعَطَسَتْ فَشَمَّتَّهَا، فَقَالَ لَهَا‏:‏ إِنِّي سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ‏:‏ إِذَا عَطَسَ أَحَدُكُمْ فَحَمِدَ اللَّهَ فَشَمِّتُوهُ، وَإِنْ لَمْ يَحْمَدِ اللَّهَ فَلاَ تُشَمِّتُوهُ، وَإِنَّ ابْنَكِ عَطَسَ فَلَمْ يَحْمَدِ اللَّهَ، فَلَمْ أُشَمِّتْهُ، وَعَطَسَتْ فَحَمِدَتِ اللَّهَ فَشَمَّتُّهَا، فَقَالَتْ‏:‏ أَحْسَنْتَ‏.‏","english":{"narrator":"","text":"Abu Burda said, \"I came to Abu Musa while he was in the house of\nUmm al-Fadl ibn al-'Abbas and I sneezed and Abu Musa did not wish mercy\non me. Umm al-Fadl sneezed and he wished mercy on her. I told my mother,\nso when Abu Musa came to her, she confronted him and said, 'My son sneezed\nand you did not wish mercy on him. She (Umm al-Fadl) sneezed and you wished\nmercy on her.' Abu Musa replied, 'I heard the Prophet, may Allah bless\nhim and grant him peace, say, \"When one of you sneezes and praises Allah,\nyou should wish mercy on him, if he does not praise Allah, do not wish\nmercy on him.\" My son sneezed and did not praise Allah, so I did not wish\nmercy on him. She sneezed and praised Allah, so I wished mercy on her.'\nShe said, 'You did well.'\""}},{"id":24,"idInBook":24,"chapterId":40,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ يُوسُفَ، قَالَ‏:‏ أَخْبَرَنَا مَالِكٌ، عَنِ الْعَلاَءِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ إِذَا تَثَاءَبَ أَحَدُكُمْ فَلْيَكْظِمْ مَا اسْتَطَاعَ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"When one of you yawns, he should repress it as\nmuch as possible.\""}},{"id":25,"idInBook":25,"chapterId":40,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ‏:‏ حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، عَنْ مُعَاذٍ قَالَ‏:‏ أَنَا رَدِيفُ النَّبِيِّ صلى الله عليه وسلم، فَقَالَ‏:‏ يَا مُعَاذُ، قُلْتُ‏:‏ لَبَّيْكَ وَسَعْدَيْكَ، ثُمَّ قَالَ مِثْلَهُ ثَلاَثًا‏:‏ هَلْ تَدْرِي مَا حَقُّ اللهِ عَلَى الْعِبَادِ‏؟‏ قُلْتُ‏:‏ لاَ، قَالَ‏:‏ أَنْ يَعْبُدُوهُ وَلاَ يُشْرِكُوا بِهِ شَيْئًا، ثُمَّ سَارَ سَاعَةً فَقَالَ‏:‏ يَا مُعَاذُ، قُلْتُ‏:‏ لَبَّيْكَ وَسَعْدَيْكَ، قَالَ‏:‏ هَلْ تَدْرِي مَا حَقُّ الْعِبَادِ عَلَى اللهِ عَزَّ وَجَلَّ إِذَا فَعَلُوا ذَلِكَ‏؟‏ أَنْ لا يُعَذِّبَهُمْ‏.‏","english":{"narrator":"","text":"Mu'adh said, \"I was riding behind the Prophet, may Allah bless\nhim and grant him peace, and he called out, 'Mu'adh!' 'At your service!'\nI replied. Then the Prophet said the same thing three times and went on,\n'Do you know what is Allah's right on His slaves? That they should worship\nHim and not associate anything with Him.' Then he rode on for an hour."}},{"id":26,"idInBook":26,"chapterId":40,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ صَالِحٍ قَالَ‏:‏ حَدَّثَنِي اللَّيْثُ قَالَ‏:‏ حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ قَالَ‏:‏ أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللهِ بْنِ كَعْبِ بْنِ مَالِكٍ، أَنَّ عَبْدَ اللهِ بْنَ كَعْبٍ، وَكَانَ قَائِدَ كَعْبٍ مِنْ بَنِيهِ حِينَ عَمِيَ، قَالَ‏:‏ سَمِعْتُ كَعْبَ بْنَ مَالِكٍ يُحَدِّثُ حَدِيثَهُ حِينَ تَخَلَّفَ عَنْ رَسُولِ اللهِ صلى الله عليه وسلم عَنْ غَزْوَةِ تَبُوكَ، فَتَابَ اللَّهُ عَلَيْهِ‏:‏ وَآذَنَ رَسُولُ اللهِ صلى الله عليه وسلم بِتَوْبَةِ اللهِ عَلَيْنَا حِينَ صَلَّى صَلاَةَ الْفَجْرَ، فَتَلَقَّانِي النَّاسُ فَوْجًا فَوْجًا، يُهَنُّونِي بِالتَّوْبَةِ يَقُولُونَ‏:‏ لِتَهْنِكَ تَوْبَةُ اللهِ عَلَيْكَ، حَتَّى دَخَلْتُ الْمَسْجِدَ، فَإِذَا بِرَسُولِ اللهِ صلى الله عليه وسلم حَوْلَهُ النَّاسُ، فَقَامَ إِلَيَّ طَلْحَةُ بْنُ عُبَيْدِ اللهِ يُهَرْوِلُ، حَتَّى صَافَحَنِي وَهَنَّانِي، وَاللَّهِ مَا قَامَ إِلَيَّ رَجُلٌ مِنَ الْمُهَاجِرِينَ غَيْرُهُ، لا أَنْسَاهَا لِطَلْحَةَ‏.‏","english":{"narrator":"Ka’b bin Maalik (ra) related his account when he lagged behind in the Battle of Tabook. He said:","text":"When Allah accepted my repentance \nand the Messenger of Allah (ﷺ) announced at the time of the fajr prayers that Allah had accepted my repentance, people met me in large number and congratulated me on the acceptance of my repentance. They said, \"Congratulations to you. Allah has approved your repentance.\" And I entered the Masjid Nabawi. People were sitting around him. Talhah bin Ubayd Allah \nran towards me after standing up and shook hands with me and congratulated me. By Allah, one of the Muhajirs besides him stood up for me. I will not forget this demonstration of Thalhah’s."}},{"id":27,"idInBook":27,"chapterId":40,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَرْعَرَةَ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ نَاسًا نَزَلُوا عَلَى حُكْمِ سَعْدِ بْنِ مُعَاذٍ، فَأَرْسَلَ إِلَيْهِ، فَجَاءَ عَلَى حِمَارٍ، فَلَمَّا بَلَغَ قَرِيبًا مِنَ الْمَسْجِدِ قَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ ائْتُوا خَيْرَكُمْ، أَوْ سَيِّدَكُمْ، فَقَالَ‏:‏ يَا سَعْدُ إِنَّ هَؤُلاَءِ نَزَلُوا عَلَى حُكْمِكَ، فَقَالَ سَعْدٌ‏:‏ أَحْكُمُ فِيهِمْ أَنْ تُقْتَلَ مُقَاتِلَتُهُمْ، وَتُسْبَى ذُرِّيَّتُهُمْ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ حَكَمْتَ بِحُكْمِ اللهِ، أَوْ قَالَ‏:‏ حَكَمْتَ بِحُكْمِ الْمَلِكِ‏.‏","english":{"narrator":"","text":"Abu Sa’eed al-Khudri (ra) said that some people (the Jews of Banu Quraysh) came down at the command of Sa’d bin Mu’az . He was called and he came riding a donkey. When he approached the mosque, the Prophet (ﷺ) said, \"Rise up for one better than you\", or he said \"Rise up for your chief. And he also said, \"O Sa’d these people have come down on your orders\". Sa’d said, \"Those of them that are their fighting men should be slain and their young children should be made captives\". The Prophet (ﷺ) said, \"You have judged according to Allah’s decree\", or he \nsaid, \"You have decided in the light of the King’s command.)"}},{"id":28,"idInBook":28,"chapterId":40,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ‏:‏ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ قَالَ‏:‏ مَا كَانَ شَخْصٌ أَحَبَّ إِلَيْهِمْ رُؤْيَةً مِنَ النَّبِيِّ صلى الله عليه وسلم، وَكَانُوا إِذَا رَأَوْهُ لَمْ يَقُومُوا إِلَيْهِ، لِمَا يَعْلَمُونَ مِنْ كَرَاهِيَتِهِ لِذَلِكَ‏.‏","english":{"narrator":"","text":"Anas said, \"There is no one that people loved to see more than\nthe Prophet, may Allah bless him and grant him peace. But when they saw\nhim, they did not stand up for him since they knew that he disliked that.\""}},{"id":29,"idInBook":29,"chapterId":40,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْحَكَمِ، قَالَ‏:‏ أَخْبَرَنَا النَّضْرُ، قَالَ‏:‏ حَدَّثَنَا إِسْرَائِيلُ، قَالَ‏:‏ أَخْبَرَنَا مَيْسَرَةُ بْنُ حَبِيبٍ قَالَ‏:‏ أَخْبَرَنِي الْمِنْهَالُ بْنُ عَمْرٍو قَالَ‏:‏ حَدَّثَتْنِي عَائِشَةُ بِنْتُ طَلْحَةَ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ‏:‏ مَا رَأَيْتُ أَحَدًا مِنَ النَّاسِ كَانَ أَشْبَهَ بِالنَّبِيِّ صلى الله عليه وسلم كَلاَمًا وَلاَ حَدِيثًا وَلاَ جِلْسَةً مِنْ فَاطِمَةَ، قَالَتْ‏:‏ وَكَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا رَآهَا قَدْ أَقْبَلَتْ رَحَّبَ بِهَا، ثُمَّ قَامَ إِلَيْهَا فَقَبَّلَهَا، ثُمَّ أَخَذَ بِيَدِهَا فَجَاءَ بِهَا حَتَّى يُجْلِسَهَا فِي مَكَانِهِ، وَكَانَتْ إِذَا أَتَاهَا النَّبِيُّ صلى الله عليه وسلم رَحَّبَتْ بِهِ، ثُمَّ قَامَتْ إِلَيْهِ فَقَبَّلَتْهُ، وأَنَّهَا دَخَلَتْ عَلَى النَّبِيِّ صلى الله عليه وسلم فِي مَرَضِهِ الَّذِي قُبِضَ فِيهِ، فَرَحَّبَ وَقَبَّلَهَا، وَأَسَرَّ إِلَيْهَا، فَبَكَتْ، ثُمَّ أَسَرَّ إِلَيْهَا، فَضَحِكَتْ، فَقُلْتُ لِلنِّسَاءِ‏:‏ إِنْ كُنْتُ لَأَرَى أَنَّ لِهَذِهِ الْمَرْأَةِ فَضْلاً عَلَى النِّسَاءِ، فَإِذَا هِيَ مِنَ النِّسَاءِ، بَيْنَمَا هِيَ تَبْكِي إِذَا هِيَ تَضْحَكُ، فَسَأَلْتُهَا‏:‏ مَا قَالَ لَكِ‏؟‏ قَالَتْ‏:‏ إِنِّي إِذًا لَبَذِرَةٌ، فَلَمَّا قُبِضَ النَّبِيُّ صلى الله عليه وسلم، فَقَالَتْ‏:‏ أَسَرَّ إِلَيَّ فَقَالَ‏:‏ إِنِّي مَيِّتٌ، فَبَكَيْتُ، ثُمَّ أَسَرَّ إِلَيَّ فَقَالَ‏:‏ إِنَّكِ أَوَّلُ أَهْلِي بِي لُحُوقًا، فَسُرِرْتُ بِذَلِكَ وَأَعْجَبَنِي‏.‏","english":{"narrator":"","text":"'A'isha, the Umm al-Mu'minin, said, \"I have not seen anyone who\nmore resembled the Prophet, may Allah bless him and grant him peace, in\nwords or speech or manner of sitting than Fatima.\" 'A'isha continued, \"When\nthe Prophet, may Allah bless him and grant him peace, saw that she had\ncome, he would greet her and then he stood up for her, kissed her, took\nher hand and brought her forward and made her sit in his place. When the\nProphet, may Allah bless him and grant him peace, visited her, she greeted\nhim, stood up for him, and kissed him. She came to the Prophet, may Allah\nbless him and grant him peace, in his final illness and he greeted her,\nkissed her, and told her a secret. She wept. Then he confided something\nelse to her and she laughed. I said to the women, 'I see that this woman\nis superior to other women, yet she is one of them. First she wept and\nthen she laughed.' I asked her, 'What did he say to you?' She replied,\n'I would be telling a secret.' When the Prophet, may Allah bless him and\ngrant him peace, died, Fatima said, 'He confided to me, \"I am dying,\" so\nI wept. Then he confided to me, \"You will be the first of my family to\njoin me,\" so I was happy and pleased at that.'\""}},{"id":30,"idInBook":30,"chapterId":40,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ صَالِحٍ قَالَ‏:‏ حَدَّثَنِي اللَّيْثُ قَالَ‏:‏ حَدَّثَنِي أَبُو الزُّبَيْرِ، عَنْ جَابِرٍ قَالَ‏:‏ اشْتَكَى النَّبِيُّ صلى الله عليه وسلم، فَصَلَّيْنَا وَرَاءَهُ وَهُوَ قَاعِدٌ، وَأَبُو بَكْرٍ يُسْمِعُ النَّاسَ تَكْبِيرَهُ، فَالْتَفَتَ إِلَيْنَا فَرَآنَا قِيَامًا، فَأَشَارَ إِلَيْنَا فَقَعَدْنَا، فَصَلَّيْنَا بِصَلاَتِهِ قُعُودًا، فَلَمَّا سَلَّمَ قَالَ‏:‏ إِنْ كِدْتُمْ لَتَفْعَلُوا فِعْلَ فَارِسَ وَالرُّومِ، يَقُومُونَ عَلَى مُلُوكِهِمْ وَهُمْ قُعُودٌ، فَلاَ تَفْعَلُوا، ائْتَمُّوا بِأَئِمَّتِكُمْ، إِنْ صَلَّى قَائِمًا فَصَلُّوا قِيَامًا، وَإِنْ صَلَّى قَاعِدًا فَصَلُّوا قُعُودًا‏.‏","english":{"narrator":"","text":"Jabir said, \"The Prophet, may Allah bless him and grant him peace,\nwas ill and we prayed behind him while he was sitting down. Abu Bakr relayed\nhis takbir to the people. The Prophet turned towards us and saw that we\nwere standing. He indicated to us that we should sit down. So we prayed\nsitting down with him. When he said the taslim, he said, 'You were about\nto do what the Persians and Romans do. They stand in front of their kings\nwhen they are seated. Do not do that. Follow your Imams. If the Imam prays\nstanding, then pray standing. If he prays sitting down, then pray sitting\ndown.\""}},{"id":31,"idInBook":31,"chapterId":40,"bookId":15,"arabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ‏:‏ حَدَّثَنَا خَالِدٌ، قَالَ‏:‏ حَدَّثَنَا سُهَيْلٌ، عَنِ ابْنِ أَبِي سَعِيدٍ، عَنْ أَبِي سَعِيدٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ إِذَا تَثَاءَبَ أَحَدُكُمْ فَلْيَضَعْ يَدَهُ بِفِيهِ، فَإِنَّ الشَّيْطَانَ يَدْخُلُ فِيهِ‏.‏","english":{"narrator":"","text":"Abu Sa'id reported that the Prophet, may Allah bless him and grant\nhim peace, said, \"When one of you yawns, he should put his hand over his\nmouth. Otherwise Shaytan might enter it.\""}},{"id":32,"idInBook":32,"chapterId":40,"bookId":15,"arabic":"حَدَّثَنَا عُثْمَانُ، قَالَ‏:‏ حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ هِلاَلِ بْنِ يَسَافٍ، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ قَالَ‏:‏ إِذَا تَثَاءَبَ فَلْيَضَعْ يَدَهُ عَلَى فِيهِ، فَإِنَّمَا هُوَ مِنَ الشَّيْطَانِ‏.‏","english":{"narrator":"","text":"Ibn Abbas said, \"When someone yawns, he should place his hand over\nhis mouth. Yawning comes from Shaytan.\""}},{"id":33,"idInBook":33,"chapterId":40,"bookId":15,"arabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ‏:‏ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، قَالَ‏:‏ حَدَّثَنَا سُهَيْلٌ قَالَ‏:‏ سَمِعْتُ ابْنًا لأَبِي سَعِيدٍ الْخُدْرِيِّ يُحَدِّثُ أَبِي، عَنْ أَبِيهِ قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ إِذَا تَثَاءَبَ أَحَدُكُمْ فَلْيُمْسِكْ عَلَى فِيهِ، فَإِنَّ الشَّيْطَانَ يَدْخُلُهُ‏.‏ حدثنا خالد بن مخلد قال: حدثنا سليمان قال: حدثني سهيل قال: حدثني عبد الرحمن بن ابي سعيد، عن أبيه، أن النبي صلى الله عليه وسلم قال: (( إذا تثاءب أحدكم، فليمسك بيده فمه، فإن الشيطان يدخله))","english":{"narrator":"","text":"Same as 949."}}],"chapter":{"id":40,"bookId":15,"arabic":"كتاب الْعُطَاسَ والتثاؤب","english":"Sneezing and Yawning"}}