{"metadata":{"length":13,"arabic":{"title":"الأدب المفرد","author":"الإمام محمد بن إسماعيل البخاري","introduction":"كتاب الحركات"},"english":{"title":"Al-Adab Al-Mufrad","author":"Imam Muhammad ibn Ismail al-Bukhari","introduction":"Gestures"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":41,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ يُوسُفَ، قَالَ‏:‏ أَخْبَرَنَا مَالِكٌ، عَنْ إِسْحَاقَ بْنِ أَبِي طَلْحَةَ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ يَقُولُ‏:‏ كَانَ النَّبِيُّ صلى الله عليه وسلم يَدْخُلُ عَلَى أُمِّ حَرَامِ ابْنَةِ مِلْحَانَ، فَتُطْعِمُهُ، وَكَانَتْ تَحْتَ عُبَادَةَ بْنِ الصَّامِتِ، فَأَطْعَمَتْهُ وَجَعَلَتْ تَفْلِي رَأْسَهُ، فَنَامَ ثُمَّ اسْتَيْقَظَ يَضْحَكُ‏.‏","english":{"narrator":"","text":"Anas ibn Malik said, \"The Prophet, may Allah bless him and grant\nhim peace, used to visit Umm Hiram, the daughter of Milhan who was married\nto 'Ubada ibn as-Samit, and she would give him food and delouse his head.\nThen he slept and woke up laughing.\""}},{"id":2,"idInBook":2,"chapterId":41,"bookId":15,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللهِ، قَالَ‏:‏ حَدَّثَنَا الْمُغِيرَةُ بْنُ سَلَمَةَ أَبُو هِشَامٍ الْمَخْزُومِيُّ، وَكَانَ ثِقَةً، قَالَ‏:‏ حَدَّثَنَا الصَّعْقُ بْنُ حَزْنٍ قَالَ‏:‏ حَدَّثَنِي الْقَاسِمُ بْنُ مُطَيَّبٍ، عَنِ الْحَسَنِ الْبَصْرِيِّ، عَنْ قَيْسِ بْنِ عَاصِمٍ السَّعْدِيِّ قَالَ‏:‏ أَتَيْتُ رَسُولَ اللهِ صلى الله عليه وسلم فَقَالَ‏:‏ هَذَا سَيِّدُ أَهْلِ الْوَبَرِ، فَقُلْتُ‏:‏ يَا رَسُولَ اللهِ، مَا الْمَالُ الَّذِي لَيْسَ عَلَيَّ فِيهِ تَبِعَةٌ مِنْ طَالِبٍ، وَلاَ مِنْ ضَيْفٍ‏؟‏ فَقَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ نِعْمَ الْمَالُ أَرْبَعُونَ، وَالأَكْثَرُ سِتُّونَ، وَوَيْلٌ لأَصْحَابِ الْمِئِينَ إِلاَّ مَنْ أَعْطَى الْكَرِيمَةَ، وَمَنَحَالْغَزِيرَةَ، وَنَحَرَ السَّمِينَةَ، فَأَكَلَ وَأَطْعَمَ الْقَانِعَ وَالْمُعْتَرَّ، قُلْتُ‏:‏ يَا رَسُولَ اللهِ، مَا أَكْرَمُ هَذِهِ الأَخْلاَقِ، لاَ يُحَلُّ بِوَادٍ أَنَا فِيهِ مِنْ كَثْرَةِ نَعَمِي‏؟‏ فَقَالَ‏:‏ كَيْفَ تَصْنَعُ بِالْعَطِيَّةِ‏؟‏ قُلْتُ‏:‏ أُعْطِي الْبِكْرَ، وَأُعْطِي النَّابَ، قَالَ‏:‏ كَيْفَ تَصْنَعُ فِي الْمَنِيحَةِ‏؟‏ قَالَ‏:‏ إِنِّي لَأَمْنَحُ النَّاقَةَ، قَالَ‏:‏ كَيْفَ تَصْنَعُ فِي الطَّرُوقَةِ‏؟‏ قَالَ‏:‏ يَغْدُو النَّاسُ بِحِبَالِهِمْ، وَلاَ يُوزَعُ رَجُلٌ مِنْ جَمَلٍ يَخْتَطِمُهُ، فَيُمْسِكُهُ مَا بَدَا لَهُ، حَتَّى يَكُونَ هُوَ يَرُدَّهُ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ فَمَالُكَ أَحَبُّ إِلَيْكَ أَمْ مَالُ مَوَالِيكَ‏؟‏ قَالَ‏:‏ مَالِي، قَالَ‏:‏ فَإِنَّمَا لَكَ مِنْ مَالِكَ مَا أَكَلْتَ فَأَفْنَيْتَ، أَوْ أَعْطَيْتَ فَأَمْضَيْتَ، وَسَائِرُهُ لِمَوَالِيكَ، فَقُلْتُ‏:‏ لاَ جَرَمَ، لَئِنْ رَجَعْتُ لَأُقِلَّنَّ عَدَدَهَا فَلَمَّا حَضَرَهُ الْمَوْتُ جَمَعَ بَنِيهِ فَقَالَ‏:‏ يَا بَنِيَّ، خُذُوا عَنِّي، فَإِنَّكُمْ لَنْ تَأْخُذُوا عَنْ أَحَدٍ هُوَ أَنْصَحُ لَكُمْ مِنِّي‏:‏ لاَ تَنُوحُوا عَلَيَّ، فَإِنَّ رَسُولَ اللهِ صلى الله عليه وسلم لَمْ يُنَحْ عَلَيْهِ، وَقَدْ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَنْهَى عَنِ النِّيَاحَةِ، وَكَفِّنُونِي فِي ثِيَابِي الَّتِي كُنْتُ أُصَلِّي فِيهَا، وَسَوِّدُوا أَكَابِرَكُمْ، فَإِنَّكُمْ إِذَا سَوَّدْتُمْ أَكَابِرَكُمْ لَمْ يَزَلْ لأَبِيكُمْ فِيكُمْ خَلِيفَةٌ، وَإِذَا سَوَّدْتُمْ أَصَاغِرَكُمْ هَانَ أَكَابِرُكُمْ عَلَى النَّاسِ، وزهدوا فيكم وَأَصْلِحُوا عَيْشَكُمْ، فَإِنَّ فِيهِ غِنًى عَنْ طَلَبِ النَّاسِ، وَإِيَّاكُمْ وَالْمَسْأَلَةَ، فَإِنَّهَا آخِرُ كَسْبِ الْمَرْءِ، وَإِذَا دَفَنْتُمُونِي فَسَوُّوا عَلَيَّ قَبْرِي، فَإِنَّهُ كَانَ يَكُونُ شَيْءٌ بَيْنِي وَبَيْنَ هَذَا الْحَيِّ مِنْ بَكْرِ بْنِ وَائِلٍ‏:‏ خُمَاشَاتٌ، فَلاَ آمَنُ سَفِيهًا أَنْ يَأْتِيَ أَمْرًا يُدْخِلُ عَلَيْكُمْ عَيْبًا فِي دِينِكُمْ‏.‏","english":{"narrator":"","text":"Qays ibn 'Asim as-Sa'idi said, \"I came to the Messenger of Allah,\nmay Allah bless him and grant him peace, and he said, 'This is the master\nof the people of the desert.' I said, 'Messenger of Allah, how much property\ncan I have without owning anything to someone who comes with a request\nor a guest?' The Messenger of Allah, may Allah bless him and grant him\npeace, said, 'The best property is forty. A lot of property is sixty. Woe\nto those who have hundreds except for he who gives away something precious,\nlends an animal with abundant milk or sacrifices a fat animal to eat and\nfeeds beggars and the poor.' I asked, 'Messenger of Allah, which is the\nnoblest of these qualities?' The valley where I am does not support many\nflocks.' The Prophet replied, 'So what do you give as a gift?' I replied,\n'I give virgin camels and she-camels.' The Prophet asked, 'How much do\nyou give as a loan?' I said, 'I lend a hundred.' He asked, 'What do you\ndo with she-camels that are ready to be mated?' He replied, 'People bring\ntheir ropes (to use as halters for the male camels) and no man is prevented\nfrom taking a camel on which he puts a halter. He takes the male camel\nhe thinks is the proper one (for mating and keeps it) until he returns\nit.' The Prophet, may Allah bless him and grant him peace, said, 'Which\ndo you love more ? your property or your mawali (i.e. your heirs).' ('My\nproperty,' he replied.) The Prophet said, 'Your share is what you eat of\nyour property and consume or what you give away and spend. The rest of\nit belongs to your heirs.' I said, 'When I go back, I must lessen it.'\""}},{"id":3,"idInBook":3,"chapterId":41,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى، قَالَ‏:‏ حَدَّثَنَا وُهَيْبٌ، قَالَ‏:‏ حَدَّثَنَا أَيُّوبُ، عَنْ أَبِي الْعَالِيَةِ قَالَ‏:‏ سَأَلْتُ عَبْدَ اللهِ بْنَ الصَّامِتِ قَالَ‏:‏ سَأَلْتُ خَلِيلِي أَبَا ذَرٍّ، فَقَالَ‏:‏ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم بِوَضُوءٍ، فَحَرَّكَ رَأْسَهُ، وَعَضَّ عَلَى شَفَتَيْهِ، قُلْتُ بِأَبِي أَنْتَ وَأُمِّي آذَيْتُكَ‏؟‏ قَالَ‏:‏ لاَ، وَلَكِنَّكَ تُدْرِكُ أُمَرَاءَ أَوْ أَئِمَّةً يُؤَخِّرُونَ الصَّلاَةَ لِوَقْتِهَا، قُلْتُ‏:‏ فَمَا تَأْمُرُنِي‏؟‏ قَالَ‏:‏ صَلِّ الصَّلاَةَ لِوَقْتِهَا، فَإِنْ أَدْرَكْتَ مَعَهُمْ فَصَلِّهِ، وَلاَ تَقُولَنَّ‏:‏ صَلَّيْتُ، فَلاَ أُصَلِّي‏.‏","english":{"narrator":"","text":"'Abdullah ibn as-Samit said, \"I questioned my close friend Abu\nDharr who said, 'I brought some water for wudu' to the Prophet, may Allah\nbless him and grant him peace. He shook his head and bit his lip. I said,\n\"May my father and mother be your ransom, have I injured you?\" \"No,\" he\nreplied, \"but you will meet amirs ? or imams ? who will delay the prayer\nuntil it is past its time.\" \"So what do you command me to do?\" I asked.\nHe replied, \"Pray the prayer at the proper time. If you come across them,\nthen pray with them and do not say, 'I have already prayed, so I will not\npray again.'\"'\""}},{"id":4,"idInBook":4,"chapterId":41,"bookId":15,"arabic":"حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، قَالَ‏:‏ حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَلِيِّ بْنِ حُسَيْنٍ، أَنَّ حُسَيْنَ بْنَ عَلِيٍّ حَدَّثَهُ، عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم طَرَقَهُ وَفَاطِمَةَ بِنْتَ النَّبِيِّ صلى الله عليه وسلم، فَقَالَ‏:‏ أَلاَ تُصَلُّونَ‏؟‏ فَقُلْتُ‏:‏ يَا رَسُولَ اللهِ، إِنَّمَا أَنْفُسُنَا عِنْدَ اللهِ، فَإِذَا شَاءَ أَنْ يَبْعَثَنَا بَعَثَنَا، فَانْصَرَفَ النَّبِيُّ صلى الله عليه وسلم، وَلَمْ يَرْجِعْ إِلَيَّ شَيْئًا، ثُمَّ سَمِعْتُ وَهُوَ مُدْبِرٌ يَضْرِبُ فَخِذَهُ يَقُولُ‏:‏ ‏{‏وَكَانَ الإِنْسَانُ أَكْثَرَ شَيْءٍ جَدَلاً‏}‏‏.‏","english":{"narrator":"","text":"'Ali reported that the Messenger of Allah, may Allah bless him\nand grant him peace, knocked at the door of 'Ali and Fatima, the daughter\nof the Prophet, may Allah bless him and grant him peace, and said, \"Don't\nyou pray?\" 'Ali said, \"I said, 'Messenger of Allah, our spirits are with\nAllah. When He wishes to wake us up, we will make up.' The Prophet, may\nAllah bless him and grant him peace, left without saying anything to me.\nThen I heard him strike him thigh after his back was turned. He said, 'More\nthan anything else, man is argumentative.' (18:54)\""}},{"id":5,"idInBook":5,"chapterId":41,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، قَالَ‏:‏ أَخْبَرَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ أَبِي رَزِينٍ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ رَأَيْتُهُ يَضْرِبُ جَبْهَتَهُ بِيَدِهِ وَيَقُولُ‏:‏ يَا أَهْلَ الْعِرَاقِ، أَتَزْعُمُونَ أَنِّي أَكْذِبُ عَلَى رَسُولِ اللهِ صلى الله عليه وسلم، أَيَكُونُ لَكُمُ الْمَهْنَأُ وَعَلَيَّ الْمَأْثَمُ‏؟‏ أَشْهَدُ لَسَمِعْتُ رَسُولَ اللهِ صلى الله عليه وسلم يَقُولُ‏:‏ إِذَا انْقَطَعَ شِسْعُ نَعْلِ أَحَدِكُمْ، فَلاَ يَمْشِي فِي نَعْلِهِ الأُخْرَى حَتَّى يُصْلِحَهُ‏.‏","english":{"narrator":"","text":"Abu Razin said about Abu Hurayra, \"I saw him striking his brow\nwith his hand whole saying, 'People of Iraq, do you claim that I lie against\nthe Messenger of Allah, may Allah bless him and grant him peace? Do you\nhave enjoyment while I have the wrong action? I testify that I heard the\n, Messenger of Allah, may Allah bless him and grant him peace, say, \"When\none of you breaks his sandal-strap, he should not walk in his other sandal\nuntil it is mended.\"'\""}},{"id":6,"idInBook":6,"chapterId":41,"bookId":15,"arabic":"حَدَّثَنَا أَبُو مَعْمَرٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْوَارِثِ، قَالَ‏:‏ حَدَّثَنَا أَيُّوبُ بْنُ أَبِي تَمِيمَةَ، عَنْ أَبِي الْعَالِيَةِ الْبَرَاءِ قَالَ‏:‏ مَرَّ بِي عَبْدُ اللهِ بْنُ الصَّامِتِ، فَأَلْقَيْتُ لَهُ كُرْسِيًّا، فَجَلَسَ، فَقُلْتُ لَهُ‏:‏ إِنَّ ابْنَ زِيَادٍ قَدْ أَخَّرَ الصَّلاَةَ، فَمَا تَأْمُرُ‏؟‏ فَضَرَبَ فَخِذِي ضَرْبَةً، أَحْسَبُهُ قَالَ‏:‏ حَتَّى أَثَّرَ فِيهَا، ثُمَّ قَالَ‏:‏ سَأَلْتُ أَبَا ذَرٍّ كَمَا سَأَلْتَنِي، فَضَرَبَ فَخِذِي كَمَا ضَرَبْتُ فَخِذَكَ، فَقَالَ‏:‏ صَلِّ الصَّلاَةَ لِوَقْتِهَا، فَإِنْ أَدْرَكْتَ مَعَهُمْ فَصَلِّ، وَلاَ تَقُلْ‏:‏ قَدْ صَلَّيْتُ، فلا أُصَلِّي‏.‏","english":{"narrator":"","text":"Abu'l-'Aliyya al-Bara' said, \"'Abdullah ibn as-Samit passed by\nme and I gave him a chair. He sat down. I told him, 'Ibn Ziyad has delayed\nthe prayer. What do you command?' He hit my thigh (and I think he said,\n'So that it left a mark on me') and then he said, 'I asked Abu Dharr as\nyou asked me and he hit my thigh as I have hit yours. He said, \"Pray the\nprayer at the proper time, but if you come across some of them, pray with\nthem and do not say, 'I have already prayed,' and then not pray.\"'\""}},{"id":7,"idInBook":7,"chapterId":41,"bookId":15,"arabic":"حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ‏:‏ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمِ بْنِ عَبْدِ اللهِ، أَنَّ عَبْدَ اللهِ بْنَ عُمَرَ أَخْبَرَهُ أَنَّ عُمَرَ بْنَ الْخَطَّابِ انْطَلَقَ مَعَ رَسُولِ اللهِ صلى الله عليه وسلم فِي رَهْطٍ مِنْ أَصْحَابِهِ قِبَلَ ابْنِ صَيَّادٍ، حَتَّى وَجَدُوهُ يَلْعَبُ مَعَ الْغِلْمَانِ فِي أُطُمِ بَنِي مَغَالَةَ، وَقَدْ قَارَبَ ابْنُ صَيَّادٍ يَوْمَئِذٍ الْحُلُمَ، فَلَمْ يَشْعُرْ حَتَّى ضَرَبَ النَّبِيُّ صلى الله عليه وسلم ظَهْرَهُ بِيَدِهِ، ثُمَّ قَالَ‏:‏ أَتَشْهَدُ أَنِّي رَسُولُ اللهِ‏؟‏ فَنَظَرَ إِلَيْهِ فَقَالَ‏:‏ أَشْهَدُ أَنَّكَ رَسُولُ الأُمِّيِّينَ، قَالَ ابْنُ صَيَّادٍ‏:‏ فَتَشْهَدُ أَنِّي رَسُولُ اللهِ‏؟‏ فَرَصَّهُ النَّبِيُّ صلى الله عليه وسلم ثُمَّ قَالَ‏:‏ آمَنْتُ بِاللَّهِ وَبِرَسُولِهِ، ثُمَّ قَالَ لِابْنِ صَيَّادٍ‏:‏ مَاذَا تَرَى‏؟‏ فَقَالَ ابْنُ صَيَّادٍ‏:‏ يَأْتِينِي صَادِقٌ وَكَاذِبٌ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ خُلِّطَ عَلَيْكَ الأَمْرُ، قَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ إِنِّي خَبَّأْتُ لَكَ خَبِيئًا، قَالَ‏:‏ هُوَ الدُّخُّ، قَالَ‏:‏ اخْسَأْ فَلَمْ تَعْدُ قَدْرَكَ، قَالَ عُمَرُ‏:‏ يَا رَسُولَ اللهِ، أَتَأْذَنُ لِي فِيهِ أَنْ أَضْرِبَ عُنُقَهُ‏؟‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ إِنْ يَكُ هُوَ لاَ تُسَلَّطُ عَلَيْهِ، وَإِنْ لَمْ يَكُ هُوَ فَلاَ خَيْرَ لَكَ فِي قَتْلِهِ‏.‏","english":{"narrator":"","text":"It is related that 'Abdullah ibn 'Umar reported that 'Umar went\nwith the Messenger of Allah, may Allah bless him and grant him peace, with\na group to visit Ibn Sayyad. They found him playing with some children\nin the hills of Banu Maghala. Ibn Sayyad, who was approaching puberty,\ndid not notice them until the Prophet, may Allah bless him and grant him\npeace, patted him with his hand and then said to him, 'Do you testify that\nI am the Messenger of Allah?' Ibn Sayyad looked at him and said, 'I testify\nthat you are the Messenger of the unlettered.' Ibn Sayyad said to the Prophet,\n'Do you testify that I am the Messenger of Allah?' He refuted it and said,\n'I have believed in Allah and His Messengers.' Then he said to him, 'What\ndreams do you have?' Ibn Sayyad replied, 'Both truthful people and liars\ncome to me.' The Prophet, may Allah bless him and grant him peace, said,\n'You are in a state of confusion.' Then the Prophet, may Allah bless him\nand grant him peace, said to him, 'I am concealing something from you.'\nIbn Sayyad said, 'It is just smoke.' He said, 'Shame on you! You will not\ngo too far.' 'Umar said, 'Messenger of Allah, let me cut his head off?'\nThe Prophet, may Allah bless him and grant him peace, said, 'If it is him\n(i.e. the Dajjal), you will not be able to get the better of him. If it\nis not him, there is no point in killing him.'\""}},{"id":8,"idInBook":8,"chapterId":41,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى، قَالَ‏:‏ حَدَّثَنَا وُهَيْبٌ، قَالَ‏:‏ حَدَّثَنَا جَعْفَرٌ، عَنْ أَبِيهِ، عَنْ جَابِرٍ قَالَ‏:‏ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا كَانَ جُنُبًا، يَصُبُّ عَلَى رَأْسِهِ ثَلاَثَ حَفَنَاتٍ مِنْ مَاءٍ قَالَ الْحَسَنُ بْنُ مُحَمَّدٍ‏:‏ أَبَا عَبْدِ اللهِ، إِنَّ شَعْرِي أَكْثَرُ مِنْ ذَاكَ، قَالَ‏:‏ وَضَرَبَ بِيَدِهِ عَلَى فَخِذِ الْحَسَنِ فَقَالَ‏:‏ يَا ابْنَ أَخِي، كَانَ شَعْرُ النَّبِيِّ صلى الله عليه وسلم أَكْثَرَ مِنْ شَعْرِكَ وَأَطْيَبَ‏.‏","english":{"narrator":"","text":"Jabir said, \"When the Prophet, may Allah bless him and grant him\npeace, was in janaba, he would pour three cupfuls of water over his head.\""}},{"id":9,"idInBook":9,"chapterId":41,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى، قَالَ‏:‏ حَدَّثَنَا أَبُو عَوَانَةَ، عَنِ الأَعْمَشِ، عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرٍ قَالَ‏:‏ صُرِعَ رَسُولُ اللهِ صلى الله عليه وسلم مِنْ فَرَسٍ بِالْمَدِينَةِ عَلَى جِذْعِ نَخْلَةٍ، فَانْفَكَّتْ قَدَمُهُ، فَكُنَّا نَعُودُهُ فِي مَشْرُبَةٍ لِعَائِشَةَ رَضِيَ اللَّهُ عَنْهَا، فَأَتَيْنَاهُ وَهُوَ يُصَلِّي قَاعِدًا، فَصَلَّيْنَا قِيَامًا، ثُمَّ أَتَيْنَاهُ مَرَّةً أُخْرَى وَهُوَ يُصَلِّي الْمَكْتُوبَةَ قَاعِدًا، فَصَلَّيْنَا خَلْفَهُ قِيَامًا، فَأَوْمَأَ إِلَيْنَا أَنِ اقْعُدُوا، فَلَمَّا قَضَى الصَّلاَةَ قَالَ‏:‏ إِذَا صَلَّى الإِمَامُ قَاعِدًا فَصَلُّوا قُعُودًا، وَإِذَا صَلَّى قَائِمًا فَصَلُّوا قِيَامًا، وَلاَ تَقُومُوا وَالإِمَامُ قَاعِدٌ كَمَا تَفْعَلُ فَارِسُ بِعُظَمَائِهِمْ‏.‏","english":{"narrator":"","text":"Jabir said, \"In Madina, the Messenger of Allah, may Allah bless\nhim and grant him peace, was thrown from a horse onto a palm trunk and\ndislocated his foot. We used to visit him in the room of 'A'isha. We came\nupon him while he was praying sitting down and we prayed standing behind\nhim. He indicates to us that we should sit down. When he finished the prayer,\nhe said, 'When the Imam prays sitting, then pray sitting. When he prays\nstanding, then pray standing. Do not stand while the imam is sitting as\nthe Persians do with their great men.'\""}},{"id":10,"idInBook":10,"chapterId":41,"bookId":15,"arabic":"قَالَ‏:‏ وَوُلِدَ لِفُلاَنٍ مِنَ الأَنْصَارِ غُلامٌ، فَسَمَّاهُ مُحَمَّدًا، فَقَالَتِ الأنْصَارُ‏:‏ لا نُكَنِّيكَ بِرَسُولِ اللهِ‏.‏ حَتَّى قَعَدْنَا فِي الطَّرِيقِ نَسْأَلُهُ عَنِ السَّاعَةِ، فَقَالَ‏:‏ جِئْتُمُونِي تَسْأَلُونِي عَنِ السَّاعَةِ‏؟‏ قُلْنَا‏:‏ نَعَمْ، قَالَ‏:‏ مَا مِنْ نَفْسٍ مَنْفُوسَةٍ، يَأْتِي عَلَيْهَا مِئَةُ سَنَةٍ، قُلْنَا‏:‏ وُلِدَ لِفُلاَنٍ مِنَ الأَنْصَارِ غُلاَمٌ فَسَمَّاهُ مُحَمَّدًا، فَقَالَتِ الأنْصَارُ‏:‏ لا نُكَنِّيكَ بِرَسُولِ اللهِ، قَالَ‏:‏ أَحْسَنَتِ الأَنْصَارُ، سَمُّوا بِاسْمِي، ولا تَكْتَنُوا بِكُنْيَتِي‏.‏","english":{"narrator":"","text":"He also said, \"One of the slaves of the Ansar had a son whom he\nnamed Muhammad, The Ansar said, 'We will not give you the kunya of the\nMessenger of Allah until we have sat in the road and asked the Prophet\nabout the Final Hour.' The Prophet said, 'You have come to me to ask me\nabout the Hour?' 'Yes,' we replied. He said, 'There is no one alive now\nwho will see it, even if he lives a hundred years.' We said, 'A slave of\nthe Ansar has had a son and named him Muhammad. The Ansar said, \"We will\nnot call you by the kunya of the Messenger of Allah.\"' The Prophet said,\n'You have done well. Call yourselves with my name, but do not use my kunya.'\""}},{"id":11,"idInBook":11,"chapterId":41,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللهِ قَالَ‏:‏ حَدَّثَنِي الدَّرَاوَرْدِيُّ، عَنْ جَعْفَرٍ، عَنْ أَبِيهِ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم مَرَّ فِي السُّوقِ دَاخِلاً مِنْ بَعْضِ الْعَالِيَةِ وَالنَّاسُ كَنَفَيْهِ، فَمَرَّ بِجَدْيٍ أَسَكَّ، فَتَنَاوَلَهُ فَأَخَذَ بِأُذُنِهِ ثُمَّ قَالَ‏:‏ أَيُّكُمْ يُحِبُّ أَنَّ هَذَا لَهُ بِدِرْهَمٍ‏؟‏ فَقَالُوا‏:‏ مَا نُحِبُّ أَنَّهُ لَنَا بِشَيْءٍ، وَمَا نَصْنَعُ بِهِ‏؟‏ قَالَ‏:‏ أَتُحِبُّونَ أَنَّهُ لَكُمْ‏؟‏ قَالُوا‏:‏ لاَ، قَالَ ذَلِكَ لَهُمْ ثَلاَثًا، فَقَالُوا‏:‏ لاَ وَاللَّهِ، لَوْ كَانَ حَيًّا لَكَانَ عَيْبًا فِيهِ أَنَّهُ أَسَكُّ، وَالأَسَكُّ‏:‏ الَّذِي لَيْسَ لَهُ أُذُنَانِ، فَكَيْفَ وَهُوَ مَيِّتٌ‏؟‏ قَالَ‏:‏ فَوَاللَّهِ، لَلدُّنْيَا أَهْوَنُ عَلَى اللهِ مَنْ هَذَا عَلَيْكُمْ‏.‏","english":{"narrator":"","text":"Jabir ibn 'Abdullah reported that the Messenger of Allah, may Allah\nbless him and grant him peace, passed through the market, entering from\npart of the high part of the city and the people were on both sides of\nhim. He passed by a dead one-eared goat and reached out and took its ear.\nThen he said, \"Who would like to buy this for a dirham?\" They said, \"Why\nwould we want it when it is worthless? What would we do with it?\" He said,\n\"Would you like to have it?\" \"No,\" they replied. He asked them that three\ntimes and they said, \"No, by Allah! If it were alive, it would have a defect\nas it only has one ear. Why would we want it when it is dead?\" The Prophet\nsaid, \"By Allah, this world is less in the sight of Allah than this goat\nis to you.\""}},{"id":12,"idInBook":12,"chapterId":41,"bookId":15,"arabic":"حَدَّثَنَا عُثْمَانُ الْمُؤَذِّنُ، قَالَ‏:‏ حَدَّثَنَا عَوْفٌ، عَنِ الْحَسَنِ، عَنْ عُتَيِّ بْنِ ضَمْرَةَ قَالَ‏:‏ رَأَيْتُ عِنْدَ أُبَيٍّ رَجُلاً تَعَزَّى بِعَزَاءِ الْجَاهِلِيَّةِ، فَأَعَضَّهُ أُبَيٌّ وَلَمْ يُكْنِهِ، فَنَظَرَ إِلَيْهِ أَصْحَابُهُ، قَالَ‏:‏ كَأَنَّكُمْ أَنْكَرْتُمُوهُ‏؟‏ فَقَالَ‏:‏ إِنِّي لاَ أَهَابُ فِي هَذَا أَحَدًا أَبَدًا، إِنِّي سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ‏:‏ مَنْ تَعَزَّى بِعَزَاءِ الْجَاهِلِيَّةِ فَأَعِضُّوهُ وَلا تَكْنُوهُ‏.‏","english":{"narrator":"","text":"'Utayy ibn Damura said, \"I saw with Ubay a man who was attributing himself (in lineage) with an attribution of Jahiliyyah, so Ubay told him to bite his father's male organ and did not speak figuratively (i.e. was explicit). So his companions looked at him. He said, 'It appears that you disapprove of it.' Then he said,\n'I will never show apprehension to anyone with regards to this. Verily, I heard the Prophet, may Allah\nbless him and grant him peace, say, \"Whomever attributes himself (in lineage) with an attribution of Jahiliyyah, then tell him to bite his father's male organ and do not speak figuratively (i.e. be explicit).\" ' \""}},{"id":13,"idInBook":13,"chapterId":41,"bookId":15,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي إِسْحَاقَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَعْدٍ قَالَ‏:‏ خَدِرَتْ رِجْلُ ابْنِ عُمَرَ، فَقَالَ لَهُ رَجُلٌ‏:‏ اذْكُرْ أَحَبَّ النَّاسِ إِلَيْكَ، فَقَالَ‏:‏ يَا مُحَمَّدُ‏.‏","english":{"narrator":"","text":"'Abdu'r-Rahman ibn Sa'd said, \"Ibn 'Umar's foot went to sleep and\na man said to him, 'Mention the person you love most.' He said, 'Muhammad.'\""}}],"chapter":{"id":41,"bookId":15,"arabic":"كتاب الحركات","english":"Gestures"}}