{"metadata":{"length":87,"arabic":{"title":"الأدب المفرد","author":"الإمام محمد بن إسماعيل البخاري","introduction":"كتاب السَّلامِ"},"english":{"title":"Al-Adab Al-Mufrad","author":"Imam Muhammad ibn Ismail al-Bukhari","introduction":"Greetings"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ‏:‏ حَدَّثَنَا يَحْيَى، عَنْ عُثْمَانَ بْنِ غِيَاثٍ، قَالَ‏:‏ حَدَّثَنَا أَبُو عُثْمَانَ، عَنْ أَبِي مُوسَى، أَنَّهُ كَانَ مَعَ النَّبِيِّ صلى الله عليه وسلم فِي حَائِطٍ مِنْ حِيطَانِ الْمَدِينَةِ، وَفِي يَدِ النَّبِيِّ صلى الله عليه وسلم عُودٌ يَضْرِبُ بِهِ مِنَ الْمَاءِ وَالطِّينِ، فَجَاءَ رَجُلٌ يَسْتَفْتِحُ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ افْتَحْ لَهُ، وَبَشِّرْهُ بِالْجَنَّةِ، فَذَهَبَ، فَإِذَا أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ، فَفَتَحْتُ لَهُ، وَبَشَّرْتُهُ بِالْجَنَّةِ‏.‏ ثُمَّ اسْتَفْتَحَ رَجُلٌ آخَرُ، فَقَالَ‏:‏ افْتَحْ لَهُ، وَبَشِّرْهُ بِالْجَنَّةِ، فَإِذَا عُمَرُ رَضِيَ اللَّهُ عَنْهُ، فَفَتَحْتُ لَهُ، وَبَشَّرْتُهُ بِالْجَنَّةِ‏.‏ ثُمَّ اسْتَفْتَحَ رَجُلٌ آخَرُ، وَكَانَ مُتَّكِئًا فَجَلَسَ، وَقَالَ‏:‏ افْتَحْ لَهُ، وَبَشِّرْهُ بِالْجَنَّةِ عَلَى بَلْوَى تُصِيبُهُ، أَوْ تَكُونُ، فَذَهَبْتُ، فَإِذَا عُثْمَانُ، فَفَتَحْتُ لَهُ، فَأَخْبَرْتُهُ بِالَّذِي قَالَ، قَالَ‏:‏ اللَّهُ الْمُسْتَعَانُ‏.‏","english":{"narrator":"","text":"It is related that Abu Musa was with the Prophet, may Allah bless\nhim and grant him peace, in one of the gardens of Madina. He said, \"The\nProphet, may Allah bless him and grant him peace, had a twig in his hand\nwith which he was striking the water and mud. A man came and asked for\nthe garden to be opened, and the Prophet, may Allah bless him and grant\nhim peace, said, 'Open it for him and give him the good news of the Garden.'\nI went and it was Abu Bakr, may Allah be pleased with him. I opened the\ngate for him and gave him the good news of the Garden. Then another man\nasked to be let in and the Prophet, may Allah bless him and grant him peace,\nsaid, 'Open the door and give him the good news of the Garden.' It was\n'Umar, may Allah be pleased with him, and I let him in and gave him the\ngood news of the Garden. Then yet another man asked to be let in. The Prophet\nhad been reclining, but he then sat up and said, 'Open it for him and give\nhim the good news of the Garden along with an affliction which will befall\nhim ? or which will happen.' I went and it was 'Uthman, I opened the door\nand told him what the Prophet had said. He said, 'Allah is the One who\nis asked for help. '\""}},{"id":2,"idInBook":2,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا ابْنُ شَيْبَةَ، قَالَ‏:‏ حَدَّثَنَا ابْنُ نُبَاتَةَ، عَنْ سَلَمَةَ بْنِ وَرْدَانَ قَالَ‏:‏ رَأَيْتُ أَنَسَ بْنَ مَالِكٍ يُصَافِحُ النَّاسَ، فَسَأَلَنِي‏:‏ مَنْ أَنْتَ‏؟‏ فَقُلْتُ‏:‏ مَوْلًى لِبَنِي لَيْثٍ، فَمَسَحَ عَلَى رَأْسِي ثَلاَثًا وَقَالَ‏:‏ بَارَكَ اللَّهُ فِيكَ‏.‏","english":{"narrator":"","text":"Salama ibn Wardan said, \"I saw Anas ibn Malik shake hands with\nsome people and he asked me, 'And who are you?' I said, 'The mawla of the\nBanu Layth.' He stroked my head three times and said, 'May Allah bless\nyou.'\""}},{"id":3,"idInBook":3,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا حَجَّاجٌ، قَالَ‏:‏ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ حُمَيْدٍ، عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ‏:‏ لَمَّا جَاءَ أَهْلُ الْيَمَنِ قَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ قَدْ أَقْبَلَ أَهْلُ الْيَمَنِ وَهُمْ أَرَقُّ قُلُوبًا مِنْكُمْ، فَهُمْ أَوَّلُ مَنْ جَاءَ بِالْمُصَافَحَةِ‏.‏","english":{"narrator":"","text":"Anas ibn Malik said, \"When the people of Yemen came, the Prophet,\nmay Allah bless him and grant him peace, said, 'The people of Yemen have\narrived and they have gentler hearts than you. They are the first to offer\nthe handshake.'\""}},{"id":4,"idInBook":4,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، قَالَ‏:‏ حَدَّثَنَا إِسْمَاعِيلُ بْنُ زَكَرِيَّا، عَنْ أَبِي جَعْفَرٍ الْفَرَّاءِ، عَنْ عَبْدِ اللهِ بْنِ يَزِيدَ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ قَالَ‏:‏ مِنْ تَمَامِ التَّحِيَّةِ أَنْ تُصَافِحَ أَخَاكَ‏.‏","english":{"narrator":"","text":"Al-Bara' ibn 'Azib said, \"Part of the full greeting is to shake\nyour brother's hand.\""}},{"id":5,"idInBook":5,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ أَبِي الأَسْوَدِ، قَالَ‏:‏ حَدَّثَنَا إِبْرَاهِيمُ بْنُ مَرْزُوقٍ الثَّقَفِيُّ قَالَ‏:‏ حَدَّثَنِي أَبِي، وَكَانَ لِعَبْدِ اللهِ بْنِ الزُّبَيْرِ فَأَخَذَهُ الْحَجَّاجُ مِنْهُ، قَالَ‏:‏ كَانَ عَبْدُ اللهِ بْنُ الزُّبَيْرِ بَعَثَنِي إِلَى أُمِّهِ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ فَأُخْبِرُهَا بِمَا يُعَامِلُهُمْ حَجَّاجٌ، وَتَدْعُو لِي، وَتَمْسَحُ رَأْسِي، وَأَنَا يَوْمَئِذٍ وَصِيفٌ‏.‏","english":{"narrator":"","text":"Ibrahim ibn Marzuq ath-Thaqafi related that his father (who had\nbelonged to Allah ibn az-Zubayr) told him, \"'Abdullah ibn az-Zubayr sent\nme to his mother, Asma' bint Abi Bakr and he told her how al-Hajjaj was\ntreating them. She made supplication for me and stroked my head. I was\na young boy at that time.\""}},{"id":6,"idInBook":6,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى، قَالَ‏:‏ حَدَّثَنَا هَمَّامٌ، عَنِ الْقَاسِمِ بْنِ عَبْدِ الْوَاحِدِ، عَنِ ابْنِ عَقِيلٍ، أَنَّ جَابِرَ بْنَ عَبْدِ اللهِ حَدَّثَهُ، أَنَّهُ بَلَغَهُ حَدِيثٌ عَنْ رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم، فَابْتَعْتُ بَعِيرًا فَشَدَدْتُ إِلَيْهِ رَحْلِي شَهْرًا، حَتَّى قَدِمْتُ الشَّامَ، فَإِذَا عَبْدُ اللهِ بْنُ أُنَيْسٍ، فَبَعَثْتُ إِلَيْهِ أَنَّ جَابِرًا بِالْبَابِ، فَرَجَعَ الرَّسُولُ فَقَالَ‏:‏ جَابِرُ بْنُ عَبْدِ اللهِ‏؟‏ فَقُلْتُ‏:‏ نَعَمْ، فَخَرَجَ فَاعْتَنَقَنِي، قُلْتُ‏:‏ حَدِيثٌ بَلَغَنِي لَمْ أَسْمَعْهُ، خَشِيتُ أَنْ أَمُوتَ أَوْ تَمُوتَ، قَالَ‏:‏ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ‏:‏ يَحْشُرُ اللَّهُ الْعِبَادَ، أَوِ النَّاسَ، عُرَاةً غُرْلاً بُهْمًا، قُلْتُ‏:‏ مَا بُهْمًا‏؟‏ قَالَ‏:‏ لَيْسَ مَعَهُمْ شَيْءٌ، فَيُنَادِيهِمْ بِصَوْتٍ يَسْمَعُهُ مَنْ بَعُدَ، أَحْسَبُهُ قَالَ‏:‏ كَمَا يَسْمَعُهُ مَنْ قَرُبَ‏:‏ أَنَا الْمَلِكُ، لاَ يَنْبَغِي لأَحَدٍ مِنْ أَهْلِ الْجَنَّةِ يَدْخُلُ الْجَنَّةَ وَأَحَدٌ مِنْ أَهْلِ النَّارِ يَطْلُبُهُ بِمَظْلَمَةٍ، وَلاَ يَنْبَغِي لأَحَدٍ مِنْ أَهْلِ النَّارِ يَدْخُلُ النَّارَ وَأَحَدٌ مِنْ أَهْلِ الْجَنَّةِ يَطْلُبُهُ بِمَظْلَمَةٍ، قُلْتُ‏:‏ وَكَيْفَ‏؟‏ وَإِنَّمَا نَأْتِي اللَّهَ عُرَاةً بُهْمًا‏؟‏ قَالَ‏:‏ بِالْحَسَنَاتِ وَالسَّيِّئَاتِ‏.‏","english":{"narrator":"","text":"Jabir ibn 'Abdullah said, \"I purchased a camel and rode it hard\nfor a month until I reached Syria. 'Abdullah ibn Unays was there, and I\nsent word to him, saying, 'Jabir is at the door.' The messenger returned\nand said, 'Jabir ibn 'Abdullah?' 'Yes,' I replied. So 'Abdullah came out\nand embraced me. I said, 'A hadith reached me which I had not heard before\nand I feared that one of us might die.'\" He went on, \"I heard the Prophet,\nmay Allah bless him and grant him peace, say, 'Allah will gather His slaves\n? or people ? naked, uncircumcised, without anything.' We asked, 'What\nis meant by \"without anything\"?' The Prophet said, 'They will have nothing\nwith them.' (The Prophet went on,) 'They will be called by a voice that\nis heard from afar (and I think that he said, 'as if it was from close\nat hand'), saying, \"I am the King. None of the people of the Garden will\nenter the Garden while any of the people of the Fire are seeking him for\nsome injustice he did to him. None of the people of the Fire will enter\nthe Fire while any of the people of the Garden are seeking him for an injustice\nhe did to him.\"' I asked, 'How is this? We come to Allah naked and without\nany worldly goods?' He said, 'This applies to good actions and evil actions.'\""}},{"id":7,"idInBook":7,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ‏:‏ حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، قَالَ‏:‏ حَدَّثَنَا إِسْرَائِيلُ، عَنْ مَيْسَرَةَ بْنِ حَبِيبٍ، عَنِ الْمِنْهَالِ بْنِ عَمْرٍو، عَنْ عَائِشَةَ بِنْتِ طَلْحَةَ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ قَالَتْ‏:‏ مَا رَأَيْتُ أَحَدًا كَانَ أَشْبَهَ حَدِيثًا وَكَلاَمًا بِرَسُولِ اللهِ صلى الله عليه وسلم مِنْ فَاطِمَةَ، وَكَانَتْ إِذَا دَخَلَتْ عَلَيْهِ قَامَ إِلَيْهَا، فَرَحَّبَ بِهَا وَقَبَّلَهَا، وَأَجْلَسَهَا فِي مَجْلِسِهِ، وَكَانَ إِذَا دَخَلَ عَلَيْهَا قَامَتْ إِلَيْهِ فَأَخَذَتْ بِيَدِهِ، فَرَحَّبَتْ بِهِ وَقَبَّلَتْهُ، وَأَجْلَسَتْهُ فِي مَجْلِسِهَا، فَدَخَلَتْ عَلَيْهِ فِي مَرَضِهِ الَّذِي تُوُفِّيَ، فَرَحَّبَ بِهَا وَقَبَّلَهَا‏.‏","english":{"narrator":"","text":"`A'isha, the Umm al-Mu'minin, said, \"I did not see anyone who more\nresembled the Messenger of Allah, may Allah bless him and grant him peace,\nin manner of speaking than Fatima. When she came to him, he stood up for\nher, made her welcome, kissed her and had her sit in his place. When the\nProphet came to her, she stood up for him, took his hand, made him welcome,\nkissed him, and made him sit in her place. She came to him during his final\nillness and he greeted her and kissed her.\""}},{"id":8,"idInBook":8,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى، قَالَ‏:‏ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنِ ابْنِ عُمَرَ قَالَ‏:‏ كُنَّا فِي غَزْوَةٍ، فَحَاصَ النَّاسُ حَيْصَةً، قُلْنَا‏:‏ كَيْفَ نَلْقَى النَّبِيَّ صلى الله عليه وسلم وَقَدْ فَرَرْنَا‏؟‏ فَنَزَلَتْ‏:‏ ‏{‏إِلاَّ مُتَحَرِّفًا لِقِتَالٍ‏}‏، فَقُلْنَا‏:‏ لاَ نَقْدِمُ الْمَدِينَةَ، فَلاَ يَرَانَا أَحَدٌ، فَقُلْنَا‏:‏ لَوْ قَدِمْنَا، فَخَرَجَ النَّبِيُّ صلى الله عليه وسلم مِنْ صَلاَةِ الْفَجْرِ، قُلْنَا‏:‏ نَحْنُ الْفَرَّارُونَ، قَالَ‏:‏ أَنْتُمُ الْعَكَّارُونَ، فَقَبَّلْنَا يَدَهُ، قَالَ‏:‏ أَنَا فِئَتُكُمْ‏.‏","english":{"narrator":"","text":"Ibn 'Umar said, \"We were on a raid and the people fled. We said,\n'How can we meet the Prophet, may Allah bless him and grant him peace,\nwhen we have run away? It has been revealed, \"unless he is withdrawing\nto rejoin the fight\" (8:16).\" We said, 'We will not go to Madina and\nthen no one will see us.' Then we said, 'Perhaps we should go.' The Prophet,\nmay Allah bless him and grant him peace, came from the Fajr prayer and\nwe said, 'We fled.' He said, 'You are those rejoining the fight.\"' We kissed\nhis hand. He said, 'I am your group.*'\""}},{"id":9,"idInBook":9,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ، قَالَ‏:‏ حَدَّثَنَا عَطَّافُ بْنُ خَالِدٍ قَالَ‏:‏ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ رَزِينٍ قَالَ‏:‏ مَرَرْنَا بِالرَّبَذَةِ فَقِيلَ لَنَا‏:‏ هَا هُنَا سَلَمَةُ بْنُ الأَكْوَعِ، فَأَتَيْنَاهُ فَسَلَّمْنَا عَلَيْهِ، فَأَخْرَجَ يَدَيْهِ فَقَالَ‏:‏ بَايَعْتُ بِهَاتَيْنِ نَبِيَّ اللهِ صلى الله عليه وسلم، فَأَخْرَجَ كَفًّا لَهُ ضَخْمَةً كَأَنَّهَا كَفُّ بَعِيرٍ، فَقُمْنَا إِلَيْهَا فَقَبَّلْنَاهَا‏.‏","english":{"narrator":"","text":"'Abdu'r-Rahman ibn Razin said, \"We passed by az-Zubda and were\ntold, 'There is Salama ibn al-Akwa'. I went to him and he greeted us. Then\nhe brought out his hands and stated, 'With these two hands I offered allegiance\nto the Messenger of Allah, may Allah bless him and grant him peace.' He\nheld out his palm which was as huge as a camel's foot, and we got up and\nkissed it.\""}},{"id":10,"idInBook":10,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا ابْنُ عُيَيْنَةَ، عَنِ ابْنِ جُدْعَانَ، قَالَ ثَابِتٌ لأَنَسٍ‏:‏ أَمَسَسْتَ النَّبِيَّ صلى الله عليه وسلم بِيَدِكَ‏؟‏ قَالَ‏:‏ نَعَمْ، فَقَبَّلَهَا‏.‏","english":{"narrator":"","text":"Anas was asked, \"Did you touch the Prophet, may Allah bless him\nand grant him peace, with your hand?\" He replied, \"Yes,\" so they kissed\nit."}},{"id":11,"idInBook":11,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ‏:‏ حَدَّثَنَا مَطَرُ بْنُ عَبْدِ الرَّحْمَنِ الأَعْنَقُ قَالَ‏:‏ حَدَّثَتْنِي امْرَأَةٌ مِنْ صَبَاحِ عَبْدِ الْقَيْسِ يُقَالُ لَهَا‏:‏ أُمُّ أَبَانَ ابْنَةُ الْوَازِعِ، عَنْ جَدِّهَا، أَنَّ جَدَّهَا الْزَّارِعَ بْنَ عَامِرٍ قَالَ‏:‏ قَدِمْنَا فَقِيلَ‏:‏ ذَاكَ رَسُولُ اللهِ، فَأَخَذْنَا بِيَدَيْهِ وَرِجْلَيْهِ نُقَبِّلُهَا‏.‏","english":{"narrator":"","text":"Al-Wazi' ibn 'Amir said, \"We came and were told, 'That is the Messenger\nof Allah.' We took his hands and feet and kissed them.\""}},{"id":12,"idInBook":12,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ الْمُبَارَكِ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ بْنُ حَبِيبٍ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، قَالَ‏:‏ حَدَّثَنَا عَمْرٌو، عَنْ ذَكْوَانَ، عَنْ صُهَيْبٍ قَالَ‏:‏ رَأَيْتُ عَلِيًّا يُقَبِّلُ يَدَ الْعَبَّاسِ وَرِجْلَيْهِ‏.‏","english":{"narrator":"","text":"Suhayb said, \"I saw 'Ali kiss the hands and feet of al-'Abbas.\""}},{"id":13,"idInBook":13,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا آدَمُ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، وَحَدَّثَنَا حَجَّاجٌ، قَالَ‏:‏ حَدَّثَنَا حَمَّادٌ، قَالَ‏:‏ حَدَّثَنَا حَبِيبُ بْنُ الشَّهِيدِ قَالَ‏:‏ سَمِعْتُ أَبَا مِجْلَزٍ يَقُولُ‏:‏ إِنَّ مُعَاوِيَةَ خَرَجَ، وَعَبْدُ اللهِ بْنُ عَامِرٍ وَعَبْدُ اللهِ بْنُ الزُّبَيْرِ قُعُودٌ، فَقَامَ ابْنُ عَامِرٍ، وَقَعَدَ ابْنُ الزُّبَيْرِ، وَكَانَ أَرْزَنَهُمَا، قَالَ مُعَاوِيَةُ‏:‏ قَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ مَنْ سَرَّهُ أَنْ يَمْثُلَ لَهُ عِبَادُ اللهِ قِيَامًا، فَلْيَتَبَوَّأْ بَيْتًا مِنَ النَّارِ‏.‏","english":{"narrator":"","text":"Abu Mijaz said, \"Mu'awiya came while 'Abdullah ibn 'Amir and 'Abdullah\nibn az-Zubayr were seated. Ibn 'Amir got up while Ibn az-Zubayr remained\nseated, and he was weightier of the two. Mu'awiya said, 'The Prophet, may\nAllah bless him and grant him peace, said, \"Whoever likes to have the slaves\nof Allah stand up out of respect for him should take his place in the Fire.\"'\""}},{"id":14,"idInBook":14,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَ‏:‏ أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ خَلَقَ اللَّهُ آدَمَ صلى الله عليه وسلم عَلَى صُورَتِهِ، وَطُولُهُ سِتُّونَ ذِرَاعًا، ثُمَّ قَالَ‏:‏ اذْهَبْ، فَسَلِّمْ عَلَى أُولَئِكَ، نَفَرٌ مِنَ الْمَلاَئِكَةِ جُلُوسٌ، فَاسْتَمِعْ مَا يُحَيُّونَكَ بِهِ فَإِنَّهَا تَحِيَّتُكَ وَتَحِيَّةُ ذُرِّيَّتِكَ، فَقَالَ‏:‏ السَّلاَمُ عَلَيْكُمْ، فَقَالُوا‏:‏ السَّلاَمُ عَلَيْكَ وَرَحْمَةُ اللهِ، فَزَادُوهُ‏:‏ وَرَحْمَةُ اللهِ، فَكُلُّ مَنْ يَدْخُلُ الْجَنَّةَ عَلَى صُورَتِهِ، فَلَمْ يَزَلْ يَنْقُصُ الْخَلْقُ حَتَّى الآنَ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"Allah created Adam, may Allah bless him and grant\nhim peace, and his height was 60 spans. He said, 'Go and greet those (a\ngroup of angels who were sitting down) and listen to how they answer you.\nIt is your greeting and the greeting of your descendants.' He said, 'Peace\nbe upon you,' and they replied, 'Peace be upon you and the mercy of Allah.'\nThey added, 'and the mercy of Allah'. All who enter the Garden will have\nhis form, but creation has continued to decline until now.'\""}},{"id":15,"idInBook":15,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْوَاحِدِ، عَنْ قِنَانَ بْنِ عَبْدِ اللهِ النَّهْمِيِّ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْسَجَةَ، عَنِ الْبَرَاءِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ أَفْشُوا السَّلامَ تَسْلَمُوا‏.‏","english":{"narrator":"","text":"Al-Bara' reported that the Prophet, may Allah bless him and grant\nhim peace, said, \"Make the greeting common practice among you and you will\nbe safe.\""}},{"id":16,"idInBook":16,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدِ اللهِ، قَالَ‏:‏ حَدَّثَنَا ابْنُ أَبِي حَازِمٍ، وَالْقَعْنَبِيُّ، عَنْ عَبْدِ الْعَزِيزِ، عَنِ الْعَلاَءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ لاَ تَدْخُلُوا الْجَنَّةَ حَتَّى تُؤْمِنُوا، وَلاَ تُؤْمِنُوا حَتَّى تَحَابُّوا، أَلاَ أَدُلُّكُمْ عَلَى مَا تَحَابُّونَ بِهِ‏؟‏ قَالُوا‏:‏ بَلَى، يَا رَسُولَ اللهِ، قَالَ‏:‏ أَفْشُوا السَّلامَ بَيْنَكُمْ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"You will not enter the Garden until you believe\nand you will not believe until you love one another. Shall I tell you something\nthe doing of which will give you love of one another?\" \"Yes, Messenger\nof Allah,\" they replied. The Prophet said, \"Make the greeting common practice\namong you.\""}},{"id":17,"idInBook":17,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلِ بْنِ غَزْوَانَ، عَنْ عَطَاءِ بْنِ السَّائِبِ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللهِ بْنِ عَمْرٍو قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ اعْبُدُوا الرَّحْمَنَ، وَأَطْعِمُوا الطَّعَامَ، وَأَفْشُوا السَّلاَمَ، تَدْخُلُوا الْجِنَانَ‏.‏","english":{"narrator":"","text":"'Abdullah ibn 'Amr reported that the Messenger of Allah, may Allah\nbless him and grant him peace, said, \"Worship the All-Merciful and feed\npeople. Make the greeting common practice among you and you will enter\nthe Garden.\""}},{"id":18,"idInBook":18,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، عَنْ سَعِيدِ بْنِ عُبَيْدٍ، عَنْ بُشَيْرِ بْنِ يَسَارٍ قَالَ‏:‏ مَا كَانَ أَحَدٌ يَبْدَأُ، أَوْ يَبْدُرُ، ابْنَ عُمَرَ بِالسَّلامِ‏.‏","english":{"narrator":"","text":"Bashir ibn Yasar said, \"No one preceded ? or got ahead of ? Ibn\n'Umar when giving the greeting.\""}},{"id":19,"idInBook":19,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، قَالَ‏:‏ أَخْبَرَنَا مَخْلَدُ بْنُ يَزِيدَ، قَالَ‏:‏ أَخْبَرَنَا ابْنُ جُرَيْجٍ قَالَ‏:‏ أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرًا يَقُولُ‏:‏ يُسَلِّمُ الرَّاكِبُ عَلَى الْمَاشِي، وَالْمَاشِي عَلَى الْقَاعِدِ، وَالْمَاشِيَانِ أَيُّهُمَا يَبْدَأُ بِالسَّلامِ فَهُوَ أَفْضَلُ‏.‏","english":{"narrator":"","text":"Jabir said, \" \"Someone riding should greet someone walking, and\nsomeone walking should greet someone sitting down. When there are two people\nwalking, the better of them is the one who gives the greeting first.\""}},{"id":20,"idInBook":20,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ قَالَ‏:‏ حَدَّثَنِي أَخِي، عَنْ سُلَيْمَانَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللهِ بْنِ أَبِي عَتِيقٍ، عَنْ نَافِعٍ، أَنَّ ابْنَ عُمَرَ أَخْبَرَهُ، أَنَّ الأَغَرَّ، وَهُوَ رَجُلٌ مِنْ مُزَيْنَةَ، وَكَانَتْ لَهُ صُحْبَةٌ مَعَ النَّبِيِّ صلى الله عليه وسلم، كَانَتْ لَهُ أَوْسُقٌ مِنْ تَمْرٍ عَلَى رَجُلٍ مِنْ بَنِي عَمْرِو بْنِ عَوْفٍ، اخْتَلَفَ إِلَيْهِ مِرَارًا، قَالَ‏:‏ فَجِئْتُ إِلَى النَّبِيِّ صلى الله عليه وسلم، فَأَرْسَلَ مَعِي أَبَا بَكْرٍ الصِّدِّيقَ، قَالَ‏:‏ فَكُلُّ مَنْ لَقِينَا سَلَّمُوا عَلَيْنَا، فَقَالَ أَبُو بَكْرٍ‏:‏ أَلاَ تَرَى النَّاسَ يَبْدَأُونَكَ بِالسَّلاَمِ فَيَكُونُ لَهُمُ الأَجْرُ‏؟‏ ابْدَأْهُمْ بِالسَّلاَمِ يَكُنْ لَكَ الأَجْرُ يُحَدِّثُ هَذَا ابْنُ عُمَرَ عَنْ نَفْسِهِ‏.‏","english":{"narrator":"","text":"Ibn 'Umar said that al-Agharr (who was a man from Muzayna and had\nbeen a Companion of the Prophet) was owed some measures of dates by a man\nfrom the Banu 'Amr ibn 'Awf who came to him many times. He said, \"I went\nto the Prophet, may Allah bless him and grant him peace, and he sent Abu\nBakr as-Siddiq with me.\" He continues, \"Everyone we met greeted us. Abu\nBakr said, 'Don't you know that when people give the greeting before us,\nthey have the reward? Give the greeting before them and you will have the\nreward.'\""}},{"id":21,"idInBook":21,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ يُوسُفَ، وَالْقَعْنَبِيُّ، قَالاَ‏:‏ أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عَطَاءِ بْنِ يَزِيدَ، عَنْ أَبِي أَيُّوبَ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم قَالَ‏:‏ لاَ يَحِلُّ لِامْرِئٍ مُسْلِمٍ أَنْ يَهْجُرَ أَخَاهُ فَوْقَ ثَلاَثٍ، فَيَلْتَقِيَانِ فَيُعْرِضُ هَذَا وَيُعْرِضُ هَذَا، وَخَيْرُهُمَا الَّذِي يَبْدَأُ بِالسَّلامِ‏.‏","english":{"narrator":"","text":"Abu Ayyub reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"It is not lawful for a Muslim man to separate\nhimself from his brother for more than three days. When they meet, and\none turns away and the other turns away, the better of them is the one\nwho gives the greeting first.\""}},{"id":22,"idInBook":22,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللهِ قَالَ‏:‏ حَدَّثَنِي مُحَمَّدُ بْنُ جَعْفَرِ بْنِ أَبِي كَثِيرٍ، عَنْ يَعْقُوبَ بْنِ زَيْدٍ التَّيْمِيِّ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَجُلاً مَرَّ عَلَى رَسُولِ اللهِ صلى الله عليه وسلم وَهُوَ فِي مَجْلِسٍ فَقَالَ‏:‏ السَّلاَمُ عَلَيْكُمْ، فَقَالَ‏:‏ عَشْرُ حَسَنَاتٍ، فَمَرَّ رَجُلٌ آخَرُ فَقَالَ‏:‏ السَّلاَمُ عَلَيْكُمْ وَرَحْمَةُ اللهِ، فَقَالَ‏:‏ عِشْرُونَ حَسَنَةً، فَمَرَّ رَجُلٌ آخَرُ فَقَالَ‏:‏ السَّلاَمُ عَلَيْكُمْ وَرَحْمَةُ اللهِ وَبَرَكَاتُهُ، فَقَالَ‏:‏ ثَلاَثُونَ حَسَنَةً، فَقَامَ رَجُلٌ مِنَ الْمَجْلِسِ وَلَمْ يُسَلِّمْ، فَقَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ مَا أَوْشَكَ مَا نَسِيَ صَاحِبُكُمْ، إِذَا جَاءَ أَحَدُكُمُ الْمَجْلِسَ فَلْيُسَلِّمْ، فَإِنْ بَدَا لَهُ أَنْ يَجْلِسَ فَلْيَجْلِسْ، وَإِذَا قَامَ فَلْيُسَلِّمْ، مَا الأُولَى بِأَحَقَّ مِنَ الآخِرَةِ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that a man passed by the Messenger of Allah,\nmay Allah bless him and grant him peace, while hew as in an assembly and\nsaid, \"Peace be upon you.\" \"Ten good deeds,\" he said. Another man passed\nby and said, \"Peace be upon you and the mercy of Allah.\" The Prophet said,\n\"Twenty good deeds.\" Then yet another man passed by and said, \"Peace be\nupon you and the mercy of Allah and His blessing,\" and the Prophet said,\n\"Thirty good deeds.\" Then a man in the gathering got up and did not give\nthe greeting. The Messenger of Allah, may Allah bless him and grant him\npeace, said, \"How quickly your companion forgets! When one of you comes\nto an assembly, he should give the greeting. If he thinks he should sit\ndown, he sits down. When he stands up, he gives the greeting. Neither is\na greater duty than the other.\""}},{"id":23,"idInBook":23,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الْمَلِكِ بْنِ مَيْسَرَةَ، عَنْ زَيْدِ بْنِ وَهْبٍ، عَنْ عُمَرَ قَالَ‏:‏ كُنْتُ رَدِيفَ أَبِي بَكْرٍ، فَيَمُرُّ عَلَى الْقَوْمِ فَيَقُولُ‏:‏ السَّلاَمُ عَلَيْكُمْ، فَيَقُولُونَ‏:‏ السَّلاَمُ عَلَيْكُمْ وَرَحْمَةُ اللهِ، وَيَقُولُ‏:‏ السَّلاَمُ عَلَيْكُمْ وَرَحْمَةُ اللهِ، فَيَقُولُونَ‏:‏ السَّلاَمُ عَلَيْكُمْ وَرَحْمَةُ اللهِ وَبَرَكَاتُهُ، فَقَالَ أَبُو بَكْرٍ‏:‏ فَضَلَنَا النَّاسُ الْيَوْمَ بِزِيَادَةٍ كَثِيرَةٍ‏.‏","english":{"narrator":"","text":"'Umar said, \"I was riding behind Abu Bakr and he passed by some\npeople. He said, 'Peace be upon you.' They said, 'Peace be upon you and\nthe mercy of Allah.' He said, 'Peace be upon you and the mercy of Allah.'\nThey said, 'Peace be upon you and the mercy of Allah and His blessings.'\nAbu Bakr said, 'Today the people have been very much better than us.'\""}},{"id":24,"idInBook":24,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا إِسْحَاقُ، قَالَ‏:‏ أَخْبَرَنَا عَبْدُ الصَّمَدِ، قَالَ‏:‏ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، عَنْ رَسُولِ اللهِ صلى الله عليه وسلم قَالَ‏:‏ مَا حَسَدَكُمُ الْيَهُودُ عَلَى شَيْءٍ مَا حَسَدُوكُمْ عَلَى السَّلامِ وَالتَّأْمِينِ‏.‏","english":{"narrator":"","text":"'A'isha reported that the Messenger of Allah, may Allah bless him\nand grant him peace, said, \"The Jews do not envy you for anything the way\nthat they envy you for the salam and the Amin.\""}},{"id":25,"idInBook":25,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا شِهَابٌ، قَالَ‏:‏ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ إِنَّ السَّلامَ اسْمٌ مِنْ أَسْمَاءِ اللهِ تَعَالَى، وَضَعَهُ اللَّهُ فِي الأَرْضِ، فَأَفْشُوا السَّلامَ بَيْنَكُمْ‏.‏","english":{"narrator":"","text":"Anas reported that the Messenger of Allah, may Allah bless him\nand grant him peace, said, \"As-Salam (peace) is one of the Names\nof Allah Almighty which Allah has placed in the earth. Therefore give the\ngreeting among yourselves.\""}},{"id":26,"idInBook":26,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ‏:‏ حَدَّثَنَا مُحِلٌّ قَالَ‏:‏ سَمِعْتُ شَقِيقَ بْنَ سَلَمَةَ أَبَا وَائِلٍ يَذْكُرُ، عَنِ ابْنِ مَسْعُودٍ قَالَ‏:‏ كَانُوا يُصَلُّونَ خَلْفَ النَّبِيِّ صلى الله عليه وسلم قَالَ الْقَائِلُ‏:‏ السَّلاَمُ عَلَى اللهِ، فَلَمَّا قَضَى النَّبِيُّ صلى الله عليه وسلم صَلاَتَهُ قَالَ‏:‏ مَنِ الْقَائِلُ‏:‏ السَّلاَمُ عَلَى اللهِ‏؟‏ إِنَّ اللَّهَ هُوَ السَّلاَمُ، وَلَكِنْ قُولُوا‏:‏ التَّحِيَّاتُ لِلَّهِ وَالصَّلَوَاتُ وَالطَّيِّبَاتُ، السَّلاَمُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللهِ وَبَرَكَاتُهُ، السَّلاَمُ عَلَيْنَا وَعَلَى عِبَادِ اللهِ الصَّالِحِينَ، أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ، وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ قَالَ‏:‏ وَقَدْ كَانُوا يَتَعَلَّمُونَهَا كَمَا يَتَعَلَّمُ أَحَدُكُمُ السُّورَةَ مِنَ الْقُرْآنِ‏.‏","english":{"narrator":"","text":"Ibn Mas'ud said, \" They were doing the prayer with the Prophet,\nmay Allah bless him and grant him peace, and someone said, 'Peace be upon\nAllah.' When the Prophet, may Allah bless him and grant him peace, finished\nthe prayer, he said, 'Who said \"Peace be upon Allah\"? Allah is Peace. Rather\nsay, \"Greetings belong to Allah and good words and prayers. Peace be upon\nyou, O Prophet and the mercy of Allah and His blessings. Peace be upon\nus and upon all the right-acting slaves of Allah. I testify that there\nis no god but Allah and I testify that Muhammad is His slave and Messenger.\"'\""}},{"id":27,"idInBook":27,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ، قَالَ‏:‏ حَدَّثَنَا مَالِكٌ، عَنِ الْعَلاَءِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ حَقُّ الْمُسْلِمِ عَلَى الْمُسْلِمِ سِتٌّ، قِيلَ‏:‏ وَمَا هِيَ‏؟‏ قَالَ‏:‏ إِذَا لَقِيتُهُ فَسَلِّمْ عَلَيْهِ، وَإِذَا دَعَاكَ فَأَجِبْهُ، وَإِذَا اسْتَنْصَحَكَ فَانْصَحْ لَهُ، وَإِذَا عَطَسَ فَحَمِدَ اللَّهَ فَشَمِّتْهُ، وَإِذَا مَرِضَ فَعُدْهُ، وَإِذَا مَاتَ فَاصْحَبْهُ‏.‏","english":{"narrator":"","text":"Abu Hurayra said, \"I heard the Messenger of Allah, may Allah bless\nhim and grant him peace, say, 'The rights a Muslim has over another Muslim\nare six.\" He was asked, \"What are they?\" He replied, \"When he meets him,\nhe should greet him, When he gives him an invitation, he should accept.\nWhen he asks him for advice, he should give him good counsel. When he sneezes\nand praises Allah, he should wish him mercy. when he is ill, he should\nvisit him. When he dies, he should accompany him.\""}},{"id":28,"idInBook":28,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا سَعِيدُ بْنُ الرَّبِيعِ، قَالَ‏:‏ حَدَّثَنَا عَلِيُّ بْنُ الْمُبَارَكِ، عَنْ يَحْيَى، قَالَ‏:‏ حَدَّثَنَا زَيْدُ بْنُ سَلاَّمٍ، عَنْ جَدِّهِ أَبِي سَلاَّمٍ، عَنْ أَبِي رَاشِدٍ الْحُبْرَانِيِّ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ شِبْلٍ قَالَ‏:‏ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ‏:‏ لِيُسَلِّمِ الرَّاكِبُ عَلَى الرَّاجِلِ، وَلْيُسَلِّمِ الرَّاجِلُ عَلَى الْقَاعِدِ، وَلْيُسَلِّمِ الأَقَلُّ عَلَى الأَكْثَرِ، فَمَنْ أَجَابَ السَّلاَمَ فَهُوَ لَهُ، وَمَنْ لَمْ يُجِبْ فَلا شَيْءَ لَهُ‏.‏","english":{"narrator":"","text":"'Abdu'r-Rahman ibn Shibl said that he heard the Prophet, may Allah\nbless him and grant him peace, said, \"The person riding should greet the\nperson on foot. The person on foot should greet the person who is seated.\nThe smaller group should greet the large. Whoever answers the greeting,\nthat is for him. Whoever does not answer it, has nothing.\""}},{"id":29,"idInBook":29,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا إِسْحَاقُ، قَالَ‏:‏ أَخْبَرَنَا رَوْحُ بْنُ عُبَادَةَ قَالَ‏:‏ أَخْبَرَنِي ابْنُ جُرَيْجٍ قَالَ‏:‏ أَخْبَرَنِي زِيَادٌ، أَنَّ ثَابِتًا أَخْبَرَهُ، وَهُوَ مَوْلَى عَبْدِ الرَّحْمَنِ، يَرْوِيهِ عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللهِ صلى الله عليه وسلم قَالَ‏:‏ يُسَلِّمُ الرَّاكِبُ عَلَى الْمَاشِي، وَالْمَاشِي عَلَى الْقَاعِدِ، وَالْقَلِيلُ عَلَى الْكَثِيرِ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"The person riding greets the person walking.\nThe person walking greets the person sitting. The small group greets the\nlarge group.\""}},{"id":30,"idInBook":30,"chapterId":42,"bookId":15,"arabic":"قَالَ ابْنُ جُرَيْجٍ‏:‏ فَأَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرًا يَقُولُ‏:‏ الْمَاشِيَانِ إِذَا اجْتَمَعَا فَأَيُّهُمَا بَدَأَ بِالسَّلاَمِ فَهُوَ أَفْضَلُ‏.‏","english":{"narrator":"","text":"Jabir said, \"When two people walking meet, then the one who gives\nthe greeting first is the better of them.\""}},{"id":31,"idInBook":31,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا نُعَيْمُ بْنُ حَمَّادٍ، قَالَ‏:‏ أَخْبَرَنَا ابْنُ الْمُبَارَكِ، قَالَ‏:‏ أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ يُسَلِّمُ الرَّاكِبُ عَلَى الْمَاشِي، وَالْمَاشِي عَلَى الْقَاعِدِ، وَالْقَلِيلُ عَلَى الْكَثِيرِ‏.‏","english":{"narrator":"","text":"See 993."}},{"id":32,"idInBook":32,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا أَصْبَغُ قَالَ‏:‏ أَخْبَرَنِي ابْنُ وَهْبٍ قَالَ‏:‏ أَخْبَرَنِي ابْنُ هَانِئٍ، عَنْ عَمْرِو بْنِ مَالِكٍ، عَنْ فَضَالَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ يُسَلِّمُ الْفَارِسُ عَلَى الْقَاعِدِ، وَالْقَلِيلُ عَلَى الْكَثِيرِ‏.‏","english":{"narrator":"","text":"Fadala reported that the Prophet, may Allah bless him and grant\nhim peace, said, \"The person riding greets the person sitting and the small\ngroup greets the larger.\""}},{"id":33,"idInBook":33,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، قَالَ‏:‏ أَخْبَرَنَا سُلَيْمَانُ بْنُ كَثِيرٍ، عَنْ حُصَيْنٍ، عَنِ الشَّعْبِيِّ، أَنَّهُ لَقِيَ فَارِسًا فَبَدَأَهُ بِالسَّلاَمِ، فَقُلْتُ‏:‏ تَبْدَأُهُ بِالسَّلاَمِ‏؟‏ قَالَ‏:‏ رَأَيْتُ شُرَيْحًا مَاشِيًا يَبْدَأُ بِالسَّلامِ‏.‏","english":{"narrator":"","text":"Ash-Sha'bi said that he met a rider and gave the greeting first.\nI said, \"Did you give the greeting first?\" He said, \"I saw Shurayh walking\nand he gave the greeting first.\""}},{"id":34,"idInBook":34,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ يَزِيدَ، قَالَ‏:‏ حَدَّثَنَا حَيْوَةُ قَالَ‏:‏ أَخْبَرَنِي حُمَيْدٌ أَبُو هَانِئٍ، أَنَّ أَبَا عَلِيٍّ الْجَنْبِيَّ حَدَّثَهُ، عَنْ فَضَالَةَ بْنِ عُبَيْدٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ يُسَلِّمُ الرَّاكِبُ عَلَى الْمَاشِي، وَالْمَاشِي عَلَى الْقَاعِدِ، وَالْقَلِيلُ عَلَى الْكَثِيرِ‏.‏","english":{"narrator":"","text":"See 996."}},{"id":35,"idInBook":35,"chapterId":42,"bookId":15,"arabic":"أَخْبَرَنَا عَبْدُ اللهِ، قَالَ‏:‏ أَخْبَرَنَا حَيْوَةُ بْنُ شُرَيْحٍ قَالَ‏:‏ أَخْبَرَنِي أَبُو هَانِئٍ الْخَوْلاَنِيُّ، عَنْ أَبِي عَلِيٍّ الْجَنْبِيِّ، عَنْ فَضَالَةَ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم قَالَ‏:‏ يُسَلِّمُ الْفَارِسُ عَلَى الْمَاشِي، وَالْمَاشِي عَلَى الْقَائِمِ، وَالْقَلِيلُ عَلَى الْكَثِيرِ‏.‏","english":{"narrator":"","text":"See 996."}},{"id":36,"idInBook":36,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، قَالَ‏:‏ أَخْبَرَنَا مَخْلَدٌ، قَالَ‏:‏ أَخْبَرَنَا ابْنُ جُرَيْجٍ قَالَ‏:‏ أَخْبَرَنِي زِيَادٌ، أَنَّهُ سَمِعَ ثَابِتًا مَوْلَى ابْنِ زَيْدٍ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ يُسَلِّمُ الرَّاكِبُ عَلَى الْمَاشِي، وَالْمَاشِي عَلَى الْقَاعِدِ، وَالْقَلِيلُ عَلَى الْكَثِيرِ‏.‏","english":{"narrator":"","text":"See 993."}},{"id":37,"idInBook":37,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ أَبِي عَمْرٍو قَالَ‏:‏ حَدَّثَنِي أَبِي قَالَ‏:‏ حَدَّثَنِي إِبْرَاهِيمُ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ صَفْوَانَ بْنِ سُلَيْمٍ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ يُسَلِّمُ الصَّغِيرُ عَلَى الْكَبِيرِ، وَالْمَاشِي عَلَى الْقَاعِدِ، وَالْقَلِيلُ عَلَى الْكَثِيرِ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"The young person greets the old person,\nthe person walking greets the person sitting down, and the small group\ngreets the large group.\""}},{"id":38,"idInBook":38,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، قَالَ‏:‏ أَخْبَرَنَا مَخْلَدٌ، قَالَ‏:‏ أَخْبَرَنَا ابْنُ جُرَيْجٍ قَالَ‏:‏ أَخْبَرَنِي زِيَادٌ، عَنْ أَبِي الزِّنَادِ قَالَ‏:‏ كَانَ خَارِجَةُ يَكْتُبُ عَلَى كِتَابِ زَيْدٍ إِذَا سَلَّمَ، قَالَ‏:‏ السَّلاَمُ عَلَيْكَ يَا أَمِيرَ الْمُؤْمِنِينَ وَرَحْمَةُ اللهِ وَبَرَكَاتُهُ وَمَغْفِرَتُهُ، وَطَيِّبُ صَلَوَاتِهِ‏.‏","english":{"narrator":"","text":"(sic) Abu'z-Zinad said, \"Kharija (ibn Zayd ibn Thabit) used to\nwrite on the letter of Zayd when he said the salam, 'Peace be upon you,\nAmir al-Mu'minin, and the mercy of Allah and His blessings and His forgiveness\nand the best of His prayers.\""}},{"id":39,"idInBook":39,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا بِشْرُ بْنُ الْحَكَمِ، قَالَ‏:‏ حَدَّثَنَا هَيَّاجُ بْنُ بَسَّامٍ أَبُو قُرَّةَ الْخُرَاسَانِيُّ، رَأَيْتُهُ بِالْبَصْرَةِ، قَالَ‏:‏ رَأَيْتُ أَنَسًا يَمُرُّ عَلَيْنَا فَيُومِئُ بِيَدِهِ إِلَيْنَا فَيُسَلِّمُ، وَكَانَ بِهِ وَضَحٌ، وَرَأَيْتُ الْحَسَنَ يَخْضُبُ بِالصُّفْرَةِ، وَعَلَيْهِ عِمَامَةٌ سَوْدَاءُ، وَقَالَتْ أَسْمَاءُ‏:‏ أَلْوَى النَّبِيُّ صلى الله عليه وسلم بِيَدِهِ إِلَى النِّسَاءِ بِالسَّلامِ‏.‏","english":{"narrator":"","text":"Abu Qurra al-Khurasani said, \"I saw Anas pass by us and he indicated\nto us with his hand that he was giving the greeting., The gesture made\nthat clear. I saw al-Hasan using yellow dye while wearing a black turban.\nAsma' said, 'The Prophet, may Allah bless him and grant him peace, waved\nhis hand to indicate the greeting to women.\""}},{"id":40,"idInBook":40,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ مَعْنٍ قَالَ‏:‏ حَدَّثَنِي مُوسَى بْنُ سَعْدٍ، عَنْ أَبِيهِ سَعْدٍ، أَنَّهُ خَرَجَ مَعَ عَبْدِ اللهِ بْنِ عُمَرَ، وَمَعَ الْقَاسِمِ بْنِ مُحَمَّدٍ، حَتَّى إِذَا نَزَلاَ سَرِفًا مَرَّ عَبْدُ اللهِ بْنُ الزُّبَيْرِ فَأَشَارَ إِلَيْهِمْ بِالسَّلاَمِ، فَرَدَّا عَلَيْهِ‏.‏","english":{"narrator":"","text":"Sa'd reported that he went with 'Abdullah ibn 'Umar and al-Qasim\nibn Muhammad. They stopped at place and 'Abdullah ibn az-Zubayr commanded\nand made a gesture of greeting to them and it was answered."}},{"id":41,"idInBook":41,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا خَلادٌ، قَالَ‏:‏ حَدَّثَنَا مِسْعَرٌ، عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ، عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ قَالَ‏:‏ كَانُوا يَكْرَهُونَ التَّسْلِيمَ بِالْيَدِ، أَوْ قَالَ‏:‏ كَانَ يَكْرَهُ التَّسْلِيمَ بِالْيَدِ‏.‏","english":{"narrator":"","text":"'Ata' ibn Abi Rabah said, \"They used to dislike a greeting made\nwith the hand,\" or he said, \"He disliked greeting with the hand.\""}},{"id":42,"idInBook":42,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا خَلاَّدُ بْنُ يَحْيَى، قَالَ‏:‏ حَدَّثَنَا مِسْعَرٌ، عَنْ ثَابِتِ بْنِ عُبَيْدٍ قَالَ‏:‏ أَتَيْتُ مَجْلِسًا فِيهِ عَبْدُ اللهِ بْنُ عُمَرَ، فَقَالَ‏:‏ إِذَا سَلَّمْتَ فَأَسْمِعْ، فَإِنَّهَا تَحِيَّةٌ مِنْ عِنْدِ اللهِ مُبَارَكَةً طَيْبَةً‏.‏","english":{"narrator":"Thabit ibn 'Ubayd said, \"I came to a group which included 'Abdullah\nibn 'Umar who said, 'When you greet, make it clearly audible, for it is\na greeting from Allah containing great blessing.:","text":""}},{"id":43,"idInBook":43,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ قَالَ‏:‏ حَدَّثَنِي مَالِكٌ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللهِ بْنِ أَبِي طَلْحَةَ، أَنَّ الطُّفَيْلَ بْنَ أُبَيِّ بْنِ كَعْبٍ أَخْبَرَهُ، أَنَّهُ كَانَ يَأْتِي عَبْدَ اللهِ بْنَ عُمَرَ فَيَغْدُو مَعَهُ إِلَى السُّوقِ، قَالَ‏:‏ فَإِذَا غَدَوْنَا إِلَى السُّوقِ لَمْ يَمُرَّ عَبْدُ اللهِ بْنُ عُمَرَ عَلَى سَقَّاطٍ، وَلاَ صَاحِبِ بَيْعَةٍ، وَلاَ مِسْكِينٍ، وَلاَ أَحَدٍ إِلاَّ يُسَلِّمُ عَلَيْهِ‏.‏","english":{"narrator":"","text":"At-Tufayl ibn Ubayy ibn Ka'b related that he used to visit 'Abdullah\nibn 'Umar and would go with him to the market. He said, \"When we went to\nthe market, 'Abdullah ibn 'Umar did not pass by any rubbish collector nor\nmerchant nor poor person nor anyone else without greeting them.\""}},{"id":44,"idInBook":44,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ عَجْلاَنَ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ إِذَا جَاءَ أَحَدُكُمُ الْمَجْلِسَ فَلْيُسَلِّمْ، فَإِنْ رَجَعَ فَلْيُسَلِّمْ، فَإِنَّ الأُخْرَى لَيْسَتْ بِأَحَقَّ مِنَ الأولَى‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"When one of you comes to a gathering, he\nshould give the greeting. If he leaves, he should give the greeting. Neither\nis more of a duty than the other.\""}},{"id":45,"idInBook":45,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، قَالَ‏:‏ حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ قَالَ‏:‏ حَدَّثَنِي مُحَمَّدُ بْنُ عَجْلاَنَ قَالَ‏:‏ أَخْبَرَنِي سَعِيدٌ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ إِذَا جَاءَ الرَّجُلُ الْمَجْلِسَ فَلْيُسَلِّمْ، فَإِنْ جَلَسَ ثُمَّ بَدَا لَهُ أَنْ يَقُومَ قَبْلَ أَنْ يَتَفَرَّقَ الْمَجْلِسُ فَلْيُسَلِّمْ، فَإِنَّ الأُولَى لَيْسَتْ بِأَحَقَّ مِنَ الأخْرَى‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"When a man comes to a gathering, he should give\nthe greeting. When he sits down and then thinks that he should leave before\nthe gathering has broken up, he should give the greeting. Neither is more\nof a duty than the other.\""}},{"id":46,"idInBook":46,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا مَطَرُ بْنُ الْفَضْلِ، قَالَ‏:‏ حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، قَالَ‏:‏ حَدَّثَنَا بِسْطَامٌ قَالَ‏:‏ سَمِعْتُ مُعَاوِيَةَ بْنَ قُرَّةَ قَالَ‏:‏ قَالَ لِي أَبِي‏:‏ يَا بُنَيَّ، إِنْ كُنْتَ فِي مَجْلِسٍ تَرْجُو خَيْرَهُ، فَعَجِلَتْ بِكَ حَاجَةٌ فَقُلْ‏:‏ سَلاَمٌ عَلَيْكُمْ، فَإِنَّكَ تَشْرَكُهُمْ فِيمَا أَصَابُوا فِي ذَلِكَ الْمَجْلِسِ، وَمَا مِنْ قَوْمٍ يَجْلِسُونَ مَجْلِسًا فَيَتَفَرَّقُونَ عَنْهُ لَمْ يُذْكَرِ اللَّهُ، إِلاَّ كَأَنَّمَا تَفَرَّقُوا عَنْ جِيفَةِ حِمَارٍ‏.‏","english":{"narrator":"","text":"Mu'awiya ibn Qurra said, \"My father told me, 'If you sit in a\ngathering expecting good to come from, but then something occurs which\nmakes you leave, say, 'Peace be upon you,' and you will share in any good\nthat they obtain in that gathering. There are no people who sit in a gathering\nand then split up without Allah having been mentioned, but that it is as\nif they were leaving the corpse of a donkey.'\""}},{"id":47,"idInBook":47,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ صَالِحٍ قَالَ‏:‏ حَدَّثَنِي مُعَاوِيَةُ، عَنْ أَبِي مَرْيَمَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ سَمِعَهُ يَقُولُ‏:‏ مَنْ لَقِيَ أَخَاهُ فَلْيُسَلِّمْ عَلَيْهِ، فَإِنْ حَالَتْ بَيْنَهُمَا شَجَرَةٌ أَوْ حَائِطٌ، ثُمَّ لَقِيَهُ فَلْيُسَلِّمْ عَلَيْهِ‏.‏","english":{"narrator":"","text":"Abu Hurayra said, \"Whoever meets his brother should greet him.\nIf a tree or wall comes between them and then he meets him, he should greet\nhim on the other side.\""}},{"id":48,"idInBook":48,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ‏:‏ حَدَّثَنَا الضَّحَّاكُ بْنُ نِبْرَاسٍ أَبُو الْحَسَنِ، عَنْ ثَابِتٍ الْبُنَانِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ أَصْحَابَ النَّبِيِّ صلى الله عليه وسلم كَانُوا يَكُونُونَ مُجْتَمِعِينَ فَتَسْتَقْبِلُهُمُ الشَّجَرَةُ، فَتَنْطَلِقُ طَائِفَةٌ مِنْهُمْ عَنْ يَمِينِهَا وَطَائِفَةٌ عَنْ شِمَالِهَا، فَإِذَا الْتَقَوْا سَلَّمَ بَعْضُهُمْ عَلَى بَعْضٍ‏.‏","english":{"narrator":"","text":"Anas ibn Malik reported that the Companions of the Prophet, may\nAllah bless him and grant him peace, used to gather and they would turn\ntowards the tree and a group of them would go to the right and a group\nto its left. When they met again, they would greet one another."}},{"id":49,"idInBook":49,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا عُبَيْدُ اللهِ بْنُ سَعِيدٍ، قَالَ‏:‏ حَدَّثَنَا خَالِدُ بْنُ خِدَاشٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ اللهِ بْنُ وَهْبٍ الْمِصْرِيُّ، عَنْ قُرَيْشٍ الْبَصْرِيِّ هُوَ ابْنُ حَيَّانَ، عَنْ ثَابِتٍ الْبُنَانِيِّ، أَنَّ أَنَسًا كَانَ إِذَا أَصْبَحَ ادَّهَنَ يَدَهُ بِدُهْنٍ طَيِّبٍ لِمُصَافَحَةِ إِخْوَانِهِ‏.‏","english":{"narrator":"","text":"It is reported by Thabit al-Bannani that Anas used to oil his\nhand with scented oil in the morning for the sake of shaking hands with\nhis brothers."}},{"id":50,"idInBook":50,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا قُتَيْبَةُ، قَالَ‏:‏ حَدَّثَنَا اللَّيْثُ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ أَبِي الْخَيْرِ، عَنْ عَبْدِ اللهِ بْنِ عَمْرٍو، أَنَّ رَجُلاً قَالَ‏:‏ يَا رَسُولَ اللهِ، أَيُّ الإِسْلاَمِ خَيْرٌ‏؟‏ قَالَ‏:‏ تُطْعِمُ الطَّعَامَ، وَتُقْرِئُ السَّلاَمَ عَلَى مَنْ عَرَفْتَ وَمَنْ لَمْ تَعْرِفْ‏.‏","english":{"narrator":"","text":"'Abdullah ibn 'Amr reported that a man said, \"Messenger of Allah,\nwhich aspect of Islam is best?\" He replied, \"Feeding people and greeting\nthose you know and those you do not know.\""}},{"id":51,"idInBook":51,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ‏:‏ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم نَهَى عَنِ الأَفْنِيَةِ وَالصُّعُدَاتِ أَنْ يُجْلَسَ فِيهَا، فَقَالَ الْمُسْلِمُونَ‏:‏ لاَ نَسْتَطِيعُهُ، لاَ نُطِيقُهُ، قَالَ‏:‏ أَمَّا لاَ، فَأَعْطُوا حَقَّهَا، قَالُوا‏:‏ وَمَا حَقُّهَا‏؟‏ قَالَ‏:‏ غَضُّ الْبَصَرِ، وَإِرْشَادُ ابْنِ السَّبِيلِ، وَتَشْمِيتُ الْعَاطِسِ إِذَا حَمِدَ اللَّهَ، وَرَدُّ التَّحِيَّةِ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, forbade people to sit in courtyards and roads.\nThe Muslims said, \"We will not be able to avoid it. We cannot undertake\nit.\" He said, \"If not, then give it its due.\" They said, \"What is it due?\"\nHe said, \"Lower the eye, guide the traveller, wish for mercy on the person\nwho sneezes when he praises Allah and return the greeting.\""}},{"id":52,"idInBook":52,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، قَالَ‏:‏ حَدَّثَنَا زُهَيْرٌ، قَالَ‏:‏ حَدَّثَنَا كِنَانَةُ مَوْلَى صَفِيَّةَ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ أَبْخَلُ النَّاسِ مَنْ بَخِلَ بِالسَّلاَمِ، وَالْمَغْبُونُ مَنْ لَمْ يَرُدَّهُ، وَإِنْ حَالَتْ بَيْنَكَ وَبَيْنَ أَخِيكَ شَجَرَةٌ، فَإِنِ اسْتَطَعْتَ أَنْ تَبْدَأَهُ بِالسَّلامِ لا يَبْدَأُكَ فَافْعَلْ‏.‏","english":{"narrator":"","text":"Abu Hurayra said, \"The most miserly of people is the person who\nis miserly with the greeting. The one who is cheated of good is the one\nwho does not return it. if a tree comes between you and your brother, and\nyou are able to be the first to begin the greeting before the other person,\nthen do it.\""}},{"id":53,"idInBook":53,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا عِمْرَانُ بْنُ مَيْسَرَةَ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ حُسَيْنٍ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ سَالِمٍ مَوْلَى عَبْدِ اللهِ بْنِ عَمْرٍو قَالَ‏:‏ وَكَانَ ابْنُ عَمْرٍو إِذَا سُلِّمَ عَلَيْهِ فَرَدَّ زَادَ، فَأَتَيْتُهُ وَهُوَ جَالِسٌ فَقُلْتُ‏:‏ السَّلاَمُ عَلَيْكُمْ، فَقَالَ‏:‏ السَّلاَمُ عَلَيْكُمْ وَرَحْمَةُ اللهِ، ثُمَّ أَتَيْتُهُ مَرَّةً أُخْرَى فَقُلْتُ‏:‏ السَّلاَمُ عَلَيْكُمْ وَرَحْمَةُ اللهِ، قَالَ‏:‏ السَّلاَمُ عَلَيْكُمْ وَرَحْمَةُ اللهِ وَبَرَكَاتُهُ، ثُمَّ أَتَيْتُهُ مَرَّةً أُخْرَى فَقُلْتُ‏:‏ السَّلاَمُ عَلَيْكُمْ وَرَحْمَةُ اللهِ وَبَرَكَاتُهُ، فَقَالَ‏:‏ السَّلاَمُ عَلَيْكُمْ وَرَحْمَةُ اللهِ وَبَرَكَاتُهُ، وَطَيِّبُ صَلَوَاتِهِ‏.‏","english":{"narrator":"","text":"Salim, the mawla of 'Abdullah ibn 'Amr, said, \"When Ibn 'Umar\nwas greeted, he returned it with increase. I came upon him sitting down\nand said, 'Peace be upon you,' and he said, 'Peace be upon you and the\nmercy of Allah.' Then I came another time and said, 'Peace be upon you\nand the mercy of Allah,; and he said, 'Peace be upon you and the mercy\nof Allah and His blessings.' Then I came to him another time and said,\n'Peace be upon you and the mercy of Allah and His blessings,' and he said,\n'Peace be upon you and the mercy of Allah and His blessings and the bet\nof His prayers.'\""}},{"id":54,"idInBook":54,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، قَالَ‏:‏ حَدَّثَنَا بَكْرُ بْنُ مُضَرَ، قَالَ‏:‏ حَدَّثَنَا عُبَيْدُ اللهِ بْنُ زَحْرٍ، عَنْ حِبَّانَ بْنِ أَبِي جَبَلَةَ، عَنْ عَبْدِ اللهِ بْنِ عَمْرِو بْنِ الْعَاصِ قَالَ‏:‏ لاَ تُسَلِّمُوا عَلَى شُرَّابِ الْخَمْرِ‏.‏","english":{"narrator":"","text":"'Abdullah ibn 'Amr ibn al-'as said, \"Do not greet anyone who drinks\nwine.\""}},{"id":55,"idInBook":55,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ مَحْبُوبٍ، وَمُعَلَّى، وَعَارِمٌ، قَالُوا‏:‏ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ قَالَ‏:‏ لَيْسَ بَيْنَكَ وَبَيْنَ الْفَاسِقِ حُرْمَةٌ‏.‏","english":{"narrator":"","text":"Al-Hasan said, \"There should be not sense of respect between you\nand a deviant person.\""}},{"id":56,"idInBook":56,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ قَالَ‏:‏ حَدَّثَنِي مَعْنُ بْنُ عِيسَى قَالَ‏:‏ حَدَّثَنِي أَبُو رُزَيْقٍ، أَنَّهُ سَمِعَ عَلِيَّ بْنَ عَبْدِ اللهِ يَكْرَهُ الأَسْبِرَنْجَ وَيَقُولُ‏:‏ لاَ تُسَلِّمُوا عَلَى مَنْ لَعِبَ بِهَا، وَهِيَ مِنَ الْمَيْسِرِ‏.‏","english":{"narrator":"","text":"'Ali ibn 'Abdullah was heard expressing his dislike for chess\nand said, \"Do not greet someone who plays it. It is a kind of gambling.\""}},{"id":57,"idInBook":57,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا زَكَرِيَّا بْنُ يَحْيَى قَالَ‏:‏ حَدَّثَنِي الْقَاسِمُ بْنُ الْحَكَمِ الْعُرَنِيُّ، قَالَ‏:‏ أَخْبَرَنَا سَعِيدُ بْنُ عُبَيْدٍ الطَّائِيُّ، عَنْ عَلِيِّ بْنِ رَبِيعَةَ، عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ رَضِيَ اللَّهُ عَنْهُ قَالَ‏:‏ مَرَّ النَّبِيُّ صلى الله عليه وسلم عَلَى قَوْمٍ فِيهِمْ رَجُلٌ مُتَخَلِّقٌ بِخَلُوقٍ، فَنَظَرَ إِلَيْهِمْ وَسَلَّمَ عَلَيْهِمْ، وَأَعْرَضَ عَنِ الرَّجُلِ، فَقَالَ الرَّجُلُ‏:‏ أَعْرَضْتَ عَنِّي‏؟‏ قَالَ‏:‏ بَيْنَ عَيْنَيْهِ جَمْرَةٌ‏.‏","english":{"narrator":"","text":"'Ali ibn Abi Talib said, \"The Prophet, may Allah bless him and\ngrant him peace, walked past some people who included a man who used khaluq\nperfume. He looked at them and gave them the greeting, but turns away from\nthat man. The man asked, 'Have you turned away from me?' He replied, 'There\nis redness between your eyes.'\""}},{"id":58,"idInBook":58,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ قَالَ‏:‏ حَدَّثَنِي سُلَيْمَانُ، عَنِ ابْنِ عَجْلاَنَ، عَنْ عَمْرِو بْنِ شُعَيْبِ بْنِ مُحَمَّدِ بْنِ عَبْدِ اللهِ بْنِ عَمْرِو بْنِ الْعَاصِ بْنِ وَائِلٍ السَّهْمِيِّ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ رَجُلاً أَتَى النَّبِيَّ صلى الله عليه وسلم وَفِي يَدِهِ خَاتَمٌ مِنْ ذَهَبٍ، فَأَعْرَضَ النَّبِيُّ صلى الله عليه وسلم عَنْهُ، فَلَمَّا رَأَى الرَّجُلُ كَرَاهِيَتَهُ ذَهَبَ فَأَلْقَى الْخَاتَمَ، وَأَخَذَ خَاتَمًا مِنْ حَدِيدٍ فَلَبِسَهُ، وَأَتَى النَّبِيَّ صلى الله عليه وسلم، قَالَ‏:‏ هَذَا شَرٌّ، هَذَا حِلْيَةُ أَهْلِ النَّارِ، فَرَجَعَ فَطَرَحَهُ، وَلَبِسَ خَاتَمًا مِنْ وَرِقٍ، فَسَكَتَ عَنْهُ النَّبِيُّ صلى الله عليه وسلم‏.‏","english":{"narrator":"","text":"Muhammad ibn 'Abdullah reported that a man came to the Prophet,\nmay Allah bless him and grant him peace, wearing a gold signet-ring on\nhis finger. The Prophet, may Allah bless him and grant him peace, turned\naway from him. When the man saw his dislike of the gold, he threw the ring\naway. He made an iron ring and wore that. He came to the Prophet, may Allah\nbless him and grant him peace, who said, \"This is worse. This is the ornament\nof the people of the Fire.\" The man went away, threw it off and put on\na silver ring and the Prophet, may Allah bless him and grant him peace,\ndid not say anything about it.\""}},{"id":59,"idInBook":59,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ صَالِحٍ قَالَ‏:‏ حَدَّثَنِي اللَّيْثُ، عَنْ عَمْرٍو هُوَ ابْنُ الْحَارِثِ، عَنْ بَكْرِ بْنِ سَوَادَةَ، عَنْ أَبِي النَّجِيبِ، عَنْ أَبِي سَعِيدٍ قَالَ‏:‏ أَقْبَلَ رَجُلٌ مِنَ الْبَحْرَيْنِ إِلَى النَّبِيِّ صلى الله عليه وسلم فَسَلَّمَ عَلَيْهِ، فَلَمْ يَرُدَّ، وَفِي يَدِهِ خَاتَمٌ مِنْ ذَهَبٍ، وَعَلَيْهِ جُبَّةُ حَرِيرٍ، فَانْطَلَقَ الرَّجُلُ مَحْزُونًا، فَشَكَا إِلَى امْرَأَتِهِ، فَقَالَتْ‏:‏ لَعَلَّ بِرَسُولِ اللهِ صلى الله عليه وسلم وَجِبَّتَكَ وَخَاتَمَكَ، فَأَلْقِهِمَا ثُمَّ عُدْ، فَفَعَلَ، فَرَدَّ السَّلاَمَ، فَقَالَ‏:‏ جِئْتُكَ آنِفًا فَأَعْرَضْتَ عَنِّي‏؟‏ قَالَ‏:‏ كَانَ فِي يَدِكَ جَمْرٌ مِنْ نَارٍ، فَقَالَ‏:‏ لَقَدْ جِئْتُ إِذًا بِجَمْرٍ كَثِيرٍ، قَالَ‏:‏ إِنَّ مَا جِئْتَ بِهِ لَيْسَ بِأَجْزَأَ عَنَّا مِنْ حِجَارَةِ الْحَرَّةِ، وَلَكِنَّهُ مَتَاعُ الْحَيَاةِ الدُّنْيَا، قَالَ‏:‏ فَبِمَاذَا أَتَخَتَّمُ بِهِ‏؟‏ قَالَ‏:‏ بِحَلْقَةٍ مِنْ وَرِقٍ، أَوْ صُفْرٍ، أَوْ حَدِيدٍ‏.‏","english":{"narrator":"","text":"Abu Sa'id said, \"A man came from al-Bahrayn to the Prophet, may\nAllah bless him and grant him peace, and greeted him, but the Prophet did\nnot answer him. The man was wearing a gold ring and a silk robe. The man\nwent away in sorrow. He complained to his wife and she said, 'Perhaps the\nMessenger of Allah objects to your robe and your ring. Throw them away\nand then go back.; he did that and then the Prophet returned his greeting.\nhe said, 'I came to you yesterday and you turned away from me.' He said,\n'You had a coal of the Fire on your hand.' He said, 'I came then with any\ncoals.' He said, 'As for what you brought, there is no one who is free\nfrom dependence on these stones. But it is the enjoyment of the life of\nthis world.' He said, 'What should I make a ring from?' 'From silver, brass,\nor iron,' he replied."}},{"id":60,"idInBook":60,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ الْغَفَّارِ بْنُ دَاوُدَ، قَالَ‏:‏ حَدَّثَنَا يَعْقُوبُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنِ ابْنِ شِهَابٍ، أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ سَأَلَ أَبَا بَكْرِ بْنَ سُلَيْمَانَ بْنِ أَبِي حَثْمَةَ‏:‏ لِمَ كَانَ أَبُو بَكْرٍ يَكْتُبُ‏:‏ مِنْ أَبِي بَكْرٍ خَلِيفَةِ رَسُولِ اللهِ، ثُمَّ كَانَ عُمَرُ يَكْتُبُ بَعْدَهُ‏:‏ مِنْ عُمَرَ بْنِ الْخَطَّابِ خَلِيفَةِ أَبِي بَكْرٍ، مَنْ أَوَّلُ مَنْ كَتَبَ‏:‏ أَمِيرَ الْمُؤْمِنِينَ‏؟‏ فَقَالَ‏:‏ حَدَّثَتْنِي جَدَّتِي الشِّفَاءُ، وَكَانَتْ مِنَ الْمُهَاجِرَاتِ الأُوَلِ، وَكَانَ عُمَرُ بْنُ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ إِذَا هُوَ دَخَلَ السُّوقَ دَخَلَ عَلَيْهَا، قَالَتْ‏:‏ كَتَبَ عُمَرُ بْنُ الْخَطَّابِ إِلَى عَامِلِ الْعِرَاقَيْنِ‏:‏ أَنِ ابْعَثْ إِلَيَّ بِرَجُلَيْنِ جَلْدَيْنِ نَبِيلَيْنِ، أَسْأَلُهُمَا عَنِ الْعِرَاقِ وَأَهْلِهِ، فَبَعَثَ إِلَيْهِ صَاحِبُ الْعِرَاقَيْنِ بِلَبِيدِ بْنِ رَبِيعَةَ، وَعَدِيِّ بْنِ حَاتِمٍ، فَقَدِمَا الْمَدِينَةَ فَأَنَاخَا رَاحِلَتَيْهِمَا بِفِنَاءِ الْمَسْجِدِ، ثُمَّ دَخَلاَ الْمَسْجِدَ فَوَجَدَا عَمْرَو بْنَ الْعَاصِ، فَقَالاَ لَهُ‏:‏ يَا عَمْرُو، اسْتَأْذِنْ لَنَا عَلَى أَمِيرِ الْمُؤْمِنِينَ عُمَرَ، فَوَثَبَ عَمْرٌو فَدَخَلَ عَلَى عُمَرَ فَقَالَ‏:‏ السَّلاَمُ عَلَيْكَ يَا أَمِيرَ الْمُؤْمِنِينَ، فَقَالَ لَهُ عُمَرُ‏:‏ مَا بَدَا لَكَ فِي هَذَا الِاسْمِ يَا ابْنَ الْعَاصِ‏؟‏ لَتَخْرُجَنَّ مِمَّا قُلْتَ، قَالَ‏:‏ نَعَمْ، قَدِمَ لَبِيدُ بْنُ رَبِيعَةَ، وَعَدِيُّ بْنُ حَاتِمٍ، فَقَالاَ لِي‏:‏ اسْتَأْذِنْ لَنَا عَلَى أَمِيرِ الْمُؤْمِنِينَ، فَقُلْتُ‏:‏ أَنْتُمَا وَاللَّهِ أَصَبْتُمَا اسْمَهُ، وَإِنَّهُ الأَمِيرُ، وَنَحْنُ الْمُؤْمِنُونَ‏.‏ فَجَرَى الْكِتَابُ مِنْ ذَلِكَ الْيَوْمِ‏.","english":{"narrator":"","text":"'Umar ibn 'Abdu'l-'Aziz asked Abu Bakr ibn Abi Hathama, \"Why did\nAbu Bakr write, 'From Abu Bakr, the Khalifa (Successor) of the Messenger\nof Allah' and then 'Umar wrote after him, 'From 'Umar ibn al-Khattab, the\nkhalifa (successor) of Abu Bakr'? Who was the first to write 'the Amir\nal-Mu'minin'?\" He replied, \"My grandmother, ash-Shifa', related to me,\nand she was one of the first to write 'the Amir al-Mu'minin'?\" He said,\n\"My grandfather, ash-Shifa' related to me, (and she was one of the first\nMuhajirun and when 'Umar ibn al-Khattab entered the market, he visited\nher), saying, ''Umar ibn al-Khattab wrote to the governor of Iraq requesting\nhim to send him two trustworthy noble men so that he could question them\nabout Iraq and its people. He sent him a master of Iraq, Labid ibn Rabi'a\nand also 'Adi ibn Hatim, and they came to Madina. They made their camels\nkneel in the courtyard of the mosque, entered it and found 'Amr ibn al-'As.\nThey said to him, ''Amr, ask permission for us to visit the Amir al-Mu'minin,\n'Umar.' 'Amr got up and went to 'Umar. He said, 'Peace be upon you, Amir\nal-Mu'minin.' 'Umar said to him, 'Ibn al-'As, what made you use this name?\nYou have deviated from what you normally say.' He said, 'Yes, Labid ibn\nRabi'a and 'Adi ibn Hatim came and said to me, \"Ask permission for us to\nvisit the Amir al-Mu'minin.\" I said, \"You two, by Allah, have hit upon\nthe correct name. He is the amir and we are the believers.\"' The title\noriginated on that day.\""}},{"id":61,"idInBook":61,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ‏:‏ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ قَالَ‏:‏ أَخْبَرَنِي عُبَيْدُ اللهِ بْنُ عَبْدِ اللهِ قَالَ‏:‏ قَدِمَ مُعَاوِيَةُ حَاجًّا حَجَّتَهُ الأُولَى وَهُوَ خَلِيفَةٌ، فَدَخَلَ عَلَيْهِ عُثْمَانُ بْنُ حُنَيْفٍ الأَنْصَارِيُّ فَقَالَ‏:‏ السَّلاَمُ عَلَيْكَ أَيُّهَا الأَمِيرُ وَرَحْمَةُ اللهِ، فَأَنْكَرَهَا أَهْلُ الشَّامِ وَقَالُوا‏:‏ مَنْ هَذَا الْمُنَافِقُ الَّذِي يُقَصِّرُ بِتَحِيَّةِ أَمِيرِ الْمُؤْمِنِينَ‏؟‏ فَبَرَكَ عُثْمَانُ عَلَى رُكْبَتِهِ ثُمَّ قَالَ‏:‏ يَا أَمِيرَ الْمُؤْمِنِينَ، إِنَّ هَؤُلاَءِ أَنْكَرُوا عَلَيَّ أَمْرًا أَنْتَ أَعْلَمُ بِهِ مِنْهُمْ، فَوَاللَّهِ لَقَدْ حَيَّيْتُ بِهَا أَبَا بَكْرٍ وَعُمَرَ وَعُثْمَانَ، فَمَا أَنْكَرَهُ مِنْهُمْ أَحَدٌ، فَقَالَ مُعَاوِيَةُ لِمَنْ تَكَلَّمَ مِنْ أَهْلِ الشَّامِ‏:‏ عَلَى رِسْلِكُمْ، فَإِنَّهُ قَدْ كَانَ بَعْضُ مَا يَقُولُ، وَلَكِنَّ أَهْلَ الشَّامِ قَدْ حَدَثَتْ هَذِهِ الْفِتَنُ، قَالُوا‏:‏ لاَ تُقَصَّرُ عِنْدَنَا تَحِيَّةُ خَلِيفَتِنَا، فَإِنِّي إِخَالُكُمْ يَا أَهْلَ الْمَدِينَةِ تَقُولُونَ لِعَامِلِ الصَّدَقَةِ‏:‏ أَيُّهَا الأمِيرُ‏.‏","english":{"narrator":"","text":"'Ubaydullah ibn 'Abdullah said, \"Mu'awiya went on his first hajj\nwhen he was the khalifa and 'Uthman ibn Hanif al-Ansari came to him and\nsaid, 'Peace be upon you, Amir, and the mercy of Allah.' The people of\nSyria objected to that and said, 'Who is this hypocrite who shortens the\ngreeting of the Amir al-Mu'minin!' 'Uthman made his camel kneel and said,\n'Amir al-Mu'minin! These men object to something which you know better\nthan them. By Allah, I used to this greeting for Abu Bakr, 'Umar, and 'Uthman,\nand none of them objected to it.' Mu'awiya said to those of the people\nof Syria who had spoken, 'Take it easy! It was partly as he stated. But\nwhen the civil war engaged the people of Syria, they said, \"Do not shorten\nthe greeting of our khalifa in our presence (i.e. from Amir al-Mu'minin\nto Amir).\" People of Madina, I will treat you as friends even though you\nuse 'Amir\" for a zakat collector.'\""}},{"id":62,"idInBook":62,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرٍ قَالَ‏:‏ دَخَلْتُ عَلَى الْحَجَّاجِ فَمَا سَلَّمْتُ عَلَيْهِ‏.‏","english":{"narrator":"","text":"Jabir said, \"I visited al-Hajjaj and did not greet him.\""}},{"id":63,"idInBook":63,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ‏:‏ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ مُغِيرَةَ، عَنْ سِمَاكِ بْنِ سَلَمَةَ الضَّبِّيِّ، عَنْ تَمِيمِ بْنِ حَذْلَمٍ قَالَ‏:‏ إِنِّي لَأَذْكُرُ أَوَّلَ مَنْ سَلَّمَ عَلَيْهِ بِالإِمْرَةِ بِالْكُوفَةِ، خَرَجَ الْمُغِيرَةُ بْنُ شُعْبَةَ مِنْ بَابِ الرَّحَبَةِ، فَفَجَأَهُ رَجُلٌ مِنْ كِنْدَةَ، زَعَمُوا أَنَّهُ‏:‏ أَبُو قُرَّةَ الْكِنْدِيُّ، فَسَلَّمَ عَلَيْهِ، فَقَالَ‏:‏ السَّلاَمُ عَلَيْكَ أَيُّهَا الأَمِيرُ وَرَحْمَةُ اللهِ، السَّلاَمُ عَلَيْكُمْ، فَكَرِهَهُ، فَقَالَ‏:‏ السَّلاَمُ عَلَيْكُمْ أَيُّهَا الأَمِيرُ وَرَحْمَةُ اللهِ، السَّلاَمُ عَلَيْكُمْ، هَلْ أَنَا إِلاَّ مِنْهُمْ، أَمْ لاَ‏؟‏ قَالَ سِمَاكٌ‏:‏ ثُمَّ أَقَرَّ بِهَا بَعْدُ‏.‏","english":{"narrator":"","text":"Tamim ibn Hadhlam said, \"I will mention the first to be greeted\nas 'Amir' in Kufa. Al-Mughira ibn Shu'ba left by the Bab ar-Rahba and a\nman of Kinda came up to him. They claim that it was Abu Qurra al-Kindi.\nHe greeted him and said, 'Peace be upon you, O Amir, and the mercy of Allah.'\nHe disliked it. So the man said, 'Peace be upon you, O Amir, and the mercy\nof Allah. Peace be upon you. Am I one of you or not?'\" Sammak ibn Salama\nad-Dabi said, \"After that it became an established practice.\""}},{"id":64,"idInBook":64,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدٌ، قَالَ‏:‏ أَخْبَرَنَا عَبْدُ اللهِ، قَالَ‏:‏ أَخْبَرَنَا حَيْوَةُ بْنُ شُرَيْحٍ قَالَ‏:‏ حَدَّثَنِي زِيَادُ بْنُ عُبَيْدٍ، بَطْنٌ مِنْ حِمْيَرٍ، قَالَ‏:‏ دَخَلْنَا عَلَى رُوَيْفِعٍ، وَكَانَ أَمِيرًا عَلَى أَنْطَابُلُسَ، فَجَاءَ رَجُلٌ فَسَلَّمَ عَلَيْهِ، وَنَحْنُ عِنْدَهُ، فَقَالَ‏:‏ السَّلاَمُ عَلَيْكَ أَيُّهَا الأَمِيرُ، فَقَالَ لَهُ رُوَيْفِعٌ‏:‏ لَوْ سَلَّمْتَ عَلَيْنَا لَرَدَدْنَا عَلَيْكَ السَّلاَمَ، وَلَكِنْ إِنَّمَا سَلَّمْتَ عَلَى مَسْلَمَةَ بْنِ مَخْلَدٍ، وَكَانَ مَسْلَمَةُ عَلَى مِصْرَ، اذْهَبْ إِلَيْهِ فَلْيَرُدَّ عَلَيْكَ السَّلاَمَ‏.‏","english":{"narrator":"","text":"Ziyad ibn 'Ubayd (ar-Ru'ayni) said, \"We went to Ruwayfa', the\nAmir of Antabulis. A man came and greeted him, saying, 'Peace be upon the\nAmir.' From 'Abda, he said, 'Peace be upon the Amir.' Ruwayfa' said to\nhim, 'If you had greeted us, we would have returned the greeting. But you\ngreeted Maslama ibn Mukhallad (Maslama was in charge of Egypt). Go to him\nand he will return your greeting.'\""}},{"id":65,"idInBook":65,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ‏:‏ حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ، قَالَ‏:‏ حَدَّثَنَا ثَابِتٌ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنِ الْمِقْدَادِ بْنِ الأَسْوَدِ قَالَ‏:‏ كَانَ النَّبِيُّ صلى الله عليه وسلم يَجِيءُ مِنَ اللَّيْلِ، فَيُسَلِّمُ تَسْلِيمًا لاَ يُوقِظُ نَائِمًا، وَيُسْمِعُ الْيَقْظَانَ‏.‏","english":{"narrator":"","text":"Al-Miqdad ibn al-Aswad said, \"The Prophet, may Allah bless him\nand grant him peace, used to come at night and would give the greeting\nin such a way that it would not awaken anyone asleep, but the person who\nwas awake would hear it.\""}},{"id":66,"idInBook":66,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا عَمْرُو بْنُ عَبَّاسٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، عَنْ سُفْيَانَ، عَنْ أَبِيهِ، عَنِ الشَّعْبِيِّ، أَنَّ عُمَرَ قَالَ لِعَدِيِّ بْنِ حَاتِمٍ‏:‏ حَيَّاكَ اللَّهُ مِنْ مَعْرِفَةٍ‏.‏","english":{"narrator":"","text":"'Umar said to 'Adi ibn Hatim, \"May Allah preserve you from recognition.\""}},{"id":67,"idInBook":67,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ‏:‏ حَدَّثَنَا زَكَرِيَّا، عَنْ فِرَاسٍ، عَنْ عَامِرٍ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ‏:‏ أَقْبَلَتْ فَاطِمَةُ تَمْشِي كَأَنَّ مِشْيَتَهَا مَشْيُ النَّبِيِّ صلى الله عليه وسلم، فَقَالَ‏:‏ مَرْحَبًا بِابْنَتِي، ثُمَّ أَجْلَسَهَا عَنْ يَمِينِهِ، أَوْ عَنْ شِمَالِهِ‏.‏","english":{"narrator":"","text":"'A'isha said, \"Fatima walked in the same manner that the Prophet,\nmay Allah bless him and grant him peace, walked. He used to say to her,\n'Welcome, my daughter!' Then he would have her sit down on his right or\nhis left.\""}},{"id":68,"idInBook":68,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي إِسْحَاقَ، عَنْ هَانِئِ بْنِ هَانِئٍ، عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ‏:‏ اسْتَأْذَنَ عَمَّارٌ عَلَى النَّبِيِّ صلى الله عليه وسلم، فَعَرَفَ صَوْتَهُ، فَقَالَ‏:‏ مَرْحَبًا بِالطَّيِّبِ الْمُطَيَّبِ‏.‏","english":{"narrator":"","text":"'Ali said, \"'Ammar asked for permission to enter to visit the\nProphet, may Allah bless him and grant him peace, and the Prophet recognised\nhis voice and said, 'Welcome with the best and purest greeting!'\""}},{"id":69,"idInBook":69,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانَ قَالَ‏:‏ حَدَّثَنِي ابْنُ وَهْبٍ قَالَ‏:‏ أَخْبَرَنِي حَيْوَةُ، عَنْ عُقْبَةَ بْنِ مُسْلِمٍ، عَنْ عَبْدِ اللهِ بْنِ عَمْرٍو قَالَ‏:‏ بَيْنَمَا نَحْنُ جُلُوسٌ عِنْدَ النَّبِيِّ صلى الله عليه وسلم فِي ظِلِّ شَجَرَةٍ بَيْنَ مَكَّةَ وَالْمَدِينَةِ، إِذْ جَاءَ أَعْرَابِيٌّ مِنَ أَجْلَفِ النَّاسِ وَأَشَدِّهِمْ فَقَالَ‏:‏ السَّلامُ عَلَيْكُمْ، فَقَالُوا‏:‏ وَعَلَيْكُمُ‏.‏","english":{"narrator":"","text":"'Uqba ibn 'Abdullah ibn 'Amr who said, \"While we were sitting\nwith the Prophet, may Allah bless him and grant him peace, in the shade\nof a tree while travelling between Makka and Madina, a bedouin, who was\nan example of the coarsest and fiercest kind of people came up and said,\n'Peace be upon you,' and they said, 'And upon you.'\""}},{"id":70,"idInBook":70,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا حَامِدُ بْنُ عُمَرَ، قَالَ‏:‏ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي جَمْرَةَ، سَمِعْتُ ابْنَ عَبَّاسٍ إِذَا سُلِّمَ عَلَيْهِ يَقُولُ‏:‏ وَعَلَيْكَ، وَرَحْمَةُ اللهِ‏.‏","english":{"narrator":"","text":"Abu Jamra said, \"I heard Ibn 'Abbas say when he was greeted, 'And\nupon you and the mercy of Allah.'\""}},{"id":71,"idInBook":71,"chapterId":42,"bookId":15,"arabic":"قَالَ أَبُو عَبْدِ اللهِ‏:‏ وَقَالَتْ قَيْلَةُ‏:‏ قَالَ رَجُلٌ‏:‏ السَّلاَمُ عَلَيْكَ يَا رَسُولَ اللهِ، قَالَ‏:‏ وَعَلَيْكَ السَّلاَمُ وَرَحْمَةُ اللهِ‏.‏","english":{"narrator":"","text":"Qayla reported that a mans aid, \"Peace be upon you, may Allah\nbless him and grant him peace.\" He said, \"And peace be upon you and the\nmercy of Allah.\""}},{"id":72,"idInBook":72,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ مَسْلَمَةَ، قَالَ‏:‏ حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ، عَنْ حُمَيْدِ بْنِ هِلاَلٍ، عَنْ عَبْدِ اللهِ بْنِ الصَّامِتِ، عَنْ أَبِي ذَرٍّ قَالَ‏:‏ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم حِينَ فَرَغَ مِنْ صَلاَتِهِ، فَكُنْتُ أَوَّلَ مَنْ حَيَّاهُ بِتَحِيَّةِ الإِسْلاَمِ، فَقَالَ‏:‏ وَعَلَيْكَ، وَرَحْمَةُ اللهِ، مِمَّنْ أَنْتَ‏؟‏ قُلْتُ‏:‏ مِنْ غِفَارٍ‏.‏","english":{"narrator":"","text":"Abu Dharr said, \"I came to the Prophet, may Allah bless him and\ngrant him peace, when he had finished his prayer. I was the first person\nto be greeted with the greeting of Islam. He said, 'And on you and the\nmercy of Allah. From where have you come?' I said, 'From Ghifar.'\""}},{"id":73,"idInBook":73,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ قَالَ‏:‏ حَدَّثَنِي اللَّيْثُ قَالَ‏:‏ حَدَّثَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ أَنَّهُ قَالَ‏:‏ قَالَ أَبُو سَلَمَةَ، أَنَّ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ يَا عَائِشُ، هَذَا جِبْرِيلُ، وَهُوَ يَقْرَأُ عَلَيْكِ السَّلاَمَ، قَالَتْ‏:‏ فَقُلْتُ‏:‏ وَعَلَيْهِ السَّلاَمُ وَرَحْمَةُ اللهِ وَبَرَكَاتُهُ، تَرَى مَا لاَ أَرَى‏.‏ تُرِيدُ بِذَلِكَ رَسُولَ اللهِ صلى الله عليه وسلم‏.‏","english":{"narrator":"","text":"'A'isha reported, \"The Messenger of Allah, may Allah bless him\nand grant him peace, said, ''A'ish! This is Jibril who sends you greetings.'\nI said, 'And peace be upon him and the mercy of Allah and His blessings.\nYou see what I do not see.\" By that she meant the Messenger of Allah, may\nAllah bless him and grant him peace."}},{"id":74,"idInBook":74,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا مَطَرٌ، قَالَ‏:‏ حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، قَالَ‏:‏ حَدَّثَنَا بِسْطَامٌ قَالَ‏:‏ سَمِعْتُ مُعَاوِيَةَ بْنَ قُرَّةَ قَالَ‏:‏ قَالَ لِي أَبِي‏:‏ يَا بُنَيَّ، إِذَا مَرَّ بِكَ الرَّجُلُ فَقَالَ‏:‏ السَّلاَمُ عَلَيْكُمْ، فَلاَ تَقُلْ‏:‏ وَعَلَيْكَ، كَأَنَّكَ تَخُصُّهُ بِذَلِكَ وَحْدَهُ، فَإِنَّهُ لَيْسَ وَحْدَهُ، وَلَكِنْ قُلِ‏:‏ السَّلامُ عَلَيْكُمْ‏.‏","english":{"narrator":"","text":"Mu'awiya ibn Qurra said that his father said to him, \"My son,\nwhen a man passes by you and says, 'Peace be upon you (plural).' Do not\nsay, 'And on you (singular)' as if you were singling out that greeting\nout for him alone. Rather say, 'Peace be upon you (plural).'\""}},{"id":75,"idInBook":75,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا عَيَّاشُ بْنُ الْوَلِيدِ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الأَعْلَى، قَالَ‏:‏ حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ حُمَيْدِ بْنِ هِلاَلٍ، عَنْ عَبْدِ اللهِ بْنِ الصَّامِتِ قَالَ‏:‏ قُلْتُ لأَبِي ذَرٍّ‏:‏ مَرَرْتُ بِعَبْدِ الرَّحْمَنِ بْنِ أُمِّ الْحَكَمِ فَسَلَّمْتُ، فَمَا رَدَّ عَلَيَّ شَيْئًا‏؟‏ فَقَالَ‏:‏ يَا ابْنَ أَخِي، مَا يَكُونُ عَلَيْكَ مِنْ ذَلِكَ‏؟‏ رَدَّ عَلَيْكَ مَنْ هُوَ خَيْرٌ مِنْهُ، مَلَكٌ عَنْ يَمِينِهِ‏.‏","english":{"narrator":"","text":"'Abdullah ibn as-Samit said, \"I said to Abu Dharr, 'I passed by\n'Abdu'r-Rahman ibn Umm al-Hakam and I greeted him and he did not answer\nme at all. He said, 'Nephew, what harm have suffered from that? Someone\nbetter than him answered you ? the angel on his right.\""}},{"id":76,"idInBook":76,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، قَالَ‏:‏ حَدَّثَنَا أَبِي، قَالَ‏:‏ حَدَّثَنَا الأَعْمَشُ، قَالَ‏:‏ حَدَّثَنَا زَيْدُ بْنُ وَهْبٍ، عَنْ عَبْدِ اللهِ قَالَ‏:‏ إِنَّ السَّلاَمَ اسْمٌ مِنْ أَسْمَاءِ اللهِ، وَضَعَهُ اللَّهُ فِي الأَرْضِ، فَأَفْشُوهُ بَيْنَكُمْ، إِنَّ الرَّجُلَ إِذَا سَلَّمَ عَلَى الْقَوْمِ فَرَدُّوا عَلَيْهِ كَانَتْ لَهُ عَلَيْهِمْ فَضْلُ دَرَجَةٍ، لأَنَّهُ ذَكَّرَهُمُ السَّلاَمَ، وَإِنْ لَمْ يُرَدَّ عَلَيْهِ رَدَّ عَلَيْهِ مَنْ هُوَ خَيْرٌ مِنْهُ وَأَطْيَبُ‏.‏","english":{"narrator":"","text":"'Abdullah said, \"Peace is one of the Names of Allah which Allah\nhas placed on the earth. Extend it among you. When a man greets people\nand they answer him, then he has a higher degree than them because he reminds\nthem of peace. If no one answers him, he will be answered by one who is\nbetter and more excellent.'\""}},{"id":77,"idInBook":77,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنْ هِشَامٍ، عَنِ الْحَسَنِ قَالَ‏:‏ التَّسْلِيمُ تَطَوَّعٌ، وَالرَّدُّ فَرِيضَةٌ‏.‏","english":{"narrator":"","text":"Al-Hasan said, \"Greeting is an act of obedience while the answer\nis a duty.\""}},{"id":78,"idInBook":78,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ، قَالَ‏:‏ حَدَّثَنَا فُضَيْلُ بْنُ سُلَيْمَانَ، عَنْ مُوسَى بْنِ عُقْبَةَ قَالَ‏:‏ حَدَّثَنِي عُبَيْدُ اللهِ بْنُ سَلْمَانَ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللهِ بْنِ عَمْرِو بْنِ الْعَاصِ قَالَ‏:‏ الْكَذُوبُ مَنْ كَذَبَ عَلَى يَمِينِهِ، وَالْبَخِيلُ مَنْ بَخِلَ بِالسَّلاَمِ، وَالسَّرُوقُ مَنْ سَرَقَ الصَّلاةَ‏.‏","english":{"narrator":"","text":"'Abdullah ibn 'Amr ibn al-'As said, \"A liar is someone who lies\nin his oath. A miser is someone who is miserly with the greeting. A thief\nis someone who steals the prayer.\""}},{"id":79,"idInBook":79,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبَانَ، قَالَ‏:‏ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ عَاصِمٍ، عَنْ أَبِي عُثْمَانَ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ أَبْخَلُ النَّاسِ الَّذِي يَبْخَلُ بِالسَّلاَمِ، وَإِنَّ أَعْجَزَ النَّاسِ مَنْ عَجَزَ بِالدُّعَاءِ‏.‏","english":{"narrator":"","text":"Abu Hurayra said, \"The most miserly of people is the one who is\nmiserly with the greeting. The most incapable of people of people is the\none who is the most incapable of supplication.\""}},{"id":80,"idInBook":80,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ الْجَعْدِ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، عَنْ سَيَّارٍ، عَنْ ثَابِتٍ الْبُنَانِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّهُ مَرَّ عَلَى صِبْيَانٍ فَسَلَّمَ عَلَيْهِمْ، وَقَالَ‏:‏ كَانَ النَّبِيُّ صلى الله عليه وسلم يَفْعَلُهُ بِهِمْ‏.‏","english":{"narrator":"","text":"Thabit al-Bannani reported that Anas ibn Malik walked by some\nchildren and greeted them. He said, \"The Prophet, may Allah bless him and\ngrant him peace, used to do that.\""}},{"id":81,"idInBook":81,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ، قَالَ‏:‏ حَدَّثَنَا عِيسَى بْنُ يُونُسَ، عَنْ عَنْبَسَةَ قَالَ‏:‏ رَأَيْتُ ابْنَ عُمَرَ يُسَلِّمُ عَلَى الصِّبْيَانِ فِي الْكُتَّابِ‏.‏","english":{"narrator":"","text":"'Anbas said, \"I saw Ibn 'Umar greet children in the schools.\""}},{"id":82,"idInBook":82,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ يُوسُفَ، قَالَ‏:‏ أَخْبَرَنَا مَالِكٌ، عَنْ أَبِي النَّضْرِ، أَنَّ أَبَا مُرَّةَ مَوْلَى أُمِّ هَانِئِ ابْنَةِ أَبِي طَالِبٍ أَخْبَرَهُ، أَنَّهُ سَمِعَ أُمَّ هَانِئٍ تَقُولُ‏:‏ ذَهَبْتُ إِلَى النَّبِيِّ صلى الله عليه وسلم وَهُوَ يَغْتَسِلُ، فَسَلَّمْتُ عَلَيْهِ، فَقَالَ‏:‏ مَنْ هَذِهِ‏؟‏ قُلْتُ‏:‏ أُمُّ هَانِئٍ، قَالَ‏:‏ مَرْحَبًا‏.‏","english":{"narrator":"","text":"Umm Hani', the daughter of Abu Talib, said, \"I went to the Prophet,\nmay Allah bless him and grant him peace, while he was performing a major\nablution. I greeted him and he asked, 'Who is this?' 'Umm Hani',' I replied.\nHe said, 'Welcome.'\""}},{"id":83,"idInBook":83,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى، قَالَ‏:‏ حَدَّثَنَا مُبَارَكٌ قَالَ‏:‏ سَمِعْتُ الْحَسَنَ يَقُولُ‏:‏ كُنَّ النِّسَاءُ يُسَلِّمْنَ عَلَى الرِّجَالِ‏.‏","english":{"narrator":"","text":"Al-Hasan said, \"Be women who greet men.\""}},{"id":84,"idInBook":84,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ بَهْرَامَ، عَنْ شَهْرٍ قَالَ‏:‏ سَمِعْتُ أَسْمَاءَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم مَرَّ فِي الْمَسْجِدِ، وَعُصْبَةٌ مِنَ النِّسَاءِ قُعُودٌ، قَالَ بِيَدِهِ إِلَيْهِنَّ بِالسَّلاَمِ، فَقَالَ‏:‏ إِيَّاكُنَّ وَكُفْرَانَ الْمُنْعِمِينَ، إِيَّاكُنَّ وَكُفْرَانَ الْمُنْعِمِينَ، قَالَتْ إِحْدَاهُنَّ‏:‏ نَعُوذُ بِاللَّهِ، يَا نَبِيَّ اللهِ، مِنْ كُفْرَانِ نِعَمِ اللهِ، قَالَ‏:‏ بَلَى إِنَّ إِحْدَاكُنَّ تَطُولُ أَيْمَتُهَا، ثُمَّ تَغْضَبُ الْغَضْبَةَ فَتَقُولُ‏:‏ وَاللَّهِ مَا رَأَيْتُ مِنْهُ سَاعَةً خَيْرًا قَطُّ، فَذَلِكَ كُفْرَانُ نِعَمِ اللهِ، وَذَلِكَ كُفْرَانُ نِعَمِ الْمُنْعِمِينَ‏.‏","english":{"narrator":"","text":"Asma' was heard to say that the Prophet, may Allah bless him and\ngrant him peace, passed by a group of women sitting down in the mosque.\nHe said to the salam with his hand and said, \"Beware of the ingratitude\nof those with blessings. Beware of the ingratitude of those with blessings.\"\nOne of them said, \"We seek refuge with Prophet, Prophet of Allah, from\ningratitude for the blessings of Allah.\" He said, \"Yes. One of you women\nmight have been without a husband for a long time (and then Allah provides\nher with one) and she becomes angry and says, 'By Allah, I have never seen\na hour of good from you. That is ingratitude for the blessings of Allah.\nThat is the ingratitude of those with blessings.'\""}},{"id":85,"idInBook":85,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا مَخْلَدٌ، قَالَ‏:‏ حَدَّثَنَا مُبَشِّرُ بْنُ إِسْمَاعِيلَ، عَنِ ابْنِ أَبِي غَنِيَّةَ، عَنْ مُحَمَّدِ بْنِ مُهَاجِرٍ، عَنْ أَبِيهِ، عَنْ أَسْمَاءَ ابْنَةِ يَزِيدَ الأَنْصَارِيَّةِ، مَرَّ بِيَ النَّبِيُّ صلى الله عليه وسلم وَأَنَا فِي جِوَارِ أَتْرَابٍ لِي، فَسَلَّمَ عَلَيْنَا وَقَالَ‏:‏ إِيَّاكُنَّ وَكُفْرَ الْمُنْعِمِينَ، وَكُنْتُ مِنْ أَجْرَئِهِنَّ عَلَى مَسْأَلَتِهِ، فَقُلْتُ‏:‏ يَا رَسُولَ اللهِ، وَمَا كُفْرُ الْمُنْعِمِينَ‏؟‏ قَالَ‏:‏ لَعَلَّ إِحْدَاكُنَّ تَطُولُ أَيْمَتُهَا مِنْ أَبَوَيْهَا، ثُمَّ يَرْزُقُهَا اللَّهُ زَوْجًا، وَيَرْزُقُهَا مِنْهُ وَلَدًا، فَتَغْضَبُ الْغَضْبَةَ فَتَكْفُرُ فَتَقُولُ‏:‏ مَا رَأَيْتُ مِنْكَ خَيْرًا قَطُّ‏.‏","english":{"narrator":"","text":"Asma', the daughter of Yazid al-Ansari, said, \"The Prophet, may\nAllah bless him and grant him peace, passed by me while I was with some\nyoung slavegirls belonging to me. He greeted us and said, 'Beware of the\ningratitude of those with blessings.' I was the boldest of them in coming\nforward to question him and I said, 'Messenger of Allah, what is the ingratitude\nof those with blessings?' He replied, 'Perhaps one of them with remain\nunmarried for a long time with her parents and then Allah provides her\nwith a husband and provides her with children from him and then she gets\nangry and is ungrateful and says, \"I have never seen any good at all from\nyou.\"'\""}},{"id":86,"idInBook":86,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، عَنْ بَشِيرِ بْنِ سَلْمَانَ، عَنْ سَيَّارٍ أَبِي الْحَكَمِ، عَنْ طَارِقٍ قَالَ‏:‏ كُنَّا عِنْدَ عَبْدِ اللهِ جُلُوسًا، فَجَاءَ آذِنُهُ فَقَالَ‏:‏ قَدْ قَامَتِ الصَّلاَةُ، فَقَامَ وَقُمْنَا مَعَهُ، فَدَخَلْنَا الْمَسْجِدَ، فَرَأَى النَّاسَ رُكُوعًا فِي مُقَدَّمِ الْمَسْجِدِ، فَكَبَّرَ وَرَكَعَ، وَمَشَيْنَا وَفَعَلْنَا مِثْلَ مَا فَعَلَ، فَمَرَّ رَجُلٌ مُسْرِعٌ فَقَالَ‏:‏ عَلَيْكُمُ السَّلاَمُ يَا أَبَا عَبْدِ الرَّحْمَنِ، فَقَالَ‏:‏ صَدَقَ اللَّهُ، وَبَلَّغَ رَسُولُهُ، فَلَمَّا صَلَّيْنَا رَجَعَ، فَوَلَجَ عَلَى أَهْلِهِ، وَجَلَسْنَا فِي مَكَانِنَا نَنْتَظِرُهُ حَتَّى يَخْرُجَ، فَقَالَ بَعْضُنَا لِبَعْضٍ‏:‏ أَيُّكُمْ يَسْأَلُهُ‏؟‏ قَالَ طَارِقٌ‏:‏ أَنَا أَسْأَلُهُ، فَسَأَلَهُ، فَقَالَ‏:‏ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ بَيْنَ يَدَيِ السَّاعَةِ‏:‏ تَسْلِيمُ الْخَاصَّةِ، وَفُشُوُّ التِّجَارَةِ حَتَّى تُعِينَ الْمَرْأَةُ زَوْجَهَا عَلَى التِّجَارَةِ، وَقَطْعُ الأَرْحَامِ، وَفُشُوُّ الْقَلَمِ، وَظُهُورُ الشَّهَادَةِ بِالزُّورِ، وَكِتْمَانُ شَهَادَةِ الْحَقِّ‏.‏","english":{"narrator":"","text":"Tariq said, \"We were sitting with 'Abdullah when his doorkeeper\ncame and said, 'The iqama for the prayer has been given.' He got up and\nwe got up as well and went to the mosque. He saw the people doing ruku'\nat the front of the mosque. He said the takbir, bowed, and we went and\ndid the same thing that he had done. Then a man rushed past and said, 'Peace\nbe upon you, Abu 'Abdu'r-Rahman.' He said, 'Allah has spoken the truth\nand His Messenger conveyed the Message.' When we finished the prayer, he\nreturned and went back to is people. We remained sitting in our places,\nwaiting for him until he came out. We said to each other, 'Which of us\nwill ask him?' Tariq said, 'I will ask him,' and he did so. 'Abdullah said,\n'From the Prophet, may Allah bless him and grant him peace, who said, \"Before\nthe Final Hour people will single out one individual for the greeting,\ncommerce will increase until a woman helps her husband in business, people\nwill sever their links with their relatives, knowledge will spread, false\ntestimony will appear and true testimony will be concealed.\"'\""}},{"id":87,"idInBook":87,"chapterId":42,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ صَالِحٍ قَالَ‏:‏ حَدَّثَنِي اللَّيْثُ قَالَ‏:‏ حَدَّثَنِي يَزِيدُ بْنُ أَبِي حَبِيبٍ، عَنْ أَبِي الْخَيْرِ، عَنْ عَبْدِ اللهِ بْنِ عَمْرٍو، أَنَّ رَجُلاً سَأَلَ رَسُولَ اللهِ صلى الله عليه وسلم‏:‏ أَيُّ الإِسْلاَمِ خَيْرٌ‏؟‏ قَالَ‏:‏ تُطْعِمُ الطَّعَامَ، وَتَقْرَأُ السَّلاَمَ عَلَى مَنْ عَرَفْتَ وَمَنْ لَمْ تَعْرِفْ‏.‏","english":{"narrator":"","text":"'Abdullah ibn 'Amr reported that a man asked the Messenger of\nAllah, may Allah bless him and grant him peace, \"Which is the best of Islam?\"\nHe replied, \"Feeding people and giving the greeting to those you know and\nthose you do not know.\""}}],"chapter":{"id":42,"bookId":15,"arabic":"كتاب السَّلامِ","english":"Greetings"}}