{"metadata":{"length":50,"arabic":{"title":"الأدب المفرد","author":"الإمام محمد بن إسماعيل البخاري","introduction":"كتاب الاسْتِئْذَانُ"},"english":{"title":"Al-Adab Al-Mufrad","author":"Imam Muhammad ibn Ismail al-Bukhari","introduction":"Asking Permission"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":43,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ صَالِحٍ قَالَ‏:‏ حَدَّثَنِي اللَّيْثُ قَالَ‏:‏ حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ قَالَ‏:‏ أَخْبَرَنِي أَنَسٌ، أَنَّهُ كَانَ ابْنَ عَشْرِ سِنِينَ مَقْدَمَ رَسُولِ اللهِ صلى الله عليه وسلم الْمَدِينَةَ، فَكُنَّ أُمَّهَاتِي يُوَطِّوَنَّنِي عَلَى خِدْمَتِهِ، فَخَدَمْتُهُ عَشْرَ سِنِينَ، وَتُوُفِّيَ وَأَنَا ابْنُ عِشْرِينَ، فَكُنْتُ أَعْلَمَ النَّاسِ بِشَأْنِ الْحِجَابِ، فَكَانَ أَوَّلُ مَا نَزَلَ مَا ابْتَنَى رَسُولُ اللهِ صلى الله عليه وسلم بِزَيْنَبَ بِنْتِ جَحْشٍ، أَصْبَحَ بِهَا عَرُوسًا، فَدَعَى الْقَوْمَ فَأَصَابُوا مِنَ الطَّعَامِ، ثُمَّ خَرَجُوا، وَبَقِيَ رَهْطٌ عِنْدَ النَّبِيِّ صلى الله عليه وسلم، فَأَطَالُوا الْمُكْثَ، فَقَامَ فَخَرَجَ وَخَرَجْتُ لِكَيْ يَخْرُجُوا، فَمَشَى فَمَشَيْتُ مَعَهُ، حَتَّى جَاءَ عَتَبَةَ حُجْرَةِ عَائِشَةَ، ثُمَّ ظَنَّ أَنَّهُمْ خَرَجُوا، فَرَجَعَ وَرَجَعْتُ مَعَهُ حَتَّى دَخَلَ عَلَى زَيْنَبَ، فَإِذَا هُمْ جُلُوسٌ، فَرَجَعَ وَرَجَعْتُ حَتَّى بَلَغَ عَتَبَةَ حُجْرَةِ عَائِشَةَ، وَظَنَّ أَنَّهُمْ خَرَجُوا، فَرَجَعَ وَرَجَعْتُ مَعَهُ، فَإِذَا هُمْ قَدْ خَرَجُوا، فَضَرَبَ النَّبِيُّ صلى الله عليه وسلم بَيْنِي وَبَيْنَهُ السِّتْرَ، وَأَنْزَلَ الْحِجَابَ‏.‏","english":{"narrator":"","text":"Anas said that he was ten years old when the Messenger of Allah,\nmay Allah bless him and grant him peace, came to Madina. He said, \"My mothers\ndecided that I would serve him and I served him for ten years. He died\nwhen I was twenty. I am the person who knows best about the business of\nthe veil. The first instance that was revealed occurred when the Messenger\nof Allah, may Allah bless him and grant him peace, built a room for Zaynab\nbint Jahsh. He celebrated the wedding there, invited the people who came,\nate and then left. A group remained with the Prophet, may Allah bless him\nand grant him peace. They stayed for a long time and then the Prophet went\nout and I went out hoping that they would leave. He walked and I walked\nwith him until he came to the threshold of 'A'isha's room. Then, thinking\nthat they would have left, he returned and I returned with him. He went\nto Zaynab but they were still sitting there. He left again and I left with\nhim until he once more reached the threshold of 'A'isha's room. When he\nthought that they would have gone, he went back again and I went back with\nhim. This time they had indeed left. The Prophet, may Allah bless him and\ngrant him peace, then put up a curtain between me and him, and the veil\nwas revealed.\""}},{"id":2,"idInBook":2,"chapterId":43,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللهِ، قَالَ‏:‏ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ صَالِحِ بْنِ كَيْسَانَ، عَنِ ابْنِ شِهَابٍ، عَنْ ثَعْلَبَةَ بْنِ أَبِي مَالِكٍ الْقُرَظِيِّ، أَنَّهُ رَكِبَ إِلَى عَبْدِ اللهِ بْنِ سُوَيْدٍ، أَخِي بَنِي حَارِثَةَ بْنِ الْحَارِثِ، يَسْأَلُهُ عَنِ الْعَوْرَاتِ الثَّلاَثِ، وَكَانَ يَعْمَلُ بِهِنَّ، فَقَالَ‏:‏ مَا تُرِيدُ‏؟‏ فَقُلْتُ‏:‏ أُرِيدُ أَنْ أَعْمَلَ بِهِنَّ، فَقَالَ‏:‏ إِذَا وَضَعْتُ ثِيَابِي مِنَ الظَّهِيرَةِ لَمْ يَدْخُلْ عَلَيَّ أَحَدٌ مِنْ أَهْلِي بَلَغَ الْحُلُمَ إِلاَّ بِإِذْنِي، إِلاَّ أَنْ أَدْعُوَهُ، فَذَلِكَ إِذْنُهُ‏.‏ وَلاَ إِذَا طَلَعَ الْفَجْرُ وَتَحَرَّكَ النَّاسُ حَتَّى تُصَلَّى الصَّلاَةُ‏.‏ وَلاَ إِذَا صَلَّيْتُ الْعِشَاءَ وَوَضَعْتُ ثِيَابِي حَتَّى أَنَامَ‏.‏","english":{"narrator":"","text":"Tha'laba ibn Abi Malik al-Qurazi reported that he rode to 'Abdullah\nibn Suwayd, one of the Banu Haritha ibn al-Harith, to ask him about the\nthree times of nakedness. 'Abdullah used to observe these times. Tha'laba\nsaid, \"'Abdullah asked, 'What do you want?' I replied, 'I want to observe\nthem.' He said, 'When I take off my garment at midday, none of my family\nwho have reached puberty comes to me without my permission unless I call\nthem. Nor do they do that when it is Fajr until people know that I have\nprayed, nor when I have prayed 'Isha' and removed my clothes so that I\ncan sleep.'\""}},{"id":3,"idInBook":3,"chapterId":43,"bookId":15,"arabic":"حَدَّثَنَا الْحُمَيْدِيُّ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنْ مِسْعَرٍ، عَنْ مُوسَى بْنِ أَبِي كَثِيرٍ، عَنْ مُجَاهِدٍ، عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ‏:‏ كُنْتُ آكُلُ مَعَ النَّبِيِّ صلى الله عليه وسلم حَيْسًا، فَمَرَّ عُمَرُ، فَدَعَاهُ فَأَكَلَ، فَأَصَابَتْ يَدُهُ إِصْبَعِي، فَقَالَ‏:‏ حَسِّ، لَوْ أُطَاعُ فَيَكُنَّ مَا رَأَتْكُنَّ عَيْنٌ‏.‏ فَنَزَلَ الْحِجَابُ‏.‏","english":{"narrator":"","text":"'A'isha said, \"I used to eat date and butter mixture with the\nProphet, may Allah bless him and grant him peace. 'Umar visited and the\nProphet invited him and he ate. 'Umar's hand touched my fingers and he\nsaid, 'Oh! If I were to be obeyed about you, no eye would ever see you!'\nThen the veil was revealed.\""}},{"id":4,"idInBook":4,"chapterId":43,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ قَالَ‏:‏ حَدَّثَنِي خَارِجَةُ بْنُ الْحَارِثِ بْنِ رَافِعِ بْنِ مَكِيثٍ الْجُهَنِيُّ، عَنْ سَالِمِ بْنِ سَرْجٍ مَوْلَى أُمِّ صَبِيَّةَ بِنْتِ قَيْسٍ وَهِيَ خَوْلَةُ، وَهِيَ جَدَّةُ خَارِجَةَ بْنِ الْحَارِثِ، أَنَّهُ سَمِعَهَا تَقُولُ‏:‏ اخْتَلَفَتْ يَدِي وَيَدُ رَسُولِ اللهِ صلى الله عليه وسلم فِي إِنَاءٍ وَاحِدٍ‏.‏","english":{"narrator":"","text":"Umm Habiba bint Qays (Khawla) was heard to say, \"My hand and that\nof the Messenger of Allah, may Allah bless him and grant him peace, mixed\ntogether in the same vessel.\""}},{"id":5,"idInBook":5,"chapterId":43,"bookId":15,"arabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ قَالَ‏:‏ حَدَّثَنِي مَعْنٌ قَالَ‏:‏ حَدَّثَنِي هِشَامُ بْنُ سَعْدٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللهِ بْنَ عُمَرَ قَالَ‏:‏ إِذَا دَخَلَ الْبَيْتَ غَيْرَ الْمَسْكُونِ فَلْيَقُلِ‏:‏ السَّلاَمُ عَلَيْنَا وَعَلَى عِبَادِ اللهِ الصَّالِحِينَ‏.‏","english":{"narrator":"","text":"'Abdullah ibn 'Umar said, \"When someone enters a house which is\nnot lived in, he should say, 'Peace be upon the righteous slaves of Allah.'\""}},{"id":6,"idInBook":6,"chapterId":43,"bookId":15,"arabic":"حَدَّثَنَا إِسْحَاقُ، قَالَ‏:‏ حَدَّثَنَا عَلِيُّ بْنُ الْحُسَيْنِ قَالَ‏:‏ حَدَّثَنِي أَبِي، عَنْ يَزِيدَ النَّحْوِيِّ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ قَالَ‏:‏ ‏{‏لاَ تَدْخُلُوا بُيُوتًا غَيْرَ بُيُوتِكُمْ حَتَّى تَسْتَأْنِسُوا وَتُسَلِّمُوا عَلَى أَهْلِهَا‏}‏، وَاسْتَثْنَى مِنْ ذَلِكَ، فَقَالَ‏:‏ ‏{‏لَيْسَ عَلَيْكُمْ جُنَاحٌ أَنْ تَدْخُلُوا بُيُوتًا غَيْرَ مَسْكُونَةٍ فِيهَا مَتَاعٌ لَكُمْ وَاللهُ يَعْلَمُ مَا تُبْدُونَ وَمَا تَكْتُمُونَ‏}‏‏.‏","english":{"narrator":"","text":"Ibn 'Abbas said, \"The verse, 'Do not enter houses other than\nyour own until you have asked permission and greeted their inhabitants'\n(24:27) has an exception made to it when Allah says, 'There is nothing\nwrong in your entering houses where no one lives where there is some service\nfor you. Allah knows what you divulge and what you conceal.'\""}},{"id":7,"idInBook":7,"chapterId":43,"bookId":15,"arabic":"حَدَّثَنَا عُثْمَانُ بْنُ مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا يَحْيَى بْنُ الْيَمَانِ، عَنْ شَيْبَانَ، عَنْ لَيْثٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ‏:‏ ‏{‏لِيَسْتَأْذِنْكُمُ الَّذِينَ مَلَكَتْ أَيْمَانُكُمْ‏}‏، قَالَ‏:‏ هِيَ لِلرِّجَالِ دُونَ النِّسَاءِ‏.‏","english":{"narrator":"","text":"Regarding the ayat, \"Those you own as slaves should ask your\npermission to enter\" (24:56), Ibn 'Umar said, \"That applies to men\nrather than women.\""}},{"id":8,"idInBook":8,"chapterId":43,"bookId":15,"arabic":"حَدَّثَنَا مَطَرُ بْنُ الْفَضْلِ، قَالَ‏:‏ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، عَنْ هِشَامٍ الدَّسْتُوَائِيِّ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّهُ كَانَ إِذَا بَلَغَ بَعْضُ وَلَدِهِ الْحُلُمَ عَزَلَهُ، فَلَمْ يَدْخُلْ عَلَيْهِ إِلا بِإِذْنٍ‏.‏","english":{"narrator":"","text":"Ibn 'Umar reported that when his children had reached puberty\nand he had withdrawn to his room, none of them entered where he was except\nwith his permission."}},{"id":9,"idInBook":9,"chapterId":43,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ قَالَ‏:‏ جَاءَ رَجُلٌ إِلَى عَبْدِ اللهِ قَالَ‏:‏ أَسْتَأْذِنُ عَلَى أُمِّي‏؟‏ فَقَالَ‏:‏ مَا عَلَى كُلِّ أَحْيَانِهَا تُحِبُّ أَنْ تَرَاهَا‏.‏","english":{"narrator":"","text":"'Alqama said, \"A man came to 'Abdullah and said, 'Should I ask\npermission to go in where my mother is?' He said, 'At all times. Do you\nwant to see her (exposed)?'\""}},{"id":10,"idInBook":10,"chapterId":43,"bookId":15,"arabic":"حَدَّثَنَا آدَمُ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ قَالَ‏:‏ سَمِعْتُ مُسْلِمَ بْنَ نَذِيرٍ يَقُولُ‏:‏ سَأَلَ رَجُلٌ حُذَيْفَةَ فَقَالَ‏:‏ أَسْتَأْذِنُ عَلَى أُمِّي‏؟‏ فَقَالَ‏:‏ إِنْ لَمْ تَسْتَأْذِنْ عَلَيْهَا رَأَيْتَ مَا تَكْرَهُ‏.‏","english":{"narrator":"","text":"Muslim ibn Nadhir said, \"A man asked Hudhayfa, 'Should I ask permission\nto enter where my mother is?' He replied, 'If you were not to ask her permission,\nyou would see what you dislike.'\""}},{"id":11,"idInBook":11,"chapterId":43,"bookId":15,"arabic":"حَدَّثَنَا فَرْوَةُ، قَالَ‏:‏ حَدَّثَنَا الْقَاسِمُ بْنُ مَالِكٍ، عَنْ لَيْثٍ، عَنْ عُبَيْدِ اللهِ، عَنْ مُوسَى بْنِ طَلْحَةَ قَالَ‏:‏ دَخَلْتُ مَعَ أَبِي عَلَى أُمِّي، فَدَخَلَ فَاتَّبَعْتُهُ، فَالْتَفَتَ فَدَفَعَ فِي صَدْرِي حَتَّى أَقْعَدَنِي عَلَى اسْتِي، قَالَ‏:‏ أَتَدْخُلُ بِغَيْرِ إِذْنٍ‏؟‏‏.‏","english":{"narrator":"","text":"Musa ibn Talha said, \"I entered where my mother was with my father.\nHe went in and I followed him. He turned and pushed me in the chest so\nthat I fell on my bottom. Then he said, 'Will you enter without permission!'\""}},{"id":12,"idInBook":12,"chapterId":43,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبَانَ، قَالَ‏:‏ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ أَشْعَثَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ قَالَ‏:‏ يَسْتَأْذِنُ الرَّجُلُ عَلَى وَلَدِهِ، وَأُمِّهِ، وَإِنْ كَانَتْ عَجُوزًا، وَأَخِيهِ، وَأُخْتِهِ، وَأَبِيهِ‏.‏","english":{"narrator":"","text":"Jabir said, \"A man should ask permission from his son and his\nmother, even if she is old, his brother, his sister and his father.\""}},{"id":13,"idInBook":13,"chapterId":43,"bookId":15,"arabic":"حَدَّثَنَا الْحُمَيْدِيُّ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، قَالَ‏:‏ حَدَّثَنَا عَمْرٌو، وَابْنُ جُرَيْجٍ، عَنْ عَطَاءٍ قَالَ‏:‏ سَأَلْتُ ابْنَ عَبَّاسٍ فَقُلْتُ‏:‏ أَسْتَأْذِنُ عَلَى أُخْتِي‏؟‏ فَقَالَ‏:‏ نَعَمْ، فَأَعَدْتُ فَقُلْتُ‏:‏ أُخْتَانِ فِي حِجْرِي، وَأَنَا أُمَوِّنُهُمَا وَأُنْفِقُ عَلَيْهِمَا، أَسْتَأْذِنُ عَلَيْهِمَا‏؟‏ قَالَ‏:‏ نَعَمْ، أَتُحِبُّ أَنْ تَرَاهُمَا عُرْيَانَتَيْنِ‏؟‏ ثُمَّ قَرَأَ‏:‏ ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا لِيَسْتَأْذِنْكُمُ الَّذِينَ مَلَكَتْ أَيْمَانُكُمْ‏}‏ إِلَى ‏{‏ثَلاَثُ عَوْرَاتٍ لَكُمْ‏}‏، قَالَ‏:‏ فَلَمْ يُؤْمَرْ هَؤُلاَءِ بِالإِذْنِ إِلاَّ فِي هَذِهِ الْعَوْرَاتِ الثَّلاَثِ، قَالَ‏:‏ ‏{‏وَإِذَا بَلَغَ الأَطْفَالُ مِنْكُمُ الْحُلُمَ فَلْيَسْتَأْذِنُوا كَمَا اسْتَأْذَنَ الَّذِينَ مِنْ قَبْلِهِمْ‏}‏","english":{"narrator":"'Ata' said, \"I asked Ibn 'Abbas, 'Does one ask permission of one's\nsister?' He replied, 'Yes.' I repeated it and said, 'My two sisters live\nin my room and I provide for them and spend on them, so do I ask them for\npermission?' He said, 'Yes. Do you want to see them naked?' Then he recited,\n'O\nyou who believe! Those you own as slaves and those of you who have not\nas yet reached puberty should ask your permission to enter at three times:","text":"before the Dawn Prayer and when you have undressed at noon and after the\nNight Prayer - three times of nakedness for you.' (24:56) Ibn 'Abbas\nsaid, 'He did not command these individuals to ask permission other than\nat these three times of nakedness.' Then he went on to say, 'The verse\nin Surat an-Nur:57 is: 'Once your children have reached puberty, they should\nask your permission to enter as those before them also asked permission.'\""}},{"id":14,"idInBook":14,"chapterId":43,"bookId":15,"arabic":"حَدَّثَنَا قُتَيْبَةُ، قَالَ‏:‏ حَدَّثَنَا عَبْثَرٌ، عَنْ أَشْعَثَ، عَنْ كُرْدُوسٍ، عَنْ عَبْدِ اللهِ قَالَ‏:‏ يَسْتَأْذِنُ الرَّجُلُ عَلَى أَبِيهِ، وَأُمِّهِ، وَأَخِيهِ، وَأُخْتِهِ‏.‏","english":{"narrator":"","text":"'Abdullah said, \"A man asks permission of his father, his mother,\nhis brother and his sister.\""}},{"id":15,"idInBook":15,"chapterId":43,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، قَالَ‏:‏ أَخْبَرَنَا مَخْلَدٌ، قَالَ‏:‏ أَخْبَرَنَا ابْنُ جُرَيْجٍ قَالَ‏:‏ أَخْبَرَنِي عَطَاءٌ، عَنْ عُبَيْدِ بْنِ عُمَيْرٍ، أَنَّ أَبَا مُوسَى الأَشْعَرِيَّ اسْتَأْذَنَ عَلَى عُمَرَ بْنِ الْخَطَّابِ، فَلَمْ يُؤَذَنْ لَهُ، وَكَأَنَّهُ كَانَ مَشْغُولاً، فَرَجَعَ أَبُو مُوسَى، فَفَرَغَ عُمَرُ فَقَالَ‏:‏ أَلَمْ أَسْمَعْ صَوْتَ عَبْدِ اللهِ بْنِ قَيْسٍ‏؟‏ إِيذَنُوا لَهُ، قِيلَ‏:‏ قَدْ رَجَعَ، فَدَعَاهُ، فَقَالَ‏:‏ كُنَّا نُؤْمَرُ بِذَلِكَ، فَقَالَ‏:‏ تَأْتِينِي عَلَى ذَلِكَ بِالْبَيِّنَةِ، فَانْطَلَقَ إِلَى مَجْلِسِ الأَنْصَارِ فَسَأَلَهُمْ، فَقَالُوا‏:‏ لاَ يَشْهَدُ لَكَ عَلَى هَذَا إِلاَّ أَصْغَرُنَا‏:‏ أَبُو سَعِيدٍ الْخُدْرِيُّ فَذَهَبَ بِأَبِي سَعِيدٍ، فَقَالَ عُمَرُ‏:‏ أَخَفِيَ عَلَيَّ مِنْ أَمْرِ رَسُولِ اللهِ صلى الله عليه وسلم‏؟‏ أَلْهَانِي الصَّفْقُ بِالأَسْوَاقِ، يَعْنِي الْخُرُوجَ إِلَى التِّجَارَةِ‏.‏","english":{"narrator":"","text":"'Ubayd ibn 'Umayr reported that Abu Musa al-Ash'ari asked permission\nof 'Umar ibn al-Khattab, but he did not grant him permission. It seemed\nthat he was busy. Abu Musa came back and 'Umar had finished. He said, \"Didn't\nI hear the voice of 'Abdullah ibn Qays? Give him permission to enter.\"\nHe was told, \"He has gone away,\" so he sent after him. Abu Musa said, \"We\nwere commanded to behave like that (i.e. to go away after having asked\npermission to enter three times).\" 'Umar said, \"Bring me a clear proof\nof it.\" He then went to the gathering of the Ansar and questioned them.\nThey said, \"Only the youngest of us will attest to that - Abu Sa'id\nal-Khudri.\" He went with Abu Sa'id. 'Umar said, \"Is something of what the\nmay Allah bless him and grant him peace,, may Allah bless him and grant\nhim peace, commanded hidden from me? Doing business in the markets distracted\nme,\" i.e. going out to trade."}},{"id":16,"idInBook":16,"chapterId":43,"bookId":15,"arabic":"حَدَّثَنَا بَيَانُ، قَالَ‏:‏ حَدَّثَنَا يَزِيدُ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ أَبِي سُلَيْمَانَ، عَنْ عَطَاءٍ، عَنْ أَبِي هُرَيْرَةَ فِيمَنْ يَسْتَأْذِنُ قَبْلَ أَنْ يُسَلِّمَ قَالَ‏:‏ لاَ يُؤْذَنُ لَهُ حَتَّى يَبْدَأَ بِالسَّلامِ‏.‏","english":{"narrator":"","text":"Regarding the person who asks for permission to enter before he\ngives the greeting, Abu Hurayra said, \"He is not given permission until\nhe has first given the greeting.\""}},{"id":17,"idInBook":17,"chapterId":43,"bookId":15,"arabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، قَالَ‏:‏ أَخْبَرَنَا هِشَامٌ، أَنَّ ابْنَ جُرَيْجٍ أَخْبَرَهُمْ قَالَ‏:‏ سَمِعْتُ عَطَاءً، قَالَ‏:‏ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُ‏:‏ إِذَا دَخَلَ وَلَمْ يَقُلِ‏:‏ السَّلاَمُ عَلَيْكُمْ، فَقُلْ‏:‏ لاَ، حَتَّى يَأْتِيَ بِالْمِفْتَاحِ‏:‏ السَّلامِ‏.‏","english":{"narrator":"","text":"Abu Hurayra said, \"When someone comes in and does not say, 'Peace\nbe upon you,' then say, 'No,' until he brings the key which is the greeting\n(salam).\""}},{"id":18,"idInBook":18,"chapterId":43,"bookId":15,"arabic":"حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ‏:‏ أَخْبَرَنَا شُعَيْبٌ، قَالَ‏:‏ حَدَّثَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ لَوْ اطَّلَعَ رَجُلٌ فِي بَيْتِكَ، فَخَذَفْتَهُ بِحَصَاةٍ فَفَقَأْتَ عَيْنَهُ، مَا كَانَ عَلَيْكَ جُنَاحٌ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"If a man looks into your house and you take some\npebbles and gouge out his eye, there is no fault in you.\""}},{"id":19,"idInBook":19,"chapterId":43,"bookId":15,"arabic":"حَدَّثَنَا حَجَّاجٌ، قَالَ‏:‏ حَدَّثَنَا حَمَّادٌ، قَالَ‏:‏ حَدَّثَنَا إِسْحَاقُ بْنُ عَبْدِ اللهِ، عَنْ أَنَسٍ قَالَ‏:‏ كَانَ النَّبِيُّ صلى الله عليه وسلم قَائِمًا يُصَلِّي، فَاطَّلَعَ رَجُلٌ فِي بَيْتِهِ، فَأَخَذَ سَهْمًا مِنْ كِنَانَتِهِ، فَسَدَّدَ نَحْوَ عَيْنَيْهِ‏.‏","english":{"narrator":"","text":"Anas said, \"The Prophet, may Allah bless him and grant him peace,\nwas standing in prayer and a man looked into his room. He took an arrow\nfrom his quiver and aimed it at his eyes.\""}},{"id":20,"idInBook":20,"chapterId":43,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ صَالِحٍ، قَالَ‏:‏ حَدَّثَنَا اللَّيْثُ قَالَ‏:‏ حَدَّثَنِي ابْنُ شِهَابٍ، أَنَّ سَهْلَ بْنَ سَعْدٍ أَخْبَرَهُ، أَنَّ رَجُلاً اطَّلَعَ مِنْ جُحْرٍ فِي بَابِ النَّبِيِّ صلى الله عليه وسلم، وَمَعَ النَّبِيِّ صلى الله عليه وسلم مِدْرًى يَحُكُّ بِهِ رَأْسَهُ، فَلَمَّا رَآهُ النَّبِيُّ صلى الله عليه وسلم قَالَ‏:‏ لَوْ أَعْلَمُ أَنَّكَ تَنْتَظِرُنِي لَطَعَنْتُ بِهِ فِي عَيْنِكَ‏.‏","english":{"narrator":"","text":"Sahl ibn Sa'd told him that a man looked from a room through the\ndoor of the Prophet, may Allah bless him and grant him peace, while the\nProphet, may Allah bless him and grant him peace, had a comb with which\nhe was scratching his hair. When the Prophet, may Allah bless him and grant\nhim peace, saw him, he said, \"If I had known that you were looking at me,\nI would have stabbed you in the eye with this!\""}},{"id":21,"idInBook":21,"chapterId":43,"bookId":15,"arabic":"وَقَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ إِنَّمَا جُعِلَ الإِذْنُ مِنْ أَجْلِ الْبَصَرِ‏.‏","english":{"narrator":"","text":"The Prophet, may Allah bless him and grant him peace, said, \"The\near is put in the place of the eye.\""}},{"id":22,"idInBook":22,"chapterId":43,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، قَالَ‏:‏ أَخْبَرَنَا الْفَزَارِيُّ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ قَالَ‏:‏ اطَّلَعَ رَجُلٌ مِنْ خَلَلٍ فِي حُجْرَةِ النَّبِيِّ صلى الله عليه وسلم، فَسَدَّدَ رَسُولُ اللهِ صلى الله عليه وسلم بِمِشْقَصٍ، فَأَخْرَجَ الرَّجُلُ رَأْسَهُ‏.‏","english":{"narrator":"","text":"Anas said, \"A man looked through a gap into the room of the Prophet,\nmay Allah bless him and grant him peace, and the Messenger of Allah aimed\nan arrow-head at him, and the man withdrew his head.\""}},{"id":23,"idInBook":23,"chapterId":43,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ صَالِحٍ قَالَ‏:‏ حَدَّثَنِي اللَّيْثُ، عَنْ خَالِدِ بْنِ يَزِيدَ، عَنْ سَعِيدِ بْنِ أَبِي هِلاَلٍ، عَنْ مَرْوَانَ بْنِ عُثْمَانَ، أَنَّ عُبَيْدَ بْنَ عُمَيْرٍ أَخْبَرَهُ، عَنْ أَبِي مُوسَى قَالَ‏:‏ اسْتَأْذَنْتُ عَلَى عُمَرَ، فَلَمْ يُؤْذَنْ لِي ثَلاَثًا، فَأَدْبَرْتُ، فَأَرْسَلَ إِلَيَّ فَقَالَ‏:‏ يَا عَبْدَ اللهِ، اشْتَدَّ عَلَيْكَ أَنْ تُحْتَبَسَ عَلَى بَابِي‏؟‏ اعْلَمْ أَنَّ النَّاسَ كَذَلِكَ يَشْتَدُّ عَلَيْهِمْ أَنْ يُحْتَبَسُوا عَلَى بَابِكَ، فَقُلْتُ‏:‏ بَلِ اسْتَأْذَنْتُ عَلَيْكَ ثَلاَثًا، فَلَمْ يُؤْذَنْ لِي، فَرَجَعْتُ، فَقَالَ‏:‏ مِمَّنْ سَمِعْتَ هَذَا‏؟‏ فَقُلْتُ‏:‏ سَمِعْتُهُ مِنَ النَّبِيِّ صلى الله عليه وسلم، فَقَالَ‏:‏ أَسَمِعْتَ مِنَ النَّبِيِّ صلى الله عليه وسلم مَا لَمْ نَسْمَعْ‏؟‏ لَئِنْ لَمْ تَأْتِنِي عَلَى هَذَا بِبَيِّنَةٍ لَأَجْعَلَنَّكَ نَكَالاً، فَخَرَجْتُ حَتَّى أَتَيْتُ نَفَرًا مِنَ الأَنْصَارِ جُلُوسًا فِي الْمَسْجِدِ فَسَأَلْتُهُمْ، فَقَالُوا‏:‏ أَوَيَشُكُّ فِي هَذَا أَحَدٌ‏؟‏ فَأَخْبَرْتُهُمْ مَا قَالَ عُمَرُ، فَقَالُوا‏:‏ لاَ يَقُومُ مَعَكَ إِلاَّ أَصْغَرُنَا، فَقَامَ مَعِي أَبُو سَعِيدٍ الْخُدْرِيُّ، أَوْ أَبُو مَسْعُودٍ، إِلَى عُمَرَ، فَقَالَ‏:‏ خَرَجْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم وَهُوَ يُرِيدُ سَعْدَ بْنَ عُبَادَةَ، حَتَّى أَتَاهُ فَسَلَّمَ، فَلَمْ يُؤْذَنْ لَهُ، ثُمَّ سَلَّمَ الثَّانِيَةَ، ثُمَّ الثَّالِثَةَ، فَلَمْ يُؤْذَنْ لَهُ، فَقَالَ‏:‏ قَضَيْنَا مَا عَلَيْنَا، ثُمَّ رَجَعَ، فَأَدْرَكَهُ سَعْدٌ فَقَالَ‏:‏ يَا رَسُولَ اللهِ، وَالَّذِي بَعَثَكَ بِالْحَقِّ مَا سَلَّمْتَ مِنْ مَرَّةٍ إِلاَّ وَأَنَا أَسْمَعُ، وَأَرُدُّ عَلَيْكَ، وَلَكِنْ أَحْبَبْتُ أَنْ تُكْثِرَ مِنَ السَّلاَمِ عَلَيَّ وَعَلَى أَهْلِ بَيْتِي، فَقَالَ أَبُو مُوسَى‏:‏ وَاللَّهِ إِنْ كُنْتُ لَأَمِينًا عَلَى حَدِيثِ رَسُولِ اللهِ صلى الله عليه وسلم، فَقَالَ‏:‏ أَجَلْ، وَلَكِنْ أَحْبَبْتُ أَنْ أَسْتَثْبِتَ‏.‏","english":{"narrator":"","text":"'Ubayd ibn Hunayn related to him that Abu Musa said, \"I asked\npermission three times to come in to 'Umar, but he did not give me permission\nand so I went away. He said, ''Abdullah, is it hard on you to be kept waiting\nat your door.' I said, 'I asked permission from you three times and you\ndid not give me permission, so I went away (and we were commanded to do\nthat).' 'Umar said, 'From whom did you hear this?' I replied, 'I heard\nit from the Prophet, may Allah bless him and grant him peace.' 'Umar said,\n'Did you hear something from the Prophet, may Allah bless him and grant\nhim peace, which I did not hear? If you do not bring me a clear proof,\nI will make an example of you!' Therefore I went to a group of Ansar who\nwere sitting in the mosque. I asked them and they said, 'Does anyone doubt\nthis?' I told them what 'Umar had said. They said, 'Only the youngest of\nus will go with you.' So Abu Sa'id al-Khudri - or Abu Mas'ud -\nwent with me to 'Umar. He said, 'We went out with the Prophet, may Allah\nbless him and grant him peace, when he was going to Sa'd ibn 'Ubada. He\ngave the greeting, but Sa'd did not give permission. Then he greeted him\na second time and then a third time, but Sa'd did not give him permission.\nSo the Prophet said, 'We have done what we must.' Then he went back and\nSa'd caught up to him and said, 'Messenger of Allah! By the One who sent\nyou with the Truth, every time you greeted me, I heard and answered you,\nbut I wanted to have a lot of greeting (peace) from you for me and the\npeople of my house.'\" Abu Musa said, \"By Allah, I am a guardian of the\nhadith of the Messenger of Allah, may Allah bless him and grant him peace.\"\n'Umar said, \"Yes, but I wanted to make sure.\""}},{"id":24,"idInBook":24,"chapterId":43,"bookId":15,"arabic":"حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، عَنْ أَبِي الأَحْوَصِ، عَنْ عَبْدِ اللهِ قَالَ‏:‏ إِذَا دُعِيَ الرَّجُلُ فَقَدْ أُذِنَ لَهُ‏.‏","english":{"narrator":"","text":"'Abdullah said, \"When a man is given an invitation, that is his\npermission to enter.\""}},{"id":25,"idInBook":25,"chapterId":43,"bookId":15,"arabic":"حَدَّثَنَا عَيَّاشُ بْنُ الْوَلِيدِ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الأَعْلَى، قَالَ‏:‏ حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ أَبِي رَافِعٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ إِذَا دُعِيَ أَحَدُكُمْ فَجَاءَ مَعَ الرَّسُولِ، فَهُوَ إِذْنُهُ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"When one of you gives someone an invitation and\nthe person you invited comes with your messenger, that is his permission\nto enter.\""}},{"id":26,"idInBook":26,"chapterId":43,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ‏:‏ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ حَبِيبٍ، وَهِشَامٍ، عَنْ مُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ رَسُولُ الرَّجُلِ إِلَى الرَّجُلِ إِذْنُهُ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"A man's messenger to another man is his permission\nto enter.\""}},{"id":27,"idInBook":27,"chapterId":43,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْوَاحِدِ، قَالَ‏:‏ حَدَّثَنَا عَاصِمٌ، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدٌ، عَنْ أَبِي الْعَلاَنِيَةِ قَالَ‏:‏ أَتَيْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ فَسَلَّمْتُ فَلَمْ يُؤْذَنْ لِي، ثُمَّ سَلَّمْتُ فَلَمْ يُؤْذَنْ لِي، ثُمَّ سَلَّمْتُ الثَّالِثَةَ فَرَفَعْتُ صَوْتِي وَقُلْتُ‏:‏ السَّلاَمُ عَلَيْكُمْ يَا أَهْلَ الدَّارِ، فَلَمْ يُؤْذَنْ لِي، فَتَنَحَّيْتُ نَاحِيَةً فَقَعَدْتُ، فَخَرَجَ إِلَيَّ غُلاَمٌ فَقَالَ‏:‏ ادْخُلْ، فَدَخَلْتُ، فَقَالَ لِي أَبُو سَعِيدٍ‏:‏ أَمَا إِنَّكَ لَوْ زِدْتَ لَمْ يُؤْذَنْ لَكَ، فَسَأَلْتُهُ عَنِ الأَوْعِيَةِ، فَلَمْ أَسْأَلْهُ عَنْ شَيْءٍ إِلاَّ قَالَ‏:‏ حَرَامٌ، حَتَّى سَأَلْتُهُ عَنِ الْجَفِّ، فَقَالَ‏:‏ حَرَامٌ‏.‏ فَقَالَ مُحَمَّدٌ‏:‏ يُتَّخَذُ عَلَى رَأْسِهِ إِدَمٌ، فَيُوكَأُ‏.‏","english":{"narrator":"","text":"Abu'l-'Alaniyya said, \"I came to Abu Sa'id al-Khudri and greeted\nhim, but he did not give me permission. Then I greeted him again and he\ndid not give me permission. Then I greeted him a third time, raising my\nvoice and said, 'Peace be upon you, people of the house,' and he did not\ngive me permission. Then I went off to one side and sat down. A slave boy\ncame out to me and said, 'Enter.' I entered and Abu Sa'id said to me, 'If\nyou had said it any more times, I would not have given you permission.'\nI asked him about vessels (i.e. those used for wine) and other things.\nHe said, 'Haram.' I asked him about an old milk-skin made into a bucket\nfor fermentation purposes. 'Haram,' he said.\""}},{"id":28,"idInBook":28,"chapterId":43,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْعَزِيزِ، قَالَ‏:‏ حَدَّثَنَا بَقِيَّةُ قَالَ‏:‏ حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ الْيَحْصِبِيُّ قَالَ‏:‏ حَدَّثَنِي عَبْدُ اللهِ بْنُ بُسْرٍ، صَاحِبُ النَّبِيِّ صلى الله عليه وسلم، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ إِذَا أَتَى بَابًا يُرِيدُ أَنْ يَسْتَأْذِنَ لَمْ يَسْتَقْبِلْهُ، جَاءَ يَمِينًا وَشِمَالاً، فَإِنْ أُذِنَ لَهُ وَإِلا انْصَرَفَ‏.‏","english":{"narrator":"","text":"'Abdullah ibn Busr, the Companion of the Prophet, may Allah bless\nhim and grant him peace, said that when the Prophet, may Allah bless him\nand grant him peace, came to a door when he wanted to ask permission to\nenter, he did not face it directly. He stood to the right or the left.\nIf he was given permission, he went in. Otherwise he went away."}},{"id":29,"idInBook":29,"chapterId":43,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ صَالِحٍ قَالَ‏:‏ حَدَّثَنِي ابْنُ شُرَيْحٍ عَبْدُ الرَّحْمَنِ، أَنَّهُ سَمِعَ وَاهِبَ بْنَ عَبْدِ اللهِ الْمَعَافِرِيَّ يَقُولُ‏:‏ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ مُعَاوِيَةَ بْنِ حُدَيْجٍ، عَنْ أَبِيهِ قَالَ‏:‏ قَدِمْتُ عَلَى عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ فَاسْتَأْذَنْتُ عَلَيْهِ، فَقَالُوا لِي‏:‏ مَكَانَكَ حَتَّى يَخْرُجَ إِلَيْكَ، فَقَعَدْتُ قَرِيبًا مِنْ بَابِهِ، قَالَ‏:‏ فَخَرَجَ إِلَيَّ فَدَعَا بِمَاءٍ فَتَوَضَّأَ، ثُمَّ مَسَحَ عَلَى خُفَّيْهِ، فَقَالَ‏:‏ يَا أَمِيرَ الْمُؤْمِنِينَ، أَمِنَ الْبَوْلِ هَذَا‏؟‏ قَالَ‏:‏ مِنَ الْبَوْلِ، أَوْ مِنْ غَيْرِهِ‏.‏","english":{"narrator":"","text":"Mu'awiya ibn Hudayj said, \"I came to 'Umar ibn al-Khattab, may\nAllah be pleased with him, and asked him for permission to enter. They\ntold me, 'Stay where you are until he comes to you.' I sat down near his\ndoor.\" He continued, \"'Umar came out to me, called for water and did wudu'.\nThen he wiped over his leather socks. I said, 'O Amir al'-Mu'minin, is\nthis on account of urine?' He replied, 'On account of urine or other things.'\""}},{"id":30,"idInBook":30,"chapterId":43,"bookId":15,"arabic":"حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيلَ، قَالَ‏:‏ حَدَّثَنَا الْمُطَّلِبُ بْنُ زِيَادٍ، قَالَ‏:‏ حَدَّثَنَا أَبُو بَكْرِ بْنُ عَبْدِ اللهِ الأَصْبَهَانِيُّ، عَنْ مُحَمَّدِ بْنِ مَالِكِ بْنِ الْمُنْتَصِرِ، عَنْ أَنَسِ بْنِ مَالِكٍ‏:‏ إِنَّ أَبْوَابَ النَّبِيِّ صلى الله عليه وسلم كَانَتْ تُقْرَعُ بِالأظَافِيرِ‏.‏","english":{"narrator":"","text":"Anas ibn Malik reported that people knocked on the door of the\nProphet, may Allah bless him and grant him peace, using their fingernails."}},{"id":31,"idInBook":31,"chapterId":43,"bookId":15,"arabic":"حَدَّثَنَا أَبُو عَاصِمٍ، وَأَفْهَمَنِي بَعْضَهُ عَنْهُ أَبُو حَفْصِ بْنُ عَلِيٍّ، قَالَ‏:‏ ابْنُ جُرَيْجٍ أَخْبَرَنَا قَالَ‏:‏ أَخْبَرَنِي عَمْرُو بْنُ أَبِي سُفْيَانَ، أَنَّ عَمْرَو بْنَ عَبْدِ اللهِ بْنِ صَفْوَانَ أَخْبَرَهُ، أَنَّ كَلَدَةَ بْنَ حَنْبَلٍ أَخْبَرَهُ، أَنَّ صَفْوَانَ بْنَ أُمَيَّةَ بَعَثَهُ إِلَى النَّبِيِّ صلى الله عليه وسلم فِي الْفَتْحِ بِلَبَنٍ وَجِدَايَةٍ وَضَغَابِيسَ، قَالَ أَبُو عَاصِمٍ‏:‏ يَعْنِي الْبَقْلَ، وَالنَّبِيُّ صلى الله عليه وسلم بِأَعْلَى الْوَادِي، وَلَمْ أُسَلِّمْ وَلَمْ أَسْتَأْذِنْ، فَقَالَ‏:‏ ارْجِعْ، فَقُلِ السَّلاَمُ عَلَيْكُمْ، أَأَدْخُلُ‏؟‏، وَذَلِكَ بَعْدَ مَا أَسْلَمَ صَفْوَانُ‏.‏","english":{"narrator":"","text":"Kalda ibn Hanbal reported that Safwan ibn Umayya sent him to the\nProphet, may Allah bless him and grant him peace, during the Conquest of\nMakka with some milk, gazelle, and cucumber. (Abu 'Asim said that the meant\nvegetables.) The Prophet, may Allah bless him and grant him peace, was\nat the top of the valley and I did not give the greeting nor ask for permission.\nHe said, \"Go back and say, 'Peace be upon you. May I enter?' That was after\nSafwan had become Muslim.\""}},{"id":32,"idInBook":32,"chapterId":43,"bookId":15,"arabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ بْنُ حَمْزَةَ قَالَ‏:‏ حَدَّثَنِي كَثِيرُ بْنُ زَيْدٍ، عَنِ الْوَلِيدِ بْنِ رَبَاحٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم قَالَ‏:‏ إِذَا أَدْخَلَ الْبَصَرَ فَلاَ إِذْنَ لَهُ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"If someone looks inside, he should not\nbe given permission to enter.\""}},{"id":33,"idInBook":33,"chapterId":43,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ قَالَ‏:‏ أَخْبَرَنِي مَخْلَدُ بْنُ يَزِيدَ، قَالَ‏:‏ أَخْبَرَنَا ابْنُ جُرَيْجٍ قَالَ‏:‏ أَخْبَرَنِي عَطَاءٌ قَالَ‏:‏ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُ‏:‏ إِذَا قَالَ‏:‏ أَأَدْخُلُ‏؟‏ وَلَمْ يُسَلِّمْ، فَقُلْ‏:‏ لاَ، حَتَّى تَأْتِيَ بِالْمِفْتَاحِ، قُلْتُ‏:‏ السَّلاَمُ‏؟‏ قَالَ‏:‏ نَعَمْ‏.‏","english":{"narrator":"","text":"'Ata' reported that Abu Hurayra said, \"When someone says, \"Can\nI come in?\" and does not give the key.'\" 'Ata' said, \"Peace?\" and Abu Hurayra\nreplied, \"Yes.\""}},{"id":34,"idInBook":34,"chapterId":43,"bookId":15,"arabic":"قَالَ‏:‏ وَأَخْبَرَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ رِبْعِيِّ بْنِ حِرَاشٍ قَالَ‏:‏ حَدَّثَنِي رَجُلٌ مِنْ بَنِي عَامِرٍ جَاءَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ‏:‏ أَأَلِجُ‏؟‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم لِلْجَارِيَةِ‏:‏ اخْرُجِي فَقُولِي لَهُ‏:‏ قُلِ‏:‏ السَّلاَمُ عَلَيْكُمْ، أَأَدْخُلُ‏؟‏ فَإِنَّهُ لَمْ يُحْسِنِ الِاسْتِئْذَانَ، قَالَ‏:‏ فَسَمِعْتُهَا قَبْلَ أَنْ تَخْرُجَ إِلَيَّ الْجَارِيَةُ فَقُلْتُ‏:‏ السَّلاَمُ عَلَيْكُمْ، أَأَدْخُلُ‏؟‏ فَقَالَ‏:‏ وَعَلَيْكَ، ادْخُلْ، قَالَ‏:‏ فَدَخَلْتُ فَقُلْتُ‏:‏ بِأَيِّ شَيْءٍ جِئْتَ‏؟‏ فَقَالَ‏:‏ لَمْ آتِكُمْ إِلاَّ بِخَيْرٍ، أَتَيْتُكُمْ لِتَعْبُدُوا اللَّهَ وَحْدَهُ لاَ شَرِيكَ لَهُ، وَتَدَعُوا عِبَادَةَ اللاَّتِ وَالْعُزَّى، وَتُصَلُّوا فِي اللَّيْلِ وَالنَّهَارِ خَمْسَ صَلَوَاتٍ، وَتَصُومُوا فِي السَّنَةِ شَهْرًا، وَتَحُجُّوا هَذَا الْبَيْتَ، وَتَأْخُذُوا مِنْ مَالِ أَغْنِيَائِكُمْ فَتَرُدُّوهَا عَلَى فُقَرَائِكُمْ، قَالَ‏:‏ فَقُلْتُ لَهُ‏:‏ هَلْ مِنَ الْعِلْمِ شَيْءٌ لاَ تَعْلَمُهُ‏؟‏ قَالَ‏:‏ لَقَدْ عَلَّمَ اللَّهُ خَيْرًا، وَإِنَّ مِنَ الْعِلْمِ مَا لاَ يَعْلَمُهُ إِلاَّ اللَّهُ، الْخَمْسُ لاَ يَعْلَمُهُنَّ إِلاَّ اللَّهُ‏:‏ ‏{‏إِنَّ اللَّهَ عِنْدَهُ عِلْمُ السَّاعَةِ، وَيُنَزِّلُ الْغَيْثَ، وَيَعْلَمُ مَا فِي الأَرْحَامِ، وَمَا تَدْرِي نَفْسٌ مَاذَا تَكْسِبُ غَدًا، وَمَا تَدْرِي نَفْسٌ بِأَيِّ أَرْضٍ تَمُوتُ‏}‏‏.‏","english":{"narrator":"","text":"Rib'i ibn Hirash reported that a man of the Banu 'Amir came to\nthe Prophet, may Allah bless him and grant him peace, and said, \"Can I\ncome in?\" The Prophet, may Allah bless him and grant him peace, told his\nslavegirl, \"Go out and say to him,, 'Say, \"Peace be upon you. Can I come\nin?\" He is not good at asking permission to enter.\" The man said, \"I heard\nthat before the slavegirl came out to me and I said, 'Peace be upon you.\nCan I come in?' Then the Prophet said, 'And on you. Enter!'\""}},{"id":35,"idInBook":35,"chapterId":43,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ أَبِي شَيْبَةَ قَالَ‏:‏ حَدَّثَنِي يَحْيَى بْنُ آدَمَ، عَنِ الْحَسَنِ بْنِ صَالِحٍ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ قَالَ‏:‏ اسْتَأْذَنَ عُمَرُ عَلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ‏:‏ السَّلاَمُ عَلَى رَسُولِ اللهِ، السَّلاَمُ عَلَيْكُمْ، أَيَدْخُلُ عُمَرُ‏؟‏‏.‏","english":{"narrator":"","text":"Ibn 'Abbas said, \"'Umar asked permission to visit the Prophet,\nmay Allah bless him and grant him peace, and said, 'Peace be upon the Messenger\nof Allah! Peace be upon you! Can I come in?'\""}},{"id":36,"idInBook":36,"chapterId":43,"bookId":15,"arabic":"حَدَّثَنَا أَبُو الْوَلِيدِ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ قَالَ‏:‏ سَمِعْتُ جَابِرًا يَقُولُ‏:‏ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فِي دَيْنٍ كَانَ عَلَى أَبِي، فَدَقَقْتُ الْبَابَ، فَقَالَ‏:‏ مَنْ ذَا‏؟‏ فَقُلْتُ‏:‏ أَنَا، قَالَ‏:‏ أَنَا، أَنَا‏؟‏، كَأَنَّهُ كَرِهَهُ‏.‏","english":{"narrator":"","text":"Jabir said, \"I came to the Messenger of Allah, may Allah bless\nhim and grant him peace, about a debt my father owed. I knocked at the\ndoor and he asked. 'Who is it?' 'Me,' I replied. He said, 'Me? Me?' as\nif he disliked that.\""}},{"id":37,"idInBook":37,"chapterId":43,"bookId":15,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ الْحَسَنِ، قَالَ‏:‏ حَدَّثَنَا الْحُسَيْنُ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ اللهِ بْنُ بُرَيْدَةَ، عَنْ أَبِيهِ قَالَ‏:‏ خَرَجَ النَّبِيُّ صلى الله عليه وسلم إِلَى الْمَسْجِدِ، وَأَبُو مُوسَى يَقْرَأُ، فَقَالَ‏:‏ مَنْ هَذَا‏؟‏ فَقُلْتُ‏:‏ أَنَا بُرَيْدَةُ، جُعِلْتُ فِدَاكَ، فَقَالَ‏:‏ قَدْ أُعْطِيَ هَذَا مِزْمَارًا مِنْ مَزَامِيرِ آلِ دَاوُدَ‏.‏","english":{"narrator":"","text":"Burayda said, \"The Messenger of Allah, may Allah bless him and\ngrant him peace, went out to the mosque while Musa was reciting. He said,\n'Who is it?' I said 'I am Burayda, may I be your ransom!' The Prophet said,\n'This man has been given one of the flutes of the family of Da'ud.'\""}},{"id":38,"idInBook":38,"chapterId":43,"bookId":15,"arabic":"حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيلَ، قَالَ‏:‏ حَدَّثَنَا إِسْرَائِيلُ، عَنْ أَبِي جَعْفَرٍ الْفَرَّاءِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُدْعَانَ قَالَ‏:‏ كُنْتُ مَعَ عَبْدِ اللهِ بْنِ عُمَرَ، فَاسْتَأْذَنَ عَلَى أَهْلِ بَيْتٍ، فَقِيلَ‏:‏ ادْخُلْ بِسَلاَمٍ، فَأَبَى أَنْ يَدْخُلَ عَلَيْهِمْ‏.‏","english":{"narrator":"","text":"'Abdu'r-Rahman ibn Ju'dan said, \"I was with 'Abdullah ibn 'Umar\nand he asked permission from the people of the house to enter. He was told,\n'Enter with peace,' and he refused to enter them.'\""}},{"id":39,"idInBook":39,"chapterId":43,"bookId":15,"arabic":"حَدَّثَنَا أَيُّوبُ بْنُ سُلَيْمَانَ قَالَ‏:‏ حَدَّثَنِي أَبُو بَكْرِ بْنُ أَبِي أُوَيْسٍ، عَنْ سُلَيْمَانَ، عَنْ كَثِيرِ بْنِ زَيْدٍ، عَنِ الْوَلِيدِ بْنِ رَبَاحٍ، أَنَّ أَبَا هُرَيْرَةَ قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ إِذَا دَخَلَ الْبَصَرُ فَلا إِذْنَ‏.‏","english":{"narrator":"","text":"Abu Hurayra said, \"The Messenger of Allah, may Allah bless him\nand grant him peace, said, \"When the eye enters, permission to enter should\nnot be given.\""}},{"id":40,"idInBook":40,"chapterId":43,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، قَالَ‏:‏ أَخْبَرَنَا سُفْيَانُ، عَنْ أَبِي إِسْحَاقَ، عَنْ مُسْلِمِ بْنِ نَذِيرٍ قَالَ‏:‏ اسْتَأْذَنَ رَجُلٌ عَلَى حُذَيْفَةَ فَاطَّلَعَ وَقَالَ‏:‏ أَدْخُلُ‏؟‏ قَالَ حُذَيْفَةُ‏:‏ أَمَّا عَيْنُكَ فَقَدْ دَخَلَتْ، وَأَمَّا اسْتُكَ فَلَمْ تَدْخُلْ‏.‏","english":{"narrator":"","text":"Muslim ibn Nadhir said, \"A man asked permission to enter from\nHudhayfa. He looked in and said, 'May I come in?' Hudhayfa replied, 'As\nfor you eye, it has already entered. As for your bottom, it has not entered.'\""}},{"id":41,"idInBook":41,"chapterId":43,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى، قَالَ‏:‏ حَدَّثَنَا أَبَانُ بْنُ يَزِيدَ قَالَ‏:‏ حَدَّثَنِي يَحْيَى، أَنَّ إِسْحَاقَ بْنَ عَبْدِ اللهِ حَدَّثَهُ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ أَعْرَابِيًّا أَتَى بَيْتَ رَسُولِ اللهِ صلى الله عليه وسلم فَأَلْقَمَ عَيْنَهُ خَصَاصَةَ الْبَابِ، فَأَخَذَ سَهْمًا أَوْ عُودًا مُحَدَّدًا، فَتَوَخَّى الأعْرَابِيَّ، لِيَفْقَأَ عَيْنَ الأعْرَابِيِّ، فَذَهَبَ، فَقَالَ‏:‏ أَمَا إِنَّكَ لَوْ ثَبَتَّ لَفَقَأْتُ عَيْنَكَ‏.‏","english":{"narrator":"","text":"Anas ibn Malik reported that a bedouin came to the house of the\nMessenger of Allah, may Allah bless him and grant him peace, and put his\neye to the crack of the door. Therefore the Prophet took an arrow or a\nsharp stick and aimed it at the bedouin as to gouge out his eye. The man\nleft and the Prophet said, \"If you had stayed, I would have gouged out\nyour eye.\""}},{"id":42,"idInBook":42,"chapterId":43,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ يَزِيدَ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، عَنْ عَطَاءِ بْنِ دِينَارٍ، عَنْ عَمَّارِ بْنِ سَعْدٍ التُّجِيبِيِّ قَالَ‏:‏ قَالَ عُمَرُ بْنُ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ‏:‏ مَنْ مَلَأَ عَيْنَيْهِ مِنْ قَاعَةِ بَيْتٍ، قَبْلَ أَنْ يُؤْذَنَ لَهُ، فَقَدْ فَسَقَ‏.‏","english":{"narrator":"","text":"'Umar ibn al-Khattab said, \"Anyone who fills his eye with the\ncontents of a house before he has been given permission has gone astray.\""}},{"id":43,"idInBook":43,"chapterId":43,"bookId":15,"arabic":"حَدَّثَنَا إِسْحَاقُ بْنُ الْعَلاَءِ قَالَ‏:‏ حَدَّثَنِي عَمْرُو بْنُ الْحَارِثِ قَالَ‏:‏ حَدَّثَنِي عَبْدُ اللهِ بْنُ سَالِمٍ، عَنْ مُحَمَّدِ بْنِ الْوَلِيدِ، قَالَ‏:‏ حَدَّثَنَا يَزِيدُ بْنُ شُرَيْحٍ، أَنَّ أَبَا حَيٍّ الْمُؤَذِّنَ حَدَّثَهُ، أَنَّ ثَوْبَانَ مَوْلَى رَسُولِ اللهِ صلى الله عليه وسلم حَدَّثَهُ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ‏:‏ لاَ يَحِلُّ لِامْرِئٍ مُسْلِمٍ أَنْ يَنْظُرَ إِلَى جَوْفِ بَيْتٍ حَتَّى يَسْتَأْذِنَ، فَإِنْ فَعَلَ فَقَدْ دَخَلَ‏.‏ وَلاَ يَؤُمُّ قَوْمًا فَيَخُصُّ نَفْسَهُ بِدَعْوَةٍ دُونَهُمْ حَتَّى يَنْصَرِفَ‏.‏ وَلاَ يُصَلِّي وَهُوَ حَاقِنٌ حَتَّى يَتَخَفَّفَ‏.‏","english":{"narrator":"","text":"Thawban, the mawla of the Messenger of Allah, may Allah bless\nhim and grant him peace, related that the Prophet, may Allah bless him\nand grant him peace, said, \"It is not lawful for a Muslim man to look inside\na house until he has been given permission. If he does so, he has entered.\nHe should not act as the imam of a people and then single himself out for\nsupplication to the exclusion of others. He should not pray while he needs\nto urinate until he has relieved himself.\""}},{"id":44,"idInBook":44,"chapterId":43,"bookId":15,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، قَالَ‏:‏ حَدَّثَنَا صَدَقَةُ بْنُ خَالِدٍ، قَالَ‏:‏ حَدَّثَنَا أَبُو حَفْصٍ عُثْمَانُ بْنُ أَبِي الْعَاتِكَةِ قَالَ‏:‏ حَدَّثَنِي سُلَيْمَانُ بْنُ حَبِيبٍ الْمُحَارِبِيُّ، أَنَّهُ سَمِعَ أَبَا أُمَامَةَ قَالَ‏:‏ قَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ ثَلاَثَةٌ كُلُّهُمْ ضَامِنٌ عَلَى اللهِ، إِنْ عَاشَ كُفِيَ، وَإِنْ مَاتَ دَخَلَ الْجَنَّةَ‏:‏ مَنْ دَخَلَ بَيْتَهُ بِسَلاَمٍ فَهُوَ ضَامِنٌ عَلَى اللهِ عَزَّ وَجَلَّ، وَمَنْ خَرَجَ إِلَى الْمَسْجِدِ فَهُوَ ضَامِنٌ عَلَى اللهِ، وَمَنْ خَرَجَ فِي سَبِيلِ اللهِ فَهُوَ ضَامِنٌ عَلَى اللهِ‏.‏","english":{"narrator":"Abu Umama reported that the Prophet, may Allah bless him and grant\nhim peace, said, Allah is responsible for three:","text":"if they live, they will\nhave enough, and if they die, they will enter the Garden. Allah Almighty\nis responsible for whoever enters his house , saying 'Peace'. Allah is\nresponsible for whoever goes out to the mosque. Allah is responsible for\nwhoever goes out in the Way of Allah.\""}},{"id":45,"idInBook":45,"chapterId":43,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، قَالَ‏:‏ أَخْبَرَنَا عَبْدُ اللهِ، قَالَ‏:‏ أَخْبَرَنَا ابْنُ جُرَيْجٍ قَالَ‏:‏ أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرًا يَقُولُ‏:‏ إِذَا دَخَلْتَ عَلَى أَهْلِكَ فَسَلِّمْ عَلَيْهِمْ تَحِيَّةً مِنْ عِنْدِ اللهِ مُبَارَكَةً طَيْبَةً‏.‏","english":{"narrator":"","text":"Jabir said, \"When you come in to your family, greet them with\na greeting from Allah which is blessed and good.\" He added, \"I only think\nthat it is what is meant by His words, 'When you are greeted with a\ngreeting, greet with one better than it or return it.' (4:86)\""}},{"id":46,"idInBook":46,"chapterId":43,"bookId":15,"arabic":"حَدَّثَنَا خَلِيفَةُ، قَالَ‏:‏ حَدَّثَنَا أَبُو عَاصِمٍ، قَالَ‏:‏ حَدَّثَنَا ابْنُ جُرَيْجٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّهُ سَمِعَ النَّبِيَّ صلى الله عليه وسلم يَقُولُ‏:‏ إِذَا دَخَلَ الرَّجُلُ بَيْتَهُ، فَذَكَرَ اللَّهَ عَزَّ وَجَلَّ عِنْدَ دُخُولِهِ، وَعِنْدَ طَعَامِهِ، قَالَ الشَّيْطَانُ‏:‏ لاَ مَبِيتَ لَكُمْ وَلاَ عَشَاءَ، وَإِذَا دَخَلَ فَلَمْ يَذْكُرِ اللَّهَ عِنْدَ دُخُولِهِ قَالَ الشَّيْطَانُ‏:‏ أَدْرَكْتُمُ الْمَبِيتَ، وَإِنْ لَمْ يَذْكُرِ اللَّهَ عِنْدَ طَعَامِهِ قَالَ الشَّيْطَانُ‏:‏ أَدْرَكْتُمُ الْمَبِيتَ وَالْعَشَاءَ‏.‏","english":{"narrator":"","text":"Jabir reported that the Prophet, may Allah bless him and grant\nhim peace, said, \"When a man enters his house, he should Allah mention\nAllah Almighty, both when he enters and he eats. If he does so, Shaytan\nsays (i.e. to the shayatin), 'You cannot spend the night or eat.'\nWhen he enters and does not mention Allah when he enters, Shaytan says,\n'You have got your lodgings for the night and your supper.'\""}},{"id":47,"idInBook":47,"chapterId":43,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ‏:‏ حَدَّثَنَا أَعْيَنُ الْخُوَارِزْمِيُّ قَالَ‏:‏ أَتَيْنَا أَنَسَ بْنَ مَالِكٍ، وَهُوَ قَاعِدٌ فِي دِهْلِيزِهِ وَلَيْسَ مَعَهُ أَحَدٌ، فَسَلَّمَ عَلَيْهِ صَاحِبِي وَقَالَ‏:‏ أَدْخُلُ‏؟‏ فَقَالَ أَنَسٌ‏:‏ ادْخُلْ، هَذَا مَكَانٌ لاَ يَسْتَأْذِنُ فِيهِ أَحَدٌ، فَقَرَّبَ إِلَيْنَا طَعَامًا، فَأَكَلْنَا، فَجَاءَ بِعُسِّ نَبِيذٍ حُلْوٍ فَشَرِبَ، وَسَقَانَا‏.‏","english":{"narrator":"","text":"A'yan al-Khwarizmi said, \"We came to Anas ibn Malik while he was\nsitting his foyer with anyone else with him. My companion greeted him and\nsaid, 'May I come in?' Anas said, 'Come in. This is a place where no one\nasks for permission.' He had food brought to us and we ate. Then a cup\nof sweet nabidh was brought and we drank and were full.\""}},{"id":48,"idInBook":48,"chapterId":43,"bookId":15,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ عَوْنٍ، عَنْ مُجَاهِدٍ قَالَ‏:‏ كَانَ ابْنُ عُمَرَ لاَ يَسْتَأْذِنُ عَلَى بُيُوتِ السُّوقِ‏.‏","english":{"narrator":"","text":"Mujahid said, \"Ibn 'Umar did not ask permission to enter shops\nin the market.\""}},{"id":49,"idInBook":49,"chapterId":43,"bookId":15,"arabic":"حَدَّثَنَا أَبُو حَفْصِ بْنُ عَلِيٍّ، قَالَ‏:‏ حَدَّثَنَا الضَّحَّاكُ بْنُ مَخْلَدٍ، عَنِ ابْنِ جُرَيْجٍ، عَنْ عَطَاءٍ قَالَ‏:‏ كَانَ ابْنُ عُمَرَ يَسْتَأْذِنُ فِي ظُلَّةِ الْبَزَّازِ‏.‏","english":{"narrator":"","text":"'Ata' said, \"Ibn 'Umar used to ask permission to enter market-stalls.\""}},{"id":50,"idInBook":50,"chapterId":43,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ الْمُبَارَكِ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْوَارِثِ، قَالَ‏:‏ حَدَّثَنَا عَلِيُّ بْنُ الْعَلاَءِ الْخُزَاعِيُّ، عَنْ أَبِي عَبْدِ الْمَلِكِ، مَوْلَى أُمِّ مِسْكِينٍ بِنْتِ عَاصِمِ بْنِ عُمَرَ بْنِ الْخَطَّابِ، قَالَ‏:‏ أَرْسَلَتْنِي مَوْلاَتِي إِلَى أَبِي هُرَيْرَةَ، فَجَاءَ مَعِي، فَلَمَّا قَامَ بِالْبَابِ فقَالَ‏:‏ أَنْدَرَايِيمْ‏؟‏ قَالَتْ‏:‏ أَنْدَرُونْ، فَقَالَتْ‏:‏ يَا أَبَا هُرَيْرَةَ إِنَّهُ يَأْتِينِي الزَّوْرُ بَعْدَ الْعَتَمَةِ فَأَتَحَدَّثُ‏؟‏ قَالَ‏:‏ تَحَدَّثِي مَا لَمْ تُوتِرِي، فَإِذَا أَوْتَرْتِ فَلاَ حَدِيثَ بَعْدَ الْوِتْرِ‏.‏","english":{"narrator":"","text":"Abu Abdul Malik, the mawla of Umm Miskin, the daughter of ('Umar) ibn\n'Asim ibn 'Umar ibn al-Khattab, said, \"My mistress sent me to Abu Hurayra\nand he came with me. When he was at the door, he asked in Persian, 'Can\nwe come in?' 'Come in!' she replied.' Then she said, 'Abu Hurayra, if visitors\ncome to me after 'Isha', should I enter into conversation with them?' He\nreplied, 'Converse as long as you have not done the witr prayer. If you\nhave done the witr, there is no conversation after it.'\""}}],"chapter":{"id":43,"bookId":15,"arabic":"كتاب الاسْتِئْذَانُ","english":"Asking Permission"}}