{"metadata":{"length":16,"arabic":{"title":"الأدب المفرد","author":"الإمام محمد بن إسماعيل البخاري","introduction":"كتاب أَهْلِ الْكِتَابِ"},"english":{"title":"Al-Adab Al-Mufrad","author":"Imam Muhammad ibn Ismail al-Bukhari","introduction":"The People of the Book"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":44,"bookId":15,"arabic":"حَدَّثَنَا يَحْيَى بْنُ بِشْرٍ، قَالَ‏:‏ حَدَّثَنَا الْحَكَمُ بْنُ الْمُبَارَكِ، قَالَ‏:‏ حَدَّثَنَا عَبَّادٌ يَعْنِي ابْنَ عَبَّادٍ، عَنْ عَاصِمٍ الأَحْوَلِ، عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ قَالَ‏:‏ كَتَبَ أَبُو مُوسَى إِلَى رُهْبَانٍ يُسَلِّمُ عَلَيْهِ فِي كِتَابِهِ، فَقِيلَ لَهُ‏:‏ أَتُسَلِّمُ عَلَيْهِ وَهُوَ كَافِرٌ‏؟‏ قَالَ‏:‏ إِنَّهُ كَتَبَ إِلَيَّ فَسَلَّمَ عَلَيَّ، فَرَدَدْتُ عَلَيْهِ‏.‏","english":{"narrator":"","text":"Abu 'Uthman an-Nahdi said, \"Abu Musa wrote to a Persian grandee\nand greeted him in his letter. He was asked, 'Do you greet him when he\nis an unbeliever?' He replied, 'He wrote to me and greeted me, so I have\nanswered him.'\""}},{"id":2,"idInBook":2,"chapterId":44,"bookId":15,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ خَالِدٍ، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاقَ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ مَرْثَدٍ، عَنْ أَبِي بَصْرَةَ الْغِفَارِيِّ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ إِنِّي رَاكِبٌ غَدًا إِلَى يَهُودَ، فَلاَ تَبْدَأُوهُمْ بِالسَّلاَمِ، فَإِذَا سَلَّمُوا عَلَيْكُمْ فَقُولُوا‏:‏ وَعَلَيْكُمْ‏.‏","english":{"narrator":"","text":"Abu Basra al-Ghifari reported that the Prophet, may Allah bless\nhim and grant him peace, said, \"I will ride to the Jews tomorrow. Do not\ngive them the greeting first. If they greet you, then say, 'and on you.'\""}},{"id":3,"idInBook":3,"chapterId":44,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى، قَالَ‏:‏ حَدَّثَنَا وُهَيْبٌ، قَالَ‏:‏ حَدَّثَنَا سُهَيْلٌ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ أَهْلُ الْكِتَابِ لاَ تَبْدَأُوهُمْ بِالسَّلاَمِ، وَاضْطَرُّوهُمْ إِلَى أَضْيَقِ الطَّرِيقِ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"Do not give the People of the Book the greeting\nfirst. Force them to the narrowest part of the road.\""}},{"id":4,"idInBook":4,"chapterId":44,"bookId":15,"arabic":"حَدَّثَنَا صَدَقَةُ، قَالَ‏:‏ أَخْبَرَنَا حَفْصُ بْنُ غِيَاثٍ، عَنْ عَاصِمٍ، عَنْ حَمَّادٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ قَالَ‏:‏ إِنَّمَا سَلَّمَ عَبْدُ اللهِ عَلَى الدَّهَاقِينَ إِشَارَةً‏.‏","english":{"narrator":"","text":"'Alqama said, \"'Abdullah used to greet the Persian grandees with\na gesture.\""}},{"id":5,"idInBook":5,"chapterId":44,"bookId":15,"arabic":"حَدَّثَنَا عَمْرُو بْنُ عَاصِمٍ، قَالَ‏:‏ حَدَّثَنَا هَمَّامٌ، قَالَ‏:‏ حَدَّثَنَا قَتَادَةُ، عَنْ أَنَسٍ قَالَ‏:‏ مَرَّ يَهُودِيٌّ عَلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ‏:‏ السَّامُ عَلَيْكُمْ، فَرَدَّ أَصْحَابُهُ السَّلاَمَ، فَقَالَ‏:‏ قَالَ‏:‏ السَّامُ عَلَيْكُمْ، فَأُخِذَ الْيَهُودِيُّ فَاعْتَرَفَ، قَالَ‏:‏ رُدُّوا عَلَيْهِ مَا قَالَ‏.‏","english":{"narrator":"","text":"Anas said, \"A Jew passed by the Prophet, may Allah bless him and\ngrant him peace, saying, 'Peace be upon you.' His Companions returned the\nsalam.' The Prophet said, 'The Jew said, 'Poison (sam) be upon you.'\nHe caught hold of the Jew who admitted it.' The Prophet said, 'Answer him\nwith what he said.'\""}},{"id":6,"idInBook":6,"chapterId":44,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ قَالَ‏:‏ حَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ اللهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللهِ بْنِ عُمَرَ، أَنَّهُ قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ إِنَّ الْيَهُودَ إِذَا سَلَّمَ عَلَيْكُمْ أَحَدُهُمْ، فَإِنَّمَا يَقُولُ‏:‏ السَّامُ عَلَيْكَ، فَقُولُوا‏:‏ وَعَلَيْكَ‏.‏","english":{"narrator":"","text":"'Abdullah ibn 'Umar said that the Messenger of Allah, may Allah\nbless him and grant him peace, said, \"When one of the Jews greets you and\nsays, 'Poison be upon you (as-samu 'alaykum),' say, 'And on you.'\""}},{"id":7,"idInBook":7,"chapterId":44,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، قَالَ‏:‏ حَدَّثَنَا الْوَلِيدُ بْنُ أَبِي ثَوْرٍ، عَنْ سِمَاكٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ قَالَ‏:‏ رُدُّوا السَّلاَمَ عَلَى مَنْ كَانَ يَهُودِيًّا، أَوْ نَصْرَانِيًّا، أَوْ مَجُوسِيًّا، ذَلِكَ بِأَنَّ اللَّهَ يَقُولُ‏:‏ ‏{‏وَإِذَا حُيِّيتُمْ بِتَحِيَّةٍ فَحَيُّوا بِأَحْسَنَ مِنْهَا أَوْ رُدُّوهَا‏}‏‏.‏","english":{"narrator":"","text":"Ibn 'Abbas said, \"Return the greeting to whomever it is, Jew,\nChristian, or Magian. That is because Allah says, 'When you are greeted\nwith a greeting, greet with one better than it or return it.' (4:86)\""}},{"id":8,"idInBook":8,"chapterId":44,"bookId":15,"arabic":"حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ‏:‏ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ قَالَ‏:‏ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ أُسَامَةَ بْنَ زَيْدٍ أَخْبَرَهُ، أَنَّ النَّبِيَّ صلى الله عليه وسلم رَكِبَ عَلَى حِمَارٍ عَلَيْهِ إِكَافٌ عَلَى قَطِيفَةٍ فَدَكِيَّةٍ، وَأَرْدَفَ أُسَامَةَ بْنَ زَيْدٍ وَرَاءَهُ، يَعُودُ سَعْدَ بْنَ عُبَادَةَ، حَتَّى مَرَّ بِمَجْلِسٍ فِيهِ عَبْدُ اللهِ بْنُ أُبَيٍّ ابْنُ سَلُولٍ، وَذَلِكَ قَبْلَ أَنْ يُسْلِمَ عَبْدُ اللهِ، فَإِذَا فِي الْمَجْلِسِ أَخْلاَطٌ مِنَ الْمُسْلِمِينَ وَالْمُشْرِكِينَ وَعَبْدَةِ الأَوْثَانِ، فَسَلَّمَ عَلَيْهِمْ‏.‏","english":{"narrator":"","text":"Usama ibn Zayd related that one day the Prophet, may Allah bless\nhim and grant him peace, was riding on a donkey on a straw saddle covered\nby a blanket from Fadak. Usama ibn Zayd was riding behind him. He was on\nhis way to visit Sa'd ibn 'Ubada. He passed by a meeting which included\n'Abdullah ibn Ubayy ibn Salul - before the enemy of Allah had become\nMuslim. The gathering contained a mixture of Muslims, associaters and idolaters.\nHe greeted them."}},{"id":9,"idInBook":9,"chapterId":44,"bookId":15,"arabic":"حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ‏:‏ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ قَالَ‏:‏ أَخْبَرَنِي عُبَيْدُ اللهِ بْنُ عَبْدِ اللهِ بْنِ عُتْبَةَ، أَنَّ عَبْدَ اللهِ بْنَ عَبَّاسٍ أَخْبَرَهُ، أَنَّ أَبَا سُفْيَانَ بْنَ حَرْبٍ أَخْبَرَهُ‏:‏ أَرْسَلَ إِلَيْهِ هِرَقْلُ مَلِكُ الرُّومِ، ثُمَّ دَعَا بِكِتَابِ رَسُولِ اللهِ صلى الله عليه وسلم الَّذِي أُرْسِلَ بِهِ مَعَ دِحْيَةَ الْكَلْبِيِّ إِلَى عَظِيمِ بُصْرَى، فَدَفَعَهُ إِلَيَّ هِرَقْلُ فَقَرَأَهُ، فَإِذَا فِيهِ‏:‏ بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ، مِنْ مُحَمَّدٍ عَبْدِ اللهِ وَرَسُولِهِ إِلَى هِرَقْلَ عَظِيمِ الرُّومِ، سَلاَّمٌ عَلَى مَنِ اتَّبَعَ الْهُدَى، أَمَّا بَعْدُ، فَإِنِّي أَدْعُوكَ بِدِعَايَةِ الإِسْلاَمِ، أَسْلِمْ تَسْلَمْ، يُؤْتِكَ اللَّهُ أَجْرَكَ مَرَّتَيْنِ، فَإِنْ تَوَلَّيْتَ فَإِنَّ عَلَيْكَ إِثْمَ الأَرِيسِيِّينَ وَ ‏{‏يَا أَهْلَ الْكِتَابِ تَعَالَوْا إِلَى كَلِمَةٍ سَوَاءٍ بَيْنَنَا وَبَيْنَكُمْ‏}‏ إِلَى قَوْلِهِ‏:‏ ‏{‏اشْهَدُوا بِأَنَّا مُسْلِمُونَ‏}‏‏.‏","english":{"narrator":"","text":"'Abdullah ibn 'Abbas related that Abu Sufyan ibn Harb sent him\nto Heraclius, the Byzantine Emperor, and he called for the letter of the\nMessenger of Allah which Dihya had brought to the governor of Busra, who\nin turn passed it on to Heraclius. He read it out, saying, 'In the name\nof Allah, the Merciful, the Compassionate, from Muhammad, the slave of\nAllah and His Messenger, to Heraclius, ruler of the Byzantines. Peace be\nupon the one who follows guidance. I call you to Islam. If you become Muslim,\nyou will be safe and Allah will double your reward. If you turn away, then\nyou incur the wrong action of your subjects. \"O People of the Book!\nCome to a proposition which is the same for us and you (to His\nwords) Bear witness that we are Muslims.\"\n(3:54)'\""}},{"id":10,"idInBook":10,"chapterId":44,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، قَالَ‏:‏ أَخْبَرَنَا مَخْلَدٌ، قَالَ‏:‏ أَخْبَرَنَا ابْنُ جُرَيْجٍ قَالَ‏:‏ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرًا يَقُولُ‏:‏ سَلَّمَ نَاسٌ مِنَ الْيَهُودِ عَلَى النَّبِيِّ صلى الله عليه وسلم، فَقَالُوا‏:‏ السَّامُ عَلَيْكُمْ، قَالَ‏:‏ وَعَلَيْكُمْ، فَقَالَتْ عَائِشَةُ رَضِيَ اللَّهُ عَنْهَا وَغَضِبَتْ‏:‏ أَلَمْ تَسْمَعْ مَا قَالُوا‏؟‏ قَالَ‏:‏ بَلَى قَدْ سَمِعْتُ فَرَدَدْتُ عَلَيْهِمْ، نُجَابُ عَلَيْهِمْ، وَلا يُجَابُونَ فِينَا‏.‏","english":{"narrator":"","text":"Jabir said, \"Some of the Jews greeted the Prophet, may Allah bless\nhim and grant him peace, by saying, 'Poison be upon you (as-Samu 'alaykum)'\nand the Prophet replied, 'And on you.' 'A'isha, may Allah be pleased with\nher, said angrily, 'Didn't you hear what they said?' The Prophet replied,\n'Yes, and I answered them. What I said about them will be accepted and\nwhat they said about me will not be accepted.'\""}},{"id":11,"idInBook":11,"chapterId":44,"bookId":15,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ إِذَا لَقِيتُمُ الْمُشْرِكِينَ فِي الطَّرِيقِ، فَلاَ تَبْدَأُوهُمْ بِالسَّلاَمِ، وَاضْطَرُّوهُمْ إِلَى أَضْيَقِهَا‏.‏","english":{"narrator":"","text":"See 1103."}},{"id":12,"idInBook":12,"chapterId":44,"bookId":15,"arabic":"حَدَّثَنَا سَعِيدُ بْنُ تَلِيدٍ، قَالَ‏:‏ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ‏:‏ أَخْبَرَنِي عَاصِمُ بْنُ حَكِيمٍ، أَنَّهُ سَمِعَ يَحْيَى بْنَ أَبِي عَمْرٍو السَّيْبَانِيَّ، عَنْ أَبِيهِ، عَنْ عُقْبَةَ بْنِ عَامِرٍ الْجُهَنِيِّ، أَنَّهُ مَرَّ بِرَجُلٍ هَيْئَتُهُ هَيْئَةُ مُسْلِمٍ، فَسَلَّمَ، فَرَدَّ عَلَيْهِ‏:‏ وَعَلَيْكَ وَرَحْمَةُ اللهِ وَبَرَكَاتُهُ، فَقَالَ لَهُ الْغُلاَمُ‏:‏ إِنَّهُ نَصْرَانِيٌّ، فَقَامَ عُقْبَةُ فَتَبِعَهُ حَتَّى أَدْرَكَهُ فَقَالَ‏:‏ إِنَّ رَحْمَةَ اللهِ وَبَرَكَاتَهُ عَلَى الْمُؤْمِنِينَ، لَكِنْ أَطَالَ اللَّهُ حَيَاتَكَ، وَأَكْثَرَ مَالَكَ وَوَلَدَكَ‏.‏","english":{"narrator":"","text":"'Uqba ibn 'Amir al-Juhani passed by a man who looked like a Muslim\nwho greeted him. 'Uqba answered him, saying, \"And on you and the mercy\nof Allah and his blessings.\" His slave said to him, \"He is a Christian.\"\n'Uqba got up and followed him until he caught up to him. He said, \"The\nmercy of Allah and His blessings are for the believers, but may Allah make\nyour life long and give you much wealth and many children.\""}},{"id":13,"idInBook":13,"chapterId":44,"bookId":15,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنْ ضِرَارِ بْنِ مُرَّةَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ قَالَ‏:‏ لَوْ قَالَ لِي فِرْعَوْنُ‏:‏ بَارَكَ اللَّهُ فِيكَ، قُلْتُ‏:‏ وَفِيكَ، وَفِرْعَوْنُ قَدْ مَاتَ‏.‏","english":{"narrator":"","text":"Ibn 'Abbas said, \"If Pharaoh had said to me, 'May Allah bless\nyou,' I would have said, 'And you.' But Pharaoh is dead.\""}},{"id":14,"idInBook":14,"chapterId":44,"bookId":15,"arabic":"وَعَنْ حَكِيمِ بْنِ دَيْلَمٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى قَالَ‏:‏ كَانَ الْيَهُودُ يَتَعَاطَسُونَ عِنْدَ النَّبِيِّ صلى الله عليه وسلم رَجَاءَ أَنْ يَقُولَ لَهُمْ‏:‏ يَرْحَمُكُمُ اللَّهُ، فَكَانَ يَقُولُ‏:‏ يَهْدِيكُمُ اللَّهُ وَيُصْلِحُ بَالَكُمْ‏.‏","english":{"narrator":"","text":"Abu Musa said, \"The Jews used to sneeze in the presence in the\nProphet, may Allah bless him and grant him peace, hoping that he would\nsay to them, 'May Allah have mercy on you,' but he used to say, 'May Allah\nguide you and out your affairs in order.'\""}},{"id":15,"idInBook":15,"chapterId":44,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، قَالَ‏:‏ أَخْبَرَنَا سُفْيَانُ، عَنْ أَبِي جَعْفَرٍ الْفَرَّاءِ، عَنْ عَبْدِ الرَّحْمَنِ قَالَ‏:‏ مَرَّ ابْنُ عُمَرَ بِنَصْرَانيٍّ فَسَلَّمَ عَلَيْهِ، فَرَدَّ عَلَيْهِ، فَأُخْبِرَ أَنَّهُ نَصْرَانِيٌّ، فَلَمَّا عَلِمَ رَجَعَ إِلَيْهِ فَقَالَ‏:‏ رُدَّ عَلَيَّ سَلامِي‏.‏","english":{"narrator":"","text":"'Abdu'r-Rahman said, \"Ibn 'Umar passed by a Christian who greeted\nhim and Ibn 'Umar returned the greeting He was told that the man was a\nChristian. When he learned that, he went back to him and said, 'Give me\nback my greeting.'\""}},{"id":16,"idInBook":16,"chapterId":44,"bookId":15,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ‏:‏ حَدَّثَنَا زَكَرِيَّا قَالَ‏:‏ سَمِعْتُ عَامِرًا يَقُولُ‏:‏ حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ عَائِشَةَ حَدَّثَتْهُ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ لَهَا‏:‏ جِبْرِيلُ يَقْرَأُ عَلَيْكِ السَّلامَ، فَقَالَتْ‏:‏ وَعَلَيْهِ السَّلاَمُ وَرَحْمَةُ اللهِ‏.‏","english":{"narrator":"","text":"'A'isha reported that the Prophet, may Allah bless him and grant\nhim peace, said to her, \"Jibril sends you the greeting.\" She replied, \"And\npeace be upon him and the mercy of Allah.\""}}],"chapter":{"id":44,"bookId":15,"arabic":"كتاب أَهْلِ الْكِتَابِ","english":"The People of the Book"}}