{"metadata":{"length":19,"arabic":{"title":"الأدب المفرد","author":"الإمام محمد بن إسماعيل البخاري","introduction":"كتاب الرَّسَائِلِ‏"},"english":{"title":"Al-Adab Al-Mufrad","author":"Imam Muhammad ibn Ismail al-Bukhari","introduction":"Letters"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":45,"bookId":15,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ‏:‏ أَخْبَرَنَا شَرِيكٌ، عَنِ الْعَبَّاسِ بْنِ ذَرِيحٍ، عَنْ عَامِرٍ، عَنِ ابْنِ عَبَّاسٍ قَالَ‏:‏ إِنِّي لَأَرَى لِجَوَابِ الْكِتَابِ حَقًّا كَرَدِّ السَّلامِ‏.‏","english":{"narrator":"","text":"Ibn 'Abbas said, \"I think that answering a letter is a duty, just\nlike returning the greeting.\""}},{"id":2,"idInBook":2,"chapterId":45,"bookId":15,"arabic":"حَدَّثَنَا ابْنُ رَافِعٍ، قَالَ‏:‏ حَدَّثَنَا أَبُو أُسَامَةَ قَالَ‏:‏ حَدَّثَنِي مُوسَى بْنُ عَبْدِ اللهِ قَالَ‏:‏ حَدَّثَتْنَا عَائِشَةُ بِنْتُ طَلْحَةَ قَالَتْ‏:‏ قُلْتُ لِعَائِشَةَ، وَأَنَا فِي حِجْرِهَا، وَكَانَ النَّاسُ يَأْتُونَهَا مِنْ كُلِّ مِصْرٍ، فَكَانَ الشُّيُوخُ يَنْتَابُونِي لِمَكَانِي مِنْهَا، وَكَانَ الشَّبَابُ يَتَأَخَّوْنِي فَيُهْدُونَ إِلَيَّ، وَيَكْتُبُونَ إِلَيَّ مِنَ الأَمْصَارِ، فَأَقُولُ لِعَائِشَةَ‏:‏ يَا خَالَةُ، هَذَا كِتَابُ فُلاَنٍ وَهَدِيَّتُهُ، فَتَقُولُ لِي عَائِشَةُ‏:‏ أَيْ بُنَيَّةُ، فَأَجِيبِيهِ وَأَثِيبِيهِ، فَإِنْ لَمْ يَكُنْ عِنْدَكِ ثَوَابٌ أَعْطَيْتُكِ، فَقَالَتْ‏:‏ فَتُعْطِينِي‏.‏","english":{"narrator":"","text":"'A'isha bint Talha said, \"I spoke to 'A'isha when I was under\nher protection. people used to visit her from all places. Shaykhs used\nvisit me because of my place with her. Young men used to treat me as a\nsister and give me presents and write to me from their cities. I said to\n'A'isha, 'Aunt, this is a letter from so-and-so and his gift.' 'A'isha\ntold me, 'My girl, answer him and reward him. If you do not have anything\nto give, I will give you something.' She told her to give it to her.\""}},{"id":3,"idInBook":3,"chapterId":45,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ قَالَ‏:‏ حَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ اللهِ بْنِ دِينَارٍ، أَنَّ عَبْدَ اللهِ بْنَ عُمَرَ كَتَبَ إِلَى عَبْدِ الْمَلِكِ بْنِ مَرْوَانَ يُبَايِعُهُ، فَكَتَبَ إِلَيْهِ‏:‏ بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ، لِعَبْدِ الْمَلِكِ أَمِيرِ الْمُؤْمِنِينَ مِنْ عَبْدِ اللهِ بْنِ عُمَرَ‏:‏ سَلاَمٌ عَلَيْكَ، فَإِنِّي أَحْمَدُ إِلَيْكَ اللَّهَ الَّذِي لاَ إِلَهَ إِلاَّ هُوَ، وَأُقِرُّ لَكَ بِالسَّمْعِ وَالطَّاعَةِ عَلَى سُنَّةِ اللهِ وَسُنَّةِ رَسُولِهِ، فِيمَا اسْتَطَعْتُ‏.‏","english":{"narrator":"","text":"'Abdullah ibn 'Umar wrote to 'Abdu'l-Malik ibn Marwan in order\nto pledge him his allegiance. He wrote to him, \"In the Name of Allah, the\nAll-Merciful, Most Merciful. To 'Abdu'l-Malik, the Amir al-Mu'minin, from\n'Abdullah ibn 'Umar. Peace be upon you. I praise Allah to you. There is\nno god but Him. I offer you obedience according to the sunna of Allah and\nthe sunna of His Messenger as much as I can.\""}},{"id":4,"idInBook":4,"chapterId":45,"bookId":15,"arabic":"حَدَّثَنَا قَبِيصَةُ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنْ زَيْدِ بْنِ أَسْلَمَ قَالَ‏:‏ أَرْسَلَنِي أَبِي إِلَى ابْنِ عُمَرَ، فَرَأَيْتُهُ يَكْتُبُ‏:‏ بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ، أَمَّا بَعْدُ‏.‏","english":{"narrator":"","text":"Zayd ibn Aslam said, \"My father sent me to Ibn 'Umar and I saw\nhim write, 'In the Name of Allah, the All-Merciful, Most Merciful. Following\non from that'\""}},{"id":5,"idInBook":5,"chapterId":45,"bookId":15,"arabic":"حَدَّثَنَا رَوْحُ بْنُ عَبْدِ الْمُؤْمِنِ، قَالَ‏:‏ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامِ بْنِ عُرْوَةَ قَالَ‏:‏ رَأَيْتُ رَسَائِلَ مِنْ رَسَائِلِ النَّبِيِّ صلى الله عليه وسلم، كُلَّمَا انْقَضَتْ قِصَّةٌ قَالَ‏:‏ أَمَّا بَعْدُ‏.‏","english":{"narrator":"","text":"Hisham ibn 'Urwa said, \"I saw some of the letters of the Prophet,\nmay Allah bless him and grant him peace. After the introduction he said,\n'Following on from that'\""}},{"id":6,"idInBook":6,"chapterId":45,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ، قَالَ‏:‏ حَدَّثَنَا ابْنُ أَبِي الزِّنَادِ، عَنْ أَبِيهِ، عَنْ خَارِجَةَ بْنِ زَيْدٍ، عَنْ كُبَرَاءِ آلِ زَيْدِ بْنِ ثَابِتٍ، أَنَّ زَيْدَ بْنَ ثَابِتٍ كَتَبَ بِهَذِهِ الرِّسَالَةِ‏:‏ بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ، لِعَبْدِ اللهِ مُعَاوِيَةَ أَمِيرِ الْمُؤْمِنِينَ، مِنْ زَيْدِ بْنِ ثَابِتٍ، سَلاَمٌ عَلَيْكَ أَمِيرَ الْمُؤْمِنِينَ وَرَحْمَةُ اللهِ، فَإِنِّي أَحْمَدُ إِلَيْكَ اللَّهَ الَّذِي لا إِلَهَ إلا هُوَ، أَمَّا بَعْدُ‏.‏","english":{"narrator":"It is reported that Zayd ibn Thabit wrote this letter:","text":"\"In the\nName of Allah, the All-Merciful, Most Merciful. To the slave of Allah,\nMu'awiya, the Amir al-Mu'minin, from Zayd ibn Thabit. Peace be upon you,\nAmir al-Mu'minin, and the mercy of Allah. I praise Allah to you. There\nis no god but Him. Following on from that'\""}},{"id":7,"idInBook":7,"chapterId":45,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدٌ الأَنْصَارِيُّ، قَالَ‏:‏ حَدَّثَنَا أَبُو مَسْعُودٍ الْجُرَيْرِيُّ قَالَ‏:‏ سَأَلَ رَجُلٌ الْحَسَنَ عَنْ قِرَاءَةِ بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ‏؟‏ قَالَ‏:‏ تِلْكَ صُدُورُ الرَّسَائِلِ‏.‏","english":{"narrator":"","text":"Abu Mas'ud al-Jurayri related to him that a man asked al-Hasan\nabout reading, \"In the Name of Allah, the All-Merciful, Most Merciful.\"\nHe said, \"That should be put at the beginning of letters.\""}},{"id":8,"idInBook":8,"chapterId":45,"bookId":15,"arabic":"حَدَّثَنَا قُتَيْبَةُ، قَالَ‏:‏ حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّا، عَنِ ابْنِ عَوْنٍ، عَنْ نَافِعٍ قَالَ‏:‏ كَانَتْ لِابْنِ عُمَرَ حَاجَةٌ إِلَى مُعَاوِيَةَ، فَأَرَادَ أَنْ يَكْتُبَ إِلَيْهِ، فَقَالُوا‏:‏ ابْدَأْ بِهِ، فَلَمْ يَزَالُوا بِهِ حَتَّى كَتَبَ‏:‏ بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ، إِلَى مُعَاوِيَةَ‏.‏","english":{"narrator":"","text":"Nafi' said, \"Ibn 'Umar needed something from Mu'awiya and he wanted\nto write to him. People said, 'Begin with his name.' They kept on at him\nuntil he wrote, 'In the Name of Allah, the All-Merciful, Most Merciful,\nto Mu'awiya.'\""}},{"id":9,"idInBook":9,"chapterId":45,"bookId":15,"arabic":"وَعَنِ ابْنِ عَوْنٍ، عَنْ أَنَسِ بْنِ سِيرِينَ قَالَ‏:‏ كَتَبْتُ لِابْنِ عُمَرَ، فَقَالَ‏:‏ اكْتُبْ بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ، أَمَّا بَعْدُ‏:‏ إِلَى فُلانٍ‏.‏","english":{"narrator":"Anas ibn Sirin said, \"I wrote for Ibn 'Umar and he said, 'Write:","text":"\"In the Name of Allah, the All-Merciful, Most Merciful. Following on from\nthat: To so-and-so.\"'\""}},{"id":10,"idInBook":10,"chapterId":45,"bookId":15,"arabic":"وَعَنِ ابْنِ عَوْنٍ، عَنْ أَنَسِ بْنِ سِيرِينَ قَالَ‏:‏ كَتَبَ رَجُلٌ بَيْنَ يَدَيِ ابْنِ عُمَرَ‏:‏ بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ، لِفُلاَنٍ، فَنَهَاهُ ابْنُ عُمَرَ وَقَالَ‏:‏ قُلْ‏:‏ بِسْمِ اللهِ، هُوَ لَهُ‏.‏","english":{"narrator":"Anas ibn Sirin said, \"A man wrote in the presence of Ibn 'Umar,\n'In the Name of Allah, the All-Merciful, Most Merciful, to so-and-so.'\nIbn 'Umar forbade him and said, 'Say:","text":"'In the Name of Allah. It is for\nHim.'\""}},{"id":11,"idInBook":11,"chapterId":45,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ قَالَ‏:‏ حَدَّثَنِي ابْنُ أَبِي الزِّنَادِ، عَنْ أَبِيهِ، عَنْ خَارِجَةَ بْنِ زَيْدٍ، عَنْ كُبَرَاءِ آلِ زَيْدٍ، أَنَّ زَيْدًا كَتَبَ بِهَذِهِ الرِّسَالَةِ‏:‏ لِعَبْدِ اللهِ مُعَاوِيَةَ أَمِيرِ الْمُؤْمِنِينَ، مِنْ زَيْدِ بْنِ ثَابِتٍ‏:‏ سَلاَمٌ عَلَيْكَ أَمِيرَ الْمُؤْمِنِينَ وَرَحْمَةُ اللهِ، فَإِنِّي أَحْمَدُ إِلَيْكَ اللَّهَ الَّذِي لاَ إِلَهَ إِلاَّ هُوَ، أَمَّا بَعْدُ‏.‏","english":{"narrator":"","text":"See 1122."}},{"id":12,"idInBook":12,"chapterId":45,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى، قَالَ‏:‏ حَدَّثَنَا أَبُو عَوَانَةَ، قَالَ‏:‏ حَدَّثَنَا عُمَرُ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، سَمِعْتُهُ يَقُولُ‏:‏ قَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ إِنَّ رَجُلاً مِنْ بَنِي إِسْرَائِيلَ، وَذَكَرَ الْحَدِيثَ، وَكَتَبَ إِلَيْهِ صَاحِبُهُ‏:‏ مِنْ فُلاَنٍ إِلَى فُلانٍ‏.‏","english":{"narrator":"","text":"Abu Hurayra said, \"The Prophet, may Allah bless him and grant\nhim peace, said, 'A man from the tribe of Israel - and he mentioned\nthe entire hadith - had his friend write to him, 'From so-and-so to\nso-and-so.'\""}},{"id":13,"idInBook":13,"chapterId":45,"bookId":15,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ‏:‏ حَدَّثَنَا ابْنُ الْغَسِيلِ، عَنْ عَاصِمِ بْنِ عُمَرَ، عَنْ مَحْمُودِ بْنِ لَبِيدٍ قَالَ‏:‏ لَمَّا أُصِيبَ أَكْحُلُ سَعْدٍ يَوْمَ الْخَنْدَقِ فَثَقُلَ، حَوَّلُوهُ عِنْدَ امْرَأَةٍ يُقَالُ لَهَا‏:‏ رُفَيْدَةُ، وَكَانَتْ تُدَاوِي الْجَرْحَى، فَكَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا مَرَّ بِهِ يَقُولُ‏:‏ كَيْفَ أَمْسَيْتَ‏؟‏، وَإِذَا أَصْبَحَ‏:‏ كَيْفَ أَصْبَحْتَ‏؟‏ فَيُخْبِرُهُ‏.‏","english":{"narrator":"","text":"Mahmud ibn Labid said, \"When Sa'd's eye was gravely wounded in\nthe Battle of the Ditch, they moved him to the house of a woman called\nRufayda who used to treat the wounded. When the Prophet, may Allah bless\nhim and grant him peace, passed by him, he would inquire, 'How are you\nthis evening?' and in the morning, 'How are you this morning?' and he would\ntell him.\""}},{"id":14,"idInBook":14,"chapterId":45,"bookId":15,"arabic":"حَدَّثَنَا يَحْيَى بْنُ صَالِحٍ، قَالَ‏:‏ حَدَّثَنَا إِسْحَاقُ بْنُ يَحْيَى الْكَلْبِيُّ، قَالَ‏:‏ حَدَّثَنَا الزُّهْرِيُّ قَالَ‏:‏ أَخْبَرَنِي عَبْدُ اللهِ بْنُ كَعْبِ بْنِ مَالِكٍ الأَنْصَارِيُّ، قَالَ‏:‏ وَكَانَ كَعْبُ بْنُ مَالِكٍ أَحَدَ الثَّلاَثَةِ الَّذِينَ تِيبَ عَلَيْهِمْ، أَنَّ ابْنَ عَبَّاسٍ أَخْبَرَهُ، أَنَّ عَلِيَّ بْنَ أَبِي طَالِبٍ رَضِيَ اللَّهُ عَنْهُ خَرَجَ مِنْ عِنْدِ رَسُولِ اللهِ صلى الله عليه وسلم فِي وَجَعِهِ الَّذِي تُوُفِّيَ فِيهِ، فَقَالَ النَّاسُ‏:‏ يَا أَبَا الْحَسَنِ، كَيْفَ أَصْبَحَ رَسُولُ اللهِ صلى الله عليه وسلم‏؟‏ قَالَ‏:‏ أَصْبَحَ بِحَمْدِ اللهِ بَارِئًا، قَالَ‏:‏ فَأَخَذَ عَبَّاسُ بْنُ عَبْدِ الْمُطَّلِبِ بِيَدِهِ، فَقَالَ‏:‏ أَرَأَيْتُكَ‏؟‏ فَأَنْتَ وَاللَّهِ بَعْدَ ثَلاَثٍ عَبْدُ الْعَصَا، وَإِنِّي وَاللَّهِ لَأَرَى رَسُولَ اللهِ صلى الله عليه وسلم سَوْفَ يُتَوَفَّى فِي مَرَضِهِ هَذَا، إِنِّي أَعْرِفُ وُجُوهَ بَنِي عَبْدِ الْمُطَّلِبِ عِنْدَ الْمَوْتِ، فَاذْهَبْ بِنَا إِلَى رَسُولِ اللهِ صلى الله عليه وسلم فَلْنَسْأَلْهُ‏:‏ فِيمَنْ هَذَا الأَمْرُ‏؟‏ فَإِنْ كَانَ فِينَا عَلِمْنَا ذَلِكَ، وَإِنْ كَانَ فِي غَيْرِنَا كَلَّمْنَاهُ فَأَوْصَى بِنَا، فَقَالَ عَلِيٌّ‏:‏ إِنَّا وَاللَّهِ إِنْ سَأَلْنَاهُ فَمَنَعَنَاهَا لاَ يُعْطِينَاهَا النَّاسُ بَعْدَهُ أَبَدًا، وَإِنِّي وَاللَّهِ لاَ أَسْأَلُهَا رَسُولَ اللهِ صلى الله عليه وسلم أَبَدًا‏.‏","english":{"narrator":"","text":"It is related from Ka'b ibn Malik, who was one of the three to\nwhom Allah turned that Ibn 'Abbas informed him that 'Ali ibn Abi Talib\nemerged from the Messenger of Allah, may Allah bless him and grant him\npeace, in his illness from which he died and the people said, \"O Abu'l-Hasan!\nHow is the Messenger of Allah, may Allah bless him and grant him peace,\nthis morning?\" He said, \"Praise be to Allah, he is well this morning.\"\n'Abbas ibn 'Abdu'l-Muttalib took him by the hand and said to him, \"By Allah,\nin three days time you will be a subject. By Allah, I think that the Messenger\nof Allah, may Allah bless him and grant him peace, will die of this illness.\nI recognise death in the faces of the Banu Abdu'l-Muttalib when they are\ndying. Let us go to the Messenger of Allah, may Allah bless him and grant\nhim peace, and ask him who will have this authority. If it is for us, then\nwe will know that, and if it is for other than us, we will know it and\nhe can advise him to look after us.\" 'Ali replied, \"By Allah, if we ask\nhim for it and he refuses us, then the people would never give it to us\nafterwards. By Allah, I will not ask it from the Messenger of Allah.\""}},{"id":15,"idInBook":15,"chapterId":45,"bookId":15,"arabic":"حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ، قَالَ‏:‏ أَخْبَرَنَا ابْنُ أَبِي الزِّنَادِ قَالَ‏:‏ حَدَّثَنِي أَبِي، أَنَّهُ أَخَذَ هَذِهِ الرِّسَالَةَ مِنْ خَارِجَةَ بْنِ زَيْدٍ، وَمِنْ كُبَرَاءِ آلِ زَيْدٍ‏:‏ بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ، لِعَبْدِ اللهِ مُعَاوِيَةَ أَمِيرِ الْمُؤْمِنِينَ، مِنْ زَيْدِ بْنِ ثَابِتٍ‏:‏ سَلاَمٌ عَلَيْكَ أَمِيرَ الْمُؤْمِنِينَ وَرَحْمَةُ اللهِ، فَإِنِّي أَحْمَدُ إِلَيْكَ اللَّهَ الَّذِي لاَ إِلَهَ إِلاَّ هُوَ، أَمَّا بَعْدُ‏:‏ فَإِنَّكَ تَسْأَلُنِي عَنْ مِيرَاثِ الْجَدِّ وَالإِخْوَةِ، فَذَكَرَ الرِّسَالَةَ، وَنَسْأَلُ اللَّهَ الْهُدَى وَالْحِفْظَ وَالتَّثَبُّتَ فِي أَمْرِنَا كُلِّهِ، وَنَعُوذُ بِاللَّهِ أَنْ نَضِلَّ، أَوْ نَجْهَلَ، أَوْ نُكَلَّفَ مَا لَيْسَ لَنَا بِهِ عِلْمٌ، وَالسَّلاَمُ عَلَيْكَ أَمِيرَ الْمُؤْمِنِينَ وَرَحْمَةُ اللهِ وَبَرَكَاتُهُ وَمَغْفِرَتُهُ‏.‏ وَكَتَبَ وُهَيْبٌ‏:‏ يَوْمَ الْخَمِيسِ لِثِنْتَيْ عَشْرَةَ بَقِيَتْ مِنْ رَمَضَانَ سَنَةَ اثْنَيْنِ وَأَرْبَعِينَ‏.‏","english":{"narrator":"Ibn Abi-Zinad related from his father that he tool this letter\nfrom Kharija ibn Zayd and from the great members of the family of Zayd:","text":"\"In the Name of Allah, the All-Merciful, Most Merciful. To the slave of\nProphet, Mu'awiya, the Amir al-Mu'minin, from Zayd ibn Thabit. Peace be\nupon you, Amir al-Mu'minin, and the mercy of Allah. I praise Allah to you.\nThere is no god but Him. Following on from that, you asked me about the\ninheritance of the grandfather and brothers (and he mentioned the letter).\nWe ask Allah for guidance, preservation and firmness in all our affairs.\nWe seek refuge with Allah from being misguided or ignorant or taking on\nwhat we have no knowledge of. Peace be upon you, Amir al-Mu'minin, and\nthe mercy of Allah and His blessings and His forgiveness. Wuhayb has written\nit on Thursday, the 20th Ramadan, 42 (AH).\""}},{"id":16,"idInBook":16,"chapterId":45,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ قَالَ‏:‏ حَدَّثَنِي مَالِكٌ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّهُ سَمِعَ عُمَرَ بْنَ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ، وَسَلَّمَ عَلَيْهِ رَجُلٌ فَرَدَّ السَّلاَمَ، ثُمَّ سَأَلَ عُمَرُ الرَّجُلَ‏:‏ كَيْفَ أَنْتَ‏؟‏ فَقَالَ‏:‏ أَحْمَدُ اللَّهَ إِلَيْكَ، فَقَالَ عُمَرُ‏:‏ هَذَا الَّذِي أَرَدْتُ مِنْكَ‏.‏","english":{"narrator":"Anas ibn Malik reported that he heard 'Umar ibn al-Khattab being\ngreeted by a man and he returned the greeting. Then 'Umar asked the man,\n\"How are you?\" The man replied, \"I praise Allah to you.\" 'Umar said, :","text":"This\nis what I wanted to hear from you.\""}},{"id":17,"idInBook":17,"chapterId":45,"bookId":15,"arabic":"حَدَّثَنَا أَبُو عَاصِمٍ، عَنْ عَبْدِ اللهِ بْنِ مُسْلِمٍ، عَنْ سَلَمَةَ الْمَكِّيِّ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ‏:‏ قِيلَ لِلنَّبِيِّ صلى الله عليه وسلم‏:‏ كَيْفَ أَصْبَحْتَ‏؟‏ قَالَ‏:‏ بِخَيْرٍ مِنْ قَوْمٍ لَمْ يَشْهَدُوا جَنَازَةً، وَلَمْ يَعُودُوا مَرِيضًا‏.‏","english":{"narrator":"","text":"Jabir ibn 'Abdullah reported that the Prophet, may Allah bless\nhim and grant him peace, was asked, \"How are you this morning?\" He replied,\n\"Well. Away from people who do not attend funerals or visit sick people.\""}},{"id":18,"idInBook":18,"chapterId":45,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، قَالَ‏:‏ حَدَّثَنَا شَرِيكٌ، عَنْ مُهَاجِرٍ هُوَ الصَّائِغُ، قَالَ‏:‏ كُنْتُ أَجْلِسُ إِلَى رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم ضَخْمٍ مِنَ الْحَضْرَمِيِّينَ، فَكَانَ إِذَا قِيلَ لَهُ‏:‏ كَيْفَ أَصْبَحْتَ‏؟‏ قَالَ‏:‏ لا نُشْرِكُ بِاللَّهِ‏.‏","english":{"narrator":"","text":"Muhajir (who is as-Sa'igh) said, \"I was sitting with one of the\nCompanions of the Messenger of Allah, may Allah bless him and grant him\npeace, called Dakhm, from al-Hadramaym. When someone asked him, 'How are\nyou this morning?' Dakhm replied, 'We do not associate anything with Allah.'\""}},{"id":19,"idInBook":19,"chapterId":45,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى، قَالَ‏:‏ حَدَّثَنَا رِبْعِيُّ بْنُ عَبْدِ اللهِ بْنِ الْجَارُودِ الْهُذَلِيُّ، قَالَ‏:‏ حَدَّثَنَا سَيْفُ بْنُ وَهْبٍ قَالَ‏:‏ قَالَ لِي أَبُو الطُّفَيْلِ‏:‏ كَمْ أَتَى عَلَيْكَ‏؟‏ قُلْتُ‏:‏ أَنَا ابْنُ ثَلاَثٍ وَثَلاَثِينَ، قَالَ‏:‏ أَفَلاَ أُحَدِّثُكَ بِحَدِيثٍ سَمِعْتُهُ مِنْ حُذَيْفَةَ بْنِ الْيَمَانِ‏:‏ إِنَّ رَجُلاً مِنْ مُحَارِبِ خَصَفَةَ، يُقَالُ لَهُ‏:‏ عَمْرُو بْنُ صُلَيْعٍ، وَكَانَتْ لَهُ صُحْبَةٌ، وَكَانَ بِسِنِّي يَوْمَئِذٍ وَأَنَا بِسِنِّكَ الْيَوْمَ، أَتَيْنَا حُذَيْفَةَ فِي مَسْجِدٍ، فَقَعَدْتُ فِي آخِرِ الْقَوْمِ، فَانْطَلَقَ عَمْرٌو حَتَّى قَامَ بَيْنَ يَدَيْهِ، قَالَ‏:‏ كَيْفَ أَصْبَحْتَ، أَوْ كَيْفَ أَمْسَيْتَ يَا عَبْدَ اللهِ‏؟‏ قَالَ‏:‏ أَحْمَدُ اللَّهَ، قَالَ‏:‏ مَا هَذِهِ الأَحَادِيثُ الَّتِي تَأْتِينَا عَنْكَ‏؟‏ قَالَ‏:‏ وَمَا بَلَغَكَ عَنِّي يَا عَمْرُو‏؟‏ قَالَ‏:‏ أَحَادِيثُ لَمْ أَسْمَعْهَا، قَالَ‏:‏ إِنِّي وَاللَّهِ لَوْ أُحَدِّثُكُمْ بِكُلِّ مَا سَمِعْتُ مَا انْتَظَرْتُمْ بِي جُنْحَ هَذَا اللَّيْلِ، وَلَكِنْ يَا عَمْرُو بْنَ صُلَيْعٍ، إِذَا رَأَيْتَ قَيْسًا تَوَالَتْ بِالشَّامِ فَالْحَذَرَ الْحَذَرَ، فَوَاللَّهِ لاَ تَدَعُ قَيْسٌ عَبْدًا لِلَّهِ مُؤْمِنًا إِلاَّ أَخَافَتْهُ أَوْ قَتَلَتْهُ، وَاللَّهِ لَيَأْتِيَنَّ عَلَيْهِمْ زَمَانٌ لاَ يَمْنَعُونَ فِيهِ ذَنَبَ تَلْعَةٍ، قَالَ‏:‏ مَا يَنْصِبُكَ عَلَى قَوْمِكَ يَرْحَمُكَ اللَّهُ‏؟‏ قَالَ‏:‏ ذَاكَ إِلَيَّ، ثُمَّ قَعَدَ‏.‏","english":{"narrator":"","text":"Sayf ibn Wahb reported that Abu't-Tufayl asked him, \"How old are\nyou?\" \"Thirty-three years old,\" he replied. He said, \"Shall I tell you\na hadith which I heard from Hudhayfa ibn al-Yaman? A man from Muharib ibn\nKhasafa called 'Amr ibn Sulay', a Companion, was my age on that day and\nI was your age. Hudhayfa came to us in the mosque and sat at the edge of\nthe people. 'Amr went over until he was standing in front of him and asked,\n'How are you this morning (or evening), slave of Allah?' Hudhayfa said,\n'I praise Allah.' 'Amr said, 'What are these hadiths which have come to\nus from you?' Hudhayfa said, 'What have you heard from me, 'Amr?' He said,\n'Hadiths which I have not heard from anywhere else.' Hudhayfa said, 'By\nAllah, if I were to relate to you all that I have heard, you would be here\nwith me until the middle of the night. 'Amr ibn Sulay', if you see Qays\ntaking control of Syria, then beware and again beware. By Allah, Qays will\nnot leave a believing slave of Allah without causing him to be in a state\nof fear or killing him. By Allah, a time will come to you in which the\nflood will not be stopped.' He said, 'Then what will help you against your\npeople, may Allah have mercy on you?' He said, 'That is my business.' Then\nhe sat down.\""}}],"chapter":{"id":45,"bookId":15,"arabic":"كتاب الرَّسَائِلِ‏","english":"Letters"}}