{"metadata":{"length":17,"arabic":{"title":"الأدب المفرد","author":"الإمام محمد بن إسماعيل البخاري","introduction":"كتاب الْمَجَالِسِ"},"english":{"title":"Al-Adab Al-Mufrad","author":"Imam Muhammad ibn Ismail al-Bukhari","introduction":"Gatherings"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":46,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا أَبُو عَامِرٍ الْعَقَدِيُّ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي الْمَوَالِي قَالَ‏:‏ أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ أَبِي عَمْرَةَ الأَنْصَارِيُّ قَالَ‏:‏ أُوذِنَ أَبُو سَعِيدٍ الْخُدْرِيُّ بِجِنَازَةٍ، قَالَ‏:‏ فَكَأَنَّهُ تَخَلَّفَ حَتَّى أَخَذَ الْقَوْمُ مَجَالِسَهُمْ، ثُمَّ جَاءَ مَعَهُ، فَلَمَّا رَآهُ الْقَوْمُ تَسَرَّعُوا عَنْهُ، وَقَامَ بَعْضُهُمْ عَنْهُ لِيَجْلِسَ فِي مَجْلِسِهِ، فَقَالَ‏:‏ لاَ، إِنِّي سَمِعْتُ رَسُولَ اللهِ صلى الله عليه وسلم يَقُولُ‏:‏ خَيْرُ الْمَجَالِسِ أَوْسَعُهَا، ثُمَّ تَنَحَّى فَجَلَسَ فِي مَجْلِسٍ وَاسِعٍ‏.‏","english":{"narrator":"","text":"'Abdu'r-Rahman ibn Abi 'Amra al-Ansari related to him, \"Abu Sa'id\nal-Khudri was told of a funeral.\" He continued, \"It seemed that he was\nhanging back until people had taken their seats. Then he came. When the\npeople saw him, they quickly made room for him. One of them stood up for\nhim to let him sit in his place. He said, 'Don't. I heard the Messenger\nof Allah, may Allah bless him and grant him peace, say, \"The best gathering\nis the most expansive one.\" 'Then he went to the side and sat in an expansive\ngathering.\""}},{"id":2,"idInBook":2,"chapterId":46,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ صَالِحٍ قَالَ‏:‏ حَدَّثَنِي حَرْمَلَةُ بْنُ عِمْرَانَ، عَنْ سُفْيَانَ بْنِ مُنْقِذٍ، عَنْ أَبِيهِ قَالَ‏:‏ كَانَ أَكْثَرُ جُلُوسِ عَبْدِ اللهِ بْنِ عُمَرَ وَهُوَ مُسْتَقْبِلٌ الْقِبْلَةَ، فَقَرَأَ يَزِيدُ بْنُ عَبْدِ اللهِ بْنِ قُسَيْطٍ سَجْدَةً بَعْدَ طُلُوعِ الشَّمْسِ فَسَجَدَ وَسَجَدُوا إِلاَّ عَبْدَ اللهِ بْنَ عُمَرَ، فَلَمَّا طَلَعَتِ الشَّمْسُ حَلَّ عَبْدُ اللهِ حَبْوَتَهُ ثُمَّ سَجَدَ وَقَالَ‏:‏ أَلَمْ تَرَ سَجْدَةَ أَصْحَابِكَ‏؟‏ إِنَّهُمْ سَجَدُوا فِي غَيْرِ حِينِ صَلاةٍ‏.‏","english":{"narrator":"","text":"Munqidh said, \"In most of the gatherings of 'Abdullah ibn 'Umar,\nhe would face qibla. Once Yazid ibn 'Abdullah ibn Fusayt recited Sajda\nafter sunrise. He prostrated and the people there prostrated with the exception\nof 'Abdullah ibn 'Umar. When the sun rose, 'Abdullah uncurled his legs\nand then prostrated. He said, 'Did you see the prostration of your companions?\nThey prostrated at a time when the prayer should not be done.\""}},{"id":3,"idInBook":3,"chapterId":46,"bookId":15,"arabic":"حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، قَالَ‏:‏ حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ قَالَ‏:‏ حَدَّثَنِي سُهَيْلٌ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم‏:‏ إِذَا قَامَ أَحَدُكُمْ مِنْ مَجْلِسِهِ، ثُمَّ رَجَعَ إِلَيْهِ، فَهُوَ أَحَقُّ بِهِ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"When one of you gets up from his place and then\nreturns to it, he is more entitled to.\""}},{"id":4,"idInBook":4,"chapterId":46,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلامٍ، قَالَ‏:‏ أَخْبَرَنَا أَبُو خَالِدٍ الأَحْمَرُ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ‏:‏ أَتَانَا رَسُولُ اللهِ صلى الله عليه وسلم وَنَحْنُ صِبْيَانُ، فَسَلَّمَ عَلَيْنَا، وَأَرْسَلَنِي فِي حَاجَةٍ، وَجَلَسَ فِي الطَّرِيقِ يَنْتَظِرُنِي حَتَّى رَجَعْتُ إِلَيْهِ، قَالَ‏:‏ فَأَبْطَأْتُ عَلَى أُمِّ سُلَيْمٍ، فَقَالَتْ‏:‏ مَا حَبَسَكَ‏؟‏ فَقُلْتُ‏:‏ بَعَثَنِي النَّبِيُّ صلى الله عليه وسلم فِي حَاجَةٍ، قَالَتْ‏:‏ مَا هِيَ‏؟‏ قُلْتُ‏:‏ إِنَّهَا سِرٌّ، قَالَتْ‏:‏ فَاحْفَظْ سِرَّ رَسُولِ اللهِ صلى الله عليه وسلم‏.‏","english":{"narrator":"","text":"Anas said, \"The Messenger of Allah, may Allah bless him and grant\nhim peace, came to us when we were children. He greeted us and sent me\nto get something he needed. He sat in the road waiting for me until I came\nback to him.\""}},{"id":5,"idInBook":5,"chapterId":46,"bookId":15,"arabic":"حَدَّثَنَا الْحُمَيْدِيُّ، قَالَ‏:‏ حَدَّثَنَا ابْنُ عُيَيْنَةَ، قَالَ‏:‏ حَدَّثَنَا عُبَيْدُ اللهِ بْنُ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ قَالَ‏:‏ قَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ لاَ يُقِيمَنَّ أَحَدُكُمُ الرَّجُلَ مِنْ مَجْلِسِهِ، ثُمَّ يَجْلِسُ فِيهِ، وَلَكِنْ تَفَسَّحُوا وَتَوَسَّعُوا‏.‏","english":{"narrator":"","text":"Ibn 'Umar reported that the Prophet, may Allah bless him and grant\nhim peace, said, \"None of you should make a man rise from his seat and\nthen sit in it. Rather make room and spread out.\""}},{"id":6,"idInBook":6,"chapterId":46,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الطُّفَيْلِ، قَالَ‏:‏ حَدَّثَنَا شَرِيكٌ، عَنْ سِمَاكٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ‏:‏ كُنَّا إِذَا أَتَيْنَا النَّبِيَّ صلى الله عليه وسلم جَلَسَ أَحَدُنَا حَيْثُ انْتَهَى‏.‏","english":{"narrator":"","text":"Jabir ibn Samura said, \"When we came to the Prophet, may Allah\nbless him and grant him peace, we would sit at the edge of the group.\""}},{"id":7,"idInBook":7,"chapterId":46,"bookId":15,"arabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، قَالَ‏:‏ حَدَّثَنَا الْفُرَاتُ بْنُ خَالِدٍ، عَنْ أُسَامَةَ بْنِ زَيْدٍ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللهِ بْنِ عَمْرٍو، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ‏:‏ لاَ يَحِلُّ لِرَجُلٍ أَنْ يُفَرِّقَ بَيْنَ اثْنَيْنِ، إِلا بِإِذْنِهِمَا‏.‏","english":{"narrator":"","text":"'Abdullah ibn 'Amr reported that the Prophet, may Allah bless\nhim and grant him peace, said, \"It is not lawful for a man to separate\ntwo people except with the permission of both of them.\""}},{"id":8,"idInBook":8,"chapterId":46,"bookId":15,"arabic":"حَدَّثَنَا بَيَانُ بْنُ عَمْرٍو، قَالَ‏:‏ حَدَّثَنَا النَّضْرُ، قَالَ‏:‏ أَخْبَرَنَا أَبُو عَامِرٍ الْمُزَنِيُّ هُوَ صَالِحُ بْنُ رُسْتُمَ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنِ ابْنِ عَبَّاسٍ قَالَ‏:‏ لَمَّا طُعِنَ عُمَرُ رَضِيَ اللَّهُ عَنْهُ كُنْتُ فِيمَنْ حَمَلَهُ حَتَّى أَدْخَلْنَاهُ الدَّارَ، فَقَالَ لِي‏:‏ يَا ابْنَ أَخِي، اذْهَبْ فَانْظُرْ مَنْ أَصَابَنِي، وَمَنْ أَصَابَ مَعِي، فَذَهَبْتُ فَجِئْتُ لِأُخْبِرُهُ، فَإِذَا الْبَيْتُ مَلْآنُ، فَكَرِهْتُ أَنْ أَتَخَطَّى رِقَابَهُمْ، وَكُنْتُ حَدِيثَ السِّنِّ، فَجَلَسْتُ، وَكَانَ يَأْمُرُ إِذَا أَرْسَلَ أَحَدًا بِالْحَاجَةِ أَنْ يُخْبِرَهُ بِهَا، وَإِذَا هُوَ مُسَجًّى، وَجَاءَ كَعْبٌ فَقَالَ‏:‏ وَاللَّهِ لَئِنْ دَعَا أَمِيرُ الْمُؤْمِنِينَ لَيُبْقِيَنَّهُ اللَّهُ وَلَيَرْفَعَنَّهُ لِهَذِهِ الأُمَّةِ حَتَّى يَفْعَلَ فِيهَا كَذَا وَكَذَا، حَتَّى ذَكَرَ الْمُنَافِقِينَ فَسَمَّى وَكَنَّى، قُلْتُ‏:‏ أُبَلِّغُهُ مَا تَقُولُ‏؟‏ قَالَ‏:‏ مَا قُلْتُ إِلاَّ وَأَنَا أُرِيدُ أَنْ تُبَلِّغَهُ، فَتَشَجَّعْتُ فَقُمْتُ، فَتَخَطَّيْتُ رِقَابَهُمْ حَتَّى جَلَسْتُ عِنْدَ رَأْسِهِ، قُلْتُ‏:‏ إِنَّكَ أَرْسَلَتْنِي بِكَذَا، وَأَصَابَ مَعَكَ كَذَا، ثَلاَثَةَ عَشَرَ، وَأَصَابَ كُلَيْبًا الْجَزَّارَ وَهُوَ يَتَوَضَّأُ عِنْدَ الْمِهْرَاسِ، وَإنّ َ كَعْبًا يَحْلِفُ بِاللَّهِ بِكَذَا، فَقَالَ‏:‏ ادْعُوا كَعْبًا، فَدُعِيَ، فَقَالَ‏:‏ مَا تَقُولُ‏؟‏ قَالَ‏:‏ أَقُولُ كَذَا وَكَذَا، قَالَ‏:‏ لاَ وَاللَّهِ لاَ أَدْعُو، وَلَكِنْ شَقِيٌّ عُمَرُ إِنْ لَمْ يَغْفِرِ اللَّهُ لَهُ‏.‏","english":{"narrator":"","text":"Ibn 'Abbas said, \"When 'Umar, may Allah be pleased with him, was\nattacked, I was one of those who carried him into his house. He said to\nme, 'Nephew, go see who wounded me and who was wounded with me.' I went\nand returned to tell him, but the room was full at that time. I did not\nwant to step over people's necks because I was young, and so I sat down.\n'Umar's rule when he sent someone for a need was that he commanded him\nnot to tell about it. 'Umar had a cover over him. Ka'b came and said, 'By\nAllah, if the Amir al-Mu'minin makes supplication, Allah will let him remain\nalive and restore him to this community until he does such-and-such and\nsuch-and-such for them' until Ka'b mentioned the hypocrites. He actually\nnamed them and used their kunyas. I said, 'Shall I convey to him what you\nhave said?' Ka'b said, 'I only said it because I intended that it be done.'\nI plucked up courage and stood up, I stepped over people's necks until\nI sat by 'Umar's head. I said, 'You sent me to find out such-and-such.\nThirteen people were wounded with you. Kulayb ibn al-Jazzar was wounded\nwhile he was doing wudu' from the cistern. Ka'b swore such-and-such by\nAllah.' He said, 'Summon Ka'b.' He was summoned and 'Umar asked, 'What\ndid you say?' He replied, 'I said such-and-such.' He said, 'No, by Prophet,\nI will not make supplication. 'Umar will be wretched if Allah does not\nforgive him.'\""}},{"id":9,"idInBook":9,"chapterId":46,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، قَالَ‏:‏ أَخْبَرَنَا عَبْدَةُ، عَنِ ابْنِ أَبِي خَالِدٍ، عَنِ الشَّعْبِيِّ قَالَ‏:‏ جَاءَ رَجُلٌ إِلَى عَبْدِ اللهِ بْنِ عَمْرٍو، وَعِنْدَهُ الْقَوْمُ جُلُوسٌ، يَتَخَطَّى إِلَيْهِ، فَمَنَعُوهُ، فَقَالَ‏:‏ اتْرُكُوا الرَّجُلَ، فَجَاءَ حَتَّى جَلَسَ إِلَيْهِ، فَقَالَ‏:‏ أَخْبِرْنِي بِشَيْءٍ سَمِعْتَهُ مِنْ رَسُولِ اللهِ صلى الله عليه وسلم، قَالَ‏:‏ سَمِعْتُ رَسُولَ اللهِ صلى الله عليه وسلم يَقُولُ‏:‏ الْمُسْلِمُ مِنْ سَلِمَ الْمُسْلِمُونَ مِنْ لِسَانِهِ وَيَدِهِ، وَالْمُهَاجِرُ مَنْ هَجَرَ مَا نَهَى اللَّهُ عَنْهُ‏.‏","english":{"narrator":"","text":"Ash-Sha'bi said, \"A man came to 'Abdullah ibn 'Amr when there\nwere some people sitting with him. He stepped over them in order to reach\nhim. They stopped him and 'Abdullah said, 'Leave the man.' He approached\nuntil he sat with him and then said, 'Tell me something which you heard\nfrom the Messenger of Allah, may Allah bless him and grant him peace.'\n'Abdullah said, 'I heard the Messenger of Allah, may Allah bless him and\ngrant him peace, say, \"A Muslim is the one from whose tongue and hand the\nMuslims are safe. An emigrant (muhajir) is someone who abandons what Allah\nhas forbidden.\"'\""}},{"id":10,"idInBook":10,"chapterId":46,"bookId":15,"arabic":"حَدَّثَنَا أَبُو عَاصِمٍ، قَالَ‏:‏ حَدَّثَنَا السَّائِبُ بْنُ عُمَرَ قَالَ‏:‏ حَدَّثَنِي عِيسَى بْنُ مُوسَى، عَنْ مُحَمَّدِ بْنِ عَبَّادِ بْنِ جَعْفَرٍ قَالَ‏:‏ قَالَ ابْنُ عَبَّاسٍ‏:‏ أَكْرَمُ النَّاسِ عَلَيَّ جَلِيسِي‏.‏","english":{"narrator":"","text":"Ibn 'Abbas said, \"The most precious of people in my opinion is\nmy sitting companion.\""}},{"id":11,"idInBook":11,"chapterId":46,"bookId":15,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، عَنْ عَبْدِ اللهِ بْنِ مُؤَمَّلٍ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنِ ابْنِ عَبَّاسٍ قَالَ‏:‏ أَكْرَمُ النَّاسِ عَلَيَّ جَلِيسِي، أَنْ يَتَخَطَّى رِقَابَ النَّاسِ حَتَّى يَجْلِسَ إِلَيَّ‏.‏","english":{"narrator":"","text":"Ibn 'Abbas said, \"The most precious of people in my opinion is\nmy sitting companion. This is so much the case that he can step over the\nshoulders of people until he sits with me.\""}},{"id":12,"idInBook":12,"chapterId":46,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْعَزِيزِ، قَالَ‏:‏ حَدَّثَنَا أَسَدُ بْنُ مُوسَى، قَالَ‏:‏ حَدَّثَنَا مُعَاوِيَةُ بْنُ صَالِحٍ قَالَ‏:‏ حَدَّثَنِي أَبُو الزَّاهِرِيَّةِ قَالَ‏:‏ حَدَّثَنِي كَثِيرُ بْنُ مُرَّةَ قَالَ‏:‏ دَخَلْتُ الْمَسْجِدَ يَوْمَ الْجُمُعَةِ، فَوَجَدْتُ عَوْفَ بْنَ مَالِكٍ الأَشْجَعِيَّ جَالِسًا فِي حَلْقَةٍ مَادًّا رِجْلَيْهِ بَيْنَ يَدَيْهِ، فَلَمَّا رَآنِي قَبَضَ رِجْلَيْهِ، ثُمَّ قَالَ لِي‏:‏ تَدْرِي لأَيِّ شَيْءٍ مَدَدْتُ رِجْلَيَّ‏؟‏ لَيَجِيءَ رَجُلٌ صَالِحٌ فَيَجْلِسَ‏.‏","english":{"narrator":"","text":"Kathir ibn Murra related, \"I entered the mosque on Friday and\nfound 'Awf ibn Malik al-Ashja'i sitting in a circle of men. He stretched\nout his feet in front of him. When he saw me, he pulled his feet back in.\nThen he said to me, 'Do you know why I put my foot out? So that a righteous\nman might come and sit down.'\""}},{"id":13,"idInBook":13,"chapterId":46,"bookId":15,"arabic":"حَدَّثَنَا أَبُو مَعْمَرٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْوَارِثِ، قَالَ‏:‏ حَدَّثَنَا عُتْبَةُ بْنُ عَبْدِ الْمَلِكِ قَالَ‏:‏ حَدَّثَنِي زُرَارَةُ بْنُ كَرِيمِ بْنِ الْحَارِثِ بْنِ عَمْرٍو السَّهْمِيُّ، أَنَّ الْحَارِثَ بْنَ عَمْرٍو السَّهْمِيَّ حَدَّثَهُ قَالَ‏:‏ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم وَهُوَ بِمِنًى، أَوْ بِعَرَفَاتٍ، وَقَدْ أَطَافَ بِهِ النَّاسُ، وَيَجِيءُ الأَعْرَابُ، فَإِذَا رَأَوْا وَجْهَهُ قَالُوا‏:‏ هَذَا وَجْهٌ مُبَارَكٌ، قُلْتُ‏:‏ يَا رَسُولَ اللهِ، اسْتَغْفِرْ لِي، فَقَالَ‏:‏ اللَّهُمَّ اغْفِرْ لَنَا، فَدُرْتُ فَقُلْتُ‏:‏ اسْتَغْفِرْ لِي، قَالَ‏:‏ اللَّهُمَّ اغْفِرْ لَنَا، فَدُرْتُ فَقُلْتُ‏:‏ اسْتَغْفِرْ لِي، فَقَالَ‏:‏ اللَّهُمَّ اغْفِرْ لَنَا، فَذَهَبَ يَبْزُقُ، فَقَالَ بِيَدِهِ فَأَخَذَ بِهَا بُزَاقَهُ، وَمَسَحَ بِهِ نَعْلَهُ، كَرِهَ أَنْ يُصِيبَ أَحَدًا مِنْ حَوْلِهِ‏.‏","english":{"narrator":"","text":"Al-Harith ibn 'Amr as-Sahmi related, \"I came to the Prophet, may\nAllah bless him and grant him peace, when he was at Mina or at 'Arafa.\nPeople crowded around him and some Bedouins arrived. When they saw his\nface, they said, 'This is a blessed face.' I said, 'Messenger of Allah,\npray for forgiveness for me.' He said, 'O Allah, forgive us!' I said, 'Ask\nforgiveness for me.' He said, 'O Allah, forgive us!' I turned and said,\nAsk forgiveness for me.' He said, 'O Allah, forgive us!' He spat on his\nhand and wiped it on his sandal. He did not want it to get on anyone around\nhim.\""}},{"id":14,"idInBook":14,"chapterId":46,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللهِ، قَالَ‏:‏ حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ، عَنِ الْعَلاَءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنِ الْمَجَالِسِ بِالصُّعُدَاتِ، فَقَالُوا‏:‏ يَا رَسُولَ اللهِ، لَيَشُقُّ عَلَيْنَا الْجُلُوسُ فِي بُيُوتِنَا‏؟‏ قَالَ‏:‏ فَإِنْ جَلَسْتُمْ فَأَعْطُوا الْمَجَالِسَ حَقَّهَا، قَالُوا‏:‏ وَمَا حَقُّهَا يَا رَسُولَ اللهِ‏؟‏ قَالَ‏:‏ إِدْلاَلُ السَّائِلِ، وَرَدُّ السَّلاَمِ، وَغَضُّ الأَبْصَارِ، وَالأَمْرُ بِالْمَعْرُوفِ، وَالنَّهْيُ عَنِ الْمُنْكَرِ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, forbade gatherings in the road. They said, \"Messenger\nof Allah, it is hard for us to sit in our houses.\" He said, \"If you must\nsit there, then fulfil the rights of the gathering.\" They asked, 'What\nis their right, Messenger of Allah?\" He replied, \"Guiding anyone who asks\nfor directions, returning the greeting, lowering the eye, commanding the\ncorrect and forbidding the bad.\""}},{"id":15,"idInBook":15,"chapterId":46,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدِ اللهِ، قَالَ‏:‏ حَدَّثَنَا الدَّرَاوَرْدِيُّ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ رَضِيَ اللَّهُ عَنْهُ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ‏:‏ إِيَّاكُمْ وَالْجُلُوسَ فِي الطُّرُقَاتِ، قَالُوا‏:‏ يَا رَسُولَ اللهِ، مَا لَنَا بُدٌّ مِنْ مَجَالِسِنَا نَتَحَدَّثُ فِيهَا، فَقَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ أَمَّا إِذْ أَبَيْتُمْ، فَأَعْطُوا الطَّرِيقَ حَقَّهُ، قَالُوا‏:‏ وَمَا حَقُّ الطَّرِيقِ يَا رَسُولَ اللهِ‏؟‏ قَالَ‏:‏ غَضُّ الْبَصَرِ، وَكَفُّ الأَذَى، وَالأَمْرُ بِالْمَعْرُوفِ، وَالنَّهْيُ عَنِ الْمُنْكَرِ‏.‏","english":{"narrator":"","text":"Abu Sa'id al-Khudri reported that the Prophet, may Allah bless\nhim and grant him peace, said, \"Beware of sitting in the road.\" They said,\n\"Messenger of Allah, we must meet where we can sit to talk.\" The Messenger\nof Allah, may Allah bless him and grant him peace, said, \"If you must do\nit, then give the road its due. \"What is the due of the road, Messenger\nof Allah,\" they asked. He replied, \"Lowering the eye, avoiding doing anything\nharmful, commanding the correct and forbidding the bad.\""}},{"id":16,"idInBook":16,"chapterId":46,"bookId":15,"arabic":"حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، عَنْ شَرِيكِ بْنِ عَبْدِ اللهِ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، عَنْ أَبِي مُوسَى الأَشْعَرِيِّ قَالَ‏:‏ خَرَجَ النَّبِيُّ صلى الله عليه وسلم يَوْمًا إِلَى حَائِطٍ مِنْ حَوَائِطِ الْمَدِينَةِ لِحَاجَتِهِ، وَخَرَجْتُ فِي أَثَرِهِ، فَلَمَّا دَخَلَ الْحَائِطَ جَلَسْتُ عَلَى بَابِهِ، وَقُلْتُ‏:‏ لَأَكُونَنَّ الْيَوْمَ بَوَّابَ النَّبِيِّ صلى الله عليه وسلم، وَلَمْ يَأْمُرْنِي، فَذَهَبَ النَّبِيُّ صلى الله عليه وسلم فَقَضَى حَاجَتَهُ وَجَلَسَ عَلَى قُفِّ الْبِئْرِ، وَكَشَفَ عَنْ سَاقَيْهِ، وَدَلاَّهُمَا فِي الْبِئْرِ، فَجَاءَ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ لِيَسْتَأْذِنَ عَلَيْهِ لِيَدْخُلَ، فَقُلْتُ‏:‏ كَمَا أَنْتَ حَتَّى أَسْتَأْذِنَ لَكَ، فَوَقَفَ، وَجِئْتُ النَّبِيَّ صلى الله عليه وسلم فَقُلْتُ‏:‏ يَا رَسُولَ اللهِ، أَبُو بَكْرٍ يَسْتَأْذِنُ عَلَيْكَ‏؟‏ فَقَالَ‏:‏ ائْذَنْ لَهُ، وَبَشِّرْهُ بِالْجَنَّةِ، فَدَخَلَ فَجَاءَ عَنْ يَمِينِ النَّبِيِّ صلى الله عليه وسلم، فَكَشَفَ عَنْ سَاقَيْهِ وَدَلاَّهُمَا فِي الْبِئْرِ‏.‏ فَجَاءَ عُمَرُ، فَقُلْتُ‏:‏ كَمَا أَنْتَ حَتَّى أَسْتَأْذِنَ لَكَ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ ائْذَنْ لَهُ، وَبَشِّرْهُ بِالْجَنَّةِ، فَجَاءَ عُمَرُ عَنْ يَسَارِ النَّبِيِّ صلى الله عليه وسلم فَكَشَفَ عَنْ سَاقَيْهِ وَدَلاَّهُمَا فِي الْبِئْرِ فَامْتَلَأَ الْقُفُّ، فَلَمْ يَكُنْ فِيهِ مَجْلِسٌ‏.‏ ثُمَّ جَاءَ عُثْمَانُ، فَقُلْتُ‏:‏ كَمَا أَنْتَ حَتَّى أَسْتَأْذِنَ لَكَ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ ائْذَنْ لَهُ، وَبَشِّرْهُ بِالْجَنَّةِ مَعَهَا بَلاَءٌ يُصِيبُهُ، فَدَخَلَ فَلَمْ يَجِدْ مَعَهُمْ مَجْلِسًا، فَتَحَوَّلَ حَتَّى جَاءَ مُقَابِلَهُمْ عَلَى شَفَةِ الْبِئْرِ، فَكَشَفَ عَنْ سَاقَيْهِ ثُمَّ دَلاَّهُمَا فِي الْبِئْرِ، فَجَعَلْتُ أَتَمَنَّى أَنْ يَأْتِيَ أَخٌ لِي، وَأَدْعُو اللَّهَ أَنْ يَأْتِيَ بِهِ، فَلَمْ يَأْتِ حَتَّى قَامُوا‏.‏","english":{"narrator":"","text":"Abu Musa al-Ash'ari said, \"The Messenger of Allah, may Allah bless\nhim and grant him peace, went out one day to one of the walled gardens\nof Madina, and I went out after him. When he entered the garden, I sat\nat the gate and said, I will be the doorkeeper of the Messenger of Allah\ntoday even if he has not commanded me to do it.' The Prophet went and answered\na call of nature and then sat on the edge of the well. He uncovered his\nlegs and dangled them in the well. Abu Bakr came and asked for permission\nto enter.' I said, 'Stay where you are until I ask permission for you.'\nHe waited and I went to the Prophet, may Allah bless him and grant him\npeace, and said, 'Messenger of Allah, it is Abu Bakr asking permission\nto come in.' He said, 'Let him in and give him the good news of the Garden.'\nHe entered and sat at the right side of the Prophet, may Allah bless him\nand grant him peace. uncovered his legs and dangled them in the water.\nThen 'Umar came. I said, 'Stay where you are until I ask permission for\nyou.' The Prophet, may Allah bless him and grant him peace, said, 'Let\nhim in and give him the good news of the Garden.' 'Umar went in and sat\nat the left side of the Prophet, may Allah bless him and grant him peace,\nuncovered his legs and dangled his feet in the well. The rim of the well\nwas then full and there was no place left to sit. Then 'Uthman came. I\nsaid, 'Stay where you are until I ask permission for you.' The Prophet,\nmay Allah bless him and grant him peace, said, 'Let him in and give him\nthe good news of the Garden as well as an affliction which will befall\nhim.' 'Uthman came in and could not find a place with them. He moved around\nuntil he was facing them on the other side of the well, uncovered his legs\nand dangled them in the well. I began to wish that a brother of mine would\ncome and I asked Allah to make him come, but he did not come before they\nhad got up.\""}},{"id":17,"idInBook":17,"chapterId":46,"bookId":15,"arabic":"حَدَّثَنَا عَلِيُّ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنْ عُبَيْدِ اللهِ بْنِ أَبِي يَزِيدَ، عَنْ نَافِعِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ، عَنْ أَبِي هُرَيْرَةَ، خَرَجَ النَّبِيُّ صلى الله عليه وسلم فِي طَائِفَةِ النَّهَارِ لاَ يُكَلِّمُنِي وَلاَ أُكَلِّمُهُ، حَتَّى أَتَى سُوقَ بَنِي قَيْنُقَاعٍ، فَجَلَسَ بِفِنَاءِ بَيْتِ فَاطِمَةَ، فَقَالَ‏:‏ أَثَمَّ لُكَعٌ‏؟‏ أَثَمَّ لُكَعٌ‏؟‏ فَحَبَستْهُ شَيْئًا، فَظَنَنْتُ أَنَّهَا تُلْبِسُهُ سِخَابًا أَوْ تُغَسِّلُهُ، فَجَاءَ يَشْتَدُّ حَتَّى عَانَقَهُ وَقَبَّلَهُ، وَقَالَ‏:‏ اللَّهُمَّ أَحْبِبْهُ، وَأَحْبِبْ مَنْ يُحِبُّهُ‏.‏","english":{"narrator":"","text":"Abu Hurayra said, \"The Prophet, may Allah bless him and grant\nhim peace, went out in the heat of the day. He did not speak to me nor\ndid I speak to him until he came to the market of Qaynuqa'. He sat in the\ncourtyard of Fatima's house and asked, 'Is the little one here? Is the\nlittle one here?' Fatima held her son back for a short time. I think that\nshe was putting a necklace on him or washing him. Then he came running\nand he hugged him and kissed him. He said, 'O Allah, love him and love\nthose who love him.'\""}}],"chapter":{"id":46,"bookId":15,"arabic":"كتاب الْمَجَالِسِ","english":"Gatherings"}}