{"metadata":{"length":22,"arabic":{"title":"الأدب المفرد","author":"الإمام محمد بن إسماعيل البخاري","introduction":"كتاب تعامل الناس"},"english":{"title":"Al-Adab Al-Mufrad","author":"Imam Muhammad ibn Ismail al-Bukhari","introduction":"Behaviour with people"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":47,"bookId":15,"arabic":"حَدَّثَنَا قَبِيصَةُ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنْ عُبَيْدِ اللهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ قَالَ‏:‏ نَهَى النَّبِيُّ صلى الله عليه وسلم أَنْ يُقِيمَ الرَّجُلَ مِنَ الْمَجْلِسِ ثُمَّ يَجْلِسُ فِيهِ‏.‏","english":{"narrator":"","text":"Ibn 'Umar said, \"The Prophet, may Allah bless him and grant him\npeace, forbade anyone forcing a man to rise from his seat so that someone\nelse could sit in his place.\""}},{"id":2,"idInBook":2,"chapterId":47,"bookId":15,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ‏:‏ حَدَّثَنَا سُلَيْمَانُ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ‏:‏ خَدَمْتُ رَسُولَ اللهِ صلى الله عليه وسلم يَوْمًا، حَتَّى إِذَا رَأَيْتُ أَنِّي قَدْ فَرَغْتُ مِنْ خِدْمَتِهِ قُلْتُ‏:‏ يَقِيلُ النَّبِيُّ صلى الله عليه وسلم، فَخَرَجْتُ مِنْ عِنْدِهِ، فَإِذَا غِلْمَةٌ يَلْعَبُونَ، فَقُمْتُ أَنْظُرُ إِلَيْهِمْ إِلَى لَعِبِهِمْ، فَجَاءَ النَّبِيُّ صلى الله عليه وسلم فَانْتَهَى إِلَيْهِمْ فَسَلَّمَ عَلَيْهِمْ، ثُمَّ دَعَانِي فَبَعَثَنِي إِلَى حَاجَةٍ، فَكَانَ فِي فَيْءٍ حَتَّى أَتَيْتُهُ‏.‏ وَأَبْطَأْتُ عَلَى أُمِّي، فَقَالَتْ‏:‏ مَا حَبَسَكَ‏؟‏ قُلْتُ‏:‏ بَعَثَنِي النَّبِيُّ صلى الله عليه وسلم إِلَى حَاجَةٍ، قَالَتْ‏:‏ مَا هِيَ‏؟‏ قُلْتُ‏:‏ إِنَّهُ سِرٌّ لِلنَّبِيِّ صلى الله عليه وسلم، فَقَالَتِ‏:‏ احْفَظْ عَلَى رَسُولِ اللهِ صلى الله عليه وسلم سِرَّهُ، فَمَا حَدَّثْتُ بِتِلْكَ الْحَاجَةِ أَحَدًا مِنَ الْخَلْقِ، فَلَوْ كُنْتُ مُحَدِّثًا حَدَّثْتُكَ بِهَا‏.‏","english":{"narrator":"","text":"Anas said, \"I was serving the Messenger of Allah, may Allah bless\nhim and grant him peace, one day. When I thought I had finished serving\nhim, I said, 'The Prophet, may Allah bless him and grant him peace, is\nhaving a midday nap.' So I left him and there were some children playing.\nI stood looking at them and their game. The Prophet, may Allah bless him\nand grant him peace, came out, and came up to them and greeted them. Then\nhe called me and sent me to get something he needed. He remained in the\nshade until I came back to him. I was late for my mother and she and he\nasked, 'What kept you?' I replied, The Prophet, may Allah bless him and\ngrant him peace, sent me for something he needed.' 'What was it?' she asked.\nI replied, 'It is a secret of the Prophet, may Allah bless him and grant\nhim peace.' She said, Keep the secret of the Messenger of Allah, may Allah\nbless him and grant him peace.' I did not tell anyone that secret. If I\nhad told it, I would have told it to her.'\""}},{"id":3,"idInBook":3,"chapterId":47,"bookId":15,"arabic":"حَدَّثَنَا إِسْحَاقُ بْنُ الْعَلاَءِ قَالَ‏:‏ حَدَّثَنِي عَمْرُو بْنُ الْحَارِثِ قَالَ‏:‏ حَدَّثَنِي عَبْدُ اللهِ بْنُ سَالِمٍ، عَنِ الزُّبَيْدِيِّ قَالَ‏:‏ أَخْبَرَنِي مُحَمَّدُ بْنُ مُسْلِمٍ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَصِفُ رَسُولَ اللهِ صلى الله عليه وسلم‏:‏ كَانَ رَبْعَةً، وَهُوَ إِلَى الطُّوَلِ أَقْرَبُ، شَدِيدُ الْبَيَاضِ، أَسْوَدُ شَعْرِ اللِّحْيَةِ، حَسَنُ الثَّغْرِ، أَهْدَبُ أَشْفَارِ الْعَيْنَيْنِ، بَعِيدُ مَا بَيْنَ الْمَنْكِبَيْنِ، مُفَاضُ الْجَبِينِ، يَطَأُ بِقَدَمِهِ جَمِيعًا، لَيْسَ لَهَا أَخْمُصُ، يُقْبِلُ جَمِيعًا، وَيُدْبِرُ جَمِيعًا، لَمْ أَرَ مِثْلَهُ قَبْلُ وَلا بَعْدُ‏.‏","english":{"narrator":"","text":"Abu Hurayra described the Messenger of Allah, may Allah bless\nhim and grant him peace, with the words, \"He was of medium height, but\nnearer to being tall. He was very white with a black beard and good front\nteeth. He had long eye-lashes. He was very broad between the shoulders\nand had full cheeks. He walked on his entire foot, but they did not have\na hollow. He turned completely towards people or turned his back completely.\nI have not seen anyone like him before or since.'\""}},{"id":4,"idInBook":4,"chapterId":47,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدٌ، قَالَ‏:‏ أَخْبَرَنَا عَبْدُ اللهِ بْنُ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَبِيهِ، عَنْ جَدِّهِ قَالَ‏:‏ قَالَ لِي عُمَرُ‏:‏ إِذَا أَرْسَلْتُكَ إِلَى رَجُلٍ، فَلاَ تُخْبِرْهُ بِمَا أَرْسَلْتُكَ إِلَيْهِ، فَإِنَّ الشَّيْطَانَ يُعِدُّ لَهُ كِذْبَةً عِنْدَ ذَلِكَ‏.‏","english":{"narrator":"","text":"Aslam said, \"'Umar said to me, 'If I send you to a man, do not\ntell him why I sent you to him. If you do, Shaytan will prepare a lie for\nhim in that.'\""}},{"id":5,"idInBook":5,"chapterId":47,"bookId":15,"arabic":"حَدَّثَنَا حَامِدُ بْنُ عُمَرَ، عَنْ حَمَّادِ بْنِ زَيْدٍ، عَنْ لَيْثٍ، عَنْ مُجَاهِدٍ قَالَ‏:‏ كَانَ يَكْرَهُ أَنْ يُحِدَّ الرَّجُلُ النَّظَرَ إِلَى أَخِيهِ، أَوْ يُتْبِعَهُ بَصَرَهُ إِذَا قَامَ مِنْ عِنْدِهِ، أَوْ يَسْأَلَهُ‏:‏ مِنْ أَيْنَ جِئْتَ، وَأَيْنَ تَذْهَبُ‏؟‏‏.‏","english":{"narrator":"","text":"Mujahid said, \"It is disliked for a man to look sharply at his\nbrother or to follow him with his glance when he leaves or to ask him,\n'Where have you come from and where are you going?'\""}},{"id":6,"idInBook":6,"chapterId":47,"bookId":15,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ‏:‏ حَدَّثَنَا زُهَيْرٌ، عَنْ أَبِي إِسْحَاقَ، عَنْ مَالِكِ بْنِ زُبَيْدٍ قَالَ‏:‏ مَرَرْنَا عَلَى أَبِي ذَرٍّ بِالرَّبَذَةِ، فَقَالَ‏:‏ مِنْ أَيْنَ أَقْبَلْتُمْ‏؟‏ قُلْنَا‏:‏ مِنْ مَكَّةَ، أَوْ مِنَ الْبَيْتِ الْعَتِيقِ، قَالَ‏:‏ هَذَا عَمَلُكُمْ‏؟‏ قُلْنَا‏:‏ نَعَمْ، قَالَ‏:‏ أَمَا مَعَهُ تِجَارَةٌ وَلاَ بَيْعٌ‏؟‏ قُلْنَا‏:‏ لاَ، قَالَ‏:‏ اسْتَأْنِفُوا الْعَمَلَ‏.‏","english":{"narrator":"","text":"Malik ibn Zubayd said, \"We passed by Abu Dharr at ar-Rabadha.\nHe said, 'Where have you come from?' We said, 'Makka - or from the\nAncient House.' He said, 'Is this what you have done?' We said, 'Yes.'\nHe said, 'And was there commerce or selling with it?' 'No,' he replied.\nHe said, 'Then resume your actions anew.'\""}},{"id":7,"idInBook":7,"chapterId":47,"bookId":15,"arabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ‏:‏ حَدَّثَنَا إِسْمَاعِيلُ، قَالَ‏:‏ حَدَّثَنَا أَيُّوبُ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ مَنْ صَوَّرَ صُورَةً كُلِّفَ أَنْ يَنْفُخَ فِيهِ وَعُذِّبَ، وَلَنْ يَنْفُخَ فِيهِ‏.‏ وَمَنْ تَحَلَّمَ كُلِّفَ أَنْ يَعْقِدَ بَيْنَ شَعِيرَتَيْنِ وَعُذِّبَ، وَلَنْ يَعْقِدَ بَيْنَهُمَا، وَمَنِ اسْتَمَعَ إِلَى حَدِيثِ قَوْمٍ يَفِرُّونَ مِنْهُ، صُبَّ فِي أُذُنَيْهِ الآنُكُ‏.‏","english":{"narrator":"","text":"Ibn 'Abbas reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"Whoever fashions an image will have to breathe\nlife into it and he will be punished since he will not be able to breathe\nlife into it. Anyone who claims to have seen a vision in a dream will have\nto string two beads of barely together and he will be punished because\nhe will not be able to string them together. Anyone who listens to people's\nconversation when they move away from him will have molten lead poured\ninto his ears.\""}},{"id":8,"idInBook":8,"chapterId":47,"bookId":15,"arabic":"حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، قَالَ‏:‏ حَدَّثَنَا الأَسْوَدُ بْنُ شَيْبَانَ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ اللهِ بْنُ مُضَارِبٍ، عَنِ الْعُرْيَانِ بْنِ الْهَيْثَمِ قَالَ‏:‏ وَفَدَ أَبِي إِلَى مُعَاوِيَةَ، وَأَنَا غُلاَمٌ، فَلَمَّا دَخَلَ عَلَيْهِ قَالَ‏:‏ مَرْحَبًا مَرْحَبًا، وَرَجُلٌ قَاعِدٌ مَعَهُ عَلَى السَّرِيرِ، قَالَ‏:‏ يَا أَمِيرَ الْمُؤْمِنِينَ، مَنْ هَذَا الَّذِي تُرَحِّبُ بِهِ‏؟‏ قَالَ‏:‏ هَذَا سَيِّدُ أَهْلِ الْمَشْرِقِ، وَهَذَا الْهَيْثَمُ بْنُ الأَسْوَدِ، قُلْتُ‏:‏ مَنْ هَذَا‏؟‏ قَالُوا‏:‏ هَذَا عَبْدُ اللهِ بْنُ عَمْرِو بْنِ الْعَاصِ، قُلْتُ لَهُ‏:‏ يَا أَبَا فُلاَنٍ، مِنْ أَيْنَ يَخْرُجُ الدَّجَّالُ‏؟‏ قَالَ‏:‏ مَا رَأَيْتُ أَهْلَ بَلَدٍ أَسْأَلَ عَنْ بَعِيدٍ، وَلاَ أَتْرَكَ لِلْقَرِيبِ مِنْ أَهْلِ بَلَدٍ أَنْتَ مِنْهُ، ثُمَّ قَالَ‏:‏ يَخْرُجُ مِنْ أَرْضِ الْعِرَاقِ، ذَاتِ شَجَرٍ وَنَخْلٍ‏.‏","english":{"narrator":"","text":"Al-'Iryan ibn al-Haytham said, \"My father came to Mu'awiya when\nI was a body. When he reached him, he said, 'Welcome, welcome.' A man was\nsitting with him on the elevated seat. He said, 'Amir al-Mu'minin, who\nis this you are welcoming?' He said, 'This is the master of the people\nof the east. This is al-Haytham ibn al-Aswad.' I asked, 'Who is this?'\nThey replied, 'This is 'Abdullah ibn 'Amr ibn al-'As.' I said to him, 'Abu\nso-and-so. From where will the Dajjal emerge?' He said, 'I have not seen\nthe people of a town who asked about what is far nor left what is near.\nYou are from the people of a town.' Then he said, 'He will emerge from\nthe land of Iraq with the trees and palm trees.'\""}},{"id":9,"idInBook":9,"chapterId":47,"bookId":15,"arabic":"حَدَّثَنَا يَحْيَى، قَالَ‏:‏ حَدَّثَنَا وَكِيعٌ، قَالَ‏:‏ حَدَّثَنَا خَالِدُ بْنُ دِينَارٍ، عَنْ أَبِي الْعَالِيَةِ قَالَ‏:‏ جَلَسْتُ مَعَ ابْنِ عَبَّاسٍ عَلَى سَرِيرٍ‏.‏- حَدَّثَنَا عَلِيُّ بْنُ الْجَعْدِ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي جَمْرَةَ قَالَ‏:‏ كُنْتُ أَقْعُدُ مَعَ ابْنِ عَبَّاسٍ، فَكَانَ يُقْعِدُنِي عَلَى سَرِيرِهِ، فَقَالَ لِي‏:‏ أَقِمْ عِنْدِي حَتَّى أَجْعَلَ لَكَ سَهْمًا مِنْ مَالِي، فَأَقَمْتُ عِنْدَهُ شَهْرَيْنِ","english":{"narrator":"","text":"Abu al-Aaliyah said that he sat on the chair of state with Ibn Abbas (ra). \n\nIn another version, Abu Jamrah stated, \"I used to sit with Ibn Abbas (ra) and he made me sit on his chair of state. Once, he asked me to stay behind with him so that he may aportion a share for me in his property. \nSo, I stayed with him for two months\"."}},{"id":10,"idInBook":10,"chapterId":47,"bookId":15,"arabic":"حَدَّثَنَا عُبَيْدٌ، قَالَ‏:‏ حَدَّثَنَا يُونُسُ بْنُ بُكَيْرٍ، قَالَ‏:‏ حَدَّثَنَا خَالِدُ بْنُ دِينَارٍ أَبُو خَلْدَةَ قَالَ‏:‏ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، وَهُوَ مَعَ الْحَكَمِ أَمِيرٌ بِالْبَصْرَةِ عَلَى السَّرِيرِ، يَقُولُ‏:‏ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا كَانَ الْحَرُّ أَبْرَدَ بِالصَّلاَةِ، وَإِذَا كَانَ الْبَرْدُ بَكَّرَ بِالصَّلاةِ‏.‏","english":{"narrator":"","text":"Abu Khulda reported that he heard Anas ibn Malik when he was with\nal-Hakam, the amir of Basra, on a seat. He said, \"When the Prophet, may\nAllah bless him and grant him peace, was hot, he delayed the prayer until\na cooler time of the day. When it was cold, he made the prayer early.\""}},{"id":11,"idInBook":11,"chapterId":47,"bookId":15,"arabic":"حَدَّثَنَا عَمْرُو بْنُ مَنْصُورٍ، قَالَ‏:‏ حَدَّثَنَا مُبَارَكٌ، قَالَ‏:‏ حَدَّثَنَا الْحَسَنُ، قَالَ‏:‏ حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ قَالَ‏:‏ دَخَلْتُ عَلَى النَّبِيِّ صلى الله عليه وسلم وَهُوَ عَلَى سَرِيرٍ مَرْمُولٍ بِشَرِيطٍ، تَحْتَ رَأْسِهِ وِسَادَةٌ مِنْ أَدَمٍ حَشْوُهَا لِيفٌ، مَا بَيْنَ جِلْدِهِ وَبَيْنَ السَّرِيرِ ثَوْبٌ، فَدَخَلَ عَلَيْهِ عُمَرُ فَبَكَى، فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم‏:‏ مَا يُبْكِيكَ يَا عُمَرُ‏؟‏ قَالَ‏:‏ أَمَا وَاللَّهِ مَا أَبْكِي يَا رَسُولَ اللهِ، أَلاَّ أَكُونَ أَعْلَمُ أَنَّكَ أَكْرَمُ عَلَى اللهِ مِنْ كِسْرَى وَقَيْصَرَ، فَهُمَا يَعِيثَانِ فِيمَا يَعِيثَانِ فِيهِ مِنَ الدُّنْيَا، وَأَنْتَ يَا رَسُولَ اللهِ بِالْمَكَانِ الَّذِي أَرَى، فَقَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ أَمَا تَرْضَى يَا عُمَرُ أَنْ تَكُونَ لَهُمُ الدُّنْيَا وَلَنَا الْآخِرَةُ‏؟‏ قُلْتُ‏:‏ بَلَى يَا رَسُولَ اللهِ، قَالَ‏:‏ فَإِنَّهُ كَذَلِكَ‏.‏","english":{"narrator":"","text":"Anas ibn Malik said, \"I came to the Prophet, may Allah bless him\nand grant him peace, while he was on a seat with a bad woven on it. He\nhad a pillow under his head made of skin stuffed with fibre. There was\na cloth between his skin and the seat. 'Umar visited him and wept. The\nProphet, may Allah bless him and grant him peace, said, 'What made you\nweep, 'Umar?' He said, 'By Allah, Messenger of Allah, I am only weeping\nsince I know that you are more noble with Allah than Chosroes and Caesar.\nThey both live in what they live of this world while you, Messenger of\nAllah, are in the place I see.' The Prophet, may Allah bless him and grant\nhim peace, said, 'Are you not content, 'Umar, that they have this world\nwhile we have the Next?' I replied, 'Yes, Messenger of Allah.' He said,\n'That is the way of it.'\""}},{"id":12,"idInBook":12,"chapterId":47,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ يَزِيدَ، قَالَ‏:‏ حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ، عَنْ حُمَيْدِ بْنِ هِلاَلٍ، عَنْ أَبِي رِفَاعَةَ الْعَدَوِيِّ قَالَ‏:‏ انْتَهَيْتُ إِلَى النَّبِيِّ صلى الله عليه وسلم وَهُوَ يَخْطُبُ، فَقُلْتُ‏:‏ يَا رَسُولَ اللهِ، رَجُلٌ غَرِيبٌ جَاءَ يَسْأَلُ عَنْ دِينِهِ، لاَ يَدْرِي مَا دِينُهُ، فَأَقْبَلَ إِلَيَّ وَتَرَكَ خُطْبَتَهُ، فَأَتَى بِكُرْسِيٍّ خِلْتُ قَوَائِمَهُ حَدِيدًا، قَالَ حُمَيْدٌ‏:‏ أُرَاهُ خَشَبًا أَسْوَدَ حَسَبُهُ حَدِيدًا، فَقَعَدَ عَلَيْهِ، فَجَعَلَ يُعَلِّمُنِي مِمَّا عَلَّمَهُ اللَّهُ، ثُمَّ أَتَمَّ خُطْبَتَهُ، آخِرَهَا‏.‏","english":{"narrator":"","text":"Abu Rifa'a al-'Adawi said, \"I came to the Messenger of Allah,\nmay Allah bless him and grant him peace, while he was speaking [i.e. on\nJumu'a]. I said, 'Messenger, a stranger man has come to ask about his deen.\nHe does not know what his deen is.' He turned to me and stopped speaking.\nHe was brought a chair which I think had iron legs. (Hamid [one of the\ntransmitters] said, 'I think that it was black wood like iron).'] He sat\ndown on it and began to teach me what Allah had taught him. Then he finished\nhis speech.\""}},{"id":13,"idInBook":13,"chapterId":47,"bookId":15,"arabic":"حَدَّثَنَا يَحْيَى، قَالَ‏:‏ حَدَّثَنَا وَكِيعٌ، عَنْ مُوسَى بْنِ دِهْقَانَ قَالَ‏:‏ رَأَيْتُ ابْنَ عُمَرَ جَالِسًا عَلَى سَرِيرِ عَرُوسٍ، عَلَيْهِ ثِيَابٌ حُمْرُ‏.‏\nوَعَنْ أَبِيهِ، عَنْ عِمْرَانَ بْنِ مُسْلِمٍ قَالَ‏:‏ رَأَيْتُ أَنَسًا جَالِسًا عَلَى سَرِيرٍ وَاضِعًا إِحْدَى رِجْلَيْهِ عَلَى الأخْرَى‏.‏","english":{"narrator":"","text":"Musa ibn Dihqan said, \"I saw Ibn 'Umar sitting on a bridal seat\nwearing a red garment.\"\n\n'Imran ibn Muslim said, \"I saw Anas sitting on a bed, placing one foot over another.\""}},{"id":14,"idInBook":14,"chapterId":47,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدٌ، قَالَ‏:‏ أَخْبَرَنَا عَبْدُ اللهِ، قَالَ‏:‏ أَخْبَرَنَا دَاوُدُ بْنُ قَيْسٍ قَالَ‏:‏ سَمِعْتُ سَعِيدًا الْمَقْبُرِيَّ يَقُولُ‏:‏ مَرَرْتُ عَلَى ابْنِ عُمَرَ، وَمَعَهُ رَجُلٌ يَتَحَدَّثُ، فَقُمْتُ إِلَيْهِمَا، فَلَطَمَ فِي صَدْرِي فَقَالَ‏:‏ إِذَا وَجَدْتَ اثْنَيْنِ يَتَحَدَّثَانِ فَلاَ تَقُمُّ مَعَهُمَا، وَلاَ تَجْلِسْ مَعَهُمَا، حَتَّى تَسْتَأْذِنَهُمَا، فَقُلْتُ‏:‏ أَصْلَحَكَ اللَّهُ يَا أَبَا عَبْدِ الرَّحْمَنِ، إِنَّمَا رَجَوْتُ أَنْ أَسْمَعَ مِنْكُمَا خَيْرًا‏.‏","english":{"narrator":"","text":"Sa'id al-Maqburi said, \"I passed by Ibn 'Umar who had a man with\nhim with whom he was conversing. I went to them, and he struck me on the\nchest and said, 'When you find two men conversing, do not go up to them\nnor sit with them until they give you permission.' I said. 'May Allah make\nyou prosper, Abu 'Abdu'r-Rahman. I hoped that I would hear something good\nfrom you.'\""}},{"id":15,"idInBook":15,"chapterId":47,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، قَالَ‏:‏ أَخْبَرَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ، قَالَ‏:‏ حَدَّثَنَا خَالِدٌ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ قَالَ‏:‏ مَنْ تَسَمَّعَ إِلَى حَدِيثِ قَوْمٍ وَهُمْ لَهُ كَارِهُونَ، صُبَّ فِي أُذُنِهِ الْآنُكُ‏.‏ وَمَنْ تَحَلَّمَ بِحُلْمٍ كُلِّفَ أَنْ يَعْقِدَ شَعِيرَةً‏.‏","english":{"narrator":"","text":"Ibn 'Abbas said, \"Whoever listens to people's conversations when\nthey do not want him to do so will have molten lead poured into his ears.\nAnyone who lies about a dram will be obliged to string a barley bead.\""}},{"id":16,"idInBook":16,"chapterId":47,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ قَالَ‏:‏ حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللهِ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم قَالَ‏:‏ إِذَا كَانُوا ثَلاَثَةً، فَلاَ يَتَنَاجَى اثْنَانِ دُونَ الثَّالِثِ‏.‏","english":{"narrator":"","text":"'Abdullah reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"When there are three people, two should\nnot converse together to the exclusion of the third.\""}},{"id":17,"idInBook":17,"chapterId":47,"bookId":15,"arabic":"حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ قَالَ‏:‏ حَدَّثَنِي أَبِي، قَالَ‏:‏ حَدَّثَنَا الأَعْمَشُ قَالَ‏:‏ حَدَّثَنِي شَقِيقٌ، عَنْ عَبْدِ اللهِ قَالَ‏:‏ قَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ إِذَا كُنْتُمْ ثَلاَثَةً فَلاَ يَتَنَاجَى اثْنَانِ دُونَ الثَّالِثِ، فَإِنَّهُ يُحْزِنُهُ ذَلِكَ‏.‏","english":{"narrator":"","text":"'Abdullah reported that the Prophet, may Allah bless him and grant\nhim peace, said, \"When there are three people, two should not converse\ntogether to the exclusion of the third for that would grieve him.\""}},{"id":18,"idInBook":18,"chapterId":47,"bookId":15,"arabic":"وَحَدَّثَنِي أَبُو صَالِحٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم مِثْلَهُ، قُلْنَا‏:‏ فَإِنْ كَانُوا أَرْبَعَةً‏؟‏ قَالَ‏:‏ لا يَضُرُّهُ‏.‏","english":{"narrator":"","text":"Ibn 'Umar reported something similar from the Prophet, may Allah\nbless him and grant him peace. He stated, \"We said, 'If there are four?'\nHe said, 'Then it will not harm him.'\""}},{"id":19,"idInBook":19,"chapterId":47,"bookId":15,"arabic":"حَدَّثَنَا عُثْمَانُ، قَالَ‏:‏ حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ لاَ يَتَنَاجَى اثْنَانِ دُونَ الْآخَرِ حَتَّى يَخْتَلِطُوا بِالنَّاسِ، مِنْ أَجْلِ أَنَّ ذَلِكَ يُحْزِنُهُ‏.‏","english":{"narrator":"","text":"'Abdullah reported that the Prophet, may Allah bless him and grant\nhim peace, said, \"Two should not converse to the exclusion of another until\nthey are mixing with people since that would distress him.\""}},{"id":20,"idInBook":20,"chapterId":47,"bookId":15,"arabic":"حَدَّثَنَا قَبِيصَةُ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنِ ابْنِ عُمَرَ قَالَ‏:‏ إِذَا كَانُوا أَرْبَعَةً فَلا بَأْسَ‏.‏","english":{"narrator":"","text":"Ibn 'Umar said, \"When there are four, there is no harm.\""}},{"id":21,"idInBook":21,"chapterId":47,"bookId":15,"arabic":"حَدَّثَنَا عِمْرَانُ بْنُ مَيْسَرَةَ، عَنْ حَفْصِ بْنِ غِيَاثٍ، عَنْ أَشْعَثَ، عَنْ أَبِي بُرْدَةَ بْنِ أَبِي مُوسَى قَالَ‏:‏ جَلَسْتُ إِلَى عَبْدِ اللهِ بْنِ سَلاَّمٍ، فَقَالَ‏:‏ إِنَّكَ جَلَسْتَ إِلَيْنَا، وَقَدْ حَانَ مِنَّا قِيَامٌ، فَقُلْتُ‏:‏ فَإِذَا شِئْتَ، فَقَامَ، فَاتَّبَعْتُهُ حَتَّى بَلَغَ الْبَابَ‏.‏","english":{"narrator":"","text":"Abu Burda ibn Abi Musa said, \"I sat with 'Abdullah ibn Sallam.\nHe said, 'You have sat down with us, but now it is time for us to leave.'\nI said, 'If you like.' He got up and I followed him to the door.\""}},{"id":22,"idInBook":22,"chapterId":47,"bookId":15,"arabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ‏:‏ حَدَّثَنَا يَحْيَى، قَالَ‏:‏ حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي خَالِدٍ قَالَ‏:‏ حَدَّثَنِي قَيْسٌ، عَنْ أَبِيهِ، أَنَّهُ جَاءَ وَرَسُولُ اللهِ صلى الله عليه وسلم يَخْطُبُ، فَقَامَ فِي الشَّمْسِ، فَأَمَرَهُ فَتَحَوَّلَ إِلَى الظِّلِّ‏.‏","english":{"narrator":"","text":"Qays related that his father arrived while the Messenger of Allah,\nmay Allah bless him and grant him peace, was speaking. He stood in the\nsun and the Prophet told him to move to the shade."}}],"chapter":{"id":47,"bookId":15,"arabic":"كتاب تعامل الناس","english":"Behaviour with people"}}