{"metadata":{"length":24,"arabic":{"title":"الأدب المفرد","author":"الإمام محمد بن إسماعيل البخاري","introduction":"باب الجلوس والاستلقاء"},"english":{"title":"Al-Adab Al-Mufrad","author":"Imam Muhammad ibn Ismail al-Bukhari","introduction":"Sitting and lying down"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":48,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ صَالِحٍ قَالَ‏:‏ حَدَّثَنِي اللَّيْثُ قَالَ‏:‏ حَدَّثَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ قَالَ‏:‏ أَخْبَرَنِي عَامِرُ بْنُ سَعْدٍ، أَنَّ أَبَا سَعِيدٍ الْخُدْرِيَّ قَالَ‏:‏ نَهَى رَسُولُ اللهِ صلى الله عليه وسلم عَنْ لِبْسَتَيْنِ وَبَيْعَتَيْنِ‏:‏ نَهَى عَنِ الْمُلاَمَسَةِ، وَالْمُنَابَذَةِ فِي الْبَيْعِ، الْمُلاَمَسَةُ‏:‏ أَنْ يَمَسَّ الرَّجُلُ ثَوْبَهُ، وَالْمُنَابَذَةُ‏:‏ يَنْبُذُ الْآخَرُ إِلَيْهِ ثَوْبَهُ، وَيَكُونُ ذَلِكَ بَيْعَهُمْ عَنْ غَيْرِ نَظَرٍ‏.‏ وَاللِّبْسَتَيْنِ اشْتِمَالُ الصَّمَّاءِ، وَالصَّمَّاءُ‏:‏ أَنْ يَجْعَلَ طَرَفَ ثَوْبِهِ عَلَى إِحْدَى عَاتِقَيْهِ، فَيَبْدُو أَحَدُ شِقَّيْهِ لَيْسَ عَلَيْهِ شَيْءٌ، وَاللِّبْسَةُ الأُخْرَى احْتِبَاؤُهُ بِثَوْبِهِ وَهُوَ جَالِسٌ، لَيْسَ عَلَى فَرْجِهِ مِنْهُ شَيْءٌ‏.‏","english":{"narrator":"","text":"Abu Sa'id al-Khudri said, \"The Messenger of Allah, may Allah bless\nhim and grant him peace, forbade two types of dress and two sales transactions.\nHe forbade the sales transactions called mulamasa and\nmunabadha.*\nThe two types of dress are samma' ** and wrapping oneself up in\ngarment while sitting down  without anything covering\nthe private parts.\""}},{"id":2,"idInBook":2,"chapterId":48,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا عَمْرُو بْنُ عَوْفٍ، قَالَ‏:‏ حَدَّثَنَا خَالِدُ بْنُ عَبْدِ اللهِ، عَنْ خَالِدٍ عَنْ أَبِي قِلاَبَةَ قَالَ‏:‏ أَخْبَرَنِي أَبُو الْمَلِيحِ قَالَ‏:‏ دَخَلْتُ مَعَ أَبِيكَ زَيْدٍ عَلَى عَبْدِ اللهِ بْنِ عَمْرٍو، فَحَدَّثَنَا أَنَّ النَّبِيَّ صلى الله عليه وسلم ذُكِرَ لَهُ صَوْمِي، فَدَخَلَ عَلَيَّ، فَأَلْقَيْتُ لَهُ وِسَادَةً مِنْ أَدَمٍ حَشْوُهَا لِيفٌ، فَجَلَسَ عَلَى الأَرْضِ، وَصَارَتِ الْوِسَادَةُ بَيْنِي وَبَيْنَهُ، فَقَالَ لِي‏:‏ أَمَا يَكْفِيكَ مِنْ كُلِّ شَهْرٍ ثَلاَثَةُ أَيَّامٍ‏؟‏ قَالَ‏:‏ قُلْتُ‏:‏ يَا رَسُولَ اللهِ، قَالَ‏:‏ خَمْسًا، قُلْتُ‏:‏ يَا رَسُولَ اللهِ، قَالَ‏:‏ سَبْعًا، قُلْتُ‏:‏ يَا رَسُولَ اللهِ، قَالَ‏:‏ تِسْعًا، قُلْتُ‏:‏ يَا رَسُولَ اللهِ، قَالَ‏:‏ إِحْدَى عَشْرَةَ، قُلْتُ‏:‏ يَا رَسُولَ اللهِ، قَالَ‏:‏ لاَ صَوْمَ فَوْقَ صَوْمِ دَاوُدَ شَطْرَ الدَّهْرِ، صِيَامُ يَوْمٍ وَإِفْطَارُ يَوْمٍ‏.‏","english":{"narrator":"","text":"'Abdullah ibn 'Amr reported his fasting was mentioned to the Messenger\nof Allah, may Allah bless him and grant him peace. He said, \"The Prophet,\nmay Allah bless him and grant him peace, came to visit me and I threw him\na leather cushion stuffed with palm fibre, but he sat on the ground. The\ncushion remained between me and him. He asked me, 'Are three days every\nmonth enough for you?' I said, 'Messenger of Allah!' He said, 'Five?' I\nsaid, 'Messenger of Allah!' He said, Eleven?' I said, 'Messenger of Allah!'\nThen he said, 'Do not exceed the fast of Da'ud. Half of the time. Fast\none day and break the fast the next.'\""}},{"id":3,"idInBook":3,"chapterId":48,"bookId":15,"arabic":"حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، عَنْ يَزِيدَ بْنِ خُمَيْرٍ، عَنْ عَبْدِ اللهِ بْنِ بُسْرٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم مَرَّ عَلَى أَبِيهِ، فَأَلْقَى لَهُ قَطِيفَةً فَجَلَسَ عَلَيْهَا‏.‏","english":{"narrator":"","text":"'Abdullah ibn Busr reported that the Prophet, may Allah bless\nhim and grant him peace, passed by 'Abdullah's father who threw the Prophet\na rug on which he sat."}},{"id":4,"idInBook":4,"chapterId":48,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى، قَالَ‏:‏ حَدَّثَنَا عَبْدُ اللهِ بْنُ حَسَّانَ الْعَنْبَرِيُّ قَالَ‏:‏ حَدَّثَتْنِي جَدَّتَايَ صَفِيَّةُ بِنْتُ عُلَيْبَةَ، وَدُحَيْبَةُ بِنْتُ عُلَيْبَةَ، وَكَانَتَا رَبِيبَتَيْ قَيْلَةَ، أَنَّهُمَا أَخْبَرَتْهُمَا قَيْلَةُ قَالَتْ‏:‏ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم قَاعِدًا الْقُرْفُصَاءَ، فَلَمَّا رَأَيْتُ النَّبِيَّ الْمُتَخَشِّعَ فِي الْجِلْسَةِ أُرْعِدْتُ مِنَ الْفَرَقِ‏.‏","english":{"narrator":"","text":"Qayla related, \"I saw the Prophet, may Allah bless him and grant\nhim peace, sitting squatting. When I saw the Prophet, may Allah bless him\nand grant him peace, humble in his form of sitting, I trembled from fear.\""}},{"id":5,"idInBook":5,"chapterId":48,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ عُثْمَانَ الْقُرَشِيُّ، قَالَ‏:‏ حَدَّثَنَا ذَيَّالُ بْنُ عُبَيْدِ بْنِ حَنْظَلَةَ، حَدَّثَنِي جَدِّي حَنْظَلَةُ بْنُ حِذْيَمٍ قَالَ‏:‏ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فَرَأَيْتُهُ جَالِسًا مُتَرَبِّعًا‏.‏","english":{"narrator":"","text":"Dhayyal ibn Hanzala said, \"I visited the Prophet, may Allah bless\nhim and grant him peace, and I saw him sitting cross-legged.\""}},{"id":6,"idInBook":6,"chapterId":48,"bookId":15,"arabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ قَالَ‏:‏ حَدَّثَنِي مَعْنٌ قَالَ‏:‏ حَدَّثَنِي أَبُو رُزَيْقٍ، أَنَّهُ رَأَى عَلِيَّ بْنَ عَبْدِ اللهِ بْنِ عَبَّاسٍ، جَالِسًا مُتَرَبِّعًا، وَاضِعًا إِحْدَى رِجْلَيْهِ عَلَى الأُخْرَى، الْيُمْنَى عَلَى الْيُسْرَى‏.‏","english":{"narrator":"","text":"Abu Ruzayq related that he saw 'Ali ibn 'Abdullah ibn 'Abbas sitting\ncross-legged with one foot crossed over the other, the right on the left."}},{"id":7,"idInBook":7,"chapterId":48,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنْ عِمْرَانَ بْنِ مُسْلِمٍ قَالَ‏:‏ رَأَيْتُ أَنَسَ بْنَ مَالِكٍ يَجْلِسُ هَكَذَا مُتَرَبِّعًا، وَيَضَعُ إِحْدَى قَدَمَيْهِ عَلَى الأخْرَى‏.‏","english":{"narrator":"","text":"'Imran ibn Muslim said, \"I saw Anas ibn Malik sitting like that\n- cross-legged, with one of his feet over the other one.\""}},{"id":8,"idInBook":8,"chapterId":48,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، قَالَ‏:‏ حَدَّثَنَا قُرَّةُ بْنُ خَالِدٍ قَالَ‏:‏ حَدَّثَنِي قُرَّةُ بْنُ مُوسَى الْهُجَيْمِيُّ، عَنْ سُلَيْمِ بْنِ جَابِرٍ الْهُجَيْمِيِّ قَالَ‏:‏ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم وَهُوَ مُحْتَبٍ فِي بُرْدَةٍ، وَإِنَّ هُدَّابَهَا لَعَلَى قَدَمَيْهِ، فَقُلْتُ‏:‏ يَا رَسُولَ اللهِ، أَوْصِنِي، قَالَ‏:‏ عَلَيْكَ بِاتِّقَاءِ اللهِ، وَلاَ تَحْقِرَنَّ مِنَ الْمَعْرُوفِ شَيْئًا، وَلَوْ أَنْ تُفْرِغَ لِلْمُسْتَسْقِي مِنْ دَلْوِكَ فِي إِنَائِهِ، أَوْ تُكَلِّمَ أَخَاكَ وَوَجْهُكَ مُنْبَسِطٌ، وَإِيَّاكَ وَإِسْبَالَ الإِزَارِ، فَإِنَّهَا مِنَ الْمَخِيلَةِ، وَلاَ يُحِبُّهَا اللَّهُ، وَإِنِ امْرُؤٌ عَيَّرَكَ بِشَيْءٍ يَعْلَمُهُ مِنْكَ فَلاَ تُعَيِّرْهُ بِشَيْءٍ تَعْلَمُهُ مِنْهُ، دَعْهُ يَكُونُ وَبَالُهُ عَلَيْهِ، وَأَجْرُهُ لَكَ، وَلاَ تَسُبَّنَّ شَيْئًا‏.‏ قال: فما سببت بعد دابة ولا إنساناً.","english":{"narrator":"","text":"Salim ibn Jabir al-Hujaymi said, \"I came up to the Prophet, may\nAllah bless him and grant him peace, when he was wrapped up in a cloak\nwhose edges were cover his feet. I said, 'Messenger of Allah, advise me.'\nHe said, 'You must have fearful awareness of Allah. Do not scorn anything\ncorrect, even pouring water from your bucket into the bucket of someone\nelse who asks you for water or talking to your brother with a happy face.\nBeware of dragging your waist-wrapper - it is part of arrogance and\nAllah does not like it. If a man blames you for something he knows about\nyou, do not blame him for anything you know of him. Leave him to his own\nevil. You will have your reward. Do not abuse anything.'\""}},{"id":9,"idInBook":9,"chapterId":48,"bookId":15,"arabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ قَالَ‏:‏ حَدَّثَنِي ابْنُ أَبِي فُدَيْكٍ قَالَ‏:‏ حَدَّثَنِي هِشَامُ بْنُ سَعْدٍ، عَنْ نُعَيْمِ بْنِ الْمُجْمِرِ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ مَا رَأَيْتُ حَسَنًا قَطُّ إِلاَّ فَاضَتْ عَيْنَايَ دُمُوعًا، وَذَلِكَ أَنَّ النَّبِيَّ صلى الله عليه وسلم خَرَجَ يَوْمًا، فَوَجَدَنِي فِي الْمَسْجِدِ، فَأَخَذَ بِيَدِي، فَانْطَلَقْتُ مَعَهُ، فَمَا كَلَّمَنِي حَتَّى جِئْنَا سُوقَ بَنِي قَيْنُقَاعٍ، فَطَافَ فِيهِ وَنَظَرَ، ثُمَّ انْصَرَفَ وَأَنَا مَعَهُ، حَتَّى جِئْنَا الْمَسْجِدَ، فَجَلَسَ فَاحْتَبَى ثُمَّ قَالَ‏:‏ أَيْنَ لَكَاعٌ‏؟‏ ادْعُ لِي لَكَاعًا، فَجَاءَ حَسَنٌ يَشْتَدُّ فَوَقَعَ فِي حِجْرِهِ، ثُمَّ أَدْخَلَ يَدَهُ فِي لِحْيَتِهِ، ثُمَّ جَعَلَ النَّبِيُّ صلى الله عليه وسلم يَفْتَحُ فَاهُ فَيُدْخِلُ فَاهُ فِي فِيهِ، ثُمَّ قَالَ‏:‏ اللَّهُمَّ إِنِّي أُحِبُّهُ، فَأَحْبِبْهُ، وَأَحِبَّ مَنْ يُحِبُّهُ‏.‏","english":{"narrator":"","text":"It is related that Abu Hurayra said, \"I never sae al-Hasan without\nmy eyes overflowing with tears. That is because the Prophet, may Allah\nbless him and grant him peace, went out one day and he found me  in the\nmosque. He took my hand and I went along with him. He did not speak to\nme until we reached the market of Banu Qaynuqa'. He walked around it and\nlooked. Then he left and I left with him until we reached the mosque. He\nsat down and wrapped himself in his garment. Then he said, 'Where is the\nlittle one? Call the little one to me.' Hasan came running and jumped into\nhis lap. Then he put his hand in his beard. Then the Prophet, may Allah\nbless him and grant him peace, opened his mouth and put his mouth in his\nmouth. Then he said, O Allah, I love him, so love him and the one who loves\nhim!'\""}},{"id":10,"idInBook":10,"chapterId":48,"bookId":15,"arabic":"حَدَّثَنَا يَحْيَى بْنُ صَالِحٍ، قَالَ‏:‏ حَدَّثَنَا إِسْحَاقُ بْنُ يَحْيَى الْكَلْبِيُّ، قَالَ‏:‏ حَدَّثَنَا الزُّهْرِيُّ، قَالَ‏:‏ حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم صَلَّى بِهِمُ الظُّهْرَ، فَلَمَّا سَلَّمَ قَامَ عَلَى الْمِنْبَرِ فَذَكَرَ السَّاعَةَ، وَذَكَرَ أَنَّ فِيهَا أُمُورًا عِظَامًا، ثُمَّ قَالَ‏:‏ مَنْ أَحَبَّ أَنْ يَسْأَلَ عَنْ شَيْءٍ فَلْيَسْأَلْ عَنْهُ، فَوَاللَّهِ لاَ تَسْأَلُونِي عَنْ شَيْءٍ إِلاَّ أَخْبَرْتُكُمْ مَا دُمْتُ فِي مَقَامِي هَذَا، قَالَ أَنَسٌ‏:‏ فَأَكْثَرَ النَّاسُ الْبُكَاءَ حِينَ سَمِعُوا ذَلِكَ مِنْ رَسُولِ اللهِ صلى الله عليه وسلم، وَأَكْثَرَ رَسُولُ اللهِ صلى الله عليه وسلم أَنْ يَقُولَ‏:‏ سَلُوا، فَبَرَكَ عُمَرُ عَلَى رُكْبَتَيْهِ وَقَالَ‏:‏ رَضِينَا بِاللَّهِ رَبًّا، وَبِالإِسْلاَمِ دِينًا، وَبِمُحَمَّدٍ رَسُولاً، فَسَكَتَ رَسُولُ اللهِ صلى الله عليه وسلم حِينَ قَالَ ذَلِكَ عُمَرُ، ثُمَّ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ أَوْلَى، أَمَا وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ، لَقَدْ عُرِضَتْ عَلَيَّ الْجَنَّةُ وَالنَّارُ فِي عُرْضِ هَذَا الْحَائِطِ، وَأَنَا أُصَلِّي، فَلَمْ أَرَ كَالْيَوْمِ فِي الْخَيْرِ وَالشَّرِّ‏.‏","english":{"narrator":"","text":"Anas ibn Malik related that the Prophet, may Allah bless him and\ngrant him peace, prayed Dhuhr with them. When he said the taslim, he stood\non the minbar and talked about the Final Hour. He mentioned terrible things\nabout it. Then he said, 'Whoever wants to ask about something should ask\nabout it. By Allah, whatever you ask me about, I will tell you as long\nas I am in this place.' People wept a great deal when they heard the Messenger\nof Allah, may Allah bless him and grant him peace, say that. The Messenger\nof Allah, may Allah bless him and grant him peace, repeated frequently,\n'Ask.' 'Umar knelt on knees and said, 'We are content with Allah as\nLord, with Islam as (the) deen, and with Muhammad as Messenger.' The Prophet, may\nAllah bless him and grant him peace, was silent when 'Umar said that. Then\nthe Messenger of Allah, may Allah bless him and grant him peace, said,\n'Better! By the One in Whose hand the soul of Muhammad is, I have been\nshown the Garden and the Fire inside this garden while I was praying. I\nhave not seen any good and evil such as I have seen this day.'\""}},{"id":11,"idInBook":11,"chapterId":48,"bookId":15,"arabic":"حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيلَ، قَالَ‏:‏ حَدَّثَنَا ابْنُ عُيَيْنَةَ قَالَ‏:‏ سَمِعْتُ الزُّهْرِيَّ يُحَدِّثُهُ، عَنْ عَبَّادِ بْنِ تَمِيمٍ، عَنْ عَمِّهِ قَالَ‏:‏ رَأَيْتُهُ، قُلْتُ لِابْنِ عُيَيْنَةَ‏:‏ النَّبِيُّ صلى الله عليه وسلم‏؟‏ قَالَ‏:‏ نَعَمْ مُسْتَلْقِيًا، وَاضِعًا إِحْدَى رِجْلَيْهِ عَلَى الأُخْرَى‏.‏","english":{"narrator":"","text":"'Abdullah ibn Zayd ibn 'Asim al-Mazini said, \"I saw him.\" Malik\nibn Isma'il asked Ibn 'Uyayna (who had transmitted this to him), \"The Prophet,\nmay Allah bless him and grant him peace?\" He replied, \"Yes, lying down\nwith one of his feet over the other.\""}},{"id":12,"idInBook":12,"chapterId":48,"bookId":15,"arabic":"حَدَّثَنَا إِسْحَاقُ بْنُ مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ اللهِ بْنُ جَعْفَرٍ، عَنْ أُمِّ بَكْرٍ بِنْتِ الْمِسْوَرِ، عَنْ أَبِيهَا قَالَ‏:‏ رَأَيْتُ عَبْدَ الرَّحْمَنِ بْنَ عَوْفٍ مُسْتَلْقِيًا، رَافِعًا إِحْدَى رِجْلَيْهِ عَلَى الأخْرَى‏.‏","english":{"narrator":"","text":"Al-Miswar said, \"I saw 'Abdu'r-Rahman ibn 'Awf lying down with\none of his feet over the other.\""}},{"id":13,"idInBook":13,"chapterId":48,"bookId":15,"arabic":"حَدَّثَنَا خَلَفُ بْنُ مُوسَى بْنِ خَلَفٍ، قَالَ‏:‏ حَدَّثَنَا أَبِي، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، عَنِ ابْنِ طِخْفَةَ الْغِفَارِيِّ، أَنَّ أَبَاهُ أَخْبَرَهُ، أَنَّهُ كَانَ مِنْ أَصْحَابِ الصُّفَّةِ، قَالَ‏:‏ بَيْنَا أَنَا نَائِمٌ فِي الْمَسْجِدِ مِنْ آخِرِ اللَّيْلِ، أَتَانِي آتٍ وَأَنَا نَائِمٌ عَلَى بَطْنِي، فَحَرَّكَنِي بِرِجْلِهِ فَقَالَ‏:‏ قُمْ، هَذِهِ ضَجْعَةٌ يُبْغِضُهَا اللَّهُ، فَرَفَعْتُ رَأْسِي، فَإِذَا النَّبِيُّ صلى الله عليه وسلم قَائِمٌ عَلَى رَأْسِي‏.‏","english":{"narrator":"","text":"Ibn Tikhfa al-Ghifari reported that his father told him that he\nhad been one of the People of the Bench. He told him, \"I was sleeping in\nthe mosque during the last part of the night, lying on my stomach. Someone\ncame to me and moved me with his foot, saying, 'Get up. This is a manner\nof lying down which Allah hates.' I raised my head and the Prophet, may\nAllah bless him and grant him peace, was standing by my head.\""}},{"id":14,"idInBook":14,"chapterId":48,"bookId":15,"arabic":"حَدَّثَنَا مَحْمُودٌ، قَالَ‏:‏ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، قَالَ‏:‏ أَخْبَرَنَا الْوَلِيدُ بْنُ جَمِيلٍ الْكِنْدِيُّ، مِنْ أَهْلِ فِلَسْطِينَ، عَنِ الْقَاسِمِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي أُمَامَةَ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم مَرَّ بِرَجُلٍ فِي الْمَسْجِدِ مُنْبَطِحًا لِوَجْهِهِ، فَضَرَبَهُ بِرِجْلِهِ وَقَالَ‏:‏ قُمْ، نَوْمَةٌ جَهَنَّمِيَّةٌ‏.‏","english":{"narrator":"","text":"Abu Umama reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, passed by a man in the mosque who was lying on\nhis front. He kicked him with his foot and said, \"Get up. It is the sleep\nof Jahannam.\""}},{"id":15,"idInBook":15,"chapterId":48,"bookId":15,"arabic":"حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانَ، قَالَ‏:‏ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ‏:‏ حَدَّثَنِي عُمَرُ بْنُ مُحَمَّدٍ قَالَ‏:‏ حَدَّثَنِي الْقَاسِمُ بْنُ عُبَيْدِ اللهِ بْنِ عَبْدِ اللهِ بْنِ عُمَرَ، عَنْ سَالِمٍ، عَنْ أَبِيهِ قَالَ‏:‏ قَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ لاَ يَأْكُلُ أَحَدُكُمْ بِشِمَالِهِ، وَلاَ يَشْرَبَنَّ بِشِمَالِهِ، فَإِنَّ الشَّيْطَانَ يَأْكُلُ بِشِمَالِهِ، وَيَشْرَبُ بِشِمَالِهِ‏.‏ قال: كان نافع يزيد فيها: ((ولا يأخذ بها، ولا يعطي بها))","english":{"narrator":"","text":"Ibn 'Umar said, \"the Prophet, may Allah bless him and grant him\npeace, said, 'None of you should eat with his left hand nor drink with\nhis left hand. Shaytan eats and drinks with his left hand.'\""}},{"id":16,"idInBook":16,"chapterId":48,"bookId":15,"arabic":"حَدَّثَنَا قُتَيْبَةُ، قَالَ‏:‏ حَدَّثَنَا صَفْوَانُ بْنُ عِيسَى، قَالَ‏:‏ حَدَّثَنَا عَبْدُ اللهِ بْنُ هَارُونَ، عَنْ زِيَادِ بْنِ سَعْدٍ، عَنِ ابْنِ نَهِيكٍ، عَنِ ابْنِ عَبَّاسٍ قَالَ‏:‏ مِنَ السُّنَّةِ إِذَا جَلَسَ الرَّجُلُ أَنْ يَخْلَعَ نَعْلَيْهِ، فَيَضَعُهُمَا إِلَى جَنْبِهِ‏.‏","english":{"narrator":"","text":"Ibn 'Abbas said, \"Part of the sunna is that when a man sits down,\nhe removes his sandals and puts them at his side.\""}},{"id":17,"idInBook":17,"chapterId":48,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ صَالِحٍ قَالَ‏:‏ حَدَّثَنِي مُعَاوِيَةُ، عَنْ أَزْهَرَ بْنِ سَعِيدٍ قَالَ‏:‏ سَمِعْتُ أَبَا أُمَامَةَ يَقُولُ‏:‏ إِنَّ الشَّيْطَانَ يَأْتِي إِلَى فِرَاشِ أَحَدِكُمْ بَعْدَ مَا يَفْرِشُهُ أَهْلُهُ وَيُهَيِّئُونَهُ، فَيُلْقِي عَلَيْهِ الْعُودَ أَوِ الْحَجَرَ أَوِ الشَّيْءَ، لِيُغْضِبَهُ عَلَى أَهْلِهِ، فَإِذَا وَجَدَ ذَلِكَ فَلاَ يَغْضَبْ عَلَى أَهْلِهِ، قَالَ‏:‏ لأَنَّهُ مِنْ عَمَلِ الشَّيْطَانِ‏.‏","english":{"narrator":"","text":"Abu Umama said, \"Shaytan comes to one of you in bed after his\nfamily has covered him and wished him good night. He throws sticks, stones\nor other things on him to make him angry with his family. When he feels\nthat, he should not get angry with his family.' He said, 'It is part of\nthe work of Shaytan.'\""}},{"id":18,"idInBook":18,"chapterId":48,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ‏:‏ حَدَّثَنَا سَالِمُ بْنُ نُوحٍ، قَالَ‏:‏ أَخْبَرَنَا عُمَرُ، رَجُلٌ مِنْ بَنِي حَنِيفَةَ هُوَ ابْنُ جَابِرٍ، عَنْ وَعْلَةَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ وَثَّابٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَلِيٍّ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ مَنْ بَاتَ عَلَى ظَهْرِ بَيْتٍ لَيْسَ عَلَيْهِ حِجَابٌ فَقَدْ بَرِئَتْ مِنْهُ الذِّمَّةُ‏.‏ قال: أبو عبد الله: في إسناده نظر.","english":{"narrator":"","text":"'Ali reported that the Prophet, may Allah bless him and grant\nhim peace, said, \"If anyone spends the night on the top of his house without\nprotection, Allah has no responsibility for (protecting) him.\""}},{"id":19,"idInBook":19,"chapterId":48,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، قَالَ‏:‏ أَخْبَرَنَا سُفْيَانُ، عَنْ عِمْرَانَ بْنِ مُسْلِمِ بْنِ رِيَاحٍ الثَّقَفِيِّ، عَنْ عَلِيِّ بْنِ عُمَارَةَ قَالَ‏:‏ جَاءَ أَبُو أَيُّوبَ الأَنْصَارِيُّ، فَصَعِدْتُ بِهِ عَلَى سَطْحٍ أَجْلَحَ، فَنَزَلَ وَقَالَ‏:‏ كِدْتُ أَنْ أَبِيتَ اللَّيْلَةَ وَلاَ ذِمَّةَ لِي‏.‏","english":{"narrator":"","text":"'Ali ibn 'Umara said, \"Abu Ayyub al-Ansari came and went up on\nthe flat roof. He came down and said, 'I almost spent the night with no\nprotection.'\""}},{"id":20,"idInBook":20,"chapterId":48,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ‏:‏ حَدَّثَنَا الْحَارِثُ بْنُ عُبَيْدٍ قَالَ‏:‏ حَدَّثَنِي أَبُو عِمْرَانَ، عَنْ زُهَيْرٍ، عَنْ رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ مَنْ بَاتَ عَلَى إِنْجَارٍ فَوَقَعَ مِنْهُ فَمَاتَ، بَرِئَتْ مِنْهُ الذِّمَّةُ، وَمَنْ رَكِبَ الْبَحْرَ حِينَ يَرْتَجُّ، يَعْنِي‏:‏ يَغْتَلِمُ، فَهَلَكَ بَرِئَتْ مِنْهُ الذِّمَّةُ‏.‏","english":{"narrator":"","text":"Zuhayr reported that one of the Companions of the Prophet, may\nAllah bless him and grant him peace, said, \"If anyone spends the night\non a flat roof (without walls) and then falls off of it and dies, no one\nbears any responsibility for him. If anyone embarks on the sea when it\nis fierce (i.e. stormy) and is destroyed, no one bears any responsibility\nfor him.\""}},{"id":21,"idInBook":21,"chapterId":48,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ قَالَ‏:‏ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ أَبِي الزِّنَادِ، عَنْ أَبِيهِ قَالَ‏:‏ شَهِدَ عِنْدِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَخْبَرَهُ عَبْدُ الرَّحْمَنِ بْنُ نَافِعِ بْنِ عَبْدِ الْحَارِثِ الْخُزَاعِيُّ، أَنَّ أَبَا مُوسَى الأَشْعَرِيَّ أَخْبَرَهُ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ فِي حَائِطٍ عَلَى قُفِّ الْبِئْرِ، مُدَلِّيًا رِجْلَيْهِ فِي الْبِئْرِ‏.‏","english":{"narrator":"","text":"Abu Musa al-Ash'ari related that the Prophet, may Allah bless\nhim and grant him peace, was sitting in a walled garden on the rim of a\nwell, dangling his feet into the well."}},{"id":22,"idInBook":22,"chapterId":48,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدٌ، قَالَ‏:‏ أَخْبَرَنَا عَبْدُ اللهِ، قَالَ‏:‏ أَخْبَرَنَا مُحَمَّدُ بْنُ إِبْرَاهِيمَ قَالَ‏:‏ حَدَّثَنِي مُسْلِمُ بْنُ أَبِي مَرْيَمَ، أَنَّ ابْنَ عُمَرَ كَانَ إِذَا خَرَجَ مِنْ بَيْتِهِ قَالَ‏:‏ اللَّهُمَّ سَلِّمْنِي وَسَلِّمْ مِنِّي‏.‏","english":{"narrator":"","text":"When Ibn 'Umar left his house, he used to say, \"O Allah, keep\nme and those with me safe!\""}},{"id":23,"idInBook":23,"chapterId":48,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الصَّلْتِ أَبُو يَعْلَى، قَالَ‏:‏ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ، عَنْ عَبْدِ اللهِ بْنِ حُسَيْنِ بْنِ عَطَاءٍ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ كَانَ إِذَا خَرَجَ مِنْ بَيْتِهِ قَالَ‏:‏ بِسْمِ اللهِ، التُّكْلاَنُ عَلَى اللهِ، لا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, used to say when he left his house, \"In the Name of Allah.\nReliance is on Allah. There is no power nor strength except by Allah.\""}},{"id":24,"idInBook":24,"chapterId":48,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ‏:‏ حَدَّثَنَا يَحْيَى بْنُ عَبْدِ الرَّحْمَنِ الْعَصَرِيُّ، قَالَ‏:‏ حَدَّثَنَا شِهَابُ بْنُ عَبَّادٍ الْعَصَرِيُّ، أَنَّ بَعْضَ وَفْدِ عَبْدِ الْقَيْسِ سَمِعَهُ يَذْكُرُ، قَالَ‏:‏ لَمَّا بَدَأْنَا فِي وِفَادَتِنَا إِلَى النَّبِيِّ صلى الله عليه وسلم سِرْنَا، حَتَّى إِذَا شَارَفْنَا الْقُدُومَ تَلَقَّانَا رَجُلٌ يُوضِعُ عَلَى قَعُودٍ لَهُ، فَسَلَّمَ، فَرَدَدْنَا عَلَيْهِ، ثُمَّ وَقَفَ فَقَالَ‏:‏ مِمَّنِ الْقَوْمُ‏؟‏ قُلْنَا‏:‏ وَفْدُ عَبْدِ الْقَيْسِ، قَالَ‏:‏ مَرْحَبًا بِكُمْ وَأَهْلاً، إِيَّاكُمْ طَلَبْتُ، جِئْتُ لِأُبَشِّرَكُمْ، قَالَ النَّبِيُّ صلى الله عليه وسلم بِالأَمْسِ لَنَا‏:‏ إِنَّهُ نَظَرَ إِلَى الْمَشْرِقِ فَقَالَ‏:‏ لَيَأْتِيَنَّ غَدًا مَنْ هَذَا الْوَجْهِ، يَعْنِي‏:‏ الْمَشْرِقَ، خَيْرُ وَفْدِ الْعَرَبِ، فَبَتُّ أَرُوغُ حَتَّى أَصْبَحْتُ، فَشَدَدْتُ عَلَى رَاحِلَتِي، فَأَمْعَنْتُ فِي الْمَسِيرِ حَتَّى ارْتَفَعَ النَّهَارُ، وَهَمَمْتُ بِالرُّجُوعِ، ثُمَّ رُفِعَتْ رُءُوسُ رَوَاحِلِكُمْ، ثُمَّ ثَنَى رَاحِلَتَهُ بِزِمَامِهَا رَاجِعًا يُوضِعُ عَوْدَهُ عَلَى بَدْئِهِ، حَتَّى انْتَهَى إِلَى النَّبِيِّ صلى الله عليه وسلم ‏,‏ وَأَصْحَابُهُ حَوْلَهُ مِنَ الْمُهَاجِرِينَ وَالأَنْصَارِ، فَقَالَ‏:‏ بِأَبِيوَأُمِّي، جِئْتُ أُبَشِّرُكَ بِوَفْدِ عَبْدِ الْقَيْسِ، فَقَالَ‏:‏ أَنَّى لَكَ بِهِمْ يَا عُمَرُ‏؟‏ قَالَ‏:‏ هُمْ أُولاَءِ عَلَى أَثَرِي، قَدْ أَظَلُّوا، فَذَكَرَ ذَلِكَ، فَقَالَ‏:‏ بَشَّرَكَ اللَّهُ بِخَيْرٍ، وَتَهَيَّأَ الْقَوْمُ فِي مَقَاعِدِهِمْ، وَكَانَ النَّبِيُّ صلى الله عليه وسلم قَاعِدًا، فَأَلْقَى ذَيْلَ رِدَائِهِ تَحْتَ يَدِهِ فَاتَّكَأَ عَلَيْهِ، وَبَسَطَ رِجْلَيْهِ‏.‏ فَقَدِمَ الْوَفْدُ فَفَرِحَ بِهِمُ الْمُهَاجِرُونَ وَالأَنْصَارُ، فَلَمَّا رَأَوُا النَّبِيَّ صلى الله عليه وسلم وَأَصْحَابَهُ أَمْرَحُوا رِكَابَهُمْ فَرَحًا بِهِمْ، وَأَقْبَلُوا سِرَاعًا، فَأَوْسَعَ الْقَوْمُ، وَالنَّبِيُّ صلى الله عليه وسلم مُتَّكِئٌ عَلَى حَالِهِ، فَتَخَلَّفَ الأَشَجُّ، وَهُوَ‏:‏ مُنْذِرُ بْنُ عَائِذِ بْنِ مُنْذِرِ بْنِ الْحَارِثِ بْنِ النُّعْمَانِ بْنِ زِيَادِ بْنِ عَصَرَ، فَجَمَعَ رِكَابَهُمْ ثُمَّ أَنَاخَهَا، وَحَطَّ أَحْمَالَهَا، وَجَمَعَ مَتَاعَهَا، ثُمَّ أَخْرَجَ عَيْبَةً لَهُ وَأَلْقَى عَنْهُ ثِيَابَ السَّفَرِ وَلَبِسَ حُلَّةً، ثُمَّ أَقْبَلَ يَمْشِي مُتَرَسِّلاً، فَقَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ مَنْ سَيِّدُكُمْ وَزَعِيمُكُمْ، وَصَاحِبُ أَمْرِكُمْ‏؟‏ فَأَشَارُوا بِأَجْمَعِهِمْ إِلَيْهِ، وَقَالَ‏:‏ ابْنُ سَادَتِكُمْ هَذَا‏؟‏ قَالُوا‏:‏ كَانَ آبَاؤُهُ سَادَتَنَا فِي الْجَاهِلِيَّةِ، وَهُوَ قَائِدُنَا إِلَى الإِسْلاَمِ، فَلَمَّا انْتَهَى الأَشَجُّ أَرَادَ أَنْ يَقْعُدَ مِنْ نَاحِيَةٍ، اسْتَوَى النَّبِيُّ صلى الله عليه وسلم قَاعِدًا قَالَ‏:‏ هَا هُنَا يَا أَشَجُّ، وَكَانَ أَوَّلَ يَوْمٍ سُمِّيَ الأَشَجَّ ذَلِكَ الْيَوْمَ، أَصَابَتْهُ حِمَارَةٌ بِحَافِرِهَا وَهُوَ فَطِيمٌ، فَكَانَ فِي وَجْهِهِ مِثْلُ الْقَمَرِ، فَأَقْعَدَهُ إِلَى جَنْبِهِ، وَأَلْطَفَهُ، وَعَرَفَ فَضْلَهُ عَلَيْهِمْ، فَأَقْبَلَ الْقَوْمُ عَلَى النَّبِيِّ صلى الله عليه وسلم يَسْأَلُونَهُ وَيُخْبِرُهُمْ، حَتَّى كَانَ بِعَقِبِ الْحَدِيثِ قَالَ‏:‏ هَلْ مَعَكُمْ مِنْ أَزْوِدَتِكُمْ شَيْءٌ‏؟‏ قَالُوا‏:‏ نَعَمْ، فَقَامُوا سِرَاعًا، كُلُّ رَجُلٍ مِنْهُمْ إِلَى ثِقَلِهِ فَجَاءُوا بِصُبَرِ التَّمْرِ فِي أَكُفِّهِمْ، فَوُضِعَتْ عَلَى نِطَعٍ بَيْنَ يَدَيْهِ، وَبَيْنَ يَدَيْهِ جَرِيدَةٌ دُونَ الذِّرَاعَيْنِ وَفَوْقَ الذِّرَاعِ، فَكَانَ يَخْتَصِرُ بِهَا، قَلَّمَا يُفَارِقُهَا، فَأَوْمَأَ بِهَا إِلَى صُبْرَةٍ مِنْ ذَلِكَ التَّمْرِ فَقَالَ‏:‏ تُسَمُّونَ هَذَا التَّعْضُوضَ‏؟‏ قَالُوا‏:‏ نَعَمْ، قَالَ‏:‏ وَتُسَمُّونَ هَذَا الصَّرَفَانَ‏؟‏ قَالُوا‏:‏ نَعَمْ، وَتُسَمُّونَ هَذَا الْبَرْنِيَّ‏؟‏، قَالُوا‏:‏ نَعَمْ، قَالَ‏:‏ هُوَ خَيْرُ تَمْرِكُمْ وَأَنْفَعُهُ لَكُمْ، وَقَالَ بَعْضُ شُيُوخِ الْحَيِّ‏:‏ وَأَعْظَمُهُ بَرَكَةً وَإِنَّمَا كَانَتْ عِنْدَنَا خَصِبَةٌ نَعْلِفُهَا إِبِلَنَا وَحَمِيرَنَا، فَلَمَّا رَجَعْنَا مِنْ وِفَادَتِنَا تِلْكَ عَظُمَتْ رَغْبَتُنَا فِيهَا، وَفَسَلْنَاهَا حَتَّى تَحَوَّلَتْ ثِمَارُنَا مِنْهَا، وَرَأَيْنَا الْبَرَكَةَ فِيهَا‏.‏","english":{"narrator":"Some of the delegation of 'Abdu'l-Qays heard him mention the following:","text":"\"When it became clear to us that we should go to the Prophet, may Allah\nbless him and grant him peace, we travelled until we were in sight of our\ndestination. We were met by a man on a young camel. He greeted is and we\nreturned the greeting. Then he stopped and asked, 'Which tribe are you\nfrom?' We replied, 'We are the delegation of 'Abdu'l-Qays.' The man said,\n'Welcome. I was looking for you. I came to give you good news. Yesterday\nthe Prophet, may Allah bless him and grant him peace, looked towards the\neast and told us, \"Tomorrow from that direction (i.e. the east) there will\ncome the best delegation of the Arabs.\" I spent the night preparing to\nleave. This morning I rode long and hard on my camel until dawn rose. Then\nI thought of returning, but I caught sight of the heads of your mounts.'"}}],"chapter":{"id":48,"bookId":15,"arabic":"باب الجلوس والاستلقاء","english":"Sitting and lying down"}}