{"metadata":{"length":6,"arabic":{"title":"الأدب المفرد","author":"الإمام محمد بن إسماعيل البخاري","introduction":"كتاب الصباح والمساء"},"english":{"title":"Al-Adab Al-Mufrad","author":"Imam Muhammad ibn Ismail al-Bukhari","introduction":"Mornings and evenings"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":49,"bookId":15,"arabic":"حَدَّثَنَا مُعَلَّى، قَالَ‏:‏ حَدَّثَنَا وُهَيْبٌ، قَالَ‏:‏ حَدَّثَنَا سُهَيْلُ بْنُ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا أَصْبَحَ قَالَ‏:‏ اللَّهُمَّ بِكَ أَصْبَحْنَا، وَبِكَ أَمْسَيْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ، وَإِلَيْكَ النُّشُورُ، وَإِذَا أَمْسَى قَالَ‏:‏ اللَّهُمَّ بِكَ أَمْسَيْنَا، وَبِكَ أَصْبَحْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ، وَإِلَيْكَ الْمَصِيرُ‏.‏","english":{"narrator":"","text":"Abu Hurayra said, \"In the morning, the Prophet, may Allah bless\nhim and grant him peace, would say, 'O Allah, We enter the morning by You\nand we enter the evening by You. We live by You and we die by You and to\nYou is gathering.' In the evening, he would say, 'O Allah, we enter the\nevening by You and we enter the morning by You and we live by You and we\ndie by You and to You is the return.'\""}},{"id":2,"idInBook":2,"chapterId":49,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، قَالَ‏:‏ حَدَّثَنَا وَكِيعٌ، عَنْ عُبَادَةَ بْنِ مُسْلِمٍ الْفَزَارِيِّ قَالَ‏:‏ حَدَّثَنِي جُبَيْرُ بْنُ أَبِي سُلَيْمَانَ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ قَالَ‏:‏ سَمِعْتُ ابْنَ عُمَرَ يَقُولُ‏:‏ لَمْ يَكُنْ رَسُولُ اللهِ صلى الله عليه وسلم يَدَعُ هَؤُلاَءِ الْكَلِمَاتِ إِذَا أَصْبَحَ وَإِذَا أَمْسَى‏:‏ اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ‏.‏ اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَايَ، وَأَهْلِي وَمَالِي‏.‏ اللَّهُمَّ اسْتُرْ عَوْرَاتِي، وَآمِنْ رَوْعَاتِي‏.‏ اللَّهُمَّ احْفَظْنِي مِنْ بَيْنِ يَدَيَّ وَمِنْ خَلْفِي، وَعَنْ يَمِينِي وَعَنْ شِمَالِي، وَمِنْ فَوْقِي، وَأَعُوذُ بِعَظَمَتِكَ مِنْ أَنْ أُغْتَالَ مِنْ تَحْتِي‏.‏","english":{"narrator":"Ibn 'Umar said, \"The Messenger of Allah, may Allah bless him and\ngrant him peace, did not omit saying the following words in the morning\nand evening:","text":"'O Allah, I ask you for well-being in this world and the\nNext. O Allah, I ask you for forgiveness and well-being in my deen and\nin this world and in my family and my property. O Allah, veil my faults\nand calm my fears. O Allah, give me protection in front of me and behind\nme, on my right and my left and above me. I seek refuge by Your might from\nbeing overwhelmed from under me.'\""}},{"id":3,"idInBook":3,"chapterId":49,"bookId":15,"arabic":"حَدَّثَنَا إِسْحَاقُ، قَالَ‏:‏ حَدَّثَنَا بَقِيَّةُ، عَنْ مُسْلِمِ بْنِ زِيَادٍ، مَوْلَى مَيْمُونَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم، قَالَ‏:‏ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ مَنْ قَالَ حِينَ يُصْبِحُ‏:‏ اللَّهُ إِنَّا أَصْبَحْنَا نُشْهِدُكَ، وَنُشْهِدُ حَمَلَةَ عَرْشِكَ، وَمَلاَئِكَتَكَ وَجَمِيعَ خَلْقِكَ، أَنَّكَ أَنْتَ اللَّهُ لاَ إِلَهَ إِلاَّ أَنْتَ وَحْدَكَ لاَ شَرِيكَ لَكَ، وَأَنَّ مُحَمَّدًا عَبْدُكَ وَرَسُولُكَ، إِلاَّ أَعْتَقَ اللَّهُ رُبُعَهُ فِي ذَلِكَ الْيَوْمِ، وَمَنْ قَالَهَا مَرَّتَيْنِ أَعْتَقَ اللَّهُ نِصْفَهُ مِنَ النَّارِ، وَمَنْ قَالَهَا أَرْبَعَ مَرَّاتٍ أَعْتَقَهُ اللَّهُ مِنَ النَّارِ فِي ذَلِكَ الْيَوْمِ‏.‏","english":{"narrator":"","text":"Maymuna, the wife of the Prophet, said, \"I heard Anas ibn Malik\nsay that the Messenger of Allah, may Allah bless him and grant him peace,\nsaid, 'Whoever says in the morning, \"O Allah, we bear witness to you and\nwe bear witness to the bearers of You Throne and Your angels and all Your\ncreation. You are Allah. There is no god but You alone with no partner\nand Muhammad is your slave and Messenger\", by that Allah will free a quarter\nof him from the Fire on that day. If someone says it twice, Allah will\nfree half of him from the Fire. If he says it four times, Allah will free\nhim completely from the Fire on that day.'\""}},{"id":4,"idInBook":4,"chapterId":49,"bookId":15,"arabic":"حَدَّثَنَا سَعِيدُ بْنُ الرَّبِيعِ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، عَنْ يَعْلَى بْنِ عَطَاءٍ قَالَ‏:‏ سَمِعْتُ عَمْرَو بْنَ عَاصِمٍ قَالَ‏:‏ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُ‏:‏ قَالَ أَبُو بَكْرٍ‏:‏ يَا رَسُولَ اللهِ، عَلِّمْنِي شَيْئًا أَقُولُهُ إِذَا أَصْبَحْتُ وَأَمْسَيْتُ، قَالَ‏:‏ قُلِ‏:‏ اللَّهُمَّ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ، فَاطِرَ السَّمَاوَاتِ وَالأَرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ، قُلْهُ إِذَا أَصْبَحْتَ وَإِذَا أَمْسَيْتَ، وَإِذَا أَخَذْتَ مَضْجَعَكَ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that Abu Bakr said, \"Messenger of Allah,\nteach me something that I can say morning and evening.\" The Prophet said,\n\"O Allah, Knower of the Unseen and the Visible, Creator of the heavens\nand the earth, everything is in Your hands. I testify that there is no\ngod but You. I seek refuge with You from the evil of myself and the evil\nof shaytan and his (encouragement to) associate others (with You).\" Say\nit in the morning and the evening and when you go to sleep.\""}},{"id":5,"idInBook":5,"chapterId":49,"bookId":15,"arabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ‏:‏ حَدَّثَنَا هُشَيْمٌ، عَنْ يَعْلَى، عَنْ عَمْرٍو، عَنْ أَبِي هُرَيْرَةَ مِثْلَهُ‏.‏ وَقَالَ‏:‏ رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، وَقَالَ‏:‏ شَرِّ الشَّيْطَانِ وَشِرْكِهِ‏.‏","english":{"narrator":"","text":"A similar report from Abu Hurayra in which he said, \"The Lord\nof everything and its Master.\" He said, \"The evil of shaytan and his encouragement\nto associate.\""}},{"id":6,"idInBook":6,"chapterId":49,"bookId":15,"arabic":"حَدَّثَنَا خَطَّابُ بْنُ عُثْمَانَ، قَالَ‏:‏ حَدَّثَنَا إِسْمَاعِيلُ، عَنْ مُحَمَّدِ بْنِ زِيَادٍ، عَنْ أَبِي رَاشِدٍ الْحُبْرَانِيِّ‏:‏ أَتَيْتُ عَبْدَ اللهِ بْنَ عَمْرٍو فَقُلْتُ لَهُ‏:‏ حَدِّثْنَا بِمَا سَمِعْتَ مِنْ رَسُولِ اللهِ صلى الله عليه وسلم، فَأَلْقَى إِلَيَّ صَحِيفَةً فَقَالَ‏:‏ هَذَا مَا كَتَبَ لِيَ النَّبِيُّ صلى الله عليه وسلم فَنَظَرْتُ فِيهَا، فَإِذَا فِيهَا‏:‏ إِنَّ أَبَا بَكْرٍ الصِّدِّيقَ رَضِيَ اللَّهُ عَنْهُ سَأَلَ النَّبِيَّ صلى الله عليه وسلم قَالَ‏:‏ يَا رَسُولَ اللهِ، عَلِّمْنِي مَا أَقُولُ إِذَا أَصْبَحْتُ وَإِذَا أَمْسَيْتُ، فَقَالَ‏:‏ يَا أَبَا بَكْرٍ، قُلِ‏:‏ اللَّهُمَّ فَاطِرَ السَّمَاوَاتِ وَالأَرْضِ، عَالِمَ الْغَيْبِ وَالشَّهَادَةِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي، وَشَرِّ الشَّيْطَانِ وَشِرْكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءًا أَوْ أَجُرُّهُ إِلَى مُسْلِمٍ‏.‏","english":{"narrator":"Abu Rashid al-Hubrani said, \"I came to 'Abdullah ibn 'Umar and\nasked him to relate to us what he had heard from the Messenger of Allah,\nmay Allah bless him and grant him peace. He handed me a paper and said,\n'This is what the Prophet, may Allah bless him and grant him peace, wrote\nfor me.' I looked at it and it read:","text":"'Abu Bakr as-Siddiq asked the Prophet,\nmay Allah bless him and grant him peace, \"Messenger of Allah, teach me\nwhat to say in the mornings and evenings.\" He said, \"Abu Bakr, say, 'O\nAllah, the Creator of the heavens and the earth, the Knower of the Unseen\nand Visible. the Lord of all things and their Master. I seek refuge with\nYou from the evil of shaytan and his encouragement to associate and that\nI bring evil on myself or bring it on another Muslim.'\"'\""}}],"chapter":{"id":49,"bookId":15,"arabic":"كتاب الصباح والمساء","english":"Mornings and evenings"}}