{"metadata":{"length":17,"arabic":{"title":"الأدب المفرد","author":"الإمام محمد بن إسماعيل البخاري","introduction":"كتاب رعاية الأولاد"},"english":{"title":"Al-Adab Al-Mufrad","author":"Imam Muhammad ibn Ismail al-Bukhari","introduction":"Looking after children"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":5,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ صَالِحٍ قَالَ‏:‏ حَدَّثَنِي اللَّيْثُ قَالَ‏:‏ كَتَبَ إِلَيَّ هِشَامٌ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ‏:‏ قَالَ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ يَوْمًا‏:‏ وَاللَّهِ مَا عَلَى وَجْهِ الأَرْضِ رَجُلٌ أَحَبَّ إِلَيَّ مِنْ عُمَرَ، فَلَمَّا خَرَجَ رَجَعَ فَقَالَ‏:‏ كَيْفَ حَلَفْتُ أَيْ بُنَيَّةُ‏؟‏ فَقُلْتُ لَهُ، فَقَالَ‏:‏ أَعَزُّ عَلَيَّ، وَالْوَلَدُ أَلْوَطُ‏.‏","english":{"narrator":"","text":"'A'isha said, \"Abu Bakr said, 'By Allah, there is no man on the face\nof the earth that I love better than 'Umar.' Then he went out and came back\nand said, 'How did I swear, daughter?' I told him what he had said. Then\nhe said, 'He is dearer to me although one's child is closer (to one's heart).'\""}},{"id":2,"idInBook":2,"chapterId":5,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى، قَالَ‏:‏ حَدَّثَنَا مَهْدِيُّ بْنُ مَيْمُونٍ، قَالَ‏:‏ حَدَّثَنَا ابْنُ أَبِي يَعْقُوبَ، عَنِ ابْنِ أَبِي نُعْمٍ قَالَ‏:‏ كُنْتُ شَاهِدًا ابْنَ عُمَرَ إِذْ سَأَلَهُ رَجُلٌ عَنْ دَمِ الْبَعُوضَةِ‏؟‏ فَقَالَ‏:‏ مِمَّنْ أَنْتَ‏؟‏ فَقَالَ‏:‏ مِنْ أَهْلِ الْعِرَاقِ، فَقَالَ‏:‏ انْظُرُوا إِلَى هَذَا، يَسْأَلُنِي عَنْ دَمِ الْبَعُوضَةِ، وَقَدْ قَتَلُوا ابْنَ النَّبِيِّ صلى الله عليه وسلم، سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ‏:‏ هُمَا رَيْحَانَيَّ مِنَ الدُّنْيَا‏.‏","english":{"narrator":"","text":"Ibn Abi Nu'm said, \"I was with Ibn 'Umar when a man asked him about the\nblood of gnats. He asked, 'Where are you from?' 'From the people of Iraq,'\nhe replied. He said, 'Look at this man! He asks about the blood of gnats\nwhen they murdered the grandson of the Prophet, may Allah bless him and grant\nhim peace! I heard the Prophet, may Allah bless him and grant him peace,\nsay, 'They are my sweet basil in this world.'\""}},{"id":3,"idInBook":3,"chapterId":5,"bookId":15,"arabic":"حَدَّثَنَا أَبُو الْوَلِيدِ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، عَنْ عَدِيِّ بْنِ ثَابِتٍ قَالَ‏:‏ سَمِعْتُ الْبَرَاءَ يَقُولُ‏:‏ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم وَالْحَسَنُ صَلَوَاتُ اللهِ عَلَيْهِ عَلَى عَاتِقِهِ، وَهُوَ يَقُولُ‏:‏ اللَّهُمَّ، إِنِّي أُحِبُّهُ فَأَحِبَّهُ‏.‏","english":{"narrator":"","text":"Al-Bara' said, \"I saw the Prophet, may Allah bless him and grant him\npeace, when al-Hasan was on his shoulder. He was saying, 'O Allah, I love\nhim, so love him.'\""}},{"id":4,"idInBook":4,"chapterId":5,"bookId":15,"arabic":"حَدَّثَنَا بِشْرُ بْنُ مُحَمَّدٍ، قَالَ‏:‏ أَخْبَرَنَا عَبْدُ اللهِ، قَالَ‏:‏ أَخْبَرَنَا صَفْوَانُ بْنُ عَمْرٍو قَالَ‏:‏ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ جُبَيْرِ بْنِ نُفَيْرٍ، عَنْ أَبِيهِ قَالَ‏:‏ جَلَسْنَا إِلَى الْمِقْدَادِ بْنِ الأَسْوَدِ يَوْمًا، فَمَرَّ بِهِ رَجُلٌ فَقَالَ‏:‏ طُوبَى لِهَاتَيْنِ الْعَيْنَيْنِ اللَّتَيْنِ رَأَتَا رَسُولَ اللهِ صلى الله عليه وسلم، وَاللَّهِ لَوَدِدْنَا أَنَّا رَأَيْنَا مَا رَأَيْتَ، وَشَهِدْنَا مَا شَهِدْتَ‏.‏ فَاسْتُغْضِبَ، فَجَعَلْتُ أَعْجَبُ، مَا قَالَ إِلاَّ خَيْرًا، ثُمَّ أَقْبَلَ عَلَيْهِ فَقَالَ‏:‏ مَا يَحْمِلُ الرَّجُلُ عَلَى أَنْ يَتَمَنَّى مُحْضَرًا غَيَّبَهُ اللَّهُ عَنْهُ‏؟‏ لاَ يَدْرِي لَوْ شَهِدَهُ كَيْفَ يَكُونُ فِيهِ‏؟‏ وَاللَّهِ، لَقَدْ حَضَرَ رَسُولَ اللهِ صلى الله عليه وسلم أَقْوَامٌ كَبَّهُمُ اللَّهُ عَلَى مَنَاخِرِهِمْ فِي جَهَنَّمَ، لَمْ يُجِيبُوهُ وَلَمْ يُصَدِّقُوهُ، أَوَلاَ تَحْمَدُونَ اللَّهَ عَزَّ وَجَلَّ إِذْ أَخْرَجَكُمْ لاَ تَعْرِفُونَ إِلاَّ رَبَّكُمْ، فَتُصَدِّقُونَ بِمَا جَاءَ بِهِ نَبِيُّكُمْ صلى الله عليه وسلم، قَدْ كُفِيتُمُ الْبَلاَءَ بِغَيْرِكُمْ، وَاللَّهِ لَقَدْ بُعِثَ النَّبِيُّ صلى الله عليه وسلم عَلَى أَشَدِّ حَالٍ بُعِثَ عَلَيْهَا نَبِيٌّ قَطُّ، فِي فَتْرَةٍ وَجَاهِلِيَّةٍ، مَا يَرَوْنَ أَنَّ دِينًا أَفْضَلُ مِنْ عِبَادَةِ الأَوْثَانِ، فَجَاءَ بِفُرْقَانٍ فَرَّقَ بِهِ بَيْنَ الْحَقِّ وَالْبَاطِلِ، وَفَرَّقَ بِهِ بَيْنَ الْوَالِدِ وَوَلَدِهِ، حَتَّى إِنْ كَانَ الرَّجُلُ لَيَرَى وَالِدَهُ أَوْ وَلَدَهُ أَوْ أَخَاهُ كَافِرًا، وَقَدْ فَتْحَ اللَّهُ قُفْلَ قَلْبِهِ بِالإِيمَانِ، وَيَعْلَمُ أَنَّهُ إِنْ هَلَكَ دَخَلَ النَّارَ، فَلاَ تَقَرُّ عَيْنُهُ، وَهُوَ يَعْلَمُ أَنَّ حَبِيبَهُ فِي النَّارِ، وَأنَّهَا لِلَّتِي قَالَ اللَّهُ عَزَّ وَجَلَّ‏:‏ ‏{‏وَالَّذِينَ يَقُولُونَ رَبَّنَا هَبْ لَنَا مِنْ أَزْوَاجِنَا وَذُرِّيَّاتِنَا قُرَّةَ أَعْيُنٍ‏}‏‏.‏","english":{"narrator":"","text":"Jubayr ibn Nufayr said, \"One day we were sitting when al-Miqdad ibn al-Aswad\nwhen a man passed us. The man said, 'Blessing be to those two eyes which\nsaw the Messenger of Allah, may Allah bless him and grant him peace. By Allah,\nI wish that I had seen what you have seen and witnessed what you have witnessed!'\nThis angered al-Miqdad and that surprised me as the man had said nothing\nbut good things. Then he turned to them and said, 'What made the man desire\nto summon back what Allah has taken away? Does he not realise what his situation\nwould be if he had seen him? By Allah, if certain people had been with the\nMessenger of Allah, may Allah bless him and grant him peace, Allah would\nhave thrown them on their faces into Hellfire since they would neither have\nanswered nor confirmed him? Do you not praise Allah Almighty since He brought\nyou forth and you only know your Lord and confirm what your Prophet, may\nAllah bless him and grant him peace, brought? You see enough affliction in\nother people. By Allah, the Messenger of Allah, may Allah bless him and grant\nhim peace, was sent in the harshest state in which any Prophet was ever sent\n- in a gap (in the line of prophethood) and the time of Ignorance. They\ndid not believe that the deen was better than worshipping idols. He brought\nthe Discrimination by which it is possible to discriminate between the true\nand false, and which can part a father from his child. Then a man will think\nof his father, child or brother as an unbeliever. Allah has loosened the\nlocks of his heart by faith and he knows that the other person will be destroyed\nin the Fire. Therefore his eye is not cool since he knows that the one he\nloves will be in the Fire. It is what Allah says, \"Those who say, 'Our\nLord, give us joy in our wives and children.\" (25:74)'\""}},{"id":5,"idInBook":5,"chapterId":5,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ‏:‏ حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ قَالَ‏:‏ دَخَلْتُ عَلَى النَّبِيِّ صلى الله عليه وسلم يَوْمًا، وَمَا هُوَ إِلاَّ أَنَا وَأُمِّي وَأُمُّ حَرَامٍ خَالَتِي، إِذْ دَخَلَ عَلَيْنَا فَقَالَ لَنَا‏:‏ أَلاَ أُصَلِّي بِكُمْ‏؟‏ وَذَاكَ فِي غَيْرِ وَقْتِ صَلاَةٍ، فَقَالَ رَجُلٌ مِنَ الْقَوْمِ‏:‏ فَأَيْنَ جَعَلَ أَنَسًا مِنْهُ‏؟‏ فَقَالَ‏:‏ جَعَلَهُ عَنْ يَمِينِهِ‏؟‏ ثُمَّ صَلَّى بِنَا، ثُمَّ دَعَا لَنَا أَهْلَ الْبَيْتِ بِكُلِّ خَيْرٍ مِنْ خَيْرِ الدُّنْيَا وَالْآخِرَةِ، فَقَالَتْ أُمِّي‏:‏ يَا رَسُولَ اللهِ، خُوَيْدِمُكَ، ادْعُ اللَّهَ لَهُ، فَدَعَا لِي بِكُلِّ خَيْرٍ، كَانَ فِي آخِرِ دُعَائِهِ أَنْ قَالَ‏:‏ اللَّهُمَّ أَكْثِرْ مَالَهُ وَوَلَدَهُ، وَبَارِكْ لَهُ‏.‏","english":{"narrator":"","text":"Anas said, \"One day I visited the Prophet, may Allah bless him and grant\nhim peace, and there was only myself, my mother and my aunt, Umm Hiram. When\nhe came to us, he asked us, 'Shall I pray with you?' It was not the time\nof an obligatory prayer.\" One of those listening to the person relating this\nasked, \"Where did he put in Anas in relation to him?\" The reply was, \"He\nput him to his right.\" The report from Anas continues, \"Then he prayed with\nus and made supplication for us, the people of the house, that we would have\nthe best of the blessings of this world and the Next. My mother said, 'Messenger\nof Allah, make supplication to Allah for your little servant,' and he asked\nAllah to grant me every blessing. At the end of his supplication, he said,\n'O Allah, grant him a lot of money and many children and bless him!'\""}},{"id":6,"idInBook":6,"chapterId":5,"bookId":15,"arabic":"حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، قَالَ‏:‏ حَدَّثَنَا ابْنُ فَضَالَةَ، قَالَ‏:‏ حَدَّثَنَا بَكْرُ بْنُ عَبْدِ اللهِ الْمُزَنِيُّ، عَنْ أَنَسِ بْنِ مَالِكٍ‏:‏ جَاءَتِ امْرَأَةٌ إِلَى عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا، فَأَعْطَتْهَا عَائِشَةُ ثَلاَثَ تَمَرَاتٍ، فَأَعْطَتْ كُلَّ صَبِيٍّ لَهَا تَمْرَةً، وَأَمْسَكَتْ لِنَفْسِهَا تَمْرَةً، فَأَكَلَ الصِّبْيَانُ التَّمْرَتَيْنِ وَنَظَرَا إِلَى أُمِّهِمَا، فَعَمَدَتْ إِلَى التَّمْرَةِ فَشَقَّتْهَا، فَأَعْطَتْ كُلَّ صَبِيٍّ نِصْفَ تَمْرَةٍ، فَجَاءَ النَّبِيُّ صلى الله عليه وسلم فَأَخْبَرَتْهُ عَائِشَةُ فَقَالَ‏:‏ وَمَا يُعْجِبُكِ مِنْ ذَلِكَ‏؟‏ لَقَدْ رَحِمَهَا اللَّهُ بِرَحْمَتِهَا صَبِيَّيْهَا‏.‏","english":{"narrator":"","text":"Anas ibn Malik said, \"A woman came to 'A'isha and 'A'isha gave her three\ndates. She gave each of her two children a date and kept one date for herself.\nThe children ate the two dates and then looked at their mother. She took\nher date and split it into two and gave each child a half of it. The Prophet,\nmay Allah bless him and grant him peace, came and 'A'isha told him about\nit. He said, 'Are you surprised at that? Allah will show her mercy because\nof her mercy towards her child.'\""}},{"id":7,"idInBook":7,"chapterId":5,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنْ هِشَامٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ‏:‏ جَاءَ أَعْرَابِيٌّ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ‏:‏ أَتُقَبِّلُونَ صِبْيَانَكُمْ‏؟‏ فَمَا نُقَبِّلُهُمْ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ أَوَ أَمْلِكُ لَكَ أَنْ نَزَعَ اللَّهُ مِنْ قَلْبِكَ الرَّحْمَةَ‏؟‏‏.‏","english":{"narrator":"","text":"'A'isha said, \"A bedouin came to the Prophet, may Allah bless him and\ngrant him peace, and asked, \"Do you kiss your children? We do not kiss them.'\nThe Prophet, may Allah bless him and grant him peace, said, 'Can I put mercy\nin your hearts after Allah has removed it from them?'\""}},{"id":8,"idInBook":8,"chapterId":5,"bookId":15,"arabic":"حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ‏:‏ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ‏:‏ حَدَّثَنَا أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ أَبَا هُرَيْرَةَ قَالَ‏:‏ قَبَّلَ رَسُولُ اللهِ صلى الله عليه وسلم حَسَنَ بْنَ عَلِيٍّ وَعِنْدَهُ الأَقْرَعُ بْنُ حَابِسٍ التَّمِيمِيُّ جَالِسٌ، فَقَالَ الأَقْرَعُ‏:‏ إِنَّ لِي عَشَرَةً مِنَ الْوَلَدِ مَا قَبَّلْتُ مِنْهُمْ أَحَدًا، فَنَظَرَ إِلَيْهِ رَسُولُ اللهِ صلى الله عليه وسلم ثُمَّ قَالَ‏:‏ مَنْ لا يَرْحَمُ لا يُرْحَمُ‏.‏","english":{"narrator":"","text":"Abu Hurayra said, \"The Messenger of Allah, may Allah bless him and grant\nhim peace, kissed Hasan ibn 'Ali while al-Aqra' ibn Habis at-Tamimi was sitting\nwith him. Al-Aqra' observed, 'I have ten children and I have never kissed any of\nthem.' The Messenger of Allah, may Allah bless him and grant him peace, looked\nat him and said, 'Whoever does not show mercy will not be shown mercy.'\""}},{"id":9,"idInBook":9,"chapterId":5,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْعَزِيزِ، قَالَ‏:‏ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، عَنِ الْوَلِيدِ بْنِ نُمَيْرِ بْنِ أَوْسٍ، أَنَّهُ سَمِعَ أَبَاهُ يَقُولُ‏:‏ كَانُوا يَقُولُونَ‏:‏ الصَّلاَحُ مِنَ اللهِ، وَالأَدَبُ مِنَ الآبَاءِ‏.‏","english":{"narrator":"","text":"Numayr ibn Aws said, \"They used to say, 'Correct action is a gift from\nAllah, but adab comes from the parents.\""}},{"id":10,"idInBook":10,"chapterId":5,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، قَالَ‏:‏ أَخْبَرَنَا عَبْدُ الأَعْلَى بْنُ عَبْدِ الأَعْلَى الْقُرَشِيُّ، عَنْ دَاوُدَ بْنِ أَبِي هِنْدَ، عَنْ عَامِرٍ، أَنَّ النُّعْمَانَ بْنَ بَشِيرٍ حَدَّثَهُ، أَنَّ أَبَاهُ انْطَلَقَ بِهِ إِلَى رَسُولِ اللهِ صلى الله عليه وسلم يَحْمِلُهُ فَقَالَ‏:‏ يَا رَسُولَ اللهِ، إِنِّي أُشْهِدُكَ أَنِّي قَدْ نَحَلْتُ النُّعْمَانَ كَذَا وَكَذَا، فَقَالَ‏:‏ أَكُلَّ وَلَدَكَ نَحَلْتَ‏؟‏ قَالَ‏:‏ لاَ، قَالَ‏:‏ فَأَشْهِدْ غَيْرِي، ثُمَّ قَالَ‏:‏ أَلَيْسَ يَسُرُّكَ أَنْ يَكُونُوا فِي الْبِرِّ سَوَاءً‏؟‏ قَالَ‏:‏ بَلَى، قَالَ‏:‏ فَلاَ إِذًا‏.‏","english":{"narrator":"","text":"An-Nu'man ibn Bashir said that his father had carried him to the Messenger\nof Allah, may Allah bless him and grant him peace. He said, 'Messenger of\nAllah, I testify to you that I have given an-Nu'man such-and-such. (It was\na slave). The Prophet asked, \"Have you given each of your children the same\"?\"\n\"No,\" he replied. He said, \"Then testify to someone other than me.\" Then\nthe Prophet asked, \"Do you not want to show equal kindness to all of them?\"\n\"Indeed I do,\" he replied. He said, \"Then do not do it.\""}},{"id":11,"idInBook":11,"chapterId":5,"bookId":15,"arabic":"حَدَّثَنَا ابْنُ مَخْلَدٍ، عَنْ عِيسَى بْنِ يُونُسَ، عَنِ الْوَصَّافِيِّ، عَنْ مُحَارِبِ بْنِ دِثَارٍ، عَنِ ابْنِ عُمَرَ قَالَ‏:‏ إِنَّمَا سَمَّاهُمُ اللَّهُ أَبْرَارًا، لأَنَّهُمْ بَرُّوا الْآبَاءَ وَالأَبْنَاءَ، كَمَا أَنَّ لِوَالِدِكَ عَلَيْكَ حَقًّا، كَذَلِكَ لِوَلَدِكَ عَلَيْكَ حَقٌّ‏.‏","english":{"narrator":"","text":"Ibn 'Umar said, \"Allah has called them the 'dutiful' (al-Abrar) because\nthey are dutiful (birr) to their parents and children. Just as you have a\nduty which you owe your parent, so you have a duty which you owe your child.\""}},{"id":12,"idInBook":12,"chapterId":5,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاءِ، قَالَ‏:‏ حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ، عَنْ شَيْبَانَ، عَنْ فِرَاسٍ، عَنْ عَطِيَّةَ، عَنْ أَبِي سَعِيدٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ مَنْ لاَ يَرْحَمُ لاَ يُرْحَمُ‏.‏","english":{"narrator":"Abu Sa'id said that the Prophet (may Allah bless him and grant him peace) said:","text":"'Someone who does not show mercy will not be shown mercy.'"}},{"id":13,"idInBook":13,"chapterId":5,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلامٍ، قَالَ‏:‏ أَخْبَرَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ زَيْدِ بْنِ وَهْبٍ، وَأَبِي ظَبْيَانَ، عَنْ جَرِيرِ بْنِ عَبْدِ اللهِ قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ لاَ يَرْحَمُ اللَّهُ مَنْ لا يَرْحَمُ النَّاسَ‏.‏","english":{"narrator":"","text":"Jarir ibn 'Abdullah said, \"The Messenger of Allah, may Allah bless him\nand grant him peace, said, 'Allah will not show mercy to someone who does\nnot show mercy to people.\""}},{"id":14,"idInBook":14,"chapterId":5,"bookId":15,"arabic":"وَعَنْ عَبْدَةَ، عَنِ ابْنِ أَبِي خَالِدٍ، عَنْ قَيْسٍ، عَنْ جَرِيرِ بْنِ عَبْدِ اللهِ قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ مَنْ لاَ يَرْحَمُ النَّاسَ لا يَرْحَمُهُ اللَّهُ‏.‏","english":{"narrator":"","text":"Same as 97."}},{"id":15,"idInBook":15,"chapterId":5,"bookId":15,"arabic":"وَعَنْ عَبْدَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ‏:‏ أَتَى النَّبِيَّ صلى الله عليه وسلم نَاسٌ مِنَ الأعْرَابِ، فَقَالَ لَهُ رَجُلٌ مِنْهُمْ‏:‏ يَا رَسُولَ اللهِ، أَتُقَبِّلُونَ الصِّبْيَانَ، فَوَاللَّهِ مَا نُقَبِّلُهُمْ، فَقَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ أَوَ أَمْلِكُ إِنْ كَانَ اللَّهُ عَزَّ وَجَلَّ نَزَعَ مِنْ قَلْبِكَ الرَّحْمَةَ‏؟‏‏.‏","english":{"narrator":"","text":"'A'isha said, \"Some bedouins came to the Prophet, may Allah bless him\nand grant him peace. One of their men said to him, 'Messenger of Allah, do\nyou kiss children? By Allah, we do not kiss them.' The Messenger of Allah,\nmay Allah bless him and grant him peace, said, 'Can I put mercy in your hearts\nafter Allah has removed it from them?'\""}},{"id":16,"idInBook":16,"chapterId":5,"bookId":15,"arabic":"حَدَّثَنَا أَبُو النُّعْمَانِ، قَالَ‏:‏ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَاصِمٍ، عَنْ أَبِي عُثْمَانَ، أَنَّ عُمَرَ رَضِيَ اللَّهُ عَنْهُ اسْتَعْمَلَ رَجُلاً، فَقَالَ الْعَامِلُ‏:‏ إِنَّ لِي كَذَا وَكَذَا مِنَ الْوَلَدِ، مَا قَبَّلْتُ وَاحِدًا مِنْهُمْ، فَزَعَمَ عُمَرُ، أَوْ قَالَ عُمَرُ‏:‏ إِنَّ اللَّهَ عَزَّ وَجَلَّ لاَ يَرْحَمُ مِنْ عِبَادِهِ إِلاَّ أَبَرَّهُمْ‏.‏","english":{"narrator":"","text":"Abu 'Uthman reported that 'Umar wanted to appoint a man as governor.\nThe governor said, \"I have such-and-such a number of children and I have\nnever kissed any of them.\" 'Umar said, \"Allah Almighty will only show mercy\nto the kindest of His slaves.\""}},{"id":17,"idInBook":17,"chapterId":5,"bookId":15,"arabic":"حَدَّثَنَا الْحَكَمُ بْنُ نَافِعٍ، قَالَ‏:‏ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ‏:‏ أَخْبَرَنَا سَعِيدُ بْنُ الْمُسَيِّبِ، أَنَّ أَبَا هُرَيْرَةَ قَالَ‏:‏ سَمِعْتُ رَسُولَ اللهِ صلى الله عليه وسلم يَقُولُ‏:‏ جَعَلَ اللَّهُ عَزَّ وَجَلَّ الرَّحْمَةَ مِئَةَ جُزْءٍ، فَأَمْسَكَ عِنْدَهُ تِسْعَةً وَتِسْعِينَ، وَأَنْزَلَ فِي الأَرْضِ جُزْءًا وَاحِدًا، فَمِنْ ذَلِكَ الْجُزْءِ يَتَرَاحَمُ الْخَلْقُ، حَتَّى تَرْفَعَ الْفَرَسُ حَافِرَهَا عَنْ وَلَدِهَا، خَشْيَةَ أَنْ تُصِيبَهُ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Messenger of Allah, may Allah bless him\nand grant him peace, said, \"Allah Almighty has divided mercy into one hundred\nparts. He kept ninety-nine parts and sent down one part to earth. Because\nof that one single part, creatures are merciful to one another so that even\nthe mare will lift its hooves away from its foal so that it does not trample\non it.\""}}],"chapter":{"id":5,"bookId":15,"arabic":"كتاب رعاية الأولاد","english":"Looking after children"}}