{"metadata":{"length":27,"arabic":{"title":"الأدب المفرد","author":"الإمام محمد بن إسماعيل البخاري","introduction":"كتاب النوم والمبيت"},"english":{"title":"Al-Adab Al-Mufrad","author":"Imam Muhammad ibn Ismail al-Bukhari","introduction":"Sleep and night lodging"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":50,"bookId":15,"arabic":"حَدَّثَنَا قَبِيصَةُ، وَأَبُو نُعَيْمٍ، قَالاَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ رِبْعِيِّ بْنِ حِرَاشٍ، عَنْ حُذَيْفَةَ قَالَ‏:‏ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا أَرَادَ أَنْ يَنَامَ قَالَ‏:‏ بِاسْمِكَ اللَّهُمَّ أَمُوتُ وَأَحْيَا، وَإِذَا اسْتَيْقَظَ مِنْ مَنَامِهِ قَالَ‏:‏ الْحَمْدُ لِلَّهِ الَّذِي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا وَإِلَيْهِ النُّشُورُ‏.‏","english":{"narrator":"","text":"Hudhayfa said, \"When the Prophet, may Allah bless him and grant\nhim peace, wanted to go to sleep, he said, 'By Your Name, O Allah, I die\nand live.' When he woke up, he said, 'Praise be to Allah who gave us life\nafter He made us die, and to Him is the gathering.'\""}},{"id":2,"idInBook":2,"chapterId":50,"bookId":15,"arabic":"حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، قَالَ‏:‏ حَدَّثَنَا حَمَّادٌ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ قَالَ‏:‏ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا أَوَى إِلَى فِرَاشِهِ قَالَ‏:‏ الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنَا وَسَقَانَا، وَكَفَانَا وَآوَانَا، كَمْ مَنْ لا كَافٍّ لَهُ وَلا مُؤْوِيَ‏.‏","english":{"narrator":"","text":"Anas said, \"When the Prophet, may Allah bless him and grant him\npeace, went to bed, he said, 'Praise be to Allah who has given us food\nand drink, and given us enough and given us refuge. How many people have\nneither enough nor refuge!'\""}},{"id":3,"idInBook":3,"chapterId":50,"bookId":15,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، وَيَحْيَى بْنُ مُوسَى، قَالاَ‏:‏ حَدَّثَنَا شَبَابَةُ بْنُ سَوَّارٍ قَالَ‏:‏ حَدَّثَنِي الْمُغِيرَةُ بْنُ مُسْلِمٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ قَالَ‏:‏ كَانَ رَسُولُ اللهِ صلى الله عليه وسلم لاَ يَنَامُ حَتَّى يَقْرَأَ‏:‏ ‏{‏الم تَنْزِيلُ‏}‏ وَ‏:‏ ‏{‏تَبَارَكَ الَّذِي بِيَدِهِ الْمُلْكُ‏}‏‏.‏","english":{"narrator":"","text":"Jabir said, \"The Messenger of Allah, may Allah bless him and grant\nhim peace, did not sleep until he had recited, 'Alif-Lam-Mim. The Sending-down'\n(32) and 'Blessed is the One in whose hand the kingdom is' (67).'\""}},{"id":4,"idInBook":4,"chapterId":50,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ مَحْبُوبٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْوَاحِدِ، قَالَ‏:‏ حَدَّثَنَا عَاصِمٌ الأَحْوَلُ، عَنْ شُمَيْطٍ، أَوْ سُمَيْطٍ، عَنْ أَبِي الأَحْوَصِ قَالَ‏:‏ قَالَ عَبْدُ اللهِ‏:‏ النَّوْمُ عِنْدَ الذِّكْرِ مِنَ الشَّيْطَانِ، إِنْ شِئْتُمْ فَجَرِّبُوا، إِذَا أَخَذَ أَحَدُكُمْ مَضْجَعَهُ وَأَرَادَ أَنْ يَنَامَ فَلْيَذْكُرِ اللَّهَ عَزَّ وَجَلَّ‏.‏","english":{"narrator":"","text":"'Abdullah said, \"Going to sleep during dhikr comes from Shaytan.\nif you like, you can put it to the test. When one of you goes to bed and\nwants to go to sleep. he should mention Allah Almighty.\""}},{"id":5,"idInBook":5,"chapterId":50,"bookId":15,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنْ لَيْثٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ قَالَ‏:‏ كَانَ النَّبِيُّ صلى الله عليه وسلم لاَ يَنَامُ حَتَّى يَقْرَأَ‏:‏ تَبَارَكَ وَ ‏{‏الم تَنْزِيلُ‏}‏ السَّجْدَةِ‏.‏","english":{"narrator":"","text":"Jabir said, \"The Prophet, may Allah bless him and grant him peace,\ndid not go to sleep until he had recited 'Blessed' (67) and 'Alif-Lam-Mim.\nThe Sending-down' (32).\""}},{"id":6,"idInBook":6,"chapterId":50,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، قَالَ‏:‏ أَخْبَرَنَا عَبْدَةُ، عَنْ عُبَيْدِ اللهِ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ إِذَا أَوَى أَحَدُكُمْ إِلَى فِرَاشِهِ، فَلْيَحِلَّ دَاخِلَةَ إِزَارِهِ، فَلْيَنْفُضْ بِهَا فِرَاشَهُ، فَإِنَّهُ لاَ يَدْرِي مَا خَلَّفَ فِي فِرَاشِهِ، وَلْيَضْطَجِعْ عَلَى شِقِّهِ الأَيْمَنِ، وَلْيَقُلْ‏:‏ بِاسْمِكَ وَضَعْتُ جَنْبِي، فَإِنِ احْتَبَسَتْ نَفْسِي فَارْحَمْهَا، وَإِنْ أَرْسَلْتَهَا فَاحْفَظْهَا بِمَا تَحْفَظُ بِهِ الصَّالِحِينَ، أَوْ قَالَ‏:‏ عِبَادَكَ الصَّالِحِينَ‏.‏","english":{"narrator":"","text":"Abu Hurayra said, \"The Messenger of Allah, may Allah bless him\nand grant him peace, said, 'When one of you goes to bed, he should undo\nthe inside of his lower garment and dust the bed with it. He does not know\nwhat has come on his bed since he left it. He should lie down on his right\nside and say, 'In Your Name I have laid down on my side. If You take my\nsoul, then have mercy on it. If You release it, then preserve it in the\nmanner in which You preserve the men of right action.\""}},{"id":7,"idInBook":7,"chapterId":50,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ سَعِيدٍ، أَبُو سَعِيدٍ الأَشَجُّ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ اللهِ بْنُ سَعِيدِ بْنِ خَازِمٍ أَبُو بَكْرٍ النَّخَعِيُّ، قَالَ‏:‏ أَخْبَرَنَا الْعَلاَءُ بْنُ الْمُسَيَّبِ، عَنْ أَبِيهِ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ قَالَ‏:‏ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا أَوَى إِلَى فِرَاشِهِ نَامَ عَلَى شِقِّهِ الأَيْمَنِ، ثُمَّ قَالَ‏:‏ اللَّهُمَّ وَجَّهْتُ وَجْهِي إِلَيْكَ، وَأَسْلَمْتُ نَفْسِي إِلَيْكَ، وَأَلْجَأْتُ ظَهْرِي إِلَيْكَ، رَهْبَةً وَرَغْبَةً إِلَيْكَ، لاَ مَنْجَا وَلاَ مَلْجَأَ مِنْكَ إِلاَّ إِلَيْكَ، آمَنْتُ بِكِتَابِكَ الَّذِي أَنْزَلْتَ، وَنَبِيِّكَ الَّذِي أَرْسَلْتَ، قَالَ‏:‏ فَمَنْ قَالَهُنَّ فِي لَيْلَةٍ ثُمَّ مَاتَ مَاتَ عَلَى الْفِطْرَةِ‏.‏","english":{"narrator":"","text":"Al-Bara' ibn 'Azib said, \"When the Prophet, may Allah bless him\nand grant him peace, went to bed, he laid down on his right side. Then\nhe said, 'O Allah, I have turned my face to You and I have surrendered\nmy self to You and I have committed my back to You out of fear and desire\nfor You. There is no place of safety or refuge from You except with You.\nI have believed in Your book which You revealed and Your Prophet whom You\nsent.' He said, 'Whoever says it at night and then dies, dies in fitra\n(natural state).'\""}},{"id":8,"idInBook":8,"chapterId":50,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ‏:‏ حَدَّثَنَا وُهَيْبٌ، قَالَ‏:‏ حَدَّثَنَا سُهَيْلُ بْنُ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ كَانَ رَسُولُ اللهِ صلى الله عليه وسلم يَقُولُ إِذَا أَوَى إِلَى فِرَاشِهِ‏:‏ اللَّهُمَّ رَبَّ السَّمَاوَاتِ وَالأَرْضِ، وَرَبَّ كُلِّ شَيْءٍ، فَالِقَ الْحَبِّ وَالنَّوَى، مُنْزِلَ التَّوْرَاةِ وَالإِنْجِيلِ وَالْقُرْآنِ، أَعُوذُ بِكَ مِنْ كُلِّ ذِي شَرٍّ أَنْتَ آخِذٌ بِنَاصِيَتِهِ، أَنْتَ الأَوَّلُ فَلَيْسَ قَبْلَكَ شَيْءٌ، وَأَنْتَ الْآخِرُ فَلَيْسَ بَعْدَكَ شَيْءٌ، وَأَنْتَ الظَّاهِرُ فَلَيْسَ فَوْقَكَ شَيْءٌ، وَأَنْتَ الْبَاطِنُ فَلَيْسَ دُونَكَ شَيْءٌ، اقْضِ عَنِّي الدَّيْنَ، وَأَغْنِنِي مِنَ الْفَقْرِ‏.‏","english":{"narrator":"","text":"Abu Hurayra said, \"The Messenger of Allah, may Allah bless him\nand grant him peace, used to say when he went to bed, 'O Allah, Lord of\nthe heavens and the earth, and Lord of all things, Splitter of the grain\nand seeds, the One who sent down the Torah, the Gospel and the Qur'an!\nI seek refuge with You from every evil. You take by the forelock. You are\nthe Outward, and there is nothing above You. You are the Inward and there\nis nothing below You. Pay my debts for me and keep me safe from poverty.'\""}},{"id":9,"idInBook":9,"chapterId":50,"bookId":15,"arabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، قَالَ‏:‏ حَدَّثَنَا الْعَلاَءُ بْنُ الْمُسَيَّبِ قَالَ‏:‏ حَدَّثَنِي أَبِي، عَنِ الْبَرَاءِ بْنِ عَازِبٍ قَالَ‏:‏ كَانَ رَسُولُ اللهِ صلى الله عليه وسلم إِذَا أَوَى إِلَى فِرَاشِهِ نَامَ عَلَى شِقِّهِ الأَيْمَنِ، ثُمَّ قَالَ‏:‏ اللَّهُمَّ أَسْلَمْتُ نَفْسِي إِلَيْكَ، وَوَجَّهْتُ بِوَجْهِي إِلَيْكَ، وَفَوَّضْتُ أَمْرِي إِلَيْكَ، وَأَلْجَأْتُ ظَهْرِي إِلَيْكَ، رَغْبَةً وَرَهْبَةً إِلَيْكَ، لاَ مَنْجَا وَلاَ مَلْجَأَ مِنْكَ إِلاَّ إِلَيْكَ، آمَنْتُ بِكِتَابِكَ الَّذِي أَنْزَلْتَ، وَنَبِيِّكَ الَّذِي أَرْسَلْتَ، قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ مَنْ قَالَهُنَّ ثُمَّ مَاتَ تَحْتَ لَيْلَتِهِ مَاتَ عَلَى الْفِطْرَةِ‏.‏","english":{"narrator":"","text":"Similar to 1211."}},{"id":10,"idInBook":10,"chapterId":50,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ‏:‏ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ حَجَّاجٍ الصَّوَّافِ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ قَالَ‏:‏ إِذَا دَخَلَ الرَّجُلُ بَيْتَهُ أَوْ أَوَى إِلَى فِرَاشِهِ ابْتَدَرَهُ مَلَكٌ وَشَيْطَانٌ، فَقَالَ الْمَلَكُ‏:‏ اخْتِمْ بِخَيْرٍ، وَقَالَ الشَّيْطَانُ‏:‏ اخْتِمْ بِشَرٍّ، فَإِنْ حَمِدَ اللَّهَ وَذَكَرَهُ أَطْرَدَهُ، وَبَاتَ يَكْلَؤُهُ، فَإِذَا اسْتَيْقَظَ ابْتَدَرَهُ مَلَكٌ وَشَيْطَانٌ فَقَالاَ مِثْلَهُ، فَإِنْ ذَكَرَ اللَّهَ وَقَالَ‏:‏ الْحَمْدُ لِلَّهِ الَّذِي رَدَّ إِلَيَّ نَفْسِي بَعْدَ مَوْتِهَا وَلَمْ يُمِتْهَا فِي مَنَامِهَا، الْحَمْدُ لِلَّهِ الَّذِي ‏{‏يُمْسِكُ السَّمَوَاتِ وَالأَرْضَ أَنْ تَزُولاَ، وَلَئِنْ زَالَتَا إِنْ أَمْسَكَهُمَا مِنْ أَحَدٍ مِنْ بَعْدِهِ إِنَّهُ كَانَ حَلِيمًا غَفُورًا‏}‏، الْحَمْدُ لِلَّهِ الَّذِي ‏{‏يُمْسِكُ السَّمَاءَ أَنْ تَقَعَ عَلَى الأَرْضِ إِلاَّ بِإِذْنِهِ‏}‏ إِلَى ‏{‏لَرَءُوفٌ رَحِيمٌ‏}‏، فَإِنْ مَاتَ مَاتَ شَهِيدًا، وَإِنْ قَامَ فَصَلَّى صَلَّى فِي فَضَائِلَ‏.‏","english":{"narrator":"Jabir said:","text":"\"When a man enters his house or goes to bed, an angel\nand shaytan hasten to him. The angel says, 'Seal it with good!' The Shaytan\nsays, 'Seal it with evil.' If he praises Allah and remembers Him, he chases\nthe shaytan away and spends the night with him guarding him. When he wakes\nup, the angel and shaytan hasten to him and say the same thing. If he mentions\nAllah and says, 'Praise be to Allah, who keeps firm hold of the heavens\nand earth, preventing them from vanishing away. And if they vanished no\none could then keep hold of them. Certainly He is Most Forbearing, Ever-Forgiving.'\n(35:41)\nPraise be to Allah who holds back the sky preventing it from falling\non the earth, except by His permission. Allah is All-Compassionate to mankind,\nMost Merciful.' (22:63) If he dies, he dies a martyr, If he gets up\nand prays, he prays in virtue.'\""}},{"id":11,"idInBook":11,"chapterId":50,"bookId":15,"arabic":"حَدَّثَنَا قَبِيصَةُ بْنُ عُقْبَةَ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ قَالَ‏:‏ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا أَرَادَ أَنْ يَنَامَ وَضَعَ يَدَهُ تَحْتَ خَدِّهِ الأَيْمَنِ، وَيَقُولُ‏:‏ اللَّهُمَّ قِنِي عَذَابَكَ يَوْمَ تَبْعَثُ عِبَادَكَ‏.‏","english":{"narrator":"","text":"Al-Bara' said, \"When the Prophet, may Allah bless him and grant\nhim peace, wanted to go to sleep, he put his hand under his right cheek\nand said, 'O Allah, protect me from Your punishment on the Day you raise\nup Your slaves.'\""}},{"id":12,"idInBook":12,"chapterId":50,"bookId":15,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنْ عَطَاءٍ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللهِ بْنِ عَمْرٍو، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ خَلَّتَانِ لاَ يُحْصِيهِمَا رَجُلٌ مُسْلِمٌ إِلاَّ دَخَلَ الْجَنَّةَ، وَهُمَا يَسِيرٌ، وَمَنْ يَعْمَلُ بِهِمَا قَلِيلٌ، قِيلَ‏:‏ وَمَا هُمَا يَا رَسُولَ اللهِ‏؟‏ قَالَ‏:‏ يُكَبِّرُ أَحَدُكُمْ فِي دُبُرِ كُلِّ صَلاَةٍ عَشْرًا، وَيَحْمَدُ عَشْرًا، وَيُسَبِّحُ عَشْرًا، فَذَلِكَ خَمْسُونَ وَمِئَةٌ عَلَى اللِّسَانِ، وَأَلْفٌ وَخَمْسُمِئَةٍ فِي الْمِيزَانِ، فَرَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يَعُدُّهُنَّ بِيَدِهِ‏.‏ وَإِذَا أَوَى إِلَى فِرَاشِهِ سَبَّحَهُ وَحَمِدَهُ وَكَبَّرَهُ، فَتِلْكَ مِئَةٌ عَلَى اللِّسَانِ، وَأَلْفٌ فِي الْمِيزَانِ، فَأَيُّكُمْ يَعْمَلُ فِي الْيَوْمِ وَاللَّيْلَةِ أَلْفَيْنِ وَخَمْسَمِئَةِ سَيِّئَةٍ‏؟‏ قِيلَ‏:‏ يَا رَسُولَ اللهِ، كَيْفَ لاَ يُحْصِيهِمَا‏؟‏ قَالَ‏:‏ يَأْتِي أَحَدَكُمُ الشَّيْطَانُ فِي صَلاَتِهِ، فَيُذَكِّرُهُ حَاجَةَ كَذَا وَكَذَا، فَلا يَذْكُرُهُ‏.‏","english":{"narrator":"","text":"'Abdullah ibn 'Amr reported that the Prophet, may Allah bless\nhim and grant him peace, said, \"If a Muslim man persists in two actions,\nhe will enter the Garden. They are easy, but those who do them are few.'\nHe was asked, 'What are they, may Allah bless him and grant him peace?'\nHe said, 'That you say \"Allahu akbar\" ten times, \"al-hamdu lillah\"\nten times, and \"Subhana'llah\" ten times after every prayer.\nThat is 150 on the tongue and 1500 in the balance.' I saw the Prophet,\nmay Allah bless him and grant him peace, counting them with his hand. Then\nhe said, 'When you go to bed, you should say, \"Subhana'llah\", \"al-hamdu\nlillah\", and \"Allahu akbar\". That is 100 on the tongue and 1000\nin the balance. Who among you can do 2500 bad actions morning and night?'\nHe was asked, 'Messenger of Allah, how is it that they are not counted?'\nHe said, 'Shaytan comes to one of you while he is praying and reminds him\nof something he has to do such-and-such and such-and-such, so he does not\nremember to do it.'\""}},{"id":13,"idInBook":13,"chapterId":50,"bookId":15,"arabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، قَالَ‏:‏ حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ، عَنْ عُبَيْدِ اللهِ قَالَ‏:‏ حَدَّثَنِي سَعِيدٌ الْمَقْبُرِيُّ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ قَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ إِذَا أَوَى أَحَدُكُمْ إِلَى فِرَاشِهِ فَلْيَأْخُذْ دَاخِلَةَ إِزَارِهِ، فَلْيَنْفُضْ بِهَا فِرَاشَهُ وَلْيُسَمِّ اللَّهَ، فَإِنَّهُ لاَ يَعْلَمُ مَا خَلَّفَهُ بَعْدَهُ عَلَى فِرَاشِهِ، فَإِذَا أَرَادَ أَنْ يَضْطَجِعَ فَلْيَضْطَجِعْ عَلَى شِقِّهِ الأَيْمَنِ وَلْيَقُلْ‏:‏ سُبْحَانَكَ رَبِّي، بِكَ وَضَعْتُ جَنْبِي، وَبِكَ أَرْفَعُهُ، إِنْ أَمْسَكْتَ نَفْسِي فَاغْفِرْ لَهَا، وَإِنْ أَرْسَلْتَهَا فَاحْفَظْهَا بِمَا تَحْفَظُ بِهِ عِبَادَكَ الصَّالِحِينَ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"When one of you goes to bed, he should dust his\nbed with the inside of his lower garment. he should say, 'In the Name of\nAllah.' He does not know what might have come on it after he left it. If\nhe wants to lie down, he should lie down on his right side and say, 'Glory\nbe to You, my Lord, I have laid down on my side by You and I raise it up\nby You. If you take my soul, then forgive it. If you release it, then guard\nover it as You guard over Your righteous slaves.'\""}},{"id":14,"idInBook":14,"chapterId":50,"bookId":15,"arabic":"حَدَّثَنَا مُعَاذُ بْنُ فَضَالَةَ، قَالَ‏:‏ حَدَّثَنَا هِشَامٌ الدَّسْتُوَائِيُّ، عَنْ يَحْيَى هُوَ ابْنُ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ قَالَ‏:‏ حَدَّثَنِي رَبِيعَةُ بْنُ كَعْبٍ قَالَ‏:‏ كُنْتُ أَبِيتُ عِنْدَ بَابِ النَّبِيِّ صلى الله عليه وسلم فَأُعْطِيهِ وَضُوءَهُ، قَالَ‏:‏ فَأَسْمَعُهُ الْهَوِيَّ مِنَ اللَّيْلِ يَقُولُ‏:‏ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ، وَأَسْمَعُهُ الْهَوِيَّ مِنَ اللَّيْلِ يَقُولُ‏:‏ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ‏.‏","english":{"narrator":"","text":"Rabi'a ibn Ka'b related, \"I used to spend the night at the door\nof the Prophet, may Allah bless him and grant him peace, and I would give\nhim his wudu' water.\" He said, \"After a long period of the night had passed,\nI heard him say, 'Allah hears whoever praises Him,' and I heard him say\nafter a long period of the night had passed, 'Praise be to Allah, Lord\nof the Worlds.'\""}},{"id":15,"idInBook":15,"chapterId":50,"bookId":15,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ إِشْكَابَ، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، عَنْ لَيْثٍ، عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ مَنْ نَامَ وَبِيَدِهِ غَمَرٌ قَبْلَ أَنْ يَغْسِلَهُ، فَأَصَابَهُ شَيْءٌ، فَلا يَلُومَنَّ إِلا نَفْسَهُ‏.‏","english":{"narrator":"","text":"Ibn 'Abbas reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"Whoever goes to sleep with grease on his hand before\nwashing it off and is afflicted by something should not blame anyone except\nhimself.\""}},{"id":16,"idInBook":16,"chapterId":50,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى، قَالَ‏:‏ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ مَنْ بَاتَ وَبِيَدِهِ غَمَرٌ، فَأَصَابَهُ شَيْءٌ، فَلا يَلُومَنَّ إِلا نَفْسَهُ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"Anyone who spends the night with grease on his\nhand and is afflicted by something should not blame anyone but himself.\""}},{"id":17,"idInBook":17,"chapterId":50,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ قَالَ‏:‏ حَدَّثَنِي مَالِكٌ، عَنْ أَبِي الزُّبَيْرِ الْمَكِّيِّ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم قَالَ‏:‏ أَغْلِقُوا الأَبْوَابَ، وَأَوْكُوا السِّقَاءَ، وَأَكْفِئُوا الإِنَاءَ، وَخَمِّرُوا الإِنَاءَ، وَأَطْفِئُوا الْمِصْبَاحَ، فَإِنَّ الشَّيْطَانَ لاَ يَفْتَحُ غَلَقًا، وَلاَ يَحُلُّ وِكَاءً، وَلاَ يَكْشِفُ إِنَاءً، وَإِنَّ الْفُوَيْسِقَةَ تُضْرِمُ عَلَى النَّاسِ بَيْتَهُمْ‏.‏","english":{"narrator":"","text":"Jabir ibn 'Abdullah reported that the Messenger of Allah, may\nAllah bless him and grant him peace, said, \"Lock the doors, tie the water-skins,\nturn over the vessels, cover the vessels, and put out the lamps. Shaytan\ndoes not open a locked door, nor untie a water-skin, nor uncover a vessel.\nA mouse can cause a house to burn down with its inhabitants inside it.\""}},{"id":18,"idInBook":18,"chapterId":50,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا عَمْرُو بْنُ طَلْحَةَ، قَالَ‏:‏ حَدَّثَنَا أَسْبَاطٌ، عَنْ سِمَاكِ بْنِ حَرْبٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ قَالَ‏:‏ جَاءَتْ فَأْرَةٌ فَأَخَذَتْ تَجُرُّ الْفَتِيلَةَ، فَذَهَبَتِ الْجَارِيَةُ تَزْجُرُهَا، فَقَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ دَعِيهَا، فَجَاءَتْ بِهَا فَأَلْقَتْهَا عَلَى الْخُمْرَةِ الَّتِي كَانَ قَاعِدًا عَلَيْهَا، فَاحْتَرَقَ مِنْهَا مِثْلُ مَوْضِعِ دِرْهَمٍ، فَقَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ إِذَا نِمْتُمْ فَأَطْفِئُوا سُرُجَكُمْ، فَإِنَّ الشَّيْطَانَ يَدُلُّ مِثْلَ هَذِهِ عَلَى مِثْلِ هَذَا فَتَحْرِقُكُمْ‏.‏","english":{"narrator":"","text":"Ibn 'Abbas said, \"A mouse came and began to drag the wick. The\nslavegirl moved to stop it. The Prophet, may Allah bless him and grant\nhim peace, said, 'Leave it.' The mouse brought the wick and put it on the\nmat where he was sitting. It burned a hole in it the size of a dirham.\nThe Messenger of Allah, may Allah bless him and grant him peace, said,\n'When you go to sleep, put out the lights. Shaytan guides things like this\nand then they burn you.'\""}},{"id":19,"idInBook":19,"chapterId":50,"bookId":15,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، قَالَ‏:‏ حَدَّثَنَا أَبُو بَكْرٍ، عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي نُعْمٍ، عَنْ أَبِي سَعِيدٍ قَالَ‏:‏ اسْتَيْقَظَ النَّبِيُّ صلى الله عليه وسلم ذَاتَ لَيْلَةٍ، فَإِذَا فَأْرَةٌ قَدْ أَخَذَتِ الْفَتِيلَةَ، فَصَعِدَتْ بِهَا إِلَى السَّقْفِ لِتَحْرِقَ عَلَيْهِمُ الْبَيْتَ، فَلَعَنَهَا النَّبِيُّ صلى الله عليه وسلم وَأَحَلَّ قَتْلَهَا لِلْمُحْرِمِ‏.‏","english":{"narrator":"","text":"Abu Sa'id said, \"The Prophet, may Allah bless him and grant him\npeace, woke up one night and found that a mouse had taken the wick and\nclimbed onto the roof with it to burn the house down over them. The Prophet,\nmay Allah bless him and grant him peace, cursed it and it became lawful\nto kill it in the Haram.\""}},{"id":20,"idInBook":20,"chapterId":50,"bookId":15,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ‏:‏ حَدَّثَنَا ابْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ لاَ تَتْرُكُوا النَّارَ فِي بُيُوتِكُمْ حِينَ تَنَامُونَ‏.‏","english":{"narrator":"","text":"Ibn 'Umar reported that the Prophet, may Allah bless him and grant\nhim peace, said, \"Do not leave the fire burning in your house when you\ngo to sleep.\""}},{"id":21,"idInBook":21,"chapterId":50,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ يَزِيدَ، قَالَ‏:‏ حَدَّثَنَا سَعِيدُ بْنُ أَبِي أَيُّوبَ قَالَ‏:‏ حَدَّثَنِي يَزِيدُ بْنُ عَبْدِ اللهِ بْنِ الْهَادِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ قَالَ‏:‏ قَالَ عُمَرُ‏:‏ إِنَّ النَّارَ عَدُوٌّ فَاحْذَرُوهَا‏.‏ فَكَانَ ابْنُ عُمَرَ يَتْبَعُ نِيرَانَ أَهْلِهِ وَيُطْفِئُهَا قَبْلَ أَنْ يَبِيتَ.","english":{"narrator":"","text":"'Umar said, \"Fire is an enemy, so beware of it.\" He used to go\naround an put out the fires of his family before he went to sleep at night."}},{"id":22,"idInBook":22,"chapterId":50,"bookId":15,"arabic":"حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ، قَالَ‏:‏ أَخْبَرَنَا نَافِعُ بْنُ يَزِيدَ قَالَ‏:‏ حَدَّثَنِي ابْنُ الْهَادِ قَالَ‏:‏ حَدَّثَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ، سَمِعَ النَّبِيَّ صلى الله عليه وسلم يَقُولُ‏:‏ لاَ تَتْرُكُوا النَّارَ فِي بُيُوتِكُمْ، فَإِنَّهَا عَدُوٌّ‏.‏","english":{"narrator":"","text":"Ibn 'Umar heard the Prophet, may Allah bless him and grant him\npeace, say, \"Do not leave a fire burning in your houses. It is an enemy.\""}},{"id":23,"idInBook":23,"chapterId":50,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاءِ، قَالَ‏:‏ حَدَّثَنَا حَمَّادُ بْنُ أُسَامَةَ، عَنْ بُرَيْدِ بْنِ عَبْدِ اللهِ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى قَالَ‏:‏ احْتَرَقَ بِالْمَدِينَةِ بَيْتٌ عَلَى أَهْلِهِ مِنَ اللَّيْلِ، فَحُدِّثَ بِذَلِكَ النَّبِيُّ صلى الله عليه وسلم، فَقَالَ‏:‏ إِنَّ هَذِهِ النَّارَ عَدُوٌّ لَكُمْ، فَإِذَا نِمْتُمْ فَأَطْفِئُوهَا عَنْكُمْ‏.‏","english":{"narrator":"","text":"Abu Musa said, \"A house in Madina burned down with its inhabitants\nduring the night. The Prophet, may Allah bless him and grant him peace,\nwas informed about that and said, 'Fire is your enemy. When you go to sleep,\nput out the fires.'\""}},{"id":24,"idInBook":24,"chapterId":50,"bookId":15,"arabic":"حَدَّثَنَا بِشْرُ بْنُ الْحَكَمِ، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ رَبِيعَةَ، عَنِ السَّائِبِ بْنِ عُمَرَ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّهُ كَانَ إِذَا مَطَرَتِ السَّمَاءُ يَقُولُ‏:‏ يَا جَارِيَةُ، أَخْرِجِي سَرْجِي، أَخْرِجِي ثِيَابِي، وَيَقُولُ‏:‏ ‏{‏وَنَزَّلْنَا مِنَ السَّمَاءِ مَاءً مُبَارَكًا‏}‏‏.‏","english":{"narrator":"","text":"Abu Mulayka related that when it rained, Ibn 'Abbas said, \"Slavegirl!\nBring out my saddle and bring my garment. Allah says, 'We sent down\nblessed water from the sky.' (50:9)\""}},{"id":25,"idInBook":25,"chapterId":50,"bookId":15,"arabic":"حَدَّثَنَا إِسْحَاقُ بْنُ أَبِي إِسْرَائِيلَ، قَالَ‏:‏ حَدَّثَنَا النَّضْرُ بْنُ عَلْقَمَةَ أَبُو الْمُغِيرَةِ، عَنْ دَاوُدَ بْنِ عَلِيٍّ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم أَمَرَ بِتَعْلِيقِ السَّوْطِ فِي الْبَيْتِ‏.‏","english":{"narrator":"","text":"Ibn 'Abbas reported that the Prophet, may Allah bless him and\ngrant him peace, commanded that whips be hung up in houses."}},{"id":26,"idInBook":26,"chapterId":50,"bookId":15,"arabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ‏:‏ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنِ ابْنِ عَجْلاَنَ، قَالَ‏:‏ حَدَّثَنَا الْقَعْقَاعُ بْنُ حَكِيمٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ إِيَّاكُمْ وَالسَّمَرَ بَعْدَ هُدُوءِ اللَّيْلِ، فَإِنَّ أَحَدَكُمْ لاَ يَدْرِي مَا يَبُثُّ اللَّهُ مِنْ خَلْقِهِ، غَلِّقُوا الأَبْوَابَ، وَأَوْكُوا السِّقَاءَ، وَأَكْفِئُوا الإِنَاءَ، وَأَطْفِئُوا الْمَصَابِيحَ‏.‏","english":{"narrator":"","text":"Jabir ibn 'Abdullah said that the Messenger of Allah, may Allah\nbless him and grant him peace, said, \"Beware of conversing after the night\nis still. None of you knows what creatures Allah will send, so lock your\ndoors, tie up the water-skins, cover vessels and put out the lamps.\""}},{"id":27,"idInBook":27,"chapterId":50,"bookId":15,"arabic":"حَدَّثَنَا عَارِمٌ، قَالَ‏:‏ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، قَالَ‏:‏ حَدَّثَنَا حَبِيبٌ الْمُعَلِّمُ، عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ، عَنْ جَابِرٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ كُفُوًا صِبْيَانَكُمْ حَتَّى تَذْهَبَ فَحْمَةُ، أَوْ فَوْرَةُ، الْعِشَاءِ، سَاعَةَ تَهَبُّ الشَّيَاطِينُ‏.‏","english":{"narrator":"","text":"Jabir reported that the Prophet, may Allah bless him and grant\nhim peace, said, \"Keep children in until the evening has completely fallen.\nThat time is the hour when the shaytans come out.\""}}],"chapter":{"id":50,"bookId":15,"arabic":"كتاب النوم والمبيت","english":"Sleep and night lodging"}}