{"metadata":{"length":6,"arabic":{"title":"الأدب المفرد","author":"الإمام محمد بن إسماعيل البخاري","introduction":"كتاب الْبَهَائِمِ"},"english":{"title":"Al-Adab Al-Mufrad","author":"Imam Muhammad ibn Ismail al-Bukhari","introduction":"Animals"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":51,"bookId":15,"arabic":"حَدَّثَنَا مَخْلَدُ بْنُ مَالِكٍ، قَالَ‏:‏ حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ، عَنْ أَبِي جَعْفَرٍ الرَّازِيِّ، عَنْ لَيْثٍ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عُمَرَ، أَنَّهُ كَرِهَ أَنْ يُحَرِّشَ بَيْنَ الْبَهَائِمِ‏.‏","english":{"narrator":"","text":"It is reported from Mujahid that Ibn 'Umar disliked making animals\nfight each other."}},{"id":2,"idInBook":2,"chapterId":51,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ صَالِحٍ قَالَ‏:‏ حَدَّثَنِي اللَّيْثُ قَالَ‏:‏ حَدَّثَنِي خَالِدُ بْنُ يَزِيدَ، عَنْ سَعِيدِ بْنِ أَبِي هِلاَلٍ، عَنْ سَعِيدِ بْنِ زِيَادٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ أَقِلُّوا الْخُرُوجَ بَعْدَ هُدُوءٍ، فَإِنَّ لِلَّهِ دَوَابَّ يَبُثُّهُنَّ، فَمَنْ سَمِعَ نُبَاحَ الْكَلْبِ، أَوْ نُهَاقَ حِمَارٍ، فَلْيَسْتَعِذْ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيمِ، فَإِنَّهُمْ يَرَوْنَ مَا لا تَرَوْنَ‏.‏","english":{"narrator":"","text":"Jabir ibn 'Abdullah reported that the Prophet, may Allah bless\nhim and grant him peace, said \"Do not go out often after the night is still.\nAllah has animals which he sends out. Anyone who hears the barking of a\ndog or the braying of a donkey should seek refuge with Allah from the Accursed\nShaytan. They see what you do not see.\""}},{"id":3,"idInBook":3,"chapterId":51,"bookId":15,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ خَالِدٍ، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاقَ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ إِذَا سَمِعْتُمْ نُبَاحَ الْكِلاَبِ أَوْ نُهَاقَ الْحَمِيرِ مِنَ اللَّيْلِ، فَتَعَوَّذُوا بِاللَّهِ، فَإِنَّهُمْ يَرَوْنَ مَالاَ تَرَوْنَ، وَأَجِيفُوا الأَبْوَابَ، وَاذْكُرُوا اسْمَ اللهِ عَلَيْهَا، فَإِنَّ الشَّيْطَانَ لاَ يَفْتَحُ بَابًا أُجِيفَ وَذُكِرَ اسْمُ اللهِ عَلَيْهِ، وَغَطُّوا الْجِرَارَ، وَأَوْكِئُوا الْقِرَبَ وَأَكْفِئُوا الآنِيَةَ‏.‏","english":{"narrator":"","text":"Jabir ibn 'Abdullah reported that the Messenger of Allah, may\nAllah bless him and grant him peace, said, \"When you hear a dog barking\nor a donkey braying in the night, seek refuge with Allah. They see what\nyou do not see. Shut the doors and mention the Name of Allah over them.\nShaytan will not open a door which has been shut and had the name of Allah\nmentioned over it. Then cover the pots, tie the water-skins and cover the\nvessels.\""}},{"id":4,"idInBook":4,"chapterId":51,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ صَالِحٍ، وَعَبْدُ اللهِ بْنُ يُوسُفَ، قَالاَ‏:‏ حَدَّثَنَا اللَّيْثُ قَالَ‏:‏ حَدَّثَنِي يَزِيدُ بْنُ الْهَادِ، عَنْ عُمَرَ بْنِ عَلِيِّ بْنِ حُسَيْنٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ قَالَ ابْنُ الْهَادِ‏:‏ وَحَدَّثَنِي شُرَحْبِيلُ، عَنْ جَابِرٍ، أَنَّهُ سَمِعَ مِنْ رَسُولِ اللهِ صلى الله عليه وسلم يَقُولُ‏:‏ أَقِلُّوا الْخُرُوجَ بَعْدَ هُدُوءٍ، فَإِنَّ لِلَّهِ خَلْقًا يَبُثُّهُمْ، فَإِذَا سَمِعْتُمْ نُبَاحَ الْكِلاَبِ أَوْ نُهَاقَ الْحَمِيرِ، فَاسْتَعِيذُوا بِاللَّهِ مِنَ الشَّيْطَانِ‏.‏","english":{"narrator":"","text":"Jabir reported that he heard the Messenger of Allah (ﷺ) say \"Limit going out after tranquility, for verily there are creations of Allah (whom) He disperses. So if you hear the barking of dogs or the braying of donkeys, then seek refuge with Allah from the Devil.\""}},{"id":5,"idInBook":5,"chapterId":51,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ صَالِحٍ قَالَ‏:‏ حَدَّثَنِي اللَّيْثُ قَالَ‏:‏ حَدَّثَنِي جَعْفَرُ بْنُ رَبِيعَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ هُرْمُزَ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللهِ صلى الله عليه وسلم أَنَّهُ قَالَ‏:‏ إِذَا سَمِعْتُمْ صِيَاحَ الدِّيَكَةِ مِنَ اللَّيْلِ، فَإِنَّهَا رَأَتْ مَلَكًا، فَسَلُوا اللَّهَ مِنْ فَضْلِهِ، وَإِذَا سَمِعْتُمْ نُهَاقَ الْحَمِيرِ مِنَ اللَّيْلِ، فَإِنَّهَا رَأَتْ شَيْطَانًا، فَتَعَوَّذُوا بِاللَّهِ مِنَ الشَّيْطَانِ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"When you hear the crowing of a cock in\nthe night, it has seen an angel. Ask Allah for its blessing. If you hear\nthe braying of a donkey in the night, it has seen a shaytan, so seek refuge\nwith Allah from shaytan.\""}},{"id":6,"idInBook":6,"chapterId":51,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ‏:‏ حَدَّثَنَا صَفْوَانُ بْنُ عِيسَى، قَالَ‏:‏ حَدَّثَنَا سُوَيْدٌ أَبُو حَاتِمٍ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَجُلاً لَعَنَ بُرْغُوثًا عِنْدَ النَّبِيِّ صلى الله عليه وسلم، فَقَالَ‏:‏ لاَ تَلْعَنْهُ، فَإِنَّهُ أَيْقَظَ نَبِيًّا مِنَ الأنْبِيَاءِ لِلصَّلاةِ‏.‏","english":{"narrator":"","text":"Anas ibn Malik reported that a man cursed fleas in the presence\nof the Prophet, may Allah bless him and grant him peace, and the Prophet,\nmay Allah bless him and grant him peace, said, \"Do not curse them. A flea\nwoke up one of the Prophets for the prayer.\""}}],"chapter":{"id":51,"bookId":15,"arabic":"كتاب الْبَهَائِمِ","english":"Animals"}}