{"metadata":{"length":6,"arabic":{"title":"الأدب المفرد","author":"الإمام محمد بن إسماعيل البخاري","introduction":"كتاب الْقَائِلَةِ"},"english":{"title":"Al-Adab Al-Mufrad","author":"Imam Muhammad ibn Ismail al-Bukhari","introduction":"Midday Naps"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":52,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا هِشَامُ بْنُ يُوسُفَ، قَالَ‏:‏ أَخْبَرَنَا مَعْمَرٌ، عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنِ السَّائِبِ، عَنْ عُمَرَ قَالَ‏:‏ رُبَّمَا قَعَدَ عَلَى بَابِ ابْنِ مَسْعُودٍ رِجَالٌ مِنْ قُرَيْشٍ، فَإِذَا فَاءَ الْفَيْءُ قَالَ‏:‏ قُومُوا فَمَا بَقِيَ فَهُوَ لِلشَّيْطَانِ، ثُمَّ لاَ يَمُرُّ عَلَى أَحَدٍ إِلاَّ أَقَامَهُ، قَالَ‏:‏ ثُمَّ بَيْنَا هُوَ كَذَلِكَ إِذْ قِيلَ‏:‏ هَذَا مَوْلَى بَنِي الْحَسْحَاسِ يَقُولُ الشِّعْرَ، فَدَعَاهُ فَقَالَ‏:‏ كَيْفَ قُلْتَ‏؟‏ فَقَالَ‏:‏ وَدِّعْ سُلَيْمَى إِنْ تَجَهَّزْتَ غَازِيَا كَفَى الشَّيْبُ وَالإِسْلاَمُ لِلْمَرْءِ نَاهِيَا، فَقَالَ‏:‏ حَسْبُكَ، صَدَقْتَ صَدَقْتَ‏.‏","english":{"narrator":"'Umar said, \"Sometimes some of the men of Quraysh sat at the door\nof Ibn Mas'ud. When the shadows shifted from west to east, he said, 'Get\nup, Any time spent here after this is for Shaytan.' He made everyone he\npassed by get up. While we were getting up, someone said to him, 'This\nis the mawla of the Banu'l-Hashas who composes poetry.' 'Umar called and\nsaid, 'What have you got to say?' The man said:","text":"'Say farewell to Salma if you prepare to go in the morning,\n       White hair and Islam is enough prohibition for a man'\n\n'Umar said, 'Enough! You have spoken the truth. You have spoken the truth.'\""}},{"id":2,"idInBook":2,"chapterId":52,"bookId":15,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللهِ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَ‏:‏ أَخْبَرَنَا مَعْمَرٌ، عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ الْجَحْشِيِّ، عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، عَنِ السَّائِبِ بْنِ يَزِيدَ قَالَ‏:‏ كَانَ عُمَرُ رَضِيَ اللَّهُ عَنْهُ يَمُرُّ بِنَا نِصْفَ النَّهَارِ، أَوْ قَرِيبًا مِنْهُ، فَيَقُولُ‏:‏ قُومُوا فَقِيلُوا، فَمَا بَقِيَ فَلِلشَّيْطَانِ‏.‏","english":{"narrator":"","text":"As-Sa'ib ibn Yazid said, \"'Umar, may Allah be pleased with him,\nused to pass by us in the middle of the day - or near to it - and\nsay, 'Get up and take a midday nap. Any time spent here after this is for\nshaytan.'\""}},{"id":3,"idInBook":3,"chapterId":52,"bookId":15,"arabic":"حَدَّثَنَا حَجَّاجٌ، قَالَ‏:‏ حَدَّثَنَا حَمَّادٌ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ قَالَ‏:‏ كَانُوا يَجْمَعُونَ، ثُمَّ يَقِيلُونَ‏.‏","english":{"narrator":"","text":"Anas said, \"They used to gather and then take a midday nap.\""}},{"id":4,"idInBook":4,"chapterId":52,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى، قَالَ‏:‏ حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ، عَنْ ثَابِتٍ، قَالَ أَنَسٌ‏:‏ مَا كَانَ لأَهْلِ الْمَدِينَةِ شَرَابٌ، حَيْثُ حُرِّمَتِ الْخَمْرُ، أَعْجَبَ إِلَيْهِمْ مِنَ التَّمْرِ وَالْبُسْرِ، فَإِنِّي لَأَسْقِي أَصْحَابَ رَسُولِ اللهِ صلى الله عليه وسلم، وَهُمْ عِنْدَ أَبِي طَلْحَةَ، مَرَّ رَجُلٌ فَقَالَ‏:‏ إِنَّ الْخَمْرَ قَدْ حُرِّمَتْ، فَمَا قَالُوا‏:‏ مَتَى‏؟‏ أَوْ حَتَّى نَنْظُرَ، قَالُوا‏:‏ يَا أَنَسُ، أَهْرِقْهَا، ثُمَّ قَالُوا عِنْدَ أُمِّ سُلَيْمٍ حَتَّى أَبْرَدُوا وَاغْتَسَلُوا، ثُمَّ طَيَّبَتْهُمْ أُمُّ سُلَيْمٍ، ثُمَّ رَاحُوا إِلَى النَّبِيِّ صلى الله عليه وسلم، فَإِذَا الْخَبَرُ كَمَا قَالَ الرَّجُلُ‏.‏\nقَالَ أَنَسٌ‏:‏ فَمَا طَعِمُوهَا بَعْدُ‏.‏","english":{"narrator":"","text":"Anas said, \"At the time that wine was made unlawful, there was\nno drink that the people of Madina liked better than that made from dried\ndates and unripe dates. I used to give the drink to the Companions of the\nMessenger of Allah, may Allah bless him and grant him peace. They were\nin the home of Abu Talha when a man passed by and announced, 'Wine has\nbeen forbidden.' They did not say, 'When?' or 'Wait until we see.' They\nsaid, 'Anas, break them!' Then they said in the presence of Umm Sulaym,\n'Wait until it becomes cool and we have washed ourselves.' Then Umm Sulaym\nput perfume on them. Then they went to the Prophet, may Allah bless him\nand grant him peace, and the news was as the man had said.\""}},{"id":5,"idInBook":5,"chapterId":52,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، قَالَ‏:‏ أَخْبَرَنَا عَبْدُ اللهِ، قَالَ‏:‏ حَدَّثَنَا مِسْعَرٌ، عَنْ ثَابِتِ بْنِ عُبَيْدٍ، عَنِ ابْنِ أَبِي لَيْلَى، عَنْ خَوَّاتِ بْنِ جُبَيْرٍ قَالَ‏:‏ نَوْمُ أَوَّلِ النَّهَارِ خُرْقٌ، وَأَوْسَطُهُ خُلْقٌ، وَآخِرُهُ حُمْقٌ‏.‏","english":{"narrator":"","text":"Khawwat ibn Jubayr said, \"Sleep at the beginning of the day is stupidity, in the middle of it is (an act of) character,and at the end of it is imbecility.\""}},{"id":6,"idInBook":6,"chapterId":52,"bookId":15,"arabic":"حَدَّثَنَا عَمْرُو بْنُ خَالِدٍ، قَالَ‏:‏ حَدَّثَنَا أَبُو الْمَلِيحِ قَالَ‏:‏ سَمِعْتُ مَيْمُونًا يَعْنِي ابْنَ مِهْرَانَ قَالَ‏:‏ سَأَلْتُ نَافِعًا‏:‏ هَلْ كَانَ ابْنُ عُمَرَ يَدْعُو لِلْمَأْدُبَةِ‏؟‏ قَالَ‏:‏ لَكِنَّهُ انْكَسَرَ لَهُ بَعِيرٌ مَرَّةً فَنَحَرْنَاهُ، ثُمَّ قَالَ‏:‏ احْشُرْ عَلَيَّ الْمَدِينَةَ، قَالَ نَافِعٌ‏:‏ فَقُلْتُ‏:‏ يَا أَبَا عَبْدِ الرَّحْمَنِ، عَلَى أَيِّ شَيْءٍ‏؟‏ لَيْسَ عِنْدَنَا خُبْزٌ، فَقَالَ‏:‏ اللَّهُمَّ لَكَ الْحَمْدُ، هَذَا عُرَاقٌ، وَهَذَا مَرَقٌ، أَوْ قَالَ‏:‏ مَرَقٌ وَبَضْعٌ، فَمَنْ شَاءَ أَكَلَ، وَمَنْ شَاءَ وَدَعَ‏.‏","english":{"narrator":"","text":"Maymun (ibn Mahran) said, \"I asked Nafi', 'Did Ibn 'Umar ever\ninvite people to a banquet?' He said, 'A camel of his once broke something\nand so we sacrificed it. Then Ibn 'Umar said, \"Gather the people of Madina\nfor me.\" I said, \"Abu 'Abdu'r-Rahman, for what? We do not have any bread.\"\nHe said, \"O Allah, praise belongs to You. These are bits of meat and this\nis broth,\" or he said, \"Broth and meat chunks. Whoever wishes can eat and\nwhoever wishes can leave it.\"'\""}}],"chapter":{"id":52,"bookId":15,"arabic":"كتاب الْقَائِلَةِ","english":"Midday Naps"}}