{"metadata":{"length":15,"arabic":{"title":"الأدب المفرد","author":"الإمام محمد بن إسماعيل البخاري","introduction":"كتاب الْخِتَانِ"},"english":{"title":"Al-Adab Al-Mufrad","author":"Imam Muhammad ibn Ismail al-Bukhari","introduction":"Circumcision"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":53,"bookId":15,"arabic":"أَخْبَرَنَا شُعَيْبُ بْنُ أَبِي حَمْزَةَ، قَالَ‏:‏ حَدَّثَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم قَالَ‏:‏ اخْتَتَنَ إِبْرَاهِيمُ صلى الله عليه وسلم بَعْدَ ثَمَانِينَ سَنَةً، وَاخْتَتَنَ بِالْقَدُومِ قَالَ أَبُو عَبْدِ اللهِ‏:‏ يَعْنِي مَوْضِعًا‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"Ibrahim, may Allah bless him and grant\nhim peace, was circumcised when he was eighty years old. He was circumcised\nwith an axe (qadum).\""}},{"id":2,"idInBook":2,"chapterId":53,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْوَاحِدِ قَالَ‏:‏ حَدَّثَتْنَا عَجُوزٌ مِنْ أَهْلِ الْكُوفَةِ جَدَّةُ عَلِيِّ بْنِ غُرَابٍ قَالَتْ‏:‏ حَدَّثَتْنِي أُمُّ الْمُهَاجِرِ قَالَتْ‏:‏ سُبِيتُ فِي جَوَارِي مِنَ الرُّومِ، فَعَرَضَ عَلَيْنَا عُثْمَانُ الإِسْلاَمَ، فَلَمْ يُسْلِمْ مِنَّا غَيْرِي وَغَيْرُ أُخْرَى، فَقَالَ عُثْمَانُ‏:‏ اذْهَبُوا فَاخْفِضُوهُمَا، وَطَهِّرُوهُمَا‏.‏","english":{"narrator":"","text":"An old woman from Kufa, the grandmother of 'Ali ibn Ghurab, reported\nthat Umm al-Muhajir said, \"I was captured with some girls from Byzantium.\n'Uthman offered us Islam, but only myself and one other girl accepted Islam.\n'Uthman said, 'Go and circumcise them and purify them.'\""}},{"id":3,"idInBook":3,"chapterId":53,"bookId":15,"arabic":"حَدَّثَنَا زَكَرِيَّا بْنُ يَحْيَى، قَالَ‏:‏ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ عُمَرَ بْنِ حَمْزَةَ قَالَ‏:‏ أَخْبَرَنِي سَالِمٌ قَالَ‏:‏ خَتَنَنِي ابْنُ عُمَرَ أَنَا وَنُعَيْمًا، فَذَبَحَ عَلَيْنَا كَبْشًا، فَلَقَدْ رَأَيْتُنَا وَإِنَّا لَنَجْذَلُ بِهِ عَلَى الصِّبْيَانِ أَنْ ذَبَحَ عَنَّا كَبْشًا‏.‏","english":{"narrator":"","text":"Salim said, \"Ibn 'Umar, Nu'aym and I were circumcised and they\nsacrificed a ram on our behalf. I think that we were more happy about it\nthan the other children since a ram had been sacrificed on our behalf.\""}},{"id":4,"idInBook":4,"chapterId":53,"bookId":15,"arabic":"حَدَّثَنَا أَصْبَغُ قَالَ‏:‏ أَخْبَرَنِي ابْنُ وَهْبٍ قَالَ‏:‏ أَخْبَرَنِي عَمْرٌو، أَنَّ بُكَيْرًا حَدَّثَهُ، أَنَّ أُمَّ عَلْقَمَةَ أَخْبَرَتْهُ، أَنَّ بَنَاتَ أَخِي عَائِشَةَ اخْتُتِنَّ، فَقِيلَ لِعَائِشَةَ‏:‏ أَلاَ نَدْعُو لَهُنَّ مَنْ يُلْهِيهِنَّ‏؟‏ قَالَتْ‏:‏ بَلَى‏.‏ فَأَرْسَلْتُ إِلَى عَدِيٍّ فَأَتَاهُنَّ، فَمَرَّتْ عَائِشَةُ فِي الْبَيْتِ فَرَأَتْهُ يَتَغَنَّى وَيُحَرِّكُ رَأْسَهُ طَرَبًا، وَكَانَ ذَا شَعْرٍ كَثِيرٍ، فَقَالَتْ‏:‏ أُفٍّ، شَيْطَانٌ، أَخْرِجُوهُ، أَخْرِجُوهُ‏.‏","english":{"narrator":"","text":"Umm 'Alqama related that when the daughters of 'A'isha's brother\nwere circumcised, 'A'isha was asked, \"Shall we call someone to amuse them?\"\n\"Yes,\" she replied. 'Adi was sent for and he came to them. 'A'isha passed\nby the room and saw him singing and shaking his head in rapture - and\nhe had a large head of hair. 'Uff!' she exclaimed, 'A shaytan! Get him\nout! Get him out!'\""}},{"id":5,"idInBook":5,"chapterId":53,"bookId":15,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ خَالِدٍ، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاقَ، عَنْ نَافِعٍ، عَنْ أَسْلَمَ مَوْلَى عُمَرَ قَالَ‏:‏ لَمَّا قَدِمْنَا مَعَ عُمَرَ بْنِ الْخَطَّابِ الشَّامَ أَتَاهُ الدِّهْقَانُ قَالَ‏:‏ يَا أَمِيرَ الْمُؤْمِنِينَ، إِنِّي قَدْ صَنَعْتُ لَكَ طَعَامًا، فَأُحِبُّ أَنْ تَأْتِيَنِي بِأَشْرَافِ مَنْ مَعَكَ، فَإِنَّهُ أَقْوَى لِي فِي عَمَلِي، وَأَشْرَفُ لِي، قَالَ‏:‏ إِنَّا لاَ نَسْتَطِيعُ أَنْ نَدْخُلَ كَنَائِسَكُمْ هَذِهِ مَعَ الصُّوَرِ الَّتِي فِيهَا‏.‏","english":{"narrator":"","text":"Aslam, the client of 'Umar, said, \"When we came to Syria with\n'Umar ibn al-Khattab, the chief came to him, 'Amir al-Mu'minin, I have\nprepared some food for you and I would like you to bring some nobles with\nyou. That will be a stronger and nobler action for me.' 'Umar said, 'We\ncannot enter these churches of yours with the images which are inside them.'\""}},{"id":6,"idInBook":6,"chapterId":53,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ قَالَ‏:‏ حَدَّثَتْنَا عَجُوزٌ مِنْ أَهْلِ الْكُوفَةِ جَدَّةُ عَلِيِّ بْنِ غُرَابٍ قَالَتْ‏:‏ حَدَّثَتْنِي أُمُّ الْمُهَاجِرِ قَالَتْ‏:‏ سُبِيتُ وَجَوَارِي مِنَ الرُّومِ، فَعَرَضَ عَلَيْنَا عُثْمَانُ الإِسْلاَمَ، فَلَمْ يُسْلِمْ مِنَّا غَيْرِي وَغَيْرُ أُخْرَى، فَقَالَ‏:‏ اخْفِضُوهُمَا، وَطَهِّرُوهُمَا فَكُنْتُ أَخْدُمُ عُثْمَانَ‏.‏","english":{"narrator":"","text":"See 1245."}},{"id":7,"idInBook":7,"chapterId":53,"bookId":15,"arabic":"حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، قَالَ‏:‏ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ اخْتَتَنَ إِبْرَاهِيمُ صلى الله عليه وسلم وَهُوَ ابْنُ عِشْرِينَ وَمِئَةٍ، ثُمَّ عَاشَ بَعْدَ ذَلِكَ ثَمَانِينَ سَنَةً‏.‏","english":{"narrator":"","text":"Abu Hurayra said, \"Ibrahim, may Allah bless him and grant him\npeace, was circumcised when he was 120 years old. Then he lived eighty\nyears after that.\""}},{"id":8,"idInBook":8,"chapterId":53,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدٌ، قَالَ‏:‏ أَخْبَرَنَا عَبْدُ اللهِ، قَالَ‏:‏ أَخْبَرَنَا مُعْتَمِرٌ قَالَ‏:‏ حَدَّثَنِي سَالِمُ بْنُ أَبِي الذَّيَّالِ، وَكَانَ صَاحِبَ حَدِيثٍ، قَالَ‏:‏ سَمِعْتُ الْحَسَنَ يَقُولُ‏:‏ أَمَا تَعْجَبُونَ لِهَذَا‏؟‏ يَعْنِي‏:‏ مَالِكَ بْنَ الْمُنْذِرِ عَمَدَ إِلَى شُيُوخٍ مِنْ أَهْلِ كَسْكَرَ أَسْلَمُوا، فَفَتَّشَهُمْ فَأَمَرَ بِهِمْ فَخُتِنُوا، وَهَذَا الشِّتَاءُ، فَبَلَغَنِي أَنَّ بَعْضَهُمْ مَاتَ، وَلَقَدْ أَسْلَمَ مَعَ رَسُولِ اللهِ صلى الله عليه وسلم الرُّومِيُّ وَالْحَبَشِيُّ فَمَا فُتِّشُوا عَنْ شَيْءٍ‏.‏","english":{"narrator":"","text":"It is reported that al-Hasan said, \"Are you not astonished by\nthis man? (i.e. Malik ibn al-Mundhir) He went to some of the old people\nof Kaskar who had become Muslim and examined them and then commanded that\nthey be circumcised although it was winter. I heard that some of them died.\nGreeks and Abyssinians became Muslim with the Messenger of Allah, may Allah\nbless him and grant him peace, and they were not examined at all.\""}},{"id":9,"idInBook":9,"chapterId":53,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللهِ الأُوَيْسِيُّ قَالَ‏:‏ حَدَّثَنِي سُلَيْمَانُ بْنُ بِلاَلٍ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ قَالَ‏:‏ وَكَانَ الرَّجُلُ إِذَا أَسْلَمَ أُمِرَ بِالِاخْتِتَانِ وَإِنْ كَانَ كَبِيرًا‏.‏","english":{"narrator":"","text":"Ibn Shihab said, \"When a man became Muslim, he was ordered to\nhave himself circumcised, even if he was old.\""}},{"id":10,"idInBook":10,"chapterId":53,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْعَزِيزِ الْعُمَرِيُّ، قَالَ‏:‏ حَدَّثَنَا ضَمْرَةُ بْنُ رَبِيعَةَ، عَنْ بِلاَلِ بْنِ كَعْبٍ الْعَكِّيِّ قَالَ‏:‏ زُرْنَا يَحْيَى بْنَ حَسَّانَ فِي قَرْيَتِهِ، أَنَا وَإِبْرَاهِيمُ بْنُ أَدْهَمَ، وَعَبْدُ الْعَزِيزِ بْنُ قَرِيرٍ، وَمُوسَى بْنُ يَسَارٍ، فَجَاءَنَا بِطَعَامٍ، فَأَمْسَكَ مُوسَى، وَكَانَ صَائِمًا، فَقَالَ يَحْيَى‏:‏ أَمَّنَا فِي هَذَا الْمَسْجِدِ رَجُلٌ مِنْ بَنِي كِنَانَةَ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم يُكَنَّى أَبَا قِرْصَافَةَ أَرْبَعِينَ سَنَةً، يَصُومُ يَوْمًا وَيُفْطِرُ يَوْمًا، فَوُلِدَ لأَبِي غُلاَمٌ، فَدَعَاهُ فِي الْيَوْمِ الَّذِي يَصُومُ فِيهِ فَأَفْطَرَ، فَقَامَ إِبْرَاهِيمُ فَكَنَسَهُ بِكِسَائِهِ، وَأَفْطَرَ مُوسَى قَالَ أَبُو عَبْدِ اللهِ‏:‏ أَبُو قِرْصَافَةَ اسْمُهُ جَنْدَرَةُ بْنُ خَيْشَنَةَ‏.‏","english":{"narrator":"","text":"Bilal ibn Ka'b al-'Ukki said, \"We - Ibrahim ibn Adham, 'Abdu'l-'Aziz\nibn Qarir, Musa ibn Yasar and I - visited Yahya ibn Hassan (al-Bakri\nal-Filistini) in his village. He brought us some food, but Musa held back\nbecause he was fasting. Yahya said, 'We had a man with the kunya of Abu\nQursafa from the Banu Kinana who had been one of the Companions of the\nProphet, may Allah bless him and grant him peace, and he was in this mosque\nfor forty years. He would fast one day and break the fast the next day,\nMy father had a son born to him and he invited this man on the day that\nhe was fasting and he broke his fast.' Ibrahim stood up and swept him with\ncloak and Musa broke his fast.\""}},{"id":11,"idInBook":11,"chapterId":53,"bookId":15,"arabic":"حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ، قَالَ‏:‏ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ قَالَ‏:‏ ذَهَبْتُ بِعَبْدِ اللهِ بْنِ أَبِي طَلْحَةَ إِلَى النَّبِيِّ صلى الله عليه وسلم يَوْمَ وُلِدَ، وَالنَّبِيُّ صلى الله عليه وسلم فِي عَبَاءَةٍ يَهْنَأُ بَعِيرًا لَهُ، فَقَالَ‏:‏ مَعَكَ تَمَرَاتٌ‏؟‏ قُلْتُ‏:‏ نَعَمْ، فَنَاوَلْتُهُ تَمَرَاتٍ فَلاَكَهُنَّ، ثُمَّ فَغَرَ فَا الصَّبِيِّ، وَأَوْجَرَهُنَّ إِيَّاهُ، فَتَلَمَّظَ الصَّبِيُّ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ حُبَّ الأَنْصَارِ التَّمْرَ، وَسَمَّاهُ‏:‏ عَبْدَ اللهِ‏.‏","english":{"narrator":"","text":"Anas said, \"On the day he was born, I took 'Abdullah ibn Abi Talha\nto the Prophet, may Allah bless him and grant him peace. I found him wearing\na woollen robe while he was marking one of his camels with tar. The Prophet\nsaid, 'Do you have any dates with you?' 'Yes,' I replied. I gave him some\ndates. He chewed the dates and opened the child's mouth and put some chewed\ndates into the child's mouth. The child licked his lips. The Prophet, may Allah bless him and grant him peace, said, 'The Ansar love dates,' and\ngave him the name 'Abdullah.\""}},{"id":12,"idInBook":12,"chapterId":53,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدٌ، قَالَ‏:‏ أَخْبَرَنَا عَبْدُ اللهِ، قَالَ‏:‏ أَخْبَرَنَا حَزْمٌ قَالَ‏:‏ سَمِعْتُ مُعَاوِيَةَ بْنَ قُرَّةَ يَقُولُ‏:‏ لَمَّا وُلِدَ لِي إِيَاسٌ دَعَوْتُ نَفَرًا مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم فَأَطْعَمْتُهُمْ، فَدَعَوْا، فَقُلْتُ‏:‏ إِنَّكُمْ قَدْ دَعَوْتُمْ فَبَارَكَ اللَّهُ لَكُمْ فِيمَا دَعَوْتُمْ، وَإِنِّي إِنْ أَدْعُو بِدُعَاءٍ فَأَمِّنُوا، قَالَ‏:‏ فَدَعَوْتُ لَهُ بِدُعَاءٍ كَثِيرٍ فِي دِينِهِ وَعَقْلِهِ وَكَذَا، قَالَ‏:‏ فَإِنِّي لَأَتَعَرَّفُ فِيهِ دُعَاءَ يَوْمِئِذٍ‏.‏","english":{"narrator":"","text":"Mu'awiya ibn Qurra said, \"When Iyas was born to me, I invited\na group of the Companions of the Prophet, may Allah bless him and grant\nhim peace, and I fed them and they made supplication. I said, 'You have\nmade supplication, so may Allah bless you for your supplication. If I make\nsupplication, then you say, \"Amen\".' He went on, 'I made a lot of supplication\nfor him for his deen, his intellect and things like that.' He added, 'I\nstill recognise the supplication of that day in him.\""}},{"id":13,"idInBook":13,"chapterId":53,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ اللهِ بْنُ دُكَيْنٍ، سَمِعَ كَثِيرَ بْنَ عُبَيْدٍ قَالَ‏:‏ كَانَتْ عَائِشَةُ رَضِيَ اللَّهُ عَنْهَا إِذَا وُلِدَ فِيهِمْ مَوْلُودٌ، يَعْنِي‏:‏ فِي أَهْلِهَا، لاَ تَسْأَلُ‏:‏ غُلاَمًا وَلاَ جَارِيَةً، تَقُولُ‏:‏ خُلِقَ سَوِيًّا‏؟‏ فَإِذَا قِيلَ‏:‏ نَعَمْ، قَالَتِ‏:‏ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ‏.‏","english":{"narrator":"","text":"Kathir ibn 'Ubayd said, \"When someone in the family of 'A'isha\nhad a child, she did not ask, 'boy or girl?' She asked, 'Was he created\nwell-formed?' If the answer was 'Yes,' she said, 'Praise be to Allah, the\nLord of the Worlds.'\""}},{"id":14,"idInBook":14,"chapterId":53,"bookId":15,"arabic":"حَدَّثَنَا سَعِيدُ بْنُ مُحَمَّدٍ الْجِرْمِيُّ، قَالَ‏:‏ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، قَالَ‏:‏ حَدَّثَنَا أَبِي، عَنِ ابْنِ إِسْحَاقَ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ الْحَارِثِ التَّيْمِيِّ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ خَمْسٌ مِنَ الْفِطْرَةِ‏:‏ قَصُّ الشَّارِبِ، وَتَقْلِيمُ الأَظْفَارِ، وَحَلْقُ الْعَانَةِ، وَنَتْفُ الإِبْطِ، وَالسِّوَاكُ‏.‏","english":{"narrator":"Abu Hurayra reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"Five things are included in the fitra:","text":"trimming the moustache, cutting the nails, shaving the pubic hair, plucking\nthe armpits, and using the siwak (arak stick for cleaning the teeth).\""}},{"id":15,"idInBook":15,"chapterId":53,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْعَزِيزِ، قَالَ‏:‏ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ قَالَ‏:‏ حَدَّثَنِي ابْنُ أَبِي رَوَّادٍ قَالَ‏:‏ أَخْبَرَنِي نَافِعٌ، أَنَّ ابْنَ عُمَرَ كَانَ يُقَلِّمُ أَظَافِيرَهُ فِي كُلِّ خَمْسَ عَشْرَةَ لَيْلَةً، وَيَسْتَحِدُّ فِي كُلِّ شَهْرٍ‏.‏","english":{"narrator":"","text":"Nafi' reported that Ibn 'Umar used to trim his nails every fifteen\ndays and shave his pubic hair every month."}}],"chapter":{"id":53,"bookId":15,"arabic":"كتاب الْخِتَانِ","english":"Circumcision"}}