{"metadata":{"length":23,"arabic":{"title":"الأدب المفرد","author":"الإمام محمد بن إسماعيل البخاري","introduction":"كتاب القمار ونحوه"},"english":{"title":"Al-Adab Al-Mufrad","author":"Imam Muhammad ibn Ismail al-Bukhari","introduction":"Betting and similar pastimes"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":54,"bookId":15,"arabic":"حَدَّثَنَا فَرْوَةُ بْنُ أَبِي الْمَغْرَاءِ، قَالَ‏:‏ أَخْبَرَنَا إِبْرَاهِيمُ بْنُ الْمُخْتَارِ، عَنْ مَعْرُوفِ بْنِ سُهَيْلٍ الْبُرْجُمِيِّ، عَنْ جَعْفَرِ بْنِ أَبِي الْمُغِيرَةِ قَالَ‏:‏ نَزَلَ بِي سَعِيدُ بْنُ جُبَيْرٍ فَقَالَ‏:‏ حَدَّثَنِي ابْنُ عَبَّاسٍ، أَنَّهُ كَانَ يُقَالُ‏:‏ أَيْنَ أَيْسَارُ الْجَزُورِ‏؟‏ فَيَجْتَمِعُ الْعَشَرَةُ، فَيَشْتَرُونَ الْجَزُورَ بِعَشَرَةِ فِصْلاَنٍ إِلَى الْفِصَالِ، فَيُجِيلُونَ السِّهَامَ، فَتَصِيرُ لَتِسْعَةٍ، حَتَّى تَصِيرَ إِلَى وَاحِدٍ، وَيَغْرَمُ الْآخَرُونَ فَصِيلاً فَصِيلاً، إِلَى الْفِصَالِ فَهُوَ الْمَيْسِرُ‏.‏","english":{"narrator":"","text":"Ja'far ibn Abi'l-Mughira said, \"Sa'id ibn Jubayr stayed with me\nand said tht Ibn 'Abbas related to me that he used to say, 'Where are those\nwho play with gambling arrows for the slaughtered camel? They buy a camel\nwith ten shares. Then they shuffle the arrows and it becomes nine shares\nand they continue until comes down to one share. The others lose their\nshares to the one share. That is gambling (arrow-shuffling).'\""}},{"id":2,"idInBook":2,"chapterId":54,"bookId":15,"arabic":"حَدَّثَنَا الأُوَيْسِيُّ، قَالَ‏:‏ حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ قَالَ‏:‏ الْمَيْسِرُ‏:‏ الْقِمَارُ‏.‏","english":{"narrator":"","text":"Ibn 'Umar said, \"Arrow-shuffling is gambling.\""}},{"id":3,"idInBook":3,"chapterId":54,"bookId":15,"arabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ قَالَ‏:‏ حَدَّثَنِي مَعْنٌ قَالَ‏:‏ حَدَّثَنِي ابْنُ الْمُنْكَدِرِ، عَنْ أَبِيهِ، عَنْ رَبِيعَةَ بْنِ عَبْدِ اللهِ بْنِ الْهُدَيْرِ بْنِ عَبْدِ اللهِ، أَنَّ رَجُلَيْنِ اقْتَمَرَا عَلَى دِيكَيْنِ عَلَى عَهْدِ عُمَرَ فَأَمَرَ عُمَرُ بِقَتْلِ الدِّيَكَةِ، فَقَالَ لَهُ رَجُلٌ مِنَ الأَنْصَارِ‏:‏ أَتَقْتُلُ أُمَّةً تُسَبِّحُ‏؟‏ فَتَرَكَهَا‏.‏","english":{"narrator":"","text":"Rabi'a ibn 'Abdullah ibn al-Hadir ibn 'Abdullah reported tht two\nmen wagered two cocks in the time of 'Umar. 'Umar ordered that the cock\nbe killed and a man of the Ansar said to him, \"Will you kill a something\nwhich glorifies Allah?\" So 'Umar left it."}},{"id":4,"idInBook":4,"chapterId":54,"bookId":15,"arabic":"حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، قَالَ‏:‏ حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ أَبَا هُرَيْرَةَ قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ مَنْ حَلَفَ مِنْكُمْ فَقَالَ فِي حَلِفِهِ‏:‏ بِاللاَّتِ وَالْعُزَّى، فَلْيَقُلْ‏:‏ لاَ إِلَهَ إِلاَّ اللَّهُ، وَمَنْ قَالَ لِصَاحِبِهِ‏:‏ تَعَالَ أُقَامِرْكَ، فَلْيَتَصَدَّقْ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"If any of you makes an oath and swears\nin his oath by al-Lat and al-'Uzza should say, 'There is no god but Allah.'\nIf any of you tells him companion, 'Come on, I will make a bet with you'\nshould give sadaqa.\""}},{"id":5,"idInBook":5,"chapterId":54,"bookId":15,"arabic":"حَدَّثَنَا عَمْرُو بْنُ زُرَارَةَ، قَالَ‏:‏ أَخْبَرَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ، عَنْ عُمَرَ بْنِ حَمْزَةَ الْعُمَرِيِّ، عَنْ حُصَيْنِ بْنِ مُصْعَبٍ، أَنَّ أَبَا هُرَيْرَةَ قَالَ لَهُ رَجُلٌ‏:‏ إِنَّا نَتَرَاهَنُ بِالْحَمَامَيْنِ، فَنَكْرَهُ أَنْ نَجْعَلَ بَيْنَهُمَا مُحَلِّلاً تَخَوُّفَ أَنْ يَذْهَبَ بِهِ الْمُحَلِّلُ‏؟‏ فَقَالَ أَبُو هُرَيْرَةَ‏:‏ ذَلِكَ مِنْ فِعْلِ الصِّبْيَانِ، وَتُوشِكُونَ أَنْ تَتْرُكُوهُ‏.‏","english":{"narrator":"","text":"Husayn ibn Mus'ab reported that someone told Abu Hurayra, \"We\nwager two pigeons and we do not want for there to be a third unwagered\npigeon between them so that the unwagered pigeon might take the winnings.\"\nAbu Hurayra said, \"That is how children behave. You are at the point where\nyou should abandon that.\""}},{"id":6,"idInBook":6,"chapterId":54,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ‏:‏ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، قَالَ‏:‏ أَخْبَرَنَا ثَابِتٌ، عَنْ أَنَسٍ، أَنَّ الْبَرَاءَ بْنَ مَالِكٍ كَانَ يَحْدُو بِالرِّجَالِ، وَكَانَ أَنْجَشَةُ يَحْدُو بِالنِّسَاءِ، وَكَانَ حَسَنَ الصَّوْتِ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ يَا أَنْجَشَةُ، رُوَيْدَكَ سَوْقَكَ بِالْقَوَارِيرِ‏.‏","english":{"narrator":"","text":"It is related tht al-Bara' ibn Malik used to do the camel-chant\nfor the men and Anjasha used to do the camel-chant for the women. He had\na good voice and the Prophet, may Allah bless him and grant him peace,\nsaid, \"Anjasha, be gentle when you drive the glass-vessels.\""}},{"id":7,"idInBook":7,"chapterId":54,"bookId":15,"arabic":"حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، قَالَ‏:‏ حَدَّثَنَا خَالِدُ بْنُ عَبْدِ اللهِ، قَالَ‏:‏ أَخْبَرَنَا عَطَاءُ بْنُ السَّائِبِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، فِي قَوْلِهِ عَزَّ وَجَلَّ‏:‏ ‏{‏وَمِنَ النَّاسِ مَنْ يَشْتَرِي لَهْوَ الْحَدِيثِ‏}‏، قَالَ‏:‏ الْغِنَاءُ وَأَشْبَاهُهُ‏.‏","english":{"narrator":"","text":"Ibn 'Abbas said that the words of Allah in Luqman (35:6), \"There\nare people who trade in distracting tales\" mean \"singing and things\nlike it.\""}},{"id":8,"idInBook":8,"chapterId":54,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، قَالَ‏:‏ أَخْبَرَنَا الْفَزَارِيُّ، وَأَبُو مُعَاوِيَةَ، قَالاَ‏:‏ أَخْبَرَنَا قِنَانُ بْنُ عَبْدِ اللهِ النَّهْمِيُّ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْسَجَةَ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ أَفْشُوا السَّلاَمَ تَسْلَمُوا، وَالأَشَرَةُ شَرٌّ‏.‏\nقَالَ أَبُو مُعَاوِيَةَ‏:‏ الأشَرَةُ‏:‏ الْعَبَثُ‏.‏","english":{"narrator":"","text":"Al-Bara' ibn 'Azib reported that the Messenger of Allah, may Allah\nbless him and grant him peace, said, \"Extend the greeting and you will\nbe safe. The saw is evil.\""}},{"id":9,"idInBook":9,"chapterId":54,"bookId":15,"arabic":"حَدَّثَنَا عِصَامٌ، قَالَ‏:‏ حَدَّثَنَا حَرِيزٌ، عَنْ سَلْمَانَ الأَلَهَانِيِّ، عَنْ فَضَالَةَ بْنِ عُبَيْدٍ، وَكَانَ مَجْمَعًا مِنَ الْمُجَامِعِ، فَبَلَغَهُ أَنَّ أَقْوَامًا يَلْعَبُونَ بِالْكُوبَةِ، فَقَامَ غَضْبَانًا يَنْهَى عَنْهَا أَشَدَّ النَّهْيِ، ثُمَّ قَالَ‏:‏ أَلاَ إِنَّ اللاَّعِبَ بِهَا لَيَأْكُلُ قَمْرَهَا كَآكِلِ لَحْمِ الْخِنْزِيرِ، وَمُتَوَضِّئٍ بِالدَّمِ‏.‏\nيَعْنِي بِالْكُوبَةِ‏:‏ النَّرْدَ‏.‏","english":{"narrator":"","text":"Salman al-Ilhani reported that Fadala ibn 'Ubayd was in a gathering.\nHe heard that some people were playing backgammon. He got up in anger and\nforbade it in the strongest possible terms. Then he said, \"Anyone who plays\nit in order to consume its winnings is like someone who eats pig meat and\ndoes wudu' with blood.\""}},{"id":10,"idInBook":10,"chapterId":54,"bookId":15,"arabic":"حَدَّثَنَا عُبَيْدُ اللهِ بْنُ سَعِيدٍ، عَنِ الْقَاسِمِ بْنِ الْحَكَمِ الْقَاضِي، قَالَ‏:‏ أَخْبَرَنَا عُبَيْدُ اللهِ بْنُ الْوَلِيدِ الْوَصَّافِيُّ، عَنِ الْفُضَيْلِ بْنِ مُسْلِمٍ، عَنْ أَبِيهِ قَالَ‏:‏ كَانَ عَلِيٌّ رَضِيَ اللَّهُ عَنْهُ إِذَا خَرَجَ مِنْ بَابِ الْقَصْرِ، فَرَأَى أَصْحَابَ النَّرْدِ انْطَلَقَ بِهِمْ فَعَقَلَهُمْ مِنْ غُدْوَةٍ إِلَى اللَّيْلِ، فَمِنْهُمْ مَنْ يُعْقَلُ إِلَى نِصْفِ النَّهَارِ‏.‏ قَالَ‏:‏ وَكَانَ الَّذِي يُعْقَلُ إِلَى اللَّيْلِ هُمُ الَّذِينَ يُعَامِلُونَ بِالْوَرِقِ، وَكَانَ الَّذِي يُعْقَلُ إِلَى نِصْفِ النَّهَارِ الَّذِينَ يَلْهُونَ بِهَا، وَكَانَ يَأْمُرُ أَنْ لا يُسَلِّمُوا عَلَيْهِمْ‏.‏","english":{"narrator":"","text":"Al-Fadil ibn Muslim reported that his father said, \"When 'Ali,\nmay Allah be pleased with him, went out through the Bab al-Qasr, he saw\nsome backgammon players. He took them and locked them up from morning to\nnight. Some of them he only locked up for half the day. Those he locked\nup until night were those who used silver. Those he locked up for half\nthe day were those who played it. He also commanded that they should not\nbe greeted.\""}},{"id":11,"idInBook":11,"chapterId":54,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ قَالَ‏:‏ حَدَّثَنِي مَالِكٌ، عَنْ مُوسَى بْنِ مَيْسَرَةَ، عَنْ سَعِيدِ بْنِ أَبِي هِنْدَ، عَنْ أَبِي مُوسَى الأَشْعَرِيِّ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم قَالَ‏:‏ مَنْ لَعِبَ بِالنَّرْدِ فَقَدْ عَصَى اللَّهَ وَرَسُولَهُ‏.‏","english":{"narrator":"","text":"Abu Musa al-Ash'ari reported that the Messenger of Allah, may\nAllah bless him and grant him peace, said, \"Anyone who plays backgammon\nhas rebelled against Allah and His Messenger.\""}},{"id":12,"idInBook":12,"chapterId":54,"bookId":15,"arabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ‏:‏ حَدَّثَنَا مُعْتَمِرٌ قَالَ‏:‏ سَمِعْتُ عَبْدَ الْمَلِكِ، عَنْ أَبِي الأَحْوَصِ، عَنْ عَبْدِ اللهِ بْنِ مَسْعُودٍ قَالَ‏:‏ إِيَّاكُمْ وَهَاتَيْنِ الْكَعْبَتَيْنِ الْمَوْسُومَتَيْنِ اللَّتَيْنِ يُزْجَرَانِ زَجْرًا، فَإِنَّهُمَا مِنَ الْمَيْسِرِ‏.‏","english":{"narrator":"","text":"'Abdullah ibn Mas'ud said, \"Beware of these two marked cubes.\nThey should be forcibly prohibited. They are part of gambling.\""}},{"id":13,"idInBook":13,"chapterId":54,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، وَقَبِيصَةُ، قَالاَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ، عَنِ ابْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ مَنْ لَعِبَ بِالنَّرْدَشِيرِ فَكَأَنَّمَا صَبَغَ يَدَهُ فِي لَحْمِ خِنْزِيرٍ وَدَمِهِ‏.‏","english":{"narrator":"","text":"Burayda reported that the Prophet, may Allah bless him and grant\nhim peace, said, \"Someone who plays backgammon is like a person who puts\nhis hand in the meat and blood of a pig.\""}},{"id":14,"idInBook":14,"chapterId":54,"bookId":15,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، وَمَالِكُ بْنُ إِسْمَاعِيلَ، قَالاَ‏:‏ حَدَّثَنَا زُهَيْرٌ قَالَ‏:‏ حَدَّثَنِي عُبَيْدُ اللهِ قَالَ‏:‏ حَدَّثَنِي نَافِعٌ، عَنْ سَعِيدِ بْنِ أَبِي هِنْدَ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ مَنْ لَعِبَ بِالنَّرْدِ فَقَدْ عَصَى اللَّهَ وَرَسُولَهُ‏.‏","english":{"narrator":"","text":"Abu Musa reported that the Prophet, may Allah bless him and grant\nhim peace, said, \"Anyone who plays backgammon has rebelled against Allah\nand His Messenger.\""}},{"id":15,"idInBook":15,"chapterId":54,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ قَالَ‏:‏ حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللهِ بْنَ عُمَرَ كَانَ إِذَا وَجَدَ أَحَدًا مِنْ أَهْلِهِ يَلْعَبُ بِالنَّرْدِ ضَرَبَهُ، وَكَسَرَهَا‏.‏","english":{"narrator":"","text":"Nafi' related that if 'Abdullah ibn 'Umar found any of his family\nplaying backgammon, he would beat them and break the board."}},{"id":16,"idInBook":16,"chapterId":54,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ قَالَ‏:‏ حَدَّثَنِي مَالِكٌ، عَنْ عَلْقَمَةَ بْنِ أَبِي عَلْقَمَةَ، عَنْ أُمِّهِ، عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا، أَنَّهُ بَلَغَهَا أَنَّ أَهْلَ بَيْتٍ فِي دَارِهَا، كَانُوا سُكَّانًا فِيهَا، عِنْدَهُمْ نَرْدٌ، فَأَرْسَلَتْ إِلَيْهِمْ‏:‏ لَئِنْ لَمْ تُخْرِجُوهَا لَأُخْرِجَنَّكُمْ مِنْ دَارِي، وَأَنْكَرَتْ ذَلِكَ عَلَيْهِمْ‏.‏","english":{"narrator":"","text":"'Alqama ibn Abi 'Alqama reported from his mother that 'A'isha,\nmay Allah be pleased with her, heard that some people living in a room\nin her house had a backgammon game. She sent to them, saying, \"If you do\nnot remove it, I will evict you from my house.\" He censured them for playing\nthat."}},{"id":17,"idInBook":17,"chapterId":54,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى، قَالَ‏:‏ حَدَّثَنَا رَبِيعَةُ بْنُ كُلْثُومِ بْنِ جَبْرٍ قَالَ‏:‏ حَدَّثَنِي أَبِي قَالَ‏:‏ خَطَبَنَا ابْنُ الزُّبَيْرِ فَقَالَ‏:‏ يَا أَهْلَ مَكَّةَ، بَلَغَنِي عَنْ رِجَالٍ مِنْ قُرَيْشٍ يَلْعَبُونَ بِلُعْبَةٍ يُقَالُ لَهَا‏:‏ النَّرْدَشِيرُ، وَكَانَ أَعْسَرَ، قَالَ اللَّهُ‏:‏ ‏{‏إِنَّمَا الْخَمْرُ وَالْمَيْسِرُ‏}‏، وَإِنِّي أَحْلِفُ بِاللَّهِ‏:‏ لاَ أُوتَى بِرَجُلٍ لَعِبَ بِهَا إِلاَّ عَاقَبْتُهُ فِي شَعْرِهِ وَبَشَرِهِ، وَأَعْطَيْتُ سَلَبَهُ لِمَنْ أَتَانِي بِهِ‏.‏","english":{"narrator":"","text":"Kulthum ibn Jabir said, \"Ibn az-Zubayr addressed us and said,\n'People of Makka, I have heard that there are men of Quraysh who play a\ngame called backgammon. It is done with the left hand. Allah says, 'Wine\nand gambling.' (5:90) I swear by Allah that if anyone who plays it is brought\nbefore me, I will punish him in his hair and skin, and I will give his\nbooty to the one who brings him to me.\""}},{"id":18,"idInBook":18,"chapterId":54,"bookId":15,"arabic":"حَدَّثَنَا ابْنُ الصَّبَّاحِ، قَالَ‏:‏ حَدَّثَنَا إِسْمَاعِيلُ بْنُ زَكَرِيَّا، عَنْ عُبَيْدِ بْنِ أَبِي أُمَيَّةَ الْحَنَفِيِّ هُوَ الطَّنَافِسِيُّ، قَالَ‏:‏ حَدَّثَنِي يَعْلَى أَبُو مُرَّةَ قَالَ‏:‏ سَمِعْتُ أَبَا هُرَيْرَةَ فِي الَّذِي يَلْعَبُ بِالنَّرْدِ قِمَارًا‏:‏ كَالَّذِي يَأْكُلُ لَحْمَ الْخِنْزِيرِ، وَالَّذِي يَلْعَبُ بِهِ مِنْ غَيْرِ الْقِمَارِ كَالَّذِي يَغْمِسُ يَدَهُ فِي دَمِ خِنْزِيرٍ، وَالَّذِي يَجْلِسُ عِنْدَهَا يَنْظُرُ إِلَيْهَا كَالَّذِي يَنْظُرُ إِلَى لَحْمِ الْخِنْزِيرِ‏.‏","english":{"narrator":"","text":"Ya'la ibn Murra reported that he heard Abu Hurayra speaking about\nsomeone who plays backgammon and bets on it, saying that he is like someone\nwho eats pig meat and that the person who plays it without betting on it\nis like someone who washes his hands in pig's blood. The person who sits\nlooking at it is like someone who looks at pig's meat."}},{"id":19,"idInBook":19,"chapterId":54,"bookId":15,"arabic":"حَدَّثَنَا الْحَسَنُ بْنُ عُمَرَ، قَالَ‏:‏ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، عَنْ حَبِيبٍ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللهِ بْنِ عَمْرِو بْنِ الْعَاصِ قَالَ‏:‏ اللاَّعِبُ بِالْفُصَّيْنِ قِمَارًا كَآكِلِ لَحْمِ الْخِنْزِيرِ، وَاللاَّعِبُ بِهِمَا غَيْرَ قِمَارٍ كَالْغَامِسِ يَدَهُ فِي دَمِ خِنْزِيرٍ‏.‏","english":{"narrator":"","text":"'Abdullah ibn 'Amr ibn al-'As said, \"Someone who plays dice for\na bet is like a person who eats pig meat. Someone who plays it without betting\nis like someone who washes his hands in pig's blood.\""}},{"id":20,"idInBook":20,"chapterId":54,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ صَالِحٍ قَالَ‏:‏ حَدَّثَنِي اللَّيْثُ قَالَ‏:‏ حَدَّثَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ قَالَ‏:‏ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيِّبِ، أَنَّ أَبَا هُرَيْرَةَ أَخْبَرَهُ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم قَالَ‏:‏ لاَ يُلْدَغُ الْمُؤْمِنُ مِنْ جُحْرٍ مَرَّتَيْنِ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"A believer is not hurt by the same stone\ntwice.\""}},{"id":21,"idInBook":21,"chapterId":54,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ يَزِيدَ، قَالَ‏:‏ حَدَّثَنَا سَعِيدُ بْنُ أَبِي أَيُّوبَ قَالَ‏:‏ حَدَّثَنِي يَحْيَى بْنُ أَبِي سُلَيْمَانَ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ مَنْ رَمَانَا بِاللَّيْلِ فَلَيْسَ مِنَّا‏.‏\nقَالَ أَبُو عَبْدِ اللهِ‏:‏ فِي إِسْنَادِهِ نَظَرٌ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"Anyone who shoots at night is not one of us.\""}},{"id":22,"idInBook":22,"chapterId":54,"bookId":15,"arabic":"حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، قَالَ‏:‏ حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ مَنْ حَمَلَ عَلَيْنَا السِّلاَحَ فَلَيْسَ مِنَّا‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"Anyone who bears arms against us is not\none of us.\""}},{"id":23,"idInBook":23,"chapterId":54,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاءِ، قَالَ‏:‏ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدِ بْنِ عَبْدِ اللهِ بْنِ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ مَنْ حَمَلَ عَلَيْنَا السِّلاَحَ فَلَيْسَ مِنَّا‏.‏","english":{"narrator":"","text":"Same hadith as 1280, but from Abu Musa."}}],"chapter":{"id":54,"bookId":15,"arabic":"كتاب القمار ونحوه","english":"Betting and similar pastimes"}}