{"metadata":{"length":23,"arabic":{"title":"الأدب المفرد","author":"الإمام محمد بن إسماعيل البخاري","introduction":"كتاب المعرفة"},"english":{"title":"Al-Adab Al-Mufrad","author":"Imam Muhammad ibn Ismail al-Bukhari","introduction":"Recognition"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":55,"bookId":15,"arabic":"حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، قَالَ‏:‏ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ أَبِي الْمَلِيحِ، عَنْ رَجُلٍ مِنْ قَوْمِهِ، وَكَانَتْ لَهُ صُحْبَةٌ، قَالَ‏:‏ قَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ إِذَا أَرَادَ اللَّهُ قَبْضَ عَبْدٍ بِأَرْضٍ جَعَلَ لَهُ بِهَا حَاجَةً‏.‏","english":{"narrator":"","text":"Abu'l-Malih reported from one of his people (who was a Companion)\nthat the Prophet, may Allah bless him and grant him peace, said, \"When\nAllah wants one of His slaves to die in some land, he makes him have a\nreason for going there.\""}},{"id":2,"idInBook":2,"chapterId":55,"bookId":15,"arabic":"حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، قَالَ‏:‏ حَدَّثَنَا يَزِيدُ بْنُ إِبْرَاهِيمَ، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ تَمَخَّطَ فِي ثَوْبِهِ ثُمَّ قَالَ‏:‏ بَخٍ بَخٍ، أَبُو هُرَيْرَةَ يَتَمَخَّطُ فِي الْكَتَّانِ، رَأَيْتُنِي أُصْرَعُ بَيْنَ حُجْرَةِ عَائِشَةَ وَالْمِنْبَرِ، يَقُولُ النَّاسُ‏:‏ مَجْنُونٌ، وَمَا بِي إِلا الْجُوعُ‏.‏","english":{"narrator":"","text":"Muhammad ibn Sirin related that Abu Hurayra blew his nose in his\ngarment and then said, \"Squirt! Squirt! Abu Hurayra blows his nose\nin linen. You saw me lying between 'A'isha's room and the minbar\nwhen people said I was crazy, but I was only hungry.\""}},{"id":3,"idInBook":3,"chapterId":55,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، قَالَ‏:‏ أَخْبَرَنَا عَبْدَةُ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، قَالَ‏:‏ حَدَّثَنَا أَبُو سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ‏:‏ قَالُوا‏:‏ يَا رَسُولَ اللهِ، إِنَّا نَجِدُ فِي أَنْفُسِنَا شَيْئًا مَا نُحِبُّ أَنْ نَتَكَلَّمَ بِهِ وَإِنَّ لَنَا مَا طَلَعَتْ عَلَيْهِ الشَّمْسُ، قَالَ‏:‏ أَوَ قَدْ وَجَدْتُمْ ذَلِكَ‏؟‏ قَالُوا‏:‏ نَعَمْ، قَالَ‏:‏ ذَاكَ صَرِيحُ الإيمَانِ‏.‏","english":{"narrator":"","text":"Abu Hurayra related, \"Some people said, 'Messenger of Allah, we\nfeel in ourselves something which we do not want to speak about and we\nhave been in that state since sunrise.' He said, 'Have you really felt\nlike that?' 'Yes,' they said. He said, 'That is clear belief.'\""}},{"id":4,"idInBook":4,"chapterId":55,"bookId":15,"arabic":"وَعَنْ جَرِيرٍ، عَنْ لَيْثٍ، عَنْ شَهْرِ بْنِ حَوْشَبٍ قَالَ‏:‏ دَخَلْتُ أَنَا وَخَالِي عَلَى عَائِشَةَ، فَقَالَ‏:‏ إِنَّ أَحَدَنَا يَعْرُضُ فِي صَدْرِهِ مَا لَوْ تَكَلَّمَ بِهِ ذَهَبَتْ آخِرَتُهُ، وَلَوْ ظَهَرَ لَقُتِلَ بِهِ، قَالَ‏:‏ فَكَبَّرَتْ ثَلاَثًا، ثُمَّ قَالَتْ‏:‏ سُئِلَ رَسُولُ اللهِ صلى الله عليه وسلم عَنْ ذَلِكَ، فَقَالَ‏:‏ إِذَا كَانَ ذَلِكَ مِنْ أَحَدِكُمْ فَلْيُكَبِّرْ ثَلاَثًا، فَإِنَّهُ لَنْ يُحِسَّ ذَلِكَ إِلا مُؤْمِنٌ‏.‏","english":{"narrator":"","text":"Shahr ibn Hawshab said, \"Me and my maternal aunt visited 'A'isha\nand said, 'Sometimes something occurs to one of us such that, if he had\nspoken about it, that would have been the end of his hopes for the Next\nWorld. If it were to be revealed, he would be killed for it.' She said\nthe takbir three times and then said, 'The Messenger of Allah, may Allah\nbless him and grant him peace, was asked about that and said, \"If that\nhappens to one of you, he should say the takbir three times. Only a believer\nfeels that.'\""}},{"id":5,"idInBook":5,"chapterId":55,"bookId":15,"arabic":"وَعَنْ عُقْبَةَ بْنِ خَالِدٍ السَّكُونِيِّ، قَالَ‏:‏ حَدَّثَنَا أَبُو سَعْدٍ سَعِيدُ بْنُ مَرْزُبَانَ قَالَ‏:‏ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ يَقُولُ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ لَنْ يَبْرَحَ النَّاسُ يَسْأَلُونَ عَمَّا لَمْ يَكُنْ، حَتَّى يَقُولُوا‏:‏ اللَّهُ خَالِقُ كُلِّ شَيْءٍ، فَمَنْ خَلَقَ اللَّهَ‏.‏","english":{"narrator":"","text":"Anas ibn Malik said, \"The Messenger of Allah, may Allah bless\nhim and grant him peace, said, 'People will continue to ask about things\nthat do not exist to such an extent that they will say, \"Allah created\neverything, so who created Allah?\"'\""}},{"id":6,"idInBook":6,"chapterId":55,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ قَالَ‏:‏ حَدَّثَنِي مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم قَالَ‏:‏ إِيَّاكُمْ وَ الظَّنَّ، فَإِنَّ الظَّنَّ أَكْذَبُ الْحَدِيثِ، وَلاَ تَجَسَّسُوا، وَلاَ تَنَافَسُوا، وَلاَ تَدَابَرُوا، وَلاَ تَحَاسَدُوا، وَلاَ تَبَاغَضُوا، وَكُونُوا عِبَادَ اللهِ إِخْوَانًا‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"Beware of suspicion. Suspicion is the worst type of lie. Do not spy. Do not fight one another. Do not try\nto ensnare one another (in sales). Do not envy each other. Do not hate one another. Be slaves of\nAllah and brothers.\""}},{"id":7,"idInBook":7,"chapterId":55,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ‏:‏ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، قَالَ‏:‏ أَخْبَرَنَا ثَابِتٌ، عَنْ أَنَسٍ قَالَ‏:‏ بَيْنَمَا النَّبِيُّ صلى الله عليه وسلم مَعَ امْرَأَةٍ مِنْ نِسَائِهِ، إِذْ مَرَّ بِهِ رَجُلٌ، فَدَعَاهُ النَّبِيُّ صلى الله عليه وسلم فَقَالَ‏:‏ يَا فُلاَنُ، إِنَّ هَذِهِ زَوْجَتِي فُلاَنَةٌ، قَالَ‏:‏ مَنْ كُنْتُ أَظُنُّ بِهِ فَلَمْ أَكُنْ أَظُنُّ بِكَ، قَالَ‏:‏ إِنَّ الشَّيْطَانَ يَجْرِي مِنِ ابْنِ آدَمَ مَجْرَى الدَّمِ‏.‏","english":{"narrator":"","text":"Anas said, \"While the Prophet, may Allah bless him and grant him\npeace, was with one of his wives, a man passed by and the Prophet, may\nAllah bless him and grant him peace, called him and said, 'So-and-so, this\nis my wife so-and-so.' The man said, 'Whoever I might suspect, I would\nnot suspect you!' The Prophet said, 'Shaytan flows in the son of Adam like\nblood flows.'\""}},{"id":8,"idInBook":8,"chapterId":55,"bookId":15,"arabic":"حَدَّثَنَا يُوسُفُ بْنُ يَعْقُوبَ، قَالَ‏:‏ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ أَخُو عُبَيْدٍ الْقُرَشِيِّ، قَالَ‏:‏ حَدَّثَنَا الأَعْمَشُ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللهِ قَالَ‏:‏ مَا يَزَالُ الْمَسْرُوقُ مِنْهُ يَتَظَنَّى حَتَّى يَصِيرَ أَعْظَمَ مِنَ السَّارِقِ‏.‏","english":{"narrator":"","text":"'Abdullah said, \"The person who has had something stolen from\nhim continues to be suspicious until he is worse than the thief.\""}},{"id":9,"idInBook":9,"chapterId":55,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ‏:‏ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، قَالَ‏:‏ أَخْبَرَنَا عَبْدُ اللهِ بْنُ عُثْمَانَ بْنِ عَبْدِ اللهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ، عَنْ بِلاَلِ بْنِ سَعْدٍ الأَشْعَرِيِّ، أَنَّ مُعَاوِيَةَ كَتَبَ إِلَى أَبِي الدَّرْدَاءِ‏:‏ اكْتُبْ إِلَيَّ فُسَّاقَ دِمَشْقَ، فَقَالَ‏:‏ مَا لِي وَفُسَّاقُ دِمَشْقَ‏؟‏ وَمِنْ أَيْنَ أَعْرِفُهُمْ‏؟‏ فَقَالَ ابْنُهُ بِلاَلٌ‏:‏ أَنَا أَكْتُبُهُمْ، فَكَتَبَهُمْ، قَالَ‏:‏ مِنْ أَيْنَ عَلِمْتَ‏؟‏ مَا عَرَفْتَ أَنَّهُمْ فُسَّاقٌ إِلاَّ وَأَنْتَ مِنْهُمْ، ابْدَأْ بِنَفْسِكَ، وَلَمْ يُرْسِلْ بِأَسْمَائِهِمْ‏.‏","english":{"narrator":"","text":"Bilal ibn Sa'd al-Ash'ari related that Mu'awiya wrote to Abu Dharr,\n\"Write down for me the deviants of Damascus.\" Abu Dharr said, \"What do\nI have to do with the deviants of Damascus and how would I know them?\"\nHis son Bilal said, \"I will write them,\" so he wrote them. Abu Dharr said,\n\"How do you know? You would only know that they are deviants if you were\none of them. Begin with yourself and do not send their names.\""}},{"id":10,"idInBook":10,"chapterId":55,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ قَالَ‏:‏ حَدَّثَنِي سُكَيْنُ بْنُ عَبْدِ الْعَزِيزِ بْنِ قَيْسٍ، عَنْ أَبِيهِ قَالَ‏:‏ دَخَلْتُ عَلَى عَبْدِ اللهِ بْنِ عُمَرَ، وَجَارِيَةٌ تَحْلِقُ عَنْهُ الشَّعْرَ، وَقَالَ‏:‏ النُّورَةُ تُرِقُّ الْجِلْدَ‏.‏","english":{"narrator":"","text":"'Abdul-'Aziz ibn Qays said, \"I visited 'Abdullah ibn 'Umar while\na slavegirl was shaving his hair.\" He said, \"The limestone depilatory makes\nthe skin supple.\""}},{"id":11,"idInBook":11,"chapterId":55,"bookId":15,"arabic":"حَدَّثَنَا يَحْيَى بْنُ قَزَعَةَ، قَالَ‏:‏ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ الْفِطْرَةُ خَمْسٌ‏:‏ الْخِتَانُ، وَالِاسْتِحْدَادُ، وَنَتْفُ الإِبْطِ، وَقَصُّ الشَّارِبِ، وَتَقْلِيمُ الأظْفَارِ‏.‏","english":{"narrator":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"The fitra consists of five:","text":"circumcision, shaving\nthe pubic hair, plucking the armpits, clipping the moustache and clipping\nthe nails.\""}},{"id":12,"idInBook":12,"chapterId":55,"bookId":15,"arabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ‏:‏ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِسْحَاقَ قَالَ‏:‏ حَدَّثَنِي سَعِيدُ بْنُ أَبِي سَعِيدٍ الْمَقْبُرِيُّ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم‏:‏ خَمْسٌ مِنَ الْفِطْرَةِ‏:‏ الْخِتَانُ، وَحَلْقُ الْعَانَةِ، وَتَقْلِيمُ الأَظْفَارِ، وَنَتْفُ الضَّبْعِ، وَقَصُّ الشَّارِبِ‏.‏","english":{"narrator":"Abu Hurayra reported that the Prophet, may Allah bless him and grant him peace, said, \"Five from the fitra:","text":"circumcision, shaving the pubic hair, clipping the nails, plucking the armpits, and clipping the moustache.\""}},{"id":13,"idInBook":13,"chapterId":55,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ الْعَزِيزِ قَالَ‏:‏ حَدَّثَنِي مَالِكٌ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ‏:‏ خَمْسٌ مِنَ الْفِطْرَةِ‏:‏ تَقْلِيمُ الأَظْفَارِ، وَقَصُّ الشَّارِبِ، وَنَتْفُ الإِبْطِ، وَحَلْقُ الْعَانَةِ، وَالْخِتَانُ‏.‏","english":{"narrator":"","text":"Similar to 1292."}},{"id":14,"idInBook":14,"chapterId":55,"bookId":15,"arabic":"حَدَّثَنَا أَبُو عَاصِمٍ، عَنْ جَعْفَرِ بْنِ يَحْيَى بْنِ ثَوْبَانَ قَالَ‏:‏ حَدَّثَنِي عُمَارَةُ بْنُ ثَوْبَانَ قَالَ‏:‏ حَدَّثَنِي أَبُو الطُّفَيْلِ قَالَ‏:‏ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يَقْسِمُ لَحْمًا بِالْجِعْرَانَةِ، وَأَنَا يَوْمَئِذٍ غُلاَمٌ أَحْمِلُ عُضْوَ الْبَعِيرِ، فَأَتَتْهُ امْرَأَةٌ، فَبَسَطَ لَهَا رِدَاءَهُ، قُلْتُ‏:‏ مَنْ هَذِهِ‏؟‏ قَالَ‏:‏ هَذِهِ أُمُّهُ الَّتِي أَرْضَعَتْهُ‏.‏","english":{"narrator":"","text":"Abu't-Tufayl reported, \"I saw the Prophet, may Allah bless him\nand grant him peace, divide the meat at al-Ji'rana. At that time, I was\na boy who carried the joint of the camel (after it had been sacrificed).\nA woman came to him and he spread out his robe for her. I asked, 'Who is\nthis?' The reply was, 'This is the woman who suckled him.'\""}},{"id":15,"idInBook":15,"chapterId":55,"bookId":15,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ‏:‏ حَدَّثَنَا يُونُسُ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ‏:‏ قَالَ رَجُلٌ‏:‏ أَصْلَحَ اللَّهُ الأَمِيرَ، إِنَّ آذِنَكَ يَعْرِفُ رِجَالاً فَيُؤْثِرُهُمْ بِالإِذْنِ، قَالَ‏:‏ عَذَرَهُ اللَّهُ، إِنَّ الْمَعْرِفَةَ لَتَنْفَعُ عِنْدَ الْكَلْبِ الْعَقُورِ، وَعِنْدَ الْجَمَلِ الصَّؤُولِ‏.‏","english":{"narrator":"","text":"Al-Mughira ibn Shu'ba reported that a man said, \"May Allah make\nthe amir thrive! Your chamberlain recognises certain men and gives them\npreference in permission to enter.\" He said, \"May Allah excuse him! Recognition is beneficial (dealing) with a vicious dog and attacking camel.\""}},{"id":16,"idInBook":16,"chapterId":55,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ‏:‏ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ مُغِيرَةَ، عَنْ إِبْرَاهِيمَ قَالَ‏:‏ كَانَ أَصْحَابُنَا يُرَخِّصُونَ لَنَا فِي اللُّعَبِ كُلِّهَا، غَيْرِ الْكِلاَبِ قَالَ أَبُو عَبْدِ اللهِ‏:‏ يَعْنِي لِلصِّبْيَانِ‏.‏","english":{"narrator":"","text":"Ibrahim said, \"Our companions used to allow us all sorts of play\nthings except for dogs.\""}},{"id":17,"idInBook":17,"chapterId":55,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْعَزِيزِ قَالَ‏:‏ حَدَّثَنِي شَيْخٌ مِنْ أَهْلِ الْخَيْرِ يُكَنَّى أَبَا عُقْبَةَ قَالَ‏:‏ مَرَرْتُ مَعَ ابْنِ عُمَرَ مَرَّةً بِالطَّرِيقِ، فَمَرَّ بِغِلْمَةٍ مِنَ الْحَبَشِ، فَرَآهُمْ يَلْعَبُونَ، فَأَخْرَجَ دِرْهَمَيْنِ فَأَعْطَاهُمْ‏.‏","english":{"narrator":"","text":"Abu 'Uqba said, \"I once walked along the road with Ibn 'Umar.\nI passed some Abyssinian lads who were playing and he brought out two dirhams\nwhich he gave to them.\""}},{"id":18,"idInBook":18,"chapterId":55,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ قَالَ‏:‏ أَخْبَرَنِي عَبْدُ الْعَزِيزِ بْنُ أَبِي سَلَمَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يُسَرِّبُ إِلَيَّ صَوَاحِبِي يَلْعَبْنَ بِاللَّعِبِ، الْبَنَاتِ الصِّغَارِ‏.‏","english":{"narrator":"","text":"'A'isha reported that the Prophet, may Allah bless him and grant\nhim peace, used to call her companions to her who were playing with dolls.\""}},{"id":19,"idInBook":19,"chapterId":55,"bookId":15,"arabic":"حَدَّثَنَا شِهَابُ بْنُ مَعْمَرٍ، قَالَ‏:‏ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ رَأَى رَسُولُ اللهِ صلى الله عليه وسلم رَجُلاً يَتْبَعُ حَمَامَةً، قَالَ‏:‏ شَيْطَانٌ يَتْبَعُ شَيْطَانَةً‏.‏","english":{"narrator":"","text":"Abu Hurayra said, \"The Messenger of Allah, may Allah bless him\nand grant him peace, saw a man following a dove and said, 'A shaytan following\na shaytan.'\""}},{"id":20,"idInBook":20,"chapterId":55,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ‏:‏ حَدَّثَنَا يُوسُفُ بْنُ عَبْدَةَ، قَالَ‏:‏ حَدَّثَنَا الْحَسَنُ قَالَ‏:‏ كَانَ عُثْمَانُ لاَ يَخْطُبُ جُمُعَةً إِلاَّ أَمَرَ بِقَتْلِ الْكِلاَبِ، وَذَبْحِ الْحَمَامِ‏.‏","english":{"narrator":"","text":"Al-Hasan said, \"'Uthman did not speak on any Jumu'a without commanding\nthe killing of dogs and slaughtering of doves.\""}},{"id":21,"idInBook":21,"chapterId":55,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدٌ، قَالَ‏:‏ أَخْبَرَنَا عَبْدُ اللهِ، قَالَ‏:‏ حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ قَالَ‏:‏ حَدَّثَنِي عُقَيْلُ بْنُ خَالِدٍ، أَنَّ سَعِيدَ بْنَ سُلَيْمَانَ بْنِ زَيْدِ بْنِ ثَابِتٍ حَدَّثَهُ، عَنْ أَبِيهِ، عَنْ جَدِّهِ زَيْدِ بْنِ ثَابِتٍ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ جَاءَهُ يَسْتَأْذِنُ عَلَيْهِ يَوْمًا، فَأَذِنَ لَهُ وَرَأْسُهُ فِي يَدِ جَارِيَةٍ لَهُ تُرَجِّلُهُ، فَنَزَعَ رَأْسَهُ، فَقَالَ لَهُ عُمَرُ‏:‏ دَعْهَا تُرَجِّلُكَ، فَقَالَ‏:‏ يَا أَمِيرَ الْمُؤْمِنِينَ، لَوْ أَرْسَلْتَ إِلَيَّ جِئْتُكَ، فَقَالَ عُمَرُ‏:‏ إِنَّمَا الْحَاجَةُ لِي‏.‏","english":{"narrator":"","text":"Zayd ibn Thabit reported that 'Umar ibn al-Khattab came to him\nto ask to see him one day and he gave him permission while his head was\nin the hands of a slavegirl of his who was combing his hair. He removed\nhis head and 'Umar said to him, 'Let her comb it.' He said, 'Amir al-Mu'minin,\nif you were to send for me, I would come to you.' ''Umar said, 'It is my\nneed.'\""}},{"id":22,"idInBook":22,"chapterId":55,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى، عَنْ حَمَّادِ بْنِ سَلَمَةَ، قَالَ‏:‏ أَخْبَرَنَا ثَابِتٌ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَيَّاشٍ الْقُرَشِيِّ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ إِذَا تَنَخَّعَ بَيْنَ يَدَيِ الْقَوْمِ فَلْيُوَارِ بِكَفَّيْهِ حَتَّى تَقَعَ نُخَاعَتُهُ إِلَى الأَرْضِ، وَإِذَا صَامَ فَلْيَدَّهِنْ، لاَ يُرَى عَلَيْهِ أَثَرُ الصَّوْمِ‏.‏","english":{"narrator":"","text":"Abu Hurayra said, \"When someone spits in the presence of people,\nlet him catch it with his palms so that his spit does not fall on the ground.\nWhen he fasts, he should oil his palm so that the trace of the fast is\nnot seen on him.\""}},{"id":23,"idInBook":23,"chapterId":55,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، قَالَ‏:‏ أَخْبَرَنَا هُشَيْمٌ، عَنْ إِسْمَاعِيلَ بْنِ سَالِمٍ، عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ قَالَ‏:‏ كَانُوا يُحِبُّونَ إِذَا حَدَّثَ الرَّجُلُ أَنْ لاَ يُقْبِلَ عَلَى الرَّجُلِ الْوَاحِدِ، وَلَكِنْ لِيَعُمَّهُمْ‏.‏","english":{"narrator":"","text":"Habib ibn Abi Thabit said, \"When a man spoke, they used to like\nthat he not turn to one particular man, but rather he should address everyone.\""}}],"chapter":{"id":55,"bookId":15,"arabic":"كتاب المعرفة","english":"Recognition"}}