{"metadata":{"length":12,"arabic":{"title":"الأدب المفرد","author":"الإمام محمد بن إسماعيل البخاري","introduction":"كتاب الفضول والجفاء"},"english":{"title":"Al-Adab Al-Mufrad","author":"Imam Muhammad ibn Ismail al-Bukhari","introduction":"Meddling and Harshness"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":56,"bookId":15,"arabic":"حَدَّثَنَا قُتَيْبَةُ، قَالَ‏:‏ حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ، عَنِ الأَجْلَحِ، عَنِ ابْنِ أَبِي الْهُذَيْلِ قَالَ‏:‏ عَادَ عَبْدُ اللهِ رَجُلاً، وَمَعَهُ رَجُلٌ مِنْ أَصْحَابِهِ، فَلَمَّا دَخَلَ الدَّارَ جَعَلَ صَاحِبُهُ يَنْظُرُ، فَقَالَ لَهُ عَبْدُ اللهِ‏:‏ وَاللَّهِ لَوْ تَفَقَّأَتْ عَيْنَاكَ كَانَ خَيْرًا لَكَ‏.‏","english":{"narrator":"","text":"Ibn Abi'l-Hudhayl said, \"Messenger of Allah visited a man with\none of his companions. When he entered the house, his companion began to\nlook around. 'Abdullah told him, 'By Allah, it would have been better for\nyou if your eyes had been gouged out.\""}},{"id":2,"idInBook":2,"chapterId":56,"bookId":15,"arabic":"حَدَّثَنَا خَلاَّدٌ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْعَزِيزِ، عَنْ نَافِعٍ، أَنَّ نَفَرًا مِنْ أَهْلِ الْعِرَاقِ دَخَلُوا عَلَى ابْنِ عُمَرَ، فَرَأَوْا عَلَى خَادِمٍ لَهُمْ طَوْقًا مِنْ ذَهَبٍ، فَنَظَرَ بَعْضُهُمْ إِلَى بَعْضٍ، فَقَالَ‏:‏ مَا أَفْطَنَكُمْ لِلشَّرِّ‏.‏","english":{"narrator":"","text":"Nafi' reported that a group of the people of Iraq visited Ibn\n'Umar. They saw a gold crown on one of their servants and looked at one\nanother. He remarked, \"How quick you are to see evil!\""}},{"id":3,"idInBook":3,"chapterId":56,"bookId":15,"arabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ‏:‏ حَدَّثَنَا مُعْتَمِرٌ، عَنْ لَيْثٍ، عَنْ عَطَاءٍ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ لاَ خَيْرَ فِي فُضُولِ الْكَلامِ‏.‏","english":{"narrator":"","text":"Abu Hurayra said, \"There is no good in excess words.\""}},{"id":4,"idInBook":4,"chapterId":56,"bookId":15,"arabic":"حَدَّثَنَا مَطَرٌ، قَالَ‏:‏ حَدَّثَنَا يَزِيدُ، قَالَ‏:‏ حَدَّثَنَا الْبَرَاءُ بْنُ يَزِيدَ، عَنْ عَبْدِ اللهِ بْنِ شَقِيقٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ شِرَارُ أُمَّتِي الثَّرْثَارُونَ، الْمُشَّدِّقُونَ، الْمُتَفَيْهِقُونَ، وَخِيَارُ أُمَّتِي أَحَاسِنُهُمْ أَخْلاقًا‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"The worst of my community are those who speak a\nlot, those who are diffuse in speech and those who fill their mouth with\nwords. The best of my community are the best of them in character.\""}},{"id":5,"idInBook":5,"chapterId":56,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ قَالَ‏:‏ حَدَّثَنِي مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم قَالَ‏:‏ مِنْ شَرِّ النَّاسِ ذُو الْوَجْهَيْنِ، الَّذِي يَأْتِي هَؤُلاَءِ بِوَجْهٍ، وَهَؤُلاَءِ بِوَجْهٍ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"The worst person is someone who is two-faced.\nHe is the person who comes to one group of people with one face and another\ngroup of people with another face.\""}},{"id":6,"idInBook":6,"chapterId":56,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَعِيدٍ الأَصْبَهَانِيُّ، قَالَ‏:‏ حَدَّثَنَا شَرِيكٌ، عَنْ رُكَيْنٍ، عَنْ نُعَيْمِ بْنِ حَنْظَلَةَ، عَنْ عَمَّارِ بْنِ يَاسِرٍ قَالَ‏:‏ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ‏:‏ مَنْ كَانَ ذَا وَجْهَيْنِ فِي الدُّنْيَا، كَانَ لَهُ لِسَانَانِ يَوْمَ الْقِيَامَةِ مِنْ نَارٍ، فَمَرَّ رَجُلٌ كَانَ ضَخْمًا، قَالَ‏:‏ هَذَا مِنْهُمْ‏.‏","english":{"narrator":"","text":"'Ammar ibn Yasir said, \"I heard the Prophet, may Allah bless him\nand grant him peace, say, \"The person who has two faces in this world will\nhave two tongues of the Fire on the Day of Rising.' He passed by a stout\nman and said, 'This is one of them.'\""}},{"id":7,"idInBook":7,"chapterId":56,"bookId":15,"arabic":"حَدَّثَنَا صَدَقَةُ، قَالَ‏:‏ حَدَّثَنَا ابْنُ عُيَيْنَةَ قَالَ‏:‏ سَمِعْتُ ابْنَ الْمُنْكَدِرِ قَالَ‏:‏ سَمِعَ عُرْوَةَ بْنَ الزُّبَيْرِ أَنَّ عَائِشَةَ أَخْبَرَتْهُ‏:‏ اسْتَأْذَنَ رَجُلٌ عَلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ‏:‏ ائْذَنُوا لَهُ، بِئْسَ أَخُو الْعَشِيرَةِ، فَلَمَّا دَخَلَ أَلاَنَ لَهُ الْكَلاَمَ، فَقُلْتُ‏:‏ يَا رَسُولَ اللهِ، قُلْتَ الَّذِي قُلْتَ، ثُمَّ أَلَنْتَ الْكَلاَمَ، قَالَ‏:‏ أَيْ عَائِشَةُ، إِنَّ شَرَّ النَّاسِ مَنْ تَرَكَهُ النَّاسُ، أَوْ وَدَعَهُ النَّاسُ، اتِّقَاءَ فُحْشِهِ‏.‏","english":{"narrator":"","text":"'Urwa ibn az-Zubayr heard 'A'isha say, \"A man asked permission\nto visit the Prophet, may Allah bless him and grant him peace, and the\nProphet said, 'Give him permission. He is an evil brother of his tribe.'\nWhen he entered he spoke kindly to him. I said, 'Messenger of Allah, you\nsaid what you said and then you spoke kindly to him.' He replied, 'Yes,\n'A'isha. The worst of people is the one people avoid due to his harsh nature.'\""}},{"id":8,"idInBook":8,"chapterId":56,"bookId":15,"arabic":"حَدَّثَنَا آدَمُ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَبِي السَّوَّارِ الْعَدَوِيِّ قَالَ‏:‏ سَمِعْتُ عِمْرَانَ بْنَ حُصَيْنٍ قَالَ‏:‏ قَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ الْحَيَاءُ لاَ يَأْتِي إِلاَّ بِخَيْرٍ، فَقَالَ بُشَيْرُ بْنُ كَعْبٍ‏:‏ مَكْتُوبٌ فِي الْحِكْمَةِ‏:‏ إِنَّ مِنَ الْحَيَاءِ وَقَارًا، إِنَّ مِنَ الْحَيَاءِ سَكِينَةً، فَقَالَ لَهُ عِمْرَانُ‏:‏ أُحَدِّثُكَ عَنْ رَسُولِ اللهِ صلى الله عليه وسلم وَتُحَدِّثُنِي عَنْ صَحِيفَتِكَ‏.‏","english":{"narrator":"","text":"'Imran ibn Husayn said, \"The Prophet, may Allah bless him and\ngrant him peace, said, \"Modesty brings nothing but good.\" Bashir ibn Ka'b\nsaid, \"It is written in books of wisdom, 'From modesty comes dignity. From\nmodesty comes tranquillity.''\" 'Imran said, \"I relate to you from the Messenger\nof Allah and you then relate to me from some book?!\""}},{"id":9,"idInBook":9,"chapterId":56,"bookId":15,"arabic":"حَدَّثَنَا بِشْرُ بْنُ مُحَمَّدٍ، قَالَ‏:‏ أَخْبَرَنَا عَبْدُ اللهِ، قَالَ‏:‏ أَخْبَرَنَا جَرِيرُ بْنُ حَازِمٍ، عَنْ يَعْلَى بْنِ حَكِيمٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عُمَرَ قَالَ‏:‏ إِنَّ الْحَيَاءَ وَالإِيمَانَ قُرِنَا جَمِيعًا، فَإِذَا رُفِعَ أَحَدُهُمَا رُفِعَ الآخَرُ‏.‏","english":{"narrator":"","text":"Ibn 'Umar said, \"Modesty and belief are together. If one of them\nis removed, the other is removed.\""}},{"id":10,"idInBook":10,"chapterId":56,"bookId":15,"arabic":"حَدَّثَنَا سَعِيدُ بْنُ سُلَيْمَانَ، قَالَ‏:‏ حَدَّثَنَا هُشَيْمٌ، عَنْ مَنْصُورٍ، عَنِ الْحَسَنِ، عَنْ أَبِي بَكْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ الْحَيَاءُ مِنَ الإِيمَانِ، وَالإِيمَانُ فِي الْجَنَّةِ، وَالْبَذَاءُ مِنَ الْجَفَاءِ، وَالْجَفَاءُ فِي النَّارِ‏.‏","english":{"narrator":"","text":"Abu Bakra reported that the Prophet, may Allah bless him and grant\nhim peace, said, \"Modesty is part of belief. Belief is in the Garden. Foul\nlanguage is part of coarseness and coarseness is in the Fire.\""}},{"id":11,"idInBook":11,"chapterId":56,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ‏:‏ حَدَّثَنَا حَمَّادٌ، عَنِ ابْنِ عَقِيلٍ، عَنْ مُحَمَّدِ بْنِ عَلِيٍّ ابْنِ الْحَنَفِيَّةِ، عَنْ أَبِيهِ قَالَ‏:‏ كَانَ النَّبِيُّ صلى الله عليه وسلم ضَخْمَ الرَّأْسِ، عَظِيمَ الْعَيْنَيْنِ، إِذَا مَشَى تَكَفَّأَ، كَأَنَّمَا يَمْشِي فِي صَعَدٍ، إِذَا الْتَفَتَ الْتَفَتَ جَمِيعًا‏.‏","english":{"narrator":"","text":"Muhammad ibn al-Hanafiyya said, \"The Prophet, may Allah bless\nhim and grant him peace, had a large head and large eyes. When he walked,\nhe bent forward as if he was walking up a hill. When he turned around,\nhe turned completely.\""}},{"id":12,"idInBook":12,"chapterId":56,"bookId":15,"arabic":"حَدَّثَنَا آدَمُ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، عَنْ مَنْصُورٍ قَالَ‏:‏ سَمِعْتُ رِبْعِيَّ بْنَ حِرَاشٍ يُحَدِّثُ، عَنْ أَبِي مَسْعُودٍ قَالَ‏:‏ قَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ إِنَّ مِمَّا أَدْرَكَ النَّاسَ مِنْ كَلاَمِ النُّبُوَّةِ الأُولَى‏:‏ إِذَا لَمْ تَسْتَحْيِ فَاصْنَعْ مَا شِئْتَ‏.‏","english":{"narrator":"","text":"Abu Mas'ud said, \"The Prophet, may Allah bless him and grant him\npeace, said, \"Part of what people know of the words of first prophethood\nis that if someone does not possess shyness, then he will do as he pleases.\""}}],"chapter":{"id":56,"bookId":15,"arabic":"كتاب الفضول والجفاء","english":"Meddling and Harshness"}}