{"metadata":{"length":7,"arabic":{"title":"الأدب المفرد","author":"الإمام محمد بن إسماعيل البخاري","introduction":"كتاب الْغَضَبِ"},"english":{"title":"Al-Adab Al-Mufrad","author":"Imam Muhammad ibn Ismail al-Bukhari","introduction":"Anger"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":57,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ قَالَ‏:‏ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم قَالَ‏:‏ لَيْسَ الشَّدِيدُ بِالصُّرَعَةِ، إِنَّمَا الشَّدِيدُ الَّذِي يَمْلِكُ نَفْسَهُ عِنْدَ الْغَضَبِ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"The person who is strong is not strong\nbecause he can knock people down. The person who is strong is the one who\ncontrols himself when he is angry.\""}},{"id":2,"idInBook":2,"chapterId":57,"bookId":15,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، قَالَ‏:‏ حَدَّثَنَا أَبُو شِهَابٍ عَبْدُ رَبِّهِ، عَنْ يُونُسَ، عَنِ الْحَسَنِ، عَنِ ابْنِ عُمَرَ قَالَ‏:‏ مَا مِنْ جَرْعَةٍ أَعْظَمَ عِنْدَ اللهِ أَجْرًا مِنْ جَرْعَةِ غَيْظٍ كَظَمَهَا عَبْدٌ ابْتِغَاءَ وَجْهِ اللهِ‏.‏","english":{"narrator":"","text":"Ibn 'Umar said, \"There is nothing that is swallowed greater with\nAllah in reward than a slave of Allah who swallows and contains his rancour\nout of desire for the pleasure of Allah.\""}},{"id":3,"idInBook":3,"chapterId":57,"bookId":15,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللهِ، قَالَ‏:‏ حَدَّثَنَا أَبُو أُسَامَةَ قَالَ‏:‏ سَمِعْتُ الأَعْمَشَ يَقُولُ‏:‏ حَدَّثَنَا عَدِيُّ بْنُ ثَابِتٍ، عَنْ سُلَيْمَانَ بْنِ صُرَدٍ قَالَ‏:‏ اسْتَبَّ رَجُلاَنِ عِنْدَ النَّبِيِّ صلى الله عليه وسلم، فَجَعَلَ أَحَدُهُمَا يَغْضَبُ، وَيَحْمَرُّ وَجْهُهُ، فَنَظَرَ إِلَيْهِ النَّبِيُّ صلى الله عليه وسلم فَقَالَ‏:‏ إِنِّي لَأَعْلَمُ كَلِمَةً لَوْ قَالَهَا لَذَهَبَ هَذَا عَنْهُ‏:‏ أَعُوذُ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيمِ، فَقَامَ رَجُلٌ إِلَى ذَاكَ الرَّجُلِ فَقَالَ‏:‏ تَدْرِي مَا قَالَ‏؟‏ قَالَ‏:‏ قُلْ‏:‏ أَعُوذُ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيمِ، فَقَالَ الرَّجُلُ‏:‏ أَمَجْنُونًا تَرَانِي‏؟‏‏.‏","english":{"narrator":"Sulayman ibn Surad said, \"Two men abused one another in the presence\nof the Prophet, may Allah bless him and grant him peace, and one of them\nbegan to get angry and his face got red. The Prophet, may Allah bless him\nand grant him peace, looked at him and said, 'I know some words that, if\nhe says them, will remove this from him. They are:","text":"\"I seek refuge with\nAllah from the Accursed Shaytan.\"' The man went to that man and said, 'Do\nyou know what he said? He said, \"I seek refuge with Allah from the Accursed\nShaytan.\"' The man retorted. 'Do you think me mad?'\""}},{"id":4,"idInBook":4,"chapterId":57,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ عُثْمَانَ قِرَاءَةً، عَنْ أَبِي حَمْزَةَ، عَنِ الأَعْمَشِ، عَنِ ابْنِ ثَابِتٍ، عَنْ سُلَيْمَانَ بْنِ صُرَدٍ قَالَ‏:‏ كُنْتُ جَالِسًا مَعَ النَّبِيِّ صلى الله عليه وسلم وَرَجُلاَنِ يَسْتَبَّانِ، فَأَحَدُهُمَا احْمَرَّ وَجْهُهُ، وَانْتَفَخَتْ أَوْدَاجُهُ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ إِنِّي لَأَعْلَمُ كَلِمَةً لَوْ قَالَهَا لَذَهَبَ عَنْهُ مَا يَجِدُ، فَقَالُوا لَهُ‏:‏ إِنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ‏:‏ تَعَوَّذْ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيمِ، قَالَ‏:‏ وَهَلْ بِي مِنْ جُنُونٍ‏؟‏‏.‏","english":{"narrator":"","text":"A variant of the previous hadith."}},{"id":5,"idInBook":5,"chapterId":57,"bookId":15,"arabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، قَالَ‏:‏ حَدَّثَنَا لَيْثٌ قَالَ‏:‏ حَدَّثَنِي طَاوُسٌ، عَنِ ابْنِ عَبَّاسٍ قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ عَلِّمُوا وَيَسِّرُوا، عَلِّمُوا وَيَسِّرُوا، ثَلاَثَ مَرَّاتٍ، وَإِذَا غَضِبْتَ فَاسْكُتْ، مَرَّتَيْنِ‏.‏","english":{"narrator":"","text":"Ibn 'Abbas said, \"The Messenger of Allah, may Allah bless him\nand grant him peace, said, ' Teach and make it easy. Teach and make it\neasy.' three times. He went on, 'When you are angry, be silent' twice.\""}},{"id":6,"idInBook":6,"chapterId":57,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ، قَالَ‏:‏ حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ الْكِنْدِيُّ، عَنْ أَبِيهِ قَالَ‏:‏ سَمِعْتُ عَلِيًّا يَقُولُ لِابْنِ الْكَوَّاءِ‏:‏ هَلْ تَدْرِي مَا قَالَ الأَوَّلُ‏؟‏ أَحْبِبْ حَبِيبَكَ هَوْنًا مَا، عَسَى أَنْ يَكُونَ بَغِيضَكَ يَوْمًا مَا، وَأَبْغِضْ بَغِيضَكَ هَوْنًا مَا، عَسَى أَنْ يَكُونَ حَبِيبَكَ يَوْمًا مَا‏.‏","english":{"narrator":"","text":"'Ali was heard to say to Ibn al-Kawwa', \"Do you know what the\nfirst one said? 'Loving the one you love is an easy matter. It may be that\none day he will be the one you hate. Hating the one who hate is an easy\nmatter, It may be that one day he will be the one you hate.'\""}},{"id":7,"idInBook":7,"chapterId":57,"bookId":15,"arabic":"حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، قَالَ‏:‏ أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ‏:‏ حَدَّثَنَا زَيْدُ بْنُ أَسْلَمَ، عَنْ أَبِيهِ، عَنْ عُمَرَ بْنِ الْخَطَّابِ قَالَ‏:‏ لاَ يَكُنْ حُبُّكَ كَلَفًا، وَلاَ بُغْضُكَ تَلَفًا، فَقُلْتُ‏:‏ كَيْفَ ذَاكَ‏؟‏ قَالَ‏:‏ إِذَا أَحْبَبْتَ كَلِفْتَ كَلَفَ الصَّبِيِّ، وَإِذَا أَبْغَضْتَ أَحْبَبْتَ لِصَاحِبِكَ التَّلَف‏.‏","english":{"narrator":"","text":"Aslam said, \" 'Umar ibn al-Khattab said, 'Do not let your love\nbe a total infatuation. Do not let your anger be destruction.' I asked,\n'How is that?' He replied, 'When you love, you are infatuated like a child.\nWhen you hate, you desire destruction for your companion.'\""}}],"chapter":{"id":57,"bookId":15,"arabic":"كتاب الْغَضَبِ","english":"Anger"}}