{"metadata":{"length":28,"arabic":{"title":"الأدب المفرد","author":"الإمام محمد بن إسماعيل البخاري","introduction":"كتاب الْجَارِ"},"english":{"title":"Al-Adab Al-Mufrad","author":"Imam Muhammad ibn Ismail al-Bukhari","introduction":"Neighbours"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":6,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ قَالَ‏:‏ حَدَّثَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ قَالَ‏:‏ أَخْبَرَنِي أَبُو بَكْرِ بْنُ مُحَمَّدٍ، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ مَا زَالَ جِبْرِيلُ صلى الله عليه وسلم يُوصِينِي بِالْجَارِ حَتَّى ظَنَنْتُ أَنَّهُ سَيُوَرِّثُهُ‏.‏","english":{"narrator":"","text":"'A'isha reported that the Prophet, may Allah bless him and grant him\npeace, said, \"Jibril, may Allah bless him and grant him peace, kept on\nrecommending that I treat neighbours well until I thought that he would order\nme to treat them as my heirs.\""}},{"id":2,"idInBook":2,"chapterId":6,"bookId":15,"arabic":"حَدَّثَنَا صَدَقَةُ، قَالَ‏:‏ أَخْبَرَنَا ابْنُ عُيَيْنَةَ، عَنْ عَمْرٍو، عَنْ نَافِعِ بْنِ جُبَيْرٍ، عَنْ أَبِي شُرَيْحٍ الْخُزَاعِيِّ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيُحْسِنْ إِلَى جَارِهِ، وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيُكْرِمْ ضَيْفَهُ، وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيَقُلْ خَيْرًا أَوْ لِيَصْمُتْ‏.‏","english":{"narrator":"","text":"Abu Shurayh al-Khuza'i reported that the Prophet, may Allah bless him\nand grant him peace, said, \"Anyone who believes in Allah and the Last Day\nshould be good to his neighbours. Anyone who believes in Allah and the Last\nDay should be generous to his guest. Anyone who believes in Allah and the\nLast Day should be say what is good or be silent.\""}},{"id":3,"idInBook":3,"chapterId":6,"bookId":15,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ حُمَيْدٍ، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، عَنْ مُحَمَّدِ بْنِ سَعْدٍ قَالَ‏:‏ سَمِعْتُ أَبَا ظَبْيَةَ الْكَلاَعِيَّ قَالَ‏:‏ سَمِعْتُ الْمِقْدَادَ بْنَ الأَسْوَدِ يَقُولُ‏:‏ سَأَلَ رَسُولُ اللهِ صلى الله عليه وسلم أَصْحَابَهُ عَنِ الزِّنَا‏؟‏ قَالُوا‏:‏ حَرَامٌ، حَرَّمَهُ اللَّهُ وَرَسُولُهُ، فَقَالَ‏:‏ لأَنْ يَزْنِيَ الرَّجُلُ بِعَشْرِ نِسْوَةٍ، أَيْسَرُ عَلَيْهِ مِنْ أَنْ يَزْنِيَ بِامْرَأَةِ جَارِهِ، وَسَأَلَهُمْ عَنِ السَّرِقَةِ‏؟‏ قَالُوا‏:‏ حَرَامٌ، حَرَّمَهَا اللَّهُ عَزَّ وَجَلَّ وَرَسُولُهُ، فَقَالَ‏:‏ لأَنْ يَسْرِقَ مِنْ عَشَرَةِ أَهْلِ أَبْيَاتٍ، أَيْسَرُ عَلَيْهِ مِنْ أَنْ يَسْرِقَ مِنْ بَيْتِ جَارِهِ‏.‏","english":{"narrator":"","text":"Al-Miqdad ibn al-Aswad reported that the Messenger of Allah, may Allah\nbless him and grant him peace, asked his Companions about fornication and\nthey said, \"It is unlawful. Allah and His Messenger have made it unlawful.\"\nHe said, \"It is less serious for a man to fornicate with ten women than for\nhim to fornicate with his neighbour's wife.\" Then he asked them about stealing.\nThey replied, \"It is unlawful. Allah and His Messenger have made it unlawful.\"\nHe said, \"It is less serious for a man to steal from ten houses than it is\nfor him to steal from his neighbour's house.\""}},{"id":4,"idInBook":4,"chapterId":6,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ مِنْهَالٍ، قَالَ‏:‏ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، قَالَ‏:‏ حَدَّثَنَا عُمَرُ بْنُ مُحَمَّدٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ مَا زَالَ جِبْرِيلُ يُوصِينِي بِالْجَارِ حَتَّى ظَنَنْتُ أَنَّهُ سَيُوَرِّثُهُ‏.‏","english":{"narrator":"","text":"Ibn 'Umar reported that the Messenger of Allah, may Allah bless him\nand grant him peace, said, \"Jibril kept on recommending that I treat my\nneighbours well until I thought that he would order me to treat them as my\nheirs.\""}},{"id":5,"idInBook":5,"chapterId":6,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلامٍ، قَالَ‏:‏ أَخْبَرَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ دَاوُدَ بْنِ شَابُورَ، وَأَبِي إِسْمَاعِيلَ، عَنْ مُجَاهِدٍ، عَنْ عَبْدِ اللهِ بْنِ عَمْرٍو، أَنَّهُ ذُبِحَتْ لَهُ شَاةٌ، فَجَعَلَ يَقُولُ لِغُلاَمِهِ‏:‏ أَهْدَيْتَ لِجَارِنَا الْيَهُودِيِّ‏؟‏ أَهْدَيْتَ لِجَارِنَا الْيَهُودِيِّ‏؟‏ سَمِعْتُ رَسُولَ اللهِ صلى الله عليه وسلم يَقُولُ‏:‏ مَا زَالَ جِبْرِيلُ يُوصِينِي بِالْجَارِ حَتَّى ظَنَنْتُ أَنَّهُ سَيُوَرِّثُهُ‏.‏","english":{"narrator":"","text":"Mujahid reported that a sheep was slaughtered for 'Abdullah ibn 'Amr.\nHe asked his slave, \"Have you given any to our Jewish neighbour? Have you\ngiven any to our Jewish neighbour? I heard the Messenger of Allah, may Allah\nbless him and grant him peace, say, 'Jibril kept on recommending that I treat\nmy neighbours well until I thought that he would order me to treat them as\nmy heirs.'\""}},{"id":6,"idInBook":6,"chapterId":6,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلامٍ، قَالَ‏:‏ أَخْبَرَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ قَالَ‏:‏ سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ يَقُولُ‏:‏ حَدَّثَنِي أَبُو بَكْرٍ، أَنَّ عَمْرَةَ حَدَّثَتْهُ، أَنَّهَا سَمِعَتْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا تَقُولُ‏:‏ سَمِعْتُ رَسُولَ اللهِ صلى الله عليه وسلم يَقُولُ‏:‏ مَا زَالَ جِبْرِيلُ يُوصِينِي بِالْجَارِ حَتَّى ظَنَنْتُ أَنَّهُ لَيُوَرِّثُهُ‏.‏","english":{"narrator":"","text":"Same as 101."}},{"id":7,"idInBook":7,"chapterId":6,"bookId":15,"arabic":"حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ قَالَ‏:‏ أَخْبَرَنِي أَبُو عِمْرَانَ قَالَ‏:‏ سَمِعْتُ طَلْحَةَ، عَنْ عَائِشَةَ قَالَتْ‏:‏ قُلْتُ‏:‏ يَا رَسُولَ اللهِ، إِنَّ لِي جَارَيْنِ، فَإِلَى أَيِّهِمَا أُهْدِي‏؟‏ قَالَ‏:‏ إِلَى أَقْرَبِهِمَا مِنْكِ بَابًا‏.‏","english":{"narrator":"","text":"'A'isha said, \"I said, 'Messenger of Allah, I have two neighbours. To\nwhom should I give my gifts?' He replied, 'To the one whose door is nearer\nto you.'\""}},{"id":8,"idInBook":8,"chapterId":6,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ، عَنْ طَلْحَةَ بْنِ عَبْدِ اللهِ، رَجُلٌ مِنْ بَنِي تَيْمِ بْنِ مُرَّةَ، عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ‏:‏ قُلْتُ‏:‏ يَا رَسُولَ اللهِ، إِنَّ لِي جَارَيْنِ، فَإِلَى أَيِّهِمَا أُهْدِي‏؟‏ قَالَ‏:‏ إِلَى أَقْرَبِهِمَا مِنْكِ بَابًا‏.‏","english":{"narrator":"","text":"same as 108 with a different isnad."}},{"id":9,"idInBook":9,"chapterId":6,"bookId":15,"arabic":"حَدَّثَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ، قَالَ‏:‏ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى، عَنِ الْوَلِيدِ بْنِ دِينَارٍ، عَنِ الْحَسَنِ، أَنَّهُ سُئِلَ عَنِ الْجَارِ، فَقَالَ‏:‏ أَرْبَعِينَ دَارًا أَمَامَهُ، وَأَرْبَعِينَ خَلْفَهُ، وَأَرْبَعِينَ عَنْ يَمِينِهِ، وَأَرْبَعِينَ عَنْ يَسَارِهِ‏.‏","english":{"narrator":"","text":"Al-Hasan was asked about the neighbour and said, \"The term 'neighbour'\nincludes the forty houses in front a person, the forty houses behind him,\nthe forty houses on his right and the forty houses on his left.\""}},{"id":10,"idInBook":10,"chapterId":6,"bookId":15,"arabic":"حَدَّثَنَا بِشْرُ بْنُ مُحَمَّدٍ، قَالَ‏:‏ أَخْبَرَنَا عَبْدُ اللهِ، قَالَ‏:‏ أَخْبَرَنَا عِكْرِمَةُ بْنُ عَمَّارٍ، قَالَ‏:‏ حَدَّثَنَا عَلْقَمَةُ بْنُ بَجَالَةَ بْنِ زَيْدٍ قَالَ‏:‏ سَمِعْتُ أَبَا هُرَيْرَةَ قَالَ‏:‏ وَلاَ يَبْدَأُ بِجَارِهِ الأَقْصَى قَبْلَ الأَدْنَى، وَلَكِنْ يَبْدَأُ بِالأَدْنَى قَبْلَ الأَقْصَى‏.‏","english":{"narrator":"","text":"Abu Hurayra said, \"Do not begin with your more distant neighbours before\nthe closer ones. Rather begin with your nearest neighbours before the most\ndistant ones.\""}},{"id":11,"idInBook":11,"chapterId":6,"bookId":15,"arabic":"حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيلَ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ السَّلاَمِ، عَنْ لَيْثٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ قَالَ‏:‏ لَقَدْ أَتَى عَلَيْنَا زَمَانٌ، أَوْ قَالَ‏:‏ حِينٌ، وَمَا أَحَدٌ أَحَقُّ بِدِينَارِهِ وَدِرْهَمِهِ مِنْ أَخِيهِ الْمُسْلِمِ، ثُمَّ الْآنَ الدِّينَارُ وَالدِّرْهَمُ أَحَبُّ إِلَى أَحَدِنَا مِنْ أَخِيهِ الْمُسْلِمِ، سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ‏:‏ كَمْ مِنْ جَارٍ مُتَعَلِّقٌ بِجَارِهِ يَوْمَ الْقِيَامَةِ يَقُولُ‏:‏ يَا رَبِّ، هَذَا أَغْلَقَ بَابَهُ دُونِي، فَمَنَعَ مَعْرُوفَهُ‏.‏","english":{"narrator":"","text":"Ibn 'Umar said, \"There was a time when no one was more entitled to a\nperson's money than his Muslim brother. Now people love their dirhams and\ndinars more than their Muslim brother. I heard the Prophet, may Allah bless\nhim and grant him peace, say, 'How many a neighbour will be brought together\nwith his neighbour on the Day of Rising! He will say, \"Lord, this man closed\nhis door to me and refused to show me common kindness!\"'\""}},{"id":12,"idInBook":12,"chapterId":6,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، قَالَ‏:‏ أَخْبَرَنَا سُفْيَانُ، عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي بَشِيرٍ، عَنْ عَبْدِ اللهِ بْنِ الْمُسَاوِرِ قَالَ‏:‏ سَمِعْتُ ابْنَ عَبَّاسٍ يُخْبِرُ ابْنَ الزُّبَيْرِ يَقُولُ‏:‏ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ‏:‏ لَيْسَ الْمُؤْمِنُ الَّذِي يَشْبَعُ وَجَارُهُ جَائِعٌ‏.‏","english":{"narrator":"","text":"Ibn 'Abbas informed Ibn az-Zubayr, \"I heard the Prophet, may Allah bless\nhim and grant him peace, say, 'He is not a believer whose stomach is filled while his neighbor goes hungry.'\""}},{"id":13,"idInBook":13,"chapterId":6,"bookId":15,"arabic":"حَدَّثَنَا بِشْرُ بْنُ مُحَمَّدٍ، قَالَ‏:‏ أَخْبَرَنَا عَبْدُ اللهِ، قَالَ‏:‏ أَخْبَرَنَا شُعْبَةُ، عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ، عَنْ عَبْدِ اللهِ بْنِ الصَّامِتِ، عَنْ أَبِي ذَرٍّ قَالَ‏:‏ أَوْصَانِي خَلِيلِي صلى الله عليه وسلم بِثَلاَثٍ‏:‏ أَسْمَعُ وَأُطِيعُ وَلَوْ لِعَبْدٍ مُجَدَّعِ الأَطْرَافِ، وَإِذَا صَنَعْتَ مَرَقَةً فَأَكْثِرْ مَاءَهَا، ثُمَّ انْظُرْ أَهْلَ بَيْتٍ مِنْ جِيرَانِكَ، فَأَصِبْهُمْ مِنْهُ بِمَعْرُوفٍ، وَصَلِّ الصَّلاَةَ لِوَقْتِهَا، فَإِنْ وَجَدْتَ الإِمَامَ قَدْ صَلَّى، فَقَدْ أَحْرَزْتَ صَلاَتَكَ، وَإِلاَّ فَهِيَ نَافِلَةٌ‏.‏","english":{"narrator":"It is reported that Abu Dharr said, \"My dear friend, may Allah bless\nhim and grant him peace, enjoined three things on me:","text":"'Hear and obey, even\nif the ruler is a slave with his limbs amputated. When you cook a stew, put\na lot of water in it and then go and see the people of a neighbouring house\nand give them a reasonable amount of it. Pray the prayers at their proper\nprayers. Then if you find that the imam has already prayed, you have guarded\nyour prayer (by already having performed it). If not, it is a supererogatory\nprayer (since you have done it again).\""}},{"id":14,"idInBook":14,"chapterId":6,"bookId":15,"arabic":"حَدَّثَنَا الْحُمَيْدِيُّ، قَالَ‏:‏ حَدَّثَنَا أَبُو عَبْدِ الصَّمَدِ الْعَمِّيُّ، قَالَ‏:‏ حَدَّثَنَا أَبُو عِمْرَانَ، عَنْ عَبْدِ اللهِ بْنِ الصَّامِتِ، عَنْ أَبِي ذَرٍّ قَالَ‏:‏ قَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ يَا أَبَا ذَرٍّ، إِذَا طَبَخْتَ مَرَقَةً فَأَكْثِرْ مَاءَ الْمَرَقَةِ، وَتَعَاهَدْ جِيرَانَكَ، أَوِ اقْسِمْ فِي جِيرَانِكَ‏.‏","english":{"narrator":"","text":"Abu Dharr reported that the Prophet, may Allah bless him and grant him\npeace, said, \"Abu Dharr! If you cook some stew, make a lot of it and fulfil\nyour duty to your neighbours (or divide it among your neighbours).\""}},{"id":15,"idInBook":15,"chapterId":6,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ يَزِيدَ، قَالَ‏:‏ حَدَّثَنَا حَيْوَةُ، قَالَ‏:‏ أَخْبَرَنَا شُرَحْبِيلُ بْنُ شَرِيكٍ، أَنَّهُ سَمِعَ أَبَا عَبْدِ الرَّحْمَنِ الْحُبُلِيَّ يُحَدِّثُ، عَنْ عَبْدِ اللهِ بْنِ عَمْرِو بْنِ الْعَاصِ، عَنْ رَسُولِ اللهِ صلى الله عليه وسلم أَنَّهُ قَالَ‏:‏ خَيْرُ الأَصْحَابِ عِنْدَ اللهِ تَعَالَى خَيْرُهُمْ لِصَاحِبِهِ، وَخَيْرُ الْجِيرَانِ عِنْدَ اللهِ تَعَالَى خَيْرُهُمْ لِجَارِهِ‏.‏","english":{"narrator":"","text":"'Abdullah ibn 'Amr ibn al-'As reported that the Messenger of Allah,\nmay Allah bless him and grant him peace, said, \"The best of companions in\nthe sight of Allah Almighty is the best of them towards his companion, and\nthe best of neighbours in the sight of Allah is the best of them towards\nhis neighbour.\""}},{"id":16,"idInBook":16,"chapterId":6,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، قَالَ‏:‏ أَخْبَرَنَا سُفْيَانُ، عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ قَالَ‏:‏ حَدَّثَنِي خَمِيلٌ، عَنْ نَافِعِ بْنِ عَبْدِ الْحَارِثِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ مِنْ سَعَادَةِ الْمَرْءِ الْمُسْلِمِ‏:‏ الْمَسْكَنُ الْوَاسِعُ، وَالْجَارُ الصَّالِحُ، وَالْمَرْكَبُ الْهَنِيءُ‏.‏","english":{"narrator":"","text":"Nafi' ibn 'Abdu'l-Harith reported that the Prophet, may Allah bless\nhim and grant him peace, said, \"Part of the happiness of the Muslim man includes\na spacious dwelling, righteous neighbour and a good mount\""}},{"id":17,"idInBook":17,"chapterId":6,"bookId":15,"arabic":"حَدَّثَنَا صَدَقَةُ، قَالَ‏:‏ أَخْبَرَنَا سُلَيْمَانُ هُوَ ابْنُ حَيَّانَ، عَنِ ابْنِ عَجْلاَنَ، عَنْ سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ كَانَ مِنْ دُعَاءِ النَّبِيِّ صلى الله عليه وسلم‏:‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ جَارِ السُّوءِ فِي دَارِ الْمُقَامِ، فَإِنَّ جَارَ الدُّنْيَا يَتَحَوَّلُ‏.‏","english":{"narrator":"","text":"Abu Hurayra said, \"Part of the supplication of the Prophet, may Allah\nbless him and grant him peace, was, \"Oh Allah, I seek refuge with you from\nan evil neighbour in the Eternal World. A neighbour in this world can be\nchanged."}},{"id":18,"idInBook":18,"chapterId":6,"bookId":15,"arabic":"حَدَّثَنَا مَخْلَدُ بْنُ مَالِكٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَغْرَاءَ، قَالَ‏:‏ حَدَّثَنَا بُرَيْدُ بْنُ عَبْدِ اللهِ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ لاَ تَقُومُ السَّاعَةُ حَتَّى يَقْتُلَ الرَّجُلُ جَارَهُ وَأَخَاهُ وَأَبَاهُ‏.‏","english":{"narrator":"","text":"Abu Musa reported that the Messenger of Allah, may Allah bless him and\ngrant him peace, said, \"The Final Hour will not come until a man kills his\nneighbour, his brother and his father.\""}},{"id":19,"idInBook":19,"chapterId":6,"bookId":15,"arabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْوَاحِدِ، قَالَ‏:‏ حَدَّثَنَا الأَعْمَشُ، قَالَ‏:‏ حَدَّثَنَا أَبُو يَحْيَى مَوْلَى جَعْدَةَ بْنِ هُبَيْرَةَ قَالَ‏:‏ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُ‏:‏ قِيلَ لِلنَّبِيِّ صلى الله عليه وسلم‏:‏ يَا رَسُولَ اللهِ، إِنَّ فُلاَنَةً تَقُومُ اللَّيْلَ وَتَصُومُ النَّهَارَ، وَتَفْعَلُ، وَتَصَّدَّقُ، وَتُؤْذِي جِيرَانَهَا بِلِسَانِهَا‏؟‏ فَقَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ لاَ خَيْرَ فِيهَا، هِيَ مِنْ أَهْلِ النَّارِ، قَالُوا‏:‏ وَفُلاَنَةٌ تُصَلِّي الْمَكْتُوبَةَ، وَتَصَّدَّقُ بِأَثْوَارٍ، وَلاَ تُؤْذِي أَحَدًا‏؟‏ فَقَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ هِيَ مِنْ أَهْلِ الْجَنَّةِ‏.‏","english":{"narrator":"","text":"Abu Hurayra said, \"The Prophet, may Allah bless him and grant him peace,\nwas asked, 'Messenger of Allah! A certain woman prays in the night, fasts\nin the day, acts and gives sadaqa, but injures her neighbours with her tongue.'\nThe Messenger of Allah, may Allah bless him and grant him peace, said, 'There\nis no good in her. She is one of the people of the Fire.' They said, 'Another\nwoman prays the prescribed prayers and gives bits of curd as sadaqa and does\nnot injure anyone.' The Messenger of Allah, may Allah bless him and grant\nhim peace, said, 'She is one of the people of the Garden.'\""}},{"id":20,"idInBook":20,"chapterId":6,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ يَزِيدَ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ زِيَادٍ قَالَ‏:‏ حَدَّثَنِي عُمَارَةُ بْنُ غُرَابٍ، أَنَّ عَمَّةً لَهُ حَدَّثَتْهُ، أَنَّهَا سَأَلَتْ عَائِشَةَ أُمَّ الْمُؤْمِنِينَ رَضِيَ اللَّهُ عَنْهَا، فَقَالَتْ‏:‏ إِنَّ زَوْجَ إِحْدَانَا يُرِيدُهَا فَتَمْنَعُهُ نَفْسَهَا، إِمَّا أَنْ تَكُونَ غَضَبَى أَوْ لَمْ تَكُنْ نَشِيطَةً، فَهَلْ عَلَيْنَا فِي ذَلِكَ مِنْ حَرَجٍ‏؟‏ قَالَتْ‏:‏ نَعَمْ، إِنَّ مِنْ حَقِّهِ عَلَيْكِ أَنْ لَوْ أَرَادَكِ وَأَنْتِ عَلَى قَتَبٍ لَمْ تَمْنَعِيهِ، قَالَتْ‏:‏ قُلْتُ لَهَا‏:‏ إِحْدَانَا تَحِيضُ، وَلَيْسَ لَهَا وَلِزَوْجِهَا إِلاَّ فِرَاشٌ وَاحِدٌ أَوْ لِحَافٌ وَاحِدٌ، فَكَيْفَ تَصْنَعُ‏؟‏ قَالَتْ‏:‏ لِتَشُدَّ عَلَيْهَا إِزَارَهَا ثُمَّ تَنَامُ مَعَهُ، فَلَهُ مَا فَوْقَ ذَلِكَ، مَعَ أَنِّي سَوْفَ أُخْبِرُكِ مَا صَنَعَ النَّبِيُّ صلى الله عليه وسلم‏:‏ إِنَّهُ كَانَ لَيْلَتِي مِنْهُ، فَطَحَنْتُ شَيْئًا مِنْ شَعِيرٍ، فَجَعَلْتُ لَهُ قُرْصًا، فَدَخَلَ فَرَدَّ الْبَابَ، وَدَخَلَ إِلَى الْمَسْجِدِ، وَكَانَ إِذَا أَرَادَ أَنْ يَنَامَ أَغْلَقَ الْبَابَ، وَأَوْكَأَ الْقِرْبَةَ، وَأَكْفَأَ الْقَدَحَ، وَأطْفَأَ الْمِصْبَاحَ، فَانْتَظَرْتُهُ أَنْ يَنْصَرِفَ فَأُطْعِمُهُ الْقُرْصَ، فَلَمْ يَنْصَرِفْ، حَتَّى غَلَبَنِي النَّوْمُ، وَأَوْجَعَهُ الْبَرْدُ، فَأَتَانِي فَأَقَامَنِي ثُمَّ قَالَ‏:‏ أَدْفِئِينِي أَدْفِئِينِي، فَقُلْتُ لَهُ‏:‏ إِنِّي حَائِضٌ، فَقَالَ‏:‏ وَإِنْ، اكْشِفِي عَنْ فَخِذَيْكِ، فَكَشَفْتُ لَهُ عَنْ فَخِذَيَّ، فَوَضَعَ خَدَّهُ وَرَأْسَهُ عَلَى فَخِذَيَّ حَتَّى دَفِئَ‏.‏ فَأَقْبَلَتْ شَاةٌ لِجَارِنَا دَاجِنَةٌ فَدَخَلَتْ، ثُمَّ عَمَدَتْ إِلَى الْقُرْصِ فَأَخَذَتْهُ، ثُمَّ أَدْبَرَتْ بِهِ‏.‏ قَالَتْ‏:‏ وَقَلِقْتُ عَنْهُ، وَاسْتَيْقَظَ النَّبِيُّ صلى الله عليه وسلم فَبَادَرْتُهَا إِلَى الْبَابِ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ خُذِي مَا أَدْرَكْتِ مِنْ قُرْصِكِ، وَلاَ تُؤْذِي جَارَكِ فِي شَاتِهِ‏.‏","english":{"narrator":"","text":"'Umara ibn Ghurab reported that an aunt of his told him that she asked\n'A'isha, Umm al-Mu'minin, \"If a woman's husband desires her and she refuses\nto give herself to him either because she is angry or not eager, is there\nanything wrong in that?\" \"Yes,\" she replied. \"Part of his right over you\nis that if he desires you when you are on a saddle, you must not refuse him.\"\nShe said, \"I also asked her, 'If one of us is menstruating and she and her\nhusband only have a single cover, what should she do?' She replied, 'She\nshould wrap her wrapper around her and sleep with him. He can have what is\nabove it. I will tell you what the Prophet, may Allah bless him and grant\nhim peace, did on one of his nights with me. I had cooked some barley and\nmade loaf for him. He came in, stopped at the door, and then went into the\nmosque. When he wanted to sleep, he closed the door, tied up the waterskin,\nturned the cup over and put out the light. I waited for him and he ate the\nloaf. He did not go until I fell asleep. Later he felt the cold and came\nand got me up. \"Warm me! Warm me!\" he said. I said, \"I am menstruating.\"\nHe said, \"Then uncover your thighs,\" so I uncovered my thighs and he put\nhis cheek and head on my thighs until he was warm. Then a pet sheep belonging\nto our neighbour came in. I went and took the load away. I disturbed the\nProphet, may Allah bless him and grant him peace, and he woke up, so I chased\nthe sheep to the door. The Prophet, may Allah bless him and grant him peace,\nsaid, \"Take what you got of your loaf and do not injure your neighbour's\nsheep.\"'\""}},{"id":21,"idInBook":21,"chapterId":6,"bookId":15,"arabic":"حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ أَبُو الرَّبِيعِ، قَالَ‏:‏ حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، قَالَ‏:‏ حَدَّثَنَا الْعَلاَءُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم قَالَ‏:‏ لاَ يَدْخُلُ الْجَنَّةَ مَنْ لاَ يَأْمَنُ جَارُهُ بَوَائِقَهُ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Messenger of Allah, may Allah bless him\nand grant him peace, said, \"A person whose neighbours are not safe from his\nevil will not enter the Garden.\""}},{"id":22,"idInBook":22,"chapterId":6,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ قَالَ‏:‏ حَدَّثَنِي مَالِكٌ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَمْرِو بْنِ مُعَاذٍ الأَشْهَلِيِّ، عَنْ جَدَّتِهِ، أَنَّهَا قَالَتْ‏:‏ قَالَ لِي رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ يَا نِسَاءَ الْمُؤْمِنَاتِ، لاَ تَحْقِرَنَّ امْرَأَةٌ مِنْكُنَّ لِجَارَتِهَا، وَلَوْ كُرَاعُ شَاةٍ مُحَرَّقٍ‏.‏","english":{"narrator":"","text":"'Amr ibn Mu'adh al-Ashhali reported that his grandmother said, \"The\nMessenger of Allah, may Allah bless him and grant him peace, said, 'Believing\nwomen! Do not let any of you women disdain her female neighbour's gift, even\nif it is only a burnt sheep's hoof.'\""}},{"id":23,"idInBook":23,"chapterId":6,"bookId":15,"arabic":"حَدَّثَنَا آدَمُ، قَالَ‏:‏ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، قَالَ‏:‏ حَدَّثَنَا سَعِيدٌ الْمَقْبُرِيُّ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ‏:‏ قَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ يَا نِسَاءَ الْمُسْلِمَاتِ، يَا نِسَاءَ الْمُسْلِمَاتِ، لاَ تَحْقِرَنَّ جَارَةٌ لِجَارَتِهَا وَلَوْ فِرْسِنُ شَاةٍ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Messenger of Allah, may Allah bless him\nand grant him peace, said, \"Muslim women! Muslim women! A woman should not\ndisdain her female neighbour's gift, even if it is only a sheep's hoof.\""}},{"id":24,"idInBook":24,"chapterId":6,"bookId":15,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللهِ، قَالَ‏:‏ حَدَّثَنَا صَفْوَانُ بْنُ عِيسَى، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ عَجْلاَنَ، قَالَ‏:‏ حَدَّثَنَا أَبِي، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ قَالَ رَجُلٌ‏:‏ يَا رَسُولَ اللهِ، إِنَّ لِي جَارًا يُؤْذِينِي، فَقَالَ‏:‏ انْطَلِقْ فَأَخْرِجْ مَتَاعَكَ إِلَى الطَّرِيقِ، فَانْطَلَقَ فَأَخْرِجَ مَتَاعَهُ، فَاجْتَمَعَ النَّاسُ عَلَيْهِ، فَقَالُوا‏:‏ مَا شَأْنُكَ‏؟‏ قَالَ‏:‏ لِي جَارٌ يُؤْذِينِي، فَذَكَرْتُ لِلنَّبِيِّ صلى الله عليه وسلم، فَقَالَ‏:‏ انْطَلِقْ فَأَخْرِجْ مَتَاعَكَ إِلَى الطَّرِيقِ، فَجَعَلُوا يَقُولُونَ‏:‏ اللَّهُمَّ الْعَنْهُ، اللَّهُمَّ أَخْزِهِ‏.‏ فَبَلَغَهُ، فَأَتَاهُ فَقَالَ‏:‏ ارْجِعْ إِلَى مَنْزِلِكَ، فَوَاللَّهِ لاَ أُؤْذِيكَ‏.‏","english":{"narrator":"","text":"Abu Hurayra said, \"A man said, 'Messenger of Allah, I have a neighbour\nwho does me harm.' He said, 'Go and take your things out into the road.'\nHe took his things out into the road. People gathered around him and asked,\n'What's the matter?' He replied, 'A neighbour of mine injures me and I mentioned\nit to the Messenger of Allah, may Allah bless him and grant him peace. He\ntold me, \"Take your things out into the road.\"' They began to say, 'O Allah,\ncurse him! O Allah, disgrace him!' When the man heard that, he came out to\nhim and said, 'Go back to your home. By Allah, I will not harm you.'\""}},{"id":25,"idInBook":25,"chapterId":6,"bookId":15,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ حَكِيمٍ الأَوْدِيُّ، قَالَ‏:‏ حَدَّثَنَا شَرِيكٌ، عَنْ أَبِي عُمَرَ، عَنْ أَبِي جُحَيْفَةَ قَالَ‏:‏ شَكَا رَجُلٌ إِلَى النَّبِيِّ صلى الله عليه وسلم جَارَهُ، فَقَالَ‏:‏ احْمِلْ مَتَاعَكَ فَضَعْهُ عَلَى الطَّرِيقِ، فَمَنْ مَرَّ بِهِ يَلْعَنُهُ، فَجَعَلَ كُلُّ مَنْ مَرَّ بِهِ يَلْعَنُهُ، فَجَاءَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ‏:‏ مَا لَقِيتُ مِنَ النَّاسِ‏؟‏ فَقَالَ‏:‏ إِنَّ لَعْنَةَ اللهِ فَوْقَ لَعْنَتِهِمْ، ثُمَّ قَالَ لِلَّذِي شَكَا‏:‏ كُفِيتَ أَوْ نَحْوَهُ‏.‏","english":{"narrator":"","text":"Abu Juhayfa said, \"A man complained to the Prophet, may Allah bless\nhim and grant him peace, about his neighbour. The Prophet said, 'Take your\nbags and put them in the road and whoever passes them will curse him.' Everyone\nwho passed him began to curse that neighbour. Then he went to the Prophet,\nmay Allah bless him and grant him peace, and said, 'How many people I met!'\nHe said, 'The curse of Allah is on top of their curse!' Then he told the\none who had complained, 'You have enough,' or words to that effect.\""}},{"id":26,"idInBook":26,"chapterId":6,"bookId":15,"arabic":"حَدَّثَنَا مَخْلَدُ بْنُ مَالِكٍ، قَالَ‏:‏ حَدَّثَنَا أَبُو زُهَيْرٍ عَبْدُ الرَّحْمَنِ بْنُ مَغْرَاءَ، قَالَ‏:‏ حَدَّثَنَا الْفَضْلُ يَعْنِي ابْنَ مُبَشِّرٍ قَالَ‏:‏ سَمِعْتُ جَابِرًا يَقُولُ‏:‏ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صلى الله عليه وسلم يَسْتَعْدِيهِ عَلَى جَارِهِ، فَبَيْنَا هُوَ قَاعِدٌ بَيْنَ الرُّكْنِ وَالْمَقَامِ إِذْ أَقْبَلَ النَّبِيُّ صلى الله عليه وسلم وَرَآهُ الرَّجُلُ وَهُوَ مُقَاوِمٌ رَجُلاً عَلَيْهِ ثِيَابٌ بَيَاضٌ عِنْدَ الْمَقَامِ حَيْثُ يُصَلُّونَ عَلَى الْجَنَائِزِ، فَأَقْبَلَ النَّبِيُّ صلى الله عليه وسلم فَقَالَ‏:‏ بِأَبِي أَنْتَ وَأُمِّي يَا رَسُولَ اللهِ، مَنِ الرَّجُلُ الَّذِي رَأَيْتُ مَعَكَ مُقَاوِمَكَ عَلَيْهِ ثِيَابٌ بِيضٌ‏؟‏ قَالَ‏:‏ أَقَدْ رَأَيْتَهُ‏؟‏ قَالَ‏:‏ نَعَمْ، قَالَ‏:‏ رَأَيْتَ خَيْرًا كَثِيرًا، ذَاكَ جِبْرِيلُ صلى الله عليه وسلم رَسُولُ رَبِّي، مَا زَالَ يُوصِينِي بِالْجَارِ حَتَّى ظَنَنْتُ أَنَّهُ جَاعِلٌ لَهُ مِيرَاثًا‏.‏","english":{"narrator":"","text":"Jabir said, \"A man came to the Prophet, may Allah bless him and grant\nhim peace, to complain to him about the enmity of his neighbour. While he\nwas sitting between the Corner and the Maqam, the Prophet, may Allah bless\nhim and grant him peace, approached with a man who was wearing a white garment.\nThey went to the Maqam where they were praying for the dead. He went up to\nthe Prophet, may Allah bless him and grant him peace, and said, 'May my mother\nand my father be your ransom, Messenger of Allah! Who is this man I see with\nyou wearing the white garment?' 'You saw him?' he asked. 'Yes,' the man replied.\nHe said, 'Then you have seen much good. That was Jibril, may Allah bless\nhim and grant him peace, the Messenger of my Lord. He kept on recommending\nthat I treat my neighbours well until I thought that he would order me to\nmake them my heirs.'\""}},{"id":27,"idInBook":27,"chapterId":6,"bookId":15,"arabic":"حَدَّثَنَا عِصَامُ بْنُ خَالِدٍ، قَالَ‏:‏ حَدَّثَنَا أَرْطَاةُ بْنُ الْمُنْذِرِ قَالَ‏:‏ سَمِعْتُ، يَعْنِي أَبَا عَامِرٍ الْحِمْصِيَّ، قَالَ‏:‏ كَانَ ثَوْبَانُ يَقُولُ‏:‏ مَا مِنْ رَجُلَيْنِ يَتَصَارَمَانِ فَوْقَ ثَلاَثَةِ أَيَّامٍ، فَيَهْلِكُ أَحَدُهُمَا، فَمَاتَا وَهُمَا عَلَى ذَلِكَ مِنَ الْمُصَارَمَةِ، إِلاَّ هَلَكَا جَمِيعًا، وَمَا مِنْ جَارٍ يَظْلِمُ جَارَهُ وَيَقْهَرُهُ، حَتَّى يَحْمِلَهُ ذَلِكَ عَلَى أَنْ يَخْرُجَ مِنْ مَنْزِلِهِ، إِلاَّ هَلَكَ‏.‏","english":{"narrator":"","text":"Thawban said, \"When two men cut each other off for more than three days\nand one of them dies, then they both die while relations between them are\nsevered and both of them are destroyed. There is no man who wrongs his neighbour\nto the extent that he forces him until he makes him leave his home who is\nnot destroyed.\""}},{"id":28,"idInBook":28,"chapterId":6,"bookId":15,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ‏:‏ حَدَّثَنَا بَشِيرُ بْنُ سُلَيْمَانَ، عَنْ مُجَاهِدٍ قَالَ‏:‏ كُنْتُ عِنْدَ عَبْدِ اللهِ بْنِ عَمْرٍو، وَغُلاَمُهُ يَسْلُخُ شَاةً، فَقَالَ‏:‏ يَا غُلاَمُ، إِذَا فَرَغْتَ فَابْدَأْ بِجَارِنَا الْيَهُودِيِّ، فَقَالَ رَجُلٌ مِنَ الْقَوْمِ‏:‏ الْيَهُودِيُّ أَصْلَحَكَ اللَّهُ‏؟‏ قَالَ‏:‏ إِنِّي سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يُوصِي بِالْجَارِ، حَتَّى خَشِينَا أَوْ رُئِينَا أَنَّهُ سَيُوَرِّثُهُ‏.‏","english":{"narrator":"","text":"Mujahid said, \"I was with 'Abdullah ibn 'Amr while his slave was skinning\na sheep. He said, 'Boy! When you finish, start with the Jewish neighbour.'\nA man there exclaimed, 'Jewish? May Allah correct you!' He replied, 'I heard\nthe Messenger of Allah, may Allah bless him and grant him peace, recommend\nthat we treat our neighbours well until we feared (or we thought) that he\nwould order us to make them our heirs.'\""}}],"chapter":{"id":6,"bookId":15,"arabic":"كتاب الْجَارِ","english":"Neighbours"}}