{"metadata":{"length":14,"arabic":{"title":"الأدب المفرد","author":"الإمام محمد بن إسماعيل البخاري","introduction":"كتاب الْكَرَمِ وَ يَتِيمٌ"},"english":{"title":"Al-Adab Al-Mufrad","author":"Imam Muhammad ibn Ismail al-Bukhari","introduction":"Generosity and Orphans"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":7,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، قَالَ‏:‏ أَخْبَرَنَا عَبْدَةُ، عَنْ عُبَيْدِ اللهِ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ سُئِلَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ أَيُّ النَّاسِ أَكْرَمُ‏؟‏ قَالَ‏:‏ أَكْرَمُهُمْ عِنْدَ اللهِ أَتْقَاهُمْ، قَالُوا‏:‏ لَيْسَ عَنْ هَذَا نَسْأَلُكَ، قَالَ‏:‏ فَأَكْرَمُ النَّاسِ يُوسُفُ نَبِيُّ اللهِ ابْنُ نَبِيِّ اللهِ ابْنِ خَلِيلِ اللهِ، قَالُوا‏:‏ لَيْسَ عَنْ هَذَا نَسْأَلُكَ، قَالَ‏:‏ فَعَنْ مَعَادِنِ الْعَرَبِ تَسْأَلُونِي‏؟‏ قَالُوا‏:‏ نَعَمْ، قَالَ‏:‏ فَخِيَارُكُمْ فِي الْجَاهِلِيَّةِ خِيَارُكُمْ فِي الإِسْلاَمِ إِذَا فَقِهُوا‏.‏","english":{"narrator":"","text":"Abu Hurayra said, \"The Messenger of Allah, may Allah bless him and grant\nhim peace, was asked, 'Which people are the most generous?'' He replied,\n'The most generous of them in the sight of Allah are those with the most\ntaqwa.' They said, 'That is not what we are asking about.' He said, 'The\nmost generous of people was Yusuf, the Prophet of Allah, son of the Prophet\nof Allah, who was the son of the Intimate Friend of Allah (Ibrahim).' They\nsaid, 'That is not what we are asking about.' He said, 'Are you asking about\nthose of Arab origin?' 'Yes,' they replied. He said, 'The best of you in\nthe Jahiliyya is the best of you in Islam when you have understanding from\nAllah).\""}},{"id":2,"idInBook":2,"chapterId":7,"bookId":15,"arabic":"حَدَّثَنَا الْحُمَيْدِيُّ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، قَالَ‏:‏ حَدَّثَنَا سَالِمُ بْنُ أَبِي حَفْصَةَ، عَنْ مُنْذِرٍ الثَّوْرِيِّ، عَنْ مُحَمَّدِ بْنِ عَلِيِّ بْنِ الْحَنَفِيَّةِ‏:‏ ‏{‏هَلْ جَزَاءُ الإِحْسَانِ إِلاَّ الإِحْسَانُ‏}‏، قَالَ‏:‏ هِيَ مُسَجَّلَةٌ لِلْبَرِّ وَالْفَاجِرِ‏.‏","english":{"narrator":"","text":"Mundhir at-Tawri reported what Muhammad ibn 'Ali (ibn al-Hanafiyya)\nsaid about, \"Is the repayment of kindness anything except kindness?\" He said,\n\"It is not denied to either the pious or the deviant.\""}},{"id":3,"idInBook":3,"chapterId":7,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ قَالَ‏:‏ حَدَّثَنِي مَالِكٌ، عَنْ ثَوْرِ بْنِ زَيْدٍ، عَنْ أَبِي الْغَيْثِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم‏:‏ السَّاعِي عَلَى الأَرْمَلَةِ وَالْمَسَاكِينِ كَالْمُجَاهِدِ فِي سَبِيلِ اللهِ، وَكَالَّذِي يَصُومُ النَّهَارَ وَيَقُومُ اللَّيْلَ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and grant\nhim peace, said, \"The person who strives on behalf of the widows and poor\nis like those who strive in the way of Allah and like those who fast in the\nday and pray at night.\""}},{"id":4,"idInBook":4,"chapterId":7,"bookId":15,"arabic":"حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ‏:‏ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ قَالَ‏:‏ حَدَّثَنِي عَبْدُ اللهِ بْنُ أَبِي بَكْرٍ، أَنَّ عُرْوَةَ بْنَ الزُّبَيْرِ أَخْبَرَهُ، أَنَّ عَائِشَةَ زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَالَتْ‏:‏ جَاءَتْنِي امْرَأَةٌ مَعَهَا ابْنَتَانِ لَهَا، فَسَأَلَتْنِي فَلَمْ تَجِدْ عِنْدِي إِلاَّ تَمْرَةً وَاحِدَةً، فَأَعْطَيْتُهَا، فَقَسَمَتْهَا بَيْنَ ابْنَتَيْهَا، ثُمَّ قَامَتْ فَخَرَجَتْ، فَدَخَلَ النَّبِيُّ صلى الله عليه وسلم فَحَدَّثْتُهُ، فَقَالَ‏:‏ مَنْ يَلِي مِنْ هَذِهِ الْبَنَاتِ شَيْئًا، فَأَحْسَنَ إِلَيْهِنَّ، كُنَّ لَهُ سِتْرًا مِنَ النَّارِ‏.‏","english":{"narrator":"","text":"'A'isha said, \"A woman came to me who had two of her daughters with\nher. She asked me for something, but I could not find anything except for\na single date which I gave her. She divided it between her daughters and\nthen got up and left. The Prophet, may Allah bless him and grant him peace,\ncame in and I told him what had happened. He said, 'Whoever looks after these\ngirls in any way and is good to them will have them as a veil from the Fire.'\""}},{"id":5,"idInBook":5,"chapterId":7,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ صَفْوَانَ قَالَ‏:‏ حَدَّثَتْنِي أُنَيْسَةُ، عَنْ أُمِّ سَعِيدٍ بِنْتِ مُرَّةَ الْفِهْرِيِّ، عَنْ أَبِيهَا، عَنِ النَّبِيِّ صلى الله عليه وسلم‏:‏ أَنَا وَكَافِلُ الْيَتِيمِ فِي الْجَنَّةِ كَهَاتَيْنِ، أَوْ كَهَذِهِ مِنْ هَذِهِ‏.‏ شَكَّ سُفْيَانُ فِي الْوُسْطَى وَالَّتِي تَلِي الإِبْهَامَ‏.‏","english":{"narrator":"","text":"Umm Sa'id bint Murra al-Fihri related from her father that the Prophet,\nmay Allah bless him and grant him peace, said, \"I and the guardian of an\norphan will be in the Garden like these two.\" (His two fingers)"}},{"id":6,"idInBook":6,"chapterId":7,"bookId":15,"arabic":"حَدَّثَنَا عَمْرُو بْنُ مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا هُشَيْمٌ، قَالَ‏:‏ أَخْبَرَنَا مَنْصُورٌ، عَنِ الْحَسَنِ، أَنَّ يَتِيمًا كَانَ يَحْضُرُ طَعَامَ ابْنِ عُمَرَ، فَدَعَا بِطَعَامٍ ذَاتَ يَوْمٍ، فَطَلَبَ يَتِيمَهُ فَلَمْ يَجِدْهُ، فَجَاءَ بَعْدَ مَا فَرَغَ ابْنُ عُمَرَ، فَدَعَا لَهُ ابْنُ عُمَرَ بِطَعَامٍ، لَمْ يَكُنْ عِنْدَهُمْ، فَجَاءَه بِسَوِيقٍ وَعَسَلٍ، فَقَالَ‏:‏ دُونَكَ هَذَا، فَوَاللَّهِ مَا غُبِنْتَ يَقُولُ الْحَسَنُ‏:‏ وَابْنُ عُمَرَ وَاللَّهِ مَا غُبِنَ‏.‏","english":{"narrator":"","text":"Al-Hasan reported that an orphan used to eat with Ibn 'Umar. One day\nhe called for food and looked for this orphan but could not find him. He\narrived after Ibn 'Umar had finished. Ibn 'Umar called for more food to be\nbrought to him but they did not have any. So he was brought sawiq and honey.\nHe said, \"Here, have this! By Allah, you have not been cheated!\" Al-Hasan\nsaid, \"By Allah, Ibn 'Umar was not cheated!\""}},{"id":7,"idInBook":7,"chapterId":7,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ عَبْدِ الْوَهَّابِ قَالَ‏:‏ حَدَّثَنِي عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ قَالَ‏:‏ حَدَّثَنِي أَبِي قَالَ‏:‏ سَمِعْتُ سَهْلَ بْنَ سَعْدٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ أَنَا وَكَافِلُ الْيَتِيمِ فِي الْجَنَّةِ هَكَذَا، وَقَالَ بِإِصْبَعَيْهِ السَّبَّابَةِ وَالْوُسْطَى‏.‏","english":{"narrator":"","text":"Sahl ibn Sa'd reported that the Prophet, may Allah bless him and grant\nhim peace, said, \"I and the guardian of the orphan will be in the Garden\nlike that,\" indicating his forefinger and middle finger."}},{"id":8,"idInBook":8,"chapterId":7,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى، قَالَ‏:‏ حَدَّثَنَا الْعَلاَءُ بْنُ خَالِدِ بْنِ وَرْدَانَ، قَالَ‏:‏ حَدَّثَنَا أَبُو بَكْرِ بْنُ حَفْصٍ، أَنَّ عَبْدَ اللهِ كَانَ لاَ يَأْكُلُ طَعَامًا إِلاَّ وَعَلَى خِوَانِهِ يَتِيمٌ‏.‏","english":{"narrator":"","text":"Abu Bakr ibn Hafs reported that 'Abdullah would not eat unless an orphan\nwas at his table."}},{"id":9,"idInBook":9,"chapterId":7,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ عُثْمَانَ، قَالَ‏:‏ أَخْبَرَنَا عَبْدُ اللهِ، قَالَ‏:‏ أَخْبَرَنَا سَعِيدُ بْنُ أَبِي أَيُّوبَ، عَنْ يَحْيَى بْنِ أَبِي سُلَيْمَانَ، عَنِ ابْنِ أَبِي عَتَّابٍ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ خَيْرُ بَيْتٍ فِي الْمُسْلِمِينَ بَيْتٌ فِيهِ يَتِيمٌ يُحْسَنُ إِلَيْهِ، وَشَرُّ بَيْتٍ فِي الْمُسْلِمِينَ بَيْتٌ فِيهِ يَتِيمٌ يُسَاءُ إِلَيْهِ، أَنَا وَكَافِلُ الْيَتِيمِ فِي الْجَنَّةِ كَهَاتَيْنِ يُشِيرُ بِإِصْبَعَيْهِ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Messenger of Allah, may Allah bless him\nand grant him peace, said, \"The best house among the Muslims is the house\nin which orphans are well treated. The worst house among the Muslims is the\nhouse in which orphans are ill treated. I and the guardian of the orphan\nwill be in the Garden like that,\" indicating his two fingers."}},{"id":10,"idInBook":10,"chapterId":7,"bookId":15,"arabic":"حَدَّثَنَا عَمْرُو بْنُ عَبَّاسٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي إِسْحَاقَ قَالَ‏:‏ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ أَبْزَى قَالَ‏:‏ قَالَ دَاوُدُ‏:‏ كُنَّ لِلْيَتِيمِ كَالأَبِ الرَّحِيمِ، وَاعْلَمْ أَنَّكَ كَمَا تَزْرَعُ كَذَلِكَ تَحْصُدُ، مَا أَقْبَحَ الْفَقْرَ بَعْدَ الْغِنَى، وَأَكْثَرُ مِنْ ذَلِكَ، أَوْ أَقْبَحُ مِنْ ذَلِكَ، الضَّلاَلَةُ بَعْدَ الْهُدَى، وَإِذَا وَعَدْتَ صَاحِبَكَ فَأَنْجِزْ لَهُ مَا وَعَدْتَهُ، فَإِنْ لاَ تَفْعَلْ يُورِثُ بَيْنَكَ وَبَيْنَهُ عَدَاوَةٌ، وَتَعَوَّذْ بِاللَّهِ مِنْ صَاحِبٍ إِنْ ذَكَرْتَ لَمْ يُعِنْكَ، وَإِنْ نَسِيتَ لَمْ يُذَكِّرْكَ‏.‏","english":{"narrator":"Dawud said, \"Be like a merciful father towards the orphan. Know that\nyou will reap as you sow. How ugly poverty is after wealth! More than that:","text":"how ugly is misguidance after guidance! When you make a promise to your friend,\nfulfil your promise. If you do not, it will bring about enmity between you\nand him. Seek refuge in Allah from a companion who, when you mention something\nto him, does not help you and who does not remind you when you forget.\""}},{"id":11,"idInBook":11,"chapterId":7,"bookId":15,"arabic":"نَجِيحٍ أَبُو عُمَارَةَ قَالَ‏:‏ سَمِعْتُ الْحَسَنَ يَقُولُ‏:‏ لَقَدْ عَهِدْتُ الْمُسْلِمِينَ، وَإِنَّ الرَّجُلَ مِنْهُمْ لَيُصْبِحُ فَيَقُولُ‏:‏ يَا أَهْلِيَهْ، يَا أَهْلِيَهْ، يَتِيمَكُمْ يَتِيمَكُمْ، يَا أَهْلِيَهْ، يَا أَهْلِيَهْ، مِسْكِينَكُمْ مِسْكِينَكُمْ، يَا أَهْلِيَهْ، يَا أَهْلِيَهْ، جَارَكُمْ جَارَكُمْ، وَأُسْرِعَ بِخِيَارِكُمْ وَأَنْتُمْ كُلَّ يَوْمٍ تَرْذُلُونَ‏.‏ وَسَمِعْتُهُ يَقُولُ‏:‏ وَإِذَا شِئْتَ رَأَيْتَهُ فَاسِقًا يَتَعَمَّقُ بِثَلاَثِينَ أَلْفًا إِلَى النَّارِ مَا لَهُ قَاتَلَهُ اللَّهُ‏؟‏ بَاعَ خَلاَقَهُ مِنَ اللهِ بِثَمَنِ عَنْزٍ، وَإِنْ شِئْتَ رَأَيْتَهُ مُضَيِّعًا مُرْبَدًّا فِي سَبِيلِ الشَّيْطَانِ، لاَ وَاعِظَ لَهُ مِنْ نَفْسِهِ وَلاَ مِنَ النَّاسِ‏.‏","english":{"narrator":"","text":"Al-Hasan said, \"I remember a time among the Muslims when their men would\nshout (to remind their families), 'O family! O family! (Look after) your\norphan! Your orphan! O family! O family! (Look after) your orphan! Your poor\nperson! Your poor person! O family! O family! (Look after) your neighbour!\nYour neighbour!' Time has been swift in taking the best of you while every\nday you become baser.\""}},{"id":12,"idInBook":12,"chapterId":7,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى، قَالَ‏:‏ حَدَّثَنَا سَلاَّمُ بْنُ أَبِي مُطِيعٍ، عَنْ أَسْمَاءَ بْنِ عُبَيْدٍ قَالَ‏:‏ قُلْتُ لِابْنِ سِيرِينَ‏:‏ عِنْدِي يَتِيمٌ، قَالَ‏:‏ اصْنَعْ بِهِ مَا تَصْنَعُ بِوَلَدِكَ، اضْرِبْهُ مَا تَضْرِبُ وَلَدَكَ‏.‏","english":{"narrator":"","text":"Asma' bint 'Ubayd said, \"I said to Ibn Sirin, 'I have an orphan in my\ncare.' He said, 'Treat him as you would treat your own child. Beat him as\nyou would beat your own child.'\""}},{"id":13,"idInBook":13,"chapterId":7,"bookId":15,"arabic":"حَدَّثَنَا أَبُو عَاصِمٍ، عَنْ نَهَّاسِ بْنِ قَهْمٍ، عَنْ شَدَّادٍ أَبِي عَمَّارٍ، عَنْ عَوْفِ بْنِ مَالِكٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ أَنَا وَامْرَأَةٌ سَفْعَاءُ الْخَدَّيْنِ، امْرَأَةٌ آمَتْ مِنْ زَوْجِهَا فَصَبَرْتَ عَلَى وَلَدِهَا، كَهَاتَيْنِ فِي الْجَنَّةِ‏.‏","english":{"narrator":"","text":"'Awf ibn Malik reported that the Prophet, may Allah bless him and grant\nhim peace, said, \"I and a woman who is widowed and is patient with her child\nwill be like these two fingers in the Garden.\""}},{"id":14,"idInBook":14,"chapterId":7,"bookId":15,"arabic":"حَدَّثَنَا مُسْلِمٌ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، عَنْ شُمَيْسَةَ الْعَتَكِيَّةِ قَالَتْ‏:‏ ذُكِرَ أَدَبُ الْيَتِيمِ عِنْدَ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا، فَقَالَتْ‏:‏ إِنِّي لأَضْرِبُ الْيَتِيمَ حَتَّى يَنْبَسِطَ‏.‏","english":{"narrator":"","text":"Shumaysa al-'Atakiyya said, \"The disciplining of orphans was mentioned\nin the presence of 'A'isha and she said, 'I would beat an orphan until he\nsubmits.'\""}}],"chapter":{"id":7,"bookId":15,"arabic":"كتاب الْكَرَمِ وَ يَتِيمٌ","english":"Generosity and Orphans"}}