{"metadata":{"length":13,"arabic":{"title":"الأدب المفرد","author":"الإمام محمد بن إسماعيل البخاري","introduction":"كتاب موت الأولاد"},"english":{"title":"Al-Adab Al-Mufrad","author":"Imam Muhammad ibn Ismail al-Bukhari","introduction":"Children's Death"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":8,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ قَالَ‏:‏ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنِ ابْنِ الْمُسَيِّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم قَالَ‏:‏ لاَ يَمُوتُ لأَحَدٍ مِنَ الْمُسْلِمِينَ ثَلاَثَةٌ مِنَ الْوَلَدِ، فَتَمَسَّهُ النَّارُ، إِلاَّ تَحِلَّةَ الْقَسَمِ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Messenger of Allah, may Allah bless him\nand grant him peace, said, \"No Muslim who has had three of his children die\nyoung will enter the Fire, except to expiate an unfulfilled oath.\""}},{"id":2,"idInBook":2,"chapterId":8,"bookId":15,"arabic":"حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ، قَالَ‏:‏ حَدَّثَنَا أَبِي، عَنْ طَلْقِ بْنِ مُعَاوِيَةَ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ امْرَأَةً أَتَتِ النَّبِيَّ صلى الله عليه وسلم بِصَبِيٍّ فَقَالَتِ‏:‏ ادْعُ لَهُ، فَقَدْ دَفَنْتُ ثَلاَثَةً، فَقَالَ‏:‏ احْتَظَرْتِ بِحِظَارٍ شَدِيدٍ مِنَ النَّارِ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that a woman came to the Messenger of Allah, may\nAllah bless him and grant him peace, with a child. She said, \"Make supplication\nfor him. I have buried three children.\" He said, \"You have built a strong\nbarrier against the Fire.\""}},{"id":3,"idInBook":3,"chapterId":8,"bookId":15,"arabic":"حَدَّثَنَا عَيَّاشٌ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الأَعْلَى، قَالَ‏:‏ حَدَّثَنَا سَعِيدٌ الْجُرَيْرِيُّ، عَنْ خَالِدٍ الْعَبْسِيِّ قَالَ‏:‏ مَاتَ ابْنٌ لِي، فَوَجَدْتُ عَلَيْهِ وَجَدَا شَدِيدًا، فَقُلْتُ‏:‏ يَا أَبَا هُرَيْرَةَ، مَا سَمِعْتَ مِنَ النَّبِيِّ صلى الله عليه وسلم شَيْئًا تُسَخِّي بِهِ أَنْفُسَنَا عَنْ مَوْتَانَا‏؟‏ قَالَ‏:‏ سَمِعْتُ مِنَ النَّبِيِّ صلى الله عليه وسلم يَقُولُ‏:‏ صِغَارُكُمْ دَعَامِيصُ الْجَنَّةِ‏.‏","english":{"narrator":"","text":"Khalid al-'Absi said, \"A son of mine died and I felt intense grief over\nhis loss. I said, 'Abu Hurayra, have you heard anything from the Prophet,\nmay Allah bless him and grant him peace, to cheer us regarding our dead?'\nHe replied, 'I heard the Prophet, may Allah bless him and grant him peace,\nsay, \"Your children are roaming freely in the Garden.\"'\""}},{"id":4,"idInBook":4,"chapterId":8,"bookId":15,"arabic":"حَدَّثَنَا عَيَّاشٌ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الأَعْلَى، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاقَ قَالَ‏:‏ حَدَّثَنِي مُحَمَّدُ بْنُ إِبْرَاهِيمَ بْنِ الْحَارِثِ، عَنْ مَحْمُودِ بْنِ لَبِيدٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ قَالَ‏:‏ سَمِعْتُ رَسُولَ اللهِ صلى الله عليه وسلم يَقُولُ‏:‏ مَنْ مَاتَ لَهُ ثَلاَثَةٌ مِنَ الْوَلَدِ فَاحْتَسَبَهُمْ دَخَلَ الْجَنَّةَ، قُلْنَا‏:‏ يَا رَسُولَ اللهِ، وَاثْنَانِ‏؟‏ قَالَ‏:‏ وَاثْنَانِ، قُلْتُ لِجَابِرٍ‏:‏ وَاللَّهِ، أَرَى لَوْ قُلْتُمْ وَاحِدٌ لَقَالَ‏.‏ قَالَ‏:‏ وَأَنَا أَظُنُّهُ وَاللَّهِ‏.‏","english":{"narrator":"","text":"Jabir ibn 'Abdullah said, \"I heard the Messenger of Allah, may Allah\nbless him and grant him peace, say, 'If anyone has three of his children\ndie young and resigns them to Allah, he will enter the Garden.' We said,\n'Messenger of Allah, what about two?' 'And two,' he said.\" Mahmud ibn Labid\nsaid to Jabir, \"By Allah, I think that if you had asked, 'And one?' he would\nhave given a similar answer.\" He said, \"By Allah, I think so too.\""}},{"id":5,"idInBook":5,"chapterId":8,"bookId":15,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللهِ، قَالَ‏:‏ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ قَالَ‏:‏ سَمِعْتُ طَلْقَ بْنَ مُعَاوِيَةَ، هُوَ جَدُّهُ، قَالَ‏:‏ سَمِعْتُ أَبَا زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ امْرَأَةً أَتَتِ النَّبِيَّ صلى الله عليه وسلم بِصَبِيٍّ فَقَالَتِ‏:‏ ادْعُ اللَّهَ لَهُ، فَقَدْ دَفَنْتُ ثَلاَثَةً، فَقَالَ‏:‏ احْتَظَرْتِ بِحِظَارٍ شَدِيدٍ مِنَ النَّارِ‏.‏","english":{"narrator":"","text":"same as 144, different isnad."}},{"id":6,"idInBook":6,"chapterId":8,"bookId":15,"arabic":"حَدَّثَنَا عَلِيٌّ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، قَالَ‏:‏ حَدَّثَنَا سُهَيْلُ بْنُ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ‏:‏ جَاءَتِ امْرَأَةٌ إِلَى رَسُولِ اللهِ صلى الله عليه وسلم فَقَالَتْ‏:‏ يَا رَسُولَ اللهِ، إِنَّا لاَ نَقْدِرُ عَلَيْكَ فِي مَجْلِسِكَ، فَوَاعِدْنَا يَوْمًا نَأْتِكَ فِيهِ، فَقَالَ‏:‏ مَوْعِدُكُنَّ بَيْتُ فُلاَنٍ، فَجَاءَهُنَّ لِذَلِكَ الْوَعْدِ، وَكَانَ فِيمَا حَدَّثَهُنَّ‏:‏ مَا مِنْكُنَّ امْرَأَةٌ يَمُوتُ لَهَا ثَلاَثٌ مِنَ الْوَلَدِ، فَتَحْتَسِبَهُمْ، إِلاَّ دَخَلَتِ الْجَنَّةَ، فَقَالَتِ امْرَأَةٌ‏:‏ أَوِ اثْنَانِ‏؟‏ قَالَ‏:‏ أَوَِ اثْنَانِ كَانَ سُهَيْلٌ يَتَشَدَّدُ فِي الْحَدِيثِ وَيَحْفَظُ، وَلَمْ يَكُنْ أَحَدٌ يَقْدِرُ أَنْ يَكْتُبَ عِنْدَهُ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported, \"A woman came to the Messenger of Allah, may Allah\nbless him and grant him peace, and said, 'Messenger of Allah! We cannot come\nto sit with you, so set aside a day when we can come.' He said, 'Your appointed\nplace is the house of so-and-so.' He came to the women at that time. Part\nof what he said to them was, 'There is no woman among you who has three children\ndie, resigning them to Allah, who will not enter the Garden.' A woman said,\n'And if it is two?' He replied, 'And if it is two.'\""}},{"id":7,"idInBook":7,"chapterId":8,"bookId":15,"arabic":"حَدَّثَنَا حَرَمِيُّ بْنُ حَفْصٍ، وَمُوسَى بْنُ إِسْمَاعِيلَ، قَالاَ‏:‏ حَدَّثَنَا عَبْدُ الْوَاحِدِ، قَالَ‏:‏ حَدَّثَنَا عُثْمَانُ بْنُ حَكِيمٍ قَالَ‏:‏ حَدَّثَنِي عَمْرُو بْنُ عَامِرٍ الأَنْصَارِيُّ قَالَ‏:‏ حَدَّثَتْنِي أُمُّ سُلَيْمٍ قَالَتْ‏:‏ كُنْتُ عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَقَالَ‏:‏ يَا أُمَّ سُلَيْمٍ مَا مِنْ مُسْلِمَيْنِ يَمُوتُ لَهُمَا ثَلاَثَةُ أَوْلاَدٍ، إِلاَّ أَدْخَلَهُمَا اللَّهُ الْجَنَّةَ بِفَضْلِ رَحْمَتِهِ إِيَّاهُمْ، قُلْتُ‏:‏ وَاثْنَانِ‏؟‏ قَالَ‏:‏ وَاثْنَانِ‏.‏","english":{"narrator":"","text":"Umm Salim said, \"While I was with the Prophet, may Allah bless him and\ngrant him peace, he said, 'Umm Salim! There is no Muslim couple who have\nthree of their children die without Allah admitting them to the Garden by\nvirtue of His mercy to them.' I said, 'And if there are two?' He said, 'And\nif there are two.'\""}},{"id":8,"idInBook":8,"chapterId":8,"bookId":15,"arabic":"حَدَّثَنَا عَلِيٌّ، قَالَ‏:‏ حَدَّثَنَا مُعْتَمِرٌ قَالَ‏:‏ قَرَأْتُ عَلَى الْفُضَيْلِ‏:‏ عَنْ أَبِي حَرِيزٍ، أَنَّ الْحَسَنَ حَدَّثَهُ بِوَاسِطَ، أَنَّ صَعْصَعَةَ بْنَ مُعَاوِيَةَ حَدَّثَهُ، أَنَّهُ لَقِيَ أَبَا ذَرٍّ مُتَوَشِّحًا قِرْبَةً، قَالَ‏:‏ مَا لَكَ مِنَ الْوَلَدِ يَا أَبَا ذَرٍّ قَالَ‏:‏ أَلاَ أُحَدِّثُكَ‏؟‏ قُلْتُ‏:‏ بَلَى، قَالَ‏:‏ سَمِعْتُ رَسُولَ اللهِ صلى الله عليه وسلم يَقُولُ‏:‏ مَا مِنْ مُسْلِمٍ يَمُوتُ لَهُ ثَلاَثَةٌ مِنَ الْوَلَدِ لَمْ يَبْلُغُوا الْحِنْثَ، إِلاَّ أَدْخَلَهُ اللَّهُ الْجَنَّةَ بِفَضْلِ رَحْمَتِهِ إِيَّاهُمْ، وَمَا مِنْ رَجُلٍ أَعْتَقَ مُسْلِمًا إِلاَّ جَعَلَ اللَّهُ عَزَّ وَجَلَّ كُلَّ عُضْوٍ مِنْهُ، فِكَاكَهُ لِكُلِّ عُضْوٍ مِنْهُ‏.‏","english":{"narrator":"","text":"Al-Hasan reported that Sa'sa'a ibn Mu'awiya told him that he met Abu\nDharr finding him alone without any relatives and asked, \"Don't you have\nany children, Abu Dharr?\" He said, \"I heard the Messenger of Allah, may Allah\nbless him and grant him peace, say, 'There is no Muslim who has three of\nhis children die before they reach puberty without Allah admitting him to\nthe Garden by virtue of His mercy to them. There is no man who frees a Muslim\nwith Allah Almighty making each of the limbs of the one who is freed a ransom\nfor each of the emancipator's limbs.'\""}},{"id":9,"idInBook":9,"chapterId":8,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ أَبِي الأَسْوَدِ، قَالَ‏:‏ حَدَّثَنَا زَكَرِيَّا بْنُ عُمَارَةَ الأَنْصَارِيُّ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ صُهَيْبٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ مَنْ مَاتَ لَهُ ثَلاَثَةٌ لَمْ يَبْلُغُوا الْحِنْثَ، أَدْخَلَهُ اللَّهُ وَإِيَّاهُمْ بِفَضْلِ رَحْمَتِهِ الْجَنَّةَ‏.‏","english":{"narrator":"","text":"Anas ibn Malik reported that the Prophet, may Allah bless him and grant\nhim peace, said, \"If someone has three children die before they reach puberty,\nAllah will admit him and them to the Garden by virtue of His mercy.\""}},{"id":10,"idInBook":10,"chapterId":8,"bookId":15,"arabic":"حَدَّثَنَا إِسْحَاقُ بْنُ يَزِيدَ، قَالَ‏:‏ حَدَّثَنَا صَدَقَةُ بْنُ خَالِدٍ قَالَ‏:‏ حَدَّثَنِي يَزِيدُ بْنُ أَبِي مَرْيَمَ، عَنْ أُمِّهِ، عَنْ سَهْلِ بْنِ الْحَنْظَلِيَّةِ، وَكَانَ لاَ يُولَدُ لَهُ، فَقَالَ‏:‏ لأَنْ يُولَدَ لِي فِي الإِسْلاَمِ وَلَدٌ سَقْطٌ فَأَحْتَسِبَهُ، أَحَبُّ إِلَيَّ مِنْ أَنْ يكُونَ لِيَ الدُّنْيَا جَمِيعًا وَمَا فِيهَا وَكَانَ ابْنُ الْحَنْظَلِيَّةِ مِمَّنْ بَايَعَ تَحْتَ الشَّجَرَةِ‏.‏","english":{"narrator":"","text":"Sahl ibn al-Hanzala, who had no children, said, \"I would prefer to have\na miscarried child while I am a Muslim and resign that child to Allah than\nto have the entire world and what it contains.\""}},{"id":11,"idInBook":11,"chapterId":8,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، قَالَ‏:‏ أَخْبَرَنَا أَبُو مُعَاوِيَةَ، قَالَ‏:‏ حَدَّثَنَا الأَعْمَشُ، عَنْ إِبْرَاهِيمَ التَّيْمِيِّ، عَنِ الْحَارِثِ بْنِ سُوَيْدٍ، عَنْ عَبْدِ اللهِ قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ أَيُّكُمْ مَالُ وَارِثِهِ أَحَبُّ إِلَيْهِ مِنْ مَالِهِ‏؟‏ قَالُوا‏:‏ يَا رَسُولَ اللهِ، مَا مِنَّا مِنْ أَحَدٍ إِلاَّ مَالُهُ أَحَبُّ إِلَيْهِ مِنْ مَالِ وَارِثِهِ، فَقَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ اعْلَمُوا أَنَّهُ لَيْسَ مِنْكُمْ أَحَدٌ إِلاَّ مَالُ وَارِثِهِ أَحَبُّ إِلَيْهِ مِنْ مَالِهِ، مَالُكَ مَا قَدَّمْتَ، وَمَالُ وَارِثِكَ مَا أَخَّرْتَ‏.‏","english":{"narrator":"","text":"'Abdullah reported that the Messenger of Allah, may Allah bless him\nand grant him peace, said, \"Which of you prefers the money of heirs to his\nown money?\" \"Messenger of Allah,\" they replied, \"there is none of us who\ndoes not prefer his own wealth to that of his heirs.\" The Messenger of Allah,\nmay Allah bless him and grant him peace, said, \"Know that there is not one\nof you who does not prefer his heirs' money to his own. Your wealth is what\nyou have spent (for Allah) and the wealth of your heirs is what you leave.\""}},{"id":12,"idInBook":12,"chapterId":8,"bookId":15,"arabic":"قَالَ‏:‏ وَقَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ مَا تَعُدُّونَ فِيكُمُ الرَّقُوبَ‏؟‏ قَالُوا‏:‏ الرَّقُوبُ الَّذِي لاَ يُولَدُ لَهُ، قَالَ‏:‏ لاَ، وَلَكِنَّ الرَّقُوبَ الَّذِي لَمْ يُقَدِّمْ مِنْ وَلَدِهِ شَيْئًا‏.‏","english":{"narrator":"","text":"He said that the Messenger of Allah, may Allah bless him and grant him\npeace, said, \"Who do you reckon to be the childless among you?\" They said,\n\"They are those who do not have any children.\" No,\" he said, \"The childless\nare those who have not sent any of their children ahead (i.e. none of their\nchildren have died).\""}},{"id":13,"idInBook":13,"chapterId":8,"bookId":15,"arabic":"قَالَ‏:‏ وَقَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ مَا تَعُدُّونَ فِيكُمُ الصُّرَعَةَ‏؟‏ قَالُوا‏:‏ هُوَ الَّذِي لاَ تَصْرَعُهُ الرِّجَالُ، فَقَالَ‏:‏ لاَ، وَلَكِنَّ الصُّرَعَةَ الَّذِي يَمْلِكُ نَفْسَهُ عِنْدَ الْغَضَبِ‏.‏","english":{"narrator":"","text":"He reported that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"Who do you reckon to be the one who most often throws people\ndown (in a fight)?\" They replied, \"The one whom men do not throw down.\" He\nsaid, \"No the one who throws people down is the person who controls himself\nwhen he is angry.\""}}],"chapter":{"id":8,"bookId":15,"arabic":"كتاب موت الأولاد","english":"Children's Death"}}