{"metadata":{"length":56,"arabic":{"title":"الأدب المفرد","author":"الإمام محمد بن إسماعيل البخاري","introduction":"كتاب الملكة"},"english":{"title":"Al-Adab Al-Mufrad","author":"Imam Muhammad ibn Ismail al-Bukhari","introduction":"Being a master"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":9,"bookId":15,"arabic":"حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، قَالَ‏:‏ حَدَّثَنَا عُمَرُ بْنُ الْفَضْلِ، قَالَ‏:‏ حَدَّثَنَا نُعَيْمُ بْنُ يَزِيدَ، قَالَ‏:‏ حَدَّثَنَا عَلِيُّ بْنُ أَبِي طَالِبٍ صَلَوَاتُ اللهِ عَلَيْهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم لَمَّا ثَقُلَ قَالَ‏:‏ يَا عَلِيُّ، ائْتِنِي بِطَبَقٍ أَكْتُبْ فِيهِ مَا لاَ تَضِلُّ أُمَّتِي بَعْدِي، فَخَشِيتُ أَنْ يَسْبِقَنِي فَقُلْتُ‏:‏ إِنِّي لَأَحْفَظُ مِنْ ذِرَاعَيِ الصَّحِيفَةِ، وَكَانَ رَأْسُهُ بَيْنَ ذِرَاعِي وَعَضُدِي، فَجَعَلَ يُوصِي بِالصَّلاَةِ وَالزَّكَاةِ وَمَا مَلَكَتْ أَيْمَانُكُمْ، وَقَالَ كَذَاكَ حَتَّى فَاضَتْ نَفْسُهُ، وَأَمَرَهُ بِشَهَادَةِ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ، مَنْ شَهِدَ بِهِمَا حُرِّمَ عَلَى النَّارِ‏.‏","english":{"narrator":"","text":"'Ali ibn Talib reported that when the illness of the Prophet, may\nAllah bless him and grant him peace, deepened, he said, \"'Ali! Bring me\na page on which I can write something for my community after which they\nwill not go astray.\" 'Ali said, \"I feared that he would die before I could\ndo that, so I said, 'I will remember better than the paper.' His head was\nbetween my forearm and my leg. He recommended the prayer, zakat and kind\ntreatment of slaves. he spoke like that until he died.\" He commanded him\nto testify, \"There is no god but Allah and Muhammad is His slave and Messenger.\nAnyone who testifies to that is saved from the Fire.\""}},{"id":2,"idInBook":2,"chapterId":9,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَابِقٍ، قَالَ‏:‏ حَدَّثَنَا إِسْرَائِيلُ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللهِ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ أَجِيبُوا الدَّاعِيَ، وَلاَ تَرُدُّوا الْهَدِيَّةَ، وَلاَ تَضْرِبُوا الْمُسْلِمِينَ‏.‏","english":{"narrator":"","text":"'Abdullah reported that the Prophet, may Allah bless him and grant\nhim peace, said, \"Respond to invitations. Do not reject gifts. Do not beat\nMuslims.\""}},{"id":3,"idInBook":3,"chapterId":9,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، قَالَ‏:‏ أَخْبَرَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، عَنْ مُغِيرَةَ، عَنْ أُمِّ مُوسَى، عَنْ عَلِيٍّ صَلَوَاتُ اللهِ عَلَيْهِ قَالَ‏:‏ كَانَ آخِرُ كَلاَمِ النَّبِيِّ صلى الله عليه وسلم‏:‏ الصَّلاَةَ، الصَّلاَةَ، اتَّقُوا اللَّهَ فِيمَا مَلَكَتْ أَيْمَانُكُمْ‏.‏","english":{"narrator":"'Ali reported that the last words of the Prophet, may Allah bless\nhim and grant him peace, were:","text":"\"The prayer! The prayer! Fear Allah concerning\nyour slaves!\""}},{"id":4,"idInBook":4,"chapterId":9,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ صَالِحٍ قَالَ‏:‏ حَدَّثَنِي مُعَاوِيَةُ بْنُ صَالِحٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرِ بْنِ نُفَيْرٍ، عَنْ أَبِيهِ، عَنْ أَبِي الدَّرْدَاءِ، أَنَّهُ كَانَ يَقُولُ لِلنَّاسِ‏:‏ نَحْنُ أَعْرَفُ بِكُمْ مِنَ الْبَيَاطِرَةِ بِالدَّوَابِّ، قَدْ عَرَفْنَا خِيَارَكُمْ مِنْ شِرَارِكُمْ‏.‏ أَمَّا خِيَارُكُمُ‏:‏ الَّذِي يُرْجَى خَيْرُهُ، وَيُؤْمَنُ شَرُّهُ‏.‏ وَأَمَّا شِرَارُكُمْ‏:‏ فَالَّذِي لاَ يُرْجَى خَيْرُهُ، وَلاَ يُؤْمَنُ شَرُّهُ، وَلاَ يُعْتَقُ مُحَرَّرُهُ‏.‏","english":{"narrator":"","text":"Abu'd-Darda' used to say to people. \"We know you better than the\nveterinarian knows his animals. We recognise the best of you from the worst\nof you. The best of you is the one whose good is hoped for and the one\nwhose evil you are safe from. As for the worst of you, that is the person\nwhose good is not hoped for and whose evil you are not safe from and he\ndoes not free slaves.\""}},{"id":5,"idInBook":5,"chapterId":9,"bookId":15,"arabic":"حَدَّثَنَا عِصَامُ بْنُ خَالِدٍ، قَالَ‏:‏ حَدَّثَنَا حَرِيزُ بْنُ عُثْمَانَ، عَنِ ابْنِ هَانِئٍ، عَنْ أَبِي أُمَامَةَ، سَمِعْتُهُ يَقُولُ‏:‏ الْكَنُودُ‏:‏ الَّذِي يَمْنَعُ رِفْدَهُ، وَيَنْزِلُ وَحْدَهُ، وَيَضْرِبُ عَبْدَهُ‏.‏","english":{"narrator":"","text":"Abu Umama said, \"Ingratitude is typified by someone who refuses\nto give, lives alone, and beats his slave.\""}},{"id":6,"idInBook":6,"chapterId":9,"bookId":15,"arabic":"حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ، قَالَ‏:‏ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ عَلِيِّ بْنِ زَيْدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، وَحَمَّادٍ، عَنْ حَبِيبٍ، وَحُمَيْدٍ، عَنِ الْحَسَنِ أَنَّ رَجُلاً أَمَرَ غُلاَمًا لَهُ أَنْ يَسْنُوَ عَلَى بَعِيرٍ لَهُ، فَنَامَ الْغُلاَمُ، فَجَاءَ بِشُعْلَةٍ مِنْ نَارٍ فَأَلْقَاهَا فِي وَجْهِهِ، فَتَرَدَّى الْغُلاَمُ فِي بِئْرٍ، فَلَمَّا أَصْبَحَ أَتَى عُمَرَ بْنَ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ، فَرَأَى الَّذِي فِي وَجْهِهِ، فَأَعْتَقَهُ‏.‏","english":{"narrator":"","text":"Al-Hasan reported that a man ordered one of his slaves to draw\nwater using one of his camels and the man fell asleep. The master came\nwith a torch and put it in his face and the slave fell into the well. In\nthe morning, the slave went to 'Umar ibn al-Khattab and 'Umar saw what\nhad happened to his slave and therefore 'Umar set him free.\""}},{"id":7,"idInBook":7,"chapterId":9,"bookId":15,"arabic":"حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، قَالَ‏:‏ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنِ ابْنِ عَمْرَةَ، عَنْ عَمْرَةَ، أَنَّ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا دَبَّرَتْ أَمَةً لَهَا، فَاشْتَكَتْ عَائِشَةُ، فَسَأَلَ بَنُو أَخِيهَا طَبِيبًا مِنَ الزُّطِّ، فَقَالَ‏:‏ إِنَّكُمْ تُخْبِرُونِي عَنِ امْرَأَةٍ مَسْحُورَةٍ، سَحَرَتْهَا أَمَةٌ لَهَا، فَأُخْبِرَتْ عَائِشَةُ، قَالَتْ‏:‏ سَحَرْتِينِي‏؟‏ فَقَالَتْ‏:‏ نَعَمْ، فَقَالَتْ‏:‏ وَلِمَ‏؟‏ لاَ تَنْجَيْنَ أَبَدًا، ثُمَّ قَالَتْ‏:‏ بِيعُوهَا مِنْ شَرِّ الْعَرَبِ مَلَكَةً‏.‏","english":{"narrator":"","text":"'Amra reported that 'A'isha had made one of her slavegirls a mudabbar\n(one who would be set free after her death). Then 'A'isha became ill and\nher nephews consulted a gypsy doctor. He said, \"You are asking me for information\nabout a bewitched woman. A slavegirl of hers has bewitched her.\" 'A'isha\nwas told and asked the girl, \"Have you put a spell on me?\" \"Yes,\" she replied.\n\"Why?' she asked. \"Because you will never free me,\" she answered. Then\n'A'isha said, \"Sell her to the worst masters among the Arabs.\""}},{"id":8,"idInBook":8,"chapterId":9,"bookId":15,"arabic":"حَدَّثَنَا حَجَّاجٌ، قَالَ‏:‏ حَدَّثَنَا حَمَّادٌ، هُوَ ابْنُ سَلَمَةَ، قَالَ‏:‏ أَخْبَرَنَا أَبُو غَالِبٍ، عَنْ أَبِي أُمَامَةَ، قَالَ‏:‏ أَقْبَلَ النَّبِيُّ صلى الله عليه وسلم مَعَهُ غُلامَانِ، فَوَهَبَ أَحَدُهُمَا لِعَلِيٍّ صَلَوَاتُ اللهِ عَلَيْهِ، وَقَالَ‏:‏ لاَ تَضْرِبْهُ، فَإِنِّي نُهِيتُ عَنْ ضَرْبِ أَهْلِ الصَّلاَةِ، وَإِنِّي رَأَيْتُهُ يُصَلِّي مُنْذُ أَقْبَلْنَا، وَأَعْطَى أَبَا ذَرٍّ غُلاَمًا، وَقَالَ‏:‏ اسْتَوْصِ بِهِ مَعْرُوفًا فَأَعْتَقَهُ، فَقَالَ‏:‏ مَا فَعَلَ‏؟‏ قَالَ‏:‏ أَمَرْتَنِي أَنْ أَسْتَوْصِي بِهِ خَيْرًا فَأَعْتَقْتُهُ‏.‏","english":{"narrator":"","text":"Abu Umama said, \"The Prophet, may Allah bless him and grant him\npeace, came with two slaves and gave one of them to 'Ali and said, 'Do\nnot beat him. I have forbidden beating the people of the prayer and I saw\nhim praying before we came.' He gave Abu Dharr a slave and said, \"I recommend\nthat you treat him well,' so Abu Dharr set him free. He said, 'What have\nyou done?' He replied, 'You commanded me to treat him well, so I set him\nfree.'\""}},{"id":9,"idInBook":9,"chapterId":9,"bookId":15,"arabic":"حَدَّثَنَا أَبُو مَعْمَرٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْوَارِثِ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْعَزِيزِ، عَنْ أَنَسٍ قَالَ‏:‏ قَدِمَ النَّبِيُّ صلى الله عليه وسلم الْمَدِينَةَ وَلَيْسَ لَهُ خَادِمٌ، فَأَخَذَ أَبُو طَلْحَةَ بِيَدِي، فَانْطَلَقَ بِي حَتَّى أَدْخَلَنِي عَلَى النَّبِيِّ صلى الله عليه وسلم، فَقَالَ‏:‏ يَا نَبِيَّ اللهِ، إِنَّ أَنَسًا غُلاَمٌ كَيِّسٌ لَبِيبٌ، فَلْيَخْدُمْكَ‏.‏ قَالَ‏:‏ فَخَدَمْتُهُ فِي السَّفَرِ وَالْحَضَرِ، مَقْدَمَهُ الْمَدِينَةَ حَتَّى تُوُفِّيَ صلى الله عليه وسلم، مَا قَالَ لِي لِشَيْءٍ صَنَعْتُ‏:‏ لِمَ صَنَعْتَ هَذَا هَكَذَا‏؟‏ وَلاَ قَالَ لِي لِشَيْءٍ لَمْ أَصْنَعْهُ‏:‏ أَلاَ صَنَعْتَ هَذَا هَكَذَا‏؟‏‏.‏","english":{"narrator":"","text":"Anas said, \"The Prophet, may Allah bless him and grant him peace,\ncame to Madina without any servant. Abu Talha took my hand and brought\nme to the Prophet, may Allah bless him and grant him peace, and said, 'Prophet\nof Allah!' This is Anas, a clever and intelligent boy. Let him serve him.'\"\n\nAnas said, \"I served him when he was at home and on journeys from the time he came to Madina until he died, may Allah bless him and grant him peace. He never said to me about anything I had done, 'Why did you do this?' nor did he say to me about something I had not done, 'Why did you not do such-and-such?'\""}},{"id":10,"idInBook":10,"chapterId":9,"bookId":15,"arabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ‏:‏ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عُمَرَ بْنِ أَبِي سَلَمَةَ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ إِذَا سَرَقَ الْمَمْلُوكُ بِعْهُ وَلَوْ بِنَشٍّ قَالَ أَبُو عَبْدِ اللهِ‏:‏ النَّشُّ‏:‏ عِشْرُونَ‏.‏ وَالنَّوَاةُ‏:‏ خَمْسَةٌ‏.‏ وَالأُوقِيَّةُ‏:‏ أَرْبَعُونَ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"When a slave steals, sell him, even for\na half an awqiya.\""}},{"id":11,"idInBook":11,"chapterId":9,"bookId":15,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ، حَدَّثَنَا دَاوُدُ بْنُ عَبْدِ الرَّحْمَنِ قَالَ‏:‏ سَمِعْتُ إِسْمَاعِيلَ، عَنْ عَاصِمِ بْنِ لَقِيطِ بْنِ صَبِرَةَ، عَنْ أَبِيهِ قَالَ‏:‏ انْتَهَيْتُ إِلَى النَّبِيِّ صلى الله عليه وسلم، وَدَفَعَ الرَّاعِي فِي الْمُرَاحِ سَخْلَةً، فَقَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ لاَ تَحْسِبَنَّ، وَلَمْ يَقُلْ‏:‏ لاَ تَحْسَبَنَّ إِنَّ لَنَا غَنَمًا مِئَةً لاَ نُرِيدُ أَنْ تَزِيدَ، فَإِذَا جَاءَ الرَّاعِي بِسَخْلَةٍ ذَبَحْنَا مَكَانَهَا شَاةً، فَكَانَ فِيمَا قَالَ‏:‏ لاَ تَضْرِبْ ظَعِينَتَكَ كَضَرْبِكَ أَمَتَكَ، وَإِذَا اسْتَنْشَقْتَ فَبَالِغْ، إِلاَّ أَنْ تَكُونَ صَائِمًا‏.‏","english":{"narrator":"","text":"Laqit ibn Sabira reported that his father said, \"I went to the\nProphet, may Allah bless him and grant him peace, when a shepherd had driven\na lamp into the evening pasture. The Prophet, may Allah bless him and grant\nhim peace, said, 'Do not suppose that we have a hundred sheep and do not\nwant to give you more than only a lamb. When the shepherd brought the lamb,\nwe sacrificed a sheep in its place.'\"\n\nLaqit said, \"Part of what he said is, 'Do not beat your wife as you would beat your slavegirl. When you wash your nose, snuff up water freely unless you are fasting.'\""}},{"id":12,"idInBook":12,"chapterId":9,"bookId":15,"arabic":"حَدَّثَنَا بِشْرُ بْنُ مُحَمَّدٍ، قَالَ‏:‏ أَخْبَرَنَا عَبْدُ اللهِ، قَالَ‏:‏ أَخْبَرَنَا أَبُو خَلْدَةَ، عَنْ أَبِي الْعَالِيَةِ قَالَ‏:‏ كُنَّا نُؤْمَرُ أَنْ نَخْتِمَ عَلَى الْخَادِمِ، وَنَكِيلَ، وَنَعُدَّهَا، كَرَاهِيَةَ أَنْ يَتَعَوَّدُوا خُلُقَ سُوءٍ، أَوْ يَظُنَّ أَحَدُنَا ظَنَّ سُوءٍ‏.‏","english":{"narrator":"","text":"Abu'l-'Aliyya said, \"We were ordered to finish off things for the\nservant and to measure and count because we did not want to allow them\nto accustom themselves to bad habits nor for anyone to think evil of us.\""}},{"id":13,"idInBook":13,"chapterId":9,"bookId":15,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ‏:‏ حَدَّثَنَا إِسْرَائِيلُ، عَنْ أَبِي إِسْحَاقَ، عَنْ حَارِثَةَ بْنِ مُضَرِّبٍ، عَنْ سَلْمَانَ قَالَ‏:‏ إِنِّي لَأَعُدُّ الْعُرَاقَ عَلَى خَادِمِي مَخَافَةَ الظَّنِّ‏.‏","english":{"narrator":"","text":"Salman said, \"I count the soup bones for my slave, fearing people's\nopinion.\""}},{"id":14,"idInBook":14,"chapterId":9,"bookId":15,"arabic":"حَدَّثَنَا حَجَّاجٌ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ قَالَ‏:‏ أَنْبَأَنَا أَبُو إِسْحَاقَ قَالَ‏:‏ سَمِعْتُ حَارِثَةَ بْنَ مُضَرِّبٍ قَالَ‏:‏ سَمِعْتُ سَلْمَانَ‏:‏ إِنِّي لَأَعُدُّ الْعُرَاقَ خَشْيَةَ الظَّنِّ‏.‏","english":{"narrator":"","text":"same as 168."}},{"id":15,"idInBook":15,"chapterId":9,"bookId":15,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ عِيسَى، قَالَ‏:‏ حَدَّثَنَا عَبْدُ اللهِ بْنُ وَهْبٍ قَالَ‏:‏ أَخْبَرَنِي مَخْرَمَةُ بْنُ بُكَيْرٍ، عَنْ أَبِيهِ قَالَ‏:‏ سَمِعْتُ يَزِيدَ بْنَ عَبْدِ اللهِ بْنِ قُسَيْطٍ قَالَ‏:‏ أَرْسَلَ عَبْدُ اللهِ بْنُ عُمَرَ غُلاَمًا لَهُ بِذَهَبٍ أَوْ بِوَرِقٍ، فَصَرَفَهُ، فَأَنْظَرَ بِالصَّرْفِ، فَرَجَعَ إِلَيْهِ فَجَلَدَهُ جَلْدًا وَجِيعًا وَقَالَ‏:‏ اذْهَبْ، فَخُذِ الَّذِي لِي، وَلاَ تَصْرِفْهُ‏.‏","english":{"narrator":"","text":"Yazid ibn 'Abdullah said, \"'Abdullah ibn 'Umar sent a slave of\nhis with some gold - or silver - and he changed it and deferred\nthe exchange (i.e. he changed gold into silver or vice versa and did not\ntake the money straightaway. This is haram.) Then he went back to Ibn 'Umar\nwho gave him a painful beating. He said, 'Go and take what is mine and\ndo not exchange it!'\""}},{"id":16,"idInBook":16,"chapterId":9,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، قَالَ‏:‏ أَخْبَرَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ التَّيْمِيِّ، عَنْ أَبِيهِ، عَنْ أَبِي مَسْعُودٍ قَالَ‏:‏ كُنْتُ أَضْرِبُ غُلاَمًا لِي، فَسَمِعْتُ مِنْ خَلْفِي صَوْتًا‏:‏ اعْلَمْ أَبَا مَسْعُودٍ، لَلَّهُ أَقْدَرُ عَلَيْكَ مِنْكَ عَلَيْهِ، فَالْتَفَتُّ فَإِذَا هُوَ رَسُولُ اللهِ صلى الله عليه وسلم، قُلْتُ‏:‏ يَا رَسُولَ اللهِ، فَهُوَ حُرٌّ لِوَجْهِ اللهِ، فَقَالَ‏:‏ أَمَا لَوْ لَمْ تَفْعَلْ لَمَسَّتْكَ النَّارُ أَوْ لَلَفَحَتْكَ النَّارُ‏.‏","english":{"narrator":"","text":"Abu Mas'ud said, \"I was beating a slave of mine when I heard a\nvoice behind me, 'Know, Abu Mas'ud, that Allah is able to call you to account\nfor this slave.' I turned around and there was the Messenger of Allah,\nmay Allah bless him and grant him peace. I said, 'Messenger of Allah, he\nis free for the sake of Allah!' He said, 'If you had not done that, the\nFire would have touched you (or the Fire would have burned you).'\""}},{"id":17,"idInBook":17,"chapterId":9,"bookId":15,"arabic":"حَدَّثَنَا حَجَّاجٌ، قَالَ‏:‏ حَدَّثَنَا ابْنُ عُيَيْنَةَ، عَنِ ابْنِ عَجْلاَنَ، عَنْ سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ لاَ تَقُولُوا‏:‏ قَبَّحَ اللَّهُ وَجْهَهُ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"Do not say, 'May Allah make your face ugly.'\""}},{"id":18,"idInBook":18,"chapterId":9,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا ابْنُ عُيَيْنَةَ، عَنِ ابْنِ عَجْلاَنَ، عَنْ سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ لاَ تَقُولَنَّ‏:‏ قَبَّحَ اللَّهُ وَجْهَكَ وَوَجْهَ مَنْ أَشْبَهَ وَجْهَكَ، فَإِنَّ اللَّهَ عَزَّ وَجَلَّ خَلَقَ آدَمَ صلى الله عليه وسلم عَلَى صُورَتِهِ‏.‏","english":{"narrator":"","text":"Abu Hurayra said, \"Do not say, 'May Allah make your face ugly and\nany face like your face.' Allah Almighty created Adam, may Allah bless\nhim and grant him peace, in the form that He ordained.\""}},{"id":19,"idInBook":19,"chapterId":9,"bookId":15,"arabic":"حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، قَالَ‏:‏ حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ قَالَ‏:‏ حَدَّثَنِي مُحَمَّدُ بْنُ عَجْلاَنَ قَالَ‏:‏ أَخْبَرَنِي أَبِي، وَسَعِيدٌ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ إِذَا ضَرَبَ أَحَدُكُمْ خَادِمَهُ فَلْيَجْتَنِبِ الْوَجْهَ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"When one of you strikes his servant, let him avoid\nhis face.\""}},{"id":20,"idInBook":20,"chapterId":9,"bookId":15,"arabic":"حَدَّثَنَا خَالِدٌ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ قَالَ‏:‏ مَرَّ النَّبِيُّ صلى الله عليه وسلم بِدَابَّةٍ قَدْ وُسِمَ يُدَخِّنُ مَنْخِرَاهُ، قَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ لَعَنَ اللَّهُ مَنْ فَعَلَ هَذَا، لاَ يَسِمَنَّ أَحَدٌ الْوَجْهَ وَلاَ يَضْرِبَنَّهُ‏.‏","english":{"narrator":"","text":"Jabir said, \"The Prophet, may Allah bless him and grant him peace,\npassed by an animal which had been branded and its nostrils were smoking.\nThe Prophet, may Allah bless him and grant him peace, said, 'Allah curses\nany person who does this. No one should mark the face nor strike it.'\""}},{"id":21,"idInBook":21,"chapterId":9,"bookId":15,"arabic":"حَدَّثَنَا آدَمُ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، قَالَ‏:‏ حَدَّثَنَا حُصَيْنٌ قَالَ‏:‏ سَمِعْتُ هِلاَلَ بْنَ يَسَافٍ يَقُولُ‏:‏ كُنَّا نَبِيعُ الْبَزَّ فِي دَارِ سُوَيْدِ بْنِ مُقَرِّنٍ، فَخَرَجَتْ جَارِيَةٌ فَقَالَتْ لِرَجُلٍ شَيْئًا، فَلَطَمَهَا ذَلِكَ الرَّجُلُ، فَقَالَ لَهُ سُوَيْدُ بْنُ مُقَرِّنٍ‏:‏ أَلَطَمْتَ وَجْهَهَا‏؟‏ لَقَدْ رَأَيْتُنِي سَابِعَ سَبْعَةٍ وَمَا لَنَا إِلاَّ خَادِمٌ، فَلَطَمَهَا بَعْضُنَا، فَأَمَرَهُ النَّبِيُّ صلى الله عليه وسلم أَنْ يُعْتِقُهَا‏.‏","english":{"narrator":"","text":"Hilal ibn Yasaf said, \"We used to sell linen in the house of Suwayd\nibn Muqarrin. A slavegirl came out and said something to one of the men\nand that man slapped her. Suwayd ibn Muqarrin asked him, 'Did you slap\nher face? We were seven and we only had a single servant. Then one of us\nslapped her and the Prophet, may Allah bless him and grant him peace, ordered\nhim to set her free.'\""}},{"id":22,"idInBook":22,"chapterId":9,"bookId":15,"arabic":"حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ، وَمُسَدَّدٌ، قَالاَ‏:‏ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ فِرَاسٍ، عَنْ أَبِي صَالِحٍ، عَنْ زَاذَانَ، عَنِ ابْنِ عُمَرَ قَالَ‏:‏ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ‏:‏ مَنْ لَطَمَ عَبْدَهُ أَوْ ضَرَبَهُ حَدًّا لَمْ يَأْتِهِ، فَكَفَّارَتُهُ عِتْقُهُ‏.‏","english":{"narrator":"","text":"Ibn 'Umar said, \"I heard the Prophet, may Allah bless him and grant\nhim peace, say, 'The expiation for someone who slaps his slave or beats\nhim more than he deserves is to set him free.'\""}},{"id":23,"idInBook":23,"chapterId":9,"bookId":15,"arabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ‏:‏ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ سُفْيَانَ قَالَ‏:‏ حَدَّثَنِي سَلَمَةُ بْنُ كُهَيْلٍ قَالَ‏:‏ حَدَّثَنِي مُعَاوِيَةُ بْنُ سُوَيْدِ بْنِ مُقَرِّنٍ قَالَ‏:‏ لَطَمْتُ مَوْلًى لَنَا فَفَرَّ، فَدَعَانِي أَبِي فَقَالَ لَهُ‏:‏ اقْتَصَّ، كُنَّا وَلَدَ مُقَرِّنٍ سَبْعَةً، لَنَا خَادِمٌ، فَلَطَمَهَا أَحَدُنَا، فَذُكِرَ ذَلِكَ لِلنَّبِيِّ صلى الله عليه وسلم فَقَالَ‏:‏ مُرْهُمْ فَلْيُعْتِقُوهَا، فَقِيلَ لِلنَّبِيِّ صلى الله عليه وسلم‏:‏ لَيْسَ لَهُمْ خَادِمٌ غَيْرَهَا، قَالَ‏:‏ فَلْيَسْتَخْدِمُوهَا فَإِذَا اسْتَغْنَوْا خَلُّوا سَبِيلَهَا‏.‏","english":{"narrator":"","text":"Mu'awiya ibn Muqarrin said, \"I slapped a mawla of mine and he fled.\nThen my father called me and said, 'I will tell you a story. We, the sons\nof Muqarrin, were seven, and we had one servant. Then one of us slapped\nher and that was mentioned to the Messenger of Allah, may Allah bless him\nand grant him peace. He said, 'Order them to set her free.' The Prophet,\nmay Allah bless him and grant him peace, was told. 'She is the only servant\nthey have.' He said, 'Then let them hire her and when they no longer need\nher, let her go on her way.'\""}},{"id":24,"idInBook":24,"chapterId":9,"bookId":15,"arabic":"حَدَّثَنَا عَمْرُو بْنُ مَرْزُوقٍ، قَالَ‏:‏ أَخْبَرَنَا شُعْبَةُ قَالَ لِي مُحَمَّدُ بْنُ الْمُنْكَدِرِ‏:‏ مَا اسْمُكَ‏؟‏ فَقُلْتُ‏:‏ شُعْبَةُ قَالَ‏:‏ حَدَّثَنِي أَبُو شُعْبَةَ، عَنْ سُوَيْدِ بْنِ مُقَرِّنٍ الْمُزَنِيِّ، وَرَأَى رَجُلاً لَطَمَ غُلاَمَهُ، فَقَالَ‏:‏ أَمَا عَلِمْتَ أَنَّ الصُّورَةَ مُحَرَّمَةٌ‏؟‏ رَأَيْتُنِي وَإِنِّي سَابِعُ سَبْعَةِ إِخْوَةٍ، عَلَى عَهْدِ رَسُولِ اللهِ صلى الله عليه وسلم، مَا لَنَا إِلاَّ خَادِمٌ، فَلَطَمَهُ أَحَدُنَا، فَأَمَرَنَا النَّبِيُّ صلى الله عليه وسلم أَنْ نُعْتِقَهُ‏.‏","english":{"narrator":"","text":"Shu'ba said, \"Muhammad ibn al-Munkadir said to me, 'What is your\nname?' I replied, 'Shu'ba.' He said, 'Abu Shu'ba related to me that when\nSuwayd ibn Muqarrin al-Muzani saw a man strike his slave, he said. 'Do\nyou not know that the face is forbidden? In the time of the Messenger of\nAllah, may Allah bless him and grant him peace, we were seven brothers\nand we only had one servant. Then one of us slapped him (sic.) and the\nProphet, may Allah bless him and grant him peace, commanded that we set\nhim free.'\""}},{"id":25,"idInBook":25,"chapterId":9,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى، قَالَ‏:‏ حَدَّثَنَا أَبُو عَوَانَةَ، قَالَ‏:‏ حَدَّثَنَا فِرَاسٌ، عَنْ أَبِي صَالِحٍ، عَنْ زَاذَانَ أَبِي عُمَرَ قَالَ‏:‏ كُنَّا عِنْدَ ابْنِ عُمَرَ، فَدَعَا بِغُلاَمٍ لَهُ كَانَ ضَرَبَهُ فَكَشَفَ عَنْ ظَهْرِهِ فَقَالَ‏:‏ أَيُوجِعُكَ‏؟‏ قَالَ‏:‏ لاَ‏.‏ فَأَعْتَقَهُ، ثُمَّ رَفَعَ عُودًا مِنَ الأَرْضِ فَقَالَ‏:‏ مَالِي فِيهِ مِنَ الأَجْرِ مَا يَزِنُ هَذَا الْعُودَ، فَقُلْتُ‏:‏ يَا أَبَا عَبْدِ الرَّحْمَنِ، لِمَ تَقُولُ هَذَا‏؟‏ قَالَ‏:‏ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ أَوْ قَالَ‏:‏ مَنْ ضَرَبَ مَمْلُوكَهُ حَدًّا لَمْ يَأْتِهِ، أَوْ لَطَمَ وَجْهَهُ، فَكَفَّارَتُهُ أَنْ يُعْتِقَهُ‏.‏","english":{"narrator":"","text":"Abu 'Umar Zadhan said, \"We were with Ibn 'Umar when he summoned\na slave of his whom he had beaten and he uncovered his back. 'Does it hurt?'\nhe asked. 'No,' he replied. Then he set him free. He picked up a stick\nfrom the ground and then said, 'I do not have a reward (for him) worth\nas much as this stick.' I asked, 'Abu 'Abdu'r-Rahman, why do you say this?'\nHe replied, 'I heard the Prophet, may Allah bless him and grant him peace,\nsay, \"The expiation of someone who beats a slave more than he deserves\nor slaps his face is that he must set him free.\"'\""}},{"id":26,"idInBook":26,"chapterId":9,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، وَقَبِيصَةُ، قَالاَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، عَنْ مَيْمُونِ بْنِ أَبِي شَبِيبٍ، عَنْ عَمَّارِ بْنِ يَاسِرٍ قَالَ‏:‏ لاَ يَضْرِبُ أَحَدٌ عَبْدًا لَهُ وَهُوَ ظَالِمٌ لَهُ إِلاَّ أُقِيدَ مِنْهُ يَوْمَ الْقِيَامَةِ‏.‏","english":{"narrator":"","text":"'Ammar ibn Yasir said, \"None of you beats his slave unjustly without\nthe slave receiving retaliation from him on the Day of Rising.\""}},{"id":27,"idInBook":27,"chapterId":9,"bookId":15,"arabic":"حَدَّثَنَا أَبُو عُمَرَ حَفْصُ بْنُ عُمَرَ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ قَالَ‏:‏ حَدَّثَنِي أَبُو جَعْفَرٍ قَالَ‏:‏ سَمِعْتُ أَبَا لَيْلَى قَالَ‏:‏ خَرَجَ سَلْمَانُ فَإِذَا عَلَفُ دَابَّتِهِ يَتَسَاقَطُ مِنَ الْآرِيِّ، فَقَالَ لِخَادِمِهِ‏:‏ لَوْلاَ أَنِّي أَخَافُ الْقِصَاصَ لَأَوْجَعْتُكَ‏.‏","english":{"narrator":"","text":"Abu Layla said, \"Salman went out and when his animal fodder fell\nfrom the manger, he told his servant, 'If it were not that I fear retaliation,\nI would make you hurt (i.e. by beating you).\""}},{"id":28,"idInBook":28,"chapterId":9,"bookId":15,"arabic":"حَدَّثَنَا أَبُو الرَّبِيعِ، قَالَ‏:‏ حَدَّثَنَا إِسْمَاعِيلُ، قَالَ‏:‏ حَدَّثَنَا الْعَلاَءُ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ لَتُؤَدُّنَّ الْحُقُوقَ إِلَى أَهْلِهَا، حَتَّى يُقَادَ لِلشَّاةِ الْجَمَّاءِ مِنَ الشَّاةِ الْقَرْنَاءِ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"Give people their rights. Even the hornless sheep\nwill take retaliation from the horned sheep.\""}},{"id":29,"idInBook":29,"chapterId":9,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ مُحَمَّدٍ الْجُعْفِيُّ، قَالَ‏:‏ حَدَّثَنَا أَبُو أُسَامَةَ قَالَ‏:‏ حَدَّثَنِي دَاوُدُ بْنُ أَبِي عَبْدِ اللهِ مَوْلَى بَنِي هَاشِمٍ قَالَ‏:‏ حَدَّثَنَي عَبْدُ الرَّحْمَنِ بْنُ مُحَمَّدٍ قَالَ‏:‏ أَخْبَرَتْنِي جَدَّتِي، عَنْ أُمِّ سَلَمَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ فِي بَيْتِهَا، فَدَعَا وَصِيفَةً لَهُ أَوْ لَهَا فَأَبْطَأَتْ، فَاسْتَبَانَ الْغَضَبُ فِي وَجْهِهِ، فَقَامَتْ أُمُّ سَلَمَةَ إِلَى الْحِجَابِ، فَوَجَدَتِ الْوَصِيفَةَ تَلْعَبُ، وَمَعَهُ سِوَاكٌ، فَقَالَ‏:‏ لَوْلاَ خَشْيَةُ الْقَوَدِ يَوْمَ الْقِيَامَةِ، لَأَوْجَعْتُكِ بِهَذَا السِّوَاكِ‏.‏","english":{"narrator":"","text":"Umm Salama reported that the Prophet, may Allah bless him and grant\nhim peace, was in his house and called for a slave of his (or hers) and\nshe was slow in coming. The anger showed in his face. Umm Salama went to\nthe curtain and found the slavegirl playing. He had a siwak-stick with\nhim and said, '\"Were it not that I fear retaliation on the Day of Rising\nwith this siwak.\""}},{"id":30,"idInBook":30,"chapterId":9,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بِلاَلٍ، قَالَ‏:‏ حَدَّثَنَا عِمْرَانُ، عَنْ قَتَادَةَ، عَنْ زُرَارَةَ بْنِ أَوْفَى، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ مَنْ ضَرَبَ ضَرْبًا اقْتُصَّ مِنْهُ يَوْمَ الْقِيَامَةِ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"On the Day of Rising, retaliation will\nbe taken from anyone who gives a beating.\""}},{"id":31,"idInBook":31,"chapterId":9,"bookId":15,"arabic":"حَدَّثَنَا خَلِيفَةُ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ اللهِ بْنُ رَجَاءٍ، قَالَ‏:‏ حَدَّثَنَا أَبُو الْعَوَّامِ، عَنْ قَتَادَةَ، عَنْ عَبْدِ اللهِ بْنِ شَقِيقٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ مَنْ ضَرَبَ ضَرْبًا ظُلْمًا اقْتُصَّ مِنْهُ يَوْمَ الْقِيَامَةِ‏.‏","english":{"narrator":"","text":"same as 185."}},{"id":32,"idInBook":32,"chapterId":9,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبَّادٍ، قَالَ‏:‏ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ، عَنْ يَعْقُوبَ بْنِ مُجَاهِدِ أَبِي حَزْرَةَ، عَنْ عُبَادَةَ بْنِ الْوَلِيدِ بْنِ عُبَادَةَ بْنِ الصَّامِتِ قَالَ‏:‏ خَرَجْتُ أَنَا وَأَبِي نَطْلُبُ الْعِلْمَ فِي هَذَا الْحَيِّ فِي الأَنْصَارِ، قَبْلَ أَنْ يَهْلِكُوا، فَكَانَ أَوَّلَ مَنْ لَقِينَا أَبُو الْيَسَرِ صَاحِبُ النَّبِيِّ صلى الله عليه وسلم وَمَعَهُ غُلاَمٌ لَهُ، وَعَلَى أَبِي الْيَسَرِ بُرْدَةٌ وَمَعَافِرِيٌّ، وَعَلَى غُلاَمِهِ بُرْدَةٌ وَمَعَافِرِيٌّ، فَقُلْتُ لَهُ‏:‏ يَا عَمِّي، لَوْ أَخَذْتَ بُرْدَةَ غُلاَمِكَ وَأَعْطَيْتَهُ مَعَافِرِيَّكَ، أَوْ أَخَذْتَ مَعَافِرِيَّهُ وَأَعْطَيْتَهُ بُرْدَتَكَ، كَانَتْ عَلَيْكَ حُلَّةٌ أَوْ عَلَيْهِ حُلَّةٌ، فَمَسَحَ رَأْسِي وَقَالَ‏:‏ اللَّهُمَّ بَارِكْ فِيهِ، يَا ابْنَ أَخِي، بَصَرُ عَيْنَيَّ هَاتَيْنِ، وَسَمْعُ أُذُنَيَّ هَاتَيْنِ، وَوَعَاهُ قَلْبِي وَأَشَارَ إِلَى نِيَاطِ قَلْبِهِ النَّبِيَّ صلى الله عليه وسلم يَقُولُ‏:‏ أَطْعِمُوهُمْ مِمَّا تَأْكُلُونَ، وَاكْسُوهُمْ مِمَّا تَلْبَسُونَ وَكَانَ أَنْ أُعْطِيَهُ مِنْ مَتَاعِ الدُّنْيَا أَهْوَنُ عَلَيَّ مِنْ أَنْ يَأْخُذَ مِنْ حَسَنَاتِي يَوْمَ الْقِيَامَةِ‏.‏","english":{"narrator":"","text":"'Ubada ibn al-Walid said, \"My father and I went out to seek knowledge\nfrom the Ansar in this area before they died. The first one we met was\nAbu'l-Yasar, the Companion of the Prophet, may Allah bless him and grant\nhim peace, who had one of his slaves with him. Abu'l-Yasar was wearing one\nstriped robe and one mu'afiri robe and his slave was also wearing one striped\nrobe and one mu'afiri robe. I said to him, 'Uncle! Why don't you take your\nslave's striped robe and give him your mu'afiri robe, or take his mu'afiri\nrobe and give him your striped robe? Then he would have a complete outfit\nand you would have a complete outfit.' He wiped his head and said, 'O Allah,\nbless him in it! Nephew, these two eyes of mine have seen and these two\nears of mine have heard and my heart has retained,' and he pointed towards\nhis heart, 'that the Prophet, may Allah bless him and grant him peace,\nsaid, \"Feed them\nfrom what you yourself eat and clothe them from the clothes\nyou yourself wear.\" It is easier for me to give him the goods of this world\nthan to have my good actions taken away from me on the Day of Rising.'\""}},{"id":33,"idInBook":33,"chapterId":9,"bookId":15,"arabic":"حَدَّثَنَا سَعِيدُ بْنُ سُلَيْمَانَ، قَالَ‏:‏ حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ، قَالَ‏:‏ حَدَّثَنَا الْفَضْلُ بْنُ مُبَشِّرٍ قَالَ‏:‏ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللهِ يَقُولُ‏:‏ كَانَ النَّبِيُّ صلى الله عليه وسلم يُوصِي بِالْمَمْلُوكِينَ خَيْرًا وَيَقُولُ‏:‏ أَطْعِمُوهُمْ مِمَّا تَأْكُلُونَ، وَأَلْبِسُوهُمْ مِنْ لَبُوسِكُمْ، وَلاَ تُعَذِّبُوا خَلْقَ اللهِ عَزَّ وَجَلَّ‏.‏","english":{"narrator":"","text":"Jabir ibn 'Abdullah said, \"The Prophet, may Allah bless him and\ngrant him peace, advised that slaves should be well-treated. He said, 'Feed\nthem from what you eat and clothe them from what you wear. Do not punish\nwhat Allah has created.'\""}},{"id":34,"idInBook":34,"chapterId":9,"bookId":15,"arabic":"حَدَّثَنَا آدَمُ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، قَالَ‏:‏ حَدَّثَنَا وَاصِلٌ الأَحْدَبُ قَالَ‏:‏ سَمِعْتُ الْمَعْرُورَ بْنَ سُوَيْدٍ يَقُولُ‏:‏ رَأَيْتُ أَبَا ذَرٍّ وَعَلَيْهِ حُلَّةٌ وَعَلَى غُلاَمِهِ حُلَّةٌ، فَسَأَلْنَاهُ عَنْ ذَلِكَ، فَقَالَ‏:‏ إِنِّي سَابَبْتُ رَجُلاً فَشَكَانِي إِلَى النَّبِيِّ صلى الله عليه وسلم، فَقَالَ لِيَ النَّبِيُّ صلى الله عليه وسلم‏:‏ أَعَيَّرْتَهُ بِأُمِّهِ‏؟‏ قُلْتُ‏:‏ نَعَمْ، ثُمَّ قَالَ‏:‏ إِنَّ إِخْوَانَكُمْ خَوَلُكُمْ، جَعَلَهُمُ اللَّهُ تَحْتَ أَيْدِيكُمْ، فَمَنْ كَانَ أَخُوهُ تَحْتَ يَدَيْهِ فَلْيُطْعِمْهُ مِمَّا يَأْكُلُ، وَلْيُلْبِسْهُ مِمَّا يَلْبَسُ، وَلاَ تُكَلِّفُوهُمْ مَا يَغْلِبُهُمْ، فَإِنْ كَلَّفْتُمُوهُمْ مَا يَغْلِبُهُمْ فَأَعِينُوهُمْ‏.‏","english":{"narrator":"","text":"Al-Ma'rur ibn Suwayd said, \"I saw Abu Dharr wearing a robe and\nhis slave was also wearing a robe. We asked him about that and he said,\n'I insulted a man and he complained about me to the Prophet, may Allah\nbless him and grant him peace, and the Prophet, may Allah bless him and\ngrant him peace, said to me, 'Did you insult him by his mother?' 'Yes,'\nI replied. He said, 'Your brothers are your property. Allah has put them\nunder your authority. If someone has his brother under his authority, he\nshould feed him from what he eats and clothe him from what he wears and\nnot burden him with anything that will be too much for him. If you burden\nhim with what will be too much for him, then help him.'\""}},{"id":35,"idInBook":35,"chapterId":9,"bookId":15,"arabic":"حَدَّثَنَا آدَمُ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، قَالَ‏:‏ حَدَّثَنَا أَبُو بِشْرٍ قَالَ‏:‏ سَمِعْتُ سَلاَّمَ بْنَ عَمْرٍو يُحَدِّثُ، عَنْ رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ قَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ أَرِقَّاكُمْ إِخْوَانُكُمْ، فَأَحْسِنُوا إِلَيْهِمْ، اسْتَعِينُوهُمْ عَلَى مَا غَلَبَكُمْ، وَأَعِينُوهُمْ عَلَى مَا غُلِبُوا‏.‏","english":{"narrator":"","text":"Sallam ibn 'Amr reported from one of the Companions of the Prophet,\nmay Allah bless him and grant him peace, said, \"Your slaves are your brothers,\nso treat him well. Ask for their help in what is too much for you and help\nthem in what is too much for them.\""}},{"id":36,"idInBook":36,"chapterId":9,"bookId":15,"arabic":"حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانَ قَالَ‏:‏ حَدَّثَنِي ابْنُ وَهْبٍ، قَالَ‏:‏ أَخْبَرَنَا عَمْرٌو، عَنْ أَبِي يُونُسَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ قَالَ‏:‏ أَعِينُوا الْعَامِلَ مِنْ عَمَلِهِ، فَإِنَّ عَامِلَ اللهِ لاَ يَخِيبُ، يَعْنِي‏:‏ الْخَادِمَ‏.‏","english":{"narrator":"","text":"Abu Hurayra said, 'Help the worker in his work. The one who works\nfor Allah will not be disappointed,\" i.e. the servant."}},{"id":37,"idInBook":37,"chapterId":9,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ يَزِيدَ، قَالَ‏:‏ حَدَّثَنَا سَعِيدُ بْنُ أَبِي أَيُّوبَ قَالَ‏:‏ حَدَّثَنِي ابْنُ عَجْلاَنَ، عَنْ بُكَيْرِ بْنِ عَبْدِ اللهِ، عَنْ عَجْلاَنَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ لِلْمَمْلُوكِ طَعَامُهُ وَكِسْوَتُهُ، وَلاَ يُكَلَّفُ مِنَ الْعَمَلِ مَا لاَ يُطِيقُ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"The slave has his food and clothing. Do not burden\na slave with work which he is incapable of doing.\""}},{"id":38,"idInBook":38,"chapterId":9,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ قَالَ‏:‏ حَدَّثَنِي اللَّيْثُ قَالَ‏:‏ حَدَّثَنِي ابْنُ عَجْلاَنَ، عَنْ بُكَيْرٍ، أَنَّ عَجْلاَنَ أَبَا مُحَمَّدٍ حَدَّثَهُ قُبَيْلَ وَفَاتِهِ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ لِلْمَمْلُوكِ طَعَامُهُ وَكِسْوَتُهُ، وَلاَ يُكَلَّفُ إِلاَّ مَا يُطِيقُ‏.‏","english":{"narrator":"","text":"Same as 192."}},{"id":39,"idInBook":39,"chapterId":9,"bookId":15,"arabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ‏:‏ حَدَّثَنَا يَحْيَى، عَنِ الأَعْمَشِ قَالَ‏:‏ قَالَ مَعْرُورٌ‏:‏ مَرَرْنَا بِأَبِي ذَرٍّ وَعَلَيْهِ ثَوْبٌ، وَعَلَى غُلاَمِهِ حُلَّةٌ، فَقُلْنَا‏:‏ لَوْ أَخَذْتَ هَذَا وَأَعْطَيْتَ هَذَا غَيْرَهُ، كَانَتْ حُلَّةٌ، قَالَ‏:‏ قَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ إِخْوَانُكُمْ جَعَلَهُمُ اللَّهُ تَحْتَ أَيْدِيكُمْ، فَمَنْ كَانَ أَخُوهُ تَحْتَ يَدِهِ، فَلْيُطْعِمْهُ مِمَّا يَأْكُلُ، وَلْيُلْبِسْهُ مِمَّا يَلْبَسُ، وَلاَ يُكَلِّفْهُ مَا يَغْلِبُهُ، فَإِنْ كَلَّفَهُ مَا يَغْلِبُهُ فَلْيُعِنْهُ عَلَيْهِ‏.‏","english":{"narrator":"","text":"Ma'rur said, \"We passed by Abu Dharr and he was wearing a garment\nand his slave had a robe on. We said, 'Why do you not take this and give\nthis man something else instead of the robe?' He replied that the Prophet,\nmay Allah bless him and grant him peace, said, 'Allah has put your brothers\nunder your authority. If someone has his brother under his authority, he\nshould feed him from what he eats and clothe him from what he wears and\nnot burden him with what will be too much for him. If he burdens him with\nwhat will be too much for him, he should help him.'\""}},{"id":40,"idInBook":40,"chapterId":9,"bookId":15,"arabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، قَالَ‏:‏ أَخْبَرَنَا بَقِيَّةُ قَالَ‏:‏ أَخْبَرَنِي بَحِيرُ بْنُ سَعْدٍ، عَنْ خَالِدِ بْنِ مَعْدَانَ، عَنِ الْمِقْدَامِ، سَمِعَ النَّبِيَّ صلى الله عليه وسلم يَقُولُ‏:‏ مَا أَطْعَمْتَ نَفْسَكَ فَهُوَ صَدَقَةٌ، وَمَا أَطْعَمْتَ وَلَدَكَ وَزَوْجَتَكَ وَخَادِمَكَ فَهُوَ صَدَقَةٌ‏.‏","english":{"narrator":"","text":"Al-Miqdam heard the Prophet, may Allah bless him and grant him\npeace, say, \"What you feed yourself is sadaqa. What you feed your\nchild, your wife and your servant is sadaqa.\""}},{"id":41,"idInBook":41,"chapterId":9,"bookId":15,"arabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ‏:‏ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَاصِمِ بْنِ بَهْدَلَةَ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ خَيْرُ الصَّدَقَةِ مَا بَقَّى غِنًى، وَالْيَدُ الْعُلْيَا خَيْرٌ مِنَ الْيَدِ السُّفْلَى، وَابْدَأْ بِمَنْ تَعُولُ، تَقُولُ امْرَأَتُكَ‏:‏ أَنْفِقْ عَلَيَّ أَوْ طَلِّقْنِي، وَيَقُولُ مَمْلُوكُكَ‏:‏ أَنْفِقْ عَلَيَّ أَوْ بِعْنِي، وَيَقُولُ وَلَدُكَ‏:‏ إِلَى مَنْ تَكِلُنَا‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"The best sadaqa is that which leaves\nyou free of want. The upper hand is better than the lower hand. Begin with\nthose you look after. Your wife says, 'Spend on me or divorce me.' Your\nslave says, 'Spend on me or sell me.' Your child asks, 'On whom can we\nrely?'\""}},{"id":42,"idInBook":42,"chapterId":9,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، قَالَ‏:‏ أَخْبَرَنَا سُفْيَانُ، عَنْ مُحَمَّدِ بْنِ عَجْلاَنَ، عَنِ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ أَمَرَ النَّبِيُّ صلى الله عليه وسلم بِصَدَقَةٍ، فَقَالَ رَجُلٌ‏:‏ عِنْدِي دِينَارٌ، قَالَ‏:‏ أَنْفِقْهُ عَلَى نَفْسِكَ، قَالَ‏:‏ عِنْدِي آخَرُ، قَالَ‏:‏ أَنْفِقْهُ عَلَى زَوْجَتِكَ قَالَ‏:‏ عِنْدِي آخَرُ، قَالَ‏:‏ أَنْفِقْهُ عَلَى خَادِمِكَ، ثُمَّ أَنْتَ أَبْصَرُ‏.‏","english":{"narrator":"","text":"Abu Hurayra said, \"The Prophet, may Allah bless him and grant him\npeace, commanded sadaqa. A man said, 'I have a dinar.' He said,\n'Spend it on yourself.' He said, 'I have another.' He said, 'Spend it on\nyour wife.' He said, 'I have another.' He said, 'Spend it on your servant\nand then on whomever you see fit.'\""}},{"id":43,"idInBook":43,"chapterId":9,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، قَالَ‏:‏ أَخْبَرَنَا مَخْلَدُ بْنُ زَيْدٍ، قَالَ‏:‏ أَخْبَرَنَا ابْنُ جُرَيْجٍ قَالَ‏:‏ أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ رَجُلاً يَسْأَلُ جَابِرًا عَنْ خَادِمِ الرَّجُلِ، إِذَا كَفَاهُ الْمَشَقَّةَ وَالْحَرَّ، أَمَرَ النَّبِيُّ صلى الله عليه وسلم أَنْ يَدْعُوهُ‏؟‏ قَالَ‏:‏ نَعَمْ، فَإِنْ كَرِهَ أَحَدُكُمْ أَنْ يَطْعَمَ مَعَهُ فَلْيُطْعِمْهُ أُكْلَةً فِي يَدِهِ‏.‏","english":{"narrator":"","text":"Ibn Jurayj related that Abu'z-Zubayr heard him ask Jabir about\nwhen a man's servant has finished his work and heat (i.e. cooking). Did\nthe Prophet, may Allah bless him and grant him peace, command that the\nservant be invited to eat? \"Yes,\" he replied. If one of you dislikes to\nhave his servant eat with him, he should give him his food by his own hand.'\""}},{"id":44,"idInBook":44,"chapterId":9,"bookId":15,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ مَسْلَمَةَ، قَالَ‏:‏ حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ، عَنِ الْفَضْلِ بْنِ مُبَشِّرٍ قَالَ‏:‏ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللهِ يَقُولُ‏:‏ كَانَ النَّبِيُّ صلى الله عليه وسلم يُوصِي بِالْمَمْلُوكِينَ خَيْرًا وَيَقُولُ‏:‏ أَطْعِمُوهُمْ مِمَّا تَأْكُلُونَ، وَأَلْبِسُوهُمْ مِنْ لَبُوسِكُمْ، وَلاَ تُعَذِّبُوا خَلْقَ اللهِ‏.‏","english":{"narrator":"","text":"Jabir ibn 'Abdullah said, \"The Messenger of Allah, may Allah bless\nhim and grant him peace, advised that slaves be well treated. He said,\n'Feed them from what you eat and clothe them from what you wear and do\nnot punish Allah's creation.'\""}},{"id":45,"idInBook":45,"chapterId":9,"bookId":15,"arabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ‏:‏ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ إِذَا جَاءَ أَحَدَكُمْ خَادِمُهُ بِطَعَامِهِ فَلْيُجْلِسْهُ، فَإِنْ لَمْ يَقْبَلْ فَلْيُنَاوِلْهُ مِنْهُ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"When one of your servants brings you food, he should\nsit with him. If you do not accept that, then you should give it to him.'\""}},{"id":46,"idInBook":46,"chapterId":9,"bookId":15,"arabic":"حَدَّثَنَا بِشْرُ بْنُ مُحَمَّدٍ، قَالَ‏:‏ أَخْبَرَنَا عَبْدُ اللهِ، قَالَ‏:‏ أَخْبَرَنَا أَبُو يُونُسَ الْبَصْرِيُّ، عَنِ ابْنِ أَبِي مُلَيْكَةَ قَالَ‏:‏ قَالَ أَبُو مَحْذُورَةَ‏:‏ كُنْتُ جَالِسًا عِنْدَ عُمَرَ رَضِيَ اللَّهُ عَنْهُ، إِذْ جَاءَ صَفْوَانُ بْنُ أُمَيَّةَ بِجَفْنَةٍ يَحْمِلُهَا نَفَرٌ فِي عَبَاءَةٍ، فَوَضَعُوهَا بَيْنَ يَدَيْ عُمَرَ، فَدَعَا عُمَرُ نَاسًا مَسَاكِينَ وَأَرِقَّاءَ مِنْ أَرِقَّاءِ النَّاسِ حَوْلَهُ، فَأَكَلُوا مَعَهُ، ثُمَّ قَالَ عِنْدَ ذَلِكَ‏:‏ فَعَلَ اللَّهُ بِقَوْمٍ، أَوْ قَالَ‏:‏ لَحَا اللَّهُ قَوْمًا يَرْغَبُونَ عَنْ أَرِقَّائِهِمْ أَنْ يَأْكُلُوا مَعَهُمْ، فَقَالَ صَفْوَانُ‏:‏ أَمَا وَاللَّهِ، مَا نَرْغَبُ عَنْهُمْ، وَلَكِنَّا نَسْتَأْثِرُ عَلَيْهِمْ، لاَ نَجْدُ وَاللَّهِ مِنَ الطَّعَامِ الطِّيبِ مَا نَأْكُلُ وَنُطْعِمُهُمْ‏.‏","english":{"narrator":"","text":"Abu Mahdhura said, \"I was sitting with 'Umar when Safwan ibn Umayya\nbrought him a bowl which some people were carrying in a robe. They set\nit down in front of 'Umar. 'Umar then invited some poor people and some\nslaves belonging to the people around him and they ate with him. Then he\naid, 'Allah will do a people - or else he said, 'Allah will curse a\npeople' - who dislike having their slaves eat with them.' Safwan said,\n'By Allah, we do not dislike them, but we prefer ourselves to them, and\nby Allah, we do not find good food which we can eat and feed it to them\nas well.'\""}},{"id":47,"idInBook":47,"chapterId":9,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ قَالَ‏:‏ حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم قَالَ‏:‏ إِنَّ الْعَبْدَ إِذَا نَصَحَ لِسَيِّدِهِ، وَأَحْسَنَ عِبَادَةَ رَبِّهِ، لَهُ أَجْرُهُ مَرَّتَيْنِ‏.‏","english":{"narrator":"","text":"'Abdullah ibn 'Umar reported that the Messenger of Allah, may Allah\nbless him and grant him peace, said, \"When the slave advises his master\nand is assiduous in the worship of his Lord, he receives a double reward.\""}},{"id":48,"idInBook":48,"chapterId":9,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، قَالَ‏:‏ أَخْبَرَنَا الْمُحَارِبِيُّ، قَالَ‏:‏ حَدَّثَنَا صَالِحُ بْنُ حَيٍّ قَالَ‏:‏ قَالَ رَجُلٌ لِعَامِرٍ الشَّعْبِيِّ‏:‏ يَا أَبَا عَمْرٍو، إِنَّا نَتَحَدَّثُ عِنْدَنَا أَنَّ الرَّجُلَ إِذَا أَعْتَقَ أُمَّ وَلَدِهِ ثُمَّ تَزَوَّجَهَا كَانَ كَالرَّاكِبِ بَدَنَتَهُ، فَقَالَ عَامِرٌ‏:‏ حَدَّثَنِي أَبُو بُرْدَةَ، عَنْ أَبِيهِ قَالَ‏:‏ قَالَ لَهُمْ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ ثَلاَثَةٌ لَهُمْ أَجْرَانِ‏:‏ رَجُلٌ مِنْ أَهْلِ الْكِتَابِ آمَنَ بِنَبِيِّهِ، وَآمَنَ بِمُحَمَّدٍ صلى الله عليه وسلم فَلَهُ أَجْرَانِ‏.‏ وَالْعَبْدُ الْمَمْلُوكُ إِذَا أَدَّى حَقَّ اللهِ وَحَقَّ مَوَالِيهِ‏.‏ وَرَجُلٌ كَانَتْ عِنْدَهُ أَمَةٌ يَطَأهَا، فَأَدَّبَهَا فَأَحْسَنَ تَأْدِيبَهَا، وَعَلَّمَهَا فَأَحْسَنَ تَعْلِيمَهَا، ثُمَّ أَعْتَقَهَا فَتَزَوَّجَهَا، فَلَهُ أَجْرَانِ قَالَ عَامِرٌ‏:‏ أَعْطَيْنَاكَهَا بِغَيْرِ شَيْءٍ، وَقَدْ كَانَ يَرْكَبُ فِيمَا دُونَهَا إِلَى الْمَدِينَةِ‏.‏","english":{"narrator":"Salih ibn Hayy reported that a man said to 'Amir ash-Shu'bi, \"Abu\n'Amr! We say that when a man frees his umm walad and then marries her,\nhe is like the one who rides his camel.\" 'Amir said, \"Abu Burda related\nto me from his father that the Messenger of Allah, may Allah bless him\nand grant him peace, said to them:","text":"'Three have a double reward: one of\nthe People of the Book who believes in his Prophet and then believes in\nMuhammad has two rewards. When a slave carries out the due of Allah and\nthe due of his master, he has a double reward. And (the third is) a man\nwho has a slavegirl with whom he has intercourse and teaches her well and\ninstructs her well and then sets her free and marries her. He has two rewards.'\""}},{"id":49,"idInBook":49,"chapterId":9,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، قَالَ‏:‏ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدِ بْنِ عَبْدِ اللهِ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ الْمَمْلُوكُ الَّذِي يُحْسِنُ عِبَادَةَ رَبِّهِ، وَيُؤَدِّي إِلَى سَيِّدِهِ الَّذِي فُرِضَ، الطَّاعَةُ وَالنَّصِيحَةُ، لَهُ أَجْرَانِ‏.‏","english":{"narrator":"","text":"Abu Musa reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"The slave who is excellent in the worship\nof his Lord and fulfils the duties of obedience and counsel which he owes\nto his master, has two rewards.\""}},{"id":50,"idInBook":50,"chapterId":9,"bookId":15,"arabic":"حَدَّثَنَا مُوسَى، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْوَاحِدِ، قَالَ‏:‏ حَدَّثَنَا أَبُو بُرْدَةَ بْنُ عَبْدِ اللهِ بْنِ أَبِي بُرْدَةَ قَالَ‏:‏ سَمِعْتُ أَبَا بُرْدَةَ يُحَدِّثُ، عَنْ أَبِيهِ قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ الْمَمْلُوكُ لَهُ أَجْرَانِ إِذَا أَدَّى حَقَّ اللهِ فِي عِبَادَتِهِ، أَوْ قَالَ‏:‏ فِي حُسْنِ عِبَادَتِهِ، وَحَقَّ مَلِيكِهِ الَّذِي يَمْلِكُهُ‏.‏","english":{"narrator":"","text":"Abu Burda reported from his father that the Messenger of Allah,\nmay Allah bless him and grant him peace, said, \"The slave has two rewards\nwhen he carries out Allah's due in worship (or he said that he is excellent\nin his worship) and the right of his owner who owns him.\""}},{"id":51,"idInBook":51,"chapterId":9,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ قَالَ‏:‏ حَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ اللهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم قَالَ‏:‏ كُلُّكُمْ رَاعٍ، وَكُلُّكُمْ مَسْؤولٌ عَنْ رَعِيَّتِهِ، فَالأَمِيرُ الَّذِي عَلَى النَّاسِ رَاعٍ، وَهُوَ مَسْؤولٌ عَنْ رَعِيَّتِهِ، وَالرَّجُلُ رَاعٍ عَلَى أَهْلِ بَيْتِهِ، وَهُوَ مَسْؤُولٌ عَنْ رَعِيَّتِهِ، وَعَبْدُ الرَّجُلِ رَاعٍ عَلَى مَالِ سَيِّدِهِ، وَهُوَ مَسْؤُولٌ عَنْهُ، أَلاَ كُلُّكُمْ رَاعٍ، وَكُلُّكُمْ مَسْؤُولٌ عَنْ رَعِيَّتِهِ‏.‏","english":{"narrator":"","text":"Ibn 'Umar reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"All of you are shepherds and each of you\nis responsible for his flock. The amir of a people is a shepherd and he\nis responsible for his flock. A man is the shepherd of the people of his\nhouse and he is responsible for his flock. A man's slave is the shepherd\nof his master's property and he is responsible for it. Each of you is a\nshepherd and each of you is responsible for his flock.\""}},{"id":52,"idInBook":52,"chapterId":9,"bookId":15,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ عِيسَى، قَالَ‏:‏ حَدَّثَنَا عَبْدُ اللهِ بْنُ وَهْبٍ قَالَ‏:‏ أَخْبَرَنِي مَخْرَمَةُ بْنُ بُكَيْرٍ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللهِ بْنِ سَعْدٍ مَوْلَى عَائِشَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم، قَالَ‏:‏ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُ‏:‏ الْعَبْدُ إِذَا أَطَاعَ سَيِّدَهُ، فَقَدْ أَطَاعَ اللَّهَ عَزَّ وَجَلَّ، فَإِذَا عَصَى سَيِّدَهُ فَقَدْ عَصَى اللَّهَ عَزَّ وَجَلَّ‏.‏","english":{"narrator":"","text":"Abu Hurayra said, \"When a slave obeys his master, he has obeyed\nAllah Almighty. When he rebels against his master, he rebels against Allah\nAlmighty.\""}},{"id":53,"idInBook":53,"chapterId":9,"bookId":15,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ قَالَ‏:‏ حَدَّثَنِي سُلَيْمَانُ بْنُ بِلاَلٍ، عَنْ يُونُسَ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم قَالَ‏:‏ الْعَبْدُ الْمُسْلِمُ إِذَا أَدَّى حَقَّ اللهِ وَحَقَّ سَيِّدِهِ، لَهُ أَجْرَانِ، وَالَّذِي نَفْسُ أَبِي هُرَيْرَةَ بِيَدِهِ، لَوْلاَ الْجِهَادُ فِي سَبِيلِ اللهِ، وَالْحَجُّ، وَبِرُّ أُمِّي، لَأَحْبَبْتُ أَنْ أَمُوتَ مَمْلُوكًا‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"When the Muslim slave performs the due\nof Allah and the due of his master, he will have two rewards.\""}},{"id":54,"idInBook":54,"chapterId":9,"bookId":15,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدِ اللهِ قَالَ‏:‏ حَدَّثَنِي ابْنُ أَبِي حَازِمٍ، عَنِ الْعَلاَءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ لاَ يَقُلْ أَحَدُكُمْ‏:‏ عَبْدِي، أَمَتِي، كُلُّكُمْ عَبِيدُ اللهِ، وَكُلُّ نِسَائِكُمْ إِمَاءُ اللهِ، وَلْيَقُلْ‏:‏ غُلاَمِي، جَارِيَتِي، وَفَتَايَ، وَفَتَاتِي‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"None of you should say, 'My slave ('abdi)'\nor 'my slavegirl (amati)' All of you are slaves of Allah and all\nof your women are slaves of Allah. Rather you should say, 'My boy (ghulami)',\nmy slavegirl (jariyyati)', 'my lad (fatayi)' or 'my girl\n(fatati).'\""}},{"id":55,"idInBook":55,"chapterId":9,"bookId":15,"arabic":"حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ، قَالَ‏:‏ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ أَيُّوبَ، وَحَبِيبٍ، وَهِشَامٍ، عَنْ مُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ‏:‏ لاَ يَقُولَنَّ أَحَدُكُمْ‏:‏ عَبْدِي وَأَمَتِي، وَلاَ يَقُولَنَّ الْمَمْلُوكُ‏:‏ رَبِّي وَرَبَّتِي، وَلْيَقُلْ‏:‏ فَتَايَ وَفَتَاتِي، وَسَيِّدِي وَسَيِّدَتِي، كُلُّكُمْ مَمْلُوكُونَ، وَالرَّبُّ اللَّهُ عَزَّ وَجَلَّ‏.‏","english":{"narrator":"","text":"Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"None of you should say 'my slave ('abdi\nor\namati)' and a slave should not say, 'my lord (rabbi or\nrabbati)'.\nThey should say, 'my boy' or 'my girl' (fatayi and\nfatati)\nand 'my master' or 'mistress' (sayyidi and\nsayyidati)'. All\nof you are slaves, and the Lord is Allah, Almighty and Exalted.\""}},{"id":56,"idInBook":56,"chapterId":9,"bookId":15,"arabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ‏:‏ حَدَّثَنَا بِشْرُ بْنُ الْفَضْلِ، قَالَ‏:‏ حَدَّثَنَا أَبُو مَسْلَمَةَ، عَنْ أَبِي نَضْرَةَ، عَنْ مُطَرِّفٍ قَالَ‏:‏ قَالَ أَبِي‏:‏ انْطَلَقْتُ فِي وَفْدِ بَنِي عَامِرٍ إِلَى النَّبِيِّ صلى الله عليه وسلم، فَقَالُوا‏:‏ أَنْتَ سَيِّدُنَا، قَالَ‏:‏ السَّيِّدُ اللَّهُ، قَالُوا‏:‏ وَأَفْضَلُنَا فَضْلاً، وَأَعْظَمُنَا طَوْلاً، قَالَ‏:‏ فَقَالَ‏:‏ قُولُوا بِقَوْلِكُمْ، وَلاَ يَسْتَجْرِيَنَّكُمُ الشَّيْطَانُ‏.‏","english":{"narrator":"","text":"Mutarrif reported that his father said, \"I went in the delegation\nof the Banu 'Amir to the Prophet, may Allah bless him and grant him peace.\nThey said, 'You are our master.' He said, 'The Master is Allah.' They said,\n'The best of us in excellence and the greatest of us in generosity.' He\nsaid, 'Say what you like, but do not let Shaytan provoke you.'\""}}],"chapter":{"id":9,"bookId":15,"arabic":"كتاب الملكة","english":"Being a master"}}