{"metadata":{"length":62,"arabic":{"title":"صحيح مسلم","author":"الإمام مسلم بن الحجاج القشيري النيسابوري","introduction":"كتاب الأضاحى"},"english":{"title":"Sahih Muslim","author":"Imam Muslim ibn al-Hajjaj al-Naysaburi","introduction":"The Book of Sacrifices"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":35,"bookId":2,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا الأَسْوَدُ بْنُ قَيْسٍ، ح وَحَدَّثَنَاهُ يَحْيَى،\n بْنُ يَحْيَى أَخْبَرَنَا أَبُو خَيْثَمَةَ، عَنِ الأَسْوَدِ بْنِ قَيْسٍ، حَدَّثَنِي جُنْدَبُ بْنُ سُفْيَانَ، قَالَ شَهِدْتُ\n الأَضْحَى مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَلَمْ يَعْدُ أَنْ صَلَّى وَفَرَغَ مِنْ صَلاَتِهِ سَلَّمَ فَإِذَا\n هُوَ يَرَى لَحْمَ أَضَاحِيَّ قَدْ ذُبِحَتْ قَبْلَ أَنْ يَفْرُغَ مِنْ صَلاَتِهِ فَقَالَ ‏\n\"‏ مَنْ كَانَ ذَبَحَ أُضْحِيَّتَهُ\n قَبْلَ أَنْ يُصَلِّيَ - أَوْ نُصَلِّيَ - فَلْيَذْبَحْ مَكَانَهَا أُخْرَى وَمَنْ كَانَ لَمْ يَذْبَحْ فَلْيَذْبَحْ بِاسْمِ اللَّهِ\n ‏\"‏ ‏.‏","english":{"narrator":"Jundab b. Sufyan reported:","text":"I was with Allah's Messenger (ﷺ) on the day of 'Id al-Adha. While he had not returned after having offered (the Id prayer) and finished it, he saw the flesh of the sacrificial animals which had been slaughtered before he had completed the prayer. Thereupon he (the Holy Prophet) said: One who slaughtered his sacrificial animal before his prayer or our prayer ('Id), he should slaughter another one in its stead, and he who did not slaughter, he should slaughter by reciting the name of Allah."}},{"id":2,"idInBook":2,"chapterId":35,"bookId":2,"arabic":"وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو الأَحْوَصِ، سَلاَّمُ بْنُ سُلَيْمٍ عَنِ الأَسْوَدِ،\n بْنِ قَيْسٍ عَنْ جُنْدَبِ بْنِ سُفْيَانَ، قَالَ شَهِدْتُ الأَضْحَى مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم\n فَلَمَّا قَضَى صَلاَتَهُ بِالنَّاسِ نَظَرَ إِلَى غَنَمٍ قَدْ ذُبِحَتْ فَقَالَ ‏\n\"‏ مَنْ ذَبَحَ قَبْلَ الصَّلاَةِ فَلْيَذْبَحْ\n شَاةً مَكَانَهَا وَمَنْ لَمْ يَكُنْ ذَبَحَ فَلْيَذْبَحْ عَلَى اسْمِ اللَّهِ ‏\"‏ ‏.‏","english":{"narrator":"Jundab b. Sufyan reported:","text":"I was with Allah's Messenger (ﷺ) (on the occasion) of 'Id al-Adha. After he had completed the prayer with people, he found that the goats had been slaughtered, whereupon he said: He who slaughtered sacrificial animal before the prayer should slaughter a goat (again) in its stead and he who has not slaughtered he should slaughter it by reciting the name of Allah."}},{"id":3,"idInBook":3,"chapterId":35,"bookId":2,"arabic":"وَحَدَّثَنَاهُ قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا أَبُو عَوَانَةَ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَابْنُ،\n أَبِي عُمَرَ عَنِ ابْنِ عُيَيْنَةَ، كِلاَهُمَا عَنِ الأَسْوَدِ بْنِ قَيْسٍ، بِهَذَا الإِسْنَادِ وَقَالاَ عَلَى اسْمِ اللَّهِ\n ‏.‏ كَحَدِيثِ أَبِي الأَحْوَصِ ‏.‏","english":{"narrator":"","text":"This hadith has been narrated on the authority of al-Aswad b. Qais with the same chain of transmitters."}},{"id":4,"idInBook":4,"chapterId":35,"bookId":2,"arabic":"حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنِ الأَسْوَدِ، سَمِعَ جُنْدَبًا الْبَجَلِيَّ،\n قَالَ شَهِدْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم صَلَّى يَوْمَ أَضْحًى ثُمَّ خَطَبَ فَقَالَ ‏\n\"‏ مَنْ كَانَ\n ذَبَحَ قَبْلَ أَنْ يُصَلِّيَ فَلْيُعِدْ مَكَانَهَا وَمَنْ لَمْ يَكُنْ ذَبَحَ فَلْيَذْبَحْ بِاسْمِ اللَّهِ ‏\"‏ ‏.‏","english":{"narrator":"Jundab al-Bajali reported:","text":"I saw Allah's Messenger (ﷺ) observing ('Id) prayer on the Day of Sacrifice (10th of Dhu'l-Hijja) and then delivering a sermon and he said: He who sacrificed the (animal) before offering ('Id) prayer, he should offer again in its stead, and he who did not sacrifice the animal should slaughter it by reciting the name of Allah."}},{"id":5,"idInBook":5,"chapterId":35,"bookId":2,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، بِهَذَا\n الإِسْنَادِ مِثْلَهُ ‏.‏","english":{"narrator":"","text":"This hadith has been narrated on the authority of Shu'ba through another chain of transmitters."}},{"id":6,"idInBook":6,"chapterId":35,"bookId":2,"arabic":"وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ، عَنْ مُطَرِّفٍ، عَنْ عَامِرٍ، عَنِ \n الْبَرَاءِ، قَالَ ضَحَّى خَالِي أَبُو بُرْدَةَ قَبْلَ الصَّلاَةِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏\n تِلْكَ شَاةُ لَحْمٍ ‏\"‏ ‏.‏ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ عِنْدِي جَذَعَةً مِنَ الْمَعْزِ فَقَالَ ‏\"‏ ضَحِّ بِهَا وَلاَ\n تَصْلُحُ لِغَيْرِكَ ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ مَنْ ضَحَّى قَبْلَ الصَّلاَةِ فَإِنَّمَا ذَبَحَ لِنَفْسِهِ وَمَنْ ذَبَحَ بَعْدَ الصَّلاَةِ\n فَقَدْ تَمَّ نُسُكُهُ وَأَصَابَ سُنَّةَ الْمُسْلِمِينَ ‏\"‏ ‏.‏","english":{"narrator":"Al-Bara' reported:","text":"My maternal uncle Abu Burda sacrificed his animal before ('Id) prayer. Thereupon Allah's Messenger (ﷺ) said: That is a goat (slaughtered for the sake of) flesh (and not as a sacrifice on the day of Adha). He said: I have a lamb of six months. Thereupon he said: Offer it as a sacrifice, but it will not justify for anyone except you, and then said: He who sacrificed (the animal) before ('Id) prayer, he in fact slaughtered it for his own self, and he who slaughtered after prayer, his ritual of sacrifice became complete and he in fact observed the religious practice of the Muslims."}},{"id":7,"idInBook":7,"chapterId":35,"bookId":2,"arabic":"حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا هُشَيْمٌ، عَنْ دَاوُدَ، عَنِ الشَّعْبِيِّ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ،\n أَنَّ خَالَهُ أَبَا بُرْدَةَ بْنَ نِيَارٍ، ذَبَحَ قَبْلَ أَنْ يَذْبَحَ النَّبِيُّ، صلى الله عليه وسلم فَقَالَ يَا رَسُولَ\n اللَّهِ إِنَّ هَذَا يَوْمٌ اللَّحْمُ فِيهِ مَكْرُوهٌ وَإِنِّي عَجَّلْتُ نَسِيكَتِي لأُطْعِمَ أَهْلِي وَجِيرَانِي وَأَهْلَ دَارِي\n ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَعِدْ نُسُكًا ‏\"‏ ‏.‏ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ عِنْدِي\n عَنَاقَ لَبَنٍ هِيَ خَيْرٌ مِنْ شَاتَىْ لَحْمٍ ‏.‏ فَقَالَ ‏\"‏ هِيَ خَيْرُ نَسِيكَتَيْكَ وَلاَ تَجْزِي جَذَعَةٌ عَنْ\n أَحَدٍ بَعْدَكَ ‏\"‏ ‏.‏","english":{"narrator":"Al-Bara' b. 'Azib reported that his maternal'uncle Abu Burda b. Niyar sacrificed his animal earlier than the Prophet (ﷺ) had sacrificed. Thereupon he said:","text":"Apostle of Allah, it is the day of meat and it is not desirable (to have longing for it and not to make use of it immediately), so I hastened in offering my animal as a sacrifice, so that I might feed my family and neighbours and my kith and kin. Thereupon Allah's Messenger (ﷺ) said: Offer again your sacrifice. He said: Messenger of Allah, I have a small milch goat of less than one year, and that is better than two dry goats (from which only) meat (can be acquired). Thereupon he said: That is better than the two animals of sacrifice on your behalf, and the sacrifice of a goat, of less than six months shall not be accepted as a sacrifice on behalf of anyone after your (sacrifice)."}},{"id":8,"idInBook":8,"chapterId":35,"bookId":2,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ دَاوُدَ، عَنِ الشَّعْبِيِّ، عَنِ الْبَرَاءِ،\n بْنِ عَازِبٍ قَالَ خَطَبَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمَ النَّحْرِ فَقَالَ ‏\n\"‏ لاَ يَذْبَحَنَّ أَحَدٌ\n حَتَّى يُصَلِّيَ ‏\"‏ ‏.‏ قَالَ فَقَالَ خَالِي يَا رَسُولَ اللَّهِ إِنَّ هَذَا يَوْمٌ اللَّحْمُ فِيهِ مَكْرُوهٌ ‏.‏ ثُمَّ ذَكَرَ\n بِمَعْنَى حَدِيثِ هُشَيْمٍ ‏.‏","english":{"narrator":"Al-Bara' b. 'Azib reported:","text":"Allah's Messenger (ﷺ) delivered an address on the day (of Nahr) in which he said: None of you should offer sacrifice of animals until he has completed the ('Id) prayer. Thereupon my maternal uncle said: Messenger of Allah, it is the day of meat, so it is not desirable (to keep my family in the state of longing). The rest of the hadith is the same."}},{"id":9,"idInBook":9,"chapterId":35,"bookId":2,"arabic":"وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا \n أَبِي، حَدَّثَنَا زَكَرِيَّاءُ، عَنْ فِرَاسٍ، عَنْ عَامِرٍ، عَنِ الْبَرَاءِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه\n وسلم ‏\"‏ مَنْ صَلَّى صَلاَتَنَا وَوَجَّهَ قِبْلَتَنَا وَنَسَكَ نُسُكَنَا فَلاَ يَذْبَحْ حَتَّى يُصَلِّيَ ‏\"‏ ‏.‏ فَقَالَ خَالِي\n يَا رَسُولَ اللَّهِ قَدْ نَسَكْتُ عَنِ ابْنٍ لِي ‏.‏ فَقَالَ ‏\"‏ ذَاكَ شَىْءٌ عَجَّلْتَهُ لأَهْلِكَ ‏\"‏ ‏.‏ فَقَالَ إِنَّ عِنْدِي\n شَاةً خَيْرٌ مِنْ شَاتَيْنِ قَالَ ‏\"‏ ضَحِّ بِهَا فَإِنَّهَا خَيْرُ نَسِيكَةٍ ‏\"‏ ‏.‏","english":{"narrator":"Al-Bara' reported Allah's Messenger (ﷺ) having said:","text":"He who observes prayer like our prayer and turns his face towards our Qibla (in prayer) and who offers sacrifices (of animals) as we do, he must not slaughter the (animal as a sacrifice) until he has completed the prayer. Thereupon my maternal uncle said: Messenger of Allah, I have sacrificed the animal on behalf of my son. The Messenger of Allah (ﷺ) said: This is the thing in which you have made haste for your family. He said: I have a goat with me better than two goats. Thereupon he said: Sacrifice it for that is the best."}},{"id":10,"idInBook":10,"chapterId":35,"bookId":2,"arabic":"وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ - وَاللَّفْظُ لاِبْنِ الْمُثَنَّى - قَالاَ حَدَّثَنَا مُحَمَّدُ،\n بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ، عَنْ زُبَيْدٍ الإِيَامِيِّ، عَنِ الشَّعْبِيِّ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، قَالَ قَالَ رَسُولُ\n اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ أَوَّلَ مَا نَبْدَأُ بِهِ فِي يَوْمِنَا هَذَا نُصَلِّي ثُمَّ نَرْجِعُ فَنَنْحَرُ فَمَنْ\n فَعَلَ ذَلِكَ فَقَدْ أَصَابَ سُنَّتَنَا وَمَنْ ذَبَحَ فَإِنَّمَا هُوَ لَحْمٌ قَدَّمَهُ لأَهْلِهِ لَيْسَ مِنَ النُّسُكِ فِي شَىْءٍ\n ‏\"‏ ‏.‏ وَكَانَ أَبُو بُرْدَةَ بْنُ نِيَارٍ قَدْ ذَبَحَ فَقَالَ عِنْدِي جَذَعَةٌ خَيْرٌ مِنْ مُسِنَّةٍ فَقَالَ ‏\"‏ اذْبَحْهَا\n وَلَنْ تَجْزِيَ عَنْ أَحَدٍ بَعْدَكَ ‏\"‏ ‏.‏","english":{"narrator":"Al-Bara' b. 'Azib reported Allah's Messenger (ﷺ) having said:","text":"The first (act) with which we started our day (the day of 'Id-ul Adha) was that we offered prayer. We then returned and sacrificed the animals and he who did that in fact adhered to our Sunnah (practice). And he who slaughtered the (animal on that day before the 'Id prayer), for him (the slaughtering of animal was directed to the acquiring of) meat for his family, and there is nothing of the sort of sacrifice in it. It was Abu Burda b. Niyar who had slaughtered (the animal before the 'Id prayer). He said: I have a small lamb, of less than one year, but better than that of more than a year. Thereupon Allah's Messenger (ﷺ) qaid: Sacrifice it, but it will not suffice (as a sacrifice) for anyone after you."}},{"id":11,"idInBook":11,"chapterId":35,"bookId":2,"arabic":"حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ زُبَيْدٍ، سَمِعَ الشَّعْبِيَّ، عَنِ \n الْبَرَاءِ بْنِ عَازِبٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم مِثْلَهُ ‏.‏","english":{"narrator":"","text":"A hadith like this has been narrated on the authority of al-Bara' b. 'Azib through another chain of transmitters."}},{"id":12,"idInBook":12,"chapterId":35,"bookId":2,"arabic":"وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَهَنَّادُ بْنُ السَّرِيِّ، قَالاَ حَدَّثَنَا أَبُو الأَحْوَصِ، ح وَحَدَّثَنَا \n عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، جَمِيعًا عَنْ جَرِيرٍ، كِلاَهُمَا عَنْ مَنْصُورٍ، عَنِ الشَّعْبِيِّ،\n عَنِ الْبَرَاءِ بْنِ عَازِبٍ، قَالَ خَطَبَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم فِي يَوْمِ النَّحْرِ بَعْدَ الصَّلاَةِ\n ‏.‏ ثُمَّ ذَكَرَ نَحْوَ حَدِيثِهِمْ ‏.‏","english":{"narrator":"al-Bara' b. 'Azib reported:","text":"Allah's Messenger (ﷺ) addressed us on the day of Nahr after the ('Id) prayer. The rest of the hadith is the same."}},{"id":13,"idInBook":13,"chapterId":35,"bookId":2,"arabic":"وَحَدَّثَنِي أَحْمَدُ بْنُ سَعِيدِ بْنِ صَخْرٍ الدَّارِمِيُّ، حَدَّثَنَا أَبُو النُّعْمَانِ، عَارِمُ بْنُ الْفَضْلِ\n حَدَّثَنَا عَبْدُ الْوَاحِدِ، - يَعْنِي ابْنَ زِيَادٍ - حَدَّثَنَا عَاصِمٌ الأَحْوَلُ، عَنِ الشَّعْبِيِّ، حَدَّثَنِي الْبَرَاءُ،\n بْنُ عَازِبٍ قَالَ خَطَبَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم فِي يَوْمِ نَحْرٍ فَقَالَ ‏\"‏ لاَ يُضَحِّيَنَّ\n أَحَدٌ حَتَّى يُصَلِّيَ ‏\"‏ ‏.‏ قَالَ رَجُلٌ عِنْدِي عَنَاقُ لَبَنٍ هِيَ خَيْرٌ مِنْ شَاتَىْ لَحْمٍ قَالَ ‏\"‏ فَضَحِّ\n بِهَا وَلاَ تَجْزِي جَذَعَةٌ عَنْ أَحَدٍ بَعْدَكَ ‏\"‏ ‏.‏","english":{"narrator":"Al-Bara' b. 'Azib reported:","text":"Allah's Messenger (ﷺ) addressed us on the day of Nahr and said: None should sacrifice the animal unless he has completed the ('Id) prayer. A person said: I have a milch goat of less than one year, better than two fat goats. Thereupon he said: Sacrifice it, and no goat of less than a year of age will be accepted as sacrifice after you."}},{"id":14,"idInBook":14,"chapterId":35,"bookId":2,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدٌ، - يَعْنِي ابْنَ جَعْفَرٍ - حَدَّثَنَا شُعْبَةُ، عَنْ سَلَمَةَ،\n عَنْ أَبِي جُحَيْفَةَ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، قَالَ ذَبَحَ أَبُو بُرْدَةَ قَبْلَ الصَّلاَةِ فَقَالَ النَّبِيُّ صلى\n الله عليه وسلم ‏\"‏ أَبْدِلْهَا ‏\"‏ ‏.‏ فَقَالَ يَا رَسُولَ اللَّهِ لَيْسَ عِنْدِي إِلاَّ جَذَعَةٌ - قَالَ شُعْبَةُ\n وَأَظُنُّهُ قَالَ - وَهِيَ خَيْرٌ مِنْ مُسِنَّةٍ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اجْعَلْهَا مَكَانَهَا\n وَلَنْ تَجْزِيَ عَنْ أَحَدٍ بَعْدَكَ ‏\"‏ ‏.‏","english":{"narrator":"Al-Bara' b. 'Azib reported that Abu Burda slaughtered the animal as a sacrifice before the ('Id) prayer. Thereupon Allah's Apostle (ﷺ) said:","text":"Offer a substitute for it (since it does not absolve you of the responsibility of sacrifice). Thereupon he said: Allah's Messenger. I have nothing with me but a goat of less than six months. Shu'ba (one of the narrators) said: I think he (al-Bara' b. 'Azib also) said: And it is better than a goat of one year. Thereupon Allah's Messenger (ﷺ) said: Make it a substitute for that (and sacrifice it), but it will not suffice for anyone (as a sacrifice) after you."}},{"id":15,"idInBook":15,"chapterId":35,"bookId":2,"arabic":"وَحَدَّثَنَاهُ ابْنُ الْمُثَنَّى، حَدَّثَنِي وَهْبُ بْنُ جَرِيرٍ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا \n أَبُو عَامِرٍ الْعَقَدِيُّ، حَدَّثَنَا شُعْبَةُ، بِهَذَا الإِسْنَادِ ‏.‏ وَلَمْ يَذْكُرِ الشَّكَّ فِي قَوْلِهِ هِيَ خَيْرٌ مِنْ مُسِنَّةٍ\n ‏.‏","english":{"narrator":"","text":"This hadith has been narrated on the authority of Shu'ba with the same chain of transmitters, but did not mention tht doubt (expressed in his statement) That is (the goat of less than a year) is better than a goat of more than one year."}},{"id":16,"idInBook":16,"chapterId":35,"bookId":2,"arabic":"وَحَدَّثَنِي يَحْيَى بْنُ أَيُّوبَ، وَعَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، جَمِيعًا عَنِ ابْنِ عُلَيَّةَ،\n - وَاللَّفْظُ لِعَمْرٍو - قَالَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، عَنْ أَنَسٍ، قَالَ\n قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمَ النَّحْرِ ‏\n\"‏ مَنْ كَانَ ذَبَحَ قَبْلَ الصَّلاَةِ فَلْيُعِدْ ‏\"‏ ‏.‏\n فَقَامَ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ هَذَا يَوْمٌ يُشْتَهَى فِيهِ اللَّحْمُ ‏.‏ وَذَكَرَ هَنَةً مِنْ جِيرَانِهِ كَأَنَّ\n رَسُولَ اللَّهِ صلى الله عليه وسلم صَدَّقَهُ قَالَ وَعِنْدِي جَذَعَةٌ هِيَ أَحَبُّ إِلَىَّ مِنْ شَاتَىْ لَحْمٍ\n أَفَأَذْبَحُهَا قَالَ فَرَخَّصَ لَهُ فَقَالَ لاَ أَدْرِي أَبَلَغَتْ رُخْصَتُهُ مَنْ سِوَاهُ أَمْ لاَ قَالَ وَانْكَفَأَ رَسُولُ\n اللَّهِ صلى الله عليه وسلم إِلَى كَبْشَيْنِ فَذَبَحَهُمَا فَقَامَ النَّاسُ إِلَى غُنَيْمَةٍ فَتَوَزَّعُوهَا ‏.‏ أَوْ\n قَالَ فَتَجَزَّعُوهَا ‏.‏","english":{"narrator":"Anas (b. Malik) reported Allah's Messenger (ﷺ) having said on the day of Nahr (Sacrifice):","text":"He who slaughtered (the animal as a sacrifice) before the ('Id) prayer. should repeat it (i. e. offer another animal). Thereupon a person stood up and said: Messenger of Allah, that is the day when meat is much desired, and he also made a mention of the need of his neighbour, and perhaps Allah's Messenger (ﷺ) attested it. He (the person who had sacrificed the animal before the 'Id prayer) said: I have a goat of less than one year of age with me and I like it more than two fleshy goats; should I offer it as a sacrifice? He permitted him to do so. He (the narrator) said: I do not know whether this permission was granted to anyone else besides him or not. Allah's Messenger (ﷺ) then turned towards two rams. and he slaughtered them, and the people' came to the goats and got them distributed amongst themselves (for offering them as sacrifice)."}},{"id":17,"idInBook":17,"chapterId":35,"bookId":2,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ الْغُبَرِيُّ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، حَدَّثَنَا أَيُّوبُ، وَهِشَامٌ، عَنْ مُحَمَّدٍ،\n عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم صَلَّى ثُمَّ خَطَبَ فَأَمَرَ مَنْ كَانَ ذَبَحَ\n قَبْلَ الصَّلاَةِ أَنْ يُعِيدَ ذِبْحًا ثُمَّ ذَكَرَ بِمِثْلِ حَدِيثِ ابْنِ عُلَيَّةَ ‏.‏","english":{"narrator":"Anas b. Malik reported that Allah's Messenger (ﷺ) offered the 'Id prayer and then delivered the sermon giving the command:","text":"He who slaughtered the animal before prayer should slaughter (another animal as a sacrifice). The rest of the hadith is the same."}},{"id":18,"idInBook":18,"chapterId":35,"bookId":2,"arabic":"وَحَدَّثَنِي زِيَادُ بْنُ يَحْيَى الْحَسَّانِيُّ، حَدَّثَنَا حَاتِمٌ، - يَعْنِي ابْنَ وَرْدَانَ - حَدَّثَنَا أَيُّوبُ،\n عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ خَطَبَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمَ\n أَضْحًى - قَالَ - فَوَجَدَ رِيحَ لَحْمٍ فَنَهَاهُمْ أَنْ يَذْبَحُوا قَالَ ‏\n\"‏ مَنْ كَانَ ضَحَّى فَلْيُعِدْ ‏\"‏ ‏.‏\n ثُمَّ ذَكَرَ بِمِثْلِ حَدِيثِهِمَا ‏.‏","english":{"narrator":"Anas b. Malik reported:","text":"Allah's Messenger (ﷺ) addressed us on the day of 'Id al-Adha. He smelt the odour of flesh and he prohibited thern from slaughtering (the animals before the 'Id prayer), saying: He who slaughtered the animals (before the 'Id prayer) should do that again (as it is not valid as a sacrifice)."}},{"id":19,"idInBook":19,"chapterId":35,"bookId":2,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا أَبُو الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ قَالَ رَسُولُ\n اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ تَذْبَحُوا إِلاَّ مُسِنَّةً إِلاَّ أَنْ يَعْسُرَ عَلَيْكُمْ فَتَذْبَحُوا جَذَعَةً مِنَ\n الضَّأْنِ ‏\"‏ ‏.‏","english":{"narrator":"Jabir reported Allah's Messenger (ﷺ) as saying:","text":"Sacrifice only a grown-up animal, unless it is difficult for you, in which case sacrifice a ram (of even less than a year, but more than six months' age)."}},{"id":20,"idInBook":20,"chapterId":35,"bookId":2,"arabic":"وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي أَبُو\n الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ صَلَّى بِنَا النَّبِيُّ صلى الله عليه وسلم يَوْمَ النَّحْرِ\n بِالْمَدِينَةِ فَتَقَدَّمَ رِجَالٌ فَنَحَرُوا وَظَنُّوا أَنَّ النَّبِيَّ صلى الله عليه وسلم قَدْ نَحَرَ فَأَمَرَ النَّبِيُّ\n صلى الله عليه وسلم مَنْ كَانَ نَحَرَ قَبْلَهُ أَنْ يُعِيدَ بِنَحْرٍ آخَرَ وَلاَ يَنْحَرُوا حَتَّى يَنْحَرَ النَّبِيُّ\n صلى الله عليه وسلم ‏.‏","english":{"narrator":"Jabir b. 'Abdullah reported:","text":"Allah's Messenger (ﷺ) led us in the 'Id prayer in Medina on the Day of Sacrifice. Some persons slaughtered their animals ahead of him under the impression that Allah's Apostle (ﷺ) had-already offered sacrifice. Thereupon Allah's Apostle (ﷺ) said: Those who had slaughtered their animals ahead of him should slaughter the other ones in their stead. And they should not sacrifice the animal before Allah's Messenger (ﷺ) had sacrificed (his animal)"}},{"id":21,"idInBook":21,"chapterId":35,"bookId":2,"arabic":"وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنْ \n يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ أَبِي الْخَيْرِ، عَنْ عُقْبَةَ بْنِ عَامِرٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم\n أَعْطَاهُ غَنَمًا يَقْسِمُهَا عَلَى أَصْحَابِهِ ضَحَايَا فَبَقِيَ عَتُودٌ فَذَكَرَهُ لِرَسُولِ اللَّهِ صلى الله عليه\n وسلم فَقَالَ ‏\n\"‏ ضَحِّ بِهِ أَنْتَ ‏\"‏ ‏.‏ قَالَ قُتَيْبَةُ عَلَى صَحَابَتِهِ ‏.‏","english":{"narrator":"Uqba b. 'Amir reported that Allah's Messenger (ﷺ) gave the gifts of goats to be distributed amongst his Companions. They sacrificed them, but a lamb of one year of age was left. (Someone) made a mention of that to the Messenger of Allah (ﷺ), whereupon he said:","text":"You sacrifice it."}},{"id":22,"idInBook":22,"chapterId":35,"bookId":2,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، عَنْ هِشَامٍ الدَّسْتَوَائِيِّ، عَنْ \n يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ بَعْجَةَ الْجُهَنِيِّ، عَنْ عُقْبَةَ بْنِ عَامِرٍ الْجُهَنِيِّ، قَالَ قَسَمَ رَسُولُ اللَّهِ\n صلى الله عليه وسلم فِينَا ضَحَايَا فَأَصَابَنِي جَذَعٌ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّهُ أَصَابَنِي جَذَعٌ\n ‏.‏ فَقَالَ ‏\n\"‏ ضَحِّ بِهِ ‏\"‏ ‏.‏","english":{"narrator":"Amir al-Juhani reported:","text":"Allah's Messenger (ﷺ) distributed sacrificial animals (amongst us for sacrificing them on 'Id al-Adha). So we sacrificed them. There fell to my lot a lamb of less than one year I said: Allah's Messenger, there has fallen to my lot a lamb (Jadha'a), whereupon he said: Sacrifice that."}},{"id":23,"idInBook":23,"chapterId":35,"bookId":2,"arabic":"وَحَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، حَدَّثَنَا يَحْيَى، - يَعْنِي ابْنَ حَسَّانَ -\n أَخْبَرَنَا مُعَاوِيَةُ، - وَهُوَ ابْنُ سَلاَّمٍ - حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ، أَخْبَرَنِي بَعْجَةُ بْنُ عَبْدِ،\n اللَّهِ أَنَّ عُقْبَةَ بْنَ عَامِرٍ الْجُهَنِيَّ، أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَسَمَ ضَحَايَا\n بَيْنَ أَصْحَابِهِ ‏.‏ بِمِثْلِ مَعْنَاهُ ‏.‏","english":{"narrator":"","text":"This hadith has been transmitted on the authority of 'Uqba b. 'Amir al-Juhan with a slight change of wording."}},{"id":24,"idInBook":24,"chapterId":35,"bookId":2,"arabic":"حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، قَالَ ضَحَّى النَّبِيُّ\n صلى الله عليه وسلم بِكَبْشَيْنِ أَمْلَحَيْنِ أَقْرَنَيْنِ ذَبَحَهُمَا بِيَدِهِ وَسَمَّى وَكَبَّرَ وَوَضَعَ رِجْلَهُ عَلَى\n صِفَاحِهِمَا ‏.‏","english":{"narrator":"","text":"Anas reported that Allah's Messenger (ﷺ) sacrificed with his own hands two horned rams which were white with black markings reciting the name of Allah and glorifying Him (saying Allah-o-Akbar). He placed his foot on their sides (while sacrificing)."}},{"id":25,"idInBook":25,"chapterId":35,"bookId":2,"arabic":"حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا وَكِيعٌ، عَنْ شُعْبَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، قَالَ ضَحَّى\n رَسُولُ اللَّهِ صلى الله عليه وسلم بِكَبْشَيْنِ أَمْلَحَيْنِ أَقْرَنَيْنِ قَالَ وَرَأَيْتُهُ يَذْبَحُهُمَا بِيَدِهِ وَرَأَيْتُهُ\n وَاضِعًا قَدَمَهُ عَلَى صِفَاحِهِمَا قَالَ وَسَمَّى وَكَبَّرَ ‏.‏","english":{"narrator":"Anas reported that Allah's Messenger (ﷺ) sacrificed two horned rams of white colour with black markings over them. He also stated:","text":"I saw him sacrificing them with his own hand and saw him placing his foot on their sides, and recited the name of Allah and Glorified Him."}},{"id":26,"idInBook":26,"chapterId":35,"bookId":2,"arabic":"وَحَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ، حَدَّثَنَا خَالِدٌ، - يَعْنِي ابْنَ الْحَارِثِ - حَدَّثَنَا شُعْبَةُ، أَخْبَرَنِي \n قَتَادَةُ، قَالَ سَمِعْتُ أَنَسًا، يَقُولُ ضَحَّى رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏ بِمِثْلِهِ ‏.‏ قَالَ قُلْتُ\n آنْتَ سَمِعْتَهُ مِنْ أَنَسٍ قَالَ نَعَمْ ‏.‏","english":{"narrator":"Shu'ba reported:","text":"Qatada informed me that he had heard Anas saying that Allah's Messenger (may peace be npon him) sacrificed (the horned rams) and like that. I said: Did you (Qatada) hear from Anas? He said. Yes."}},{"id":27,"idInBook":27,"chapterId":35,"bookId":2,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنِ سَعِيدٍ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ،\n عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ غَيْرَ أَنَّهُ قَالَ وَيَقُولُ ‏\n\"‏ بِاسْمِ اللَّهِ وَاللَّهُ أَكْبَرُ ‏\"‏ ‏.‏","english":{"narrator":"","text":"This hadith has been transmitted on the authority of Anas with a slight variation of wording."}},{"id":28,"idInBook":28,"chapterId":35,"bookId":2,"arabic":"حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، قَالَ قَالَ حَيْوَةُ أَخْبَرَنِي \n أَبُو صَخْرٍ، عَنْ يَزِيدَ بْنِ قُسَيْطٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله\n عليه وسلم أَمَرَ بِكَبْشٍ أَقْرَنَ يَطَأُ فِي سَوَادٍ وَيَبْرُكُ فِي سَوَادٍ وَيَنْظُرُ فِي سَوَادٍ فَأُتِيَ بِهِ\n لِيُضَحِّيَ بِهِ فَقَالَ لَهَا ‏\"‏ يَا عَائِشَةُ هَلُمِّي الْمُدْيَةَ ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ اشْحَذِيهَا بِحَجَرٍ ‏\"‏ ‏.‏ فَفَعَلَتْ\n ثُمَّ أَخَذَهَا وَأَخَذَ الْكَبْشَ فَأَضْجَعَهُ ثُمَّ ذَبَحَهُ ثُمَّ قَالَ ‏\"‏ بِاسْمِ اللَّهِ اللَّهُمَّ تَقَبَّلْ مِنْ مُحَمَّدٍ وَآلِ\n مُحَمَّدٍ وَمِنْ أُمَّةِ مُحَمَّدٍ ‏\"‏ ‏.‏ ثُمَّ ضَحَّى بِهِ ‏.‏","english":{"narrator":"'A'isha reported that Allah's Messenger (ﷺ) commanded that a ram with black legs, black belly and black (circles) round the eyes should be brought to him, so that he should sacrifice it. He said to 'A'isha:","text":"Give me the large knife, and then said: Sharpen it on a stone. She did that. He then took it (the knife) and then the ram; he placed it on the ground and then sacrificed it, saying: Bismillah, Allah-humma Taqabbal min Muhammadin wa Al-i-Muhammadin, wa min Ummati Muhammadin (In the name of Allah,\" O Allah, accept  on behalf of Muhammad and the family of Muhammad and the Umma of Muhammad\" )."}},{"id":29,"idInBook":29,"chapterId":35,"bookId":2,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى الْعَنَزِيُّ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ سُفْيَانَ، حَدَّثَنِي أَبِي،\n عَنْ عَبَايَةَ بْنِ رِفَاعَةَ بْنِ رَافِعِ بْنِ خَدِيجٍ، عَنْ رَافِعِ بْنِ خَدِيجٍ، قُلْتُ يَا رَسُولَ اللَّهِ إِنَّا لاَقُو\n الْعَدُوِّ غَدًا وَلَيْسَتْ مَعَنَا مُدًى قَالَ صلى الله عليه وسلم ‏\"‏ أَعْجِلْ أَوْ أَرْنِي مَا أَنْهَرَ الدَّمَ\n وَذُكِرَ اسْمُ اللَّهِ فَكُلْ لَيْسَ السِّنَّ وَالظُّفُرَ وَسَأُحَدِّثُكَ أَمَّا السِّنُّ فَعَظْمٌ وَأَمَّا الظُّفُرُ فَمُدَى الْحَبَشَةِ\n ‏\"‏ ‏.‏ قَالَ وَأَصَبْنَا نَهْبَ إِبِلٍ وَغَنَمٍ فَنَدَّ مِنْهَا بَعِيرٌ فَرَمَاهُ رَجُلٌ بِسَهْمٍ فَحَبَسَهُ فَقَالَ رَسُولُ\n اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ لِهَذِهِ الإِبِلِ أَوَابِدَ كَأَوَابِدِ الْوَحْشِ فَإِذَا غَلَبَكُمْ مِنْهَا شَىْءٌ\n فَاصْنَعُوا بِهِ هَكَذَا ‏\"‏ ‏.‏","english":{"narrator":"Rafi' b. Khadij is reported to have said:","text":"Allah's Messenger, we are going to encounter the enemy tomorrow, but we have no knives with us. Thereupon Allah's Messenger (ﷺ) said: Make haste or be careful (in making arrangements for procuring knives) which would let the blood flow (and along with it) the name of Allah is also to be recited. Then eat, but not the tooth or nail. And I am going to tell you why it is not permissible to slaughter the animal with the help of tooth and bone; and as for the nail. it is a bone, and the bone is the knife of Abyssinians. He (the narrator) said: There fell to our lot as spoils of war camels and goats, and one of the camels among them became wild. A person (amongst usl struck It with an arrow which brought it under control. whereupon Allah's Messenger (ﷺ) said: This camel became wild like wild animals, so if you find any animal getting wild, you do the same with that"}},{"id":30,"idInBook":30,"chapterId":35,"bookId":2,"arabic":"وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا وَكِيعٌ، حَدَّثَنَا سُفْيَانُ بْنُ سَعِيدِ بْنِ مَسْرُوقٍ،\n عَنْ أَبِيهِ، عَنْ عَبَايَةَ بْنِ رِفَاعَةَ بْنِ رَافِعِ بْنِ خَدِيجٍ، عَنْ رَافِعِ بْنِ خَدِيجٍ، قَالَ كُنَّا مَعَ رَسُولِ\n اللَّهِ صلى الله عليه وسلم بِذِي الْحُلَيْفَةِ مِنْ تِهَامَةَ فَأَصَبْنَا غَنَمًا وَإِبِلاً فَعَجِلَ الْقَوْمُ فَأَغْلَوْا\n بِهَا الْقُدُورَ فَأَمَرَ بِهَا فَكُفِئَتْ ثُمَّ عَدَلَ عَشْرًا مِنَ الْغَنَمِ بِجَزُورٍ ‏.‏ وَذَكَرَ بَاقِيَ الْحَدِيثِ كَنَحْوِ\n حَدِيثِ يَحْيَى بْنِ سَعِيدٍ ‏.‏","english":{"narrator":"Rafi' b. Khadij reported:","text":"While we were with Allah's Messenger (may peace he upon him) in Dhu'I-Hulaifa in Tihama, we got hold of goats and camels. Some persons (amongst us) made haste and boiled (the flesh of goats and camels) in their earthen pots. He then commanded and these were turned over; then he equalised ten goats for a camel. The rest of the hadith is the same."}},{"id":31,"idInBook":31,"chapterId":35,"bookId":2,"arabic":"وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ إِسْمَاعِيلَ بْنِ مُسْلِمٍ، عَنْ سَعِيدِ بْنِ مَسْرُوقٍ،\n عَنْ عَبَايَةَ، عَنْ جَدِّهِ، رَافِعٍ ثُمَّ حَدَّثَنِيهِ عُمَرُ بْنُ سَعِيدِ بْنِ مَسْرُوقٍ، عَنْ أَبِيهِ، عَنْ عَبَايَةَ بْنِ،\n رِفَاعَةَ بْنِ رَافِعِ بْنِ خَدِيجٍ عَنْ جَدِّهِ، قَالَ قُلْنَا يَا رَسُولَ اللَّهِ إِنَّا لاَقُو الْعَدُوِّ غَدًا وَلَيْسَ\n مَعَنَا مُدًى فَنُذَكِّي بِاللِّيطِ وَذَكَرَ الْحَدِيثَ بِقِصَّتِهِ وَقَالَ فَنَدَّ عَلَيْنَا بَعِيرٌ مِنْهَا فَرَمَيْنَاهُ بِالنَّبْلِ\n حَتَّى وَهَصْنَاهُ ‏.‏","english":{"narrator":"Rafi' b. Khadij reported from his grandfather that he said:","text":"Allah's Messenger, we are going to encounter the enemy tomorrow, but we do not have long knives with us, should we then slaughter them with the peel of the reed? The rest of the hadith is the same. (And at the end the words are):\" A camel became wild (and got out of our control). We attacked it with arrows until we made it fall down.\""}},{"id":32,"idInBook":32,"chapterId":35,"bookId":2,"arabic":"وَحَدَّثَنِيهِ الْقَاسِمُ بْنُ زَكَرِيَّاءَ، حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ، عَنْ زَائِدَةَ، عَنْ سَعِيدِ بْنِ مَسْرُوقٍ،\n بِهَذَا الإِسْنَادِ الْحَدِيثَ إِلَى آخِرِهِ بِتَمَامِهِ وَقَالَ فِيهِ وَلَيْسَتْ مَعَنَا مُدًى أَفَنَذْبَحُ بِالْقَصَبِ","english":{"narrator":"","text":"This hadith has been narrated on the authority of Sa'id b. Masruq with the same chain of transmitters with a slight variation of words."}},{"id":33,"idInBook":33,"chapterId":35,"bookId":2,"arabic":"وَحَدَّثَنَا مُحَمَّدُ بْنُ الْوَلِيدِ بْنِ عَبْدِ الْحَمِيدِ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ \n سَعِيدِ بْنِ مَسْرُوقٍ، عَنْ عَبَايَةَ بْنِ رِفَاعَةَ بْنِ رَافِعٍ، عَنْ رَافِعِ بْنِ خَدِيجٍ، أَنَّهُ قَالَ يَا رَسُولَ\n اللَّهِ إِنَّا لاَقُو الْعَدُوِّ غَدًا وَلَيْسَ مَعَنَا مُدًى وَسَاقَ الْحَدِيثَ وَلَمْ يَذْكُرْ فَعَجِلَ الْقَوْمُ فَأَغْلَوْا\n بِهَا الْقُدُورَ فَأَمَرَ بِهَا فَكُفِئَتْ وَذَكَرَ سَائِرَ الْقِصَّةِ ‏.‏","english":{"narrator":"Rafi' b. Khadij reported that he said:","text":"Allah's Messenger, we are going to encounter the enemy tomorrow. and we do not have large knives with us. The rest of the hadith is the same, but no mention is made of this:\" The people hastened and they boiled (flesh) in the earthen pots. He (the Holy Prophet), cammanded and these were turned over and the narrator narrated the whole event."}},{"id":34,"idInBook":34,"chapterId":35,"bookId":2,"arabic":"حَدَّثَنِي عَبْدُ الْجَبَّارِ بْنُ الْعَلاَءِ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا الزُّهْرِيُّ، عَنْ أَبِي عُبَيْدٍ، قَالَ\n شَهِدْتُ الْعِيدَ مَعَ عَلِيِّ بْنِ أَبِي طَالِبٍ فَبَدَأَ بِالصَّلاَةِ قَبْلَ الْخُطْبَةِ وَقَالَ إِنَّ رَسُولَ اللَّهِ صلى\n الله عليه وسلم نَهَانَا أَنْ نَأْكُلَ مِنْ لُحُومِ نُسُكِنَا بَعْدَ ثَلاَثٍ ‏.‏","english":{"narrator":"Abu Ubaid reported:","text":"I was with 'Ali b. Abi Talib on the occasion of the 'Id day. He started with the 'Id prayer before delivering the sermon, and said: Allah's Messenger (ﷺ) forbade us to eat the flesh of our sacrificial animals beyond three days."}},{"id":35,"idInBook":35,"chapterId":35,"bookId":2,"arabic":"حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، حَدَّثَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي \n أَبُو عُبَيْدٍ، مَوْلَى ابْنِ أَزْهَرَ أَنَّهُ شَهِدَ الْعِيدَ مَعَ عُمَرَ بْنِ الْخَطَّابِ قَالَ ثُمَّ صَلَّيْتُ مَعَ عَلِيِّ\n بْنِ أَبِي طَالِبٍ - قَالَ - فَصَلَّى لَنَا قَبْلَ الْخُطْبَةِ ثُمَّ خَطَبَ النَّاسَ فَقَالَ إِنَّ رَسُولَ اللَّهِ صلى\n الله عليه وسلم قَدْ نَهَاكُمْ أَنْ تَأْكُلُوا لُحُومَ نُسُكِكُمْ فَوْقَ ثَلاَثِ لَيَالٍ فَلاَ تَأْكُلُوا ‏.‏","english":{"narrator":"Abu 'Ubaid, the freed slave of Ibn Azhar, reported that he said 'Id (prayer) with Umar b. al-Khattab, and then said the 'Id (prayer) with 'Ali b. Abu Talib. He (the narrator further) reported:","text":"He led us in prayer before delivering the sermon and then addressed the people saying: Allah's Messenger (ﷺ) has forbidden you to eat the flesh of your sacrificial animals beyond three nights, so do not eat that."}},{"id":36,"idInBook":36,"chapterId":35,"bookId":2,"arabic":"وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا ابْنُ أَخِي ابْنِ شِهَابٍ،\n ح وَحَدَّثَنَا حَسَنٌ الْحُلْوَانِيُّ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، ح وَحَدَّثَنَا \n عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، كُلُّهُمْ عَنِ الزُّهْرِيِّ، بِهَذَا الإِسْنَادِ مِثْلَهُ ‏.‏","english":{"narrator":"","text":"This hadith has been narrated on the authority of Zuhri with the same chain of transmitters."}},{"id":37,"idInBook":37,"chapterId":35,"bookId":2,"arabic":"وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنْ \n نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ ‏\n\"‏ لاَ يَأْكُلْ أَحَدٌ مِنْ لَحْمِ أُضْحِيَّتِهِ\n فَوْقَ ثَلاَثَةِ أَيَّامٍ ‏\"‏ ‏.‏","english":{"narrator":"Ibn 'Umar reported Allah's Apostle (ﷺ) having said:","text":"None of you should eat the flesh of his sacrificial animal beyond three days."}},{"id":38,"idInBook":38,"chapterId":35,"bookId":2,"arabic":"وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنِ ابْنِ جُرَيْجٍ، ح وَحَدَّثَنِي مُحَمَّدُ،\n بْنُ رَافِعٍ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، أَخْبَرَنَا الضَّحَّاكُ، - يَعْنِي ابْنَ عُثْمَانَ - كِلاَهُمَا عَنْ نَافِعٍ،\n عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِ حَدِيثِ اللَّيْثِ ‏.‏","english":{"narrator":"","text":"This hadith has been narrated on the authority of Ibn Umar through another chain of transmitters."}},{"id":39,"idInBook":39,"chapterId":35,"bookId":2,"arabic":"وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَ ابْنُ أَبِي عُمَرَ حَدَّثَنَا وَقَالَ عَبْدٌ، أَخْبَرَنَا \n عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله\n عليه وسلم نَهَى أَنْ تُؤْكَلَ لُحُومُ الأَضَاحِي بَعْدَ ثَلاَثٍ ‏.‏ قَالَ سَالِمٌ فَكَانَ ابْنُ عُمَرَ لاَ يَأْكُلُ\n لُحُومَ الأَضَاحِيِّ فَوْقَ ثَلاَثٍ ‏.‏ وَقَالَ ابْنُ أَبِي عُمَرَ بَعْدَ ثَلاَثٍ ‏.‏","english":{"narrator":"Ibn 'Umar reported that Allah's Messenger (ﷺ) forbade that the flesh of sacrificial animals be eaten beyond three (days) Salim (son of Ibn Umar) said:","text":"Ibn 'Umar did not eat the flesh of the sacrificial animals beyond three (days). Ibn Abu 'Umar said:\" Beyond three days.\""}},{"id":40,"idInBook":40,"chapterId":35,"bookId":2,"arabic":"حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، أَخْبَرَنَا رَوْحٌ، حَدَّثَنَا مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ،\n أَبِي بَكْرٍ عَنْ عَبْدِ اللَّهِ بْنِ وَاقِدٍ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ أَكْلِ لُحُومِ\n الضَّحَايَا بَعْدَ ثَلاَثٍ ‏.‏ قَالَ عَبْدُ اللَّهِ بْنُ أَبِي بَكْرٍ فَذَكَرْتُ ذَلِكَ لِعَمْرَةَ فَقَالَتْ صَدَقَ سَمِعْتُ\n عَائِشَةَ تَقُولُ دَفَّ أَهْلُ أَبْيَاتٍ مِنْ أَهْلِ الْبَادِيَةِ حِضْرَةَ الأَضْحَى زَمَنَ رَسُولِ اللَّهِ صلى الله\n عليه وسلم فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ ادَّخِرُوا ثَلاَثًا ثُمَّ تَصَدَّقُوا بِمَا بَقِيَ\n ‏\"‏ ‏.‏ فَلَمَّا كَانَ بَعْدَ ذَلِكَ قَالُوا يَا رَسُولَ اللَّهِ إِنَّ النَّاسَ يَتَّخِذُونَ الأَسْقِيَةَ مِنْ ضَحَايَاهُمْ وَيَحْمِلُونَ\n مِنْهَا الْوَدَكَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَمَا ذَاكَ ‏\"‏ ‏.‏ قَالُوا نَهَيْتَ أَنْ تُؤْكَلَ\n لُحُومُ الضَّحَايَا بَعْدَ ثَلاَثٍ ‏.‏ فَقَالَ ‏\"‏ إِنَّمَا نَهَيْتُكُمْ مِنْ أَجْلِ الدَّافَّةِ الَّتِي دَفَّتْ فَكُلُوا وَادَّخِرُوا\n وَتَصَدَّقُوا ‏\"‏ ‏.‏","english":{"narrator":"Abdullah b. Waqid reported:","text":"Allah's Messenger (ﷺ) forbade (people) to cat the flesh of sacrificed animals beyond three days. Abdullah b. Abu Bakr said, I made a mention of that to 'Amra, whereupon she said: He has told the truth, for I heard 'A'isha say: The poor among the people of the desert come (to the towns) on the occasion of Id al-Adha during the lifetime of Allah's Messenger (ﷺ). Upon this Allah's Messenger (ﷺ) said: Retain with you (the flesh) sufficing for three (days), and whatever is left out of that give in charity. After this. they (the Muslims) said: Allah's Messenger, the people make waterskins with the (hides) of their sacrificed animals and they melt fat out of them. Thereupon he said. What the then? They said: You forbade (us) to eat the flesh of sacrificial animals beyond threoq (days), whereupon he said: I forbade you for those (poor persons) who flocked (to the towns on this occasion for getting meat) but now when (this situation has improved) you may eat, preserve and give -in charity."}},{"id":41,"idInBook":41,"chapterId":35,"bookId":2,"arabic":"حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، عَنِ النَّبِيِّ\n صلى الله عليه وسلم أَنَّهُ نَهَى عَنْ أَكْلِ لُحُومِ الضَّحَايَا بَعْدَ ثَلاَثٍ ثُمَّ قَالَ بَعْدُ ‏\n\"‏ كُلُوا وَتَزَوَّدُوا\n وَادَّخِرُوا ‏\"‏ ‏.‏","english":{"narrator":"Jabir reported that Allah's Apostle (ﷺ) forbade eating of the flesh of sacrificed animals beyond three (days). but afterwards said:","text":"Eat, make a provision, and keep it."}},{"id":42,"idInBook":42,"chapterId":35,"bookId":2,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، ح وَحَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ،\n حَدَّثَنَا ابْنُ عُلَيَّةَ، كِلاَهُمَا عَنِ ابْنِ جُرَيْجٍ، عَنْ عَطَاءٍ، عَنْ جَابِرٍ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ،\n - وَاللَّفْظُ لَهُ - حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنِ ابْنِ جُرَيْجٍ، حَدَّثَنَا عَطَاءٌ، قَالَ سَمِعْتُ جَابِرَ بْنَ،\n عَبْدِ اللَّهِ يَقُولُ كُنَّا لاَ نَأْكُلُ مِنْ لُحُومِ بُدْنِنَا فَوْقَ ثَلاَثِ مِنًى فَأَرْخَصَ لَنَا رَسُولُ اللَّهِ صلى\n الله عليه وسلم فَقَالَ ‏\n\"‏ كُلُوا وَتَزَوَّدُوا ‏\"‏ ‏.‏ قُلْتُ لِعَطَاءٍ قَالَ جَابِرٌ حَتَّى جِئْنَا الْمَدِينَةَ قَالَ\n نَعَمْ ‏.‏","english":{"narrator":"Jabir b. Abdullah reported:","text":"We did not eat the flesh of our sacrificial animals beyond three days in Mina. Then Allah's Messenger (ﷺ) permitted us saying: Eat and make it a provision (for journey). I asked 'Ata' whether Jabir had also said: Till we came to Medina. He said: Yes."}},{"id":43,"idInBook":43,"chapterId":35,"bookId":2,"arabic":"حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا زَكَرِيَّاءُ بْنُ عَدِيٍّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَمْرٍو،\n عَنْ زَيْدِ بْنِ أَبِي أُنَيْسَةَ، عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ كُنَّا لاَ نُمْسِكُ\n لُحُومَ الأَضَاحِيِّ فَوْقَ ثَلاَثٍ فَأَمَرَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ نَتَزَوَّدَ مِنْهَا وَنَأْكُلَ\n مِنْهَا ‏.‏ يَعْنِي فَوْقَ ثَلاَثٍ ‏.‏","english":{"narrator":"Jabir b. 'Abdullah reported:","text":"We did not eat the flesh of sacrificed animals beyond three (days), but then Allah's Messenger (ﷺ) commanded us to make it a provision for journey and cat it (beyond three days)."}},{"id":44,"idInBook":44,"chapterId":35,"bookId":2,"arabic":"وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرٍو، عَنْ عَطَاءٍ،\n عَنْ جَابِرٍ، قَالَ كُنَّا نَتَزَوَّدُهَا إِلَى الْمَدِينَةِ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏","english":{"narrator":"Jabir reported:","text":"We made provision (out of the flesh of sacrificed animals for our journey) to Medina during the lifetime of Allah's Messenger (ﷺ)."}},{"id":45,"idInBook":45,"chapterId":35,"bookId":2,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ الأَعْلَى، عَنِ الْجُرَيْرِيِّ، عَنْ أَبِي نَضْرَةَ،\n عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، ح \n وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ أَبِي،\n نَضْرَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَا أَهْلَ الْمَدِينَةِ\n لاَ تَأْكُلُوا لُحُومَ الأَضَاحِيِّ فَوْقَ ثَلاَثٍ ‏\"‏ ‏.‏ وَقَالَ ابْنُ الْمُثَنَّى ثَلاَثَةِ أَيَّامٍ ‏.‏ فَشَكَوْا إِلَى رَسُولِ\n اللَّهِ صلى الله عليه وسلم أَنَّ لَهُمْ عِيَالاً وَحَشَمًا وَخَدَمًا فَقَالَ ‏\"‏ كُلُوا وَأَطْعِمُوا وَاحْبِسُوا\n أَوِ ادَّخِرُوا ‏\"‏ ‏.‏ قَالَ ابْنُ الْمُثَنَّى شَكَّ عَبْدُ الأَعْلَى ‏.‏","english":{"narrator":"Abu Sa'id al-Khudri reported Allah's Messenger (ﷺ) having said:","text":"O people of Medina, do not eat the flesh of sacrificed animals beyond three days. Ibn al-Muthanni said: Three days. They (the Companions of the Holy Prophet) complained to the Messenger of Allah (may peace he upon him) that they had children and servants of theirs (to feed), whereupon he said: Eat, and feed others, and store, and make it a provision of food."}},{"id":46,"idInBook":46,"chapterId":35,"bookId":2,"arabic":"حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا أَبُو عَاصِمٍ، عَنْ يَزِيدَ بْنِ أَبِي عُبَيْدٍ، عَنْ سَلَمَةَ،\n بْنِ الأَكْوَعِ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ ضَحَّى مِنْكُمْ فَلاَ يُصْبِحَنَّ فِي\n بَيْتِهِ بَعْدَ ثَالِثَةٍ شَيْئًا ‏\"‏ ‏.‏ فَلَمَّا كَانَ فِي الْعَامِ الْمُقْبِلِ قَالُوا يَا رَسُولَ اللَّهِ نَفْعَلُ كَمَا فَعَلْنَا\n عَامَ أَوَّلَ فَقَالَ ‏\"‏ لاَ إِنَّ ذَاكَ عَامٌ كَانَ النَّاسُ فِيهِ بِجَهْدٍ فَأَرَدْتُ أَنْ يَفْشُوَ فِيهِمْ ‏\"‏ ‏.‏","english":{"narrator":"Salama b. al-Akwa' reported Allah's Messenger (way peace be upon him) having said:","text":"He who sacrifices (animal) among you nothing should be left in his house (out of its flesh) on the morning of the third day. When it was the next year they (his Companions) said: Should we do this year as we did daring the previous year? Thereupon he said: Don't do that, for that was a year when the people were hard pressed (on account of poverty). so I wanted that the (flesh) might be distributed amongst them."}},{"id":47,"idInBook":47,"chapterId":35,"bookId":2,"arabic":"حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا مَعْنُ بْنُ عِيسَى، حَدَّثَنَا مُعَاوِيَةُ بْنُ صَالِحٍ، عَنْ أَبِي،\n الزَّاهِرِيَّةِ عَنْ جُبَيْرِ بْنِ نُفَيْرٍ، عَنْ ثَوْبَانَ، قَالَ ذَبَحَ رَسُولُ اللَّهِ صلى الله عليه وسلم ضَحِيَّتَهُ\n ثُمَّ قَالَ ‏\n\"‏ يَا ثَوْبَانُ أَصْلِحْ لَحْمَ هَذِهِ ‏\"‏ ‏.‏ فَلَمْ أَزَلْ أُطْعِمُهُ مِنْهَا حَتَّى قَدِمَ الْمَدِينَةَ ‏.‏","english":{"narrator":"Thauban reported that Allah's Messenger (way peace be upon him) slaughtered his sacrificial animal and then said:","text":"Thauban, make his meat usable (for journey), and I continuously served him that until he arrived in Medina."}},{"id":48,"idInBook":48,"chapterId":35,"bookId":2,"arabic":"وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ، رَافِعٍ قَالاَ حَدَّثَنَا زَيْدُ بْنُ حُبَابٍ، ح وَحَدَّثَنَا \n إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، كِلاَهُمَا عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ،\n بِهَذَا الإِسْنَادِ ‏.‏","english":{"narrator":"","text":"This hadith has been narrated on the authority of Mu'awiya b. Salih with the same chain of transmitters."}},{"id":49,"idInBook":49,"chapterId":35,"bookId":2,"arabic":"وَحَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا أَبُو مُسْهِرٍ، حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ، حَدَّثَنِي \n الزُّبَيْدِيُّ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرِ بْنِ نُفَيْرٍ، عَنْ أَبِيهِ، عَنْ ثَوْبَانَ، مَوْلَى رَسُولِ اللَّهِ صلى\n الله عليه وسلم قَالَ قَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم فِي حَجَّةِ الْوَدَاعِ ‏\n\"‏ أَصْلِحْ\n هَذَا اللَّحْمَ ‏\"‏ ‏.‏ قَالَ فَأَصْلَحْتُهُ فَلَمْ يَزَلْ يَأْكُلُ مِنْهُ حَتَّى بَلَغَ الْمَدِينَةَ ‏.‏ \n وَحَدَّثَنِيهِ عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُبَارَكِ، حَدَّثَنَا يَحْيَى،\n بْنُ حَمْزَةَ بِهَذَا الإِسْنَادِ وَلَمْ يَقُلْ فِي حَجَّةِ الْوَدَاعِ ‏.‏","english":{"narrator":"Thauban, the freed slave of Allah's Messenger (ﷺ), reported:","text":"Allah's Messenger (ﷺ) said to me on the occasion of Hajjat-al-Wada' (the Farewell Pilgrimage): Make the flesh usable. So I made it usable (for him) and he ate it constantly until he reached Medina. This hadith has been narrated on the authority of Yabya b. Hamza with the same chain of transmitters, but he did not say: On the occasion of Hajjat-al-Wada'."}},{"id":50,"idInBook":50,"chapterId":35,"bookId":2,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، قَالَ\n أَبُو بَكْرٍ عَنْ أَبِي سِنَانٍ، وَقَالَ ابْنُ الْمُثَنَّى، عَنْ ضِرَارِ بْنِ مُرَّةَ، عَنْ مُحَارِبٍ، عَنِ ابْنِ بُرَيْدَةَ،\n عَنْ أَبِيهِ، ح \n وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، حَدَّثَنَا ضِرَارُ بْنُ مُرَّةَ،\n أَبُو سِنَانٍ عَنْ مُحَارِبِ بْنِ دِثَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى\n الله عليه وسلم ‏\n\"‏ نَهَيْتُكُمْ عَنْ زِيَارَةِ الْقُبُورِ فَزُورُوهَا وَنَهَيْتُكُمْ عَنْ لُحُومِ الأَضَاحِيِّ فَوْقَ\n ثَلاَثٍ فَأَمْسِكُوا مَا بَدَا لَكُمْ وَنَهَيْتُكُمْ عَنِ النَّبِيذِ إِلاَّ فِي سِقَاءٍ فَاشْرَبُوا فِي الأَسْقِيَةِ كُلِّهَا\n وَلاَ تَشْرَبُوا مُسْكِرًا ‏\"‏ ‏.‏","english":{"narrator":"Abdullah b. Buraida reported on the authority of his father that Allah's Messenger (ﷺ) said this:","text":"I prohibited you from visiting the graves, but (now) you may visit them, and I prohibited you (from eating) the flesh of sacrific- ed animals beyond three days, but now keep it as long as you like. I prohibited you from the use of Nabidh except (that preoared) in dry waterskins. Now drink (Nabidh prepared in any utensil), but do not drink when it becomes intoxicant."}},{"id":51,"idInBook":51,"chapterId":35,"bookId":2,"arabic":"وَحَدَّثَنِي حَجَّاجُ بْنُ الشَّاعِرِ، حَدَّثَنَا الضَّحَّاكُ بْنُ مَخْلَدٍ، عَنْ سُفْيَانَ، عَنْ عَلْقَمَةَ،\n بْنِ مَرْثَدٍ عَنِ ابْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ كُنْتُ نَهَيْتُكُمْ\n ‏\"‏ ‏.‏ فَذَكَرَ بِمَعْنَى حَدِيثِ أَبِي سِنَانٍ ‏.‏","english":{"narrator":"Ibn Buraida, on the authority of his father, reported Allah's Messenger (ﷺ) having said this:","text":"I used to forbid you. The rest of the hadith is the same."}},{"id":52,"idInBook":52,"chapterId":35,"bookId":2,"arabic":"حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ وَزُهَيْرُ\n بْنُ حَرْبٍ قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرُونَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدٍ،\n عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم ح \n وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَ عَبْدٌ أَخْبَرَنَا وَقَالَ ابْنُ رَافِعٍ، حَدَّثَنَا \n عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنِ ابْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ\n اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ فَرَعَ وَلاَ عَتِيرَةَ ‏\"‏ ‏.‏ زَادَ ابْنُ رَافِعٍ فِي رِوَايَتِهِ وَالْفَرَعُ أَوَّلُ\n النِّتَاجِ كَانَ يُنْتَجُ لَهُمْ فَيَذْبَحُونَهُ ‏.‏","english":{"narrator":"Abu Huraira reported Allah's Messenger (ﷺ) as saying:","text":"(The sacrifice of Fara' and 'Atira) has no (sanction in Islam). Ibn Rafi' made this addition in his narration that Fara' means the first-born young one of a camel."}},{"id":53,"idInBook":53,"chapterId":35,"bookId":2,"arabic":"حَدَّثَنَا ابْنُ أَبِي عُمَرَ الْمَكِّيُّ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ،\n بْنِ عَوْفٍ سَمِعَ سَعِيدَ بْنَ الْمُسَيَّبِ، يُحَدِّثُ عَنْ أُمِّ سَلَمَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ\n ‏\n\"‏ إِذَا دَخَلَتِ الْعَشْرُ وَأَرَادَ أَحَدُكُمْ أَنْ يُضَحِّيَ فَلاَ يَمَسَّ مِنْ شَعَرِهِ وَبَشَرِهِ شَيْئًا ‏\"‏ ‏.‏ قِيلَ\n لِسُفْيَانَ فَإِنَّ بَعْضَهُمْ لاَ يَرْفَعُهُ قَالَ لَكِنِّي أَرْفَعُهُ ‏.‏","english":{"narrator":"Umm Salama reported Allah's Messenger (ﷺ) having said this:","text":"When any one of you intending to sacrifice the animal enters in the month (of Dhu'l-Hijja) he should not get his hair or nails touched (cut). It was said to Sufyan that some of the (scholars) did not deem this hadith to be Maffu'. He said: But I deem it as Marfu' (i. e. chain of narration traceable right up to the Holy Prophet)."}},{"id":54,"idInBook":54,"chapterId":35,"bookId":2,"arabic":"وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا سُفْيَانُ، حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ حُمَيْدِ بْنِ،\n عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أُمِّ سَلَمَةَ، تَرْفَعُهُ قَالَ ‏\n\"‏ إِذَا دَخَلَ الْعَشْرُ\n وَعِنْدَهُ أُضْحِيَّةٌ يُرِيدُ أَنْ يُضَحِّيَ فَلاَ يَأْخُذَنَّ شَعْرًا وَلاَ يَقْلِمَنَّ ظُفُرًا ‏\"‏ ‏.‏","english":{"narrator":"Umm Salama reported Allah's Apostle (ﷺ) as saying:","text":"If anyone of you intends to offer sacrifice he should not get his hair cut or nails trimmed."}},{"id":55,"idInBook":55,"chapterId":35,"bookId":2,"arabic":"وَحَدَّثَنِي حَجَّاجُ بْنُ الشَّاعِرِ، حَدَّثَنِي يَحْيَى بْنُ كَثِيرٍ الْعَنْبَرِيُّ أَبُو غَسَّانَ، حَدَّثَنَا \n شُعْبَةُ، عَنْ مَالِكِ بْنِ أَنَسٍ، عَنْ عُمَرَ بْنِ مُسْلِمٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أُمِّ سَلَمَةَ، أَنَّ النَّبِيَّ\n صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا رَأَيْتُمْ هِلاَلَ ذِي الْحِجَّةِ وَأَرَادَ أَحَدُكُمْ أَنْ يُضَحِّيَ فَلْيُمْسِكْ\n عَنْ شَعْرِهِ وَأَظْفَارِهِ ‏\"‏ ‏.‏","english":{"narrator":"Umm Salama reported (these words) directly from Allah's Messenger (ﷺ):","text":"If anyone has in his possession a sacrificial animal to offer as a sacrifice (on 'Id al-Adha), he should not get his hair cut and nails trimmed after he has entered the first days of Dhu'l Hijja"}},{"id":56,"idInBook":56,"chapterId":35,"bookId":2,"arabic":"وَحَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ الْحَكَمِ الْهَاشِمِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ،\n عَنْ مَالِكِ بْنِ أَنَسٍ، عَنْ عُمَرَ، أَوْ عَمْرِو بْنِ مُسْلِمٍ بِهَذَا الإِسْنَادِ نَحْوَهُ ‏.‏","english":{"narrator":"","text":"This hadith has been narrated on the authority of 'Amr b. Muslim with the same chain of transmitters."}},{"id":57,"idInBook":57,"chapterId":35,"bookId":2,"arabic":"وَحَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو اللَّيْثِيُّ،\n عَنْ عُمَرَ بْنِ مُسْلِمِ بْنِ عَمَّارِ بْنِ أُكَيْمَةَ اللَّيْثِيِّ، قَالَ سَمِعْتُ سَعِيدَ بْنَ الْمُسَيَّبِ، يَقُولُ سَمِعْتُ \n أُمَّ سَلَمَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم تَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏\n مَنْ كَانَ لَهُ ذِبْحٌ يَذْبَحُهُ فَإِذَا أُهِلَّ هِلاَلُ ذِي الْحِجَّةِ فَلاَ يَأْخُذَنَّ مِنْ شَعْرِهِ وَلاَ مِنْ أَظْفَارِهِ\n شَيْئًا حَتَّى يُضَحِّيَ ‏\"‏ ‏.‏","english":{"narrator":"Umm Salama, the wife of Allah's Apostle (ﷺ), reported Allah's Messenger (ﷺ) to have said:","text":"He who has a sacrificial animal with him whom (he intends) to offer as sacrifice, and he enters the month of Dhu'I-Hijja, he should not get his hair cut or nails trimmed until he has sacrificed the animal."}},{"id":58,"idInBook":58,"chapterId":35,"bookId":2,"arabic":"حَدَّثَنِي الْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنِي مُحَمَّدُ بْنُ عَمْرٍو، حَدَّثَنَا \n عَمْرُو بْنُ مُسْلِمِ بْنِ عَمَّارٍ اللَّيْثِيُّ، قَالَ كُنَّا فِي الْحَمَّامِ قُبَيْلَ الأَضْحَى فَاطَّلَى فِيهِ نَاسٌ فَقَالَ\n بَعْضُ أَهْلِ الْحَمَّامِ إِنَّ سَعِيدَ بْنَ الْمُسَيَّبِ يَكْرَهُ هَذَا أَوْ يَنْهَى عَنْهُ فَلَقِيتُ سَعِيدَ بْنَ الْمُسَيَّبِ\n فَذَكَرْتُ ذَلِكَ لَهُ فَقَالَ يَا ابْنَ أَخِي هَذَا حَدِيثٌ قَدْ نُسِيَ وَتُرِكَ حَدَّثَتْنِي أُمُّ سَلَمَةَ زَوْجُ النَّبِيِّ\n صلى الله عليه وسلم قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِمَعْنَى حَدِيثِ مُعَاذٍ عَنْ\n مُحَمَّدِ بْنِ عَمْرٍو ‏.‏","english":{"narrator":"'Amr b. Muslim b. 'Ammar al-Laithi reported:","text":"While we were in a bathroom just before 'Id al-Adha some of the persons tried to remove the hair with the help of hair-removing chemicals. Thereupon some of the people owning the bath (or some of the people sitting therein) said that Sa'id b. Musayyib did not approve of it, or he prohibited it. Then I met Sa'id b. Musayyib and made a mention of that to him, whereupon he said: O my nephew, this is the hadith which has been forgotten, and abandoned. Umm Salama, the wife of Allah's Apostle (ﷺ), narrated to me Allah's Messenger (ﷺ) having said as narrated above."}},{"id":59,"idInBook":59,"chapterId":35,"bookId":2,"arabic":"وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، وَأَحْمَدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ أَخِي ابْنِ وَهْبٍ، قَالاَ حَدَّثَنَا \n عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي حَيْوَةُ، أَخْبَرَنِي خَالِدُ بْنُ يَزِيدَ، عَنْ سَعِيدِ بْنِ أَبِي هِلاَلٍ، عَنْ عُمَرَ،\n بْنِ مُسْلِمٍ الْجُنْدَعِيِّ أَنَّ ابْنَ الْمُسَيَّبِ، أَخْبَرَهُ أَنَّ أُمَّ سَلَمَةَ زَوْجَ النَّبِيِّ صلى الله عليه وسلم\n أَخْبَرَتْهُ ‏.‏ وَذَكَرَ النَّبِيَّ صلى الله عليه وسلم بِمَعْنَى حَدِيثِهِمْ ‏.‏","english":{"narrator":"","text":"Amr b. Muslim al-Jundani reported that Ibn Musayyib had told him that it was Umm Salama, the wife of Allah's Apostle (ﷺ), who had informed him of that as narrated above."}},{"id":60,"idInBook":60,"chapterId":35,"bookId":2,"arabic":"حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَسُرَيْجُ بْنُ يُونُسَ، كِلاَهُمَا عَنْ مَرْوَانَ، قَالَ زُهَيْرٌ حَدَّثَنَا \n مَرْوَانُ بْنُ مُعَاوِيَةَ الْفَزَارِيُّ، حَدَّثَنَا مَنْصُورُ بْنُ حَيَّانَ، حَدَّثَنَا أَبُو الطُّفَيْلِ، عَامِرُ بْنُ وَاثِلَةَ قَالَ\n كُنْتُ عِنْدَ عَلِيِّ بْنِ أَبِي طَالِبٍ فَأَتَاهُ رَجُلٌ فَقَالَ مَا كَانَ النَّبِيُّ صلى الله عليه وسلم يُسِرُّ\n إِلَيْكَ قَالَ فَغَضِبَ وَقَالَ مَا كَانَ النَّبِيُّ صلى الله عليه وسلم يُسِرُّ إِلَىَّ شَيْئًا يَكْتُمُهُ النَّاسَ\n غَيْرَ أَنَّهُ قَدْ حَدَّثَنِي بِكَلِمَاتٍ أَرْبَعٍ ‏.‏ قَالَ فَقَالَ مَا هُنَّ يَا أَمِيرَ الْمُؤْمِنِينَ قَالَ قَالَ ‏\n\"‏ لَعَنَ\n اللَّهُ مَنْ لَعَنَ وَالِدَهُ وَلَعَنَ اللَّهُ مَنْ ذَبَحَ لِغَيْرِ اللَّهِ وَلَعَنَ اللَّهُ مَنْ آوَى مُحْدِثًا وَلَعَنَ اللَّهُ مَنْ غَيَّرَ\n مَنَارَ الأَرْضِ ‏\"‏ ‏.‏","english":{"narrator":"Abu Tufail 'Amir b. Withila reported:","text":"I was in the company of 'Ali b. Abi Talib, when a person came to him, and said: What was it that Allah's Apostle (ﷺ) told you in secret? Thereupon he (liadrat 'All) was enraged and said: Allah's Apostle (ﷺ) did not tell me anything in secret that he hid from people, except that he told me four things. He said: Com- mader of Faithful, what are these? He said: Allah cursed him who cursed his father; Allah cursed him who sacrificed for anyone besides Allah; and Allah cursed him who accommodates an innovator (in religion) ; and Allah cursed him who changed the minarets (the boundary lines) of the land."}},{"id":61,"idInBook":61,"chapterId":35,"bookId":2,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو خَالِدٍ الأَحْمَرُ، سُلَيْمَانُ بْنُ حَيَّانَ عَنْ مَنْصُورِ،\n بْنِ حَيَّانَ عَنْ أَبِي الطُّفَيْلِ، قَالَ قُلْنَا لِعَلِيِّ بْنِ أَبِي طَالِبٍ أَخْبِرْنَا بِشَىْءٍ، أَسَرَّهُ إِلَيْكَ رَسُولُ\n اللَّهِ صلى الله عليه وسلم فَقَالَ مَا أَسَرَّ إِلَىَّ شَيْئًا كَتَمَهُ النَّاسَ وَلَكِنِّي سَمِعْتُهُ يَقُولُ ‏\n\"‏ لَعَنَ\n اللَّهُ مَنْ ذَبَحَ لِغَيْرِ اللَّهِ وَلَعَنَ اللَّهُ مَنْ آوَى مُحْدِثًا وَلَعَنَ اللَّهُ مَنْ لَعَنَ وَالِدَيْهِ وَلَعَنَ اللَّهُ مَنْ\n غَيَّرَ الْمَنَارَ ‏\"‏ ‏.‏","english":{"narrator":"Abu Tufail reported:","text":"We said to 'Ali b. Abi Talib: Inform us about something which Allah's Messenger (ﷺ) told you in secret, whereupon he said: He told me nothing in secret which he bid from people, but I heard him say: Allah cursed him who sacrificed for anyone besides Allah; and cursed him who accommodated an innovator; and Allah cursed him who cursed his parents and Allah cursed him who changed the boundary lines (of the land possessed by him)."}},{"id":62,"idInBook":62,"chapterId":35,"bookId":2,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، - وَاللَّفْظُ لاِبْنِ الْمُثَنَّى - قَالاَ حَدَّثَنَا \n مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ الْقَاسِمَ بْنَ أَبِي بَزَّةَ، يُحَدِّثُ عَنْ أَبِي الطُّفَيْلِ، قَالَ\n سُئِلَ عَلِيٌّ أَخَصَّكُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم بِشَىْءٍ فَقَالَ مَا خَصَّنَا رَسُولُ اللَّهِ\n صلى الله عليه وسلم بِشَىْءٍ لَمْ يَعُمَّ بِهِ النَّاسَ كَافَّةً إِلاَّ مَا كَانَ فِي قِرَابِ سَيْفِي هَذَا -\n قَالَ - فَأَخْرَجَ صَحِيفَةً مَكْتُوبٌ فِيهَا ‏\n\"‏ لَعَنَ اللَّهُ مَنْ ذَبَحَ لِغَيْرِ اللَّهِ وَلَعَنَ اللَّهُ مَنْ سَرَقَ\n مَنَارَ الأَرْضِ وَلَعَنَ اللَّهُ مَنْ لَعَنَ وَالِدَهُ وَلَعَنَ اللَّهُ مَنْ آوَى مُحْدِثًا ‏\"‏ ‏.‏","english":{"narrator":"Abu Tufail reported:","text":"'Ali was asked whether Allah's Messenger (ﷺ) had showed special favour (by disclosing to him) a thing (which he kept secret from others). Thereupon he said: Allah's Messenger (ﷺ) singled us not for (disclosing to us) anything (secret) which he did not make public, (but those few things) which lie in the sheath of my sword. He drew out the written document contained in it and on that (it was mentioned): Allah cursed him who sacrificed for anyone else besides Allah; and Allah cursed him who stole the signposts (demarcating the boundary lines of the) land; and Allah cursed him who cursed his father; and Allah cursed him who accommodated an innovator (in religion)."}}],"chapter":{"id":35,"bookId":2,"arabic":"كتاب الأضاحى","english":"The Book of Sacrifices"}}