{"metadata":{"length":41,"arabic":{"title":"صحيح مسلم","author":"الإمام مسلم بن الحجاج القشيري النيسابوري","introduction":"كتاب الرؤيا"},"english":{"title":"Sahih Muslim","author":"Imam Muslim ibn al-Hajjaj al-Naysaburi","introduction":"The Book of Dreams"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":42,"bookId":2,"arabic":"حَدَّثَنَا عَمْرٌو النَّاقِدُ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَابْنُ أَبِي عُمَرَ، جَمِيعًا عَنِ ابْنِ عُيَيْنَةَ،\n - وَاللَّفْظُ لاِبْنِ أَبِي عُمَرَ - حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، قَالَ كُنْتُ أَرَى الرُّؤْيَا\n أُعْرَى مِنْهَا غَيْرَ أَنِّي لاَ أُزَمَّلُ حَتَّى لَقِيتُ أَبَا قَتَادَةَ فَذَكَرْتُ ذَلِكَ لَهُ فَقَالَ سَمِعْتُ رَسُولَ\n اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ الرُّؤْيَا مِنَ اللَّهِ وَالْحُلْمُ مِنَ الشَّيْطَانِ فَإِذَا حَلَمَ أَحَدُكُمْ حُلْمًا\n يَكْرَهُهُ فَلْيَنْفُثْ عَنْ يَسَارِهِ ثَلاَثًا وَلْيَتَعَوَّذْ بِاللَّهِ مِنْ شَرِّهَا فَإِنَّهَا لَنْ تَضُرَّهُ ‏\"‏ ‏.‏","english":{"narrator":"Abu Salama reported:","text":"I used to see dreams (and was so much perturbed) that I began to quiver and have temperature, but did not cover myself with a mantle. I met Abu Qatada and made a mention of that to him. He said: I heard Allah's Messenger (ﷺ) as saying: A good vision comes from Allah and a (bad) dream (hulm) from devil. So when one of you sees a bad dream (hulm) which he does not like, he should spit on his left side thrice and seek refuge with Allah from its evil; then it will not harm him."}},{"id":2,"idInBook":2,"chapterId":42,"bookId":2,"arabic":"وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، مَوْلَى آلِ طَلْحَةَ\n وَعَبْدِ رَبِّهِ وَيَحْيَى ابْنَىْ سَعِيدٍ وَمُحَمَّدِ بْنِ عَمْرِو بْنِ عَلْقَمَةَ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي قَتَادَةَ\n عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ مِثْلَهُ وَلَمْ يَذْكُرْ فِي حَدِيثِهِمْ قَوْلَ أَبِي سَلَمَةَ كُنْتُ أَرَى الرُّؤْيَا\n أُعْرَى مِنْهَا غَيْرَ أَنِّي لاَ أُزَمَّلُ ‏.‏","english":{"narrator":"This hadith has been narrated on the authority of Abu Qatada, but there is no mention of the words of Abu Salama:","text":"\"I saw dreams (which perturbed me) but I did not cover myself with a mantle.\""}},{"id":3,"idInBook":3,"chapterId":42,"bookId":2,"arabic":"وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، ح وَحَدَّثَنَا إِسْحَاقُ،\n بْنُ إِبْرَاهِيمَ وَعَبْدُ بْنُ حُمَيْدٍ قَالاَ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، كِلاَهُمَا عَنِ الزُّهْرِيِّ،\n بِهَذَا الإِسْنَادِ ‏.‏ وَلَيْسَ فِي حَدِيثِهِمَا أُعْرَى مِنْهَا ‏.‏ وَزَادَ فِي حَدِيثِ يُونُسَ ‏\n\"‏ فَلْيَبْصُقْ عَلَى\n يَسَارِهِ حِينَ يَهُبُّ مِنْ نَوْمِهِ ثَلاَثَ مَرَّاتٍ ‏\"‏ ‏.‏","english":{"narrator":"This hadith has been reported on the authority of Zuhri with the same chain of transmitters, but it does not contain the words:","text":"\"I felt disturbed because of that,\" and there is an addition of these words in the hadith transmitted on the authority of Yunus: \"Then spit thrice on the left side when you get up from sleep.\""}},{"id":4,"idInBook":4,"chapterId":42,"bookId":2,"arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا سُلَيْمَانُ، - يَعْنِي ابْنَ بِلاَلٍ - عَنْ \n يَحْيَى بْنِ سَعِيدٍ، قَالَ سَمِعْتُ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ، يَقُولُ سَمِعْتُ أَبَا قَتَادَةَ، يَقُولُ سَمِعْتُ \n رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ الرُّؤْيَا مِنَ اللَّهِ وَالْحُلْمُ مِنَ الشَّيْطَانِ فَإِذَا رَأَى\n أَحَدُكُمْ شَيْئًا يَكْرَهُهُ فَلْيَنْفِثْ عَنْ يَسَارِهِ ثَلاَثَ مَرَّاتٍ وَلْيَتَعَوَّذْ بِاللَّهِ مِنْ شَرِّهَا فَإِنَّهَا لَنْ\n تَضُرَّهُ ‏\"‏ ‏.‏ فَقَالَ إِنْ كُنْتُ لأَرَى الرُّؤْيَا أَثْقَلَ عَلَىَّ مِنْ جَبَلٍ فَمَا هُوَ إِلاَّ أَنْ سَمِعْتُ بِهَذَا الْحَدِيثِ\n فَمَا أُبَالِيهَا ‏.‏","english":{"narrator":"Abu Qatada reported Allah's Messenger (ﷺ) as saying:","text":"A good vision is from Allah and a bad dream (hulm) is from the satan; so if one of you sees anything (in a dream) which he dislikes, he should spit on his left side thrice and seek refuge with Allah from its evil, and then it will never harm him. Abu Salama said: I used to see dreams weighing more heavily upon me than a mountain; but since I heard this hadith I don't care for it (its burden)."}},{"id":5,"idInBook":5,"chapterId":42,"bookId":2,"arabic":"وَحَدَّثَنَاهُ قُتَيْبَةُ، وَمُحَمَّدُ بْنُ رُمْحٍ، عَنِ اللَّيْثِ بْنِ سَعْدٍ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى،\n حَدَّثَنَا عَبْدُ الْوَهَّابِ يَعْنِي الثَّقَفِيَّ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ،\n كُلُّهُمْ عَنْ يَحْيَى بْنِ سَعِيدٍ، بِهَذَا الإِسْنَادِ وَفِي حَدِيثِ الثَّقَفِيِّ قَالَ أَبُو سَلَمَةَ فَإِنْ كُنْتُ لأَرَى\n الرُّؤْيَا ‏.‏ وَلَيْسَ فِي حَدِيثِ اللَّيْثِ وَابْنِ نُمَيْرٍ قَوْلُ أَبِي سَلَمَةَ إِلَى آخِرِ الْحَدِيثِ ‏.‏ وَزَادَ ابْنُ\n رُمْحٍ فِي رِوَايَةِ هَذَا الْحَدِيثِ ‏\n\"‏ وَلْيَتَحَوَّلْ عَنْ جَنْبِهِ الَّذِي كَانَ عَلَيْهِ ‏\"‏ ‏.‏","english":{"narrator":"Abu Salama reported:","text":"I used to see dreams, but the hadith transmitted on the authority of Laith b. Nu`man, the words of Abu Salama at the concluding part of the hadith are not mentioned. Ibn Rumh has reported in the hadith: \"He (one who sleeps) should change the side on which he had been lying before.\""}},{"id":6,"idInBook":6,"chapterId":42,"bookId":2,"arabic":"وَحَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، عَنْ \n عَبْدِ رَبِّهِ بْنِ سَعِيدٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي قَتَادَةَ، عَنْ رَسُولِ اللَّهِ صلى\n الله عليه وسلم أَنَّهُ قَالَ ‏\n\"‏ الرُّؤْيَا الصَّالِحَةُ مِنَ اللَّهِ وَالرُّؤْيَا السَّوْءُ مِنَ الشَّيْطَانِ فَمَنْ رَأَى\n رُؤْيَا فَكَرِهَ مِنْهَا شَيْئًا فَلْيَنْفِثْ عَنْ يَسَارِهِ وَلْيَتَعَوَّذْ بِاللَّهِ مِنَ الشَّيْطَانِ لاَ تَضُرُّهُ وَلاَ يُخْبِرْ\n بِهَا أَحَدًا فَإِنْ رَأَى رُؤْيَا حَسَنَةً فَلْيُبْشِرْ وَلاَ يُخْبِرْ إِلاَّ مَنْ يُحِبُّ ‏\"‏ ‏.‏","english":{"narrator":"Abu Qatada reported Allah's Messenger (ﷺ) as saying:","text":"The good vision are from Allah and the evil dreams are from the satan. If one sees a dream which one does not like, one should spit on one's left side and seek the refuge of Allah from the satan; it will not do one any harm, and one should not disclose it to anyone and if one sees a good vision one should feel pleased but should not disclose it to anyone but whom one loves."}},{"id":7,"idInBook":7,"chapterId":42,"bookId":2,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ خَلاَّدٍ الْبَاهِلِيُّ، وَأَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ الْحَكَمِ، قَالاَ حَدَّثَنَا مُحَمَّدُ،\n بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ رَبِّهِ بْنِ سَعِيدٍ، عَنْ أَبِي سَلَمَةَ، قَالَ إِنْ كُنْتُ لأَرَى الرُّؤْيَا\n تُمْرِضُنِي - قَالَ - فَلَقِيتُ أَبَا قَتَادَةَ فَقَالَ وَأَنَا كُنْتُ لأَرَى الرُّؤْيَا فَتُمْرِضُنِي حَتَّى سَمِعْتُ\n رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ الرُّؤْيَا الصَّالِحَةُ مِنَ اللَّهِ فَإِذَا رَأَى أَحَدُكُمْ مَا يُحِبُّ\n فَلاَ يُحَدِّثُ بِهَا إِلاَّ مَنْ يُحِبُّ وَإِنْ رَأَى مَا يَكْرَهُ فَلْيَتْفِلْ عَنْ يَسَارِهِ ثَلاَثًا وَلْيَتَعَوَّذْ بِاللَّهِ مِنْ\n شَرِّ الشَّيْطَانِ وَشَرِّهَا وَلاَ يُحَدِّثْ بِهَا أَحَدًا فَإِنَّهَا لَنْ تَضُرَّهُ ‏\"‏ ‏.‏","english":{"narrator":"Abu Salama reported:","text":"I used to see (such horrible dreams) that I fell ill. I saw Abu Qatada who also said: I used to see dreams which made me sick until I heard Allah's Messenger (ﷺ) as saying: Good dreams are from Allah, so if any one of you sees which he likes he should not disclose it to one but whom he loves, but if he sees something which he does not like he should spit on his left side thrice and seek refuge with Allah from the mischief of the Satan and its mischief (i.e. of the dream), and he should not relate it to anyone, then it would not harm him."}},{"id":8,"idInBook":8,"chapterId":42,"bookId":2,"arabic":"حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنَا ابْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنْ أَبِي،\n الزُّبَيْرِ عَنْ جَابِرٍ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ قَالَ ‏\n\"‏ إِذَا رَأَى أَحَدُكُمُ الرُّؤْيَا\n يَكْرَهُهَا فَلْيَبْصُقْ عَنْ يَسَارِهِ ثَلاَثًا وَلْيَسْتَعِذْ بِاللَّهِ مِنَ الشَّيْطَانِ ثَلاَثًا وَلْيَتَحَوَّلْ عَنْ جَنْبِهِ\n الَّذِي كَانَ عَلَيْهِ ‏\"‏ ‏.‏","english":{"narrator":"Jabir reported Allah's Messenger (ﷺ) as saying:","text":"If anyone sees a dream which he does not like, he should spit on his left side three times, and seek refuge with Allah from the Satan three times, and let him turn over from the side on which he was sleeping."}},{"id":9,"idInBook":9,"chapterId":42,"bookId":2,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُمَرَ الْمَكِّيُّ، حَدَّثَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ، عَنْ أَيُّوبَ السَّخْتِيَانِيِّ،\n عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا اقْتَرَبَ\n الزَّمَانُ لَمْ تَكَدْ رُؤْيَا الْمُسْلِمِ تَكْذِبُ وَأَصْدَقُكُمْ رُؤْيَا أَصْدَقُكُمْ حَدِيثًا وَرُؤْيَا الْمُسْلِمِ جُزْءٌ مِنْ\n خَمْسٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ وَالرُّؤْيَا ثَلاَثَةٌ فَرُؤْيَا الصَّالِحَةِ بُشْرَى مِنَ اللَّهِ وَرُؤْيَا تَحْزِينٌ\n مِنَ الشَّيْطَانِ وَرُؤْيَا مِمَّا يُحَدِّثُ الْمَرْءُ نَفْسَهُ فَإِنْ رَأَى أَحَدُكُمْ مَا يَكْرَهُ فَلْيَقُمْ فَلْيُصَلِّ وَلاَ\n يُحَدِّثْ بِهَا النَّاسَ ‏\"‏ ‏.‏ قَالَ ‏\"‏ وَأُحِبُّ الْقَيْدَ وَأَكْرَهُ الْغُلَّ وَالْقَيْدُ ثَبَاتٌ فِي الدِّينِ ‏\"‏ ‏.‏ فَلاَ أَدْرِي\n هُوَ فِي الْحَدِيثِ أَمْ قَالَهُ ابْنُ سِيرِينَ ‏.‏","english":{"narrator":"Abu Huraira reported Allah's Messenger (ﷺ) as saying:","text":"When the time draws near (when the Resurrection is near) a believer's dream can hardly be false. And the truest vision will be of one who is himself the most truthful in speech, for the vision of a Muslim is the forty-fifth part of Prophecy, and dreams are of three types: one good dream which is a sort of good tidings from Allah; the evil dream which causes pain is from the satan; and the third one is a suggestion of one's own mind; so if any one of you sees a dream which he does not like he should stand up and offer prayer and he should not relate it to people, and he said: I would love to see fetters (in the dream), but I dislike wearing of necklace, for the fetters is (an indication of) one's steadfastness in religion. The narrator said: I do not know whether this is a part of the hadith or the words of Ibn Sirin."}},{"id":10,"idInBook":10,"chapterId":42,"bookId":2,"arabic":"وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ أَيُّوبَ، بِهَذَا الإِسْنَادِ\n وَقَالَ فِي الْحَدِيثِ قَالَ أَبُو هُرَيْرَةَ فَيُعْجِبُنِي الْقَيْدُ وَأَكْرَهُ الْغُلَّ وَالْقَيْدُ ثَبَاتٌ فِي الدِّينِ ‏.‏\n وَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ رُؤْيَا الْمُؤْمِنِ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ\n ‏\"‏ ‏.‏","english":{"narrator":"Abu Huraira reported:","text":"I love to see fetters but I hate necklace (in a dream), for fetters signifies one's steadfastness in religion, and he also reported Allah's Messenger (ﷺ) as saying: The vision of a believer is forty-sixth part of Prophecy."}},{"id":11,"idInBook":11,"chapterId":42,"bookId":2,"arabic":"حَدَّثَنِي أَبُو الرَّبِيعِ، حَدَّثَنَا حَمَّادٌ، - يَعْنِي ابْنَ زَيْدٍ - حَدَّثَنَا أَيُّوبُ، وَهِشَامٌ، عَنْ \n مُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ إِذَا اقْتَرَبَ الزَّمَانُ ‏.‏ وَسَاقَ الْحَدِيثَ وَلَمْ يَذْكُرْ فِيهِ النَّبِيَّ صلى\n الله عليه وسلم ‏.‏","english":{"narrator":"This hadith has been transmitted on the authority of Abu Huraira and the words are:","text":"\"When the time draws near,\" the rest of the hadith is the same."}},{"id":12,"idInBook":12,"chapterId":42,"bookId":2,"arabic":"وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا مُعَاذُ بْنُ هِشَامٍ، حَدَّثَنَا أَبِي، عَنْ قَتَادَةَ،\n عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ وَأَدْرَجَ فِي الْحَدِيثِ\n قَوْلَهُ وَأَكْرَهُ الْغُلَّ ‏.‏ إِلَى تَمَامِ الْكَلاَمِ وَلَمْ يَذْكُرِ ‏\n\"‏ الرُّؤْيَا جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ\n النُّبُوَّةِ ‏\"‏ ‏.‏","english":{"narrator":"Muhammad b. Sirin reported from Abu Huraira a hadith from Allah's Apostle (ﷺ) and he mentioned in his hadith his words:","text":"\"I dislike shackles,\" up to the end of his statement, but he made no mention of this: \"A vision is a forty-sixth part of Prophecy.\""}},{"id":13,"idInBook":13,"chapterId":42,"bookId":2,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، وَأَبُو دَاوُدَ ح\n وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، كُلُّهُمْ عَنْ شُعْبَةَ، ح وَحَدَّثَنَا عُبَيْدُ،\n اللَّهِ بْنُ مُعَاذٍ - وَاللَّفْظُ لَهُ - حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، عَنْ \n عُبَادَةَ بْنِ الصَّامِتِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ رُؤْيَا الْمُؤْمِنِ جُزْءٌ مِنْ\n سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ ‏\"‏ ‏.‏","english":{"narrator":"`Ubada b. as-Samit reported Allah's Messenger (ﷺ) as saying:","text":"The vision of a believer is the forty-sixth part of Prophecy."}},{"id":14,"idInBook":14,"chapterId":42,"bookId":2,"arabic":"وَحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ ثَابِتٍ الْبُنَانِيِّ، عَنْ أَنَسِ،\n بْنِ مَالِكٍ عَنِ النَّبِيِّ صلى الله عليه وسلم مِثْلَ ذَلِكَ ‏.‏","english":{"narrator":"","text":"This hadith has been narrated on the authority of Anas b. Malik through another chain of transmitters."}},{"id":15,"idInBook":15,"chapterId":42,"bookId":2,"arabic":"حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنِ ابْنِ،\n الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ رُؤْيَا الْمُؤْمِنِ\n جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ ‏\"‏ ‏.‏","english":{"narrator":"Abu Huraira reported Allah's Messenger (ﷺ) as saying:","text":"Verily the vision of a believer is one of the forty-sixth part of Prophecy."}},{"id":16,"idInBook":16,"chapterId":42,"bookId":2,"arabic":"وَحَدَّثَنَا إِسْمَاعِيلُ بْنُ الْخَلِيلِ، أَخْبَرَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنِ الأَعْمَشِ، ح وَحَدَّثَنَا \n ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ\n اللَّهِ صلى الله عليه وسلم ‏\"‏ رُؤْيَا الْمُسْلِمِ يَرَاهَا أَوْ تُرَى لَهُ ‏\"‏ ‏.‏ وَفِي حَدِيثِ ابْنِ مُسْهِرٍ ‏\"‏\n الرُّؤْيَا الصَّالِحَةُ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ ‏\"‏ ‏.‏","english":{"narrator":"Abu Huraira reported Allah's Messenger (ﷺ) as saying:","text":"The vision of a Muslim which he sees or which is shown to him, and in the hadith transmitted on the authority of Ibn Mushir (the words are): \"The pious dream is the forty-sixth part of Prophecy.\""}},{"id":17,"idInBook":17,"chapterId":42,"bookId":2,"arabic":"وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ يَحْيَى بْنِ أَبِي كَثِيرٍ، قَالَ سَمِعْتُ \n أَبِي يَقُولُ، حَدَّثَنَا أَبُو سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏\n رُؤْيَا الرَّجُلِ الصَّالِحِ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ ‏\"‏ ‏.‏","english":{"narrator":"Abu Huraira reported Allah's Messenger (ﷺ) as saying:","text":"The vision of a pious man is the forty-sixth part of Prophecy."}},{"id":18,"idInBook":18,"chapterId":42,"bookId":2,"arabic":"وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، حَدَّثَنَا عَلِيٌّ، - يَعْنِي ابْنَ الْمُبَارَكِ\n - ح وَحَدَّثَنَا أَحْمَدُ بْنُ الْمُنْذِرِ، حَدَّثَنَا عَبْدُ الصَّمَدِ، حَدَّثَنَا حَرْبٌ، - يَعْنِي ابْنَ شَدَّادٍ - كِلاَهُمَا\n عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، بِهَذَا الإِسْنَادِ ‏.‏","english":{"narrator":"","text":"This hadith has been narrated on the authority of Yahya b. Abu Kathir with the same chain of transmitters."}},{"id":19,"idInBook":19,"chapterId":42,"bookId":2,"arabic":"وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، عَنْ \n أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِ حَدِيثِ عَبْدِ اللَّهِ بْنِ يَحْيَى بْنِ أَبِي كَثِيرٍ\n عَنْ أَبِيهِ ‏.‏","english":{"narrator":"","text":"This hadith has been narrated on the authority of Abu Huraira through another chain of transmitters."}},{"id":20,"idInBook":20,"chapterId":42,"bookId":2,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي،\n قَالاَ جَمِيعًا حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه\n وسلم ‏\n\"‏ الرُّؤْيَا الصَّالِحَةُ جُزْءٌ مِنْ سَبْعِينَ جُزْءًا مِنَ النُّبُوَّةِ ‏\"‏ ‏.‏","english":{"narrator":"Ibn `Umar reported Allah's Messenger (ﷺ) as saying:","text":"The pious dreams are the seventieth part of Prophecy."}},{"id":21,"idInBook":21,"chapterId":42,"bookId":2,"arabic":"وَحَدَّثَنَاهُ ابْنُ الْمُثَنَّى، وَعُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالاَ حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، بِهَذَا\n الإِسْنَادِ ‏.‏","english":{"narrator":"","text":"This hadith has been reported on the authority of `Ubaidullah with the same chain of transmitters."}},{"id":22,"idInBook":22,"chapterId":42,"bookId":2,"arabic":"وَحَدَّثَنَاهُ قُتَيْبَةُ، وَابْنُ، رُمْحٍ عَنِ اللَّيْثِ بْنِ سَعْدٍ، ح وَحَدَّثَنَا ابْنُ رَافِعٍ، حَدَّثَنَا ابْنُ،\n أَبِي فُدَيْكٍ أَخْبَرَنَا الضَّحَّاكُ، - يَعْنِي ابْنَ عُثْمَانَ - كِلاَهُمَا عَنْ نَافِعٍ، بِهَذَا الإِسْنَادِ وَفِي\n حَدِيثِ اللَّيْثِ قَالَ نَافِعٌ حَسِبْتُ أَنَّ ابْنَ عُمَرَ قَالَ ‏\n\"‏ جُزْءٌ مِنْ سَبْعِينَ جُزْءًا مِنَ النُّبُوَّةِ ‏\"‏\n ‏.‏","english":{"narrator":"A hadith like this has been reported on the authority of Nafi` with the same chain of transmitters (and the words are):","text":"\"I think Ibn `Umar said: The seventieth part from Prophecy.\""}},{"id":23,"idInBook":23,"chapterId":42,"bookId":2,"arabic":"حَدَّثَنَا أَبُو الرَّبِيعِ، سُلَيْمَانُ بْنُ دَاوُدَ الْعَتَكِيُّ حَدَّثَنَا حَمَّادٌ، - يَعْنِي ابْنَ زَيْدٍ - حَدَّثَنَا \n أَيُّوبُ، وَهِشَامٌ، عَنْ مُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏\n مَنْ رَآنِي فِي الْمَنَامِ فَقَدْ رَآنِي فَإِنَّ الشَّيْطَانَ لاَ يَتَمَثَّلُ بِي ‏\"‏ ‏.‏","english":{"narrator":"Abu Huraira reported Allah's Messenger (ﷺ) as saying:","text":"He who saw me in a dream in fact saw me, for the satan does not appear in my form."}},{"id":24,"idInBook":24,"chapterId":42,"bookId":2,"arabic":"وَحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ، قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ،\n شِهَابٍ حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله\n عليه وسلم يَقُولُ ‏\n\"‏ مَنْ رَآنِي فِي الْمَنَامِ فَسَيَرَانِي فِي الْيَقَظَةِ أَوْ لَكَأَنَّمَا رَآنِي فِي الْيَقَظَةِ\n لاَ يَتَمَثَّلُ الشَّيْطَانُ بِي ‏\"‏ ‏.‏","english":{"narrator":"Abu Huraira reported:","text":"I heard Allah's Messenger (ﷺ) as saying: He who saw me in a dream would soon see me in the state of wakefulness, or as if he saw me in a state of wakefulness, for the satan does not appear in my form."}},{"id":25,"idInBook":25,"chapterId":42,"bookId":2,"arabic":"وَقَالَ فَقَالَ أَبُو سَلَمَةَ قَالَ أَبُو قَتَادَةَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏\n مَنْ رَآنِي فَقَدْ رَأَى الْحَقَّ ‏\"‏ ‏.‏","english":{"narrator":"Abu Qatada reported Allah's Messenger (ﷺ) as saying:","text":"He who saw me in dream in fact saw the truth (what is true)."}},{"id":26,"idInBook":26,"chapterId":42,"bookId":2,"arabic":"وَحَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا ابْنُ أَخِي الزُّهْرِيِّ،\n حَدَّثَنَا عَمِّي، ‏.‏ فَذَكَرَ الْحَدِيثَيْنِ جَمِيعًا بِإِسْنَادَيْهِمَا سَوَاءً مِثْلَ حَدِيثِ يُونُسَ ‏.‏","english":{"narrator":"","text":"The above two hadith have been narrated likewise through another chain of transmitters."}},{"id":27,"idInBook":27,"chapterId":42,"bookId":2,"arabic":"وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنَا ابْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنْ أَبِي،\n الزُّبَيْرِ عَنْ جَابِرٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ رَآنِي فِي النَّوْمِ فَقَدْ رَآنِي\n إِنَّهُ لاَ يَنْبَغِي لِلشَّيْطَانِ أَنْ يَتَمَثَّلَ فِي صُورَتِي ‏\"‏ ‏.‏ وَقَالَ ‏\"‏ إِذَا حَلَمَ أَحَدُكُمْ فَلاَ يُخْبِرْ أَحَدًا\n بِتَلَعُّبِ الشَّيْطَانِ بِهِ فِي الْمَنَامِ ‏\"‏ ‏.‏","english":{"narrator":"Jabir reported Allah's Messenger (ﷺ) as saying:","text":"He who saw me in sleep in fact saw me, for it is not possible for the satan to appear in my form; and he also said: When any one of you sees a hulm he should not inform anyone, for it is a sort of vain sport of devil in the state of sleep."}},{"id":28,"idInBook":28,"chapterId":42,"bookId":2,"arabic":"وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا رَوْحٌ، حَدَّثَنَا زَكَرِيَّاءُ بْنُ إِسْحَاقَ، حَدَّثَنِي أَبُو الزُّبَيْرِ،\n أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ رَآنِي فِي\n النَّوْمِ فَقَدْ رَآنِي فَإِنَّهُ لاَ يَنْبَغِي لِلشَّيْطَانِ أَنْ يَتَشَبَّهَ بِي ‏\"‏ ‏.‏","english":{"narrator":"Jabir b. `Abdullah reported Allah's Messenger (ﷺ) as saying:","text":"He who saw me in a dream in fact saw me, for the satan cannot assume my form."}},{"id":29,"idInBook":29,"chapterId":42,"bookId":2,"arabic":"حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنَا ابْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنْ أَبِي،\n الزُّبَيْرِ عَنْ جَابِرٍ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ قَالَ لأَعْرَابِيٍّ جَاءَهُ فَقَالَ إِنِّي\n حَلَمْتُ أَنَّ رَأْسِي قُطِعَ فَأَنَا أَتَّبِعُهُ فَزَجَرَهُ النَّبِيُّ صلى الله عليه وسلم وَقَالَ ‏\n\"‏ لاَ تُخْبِرْ\n بِتَلَعُّبِ الشَّيْطَانِ بِكَ فِي الْمَنَامِ ‏\"‏ ‏.‏","english":{"narrator":"Jabir reported Allah's Messenger (ﷺ) as saying:","text":"There came to him (the Holy Prophet) a desert Arab and said: I saw in a dream that I had been beheaded and I had been following it (the severed head). Allah's Apostle (ﷺ) reprimanded him saying: Do not inform about the vain sporting of devil with you during the night."}},{"id":30,"idInBook":30,"chapterId":42,"bookId":2,"arabic":"وَحَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي سُفْيَانَ، عَنْ \n جَابِرٍ، قَالَ جَاءَ أَعْرَابِيٌّ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ رَأَيْتُ فِي\n الْمَنَامِ كَأَنَّ رَأْسِي ضُرِبَ فَتَدَحْرَجَ فَاشْتَدَدْتُ عَلَى أَثَرِهِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه\n وسلم لِلأَعْرَابِيِّ ‏\"‏ لاَ تُحَدِّثِ النَّاسَ بِتَلَعُّبِ الشَّيْطَانِ بِكَ فِي مَنَامِكَ ‏\"‏ ‏.‏ وَقَالَ سَمِعْتُ النَّبِيَّ\n صلى الله عليه وسلم بَعْدُ يَخْطُبُ فَقَالَ ‏\"‏ لاَ يُحَدِّثَنَّ أَحَدُكُمْ بِتَلَعُّبِ الشَّيْطَانِ بِهِ فِي مَنَامِهِ\n ‏\"‏ ‏.‏","english":{"narrator":"Jabir reported that there came to Allah's Apostle (ﷺ) a desert Arab and said:","text":"Allah's Messenger, I saw in the state of sleep as if my head had been cut off and I had been moving on haltingly after it. Thereupon Allah's Messenger (ﷺ) said to that desert Arab: Do not narrate to the people the vain sporting of satan with you in your sleep and (the narrator) also said: I heard Allah's Messenger (ﷺ) in his subsequent address: None amongst you should narrate the vain sporting of devil with him in the dream."}},{"id":31,"idInBook":31,"chapterId":42,"bookId":2,"arabic":"وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو سَعِيدٍ الأَشَجُّ قَالاَ حَدَّثَنَا وَكِيعٌ، عَنِ الأَعْمَشِ،\n عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرٍ، قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ\n اللَّهِ رَأَيْتُ فِي الْمَنَامِ كَأَنَّ رَأْسِي قُطِعَ ‏.‏ قَالَ فَضَحِكَ النَّبِيُّ صلى الله عليه وسلم وَقَالَ\n ‏\"‏ إِذَا لَعِبَ الشَّيْطَانُ بِأَحَدِكُمْ فِي مَنَامِهِ فَلاَ يُحَدِّثْ بِهِ النَّاسَ ‏\"‏ ‏.‏ وَفِي رِوَايَةِ أَبِي بَكْرٍ ‏\"‏\n إِذَا لُعِبَ بِأَحَدِكُمْ ‏\"‏ ‏.‏ وَلَمْ يَذْكُرِ الشَّيْطَانَ ‏.‏","english":{"narrator":"Jabir reported that a person came to Allah's Apostle (ﷺ) and said:","text":"Allah's Messenger, I have seen in the state of sleep as if my head had been cut off. Thereupon Allah's Apostle (ﷺ) laughed and said: When the satan plays with any one of you in the state of sleep, do not mention it to the people; and in the hadith transmitted by Abu Bakr (the words are): \"If one of you is played with, and he did not make any mention of the word: \"Satan.\""}},{"id":32,"idInBook":32,"chapterId":42,"bookId":2,"arabic":"حَدَّثَنَا حَاجِبُ بْنُ الْوَلِيدِ، حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ، عَنِ الزُّبَيْدِيِّ، أَخْبَرَنِي الزُّهْرِيُّ،\n عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، أَنَّ ابْنَ عَبَّاسٍ، أَوْ أَبَا هُرَيْرَةَ كَانَ يُحَدِّثُ أَنَّ رَجُلاً، أَتَى رَسُولَ\n اللَّهِ صلى الله عليه وسلم ح \n وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى التُّجِيبِيُّ، - وَاللَّفْظُ لَهُ - أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ،\n عَنِ ابْنِ شِهَابٍ، أَنَّ عُبَيْدَ اللَّهِ بْنَ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، أَخْبَرَهُ أَنَّ ابْنَ عَبَّاسٍ كَانَ يُحَدِّثُ أَنَّ\n رَجُلاً أَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي أَرَى اللَّيْلَةَ فِي الْمَنَامِ\n ظُلَّةً تَنْطِفُ السَّمْنَ وَالْعَسَلَ فَأَرَى النَّاسَ يَتَكَفَّفُونَ مِنْهَا بِأَيْدِيهِمْ فَالْمُسْتَكْثِرُ وَالْمُسْتَقِلُّ وَأَرَى\n سَبَبًا وَاصِلاً مِنَ السَّمَاءِ إِلَى الأَرْضِ فَأَرَاكَ أَخَذْتَ بِهِ فَعَلَوْتَ ثُمَّ أَخَذَ بِهِ رَجُلٌ مِنْ بَعْدِكَ\n فَعَلاَ ثُمَّ أَخَذَ بِهِ رَجُلٌ آخَرُ فَعَلاَ ثُمَّ أَخَذَ بِهِ رَجُلٌ آخَرُ فَانْقَطَعَ بِهِ ثُمَّ وُصِلَ لَهُ فَعَلاَ ‏.‏ قَالَ\n أَبُو بَكْرٍ يَا رَسُولَ اللَّهِ بِأَبِي أَنْتَ وَاللَّهِ لَتَدَعَنِّي فَلأَعْبُرَنَّهَا ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله\n عليه وسلم ‏\"‏ اعْبُرْهَا ‏\"‏ ‏.‏ قَالَ أَبُو بَكْرٍ أَمَّا الظُّلَّةُ فَظُلَّةُ الإِسْلاَمِ وَأَمَّا الَّذِي يَنْطِفُ مِنَ السَّمْنِ\n وَالْعَسَلِ فَالْقُرْآنُ حَلاَوَتُهُ وَلِينُهُ وَأَمَّا مَا يَتَكَفَّفُ النَّاسُ مِنْ ذَلِكَ فَالْمُسْتَكْثِرُ مِنَ الْقُرْآنِ وَالْمُسْتَقِلُّ\n وَأَمَّا السَّبَبُ الْوَاصِلُ مِنَ السَّمَاءِ إِلَى الأَرْضِ فَالْحَقُّ الَّذِي أَنْتَ عَلَيْهِ تَأْخُذُ بِهِ فَيُعْلِيكَ اللَّهُ\n بِهِ ثُمَّ يَأْخُذُ بِهِ رَجُلٌ مِنْ بَعْدِكَ فَيَعْلُو بِهِ ثُمَّ يَأْخُذُ بِهِ رَجُلٌ آخَرُ فَيَعْلُو بِهِ ثُمَّ يَأْخُذُ بِهِ رَجُلٌ\n آخَرُ فَيَنْقَطِعُ بِهِ ثُمَّ يُوصَلُ لَهُ فَيَعْلُو بِهِ ‏.‏ فَأَخْبِرْنِي يَا رَسُولَ اللَّهِ بِأَبِي أَنْتَ أَصَبْتُ أَمْ أَخْطَأْتُ\n قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَصَبْتَ بَعْضًا وَأَخْطَأْتَ بَعْضًا ‏\"‏ ‏.‏ قَالَ فَوَاللَّهِ\n يَا رَسُولَ اللَّهِ لَتُحَدِّثَنِّي مَا الَّذِي أَخْطَأْتُ قَالَ ‏\"‏ لاَ تُقْسِمْ ‏\"‏ ‏.‏","english":{"narrator":"It is reported either on the authority of Ibn `Abbas or on the authority of Abu Huraira that a person came to Allah's Messenger (ﷺ) and said:","text":"Allah's Messenger, I saw while I was sleeping during the night (this vision) that there was a canopy from which butter and honey were trickling and I also saw people collecting them in the palms of their hands, some more, some less, and I also saw a rope connecting the earth with the sky and I saw you catching hold of it and rising towards the heaven; then another person after you catching hold of it and rising towards (Heaven); then another person catching hold of it, but it was broken while it was rejoined for him and he also climbed up. Abu Bakr said: Allah's Messenger, may my father be sacrificed for you, by Allah, allow me to interpret it. Allah's Messenger (ﷺ) said: Well, give its interpretation. Thereupon Abu Bakr said: The canopy signifies the canopy of Islam and that what trickles out of it in the form of butter and honey is the Holy Qur'an and its sweetness and softness and what the people get hold of it in their palms implies major portion of the Qur'an or the small portion; and so far as the rope joining the sky with the earth is concerned, it is the Truth by which you stood (in the worldly life) and by which Allah would raise you (to Heaven). Then the person after you would take hold of it and he would also climb up with the help of it. Then another person would take hold of it and climb up with the help of it. Then another person would take hold of it and it would be broken; then it would be rejoined for him and he would climb up with the help of it. Allah's Messenger, may my father be taken as a ransom for you, tell me whether I have interpreted it correctly or I have made an error. Allah's Messenger (ﷺ) said: You have interpreted a part of it correctly and you have erred in interpreting a part of it. Thereupon he said: Allah's Messenger, by Allah, tell me that part where I have committed an error. Thereupon he said: Don't take an oath."}},{"id":33,"idInBook":33,"chapterId":42,"bookId":2,"arabic":"وَحَدَّثَنَاهُ ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ،\n عَنِ ابْنِ عَبَّاسٍ، قَالَ جَاءَ رَجُلٌ النَّبِيَّ صلى الله عليه وسلم مُنْصَرَفَهُ مِنْ أُحُدٍ فَقَالَ يَا رَسُولَ\n اللَّهِ إِنِّي رَأَيْتُ هَذِهِ اللَّيْلَةَ فِي الْمَنَامِ ظُلَّةً تَنْطِفُ السَّمْنَ وَالْعَسَلَ ‏.‏ بِمَعْنَى حَدِيثِ يُونُسَ ‏.‏","english":{"narrator":"Ibn `Abbas reported that there came to Allah's Apostle (ﷺ) a person as he was returning from Uhud and he said:","text":"Allah's Messenger, I saw in sleep during the night a canopy trickling butter and honey; the rest of the hadith is the same."}},{"id":34,"idInBook":34,"chapterId":42,"bookId":2,"arabic":"وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ،\n اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ عَنِ ابْنِ عَبَّاسٍ، أَوْ أَبِي هُرَيْرَةَ قَالَ عَبْدُ الرَّزَّاقِ كَانَ مَعْمَرٌ أَحْيَانًا\n يَقُولُ عَنِ ابْنِ عَبَّاسٍ وَأَحْيَانًا يَقُولُ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَجُلاً أَتَى رَسُولَ اللَّهِ صلى الله\n عليه وسلم فَقَالَ إِنِّي أَرَى اللَّيْلَةَ ظُلَّةً ‏.‏ بِمَعْنَى حَدِيثِهِمْ ‏.‏","english":{"narrator":"It is reported either on the authority of Ibn 'Abbas or on that of Abu Huraira that a person came to Allah's Messenger (ﷺ) and said:","text":"Verily I saw during the night a canopy; the rest of the hadith is the same."}},{"id":35,"idInBook":35,"chapterId":42,"bookId":2,"arabic":"وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، حَدَّثَنَا سُلَيْمَانُ،\n - وَهُوَ ابْنُ كَثِيرٍ - عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ\n اللَّهِ صلى الله عليه وسلم كَانَ مِمَّا يَقُولُ لأَصْحَابِهِ ‏\n\"‏ مَنْ رَأَى مِنْكُمْ رُؤْيَا فَلْيَقُصَّهَا أَعْبُرْهَا\n لَهُ ‏\"‏ ‏.‏ قَالَ فَجَاءَ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ رَأَيْتُ ظُلَّةً ‏.‏ بِنَحْوِ حَدِيثِهِمْ ‏.‏","english":{"narrator":"Ibn `Abbas reported that Allah's Messenger (ﷺ) used to say to his Companions:","text":"He who amongst you sees a vision should narrate it and I would interpret it for him, and a person came and said: Allah's Messenger, I saw a canopy. The rest of the hadith is the same."}},{"id":36,"idInBook":36,"chapterId":42,"bookId":2,"arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ الْبُنَانِيِّ،\n عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ رَأَيْتُ ذَاتَ لَيْلَةٍ فِيمَا يَرَى\n النَّائِمُ كَأَنَّا فِي دَارِ عُقْبَةَ بْنِ رَافِعٍ فَأُتِينَا بِرُطَبٍ مِنْ رُطَبِ ابْنِ طَابٍ فَأَوَّلْتُ الرِّفْعَةَ لَنَا\n فِي الدُّنْيَا وَالْعَاقِبَةَ فِي الآخِرَةِ وَأَنَّ دِينَنَا قَدْ طَابَ ‏\"‏ ‏.‏","english":{"narrator":"Anas b. Malik reported Allah's Messenger (ﷺ) as saying:","text":"I saw during the night that which a person sees during the sleep as if we are in the house of `Uqba b. Rafi` that there was brought to us the fresh dates of Ibn Tab. I interpreted it as the sublimity for us in the world and good ending in the Hereafter and that our religion is good."}},{"id":37,"idInBook":37,"chapterId":42,"bookId":2,"arabic":"وَحَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، أَخْبَرَنِي أَبِي، حَدَّثَنَا صَخْرُ بْنُ جُوَيْرِيَةَ، عَنْ نَافِعٍ،\n أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، حَدَّثَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَرَانِي فِي الْمَنَامِ\n أَتَسَوَّكُ بِسِوَاكٍ فَجَذَبَنِي رَجُلاَنِ أَحَدُهُمَا أَكْبَرُ مِنَ الآخَرِ فَنَاوَلْتُ السِّوَاكَ الأَصْغَرَ مِنْهُمَا\n فَقِيلَ لِي كَبِّرْ ‏.‏ فَدَفَعْتُهُ إِلَى الأَكْبَرِ ‏\"‏ ‏.‏","english":{"narrator":"Abdullah b. `Umar reported Allah's Messenger (ﷺ) as saying:","text":"I saw in a dream that I was using miswak and two persons contended to get it from me, one being older than the other one. I gave the miswak to the younger one. It was said to me to give that to the older one and I gave it to the older one."}},{"id":38,"idInBook":38,"chapterId":42,"bookId":2,"arabic":"حَدَّثَنَا أَبُو عَامِرٍ عَبْدُ اللَّهِ بْنُ بَرَّادٍ الأَشْعَرِيُّ، وَأَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلاَءِ - وَتَقَارَبَا\n فِي اللَّفْظِ - قَالاَ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، جَدِّهِ عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ\n صلى الله عليه وسلم قَالَ ‏\n\"‏ رَأَيْتُ فِي الْمَنَامِ أَنِّي أُهَاجِرُ مِنْ مَكَّةَ إِلَى أَرْضٍ بِهَا نَخْلٌ\n فَذَهَبَ وَهَلِي إِلَى أَنَّهَا الْيَمَامَةُ أَوْ هَجَرُ فَإِذَا هِيَ الْمَدِينَةُ يَثْرِبُ وَرَأَيْتُ فِي رُؤْيَاىَ هَذِهِ\n أَنِّي هَزَزْتُ سَيْفًا فَانْقَطَعَ صَدْرُهُ فَإِذَا هُوَ مَا أُصِيبَ مِنَ الْمُؤْمِنِينَ يَوْمَ أُحُدٍ ثُمَّ هَزَزْتُهُ أُخْرَى\n فَعَادَ أَحْسَنَ مَا كَانَ فَإِذَا هُوَ مَا جَاءَ اللَّهُ بِهِ مِنَ الْفَتْحِ وَاجْتِمَاعِ الْمُؤْمِنِينَ وَرَأَيْتُ فِيهَا\n أَيْضًا بَقَرًا وَاللَّهُ خَيْرٌ فَإِذَا هُمُ النَّفَرُ مِنَ الْمُؤْمِنِينَ يَوْمَ أُحُدٍ وَإِذَا الْخَيْرُ مَا جَاءَ اللَّهُ بِهِ مِنَ\n الْخَيْرِ بَعْدُ وَثَوَابُ الصِّدْقِ الَّذِي آتَانَا اللَّهُ بَعْدُ يَوْمَ بَدْرٍ ‏\"‏ ‏.‏","english":{"narrator":"Abu Musa reported Allah's Messenger (ﷺ) as saying:","text":"I dreamt (while asleep) that I was about to migrate from Mecca to a land abounding in palm trees and I guessed that it would be Yamama or Hajar, but it was the city of Yathrib (the old name of Medina), and I saw in this dream of mine that I was brandishing a sword and its upper end was broken and this is what fell (in the form of misfortune to the believers on the Day of Uhud). I brandished (the sword) for the second time and it became all right and this is what came to be true when Allah granted us victory and solidarity of the believers. And I saw therein cows also and Allah is the Doer of good. These meant the group from amongst the believers on the Day of Uhud and the goodness which Allah brought after that and the reward of attestation of his Truth which Allah brought to us after the Day of Badr."}},{"id":39,"idInBook":39,"chapterId":42,"bookId":2,"arabic":"حَدَّثَنِي مُحَمَّدُ بْنُ سَهْلٍ التَّمِيمِيُّ، حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنْ عَبْدِ اللَّهِ،\n بْنِ أَبِي حُسَيْنٍ حَدَّثَنَا نَافِعُ بْنُ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَدِمَ مُسَيْلِمَةُ الْكَذَّابُ عَلَى عَهْدِ\n النَّبِيِّ صلى الله عليه وسلم الْمَدِينَةَ فَجَعَلَ يَقُولُ إِنْ جَعَلَ لِي مُحَمَّدٌ الأَمْرَ مِنْ بَعْدِهِ تَبِعْتُهُ\n ‏.‏ فَقَدِمَهَا فِي بَشَرٍ كَثِيرٍ مِنْ قَوْمِهِ فَأَقْبَلَ إِلَيْهِ النَّبِيُّ صلى الله عليه وسلم وَمَعَهُ ثَابِتُ بْنُ\n قَيْسِ بْنِ شَمَّاسٍ وَفِي يَدِ النَّبِيِّ صلى الله عليه وسلم قِطْعَةُ جَرِيدَةٍ حَتَّى وَقَفَ عَلَى مُسَيْلِمَةَ\n فِي أَصْحَابِهِ قَالَ ‏\"‏ لَوْ سَأَلْتَنِي هَذِهِ الْقِطْعَةَ مَا أَعْطَيْتُكَهَا وَلَنْ أَتَعَدَّى أَمْرَ اللَّهِ فِيكَ وَلَئِنْ\n أَدْبَرْتَ لَيَعْقِرَنَّكَ اللَّهُ وَإِنِّي لأُرَاكَ الَّذِي أُرِيتُ فِيكَ مَا أُرِيتُ وَهَذَا ثَابِتٌ يُجِيبُكَ عَنِّي ‏\"‏ ‏.‏\n ثُمَّ انْصَرَفَ عَنْهُ ‏.‏ \n فَقَالَ ابْنُ عَبَّاسٍ فَسَأَلْتُ عَنْ قَوْلِ النَّبِيِّ، صلى الله عليه وسلم ‏\"‏ إِنَّكَ أَرَى الَّذِي\n أُرِيتُ فِيكَ مَا أُرِيتُ ‏\"‏ ‏.‏ فَأَخْبَرَنِي أَبُو هُرَيْرَةَ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ بَيْنَا\n أَنَا نَائِمٌ رَأَيْتُ فِي يَدَىَّ سِوَارَيْنِ مِنْ ذَهَبٍ فَأَهَمَّنِي شَأْنُهُمَا فَأُوحِيَ إِلَىَّ فِي الْمَنَامِ أَنِ\n انْفُخْهُمَا فَنَفَخْتُهُمَا فَطَارَا فَأَوَّلْتُهُمَا كَذَّابَيْنِ يَخْرُجَانِ مِنْ بَعْدِي فَكَانَ أَحَدُهُمَا الْعَنْسِيَّ\n صَاحِبَ صَنْعَاءَ وَالآخَرُ مُسَيْلِمَةَ صَاحِبَ الْيَمَامَةِ ‏\"‏ ‏.‏","english":{"narrator":"Ibn `Abbas reported that Musailima al-Kadhdhab (the greater liar) (who claimed prophethood after the death of the Holy Prophet) came during the lifetime of Allah's Apostle (ﷺ) to Medina and said:","text":"If Muhammad assigns his caliphate to me after him I would follow him, and there came along with him a large body of persons of his tribe, and there came to him Allah's Apostle (ﷺ) along with Thabit b. Qais b. Shammas and the Prophet of Allah (ﷺ) had a piece of wood in his hand until he came in front of Musailima in the company of his companions and said: If you were to ask even this (wood), I would never give it to you. I am not going to do anything against the will of God in your case, and if you turn away (from what I say) Allah will destroy you. And I find you in the same state which I was shown (in the dream) and here is Thabit and he would answer you on my behalf. He (the Holy Prophet) then went back. Ibn `Abbas said: I asked the (meaning of the) words of Allah's Apostle (ﷺ): \"You are the same what I was made to see about you in my dream.\" and Abu Huraira reported that Allah's Messenger (ﷺ) said: While I was sleeping I saw in my hands two gold bangles. This had a disturbing effect upon me and I was given a suggestion in the sleep that I should blow over them, so I blew over them and they were no more. And I interpreted these (two bangles) as the two great liars who would appear after me and the one amongst them was Al-`Anasi the inhabitant of San`a' and the other one Musailima the inhabitant of Yamama."}},{"id":40,"idInBook":40,"chapterId":42,"bookId":2,"arabic":"وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ\n هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ\n رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ بَيْنَا أَنَا نَائِمٌ أُتِيتُ خَزَائِنَ الأَرْضِ فَوَضَعَ فِي يَدَىَّ\n أُسْوَارَيْنِ مِنْ ذَهَبٍ فَكَبُرَا عَلَىَّ وَأَهَمَّانِي فَأُوحِيَ إِلَىَّ أَنِ انْفُخْهُمَا فَنَفَخْتُهُمَا فَذَهَبَا فَأَوَّلْتُهُمَا\n الْكَذَّابَيْنِ اللَّذَيْنِ أَنَا بَيْنَهُمَا صَاحِبَ صَنْعَاءَ وَصَاحِبَ الْيَمَامَةِ ‏\"‏ ‏.‏","english":{"narrator":"Abu Huraira reported Allah's Messenger (ﷺ) as saying:","text":"While I was sleeping, the treasures of the earth were presented to me and I was made to wear in my hands two gold bangles. I felt a sort of burden upon me and I was disturbed and it was suggested to me that I should blow over them, so I blew and both of them disappeared. I interpreted them as two great liars who would appear at any time, one is the inhabitant of San`a' and the other is that of Yamama."}},{"id":41,"idInBook":41,"chapterId":42,"bookId":2,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا أَبِي، عَنْ أَبِي رَجَاءٍ الْعُطَارِدِيِّ،\n عَنْ سَمُرَةَ بْنِ جُنْدَبٍ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا صَلَّى الصُّبْحَ أَقْبَلَ عَلَيْهِمْ\n بِوَجْهِهِ فَقَالَ ‏\n\"‏ هَلْ رَأَى أَحَدٌ مِنْكُمُ الْبَارِحَةَ رُؤْيَا ‏\"‏ ‏.‏","english":{"narrator":"Samura b. Jundab reported that when Allah's Messenger (ﷺ) had performed his dawn prayer he turned his face towards them (that is towards his Companions) and said:","text":"Did any one of you see any vision last night?"}}],"chapter":{"id":42,"bookId":2,"arabic":"كتاب الرؤيا","english":"The Book of Dreams"}}