{"metadata":{"length":68,"arabic":{"title":"صحيح مسلم","author":"الإمام مسلم بن الحجاج القشيري النيسابوري","introduction":"كتاب التوبة"},"english":{"title":"Sahih Muslim","author":"Imam Muslim ibn al-Hajjaj al-Naysaburi","introduction":"The Book of Repentance"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":50,"bookId":2,"arabic":"حَدَّثَنِي سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا حَفْصُ بْنُ مَيْسَرَةَ، حَدَّثَنِي زَيْدُ بْنُ أَسْلَمَ، عَنْ أَبِي،\n صَالِحٍ عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ قَالَ ‏\n\"‏ قَالَ اللَّهُ عَزَّ وَجَلَّ\n أَنَا عِنْدَ ظَنِّ عَبْدِي بِي وَأَنَا مَعَهُ حَيْثُ يَذْكُرُنِي وَاللَّهِ لَلَّهُ أَفْرَحُ بِتَوْبَةِ عَبْدِهِ مِنْ أَحَدِكُمْ يَجِدُ\n ضَالَّتَهُ بِالْفَلاَةِ وَمَنْ تَقَرَّبَ إِلَىَّ شِبْرًا تَقَرَّبْتُ إِلَيْهِ ذِرَاعًا وَمَنْ تَقَرَّبَ إِلَىَّ ذِرَاعًا تَقَرَّبْتُ إِلَيْهِ\n بَاعًا وَإِذَا أَقْبَلَ إِلَىَّ يَمْشِي أَقْبَلْتُ إِلَيْهِ أُهَرْوِلُ ‏\"‏ ‏.‏","english":{"narrator":"Abu Huraira reported Allah's Messenger (ﷺ) as saying:","text":"Allah, the Exalted and Glorious, said: I live in the thought of My servant and I am with him as he remembers Me. (The Holy Prophet) further said: By Allah, Allah is more pleased wth the repentance of His servant than what one of you would do on finding the lost camel in the waterless desert. When he draws near Me by the span of his hand. I draw near him by the length of a cubit and when he draws near Me by the length of a cubit. I draw near him by the length of a fathom and when he draws near Me walking I draw close to him hurriedly."}},{"id":2,"idInBook":2,"chapterId":50,"bookId":2,"arabic":"حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ الْقَعْنَبِيُّ، حَدَّثَنَا الْمُغِيرَةُ، - يَعْنِي ابْنَ عَبْدِ\n الرَّحْمَنِ الْحِزَامِيَّ - عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى\n الله عليه وسلم ‏\n\"‏ لَلَّهُ أَشَدُّ فَرَحًا بِتَوْبَةِ أَحَدِكُمْ مِنْ أَحَدِكُمْ بِضَالَّتِهِ إِذَا وَجَدَهَا ‏\"‏ ‏.‏","english":{"narrator":"Abu Huraira reported Allah's Messenger (ﷺ) as saying:","text":"Allah is more pleased with the repentance of His servant when he turns penitently towards Him than one of you would be on finding the lost camel."}},{"id":3,"idInBook":3,"chapterId":50,"bookId":2,"arabic":"وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، عَنْ \n أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمَعْنَاهُ ‏.‏","english":{"narrator":"","text":"This hadith has been narrated on the authority of Abu Huraira through another chain of transmitters."}},{"id":4,"idInBook":4,"chapterId":50,"bookId":2,"arabic":"حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، - وَاللَّفْظُ لِعُثْمَانَ - قَالَ إِسْحَاقُ\n أَخْبَرَنَا وَقَالَ، عُثْمَانُ حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ عُمَارَةَ بْنِ عُمَيْرٍ، عَنِ الْحَارِثِ بْنِ،\n سُوَيْدٍ قَالَ دَخَلْتُ عَلَى عَبْدِ اللَّهِ أَعُودُهُ وَهُوَ مَرِيضٌ فَحَدَّثَنَا بِحَدِيثَيْنِ حَدِيثًا عَنْ نَفْسِهِ\n وَحَدِيثًا عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم\n يَقُولُ ‏\n\"‏ لَلَّهُ أَشَدُّ فَرَحًا بِتَوْبَةِ عَبْدِهِ الْمُؤْمِنِ مِنْ رَجُلٍ فِي أَرْضٍ دَوِيَّةٍ مَهْلَكَةٍ مَعَهُ رَاحِلَتُهُ\n عَلَيْهَا طَعَامُهُ وَشَرَابُهُ فَنَامَ فَاسْتَيْقَظَ وَقَدْ ذَهَبَتْ فَطَلَبَهَا حَتَّى أَدْرَكَهُ الْعَطَشُ ثُمَّ قَالَ أَرْجِعُ\n إِلَى مَكَانِي الَّذِي كُنْتُ فِيهِ فَأَنَامُ حَتَّى أَمُوتَ ‏.‏ فَوَضَعَ رَأْسَهُ عَلَى سَاعِدِهِ لِيَمُوتَ فَاسْتَيْقَظَ\n وَعِنْدَهُ رَاحِلَتُهُ وَعَلَيْهَا زَادُهُ وَطَعَامُهُ وَشَرَابُهُ فَاللَّهُ أَشَدُّ فَرَحًا بِتَوْبَةِ الْعَبْدِ الْمُؤْمِنِ مِنْ هَذَا\n بِرَاحِلَتِهِ وَزَادِهِ ‏\"‏ ‏.‏","english":{"narrator":"Harith b. Suwaid said:","text":"I went to see 'Abdullah to inquire about his health as he was sick and he narrated to us a hadith of Allahs Messenger (ﷺ). He heard Allah's Messenger (ﷺ) as saying: Allah is more pleased with the repentance of His believing servant than a person who loses his riding beast carrying food and drink. He sleeps (being disappointed of its recovery) and then gets up and goes in search for that, until he is stricken with thirst. then comes back to the place where he had been before and goes to sleep completely exhausted placing his head upon his hands waiting for death. And when he gets up, lot there is before him his riding beast and his provisions of food and drink. Allah is more pleased with the repentance of His servant than the recovery of this riding beast along with the provisions (of food and drink)."}},{"id":5,"idInBook":5,"chapterId":50,"bookId":2,"arabic":"وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، عَنْ قُطْبَةَ بْنِ عَبْدِ الْعَزِيزِ،\n عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ وَقَالَ ‏\n\"‏ مِنْ رَجُلٍ بِدَاوِيَّةٍ مِنَ الأَرْضِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"This hadith has been narrated on the authority of A'mash through another chain of transmitters."}},{"id":6,"idInBook":6,"chapterId":50,"bookId":2,"arabic":"وَحَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنَا عُمَارَةُ،\n بْنُ عُمَيْرٍ قَالَ سَمِعْتُ الْحَارِثَ بْنَ سُوَيْدٍ، قَالَ حَدَّثَنِي عَبْدُ اللَّهِ، حَدِيثَيْنِ أَحَدُهُمَا عَنْ رَسُولِ\n اللَّهِ صلى الله عليه وسلم وَالآخَرُ عَنْ نَفْسِهِ فَقَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم\n ‏\n\"‏ لَلَّهُ أَشَدُّ فَرَحًا بِتَوْبَةِ عَبْدِهِ الْمُؤْمِنِ ‏\"‏ ‏.‏ بِمِثْلِ حَدِيثِ جَرِيرٍ ‏.‏","english":{"narrator":"'Abdullah reported Allah's Messenger (ﷺ) as saying:","text":"Allah is more pleased with the repentance of a believing man. The rest of the hadith is the same."}},{"id":7,"idInBook":7,"chapterId":50,"bookId":2,"arabic":"حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا أَبُو يُونُسَ، عَنْ سِمَاكٍ، قَالَ\n خَطَبَ النُّعْمَانُ بْنُ بَشِيرٍ فَقَالَ ‏\n\"‏ لَلَّهُ أَشَدُّ فَرَحًا بِتَوْبَةِ عَبْدِهِ مِنْ رَجُلٍ حَمَلَ زَادَهُ وَمَزَادَهُ\n عَلَى بَعِيرٍ ثُمَّ سَارَ حَتَّى كَانَ بِفَلاَةٍ مِنَ الأَرْضِ فَأَدْرَكَتْهُ الْقَائِلَةُ فَنَزَلَ فَقَالَ تَحْتَ شَجَرَةٍ\n فَغَلَبَتْهُ عَيْنُهُ وَانْسَلَّ بَعِيرُهُ فَاسْتَيْقَظَ فَسَعَى شَرَفًا فَلَمْ يَرَ شَيْئًا ثُمَّ سَعَى شَرَفًا ثَانِيًا\n فَلَمْ يَرَ شَيْئًا ثُمَّ سَعَى شَرَفًا ثَالِثًا فَلَمْ يَرَ شَيْئًا فَأَقْبَلَ حَتَّى أَتَى مَكَانَهُ الَّذِي قَالَ فِيهِ فَبَيْنَمَا\n هُوَ قَاعِدٌ إِذْ جَاءَهُ بَعِيرُهُ يَمْشِي حَتَّى وَضَعَ خِطَامَهُ فِي يَدِهِ فَلَلَّهُ أَشَدُّ فَرَحًا بِتَوْبَةِ الْعَبْدِ\n مِنْ هَذَا حِينَ وَجَدَ بَعِيرَهُ عَلَى حَالِهِ ‏\"‏ ‏.‏ قَالَ سِمَاكٌ فَزَعَمَ الشَّعْبِيُّ أَنَّ النُّعْمَانَ رَفَعَ هَذَا\n الْحَدِيثَ إِلَى النَّبِيِّ صلى الله عليه وسلم وَأَمَّا أَنَا فَلَمْ أَسْمَعْهُ ‏.‏","english":{"narrator":"Nu'man b. Bashir reported:","text":"Allah is more pleased with the repentance of a believing servant than of a person who set out on a journey with a provision of food and drink on the back of his camel. He went on until he came to a waterless desert and he felt like sleeping. So he got down under the shade of a tree and was overcome by sleep and his camel ran away. As he got up he tried to see (the camel) standing upon a mound. but did not find it. He then got upon the other mound, but could not see anything. He then climbed upon the third mound but did not see anything until he came back to the place where he had been previously. And as he was sitting (in utter disappointment) there came to him the camel, till that (camel) placed its nosestring in his hand. Allah is more pleased with the repentance of His servant than the person who found (his lost camel) in this very state. Simak reported that Sha'bi was of the opinion that Nu'min traced it to Allah's Apostle (ﷺ). Simak, however, did not hear that himself."}},{"id":8,"idInBook":8,"chapterId":50,"bookId":2,"arabic":"حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَجَعْفَرُ بْنُ حُمَيْدٍ، قَالَ جَعْفَرٌ حَدَّثَنَا وَقَالَ، يَحْيَى أَخْبَرَنَا \n عُبَيْدُ اللَّهِ بْنُ إِيَادِ بْنِ لَقِيطٍ، عَنْ إِيَادٍ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله\n عليه وسلم ‏\"‏ كَيْفَ تَقُولُونَ بِفَرَحِ رَجُلٍ انْفَلَتَتْ مِنْهُ رَاحِلَتُهُ تَجُرُّ زِمَامَهَا بِأَرْضٍ قَفْرٍ لَيْسَ\n بِهَا طَعَامٌ وَلاَ شَرَابٌ وَعَلَيْهَا لَهُ طَعَامٌ وَشَرَابٌ فَطَلَبَهَا حَتَّى شَقَّ عَلَيْهِ ثُمَّ مَرَّتْ بِجِذْلِ شَجَرَةٍ\n فَتَعَلَّقَ زِمَامُهَا فَوَجَدَهَا مُتَعَلِّقَةً بِهِ ‏\"‏ ‏.‏ قُلْنَا شَدِيدًا يَا رَسُولَ اللَّهِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى\n الله عليه وسلم ‏\"‏ أَمَا وَاللَّهِ لَلَّهُ أَشَدُّ فَرَحًا بِتَوْبَةِ عَبْدِهِ مِنَ الرَّجُلِ بِرَاحِلَتِهِ ‏\"‏ ‏.‏ قَالَ جَعْفَرٌ\n حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ إِيَادٍ عَنْ أَبِيهِ ‏.‏","english":{"narrator":"Al-Bara' b. 'Azib reported Allah's Messenger (ﷺ) as saying that Allah's Messenger (ﷺ) said:","text":"What is your opinion about the delight of a person whose camel loaded with the provisions of food and drink is lost and that moves about with its nosestring trailing upon the waterless desert in which there is neither food nor drink, and lie wanders about in search of that until he is completely exhausted and then accidentally it happens to pass by the trunk of a tree and its nosestring gets entangled in that and he finds it entangled therein? He (in response to the question of the Holy Prophet) said: Allah's Messenger, he would feel highly delighted. Thereupon Allah's Messenger (ﷺ) said. By Allah, Allah is more delighted at the repentance of His servant than that person (as he finds his lost) camel."}},{"id":9,"idInBook":9,"chapterId":50,"bookId":2,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالاَ حَدَّثَنَا عُمَرُ بْنُ يُونُسَ، حَدَّثَنَا \n عِكْرِمَةُ بْنُ عَمَّارٍ، حَدَّثَنَا إِسْحَاقُ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ، - وَهُوَ\n عَمُّهُ - قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لَلَّهُ أَشَدُّ فَرَحًا بِتَوْبَةِ عَبْدِهِ حِينَ يَتُوبُ\n إِلَيْهِ مِنْ أَحَدِكُمْ كَانَ عَلَى رَاحِلَتِهِ بِأَرْضِ فَلاَةٍ فَانْفَلَتَتْ مِنْهُ وَعَلَيْهَا طَعَامُهُ وَشَرَابُهُ فَأَيِسَ\n مِنْهَا فَأَتَى شَجَرَةً فَاضْطَجَعَ فِي ظِلِّهَا قَدْ أَيِسَ مِنْ رَاحِلَتِهِ فَبَيْنَا هُوَ كَذَلِكَ إِذَا هُوَ بِهَا\n قَائِمَةً عِنْدَهُ فَأَخَذَ بِخِطَامِهَا ثُمَّ قَالَ مِنْ شِدَّةِ الْفَرَحِ اللَّهُمَّ أَنْتَ عَبْدِي وَأَنَا رَبُّكَ ‏.‏ أَخْطَأَ\n مِنْ شِدَّةِ الْفَرَحِ ‏\"‏ ‏.‏","english":{"narrator":"Anas b. Malik reported that Allah's Messenger (ﷺ) said:","text":"Allah is more pleased with the repentance of a servant as he turns towards Him for repentance than this that one amongst you is upon the camel in a waterless desert and there is upon (that camel) his provision of food and drink also and it is lost by him, and he having lost all hope (to get tbat) lies down in the shadow and is disappointed about his camel and there he finds that camel standing before him. He takes hold of his nosestring and then out of boundless joy says: 0 Lord, Thou art my servant and I am Thine Lord. He commits this mistake out of extreme delight."}},{"id":10,"idInBook":10,"chapterId":50,"bookId":2,"arabic":"حَدَّثَنَا هَدَّابُ بْنُ خَالِدٍ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا قَتَادَةُ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ\n اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لَلَّهُ أَشَدُّ فَرَحًا بِتَوْبَةِ عَبْدِهِ مِنْ أَحَدِكُمْ إِذَا اسْتَيْقَظَ عَلَى\n بَعِيرِهِ قَدْ أَضَلَّهُ بِأَرْضِ فَلاَةٍ ‏\"‏ ‏.‏ \n وَحَدَّثَنِيهِ أَحْمَدُ الدَّارِمِيُّ، حَدَّثَنَا حَبَّانُ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا قَتَادَةُ، حَدَّثَنَا أَنَسُ بْنُ،\n مَالِكٍ عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ ‏.‏","english":{"narrator":"Anas b. Malik reported that Allah's Messenger (ﷺ) said:","text":"Allah is more pleased with the repentance of His servant than if one of you gets up and he finds his camel missing in a waterless desert (and then he accidentally finds it). This hadith has been narrated on the authority of Anas b. Malik through another chain of transmitters."}},{"id":11,"idInBook":11,"chapterId":50,"bookId":2,"arabic":"حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ مُحَمَّدِ بْنِ قَيْسٍ، - قَاصِّ عُمَرَ بْنِ عَبْدِ\n الْعَزِيزِ - عَنْ أَبِي صِرْمَةَ، عَنْ أَبِي أَيُّوبَ، أَنَّهُ قَالَ حِينَ حَضَرَتْهُ الْوَفَاةُ كُنْتُ كَتَمْتُ عَنْكُمْ\n شَيْئًا سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم\n يَقُولُ ‏\n\"‏ لَوْلاَ أَنَّكُمْ تُذْنِبُونَ لَخَلَقَ اللَّهُ خَلْقًا يُذْنِبُونَ يَغْفِرُ لَهُمْ ‏\"‏ ‏.‏","english":{"narrator":"Abu Sirma reported that when the time of the death of Abu Ayyub Ansari drew near, he said:","text":"I used to conceal from you a thing which I heard from Allah's Messenger (ﷺ) and I heard Allah's Messenger (ﷺ) as saying: Had you not committed sins, Allah would have brought into existence a creation that would have committed sin (and Allah) would have forgiven them."}},{"id":12,"idInBook":12,"chapterId":50,"bookId":2,"arabic":"حَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، حَدَّثَنِي عِيَاضٌ، - وَهُوَ ابْنُ\n عَبْدِ اللَّهِ الْفِهْرِيُّ - حَدَّثَنِي إِبْرَاهِيمُ بْنُ عُبَيْدِ بْنِ رِفَاعَةَ، عَنْ مُحَمَّدِ بْنِ كَعْبٍ الْقُرَظِيِّ، عَنْ \n أَبِي صِرْمَةَ، عَنْ أَبِي أَيُّوبَ الأَنْصَارِيِّ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ قَالَ ‏\n\"‏ لَوْ\n أَنَّكُمْ لَمْ تَكُنْ لَكُمْ ذُنُوبٌ يَغْفِرُهَا اللَّهُ لَكُمْ لَجَاءَ اللَّهُ بِقَوْمٍ لَهُمْ ذُنُوبٌ يَغْفِرُهَا لَهُمْ ‏\"‏ ‏.‏","english":{"narrator":"Abu Ayyub Ansari reported that Allah's Messenger (ﷺ) said:","text":"If you were not to commit sins, Allah would have swept you out of existence and would have replaced you by another people who have committed sin, and then asked forgiveness from Allah, and He would have granted them pardon."}},{"id":13,"idInBook":13,"chapterId":50,"bookId":2,"arabic":"حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ جَعْفَرٍ الْجَزَرِيِّ، عَنْ \n يَزِيدَ بْنِ الأَصَمِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ وَالَّذِي نَفْسِي\n بِيَدِهِ لَوْ لَمْ تُذْنِبُوا لَذَهَبَ اللَّهُ بِكُمْ وَلَجَاءَ بِقَوْمٍ يُذْنِبُونَ فَيَسْتَغْفِرُونَ اللَّهَ فَيَغْفِرُ لَهُمْ ‏\"‏ ‏.‏","english":{"narrator":"Abu Huraira reported Allah's Messenger (ﷺ) having said:","text":"By Him in Whose Hand is my life, if you were not to commit sin, Allah would sweep you out of existence and He would replace (you by) those people who would commit sin and seek forgiveness from Allah, and He would have pardoned them."}},{"id":14,"idInBook":14,"chapterId":50,"bookId":2,"arabic":"حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، وَقَطَنُ بْنُ نُسَيْرٍ، - وَاللَّفْظُ لِيَحْيَى - أَخْبَرَنَا جَعْفَرُ،\n بْنُ سُلَيْمَانَ عَنْ سَعِيدِ بْنِ إِيَاسٍ الْجُرَيْرِيِّ، عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ، عَنْ حَنْظَلَةَ الأُسَيِّدِيِّ،\n قَالَ - وَكَانَ مِنْ كُتَّابِ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ - لَقِيَنِي أَبُو بَكْرٍ فَقَالَ كَيْفَ\n أَنْتَ يَا حَنْظَلَةُ قَالَ قُلْتُ نَافَقَ حَنْظَلَةُ قَالَ سُبْحَانَ اللَّهِ مَا تَقُولُ قَالَ قُلْتُ نَكُونُ عِنْدَ رَسُولِ\n اللَّهِ صلى الله عليه وسلم يُذَكِّرُنَا بِالنَّارِ وَالْجَنَّةِ حَتَّى كَأَنَّا رَأْىَ عَيْنٍ فَإِذَا خَرَجْنَا مِنْ عِنْدِ\n رَسُولِ اللَّهِ صلى الله عليه وسلم عَافَسْنَا الأَزْوَاجَ وَالأَوْلاَدَ وَالضَّيْعَاتِ فَنَسِينَا كَثِيرًا قَالَ\n أَبُو بَكْرٍ فَوَاللَّهِ إِنَّا لَنَلْقَى مِثْلَ هَذَا ‏.‏ فَانْطَلَقْتُ أَنَا وَأَبُو بَكْرٍ حَتَّى دَخَلْنَا عَلَى رَسُولِ اللَّهِ\n صلى الله عليه وسلم قُلْتُ نَافَقَ حَنْظَلَةُ يَا رَسُولَ اللَّهِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه\n وسلم ‏\"‏ وَمَا ذَاكَ ‏\"‏ ‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ نَكُونُ عِنْدَكَ تُذَكِّرُنَا بِالنَّارِ وَالْجَنَّةِ حَتَّى كَأَنَّا\n رَأْىَ عَيْنٍ فَإِذَا خَرَجْنَا مِنْ عِنْدِكَ عَافَسْنَا الأَزْوَاجَ وَالأَوْلاَدَ وَالضَّيْعَاتِ نَسِينَا كَثِيرًا ‏.‏\n فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَالَّذِي نَفْسِي بِيَدِهِ إِنْ لَوْ تَدُومُونَ عَلَى مَا تَكُونُونَ\n عِنْدِي وَفِي الذِّكْرِ لَصَافَحَتْكُمُ الْمَلاَئِكَةُ عَلَى فُرُشِكُمْ وَفِي طُرُقِكُمْ وَلَكِنْ يَا حَنْظَلَةُ سَاعَةً\n وَسَاعَةً ‏\"‏ ‏.‏ ثَلاَثَ مَرَّاتٍ ‏.‏","english":{"narrator":"Hanzala Usayyidi, who was amongst the scribes of Allah's Messenger (ﷺ). reported:","text":"I met Abu Bakr. He said: Who are you? He (Hanzala) said: Hanzala has turned to be a hypocrite. He (Abu Bakr) said: Hallowed be Allah, what are you saying? Thereupon he said: I say that when we are in the company of Allah's Messenger (ﷺ) we ponder over Hell-Fire and Paradise as if we are seeing them with our very eyes and when we are away from Allah's Messenger (ﷺ) we attend to our wives, our children, our business; most of these things (pertaining to After-life) slip out of our minds. Abu Bakr said: By Allah, I also experience the same. So I and Abu Bakr went to Allah's Messenger (ﷺ) and said to him: Allah's Messenger, Hanzala has turned to be a hypocrite. Thereupon Allah's Messenger (ﷺ) said: What has happened to you? I said: Allah's Messenger, when we are in your company, we are reminded of Hell-Fire and Paradise as if we are seeing them with our own eyes, but whenever we go away from you and attend to our wives, children and business, much of these things go out of our minds. Thereupon Allah's Messenger (ﷺ) said: By Him in Whose Hand is my life, if your state of mind remains the same as it is in my presence and you are always busy in remembrance (of Allah), the Angels will shake hands with you in your beds and in your paths but, Hanzala, time should be devoted (to the worldly affairs) and time (should be devoted to prayer and meditation). He (the Holy Prophet) said this thrice."}},{"id":15,"idInBook":15,"chapterId":50,"bookId":2,"arabic":"حَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا عَبْدُ الصَّمَدِ، سَمِعْتُ أَبِي يُحَدِّثُ، حَدَّثَنَا سَعِيدٌ،\n الْجُرَيْرِيُّ عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ، عَنْ حَنْظَلَةَ، قَالَ كُنَّا عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم\n فَوَعَظَنَا فَذَكَّرَ النَّارَ - قَالَ - ثُمَّ جِئْتُ إِلَى الْبَيْتِ فَضَاحَكْتُ الصِّبْيَانَ وَلاَعَبْتُ الْمَرْأَةَ -\n قَالَ - فَخَرَجْتُ فَلَقِيتُ أَبَا بَكْرٍ فَذَكَرْتُ ذَلِكَ لَهُ فَقَالَ وَأَنَا قَدْ فَعَلْتُ مِثْلَ مَا تَذْكُرُ ‏.‏ فَلَقِينَا\n رَسُولَ اللَّهِ صلى الله عليه وسلم فَقُلْتُ يَا رَسُولَ اللَّهِ نَافَقَ حَنْظَلَةُ فَقَالَ ‏\"‏ مَهْ ‏\"‏ ‏.‏ فَحَدَّثْتُهُ\n بِالْحَدِيثِ فَقَالَ أَبُو بَكْرٍ وَأَنَا قَدْ فَعَلْتُ مِثْلَ مَا فَعَلَ فَقَالَ ‏\"‏ يَا حَنْظَلَةُ سَاعَةً وَسَاعَةً وَلَوْ\n كَانَتْ تَكُونُ قُلُوبُكُمْ كَمَا تَكُونُ عِنْدَ الذِّكْرِ لَصَافَحَتْكُمُ الْمَلاَئِكَةُ حَتَّى تُسَلِّمَ عَلَيْكُمْ فِي الطُّرُقِ\n ‏\"‏ ‏.‏","english":{"narrator":"Hanzala reported:","text":"We were in the company of Allah's Messenger (ﷺ) and he delivered to us a sermon and made a mention of Hell-Fire. Then I came to my house and began to laugh with my children and sport with my wife. (Hanzala) further reported: I went out and met Abu Bakr and made a mention of that to him. Thereupon he said: I have done the same as you have mentioned. So we went to see Allah's Messenger (ﷺ) and said to him: Allah's Messenger, Hanzala has turned to he a hypocrite. And he (the Holy Prophet) said Show respite. And then I narrated to him the story, and Abu Bakr said: I have done the same as he has done. Thereupon he (the Holy Prophet) said: Hanzala, there is a time for worldly affairs and a time for (worship and devotion), and if your state of mind is always the same as it is at the time of remembrance of Allah, the Angels would shake hands with you and would greet you on the path by saying: As-Salamu-Alaikum."}},{"id":16,"idInBook":16,"chapterId":50,"bookId":2,"arabic":"حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا الْفَضْلُ بْنُ دُكَيْنٍ، حَدَّثَنَا سُفْيَانُ، عَنْ سَعِيدٍ الْجُرَيْرِيِّ،\n عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ، عَنْ حَنْظَلَةَ التَّمِيمِيِّ الأُسَيِّدِيِّ الْكَاتِبِ، قَالَ كُنَّا عِنْدَ النَّبِيِّ صلى الله\n عليه وسلم فَذَكَّرَنَا الْجَنَّةَ وَالنَّارَ ‏.‏ فَذَكَرَ نَحْوَ حَدِيثِهِمَا ‏.‏","english":{"narrator":"Hanzala Taimi Ufayyidi, the scribe of Allah's Messenger (ﷺ), reported:","text":"We were in the presence of Allah's Messenger (ﷺ) and he brought to our minds the problems pertaining to Paradise and Hell-Fire. The rest of the hadith is the same."}},{"id":17,"idInBook":17,"chapterId":50,"bookId":2,"arabic":"حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا الْمُغِيرَةُ، - يَعْنِي الْحِزَامِيَّ - عَنْ أَبِي الزِّنَادِ، عَنِ \n الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لَمَّا خَلَقَ اللَّهُ الْخَلْقَ كَتَبَ\n فِي كِتَابِهِ فَهُوَ عِنْدَهُ فَوْقَ الْعَرْشِ إِنَّ رَحْمَتِي تَغْلِبُ غَضَبِي ‏\"‏ ‏.‏","english":{"narrator":"Abu Huraira reported that Allah's Messenger (ﷺ) said:","text":"When Allah created the creation as He was upon the Throne, He put down in His Book: Verily, My mercy predominates My wrath."}},{"id":18,"idInBook":18,"chapterId":50,"bookId":2,"arabic":"حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ \n أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم ‏\n\"‏ قَالَ اللَّهُ عَزَّ وَجَلَّ سَبَقَتْ رَحْمَتِي غَضَبِي\n ‏\"‏ ‏.‏","english":{"narrator":"Abu Huraira reported Allah's Messenger (ﷺ) as saying:","text":"Allah, the Exalted and Glorious, said: My mercy excels My wrath."}},{"id":19,"idInBook":19,"chapterId":50,"bookId":2,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ خَشْرَمٍ، أَخْبَرَنَا أَبُو ضَمْرَةَ، عَنِ الْحَارِثِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عَطَاءِ،\n بْنِ مِينَاءَ عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لَمَّا قَضَى اللَّهُ الْخَلْقَ\n كَتَبَ فِي كِتَابِهِ عَلَى نَفْسِهِ فَهُوَ مَوْضُوعٌ عِنْدَهُ إِنَّ رَحْمَتِي تَغْلِبُ غَضَبِي ‏\"‏ ‏.‏","english":{"narrator":"Abu Huraira reported Allah's Messenger (ﷺ) as saying:","text":"When Allah created the creation, He ordained for Himself and this document is with Him: Verily, My mercy predominates Mv wrath."}},{"id":20,"idInBook":20,"chapterId":50,"bookId":2,"arabic":"حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى التُّجِيبِيُّ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ،\n أَنَّ سَعِيدَ بْنَ الْمُسَيَّبِ، أَخْبَرَهُ أَنَّ أَبَا هُرَيْرَةَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم\n يَقُولُ ‏\n\"‏ جَعَلَ اللَّهُ الرَّحْمَةَ مِائَةَ جُزْءٍ فَأَمْسَكَ عِنْدَهُ تِسْعَةً وَتِسْعِينَ وَأَنْزَلَ فِي الأَرْضِ جُزْءًا\n وَاحِدًا فَمِنْ ذَلِكَ الْجُزْءِ تَتَرَاحَمُ الْخَلاَئِقُ حَتَّى تَرْفَعَ الدَّابَّةُ حَافِرَهَا عَنْ وَلَدِهَا خَشْيَةَ أَنْ\n تُصِيبَهُ ‏\"‏ ‏.‏","english":{"narrator":"Abu Huraira reported:","text":"I heard Allah's Messenger (ﷺ) as saying: Allah created mercy in one hundred parts and He retained with Him ninety-nine parts, and He has sent down upon the earth one part, and it is because of this one part that there is mutual love among the creation so much so that the animal lifts up its hoof from its young one, fearing that it might harm it."}},{"id":21,"idInBook":21,"chapterId":50,"bookId":2,"arabic":"حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ، حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَاعِيلُ، - يَعْنُونَ ابْنَ\n جَعْفَرٍ - عَنِ الْعَلاَءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ\n ‏\n\"‏ خَلَقَ اللَّهُ مِائَةَ رَحْمَةٍ فَوَضَعَ وَاحِدَةً بَيْنَ خَلْقِهِ وَخَبَأَ عِنْدَهُ مِائَةً إِلاَّ وَاحِدَةً ‏\"‏ ‏.‏","english":{"narrator":"Abu Huraira reported Allah's Messenger (ﷺ) as saying:","text":"Allah created one hundred (parts of mercy) and He distributed one amongst His creation and kept this one hundred excepting one with Himself (for the Day of Resurrection)."}},{"id":22,"idInBook":22,"chapterId":50,"bookId":2,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا عَبْدُ الْمَلِكِ، عَنْ عَطَاءٍ، عَنْ \n أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ لِلَّهِ مِائَةَ رَحْمَةٍ أَنْزَلَ مِنْهَا رَحْمَةً\n وَاحِدَةً بَيْنَ الْجِنِّ وَالإِنْسِ وَالْبَهَائِمِ وَالْهَوَامِّ فَبِهَا يَتَعَاطَفُونَ وَبِهَا يَتَرَاحَمُونَ وَبِهَا تَعْطِفُ\n الْوَحْشُ عَلَى وَلَدِهَا وَأَخَّرَ اللَّهُ تِسْعًا وَتِسْعِينَ رَحْمَةً يَرْحَمُ بِهَا عِبَادَهُ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏","english":{"narrator":"Abu Huraira reported Allah's Messenger (ﷺ) as saying:","text":"There are one hundred (parts of) mercy for Allah and He has sent down out of these one part of mercy upon the jinn and human beings and animals and the insects, and it is because of this (one part) that they love one another, show kindness to one another and even the beast treats its young one with affection, and Allah has reserved ninety nine parts of mercy with which He would treat His servants on the Day of Resurrection."}},{"id":23,"idInBook":23,"chapterId":50,"bookId":2,"arabic":"حَدَّثَنِي الْحَكَمُ بْنُ مُوسَى، حَدَّثَنَا مُعَاذُ بْنُ مُعَاذٍ، حَدَّثَنَا سُلَيْمَانُ التَّيْمِيُّ، حَدَّثَنَا أَبُو\n عُثْمَانَ النَّهْدِيُّ عَنْ سَلْمَانَ الْفَارِسِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ لِلَّهِ\n مِائَةَ رَحْمَةٍ فَمِنْهَا رَحْمَةٌ بِهَا يَتَرَاحَمُ الْخَلْقُ بَيْنَهُمْ وَتِسْعَةٌ وَتِسْعُونَ لِيَوْمِ الْقِيَامَةِ ‏\"‏ ‏.‏","english":{"narrator":"Salman Farisi reported Allah's Messenger (ﷺ) as saying:","text":"Verily, there are one hundred (parts of) mercy for Allah, and it is one part of this mercy by virtue of which there is mutual love between the people and ninety-nine reserved for the Day of Resurrection."}},{"id":24,"idInBook":24,"chapterId":50,"bookId":2,"arabic":"وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، حَدَّثَنَا الْمُعْتَمِرُ، عَنْ أَبِيهِ، بِهَذَا الإِسْنَادِ ‏.‏","english":{"narrator":"","text":"This hadith has been transmitted on the authority of Mu'tamir, reported on the authority of his father."}},{"id":25,"idInBook":25,"chapterId":50,"bookId":2,"arabic":"حَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ، عَنْ أَبِي عُثْمَانَ، عَنْ \n سَلْمَانَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ اللَّهَ خَلَقَ يَوْمَ خَلَقَ السَّمَوَاتِ وَالأَرْضَ\n مِائَةَ رَحْمَةٍ كُلُّ رَحْمَةٍ طِبَاقَ مَا بَيْنَ السَّمَاءِ وَالأَرْضِ فَجَعَلَ مِنْهَا فِي الأَرْضِ رَحْمَةً فَبِهَا\n تَعْطِفُ الْوَالِدَةُ عَلَى وَلَدِهَا وَالْوَحْشُ وَالطَّيْرُ بَعْضُهَا عَلَى بَعْضٍ فَإِذَا كَانَ يَوْمُ الْقِيَامَةِ أَكْمَلَهَا\n بِهَذِهِ الرَّحْمَةِ ‏\"‏ ‏.‏","english":{"narrator":"Salman reported that Allah's Messenger (ﷺ) said:","text":"Verily, Allah created, on the same very day when He created the heavens and the earth, one hundred parts of mercy. Every part of mercy is coextensive with the space between the heavens. and the earth and He out of this mercy endowed one part to the earth and it is because of this that the mother shows affection to her child and even the beasts and birds show kindness to one another and when there would be the Day of Resurrection, Allah would make full (use of Mercy)."}},{"id":26,"idInBook":26,"chapterId":50,"bookId":2,"arabic":"حَدَّثَنِي الْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ، وَمُحَمَّدُ بْنُ سَهْلٍ التَّمِيمِيُّ، - وَاللَّفْظُ لِحَسَنٍ -\n حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ، حَدَّثَنَا أَبُو غَسَّانَ، حَدَّثَنِي زَيْدُ بْنُ أَسْلَمَ، عَنْ أَبِيهِ، عَنْ عُمَرَ بْنِ الْخَطَّابِ،\n أَنَّهُ قَالَ قَدِمَ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم بِسَبْىٍ فَإِذَا امْرَأَةٌ مِنَ السَّبْىِ تَبْتَغِي\n إِذَا وَجَدَتْ صَبِيًّا فِي السَّبْىِ أَخَذَتْهُ فَأَلْصَقَتْهُ بِبَطْنِهَا وَأَرْضَعَتْهُ فَقَالَ لَنَا رَسُولُ اللَّهِ صلى\n الله عليه وسلم ‏\"‏ أَتَرَوْنَ هَذِهِ الْمَرْأَةَ طَارِحَةً وَلَدَهَا فِي النَّارِ ‏\"‏ ‏.‏ قُلْنَا لاَ وَاللَّهِ وَهِيَ تَقْدِرُ\n عَلَى أَنْ لاَ تَطْرَحَهُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَلَّهُ أَرْحَمُ بِعِبَادِهِ مِنْ هَذِهِ\n بِوَلَدِهَا ‏\"‏ ‏.‏","english":{"narrator":"'Umar b. Khattab reported that there were brought some prisoners to Allah's Messenger (ﷺ) amongst whom there was also a woman, who was searching (for someone) and when she found a child amongst the prisoners, she took hold of it, pressed it against her chest and provided it suck. Thereupon Allah's Messenger (ﷺ) said:","text":"Do you think this woman would ever afford to throw her child in the Fire? We said: By Allah, so far as it lies in her power, she would never throw the child in Fire. ' Thereupon Allah's Messenger (ﷺ) said: Allah is more kind to His servants than this woman is to her child."}},{"id":27,"idInBook":27,"chapterId":50,"bookId":2,"arabic":"حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ، حُجْرٍ جَمِيعًا عَنْ إِسْمَاعِيلَ بْنِ جَعْفَرٍ، قَالَ\n ابْنُ أَيُّوبَ حَدَّثَنَا إِسْمَاعِيلُ، أَخْبَرَنِي الْعَلاَءُ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى\n الله عليه وسلم قَالَ ‏\n\"‏ لَوْ يَعْلَمُ الْمُؤْمِنُ مَا عِنْدَ اللَّهِ مِنَ الْعُقُوبَةِ مَا طَمِعَ بِجَنَّتِهِ أَحَدٌ وَلَوْ\n يَعْلَمُ الْكَافِرُ مَا عِنْدَ اللَّهِ مِنَ الرَّحْمَةِ مَا قَنِطَ مِنْ جَنَّتِهِ أَحَدٌ ‏\"‏ ‏.‏","english":{"narrator":"'Ala' reported on the authority of his father who reported on the authority of Abu Huraira that Allah's Messenger (ﷺ) said:","text":"If a believer were to know the punishment (in Hell) none would have the audacity to aspire for Paradise (but he would earnestly desire to be rescued from Hell), and if a non-believer were to know what is there with Allah as a mercy. none would have been disappointed in regard to Paradise."}},{"id":28,"idInBook":28,"chapterId":50,"bookId":2,"arabic":"حَدَّثَنِي مُحَمَّدُ بْنُ مَرْزُوقِ ابْنِ بِنْتِ مَهْدِيِّ بْنِ مَيْمُونٍ، حَدَّثَنَا رَوْحٌ، حَدَّثَنَا مَالِكٌ، عَنْ \n أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ قَالَ\n رَجُلٌ لَمْ يَعْمَلْ حَسَنَةً قَطُّ لأَهْلِهِ إِذَا مَاتَ فَحَرِّقُوهُ ثُمَّ اذْرُوا نِصْفَهُ فِي الْبَرِّ وَنِصْفَهُ فِي الْبَحْرِ\n فَوَاللَّهِ لَئِنْ قَدَرَ اللَّهُ عَلَيْهِ لَيُعَذِّبَنَّهُ عَذَابًا لاَ يُعَذِّبُهُ أَحَدًا مِنَ الْعَالَمِينَ فَلَمَّا مَاتَ الرَّجُلُ فَعَلُوا\n مَا أَمَرَهُمْ فَأَمَرَ اللَّهُ الْبَرَّ فَجَمَعَ مَا فِيهِ وَأَمَرَ الْبَحْرَ فَجَمَعَ مَا فِيهِ ثُمَّ قَالَ لِمَ فَعَلْتَ هَذَا\n قَالَ مِنْ خَشْيَتِكَ يَا رَبِّ وَأَنْتَ أَعْلَمُ ‏.‏ فَغَفَرَ اللَّهُ لَهُ ‏\"‏ ‏.‏","english":{"narrator":"Abu Huraira reported Allah's Messenger (ﷺ) as saying that a person who had never done any good deed asked the members of his family to burn his dead body when he would die and to scatter half of its ashes over the land and half in the ocean. By Allah, if Allah finds him in His grip, He would torment him with a torment with which He did not afflict anyone amongst the people of the world; and when the person died, it was done to him as he had commanded (his family) to do. Allah commanded the land to collect (the ashes scattered on it) and He commanded the ocean and that collected (ashes) contained in it. Allah questioned him why he had done. that He said:","text":"My Lord, it is out of Thine fear that I have done it and Thou art well aware of it, and Allah granted him pardon:."}},{"id":29,"idInBook":29,"chapterId":50,"bookId":2,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَ عَبْدٌ أَخْبَرَنَا وَقَالَ ابْنُ رَافِعٍ، - وَاللَّفْظُ\n لَهُ - حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، قَالَ قَالَ لِيَ الزُّهْرِيُّ أَلاَ أُحَدِّثُكَ بِحَدِيثَيْنِ عَجِيبَيْنِ\n قَالَ الزُّهْرِيُّ أَخْبَرَنِي حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه\n وسلم قَالَ ‏\"‏ أَسْرَفَ رَجُلٌ عَلَى نَفْسِهِ فَلَمَّا حَضَرَهُ الْمَوْتُ أَوْصَى بَنِيهِ فَقَالَ إِذَا أَنَا مُتُّ\n فَأَحْرِقُونِي ثُمَّ اسْحَقُونِي ثُمَّ اذْرُونِي فِي الرِّيحِ فِي الْبَحْرِ فَوَاللَّهِ لَئِنْ قَدَرَ عَلَىَّ رَبِّي لَيُعَذِّبُنِي\n عَذَابًا مَا عَذَّبَهُ بِهِ أَحَدًا ‏.‏ قَالَ فَفَعَلُوا ذَلِكَ بِهِ فَقَالَ لِلأَرْضِ أَدِّي مَا أَخَذْتِ ‏.‏ فَإِذَا هُوَ قَائِمٌ\n فَقَالَ لَهُ مَا حَمَلَكَ عَلَى مَا صَنَعْتَ فَقَالَ خَشْيَتُكَ يَا رَبِّ - أَوْ قَالَ - مَخَافَتُكَ ‏.‏ فَغَفَرَ لَهُ\n بِذَلِكَ ‏\"‏ ‏.‏ \n قَالَ الزُّهْرِيُّ وَحَدَّثَنِي حُمَيْدٌ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم\n قَالَ ‏\"‏ دَخَلَتِ امْرَأَةٌ النَّارَ فِي هِرَّةٍ رَبَطَتْهَا فَلاَ هِيَ أَطْعَمَتْهَا وَلاَ هِيَ أَرْسَلَتْهَا تَأْكُلُ مِنْ\n خَشَاشِ الأَرْضِ حَتَّى مَاتَتْ هَزْلاً ‏\"‏ ‏.‏ قَالَ الزُّهْرِيُّ ذَلِكَ لِئَلاَّ يَتَّكِلَ رَجُلٌ وَلاَ يَيْأَسَ رَجُلٌ\n ‏.‏","english":{"narrator":"Abu Huraira reported Allah's Messenger (ﷺ) as saying that a person committed sin beyond measure and when he was going to die, he left this will:","text":"(When I die), bum my dead body and then cast them (the ashes) to the wind and in the ocean. By Allah, if my Lord takes hold of me, He would torment me as He has not tormented anyone else. They did as he had asked them to do. He (the Lord) said to the earth: Return what you have taken. And he was thus restored to his (original form). He (Allah) said to him: What prompted you to do this? He said: My Lord, it was Thine fear or Thine awe, and Allah pardoned him because of this. \n\nAbu Huraira reported Allah's Messenger (ﷺ) as saying that a woman was thrown into Hell-Fire because of a cat whom she had tied and did not provide it with food. nor did she set it free to eat vermin of the earth until it died emaciated. \n\nAz-Zuhri said: (These two ahadith) show that a person should neither feel confident (of getting into Paradise) because of his deeds, nor should he lose (all hopes) of getting into Paradise."}},{"id":30,"idInBook":30,"chapterId":50,"bookId":2,"arabic":"حَدَّثَنِي أَبُو الرَّبِيعِ، سُلَيْمَانُ بْنُ دَاوُدَ حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ، حَدَّثَنِي الزُّبَيْدِيُّ، قَالَ\n الزُّهْرِيُّ حَدَّثَنِي حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ\n صلى الله عليه وسلم يَقُولُ ‏\"‏ أَسْرَفَ عَبْدٌ عَلَى نَفْسِهِ ‏\"‏ ‏.‏ بِنَحْوِ حَدِيثِ مَعْمَرٍ إِلَى قَوْلِهِ ‏\"‏\n فَغَفَرَ اللَّهُ لَهُ ‏\"‏ ‏.‏ وَلَمْ يَذْكُرْ حَدِيثَ الْمَرْأَةِ فِي قِصَّةِ الْهِرَّةِ وَفِي حَدِيثِ الزُّبَيْدِيِّ قَالَ ‏\"‏ فَقَالَ\n اللَّهُ عَزَّ وَجَلَّ لِكُلِّ شَىْءٍ أَخَذَ مِنْهُ شَيْئًا أَدِّ مَا أَخَذْتَ مِنْهُ ‏\"‏ ‏.‏","english":{"narrator":"Abu Huraira reported Allah's Messenger (ﷺ) as saying that a servant transgressed the litnit in committing sins. The rest of the hadith is the same but there is no mention of the story of the cat in it and in the hadith transmitted on the authority of Ziibaidl (the words are):","text":"\" Allah, the Exalted and Glorious, said to everything which had taken a part of lies ashes to return what it had taken.\""}},{"id":31,"idInBook":31,"chapterId":50,"bookId":2,"arabic":"حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، سَمِعَ \n عُقْبَةَ بْنَ عَبْدِ الْغَافِرِ، يَقُولُ سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ، يُحَدِّثُ عَنِ النَّبِيِّ صلى الله عليه وسلم\n ‏\n\"‏ أَنَّ رَجُلاً فِيمَنْ كَانَ قَبْلَكُمْ رَاشَهُ اللَّهُ مَالاً وَوَلَدًا فَقَالَ لِوَلَدِهِ لَتَفْعَلُنَّ مَا آمُرُكُمْ بِهِ أَوْ لأُوَلِّيَنَّ\n مِيرَاثِي غَيْرَكُمْ إِذَا أَنَا مُتُّ فَأَحْرِقُونِي - وَأَكْثَرُ عِلْمِي أَنَّهُ قَالَ - ثُمَّ اسْحَقُونِي وَاذْرُونِي\n فِي الرِّيحِ فَإِنِّي لَمْ أَبْتَهِرْ عِنْدَ اللَّهِ خَيْرًا وَإِنَّ اللَّهَ يَقْدِرُ عَلَىَّ أَنْ يُعَذِّبَنِي - قَالَ - فَأَخَذَ\n مِنْهُمْ مِيثَاقًا فَفَعَلُوا ذَلِكَ بِهِ وَرَبِّي فَقَالَ اللَّهُ مَا حَمَلَكَ عَلَى مَا فَعَلْتَ فَقَالَ مَخَافَتُكَ ‏.‏ قَالَ\n فَمَا تَلاَفَاهُ غَيْرُهَا ‏\"‏ ‏.‏","english":{"narrator":"Abu Sa'id Khudri reported that Allah's Messenger (ﷺ) said that a person amongst the earlier nations before you was conferred property and children by Allah, He said to his children:","text":"'You must do as I command you to do, otherwise I will make others besides you as my inheritors. As I die, burn my body and blow my ashes in the wind as I do not find any merit of mine which would please Allah, and if Allah were to take hold of me, He would punish me. He took a pledge from them and they did as he commanded thein to do. Allah said: What prompted you to do this? He said: My Lord. Thine fear, and Allah did not punish him at all."}},{"id":32,"idInBook":32,"chapterId":50,"bookId":2,"arabic":"وَحَدَّثَنَاهُ يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ، حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ، قَالَ قَالَ لِي أَبِي\n حَدَّثَنَا قَتَادَةُ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى، حَدَّثَنَا شَيْبَانُ،\n بْنُ عَبْدِ الرَّحْمَنِ ح وَحَدَّثَنَا ابْنُ الْمُثَنَّى، حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا أَبُو عَوَانَةَ، كِلاَهُمَا عَنْ قَتَادَةَ،\n ذَكَرُوا جَمِيعًا بِإِسْنَادِ شُعْبَةَ نَحْوَ حَدِيثِهِ وَفِي حَدِيثِ شَيْبَانَ وَأَبِي عَوَانَةَ ‏\"‏ أَنَّ رَجُلاً مِنَ\n النَّاسِ رَغَسَهُ اللَّهُ مَالاً وَوَلَدًا ‏\"‏ ‏.‏ وَفِي حَدِيثِ التَّيْمِيِّ ‏\"‏ فَإِنَّهُ لَمْ يَبْتَئِرْ عِنْدَ اللَّهِ خَيْرًا ‏\"‏\n ‏.‏ قَالَ فَسَّرَهَا قَتَادَةُ لَمْ يَدَّخِرْ عِنْدَ اللَّهِ خَيْرًا ‏.‏ وَفِي حَدِيثِ شَيْبَانَ ‏\"‏ فَإِنَّهُ وَاللَّهِ مَا ابْتَأَرَ\n عِنْدَ اللَّهِ خَيْرًا ‏\"‏ ‏.‏ وَفِي حَدِيثِ أَبِي عَوَانَةَ ‏\"‏ مَا امْتَأَرَ ‏\"‏ ‏.‏ بِالْمِيمِ ‏.‏","english":{"narrator":"This hadith has been narrated on the authority of Shu'ba with the chain of transmitters but with a slight variation of wording and Qatada explained the word\" lam yasiru\" as:","text":"\" I find no good in store for rxie in the eye of Allah.\""}},{"id":33,"idInBook":33,"chapterId":50,"bookId":2,"arabic":"حَدَّثَنِي عَبْدُ الأَعْلَى بْنُ حَمَّادٍ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ،\n بْنِ أَبِي طَلْحَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَمْرَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه\n وسلم فِيمَا يَحْكِي عَنْ رَبِّهِ عَزَّ وَجَلَّ قَالَ ‏\"‏ أَذْنَبَ عَبْدٌ ذَنْبًا فَقَالَ اللَّهُمَّ اغْفِرْ لِي ذَنْبِي ‏.‏\n فَقَالَ تَبَارَكَ وَتَعَالَى أَذْنَبَ عَبْدِي ذَنْبًا فَعَلِمَ أَنَّ لَهُ رَبًّا يَغْفِرُ الذَّنْبَ وَيَأْخُذُ بِالذَّنْبِ ‏.‏ ثُمَّ\n عَادَ فَأَذْنَبَ فَقَالَ أَىْ رَبِّ اغْفِرْ لِي ذَنْبِي ‏.‏ فَقَالَ تَبَارَكَ وَتَعَالَى عَبْدِي أَذْنَبَ ذَنْبًا فَعَلِمَ\n أَنَّ لَهُ رَبًّا يَغْفِرُ الذَّنْبَ وَيَأْخُذُ بِالذَّنْبِ ‏.‏ ثُمَّ عَادَ فَأَذْنَبَ فَقَالَ أَىْ رَبِّ اغْفِرْ لِي ذَنْبِي ‏.‏ فَقَالَ\n تَبَارَكَ وَتَعَالَى أَذْنَبَ عَبْدِي ذَنْبًا فَعَلِمَ أَنَّ لَهُ رَبًّا يَغْفِرُ الذَّنْبَ وَيَأْخُذُ بِالذَّنْبِ وَاعْمَلْ مَا\n شِئْتَ فَقَدْ غَفَرْتُ لَكَ ‏\"‏ ‏.‏ قَالَ عَبْدُ الأَعْلَى لاَ أَدْرِي أَقَالَ فِي الثَّالِثَةِ أَوِ الرَّابِعَةِ ‏\"‏ اعْمَلْ\n مَا شِئْتَ ‏\"‏ ‏.‏","english":{"narrator":"Abu Huraira reported from Allah's Messenger (ﷺ) that his Lord, the Exalted and Glorious, thus said. A servant committed a sin and he said:","text":"O Allah, forgive me my sins, and Allah (the Exalted and Glorious) said: My servant commited a sin and then he came to realise that he has a Lord Who forgives the sins and takes to account (the sinner) for the sin. He then again committed a sin and said: My Lord, forgive me my sin, and Allah, the Exalted and High, said: My servant committed a sin and then came to realise that he has a Lord Who would forgive his sin or would take (him) to account for the sin. He again committed a sin and said: My Lord, forgive me for my sin, and Allah (the Exalted and High) said: My servant sas committed a sin and then came to realise that he has a Lord Who forgives the sins or takes (him) to account for sin. O servant, do what you like. I have granted you forgiveness. \n'Abd al-A'la said: I do not know whether he said thrice or four times to do\" what you desire\"."}},{"id":34,"idInBook":34,"chapterId":50,"bookId":2,"arabic":"قَالَ أَبُو أَحْمَدَ حَدَّثَنِي مُحَمَّدُ بْنُ زَنْجُويَهْ الْقُرَشِيُّ الْقُشَيْرِيُّ، حَدَّثَنَا عَبْدُ الأَعْلَى،\n بْنُ حَمَّادٍ النَّرْسِيُّ بِهَذَا الإِسْنَادِ ‏.‏","english":{"narrator":"","text":"The hadlth has been narrated on the authority of 'Abd al-A'la b. Hammad with the same chain of transmitters."}},{"id":35,"idInBook":35,"chapterId":50,"bookId":2,"arabic":"حَدَّثَنِي عَبْدُ بْنُ حُمَيْدٍ، حَدَّثَنِي أَبُو الْوَلِيدِ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا إِسْحَاقُ بْنُ عَبْدِ اللَّهِ،\n بْنِ أَبِي طَلْحَةَ قَالَ كَانَ بِالْمَدِينَةِ قَاصٌّ يُقَالُ لَهُ عَبْدُ الرَّحْمَنِ بْنُ أَبِي عَمْرَةَ - قَالَ - فَسَمِعْتُهُ\n يَقُولُ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ إِنَّ عَبْدًا\n أَذْنَبَ ذَنْبًا ‏\"‏ ‏.‏ بِمَعْنَى حَدِيثِ حَمَّادِ بْنِ سَلَمَةَ ‏.‏ وَذَكَرَ ثَلاَثَ مَرَّاتٍ ‏\"‏ أَذْنَبَ ذَنْبًا ‏\"‏ ‏.‏ وَفِي\n الثَّالِثَةِ ‏\"‏ قَدْ غَفَرْتُ لِعَبْدِي فَلْيَعْمَلْ مَا شَاءَ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Abu Huraira reported lie heard Allah's Messenger (ﷺ) as saying that a servant committed a sin. The rest of the hadith is the same, but there is a slight variation of wording."}},{"id":36,"idInBook":36,"chapterId":50,"bookId":2,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ مُرَّةَ،\n قَالَ سَمِعْتُ أَبَا عُبَيْدَةَ، يُحَدِّثُ عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ\n اللَّهَ عَزَّ وَجَلَّ يَبْسُطُ يَدَهُ بِاللَّيْلِ لِيَتُوبَ مُسِيءُ النَّهَارِ وَيَبْسُطُ يَدَهُ بِالنَّهَارِ لِيَتُوبَ مُسِيءُ\n اللَّيْلِ حَتَّى تَطْلُعَ الشَّمْسُ مِنْ مَغْرِبِهَا ‏\"‏ ‏.‏ \n وَحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا أَبُو دَاوُدَ، حَدَّثَنَا شُعْبَةُ، بِهَذَا الإِسْنَادِ نَحْوَهُ ‏.‏","english":{"narrator":"","text":"Abu Musa reported Allah's Messenger (ﷺ) as saying that Allah, the Exalted and Glorious, Stretches out His Hand during the night so that the people may repent for the fault committed from dawn till dusk and He stretches out His Hand during the day so that the people may repent for the fault committed from dusk to dawn. (He would accept repentance) before the sun rises in the west (before the Day of Resurrection). \n\nA hadith like this has been narrated on the authority of Shu'ba with the same chain of transmitters."}},{"id":37,"idInBook":37,"chapterId":50,"bookId":2,"arabic":"حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ،\n عُثْمَانُ حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى\n الله عليه وسلم ‏\n\"‏ لَيْسَ أَحَدٌ أَحَبَّ إِلَيْهِ الْمَدْحُ مِنَ اللَّهِ مِنْ أَجْلِ ذَلِكَ مَدَحَ نَفْسَهُ وَلَيْسَ أَحَدٌ\n أَغْيَرَ مِنَ اللَّهِ مِنْ أَجْلِ ذَلِكَ حَرَّمَ الْفَوَاحِشَ ‏\"‏ ‏.‏","english":{"narrator":"'Abdullah reported Allah's Messenger (ﷺ) as saying:","text":"Nothing is more loveable to Allah than His praise as He has praised Himself and no one is more self-respecting than Allah Himself and it As because of this that He has prohibited abominable acts."}},{"id":38,"idInBook":38,"chapterId":50,"bookId":2,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، ح وَحَدَّثَنَا \n أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، وَأَبُو مُعَاوِيَةَ عَنِ الأَعْمَشِ،\n عَنْ شَقِيقٍ، عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ أَحَدٌ أَغْيَرَ مِنَ اللَّهِ\n وَلِذَلِكَ حَرَّمَ الْفَوَاحِشَ مَا ظَهَرَ مِنْهَا وَمَا بَطَنَ وَلاَ أَحَدٌ أَحَبَّ إِلَيْهِ الْمَدْحُ مِنَ اللَّهِ ‏\"‏ ‏.‏","english":{"narrator":"'Abdullah reported Allah's Messenger (ﷺ) as saying:","text":"None is more self-respectidg than Allah and it is because of this that He has prohibited abominable acts-both visible and invisible-and none loves His praise more than Allah Himself."}},{"id":39,"idInBook":39,"chapterId":50,"bookId":2,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ \n عَمْرِو بْنِ مُرَّةَ، قَالَ سَمِعْتُ أَبَا وَائِلٍ، يَقُولُ سَمِعْتُ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ، يَقُولُ قُلْتُ لَهُ آنْتَ\n سَمِعْتَهُ مِنْ عَبْدِ اللَّهِ، قَالَ نَعَمْ وَرَفَعَهُ أَنَّهُ قَالَ ‏\n\"‏ لاَ أَحَدٌ أَغْيَرَ مِنَ اللَّهِ وَلِذَلِكَ حَرَّمَ الْفَوَاحِشَ\n مَا ظَهَرَ مِنْهَا وَمَا بَطَنَ وَلاَ أَحَدٌ أَحَبَّ إِلَيْهِ الْمَدْحُ مِنَ اللَّهِ وَلِذَلِكَ مَدَحَ نَفْسَهُ ‏\"‏ ‏.‏","english":{"narrator":"'Abdullah b. Mas'ud reported it directly from Allah's Messenger (ﷺ) that he said:","text":"None is more self-respecting than Allah and it is because of this that He has prohibited abominable acts-both visible and invisible and nothing is loved by Allah more than the praise of His Ownself and it is because of this that He has praised Himself."}},{"id":40,"idInBook":40,"chapterId":50,"bookId":2,"arabic":"حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ إِسْحَاقُ\n أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ مَالِكِ بْنِ الْحَارِثِ، عَنْ عَبْدِ الرَّحْمَنِ،\n بْنِ يَزِيدَ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لَيْسَ أَحَدٌ\n أَحَبَّ إِلَيْهِ الْمَدْحُ مِنَ اللَّهِ عَزَّ وَجَلَّ مِنْ أَجْلِ ذَلِكَ مَدَحَ نَفْسَهُ وَلَيْسَ أَحَدٌ أَغْيَرَ مِنَ اللَّهِ مِنْ\n أَجْلِ ذَلِكَ حَرَّمَ الْفَوَاحِشَ وَلَيْسَ أَحَدٌ أَحَبَّ إِلَيْهِ الْعُذْرُ مِنَ اللَّهِ مِنْ أَجْلِ ذَلِكَ أَنْزَلَ الْكِتَابَ\n وَأَرْسَلَ الرُّسُلَ ‏\"‏ ‏.‏","english":{"narrator":"Abdullah b. Mas'ud reported that Allah's Messenger (ﷺ) said:","text":"None loves one's own praise more than Allah, the Exalted and Glurious, does. It is because of this that He has praised Himself, and none is more self-respecting than Allah and it is because of this that He has prohibited abominable acts and there is none who is more anxious to accept the apologies of the people than Allah Himself and it is because of this that He has revealed the Book and sent the Messengers."}},{"id":41,"idInBook":41,"chapterId":50,"bookId":2,"arabic":"حَدَّثَنَا عَمْرٌو النَّاقِدُ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ ابْنُ عُلَيَّةَ، عَنْ حَجَّاجِ بْنِ أَبِي،\n عُثْمَانَ قَالَ قَالَ يَحْيَى وَحَدَّثَنِي أَبُو سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله\n عليه وسلم ‏\n\"‏ إِنَّ اللَّهَ يَغَارُ وَإِنَّ الْمُؤْمِنَ يَغَارُ وَغَيْرَةُ اللَّهِ أَنْ يَأْتِيَ الْمُؤْمِنُ مَا حَرَّمَ عَلَيْهِ\n ‏\"‏ ‏.‏","english":{"narrator":"Abu Huraira reported Allah's Messenger (ﷺ) as saying:","text":"Allah is self-respecting and a believer is also self-respecting and the respect of Allah is injured if a believer does what He has forbidden him to do."}},{"id":42,"idInBook":42,"chapterId":50,"bookId":2,"arabic":"قَالَ يَحْيَى وَحَدَّثَنِي أَبُو سَلَمَةَ، أَنَّ عُرْوَةَ بْنَ الزُّبَيْرِ، حَدَّثَهُ أَنَّ أَسْمَاءَ بِنْتَ أَبِي\n بَكْرٍ حَدَّثَتْهُ أَنَّهَا، سَمِعَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ لَيْسَ شَىْءٌ أَغْيَرَ مِنَ اللَّهِ\n عَزَّ وَجَلَّ ‏\"‏ ‏.‏","english":{"narrator":"","text":"This hadith has been narrated on the authority of Asma' daughter of Abu Bakr, through another chain of transmitters."}},{"id":43,"idInBook":43,"chapterId":50,"bookId":2,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا أَبُو دَاوُدَ، حَدَّثَنَا أَبَانُ بْنُ يَزِيدَ، وَحَرْبُ بْنُ شَدَّادٍ،\n عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم\n ‏.‏ بِمِثْلِ رِوَايَةِ حَجَّاجٍ حَدِيثَ أَبِي هُرَيْرَةَ خَاصَّةً وَلَمْ يَذْكُرْ حَدِيثَ أَسْمَاءَ ‏.‏","english":{"narrator":"Abu Salama reported from Abu Huraira that he narrated that Allah's Messenger (may peace be upon hin) said:","text":"There is none more self-respecting than Allah, the Exalted and Glorious There is no mention of the narration of Asma'."}},{"id":44,"idInBook":44,"chapterId":50,"bookId":2,"arabic":"وَحَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ، حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، عَنْ هِشَامٍ، عَنْ يَحْيَى،\n بْنِ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ، عَنْ عُرْوَةَ، عَنْ أَسْمَاءَ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ\n ‏\n\"‏ لاَ شَىْءَ أَغْيَرُ مِنَ اللَّهِ عَزَّ وَجَلَّ ‏\"‏ ‏.‏","english":{"narrator":"Asma' reported that Allah's Apostle (ﷺ) said:","text":"There is none more self-respecting than Allah, the Exalted and Glorious."}},{"id":45,"idInBook":45,"chapterId":50,"bookId":2,"arabic":"حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، - يَعْنِي ابْنَ مُحَمَّدٍ - عَنِ الْعَلاَءِ، عَنْ \n أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْمُؤْمِنُ يَغَارُ وَاللَّهُ أَشَدُّ\n غَيْرًا ‏\"‏ ‏.‏","english":{"narrator":"Abu Huraira reported Allah's Messenger (may peace be upon him ) as saying:","text":"A believer is self-respecting and Allah is extremely self-respecting."}},{"id":46,"idInBook":46,"chapterId":50,"bookId":2,"arabic":"وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ الْعَلاَءَ،\n بِهَذَا الإِسْنَادِ ‏.‏","english":{"narrator":"","text":"This hadith has been narrated on the authority of Shu'ba through another chain of transmitters."}},{"id":47,"idInBook":47,"chapterId":50,"bookId":2,"arabic":"حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَأَبُو كَامِلٍ فُضَيْلُ بْنُ حُسَيْنٍ الْجَحْدَرِيُّ كِلاَهُمَا عَنْ يَزِيدَ،\n بْنِ زُرَيْعٍ - وَاللَّفْظُ لأَبِي كَامِلٍ - حَدَّثَنَا يَزِيدُ، حَدَّثَنَا التَّيْمِيُّ، عَنْ أَبِي عُثْمَانَ، عَنْ عَبْدِ اللَّهِ،\n بْنِ مَسْعُودٍ أَنَّ رَجُلاً، أَصَابَ مِنِ امْرَأَةٍ قُبْلَةً فَأَتَى النَّبِيَّ صلى الله عليه وسلم فَذَكَرَ لَهُ ذَلِكَ\n - قَالَ - فَنَزَلَتْ ‏{‏ أَقِمِ الصَّلاَةَ طَرَفَىِ النَّهَارِ وَزُلَفًا مِنَ اللَّيْلِ إِنَّ الْحَسَنَاتِ يُذْهِبْنَ السَّيِّئَاتِ\n ذَلِكَ ذِكْرَى لِلذَّاكِرِينَ‏}‏ قَالَ فَقَالَ الرَّجُلُ أَلِيَ هَذِهِ يَا رَسُولَ اللَّهِ قَالَ ‏\n\"‏ لِمَنْ عَمِلَ بِهَا مِنْ\n أُمَّتِي ‏\"‏ ‏.‏","english":{"narrator":"'Abdullah b. Mas'ud reported that a person kissed a woman and he came to Allah's Apostle (ﷺ) and made a mention of that to him. It was (on this occasion) that this verse was revealed:","text":"\" And observe prayer at the (two) ends of the day and in the first hours of the night. Surely, good deeds take away evil deeds. That is a reminder for the mindful\" (xi. 115). That person said: Allah's Messenger, does it concern me only? He (the Holy Prophet) said: It concerns every one of my Unimah, who acts according to it."}},{"id":48,"idInBook":48,"chapterId":50,"bookId":2,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، حَدَّثَنَا الْمُعْتَمِرُ، عَنْ أَبِيهِ، حَدَّثَنَا أَبُو عُثْمَانَ، عَنِ ابْنِ،\n مَسْعُودٍ أَنَّ رَجُلاً، أَتَى النَّبِيَّ صلى الله عليه وسلم فَذَكَرَ أَنَّهُ أَصَابَ مِنِ امْرَأَةٍ إِمَّا قُبْلَةً أَوْ\n مَسًّا بِيَدٍ أَوْ شَيْئًا كَأَنَّهُ يَسْأَلُ عَنْ كَفَّارَتِهَا - قَالَ - فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ‏.‏ ثُمَّ ذَكَرَ بِمِثْلِ\n حَدِيثِ يَزِيدَ ‏.‏","english":{"narrator":"","text":"Ibn Mas'ud reported that a person came to Allah's Messenger (ﷺ) and told him that he had kissed a woman or touched her with his hand or did something like this. He inquired of him about its expiation. It was (on this occasion) that Allah, the Exalted and Glorious, revealed this verse (as mentioned above)."}},{"id":49,"idInBook":49,"chapterId":50,"bookId":2,"arabic":"حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنْ سُلَيْمَانَ التَّيْمِيِّ، بِهَذَا الإِسْنَادِ قَالَ\nأَصَابَ رَجُلٌ مِنِ امْرَأَةٍ شَيْئًا دُونَ الْفَاحِشَةِ فَأَتَى عُمَرَ بْنَ الْخَطَّابِ فَعَظَّمَ عَلَيْهِ ثُمَّ أَتَى أَبَا\nبَكْرٍ فَعَظَّمَ عَلَيْهِ ثُمَّ أَتَى النَّبِيَّ صلى الله عليه وسلم فَذَكَرَ بِمِثْلِ حَدِيثِ يَزِيدَ وَالْمُعْتَمِرِ ‏.‏","english":{"narrator":"","text":"This hadith has been narrated on the authority of Sulaiman Taimi with the same chain of transmitters that a person had taken liberty with a woman less than fomication. He came to 'Umar b. Khattab and he took it to be a serious offence. Then he came to Abu Bakr and he also took it to be a serious offence. Then he came the Allahs Apostle (ﷺ) and he made a mention of this to him. The rest of the hadith is the same."}},{"id":50,"idInBook":50,"chapterId":50,"bookId":2,"arabic":"حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ - وَاللَّفْظُ لِيَحْيَى\n- قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ سِمَاكٍ، عَنْ إِبْرَاهِيمَ، عَنْ \nعَلْقَمَةَ، وَالأَسْوَدِ، عَنْ عَبْدِ اللَّهِ، قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ\nاللَّهِ إِنِّي عَالَجْتُ امْرَأَةً فِي أَقْصَى الْمَدِينَةِ وَإِنِّي أَصَبْتُ مِنْهَا مَا دُونَ أَنْ أَمَسَّهَا فَأَنَا هَذَا\nفَاقْضِ فِيَّ مَا شِئْتَ ‏.‏ فَقَالَ لَهُ عُمَرُ لَقَدْ سَتَرَكَ اللَّهُ لَوْ سَتَرْتَ نَفْسَكَ - قَالَ - فَلَمْ يَرُدَّ\nالنَّبِيُّ صلى الله عليه وسلم شَيْئًا فَقَامَ الرَّجُلُ فَانْطَلَقَ فَأَتْبَعَهُ النَّبِيُّ صلى الله عليه وسلم\nرَجُلاً دَعَاهُ وَتَلاَ عَلَيْهِ هَذِهِ الآيَةَ ‏{‏ أَقِمِ الصَّلاَةَ طَرَفَىِ النَّهَارِ وَزُلَفًا مِنَ اللَّيْلِ إِنَّ الْحَسَنَاتِ يُذْهِبْنَ السَّيِّئَاتِ ذَلِكَ ذِكْرَى لِلذَّاكِرِينَ‏}‏ فَقَالَ رَجُلٌ مِنَ الْقَوْمِ يَا نَبِيَّ اللَّهِ هَذَا لَهُ خَاصَّةً قَالَ\n‏\"‏ بَلْ لِلنَّاسِ كَافَّةً ‏\"‏ ‏.‏","english":{"narrator":"'Abdullah reported that a person came to Allah's Apostle (ﷺ) and said:","text":"Allah's Messenger, I sported with a woman in the outskirts of Medina, and I have committed an offence short of fornication. Here I am (before you), kindly deliver verdict about me which you deem fit. Unar said: Allah concealed your fault. You had better conceal it yourself also. Allah's Apostle (ﷺ), however, gave no reply to him. The man stood up and went away and Allah's Apostle (ﷺ) sent a person after him to call him and be recited this verse:\" And observe prayer at the ends of the day and in the first hours of the night. Surely, good deeds take away evil deeds. That is a reminder for the mindful\" (xi. 115). A person amongst the people said: Allah's Apostle, does it concern this marn only? Thereupon he (the Holy Prophet) said: No, but the people at large."}},{"id":51,"idInBook":51,"chapterId":50,"bookId":2,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا أَبُو النُّعْمَانِ الْحَكَمُ بْنُ عَبْدِ اللَّهِ الْعِجْلِيُّ، حَدَّثَنَا شُعْبَةُ،\nعَنْ سِمَاكِ بْنِ حَرْبٍ، قَالَ سَمِعْتُ إِبْرَاهِيمَ، يُحَدِّثُ عَنْ خَالِهِ الأَسْوَدِ، عَنْ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ\nصلى الله عليه وسلم بِمَعْنَى حَدِيثِ أَبِي الأَحْوَصِ وَقَالَ فِي حَدِيثِهِ فَقَالَ مُعَاذٌ يَا رَسُولَ\nاللَّهِ هَذَا لِهَذَا خَاصَّةً أَوْ لَنَا عَامَّةً قَالَ ‏\n\"‏ بَلْ لَكُمْ عَامَّةً ‏\"‏ ‏.‏","english":{"narrator":"This hadith has been transmitted by Abu al-Ahwas and in this (these words are) also found:","text":"Mu'adh said: Allah's Messenger, does it concern this particular case or to all of us? And he (the Holy Prophet) said: Of course, to all of you."}},{"id":52,"idInBook":52,"chapterId":50,"bookId":2,"arabic":"حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ، حَدَّثَنَا عَمْرُو بْنُ عَاصِمٍ، حَدَّثَنَا هَمَّامٌ، عَنْ إِسْحَاقَ،\nبْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ عَنْ أَنَسٍ، قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ\nيَا رَسُولَ اللَّهِ أَصَبْتُ حَدًّا فَأَقِمْهُ عَلَىَّ - قَالَ - وَحَضَرَتِ الصَّلاَةُ فَصَلَّى مَعَ رَسُولِ اللَّهِ\nصلى الله عليه وسلم فَلَمَّا قَضَى الصَّلاَةَ قَالَ يَا رَسُولَ اللَّهِ إِنِّي أَصَبْتُ حَدًّا فَأَقِمْ فِيَّ\nكِتَابَ اللَّهِ ‏.‏ قَالَ ‏\"‏ هَلْ حَضَرْتَ الصَّلاَةَ مَعَنَا ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏ قَالَ ‏\"‏ قَدْ غُفِرَ لَكَ ‏\"‏ ‏.‏","english":{"narrator":"Anas reported that a person came to Allah's Apostle (ﷺ) said:","text":"Allah's Messenger, I have committed an offence which deserves imposition of haad, so impose it upon me according to the Book of Allah. Thereupon he said: Were you not present with us at the time of prayer? He said: Yes. Thereupon he said: You have been granted pardon."}},{"id":53,"idInBook":53,"chapterId":50,"bookId":2,"arabic":"حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، وَزُهَيْرُ بْنُ حَرْبٍ، - وَاللَّفْظُ لِزُهَيْرٍ - قَالاَ حَدَّثَنَا \n عُمَرُ بْنُ يُونُسَ، حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ، حَدَّثَنَا شَدَّادٌ، حَدَّثَنَا أَبُو أُمَامَةَ، قَالَ بَيْنَمَا رَسُولُ\n اللَّهِ صلى الله عليه وسلم فِي الْمَسْجِدِ وَنَحْنُ قُعُودٌ مَعَهُ إِذْ جَاءَ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ\n إِنِّي أَصَبْتُ حَدًّا فَأَقِمْهُ عَلَىَّ ‏.‏ فَسَكَتَ عَنْهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ أَعَادَ فَقَالَ\n يَا رَسُولَ اللَّهِ إِنِّي أَصَبْتُ حَدًّا فَأَقِمْهُ عَلَىَّ ‏.‏ فَسَكَتَ عَنْهُ وَأُقِيمَتِ الصَّلاَةُ فَلَمَّا انْصَرَفَ\n نَبِيُّ اللَّهِ صلى الله عليه وسلم قَالَ أَبُو أُمَامَةَ فَاتَّبَعَ الرَّجُلُ رَسُولَ اللَّهِ صلى الله عليه وسلم\n حِينَ انْصَرَفَ وَاتَّبَعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم أَنْظُرُ مَا يَرُدُّ عَلَى الرَّجُلِ فَلَحِقَ\n الرَّجُلُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي أَصَبْتُ حَدًّا فَأَقِمْهُ عَلَىَّ\n - قَالَ أَبُو أُمَامَةَ - فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَرَأَيْتَ حِينَ خَرَجْتَ مِنْ\n بَيْتِكَ أَلَيْسَ قَدْ تَوَضَّأْتَ فَأَحْسَنْتَ الْوُضُوءَ ‏\"‏ ‏.‏ قَالَ بَلَى يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\"‏ ثُمَّ شَهِدْتَ\n الصَّلاَةَ مَعَنَا ‏\"‏ ‏.‏ فَقَالَ نَعَمْ يَا رَسُولَ اللَّهِ ‏.‏ قَالَ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم\n ‏\"‏ فَإِنَّ اللَّهَ قَدْ غَفَرَ لَكَ حَدَّكَ - أَوْ قَالَ - ذَنْبَكَ ‏\"‏ ‏.‏","english":{"narrator":"Abu Umama reported:","text":"We were sitting in the mosque in the company of Allah's Messenger (ﷺ). A person came there and said: Allah's Messenger, I have committed an offence which deserves the imposition of hadd upon me, so impose it upon me. Allah's Messenger (ﷺ) kept silent. He repeated it and said: Allah's Messenger, I have committed an offence which deserves the imposition of hadd upon me, so impose it upon me. He (the Holy Prophet) kept silent, and it was at this time that Iqama was pronounced for prayer (and the prayer was observed). And when Allah's Apostle (ﷺ) had concluded the payer that person followed Allah's Messenger (ﷺ). Abu Umama said: I too followed Allah's Messenger (ﷺ) after he had concluded the prayer, so that I should know what answer he would give to that person. That person remained attached to Allah's Messenger (ﷺ) and said: Allah's Messenger, I have committed an offence which deserves imposition of hadd upon me, so impose it upon me. Abu Umama reported that Allah's Messenger (ﷺ) said to him: Didn't you see that as you got out of the house, you performed ablution perfectly well. He said: Allah's Messenger, of course. I did it. He again said to him: Then you observed prayer along with us. He said: Allah's Messenger, yes, it is so. Thereupon Allah's Messenger (ﷺ) said to him: Verily, Allah has exempted you from the imposition of hadd, or he said. From your sin."}},{"id":54,"idInBook":54,"chapterId":50,"bookId":2,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، - وَاللَّفْظُ لاِبْنِ الْمُثَنَّى - قَالَ حَدَّثَنَا \nمُعَاذُ بْنُ هِشَامٍ، حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، عَنْ أَبِي الصِّدِّيقِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ نَبِيَّ\nاللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ كَانَ فِيمَنْ كَانَ قَبْلَكُمْ رَجُلٌ قَتَلَ تِسْعَةً وَتِسْعِينَ نَفْسًا\nفَسَأَلَ عَنْ أَعْلَمِ أَهْلِ الأَرْضِ فَدُلَّ عَلَى رَاهِبٍ فَأَتَاهُ فَقَالَ إِنَّهُ قَتَلَ تِسْعَةً وَتِسْعِينَ نَفْسًا\nفَهَلْ لَهُ مِنَ تَوْبَةٍ فَقَالَ لاَ ‏.‏ فَقَتَلَهُ فَكَمَّلَ بِهِ مِائَةً ثُمَّ سَأَلَ عَنْ أَعْلَمِ أَهْلِ الأَرْضِ فَدُلَّ عَلَى\nرَجُلٍ عَالِمٍ فَقَالَ إِنَّهُ قَتَلَ مِائَةَ نَفْسٍ فَهَلْ لَهُ مِنْ تَوْبَةٍ فَقَالَ نَعَمْ وَمَنْ يَحُولُ بَيْنَهُ وَبَيْنَ التَّوْبَةِ\nانْطَلِقْ إِلَى أَرْضِ كَذَا وَكَذَا فَإِنَّ بِهَا أُنَاسًا يَعْبُدُونَ اللَّهَ فَاعْبُدِ اللَّهَ مَعَهُمْ وَلاَ تَرْجِعْ إِلَى\nأَرْضِكَ فَإِنَّهَا أَرْضُ سَوْءٍ ‏.‏ فَانْطَلَقَ حَتَّى إِذَا نَصَفَ الطَّرِيقَ أَتَاهُ الْمَوْتُ فَاخْتَصَمَتْ فِيهِ\nمَلاَئِكَةُ الرَّحْمَةِ وَمَلاَئِكَةُ الْعَذَابِ فَقَالَتْ مَلاَئِكَةُ الرَّحْمَةِ جَاءَ تَائِبًا مُقْبِلاً بِقَلْبِهِ إِلَى اللَّهِ ‏.‏ وَقَالَتْ\nمَلاَئِكَةُ الْعَذَابِ إِنَّهُ لَمْ يَعْمَلْ خَيْرًا قَطُّ ‏.‏ فَأَتَاهُمْ مَلَكٌ فِي صُورَةِ آدَمِيٍّ فَجَعَلُوهُ بَيْنَهُمْ فَقَالَ\nقِيسُوا مَا بَيْنَ الأَرْضَيْنِ فَإِلَى أَيَّتِهِمَا كَانَ أَدْنَى فَهُوَ لَهُ ‏.‏ فَقَاسُوهُ فَوَجَدُوهُ أَدْنَى إِلَى الأَرْضِ\nالَّتِي أَرَادَ فَقَبَضَتْهُ مَلاَئِكَةُ الرَّحْمَةِ ‏\"‏ ‏.‏ قَالَ قَتَادَةُ فَقَالَ الْحَسَنُ ذُكِرَ لَنَا أَنَّهُ لَمَّا أَتَاهُ الْمَوْتُ\nنَأَى بِصَدْرِهِ ‏.‏","english":{"narrator":"Abu Sa'id al-Khudri reported Allah's Messenger (ﷺ) as saying:","text":"There was a person before you who had killed ninety-nine persons and then made an inquiry about the learned persons of the world (who could show him the way to salvation). He was directed to a monk. He came to him and told him that he had killed ninety-nine persons and asked him whether there was any scope for his repentance to be accepted. He said: No. He killed him also and thus completed one hundred. He then asked about the learned persons of the earth and he was directed to a scholar, and he told him that he had killed one hundred persons and asked him whether there was any scope for his repentance to be accepted. He said: Yes; what stands between you and the repentance? You better go to such and such land; there are people devoted to prayer and worship and you also worship along with them and do not come to the land of yours since it was an evil land (for you). So he went away and he had hardly covered half the distance when death came to him and there was a dispute between the angels of mercy and the angels of punishment. The angels of mercy said: This man has come as a penitant and remorseful to Allah and the angels of punishment said: He has done no good at all. Then there came another angel in the form of a human being in order to decide between them. He said: You measure the land to which he has drawn near. They measured it and found him nearer to the land where he intended to go (the land of piety), and so the angels of mercy took possession of it. Qatada said that Hasan told him that it was said to them that as death approached him, he crawled upon his chest (and managed) to slip in the land of mercy."}},{"id":55,"idInBook":55,"chapterId":50,"bookId":2,"arabic":"حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، أَنَّهُ سَمِعَ \n أَبَا الصِّدِّيقِ النَّاجِيَّ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنِ النَّبِيِّ صلى الله عليه وسلم ‏\n\"‏ أَنَّ رَجُلاً\n قَتَلَ تِسْعَةً وَتِسْعِينَ نَفْسًا فَجَعَلَ يَسْأَلُ هَلْ لَهُ مِنْ تَوْبَةٍ فَأَتَى رَاهِبًا فَسَأَلَهُ فَقَالَ لَيْسَتْ\n لَكَ تَوْبَةٌ ‏.‏ فَقَتَلَ الرَّاهِبَ ثُمَّ جَعَلَ يَسْأَلُ ثُمَّ خَرَجَ مِنْ قَرْيَةٍ إِلَى قَرْيَةٍ فِيهَا قَوْمٌ صَالِحُونَ\n فَلَمَّا كَانَ فِي بَعْضِ الطَّرِيقِ أَدْرَكَهُ الْمَوْتُ فَنَأَى بِصَدْرِهِ ثُمَّ مَاتَ فَاخْتَصَمَتْ فِيهِ مَلاَئِكَةُ\n الرَّحْمَةِ وَمَلاَئِكَةُ الْعَذَابِ فَكَانَ إِلَى الْقَرْيَةِ الصَّالِحَةِ أَقْرَبَ مِنْهَا بِشِبْرٍ فَجُعِلَ مِنْ أَهْلِهَا ‏\"‏\n ‏.‏","english":{"narrator":"Abu Sa'id al-Khudri reported Allah's Messenger (ﷺ) as saying that a man killed ninety-nine persons and then he began to make an inquiry whether there was any way left for him for repentance. He came to a monk and asked him about that, and he said:","text":"There is no chance for repentance for you. He killed the monk also and then began to make an inquiry and moved from one village to another village where there lived pious persons, and as he had covered some distance, he was overtaken by death, but he managed to crawl upon his chest (to the side nearer to the place where the pious men lived). He died and then there was a dispute between the angels of mercy and the angels of punishment and (when it was measured) he was found to be nearer to the village where pious persons were living equal to the Space of a span and he was thus included among them."}},{"id":56,"idInBook":56,"chapterId":50,"bookId":2,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، بِهَذَا الإِسْنَادِ\n نَحْوَ حَدِيثِ مُعَاذِ بْنِ مُعَاذٍ وَزَادَ فِيهِ ‏\n\"‏ فَأَوْحَى اللَّهُ إِلَى هَذِهِ أَنْ تَبَاعَدِي وَإِلَى هَذِهِ أَنْ\n تَقَرَّبِي ‏\"‏ ‏.‏","english":{"narrator":"This hadith has been narrated on the authority of Qatida with the same chain of transmitters but (with this variation of wording):","text":"\" Allah commanded the earth (from where) he wanted to come out to move itself away and to the other earth (where he wanted to go) to draw nearer.\""}},{"id":57,"idInBook":57,"chapterId":50,"bookId":2,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ طَلْحَةَ بْنِ يَحْيَى، عَنْ أَبِي،\n بُرْدَةَ عَنْ أَبِي مُوسَى، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا كَانَ يَوْمُ الْقِيَامَةِ\n دَفَعَ اللَّهُ عَزَّ وَجَلَّ إِلَى كُلِّ مُسْلِمٍ يَهُودِيًّا أَوْ نَصْرَانِيًّا فَيَقُولُ هَذَا فَكَاكُكَ مِنَ النَّارِ ‏\"‏ ‏.‏","english":{"narrator":"Abu Musa' reported that Allah's Messenger (ﷺ) said:","text":"When it will be the Day of Resurrection Allah would deliver to every Muslim a Jew or a Christian and say: That is your rescue from Hell-Fire."}},{"id":58,"idInBook":58,"chapterId":50,"bookId":2,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَفَّانُ بْنُ مُسْلِمٍ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا قَتَادَةُ،\n أَنَّ عَوْنًا، وَسَعِيدَ بْنَ أَبِي بُرْدَةَ، حَدَّثَاهُ أَنَّهُمَا، شَهِدَا أَبَا بُرْدَةَ يُحَدِّثُ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ\n عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَمُوتُ رَجُلٌ مُسْلِمٌ إِلاَّ أَدْخَلَ اللَّهُ مَكَانَهُ\n النَّارَ يَهُودِيًّا أَوْ نَصْرَانِيًّا ‏\"‏ ‏.‏ قَالَ فَاسْتَحْلَفَهُ عُمَرُ بْنُ عَبْدِ الْعَزِيزِ بِاللَّهِ الَّذِي لاَ إِلَهَ إِلاَّ\n هُوَ ثَلاَثَ مَرَّاتٍ أَنَّ أَبَاهُ حَدَّثَهُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ فَحَلَفَ لَهُ - قَالَ\n - فَلَمْ يُحَدِّثْنِي سَعِيدٌ أَنَّهُ اسْتَحْلَفَهُ وَلَمْ يُنْكِرْ عَلَى عَوْنٍ قَوْلَهُ ‏.‏","english":{"narrator":"Abu Burda reported on the authority of his father that Allah's Apostle (ﷺ) said:","text":"No Muslim would die but Allah would admit in his stead a Jew or a Christian in Hell-Fire. 'Umar b. Abd al-'Aziz took an oath: By One besides Whom there is no god but He, thrice that his father had narrated that to him from Allah's Messenger (ﷺ)."}},{"id":59,"idInBook":59,"chapterId":50,"bookId":2,"arabic":"حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، جَمِيعًا عَنْ عَبْدِ الصَّمَدِ بْنِ عَبْدِ،\n الْوَارِثِ أَخْبَرَنَا هَمَّامٌ، حَدَّثَنَا قَتَادَةُ، بِهَذَا الإِسْنَادِ نَحْوَ حَدِيثِ عَفَّانَ وَقَالَ عَوْنُ بْنُ عُتْبَةَ\n ‏.‏","english":{"narrator":"","text":"This hadith has been transmitted on the authority of 'Aun b. Utba."}},{"id":60,"idInBook":60,"chapterId":50,"bookId":2,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرِو بْنِ عَبَّادِ بْنِ جَبَلَةَ بْنِ أَبِي رَوَّادٍ، حَدَّثَنَا حَرَمِيُّ بْنُ عُمَارَةَ،\n حَدَّثَنَا شَدَّادٌ أَبُو طَلْحَةَ الرَّاسِبِيُّ، عَنْ غَيْلاَنَ بْنِ جَرِيرٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ\n صلى الله عليه وسلم قَالَ ‏\n\"‏ يَجِيءُ يَوْمَ الْقِيَامَةِ نَاسٌ مِنَ الْمُسْلِمِينَ بِذُنُوبٍ أَمْثَالِ الْجِبَالِ\n فَيَغْفِرُهَا اللَّهُ لَهُمْ وَيَضَعُهَا عَلَى الْيَهُودِ وَالنَّصَارَى ‏\"‏ ‏.‏ فِيمَا أَحْسِبُ أَنَا ‏.‏ قَالَ أَبُو رَوْحٍ\n لاَ أَدْرِي مِمَّنِ الشَّكُّ ‏.‏ قَالَ أَبُو بُرْدَةَ فَحَدَّثْتُ بِهِ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ فَقَالَ أَبُوكَ حَدَّثَكَ هَذَا\n عَنِ النَّبِيِّ صلى الله عليه وسلم قُلْتُ نَعَمْ ‏.‏","english":{"narrator":"Abu Burda reported Allah's Messenger (ﷺ) as saying:","text":"There would come people amongst the Muslims on the Day of Resurrection with as heavy sins as a mountain, and Allah would forgive them and He would place in their stead the Jews and the Christians. (As far as I think), Abu Raub said: I do not know as to who is in doubt. Abu Burda said: I narrated it to 'Umar b. 'Abd al-'Aziz, whereupon he said: Was it your father who narrated it to you from Allah's Apostle (ﷺ)? I said: Yes."}},{"id":61,"idInBook":61,"chapterId":50,"bookId":2,"arabic":"حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، عَنْ هِشَامٍ الدَّسْتَوَائِيِّ، عَنْ \n قَتَادَةَ، عَنْ صَفْوَانَ بْنِ مُحْرِزٍ، قَالَ قَالَ رَجُلٌ لاِبْنِ عُمَرَ كَيْفَ سَمِعْتَ رَسُولَ اللَّهِ صلى الله\n عليه وسلم يَقُولُ فِي النَّجْوَى قَالَ سَمِعْتُهُ يَقُولُ ‏\n\"‏ يُدْنَى الْمُؤْمِنُ يَوْمَ الْقِيَامَةِ مِنْ رَبِّهِ عَزَّ\n وَجَلَّ حَتَّى يَضَعَ عَلَيْهِ كَنَفَهُ فَيُقَرِّرُهُ بِذُنُوبِهِ فَيَقُولُ هَلْ تَعْرِفُ فَيَقُولُ أَىْ رَبِّ أَعْرِفُ ‏.‏ قَالَ\n فَإِنِّي قَدْ سَتَرْتُهَا عَلَيْكَ فِي الدُّنْيَا وَإِنِّي أَغْفِرُهَا لَكَ الْيَوْمَ ‏.‏ فَيُعْطَى صَحِيفَةَ حَسَنَاتِهِ وَأَمَّا\n الْكُفَّارُ وَالْمُنَافِقُونَ فَيُنَادَى بِهِمْ عَلَى رُءُوسِ الْخَلاَئِقِ هَؤُلاَءِ الَّذِينَ كَذَبُوا عَلَى اللَّهِ ‏\"‏ ‏.‏","english":{"narrator":"Safwan b. Muhriz reported that a person said to Ibn 'Umar:","text":"How did you hear Allah's Messenger (ﷺ) as saying something about intimate conversation? He said: I heard him say: A believer will be brought to his Lord, the Exalted and Glorious, on the Day of Resurrection and He would place upon him His veil (of Light) and make him confess his faults and say: Do you recognise (your faults)? He would say: My Lord, I do recognise (them). He (the Lord) would say: I concealed them for you in the world. And today I forgive them. And he would then be given the Book containing (the account of his) good deeds. And so far as the non-believers and hypocrites are concerned, there would be general announcement about them before all creation telling them that these (people, i. e. non-believers and hypocrites) told a lie about Allah."}},{"id":62,"idInBook":62,"chapterId":50,"bookId":2,"arabic":"حَدَّثَنِي أَبُو الطَّاهِرِ، أَحْمَدُ بْنُ عَمْرِو بْنِ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ سَرْحٍ مَوْلَى بَنِي\n أُمَيَّةَ أَخْبَرَنِي ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ ثُمَّ غَزَا رَسُولُ اللَّهِ صلى الله\n عليه وسلم غَزْوَةَ تَبُوكَ وَهُوَ يُرِيدُ الرُّومَ وَنَصَارَى الْعَرَبِ بِالشَّامِ ‏.‏ قَالَ ابْنُ شِهَابٍ فَأَخْبَرَنِي\n عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ كَعْبِ بْنِ مَالِكٍ أَنَّ عَبْدَ اللَّهِ بْنَ كَعْبٍ كَانَ قَائِدَ كَعْبٍ مِنْ بَنِيهِ\n حِينَ عَمِيَ قَالَ سَمِعْتُ كَعْبَ بْنَ مَالِكٍ يُحَدِّثُ حَدِيثَهُ حِينَ تَخَلَّفَ عَنْ رَسُولِ اللَّهِ صلى الله\n عليه وسلم فِي غَزْوَةِ تَبُوكَ قَالَ كَعْبُ بْنُ مَالِكٍ لَمْ أَتَخَلَّفْ عَنْ رَسُولِ اللَّهِ صلى الله عليه\n وسلم فِي غَزْوَةٍ غَزَاهَا قَطُّ إِلاَّ فِي غَزْوَةِ تَبُوكَ غَيْرَ أَنِّي قَدْ تَخَلَّفْتُ فِي غَزْوَةِ بَدْرٍ وَلَمْ\n يُعَاتِبْ أَحَدًا تَخَلَّفَ عَنْهُ إِنَّمَا خَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَالْمُسْلِمُونَ يُرِيدُونَ\n عِيرَ قُرَيْشٍ حَتَّى جَمَعَ اللَّهُ بَيْنَهُمْ وَبَيْنَ عَدُوِّهُمْ عَلَى غَيْرِ مِيعَادٍ وَلَقَدْ شَهِدْتُ مَعَ رَسُولِ\n اللَّهِ صلى الله عليه وسلم لَيْلَةَ الْعَقَبَةِ حِينَ تَوَاثَقْنَا عَلَى الإِسْلاَمِ وَمَا أُحِبُّ أَنَّ لِي بِهَا مَشْهَدَ\n بَدْرٍ وَإِنْ كَانَتْ بَدْرٌ أَذْكَرَ فِي النَّاسِ مِنْهَا وَكَانَ مِنْ خَبَرِي حِينَ تَخَلَّفْتُ عَنْ رَسُولِ اللَّهِ\n صلى الله عليه وسلم فِي غَزْوَةِ تَبُوكَ أَنِّي لَمْ أَكُنْ قَطُّ أَقْوَى وَلاَ أَيْسَرَ مِنِّي حِينَ تَخَلَّفْتُ\n عَنْهُ فِي تِلْكَ الْغَزْوَةِ وَاللَّهِ مَا جَمَعْتُ قَبْلَهَا رَاحِلَتَيْنِ قَطُّ حَتَّى جَمَعْتُهُمَا فِي تِلْكَ الْغَزْوَةِ\n فَغَزَاهَا رَسُولُ اللَّهِ صلى الله عليه وسلم فِي حَرٍّ شَدِيدٍ وَاسْتَقْبَلَ سَفَرًا بَعِيدًا وَمَفَازًا وَاسْتَقْبَلَ\n عَدُوًّا كَثِيرًا فَجَلاَ لِلْمُسْلِمِينَ أَمْرَهُمْ لِيَتَأَهَّبُوا أُهْبَةَ غَزْوِهِمْ فَأَخْبَرَهُمْ بِوَجْهِهِمُ الَّذِي يُرِيدُ\n وَالْمُسْلِمُونَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم كَثِيرٌ وَلاَ يَجْمَعُهُمْ كِتَابُ حَافِظٍ - يُرِيدُ\n بِذَلِكَ الدِّيوَانَ - قَالَ كَعْبٌ فَقَلَّ رَجُلٌ يُرِيدُ أَنْ يَتَغَيَّبَ يَظُنُّ أَنَّ ذَلِكَ سَيَخْفَى لَهُ مَا لَمْ يَنْزِلْ\n فِيهِ وَحْىٌ مِنَ اللَّهِ عَزَّ وَجَلَّ وَغَزَا رَسُولُ اللَّهِ صلى الله عليه وسلم تِلْكَ الْغَزْوَةَ حِينَ طَابَتِ\n الثِّمَارُ وَالظِّلاَلُ فَأَنَا إِلَيْهَا أَصْعَرُ فَتَجَهَّزَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَالْمُسْلِمُونَ مَعَهُ\n وَطَفِقْتُ أَغْدُو لِكَىْ أَتَجَهَّزَ مَعَهُمْ فَأَرْجِعُ وَلَمْ أَقْضِ شَيْئًا ‏.‏ وَأَقُولُ فِي نَفْسِي أَنَا قَادِرٌ\n عَلَى ذَلِكَ إِذَا أَرَدْتُ ‏.‏ فَلَمْ يَزَلْ ذَلِكَ يَتَمَادَى بِي حَتَّى اسْتَمَرَّ بِالنَّاسِ الْجِدُّ فَأَصْبَحَ رَسُولُ\n اللَّهِ صلى الله عليه وسلم غَادِيًا وَالْمُسْلِمُونَ مَعَهُ وَلَمْ أَقْضِ مِنْ جَهَازِي شَيْئًا ثُمَّ غَدَوْتُ\n فَرَجَعْتُ وَلَمْ أَقْضِ شَيْئًا فَلَمْ يَزَلْ ذَلِكَ يَتَمَادَى بِي حَتَّى أَسْرَعُوا وَتَفَارَطَ الْغَزْوُ فَهَمَمْتُ\n أَنْ أَرْتَحِلَ فَأُدْرِكَهُمْ فَيَا لَيْتَنِي فَعَلْتُ ثُمَّ لَمْ يُقَدَّرْ ذَلِكَ لِي فَطَفِقْتُ إِذَا خَرَجْتُ فِي النَّاسِ\n بَعْدَ خُرُوجِ رَسُولِ اللَّهِ صلى الله عليه وسلم يَحْزُنُنِي أَنِّي لاَ أَرَى لِي أُسْوَةً إِلاَّ رَجُلاً مَغْمُوصًا\n عَلَيْهِ فِي النِّفَاقِ أَوْ رَجُلاً مِمَّنْ عَذَرَ اللَّهُ مِنَ الضُّعَفَاءِ وَلَمْ يَذْكُرْنِي رَسُولُ اللَّهِ صلى الله عليه\n وسلم حَتَّى بَلَغَ تَبُوكًا فَقَالَ وَهُوَ جَالِسٌ فِي الْقَوْمِ بِتَبُوكَ ‏\"‏ مَا فَعَلَ كَعْبُ بْنُ مَالِكٍ ‏\"‏ ‏.‏\n قَالَ رَجُلٌ مِنْ بَنِي سَلِمَةَ يَا رَسُولَ اللَّهِ حَبَسَهُ بُرْدَاهُ وَالنَّظَرُ فِي عِطْفَيْهِ ‏.‏ فَقَالَ لَهُ مُعَاذُ\n بْنُ جَبَلٍ بِئْسَ مَا قُلْتَ وَاللَّهِ يَا رَسُولَ اللَّهِ مَا عَلِمْنَا عَلَيْهِ إِلاَّ خَيْرًا ‏.‏ فَسَكَتَ رَسُولُ اللَّهِ\n صلى الله عليه وسلم فَبَيْنَمَا هُوَ عَلَى ذَلِكَ رَأَى رَجُلاً مُبَيِّضًا يَزُولُ بِهِ السَّرَابُ فَقَالَ رَسُولُ\n اللَّهِ صلى الله عليه وسلم ‏\"‏ كُنْ أَبَا خَيْثَمَةَ ‏\"‏ ‏.‏ فَإِذَا هُو أَبُو خَيْثَمَةَ الأَنْصَارِيُّ وَهُوَ الَّذِي\n تَصَدَّقَ بِصَاعِ التَّمْرِ حِينَ لَمَزَهُ الْمُنَافِقُونَ ‏.‏ فَقَالَ كَعْبُ بْنُ مَالِكٍ فَلَمَّا بَلَغَنِي أَنَّ رَسُولَ اللَّهِ\n صلى الله عليه وسلم قَدْ تَوَجَّهَ قَافِلاً مِنْ تَبُوكَ حَضَرَنِي بَثِّي فَطَفِقْتُ أَتَذَكَّرُ الْكَذِبَ وَأَقُولُ\n بِمَ أَخْرُجُ مِنْ سَخَطِهِ غَدًا وَأَسْتَعِينُ عَلَى ذَلِكَ كُلَّ ذِي رَأْىٍ مِنْ أَهْلِي فَلَمَّا قِيلَ لِي إِنَّ رَسُولَ\n اللَّهِ صلى الله عليه وسلم قَدْ أَظَلَّ قَادِمًا زَاحَ عَنِّي الْبَاطِلُ حَتَّى عَرَفْتُ أَنِّي لَنْ أَنْجُوَ مِنْهُ\n بِشَىْءٍ أَبَدًا فَأَجْمَعْتُ صِدْقَهُ وَصَبَّحَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَادِمًا وَكَانَ إِذَا قَدِمَ\n مِنْ سَفَرٍ بَدَأَ بِالْمَسْجِدِ فَرَكَعَ فِيهِ رَكْعَتَيْنِ ثُمَّ جَلَسَ لِلنَّاسِ فَلَمَّا فَعَلَ ذَلِكَ جَاءَهُ الْمُخَلَّفُونَ\n فَطَفِقُوا يَعْتَذِرُونَ إِلَيْهِ وَيَحْلِفُونَ لَهُ وَكَانُوا بِضْعَةً وَثَمَانِينَ رَجُلاً فَقَبِلَ مِنْهُمْ رَسُولُ اللَّهِ صلى\n الله عليه وسلم عَلاَنِيَتَهُمْ وَبَايَعَهُمْ وَاسْتَغْفَرَ لَهُمْ وَوَكَلَ سَرَائِرَهُمْ إِلَى اللَّهِ حَتَّى جِئْتُ فَلَمَّا\n سَلَّمْتُ تَبَسَّمَ تَبَسُّمَ الْمُغْضَبِ ثُمَّ قَالَ ‏\"‏ تَعَالَ ‏\"‏ ‏.‏ فَجِئْتُ أَمْشِي حَتَّى جَلَسْتُ بَيْنَ يَدَيْهِ فَقَالَ\n لِي ‏\"‏ مَا خَلَّفَكَ ‏\"‏ ‏.‏ أَلَمْ تَكُنْ قَدِ ابْتَعْتَ ظَهْرَكَ ‏\"‏ ‏.‏ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ إِنِّي وَاللَّهِ لَوْ\n جَلَسْتُ عِنْدَ غَيْرِكَ مِنْ أَهْلِ الدُّنْيَا لَرَأَيْتُ أَنِّي سَأَخْرُجُ مِنْ سَخَطِهِ بِعُذْرٍ وَلَقَدْ أُعْطِيتُ جَدَلاً\n وَلَكِنِّي وَاللَّهِ لَقَدْ عَلِمْتُ لَئِنْ حَدَّثْتُكَ الْيَوْمَ حَدِيثَ كَذِبٍ تَرْضَى بِهِ عَنِّي لَيُوشِكَنَّ اللَّهُ أَنْ يُسْخِطَكَ\n عَلَىَّ وَلَئِنْ حَدَّثْتُكَ حَدِيثَ صِدْقٍ تَجِدُ عَلَىَّ فِيهِ إِنِّي لأَرْجُو فِيهِ عُقْبَى اللَّهِ وَاللَّهِ مَا كَانَ لِي\n عُذْرٌ وَاللَّهِ مَا كُنْتُ قَطُّ أَقْوَى وَلاَ أَيْسَرَ مِنِّي حِينَ تَخَلَّفْتُ عَنْكَ ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله\n عليه وسلم ‏\"‏ أَمَّا هَذَا فَقَدْ صَدَقَ فَقُمْ حَتَّى يَقْضِيَ اللَّهُ فِيكَ ‏\"‏ ‏.‏ فَقُمْتُ وَثَارَ رِجَالٌ مِنْ بَنِي\n سَلِمَةَ فَاتَّبَعُونِي فَقَالُوا لِي وَاللَّهِ مَا عَلِمْنَاكَ أَذْنَبْتَ ذَنْبًا قَبْلَ هَذَا لَقَدْ عَجَزْتَ فِي أَنْ لاَ\n تَكُونَ اعْتَذَرْتَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم بِمَا اعْتَذَرَ بِهِ إِلَيْهِ الْمُخَلَّفُونَ فَقَدْ كَانَ\n كَافِيَكَ ذَنْبَكَ اسْتِغْفَارُ رَسُولِ اللَّهِ صلى الله عليه وسلم لَكَ ‏.‏ قَالَ فَوَاللَّهِ مَا زَالُوا يُؤَنِّبُونَنِي\n حَتَّى أَرَدْتُ أَنْ أَرْجِعَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَأُكَذِّبَ نَفْسِي - قَالَ - ثُمَّ\n قُلْتُ لَهُمْ هَلْ لَقِيَ هَذَا مَعِي مِنْ أَحَدٍ قَالُوا نَعَمْ لَقِيَهُ مَعَكَ رَجُلاَنِ قَالاَ مِثْلَ مَا قُلْتَ فَقِيلَ\n لَهُمَا مِثْلُ مَا قِيلَ لَكَ - قَالَ - قُلْتُ مَنْ هُمَا قَالُوا مُرَارَةُ بْنُ رَبِيعَةَ الْعَامِرِيُّ وَهِلاَلُ بْنُ\n أُمَيَّةَ الْوَاقِفِيُّ - قَالَ - فَذَكَرُوا لِي رَجُلَيْنِ صَالِحَيْنِ قَدْ شِهِدَا بَدْرًا فِيهِمَا أُسْوَةٌ - قَالَ\n - فَمَضَيْتُ حِينَ ذَكَرُوهُمَا لِي ‏.‏ قَالَ وَنَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم الْمُسْلِمِينَ عَنْ\n كَلاَمِنَا أَيُّهَا الثَّلاَثَةُ مِنْ بَيْنِ مَنْ تَخَلَّفَ عَنْهُ - قَالَ - فَاجْتَنَبَنَا النَّاسُ - وَقَالَ - تَغَيَّرُوا\n لَنَا حَتَّى تَنَكَّرَتْ لِي فِي نَفْسِيَ الأَرْضُ فَمَا هِيَ بِالأَرْضِ الَّتِي أَعْرِفُ فَلَبِثْنَا عَلَى ذَلِكَ خَمْسِينَ\n لَيْلَةً فَأَمَّا صَاحِبَاىَ فَاسْتَكَانَا وَقَعَدَا فِي بُيُوتِهِمَا يَبْكِيَانِ وَأَمَّا أَنَا فَكُنْتُ أَشَبَّ الْقَوْمِ وَأَجْلَدَهُمْ\n فَكُنْتُ أَخْرُجُ فَأَشْهَدُ الصَّلاَةَ وَأَطُوفُ فِي الأَسْوَاقِ وَلاَ يُكَلِّمُنِي أَحَدٌ وَآتِي رَسُولَ اللَّهِ صلى\n الله عليه وسلم فَأُسَلِّمُ عَلَيْهِ وَهُوَ فِي مَجْلِسِهِ بَعْدَ الصَّلاَةِ فَأَقُولُ فِي نَفْسِي هَلْ حَرَّكَ شَفَتَيْهِ\n بِرَدِّ السَّلاَمِ أَمْ لاَ ثُمَّ أُصَلِّي قَرِيبًا مِنْهُ وَأُسَارِقُهُ النَّظَرَ فَإِذَا أَقْبَلْتُ عَلَى صَلاَتِي نَظَرَ إِلَىَّ\n وَإِذَا الْتَفَتُّ نَحْوَهُ أَعْرَضَ عَنِّي حَتَّى إِذَا طَالَ ذَلِكَ عَلَىَّ مِنْ جَفْوَةِ الْمُسْلِمِينَ مَشَيْتُ حَتَّى\n تَسَوَّرْتُ جِدَارَ حَائِطِ أَبِي قَتَادَةَ وَهُوَ ابْنُ عَمِّي وَأَحَبُّ النَّاسِ إِلَىَّ فَسَلَّمْتُ عَلَيْهِ فَوَاللَّهِ\n مَا رَدَّ عَلَىَّ السَّلاَمَ فَقُلْتُ لَهُ يَا أَبَا قَتَادَةَ أَنْشُدُكَ بِاللَّهِ هَلْ تَعْلَمَنَّ أَنِّي أُحِبُّ اللَّهَ وَرَسُولَهُ\n قَالَ فَسَكَتَ فَعُدْتُ فَنَاشَدْتُهُ فَسَكَتَ فَعُدْتُ فَنَاشَدْتُهُ فَقَالَ اللَّهُ وَرَسُولُهُ أَعْلَمُ ‏.‏ فَفَاضَتْ\n عَيْنَاىَ وَتَوَلَّيْتُ حَتَّى تَسَوَّرْتُ الْجِدَارَ فَبَيْنَا أَنَا أَمْشِي فِي سُوقِ الْمَدِينَةِ إِذَا نَبَطِيٌّ مِنْ نَبَطِ\n أَهْلِ الشَّامِ مِمَّنْ قَدِمَ بِالطَّعَامِ يَبِيعُهُ بِالْمَدِينَةِ يَقُولُ مَنْ يَدُلُّ عَلَى كَعْبِ بْنِ مَالِكٍ - قَالَ\n - فَطَفِقَ النَّاسُ يُشِيرُونَ لَهُ إِلَىَّ حَتَّى جَاءَنِي فَدَفَعَ إِلَىَّ كِتَابًا مِنْ مَلِكِ غَسَّانَ وَكُنْتُ كَاتِبًا\n فَقَرَأْتُهُ فَإِذَا فِيهِ أَمَّا بَعْدُ فَإِنَّهُ قَدْ بَلَغَنَا أَنَّ صَاحِبَكَ قَدْ جَفَاكَ وَلَمْ يَجْعَلْكَ اللَّهُ بِدَارِ هَوَانٍ\n وَلاَ مَضْيَعَةٍ فَالْحَقْ بِنَا نُوَاسِكَ ‏.‏ قَالَ فَقُلْتُ حِينَ قَرَأْتُهَا وَهَذِهِ أَيْضًا مِنَ الْبَلاَءِ ‏.‏ فَتَيَامَمْتُ\n بِهَا التَّنُّورَ فَسَجَرْتُهَا بِهَا حَتَّى إِذَا مَضَتْ أَرْبَعُونَ مِنَ الْخَمْسِينَ وَاسْتَلْبَثَ الْوَحْىُ إِذَا رَسُولُ\n رَسُولِ اللَّهِ صلى الله عليه وسلم يَأْتِينِي فَقَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم يَأْمُرُكَ\n أَنْ تَعْتَزِلَ امْرَأَتَكَ ‏.‏ قَالَ فَقُلْتُ أُطَلِّقُهَا أَمْ مَاذَا أَفْعَلُ قَالَ لاَ بَلِ اعْتَزِلْهَا فَلاَ تَقْرَبَنَّهَا -\n قَالَ - فَأَرْسَلَ إِلَى صَاحِبَىَّ بِمِثْلِ ذَلِكَ - قَالَ - فَقُلْتُ لاِمْرَأَتِي الْحَقِي بِأَهْلِكِ فَكُونِي عِنْدَهُمْ\n حَتَّى يَقْضِيَ اللَّهُ فِي هَذَا الأَمْرِ - قَالَ - فَجَاءَتِ امْرَأَةُ هِلاَلِ بْنِ أُمَيَّةَ رَسُولَ اللَّهِ صلى\n الله عليه وسلم فَقَالَتْ لَهُ يَا رَسُولَ اللَّهِ إِنَّ هِلاَلَ بْنَ أُمَيَّةَ شَيْخٌ ضَائِعٌ لَيْسَ لَهُ خَادِمٌ فَهَلْ\n تَكْرَهُ أَنْ أَخْدُمَهُ قَالَ ‏\"‏ لاَ وَلَكِنْ لاَ يَقْرَبَنَّكِ ‏\"‏ ‏.‏ فَقَالَتْ إِنَّهُ وَاللَّهِ مَا بِهِ حَرَكَةٌ إِلَى شَىْءٍ وَوَاللَّهِ\n مَا زَالَ يَبْكِي مُنْذُ كَانَ مِنْ أَمْرِهِ مَا كَانَ إِلَى يَوْمِهِ هَذَا ‏.‏ قَالَ فَقَالَ لِي بَعْضُ أَهْلِي لَوِ اسْتَأْذَنْتَ\n رَسُولَ اللَّهِ صلى الله عليه وسلم فِي امْرَأَتِكَ فَقَدْ أَذِنَ لاِمْرَأَةِ هِلاَلِ بْنِ أُمَيَّةَ أَنْ تَخْدُمَهُ -\n قَالَ - فَقُلْتُ لاَ أَسْتَأْذِنُ فِيهَا رَسُولَ اللَّهِ صلى الله عليه وسلم وَمَا يُدْرِينِي مَاذَا يَقُولُ\n رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا اسْتَأْذَنْتُهُ فِيهَا وَأَنَا رَجُلٌ شَابٌّ - قَالَ - فَلَبِثْتُ\n بِذَلِكَ عَشْرَ لَيَالٍ فَكَمُلَ لَنَا خَمْسُونَ لَيْلَةً مِنْ حِينَ نُهِيَ عَنْ كَلاَمِنَا - قَالَ - ثُمَّ صَلَّيْتُ صَلاَةَ\n الْفَجْرِ صَبَاحَ خَمْسِينَ لَيْلَةً عَلَى ظَهْرِ بَيْتٍ مِنْ بُيُوتِنَا فَبَيْنَا أَنَا جَالِسٌ عَلَى الْحَالِ الَّتِي\n ذَكَرَ اللَّهُ عَزَّ وَجَلَّ مِنَّا قَدْ ضَاقَتْ عَلَىَّ نَفْسِي وَضَاقَتْ عَلَىَّ الأَرْضُ بِمَا رَحُبَتْ سَمِعْتُ\n صَوْتَ صَارِخٍ أَوْفَى عَلَى سَلْعٍ يَقُولُ بِأَعْلَى صَوْتِهِ يَا كَعْبَ بْنَ مَالِكٍ أَبْشِرْ - قَالَ - فَخَرَرْتُ\n سَاجِدًا وَعَرَفْتُ أَنْ قَدْ جَاءَ فَرَجٌ ‏.‏ - قَالَ - فَآذَنَ رَسُولُ اللَّهِ صلى الله عليه وسلم النَّاسَ\n بِتَوْبَةِ اللَّهِ عَلَيْنَا حِينَ صَلَّى صَلاَةَ الْفَجْرِ فَذَهَبَ النَّاسُ يُبَشِّرُونَنَا فَذَهَبَ قِبَلَ صَاحِبَىَّ مُبَشِّرُونَ\n وَرَكَضَ رَجُلٌ إِلَىَّ فَرَسًا وَسَعَى سَاعٍ مِنْ أَسْلَمَ قِبَلِي وَأَوْفَى الْجَبَلَ فَكَانَ الصَّوْتُ أَسْرَعَ\n مِنَ الْفَرَسِ فَلَمَّا جَاءَنِي الَّذِي سَمِعْتُ صَوْتَهُ يُبَشِّرُنِي فَنَزَعْتُ لَهُ ثَوْبَىَّ فَكَسَوْتُهُمَا إِيَّاهُ\n بِبِشَارَتِهِ وَاللَّهِ مَا أَمْلِكُ غَيْرَهُمَا يَوْمَئِذٍ وَاسْتَعَرْتُ ثَوْبَيْنِ ‏.‏ فَلَبِسْتُهُمَا فَانْطَلَقْتُ أَتَأَمَّمُ رَسُولَ\n اللَّهِ صلى الله عليه وسلم يَتَلَقَّانِي النَّاسُ فَوْجًا فَوْجًا يُهَنِّئُونِي بِالتَّوْبَةِ وَيَقُولُونَ لِتَهْنِئْكَ\n تَوْبَةُ اللَّهِ عَلَيْكَ ‏.‏ حَتَّى دَخَلْتُ الْمَسْجِدَ فَإِذَا رَسُولُ اللَّهِ صلى الله عليه وسلم جَالِسٌ فِي\n الْمَسْجِدِ وَحَوْلَهُ النَّاسُ فَقَامَ طَلْحَةُ بْنُ عُبَيْدِ اللَّهِ يُهَرْوِلُ حَتَّى صَافَحَنِي وَهَنَّأَنِي وَاللَّهِ مَا\n قَامَ رَجُلٌ مِنَ الْمُهَاجِرِينَ غَيْرُهُ ‏.‏ قَالَ فَكَانَ كَعْبٌ لاَ يَنْسَاهَا لِطَلْحَةَ ‏.‏ قَالَ كَعْبٌ فَلَمَّا سَلَّمْتُ\n عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ وَهُوَ يَبْرُقُ وَجْهُهُ مِنَ السُّرُورِ وَيَقُولُ ‏\"‏ أَبْشِرْ\n بِخَيْرِ يَوْمٍ مَرَّ عَلَيْكَ مُنْذُ وَلَدَتْكَ أُمُّكَ ‏\"‏ ‏.‏ قَالَ فَقُلْتُ أَمِنْ عِنْدِكَ يَا رَسُولَ اللَّهِ أَمْ مِنْ عِنْدِ\n اللَّهِ فَقَالَ ‏\"‏ لاَ بَلْ مِنْ عِنْدِ اللَّهِ ‏\"‏ ‏.‏ وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا سُرَّ اسْتَنَارَ\n وَجْهُهُ كَأَنَّ وَجْهَهُ قِطْعَةُ قَمَرٍ - قَالَ - وَكُنَّا نَعْرِفُ ذَلِكَ - قَالَ - فَلَمَّا جَلَسْتُ بَيْنَ يَدَيْهِ\n قُلْتُ يَا رَسُولَ اللَّهِ إِنَّ مِنْ تَوْبَتِي أَنْ أَنْخَلِعَ مِنْ مَالِي صَدَقَةً إِلَى اللَّهِ وَإِلَى رَسُولِهِ صلى\n الله عليه وسلم ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَمْسِكْ بَعْضَ مَالِكَ فَهُوَ خَيْرٌ\n لَكَ ‏\"‏ ‏.‏ قَالَ فَقُلْتُ فَإِنِّي أُمْسِكُ سَهْمِيَ الَّذِي بِخَيْبَرَ - قَالَ - وَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّ اللَّهَ\n إِنَّمَا أَنْجَانِي بِالصِّدْقِ وَإِنَّ مِنْ تَوْبَتِي أَنْ لاَ أُحَدِّثَ إِلاَّ صِدْقًا مَا بَقِيتُ - قَالَ - فَوَاللَّهِ\n مَا عَلِمْتُ أَنَّ أَحَدًا مِنَ الْمُسْلِمِينَ أَبْلاَهُ اللَّهُ فِي صِدْقِ الْحَدِيثِ مُنْذُ ذَكَرْتُ ذَلِكَ لِرَسُولِ اللَّهِ\n صلى الله عليه وسلم إِلَى يَوْمِي هَذَا أَحْسَنَ مِمَّا أَبْلاَنِي اللَّهُ بِهِ وَاللَّهِ مَا تَعَمَّدْتُ كَذْبَةً مُنْذُ\n قُلْتُ ذَلِكَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم إِلَى يَوْمِي هَذَا وَإِنِّي لأَرْجُو أَنْ يَحْفَظَنِيَ اللَّهُ\n فِيمَا بَقِيَ ‏.‏ قَالَ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ‏{‏ لَقَدْ تَابَ اللَّهُ عَلَى النَّبِيِّ وَالْمُهَاجِرِينَ وَالأَنْصَارِ\n الَّذِينَ اتَّبَعُوهُ فِي سَاعَةِ الْعُسْرَةِ مِنْ بَعْدِ مَا كَادَ يَزِيغُ قُلُوبُ فَرِيقٍ مِنْهُمْ ثُمَّ تَابَ عَلَيْهِمْ\n إِنَّهُ بِهِمْ رَءُوفٌ رَحِيمٌ * وَعَلَى الثَّلاَثَةِ الَّذِينَ خُلِّفُوا حَتَّى إِذَا ضَاقَتْ عَلَيْهِمُ الأَرْضُ بِمَا رَحُبَتْ\n وَضَاقَتْ عَلَيْهِمْ أَنْفُسُهُمْ‏}‏ حَتَّى بَلَغَ ‏{‏ يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَكُونُوا مَعَ الصَّادِقِينَ‏}‏ \n قَالَ كَعْبٌ وَاللَّهِ مَا أَنْعَمَ اللَّهُ عَلَىَّ مِنْ نِعْمَةٍ قَطُّ بَعْدَ إِذْ هَدَانِي اللَّهُ لِلإِسْلاَمِ أَعْظَمَ فِي نَفْسِي\n مِنْ صِدْقِي رَسُولَ اللَّهُ صلى الله عليه وسلم أَنْ لاَ أَكُونَ كَذَبْتُهُ فَأَهْلِكَ كَمَا هَلَكَ الَّذِينَ كَذَبُوا\n إِنَّ اللَّهَ قَالَ لِلَّذِينَ كَذَبُوا حِينَ أَنْزَلَ الْوَحْىَ شَرَّ مَا قَالَ لأَحَدٍ وَقَالَ اللَّهُ ‏{‏ سَيَحْلِفُونَ بِاللَّهِ\n لَكُمْ إِذَا انْقَلَبْتُمْ إِلَيْهِمْ لِتُعْرِضُوا عَنْهُمْ فَأَعْرِضُوا عَنْهُمْ إِنَّهُمْ رِجْسٌ وَمَأْوَاهُمْ جَهَنَّمُ جَزَاءً\n بِمَا كَانُوا يَكْسِبُونَ * يَحْلِفُونَ لَكُمْ لِتَرْضَوْا عَنْهُمْ فَإِنْ تَرْضَوْا عَنْهُمْ فَإِنَّ اللَّهَ لاَ يَرْضَى عَنِ\n الْقَوْمِ الْفَاسِقِينَ‏}‏ قَالَ كَعْبٌ كُنَّا خُلِّفْنَا أَيُّهَا الثَّلاَثَةُ عَنْ أَمْرِ أُولَئِكَ الَّذِينَ قَبِلَ مِنْهُمْ رَسُولُ\n اللَّهِ صلى الله عليه وسلم حِينَ حَلَفُوا لَهُ فَبَايَعَهُمْ وَاسْتَغْفَرَ لَهُمْ وَأَرْجَأَ رَسُولُ اللَّهِ صلى\n الله عليه وسلم أَمْرَنَا حَتَّى قَضَى اللَّهُ فِيهِ فَبِذَلِكَ قَالَ اللَّهُ عَزَّ وَجَلَّ ‏{‏ وَعَلَى الثَّلاَثَةِ الَّذِينَ\n خُلِّفُوا‏}‏ وَلَيْسَ الَّذِي ذَكَرَ اللَّهُ مِمَّا خُلِّفْنَا تَخَلُّفَنَا عَنِ الْغَزْوِ وَإِنَّمَا هُوَ تَخْلِيفُهُ إِيَّانَا وَإِرْجَاؤُهُ\n أَمْرَنَا عَمَّنْ حَلَفَ لَهُ وَاعْتَذَرَ إِلَيْهِ فَقَبِلَ مِنْهُ ‏.‏ \n وَحَدَّثَنِيهِ مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا حُجَيْنُ بْنُ الْمُثَنَّى، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ \n ابْنِ شِهَابٍ، بِإِسْنَادِ يُونُسَ عَنِ الزُّهْرِيِّ، سَوَاءً ‏.‏","english":{"narrator":"Ibn Shihab reported that Allah's Messenger (ﷺ) made an expedition to Tabuk and he (the Holy Prophet) had in his mind (the idea of threatening the) Christians of Arabia in Syria and those of Rome. Ibn Shihab (further) reported that 'Abd al-Rahman b. 'Abdullah b. Ka'b informed him that Abdullah b. Ka'b who served as the guide of Ka'b b. 'Malik as he became blind that he heard Ka'b b. Malik narrate the story of his remaining behind Allah's Messenger (ﷺ) from the Battle of Tabuk. Ka'b b. Malik said:","text":"I never remained behind Allah's Messenger (ﷺ) from any expedition which he undertook except the Battle of Tabuk and that of the Battle of Badr. So far as the Battle of Badr is concerned, nobody was blamed for remaining behind as Allah's Messenger (ﷺ) and the Muslims (did not set out for attack but for waylaying) the caravan of the Quraish, but it was Allah Who made them confront their enemies without their intention (to do so). I had the honour to be with Allah's Messenger (ﷺ) on the night of 'Aqaba when we pledged our allegiance to Islam and it was more dear to me than my participation in the Battle of Badr, although Badr was more popular amongst people as compared with that (Tabuk). And this is my story of remaining back from Allah's Messenger (ﷺ) on the occasion of the Battle of Tabuk. Never did I possess means enough and (my circumstances) more favourable than at the occasion of this expedition. And, by Allah, I had never before this expedition simultaneously in my possession two rides. Allah's Messenger (ﷺ) set out for this expedition in extremely hot season; the journey was long and the land (which he and his army had to cover) was waterless and he had to confront a large army, so he informed the Muslims about the actual situation (they had to face), so that they should adequately equip themselves for this expedition, and he also told them the destination where he intended to go. And the Muslims who accompanied Allah's Messenger (ﷺ) at that time were large in numbers but there was no proper record of them. Ka'b (further) said: Few were the persons who wanted to absent themselves, and were under the impression that they could easily conceal themselves (and thus remain undetected) until revelations from Allah, the Exalted and Glorious (descended in connection with them). \nAnd Allah's Messenger (ﷺ) set out on an expedition when the fruits were ripe and their shadows had been lengthened. I had weakness for them and it was during this season that Allah's Messenger (ﷺ) made preparations and the Muslims too along with them. I also set out in the morning so that I should make preparations along with them but I came back and did nothing and said to myself: I have means enough (to make preparations) as soon as I like. And I went on doing this (postponing my preparations) until people were about to depart and it was in the morning that Allah's Messenger (ﷺ) set out and the Muslims too along with him, but I made no preparations. I went early in the morning and came back, but I made no decision. I continued to do so until they (the Muslims) hastened and covered a good deal of distance. I also made up my mind to march on and to meet them. Would that I had done that but perhaps it was not destined for me. After the departure of Allah's Messenger (ﷺ) as I went out amongst people, I was shocked to find that I did not find anyone like me but people who were labelled as hypocrites or the people whom Allah granted exemption because of their incapacity and Allah's Messenger (ﷺ) took no notice of me until he had reached Tabuk. (One day as he was sitting amongst the people in Tabuk) he said: What has happened to Ka'b b. Malik? A person from Banu' Salama said: Allah's Messenger, the (beauty) of his cloak and his appreciation of his sides have allured him and he was thus detained. Mua'dh b. Jabal said: Woe be upon that what you contend. Allah's Messenger, by Allah, we know nothing about him but good. Allah's Messenger (ﷺ), however, kept quiet. It was during that time that he (the Holy Prophet) saw a person (dressed in all white (garment) shattering the illusion of eye (mirage). \nThereupon Allah's Messenger (ﷺ) said: May he be Abu Khaithama and, lo, it was Abu Khaithama al-Ansari and he was that person who contributed a sa' of dates and was scoffed at by the hypocrites. Ka'b b. Malik farther said: When this news reached me that Allah's Messenger (ﷺ) was on his way back from Tabuk I was greatly perturbed. I thought of fabricating false stories and asked myself how I would save myself from his anger on the following day. In this connection, I sought the help of every prudent man from amongst the members of my family and when it was said to me that Allah's Messenger (ﷺ) was about to arrive, all the false ideas banished (from my mind) and I came to the conclusion that nothing could save me but the telling of truth, so I decided to speak the truth and it was in the morning that Allah's Messenger (ﷺ) arrived (in Medina). And it was his habit that as he came back from a journey he first went to the mosque and observed two Rak'ahs of nafl prayer (as a mark of gratitude) and then sat amongst people. And as he did that, those who had remained behind him began to put forward their excuses and take an oath before him and they were more than eighty persons. Allah's Messenger (ﷺ) accepted their excuses on the very face of them and accepted their allegiance and sought forgiveness for them and left their secret (intentions) to Allah, until I presented myself to him. I greeted him and he smiled and there was a tinge of anger in that. He (the Holy Prophet) then said to me: Come forward. I went forward until I sat in front of him. He said to me: What kept you back? Could you not afford to go in for a ride? I said: Allah's Messenger, by Allah, if I were to sit in the presence of anybody else from amongst the worldly people I would have definitely saved myself from his anger on one pretext (or the other) and I have also the knack to fall into argumentation, but, by Allah, I am fully aware of the fact that if I were to put forward before you a false excuse to please you Allah would definitely provoke your wrath upon me, and if I speak the truth you may be annoyed with me, but I hope that Allah would make its end well and, by Allah, there is no valid excuse for me. By Allah, I never possessed so good means, and I never had such favourable conditions for me as I had when I stayed behind you (failed to join the expedition). \nThereupon, Allah's Messenger (ﷺ) said: This man told the truth, so get up until Allah gives a decision in your case. I stood up and some people of Banu' Salama followed me in hot haste, and they said to me: By Allah, we do not know about you that you committed a sin prior to this. You, however, showed inability to put forward an excuse before Allah's Messenger (ﷺ) as those who stayed behind him have put forward excuses. It would have been enough for the forgiveness of your sin that Allah's Messenger (ﷺ) would have sought forgiveness for you. By Allah, they continued to incite me until I thought of going back to Allah's Messenger (ﷺ) and contradict myself. Then I said to them: Has anyone else also met the same fate? They said: Yes, two persons have met the same fate as has fallen to you and they have made the sane statement as you have made, and the same verdict has been delivered in their case as it has been delivered in your case. I said: Who are they? They said: Murara b. ar-Rabi'a 'Amiri and Hilal b. Umayya al-Waqafi. They made a mention of these two pious persons to me who had participated in the Battle of Badr and there was an example for me in them. I went away when they named these two persons. Allah's Messenger (ﷺ) forbade the Nluslims to talk with three of us from amongst those (persons) who had stayed behind him. The people began to avoid us and their attitude towards us underwent a change and it seemed as if the whole atmosphere had turned (hostile) against us and it was in fact the same atmosphere ot which I was fully aware and in which I had lived (for a fairly long time). We spent fifty nights in this very state and my two friends confined themselves withen their houses and spent (most of the) time in weeping, but as I was young and strong amongst them I got (out of my house), participated in congregational prayers, moved about in the bazar; but none spoke to me. I came to Allah's Messenger (ﷺ) as he sat amongst (people) after the prayer, greeted him and asked myself whether his lips stirred in response to my greetings (or not). \nThen I observed prayer beside him and looked at him with stealing glances and when I attended to my prayer, he looked at me and when I cast a glance at him he turned away his eyes from me. And when the harsh treatment of the Muslims towards me extended to a (considerable) length of time, I walked until I climbed upon the wall of the garden of Abu Qatada, and he was my cousin, and I had the greatest love for him. I greeted him but, by Allah, he did not respond to my greetings. I said to him: Abu Qatada, I adjure you by Allah, arn't you well aware of the fact that I love Allah and His Messenger (ﷺ) the most. He kept quiet. I again repeated saying: I adjure you by Allah. arn't you well aware of the fact that I love Allah and His Messenger (ﷺ) the most. He kept quiet. I again adjured him, whereupon he said: Allah and the Messenger (ﷺ) are best aware of it. My eyes began to shed tears and I came back climbing down from the wall and as I was walking in the bazar of Medina a Nabatean from amongst the Nabateans of Syria, who had come to sell foodgrains in Medina, asked people to direct him to Ka'b b. Malik. People gave him the indication by pointing towards me. He came to me and delivered to me a letter of the King of Ghassan and as I was a scribe I read that letter and it was written like this:\" Coming to my point, it has been conveyed to us that your friend (the Holy Prophet) is subjecting you to cruelty and Allah has not created you for a place where you are to be degraded and where you cannot find your right place, so you come to us that we should accord you honour. As I read that letter I said: This is also a calamity, so I burnt it in the oven. When out of the fifty days, forty days had passed and Allah's Messenger (ﷺ) received no revelation, there came the messenger of Allah's Messenger (ﷺ) to me and said: Verily, Allah's Messenger (ﷺ) has commanded you to remain separate from your wife. I said: Should I divorce her or what (else) should I do? He said: No, but only remain separate from her and don't have sexual contact with her. \nThe same message was sent to my companions. So I said to my wife: You better go to your parents and stay there with them until Allah gives the decision in my case. The wife of Hilal b. Umayya came to Allah's Messenger (ﷺ) and said: Allah's Messenger, Hilal b. Umayya is a senile person, he has no servant. Do you disapprove of my serving him? He said: No, but don't go near him. She said: By Allah, he has no such instinct in him. By Allah, he spends his time in weeping from that day to this day. Some of the members of my family said to me: Were you to seek permission from Allah's Messenger (ﷺ) in regard to your wife as he has granted permission to the wife of Hilal b. Umayya to serve him. I said: I would not seek permission from Allah's Messenger (ﷺ), for I cannot say what Allah's Apostle may say in response to seeking my permission. Moreover, I am a young man. It was in this state that I spent ten more nights and thus fifty nights had passed that (people) had observed boycott with us. It was on the morning of the fiftieth night that I observed my dawn prayer and was sitting on one of the roofs of our houses. And I was in fact sitting in that very state which Allah, the Exalted and Glorious, has described about us in these words:\" Life had become hard for myself and the earth had compressed despite its vastness,\" that I heard the noise of an announcer from the peak of the hill of Sal' saying at the top of his voice: Ka'b b. Malik, there is glad tidings for you. I fell down in prostration and came to realise that there was (a message of) relief for me. Allah's Messenger (ﷺ) had informed the people of the acceptance of our repentance by Allah as he offered the dawn prayer. So the people went on to give us glad tidings and some of them went to my friends in order to give them the glad tidings and a person galloped his horse and came from the tribe of Aslam and his horse reached me more quickly than his voice. And when he came to me whose sound I heard, he gave me the glad tidings. I took off my clothes and clothed him with them because of his bringing good news to me and, by Allah, I possessed nothing else (in the form of clothes) than these two on that occasion, and I asked one to lend me two clothes and dressed myself in them. \nI came to Allah's Messenger (ﷺ) and on my way I met groups of people who greeted me because of (the acceptance of) repentance and they said: Here is a greeting for you for your repentance being accepted by Allah. (I moved on) until I came to the mosque and Allah's Messenger (ﷺ) had been sitting there amongst persons. So Talha b. 'Ubaidullah got up and rushed towards me and he shook hands with me and greeted me and, by Allah, no person stood up (to greet me) from amongst the emigrants except he. Ka'b said that he never forgot (this good gesture of) Talha. Ka'b further said: I greeted Allah's Messenger (ﷺ) with Assalam-o-'Alaikam and his face was glistening because of delight, and he said: Let there be glad tidings and blessings for you, the like of which (you have neither found nor you will find, as you find today) since your mother gave your birth. I said: Allah's Messenger. is this acceptance of repentance from you or from Allah? He said: No, (it is not from ma), it is from Allah, and it was common with Allah's Messenger (ﷺ) that as he was happy his face brightened up and it looked like a part of the moon and it was from this that we recognised it (his delight). As I sat before him, I said: Allah's Messenger, am I allowed to give in charity my wealth for Allah's sake and for the sake of His Messenger (ﷺ)? Thereupon Allah's Messenger (ﷺ) said: Keep some property with you as it is better for you. I said: I shall keep with me that part (of my property) which fell to my lot (on the occasion of the expedition of) Khaibar. I said: Allah's Messenger, verily, Allah has granted me salvation because of truth and, therefore, (I think) that repentance implies that I should not speak anything but truth as long as I live. He said: By Allah, I do not know whether anyone amongst the Muslims was put to more severe trial than I by Allah because of telling the truth. And since I made a mention of this to Allah's Messenger (ﷺ) up to this day I have not told any lie and, by Allah, I have decided not to tell a lie and I hope that Allah would save me (from trials) for the rest of my life and Allah, the Exalted and Glorious, revealed these verses:\" \nCertainly, Allah has turned in Mercy to the Prophet and the emigrants and the helpers who followed him in the hour of hardship after the hearts of a part of them were about to deviate; then He turned to them in mercy. Surely, to them He is Compassionate, Merciful and (He turned in Mercy) to the three who were left behind until the earth despite its vastness became strait for them and their souls were also straitened to them.\" And this revelation reached up to the (words):\" O you who believe, develop God consciousness, and be with the truthful\" (ix. 117-118). Ka'b said: By Allah, since Allah directed me to Islam there has been no blessing more significant for me than this truth of mine which I spoke to Allah's Messenger (ﷺ) and if I were to tell a lie I would have been ruined as were ruined those who told lies, for in regard to those who told lies Allah used harshest words used for anyone as He descended revelation (and the words of Allah are):\" They will swear by Allah to you when you return to them so that you may leave them alone. So leave them alone. Surely, they are unclean and their resort is Hell, recompense for what they earned. They will swear to you that you may be pleased with them but if you are pleased with them, yet surely Allah is not pleased with the transgressing people\" (ix. 95-96). K'ab said that the matter of us three persons was deferred as compared with those who took an oath in the presence of Allahs Messenger (ﷺ) and he accepted their allegiance and sought forgiveness for them and Allah did not give any decision in regard to us. It was Allah, the Exalted and Glorious, Who gave decisions in our case, three who remained behind. (The words of the Qur'an)\" the three who were left behind\" do not mean that we remained back from Jihad but these imply that He kept our matter behind them who took oath and presented excuse before Him. This hadith has been narrated on the authority of Zuhri with the same chain of transmitters."}},{"id":63,"idInBook":63,"chapterId":50,"bookId":2,"arabic":"وَحَدَّثَنِي عَبْدُ بْنُ حُمَيْدٍ، حَدَّثَنِي يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ،\n اللَّهِ بْنِ مُسْلِمٍ ابْنُ أَخِي الزُّهْرِيِّ عَنْ عَمِّهِ، مُحَمَّدِ بْنِ مُسْلِمٍ الزُّهْرِيِّ أَخْبَرَنِي عَبْدُ الرَّحْمَنِ،\n بْنُ عَبْدِ اللَّهِ بْنِ كَعْبِ بْنِ مَالِكٍ أَنَّ عُبَيْدَ اللَّهِ بْنَ كَعْبِ بْنِ مَالِكٍ، وَكَانَ، قَائِدَ كَعْبٍ حِينَ عَمِيَ\n قَالَ سَمِعْتُ كَعْبَ بْنَ مَالِكٍ يُحَدِّثُ حَدِيثَهُ حِينَ تَخَلَّفَ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم\n فِي غَزْوَةِ تَبُوكَ ‏.‏ وَسَاقَ الْحَدِيثَ وَزَادَ فِيهِ عَلَى يُونُسَ فَكَانَ رَسُولُ اللَّهِ صلى الله عليه\n وسلم قَلَّمَا يُرِيدُ غَزْوَةً إِلاَّ وَرَّى بِغَيْرِهَا حَتَّى كَانَتْ تِلْكَ الْغَزْوَةُ ‏.‏ وَلَمْ يَذْكُرْ فِي حَدِيثِ ابْنِ\n أَخِي الزُّهْرِيِّ أَبَا خَيْثَمَةَ وَلُحُوقَهُ بِالنَّبِيِّ صلى الله عليه وسلم ‏.‏","english":{"narrator":"'Abdullah b. K'ab, who was his (Ka'b's) guide as he became blind, reported that he heard from Ka'b b. Malik the story of his staying behind Allah's Messenger (ﷺ) from the expedition of Tabuk. The rest of the hadith is the same (but with this variation) that in the narration transmitted on the authority of Yunus (the words are):","text":"When Allah's Messenger (may. peace be upon him) intended to set on an expedition he kept It as a secret, but. be did not do so in thic. expedition. And in the narration transmitted on the authority of Muhammad b. Abdullah b. Muslim, there is no mention of Abu Khaithana (Allah be pleased with him) and no mention of his meeting with Allah's Messenger (ﷺ)."}},{"id":64,"idInBook":64,"chapterId":50,"bookId":2,"arabic":"وَحَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ، - وَهُوَ ابْنُ عُبَيْدِ\n اللَّهِ - عَنِ الزُّهْرِيِّ، أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ كَعْبِ بْنِ مَالِكٍ، عَنْ عَمِّهِ، عُبَيْدِ\n اللَّهِ بْنِ كَعْبٍ وَكَانَ قَائِدَ كَعْبٍ حِينَ أُصِيبَ بَصَرُهُ وَكَانَ أَعْلَمَ قَوْمِهِ وَأَوْعَاهُمْ لأَحَادِيثِ\n أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ سَمِعْتُ أَبِي كَعْبَ بْنَ مَالِكٍ وَهُوَ أَحَدُ الثَّلاَثَةِ\n الَّذِينَ تِيبَ عَلَيْهِمْ يُحَدِّثُ أَنَّهُ لَمْ يَتَخَلَّفْ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي غَزْوَةٍ غَزَاهَا\n قَطُّ غَيْرَ غَزْوَتَيْنِ ‏.‏ وَسَاقَ الْحَدِيثَ وَقَالَ فِيهِ وَغَزَا رَسُولُ اللَّهِ صلى الله عليه وسلم بِنَاسٍ\n كَثِيرٍ يَزِيدُونَ عَلَى عَشْرَةِ آلاَفٍ وَلاَ يَجْمَعُهُمْ دِيوَانُ حَافِظٍ ‏.‏","english":{"narrator":"It is reported on the authority of Abdullah b. K'ab and he was the guide of Ka'b as he lost his eyesight and he was the greatest scholar amongst his people and he retained in his mind many ahadith of the Companions of Allah's Messenger (ﷺ). He said:","text":"I heard my father Ka'b b. Malik, and he fas one of those three whose repentance was accepted (by Allah). He transmitted that He never lagged behind Allah's Messenger (ﷺ) from any expedition that he undertook except two expeditions; the rest of the hadith is the same, and in the tradition narrated through another chain of transmitters the words are:\" That Allah's Messenger (ﷺ) set out on an expedition with a large number of persons more than ten thousand and this could not be recorded in the census register.\""}},{"id":65,"idInBook":65,"chapterId":50,"bookId":2,"arabic":"حَدَّثَنَا حَبَّانُ بْنُ مُوسَى، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، أَخْبَرَنَا يُونُسُ بْنُ يَزِيدَ،\n الأَيْلِيُّ ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، وَمُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَ ابْنُ\n رَافِعٍ حَدَّثَنَا وَقَالَ الآخَرَانِ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، وَالسِّيَاقُ، حَدِيثُ مَعْمَرٍ مِنْ\n رِوَايَةِ عَبْدٍ وَابْنِ رَافِعٍ قَالَ يُونُسُ وَمَعْمَرٌ جَمِيعًا عَنِ الزُّهْرِيِّ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ\n وَعُرْوَةُ بْنُ الزُّبَيْرِ وَعَلْقَمَةُ بْنِ وَقَّاصٍ وَعُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ عَنْ حَدِيثِ\n عَائِشَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم حِينَ قَالَ لَهَا أَهْلُ الإِفْكِ مَا قَالُوا فَبَرَّأَهَا اللَّهُ\n مِمَّا قَالُوا وَكُلُّهُمْ حَدَّثَنِي طَائِفَةً مِنْ حَدِيثِهَا وَبَعْضُهُمْ كَانَ أَوْعَى لِحَدِيثِهَا مِنْ بَعْضٍ وَأَثْبَتَ\n اقْتِصَاصًا وَقَدْ وَعَيْتُ عَنْ كُلِّ وَاحِدٍ مِنْهُمُ الْحَدِيثَ الَّذِي حَدَّثَنِي وَبَعْضُ حَدِيثِهِمْ يُصَدِّقُ بَعْضًا\n ذَكَرُوا أَنَّ عَائِشَةَ زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه\n وسلم إِذَا أَرَادَ أَنْ يَخْرُجَ سَفَرًا أَقْرَعَ بَيْنَ نِسَائِهِ فَأَيَّتُهُنَّ خَرَجَ سَهْمُهَا خَرَجَ بِهَا رَسُولُ\n اللَّهِ صلى الله عليه وسلم مَعَهُ - قَالَتْ عَائِشَةُ - فَأَقْرَعَ بَيْنَنَا فِي غَزْوَةٍ غَزَاهَا فَخَرَجَ\n فِيهَا سَهْمِي فَخَرَجْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَذَلِكَ بَعْدَ مَا أُنْزِلَ الْحِجَابُ\n فَأَنَا أُحْمَلُ فِي هَوْدَجِي وَأُنْزَلُ فِيهِ مَسِيرَنَا حَتَّى إِذَا فَرَغَ رَسُولُ اللَّهِ صلى الله عليه وسلم\n مِنْ غَزْوِهِ وَقَفَلَ وَدَنَوْنَا مِنَ الْمَدِينَةِ آذَنَ لَيْلَةً بِالرَّحِيلِ فَقُمْتُ حِينَ آذَنُوا بِالرَّحِيلِ فَمَشَيْتُ\n حَتَّى جَاوَزْتُ الْجَيْشَ فَلَمَّا قَضَيْتُ مِنْ شَأْنِي أَقْبَلْتُ إِلَى الرَّحْلِ فَلَمَسْتُ صَدْرِي فَإِذَا عِقْدِي\n مِنْ جَزْعِ ظَفَارِ قَدِ انْقَطَعَ فَرَجَعْتُ فَالْتَمَسْتُ عِقْدِي فَحَبَسَنِي ابْتِغَاؤُهُ وَأَقْبَلَ الرَّهْطُ الَّذِينَ\n كَانُوا يَرْحَلُونَ لِي فَحَمَلُوا هَوْدَجِي فَرَحَلُوهُ عَلَى بَعِيرِيَ الَّذِي كُنْتُ أَرْكَبُ وَهُمْ يَحْسَبُونَ\n أَنِّي فِيهِ - قَالَتْ - وَكَانَتِ النِّسَاءُ إِذْ ذَاكَ خِفَافًا لَمْ يُهَبَّلْنَ وَلَمْ يَغْشَهُنَّ اللَّحْمُ إِنَّمَا يَأْكُلْنَ\n الْعُلْقَةَ مِنَ الطَّعَامِ فَلَمْ يَسْتَنْكِرِ الْقَوْمُ ثِقَلَ الْهَوْدَجِ حِينَ رَحَلُوهُ وَرَفَعُوهُ وَكُنْتُ جَارِيَةً حَدِيثَةَ\n السِّنِّ فَبَعَثُوا الْجَمَلَ وَسَارُوا وَوَجَدْتُ عِقْدِي بَعْدَ مَا اسْتَمَرَّ الْجَيْشُ فَجِئْتُ مَنَازِلَهُمْ وَلَيْسَ\n بِهَا دَاعٍ وَلاَ مُجِيبٌ فَتَيَمَّمْتُ مَنْزِلِي الَّذِي كُنْتُ فِيهِ وَظَنَنْتُ أَنَّ الْقَوْمَ سَيَفْقِدُونِي فَيَرْجِعُونَ\n إِلَىَّ فَبَيْنَا أَنَا جَالِسَةٌ فِي مَنْزِلِي غَلَبَتْنِي عَيْنِي فَنِمْتُ وَكَانَ صَفْوَانُ بْنُ الْمُعَطَّلِ السُّلَمِيُّ\n ثُمَّ الذَّكْوَانِيُّ قَدْ عَرَّسَ مِنْ وَرَاءِ الْجَيْشِ فَادَّلَجَ فَأَصْبَحَ عِنْدَ مَنْزِلِي فَرَأَى سَوَادَ إِنْسَانٍ\n نَائِمٍ فَأَتَانِي فَعَرَفَنِي حِينَ رَآنِي وَقَدْ كَانَ يَرَانِي قَبْلَ أَنْ يُضْرَبَ الْحِجَابُ عَلَىَّ فَاسْتَيْقَظْتُ\n بِاسْتِرْجَاعِهِ حِينَ عَرَفَنِي فَخَمَّرْتُ وَجْهِي بِجِلْبَابِي وَوَاللَّهِ مَا يُكَلِّمُنِي كَلِمَةً وَلاَ سَمِعْتُ مِنْهُ\n كَلِمَةً غَيْرَ اسْتِرْجَاعِهِ حَتَّى أَنَاخَ رَاحِلَتَهُ فَوَطِئَ عَلَى يَدِهَا فَرَكِبْتُهَا فَانْطَلَقَ يَقُودُ بِي الرَّاحِلَةَ\n حَتَّى أَتَيْنَا الْجَيْشَ بَعْدَ مَا نَزَلُوا مُوغِرِينَ فِي نَحْرِ الظَّهِيرَةِ فَهَلَكَ مَنْ هَلَكَ فِي شَأْنِي وَكَانَ\n الَّذِي تَوَلَّى كِبْرَهُ عَبْدُ اللَّهِ بْنُ أُبَىٍّ ابْنُ سَلُولَ فَقَدِمْنَا الْمَدِينَةَ فَاشْتَكَيْتُ حِينَ قَدِمْنَا الْمَدِينَةَ\n شَهْرًا وَالنَّاسُ يُفِيضُونَ فِي قَوْلِ أَهْلِ الإِفْكِ وَلاَ أَشْعُرُ بِشَىْءٍ مِنْ ذَلِكَ وَهُوَ يَرِيبُنِي فِي\n وَجَعِي أَنِّي لاَ أَعْرِفُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم اللُّطْفَ الَّذِي كُنْتُ أَرَى مِنْهُ حِينَ\n أَشْتَكِي إِنَّمَا يَدْخُلُ رَسُولُ اللَّهِ صلى الله عليه وسلم فَيُسَلِّمُ ثُمَّ يَقُولُ ‏\"‏ كَيْفَ تِيكُمْ ‏\"‏ ‏.‏ فَذَاكَ\n يَرِيبُنِي وَلاَ أَشْعُرُ بِالشَّرِّ حَتَّى خَرَجْتُ بَعْدَ مَا نَقِهْتُ وَخَرَجَتْ مَعِي أُمُّ مِسْطَحٍ قِبَلَ الْمَنَاصِعِ\n وَهُوَ مُتَبَرَّزُنَا وَلاَ نَخْرُجُ إِلاَّ لَيْلاً إِلَى لَيْلٍ وَذَلِكَ قَبْلَ أَنَّ نَتَّخِذَ الْكُنُفَ قَرِيبًا مِنْ بُيُوتِنَا وَأَمْرُنَا\n أَمْرُ الْعَرَبِ الأُوَلِ فِي التَّنَزُّهِ وَكُنَّا نَتَأَذَّى بِالْكُنُفِ أَنْ نَتَّخِذَهَا عِنْدَ بُيُوتِنَا فَانْطَلَقْتُ أَنَا وَأُمُّ\n مِسْطَحٍ وَهِيَ بِنْتُ أَبِي رُهْمِ بْنِ الْمُطَّلِبِ بْنِ عَبْدِ مَنَافٍ وَأُمُّهَا ابْنَةُ صَخْرِ بْنِ عَامِرٍ خَالَةُ\n أَبِي بَكْرٍ الصِّدِّيقِ وَابْنُهَا مِسْطَحُ بْنُ أُثَاثَةَ بْنِ عَبَّادِ بْنِ الْمُطَّلِبِ فَأَقْبَلْتُ أَنَا وَبِنْتُ أَبِي رُهْمٍ\n قِبَلَ بَيْتِي حِينَ فَرَغْنَا مِنْ شَأْنِنَا فَعَثَرَتْ أُمُّ مِسْطَحٍ فِي مِرْطِهَا فَقَالَتْ تَعِسَ مِسْطَحٌ ‏.‏\n فَقُلْتُ لَهَا بِئْسَ مَا قُلْتِ أَتَسُبِّينَ رَجُلاً قَدْ شَهِدَ بَدْرًا ‏.‏ قَالَتْ أَىْ هَنْتَاهُ أَوَلَمْ تَسْمَعِي مَا\n قَالَ قُلْتُ وَمَاذَا قَالَ قَالَتْ فَأَخْبَرَتْنِي بِقَوْلِ أَهْلِ الإِفْكِ فَازْدَدْتُ مَرَضًا إِلَى مَرَضِي فَلَمَّا\n رَجَعْتُ إِلَى بَيْتِي فَدَخَلَ عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم فَسَلَّمَ ثُمَّ قَالَ ‏\"‏ كَيْفَ تِيكُمْ\n ‏\"‏ ‏.‏ قُلْتُ أَتَأْذَنُ لِي أَنْ آتِيَ أَبَوَىَّ قَالَتْ وَأَنَا حِينَئِذٍ أُرِيدُ أَنْ أَتَيَقَّنَ الْخَبَرَ مِنْ قِبَلِهِمَا ‏.‏ فَأَذِنَ\n لِي رَسُولُ اللَّهِ صلى الله عليه وسلم فَجِئْتُ أَبَوَىَّ فَقُلْتُ لأُمِّي يَا أُمَّتَاهْ مَا يَتَحَدَّثُ النَّاسُ\n فَقَالَتْ يَا بُنَيَّةُ هَوِّنِي عَلَيْكِ فَوَاللَّهِ لَقَلَّمَا كَانَتِ امْرَأَةٌ قَطُّ وَضِيئَةٌ عِنْدَ رَجُلٍ يُحِبُّهَا وَلَهَا\n ضَرَائِرُ إِلاَّ كَثَّرْنَ عَلَيْهَا - قَالَتْ - قُلْتُ سُبْحَانَ اللَّهِ وَقَدْ تَحَدَّثَ النَّاسُ بِهَذَا قَالَتْ فَبَكَيْتُ\n تِلْكَ اللَّيْلَةَ حَتَّى أَصْبَحْتُ لاَ يَرْقَأُ لِي دَمْعٌ وَلاَ أَكْتَحِلُ بِنَوْمٍ ثُمَّ أَصَبَحْتُ أَبْكِي وَدَعَا رَسُولُ\n اللَّهِ صلى الله عليه وسلم عَلِيَّ بْنَ أَبِي طَالِبٍ وَأُسَامَةَ بْنَ زَيْدٍ حِينَ اسْتَلْبَثَ الْوَحْىُ يَسْتَشِيرُهُمَا\n فِي فِرَاقِ أَهْلِهِ - قَالَتْ - فَأَمَّا أُسَامَةُ بْنُ زَيْدٍ فَأَشَارَ عَلَى رَسُولِ اللَّهِ صلى الله عليه\n وسلم بِالَّذِي يَعْلَمُ مِنْ بَرَاءَةِ أَهْلِهِ وَبِالَّذِي يَعْلَمُ فِي نَفْسِهِ لَهُمْ مِنَ الْوُدِّ فَقَالَ يَا رَسُولَ اللَّهِ\n هُمْ أَهْلُكَ وَلاَ نَعْلَمُ إِلاَّ خَيْرًا ‏.‏ وَأَمَّا عَلِيُّ بْنُ أَبِي طَالِبٍ فَقَالَ لَمْ يُضَيِّقِ اللَّهُ عَلَيْكَ وَالنِّسَاءُ\n سِوَاهَا كَثِيرٌ وَإِنْ تَسْأَلِ الْجَارِيَةَ تَصْدُقْكَ - قَالَتْ - فَدَعَا رَسُولُ اللَّهِ صلى الله عليه وسلم\n بَرِيرَةَ فَقَالَ ‏\"‏ أَىْ بَرِيرَةُ هَلْ رَأَيْتِ مِنْ شَىْءٍ يَرِيبُكِ مِنْ عَائِشَةَ ‏\"‏ ‏.‏ قَالَتْ لَهُ بَرِيرَةُ وَالَّذِي\n بَعَثَكَ بِالْحَقِّ إِنْ رَأَيْتُ عَلَيْهَا أَمْرًا قَطُّ أَغْمِصُهُ عَلَيْهَا أَكْثَرَ مِنْ أَنَّهَا جَارِيَةٌ حَدِيثَةُ السِّنِّ\n تَنَامُ عَنْ عَجِينِ أَهْلِهَا فَتَأْتِي الدَّاجِنُ فَتَأْكُلُهُ - قَالَتْ - فَقَامَ رَسُولُ اللَّهِ صلى الله عليه\n وسلم عَلَى الْمِنْبَرِ فَاسْتَعْذَرَ مِنْ عَبْدِ اللَّهِ بْنِ أُبَىٍّ ابْنِ سَلُولَ - قَالَتْ - فَقَالَ رَسُولُ اللَّهِ\n صلى الله عليه وسلم وَهُوَ عَلَى الْمِنْبَرِ ‏\"‏ يَا مَعْشَرَ الْمُسْلِمِينَ مَنْ يَعْذِرُنِي مِنْ رَجُلٍ قَدْ بَلَغَ\n أَذَاهُ فِي أَهْلِ بَيْتِي فَوَاللَّهِ مَا عَلِمْتُ عَلَى أَهْلِي إِلاَّ خَيْرًا وَلَقَدْ ذَكَرُوا رَجُلاً مَا عَلِمْتُ عَلَيْهِ\n إِلاَّ خَيْرًا وَمَا كَانَ يَدْخُلُ عَلَى أَهْلِي إِلاَّ مَعِي ‏\"‏ ‏.‏ فَقَامَ سَعْدُ بْنُ مُعَاذٍ الأَنْصَارِيُّ فَقَالَ أَنَا\n أَعْذِرُكَ مِنْهُ يَا رَسُولَ اللَّهِ إِنْ كَانَ مِنَ الأَوْسِ ضَرَبْنَا عُنُقَهُ وَإِنْ كَانَ مِنْ إِخْوَانِنَا الْخَزْرَجِ\n أَمَرْتَنَا فَفَعَلْنَا أَمْرَكَ - قَالَتْ - فَقَامَ سَعْدُ بْنُ عُبَادَةَ وَهُوَ سَيِّدُ الْخَزْرَجِ وَكَانَ رَجُلاً صَالِحًا\n وَلَكِنِ اجْتَهَلَتْهُ الْحَمِيَّةُ فَقَالَ لِسَعْدِ بْنِ مُعَاذٍ كَذَبْتَ لَعَمْرُ اللَّهِ لاَ تَقْتُلُهُ وَلاَ تَقْدِرُ عَلَى قَتْلِهِ ‏.‏\n فَقَامَ أُسَيْدُ بْنُ حُضَيْرٍ وَهُوَ ابْنُ عَمِّ سَعْدِ بْنِ مُعَاذٍ فَقَالَ لِسَعْدِ بْنِ عُبَادَةَ كَذَبْتَ لَعَمْرُ اللَّهِ\n لَنَقْتُلَنَّهُ فَإِنَّكَ مُنَافِقٌ تُجَادِلُ عَنِ الْمُنَافِقِينَ فَثَارَ الْحَيَّانِ الأَوْسُ وَالْخَزْرَجُ حَتَّى هَمُّوا أَنْ\n يَقْتَتِلُوا وَرَسُولُ اللَّهِ صلى الله عليه وسلم قَائِمٌ عَلَى الْمِنْبَرِ فَلَمْ يَزَلْ رَسُولُ اللَّهِ صلى الله\n عليه وسلم يُخَفِّضُهُمْ حَتَّى سَكَتُوا وَسَكَتَ - قَالَتْ - وَبَكَيْتُ يَوْمِي ذَلِكَ لاَ يَرْقَأُ لِي دَمْعٌ\n وَلاَ أَكْتَحِلُ بِنَوْمٍ ثُمَّ بَكَيْتُ لَيْلَتِي الْمُقْبِلَةَ لاَ يَرْقَأُ لِي دَمْعٌ وَلاَ أَكْتَحِلُ بِنَوْمٍ وَأَبَوَاىَ يَظُنَّانِ أَنَّ\n الْبُكَاءَ فَالِقٌ كَبِدِي فَبَيْنَمَا هُمَا جَالِسَانِ عِنْدِي وَأَنَا أَبْكِي اسْتَأْذَنَتْ عَلَىَّ امْرَأَةٌ مِنَ الأَنْصَارِ\n فَأَذِنْتُ لَهَا فَجَلَسَتْ تَبْكِي - قَالَتْ - فَبَيْنَا نَحْنُ عَلَى ذَلِكَ دَخَلَ عَلَيْنَا رَسُولُ اللَّهِ صلى\n الله عليه وسلم فَسَلَّمَ ثُمَّ جَلَسَ - قَالَتْ - وَلَمْ يَجْلِسْ عِنْدِي مُنْذُ قِيلَ لِي مَا قِيلَ وَقَدْ لَبِثَ\n شَهْرًا لاَ يُوحَى إِلَيْهِ فِي شَأْنِي بِشَىْءٍ - قَالَتْ - فَتَشَهَّدَ رَسُولُ اللَّهِ صلى الله عليه وسلم\n حِينَ جَلَسَ ثُمَّ قَالَ ‏\"‏ أَمَّا بَعْدُ يَا عَائِشَةُ فَإِنَّهُ قَدْ بَلَغَنِي عَنْكِ كَذَا وَكَذَا فَإِنْ كُنْتِ بَرِيئَةً\n فَسَيُبَرِّئُكِ اللَّهُ وَإِنْ كُنْتِ أَلْمَمْتِ بِذَنْبٍ فَاسْتَغْفِرِي اللَّهَ وَتُوبِي إِلَيْهِ فَإِنَّ الْعَبْدَ إِذَا اعْتَرَفَ\n بِذَنْبٍ ثُمَّ تَابَ تَابَ اللَّهُ عَلَيْهِ ‏\"‏ ‏.‏ قَالَتْ فَلَمَّا قَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم مَقَالَتَهُ\n قَلَصَ دَمْعِي حَتَّى مَا أُحِسُّ مِنْهُ قَطْرَةً فَقُلْتُ لأَبِي أَجِبْ عَنِّي رَسُولَ اللَّهِ صلى الله عليه\n وسلم فِيمَا قَالَ ‏.‏ فَقَالَ وَاللَّهِ مَا أَدْرِي مَا أَقُولُ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَقُلْتُ\n لأُمِيِّ أَجِيبِي عَنِّي رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَتْ وَاللَّهِ مَا أَدْرِي مَا أَقُولُ لِرَسُولِ\n اللَّهِ صلى الله عليه وسلم فَقُلْتُ وَأَنَا جَارِيَةٌ حَدِيثَةُ السِّنِّ لاَ أَقْرَأُ كَثِيرًا مِنَ الْقُرْآنِ إِنِّي وَاللَّهِ\n لَقَدْ عَرَفْتُ أَنَّكُمْ قَدْ سَمِعْتُمْ بِهَذَا حَتَّى اسْتَقَرَّ فِي نُفُوسِكُمْ وَصَدَّقْتُمْ بِهِ فَإِنْ قُلْتُ لَكُمْ إِنِّي\n بَرِيئَةٌ وَاللَّهُ يَعْلَمُ أَنِّي بَرِيئَةٌ لاَ تُصَدِّقُونِي بِذَلِكَ وَلَئِنِ اعْتَرَفْتُ لَكُمْ بِأَمْرٍ وَاللَّهُ يَعْلَمُ أَنِّي بَرِيئَةٌ\n لَتُصَدِّقُونَنِي وَإِنِّي وَاللَّهِ مَا أَجِدُ لِي وَلَكُمْ مَثَلاً إِلاَّ كَمَا قَالَ أَبُو يُوسُفَ فَصَبْرٌ جَمِيلٌ وَاللَّهُ\n الْمُسْتَعَانُ عَلَى مَا تَصِفُونَ ‏.‏ قَالَتْ ثُمَّ تَحَوَّلْتُ فَاضْطَجَعْتُ عَلَى فِرَاشِي - قَالَتْ - وَأَنَا\n وَاللَّهِ حِينَئِذٍ أَعْلَمُ أَنِّي بَرِيئَةٌ وَأَنَّ اللَّهَ مُبَرِّئِي بِبَرَاءَتِي وَلَكِنْ وَاللَّهِ مَا كُنْتُ أَظُنُّ أَنْ يُنْزَلَ\n فِي شَأْنِي وَحْىٌ يُتْلَى وَلَشَأْنِي كَانَ أَحْقَرَ فِي نَفْسِي مِنْ أَنْ يَتَكَلَّمَ اللَّهُ عَزَّ وَجَلَّ فِيَّ بِأَمْرٍ\n يُتْلَى وَلَكِنِّي كُنْتُ أَرْجُو أَنْ يَرَى رَسُولُ اللَّهِ صلى الله عليه وسلم فِي النَّوْمِ رُؤْيَا يُبَرِّئُنِي\n اللَّهُ بِهَا قَالَتْ فَوَاللَّهِ مَا رَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم مَجْلِسَهُ وَلاَ خَرَجَ مِنْ أَهْلِ\n الْبَيْتِ أَحَدٌ حَتَّى أَنْزَلَ اللَّهُ عَزَّ وَجَلَّ عَلَى نَبِيِّهِ صلى الله عليه وسلم فَأَخَذَهُ مَا كَانَ يَأْخُذُهُ\n مِنَ الْبُرَحَاءِ عِنْدَ الْوَحْىِ حَتَّى إِنَّهُ لَيَتَحَدَّرُ مِنْهُ مِثْلُ الْجُمَانِ مِنَ الْعَرَقِ فِي الْيَوْمِ الشَّاتِ مِنْ\n ثِقَلِ الْقَوْلِ الَّذِي أُنْزِلَ عَلَيْهِ - قَالَتْ - فَلَمَّا سُرِّيَ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم\n وَهُوَ يَضْحَكُ فَكَانَ أَوَّلَ كَلِمَةٍ تَكَلَّمَ بِهَا أَنْ قَالَ ‏\"‏ أَبْشِرِي يَا عَائِشَةُ أَمَّا اللَّهُ فَقَدْ بَرَّأَكِ\n ‏\"‏ ‏.‏ فَقَالَتْ لِي أُمِّي قُومِي إِلَيْهِ فَقُلْتُ وَاللَّهِ لاَ أَقُومُ إِلَيْهِ وَلاَ أَحْمَدُ إِلاَّ اللَّهَ هُوَ الَّذِي أَنْزَلَ\n بَرَاءَتِي - قَالَتْ - فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ‏{‏ إِنَّ الَّذِينَ جَاءُوا بِالإِفْكِ عُصْبَةٌ مِنْكُمْ‏}‏ عَشْرَ\n آيَاتٍ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ هَؤُلاَءِ الآيَاتِ بَرَاءَتِي - قَالَتْ - فَقَالَ أَبُو بَكْرٍ وَكَانَ يُنْفِقُ\n عَلَى مِسْطَحٍ لِقَرَابَتِهِ مِنْهُ وَفَقْرِهِ وَاللَّهِ لاَ أُنْفِقُ عَلَيْهِ شَيْئًا أَبَدًا بَعْدَ الَّذِي قَالَ لِعَائِشَةَ ‏.‏ فَأَنْزَلَ\n اللَّهُ عَزَّ وَجَلَّ ‏{‏ وَلاَ يَأْتَلِ أُولُو الْفَضْلِ مِنْكُمْ وَالسَّعَةِ أَنْ يُؤْتُوا أُولِي الْقُرْبَى‏}‏ إِلَى قَوْلِهِ ‏{‏\n أَلاَ تُحِبُّونَ أَنْ يَغْفِرَ اللَّهُ لَكُمْ‏}‏ قَالَ حِبَّانُ بْنُ مُوسَى قَالَ عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ هَذِهِ أَرْجَى\n آيَةٍ فِي كِتَابِ اللَّهِ ‏.‏ فَقَالَ أَبُو بَكْرٍ وَاللَّهِ إِنِّي لأُحِبُّ أَنْ يَغْفِرَ اللَّهُ لِي ‏.‏ فَرَجَعَ إِلَى مِسْطَحٍ\n النَّفَقَةَ الَّتِي كَانَ يُنْفِقُ عَلَيْهِ وَقَالَ لاَ أَنْزِعُهَا مِنْهُ أَبَدًا ‏.‏ قَالَتْ عَائِشَةُ وَكَانَ رَسُولُ اللَّهِ صلى\n الله عليه وسلم سَأَلَ زَيْنَبَ بِنْتَ جَحْشٍ زَوْجَ النَّبِيِّ صلى الله عليه وسلم عَنْ أَمْرِي ‏\"‏ مَا\n عَلِمْتِ أَوْ مَا رَأَيْتِ ‏\"‏ ‏.‏ فَقَالَتْ يَا رَسُولَ اللَّهِ أَحْمِي سَمْعِي وَبَصَرِي وَاللَّهِ مَا عَلِمْتُ إِلاَّ خَيْرًا\n ‏.‏ قَالَتْ عَائِشَةُ وَهِيَ الَّتِي كَانَتْ تُسَامِينِي مِنْ أَزْوَاجِ النَّبِيِّ صلى الله عليه وسلم فَعَصَمَهَا\n اللَّهُ بِالْوَرَعِ وَطَفِقَتْ أُخْتُهَا حَمْنَةُ بِنْتُ جَحْشٍ تُحَارِبُ لَهَا فَهَلَكَتْ فِيمَنْ هَلَكَ ‏.‏ قَالَ الزُّهْرِيُّ\n فَهَذَا مَا انْتَهَى إِلَيْنَا مِنْ أَمْرِ هَؤُلاَءِ الرَّهْطِ ‏.‏ وَقَالَ فِي حَدِيثِ يُونُسَ احْتَمَلَتْهُ الْحَمِيَّةُ ‏.‏","english":{"narrator":"Sa'id b. Musayyib, 'Urwa b. Zubair, 'Alqama b. Waqqas and 'Ubaidullah b. Abdullah b. 'Utba b. Mas'ud--all of them reported the story of the false allegation against 'A'isha, the wife of Allah's Apostle (ﷺ). And they (the slanderers) said what they had to say, but Allah exonerated her of this charge and all of them reported a part of the hadith and some of them who had better memories reported more and with better retention, and I tried to retain this hadith (listening) from every one of them that they reported to me and some of them attested the other. (The sumaried substance of the false allegation is this):","text":"'A'isha said: Whenever Allah's Messenger (ﷺ) intended to set out on a journey he cast lots amongst his wives and he took one with him in whose favour the lot was cast. It so happened that he cast lots amongst us while setting out on a battle and it was cast in my favour, so I set out along with Allah's Messenger (ﷺ). This relates to the period when the revelation concerning the commands of veil had been made. I was carried in a haudaj and I was brought down where we had to stay. In short, when we set out for return journey from the expedition and our caravan was near Medina, Allah's Messenger (ﷺ) commanded one night to march forward. I also got up when the command for the march was given and moved on until I went out of the encampments of the army and after relieving myself I came to my place. I touched my chest and found that my necklace which had been made of the stones of zafar had been broken. I retraced my steps and tried to search my necklace and this detained me there. The group of people who saddled my ride and placed my haudaj carrying me upon the camels marched on. They were under the impression that I was in it. The women in those days were light of weight and they did not wear much flesh, as they ate less food; so they did not perceive the weight of my haudaj as they placed it upon the camel as I was a young girl at that time. So they drove the camel and Eet out and I found my necklace after the army had marched. I came to my place and there was none to call and none to respond (the call). \nI waited at my place under the impression that when the people would riot find me they would come back. So I kept sitting at my place. I was overpowered by sleep and slept. Safwan b. Mu'attal Sulami Dhakwini, who had lagged behind the army because of taking rest came to my place walking in the latter part of the night and he saw the body of a person who was asleep. He came to me and recognised me as he had seen rue before it was enjoined to observe purda. I got ap by his voice as he recited Inna lillahi wa inna ilaihi raji'un  and I covered my head with my headdress. By Allah, he did not speak to me a word and I did not hear a word from him except Inna lillahi. He made his camel kneel down and I amounted the camel as he pressed tLe camel's foreleg and he moved on leaning the camel by the nose string on which I was riding until we came to the army where it had encamped for rest because of extreme heat. Woe be upon those who harboured doubts about me and the most notorious among them was 'Abdullah b. Ubayy, the great hypocrite. We came to Medina and I fell sick for a month. The people had been deliberating over the statements of those who had brought these calumnies against me. I was absolutely unaware of anything concerning that. This, however, caused doubt in my mind that I did not see Allah's Messenger (may peace be upon him.) treating me with such kindness with which he treated me as I fell ill before this. The Prophet (ﷺ) would coome and greet me with Assalam-o-'Alaikum and only ask me how I was. This caused doubt in my mind, but I was unaware of the evil. I wept outside despite my failing health and there went along with me Umm Mistah and she said the daughter of Abu Rhm b. Muttalib b. 'Abd Manaf and his mother was the daughter of Sakhr b. 'Amir, the sister of the mother of Abu Bakr Sidiq and his son was Mistah b. Uthatha b. 'Abbad b. Muttalib. I and the daughter of Abu Rahm set towards the direction of my house. Something got into the head dress of Umm Mistah and she said: Woe be upon Mistah. And I said. Woe be upon what you say. Do you curse people who had participated in Badr? She said: Innocent woman, have you not heard what he said? I said: What did he say? She conveyed to me the statement of those who had brought false allegations against me. So my illness was aggravated. \nI went to my house and Allah's Messenger (ﷺ) came to me and he greeted me and then said: How is that woman? I said: Do you permit me to go to the (house) of my parents? She (further) said: I had at that time made up my mind to confirm this news from them. Allah's Messenger (ﷺ) permitted me. So I came to (the house of) my parents and said to my mother: Mother, do you know what the people are talking about? She said: My daughter, you should not worry. By Allah, if there is a handsome woman who is loved by her husband and he has co-wives also they talk many a thing about her. I said: Hallowed be Allah, what are the people talking about? I wept during the whole night until it was morning and I did not have a wink of sleep and I wept even in the morning. As the revelation was delayed (in regard to this matter), so Allah's Messenger (ﷺ) called 'Ali ibn Abi 'Talib and Usama b. Zaid in order to seek their advice in regard to the separation of his wife. Usama b. Zaid told Allah's Messenger (may peace be apen him) about the innocence of his wives and what he knew about his love for them. He said: Allah's Messenger, they are your wives and we know nothing else about them but goodness. And as for 'Ali b. Abu Talib, he said: Allah has not put any unnecessary burden upon you (in regard to your wives). There are a number of women besides her and if you ask that maidservant (Barira) she will tell you the truth. So, Allah's Messenger (ﷺ) called Bailra and said: Barira, did you see anything in 'A'isha which can cause doubt about her? Barira said: By Him Who sent thee with the truth, I have seen nothing objectionable in her but only this much that she is a young girl and she goes to sleep while kneading the flour and the lamb eats that. Thereupon Allah's Messenger (ﷺ) mounted the pulpit and sought vindication against 'Abdullah b. Ubayy b. Salul, and he further said: Who would exonerate me from imputations of that person who has troubled (me) in regard to my family? By Allah, I find nothing in my wife but goodness and the person whom the people have mentioned in this connection is, according to my knowledge, a thoroughly pious person, and he did never get into my house but along with me. Sa'd b. Mu'adh stood up and said: Allah's Messenger, I defend your honour against him. If he belong to the tribe of Aus we would strike his neck and if he belongs to the tribe of our brother Khazraj and you order us we would comply with your order. \nThen Sa'd b. 'Ubada stood up. He was chief of the Khazraj tribe. He was otherwise a pioas man but he had some what tribal partisanship in him and he said to Sa'd b. Mu'adh: By the everlasting existence of Allah. you are not stating the fact, you will not be able to kill him and you will not have the power to do so. Thereupon, Usaid b. Hudair stood up, and he was the first cousin of Sa'd b. Mu'adh and said to Sa'd b. 'Ubada: By the everlasting existence of Allah, you are not stating the fact. We would kill him. You are a hypocrite and so you argue in defence of the hypocrites, and thus both the tribes Aus and Khazraj were flared up, until they were about to fall upon one another and Allah's Messenger (ﷺ) kept standing upon the pulpit and Allah's Messenger (ﷺ) tried to subside their anger until they became silent and thus there was silence. 'A'isha further reported: I spent the whole day in weeping and even the night and could not have a wink of sleep even next night. My parents thought that this constant weeping of mine would break my heart. I wept and they sat beside me. In the meanwhile a woman of the Ansar came to see me. I permitted her to see me and she also began to weep. And we were in this very state that Allah's Messenger (ﷺ) came and he greeted me and then sat down. He had never sat with me since a month when this rumour was afloat, and there was no revelation (to clarity) my case. Allah's Messenger (ﷺ) recited Tashahhud (there is no god but Allah and Muhammad is His Apostle) and then said: Coming to the point, 'A'isha, this is what has reached me about you and if you are innocent, Allah would Himself vindicate your honour, and if accidentally there has been a lapse on your part seek forgiveness of Allah; He will pardon thee for when a servant makes a confession of his fault and turns (to Him) penitently, Allah also turns to him (mercifully) accepting his repentance. \nWhen Allah's Messenger (ﷺ) talked, my tears dried up and not even a single drop of tear was perceived by me (rolling out of my eyes). I said to my father: You give a reply to Allah's Messenger (ﷺ) on my behalf. He said: By Allah, I do not know what I should say to Allah's Messenger (ﷺ). I then said to my mother: Give a reply to Allah's Messenger (ﷺ) on my behalf, but she said: By Allah, I do not know what I should say to Allah's Messenger (ﷺ). I was a small girl at that time and I had not read much of the Qur'an (but I said): By Allah, I perceive that you have heard about this and it has settled down in your mind and you have taken it to be true, so if I say to you that I am quite innocent, and Allah knows that I am innocent, you would never believe me to be true, and if I confess to (the alleged) lapse before you, whereas Allah knows that I am completely innocent (and I have not committed this sin at all), in that case You will take me to be true and, by Allah, I, therefore, find no other alternative for me and for you except that what the father of Yousuf said:, (My course is) comely patience. And Allah it is Whose help is to be sought for in that (predicament) which ye describe\" (xii 18). After this I turned my face to the other side and lay down on my bed. By Allah, I was fully aware of this fact that I was innocent but I did not expect that Allah would descend Wahy Matlu (Qur'anic Wahy) in my case as I did not think myself so much important that Allah, the Exalted and Glorious, would speak in this matter in words to be recited. I only hoped that Allah would in vision give an indication of my innocence to Allah's Messenger (ﷺ) during his sleep. And, by Allah, Allah's Messenger (ﷺ) had not moved an inch from where he had been sitting and none from the members of my family had gone that Allah, the Exalted and Glorious, descended revelation upon Allah's Messenger (ﷺ) there and then and he felt the burden which he used to feel at the time of receiving revelation. He began to perspire because of the burden of words of Allah as they descended upon him even during the winter season and there fell the drops of his sweat like silvery beads. When this state of receiving revelation was over, the Messenger of Allah (ﷺ) smiled and the first words which he spoke to me were that he said: 'A'isha, there is glad tidings for you. Verily, Allah has vindicated your honour, and my mother who had been standing by me said: Get up (and thank him, i. e. the Holy Prophet). I said: By Allah, I shall not thank him and laud him but Allah Who has descended revelation vindicating my honour. She ('A'isha) said: Allah, the Exalted and Glorious, revealed:\" 'Verily, those who spread the slander are a gang among you\" (and) ten (subsequent) verses in regard to my innocence. She further said: Abu Bakr used to give to Mistah (some stipend) as a token of kinship with him and for his poverty and he (Abu Bakr) said: By Allah, now I would not spend anything for him. 'A'isha said: It was upon this that Allah the Exalted and Glorious revealed this verse:\" And let not those who possess dignity and ease among you swear to give to the near of the kin\" up to\" Yearn ye not that Allah may forgive you?\" Hibban b. Musa' said that 'Abdullah b. Mubarak used to say: It is a verse contained in the Book which most (eminently) brightens the hope. \nAbu Bakr said: By Allah, I wish that Allah should pardon me. I shall never stop this stipend. So he continued to give him the stipend which he had withdrawn. 'A'isha said that Allah's Messenger (ﷺ) asked Zainab, daughter of Jahsh, the wife of Allah's Apostle (ﷺ), about me what she knew or what she had seen in me, and she said: Allah's Messenger, I shall not say anything without hearing (with my ears) and seeing with my eyes. By Allah, I find nothing in her but goodness. (And she stated this in spite of the fact) that she was the only lady who amongst the wives of Allah's Apostle (ﷺ) used to vie with me but Allah saved her in bringing false allegation against me because of her God-consciousness. Her sister Hamna bint Jahsh, however, opposed her and she was undone along with others."}},{"id":66,"idInBook":66,"chapterId":50,"bookId":2,"arabic":"وَحَدَّثَنِي أَبُو الرَّبِيعِ الْعَتَكِيُّ، حَدَّثَنَا فُلَيْحُ بْنُ سُلَيْمَانَ، ح وَحَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ،\n الْحُلْوَانِيُّ وَعَبْدُ بْنُ حُمَيْدٍ قَالاَ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ، حَدَّثَنَا أَبِي، عَنْ صَالِحِ،\n بْنِ كَيْسَانَ كِلاَهُمَا عَنِ الزُّهْرِيِّ، ‏.‏ بِمِثْلِ حَدِيثِ يُونُسَ وَمَعْمَرٍ بِإِسْنَادِهِمَا ‏.‏ وَفِي حَدِيثِ\n فُلَيْحٍ اجْتَهَلَتْهُ الْحَمِيَّةُ كَمَا قَالَ مَعْمَرٌ ‏.‏ وَفِي حَدِيثِ صَالِحٍ احْتَمَلَتْهُ الْحَمِيَّةُ ‏.‏ كَقَوْلِ يُونُسَ\n وَزَادَ فِي حَدِيثِ صَالِحٍ قَالَ عُرْوَةُ كَانَتْ عَائِشَةُ تَكْرَهُ أَنْ يُسَبَّ عِنْدَهَا حَسَّانُ وَتَقُولُ\n فَإِنَّهُ قَالَ فَإِنَّ أَبِي وَوَالِدَهُ وَعِرْضِي لِعِرْضِ مُحَمَّدٍ مِنْكُمْ وِقَاءُ وَزَادَ أَيْضًا قَالَ عُرْوَةُ قَالَتْ\n عَائِشَةُ وَاللَّهِ إِنَّ الرَّجُلَ الَّذِي قِيلَ لَهُ مَا قِيلَ لَيَقُولُ سُبْحَانَ اللَّهِ فَوَالَّذِي نَفْسِي بِيَدِهِ مَا\n كَشَفْتُ عَنْ كَنَفِ أُنْثَى قَطُّ ‏.‏ قَالَتْ ثُمَّ قُتِلَ بَعْدَ ذَلِكَ شَهِيدًا فِي سَبِيلِ اللَّهِ ‏.‏ وَفِي حَدِيثِ يَعْقُوبَ\n بْنِ إِبْرَاهِيمَ مُوعِرِينَ فِي نَحْرِ الظَّهِيرَةِ وَقَالَ عَبْدُ الرَّزَّاقِ مُوغِرِينَ ‏.‏ قَالَ عَبْدُ بْنُ حُمَيْدٍ\n قُلْتُ لِعَبْدِ الرَّزَّاقِ مَا قَوْلُهُ مُوغِرِينَ قَالَ الْوَغْرَةُ شِدَّةُ الْحَرِّ ‏.‏","english":{"narrator":"This hadith has been narrated on the authority of Zuhri through other chains of transmitters but with a slight variation of wording. In the hadith transmitters on the authority of 'Urwa, there is an addition of these words:","text":"\" 'A'isha did not like that Hassan should be rebuked in her presence and she used to say: It was he who wrote this verse also:\" 'Verily, my father and my mother and my honour, those are all meant for defending the honour of Muhammad against you.\" And 'Urwa further reported that 'A'isha said: By Allah, the person, about whom the allegation was trade used to say: Hallowed be Allah, by One, in Whose hand is my life, I have never unveiled any woman, and then he die, & as a martyr in the cause of Allah, and in the narration transmitted on the authority of Ya'qub b. Ibrahim., the word is Mu'irin and in the narration transmitted on the'authority of 'Abd al-Razzaq it is Mughirin. 'Abd b. Humaid said: I said to 'Abd al-Razzaq: What does this word Mughirin mean? And he said: Al- waghra means intense heat."}},{"id":67,"idInBook":67,"chapterId":50,"bookId":2,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ الْعَلاَءِ، قَالاَ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامِ،\n بْنِ عُرْوَةَ عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ لَمَّا ذُكِرَ مِنْ شَأْنِي الَّذِي ذُكِرَ وَمَا عَلِمْتُ بِهِ قَامَ رَسُولُ\n اللَّهِ صلى الله عليه وسلم خَطِيبًا فَتَشَهَّدَ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ بِمَا هُوَ أَهْلُهُ ثُمَّ قَالَ ‏\n\"‏\n أَمَّا بَعْدُ أَشِيرُوا عَلَىَّ فِي أُنَاسٍ أَبَنُوا أَهْلِي وَايْمُ اللَّهِ مَا عَلِمْتُ عَلَى أَهْلِي مِنْ سُوءٍ قَطُّ\n وَأَبَنُوهُمْ بِمَنْ وَاللَّهِ مَا عَلِمْتُ عَلَيْهِ مِنْ سُوءٍ قَطُّ وَلاَ دَخَلَ بَيْتِي قَطُّ إِلاَّ وَأَنَا حَاضِرٌ وَلاَ\n غِبْتُ فِي سَفَرٍ إِلاَّ غَابَ مَعِي ‏\"‏ ‏.‏ وَسَاقَ الْحَدِيثَ بِقِصَّتِهِ وَفِيهِ وَلَقَدْ دَخَلَ رَسُولُ اللَّهِ صلى\n الله عليه وسلم بَيْتِي فَسَأَلَ جَارِيَتِي فَقَالَتْ وَاللَّهِ مَا عَلِمْتُ عَلَيْهَا عَيْبًا إِلاَّ أَنَّهَا كَانَتْ\n تَرْقُدُ حَتَّى تَدْخُلَ الشَّاةُ فَتَأْكُلَ عَجِينَهَا أَوْ قَالَتْ خَمِيرَهَا - شَكَّ هِشَامٌ - فَانْتَهَرَهَا\n بَعْضُ أَصْحَابِهِ فَقَالَ اصْدُقِي رَسُولَ اللَّهِ صلى الله عليه وسلم حَتَّى أَسْقَطُوا لَهَا بِهِ فَقَالَتْ\n سُبْحَانَ اللَّهِ وَاللَّهِ مَا عَلِمْتُ عَلَيْهَا إِلاَّ مَا يَعْلَمُ الصَّائِغُ عَلَى تِبْرِ الذَّهَبِ الأَحْمَرِ ‏.‏ وَقَدْ بَلَغَ\n الأَمْرُ ذَلِكَ الرَّجُلَ الَّذِي قِيلَ لَهُ فَقَالَ سُبْحَانَ اللَّهِ وَاللَّهِ مَا كَشَفْتُ عَنْ كَنَفِ أُنْثَى قَطُّ ‏.‏ قَالَتْ\n عَائِشَةُ وَقُتِلَ شَهِيدًا فِي سَبِيلِ اللَّهِ ‏.‏ وَفِيهِ أَيْضًا مِنَ الزِّيَادَةَ وَكَانَ الَّذِينَ تَكَلَّمُوا بِهِ مِسْطَحٌ\n وَحَمْنَةُ وَحَسَّانُ وَأَمَّا الْمُنَافِقُ عَبْدُ اللَّهِ بْنُ أُبَىٍّ فَهُوَ الَّذِي كَانَ يَسْتَوْشِيهِ وَيَجْمَعُهُ وَهُوَ\n الَّذِي تَوَلَّى كِبْرَهُ وَحِمْنَةُ ‏.‏","english":{"narrator":"'A'Isha reported:","text":"When I came under discussion what the people had to say about me, Allah's Messenger (ﷺ) stood up for delivering an address and he recited tashahhud (I bear witness to the fact that iheie is no god but Allah) and praised Allah, lauded Him what He rightly deserves and then said: Coming to the point. Give me an advice about them who have brought false charge about my family. By Allah, I know no evil in the members of my family and the person in connection with whom the false charge is being levelled, I know no evil in him too. And he never entered my house but in my presence and when I was away on a journey, he remained with me even in that. The rest of the hadith is the same but with this change that Allah's Messenger (ﷺ) came to my house and asked my maidservant and she said: By Allah, I know no fault in her but this that she sleeps, and goat comes and eats the kneaded flour. Some of the Companions (of the Holy Prophet) scolded her and said: State the fact before Allah's Messenger (ﷺ) and they even made a pointed reference (to this incident). She said: gallowed be Allah. By Allah, I know about her as does the jeweller know about the pure piece of gold. And when this news reached the person in connection with whom the allegation was made he said: Hallowed be Allah. By Allah, I have never unveiled any woman. 'A'isha said: He fell as a martyr in the cause of Allah, and there is this addition in this hadith that the people who had brought false allegation amongst them were Mistah and Hamna and Hassan. And so far as the hypocrite 'Abdullah b. Ubayy is concerned, he was one who tried his best to gather the false news and then gave them the wind. And he was in fact a fabricator and there was Hamna, daughter of Jahsh with him."}},{"id":68,"idInBook":68,"chapterId":50,"bookId":2,"arabic":"حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، أَخْبَرَنَا ثَابِتٌ، عَنْ \n أَنَسٍ، أَنَّ رَجُلاً، كَانَ يُتَّهَمُ بِأُمِّ وَلَدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ رَسُولُ اللَّهِ صلى\n الله عليه وسلم لِعَلِيٍّ ‏\n\"‏ اذْهَبْ فَاضْرِبْ عُنُقَهُ ‏\"‏ ‏.‏ فَأَتَاهُ عَلِيٌّ فَإِذَا هُوَ فِي رَكِيٍّ يَتَبَرَّدُ\n فِيهَا فَقَالَ لَهُ عَلِيٌّ اخْرُجْ ‏.‏ فَنَاوَلَهُ يَدَهُ فَأَخْرَجَهُ فَإِذَا هُوَ مَجْبُوبٌ لَيْسَ لَهُ ذَكَرٌ فَكَفَّ\n عَلِيٌّ عَنْهُ ثُمَّ أَتَى النَّبِيَّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ إِنَّهُ لَمَجْبُوبٌ مَا لَهُ ذَكَرٌ","english":{"narrator":"Anas reported that a person was charged with fornication with the slavegirl of Allah's Messenger (ﷺ). Thereupon Allah's Messenger (ﷺ) said to 'Ali:","text":"Go and strike his neck. 'Ali came to him and he found him in a well making his body cool. 'Ali said to him: Come out, and as he took hold of his hand and brought him out, he found that his sexual organ had been cut. Hadrat 'Ali refrained from striking his neck. He came to Allah's Apostle (ﷺ) and said: Allah's Messenger, he has not even the sexual organ with him."}}],"chapter":{"id":50,"bookId":2,"arabic":"كتاب التوبة","english":"The Book of Repentance"}}