{"id":11,"metadata":{"id":11,"length":40,"arabic":{"title":"الأربعون القدسية","author":"","introduction":""},"english":{"title":"The Forty Hadith Qudsi","author":"","introduction":""}},"chapters":[{"id":0,"bookId":11,"arabic":"الحديث القدسي","english":"Forty Hadith Qudsi"}],"hadiths":[{"id":40986,"idInBook":1,"chapterId":0,"bookId":11,"arabic":"عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\n\" لَمَّا قَضَى اللَّهُ الْخَلْقَ، كَتَبَ فِي كِتَابِهِ عَلَى نَفْسِهِ، فَهُوَ مَوْضُوعٌ عِنْدَهُ: إِنَّ رَحْمَتِي تَغْلِبُ غَضَبِي\" \nرواه مسلم (وكذلك البخاري والنسائي وابن ماجه)","english":{"narrator":"On the authority of Abu Hurayrah (may Allah be pleased with him), who said that the Messenger of Allah (ﷺ) said:","text":"When Allah decreed the Creation He pledged Himself by writing in His book which is laid down with Him: My mercy prevails over my wrath.\n\nIt was related by Muslim (also by al-Bukhari, an-Nasa'i and Ibn Majah)."}},{"id":40987,"idInBook":2,"chapterId":0,"bookId":11,"arabic":"عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\n\" قَالَ اللَّهُ تَعَالَى: كَذَّبَنِي ابْنُ آدَمَ وَلَمْ يَكُنْ لَهُ ذَلِكَ، وَشَتَمَنِي وَلَمْ يَكُنْ لَهُ ذَلِكَ، فَأَمَّا تَكْذِيبُهُ إِيَّايَ فَقَوْلُهُ: لَنْ يُعِيدَنِي كَمَا بَدَأَنِي، وَلَيْسَ أَوَّلُ الْخَلْقِ بِأَهْوَنَ عَلَيَّ مِنْ إِعَادَتِهِ، وَأَمَّا شَتْمُهُ إِيَّايَ فَقَوْلُهُ: اتَّخَذَ اللَّهُ وَلَدًا، وَأَنَا الْأَحَدُ الصَّمَدُ، لَمْ أَلِدْ وَلَمْ أُولَدْ، وَلَمْ يَكُنْ لِي كُفُوًا أَحَدٌ\" \nرواه البخاري (وكذلك النسائي)","english":{"narrator":"On the authority of Abu Hurayrah (may Allah be pleased with him), who said that the Messenger of Allah (ﷺ) said:","text":"Allah Almighty has said:\nThe son of Adam denied Me and he had no right to do so. And he reviled Me and he had no right to do so. As for his denying Me, it is his saying: He will not remake me as He made me at first (1) - and the initial creation  is no easier for Me than remaking him. As for his reviling Me, it is his saying: Allah has taken to Himself a son, while I am the One, the Everlasting Refuge. I begot not nor was I begotten, and there is none comparable to Me.(1) i.e., bring me back to life after death.\n\nIt was related by al-Bukhari (also by an-Nasa'i)."}},{"id":40988,"idInBook":3,"chapterId":0,"bookId":11,"arabic":"عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ، رَضِيَ اللَّهُ عَنْهُ قَالَ: \n\"صَلَّى لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الصُّبْحِ بِالْحُدَيْبِيَةِ، عَلَى إِثْرِ سَمَاءٍ (1) كَانَتْ مِنْ اللَّيْلَةِ، فَلَمَّا انْصَرَفَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَقْبَلَ عَلَى النَّاسِ، فَقَالَ لَهُمْ: \"هَلْ تَدْرُونَ مَاذَا قَالَ رَبُّكُمْ؟ قَالُوا: اللَّهُ وَرَسُولُهُ أَعْلَمُ، قَالَ: أَصْبَحَ مِنْ عِبَادِي مُؤْمِنٌ بِي وَكَافِرٌ، فَأَمَّا مَنْ قَالَ: مُطِرْنَا بِفَضْلِ اللَّهِ وَرَحْمَتِهِ، فَذَلِكَ مُؤْمِنٌ بِي، كَافِرٌ بِالْكَوْكَبِ، وَأَمَّا مَنْ قَالَ: مُطِرْنَا بِنَوْءِ(1) كَذَا وَكَذَا، فَذَلِكَ كَافِرٌ بِي، مُؤْمِنٌ بِالْكَوْكَبِ\" \nرواه البخاري (وكذلك مالك والنسائي)","english":{"narrator":"On the authority of Zayd ibn Khalid al-Juhaniyy (may Allah be pleased with him), who said:","text":"The Messenger of Allah (may the blessings and peace of Allah be upon him) led the morning prayer for us at al-Hudaybiyah following rainfall during the night. When the Prophet (may the blessings and peace of Allah be upon him) finished, he faced the people and said to them: Do you know what your Lord has said? They said: Allah and his Messenger know best. He said: This morning one of my servants became a believer in Me and one a disbeliever. As for him who said: We have been given rain by virtue of Allah and His mercy, that one is a believer in Me, a disbeliever in the stars (2); and as for him who said: We have been given rain by such-and-such a star, that one is a disbeliever in Me, a believer in the stars.\n(2) The pre-Islamic Arabs believed that rain was brought about by the movement of stars. This Hadith draws attention to the fact that whatever be the direct cause of such natural phenomena as rain, it is Allah the Almighty who is the Disposer of all things.\n\nIt was related by al-Bukhari (also by Malik and an-Nasa'i)."}},{"id":40989,"idInBook":4,"chapterId":0,"bookId":11,"arabic":"عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ، قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\n\" قَالَ اللَّهُ: يَسُبُّ بَنُو آدَمَ الدَّهْرَ، وَأَنَا الدَّهْرُ، بِيَدِي اللَّيْلُ وَالنَّهَارُ\" \nرواه البخاري (وكذلك مسلم)","english":{"narrator":"On the authority of Abu Hurayrah (may Allah be pleased with him), who said that the Messenger of Allah (ﷺ) said:","text":"Allah said:\nSons of Adam inveigh against  Time, and I am Time, in My hand is the night and the day (1).\n(1) As the Almighty is the Ordainer of all things, to inveigh against misfortunes that are part of Time is tantamount to inveighing against Him.\n\nIt was related by al-Bukhari (also by Muslim)."}},{"id":40990,"idInBook":5,"chapterId":0,"bookId":11,"arabic":"عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ، قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\n\" قَالَ اللَّهُ تَبَارَكَ وَتَعَالَى: أَنَا أَغْنَى الشُّرَكَاءِ عَنْ الشِّرْكِ؛ مَنْ عَمِلَ عَمَلًا أَشْرَكَ مَعِي غَيْرِي(1)، تَرَكْتُهُ وَشِرْكَهُ\". \nرواه مسلم (وكذلك ابن ماجه)","english":{"narrator":"On the authority of Abu Hurayrah (may Allah be pleased with him), who said that the Messenger of Allah (ﷺ) said:","text":"Allah (glorified and exalted be He) said:\nI am so self-sufficient that I am in no need of having an associate. Thus he who does an action for someone else's sake as well as Mine will have that action renounced by Me to him whom he associated with Me.\n\nIt was related by Muslim (also by Ibn Majah)."}},{"id":40991,"idInBook":6,"chapterId":0,"bookId":11,"arabic":"عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ، قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: \n\n\" إِنَّ أَوَّلَ النَّاسِ يُقْضَى يَوْمَ الْقِيَامَةِ عَلَيْهِ رَجُلٌ اسْتُشْهِدَ، فَأُتِيَ بِهِ فَعَرَّفَهُ نِعَمَهُ فَعَرَفَهَا، قَالَ: فَمَا عَمِلْتَ فِيهَا؟ قَالَ قَاتَلْتُ فِيكَ حَتَّى اسْتُشْهِدْتُ، قَالَ: كَذَبْتَ، وَلَكِنَّكَ قَاتَلْتَ لِأَنْ يُقَالَ: جَرِيءٌ، فَقَدْ قِيلَ، ثُمَّ أُمِرَ بِهِ فَسُحِبَ عَلَى وَجْهِهِ حَتَّى أُلْقِيَ فِي النَّارِ. وَرَجُلٌ تَعَلَّمَ الْعِلْمَ وَعَلَّمَهُ وَقَرَأَ الْقُرْآنَ، فَأُتِيَ بِهِ، فَعَرَّفَهُ نِعَمَهُ فَعَرَفَهَا، قَالَ: فَمَا عَمِلْتَ فِيهَا؟ قَالَ: تَعَلَّمْتُ الْعِلْمَ وَعَلَّمْتُهُ، وَقَرَأْتُ فِيكَ الْقُرْآنَ، قَالَ: كَذَبْتَ، وَلَكِنَّكَ تَعَلَّمْتَ الْعِلْمَ لِيُقَالَ: عَالِمٌ، وَقَرَأْتَ الْقُرْآنَ لِيُقَالَ: هُوَ قَارِئٌ، فَقَدْ قِيلَ، ثُمَّ أُمِرَ بِهِ، فَسُحِبَ عَلَى وَجْهِهِ حَتَّى أُلْقِيَ فِي النَّارِ. وَرَجُلٌ وَسَّعَ اللَّهُ عَلَيْهِ، وَأَعْطَاهُ مِنْ أَصْنَافِ الْمَالِ كُلِّهِ، فَأُتِيَ بِهِ، فَعَرَّفَهُ نِعَمَهُ فَعَرَفَهَا، قَالَ: فَمَا عَمِلْتَ فِيهَا؟ قَالَ: مَا تَرَكْتُ مِنْ سَبِيلٍ تُحِبُّ أَنْ يُنْفَقَ فِيهَا إِلَّا أَنْفَقْتُ فِيهَا لَكَ، قَالَ: كَذَبْتَ، وَلَكِنَّكَ فَعَلْتَ لِيُقَالَ: هُوَ جَوَادٌ، فَقَدْ قِيلَ، ثُمَّ أُمِرَ بِهِ فَسُحِبَ عَلَى وَجْهِهِ، ثُمَّ أُلْقِيَ فِي النَّارِ\". \nرواه مسلم (وكذلك الترمذي والنسائي)","english":{"narrator":"On the authority of Abu Hurayrah (may Allah be pleased with him), who said:","text":"I heard the Messenger of Allah (ﷺ) say:\nThe first of people against whom judgment will be pronounced on the Day of Resurrection will be a man who died a martyr. He will be brought and Allah will make known to him His favours and he will recognize them. : He is open-handed. And so it was said. Then he will be ordered to be dragged along on his face until he is cast into Hell-fire.\n\nIt was related by Muslim (also by at-Tirmidhi and an-Nasa'i)."}},{"id":40992,"idInBook":7,"chapterId":0,"bookId":11,"arabic":"عَنْ عُقْبَةَ بْنِ عَامِرٍ، رَضِيَ اللَّهُ عَنْهُ، قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: \n\n\" يَعْجَبُ رَبُّكَ مِنْ رَاعِي غَنَمٍ، فِي رَأْسِ شَظِيَّةِ الْجَبَلِ(1)، يُؤَذِّنُ بِالصَّلَاةِ وَيُصَلِّي، فَيَقُولُ اللَّهُ، عَزَّ وَجَلَّ: انْظُرُوا إِلَى عَبْدِي هَذَا، يُؤَذِّنُ وَيُقِيمُ الصَّلَاةَ، يَخَافُ مِنِّي، قَدْ غَفَرْتُ لِعَبْدِي، وَأَدْخَلْتُهُ الْجَنَّةَ\". \nرواه النسائي بسند صحيح","english":{"narrator":"On the authority of Uqbah ibn Amir (may Allah be pleased with him), who said:","text":"I heard the messenger of Allah (ﷺ) say:\nYour Lord delights at a shepherd who, on the peak of a mountain crag, gives the call to prayer and prays. Then Allah (glorified and exalted be He) say: Look at this servant of Mine, he gives the call to prayer and performs the prayers; he is in awe of Me. I have forgiven My servant  and have admitted him to Paradise.\n\nIt was related by an-Nasa'i with a good chain of authorities."}},{"id":40993,"idInBook":8,"chapterId":0,"bookId":11,"arabic":"عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\n\" مَنْ صَلَّى صَلَاةً لَمْ يَقْرَأْ فِيهَا بِأُمِّ الْقُرْآنِ، فَهِيَ خِدَاجٌ(1) ثَلَاثًا، غَيْرَ تَمَامٍ، فَقِيلَ لِأَبِي هُرَيْرَةَ: إِنَّا نَكُونُ وَرَاءَ الْإِمَامِ، فَقَالَ: اقْرَأْ بِهَا فِي نَفْسِكَ، فَإِنِّي سَمِعْتُ النبي صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: قَالَ اللَّهُ عَزَّ وَجَلَّ: قَسَمْتُ الصَّلَاةَ بَيْنِي وَبَيْنَ عَبْدِي نِصْفَيْنِ، وَلِعَبْدِي مَا سَأَلَ، فَإِذَا قَالَ الْعَبْدُ:{ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ } قَالَ اللَّهُ عَزَّ وَجَلَّ: حَمِدَنِي عَبْدِي، وَإِذَا قَالَ:{ الرَّحْمَنِ الرَّحِيمِ } قَالَ اللَّهُ عَزَّ وَجَلَّ: أَثْنَى عَلَيَّ عَبْدِي، وَإِذَا قَالَ:{ مَالِكِ يَوْمِ الدِّينِ } قَالَ اللَّهُ: مَجَّدَنِي عَبْدِي - وَقَالَ مَرَّةً: فَوَّضَ إِلَيَّ عَبْدِي، فَإِذَا قَالَ:{ إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ } قَالَ: هَذَا بَيْنِي وَبَيْنَ عَبْدِي وَلِعَبْدِي مَا سَأَلَ، فَإِذَا قَالَ:{ اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ } قَالَ: هَذَا لِعَبْدِي وَلِعَبْدِي مَا سَأَلَ\". \nرواه مسلم (وكذلك مالك والترمذي وأبو داود والنسائي وابن ماجه)","english":{"narrator":"On the authority of Abu Hurayrah (may Allah be pleased with him) from the Prophet (ﷺ), who said:","text":"A prayer performed by someone who has not recited the Essence of the Quran (1) during it is deficient (and he repeated the word three times), incomplete. Someone said to Abu Hurayrah:  we are behind the imam? (2) He said: Recite it to yourself, for I have heard the Prophet (may the blessings and peace of Allah be up on him) say: Allah (mighty and sublime be He), had said: I have divided prayer between Myself and My servant into two halves, and My servant shall have what he has asked for. When the servant says: Al-hamdu lillahi rabbi l-alamin (3), Allah (mighty and sublime be He) says: My servant has praised Me. And when he says: Ar-rahmani r-rahim (4), Allah (mighty and sublime be He) says: My servant has extolled Me, and when he says: Maliki yawmi d-din (5), Allah says: My servant has glorified Me - and on one occasion He said: My servant has submitted to My power. And when he says: Iyyaka na budu wa iyyaka nasta in (6), He says: This is between Me and My servant, and My servant shall have what he has asked for. And when he says: Ihdina s-sirata l- mustaqim, siratal ladhina an amta alayhim ghayril-maghdubi alayhim wa la d-dallin (7), He says: This is for My servant, and My servant shall have what he has asked for.\n(1) Surat al-Fatihah, the first surah (chapter) of the Qur'an.\n(2) i.e. standing behind the imam (leader) listening to him reciting al-Fatihah.\n(3) \"Praise be to Allah, Lord of the Worlds.\"\n(4) \"The Merciful, the Compassionate\".\n(5) \"Master of the Day of Judgement\".\n(6) \"It is You we worship and it is You we ask for help\".\n(7) \"Guide us to the straight path, the path of those upon whom You have bestowed favors, not of those against whom You are angry, nor of those who are astray\".\n\nIt was related by Muslim (also by Malik, at-Tirmidhi, Abu-Dawud, an-Nasa'i and Ibn Majah)."}},{"id":40994,"idInBook":9,"chapterId":0,"bookId":11,"arabic":"عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\n\"إِنَّ أَوَّلَ مَا يُحَاسَبُ بِهِ الْعَبْدُ يَوْمَ الْقِيَامَةِ مِنْ عَمَلِهِ صَلَاتُهُ. فَإِنْ صَلُحَتْ فَقَدْ أَفْلَحَ وَأَنْجَحَ، وَإِنْ فَسَدَتْ فَقَدْ خَابَ وَخَسِرَ، فَإِنْ انْتَقَصَ مِنْ فَرِيضَتِهِ شَيْءٌ، قَالَ الرَّبُّ عَزَّ وَجَلَّ: انْظُرُوا هَلْ لِعَبْدِي مِنْ تَطَوُّعٍ فَيُكَمَّلَ بِهَا مَا انْتَقَصَ مِنْ الْفَرِيضَةِ، ثُمَّ يَكُونُ سَائِرُ عَمَلِهِ عَلَى ذَلِكَ\". \nرواه الترمذي(1) وكذلك أبو داود والنسائي وابن ماجه وأحمد","english":{"narrator":"On the authority of Abu Hurayrah (may Allah be pleased with him) from the Prophet (ﷺ), who said:","text":"Allah (mighty and sublime be He) says:\nThe first of his actions for which a servant of Allah will be held accountable on the Day of Resurrection will be his prayers. If they are in order, then he will have prospered and succeeded: and if they are wanting, then he will have failed and lost. If there is something defective in his obligatory prayers, the Lord (glorified and exalted be He) will say: See if My servant has any supererogatory prayers with which may be completed that which was defective in his obligatory prayers. Then the rest of his actions will be judged in like fashion.\n\nIt was related by at-Tirmidhi (also by Abu Dawud, an-Nasa'i, Ibn Majah and Ahmad)."}},{"id":40995,"idInBook":10,"chapterId":0,"bookId":11,"arabic":"عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\n\" يَقُولُ اللَّهُ عَزَّ وَجَلَّ: الصَّوْمُ لِي، وَأَنَا أَجْزِي بِهِ، يَدَعُ شَهْوَتَهُ وَأَكْلَهُ وَشُرْبَهُ مِنْ أَجْلِي، وَالصَّوْمُ جُنَّةٌ(1)، وَلِلصَّائِمِ فَرْحَتَانِ: فَرْحَةٌ حِينَ يُفْطِرُ، وَفَرْحَةٌ حِينَ يَلْقَى رَبَّهُ، وَلَخُلُوفُ(2) فَمِ الصَّائِمِ أَطْيَبُ عِنْدَ اللَّهِ مِنْ رِيحِ الْمِسْكِ\". \nرواه البخاري (وكذلك مسلم ومالك والترمذي النسائي وابن ماجه)","english":{"narrator":"On the authority of Abu Hurayrah (may Allah be pleased with him) from the Prophet (ﷺ), who said:","text":"Allah (mighty and sublime be He) says:\nFasting is Mine and it is I who give reward for it.  gives up his sexual passion, his food and his drink for my sake. Fasting is like a shield, and he who fasts has two joys: a joy when he breaks his fast and a joy when he meets his Lord. The change in the breath of the mouth of him who fasts is better in Allah's estimation than the smell of musk.\n\nIt was related by al-Bukhari (also by Muslim, Malik, at-Tirmidhi, an-Nasa'i and Ibn Majah)."}},{"id":40996,"idInBook":11,"chapterId":0,"bookId":11,"arabic":"عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ، أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\n\" قَالَ اللَّهُ: أَنْفِقْ يَا ابْنَ آدَمَ، أُنْفِقْ عَلَيْكَ \".","english":{"narrator":"On the authority of Abu Harayrah (may Allah be pleased with him) from the Prophet (ﷺ), who said:","text":"Allah (mighty and sublime be He) said:\nSpend (on charity), O son of Adam, and I shall spend on you.\n\nIt was related by al-Bukhari (also by Muslim)."}},{"id":40997,"idInBook":12,"chapterId":0,"bookId":11,"arabic":"عَنْ أَبِي مَسْعُودٍ الْأَنْصَارِيِّ، رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\n\" حُوسِبَ رَجُلٌ مِمَّنْ كَانَ قَبْلَكُمْ، فَلَمْ يُوجَدْ لَهُ مِنْ الْخَيْرِ شَيْءٌ، إِلَّا أَنَّهُ كَانَ يُخَالِطُ(1) النَّاسَ، وَكَانَ مُوسِرًا، فَكَانَ يَأْمُرُ غِلْمَانَهُ أَنْ يَتَجَاوَزُوا عَنْ الْمُعْسِرِ، قَالَ (2) قَالَ اللَّهُ : نَحْنُ أَحَقُّ بِذَلِكَ مِنْكَ، تَجَاوَزُوا عَنْهُ\" \nرواه مسلم (وكذلك البخاري والنسائي)","english":{"narrator":"On the authority of Abu Mas'ud al-Ansari (may Allah be pleased with him), who said that the Messenger of Allah (may the blessings and peace of Allah be upon him) said:","text":"A man from among those who were before you was called to account. Nothing in the way of good was found for him except that he used to have dealings with people and, being well-to-do, he would order his servants to let off the man in straitened circumstances . He (the Prophet p.b.u.h) said that Allah said: We are worthier than you of that (of being so generous). Let him off.\n\nIt was related by Muslim (also by al-Bukhari and an-Nasa'i)."}},{"id":40998,"idInBook":13,"chapterId":0,"bookId":11,"arabic":"عَنْ عَدِيَّ بْنَ حَاتِمٍ رَضِيَ اللَّهُ عَنْهُ يَقُولُ: \n\n\"كُنْتُ عِنْدَ رَسُولِ اللَّهِ، صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَجَاءَهُ رَجُلَانِ: أَحَدُهُمَا يَشْكُو الْعَيْلَةَ(1)، وَالْآخَرُ يَشْكُو قَطْعَ السَّبِيلِ(2)، فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أَمَّا قَطْعُ السَّبِيلِ فَإِنَّهُ لَا يَأْتِي عَلَيْكَ إِلَّا قَلِيلٌ، حَتَّى تَخْرُجَ الْعِيرُ إِلَى مَكَّةَ بِغَيْرِ خَفِيرٍ. وَأَمَّا الْعَيْلَةُ، فَإِنَّ السَّاعَةَ لَا تَقُومُ حَتَّى يَطُوفَ أَحَدُكُمْ بِصَدَقَتِهِ، لَا يَجِدُ مَنْ يَقْبَلُهَا مِنْهُ، ثُمَّ لَيَقِفَنَّ أَحَدُكُمْ بَيْنَ يَدَيْ اللَّهِ، لَيْسَ بَيْنَهُ وَبَيْنَهُ حِجَابٌ وَلَا تَرْجُمَانٌ يُتَرْجِمُ لَهُ، ثُمَّ لَيَقُولَنَّ لَهُ: أَلَمْ أُوتِكَ مَالًا؟ فَلَيَقُولَنَّ: بَلَى، ثُمَّ لَيَقُولَنَّ: أَلَمْ أُرْسِلْ إِلَيْكَ رَسُولًا؟ فَلَيَقُولَنَّ: بَلَى، فَيَنْظُرُ عَنْ يَمِينِهِ، فَلَا يَرَى إِلَّا النَّارَ، ثُمَّ يَنْظُرُ عَنْ شِمَالِهِ، فَلَا يَرَى إِلَّا النَّارَ، فَلْيَتَّقِيَنَّ أَحَدُكُمْ النَّارَ وَلَوْ بِشِقِّ تَمْرَةٍ، فَإِنْ لَمْ يَجِدْ فَبِكَلِمَةٍ طَيِّبَةٍ\". \nرواه البخاري","english":{"narrator":"On the authority of Adiyy ibn Hatim (may Allah be pleased with him), who said:","text":"I was with the Messenger of Allah (may the blessings and peace of Allah be upon him) and there came to him two men: one of them was complaining of penury (being very poor), while the other was complaining of brigandry (robbery). The Messenger of Allah (may the blessings and peace of Allah be upon him) said: As for brigandry, it will be but a short time before a caravan will  go out of Mecca without a guard. As for penury, the Hour (Day of Judgement) will not arrive before one of you takes his charity around without finding anyone to accept it from him. Then (1) one of you will surely stand before Allah, there being no screen between Him and him, nor an interpreter to translate for him. Then He will say to him: Did I not bring you wealth? And he will say: Yes. Then He will say: Did I not send to you a messenger? And he will say: Yes. And he will look to his right and will see nothing but Hell-fire, then he will look to his left and will see nothing but Hell-fire, so let each of you protect himself against Hell-fire, be it with even half a date - and if he finds it not, then with a kind word.\n(1) i.e. at the time of the Hour.\n\nIt was related by al-Bukhari."}},{"id":40999,"idInBook":14,"chapterId":0,"bookId":11,"arabic":"عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\n\" إِنَّ لِلَّهِ تَبَارَكَ وَتَعَالَى مَلَائِكَةً سَيَّارَةً فُضُلًا(1)، يَتَتَبَّعُونَ مَجَالِسَ الذِّكْرِ، فَإِذَا وَجَدُوا مَجْلِسًا فِيهِ ذِكْرٌ، قَعَدُوا مَعَهُمْ، وَحَفَّ بَعْضُهُمْ بَعْضًا بِأَجْنِحَتِهِمْ، حَتَّى يَمْلَأُوا مَا بَيْنَهُمْ وَبَيْنَ السَّمَاءِ الدُّنْيَا، فَإِذَااْنْصَرَفُوا عَرَجُوا وَصَعِدُوا إِلَى السَّمَاءِ، قَالَ (2) : فَيَسْأَلُهُمْ اللَّهُ عَزَّ وَجَلَّ وَهُوَ أَعْلَمُ بِهِمْ: مِنْ أَيْنَ جِئْتُمْ؟ فَيَقُولُونَ: جِئْنَا مِنْ عِنْدِ عِبَادٍ لَكَ فِي الْأَرْضِ، يُسَبِّحُونَكَ وَيُكَبِّرُونَكَ وَيُهَلِّلُونَكَ وَيَحْمَدُونَكَ وَيَسْأَلُونَكَ، قَالَ: وَمَا يَسْأَلُونِي؟ قَالُوا يَسْأَلُونَكَ جَنَّتَكَ، قَالَ: وَهَلْ رَأَوْا جَنَّتِي؟ قَالُوا: لَا أَيْ رَبِّ، قَالَ: فَكَيْفَ لَوْ رَأَوْا جَنَّتِي! قَالُوا: وَيَسْتَجِيرُونَكَ، قَالَ: وَمِمَّ يَسْتَجِيرُونَي؟ قَالُوا: مِنْ نَارِكَ يَا رَبِّ، قَالَ: وَهَلْ رَأَوْا نَارِي؟ قَالُوا: لَا، قَالَ: فَكَيْفَ لَوْ رَأَوْا نَارِي! قَالُوا: وَيَسْتَغْفِرُونَكَ، قَالَ (1) فَيَقُولُ: قَدْ غَفَرْتُ لَهُمْ، وأَعْطَيْتُهُمْ مَا سَأَلُوا، وَأَجَرْتُهُمْ مِمَّا اسْتَجَارُوا، قَالَ(1) يَقُولُونَ: رَبِّ فِيهِمْ فُلَانٌ، عَبْدٌ خَطَّاءٌ إِنَّمَا مَرَّ فَجَلَسَ مَعَهُمْ، قَالَ(1): فَيَقُولُ: وَلَهُ غَفَرْتُ؛ هُمْ الْقَوْمُ، لَا يَشْقَى بِهِمْ جَلِيسُهُمْ\" \nرواه مسلم وكذلك البخاري والترمذي والنسائي","english":{"narrator":"On the authority of Abu Hurayrah (may Allah be pleased with him) from the Prophet (ﷺ), who said:","text":"Allah (glorified and exalted be He) has supernumerary angels who rove about seeking out gatherings in which Allah's name is being invoked: they sit with them and fold their wings round each other, filling that which is between them and between the lowest heaven. When  I have given forgiveness: he who sits with such people shall not suffer.\n\nIt was related by Muslim (also by al-Bukhari, at-Tirmidhi, and an-Nasa'i)."}},{"id":41000,"idInBook":15,"chapterId":0,"bookId":11,"arabic":"عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \n\n\"يَقُولُ اللَّهُ تَعَالَى: أَنَا عِنْدَ ظَنِّ عَبْدِي بِي، وَأَنَا مَعَهُ إِذَا ذَكَرَنِي، فَإِنْ ذَكَرَنِي فِي نَفْسِهِ، ذَكَرْتُهُ فِي نَفْسِي، وَإِنْ ذَكَرَنِي فِي مَلَإٍ، ذَكَرْتُهُ فِي مَلَإٍ خَيْرٍ مِنْهُمْ، وَإِنْ تَقَرَّبَ إِلَيَّ بِشِبْرٍ، تَقَرَّبْتُ إِلَيْهِ ذِرَاعًا، وَإِنْ تَقَرَّبَ إِلَيَّ ذِرَاعًا، تَقَرَّبْتُ إِلَيْهِ بَاعًا(1) وَإِنْ أَتَانِي يَمْشِي، أَتَيْتُهُ هَرْوَلَةً\" \nرواه البخاري (وكذلك مسلم والترمذي وابن ماجه)","english":{"narrator":"On the authority of Abu Hurayrah (may Allah be pleased with him), who said that the Prophet (ﷺ) said:","text":"Allah the Almighty said:\nI am as My servant thinks I am (1). I am with him when he makes mention of Me. If he makes mention of Me to himself, I make mention of him to Myself; and if he makes mention of Me in an assembly, I make mention of him in an assembly better than it. And if he draws near to Me an arm's length, I draw near to him a cubit, and if he draws near to Me a cubit, I draw near to him a fathom. And if he comes to Me walking, I go to him at speed.\n(1) Another possible rendering of the Arabic is: \"I am as My servant expects Me to be\". The meaning is that forgiveness and acceptance of repentance by the Almighty is subject to His servant truly believing that He is forgiving and merciful. However, not to accompany such belief with right action would be to mock the Almighty.\n\nIt was related by al-Buhkari (also by Muslim, at-Tirmidhi and Ibn-Majah)."}},{"id":41001,"idInBook":16,"chapterId":0,"bookId":11,"arabic":"عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فِيمَا يَرْوِي عَنْ رَبِّهِ عَزَّ وَجَلَّ، قَالَ: \n\n\"إِنَّ اللَّهَ كَتَبَ الْحَسَنَاتِ وَالسَّيِّئَاتِ، ثُمَّ بَيَّنَ ذَلِكَ: فَمَنْ هَمَّ بِحَسَنَةٍ فَلَمْ يَعْمَلْهَا، كَتَبَهَا اللَّهُ لَهُ عِنْدَهُ حَسَنَةً كَامِلَةً، فَإِنْ هُوَ هَمَّ بِهَا فَعَمِلَهَا، كَتَبَهَا اللَّهُ لَهُ عِنْدَهُ عَشْرَ حَسَنَاتٍ، إِلَى سَبْعِمِائَةِ ضِعْفٍ، إِلَى أَضْعَافٍ كَثِيرَةٍ، وَمَنْ هَمَّ بِسَيِّئَةٍ فَلَمْ يَعْمَلْهَا، كَتَبَهَا اللَّهُ لَهُ عِنْدَهُ حَسَنَةً كَامِلَةً، فَإِنْ هُوَ هَمَّ بِهَا فَعَمِلَهَا، كَتَبَهَا اللَّهُ سَيِّئَةً وَاحِدَةً\". \nرواه البخاري ومسلم","english":{"narrator":"On the authority of son of Abbas (may Allah be pleased with them both), from the Messenger of Allah (ﷺ), among the sayings he related from his Lord (glorified and exalted be He) is that He said:","text":"Allah has written down the good deeds and the bad ones. Then He explained it  he who has intended a good deed and has not done it, Allah writes it down with Himself as a full good deed, but if he has intended it and has done it, Allah writes it down with Himself as from ten good deeds to seven hundred times, or many times over. But if he has intended a bad deed and has not done it, Allah writes it down with Himself as a full good deed, but if he has intended it and has done it, Allah writes it down as one bad deed.\n\nIt was related by al-Bukhari and Muslim."}},{"id":41002,"idInBook":17,"chapterId":0,"bookId":11,"arabic":"عَنْ أَبِي ذَرٍّ الْغِفَارِيِّ رَضِيَ اللَّهُ عَنْهُ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيمَا يَرْوِيهِ عَنْ رَبِّهِ عَزَّ وَجَلَّ أَنَّهُ قَالَ: \n\n\" يَا عِبَادِي: إِنِّي حَرَّمْتُ الظُّلْمَ عَلَى نَفْسِي وَجَعَلْتُهُ بَيْنَكُمْ مُحَرَّمًا فَلَا تَظَالَمُوا. \nيَا عِبَادِي: كُلُّكُمْ ضَالٌّ إِلَّا مَنْ هَدَيْتُهُ فَاسْتَهْدُونِي أَهْدِكُمْ، يَا عِبَادِي: كُلُّكُمْ جَائِعٌ إِلَّا مَنْ أَطْعَمْتُهُ فَاسْتَطْعِمُونِي أُطْعِمْكُمْ، يَا عِبَادِي: كُلُّكُمْ عَارٍ إِلَّا مَنْ كَسَوْتُهُ فَاسْتَكْسُونِي أَكْسُكُمْ، يَا عِبَادِي: إِنَّكُمْ تُخْطِئُونَ بِاللَّيْلِ وَالنَّهَارِ، وَأَنَا أَغْفِرُ الذُّنُوبَ جَمِيعًا، فَاسْتَغْفِرُونِي أَغْفِرْ لَكُمْ. \nيَا عِبَادِي: إِنَّكُمْ لَنْ تَبْلُغُوا ضَرِّي فَتَضُرُّونِي، وَلَنْ تَبْلُغُوا نَفْعِي فَتَنْفَعُونِي، يَا عِبَادِي: لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَإِنْسَكُمْ وَجِنَّكُمْ كَانُوا عَلَى أَتْقَى قَلْبِ رَجُلٍ وَاحِدٍ مِنْكُمْ مَا زَادَ ذَلِكَ فِي مُلْكِي شَيْئًا، يَا عِبَادِي: لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَإِنْسَكُمْ وَجِنَّكُمْ كَانُوا عَلَى أَفْجَرِ قَلْبِ رَجُلٍ وَاحِدٍ مِنْكُمْ مَا نَقَصَ ذَلِكَ مِنْ مُلْكِي شَيْئًا، يَا عِبَادِي: لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَإِنْسَكُمْ وَجِنَّكُمْ قَامُوا فِي صَعِيدٍ وَاحِدٍ فَسَأَلُونِي، فَأَعْطَيْتُ كُلَّ وَاحِدٍ مَسْأَلَتَهُ، مَا نَقَصَ ذَلِكَ مِمَّا عِنْدِي إِلَّا كَمَا يَنْقُصُ الْمِخْيَطُ إِذَا أُدْخِلَ الْبَحْرَ. \nيَا عِبَادِي: إِنَّمَا هِيَ أَعْمَالُكُمْ أُحْصِيهَا لَكُمْ، ثُمَّ أُوَفِّيكُمْ إِيَّاهَا، فَمَنْ وَجَدَ خَيْرًا فَلْيَحْمَدْ اللَّهَ، وَمَنْ وَجَدَ غَيْرَ ذَلِكَ فَلَا يَلُومَنَّ إِلَّا نَفْسَهُ\". \nرواه مسلم (وكذلك الترمذي وابن ماجه)","english":{"narrator":"On the authority of Abu Dharr al-Ghifari (may Allah be pleased with him) from the Prophet (ﷺ) is that among the sayings he relates from his Lord (may He be glorified) is that He said:","text":"O My servants, I have forbidden oppression for Myself and have made it forbidden amongst you, so do not oppress one another. O My servants, all of you are astray except for those I have guided, so seek guidance of Me and I shall guide you, O My servants, all of you are hungry except for those I have fed, so seek food of Me and I shall feed you. O My servants, all of you are naked except for those I have clothed, so seek clothing of Me and I shall clothe you. O My servants, you sin by night and by day, and I forgive all sins, so seek forgiveness of Me and I shall forgive you. O My servants, you will not attain harming Me so as to harm Me, and will not attain benefitting Me so as to benefit Me. O My servants, were the first of you and the last of you, the human of you and the jinn of you to be as pious as the most pious heart of any one man of you, that would not increase My kingdom in anything. O My servants, were the first of you and the last of you, the human of you and the jinn of you to be as wicked as the most wicked heart of any one man of you, that would not decrease My kingdom in anything. O My servants, were the first of you and the last of you, the human of you and the jinn of you to rise up in one place and make a request of Me, and were I to give everyone what he requested, that would not decrease what I have, any more that a needle decreases the sea if put into it. O My servants, it is but your deeds that I reckon up for you and then recompense you for, so let him who finds good, praise Allah, and let him who finds other than that, blame no one but himself.\n\nIt was related by Muslim (also by at-Tirmidhi and Ibn Majah)."}},{"id":41003,"idInBook":18,"chapterId":0,"bookId":11,"arabic":"عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\n\" إِنَّ اللَّهَ عَزَّ وَجَلَّ يَقُولُ يَوْمَ الْقِيَامَةِ: يَا ابْنَ آدَمَ، مَرِضْتُ فَلَمْ تَعُدْنِي(1) قَالَ: يَا رَبِّ كَيْفَ أَعُودُكَ وَأَنْتَ رَبُّ الْعَالَمِينَ؟ قَالَ: أَمَا عَلِمْتَ أَنَّ عَبْدِي فُلَانًا مَرِضَ فَلَمْ تَعُدْهُ؟ أَمَا عَلِمْتَ أَنَّكَ لَوْ عُدْتَهُ لَوَجَدْتَنِي عِنْدَهُ. يَا ابْنَ آدَمَ: اسْتَطْعَمْتُكَ فَلَمْ تُطْعِمْنِي، قَالَ: يَا رَبِّ وَكَيْفَ أُطْعِمُكَ وَأَنْتَ رَبُّ الْعَالَمِينَ؟ قَالَ: أَمَا عَلِمْتَ أَنَّهُ اسْتَطْعَمَكَ عَبْدِي فُلَانٌ فَلَمْ تُطْعِمْهُ؟ أَمَا عَلِمْتَ أَنَّكَ لَوْ أَطْعَمْتَهُ لَوَجَدْتَ ذَلِكَ عِنْدِي. يَا ابْنَ آدَمَ: اسْتَسْقَيْتُكَ فَلَمْ تَسْقِنِي، قَالَ: يَا رَبِّ كَيْفَ أَسْقِيكَ وَأَنْتَ رَبُّ الْعَالَمِينَ؟ قَالَ اسْتَسْقَاكَ عَبْدِي فُلَانٌ فَلَمْ تَسْقِهِ، أَمَا إِنَّكَ لَوْ سَقَيْتَهُ لَوَجَدْتَ ذَلِكَ عِنْدِي\" \nرواه مسلم","english":{"narrator":"On the authority of Abu Hurayrah (may Allah be pleased with him), who said that the Messenger of Allah (ﷺ) said:","text":"Allah (mighty and sublime be He) will say on the Day of Resurrection:\nO son of Adam, I fell ill and you visited Me not. He will say: O Lord, and how should I visit You when You are the Lord of the worlds? He will say: Did you not know that My servant So-and-so had fallen ill and you visited him not? Did you not know that had you visited him you would have found Me with him? O son of Adam, I asked you for food and you fed Me not. He will say: O Lord, and how should I feed You when You are the Lord of the worlds? He will say: Did you not know that My servant So-and-so asked you for food and you fed him not? Did you not know that had you fed him you would surely have found that (the reward for doing so) with Me? O son of Adam, I asked you to give Me to drink and you gave Me not to drink. He will say: O Lord, how should I give You to drink when You are the Lord of the worlds? He will say: My servant So-and-so asked you to give him to drink and you gave him not to drink. Had you given him to drink you would have surely found that with Me.\n\nIt was related by Muslim."}},{"id":41004,"idInBook":19,"chapterId":0,"bookId":11,"arabic":"عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\n\" قَالَ اللَّهُ عَزَّ وَجَلَّ: الْكِبْرِيَاءُ رِدَائِي، وَالْعَظَمَةُ إِزَارِي، فَمَنْ نَازَعَنِي وَاحِدًا مِنْهُمَا، قَذَفْتُهُ فِي النَّارِ\". \nرواه أبو داود(وكذلك ابن ماجه وأحمد) بأسانيد صحيحة.(1)","english":{"narrator":"On the authority of Abu Hurayrah (may Allah be pleased with him), who said that the Messenger of Allah (ﷺ) said:","text":"Allah (mighty and sublime be He) said:\nPride is my cloak and greatness My robe, and he who competes with Me in respect of either of them I shall cast into Hell-fire.\n\nIt was related by Abu Dawud (also by Ibn Majah and Ahmad) with sound chains of authority. This Hadith also appears in Muslim in another version."}},{"id":41005,"idInBook":20,"chapterId":0,"bookId":11,"arabic":"عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ ،أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\n\" تُفْتَحُ أَبْوَابُ الْجَنَّةِ يَوْمَ الِاثْنَيْنِ، وَيَوْمَ الْخَمِيسِ، فَيُغْفَرُ لِكُلِّ عَبْدٍ لَا يُشْرِكُ بِاللَّهِ شَيْئًا، إِلَّا رَجُلًا كَانَتْ بَيْنَهُ وَبَيْنَ أَخِيهِ شَحْنَاءُ، فَيُقَالُ: (1) أَنْظِرُوا (2) هَذَيْنِ حَتَّى يَصْطَلِحَا، أَنْظِرُوا هَذَيْنِ حَتَّى يَصْطَلِحَا، أَنْظِرُوا هَذَيْنِ حَتَّى يَصْطَلِحَا\" \nرواه مسلم (وكذلك مالك وأبو داود)","english":{"narrator":"On the authority of Abu Hurayrah (may Allah be pleased with him), who said that the Messenger of Allah (ﷺ) said:","text":"The gates of Paradise will be opened on Mondays and on Thursdays, and every servant  it will be said: Delay these two until they are reconciled; delay these two until they are reconciled.\n\nIt was related by Muslim (also by Malik and Abu Dawud)."}},{"id":41006,"idInBook":21,"chapterId":0,"bookId":11,"arabic":"عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\n\" قَالَ اللَّهُ تَعَالَى: ثَلَاثَةٌ أَنَا خَصْمُهُمْ يَوْمَ الْقِيَامَةِ: رَجُلٌ أَعْطَى بِي ثُمَّ غَدَرَ (1)، وَرَجُلٌ بَاعَ حُرًّا فَأَكَلَ ثَمَنَهُ، وَرَجُلٌ اسْتَأْجَرَ أَجِيرًا فَاسْتَوْفَى مِنْهُ وَلَمْ يُعْطِهِ أَجْرَهُ\" \nرواه البخاري (وكذلك ابن ماجه وأحمد)","english":{"narrator":"On the authority of Abu Hurayrah (may Allah be pleased with him), who said that the Messenger of Allah (ﷺ) said that Allah the Almighty said:","text":"There are three (1) whose adversary I shall be on the Day of Resurrection: a man who has given his word by Me and has broken it; a man who has sold a free man (2) and has consumed the price; and a man who has hired a workman, has exacted his due in full from him and has not given him his wage.\n(1) i.e. types of men.\n(2) i.e. a man who has made a slave of another and has sold him.\n\nIt was related by al-Bukhari (also by Ibn Majah and Ahmad ibn Hanbal)."}},{"id":41007,"idInBook":22,"chapterId":0,"bookId":11,"arabic":"عَنْ أَبِي سَعِيدٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\n\" لَا يَحْقِرْ أَحَدُكُمْ نَفْسَهُ، قَالُوا: يَا رَسُولَ اللَّهِ كَيْفَ يَحْقِرُ أَحَدُنَا نَفْسَهُ؟ قَالَ: يَرَى أَمْرَ الِلَّهِ عَلَيْهِ فِيهِ مَقَالٌ، ثُمَّ لَا يَقُولُ فِيهِ، فَيَقُولُ اللَّهُ عَزَّ وَجَلَّ لَهُ يَوْمَ الْقِيَامَةِ: مَا مَنَعَكَ أَنْ تَقُولَ فِي كَذَا وَكَذَا؟ فَيَقُولُ: خَشْيَةُ النَّاسِ، فَيَقُولُ: فَإِيَّايَ كُنْتَ أَحَقَّ أَنْ تَخْشَى\" \nرواه ابن ماجه بسند صحيح","english":{"narrator":"On the authority of Abu Sa'id (may Allah be pleased with him), who said that the Messenger of Allah (ﷺ) said:","text":"Let not any one of you belittle himself. They said: O Messenger of Allah, how can any one of us belittle himself? He said: He finds a matter concerning Allah about which he should say something, and he does not say  out of fear of people. Then He says: Rather it is I whom you should more properly fear.\n\nIt was related by Ibn Majah with a sound chain of authorities."}},{"id":41008,"idInBook":23,"chapterId":0,"bookId":11,"arabic":"عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \n\n\"إِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى يَقُولُ يَوْمَ الْقِيَامَةِ: أَيْنَ الْمُتَحَابُّونَ بجَلَالِي؟ الْيَوْمَ أُظِلُّهُمْ فِي ظِلِّي يَوْمَ لَا ظِلَّ إِلَّا ظِلِّي\" \nرواه البخاري (وكذلك مالك)","english":{"narrator":"On the authority of Abu Hurayrah (may Allah be pleased with him), who said that the Messenger of Allah (ﷺ) said:","text":"Allah will say on the Day of Resurrection:\nWhere are those who love one another through My glory? Today I shall give them shade in My shade, it being a day when there is no shade but My shade.\n\nIt was related by al-Bukhari (also by Malik)."}},{"id":41009,"idInBook":24,"chapterId":0,"bookId":11,"arabic":"عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\n\" إِنَّ اللَّهَ إِذَا أَحَبَّ عَبْدًا دَعَا جِبْرِيلَ، فَقَالَ: إِنِّي أُحِبُّ فُلَانًا فَأَحِبَّهُ، قَالَ: فَيُحِبُّهُ جِبْرِيلُ، ثُمَّ يُنَادِي فِي السَّمَاءِ فَيَقُولُ: إِنَّ اللَّهَ يُحِبُّ فُلَانًا فَأَحِبُّوهُ، فَيُحِبُّهُ أَهْلُ السَّمَاءِ، قَالَ: ثُمَّ يُوضَعُ لَهُ الْقَبُولُ فِي الْأَرْضِ. وَإِذَا اللَّهُ أَبْغَضَ عَبْدًا، دَعَا جِبْرِيلَ فَيَقُولُ: إِنِّي أُبْغِضُ فُلَانًا فَأَبْغِضْهُ، فَيُبْغِضُهُ جِبْرِيلُ ثُمَّ يُنَادِي فِي أَهْلِ السَّمَاءِ: إِنَّ اللَّهَ يُبْغِضُ فُلَانًا فَأَبْغِضُوهُ، قَالَ: فَيُبْغِضُونَهُ، ثُمَّ تُوضَعُ لَهُ الْبَغْضَاءُ فِي الْأَرْضِ\". \nرواه مسلم (وكذلك البخاري ومالك والترمذي)","english":{"narrator":"On the authority of Abu Hurayrah (may Allah be pleased with him), who said that the Messenger of Allah (ﷺ) said:","text":"If Allah has loved a servant , He calls Gabriel and says: I abhor So-and-so, therefore abhor him. So Gabriel abhors him. Then Gabriel calls out to the inhabitants of heaven: Allah abhors So-and-so, therefore abhor him. He (the Prophet pbuh) said: So they abhor him, and abhorrence is established for him on earth.\n\nIt was related by Muslim (also by al-Bukhari, Malik, and at-Tirmidhi)."}},{"id":41010,"idInBook":25,"chapterId":0,"bookId":11,"arabic":"عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\n\" إِنَّ اللَّهَ عَزَّ وَجَلَّ قَالَ: مَنْ عَادَى لِي وَلِيًّا، فَقَدْ آذَنْتُهُ بِالْحَرْبِ، وَمَا تَقَرَّبَ إِلَيَّ عَبْدِي بِشَيْءٍ أَحَبَّ إِلَيَّ مِمَّا افْتَرَضْتُ عَلَيْهِ، وَمَا يَزَالُ عَبْدِي يَتَقَرَّبُ إِلَيَّ بِالنَّوَافِلِ حَتَّى أُحِبَّهُ، فَإِذَا أَحْبَبْتُهُ، كُنْتُ سَمْعَهُ الَّذِي يَسْمَعُ بِهِ، وَبَصَرَهُ الَّذِي يُبْصِرُ بِهِ، وَيَدَهُ الَّتِي يَبْطِشُ بِهَا، وَرِجْلَهُ الَّتِي يَمْشِي بِهَا، وَإِنْ سَأَلَنِي لَأُعْطِيَنَّهُ، وَلَئِنْ اسْتَعَاذَنِي لَأُعِيذَنَّهُ، وَمَا تَرَدَّدْتُ عَنْ شَيْءٍ أَنَا فَاعِلُهُ تَرَدُّدِي عَنْ نَفْسِ عَبْدِي الْمُؤْمِنِ، يَكْرَهُ الْمَوْتَ وَأَنَا أَكْرَهُ مَسَاءَتَهُ\" \nرواه البخاري","english":{"narrator":"On the authority of Abu Hurayrah (may Allah be pleased with him), who said that the Messenger of Allah (ﷺ) said:","text":"Allah (mighty and sublime be He) said:\nWhosoever shows enmity to someone devoted to Me, I shall be at war with him. My servant draws not near to Me with anything more loved by Me than the religious duties I have enjoined upon him, and My servant continues to draw near to Me with supererogatory works so that I shall love him. When I love him I am his hearing with which he hears, his seeing with which he sees, his hand with which he strikes and his foot with which he walks. Were he to ask  the soul of My faithful servant: he hates death and I hate hurting him.\n\nIt was related by al-Bukhari."}},{"id":41011,"idInBook":26,"chapterId":0,"bookId":11,"arabic":"عَنْ أَبي أُمامةَ رَضِيَ اللهُ عَنْهُ عَن النَّبِيّ صَلَّى الله عَلَيْهِ وَ سَلَّمَ قَالَ  \nقَالَ اللهُ عَزَّ وَجَلَّ :  إِنَّ أَغْبَطَ أَوْلِيَائي عِنْدِي لَمُوْمِنُ خَفِيفُ الخَاذِ ذُو حَظِّ مِنَ الصَّلاةِ أَحْسَنَ عِبَادَتَ رَبِّهِ وَ أَطَاعَهُ فِي السَّرِّ وَ كَانَ غَامِضًا فِي النَّاسِ لا يُشارُ إِلَيْهِ بِالأَصابِعِ وَ كَانَ رِزْقُهُ كفافًا فَصَبَرَ عَلى ذَلِكَ  ثُمَّ نَفَضَ بِيَدِهِ  ثُمَّ قَالَ : عُجِّلَتْ مَنِيَّتُهُ قَلَّتْ بَواكِيهِ قَلَّ تُرَاثُهُ  \nرواه الترمذي  (وكذالك أحمد و ابن ماجه)  وإسنَاده حسن","english":{"narrator":"On the authority of Abu Umamah (may Allah be pleased with him), who said that the Messenger of Allah (ﷺ) said:","text":"Allah (mighty and sublime be He) said:\nTruly of those devoted to Me the one I most favor is a believer who is of meager means and much given to prayer, who has been particular in the worship of his Lord and has obeyed Him inwardly1, who was obscure among people and not pointed out, and whose sustenance was just sufficient to provide for him yet he bore this patiently. Then the Prophet (ﷺ) shook his hand and said: Death will have come early to him, his mourners will have been few, his estate scant.\n\n1 i.e. he has not been ostentatious in his obedience.\n\nIt was related by at-Tirmidhi (also by Ahmad ibn Hanbal and Ibn Majah). Its chain of authorities is sound."}},{"id":41012,"idInBook":27,"chapterId":0,"bookId":11,"arabic":"عَنْ مَسْرُوقٍ . قَالَ :  \n  \nسَأَلْنَا ـ أَوْ سَأَلْتُ عَبْدَاللهِ (أَيْ ابْنَ مَسْعُودٍ ) عَنْ هَذِهِ الايةِ : \n: ولَا تَحْسَبَنَّ الَّذِينَ قُتِلُوا في سَبِيلِ اللهِ أَمْواتاً بَلْ أَحْياءُ عِنْدَ رَبِّهِمْ يُرْزَقُونَ )) ـ قَالَ : أَمَا إِنَّا قَدْ سَأَلْنَا عَنْ ذَلِكَ ، فَقَالَ))\nأَرْواحُهُمْ في جَوْفِ طَيْرٍ خُضْرٍ ، لَهَا قَنَادِيلُ مُعَلَّقَةٌ بِالعَرْشِ ، تَسْرَحُ مِنَ الجَنَّةِ حَيْثُ شَاءَتْ ، ثُمَّ َ تَأْوِي إِلي تِلْكَ القَنَادِيلِ ، فَأَطَّلَعَ إِلَيْهِمْ رَبُّهُمْ اطِّلَاعَةً فَقَالَ : هَلْ تَشْتَهُونَ شَيْئاً ؟ قَالُوا : أَيَّ شَيْءٍ نَشْتَهِي ، وَ نَحْنُ نَسْرَحُ مِنَ الجَنَّةِ حَيْثُ شِئْنا ؟ فَفَعَلَ ذَلِكَ بِهِمْ ثَلَاثََ مَرَّاتٍ ، فَلَمَّا رَأَوْا أَنَّهُمْ لَنْ يُتْرَكُوا مِنْ أَنْ يُسْأَلُوا ، قَالُوا : يَا رَبِّ ، نُرِيْدُ أَنْ تَرُدَّ أَرْوَاحَنَا في أَجْسَادِنَا ؛ حَتَّى نُقْتَلَ في سَبِيلِكَ مَرَّةً أُخْرَي . فَلَمَّا رَأَى أَنْ لَيْسَ لَهُمْ حَاجَةٌ تُرِكُوا . \n  \n(رواهُ مسلم (وكذلك الترمذي والنسائي وابن ماجه","english":{"narrator":"On the authority of Masruq, who said:","text":"We asked Abdullah (i.e. Ibn Masud) about this verse: And do not regard those who have been killed in the cause of Allah as dead, rather are they alive with their Lord, being provided for (Quran Chapter 3 Verse 169). He said: We asked about that and the Prophet (pbuh) said: Their souls are in the insides of green birds having lanterns suspended from the Throne, roaming freely in Paradise where they please, then taking shelter in those lanterns. So their Lord cast a glance at them (1) and said: Do you wish for anything? They said: What shall we wish for when we roam freely in Paradise where we please? And thus did He do to them three times. When they say that they would not be spared from being asked , they said: O Lord, we would like for You to put back our souls into our bodies so that we might fight for Your sake once again. And when He saw that they were not in need of anything they were let be.\n(1) i.e. at those who had been killed in the cause of Allah.\n\nIt was related by Muslim (also by at-Tirmidhi, an-Nasa'i and Ibn Majah)."}},{"id":41013,"idInBook":28,"chapterId":0,"bookId":11,"arabic":":عَنْ جُنْدُبٍ بِن عَبْدِاللهِ رَضِيَ اللهُ عَنْهُ قَالَ : رَسُولُ اللهِ  صَلَّى الله عَلَيْهِ وَ سَلَّمَ  \n \nكَانَ فِيمَنْ كَانَ قَبْلَكُمْ رَجُلٌ  بِهِ جُرْحٌ  فَجَزِعَ فَأَخَذَ سِكِّينًا فَحَزَّ بِهَا يَدَهُ فَمَا رقَأَ الدَّمُ  حَتَّى ماتَ قَالَ اللهُ تَعَالَى : بَادَرَنِي عَبْدِي بِنَفْسِهِ حَرَّمْتُ عَلَيْهِ الجَنَّةَ \nرواه البخاري","english":{"narrator":"On the authority of Jundub ibn Abdullah (may Allah be pleased with him), who said that the Messenger of Allah (ﷺ) said:","text":"There was amongst those before you a man who had a wound. He was in  anguish that he took a knife and made with it a cut in his hand, and the blood did not cease to flow till he died. Allah the Almighty said: My servant has himself forestalled Me; I have forbidden him Paradise.\n\nIt was related by al-Bukhari."}},{"id":41014,"idInBook":29,"chapterId":0,"bookId":11,"arabic":": عَنْ أبي هرَيرَةَ رَضِيَ اللهُ عَنْهُ أَنَّ رَسُولَ اللهِ  صَلَّى الله عَلَيْهِ وَ سَلَّمَ قَالَ \n \n يَقُولُ اللهُ تَعَالَى : مَا لِعَبْدِي المُؤْمِنِ عِنْدِي جَزَاءٌ، إِذا قَبَضْتُ صَفِيَّهُ، مِنْ أَهلِ الدُّنْيَا، ثُمَّ احْتَسبَهُ، إِلَّا الجَنَّةَ\nرواه البخاري","english":{"narrator":"On the authority of Abu Hurayrah (may Allah be pleased with him), who said that the Messenger of Allah (ﷺ) said:","text":"Allah (mighty and sublime be He) says:\nMy faithful servant's reward from Me, if I have taken to Me his best friend from amongst the inhabitants of the world and he has then borne it patiently for My sake, shall be nothing less than Paradise.\n\nIt was related by al-Bukhari."}},{"id":41015,"idInBook":30,"chapterId":0,"bookId":11,"arabic":":عَنْ أَبي هُرَيْرَةَ ،  رَضِيَ اللهُ عَنْهُ ،  أَنَّ رَسُولَ اللهِ ، صَلَّى الله عَلَيْهِ وَ سَلَّمَ ، قَالَ\n. قَالَ اللهُ عَزَّ وَجَلَّ : إِذا أَحَبَّ عَبْدِي لِقَائي ،  أَحْبَبْتُ لِقَاءَهُ ، وإِذا كَرِهَ لِقَائي ، كَرِهْتُ لِقَاءَهُ \n.رواه البخاري و مالك\nو في رواية مسلم ، توضح معنى الحديث : \n: عَنْ عَائِشَةَ ، رَضِيَ اللهُ عَنْهَا ، قَالَتْ : قَالَ رَسُولُ اللهِ ، صَلَّى اللهُ عَلَيْهِ وسَلَّمَ\nمَنْ أَحَبَّ لِقَاءَ اللهِ ، أَحَبَّ اللهُ لِقَاءَهُ ، وَ مَنْ كَرِهَ لِقَاءَ اللهِ ، كَرِهَ اللهُ لِقَاءَهُ . فَقُلْتُ : يَا نَبِيَّ اللهِ ، أَكَراهِيةَ المَوْتِ ؟ فَكُلُّنَا نَكْرَهُ المَوْتَ . قَالَ لَيْسَ كَذَلِكَ ، وَلَكِنَّ المُؤْمِنَ إذا بُشِّرَ  بِرَحْمةِ اللهِ وَ رِضْوَانِهِ وَجَنَّتِهِ ، أَحَبَّ لِقَاءَ اللهِ ، فَأَحَبَّ اللهُ لِقَاءَهُ ، وَإِنَّ الكَافِرَ إِذا بُشِّرَ بِعَذَابِ اللهِ وَسَخَطِهِ ، كَرِهَ لِقَاءَاللهِ ، وَكَرِهَ اللهُ لِقاءَهُ","english":{"narrator":"On the authority of Abu Hurayrah (may Allah be pleased with him), who said that the Messenger of Allah (ﷺ) said:","text":"Allah (mighty and sublime be He) said:\nIf My servant likes to meet Me, I like to meet him; and if he dislikes to meet Me, I dislike to meet him. Prophetic explanation of this Sacred Hadith: He who likes to meet Allah, Allah likes to meet him; and he who dislikes to meet Allah, Allah dislikes to meet him. Aishah (may Allah be pleased with her) said: O Prophet of Allah, is it because of the dislike of death, for all of us dislike death? The Prophet (pbuh) said: It is not so, but rather it is that when the believer is given news of Allah's mercy, His approval and His Paradise, he likes to meet Allah and Allah likes to meet him; but when the unbeliever is given news of Allah's punishment and His displeasure, he dislikes to meet Allah and Allah dislikes to meet him.\n\nIt was related by al-Bukhari and Malik. The Prophetic version is related by Muslim."}},{"id":41016,"idInBook":31,"chapterId":0,"bookId":11,"arabic":"عَنْ جُنْدُبٍ رَضِيَ اللهُ عَنْهُ : أَنَّ رَسُولَ اللهِ  صَلَّى الله عَلَيْهِ وَ سَلَّمَ حَدَّثَ \n \n  (أَنْ رجُلاً قال : واللهِ لا يَغْفِرُ اللهُ لِفُلانٍ وإِنَّ اللهَ تَعَالَى قَالَ : مَنْ ذَا الَّذِي يَتَأَلَّى عَلَيَّ أَنْ لا أَغْفِرَ لِفُلان،فَإِنِّي قَدْ غَفَرْتُ لِفُلانٍ، وأَحْبَطْتُ عَمَلَكَ (أَوْ كَمَا قَال \nرواه مسلم","english":{"narrator":"On the authority of Jundub (may Allah be pleased with him), who said that the Messenger of Allah (ﷺ) related:","text":"A man said: By Allah, Allah will not forgive So-and-so. At this Allah the Almighty said: Who is he who swears by Me that I will not forgive So-and-so? Verily I have forgiven So-and-so and have nullified your ).\n(1) A similar Hadith, which is given by Abu Dawud, indicates that the person referred to was a goldly man whose previous good deeds were brought to nought through presuming to declare that Allah would not forgive someone's bad deeds.\n\nIt was related by Muslim."}},{"id":41017,"idInBook":32,"chapterId":0,"bookId":11,"arabic":"عَنْ أَبي هُرَيْرَةَ ،  رَضِيَ اللهُ عَنْهُ ،  عَنِ النَّبَيِّ  صَلَّى الله عَلَيْهِ وَ سَلَّمَ ، قَالَ :  \n  \nأَسْرَفَ رَجُلٌ عَلي نَفْسِهِ ، فَلَمَّا حَضَرَهُ المَوْتُ أَوْصَى بَنِيه ، فَقَالَ : إِذَا أَنَا مِتُّ فَأَحْرِقُوني ، ثُمَّ اسْحَقُوني ، ثُمَّ أَذْرُوني في البَحْرِ فَوَاللهِ لَئِنْ قَدَرَ عَلَيَّ رَبِّي لَيُعَذَّبَنِّي عَذَاباً ، مَا عَذَّبَهُ أَحَداً ، فَفَعَلُوا ذَلِكَ بِهِ . فَقَالَ لِلْأَرْضِ : أَدِّي مَا أَخَذْتِ ، فَإِذا هُوَ قَائِمٌ ، فَقَالَ لَهُ : مَا حَمَلَكَ عَلَي مَا صَنَعْتَ ؟ قَالَ : خَشْيَتُكَ يَا رَبِّ ، أَوْ مَخَافَتُكَ . فَغَفَرَ لَهُ بِذَلِكَ . \n  \nرواهُ مسلم (وكذلك البخاري والنسائي وابن ماجه)","english":{"narrator":"On the authority of Abu Hurayrah (may Allah be pleased with him), who said that the Messenger of Allah (ﷺ) said:","text":"A man sinned greatly against himself, and when death came to him he charged his sons, saying: When I have died, burn me, then crush me and scatter . So they did that to him. Then He said to the earth: Produce what you have taken-and there he was! And He said to him: What induced you to do what you did? He said: Being afraid of You, O my Lord (or he said: Being frightened of You) and because of that He forgave him.\n\nIt was related by Muslim (also by al-Bukhari, an-Nasa'i and Ibn Majah)."}},{"id":41018,"idInBook":33,"chapterId":0,"bookId":11,"arabic":"عَنْ أَبي هُرَيْرَةَ ،  رَضِيَ اللهُ عَنْهُ ،  عَنِ النَّبَيِّ  صَلَّى الله عَلَيْهِ وَ سَلَّمَ ، فِيما يَحْكِي عَنْ رَبِّهِ عَزَّ وَجَلَّ ، قَالَ    :  \n  \nأَذْنَبَ عَبْدٌ ذَنْبًا ، فَقَالَ : اللَّهُمَّ اغْفِرْ لِي ذَنْبي . فَقَالَ تَبَارَكَ وَتَعَالى : أَذْنَبَ عَبْدِي ذَنْبًا ، فَعَلِمَ أنَّ لَهُ رَبّاً ، يَغْفِرُ الذَّنْبَ ، وَيَأْخُذُ بِهِ . ثُمَّ عَادَ فَأَذْنَبَ ، فَقَالَ : أَيّ رَبِّ ، اغْفِرْ لِي ذَنْبِِي ، فَقَالَ تَبَارَكَ وتَعَالى : عَبْدِي أَذْنَبَ ذَنْباً . فَعَلِمَ أَنَّ لَهُ رَبّاً يَغْفِرُ الذَّنْبَ ، ويَأْخُذُ بِهِ . ثُمَّ عَادَ فَأَذْنَبَ ، فَقَالَ : أَيّ رَبِّ ، اغْفِرْ لِي ذَنْبِي : فَقَالَ تَبَارَكَ وَتَعَالَى : أَذْنَبَ عَبْدِي ذَنْباً ، فَعَلِمَ أَنَّ لَهُ رَبّاً ، يَغْفِرُ الذَّنْبَ ، ويَأْخُذُ بالذَّنْبِ . اعْمَلْ مَا شِئْتَ ، فَقَدْ غَفَرْتُ لَكَ .  \n  \nرواهُ مسلم (وكذلك البخاري)","english":{"narrator":"On the authority of Abu Hurayrah (may Allah be pleased with him) that the Prophet (ﷺ), from among the things he reports from his Lord (mighty and sublime be He), is that he said:","text":"A servant  committed a sin and said: O Allah, forgive me my sin. And He (glorified and exalted be He) said: My servant has committed a sin and has known that he has a Lord who forgives sins and punishes for them. Then he sinned again and said: O Lord, forgive me my sin. And He (glorified and exalted be He) said: My servant has committed a sin and has known that he has a Lord who forgives sins and punishes for them. Then he sinned again and said: O Lord, forgive me my sin. And He (glorified and exalted be He) said: My servant has committed a sin and has known that he has a Lord who forgives sins and punishes for sins. Do what you wish, for I have forgiven you.\n\nIt was related by Muslim (also by al-Bukhari)."}},{"id":41019,"idInBook":34,"chapterId":0,"bookId":11,"arabic":"عَنْ أَنَسٍ رَضِيَ اللهُ عَنْهُ ،  قَالَ : سَمِعْتُ  رَسُولَ اللهِ  صَلَّى الله عَلَيْهِ وَ سَلَّمَ ، يَقُولُ :  \n  \nقَالَ اللهُ تَعَالَى : يَا ابْنَ ادَمَ ، إِنَّكَ مَا دَعَوْتََنِي وَرَجَوْتَنِي ، غَفَرْتُ لَكَ عَلَى مَا كَانَ مِنْكَ وَلَا أُبالِي . يا ابْنَ ادَمَ  :لَوْ بَلَغَتْ ذُنُوبُكَ عَنانَ السَّماءِ ثُم َّ اسْتَغْفَرْتَني ، غَفَرْتُ لَكَ . يَا ابْنَ ادَمَ : إِنَّكَ لَوْ أَتَيْتَنِي بِقُرَابِ الأَرْضِ خَطَايا ثُمَّ لَقِيتَني لَا تُشْرِكُ بِي شَيْأً ، لَأَتيْتُكَ بِقُرَابِها مَغْفِرَةً \n    \nرواهُ الترمذي (وكذلك أحمد) وسنده حسن","english":{"narrator":"On the authority of Anas (may Allah be pleased with him), who said:","text":"I heard the Messenger of Allah (ﷺ) say: Allah the Almighty said:\nO son of Adam, so long as you call upon Me and ask of Me, I shall forgive you for what you have done, and I shall not mind. O son of Adam, were your sins to reach the clouds of the sky and were you then to ask forgiveness of Me, I would forgive you. O son of Adam, were you to come to Me with sins nearly as great as the earth and were you then to face Me, ascribing no partner to Me, I would bring you forgiveness nearly as great as it.\n\nIt was related by at-Tirmidhi (also by Ahmad ibn Hanbal). Its chain of authorities is sound."}},{"id":41020,"idInBook":35,"chapterId":0,"bookId":11,"arabic":"عَنْ أَبي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ  أَنَّ رَسُولَ اللهِ  صَلَّى الله عَلَيْهِ وَ سَلَّمَ قَالَ \n   \nيَتنزَّلُ رَبُّنَا ، تَبَارَكَ وَتَعَالَى ، كُلَّ لَيْلَةٍ إلي سَمَاءِ الدُّنْيا ، حينَ يَبْقَى ثُلُثُ اللَّيْلِ الاخِرُ ، فَيَقُولُ  مَنْ يَدْعُوني فأَسْتَجِيبَ لَه ؟ مَنْ يَسْأَلُني فَأُعْطِيَهُ ؟ مَنْ يَسْتَغْفِرُني فَأَغْفِرَلَهُ ؟ \n     \n رواه البخاري (وكذلك مسلم ومالك والترمذي و أبو داود) \nوفي رواية لمسلم زيادة: \nفَلا يَزالُ كذَلِك حَتَى يُضِيءَ الفَجْرُ","english":{"narrator":"On the authority of Abu Hurayrah (may Allah be pleased with him), who said that the Messenger of Allah (ﷺ) said:","text":"Our Lord (glorified and exalted be He) descends each night to the earth's sky when there remains the final third of the night, and He says: Who is saying a prayer to Me that I may answer it? Who is asking something of Me that I may give it him? Who is asking forgiveness of Me that I may forgive him?\n\nIt was related by al-Bukhari (also by Muslim, Malik, at-Tirmidhi and Abu Dawud). In a version by Muslim the Hadith ends with the words: And thus He continues till  dawn shines."}},{"id":41021,"idInBook":36,"chapterId":0,"bookId":11,"arabic":"عَنْ أَنَسٍ ،  رَضِيَ اللهُ عَنْهُ ، عَنِ النَّبِيِّ صَلَّى الله عَلَيْهِ وَ سَلَّمَ ، قَالَ \nيَجْتَمِعُ المُؤْمِنُونَ يَوْمَ القِيَامَةِ فَيَقُولُونَ : لَوِ اسْتَشْفَعْنَا إلى رَبِّنَا ، فَيَأْتُونَ ادَمَ ، فَيَقُولُونَ : أَنْتَ أَبو النَّاسِ ، خَلَقَكَ اللهُ بِيَدِهِ ، وَأَسْجَدَ لَكَ مَلائِكَتَهُ ، وَعَلَّمَكَ أَسْماءَ كُلِّ شَيْءٍ ، فاشْفَعْ لَنا عِنْدَ رَبِّكَ ، حَتَّى يُرِيحَنا مِنْ مَكَانِنا هَذا ، فَيَقُولُ : لَسْتُ هُنَاكُمْ ـ وَيَذْكُرُ ذَنْبَهُ ، فَيَسْتَحْيي ـ ائْتُوا نُوحاً ؛ فَإِنَّهُ أَوَّلُ رَسُولٍ بَعَثَهُ اللهُ إِلي أَهْلِ الأَرْض ، فَيَأْتُونَهُ ، فَيَقُولُ : لَسْتُ هُنَاكُمْ ـ ويَذْكُرُ سُؤالَهُ رَبَّهُ مَا لَيْسَ لَهُ بِهِ عِلْمٌ ، فَيَسْتَحْيي ـ فَيَقُولُ : اؤْتُوا خَلِيلَ الرَّحْمنِ ، فَيَأْتُونَهُ ، فَيَقُولُ : لَسْتُ هُنَاكُم ،   اؤْتُوا موسى ، عَبْداً كَلَّمَهُ اللهُ ، و أَعْطَاهُ التَّوْرَاةَ . فَيَأْتُونَهُ ، فَيَقُولُ : لَسْتُ هُنَاكُمْ ـ وَيَذْكُرُ  قَتْلَ النَّفْسِ بِغَيْرِ نَفْسٍ ، فَيَسْتَحْيي مِنْ رَبِّهِ ـ فَيَقُولُ : اؤْتُوا عِيسَى ، عَبْدَ اللهِ وَرَسُولَهُ ، وَكَلِمَةَ اللهِ وَرُوحَهُ . فَيَأْتُونَهُ ، فَيَقُولُ : لَسْتُ هُنَاكُمْ ، اؤْتُوا مُحَمَّداً ، ـ صَلَّى الله عَلَيْهِ وَ سَلَّمَ ـ عَبْداً غَفَرَ اللهُ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ وَمَا تَأَخَّرَ ، فَيَأْتُونَنِي ، فَأَنْطَلِقُ حَتَّي أَسْتَأْذِنَ عَلَي رَبِّي فَيُؤْذَنُ . فإذا رَأَيْتُ رَبِّي وَقَعْتُ سَاجداً ، فَيَدَعُني مَا شَاءَ اللهُ ، ثُمَّ يُقَالُ : ارْفَعْ رَأْسَكَ ، وسَلْ تُعْطَهُ ، وَقُلْ يُسْمَعْ ، واشْفَعْ تُشَفَّعْ . فَأَرْفَعُ رَأْسي ، فَأَحْمَدُهُ بِتَحْمِيدٍ يُعَلِّمُنِيهِ ، ثُمَّ أَشْفَعُ ، فَيحُدُّ لي حَدّاً ، فَأُدْخِلُهُمْ الجَنَّةَ . ثُمَّ أَعُودُ إِلَيْهِ ، فإِذا رَأَيْتُ رَبِّي ( فَأَقَعُ ساجداً ) مِثْلَهُ ، ثُمَّ أَشْفَعُ فَيَحُدُّ لِي حَدّاً ، فَأُدْخِلُهُمُ الجَنَّةَ . ثُمَّ أَعُودُ الثالِثةَ ، ثُمَّ أَعُودُ الرَّابعة ، فَأقُولُ : مَا بَقِي في النَّارِ إِلَّا مَنْ حَبَسَهُ القُرْانُ ، ووَجَبَ عَلَيْهِ الخُلُودُ \nرواه البخاري ( وكذلك مسلم والترمذي وابن ماجه ) و في رواية أخرى للبخاري زيادة هي \nقَالَ النَّبِيُّ صَلَّى الله عَلَيْهِ وَ سَلَّمَ ، يَخْرُجُ مِنَ النَّارِ مَنْ قَالَ : لَا إِلهَ إِلَّا اللهُ ، وكَانَ فِي قَلْبِهِ مِنَ الخَيْرِ مَا يَزِنُ شَعِيرةً ، ثُمَّ يَخْرُجُ مِنَ النَّارِ مَنْ قَالَ : لَا إِلهَ إِلَّا اللهُ ، وكَانَ فِي قَلْبِهِ مِنَ الخَيْرِ مَا يَزِنُ بُرَّةً ، ثُمَّ يَخْرُجُ مِنَ النَّارِ مَنْ قَالَ : لَا إِلهَ إِلَّا اللهُ ، وكَانَ فِي قَلْبِهِ مَا يَزِنُ مِنَ الخَيْرِ ذَرَّةً","english":{"narrator":"On the authority of Anas (may Allah be pleased with him) from the Prophet (ﷺ), who said:","text":"The believers will gather together on the Day of Resurrection and will say: Should we not ask . So I shall admit them into Paradise. Then I shall return for a third time, then a fourth, and I shall say: There remains in Hell-fire only those whom the Qur'an has confined and who must be there for eternity. There shall come out of Hell-fire he who has said: There is no god but Allah and who has in his heart goodness weighing a barley-corn; then there shall come out of Hell-fire he who has said: There is no god but Allah and who has in his heart goodness weighing a grain of wheat; then there shall come out of Hell-fire he who has said: There is no god but Allah and who has in his heart goodness weighing an atom.\n\nIt was related by al-Bukhari (also by Muslim, at-Tirmidhi, and Ibn Majah)."}},{"id":41022,"idInBook":37,"chapterId":0,"bookId":11,"arabic":"عَنْ أَبي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ قَالَ : قَالَ رَسُولَ اللهِ  صَلَّى الله عَلَيْهِ وَ سَلَّمَ  \n   \nقَالَ اللهُ أَعْدَدْتُ لِعِبَادي الصَّالِحِينَ مَا لَا عَيْنٌ رَأَت وَ لَا أُذُنٌ سَمِعَتْ وَلَا خَطَرَ عَلَى قَلْبِ بَشَرٍ  فاقْرأُوا إنْ شِئْتُمْ : فَلَا تَعْلَمُ نَفْسٌ مَّا أُخْفِيَ لَهُمْ مِنْ قُرَّةِ أَعْيُنٍ   \n     \nرواه البخاري و مسلم والترمذي وابن ماجه","english":{"narrator":"On the authority of Abu Hurayrah (may Allah be pleased with him), who said that the Messenger of Allah (ﷺ) said:","text":"Allah said:\nI have prepared for My righteous servants what no eye has seen and no ear has heard, not has it occurred to human heart. Thus recite if you wish (1): And no soul knows what joy for them (the inhabitants of Paradise) has been kept hidden (Quran Chapter 32 Verse 17).\n(1) The words \"Thus recite if you wish\" are those of Abu Harayrah.\n\nIt was related by al-Bukhari, Muslim, at-Tirmidhi and Ibn Majah."}},{"id":41023,"idInBook":38,"chapterId":0,"bookId":11,"arabic":"عَنْ أَبي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ  عَنْ رَسُول اللهِ  صَلَّى الله عَلَيْهِ وَ سَلَّمَ قَالَ \n   \nلَمَّا خَلَقَ اللهُ الجَنَّةَ وَالنَّارَ  أَرْسَلَ جِبْرِيْلَ إلى الجنَّةِ  فَقَالَ  انْظُرْ إِلَيْهَا وَإلى مَا أَعْدَدْتُ لأهْلِهَا فِيْهَا . قَالَ: فَجَاءَهَا وَنَظَرَ إِلَيْهَا وَ إِلى مَا أَعَدَّاللهُ  لأهْلِهَا فِيْهَا. قَالَ:  فَرَجَعَ إِلَيْهِ  قَالَ:  فَوَعِزَّتِكَ لَا يَسْمَعُ بِهَا أَحَدٌ إِلَّا دَخَلَهَا  فَأَمَرَ بِهَا فَحُفَّتْ بِالمَكَارِهِ  فَقَالَ:  ارْجِعْ إِلَيْهَا ، فَانْظُرْ إِلى مَا أَعْدَدْتُ لأَهْلِهَا فِيْهَا ، قَالَ:  فَرَجَعَ إِلَيْهَا ، فإِذا هِيَ قَدْ حُفَّتْ  بِالمَكَارِهِ ، فَرَجَعَ إِلَيْهِ ، فَقَالَ:  وَعِزَّتِكَ لَقَدْ خِفْتُ أَنْ لَا يَدْخُلَهَا أَحَدٌ قَالَ:  اذْهَبْ إِلى النَّارِ فَانْظُرْ إِليْها ، وإلى مَا أَعْدَدْتُ لأَهْلِها فِيْهَا . فإذا هِي يَرْكَبُ بَعْضُهَا بَعْضًا ، فَرَجَعَ إِلَيْهِ ، فَقَالَ:  وَ عِزَّتِكَ لَا يَسْمَعُ بِهَا أحَدٌ فَيَدْخُلَهَا . فَأَمَر بِها فَحُفَّتْ بِالشَّهَوَاتِ ، فَقَالَ:  ارْجِعْ إِلَيْهَا ، فَرَجَعَ إلَيْهَا ، فَقَالَ:  وَ عِزَّتِكَ لَقَدْ خَشِيتُ أنْ لَا يَنْجُوَ   مِنْهَا أَحَدٌ إِلَّا دَخَلَهَا \n     \n رواه الترمذي و قال حديث حسن صحيح و كذلك أبو داود والنسائي","english":{"narrator":"On the authority of Abu Hurayrah (may Allah be pleased with him), who said that the Messenger of Allah (ﷺ) said:","text":"When Allah created Paradise and Hell-fire, He sent Gabriel to Paradise, saying: Look at it and at what I have prepared therein for its inhabitants. The Prophet (pbuh) said: So he came to it and looked at it and at what Allah had prepared therein for its inhabitants. The Prophet (pbuh) said: So he returned to Him and said: By your glory, no one hears of it without entering it. So He ordered that it be encompassed by forms of hardship, and He said: Return to it and look at what I have prepared therein for its inhabitants. The Prophet (pbuh) said: So he returned to it and found that it was encompassed by forms of hardship (1). Then he returned to Him and said: By Your glory, I fear that no one will enter it. He said: Go to Hell-fire and look at it and what I have prepared therein for its inhabitants, and he found that it was in layers, one above the other. Then he returned to Him and said: By Your glory, no one who hears of it will enter it. So He ordered that it be encompassed by lusts. Then He said: Return to it. And he returned to it and said: By Your glory, I am frightened that no one will escape from entering it.\n(1) The Arabic word used here is \"makarih\", the literal meaning of which is \"things that are disliked\". In this context it refers to forms of religious discipline that man usually finds onerous.\n\nIt was related by Tirmidhi, who said that it was a good and sound Hadith (also by Abu Dawud and an-Nasa'i)."}},{"id":41024,"idInBook":39,"chapterId":0,"bookId":11,"arabic":"عَنْ أَبي سَعيدٍ الْخُدْريّ رَضِيَ اللهُ عَنْهُ عَن النَّبِيّ صَلَّى الله عَلَيْهِ وَ سَلَّمَ قَالَ : احْتَجَّتِ الجَنَّةُ والنَّارُ فَقَالتِ النَّارُ : فِيَّ الجَبَّارونَ والمُتكَبَّرونَ  وَقَالتِ الجَنَّةُ : فِيّ ضُعَفاءُ النَّاسِ ومساكينُهُمْ  فَقَضَى اللهُ بَيْنَهُما : إِنَّكِ الجَنَّةُ رَحْمَتِي أَرْحَمُ بِكِ مَنْ أَشاءُ، وإنكِ النارُ عذابي ، أُعَذِبُ بِكِ من أشاءُ ،  وَلِكلَيْكُما عَلَيَّ مِلْؤُها\n(رواه مسلم  (وكذلك البخاري والترمذي","english":{"narrator":"On the authority of Abu Sa'id al-Khudri (may Allah be pleased with him), who said that the Messenger of Allah (ﷺ) said:","text":"Paradise and Hell-fire disputed together, and Hell-fire said: In me are the mighty and the haughty. Paradise said: In me are the weak and the poor. So Allah judged between them, : You are Paradise, My mercy; through you I show mercy to those I wish. And you are Hell-fire, My punishment; through you I punish those I wish, and it is incumbent upon Me that each of you shall have its fill.\n\nIt was related by Muslim (also by al-Bukhari and at-Tirmidhi)."}},{"id":41025,"idInBook":40,"chapterId":0,"bookId":11,"arabic":"عَنْ أبي سَعِيدٍ الخُدّريّ رَضِيَ اللهُ عَنْهُ قَالَ: قَالَ النَّبِىُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ\n إنَّ اللهَ يَقُولُ لأَهْلِ الجَنَّةِ : يَا أهْلَ الجَنَّةِ . فَيَقُولُون : لَبَّيْكَ رَبَّنا وسَعْدَيْكَ ، والخَيْرُ في يَدَيْكَ. فَيَقُولُ : هَلْ رَضِيتُم ؟  فَيَقُولُونَ : وَما لَنا لَا نَرْضَىى يَا رَبّ ،  وَقَدْ أَعْطَيْتَنا مَا لمْ تُعْطِ أَحَداً مِنْ خَلْقِكَ .  فَيَقُولُ : أَلا أُعْطِيكُمْ أَفْضَلَ مِنْ ذَلِك ؟  فَيَقُولُونَ :  يَا رَبّ وأيُّ شيءٍ أَفْضَلُ مِنْ ذَلِك ؟ فَيَقُولُ : أٌحِلُّ عَلَيْكُمْ رِضْواني ، فَلا أَسْخَطُ عَلَيْكُمْ بَعْدَهُ أَبداً \nرواه البخاري (وكذلك مسلم والترمذي)","english":{"narrator":"On the authority of Abu Sa'id al-Khudri (may Allah be pleased with him), who said that the Messenger of Allah (ﷺ) said:","text":"Allah will say to the inhabitants of Paradise: O inhabitants of Paradise! They will say: O our Lord, we present ourselves and are at Your pleasure, and goodness rests in Your hands. Then He will say: Are you contented? And they will say: And how should we not be contented, O Lord, when You have given to us that which You have given to no one else of Your creation? Then He will say: Would you not like Me to give you something better than that? And they will say: O Lord and what thing is better than that? And He will say: I shall cause My favour to descend upon you and thereafter shall never be displeased with you.\n\nIt was related by al-Bukhari (also by Muslim and at-Tirmidhi)."}}]}