{"metadata":{"length":188,"arabic":{"title":"مشكاة المصابيح","author":"الإمام الكاتب التبريزي","introduction":"كتاب الإيمان"},"english":{"title":"Mishkat al-Masabih","author":"Al-Khatib Al-Tabrizi","introduction":"Faith"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":1,"bookId":14,"arabic":"عَنْ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ قَالَ: بَيْنَا نَحْنُ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ يَوْمٍ إِذْ طَلَعَ عَلَيْنَا رَجُلٌ شَدِيدُ بَيَاضِ الثِّيَابِ شَدِيدُ سَوَادِ الشَّعْرِ لَا يُرَى عَلَيْهِ أَثَرُ السَّفَرِ وَلَا يَعْرِفُهُ مِنَّا أَحَدٌ حَتَّى جَلَسَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسلم فأسند رُكْبَتَيْهِ إِلَى رُكْبَتَيْهِ وَوَضَعَ كَفَّيْهِ عَلَى فَخْذَيْهِ وَقَالَ: يَا مُحَمَّدُ أَخْبِرْنِي عَنِ الْإِسْلَامِ قَالَ: \n\" الْإِسْلَامُ: أَنْ تَشْهَدَ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ وَتُقِيمَ الصَّلَاةَ وَتُؤْتِيَ الزَّكَاةَ وَتَصُومَ رَمَضَانَ وَتَحُجَّ الْبَيْتَ إِنِ اسْتَطَعْتَ إِلَيْهِ سَبِيلًا \". قَالَ: صَدَقْتَ. فَعَجِبْنَا لَهُ يَسْأَلُهُ وَيُصَدِّقُهُ. قَالَ: فَأَخْبِرْنِي عَنِ الْإِيمَانِ. قَالَ: «أَنْ تُؤْمِنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ وَالْيَوْمِ الْآخِرِ وَتُؤْمِنَ بِالْقَدَرِ خَيْرِهِ وَشَرِّهِ» . قَالَ صَدَقْتَ. قَالَ: فَأَخْبِرْنِي عَنِ الْإِحْسَانِ. قَالَ: «أَنْ تَعْبُدَ اللَّهَ كَأَنَّكَ تَرَاهُ فَإِنْ لَمْ تَكُنْ تَرَاهُ فَإِنَّهُ يَرَاكَ» . قَالَ: فَأَخْبِرْنِي عَنِ السَّاعَةِ. قَالَ: «مَا المسؤول عَنْهَا بِأَعْلَمَ مِنَ السَّائِلِ» . قَالَ: فَأَخْبِرْنِي عَنْ أَمَارَاتِهَا. قَالَ: «أَنْ تَلِدَ الْأَمَةُ رَبَّتَهَا وَأَنْ تَرَى الْحُفَاةَ الْعُرَاةَ الْعَالَةَ رِعَاءَ الشَّاءِ يَتَطَاوَلُونَ فِي الْبُنْيَانِ» . قَالَ: ثُمَّ انْطَلَقَ فَلَبِثْتُ مَلِيًّا ثُمَّ قَالَ لِي: «يَا عُمَرُ أَتَدْرِي مَنِ السَّائِلُ» ؟ قُلْتُ: اللَّهُ وَرَسُولُهُ أَعْلَمُ. قَالَ: «فَإِنَّهُ جِبْرِيل أَتَاكُم يعلمكم دينكُمْ» . رَوَاهُ مُسلم","english":{"narrator":"‘Umar b. al-Khattab said:","text":"One day when we were with God's messenger, a man with very white clothing and very black hair came up to us. No mark of travel was visible on him, and none of us recognised him. Sitting down beside the Prophet, leaning his knees against his, and placing his hands on his thighs, he said, “Tell me, Muhammad, about Islam.\" He replied, “Islam means that you should testify that there is no god but God and that Muhammad is God’s messenger, that you should observe the prayer, pay the zakat, fast during Ramadan, and make the pilgrimage to the House if you have the means to go.\" He said, “You have spoken the truth.\" We were surprised at his questioning him and then declaring that he spoke the truth. He said, “Now tell me about faith.” He replied, “It means that you should believe in God, His angels, His books, His apostles, and the last day, and that you should believe in the decreeing both of good and evil.\" Remarking that he had spoken the truth, he then said, “Now tell me about doing good.\" He replied, “It means that you should worship God as though you saw Him, for He sees you though you do not see Him.\" He said, “Now tell me about the Hour.\" He replied, “The one who is asked about it is no better informed than the one who is asking.\" He said, “Then tell me about its signs.\" He replied, “That a maid-servant should beget her mistress, and that you should see barefooted, naked, poor men and shepherds exalting themselves in buildings.\"  said to me, “Do you know who the questioner was, ‘Umar?\" I replied, “God and His messenger know best.\" He said, “He was Gabriel who came to you to teach you your religion.\"\n\nMuslim transmitted it."}},{"id":2,"idInBook":2,"chapterId":1,"bookId":14,"arabic":"وَرَوَاهُ أَبُو هُرَيْرَة مَعَ اخْتِلَافٍ وَفِيهِ: \" وَإِذَا رَأَيْتَ الْحُفَاةَ الْعُرَاةَ الصُّمَّ الْبُكْمَ مُلُوكَ الْأَرْضِ فِي خَمْسٍ لَا يَعْلَمُهُنَّ إِلَّا اللَّهُ. ثُمَّ قَرَأَ: (إِنَّ اللَّهَ عِنْدَهُ عِلْمُ السَّاعَةِ وَيُنَزِّلُ الْغَيْثَ)\nالْآيَة","english":{"narrator":"Abu Huraira transmitted it with a difference containing the following:","text":"When you see the barefooted, the naked, the deaf, the dumb as kings of the earth, as -well as five things which no one but God knows. Then he recited, ‘‘God has knowledge of the Hour, and He sends down the rain…” \n\n(Bukhari and Muslim.)"}},{"id":3,"idInBook":3,"chapterId":1,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" بُنِيَ الْإِسْلَامُ عَلَى خَمْسٍ: شَهَادَةِ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ وَإِقَامِ الصَّلَاةِ وَإِيتَاءِ الزَّكَاةِ وَالْحَجِّ وَصَوْمِ رَمَضَانَ \"","english":{"narrator":"Ibn ‘Umar reported God's messenger as saying, “Islam is based on five things:","text":"the testimony that there is no god but God and that Muhammad is His servant and messenger, the observance of the prayer, the payment of zakat, the Pilgrimage, and the fast during Ramadan.”\n\n(Bukhari and Muslim.)"}},{"id":4,"idInBook":4,"chapterId":1,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ \n\" الْإِيمَانُ بضع وَسَبْعُونَ شُعْبَة فأفضلها: قَول لَا إِلَهَ إِلَّا اللَّهُ وَأَدْنَاهَا: إِمَاطَةُ الْأَذَى عَن الطَّرِيق والحياة شُعْبَة من الايمان \"","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “Faith has over seventy branches, the most excellent of which is the declaration that there is no god but God, and the humblest of which is the removal of what is injurious from the road. And modesty is a branch of faith.”\n\n(Bukhari and Muslim.)"}},{"id":5,"idInBook":5,"chapterId":1,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ «الْمُسْلِمُ مَنْ سَلِمَ الْمُسْلِمُونَ مِنْ لِسَانِهِ وَيَدِهِ وَالْمُهَاجِرُ مَنْ هَجَرَ مَا نَهَى اللَّهُ عَنْهُ» هَذَا لَفْظُ الْبُخَارِيِّ وَلِمُسْلِمٍ قَالَ: \n\" إِنَّ رَجُلًا سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أَيُّ الْمُسْلِمِينَ خَيْرٌ؟ قَالَ: مَنْ سَلِمَ الْمُسْلِمُونَ من لِسَانه وَيَده \"","english":{"narrator":"‘Abdallah b. ‘Amr reported God's messenger as saying, “The Muslim is he from whose tongue and hand the Muslims are safe, and the Emigrant is he who abandons what God has prohibited.” \n\nThis is Bukhari’s wording. \nMuslim has:","text":"A man asked the Prophet, “Which of the Muslims is best?” He replied, “He from whose tongue and hand the Muslims are safe.”."}},{"id":6,"idInBook":6,"chapterId":1,"bookId":14,"arabic":"وَعَنْ أَنَسٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يُؤْمِنُ أَحَدُكُمْ حَتَّى أَكُونَ أَحَبَّ إِلَيْهِ مِنْ وَالِدِهِ وَوَلَدِهِ وَالنَّاسِ أَجْمَعِينَ»","english":{"narrator":"","text":"Anas reported God’s messenger as saying, “None of you believes till I am dearer to him than his father, his child, and all mankind.” \n\n(Bukhari and Muslim)."}},{"id":7,"idInBook":7,"chapterId":1,"bookId":14,"arabic":"وَعَنْ أَنَسٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ \n\" ثَلَاثٌ مَنْ كُنَّ فِيهِ وَجَدَ بِهِنَّ حَلَاوَةَ الْإِيمَانِ: مَنْ كَانَ اللَّهُ وَرَسُولُهُ أَحَبَّ إِلَيْهِ مِمَّا سِوَاهُمَا وَمَنْ أَحَبَّ عَبْدًا لَا يُحِبُّهُ إِلَّا لِلَّهِ وَمَنْ يَكْرَهُ أَنْ يَعُودَ فِي الْكُفْرِ بَعْدَ أَنْ أَنْقَذَهُ اللَّهُ مِنْهُ كَمَا يكره أَن يلقى فِي النَّار \"","english":{"narrator":"He also reported God’s messenger as saying, “There are three qualities for which anyone who is characterised by them will experience the sweetness of faith:","text":"he to whom God and His messenger are dearer than all else; he who loves a human being for God’s sake alone; and he who has as great an abhorrence of returning to unbelief after God has rescued him from it as he has of being cast into hell.” \n\n(Bukhari and Muslim.)"}},{"id":8,"idInBook":8,"chapterId":1,"bookId":14,"arabic":"وَعَن الْعَبَّاس بن عبد الْمطلب قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «ذَاقَ طَعْمَ الْإِيمَانِ مَنْ رَضِيَ بِاللَّهِ رَبًّا وَبِالْإِسْلَامِ دِينًا وَبِمُحَمَّدٍ رَسُولًا» . رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"Al-‘Abbas b. ‘Abd al-Muttalib reported God’s messenger as saying, “He who is well-pleased with God as Lord, with Islam as religion, and with Muhammad as messenger will experience the savour of faith,” \n\nMuslim transmitted it."}},{"id":9,"idInBook":9,"chapterId":1,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَا يسمع بِي أحدق مِنْ هَذِهِ الْأُمَّةِ يَهُودِيٌّ وَلَا نَصْرَانِيٌّ ثُمَّ يَمُوتُ وَلَمْ يُؤْمِنْ بِالَّذِي أُرْسِلْتُ بِهِ إِلَّا كَانَ من أَصْحَاب النَّار» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, \"By Him in whose hand Muhammad’s soul is, anyone of this people, Jew or Christian, who hears of me and then dies without believing in my message, will be among those who go to hell.” \n\nMuslim transmitted it."}},{"id":10,"idInBook":10,"chapterId":1,"bookId":14,"arabic":"وَعَنْ أَبِي مُوسَى الْأَشْعَرِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" ثَلَاثَةٌ لَهُمْ أَجْرَانِ: رَجُلٌ مِنْ أَهْلِ الْكِتَابِ آمَنَ بِنَبِيِّهِ وَآمَنَ بِمُحَمَّدٍ وَالْعَبْدُ الْمَمْلُوكُ إِذَا أَدَّى حَقَّ اللَّهِ وَحَقَّ مَوَالِيهِ وَرَجُلٌ كَانَتْ عِنْدَهُ أَمَةٌ يَطَؤُهَا فَأَدَّبَهَا فَأَحْسَنَ تَأْدِيبَهَا وَعَلَّمَهَا فَأَحْسَنَ تَعْلِيمِهَا ثُمَّ أَعْتَقَهَا فَتَزَوَّجَهَا فَلَهُ أَجْرَانِ \"","english":{"narrator":"Abu Musa al-Ash‘ari reported God’s messenger as saying, \"Three types will have a double reward:","text":"one of the people of the Book who believes in his prophet and believes in Muhammad; a slave when he fulfils what is due to God and what is due to his patrons; and a man who has a slavegirl with whom he has intercourse, who gives her a good training in manners and a good education, then sets her free and marries her—he will have a double reward.” \n\n(Bukhari and Muslim.)"}},{"id":11,"idInBook":11,"chapterId":1,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَشْهَدُوا أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ وَيُقِيمُوا الصَّلَاةَ وَيُؤْتُوا الزَّكَاةَ فَإِذَا فَعَلُوا ذَلِكَ عَصَمُوا مِنِّي دِمَاءَهُمْ وَأَمْوَالَهُمْ إِلَّا بِحَق الْإِسْلَام وحسابهم على الله. إِلَّا أَنَّ مُسْلِمًا لَمْ يَذْكُرْ» إِلَّا بِحَقِّ الْإِسْلَام \"","english":{"narrator":"","text":"Ibn ‘Umar reported God’s messenger as saying, \"I am commanded to fight with men till they testify that there is no god but God and that Muhammad is God's messenger, observe the prayer and pay the zakat. When they do that they will keep their lives and their property safe from me, except for what is due to Islam; and their reckoning will be at God’s hands.” \n\n(Bukhari and Muslim, but Muslim did not mention, \"except for what is due to Islam”.)"}},{"id":12,"idInBook":12,"chapterId":1,"bookId":14,"arabic":"وَعَن أنس أَنَّهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ صَلَّى صَلَاتَنَا وَاسْتَقْبَلَ قِبْلَتَنَا وَأَكَلَ ذَبِيحَتَنَا فَذَلِكَ الْمُسْلِمُ الَّذِي لَهُ ذِمَّةُ اللَّهِ وَذِمَّةُ رَسُولِهِ فَلَا تُخْفِرُوا اللَّهَ فِي ذمَّته» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Anas reported God’s messenger as saying, \"If anyone observes our form of prayer, faces our qibla, and eats what we kill, that one is a Muslim who has protection from God and His messenger; so do not betray God’s protection.” \n\nBukhari transmitted it."}},{"id":13,"idInBook":13,"chapterId":1,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: أَتَى أَعْرَابِيٌّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: دُلَّنِي عَلَى عَمَلٍ إِذَا عَمِلْتُهُ دَخَلْتُ الْجَنَّةَ. قَالَ: «تَعْبُدُ اللَّهَ وَلَا تُشْرِكُ بِهِ شَيْئًا وَتُقِيمُ الصَّلَاةَ الْمَكْتُوبَةَ وَتُؤَدِّي الزَّكَاةَ الْمَفْرُوضَةَ وَتَصُومُ رَمَضَانَ» . قَالَ: وَالَّذِي نَفْسِي بِيَدِهِ لَا أَزِيدُ عَلَى هَذَا شَيْئًا وَلَا أَنْقُصُ مِنْهُ. فَلَمَّا وَلَّى قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ سَرَّهُ أَنْ يَنْظُرَ إِلَى رَجُلٍ مِنْ أَهْلِ الْجنَّة فَلْينْظر إِلَى هَذَا»","english":{"narrator":"","text":"Abu Huraira reported that an Arab came to the Prophet and said, \"Guide me to a deed by doing which I shall enter paradise.” He said, “Worship God and associate nothing with Him, observe the prescribed prayer, pay the obligatory zakat, and fast during Ramadan.” He replied, \"By Him in whose hand my soul is, I shall not add anything to this, or fall short of it.” Then when he turned away the Prophet said, \"If anyone wishes to look at a man who will be among the people of paradise, let him look at this man.” \n\n(Bukhari and Muslim.)"}},{"id":14,"idInBook":14,"chapterId":1,"bookId":14,"arabic":"وَعَن سُفْيَان بن عبد الله الثَّقَفِيّ قَالَ: قُلْتُ: يَا رَسُولَ اللَّهِ قُلْ لِي فِي الْإِسْلَامِ قَوْلًا لَا أَسْأَلُ عَنْهُ أَحَدًا بَعْدَكَ وَفِي رِوَايَةٍ: غَيْرَكَ قَالَ: \" قُلْ: آمَنْتُ بِاللَّه ثمَّ اسْتَقِم. رَوَاهُ مُسلم","english":{"narrator":"","text":"Sufyan b. ‘Abdallah ath-Thaqafi reported that he said, \"Messenger of God, say something about Islam concerning which I shall need to ask no one after you are gone.” (A version has \"anyone else”.) He said, \"Say, ‘I believe in God’, then keep to the straight path.” \n\nMuslim transmitted it."}},{"id":15,"idInBook":15,"chapterId":1,"bookId":14,"arabic":"وَعَنْ طَلْحَةَ بْنِ عُبَيْدِ اللَّهِ قَالَ: جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ أَهْلِ نَجْدٍ ثَائِرُ الرَّأْسِ نَسْمَعُ دَوِيَّ صَوْتِهِ وَلَا نَفَقَهُ مَا يَقُولُ حَتَّى دَنَا مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَإِذَا هُوَ يَسْأَلُ عَنِ الْإِسْلَامِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «خَمْسُ صَلَوَاتٍ فِي الْيَوْمِ وَاللَّيْلَةِ» . فَقَالَ: هَلْ عَلَيَّ غَيْرُهُنَّ؟ فَقَالَ: \" لَا إِلَّا أَنْ تَطَّوَّعَ. قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: وَصِيَامُ شَهْرِ رَمَضَانَ \". قَالَ: هَلْ عَلَيَّ غَيْرُهُ؟ قَالَ: «لَا إِلَّا أَنْ تَطَّوَّعَ» . قَالَ: وَذَكَرَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الزَّكَاةَ فَقَالَ: هَلْ عَلَيَّ غَيْرُهَا؟ فَقَالَ: \" لَا إِلَّا أَنْ تَطَّوَّعَ. قَالَ: فَأَدْبَرَ الرَّجُلُ وَهُوَ يَقُولُ: وَاللَّهِ لَا أَزِيدُ عَلَى هَذَا وَلَا أَنْقُصُ مِنْهُ. فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَفْلح الرجل إِن صدق»","english":{"narrator":"Talha b. ‘Ubaidallah said:","text":"A man of the people of Najd with dishevelled hair came to God’s messenger. We could hear the sound of his voice, but could not understand what he was saying till he came near God’s messenger and we realised that he was asking about Islam. God’s messenger said, “Five times of prayer each day and night.” He asked, “Must I observe any more than them?” He replied, “No, unless you do it voluntarily.” God's messenger said, “And fasting during the month of Ramadan.” He asked, “Must I observe anything else?” He replied, “No, unless you do it voluntarily.” Talha said that God's messenger mentioned the zakat to him, and he asked, “Must I pay anything else?” He replied, “No, unless you do it voluntarily.” He said that the man turned away saying, “I swear by God that I shall not add anything to this or fall short of it.” So God’s messenger said, “The man will prosper if he is speaking the truth.” \n\n(Bukhari and Muslim.)"}},{"id":16,"idInBook":16,"chapterId":1,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: إِنَّ وَفْدَ عَبْدِ الْقَيْسِ لَمَّا أَتَوُا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" مَنِ الْقَوْمُ؟ أَوْ: مَنِ الْوَفْدُ؟ \" قَالُوا: رَبِيعَةُ. قَالَ: \" مَرْحَبًا بِالْقَوْمِ أَوْ: بِالْوَفْدِ غَيْرَ خَزَايَا وَلَا نَدَامَى \". قَالُوا: يَا رَسُول الله إِنَّا لَا نستطيع أَن نَأْتِيَكَ إِلَّا فِي الشَّهْرِ الْحَرَامِ وَبَيْنَنَا وَبَيْنَكَ هَذَا الْحَيُّ مِنْ كُفَّارِ مُضَرَ فَمُرْنَا بِأَمْرٍ فصل نخبر بِهِ مَنْ وَرَاءَنَا وَنَدْخُلُ بِهِ الْجَنَّةَ وَسَأَلُوهُ عَنِ الْأَشْرِبَةِ. فَأَمَرَهُمْ بِأَرْبَعٍ وَنَهَاهُمْ عَنْ أَرْبَعٍ: أَمَرَهُمْ بِالْإِيمَانِ بِاللَّهِ وَحْدَهُ قَالَ: «أَتَدْرُونَ مَا الْإِيمَانُ بِاللَّهِ وَحْدَهُ؟» قَالُوا: اللَّهُ وَرَسُولُهُ أَعْلَمُ. قَالَ: «شَهَادَةِ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ وَإِقَامِ الصَّلَاةِ وَإِيتَاءِ الزَّكَاةِ وَصِيَامِ رَمَضَانَ وَأَنْ تُعْطُوا مِنَ الْمَغْنَمِ الْخُمُسَ»\nوَنَهَاهُمْ عَنْ أَرْبَعٍ: عَنِ الْحَنْتَمِ وَالدُّبَّاءِ وَالنَّقِيرِ وَالْمُزَفَّتِ وَقَالَ: «احْفَظُوهُنَّ وَأَخْبِرُوا بِهِنَّ مَنْ وَرَاءَكُمْ» وَلَفظه للْبُخَارِيّ","english":{"narrator":"Ibn ‘Abbas said that when the deputation of ‘Abd Qais came to the Prophet, God's messenger asked, “Who are the people?” or, “Who are the deputation?” They replied, “Rabi‘a”, and he said, “Welcome to the people (or deputation), neither ashamed nor regretful.” They said, “Messenger of God, we are able to come to you only in the sacred month, for this tribe of the infidels of Mudar is between us and you; so give us a decisive command which we may tell to those at home and by  which we may enter paradise;” and they asked him about drinks. He commanded them to observe four things and he forbade them four things. He commanded them to put their faith in God alone saying, “Do you know what faith in God alone is?” They replied, “God and His messenger know best.” He said, “It includes the testimony that there is no god but God and that Muhammad is God’s messenger, the observance of the prayer, the payment of zakat, the fast of Ramadan, and your giving a fifth of the booty.” And he forbade them four things:","text":"glazed jars, gourds, hollowed stumps of palm trees, and receptacles smeared with pitch, saying, “Observe them and tell your people at home about them.” \n\n(Bukhari and Muslim, but the wording is Bukhari’s)."}},{"id":17,"idInBook":17,"chapterId":1,"bookId":14,"arabic":"وَعَنْ عُبَادَةَ بْنِ الصَّامِتِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَحَوْلَهُ عِصَابَةٌ مِنْ أَصْحَابِهِ: \n\" بَايَعُونِي عَلَى أَنْ لَا تُشْرِكُوا بِاللَّهِ شَيْئًا وَلَا تَسْرِقُوا وَلَا تَزْنُوا وَلَا تَقْتُلُوا أَوْلَادَكُمْ وَلَا تَأْتُوا بِبُهْتَانٍ تَفْتَرُونَهُ بَيْنَ أَيْدِيكُمْ وَأَرْجُلِكُمْ وَلَا تَعْصُوا فِي مَعْرُوفٍ فَمَنْ وَفَى مِنْكُمْ فَأَجْرُهُ عَلَى اللَّهِ وَمَنْ أَصَابَ مِنْ ذَلِكَ شَيْئًا فَعُوقِبَ بِهِ فِي الدُّنْيَا فَهُوَ كَفَّارَةٌ لَهُ وَمَنْ أَصَابَ مِنْ ذَلِكَ شَيْئًا ثُمَّ سَتَرَهُ اللَّهُ عَلَيْهِ فِي الدُّنْيَا فَهُوَ إِلَى اللَّهِ: إِنْ شَاءَ عَفَا عَنْهُ وَإِنْ شَاءَ عَاقَبَهُ \" فَبَايَعْنَاهُ عَلَى ذَلِك","english":{"narrator":"","text":"‘Ubada b. as-Samit reported that God's messenger said when a number of his Companions were around him, “Swear allegiance to me on the basis that you will not associate anything with God, or steal, or commit fornication, or kill your children, or produce slander which you yourselves have falsely fabricated, or be disobedient concerning what is good. If any of you fulfils his promise, God will undertake his reward but if anyone perpetrates any of these things and is punished for it in this world, it will be an atonement for him. If, however, anyone perpetrates any of those things and God conceals it regarding him, the matter lies in God’s hands; if He wishes He will forgive him, and if He wishes He will punish him.” So we swore allegiance to him on that basis. \n\n(Bukhari and Muslim.)"}},{"id":18,"idInBook":18,"chapterId":1,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي أَضْحًى أَوْ فِطْرٍ إِلَى الْمُصَلَّى فَمَرَّ عَلَى النِّسَاءِ فَقَالَ يَا مَعْشَرَ النِّسَاءِ تَصَدَّقْنَ فَإِنِي أُرِيتُكُنَّ أَكْثَرَ أَهْلِ النَّارِ فَقُلْنَ وَبِمَ يَا رَسُولَ اللَّهِ قَالَ تُكْثِرْنَ اللَّعْنَ وَتَكْفُرْنَ الْعَشِيرَ مَا رَأَيْتُ مِنْ نَاقِصَاتِ عَقْلٍ وَدِينٍ أَذْهَبَ لِلُبِّ الرجل الحازم من إحداكن قُلْنَ وَمَا نُقْصَانُ دِينِنَا وَعَقْلِنَا يَا رَسُولَ اللَّهِ قَالَ أَلَيْسَ شَهَادَةُ الْمَرْأَةِ مِثْلَ نِصْفِ شَهَادَةِ الرَّجُلِ قُلْنَ بَلَى قَالَ فَذَلِكَ مِنْ نُقْصَان عقلهَا أَلَيْسَ إِذَا حَاضَتْ لَمْ تَصِلِّ وَلَمْ تَصُمْ قُلْنَ بَلَى قَالَ فَذَلِكَ مِنْ نُقْصَانِ دِينِهَا","english":{"narrator":"","text":"Abu Sa'id al-Khudri said that when God’s messenger went out to the place of prayer on the day of sacrifice, or on the day when the fast was broken, he came upon some women and said, \"Give alms, you women folk, for I have been shown that you will be the majority of the inhabitants of hell.” They asked, “For what reason, messenger of God?” He replied, “You are greatly given to abuse, and you are ungrateful to your husbands. Among women who are deficient in intelligence and religion I have not seen anyone more able to remove the understanding of a prudent man than one of you.” They asked, “What is the deficiency of our religion and our intelligence, messenger of God?” He replied, “Is not the testimony of a woman equivalent to half the testimony of a man?” They said, “Yes.” Remarking that that pertained to the deficiency of her intelligence, he asked, “Is it not the case that when she menstruates she neither prays nor fasts?” When they replied, “Yes,” he said, “That pertains to the deficiency of her religion.” \n\n(Bukhari and Muslim.)"}},{"id":19,"idInBook":19,"chapterId":1,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: \" قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اللَّهُ كَذبَنِي ابْن آدم وَلم يكن لَهُ ذَلِك وَشَتَمَنِي وَلم يكن لَهُ ذَلِك أما تَكْذِيبه إيَّايَ أَن يَقُول إِنِّي لن أُعِيدهُ كَمَا بَدأته وَأما شَتمه إيَّايَ أَن يَقُول اتخذ الله ولدا وَأَنا الصَّمَدُ الَّذِي لَمْ أَلِدْ وَلَمْ أُولَدْ وَلَمْ يكن لي كُفؤًا أحد (لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُنْ لَهُ كُفؤًا أحد)\nوَفِي رِوَايَة عَن ابْنِ عَبَّاسٍ: \" وَأَمَّا شَتْمُهُ إِيَّايَ فَقَوْلُهُ: لِي وَلَدٌ وَسُبْحَانِي أَنْ أَتَّخِذَ صَاحِبَةً أَوْ وَلَدًا \"","english":{"narrator":"Abu Huraira reported that God’s messenger declared that God said, “The son of Adam has accused me of falsehood, which he had no right to do; and he has reviled me, which he had no right to do. His accusation of falsehood is in his saying, ‘He will not bring me back to life as He created me’, whereas the original act of creation is no easier for me than to bring him back to life. His reviling of me is in his saying, ‘God has taken a son’, whereas I am the One, to whom men repair, who has not begotten and has not been begotten, and to whom no one is equal.” A version from Ibn ‘Abbas has:","text":"“His reviling of me is his statement that I have a son. Far be it from me that I should have a consort or a son.” \n\nBukhari transmitted it."}},{"id":20,"idInBook":20,"chapterId":1,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عَلَيْهِ وَسلم: \n\" قَالَ اللَّهُ تَعَالَى: يُؤْذِينِي ابْنُ آدَمَ يَسُبُّ الدَّهْرَ وَأَنَا الدَّهْرُ بِيَدِيَ الْأَمْرُ أُقَلِّبُ اللَّيْلَ وَالنَّهَارَ \"","english":{"narrator":"","text":"Abu Huraira reported that God’s messenger declared that God said, “The son of Adam injures me by abusing time, whereas I am time. Authority is in my hand. I vary night and day.” \n\n(Bukhari and Muslim.)"}},{"id":21,"idInBook":21,"chapterId":1,"bookId":14,"arabic":"وَعَنْ أَبِي مُوسَى الْأَشْعَرِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا أَحَدٌ أَصْبَرُ عَلَى أَذًى يَسْمَعُهُ مِنَ اللَّهِ يَدْعُونَ لَهُ الْوَلَدَ ثُمَّ يُعَافِيهِمْ وَيَرْزُقُهُمْ»","english":{"narrator":"","text":"Abu Musa reported God's messenger as saying, “No one is more patient over injury which he hears than God. Men attribute a son to Him, yet He preserves them and provides for them.” \n\n(Bukhari and Muslim.)"}},{"id":22,"idInBook":22,"chapterId":1,"bookId":14,"arabic":"وَعَن معَاذ رَضِي الله عَنهُ قَالَ كُنْتُ رِدْفَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسلم على حمَار يُقَال لَهُ عفير فَقَالَ يَا معَاذ هَل تَدْرِي حَقُّ اللَّهِ عَلَى عِبَادِهِ وَمَا حَقُّ الْعِبَادِ عَلَى اللَّهِ؟ قُلْتُ اللَّهُ وَرَسُولُهُ أَعْلَمُ قَالَ فَإِنَّ حَقَّ اللَّهِ عَلَى الْعِبَادِ أَنْ يَعْبُدُوهُ وَلَا يُشْرِكُوا بِهِ شَيْئًا وَحَقُّ الْعِبَادِ عَلَى اللَّهِ أَنْ لَا يُعَذِّبَ مَنْ لَا يُشْرِكُ بِهِ شَيْئًا فَقُلْتُ يَا رَسُولَ اللَّهِ أَفَلَا أُبَشِّرُ بِهِ النَّاسَ قَالَ لَا تُبَشِّرُهُمْ فَيَتَّكِلُوا","english":{"narrator":"Mu'adh said:","text":"I was riding behind the Prophet on an ass with nothing between him and me but the rear part of the saddle, when he said, “Do you know, Mu'adh, what God has a right to expect from His servants, and what His servants have a right to expect from God?” I replied, “God and His messenger know best.” He said, “What God has a right to expect from His servants is that they should worship Him, not associating anything with him; and what the servants have a right to expect from God is that He should not punish one who does not associate anything with Him.” I said, “Messenger of God, shall I not give this good news to the people?” He replied, “Do not tell them, and have them trusting in it alone.” \n\n(Bukhari and Muslim.)"}},{"id":23,"idInBook":23,"chapterId":1,"bookId":14,"arabic":"وَعَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمُعَاذٌ رديفه على الرحل قَالَ: «يَا معَاذ بن جبل قَالَ لَبَّيْكَ يَا رَسُولَ اللَّهِ وَسَعْدَيْكَ قَالَ يَا مُعَاذُ قَالَ لَبَّيْكَ يَا رَسُولَ اللَّهِ وَسَعْديك ثَلَاثًا قَالَ مَا مِنْ أَحَدٍ يَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ صِدْقًا مِنْ قَلْبِهِ إِلَّا حَرَّمَهُ اللَّهُ عَلَى النَّارِ قَالَ يَا رَسُولَ اللَّهِ أَفَلَا أُخْبِرُ بِهِ النَّاس فيستبشروا قَالَ إِذا يتكلوا وَأخْبر بِهَا مُعَاذٌ عِنْدَ مَوْتِهِ تَأَثُّمًا»","english":{"narrator":"","text":"Anas reported that, when Mu'adh was riding behind the Prophet on the saddle, he said, “Mu'adh”, to which he replied, “At your service and at your pleasure, messenger of God.” He said, “Mu'adh”, to which he replied, “At your service and at your pleasure, messenger of God.” He said, “Mu'adh”, to which he replied, “At your service and at your pleasure, messenger of God,” three times altogether. He said, “If anyone testifies sincerely from his heart that there is no god but God and that Muhammad is God’s messenger, God will declare him immune from hell.” He asked, “Messenger of God, shall I not then inform people of it, so that they may be of good cheer?” He replied, “Then they would trust in it alone.” Mu'adh told about it at the time of his death, to avoid sinning. \n\n(Bukhari and Muslim.)"}},{"id":24,"idInBook":24,"chapterId":1,"bookId":14,"arabic":"وَعَنْ أَبِي ذَرٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَيْهِ ثَوْبٌ أَبْيَضُ وَهُوَ نَائِمٌ ثُمَّ أَتَيْتُهُ وَقَدِ اسْتَيْقَظَ فَقَالَ: «مَا مِنْ عَبْدٍ قَالَ لَا إِلَهَ إِلَّا اللَّهُ ثُمَّ مَاتَ عَلَى ذَلِكَ إِلَّا دَخَلَ الْجَنَّةَ قُلْتُ وَإِنْ زَنَى وَإِنْ سَرَقَ قَالَ وَإِنْ زَنَى وَإِنْ سَرَقَ قُلْتُ وَإِنْ زَنَى وَإِنْ سَرَقَ قَالَ وَإِنْ زَنَى وَإِنْ سَرَقَ قُلْتُ وَإِنْ زَنَى وَإِنْ سَرَقَ قَالَ وَإِنْ زَنَى وَإِنْ سَرَقَ عَلَى رَغْمِ أَنْفِ أَبِي ذَرٍّ وَكَانَ أَبُو ذَرٍّ إِذَا حَدَّثَ بِهَذَا قَالَ وَإِنْ رَغِمَ أَنْفُ أَبِي ذَر»","english":{"narrator":"Abu Dharr said:","text":"I came to the Prophet and found him asleep under a white sheet. When I came back to him after he had awakened he said, “If anyone says there is no god but God and dies in that belief, he will enter paradise.” I asked, “Even if he commits fornication and even if he steals?” He replied, “Even if he commits fornication and even if he steals.” I asked, “Even if he commits fornication and even if he steals?” He replied, “Even if he commits fornication and even if he steals.” I asked, “Even if he commits fornication and even if he steals?” He replied, “Even if he commits fornication and even if he steals, in spite of Abu Dharr.” When Abu Dharr told this he said, “Even if Abu Dharr’s pride is humbled.”\n\n(Bukhari and Muslim.)"}},{"id":25,"idInBook":25,"chapterId":1,"bookId":14,"arabic":"وَعَنْ عُبَادَةَ بْنِ الصَّامِتِ رَضِيَ اللَّهُ عَنْهُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ شَهِدَ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَأَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ وَأَنَّ عِيسَى عَبْدُ اللَّهِ وَرَسُولُهُ وَابْنُ أَمَتِهِ وَكَلِمَتُهُ أَلْقَاهَا إِلَى مَرْيَمَ وَرُوحٌ مِنْهُ وَالْجَنَّةُ وَالنَّارُ حَقٌّ أَدْخَلَهُ اللَّهُ الْجَنَّةَ عَلَى مَا كَانَ من الْعَمَل»","english":{"narrator":"","text":"‘Ubada b. as-Samit reported God’s messenger as saying, “If anyone testifies that there is no god but God alone, who has no partner, that Muhammad is His servant and messenger, that Jesus is God’s servant and messenger, the son of His handmaid, His word which he cast into Mary and a spirit from Him, and that paradise and hell are real, God will cause him to enter paradise no matter what he has done.”\n\n(Bukhari and Muslim.)"}},{"id":26,"idInBook":26,"chapterId":1,"bookId":14,"arabic":"وَعَن عَمْرو بن الْعَاصِ قَالَ: «أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقلت ابْسُطْ يَمِينك فلأبايعك فَبسط يَمِينه قَالَ فَقَبَضْتُ يَدِي فَقَالَ مَا لَكَ يَا عَمْرُو قلت أردْت أَن أشْتَرط قَالَ تَشْتَرِطُ مَاذَا قُلْتُ أَنْ يُغْفَرَ لِي قَالَ أما علمت أَنَّ الْإِسْلَامَ يَهْدِمُ مَا كَانَ قَبْلَهُ وَأَنَّ الْهِجْرَةَ تَهْدِمُ مَا كَانَ قَبْلَهَا وَأَنَّ الْحَجَّ يهدم مَا كَانَ قبله» ؟\nوَالْحَدِيثَانِ الْمَرْوِيَّانِ عَنْ أَبِي هُرَيْرَةَ قَالَ: \" قَالَ اللَّهُ تَعَالَى: «أَنَا أَغْنَى الشُّرَكَاءِ عَنِ الشِّرْكِ» . والاخر: «الْكِبْرِيَاء رِدَائي» سَنَذْكُرُهُمَا فِي بَابِ الرِّيَاءِ وَالْكِبْرِ إِنْ شَاءَ الله تَعَالَى","english":{"narrator":"'Amr b. al-‘As said:","text":"I came to the Prophet and said, “Stretch out your right hand and let me swear allegiance to you.” He stretched out his right hand, but I clenched my hand and he said, “What is the matter with you, ‘Amr?” I replied, “I want to make a condition.” He asked, “What condition do you make?” I replied, “That I should receive forgiveness.” He said, “Do you not know, 'Amr, that Islam demolishes what preceded it, that the Hijra demolishes what preceded it, and the Pilgrimage demolishes what preceded it?”\n\nMuslim transmitted it. We shall mention the two traditions transmitted from Abu Huraira, (1) He declared that God said, “I am the one who is most able to dispense with partnership”; (2) “Pride is my cloak”, in the chapters on Hypocrisy and Pride1, if God most high will.\n\n1 i.e, Book XXIV, Ch. vi and Book XXIII, Ch. xx."}},{"id":27,"idInBook":27,"chapterId":1,"bookId":14,"arabic":"عَن معَاذ بن جبل قَالَ كُنْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سفر فَأَصْبَحت يَوْمًا قَرِيبا مِنْهُ وَنحن نسير فَقلت يَا رَسُولَ اللَّهِ أَخْبِرْنِي بِعَمَلٍ يُدْخِلُنِي الْجَنَّةَ وَيُبَاعِدنِي عَن النَّار قَالَ لقد سَأَلتنِي عَن عَظِيمٍ وَإِنَّهُ لِيَسِيرٌ عَلَى مَنْ يَسَّرَهُ اللَّهُ عَلَيْهِ تَعْبُدُ اللَّهَ وَلَا تُشْرِكُ بِهِ شَيْئًا وَتُقِيمَ الصَّلَاةَ وَتُؤْتِيَ الزَّكَاةَ وَتَصُومَ رَمَضَانَ وَتَحُجَّ الْبَيْت ثُمَّ قَالَ أَلَا أَدُلُّكَ عَلَى أَبْوَابِ الْخَيْرِ الصَّوْمُ جُنَّةٌ وَالصَّدَقَةُ تُطْفِئُ الْخَطِيئَةُ كَمَا يُطْفِئُ المَاء النَّار وَصَلَاة الرجل من جَوف اللَّيْل قَالَ ثمَّ تَلا (تَتَجَافَى جنُوبهم عَن الْمضَاجِع)\nحَتَّى بَلَغَ (يَعْمَلُونَ)\nثُمَّ قَالَ أَلَا أَدُلُّكَ بِرَأْس الْأَمر كُله وَعَمُودِهِ وَذِرْوَةِ سَنَامِهِ قُلْتُ بَلَى يَا رَسُولَ اللَّهِ قَالَ رَأْسُ الْأَمْرِ الْإِسْلَامُ وَعَمُودُهُ الصَّلَاةُ وَذِرْوَةُ سَنَامِهِ الْجِهَادُ ثُمَّ قَالَ أَلَا أُخْبِرُكَ بِمِلَاكِ ذَلِكَ كُلِّهِ قُلْتُ بَلَى يَا نَبِيَّ اللَّهِ فَأَخَذَ بِلِسَانِهِ فَقَالَ كُفَّ عَلَيْكَ هَذَا فَقُلْتُ يَا نَبِيَّ اللَّهِ وَإِنَّا لَمُؤَاخَذُونَ بِمَا نتكلم بِهِ فَقَالَ ثَكِلَتْكَ أُمُّكَ يَا مُعَاذُ وَهَلْ يَكُبُّ النَّاسَ فِي النَّارِ عَلَى وُجُوهِهِمْ أَوْ عَلَى مَنَاخِرِهِمْ إِلَّا حَصَائِدُ أَلْسِنَتِهِمْ. رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَابْنُ مَاجَه","english":{"narrator":"Mu‘adh b. Jabal reported:","text":"I said, “Inform me, messenger of God, of an act which will cause me to enter paradise and remove me far from hell.” He replied, “You have asked a serious question, but it is easy for the one whom God helps to answer it. Worship God, associate nothing with Him, observe the prayer, pay the zakat, fast during Ramadan, and make the Pilgrimage to the House.” He said, “Shall I not guide you to the gateways of what is good? Fasting is a protection, and almsgiving extinguishes sin as water extinguishes fire, and a man's prayer in the middle of the night .” Then he recited, “Withdrawing themselves from their couches ... they have been doing.” 1 Then he said, “Shall I not guide you to the head and support of the matter and the top of its hump?” I replied, “Yes, messenger of God.” He said, “The head of the matter is Islam, its support is prayer, and the top of its hump is jihad.” Then he said, “Shall I not inform you of the controlling of all that?” I replied, “Yes, Prophet of God.” So he took hold of his tongue and said, “Restrain this.” I asked, “Prophet of God, shall we really be punished for what we talk about?” He replied, “I am surprised at you, 2 Mu'adh! Will anything but the harvests of their tongues overthrow men in hell on their faces (or, on their nostrils)?” \n\nAhmad, Tirmidhi and Ibn Majah transmitted it.\n\n1 Quran, xxxii, 16f.\n2 Literally, may your mother be bereft of you."}},{"id":28,"idInBook":28,"chapterId":1,"bookId":14,"arabic":"وَعَنْ أَبِي أُمَامَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَحَبَّ لِلَّهِ وَأَبْغَضَ لِلَّهِ وَأَعْطَى لِلَّهِ وَمَنَعَ لِلَّهِ فَقَدِ اسْتكْمل الْإِيمَان» . رَوَاهُ أَبُو دَاوُد\nرَوَاهُ التِّرْمِذِيُّ عَنْ مُعَاذِ بْنِ أَنَسٍ مَعَ تَقْدِيمٍ وَتَأْخِير وَفِيه: «فقد اسْتكْمل إيمَانه»","english":{"narrator":"","text":"Abu Umama reported that God’s messenger said, “If anyone loves for God’s sake, hates for God’s sake, gives for God’s sake and withholds for God's sake, he will have perfected faith.” \n\nAbu Dawud transmitted it; and Tirmidhi transmitted it from Mu'adh b. Anas with a transposition of phrases, including “he will have perfected his faith.”"}},{"id":29,"idInBook":29,"chapterId":1,"bookId":14,"arabic":"وَعَنْ أَبِي ذَرٍّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَفْضَلُ الْأَعْمَالِ الْحُبُّ فِي اللَّهِ وَالْبُغْضُ فِي اللَّهِ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Abu Dharr reported God’s messenger as saying, “The most excellent action is love for God’s sake and hatred for God’s sake.” \n\nAbu Dawud transmitted it."}},{"id":30,"idInBook":30,"chapterId":1,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْمُسْلِمُ مَنْ سَلِمَ الْمُسْلِمُونَ مِنْ لِسَانِهِ وَيَدِهِ وَالْمُؤْمِنُ مَنْ أَمِنَهُ النَّاسُ عَلَى دِمَائِهِمْ وَأَمْوَالِهِمْ» . رَوَاهُ التِّرْمِذِيُّ وَالنَّسَائِيُّ\nوَزَادَ الْبَيْهَقِيُّ فِي «شُعَبِ الْإِيمَانِ» . بِرِوَايَةِ فَضَالَةَ: «وَالْمُجَاهِدُ مَنْ جَاهَدَ نَفْسَهُ فِي طَاعَةِ اللَّهِ وَالْمُهَاجِر من هجر الْخَطَايَا والذنُوب»","english":{"narrator":"","text":"Abu Huraira reported that God’s messenger said, “The Muslim is he from whose tongue and hand the Muslims are safe; and the believer is he whom men trust with their lives and their property.” \n\n'Tirmidhi and Nasa’i transmitted it; and Baihaqi added in Shu'ab al-iman by the transmission of Fadala, “And the mujahid is he who strives with himself regarding obedience to God, and the muhajir is he who abandons transgressions and sins."}},{"id":31,"idInBook":31,"chapterId":1,"bookId":14,"arabic":"وَعَنْ أَنَسٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَلَّمَا خَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّا قَالَ: «لَا إِيمَانَ لِمَنْ لَا أَمَانَةَ لَهُ وَلَا دِينَ لِمَنْ لَا عَهْدَ لَهُ» . رَوَاهُ الْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَانِ","english":{"narrator":"Anas said:","text":"God’s messenger seldom addressed us without saying, “He who is not trustworthy has no faith, and he who does not keep his covenant has no religion.\"\n\nBaihaqi transmitted it in Shu'ab al-lman."}},{"id":32,"idInBook":32,"chapterId":1,"bookId":14,"arabic":"عَنْ عُبَادَةَ بْنِ الصَّامِتِ رَضِيَ اللَّهُ عَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنْ شَهِدَ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ حَرَّمَ الله عَلَيْهِ النَّار»","english":{"narrator":"‘Ubada b. as-Samit said:","text":"I heard God's messenger say, “If anyone testifies that there is no god but God and that Muhammad is God's messenger, God will keep him from going to hell.\" \n\nMuslim transmitted it."}},{"id":33,"idInBook":33,"chapterId":1,"bookId":14,"arabic":"وَعَنْ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ مَاتَ وَهُوَ يَعْلَمُ أَنَّهُ لَا إِلَهَ إِلَّا اللَّهُ دَخَلَ الْجَنَّةَ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"‘Uthman b. ‘Affan reported God's messenger as saying, “Whoever dies knowing that there is no god but God will enter paradise.\"\n\nMuslim transmitted it."}},{"id":34,"idInBook":34,"chapterId":1,"bookId":14,"arabic":"وَعَنْ جَابِرٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" ثِنْتَانِ مُوجِبَتَانِ. قَالَ رَجُلٌ: يَا رَسُولَ اللَّهِ مَا الْمُوجِبَتَانِ؟ قَالَ: (مَنْ مَاتَ يُشْرِكُ بِاللَّهِ شَيْئًا دَخَلَ النَّارَ وَمَنْ مَاتَ لَا يُشْرِكُ بِاللَّهِ شَيْئا دخل الْجنَّة)\n(رَوَاهُ مُسلم)","english":{"narrator":"","text":"Jabir reported that God's messenger said, “Two things have results.\" On being asked by a man what these two things were, he replied, “He who dies a polytheist will enter hell, and he who dies worshipping God alone will enter paradise.\" \n\nMuslim transmitted it."}},{"id":35,"idInBook":35,"chapterId":1,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: كُنَّا قُعُودًا حَوْلَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَعنا أَبُو بَكْرٍ وَعُمَرُ رَضِيَ اللَّهُ عَنْهُمَا فِي نَفَرٍ فَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ بَيْنَ أَظْهُرِنَا فَأَبْطَأَ عَلَيْنَا وَخَشِيَنَا أَنْ يُقْتَطَعَ دُونَنَا وَفَزِعْنَا فَقُمْنَا فَكُنْتُ أَوَّلَ مَنْ فَزِعَ فَخَرَجْتُ أَبْتَغِي رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى أَتَيْتُ حَائِطًا لِلْأَنْصَارِ لِبَنِي النَّجَّارِ فَدُرْتُ بِهِ هَلْ أَجِدُ لَهُ بَابًا فَلَمْ أَجِدْ فَإِذَا رَبِيعٌ يَدْخُلُ فِي جَوْفِ حَائِطٍ مِنْ بِئْرٍ خَارِجَةٍ وَالرَّبِيعُ الْجَدْوَلُ فاحتفزت كَمَا يحتفز الثَّعْلَب فَدَخَلْتُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَبُو هُرَيْرَةَ فَقُلْتُ نَعَمْ يَا رَسُولَ اللَّهِ قَالَ مَا شَأْنُكَ قُلْتُ كُنْتَ بَيْنَ أَظْهُرِنَا فَقُمْتَ فَأَبْطَأْتَ عَلَيْنَا فَخَشِينَا أَنْ تُقْتَطَعَ دُونَنَا فَفَزِعْنَا فَكُنْتُ أَوَّلَ مَنْ فَزِعَ فَأَتَيْتُ هَذَا الْحَائِطَ فَاحْتَفَزْتُ كَمَا يَحْتَفِزُ الثَّعْلَبُ وَهَؤُلَاء النَّاس ورائي فَقَالَ يَا أَبَا هُرَيْرَة وَأَعْطَانِي نَعْلَيْه قَالَ اذْهَبْ بنعلي هَاتين فَمن لقِيت من وَرَاء هَذَا الْحَائِط يَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ مُسْتَيْقِنًا بِهَا قَلْبُهُ فَبَشِّرْهُ بِالْجَنَّةِ فَكَانَ أَوَّلُ مَنْ لَقِيتُ عُمَرَ فَقَالَ مَا هَاتَانِ النَّعْلَانِ يَا أَبَا هُرَيْرَة فَقلت هَاتَانِ نَعْلَا رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَنِي بِهِمَا مَنْ لَقِيتُ يَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ مُسْتَيْقِنًا بِهَا قَلْبُهُ بَشرته بِالْجنَّةِ فَضرب عمر بِيَدِهِ بَيْنَ ثَدْيَيَّ فَخَرَرْتُ لِاسْتِي فَقَالَ ارْجِعْ يَا أَبَا هُرَيْرَةَ فَرَجَعْتُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فأجهشت بكاء وركبني عمر فَإِذا هُوَ على أثري فَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا لَك يَا أَبَا هُرَيْرَة قلت لقِيت عمر فَأَخْبَرته بِالَّذِي بعثتني بِهِ فَضرب بَين ثديي فَخَرَرْت لاستي قَالَ ارْجع فَقَالَ لَهُ رَسُول الله يَا عُمَرُ مَا حَمَلَكَ عَلَى مَا فَعَلْتَ قَالَ يَا رَسُولَ اللَّهِ بِأَبِي أَنْتَ وَأُمِّي أَبَعَثْتَ أَبَا هُرَيْرَةَ بِنَعْلَيْكَ مَنْ لَقِيَ يَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ مُسْتَيْقِنًا بِهَا قَلْبُهُ بَشَّرَهُ بِالْجَنَّةِ قَالَ نَعَمْ قَالَ فَلَا تَفْعَلْ فَإِنِّي أَخْشَى أَنْ يَتَّكِلَ النَّاسُ عَلَيْهَا فخلهم يعْملُونَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فخلهم \". رَوَاهُ مُسلم","english":{"narrator":"Abu Huraira said:","text":"We were seated around God's messenger, Abu Bakr, ‘Umar and some others being with us, when God's messenger got up and left us. He delayed for some time, which made us fear that he might be attacked by some enemy when we were not with him; so being alarmed we got up. I was the first to be alarmed. I therefore went out to look for God's messenger and came to a garden belonging to the B. an-Najjar, a section of the Ansar, I went round it looking for a gate, but failed to find one. Seeing a rabi’ (i.e. a streamlet) flowing into the garden from a well outside, I drew myself together and went in to where God's messenger was. He said, “Is it Abu Huraira?\" I replied, “Yes, messenger of God.\" He said, “What do you want?\" I replied, “You were among us, but got up and went away and delayed for a time, so fearing that you might be attacked by some enemy when we were not with you, we became alarmed. I was the first to be alarmed, so when I came to this garden I drew myself together as a fox does; and these people are following me.\" Addressing me by name he gave me his sandals and said, “Take away these sandals of mine, and when you meet anyone outside this garden who testifies that there is no god but God, being assured of it in his heart, gladden him by announcing that he will go to paradise.\" Now the first one I met was ‘Umar. He asked, “What are these sandals, Abu Huraira?” and I replied, “These are God’s messenger’s sandals with which he has sent me to gladden anyone I met who testified that there is no god but God, being assured of it in his heart, with the announcement that he would go to paradise.” Thereupon ‘Umar struck me on the breast and I fell down on my seat.” He then said, “Go back, Abu Huraira”; so I went back to God’s messenger, and I was ready to weep. ‘Umar followed me closely, and there he was behind me. God’s messenger said, “What is the matter with you, Abu Huraira?” I replied, “I met ‘Umar and conveyed to him your message, whereupon he gave me a blow on the breast which made me fall down on my seat and ordered me to go back.” God’s messenger said, “What induced you, ‘Umar, to do what you did?” He replied, “Messenger of God, for whom I would give my father and mother as ransom, did you send Abu Huraira with your sandals to gladden anyone he met who testified that there is no god but God, being assured of it in his heart, with the announcement that he would go to paradise?” He said, “Yes.” ‘Umar said, “You must not do it, for I am afraid that people will trust in it alone; let them go on doing  works.” God’s messenger said, “Well let them.” \n\nMuslim transmitted it."}},{"id":36,"idInBook":36,"chapterId":1,"bookId":14,"arabic":"عَن مُعَاذِ بْنِ جَبَلٍ قَالَ: «قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَفَاتِيحُ الْجَنَّةِ شَهَادَةُ أَنْ لَا إِلَه إِلَّا الله» . رَوَاهُ أَحْمد","english":{"narrator":"","text":"Mu'adh b. Jabal reported that God’s messenger said to him, “The keys of paradise are the testimony that there is no god but God.” \n\nAhmad transmitted it."}},{"id":37,"idInBook":37,"chapterId":1,"bookId":14,"arabic":"عَنْ عُثْمَانَ بْنِ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ قَالَ: إِنَّ رِجَالًا مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ تُوُفِّيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَزِنُوا عَلَيْهِ حَتَّى كَادَ بَعْضُهُمْ يُوَسْوِسُ قَالَ عُثْمَان وَكنت مِنْهُم فَبينا أَنا جَالس فِي ظلّ أَطَم من الْآطَام مر عَليّ عمر رَضِي الله عَنهُ فَسلم عَليّ فَلم أشعر أَنه مر وَلَا سلم فَانْطَلق عمر حَتَّى دخل على أبي بكر رَضِي الله عَنهُ فَقَالَ لَهُ مَا يُعْجِبك أَنِّي مَرَرْت على عُثْمَان فَسلمت عَلَيْهِ فَلم يرد عَليّ السَّلَام وَأَقْبل هُوَ وَأَبُو بكر فِي وِلَايَةَ أَبِي بَكْرٍ رَضِيَ اللَّهُ عَنْهُ حَتَّى سلما عَليّ جَمِيعًا ثمَّ قَالَ أَبُو بكر جَاءَنِي أَخُوك عمر فَذكر أَنه مر عَلَيْك فَسلم فَلم ترد عَلَيْهِ السَّلَام فَمَا الَّذِي حملك على ذَلِك قَالَ قُلْتُ مَا فَعَلْتُ فَقَالَ عُمَرُ بَلَى وَاللَّهِ لقد فعلت وَلكنهَا عبيتكم يَا بني أُميَّة قَالَ قُلْتُ وَاللَّهِ مَا شَعَرْتُ أَنَّكَ مَرَرْتَ وَلَا سَلَّمْتَ قَالَ أَبُو بَكْرٍ صَدَقَ عُثْمَانُ وَقد شَغَلَكَ عَنْ ذَلِكَ أَمْرٌ فَقُلْتُ أَجْلَ قَالَ مَا هُوَ فَقَالَ عُثْمَان رَضِي الله عَنهُ توفى الله عز وَجل نَبِيَّهُ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَبْلَ أَنْ نَسْأَلَهُ عَنْ نَجَاةِ هَذَا الْأَمْرِ قَالَ أَبُو بكر قد سَأَلته عَن ذَلِك قَالَ فَقُمْت إِلَيْهِ فَقلت لَهُ بِأَبِي أَنْتَ وَأُمِّي أَنْتَ أَحَقُّ بِهَا قَالَ أَبُو بَكْرٍ قُلْتُ يَا رَسُولَ اللَّهِ مَا نَجَاةُ هَذَا الْأَمْرِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ قَبِلَ مِنِّي الْكَلِمَةَ الَّتِي عَرَضْتُ عَلَى عَمِّي فَرَدَّهَا فَهِيَ لَهُ نجاة. رَوَاهُ أَحْمد","english":{"narrator":"‘Uthman said that when the Prophet died some of his companions were so grieved that they almost began to harbour doubts. Remarking that he was one of them, ‘Uthman said:","text":"While I was sitting ‘Umar passed me and gave me a salutation, but I did not notice it. ‘Umar complained to Abu Bakr, and the two of them came forward and gave me a salutation; then Abu Bakr asked, “What induced you to refrain from returning the salutation of your brother ‘Umar?” I replied, “I did no such thing.” ‘Umar retorted, “Yes, I swear by God, you did.” I said, “I swear by God that I did not notice you passing me or giving me a salutation.” Abu Bakr then said, “‘Uthman is speaking the truth. Something must have distracted you.” On my replying that it had, he asked me what it was, and I said, “God has taken His Prophet before we asked him wherein this affair provides salvation.” Abu Bakr said that he had asked him about that, so I rose and went to him and said to him, “You for whom I would give my father and mother as ransom are most worthy of it.” Abu Bakr then told me that he had asked, “Messenger of God, wherein does this affair provide salvation?” to which God’s messenger replied, “If anyone accepts from me the confession which I proposed to my paternal uncle1 and he rejected, it will be salvation for him.” \n\nAhmad transmitted it.\n\n1 Abu Talib, the uncle who gave protection in Makkah, but did not accept his religion."}},{"id":38,"idInBook":38,"chapterId":1,"bookId":14,"arabic":"عَن الْمِقْدَاد بن الْأسود قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" يَقُولُ لَا يَبْقَى عَلَى ظَهْرِ الْأَرْضِ بَيْتُ مَدَرٍ وَلَا وَبَرٍ إِلَّا أَدْخَلَهُ اللَّهُ كلمة الاسلام بعز عَزِيز أَو ذل ذليل إِمَّا يعزهم الله عز وَجل فَيَجْعَلُهُمْ مِنْ أَهْلِهَا أَوْ يُذِلُّهُمْ فَيَدِينُونَ لَهَا\nرَوَاهُ أَحْمد","english":{"narrator":"","text":"Miqdad reported that he heard God’s messenger say, “There will not remain on the face of the earth a mud-brick house or a camel’s hair tent which God will not cause the confession of Islam to enter bringing both mighty honour and abject abasement. God will either honour the occupants and put them among its adherents, or will humiliate them and they will be subject to it.” Miqdad said, “God will then receive complete obedience.” \n\nAhmad transmitted it."}},{"id":39,"idInBook":39,"chapterId":1,"bookId":14,"arabic":"عَن وهب بن مُنَبّه قِيلَ لَهُ: أَلَيْسَ لَا إِلَهَ إِلَّا اللَّهُ مِفْتَاحُ الْجَنَّةِ قَالَ بَلَى وَلَكِنْ لَيْسَ مِفْتَاحٌ إِلَّا لَهُ أَسْنَانٌ فَإِنْ جِئْتَ بِمِفْتَاحٍ لَهُ أَسْنَانٌ فَتَحَ لَكَ وَإِلَّا لَمْ يَفْتَحْ لَكَ. رَوَاهُ الْبُخَارِيُّ فِي تَرْجَمَة بَاب","english":{"narrator":"","text":"Wahb b. Munabbih, on being asked whether ‘There is no god but God’ was not the key of paradise, said, “Yes, but every key has wards. If you bring a key with wards the door will be opened for you, otherwise I it will not.” \n\nBukhari transmitted it in a chapter heading."}},{"id":40,"idInBook":40,"chapterId":1,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:\nإِذَا أَحْسَنَ أَحَدُكُمْ إِسْلَامَهُ فَكُلُّ حَسَنَةٍ يَعْمَلُهَا تُكْتَبُ لَهُ بِعشر أَمْثَالهَا إِلَى سبع مائَة ضعف وكل سَيِّئَة يعملها تكْتب لَهُ بِمِثْلِهَا \"","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “When one of you makes a good profession of Islam, every good deed he does will be recorded for him ten to seven hundredfold, and every evil deed he does will be recorded as it is till he meets God.” \n\n(Bukhari and Muslim.)"}},{"id":41,"idInBook":41,"chapterId":1,"bookId":14,"arabic":"وَعَنْ أَبِي أُمَامَةَ أَنَّ رَجُلًا سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا الْإِيمَانُ قَالَ إِذَا سَرَّتْكَ حَسَنَتُكَ وَسَاءَتْكَ سَيِّئَتُكَ فَأَنْتَ مُؤْمِنٌ قَالَ يَا رَسُولَ اللَّهِ فَمَا الْإِثْمُ قَالَ إِذَا حَاكَ فِي نَفْسِكَ شَيْءٌ فَدَعْهُ» . رَوَاهُ أَحْمد","english":{"narrator":"","text":"Abu Umama reported that a man asked God’s messenger what faith was, to which he replied, “When your good deed pleases you and your evil deed grieves you, you are a believer.” He then asked what sin was and received the reply, “When you have a besetting sin, give it up.” \n\nAhmad transmitted it."}},{"id":42,"idInBook":42,"chapterId":1,"bookId":14,"arabic":"عَن عَمْرو بن عبسة قَالَ: أَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ يَا رَسُول الله من تبعك عَلَى هَذَا الْأَمْرِ قَالَ حُرٌّ وَعَبْدٌ قُلْتُ مَا الْإِسْلَامُ قَالَ طِيبُ الْكَلَامِ وَإِطْعَامُ الطَّعَامِ قُلْتُ مَا الْإِيمَانُ قَالَ الصَّبْرُ وَالسَّمَاحَةُ قَالَ قُلْتُ أَيُّ الْإِسْلَامِ أَفْضَلُ قَالَ مَنْ سَلِمَ الْمُسْلِمُونَ مِنْ لِسَانِهِ وَيَدِهِ قَالَ قُلْتُ أَيُّ الْإِيمَانِ أَفْضَلُ قَالَ خُلُقٌ حَسَنٌ قَالَ قُلْتُ أَيُّ الصَّلَاةِ أَفْضَلُ قَالَ طُولُ الْقُنُوتِ قَالَ قُلْتُ أَيُّ الْهِجْرَةِ أَفْضَلُ قَالَ أَنْ تَهْجُرَ مَا كره رَبك عز وَجل قَالَ قلت فَأَيُّ الْجِهَادِ أَفْضَلُ قَالَ مَنْ عُقِرَ جَوَادُهُ وَأُهْرِيقَ دَمُهُ قَالَ قُلْتُ أَيُّ السَّاعَاتِ أَفْضَلُ قَالَ جَوف اللَّيْل الآخر. . . رَوَاهُ أَحْمد","english":{"narrator":"‘Amr b. ‘Abasa said:","text":"I came to God's messenger and asked, “Who is associated with you in this matter, messenger of God?” He replied, “Both freeman and slave.” I asked what Islam was and he said, I “Pleasant speech and the provision of food.” I asked what faith was and he said, “Endurance and benevolence.” I asked what aspect of Islam was most excellent, and he replied that it was to be seen in him from whose tongue and hand the Muslims were safe. I asked what aspect of faith was most excellent, and he replied that it was a good disposition. I asked what feature of prayer was most excellent, and he replied that it consisted in standing for a long time in  humility. I asked him what aspect of emigration (hijra) was most excellent, and he replied, “Abandoning (an tahjura) what your Lord abhors.” I asked what aspect of jihad was most excellent, and he replied that it was when a man’s steed was wounded and his blood was shed. I asked him which hour was most excellent, and he replied that it was towards the end of the darkest part of the night. \n\nAhmad transmitted it."}},{"id":43,"idInBook":43,"chapterId":1,"bookId":14,"arabic":"وَعَن مُعَاذِ بْنِ جَبَلٍ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنْ لَقِيَ اللَّهَ لَا يُشْرِكُ بِهِ شَيْئا يُصَلِّي الْخَمْسَ وَيَصُومُ رَمَضَانَ غُفِرَ لَهُ قُلْتُ أَفَلَا أُبَشِّرُهُمْ يَا رَسُولَ اللَّهِ قَالَ دَعْهُمْ يَعْمَلُوا» . رَوَاهُ أَحْمد","english":{"narrator":"","text":"Mu‘adh b. Jabal said that he heard God’s messenger say, “He who meets his Lord having associated nothing with Him, observed the five times of prayer, and fasted during Ramadan will be forgiven.” Mu'adh asked whether he should not give them the good news, but was told to let them go on doing  works. \n\nAhmad transmitted it."}},{"id":44,"idInBook":44,"chapterId":1,"bookId":14,"arabic":"وَعَن معَاذ أَنَّهُ سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أَفْضَلِ الْإِيمَانِ قَالَ: «أَنْ تُحِبَّ لِلَّهِ وَتُبْغِضَ لِلَّهِ وَتُعْمِلَ لِسَانَكَ فِي ذِكْرِ اللَّهِ قَالَ وماذا يَا رَسُول الله قَالَ وَأَن تحب للنَّاس مَا تحب لنَفسك وَتَكْرَهُ لَهُمْ مَا تَكْرَهُ لِنَفْسِكَ» . رَوَاهُ أَحْمَدُ","english":{"narrator":"","text":"He also said that he asked the Prophet what was the most excellent aspect of faith, and received the reply, “That you should love for God’s sake, hate for God’s sake, and employ your tongue in making mention of God.” “What more, messenger of God?” he asked and was told, “That you should like other people to have what you like yourself, and dislike that they should have what you dislike yourself.” \n\nAhmad transmitted it."}},{"id":45,"idInBook":45,"chapterId":1,"bookId":14,"arabic":"عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ: قَالَ رَجُلٌ: يَا رَسُولَ اللَّهِ أَيُّ الذَّنْبِ أَكْبَرُ عِنْدَ اللَّهِ قَالَ أَنْ تَدْعُوَ لِلَّهِ نِدًّا وَهُوَ خَلَقَكَ قَالَ ثُمَّ أَيٌّ قَالَ ثمَّ أَنْ تَقْتُلَ وَلَدَكَ خَشْيَةَ أَنْ يَطْعَمَ مَعَكَ قَالَ ثمَّ أَي قَالَ ثمَّ أَن تُزَانِي بحليلة جَارك فَأنْزل الله عز وَجل تَصْدِيقَهَا (وَالَّذِينَ لَا يَدْعُونَ مَعَ اللَّهِ إِلَهًا آخَرَ وَلَا يَقْتُلُونَ النَّفْسَ الَّتِي حَرَّمَ اللَّهُ إِلَّا بِالْحَقِّ وَلَا يزنون وَمن يفعل ذَلِك يلق أثاما)\nالْآيَة","english":{"narrator":"‘Abdallah b. Mas'ud said that a man asked God’s messenger, what was the greatest sin in God’s sight, to which he replied, “That you should treat anything as equal to God when He has created you.\" “What next?’’ he asked, to which he replied, “That you should kill your child for fear that he may eat along with you.”. ‘‘What next?\" he asked, to which he replied, “That you should commit adultery with your neighbour’s wife.\" God has revealed words which verify this :","text":"“Those who do not invoke another god along with God, or kill one whom God has declared inviolate without a just cause, or commit fornication...\" 1  \n\n(Bukhari and Muslim.)\n\n1  Quran, xxv, 68."}},{"id":46,"idInBook":46,"chapterId":1,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْكَبَائِرُ الْإِشْرَاكُ بِاللَّهِ وَعُقُوقُ الْوَالِدَيْنِ وَقَتْلُ النَّفْسِ وَالْيَمِين الْغمُوس» . رَوَاهُ البُخَارِيّ\nوَفِي رِوَايَةِ أَنَسٍ: «وَشَهَادَةُ الزُّورِ» بَدَلُ: «الْيَمِينُ الْغمُوس»","english":{"narrator":"","text":"‘Abdallah b. ‘Amr reported God’s messenger as saying, “The major sins are associating other objects of worship with God, disobedience to parents, murder, and deliberate perjury (al-yamin al-ghamus).\" \n\nBukhari transmitted it. Anas’s version has “false witness”* (shahadat al-zur) instead of ‘‘deliberate perjury.\" \n\n(Bukhari and Muslim.)"}},{"id":47,"idInBook":47,"chapterId":1,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «اجْتَنِبُوا السَّبْعَ الْمُوبِقَاتِ قَالُوا يَا رَسُولَ اللَّهِ وَمَا هُنَّ قَالَ الشِّرْكُ بِاللَّهِ وَالسِّحْرُ وَقَتْلُ النَّفْسِ الَّتِي حَرَّمَ اللَّهُ إِلَّا بِالْحَقِّ وَأَكْلُ الرِّبَا وَأَكْلُ مَالِ الْيَتِيمِ وَالتَّوَلِّي يَوْمَ الزَّحْفِ وَقَذْفُ الْمُحْصَنَاتِ الْمُؤْمِنَاتِ الْغَافِلَاتِ»","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “Avoid the seven noxious things.\" When his hearers asked, “What are they, messenger of God?\" he replied, “Associating anything with God, magic, killing one whom God has declared inviolate without a just cause, devouring usury, consuming the property of an orphan, turning back when the army advances, and slandering chaste women who are believers but indiscreet.\" \n\n(Bukhari and Muslim.)"}},{"id":48,"idInBook":48,"chapterId":1,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يَزْنِي الزَّانِي حِينَ يَزْنِي وَهُوَ مُؤْمِنٌ وَلَا يشرب الْخمر حِين يشْربهَا وَهُوَ مُؤمن وَلَا يَسْرِقُ السَّارِقُ حِينَ يَسْرِقُ وَهُوَ مُؤْمِنٌ وَلَا ينتهب نهبة ذَات شرف يرفع النَّاس إِلَيْهِ أَبْصَارهم فِيهَا حِينَ يَنْتَهِبُهَا وَهُوَ مُؤْمِنٌ وَلَا يَغُلُّ أَحَدُكُمْ حِين يغل وَهُوَ مُؤمن فإياكم إيَّاكُمْ»\nوَفِي رِوَايَة ابْن عَبَّاس: «وَلَا يَقْتُلُ حِينَ يَقْتُلُ وَهُوَ مُؤْمِنٌ» . قَالَ عِكْرِمَةُ: قُلْتُ لِابْنِ عَبَّاسٍ: كَيْفَ يُنْزَعُ الْإِيمَانُ مِنْهُ؟ قَالَ: هَكَذَا وَشَبَّكَ بَيْنَ أَصَابِعِهِ ثُمَّ أَخْرَجَهَا فَإِنْ تَابَ عَادَ إِلَيْهِ هَكَذَا وَشَبَّكَ بَيْنَ أَصَابِعِهِ وَقَالَ أَبُو عَبْدِ اللَّهِ: لَا يَكُونُ هَذَا مُؤْمِنًا تَامًّا وَلَا يَكُونُ لَهُ نُورُ الْإِيمَان. هَذَا لفظ البُخَارِيّ","english":{"narrator":"","text":"He also reported God’s messenger as saying, “When one commits fornication he is not a believer, when one steals he is not a believer, when one drinks wine he is not a believer, when one takes plunder on account of which men raise their eyes at him he is not a believer, and when one of you defrauds he is not a believer; so beware, beware!\" \n\n(Bukhari and Muslim.) \nThe version of Ibn ‘Abbas contains “When one commits murder he is not a believer.” ‘Ikrima said that he asked Ibn 'Abbas how faith could be snatched away from him, and he replied “Thus (interlacing his fingers and then separating them), but if he repents, it will return to him thus,” and he interlaced his fingers. Aba ‘Abdallah1  said that such a one is not a perfect believer and does not possess the light of faith. This is Bukhari's wording.\n\n1 i.e. ‘Ikrima, Abu Abdullah being his kunya."}},{"id":49,"idInBook":49,"chapterId":1,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: ( «آيَةُ الْمُنَافِقِ ثَلَاثٌ» . زَادَ مُسْلِمٌ: «وَإِنْ صَامَ وَصَلَّى وَزَعَمَ أَنَّهُ مُسْلِمٌ» . ثُمَّ اتَّفَقَا: «إِذَا حَدَّثَ كَذَبَ وَإِذَا وَعَدَ أَخْلَفَ وَإِذَا اؤتمن خَان»","english":{"narrator":"","text":"Abu Huraira reported God's messenger as saying, “There are three signs of a hypocrite.” Muslim added, “Even if he fasts, prays, and asserts that he is a Muslim.” Thereafter both Bukhari and Muslim said, “When he speaks he lies, when he makes a promise he breaks it, and when he is trusted he betrays his trust.”"}},{"id":50,"idInBook":50,"chapterId":1,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أَرْبَعٌ مَنْ كُنَّ فِيهِ كَانَ مُنَافِقًا خَالِصًا وَمَنْ كَانَتْ فِيهِ خَصْلَةٌ مِنْهُنَّ كَانَتْ فِيهِ خَصْلَةٌ مِنَ النِّفَاقِ حَتَّى يَدَعَهَا إِذَا اؤْتُمِنَ خَانَ وَإِذَا حَدَّثَ كَذَبَ وَإِذَا عَاهَدَ غَدَرَ وَإِذا خَاصم فجر»","english":{"narrator":"‘Abdallah b. ‘Amr reported God's messenger as saying, “Four characteristics constitute anyone who possesses them a sheer hypocrite, and anyone who possesses one of them possesses a characteristic of hypocrisy till he abandons it:","text":"when he is trusted he betrays his trust, when he talks he lies, when he makes a covenant he acts treacherously, and when he quarrels he deviates from the truth.” \n\n(Bukhari and Muslim.)"}},{"id":51,"idInBook":51,"chapterId":1,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مثل الْمُنَافِق كَمثل الشَّاة الْعَائِرَةِ بَيْنَ الْغُنْمَيْنِ تَعِيرُ إِلَى هَذِهِ مَرَّةً وَإِلَى هَذِه مرّة» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Ibn ‘Umar reported God's messenger as saying, “The hypocrite is like a ewe which goes to and fro between two flocks, turning at one time to the one and at another time to the other.”\n\nMuslim transmitted it."}},{"id":52,"idInBook":52,"chapterId":1,"bookId":14,"arabic":"عَنْ صَفْوَانَ بْنِ عَسَّالٍ قَالَ: قَالَ يَهُودِيٌّ لصَاحبه اذْهَبْ بِنَا إِلَى هَذَا النَّبِي فَقَالَ صَاحِبُهُ لَا تَقُلْ نَبِيٌّ إِنَّهُ لَوْ سَمِعَكَ كَانَ لَهُ أَرْبَعَة أَعْيُنٍ فَأَتَيَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلَاهُ عَنْ تِسْعِ آيَاتٍ بَيِّنَاتٍ فَقَالَ لَهُم: «لَا تُشْرِكُوا بِاللَّهِ شَيْئًا وَلَا تَسْرِقُوا وَلَا تَزْنُوا وَلَا تَقْتُلُوا النَّفْسَ الَّتِي حَرَّمَ اللَّهُ إِلَّا بِالْحَقِّ وَلَا تَمْشُوا بِبَرِيءٍ إِلَى ذِي سُلْطَانٍ لِيَقْتُلَهُ وَلَا تَسْحَرُوا وَلَا تَأْكُلُوا الرِّبَا وَلَا تَقْذِفُوا مُحصنَة وَلَا توَلّوا الْفِرَار يَوْمَ الزَّحْفِ وَعَلَيْكُمْ خَاصَّةً الْيَهُودَ أَنْ لَا تَعْتَدوا فِي السبت» . قَالَ فقبلوا يَده وَرجله فَقَالَا نَشْهَدُ أَنَّكَ نَبِيٌّ قَالَ فَمَا يَمْنَعُكُمْ أَنْ تتبعوني قَالُوا إِن دَاوُد دَعَا ربه أَن لَا يزَال فِي ذُرِّيَّتِهِ نَبِيٌّ وَإِنَّا نَخَافُ إِنْ تَبِعْنَاكَ أَنْ تَقْتُلَنَا الْيَهُودُ. رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالنَّسَائِيُّ","english":{"narrator":"","text":"Safwan b. ‘Assal told how, when a Jew said to his friend, “Let us go to this prophet,” his friend said to him, “Don’t say ‘prophet’, for if he heard you he would be greatly pleased.” 1  They went to God’s messenger and asked him about nine clear signs. God’s messenger said, “Do not associate anything with God. do not steal, do not commit fornication, do not kill anyone whom God has declared inviolate without a just cause, do not bring an innocent person before a ruler in order that he may put him to death, do not use magic, do not devour usury, do not slander a chaste woman, do not turn in flight on the day the army marches, and, a matter which affects you Jews particularly, do not break the Sabbath.” He said that thereupon they kissed/his hands and feet saying, “We testify that you are a prophet.” He asked “What prevents you from following me?” to which they replied, “David prayed to his Lord that prophets might never cease to arise from his offspring, and we are afraid that if we follow you the Jews will kill us.” \n\nTirmidhi, Aba Dawud and Nasa’i transmitted it.\n\n1 Lit.  “he would have four eyes.”"}},{"id":53,"idInBook":53,"chapterId":1,"bookId":14,"arabic":"وَعَنْ أَنَسِ بْنِ مَالِكٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «ثَلَاث من أَصْلِ الْإِيمَانِ الْكَفُّ عَمَّنْ قَالَ لَا إِلَهَ إِلَّا الله وَلَا نكفره بذنب وَلَا نخرجهُ من الْإِسْلَام بِعَمَل وَالْجِهَادُ مَاضٍ مُنْذُ بَعَثَنِي اللَّهُ إِلَى أَنْ يُقَاتل آخر أمتِي الدَّجَّالَ لَا يُبْطِلُهُ جَوْرُ جَائِرٍ وَلَا عَدْلُ عَادل وَالْإِيمَان بالأقدار» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"Anas reported God’s messenger as saying, “Three matters pertain to the root of faith:","text":"no molestation of one who says there is no god but God, neither declaring him an infidel because of a sin, nor excommunicating him from Islam because of an action; jihad continues from the time God sent me till the last of this people fights with the dajjal, being annulled neither by the tyranny of a tyrannical ruler nor the justice of a just one; and belief in God’s decrees.” \n\nAbu Dawud transmitted it."}},{"id":54,"idInBook":54,"chapterId":1,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا زَنَى الْعَبْدُ خَرَجَ مِنْهُ الْإِيمَانُ فَكَانَ فَوْقَ رَأْسِهِ كَالظُّلَّةِ فَإِذا خرج من ذَلِك الْعَمَل عَاد إِلَيْهِ الايمان» . رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد","english":{"narrator":"","text":"Abu Huraira reported that God's messenger said, “When a servant of God commits fornication faith departs from him and there is something like an awning over his head; but when he quits that action faith returns to him.” \n\nTirmidhi and Abu Dawud transmitted it."}},{"id":55,"idInBook":55,"chapterId":1,"bookId":14,"arabic":"عَنْ مُعَاذٍ قَالَ: أَوْصَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِعَشْرِ كَلِمَاتٍ قَالَ لَا تُشْرِكْ بِاللَّهِ شَيْئًا وَإِنْ قُتِلْتَ وَحُرِّقْتَ وَلَا تَعُقَّنَّ وَالِدَيْكَ وَإِنْ أَمَرَاكَ أَنْ تَخْرُجَ مِنْ أَهْلِكَ وَمَالِكَ وَلَا تَتْرُكَنَّ صَلَاةً مَكْتُوبَةً مُتَعَمِّدًا فَإِنَّ مَنْ تَرَكَ صَلَاةً مَكْتُوبَةً مُتَعَمِّدًا فَقَدْ بَرِئَتْ مِنْهُ ذِمَّةُ اللَّهِ وَلَا تَشْرَبَنَّ خَمْرًا فَإِنَّهُ رَأَسُ كُلِّ فَاحِشَةٍ وَإِيَّاكَ وَالْمَعْصِيَةَ فَإِنَّ بالمعصية حل سخط الله عز وَجل وَإِيَّاكَ وَالْفِرَارَ مِنَ الزَّحْفِ وَإِنْ هَلَكَ النَّاسُ وَإِذا أصَاب النَّاس موتان وَأَنت فيهم فَاثْبتْ وَأنْفق عَلَى عِيَالِكَ مِنْ طَوْلِكَ وَلَا تَرْفَعْ عَنْهُمْ عَصَاكَ أَدَبًا وَأَخِفْهُمْ فِي اللَّهِ. رَوَاهُ أَحْمَدُ","english":{"narrator":"Mu'adh said:","text":"God’s messenger recommended ten things to me saying, “Do not associate anything with God, even if you are killed and burnt on that account; do not be disobedient to your parents, even if they command you to quit your family and your property; do not deliberately neglect to observe a prescribed prayer, for he who deliberately neglects to observe a prescribed prayer will have God’s protection removed from him; do not drink wine, for it is the beginning of every abomination; avoid acts of disobedience, for on their account God’s wrath descends; beware of running away from the line of battle, even if the people perish: when people are smitten by death when you are among them, stay where you are ; spend on your children out of your means; do not refrain from using the rod in training them; and cause them to fear God.” \n\nAhmad transmitted it."}},{"id":56,"idInBook":56,"chapterId":1,"bookId":14,"arabic":"وَعَن حُذَيْفَة قَالَ: إِنَّمَا كَانَ النِّفَاق عَلَى عَهْدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَّا الْيَوْمَ فَإِنَّمَا هُوَ الْكفْر بعد الايمان. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Hudhaifa said, “Hypocrisy existed only in the time of God’s messenger, whereas to-day there are only unbelief and faith.” \n\nBukhari transmitted it."}},{"id":57,"idInBook":57,"chapterId":1,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ اللَّهَ تَعَالَى تَجَاوَزَ عَنْ أُمَّتِي مَا وَسْوَسَتْ بِهِ صُدُورُهَا مَا لم تعْمل بِهِ أَو تَتَكَلَّم»","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “God forgives my people the evil promptings which arise within them so long as they do not act upon them or speak about them.” \n\n(Bukhari and Muslim.)"}},{"id":58,"idInBook":58,"chapterId":1,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: جَاءَ نَاسٌ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلُوهُ: إِنَّا نَجِدُ فِي أَنْفُسِنَا مَا يَتَعَاظَمُ أَحَدُنَا أَنْ يَتَكَلَّمَ بِهِ. قَالَ: «أَو قد وجدتموه» قَالُوا: نعم. قَالَ: «ذَاك صَرِيح الْإِيمَان» . رَوَاهُ مُسلم","english":{"narrator":"","text":"He said that some of the companions of God’s messenger came to the Prophet to consult him saying, “We have thoughts which none of us dare to talk about.” He said, “Have you experienced that?” and when they replied that they had, he said, “That is clear faith.” \n\nMuslim transmitted it."}},{"id":59,"idInBook":59,"chapterId":1,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" يَأْتِي الشَّيْطَانُ أَحَدَكُمْ فَيَقُولُ: مَنْ خلق كَذَا؟ مَنْ خَلَقَ كَذَا؟ حَتَّى يَقُولَ: مَنْ خَلَقَ رَبَّكَ؟ فَإِذَا بَلَغَهُ فَلْيَسْتَعِذْ بِاللَّهِ وَلْيَنْتَهِ \"","english":{"narrator":"","text":"He also reported God’s messenger as saying, “The devil comes to one of you saying, ‘Who created this? Who created that?’ even saying, ‘Who created your Lord?’ \"When he gets that length the man should seek refuge in God and stop thinking about it.” \n\n(Bukhari and Muslim.)"}},{"id":60,"idInBook":60,"chapterId":1,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" لَا يَزَالُ النَّاسُ يَتَسَاءَلُونَ حَتَّى يُقَالَ هَذَا خَلَقَ اللَّهُ الْخَلْقَ فَمَنْ خَلَقَ اللَّهَ؟ فَمَنْ وَجَدَ مِنْ ذَلِكَ شَيْئًا فَلْيَقُلْ: آمَنت بِاللَّه وَرُسُله \"","english":{"narrator":"","text":"He also reported God’s messenger as saying, “People will continue to ask one another questions till someone says this, ‘God created all things, but who created God?’ Whoever comes across anything of that nature should say, ‘I believe in God and in His messengers.’ ” \n\n(Bukhari and Muslim.)"}},{"id":61,"idInBook":61,"chapterId":1,"bookId":14,"arabic":"وَعَنِ ابْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" مَا مِنْكُمْ مِنْ أَحَدٍ إِلَّا وَقَدْ وُكِّلَ بِهِ قَرِينُهُ مِنَ الْجِنِّ وَقَرِينُهُ مِنَ الْمَلَائِكَةِ. قَالُوا: وَإِيَّاكَ يَا رَسُولَ اللَّهِ؟ قَالَ: وَإِيَّايَ وَلَكِنَّ اللَّهَ أَعَانَنِي عَلَيْهِ فَأَسْلَمَ فَلَا يَأْمُرُنِي إِلَّا بِخَيْرٍ \". رَوَاهُ مُسلم","english":{"narrator":"","text":"Ibn Mas'ud reported God's messenger as saying, “There is none of you who does not have his partner from among the jinn and his partner from among the angels put in charge of him.” The hearers asked, “Does this also apply to you, messenger of God?” He replied, “It applies to me too, but God has helped me against him and he has accepted Islam, so he commands me to do only what is good.” \n\nMuslim transmitted it."}},{"id":62,"idInBook":62,"chapterId":1,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ الشَّيْطَانَ يَجْرِي مِنَ الانسان مجْرى الدَّم»","english":{"narrator":"","text":"Anas reported God’s messenger as saying, “The devil flows in a man like his blood.” \n\n(Bukhari and Muslim.)"}},{"id":63,"idInBook":63,"chapterId":1,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا مِنْ بَنِي آدَمَ مَوْلُودٌ إِلَّا يَمَسُّهُ الشَّيْطَانُ حِينَ يُولَدُ فَيَسْتَهِلُّ صَارِخًا مِنْ مَسِّ الشَّيْطَانِ غَيْرَ مَرْيَمَ وَابْنِهَا»","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “Except Mary and her son, no human being is born without the devil touching him, so that he raises his voice crying out because of the devil's touch” \n\n(Bukhari and Muslim.)"}},{"id":64,"idInBook":64,"chapterId":1,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «صِيَاحُ الْمَوْلُودِ حِينَ يَقَعُ نَزْغَةٌ من الشَّيْطَان»","english":{"narrator":"","text":"He also reported God's messenger as saying, \"The cry of an infant at the moment of birth is due to a prick from the devil.” \n\n(Bukhari and Muslim.)"}},{"id":65,"idInBook":65,"chapterId":1,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ إِبْلِيسَ يَضَعُ عَرْشَهُ عَلَى المَاء ثمَّ يبْعَث سراياه فَأَدْنَاهُمْ مِنْهُ مَنْزِلَةً أَعْظَمُهُمْ فِتْنَةً يَجِيءُ أَحَدُهُمْ فَيَقُولُ فَعَلَتُ كَذَا وَكَذَا فَيَقُولُ مَا صَنَعْتَ شَيْئًا قَالَ ثُمَّ يَجِيءُ أَحَدُهُمْ فَيَقُولُ مَا تَرَكَتُهُ حَتَّى فَرَّقَتْ بَيْنَهُ وَبَيْنَ امْرَأَتِهِ قَالَ فَيُدْنِيهِ مِنْهُ وَيَقُولُ نَعَمْ أَنْتَ قَالَ الْأَعْمَشُ أرَاهُ قَالَ «فيلتزمه» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Jabir reported God’s messenger as saying, \"Iblis sets his throne on the water, then sends forth his detachments to tempt mankind, the one who is nearest him in station being the one who can cause the severest temptation. One of them comes and says, ‘I have done such and such,’ but he replies, ‘You have done nothing.’ Then one of them comes and says; ‘I did not leave him till I separated him from his wife.’ He then brings him near to himself saying, ‘What a fine fellow you are!' ” A'mash said he thought he said, \"Then he embraces him.” \n\nMuslim transmitted it."}},{"id":66,"idInBook":66,"chapterId":1,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِن الشَّيْطَان قد أيس أَنْ يَعْبُدَهُ الْمُصَلُّونَ فِي جَزِيرَةِ الْعَرَبِ وَلَكِنَّ فِي التحريش بَينهم» . رَوَاهُ مُسلم","english":{"narrator":"","text":"He also reported God’s messenger as saying, \"The devil has despaired of being worshipped by those who engage in prayer in Arabia, but he has hopes of setting them against one another.” \n\nMuslim transmitted it."}},{"id":67,"idInBook":67,"chapterId":1,"bookId":14,"arabic":"عَنِ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَاءَهُ رَجُلٌ فَقَالَ: إِنِّي أُحَدِّثُ نَفْسِي بِالشَّيْءِ لَأَنْ أَكُونَ حُمَمَةً أَحَبُّ إِلَيَّ مِنْ أَنْ أَتَكَلَّمَ بِهِ. قَالَ: «الْحَمْدُ لِلَّهِ الَّذِي رَدَّ أَمْرَهُ إِلَى الْوَسْوَسَةِ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Ibn ‘Abbas told how a man came to the Prophet and said, \"I have thoughts of such a nature that I would rather be reduced to charcoal than speak about them.” He replied, ‘‘Praise be to God who has reduced  1  to no more than evil prompting!” \n\nAbu Dawud transmitted it.\n\n1 Or ."}},{"id":68,"idInBook":68,"chapterId":1,"bookId":14,"arabic":"وَعَن بْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" إِنَّ لِلشَّيْطَانَ لَمَّةً بِابْنِ آدَمَ وَلِلْمَلَكِ لَمَّةً فَأَمَّا لَمَّةُ الشَّيْطَانَ فَإِيعَادٌ بِالشَّرِّ وَتَكْذِيبٌ بِالْحَقِّ وَأَمَّا لَمَّةُ الْمَلَكِ فَإِيعَادٌ بِالْخَيْرِ وَتَصْدِيقٌ بِالْحَقِّ فَمَنْ وَجَدَ ذَلِكَ فَلْيَعْلَمْ أَنَّهُ من الله فليحمد اللَّهَ وَمَنْ وَجَدَ الْأُخْرَى فَلْيَتَعَوَّذْ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيمِ ثُمَّ قَرَأَ (الشَّيْطَانُ يَعِدُكُمُ الْفَقْرَ ويأمركم بالفحشاء)\nالْآيَة)\nأخرجه التِّرْمِذِيّ وَقَالَ: هَذَا حَدِيث حسن غَرِيب","english":{"narrator":"","text":"Ibn Mas'ud reported God’s messenger as saying, \"The devil draws near to man, and so does the angel. The devil’s approach consists of promise of what is evil, and denial of what is true, whereas the angel’s approach consists of promise of what is good and confirmation of what is true. When anyone experiences the latter, let him know that it comes from God and let him praise God; but if he experiences the other, let him seek refuge in God from the accursed devil.” Then he recited, \"The devil promises you poverty and urges you to iniquity.” 1\n\nTirmidhi transmitted it, and said this is a gharib tradition.\n\n1 Quran. ii, 268."}},{"id":69,"idInBook":69,"chapterId":1,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم يَقُول: \n\" لَا يَزَالُ النَّاسُ يَتَسَاءَلُونَ حَتَّى يُقَالَ: هَذَا خَلَقَ اللَّهُ الْخَلْقَ فَمَنْ خَلَقَ اللَّهَ؟ فَإِذَا قَالُوا ذَلِك فَقولُوا الله أحد الله الصَّمد لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُنْ لَهُ كفوا أحد ثمَّ ليتفل عَن يسَاره ثَلَاثًا وليستعذ من الشَّيْطَان \". رَوَاهُ أَبُو دَاوُد","english":{"narrator":"Abu Huraira reported God’s messenger as saying, \"Men will continue to question one another till this is propounded:","text":"God created all things, but who created God? When they propound that, say, ‘God is one. God is He to whom men repair. He has not begotten and He has not been begotten, and no one is equal to Him.” 1  Then one should spit three times on his left side and seek refuge in God from the accursed devil.” \n\nAbu Dawud transmitted it. We shall mention the tradition of ‘Amr b. al-Ahwas in the chapter on the sermon on the day of sacrifice, if God will.\n\n1 Book XI; Ch. xi"}},{"id":70,"idInBook":70,"chapterId":1,"bookId":14,"arabic":"عَن أنس بن مَالك يَقُولَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَنْ يَبْرَحَ النَّاسُ يَتَسَاءَلُونَ حَتَّى يَقُولُوا هَذَا الله خَالق كل شَيْء فَمن خلق الله» . رَوَاهُ الْبُخَارِيُّ. وَلِمُسْلِمٍ: \n\" قَالَ: قَالَ اللَّهُ عَزَّ وَجل: إِن أمتك لَا يزالون يَقُولُونَ: مَا كَذَا؟ مَا كَذَا؟ حَتَّى يَقُولُوا: هَذَا اللَّهُ خَلَقَ الْخَلْقَ فَمَنْ خَلَقَ اللَّهَ عَزَّ وَجل؟ \"","english":{"narrator":"Anas reported God’s messenger as saying, “Men will continue to question one another till they propound this:","text":"‘God created everything, but who created God?’ ” \n\nBukhari transmitted it. Muslim’s version is: He declared that God said, “Your people will continue to ask, ‘What is this?’ and ‘what is that?’ till they propound this: God created all things, but who created God?”"}},{"id":71,"idInBook":71,"chapterId":1,"bookId":14,"arabic":"عَن عُثْمَان بن أبي الْعَاصِ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «يَا رَسُولَ اللَّهِ إِنَّ الشَّيْطَانَ قَدْ حَالَ بيني وَبَين صَلَاتي وقراءتي يُلَبِّسُهَا عَلَيَّ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاكَ شَيْطَانٌ يُقَالُ لَهُ خِنْزِبٌ فَإِذَا أَحْسَسْتَهُ فَتَعَوَّذْ بِاللَّهِ مِنْهُ وَاتْفُلْ عَلَى يسارك ثَلَاثًا قَالَ فَفَعَلْتُ ذَلِكَ فَأَذْهَبَهُ اللَّهُ عَنِّي» . رَوَاهُ مَسْلِمٌ","english":{"narrator":"","text":"‘Uthman b. Abul-'As said he told God’s messenger that the devil interfered with his prayer and his recitation of the Qur’an, causing confusion in his mind, and God’s messenger replied, “That is a devil called Khinzab; so when you feel his presence seek refuge from him in God and spit three times on your left side.” ‘Uthman did so and God caused him to depart from him. \n\nMuslim transmitted it."}},{"id":72,"idInBook":72,"chapterId":1,"bookId":14,"arabic":"وَعَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ أَنَّ رَجُلًا سَأَلَهُ فَقَالَ: «إِنِّي أهم فِي صَلَاتي فيكثر ذَلِك عَليّ فَقَالَ الْقَاسِم بن مُحَمَّد امْضِ فِي صَلَاتك فَإِنَّهُ لن يذهب عَنْكَ حَتَّى تَنْصَرِفَ وَأَنْتَ تَقُولُ مَا أَتْمَمْتُ صَلَاتي» . رَوَاهُ مَالك","english":{"narrator":"","text":"Al-Qasim b. Muhammad said that a man told him he was greatly distressed by wandering thoughts while he was engaged in prayer. He told him to persevere with his prayer, explaining that he would not be free from that till he said when he finished his prayer, “I have not performed my prayer perfectly.” \n\nMalik transmitted it."}},{"id":73,"idInBook":73,"chapterId":1,"bookId":14,"arabic":"عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «كَتَبَ اللَّهُ مقادير الْخَلَائق قبل أَن يخلق السَّمَوَات وَالْأَرْضَ بِخَمْسِينَ أَلْفَ سَنَةٍ» قَالَ: «وَكَانَ عَرْشُهُ على المَاء» . رَوَاهُ مُسلم","english":{"narrator":"","text":"‘Abdallah b. 'Amr reported God’s messenger as saying, “God recorded the fates of all creatures 50,000 years before creating the heavens and the earth, and His throne was upon the water.” \n\nMuslim transmitted it."}},{"id":74,"idInBook":74,"chapterId":1,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «كُلُّ شَيْءٍ بِقَدَرٍ حَتَّى الْعَجز والكيس» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Ibn ‘Umar reported God’s messenger as saying, “Everything is decreed, even backwardness and shrewdness.” \n\nMuslim transmitted it."}},{"id":75,"idInBook":75,"chapterId":1,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «احْتَجَّ آدَمُ وَمُوسَى عَلَيْهِمَا السَّلَام عِنْدَ رَبِّهِمَا فَحَجَّ آدَمُ مُوسَى قَالَ مُوسَى أَنْتَ آدَمُ الَّذِي خَلَقَكَ اللَّهُ بِيَدِهِ وَنَفَخَ فِيكَ مِنْ رُوحِهِ وَأَسْجَدَ لَكَ مَلَائِكَتَهُ وَأَسْكَنَكَ فِي جَنَّتِهِ ثُمَّ أَهَبَطْتَ النَّاسَ بِخَطِيئَتِكَ إِلَى الأَرْض فَقَالَ آدَمُ أَنْتَ مُوسَى الَّذِي اصْطَفَاكَ اللَّهُ بِرِسَالَتِهِ وَبِكَلَامِهِ وَأَعْطَاكَ الْأَلْوَاحَ فِيهَا تِبْيَانُ كُلِّ شَيْءٍ وَقَرَّبَكَ نَجِيًّا فَبِكَمْ وَجَدَتِ اللَّهِ كَتَبَ التَّوْرَاةَ قَبْلَ أَنْ أُخْلَقَ قَالَ مُوسَى بِأَرْبَعِينَ عَامًا قَالَ آدَمُ فَهَلْ وَجَدْتَ فِيهَا (وَعَصَى آدَمُ ربه فغوى)\nقَالَ نَعَمْ قَالَ أَفَتَلُومُنِي عَلَى أَنْ عَمِلْتُ عَمَلًا كَتَبَهُ اللَّهُ عَلَيَّ أَنْ أَعْمَلَهُ قَبْلَ أَنْ يَخْلُقَنِي بِأَرْبَعِينَ سَنَةً قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَحَجَّ آدَمُ مُوسَى» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Huraira reported that God’s messenger told of Adam and Moses holding a disputation in their Lord’s presence and of Adam getting the better of Moses in argument. Moses said, “You are Adam whom God created with His hand, into whom He breathed of His spirit, to whom He made the angels do obeisance, and whom He caused to dwell in His garden; then because of your sin you caused mankind to come down to the earth.” Adam replied, “And you are Moses whom God chose to deliver His messages and to address, to whom He gave the tablets on which everything was explained, and whom He brought near as a confidant. How long before I was created did you find that God has written the Torah?” 1  Moses said, “Forty years.” Adam asked, “Did you find in it, ‘And Adam disobeyed his Lord and erred’?” 2  On being told that he did, he said, “Do you then blame me for doing a deed which God had decreed that I should do forty years before He created me?” God’s messenger said, “So Adam got the better of Moses in argument.” \n\nMuslim transmitted it.\n\n1 At-Taurat, a general name for the first five books of the Old Testament.\n2 These words are in Quran, xx, 121."}},{"id":76,"idInBook":76,"chapterId":1,"bookId":14,"arabic":"عَن عبد الله بن مَسْعُود قَالَ: حَدَّثَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ الصَّادِق المصدوق: «إِن أحدكُم يجمع خلقه فِي بطن أمه أَرْبَعِينَ يَوْمًا ثمَّ يكون فِي ذَلِك علقَة مثل ذَلِك ثمَّ يكون فِي ذَلِك مُضْغَة مثل ذَلِك ثمَّ يُرْسل الْملك فينفخ فِيهِ الرّوح وَيُؤمر بِأَرْبَع كَلِمَات بكتب رزقه وأجله وَعَمله وشقي أَو سعيد فوالذي لَا إِلَه غَيره إِن أحدكُم لَيَعْمَلُ بِعَمَلِ أَهْلِ الْجَنَّةِ حَتَّى مَا يَكُونُ بَيْنَهُ وَبَيْنَهَا إِلَّا ذِرَاعٌ فَيَسْبِقُ عَلَيْهِ الْكِتَابُ فَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ فَيَدْخُلُهَا وَإِنَّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ حَتَّى مَا يَكُونُ بَيْنَهُ وَبَيْنَهَا إِلَّا ذِرَاعٌ فَيَسْبِقُ عَلَيْهِ الْكِتَابُ فَيَعْمَلُ بِعَمَلِ أَهْلِ الْجَنَّةِ فَيَدْخُلُهَا»","english":{"narrator":"Ibn Mas'ud said that God’s messenger who spoke the truth and whose word was believed told them the following:","text":"The constituents of one of you are collected for forty days in his mother’s womb in the form of a drop, then they become a piece of congealed blood for a similar period, then they become a lump of flesh for a similar period. Then God sends to him an angel with four words who records his deeds, the period of his life, his provision, and whether he will be miserable or blessed: thereafter He breathes the spirit into him. By Him other than whom there is no god, one of you will do the deeds of those who go to paradise so that there will be only a cubit between him and it, then what is decreed will overcome him so that he will do the deeds of those who go to hell and will enter it; and one of you will do the deeds of those who go to hell so that there will be only a cubit between him and it, then what is decreed will overcome him so that he will do the deeds of those who go to paradise and will enter it. \n\n(Bukhari and Muslim.)"}},{"id":77,"idInBook":77,"chapterId":1,"bookId":14,"arabic":"وَعَن سهل بن سَعِيدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ الْعَبْدَ لَيَعْمَلُ عَمَلَ أَهْلِ النَّارِ وَإِنَّهُ مِنْ أَهْلِ الْجَنَّةِ وَيَعْمَلُ عَمَلَ أَهْلِ الْجنَّة وَإنَّهُ من أهل النَّار وَإِنَّمَا الْعمَّال بالخواتيم»","english":{"narrator":"","text":"Sahl b. Sa’d reported God’s messenger as saying, “One man does the deeds of those who go to hell but is one of those who go to paradise, and another does the deeds of those who go to paradise but is one of those who go to hell, for judgment is given according to one’s final actions.” \n\n(Bukhari and Muslim)."}},{"id":78,"idInBook":78,"chapterId":1,"bookId":14,"arabic":"عَن عَائِشَة أم الْمُؤمنِينَ قَالَتْ: «دُعِيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى جِنَازَةِ صَبِيٍّ مِنَ الْأَنْصَارِ فَقُلْتُ يَا رَسُولَ اللَّهِ طُوبَى لِهَذَا عُصْفُورٌ مِنْ عَصَافِيرِ الْجَنَّةِ لَمْ يَعْمَلِ السُّوءُ وَلَمْ يُدْرِكْهُ قَالَ أَوَ غَيْرُ ذَلِكِ يَا عَائِشَةُ إِنَّ اللَّهَ خَلَقَ لِلْجَنَّةِ أَهْلًا خَلَقَهُمْ لَهَا وَهُمْ فِي أَصْلَابِ آبَائِهِمْ وَخَلَقَ لِلنَّارِ أَهْلًا خَلَقَهُمْ لَهَا وهم فِي أصلاب آبَائِهِم» . رَوَاهُ مُسلم","english":{"narrator":"‘A’isha said:","text":"God’s messenger was invited to the funeral of a boy who belonged to the Ansar and I said, “Messenger of God, this one is blessed; he is one of the young ones1 in paradise, for he has done no evil, being too young for that.” He replied, “It may be otherwise, ‘A’isha, for God has created some to go to paradise, doing so when they were still in their fathers’ loins; and He has created others for hell, doing so when they were still in their fathers’ loins.” \n\nMuslim transmitted it.\n\n1 Lit. small birds or sparrows."}},{"id":79,"idInBook":79,"chapterId":1,"bookId":14,"arabic":"عَن عَليّ رَضِي الله عَنهُ قَالَ كُنَّا فِي جَنَازَة فِي بَقِيع الْغَرْقَد فَأَتَانَا النَّبِي صلى الله عَلَيْهِ وَسلم فَقعدَ وقعدنا حوله وَمَعَهُ مخصرة فَنَكس فَجعل ينكت بمخصرته ثمَّ قَالَ مَا مِنْكُم من أحد مَا من نفس منفوسة إِلَّا كتب مَكَانهَا من الْجنَّة وَالنَّار وَإِلَّا قد كتب شقية أَو سعيدة فَقَالَ رجل يَا رَسُولَ اللَّهِ أَفَلَا نَتَّكِلُ عَلَى كِتَابِنَا وَنَدع الْعَمَل فَمن كَانَ منا من أهل السَّعَادَة فسيصير إِلَى عمل أهل السَّعَادَة وَأما من كَانَ منا من أهل الشقاوة فسيصير إِلَى عمل أهل الشقاوة قَالَ أما أهل السَّعَادَة فييسرون لعمل السَّعَادَة وَأما أهل الشقاوة فييسرون لِعَمَلِ الشَّقَاوَةِ ثُمَّ قَرَأَ (فَأَمَّا مَنْ أَعْطَى وَاتَّقَى وَصدق بِالْحُسْنَى)\nالْآيَة","english":{"narrator":"","text":"‘Ali reported God’s messenger as saying, “The place which everyone of you will occupy in hell or in paradise has been recorded.” When his hearers asked him whether they should not trust simply in what had been recorded for them and abandon doing good deeds, he replied, “Go on doing them, for everyone is helped to do that for which he was created. Those who are among the number of the blessed will be helped to do appropriate deeds, and those who are among the number of the miserable will be helped to do appropriate deeds.” Then he recited, “As for him who gives, shows piety, and considers what is best to be true, We will help him to prosperity.” 1 \n\n(Bukhari and Muslim.)\n\n1 Quran xcii, 527."}},{"id":80,"idInBook":80,"chapterId":1,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ اللَّهَ كَتَبَ عَلَى ابْنِ آدَمَ حَظَّهُ مِنَ الزِّنَا أَدْرَكَ ذَلِكَ لَا مَحَالَةَ فَزِنَا الْعَيْنِ النَّظَرُ وَزِنَا اللِّسَانِ الْمَنْطِقُ وَالنَّفْسُ تَمَنَّى وَتَشْتَهِي وَالْفَرْجُ يصدق ذَلِك كُله ويكذبه»\nوَفِي رِوَايَةٍ لِمُسْلِمٍ قَالَ: «كُتِبَ عَلَى ابْنِ آدَمَ نَصِيبُهُ مِنَ الزِّنَا مُدْرِكٌ ذَلِكَ لَا محَالة فالعينان زِنَاهُمَا النَّظَرُ وَالْأُذُنَانِ زِنَاهُمَا الِاسْتِمَاعُ وَاللِّسَانُ زِنَاهُ الْكَلَامُ وَالْيَدُ زِنَاهَا الْبَطْشُ وَالرِّجْلُ زِنَاهَا الْخُطَا وَالْقَلْبُ يَهْوَى وَيَتَمَنَّى وَيُصَدِّقُ ذَلِكَ الْفَرْجُ وَيُكَذِّبُهُ»","english":{"narrator":"","text":"Abu Huraira reported God's messenger as saying, “God has decreed for man his portion of fornication which he will inevitably commit. The fornication of the eye consists in looking, and of the tongue in speech. The soul wishes and desires, and the private parts accord with that or reject it.” \n\n(Bukhari and Muslim.) \nIn a version by Muslim he said, “Man’s share of fornication which he will inevitably commit is decreed for him. The fornication of the eyes consists in looking, of the ears in hearing, of the tongue in speech, of the hand in violence, and of the foot in walking. The heart lusts and wishes, and the private parts accord with that or reject it.”"}},{"id":81,"idInBook":81,"chapterId":1,"bookId":14,"arabic":"وَعَن عمرَان بن حضين: إِن رجلَيْنِ من مزينة أَتَيَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَا يَا رَسُولَ اللَّهِ أَرَأَيْتَ مَا يَعْمَلُ النَّاسُ الْيَوْمَ وَيَكْدَحُونَ فِيهِ أَشِيءٌ قُضِيَ عَلَيْهِمْ وَمَضَى فيهم من قدر قد سَبَقَ أَوْ فِيمَا يَسْتَقْبِلُونَ بِهِ مِمَّا أَتَاهُمْ بِهِ نَبِيُّهُمْ وَثَبَتَتِ الْحُجَّةُ عَلَيْهِمْ فَقَالَ لَا بَلْ شَيْءٌ قُضِيَ عَلَيْهِمْ وَمَضَى فِيهِمْ وَتَصْدِيقُ ذَلِكَ فِي كِتَابِ اللَّهِ عَزَّ وَجَلَّ (وَنَفْسٍ وَمَا سواهَا فألهمها فجورها وتقواها)\nرَوَاهُ مُسلم","english":{"narrator":"","text":"‘Imran b, Husain told of two men of Muzaina who said, “Messenger of God, tell us whether what men do to-day and strive over is something which has been destined for them and has previously been decreed for them, or whether it is something their prophet has brought them with which they are encountered and which has become binding upon them.” He replied, “No, it is something which has been destined for them and previously decreed for them.” The verification of that is found in God’s Book which says, “By a soul and Him who formed it and implanted in it its wickedness and its piety.” 1 \n\nMuslim transmitted it.\n\n1 Quran, xci, 7f."}},{"id":82,"idInBook":82,"chapterId":1,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ إِنِّي رَجُلٌ شَابٌّ وَأَنَا أَخَافُ عَلَى نَفْسِي الْعَنَتَ وَلَا أَجِدُ مَا أَتَزَوَّجُ بِهِ النِّسَاءَ كأَنَّهُ يَسْتَأْذِنُهُ فِي الِاخْتِصَاءِ قَالَ: فَسَكَتَ عَنِّي ثُمَّ قُلْتُ مِثْلَ ذَلِكَ فَسَكَتَ عَنِّي ثُمَّ قُلْتُ مِثْلَ ذَلِكَ فَسَكَتَ عَنِّي ثُمَّ قُلْتُ مِثْلَ ذَلِكَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَا أَبَا هُرَيْرَةَ جَفَّ الْقَلَمُ بِمَا أَنْتَ لَاقٍ فَاخْتَصِ على ذَلِك أَو ذَر» . رَوَاهُ البُخَارِيّ","english":{"narrator":"Abu Huraira said:","text":"I told God’s messenger that I, being a young man, was afraid of committing fornication, and I had no means to enable me to marry a wife. (It was as though he was asking permission to have himself made a eunuch.) He gave me no reply, so I repeated what I had said, but he gave me no reply. I repeated it again, but he gave me no reply. I repeated it once more and the Prophet said, “Abu Huraira, the pen has written all it has to write1  about your destiny, so have yourself made a eunuch on that account, or leave things as they are.” \n\nBukhari transmitted it.\n\n1 Lit. “the pen dried up”."}},{"id":83,"idInBook":83,"chapterId":1,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَقُول إِنَّ قُلُوبَ بَنِي آدَمَ كُلِّهَا بَيْنَ أُصْبُعَيْنِ من أَصَابِع الرَّحْمَن كقلب وَاحِد يصرفهُ حَيْثُ يَشَاءُ ثُمَّ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الله مُصَرِّفَ الْقُلُوبِ صَرِّفْ قُلُوبَنَا عَلَى طَاعَتِكَ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"‘Abdallah b. ‘Amr reported God’s messenger as saying, “The hearts of all men are between two of the Compassionate’s fingers as if they were one heart which He turns about as He wills.” Then God’s messenger said, “O God, who turnest the hearts, turn our hearts to Thy obedience!” \n\nMuslim transmitted it."}},{"id":84,"idInBook":84,"chapterId":1,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنهُ كَانَ يحدث قَالَ: قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا مِنْ مَوْلُودٍ إِلَّا يُولَدُ عَلَى الْفِطْرَةِ فَأَبَوَاهُ يُهَوِّدَانِهِ أَوْ يُنَصِّرَانِهِ أَوْ يُمَجِّسَانِهِ كَمَا تُنْتَجُ الْبَهِيمَةُ بَهِيمَةً جَمْعَاءَ هَلْ تُحِسُّونَ فِيهَا مِنْ جَدْعَاءَ ثُمَّ يَقُول أَبُو هُرَيْرَة رَضِي الله عَنهُ (فطْرَة الله الَّتِي فطر النَّاس عَلَيْهَا)\nالْآيَة»","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “Everyone is born a Muslim, but his parents make him a Jew, a Christian, or a Magian; just as a beast is born whole. Do you find some among them  maimed?” Then he was saying, “God’s pattern on which He formed mankind. There is no alteration of God’s creation. That is the true religion.” 1  \n\n(Bukhari and Muslim.)\n\n1 Quran, xxx, 30. It is not quite clear whether these words were recited by the Prophet or by Abu Huraira."}},{"id":85,"idInBook":85,"chapterId":1,"bookId":14,"arabic":"وَعَن أبي مُوسَى قَالَ قَامَ فِينَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِخَمْسِ كَلِمَاتٍ فَقَالَ: «إِنَّ اللَّهَ عز وَجل لَا يَنَامُ وَلَا يَنْبَغِي لَهُ أَنْ يَنَامَ يَخْفِضُ الْقِسْطَ وَيَرْفَعُهُ يُرْفَعُ إِلَيْهِ عَمَلُ اللَّيْلِ قَبْلَ عَمَلِ النَّهَارِ وَعَمَلُ النَّهَارِ قَبْلَ عَمَلِ اللَّيْل حجابه النُّور» . رَوَاهُ مُسلم","english":{"narrator":"Abu'Musa said :","text":"God’s messenger stood up among us and made five statements, saying, “God does not sleep, as it is unfitting that He should do so; He lowers the scale and raises it up; the deeds done by night are taken up to Him before the day’s deeds are done; the deeds done by day before the night’s deeds are done; His veil is light, if He were to remove it His majesty would burn up all His creation which was reached by His glance.” \n\nMuslim transmitted it."}},{"id":86,"idInBook":86,"chapterId":1,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَدُ اللَّهِ مَلْأَى لَا تَغِيضُهَا نَفَقَةٌ سَحَّاءُ اللَّيْلَ وَالنَّهَارَ أَرَأَيْتُمْ مَا أَنْفَقَ مُذْ خَلَقَ السَّمَاءَ وَالْأَرْضَ؟ فَإِنَّهُ لَمْ يَغِضْ مَا فِي يَدِهِ وَكَانَ عَرْشُهُ عَلَى الْمَاءِ وَبِيَدِهِ الْمِيزَانُ يَخْفِضُ وَيرْفَع» وَفِي رِوَايَةٍ لِمُسْلِمٍ: «يَمِينُ اللَّهِ مَلْأَى قَالَ ابْنُ نُمَيْرٍ مَلْآنُ سَحَّاءُ لَا يُغِيضُهَا شَيْءٌ اللَّيْل والنهار»","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “God’s hand is full, undiminished by any expenditure, bountiful night and day. Have you seen what He has expended since He created the heaven and the earth, for what His hand holds has not decreased? His throne was upon the water, and in His hand the scale which He lowers and raises.” \n\n(Bukhari and Muslim.) \nA version by Muslim says, “God’s right hand is full.” Ibn Numair said, “Full and pouring out blessings night and day, being decreased by nothing.”"}},{"id":87,"idInBook":87,"chapterId":1,"bookId":14,"arabic":"وعنه قال : سئل رسول الله صلى الله عليه وسلم عن ذراري المشركين قال : \n\" الله أعلم بما كانوا عاملين \"","english":{"narrator":"","text":"He also reported that when God’s messenger was questioned about the offspring of polytheists he said, “God knows best about what they were doing.” \n\n(Bukhari and Muslim.)"}},{"id":88,"idInBook":88,"chapterId":1,"bookId":14,"arabic":"وَعَن عبَادَة بن الصَّامِت قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم يَقُول «إِنَّ أَوَّلَ مَا خَلَقَ اللَّهُ الْقَلَمُ فَقَالَ اكْتُبْ فَقَالَ مَا أَكْتُبُ قَالَ اكْتُبِ الْقَدَرَ مَا كَانَ وَمَا هُوَ كَائِنٌ إِلَى الْأَبَدِ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ هَذَا حَدِيثٌ غَرِيبٌ إِسْنَادًا","english":{"narrator":"","text":"‘Ubada b. as-Samit reported God’s messenger as saying, “The first thing God created was the pen. He told it to write and when it asked Him what it should write He told it to write what was decreed, so it wrote what had taken place and what would take place to all eternity.” \n\nTirmidhi transmitted it, saying that this is a tradition whose isnad is gharib."}},{"id":89,"idInBook":89,"chapterId":1,"bookId":14,"arabic":"وَعَن مُسلم بن يسَار قَالَ سُئِلَ عُمَرُ بْنُ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ عَنْ هَذِهِ الْآيَةِ (وَإِذْ أَخَذَ رَبُّكَ مِنْ بَنِي آدَمَ مِنْ ظُهُورهمْ)\nقَالَ عُمَرُ بْنُ الْخَطَّابِ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يسْأَل عَنْهَا فَقَالَ: «خلق آدم ثمَّ مسح ظَهره بِيَمِينِهِ فأاستخرج مِنْهُ ذُرِّيَّةً فَقَالَ خَلَقَتُ هَؤُلَاءِ لِلْجَنَّةِ وَبِعَمَلِ أهل الْجنَّة يعْملُونَ ثمَّ مسح ظَهره فَاسْتَخْرَجَ مِنْهُ ذُرِّيَّةً فَقَالَ خَلَقَتُ هَؤُلَاءِ لِلنَّارِ وبعمل أهل النَّار يعْملُونَ فَقَالَ رجل يَا رَسُول الله فَفِيمَ الْعَمَل يَا رَسُول الله قَالَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ إِذَا خَلَقَ الْعَبْدَ لِلْجَنَّةِ اسْتَعْمَلَهُ بِعَمَلِ أهْلِ الْجَنَّةِ حَتَّى يَمُوتَ عَلَى عَمَلٍ من أَعمال أهل الْجنَّة فيدخله الله الْجَنَّةَ وَإِذَا خَلَقَ الْعَبْدَ لِلنَّارِ اسْتَعْمَلَهُ بِعَمَلِ أَهْلِ النَّارِ حَتَّى يَمُوتَ عَلَى عَمَلٍ مِنْ أَعمال أهل النَّار فيدخله الله النَّار» . رَوَاهُ مَالك وَالتِّرْمِذِيّ وَأَبُو دَاوُد","english":{"narrator":"","text":"Muslim b. Yasar said that when ‘Umar b. al-Khattab was questioned about the verse, “When your Lord took their offspring from the backs of the children of Adam...” 1  he replied that he had heard God’s messenger say when he was questioned about it, “God created Adam, then passed His right hand over his back and brought forth from it his offspring, saying, ‘I have created these for paradise and they will do the deeds of those who go to paradise.’ He then passed his hand over his back and brought forth from it his offspring, saying, ‘I have created these for hell and they will do the deeds of those who go to hell’.” A man asked, “What is the good of doing anything, messenger of God?” to which God’s messenger replied, “When God creates a man for paradise He employs him in doing the deeds of those who will go to paradise, so that his final action before death is one of the deeds of those who go to paradise, for which He will bring him into paradise. But when He creates a man for hell He employs him in doing the deeds of those who will go to hell, so that his final action before death is one of the deeds of those who go to hell, for which He will bring him into hell.” \n\nMalik, Tirmidhi and Abu Dawud transmitted it."}},{"id":90,"idInBook":90,"chapterId":1,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ قَالَ: خَرَجَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَفِي يَده كِتَابَانِ فَقَالَ: «أَتَدْرُونَ مَا هَذَانِ الكتابان فَقُلْنَا لَا يَا رَسُولَ اللَّهِ إِلَّا أَنْ تُخْبِرَنَا فَقَالَ لِلَّذِي فِي يَدِهِ الْيُمْنَى هَذَا كِتَابٌ مِنْ رَبِّ الْعَالَمِينَ فِيهِ أَسْمَاءُ أَهْلِ الْجَنَّةِ وَأَسْمَاء آبَائِهِم وقبائلهم ثمَّ أجمل على آخِرهم فَلَا يُزَادُ فِيهِمْ وَلَا يُنْقَصُ مِنْهُمْ أَبَدًا ثُمَّ قَالَ لِلَّذِي فِي شِمَالِهِ هَذَا كِتَابٌ مِنْ رَبِّ الْعَالَمِينَ فِيهِ أَسْمَاءُ أَهْلِ النَّارِ وَأَسْمَاء آبَائِهِم وقبائلهم ثمَّ أجمل على آخِرهم فَلَا يُزَادُ فِيهِمْ وَلَا يُنْقَصُ مِنْهُمْ أَبَدًا فَقَالَ أَصْحَابُهُ فَفِيمَ الْعَمَلُ يَا رَسُولَ اللَّهِ إِنْ كَانَ أَمْرٌ قَدْ فُرِغَ مِنْهُ فَقَالَ سَدِّدُوا وَقَارِبُوا فَإِنَّ صَاحِبَ الْجَنَّةِ يُخْتَمُ لَهُ بِعَمَلِ أَهْلِ الْجَنَّةِ وَإِنْ عَمِلَ أَيَّ عَمَلٍ وَإِنَّ صَاحِبَ النَّارِ يُخْتَمُ لَهُ بِعَمَلِ أَهْلِ النَّارِ وَإِنْ عَمِلَ أَيَّ عَمَلٍ ثُمَّ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِيَدَيْهِ فَنَبَذَهُمَا ثُمَّ قَالَ فَرَغَ رَبُّكُمْ مِنَ الْعِبَادِ فريق فِي الْجنَّة وفريق فِي السعير» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ صَحِيح","english":{"narrator":"‘Abdallah b. ‘Amr said:","text":"God’s messenger came out with two books in his hands and asked, “Do you know what these two books are?” We replied, “No, messenger of God, unless you tell us.” Of the one in his right hand he said, “This is a book from the Lord of the universe containing the names of those who will go to paradise, as well as the names of their fathers and their tribes. It is completed to the last man, so there will never be any increase or diminution in their numbers.” Of the one in his left hand he then said, “This is a book from the Lord of the universe containing the names of those who will go to hell, as well as the names of their fathers and their tribes. It is completed to the last man, so there will never be any increase or diminution in their numbers.” His Companions asked, “What then, messenger of God, is the good of doing anything if the matter is already decided?” He replied, “Follow a right course and keep as near to it as you can, for the last act of one who is to go to paradise will be an act appropriate for those who go to paradise no matter what he may have done; but the last act of one who is to go to hell will be an act appropriate for those who go to hell no matter what he may have done.” God’s messenger then made a gesture with his hands throwing the books away and said, “Your Lord has decided everything about mankind; a section will be in paradise and a section in the blaze.” \n\nTirmidhi transmitted it."}},{"id":91,"idInBook":91,"chapterId":1,"bookId":14,"arabic":"وَعَن أبي خزامة عَن أَبِيه قَالَ سَأَلَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ يَا رَسُولَ اللَّهِ أَرَأَيْتَ رُقًى نَسْتَرْقِيهَا وَدَوَاءً نَتَدَاوَى بِهِ وَتُقَاةً نَتَّقِيهَا هَلْ تَرُدُّ مِنْ قَدَرِ اللَّهِ شَيْئًا قَالَ: «هِيَ مِنْ قَدَرِ الله» . رَوَاهُ أَحْمد وَالتِّرْمِذِيّ وَابْن مَاجَه","english":{"narrator":"","text":"Abu Khizama said that his father asked God’s messenger, “Tell me whether spells we invoke, medicine we apply and caution we practise can avert anything God has decreed.” He replied, “They are a part of God’s decree ’ \n\nAhmad, Tirmidhi and Ibn Majah transmitted it."}},{"id":92,"idInBook":92,"chapterId":1,"bookId":14,"arabic":"وَعَن أبي هُرَيْرَة قَالَ: خَرَجَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ نَتَنَازَعُ فِي الْقَدَرِ فَغَضِبَ حَتَّى احْمَرَّ وَجْهُهُ حَتَّى كَأَنَّمَا فُقِئَ فِي وجنتيه الرُّمَّانِ فَقَالَ أَبِهَذَا: «أُمِرْتُمْ أَمْ بِهَذَا أُرْسِلْتُ إِلَيْكُمْ إِنَّمَا هَلَكَ مَنْ كَانَ قَبْلُكُمْ حِينَ تنازعوا فِي هَذَا الْأَمر عزمت عَلَيْكُم أَلا تتنازعوا فِيهِ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ من حَدِيث صَالح المري وَله غرائب يتفرد بهَا لَا يُتَابع عَلَيْهَا قلت: لَكِن يشْهد لَهُ الَّذِي بعده\nوروى ابْن مَاجَه فِي الْقدر نَحْوَهُ عَنْ عَمْرٍو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ","english":{"narrator":"Abu Huraira said:","text":"God’s messenger came out to us when we were arguing about God’s decree. He was angry and his face became so red that it looked as if pomegranate seeds had been burst open on his cheeks. He then said, “Is this what you were commanded to do, or was it for this purpose that I was sent to you? Your predecessors perished only when they argued about this matter. I adjure you, I adjure you, not to argue about it.” \n\nTirmidhi transmitted it, and Ibn Majah transmitted something similar from ‘Amr b. Shu'aib from his father from his grandfather."}},{"id":93,"idInBook":93,"chapterId":1,"bookId":14,"arabic":"وَعَنْ أَبِي مُوسَى قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِنَّ اللَّهَ خَلَقَ آدَمَ مِنْ قَبْضَةٍ قَبَضَهَا مِنْ جَمِيعِ الْأَرْضِ فَجَاءَ بَنُو آدَمَ عَلَى قَدْرِ الْأَرْضِ مِنْهُمُ الْأَحْمَرُ وَالْأَبْيَضُ وَالْأَسْوَدُ وَبَيْنَ ذَلِكَ وَالسَّهْلُ وَالْحَزْنُ وَالْخَبِيثُ وَالطَّيِّبُ» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَأَبُو دَاوُد","english":{"narrator":"","text":"Abu Musa reported that he heard God’s messenger say, “God created Adam from a handful which he took from the whole of the earth; so the children of Adam are in accordance with the earth, some red, some white, some black, some a mixture, also smooth and rough, bad and good.” \n\nAhmad, Tirmidhi and Abu Dawud transmitted it."}},{"id":94,"idInBook":94,"chapterId":1,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٌو قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: \n\" إِنَّ اللَّهَ خَلَقَ خَلْقَهُ فِي ظُلْمَةٍ فَأَلْقَى عَلَيْهِمْ مِنْ نُورِهِ فَمَنْ أَصَابَهُ مِنْ ذَلِكَ النُّورِ اهْتَدَى وَمَنْ أَخْطَأَهُ ضَلَّ فَلذَلِك أَقُول: جف الْقلب على علم الله \". رَوَاهُ أَحْمد وَالتِّرْمِذِيّ","english":{"narrator":"","text":"‘Abdallah b. ‘Amr reported that he heard God’s messenger say, “God created His creatures in darkness and cast some of His light upon them. Those on whom some of that light falls will have guidance, but those who are missed by it will go astray. On that account I say that the pen has no more to write about God’s knowledge.” \n\nAhmad and Tirmidhi transmitted it."}},{"id":95,"idInBook":95,"chapterId":1,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُكْثِرُ أَنْ يَقُولَ: «يَا مُقَلِّبَ الْقُلُوبِ ثَبِّتْ قَلْبِي عَلَى دِينِكَ» فَقُلْتُ: يَا نَبِيَّ اللَّهِ آمَنَّا بِكَ وَبِمَا جِئْتَ بِهِ فَهَلْ تَخَافُ عَلَيْنَا؟ قَالَ: «نَعَمْ إِنَّ الْقُلُوبَ بَيْنَ أُصْبُعَيْنِ مِنْ أَصَابِعِ اللَّهِ يُقَلِّبُهَا كَيْفَ يَشَاءُ» . رَوَاهُ التِّرْمِذِيّ وَابْن مَاجَه","english":{"narrator":"","text":"Anas reported that God’s messenger often said, “O Thou who turnest the hearts about, establish my heart in Thy religion.” Anas said, “Prophet of God, do you fear for us who believe in you and in your message?” He replied, “Yes. The hearts are between two of God’s fingers and He turns them about as He wills.” \n\nTirmidhi and Ibn Majah transmitted it."}},{"id":96,"idInBook":96,"chapterId":1,"bookId":14,"arabic":"وَعَنْ أَبِي مُوسَى قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَثَلُ الْقَلْبِ كَرِيشَةٍ بِأَرْضِ فَلَاةٍ يُقَلِّبُهَا الرِّيَاحُ ظَهْرًا لِبَطْنٍ» . رَوَاهُ أَحْمد","english":{"narrator":"","text":"Abu Musa reported that God’s messenger said, “The heart is like a feather in desert country which the winds keep turning over and over.”\n \nAhmad transmitted it."}},{"id":97,"idInBook":97,"chapterId":1,"bookId":14,"arabic":"وَعَنْ عَلِيٍّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" لَا يُؤْمِنُ عَبْدٌ حَتَّى يُؤْمِنَ بِأَرْبَعٍ: يَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنِّي رَسُولُ اللَّهِ بَعَثَنِي بِالْحَقِّ وَيُؤْمِنُ بِالْمَوْتِ وَالْبَعْثِ بَعْدَ الْمَوْتِ وَيُؤْمِنُ بِالْقَدَرِ \". رَوَاهُ التِّرْمِذِيُّ وَابْن مَاجَه","english":{"narrator":"‘Ali reported that God’s messenger said, “A man is not a believer till he believes in four things :","text":"he must testify that there is no god but God and that I am God’s messenger whom He sent with the truth ; he must believe in death and in the resurrection after death; and he must believe in the divine decree.\" \n\nTirmidhi and Ibn Majah transmitted it."}},{"id":98,"idInBook":98,"chapterId":1,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" صِنْفَانِ مِنْ أُمَّتِي لَيْسَ لَهُمَا فِي الْإِسْلَامِ نَصِيبٌ: الْمُرْجِئَةُ وَالْقَدَرِيَّةُ \". رَوَاهُ التِّرْمِذِيُّ وَقَالَ هَذَا حَدِيثٌ غَرِيبٌ","english":{"narrator":"","text":"Ibn ‘Abbas reported that God’s messenger said, “There are two classes among my people who have no portion in Islam, the Murji’a and the Qadariya.\" \n\nTirmidhi transmitted it and said this is a gharib tradition."}},{"id":99,"idInBook":99,"chapterId":1,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «يَكُونُ فِي أُمَّتِي خَسْفٌ وَمَسْخٌ وَذَلِكَ فِي الْمُكَذِّبِينَ بِالْقَدَرِ» . رَوَاهُ أَبُو دَاوُدَ وروى التِّرْمِذِيّ نَحوه","english":{"narrator":"Ibn ‘Umar said:","text":"I heard God’s messenger say, “Some of my people will be swallowed up and some will be metamorphosed. That will come about among those who declare God’s decree to be false.\" \n\nAbu Dawud transmitted it and Tirmidhi transmitted something similar."}},{"id":100,"idInBook":100,"chapterId":1,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْقَدَرِيَّةُ مَجُوسُ هَذِهِ الْأُمَّةِ إِنْ مَرِضُوا فَلَا تَعُودُوهُمْ وَإِنْ مَاتُوا فَلَا تشهدوهم» . رَوَاهُ أَحْمد وَأَبُو دَاوُد","english":{"narrator":"","text":"He also reported God’s messenger as saying, “The Qadariya are the Magians of this people. If they are ill, do not visit them, and if they die, do not attend their funerals.\" \n\nAhmad and Abu Dawud transmitted it."}},{"id":101,"idInBook":101,"chapterId":1,"bookId":14,"arabic":"وَعَنْ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تُجَالِسُوا أَهْلَ الْقَدَرِ وَلَا تفاتحوهم» رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"‘Umar reported God’s messenger as saying, “Do not sit with those who believe in freewill and do not address them before they address you.\" \n\nAbu Dawud transmitted it."}},{"id":102,"idInBook":102,"chapterId":1,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" سِتَّةٌ لَعَنْتُهُمْ وَلَعَنَهُمُ اللَّهُ وَكُلُّ نَبِيٍّ يُجَابُ: الزَّائِدُ فِي كِتَابِ اللَّهِ وَالْمُكَذِّبُ بِقَدَرِ اللَّهِ وَالْمُتَسَلِّطُ بِالْجَبَرُوتِ لِيُعِزَّ مَنْ أَذَلَّهُ اللَّهُ وَيُذِلَّ مَنْ أَعَزَّهُ اللَّهُ وَالْمُسْتَحِلُّ لِحَرَمِ اللَّهِ وَالْمُسْتَحِلُّ مِنْ عِتْرَتِي مَا حَرَّمَ اللَّهُ وَالتَّارِكُ لِسُنَّتِي \". رَوَاهُ الْبَيْهَقِيّ فِي الْمدْخل ورزين فِي كِتَابه","english":{"narrator":"‘A’isha reported that God’s messenger said, “There are six whom I have cursed, whom I pray that God may curse, and every prophet’s prayer is answered:","text":"He who makes additions to God’s Book, he who declares God’s decree to be false, he who rules proudly to exalt him whom God has humbled and humble him whom God has exalted, he who profanes God’s sacred area, he who considers he may do to my family what God has declared forbidden, and he who abandons my sunna.” \n\nBaihaqi transmitted it in the introduction and Razin in his book."}},{"id":103,"idInBook":103,"chapterId":1,"bookId":14,"arabic":"وَعَن مطر بن عكام قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا قَضَى اللَّهُ لِعَبْدٍ أَنْ يَمُوتَ بِأَرْضٍ جَعَلَ لَهُ إِلَيْهَا حَاجَةً» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيّ","english":{"narrator":"","text":"Matar b. ‘Ukamis reported God’s messenger as saying, “When God decrees that someone should die in a certain land, He gives him a reason for going there.\" \n\nAhmad and Tirmidhi transmitted it."}},{"id":104,"idInBook":104,"chapterId":1,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: قُلْتُ: يَا رَسُولَ اللَّهِ ذَرَارِيُّ الْمُؤْمِنِينَ؟ قَالَ: «مِنْ آبَائِهِمْ» . فَقُلْتُ: يَا رَسُولَ اللَّهِ بِلَا عَمَلٍ؟ قَالَ: «اللَّهُ أَعْلَمُ بِمَا كَانُوا عَامِلِينَ» . قُلْتُ فذاراري الْمُشْرِكِينَ؟ قَالَ: «مِنْ آبَائِهِمْ» . قُلْتُ: بِلَا عَمَلٍ؟ قَالَ: «اللَّهُ أَعْلَمُ بِمَا كَانُوا عَامِلِينَ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"‘A’isha said:","text":"I asked, “Messenger of God, what happens to the offspring of believers?’’ He replied, “They are joined to their parents.\" I asked, “Although they have done nothing, messenger of God” lie replied, “God knows best what they were doing.” I asked, “What happens to the offspring of polytheists?” He replied, “They are joined to their parents.” I asked, “Although they have done nothing?” He replied, “God knows best what they were doing.” \n\nAbu Dawud transmitted it."}},{"id":105,"idInBook":105,"chapterId":1,"bookId":14,"arabic":"وَعَنِ ابْنِ مَسْعُودٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: الوائدة والموؤدة فِي النَّار \". رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Ibn Mas'ud reported God’s messenger as saying, “The one who buries her daughter alive and the one who is buried alive go to hell.” \n\nAbu Dawud transmitted it."}},{"id":106,"idInBook":106,"chapterId":1,"bookId":14,"arabic":"عَن أبي الدرداد قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" إِنَّ اللَّهَ عَزَّ وَجَلَّ فَرَغَ إِلَى كُلِّ عَبْدٍ مِنْ خَلْقِهِ مِنْ خَمْسٍ: مِنْ أَجَلِهِ وَعَمَلِهِ وَمَضْجَعِهِ وَأَثَرِهِ وَرِزْقِهِ \". رَوَاهُ أَحْمَدُ","english":{"narrator":"Abud Darda' reported God’s messenger as saying, “God has preordained five things for every man He has created:","text":"his period of life, his action, his lying down, his moving about, and his provision.” \n\nAhmad transmitted it."}},{"id":107,"idInBook":107,"chapterId":1,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنْ تَكَلَّمَ فِي شَيْءٍ مِنَ الْقَدَرِ سُئِلَ عَنْهُ يَوْمَ الْقِيَامَةِ وَمَنْ لَمْ يَتَكَلَّمْ فِيهِ لم يسْأَل عَنهُ» . رَوَاهُ ابْن مَاجَه","english":{"narrator":"","text":"‘A’isha said that she heard God’s messenger say, “He who discusses any aspect of God’s decree will be questioned about it on the day of resurrection, but he who does not discuss it will not be questioned about it.” \n\nIbn Majah transmitted it."}},{"id":108,"idInBook":108,"chapterId":1,"bookId":14,"arabic":"وَعَنِ ابْنِ الدَّيْلَمِيِّ قَالَ: أَتَيْتُ أُبَيَّ بْنَ كَعْبٍ فَقُلْتُ لَهُ: قَدْ وَقَعَ فِي نَفْسِي شَيْء من الْقدر فَحَدثني بِشَيْء لَعَلَّ الله أَن يذهبه من قلبِي قَالَ لَو أَن الله عَذَّبَ أَهْلَ سَمَاوَاتِهِ وأَهْلَ أَرْضِهِ عَذَّبَهُمْ وَهُوَ غَيْرُ ظَالِمٍ لَهُمْ وَلَوْ رَحِمَهُمْ كَانَتْ رَحْمَتُهُ خَيْرًا لَهُمْ مِنْ أَعْمَالِهِمْ وَلَوْ أَنْفَقْتَ مِثْلَ أُحُدٍ ذَهَبًا فِي سَبِيلِ اللَّهِ مَا قَبِلَهُ اللَّهُ مِنْكَ حَتَّى تُؤْمِنَ بِالْقَدَرِ وَتَعْلَمَ أَنَّ مَا أَصَابَكَ لَمْ يَكُنْ لِيُخْطِئَكَ وَأَنَّ مَا أَخْطَأَكَ لَمْ يَكُنْ لِيُصِيبَكَ وَلَوْ مُتَّ عَلَى غَيْرِ هَذَا لَدَخَلْتَ النَّارَ قَالَ ثُمَّ أَتَيْتُ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ فَقَالَ مِثْلَ ذَلِكَ قَالَ ثُمَّ أَتَيْتُ حُذَيْفَةَ بْنَ الْيَمَانِ فَقَالَ مثل ذَلِك قَالَ ثُمَّ أَتَيْتُ زَيْدَ بْنَ ثَابِتٍ فَحَدَّثَنِي عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَ ذَلِكَ. رَوَاهُ أَحْمَدُ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ","english":{"narrator":"Ibn ad-Dailami said:","text":"I went to Ubayy b. Ka‘b and said to him, “I am confused about the divine decree, so tell me something by means of which God may remove the confusion from my mind.” He replied, “Were God to punish everyone in the heavens and the earth He would do so without being unjust to them, and were He to show mercy to them His mercy would be much better than their actions merited. Were you to spend in support of God’s cause an amount of gold equivalent to Uhud, God would not accept it from you till you believed in the divine decree and knew that what has come to you could not miss you and that what has missed you could not come to you. Were you to die believing anything else you would enter hell.” He said: I then went to ‘Abdallah b. Mas'ud and he said something to the same effect. I next went to Hudhaifa b. al-Yaman and he said something to the same effect. I next went to Zaid b. Thabit and he told me something from the Prophet to the same effect. \n\nAhmad, Abu Dawud and Ibn Majah transmitted it."}},{"id":109,"idInBook":109,"chapterId":1,"bookId":14,"arabic":"عَن نَافِع أَن ابْن عمر جَاءَهُ رجل فَقَالَ إِنَّ فُلَانًا يَقْرَأُ عَلَيْكَ السَّلَامَ فَقَالَ لَهُ إِنَّهُ بَلَغَنِي أَنَّهُ قَدْ أَحْدَثَ فَإِنْ كَانَ قَدْ أَحْدَثَ فَلَا تُقْرِئْهُ مِنِّي السَّلَامَ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُول يكون فِي هَذِه الْأمة أَو فِي أمتِي الشَّك مِنْهُ خَسْفٌ أَوْ مَسْخٌ أَوْ قَذْفٌ فِي أَهْلِ الْقَدَرِ. رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ","english":{"narrator":"","text":"Nafi' told how a man came to Ibn ‘Umar with a message that so and so sent him a greeting. He replied that he had heard he had introduced an innovation and that if that were so, he was not to convey his greeting to him, for he had heard God’s messenger say, “Among my people,” or “among this people the believers in freewill will be swallowed up and metamorphosed or pelted.” \n\nTirmidhi, Abu Dawud, and Ibn Majah transmitted it, and Tirmidhi said this is a hasan sahih gharib tradition."}},{"id":110,"idInBook":110,"chapterId":1,"bookId":14,"arabic":"عَن عَليّ رَضِي الله عَنهُ قَالَ سَأَلت خَدِيجَة النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ وَلَدَيْنِ مَاتَا لَهَا فِي الْجَاهِلِيَّةِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" هُمَا فِي النَّارِ قَالَ فَلَمَّا رأى الْكَرَاهِيَة فِي وَجْهِهَا قَالَ لَوْ رَأَيْتِ مَكَانَهُمَا لَأَبْغَضْتِهِمَا قَالَتْ يَا رَسُولَ اللَّهِ فَوَلَدِي مِنْكَ قَالَ فِي الْجنَّة قَالَ ثُمَّ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ الْمُؤْمِنِينَ وَأَوْلَادَهُمْ فِي الْجَنَّةِ وَإِنَّ الْمُشْرِكِينَ وَأَوْلَادَهُمْ فِي النَّارِ ثُمَّ قَرَأَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ (وَالَّذِينَ آمَنُوا وَاتَّبَعَتْهُمْ ذُرِّيَّتُهُمْ بِإِيمَانٍ أَلْحَقْنَا بِهِمْ ذرياتهم)","english":{"narrator":"","text":"‘Ali said that Khadija asked the Prophet about two children of hers who had died in the pre-Islamic period and God’s messenger replied, “They are in hell.” Then when he saw her look of disapproval he said, “If you saw their position you would hate them.” She asked, “Messenger of God, what about my son whom I had from you?” He replied, “He is in paradise.” Then God’s messenger said, “The believers and their children are in paradise and the polytheists and their children are in hell.” Then God’s messenger recited, “Those who believe and whose offspring have followed them.” \n\nAhmad transmitted it."}},{"id":111,"idInBook":111,"chapterId":1,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَمَّا خَلَقَ اللَّهُ آدم مسح ظَهره فَسقط من ظَهْرِهِ كُلُّ نَسَمَةٍ هُوَ خَالِقُهَا مِنْ ذُرِّيَّتِهِ إِلَى يَوْمِ الْقِيَامَةِ وَجَعَلَ بَيْنَ عَيْنَيْ كُلِّ إِنْسَانٍ مِنْهُمْ وَبِيصًا مِنْ نُورٍ ثُمَّ عَرَضَهُمْ عَلَى آدَمَ فَقَالَ أَيْ رَبِّ مَنْ هَؤُلَاءِ قَالَ هَؤُلَاءِ ذُرِّيَّتُكَ فَرَأَى رَجُلًا مِنْهُمْ فَأَعْجَبَهُ وَبِيصُ مَا بَين عَيْنَيْهِ فَقَالَ أَي رب من هَذَا فَقَالَ هَذَا رجل من آخر الْأُمَم من ذريتك يُقَال لَهُ دَاوُدُ فَقَالَ رَبِّ كَمْ جَعَلْتَ عُمُرَهُ قَالَ سِتِّينَ سنة قَالَ أَي رب زده من عمري أَرْبَعِينَ سنة فَلَمَّا قضي عمر آدم جَاءَهُ ملك الْمَوْت فَقَالَ أَوَلَمْ يَبْقَ مِنْ عُمُرِي أَرْبَعُونَ سَنَةً قَالَ أولم تعطها ابْنك دَاوُد قَالَ فَجحد آدم فَجحدت ذُريَّته وَنسي آدم فنسيت ذُريَّته وخطئ آدم فخطئت ذُريَّته» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “When God created Adam He wiped his back and every soul of his offspring He was to create up to the day of resurrection fell from his back. He put on the forehead of everyone of them a flash of light, then presented them to Adam who asked, ‘My Lord, who are these?’ He replied, ‘Your offspring.' On seeing one of them and being charmed by the flash on his forehead he asked, ‘My Lord, who is this?’ He replied, ‘David.’ He asked, ‘My Lord, how long a term of life hast Thou appointed him?” He replied, ‘Sixty years.’ He said, ‘My Lord, give him an extra forty years out of my term of life.’” God’s messenger said, “When Adam’s period of life all but forty years had come to an end the angel of death came to him. Adam said, ‘Are there not forty years of my life remaining?’ He replied, ‘Did you not give them to your son David?' Adam denied it and his offspring denied; Adam forgot and ate of the tree and his offspring forgot; and Adam sinned and his offspring sinned.” \n\nTirmidhi transmitted it."}},{"id":112,"idInBook":112,"chapterId":1,"bookId":14,"arabic":"وَعَنْ أَبِي الدَّرْدَاءَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «خَلَقَ اللَّهُ آدَمَ حِينَ خَلَقَهُ فَضَرَبَ كَتِفَهُ الْيُمْنَى فَأَخْرَجَ ذُرِّيَّةً بَيْضَاءَ كَأَنَّهُمُ الذَّرُّ وَضَرَبَ كَتِفَهُ الْيُسْرَى فَأَخْرَجَ ذُرِّيَّةً سَوْدَاءَ كَأَنَّهُمُ الْحُمَمُ فَقَالَ لِلَّذِي فِي يَمِينِهِ إِلَى الْجَنَّةِ وَلَا أُبَالِي وَقَالَ للَّذي فِي كَفه الْيُسْرَى إِلَى النَّارِ وَلَا أُبَالِي» . رَوَاهُ أَحْمَدُ","english":{"narrator":"","text":"Abud Darda' reported God’s messenger as saying, “God created Adam when He created him and struck his right shoulder and brought forth his offspring white like small ants. And he struck his left shoulder and brought forth his offspring black as though they were charcoal. Then He said to the party on his right side, ‘To paradise, and I do not care’ and He said to the party in his left shoulder, ‘To hell, and I do not care’.”\n\nAhmad transmitted it."}},{"id":113,"idInBook":113,"chapterId":1,"bookId":14,"arabic":"وَعَن أبي نَضرة أَنَّ رَجُلًا مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُقَالُ لَهُ أَبُو عَبْدِ اللَّهِ دَخَلَ عَلَيْهِ أَصْحَابُهُ يَعُودُونَهُ وَهُوَ يَبْكِي فَقَالُوا لَهُ مَا يُبْكِيكَ أَلَمْ يَقُلْ لَكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خُذْ مِنْ شَارِبِكَ ثُمَّ أَقِرَّهُ حَتَّى تَلْقَانِي قَالَ بَلَى وَلَكِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِنَّ اللَّهَ عَزَّ وَجَلَّ قَبَضَ بِيَمِينِهِ قَبْضَةً وَأُخْرَى بِالْيَدِ الْأُخْرَى وَقَالَ هَذِهِ لِهَذِهِ وَهَذِه لهَذِهِ وَلَا أُبَالِي فَلَا أَدْرِي فِي أَيِّ الْقَبْضَتَيْنِ أَنَا» . رَوَاهُ أَحْمَدُ","english":{"narrator":"","text":"Abu Nadra told how a companion of the Prophet called Abu ‘Abdallah was visited by his friends who found him weeping. They asked him what made him weep, and whether God’s messenger had not told him to clip some of his moustache and keep it like that till he met him. He replied, “Yes, but I heard God’s messenger say that God took a handful in His right hand and another in His left saying, ‘This is for this, and that is for that, and I do not care;’ and I do not know in which of the two handfuls I am.” \n\nAhmad transmitted it."}},{"id":114,"idInBook":114,"chapterId":1,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \" أَخذ الله الْمِيثَاق من ظهر آدم بنعمان يَعْنِي عَرَفَة فَأخْرج من صلبه كل ذُرِّيَّة ذَرَاهَا فَنَثَرَهُمْ بَيْنَ يَدَيْهِ كَالذَّرِّ ثُمَّ كَلَّمَهُمْ قِبَلًا قَالَ: (أَلَسْتُ بِرَبِّكُمْ قَالُوا بَلَى شَهِدْنَا أَنْ تَقُولُوا يَوْمَ الْقِيَامَةِ إِنَّا كُنَّا عَنْ هَذَا غافلين أَوْ تَقُولُوا إِنَّمَا أَشْرَكَ آبَاؤُنَا مِنْ قَبْلُ وَكُنَّا ذُرِّيَّةً مِنْ بَعْدِهِمْ أَفَتُهْلِكُنَا بِمَا فَعَلَ المبطلون)\nرَوَاهُ أَحْمد","english":{"narrator":"Ibn ‘Abbas reported the Prophet as saying:","text":"God made the covenant from Adam’s back in Na‘man, i.e. ‘Arafa, and brought forth from his loins all his offspring whom He created and scattered before Him like small ants. He then spoke to them face to face saying, “Am I not your Lord?’ They replied, “Yes, we testify this.”  lest you should say on the day of resurrection, “We were neglectful of this,” or should say, “Our fathers were polytheists before us and we were an offspring after them. Wilt Thou destroy us for what the workers of vanity did?” 1\n\nAhmad transmitted it.\n\n1 Quran, vii, 172f."}},{"id":115,"idInBook":115,"chapterId":1,"bookId":14,"arabic":"عَن أبي بن كَعْب فِي قَوْلِ اللَّهِ عَزَّ وَجَلَّ (وَإِذْ أَخَذَ رَبُّكَ مِنْ بَنِي آدَمَ مِنْ ظُهُورهمْ ذرياتهم وأشهدهم على أنفسهم)\nالْآيَة قَالَ جمعهم فجعلهم أرواحا ثُمَّ صَوَّرَهُمْ فَاسْتَنْطَقَهُمْ فَتَكَلَّمُوا ثُمَّ أَخَذَ عَلَيْهِمُ الْعَهْدَ وَالْمِيثَاقَ وَأَشْهَدَهُمْ عَلَى أَنْفُسِهِمْ أَلَسْتُ بِرَبِّكُمْ قَالَ فَإِنِّي أشهد عَلَيْكُم السَّمَوَات السَّبْعَ وَالْأَرَضِينَ السَّبْعَ وَأُشْهِدُ عَلَيْكُمْ أَبَاكُمْ آدَمَ عَلَيْهِ السَّلَام أَنْ تَقُولُوا يَوْمَ الْقِيَامَةِ لَمْ نَعْلَمْ بِهَذَا اعْلَمُوا أَنَّهُ لَا إِلَهَ غَيْرِي وَلَا رَبَّ غَيْرِي فَلَا تُشْرِكُوا بِي شَيْئا وَإِنِّي سَأُرْسِلُ إِلَيْكُمْ رُسُلِي يُذَكِّرُونَكُمْ عَهْدِي وَمِيثَاقِي وَأُنْزِلُ عَلَيْكُمْ كُتُبِي قَالُوا شَهِدْنَا بِأَنَّكَ رَبُّنَا وَإِلَهُنَا لَا رب لَنَا غَيْرُكَ فَأَقَرُّوا بِذَلِكَ وَرُفِعَ عَلَيْهِمْ آدَمُ يَنْظُرُ إِلَيْهِمْ فَرَأَى الْغَنِيَّ وَالْفَقِيرَ وَحَسَنَ الصُّورَةِ وَدُونَ ذَلِكَ فَقَالَ رَبِّ لَوْلَا سَوَّيْتَ بَيْنَ عِبَادِكَ قَالَ إِنِّي أَحْبَبْتُ أَنْ أَشْكُرَ وَرَأَى الْأَنْبِيَاءَ فِيهِمْ مِثْلَ السُّرُجِ عَلَيْهِمُ النُّورُ خُصُّوا بِمِيثَاقٍ آخَرَ فِي الرِّسَالَةِ وَالنُّبُوَّةِ وَهُوَ قَوْلُهُ تَعَالَى (وَإِذ أَخذنَا من النَّبِيين ميثاقهم)\nإِلَى قَوْله (عِيسَى ابْن مَرْيَم)\nكَانَ فِي تِلْكَ الْأَرْوَاحِ فَأَرْسَلَهُ إِلَى مَرْيَمَ فَحُدِّثَ عَنْ أُبَيٍّ أَنَّهُ دَخَلَ مِنْ فِيهَا. رَوَاهُ أَحْمد","english":{"narrator":"On God’s words, “When your Lord took from the children of Adam from their backs their offspring,” 1 Ubayy b. Ka‘b said:","text":"He gathered them and put them in pairs. Thereafter He fashioned them and endowed them with speech, and they spoke. He then made an agreement and covenant with them, calling them to witness regarding themselves,  “Am I not your Lord?” They replied, “Yes.” He said, “I call the seven heavens and the seven earths to witness regarding you, and I call your father Adam to witness regarding you, lest you should say on the day of resurrection, ‘We did not know of this.’ Know that there is no god other than me and no lord other than me, and do not associate anything with me. I shall send to you my messengers to call to your remembrance my agreement and my covenant, and I shall send down my books to you. They replied, “We testify that Thou art our Lord and our God; we have no other lord and no other god but Thee.” So they confirmed that. Adam was raised above them and looked at them, and seeing the rich and the poor, the beautiful and those not so beautiful, he asked, “My Lord, why didst Thou not make Thy servants equal?” He replied, “I wanted to be thanked.” He also saw among them the prophets like lamps with light in them. They had another -special covenant concerning their mission and prophetic office, viz. His words, “And when we took from the prophets their covenant... Jesus son-of Mary.” 2 He was among those spirits and He sent him to Mary. Ubayy is quoted as saying that he entered by her mouth. \n\nAhmad transmitted it.\n\n1 ibid.\n2 Quran, xxxiii, 7."}},{"id":116,"idInBook":116,"chapterId":1,"bookId":14,"arabic":"وَعَنْ أَبِي الدَّرْدَاءِ قَالَ بَيْنَمَا نَحْنُ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَتَذَاكَرُ مَا يَكُونُ إِذْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:\nإِذَا سَمِعْتُمْ بِجَبَلٍ زَالَ عَن مَكَانَهُ فصدقوا وَإِذَا سَمِعْتُمْ بِرَجُلٍ تَغَيَّرَ عَنْ خُلُقِهِ فَلَا تصدقوا بِهِ وَإنَّهُ يَصِيرُ إِلَى مَا جُبِلَ عَلَيْهِ \". رَوَاهُ أَحْمَدُ","english":{"narrator":"Abud Darda’ said:","text":"While we were with God’s messenger discussing what would come to pass God’s messenger said, “When you hear that a mountain has moved from its place believe it; but when you hear that a man's nature has changed do not believe it, for he will remain true to his inborn disposition.” \n\nAhmad transmitted it."}},{"id":117,"idInBook":117,"chapterId":1,"bookId":14,"arabic":"وَعَن أم سَلمَة يَا رَسُول الله لَا يزَال يصيبك كُلِّ عَامٍ وَجَعٌ مِنَ الشَّاةِ الْمَسْمُومَةِ الَّتِي أَكَلْتَ قَالَ: «مَا أَصَابَنِي شَيْءٌ مِنْهَا إِلَّا وَهُوَ مَكْتُوبٌ عَلَيَّ وَآدَمُ فِي طِينَتِهِ» . رَوَاهُ ابْنُ مَاجَهْ","english":{"narrator":"","text":"Umm Salama said, “Messenger of God, you continue to be afflicted annually with pain from the poisoned sheep you ate.” He replied, “I am afflicted by nothing due to it which was not decreed for me while Adam was still a lump of clay.” \n\nIbn Majah transmitted it."}},{"id":118,"idInBook":118,"chapterId":1,"bookId":14,"arabic":"عَن الْبَرَاءِ بْنِ عَازِبٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \" الْمُسْلِمُ إِذَا سُئِلَ فِي الْقَبْرِ يَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ فَذَلِكَ قَوْلُهُ (يُثَبِّتُ اللَّهُ الَّذِينَ آمَنُوا بِالْقَوْلِ الثَّابِتِ فِي الْحَيَاةِ الدُّنْيَا وَفِي الْآخِرَة)\nوَفِي رِوَايَةٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: (يُثَبِّتُ اللَّهُ الَّذِينَ آمَنُوا بِالْقَوْلِ الثَّابِت)\nنَزَلَتْ فِي عَذَابِ الْقَبْرِ يُقَالُ لَهُ: مَنْ رَبك؟ فَيَقُول: رَبِّي الله ونبيي مُحَمَّد","english":{"narrator":"Al-Bara’ b. ‘Azib reported the Prophet as saying, “When a Muslim is questioned in the grave he testifies that there is no god but God and that Muhammad is God’s messenger.” That is verified by God’s words, “God establishes those who believe with the word that stands firm in this world and the next.” 1 In a version the Prophet said:","text":"“God establishes those who believe with the word which stands firm” was revealed concerning the punishment in the grave. One will be asked who his Lord is and will reply that his Lord is God and his prophet is Muhammad. \n\n(Bukhari and Muslim.)\n\n1 Quran, xiv, 27."}},{"id":119,"idInBook":119,"chapterId":1,"bookId":14,"arabic":"عَنْ أَنَسِ بْنِ مَالِكٍ رَضِيَ اللَّهُ عَنْهُ أَنه حَدثهمْ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ الْعَبْدَ إِذَا وُضِعَ فِي قَبْرِهِ وَتَوَلَّى عَنْهُ أَصْحَابُهُ وَإِنَّهُ لَيَسْمَعُ قَرْعَ نِعَالِهِمْ أَتَاهُ مَلَكَانِ فَيُقْعِدَانِهِ فَيَقُولَانِ مَا كُنْتَ تَقُولُ فِي هَذَا الرَّجُلِ لِمُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَّا الْمُؤْمِنُ فَيَقُولُ أَشْهَدُ أَنَّهُ عَبْدُ اللَّهِ وَرَسُولُهُ فَيُقَالُ لَهُ انْظُرْ إِلَى مَقْعَدِكَ مِنَ النَّارِ قَدْ أَبْدَلَكَ اللَّهُ بِهِ مَقْعَدًا مِنَ الْجنَّة فَيَرَاهُمَا جَمِيعًا قَالَ قَتَادَة وَذكر لنا أَنه يفسح لَهُ فِي قَبره ثمَّ رَجَعَ إِلَى حَدِيث أنس قَالَ وَأَمَّا الْمُنَافِقُ وَالْكَافِرُ فَيُقَالُ لَهُ مَا كُنْتَ تَقُولُ فِي هَذَا الرَّجُلِ فَيَقُولُ لَا أَدْرِي كُنْتُ أَقُولُ مَا يَقُولُ النَّاسُ فَيُقَالُ لَا دَرَيْتَ وَلَا تَلَيْتَ وَيُضْرَبُ بِمَطَارِقَ مِنْ حَدِيدٍ ضَرْبَةً فَيَصِيحُ صَيْحَةً يَسْمَعُهَا مَنْ يَلِيهِ غَيْرَ الثقلَيْن» وَلَفظه للْبُخَارِيّ","english":{"narrator":"","text":"Anas reported God’s messenger as saying, “When a man is placed in his grave and his friends leave him, he hears the beat of their sandals. Then two angels come to him and, having made him sit up, they say, ‘What was your opinion of this man, of Muhammad?’ The believer replies, ‘I testify that he is God’s servant and messenger.’ He is then told to look at his abode in hell for which God has substituted for him an abode in paradise, and he sees them both. The hypocrite and infidel are asked, ‘What was your opinion of this man?’ and reply, ‘I do not know; I held the opinion others held.’ They will retort, ‘You neither knew nor did you follow .’ He will then be given a blow with iron hammers and will utter a shout which will be heard by all who are near him, with the exception of men and jinn.” \n\n(Bukhari and Muslim. The wording is Bukhari’s.)"}},{"id":120,"idInBook":120,"chapterId":1,"bookId":14,"arabic":"عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم قَالَ: «إِنَّ أَحَدَكُمْ إِذَا مَاتَ عُرِضَ عَلَيْهِ مَقْعَدُهُ بِالْغَدَاةِ وَالْعَشِيِّ إِنْ كَانَ مِنْ أَهْلِ الْجَنَّةِ فَمِنْ أَهْلِ الْجَنَّةِ وَإِنْ كَانَ مِنْ أَهْلِ النَّارِ فَمِنْ أَهْلِ النَّارِ فَيُقَالُ هَذَا مَقْعَدُكَ حَتَّى يَبْعَثك الله يَوْم الْقِيَامَة»","english":{"narrator":"","text":"‘Abdallah b. ‘Umar reported God’s messenger as saying, “When one of you dies, his abode among the inhabitants of paradise will be shown him morning and evening if he is to be one of them; but if he is to be one of the inhabitants of hell, his abode among them will be shown him. He will be told that this is his abode to which God will finally raise him on the day of resurrection.” \n\n(Bukhari and Muslim.)"}},{"id":121,"idInBook":121,"chapterId":1,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا أَنَّ يَهُودِيَّةً دَخَلَتْ عَلَيْهَا فَذَكَرَتْ عَذَابَ الْقَبْرِ فَقَالَتْ لَهَا أَعَاذَكِ اللَّهُ مِنْ عَذَابِ الْقَبْرِ فَسَأَلَتْ عَائِشَةُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ عَذَابِ الْقَبْرِ فَقَالَ: «نَعَمْ عَذَابُ الْقَبْر قَالَت عَائِشَة رَضِي الله عَنْهَا فَمَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بعد صلى صَلَاة إِلَّا تعوذ من عَذَاب الْقَبْر»","english":{"narrator":"","text":"‘A’isha told of a Jewess who visited her and mentioned the punishment in the grave adding, “May God preserve you from the punishment of the grave!” ‘A’isha asked God’s messenger about the subject and he said, “Yes, the punishment in the grave is real.” ‘A’isha said, “After that I never saw God’s messenger observing a prayer without seeking God’s protection from the punishment in the grave.” \n\n(Bukhari and Muslim.)"}},{"id":122,"idInBook":122,"chapterId":1,"bookId":14,"arabic":"عَن زيد بن ثَابت قَالَ بَيْنَمَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَائِطٍ لِبَنِي النَّجَّارِ عَلَى بَغْلَةٍ لَهُ وَنَحْنُ مَعَهُ إِذْ حَادَتْ بِهِ فَكَادَتْ تُلْقِيهِ وَإِذَا أَقْبُرُ سِتَّةٍ أَو خَمْسَة أَو أَرْبَعَة قَالَ كَذَا كَانَ يَقُول الْجريرِي فَقَالَ: «من يعرف أَصْحَاب هَذِه الأقبر فَقَالَ رجل أَنا قَالَ فَمَتَى مَاتَ هَؤُلَاءِ قَالَ مَاتُوا فِي الْإِشْرَاك فَقَالَ إِنَّ هَذِهِ الْأُمَّةَ تُبْتَلَى فِي قُبُورِهَا فَلَوْلَا أَنْ لَا تَدَافَنُوا لَدَعَوْتُ اللَّهَ أَنْ يُسْمِعَكُمْ مِنْ عَذَابِ الْقَبْرِ الَّذِي أَسْمَعُ مِنْهُ ثُمَّ أَقْبَلَ عَلَيْنَا بِوَجْهِهِ فَقَالَ تَعَوَّذُوا بِاللَّهِ مِنْ عَذَابِ النَّارِ قَالُوا نَعُوذُ بِاللَّهِ مِنْ عَذَاب النَّار فَقَالَ تَعَوَّذُوا بِاللَّهِ مِنْ عَذَابِ الْقَبْرِ قَالُوا نَعُوذُ بِاللَّه من عَذَاب الْقَبْر قَالَ تَعَوَّذُوا بِاللَّهِ مِنَ الْفِتَنِ مَا ظَهَرَ مِنْهَا وَمَا بَطَنَ قَالُوا نَعُوذُ بِاللَّهِ مِنَ الْفِتَنِ مَا ظَهَرَ مِنْهَا وَمَا بَطَنَ قَالَ تَعَوَّذُوا بِاللَّهِ مِنْ فِتْنَةِ الدَّجَّالِ قَالُوا نَعُوذُ بِاللَّهِ مِنْ فِتْنَةِ الدَّجَّالِ» . رَوَاهُ مُسْلِمٌ","english":{"narrator":"Zaid b. Thabit said:","text":"While we were accompanying God’s messenger who was riding a she-mule in a garden belonging to the B. an-Najjar, the animal shied and almost unseated him. It happened that there were five or six graves there, so he asked if anyone knew who were buried in them. A man replied that he did, and on being asked when they died said it was in the period when the people were polytheists. The Prophet then said, “These people are being afflicted in their graves, and were it not that you would cease to bury, I would ask God to let you hear the punishment in the grave which I am hearing.” Then he turned facing us and said, “Seek refuge in God from the punishment of the fire.” They said, “We seek refuge in God from the punishment of the fire.” He said, “Seek refuge in God from the punishment in the grave.” They said, “We seek refuge in God from the punishment in the grave.” He said, “Seek refuge in God from trials both open and secret.” They said, “We seek refuge in God from trials both open and secret.” He said, “Seek refuge in God from the trial of ad-Dajjal!” They said, “We seek refuge in God from the trial of ad-Dajjal.” \n\nMuslim transmitted it."}},{"id":123,"idInBook":123,"chapterId":1,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا قُبِرَ الْمَيِّتُ أَتَاهُ مَلَكَانِ أَسْوَدَانِ أَزْرَقَانِ يُقَالُ لِأَحَدِهِمَا الْمُنْكَرُ وَالْآخَرُ النَّكِيرُ فَيَقُولَانِ مَا كُنْتَ تَقُولُ فِي هَذَا الرجل فَيَقُول مَا كَانَ يَقُول هُوَ عَبْدُ اللَّهِ وَرَسُولُهُ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ فَيَقُولَانِ قَدْ كُنَّا نَعْلَمُ أَنَّكَ تَقُولُ هَذَا ثُمَّ يُفْسَحُ لَهُ فِي قَبْرِهِ سَبْعُونَ ذِرَاعًا فِي سَبْعِينَ ثُمَّ يُنَوَّرُ لَهُ فِيهِ ثُمَّ يُقَالُ لَهُ نَمْ فَيَقُولُ أَرْجِعُ إِلَى أَهْلِي فَأُخْبِرُهُمْ فَيَقُولَانِ نَمْ كَنَوْمَةِ الْعَرُوسِ الَّذِي لَا يُوقِظُهُ إِلَّا أَحَبُّ أَهْلِهِ إِلَيْهِ حَتَّى يَبْعَثَهُ اللَّهُ مِنْ مَضْجَعِهِ ذَلِكَ وَإِنْ كَانَ مُنَافِقًا قَالَ سَمِعت النَّاس يَقُولُونَ فَقُلْتُ مِثْلَهُ لَا أَدْرِي فَيَقُولَانِ قَدْ كُنَّا نَعْلَمُ أَنَّكَ تَقُولُ ذَلِكَ فَيُقَالُ لِلْأَرْضِ الْتَئِمِي عَلَيْهِ فتلتئم عَلَيْهِ فتختلف فِيهَا أَضْلَاعُهُ فَلَا يَزَالُ فِيهَا مُعَذَّبًا حَتَّى يَبْعَثَهُ الله من مضجعه ذَلِك» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “When the dead is buried two black and blue angels, one called al-Munkar and the other an-Nakir, come to him and ask him what opinion he held about this man. If he is a believer he replies, ‘He is the servant and messenger of God. I testify that there is no god but God and that Muhammad is His servant and apostle.’ They say that they knew he would say so. A space of 4900 square cubits is then made for him in his grave, it is illuminated for him, and he is told to sleep. He will then express a desire to return to his family to tell them, but will be told to sleep like one newly married who is wakened only by the member of his family who is dearest to him, until God resurrects him from that resting-place of his. But if he is a hypocrite he will say, ‘I heard men expressing a belief and I held the same, but I really do not know.’ They will tell him they knew he would say so; then the earth will be told to press in upon him and it will do so. His ribs will be pressed together and he will remain there suffering punishment till God resurrects him from that resting-place of his.” \n\nTirmidhi transmitted it."}},{"id":124,"idInBook":124,"chapterId":1,"bookId":14,"arabic":"عَن الْبَرَاءِ بْنِ عَازِبٍ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «وَيَأْتِيهِ مَلَكَانِ فَيُجْلِسَانِهِ فَيَقُولَانِ لَهُ مَنْ رَبُّكَ فَيَقُولُ رَبِّيَ اللَّهُ فَيَقُولَانِ لَهُ مَا دِينُكَ فَيَقُولُ ديني الْإِسْلَام فَيَقُولَانِ لَهُ مَا هَذَا الرَّجُلُ الَّذِي بُعِثَ فِيكُمْ قَالَ فَيَقُول هُوَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَيَقُولَانِ وَمَا يُدْرِيكَ فَيَقُولُ قَرَأْتُ كِتَابَ اللَّهِ فَآمَنْتُ بِهِ وَصَدَّقْتُ زَاد فِي حَدِيث جرير فَذَلِك قَول الله عز وَجل (يثبت الله الَّذين آمنُوا بالْقَوْل الثَّابِت)\nالْآيَة ثمَّ اتفقَا قَالَ فينادي مُنَاد من السَّمَاء أَن قد صدق عَبدِي فأفرشوه مِنَ الْجَنَّةِ وَافْتَحُوا لَهُ بَابًا إِلَى الْجَنَّةِ وألبسوه من الْجنَّة قَالَ فيأتيه من روحها وطيبها قَالَ وَيفتح لَهُ فِيهَا مد بَصَره قَالَ وَإِن الْكَافِر فَذكر مَوته قَالَ وتعاد رُوحُهُ فِي جَسَدِهِ وَيَأْتِيهِ مَلَكَانِ فَيُجْلِسَانِهِ فَيَقُولَانِ لَهُ مَنْ رَبُّكَ فَيَقُولُ هَاهْ هَاهْ لَا أَدْرِي فَيَقُولَانِ لَهُ مَا دِينُكَ فَيَقُولُ هَاهْ هَاهْ لَا أَدْرِي فَيَقُولَانِ مَا هَذَا الرَّجُلُ الَّذِي بُعِثَ فِيكُمْ فَيَقُولُ هَاهْ هَاهْ لَا أَدْرِي فَيُنَادِي مُنَادٍ مِنَ السَّمَاءِ أَنَّ كَذَبَ فَأَفْرِشُوهُ مِنَ النَّارِ وَأَلْبِسُوهُ مِنَ النَّارِ وَافْتَحُوا لَهُ بَابًا إِلَى النَّارِ قَالَ فَيَأْتِيهِ مِنْ حَرِّهَا وَسَمُومِهَا قَالَ وَيُضَيَّقُ عَلَيْهِ قَبْرُهُ حَتَّى تَخْتَلِفَ فِيهِ أَضْلَاعُهُ ثمَّ يقيض لَهُ أعمى أبكم مَعَهُ مِرْزَبَّةٌ مِنْ حَدِيدٍ لَوْ ضُرِبَ بِهَا جبل لصار تُرَابا قَالَ فَيَضْرِبُهُ بِهَا ضَرْبَةً يَسْمَعُهَا مَا بَيْنَ الْمَشْرِقِ وَالْمغْرب إِلَّا الثقلَيْن فَيصير تُرَابا قَالَ ثمَّ تُعَاد فِيهِ الرّوح» . رَوَاهُ أَحْمد وَأَبُو دَاوُد","english":{"narrator":"","text":"Al-Bara’ b. ‘Azib reported God’s messenger as saying, “Two angels will come to him, make him sit up, and ask him who his Lord is, to which he will reply that his Lord is God. They will ask him what his religion is, and he will reply that his religion is Islam. They will ask him about this man who was sent on a mission among his people, and he will reply that he is God’s messenger. They will ask him what made him aware of this, and he will reply that he read God’s Book, believed in it, and considered it true, which is verified by God’s words, ‘God establishes those who believe with the word that stands firm1...’ Then a crier will call from heaven, ‘My servant has spoken the truth, so spread a bed for him from paradise, clothe him from paradise, and open a door for him into paradise.’ A door will then be opened for him towards paradise, some of its air and perfume will come to him, and a space will be made for him in it as far as the eye can see.” He also mentioned the death of the infidel, saying, “His spirit will be restored to his body, two angels will come, make him sit up and ask him who his Lord is, to which he will reply, ‘Alas, alas, I do not know.’ They will ask him what his religion is, and he will reply, ‘Alas, alas, I do not know.’ They will ask him about this man who was sent on a mission among his people, and he will reply, ‘Alas, alas, I do not know.' Then a crier will call from heaven, ‘He has lied, so spread a bed for him from hell, clothe him from hell, and open a door for him into hell.' Then some of its heat and pestilential wind will come to him, and his grave will become restricted so that his ribs will be pressed together. One who is blind and dumb will then be placed in charge of him, having a sledgehammer such that if a mountain were struck with it it would become dust. He will give him a blow with it and he will utter a shout which will be heard by everything between the east and the west except by men and jinn, and he will become dust. Then his spirit will be restored to him.\" \n\nAhmad and Abu Dawud transmitted it.\n\n1 Quran, xiv, 27."}},{"id":125,"idInBook":125,"chapterId":1,"bookId":14,"arabic":"وَعَن عُثْمَان رَضِي الله عَنهُ أَنه إِذَا وَقَفَ عَلَى قَبْرٍ بَكَى حَتَّى يَبُلَّ لِحْيَتَهُ فَقِيلَ لَهُ تُذْكَرُ الْجَنَّةُ وَالنَّارُ فَلَا تَبْكِي وَتَبْكِي مِنْ هَذَا فَقَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ الْقَبْرَ أَوَّلُ مَنْزِلٍ مِنْ مَنَازِلِ الْآخِرَةِ فَإِنْ نَجَا مِنْهُ فَمَا بَعْدَهُ أَيْسَرُ مِنْهُ وَإِنْ لَمْ يَنْجُ مِنْهُ فَمَا بَعْدَهُ أَشَدُّ مِنْهُ قَالَ وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا رَأَيْت منْظرًا قطّ إِلَّا الْقَبْر أَفْظَعُ مِنْهُ» . رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ. وَقَالَ التِّرْمِذِيُّ هَذَا حَدِيث غَرِيب","english":{"narrator":"","text":"‘Uthman told that when he stood over a grave he would weep so sorely that the tears moistened his beard. Someone said to him, “You remember paradise and hell, without weeping, yet you are weeping over this.\" He replied that God’s messenger said, “The grave is the first stage of the next world ; if one escapes from it what follows is easier than it, but if one does not escape from it what follows is more severe than it.\" He further quoted God’s messenger as saying, “I have never seen a sight as horrible as the grave.\" \n\nTirmidhi and Ibn Majah transmitted it, and Tirmidhi said this is a gharib tradition."}},{"id":126,"idInBook":126,"chapterId":1,"bookId":14,"arabic":"وَعَن عُثْمَان رَضِيَ اللَّهُ عَنْهُ قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا فَرَغَ مِنْ دَفْنِ الْمَيِّتِ وَقَفَ عَلَيْهِ فَقَالَ: «اسْتَغْفِرُوا لِأَخِيكُمْ ثُمَّ سَلُوا لَهُ بِالتَّثْبِيتِ فَإِنَّهُ الْآنَ يُسْأَلُ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"He also said that when the Prophet finished the burial of the dead he stood over it and said, “Ask forgiveness for your brother, then ask that he may be strengthened, for he is now being questioned.\" \n\nAbu Dawud transmitted it."}},{"id":127,"idInBook":127,"chapterId":1,"bookId":14,"arabic":"عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «يُسَلط عَلَى الْكَافِرِ فِي قَبْرِهِ تِسْعَةٌ وَتِسْعُونَ تِنِّينًا تنهشه وتلدغه حَتَّى تقوم السَّاعَة وَلَو أَنَّ تِنِّينًا مِنْهَا نَفَخَ فِي الْأَرْضِ مَا أَنْبَتَتْ خَضِرًا» . رَوَاهُ الدَّارِمِيُّ وَرَوَى التِّرْمِذِيُّ نَحْوَهُ وَقَالَ: «سَبْعُونَ بدل تِسْعَة وَتسْعُونَ»","english":{"narrator":"","text":"Abu Sa'id reported God’s messenger as saying, “Ninety-nine dragons will be given power over an infidel in his grave, and will bite and sting him till the last hour comes. If one of those dragons were to breathe over the earth, it would bring forth no green thing.\" \n\nDarimi transmitted it, and Tirmidhi transmitted something similar, but he said seventy instead of ninety-nine."}},{"id":128,"idInBook":128,"chapterId":1,"bookId":14,"arabic":"عَن جَابر بن عبد الله قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى سَعْدِ بْنِ مُعَاذٍ حِينَ توفّي قَالَ فَلَمَّا صَلَّى عَلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَوُضِعَ فِي قَبْرِهِ وَسُوِّيَ عَلَيْهِ سَبَّحَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَبَّحْنَا طَوِيلًا ثُمَّ كَبَّرَ فَكَبَّرْنَا فَقِيلَ يَا رَسُولَ اللَّهِ لِمَ سَبَّحَتْ ثُمَّ كَبَّرْتَ قَالَ: «لقد تضايق على هَذَا العَبْد الصَّالح قَبره حَتَّى فرجه الله عز وَجل عَنهُ» . رَوَاهُ أَحْمد","english":{"narrator":"Jabir said:","text":"We went out with God’s messenger to  Sa'd b. Mu'adh when he died. God’s messenger prayed over him, and when he was placed in his grave and the ground was levelled over him, God’s messenger extolled God and we did so also at great length. He then said, “God is most great,\" and we did the same. Someone asked him why he had extolled God and then said, “God is most great,\" to which he replied, “This upright servant’s grave had closed in on him, but finally God removed the pressure from him.\" \n\nAhmad transmitted it."}},{"id":129,"idInBook":129,"chapterId":1,"bookId":14,"arabic":"وَعَن ابْنِ عُمَرَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «هَذَا الَّذِي تَحَرَّكَ لَهُ الْعَرْشُ وَفُتِحَتْ لَهُ أَبْوَابُ السَّمَاءِ وَشَهِدَهُ سَبْعُونَ أَلْفًا مِنَ الْمَلَائِكَةِ لَقَدْ ضُمَّ ضَمَّةً ثُمَّ فُرِّجَ عَنْهُ» . رَوَاهُ النَّسَائِيّ","english":{"narrator":"","text":"Ibn ‘Umar reported God’s messenger as saying, “This is the one1 on account of whom the throne moved, for whom the gates of heaven were opened, and whose funeral seventy thousand angels attended. He was compressed, but afterwards the pressure was removed from him.\" \n\nNasa’i transmitted it.\n\n1 i.e Sa’d"}},{"id":130,"idInBook":130,"chapterId":1,"bookId":14,"arabic":"عَن أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ رَضِيَ اللَّهُ عَنْهُمَا تَقول قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَطِيبًا فَذكر فتْنَة الْقَبْر الَّتِي يفتتن فِيهَا الْمَرْءُ فَلَمَّا ذَكَرَ ذَلِكَ ضَجَّ الْمُسْلِمُونَ ضَجَّةً. رَوَاهُ الْبُخَارِيُّ هَكَذَا وَزَادَ النَّسَائِيُّ: حَالَتْ بَيْنِي وَبَيْنَ أَنْ أَفْهَمَ كَلَامَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا سَكَنَتْ ضَجَّتُهُمْ قُلْتُ لِرَجُلٍ قَرِيبٍ مِنِّي: أَيْ بَارَكَ اللَّهُ فِيكَ مَاذَا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي آخِرِ قَوْلِهِ؟ قَالَ: «قَدْ أُوحِيَ إِلَيَّ أَنَّكُمْ تُفْتَنُونَ فِي الْقُبُورِ قَرِيبًا من فتْنَة الدَّجَّال»","english":{"narrator":"","text":"Asma’ daughter of Abu Bakr said, “God’s messenger arose to deliver an address in which he mentioned the trial a man will endure in the grave. On his mentioning that, the Muslims gave a shout of dismay.\" \nBukhari transmitted it thus, but Nasa’i added, “which prevented me from grasping what God's messenger had said. So when the clamour died down I said to a man near me, ‘God bless you, what did God’s messenger say at the end of his address?' He replied that he said he had had a revelation that the trial they would endure in their graves would approximate to that of ad-Dajjal.\""}},{"id":131,"idInBook":131,"chapterId":1,"bookId":14,"arabic":"وَعَنْ جَابِرٌ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" إِذَا أُدْخِلَ الْمَيِّتُ الْقَبْرَ مَثَلَتْ لَهُ الشَّمْسُ عِنْدَ غُرُوبِهَا فَيَجْلِسُ يَمْسَحُ عَيْنَيْهِ وَيَقُولُ: دَعونِي أُصَلِّي \". رَوَاهُ ابْن مَاجَه","english":{"narrator":"","text":"Jabir reported the Prophet as saying, “When a dead man is covered up in his grave he will be shown the setting sun and will sit up, rub his eyes, and say, ‘Let me observe the prayer’.\" \n\nIbn Majah transmitted it."}},{"id":132,"idInBook":132,"chapterId":1,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ الْمَيِّتَ يَصِيرُ إِلَى الْقَبْرِ فَيَجْلِسُ الرَّجُلُ الصَّالح فِي قَبره غير فزع وَلَا مشعوف ثمَّ يُقَال لَهُ فِيمَ كُنْتَ فَيَقُولُ كُنْتُ فِي الْإِسْلَامِ فَيُقَالُ لَهُ مَا هَذَا الرَّجُلُ فَيَقُولُ مُحَمَّدٌ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَاءَنَا بِالْبَيِّنَاتِ مِنْ عِنْدِ اللَّهِ فَصَدَّقْنَاهُ فَيُقَالُ لَهُ هَلْ رَأَيْتَ اللَّهَ فَيَقُولُ مَا يَنْبَغِي لِأَحَدٍ أَنْ يَرَى اللَّهَ فَيُفْرَجُ لَهُ فُرْجَةً قِبَلَ النَّارِ فَيَنْظُرُ إِلَيْهَا يُحَطِّمُ بَعْضُهَا بَعْضًا فَيُقَالُ لَهُ انْظُرْ إِلَى مَا وَقَاكَ اللَّهُ ثمَّ يفرج لَهُ قِبَلَ الْجَنَّةِ فَيَنْظُرُ إِلَى زَهْرَتِهَا وَمَا فِيهَا فَيُقَال لَهُ هَذَا مَقْعَدك وَيُقَال لَهُ عَلَى الْيَقِينِ كُنْتَ وَعَلَيْهِ مِتَّ وَعَلَيْهِ تُبْعَثُ إِن شَاءَ الله وَيجْلس الرجل السوء فِي قَبره فَزعًا مشعوفا فَيُقَال لَهُ فِيمَ كُنْتَ فَيَقُولُ لَا أَدْرِي فَيُقَالُ لَهُ مَا هَذَا الرَّجُلُ فَيَقُولُ سَمِعْتُ النَّاسَ يَقُولُونَ قولا فقلته فيفرج لَهُ قِبَلَ الْجَنَّةِ فَيَنْظُرُ إِلَى زَهْرَتِهَا وَمَا فِيهَا فَيُقَالُ لَهُ انْظُرْ إِلَى مَا صَرَفَ اللَّهُ عَنْك ثمَّ يفرج لَهُ فُرْجَةً قِبَلَ النَّارِ فَيَنْظُرُ إِلَيْهَا يُحَطِّمُ بَعْضُهَا بَعْضًا فَيُقَالُ لَهُ هَذَا مَقْعَدُكَ عَلَى الشَّك كنت وَعَلِيهِ مت وَعَلِيهِ تبْعَث إِن شَاءَ اللَّهُ تَعَالَى» . رَوَاهُ ابْنُ مَاجَهْ","english":{"narrator":"","text":"Abu Huraira reported the Prophet as saying, “When a dead man comes into his grave he will sit up in his grave neither dismayed nor refractory and will be asked what religion he followed, to which he will reply that he followed Islam. He will then be asked his opinion of this man, and will reply that he is Muhammad, God’s messenger, who brought men the clear proofs from God, and they believed him. He will then be asked if he has seen God, and will reply that it is not fitting that anyone should see God. Then an opening will be made for him in the direction of hell, he will look at it being crushed together, and will be told to look at what God has guarded him from. Then an opening will be made for him in the direction of paradise, he will look at its beauty and what is therein, and will be told that this will be his resting-place, for he followed what was sure, died in that belief, and will be resurrected in this belief, if God will. But the evil man will sit up in his grave dismayed and refractory and will be asked what religion he followed, to which he will reply that he does not know. He will then be asked his opinion of this man, and will reply that he heard people express an opinion which he followed. An opening will then be made for him in the direction of paradise, he will look at its beauty and what is therein, and will be told to look at what God has turned away from him. Then an opening will be made for him towards hell, he will look at it being crushed together, and will be told that this will be his resting-place on account of the doubt he harboured, in which he died, and in which he will be resurrected, if God will.\" \n\nIbn Majah transmitted it."}},{"id":133,"idInBook":133,"chapterId":1,"bookId":14,"arabic":"عَنْ عَائِشَةَ قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَحْدَثَ فِي أَمْرِنَا هَذَا مَا لَيْسَ مِنْهُ فَهُوَ رد»","english":{"narrator":"","text":"‘A’isha reported God’s messenger as saying, “If anyone introduces into this affair of ours anything which does not belong to it, it is rejected.” \n\n(Bukhari and Muslim.)"}},{"id":134,"idInBook":134,"chapterId":1,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَمَّا بَعْدُ فَإِنَّ خَيْرَ الْحَدِيثِ كِتَابُ اللَّهِ وَخَيْرَ الْهَدْيِ هَدْيُ مُحَمَّدٍ وَشَرَّ الْأُمُورِ مُحْدَثَاتُهَا وَكُلَّ بِدْعَةٍ ضَلَالَةٌ» . رَوَاهُ مُسْلِمٌ","english":{"narrator":"Jabir reported God’s messenger as saying, “To proceed:","text":"The best discourse is God’s Book, the best guidance is that given by Muhammad, and the worst things are those which are novelties. Every innovation is error.” \n\nMuslim transmitted it."}},{"id":135,"idInBook":135,"chapterId":1,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَبْغَضُ النَّاسِ إِلَى الله ثَلَاثَة ملحد فِي الْحرم وميتغ فِي الْإِسْلَام سنة الْجَاهِلِيَّة ومطلب دم امرىء بِغَيْر حق ليهريق دَمه» رَوَاهُ البُخَارِيّ","english":{"narrator":"Ibn ‘Abbas reported God’s messenger as saying, “The people most hateful to God are of three classes:","text":"he who is heretical in the sacred territory, he who wants to introduce into Islam the sunna of the pre-Islamic period, and he who unjustly demands the death of a Muslim to shed his blood.” \n\nBukhari transmitted it."}},{"id":136,"idInBook":136,"chapterId":1,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" كُلُّ أُمَّتِي يَدْخُلُونَ الْجَنَّةَ إِلَّا مَنْ أَبَى. قِيلَ: وَمَنْ أَبَى؟ قَالَ: مَنْ أَطَاعَنِي دَخَلَ الْجَنَّةَ وَمَنْ عَصَانِي فقد أَبى \" رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Abu Huraira reported God's messenger as saying, “All my people will enter paradise except those who refuse.” On being asked who refused, he replied, “He who obeys me will enter paradise, and he who disobeys me has refused.” \n\nBukhari transmitted it."}},{"id":137,"idInBook":137,"chapterId":1,"bookId":14,"arabic":"عَن جَابر بن عبد الله يَقُول جَاءَتْ مَلَائِكَةٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ نَائِم فَقَالَ بَعْضُهُمْ إِنَّهُ نَائِمٌ وَقَالَ بَعْضُهُمْ إِنَّ الْعَيْنَ نَائِمَة وَالْقلب يقظان فَقَالُوا إِنَّ لِصَاحِبِكُمْ هَذَا مَثَلًا فَاضْرِبُوا لَهُ مثلا فَقَالَ بَعْضُهُمْ إِنَّهُ نَائِمٌ وَقَالَ بَعْضُهُمْ إِنَّ الْعَيْنَ نَائِمَةٌ وَالْقَلْبَ يَقْظَانُ فَقَالُوا مَثَلُهُ كَمَثَلِ رَجُلٍ بَنَى دَارًا وَجَعَلَ فِيهَا مَأْدُبَةً وَبَعَثَ دَاعِيًا فَمَنْ أَجَابَ الدَّاعِيَ دَخَلَ الدَّارَ وَأَكَلَ مِنَ الْمَأْدُبَةِ وَمَنْ لَمْ يُجِبِ الدَّاعِيَ لَمْ يَدْخُلِ الدَّارَ وَلَمْ يَأْكُلْ مِنَ الْمَأْدُبَةِ فَقَالُوا أَوِّلُوهَا لَهُ يفقهها فَقَالَ بَعْضُهُمْ إِنَّهُ نَائِمٌ وَقَالَ بَعْضُهُمْ إِنَّ الْعَيْنَ نَائِمَة وَالْقلب يقظان فَقَالُوا فالدار الْجنَّة والداعي مُحَمَّد صلى الله عَلَيْهِ وَسلم فَمن أطَاع مُحَمَّدًا صلى الله عَلَيْهِ وَسلم فقد أطَاع الله وَمن عصى مُحَمَّدًا صلى الله عَلَيْهِ وَسلم فقد عصى الله وَمُحَمّد صلى الله عَلَيْهِ وَسلم فرق بَين النَّاس. رَوَاهُ البُخَارِيّ","english":{"narrator":"Jabir said:","text":"Angels came to the Prophet when he was asleep; and they said, “A comparison can be drawn with this friend of yours, so draw one.” One of them said, “He is asleep;” but another replied, “The eye sleeps while the heart is awake.” Then they said, “He may be likened to a man who built a house, prepared a feast in it, and sent one to issue invitations. Whoever responds to the one who invites him will enter the house and eat of the feast, but whoever does not respond will not enter the house or eat of the feast.” They said, “If you interpret it to him, he will understand it whereupon one said, “He is a sleep”, and another replied, “The eye sleeps while the heart is awake.” Then they said, “The house is paradise, the one who issues the invitation is Muhammad, he who obeys Muhammad has obeyed God, and he who disobeys Muhammad has disobeyed God. Muhammad is one who separates between people.” \n\nBukhari transmitted it."}},{"id":138,"idInBook":138,"chapterId":1,"bookId":14,"arabic":"عَنْ أَنَسِ بْنِ مَالِكٍ رَضِيَ اللَّهُ عَنْهُ يَقُولُ جَاءَ ثَلَاثَة رَهْط إِلَى بيُوت أَزْوَاجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْأَلُونَ عَنْ عِبَادَةِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا أخبروا كَأَنَّهُمْ تقالوها فَقَالُوا وَأَيْنَ نَحْنُ مِنَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ وَمَا تَأَخَّرَ قَالَ أحدهم أما أَنا فَإِنِّي أُصَلِّي اللَّيْل أبدا وَقَالَ آخر أَنا أَصوم الدَّهْر وَلَا أفطر وَقَالَ آخر أَنَا أَعْتَزِلُ النِّسَاءَ فَلَا أَتَزَوَّجُ أَبَدًا فَجَاءَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَيْهِمْ فَقَالَ: «أَنْتُمُ الَّذِينَ قُلْتُمْ كَذَا وَكَذَا أَمَا وَاللَّهِ إِنِّي لَأَخْشَاكُمْ لِلَّهِ وَأَتْقَاكُمْ لَهُ لَكِنِّي أَصُومُ وَأُفْطِرُ وَأُصَلِّي وَأَرْقُدُ وَأَتَزَوَّجُ النِّسَاءَ فَمَنْ رَغِبَ عَنْ سُنَّتِي فَلَيْسَ مني»","english":{"narrator":"Anas said:","text":"Three people came to the Prophet’s wives and asked how the Prophet conducted his worship. When they were told about it they seemed to consider it little and said, “What a difference there is between us and the Prophet whose former and latter sins have been forgiven him by God!” One of them said, “As for me, I will always pray during the night.” Another said, “I will fast during the daytime and not break my fast.” The other said, “I will have nothing to do with women and will never marry.” Then the Prophet came to them and said, “Are you the people who said such and such? By God, I am the one of you who fears and reverences God most, yet I fast and I break my fast; I pray and I sleep; and I marry women. He who is displeased with my sunna has nothing to do with me.” \n\n(Bukhari and Muslim.)"}},{"id":139,"idInBook":139,"chapterId":1,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: صَنَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَيْئًا فَرَخَّصَ فِيهِ فَتَنَزَّهَ عَنْهُ قَوْمٌ فَبَلَغَ ذَلِكَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَخَطَبَ فَحَمِدَ اللَّهَ ثُمَّ قَالَ: «مَا بَالُ أَقْوَامٍ يَتَنَزَّهُونَ عَنِ الشَّيْءِ أَصْنَعُهُ فَوَاللَّهِ إِنِّي لأعلمهم بِاللَّه وأشدهم لَهُ خشيَة»","english":{"narrator":"‘A’isha said:","text":"God’s messenger did a certain thing and gave permission for it to be done, but some people abstained from it. When God’s messenger heard of that, he delivered a sermon, and after extolling God he said, “What is the matter with people who abstain from a thing which I do? By God, I am the one of them who knows most about God and fears Him most.” \n\n(Bukhari and Muslim.)"}},{"id":140,"idInBook":140,"chapterId":1,"bookId":14,"arabic":"وَعَن رَافع بن خديج قَالَ: قَدِمَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وهم يأبرون النَّخْلَ فَقَالَ: «مَا تَصْنَعُونَ» قَالُوا كُنَّا نَصْنَعُهُ قَالَ «لَعَلَّكُمْ لَوْ لَمْ تَفْعَلُوا كَانَ خَيْرًا» فَتَرَكُوهُ فنفضت قَالَ فَذَكَرُوا ذَلِكَ لَهُ فَقَالَ: «إِنَّمَا أَنَا بَشَرٌ إِذَا أَمَرْتُكُمْ بِشَيْءٍ مِنْ دِينِكُمْ فَخُذُوا بِهِ وَإِذَا أَمَرْتُكُمْ بِشَيْءٍ مِنْ رَأْي فَإِنَّمَا أَنا بشر» . رَوَاهُ مُسلم","english":{"narrator":"Rafi‘ b. Khadij said:","text":"God’s Prophet came to Medina when they were fecundating the palm trees. He asked, “What are you doing?” and they replied, “We have been accustomed to do it.” He said, “Perhaps if you did not do it it would be better so they gave it up, but the crop was diminished. They mentioned that to him and he said, “I am only a human being. When I issue any command to you regarding your religion, accept it; but when I issue any command to you based on my own opinion, I am merely a human being.” \n\nMuslim transmitted it."}},{"id":141,"idInBook":141,"chapterId":1,"bookId":14,"arabic":"وَعَنْ أَبِي مُوسَى قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّمَا مَثَلِي وَمَثَلُ مَا بَعَثَنِي اللَّهُ بِهِ كَمَثَلِ رَجُلٍ أَتَى قَوْمًا فَقَالَ يَا قَوْمِ إِنِّي رَأَيْتُ الْجَيْشَ بِعَيْنِي وَإِنِّي أَنَا النَّذِيرُ الْعُرْيَانُ فَالنَّجَاءَ النَّجَاءَ فَأَطَاعَهُ طَائِفَةٌ مِنْ قَوْمِهِ فَأَدْلَجُوا فَانْطَلَقُوا عَلَى مَهْلِهِمْ فَنَجَوْا وَكَذَّبَتْ طَائِفَةٌ مِنْهُمْ فَأَصْبَحُوا مَكَانَهُمْ فَصَبَّحَهُمُ الْجَيْشُ فَأَهْلَكَهُمْ وَاجْتَاحَهُمْ فَذَلِكَ مَثَلُ مَنْ أَطَاعَنِي فَاتَّبَعَ مَا جِئْتُ بِهِ وَمثل من عَصَانِي وَكذب بِمَا جِئْتُ بِهِ مِنَ الْحَقِّ»","english":{"narrator":"","text":"Abu Musa reported God's messenger as saying, “I and the message with which God has entrusted me are just like a man who came to a people and said, \"I have seen the army with my own eyes, and I am a simple warner, so flee, flee.' A section of his people obeyed him, and setting off at nightfall, went away without hurry and escaped. But a section of them did not believe him and stayed where they were, and the army attacked them at dawn, destroying and extirpating them. That is a comparison with those who obey me and follow my message, and with those who disobey me and disbelieve the truth I have brought.” \n\n(Bukhari and Muslim.)"}},{"id":142,"idInBook":142,"chapterId":1,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «إِنَّمَا مثلي وَمثل النَّاس كَمَثَلِ رَجُلٍ اسْتَوْقَدَ نَارًا فَلَمَّا أَضَاءَتْ مَا حوله جَعَلَ الْفَرَاشُ وَهَذِهِ الدَّوَابُّ الَّتِي تَقَعُ فِي النَّار يقعن فِيهَا وَجعل يحجزهن ويغلبنه فيقتحمن فِيهَا فَأَنَا آخِذٌ بِحُجَزِكُمْ عَنِ النَّارِ وَأَنْتُمْ يقتحمون فِيهَا» . هَذِهِ رِوَايَةُ الْبُخَارِيِّ وَلِمُسْلِمٍ نَحْوَهَا وَقَالَ فِي آخرهَا: \n\" فَذَلِكَ مَثَلِي وَمَثَلُكُمْ أَنَا آخِذٌ بِحُجَزِكُمْ عَنِ النَّارِ: هَلُمَّ عَنِ النَّارِ هَلُمَّ عَنِ النَّارِ فَتَغْلِبُونِي تَقَحَّمُونَ فِيهَا \"","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “I may be likened to a man who kindled a fire, and when it lit up the neighbourhood the insects and these creeping things which fall into a fire began to fall into it. He began to prevent them, but they got the better of him and rushed into it. Now I am seizing your girdles to pull you from hell, but you are rushing into it.” \n\nThis is Bukhari's version, and Muslim has one similar, but at the end of it he quotes him as saying, “You and I may be likened to that. I am seizing your girdles to pull you from hell. Come away from hell! Come away from hell! But you are getting the better of me and rushing into it.”"}},{"id":143,"idInBook":143,"chapterId":1,"bookId":14,"arabic":"وَعَنْ أَبِي مُوسَى عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَثَلُ مَا بَعَثَنِي اللَّهُ بِهِ مِنَ الْهُدَى وَالْعلم كَمثل الْغَيْث الْكثير أصَاب أَرضًا فَكَانَ مِنْهَا نقية قَبِلَتِ الْمَاءَ فَأَنْبَتَتِ الْكَلَأَ وَالْعُشْبَ الْكَثِيرَ وَكَانَتْ مِنْهَا أَجَادِبُ أَمْسَكَتِ الْمَاءَ فَنَفَعَ اللَّهُ بِهَا النَّاس فَشَرِبُوا وَسقوا وزرعوا وأصابت مِنْهَا طَائِفَةً أُخْرَى إِنَّمَا هِيَ قِيعَانٌ لَا تُمْسِكُ مَاءً وَلَا تُنْبِتُ كَلَأً فَذَلِكَ مَثَلُ مَنْ فَقُهَ فِي دِينِ اللَّهِ وَنَفَعَهُ مَا بَعَثَنِي اللَّهُ بِهِ فَعَلِمَ وَعَلَّمَ وَمَثَلُ مَنْ لَمْ يَرْفَعْ بِذَلِكَ رَأْسًا وَلَمْ يَقْبَلْ هُدَى اللَّهِ الَّذِي أُرْسِلْتُ بِهِ»","english":{"narrator":"","text":"Abu Musa reported that God’s messenger said, “The guidance and knowledge with which God has commissioned me are like abundant rain which fell on some ground. Part of it was good, and absorbing the water, it brought forth abundant herbage and pasture; and there were some bare patches in it which retained the water by which God gave benefit to men, who drank, gave drink and sowed seed. But some of it fell on another portion which consisted only of hollows which could not retain the water or produce herbage. That is like the one who becomes versed in God’s religion and receives benefit from the message entrusted to me by God, so he knows for himself and teaches others ; and it is like the one who does not show regard to that and does not accept God’s guidance with which I have been commissioned.” \n\n(Bukhari and Muslim.)"}},{"id":144,"idInBook":144,"chapterId":1,"bookId":14,"arabic":"وَعَن عَائِشَة قَالَتْ: تَلَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ (هُوَ الَّذِي أَنْزَلَ عَلَيْكَ الْكِتَابَ مِنْهُ آيَات محكمات)\nوَقَرَأَ إِلَى: (وَمَا يَذَّكَّرُ إِلَّا أُولُو الْأَلْبَابِ)\nقَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" فَإِذَا رَأَيْتَ وَعِنْدَ مُسْلِمٍ: رَأَيْتُمُ الَّذِينَ يَتَّبِعُونَ مَا تَشَابَهَ مِنْهُ فَأُولَئِكَ الَّذِينَ سَمَّاهُمُ الله فاحذروهم \"","english":{"narrator":"‘A’isha said:","text":"God’s messenger recited, “He it is who has sent down to you the Book in which are fundamental verses” going on to “no one takes warning but those of insight.”1 She reported God’s messenger as saying, “When you (using the feminine singular pronoun whereas Muslim has the masculine plural) see those who study what is dubious in it, those are they whom God named, so be on your guard against them.” \n\n(Bukhari and Muslim.)\n\n1 Quran, iii, 7."}},{"id":145,"idInBook":145,"chapterId":1,"bookId":14,"arabic":"وَعَن عبد الله بن عَمْرو قَالَ: هَجَّرْتُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمًا قَالَ: فَسَمِعَ أَصْوَاتَ رَجُلَيْنِ اخْتَلَفَا فِي آيَةٍ فَخَرَجَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُعْرَفُ فِي وَجْهِهِ الْغَضَبُ فَقَالَ: «إِنَّمَا هَلَكَ مَنْ كَانَ قَبْلَكُمْ باختلافهم فِي الْكتاب» . رَوَاهُ مُسلم","english":{"narrator":"‘Abdallah b. ‘Amr said:","text":"Once when I went at midday to visit God’s messenger he heard the voices of two men in disagreement about a verse coming out to us with obvious signs of anger on his face, he said, “It was just because of their disagreement about God’s Book that your predecessors perished.” \n\nMuslim transmitted it."}},{"id":146,"idInBook":146,"chapterId":1,"bookId":14,"arabic":"وَعَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «أَن أعظم الْمُسلمين فِي لامسلمين جُرْمًا مَنْ سَأَلَ عَنْ شَيْءٍ لَمْ يُحَرَّمْ على النَّاس فَحرم من أجل مَسْأَلته»","english":{"narrator":"","text":"Sa'd b. Abu Waqqas reported God’s messenger as saying, “The Muslim who offends most against the Muslims is he who enquires about something which has not been forbidden to men, and it is declared forbidden because of his enquiry.” \n\n(Bukhari and Muslim.)"}},{"id":147,"idInBook":147,"chapterId":1,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَكُونُ فِي آخِرِ الزَّمَانِ دَجَّالُونَ كَذَّابُونَ يَأْتُونَكُمْ مِنَ الْأَحَادِيثِ بِمَا لَمْ تَسْمَعُوا أَنْتُمْ وَلَا آبَاؤُكُمْ فَإِيَّاكُمْ وَإِيَّاهُمْ لَا يُضِلُّونَكُمْ وَلَا يَفْتِنُونَكُمْ» . . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “In the last days there will be lying dajjals who will bring you traditions of which neither you nor your fathers have heard, so beware of them. They will neither lead you astray nor seduce you.” \n\nMuslim transmitted it."}},{"id":148,"idInBook":148,"chapterId":1,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: كَانَ أهل الْكتاب يقرؤون التَّوْرَاةَ بِالْعِبْرَانِيَّةِ وَيُفَسِّرُونَهَا بِالْعَرَبِيَّةِ لِأَهْلِ الْإِسْلَامِ. فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تُصَدِّقُوا أَهْلَ الْكِتَابِ وَلَا تُكَذِّبُوهُمْ وَ (قُولُوا آمنا بِاللَّه وَمَا أنزل إِلَيْنَا» الْآيَة. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"He also said that the people of the Book used to read the Torah in Hebrew and expound it in Arabic to the Muslims, so God’s messenger said, “Neither believe nor disbelieve the people of the Book, but say, ‘We believe in God and what has been sent down to us... 1 ’”\n\nBukhari transmitted it.\n\n1 Quran, ii, 136."}},{"id":149,"idInBook":149,"chapterId":1,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «كَفَى بِالْمَرْءِ كَذِبًا أَنْ يُحَدِّثَ بِكُلِّ مَا سمع» . رَوَاهُ مُسلم","english":{"narrator":"","text":"He also reported God’s messenger as saying, “It is enough falsehood for a man to relate everything he hears.” \n\nMuslim transmitted it."}},{"id":150,"idInBook":150,"chapterId":1,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَا من نَبِي بَعثه الله فِي أمة قبلي إِلَّا كَانَ لَهُ من أُمَّتِهِ حَوَارِيُّونَ وَأَصْحَابٌ يَأْخُذُونَ بِسُنَّتِهِ وَيَقْتَدُونَ بِأَمْرِهِ ثُمَّ إِنَّهَا تَخْلُفُ مِنْ بَعْدِهِمْ خُلُوفٌ يَقُولُونَ مَا لَا يَفْعَلُونَ وَيَفْعَلُونَ مَا لَا يُؤْمَرُونَ فَمَنْ جَاهَدَهُمْ بِيَدِهِ فَهُوَ مُؤْمِنٌ وَمَنْ جَاهَدَهُمْ بِلِسَانِهِ فَهُوَ مُؤْمِنٌ وَمَنْ جَاهَدَهُمْ بِقَلْبِهِ فَهُوَ مُؤْمِنٌ وَلَيْسَ وَرَاءَ ذَلِكَ مِنَ الْإِيمَانِ حَبَّةُ خَرْدَلٍ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Ibn Mas'ud reported God’s messenger as saying, “There was no prophet whom God raised up among his people before me who did not have from among his people apostles and companions who held to his sunna and followed what he commanded; then they were succeeded by people who said what they did not practise and did things they were not commanded to do. So he who strives against them with his hand is a believer, he who strives against them with his tongue is a believer, and he who strives against them with his heart is a believer. Beyond that there is not so much faith as a grain of mustard seed.” \n\nMuslim transmitted it."}},{"id":151,"idInBook":151,"chapterId":1,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم قَالَ: «مَنْ دَعَا إِلَى هُدًى كَانَ لَهُ مِنَ الْأَجْرِ مِثْلُ أُجُورِ مَنْ تَبِعَهُ لَا يَنْقُصُ ذَلِكَ مِنْ أُجُورِهِمْ شَيْئًا وَمَنْ دَعَا إِلَى ضَلَالَةٍ كَانَ عَلَيْهِ مِنَ الْإِثْمِ مِثْلُ آثَامِ مَنْ تَبِعَهُ لَا يَنْقُصُ ذَلِكَ مِنْ آثَامِهِمْ شَيْئا» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “If anyone summons others to follow right guidance, his reward will be equivalent to those of the people who follow him without their rewards being diminished in any respect on that account; and if anyone summons others to follow error the sin of which he is guilty will be equivalent to those of the people who follow him without their sins’ being diminished in any respect on that account.” \n\nMuslim transmitted it."}},{"id":152,"idInBook":152,"chapterId":1,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «بَدَأَ الْإِسْلَامُ غَرِيبًا وَسَيَعُودُ كَمَا بَدَأَ فَطُوبَى للغرباء» . رَوَاهُ مُسلم","english":{"narrator":"","text":"He also reported God’s messenger as saying, “Islam began as a small religion and will return to the state in which it began. Then blessed will be the few ' \n\nMuslim transmitted it."}},{"id":153,"idInBook":153,"chapterId":1,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ الْإِيمَانَ لَيَأْرِزُ إِلَى الْمَدِينَةِ كَمَا تأرز الحيية إِلَى جحرها»","english":{"narrator":"","text":"He also reported God’s messenger as saying, “Faith will shrink back to Medina as a snake shrinks back to its hole.”\n\n(Bukhari and Muslim.)"}},{"id":154,"idInBook":154,"chapterId":1,"bookId":14,"arabic":"وسنذكر حديث أبي هريرة: \"ذروني ما تركتكم\" في كتاب لمناسك، وحديثي معاوية وجابر: \"لا يزال من أمَّتي\" و: \"لا يزال طائفة من أمتي\" في باب: ثواب هذه الأمة، إن شاء الله تعالى","english":{"narrator":"","text":"We shall mention the1 tradition from Abu Huraira, “Leave me as long as I have said nothing to you ...” in the book on the rites of the Pilgrimage, and the traditions of Mu'awiya and Jabir, “A section of this people will continue ...”2 in the chapter on the reward of this people, if God will.\n\n1 Book XI, Chap. I, first tradition.\n2 Page 1383. Only Mu’awiya’s tradition is given. The wording is slightly different."}},{"id":155,"idInBook":155,"chapterId":1,"bookId":14,"arabic":"عَن ربيعَة الجرشِي يَقُول أُتِي النَّبِي صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقِيلَ لَهُ لِتَنَمْ عَيْنُكَ وَلِتَسْمَعْ أُذُنُكَ وَلِيَعْقِلْ قَلْبُكَ قَالَ فَنَامَتْ عَيْنَايَ وَسَمِعَتْ أُذُنَايَ وَعَقَلَ قَلْبِي قَالَ فَقِيلَ لِي سيد بنى دَارا فَصنعَ مَأْدُبَةً وَأَرْسَلَ دَاعِيًا فَمَنْ أَجَابَ الدَّاعِيَ دَخَلَ الدَّارَ وَأَكَلَ مِنَ الْمَأْدُبَةِ وَرَضِيَ عَنْهُ السَّيِّدُ وَمَنْ لَمْ يُجِبِ الدَّاعِيَ لَمْ يَدْخُلِ الدَّارَ وَلم يطعم مِنَ الْمَأْدُبَةِ وَسَخِطَ عَلَيْهِ السَّيِّدُ قَالَ فَاللَّهُ السَّيِّدُ وَمُحَمَّدٌ الدَّاعِي وَالدَّارُ الْإِسْلَامُ وَالْمَأْدُبَةُ الْجَنَّةُ. رَوَاهُ الدَّارمِيّ","english":{"narrator":"Rabi'a al-Jurashi said:","text":"A heavenly visitant came to God’s prophet, and he was told to let his eye sleep, his ear hear, and his heart understand. He said, “My eyes then slept, my ears heard, and my heart understood, and I was told that a lord built a house, prepared a feast, and sent one to issue invitations. Whoever responds to the one who invites him will enter the house, eat of the feast, and enjoy the lord’s favour; but whoever does not respond to the one who invites him will not enter the house, or eat of the feast, and he will incur the lord's anger.” He explained that God is the lord, Muhammad is the one who delivers the invitation, the house is Islam, and the feast is paradise. \n\nDarimi transmitted it."}},{"id":156,"idInBook":156,"chapterId":1,"bookId":14,"arabic":"وَعَن أبي رَافع وَغَيره رَفعه قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا أُلْفِيَنَّ أَحَدَكُمْ مُتَّكِئًا عَلَى أَرِيكَتِهِ يَأْتِيهِ أَمر مِمَّا أَمَرْتُ بِهِ أَوْ نَهَيْتُ عَنْهُ فَيَقُولُ لَا أَدْرِي مَا وَجَدْنَا فِي كِتَابِ اللَّهِ اتَّبَعْنَاهُ» . رَوَاهُ أَحْمَدُ وَأَبُو دَاوُدَ وَالتِّرْمِذِيُّ وَابْنُ مَاجَهْ وَالْبَيْهَقِيّ فِي دَلَائِل النُّبُوَّة. وَقَالَ التِّرْمِذِيّ حسن صَحِيح","english":{"narrator":"","text":"Abu Rafi‘ reported God’s messenger as saying, “Let me not find one of you reclining on his couch when he hears something regard which I have commanded or forbidden and saying, ‘I do not know, we found in God’s Book we have followed.’ ” \n\nAhmad, Tirmidhi, A Dawud, Ibn Majah, and Baihaqi (in Dala’il an-nubuwa) transmitted it."}},{"id":157,"idInBook":157,"chapterId":1,"bookId":14,"arabic":"وَعَن الْمِقْدَام بن معدي كرب عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنه قَالَ: «أَلا إِنِّي أُوتيت الْكتاب وَمِثْلَهُ مَعَهُ أَلَا يُوشِكُ رَجُلٌ شَبْعَانٌ عَلَى أَرِيكَتِهِ يَقُولُ عَلَيْكُمْ بِهَذَا الْقُرْآنِ فَمَا وَجَدْتُمْ فِيهِ مِنْ حَلَالٍ فَأَحِلُّوهُ وَمَا وَجَدْتُمْ فِيهِ مِنْ حَرَامٍ فَحَرِّمُوهُ وَإِنَّ مَا حَرَّمَ رَسُولُ الله كَمَا حَرَّمَ اللَّهُ أَلَا لَا يَحِلُّ لَكُمُ لحم الْحِمَارُ الْأَهْلِيُّ وَلَا كُلُّ ذِي نَابٍ مِنَ السَّبع وَلَا لُقَطَةُ مُعَاهَدٍ إِلَّا أَنْ يَسْتَغْنِيَ عَنْهَا صَاحِبُهَا وَمَنْ نَزَلَ بِقَوْمٍ فَعَلَيْهِمْ أَنْ يُقْرُوهُ فَإِنْ لَمْ يَقْرُوهُ فَلَهُ أَنْ يُعْقِبَهُمْ بِمِثْلِ قِرَاهُ» رَوَاهُ أَبُو دَاوُدَ وَرَوَى الدَّارِمِيُّ نَحْوَهُ وَكَذَا ابْنُ مَاجَهْ إِلَى قَوْلِهِ: «كَمَا حَرَّمَ الله»","english":{"narrator":"","text":"Al-Miqdam b. Ma'dikarib reported God’s messenger as saying, “I have indeed been brought the Qur’an and something like it along with it, yet the time is coming when a man replete on his couch will say, ‘Keep to this Qur’an; what you find in it to be permissible treat as permissible, and what you find in it to be prohibited treat as prohibited.’ But what God’s messenger has prohibited is like what God has prohibited. The domestic ass, beasts of prey with fangs, a find belonging to a confederate, unless its owner does not want it, are not permissible to you. If anyone comes to some people they must entertain him, but if they do not, he has a right to mulct them to an amount equivalent to his entertainment.” \n\nAbu Dawud transmitted it, and Darimi transmitted something similar. Ibn Majah transmitted the same up to “like what God has prohibited.”"}},{"id":158,"idInBook":158,"chapterId":1,"bookId":14,"arabic":"وَعَن الْعِرْبَاض بن سَارِيَة قَالَ: قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «أيحسب أحدكُم متكأ عَلَى أَرِيكَتِهِ يَظُنُّ أَنَّ اللَّهَ لَمْ يُحَرِّمْ شَيْئًا إِلَّا مَا فِي هَذَا الْقُرْآنِ أَلَا وَإِنِّي وَاللَّهِ قَدْ أَمَرْتُ وَوَعَظْتُ وَنَهَيْتُ عَنَ أَشْيَاءَ إِنَّهَا لَمِثْلُ الْقُرْآنِ أَوْ أَكْثَرُ وَإِنَّ اللَّهَ لَمْ يُحِلَّ لَكُمْ أَنْ تَدْخُلُوا بُيُوتَ أَهْلِ الْكِتَابِ إِلَّا بِإِذْنٍ وَلَا ضَرْبَ نِسَائِهِمْ وَلَا أَكْلَ ثِمَارِهِمْ إِذَا أَعْطَوْكُمُ الَّذِي عَلَيْهِمْ» رَوَاهُ أَبُو دَاوُدَ وَفِي إِسْنَادِهِ: أَشْعَثُ بْنُ شُعْبَة المصِّيصِي قد تكلم فِيهِ","english":{"narrator":"","text":"Al-Irbad b. Sariya declared that God’s messenger got up and said, “Does any of you, while reclining on his couch, imagine that God has prohibited only what is to be found in the Qur’an? By God, I have commanded, exhorted and prohibited various matters as numerous as what is found in the Qur’an, or more numerous. God has not permitted you to enter the houses of the people of the Book without permission, or dishonour their women, or eat their fruits, when they give you what is imposed on them.” 1\n\n1 The source from which this tradition comes is omitted. The editor of Damascus edition of the Mishkat notes that it comes from Abu Dawud. It is Abu Dawud Kitab al-kharaj wal imara wal fai’ bab 33."}},{"id":159,"idInBook":159,"chapterId":1,"bookId":14,"arabic":"وَعَنْهُ: قَالَ: صَلَّى بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ يَوْمٍ ثُمَّ أَقْبَلَ عَلَيْنَا بِوَجْهِهِ فَوَعَظَنَا مَوْعِظَةً بَلِيغَةً ذَرَفَتْ مِنْهَا الْعُيُونُ وَوَجِلَتْ مِنْهَا الْقُلُوبُ فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ كَأَنَّ هَذِهِ مَوْعِظَةُ مُوَدِّعٍ فَأَوْصِنَا قَالَ: «أُوصِيكُمْ بِتَقْوَى اللَّهِ وَالسَّمْعِ وَالطَّاعَةِ وَإِنْ كَانَ عبدا حَبَشِيًّا فَإِنَّهُ من يَعش مِنْكُم يرى اخْتِلَافًا كَثِيرًا فَعَلَيْكُمْ بِسُنَّتِي وَسُنَّةِ الْخُلَفَاءِ الرَّاشِدِينَ الْمَهْدِيِّينَ تَمَسَّكُوا بِهَا وَعَضُّوا عَلَيْهَا بِالنَّوَاجِذِ وَإِيَّاكُمْ وَمُحْدَثَاتِ الْأُمُورِ فَإِنَّ كُلَّ مُحْدَثَةٍ بِدْعَةٌ وَكُلَّ بِدْعَةٍ ضَلَالَةٌ» . رَوَاهُ أَحْمَدُ وَأَبُو دَاوُدَ وَالتِّرْمِذِيُّ وَابْنُ مَاجَهْ إِلَّا أَنَّهُمَا لَمْ يَذْكُرَا الصَّلَاةَ","english":{"narrator":"He also said that God’s messenger led them in prayer one day, then faced them and gave them a lengthy exhortation at which their eyes shed tears and their hearts were afraid. A man said, “Messenger of God, it seems as if this were a farewell exhortation, so give us an injunction.” He then said, “I enjoin you to fear God, and to hear and obey even if it be an Abyssinian slave, for those of you .who live after me will see great disagreement. You must therefore follow my sunna and that of the rightly guided Caliphs. Hold to it and stick fast to it. 1 Avoid novelties, for every novelty is an innovation, and every innovation is error.” \n\nAhmad, Abu Dawud, Tirmidhi and Ibn Majah transmitted it, but the last two did not mention the prayer.\n\n1 Lit. :","text":"Bite on it with the molar teeth."}},{"id":160,"idInBook":160,"chapterId":1,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ خَطَّ لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَطًّا ثُمَّ قَالَ: «هَذَا سَبِيلُ اللَّهِ ثُمَّ خَطَّ خُطُوطًا عَنْ يَمِينِهِ وَعَنْ شِمَالِهِ وَقَالَ هَذِهِ سُبُلٌ عَلَى كُلِّ سَبِيلٍ مِنْهَا شَيْطَانٌ يَدْعُو إِلَيْهِ» ثمَّ قَرَأَ (إِن هَذَا صِرَاطِي مُسْتَقِيمًا فَاتَّبعُوهُ)\nالْآيَة. رَوَاهُ أَحْمد وَالنَّسَائِيّ والدارمي","english":{"narrator":"","text":"‘Abdallah b. Mas'ud told how God’s messenger drew a line for them and then said, “This is God’s path.” Thereafter he drew several lines on his right and left and said, “These are paths on each of which there is a devil who invites people to follow it.” And he recited, “And that this is my path, straight; follow it...” 1\n\nAhmad, Nasa’I and Darimi transmitted it.\n\n1 Quran iv, 153."}},{"id":161,"idInBook":161,"chapterId":1,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يُؤْمِنُ أَحَدُكُمْ حَتَّى يَكُونَ هَوَاهُ تَبَعًا لِمَا جِئْتُ بِهِ» رَوَاهُ فِي شَرْحِ السُّنَّةَ وَقَالَ النَّوَوِيُّ فِي أَرْبَعِينِهِ: هَذَا حَدِيثٌ صَحِيحٌ رَوَيْنَاهُ فِي كتاب الْحجَّة بِإِسْنَاد صَحِيح","english":{"narrator":"","text":"‘Abdallah b. ‘Amr reported God’s messenger as saying, “None of you is a believer till his desire follows what I have brought.” \nHe transmitted it in Sharh al-sunna ; and an-Nawawi said in his Arba’in, “This is a sound tradition which we have transmitted in Kitab al-hujja with a sound isnad.”"}},{"id":162,"idInBook":162,"chapterId":1,"bookId":14,"arabic":"وَعَنْ بِلَالِ بْنِ الْحَارِثِ الْمُزَنِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «من أَحْيَا سُنَّةً مِنْ سُنَّتِي قَدْ أُمِيتَتْ بَعْدِي فَإِنَّ لَهُ مِنَ الْأَجْرِ مِثْلَ أُجُورِ مَنْ عَمِلَ بِهَا مِنْ غَيْرِ أَنْ يَنْقُصَ مِنْ أُجُورِهِمْ شَيْئًا وَمَنِ ابْتَدَعَ بِدْعَةً ضَلَالَةً لَا يَرْضَاهَا اللَّهُ وَرَسُولُهُ كَانَ عَلَيْهِ مِنَ الْإِثْمِ مِثْلُ آثَامِ مَنْ عَمِلَ بِهَا لَا يَنْقُصُ من أوزارهم شَيْئا» . رَوَاهُ التِّرْمِذِيّ\nوَرَوَاهُ ابْنُ مَاجَهْ عَنْ كَثِيرِ بْنِ عَبْدِ اللَّهِ بْنِ عَمْرٍو عَنْ أَبِيهِ عَنْ جَدِّهِ","english":{"narrator":"","text":"Bilal b. Harith al-Muzani reported God’s messenger as saying, “Whoever revives a sunna of mine which has been neglected after my time will have a reward equal to the rewards of those who act upon it, without their rewards being diminished in any way. But whoever invents a misleading innovation with which God and His messenger are not pleased will be charged with a sin equal to the sins of those who act upon it without that diminishing their loads in any way.” \n\nTirmidhi transmitted it, and Ibn Majah transmitted it from Kathir b. ‘Abdallah b. ‘Amr from his father from his grandfather."}},{"id":163,"idInBook":163,"chapterId":1,"bookId":14,"arabic":"وَعَنْ عَمْرِو بْنِ عَوْفٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ الدِّينَ لَيَأْرِزُ إِلَى الْحِجَازِ كَمَا تَأْرِزُ الْحَيَّةُ إِلَى جُحْرِهَا وَلَيَعْقِلَنَّ الدِّينُ مِنَ الْحِجَازِ مِعْقَلَ الْأُرْوِيَّةِ مِنْ رَأْسِ الْجَبَلِ إِنَّ الدِّينَ بَدَأَ غَرِيبًا وَسَيَعُودُ كَمَا بَدَأَ فَطُوبَى لِلْغُرَبَاءِ وَهُمُ الَّذِينَ يُصْلِحُونَ مَا أَفْسَدَ النَّاسُ مِنْ بَعْدِي من سنتي» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"‘Amr b. ‘Auf reported God’s messenger as saying, “The religion will shrink back to the Hijaz as a snake shrinks back to its hole, and the religion will seek refuge in the Hijaz as the mountain goat seeks refuge in the mountain top. The religion began few in number and will return to the state in which it began. Blessed are the few, for they will set right the corruptions caused in my sunna by people after my death.” \n\nTirmidhi transmitted it."}},{"id":164,"idInBook":164,"chapterId":1,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَيَأْتِيَنَّ عَلَى أُمَّتِي مَا أَتَى عَلَى بَنِي إِسْرَائِيلَ حَذْوَ النَّعْلِ بِالنَّعْلِ حَتَّى إِنَّ كَانَ مِنْهُمْ مَنْ أَتَى أُمَّهُ عَلَانِيَةً لَكَانَ فِي أُمَّتِي مَنْ يَصْنَعُ ذَلِكَ وَإِنَّ بَنِي إِسْرَائِيلَ تَفَرَّقَتْ عَلَى ثِنْتَيْنِ وَسَبْعِينَ مِلَّةً وَتَفْتَرِقُ أُمَّتِي عَلَى ثَلَاثٍ وَسَبْعِينَ مِلَّةً كُلُّهُمْ فِي النَّارِ إِلَّا مِلَّةً وَاحِدَةً قَالُوا وَمن هِيَ يَا رَسُولَ اللَّهِ قَالَ مَا أَنَا عَلَيْهِ وأصحابي» . رَوَاهُ التِّرْمِذِيّ\nوَفِي رِوَايَةِ أَحْمَدَ وَأَبِي دَاوُدَ عَنْ مُعَاوِيَةَ: «ثِنْتَانِ وَسَبْعُونَ فِي النَّارِ وَوَاحِدَةٌ فِي الْجَنَّةِ وَهِيَ الْجَمَاعَةُ وَإِنَّهُ سَيَخْرُجُ فِي أُمَّتِي أَقْوَامٌ تَتَجَارَى بِهِمْ تِلْكَ الْأَهْوَاءُ كَمَا يَتَجَارَى الْكَلْبُ بِصَاحِبِهِ لَا يَبْقَى مِنْهُ عِرْقٌ وَلَا مَفْصِلٌ إِلَّا دخله»","english":{"narrator":"","text":"‘Abdallah b. ‘Amr reported God's messenger as saying, “My people will experience what the B. Isra’il experienced, as closely as one sandal resembles another. If they had among them one who openly- had intercourse with his mother, among my people there will be one who does that. The B. Isra’il divided into 72 sects, but my people will divide into 73 sects, all of which but one will go to hell.” On being asked which it was, he replied, “It is the one to which I and my companions belong.” \n\nTirmidhi transmitted it. \nA version by Ahmad and Abu Dawud from Mu'awiya has, “Seventy-two will be in hell and one in paradise, it being the community. And folk will come forth from among my people in whom those passions will run as does hydrophobia in one who suffers from it, permeating every vein and joint.”"}},{"id":165,"idInBook":165,"chapterId":1,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" إِنَّ اللَّهَ لَا يَجْمَعُ أُمَّتِي أَوْ قَالَ: أُمَّةَ مُحَمَّدٍ عَلَى ضَلَالَةٍ وَيَدُ اللَّهِ عَلَى الْجَمَاعَةِ وَمَنْ شَذَّ شَذَّ فِي النَّار \". . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Ibn ‘Umar reported God’s messenger as saying, “God will not cause all my people (or he said, Muhammad’s people) to err. God’s hand is over the community, and he who is separate from it will be separate in hell.” \n\nTirmidhi transmitted it."}},{"id":166,"idInBook":166,"chapterId":1,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «اتَّبِعُوا السَّوَادَ الْأَعْظَمَ فَإِنَّهُ مَنْ شَذَّ شَذَّ فِي النَّارِ» . رَوَاهُ ابْنُ مَاجَهْ من حَدِيث أنس","english":{"narrator":"","text":"He also reported God's messenger as saying, “Follow the main body, for he who is separate from it will be separate in hell.” 1\n\n1 The source is lacking. The editor of Damascus edition quotes Mirak Shah as saying Ibn Majah gives this tradition from Anas. Ibn Majah (fitran, 8) has part of this in a tradition from Anas."}},{"id":167,"idInBook":167,"chapterId":1,"bookId":14,"arabic":"وَعَن أنس قَالَ: قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَا بُنَيَّ إِنْ قَدَرْتَ أَنْ تصبح وتمسي لَيْسَ فِي قَلْبِكَ غِشٌّ لِأَحَدٍ فَافْعَلْ» ثُمَّ قَالَ: «يَا بني وَذَلِكَ من سنتي وَمن أَحْيَا سُنَّتِي فَقَدْ أَحَبَّنِي وَمَنْ أَحَبَّنِي كَانَ مَعِي فِي الْجنَّة» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Anas reported God’s messenger as saying, “Sonny, if you can keep your heart morning and evening void of deceit towards anyone, do so.” Then he said, “Sonny, that pertains to my sunna. He who loves my sunna has loved me, and he who loves me will be with me in paradise.”\n\nTirmidhi transmitted it."}},{"id":168,"idInBook":168,"chapterId":1,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ تَمَسَّكَ بِسُنَّتِي عِنْدَ فَسَادِ أُمَّتِي فَلَهُ أجر مائَة شَهِيد»","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as Saying, “He who holds fast to my sunna when my people are in a corrupt state will have the reward of a hundred martyrs.” 1\n\n1 The source is lacking. The editor of Damascus edition quotes Mirak Shah and others as saying Bayhaqi gives the tradition in his kitab az-Zuhd as coming from Ibn Abbas."}},{"id":169,"idInBook":169,"chapterId":1,"bookId":14,"arabic":"وَعَنْ جَابِرٌ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ أَتَاهُ عُمَرُ فَقَالَ إِنَّا نَسْمَعُ أَحَادِيثَ مِنْ يَهُودَ تُعْجِبُنَا أَفْتَرَى أَنْ نَكْتُبَ بَعْضَهَا؟ فَقَالَ: «أَمُتَهَوِّكُونَ أَنْتُمْ كَمَا تَهَوَّكَتِ الْيَهُودُ وَالنَّصَارَى؟ لَقَدْ جِئْتُكُمْ بِهَا بَيْضَاءَ نَقِيَّةً وَلَوْ كَانَ مُوسَى حَيًّا مَا وَسِعَهُ إِلَّا اتِّبَاعِي» . رَوَاهُ أَحْمد وَالْبَيْهَقِيّ فِي كتاب شعب الايمان","english":{"narrator":"","text":"Jabir told that when ‘Umar came to the Prophet saying, “We hear from Jews traditions which charm us, so do you think we should write down some of them ?” he replied, “Are you in a state of confusion as the Jews and the Christians were? I have brought them to you white and pure, and if Moses were alive he would feel it absolutely necessary to follow me.” \n\nAhmad transmitted it, and also Baihaqi in Shu’ab al-iman."}},{"id":170,"idInBook":170,"chapterId":1,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" مَنْ أَكَلَ طَيِّبًا وَعَمِلَ فِي سُنَّةٍ وَأَمِنَ النَّاسُ بَوَائِقَهُ دَخَلَ الْجَنَّةَ فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ إِن هَذَا الْيَوْم لكثيرفي النَّاسِ قَالَ: «وَسَيَكُونُ فِي قُرُونٍ بَعْدِي» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Abu Sa'id al-Khudri reported God’s messenger as saying, “If anyone eats what is good, acts according to a sunna, and men are safe from injuries on his part, he will enter paradise.” A man said, “Messenger of God, to-day there are many such among the people to which he replied, “And there will also be such in generations after my time.” \n\nTirmidhi transmitted it."}},{"id":171,"idInBook":171,"chapterId":1,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّكُم فِي زمَان تَرَكَ مِنْكُمْ عُشْرَ مَا أُمِرَ بِهِ هَلَكَ ثُمَّ يَأْتِي زَمَانٌ مَنْ عَمِلَ مِنْهُمْ بِعُشْرِ مَا أَمر بِهِ نجا» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “In the times in which you are living, anyone who abandons a tenth of what he is commanded will perish; but a time is coming when anyone who does a tenth of what he is commanded will be safe.” \n\nTirmidhi transmitted it."}},{"id":172,"idInBook":172,"chapterId":1,"bookId":14,"arabic":"وَعَنْ أَبِي أُمَامَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا ضَلَّ قَوْمٌ بَعْدَ هُدًى كَانُوا عَلَيْهِ إِلَّا أُوتُوا الْجَدَلَ» . ثُمَّ قَرَأَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَذِهِ الْآيَةَ: (مَا ضَرَبُوهُ لَكَ إِلَّا جدلا بل هم قوم خصمون)\nرَوَاهُ أَحْمد وَالتِّرْمِذِيّ وَابْن مَاجَه","english":{"narrator":"","text":"Abu Umama reported God’s messenger as saying, “No people have gone astray after following right guidance unless they have been led into disputation.” Then God’s messenger recited this verse, “They only put him forth to you as a matter of dispute; nay, they are a contentious people.” 1\n\nAhmad, Tirmidhi, and Ibn Majah transmitted it.\n\n1 Quran xliii, 58."}},{"id":173,"idInBook":173,"chapterId":1,"bookId":14,"arabic":"وَعَن أَنَسِ بْنِ مَالِكٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ: لَا تُشَدِّدُوا عَلَى أَنْفُسِكُمْ فَيُشَدِّدَ اللَّهُ عَلَيْكُمْ فَإِنَّ قَوْمًا شَدَّدُوا عَلَى أَنْفُسِهِمْ فَشَدَّدَ اللَّهُ عَلَيْهِمْ فَتِلْكَ بَقَايَاهُمْ فِي الصَّوَامِعِ والديار (رَهْبَانِيَّة ابتدعوها مَا كتبناها عَلَيْهِم)\nرَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Anas declared that God’s messenger used to say, “Do not impose austerities on yourselves and so have God imposing austerities on you; for people have imposed austerities on themselves and God has imposed austerities on them. Their survivors are to be found in cells and monasteries.” , “Monasticism, they invented it; we did not prescribe it for them.” 1\n\nAbu Dawud transmitted it.\n\n1 ibid, lvii, 27."}},{"id":174,"idInBook":174,"chapterId":1,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" نَزَلَ الْقُرْآنُ عَلَى خَمْسَةِ أَوْجُهٍ: حَلَالٍ وَحَرَامٍ وَمُحْكَمٍ وَمُتَشَابِهٍ وَأَمْثَالٍ. فَأَحِلُّوا الْحَلَالَ وَحَرِّمُوا الْحَرَامَ وَاعْمَلُوا بِالْمُحْكَمِ وَآمِنُوا بِالْمُتَشَابِهِ وَاعْتَبِرُوا بِالْأَمْثَالِ \". هَذَا لَفْظَ الْمَصَابِيحِ. وَرَوَى الْبَيْهَقِيُّ فِي شُعَبِ الايمان وَلَفْظُهُ: «فَاعْمَلُوا بِالْحَلَالِ وَاجْتَنِبُوا الْحَرَامَ وَاتَّبِعُوا الْمُحْكَمَ»","english":{"narrator":"Abu Huraira reported God’s messenger as saying, “The Qur’an came down showing five aspects:","text":"what is permissible, what is prohibited, what is firmly fixed, what is obscure, and parables. So treat what is permissible as permissible and what is prohibited as prohibited, act upon what is firmly fixed; believe in what is obscure, and take a lesson from the parables.” \n\nThis is the wording in Al-masabih. Baihaqi transmitted it in Shu’ab al-iman, his wording being, “Act according to what is permissible, avoid what is prohibited, and follow what is firmly fixed.”"}},{"id":175,"idInBook":175,"chapterId":1,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" الْأَمْرُ ثَلَاثَةٌ: أَمْرٌ بَيِّنٌ رُشْدُهُ فَاتَّبِعْهُ وَأَمْرٌ بَيِّنٌ غَيُّهُ فَاجْتَنِبْهُ وَأَمْرٌ اخْتُلِفَ فِيهِ فَكِلْهُ إِلَى اللَّهِ عَزَّ وَجل)\nرَوَاهُ أَحْمد","english":{"narrator":"Ibn ‘Abbas reported God’s messenger as saying, “Things are of three categories:","text":"a matter whose right guidance is clear, which you must follow; a matter whose error is clear, which you must avoid; and a matter about which there is a difference of opinion, which you must entrust to God.” \n\nAhmad transmitted it."}},{"id":176,"idInBook":176,"chapterId":1,"bookId":14,"arabic":"عَنْ مُعَاذِ بْنِ جَبَلٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ الشَّيْطَانَ ذِئْبُ الْإِنْسَانِ كَذِئْبِ الْغَنَمِ يَأْخُذُ الشَّاذَّةَ وَالْقَاصِيَةَ وَالنَّاحِيَةَ وَإِيَاكُمْ وَالشِّعَابَ وَعَلَيْكُمْ بِالْجَمَاعَةِ وَالْعَامَّةِ» . رَوَاهُ أَحْمد","english":{"narrator":"","text":"Mu'adh b. Jabal reported God’s messenger as saying, “The devil is a wolf to man, like the wolf which harries sheep, catching the one which is solitary, the one which stays far from the flock, and the one which wanders. So avoid the branching paths and keep to the general community.” \n\nAhmad transmitted it."}},{"id":177,"idInBook":177,"chapterId":1,"bookId":14,"arabic":"وَعَنْ أَبِي ذَرٍّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ فَارَقَ الْجَمَاعَةَ شبْرًا فقد خلع رقة الْإِسْلَامِ مِنْ عُنُقِهِ» . رَوَاهُ أَحْمَدُ وَأَبُو دَاوُدَ","english":{"narrator":"","text":"Abu Dharr reported God’s messenger as saying, “He who separates himself a handbreadth from the community has cast off the rope of Islam from his neck.” \n\nAhmad and Abu Dawud transmitted it."}},{"id":178,"idInBook":178,"chapterId":1,"bookId":14,"arabic":"وَعَن مَالك بن أنس مُرْسَلًا قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" تَرَكْتُ فِيكُمْ أَمْرَيْنِ لَنْ تَضِلُّوا مَا تَمَسَّكْتُمْ بِهِمَا: كِتَابَ اللَّهِ وَسُنَّةَ رَسُولِهِ «. رَوَاهُ فِي الْمُوَطَّأ»","english":{"narrator":"Malik b. Anas, in mursal form, reported God’s messenger as saying, “As long as you hold fast to two things which I have left among you, you will not go astray:","text":"God’s Book and His messenger’s sunna” \n\nHe transmitted it in Al-Muwatta."}},{"id":179,"idInBook":179,"chapterId":1,"bookId":14,"arabic":"وَعَن غُضَيْف بن الْحَارِث الثمالِي قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: (مَا أَحْدَثَ قَوْمٌ بِدْعَةً إِلَّا رُفِعَ مِثْلُهَا مِنَ السُّنَّةِ فَتَمَسُّكٌ بِسُنَّةٍ خَيْرٌ مِنْ إِحْدَاث بِدعَة)\nرَوَاهُ أَحْمد","english":{"narrator":"","text":"Ghudaif b. al-Harith ath-Thumali reported God’s messenger as saying, “No people introduce an innovation without its equivalent being withdrawn from the sunna; so holding firmly to a sunna is better than introducing an innovation.” \n\nAhmad transmitted it."}},{"id":180,"idInBook":180,"chapterId":1,"bookId":14,"arabic":"وَعَنْ حَسَّانَ قَالَ: «مَا ابْتَدَعَ قَوْمٌ بِدْعَةً فِي دِينِهِمْ إِلَّا نَزَعَ اللَّهُ مِنْ سُنَّتِهِمْ مِثْلَهَا ثُمَّ لَا يُعِيدُهَا إِلَيْهِمْ إِلَى يَوْمِ الْقِيَامَة.» رَوَاهُ الدَّارمِيّ \"","english":{"narrator":"","text":"Hassan said that no people had produced an innovation in their religion without God removing an equivalent amount from their sunna, then not restoring it to them till the day of resurrection. \n\nDarimi transmitted it."}},{"id":181,"idInBook":181,"chapterId":1,"bookId":14,"arabic":"وَعَن إِبْرَاهِيم بن ميسرَة قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ وَقَّرَ صَاحِبَ بِدْعَةٍ فَقَدْ أَعَانَ عَلَى هَدْمِ الْإِسْلَامِ» . رَوَاهُ الْبَيْهَقِيُّ فِي شُعَبِ الايمان مُرْسلا","english":{"narrator":"","text":"Ibrahim b. Maisara reported God’s messenger as saying, “He who honours an innovator has assisted in undermining Islam.” \n\nBaihaqi transmitted it in mursal form in Shu'ab al-iman."}},{"id":182,"idInBook":182,"chapterId":1,"bookId":14,"arabic":"وَعَن ابْن عَبَّاس قَالَ: من تعلم كتاب الله ثمَّ ابتع مَا فِيهِ هَدَاهُ اللَّهُ مِنَ الضَّلَالَةِ فِي الدُّنْيَا وَوَقَاهُ يَوْمَ الْقِيَامَةِ سُوءَ الْحِسَابِ\nوَفِي رِوَايَةٍ قَالَ: مَنِ اقْتَدَى بِكِتَابِ اللَّهِ لَا يَضِلُّ فِي الدُّنْيَا وَلَا يَشْقَى فِي الْآخِرَةِ ثُمَّ تَلَا هَذِهِ الْآيَةَ: (فَمَنِ اتَّبَعَ هُدَايَ فَلَا يضل وَلَا يشقى)\nرَوَاهُ رزين","english":{"narrator":"","text":"Ibn ‘Abbas said that if anyone learns God’s Book and follows its contents, he will be guided by God away from error in this world and be guarded by Him on the day of resurrection from the strictest account. A version renders him as saying that one who models his life on God’s Book will not go astray in this world, or be miserable in the next. Then he recited this verse, “He who follows my guidance will not go astray or be miserable.” 1\n\nRazin transmitted it.\n\n1 Quran xx, `123."}},{"id":183,"idInBook":183,"chapterId":1,"bookId":14,"arabic":"وَعَنِ ابْنِ مَسْعُودٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \" ضَرَبَ اللَّهُ مَثَلًا صِرَاطًا مُسْتَقِيمًا وَعَنْ جَنَبَتَيِ الصِّرَاطِ سُورَانِ فِيهِمَا أَبْوَابٌ مُفَتَّحَةٌ وَعَلَى الْأَبْوَابِ سُتُورٌ مُرَخَاةٌ وَعِنْدَ رَأْسِ الصِّرَاطِ دَاعٍ يَقُولُ: اسْتَقِيمُوا عَلَى الصِّرَاطِ وَلَا تَعْوَجُّوا وَفَوْقَ ذَلِكَ دَاعٍ يَدْعُو كُلَّمَا هَمَّ عَبْدٌ أَنْ يَفْتَحَ شَيْئًا مِنْ تِلْكَ الْأَبْوَابِ قَالَ: وَيْحَكَ لَا تَفْتَحْهُ فَإِنَّكَ إِنْ تَفْتَحْهُ تَلِجْهُ \". ثُمَّ فَسَّرَهُ فَأَخْبَرَ: \" أَنَّ الصِّرَاطَ هُوَ الْإِسْلَامُ وَأَنَّ الْأَبْوَابَ الْمُفَتَّحَةَ مَحَارِمُ اللَّهِ وَأَنَّ السُّتُورَ الْمُرَخَاةَ حُدُودُ اللَّهِ وَأَنَّ الدَّاعِيَ عَلَى رَأْسِ الصِّرَاطِ هُوَ الْقُرْآنُ وَأَنَّ الدَّاعِيَ مِنْ فَوْقِهِ وَاعِظُ اللَّهِ فِي قَلْبِ كُلِّ مُؤمن)\nرَوَاهُ رزين وَأحمد\nوَالْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَانِ عَنِ النَّوَّاسِ بْنِ سَمْعَانَ وَكَذَا التِّرْمِذِيُّ عَنْهُ إِلَّا أَنَّهُ ذَكَرَ أخصر مِنْهُ","english":{"narrator":"","text":"Ibn Mas'ud reported God’s messenger as saying, “God has propounded as a parable a straight path on the sides of which are walls with open doors over which curtains are hanging down. At the top of the path there is one who calls, ‘Go straight on the path and do not follow an irregular course.’ Above that one is another who calls out as often as anyone tries to open any of those doors, ‘Woe to you! do not open it, for if you open it you will go through it.’” He then interpreted it telling that the path is Islam, the open doors are the things God has forbidden, the curtains hanging down are the limits God has set, the crier at the top of the path is the Qur’an, and the one above him is God’s monitor in every believer’s heart. \n\nRazin and Ahmad transmitted it. Baihaqi transmitted it in Shu'ab al-iman from an-Nawwas b. Sim'an, as did Tirmidhi in a more concise form."}},{"id":184,"idInBook":184,"chapterId":1,"bookId":14,"arabic":"وَعَنِ ابْنِ مَسْعُودٍ قَالَ: مَنْ كَانَ مُسْتَنًّا فليستنًّ بِمَنْ قَدْ مَاتَ فَإِنَّ الْحَيَّ لَا تُؤْمَنُ عَلَيْهِ الْفِتْنَةُ. أُولَئِكَ أَصْحَابُ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانُوا أَفْضَلَ هَذِهِ الْأُمَّةِ أَبَرَّهَا قُلُوبًا وَأَعْمَقَهَا عِلْمًا وَأَقَلَّهَا تَكَلُّفًا اخْتَارَهُمُ اللَّهُ لِصُحْبَةِ نَبِيِّهِ وَلِإِقَامَةِ دِينِهِ فَاعْرِفُوا لَهُمْ فَضْلَهُمْ وَاتَّبِعُوهُمْ عَلَى آثَارِهِمْ وَتَمَسَّكُوا بِمَا اسْتَطَعْتُمْ مِنْ أَخْلَاقِهِمْ وَسِيَرِهِمْ فَإِنَّهُمْ كَانُوا عَلَى الْهَدْيِ الْمُسْتَقِيمِ. رَوَاهُ رزين","english":{"narrator":"","text":"Ibn Mas'ud said, ‘If anyone follows someone’s custom let him follow the custom of one who is dead, for one cannot be sure of the living not being led astray. Those to follow are Muhammad’s Companions who were the most excellent among the people, purest in heart, most profound in knowledge, most unassuming, whom God chose for companionship with His Prophet and to establish His religion. So recognise their excellence, follow their traces, and hold as fast as you can to their character and way of life, for they followed right guidance.” \n\nRazin transmitted it."}},{"id":185,"idInBook":185,"chapterId":1,"bookId":14,"arabic":"عَن جَابِرٍ: (أَنَّ عُمَرَ بْنَ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُمَا أَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِنُسْخَةٍ مِنَ التَّوْرَاةِ فَقَالَ يَا رَسُولَ اللَّهِ هَذِهِ نُسْخَةٌ مِنَ التَّوْرَاةِ فَسَكَتَ فَجَعَلَ يقْرَأ وَوجه رَسُول الله يَتَغَيَّرُ فَقَالَ أَبُو بَكْرٍ ثَكِلَتْكَ الثَّوَاكِلُ مَا تَرَى مَا بِوَجْهِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنَظَرَ عُمَرُ إِلَى وَجْهِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَعُوذُ بِاللَّه من غضب الله وَغَضب رَسُوله صلى الله عَلَيْهِ وَسلم رَضِينَا بِاللَّهِ رَبًّا وَبِالْإِسْلَامِ دِينًا وَبِمُحَمَّدٍ نَبِيًّا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَوْ بَدَا لَكُمْ مُوسَى فَاتَّبَعْتُمُوهُ وَتَرَكْتُمُونِي لَضَلَلْتُمْ عَنْ سَوَاءِ السَّبِيلِ وَلَوْ كَانَ حَيًّا وَأَدْرَكَ نُبُوَّتِي لَاتَّبَعَنِي)\nرَوَاهُ الدَّارمِيّ","english":{"narrator":"","text":"Jabir told how ‘Umar b. al-Khattab brought God’s messenger a copy of the Torah saying, “Messenger of God, this is a copy of the Torah.” When he received no reply he began to read to the obvious displeasure of God’s messenger, so Abu Bakr said, “Confound you 1 do you not see how God’s messenger is looking?” So ‘Umar looked at God’s messenger’s face and said, “I seek refuge in God from the anger of God and His messenger. We are satisfied with God as Lord, with Islam as religion, and with Muhammad as Prophet.” Then God’s messenger said, “By Him in whose hand Muhammad’s soul is, were Moses to appear to you and you were to follow him and abandon me, you would err from the right way. Were he alive and came in touch with my prophetic mission he would follow me.” \n\nDarimi transmitted it.\n\n1 Literally, may the bereaved be bereaved of you."}},{"id":186,"idInBook":186,"chapterId":1,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «كَلَامِي لَا يَنْسَخُ كَلَامَ اللَّهِ وَكَلَامُ اللَّهِ يَنْسَخُ كَلَامِي وَكَلَامُ اللَّهِ يَنْسَخُ بعضه بَعْضًا»","english":{"narrator":"","text":"He also reported God's messenger as saying, “My words do not abrogate God’s words, but God’s words abrogate mine, some of His words abrogate others.”\n\nDaraqutni transmitted it."}},{"id":187,"idInBook":187,"chapterId":1,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ أَحَادِيثَنَا يَنْسَخُ بَعْضهَا بَعْضًا كنسخ الْقُرْآن»","english":{"narrator":"","text":"Ibn ‘Umar reported God’s messenger as saying, “Some of my traditions abrogate others just as some parts of the Qur’an abrogate others.”\n\nDaraqutni transmitted it."}},{"id":188,"idInBook":188,"chapterId":1,"bookId":14,"arabic":"وَعَن أبي ثَعْلَبَة الْخُشَنِي قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ اللَّهَ فَرَضَ فَرَائِضَ فَلَا تُضَيِّعُوهَا وَحَرَّمَ حُرُمَاتٍ فَلَا تَنْتَهِكُوهَا وَحَدَّ حُدُودًا فَلَا تَعْتَدُوهَا وَسَكَتَ عَنْ أَشْيَاءَ مِنْ غَيْرِ نِسْيَانٍ فَلَا تَبْحَثُوا عَنْهَا» . رَوَى الْأَحَادِيثَ الثَّلَاثَةَ الدَّارَقُطْنِيُّ","english":{"narrator":"","text":"Abu Tha'laba al-Khushani reported God’s messenger as saying, “God has made certain things binding, so do not cause them to be lost; He has prohibited certain things, so do not violate them; He has fixed certain limits, so do not transgress them; and He, without being forgetful, has said nothing about certain things, so do not search into them.” \n\nDaraqutni transmitted it."}}],"chapter":{"id":1,"bookId":14,"arabic":"كتاب الإيمان","english":"Faith"}}