{"metadata":{"length":246,"arabic":{"title":"مشكاة المصابيح","author":"الإمام الكاتب التبريزي","introduction":"كتاب المناسك"},"english":{"title":"Mishkat al-Masabih","author":"Al-Khatib Al-Tabrizi","introduction":"The Rites of Pilgrimage"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":10,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ قَالَ:: خَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «يَا أَيُّهَا النَّاسُ قَدْ فُرِضَ عَلَيْكُمُ الْحَجُّ فَحُجُّوا» فَقَالَ رَجُلٌ: أَكُلَّ عَامٍ يَا رَسُولَ اللَّهِ؟ فَسَكَتَ حَتَّى قَالَهَا ثَلَاثًا فَقَالَ: \" لَوْ قُلْتُ: نَعَمْ لَوَجَبَتْ وَلَمَا اسْتَطَعْتُمْ \" ثُمَّ قَالَ: ذَرُونِي مَا تَرَكْتُكُمْ فَإِنَّمَا هَلَكَ مَنْ كَانَ قَبْلَكُمْ بِكَثْرَةِ سُؤَالِهِمْ وَاخْتِلَافِهِمْ عَلَى أَنْبِيَائِهِمْ فَإِذَا أَمَرْتُكُمْ بِشَيْءٍ فَأْتُوا مِنْهُ مَا اسْتَطَعْتُمْ وَإِذَا نَهَيْتُكُمْ عَنْ شَيْء فدَعُوه \". رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Huraira told that God's messenger addressed them saying, “Pilgrimage (In what follows I have used the word \"pilgrimage” where only the hajj is intended; but when reference is made to both hajj and ’umra the Arabic words are used without translation to avoid misunderstanding.) has been ordained for you people, so perform it.” A man asked whether it should be performed annually, but God’s messenger gave no reply till he had asked the question three times. Then he said, “If I were to say that it should, it would be obligatory and you would not be able to perform it,” after which he said, “Leave me alone as long as I have said nothing to you, for your predecessors perished simply on account of their much questioning and their disagreement with their prophets. But when I command you to do anything, obey it as much as you can; and when I forbid you to do anything, leave it alone.”\n\nMuslim transmitted it."}},{"id":2,"idInBook":2,"chapterId":10,"bookId":14,"arabic":"وَعَنْهُ قَالَ: سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أَيُّ الْعَمَلِ أَفْضَلُ؟ قَالَ: «إِيمَانٌ بِاللَّهِ وَرَسُولِهِ» قِيلَ: ثُمَّ مَاذَا؟ قَالَ: «الْجِهَادُ فِي سَبِيلِ اللَّهِ» . قِيلَ: ثُمَّ مَاذَا؟ قَالَ: «حَجٌّ مبرورٌ»","english":{"narrator":"","text":"He said that God’s messenger was asked what action was most excellent and replied that it was faith in God and His messenger. He was asked what came next and replied that it was jihad in God’s path. He was asked what came next and replied that it was a pilgrimage which was accepted. \n\nBukhari and Muslim."}},{"id":3,"idInBook":3,"chapterId":10,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «مِنْ حَجَّ فَلَمْ يَرْفُثْ وَلَمْ يَفْسُقْ رَجَعَ كَيَوْمِ وَلَدَتْهُ أمه»","english":{"narrator":"","text":"He reported God’s messenger as saying, “If anyone performs the pilgrimage for God’s sake without talking immodestly or acting wickedly, he will return  as on the day his mother bore him.” \n\nBukhari and Muslim."}},{"id":4,"idInBook":4,"chapterId":10,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْعُمْرَةُ إِلَى الْعُمْرَةِ كَفَّارَةٌ لِمَا بَيْنَهُمَا وَالْحَجُّ الْمَبْرُورُ لَيْسَ لَهُ جَزاءٌ إِلا الجنَّةُ»","english":{"narrator":"","text":"He reported God’s messenger as saying, “An 'umra is an expiation for sins committed between it and the next, but a hajj which is accepted will receive no less a reward than paradise.” \n\nBukhari and Muslim."}},{"id":5,"idInBook":5,"chapterId":10,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «إِن عمْرَة فِي رَمَضَان تعدل حجَّة»\nوَعَنْهُ قَالَ: إِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَقِيَ رَكْبًا بِالرَّوْحَاءِ فَقَالَ: «مَنِ الْقَوْمُ؟» قَالُوا: الْمُسْلِمُونَ. فَقَالُوا: مَنْ أَنْتَ؟ قَالَ: «رَسُولُ اللَّهِ» فَرَفَعَتْ إِلَيْهِ امْرَأَةٌ صَبِيًّا فَقَالَتْ: أَلِهَذَا حَجٌّ؟ قَالَ: «نَعَمْ وَلَكِ أَجَرٌ» . رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"Ibn ‘Abbas reported God’s messenger as saying, “An 'umra in Ramadan is equal to a hajja. ” (hajj is the word for the pilgrimage and hajja is a form indicating a single observance.)\n\nHe told of the Prophet meeting some riders at ar-Rauha’ (A place between thirty and forty miles from Medina on the way to Mecca) and asking who they were. They replied that they were Muslims and asked who he was. When he said that he was God's messenger a woman lifted up a boy to him and asked whether the child could be credited with having performed the pilgrimage, to which he replied, “Yes, and you will have a reward.” \n\nMuslim transmitted it."}},{"id":6,"idInBook":6,"chapterId":10,"bookId":14,"arabic":"وَعَنْهُ قَالَ: إِنَّ امْرَأَةً مِنْ خَثْعَمَ قَالَتْ: يَا رَسُول الله إِن فَرِيضَة الله عِبَادِهِ فِي الْحَجِّ أَدْرَكَتْ أَبِي شَيْخًا كَبِيرًا لَا يَثْبُتُ عَلَى الرَّاحِلَةِ أَفَأَحُجُّ عَنْهُ؟ قَالَ: «نعم» ذَلِك حجَّة الْوَدَاع","english":{"narrator":"","text":"He told of a woman of Khath'am saying, “Messenger of God, God’s ordinance that His servants should perform the pilgrimage has come when my father is a very old man and is unable to sit firmly on a camel. May I perform the pilgrimage on his behalf?” He replied that she might. That was at the Farewell Pilgrimage. \n\nBukhari and Muslim."}},{"id":7,"idInBook":7,"chapterId":10,"bookId":14,"arabic":"وَعَنْهُ قَالَ: أَتَى رَجُلٌ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: إِنَّ أُخْتِي نَذَرَتْ أَنْ تَحُجَّ وَإِنَّهَا مَاتَتْ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَوْ كَانَ عَلَيْهَا دَيْنٌ أَكَنْتَ قَاضِيَهُ؟» قَالَ: نَعَمْ قَالَ: «فَاقْضِ دَيْنَ اللَّهِ فَهُوَ أَحَقُّ بِالْقَضَاءِ»","english":{"narrator":"","text":"He told of a man coming to the Prophet and saying that his sister had taken a vow to make the pilgrimage, but had died. The Prophet asked whether he would pay a debt, supposing she owed one, and when he replied that he would, he said, “Well, pay the debt due to God, for it is the one which most deserves to be paid.” \n\nBukhari and Muslim."}},{"id":8,"idInBook":8,"chapterId":10,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَخْلُوَنَّ رَجُلٌ بِامْرَأَةٍ وَلَا تُسَافِرَنَّ امْرَأَةٌ إِلَّا وَمَعَهَا مَحْرَمٌ» . فَقَالَ رَجُلٌ: يَا رَسُولَ اللَّهِ اكْتُتِبْتُ فِي غَزْوَةِ كَذَا وَكَذَا وَخَرَجَتِ امْرَأَتِي حَاجَّةً قَالَ: «اذهبْ فاحجُجْ مَعَ امرأتِكَ»","english":{"narrator":"","text":"He reported God’s messenger as saying, “A man must not be alone with a woman, and a woman must travel only when accompanied by a man who is within the prohibited degrees.” A man said, “I have been enrolled for such and such an expedition, and my wife intends to go out to perform the pilgrimage.” He therefore told him to go and perform the pilgrimage along with his wife. \n\nBukhari and Muslim."}},{"id":9,"idInBook":9,"chapterId":10,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ قَالَتْ: اسْتَأْذَنْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْجِهَادِ. فَقَالَ: «جهادكن الْحَج»","english":{"narrator":"","text":"‘Aisha said she asked the Prophet’s permission to take part in jihad, and he replied, “The jihad of you women is the pilgrimage.” \n\nBukhari and Muslim."}},{"id":10,"idInBook":10,"chapterId":10,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تُسَافِرُ امْرَأَةٌ مَسِيرَةَ يَوْمٍ وَلَيْلَةٍ إِلَّا وَمَعَهَا ذُو محرم»","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “A woman must not make a journey of a day and a night unless she is accompanied by a man who is within the prohibited degrees.” \n\nBukhari and Muslim."}},{"id":11,"idInBook":11,"chapterId":10,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: وَقَّتَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأَهْلِ الْمَدِينَةِ: ذَا الْحُلَيْفَةِ وَلِأَهْلِ الشَّامِ: الْجُحْفَةَ وَلِأَهْلِ نَجْدٍ: قَرْنَ الْمَنَازِلِ وَلِأَهْلِ الْيَمَنِ: يَلَمْلَمَ فَهُنَّ لَهُنَّ وَلِمَنْ أَتَى عَلَيْهِنَّ مِنْ غَيْرِ أَهْلِهِنَّ لِمَنْ كَانَ يُرِيدُ الْحَجَّ وَالْعُمْرَةَ فَمَنْ كَانَ دُونَهُنَّ فَمُهَلُّهُ مِنْ أَهْلِهِ وَكَذَاكَ وَكَذَاكَ حَتَّى أهل مَكَّة يهلون مِنْهَا","english":{"narrator":"Ibn ‘Abbas said that God’s messenger appointed the following places for putting on the ihram:","text":"Dhul Hulaifa for the people of Medina, al- Juhfa for the people of Syria, Qarn al-Manazil for the people of Najd, and Yalamlam for the people of the Yemen ; so these spots are for these regions and for people of other regions who come to them intending to perform the hajj and the ‘umra. The place where those who live nearer to Mecca should put on the ihram (The pilgrim dress) is where they live, and so on and so on up to the inhabitants of Mecca itself who put on the ihram in it. \n\nBukhari and Muslim."}},{"id":12,"idInBook":12,"chapterId":10,"bookId":14,"arabic":"وَعَنْ جَابِرٍ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مُهَلُّ أَهْلِ الْمَدِينَةِ مِنْ ذِي الْحُلَيْفَةِ وَالطَّرِيقُ الْآخَرُ الْجُحْفَةُ وَمُهَلُّ أَهْلِ الْعِرَاقِ مِنْ ذَاتِ عِرْقٍ وَمُهَلُّ أَهْلِ نَجْدٍ قَرْنٌ وَمُهَلُّ أَهْلِ الْيَمَنِ يَلَمْلَمُ» . رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"Jabir reported God’s messenger as saying, “The place for the people of Medina to put on the ihram is Dhul Hulaifa, and on the other road al-Juha. For the people of al-Iraq it is Dhat ‘Irq, for the people of Najd it is Qarn, and for the people of the Yemen it is Yalamlam.\" \n\nMuslim transmitted it."}},{"id":13,"idInBook":13,"chapterId":10,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: اعْتَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْبَعٌ عُمَرٍ كُلُّهُنَّ فِي ذِي الْقَعْدَةِ إِلَّا الَّتِي كَانَتْ مَعَ حَجَّتِهِ: عُمْرَةً مِنَ الْحُدَيْبِيَةِ فِي ذِي الْقَعْدَةِ وَعُمْرَةً مِنَ الْعَامِ الْمُقْبِلِ فِي ذِي الْقَعْدَةِ وَعُمْرَةً مِنَ الْجِعْرَانَةِ حَيْثُ قَسَّمَ غَنَائِمَ حُنَيْنٍ فِي ذِي الْقَعْدَةِ وَعُمْرَةً مَعَ حَجَّتِهِ \"","english":{"narrator":"","text":"Anas said that God’s messenger performed the 'umra four times, each of them Dhul Qa'da except the one which was combined with his hajja, one from al-Hudaibiya in Dhul Qa'da, one in the following year in Dhul Qa'da, one from al-Ji'rana where he divided the spoils of Hunain (The battle in which the Prophet defeated Hawazin after the conquest of Mecca in 8 A.H) in Dhul Qa'da, and one along with his hajja.\n\n Bukhari and Muslim."}},{"id":14,"idInBook":14,"chapterId":10,"bookId":14,"arabic":"وَعَنِ الْبَرَاءِ بْنِ عَازِبٍ قَالَ: اعْتَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي ذِي الْقَعْدَةِ قَبْلَ أَنْ يَحُجَّ مَرَّتَيْنِ \". رَوَاهُ الْبُخَارِيُّ","english":{"narrator":"","text":"Al-Bara’ b. ‘Azib said that God’s messenger performed the ‘umra twice in Dhul Qa'da before performing the hajj. \n\nBukhari transmitted it."}},{"id":15,"idInBook":15,"chapterId":10,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَا أَيُّهَا النَّاسُ إِنَّ اللَّهَ كَتَبَ عَلَيْكُمُ الْحَجَّ» . فَقَامَ الْأَقْرَعُ بْنُ حَابِسٍ فَقَالَ: أَفِي كُلِّ عَامٍ يَا رَسُولَ اللَّهِ؟ قَالَ: \n\" لَوْ قُلْتُهَا: نَعَمْ لَوَجَبَتْ وَلَوْ وَجَبَتْ لَمْ تَعْمَلُوا بِهَا وَلَمْ تَسْتَطِيعُوا وَالْحَجُّ مَرَّةٌ فَمَنْ زَادَ فَتَطَوُّعٌ \". رَوَاهُ أَحْمَدُ وَالنَّسَائِيّ والدارمي","english":{"narrator":"","text":"Ibn ‘Abbas reported God’s messenger as saying, “God has prescribed the pilgrimage for you people.\" Al-Aqra' b. Habis then got up and asked whether it was to be performed annually, to which God’s messenger replied that if he were to tell them that it was, it would become obligatory, and if it did they would not keep it nor be able to do so, adding, “The pilgrimage should be performed once, and if anyone does it oftener he performs supererogatory act.\" \n\nAhmad, Nasa'i and Darimi transmitted it."}},{"id":16,"idInBook":16,"chapterId":10,"bookId":14,"arabic":"وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" مَنْ مَلَكَ زَادًا وَرَاحِلَةً تُبَلِّغُهُ إِلَى بَيْتِ اللَّهِ وَلَمْ يَحُجَّ فَلَا عَلَيْهِ أَنْ يَمُوتَ يَهُودِيًّا أَوْ نَصْرَانِيًّا وَذَلِكَ أَنَّ اللَّهَ تَبَارَكَ وَتَعَالَى يَقُولُ: (وَلِلَّهِ عَلَى النَّاسِ حَجُّ الْبَيْتِ مَنِ اسْتَطَاعَ إِليهِ سَبِيلا)\nرَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ غَرِيبٌ. وَفِي إِسْنَادِهِ مَقَالٌ وَهِلَالُ بْنُ عَبْدِ اللَّهِ مَجْهُولٌ والْحَارث يضعف فِي الحَدِيث","english":{"narrator":"","text":"‘All reported God’s messenger as saying, “If anyone possesses enough provision and a riding-beast to take him to God’s House and does not perform the pilgrimage, it does not matter whether he dies a Jew or Christian. That is because God who is blessed and exalted says, 'Pilgrimage to the House is a duty men owe to God, those who can afford the journey'. (Qur’an, 3:97). ” \n\nTirmidhi transmitted it, saying this is a gharib tradition whose isnad is criticised, Hilal b. ‘Abdallah is unknown, and al- Harith is declared to be weak in tradition."}},{"id":17,"idInBook":17,"chapterId":10,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:\nلَا صَرُورَةَ فِي الإِسلامِ \". رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Ibn ‘Abbas reported God’s messenger as saying, “Islam does not allow for failure to perform the pilgrimage.\"\n\nAbu Dawud transmitted it.\n\n(The word used here is sarura. The meaning is strictly \"one who does not perform the pilgrimage.\" It is explained as coming from sarr which indicates the act of confining, or withholding. Another meaning is abstinence from marriage, and the tradition is sometimes explained as meaning that Islam does not allow of celibacy; but while that is a possible interpretation it is not the appropriate one in this chapter)."}},{"id":18,"idInBook":18,"chapterId":10,"bookId":14,"arabic":"وَعَنْهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَرَادَ الْحَجَّ فَلْيُعَجِّلْ» . رَوَاهُ أَبُو دَاوُد والدارمي","english":{"narrator":"","text":"He reported God’s messenger as saying, “He who intends to perform the pilgrimage should hasten to do so.\" \n\nAbu Dawud and Darimi transmitted it."}},{"id":19,"idInBook":19,"chapterId":10,"bookId":14,"arabic":"وَعَنِ ابْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «تَابِعُوا بَيْنَ الْحَجِّ وَالْعُمْرَةِ فَإِنَّهُمَا يَنْفِيَانِ الْفَقْرَ وَالذُّنُوبَ كَمَا يَنْفِي الْكِيرُ خَبَثَ الْحَدِيدِ وَالذَّهَبِ وَالْفِضَّةِ وَلَيْسَ لِلْحَجَّةِ الْمَبْرُورَةِ ثَوَابٌ إِلَّا الْجَنَّةَ» . رَوَاهُ التِّرْمِذِيُّ وَالنَّسَائِيُّ\nوَرَوَاهُ أَحْمَدُ وَابْنُ مَاجَهْ عَنْ عُمَرَ إِلَى قَوْله: «خبث الْحَدِيد»","english":{"narrator":"","text":"Ibn Mas'ud reported God’s messenger as saying, “Make the hajj and the ‘umra follow one another closely, for they remove poverty and sins as a blacksmith’s bellows remove impurities from iron, gold and silver; and a hajja which is accepted gets no less a reward than paradise.\" \n\nTirmidhi and Nasa'i transmitted it, and Ahmad and Ibn Majah transmitted it from ‘Umar up to “from iron.\""}},{"id":20,"idInBook":20,"chapterId":10,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: جَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: يَا رَسُولَ اللَّهِ مَا يُوجِبُ الْحَجَّ؟ قَالَ: «الزَّادُ وَالرَّاحِلَة» . رَوَاهُ التِّرْمِذِيّ وَابْن مَاجَه","english":{"narrator":"","text":"Ibn ‘Umar said that a man came to the Prophet and asked what makes it necessary for one to perform the pilgrimage. He replied, “Provisions and a riding-beast. ’ ’ \n\nTirmidhi and Ibn Majah transmitted it."}},{"id":21,"idInBook":21,"chapterId":10,"bookId":14,"arabic":"وَعَنْهُ قَالَ: سَأَلَ رَجُلٌ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: مَا الْحَاج؟ فَقَالَ: «الشعث النَّفْل» . فَقَامَ آخَرُ فَقَالَ: يَا رَسُولَ اللَّهِ أَيُّ الْحَجِّ أَفْضَلُ؟ قَالَ: «الْعَجُّ وَالثَّجُّ» . فَقَامَ آخَرُ فَقَالَ: يَا رَسُولَ اللَّهِ مَا السَّبِيلُ؟ قَالَ: «زَادٌ وَرَاحِلَةٌ» رَوَاهُ فِي شَرْحِ السُّنَّةِ. وَرَوَى ابْنُ مَاجَهْ فِي سُنَنِهِ إِلَّا أَنَّهُ لَمْ يذكر الْفَصْل الْأَخير","english":{"narrator":"","text":"He said that a man asked God’s messenger to describe a pilgrim, and he replied, “Unkempt and unperfumed.\" Another got up and asked which part of the pilgrimage was most excellent, and he replied, “Raising the voice in the talbiya and shedding the blood of sacrificial victims.\" Another got up and asked the meaning of sabil (This refers to the words translated \"those who can afford the journey\" in Qur’an 3:97, quoted above in ’All’s tradition), and he replied, “Provisions and a riding-beast.\" \n\nIt is transmitted in Sharh as-sunna, and Ibn Majah transmitted it in his Sunan without mentioning the last section."}},{"id":22,"idInBook":22,"chapterId":10,"bookId":14,"arabic":"وَعَنْ أَبِي رَزِينٍ الْعُقَيْلِيِّ أَنَّهُ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: يَا رَسُولَ اللَّهِ إِنَّ أَبِي شَيْخٌ كَبِيرٌ لَا يَسْتَطِيعُ الْحَجَّ وَلَا الْعُمْرَةَ وَلَا الظَّعْنَ قَالَ: «حُجَّ عَنْ أَبِيكَ وَاعْتَمِرْ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالنَّسَائِيُّ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ","english":{"narrator":"","text":"Abu Razln al-‘Uqaili told that he went to the Prophet and said, “Messenger of God, my father is a very old man who is unable to perform the hajj and the ‘umra, or to ride.\" He replied, “Perform them both on behalf of your father.\" \n\nTirmidhi, Abu Dawud and Nasa’i transmitted it, Tirmidhi saying this is a hasan sahih tradition."}},{"id":23,"idInBook":23,"chapterId":10,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَمِعَ رَجُلًا يَقُولُ لَبَّيْكَ عَنْ شُبْرُمَةَ قَالَ: «مَنْ شُبْرُمَةُ» قَالَ: أَخٌ لِي أَوْ قَرِيبٌ لِي قَالَ: «أَحَجَجْتَ عَنْ نَفْسِكَ؟» قَالَ: لَا قَالَ: «حُجَّ عَنْ نَفْسِكَ ثُمَّ حُجَّ عَنْ شُبْرُمَةَ» . رَوَاهُ الشَّافِعِيُّ وَأَبُو دَاوُد وابنُ مَاجَه","english":{"narrator":"","text":"Ibn ‘Abbas told that God's messenger heard a man say, “Labbaik on behalf of Shubruma.\" He asked who Shubruma was, and the man replied, “A brother of mine,\" or “a relative of mine.\" He asked whether he had performed the pilgrimage on his own behalf, and when he replied that he had not, he said, “Perform the pilgrimage on your own behalf, then perform it on behalf of Shubruma.\" \n\nShafi'i, Abu Dawud and Ibn Majah transmitted it."}},{"id":24,"idInBook":24,"chapterId":10,"bookId":14,"arabic":"وَعَنْهُ قَالَ: وَقَّتَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأَهْلِ الْمَشْرِقِ الْعَقِيقَ. رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُد","english":{"narrator":"","text":"He said that God’s messenger appointed al-‘Aqiq as the place where the people of the east should put on the ihram. \n\nTirmidhi and Abu Dawud transmitted it."}},{"id":25,"idInBook":25,"chapterId":10,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَّتَ لِأَهْلِ الْعِرَاقِ ذَاتَ عِرْقٍ. رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ","english":{"narrator":"","text":"‘A’isha said that God's messenger appointed Dhat ‘Irq as the place where the people of al-‘Iraq should put on the ihram. \n\nAbu Dawud and Nasa’i transmitted it."}},{"id":26,"idInBook":26,"chapterId":10,"bookId":14,"arabic":"وَعَنْ أُمِّ سَلَمَةَ قَالَتْ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: \" مَنْ أَهَلَّ بِحَجَّةٍ أَوْ عُمْرَةٍ مِنَ الْمَسْجِدِ الْأَقْصَى إِلَى الْمَسْجِدِ الْحَرَامِ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ وَمَا تَأَخَّرَ أَوْ وَجَبَتْ لَهُ الْجَنَّةُ. رَوَاهُ أَبُو دَاوُدَ وَابْنُ مَاجَهْ","english":{"narrator":"","text":"Umm Salama said she heard God's messenger say, “If anyone puts on the ihram for a hajja or an ‘umra from the Aqsa mosque to the sacred mosque, his former and latter sins will be forgiven him,\" or, “he will be guaranteed paradise.\" \n\nAbu Dawud and Ibn Majah transmitted it."}},{"id":27,"idInBook":27,"chapterId":10,"bookId":14,"arabic":"عَنِ ابْنِ عَبَّاسٍ قَالَ: كَانَ أَهْلُ الْيَمَنِ يَحُجُّونَ فَلَا يَتَزَوَّدُونَ وَيَقُولُونَ: نَحْنُ الْمُتَوَكِّلُونَ فَإِذَا قَدِمُوا مَكَّةَ سَأَلُوا النَّاسَ فَأَنْزَلَ اللَّهُ تَعَالَى: (وتزَوَّدُوا فإِنَّ خيرَ الزَّادِ التَّقوى)\nرَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Ibn ‘Abbas said that the people of the Yemen used to perform the pilgrimage without bringing provisions, declaring that they put their trust in God; and when they came to Mecca they begged from the people. So God most high sent down, “And bring provisions, but the best provision is piety.’’(Qur’an 2:197) \n\nBukhari transmitted it."}},{"id":28,"idInBook":28,"chapterId":10,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ قَالَتْ: قُلْتُ: يَا رَسُولَ اللَّهِ عَلَى النِّسَاءِ جِهَادٌ؟ قَالَ: \n\" نَعَمْ عَلَيْهِنَّ جِهَادٌ لَا قِتَالَ فِيهِ: الْحَجُّ وَالْعُمْرَةُ \". رَوَاهُ ابْنُ مَاجَه","english":{"narrator":"","text":"‘A’isha said that she asked God’s messenger whether jihad was incumbent on women, and he replied, “Yes, jihad which does not include fighting is incumbent on them. It is the hajj and the ‘umra.” \n\nIbn Majah transmitted it."}},{"id":29,"idInBook":29,"chapterId":10,"bookId":14,"arabic":"وَعَنْ أَبِي أُمَامَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ لَمْ يَمْنَعْهُ مِنَ الْحَجِّ حَاجَةٌ ظَاهِرَةٌ أَوْ سُلْطَانٌ جَائِرٌ أَوْ مَرَضٌ حَابِسٌ فَمَاتَ وَلَمْ يَحُجَّ فَلْيَمُتْ إِنْ شَاءَ يَهُودِيًّا وَإِنْ شَاءَ نَصْرَانِيًّا» . رَوَاهُ الدَّارمِيّ","english":{"narrator":"","text":"Abu Umama reported God’s messenger as saying, “He who is not prevented from performing the pilgrimage by an obvious necessity, a tyrannical ruler, or a disease which confines him at home and dies without having performed the pilgrimage, may die if he wishes as a Jew, or if he wishes as a Christian.” \n\nDarimi transmitted it."}},{"id":30,"idInBook":30,"chapterId":10,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ: «الْحَاجُّ وَالْعُمَّارُ وَفْدُ اللَّهِ إِنْ دَعَوْهُ أجابَهمْ وإِنِ استَغفروهُ غَفرَ لهمْ» . رَوَاهُ ابْن مَاجَه","english":{"narrator":"","text":"Abu Huraira reported the Prophet as saying, “Those who perform the hajj and those who perform the 'umra are people who have come to visit God. If they supplicate Him He will respond to them, and if they ask Him for forgiveness He will forgive them.” \n\nIbn Majah transmitted it."}},{"id":31,"idInBook":31,"chapterId":10,"bookId":14,"arabic":"وَعَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «وَفْدُ اللَّهِ ثَلَاثَةٌ الْغَازِي وَالْحَاجُّ وَالْمُعْتَمِرُ» . رَوَاهُ النَّسَائِيُّ وَالْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَان","english":{"narrator":"He said that he heard God’s messenger say, “Those who visit God are three classes:","text":"The warrior, the one who performs the hajj, and the one who performs the ‘umra.” \n\nNasa’i and Baihaqi, in Shu'ab al-iman, transmitted it."}},{"id":32,"idInBook":32,"chapterId":10,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا لَقِيتَ الْحَاجَّ فَسَلِّمْ عَلَيْهِ وَصَافِحْهُ وَمُرْهُ أَنْ يَسْتَغْفِرَ لَكَ قَبْلَ أَنْ يَدْخُلَ بَيْتَهُ فَإِنَّهُ مَغْفُورٌ لَهُ» . رَوَاهُ أَحْمد","english":{"narrator":"","text":"Ibn ‘Umar reported God’s messenger as saying, “When you meet one who has performed the pilgrimage, greet him, shake hands with him and tell him to ask forgiveness for you before he enters his house, for he has been forgiven.” \n\nAhmad transmitted it."}},{"id":33,"idInBook":33,"chapterId":10,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ خَرَجَ حَاجًّا أَوْ مُعْتَمِرًا أَوْ غَازِيًا ثُمَّ مَاتَ فِي طَرِيقِهِ كَتَبَ اللَّهُ لَهُ أَجْرَ الْغَازِي وَالْحَاجِّ والمعتمِرِ» . رَوَاهُ الْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَانِ","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “If anyone goes out to perform hajj or 'umra, or to fight with infidels, and dies on the way, God will record for him the reward of him who fights with infidels, him who performs the hajj and him who performs the 'umra.” \n\nBaihaqi transmitted it in Shu'ab al-iman."}},{"id":34,"idInBook":34,"chapterId":10,"bookId":14,"arabic":"عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: كُنْتُ أُطَيِّبُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِإِحْرَامِهِ قَبْلَ أَنْ يُحْرِمَ وَلِحِلِّهِ قَبْلَ أَنْ يَطُوفَ بِالْبَيْتِ بِطِيبٍ فِيهِ مِسْكٌ كَأَنِّي أَنْظُرُ إِلَى وَبِيصِ الطِّيبِ فِي مَفَارِقِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ مُحْرِمٌ","english":{"narrator":"‘A’isha said :","text":"I used to perfume God’s messenger with a perfume containing musk preparatory to his entering the sacred state before he put on the ihram, and when he put off the ihram, before he made the circuits round the House. I still seem to see the glistening of the perfume where the hair was parted on God’s messenger’s head while he was wearing the ihram. \n\nBukhari and Muslim."}},{"id":35,"idInBook":35,"chapterId":10,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُهِلُّ مُلَبِّدًا يَقُولُ: «لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ لَبَّيْكَ لَا شَرِيكَ لَكَ لَبَّيْكَ إِنَّ الْحَمْدَ وَالنِّعْمَةَ لَكَ وَالْمُلْكَ لَا شَرِيكَ لَكَ» . لَا يَزِيدُ عَلَى هَؤُلَاءِ الْكَلِمَاتِ","english":{"narrator":"","text":"Ibn ‘Umar said that he heard God’s messenger say when with his hair matted he raised his voice in the talbiya, “Labbaik, O God, labbaik labbaik; Thou hast no partner; labbaik; praise and grace are Thine, and the dominion; Thou hast no partner,” saying nothing more than these words. \n\nBukhari and Muslim."}},{"id":36,"idInBook":36,"chapterId":10,"bookId":14,"arabic":"وَعَنْهُ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَدْخَلَ رِجْلَهُ فِي الْغَرْزِ وَاسْتَوَتْ بِهِ نَاقَتُهُ قَائِمَةً أَهَلَّ منَ عندِ مسجدِ ذِي الحليفة","english":{"narrator":"","text":"He said that when God’s messenger put his foot in the stirrup and his she-camel stood up with him on its back, he raised his voice in the talbiya from the mosque of Dhul Hulaifa. \n\nBukhari and Muslim."}},{"id":37,"idInBook":37,"chapterId":10,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: خَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَصْرُخُ بِالْحَجِّ صراخا. رَوَاهُ مُسلم","english":{"narrator":"Abu Sa'id al-Khudri said:","text":"We went out with God’s messenger crying aloud (talbiya,/i>) at the pilgrimage. \n\nMuslim transmitted it."}},{"id":38,"idInBook":38,"chapterId":10,"bookId":14,"arabic":"وَعَنْ أَنَسٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: كُنْتُ رَدِيفَ أَبِي طَلْحَةَ وَإِنَّهُمْ لَيَصْرُخُونَ بهِما جَمِيعًا: الْحَج وَالْعمْرَة. رَوَاهُ البُخَارِيّ","english":{"narrator":"Anas said:","text":"I was riding behind Abu Talha, and the people were crying aloud for both of them, the hajj and the ‘umra. \n\nBukhari transmitted it."}},{"id":39,"idInBook":39,"chapterId":10,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ قَالَتْ: خَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ حَجَّةِ الْوَدَاعِ فَمِنَّا مَنْ أَهَلَّ بِعُمْرَةٍ وَمِنَّا مَنْ أَهَلَّ بِحَجٍّ وَعُمْرَةٍ وَمِنَّا مَنْ أَهَلَّ بِالْحَجِّ وَأَهَلَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْحَجِّ فَأَمَّا مَنْ أَهَلَّ بِعُمْرَةٍ فَحَلَّ وَأَمَّا مَنْ أَهَلَّ بِالْحَجِّ أَوْ جَمَعَ الْحَجَّ وَالْعُمْرَةَ فَلَمْ يَحِلُّوا حَتَّى كَانَ يَوْمُ النَّحْرِ","english":{"narrator":"‘A’isha said:","text":"We went out with God’s messenger in the year of the Farewell Pilgrimage, some of us raising our voices in the i>talbiya for an ‘umra, some for hajj and ‘umra, and others for the hajj, but God’s messenger raised his voice in the talbiya for the hajj. Those who did it for an 'umra took off the ihram, but those who did it for the hajj, or who combined the hajj and the ‘umra did not remove the ihram till the day of sacrifice. \n\nBukhari and Muslim."}},{"id":40,"idInBook":40,"chapterId":10,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: تَمَتَّعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَجَّةِ الْوَدَاعِ بِالْعُمْرَةِ إِلَى الْحَجِّ بدأَ فأهلَّ بالعمْرةِ ثمَّ أهلَّ بالحجّ","english":{"narrator":"","text":"Ibn ‘Umar said that at the Farewell Pilgrimage God’s messenger performed the ‘umra first and the hajj later (The phrase used is tamata'a bil-’umra ilal-hajj which indicates gaining the advantage of the ‘umra and waiting till the time for the hajj comes without requiring to wear the ihram during the intervening period. It is a difficult phrase to translate, and therefore one can only indicate its general meaning in a translation), raising his voice in the talbiya first for the 'umra and afterwards for the hajj. \n\nBukhari and Muslim."}},{"id":41,"idInBook":41,"chapterId":10,"bookId":14,"arabic":"عَنْ زَيْدِ بْنِ ثَابِتٍ أَنَّهُ رَأَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَجَرَّدَ لِإِهْلَالِهِ وَاغْتَسَلَ. رَوَاهُ التِّرْمِذِيّ والدارمي","english":{"narrator":"","text":"Zaid b. Thabit said he saw the Prophet strip to put on his ihram, and bathe. \n\nTirmidhi and Darimi transmitted it."}},{"id":42,"idInBook":42,"chapterId":10,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَبَّدَ رَأْسَهُ بِالْغِسْلِ. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Ibn ‘Umar said that the Prophet matted his hair with ghisl (A lotion made of marsh-mallows, or lotus leaves, or fuller’s earth, or potash with water).  \n\nAbu Dawud transmitted it."}},{"id":43,"idInBook":43,"chapterId":10,"bookId":14,"arabic":"وَعَنْ خَلَّادِ بْنِ السَّائِبِ عَنْ أَبِيهِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ «أَتَانِي جِبْرِيلُ فَأَمَرَنِي أَنْ آمُرَ أَصْحَابِي أَنْ يرفَعوا أصواتَهم بالإِهْلالِ أَو التَّلبيَةِ» . رَوَاهُ مَالِكٌ وَالتِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالنَّسَائِيُّ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ","english":{"narrator":"","text":"Khallad b. as-Sa’ib on his father’s authority reported God’s messenger as saying, “Gabriel came to me and commanded me to order my companions to raise their voices in the talbiya.” (The tradition ends by saying they were to raise their voices bil-ihlal au at-talbiya. These are alternative words meaning the same thing, and therefore I have not given any alternative in the translation)\n\nMalik, Tirmidhi, Abd Dawud, Nasa’i, Ibn Majah and Darimi transmitted it."}},{"id":44,"idInBook":44,"chapterId":10,"bookId":14,"arabic":"وَعَنْ سَهْلِ بْنِ سَعْدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" مَا مِنْ مُسْلِمٍ يُلَبِّي إِلَّا لَبَّى مَنْ عَنْ يَمِينِهِ وَشِمَالِهِ: مِنْ حَجَرٍ أَوْ شَجَرٍ أَوْ مَدَرٍ حَتَّى تنقطِعَ الأرضُ منْ ههُنا وههُنا \". رَوَاهُ التِّرْمِذِيّ وَابْن مَاجَه","english":{"narrator":"","text":"Sahl b. Sa‘d reported God’s messenger as saying, “No Muslim raises his voice in the talbiya without all on his right and left’, stones, or trees, or clods, doing the same till the earth is traversed on both sides,” \n\nTirmidhi and Ibn Majah transmitted it."}},{"id":45,"idInBook":45,"chapterId":10,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَرْكَعُ بِذِي الْحُلَيْفَةِ رَكْعَتَيْنِ ثُمَّ إِذَا اسْتَوَتْ بِهِ النَّاقَةُ قَائِمَةً عِنْدَ مَسْجِدِ ذِي الْحُلَيْفَةِ أَهَلَّ بِهَؤُلَاءِ الْكَلِمَاتِ وَيَقُولُ: «لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ لَبَّيْكَ وَسَعْدَيْكَ وَالْخَيْرُ فِي يَدَيْكَ لَبَّيْكَ وَالرَّغْبَاءُ إِلَيْكَ وَالْعَمَل» . مُتَّفق عَلَيْهِ وَلَفظه لمُسلم","english":{"narrator":"","text":"Ibn ‘Umar said that God’s messenger used to perform two rak’as in Dhul Hulaifa, then when the she-camel stood up with him on its back at the mosque of Dhul Hulaifa, he shouted these words, saying, “Lubbaik, O God, labbaik labbaik wa-sa‘daik ('Always ready to obey.’) ; good is in Thy hands; labbaik; desire and action are directed towards Thee. \n\n(Bukhari and Muslim, the wording being Muslim's.) (It is strange to find a tradition from Bukhari and Muslim in section (b). The author has explained in his introduction that section (a) is confined to Bukhari and Muslim and section (b) to other authorities)"}},{"id":46,"idInBook":46,"chapterId":10,"bookId":14,"arabic":"وَعَنْ عِمَارَةَ بْنِ خُزَيْمَةَ بْنِ ثَابِتٍ عَنْ أَبِيهِ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ إِذَا فَرَغَ مِنْ تَلْبِيَتِهِ سَأَلَ اللَّهَ رِضْوَانَهُ وَالْجَنَّةَ وَاسْتَعْفَاهُ بِرَحْمَتِهِ مِنَ النَّارِ. رَوَاهُ الشَّافِعِي","english":{"narrator":"","text":"‘Umara b. Khuzaima b. Thabit said on his father's authority that when the Prophet finished his talbiya, he asked God for His good pleasure and for paradise, and asked Him to preserve him in His mercy from hell. \n\nShafi'i transmitted it."}},{"id":47,"idInBook":47,"chapterId":10,"bookId":14,"arabic":"عَنْ جَابِرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا أَرَادَ الْحَجَّ أَذَّنَ فِي النَّاسِ فَاجْتَمَعُوا فَلَمَّا أَتَى الْبَيْدَاءَ أَحْرَمَ. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Jabir said that when God’s messenger intended to perform the pilgrimage he made proclamation among the people and they assembled. Then when he came to al-Baida’ (a place near Dhul Hulaifa) he put on the ihram. \n\nBukhari transmitted it."}},{"id":48,"idInBook":48,"chapterId":10,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: كَانَ الْمُشْرِكُونَ يَقُولُونَ: لَبَّيْكَ لَا شَرِيكَ لَكَ فَيَقُولُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «وَيْلَكُمْ قَدْ قَدْ» إِلَّا شَرِيكًا هُوَ لَكَ تَمْلِكُهُ وَمَا مَلَكَ. يَقُولُونَ هَذَا وَهُمْ يَطُوفُونَ بِالْبَيْتِ. رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"Ibn ‘Abbas said that the polytheists used to say, “Labbaik, Thou hast no partner,\" whereupon God’s messenger would say, “Woe to you ! Enough, enough;  ‘except a partner who is Thine whom Thou possessest', when He possesses none.” They used to say this when they were going round the House. \n\nMuslim transmitted it."}},{"id":49,"idInBook":49,"chapterId":10,"bookId":14,"arabic":"عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَكَثَ بِالْمَدِينَةِ تِسْعَ سِنِينَ لَمْ يَحُجَّ ثُمَّ أَذَّنَ فِي النَّاسِ بالحجِّ فِي الْعَاشِرَةِ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَاجٌّ فَقَدِمَ الْمَدِينَةَ بَشَرٌ كَثِيرٌ فَخَرَجْنَا مَعَهُ حَتَّى إِذَا أَتَيْنَا ذَا الْحُلَيْفَةِ فَوَلَدَتْ أَسْمَاءُ بِنْتُ عُمَيْسٍ مُحَمَّدَ بْنَ أَبِي بَكْرٍ فَأَرْسَلَتْ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: كَيْفَ أصنعُ؟ قَالَ: «اغتسِلي واستثقري بِثَوْبٍ وَأَحْرِمِي» فَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْمَسْجِدِ ثُمَّ رَكِبَ الْقَصْوَاءَ حَتَّى إِذَا اسْتَوَتْ بِهِ نَاقَتُهُ عَلَى الْبَيْدَاءِ أَهَلَّ بِالتَّوْحِيدِ «لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ لَبَّيْكَ لَا شَرِيكَ لَكَ لَبَّيْكَ إِنَّ الْحَمْدَ وَالنِّعْمَةَ لَكَ وَالْمُلْكَ لَا شَرِيكَ لَكَ» . قَالَ جَابِرٌ: لَسْنَا نَنْوِي إِلَّا الْحَجَّ لَسْنَا نَعْرِفُ الْعُمْرَةَ حَتَّى إِذَا أَتَيْنَا الْبَيْتَ مَعَهُ اسْتَلَمَ الرُّكْنَ فَطَافَ سَبْعًا فَرَمَلَ ثَلَاثًا وَمَشَى أَرْبَعًا ثُمَّ تَقَدَّمَ إِلَى مَقَامِ إِبْرَاهِيمَ فَقَرَأَ: (وَاتَّخِذُوا مِنْ مَقَامِ إِبراهيمَ مُصَلَّى)\nفَصَلَّى رَكْعَتَيْنِ فَجَعَلَ الْمَقَامَ بَيْنَهُ وَبَيْنَ الْبَيْتِ وَفِي رِوَايَةٍ: أَنَّهُ قَرَأَ فِي الرَّكْعَتَيْنِ: (قُلْ هوَ اللَّهُ أَحَدٌ و (قُلْ يَا أيُّها الكافِرونَ)\nثُمَّ رَجَعَ إِلَى الرُّكْنِ فَاسْتَلَمَهُ ثُمَّ خَرَجَ مِنَ الْبَابِ إِلَى الصَّفَا فَلَمَّا دَنَا مِنَ الصَّفَا قَرَأَ: (إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شعائِرِ اللَّهِ)\nأَبْدَأُ بِمَا بَدَأَ اللَّهُ بِهِ فَبَدَأَ بِالصَّفَا فَرَقِيَ عَلَيْهِ حَتَّى رَأَى الْبَيْتَ فَاسْتَقْبَلَ الْقِبْلَةَ فَوَحَّدَ اللَّهَ وَكَبَّرَهُ وَقَالَ: «لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ أَنْجَزَ وَعْدَهُ وَنَصَرَ عَبْدَهُ وَهَزَمَ الْأَحْزَابَ وَحْدَهُ» . ثُمَّ دَعَا بَيْنَ ذَلِكَ قَالَ مِثْلَ هَذَا ثَلَاثَ مَرَّاتٍ ثُمَّ نَزَلَ وَمَشَى إِلَى الْمَرْوَةِ حَتَّى انْصَبَّتْ قَدَمَاهُ فِي بَطْنِ الْوَادِي ثُمَّ سَعَى حَتَّى إِذَا صَعِدْنَا مَشَى حَتَّى أَتَى الْمَرْوَةَ فَفَعَلَ عَلَى الْمَرْوَةِ كَمَا فَعَلَ عَلَى الصَّفَا حَتَّى إِذَا كَانَ آخِرُ طَوَافٍ عَلَى الْمَرْوَةِ نَادَى وَهُوَ عَلَى الْمَرْوَةِ وَالنَّاسُ تَحْتَهُ فَقَالَ: «لَوْ أَنِّي اسْتَقْبَلْتُ مِنْ أَمْرِي مَا اسْتَدْبَرْتُ لَمْ أسق الهَدْيَ وجعلتُها عُمْرةً فمنْ كانَ مِنْكُم لَيْسَ مَعَهُ هَدْيٌ فَلْيَحِلَّ وَلْيَجْعَلْهَا عُمْرَةً» . فَقَامَ سُرَاقَةُ بْنُ مَالِكِ بْنِ جُعْشُمٍ فَقَالَ: يَا رَسُولَ اللَّهِ أَلِعَامِنَا هَذَا أَمْ لِأَبَدٍ؟ فَشَبَّكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَصَابِعَهُ وَاحِدَةً فِي الْأُخْرَى وَقَالَ: «دَخَلَتِ الْعُمْرَةُ فِي الْحَجِّ مَرَّتَيْنِ لَا بَلْ لِأَبَدِ أَبَدٍ» . وَقَدِمَ عَلِيٌّ مِنَ الْيَمَنِ بِبُدْنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَهُ: «مَاذَا قُلْتَ حِينَ فَرَضْتَ الْحَجَّ؟» قَالَ: قُلْتُ: اللهُمَّ إِنِّي أُهِلُّ بِمَا أهلَّ بهِ رسولُكَ قَالَ: «فَإِنَّ مَعِي الْهَدْيَ فَلَا تَحِلَّ» . قَالَ: فَكَانَ جَمَاعَةُ الْهَدْيِ الَّذِي قَدِمَ بِهِ عَلِيٌّ مِنَ الْيَمَنِ وَالَّذِي أَتَى بِهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِائَةً قَالَ: فَحَلَّ النَّاسُ كُلُّهُمْ وَقَصَّرُوا إِلَّا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسلم وَمن كَانَ مَعَه من هدي فَمَا كَانَ يَوْمُ التَّرْوِيَةِ تَوَجَّهُوا إِلَى مِنًى فَأَهَلُّوا بِالْحَجِّ وَرَكِبَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَصَلَّى بِهَا الظُّهْرَ وَالْعَصْرَ وَالْمَغْرِبَ وَالْعِشَاءَ وَالْفَجْرَ ثُمَّ مَكَثَ قَلِيلًا حَتَّى طَلَعَتِ الشَّمْسُ وَأَمَرَ بِقُبَّةٍ مِنْ شَعَرٍ تُضْرَبُ لَهُ بِنَمِرَةَ فَسَارَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَا تَشُكُّ قُرَيْشٌ إِلَّا أَنَّهُ وَاقِفٌ عِنْدَ الْمَشْعَرِ الْحَرَامِ كَمَا كَانَتْ قُرَيْشٌ تَصْنَعُ فِي الْجَاهِلِيَّةِ فَأجَاز رَسُول الله صلى حَتَّى أَتَى عَرَفَةَ فَوَجَدَ الْقُبَّةَ قَدْ ضُرِبَتْ لَهُ بِنَمِرَةَ فَنَزَلَ بِهَا حَتَّى إِذَا زَاغَتِ الشَّمْسُ أَمَرَ بِالْقَصْوَاءِ فَرُحِلَتْ لَهُ فَأَتَى بَطْنَ الْوَادِي فَخَطَبَ النَّاسَ وَقَالَ: «إِنَّ دِمَاءَكُمْ وَأَمْوَالَكُمْ حَرَامٌ عَلَيْكُمْ كَحُرْمَةِ يَوْمِكُمْ هَذَا فِي شَهْرِكُمْ هَذَا فِي بَلَدِكُمْ هَذَا أَلَا كُلُّ شَيْءٍ مِنْ أَمْرِ الْجَاهِلِيَّةِ تَحْتَ قَدَمَيَّ مَوْضُوعٌ وَدِمَاءُ الْجَاهِلِيَّةِ مَوْضُوعَةٌ وَإِنَّ أَوَّلَ دَمٍ أَضَعُ مِنْ دِمَائِنَا دَمُ ابْنِ رَبِيعَةَ بْنِ الْحَارِثِ وَكَانَ مُسْتَرْضَعًا فِي بَنِي سَعْدٍ فَقَتَلَهُ هُذَيْلٌ وَرِبَا الْجَاهِلِيَّةِ مَوْضُوعٌ وَأَوَّلُ رِبًا أَضَعُ مِنْ رِبَانَا رِبَا عَبَّاسِ بْنِ عَبْدِ الْمُطَّلِبِ فَإِنَّهُ مَوْضُوعٌ كُلُّهُ فَاتَّقُوا اللَّهَ فِي النِّسَاءِ فَإِنَّكُمْ أَخَذْتُمُوهُنَّ بِأَمَانِ اللَّهِ وَاسْتَحْلَلْتُمْ فُرُوجَهُنَّ بِكَلِمَةِ اللَّهِ وَلَكُمْ عَلَيْهِنَّ أَنْ لَا يُوطِئْنَ فُرُشَكُمْ أَحَدًا تَكْرَهُونَهُ فَإِنْ فَعَلْنَ ذَلِكَ فَاضْرِبُوهُنَّ ضَرْبًا غَيْرَ مُبَرِّحٍ وَلَهُنَّ عَلَيْكُمْ رِزْقُهُنَّ وَكِسْوَتُهُنَّ بِالْمَعْرُوفِ وَقَدْ تَرَكْتُ فِيكُمْ مَا لَنْ تَضِلُّوا بَعْدَهُ إِنِ اعْتَصَمْتُمْ بِهِ كِتَابَ اللَّهِ وَأَنْتُمْ تُسْأَلُونَ عَنِّي فَمَا أَنْتُمْ قَائِلُونَ؟» قَالُوا: نَشْهَدُ أَنَّكَ قَدْ بَلَّغْتَ وَأَدَّيْتَ وَنَصَحْتَ. فَقَالَ بِإِصْبَعِهِ السَّبَّابَةِ يَرْفَعُهَا إِلَى السَّمَاءِ وَيَنْكُتُهَا إِلَى النَّاسِ: «اللَّهُمَّ اشْهَدْ اللَّهُمَّ اشْهَدْ» ثَلَاثَ مَرَّاتٍ ثُمَّ أَذَّنَ بِلَالٌ ثُمَّ أَقَامَ فَصَلَّى الظُّهْرَ ثُمَّ أَقَامَ فَصَلَّى الْعَصْرَ وَلَمْ يُصَلِّ بَيْنَهُمَا شَيْئًا ثُمَّ رَكِبَ حَتَّى أَتَى الْمَوْقِفَ فَجَعَلَ بَطْنَ نَاقَتِهِ الْقَصْوَاءِ إِلَى الصَّخَرَاتِ وَجَعَلَ حَبْلَ الْمُشَاةِ بَيْنَ يَدَيْهِ وَاسْتَقْبَلَ الْقِبْلَةَ فَلَمْ يَزَلْ وَاقِفًا حَتَّى غَرَبَتِ الشَّمْسُ وَذَهَبَتِ الصُّفْرَةُ قَلِيلًا حَتَّى غَابَ الْقُرْصُ وَأَرْدَفَ أُسَامَةَ وَدَفَعَ حَتَّى أَتَى الْمُزْدَلِفَةَ فَصَلَّى بِهَا الْمَغْرِبَ وَالْعَشَاءَ بِأَذَانٍ وَاحِدٍ وَإِقَامَتَيْنِ وَلَمْ يُسَبِّحْ بَيْنَهُمَا شَيْئًا ثُمَّ اضْطَجَعَ حَتَّى طَلَعَ الْفَجْرُ فَصَلَّى الْفَجْرَ حِينَ تَبَيَّنَ لَهُ الصُّبْحُ بِأَذَانٍ وَإِقَامَةٍ ثُمَّ رَكِبَ الْقَصْوَاءَ حَتَّى أَتَى الْمَشْعَرَ الْحَرَامَ فَاسْتَقْبَلَ الْقِبْلَةَ فَدَعَاهُ وَكَبَّرَهُ وَهَلَّلَهُ وَوَحَّدَهُ فَلَمْ يَزَلْ وَاقِفًا حَتَّى أَسْفَرَ جِدًّا فَدَفَعَ قَبْلَ أَنْ تَطْلُعَ الشَّمْسُ وَأَرْدَفَ الْفَضْلَ بْنَ عَبَّاسٍ حَتَّى أَتَى بَطْنَ مُحَسِّرٍ فَحَرَّكَ قَلِيلًا ثُمَّ سَلَكَ الطَّرِيقَ الْوُسْطَى الَّتِي\nتَخْرُجُ\nعَلَى الْجَمْرَةِ الْكُبْرَى حَتَّى أَتَى الْجَمْرَةَ الَّتِي عِنْدَ الشَّجَرَةِ فَرَمَاهَا بِسَبْعِ حَصَيَاتٍ يُكَبِّرُ مَعَ كُلِّ حَصَاةٍ مِنْهَا مِثْلَ حَصَى الْخَذْفِ رَمَى مِنْ بَطْنِ الْوَادِي ثُمَّ انْصَرَفَ إِلَى الْمَنْحَرِ فَنَحَرَ ثَلَاثًا وَسِتِّينَ بَدَنَةً بِيَدِهِ ثُمَّ أَعْطَى عَلِيًّا فَنَحَرَ مَا غَبَرَ وَأَشْرَكَهُ فِي هَدْيِهِ ثُمَّ أَمَرَ مِنْ كُلِّ بَدَنَةٍ بِبَضْعَةٍ فَجُعِلَتْ فِي قِدْرٍ فَطُبِخَتْ فَأَكَلَا مِنْ لَحْمِهَا وَشَرِبَا مِنْ مَرَقِهَا ثُمَّ رَكِبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَفَاضَ إِلَى الْبَيْتِ فَصَلَّى بِمَكَّةَ الظُّهْرَ فَأَتَى عَلَى بَنِي عَبْدِ الْمُطَّلِبِ يَسْقُونَ عَلَى زَمْزَمَ فَقَالَ: «انْزِعُوا بَنِي عَبْدِ الْمُطَّلِبِ فَلَوْلَا أَنْ يَغْلِبَكُمُ النَّاسُ عَلَى سِقَايَتِكُمْ لَنَزَعْتُ مَعَكُمْ» . فَنَاوَلُوهُ دَلْوًا فَشَرِبَ مِنْهُ. رَوَاهُ مُسْلِمٌ","english":{"narrator":"Jabir b. ‘Abdallah said:","text":"God’s messenger remained in Medina nine years, during which he had not performed the hajj, then made a public announcement in the tenth year to the effect that God’s messenger was about to perform the hajj. Large numbers came to Medina, and we went out with him. When we reached Dhul Hulaifa, Asma’ daughter of ‘Umais, gave birth to Muhammad b. Abu Bakr and sent to God’s messenger asking what she was to do. He replied, “Bathe, bandage your private parts with a cloth, and put on the ihram.” God’s messenger then prayed in the mosque, and after he had mounted al-Qaswa' and his she-camel stood erect with him on its back at al-Baida’, he raised his voice declaring God’s unity and saying, “Labbaik, O God, labbaik labbaik; Thou hast no partner; labbaik; praise and grace are Thine and the dominion; Thou hast no partner.” Jabir said : We did not express our intention of performing anything but the hajj, being unaware of the ‘umra  said: The total of those sacrificial animals brought by ‘Ali from the Yemen and of those brought by the Prophet was a hundred. Then all the people, except the Prophet and those who had with them sacrificial animals, removed the ihram and clipped their hair. When yaum at-tarwiya (The 8th of Dhul Hijja, the day when pilgrims leave Mecca and go to Mina. The name is commonly explained as meaning that this was the day when the pilgrims provided themselves with a supply of water for the arid journey before them) came they went towards Mina having put on the ihram for the hajj, and the Prophet rode and prayed there the noon, afternoon, sunset, evening and dawn prayers. After that he waited a little till the sun rose, and gave orders for a tent of hair to be set up for him at Namira (A place or a hill near ‘Arafa). God’s messenger then set out, and Quraish did not doubt that he would observe a halt at the sacred site (At al-Muzdalifa, al-Mash'ar al-haram, a hill sacred to the god Ouzah in pre-lslamic times), as Quraish used to do in the pre-Islamic period ; but he passed on till he came to ‘Arafa and found that the tent had been set up for him at Namira. There he dismounted, and when the sun had passed the meridian he ordered al- Qaswa’ to be brought, and when it was saddled for him he went down into the valley and addressed the people, saying, “Your lives and your property must be respected by one another like the sacredness of this day of yours in this month of yours in this town of yours. Everything pertaining to the pre-Islamic period has been put under my feet, and claims for blood-vengeance belonging to the pre-lslamic period have been abolished. The first of those murdered among us whose blood-vengeance I remit is the son of Rabi'a b. al-Harith (Rabi’a was a grandson of 'Abd al-Muttalib. The name of the child who had been killed is variously given as Adam, Tammam and Iyas. Ibn ‘Abd al-Barr says Adam is a mistake, but does not commit himself to either of the other two names) who was suckled among the B. Sa'd and killed by Hudhail. The usury of the pre-Islamic period is abolished, and the first of our usury I abolish is that of ‘Abbas b. ‘Abd al-Muttalib, for it is all abolished. Show fear towards God regarding women, for you have got them under God’s security, and have the right to intercourse with them by God's word. They must not bring into your houses anyone whom you dislike, but if they do that beat them, though not severely. You are responsible for providing them with their food and clothing in a fitting manner. I have left among you something, i.e. God’s Book, by which, if you hold to it, you will never again go astray. You will be asked about me, so what will you say?\" They replied, “We testify that you have conveyed and fulfilled the message and given counsel. ” Then raising his forefinger towards the sky and pointing it at the people, he said, “O God, be witness ; O God, be witness,” saying it three times. Bilal then uttered the call to prayer, and the iqama, and he prayed the noon prayer; he then uttered the iqama and he prayed the afternoon prayer, engaging in no prayer between the two. He then mounted his camel and came to the place of standing, making his she-camel al-Qaswa’ turn its back to the rocks and having the path taken by those who went on foot (The Arabic is Habl al-mushat, which is variously explained as above, or as ‘the concourse of horse on foot', or as the name of a place.) in front of him. He faced the qibla and remained standing till sunset when the yellow light had somewhat gone and the disc of the sun had disappeared. He took Usama up behind him and went quickly till he came to al-Muzdalifa, where he prayed the sunset and the evening prayer with one adhan and two iqamas without saying ‘Glory be to God' between them. He then lay down till dawn and prayed the dawn prayer with an adhan and an iqama when the morning light was clear. He then mounted al-Qaswa’ and when he came to the sacred site he faced the qibla, supplicated God, declared His greatness, His uniqueness and His unity, and kept standing till the daylight was very clear. He then went quickly before the sun rose, taking al-Fadl b. ‘Abbas behind him, and came to the valley of Muhassir (Between al-Muzdalifa and Mini). He urged the camel a little and following the middle road which comes out at the greatest jamra (Jamra, originally a pebble, is applied to a heap of stones, of which there are three in the valley of Mina. One of the rites of the hajj is to throw small stones at them), he came to the jamra which is beside the tree. At this he threw seven small pebbles (Literally, 'pebbles that are thrown’: used to indicate small pebbles about the size of a date-stone), saying “God is most great” each time he threw a pebble. He threw them from the bottom of the valley, then went to the place of sacrifice and sacrificed sixty-three victims with his own hand. Then he gave some to ‘Ali who sacrificed the remainder, and he shared with him in his sacrificial animals. After that he ordered that a piece of flesh from each victim should be put in a pot, and when it was cooked the two of them ate some of it and drank some of its broth. Then God’s messenger mounted, and going quickly to the House, prayed the noon prayer in Mecca. He came to the B. ‘Abd al-Muttalib who were supplying water at Zamzam and said, “Draw water, B. ‘Abd al-Muttalib. Were it not that people would take from you the right to draw water, I would draw it along with you.” So they handed him a bucket and he drank from it. \n\nMuslim transmitted it."}},{"id":50,"idInBook":50,"chapterId":10,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: خَرَجْنَا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَجَّةِ الْوَدَاعِ فَمِنَّا مَنْ أَهَلَّ بِعُمْرَةٍ وَمِنَّا مَنْ أَهَلَّ بِحَجٍّ فَلَمَّا قَدِمْنَا مَكَّةَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَهَلَّ بِعُمْرَةٍ وَلَمْ يُهْدِ فَلْيَحْلِلْ وَمَنْ أَحْرَمَ بِعُمْرَةٍ وَأَهْدَى فَلْيُهِلَّ بِالْحَجِّ مَعَ العُمرةِ ثمَّ لَا يحل حَتَّى يحل مِنْهَا» . وَفِي رِوَايَةٍ: «فَلَا يَحِلُّ حَتَّى يَحِلَّ بِنَحْرِ هَدْيِهِ وَمَنْ أَهَلَّ بِحَجٍّ فَلْيُتِمَّ حَجَّهُ» . قَالَتْ: فَحِضْتُ وَلَمْ أَطُفْ بِالْبَيْتِ وَلَا بَيْنَ الصَّفَا وَالْمَرْوَةِ فَلَمْ أَزَلْ حَائِضًا حَتَّى كَانَ يَوْمُ عَرَفَةَ وَلَمْ أُهْلِلْ إِلَّا بِعُمْرَةٍ فَأَمَرَنِي النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ أَنْقُضَ رَأْسِي وَأَمْتَشِطَ وَأُهِلَّ بِالْحَجِّ وَأَتْرُكَ الْعُمْرَةَ فَفَعَلْتُ حَتَّى قَضَيْتُ حَجِّي بَعَثَ مَعِي عَبْدَ الرَّحْمَنِ بْنَ أَبِي بَكْرٍ وَأَمَرَنِي أَنْ أَعْتَمِرَ مَكَانَ عُمْرَتِي مِنَ التَّنْعِيمِ قَالَتْ: فَطَافَ الَّذِينَ كَانُوا أَهَلُّوا بِالْعُمْرَةِ بِالْبَيْتِ وَبَيْنَ الصَّفَا وَالْمَرْوَةِ ثُمَّ حَلُّوا ثمَّ طافوا بَعْدَ أَنْ رَجَعُوا مِنْ مِنًى وَأَمَّا الَّذِينَ جَمَعُوا الْحَجَّ وَالْعُمْرَةَ فَإِنَّمَا طَافُوا طَوَافًا وَاحِدًا","english":{"narrator":"‘A'isha said:","text":"We went out with the Prophet at the Farewell Pilgrimage, some of us raising our voices in the talbiya for an ‘umra and others for a hajj. When we came to Mecca God s messenger said, “Those who have raised their voices in the talbiya for an ‘umra and have not brought sacrificial animals may put off the ihram, but those who have put on the ihram for an 'umra and brought sacrificial animals must raise their voices in the talbiya for the hajj along with the ’umra, and not put it off till they do so after performing them both ; (a version has “and not put it off till they do so after sacrificing their animals”) and those who have raised their voices in the talbiya for a hajj must complete their hajj.\" She said: I menstruated, and did not go round the House or run between as-Safa and al-Marwa, and I continued in my courses till the day of ‘Arafa. I had raised my voice in the talbiya only for an ’umra, but the Prophet ordered me to undo my hair, comb it, raise my voice in the talbiya for the hajj, and let the ‘umra go, which I did, and performed my hajj. He sent ‘Abd ar-Rahman b. Abu Bakr along with me and ordered me to make an ‘umra in place of the one I had missed from at-Tan‘im. She said: Those who had raised their voices in the talbiya for the ‘umra put off the ihram after making the circuit of the House and running between as-Safa and al-Marwa, then made a circuit after they returned from Mina, but those who combined the hajj and the ‘umra made only one circuit. \n\n(Bukharl and Muslim.)"}},{"id":51,"idInBook":51,"chapterId":10,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: تَمَتَّعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَجَّةِ الْوَدَاعِ بِالْعُمْرَةِ إِلَى الْحَجِّ فَسَاقَ مَعَهُ الْهَدْيَ مِنْ ذِي الْحُلَيْفَةِ وَبَدَأَ فَأَهَلَّ بِالْعُمْرَةِ ثُمَّ أَهَلَّ بِالْحَجِّ فَتَمَتَّعَ النَّاسُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْعُمْرَةِ إِلَى الْحَجِّ فَكَانَ مِنَ النَّاسِ مَنْ أَهْدَى وَمِنْهُمْ مَنْ لَمْ يُهْدِ فَلَمَّا قَدِمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَكَّةَ قَالَ لِلنَّاسِ: «مَنْ كَانَ مِنْكُمْ أَهْدَى فَإِنَّهُ لَا يَحِلُّ مِنْ شَيْءٍ حَرُمَ مِنْهُ حَتَّى يَقْضِيَ حَجَّهُ وَمَنْ لَمْ يَكُنْ مِنْكُمْ أَهْدَى فَلْيَطُفْ بِالْبَيْتِ وَبِالصَّفَا وَالْمَرْوَةِ وَلْيُقَصِّرْ وَلْيَحْلِلْ ثُمَّ لِيُهِلَّ بِالْحَجِّ وليُهد فمنْ لم يجدْ هَديا فيلصم ثَلَاثَةَ أَيَّامٍ فِي الْحَجِّ وَسَبْعَةً إِذَا رَجَعَ إِلَى أَهْلِهِ» فَطَافَ حِينَ قَدِمَ مَكَّةَ وَاسْتَلَمَ الرُّكْنَ أَوَّلَ شَيْءٍ ثُمَّ خَبَّ ثَلَاثَةَ أَطْوَافٍ وَمَشَى أَرْبَعًا فَرَكَعَ حِينَ قَضَى طَوَافَهُ بِالْبَيْتِ عِنْدَ الْمَقَامِ رَكْعَتَيْنِ ثُمَّ سَلَّمَ فَانْصَرَفَ فَأَتَى الصَّفَا فَطَافَ بِالصَّفَا وَالْمَرْوَةِ سَبْعَةَ أَطْوَافٍ ثُمَّ لَمْ يَحِلَّ مِنْ شَيْءٍ حَرُمَ مِنْهُ حَتَّى قَضَى حَجَّهُ وَنَحَرَ هَدْيَهُ يَوْمَ النَّحْرِ وَأَفَاضَ فَطَافَ بِالْبَيْتِ ثُمَّ حَلَّ مِنْ كُلِّ شَيْءٍ حَرُمَ مِنْهُ وَفَعَلَ مِثْلَ مَا فَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ سَاقَ الْهَدْي من النَّاس","english":{"narrator":"‘Abdallah b. ‘Umar said:","text":"At the Farewell Pilgrimage God’s messenger put on the ihram first for the 'umra and afterwards for the hajj, and drove the sacrificial animals along with him from Dhul Hulaifa. He first raised his voice in the talbiya for the ‘umra and afterwards he did so for the hajj, and the people along with the Prophet did it first for the ‘umra and afterwards for the hajj. Some of the people had brought sacrificial animals and others had not, so when the Prophet came to Mecca he said to the people, “Those of you who have brought sacrificial animals must not treat as lawful anything which has become unlawful for you till you complete your hajj ; but those of you who have not brought sacrificial animals should go round the House and between as-Safa and al-Marwa, clip your hair, put off the ihram, and afterwards raise your voice in the talbiya for the hajj and bring sacrificial animals. Those who cannot get sacrificial animals should fast three days during the hajj and seven days when they return to their families.” He performed the circumambulation when he came to Mecca, first touching the corner (The corner of the Ka'ba containing the Black Stone), then running during three circuits and walking during four, and when he had finished his circumambulation of the House he prayed two rak'as at the Station (Maqam Ibrahim), then giving the salutation, and departing, he went to as-Safa and went seven times between as-Safa and al-Marwa. After that he did not treat anything as lawful which had become unlawful for him till he had completed his hajj, sacrificed his animals on the day of sacrifice, gone quickly and performed the circumambulation of the House, after which all that had been unlawful became lawful for him. Those people who had brought sacrificial animals did as God’s messenger did. \n\n(Bukharl and Muslim.)"}},{"id":52,"idInBook":52,"chapterId":10,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ «هَذِهِ عُمْرَةٌ اسْتَمْتَعْنَا بِهَا فَمَنْ لَمْ يَكُنْ عِنْدَهُ الْهَدْيُ فَلْيَحِلَّ الْحِلَّ كُلَّهُ فَإِنَّ الْعُمْرَةَ قَدْ دَخَلَتْ فِي الْحَجِّ إِلَى يَوْمِ الْقِيَامَةِ» . رَوَاهُ مُسْلِمٌ\nوَهَذَا الْبَابُ خَالٍ عَنِ الْفَصْلِ الثَّانِي","english":{"narrator":"","text":"Ibn ‘Abbas reported God’s messenger as saying, “This is an ‘umra which we have treated as a complete observance, so those who have no sacrificial animals may come completely out of the sacred state, for the ‘umra has become incorporated in the hajj till the day of resurrection.\" \n\nMuslim transmitted it."}},{"id":53,"idInBook":53,"chapterId":10,"bookId":14,"arabic":"عَنْ عَطَاءٍ قَالَ: سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ فِي نَاسٍ مَعِي قَالَ: أَهْلَلْنَا أَصْحَابَ مُحَمَّد بِالْحَجِّ خَالِصًا وَحْدَهُ قَالَ عَطَاءٌ: قَالَ جَابِرٌ: فَقَدِمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صُبْحَ رَابِعَةٍ مَضَتْ مِنْ ذِي الْحِجَّةِ فَأَمَرَنَا أَنْ نَحِلَّ قَالَ عَطَاءٌ: قَالَ: «حِلُّوا وَأَصِيبُوا النِّسَاءَ» . قَالَ عَطَاءٌ: وَلَمْ يَعْزِمْ عَلَيْهِمْ وَلَكِنْ أَحَلَّهُنَّ لَهُمْ فَقُلْنَا لَمَّا لَمْ يَكُنْ بَيْنَنَا وَبَيْنَ عَرَفَةَ إِلَّا خَمْسٌ أَمَرَنَا أَنْ نُفْضِيَ إِلَى نِسَائِنَا فَنَأْتِيَ عرَفَةَ تَقْطُرُ مَذَاكِيرُنَا الْمَنِيَّ. قَالَ: «قَدْ عَلِمْتُمْ أَنِّي أَتْقَاكُمْ لِلَّهِ وَأَصْدَقُكُمْ وَأَبَرُّكُمْ وَلَوْلَا هَدْيِي لَحَلَلْتُ كَمَا تَحِلُّونَ وَلَوِ اسْتَقْبَلْتُ مِنْ أَمْرِي مَا اسْتَدْبَرْتُ لَمْ أَسُقِ الْهَدْيَ فَحِلُّوا» فَحَلَلْنَا وَسَمِعْنَا وَأَطَعْنَا قَالَ عَطَاءٌ: قَالَ جَابِرٌ: فَقَدِمَ عَلِيٌّ مِنْ سِعَايَتِهِ فَقَالَ: بِمَ أَهْلَلْتَ؟ قَالَ بِمَا أَهَلَّ بِهِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «فَأَهْدِ وَامْكُثْ حَرَامًا» قَالَ: وَأَهْدَى لَهُ عَلِيٌّ هَدْيًا فَقَالَ سُرَاقَةُ بْنُ مَالِكِ بْنِ جُعْشُمٍ: يَا رَسُولَ اللَّهِ ألعامنا هَذَا أم لأبد؟ قَالَ: «لأبد» . رَوَاهُ مُسلم","english":{"narrator":"‘Ata’ said that he and some people along with him heard Jabir b. ‘Abdallah say, “We, Muhammad’s companions, raised our voices in the talbiya for the hajj alone.\" ‘Ata’ reported Jabir as saying:","text":"The Prophet came on the fourth of Dhul Hijja and commanded us to put off the ihram, saying (as reported by ‘Ata’), “Come out of the sacred state and have intercourse with your wives.\" Ata’ explained that this was not by way of making intercourse obligatory, but by way of making it lawful. As it was only five days before they were due at ‘Arafa, they said he had ordered them to go in to their wives and so they would come to ‘Arafa with their penises dripping with prostatic fluid. He said that Jabir made a gesture, moving his hand, and he could still imagine himself looking at him (Perhaps the gesture was meant to indicate that they could have shaken off the fluid). The Prophet then got up among them and said, “You know that I am the most godfearing, truthful and pious one among you. Were it not that I have sacrificial animals I would have removed the ihram as you are doing, and had I known beforehand about my affair what I have come to know later I would not have brought sacrificial animals ; so remove the ihram.'’ They did so, hearing and obeying. ‘Ata’ quoted Jabir as saying that ‘Ali arrived after his expedition to collect the poor rate and he asked him for what he had raised his voice in the talbiya. He replied that he had done it for the same purpose as the Prophet, so God's messenger said to him, “Bring the sacrificial animals and remain in the sacred state.” He said that ‘Ali brought sacrificial animals for him and that Suraqa b. Malik b. Jush'um asked God’s messenger whether this applied to that particular year or, forever, to which he replied that it was applicable forever. \n\nMuslim transmitted it."}},{"id":54,"idInBook":54,"chapterId":10,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا أَنَّهَا قَالَتْ: قَدِمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأَرْبَعٍ مَضَيْنَ مِنْ ذِي الْحِجَّةِ أَوْ خَمْسٍ فَدَخَلَ عَلَيَّ وَهُوَ غَضْبَانُ فَقُلْتُ: مَنْ أَغْضَبَكَ يَا رَسُولَ اللَّهِ أَدْخَلَهُ اللَّهُ النَّارَ. قَالَ: «أَو مَا شَعَرْتِ أَنِّي أَمَرْتُ النَّاسَ بِأَمْرٍ فَإِذَا هُمْ يَتَرَدَّدُونَ وَلَوْ أَنِّي اسْتَقْبَلْتُ مِنْ أَمْرِي مَا اسْتَدْبَرْتُ مَا سُقْتُ الْهَدْيَ مَعِي حَتَّى أَشْتَرِيَهُ ثمَّ أُحلُّ كَمَا حلُّوا» . رَوَاهُ مُسلم","english":{"narrator":"‘A’isha said :","text":"God’s messenger came on the fourth or fifth of Dhul Hijja and came to visit me in a state of anger. I said, “Who has angered you, messenger of God? May God send him to hell!” He replied, “Are you not aware that I gave the people a command, yet they are confused? If I had known beforehand about my affair what I have come to know later, I would not have brought the sacrificial animals with me, but would have waited to buy some, and then I could have put off the ihram as they have done.” \n\nMuslim transmitted it."}},{"id":55,"idInBook":55,"chapterId":10,"bookId":14,"arabic":"عَنْ نَافِعٍ قَالَ: إِنَّ ابْنَ عُمَرَ كَانَ لَا يَقْدَمُ مَكَّةَ إِلَّا بَاتَ بِذِي طُوًى حَتَّى يُصْبِحَ وَيَغْتَسِلَ وَيُصَلِّيَ فَيَدْخُلَ مَكَّةَ نَهَارًا وَإِذَا نَفَرَ مِنْهَا مَرَّ بِذِي طُوًى وَبَاتَ بِهَا حَتَّى يُصْبِحَ وَيَذْكُرُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَفْعَلُ ذَلِكَ","english":{"narrator":"","text":"Nafi' said that it was Ibn ‘Umar’s habit not to come to Mecca without spending the night at Dhu Tuwa (A place near Mecca), after which he would bathe and pray, then enter Mecca in the daytime. When he left it he went by Way of Dhu Tuwa where he would stay overnight till the morning. He used to say that the Prophet was accustomed to do that. \n\nBukhari and Muslim."}},{"id":56,"idInBook":56,"chapterId":10,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: إِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا جَاءَ إِلَى مَكَّةَ دَخَلَهَا مِنْ أَعْلَاهَا وخرجَ منْ أسفلِها","english":{"narrator":"","text":"‘A’isha said that when the Prophet came to Mecca he entered it at the upper end and went out at the lower. \n\nBukhari and Muslim."}},{"id":57,"idInBook":57,"chapterId":10,"bookId":14,"arabic":"وَعَن عُروةَ بنِ الزُّبيرِ قَالَ: قَدْ حَجَّ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرَتْنِي عَائِشَةُ أَنَّ أَوَّلَ شَيْءٍ بَدَأَ بِهِ حِينَ قَدِمَ مَكَّةَ أَنَّهُ تَوَضَّأَ ثُمَّ طَافَ بِالْبَيْتِ ثُمَّ لَمْ تَكُنْ عُمْرَةً ثُمَّ حجَّ أَبُو بكرٍ فكانَ أوَّلَ شيءٍ بدَأَ بِهِ الطوَّافَ بالبيتِ ثمَّ لَمْ تَكُنْ عُمْرَةً ثُمَّ عُمَرُ ثُمَّ عُثْمَانُ مثلُ ذَلِك","english":{"narrator":"‘Urwa b. az-Zubair said:","text":"The Prophet has performed the hajj, and ‘A’isha told me that the first thing he did when he came to Mecca was to perform ablution, then go round the House, but an ‘umra was not observed. Then Abu Bakr performed the hajj and the first thing he did was to go round the House, but an ‘umra was not observed. Then ‘Umar and afterwards ‘Uthman did similarly. \n\nBukhari and Muslim."}},{"id":58,"idInBook":58,"chapterId":10,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا طَافَ فِي الْحَجِّ أَوِ الْعمرَة مَا يَقْدَمُ سَعَى ثَلَاثَةَ أَطْوَافٍ وَمَشَى أَرْبَعَةً ثُمَّ سَجَدَ سَجْدَتَيْنِ ثُمَّ يَطُوفُ بَيْنَ الصَّفَا والمروة","english":{"narrator":"","text":"Ibn ‘Umar said that when God’s messenger observed the circumambulation at the hajj or the ‘umra immediately on his arrival, he ran three circuits and walked four, then after making two prostrations he would go between as-Safa and al-Marwa. \n\nBukhari and Muslim."}},{"id":59,"idInBook":59,"chapterId":10,"bookId":14,"arabic":"وَعَنْهُ قَالَ: رَمَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ الْحَجَرِ ثَلَاثًا وَمَشَى أَرْبَعًا وَكَانَ يَسْعَى بِبَطْنِ الْمَسِيلِ إِذَا طَافَ بَيْنَ الصَّفَا وَالْمَرْوَةِ. رَوَاهُ مُسلم","english":{"narrator":"","text":"He said that God’s messenger ran three circuits beginning at the stone and walked four, and he ran in the bottom of the channel when he went between as-Safa and al-Marwa. \n\nMuslim transmitted it."}},{"id":60,"idInBook":60,"chapterId":10,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا قَدِمَ مَكَّةَ أَتَى الْحَجَرَ فَاسْتَلَمَهُ ثُمَّ مَشَى عَلَى يَمِينِهِ فَرَمَلَ ثَلَاثًا وَمَشى أَرْبعا. رَوَاهُ مُسلم","english":{"narrator":"","text":"Jabir said that when God’s messenger came to Mecca he went to the stone and touched it, then moved to his right, running three circuits and walking four. \n\nMuslim transmitted it."}},{"id":61,"idInBook":61,"chapterId":10,"bookId":14,"arabic":"وَعَنِ الزُّبَيْرِ بْنِ عَرَبِيٍّ قَالَ: سَأَلَ رَجُلٌ ابنَ عمرَ عَنِ اسْتِلَامِ الْحَجَرِ فَقَالَ: رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْتَلِمُهُ وَيُقَبِّلُهُ. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Az-Zubair b. ‘Arabi said that a man asked Ibn ‘Umar about touching the stone, and he replied that he had seen God s messenger touching it and kissing it. \n\nBukhari transmitted it."}},{"id":62,"idInBook":62,"chapterId":10,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: لَمْ أَرَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْتَلِمُ من الْبَيْت إِلَّا الرُّكْنَيْنِ اليمانيين","english":{"narrator":"","text":"Ibn ‘Umar said that he had not seen the Prophet touching anything in the House but the two Yamani corners (The corner containing the Black Stone and the Yamani corner to the south-east which, as is usually held, should be touched but not kissed. They are both held to be on the foundations laid by Abraham). \n\nBukhari and Muslim."}},{"id":63,"idInBook":63,"chapterId":10,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: طَافَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَجَّةِ الْوَدَاعِ عَلَى بعير يسْتَلم الرُّكْن بمحجن","english":{"narrator":"","text":"Ibn ‘Abbas said that the Prophet performed the circumambulation at the Farewell Pilgrimage on a camel and touched the corner with a crooked stick. \n\nBukhari and Muslim."}},{"id":64,"idInBook":64,"chapterId":10,"bookId":14,"arabic":"وَعَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طَافَ بِالْبَيْتِ عَلَى بَعِيرٍ كُلَّمَا أَتَى عَلَى الرُّكْنِ أَشَارَ إِلَيْهِ بِشَيْءٍ فِي يدِه وكبَّرَ. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"He said that God’s messenger went round the House on a camel, and as often as he came to the corner he pointed to it with something in his hand and said, “God is most great.” \n\nBukhari transmitted it."}},{"id":65,"idInBook":65,"chapterId":10,"bookId":14,"arabic":"وَعَنْ أَبِي الطُّفَيْلِ قَالَ: رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَطُوفُ بِالْبَيْتِ وَيَسْتَلِمُ الرُّكْنَ بِمِحْجَنٍ مَعَهُ ويقبِّلُ المحجن. رَوَاهُ مُسلم","english":{"narrator":"","text":"Abut Tufail said he saw God’s messenger going round the House, touching the corner with a crooked stick which he had, and kissing the crooked stick. \n\nMuslim transmitted it."}},{"id":66,"idInBook":66,"chapterId":10,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ قَالَتْ: خَرَجْنَا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا نَذْكُرُ إِلَّا الْحَجَّ فَلَمَّا كُنَّا بِسَرِفَ طَمِثْتُ فَدَخَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا أَبْكِي فَقَالَ: «لَعَلَّكِ نَفِسْتِ؟» قُلْتُ: نَعَمْ قَالَ: «فَإِنَّ ذَلِكِ شَيْءٌ كَتَبَهُ اللَّهُ عَلَى بَنَاتِ آدَمَ فَافْعَلِي مَا يَفْعَلُ الْحَاجُّ غَيْرَ أَنْ لَا تَطُوفِي بِالْبَيْتِ حَتَّى تَطْهُرِي»","english":{"narrator":"‘A’isha said:","text":"We went out with the Prophet mentioning nothing but the hajj, and when we were at Sarif (A place near at-Tan'im) I began to menstruate. The Prophet came in and finding me weeping, he said, “Perhaps you are menstruating.” When I replied that I was, he said, “That is something which God has decreed for the daughters of Adam; but do what the pilgrims do, with the exception of going round the House, till you are purified.” \n\nBukhari and Muslim."}},{"id":67,"idInBook":67,"chapterId":10,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: بَعَثَنِي أَبُو بَكْرٍ فِي الْحَجَّةِ الَّتِي أَمَّرَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَيْهَا قَبْلَ حَجَّةِ الْوَدَاعِ يَوْمَ النَّحْرِ فِي رَهْطٍ أَمَرَهُ أَنْ يُؤَذِّنَ فِي النَّاسِ: «أَلَا لَا يَحُجُّ بَعْدَ العامِ مشرِكٌ وَلَا يطوفَنَّ بِالْبَيْتِ عُرْيَان»","english":{"narrator":"Abu Huraira said:","text":"On the day of sacrifice at the pilgrimage before the Farewell Pilgrimage over which the Prophet had appointed Abu Bakr, he sent me with a group whom he had ordered to announce among the people, “After this year no polytheist may perform the pilgrimage, and no naked person may go round the House.” \n\nBukhari and Muslim."}},{"id":68,"idInBook":68,"chapterId":10,"bookId":14,"arabic":"عَنِ الْمُهَاجِرِ الْمَكِّيِّ قَالَ: سُئِلَ جَابِرٌ عَنِ الرَّجُلِ يَرَى الْبَيْتَ يَرْفَعُ يَدَيْهِ فَقَالَ قَدْ حَجَجْنَا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمْ نَكُنْ نَفْعَلُهُ. رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ","english":{"narrator":"","text":"Al-Muhajir al-Makki said that Jabir was asked about the man who raises his hands on seeing the House and replied, “We have performed the pilgrimage along with the Prophet and we did not do so.” \n\nTirmidhi and Abu Dawud transmitted it."}},{"id":69,"idInBook":69,"chapterId":10,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: أَقْبَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَدَخَلَ مَكَّةَ فَأَقْبَلَ إِلَى الْحَجَرِ فَاسْتَلَمَهُ ثُمَّ طَافَ بِالْبَيْتِ ثُمَّ أَتَى الصَّفَا فَعَلَاهُ حَتَّى يَنْظُرَ إِلَى الْبَيْتِ فَرَفَعَ يَدَيْهِ فَجَعَلَ يَذْكُرُ اللَّهَ مَا شَاءَ وَيَدْعُو. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Abu Huraira said that God's messenger came and entered Mecca, and after he had gone forward to the stone and touched it, he went round the House. He then went to as-Safa and mounted it so that he could look at the House, then he raised his hands, began to make mention of God as much as he wished and make supplication. \n\nAbu Dawud transmitted it."}},{"id":70,"idInBook":70,"chapterId":10,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الطَّوَافُ حَوْلَ الْبَيْتِ مِثْلُ الصَّلَاةِ إِلَّا أَنَّكُمْ تَتَكَلَّمُونَ فِيهِ فَمَنْ تَكَلَّمَ فِيهِ فَلَا يَتَكَلَّمَنَّ إِلَّا بِخَيْرٍ» . رَوَاهُ التِّرْمِذِيُّ وَالنَّسَائِيُّ وَالدَّارِمِيُّ وَذَكَرَ التِّرْمِذِيُّ جَمَاعَةً وَقَفُوهُ عَلَى ابْنِ عباسٍ","english":{"narrator":"","text":"Ibn ‘Abbas reported the Prophet as saying, “The circumambulation of the House is like prayer, except that you speak while performing it; but he who speaks must speak only what is good.\" \n\nTirmidhi, Nasa’i and Darimi transmitted it, Tirmidhi mentioning a number who traced it no farther back than Ibn ‘Abbas."}},{"id":71,"idInBook":71,"chapterId":10,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «نَزَلَ الْحَجَرُ الْأَسْوَدُ مِنَ الْجَنَّةِ وَهُوَ أَشَدُّ بَيَاضًا مِنَ اللَّبَنِ فَسَوَّدَتْهُ خَطَايَا بَنِي آدَمَ» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ حَسَنٌ صَحِيح","english":{"narrator":"","text":"He reported God's messenger as saying, “The black stone descended from paradise whiter than milk, but the sins of the descendants of Adam made it black.\" \n\nAhmad and Tirmidhi transmitted it, the latter saying that this is a hasan sahih tradition."}},{"id":72,"idInBook":72,"chapterId":10,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْحَجَرِ: «وَاللَّهِ لَيَبْعَثَنَّهُ اللَّهُ يَوْمَ الْقِيَامَةِ لَهُ عَيْنَانِ يُبْصِرُ بِهِمَا وَلِسَانٌ يَنْطِقُ بِهِ يَشْهَدُ عَلَى مَنِ اسْتَلَمَهُ بِحَقٍّ» . رَوَاهُ التِّرْمِذِيّ وَابْن مَاجَه والدارمي","english":{"narrator":"","text":"He reported God’s messenger as saying concerning the stone, “I swear by God that God will certainly raise it up on the day of resurrection with eyes with which it will see and a tongue with which it will speak, and it will give testimony about those who touched it in a proper manner.\" \n\nTirmidhi, Ibn Majah and Darimi transmitted it."}},{"id":73,"idInBook":73,"chapterId":10,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِنَّ الرُّكْنَ وَالْمَقَامَ يَاقُوتَتَانِ مِنْ يَاقُوتِ الْجَنَّةِ طَمَسَ اللَّهُ نورَهما وَلَو لم يطمِسْ نورَهما لأضاءا مَا بينَ المشرقِ والمغربِ» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Ibn ‘Umar said that he heard God's messenger say, “The Corner and the Station are two of the sapphires of paradise whose light God has obliterated. If He had not done so, they would have illuminated everything between the East and West.\" \n\nTirmidhi transmitted it."}},{"id":74,"idInBook":74,"chapterId":10,"bookId":14,"arabic":"وَعَن عُبيدِ بنِ عُمَيرٍ: أَنَّ ابْنَ عُمَرَ كَانَ يُزَاحِمُ عَلَى الرُّكْنَيْنِ زِحَامًا مَا رَأَيْتُ أَحَدًا مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُزَاحِمُ عَلَيْهِ قَالَ: إِنْ أَفْعَلْ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِنَّ مَسْحَهُمَا كَفَّارَةٌ لِلْخَطَايَا» وَسَمِعْتُهُ يَقُولُ: «مَنْ طَافَ بِهَذَا الْبَيْتِ أُسْبُوعًا فَأَحْصَاهُ كَانَ كَعِتْقِ رَقَبَةٍ» . وَسَمِعْتُهُ يَقُولُ: «لَا يَضَعُ قَدَمًا وَلَا يَرْفَعُ أُخْرَى إِلا حطَّ اللَّهُ عنهُ بهَا خَطِيئَة وكتبَ لهُ بهَا حَسَنَة» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"‘Ubaid b. ‘Umair said:","text":"Ibn ‘Umar used to press towards the two corners in a manner I have not seen any of the companions of God’s messenger press. He said, “If I do so, it is because I heard God’s messenger say that stroking them is an atonement for sins; and I heard him say that if anyone goes round this House for a week and counts his circuits, it will be like setting free a slave; I heard him say that no one will place one foot on the ground and raise the other without God removing a sin from him on account of it and recording a blessing for him on account of it.” \n\nTirmidhi transmitted it."}},{"id":75,"idInBook":75,"chapterId":10,"bookId":14,"arabic":"وَعَن عبد الله بن السَّائِب قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَا بَيْنَ الرُّكْنَيْنِ: (رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَاب النَّار)\nرَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"‘Abdallah b. as-Sa’ib said that he heard God’s messenger say between the two corners, “O God bring us a blessing in this world and a blessing in the next, and guard us from the punishment of hell.\" \n\nAbu Dawud transmitted it."}},{"id":76,"idInBook":76,"chapterId":10,"bookId":14,"arabic":"وَعَن صفيةَ بنتِ شيبةَ قَالَتْ: أَخْبَرَتْنِي بِنْتُ أَبِي تُجْرَاةَ قَالَتْ: دَخَلْتُ مَعَ نِسْوَةٍ مِنْ قُرَيْشٍ دَارَ آلِ أَبِي حُسَيْنٍ نَنْظُرُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَسْعَى بَيْنَ الصَّفَا وَالْمَرْوَةِ فَرَأَيْتُهُ يَسْعَى وَإِنَّ مِئْزَرَهُ لَيَدُورُ مِنْ شِدَّةِ السَّعْيِ وَسَمِعْتُهُ يَقُولُ: «اسْعَوْا فَإِنَّ اللَّهَ كَتَبَ عَلَيْكُمُ السَّعْيَ» . رَوَاهُ فِي شَرْحِ السُّنَّةِ وَرَوَاهُ أَحْمد مَعَ اخْتِلَاف","english":{"narrator":"","text":"Safiya daughter of Shaiba said that the daughter of Abu Tujrat told her she had entered the house of the family of Abu Husain along with some women of Quraish and they had watched God’s messenger while he was running between as-Safa and al-Marwa. She saw his lower garment moving round as he ran because of the vigour with which he did it, and she heard him saying, “Run, for God has prescribed running for you.\" \n\nIt is transmitted in Sharh as-sunna, and Ahmad transmitted it with some difference."}},{"id":77,"idInBook":77,"chapterId":10,"bookId":14,"arabic":"وَعَنْ قُدَامَةَ بْنِ عَبْدِ اللَّهِ بْنِ عَمَّارٍ قَالَ: رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْعَى بَيْنَ الصَّفَا وَالْمَرْوَةِ عَلَى بَعِيرٍ لَا ضرب وَلَا طرد وَلَا إِلَيْك. رَوَاهُ فِي شرح السّنة","english":{"narrator":"","text":"Qudama b. ‘Abdallah b. 'Ammar said that he saw God’s messenger running between as-Safa and al-Marwa on a camel without striking it, or driving people away, or telling them to move aside. \n\nIt is transmitted in Sharh as-sunna."}},{"id":78,"idInBook":78,"chapterId":10,"bookId":14,"arabic":"وَعَنْ يَعْلَى بْنِ أُمَيَّةَ قَالَ: إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طَافَ بِالْبَيْتِ مُضْطَجعا بِبُرْدٍ أَخْضَرَ. رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ","english":{"narrator":"","text":"Ya'la b. Umayya said that God’s messenger went round the House wearing a green Yamani mantle under his right armpit with the end over his left shoulder. \n\nTirmidhi, Abu Dawud, Ibn Majah and Darimi transmitted it."}},{"id":79,"idInBook":79,"chapterId":10,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى الله عَلَيْهِ وَسلم وأصحابَه اعتمروا من الجعْرانة فَرَمَلُوا بِالْبَيْتِ ثَلَاثًا وَجَعَلُوا أَرْدِيَتَهُمْ تَحْتَ آبَاطِهِمْ ثُمَّ قَذَفُوهَا عَلَى عَوَاتِقِهِمُ الْيُسْرَى. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Ibn ‘Abbas said that God’s messenger and his companions performed an ‘umra from al-Ji'rana (A place where there was water less than half way from Mecca to at-Ta’if) and ran three times round the House. They put their upper garments under their armpits and threw the ends over their left shoulders. \n\nAbu Dawud transmitted it."}},{"id":80,"idInBook":80,"chapterId":10,"bookId":14,"arabic":"عَنِ ابْنِ عُمَرَ قَالَ: مَا تَرَكْنَا اسْتِلَامَ هَذَيْنِ الرُّكْنَيْنِ: الْيَمَانِي وَالْحَجَرِ فِي شِدَّةٍ وَلَا رخاء مُنْذُ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يستلمهما\nوَفِي رِوَايَةٍ لَهُمَا: قَالَ نَافِعٌ: رَأَيْتُ ابْنَ عُمَرَ يَسْتَلِمُ الْحَجَرَ بِيَدِهِ ثُمَّ قَبَّلَ يَدَهُ وَقَالَ: مَا تَرَكْتُهُ مُنْذُ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَفْعَله","english":{"narrator":"","text":"Ibn ‘Umar said, “We did not give up touching these two corners, the Yamani and the stone, whether it was difficult or easy, since I saw God’s messenger touch them.\" In a version by both of them Nafi’ said he saw Ibn ‘Umar touching the stone with his hand, after which he kissed his hand. He said, “I have not given it up since I saw God's messenger doing it.\"\n\nBukhari and Muslim."}},{"id":81,"idInBook":81,"chapterId":10,"bookId":14,"arabic":"وَعَنْ أُمِّ سَلَمَةَ قَالَتْ: شَكَوْتُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنِّي أَشْتَكِي. فَقَالَ: «طُوفِي مِنْ وَرَاءِ النَّاسِ وَأَنْتِ رَاكِبَةٌ» فَطُفْتُ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي إِلَى جَنْبِ الْبَيْتِ يَقْرَأُ ب (الطُّورِ وكِتَابٍ مسطور)","english":{"narrator":"","text":"Umm Salama said that she complained to God’s messenger of being ill, and he told her to perform the circumambulation behind the people riding. She did so, and God’s messenger was praying towards the side of the House and reciting, “By at-Tur and a Book inscribed.”( Qur’an, 52. The text here has bit-Tur, whereas the Qur’an has wat-Tur. Bukhari has wat- Tur in Hajj, 64, but he has bit-Tur ,in Salat, 78, Hajj, 74, and Tafsir Surat at-Tur, 1). \n\n(Bukhari and Muslim)"}},{"id":82,"idInBook":82,"chapterId":10,"bookId":14,"arabic":"وَعَنْ عَابِسِ بْنِ رَبِيعَةَ قَالَ: رَأَيْت عمر يقبل الْحجر وَيَقُول: وَإِنِّي لَأَعْلَمُ أَنَّكَ حَجَرٌ مَا تَنْفَعُ وَلَا تَضُرُّ وَلَوْلَا أَنِّي رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يقبل مَا قبلتك","english":{"narrator":"","text":"‘Abis b Rabi'a said he saw ‘Umar kissing the stone and saying, “I know for sure that you are a stone which can neither benefit nor injure, and had I not seen God’s messenger kissing you I would not have kissed you.” \n\n(Bukharl and Muslim.)"}},{"id":83,"idInBook":83,"chapterId":10,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «وُكِّلَ بِهِ سَبْعُونَ مَلَكًا» يَعْنِي الرُّكْنَ الْيَمَانِيَ \n\" فَمَنْ قَالَ: اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ قَالُوا: آمين \". رَوَاهُ ابْن مَاجَه","english":{"narrator":"","text":"Abu Huraira reported the Prophet as saying, “Seventy angels have been put in charge of it (i.e. the Yamani corner), so if anyone says, ‘O God, I ask Thee for pardon and wellbeing in this world and the next; our Lord, bring us a blessing in this world and a blessing in the next, and guard us from the punishment of hell’, they will say Amen.” \n\nIbn Majah transmitted it."}},{"id":84,"idInBook":84,"chapterId":10,"bookId":14,"arabic":"وَعَنْهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" مَنْ طَافَ بِالْبَيْتِ سَبْعًا وَلَا يَتَكَلَّمُ إِلَّا بِ: سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَلَا إِلَهَ إِلَّا اللَّهُ وَاللَّهُ أَكْبَرُ وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ مُحِيَتْ عَنْهُ عَشْرُ سَيِّئَاتٍ وَكُتِبَ لَهُ عَشْرُ حَسَنَاتٍ وَرُفِعَ لَهُ عَشْرُ دَرَجَاتٍ. وَمَنْ طَافَ فَتَكَلَّمَ وَهُوَ فِي تِلْكَ الْحَالِ خَاضَ فِي الرَّحْمَةِ بِرِجْلَيْهِ كَخَائِضِ الماءِ برجليه \". رَوَاهُ ابْن مَاجَه","english":{"narrator":"","text":"He reported the Prophet as saying, “If anyone goes round the House not talking except to say, ‘Glory be to God; praise be to God; there is no god but God; God is most great; there is no might and no power except in God’s ten evil deeds will be blotted out from him, ten blessings will be recorded for him, and he will be raised ten degrees. If anyone goes round and talks while doing so, he will wade in mercy like him who wades in water.”( Mirqat 3, 215 says Tibi understands 'talks’ to refer to the phrases mentioned above, and trusts this as a repetition of what has preceded ; but Ibn Hajar understands it as referring to other words and so meriting a lesser reward. Tibi’s explanation is preferred) \n\nIbn Majah transmitted it."}},{"id":85,"idInBook":85,"chapterId":10,"bookId":14,"arabic":"عَن محمدِ بن أبي بكرٍ الثَقَفيُّ أَنَّهُ سَأَلَ أَنَسَ بْنَ مَالِكٍ وَهُمَا غَادِيَانِ مِنْ مِنًى إِلَى عَرَفَةَ: كَيْفَ كُنْتُمْ تَصْنَعُونَ فِي هَذَا الْيَوْمِ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ؟ فَقَالَ: كَانَ يُهِلُّ مِنَّا الْمُهِلُّ فَلَا يُنْكَرُ عَلَيْهِ وَيُكَبِّرُ الْمُكَبِّرُ مِنَّا فَلَا يُنكَرُ عَلَيْهِ","english":{"narrator":"","text":"Muhammad b. Abu Bakr ath-Thaqafi said that he asked Anas b. Malik when they were going in the morning from Mina to ‘Arafa how they used to conduct themselves on that day along with God’s messenger, and he replied, “Those of us who raised their voices in the talbiya did so without any objection being made, and those of us who cried ‘God is most great’ did so without any objection being made.\"\nBukhari and Muslim."}},{"id":86,"idInBook":86,"chapterId":10,"bookId":14,"arabic":"وَعَنْ جَابِرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «نحرتُ هَهُنَا وَمِنًى كُلُّهَا مَنْحَرٌ فَانْحَرُوا فِي رِحَالِكُمْ. وَوَقَفْتُ هَهُنَا وعرفةُ كلُّها موقفٌ. ووقفتُ هَهُنَا وجَمْعٌ كلُّها موقفٌ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Jabir reported God’s messenger as saying, “I have sacrificed here, but the whole of Mina is a place of sacrifice, so sacrifice where you are staying. I have stood here, but all ‘Arafa is a place for standing. I have stood here, but all Jam' (A name for al-Muzdalifa, but it is also said to include the whole area between Mina and Arafa)  is a place for standing.\"\n\nMuslim transmitted it."}},{"id":87,"idInBook":87,"chapterId":10,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ قَالَتْ: إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" مَا مِنْ يَوْمٍ أَكْثَرَ مِنْ أَنْ يُعْتِقَ اللَّهُ فِيهِ عَبْدًا مِنَ النَّارِ مِنْ يَوْمِ عَرَفَةَ وَإِنَّهُ لَيَدْنُو ثُمَّ يُبَاهِي بِهِمُ الْمَلَائِكَةَ فَيَقُولُ: مَا أَرَادَ هَؤُلَاءِ \". رَوَاهُ مُسلم","english":{"narrator":"","text":"‘A’isha reported God’s messenger as saying, “There is no day when God sets free more servants from hell than the day of ‘Arafa. He draws near, then praises them (Literally, ‘boasts of them.’) to the angels saying, ‘What do these want ?”’(The reference is probably to their undertaking the vicissitudes of the Pilgrimage)\n\nMuslim transmitted it."}},{"id":88,"idInBook":88,"chapterId":10,"bookId":14,"arabic":"عَنْ عَمْرِو بْنِ عَبْدِ اللَّهِ بْنِ صَفْوَانَ عَنْ خَالٍ لَهُ يُقَالُ لَهُ يَزِيدُ بْنُ شَيْبَانَ قَالَ: كُنَّا فِي مَوْقِفٍ لَنَا بِعَرَفَةَ يُبَاعِدُهُ عَمْرٌو مِنْ مَوْقِفِ الْإِمَامِ جِدًّا فَأَتَانَا ابْنُ مِرْبَعٍ الْأَنْصَارِيُّ فَقَالَ: إِنِّي رَسُولُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَيْكُمْ يَقُولُ لَكُمْ: «قِفُوا عَلَى مَشَاعِرِكُمْ فَإِنَّكُمْ عَلَى إِرْثِ من إِرْثِ أَبِيكُمْ إِبْرَاهِيمَ عَلَيْهِ السَّلَامُ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالنَّسَائِيُّ وَابْنُ مَاجَهْ","english":{"narrator":"‘Amr b. ‘Abdallah b. Safwan quoted a maternal uncle of his called Yazid b. Shaiban who said:","text":"We were in a place of standing of ours at ‘Arafa (which ‘Amr indicated was very far away from where the imam was standing), when Ibn Mirba' al-Ansari came to us and told us he had brought this message for us from God’s messenger, “Stand where you are performing your devotions, for you are conforming to an old practice of your father Abraham.\"\n\nReported by Tirmidhi, Abu Dawud, Nasa’i, and Ibn Majah."}},{"id":89,"idInBook":89,"chapterId":10,"bookId":14,"arabic":"وَعَنْ جَابِرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «كُلُّ عَرَفَةَ مَوْقِفٌ وَكُلُّ مِنًى مَنْحَرٌ وَكُلُّ الْمُزْدَلِفَةِ مَوْقِفٌ وَكُلُّ فِجَاجِ مَكَّةَ طَرِيقٌ وَمَنْحَرٌ» . رَوَاهُ أَبُو دَاوُدَ وَالدَّارِمِيُّ","english":{"narrator":"","text":"Jabir reported God’s messenger as saying, “The whole of ‘Arafa is a place of standing, the whole of Mina is a place of sacrifice, the whole of  al-Muzdalifa is a place of standing, and all the passes of Mecca are a thoroughfare and a place of sacrifice.”\n\nAbu Dawud and Darimi transmitted it."}},{"id":90,"idInBook":90,"chapterId":10,"bookId":14,"arabic":"وَعَن خالدِ بنَ هَوْذَةَ قَالَ: رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ النَّاسَ يَوْمَ عَرَفَةَ عَلَى بَعِيرٍ قَائِمًا فِي الركابين. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Khalid b. Haudha said he saw the Prophet addressing the people on the day of ‘Arafa standing in the stirrups on a camel.\n\nAbu Dawud transmitted it."}},{"id":91,"idInBook":91,"chapterId":10,"bookId":14,"arabic":"وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" خَيْرُ الدُّعَاءِ دُعَاءُ يَوْمِ عَرَفَةَ وَخَيْرُ مَا قُلْتُ أَنَا وَالنَّبِيُّونَ مِنْ قَبْلِي: لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْء قدير \". رَوَاهُ التِّرْمِذِيّ\nوروى مالكٌ عَنْ طَلْحَةَ بْنِ عُبَيْدِ اللَّهِ إِلَى قَوْلِهِ: «لَا شريك لَهُ»","english":{"narrator":"","text":"‘Amr b. Shu'aib, on his father’s authority, quoted his grandfather as saying that the Prophet said, “The best supplication is that on the day of ‘Arafa, and the best thing which I and the prophets before me have said is, ‘There is no god but God alone who has no partner; to Him belongs the dominion, to Him praise is due, and He is omnipotent’.’’\n\nTirmidhi transmitted it, and Malik transmitted on the authority of Talha b. ‘Ubaidallah up to “who has no partner.”"}},{"id":92,"idInBook":92,"chapterId":10,"bookId":14,"arabic":"لإرساله وَعَنْ طَلْحَةَ بْنِ عُبَيْدِ اللَّهِ بْنِ كَرِيزٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَا رُئِيَ الشَّيْطَانُ يَوْمًا هُوَ فِيهِ أَصْغَرُ وَلَا أَدْحَرُ وَلَا أَحْقَرُ وَلَا أَغْيَظُ مِنْهُ فِي يَوْمِ عَرَفَةَ وَمَا ذَاكَ إِلَّا لِمَا يَرَى مِنْ تَنَزُّلِ الرَّحْمَةِ وَتَجَاوُزِ اللَّهِ عَنِ الذُّنُوبِ الْعِظَامِ إِلَّا مَا رُئِيَ يَوْمَ بَدْرٍ» . فَقِيلَ: مَا رُئِيَ يَوْمَ بَدْرٍ؟ قَالَ: «فَإِنَّهُ قَدْ رَأَى جِبْرِيلَ يَزَعُ الْمَلَائِكَةَ» . رَوَاهُ مَالِكٌ مُرْسَلًا وَفِي شَرْحِ السُّنَّةِ بِلَفْظِ الْمَصَابِيحِ","english":{"narrator":"Talha b. ‘Ubaidallah b. Kariz reported God’s messenger as saying, “On no day is the devil seen more insignificant, more violently repelled, more ignominious, or more angry than on the day of ‘Arafa, that being due to no other reason than the mercy he sees being sent down and God’s forgiveness of great sins, except for what was seen on the day of Badr.” He was asked what was seen on the day of Badr and replied,( This is a translation of the text in the Damascus edition. Mirqat, 3, 219 omits ‘He was :","text":"asked ... replied’. Muwatta’, Hajj, 245 has, ‘Except for what he saw on the day of Badr.’ God’s messenger was asked what he saw on the day of Badr and replied ...) “He saw Gabriel keeping the angels in battle-order.”\n\nMalik transmitted it in mursal form, and it occurs in Sharh as-sunna with the wording of al-Masabih."}},{"id":93,"idInBook":93,"chapterId":10,"bookId":14,"arabic":"وَعَنْ جَابِرٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" إِذَا كَانَ يَوْمُ عَرَفَةَ إِنَّ اللَّهَ يَنْزِلُ إِلَى السَّمَاءِ الدُّنْيَا فَيُبَاهِي بِهِمُ الْمَلَائِكَةَ فَيَقُولُ: انْظُرُوا إِلَى عِبَادِي أَتَوْنِي شُعْثًا غُبْرًا ضَاجِّينَ مِنْ كُلِّ فَجٍّ عَمِيقٍ أُشْهِدُكُمْ أَنِّي قَدْ غَفَرْتُ لَهُمْ فَيَقُولُ الْمَلَائِكَةُ: يَا رَبِّ فُلَانٌ كَانَ يُرَهَّقُ وَفُلَانٌ وَفُلَانَةُ قَالَ: يَقُولُ اللَّهُ عَزَّ وَجَلَّ: قَدْ غَفَرْتُ لَهُمْ \". قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «فَمَا مِنْ يَوْمٍ أَكْثَرَ عَتِيقًا مِنَ النَّارِ مِنْ يَوْمِ عَرَفَةَ» . رَوَاهُ فِي شرح السّنة","english":{"narrator":"Jabir reported God’s messenger as saying :","text":"When the day of ‘Arafa comes God descends to the lowest heaven and praises them to the angels  saying, “Look at my servants who have come to me dishevelled, dusty and crying out from every deep valley. I call you to witness that I have forgiven them.” Then the angels say, “My Lord, so and so was being suspected of sin, also so and so and such and such a woman.” He said  that God who is great and glorious replies, “I have forgiven them.” God’s messenger said, “No day has more people set free from hell than the day of ‘Arafa.”\n\nIt is transmitted in Sharh as-sunna."}},{"id":94,"idInBook":94,"chapterId":10,"bookId":14,"arabic":"عَن عَائِشَة قَالَتْ: كَانَ قُرَيْشٌ وَمَنْ دَانَ دِينَهَا يَقِفُونَ بالمزْدَلفَةِ وَكَانُوا يُسمَّوْنَ الحُمْسَ فكانَ سَائِرَ الْعَرَبِ يَقِفُونَ بِعَرَفَةَ فَلَمَّا جَاءَ الْإِسْلَامُ أَمَرَ اللَّهُ تَعَالَى نَبِيَّهُ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَأْتِيَ عَرَفَاتٍ فَيَقِفُ بِهَا ثُمَّ يَفِيضُ مِنْهَا فَذَلِكَ قَوْلُهُ عَزَّ وَجَلَّ: (ثُمَّ أفِيضُوا من حَيْثُ أَفَاضَ النَّاس)","english":{"narrator":"","text":"‘A’isha said that Quraish and those who followed their religion used to stand at al-Muzdalifa, and they were called al-Hums,(The plural of ahmas, meaning hardy or rigorous. It is said that this name was applied to them because they boasted of their bravery and endurance. Another explanation is that they observed rites of standing only at Hamss', which is the Ka’ba) but the rest of the Arabs used to stand at ‘Arafa ; then when Islam came God most high commanded His Prophet to go to ‘Arafat (Both 'Arafa and its plural‘Arafat are used. It is rather peculiar to find bcth used In the same tradition) and stand there, then go quickly from it. That is in accordance with the words of Him who is great and glorious, “Then go quickly from where the people went quickly.”(Qur’an, 2, 199)\n\nBukhari and Muslim."}},{"id":95,"idInBook":95,"chapterId":10,"bookId":14,"arabic":"وَعَن عبَّاسِ بنِ مِرْداسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَعَا لِأُمَّتِهِ عَشِيَّةَ عَرَفَةَ بِالْمَغْفِرَةِ فَأُجِيبَ: «إِنِّي قَدْ غَفَرْتُ لَهُمْ مَا خَلَا الْمَظَالِمَ فَإِنِّي آخُذُ لِلْمَظْلُومِ مِنْهُ» . قَالَ: «أَيْ رَبِّ إِنْ شِئْتَ أَعْطَيْتَ الْمَظْلُومَ مِنَ الْجَنَّةِ وَغَفَرْتَ لِلظَّالِمِ» فَلَمْ يُجَبْ عَشِيَّتَهُ فَلَمَّا أَصْبَحَ بِالْمُزْدَلِفَةِ أَعَادَ الدُّعَاءَ فَأُجِيبَ إِلَى مَا سَأَلَ. قَالَ: فَضَحِكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوِ قَالَ تبسَّمَ فَقَالَ لَهُ أَبُو بَكْرٍ وَعُمَرُ: بِأَبِي أَنْتَ وَأُمِّي إِنَّ هَذِهِ لَسَاعَةٌ مَا كُنْتَ تَضْحَكُ فِيهَا فَمَا الَّذِي أَضْحَكَكَ أَضْحَكَ اللَّهُ سِنَّكَ؟ قَالَ: «إِنَّ عَدُوَّ اللَّهِ إِبْلِيسَ لَمَّا عَلِمَ أَنَّ اللَّهَ عَزَّ وَجَلَّ قَدِ اسْتَجَابَ دُعَائِي وَغَفَرَ لأمَّتي أخذَ الترابَ فَجعل يحشوه عَلَى رَأْسِهِ وَيَدْعُو بِالْوَيْلِ وَالثُّبُورِ فَأَضْحَكَنِي مَا رَأَيْتُ مِنْ جَزَعِهِ» . رَوَاهُ ابْنُ مَاجَهْ وَرَوَى البيهقيُّ فِي كتاب الْبَعْث والنشور نحوَه","english":{"narrator":"","text":"‘Abbas b. Mirdas said that God’s messenger prayed for pardon for his people on the late evening of ‘Arafa and received the reply, “I have forgiven them all but acts of oppression, for I shall exact recompense for him who is wronged from his oppressor.” He said, “O my Lord, if Thou wilt Thou mayest give the oppressed some of paradise and forgive the oppressor,” but he did not receive a reply that evening. So he repeated the supplication at al-Muzdalifa in the morning and was given an answer to what he asked, whereupon he laughed (or he said that he smiled). Abu Bakr and ‘Umar then said to him, “You for whom we would give our fathers and mothers as ransom, what has made you laugh, for this is not a time at which you have been accustomed to laugh ? May God give you cause for laughter all your life !” He replied, “When God’s enemy, Iblls, knew that God who is great and glorious had answered my supplication and forgiven my people, he took some earth and began to throw it on his head crying out ‘Woe and destruction.’ The sight of his distress made me laugh.”\n\nIbn Majah transmitted it, and Baihaqi transmitted something similar in Kitab al-ba‘th wan-nushur."}},{"id":96,"idInBook":96,"chapterId":10,"bookId":14,"arabic":"عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ قَالَ: سُئِلَ أُسَامَةُ بْنُ زَيْدٍ: كَيْفَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسِيرُ فِي حَجَّةِ الْوَدَاعِ حِينَ دَفَعَ؟ قَالَ: كَانَ يَسِيرُ الْعُنُق فَإِذا وجد فجوة نَص","english":{"narrator":"","text":"Hisham b. ‘Urwa. quoted his father as saying that Usama b. Zaid was asked how God's messenger was travelling when he returned at the Farewell Pilgrimage, and replied that he was travelling at a quick pace and when he found an opening he urged on his camel.\n\nBukhari and Muslim."}},{"id":97,"idInBook":97,"chapterId":10,"bookId":14,"arabic":"وَعَن ابنِ عبَّاسٍ أَنَّهُ دَفَعَ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ عَرَفَةَ فَسَمِعَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرَاءَهُ زَجْرًا شَدِيدًا وَضَرْبًا لِلْإِبِلِ فَأَشَارَ بِسَوْطِهِ إِلَيْهِمْ وَقَالَ: «يَا أَيُّهَا النَّاسُ عَلَيْكُمْ بِالسَّكِينَةِ فَإِنَّ الْبِرَّ لَيْسَ بِالْإِيضَاعِ» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Ibn ‘Abbas said that he returned with the Prophet on the day of ‘Arafa, and when the Prophet heard the people behind him shouting loudly at their camels and beating them, he pointed his whip at them and said, “You people must preserve a quiet demeanour, for piety does not consist in going quickly.”\n\nBukhari transmitted it."}},{"id":98,"idInBook":98,"chapterId":10,"bookId":14,"arabic":"وَعَنْهُ أَنَّ أُسَامَةَ بْنَ زِيدٍ كَانَ رِدْفَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ عَرَفَةَ إِلَى الْمُزْدَلِفَةِ ثُمَّ أَرْدَفَ الْفَضْلَ مِنَ الْمُزْدَلِفَةِ إِلَى مِنًى فَكِلَاهُمَا قَالَ: لَمْ يَزَلِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُلَبِّي حَتَّى رَمَى جَمْرَة الْعقبَة","english":{"narrator":"","text":"Usama b. Zaid rode behind the Prophet on his camel from ‘Arafa to al-Muzdalifa, then he took al-Fadl up behind him from al-Muzdalifa to Mina, and both of them said that the Prophet kept raising his voice in the talbiya till he threw pebbles at the jamra of the ‘Aqaba.\n\nBukhari and Muslim."}},{"id":99,"idInBook":99,"chapterId":10,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: جَمَعَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَغْرِبَ وَالْعِشَاءَ بِجَمْعٍ كُلَّ وَاحِدَةٍ مِنْهُمَا بِإِقَامَةٍ وَلَمْ يُسَبِّحْ بَيْنَهُمَا وَلَا عَلَى إِثْرِ كُلِّ وَاحِدَةٍ مِنْهُمَا. رَوَاهُ الْبُخَارِيُّ","english":{"narrator":"","text":"Ibn ‘Umar said that the Prophet combined the sunset and the evening prayer, each with an iqama, but did not say ‘Glory be to God’ between them, or at the end of each one of them.\n\nBukhari transmitted it."}},{"id":100,"idInBook":100,"chapterId":10,"bookId":14,"arabic":"وَعَنْ عَبْدُ اللَّهِ بْنِ مَسْعُودٍ قَالَ: مَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى صَلَاةً إِلَّا لِمِيقَاتِهَا إِلَّا صَلَاتَيْنِ: صَلَاةَ الْمَغْرِبِ وَالْعِشَاءِ بِجَمْعٍ وَصَلَّى الْفَجْرَ يومئِذٍ قبلَ ميقاتها","english":{"narrator":"","text":"‘Abdallah b. Mas'ud said he never saw God’s messenger observe a prayer out of its proper time with the exception of two, the sunset and the evening prayer, which he combined, and the dawn prayer which he observed that day(i.e. al-Muzdalifa) before its proper time.\n\nBukhari and Muslim."}},{"id":101,"idInBook":101,"chapterId":10,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: أَنَا مِمَّنْ قَدَّمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْلَة الْمزْدَلِفَة فِي ضعفة أَهله","english":{"narrator":"","text":"Ibn ‘Abbas said, “I was among the weak members of his family (i.e. the women and children) whom the Prophet sent ahead on the night of al-Muzdalifa.\n\nBukhari and Muslim."}},{"id":102,"idInBook":102,"chapterId":10,"bookId":14,"arabic":"وَعَن الفضلِ بن عبَّاسٍ وَكَانَ رَدِيفَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ فِي عَشِيَّةِ عَرَفَةَ وَغَدَاةِ جَمْعٍ لِلنَّاسِ حِينَ دَفَعُوا: «عَلَيْكُمْ بِالسَّكِينَةِ» وَهُوَ كَافٌّ نَاقَتَهُ حَتَّى دَخَلَ مُحَسِّرًا وَهُوَ مِنْ مِنًى قَالَ: «عَلَيْكُمْ بِحَصَى الْخَذْفِ الَّذِي يُرْمَى بِهِ الْجَمْرَةَ» . وَقَالَ: لَمْ يَزَلْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُلَبِّي حَتَّى رَمَى الْجَمْرَةَ. رَوَاهُ مُسلم","english":{"narrator":"","text":"Al-Fadl b. ‘Abbas who rode behind God’s messenger told that on the evening of ‘Arafa and the morning of Jam' (Here the name is clearly used for al-Muzdalifa) when the people returned, he said to them, “Preserve a quiet demeanour.” He held back his shecamel till he entered Muhassir which is a part of Mina, and said, “Get small pebbles for the lapidation of the jamra” He said that God’s messenger kept on raising his voice in the talbiya till he threw pebbles at the jamra.\n\nMuslim transmitted it."}},{"id":103,"idInBook":103,"chapterId":10,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: أَفَاضَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ جَمْعٍ وَعَلَيْهِ السَّكِينَةُ وَأَمَرَهُمْ بِالسَّكِينَةِ وَأَوْضَعَ فِي وَادِي مُحَسِّرٍ وَأَمَرَهُمْ أَنْ يَرْمُوا بِمِثْلِ حَصَى الْخَذْفِ وَقَالَ: «لَعَلِّي لَا أَرَاكُمْ بَعْدَ عَامِي هَذَا» . لَمْ أَجِدْ هَذَا الْحَدِيثَ فِي الصَّحِيحَيْنِ إِلَّا فِي جَامِعِ التِّرْمِذِيِّ مَعَ تقديمٍ وَتَأْخِير","english":{"narrator":"","text":"Jabir said that the Prophet hastened from Jam' with a quiet demeanour and ordered the people to preserve a similar demeanour. He hastened in the wadi of Muhassir and ordered them to throw small pebbles, and he said, “Perhaps I shall not see you after this year.”\n\nI did not find this tradition in the two Sahihs, but in Tirmidhi's Jami’, with some transposition."}},{"id":104,"idInBook":104,"chapterId":10,"bookId":14,"arabic":"وَعَن محمّدِ بنِ قيسِ بن مَخْرمةَ قَالَ: خَطَبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «إِنَّ أَهْلَ الْجَاهِلِيَّةِ كَانُوا يَدْفَعُونَ مِنْ عَرَفَةَ حِينَ تَكُونُ الشَّمْسُ كَأَنَّهَا عَمَائِمُ الرِّجَالِ فِي وُجُوهِهِمْ قَبْلَ أَنْ تَغْرُبَ وَمِنَ الْمُزْدَلِفَةِ بَعْدَ أَنْ تَطْلُعَ الشَّمْسُ حِينَ تَكُونُ كَأَنَّهَا عَمَائِمُ الرِّجَالِ فِي وُجُوهِهِمْ. وَإِنَّا لَا نَدْفَعُ مِنْ عَرَفَةَ حَتَّى تَغْرُبَ الشَّمْسُ وَنَدْفَعُ مِنَ الْمُزْدَلِفَةِ قَبْلَ أَنْ تَطْلُعَ الشَّمْسُ هَدْيُنَا مُخَالِفٌ لِهَدْيِ عَبَدَةِ الْأَوْثَانِ وَالشِّرْكِ» . رَوَاهُ الْبَيْهَقِيُّ فِي شعب الْإِيمَان وَقَالَ فِيهِ: خَطَبنَا وَسَاقه بِنَحْوِهِ","english":{"narrator":"","text":"Muhammad b. Qais b. Makhrama said that God’s messenger addressed the people as follows, “The people of pre-Islamic times used to return from 'Arafa when the sun before setting was shining in their faces like men’s turbans, and from al-Muzdalifa after the sun rose when it was shining in their faces like men’s turbans; (When the sun is low it shines only on men’s foreheads, and this is here likened to a turban) but we do not return from ‘Arafa till the sun sets, and we return from al-Muzdalifa before the sun rises. Our guidance differs from that of the worshippers of idols and those who attribute partners to God.”\n\nBaihaqi transmitted it in Shu'ab al-iman, saying “He addressed us . . .” and then going on, with the tradition to similar effect."}},{"id":105,"idInBook":105,"chapterId":10,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَدَّمَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْلَةً الْمُزْدَلِفَةِ أُغَيْلِمَةَ بَنِي عَبْدِ الْمُطَّلِبِ عَلَى حُمُرَاتٍ فَجَعَلَ يَلْطَحُ أَفْخَاذَنَا وَيَقُولُ: «أُبَيْنِيَّ لَا تَرْمُوا الْجَمْرَةَ حَتَّى تَطْلُعَ الشَّمْسُ» . رَوَاهُ أَبُو دَاوُدَ وَالنَّسَائِيُّ وَابْنُ مَاجَه","english":{"narrator":"Ibn ‘ Abbas said:","text":"God’s messenger sent us small boys of the B. ‘Abd al-Muttalib ahead on asses on the night of al-Muzdalifa, and he began to pat our thighs and say, “My little children, do not throw pebbles at the jamra till the sun rises.”\n\nAbu Dawud, Nasa’i and Ibn Majah transmitted it."}},{"id":106,"idInBook":106,"chapterId":10,"bookId":14,"arabic":"وَعَن عَائِشَة قَالَتْ: أَرْسَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بأُمِّ سَلَمَةَ ليلةَ النَّحْر فرمت الجمرةَ قبلَ الْفَجْرِ ثُمَّ مَضَتْ فَأَفَاضَتْ وَكَانَ ذَلِكَ الْيَوْمُ الْيَوْمَ الَّذِي يَكُونَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عِنْدهَا. رَوَاهُ أَبُو دَاوُدَ","english":{"narrator":"‘A’isha said :","text":"God's messenger sent Umm Salama on the night before the day of sacrifice and she threw pebbles at the jamra before dawn. She then hastened [to Mecca) and performed the circuit. That day was the one God’s messenger spent with her.\n\nAbu Dawud transmitted it."}},{"id":107,"idInBook":107,"chapterId":10,"bookId":14,"arabic":"وَعَن ابنِ عبَّاسٍ، قَالَ: يُلَبِّي المقيمُ أَوِ المعتَمِرُ حَتَّى يستلمَ الْحَجَرَ) . رَوَاهُ أَبُو دَاوُدَ وَقَالَ: وَرُوِيَ مَوْقُوفًا على ابنِ عبَّاس.","english":{"narrator":"Ibn ‘Abbas said :","text":"Those who stay in Mecca and those who perform the ’umra  raise their voices in the talbiya till they touch the stone.\n\nAbu Dawud transmitted it, saying it has been transmitted going no farther back than Ibn ‘Abbas."}},{"id":108,"idInBook":108,"chapterId":10,"bookId":14,"arabic":"عَنْ يَعْقُوبَ بْنِ عَاصِمِ بْنِ عُرْوَةَ أَنَّهُ سمع الشَّريدَ يَقُولُ: أَفَضْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَا مَسَّتْ قَدَمَاهُ الْأَرْضَ حَتَّى أَتَى جمْعاً. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"Ya'qub b. ‘Asim b. ‘Urwa said he heard ash-Sharid say :","text":"I hastened with God’s messenger and his feet did not touch the ground till he came to Jam'.\n\nAbu Dawud transmitted it."}},{"id":109,"idInBook":109,"chapterId":10,"bookId":14,"arabic":"وَعَن ابنِ شهابٍ قَالَ: أَخْبَرَنِي سَالِمٌ أَنَّ الْحَجَّاجَ بْنَ يُوسُفَ عَامَ نَزَلَ بِابْنِ الزُّبَيْرِ سَأَلَ عَبْدَ اللَّهِ: كَيْفَ نَصْنَعُ فِي الْمَوْقِفِ يَوْمَ عَرَفَةَ؟ فَقَالَ سَالِمٌ إِنْ كُنْتَ تُرِيدُ السُّنَّةَ فَهَجِّرْ بِالصَّلَاةِ يَوْمَ عَرَفَةَ فَقَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ: صَدَقَ إِنَّهُمْ كَانُوا يَجْمَعُونَ بَيْنَ الظُّهْرِ وَالْعَصْرِ فِي السُّنَّةِ فَقُلْتُ لِسَالِمٍ: أَفَعَلَ ذَلِكَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ؟ فَقَالَ سَالِمٌ: وَهل يتَّبعونَ فِي ذلكَ إِلا سنَّتَه؟ رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Ibn Shihab said Salim told him that in the year al-Hajjaj b. Yusuf attacked Ibn az-Zubair (Abdallah b. az-Zubair who was in Mecca had laid claims to the Caliphate. ‘Abd al-Malik, the Umayvad Caliph, sent an army under al-Hajjaj b. Yusuf towards the end of 72, A.H. to deal with Ibn az-Zubair, and although there had been fighting in the plain of ‘Arafat, hostilities ceased in order that the Pilgrimage might be observed, and were later resumed.) he asked ‘Abdallah (This is ‘Abdallah b. ‘Umar who is said to have been the one who was the means of having the hostilities stopped during the season of pilgrimage) how they were to act at the standing at ‘Arafa. Salim said, “If you wish to keep to the sunna, observe the prayer in the noonday heat on the day of ‘Arafa.” ‘Abdallah b. ‘Umar then said, “He has spoken the truth ; they were accustomed to combine the noon and the afternoon prayer in accordance with the sunna.” Ibn Shihab asked Salim whether God's messenger did that, and Salim replied, “In doing that do they follow anything but his sunna?”\n\nBukhari transmitted it."}},{"id":110,"idInBook":110,"chapterId":10,"bookId":14,"arabic":"عَن جَابر قَالَ: رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَرْمِي عَلَى رَاحِلَتِهِ يَوْمَ النَّحْرِ وَيَقُولُ: «لِتَأْخُذُوا مَنَاسِكَكُمْ فَإِنِّي لَا أَدْرِي لَعَلِّي لَا أَحُجُّ بعد حجتي هَذِه» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Jabir said he saw the Prophet throwing pebbles on the day of sacrifice while on his riding-beast and saying, “Learn your rites, for I do not know whether I am likely to perform the pilgrimage after this occasion.”\n\nMuslim transmitted it."}},{"id":111,"idInBook":111,"chapterId":10,"bookId":14,"arabic":"وَعَنْهُ قَالَ: رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَمَى الْجَمْرَةَ بِمِثْلِ حَصَى الْخَذْفِ. رَوَاهُ مُسلم","english":{"narrator":"","text":"He said that he saw God’s messenger throwing small pebbles at the jamra.\n\nMuslim transmitted it."}},{"id":112,"idInBook":112,"chapterId":10,"bookId":14,"arabic":"وَعَنْهُ قَالَ: رَمَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْجَمْرَةَ يَوْمَ النَّحْرِ ضُحًى وَأَمَّا بَعْدَ ذَلِكَ فَإِذَا زَالَتِ الشَّمْسُ","english":{"narrator":"","text":"He said that God's messenger threw pebbles at the jamra on the day of sacrifice in the forenoon, and next when the sun had passed the meridian.\n\nBukhari and Muslim."}},{"id":113,"idInBook":113,"chapterId":10,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ: أَنَّهُ انْتَهَى إِلَى الْجَمْرَةِ الْكُبْرَى فَجَعَلَ الْبَيْتَ عَنْ يَسَارِهِ وَمِنًى عَنْ يَمِينِهِ وَرَمَى بِسَبْعِ حَصَيَاتٍ يُكَبِّرُ مَعَ كُلِّ حَصَاةٍ ثُمَّ قَالَ: هَكَذَا رَمَى الَّذِي أُنْزِلَتْ عَلَيْهِ سُورَةُ الْبَقَرَةِ","english":{"narrator":"","text":"‘Abdallah b. Mas'ud came to the largest jamra and with the House on his left and Mina on his right he threw seven pebbles saying “God is most great” each time. Then he said, “Thus did he to whom sura al-Baqara was sent down throw.”\n\nBukhari and Muslim."}},{"id":114,"idInBook":114,"chapterId":10,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الِاسْتِجْمَارُ تَوٌّ وَرَمْيُ الْجِمَارِ توٌّ وَالسَّعْيُ بَيْنَ الصَّفَا وَالْمَرْوَةِ تَوٌّ وَالطَّوَافُ تَوٌّ وَإِذَا اسْتَجْمَرَ أَحَدُكُمْ فَلْيَسْتَجْمِرْ بِتَوٍّ» . رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"Jabir reported God’s messenger as saying, “Cleaning oneself with stones (Isijmar is the word used, and Taj al-Arus suggests that here its meaning is throwing pebbles ; but as ramy al-jimar occurs in the next phrase, it seems better to translate it as above to avoid saying the same things twice. Cf. p. 74, lines 9 f.) is with an odd number, throwing pebbles at the jamras is with an odd number, running between as-Safa and al-Marwa is with an odd number, and the circumambulation is with an odd number. When one of you cleans himself with stones he should do so with an odd number.”\n\nMuslim transmitted it."}},{"id":115,"idInBook":115,"chapterId":10,"bookId":14,"arabic":"عَنْ قُدَامَةَ بْنِ عَبْدِ اللَّهِ بْنِ عَمَّارٍ قَالَ: رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَرْمِي الْجَمْرَةَ يَوْمَ النَّحْرِ عَلَى نَاقَةٍ صَهْبَاءَ لَيْسَ ضَرْبٌ وَلَا طَرْدٌ وَلَيْسَ قِيلُ: إِلَيْكَ إِليك. رَوَاهُ الشَّافِعِيُّ وَالتِّرْمِذِيُّ وَالنَّسَائِيُّ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ","english":{"narrator":"","text":"Qudama b. ‘Abdallah b. ‘Ammar said he saw the Prophet throwing pebbles at the jamra on the day of sacrifice while on a reddish she-camel, and there was no striking, or driving, or telling people to get out of the way.\n\nShafi'i, Tirmidhi, Nasa'i, Ibn Majah and Darimi transmitted it."}},{"id":116,"idInBook":116,"chapterId":10,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّمَا جُعِلَ رَمْيُ الْجِمَارِ وَالسَّعْيُ بَيْنَ الصَّفَا وَالْمَرْوَةِ لِإِقَامَةِ ذِكْرِ اللَّهِ» . رَوَاهُ التِّرْمِذِيُّ وَالدَّارِمِيُّ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ","english":{"narrator":"","text":"'A’isha reported the Prophet as saying, \"Throwing pebbles at the jamras and running between as-Safa and al-Marwa were appointed only for the remembrance of God.”\n\nTirmidhi and Darimi transmitted it, Tirmidhi saying this is a hasan sahih tradition."}},{"id":117,"idInBook":117,"chapterId":10,"bookId":14,"arabic":"وَعَنْهَا قَالَتْ: قُلْنَا: يَا رَسُولَ اللَّهِ ألَا نَبْنِي لَكَ بِنَاءً يُظِلُّكَ بِمِنًى؟ قَالَ: «لَا مِنًى مُنَاخُ مَنْ سَبَقَ» . رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَه والدارمي","english":{"narrator":"","text":"She said they asked God’s messenger whether they should not put up a building for him to shade him in Mina, but he replied, \"No; Mina is a resting-place for the camels of those who get there first.”\n\nTirmidhi, Ibn Majah and Darimi transmitted it."}},{"id":118,"idInBook":118,"chapterId":10,"bookId":14,"arabic":"عَنْ نَافِعٍ قَالَ: إِنَّ ابْنَ عُمَرَ كَانَ يَقِفُ عِنْدَ الْجَمْرَتَيْنِ الْأُولَيَيْنِ وُقُوفًا طَوِيلًا يُكَبِّرُ اللَّهَ وَيُسَبِّحُهُ وَيَحْمَدُهُ وَيَدْعُو اللَّهَ وَلَا يَقِفُ عنْدَ جمرَةِ العقبةِ. رَوَاهُ مَالك","english":{"narrator":"","text":"Nafi' said that Ibn ‘Umar used to stand for a long time at the first two jamras, saying \"God is most great; glory be to God ; praise be to God ;” and making supplication to Him, but did not stand at the jamra of the ‘Aqaba.\n\nMalik transmitted it."}},{"id":119,"idInBook":119,"chapterId":10,"bookId":14,"arabic":"عَن ابْنِ عَبَّاسٍ قَالَ: صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِذِي الْحُلَيْفَةِ ثُمَّ دَعَا بِنَاقَتِهِ فَأَشْعَرَهَا فِي صَفْحَةِ سَنَامِهَا الْأَيْمَنِ وَسَلَّتَ الدَّمَ عَنْهَا وَقَلَّدَهَا نَعْلَيْنِ ثُمَّ رَكِبَ رَاحِلَتَهُ فَلَمَّا اسْتَوَتْ بِهِ على الْبَيْدَاء أهل بِالْحَجِّ. رَوَاهُ مُسلم","english":{"narrator":"","text":"Ibn ‘Abbas said that after God’s messenger had prayed the noon prayer at Dhul Hulaifa he called for his she-camel, marked it on the right side of its hump, removed the blood from it, and tied two sandals on its neck. He then mounted his riding-beast, and when it brought him up to al-Baida’ he raised his voice in the talbiya for the pilgrimage.\n\nMuslim transmitted it."}},{"id":120,"idInBook":120,"chapterId":10,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: أَهْدَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مرّة إِلَى الْبَيْت غنما فقلدها","english":{"narrator":"","text":"‘A’isha said that the Prophet once brought sheep (The word is ghanam which can mean either sheep or goats) for sacrifice to the House and garlanded them. \n\nBukhari and Muslim."}},{"id":121,"idInBook":121,"chapterId":10,"bookId":14,"arabic":"وَعَن جَابر قَالَ: ذَبَحَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ عَائِشَةَ بَقَرَةً يَوْمَ النَّحْرِ. رَوَاهُ مُسلم","english":{"narrator":"","text":"Jabir said that God’s messenger slaughtered a cow for ‘A’isha on the day of sacrifice. \n\nMuslim transmitted it."}},{"id":122,"idInBook":122,"chapterId":10,"bookId":14,"arabic":"وَعنهُ قَالَ: نَحَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ نِسَائِهِ بَقَرَةً فِي حَجَّتِهِ. رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"He said that the Prophet sacrificed a cow for his wives at his pilgrimage. \n\nMuslim transmitted it."}},{"id":123,"idInBook":123,"chapterId":10,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: فَتَلْتُ قَلَائِدَ بُدْنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِيَدَيَّ ثُمَّ قَلَّدَهَا وَأَشْعَرَهَا وَأَهْدَاهَا فَمَا حَرُم عَلَيْهِ كانَ أُحِلَّ لَهُ","english":{"narrator":"'A’isha said :","text":"I twisted the garlands of the Prophet’s sacrificial camels with my own hands, after which he garlanded them, marked them, and sent them as offerings, and nothing which had been lawful for him became forbidden. (When one is not performing the pilgrimage he is not subject to the restrictions applicable to pilgrims up to the day of sacrifice.)\n\nBukhari and Muslim."}},{"id":124,"idInBook":124,"chapterId":10,"bookId":14,"arabic":"وَعَنْهَا قَالَتْ: فَتَلْتُ قَلَائِدَهَا مِنْ عِهْنٍ كَانَ عِنْدِي ثُمَّ بَعَثَ بِهَا مَعَ أَبِي","english":{"narrator":"She said :","text":"I twisted their garlands from carded wool which I had, then he sent them with my father. \n\nBukhari and Muslim."}},{"id":125,"idInBook":125,"chapterId":10,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى رَجُلًا يَسُوقُ بَدَنَةً فَقَالَ: «ارْكَبْهَا» . فَقَالَ: إِنَّهَا بَدَنَةٌ. قَالَ: «ارْكَبْهَا» . فَقَالَ: إِنَّهَا بَدَنَةٌ. قَالَ: «ارْكَبْهَا وَيلك» فِي الثَّانِيَة أَو الثَّالِثَة","english":{"narrator":"","text":"Abu Huraira said that God’s messenger saw a man driving a sacrificial camel and told him to ride on it, to which he replied that it was a sacrifical camel. He told him again to ride on it and received the same reply, so he said, “Ride on it, bother you,” (Literally, 'woe to you’) either the second or third time he spoke. \n\nBukhari and Muslim."}},{"id":126,"idInBook":126,"chapterId":10,"bookId":14,"arabic":"وَعَنْ أَبِي الزُّبَيْرِ قَالَ: سَمِعْتُ جَابِرَ بْنَ عبدِ اللَّه سُئِلَ عَنْ رُكُوبِ الْهَدْيِ فَقَالَ: سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «ارْكَبْهَا بِالْمَعْرُوفِ إِذَا أُلْجِئْتَ إِلَيْهَا حَتَّى تَجِدَ ظَهْرًا» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abuz Zubair said he heard Jabir b. ‘Abdallah being asked about riding sacrificial animals, to which he replied that he had heard the Prophet say, “Ride on them gently when you have nothing else, till you find a mount.” \n\nMuslim transmitted it."}},{"id":127,"idInBook":127,"chapterId":10,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: بَعَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سِتَّةٌ عَشَرَ بَدَنَةً مَعَ رَجُلٍ وَأَمَّرَهُ فِيهَا. فَقَالَ: يَا رَسُولَ اللَّهِ كَيْفَ أَصْنَعُ بِمَا أُبْدِعَ عَلَيَّ مِنْهَا؟ قَالَ: «انْحَرْهَا ثُمَّ اصْبُغْ نَعْلَيْهَا فِي دَمِهَا ثُمَّ اجْعَلْهَا عَلَى صَفْحَتِهَا وَلَا تَأْكُلْ مِنْهَا أَنْتَ وَلَا أَحَدٌ مِنْ أهل رفقتك» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Ibn ‘Abbas said that God’s messenger sent sixteen sacrificial camels with a man whom he put in charge of them. He asked God’s messenger what he should do with those of them which became fatigued and he replied, “Slaughter them, then dye their shoes in their blood, and put them on the sides of their humps ; but neither you nor any who are with you must eat any part of them.” \n\nMuslim transmitted it."}},{"id":128,"idInBook":128,"chapterId":10,"bookId":14,"arabic":"وَعَن جابرٍ قَالَ: نحَرْنا مَعَ رَسولِ اللَّهِ عَامَ الْحُدَيْبِيَةِ الْبَدَنَةَ عَنْ سَبْعَةٍ وَالْبَقَرَةَ عَنْ سَبْعَة. رَوَاهُ مُسلم","english":{"narrator":"Jabir said :","text":"In the year of al-Hudaibiya(6 A.H.) we, along with God's messenger, sacrificed a camel for seven people and a cow for seven people. \n\nMuslim transmitted it."}},{"id":129,"idInBook":129,"chapterId":10,"bookId":14,"arabic":"وَعَن ابنِ عمَرَ: أَنَّهُ أَتَى عَلَى رَجُلٍ قَدْ أَنَاخَ بِدَنَتَهُ يَنْحَرُهَا قَالَ: ابْعَثْهَا قِيَامًا مُقَيَّدَةً سُنَّةَ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ","english":{"narrator":"","text":"Ibn ‘Umar came upon a man who had made his camel kneel and was sacrificing it, so he told him to make it stand up fettered according to the sunna of Muhammad. \n\nBukhari and Muslim."}},{"id":130,"idInBook":130,"chapterId":10,"bookId":14,"arabic":"وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ: أَمَرَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ أَقُومَ عَلَى بُدْنِهِ وَأَنْ أَتَصَدَّقَ بِلَحْمِهَا وَجُلُودِهَا وَأَجِلَّتِهَا وَأَنْ لَا أُعْطِيَ الْجَزَّارَ مِنْهَا قَالَ: «نَحْنُ نُعْطِيهِ مِنْ عِنْدِنَا»","english":{"narrator":"","text":"‘Ali said that God’s messenger put him in charge of his sacrificial I camels, telling him to give their flesh, skins and saddle-cloths as sadaqa,but not to give anything to the butcher, saying he would pay him himself.\n\nBukhari and Muslim."}},{"id":131,"idInBook":131,"chapterId":10,"bookId":14,"arabic":"وَعَن جابرٍ قَالَ: كُنَّا لَا نَأْكُلُ مِنْ لُحُومِ بُدْنِنَا فَوْقَ ثَلَاثٍ فَرَخَّصَ لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «كُلُوا وَتَزَوَّدُوا» . فَأَكَلْنَا وتزودنا","english":{"narrator":"","text":"Jabir said they were not accustomed to eat the flesh of their sacrificial camels for more than three days, but God’s messenger gave them licence saying, “Eat and preserve the meat,” so they did so. \n\nBukhari and Muslim."}},{"id":132,"idInBook":132,"chapterId":10,"bookId":14,"arabic":"عَنِ ابْنِ عَبَّاسٍ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَهْدَى عَامَ الْحُدَيْبِيَةِ فِي هَدَايَا رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَمَلًا كَانَ لِأَبِي جَهْلٍ فِي رَأْسِهِ بُرَةٌ مِنْ فِضَّةٍ وَفِي رِوَايَةٍ مِنْ ذَهَبٍ يَغِيظُ بِذَلِكَ الْمُشْركين. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Ibn ‘Abbas said that in the year of al-Hudaibiya the Prophet included among his sacrificial animals a camel with a silver (a version has gold) nose-ring which had belonged to Abu Jahl,( A chief of Quraish who had been hostile to the Prophet. He was killed at Badr) thereby enraging the polytheists. \n\nAbu Dawud transmitted it."}},{"id":133,"idInBook":133,"chapterId":10,"bookId":14,"arabic":"وَعَنْ نَاجِيَةَ الْخُزَاعِيِّ قَالَ: قُلْتُ: يَا رَسُولَ اللَّهِ كَيْفَ أَصْنَعُ بِمَا عَطِبَ مِنَ الْبُدْنِ؟ قَالَ: «انْحَرْهَا ثُمَّ اغْمِسْ نَعْلَهَا فِي دَمِهَا ثُمَّ خَلِّ بَيْنَ النَّاسِ وَبَيْنَهَا فَيَأْكُلُونَهَا» . رَوَاهُ مَالك وَالتِّرْمِذِيّ وَابْن مَاجَه\nوَرَوَاهُ أَبُو دَاوُد والدارمي عَن نَاجِية الْأَسْلَمِيّ","english":{"narrator":"","text":"Najiya al-Khuza‘i said he asked God's messenger what he should do with sacrificial camels which became fatigued, and he told him to slaughter them, dip their shoes in their blood, and leave them for the people to eat. \n\nMalik, Tirmidhi and Ibn Majah transmitted it, but Abu Dawud and Darimi transmitted it from Najiya al-Aslami."}},{"id":134,"idInBook":134,"chapterId":10,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ قُرْطٍ رَضِيَ اللَّهُ عَنْهُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ أَعْظَمَ الْأَيَّامِ عِنْدَ اللَّهِ يَوْمُ النَّحْرِ ثُمَّ يَوْمُ الْقَرِّ» . قَالَ ثَوْرٌ: وَهُوَ الْيَوْمُ الثَّانِي. قَالَ: وَقُرِّبَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَدَنَاتٌ خَمْسٌ أَوْ سِتٌّ فطفِقْن يَزْدَلفْنَ إِليهِ بأيتهِنَّ يبدأُ قَالَ: فَلَمَّا وَجَبَتْ جُنُوبُهَا. قَالَ فَتَكَلَّمَ بِكَلِمَةٍ خَفِيَّةٍ لَمْ أَفْهَمْهَا فَقُلْتُ: مَا قَالَ؟ قَالَ: «مَنْ شَاءَ اقْتَطَعَ» . رَوَاهُ أَبُو دَاوُدَ","english":{"narrator":"","text":"'Abdallah b. Qurt reported the Prophet as saying that the greatest day in God’s sight is the day of sacrifice and next the day of resting,( Yaum al-qarr, the 11th ol Dhul Hijja) which Thaur(He is one of those who occur in the isnad) said was the second day. Five or six sacrificial camels were brought to God’s messenger and they (i.e. the camels. The suggestion is that each coveted the blessing of being sacrificed first. 'This is said to be one of the Prophet's miracles. Cf. Mirqat, iii, 237) began to draw near to see which he would sacrifice first. When they fell down  he said something in a low voice which ‘Abdallah did not catch, so he asked what he had said and was told he had said that anyone who wished could cut off a piece. \n\nAbu Dawud transmitted it."}},{"id":135,"idInBook":135,"chapterId":10,"bookId":14,"arabic":"عَنْ سَلَمَةَ بْنِ الْأَكْوَعِ قَالَ: قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ «مَنْ ضَحَّى مِنْكُمْ فَلَا يُصْبِحَنَّ بَعْدَ ثَالِثَةٍ وَفِي بَيْتِهِ مِنْهُ شَيْءٌ» . فَلَمَّا كَانَ الْعَامُ الْمُقْبِلُ قَالُوا: يَا رَسُولَ اللَّهِ نَفْعَلُ كَمَا فَعَلْنَا الْعَامَ الْمَاضِي؟ قَالَ: «كُلُوا وَأَطْعِمُوا وَادَّخِرُوا فَإِنَّ ذَلِكَ الْعَامَ كَانَ بِالنَّاسِ جَهْدٌ فَأَرَدْتُ أَنْ تُعِينُوا فِيهِمْ»","english":{"narrator":"","text":"Salama b. al-Akwa‘ reported the Prophet as saying, “Those of you who make a sacrifice must not have any of it in their house after three days.\" The following year the people asked him whether they should do as they had done the previous year, and he said, “Eat, provide food for others, and store some up, for that year there was distress among the people and I wanted you to help them.\" \n\nBukhari and Muslim."}},{"id":136,"idInBook":136,"chapterId":10,"bookId":14,"arabic":"وَعَنْ نُبَيْشَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عَلَيْهِ وَسلم: «إِن كُنَّا نهينَا عَنْ لُحُومِهَا أَنْ تَأْكُلُوهَا فَوْقَ ثَلَاثٍ لِكَيْ تسَعْكم. جاءَ اللَّهُ بالسَّعَةِ فكُلوا وادَّخِرُوا وأْتَجِروا. أَلَا وَإِنَّ هَذِهِ الْأَيَّامَ أَيَّامُ أَكْلٍ وَشُرْبٍ وذِكْرِ اللَّهِ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Nubaisha reported God’s messenger as saying, “I forbade you to eat their meat for more than three days in order that you might have abundance  ; but God has produced abundance, so you may eat, store up and seek reward. These days are days of eating, drinking and remembrance of God.\" \n\nAbu Dawud transmitted it."}},{"id":137,"idInBook":137,"chapterId":10,"bookId":14,"arabic":"عَنِ ابْنِ عُمَرَ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَلَقَ رَأْسَهُ فِي حَجَّةِ الْوَدَاعِ وَأُنَاسٌ مِنْ أَصْحَابِهِ وَقَصَّرَ بَعْضُهُمْ","english":{"narrator":"","text":"Ibn ‘Umar said that God’s messenger had his head shaved at the Farewell Pilgrimage, as did some of his companions, but some had their hair clipped. \n\nBukhari and Muslim."}},{"id":138,"idInBook":138,"chapterId":10,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ لِي مُعَاوِيَةُ: إِنِّي قَصَّرْتُ مِنْ رَأْسِ النَّبِيِّ صلى الله عَلَيْهِ وَسلم عِنْد الْمَرْوَة بمشقص","english":{"narrator":"","text":"Ibn ‘Abbas said that Mu'awiya told him he had clipped some hair from the Prophet’s head at al-Marwa with a broad, iron arrowhead. \n\nBukhari and Muslim."}},{"id":139,"idInBook":139,"chapterId":10,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي حَجَّةِ الْوَدَاعِ: «اللَّهُمَّ ارْحَمِ الْمُحَلِّقِينَ» . قَالُوا: وَالْمُقَصِّرِينَ يَا رَسُولَ اللَّهِ؟ قَالَ: «اللَّهُمَّ ارْحَمِ الْمُحَلِّقِينَ» . قَالُوا: وَالْمُقَصِّرِينَ يَا رَسُولَ اللَّهِ؟ قَالَ: «وَالْمُقَصِّرِينَ»","english":{"narrator":"","text":"Ibn ‘Umar told that at the Farewell Pilgrimage God's messenger said, “O God, have mercy on those who have themselves shaved.” The people suggested that he should add those who had clipped their hair. He again said the same words, and when they made the same suggestion, he added “and those who clip their hair.” \n\nBukhari and Muslim."}},{"id":140,"idInBook":140,"chapterId":10,"bookId":14,"arabic":"وَعَن يحيى بن الْحصين عَن جدته أَنَّهَا سَمِعَتِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَجَّةِ الْوَدَاعِ دَعَا لِلْمُحَلِّقِينَ ثَلَاثًا وَلِلْمُقَصِّرِينَ مرّة وَاحِدَة. رَوَاهُ مُسلم","english":{"narrator":"","text":"Yahya b. al-Husain quoted his grandmother as saying she heard the Prophet at the Farewell Pilgrimage make supplication three.times for those who had their heads shaved and once for those who clipped their hair. \n\nMuslim trahsmitted it."}},{"id":141,"idInBook":141,"chapterId":10,"bookId":14,"arabic":"وَعَنْ أَنَسٍ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَى مِنًى فَأَتَى الْجَمْرَةَ فَرَمَاهَا ثُمَّ أَتَى مَنْزِلَهُ بِمِنًى وَنَحَرَ نُسُكَهُ ثُمَّ دَعَا بِالْحَلَّاقِ وَنَاوَلَ الْحَالِقَ شِقَّهُ الْأَيْمَنَ ثُمَّ دَعَا أَبَا طَلْحَةَ الْأَنْصَارِيَّ فَأَعْطَاهُ إِيَّاهُ ثُمَّ نَاوَلَ الشِّقَّ الْأَيْسَرَ فَقَالَ «احْلِقْ» فَحَلَقَهُ فَأعْطَاهُ طَلْحَةَ فَقَالَ: «اقْسِمْهُ بَيْنَ النَّاسِ»","english":{"narrator":"","text":"Anas said that when the Prophet came to Mina he went to the jamra and threw pebbles at it, after which he went to his lodging in Mina and sacrificed his victim. He then called for a barber, and turning his right side to him, he let him shave him. He then called Abu Talha al-Ansari and gave him what had been shaved off; after which he turned his left side telling the barber to shave him, and when he had done so he gave Abu Talha what had been shaved off and told him to divide it among the people. \n\nBukhari and Muslim."}},{"id":142,"idInBook":142,"chapterId":10,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: كُنْتُ أُطَيِّبُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قِبَلَ أَنْ يُحْرِمَ وَيَوْمَ النَّحْرِ قَبْلَ أَنْ يَطُوفَ بِالْبَيْتِ بِطِيبٍ فِيهِ مِسْكٌ","english":{"narrator":"","text":"‘A’isha said she was applying to God’s messenger a perfume containing musk before he put on the ihram, and before he went round the House on the day of sacrifice. \n\nBukhari and Muslim."}},{"id":143,"idInBook":143,"chapterId":10,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَفَاضَ يَوْمَ النَّحْرِ ثُمَّ رجعَ فصلّى الظهْرَ بمنى. رَوَاهُ مُسلم","english":{"narrator":"","text":"Ibn ‘Umar said that God’s messenger hastened to Mecca on the day of sacrifice, then returned and prayed the noon prayer at Mina.\n\nMuslim transmitted it."}},{"id":144,"idInBook":144,"chapterId":10,"bookId":14,"arabic":"عَنْ عَلِيٍّ وَعَائِشَةَ رَضِيَ اللَّهُ عَنْهُمَا قَالَا: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَن تحلق الْمَرْأَة رَأسهَا. رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"‘Ali and ‘A’isha said that God's messenger forbade women to shave the heads. \n\nTirmidhi transmitted it."}},{"id":145,"idInBook":145,"chapterId":10,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَيْسَ عَلَى النِّسَاءِ الْحَلْقُ إِنَّمَا عَلَى النِّسَاءِ التَّقْصِيرُ» . رَوَاهُ أَبُو دَاوُدَ وَالدَّارِمِيُّ","english":{"narrator":"","text":"Ibn ‘Abbas reported God’s messenger as saying, “Shaving is not a duty laid on women ; only clipping the hair is incumbent on them. \n\nAbu Dawud and Darimi transmitted it."}},{"id":146,"idInBook":146,"chapterId":10,"bookId":14,"arabic":"عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَفَ فِي حَجَّةِ الْوَدَاعِ بِمِنًى لِلنَّاسِ يَسْأَلُونَهُ فَجَاءَهُ رَجُلٌ فَقَالَ: لَمْ أَشْعُرْ فَحَلَقْتُ قَبْلَ أَنْ أَذْبَحَ. فَقَالَ: «اذْبَحْ وَلَا حَرَجَ» فَجَاءَ آخَرُ فَقَالَ: لَمْ أَشْعُرْ فَنَحَرْتُ قَبْلَ أَنْ أَرْمِيَ. فَقَالَ: «ارْمِ وَلَا حَرَجَ» . فَمَا سُئِلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ شَيْءٍ قُدِّمَ وَلَا أُخِّرَ إِلَّا قَالَ: «افْعَلْ وَلَا حرج»\nوَفِي رِوَايَةٍ لِمُسْلِمٍ: أَتَاهُ رَجُلٌ فَقَالَ: حَلَقْتُ قَبْلَ أَنْ أَرْمِيَ. قَالَ: «ارْمِ وَلَا حَرَجَ» وأتاهُ آخرُ فَقَالَ: أفَضتُ إِلى البيتِ قَبْلَ أَنْ أَرْمِيَ. قَالَ: «ارْمِ وَلَا حَرَجَ»","english":{"narrator":"","text":"Abdallah b. 'Amr b. al-As said that God’s messenger stopped during the Farewell Pilgrimage at Mina for people who had something to ask him. A man came and said, “Being ignorant, I shaved before sacrificing.” He replied, “Sacrifice, for no harm will come.” Another came and said, “Being ignorant, I sacrificed before throwing the pebbles.” He replied, “Throw them, for no harm will come.” The Prophet was not asked about anything which had been done before or after its proper time without saying, “Do it, for no harm will come.” \n\nBukhari and Muslim. According to a version by Muslim a man came and said, “I shaved before throwing the pebbles.” He replied, “Throw them, for no harm will come.” Another came to him and said, “I hastened to the House before throwing the pebbles.” He replied, “Throw them, for no harm will come.”"}},{"id":147,"idInBook":147,"chapterId":10,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُسْأَلُ يَوْمَ النَّحْرِ بِمِنًى فَيَقُولُ: «لَا حرَجَ» فَسَأَلَهُ رجل فَقَالَ: رميت بعد مَا أمسَيتُ. فَقَالَ: «لَا حرَجَ» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Ibn ‘Abbas said that the Prophet was being questioned on the day of sacrifice at Mina and said, “No harm will come.” A man who consulted him said, “I threw the pebbles after the evening had come,” and he replied, “No harm will come.” \n\nBukhari transmitted it."}},{"id":148,"idInBook":148,"chapterId":10,"bookId":14,"arabic":"عَن عَليّ قَالَ: أَتَاهُ رَجُلٌ فَقَالَ: يَا رَسُولَ اللَّهِ إِنِّي أَفَضْتُ قَبْلَ أَنْ أَحْلِقَ فَقَالَ: «احْلِقْ أَوْ قَصِّرْ وَلَا حَرَجَ» . وَجَاءَ آخَرُ فَقَالَ: ذَبَحْتُ قَبْلَ أَنْ أَرْمِيَ. قَالَ: «ارْمِ وَلَا حرج» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"‘Ali told of a man coming to God’s messenger and saying, “I hastened to Mecca before shaving.” He replied, “Shave (or clip), for no harm will come.” Another came and said, “I sacrificed before throwing the pebbles.” He replied, “Throw them, for no harm wil come.”\n\nTirmidhi transmitted it."}},{"id":149,"idInBook":149,"chapterId":10,"bookId":14,"arabic":"عَن أُسامةَ بنِ شرِيكٍ قَالَ: خَرَجْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَاجًّا فَكَانَ النَّاسُ يَأْتُونَهُ فَمِنْ قَائِلٍ: يَا رَسُولَ اللَّهِ سَعَيْتُ قَبْلَ أَنْ أَطُوفَ أَوْ أَخَّرْتُ شَيْئًا أَوْ قَدَّمْتُ شَيْئًا فَكَانَ يَقُولُ: «لَا حَرَجَ إِلَّا عَلَى رَجُلٍ اقْتَرَضَ عِرْضَ مُسْلِمٍ وَهُوَ ظَالِمٌ فَذَلِكَ الَّذِي حَرِجَ وهَلِك» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"Usama b. Sharik said :","text":"I went out with God’s messenger to perform the pilgrimage, and the people were coming to him. One would say, “Messenger of God, I ran between as-Safa and al-Marwa before going round the Ka'ba,” or “I did something after its proper time, or “I did something before its proper time.” He would reply, “No harm will come, except to one who defames a Muslim acting wrongfully. That is the one who will be in trouble and will perish.”\n\nAbu Dawud transmitted it."}},{"id":150,"idInBook":150,"chapterId":10,"bookId":14,"arabic":"عَنْ أَبِي بَكْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: خَطَبَنَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ النَّحْرِ قَالَ: «إِنَّ الزَّمَانَ قَدِ اسْتَدَارَ كَهَيْئَتِهِ يَوْمَ خَلَقَ اللَّهُ السَّمَاوَاتِ وَالْأَرْضَ السَّنَةُ اثْنَا عَشَرَ شَهْرًا مِنْهَا أَرْبَعَةٌ حُرُمٌ ثَلَاثٌ مُتَوَالِيَاتٌ ذُو الْقَعْدَةِ وَذُو الْحِجَّةِ وَالْمُحَرَّمُ وَرَجَبُ مُضَرَ الَّذِي بَيْنَ جُمَادَى وَشَعْبَانَ» وَقَالَ: «أَيُّ شَهْرٍ هَذَا؟» قُلْنَا: اللَّهُ وَرَسُولُهُ أَعْلَمُ فَسَكَتَ حَتَّى ظَنَنَّا أَنَّهُ سَيُسَمِّيهِ بِغَيْرِ اسْمِهِ فَقَالَ: «أَلَيْسَ ذَا الْحِجَّةِ؟» قُلْنَا: بَلَى. قَالَ: «أَيُّ بَلَدٍ هَذَا؟» قُلْنَا: اللَّهُ وَرَسُولُهُ أَعْلَمُ فَسَكَتَ حَتَّى ظَنَنَّا أَنَّهُ سَيُسَمِّيهِ بِغَيْرِ اسْمِهِ قَالَ: «أَلَيْسَ الْبَلْدَةَ؟» قُلْنَا: بَلَى قَالَ «فَأَيُّ يَوْمٍ هَذَا؟» قُلْنَا: اللَّهُ وَرَسُولُهُ أَعْلَمُ فَسَكَتَ حَتَّى ظَنَنَّا أَنَّهُ سَيُسَمِّيهِ بِغَيْرِ اسْمِهِ. قَالَ: «أَلَيْسَ يَوْمَ النَّحْرِ؟» قُلْنَا: بَلَى. قَالَ: «فَإِنَّ دِمَاءَكُمْ وَأَمْوَالَكُمْ وَأَعْرَاضَكُمْ عَلَيْكُمْ حَرَامٌ كَحُرْمَةِ يَوْمِكُمْ هَذَا فِي بَلَدِكُمْ هَذَا فِي شَهْرِكُمْ هَذَا وَسَتَلْقَوْنَ رَبَّكُمْ فَيَسْأَلُكُمْ عَنْ أَعْمَالِكُمْ أَلَا فَلَا تَرْجِعُوا بِعْدِي ضُلَّالًا يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ أَلَا هَلْ بَلَّغْتُ؟» قَالُوا: نَعَمْ. قَالَ: «اللَّهُمَّ اشْهَدْ فَلْيُبَلِّغِ الشَّاهِدُ الْغَائِبَ فَرُبَّ مُبَلَّغٍ أَوْعَى مِنْ سَامِعٍ»","english":{"narrator":"Abu Bakra said that the Prophet gave them the following sermon on the day of sacrifice:","text":"“Time has completed a cycle to the form of the day when God created the heavens and the earth. The year contains twelve months of which four are sacred, three of them consecutive, viz. Dhul Qa'da, Dhul Hijja. and Muharram, and also Rajab of Mudar which comes between Jumada and Sha'ban.”( The month Rajab is here connected with the North Arabian tribe of Mudar because they are said to have honoured it greatly and never to have broken its sacred nature. The precise reference to its place among the months is said’to be for the purpose of removing any doubt about it owing to the earlier practice of periodically intercalating a month) He asked, “What month is this?\" and when the people replied that God and His messenger knew best, he remained silent so that they thought he would give it a new name, but he said, “Is it not Dhul Hijja?\" and they replied that it was. He asked, “What town is this?\" and when the people replied that God and His apostle knew best, he remained silent so that they thought he would give it a new name, but he said, “Is it not al-Balda?”( This word occurs a number of times in the Qur’an in the general sense of a district, but in 27, 91 it is used particularly of Mecca which is there called “this district (balda)\". In the tradition the word seems to be used as if it were a proper name) and they replied that it was. He asked, “What day is this?” and when the people replied that God and His messenger knew best, he remained silent so that they thought he would give it a new name, but he said, “Is it not the day of sacrifice?\" and they replied that it was. He said, “Your lives, property and honour must be regarded by you with a sacredness like that of this day of yours in this town of yours in this month of yours. You will meet your Lord, and He will ask you about your deeds. O, do not revert after my death to being people who are astray, beheading one another. Have I delivered the message ?\" When they replied that he had he said, “O God, testify ; and let him who is present convey it to him who is absent, for many a one to whom a message is conveyed has a more retentive memory than the one who hears.” \n\nBukhari and Muslim."}},{"id":151,"idInBook":151,"chapterId":10,"bookId":14,"arabic":"وَعَن وَبرةَ قَالَ: سَأَلْتُ ابْنَ عُمَرَ: مَتَى أَرْمِي الْجِمَارَ؟ قَالَ: إِذَا رَمَى إِمَامُكَ فَارْمِهِ فَأَعَدْتُ عَلَيْهِ الْمَسْأَلَةَ. فَقَالَ: كُنَّا نَتَحَيَّنُ فَإِذَا زَالَتِ الشَّمْسُ رمينَا. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Wabara said he asked Ibn ‘Umar when he should throw pebbles at the jamras, to which he replied, “Throw them when your imam does so.” He repeated the question and received the reply, “We used to wait for the proper time, and when the sun passed the meridian we threw them.” \n\nBukhari transmitted it."}},{"id":152,"idInBook":152,"chapterId":10,"bookId":14,"arabic":"وَعَن سالمٍ عَن ابنِ عمر: أَنَّهُ كَانَ يَرْمِي جَمْرَةَ الدُّنْيَا بِسَبْعِ حَصَيَاتٍ يُكبِّرُ على إِثْرَ كُلِّ حَصَاةٍ ثُمَّ يَتَقَدَّمُ حَتَّى يُسْهِلَ فَيَقُومُ مُسْتَقْبِلَ الْقِبْلَةِ طَوِيلًا وَيَدْعُو وَيَرْفَعُ يَدَيْهِ ثُمَّ يَرْمِي الْوُسْطَى بِسَبْعِ حَصَيَاتٍ يُكَبِّرُ كُلَّمَا رَمَى بِحَصَاةٍ ثُمَّ يَأْخُذُ بِذَاتِ الشِّمَالِ فَيُسْهِلُ وَيَقُومُ مُسْتَقْبِلَ الْقِبْلَةِ ثُمَّ يَدْعُو وَيَرْفَعُ يَدَيْهِ وَيَقُومُ طَوِيلًا ثُمَّ يَرْمِي جَمْرَةَ ذَاتِ الْعَقَبَةِ مِنْ بَطْنِ الْوَادِي بِسَبْعِ حَصَيَاتٍ يُكَبِّرُ عِنْدَ كُلِّ حَصَاةٍ وَلَا يَقِفُ عِنْدَهَا ثُمَّ يَنْصَرِفُ فَيَقُولُ: هَكَذَا رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَفْعَله. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Salim told that Ibn ‘Umar used to throw seven pebbles at the nearest1 jamra, saying “God is most great” after throwing each one. He would then go forward into the interior of the valley and after standing facing the qibla for a long time, making supplication and raising his hands, he would throw seven pebbles at the middle one, saying “God is most great” as often as he threw a pebble. He would then turn to the left and go farther into the valley, and after facing the qibla, making supplication, raising his hands and standing for a long time, he would throw seven pebbles at the jamra of the ‘Aqaba from the bottom of the wadi, saying “God is most great” each time be threw a pebble, but he did not stand beside it. Then he would depart and say, “This is how I saw the Prophet do it.” \n\nBukhari transmitted it."}},{"id":153,"idInBook":153,"chapterId":10,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: اسْتَأْذَنَ الْعَبَّاسُ بْنُ عَبْدِ الْمُطَّلِبِ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَبِيتَ بِمَكَّةَ لَيَالِيَ منى من أجلِ سِقايتِهِ فَأذن لَهُ","english":{"narrator":"","text":"Ibn ‘Umar said that al-‘Abbas b. ‘Abd al-Muttalib asked permission from God’s messenger to spend in Mecca the nights which were spent at Mina on account of his office of supplying water, and he gave him permission.\n\nBukhari and Muslim."}},{"id":154,"idInBook":154,"chapterId":10,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَاءَ إِلَى السِّقَايَةِ فَاسْتَسْقَى. فَقَالَ الْعَبَّاسُ: يَا فَضْلُ اذْهَبْ إِلَى أُمِّكَ فَأْتِ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِشَرَابٍ مِنْ عِنْدِهَا فَقَالَ: «اسْقِنِي» فَقَالَ: يَا رَسُولَ اللَّهِ إِنَّهُمْ يَجْعَلُونَ أَيْدِيَهُمْ فِيهِ قَالَ: «اسْقِنِي» . فَشرب مِنْهُ ثُمَّ أَتَى زَمْزَمَ وَهُمْ يَسْقُونَ وَيَعْمَلُونَ فِيهَا. فَقَالَ: «اعْمَلُوا فَإِنَّكُمْ عَلَى عَمَلٍ صَالِحٍ» . ثُمَّ قَالَ: «لَوْلَا أَنْ تُغْلَبُوا لَنَزَلْتُ حَتَّى أَضَعَ الْحَبْلَ عَلَى هَذِهِ» . وَأَشَارَ إِلَى عَاتِقِهِ. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Ibn ‘Abbas said that when God’s messenger came to the place for supplying water and asked for some, al-‘Abbas said, “Goto your mother, Fadl, and bring God’s messenger something to drink from her.” He asked again for water, and he said, “Messenger of God, they are putting their hands in it.” He asked once more and drank some of it. He then went to Zamzam where they were exerting themselves in supplying water and said, “Go ahead, for you are engaged in a good work.” Then pointing to his shoulder he said, “Were it not that you would be overpowered, I would go down and put the rope on this.” (This means that if the Prophet were seen drawing water from Zamzam himself others would think they had the right to do the same, and chose who had the office of drawing water would lose their privilege)\n\nBukhari transmitted it."}},{"id":155,"idInBook":155,"chapterId":10,"bookId":14,"arabic":"وَعَنْ أَنَسٍ رَضِيَ اللَّهُ عَنْهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى الظُّهْرَ وَالْعَصْرَ وَالْمَغْرِبَ وَالْعَشَاءَ ثُمَّ رَقَدَ رَقْدَةً بِالْمُحَصَّبِ ثُمَّ رَكِبَ إِلَى الْبَيْتِ فَطَافَ بِهِ. رَوَاهُ الْبُخَارِيُّ","english":{"narrator":"","text":"Anas said that the Prophet prayed the noon, afternoon, sunset and evening prayer, after which he had a sleep, in al-Muhassab. (The valley opening on al-Abtah between Mecca and Mina ; so called because of the pebbles in it) He then rode to the House and performed the circumambulation.\n\nBukhari transmitted it."}},{"id":156,"idInBook":156,"chapterId":10,"bookId":14,"arabic":"وَعَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ قَالَ: سألتُ أنسَ بنَ مالكٍ. قُلْتُ: أَخْبِرْنِي بِشَيْءٍ عَقَلْتَهُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أَيْنَ صَلَّى الظُّهْرَ يومَ الترويةِ؟ قَالَ: بمنى. قلت: فَأَيْنَ صَلَّى الْعَصْرَ يَوْمَ النَّفْرِ؟ قَالَ: بِالْأَبْطَحِ. ثُمَّ قَالَ افْعَلْ كَمَا يَفْعَلُ أُمَرَاؤُكَ","english":{"narrator":"","text":"‘Abd al-‘AzIz b. Rufai' said he asked Anas b. Malik to tell him something he knew about God's messenger, viz. where he prayed the noon prayer on yaum at-tarwiya, and he replied that it was in Mina. He asked where he had prayed the afternoon prayer on yaum an-nafr,( There are two days with this name, the first being the 12th of Dhul Hijja and the second the following day. The second of these is said to be the one referred to here) and he replied that it was in al-Abtah.(The part of the wadi of Mecca with small pebbles) He then said, “Do as your commanders do.” \n\nBukhari and Muslim."}},{"id":157,"idInBook":157,"chapterId":10,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: نُزُولُ الْأَبْطَحِ لَيْسَ بِسُنَّةٍ إِنَّمَا نَزَلَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأَنَّهُ كَانَ أسمح لِخُرُوجِهِ إِذا خرج","english":{"narrator":"","text":"‘A’isha said that stopping at al-Abtah was not a sunna ; God’s messenger stopped there simply because it was easier for him to depart from when he left.\n\nBukhari and Muslim."}},{"id":158,"idInBook":158,"chapterId":10,"bookId":14,"arabic":"وَعَنْهَا قَالَتْ: أَحْرَمْتُ مِنَ التَّنْعِيمِ بِعُمْرَةٍ فَدَخَلْتُ فَقَضَيْتُ عُمْرَتِي وَانْتَظَرَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم بالأبطحِ حَتَّى فَرَغْتُ فَأَمَرَ النَّاسَ بِالرَّحِيلِ فَخَرَجَ فَمَرَّ بِالْبَيْتِ فَطَافَ بِهِ قَبْلَ صَلَاةِ الصُّبْحِ ثُمَّ خَرَجَ إِلَى الْمَدِينَةِ. هَذَا الْحَدِيثُ مَا وَجَدْتُهُ بِرِوَايَةِ الشَّيْخَيْنِ بَلْ بِرِوَايَةِ أَبِي دَاوُدَ مَعَ اخْتِلَاف يسير فِي آخِره","english":{"narrator":"She said:","text":"I put on the ihram at at-Tan‘im for an ’umra , then entered and performed my ’umra . God’s messenger waited for me in al-Abtah till I had finished, then ordered the people to move on. He set out, and when passing the House he performed the circumambulation before the morning prayer, then went off to Medina. \n\nI did not find this tradition in what the two shaikhs transmitted, but in Abu Dawud’s version, with a slight difference at the end."}},{"id":159,"idInBook":159,"chapterId":10,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: كَانَ النَّاسُ يَنْصَرِفُونَ فِي كُلِّ وَجْهٍ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَنْفِرَنَّ أَحَدُكُمْ حَتَّى يَكُونَ آخِرُ عَهْدِهِ بِالْبَيْتِ إِلَّا أَنَّهُ خُفِّفَ عَنِ الْحَائِضِ»","english":{"narrator":"","text":"Ibn ‘Abbas told that the people were departing in all directions, so God’s messenger said, “None of you must go off till his obligations at the House are complete, except that this is remitted for a woman who is in her courses.” \n\nBukhari and Muslim."}},{"id":160,"idInBook":160,"chapterId":10,"bookId":14,"arabic":"وَعَن عائشةَ قَالَتْ: حَاضَتْ صَفِيَّةُ لَيْلَةَ النَّفْرِ فَقَالَتْ: مَا أُرَانِي إِلَّا حَابِسَتَكُمْ. قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «عَقْرَى حَلْقَى أَطَافَتْ يَوْمَ النَّحْرِ؟» قيل: نعم. قَالَ: «فانفري»","english":{"narrator":"","text":"‘A’isha told that Safiya began to menstruate on the night before yaum an-nafr and said, “It looks as if I shall detain you;” whereupon the Prophet said, “How unlucky and annoying you are!” He asked whether she had performed the circumambulation on the day of sacrifice, and on being informed that she had, he told her to set off. \n\nBukhari and Muslim."}},{"id":161,"idInBook":161,"chapterId":10,"bookId":14,"arabic":"عَنْ عَمْرِو بْنِ الْأَحْوَصِ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي حَجَّةِ الْوَدَاعِ: «أَيُّ يَوْمٍ هَذَا؟» قَالُوا: يَوْمُ النَّحْر الْأَكْبَرِ. قَالَ: «فَإِنَّ دِمَاءَكُمْ وَأَمْوَالَكُمْ وَأَعْرَاضَكُمْ بَيْنَكُمْ حَرَامٌ كَحُرْمَةِ يَوْمِكُمْ هَذَا فِي بَلَدِكُمْ هَذَا أَلا لَا يجني جانٍ عَلَى نَفْسِهِ وَلَا يَجْنِي جَانٍ عَلَى وَلَدِهِ وَلَا مَوْلُودٌ عَلَى وَالِدِهِ أَلَا وَإِنَّ الشَّيْطَانَ قد أَيسَ أَنْ يُعْبَدَ فِي بَلَدِكُمْ هَذَا أَبَدًا وَلَكِنْ ستكونُ لهُ طاعةٌ فِيمَا تحتقرونَ مِنْ أَعْمَالِكُمْ فَسَيَرْضَى بِهِ» . رَوَاهُ ابْنُ مَاجَهْ وَالتِّرْمِذِيّ وَصَححهُ","english":{"narrator":"","text":"‘Amr b. al-Ahwas said he heard God’s messenger ask at the Farewell Pilgrimage, “What day is this?” and receive the reply that it was the day of the greatest pilgrimage. He then said, “Your lives, property and honour must be regarded by you with a sacredness like that of this day of yours in this town of yours. No wrongdoer must do wrong to himself,( This phrase has given rise to different explanations. Mirqat, 3, 250 prefers the one which says that this is a command not to wrong one another As this is a cause of wrongdoing to oneself the command has been worded in this manner) no wrongdoer must do wrong to his child, nor any child to his parent. The devil has despaired of ever being worshipped in this town of yours, but he will receive obedience in your actions which you consider of little importance and will be satisfied with that.”\n\nIbn Majah and Tirmidhi transmitted it, the latter saying that it is sahih."}},{"id":162,"idInBook":162,"chapterId":10,"bookId":14,"arabic":"وَعَن رافعِ بنِ عمروٍ والمُزَني قَالَ: رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ النَّاسَ بِمِنًى حِينَ ارْتَفَعَ الضُّحَى عَلَى بَغْلَةٍ شَهْبَاءَ وَعَلِيٌّ يُعَبِّرُ عَنْهُ وَالنَّاسُ بَين قَائِم وقاعد. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"Rafi‘ b. ‘Amr al-Muzani said:","text":"I saw God’s messenger on a greyish she-mule addressing the people at Mina in the forenoon, while ‘Ali was repeating (He was repeating this for the benefit of those who were too far away to hear the Prophet) what he said, and some of the people were standing and others sitting. \n\nAbu Dawud transmitted it."}},{"id":163,"idInBook":163,"chapterId":10,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ وَابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمْ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخَّرَ طَوَافَ الزِّيَارَةِ يَوْمَ النَّحْرِ إِلَى اللَّيْلِ. رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد وَابْن مَاجَه","english":{"narrator":"","text":"‘A’isha and Ibn ‘Abbas said that on the day of sacrifice God's messenger postponed the circumambulation of the visit till night. \n\nTirmidhi, Abu Dawud and Ibn Majah transmitted it."}},{"id":164,"idInBook":164,"chapterId":10,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَرْمُلْ فِي السَّبْعِ الَّذِي أَفَاضَ فِيهِ. رَوَاهُ أَبُو دَاوُدَ وَابْنُ مَاجَهْ","english":{"narrator":"","text":"Ibn ‘Abbas said that the Prophet did not run in the seven circuits he made when he returned to Mecca. (This refers to the circuits at the visit from Mina to Mecca. Mirqat, iii, 251 says it was because the running between as-Safa and al-Marwa was performed first.)\n\nAbu Dawud and Ibn Majah transmitted it."}},{"id":165,"idInBook":165,"chapterId":10,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا رَمَى أَحَدُكُمْ جَمْرَةَ الْعَقَبَةِ فَقَدْ حَلَّ لَهُ كُلُّ شَيْءٍ إِلَّا النِّسَاءَ» . رَوَاهُ فِي شرح السّنة وَقَالَ: إِسْنَاده ضَعِيف\nوَفِي رِوَايَةِ أَحْمَدَ وَالنَّسَائِيِّ عَنِ ابْنِ عَبَّاسٍ قَالَ: «إِذَا رَمَى الْجَمْرَةَ فَقَدْ حَلَّ لَهُ كلُّ شيءٍ إِلا النساءَ»","english":{"narrator":"","text":"‘A’isha reported the Prophet as saying, “When any of you throws pebbles at the jamra of the ‘Aqaba every thing but women becomes lawful for him.” \n\nIt is transmitted in Sharh as-sunna with the remark that its isnad is weak. In the version of Ahmad and Nasa’i on the authority of Ibn ‘Abbas he said, “When one throws pebbles at the jamra everything but women becomes lawful for him.”"}},{"id":166,"idInBook":166,"chapterId":10,"bookId":14,"arabic":"وَعَنْهَا قَالَتْ: أَفَاضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ آخِرِ يَوْمِهِ حِينَ صَلَّى الظُّهْرَ ثُمَّ رَجَعَ إِلَى مِنًى فَمَكَثَ بِهَا لَيَالِيَ أَيَّامِ التَّشْرِيقِ يَرْمِي الْجَمْرَةَ إِذَا زَالَتِ الشَّمْسُ كُلَّ جَمْرَةٍ بِسَبْعِ حَصَيَاتٍ يُكَبِّرُ مَعَ كُلِّ حَصَاةٍ وَيَقِفُ عِنْدَ الْأُولَى وَالثَّانِيَةِ فَيُطِيلُ الْقِيَامَ وَيَتَضَرَّعُ وَيَرْمِي الثَّالِثَةَ فَلَا يَقِفُ عِنْدَهَا. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"She said that God’s messenger hastened to Mecca at the ending of the day when he prayed the noon prayer. He then returned to Mina and remained there over the nights of the. tashriq days. (The 11th, 12th and 13th of Dhul Hijja. The name tashriq is explained as a reference to pieces the flesh of the sacrifices which pilgrims dry in the sun) He would throw pebbles at the jamra when the sun passed the meridian, throwing seven at each jamra and saying “God is most Great” with each pebble. He would stand a long time at the first and second and make supplication, but while he threw pebbles at the third, he did not stand beside it. \n\nAbu Dawud transmitted it."}},{"id":167,"idInBook":167,"chapterId":10,"bookId":14,"arabic":"وَعَنْ أَبِي الْبَدَّاحِ بْنِ عَاصِمِ بْنِ عَدِيٍّ عَن أَبِيه قَالَ: رَخَّصَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم لرعاء الْإِبِل فِي البيتوتة: أَن يرملوا يَوْمَ النَّحْرِ ثُمَّ يَجْمَعُوا رَمْيَ يَوْمَيْنِ بَعْدَ يَوْمِ النَّحْرِ فَيَرْمُوهُ فِي أَحَدِهِمَا. رَوَاهُ مَالِكٌ وَالتِّرْمِذِيُّ وَالنَّسَائِيُّ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ صَحِيحٌ","english":{"narrator":"","text":"Abul Baddah b. ‘Asim b. ‘Adi said on his father’s authority that God’s messenger gave licence to herdsmen of camels not to pass the night at Mina and throw pebbles on the day of sacrifice, then combine two days’ throwing after the day of sacrifice and throw the pebbles on one of them. \n\nMalik, Tirmidhi and Nasa’i transmitted it, Tirmidhi saying this is a sahih tradition."}},{"id":168,"idInBook":168,"chapterId":10,"bookId":14,"arabic":"عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ: أَنَّ رَجُلًا سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مَا يلبس مِنَ الثِّيَابِ؟ فَقَالَ: «لَا تَلْبَسُوا الْقُمُصَ وَلَا الْعَمَائِمَ وَلَا السَّرَاوِيلَاتِ وَلَا الْبَرَانِسَ وَلَا الْخِفَافَ إِلَّا أَحَدٌ لَا يَجِدُ نَعْلَيْنِ فَيَلْبَسُ خُفَّيْنِ وليقطعهما أَسْفَل الْكَعْبَيْنِ وَلَا تَلْبَسُوا مِنَ الثِّيَابِ شَيْئًا مَسَّهُ زَعْفَرَانٌ وَلَا وَرْسٌ» . مُتَّفَقٌ عَلَيْهِ وَزَادَ الْبُخَارِيُّ فِي رِوَايَةٍ: «وَلَا تَنْتَقِبُ الْمَرْأَةُ الْمُحْرِمَةُ وَلَا تلبس القفازين»","english":{"narrator":"","text":"‘Abdallah b. ‘Umar told that when a man asked God’s messenger what clothing one who was on pilgrimage should wear, he said, “Do not wear shirts, turbans, trousers, garments with head coverings, or  shoes, unless one cannot get sandals and wears shoes, in which case he must cut them to come below the ankles; and you must not wear clothing which has any dye of saffron or wars (A plant of a yellow colour in the Yemen, like sesame. The word is also used for the colouring matter which is shaken out when the dower opens) \n\nBukhari and Muslim. Bukhari added in a version, “A woman who is on pilgrimage must not be veiled, or wear gloves.”"}},{"id":169,"idInBook":169,"chapterId":10,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ وَهُوَ يَقُولُ: «إِذَا لَمْ يَجِدِ الْمُحْرِمُ نَعْلَيْنِ لَبَسَ خُفَّيْنِ وَإِذَا لَمْ يَجِدْ إِزَارًا لَبَسَ سَرَاوِيل»","english":{"narrator":"","text":"Ibn ‘Abbas told of hearing God’s messenger saying in the course of an address, “When one who is on pilgrimage cannot get sandals he may wear shoes, and when he cannot get a lower garment he may wear trousers,” \n\nBukhari and Muslim."}},{"id":170,"idInBook":170,"chapterId":10,"bookId":14,"arabic":"وَعَنْ يَعْلَى بْنِ أُمَيَّةَ قَالَ: كُنَّا عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بالجعرانة إِذْ جَاءَ رَجُلٌ أَعْرَابِيٌّ عَلَيْهِ جُبَّةٌ وَهُوَ مُتَضَمِّخٌ بِالْخَلُوقِ فَقَالَ: يَا رَسُولَ اللَّهِ إِنِّي أَحْرَمْتُ بِالْعُمْرَةِ وَهَذِهِ عَلَيَّ. فَقَالَ: «أَمَا الطِّيبُ الَّذِي بِكَ فَاغْسِلْهُ ثَلَاثَ مَرَّاتٍ وَأَمَّا الْجُبَّةُ فَانْزِعْهَا ثُمَّ اصْنَعْ فِي عُمْرَتِكَ كَمَا تَصْنَعُ فِي حَجِّكَ»","english":{"narrator":"Ya‘la b. Umayya (Umayya was Ya'la’s mother) said:","text":"When we were with the Prophet at al- Ji'rana a desert Arab came to him wearing a tunic which was copiously perfumed (Literally “smeared copiously with khaluq.\" This is a perfume composed of saffron and other elements, yellow and red being the predominant colours) and said, “Messenger of God, I entered the sacred state for the ’umra  while wearing this.” He replied, “Wash the perfume which is on you three times, take off the tunic, then do in your ’umra  as you do in your hajj.” \n\nBukhari and Muslim."}},{"id":171,"idInBook":171,"chapterId":10,"bookId":14,"arabic":"وَعَنْ عُثْمَانَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَنْكِحُ الْمُحْرِمُ وَلَا يُنكِحُ وَلَا يَخْطُبُ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"‘Uthman reported God’s messenger as saying, “ One who is on pilgrimage may not marry, or give someone in marriage, or make a betrothal.” \n\nMuslim transmitted it."}},{"id":172,"idInBook":172,"chapterId":10,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَزَوَّجَ مَيْمُونَةَ وَهُوَ محرم","english":{"narrator":"","text":"Ibn ‘Abbas said that the Prophet married Maimuna when he was on pilgrimage. \n\nBukhari and Muslim."}},{"id":173,"idInBook":173,"chapterId":10,"bookId":14,"arabic":"وَعَنْ يَزِيدَ بْنِ الْأَصَمِّ ابْنِ أُخْتِ مَيْمُونَةَ عَنْ مَيْمُونَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَزَوَّجَهَا وَهُوَ حَلَالٌ. رَوَاهُ مُسْلِمٌ\nقَالَ الشيخُ الإِمَام يحيى السّنة C: وَالْأَكْثَرُونَ عَلَى أَنَّهُ تَزَوَّجَهَا حَلَالًا وَظَهَرَ أَمْرُ تَزْوِيجِهَا وَهُوَ مُحْرِمٌ ثُمَّ بَنَى بِهَا وَهُوَ حَلَال بسرف فِي طَرِيق مَكَّة","english":{"narrator":"","text":"Yazid b. al-Asamm, Maimuna’s nephew, told on Maimuna’s authority that God’s messenger married her when he was not in the sacred state. \n\nMuslim transmitted it. The shaikh and imam Muhyi as-Sunna has said that most people believe he married her when he was not in the sacred state, but the news of his marriage to her became public when he was performing the pilgrimage. Then when he had come out of the sacred state he cohabited with her at Sarif on the way to Mecca."}},{"id":174,"idInBook":174,"chapterId":10,"bookId":14,"arabic":"وَعَن أَبِي أَيُّوبَ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَغْسِلُ رَأْسَهُ وَهُوَ مُحْرِمٌ","english":{"narrator":"","text":"Abu Ayyub said that the Prophet used to wash his head when he was in the sacred state.\n\nBukhari and Muslim."}},{"id":175,"idInBook":175,"chapterId":10,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: احْتَجَمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ محرم","english":{"narrator":"","text":"Ibn ‘Abbas said that the Prophet had himself cupped when he was in the sacred state.\n\nBukhari and Muslim."}},{"id":176,"idInBook":176,"chapterId":10,"bookId":14,"arabic":"وَعَن عُثْمَان حَدَّثَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الرَّجُلِ إِذَا اشْتَكَى عَيْنَيْهِ وَهُوَ محرمٌ ضمدهما بِالصبرِ. رَوَاهُ مُسلم","english":{"narrator":"","text":"‘Uthman told on the authority of God’s messenger that when a man has a complaint in his eyes while he is in the sacred state, he should apply aloes to them. \n\nMuslim transmitted it."}},{"id":177,"idInBook":177,"chapterId":10,"bookId":14,"arabic":"وَعَنْ أُمِّ الْحُصَيْنِ قَالَتْ: رَأَيْتُ أُسَامَةَ وَبِلَالًا وَأَحَدُهُمَا آخِذٌ بِخِطَامِ نَاقَةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالْآخَرُ رَافِعٌ ثَوْبَهُ يَسْتُرُهُ من الْحَرِّ حَتَّى رَمَى جَمْرَةَ الْعَقَبَةِ. رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"Umm al-Husain said she saw Usama and Bilal, one of them holding the halter of God’s messenger’s she-camel, while the other raised his garment and sheltered him from the heat till he had thrown pebbles at the jamra of the ‘Aqaba. \n\nMuslim transmitted it."}},{"id":178,"idInBook":178,"chapterId":10,"bookId":14,"arabic":"وَعَنْ كَعْبِ بْنِ عُجْرَةَ رَضِيَ اللَّهُ عَنْهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ بِهِ وَهُوَ بِالْحُدَيْبِيَةَ قَبْلَ أَنْ يَدْخُلَ مَكَّةَ وَهُوَ مُحْرِمٌ وَهُوَ يُوقِدُ تَحْتَ قِدْرٍ وَالْقَمْلُ تهافت عَلَى وَجْهِهِ فَقَالَ: «أَتُؤْذِيكَ هَوَامُّكَ؟» . قَالَ: نَعَمْ. قَالَ: «فَاحْلِقْ رَأْسَكَ وَأَطْعِمْ فَرَقًا بَيْنَ سِتَّةِ مَسَاكِينَ» . وَالْفَرَقُ: ثَلَاثَةُ آصُعٍ: «أَوْ صُمْ ثَلَاثَةَ أَيَّام أوانسك نسيكة»","english":{"narrator":"","text":"Ka‘b b. ‘Ujra told that the Prophet came upon him at al-Hudaibiya while he was still in the sacred state before entering Mecca. He was kindling a fire under a pot and lice were falling in large numbers over his face. He asked him whether the insects were annoying him, and when he replied that they were, he said, “Shave your head, and give a faraq (i.e. three sa‘s) to six poor people, or fast three days, or sacrifice an animal.” \n\nBukhari and Muslim."}},{"id":179,"idInBook":179,"chapterId":10,"bookId":14,"arabic":"عَنِ ابْنِ عُمَرَ: أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْهَى النِّسَاءَ فِي إِحْرَامِهِنَّ عَنِ الْقُفَّازَيْنِ وَالنِّقَابِ وَمَا مَسَّ الْوَرْسُ وَالزَّعْفَرَانُ مِنَ الثِّيَابِ وَلْتَلْبَسْ بَعْدَ ذَلِكَ مَا أحبَّتْ من ألوانِ الثيابِ معصفر أوخز أَو حلي أَو سروايل أَو قميصٍ أَو خُفٍّ. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Ibn ‘Umar said he heard God’s messenger forbidding women to wear gloves or veils or any garment with dye of wars or saffron on it while they were engaged in the rites of pilgrimage; but afterwards they could wear any kind of clothing they liked dyed yellow, or silk, or jewellery, or trousers, or shirts, or shoes.\n\nAbu Dawud transmitted it."}},{"id":180,"idInBook":180,"chapterId":10,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: كَانَ الرُّكْبَانُ يَمُرُّونَ بِنَا وَنَحْنُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُحْرِمَاتٌ فَإِذَا جَاوَزُوا بِنَا سَدَلَتْ إِحْدَانَا جِلْبَابَهَا مِنْ رَأْسِهَا عَلَى وجهِها فإِذا جاوزونا كشفناهُ. رَوَاهُ أَبُو دَاوُد وَلابْن مَاجَه مَعْنَاهُ","english":{"narrator":"‘A’isha said:","text":"Riders would pass us when we were performing the rites of pilgrimage along with God’s messenger, and when they came by us one of us would let down her outer garment from her head over her face, and when they had passed on we would uncover our faces. \n\nAbu Dawud transmitted it, and Ibn Majah has something to the same effect."}},{"id":181,"idInBook":181,"chapterId":10,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَدَّهِنُ بالزيت وَهُوَ محرمٌ غيرَ المقنّتِ يَعني غيرَ المطيَّبِ. رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Ibn 'Umar said that when the Prophet was in the sacred state he used to grease'himself with olive-oil which was not muqattat, which means perfumed. \n\nTirmidhi transmitted it."}},{"id":182,"idInBook":182,"chapterId":10,"bookId":14,"arabic":"أَنَّ ابْنَ عُمَرَ وَجَدَ الْقُرَّ فَقَالَ: ألق عَليّ ثوبا نَافِعُ فَأَلْقَيْتُ عَلَيْهِ بُرْنُسًا فَقَالَ: تُلْقِي عَلَيَّ هَذَا وَقَدْ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَلْبَسَهُ الْمُحْرِمُ؟ . رَوَاهُ أَبُو دَاوُد؟","english":{"narrator":"","text":"Nafi' said that Ibn ‘Umar felt cold and told him to throw a garment over him; but when he threw a hooded cloak over him he said, “Are you throwing this over me when God’s messenger has forbidden those who are in the sacred state to wear it ?” \n\nAbu Dawud transmitted it."}},{"id":183,"idInBook":183,"chapterId":10,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ مَالِكٍ بن بُحَيْنَةَ قَالَ: احْتَجَمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ مُحْرِمٌ بِلَحْيِ جَمَلٍ مِنْ طريقِ مكةَ فِي وسط رَأسه","english":{"narrator":"","text":"‘Abdallah b. Malik Ibn Buhaina said that God’s messenger had himself cupped from the middle of his head at Lahy Jamal (This is variously said to have been a place, a hill, or some water on the way between Mecca and Medina) on the road to Mecca when he was in the sacred state.\n\nBukhari and Muslim."}},{"id":184,"idInBook":184,"chapterId":10,"bookId":14,"arabic":"وَعَنْ أَنَسٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: احْتَجَمَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ مُحْرِمٌ عَلَى ظَهْرِ الْقَدَمِ مِنْ وَجَعٍ كَانَ بِهِ. رَوَاهُ أَبُو دَاوُدَ وَالنَّسَائِيُّ","english":{"narrator":"","text":"Anas said that God’s messenger had himself cupped on the surface of his foot because of a pain in it while he was in the sacred state. \n\nAbu Dawud and Nasa’i transmitted it."}},{"id":185,"idInBook":185,"chapterId":10,"bookId":14,"arabic":"قَالَ: تَزَوَّجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَيْمُونَةَ وَهُوَ حَلَالٌ وَبَنَى بِهَا وَهُوَ حَلَالٌ وَكُنْتُ أَنَا الرَّسُولَ بَيْنَهُمَا. رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ حَسَنٌ","english":{"narrator":"Abu Rafi‘ said:","text":"God’s messenger married Maimuna when he was not in the sacred state and cohabited with her when he was not in the sacred state, and I was the messenger between them. \n\nAhmad and Tirmidhi transmitted it, the latter saying that this is a hasan  tradition."}},{"id":186,"idInBook":186,"chapterId":10,"bookId":14,"arabic":"عَن الصعب بن جثامة أَنه أهْدى رَسُول اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِمَارًا وَحْشِيًّا وَهُوَ بِالْأَبْوَاءِ أَوْ بِوَدَّانَ فَرَدَّ عَلَيْهِ فَلَمَّا رأى مَا فِي وَجْهَهُ قَالَ: «إِنَّا لَمْ نَرُدَّهُ عَلَيْكَ إِلَّا أنَّا حُرُمٌ»","english":{"narrator":"","text":"As-Sa'b b. Jaththama said that he presented to God’s messenger a wild ass when he was at al-Abwa’ or Waddan (A village not far from al-Abwa’) and that he rejected it, but when he saw how he looked he said, \"I rejected it only because I am in the sacred state.\"\n\nBukhari and Muslim."}},{"id":187,"idInBook":187,"chapterId":10,"bookId":14,"arabic":"وَعَنْ أَبِي قَتَادَةَ أَنَّهُ خَرَجَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَتَخَلَّفَ مَعَ بَعْضِ أَصْحَابِهِ وَهُمْ مُحْرِمُونَ وَهُوَ غَيْرُ مُحْرِمٍ فَرَأَوْا حِمَارًا وَحْشِيًّا قَبْلَ أَنْ يَرَاهُ فَلَمَّا رَأَوْهُ تَرَكُوهُ حَتَّى رَآهُ أَبُو قَتَادَةَ فَرَكِبَ فَرَسًا لَهُ فَسَأَلَهُمْ أَنْ يُنَاوِلُوهُ سَوْطَهُ فَأَبَوْا فَتَنَاوَلَهُ فَحَمَلَ عَلَيْهِ فَعَقَرَهُ ثُمَّ أَكَلَ فَأَكَلُوا فَنَدِمُوا فَلَمَّا أَدْرَكُوا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَأَلُوهُ. قَالَ: «هَلْ مَعَكُمْ مِنْهُ شَيْءٌ؟» قَالُوا: مَعَنَا رِجْلُهُ فَأَخَذَهَا النَّبِيُّ صَلَّى الله عَلَيْهِ وَسلم فَأكلهَا\nوَفِي رِوَايَةٍ لَهُمَا: فَلَمَّا أَتَوْا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أَمِنْكُمْ أَحَدٌ أَمَرَهُ أَنْ يَحْمِلَ عَلَيْهَا؟ أَوْ أَشَارَ إِلَيْهَا؟» قَالُوا: لَا قَالَ: «فَكُلُوا مَا بَقِيَ مِنْ لَحمهَا»","english":{"narrator":"","text":"Abu Qatada said that he went out with God’s messenger and stayed behind with some of his companions who were in the sacred state, although he was not. They saw a wild ass before Abu Qatada saw it, and when they saw it they ignored it; but when he saw it he mounted a horse of his and asked them to hand him his whip. When they refused, he took it, chased the wild ass and killed it. Both he and they ate it, but afterwards they repented, so when they caught up on God's messenger they asked him about it. He asked if they had any of it with them, and when they told him they had a leg, the Prophet took it and ate it. \n\nBukhari and Muslim. In a version by both of them it says that when they came to God’s messenger he asked whether any of them had ordered or suggested to him that he should chase it, and when they replied that they had not, he told them to eat the flesh that remained."}},{"id":188,"idInBook":188,"chapterId":10,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" خَمْسٌ لَا جُنَاحَ عَلَى من قتلَهُنّ فِي الْحل وَالْإِحْرَامِ: الْفَأْرَةُ وَالْغُرَابُ وَالْحِدَأَةُ وَالْعَقْرَبُ وَالْكَلْبُ الْعَقُورُ \"","english":{"narrator":"Ibn ‘Umar reported the Prophet as saying, “There are five creatures which it is not a sin for anyone to kill in the sacred territory and when in the sacred state:","text":"the rat, the crow, the kite, the scorpion and the biting dog.\"\n\nBukhari and Muslim."}},{"id":189,"idInBook":189,"chapterId":10,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" خَمْسٌ فَوَاسِقُ يُقْتَلْنَ فِي الْحِلِّ وَالْحَرَمِ: الْحَيَّةُ وَالْغُرَابُ الْأَبْقَعُ وَالْفَأْرَةُ وَالْكَلْبُ الْعَقُورُ وَالْحُدَيَّا \"","english":{"narrator":"‘A’isha reported the Prophet as saying, “Five noxious creatures may be killed outside or inside the sacred area:","text":"the snake, the pied crow, the rat, the biting dog and the kite.\"\n\nBukhari and Muslim."}},{"id":190,"idInBook":190,"chapterId":10,"bookId":14,"arabic":"عَنْ جَابِرٍ رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَحْمُ الصَّيْدِ لَكُمْ فِي الْإِحْرَامِ حَلَالٌ مَا لَمْ تَصِيدُوهُ أَوْ يُصَادُ لَكُمْ» . رَوَاهُ أَبُو دَاوُدَ وَالتِّرْمِذِيّ وَالنَّسَائِيّ","english":{"narrator":"","text":"Jabir reported God’s messenger as saying, “The flesh of game is lawful for you when you are wearing the ihram, as long as you do not hunt it or have it hunted on your behalf.” \n\nAbu Dawud, Tirmidhi and Nasa’i transmitted it."}},{"id":191,"idInBook":191,"chapterId":10,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْجَرَادُ مِنْ صَيْدِ الْبَحْرِ» . رَوَاهُ أَبُو دَاوُدَ وَالتِّرْمِذِيُّ","english":{"narrator":"","text":"Abu Huraira reported the Prophet as saying, “Locusts are counted along with what is caught in the sea.” (Literally, 'the game of the sea’)\n\nAbu Dawud and Tirmidhi transmitted it."}},{"id":192,"idInBook":192,"chapterId":10,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «يَقْتُلُ الْمُحْرِمُ السَّبُعَ الْعَادِيَ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ","english":{"narrator":"","text":"Abu Sa'id al-Khudri reported the Prophet as saying, “One who is in the sacred state may kill a dangerous wild beast.” \n\nTirmidhi, Abu Dawud and Ibn Majah transmitted it."}},{"id":193,"idInBook":193,"chapterId":10,"bookId":14,"arabic":"وَعَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِيِ عَمَّارٍ قَالَ: سَأَلت جابرَ بنَ عبدِ اللَّهِ عَنِ الضَّبُعِ أَصَيْدٌ هِيَ؟ فَقَالَ: نَعَمْ فَقُلْتُ: أَيُؤْكَلُ؟ فَقَالَ: نَعَمْ فَقُلْتُ: سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ؟ قَالَ: نَعَمْ. رَوَاهُ التِّرْمِذِيُّ وَالنَّسَائِيُّ وَالشَّافِعِيُّ وَقَالَ التِّرْمِذِيُّ: هَذَا حديثٌ حسنٌ صَحِيح","english":{"narrator":"","text":"‘Abd ar-Rahman b. Abu ‘Ammar said he asked Jabir b. 'Abdallah whether the hyena was considered game, and he said it was. He asked whether it might be eaten, and he said it might. He asked whether he had heard that from God's messenger, and he said that he had.\n\nTirmidhi, Nasa'i and Shafi'i transmitted it, Tirmidhi saying this is a hasan  sahih tradition."}},{"id":194,"idInBook":194,"chapterId":10,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: سَأَلَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ الضَّبُعِ؟ قَالَ: «هُوَ صَيْدٌ وَيُجْعَلُ فِيهِ كَبْشًا إِذَا أَصَابَهُ الْمُحْرِمُ» . رَوَاهُ أَبُو دَاوُد وَابْن مَاجَه والدارمي","english":{"narrator":"","text":"Jabir said he asked God’s messenger about the hyena and he replied, “It is game, and if one who is in the sacred state gets (Mirqat, iii, 262 says this may be either by buying it or hunting) it he should give a sheep as atonement.” \n\nAbu Dawud, Ibn Majah and Darimi transmitted it."}},{"id":195,"idInBook":195,"chapterId":10,"bookId":14,"arabic":"وَعَن خُزَيمةَ بنَ جَزَيّ قَالَ: سَأَلَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أَكْلِ الضَّبُعِ. قَالَ: \" أَوَ يَأْكُلُ الضَّبُعَ أَحَدٌ؟ . وَسَأَلْتُهُ عَنْ أَكْلِ الذِّئْبِ. قَالَ: «أوَ يَأَكلُ الذِّئْبَ أَحَدٌ فِيهِ خَيْرٌ؟» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: لَيْسَ إِسْنَاده بِالْقَوِيّ","english":{"narrator":"","text":"Khuzaima b. Jazi said he asked God’s messenger about eating a hyena, and he replied, “Does anyone eat a hyena ? ” He asked him about eating a wolf, and he replied, “Does any one with any good in him eat a wolf ? ” \n\nTirmidhi transmitted it, saying its isnad is not strong."}},{"id":196,"idInBook":196,"chapterId":10,"bookId":14,"arabic":"عَنْ عَبْدِ الرَّحْمَنِ بْنِ عُثْمَانَ التَّيْمِيِّ قَالَ: كنَّا مَعَ طَلحةَ بنِ عُبيدِ اللَّهِ وَنَحْنُ حُرُمٌ فَأُهْدِيَ لَهُ طَيْرٌ وَطَلْحَةُ رَاقِدٌ فَمِنَّا مَنْ أَكَلَ وَمِنَّا مَنْ تَوَرَّعَ فَلَمَّا اسْتَيْقَظَ طَلْحَةُ وَافَقَ مَنْ أَكَلَهُ قَالَ: فَأَكَلْنَاهُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ. رَوَاهُ مُسلم","english":{"narrator":"‘Abd ar-Rahman b. ‘Uthman at-Taimi said :","text":"When we were with Talha b. Ubaidallah and were in the sacred state, some birds (The word tair may be either singular or plural. Mirqat, iii, 263 remarks that here it is plural ; if not, it must refer to a large bird, as several people seem to have been present) were presented to him while he was asleep, and some of us ate but others refrained. Then when Talha awoke he agreed with those who had eaten, saying, “We ate such along with God’s messenger.”\n\nMuslim transmitted it."}},{"id":197,"idInBook":197,"chapterId":10,"bookId":14,"arabic":"عَنِ ابْنِ عَبَّاسٍ قَالَ: قَدْ أُحْصِرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَحَلَقَ رَأَسَهُ وَجَامَعَ نِسَاءَهُ وَنَحَرَ هَدْيَهُ حَتَّى اعْتَمَرَ عَامًا قَابلا. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Ibn ‘Abbas said that God’s messenger had been detained, so he had his head shaved, had intercourse with his wives, and sacrificed his animals. Then he performed the ’umra  the following year.\n\nBukhari transmitted it."}},{"id":198,"idInBook":198,"chapterId":10,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَ: خَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَحَالَ كَفَّارُ قُرَيْشٍ دُونَ الْبَيْتِ فَنَحَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَدَايَاهُ وَحَلَقَ وَقَصَّرَ أَصْحَابه. رَوَاهُ البُخَارِيّ","english":{"narrator":"‘Abdallah b. ‘Umar said :","text":"We went out with God’s messenger but the infidels of Quraish barred the way to the House, so the Prophet sacrificed his animals and had his head shaved, and his companions clipped their hair. \n\nBukhari transmitted it."}},{"id":199,"idInBook":199,"chapterId":10,"bookId":14,"arabic":"وَعَنِ الْمِسْوَرِ بْنِ مَخْرَمَةَ قَالَ: إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحَرَ قَبْلَ أَنْ يَحْلِقَ وَأَمَرَ أَصْحَابَهُ بِذَلِكَ. رَوَاهُ الْبُخَارِيُّ","english":{"narrator":"","text":"Al-Miswar b. Makhrama said that God’s messenger sacrificed before having his head shaved and ordered his companions to do the same. \n\nBukhari transmitted it."}},{"id":200,"idInBook":200,"chapterId":10,"bookId":14,"arabic":"وَعَن ابنِ عمَرَ أَنَّهُ قَالَ: أَلَيْسَ حَسْبُكُمْ سُنَّةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ؟ إِنْ حُبِسَ أَحَدُكُمْ عَنِ الْحَجِّ طَافَ بِالْبَيْتِ وَبِالصَّفَا وَالْمَرْوَةِ ثُمَّ حَلَّ مِنْ كُلِّ شَيْءٍ حَتَّى يَحُجَّ عَامًا قَابِلًا فَيَهْدِيَ أَوْ يَصُومَ إِنْ لَمْ يَجِدْ هَديا. رَوَاهُ البُخَارِيّ","english":{"narrator":"Ibn ‘Umar said :","text":"Is the sunna of God’s messenger not enough for you ? If any of you is detained from the pilgrimage he should perform the circumambulation of the House and go between as-Safa, and al-Marwa, then come right out of the sacred state and perform the pilgrimage the following year. He should sacrifice an animal, or fast if he cannot get any.\n\nBukhari transmitted it."}},{"id":201,"idInBook":201,"chapterId":10,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ. قَالَتْ: دَخَلَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى ضُبَاعَةَ بِنْتِ الزُّبَيْرِ فَقَالَ لَهَا: «لَعَلَّكِ أَرَدْتِ الْحَجَّ؟» قَالَتْ: وَاللَّهِ مَا أَجِدُنِي إِلَّا وَجِعَةً. فَقَالَ لَهَا: \n\" حُجِّي وَاشْتَرِطِي وَقُولِي: اللَّهُمَّ مَحِلِّي حَيْثُ حبستني \"","english":{"narrator":"","text":"‘A’isha said that God’s messenger went in to visit Duba'a daughter of az-Zubair and said to her, “Perhaps you intended to perform the pilgrimage ?” She replied, “I swear by God that I am suffering from pain,” so he said, “Perform the pilgrimage, but make a proviso saying, ‘O God, the place where I take off the ihram will be where Thou restrainest me’.” \n\nBukhari and Muslim."}},{"id":202,"idInBook":202,"chapterId":10,"bookId":14,"arabic":"عَنِ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ أَصْحَابَهُ أَنْ يُبَدِّلُوا الْهَدْيَ الَّذِي نَحَرُوا عَامَ الْحُدَيْبِيَةِ فِي عُمْرَةِ الْقَضَاءِ. رَوَاهُ أَبُو دَاوُدَ وَفِيهِ قِصَّةٌ وَفِي سَنَدِهِ مُحَمَّدُ بْنُ إِسْحَاقَ","english":{"narrator":"","text":"Ibn ‘Abbas said that God’s messenger commanded his companions to substitute sacrificial animals at the ’umra  of Fulfilment (‘Umra al-qada' The one performed in the year after the treaty made at al-Hudaibiya) for those they had sacrificed in the year of al-Hudaibiya. \n\nAbu Dawud transmitted it."}},{"id":203,"idInBook":203,"chapterId":10,"bookId":14,"arabic":"وَعَنِ الْحَجَّاجِ بْنِ عَمْرٍو الْأَنْصَارِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «من كُسِرَ أَوْ عَرِجَ فَقَدْ حَلَّ وَعَلَيْهِ الْحَجُّ من قَابل» . رَوَاهُ التِّرْمِذِيّ وَأَبُو دواد وَالنَّسَائِيُّ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ وَزَادَ أَبُو دَاوُدَ فِي رِوَايَةٍ أُخْرَى: «أَوْ مَرِضَ» . وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيث حسن. وَفِي المصابيح: ضَعِيف","english":{"narrator":"","text":"Al-Hajjaj b. ‘Amr al-Ansari reported God’s messenger as saying, “If anyone breaks a leg or becomes lame he has come out of the sacred state and must perform the pilgrimage the following year.”\n\nTirmidhi, Abu Dawud, Nasa’i, Ibn Majah and Darimi transmitted it, and Abu Dawud added in another version “or becomes ill.” Tirmidhi said this is a hasan  tradition, but in al-Masabih it is called weak."}},{"id":204,"idInBook":204,"chapterId":10,"bookId":14,"arabic":"وَعَن عبدِ الرَّحمنِ بنِ يَعمُرَ الدَّيْلي قَالَ: سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «الْحَجُّ عَرَفَةُ مَنْ أَدْرَكَ عَرَفَةَ لَيْلَةَ جَمْعٍ قَبْلَ طُلُوعِ الْفَجْرِ فَقَدْ أَدْرَكَ الْحَجَّ أيَّامُ مِنىً ثلاثةَ أيَّامٍ فَمَنْ تَعَجَّلَ فِي يَوْمَيْنِ فَلَا إِثْمَ عَلَيْهِ وَمَنْ تَأَخَّرَ فَلَا إِثْمَ عَلَيْهِ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالنَّسَائِيُّ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ\nهَذَا الْبَابُ خَالٍ عَنِ الْفَصْلِ الثَّالِثِ","english":{"narrator":"","text":"‘Abd ar-Rahman b. Ya'mur ad-Dili told that he heard the Prophet say, “The pilgrimage is ‘Arafa. He who gets to ‘Arafa on the night of Jam' (This would suggest that one is credited with taking part in the halt at ‘Arafa if he gets there at any time before dawn on the night when the pilgrims are at al-Muzdalifa) before dawn has attained the pilgrimage. The days at Mina are three, but if anyone hurries over matters in two days he is guilty of no sin, and if anyone is late he is guilty of no sin.” \n\nTirmidhi, Abu Dawud, Nasa'i, Ibn Majah and Darimi transmitted it, Tirmidhi saying this is a hasan sahih tradition."}},{"id":205,"idInBook":205,"chapterId":10,"bookId":14,"arabic":"عَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ فَتْحِ مَكَّةَ: «لَا هِجرةَ وَلَكِنْ جِهَادٌ وَنِيَّةٌ وَإِذَا اسْتُنْفِرْتُمْ فَانْفِرُوا» . وَقَالَ يَوْمَ فَتْحِ مَكَّةَ: «إِنَّ هَذَا الْبَلَدَ حَرَّمَهُ اللَّهُ يَوْمَ خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ فَهُوَ حَرَامٌ بِحُرْمَةِ اللَّهِ إِلَى يَوْمِ الْقِيَامَةِ وَإِنَّهُ لَمْ يحِلَّ القتالُ فيهِ لأحدٍ قبْلي وَلم يحِلَّ لِي إِلَّا سَاعَةً مِنْ نَهَارٍ فَهُوَ حَرَامٌ بِحُرْمَةِ اللَّهِ إِلَى يَوْمِ الْقِيَامَةِ لَا يُعْضَدُ شَوْكُهُ وَلَا يُنَفَّرُ صَيْدُهُ وَلَا يَلْتَقِطُ لُقَطَتُهُ إِلَّا مَنْ عَرَّفَهَا وَلَا يُخْتَلَى خَلَاهَا» . فَقَالَ الْعَبَّاسُ: يَا رَسُولَ اللَّهِ إِلَّا الْإِذْخِرَ فَإِنَّهُ لِقَيْنِهِمْ وَلِبُيُوتِهِمْ؟ فَقَالَ: «إِلَّا الْإِذْخِرَ»\nوَفِي رِوَايَة لأبي هريرةَ: «لَا يُعضدُ شجرُها وَلَا يلتَقطُ ساقطتَها إِلاَّ مُنشِدٌ»","english":{"narrator":"","text":"Ibn ‘Abbas reported God’s messenger as saying on the day of the conquest of Mecca, “There is no hijra, but only jihad and intention ; and when you are called to battle, go forth.’’ He also said on the day of the conquest of Mecca, “God made this town sacred on the day He created the heavens and the earth, so it is sacred by the sacredness conferred on it by God till the day of resurrection. Fighting in it has not been lawful to anyone before me and it has been made lawful for me only during one hour on one day, so it is sacred by the sacredness conferred on it by God till the day of resurrection. Its thorns are not to be cut, its game is not to be molested, things dropped are to be picked up only by one who publicly announces it, and its fresh herbage is not to be cut.” Ibn ‘Abbas made the suggestion, “Except the rush, messenger of God, for it is useful for their blacksmiths and for their houses.” He then said, “Except the rush.” \n\n(Bukhari and Muslim.) A version by Abu Huraira has, “Its trees are not to be lopped, and only one who announces it may pick up anything which falls in it.”"}},{"id":206,"idInBook":206,"chapterId":10,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَا يَحِلُّ لِأَحَدِكُمْ أَنْ يَحْمِلَ بمكةَ السِّلَاح» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Jabir said he heard God's messenger say, “It is not allowable for any of you to carry weapons in Mecca.” \n\nMuslim transmitted it."}},{"id":207,"idInBook":207,"chapterId":10,"bookId":14,"arabic":"وَعَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ مَكَّةَ يَوْمَ الْفَتْحِ وَعَلَى رَأْسِهِ الْمِغْفَرُ فَلَمَّا نَزَعَهُ جَاءَ رَجُلٌ وَقَالَ: إِنَّ ابْنَ خَطَلٍ مُتَعَلِّقٌ بِأَسْتَارِ الْكَعْبَةِ. فَقَالَ: «اقتله»","english":{"narrator":"","text":"Anas said that the Prophet entered , Mecca on the day of the Conquest with a helmet on his head, and when he pulled it off a man came to him and said, “Ibn Khatal (He was a renegade Muslim) is hanging on to the curtains of the Ka'ba.” He replied, “Kill him.” \n\nBukhari and Muslim."}},{"id":208,"idInBook":208,"chapterId":10,"bookId":14,"arabic":"وَعَنْ جَابِرٍ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ يَوْمَ فَتْحِ مَكَّةَ وَعَلَيْهِ عمامةٌ سوْداءُ بِغَيْر إِحْرَام. رَوَاهُ مُسلم","english":{"narrator":"","text":"Jabir said that God’s messenger entered on the day of the Conquest of Mecca wearing a black turban, but not wearing the ihram. \n\nMuslim transmitted it."}},{"id":209,"idInBook":209,"chapterId":10,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَغْزُو جَيْشٌ الْكَعْبَةَ فَإِذَا كَانُوا بِبَيْدَاءَ مِنَ الْأَرْضِ يُخْسَفُ بِأَوَّلِهِمْ وَآخِرِهِمْ» . قُلْتُ: يَا رَسُولَ اللَّهِ وَكَيْفَ يُخْسَفُ بِأَوَّلِهِمْ وَآخِرِهِمْ وَفِيهِمْ أسواقُهم وَمن لَيْسَ مِنْهُم؟ قَالَ: «يخسف وَآخِرِهِمْ ثُمَّ يُبْعَثُونَ عَلَى نِيَّاتِهِمْ»","english":{"narrator":"","text":"‘A'isha reported God’s messenger as saying, “An army will set out to attack the Ka'ba, but in an extensive desert the first and last of them will be swallowed up.” She asked how the first and last of them would be swallowed up when among them there would be markets and people who were not of their number, to which he replied, “The first and last of them will be swallowed up, then they will be resurrected in a state agreeing with their intentions.”\n\nBukhari and Muslim."}},{"id":210,"idInBook":210,"chapterId":10,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ «يُخَرِّبُ الْكَعْبَة ذُو السويقتين من الْحَبَشَة»","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “An Abyssinian with short legs will destroy the Ka'ba.” \n\nBukhari and Muslim."}},{"id":211,"idInBook":211,"chapterId":10,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «كَأَنِّي بِهِ أَسْوَدَ أَفْحَجَ يقْلعُها حجَراً حجَراً» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Ibn ‘Abbas reported the Prophet as saying, ‘ I seem to see him black and hen-toed pulling it down stone by stone.” \n\nBukhari transmitted it."}},{"id":212,"idInBook":212,"chapterId":10,"bookId":14,"arabic":"عَن يَعْلَى بْنِ أُمَيَّةَ قَالَ: إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «احْتِكَارُ الطَّعَامِ فِي الْحَرَمِ إِلْحَادٌ فِيهِ» . رَوَاهُ أَبُو دَاوُدَ","english":{"narrator":"","text":"Ya'la b. Umayya reported God’s messenger as saying, “Storing up food to sell it at a high price in the sacred territory is a profanation of its sanctity.” \n\nAbu Dawud transmitted it."}},{"id":213,"idInBook":213,"chapterId":10,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِمَكَّةَ: «مَا أَطْيَبَكِ مِنْ بَلَدٍ وَأَحَبَّكِ إِلَيَّ وَلَوْلَا أَنَّ قَوْمِي أَخْرَجُونِي مِنْكِ مَا سَكَنْتُ غَيْرَكِ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيب إِسْنَادًا","english":{"narrator":"","text":"Ibn ‘Abbas reported God’s messenger as saying to Mecca, “What a fine town you are, and how dear you are to me! Were it not that my people expelled me from you, I would live nowhere else.” \n\nTirmidhi transmitted it, saying this is a hasan sahih tradition whose isnad is gharlb."}},{"id":214,"idInBook":214,"chapterId":10,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عَدِيِّ بْنِ حَمْرَاءَ رَضِيَ اللَّهُ عَنْهُ قَالَ: رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاقِفًا عَلَى الْحَزْوَرَةِ فَقَالَ: «وَاللَّهِ إِنَّكِ لَخَيْرُ أَرْضِ اللَّهِ وَأَحَبُّ اللَّهِ إِلَى اللَّهِ وَلَوْلَا أَنِّي أُخْرِجْتُ مِنْكِ مَا خرجْتُ» . رَوَاهُ الترمذيُّ وَابْن مَاجَه","english":{"narrator":"","text":"'Abdallah b. ‘Adi b. Hamra’ said he saw God’s messenger standing at al-Hazwara (Taj al-'Arus gives two statements about this place, one saying it was a place at the gate of the wheat sellers, the other saying it was the market of Mecca which was later incorporated in the mosque when it was enlarged) and saying, “I swear by God that you are the best part of God’s earth and the part dearest to Him. Had I not been expelled from you I would not have gone out.” \n\nTirmidhi and Ibn Majah transmitted it."}},{"id":215,"idInBook":215,"chapterId":10,"bookId":14,"arabic":"عَن أبي شُريَحٍ العَدوِيِّ أَنَّهُ قَالَ لِعَمْرِو بْنِ سَعِيدٍ وَهُوَ يَبْعَثُ الْبُعُوثَ إِلَى مَكَّةَ: ائْذَنْ لِي أَيُّهَا الْأَمِيرُ أُحَدِّثْكَ قَوْلًا قَامَ بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الغدَ مِنْ يَوْمِ الْفَتْحِ سَمِعَتْهُ أُذُنَايَ وَوَعَاهُ قَلْبِي وَأَبْصَرَتْهُ عَيْنَايَ حِينَ تَكَلَّمَ بِهِ: حَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ: \n\" إِنَّ مَكَّةَ حَرَّمَهَا اللَّهُ وَلَمْ يُحَرِّمْهَا النَّاسُ فَلَا يَحِلُّ لِامْرِئٍ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ أَنْ يَسْفِكَ بِهَا دَمًا وَلَا يَعْضِدَ بِهَا شَجَرَةً فَإِنْ أَحَدٌ تَرَخَّصَ بِقِتَالِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيهَا فَقُولُوا لَهُ: إِنَّ اللَّهَ قَدْ أَذِنَ لرَسُوله وَلم يَأْذَن لِرَسُولِهِ وَلَمْ يَأْذَنْ لَكُمْ وَإِنَّمَا أُذِنَ لِي فِيهَا سَاعَة نَهَارٍ وَقَدْ عَادَتْ حُرْمَتُهَا الْيَوْمَ كَحُرْمَتِهَا بِالْأَمْسِ وَلْيُبْلِغِ الشَّاهِدُ الْغَائِبَ \". فَقِيلَ لِأَبِي شُرَيْحٍ: مَا قَالُ لَكَ عَمْرٌو؟ قَالَ: قَالَ: أَنَا أَعْلَمُ بِذَلِكَ مِنْكَ يَا أَبَا شُرَيْحٍ أَنَّ الْحَرَمَ لَا يُعِيذُ عَاصِيًا وَلَا فَارًّا بِدَمٍ وَلَا فَارًّا بِخَرْبَةٍ. مُتَّفَقٌ عَلَيْهِ. وَفِي الْبُخَارِيِّ: الْخَرْبَةُ: الْجِنَايَة","english":{"narrator":"Abu Shuraih al-‘Adawi told that he said to ‘Amr b. Sa‘id when he was sending troops to Mecca (The reference is to an expedition against 'Abdallah b. az-Zubair):","text":"Let me tell you something, commander, which God’s messenger said on the day following the Conquest. My ears heard it, my heart has retained it, and my eyes saw him when he spoke it. After praising and extolling God he said, “God, not men, has made Mecca sacred, so it is not allowable for a man who believes in God and in the last day to shed blood in it, or lop a tree in it. If anyone seeks licence to do so on the ground that God’s messenger fought in it, tell him that God has given permission to His messenger but not to you. He gave him permission only during one hour on one day, and its sacredness has been restored to it like what it was yesterday. Let him who is present convey the information to him who is absent.\" Abu Shuraih was asked what ‘Amr had replied, and said he had replied, “I am better informed of that than you, Abu Shuraih.' The sacred territory does not give refuge to one who is disobedient, or one who flies when he has shed blood, or one who flies because of a fault (kharba).” (The word is used of a vice) \n\nBukhari and Muslim. In Bukhari’s work kharba is said to mean a crime."}},{"id":216,"idInBook":216,"chapterId":10,"bookId":14,"arabic":"وَعَن عيَّاشِ بنِ أبي ربيعةَ المَخْزُومِي قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَزَالُ هَذِهِ الْأُمَّةُ بِخَيْرٍ مَا عَظَّمُوا هَذِهِ الْحُرْمَةَ حَقَّ تَعْظِيمِهَا فَإِذَا ضَيَّعُوا ذلكَ هلَكُوا» . رَوَاهُ ابْن مَاجَه","english":{"narrator":"","text":"‘Ayyash b. Abu Rabi'a al-Makhzumi reported God’s messenger as saying, “This people will continue to prosper as long as they give this sacredness due respect, but when they squander that they will perish.” \n\nIbn Majah transmitted it.\n\nChapter 16a"}},{"id":217,"idInBook":217,"chapterId":10,"bookId":14,"arabic":"عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ: مَا كَتَبْنَا عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّا الْقُرْآنَ وَمَا فِي هَذِهِ الصَّحِيفَةِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «الْمَدِينَةُ حَرَامٌ مَا بَيْنَ عَيْرٍ إِلَى ثَوْرٍ فمنْ أحدَثَ فِيهَا حَدَثًا أَوْ آوَى مُحْدِثًا فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلَائِكَةِ وَالنَّاسِ أَجْمَعِينَ لَا يُقْبَلُ مِنْهُ صَرْفٌ وَلَا عَدْلٌ ذمَّةُ المسلمينَ واحدةٌ يَسْعَى بِهَا أَدْنَاهُمْ فَمَنْ أَخْفَرَ مُسْلِمًا فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلَائِكَةِ وَالنَّاسِ أَجْمَعِينَ لَا يُقْبَلُ مِنْهُ صَرْفٌ وَلَا عَدْلٌ وَمَنْ وَالَى قَوْمًا بِغَيْرِ إِذْنِ مَوَالِيهِ فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلَائِكَةِ وَالنَّاسِ أَجْمَعِينَ لَا يُقْبَلُ مِنْهُ صَرْفٌ وَلَا عدل»\nوَفِي رِوَايَةٍ لَهُمَا: «مَنِ ادَّعَى إِلَى غَيْرِ أَبِيهِ أَوْ تَوَلَّى غَيْرَ مَوَالِيهِ فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلَائِكَةِ وَالنَّاسِ أَجْمَعِينَ لَا يُقْبَلُ مِنْهُ صرف وَلَا عدل»","english":{"narrator":"‘Ali said :","text":"We wrote down nothing on the authority of God’s messenger but the Qur’an and what this document contains. He reported God’s messenger as saying, “Medina is sacred from ‘Air to Thaur, ( This phrase has been much discussed. ‘Air is known as a hill at Medina and Thaur at Mecca. Because of the difficulty some have suggested that Uhud should be read instead of Thaur, but others feel that that is unjustifiable.) so if anyone produces an innovation in it, or gives protection to an innovator, the curse of God, the angels, and all men will rest upon him, and no repentance or ransom (Lane in his Lexicon gives a variety of meanings for this phrase, la yuqbal minhu sarf wald 'adl. The one used above seems the most suitable here) will be accepted from him. The protection granted by Muslims is one and must be respected by the humblest of them, so if anyone breaks a covenant made by a Muslim the curse of God, the angels, and all men will rest upon him and no repentance or ransom will be accepted from him. If anyone gives the rights of inheritance to people without the permission of his masters, (This is explained in relation to a slave who has been set free, for the rights of inheritance still belong to his master who set him free. Cf. Book 12, ch. 6, third tradition) the curse of God, the angels, and all men will rest upon him, and no repentance or ransom will be accepted from him.’’ \n\nBukhari and Muslim. A version given by both of them says, “ If anyone makes a false claim to paternity or to being a client, the curse of God, the angels and all men will rest upon him, and no repentance or ransom will be accepted from him.”"}},{"id":218,"idInBook":218,"chapterId":10,"bookId":14,"arabic":"وَعَنْ سَعْدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" إِنِّي أُحَرِّمُ مَا بَيْنَ لَابَتَيِ الْمَدِينَةِ: أَنْ يُقْطَعَ عِضَاهُهَا أَوْ يُقْتَلَ صَيْدُهَا \" وَقَالَ: «الْمَدِينَةُ خَيْرٌ لَهُمْ لَوْ كَانُوا يعلَمونَ لَا يَدَعُهَا أَحَدٌ رَغْبَةً عَنْهَا إِلَّا أَبْدَلَ اللَّهُ فِيهَا مَنْ هُوَ خَيْرٌ مِنْهُ وَلَا يَثْبُتُ أَحَدٌ عَلَى لَأْوَائِهَا وَجَهْدِهَا إِلَّا كُنْتُ لَهُ شَفِيعًا أَو شَهِيدا يَوْم الْقِيَامَة» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Sa‘d reported God’s messenger as saying, “I declare sacred the territory between the two lava plains of Medina, so that its large thorn trees may not be cut down, or its game killed.” He also said, “Medina is best for them if they only knew. No one leaves it through dislike of it without God putting in it someone better than he in place of him, and no one will remain there in spite of its hardship and distress without my being an intercessor (or witness) on his behalf on the day of resurrection.\" \n\nMuslim transmitted it."}},{"id":219,"idInBook":219,"chapterId":10,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يَصْبِرُ عَلَى لَأْوَاءِ الْمَدِينَةِ وَشِدَّتِهَا أَحَدٌ مِنْ أُمَّتِي إِلَّا كُنْتُ لَهُ شَفِيعًا يَوْمَ الْقِيَامَةِ» . رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"Abu Huraira reported God's messenger as saying, \"No one from among my people will endure the hardship and rigour of Medina without my being an intercessor on his behalf on the day of resurrection.\" \n\nMuslim transmitted it."}},{"id":220,"idInBook":220,"chapterId":10,"bookId":14,"arabic":"وَعَنْهُ قَالَ: كَانَ النَّاسُ إِذَا رَأَوْا أَوَّلَ الثَّمَرَةِ جَاءُوا بِهِ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَإِذَا أَخَذَهُ قَالَ: «اللَّهُمَّ بَارِكْ لَنَا فِي ثَمَرِنَا وَبَارِكْ لَنَا فِي مَدِينَتِنَا وَبَارِكْ لَنَا فِي صَاعِنَا وَبَارِكْ لَنَا فِي مُدِّنَا اللَّهُمَّ إِنَّ إِبْرَاهِيمَ عَبْدُكَ وَخَلِيلُكَ وَنَبِيُّكَ وَإِنِّي عَبْدُكَ وَنَبِيُّكَ وَإِنَّهُ دَعَاكَ لِمَكَّةَ وَأَنَا أدعوكَ للمدينةِ بمثلِ مَا دعَاكَ لمكةَ ومِثْلِهِ مَعَهُ» . ثُمَّ قَالَ: يَدْعُو أَصْغَرَ وَلِيدٍ لَهُ فيعطيهِ ذَلِك الثَّمر. رَوَاهُ مُسلم","english":{"narrator":"","text":"He told that when the people saw the first fruits they brought them to the Prophet, and when he received them he said, \"O God, bless us in our fruits; bless us in our city; bless us in our sa‘; and bless us in our mudd. O God, Abraham was Thy servant, friend and prophet, and I am Thy servant and prophet. He made supplication to Thee on behalf of Mecca, and I make on behalf of Medina the same supplication as he made on behalf of Mecca and as much again.\" He would then call to him the youngest child and give him those fruits. \n\nMuslim transmitted it."}},{"id":221,"idInBook":221,"chapterId":10,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ إِبْرَاهِيمَ حَرَّمَ مَكَّةَ فَجَعَلَهَا حَرَامًا وَإِنِّي حَرَّمْتُ الْمَدِينَةَ حَرَامًا مَا بَيْنَ مَأْزِمَيْهَا أَنْ لَا يُهْرَاقَ فِيهَا دَمٌ وَلَا يُحْمَلَ فِيهَا سلاحٌ لقتالٍ وَلَا تُخبَطَ فِيهَا شجرةٌ إِلَّا لعلف» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Sa'id reported the Prophet as saying, \"Abraham declared Mecca sacred and made it a sacred area, and I declare Medina to be sacred throughout the area between its two mountain paths, so that no blood may be shed in it, weapons may not be carried in it for fighting, and leaves may not be beaten off trees in it except for fodder.\"\n\nMuslim transmitted it."}},{"id":222,"idInBook":222,"chapterId":10,"bookId":14,"arabic":"وَعَنْ عَامِرِ بْنِ سَعْدٍ: أَنَّ سَعْدًا رَكِبَ إِلَى قَصْرِهِ بِالْعَقِيقِ فَوَجَدَ عَبْدًا يَقْطَعُ شَجَرًا أَوْ يَخْبِطُهُ فَسَلَبَهُ فَلَمَّا رَجَعَ سَعْدٌ جَاءَهُ أَهْلُ الْعَبْدِ فَكَلَّمُوهُ أَنْ يَرُدَّ عَلَى غُلَامِهِمْ أَوْ عَلَيْهِمْ مَا أَخَذَ مِنْ غُلَامِهِمْ فَقَالَ: مَعَاذَ اللَّهِ أَنْ أَرُدَّ شَيْئًا نَفَّلَنِيهِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبِي أَنْ يرد عَلَيْهِم. رَوَاهُ مُسلم","english":{"narrator":"","text":"‘Amir b. Sa'd said that Sa‘d rode to his castle in al-'Aqiq and found a salve cutting down trees, or beating off their leaves, so he took what was on him. When Sa'd returned, the slave’s people came to him and asked him to return to their servant or to them what he had taken from their servant, but he replied, \"God forbid that I should return anything which God’s messenger has given me as spoil;\" and he refused to return it to them. \n\nMuslim transmitted it."}},{"id":223,"idInBook":223,"chapterId":10,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: لَمَّا قَدِمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةَ وُعِكَ أَبُو بَكْرٍ وَبِلَالٌ فَجِئْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرْتُهُ فَقَالَ: «اللَّهُمَّ حَبِّبْ إِلَيْنَا الْمَدِينَةَ كَحُبِّنَا مَكَّةَ أَوْ أَشَدَّ وَصَحِّحْهَا وَبَارِكْ لَنَا فِي صاعها ومدها وانقل حماها فاجعلها بِالْجُحْفَةِ»","english":{"narrator":"‘A'isha said:","text":"When God’s messenger came to Medina Abu Bakr and Bilal were prostrated with fever and when I went to God’s messenger and told him he said, \"O God, make Medina as dear to us as Mecca, or more so, make it healthy, bless us in its sa' and its mudd, and transfer its fever and put it in al-Juhfa.\"\n\nBukhari and Muslim."}},{"id":224,"idInBook":224,"chapterId":10,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ فِي رُؤْيَا النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْمَدِينَةِ: \n\" رَأَيْتُ امْرَأَةً سَوْدَاءَ ثَائِرَةَ الرَّأْسِ خَرَجَتْ مِنَ الْمَدِينَةِ حَتَّى نَزَلَتْ مَهْيَعَةَ فَتَأَوَّلْتُهَا: أَنَّ وَبَاءَ الْمَدِينَةِ نُقِلَ إِلَى مَهْيَعَةَ وَهِيَ الْجُحْفَةُ \". رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"'Abdallah b. ‘Umar told of the vision the Prophet had about Medina. He said, “I saw a black woman with dishevelled hair go out of Medina and settle at Mahya'a, and interpreted it as meaning that the pestilence of Medina had been transferred to Mahya'a, which is al-Juhfa.” \n\nBukhari transmitted it."}},{"id":225,"idInBook":225,"chapterId":10,"bookId":14,"arabic":"وَعَنْ سُفْيَانَ بْنِ أَبِي زُهَيْرٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «يُفْتَحُ الْيَمَنُ فَيَأْتِي قومٌ يبُسُّونَ فيَتَحمَّلونَ بأهليهم وَمن أطاعهم وَالْمَدِينَةُ خَيْرٌ لَهُمْ لَوْ كَانُوا يَعْلَمُونَ وَيُفْتَحُ الشَّامُ فَيَأْتِي قَوْمٌ يَبُسُّونَ فَيَتَحَمَّلُونَ بِأَهْلِيهِمْ وَمَنْ أَطَاعَهُمْ وَالْمَدِينَةُ خَيْرٌ لَهُمْ لَوْ كَانُوا يَعْلَمُونَ وَيُفْتَحُ الْعِرَاقُ فَيَأْتِي قَوْمٌ يَبُسُّونَ فَيَتَحَمَّلُونَ بِأَهْلِيهِمْ وَمَنْ أَطَاعَهُمْ وَالْمَدِينَةُ خَيْرٌ لَهُمْ لَوْ كَانُوا يعلمُونَ»","english":{"narrator":"","text":"Sufyan b. Abu Zuhair told of hearing God’s messenger say, \"The Yemen will be conquered and- people will come driving their camels gently, removing their families and those who are under their authority, but Medina would be best for them if they only knew. Syria will be conquered and people will come driving their camels gently, removing their families and those who are under their authority, but Medina would be best for them if they only knew. ‘Iraq will be conquered and people will come driving their camels gently, removing their families and those who are under their authority, but Medina would be best for them if they only knew.” \n\nBukhari and Muslim."}},{"id":226,"idInBook":226,"chapterId":10,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" أُمِرْتُ بِقَرْيَةٍ تَأْكُلُ الْقُرَى. يَقُولُونَ: يَثْرِبَ وَهِيَ الْمَدِينَةُ تَنْفِي النَّاسَ كَمَا يَنْفِي الْكِيرُ خَبَثَ الْحَدِيدِ \"","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, \" I have been commanded to go to a town which will devour all towns. People call it Yathrib, but it is Medina. It drives away people as the bellows drives away the impurity of iron.” \n\nBukhari and Muslim."}},{"id":227,"idInBook":227,"chapterId":10,"bookId":14,"arabic":"وَعَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِنَّ الله سمى الْمَدِينَة طابة» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Jabir b. Samura told that he heard God’s messenger say, “God called Medina Taba.”( Taj al-'Arus says the objection to the name Yathrib was owing to the fact that the root from which this name comes has the meaning of corruption. Therefore Taba, which comes from a root meaning to be good, sweet, or pure, was considered better. Other forms which have been used are Taiba, al-Mutayyaba (or al-Mutayyiba))\n\nMuslim transmitted it."}},{"id":228,"idInBook":228,"chapterId":10,"bookId":14,"arabic":"وَعَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ: أَنَّ أَعْرَابِيًّا بَايَعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَصَابَ الْأَعْرَابِيَّ وَعَكٌ بِالْمَدِينَةِ فَأَتَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: يَا مُحَمَّدُ أَقِلْنِي بَيْعَتِي فَأَبَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ جَاءَهُ فَقَالَ: أَقِلْنِي بَيْعَتِي فَأَبَى ثُمَّ جَاءَهُ فَقَالَ: أَقِلْنِي بَيْعَتِي فَأَبَى فَخَرَجَ الْأَعْرَابِيُّ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّمَا الْمَدِينَةُ كَالْكِيرِ تَنْفِي خبثها وتنصع طيبها»","english":{"narrator":"","text":"Jabir b. ‘Abdallah told of a desert Arab who had sworn allegiance to God’s messenger, but who, when he suffered from a bout of fever in Medina, came to the Prophet and said, \"Cancel my oath of allegiance, Muhammad;” but God’s messenger refused. He came again with the same request and again he refused. He came once more with the same request, and when he again refused, the desert Arab went off. God’s messenger then said, \"Medina is like bellows which drives away its impurity and purifies what is good in it.” \n\nBukhari and Muslim."}},{"id":229,"idInBook":229,"chapterId":10,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَقُومُ السَّاعَةُ حَتَّى تَنْفِيَ الْمَدِينَةُ شِرَارَهَا كَمَا يَنْفِي الْكِيرُ خَبَثَ الْحَدِيد» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Huraira reported God's messenger as saying, “The last hour will not come before Medina drives away its wicked people as the bellows drives away the impurity of iron.\" \n\nMuslim transmitted it."}},{"id":230,"idInBook":230,"chapterId":10,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «عَلَى أَنْقَابِ الْمَدِينَةِ مَلَائِكَةٌ لَا يَدْخُلُهَا الطَّاعُونُ وَلَا الدَّجَّالُ»","english":{"narrator":"","text":"He reported God’s messenger as saying, “There are angels on the mountain roads of Medina, so neither plague nor the dajjal can enter it.”\n\nBukhari and Muslim."}},{"id":231,"idInBook":231,"chapterId":10,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَيْسَ مِنْ بلدٍ إِلا سَيَطَؤهُ الدَّجَّالُ إِلَّا مَكَّةَ وَالْمَدِينَةَ لَيْسَ نَقْبٌ مِنْ أَنِقَابِهَا إِلَّا عَلَيْهِ الْمَلَائِكَةُ صَافِّينَ يَحْرُسُونَهَا فَيَنْزِلُ السَّبِخَةَ فَتَرْجُفُ الْمَدِينَةُ بِأَهْلِهَا ثَلَاثَ رَجَفَاتٍ فَيَخْرُجُ إِلَيْهِ كُلُّ كَافِرٍ وَمُنَافِقٍ»","english":{"narrator":"","text":"Anas reported God’s messenger as saying, “There is no town on which the dajjal will not tread, with the exception of Mecca and Medina. There is none of its mountain paths which does not have angels in it drawn up in rows and guarding it. He will then go down to the marshy land, and Medina will put its people into commotion three times; then every infidel and hypocrite will go out to him.” \n\nBukhari and Muslim."}},{"id":232,"idInBook":232,"chapterId":10,"bookId":14,"arabic":"وَعَنْ سَعْدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَكِيدُ أَهْلَ الْمَدِينَةِ أَحَدٌ إِلَّا انْمَاعَ كَمَا يَنْمَاعُ الْملح فِي المَاء»","english":{"narrator":"","text":"Sa'd reported God’s messenger as saying, “No one will act deceitfully towards the inhabitants of Medina without being dissolved as salt is dissolved in water.” \n\nBukhari and Muslim."}},{"id":233,"idInBook":233,"chapterId":10,"bookId":14,"arabic":"وَعَنْ أَنَسٍ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا قَدِمَ مِنْ سَفَرٍ فَنَظَرَ إِلى جُدُراتِ الْمَدِينَةِ أَوْضَعَ رَاحِلَتَهُ وَإِنْ كَانَ عَلَى دَابَّةٍ حركها من حبها. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Anas said that when the Prophet returned from a journey and looked at the walls of Medina he made his camel hasten, and if he was on a horse (Dabba. This word is used for either a horse or a mule, and although it is feminine it is used for either male or female) he urged it on through love of Medina. \n\nBukhari transmitted it."}},{"id":234,"idInBook":234,"chapterId":10,"bookId":14,"arabic":"وَعَنْهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طَلَعَ لَهُ أُحُدٌ فَقَالَ: «هَذَا جَبَلٌ يُحِبُّنَا وَنُحِبُّهُ اللَّهُمَّ إِنَّ إِبْرَاهِيمَ حَرَّمَ مَكَّةَ وَإِنِّي أحرم مَا بَين لابتيها»","english":{"narrator":"","text":"He told of the Prophet coming in sight of Uhud and saying, “This is a mountain which loves us and which we love. O God, Abraham declared Mecca sacred, and I declare the land between its (Medina's) two lava plains to be sacred.”\n\nBukhari and Muslim."}},{"id":235,"idInBook":235,"chapterId":10,"bookId":14,"arabic":"وَعَنْ سَهْلِ بْنِ سَعْدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أُحُدٌ جَبَلٌ يُحِبُّنَا ونحبُّه» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Sahl b. Sa'd reported God’s messenger as saying, “Uhud is a mountain which loves us and which we love.” \n\nBukhari transmitted it."}},{"id":236,"idInBook":236,"chapterId":10,"bookId":14,"arabic":"عَنْ سُلَيْمَانَ بْنِ أَبِي عَبْدِ اللَّهِ قَالَ: رَأَيْتُ سَعْدَ بْنَ أَبِي وَقَّاصٍ أَخَذَ رَجُلًا يَصِيدُ فِي حَرَمِ الْمَدِينَةِ الَّذِي حَرَّمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَلَبَهُ ثِيَابَهُ فَجَاءَهُ مَوَالِيهِ فَكَلَّمُوهُ فِيهِ فَقَالَ: إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَرَّمَ هَذَا الْحَرَمَ وَقَالَ: «مَنْ أَخَذَ أَحَدًا يَصِيدُ فِيهِ فَلْيَسْلُبْهُ» . فَلَا أَرُدُّ عَلَيْكُمْ طُعْمَةً أَطْعَمَنِيهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَكِنْ إِنْ شِئْتُمْ دفعتُ إِليكم ثمنَه. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Sulaiman b. Abu ‘Abdallah said he saw Sa'd b. Abu Waqqas seize a man who was hunting in the sacred territory of Medina which God’s messenger had declared to be sacred and take away his clothes from him. His patrons came to him and spoke to him about it, but he replied, “God’s messenger declared this sacred territory to be sacred, saying that if anyone caught someone hunting in it he should take from him what he had, so I will not return to you a provision which God’s messenger has given me; but if you wish I shall pay you its value.” \n\nAbu Dawud transmitted it."}},{"id":237,"idInBook":237,"chapterId":10,"bookId":14,"arabic":"وَعَنْ صَالِحٍ مَوْلًى لِسَعْدٍ أَنَّ سَعْدًا وَجَدَ عَبِيدًا مِنْ عَبِيدِ الْمَدِينَةِ يَقْطَعُونَ مِنْ شَجَرِ الْمَدِينَةِ فَأَخَذَ مَتَاعَهُمْ وَقَالَ يَعْنِي لِمَوَالِيهِمْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ينْهَى أَنْ يُقْطَعَ مِنْ شَجَرِ الْمَدِينَةِ شَيْءٌ وَقَالَ: «مَنْ قَطَعَ مِنْهُ شَيْئًا فَلِمَنْ أَخَذَهُ سَلَبُهُ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Salih, a client of Sa'd, said that Sa'd found some of the slaves of Medina cutting down some of the trees of Medina and took away their equipment. He then said, i.e. to their owners, that he had heard God's messenger prohibiting the cutting of any of the trees of Medina and saying, “If anyone cuts any of them, what is taken from him goes to the one who seizes him.\" \n\nAbu Dawud transmitted it."}},{"id":238,"idInBook":238,"chapterId":10,"bookId":14,"arabic":"وَعَنِ الزُّبَيْرِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ صَيْدَ وَجٍّ وَعِضَاهَهُ حِرْمٌ مُحَرَّمٌ لِلَّهِ» . رَوَاهُ أَبُو دَاوُدَ وَقَالَ مُحْيِي السُّنَّةِ: «وَجٌّ» ذَكَرُوا أَنَّهَا مِنْ نَاحِيَةِ الطَّائِف وَقَالَ الْخطابِيّ: «إِنَّه» بدل «إِنَّهَا»","english":{"narrator":"","text":"Az-Zubair reported God’s messenger as saying, “The game and large thorn trees of Wajj are sacred being declared a sacred belonging of God.\" \n\nAbu Dawud transmitted it. Muhyi as-Sunna said Wajj was mentioned by some as being in the neighbourhood of at-Ta’if. (There is another sentence here which cannot easily be fitted in with the translation. It says that al-Khattabi used annahu in place of annaha. In the preceding phrase annaha is used with reference to Wajj. The point of the extra sentence is that al-Khattabi used the masculine pronominal suffix in place of the feminine)"}},{"id":239,"idInBook":239,"chapterId":10,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنِ اسْتَطَاعَ أَنْ يَمُوت بالمدية فليمت لَهَا فَإِنِّي أَشْفَعُ لِمَنْ يَمُوتُ بِهَا» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ حَسَنٌ صَحِيح غَرِيب إِسْنَادًا","english":{"narrator":"","text":"Ibn ‘Umar reported God’s messenger as saying, “Let him who can die in Medina, for I shall intercede for those who die in it.\" \n \nAhmad and Tirmidhi transmitted it, the latter saying this is a hasan  sahih tradition whose isnad is gharib."}},{"id":240,"idInBook":240,"chapterId":10,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «آخِرُ قَرْيَةٍ مِنْ قُرَى الْإِسْلَامِ خَرَابًا الْمَدِينَةُ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “The last of the towns of Islam to become a ruin will be Medina,\" \n\nTirmidhi transmitted it, saying this is a hasan gharib tradition."}},{"id":241,"idInBook":241,"chapterId":10,"bookId":14,"arabic":"وَعَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" إِنَّ اللَّهَ أَوْحَى إِلَيَّ: أَيَّ هَؤُلَاءِ الثَّلَاثَةِ نَزَلْتَ فَهِيَ دَارُ هِجْرَتِكَ الْمَدِينَةِ أَوِ الْبَحْرَيْنِ أَوْ قِنَّسْرِينَ \". رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"Jarir b. ‘Abdallah reported the Prophet as saying, “God revealed to me that whichever of these three I settled in, it would be the abode of my emigration:","text":"Medina, al-Bahrain, (In eastern Arabia, on the Persian Gulf)* or Qinnasrin.\"(In Syria)\n\nTirmidhi transmitted it."}},{"id":242,"idInBook":242,"chapterId":10,"bookId":14,"arabic":"عَنْ أَبِي بَكْرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يَدْخُلُ الْمَدِينَةَ رُعْبُ الْمَسِيحِ الدَّجَّالِ لَهَا يَوْمَئِذٍ سَبْعَةُ أَبْوَابٍ عَلَى كُلِّ بَابٍ مَلَكَانِ» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Abu Bakra reported the Prophet as saying, ‘‘The terror of the antichrist will not enter Medina. That day it will have seven gates with two angels at each gate.\" \n\nBukhari transmitted it."}},{"id":243,"idInBook":243,"chapterId":10,"bookId":14,"arabic":"وَعَنْ أَنَسٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «اللَّهُمَّ اجْعَلْ بِالْمَدِينَةِ ضِعفَي مَا جعلت بِمَكَّة من الْبركَة»","english":{"narrator":"","text":"Anas reported the Prophet as saying, “O God, put in Medina twice as much blessing as Thou hast put in Mecca.\" \n\nBukhari and Muslim."}},{"id":244,"idInBook":244,"chapterId":10,"bookId":14,"arabic":"وَعَنْ رَجُلٍ مِنْ آلِ الْخَطَّابِ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ زَارَنِي مُتَعَمِّدًا كَانَ فِي جِوَارِي يَوْمَ الْقِيَامَةِ وَمَنْ سَكَنَ الْمَدِينَةَ وَصَبَرَ عَلَى بَلَائِهَا كُنْتُ لَهُ شَهِيدًا وَشَفِيعًا يَوْمَ الْقِيَامَةِ وَمَنْ مَاتَ فِي أَحَدِ الْحَرَمَيْنِ بَعَثَهُ اللَّهُ مِنَ الْآمِنِينَ يَوْمَ الْقِيَامَة»\nوَعَنِ ابْنِ عُمَرَ مَرْفُوعًا: «مَنْ حَجَّ فَزَارَ قَبْرِي بَعْدَ مَوْتِي كَانَ كَمَنْ زَارَنِي فِي حَياتِي» . رَوَاهُمَا الْبَيْهَقِيّ فِي شعب الْإِيمَان","english":{"narrator":"","text":"A man of the family of al-Khattab reported the Prophet as saying, \"He who purposely comes to visit me will be under my protection on the day of resurrection; he who lives in Medina and endures its difficulty will have me as a witness and intercessor on the day of resurrection; and he who dies in one of the two sacred territories will be raised by God on the day of resurrection among those who will be safe.\"\n\nIbn ‘Umar traced the following back to the Prophet, \"He who performs the pilgrimage and visits my grave after my death will be like him who visited me in my lifetime.\" Baihaqi transmitted the two traditions in Shu’ab al-iman."}},{"id":245,"idInBook":245,"chapterId":10,"bookId":14,"arabic":"لإرساله وَعَنْ يَحْيَى بْنِ سَعِيدٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ جَالِسًا وَقَبْرٌ يُحْفَرُ بِالْمَدِينَةِ فَاطَّلَعَ رَجُلٌ فِي الْقَبْرِ فَقَالَ: بِئْسَ مَضْجَعِ الْمُؤْمِنِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «بئس مَا قُلْتَ» قَالَ الرَّجُلُ إِنِّي لَمْ أُرِدْ هَذَا إِنَّمَا أَرَدْتُ الْقَتْلَ فِي سَبِيلِ اللَّهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا مِثْلَ الْقَتْلِ فِي سَبِيلِ اللَّهِ مَا عَلَى الْأَرْضِ بُقْعَةٌ أَحَبُّ إِلَيَّ أَنْ يَكُونَ قَبْرِي بِهَا مِنْهَا» ثَلَاثَ مَرَّاتٍ. رَوَاهُ مَالِكٌ مُرْسَلًا","english":{"narrator":"","text":"Yahya b. Sa'id said that God’s messenger was sitting when a grave was being dug in Medina. A man looked down into the grave and said, \"What a bad-resting-place for a believer!\" God’s messenger thereupon retorted, \"What a bad thing you have said!\" and the man replied, \"I did not mean that; I meant that being killed in God’s path .\" God’s messenger said, \"Nothing compares with being killed in God’s path. There is no other region in the earth in which I would prefer my grave to be,\" saying it three times. \n\nMalik transmitted it in mursal form."}},{"id":246,"idInBook":246,"chapterId":10,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ عُمَرُ بْنُ الْخَطَّابِ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ بِوَادِي الْعَقِيقِ يَقُولُ: أَتَانِي اللَّيْلَةَ آتٍ مِنْ رَبِّي فَقَالَ: صَلِّ فِي هَذَا الْوَادِي الْمُبَارَكِ وَقُلْ: عُمْرَةٌ فِي حَجَّةٍ \". وَفِي رِوَايَة: «قل عُمرةٌ وحِجّةٌ» . رَوَاهُ الْبُخَارِيُّ","english":{"narrator":"","text":"Ibn ‘Abbas told that ‘Umar b. al-Khattab said he had heard God’s messenger say when he was in the wadi of al-‘Aqiq, \"A visitant from my Lord came to me last night, telling me to pray in this blessed wadi and  an ’umra  and a hajja” \n\nBukhari transmitted it."}}],"chapter":{"id":10,"bookId":14,"arabic":"كتاب المناسك","english":"The Rites of Pilgrimage"}}