{"metadata":{"length":274,"arabic":{"title":"مشكاة المصابيح","author":"الإمام الكاتب التبريزي","introduction":"كتاب البيوع"},"english":{"title":"Mishkat al-Masabih","author":"Al-Khatib Al-Tabrizi","introduction":"Business Transactions"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":11,"bookId":14,"arabic":"عَن الْمِقْدَاد بْنِ مَعْدِي كَرِبَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا أَكَلَ أَحَدٌ طَعَامًا قَطُّ خَيْرًا مِنْ أَنْ يَأْكُلَ مِنْ عَمَلِ يَدَيْهِ وَإِنَّ نَبِيَّ اللَّهِ دَاوُدَ عَلَيْهِ السَّلَامُ كَانَ يَأْكُلُ مِنْ عمل يَدَيْهِ» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Al-Miqdam b. Ma'dikarib reported God's Messenger as saying, “No one has ever eaten better food than what he eats as a result of the labour of his hands. God’s prophet David used to eat from what he had worked for with his hands.” \n\nBukhari transmitted it."}},{"id":2,"idInBook":2,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" إِنَّ اللَّهَ طَيِّبٌ لَا يَقْبَلُ إِلَّا طَيِّبًا وَأَنَّ اللَّهَ أَمَرَ المؤْمنينَ بِمَا أمرَ بِهِ المرسَلينَ فَقَالَ: (يَا أَيُّهَا الرُّسُلُ كُلُوا مِنَ الطَّيِّبَاتِ واعْمَلوا صَالحا)\nوَقَالَ: (يَا أَيُّهَا الَّذِينَ آمَنُوا كُلُوا مِنْ طَيِّبَاتِ مَا رَزَقْنَاكُمْ)\nثُمَّ ذَكَرَ الرَّجُلَ يُطِيلُ السَّفَرَ أَشْعَثَ أَغْبَرَ يَمُدُّ يَدَيْهِ إِلَى السَّمَاءِ: يَا رَبِّ يَا رَبِّ وَمَطْعَمُهُ حَرَامٌ وَمَشْرَبُهُ حَرَامٌ وَمَلْبَسُهُ حَرَامٌ وَغُذِّيَ بِالْحَرَامِ فَأَنَّى يُسْتَجَابُ لِذَلِكَ؟ \". رَوَاهُ مُسْلِمٌ","english":{"narrator":"Abu Huraira reported God’s Messenger as saying that:","text":"God is good and accepts only what is good, and He has given the same command to the believers as He has given to the Messengers, saying, “0 Messengers, eat of what is good and act righteously” (Al-Qur’an 23:51) and also, “You who believe, eat of the good things which We have provided for you” (Al-Qur’an 2:172). Then he mentioned a man who makes a long journey in a dishevelled and dusty state, who stretches out his hands to heaven saying, “My Lord, my Lord,” when his food, drink and clothing are of an unlawful nature, and he is nourished by what is unlawful, and asked how such a one could be given an answer. \n\nMuslim transmitted it."}},{"id":3,"idInBook":3,"chapterId":11,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَأْتِي عَلَى النَّاسِ زَمَانٌ لَا يُبَالِي الْمَرْءُ مَا أَخَذَ مِنْهُ أَمِنَ الْحَلَالِ أم من الْحَرَام» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"He reported God's Messenger as saying, “A time will come to mankind when a man will not care whether what he gets comes from a lawful or an unlawful source.” \n\nBukhari transmitted it."}},{"id":4,"idInBook":4,"chapterId":11,"bookId":14,"arabic":"وَعَنِ النُّعْمَانِ بْنِ بَشِيرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْحَلَالُ بَيِّنٌ وَالْحَرَامُ بَيِّنٌ وَبَيْنَهُمَا مُشْتَبِهَاتٌ لَا يَعْلَمُهُنَّ كَثِيرٌ مِنَ النَّاسِ فَمَنِ اتَّقَى الشبهاب استبرَأَ لدِينهِ وعِرْضِهِ ومَنْ وقَعَ فِي الشبُّهَاتِ وَقَعَ فِي الْحَرَامِ كَالرَّاعِي يَرْعَى حَوْلَ الْحِمَى يُوشِكُ أَنْ يَرْتَعَ فِيهِ أَلَا وَإِنَّ لِكُلِّ مَلِكٍ حِمًى أَلَا وَإِنَّ حِمَى اللَّهِ مَحَارِمُهُ أَلَا وَإِنَّ فِي الْجَسَدِ مُضْغَةً إِذَا صَلَحَتْ صَلَحَ الْجَسَدُ كُلُّهُ وَإِذَا فَسَدَتْ فَسَدَ الْجَسَدُ كُله أَلا وَهِي الْقلب»","english":{"narrator":"","text":"An-Nu'man b. Bashir reported God's Messenger as saying, “What is lawful is clear and what is unlawful is clear, but between them are certain doubtful things which many people do not recognize. He who guards against doubtful things keeps his religion and his honour blameless, but he who falls into doubtful things falls into what is unlawful, just as a shepherd who pastures his animals round a preserve will soon pasture them in it. Every king has a preserve, and God’s preserve is the things He has declared unlawful. In the body there is a piece of flesh, and the whole body is sound if it is sound, but the whole body is corrupt if it is corrupt. It is the heart.” \n\n(Bukhari and Muslim.)"}},{"id":5,"idInBook":5,"chapterId":11,"bookId":14,"arabic":"وَعَنْ رَافِعِ بْنِ خَدِيجٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «ثَمَنُ الْكَلْبِ خَبِيثٌ وَمَهْرُ الْبَغِيِّ خَبِيثٌ وَكَسْبُ الْحَجَّامِ خَبِيثٌ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Rafi' b. Khadij reported God’s Messenger as saying, \"The price paid for a dog is impure, the hire paid to a prostitute is impure, and the earnings of a cupper are impure.” \n\nMuslim transmitted it."}},{"id":6,"idInBook":6,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَبِي مَسْعُودٍ الْأَنْصَارِيِّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ ثَمَنِ الْكَلْبِ وَمَهْرِ الْبَغِيِّ وَحُلْوَانِ الْكَاهِنِ","english":{"narrator":"","text":"Abu Mas'ud al-Ansari said that God’s Messenger forbade the price paid for a dog, the hire paid to a prostitute, and the gift given to a soothsayer. \n\n(Bukhari and Muslim.)"}},{"id":7,"idInBook":7,"chapterId":11,"bookId":14,"arabic":"وَعَن أبي حجيفة أَنَّ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ ثَمَنِ الدَّمِ وَثَمَنِ الْكَلْبِ وَكَسْبِ الْبَغِيِّ وَلَعَنَ آكِلَ الرِّبَا وَمُوكِلَهُ وَالْوَاشِمَةَ وَالْمُسْتَوْشِمَةَ وَالْمُصَوِّرَ. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Aba Juhaifa said that the Prophet forbade the price paid for blood1, the price paid for a dog, and the earnings of a prostitute, and cursed him who accepted and him who paid usury, him who tattooed and him who had himself tattooed, and the sculptor2.\n\nBukhari transmitted it.\n\n1. This refers to the blood of an animal.\n2. Musawwir. The meaning is more comprehensive than any English word. It also means “painter”, or anyone who produces representations of living beings."}},{"id":8,"idInBook":8,"chapterId":11,"bookId":14,"arabic":"وَعَنْ جَابِرٍ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ عَامَ الْفَتْحِ وَهُوَ بِمَكَّةَ: «إِنَّ اللَّهَ وَرَسُولَهُ حَرَّمَ بَيْعَ الْخَمْرِ وَالْمَيْتَةِ وَالْخِنْزِيرِ وَالْأَصْنَامِ» . فَقِيلَ: يَا رَسُولَ اللَّهِ أَرَأَيْتَ شُحُومَ الْمَيْتَةِ؟ فَإِنَّهُ تُطْلَى بِهَا السُّفُنُ وَيُدْهَنُ بِهَا الْجُلُودُ وَيَسْتَصْبِحُ بِهَا النَّاسُ؟ فَقَالَ: «لَا هُوَ حَرَامٌ» . ثُمَّ قَالَ عِنْدَ ذَلِكَ: «قَاتَلَ اللَّهُ الْيَهُودَ إِنَّ اللَّهَ لَمَّا حَرَّمَ شُحُومَهَا أَجْمَلُوهُ ثُمَّ بَاعُوهُ فَأَكَلُوا ثَمَنَهُ»","english":{"narrator":"","text":"Jabir said he heard God’s Messenger say in the year of the Conquest when he was in Mecca, \"God and His Messenger have declared forbidden the sale of wine, animals which have died a natural death, swine and idols.” He was asked what he thought of the fat of animals which had died a natural death, for it was used for caulking ships, greasing skins, and making oil for lamps, and after saying that it was unlawful he added, \"God curse the Jews! When He declared the fat of such animals unlawful they melted it, then sold it and enjoyed the price they received. “ \n\n(Bukhari and Muslim.)"}},{"id":9,"idInBook":9,"chapterId":11,"bookId":14,"arabic":"وَعَنْ عُمَرَ رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى الله عَلَيْهِ وَسلم قَالَ: «قَاتَلَ اللَّهُ الْيَهُودَ حُرِّمَتْ عَلَيْهِمُ الشُّحُومُ فجملوها فَبَاعُوهَا»","english":{"narrator":"","text":"‘Umar reported God’s Messenger as saying, \"God curse the Jews! Fats were declared unlawful for them, but they melted them and sold them.” \n\n(Bukhari and Muslim.)"}},{"id":10,"idInBook":10,"chapterId":11,"bookId":14,"arabic":"وَعَنْ جَابِرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ ثَمَنِ الْكَلْبِ وَالسِّنَّوْرِ. رَوَاهُ مُسلم","english":{"narrator":"","text":"Jabir said the God’s Messenger forbade payment for dogs and cats. \n\nMuslim transmitted it."}},{"id":11,"idInBook":11,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَنَسٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: حَجَمَ أَبُو طَيْبَةَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأُمِرَ لَهُ بِصَاعٍ مِنْ تَمْرٍ وَأَمَرَ أَهْلَهُ أَنْ يُخَفِّفُوا عَنْهُ مِنْ خراجه","english":{"narrator":"","text":"Anas said that Abu Taiba cupped God’s Messenger and he ordered that sa’ of dates be given him, also ordering his people to remit some of his dues.* \n\n* Abu Taiba was a client of the B. Haritha. It was the custom for a slave to hand over to his master part of what he earned. Here the Prophet suggests that the masters of Abu Taiba should reduce the amount they took from him.\n\n(Bukhari and Muslim.)"}},{"id":12,"idInBook":12,"chapterId":11,"bookId":14,"arabic":"عَنْ عَائِشَةَ قَالَتْ: قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ أَطْيَبَ مَا أَكَلْتُمْ مِنْ كَسْبِكُمْ وَإِنَّ أَوْلَادَكُمْ مِنْ كَسْبِكُمْ» . رَوَاهُ التِّرْمِذِيُّ وَالنَّسَائِيُّ وَابْنُ مَاجَهْ. وَفِي رِوَايَةِ أَبِي دَاوُدَ وَالدَّارِمِيِّ: «إِنَّ أَطْيَبَ مَا أَكَلَ الرَّجُلُ مِنْ كَسْبِهِ وَإِنَّ وَلَده من كَسبه»","english":{"narrator":"‘A'isha reported the Prophet as saying, “The pleasantest things you enjoy come from what you earn, and your children come from what you earn”*. The version of Aba Dawud and Darimi has, “The pleasantest things a man enjoys come from what he earns and his child comes from what he earns.”\n\nTirmidhi, Nasa’i and Ibn Majah transmitted it.\n\n*Or “are a part of your earnings.” The phrase expresses two ideas:","text":"the children are the result of marriage, and parents who are in need may receive support from their children."}},{"id":13,"idInBook":13,"chapterId":11,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يكْسب عبد مَال حرَام فتيصدق مِنْهُ فَيُقْبَلُ مِنْهُ وَلَا يُنْفِقُ مِنْهُ فَيُبَارَكُ لَهُ فِيهِ وَلَا يَتْرُكُهُ خَلْفَ ظَهْرِهِ إِلَّا كَانَ زَادَهُ إِلَى النَّارِ. إِنَّ اللَّهَ لَا يَمْحُو السَّيِّئَ بِالسَّيِّئِ وَلَكِنْ يَمْحُو السَّيِّئَ بِالْحَسَنِ إِنَّ الْخَبِيثَ لَا يَمْحُو الْخَبِيثَ» . رَوَاهُ أَحْمَدُ وَكَذَا فِي شرح السّنة","english":{"narrator":"","text":"‘Abdallah b. Mas'ud reported God’s Messenger as saying, “No man who acquires unlawful property and gives some of it in alms will have it accepted from him; neither will he receive a blessing for it if he con-tributes some of it; and if he leaves some of it behind him (i.e. when he dies) it will be his provision for hell. God does not obliterate an evil deed by an evil one, but He obliterates an evil deed by a good one. What is impure does not obliterate what is impure.” \n\nAhmad transmitted it, and the same is given in Sharh as-sunna."}},{"id":14,"idInBook":14,"chapterId":11,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَدْخُلُ الْجَنَّةَ لَحْمٌ نبَتَ منَ السُّحْتِ وكلُّ لحمٍ نبَتَ منَ السُّحْتِ كَانَتِ النَّارُ أَوْلَى بِهِ» . رَوَاهُ أَحْمَدُ وَالدَّارِمِيُّ وَالْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَانِ","english":{"narrator":"","text":"Jabir reported God’s Messenger as saying, “Flesh which has grown out of what is unlawful will not enter paradise*, but hell is more fitting for all flesh which has grown out of what is unlawful.” \n\nAhmad, Darimi, and Baihaqi, in Shu'ab al-iman, transmitted it.\n\n*The reference here is to people who live on unlawful source of income."}},{"id":15,"idInBook":15,"chapterId":11,"bookId":14,"arabic":"وَعَنِ الْحَسَنِ بْنِ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: حَفِظْتُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «دَعْ مَا يَرِيبُكَ إِلَى مَا لَا يَرِيبُكَ فَإِنَّ الصِّدْقَ طُمَأْنِينَةٌ وَإِنَّ الْكَذِبَ رِيبَةٌ» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَالنَّسَائِيُّ وَرَوَى الدَّارِمِيُّ الْفَصْل الأول","english":{"narrator":"Al-Hasan b. ‘Ali said:","text":"I have retained in my memory these words of God's Messenger, “Leave what causes you doubt and turn to what does not cause you doubt. Truth is tranquility, but falsehood is doubt.” \n\nAhmad, Tirmidhi and Nasa’i transmitted it, and Darimi transmitted the first part."}},{"id":16,"idInBook":16,"chapterId":11,"bookId":14,"arabic":"وَعَن وابصَةَ بن مَعْبدٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «يَا وَابِصَةُ جِئْتَ تَسْأَلُ عَنِ الْبِرِّ وَالْإِثْمِ؟» قُلْتُ: نَعَمْ قَالَ: فَجَمَعَ أَصَابِعَهُ فَضَرَبَ صَدْرَهُ وَقَالَ: «اسْتَفْتِ نَفْسَكَ اسْتَفْتِ قَلْبَكَ» ثَلَاثًا «الْبِرُّ مَا اطْمَأَنَّتْ إِلَيْهِ النَّفْسُ وَاطْمَأَنَّ إِلَيْهِ الْقَلْبُ وَالْإِثْمُ مَا حَاكَ فِي النَّفْسِ وَتَرَدَّدَ فِي الصَّدْرِ وَإِنْ أَفْتَاكَ النَّاسُ» . رَوَاهُ أَحْمَدُ والدارمي","english":{"narrator":"","text":"Wabisa b. Ma'bad reported God’s Messenger as saying, “Have you come to ask about righteousness and sin, Wabisa?” When he replied that he had, he joined his fingers and striking his breast with them said, “Ask yourself for a decision, ask your heart for a decision (saying it three times). Righteousness is that with which the soul is tranquil and the heart is tranquil, but sin is that which rouses suspicion in the soul and is perplexing in the breast, even if people give you a decision in its favour.” \n\nAhmad and Darimi transmitted it."}},{"id":17,"idInBook":17,"chapterId":11,"bookId":14,"arabic":"وَعَن عطيَّةَ السَّعدِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَبْلُغُ الْعَبْدُ أَنْ يَكُونَ مِنَ المتَّقينَ حَتَّى يدَعَ مَا لَا بَأْسَ بِهِ حَذَرًا لِمَا بِهِ بأسٌ» . رَوَاهُ التِّرْمِذِيّ وابنُ مَاجَه","english":{"narrator":"","text":"'Atiya as-Sa'di reported God's Messenger as saying, \"No one will attain to being one of the pious till he abandons things which are harmless through being on his guard against what is harmful.\" \n\nTirmidhi and Ibn Majah transmitted it."}},{"id":18,"idInBook":18,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: لَعَنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْخَمْرِ عَشَرَةً: عَاصِرَهَا وَمُعْتَصِرَهَا وَشَارِبَهَا وَحَامِلَهَا وَالْمَحْمُولَةَ إِلَيْهِ وَسَاقِيَهَا وَبَائِعَهَا وَآكِلَ ثَمَنِهَا وَالْمُشْتَرِي لَهَا وَالْمُشْتَرَى لَهُ. رَوَاهُ التِّرْمِذِيّ وَابْن مَاجَه","english":{"narrator":"Anas said that God’s Messenger cursed ten people in connection with wine:","text":"the wine-presser, the one who has it pressed, the one who drinks it, the one who conveys it, the one to whom it is conveyed, the one who serves it, the one who sells it, the one who benefits from the price paid for it, the one who buys it, and the one for whom it is bought. \n\nTirmidhi and Ibn Majah transmitted it."}},{"id":19,"idInBook":19,"chapterId":11,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَعَنَ اللَّهُ الْخَمْرَ وَشَارِبَهَا وَسَاقَيَهَا وَبَائِعَهَا وَمُبْتَاعَهَا وَعَاصِرَهَا وَمُعْتَصِرَهَا وَحَامِلَهَا وَالْمَحْمُولَةَ إِلَيْهِ» . رَوَاهُ أَبُو دَاوُدَ وَابْنُ مَاجَهْ","english":{"narrator":"","text":"Ibn 'Umar reported God's Messenger as saying, \"God has cursed* wine, its drinker, its server, its seller, its buyer, its presser, the one for whom it is pressed, the one who conveys it and the one to whom it is conveyed.\" \n\nAbu Dawud and Ibn Majah transmitted it.\n\n* This might equally well be translated \"God curse ...” as the perfect expresses both past time and a wish."}},{"id":20,"idInBook":20,"chapterId":11,"bookId":14,"arabic":"وَعَن محيصة أَنَّهُ اسْتَأْذَنَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي أُجْرَةِ الْحَجَّامِ فَنَهَاهُ فَلَمْ يَزَلْ يَسْتَأْذِنُهُ حَتَّى قَالَ: «اعْلِفْهُ نَاضِحَكَ وَأَطْعِمْهُ رَقِيقَكَ» . رَوَاهُ مَالِكٌ وَالتِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ","english":{"narrator":"","text":"Muhayyisa said he asked permission of God's Messenger regarding the hire of the cupper, but he forbade him. He kept on asking his permission, and at last he said, \"Feed your watering-camel with it and feed your slaves with it.\"*\n\nMalik, Tirmidhi, Abu Dawud and Ibn Majah transmitted it.\n\n* Ibn Abd al-Barr (Isti'ab, p. 286) says Muhayyisa had a slave called Nafi' Abu Taiba who was a cupper. On p. 654 he says the name of Abu Taiba was Dinar, or Nafi', or Maisara, but God knows best. In this tradition Muhayyisa is told that he may not apply to his private use anything earned by his slave for cupping."}},{"id":21,"idInBook":21,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ثَمَنِ الْكَلْبِ وكسْبِ الزَّمارةِ. رَوَاهُ فِي شرح السّنة","english":{"narrator":"","text":"Abu Huraira said God's Messenger prohibited payment for a dog and the earnings of the prostitute*. \n* Zammara. This word is said by a number of authorities to mean a prostitute, but it can also mean a woman who plays the oboe (mizmar).\n\nIt is transmitted in Sharh as-sunna."}},{"id":22,"idInBook":22,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَبِي أُمَامَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" لَا تَبِيعُوا الْقَيْنَاتِ وَلَا تَشْتَرُوهُنَّ وَلَا تُعَلِّمُوهُنَّ وَثَمَنُهُنَّ حَرَامٌ وَفِي مِثْلِ هَذَا نَزَلَتْ: (وَمِنَ النَّاسِ مَنْ يَشْتَرِي لهْوَ الحَديثِ)\nرَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَابْنُ مَاجَهْ وَقَالَ التِّرْمِذِيُّ هَذَا حَدِيثٌ غَرِيبٌ وَعلي بن يزِيد الرواي يُضَعَّفُ فِي الْحَدِيثِ","english":{"narrator":"Abu Umama reported God’s Messenger as saying:","text":"\"Do not sell, buy or teach singing-girls, and the price paid for them is unlawful. To similar effect has been sent down, 'Among men are those who purchase frivolous talk' (Al-Qur'an 31:6).\n\nAhmad, Tirmidhi and Ibn Majah transmitted it, Tirmidhi saying that this is a gharib tradition and that ‘Ali b. Yazid the transmitter is declared to be a weak traditionist."}},{"id":23,"idInBook":23,"chapterId":11,"bookId":14,"arabic":"عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «طَلَبُ كَسْبِ الْحَلَالِ فَرِيضَةٌ بَعْدَ الْفَرِيضَةِ» . رَوَاهُ الْبَيْهَقِيُّ فِي شعب الْإِيمَان","english":{"narrator":"","text":"‘Abdallah b. Mas'ud reported God's Messenger as saying, “Trying to earn a lawful livelihood is an obligatory duty in addition to the duties which are obligatory.” \n\nBaihaqi transmitted it in Shu’ab al-iman."}},{"id":24,"idInBook":24,"chapterId":11,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا أَنَّهُ سُئِلَ عَنْ أُجْرَةِ كِتَابَةِ الْمُصْحَفِ فَقَالَ: لَا بَأْسَ إِنَّمَا هُمْ مُصَوِّرُونَ وَإِنَّهُمْ إِنَّمَا يَأْكُلُونَ من عمل أَيْديهم. رَوَاهُ رزين","english":{"narrator":"","text":"Ibn ‘Abbas was asked about payment for writing a copy of the Qur’an and replied, “There is no harm. They are just people who draw figures and get a living simply by their handiwork.” \n\nRazin transmitted it."}},{"id":25,"idInBook":25,"chapterId":11,"bookId":14,"arabic":"وَعَنْ رَافِعِ بْنِ خَدِيجٍ قَالَ: قِيلَ: يَا رَسُولَ اللَّهِ أَيُّ الْكَسْبِ أَطْيَبُ؟ قَالَ: «عَمَلُ الرَّجُلِ بِيَدِهِ وَكُلُّ بَيْعٍ مَبْرُورٍ» . رَوَاهُ أَحْمَدُ","english":{"narrator":"","text":"Rafi' b. Khadij said God's Messenger was asked what type of earning was best and replied, “A man’s work with his hand and every business transaction which is approved.”\n\nAhmad transmitted it."}},{"id":26,"idInBook":26,"chapterId":11,"bookId":14,"arabic":"وَعَن أبي بكرِ بنِ أبي مريمَ قَالَ: كَانَتْ لِمِقْدَامِ بْنِ مَعْدِي كَرِبَ جَارِيَةٌ تَبِيعُ اللَّبَنَ وَيَقْبِضُ الْمِقْدَامُ ثَمَنَهُ فَقِيلَ لَهُ: سُبْحَانَ اللَّهِ أَتَبِيعُ اللَّبَنَ؟ وَتَقْبِضُ الثَّمَنَ؟ فَقَالَ نَعَمْ وَمَا بَأْسٌ بِذَلِكَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَيَأْتِيَنَّ عَلَى النَّاسِ زَمَانٌ لَا يَنْفَعُ فِيهِ إِلَّا الدِّينَارُ وَالدِّرْهَم» . رَوَاهُ أَحْمد","english":{"narrator":"","text":"Abu Bakr b. Aba Maryam said that Miqdam b. Ma'dikarib had a slave girl who sold milk the price of which was taken by Miqdam. Some people said, “Glory be to God! Do you sell milk and accept what is paid for it?” He replied that he did, and asked what harm there was in that, for he had heard God’s Messenger say, “A time is certainly coming to mankind when only the dinar and the dirham will be of use.” \n\nAhmad transmitted it."}},{"id":27,"idInBook":27,"chapterId":11,"bookId":14,"arabic":"وَعَنْ نَافِعٍ قَالَ: كُنْتُ أُجَهِّزُ إِلَى الشَّامِ وَإِلَى مِصْرَ فَجَهَّزْتُ إِلَى الْعِرَاقِ فَأَتَيْتُ إِلَى أُمِّ الْمُؤْمِنِينَ عَائِشَةَ فَقُلْتُ لَهَا: يَا أُمَّ الْمُؤْمِنِينَ كُنْتُ أُجَهِّزُ إِلَى الشَّامِ فَجَهَّزْتُ إِلَى العراقِ فقالتْ: لَا تفعلْ مالكَ وَلِمَتْجَرِكَ؟ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِذَا سَبَّبَ اللَّهُ لِأَحَدِكُمْ رِزْقًا مِنْ وَجْهٍ فَلَا يَدَعْهُ حَتَّى يَتَغَيَّرَ لَهُ أَوْ يَتَنَكَّرَ لَهُ» . رَوَاهُ أَحْمَدُ وَابْنُ مَاجَه","english":{"narrator":"","text":"Nafi' said he used to fit out business expeditions to Syria and to Egypt. Having fitted out one to ‘Iraq he went to ‘A’isha, the mother of the faithful, and told her that he had been accustomed to fit out expeditions to Syria, and now he had done so to ‘Iraq. She told him not to do so, asking him what was the matter with the place with which he had traded, for she had heard God's Messenger say, “When God has appointed provision for any of you in a particular direction he should not give it up till it changes for the worse.”* \n\nAhmad and Ibn Majah transmitted it.\n\n* Alternatives are given for this last phrase. They amount to the same thing, and so it may be understood that there was doubt as to which word was used. It reads hatta yataghayyara lahu au yatanahhara lahu. But it has been suggested that the first verb refers to lack of profit and the second to loss of capital. Cf. Mirqat, iii, 299."}},{"id":28,"idInBook":28,"chapterId":11,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ قَالَتْ: كَانَ لِأَبِي بَكْرٍ رَضِيَ اللَّهُ عَنْهُ غُلَامٌ يُخْرِّجُ لَهُ الْخَرَاجَ فَكَانَ أَبُو بَكْرٍ يَأْكُلُ مِنْ خَرَاجِهِ فَجَاءَ يَوْمًا بشيءٍ فأكلَ مِنْهُ أَبُو بَكْرٍ فَقَالَ لَهُ الْغُلَامُ: تَدْرِي مَا هَذَا؟ فَقَالَ أَبُو بَكْرٍ: وَمَا هُوَ؟ قَالَ: كُنْتُ تَكَهَّنْتُ لِإِنْسَانٍ فِي الْجَاهِلِيَّةِ وَمَا أُحسِنُ الكهَانةَ إِلاَّ أَنِّي خدَعتُه فلَقيَني فَأَعْطَانِي بِذَلِكَ فَهَذَا الَّذِي أَكَلْتَ مِنْهُ قَالَتْ: فَأَدْخَلَ أَبُو بَكْرٍ يَدَهُ فَقَاءَ كُلَّ شَيْءٍ فِي بَطْنه. رَوَاهُ البُخَارِيّ","english":{"narrator":"'A’isha said:","text":"Abu Bakr had a slave who brought him his earnings\t and Abu Bakr would eat* some of his earnings. One day he brought him something and when Abu Bakr had eaten some of it the slave asked him whether he knew what it was. Abu Bakr asked what it was, and he replied, \"I acted as a soothsayer for a man in the pre-Islamic period, and not being good at it, I deceived him; but he met me and gave me that, so this is the thing of which you have eaten.” She said that Abu Bakr then put his hand in his mouth and vomited everything which was in his stomach. \n\nBukhari transmitted it.\n\n* Here the word is used in its literal sense. Elsewhere the word is often translated by \"enjoy when it is not clear that something is actually eaten.”"}},{"id":29,"idInBook":29,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَبِي بَكْرٍ رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يَدْخُلُ الْجَنَّةَ جَسَدٌ غُذِّيَ بالحرَامِ» . رَوَاهُ الْبَيْهَقِيّ فِي شعب الْإِيمَان","english":{"narrator":"","text":"Abu Bakr reported God’s Messenger as saying, “Nobody which has been nourished with what is unlawful will enter paradise.” \n\nBaihaqi transmitted it in Shu'ab al-iman."}},{"id":30,"idInBook":30,"chapterId":11,"bookId":14,"arabic":"وَعَنْ زَيْدِ بْنِ أَسْلَمَ أَنَّهُ قَالَ: شَرِبَ عمر بن الْخطاب لَبَنًا وَأَعْجَبَهُ وَقَالَ لِلَّذِي سَقَاهُ: مَنْ أَيْنَ لَكَ هَذَا اللَّبَنُ؟ فَأَخْبَرَهُ أَنَّهُ وَرَدَ عَلَى مَاءٍ قَدْ سَمَّاهُ فَإِذَا نَعَمٌ مِنْ نَعَمِ الصَّدَقَةِ وَهُمْ يَسْقُونَ فَحَلَبُوا لِي مِنْ أَلْبَانِهَا فَجَعَلْتُهُ فِي سِقَائِيَ وَهُو هَذَا فَأَدْخَلَ عُمَرُ يَدَهُ فاسْتقاءَه. رَوَاهُ الْبَيْهَقِيّ فِي شعب الْإِيمَان","english":{"narrator":"","text":"Zaid b. Aslam said that 'Umar b. al-Khattab drank some milk which pleased him and asked the one who had given him the drink where he had got that milk from. He informed him that he had gone down to a watering-place which he named where there were some of the camels of the sadaqa. The people who were watering the camels had drawn some milk for him which he had put in his milk-skin, and that was what he had given him. ‘Umar then put his hand in his mouth and vomited it. \n\nBaihaqi transmitted it in Shu'ab al-iman."}},{"id":31,"idInBook":31,"chapterId":11,"bookId":14,"arabic":"وَعَن ابنِ عُمَرَ قَالَ: مَنِ اشْتَرَى ثَوْبًا بِعَشَرَةِ دَرَاهِمَ وَفِيهِ دِرْهَمٌ حَرَامٌ لَمْ يَقْبَلِ اللَّهُ لَهَ صَلَاةً مَا دَامَ عَلَيْهِ ثُمَّ أَدْخَلَ أُصْبَعَيْهِ فِي أُذُنَيْهِ وَقَالَ صُمَّتَا إِنْ لَمْ يَكُنِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَمِعْتُهُ يَقُولُهُ. رَوَاهُ أَحْمَدُ وَالْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَانِ. وَقَالَ: إِسْنَادُهُ ضَعِيف","english":{"narrator":"","text":"Ibn 'Umar said that if anyone buys a garment for ten dirhams among which is one unlawfully acquired, God most high will not accept prayer from him as long as he wears it. He then put a finger in each ear and said, “May they become deaf if the Prophet was not the one I heard say it!” \n\nBaihaqi transmitted it in Shu'ab al-iman, saying that its isnad is weak."}},{"id":32,"idInBook":32,"chapterId":11,"bookId":14,"arabic":"عَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:\nرَحِمَ اللَّهُ رَجُلًا سَمْحًا إِذَا بَاعَ وَإِذَا اشْتَرَى وَإِذَا اقْتَضَى\nرَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Jabir reported God's Messenger as saying, “God show mercy to a man who is kindly when he sells, when he buys, and when he makes a claim!” \n\nBukhari transmitted it."}},{"id":33,"idInBook":33,"chapterId":11,"bookId":14,"arabic":"وَعَنْ حُذَيْفَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" إِنَّ رَجُلًا كَانَ فِيمَنْ قَبْلَكُمْ أَتَاهُ الْمَلَكُ لِيَقْبِضَ رُوحَهُ فَقيل لَهُ: هَل علمت مَنْ خَيْرٍ؟ قَالَ: مَا أَعْلَمُ. قِيلَ لَهُ انْظُرْ قَالَ: مَا أَعْلَمُ شَيْئًا غَيْرَ أَنِّي كُنْتُ أُبَايِعُ النَّاسَ فِي الدُّنْيَا وَأُجَازِيهِمْ فَأُنْظِرُ الْمُوسِرَ وَأَتَجَاوَزُ عَنِ الْمُعْسِرِ فَأَدْخَلَهُ اللَّهُ الْجَنَّةَ \"\nوَفِي رِوَايَةٍ لِمُسْلِمٍ نَحْوَهُ عَنْ عُقْبَةَ بْنِ عَامِرٍ وَأَبِي مَسْعُودٍ الْأَنْصَارِيِّ «فَقَالَ اللَّهُ أَنَا أَحَق بذا مِنْك تجاوزوا عَن عَبدِي»","english":{"narrator":"","text":"Hudhaifa reported God’s Messenger as saying, “Before your time there was a man to whom the angel came to take his spirit, and he was asked whether he had done anything good. On his replying that he did not know, he was told to consider, and then said that the only thing he knew was that he used to have business dealings with people in the world and would demand his rights from them, giving the rich time to pay and letting the poor off. So God brought him into paradise.” In a version by Muslim there is something similar on the authority of ‘Uqba b. ‘Amir and Abu Mas'ud al-Ansari. God said, “I have more right to do this than you. Forgive my servant.”\n\n(Bukhari and Muslim)."}},{"id":34,"idInBook":34,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَبِي قَتَادَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ «إِيَّاكُمْ وَكَثْرَةَ الْحَلِفِ فِي الْبَيْعِ فَإِنَّهُ يُنَفِّقُ ثُمَّ يَمْحَقُ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Qatada reported God’s Messenger as saying, “Avoid much swearing while transacting business, for it produces a ready sale then blots out the blessing.” \n\nMuslim transmitted it."}},{"id":35,"idInBook":35,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «الْحلف منفقعة للسلعة ممحقة للبركة»","english":{"narrator":"","text":"Abu Huraira said he heard God's Messenger say, “Swearing produces a ready sale for a commodity, but blots out the blessing.” \n\n(Bukhari and Muslim.)"}},{"id":36,"idInBook":36,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَبِي ذَرٍّ رَضِيَ اللَّهُ عَنْهُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «ثَلَاثَةٌ لَا يُكَلِّمُهُمُ اللَّهُ يَوْمَ الْقِيَامَةِ وَلَا يَنْظُرُ إِلَيْهِمْ وَلَا يُزَكِّيهِمْ وَلَهُمْ عَذَابٌ أَلِيمٌ» . قَالَ أَبُو ذَرٍّ: خَابُوا وَخَسِرُوا مَنْ هُمْ يَا رَسُولَ اللَّهِ؟ قَالَ: «الْمُسْبِلُ وَالْمَنَّانٌ وَالْمُنَفِّقُ سِلْعَتَهُ بِالْحلف الْكَاذِب» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Dharr reported the Prophet as saying, “There are three to whom God will not speak on the day of resurrection, at whom He will not look, and whom He will not declare pure, and they will have a painful punishment.” Abu Dharr said, “They are losers and disappointed. Who are they, Messenger of God?” He replied, “The one who wears a trailing robe, the one who takes account of what he gives*, and the one who produces a ready sale of a commodity by false swearing.” \n\nMuslim transmitted it.\n\n* This is the type of person who keeps reminding people of his generosity to them."}},{"id":37,"idInBook":37,"chapterId":11,"bookId":14,"arabic":"عَنْ أَبِي سَعِيدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «التَّاجِرُ الصَّدُوقُ الْأَمِينُ معَ النبِّيِينَ والصِّدِّيقينَ والشهداءِ» . رَوَاهُ التِّرْمِذِيّ وَالدَّارَقُطْنِيّ.\nوَرَوَاهُ ابْنُ مَاجَهْ عَنِ ابْنِ عُمَرَ. وَقَالَ التِّرْمِذِيّ: هَذَا حَدِيث غَرِيب","english":{"narrator":"","text":"Aba Sa‘id reported God's Messenger as saying, \"The truthful and trusty merchant is associated with the prophets, the upright, and the martyrs.\" \n\nTirmidhi, Darimi and Daraqutni transmitted it, and Ibn Majah transmitted it on the authority of Ibn ‘Umar. Tirmidhi said this is a gharib tradition."}},{"id":38,"idInBook":38,"chapterId":11,"bookId":14,"arabic":"وَعَن قيس بن أبي غَرزَة قَالَ: كُنَّا نُسَمَّى فِي عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ السَّمَاسِرَةَ فَمَرَّ بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَمَّانَا بِاسْمٍ هُوَ أَحْسَنُ مِنْهُ فَقَالَ: «يَا مَعْشَرَ التُّجَّارِ إِنَّ الْبَيْعَ يَحْضُرُهُ اللَّغْوُ وَالْحَلِفُ فَشُوبُوهُ بِالصَّدَقَةِ» . رَوَاهُ أَبُو دَاوُدَ وَالتِّرْمِذِيُّ وَالنَّسَائِيُّ وَابْنُ مَاجَهْ","english":{"narrator":"Qais b. Abu Gharaza said :","text":"In the time of God's Messenger we used to be called brokers, but God’s Messenger came upon us one day and called us by a better name than that, saying, \"Company of merchants, unprofitable speech and swearing have a place in business dealing, so mix it with sadaqa. \n\nAbu Dawud, Tirmidhi, Nasa’i and Ibn Majah transmitted it."}},{"id":39,"idInBook":39,"chapterId":11,"bookId":14,"arabic":"وَعَن عبيد بنِ رفاعةَ عَنْ أَبِيهِ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «التُّجَّارُ يُحْشَرُونَ يَوْمَ الْقِيَامَةِ فُجَّارًا إِلَّا مَنِ اتَّقَى وَبَرَّ وَصَدَقَ» . رَوَاهُ التِّرْمِذِيُّ وَابْن مَاجَه\nوَرَوَى الْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَانِ. عَنِ الْبَرَاءِ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ","english":{"narrator":"","text":"‘Ubaid b. Rifa'a on his father’s authority reported the Prophet as saying, \"The merchants will be raised up on the day of resurrection as evildoers, except those who fear God, are honest and speak the truth.”\n\n Tirmidhi, Ibn Majah and Darimi transmitted it, and Baihaqi transmitted it in Shu'ab al-iman on the authority of al-Bara’. Tirmidhi said this is a hasan sahih tradition."}},{"id":40,"idInBook":40,"chapterId":11,"bookId":14,"arabic":"عَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْمُتَبَايِعَانِ كُلُّ وَاحِدٍ مِنْهُمَا بِالْخِيَارِ عَلَى صَاحِبِهِ مَا لَمْ يَتَّفَرَقَا إِلَّا بيع الْخِيَار»\nوَفِي رِوَايَةٍ لِمُسْلِمٍ: «إِذَا تَبَايَعَ الْمُتَبَايِعَانِ فَكُلُّ وَاحِدٍ مِنْهُمَا بِالْخِيَارِ مِنْ بَيْعِهِ مَا لَمْ يَتَفَرَّقَا أَوْ يَكُونَ بَيْعُهُمَا عَنْ خِيَارٍ فَإِذَا كانَ بيعُهما عَن خيارٍ فقد وَجَبَ»\nوَفَى رِوَايَةٍ لِلتِّرْمِذِيِّ: «الْبَيِّعَانِ بِالْخِيَارِ مَا لَمْ يَتَفَرَّقَا أَوْ يَخْتَارَا» . وَفِي الْمُتَّفَقِ عَلَيْهِ: \n\" أَوْ يَقُولَ أَحَدُهُمَا لِصَاحِبِهِ: اخْتَرْ «بَدَلَ» أَوْ يختارا \"","english":{"narrator":"","text":"Ibn 'Umar reported God's Messenger as saying, \"Both parties in a business transaction have a right to annul it so long as they have not separated, except in transactions which have been made subject to the right of the parties to annul them.” The version by Bukhari and Muslim has \"or one of them tells the other to exercise his right” instead of \"or exercise the right.”\n\n(Bukhari and Muslim.)\n\nA version by Muslim says, \"Both parties in a business transaction have a right to annul the bargain so long as they have not separated, or when their bargain has attached to it the right to annul it, for when such a condition has been made it remains valid.” \n\nA version by Tirmidhi says, \"The two parties in a business transaction have a right to annul it so long as they have not separated, or exercise the right.”"}},{"id":41,"idInBook":41,"chapterId":11,"bookId":14,"arabic":"وَعَن حَكِيم بن حزَام قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْبَيِّعَانِ بِالْخِيَارِ مَا لَمْ يَتَفَرَّقَا فَإِنْ صَدَقَا وَبَيَّنَا بُوِرَكَ لَهُمَا فِي بَيْعِهِمَا وَإِنْ كَتَمَا وَكَذَبَا مُحِقَتْ بَرَكَةُ بَيْعِهِمَا»","english":{"narrator":"","text":"Hakim b. Hizam reported God’s Messenger as saying, \"Both parties in a business transaction have a right to annul it so long as they have not separated ; and if they tell the truth and make everything clear they will be blessed in their transaction, but if they conceal anything and lie the blessing on their transaction will be blotted out.” \n\n(Bukhari and Muslim.)"}},{"id":42,"idInBook":42,"chapterId":11,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَجُلٌ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي أُخْدَعُ فِي الْبُيُوعِ فَقَالَ: \n\" إِذَا بَايَعْتَ فَقُلْ: لَا خلابة \" فَكَانَ الرجل يَقُوله","english":{"narrator":"","text":"Ibn ‘Umar said that a man told the Prophet that he was being deceived in business transactions, and he replied, \"When you make a bargain say, 'There is no attempt to deceive'*.” Then the man made a habit of saying that. \n\n(Bukhari and Muslim.)\n\n* He was to say this to protect himself because he was not expert enough to detect defects in what he was buying. Some hold that one who says this has the right to cancel the transaction if any defect is discovered within three days. Some say this applied only to the man who spoke to the Prophet; others say it applies to anyone."}},{"id":43,"idInBook":43,"chapterId":11,"bookId":14,"arabic":"عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْبَيِّعَانِ بِالْخِيَارِ مَا لَمْ يَتَفَرَّقَا إِلَّا أَنْ يَكُونَ صَفْقَةَ خِيَارٍ وَلَا يَحِلُّ لَهُ أَنْ يُفَارِقَ صَاحِبَهُ خَشْيَةَ أَنْ يَسْتَقِيلَهُ» . رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد وَالنَّسَائِيّ","english":{"narrator":"","text":"'Amr b. Shu'aib, on his father's authority, said that his grandfather reported God’s Messenger as saying, “Both parties in a business transaction have a right to annul it so long as they have not separated unless it is a bargain with the right to annul it attached to it; and one has not the right to separate from the other for fear that he may demand that the bargain be rescinded.” \n\nTirmidhi, Abu Dawud and Nasa’i transmitted it."}},{"id":44,"idInBook":44,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يَتَفَرَّقَنَّ اثْنَانِ إِلَّا عنْ تراضٍ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Abu Huraira reported the Prophet as saying, “Two people must separate only by mutual consent.” \n\nAbu Dawud transmitted it."}},{"id":45,"idInBook":45,"chapterId":11,"bookId":14,"arabic":"عَنْ جَابِرٍ رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى الله عَلَيْهِ وَسلم خيَّرَ أعرابيَّاً بَعْدَ الْبَيْعِ. رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيب","english":{"narrator":"","text":"Jabir told that God’s Messenger gave a desert Arab the right to rescind a bargain after having made it. \n\nTirmidhi transmitted it, saying this is a hasan sahih gharib tradition."}},{"id":46,"idInBook":46,"chapterId":11,"bookId":14,"arabic":"عَنْ جَابِرٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: لَعَنَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَكَلَ الرِّبَا وَمُوَكِلَهُ وَكَاتِبَهُ وَشَاهِدَيْهِ وَقَالَ: «هُمْ سَوَاءٌ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Jabir said that God's Messenger cursed the one who accepted usury, the one who paid it, the one who recorded it, and the two witnesses to it, saying they were all alike. \n\nMuslim transmitted it."}},{"id":47,"idInBook":47,"chapterId":11,"bookId":14,"arabic":"وَعَنْ عُبَادَةَ بْنِ الصَّامِتِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الذَّهَبُ بِالذَّهَبِ وَالْفِضَّةُ بِالْفِضَّةِ وَالْبُرُّ بِالْبُرِّ وَالشَّعِيرُ بِالشَّعِيرِ وَالتَّمْرُ بِالتَّمْرِ وَالْملح بالملح مثلا بِمثل سَوَاء بسَواءٍ يَدًا بِيَدٍ فَإِذَا اخْتَلَفَتْ هَذِهِ الْأَصْنَافُ فَبِيعُوا كَيْفَ شِئْتُمْ إِذَا كَانَ يَدًا بِيَدٍ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"‘Ubada b. as-Samit reported God's Messenger as saying, \"Gold is to be paid for by gold, silver by silver, wheat by wheat, barley by barley, dates by dates, and salt by salt, like for like and equal for equal, payment being made on the spot. If these classes differ, sell as you wish if payment is made on the spot.” \n\nMuslim transmitted it."}},{"id":48,"idInBook":48,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الذَّهَبُ بِالذَّهَبِ وَالْفِضَّةُ بِالْفِضَّةِ وَالْبُرُّ بِالْبُرِّ وَالشَّعِيرُ بِالشَّعِيرِ وَالتَّمْرُ بِالتَّمْرِ وَالْمِلْحُ بِالْمِلْحِ مِثْلًا بِمِثْلٍ يَدًا بِيَدٍ فَمَنْ زَادَ أَوِ اسْتَزَادَ فَقَدْ أَرْبَى الْآخِذُ وَالْمُعْطِي فِيهِ سَوَاءٌ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Sa'id al-Khudri reported God’s Messenger as saying, \"Gold is to be paid for by gold, silver by silver, wheat by wheat, barley by barley, dates by dates, and salt by salt, like for like, payment being made on the spot. If anyone gives more or asks more he has dealt in usury. The receiver and the giver are equally guilty.” \n\nMuslim transmitted it."}},{"id":49,"idInBook":49,"chapterId":11,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَبِيعُوا الذَّهَبَ بِالذَّهَبِ إِلَّا مِثْلًا بِمِثْلٍ وَلَا تُشِفُّوا بَعْضَهَا عَلَى بَعْضٍ وَلَا تَبِيعُوا الْوَرِقَ بِالْوَرِقِ إِلَّا مِثْلًا بِمِثْلٍ وَلَا تُشِفُّوا بَعْضَهَا عَلَى بَعْضٍ وَلَا تبِيعُوا مِنْهَا غَائِبا بناجز»\nوَفِي رِوَايَةٍ: «لَا تَبِيعُوا الذَّهَبَ بِالذَّهَبِ وَلَا الْوَرق بالورق إِلَّا وزنا بِوَزْن»","english":{"narrator":"","text":"He reported God’s Messenger as saying, \"Do not sell gold for gold unless it is like for like, and do not make one amount greater than the other; do not sell silver for silver unless it is like for like, and do not make one amount greater than the other; and do not sell for ready money something to be given later*.” A version has, \"Do not sell gold for gold or silver for silver unless both are of equal weight.”\n\n(Bukhari and Muslim.)\n\n* Payment is not to be made till the goods are received."}},{"id":50,"idInBook":50,"chapterId":11,"bookId":14,"arabic":"وَعَنْ مَعْمَرِ بْنِ عَبْدِ اللَّهِ قَالَ: كُنْتُ أسمع رَسُول صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «الطَّعَامُ بِالطَّعَامِ مِثْلاً بمثْلٍ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Ma'mar b. Abdallah told that he used to hear God’s Messenger say, \"Food for food, like for like.” \n\nMuslim transmitted it."}},{"id":51,"idInBook":51,"chapterId":11,"bookId":14,"arabic":"وَعَنْ عُمَرَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الذَّهَبُ بِالذَّهَبِ رِبًا إِلَّا هَاءَ وَهَاءَ وَالْوَرِقُ بِالْوَرِقِ رِبًا إِلَّا هَاءَ وَهَاءَ وَالْبُرُّ بالبُرَّ إِلَّا هَاء وهاء وَالشعِير بِالشَّعِيرِ رَبًّا هَاءَ وَهَاءَ وَالتَّمْرُ بِالتَّمْرِ رِبًا إِلَّا هَاءَ وهاء»","english":{"narrator":"","text":"‘Umar reported God's Messenger as saying, \"Gold for gold is usury unless both hand over on the spot*; silver for silver is usury unless both hand over on the spot; wheat for wheat is usury unless both hand over on the spot; barley for barley is usury unless both hand over on the spot; dates for dates is usury unless both hand over on the spot.\" \n\n(Bukhari and Muslim.)\n\n*\"the Arabic is ha’ waha’ meaning literally \"take and take”."}},{"id":52,"idInBook":52,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ وَأَبِي هُرَيْرَةَ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم اسْتَعْمَلَ رَجُلًا عَلَى خَيْبَرَ فَجَاءَهُ بِتَمْرٍ جَنِيبٍ فَقَالَ: «أَكُلُّ تَمْرِ خَيْبَرَ هَكَذَا؟» قَالَ: لَا وَاللَّهِ يَا رَسُولَ اللَّهِ إِنَّا لَنَأْخُذُ الصَّاعَ مِنْ هَذَا بِالصَّاعَيْنِ وَالصَّاعَيْنِ بِالثَّلَاثِ فَقَالَ: «لَا تَفْعَلْ بِعِ الْجَمْعَ بِالدَّرَاهِمِ ثُمَّ ابْتَعْ بِالدَّرَاهِمِ جَنِيبًا» . وَقَالَ: «فِي الْمِيزَانِ مِثْلَ ذَلِكَ»","english":{"narrator":"","text":"Abu Sa'id and Abu Huraira told that God’s Messenger appointed a man over Khaibar and he brought him dates of a very fine quality. He asked him whether all the dates of Khaibar were like that, and he replied, “I swear by God that they are certainly not, Messenger of God. We take a sa‘ of this kind for two, and two for three.\" So he said, \"Do not do so. Sell the lot for dirhams, then buy the very fine dates for dirhams.\" He said that it was the same when things were sold by weight. \n\n(Bukhari and Muslim.)"}},{"id":53,"idInBook":53,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ قَالَ: جَاءَ بِلَالٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِتَمْرٍ بَرْنِيٍّ فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مِنْ أَيْنَ هَذَا؟» قَالَ: كَانَ عِنْدَنَا تَمْرٌ رَدِيءٌ فَبِعْتُ مِنْهُ صَاعَيْنِ بِصَاعٍ فَقَالَ: «أَوَّهْ عَيْنُ الرِّبَا عَيْنُ الرِّبَا لَا تَفْعَلْ وَلَكِنْ إِذَا أَرَدْتَ أَنْ تَشْتَرِيَ فَبِعِ التَّمرَ ببَيْعٍ آخر ثمَّ اشْتَرِ بِهِ»","english":{"narrator":"","text":"Abu Sa'id said that Bilal brought the Prophet some barni* dates, and when he asked him where he had got them he replied, \"I had some inferior dates, so I sold two sa's of them for a sa.\" He said, \"Ah, the very essence of usury, the very essence of usury. Do not do so, but when you wish to buy, sell the dates in a separate transaction, then buy with what you get.\" \n\n(Bukhari and Muslim.)\n\n* A type of dates of the best quality, sweet and luscious, red tinged with yellow."}},{"id":54,"idInBook":54,"chapterId":11,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: جَاءَ عَبْدٌ فَبَايَعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْهِجْرَةِ وَلَمْ يَشْعُرْ أَنَّهُ عَبْدٌ فَجَاءَ سَيِّدُهُ يُرِيدُهُ فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ «بِعَيْنِه» فَاشْتَرَاهُ بِعَبْدَيْنِ أَسْوَدَيْنِ وَلَمْ يُبَايِعْ أَحَدًا بَعْدَهُ حَتَّى يَسْأَلَهُ أَعَبْدٌ هُوَ أَوْ حُرٌّ. رَوَاهُ مُسلم","english":{"narrator":"","text":"Jabir told that a slave came and swore allegiance to the Prophet promising to emigrate, but he did not know that he was a slave. When his master came in search of him the Prophet said to him, ‘Sell him to me,\" and he bought him for two black slaves. Afterwards he never took an oath of allegiance from anyone without asking him whether he was a slave or free. \n\nMuslim transmitted it."}},{"id":55,"idInBook":55,"chapterId":11,"bookId":14,"arabic":"وَعَنْهُ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ الصُّبْرَةِ مِنَ التَّمْرِ لَا يُعْلَمُ مَكِيلَتُهَا بِالْكَيْلِ الْمُسَمَّى مِنَ التَّمْرِ. رَوَاهُ مُسلم","english":{"narrator":"","text":"He said that God’s Messenger forbade selling a quantity of dates whose measure was unknown for a specific quantity of dates. \n\nMuslim transmitted it."}},{"id":56,"idInBook":56,"chapterId":11,"bookId":14,"arabic":"وَعَنْ فَضَالَةَ بْنِ أَبِي عُبَيْدٍ قَالَ: اشْتَرَيْتُ يَوْمَ خَيْبَرَ قِلَادَةً بِاثْنَيْ عَشَرَ دِينَارًا فِيهَا ذَهَبٌ وَخَرَزٌ فَفَصَّلْتُهَا فَوَجَدْتُ فِيهَا أَكْثَرَ مِنَ اثْنَيْ عَشَرَ دِينَارًا فَذَكَرْتُ ذَلِكَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «لَا تُبَاعُ حَتَّى تُفصَّلَ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Fadala b. 'Ubaid* said that at the battle for Khaibar he had bought a necklace in which there were gold and gems for twelve dinars, and after considering them separately he found that it was worth more than twelve dinars, so he mentioned that to the Prophet who said, \"It must not be sold till the contents are considered separately.\" \n\nMuslim transmitted it.\n\n* The Damascus edition, iii, 308 and Mirqat, iii, 311 wrongly give Abu 'Ubaid, but in the commentary Mirqat gives the name correctly as Fadala b. 'Ubaid."}},{"id":57,"idInBook":57,"chapterId":11,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَيَأْتِيَنَّ عَلَى النَّاسِ زَمَانٌ لَا يَبْقَى أَحَدٌ إِلَّا أَكَلَ الرِّبَا فَإِنْ لَمْ يَأْكُلْهُ أَصَابَهُ مِنْ بُخَارِهِ» . وَيُرْوَى مِنْ «غُبَارِهِ» . رَوَاهُ أَحْمَدُ وَأَبُو دَاوُدَ وَالنَّسَائِيُّ وَابْنُ مَاجَهْ","english":{"narrator":"","text":"Abu Huraira reported God's Messenger as saying, “A time is certainly coming to mankind when only the receiver of usury will remain, and if he does not receive it some of its vapour (or alternatively, its dust) will reach him.” \n\nAhmad, Abu Dawud, Nasa'i and Ibn Majah transmitted it."}},{"id":58,"idInBook":58,"chapterId":11,"bookId":14,"arabic":"وَعَنْ عُبَادَةَ بْنِ الصَّامِتِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا تَبِيعُوا الذَّهَبَ بِالذَّهَبِ وَلَا الْوَرِقَ بِالْوَرِقِ وَلَا الْبُرَّ بِالْبُرِّ وَلَا الشَّعِيرَ بِالشَّعِيرِ وَلَا التَّمْرَ بِالتَّمْرِ وَلَا الْمِلْحَ بِالْمِلْحِ إِلَّا سَوَاءً بِسَوَاءٍ عَيْنًا بِعَيْنٍ يَدًا بِيَدٍ وَلَكِنْ بِيعُوا الذَّهَبَ بِالْوَرِقِ وَالْوَرِقَ بِالذَّهَبِ وَالْبُرَّ بِالشَّعِيرِ وَالشَّعِيرَ بِالْبُرِّ وَالتَّمْرَ بِالْمِلْحِ وَالْمِلْحَ بِالتَّمْرِ يَدًا بِيَدٍ كَيْفَ شِئْتُمْ» . رَوَاهُ الشَّافِعِي","english":{"narrator":"","text":"‘Ubada b. as-Samit reported God’s Messenger as saying, “Do not sell gold for gold, or silver for silver, or wheat for wheat, or barley for barley, or dates for dates, or salt for salt except equal for equal, kind for kind, payment being made on the spot; but sell gold for silver, silver for gold, wheat for barely, barley for wheat, dates for salt and salt for dates, payment being made on the spot, as you wish.” \n\nShafi'i transmitted it."}},{"id":59,"idInBook":59,"chapterId":11,"bookId":14,"arabic":"وَعَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ عَنْ شِرَاءِ التَّمْرِ بِالرُّطَبِ فَقَالَ: «أَيَنْقُصُ الرُّطَبُ إِذَا يَبِسَ؟» فَقَالَ: نَعَمْ فَنَهَاهُ عَنْ ذَلِكَ. رَوَاهُ مَالِكٌ وَالتِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالنَّسَائِيُّ وَابْنُ مَاجَه","english":{"narrator":"","text":"Sa'd b. Abu Waqqas said he heard God's Messenger being asked about buying dry dates for fresh and asking whether the fresh dates were diminished when they became dry. On being told that they were, he forbade that.\n\nMalik, Tirmidhi, Abu Dawud, Nasa’i and Ibn Majah transmitted it."}},{"id":60,"idInBook":60,"chapterId":11,"bookId":14,"arabic":"وَعَنْ سَعِيدِ بْنِ الْمُسَيَّبِ مُرْسَلًا: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نهى عَن بَيْعِ اللَّحْمِ بِالْحَيَوَانِ قَالَ سَعِيدٌ: كَانَ مِنْ مَيْسِرِ أَهْلِ الْجَاهِلِيَّةِ. رَوَاهُ فِي شَرْحِ السُّنَّةِ","english":{"narrator":"","text":"Sa'id b. al-Musayyib told in mursal form that God’s Messenger forbade the sale of meat for animals1. Sa'id said it was connected with the maisir2 of the people of pre-Islamic times. \n\nIt is transmitted in Sharh as-sunna.\n\n1. i.e. meat sold in exchange for living animals.\n2. A game of chance played with arrows for parts of a camel. The type of transaction mentioned in the tradition is evidently considered to contain something in the nature of a gamble."}},{"id":61,"idInBook":61,"chapterId":11,"bookId":14,"arabic":"وَعَنْ سَمُرَةَ بْنِ جُنْدُبٍ: أَنَّ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ الْحَيَوَانِ بِالْحَيَوَانِ نَسِيئَةً. رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالنَّسَائِيُّ وَابْنُ مَاجَهْ","english":{"narrator":"","text":"Samura b. Jundub told that the Prophet, forbade selling animal for animals when payment was to be made at a later date. \n\nTirmidhi, Abu Da.wud, Nasa’i, Ibn Majah and Darimi transmitted it."}},{"id":62,"idInBook":62,"chapterId":11,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَهُ أَن يُجهِّزَ جَيْشًا فنفدتِ الإِبلُ فأمرَهُ أَن يَأْخُذَ عَلَى قَلَائِصِ الصَّدَقَةِ فَكَانَ يَأْخُذُ الْبَعِيرَ بِالْبَعِيرَيْنِ إِلَى إِبِلِ الصَّدَقَةِ. رَوَاهُ أَبُو دَاوُدَ","english":{"narrator":"","text":"‘Abdallah b. ‘Amr b. al-‘As told that the Prophet commanded him to equip an army, but when the camels were insufficient he commanded him to keep back the young camels of the sadaqa, and he was taking a camel to be replaced by two when the camels of the sadaqa came. \n\nAbu Dawud transmitted it."}},{"id":63,"idInBook":63,"chapterId":11,"bookId":14,"arabic":"عَنْ أُسَامَةُ بْنُ زَيْدٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الرِّبَا فِي النَّسِيئَةِ» . وَفِي رِوَايَةٍ قَالَ: «لَا رِبًا فِيمَا كَانَ يدا بيد»","english":{"narrator":"","text":"Usama b. Zaid reported the Prophet as saying, \"Credit involves usury.” In a version he said, \"There is no usury when payment is made on the spot.” \n\n(Bukhari and Muslim.)"}},{"id":64,"idInBook":64,"chapterId":11,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ حَنْظَلَةَ غَسِيلِ الْمَلَائِكَةِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «دِرْهَمُ رِبًا يَأْكُلُهُ الرَّجُلُ وَهُوَ يَعْلَمُ أَشَدُّ مِنْ سِتَّةٍ وَثَلَاثِينَ زِنْيَةً» . رَوَاهُ أَحْمَدُ والدراقطني\nوَرَوَى الْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَانِ عَنِ ابْنِ عَبَّاسٍ وَزَادَ: وَقَالَ: «مَنْ نَبَتَ لَحْمُهُ مِنَ السُّحت فَالنَّار أولى بِهِ»","english":{"narrator":"","text":"‘Abdallah, son of Hanzala who was washed by the angels*, reported God's Messenger as saying, \"A dirham which a man knowingly receives in usury is more serious than thirty-six acts of fornication”. \n\nAhmad and Daraqutni transmitted it.\n\n* Hanzala was killed at the battle of Uhud. The dead were buried without being washed, and as Hanzala is reputed to have been in a state of ceremonial impurity at the time, his family were anxious; so the Prophet told them he had been washed by the angels. He is commonly called al-ghasil. In the text above the phrase used is ghasil al-mala’ika.\n\nBaihaqi transmitted in Shu'ab al-iman on the authority of Ibn ‘Abbas with the addition that he said, \"Hell is more fitting for him whose flesh is nourished by what is unlawful.”"}},{"id":65,"idInBook":65,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الرِّبَا سَبْعُونَ جُزْءًا أيسرها أَن الرجل أمه»","english":{"narrator":"","text":"Abu Huraira reported God’s Messenger as saying, \"Usury has seventy parts, the least important being that a man should marry his mother.”\n\nIbn Majah and Baihaqi, in Shu'ab al-iman"}},{"id":66,"idInBook":66,"chapterId":11,"bookId":14,"arabic":"وَعَنِ ابْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" إِنِ الرِّبَا وَإِنْ كَثُرَ فإِنَّ عاقبتَه تصيرُ إِلى قُلِّ: رَوَاهُمَا ابْنُ مَاجَهْ وَالْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَانِ. وَرَوَى أَحْمد الْأَخير","english":{"narrator":"","text":"Ibn Mas'ud reported God’s Messenger as saying, \"Even though usury be much it leads in the end to penury.” \n\nIbn Majah and Baihaqi, in Shu'ab al-iman, transmitted it, and Ahmad also transmitted it."}},{"id":67,"idInBook":67,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" أَتَيْتُ لَيْلَةَ أُسْرِيَ بِي عَلَى قَوْمٍ بُطُونُهُمْ كَالْبُيُوتِ فِيهَا الْحَيَّاتُ تُرَى مِنْ خَارِجِ بُطُونِهِمْ فَقُلْتُ: مَنْ هَؤُلَاءِ يَا جِبْرِيلُ؟ قَالَ: هَؤُلَاءِ أَكَلَةُ الرِّبَا \". رَوَاهُ أَحْمد وَابْن مَاجَه","english":{"narrator":"","text":"Abu Huraira reported God's Messenger as saying, \"On the night when I was taken up to heaven I came upon people whose bellies were like houses and contained snakes which could be seen from outside their bellies. I asked Gabriel who they were and he told me that they were people who had practised usury.” \n\nAhmad and Ibn Majah transmitted it."}},{"id":68,"idInBook":68,"chapterId":11,"bookId":14,"arabic":"وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم لعن آكِلَ الرِّبَا وَمُوَكِلَهُ وَكَاتِبَهُ وَمَانِعَ الصَّدَقَةِ وَكَانَ ينْهَى عَن النوح. رَوَاهُ النَّسَائِيّ","english":{"narrator":"","text":"‘Ali said he heard God’s Messenger curse those who took usury, those who paid it, those who recorded it, and those who refused to give sadaqa; and he used to prohibit wailing. \n\nNasa’i transmitted it."}},{"id":69,"idInBook":69,"chapterId":11,"bookId":14,"arabic":"وَعَنْ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ إِنَّ آخِرَ مَا نَزَلَتْ آيَةُ الرِّبَا وَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قُبِضَ وَلَمْ يُفَسِّرْهَا لَنَا فَدَعُوا الرِّبَا وَالرِّيبَةَ. رَوَاهُ ابْن مَاجَه والدارمي","english":{"narrator":"‘Umar b. al-Khattab said:","text":"The last verse to be sent down was that on usury (Al-Qur’an 2:275) but God's Messenger was taken without having expounded it to us; so leave aside usury and whatever is doubtful.\n\n Ibn Majah and Darimi transmitted it."}},{"id":70,"idInBook":70,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا أَقْرَضَ أَحَدُكُمْ قَرْضًا فَأَهْدَي إِلَيْهِ أَوْ حَمَلَهُ عَلَى الدَّابَّةِ فَلَا يَرْكَبْهُ وَلَا يَقْبَلْهَا إِلَّا أَنْ يَكُونَ جَرَى بَيْنَهُ وَبَيْنَهُ قَبْلَ ذَلِكَ» . رَوَاهُ ابْنُ مَاجَهْ وَالْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَانِ","english":{"narrator":"","text":"Anas reported God’s Messenger as saying, \"When one of you makes a loan and the borrower sends him a present or provides an animal for him to ride, he must not ride the one or accept the other unless it is a practice they followed previously.\" \n\nIbn Majah and Baihaqi, in Shu'ab al-iman, transmitted it."}},{"id":71,"idInBook":71,"chapterId":11,"bookId":14,"arabic":"وَعَنْهُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا أَقْرَضَ الرَّجُلُ الرَّجُلَ فَلَا يَأْخُذُ هَدِيَّةً» . رَوَاهُ الْبُخَارِيُّ فِي تَارِيخِهِ هَكَذَا فِي الْمُنْتَقى","english":{"narrator":"","text":"He reported the Prophet as saying, \"When a man makes a loan to another he must not accept a present.\" \n\nBukhari transmitted it in his Ta’rikh, as is said in al-Muntaqa."}},{"id":72,"idInBook":72,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَبِي بُرْدَةَ بْنِ أَبِي مُوسَى قَالَ: قدمت الْمَدِينَة فَلَقِيت عبد الله بن سلا م فَقَالَ: إِنَّك بِأَرْض فِيهَا الرِّبَا فَاش إِذا كَانَ لَكَ عَلَى رَجُلٍ حَقٌّ فَأَهْدَى إِلَيْكَ حِمْلَ تَبْنٍ أَو حِملَ شعيرِ أَو حَبْلَ قَتٍّ فَلَا تَأْخُذْهُ فَإِنَّهُ رِبًا. رَوَاهُ الْبُخَارِيُّ","english":{"narrator":"Abu Burda b. Abu Musa said:","text":"I came to Medina and met 'Abdallah b. Salam who said, \"You are in a land in which usury is common, so when anyone owes you anything and presents you with a load of straw, or a load of barley, or a rope of lucerne grass, do not accept it for it is usury.\" \n\nBukhari transmitted it."}},{"id":73,"idInBook":73,"chapterId":11,"bookId":14,"arabic":"عَنِ ابْنِ عُمَرَ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ الْمُزَابَنَةِ: أَنْ يَبِيع تمر حَائِطِهِ إِنْ كَانَ نَخْلًا بِتَمْرٍ كَيْلَا وَإِنْ كَانَ كرْماً أنْ يَبيعَه زبيبِ كَيْلَا أَوْ كَانَ وَعِنْدَ مُسْلِمٍ وَإِنْ كَانَ زَرْعًا أَنْ يَبِيعَهُ بِكَيْلِ طَعَامٍ نَهَى عَنْ ذلكَ كُله. مُتَّفق عَلَيْهِ. وَفِي رِوَايَةٍ لَهُمَا: نَهَى عَنِ الْمُزَابَنَةِ قَالَ: \" والمُزابنَة: أنْ يُباعَ مَا فِي رُؤوسِ النَّخلِ بتمْرٍ بكيلٍ مُسمَّىً إِنْ زادَ فعلي وَإِن نقص فعلي)","english":{"narrator":"","text":"Ibn ‘Umar said that God’s Messenger forbade muzabana, which means that a man sells the fruit of his garden, if it consists of palm trees*, for dried dates by measure; or if it consists of grapes, for raisins by measure; or (Muslim has “and if”) it is corn, he sells it for a measure of corn. He forbade all that. A version by both of them tells that he forbade muzabana, which means that the fruit on the palm-trees is sold for a specified measure of dates, the seller profiting if it is greater and losing if it is less.\n\n(Bukhari and Muslim.)\n\n* Explained as meaning fresh dates"}},{"id":74,"idInBook":74,"chapterId":11,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ الْمُخَابَرَةِ وَالْمُحَاقَلَةِ وَالْمُزَابَنَةِ وَالْمُحَاقَلَةُ: أَنْ يَبِيعَ الرَّجُلُ الزَّرْعَ بِمِائَةِ فَرَقٍ حِنطةً والمزابنةُ: أنْ يبيعَ التمْرَ فِي رؤوسِ النَّخْلِ بِمِائَةِ فَرَقٍ وَالْمُخَابَرَةُ: كِرَاءُ الْأَرْضِ بِالثُّلُثِ والرُّبُعِ. رَوَاهُ مُسلم","english":{"narrator":"","text":"Jabir said that God’s Messenger forbade mukhabara, muhaqala and muzabana. Muhaqala means that a man sells a sown field for a hundred faraqs ( 3 sa’s) of wheat; muzabana that he sells the dates on the palm-trees for a hundred faraqs and mukharaba is renting land for a third and a quarter of the produce. \n\nMuslim transmitted it."}},{"id":75,"idInBook":75,"chapterId":11,"bookId":14,"arabic":"وَعَنْهُ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ الْمُحَاقَلَةِ وَالْمُزَابَنَةِ وَالْمُخَابَرَةِ وَالْمُعَاوَمَةِ وَعَنِ الثُّنْيَا وَرَخَّصَ فِي الْعَرَايَا. رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"He said that God’s Messenger forbade muhaqala, muzabana, mukhabara, mu'awama (Selling a year’s harvest before the crop has grown, or selling the fruit on one’s palm-trees two or three years ahead.) and thunya (An exception the amount of which is not accurately known.), but gave licence for ‘araya (Plural of ‘ariya. A palm-tree assigned by its owner to another who is in need, for him to eat its fruit for a year. It is said that a poor man who had no money to buy fresh dates might buy the fruit on a palm-tree for dry dates.)\n\nMuslim transmitted it."}},{"id":76,"idInBook":76,"chapterId":11,"bookId":14,"arabic":"وَعَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَن بيعِ التمْر بالتمْرِ إِلَّا أَنَّهُ رَخَّصَ فِي الْعَرِيَّةِ أَنْ تُبَاعَ بِخَرْصِهَا تَمْرًا يَأْكُلُهَا أَهْلُهَا رُطَبًا","english":{"narrator":"","text":"Sahl b. Abu Hathma said that God’s Messenger forbade the sale of fruit for dried dates but gave licence regarding the ariya for its sale on the basis of a calculation of what the dates would be when dry, yet those who bought them could eat them when fresh. \n\n(Bukhari and Muslim.)"}},{"id":77,"idInBook":77,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْخَصَ فِي بَيْعِ الْعَرَايَا بِخَرْصِهَا مِنَ التَّمْرِ فِيمَا دُونَ خَمْسَة أوسق أَو خَمْسَة أوسق شكّ دَاوُد ابْن الْحصين","english":{"narrator":"","text":"Abu Huraira said God's Messenger gave licence regarding the sale of ‘araya for a computation of their amount when dry, provided they were less than five wasqs*, or amounted to five wasqs. Dawud b. al Husain was doubtful  \n\n(Bukhari and Muslim.)\n\n*(wasq is a camel load=60 sa’s)"}},{"id":78,"idInBook":78,"chapterId":11,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ الثِّمَارِ حَتَّى يَبْدُوَ صَلَاحُهَا نَهَى الْبَائِعَ وَالْمُشْتَرِي. مُتَّفِقٌ عَلَيْهِ\nوَفِي رِوَايَةٍ لِمُسْلِمٍ: نَهَى عَنْ بَيْعِ النَّخْلِ حَتَّى تَزْهُوَ وَعَنِ السنبل حَتَّى يبيض ويأمن العاهة","english":{"narrator":"","text":"‘Abdallah b. ‘Umar said that God's Messenger forbade the sale of fruits till they were clearly in good condition, forbidding it both to the seller and to the buyer. A version by Muslim says he forbade selling palm-trees (i.e. their fruit) till the dates began to ripen, and ears of corn till they were white and were safe from blight.\n\n(Bukhari and Muslim.)"}},{"id":79,"idInBook":79,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَن بيع الثِّمَارِ حَتَّى تَزْهَى قِيلَ: وَمَا تَزْهَى؟ قَالَ:\nحَتَّى تخمر \" وَقَالَ: «أَرَأَيْتَ إِذَا مَنَعَ اللَّهُ الثَّمَرَةَ بِمَ يَأْخُذ أحدكُم مَال أَخِيه؟»","english":{"narrator":"Anas said that God’s Messenger forbade the sale of fruits till tuzhiya. He was asked what that meant and said it meant till they became red, adding, “Tell me:","text":"when God keeps back the fruit, why should any of you take his brother’s property?” \n\n(Bukhari and Muslim.)"}},{"id":80,"idInBook":80,"chapterId":11,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ السِّنِينَ وَأَمَرَ بوضْعِ الجوائحِ. رَوَاهُ مُسلم","english":{"narrator":"","text":"Jabir said that God's Messenger forbade selling fruit years ahead, and commanded that unforeseen loss be remitted in respect of what is affected by blight. \n\nMuslim transmitted it."}},{"id":81,"idInBook":81,"chapterId":11,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَوْ بِعْتَ مِنْ أَخِيكَ ثَمَرًا فَأَصَابَتْهُ جَائِحَةٌ فَلَا يَحِلُّ لَكَ أَنْ تَأْخُذَ مِنْهُ شَيْئًا بِمَ تَأْخُذُ مَالَ أَخِيكَ بِغَيْرِ حقٍ؟» . رَوَاهُ مُسلم","english":{"narrator":"","text":"He reported God's Messenger as saying, “If you were to sell something to your brother and it was smitten by blight it would not be allowable for you to take anything from him. Why should you take your brother's property unjustly?” \n\nMuslim transmitted it."}},{"id":82,"idInBook":82,"chapterId":11,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: كَانُوا يَبْتَاعُونَ الطَّعَامَ فِي أَعلَى السُّوقِ فيبيعُونَه فِي مكانهِ فَنَهَاهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِهِ فِي مَكَانِهِ حَتَّى يَنْقِلُوهُ. رَوَاهُ أَبُو دَاوُد وَلم أَجِدهُ فِي الصَّحِيحَيْنِ","english":{"narrator":"","text":"Ibn ‘Umar said they used to buy grain in the upper part of the market and sell it in the same spot, but God’s Messenger forbade them to sell it there before removing it. \n\nAbu Dawud transmitted it. I have not found it in the two Sahihs."}},{"id":83,"idInBook":83,"chapterId":11,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنِ ابْتَاعَ طَعَامًا فَلَا يَبِيعهُ حَتَّى يَسْتَوْفِيه»\nوَفَى رِوَايَةِ ابْنِ عَبَّاسٍ: «حَتَّى يكْتالَه»","english":{"narrator":"","text":"He reported God's Messenger as saying, “If anyone buys grain he must not sell it till he has received it in full.” A version by Ibn ‘Abbas has, ‘‘till he measures it out.” \n\n(Bukhari and Muslim.)"}},{"id":84,"idInBook":84,"chapterId":11,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: أَمَّا الَّذِي نَهَى عَنْهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَهُوَ الطَّعَامُ أَنْ يُبَاعَ حَتَّى يُقْبَضَ. قَالَ ابْنُ عَبَّاسٍ: وَلَا أَحْسِبُ كُلَّ شَيْءٍ إِلاَّ مثلَه","english":{"narrator":"","text":"Ibn ‘Abbas said what the Prophet forbade was that grain should be sold before it had been received. Ibn ‘Abbas said, “I do not think this applies to every commodity, but only to things of that type.” \n\n(Bukhari and Muslim.)"}},{"id":85,"idInBook":85,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \" لَا تَلَقُّوُا الرُّكْبَانَ لِبَيْعٍ وَلَا يَبِعْ بَعْضُكُمْ عَلَى بَيْعِ بَعْضٍ وَلَا تَنَاجَشُوا وَلَا يَبِعْ حَاضِرٌ لِبَادٍ وَلَا تُصَرُّوا الْإِبِلَ وَالْغَنَمَ فَمِنِ ابْتَاعَهَا بَعْدَ ذَلِكَ فَهُوَ بِخَيْرِ النَّظِرَيْنِ بَعْدَ أَنْ يحلبَها: إِنْ رَضِيَهَا أَمْسَكَهَا وَإِنْ سَخِطَهَا رَدَّهَا وَصَاعًا مِنْ تمر \"\nوَفِي رِوَايَةٍ لِمُسْلِمٍ: \" مَنِ اشْتَرَى شَاةً مُصَرَّاةً فَهُوَ بِالْخِيَارِ ثَلَاثَةَ أَيَّامٍ: فَإِنْ رَدَّهَا رَدَّ مَعهَا صَاعا من طَعَام لَا سمراء \"","english":{"narrator":"Abu Huraira reported God's Messenger.as saying, “Do not go out to meet riders to conduct business with them; none of you must buy in opposition to one another1, nor must you bid against one another; a townsman must not sell for a man from the desert; and do not tie up the udders of camels and sheep, for he who buys them after that has been done has two courses open to him after milking them :","text":"he may keep them if he is pleased with them, and may return them along with a sa‘ of dates if he is displeased with them.” A version by Muslim has, “If anyone buys a sheep whose udder has been tied up he has three days in which to decide whether to keep it or not; but if he returns it he must return with it a sa’ of any grain but wheat.”2\n\n(Bukhari and Muslim.)\n\n1. When agreement has obviously been reached, although the contract has not been confirmed, no one must step in and offer a higher price.\n2. Samra’. The full pharse is hinta samra’, meaning \"tawny wheat\" ; then the adjective is used by itself as a word for wheat."}},{"id":86,"idInBook":86,"chapterId":11,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَلَقَّوُا الْجَلَبَ فَمَنْ تَلَقَّاهُ فَاشْتَرَى مِنْهُ فَإِذَا أَتَى سَيِّدُهُ السُّوقَ فَهُوَ بالخَيارِ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"He reported God’s Messenger as saying, “Do not go out to meet what is being brought .* \n* He may find he could have a higher price in the market, and so he has the right to cancel the deal.\n\nMuslim transmitted it."}},{"id":87,"idInBook":87,"chapterId":11,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَلَقَّوُا السِّلَعَ حَتَّى يُهْبَطَ بهَا إِلى السُّوق»","english":{"narrator":"","text":"Ibn ‘Umar reported God’s Messenger as saying, “Do not go out to meet merchandise,  till it is brought down to the market.” \n\n(Bukhari and Muslim.)"}},{"id":88,"idInBook":88,"chapterId":11,"bookId":14,"arabic":"وَعَنْهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَبِعِ الرَّجُلُ عَلَى بَيْعِ أَخِيهِ وَلَا يَخْطِبْ عَلَى خِطْبَةِ أَخِيهِ إِلَّا أنْ يأذَنَ لَهُ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"He reported God’s Messenger as saying, “One must not offer more than the amount agreed by his brother*, or ask a woman in marriage when his brother has done so, unless he permits him.” \n*i.e. when the parties have already agreed on a price.\n\nMuslim transmitted it."}},{"id":89,"idInBook":89,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يَسُمِ الرَّجُلُ على سَوْمِ أخيهِ الْمُسلم» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Huraira reported God’s Messenger as saying, “A man must not offer a price above that offered by his brother Muslim.” \n\nMuslim transmitted it."}},{"id":90,"idInBook":90,"chapterId":11,"bookId":14,"arabic":"وَعَنْ جَابِرٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يبِعْ حَاضِرٌ لِبَادٍ دَعُوا النَّاسَ يَرْزُقُ اللَّهُ بَعْضَهُمْ من بعض» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Jabir reported God’s Messenger as saying, “A townsman must not sell for a man from the desert; if you leave people alone, God will give them provision from one another.” \n\nMuslim transmitted it."}},{"id":91,"idInBook":91,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ لِبْسَتَيْنِ وَعَنْ بَيْعَتَيْنِ: نَهَى عَنِ الْمُلَامَسَةِ والمُنابذَةِ فِي البيعِ وَالْمُلَامَسَةُ: لَمْسُ الرَّجُلِ ثَوْبَ الْآخَرِ بِيَدِهِ بِاللَّيْلِ أَو بالنَّهارِ وَلَا يقْلِبُه إِلَّا بِذَلِكَ وَالْمُنَابَذَةُ: أَنْ يَنْبِذَ الرَّجُلُ إِلَى الرَّجُلِ بِثَوْبِهِ وَيَنْبِذَ الْآخَرُ ثَوْبَهُ وَيَكُونُ ذَلِكَ بَيْعَهُمَا عَنْ غَيْرِ نَظَرٍ وَلَا تَرَاضٍ وَاللِّبْسَتَيْنِ: اشْتِمَالُ الصَّمَّاءِ وَالصَّمَّاءُ: أَنْ يَجْعَلَ ثَوْبَهُ عَلَى أَحَدِ عَاتِقَيْهِ فَيَبْدُوَ أَحَدُ شِقَّيْهِ لَيْسَ عَلَيْهِ ثَوْبٌ وَاللِّبْسَةُ الْأُخْرَى: احْتِبَاؤُهُ بِثَوْبِهِ وَهُوَ جَالِسٌ ليسَ على فرجه مِنْهُ شَيْء","english":{"narrator":"","text":"Abu Sa'id al-Khudri said that God’s Messenger forbade two ways of dressing and two types of business transaction. He forbade mulamasa and munabadha in a business transaction. Mulamasa means that a man touches another’s garment with his hand, whether at night or by day, without turning it over any more than that involves. Munabadha means that a man throws his garment to another and the other throws his garment, that confirming their contract without inspection or mutual agreement. One of the ways of dressing is the wrapping of the samma, which means that a man puts his garment over one of his shoulders so that one of his sides appears uncovered; the other is when a man wraps himself up in his garment while sitting in such a way that none of it covers his private parts. \n\n(Bukhari and Muslim.)"}},{"id":92,"idInBook":92,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عنْ بيعِ الحصاةِ وعنْ بيعِ الغَرَرِ. رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Huraira said that God’s Messenger forbade a transaction determined by throwing stones1, and the type which involves some uncertainty2.\n\nMuslim transmitted it.\n\n1. A type of transaction in which it is made binding when the buyer or the seller throws a stone; or in which a man agrees to sell to another all the commodities on which stones which he throws alight; or in which one agrees to sell another some land up to the distance to which he can throw a stone.\n2. Bai' al-gharar. One might translate this ‘aleatory contracts of sale’, but this is not the only term to which that applies. The type of transaction intended is one in which there is no guarantee that the seller can deliver the goods for which he receives payment. It could include such items as selling a runaway slave, or fish which one has not caught, etc."}},{"id":93,"idInBook":93,"chapterId":11,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَن بَيْعِ حَبَلِ الْحَبَلَةِ وَكَانَ بَيْعًا يَتَبَايَعُهُ أَهْلُ الْجَاهِلِيَّةِ كَانَ الرَّجُلُ يَبْتَاعُ الْجَزُورَ إِلَى أَنْ تُنتَجَ النَّاقةُ ثمَّ تُنتَجُ الَّتِي فِي بطنِها","english":{"narrator":"","text":"Ibn ‘Umar said that God's Messenger forbade the transaction called habal al-habala which was one entered into in pre-Islamic times, whereby a man bought a she-camel which was to be the offspring of a she-camel which was still in its mother’s womb. \n\n(Bukhari and Muslim.)"}},{"id":94,"idInBook":94,"chapterId":11,"bookId":14,"arabic":"وَعَنْهُ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ عَسْبِ الْفَحْلِ. رَوَاهُ الْبُخَارِيُّ","english":{"narrator":"","text":"He said that God’s Messenger forbade  a stallion's covering. \n\nBukhari transmitted it."}},{"id":95,"idInBook":95,"chapterId":11,"bookId":14,"arabic":"وَعَنْ جَابِرٍ: قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ ضِرَابِ الْجَمَلِ وَعَنْ بَيْعِ الْمَاءِ وَالْأَرْضِ لِتُحْرَثَ. رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"Jabir said that God’s Messenger forbade hiring a camel to cover a she-camel and selling water and land to be tilled (This is really mukhabara).\n\nMuslim transmitted it."}},{"id":96,"idInBook":96,"chapterId":11,"bookId":14,"arabic":"وَعنهُ قَالَ: نهى رَسُول الله عَن بيع فضل المَاء. رَوَاهُ مُسلم","english":{"narrator":"","text":"He said that God’s Messenger forbade the sale of excess water. \n\nMuslim transmitted it."}},{"id":97,"idInBook":97,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يُبَاع فضل المَاء ليباع بِهِ الْكلأ»","english":{"narrator":"","text":"Abu Huraira reported God’s Messenger as saying, “Excess water must not be sold for the purpose of having the herbage which grows from it sold.\" \n\n(Bukhari and Muslim.)"}},{"id":98,"idInBook":98,"chapterId":11,"bookId":14,"arabic":"وَعَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ عَلَى صُبْرَةِ طَعَامٍ فَأَدْخَلَ يَدَهُ فِيهَا فَنَالَتْ أَصَابِعُهُ بَلَلًا فَقَالَ: «مَا هَذَا يَا صَاحِبَ الطَّعَامِ؟» قَالَ: أَصَابَتْهُ السَّمَاءُ يَا رَسُولَ اللَّهِ قَالَ: «أَفَلَا جَعَلْتَهُ فَوْقَ الطَّعَامِ حَتَّى يَرَاهُ النَّاسُ؟ مَنْ غَشَّ فَلَيْسَ مني» . رَوَاهُ مُسلم","english":{"narrator":"","text":"He said that God's Messenger once came upon a heap of grain, and when he put his hand into it his fingers felt some dampness, so he asked the owner of the grain how that came about. On being told that rain had fallen on it he said, \"Why did you not put the damp part on the top of the grain so that people might see it? He who deceives has nothing to do with me.\" \n\nMuslim transmitted it."}},{"id":99,"idInBook":99,"chapterId":11,"bookId":14,"arabic":"عَنْ جَابِرٍ قَالَ: إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنِ الثُّنْيَا إِلَّا أنْ يُعلمَ. رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Jabir said that God’s Messenger forbade making an exception unless it was explicit. \n\nTirmidhi transmitted it."}},{"id":100,"idInBook":100,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَنَسٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ الْعِنَبِ حَتَّى يَسْوَدَّ وَعَنْ بَيْعِ الْحَبِّ حَتَّى يَشْتَدَّ هَكَذَا. رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ عَنْ أَنَسٍ. وَالزِّيَادَة الَّتِي فِي المصابيح وَهُوَ قولُه: نهى عَن بيْعِ التَمْرِ حَتَّى تزهوَ إِنَّما ثبتَ فِي رِوَايَتِهِمَا: عَنِ ابْنِ عُمَرَ قَالَ: نَهَى عَنْ بَيْعِ النَّخْلِ حَتَّى تَزْهُوَ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيث حسن غَرِيب","english":{"narrator":"","text":"Anas said that God's Messenger forbade the sale of grapes till they became black and the sale of grain till it had become hard. Thus Tirmidhi and Abu Dawud transmitted it from Anas. The addition which is in al-Masabih, viz., his saying that he forbade the sale of dates till they became ripe, occurs only in their version from Ibn ‘Umar who said that he forbade the sale of palm-trees till the fruit was ripe. \n\nTirmidhi said this is a hasan gharib tradition."}},{"id":101,"idInBook":101,"chapterId":11,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسلم نهى عَن بيع الكالئ بالكالئ. رَوَاهُ الدَّارَقُطْنِيّ","english":{"narrator":"","text":"Ibn ‘Umar said the Prophet forbade selling a debt to be paid at a future date for another (This is allowing a man who cannot pay a debt when it is due to have an extension of the period in return for an additional sum payable; or when a man agrees to sell an article which someone owes him for money which someone else owes to the buyer.\n\nDaraqutni transmitted it."}},{"id":102,"idInBook":102,"chapterId":11,"bookId":14,"arabic":"وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ الْعُرْبَانِ. رَوَاهُ مَالِكٌ وَأَبُو دَاوُد وَابْن مَاجَه","english":{"narrator":"","text":"‘Amr b. Shu'aib, on his father’s authority, said his grandfather told that God’s Messenger forbade the type of transaction in which earnest money was paid (An arrangement by which the earnest-money was treated as part of the price if the deal was completed but was retained if it was not completed).\n\nMalik, Abu Dawud and Ibn Majah transmitted it."}},{"id":103,"idInBook":103,"chapterId":11,"bookId":14,"arabic":"وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَن بيْعِ المضطرِّ وعنْ بيْعِ الغَرَرِ وَعَنْ بَيْعِ الثَّمَرَةِ قَبْلَ أَنْ تُدْرِكَ. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"‘Ali said God’s Messenger forbade a forced contract, one which involves some uncertainty, and the sale of fruit before it is ripe. \n\nAbu I Dawud transmitted it."}},{"id":104,"idInBook":104,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَنَسٍ: أَنَّ رَجُلًا مِنْ كِلَابٍ سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ عَسْبِ الْفَحْلِ فَنَهَاهُ فَقَالَ: يَا رَسُولَ اللَّهِ إِنَّا نُطْرِقُ الْفَحْلَ فَنُكْرَمُ فَرَخَّصَ لَهُ فِي الْكَرَامَةِ. رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Anas said that a man of Kilab asked the Prophet about hiring a stallion to cover a female and he forbade him; but when he said, \"Messenger of God, we lend a stallion to cover a female and are given a present,\" he gave him licence to accept a present. \n\nTirmidhi transmitted it."}},{"id":105,"idInBook":105,"chapterId":11,"bookId":14,"arabic":"وَعَنْ حَكِيمِ بْنِ حِزَامٍ قَالَ: نَهَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ أَبِيعَ مَا ليسَ عندِي. رَوَاهُ التِّرْمِذِيّ فِي رِوَايَةٍ لَهُ وَلِأَبِي دَاوُدَ وَالنَّسَائِيُّ: قَالَ: قُلْتُ: يَا رَسُولَ اللَّهِ يَأْتِينِي الرَّجُلُ فَيُرِيدُ مِنِّي الْبَيْعَ وَلَيْسَ عِنْدِي فَأَبْتَاعُ لَهُ مِنَ السُّوقِ قَالَ: «لَا تبِعْ مَا ليسَ عندَكَ»","english":{"narrator":"","text":"Hakim b. Hizam said God's Messenger forbade him to sell anything which was not in his possession.\n\nTirmidhi transmitted it.\n\nIn a version by Abu Dawud and Nasa’i, he had said, “Messenger of God, a man comes to me and wants me to sell him something, but I do not have it and so I buy it for him from the market.” He replied, “Do not sell what you do not possess.”"}},{"id":106,"idInBook":106,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعَتَيْنِ فِي بيعةٍ. رَوَاهُ مَالك وَالتِّرْمِذِيّ وَالنَّسَائِيّ","english":{"narrator":"Abu Huraira said God’s Messenger forbade two transactions combined in one (Making part-payment with the promise of the remainder later:","text":"or selling an article for a stated price on condition that the buyer sells article for a stated price. \n\nMalik, Tirmidhi, Abu Dawud and Nasa‘i transmitted it."}},{"id":107,"idInBook":107,"chapterId":11,"bookId":14,"arabic":"وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعَتَيْنِ فِي صَفْقَةٍ وَاحِدَةٍ. رَوَاهُ فِي شرح السّنة","english":{"narrator":"","text":"‘Amr b. Shu'aib, on his father’s authority, said his grandfather told that God’s Messenger forbade two transactions in one bargain. \n\nIt is transmitted in Sharh as-sunna."}},{"id":108,"idInBook":108,"chapterId":11,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَحِلُّ سَلَفٌ وَبَيْعٌ وَلَا شَرْطَانِ فِي بَيْعٍ وَلَا رِبْحُ مَا لَمْ يضمن وَلَا بيع مَا لَيْسَ عِنْدَكَ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالنَّسَائِيُّ وَقَالَ التِّرْمِذِيُّ: هَذَا صَحِيح","english":{"narrator":"","text":"He reported God’s Messenger as saying, “The proviso of a loan combined with a sale is not allowable, nor two conditions relating to one transaction, nor the profit arising from something which is not in one’s charge (An article belongs to the seller till the transaction is complete, and so long as it is still in his possession he is the one who gains any profit on it or bears any loss. The buyer cannot claim profit till he is in possession of the article nor selling what is not in your possession.\n\nTirmidhi, Abu Dawud and Nasa’i transmitted it, Tirmidhi saying this is a sahih tradition."}},{"id":109,"idInBook":109,"chapterId":11,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: كُنْتُ أَبِيعُ الْإِبِلَ بالنقيع بِالدَّنَانِيرِ فآخذ مَكَانهَا الدارهم وأبيع بِالدَّرَاهِمِ فَآخُذُ مَكَانَهَا الدَّنَانِيرَ فَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرْتُ ذَلِكَ لَهُ فَقَالَ: «لَا بَأْسَ أَنْ تَأْخُذَهَا بِسِعْرِ يَوْمِهَا مَا لَمْ تَفْتَرِقَا وَبَيْنَكُمَا شَيْءٌ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُد وَالنَّسَائِيّ والدارمي","english":{"narrator":"","text":"Ibn ‘Umar said he used to sell camels at an-Naqi‘for dinars and take dirhams for them, and sell for dirhams and take dinars for them. He went to the Prophet and mentioned that to him, and he replied, “There is no harm in taking them at the current rate so long as you do not separate leaving something still to be settled.” \n\nTirmidhi, Abu Dawud, Nasa’i and Darimi transmitted it."}},{"id":110,"idInBook":110,"chapterId":11,"bookId":14,"arabic":"وَعَنِ الْعَدَّاءِ بْنِ خَالِدِ بْنِ هَوْذَةَ أَخْرَجَ كِتَابًا: هَذَا مَا اشْتَرَى الْعَدَّاءُ بْنُ خَالِدِ بْنِ هَوْذَةَ مِنْ مُحَمَّدٍ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اشْترى مِنْهُ عبدا أَو أمة لَا دَاءَ وَلَا غَائِلَةَ وَلَا خِبْثَةَ بَيْعَ الْمُسْلِمِ الْمُسْلِمَ. رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ غَرِيبٌ","english":{"narrator":"Al-‘Adda’ b. Khalid b. Haudha brought out a document to this effect:","text":"This is what al-‘Adda’ b. Khalid b. Haudha brought from Muhammad, God’s Messenger. He bought from him a slave, or a slave woman, with no disease or wickedness, or anything unlawful*, a transaction between two Muslims. \n\nTirmidhi transmitted it, saying this is a gharib tradition.\n\n* This might be bad character on the part of the slave or unlawful enslavement."}},{"id":111,"idInBook":111,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَنَسٍ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَاعَ حِلْسًا وَقَدَحًا فَقَالَ: «مَنْ يَشْتَرِي هَذَا الحلس والقدح؟» فَقَالَ رجل: آخذهما بِدِرْهَمٍ. فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ يَزِيدُ عَلَى دِرْهَمٍ؟» فَأَعْطَاهُ رَجُلٌ دِرْهَمَيْنِ فَبَاعَهُمَا مِنْهُ. رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ","english":{"narrator":"","text":"Anas said that God’s Messenger offered for sale a saddle-cloth (woolen cloth placed on a camel under the pack-saddle), and a drinking-vessel, saying, “Who will buy this saddle-cloth and drinking- vessel?” A man offered to take them for a dirham and the Prophet asked whether anyone would give more. A man offered him two dirhams and he sold them to him. \n\nTirmidhi, Abu Dawud and Ibn Majah transmitted it."}},{"id":112,"idInBook":112,"chapterId":11,"bookId":14,"arabic":"عَنْ وَاثِلَةَ بْنِ الْأَسْقَعِ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم يَقُول: «من بَاعَ عَيْبا لَمْ يُنَبِّهْ لَمْ يَزَلْ فِي مَقْتِ اللَّهِ أَوْ لَمْ تَزَلِ الْمَلَائِكَةُ تَلْعَنُهُ» . رَوَاهُ ابْنُ مَاجَه","english":{"narrator":"","text":"Wathila b. al-Asqa' told that he heard God's Messenger say, \"If anyone sells a defective article without drawing attention to it, he will remain under God’s anger,\" or, “the angels will continue to curse him.” \n\nIbn Majah transmitted it."}},{"id":113,"idInBook":113,"chapterId":11,"bookId":14,"arabic":"عَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنِ ابْتَاعَ نَخْلًا بَعْدَ أَنْ تُؤَبَّرَ فَثَمَرَتُهَا لِلْبَائِعِ إِلَّا أَنْ يَشْتَرِطَ الْمُبْتَاعُ وَمَنِ ابْتَاعَ عَبْدًا وَلَهُ مَالٌ فَمَالُهُ لِلْبَائِعِ إِلَّا أَنْ يَشْتَرِطَ الْمُبْتَاعُ» . رَوَاهُ مُسلم وروى البُخَارِيّ الْمَعْنى الأول وَحده","english":{"narrator":"","text":"Ibn ‘Umar reported God’s Messenger as saying, “If anyone buys palm-trees after they have been fecundated the fruit belongs to the seller unless the buyer makes a proviso; and if anyone buys a slave who possesses property his property belongs to the seller unless the buyer makes a proviso.\" \n\nMuslim transmitted it and Bukhari transmitted something to the same effect as the first part alone."}},{"id":114,"idInBook":114,"chapterId":11,"bookId":14,"arabic":"وَعَنْ جَابِرٍ: أَنَّهُ كَانَ يَسِيرُ عَلَى جَمَلٍ لَهُ قد أعيي فَمَرَّ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهِ فَضَرَبَهُ فَسَارَ سَيْرًا لَيْسَ يَسِيرُ مِثْلَهُ ثُمَّ قَالَ: «بِعْنِيهِ بِوُقِيَّةٍ» قَالَ: فَبِعْتُهُ فَاسْتَثْنَيْتُ حُمْلَانَهُ إِلَى أَهْلِي فَلَمَّا قَدِمْتُ الْمَدِينَةَ أَتَيْتُهُ بِالْجَمَلِ وَنَقَدَنِي ثَمَنَهُ وَفِي رِوَايَةٍ فَأَعْطَانِي ثَمَنَهُ وَرَدَّهُ عَلَيَّ. مُتَّفَقٌ عَلَيْهِ. وَفِي رِوَايَةٍ لِلْبُخَارِيِّ أَنَّهُ قَالَ لِبِلَالٍ: «اقْضِهِ وَزِدْهُ» فَأَعْطَاهُ وَزَادَهُ قِيرَاطًا","english":{"narrator":"Jabir said:","text":"I was travelling on a camel of mine which had grown jaded when the Prophet passed by and struck it, with the result that it went as it had never done before. He then said, “Sell it to me for a wuqiya*”. I agreed, but made the stipulation that I should be allowed to ride it home. Then when I came to Medina I took the camel to him and he paid me its price in ready money. In a version he said, “He gave me its price and returned it to me.\" In a version by Bukhari he said to Bilal, “Pay him and give something extra,\" so he gave the money adding a qirat (A small coin, probably meaning here a sixteenth of a dirham).\n\n(Bukhari and Muslim.)\n\n*This and the more common form uqiya used below in the tradition from 'A'isha is an amount equivalent to forty dirhams."}},{"id":115,"idInBook":115,"chapterId":11,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ قَالَتْ: جَاءَتْ بَرِيرَةُ فَقَالَتْ: إِنِّي كَاتَبْتُ عَلَى تِسْعِ أَوَاقٍ فِي كُلِّ عَامٍ وُقِيَّةٌ فَأَعِينِينِي فَقَالَتْ عَائِشَةُ: إِنْ أَحَبَّ أَهْلُكِ أَنْ أَعُدَّهَا لَهُمْ عُدَّةً وَاحِدَةً وَأُعْتِقَكِ فَعَلْتُ وَيَكُونُ وَلَاؤُكِ لِي فَذَهَبَتْ إِلَى أَهْلِهَا فَأَبَوْا إِلَّا أَنْ يَكُونَ الْوَلَاءُ لَهُمْ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «خُذِيهَا وَأَعْتِقِيهَا» ثُمَّ قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي النَّاسَ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ: «أَمَّا أبعد فَمَا بَالُ رِجَالٍ يَشْتَرِطُونَ شُرُوطًا لَيْسَتَ فِي كِتَابِ اللَّهِ مَا كَانَ مِنْ شَرْطٍ لَيْسَ فِي كِتَابِ اللَّهِ فَهُوَ بَاطِلٌ وَإِنْ كَانَ مِائَةَ شَرْطٍ فَقَضَاءُ اللَّهِ أَحَقُّ وَشَرْطُ اللَّهِ أَوْثَقُ وَإِنَّمَا الْوَلَاءُ لِمَنْ أَعْتَقَ»","english":{"narrator":"‘A'isha said Barira came telling her she had arranged to buy her freedom for nine uqiyas; one to be paid annually, and asking her to help her. ‘A’isha replied, “If your people are willing that I should count them out to them all at one time and set you free, I shall do so, and I shall have the right to inherit from you.\" She went to her people, but they insisted that the right to inherit from her should be theirs, so God’s Messenger said, “Take her and set her free.\" He then stood up among the people, and after praising and extolling God, he said, “To proceed:","text":"What is the matter with people who make conditions which are not in God’s Book? Any condition which is not in God’s Book is worthless. Even if there are a hundred conditions, God’s decision is more valid and God's condition is more binding. The right of inheritance belongs only to the one who has set a person free.” \n\n(Bukhari and Muslim.)"}},{"id":116,"idInBook":116,"chapterId":11,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَن بيع الْوَلَاء وَعَن هِبته","english":{"narrator":"","text":"Ibn ‘Umar said that God’s Messenger forbade selling or giving away the right to inheritance from a manumitted slave. \n\n(Bukhari and Muslim.)"}},{"id":117,"idInBook":117,"chapterId":11,"bookId":14,"arabic":"عَنْ مَخْلَدِ بْنِ خُفَافٍ قَالَ: ابْتَعْتُ غُلَامًا فَاسْتَغْلَلْتُهُ ثُمَّ ظَهَرْتُ مِنْهُ عَلَى عَيْبٍ فَخَاصَمْتُ فِيهِ إِلَى عُمَرَ بْنِ عَبْدِ الْعَزِيزِ فَقَضَى لِي بِرَدِّهِ وَقَضَى عَلَيَّ بِرَدِّ غَلَّتِهِ فَأَتَيْتُ عُرْوَةَ فَأَخْبَرْتُهُ فَقَالَ: أَرُوحُ إِلَيْهِ الْعَشِيَّةَ فَأُخْبِرُهُ أَنَّ عَائِشَةَ أَخْبَرَتْنِي أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى فِي مِثْلِ هَذَا: أَنَّ الْخَرَاجَ بِالضَّمَانِ فَرَاحَ إِلَيْهِ عُرْوَةُ فَقَضَى لِي أَنْ آخُذَ الْخَرَاجَ مِنَ الَّذِي قَضَى بِهِ عَلَيِّ لَهُ. رَوَاهُ فِي شَرْحِ السُّنَّةِ","english":{"narrator":"Makhlad b. Khufaf said:","text":"I bought a slave and made him earn something for me, but afterwards I found a defect in him and so brought a case regarding him before ‘Umar b. ‘Abd al-‘Aziz, who decided in my favour that I should return him, but against me that I should return what he had earned. I therefore went to ‘Urwa and informed him, and he replied that he would go that evening to him and tell him he had been informed by ‘A'isha that God’s Messenger had given judgment in a similar case that any profit goes to the one who bears responsibility*. ‘Urwa went to him, and he gave judgment in my favour that I should receive the profit from the one for whom he had given the decision against me.\n* al-Kharaj bid daman. After a sale any profit which accrues belongs to the buyer.\n\nIt is transmitted in Sharh as-sunna."}},{"id":118,"idInBook":118,"chapterId":11,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا اخْتَلَفَ الْبَيِّعَانِ فَالْقَوْلُ قَوْلُ الْبَائِعِ وَالْمُبْتَاعُ بِالْخِيَارِ» . رَوَاهُ التِّرْمِذِيُّ وَفِي رِوَايَةِ ابْنِ مَاجَهْ وَالدَّارِمِيِّ قَالَ: «الْبَيِّعَانِ إِذَا اخْتَلَفَا وَالْمَبِيعُ قَائِمٌ بِعَيْنِهِ وَلَيْسَ بَيْنَهُمَا بَيِّنَةٌ فَالْقَوْلُ مَا قَالَ الْبَائِعُ أَو يترادان البيع»","english":{"narrator":"","text":"‘Abdallah b. Mas'ud reported God’s Messenger as saying, “When two people who are arranging a business transaction disagree the decision rests with the seller, but the buyer has the right to choose whether he will confirm this*.” \n\nTirmidhi transmitted it.\n\nIn the version of Ibn Majah and Darimi he said, “When two people who are arranging a business transaction disagree, the commodity being present and is neither being able to prove his case, the decision rests with the seller, or they may both reject the transaction.”\n\n* The seller swears an oath to the effect that he is right. The buyer may either agree or swear in an oath that he is right. In the latter instance the qadi cancels the deal."}},{"id":119,"idInBook":119,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَقَالَ مُسْلِمًا أقاله اللَّهُ عَثْرَتَهُ يَوْمَ الْقِيَامَةِ» . رَوَاهُ أَبُو دَاوُدَ وَابْنُ مَاجَهْ\nوَفِي «شَرْحِ السُّنَّةِ» بِلَفْظِ «الْمَصَابِيحِ» عَن شُرَيْح الشَّامي مُرْسلا","english":{"narrator":"","text":"Abu Huraira reported God’s Messenger as saying, “If anyone rescinds a sale with a Muslim, God will cancel his slip* on the day of resurrection.” \n* God will forgive his fault.\n\nAbu Dawud and Ibn Majah transmitted it; and it occurs in Sharh as-sunna with the wording in al-Masabih on the authority of Shuraih ash-Shami in mursal form."}},{"id":120,"idInBook":120,"chapterId":11,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى الله عَلَيْهِ وَسلم: \n\" اشْترى رَجُلٌ مِمَّنْ كَانَ قَبْلَكُمْ عَقَارًا مِنْ رَجُلٍ فَوَجَدَ الَّذِي اشْتَرَى الْعَقَارَ فِي عَقَارِهِ جَرَّةً فِيهَا ذَهَبٌ فَقَالَ لَهُ الَّذِي اشْتَرَى الْعَقَارَ: خُذْ ذَهَبَكَ عَنِّي إِنَّمَا اشْتَرَيْتُ الْعَقَارَ وَلَمْ أَبْتَعْ مِنْكَ الذَّهَبَ. فَقَالَ بَائِعُ الْأَرْضِ: إِنَّمَا بِعْتُكَ الْأَرْضَ وَمَا فِيهَا فَتَحَاكَمَا إِلَى رَجُلٍ فَقَالَ الَّذِي تَحَاكَمَا إِلَيْهِ: أَلَكُمَا وَلَدٌ؟ فَقَالَ أَحَدُهُمَا: لي غُلَام وَقَالَ الآخر: لي جَارِيَة. فَقَالَ: أَنْكِحُوا الْغُلَامَ الْجَارِيَةَ وَأَنْفِقُوا عَلَيْهِمَا مِنْهُ وَتَصَدَّقُوا \"","english":{"narrator":"","text":"Abu Huraira reported God’s Messenger as saying, “A man of those who were before your time bought some real estate from another, and the buyer found in what he had bought a jar containing gold. The buyer told the other to take his gold from him as he had bought from him only the property and had not bought the gold from him, but the man who had sold the land said he had sold him the land and its contents. They brought the matter before another for decision and he asked whether they had any children. When one said he had a boy and the other said he had a girl, he told them to marry the boy to the girl and spend* some of the gold on them and give sadaqa.” \n*While the dual has been used with reference to the two men, the plural is used for “marry\" and “spend’’.\n\n(Bukhari and Muslim.)"}},{"id":121,"idInBook":121,"chapterId":11,"bookId":14,"arabic":"عَنِ ابْنِ عَبَّاسٍ قَالَ: قَدِمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةَ وَهُمْ يُسْلِفُونَ فِي الثِّمَارِ السَّنَةَ وَالسَّنَتَيْنِ وَالثَّلَاثِ فَقَالَ: «مَنْ سلف فِي شَيْءٍ فَلْيُسْلِفْ فِي كَيْلٍ مَعْلُومٍ وَوَزْنٍ مَعْلُوم إِلَى أجل مَعْلُوم»","english":{"narrator":"","text":"Ibn 'Abbas said that when God’s Messenger came to Medina they were paying one, two and three years in advance for fruits, so he said, “Those who pay in advance for anything must do so for a specified measure and weight with a specified time fixed.” \n\n(Bukhari and Muslim.)"}},{"id":122,"idInBook":122,"chapterId":11,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ قَالَتِ: اشْتَرَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طَعَامًا من يَهُودِيٍّ إِلَى أَجَلٍ وَرَهَنَهُ دِرْعًا لَهُ مِنْ حَدِيد","english":{"narrator":"","text":"'A’isha said that God’s Messenger bought some grain from a Jew to be paid at a specified time, and gave him a coat of mail of his as a pledge. \n\n(Bukhari and Muslim.)"}},{"id":123,"idInBook":123,"chapterId":11,"bookId":14,"arabic":"وَعَنْهَا قَالَتْ: تُوُفِّيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَدِرْعُهُ مَرْهُونَةٌ عِنْدَ يَهُودِيٍّ بِثَلَاثِينَ صَاعا من شعير. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"She said that when God’s Messenger died his coat of mail was in pledge with a Jew for thirty sa's of barley. \n\nBukhari transmitted it."}},{"id":124,"idInBook":124,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الظَّهْرُ يُرْكَبُ بِنَفَقَتِهِ إِذَا كَانَ مَرْهُونًا وَلَبَنُ الدَّرِّ يُشْرَبُ بِنَفَقَتِهِ إِذَا كَانَ مَرْهُونًا وَعَلَى الَّذِي يركب وَيشْرب النَّفَقَة» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Abu Huraira reported God’s Messenger as saying, “An animal may be ridden for payment when it is in pledge and the milk of milch-camels may be drunk of payment when in pledge, payment being made by the one who rides and the one who drinks.” \n\nBukhari transmitted it."}},{"id":125,"idInBook":125,"chapterId":11,"bookId":14,"arabic":"عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يَغْلَقُ الرَّهْنُ الرَّهْنَ مِنْ صَاحِبِهِ الَّذِي رَهَنَهُ لَهُ غنمه وَعَلِيهِ غرمه» . رَوَاهُ الشَّافِعِي مُرْسلا\nوَرُوِيَ مثله أَو مثل مَعْنَاهُ لَا يُخَالف عَنهُ عَن أبي هُرَيْرَة مُتَّصِلا","english":{"narrator":"","text":"Sa'id b. al-Musayyib reported God’s Messenger as saying, “A pledge does not become lost to its owner when he does not redeem it in time. Any increase in its value goes to him and any loss must be borne by him.” \n\nShafi'i transmitted it in mursal form, and something similar or something with a similar meaning with no discrepancy is transmitted on the authority of Abu Huraira with a fully connected isnad."}},{"id":126,"idInBook":126,"chapterId":11,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْمِكْيَالُ مِكْيَالُ أَهْلِ الْمَدِينَةِ وَالْمِيزَانُ مِيزَانُ أَهْلِ مَكَّةَ» . رَوَاهُ أَبُو دَاوُدَ وَالنَّسَائِيّ","english":{"narrator":"","text":"Ibn ‘Umar reported the Prophet as saying, “The measure of capacity is that used by the people of Medina and the measure of weight is that used by the people of Mecca.” Abu Dawud and Nasa’i transmitted it."}},{"id":127,"idInBook":127,"chapterId":11,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأَصْحَابِ الْكَيْلِ وَالْمِيزَانِ: «إِنَّكُمْ قَدْ وُلِّيتُمْ أَمْرَيْنِ هَلَكَتْ فِيهِمَا الْأُمَمُ السَّابِقَة قبلكُمْ» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Ibn ‘Abbas reported God’s Messenger as saying to those who measured commodities by capacity and those who measured by weight, “You have been put in charge of two matters because of which peoples of the past before your time perished.” \n\nTirmidhi transmitted it."}},{"id":128,"idInBook":128,"chapterId":11,"bookId":14,"arabic":"عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَسْلَفَ فِي شَيْءٍ فَلَا يَصْرِفْهُ إِلَى غَيْرِهِ قَبْلَ أَنْ يَقْبِضَهُ» . رَوَاهُ أَبُو دَاوُدَ وَابْنُ مَاجَهْ","english":{"narrator":"","text":"Abu Sa'id al-Khudri reported God’s Messenger as saying, “If anyone pays in advance for an article he may not transfer, it to someone else before he receives it.” \n\nAbu Dawud and Ibn Majah transmitted it."}},{"id":129,"idInBook":129,"chapterId":11,"bookId":14,"arabic":"عَن معمر قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنِ احْتَكَرَ فَهُوَ خَاطِئٌ» . رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"Ma'mar reported God's Messenger as saying, “If anyone keeps goods till the price rises he is a sinner.” \n\nMuslim transmitted it."}},{"id":130,"idInBook":130,"chapterId":11,"bookId":14,"arabic":"عَنْ عُمَرَ رَضِيَ اللَّهُ عَنْهُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْجَالِبُ مَرْزُوقٌ والمحتكر مَلْعُون» . رَوَاهُ ابْن مَاجَه والدارمي","english":{"narrator":"","text":"‘Umar reported the Prophet as saying, “He who brings goods for sale is blessed with good fortune, but he who keeps them till the price rises is accursed.” \n\nIbn Majah and Darimi transmitted it."}},{"id":131,"idInBook":131,"chapterId":11,"bookId":14,"arabic":"وَعَن أنس قَالَ: غَلَا السِّعْرُ عَلَى عَهْدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالُوا: يَا رَسُولَ اللَّهِ سَعِّرْ لَنَا فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ اللَّهَ هُوَ الْمُسَعِّرُ الْقَابِضُ الْبَاسِطُ الرَّازِقُ وَإِنِّي لَأَرْجُو أَنْ أَلْقَى رَبِّي وَلَيْسَ أحد مِنْكُم يطلبنني بمظلة بِدَمٍ وَلَا مَالٍ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ","english":{"narrator":"","text":"Anas said that when prices were high in the Prophet’s time the people asked him to fix prices for them, but he replied, “God is the One who fixes prices, who withholds, gives lavishly and provides, and I hope that when I meet my Lord none of you will have any claim on me for an injustice regarding blood or property.” \n\nTirmidhi, Abu Dawud, Ibn Majah and Darimi transmitted it."}},{"id":132,"idInBook":132,"chapterId":11,"bookId":14,"arabic":"عَنْ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنِ احْتَكَرَ عَلَى الْمُسْلِمِينَ طَعَامَهُمْ ضَرَبَهُ اللَّهُ بِالْجُذَامِ وَالْإِفْلَاسِ» . رَوَاهُ ابْنُ مَاجَهْ وَالْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَانِ. وَرَزِينٌ فِي كِتَابِهِ","english":{"narrator":"","text":"‘Umar b. al-Khattab told of hearing God’s Messenger say, “If anyone keeps grain from the Muslims waiting for the price to rise, God will smite him with tubercular leprosy* and insolvency.”\n \nIbn Majah, Baihaqi, in Shu'ab al-iman, and Razin in his book transmitted it.\n\n* Judham."}},{"id":133,"idInBook":133,"chapterId":11,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنِ احْتَكَرَ طَعَامًا أَرْبَعِينَ يَوْمًا يُرِيدُ بِهِ الْغَلَاءَ فَقَدْ بَرِئَ مِنَ اللَّهِ وَبَرِئَ اللَّهُ مِنْهُ» . رَوَاهُ رَزِينٌ","english":{"narrator":"","text":"Ibn ‘Umar reported God’s Messenger as saying, “If anyone with-holds grain for forty days thereby desiring a high price, he has renounced God and God has renounced him.” \n\nRazin transmitted it."}},{"id":134,"idInBook":134,"chapterId":11,"bookId":14,"arabic":"وَعَنْ مُعَاذٍ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: \n\" بِئْسَ الْعَبْدُ الْمُحْتَكِرُ: إِنْ أَرْخَصَ اللَّهُ الْأَسْعَارَ حَزِنَ وَإِنْ أَغْلَاهَا فَرِحَ \". رَوَاهُ الْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَانِ وَرَزِينٌ فِي كِتَابِهِ","english":{"narrator":"","text":"Mu‘adh told of hearing God’s Messenger say, “The man who withholds goods is evil. If God lowers prices he is grieved, and if He raises them he is happy.” \n\nBaihaqi transmitted it in Shu'ab al-lman and Razin in his book."}},{"id":135,"idInBook":135,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَبِي أُمَامَةَ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنِ احْتَكَرَ طَعَامًا أَرْبَعِينَ يَوْمًا ثمَّ تَصَدَّقَ بِهِ لَمْ يَكُنْ لَهُ كَفَّارَةً» . رَوَاهُ رزين","english":{"narrator":"","text":"Abu Umama reported God’s Messenger as saying, “If anyone hoards grain for forty days and then gives it in sadaqa, that will not act as an atonement for him.” \n\nRazin transmitted it."}},{"id":136,"idInBook":136,"chapterId":11,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَيُّمَا رَجُلٍ أَفْلَسَ فَأَدْرَكَ رَجُلٌ مَالَهُ بِعَيْنِهِ فَهُوَ أَحَق بِهِ من غَيره»","english":{"narrator":"","text":"Abu Huraira reported God’s Messenger as saying, “If anyone becomes insolvent and a creditor finds his very property with him, he is more entitled to it than anyone else.” \n\n(Bukhari and Muslim.)"}},{"id":137,"idInBook":137,"chapterId":11,"bookId":14,"arabic":"وَعَن أبي سعيد قَالَ: أُصِيبَ رَجُلٌ فِي عَهْدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي ثِمَارٍ ابْتَاعَهَا فَكَثُرَ دينه فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «تَصَدَّقُوا عَلَيْهِ» فَتَصَّدَّقَ النَّاسُ عَلَيْهِ فَلَمْ يَبْلُغْ ذَلِك وَفَاء دينه فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِغُرَمَائِهِ «خُذُوا مَا وَجَدْتُمْ وَلَيْسَ لَكُمْ إِلَّا ذَلِك» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Sa'id said that in the time of the Prophet a man suffered loss affecting fruits he had bought and owed a large debt, so God’s messenger told the people to give him sadaqa and they did so, but as that was not enough to pay the debt in full God’s Messenger said to his creditors, “Take what you can find, but that is all you may have.” \n\nMuslim transmitted it."}},{"id":138,"idInBook":138,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" كَانَ رجل يدائن النَّاسَ فَكَانَ يَقُولُ لِفَتَاهُ: إِذَا أَتَيْتَ مُعْسِرًا تجَاوز عَنهُ لَعَلَّ الله أَن يَتَجَاوَزُ عَنَّا قَالَ: فَلَقِيَ اللَّهَ فَتَجَاوَزَ عَنْهُ \"","english":{"narrator":"","text":"Abu Huraira said that the Prophet told of a man who used to make loans and say to his servant, “When you come to one who is in straitened circumstances forgive him, for perhaps God may forgive us.” He said that when he met God He forgave him. \n\n(Bukhari and Muslim.)"}},{"id":139,"idInBook":139,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَبِي قَتَادَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ سَرَّهُ أَنْ يُنْجِيَهُ اللَّهُ مِنْ كُرَبِ يَوْمِ الْقِيَامَةِ فَلْيُنَفِّسْ عَنْ مُعْسِرٍ أَوْ يَضَعْ عَنْهُ» . رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"Abu Qatada reported God's Messenger as saying, “If anyone would like God to save him from the anxieties of the day of resurrection, he should grant a respite to one who is in straitened circumstances, or remit his debt.” \n\nMuslim transmitted it."}},{"id":140,"idInBook":140,"chapterId":11,"bookId":14,"arabic":"وَعَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنْ أَنْظَرَ مُعْسِرًا أَوْ وَضَعَ عَنْهُ أَنْجَاهُ اللَّهُ مِنْ كُرَبِ يَوْمِ الْقِيَامَة» . رَوَاهُ مُسلم","english":{"narrator":"","text":"He told of hearing God’s Messenger say, “He who grants a respite to one who is in straitened circumstances or who remits his debt will be saved by God from the anxieties of the day of resurrection.” \n\nMuslim transmitted it."}},{"id":141,"idInBook":141,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَبِي الْيَسَرِ قَالَ: سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنْ أَنْظَرَ مُعْسِرًا أَوْ وَضَعَ عَنْهُ أَظَلَّهُ اللَّهُ فِي ظِلِّهِ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abul Yasar told of hearing God’s Messenger say, “He who grants a respite to one who is in straitened circumstances or remits his debt will be taken by God under His protection.” \n\nMuslim transmitted it."}},{"id":142,"idInBook":142,"chapterId":11,"bookId":14,"arabic":"وَعَن أبي رَافع قَالَ: اسْتَسْلَفَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَكْرًا فَجَاءَتْهُ إِبِلٌ مِنَ الصَّدَقَةِ قَالَ: أَبُو رَافِعٍ فَأَمَرَنِي أَنْ أَقْضِيَ الرَّجُلَ بَكْرَهُ فَقُلْتُ: لَا أَجِدُ إِلَّا جَمَلًا خِيَارًا رَبَاعِيًا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَعْطِهِ إِيَّاهُ فَإِنَّ خَيْرَ النَّاسِ أَحْسَنُهُمْ قَضَاءً» . رَوَاهُ مُسلم","english":{"narrator":"Abu Rafi‘said:","text":"God’s Messenger borrowed a young camel, and when the camels of the sadaqa came to him he ordered me to pay the man his young camel. When I told him that I could find only an excellent camel in its seventh year he said, “Give it to him, for the best person is he who discharges his debt in the best manner.\" \n\nMuslim transmitted it."}},{"id":143,"idInBook":143,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ أَنَّ رَجُلًا تَقَاضَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَغْلَظَ لَهُ فَهَمَّ أَصْحَابُهُ فَقَالَ: «دَعُوهُ فَإِنَّ لِصَاحِبِ الْحَقِّ مَقَالًا وَاشْتَرُوا لَهُ بَعِيرًا فَأَعْطُوهُ إِيَّاهُ» قَالُوا: لَا نَجِدُ إِلَّا أَفْضَلَ مِنْ سِنِّهِ قَالَ: «اشْتَرُوهُ فَأَعْطُوهُ إِيَّاهُ فَإِنَّ خَيْرَكُمْ أحسنكم قَضَاء»","english":{"narrator":"","text":"Abu Huraira told that a man demanded payment of a debt from God's Messenger in a most uncivil manner and his companions were vexed, but he said, “Leave him alone, for one who has a right is entitled to speak, and buy him a camel and give it to him.\" When they told him that all they could find was one of a more excellent age than the man was entitled to, he said, “Buy it and give him it, for the best person among you is he who discharges his debt in the best manner.\" \n\n(Bukhari and Muslim.)"}},{"id":144,"idInBook":144,"chapterId":11,"bookId":14,"arabic":"وَعَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَطْلُ الْغَنِيِّ ظُلْمٌ فَإِذَا أُتْبِعَ أحدكُم على مَلِيء فَليتبعْ»","english":{"narrator":"","text":"He reported God's Messenger as saying, “Delay in payment by a rich man is injustice, but when one of you is referred for payment to a wealthy* man he should accept the reference.\" \n\n(Bukhari and Muslim.)\n\n*Mali'. This word is used of a wealthy man, and also of one who cannot be called wealthy but who is careful to pay his debts."}},{"id":145,"idInBook":145,"chapterId":11,"bookId":14,"arabic":"وَعَنْ كَعْبِ بْنِ مَالِكٍ: أَنَّهُ تَقَاضَى ابْنَ أَبِي حَدْرَدٍ دَيْنًا لَهُ عَلَيْهِ فِي عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْمَسْجِدِ فَارْتَفَعَتْ أَصْوَاتُهُمَا حَتَّى سَمِعَهَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ فِي بَيْتِهِ فَخَرَجَ إِلَيْهِمَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى كَشَفَ سِجْفَ حُجْرَتِهِ وَنَادَى كَعْبَ بْنَ مَالِكٍ قَالَ: «يَا كَعْبُ» قَالَ: لَبَّيْكَ يَا رَسُولَ اللَّهِ فَأَشَارَ بِيَدِهِ أَنْ ضَعِ الشَّطْرَ مِنْ دَيْنِكَ قَالَ كَعْبٌ: قَدْ فَعَلْتُ يَا رَسُولَ اللَّهِ قَالَ: «قُمْ فاقضه»","english":{"narrator":"","text":"Ka'b b. Malik said that in the time of God’s Messenger he made demand in the mosque for payment of a debt due to him from Ibn Abu Hadrad and their voices rose till God’s Messenger, who was in his house, heard them. He went out to them and removing the curtain of his chamber called to Ka'b b. Malik addressing him by name. He replied, “At your service, Messenger of God\", whereupon he made a gesture with his hand indicating that he should remit half the debt due to him, and when Ka'b expressed his willingness he told the other to get up and discharge his debt. \n\n(Bukhari and Muslim.)"}},{"id":146,"idInBook":146,"chapterId":11,"bookId":14,"arabic":"وَعَن سَلمَة بن الْأَكْوَع قَالَ: كُنَّا جُلُوسًا عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذْ أُتِيَ بِجِنَازَةٍ فَقَالُوا: صَلِّ عَلَيْهَا فَقَالَ: «هَلْ عَلَيْهِ دَيْنٌ؟» قَالُوا: لَا فَصَلَّى عَلَيْهَا ثُمَّ أُتِيَ بِجِنَازَةٍ أُخْرَى فَقَالَ: «هَل عَلَيْهِ دين؟» قَالُوا: نعم فَقَالَ: «فَهَلْ تَرَكَ شَيْئًا؟» قَالُوا: ثَلَاثَةَ دَنَانِيرَ فَصَلَّى عَلَيْهَا ثمَّ أُتِي بالثالثة فَقَالَ: «هَلْ عَلَيْهِ دَيْنٌ؟» قَالُوا: ثَلَاثَةُ دَنَانِيرَ قَالَ: «هَلْ تَرَكَ شَيْئًا؟» قَالُوا: لَا قَالَ: «صلوا على صَاحبكُم» قَالَ أَبُو قَتَادَة: صلى الله عَلَيْهِ وَسلم عَلَيْهِ يَا رَسُولَ اللَّهِ وَعَلَيَّ دَيْنُهُ فَصَلَّى عَلَيْهِ. رَوَاهُ البُخَارِيّ","english":{"narrator":"Salama b. al-Akwa' said:","text":"While we were sitting with the Prophet a bier was brought along and the Prophet was asked to pray over it. He asked whether the dead man owed anything and when he was told that he did not he prayed over it. Another bier was brought along later, and when he asked whether the dead man owed anything and was told that he did, he asked whether he had left anything. On being told that he had left three dinars he prayed over the bier. A third was brought along later, and when he asked whether the dead man owed anything and was told that he owed three dinars, he asked whether he had left anything. On being told that he had not, he ordered them to pray over their friend; but when Abu Qatada said, “Pray over him, Messenger of God, and I shall be responsible for his debt,” he prayed over him. \n\nBukhari transmitted it."}},{"id":147,"idInBook":147,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ أَخَذَ أَمْوَالَ النَّاسِ يُرِيدُ أَدَاءَهَا أَدَّى اللَّهُ عَنْهُ وَمَنْ أَخَذَ يُرِيدُ إِتْلَافَهَا أَتْلَفَهُ اللَّهُ عَلَيْهِ» . رَوَاهُ الْبُخَارِيُّ","english":{"narrator":"","text":"Abu Huraira reported the Prophet as saying, “If anyone accepts other people’s belongings meaning to pay back, God will pay back for him; but if anyone accepts them meaning to squander them, God will on that account destroy his property.” \n\nBukhari transmitted it."}},{"id":148,"idInBook":148,"chapterId":11,"bookId":14,"arabic":"وَعَن أبي قَتَادَة قَالَ: قَالَ رَجُلٌ: يَا رَسُولَ اللَّهِ أَرَأَيْتَ إِنْ قُتِلْتُ فِي سَبِيلِ اللَّهِ صَابِرًا مُحْتَسِبًا مُقبلا غير مُدبر يكفر اللَّهُ عَنِّي خَطَايَايَ؟ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «نَعَمْ» . فَلَمَّا أَدْبَرَ نَادَاهُ فَقَالَ: «نَعَمْ إِلَّا الدَّيْنَ كَذَلِكَ قَالَ جِبْرِيلُ» . رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"Abu Qatada told of a man saying, “Tell me, Messenger of God, if I am killed in God’s path showing endurance, seeking my reward from God, advancing and not retreating, will God efface my sins?” He replied, “Yes,” but when the man turned away he called him and said, “Yes, with the exception of a debt. Thus Gabriel said.” \n\nMuslim transmitted it."}},{"id":149,"idInBook":149,"chapterId":11,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «يُغْفَرُ لِلشَّهِيدِ كل ذَنْب إِلَّا الدّين» . رَوَاهُ مُسلم","english":{"narrator":"","text":"‘Abdallah b. ‘Amr reported God’s Messenger as saying, “Every fault but a debt will be forgiven to a martyr.” \n\nMuslim transmitted it."}},{"id":150,"idInBook":150,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُؤْتَى بِالرَّجُلِ الْمُتَوَفَّى عَلَيْهِ الدِّينُ فَيَسْأَلُ: «هَلْ تَرَكَ لِدَيْنِهِ قَضَاءً؟» فَإِنْ حُدِّثَ أَنَّهُ تَرَكَ وَفَاءً صَلَّى وَإِلَّا قَالَ لِلْمُسْلِمِينَ: «صَلُّوا عَلَى صَاحِبِكُمْ» . فَلَمَّا فَتَحَ اللَّهُ عَلَيْهِ الْفُتُوحَ قَامَ فَقَالَ: «أَنَا أَوْلَى بِالْمُؤْمِنِينَ مِنْ أَنْفُسِهِمْ فَمَنْ تُوفِّيَ مِنَ الْمُؤْمِنِينَ فَتَرَكَ دينا فعلي قَضَاؤُهُ وَمن ترك فَهُوَ لوَرثَته»","english":{"narrator":"Abu Huraira said that:","text":"A man who had died in debt would be brought to God’s Messenger and he would ask whether he had left any-thing to discharge his debt. If he was told ^that he had left enough he would pray, otherwise he would tell the Muslims to pray over their friend. But when God wrought the conquests at his hands he stood up and said, “I am closer to the believers than their own selves (Al-Qur’an 33:6), so if any of the believers dies leaving a debt I shall be responsible for paying it, and if anyone leaves property it goes to his heirs.” \n\n(Bukhari and Muslim.)"}},{"id":151,"idInBook":151,"chapterId":11,"bookId":14,"arabic":"عَنْ أَبِي خَلْدَةَ الزُّرَقِيِّ قَالَ: جِئْنَا أَبَا هُرَيْرَةَ فِي صَاحِبٍ لَنَا قَدْ أَفْلَسَ فَقَالَ: هَذَا الَّذِي قَضَى فِيهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَيُّمَا رَجُلٍ مَاتَ أَوْ أَفْلَسَ فَصَاحِبُ الْمَتَاعِ أَحَقُّ بِمَتَاعِهِ إِذَا وَجَدَهُ بِعَيْنِه» . رَوَاهُ الشَّافِعِي وَابْن مَاجَه","english":{"narrator":"Abu Khalda az-Zuraqi said:","text":"We went to Abu Huraira regarding a friend of ours who was insolvent and he said, “This is what God’s Messenger decided about him. If any one dies or is insolvent, the owner of the goods has most right to them if he finds his actual goods.” \n\nShafi'i and Ibn Majah transmitted it."}},{"id":152,"idInBook":152,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عَلَيْهِ وَسلم: «نَفْسُ الْمُؤْمِنِ مُعَلَّقَةٌ بِدَيْنِهِ حَتَّى يُقْضَى عَنْهُ» . رَوَاهُ الشَّافِعِيُّ وَأَحْمَدُ وَالتِّرْمِذِيُّ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ غَرِيب","english":{"narrator":"","text":"Abu Huraira reported God’s Messenger as saying, “A believer’s soul is attached to his debt till it is paid.”\n\n\nShafi‘i, Ahmad, Tirmidhi, Ibn Majah and Darimi transmitted it."}},{"id":153,"idInBook":153,"chapterId":11,"bookId":14,"arabic":"وَعَنِ الْبَرَاءِ بْنِ عَازِبٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «صَاحِبُ الدَّيْنِ مَأْسُورٌ بِدَيْنِهِ يَشْكُو إِلَى رَبِّهِ الْوَحْدَةَ يَوْمَ الْقِيَامَة» . رَوَاهُ فِي شرح السّنة\nوَرُوِيَ أَنَّ مُعَاذًا كَانَ يَدَّانُ فَأَتَى غُرَمَاؤُهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَبَاعَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَالَهُ كُلَّهُ فِي دَيْنِهِ حَتَّى قَامَ مُعَاذٌ بِغَيْرِ شَيْءٍ. مُرْسَلٌ هَذَا لَفْظُ الْمَصَابِيحِ. وَلَمْ أَجِدْهُ فِي الْأُصُول إِلَّا فِي الْمُنْتَقى","english":{"narrator":"","text":"Al-Bara’ b. ‘Azib reported God's Messenger as saying, \"A debtor is bound to his debt and will complain to his Lord of loneliness on the day of resurrection.” \n\nIt is transmitted in Sharh as-sunna. A mursal tradition is transmitted to the effect that Mu'adh was in debt and his creditors went to the Prophet who sold all his property to pay his debt, with the result that Mu'adh had nothing left. This is the wording in al-Masabih, but the only source in which I have found it is al-Muntaqa."}},{"id":154,"idInBook":154,"chapterId":11,"bookId":14,"arabic":"وَعَنْ عَبْدِ الرَّحْمَنِ بْنِ كَعْبِ بْنِ مَالِكٍ قَالَ: كَانَ مُعَاذُ بْنُ جَبَلٍ شَابًّا سَخِيًّا وَكَانَ لَا يُمْسِكُ شَيْئًا فَلَمْ يَزَلْ يُدَانُ حَتَّى أَغَرَقَ مَالَهُ كُلَّهُ فِي الدَّيْنِ فَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَلَّمَهُ لِيُكَلِّمَ غُرَمَاءَهُ فَلَوْ تَرَكُوا لِأَحَدٍ لَتَرَكُوا لِمُعَاذٍ لِأَجْلِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَبَاعَ رَسُول الله صلى الله عَلَيْهِ وَسلم مَالَهُ حَتَّى قَامَ مُعَاذٌ بِغَيْرِ شَيْءٍ. رَوَاهُ سعيد فِي سنَنه مُرْسلا","english":{"narrator":"","text":"‘Abd ar-Rahman b. Ka’b b. Malik said that Mu'adh b. Jabal was a generous young man who could save nothing and was always borrowing, so that he expended all his property on his debts. He went to the Prophet and asked him to speak to his creditors, and if they would have remitted debts to anyone they would have done it to Mu'adh for God’s Messenger’s sake, but God’s Messenger sold them his property with the result that Mu'adh had nothing left. \n\nSa'id transmitted it in his Sunan in mursal form."}},{"id":155,"idInBook":155,"chapterId":11,"bookId":14,"arabic":"وَعَنِ الشَّرِيدِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَيُّ الْوَاجِدِ يُحِلُّ عِرْضَهُ وَعُقُوبَتَهُ» قَالَ ابْنُ الْمُبَارَكِ: يُحِلُّ عِرْضَهُ: يُغَلَّظُ لَهُ. وَعُقُوبَتَهُ: يُحْبَسُ لَهُ. رَوَاهُ أَبُو دَاوُدَ وَالنَّسَائِيّ","english":{"narrator":"","text":"Ash-Sharid reported God’s Messenger as saying, ‘‘Delay in payment on the part of one who possesses the means makes it lawful to dishonour and punish him.” Ibn al-Mubarak said that “dishonour” means he may be spoken to roughly and “punish” means he may be imprisoned for it. \n\nAbu Dawud and Nasa’i transmitted it."}},{"id":156,"idInBook":156,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: أَتَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِجِنَازَةٍ لِيُصَلِّيَ عَلَيْهَا فَقَالَ: «هَلْ عَلَى صَاحِبِكُمْ دَيْنٌ؟» قَالُوا: نَعَمْ قَالَ: «هَلْ تَرَكَ لَهُ مِنْ وَفَاءٍ؟» قَالُوا: لَا قَالَ: «صَلُّوا عَلَى صَاحِبِكُمْ» قَالَ عَلِيُّ بْنُ أَبِي طَالِبٍ: عَلَيَّ دَيْنُهُ يَا رَسُولَ اللَّهِ فَتَقَدَّمَ فَصَلَّى عَلَيْهِ. وَفِي رِوَايَةٍ مَعْنَاهُ وَقَالَ: «فَكَّ اللَّهُ رِهَانَكَ مِنَ النَّارِ كَمَا فَكَكْتَ رِهَانَ أَخِيكَ الْمُسْلِمِ لَيْسَ مِنْ عَبْدٍ مُسْلِمٍ يَقْضِي عَنْ أَخِيهِ دَيْنَهُ إِلَّا فَكَّ اللَّهُ رِهَانَهُ يَوْمَ الْقِيَامَةِ» . رَوَاهُ فِي شَرْحِ السُّنَّةِ","english":{"narrator":"","text":"Abu Sa'id al-Khudrl said that a corpse was brought to the Prophet on a bier for him to pray over it and he asked the people whether their friend owed anything. On being told that he did, he asked whether he had left anything to discharge it, and when they replied that he had not, he told them to pray over him. But ‘Ali b. Abu Talib said, “I shall be responsible for his debt, Messenger of God,” so he went forward and prayed over him. A version has something to the same effect, adding that he said, “May God redeem your pledges from hell as you have redeemed the pledges of your brother Muslim! No Muslim will discharge his brother’s debt without God redeeming his pledges on the day of resurrection.” \n\nIt is transmitted in Sharh as- sunna."}},{"id":157,"idInBook":157,"chapterId":11,"bookId":14,"arabic":"وَعَنْ ثَوْبَانَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ مَاتَ وَهُوَ بَرِيءٌ مِنَ الْكِبْرِ وَالْغُلُولِ وَالدَّيْنِ دَخَلَ الْجَنَّةَ» . رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَه والدارمي","english":{"narrator":"","text":"Thauban reported God’s Messenger as saying, “If anyone dies free from pride, unfaithfulness regarding spoil, and debt, he will enter paradise.” \n\nTirmidhi, Ibn Majah and Darimi transmitted it."}},{"id":158,"idInBook":158,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَبِي مُوسَى عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ أَعْظَمَ الذُّنُوبِ عِنْدَ اللَّهِ أَنْ يَلْقَاهُ بِهَا عَبْدٌ بَعْدَ الْكَبَائِرِ الَّتِي نَهَى اللَّهُ عَنْهَا أَنْ يَمُوتَ رَجُلٌ وَعَلَيْهِ دَيْنٌ لَا يَدَعُ لَهُ قَضَاءً» . رَوَاهُ أَحْمد وَأَبُو دَاوُد","english":{"narrator":"","text":"Abu Musa reported the Prophet as saying, “The greatest sin in God's sight, after the serious sins which God has prohibited, which a man can bring into His presence is that he should die in debt without leaving enough to discharge it.” \n\nAhmad and Abu Dawud transmitted it."}},{"id":159,"idInBook":159,"chapterId":11,"bookId":14,"arabic":"وَعَن عَمْرو بن عَوْف الْمُزَنِيِّ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الصُّلْحُ جَائِزٌ بَيْنَ الْمُسْلِمِينَ إِلَّا صُلْحًا حَرَّمَ حَلَالًا أَوْ أَحَلَّ حَرَامًا وَالْمُسْلِمُونَ عَلَى شُرُوطِهِمْ إِلَّا شَرْطًا حَرَّمَ حَلَالًا أَوْ أَحَلَّ حَرَامًا» . رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ وَأَبُو دَاوُدَ وَانْتَهَتْ رِوَايَته عِنْد قَوْله «شروطهم»","english":{"narrator":"","text":"‘Amr b. ‘Auf al-Muzani reported the Prophet as saying, “Reconciliation is allowable between Muslims except such as makes unlawful something which is lawful, or makes lawful something which is unlawful ; and Muslims must keep to the conditions they have made, except for a condition which makes unlawful something which is lawful, or makes lawful something which is unlawful.” \n\nTirmidhi, Ibn Majah and Abu Dawud transmitted it, but Abu Dawud's transmission ended at “the conditions they have made.”"}},{"id":160,"idInBook":160,"chapterId":11,"bookId":14,"arabic":"عَن سُوَيْد بن قيس قَالَ: جَلَبْتُ أَنَا وَمَخَرَفَةُ الْعَبْدِيُّ بَزًّا مِنْ هَجَرٍ فَأَتَيْنَا بِهِ مَكَّةَ فَجَاءَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَمْشِي فَسَاوَمَنَا بِسَرَاوِيلَ فَبِعْنَاهُ وَثمّ رجل يزن بِالْأَجْرِ فَقَالَ لَهُ رَسُول الله: «زِنْ وَأَرْجِحْ» . رَوَاهُ أَحْمَدُ وَأَبُو دَاوُدَ وَالتِّرْمِذِيُّ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ","english":{"narrator":"Suwaid b. Qais said:","text":"Makhrafa al-‘Abdi and I imported some garments from Hajar* and brought them to Mecca. God’s Messenger came to us walking and after he had bargained with us for some trousers we sold them to him. God’s Messenger then said to a man there who was weighing out for pay, “Weigh out and give overweight.” \n*A name applied to the whole district of al-Bahrain.\n\nAhmad, Abu Dawud, Tirmidhi, Ibn Majah and Darimi transmitted it, Tirmidhi saying this is a hasan sahih tradition."}},{"id":161,"idInBook":161,"chapterId":11,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: كَانَ لِي عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَيْنٌ فَقَضَانِي وَزَادَنِي. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Jabir said the Prophet owed him a debt and gave him something extra when he paid it. \n\nAbu Dawud transmitted it."}},{"id":162,"idInBook":162,"chapterId":11,"bookId":14,"arabic":"وَعَن عبد الله بن أبي ربيعَة قَالَ: اسْتَقْرَضَ مِنِّي النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْبَعِينَ أَلْفًا فَجَاءَهُ مَالٌ فَدَفَعَهُ إِلَيَّ وَقَالَ: «بَارَكَ اللَّهُ تَعَالَى فِي أَهْلِكَ وَمَالِكَ إِنَّمَا جَزَاءُ السَّلَفِ الْحَمْدُ وَالْأَدَاءُ» . رَوَاهُ النَّسَائِيُّ","english":{"narrator":"","text":"‘Abdallah b. Abu Rabi'a said the Prophet borrowed forty thousand* from him, and when revenue came in he paid it to him saying, “God most high bless your family and your property! The only reward for a loan is commendation and repayment.” \n*The text mentions the number. It probably means dirhams.\n\nNasa’i transmitted it."}},{"id":163,"idInBook":163,"chapterId":11,"bookId":14,"arabic":"وَعَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ كَانَ لَهُ عَلَى رَجُلٍ حَقٌّ فَمَنْ أَخَّرَهُ كَانَ لَهُ بِكُلِّ يَوْمٍ صَدَقَةٌ» . رَوَاهُ أَحْمد","english":{"narrator":"","text":"'Imran b. Husain reported God’s Messenger as saying, “When anyone has something due to him from another he will be credited with sadaqa for every day he allows the other to postpone payment.”\n \nAhmad transmitted it."}},{"id":164,"idInBook":164,"chapterId":11,"bookId":14,"arabic":"وَعَن سعد بن الأطول قَالَ: مَاتَ أَخِي وَتَرَكَ ثَلَاثَمِائَةِ دِينَارٍ وَتَرَكَ وَلَدًا صِغَارًا فَأَرَدْتُ أَنْ أُنْفِقَ عَلَيْهِمْ فَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِن أخلك مَحْبُوسٌ بِدَيْنِهِ فَاقْضِ عَنْهُ» . قَالَ: فَذَهَبْتُ فَقَضَيْتُ عَنهُ وَلم تبْق إِلَّا امْرَأَةٌ تَدَّعِي دِينَارَيْنِ وَلَيْسَتْ لَهَا بَيِّنَةٌ قَالَ: «أعْطهَا فَإِنَّهَا صَدَقَة» . رَوَاهُ أَحْمد","english":{"narrator":"Sa'd b. al-Atwal said:","text":"My brother died leaving three hundred dinars and some young children, and I wanted to use them for their maintenance, but God’s Messenger said to me, “Your brother is im-prisoned by his debt, so pay it on his behalf.” I went and did so, and returned to tell God’s Messenger that I had done it and that there remained only a woman who claimed two dinars but had no proof she could show. He replied, “Give them to her, for she is speaking the truth.” \n\nAhmad transmitted it."}},{"id":165,"idInBook":165,"chapterId":11,"bookId":14,"arabic":"وَعَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ جَحْشٍ قَالَ: كُنَّا جُلُوسًا بِفِنَاءِ الْمَسْجِدِ حَيْثُ يُوضَعُ الْجَنَائِز وَرَسُول الله جَالِسٌ بَيْنَ ظَهْرَيْنَا فَرَفَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَصَره قبل السَّمَاء فَنظر ثُمَّ طَأْطَأَ بَصَرَهُ وَوَضَعَ يَدَهُ عَلَى جَبْهَتِهِ قَالَ: «سُبْحَانَ الله سُبْحَانَ الله مَا نَزَلَ مِنَ التَّشْدِيدِ؟» قَالَ: فَسَكَتْنَا يَوْمَنَا وَلَيْلَتَنَا فَلَمْ نَرَ إِلَّا خَيْرًا حَتَّى أَصْبَحْنَا قَالَ مُحَمَّدٌ: فَسَأَلْتُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مَا التَّشْدِيدُ الَّذِي نَزَلَ؟ قَالَ: «فِي الدَّيْنِ وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَوْ أَنَّ رَجُلًا قُتِلَ فِي سَبِيلِ اللَّهِ ثُمَّ عَاشَ ثُمَّ قُتِلَ فِي سَبِيلِ اللَّهِ ثُمَّ عَاشَ ثُمَّ قُتِلَ فِي سَبِيلِ اللَّهِ ثُمَّ عَاشَ وَعَلَيْهِ دَيْنٌ مَا دَخَلَ الْجَنَّةَ حَتَّى يُقْضَى دَيْنُهُ» . رَوَاهُ أَحْمَدُ وَفِي شَرْحِ السُّنَّةِ نَحْوَهُ","english":{"narrator":"Muhammad b. ‘Abdallah b. Jahsh said:","text":"When we were sitting in the courtyard of the mosque where the biers were laid down and God’s Messenger was sitting in the midst of us, he raised his eyes to the sky and looked, then lowering his eyes and putting his hand on his forehead he said, “Glory be to God, Glory be to God! What severity has come down!” We said nothing all day and night and experienced nothing but good till the morning. Then I asked God’s Messenger what the severity was which had come down, and he replied, “It has to do with debts. By Him in whose hand Muhammad’s soul is, if a man were to be killed in God’s path then come to life, be killed again in God’s path then come to life, and be killed once more in God’s path then come to life owing a debt, he would not enter paradise till his debt was paid.” \n\nAhmad transmitted it, and there is something to the same effect in Sharh as-sunna."}},{"id":166,"idInBook":166,"chapterId":11,"bookId":14,"arabic":"عَن زهرَة بن معبد: أَنَّهُ كَانَ يَخْرُجُ بِهِ جَدُّهُ عَبْدُ اللَّهِ بْنُ هِشَامٍ إِلَى السُّوقِ فَيَشْتَرِيَ الطَّعَامَ فَيَلْقَاهُ ابْنُ عُمَرَ وَابْنُ الزُّبَيْرِ فَيَقُولَانِ لَهُ: أَشْرِكْنَا فَإِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ دَعَا لَكَ بِالْبَرَكَةِ فَيُشْرِكُهُمْ فَرُبَّمَا أَصَابَ الرَّاحِلَةَ كَمَا هِيَ فَيَبْعَثُ بِهَا إِلَى الْمَنْزِلِ وَكَانَ عَبْدُ اللَّهِ بْنُ هِشَامٍ ذَهَبَتْ بِهِ أُمُّهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَسَحَ رَأسه ودعا لَهُ بِالْبركَةِ. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Zuhra b. Ma'bad said his grandfather 'Abdallah b. Hisham would take him out to the market and buy grain, and Ibn ‘Umar and Ibn az- Zubair would meet him and say to him, “Take us into partnership, for the Prophet has invoked a blessing on you then he would take them into partnership. He would often make a profit of a camel-load* and send it to the house. ‘Abdallah b. Hisham had been taken by his mother to the Prophet who passed his hand over his head and invoked a blessing on him. \n\nBukhari transmitted it.\n\n* Another explanation is that this means he made enough profit to buy a camel with its load' Cf. Mirqat, iii, 344."}},{"id":167,"idInBook":167,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَتِ الْأَنْصَارُ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: اقْسِمْ بَيْنَنَا وَبَيْنَ إِخْوَاننَا النخيل قَالَ: «لَا تكفوننا المؤونة وَنَشْرَكْكُمْ فِي الثَّمَرَةِ» . قَالُوا: سَمِعْنَا وَأَطَعْنَا. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Abu Huraira told that the Ansar asked the Prophet to divide the palm-trees between them and their brethren, but he replied, “No; save us the trouble of maintenance and we shall share the fruit with you.” They said, “We hear and we obey.\" \n\nBukhari transmitted it."}},{"id":168,"idInBook":168,"chapterId":11,"bookId":14,"arabic":"وَعَن عُرْوَة بن أبي الْجَعْد الْبَارِقي: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْطَاهُ دِينَارًا لِيَشْتَرِيَ بِهِ شَاةً فَاشْتَرَى لَهُ شَاتين فَبَاعَ إِحْدَاهمَا بِدِينَار وَأَتَاهُ بِشَاة ودينار فَدَعَا لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي بَيْعِهِ بِالْبَرَكَةِ فَكَانَ لَوِ اشْتَرَى تُرَابا لربح فِيهِ. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"‘Urwa b. Abul Ja‘d al-Bariqi said that God’s Messenger gave him a dinar to buy a sheep for him. He bought two sheep for him, sold one of them for a dinar and brought him a sheep and dinar. So God’s Messenger invoked a blessing on him in his business dealings, and he was such that if he had bought dust he would have made a profit from it. \n\nBukhari transmitted it."}},{"id":169,"idInBook":169,"chapterId":11,"bookId":14,"arabic":"عَن أبي هُرَيْرَة رَفَعَهُ قَالَ: \n\" إِنَّ اللَّهَ عَزَّ وَجَلَّ يَقُولُ: أَنا ثَالِث الشَّرِيكَيْنِ مَا لم يخن صَاحِبَهُ فَإِذَا خَانَهُ خَرَجْتُ مِنْ بَيْنِهِمَا \". رَوَاهُ أَبُو دَاوُد وَزَاد رزين: «وَجَاء الشَّيْطَان»","english":{"narrator":"","text":"Abu Huraira traced to the Prophet the statement that God who is great and glorious says, “I make a third with two partners as long as one of them does not cheat the other, but when he cheats him I depart from them.\" \n\nAbu Dawud transmitted it and Razin added, “and the devil comes.\""}},{"id":170,"idInBook":170,"chapterId":11,"bookId":14,"arabic":"وَعَنْهُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أَدِّ الْأَمَانَةَ إِلَى مَنِ ائْتَمَنَكَ وَلَا تَخُنْ مَنْ خَانَكَ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالدَّارِمِيُّ","english":{"narrator":"","text":"He reported the Prophet as saying, “Place trust in him who trusts you, but do not cheat him who cheats you.” \n\nTirmidhi, Abu Dawud and Darimi transmitted it."}},{"id":171,"idInBook":171,"chapterId":11,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: أَرَدْتُ الْخُرُوجَ إِلَى خَيْبَرَ فَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَلَّمْتُ عَلَيْهِ وَقُلْتُ: إِنِّي أَرَدْتُ الْخُرُوجَ إِلَى خَيْبَرَ فَقَالَ: «إِذَا أَتَيْتَ وَكِيلِي فَخُذْ مِنْهُ خَمْسَةَ عَشَرَ وَسْقًا فَإِنِ ابْتَغَى مِنْكَ آيَةً فَضَعْ يدك على ترقوته» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Jabir said he intended to go to Khaibar, so he went to the Prophet, gave him a salutation and told him of his purpose. He replied, “When you come to my agent take fifteen camel-loads from him, and if he desires a sign from you put your hand on his collar-bone*”. \n*This was evidently a pre-arranged sign to show that the Messenger was genuine.\n\nAbu Dawud transmitted it."}},{"id":172,"idInBook":172,"chapterId":11,"bookId":14,"arabic":"عَن صُهَيْبٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" ثَلَاثٌ فِيهِنَّ الْبَرَكَةُ: الْبَيْعُ إِلَى أَجَلٍ والمقارضة واخلاط الْبُرِّ بِالشَّعِيرِ لِلْبَيْتِ لَا لِلْبَيْعِ \". رَوَاهُ ابْنُ مَاجَه","english":{"narrator":"Suhaib reported God's Messenger as saying, “There are three things which contain blessing:","text":"A business transaction with a time specified, muqarada* and mixing wheat and barley for one’s household but not for sale.” \n\nIbn Majah transmitted it.\n\n* Giving someone some property to trade with, the profit being shared between the two, but any loss falling on the property."}},{"id":173,"idInBook":173,"chapterId":11,"bookId":14,"arabic":"وَعَن حَكِيم بن حزَام أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَ مَعَهُ بِدِينَارٍ لِيَشْتَرِيَ لَهُ بِهِ أُضْحِيَّةً فَاشْتَرَى كَبْشًا بِدِينَارٍ وَبَاعَهُ بِدِينَارَيْنِ فَرَجَعَ فَاشْتَرَى أُضْحِيَّةً بِدِينَارٍ فَجَاءَ بِهَا وَبِالدِّينَارِ الَّذِي اسْتَفْضَلَ من الْأُخْرَى فَتصدق رَسُول الله صلى بِالدِّينَارِ فَدَعَا لَهُ أَنْ يُبَارَكَ لَهُ فِي تِجَارَته. رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Hakim b. Hizam said God's Messenger sent him with a dinar to buy a sacrificial animal for him. He bought a sheep for a dinar, sold it for two, came back, bought a sacrificial animal for a dinar, and brought it along with the extra dinar which he had gained. God’s Messenger gave the dinar as sadaqa and asked a blessing on him in his trading. \n\nTirmidhi and Abu Dawud transmitted it."}},{"id":174,"idInBook":174,"chapterId":11,"bookId":14,"arabic":"عَن سعيد بْنِ زَيْدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَخَذَ شِبْرًا مِنَ الْأَرْضِ ظُلْمًا فَإِنَّهُ يُطَوَّقُهُ يَوْمَ الْقِيَامَةِ مِنْ سبع أَرضين»","english":{"narrator":"","text":"Sa'id b. Zaid reported God’s Messenger as saying, “If anyone takes a span of land unjustly, its extent taken from seven earths will be tied round his neck on the day of resurrection.” \n\n(Bukhari and Muslim.)"}},{"id":175,"idInBook":175,"chapterId":11,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَحْلُبَنَّ أَحَدٌ مَاشِيَةَ امْرِئٍ بِغَيْرِ إِذْنِهِ أَيُحِبُّ أَحَدُكُمْ أَنْ يُؤْتى مشْربَته فتكسر خزانته فَينْتَقل طَعَامُهُ وَإِنَّمَا يَخْزُنُ لَهُمْ ضُرُوعُ مَوَاشِيهِمْ أَطَعِمَاتِهِمْ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Ibn ‘Umar reported God’s Messenger as saying, “No one must milk a man’s animal without his permission. Would any of you like his upper chamber to be entered, his treasury broken into, and his food taken away? The udders of their animals store up their food for them.” \n\nMuslim transmitted it."}},{"id":176,"idInBook":176,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عِنْدَ بَعْضِ نِسَائِهِ فَأَرْسَلَتْ إِحْدَى أُمَّهَاتِ الْمُؤْمِنِينَ بِصَحْفَةٍ فِيهَا طَعَامٌ فَضَرَبَتِ الَّتِي النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي بَيْتِهَا يَدَ الْخَادِمِ فَسَقَطَتِ الصَّحْفَةُ فَانْفَلَقَتْ فَجَمَعَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِلَقَ الصَّحْفَةِ ثُمَّ جَعَلَ يَجْمَعُ فِيهَا الطَّعَامَ الَّذِي كَانَ فِي الصَّحْفَةِ وَيَقُولُ: «غَارَتْ أُمُّكُمْ» ثُمَّ حَبَسَ الْخَادِمَ حَتَّى أُتِيَ بِصَحْفَةٍ مِنْ عِنْدِ الَّتِي هُوَ فِي بَيْتُهَا فَدَفَعَ الصَّحْفَةَ الصَّحِيحَةَ إِلَى الَّتِي كُسِرَتْ صَحْفَتُهَا وَأَمْسَكَ الْمَكْسُورَةَ فِي بَيْتِ الَّتِي كَسَرَتْ. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Anas said that when the Prophet was with one of his wives one of the mothers of the faithful sent a bowl containing food and the one in whose house he was struck the servant’s hand with the result that the bowl fell and was broken in pieces. The Prophet collected the pieces of the bowl, then began to collect in it the food it had contained, saying, “Your mother is jealous.” He then detained the servant till a bowl was produced by the one in whose house he was, gave the sound bowl to the one whose bowl had been broken and kept the broken one in the house of the one who broke it. \n\nBukhari transmitted it."}},{"id":177,"idInBook":177,"chapterId":11,"bookId":14,"arabic":"وَعَن عبد الله بن يزِيد عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أَنَّهُ نهى عَن النهبة والمثلة. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"‘Abdallah b. Yazid said that the Prophet forbade spoliation1 and mutilation2.\n\nBukhari transmitted it.\n\n1. Either taking some of the spoil in battle before the division of the booty has been made, or appropriating anything belonging to a Muslim.\n2. The reference here may simply be to cutting off certain parts of animals, but it can apply to human beings as well."}},{"id":178,"idInBook":178,"chapterId":11,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: انْكَسَفَتِ الشَّمْسُ فِي عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ مَاتَ إِبْرَاهِيمُ بْنُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَصَلَّى بِالنَّاسِ سِتَّ رَكَعَاتٍ بِأَرْبَعِ سَجَدَاتٍ فَانْصَرَفَ وَقَدْ آضَتِ الشَّمْسُ وَقَالَ: \n\" مَا مِنْ شَيْءٍ تُوعَدُونَهُ إِلَّا قَدْ رَأَيْتُهُ فِي صَلَاتِي هَذِهِ لَقَدْ جِيءَ بِالنَّارِ وَذَلِكَ حِينَ رَأَيْتُمُونِي تَأَخَّرْتُ مَخَافَةَ أَنْ يُصِيبَنِي مِنْ لَفْحِهَا وَحَتَّى رَأَيْتُ فِيهَا صَاحِبَ الْمِحْجَنِ يَجُرُّ قُصْبَهُ فِي النَّارِ وَكَانَ يسرق الْحَاج بمحجته فَإِن فطن لَهُ قَالَ: إِنَّمَا تعلق بمحجتي وَإِنْ غُفِلَ عَنْهُ ذَهَبَ بِهِ وَحَتَّى رَأَيْتُ فِيهَا صَاحِبَةَ الْهِرَّةِ الَّتِي رَبَطَتْهَا فَلَمْ تُطْعِمْهَا وَلَمْ تَدَعْهَا تَأْكُلُ مِنْ خَشَاشِ الْأَرْضِ حَتَّى مَاتَتْ جُوعًا ثُمَّ جِيءَ بِالْجَنَّةِ وَذَلِكَ حِينَ رَأَيْتُمُونِي تَقَدَّمْتُ حَتَّى قُمْتُ فِي مَقَامِي وَلَقَدْ مَدَدْتُ يَدِي وَأَنَا أُرِيدُ أَنْ أَتَنَاوَلَ مِنْ ثَمَرَتِهَا لِتَنْظُرُوا إِلَيْهِ ثُمَّ بَدَا لِي أَنْ لَا أفعل \". رَوَاهُ مُسلم","english":{"narrator":"","text":"Jabir said that in the time of God’s Messenger there was a solar eclipse on the day his son Ibrahim died, and he led the people in a prayer of six rak'as with four sajdas, finishing when the sun came out of the eclipse. He then said, “There is nothing you have been promised which I have not seen during this prayer of mine. Hell was brought, and that was when you saw me draw back from fear that some of its heat might strike me. I saw in it, dragging his entrails in hell, the owner of the crooked stick who used to steal from pilgrims with his crooked stick saying, if it was noticed, that the article had accidentally attached itself to the stick, but going off with it if it was not noticed. I also saw the woman who possessed a cat which she tied up and did not feed or allow it to go and eat of the creeping things on the ground with the result that it died of hunger. Then paradise was brought, and that was when you saw me go forward and stand in my place and stretch out my hand meaning to take some of its fruit that you might look at it; but I thought it better not to do so.” \n\nMuslim transmitted it."}},{"id":179,"idInBook":179,"chapterId":11,"bookId":14,"arabic":"وَعَن قَتَادَة قَالَ: سَمِعْتُ أَنَسًا يَقُولُ: كَانَ فَزَعٌ بِالْمَدِينَةِ فَاسْتَعَارَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَسًا مِنْ أَبِي طَلْحَةَ يُقَالُ لَهُ: الْمَنْدُوبُ فَرَكِبَ فَلَمَّا رَجَعَ قَالَ: «مَا رَأَيْنَا مِنْ شَيْءٍ وَإِن وَجَدْنَاهُ لبحرا»","english":{"narrator":"","text":"Qatada told of hearing Anas say that when there was an alarm in Medina the Prophet borrowed from Abu Talha a horse called al-Mandub which he rode. When he returned he said, “I did not see anything, and I found that the horse could run as speedily as a great river.” \n\n(Bukhari and Muslim.)"}},{"id":180,"idInBook":180,"chapterId":11,"bookId":14,"arabic":"عَن سعيد بْنِ زَيْدٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ: «من أحيى أَرْضًا مَيْتَةً فَهِيَ لَهُ وَلَيْسَ لِعِرْقٍ ظَالِمٍ حق» . رَوَاهُ أَحْمد وَالتِّرْمِذِيّ وَأَبُو دَاوُد\nوَرَوَاهُ مَالِكٌ عَنْ عُرْوَةَ مُرْسَلًا. وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ","english":{"narrator":"","text":"Sa'id b. Zaid reported the Prophet as saying, “If anyone makes barren land fertile it belongs to him, but no right pertains to one who plants wrongfully in land another has brought into cultivation*”. \n\nAhmad, Tirmidhi and Abu Dawud transmitted it, and Malik transmitted it in mursal form on the authority of ‘Urwa. Tirmidhi said this is a hasan gharib tradition.\n\n*'Irq zalim, the literal translation would be “a wrongful root.” The translation given above represents the general sense of the phrase."}},{"id":181,"idInBook":181,"chapterId":11,"bookId":14,"arabic":"وَعَن أبي حرَّة الرقاشِي عَن عَمه قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «أَلا تَظْلِمُوا أَلَا لَا يَحِلُّ مَالُ امْرِئٍ إِلَّا بِطِيبِ نَفْسٍ مِنْهُ» . رَوَاهُ الْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَان وَالدَّارَقُطْنِيّ فِي الْمُجْتَبى","english":{"narrator":"","text":"Abu Hurra ar-Raqashi on his paternal uncle’s authority reported God’s Messenger as saying, “You must not act oppressively, and a man’s property may not be taken except with his goodwill.” \n\nBaihaqi transmitted it in Shu'ab al-iman and Daraqutni in al-Mujtaba."}},{"id":182,"idInBook":182,"chapterId":11,"bookId":14,"arabic":"وَعَن عمرَان ابْن حُصَيْنٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ: «لَا جَلَبَ وَلَا جَنَبَ وَلَا شِغَارَ فِي الْإِسْلَامِ وَمَنِ انْتَهَبَ نُهْبَةً فَلَيْسَ مِنَّا» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"‘Imran b. Husain reported the Prophet as saying, “Having someone to urge on a horse from behind in a race, having a horse beside the one that is being ridden in a race to which the rider may transfer1, and giving a woman in marriage in return for another without dowry2 are not allowed in Islam, and he who plunders does not belong to us.” \n\nTirmidhi transmitted it.\n\n1. Ia jalaba wala janaba. One meaning of the phrase is that expressed in the translation, and is most likely to be the one intended here. Another meaning is that a collector of zakat must notdem and that animals be brought to him from a distance, and people must not remove their animals to a distance when they hear that the zakat collector is coming to them. Cf. p. 375.\n\n2. Shighar."}},{"id":183,"idInBook":183,"chapterId":11,"bookId":14,"arabic":"يزِيد عَنْ أَبِيهِ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يَأْخُذُ أَحَدُكُمْ عَصَا أَخِيهِ لَاعِبًا جَادًّا فَمَنْ أَخَذَ عَصَا أَخِيهِ فَلْيَرُدَّهَا إِلَيْهِ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَرِوَايَتُهُ إِلَى قَوْله: «جادا»","english":{"narrator":"","text":"As-Sa’ib b. Yazid on his father’s authority reported the Prophet as saying, “None of you must take his brother’s staff jestingly with the intention of causing annoyance. Anyone who takes his brother’s staff must return it to him.” \n\nTirmidhi and Abu Dawud transmitted it, the latter’s version ending at “causing annoyance.”"}},{"id":184,"idInBook":184,"chapterId":11,"bookId":14,"arabic":"وَعَن سَمُرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ وَجَدَ عَيْنَ مَالِهِ عِنْدَ رَجُلٍ فَهُوَ أَحَقُّ بِهِ وَيَتَّبِعُ الْبَيِّعُ مَنْ بَاعَهُ» . رَوَاهُ أَحْمد وَأَبُو دَاوُد وَالنَّسَائِيّ","english":{"narrator":"","text":"Samura reported the Prophet as saying, “If anyone finds his actual property with someone he has most right to it, and the buyer must sue the one who made the sale.” \n\nAhmad, Abu Dawud and Nasa’i transmitted it."}},{"id":185,"idInBook":185,"chapterId":11,"bookId":14,"arabic":"وَعَنْهُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «عَلَى الْيَدِ مَا أَخَذَتْ حَتَّى تُؤَدِّيَ» . رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد وَابْن مَاجَه","english":{"narrator":"","text":"He reported the Prophet as saying, “The hand which takes is responsible till it pays.” \n\nTirmidhi, Abu Dawud and Ibn Majah transmitted it."}},{"id":186,"idInBook":186,"chapterId":11,"bookId":14,"arabic":"وَعَن حَرَامِ بْنِ سَعْدِ بْنِ مُحَيِّصَةَ: أَنَّ نَاقَةً لِلْبَرَاءِ بْنِ عَازِبٍ دَخَلَتْ حَائِطًا فَأَفْسَدَتْ فَقَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَن أَهْلِ الْحَوَائِطِ حِفْظَهَا بِالنَّهَارِ وَأَنَّ مَا أَفْسَدَتِ الْمَوَاشِي بِاللَّيْلِ ضَامِنٌ عَلَى أَهْلِهَا. رَوَاهُ مَالِكٌ وَأَبُو دَاوُد وَابْن مَاجَه","english":{"narrator":"","text":"Haram b; Sa‘d b. Muhayyisa said that when a she-camel belonging to al-Bara’ b. ‘Azib entered a garden and did damage, God’s Messenger gave decision that the owners of gardens are responsible for guarding them by day, but that any damage done by animals during the night is a responsibility lying on their owners. \n\nMalik, Abu Dawud and Ibn Majah transmitted it."}},{"id":187,"idInBook":187,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الرجل جَبَّار وَالنَّار جَبَّار» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Abu Huraira reported the Prophet as saying that no recompense may be demanded if a foot is trodden on*, and that the same applies in the case of fire. \n\nAbu Dawud transmitted it.\n\n* Or it may mean that no recompense may be demanded if one is kicked by an animal."}},{"id":188,"idInBook":188,"chapterId":11,"bookId":14,"arabic":"وَعَن الْحسن عَن سَمُرَة أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا أَتَى أَحَدُكُمْ عَلَى مَاشِيَةٍ فَإِنْ كَانَ فِيهَا صَاحِبُهَا فَلْيَسْتَأْذِنْهُ وَإِنْ لَمْ يَكُنْ فِيهَا فَلْيُصَوِّتْ ثَلَاثًا فَإِنْ أَجَابَهُ أَحَدٌ فَلْيَسْتَأْذِنْهُ وَإِنْ لَمْ يُجِبْهُ أَحَدٌ فَلْيَحْتَلِبْ وَلْيَشْرَبْ وَلَا يَحْمِلْ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Al-Hasan on Samura’s authority reported the Prophet as saying, “When any of you comes upon animals whose owner is among them he must ask his permission; if not he must call three times and if anyone answers him he must ask his permission; but if no one answers him he may draw some milk and drink, but not carry any away.” \n\nAbu Dawud transmitted it."}},{"id":189,"idInBook":189,"chapterId":11,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ دَخَلَ حَائِطًا فَلْيَأْكُلْ وَلَا يَتَّخِذْ خُبْنَةً» . رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ وَقَالَ التِّرْمِذِيُّ هَذَا حَدِيث غَرِيب","english":{"narrator":"","text":"Ibn ‘Umar reported the Prophet as saying, “If anyone enters a garden he may eat, but he must not take anything away in his clothing.”\n\nTirmidhi and Ibn Majah transmitted it, Tirmidhi saying this is a gharib tradition."}},{"id":190,"idInBook":190,"chapterId":11,"bookId":14,"arabic":"وَعَن أُميَّة بن صَفْوَان عَنْ أَبِيهِ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْتَعَارَ مِنْهُ أَدْرَاعَهُ يَوْمَ حُنَيْنٍ فَقَالَ: أَغَصْبًا يَا مُحَمَّدَ؟ قَالَ: «بَلْ عَارِيَةً مَضْمُونَةً» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Umayya b. Safwan quoted his father as saying that at the battle of Hunain the Prophet borrowed his coats of mail and he asked, “Are you taking them by force, Muhammad ?” to which he replied, “No, it is a loan with a guarantee of their return.'’ \n\nAbu Dawud transmitted it."}},{"id":191,"idInBook":191,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَبِي أُمَامَةَ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «الْعَارِيَةُ مُؤَدَّاةٌ وَالْمِنْحَةٌ مَرْدُودَةٌ وَالدَّيْنُ مَقْضِيٌّ وَالزَّعِيمُ غَارِمٌ» . رَوَاهُ النرمذي وَأَبُو دَاوُد","english":{"narrator":"","text":"Abu Umama told of hearing God's Messenger say, “A loan must be paid back, a minha* must be returned, a debt must be discharged, and one who stands surety is held responsible.” \n\nTirmidhi and Abu Dawud transmitted it.\n\n*This may be a she camel lent for a time for milking, but it can be used of other things which are lent for some specific purpose."}},{"id":192,"idInBook":192,"chapterId":11,"bookId":14,"arabic":"وَعَن رَافع بن عَمْرو الْغِفَارِيّ قَالَ: كُنْتُ غُلَامًا أَرْمِي نَخْلَ الْأَنْصَارِ فَأُتِيَ بِيَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «يَا غُلَامُ لِمَ تَرْمِي النَّخْلَ؟» قُلْتُ: آكُلُ قَالَ: «فَلَا تَرْمِ وَكُلْ مِمَّا سَقَطَ فِي أَسْفَلِهَا» ثُمَّ مَسَحَ رَأْسَهُ فَقَالَ: «اللَّهُمَّ أَشْبِعْ بَطْنَهُ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ","english":{"narrator":"Rafi' b. 'Amr al-Ghifari said:","text":"When I was a boy I used to throw stones at the palm-trees belonging to the Ansar and was brought to the Prophet. He asked, “Why do you throw stones at the palm-trees, boy?” and when I replied that it was to get something to eat he said, “Do not' throw stones, but you may eat anything that falls below them.” Then passing his hand over my head he said, “O God, fill his belly.” \n\nTirmidhi, Abu Dawud and Ibn Majah transmitted it."}},{"id":193,"idInBook":193,"chapterId":11,"bookId":14,"arabic":"عَن سَالم عَنْ أَبِيهِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَخَذَ مِنَ الْأَرْضِ شَيْئًا بِغَيْرِ حَقِّهِ خُسِفَ بِهِ يَوْمَ الْقِيَامَةِ إِلَى سبع أَرضين» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Salim reported on his father's authority that God’s Messenger said, \"If anyone takes any land without having a right he will be swallowed up seven earths deep on the day of resurrection.” \n\nBukhari transmitted it."}},{"id":194,"idInBook":194,"chapterId":11,"bookId":14,"arabic":"وَعَن يعلى بن مرّة قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنْ أَخَذَ أَرْضًا بِغَيْرِ حَقِّهَا كُلِّفَ أَنْ يَحْمِلَ تُرَابَهَا الْمَحْشَرَ» . رَوَاهُ أَحْمَدُ","english":{"narrator":"","text":"Ya'la b. Murra told of hearing God’s Messenger say, “If anyone seizes land to which he has no right he will be made to carry its earth at the resurrection.” \n\nAhmad transmitted it."}},{"id":195,"idInBook":195,"chapterId":11,"bookId":14,"arabic":"وَعَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «أَيُّمَا رَجُلٍ ظَلَمَ شِبْرًا مِنَ الْأَرْضِ كَلَّفَهُ اللَّهُ عَزَّ وَجَلَّ أَنْ يَحْفِرَهُ حَتَّى يَبْلُغَ آخِرَ سَبْعِ أَرَضِينَ ثُمَّ يُطَوَّقَهُ إِلَى يَوْمِ الْقِيَامَةِ حَتَّى يُقْضَى بَيْنَ النَّاس» . رَوَاهُ أَحْمد","english":{"narrator":"","text":"He told of hearing God’s Messenger say, “If anyone wrongly takes a span of land God who is great and glorious will make him dig it till he gets to the end of seven earths, and then he will have it tied round his neck till the day of resurrection until men are judged.” \n\nAhmad transmitted it."}},{"id":196,"idInBook":196,"chapterId":11,"bookId":14,"arabic":"عَنْ جَابِرٍ قَالَ: قَضَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالشُّفْعَةِ فِي كُلِّ مَا لَمْ يُقْسَمْ فَإِذَا وَقَعَتِ الْحُدُودُ وَصُرِفَتِ الطُّرُقُ فَلَا شُفْعَة. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Jabir said the Prophet decreed the right to buy neighbouring property applicable to everything which is not divided, but when boundaries were fixed and separate roads made there was no option. \n\nBukhari transmitted it."}},{"id":197,"idInBook":197,"chapterId":11,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالشُّفْعَةِ فِي كُلِّ شَرِكَةٍ لَمْ تُقْسَمْ رَبْعَةٍ أَوْ حَائِطٍ: «لَا يَحِلُّ لَهُ أَن يَبِيع حَتَّى يُؤذن شَرِيكه فَإِن شَاءَ أَخَذَ وَإِنْ شَاءَ تَرَكَ فَإِذَا بَاعَ وَلَمْ يُؤْذِنْهُ فَهُوَ أَحَقُّ بِهِ» . رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"He said that God’s Messenger decreed the right of option regarding everything which is shared, whether a dwelling or a garden, when it had not been divided. It is not lawful to sell before informing one’s partner who may take it or let it go as he wishes ; but if he sells without informing him, he has the greatest right to it. \n\nMuslim transmitted it."}},{"id":198,"idInBook":198,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَبِي رَافِعٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْجَارُ أَحَقُّ بِسَقَبِهِ» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Abu Rafi ‘reported God’s Messenger as saying, “The neighbour has the best claim by reason of his being near.” \n\nBukhari transmitted it."}},{"id":199,"idInBook":199,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَمْنَعْ جَارٌ جَارَهُ أَنْ يَغْرِزَ خَشَبَةً فِي جِدَاره»","english":{"narrator":"","text":"Abu Huraira reported God’s Messenger as saying, “One must not prevent his neighbour from fixing a beam in his wall.” \n\n(Bukhari and Muslim.)"}},{"id":200,"idInBook":200,"chapterId":11,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا اخْتَلَفْتُمْ فِي الطَّرِيقِ جُعِلَ عرضه سَبْعَة أَذْرع» . رَوَاهُ مُسلم","english":{"narrator":"","text":"He reported God’s Messenger as saying, “When you disagree about a road its breadth should be made seven cubits.” \n\nMuslim transmitted it."}},{"id":201,"idInBook":201,"chapterId":11,"bookId":14,"arabic":"عَن سعيد بن حُرَيْث قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنْ بَاعَ مِنْكُمْ دَارًا أَوْ عَقَارًا قَمِنٌ أَنْ لَا يُبَارَكُ لَهُ إِلَّا أَنْ يَجْعَلَهُ فِي مِثْلِهِ» . رَوَاهُ ابْنُ مَاجَهْ والدارمي","english":{"narrator":"","text":"Sa'id b. Huraith told of hearing God’s Messenger say, “If any of you sells a house or real estate it is right that he should not have a blessing unless he spends what he gets on something similar.” \n\nIbn Majah and Darimi transmitted it."}},{"id":202,"idInBook":202,"chapterId":11,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْجَارُ أَحَقُّ بِشُفْعَتِهِ يُنْتَظَرُ لَهَا وَإِنْ كَانَ غَائِبًا إِذَا كَانَ طَرِيقُهُمَا وَاحِدًا» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ. والدارمي","english":{"narrator":"","text":"Jabir reported God’s Messenger as saying, “The neighbour is most entitled to the right of option and its exercise should be waited for even if he is absent, when the two properties have one road.” \n\nAhmad, Tirmidhi, Abu Dawud, Ibn Majah and Darimi transmitted it."}},{"id":203,"idInBook":203,"chapterId":11,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الشَّرِيكُ شَفِيعٌ وَالشُّفْعَةُ فِي كل شَيْء» . رَوَاهُ التِّرْمِذِيّ قَالَ:\nوَقَدْ رُوِيَ عَنِ ابْنِ أَبِي مُلَيْكَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُرْسَلًا وَهُوَ أصح","english":{"narrator":"","text":"Ibn ‘Abbas reported the Prophet as saying, \"The partner has first right to buy neighbouring property and the option to buy applies to everything.” \n\nTirmidhi transmitted it, saying it has been transmitted on the authority of Ibn Abu Mulaika who quoted the Prophet in mursal form, and it is sounder."}},{"id":204,"idInBook":204,"chapterId":11,"bookId":14,"arabic":"وَعَن عبد الله بن جحش قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ قَطَعَ سِدْرَةً صَوَّبَ اللَّهُ رَأْسَهُ فِي النَّارِ» . رَوَاهُ أَبُو دَاوُدَ وَقَالَ: هَذَا الْحَدِيثُ مُخْتَصَرٌ يَعْنِي: مَنْ قَطَعَ سِدْرَةً فِي فَلَاةٍ يَسْتَظِلُّ بِهَا ابْنُ السَّبِيلِ وَالْبَهَائِمُ غَشْمًا وَظُلْمًا بِغَيْرِ حَقٍّ يَكُونُ لَهُ فِيهَا صَوَّبَ الله رَأسه فِي النَّار","english":{"narrator":"","text":"‘Abdallah b. Hubaish reported God's Messenger as saying, ‘‘If anyone cuts down a lote tree, God will lower his head in hell.” \n\nAbu Dawud transmitted it, saying this is an abbreviated tradition meaning that if anyone wrongfully, unjustly and with no benefit to him from it cuts down in a desert a lote tree under which travellers and animals seek shade, God will lower his head in hell."}},{"id":205,"idInBook":205,"chapterId":11,"bookId":14,"arabic":"عَنْ عُثْمَانَ بْنِ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ قَالَ: إِذَا وَقَعَتِ الْحُدُودُ فِي الْأَرْضِ فَلَا شُفْعَةَ فِيهَا. وَلَا شُفْعَةَ فِي بِئْرٍ وَلَا فَحل النّخل. رَوَاهُ مَالك","english":{"narrator":"","text":"‘Uthman b. ‘Affan said that when boundaries have been set up in land there is no option to buy neighbouring property, and that the option does not apply to a well or to male palm-trees. \n\nMalik transmitted it."}},{"id":206,"idInBook":206,"chapterId":11,"bookId":14,"arabic":"عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَفَعَ إِلَى يَهُودِ خَيْبَرَ نَخْلَ خَيْبَرَ وَأَرْضَهَا عَلَى أَنْ يَعْتَمِلُوهَا مِنْ أَمْوَالِهِمْ وَلِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَطْرُ ثَمَرِهَا. رَوَاهُ مُسْلِمٌ\nوَفِي رِوَايَةِ الْبُخَارِيِّ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْطَى خَيْبَرَ الْيَهُودَ أَنْ يَعْمَلُوهَا ويزرعوها وَلَهُم شطر مَا يخرج مِنْهَا","english":{"narrator":"","text":"‘ Abdallah b. Umar said that God’s Messenger handed over to the Jews of Khaibar the palm-trees and the land of Khaibar on condition that they should employ what belonged to them in working on them and that he should have half the produce. \n\nMuslim transmitted it.\n\nIn Bukhari's version, it says that God’s Messenger gave Khaibar to the Jews to work and cultivate, in return for which they would get half of what it produced."}},{"id":207,"idInBook":207,"chapterId":11,"bookId":14,"arabic":"وَعنهُ قَالَ: كُنَّا نخبر وَلَا نَرَى بِذَلِكَ بَأْسًا حَتَّى زَعَمَ رَافِعُ ابْن خَدِيجٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْهَا فَتَرَكْنَاهَا مِنْ أَجْلِ ذَلِكَ. رَوَاهُ مُسلم","english":{"narrator":"He said:","text":"We used to employ people to till land for a share of its produce* and see no harm in it till Rafi' b. Khadij asserted that the Prophet forbade it, so we abandoned it on that account.\n\nMuslim transmitted it.\n\n* Mukhabir. From this comes the verbal noun mukhabara. See p. 607."}},{"id":208,"idInBook":208,"chapterId":11,"bookId":14,"arabic":"وَعَنْ حَنْظَلَةَ بْنِ قَيْسٍ عَنْ رَافِعِ بْنِ خديج قَالَ: أَخْبَرَنِي عَمَّايَ أَنَّهُمْ كَانُوا يُكْرُونَ الْأَرْضَ عَلَى عَهْدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَا يَنْبُتُ عَلَى الْأَرْبَعَاءِ أَوْ شَيْءٍ يَسْتَثْنِيهِ صَاحِبُ الْأَرْضِ فَنَهَانَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ذَلِكَ فَقُلْتُ لِرَافِعٍ: فَكَيْفَ هِيَ بِالدَّرَاهِمِ وَالدَّنَانِيرِ؟ فَقَالَ: لَيْسَ بِهَا بَأْسٌ وَكَأَنَّ الَّذِي نُهِيَ عَنْ ذَلِكَ مَا لَوْ نَظَرَ فِيهِ ذَوُو الْفَهْمِ بِالْحَلَالِ وَالْحَرَامِ لَمْ يُجِيزُوهُ لِمَا فِيهِ مِنَ الْمُخَاطَرَةِ","english":{"narrator":"","text":"Hanzala b. Qais quoted Rafi‘ b. Khadij to the effect that his two paternal uncles told him they used to let out land in the time of the Prophet for what grew by the streamlets, or for something the owner of the land set aside, but the Prophet forbade them to do that. He asked Rafi’ how the matter would stand if payment were made in dirhams and dinars and he replied that there would be no harm in that. It seemed that what was prohibited was such as people versed in what is allowed and what is prohibited would not permit if they looked into it, because of the risk involved*. \n* The objection to such an agreement is that one cannot guarantee beforehand what a particular piece of land will produce.\n\n(Bukhari and Muslim.)"}},{"id":209,"idInBook":209,"chapterId":11,"bookId":14,"arabic":"وَعَن رَافِعِ بْنِ خَدِيجٍ قَالَ: كُنَّا أَكْثَرَ أَهْلِ الْمَدِينَةِ حَقْلًا وَكَانَ أَحَدُنَا يُكْرِي أَرْضَهُ فَيَقُولُ: هَذِهِ الْقِطْعَةُ لِي وَهَذِهِ لَكَ فَرُبَّمَا أَخْرَجَتْ ذِهِ وَلَمْ تُخْرِجْ ذِهِ فَنَهَاهُمُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ","english":{"narrator":"Rafi‘ b. Khadij said:","text":"We had most agricultural land in Medina, and a man would let out his land on condition that he should have what was produced in one portion and the man to whom it was let out should have what was produced in another; but sometimes one portion produced a crop while the other did not, so the Prophet forbade them to do that. \n\n(Bukhari and Muslim.)"}},{"id":210,"idInBook":210,"chapterId":11,"bookId":14,"arabic":"وَعَن عَمْرو قَالَ: قلت لطاووس: لَوْ تُرِكَتِ الْمُخَابَرَةُ فَإِنَّهُمْ يَزْعُمُونَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْهُ قَالَ: أَيْ عَمْرٌو إِنِّي أُعْطِيهِمْ وَأُعِينُهُمْ وَإِنَّ أَعْلَمَهُمْ أَخْبَرَنِي يَعْنِي ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ ينْه عَنهُ وَلَكِن قَالَ: «أَلا يَمْنَحْ أَحَدُكُمْ أَخَاهُ خَيْرٌ لَهُ مِنْ أَنْ يَأْخُذَ عَلَيْهِ خَرْجًا مَعْلُومًا»","english":{"narrator":"","text":"‘Amr said that he expressed a wish to Ta’us that he would abandon the practice of employing people on land in return for part of the pro-duce, for people asserted that the Prophet had forbidden it. He replied to ‘Amr that he was just giving them something and helping them, adding that the most learned of the people, meaning Ibn ‘Abbas, had informed him that the Prophet did not forbid it, but said, “It is better for one of you to lend to his brother than to take a prescribed sum from him.\" \n\n(Bukhari and Muslim.)"}},{"id":211,"idInBook":211,"chapterId":11,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ كَانَتْ لَهُ أَرْضٌ فَلْيَزْرَعْهَا أَوْ لِيَمْنَحْهَا أَخَاهُ فَإِنْ أَبَى فَلْيُمْسِكْ أرضه»","english":{"narrator":"","text":"Jabir reported God’s Messenger as saying, “If anyone has land he should cultivate it, or lend it to his brother; but if he refuses he should retain his land.” \n\n(Bukhari and Muslim.)"}},{"id":212,"idInBook":212,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَبِي أُمَامَةَ وَرَأَى سِكَّةً وَشَيْئًا مِنْ آلَةِ الْحَرْثِ فَقَالَ: سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَا يَدْخُلُ هَذَا بَيْتَ قوم إِلَّا أدخلهُ الذل» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Abu Umama on seeing a ploughshare and some agricultural instruments told that he had heard the Prophet say, “This will not enter any people’s house without God causing ignominy to enter it*.” \n\nBukhari transmitted it.\n\n*This tradition says that agriculture is a less noble occupation than jihad."}},{"id":213,"idInBook":213,"chapterId":11,"bookId":14,"arabic":"عَنْ رَافِعِ بْنِ خَدِيجٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ زَرَعَ فِي أَرْضِ قَوْمٍ بِغَيْرِ إِذْنِهِمْ فَلَيْسَ لَهُ مِنَ الزَّرْعِ شَيْءٌ وَلَهُ نَفَقَتُهُ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ غَرِيبٌ","english":{"narrator":"","text":"Rafi‘ b. Khadij reported the Prophet as saying, “If anyone sows in other people’s land without their permission he has no right to any of the crop, but he may have what it cost him.” \n\nTirmidhi and Abu Dawud transmitted it, Tirmidhi saying this is a gharib tradition."}},{"id":214,"idInBook":214,"chapterId":11,"bookId":14,"arabic":"عَنْ قَيْسِ بْنِ مُسْلِمٍ عَنْ أَبِي جَعْفَرٍ قَالَ: مَا بِالْمَدِينَةِ أَهْلُ بَيْتِ هِجْرَةٍ إِلَّا يَزْرَعُونَ عَلَى الثُّلُثِ وَالرُّبُعِ وَزَارَعَ عَلِيٌّ وَسَعْدُ بْنُ مَالِكٍ وَعَبْدُ اللَّهِ بْنُ مَسْعُودٍ وَعُمَرُ ابْن عبد الْعَزِيز وَالقَاسِم وَعُرْوَة وَآل أبي بَكْرٍ وَآلُ عُمَرَ وَآلُ عَلِيٍّ وَابْنُ سِيرِينَ وَقَالَ عَبْدُ الرَّحْمَنِ بْنُ الْأَسْوَدِ: كُنْتُ أُشَارِكُ عَبْدَ الرَّحْمَنِ بْنَ يَزِيدَ فِي الزَّرْعِ وَعَامَلَ عُمَرُ النَّاسَ عَلَى: إِنْ جَاءَ عُمَرُ بِالْبَذْرِ من عِنْده فَلهُ الشّطْر. وَإِن جاؤوا بالبذر فَلهم كَذَا. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Qais b. Muslim told that Abu Ja'far said there was not a family of the Emigrants who did not cultivate ground for a third and a quarter of the produce, and ‘Ali, Sa‘d b. Malik, ‘Abdallah b. Mas'ud, ‘Umar b. ‘Abd al-Aziz, al-Qasim, ‘Urwa, the family of Abu Bakr, the family of ‘Umar, the family of ‘Ali, and Ibn Sirin made contracts for part of the produce in return for working land. ‘Abd ar-Rahman b. al- Aswad said that he partnered 'Abd ar-Rahman b. Yazid in cultivation, and ‘Umar employed people on condition that if he provided the seed he should have half the crop, and if they provided the seed they should have such and such. \n\nBukhari transmitted it."}},{"id":215,"idInBook":215,"chapterId":11,"bookId":14,"arabic":"عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ قَالَ: زَعَمَ ثَابِتُ بْنُ الضَّحَّاكِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنِ الْمُزَارَعَةِ وَأَمَرَ بِالْمُؤَاجَرَةِ وَقَالَ: «لَا بَأْسَ بِهَا» . رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"‘Abdallah b. Mughaffal told that Thabit b. ad-Dahhak asserted that God’s Messenger forbade employing people on land for a share of the produce and ordered that they should be employed for a wage, saying there was no harm in it. \n\nMuslim transmitted it."}},{"id":216,"idInBook":216,"chapterId":11,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ احْتَجَمَ فَأَعْطَى الْحَجَّامَ أجره واستعط","english":{"narrator":"","text":"Ibn ‘Abbas said the Prophet had himself cupped and gave the cupper his pay; and he poured medicine into his nose. \n\n(Bukhari and Muslim.)"}},{"id":217,"idInBook":217,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَا بَعَثَ اللَّهُ نَبِيًّا إِلَّا رَعَى الْغَنَمَ» . فَقَالَ أَصْحَابُهُ: وَأَنْتَ؟ فَقَالَ: «نَعَمْ كُنْتُ أَرْعَى عَلَى قَرَارِيطَ لِأَهْلِ مَكَّةَ» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Abu Huraira reported the Prophet as saying, “God has not sent a prophet who did not work as a shepherd.” His companions asked whether this was also true of him and he replied, “Yes, I used to be a shepherd for the people of Mecca for a payment of some qirats.” \n\nBukhari transmitted it."}},{"id":218,"idInBook":218,"chapterId":11,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" قَالَ اللَّهُ تَعَالَى: ثَلَاثَةٌ أَنَا خَصْمُهُمْ يَوْمَ الْقِيَامَةِ: رَجُلٌ أَعْطَى بِي ثُمَّ غَدَرَ وَرَجُلٌ بَاعَ حُرًّا فَأَكَلَ ثَمَنَهُ وَرَجُلٌ اسْتَأْجَرَ أَجِيرًا فَاسْتَوْفَى مِنْهُ وَلَمْ يُعْطِهِ أَجْرَهُ \". رَوَاهُ البُخَارِيّ","english":{"narrator":"He reported God’s Messenger as saying that God most high has said, “There are three whose adversary I shall be on the day of resurrection:","text":"a man who gave a promise in my name then acted faithlessly; a man who sold a free man and enjoyed the price he received for him; and a man who hired a servant and, after receiving full service from him, did not give him his wages.” \n\nBukhari transmitted it."}},{"id":219,"idInBook":219,"chapterId":11,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ: أَنَّ نَفَرًا مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرُّوا بِمَاءٍ فبهم لَدِيغٌ أَوْ سَلِيمٌ فَعَرَضَ لَهُمْ رَجُلٌ مِنْ أَهْلِ الْمَاءِ فَقَالَ: هَلْ فِيكُمْ مِنْ رَاقٍ؟ إِن فِي المَاء لَدِيغًا أَوْ سَلِيمًا فَانْطَلَقَ رَجُلٌ مِنْهُمْ فَقَرَأَ بِفَاتِحَة الْكتاب على شَاءَ فبرئ فَجَاءَ بِالشَّاءِ إِلَى أَصْحَابِهِ فَكَرِهُوا ذَلِكَ وَقَالُوا: أَخَذْتَ عَلَى كِتَابِ اللَّهِ أَجْرًا حَتَّى قَدِمُوا الْمَدِينَةَ فَقَالُوا: يَا رَسُولَ اللَّهِ أَخَذَ عَلَى كِتَابِ اللَّهِ أَجْرًا. فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ أَحَقَّ مَا أَخَذْتُمْ عَلَيْهِ أَجْرًا كِتَابُ اللَّهِ» . رَوَاهُ الْبُخَارِيُّ وَفِي رِوَايَةٍ: «أَصَبْتُمُ اقْسِمُوا وَاضْرِبُوا لِي مَعَكُمْ سَهْمًا»","english":{"narrator":"","text":"Ibn 'Abbas said some of the Prophet's companions passed a watering-place where there was one who had been stung by a scorpion or bitten by a snake. One of the inhabitants of the watering-place accosted them and asked whether anyone among them could apply a charm, for at the watering-place there was a man who had been stung by a scorpion or bitten by a snake. One of them went and recited Fatihat al-Kitab in return for some sheep, and he was cured; but when he brought the sheep to his companions they disapproved of that saying, “You have taken payment for God’s Book.” When they came to Medina and told God’s Messenger that he had taken payment for God's Book, he replied, “The most worthy thing for which you have taken payment is God’s Book.\" \n\nBukhari transmitted it. In a version he said, “You have done right. Divide them and give me a share along with you.\""}},{"id":220,"idInBook":220,"chapterId":11,"bookId":14,"arabic":"عَنْ خَارِجَةَ بْنِ الصَّلْتِ عَنْ عَمِّهِ قَالَ: أَقْبَلْنَا مِنْ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَتَيْنَا عَلَى حَيٍّ مِنَ الْعَرَبِ فَقَالُوا: إِنَّا أُنْبِئْنَا أَنَّكُمْ قَدْ جِئْتُمْ مِنْ عِنْدِ هَذَا الرَّجُلِ بِخَيْرٍ فَهَلْ عِنْدَكُمْ مِنْ دَوَاءٍ أَوْ رُقْيَةٍ؟ فَإِنَّ عِنْدَنَا مَعْتُوهًا فِي الْقُيُود فَقُلْنَا: نعم فجاؤوا بِمَعْتُوهٍ فِي الْقُيُودِ فَقَرَأْتُ عَلَيْهِ بِفَاتِحَةِ الْكِتَابِ ثَلَاثَةَ أَيَّامٍ غُدْوَةً وَعَشِيَّةً أَجْمَعُ بُزَاقِي ثُمَّ أَتْفُلُ قَالَ: فَكَأَنَّمَا أُنْشِطَ مِنْ عِقَالٍ فَأَعْطَوْنِي جُعْلًا فَقُلْتُ: لَا حَتَّى أَسْأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «كُلْ فَلَعَمْرِي لَمَنْ أَكَلَ بِرُقْيَةِ بَاطِلٍ لَقَدْ أَكَلْتَ بِرُقْيَةِ حَقٍّ» . رَوَاهُ أَحْمد وَأَبُو دَاوُد","english":{"narrator":"Kharija b. as-Salt quoted his paternal uncle as saying:","text":"We came to a clan of the Arabs after leaving God's Messenger and they said, “We have been told that you have brought what is good from this man. Have you any medicine, or a charm, for we have a lunatic in chains?\" When we replied that we had, they brought a lunatic in chains and I recited Fatihat al-Kitab over him three days morning and evening, collecting my saliva and then spitting it out, and he seemed as if he were set free from a bond. They gave me some payment, but I refused to accept it till I had asked the Prophet. When I did so he said, “Accept it*, for by my life, some accept it for a worthless charm, but you have done so for a genuine one.\" \n\nAhmad and Abu Dawud transmitted it.\n\n* Literally \"eat”."}},{"id":221,"idInBook":221,"chapterId":11,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «أعْطوا الْأَجِيرَ أَجْرَهُ قَبْلَ أَنْ يَجِفَّ عَرَقُهُ» . رَوَاهُ ابْن مَاجَه","english":{"narrator":"","text":"‘Abdallah b. ‘Umar reported God’s Messenger as saying, “Give the hireling his wages before his sweat dries.\" \n\nIbn Majah transmitted it."}},{"id":222,"idInBook":222,"chapterId":11,"bookId":14,"arabic":"وَعَنِ الْحُسَيْنِ بْنِ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «لِلسَّائِلِ حَقٌّ وَإِنْ جَاءَ عَلَى فَرَسٍ» . رَوَاهُ أَحْمد وَأَبُو دَاوُد وَفِي المصابيح: مُرْسل","english":{"narrator":"","text":"Al-Husain b. ‘Ali reported God’s Messenger as saying, “The beggar has a right, even if he comes on a horse*.\" \n*This tradition means that one must not accuse a beggar of making false pretenses of being in need, even when circumstances suggest that that is so.\n\nAhmad and Abu Dawud transmitted it. In al-Masabih it is given in mursal form."}},{"id":223,"idInBook":223,"chapterId":11,"bookId":14,"arabic":"عَنْ عُتْبَةَ بْنِ الْمُنْذِرِ قَالَ: كُنَّا عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَرَأَ: (طسم)\nحَتَّى بَلَّغَ قِصَّةَ مُوسَى قَالَ: «إِنَّ مُوسَى عَلَيْهِ السَّلَامُ آجَرَ نَفْسَهُ ثَمَانِ سِنِينَ أَوْ عَشْرًا عَلَى عِفَّةِ فَرْجِهِ وَطَعَامِ بَطْنِهِ» . رَوَاهُ أَحْمد وَابْن مَاجَه","english":{"narrator":"","text":"‘Utba b. al-Mundhir said that once when they were with God’s Messenger he recited Ta’ Sin Mim (Al-Qur’an 28. The passage about Moses hiring himself is verses 26 to 28) till he came to the story of Moses and said, “Moses hired himself for eight or ten years in return for preserving his chastity and receiving his food.\" \n\nAhmad and Ibn Majah transmitted it."}},{"id":224,"idInBook":224,"chapterId":11,"bookId":14,"arabic":"وَعَنْ عُبَادَةَ بْنِ الصَّامِتِ قَالَ: قُلْتُ: يَا رَسُولَ اللَّهِ رَجُلٌ أَهْدَى إِلَيَّ قَوْسًا مِمَّنْ كُنْتُ أُعَلِّمُهُ الْكِتَابَ وَالْقُرْآنَ وَلَيْسَتْ بِمَالٍ فَأَرْمِي عَلَيْهَا فِي سَبِيلِ اللَّهِ قَالَ: «إِنْ كُنْتَ تُحِبُّ أَنْ تُطَوَّقَ طَوْقًا مِنْ نَارٍ فَاقْبَلْهَا» . رَوَاهُ أَبُو دَاوُد وَابْن مَاجَه","english":{"narrator":"","text":"‘Ubada b. as-Samit told that he said, “Messenger of God, one of those whom I have been teaching the Book and the Qur’an has presented me with a bow, and as it cannot be reckoned property may I shoot with it in God's path?\" He replied, “If you want to have a necklace of fire put on you, accept it.\" \n\nAbu Dawud and Ibn Majah transmitted it."}},{"id":225,"idInBook":225,"chapterId":11,"bookId":14,"arabic":"عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ عَمَرَ أَرْضًا لَيْسَتْ لِأَحَدٍ فَهُوَ أَحَقُّ» . قَالَ عُرْوَةُ: قَضَى بِهِ عُمَرُ فِي خِلَافَتِهِ. رَوَاهُ الْبُخَارِيُّ","english":{"narrator":"","text":"‘A’isha reported the Prophet as saying, “He who develops land which has no owner has the best right to it.” ‘Urwa said that ‘Umar gave decision accordingly during his caliphate. \n\nBukhari transmitted it."}},{"id":226,"idInBook":226,"chapterId":11,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ: أَنَّ الصَّعْبَ بْنَ جَثَّامَةَ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَا حِمَى إِلَّا لِلَّهِ وَرَسُولِهِ» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Ibn ‘Abbas said that as-Sa‘b b. Jath’thama told of hearing God’s Messenger say, “There is no preserve except what belongs to God and His Messenger.” \n\nBukhari transmitted it."}},{"id":227,"idInBook":227,"chapterId":11,"bookId":14,"arabic":"وَعَنْ عُرْوَةَ قَالَ: خَاصَمَ الزُّبَيْرُ رَجُلًا مِنَ الْأَنْصَارِ فِي شِرَاجٍ مِنَ الْحَرَّةِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «اسْقِ يَا زُبَيْرُ ثُمَّ أَرْسِلِ الْمَاءَ إِلَى جَارِكَ» . فَقَالَ الْأَنْصَارِيُّ: أَنْ كَانَ ابْنَ عَمَّتِكَ؟ فَتَلَوَّنَ وَجْهُهُ ثُمَّ قَالَ: «اسْقِ يَا زُبَيْرُ ثُمَّ احْبِسِ الْمَاءَ حَتَّى يَرْجِعَ إِلَى الْجَدْرِ ثُمَّ أَرْسِلِ الْمَاءَ إِلَى جَارِكَ» فَاسْتَوْعَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلزُّبَيْرِ حَقَّهُ فِي صَرِيحِ الْحُكْمِ حِينَ أحفظه الْأنْصَارِيّ وَكَانَ أَشَارَ عَلَيْهِمَا بِأَمْرٍ لَهُمَا فِيهِ سَعَةٌ","english":{"narrator":"","text":"‘Urwa said az-Zubair had a dispute with one of the Ansar about streamlets in the lava plain, and the Prophet said, “Water your ground, Zubair, then let the water run to your neighbour.” The Ansari said, “It is because he is your cousin.” Thereupon his face changed colour and he said, “Water your ground, Zubair, then keep back the water till it returns to the embankment, and afterwards let it run to your neighbour.” So the Prophet paid regard to az-Zubair’s right by the clear decision when the Ansari made him angry and he had given them advice which would have made matters easy for both of them. \n\n(Bukhari and Muslim.)"}},{"id":228,"idInBook":228,"chapterId":11,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تمنعوا فضل المَاء لتمنعوا بِهِ فضل الْكلأ»","english":{"narrator":"","text":"Abu Huraira reported God’s Messenger as saying, “Do not withhold excess water to prevent thereby extra herbage growing.” \n\n(Bukhari and Muslim.)"}},{"id":229,"idInBook":229,"chapterId":11,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" ثَلَاثَةٌ لَا يُكَلِّمُهُمُ اللَّهُ يَوْمَ الْقِيَامَةِ وَلَا يَنْظُرُ إِلَيْهِمْ رَجُلٌ حَلَفَ عَلَى سِلْعَةٍ لَقَدْ أُعْطِيَ بِهَا أَكْثَرَ مِمَّا أُعْطِيَ وَهُوَ كَاذِبٌ وَرَجُلٌ حَلَفَ عَلَى يَمِينٍ كَاذِبَةٍ بَعْدَ الْعَصْرِ لِيَقْتَطِعَ بِهَا مَالَ رَجُلٍ مُسْلِمٍ وَرَجُلٌ مَنَعَ فَضْلَ مَاءٍ فَيَقُولُ اللَّهُ: الْيَوْمَ أَمْنَعُكَ فَضْلِي كَمَا مَنَعْتَ فَضْلَ مَاء لم تعْمل يداك «","english":{"narrator":"He reported God’s Messenger as saying, “There are three to whom God will not speak and at whom He will not look on the day of resurrection:","text":"a man who swears falsely about some merchandise that he has previously received a larger offer than he has now been given; a man who swears a false oath after the afternoon prayer to deprive thereby a Muslim of his property; and a man who withholds excess water. God will say, ‘Today I am withholding from you my grace*as you withheld excess water which was not produced by the efforts of your hands’.\"\n\n(Bukhari and Muslim.)\n\n*The word for grace (fadl) is the same as the word for excess."}},{"id":230,"idInBook":230,"chapterId":11,"bookId":14,"arabic":"عَنِ الْحَسَنِ عَنْ سَمُرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ أَحَاطَ حَائِطًا عَلَى الْأَرْضِ فَهُوَ لَهُ» . رَوَاهُ أَبُو دَاوُدَ","english":{"narrator":"","text":"Al-Hasan said that Samura reported the Prophet as saying, “If anyone puts a wall round land*, it belongs to him.” \n\nAbu Dawud transmitted it.\n\n* Mirqat, iii, 369 says the reference is to barren land."}},{"id":231,"idInBook":231,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَقْطَعَ لِلزُّبَيْرِ نخيلا. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Asma' daughter of Abu Bakr said that God’s Messenger assigned some palm-trees to az-Zubair. \n\nAbu Dawud transmitted it."}},{"id":232,"idInBook":232,"chapterId":11,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَقْطَعَ لِلزُّبَيْرِ حُضْرَ فَرَسِهِ فَأَجْرَى فَرَسَهَ حَتَّى قَامَ ثُمَّ رَمَى بِسَوْطِهِ فَقَالَ: «أَعْطُوهُ مِنْ حَيْثُ بَلَغَ السَّوْطُ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Ibn ‘Umar said that the Prophet assigned to az-Zubair the land his horse could cover at a run. He made his horse run, and when it stopped he threw his whip. He then said, “Give it to him up to the spot his whip has reached.” \n\nAbu Dawud transmitted it."}},{"id":233,"idInBook":233,"chapterId":11,"bookId":14,"arabic":"وَعَنْ عَلْقَمَةَ بْنِ وَائِلٍ عَنْ أَبِيهِ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَقْطَعَهُ أَرْضًا بِحَضْرَمَوْتَ قَالَ: فَأَرْسَلَ مَعِي مُعَاوِيَةَ قَالَ: «أَعْطِهَا إِيَّاه» . رَوَاهُ التِّرْمِذِيّ والدارمي","english":{"narrator":"","text":"‘Alqama b. Wa’il reported his father as saying that the Prophet assigned him land in Hadramaut, sending Mu'awiya with him and telling him to give it to him. \n\nTirmidhi and Darimi transmitted it."}},{"id":234,"idInBook":234,"chapterId":11,"bookId":14,"arabic":"وَعَن أَبْيَضَ بْنِ حَمَّالِ الْمَأْرِبِيِّ: أَنَّهُ وَفَدَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَسْتَقْطَعَهُ الْمِلْحَ الَّذِي بِمَأْرِبَ فَأَقْطَعُهُ إِيَّاهُ فَلَمَّا وَلَّى قَالَ رَجُلٌ: يَا رَسُولَ اللَّهِ إِنَّمَا أَقْطَعْتَ لَهُ الْمَاءَ الْعِدَّ قَالَ: فَرَجَّعَهُ مِنْهُ قَالَ: وَسَأَلَهُ مَاذَا يحمى من الْأَرَاك؟ قَالَ: «مَا لَمْ تَنَلْهُ أَخْفَافُ الْإِبِلِ» . رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَه والدارمي","english":{"narrator":"","text":"Abyad b. Hammal al-Ma’ribi said that he came to God’s Messenger and asked him to assign him the salt which was in Ma’rib*, which he did. When he turned away a man said, “Messenger of God, you have assigned him the perennial spring water,” so he took it back from him. He asked for the land which had arak trees (Thorny trees on which camels feed)  growing in it, and he said he could have such as was beyond the region to which camels went. \n\nTirmidhi, Ibn Majah and Darimi transmitted it.\n\n* This town was the capital of the Sabæans in the Yemen, famous for its dam."}},{"id":235,"idInBook":235,"chapterId":11,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" الْمُسْلِمُونَ شُرَكَاءُ فِي ثَلَاث: الْمَاءِ وَالْكَلَأِ وَالنَّارِ \". رَوَاهُ أَبُو دَاوُدَ وَابْنُ مَاجَه","english":{"narrator":"Ibn ‘Abbas reported God's Messenger as saying, “Muslims share alike in three things:","text":"water, herbage and fire.” \n\nAbu Dawud and Ibn Majah transmitted it."}},{"id":236,"idInBook":236,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَسْمَرَ بْنِ مُضَرِّسٍ قَالَ: أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَبَايَعْتُهُ فَقَالَ: «مَنْ سَبَقَ إِلَى مَاءٍ لَمْ يَسْبِقْهُ إِلَيْهِ مُسْلِمٌ فَهُوَ لَهُ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Asmar b. Mudarris told that when he came and swore allegiance to the Prophet he said, “If anyone comes to water, no Muslim having come to it before him, it belongs to him.” \n\nAbu Dawud transmitted it."}},{"id":237,"idInBook":237,"chapterId":11,"bookId":14,"arabic":"وَعَنْ طَاوُسٍ مُرْسَلًا: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «من أحيى مَوَاتًا مِنَ الْأَرْضِ فَهُوَ لَهُ وَعَادِيُّ الْأَرْضِ لِلَّهِ وَرَسُولِهِ ثُمَّ هِيَ لَكُمْ مِنِّي» . رَوَاهُ الشَّافِعِي","english":{"narrator":"","text":"Tawus, in mursal form, reported God's Messenger as saying, “If anyone cultivates barren land it belongs to him, but ancient property belongs to God and His Messenger and then comes to you from me.” \n\nShafi‘i transmitted it."}},{"id":238,"idInBook":238,"chapterId":11,"bookId":14,"arabic":"وَرُوِيَ فِي «شَرْحِ السُّنَّةِ» : أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَقْطَعَ لِعَبْدِ اللَّهِ بْنِ مَسْعُودٍ الدُّورَ بِالْمَدِينَةِ وَهِيَ بَيْنَ ظَهْرَانَيْ عِمَارَةِ الْأَنْصَارِ مِنَ الْمَنَازِلِ وَالنَّخْلِ فَقَالَ بَنُو عَبْدِ بن زهرَة: نكتب عَنَّا ابْنَ أُمِّ عَبْدٍ فَقَالَ لَهُمْ رَسُولُ الله: «فَلِمَ ابْتَعَثَنِي اللَّهُ إِذًا؟ إِنَّ اللَّهَ لَا يُقَدِّسُ أُمَّةً لَا يُؤْخَذُ لِلضَّعِيفِ فِيهِمْ حَقُّهُ»","english":{"narrator":"","text":"Sharh as-sunna tells of the Prophet assigning to ‘Abdallah b. Mas'ud the open spaces in Medina between the dwellings and palm gardens of the Ansar, and when the B. 'Abd b. Zuhra said, “Remove from us the son of Umm ‘Abd,” (His mother was Umm 'Abd daughter of al-Harith b. Zuhra b. Kitab) replying, “Why then did God send me? God does not bless a people among whom a weak man is not given his right.”\n\nSharh as-sunna"}},{"id":239,"idInBook":239,"chapterId":11,"bookId":14,"arabic":"وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى فِي السَّيْلِ الْمَهْزُورِ أَنْ يُمْسَكَ حَتَّى يَبْلُغَ الْكَعْبَيْنِ ثُمَّ يُرْسَلَ الْأَعْلَى عَلَى الْأَسْفَل. رَوَاهُ أَبُو دَاوُد وَابْن مَاجَه","english":{"narrator":"","text":"‘Amr b. Shu'aib, on his father’s authority, said his grandfather told that God’s Messenger decided regarding the stream al-Mahzur* that its water should be held back till it reached the ankles and that the upper waters should then be allowed to flow to the lower. \n\nAbu Dawud and Ibn Majah transmitted it.\n\n* Taj al-'arus quotes Ibn al-Athir as saying this was the wadi of the B. Quraizah, and that water flowed in it only when rain fell."}},{"id":240,"idInBook":240,"chapterId":11,"bookId":14,"arabic":"وَعَنْ سَمُرَةَ بْنِ جُنْدُبٍ: أَنَّهُ كَانَتْ لَهُ عضد من نخل فِي حَائِطِ رَجُلٍ مِنَ الْأَنْصَارِ وَمَعَ الرَّجُلِ أَهْلُهُ فَكَانَ سَمُرَةُ يَدْخُلُ عَلَيْهِ فَيَتَأَذَّى بِهِ فَأتى النَّبِي صلى الله عَلَيْهِ وَسلم فذكرذلك لَهُ فَطَلَبَ إِلَيْهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسلم ليَبِيعهُ فَأبى فَطلب أَن يناقله فَأَبَى قَالَ: «فَهَبْهُ لَهُ وَلَكَ كَذَا» أَمْرًا رَغْبَةً فِيهِ فَأَبَى فَقَالَ: «أَنْتَ مُضَارٌّ» فَقَالَ لِلْأَنْصَارِيِّ: «اذْهَبْ فَاقْطَعْ نَخْلَهُ» . رَوَاهُ أَبُو دَاوُدَ","english":{"narrator":"","text":"Samura b. Jundub told that he had a row of palm-trees in the garden of a man of the Ansar who had his family with him. Samura used to go in, and as the Ansari was annoyed by this he went and mentioned the matter to the Prophet. He asked him to sell it (. i.e. he asked Samura to sell his row of palm-trees), but he refused, so he asked him to take something else in exchange, but he refused. He then said, “Give it to him and you can have such and such,” mentioning something with which he tried to please him, but he refused. He therefore told him he was a nuisance and told the Ansari to go and cut down his palm-trees. \n\nAbu Dawud transmitted it."}},{"id":241,"idInBook":241,"chapterId":11,"bookId":14,"arabic":"عَن عَائِشَة أَنَّهَا قَالَتْ: يَا رَسُولَ اللَّهِ مَا الشَّيْءُ الَّذِي لَا يَحِلُّ مَنْعُهُ؟ قَالَ: «الْمَاءُ وَالْمِلْحُ وَالنَّار» قَالَت: قلت: يَا رَسُول الله هَذَا الْمَاءُ قَدْ عَرَفْنَاهُ فَمَا بَالُ الْمِلْحِ وَالنَّارِ؟ قَالَ: «يَا حميراء أَمن أَعْطَى نَارًا فَكَأَنَّمَا تَصَدَّقَ بِجَمِيعِ مَا أَنْضَجَتْ تِلْكَ النَّارُ وَمَنْ أَعْطَى مِلْحًا فَكَأَنَّمَا تَصَدَّقَ بِجَمِيعِ مَا طَيَّبَتْ تِلْكَ الْمِلْحُ وَمَنْ سَقَى مُسْلِمًا شَرْبَةً مِنْ مَاءٍ حَيْثُ يُوجَدُ الْمَاءُ فَكَأَنَّمَا أَعْتَقَ رَقَبَةً وَمَنْ سَقَى مُسْلِمًا شَرْبَةً مِنْ مَاءٍ حَيْثُ لَا يُوجَدُ الْمَاءُ فَكَأَنَّمَا أَحْيَاهَا» . رَوَاهُ ابْنُ مَاجَهْ","english":{"narrator":"","text":"‘A’isha said she asked God's Messenger what the thing was which it was unlawful to refuse and he replied that it was water, salt and fire. She said, “Messenger of God, we know about water, but what is the significance of salt and fire?” He replied, “Little rosy one, he who gives fire is as though he had given sadaqa of all that that fire cooked ; he who gives salt is as though he had given sadaqa of all that that salt freshened ; he who gives a Muslim a drink of water where water is found is as though he had set free a slave; and he who gives a Muslim a drink of water where water is not found is as though he had given him life.” \n\nIbn Majah transmitted it."}},{"id":242,"idInBook":242,"chapterId":11,"bookId":14,"arabic":"عَنِ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا أَنَّ عُمَرَ أَصَابَ أَرْضًا بِخَيْبَرَ فَأَتَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: يَا رَسُولَ اللَّهِ إِنِّي أَصَبْتُ أَرْضًا بِخَيْبَرَ لَمْ أُصِبْ مَالًا قَطُّ أَنْفَسَ عِنْدِي مِنْهُ فَمَا تَأْمُرُنِي بِهِ؟ قَالَ: «إِنْ شِئْتَ حَبَسْتَ أَصْلَهَا وَتَصَدَّقْتَ بِهَا» . فَتَصَدَّقَ بِهَا عُمَرُ: إِنَّهُ لَا يُبَاعُ أَصْلُهَا وَلَا يُوهب وَلَا يُورث وَتصدق بهَا فِي الْفُقَرَاءِ وَفِي الْقُرْبَى وَفِي الرِّقَابِ وَفِي سَبِيلِ اللَّهِ وَابْنِ السَّبِيلِ وَالضَّيْفِ لَا جُنَاحَ عَلَى مَنْ وَلِيَهَا أَنْ يَأْكُلَ مِنْهَا بِالْمَعْرُوفِ أَوْ يُطْعِمَ غَيْرَ مُتَمَوِّلٍ قَالَ ابْنُ سِيرِينَ: غير متأثل مَالا","english":{"narrator":"","text":"Ibn ‘Umar told that when ‘Umar got some land in Khaibar he went it to the Prophet and said, “Messenger of God, I have acquired land in Khaibar which I consider to be more valuable than any I have ever | acquired, so what do you command me to do with it?” He replied, “If you wish you may make the property an inalienable possession and give { its produce as sadaqa ” So ‘Umar gave it as sadaqa declaring that the property must not be sold, given away, or inherited, and he gave its produce as sadaqa to be devoted to the poor, relatives, the emancipation j of slaves, God’s path, travellers and guests, no sin being committed by the one who administers it if he eats something from it in a reasonable b manner or gives something to someone else to eat*, provided he is not storing up goods . Ibn Sirin said, “Provided he is not acquiring capital for himself.” \n* This is a literal translation. It is used of him getting a reasonable return for his services, i | both for himself and for his family.\n\n(Bukhari and Muslim.)"}},{"id":243,"idInBook":243,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْعُمْرَى جَائِزَةٌ»","english":{"narrator":"","text":"Abu Huraira reported the Prophet as saying, “Life-tenancy of a house is a gift.” \n\n(Bukhari and Muslim.)"}},{"id":244,"idInBook":244,"chapterId":11,"bookId":14,"arabic":"وَعَنْ جَابِرٌ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ الْعُمْرَى مِيرَاثٌ لِأَهْلِهَا» . رَوَاهُ مُسلم","english":{"narrator":"Jabir reported the Prophet as saying, “What is given in life-tenancy:","text":"is part of the inheritance of those who receive it.” \n\nMuslim transmitted it."}},{"id":245,"idInBook":245,"chapterId":11,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَيُّمَا رَجُلٍ أُعْمِرَ عمرى لَهُ ولعفبه فَإِنَّهَا الَّذِي أعطيها لَا ترجع إِلَى الَّذِي أَعْطَاهَا لِأَنَّهُ أَعْطَى عَطَاءً وَقَعَتْ فِيهِ الْمَوَارِيث»","english":{"narrator":"","text":"He reported God’s Messenger as saying, “If anyone has property [[given him for the use of himself and his descendants it belongs to the one to whom it is given and does not return to the one who gave it because he gave a gift which may be inherited.” \n\n(Bukhari and Muslim.)"}},{"id":246,"idInBook":246,"chapterId":11,"bookId":14,"arabic":"وَعَنْهُ قَالَ: إِنَّمَا الْعُمْرَى الَّتِي أَجَازَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِن يَقُول: هِيَ لعقبك فَأَمَّا إِذَا قَالَ: هِيَ لَكَ مَا عِشْتَ فَإِنَّهَا ترجع إِلَى صَاحبهَا","english":{"narrator":"","text":"He said that the life-tenancy which God’s Messenger allowed was (only that one should say, “It is for you and your descendants.” When he says, “It is yours as long as you live,” it returns to its owner.\n\n(Bukhari and Muslim.)"}},{"id":247,"idInBook":247,"chapterId":11,"bookId":14,"arabic":"عَنْ جَابِرٌ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا ترقبوا أَو لَا تُعْمِرُوا فَمَنْ أُرْقِبَ شَيْئًا أَوْ أُعْمِرَ فَهِيَ لوَرثَته» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Jabir reported the Prophet as saying, “Do not give property to go to the survivor* and do not give life-tenancy, for if anyone is given either the property goes to his heirs.\" \n*This is said to be objectionable, as it may lead to the men hoping the other will die first.\n\nAbu Dawud transmitted it."}},{"id":248,"idInBook":248,"chapterId":11,"bookId":14,"arabic":"وَعَنْهُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْعُمْرَى جَائِزَةٌ لِأَهْلِهَا وَالرُّقْبَى جَائِزَةٌ لِأَهْلِهَا» . رَوَاهُ أَحْمد وَالتِّرْمِذِيّ وَأَبُو دَاوُد","english":{"narrator":"","text":"He reported the Prophet as saying, “Both life-tenancy and giving property which goes to the survivor are a gift which belongs to those who receive it.\" \n\nAhmad, Tirmidhi and Abu Dawud transmitted it."}},{"id":249,"idInBook":249,"chapterId":11,"bookId":14,"arabic":"عَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَمْسِكُوا أَمْوَالَكُمْ عَلَيْكُمْ لَا تُفْسِدُوهَا فَإِنَّهُ مَنْ أَعْمَرَ عُمْرَى فَهِيَ لِلَّذِي أعمر حَيا وَمَيتًا ولعقبه» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Jabir reported God’s Messenger as saying, “Keep your properties for yourselves and do not squander them, for if anyone gives a life- tenancy it goes to the one to whom it is given, both during his life and after his death, and to his descendants.\" \n\nMuslim transmitted it."}},{"id":250,"idInBook":250,"chapterId":11,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ عُرِضَ عَلَيْهِ رَيْحَانٌ فَلَا يَرُدُّهُ فَإِنَّهُ خَفِيفُ الْمَحْمَلِ طَيِّبُ الرّيح» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Huraira reported God’s Messenger as saying, \"If anyone is offered basil he must not reject it, for it is light to carry and has a sweet scent.” \n\nMuslim transmitted it."}},{"id":251,"idInBook":251,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَنَسٍ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ لَا يَرُدُّ الطِّيبَ. رَوَاهُ الْبُخَارِيُّ","english":{"narrator":"","text":"Anas said that the Prophet never rejected perfume. \n\nBukhari transmitted it."}},{"id":252,"idInBook":252,"chapterId":11,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْعَائِدُ فِي هِبَتِهِ كَالْكَلْبِ يَعُودُ فِي قَيْئِهِ لَيْسَ لَنَا مَثَلُ السوء» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Ibn ‘Abbas reported God’s Messenger as saying, \"One who seeks to take back a gift is like a dog which returns to its vomit. An evil example does not apply to us*.”\n* i.e. to Muslims.\n\nBukhari transmitted it."}},{"id":253,"idInBook":253,"chapterId":11,"bookId":14,"arabic":"وَعَنِ النُّعْمَانِ بْنِ بَشِيرٍ أَنَّ أَبَاهُ أَتَى بِهِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: إِنِّي نَحَلْتُ ابْنِي هَذَا غُلَامًا فَقَالَ: «أَكُلَّ وَلَدِكَ نَحَلْتَ مِثْلَهُ؟» قَالَ: لَا قَالَ: «فَأَرْجِعْهُ» . وَفِي رِوَايَةٍ: أَنَّهُ قَالَ: «أَيَسُرُّكَ أَنْ يَكُونُوا إِلَيْكَ فِي الْبِرِّ سَوَاءً؟» قَالَ: بَلَى قَالَ: «فَلَا إِذن» . وَفِي رِوَايَةٍ: أَنَّهُ قَالَ: أَعْطَانِي أَبِي عَطِيَّةً فَقَالَتْ عَمْرَةُ بِنْتُ رَوَاحَةَ: لَا أَرْضَى حَتَّى تشهد رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَتَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: إِنِّي أَعْطَيْتُ ابْنِي مِنْ عَمْرَةَ بِنْتِ رَوَاحَةَ عَطِيَّةً فَأَمَرَتْنِي أَنْ أُشْهِدَكَ يَا رَسُولَ اللَّهِ قَالَ: «أَعْطَيْتَ سَائِرَ وَلِدِكَ مِثْلَ هَذَا؟» قَالَ: لَا قَالَ: «فَاتَّقُوا اللَّهَ وَاعْدِلُوا بَيْنَ أَوْلَادِكُمْ» . قَالَ: فَرَجَعَ فَرَدَّ عَطِيَّتَهُ. وَفِي رِوَايَةٍ: أَنَّهُ قَالَ: «لَا أشهد على جور»","english":{"narrator":"","text":"An-Nu'man b. Bashir told that his father brought him to God’s Messenger and said, \"I have given this son of mine a slave.” He asked whether he had given all his children the same, and when he replied that he had not, he told him to take him back. A version reports him as asking, \"Would you like them to show you equal filial piety?” When he replied that he would, he said, \"Don’t do it then.” In a version he said that his father gave him a gift, but' Amra* daughter of Rawaha said, \"I shall not be satisfied till you call God's Messenger as witness.” So he went to him and said, \"I have given my son from ‘Amra daughter of Rawaha a gift and she has ordered me to call you as witness, Messenger of God.” He asked whether he had given the rest of his children the same, and when he replied that he had not, he said, \"Fear God and act equally with your children.” He said that he then returned and took back his gift. A version quotes him as saying, \"I shall not be a witness to oppression.” \n* She was the wife of Bashir b, Sad al-Ansari and mother of an-Nu'man (Isti'ab, p. 746).\n\n(Bukhari and Muslim.)"}},{"id":254,"idInBook":254,"chapterId":11,"bookId":14,"arabic":"عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَرْجِعُ أَحَدٌ فِي هِبَتِهِ إِلَّا الْوَالِدُ مِنْ وَلَده» . رَوَاهُ النَّسَائِيّ وَابْن مَاجَه","english":{"narrator":"","text":"‘Abdallah b. ‘Amr reported God’s Messenger as saying, \"None of you may take back his gift, except in the case of a father taking it from his child.” \n\nNasa’i and Ibn Majah transmitted it."}},{"id":255,"idInBook":255,"chapterId":11,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ وَابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يَحِلُّ لِلرَّجُلِ أَنْ يُعْطِيَ عَطِيَّةً ثُمَّ يَرْجِعَ فِيهَا إِلَّا الْوَالِدَ فِيمَا يُعْطِي وَلَدَهُ وَمَثَلُ الَّذِي يُعْطِي الْعَطِيَّةَ ثُمَّ يَرْجِعُ فِيهَا كَمَثَلِ الْكَلْبِ أَكَلَ حَتَّى إِذَا شَبِعَ قَاءَ ثُمَّ عَادَ فِي قَيْئِهِ» . رَوَاهُ أَبُو دَاوُدَ وَالتِّرْمِذِيُّ وَالنَّسَائِيُّ وَابْنُ مَاجَهْ وَصَححهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Ibn ‘Umar and Ibn ‘Abbas reported the Prophet as saying, “It is not lawful for a man to give a gift and then take it back, except a father regarding what he gives his child. One who gives a gift and then takes it back is like a dog which eats and vomits when it is full, then returns to its vomit.\" \n\nAbu Dawud, Tirmidhi, Nasa’i and Ibn Majah transmitted it, Tirmidhi saying it is sahih."}},{"id":256,"idInBook":256,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ: أَنَّ أَعْرَابِيًّا أُهْدِيَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَكْرَةً فَعَوَّضَهُ مِنْهَا سِتَّ بَكَرَاتٍ فَتَسَخَّطَ فَبَلَغَ ذَلِكَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ: «إِنَّ فَلَانًا أَهْدَى إِلَيَّ نَاقَةً فَعَوَّضْتُهُ مِنْهَا سِتَّ بَكَرَاتٍ فَظَلَّ سَاخِطًا لَقَدْ هَمَمْتُ أَنْ لَا أَقْبَلَ هَدِيَّةً إِلَّا مِنْ قُرَشِيٍّ أَوْ أَنْصَارِيٍّ أَوْ ثَقَفِيٍّ أَوْ دوسي» . رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد وَالنَّسَائِيّ","english":{"narrator":"","text":"Abu Huraira said that a desert Arab presented God’s Messenger with a young she-camel, in return for which he gave him six young she- camels. He was displeased, and when the Prophet heard that, he praised and extolled God and said, “So and so presented me with a she-camel and I gave him six young she-camels in return for it, but he was displeased. I feel inclined to accept a present only from a Qurashi, an Ansari, a Thaqafi, or a Dausi.\" \n\nTirmidhi, Abu Dawud and Nasa’i transmitted it."}},{"id":257,"idInBook":257,"chapterId":11,"bookId":14,"arabic":"وَعَنْ جَابِرٌ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ أُعْطِيَ عَطَاءً فَوَجَدَ فَلْيُجْزِ بِهِ وَمَنْ لَمْ يَجِدْ فَلْيُثْنِ فَإِنَّ مَنْ أَثْنَى فَقَدْ شَكَرَ وَمَنْ كَتَمَ فَقَدْ كَفَرَ وَمَنْ تَحَلَّى بِمَا لَمْ يُعْطَ كَانَ كَلَابِسِ ثوبي زور» . رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد","english":{"narrator":"","text":"Jabir reported the Prophet as saying, “If anyone is given a gift and has the means he should make a return for it, but if he has not the means he should express commendation, for he who expresses commendation has given thanks, he who conceals a matter has been ungrateful, and he who decks himself with what he has not been given is like him who puts on the two garments of falsehood.” \n\nTirmidhi and Abu Dawud transmitted it."}},{"id":258,"idInBook":258,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أُسَامَةَ بْنِ زَيْدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" مَنْ صُنِعَ إِلَيْهِ مَعْرُوفٌ فَقَالَ لِفَاعِلِهِ: جَزَاكَ اللَّهُ خَيْرًا فَقَدْ أَبْلَغَ فِي الثَّنَاءِ \". رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Usama b. Zaid reported God’s Messenger as saying, “If one is done a kindness and expresses to his benefactor a desire that God may give him a good reward, he has fully expressed his commendation.” \n\nTirmidhi transmitted it."}},{"id":259,"idInBook":259,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ لَمْ يَشْكُرِ النَّاسَ لَمْ يَشْكُرِ اللَّهَ» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ","english":{"narrator":"","text":"Abu Huraira reported God's Messenger as saying, “He who does not thank people does not thank God.”\n\nAhmad and Tirmidhi transmitted it."}},{"id":260,"idInBook":260,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: لَمَّا قَدِمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةَ أَتَاهُ الْمُهَاجِرُونَ فَقَالُوا: يَا رَسُولَ اللَّهِ مَا رَأَيْنَا قَوْمًا أَبْذَلَ مِنْ كَثِيرٍ وَلَا أَحْسَنَ مُوَاسَاةً مِنْ قَلِيلٍ مِنْ قَوْمٍ نَزَلْنَا بَيْنَ أَظْهُرِهِمْ: لَقَدْ كَفَوْنَا المؤونة وَأَشْرَكُونَا فِي الْمَهْنَأِ حَتَّى لَقَدْ خِفْنَا أَنْ يَذْهَبُوا بِالْأَجْرِ كُلِّهِ فَقَالَ: «لَا مَا دَعَوْتُمُ اللَّهَ لَهُمْ وَأَثْنَيْتُمْ عَلَيْهِمْ» . رَوَاهُ التِّرْمِذِيُّ وَصَحَّحَهُ","english":{"narrator":"","text":"Anas said that when God’s Messenger came to Medina the Emigrants came to him and said, “Messenger of God, we have never seen people more liberal out of abundance or better in giving help when they have little than a people among whom we have settled. They have removed our trouble and shared with us their pleasant things so that we are afraid they will get the whole reward.\" He replied, ‘No, as long as you make supplication to God for them and express commendation of them*.” \n* They have no reason to fear that the Ansar will get all the reward from God so long as due expression of thanks is made.\n\nTirmidhi transmitted it saying that it is sahih."}},{"id":261,"idInBook":261,"chapterId":11,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «تَهَادُوا فَإِنَّ الْهَدِيَّةَ تُذْهِبُ الضَّغَائِنَ» . رَوَاهُ","english":{"narrator":"","text":"‘A’isha reported the Prophet as saying, \"Give presents to one another, for a present removes grudges.”\n\n …transmitted it. (Mirqat, 3:380 says that Tirmidhi is the source in which this tradition is found. I have looked for it with the help of the Concordance, but have been unable to find it."}},{"id":262,"idInBook":262,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «تهادوا فَإِنَّ الْهَدِيَّةَ تُذْهِبُ وَحَرَ الصَّدْرِ وَلَا تَحْقِرَنَّ جَارَةٌ لجارتها وَلَا شقّ فرسن شَاة» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Abu Huraira reported the Prophet as saying, \"Give presents to one another for a present removes rancour from the breast, and a woman should not despise even the gift of half (Or part of) a sheep’s trotter from her neighbour.”\n\nTirmidhi transmitted it."}},{"id":263,"idInBook":263,"chapterId":11,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «ثَلَاثٌ لَا تُرَدُّ الْوَسَائِدُ وَالدُّهْنُ وَاللَّبَنُ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ غَرِيبٌ قِيلَ: أَرَادَ بالدهن الطّيب","english":{"narrator":"Ibn ‘Umar reported God’s Messenger as saying, \"Three things should not be rejected:","text":"cushions, oil (duhn)* and milk.” \n\nTirmidhi transmitted it, saying this is a gharib tradition.\n\n* It is said that by duhn he meant perfume. Duhn is used of oil or grease with which one anoints oneself. The point of the explanation of the meaning is evidently that a kind of scented oil is here intended."}},{"id":264,"idInBook":264,"chapterId":11,"bookId":14,"arabic":"وَعَن أَبِي عُثْمَانَ النَّهْدَيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «إِذا أعْطى أحدكُم الرَّيْحَانَ فَلَا يَرُدُّهُ فَإِنَّهُ خَرَجَ مِنَ الْجَنَّةِ» . رَوَاهُ التِّرْمِذِيّ مُرْسلا","english":{"narrator":"","text":"Abu ‘Uthman an-Nahdi reported God’s Messenger as saying, \"When one of you is given basil he must not reject it, for it has come forth from paradise.” \n\nTirmidhi transmitted it in mursal form."}},{"id":265,"idInBook":265,"chapterId":11,"bookId":14,"arabic":"عَنْ جَابِرٍ قَالَ: قَالَتِ امْرَأَةُ بَشِيرٍ: انْحَلِ ابْنِي غُلَامَكَ وَأَشْهِدْ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: إِنَّ ابْنَةَ فُلَانٍ سَأَلَتْنِي أَنْ أَنْحَلَ ابْنَهَا غُلَامِي وَقَالَتْ: أَشْهِدْ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «أَلَهُ إِخْوَةٌ؟» قَالَ: نَعَمْ قَالَ: «أَفَكُلَّهُمْ أَعْطَيْتَهُمْ مِثْلَ مَا أَعْطَيْتَهُ؟» قَالَ: لَا قَالَ: «فَلَيْسَ يَصْلُحُ هَذَا وَإِنِّي لَا أَشْهَدُ إِلَّا على حق» . رَوَاهُ مُسلم","english":{"narrator":"Jabir told that Bashir’s wife asked her husband* to give her son his slave and call God's Messenger as witness for her. He went to him and said, \"The daughter of so and so has asked me to give her son my slave and said that I must call God’s Messenger as witness for her.” He asked whether the boy had brothers, and when he replied that he had, he asked whether he had given them all the same as he had given him. On being told that he had not, he said, \"This is not good, and I will be a witness only for what is right.” \n* The literal translation is \"Bashir's wife said:","text":"Give my son your slave.” This was presumably said to her husband.\n\nMuslim transmitted it."}},{"id":266,"idInBook":266,"chapterId":11,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أُتِيَ بِبَاكُورَةِ الْفَاكِهَةِ وَضَعَهَا عَلَى عَيْنَيْهِ وَعَلَى شَفَتَيْهِ وَقَالَ: «اللَّهُمَّ كَمَا أَرَيْتَنَا أَوَّلَهُ فَأَرِنَا آخِرَهُ» ثُمَّ يُعْطِيهَا مَنْ يَكُونُ عِنْدَهُ مِنَ الصِّبْيَانِ. رَوَاهُ الْبَيْهَقِيّ فِي الدَّعْوَات الْكَبِير","english":{"narrator":"","text":"Abu Huraira said that when God's Messenger was brought first fruits he saw him put them on his eyes and lips and then say, \"0 God, as Thou hast shown us the first of it, show us the last of it.” He would then give them to any boys who were present. \n\nBaihaqi transmitted it in  ad-Da'awat al-kabir."}},{"id":267,"idInBook":267,"chapterId":11,"bookId":14,"arabic":"عَنْ زَيْدِ بْنِ خَالِدٍ قَالَ: جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلَهُ عَنِ اللُّقَطَةِ فَقَالَ: «اعْرِفْ عِفَاصَهَا وَوِكَاءَهَا ثُمَّ عَرِّفْهَا سَنَةً فَإِنْ جَاءَ صَاحِبُهَا وَإِلَّا فَشَأْنُكَ بِهَا» . قَالَ: فَضَالَّةُ الْغَنَمِ؟ قَالَ: «هِيَ لَكَ أَوْ لِأَخِيكَ أَوْ لِلذِّئْبِ» قَالَ: فَضَالَّةُ الْإِبِل؟ قَالَ: «مَالك وَلَهَا؟ مَعَهَا سِقَاؤُهَا وَحِذَاؤُهَا تَرِدُ الْمَاءَ وَتَأْكُلُ الشَّجَرَ حَتَّى يَلْقَاهَا رَبُّهَا» . مُتَّفَقٌ عَلَيْهِ. وَفِي رِوَايَةٍ لِمُسْلِمٍ: فَقَالَ: «عَرِّفْهَا سَنَةً ثُمَّ اعْرِفْ وِكَاءَهَا وَعِفَاصَهَا ثُمَّ اسْتَنْفِقَ بِهَا فَإِنْ جَاءَ رَبهَا فأدها إِلَيْهِ»","english":{"narrator":"","text":"Zaid b. Khalid told that when a man came to God's Messenger and asked him about a find he said, “Note what it is contained in and what it is tied with and make the matter known for a year. Then if its owner comes give it to him, otherwise you can do what you like with it.” He asked about stray sheep (or goats) and he replied, “You, your brother, or the wolf may have them.” He asked about stray camels and he replied, “What have you to do with them? They have their stomachs and their feet. They can go down to water and eat trees till their master finds them.” In a version by Muslim he said, “Make the matter known for a year, then note what it is contained in and what it is tied with and use it for your own purposes, but if its owner comes you must deliver it to him*.”\n* This tradition says that after a year the finder may do as he likes with the article, but that if the owner turns up later he must restore it to him, or give him an equivalent if he has disposed of it.\n\n(Bukhari and Muslim.)"}},{"id":268,"idInBook":268,"chapterId":11,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ آوَى ضَالَّةً فَهُوَ ضَالٌّ مَا لم يعرفهَا» . رَوَاهُ مُسلم","english":{"narrator":"","text":"He reported God’s Messenger as saying, “He who gives refuge to a stray is astray himself as long as he does not make the matter known.” \n\nMuslim transmitted it."}},{"id":269,"idInBook":269,"chapterId":11,"bookId":14,"arabic":"وَعَنْ عَبْدِ الرَّحْمَنِ بْنِ عُثْمَانَ التَّيَمِيِّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَن لقطَة الْحَاج. رَوَاهُ مُسلم","english":{"narrator":"","text":"‘Abd ar-Rahman b. ‘Uthman at-Taimi said that God’s Messenger prohibited taking what a pilgrim has dropped. \n\nMuslim transmitted it."}},{"id":270,"idInBook":270,"chapterId":11,"bookId":14,"arabic":"عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ سُئِلَ عَنِ الثَّمَرِ الْمُعَلَّقِ فَقَالَ: «مَنْ أَصَابَ مِنْهُ مِنْ ذِي حَاجَةٍ غَيْرَ مُتَّخِذٍ خُبْنَةً فَلَا شَيْءَ عَلَيْهِ وَمَنْ خَرَجَ بِشَيْءٍ مِنْهُ فَعَلَيْهِ غَرَامَةُ مِثْلَيْهِ وَالْعُقُوبَةُ وَمَنْ سَرَقَ مِنْهُ شَيْئًا بَعْدَ أَنْ يُؤْوِيَهُ الْجَرِينَ فَبَلَغَ ثَمَنَ الْمِجَنِّ فَعَلَيْهِ الْقَطْعُ» وَذَكَرَ فِي ضَالَّة الْإِبِل وَالْغنم كَمَا ذكر غَيْرُهُ قَالَ: وَسُئِلَ عَنِ اللُّقَطَةِ فَقَالَ: «مَا كَانَ مِنْهَا فِي الطَّرِيقِ الْمِيتَاءِ وَالْقَرْيَةِ الْجَامِعَةِ فَعَرِّفْهَا سَنَةً فَإِنْ جَاءَ صَاحِبُهَا فَادْفَعْهَا إِلَيْهِ وَإِنْ لَمْ يَأْتِ فَهُوَ لَكَ وَمَا كَانَ فِي الْخَرَابِ الْعَادِيِّ فَفِيهِ وَفِي الرِّكَازِ الْخُمُسُ» . رَوَاهُ النَّسَائِيُّ وَرَوَى أَبُو دَاوُدَ عَنْهُ مِنْ قَوْله: وَسُئِلَ عَن اللّقطَة إِلَى آخِره","english":{"narrator":"","text":"‘Amr b. Shu'aib, on his father’s authority, said his grandfather told that God’s Messenger was asked about hanging fruit and said, “If a needy person takes some and does not take a supply away in his garment he is not to be blamed, but he who carries any of it away is to be fined twice the value and punished and he who steals any of it after it has been put in the place where dates are dried is to have his hand cut off if their value reaches the price of a shield*.” Regarding stray camels and sheep (Or 'goats') he mentioned the same as others have done. He said he was asked about finds and replied, “If it is in a frequented road and a large town make the matter known for a year and if its owner comes give it to him, but if he does not it belongs to you; but if it is in a place which has been waste from ancient times, or if it is hidden treasure belonging to the pre-Islamic period it is subject to payment of the fifth.”\n*The price of a shield in the Prophet’s time is said to have been a quarter of a dinar. Ten dirhams is also mentioned\n\n Nasa’i transmitted it. Abu Dawud transmitted from ‘Amr from “he was asked about finds” to the end."}},{"id":271,"idInBook":271,"chapterId":11,"bookId":14,"arabic":"وَعَن أبي سعيد الْخُدْرِيّ: أَنَّ عَلِيَّ بْنَ أَبِي طَالِبٍ رَضِيَ اللَّهُ عَنْهُ وَجَدَ دِينَارًا فَأتى بِهِ فَاطِمَة رَضِي الله عَنْهَا فَسَأَلَ عَنْهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «هَذَا رِزْقُ اللَّهِ» فَأَكَلَ مِنْهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأكل عَليّ وَفَاطِمَة رَضِي الله عَنْهُمَا فَلَمَّا كَانَ بَعْدَ ذَلِكَ أَتَتِ امْرَأَةٌ تَنْشُدُ الدِّينَارَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَا عَلِيُّ أَدِّ الدِّينَارَ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Abu Sa'id al-Khudri said that ‘Ali b. Abu Talib found a dinar and after taking it to Fatima asked God’s Messenger about it. He replied that this was God’s provision, and God’s Messenger, ‘Ali and Fatima ate food which was bought with it. But afterwards a woman came crying out about the dinar and God’s Messenger said, “Pay the dinar, ‘Ali.” \n\nAbu Dawud transmitted it."}},{"id":272,"idInBook":272,"chapterId":11,"bookId":14,"arabic":"وَعَنِ الْجَارُودِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «ضَالَّةُ الْمُسْلِمِ حَرَقُ النَّارِ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Al-Jarud reported God’s Messenger as saying, “A Muslim’s lost property is a cause of the flame of hell*.” \n* i.e. when the finder, wishing to keep the article, does not make public the fact that he has found it.\n\nDarimi transmitted it."}},{"id":273,"idInBook":273,"chapterId":11,"bookId":14,"arabic":"وَعَنْ عِيَاضِ بْنِ حِمَارٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ وَجَدَ لُقَطَةً فَلْيُشْهِدْ ذَا عَدْلٍ أَوْ ذَوِي عَدْلٍ وَلَا يَكْتُمْ وَلَا يُغَيِّبْ فَإِنْ وَجَدَ صَاحِبَهَا فَلْيَرُدَّهَا عَلَيْهِ وَإِلَّا فَهُوَ مَالُ اللَّهِ يُؤْتِيهِ مَنْ يَشَاءُ» . رَوَاهُ أَحْمَدُ وَأَبُو دَاوُدَ وَالدَّارِمِيُّ","english":{"narrator":"","text":"‘Iyad b. Himar reported God’s Messenger as saying, “He who finds Something should call one or two trusty people as witness and not conceal it or cover it up; then if he finds its owner he should return it to him, otherwise it is God’s property which he gives to whom He will.” \n\nAhmad, Abu Dawud and Darimi transmitted it."}},{"id":274,"idInBook":274,"chapterId":11,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: رَخَّصَ لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْعَصَا وَالسَّوْطِ وَالْحَبْلِ وَأَشْبَاهِهِ يَلْتَقِطُهُ الرَّجُلُ يَنْتَفِعُ بِهِ. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Jabir said that God’s Messenger gave licence that a man might use for himself a stick, a whip, a rope and things of that type which he picked up. \n\nAbu Dawud transmitted it."}}],"chapter":{"id":11,"bookId":14,"arabic":"كتاب البيوع","english":"Business Transactions"}}