{"metadata":{"length":37,"arabic":{"title":"مشكاة المصابيح","author":"الإمام الكاتب التبريزي","introduction":"كتاب الفرائض والوصايا"},"english":{"title":"Mishkat al-Masabih","author":"Al-Khatib Al-Tabrizi","introduction":"Inheritance and Wills"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":12,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أَنَا أَوْلَى بِالْمُؤْمِنِينَ مِنْ أَنْفُسِهِمْ فَمَنْ مَاتَ وَعَلَيْهِ دَيْنٌ وَلَمْ يَتْرُكْ وَفَاءً فَعَلَيَّ قَضَاؤُهُ. وَمَنْ تَرَكَ مَالًا فَلِوَرَثَتِهِ» . وَفِي رِوَايَة: «من ترك دينا أَو ضيَاعًا فَلْيَأْتِنِي فَأَنَا مَوْلَاهُ» . وَفِي رِوَايَةٍ: «مَنْ تَرَكَ مَالًا فَلِوَرَثَتِهِ وَمَنْ تَرَكَ كَلًّا فَإِلَيْنَا»","english":{"narrator":"","text":"Abu Huraira reported the Prophet as saying, “I am nearer to the believers than themselves, so if anyone dies leaving a debt without leaving enough to pay it I shall be responsible for paying it, and if anyone leaves property it goes to his heirs.” A version has, “If anyone leaves a debt or children without maintenance let the matter come to me, for I am his guardian.” Another version has, “If anyone leaves property it goes to his heirs and if anyone leaves dependents without resources they come to us.”\n\n(Bukhari and Muslim.)"}},{"id":2,"idInBook":2,"chapterId":12,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَلْحِقُوا الْفَرَائِضَ بِأَهْلِهَا فَمَا بَقِيَ فَهُوَ لِأَوْلَى رَجُلٍ ذكر»","english":{"narrator":"","text":"Ibn ‘Abbas reported God’s Messenger as saying, “Give the shares to those who are entitled to them, and what remains over goes to the nearest male heir.” \n\n(Bukhari and Muslim.)"}},{"id":3,"idInBook":3,"chapterId":12,"bookId":14,"arabic":"وَعَنْ أُسَامَةَ بْنِ زَيْدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَرِثُ الْمُسْلِمُ الْكَافِرَ وَلَا الْكَافِرُ الْمُسْلِمَ»","english":{"narrator":"","text":"Usama b. Zaid reported God’s Messenger as saying, “A Muslim may not inherit from an infidel or an infidel from a Muslim.” \n\n(Bukhari and Muslim.)"}},{"id":4,"idInBook":4,"chapterId":12,"bookId":14,"arabic":"وَعَنْ أَنَسٍ رَضِيَ اللَّهُ عَنْهُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَوْلَى الْقَوْمِ مِنْ أَنْفُسِهِمْ» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Anas reported the Prophet as saying, “The freedman* of a people is one of them.” \n* Maula. This word may mean either the one who emancipates or the one who has been emancipated, and therefore the tradition has received two different interpretations according to the meaning of maula.\n\nBukhari transmitted it."}},{"id":5,"idInBook":5,"chapterId":12,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «ابْنُ أُخْتِ الْقَوْمِ مِنْهُم».","english":{"narrator":"","text":"He reported God’s Messenger as saying, “A sister’s son has blood- relationship to her family.” \n\n(Bukhari and Muslim.)"}},{"id":6,"idInBook":6,"chapterId":12,"bookId":14,"arabic":"عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَتَوَارَثُ أَهْلُ مِلَّتَيْنِ شَتَّى» . رَوَاهُ أَبُو دَاوُدَ وَابْن مَاجَه\nوَرَوَاهُ التِّرْمِذِيّ عَن جَابر","english":{"narrator":"","text":"‘Abdallah b. ‘Amr reported God's Messenger as saying, “People of two different religions may not inherit from one another.” \n\nAbu Dawud and Ibn Majah transmitted it, and Tirmidhi transmitted it from Jabir."}},{"id":7,"idInBook":7,"chapterId":12,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْقَاتِلُ لَا يَرِثُ» . رَوَاهُ التِّرْمِذِيّ وَابْن مَاجَه","english":{"narrator":"","text":"Abu Huraira reported God’s Messenger as saying, “One who kills a man cannot inherit from him.” \n\nTirmidhi and Ibn Majah transmitted it."}},{"id":8,"idInBook":8,"chapterId":12,"bookId":14,"arabic":"وَعَنْ بُرَيْدَةَ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَعَلَ لِلْجَدَّةِ السُّدُسَ إِذَا لَمْ تَكُنْ دونهَا أم. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Buraida said that the Prophet appointed a sixth to a grandmother if no mother is left to inherit before her. \n\nAbu Dawud transmitted it."}},{"id":9,"idInBook":9,"chapterId":12,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا اسْتَهَلَّ الصَّبِيُّ صُلِّيَ عَلَيْهِ وَورث» . رَوَاهُ ابْن مَاجَه والدارمي","english":{"narrator":"","text":"Jabir reported God’s Messenger as saying, “When an infant has raised its voice and then dies*, prayer is offered over it and it is treated as an heir.” \n*\"And then dies” does not occur in the text, but is obviously to be understood from the context. The position is that when the heir of someone who has died is expecting a child, the division of the property must not be made till the child is born. If the child lives long enough to raise it voice it is entitled to a share in the inheritance.\n\nIbn Majah and Darimi transmitted it."}},{"id":10,"idInBook":10,"chapterId":12,"bookId":14,"arabic":"وَعَنْ كَثِيرِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَوْلَى الْقَوْمِ مِنْهُمْ وَحَلِيفُ الْقَوْمِ مِنْهُمْ وَابْنُ أُخْتِ الْقَوْمِ مِنْهُمْ» . رَوَاهُ الدَّارمِيّ","english":{"narrator":"","text":"Kathir b. ‘Abdallah, on his father’s authority, said that his grand-father reported God's Messenger as saying, “The freedman of a people is one of them, the ally* of a people is one of them, and a sister’s son has blood-relationship to her family.”\n* Or \"close friend\".\n\nDawud transmitted it."}},{"id":11,"idInBook":11,"chapterId":12,"bookId":14,"arabic":"وَعَن الْمِقْدَام قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَنَا أَوْلَى بِكُلِّ مُؤْمِنٍ مِنْ نَفْسِهِ فَمَنْ تَرَكَ دَيْنًا أَوْ ضَيْعَةً فَإِلَيْنَا وَمَنْ تَرَكَ مَالًا فَلِوَرَثَتِهِ وَأَنَا مَوْلَى مَنْ لَا مَوْلَى لَهُ أَرِثُ مَالَهُ وَأَفُكُّ عَانَهُ وَالْخَالُ وَارِثُ مَنْ لَا وَارِثَ لَهُ يَرِثُ مَالَهُ وَيَفُكُّ عَانَهُ» . وَفِي رِوَايَةٍ: «وَأَنَا وَارِثُ مَنْ لَا وَارِثَ لَهُ أَعْقِلُ عَنْهُ وَأَرِثُهُ وَالْخَالُ وَارِثُ مَنْ لَا وَارِثَ لَهُ يَعْقِلُ عَنْهُ ويرثه» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Al-Miqdam reported God’s Messenger as saying, “I am nearer to every believer than himself, so if anyone leaves a debt or a helpless family I shall be responsible, but if anyone leaves property it goes to his heirs. I am the patron of him who has none, inheriting what he possesses and freeing him from his liabilities. A maternal uncle is heir of him who has none, inheriting his property and freeing him from his liabilities.” A version has, “I am the heir of him who has none, paying blood wit for him and inheriting from him; and a maternal uncle is the heir of him who has none, paying blood wit for him and inheriting from him.” \n\nAbu Dawud transmitted it."}},{"id":12,"idInBook":12,"chapterId":12,"bookId":14,"arabic":"وَعَن وائلة بْنِ الْأَسْقَعِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «تَحُوزُ الْمَرْأَةُ ثَلَاثَ مَوَارِيثَ عَتِيقَهَا وَلَقِيطَهَا وَوَلَدَهَا الَّذِي لَاعَنَتْ عَنْهُ» . رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد وَابْن مَاجَه","english":{"narrator":"Wathila b. al-Asqa‘ reported God’s Messenger as saying, “A woman gets inheritance from the three following:","text":"one she has set free, a foundling, and her child about whom she has invoked a curse on herself if she was untrue in declaring he was not born out of wedlock.”\n\nTirmidhi, Abu Dawud and Ibn Majah transmitted it."}},{"id":13,"idInBook":13,"chapterId":12,"bookId":14,"arabic":"وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أَيُّمَا رَجُلٍ عَاهَرَ بِحُرَّةٍ أَوْ أَمَةٍ فَالْوَلَد ولد زنى لَا يَرث وَلَا يُورث» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"‘Amr b. Shu'aib, on his father's authority, said his grandfather reported the Prophet as saying, “If a man commits fornication with a freewoman or a slave woman the child is the product of fornication, and neither does he inherit nor may anyone inherit from him.\" \n\nTirmidhi transmitted it."}},{"id":14,"idInBook":14,"chapterId":12,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ: أَنَّ مَوْلًى لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَاتَ وَتَرَكَ شَيْئًا وَلَمْ يَدَعْ حَمِيمًا وَلَا وَلَدًا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَعْطُوا مِيرَاثَهُ رَجُلًا مِنْ أَهْلِ قَرْيَتِهِ» . رَوَاهُ أَبُو دَاوُدَ وَالتِّرْمِذِيُّ","english":{"narrator":"","text":"‘A’isha said that a client of God’s Messenger died leaving some property, but no relative or child, and God’s Messenger said, “Give what he has left to a man belonging to his village.\" \n\nAbu Dawud and Tirmidhi transmitted it."}},{"id":15,"idInBook":15,"chapterId":12,"bookId":14,"arabic":"وَعَنْ بُرَيْدَةَ قَالَ: مَاتَ رَجُلٌ مِنْ خُزَاعَةَ فَأُتِيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِيرَاثِهِ فَقَالَ: «الْتَمِسُوا لَهُ وَارِثًا أَوْ ذَا رَحِمٍ» فَلَمْ يَجِدُوا لَهُ وَارِثًا وَلَا ذَا رَحِمٍ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أعْطوا الْكُبْرَ مِنْ خُزَاعَةَ» . رَوَاهُ أَبُو دَاوُدَ وَفِي رِوَايَةٍ لَهُ: قَالَ: «انْظُرُوا أَكْبَرَ رَجُلٍ مِنْ خُزَاعَة»","english":{"narrator":"","text":"Buraida said that a man of Khuza'a died and his estate was brought to the Prophet who gave instructions to look for an heir of his or some relative, but they found neither, so God’s Messenger said, “Give it to the leading man* of Khuza'a’ (al-kubr. This may mean the greatest in rank or in age, or, more probably, the nearest in kin to the man's oldest ancestor, the one with fewest intermediate links.\n\nAbu Dawud transmitted it. In a version by him he said, “Look for the greatest (akbar. This might mean greatest or oldest, but it is most probably used here in the same sense as al-kubr) man of Khuza'a.'’"}},{"id":16,"idInBook":16,"chapterId":12,"bookId":14,"arabic":"وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ: إِنَّكُمْ تقرؤون هَذِهِ الْآيَةَ: (مِنْ بَعْدِ وَصِيَّةٍ تُوصُونَ بِهَا أَو دين)\nوَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى بِالدّينِ قبل الْوَصِيَّةِ وَأَنَّ أَعْيَانَ بَنِي الْأُمِّ يَتَوَارَثُونَ دُونَ بَنِي الْعَلَّاتِ الرَّجُلُ يَرِثُ أَخَاهُ لِأَبِيهِ وَأُمِّهِ دُونَ أَخِيهِ لِأَبِيهِ \". رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ وَفِي رِوَايَةِ الدَّارِمِيِّ: قَالَ: «الْإِخْوَةُ مِنَ الْأُمِّ يَتَوَارَثُونَ دُونَ بَنِي الْعَلَّاتِ. . .» إِلَى آخِره","english":{"narrator":"‘Ali said:","text":"You recite this verse, “After a legacy you bequeathe or a debt (Al-Qur’an 4:12),’’ but God’s Messenger decided that a debt should be discharged before a legacy and that the sons of the same mother inherit from one another, but not the sons of one father by different mothers. A man inherits from his brother who has the same father and mother, but not from his brother who has the same father but a different mother. \n\nTirmidhi and Ibn Majah transmitted it. In a version by Darimi he said, “Brothers who have the same mother inherit from one another but not sons of the same father but of different mothers, etc.\""}},{"id":17,"idInBook":17,"chapterId":12,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: جَاءَتِ امْرَأَةُ سَعْدِ بْنِ الرَّبِيعِ بِابْنَتَيْهَا مِنْ سَعْدِ بْنِ الرَّبِيعِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ: يَا رَسُولَ اللَّهِ هَاتَانِ ابْنَتَا سَعْدِ بْنِ الرَّبِيعِ قُتِلَ أَبُوهُمَا مَعَكَ يَوْمَ أُحُدٍ شَهِيدًا وَإِنَّ عَمَّهُمَا أَخَذَ مَالَهُمَا وَلَمْ يَدَعْ لَهُمَا مَالًا وَلَا تُنْكَحَانِ إِلَّا وَلَهُمَا مَالٌ قَالَ: «يَقْضِي اللَّهُ فِي ذَلِكَ» فَنَزَلَتْ آيَةُ الْمِيرَاثِ فَبَعَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى عَمِّهِمَا فَقَالَ: «أَعْطِ لِابْنَتَيْ سَعْدٍ الثُّلُثَيْنِ وَأَعْطِ أُمَّهُمَا الثُّمُنَ وَمَا بَقِيَ فَهُوَ لَكَ» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ حَسَنٌ غريبٌ","english":{"narrator":"Jabir said:","text":"The wife of Sa'd b. ar-Rabi’ brought to God’s Messenger her two daughters whose father was Sa'd b. ar-Rabi' and said, “Messenger of God, these are the daughters of Sa'd b. ar-Rabi’. Their father was killed as a martyr when he was with you at the battle of Uhud, their paternal uncle has taken their property leaving them nothing, and they cannot be married unless they have some property.\"\nHe replied that God would decide regarding the matter, and when the verse about inheritance (Al-Qur’an 4:11) was sent down God’s Messenger sent to their paternal uncle and said, “Give Sa'd’s two daughters two-thirds and their mother an eighth, and what remains is yours.\" \n\nAhmad, Tirmidhi, Abu Dawud and Ibn Majah transmitted it, Tirmidhi saying this is a hasan gharib tradition."}},{"id":18,"idInBook":18,"chapterId":12,"bookId":14,"arabic":"وَعَنْ هُزَيْلِ بْنِ شُرَحْبِيلَ قَالَ: سُئِلَ أَبُو مُوسَى عَنِ ابْنَةٍ وَبِنْتِ ابْنٍ وَأُخْتٍ فَقَالَ: للْبِنْت النّصْف وَللْأُخْت النّصْف وائت ابْنَ مَسْعُودٍ فَسَيُتَابِعُنِي فَسُئِلَ ابْنُ مَسْعُودٍ وَأُخْبِرَ بقول أبي مُوسَى فَقَالَ: لقد ضللت إِذن وَمَا أَنَا مِنَ الْمُهْتَدِينَ أَقْضِي فِيهَا بِمَا قَضَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لِلْبِنْتِ النِّصْفُ وَلِابْنَةِ الِابْنِ السُّدُسُ تَكْمِلَةَ الثُّلُثَيْنِ وَمَا بَقِيَ فَلِلْأُخْتِ» فَأَتَيْنَا أَبَا مُوسَى فَأَخْبَرْنَاهُ بِقَوْلِ ابْنِ مَسْعُودٍ فَقَالَ: لَا تَسْأَلُونِي مَا دَامَ هَذَا الحبر فِيكُم. رَوَاهُ البُخَارِيّ","english":{"narrator":"Huzail b. Shurahbil said:","text":"Abu Musa was asked about a case where there were a daughter, a son’s daughter and a sister and replied, “The daughter gets half and the sister gets half. Go to Ibn Mas'ud and you will find that he agrees with me.” When Ibn Mas'ud was asked and told what Abu Musa had said he replied, “I would then be in error and not be one of those who are rightly guided. I decide concerning the matter as the Prophet did: The daughter gets half and the son’s daughter a sixth, making two-thirds, and what remains goes to the sister.” We then went to Abu Musa and when we told him what Ibn Mas'ud had said he replied, “Do not question me as long as this learned man is among you.” \n\nBukhari transmitted it. (Here again we find a tradition by Bukhari in Section 2.)"}},{"id":19,"idInBook":19,"chapterId":12,"bookId":14,"arabic":"وَعَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَ: جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: إِن ابْنِي مَاتَ فَمَا لِي مِنْ مِيرَاثِهِ؟ قَالَ: «لَكَ السُّدُسُ» فَلَمَّا وَلَّى دَعَاهُ قَالَ: «لَكَ سُدُسٌ آخَرُ» فَلَمَّا وَلَّى دَعَاهُ قَالَ: «إِنَّ السُّدُسَ الْآخَرَ طُعْمَةٌ» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَأَبُو دَاوُدَ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ","english":{"narrator":"'Imran b. Husain said:","text":"A man came to God’s Messenger and said, “My son’s son has died, so what do I receive from his estate?” He replied, “You receive a sixth;” then when he turned away he called him and said, “You receive another sixth;” and when he turned away he called him and said, “The other sixth is an allowance ,” (It would seem, although it is not explicit, that the grandson had left two daughters who were therefore entitled to two-thirds of the estate. The grandfather was entitled only to a sixth, but was given another sixth, as a favour, presumably because there were no other heirs).\n \nAhmad, Tirmidhi and Abu Dawud transmitted it, Tirmidhi saying this is a hasan sahih tradition."}},{"id":20,"idInBook":20,"chapterId":12,"bookId":14,"arabic":"وَعَنْ قَبِيصَةَ بْنِ ذُؤَيْبٍ قَالَ: جَاءَتِ الْجَدَّةُ إِلَى أَبِي بَكْرٍ رَضِيَ اللَّهُ عَنْهُ تَسْأَلُهُ مِيرَاثَهَا فَقَالَ لَهَا: مَا لَكِ فِي كِتَابِ اللَّهِ شَيْءٌ وَمَا لَكِ فِي سُنَّةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَيْءٌ فَارْجِعِي حَتَّى أَسْأَلَ النَّاسَ فَسَأَلَ فَقَالَ الْمُغِيرَةُ بْنُ شُعْبَةَ: حَضَرْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْطَاهَا السُّدُسَ فَقَالَ أَبُو بَكْرٍ رَضِيَ الله عَنهُ هَل مَعَك غَيره؟ فَقَالَ مُحَمَّدُ بْنُ مَسْلَمَةَ مِثْلَ مَا قَالَ الْمُغيرَة فأنفذه لَهَا أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ ثُمَّ جَاءَتِ الْجدّة الْأُخْرَى إِلَى عُمَرَ رَضِيَ اللَّهُ عَنْهُ تَسْأَلُهُ مِيرَاثَهَا فَقَالَ: هُوَ ذَلِك السُّدس فَإِن اجْتمعَا فَهُوَ بَيْنَكُمَا وَأَيَّتُكُمَا خَلَتْ بِهِ فَهُوَ لَهَا. رَوَاهُ مَالِكٌ وَأَحْمَدُ وَالتِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالدَّارِمِيُّ وَابْن مَاجَه","english":{"narrator":"","text":"Qabisa b. Dhu’aib said that when a grandmother came to Abu Bakr asking him for her share of an estate he told her that nothing was prescribed for her in God’s Book or in the sunna of God's Messenger, but asked her to go home till he had questioned the people. When he did so, al-Mughira b. Shu'ba said he had been present with God's Messenger when he gave her a sixth. Abu Bakr asked if anyone had been with him and Muhammad b. Maslama said the same as al- Mughira had said, so Abu Bakr made it apply to her. Another grand-mother came to ‘Umar asking him for her share of an estate and he said, “It is that sixth. If there are two of you it is shared between you, but whichever is the only one left gets it all.” \n\nMalik, Ahmad, Tirmidhi, Abu Dawud, Darimi and Ibn Majah transmitted it."}},{"id":21,"idInBook":21,"chapterId":12,"bookId":14,"arabic":"وَعَنِ ابْنِ مَسْعُودٍ قَالَ فِي الْجَدَّةِ مَعَ ابْنِهَا: أَنَّهَا أَوَّلُ جَدَّةٍ أَطْعَمَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُدُسًا مَعَ ابْنِهَا وَابْنُهَا حَيٌّ. رَوَاهُ التِّرْمِذِيُّ وَالدَّارِمِيُّ وَالتِّرْمِذِيُّ ضَعَّفَهُ","english":{"narrator":"","text":"Ibn Mas'ud said about a case where there was a grandmother and her son that she was the first grandmother to whom God’s Messenger gave a sixth which was not due to her when she had a son who was still alive. \n\nTirmidhi and Darimi transmitted it, but Tirmidhi declared it to be a weak tradition."}},{"id":22,"idInBook":22,"chapterId":12,"bookId":14,"arabic":"وَعَنِ الضَّحَّاكِ بْنِ سُفْيَانَ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَتَبَ إِلَيْهِ: «أَنْ ورث امْرَأَة أَشْيَم الضبابِي مِنْ دِيَةِ زَوْجِهَا» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ حَسَنٌ صَحِيح","english":{"narrator":"","text":"Ad-Dahhak b. Sufyan said that God’s Messenger wrote to him telling him to include the wife of Ashyam ad-Dibabi among the heirs to the blood-wit paid for her husband. \n\nTirmidhi and Abu Dawud transmitted it, Tirmidhi saying this is a hasan sahih tradition."}},{"id":23,"idInBook":23,"chapterId":12,"bookId":14,"arabic":"وَعَنْ تَمِيمٍ الدَّارِيِّ قَالَ: سَأَلَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مَا السُّنَةُ فِي الرَّجُلِ مِنْ أَهْلِ الشِّرْكِ يُسْلِمُ عَلَى يَدَيْ رَجُلٍ مِنَ الْمُسْلِمِينَ؟ فَقَالَ: «هُوَ أَوْلَى النَّاسِ بِمَحْيَاهُ وَمَمَاتِهِ» . رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ","english":{"narrator":"","text":"Tamim ad-Dari said he asked God’s Messenger what the sunna was about a polytheist who accepts Islam by the advice and persuasion of a Muslim, and he replied that he was the nearest to him in life and in death. \n\nTirmidhi, Ibn Majah and Darimi transmitted it."}},{"id":24,"idInBook":24,"chapterId":12,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ: أَنَّ رَجُلًا مَاتَ وَلَمْ يَدَعْ وَارِثًا إِلَّا غُلَامًا كَانَ أَعْتَقَهُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «هَلْ لَهُ أَحَدٌ؟» قَالُوا: لَا إِلَّا غُلَامٌ لَهُ كَانَ أَعْتَقَهُ فَجَعَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِيرَاثَهُ لَهُ. رَوَاهُ أَبُو دَاوُدَ وَالتِّرْمِذِيُّ وَابْنُ مَاجَه","english":{"narrator":"","text":"Ibn ‘Abbas said that a man died leaving no heir but a youth whom he had emancipated, and that when the Prophet asked whether he had any heir and was told that he had none but a youth of his whom he had emancipated, he assigned his estate to him. \n\nAbu Dawud, Tirmidhi and Ibn Majah transmitted it."}},{"id":25,"idInBook":25,"chapterId":12,"bookId":14,"arabic":"وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «يَرِثُ الْوَلَاءَ مَنْ يَرِثُ الْمَالَ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ إِسْنَادُهُ لَيْسَ بِالْقَوِيِّ","english":{"narrator":"","text":"‘Amr b. Shu'aib, on his father’s authority, said that his grandfather reported the Prophet as saying, ‘‘He who has the right to inherit property inherits the property of an emancipated slave.” \n\nTirmidhi transmitted it, saying that this is a tradition whose isnad is not strong."}},{"id":26,"idInBook":26,"chapterId":12,"bookId":14,"arabic":"عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَا كَانَ مِنْ مِيرَاثٍ قُسِّمَ فِي الْجَاهِلِيَّةِ فَهُوَ عَلَى قِسْمَةِ الْجَاهِلِيَّةِ وَمَا كَانَ مِنْ مِيرَاثٍ أَدْرَكَهُ الْإِسْلَامُ فَهُوَ عَلَى قِسْمَةِ الْإِسْلَامِ» . رَوَاهُ ابْن مَاجَه","english":{"narrator":"","text":"‘Abdallah b. ‘Umar reported God’s Messenger as saying, “An estate which was divided in the pre-Islamic period following the division in force then, but any estate in Islamic times must follow the division appointed by Islam.” \n\nIbn Majah transmitted it."}},{"id":27,"idInBook":27,"chapterId":12,"bookId":14,"arabic":"وَعَنْ مُحَمَّدِ بْنِ أَبِي بَكْرِ بْنِ حَزْمٍ أَنَّهُ سَمِعَ أَبَاهُ كَثِيرًا يَقُولُ: كَانَ عُمَرُ بْنُ الْخَطَّابِ يَقُولُ: عَجَبًا لِلْعَمَّةِ تُورَثُ وَلَا تَرث. رَوَاهُ مَالك","english":{"narrator":"","text":"Muhammad b. Abu Bakr b. Hazm said he often heard his father tell that ‘Umar b. al-Khattab used to say, “It is astonishing that one may inherit from a paternal aunt but that she does not inherit.” \n\nMalik transmitted it."}},{"id":28,"idInBook":28,"chapterId":12,"bookId":14,"arabic":"وَعَنْ عُمَرَ رَضِيَ اللَّهُ عَنْهُ قَالَ: تَعَلَّمُوا الْفَرَائِضَ وَزَادَ ابْنُ مَسْعُودٍ: وَالطَّلَاقَ وَالْحَجَّ قَالَا: فَإِنَّهُ من دينكُمْ. رَوَاهُ الدَّارمِيّ","english":{"narrator":"","text":"‘Umar said, “Learn the rules of inheritance,” Ibn Mas'ud adding, “of divorce and of the pilgrimage,” and both saying, “for it pertains to your religion.” \n\nDarimi transmitted it."}},{"id":29,"idInBook":29,"chapterId":12,"bookId":14,"arabic":"عَنِ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا حَقُّ امْرِئٍ مُسْلِمٍ لَهُ شَيْءٌ يُوصَى فِيهِ يَبِيتُ لَيْلَتَيْنِ إِلَّا وَوَصِيَّة مَكْتُوبَة عِنْده»","english":{"narrator":"","text":"Wills.\nIbn ‘Umar reported God’s Messenger as saying, “It is the duty of a Muslim man who has something which is to be given as a bequest not to have it for two nights without having his will written regarding it.” \n\n(Bukhari and Muslim.)"}},{"id":30,"idInBook":30,"chapterId":12,"bookId":14,"arabic":"وَعَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ قَالَ: مَرِضْتُ عَامَ الْفَتْحِ مَرَضًا أَشْفَيْتُ عَلَى الْمَوْتِ فَأَتَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعُودُنِي فَقُلْتُ: يَا رَسُولَ اللَّهِ: إِنَّ لِي مَالًا كَثِيرًا وَلَيْسَ يَرِثُنِي إِلَّا ابْنَتِي أَفَأُوصِي بِمَالِي كُلِّهِ؟ قَالَ: «لَا» قُلْتُ: فَثُلُثَيْ مَالِي؟ قَالَ: «لَا» قُلْتُ: فَالشَّطْرِ؟ قَالَ: «لَا» قُلْتُ: فَالثُّلُثِ؟ قَالَ: «الثُّلُثُ وَالثُّلُثُ كَثِيرٌ إِنَّكَ إِنْ تَذَرْ وَرَثَتَكَ أَغْنِيَاءَ خَيْرٌ مِنْ أَنْ تَذَرَهُمْ عَالَةً يَتَكَفَّفُونَ النَّاسَ وَإِنَّكَ لَنْ تُنْفِقَ نَفَقَةً تَبْتَغِي بِهَا وَجْهَ اللَّهِ إِلَّا أُجِرْتَ بِهَا حَتَّى اللُّقْمَةَ تَرْفَعُهَا إِلَى فِي امْرَأَتِكَ»","english":{"narrator":"Sa‘d b. Abu Waqqas said :","text":"During an illness which brought me near to death in the year of the Conquest God’s Messenger came to visit me and I said, “Messenger of God, I have a large amount of property and my daughter is my only heir. Shall I will away all my property ?” He replied, ‘No” I suggested two-thirds, but he objected, then a half, but he still objected. When I suggested a third he replied, “You may will away a third, but that is a lot*. To leave your heirs rich is better than to leave them poor and begging from people. You will not spend anything, seeking thereby to please God, without being rewarded for it, even the mouthful you give your wife.” \n\n*While this tradition tells that the Prophet gave permission for a man to will away a third of his estate to some person or purpose other than the heirs, it indicates that be thought it would be better not to will away so much.\n\n(Bukhari and Muslim.)"}},{"id":31,"idInBook":31,"chapterId":12,"bookId":14,"arabic":"عَن سَعْدِ بْنِ أَبِي وَقَّاصٍ قَالَ: عَادَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا مَرِيضٌ فَقَالَ: «أَوْصَيْتَ؟» قُلْتُ: نَعَمْ قَالَ: «بِكَمْ؟» قُلْتُ: بِمَالِي كُلِّهِ فِي سَبِيلِ اللَّهِ. قَالَ: «فَمَا تَرَكْتَ لِوَلَدِكَ؟» قُلْتُ: هُمْ أَغْنِيَاءُ بِخَيْرٍ. فَقَالَ: «أوص بالعشر» فَمَا زَالَت أُنَاقِصُهُ حَتَّى قَالَ: «أَوْصِ بِالثُّلُثِ وَالثُّلُثُ كَثِيرٌ» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"Sa’d b. Abu Waqqas said:","text":"God’s Messenger visited me when I was ill and asked whether I had made my will. I replied that I had. He asked how much I had willed and when I told him I had willed all my property away to be devoted to God’s path he asked how much I had left my children. I replied that they were rich and prosperous, whereupon he told me to will away a tenth ; but I kept on telling him it was too little till he finally said, “Will away a third, but a third is a lot.” \n\nTirmidhi transmitted it."}},{"id":32,"idInBook":32,"chapterId":12,"bookId":14,"arabic":"وَعَنْ أَبِي أُمَامَةَ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي خُطْبَتِهِ عَامَ حَجَّةِ الْوَدَاعِ: «إِنِ اللَّهَ قَدْ أَعْطَى كُلَّ ذِي حَقٍّ حَقَّهُ فَلَا وَصِيَّةَ لِوَارِثٍ» . رَوَاهُ أَبُو دَاوُدَ وَابْنُ مَاجَهْ وَزَادَ التِّرْمِذِيُّ: «الْوَلَدُ لِلْفَرَاشِ وَلِلْعَاهِرِ الْحَجَرُ وَحِسَابُهُمْ عَلَى اللَّهِ»","english":{"narrator":"Abu Umama told of hearing God’s Messenger say in his sermon in the year of the Farewell Pilgrimage, “God has appointed for everyone who has a right what is due to him, and no legacy must be made to an heir.” \n\nAbu Dawud and Ibn Majah transmitted it.\n\nTirmidhi added:","text":"“The child is attributed to the mother’s husband, but the adulterer gets nothing, and their reckoning is in God’s hands.”"}},{"id":33,"idInBook":33,"chapterId":12,"bookId":14,"arabic":"وَيُرْوَى عَنِ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا وَصِيَّةَ لِوَارِثٍ إِلَّا أَنْ يَشَاءَ الْوَرَثَةُ» مُنْقَطِعٌ هَذَا لَفْظُ الْمَصَابِيحِ. وَفِي رِوَايَةِ الدَّارَقُطْنِيِّ: قَالَ: «لَا تَجُوزُ وَصِيَّةٌ لِوَارِثٍ إِلَّا أَنْ يَشَاء الْوَرَثَة»","english":{"narrator":"","text":"It is related in munqati’ form on the authority of Ibn ‘Abbas that the Prophet said, “No legacy is to be left to an heir unless the other heirs are agreeable.” This is the wording in al-Masabih, but in Daraqutni’s version he said, “A legacy to an heir is not allowable unless the other heirs are agreeable.”"}},{"id":34,"idInBook":34,"chapterId":12,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ الرَّجُلَ لَيَعْمَلُ وَالْمَرْأَةَ بِطَاعَةِ اللَّهِ سِتِّينَ سَنَةً ثُمَّ يَحْضُرُهُمَا الْمَوْتُ فَيُضَارَّانِ فِي الْوَصِيَّةِ فَتَجِبُ لَهُمَا النَّارُ» ثُمَّ قَرَأَ أَبُو هُرَيْرَةَ (مِنْ بَعْدِ وَصِيَّةٍ يُوصَى بِهَا أَوْ دَيْنٍ غير مضار)\nإِلَى قَوْله (وَذَلِكَ الْفَوْز الْعَظِيم)\nرَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ","english":{"narrator":"Abu Huraira reported God’s Messenger as saying:","text":"“ A man and a woman act in obedience to God for sixty years then when they are about to die they cause injury by their will, so they must go to hell.” Then Abu Huraira recited, “After a legacy which you bequeathe or a debt, causing no injury ... that will be the mighty success”(Al-Qur’an 4:12).  \n\nAhmad, Tirmidhi, Abu Dawud and Ibn Majah transmitted it."}},{"id":35,"idInBook":35,"chapterId":12,"bookId":14,"arabic":"عَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ مَاتَ عَلَى وَصِيَّةٍ مَاتَ عَلَى سَبِيلٍ وَسُنَّةٍ وَمَاتَ عَلَى تُقًى وَشَهَادَةٍ وَمَاتَ مَغْفُورًا لَهُ» . رَوَاهُ ابْنُ مَاجَهْ","english":{"narrator":"","text":"Jabir reported God’s Messenger as saying, “He who dies leaving a will has died following a path and a sunna, he has died piously and testifying to the true faith, and he has died with his sins forgiven.”\n\nIbn Majah transmitted it."}},{"id":36,"idInBook":36,"chapterId":12,"bookId":14,"arabic":"وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ الْعَاصَ بْنَ وَائِلٍ أَوْصَى أَنْ يُعْتَقَ عَنْهُ مِائَةُ رَقَبَةٍ فَأَعْتَقَ ابْنُهُ هِشَامٌ خَمْسِينَ رَقَبَةً فَأَرَادَ ابْنُهُ عَمْرٌو أَنْ يُعْتِقَ عَنهُ الْخمسين الْبَاقِيَة فَقَالَ: حَتَّى أَسْأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَتَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: يَا رَسُولَ اللَّهِ إِنَّ أَبِي أَوْصَى أَنْ يُعْتَقَ عَنْهُ مِائَةُ رَقَبَةٍ وَإِنَّ هِشَامًا أَعْتَقَ عَنْهُ خَمْسِينَ وَبَقِيَتْ عَلَيْهِ خَمْسُونَ رَقَبَةً أَفَأَعْتِقُ عَنْهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّه لَو كَانَ مُسلما فأعتقتم عَنْهُ أَوْ تَصَدَّقْتَمْ عَنْهُ أَوْ حَجَجْتَمْ عَنْهُ بلغه ذَلِك» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"‘Amr b. Shu'aib, on his father’s authority, said his grandfather told that al-‘As b. Wa’il left in his will that a hundred slaves should be emancipated on his behalf. His son Hisham emancipated fifty slaves and his son ‘Amr intended to emancipate the remaining fifty on his behalf, but decided first to ask God’s Messenger. He therefore went to the Prophet and said, “Messenger of God, my father left in his will that a hundred slaves should be emancipated on his behalf and Hisham has emancipated fifty on his behalf and fifty remain. Shall I emancipate them on his behalf?” God's Messenger replied, “Had he been a Muslim and you had emancipated slaves on his behalf, or given sadaqa on his behalf, or performed the pilgrimage on his behalf, that would have reached him.” \n\nAbu Dawud transmitted it."}},{"id":37,"idInBook":37,"chapterId":12,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ قَطَعَ مِيرَاثَ وَارِثِهِ قَطَعَ اللَّهُ مِيرَاثَهُ مِنَ الْجَنَّةِ يَوْمَ الْقِيَامَةِ» . رَوَاهُ ابْنُ مَاجَهْ\nوَرَوَاهُ الْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَانِ عَنْ أَبِي هُرَيْرَة رَضِي الله عَنهُ","english":{"narrator":"","text":"Anas reported God’s Messenger as saying, “If anyone deprives an heir of his inheritance, God will deprive him of his inheritance in paradise on the day of resurrection.” \n\nIbn Majah transmitted it, and Baihaqi transmitted it in Shu'ab al-lman on the authority of Abu Huraira."}}],"chapter":{"id":12,"bookId":14,"arabic":"كتاب الفرائض والوصايا","english":"Inheritance and Wills"}}