{"metadata":{"length":293,"arabic":{"title":"مشكاة المصابيح","author":"الإمام الكاتب التبريزي","introduction":"كتاب النكاح"},"english":{"title":"Mishkat al-Masabih","author":"Al-Khatib Al-Tabrizi","introduction":"Marriage"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":13,"bookId":14,"arabic":"عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَا مَعْشَرَ الشَّبَابِ مَنِ اسْتَطَاعَ مِنْكُمُ الْبَاءَةَ فَلْيَتَزَوَّجْ فَإِنَّهُ أَغَضُّ لِلْبَصَرِ وَأَحْصَنُ لِلْفَرْجِ وَمَنْ لَمْ يَسْتَطِعْ فَعَلَيْهِ بِالصَّوْمِ فَإِنَّهُ لَهُ وِجَاءٌ»","english":{"narrator":"","text":"'Abdallah b. Mas'ud reported God’s Messenger as saying, “Young man, those of you who can support a wife should marry, for it keeps you from looking at strange women and preserves you from immorality; but those who cannot should devote themselves to fasting, for it is a means of suppressing sexual desire.”*\n\n(Bukhari and Muslim.)\n\n* Waja' has been translated freely above. It means castration."}},{"id":2,"idInBook":2,"chapterId":13,"bookId":14,"arabic":"وَعَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ قَالَ: رَدَّ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى عُثْمَان ابْن مَظْعُونٍ التَّبَتُّلَ وَلَوْ أَذِنَ لَهُ لَاخْتَصَيْنَا","english":{"narrator":"Sa'd b. Abu Waqqas said:","text":"God’s Messenger objected to ‘Uthman b. Maz’un living in celibacy. If he had given him permission we would have had ourselves castrated. \n\n(Bukhari and Muslim.)"}},{"id":3,"idInBook":3,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" تُنْكَحُ الْمَرْأَةُ لِأَرْبَعٍ: لِمَالِهَا وَلِحَسَبِهَا وَلِجَمَالِهَا وَلِدِينِهَا فَاظْفَرْ بِذَات الدّين تربت يداك \"","english":{"narrator":"","text":"Abu Huraira reported God’s Messenger as saying, “A woman may be married for four reasons, for her property, her rank, her beauty and her religion; so get the one who is religious and prosper.”* \n\n(Bukhari and Muslim.)\n\n* Taribat yadaka literally, \"may your hands cleave to the dust\". It is explained as being used to encourage one to action, and so it has been translated above by \"prosper.”"}},{"id":4,"idInBook":4,"chapterId":13,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الدُّنْيَا كُلُّهَا مَتَاعٌ وَخَيْرُ مَتَاعِ الدُّنْيَا الْمَرْأَة الصَّالِحَة» . رَوَاهُ مُسلم","english":{"narrator":"","text":"‘Abdallah b. ‘Amr reported God’s Messenger as saying, “The whole world is to be enjoyed, but the best thing in the world is a good woman.” \n\nMuslim transmitted it."}},{"id":5,"idInBook":5,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «خَيْرُ نسَاء ركبن الْإِبِل صَالح نسَاء قُرَيْش أَحْنَاهُ عَلَى وَلَدٍ فِي صِغَرِهِ وَأَرْعَاهُ عَلَى زَوْجٍ فِي ذَاتِ يَدِهِ»","english":{"narrator":"","text":"Abu Huraira reported God’s Messenger as saying, “The best of the women who ride on camels are the good women of Quraish, for they are the most affectionate to small children and the most careful of what belongs to their husbands.” \n\n(Bukhari and Muslim.)"}},{"id":6,"idInBook":6,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أُسَامَةَ بْنِ زَيْدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا تَرَكْتُ بَعْدِي فِتْنَةً أَضَرَّ عَلَى الرِّجَالِ من النِّسَاء»","english":{"narrator":"","text":"Usama b. Zaid reported God's Messenger as saying, “I have not left behind me a trial more injurious to men than women.” \n\n(Bukhari and Muslim.)"}},{"id":7,"idInBook":7,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «إِنَّ الدُّنْيَا حُلْوَةٌ خَضِرَةٌ وَإِنَّ اللَّهَ مُسْتَخْلِفُكُمْ فِيهَا فَيَنْظُرُ كَيْفَ تَعْمَلُونَ فَاتَّقُوا الدُّنْيَا وَاتَّقُوا النِّسَاءَ فَإِنَّ أَوَّلَ فِتْنَةِ بَنِي إِسْرَائِيلَ كَانَتْ فِي النِّسَاء» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Sa'id al-Khudri reported God’s Messenger as saying, “The world is sweet and verdant, and God having put you in it in your turn watches how you act; so fear the world and fear women, for the first trial of the B. Isra’il had to do with women.\" \n\nMuslim transmitted it."}},{"id":8,"idInBook":8,"chapterId":13,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الشُّؤْمُ فِي الْمَرْأَةِ وَالدَّارِ وَالْفَرَسِ» . مُتَّفَقٌ عَلَيْهِ. وَفِي رِوَايَةٍ: \n\" الشُّؤْمُ فِي ثَلَاثَة: فِي الْمَرْأَة والمسكن وَالدَّابَّة \"","english":{"narrator":"Ibn ‘Umar reported God’s Messenger as saying, “Ill luck arises concerning a woman, a house and a horse.\" A version has, “Ill luck arises concerning three things:","text":"a woman, a dwelling and a beast.\"\n\n(Bukhari and Muslim.)"}},{"id":9,"idInBook":9,"chapterId":13,"bookId":14,"arabic":"وَعَنْ جَابِرٍ: قَالَ: كُنَّا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَزْوَةِ فَلَمَّا قَفَلْنَا كُنَّا قَرِيبًا مِنَ الْمَدِينَةِ قُلْتُ: يَا رَسُولَ اللَّهِ إِنِّي حَدِيثُ عَهْدٍ بعرس قَالَ: «تَزَوَّجْتَ؟» قُلْتُ: نَعَمْ. قَالَ: «أَبِكْرٌ أَمْ ثَيِّبٌ؟» قُلْتُ: بَلْ ثَيِّبٌ قَالَ: «فَهَلَّا بِكْرًا تلاعبها وتلاعبك» . فَلَمَّا قدمنَا لِنَدْخُلَ فَقَالَ: «أَمْهِلُوا حَتَّى نَدْخُلَ لَيْلًا أَيْ عشَاء لكَي تمتشط الشعثة وتستحد المغيبة»","english":{"narrator":"Jabir said:","text":"When we were near Medina on our return from an expedition in which we had accompanied the Prophet I told him that I had recently married. He asked, “Have you married?\" and when I told him that I had, he asked whether I had married a virgin or a woman who had previously been married. On my telling him that it was one who had previously been married he said, “Why did you not marry a virgin with whom you could sport and who could sport with you?\" Then when we arrived and were about to enter he said, “Wait so that we may enter by night, i.e. in the evening, in order that the woman with dishevelled hair may comb it and the woman whose husband has been away may get herself ready .’’* \n\n(Bukhari and Muslim.)\n\n* Tastahidd literally means to shave the hair on the private parts, and is explained as being used here in the sense or preparing herself for her husband’s enjoyment."}},{"id":10,"idInBook":10,"chapterId":13,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" ثَلَاثَةٌ حَقٌّ عَلَى اللَّهِ عَوْنُهُمْ: الْمُكَاتَبُ الَّذِي يُرِيدُ الْأَدَاءَ وَالنَّاكِحُ الَّذِي يُرِيدُ الْعَفَافَ وَالْمُجَاهِدُ فِي سَبِيلِ اللَّهِ \". رَوَاهُ التِّرْمِذِيّ وَالنَّسَائِيّ وَابْن مَاجَه","english":{"narrator":"Abu Huraira reported God’s Messenger as saying, “There are three whom it is right for God to help:","text":"the slave whose master has agreed to let him buy his freedom when he wishes to pay the sum, the one who marries desiring to live a chaste life, and the one who fights in God’s path.\" \n\nTirmidhi, Nasa’i and Ibn Majah transmitted it."}},{"id":11,"idInBook":11,"chapterId":13,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا خَطَبَ إِلَيْكُمْ مَنْ تَرْضَوْنَ دِينَهُ وَخُلُقَهُ فَزَوِّجُوهُ إِنْ لَا تَفْعَلُوهُ تَكُنْ فِتَنَةٌ فِي الْأَرْضِ وَفَسَادٌ عَرِيضٌ» . رَوَاهُ التِّرْمِذِيُّ","english":{"narrator":"","text":"He reported God’s Messenger as saying, “When someone with whose religion and character you are satisfied asks your daughter in marriage, accede to his request. If you do not do so there will be temptation in the earth and extensive corruption.\" \n\nTirmidhi transmitted it."}},{"id":12,"idInBook":12,"chapterId":13,"bookId":14,"arabic":"وَعَنْ مَعْقِلِ بْنِ يَسَارٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «تَزَوَّجُوا الْوَدُودَ الْوَلُودَ فَإِنِّي مُكَاثِرٌ بِكُمُ الْأُمَم» . رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ","english":{"narrator":"","text":"Ma'qil b. Yasar reported God’s Messenger as saying, “Marry women who are loving and very prolific, for I shall outnumber the peoples by you.\" \n\nAbu Dawud and Nasa’i transmitted it."}},{"id":13,"idInBook":13,"chapterId":13,"bookId":14,"arabic":"وَعَنْ عَبْدِ الرَّحْمَنِ بْنِ سَالِمِ بْنِ عُتْبَةَ بْنِ عُوَيْمِ بْنِ سَاعِدَةَ الْأَنْصَارِيِّ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «عَلَيْكُمْ بِالْأَبْكَارِ فَإِنَّهُنَّ أَعْذَبُ أَفْوَاهًا وَأَنْتَقُ أَرْحَامًا وَأَرْضَى بِالْيَسِيرِ» . رَوَاهُ ابْنُ مَاجَه مُرْسلا","english":{"narrator":"","text":"‘Abd ar-Rahman b. Salim b. ‘Utba b.'Uwaim b. Sa'ida al-Ansari, on his father’s authority, told that his grandfather reported God’s Messenger as saying, “Marry virgins, for they have the sweetest mouths, the most prolific wombs, and are most satisfied with little.” \n\nIbn Majah transmitted in mursal form."}},{"id":14,"idInBook":14,"chapterId":13,"bookId":14,"arabic":"عَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَمْ تَرَ لِلْمُتَحَابِّينَ مثل النِّكَاح» . رَوَاهُ ابْن مَاجَه","english":{"narrator":"","text":"Ibn ‘Abbas reported God’s Messenger as saying, “You have seen nothing like marriage for increasing the love of two people.”\n\nIbn Majah transmitted."}},{"id":15,"idInBook":15,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَرَادَ أَنْ يَلْقَى الله طَاهِرا مطهراً فليتزوج الْحَرَائِر» . رَوَاهُ ابْن مَاجَه","english":{"narrator":"","text":"Anas reported God’s Messenger as saying, “Those who wish to be pure and purified when they meet God should marry free women.”\n\nIbn Majah transmitted."}},{"id":16,"idInBook":16,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أَبِي أُمَامَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ يَقُولُ: «مَا اسْتَفَادَ الْمُؤْمِنُ بَعْدَ تَقْوَى اللَّهِ خَيْرًا لَهُ مِنْ زَوْجَةٍ صَالِحَةٍ إِنْ أَمْرَهَا أَطَاعَتْهُ وَإِنْ نَظَرَ إِلَيْهَا سرته وَإِن أقسم عَلَيْهِ أَبَرَّتْهُ وَإِنْ غَابَ عَنْهَا نَصَحَتْهُ فِي نَفْسِهَا وَمَاله» . روى ابْن مَاجَه الْأَحَادِيث الثَّلَاثَة","english":{"narrator":"","text":"Abu Umama told that the Prophet used to say, “After fear of God a believer gains nothing better for him than a good wife who obeys him if he gives her a command, pleases him if he looks at her, is true to him if he adjures her to do something, and is sincere towards him regarding her person and his property if he is absent.” \n\nIbn Majah transmitted."}},{"id":17,"idInBook":17,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا تَزَوَّجَ الْعَبْدُ فَقَدِ اسْتَكْمَلَ نِصْفَ الدِّينِ فَلْيَتَّقِ اللَّهَ فِي النِّصْفِ الْبَاقِي»","english":{"narrator":"","text":"Anas reported God’s Messenger as saying, “When a man marries he has fulfilled half of the religion; so let him fear God regarding the remaining half.”\n\nBaihaqi transmitted in Shu'ab al-iman."}},{"id":18,"idInBook":18,"chapterId":13,"bookId":14,"arabic":"وَعَن عَائِشَةَ قَالَتْ: قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ أَعْظَمَ النِّكَاحِ بَرَكَةً أَيْسَرُهُ مُؤْنَةً» . رَوَاهُمَا الْبَيْهَقِيّ فِي شعب الْإِيمَان","english":{"narrator":"","text":"‘A’isha reported the Prophet as saying, “The marriage which produces most blessing is that which involves least burden.” \n\nBaihaqi transmitted in Shu'ab al-iman."}},{"id":19,"idInBook":19,"chapterId":13,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ قَالَ: جَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: إِنِّي تَزَوَّجْتُ امْرَأَةً مِنَ الْأَنْصَارِ قَالَ: «فَانْظُرْ إِلَيْهَا فَإِنَّ فِي أَعْيُنِ الْأَنْصَارِ شَيْئًا» . رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"Abu Huraira said that a man came to the Prophet and told him he had contracted to marry a woman of the Ansar, to which he replied, “Then look at her, for there is something in the eyes of the Ansar.”* \n* Meaning that some of them have features which cause aversion.\n\nMuslim transmitted it."}},{"id":20,"idInBook":20,"chapterId":13,"bookId":14,"arabic":"وَعَنِ ابْنِ مَسْعُودٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تُبَاشِرُ الْمَرْأَةُ الْمَرْأَةَ فَتَنْعَتُهَا لِزَوْجِهَا كَأَنَّهُ ينظر إِلَيْهَا»","english":{"narrator":"","text":"Ibn Mas'ud reported God’s Messenger as saying, “A woman must not come in close contact with another and then describe her to her husband, for that is as if he were looking at her.” \n\n(Bukhari and Muslim)"}},{"id":21,"idInBook":21,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَنْظُرُ الرَّجُلُ إِلَى عَوْرَةِ الرَّجُلِ وَلَا الْمَرْأَةُ إِلَى عَوْرَةِ الْمَرْأَةِ وَلَا يُفْضِي الرَّجُلُ إِلَى الرَّجُلِ فِي ثَوْبٍ وَاحِدٍ وَلَا تُفْضِي الْمَرْأَةُ إِلَى الْمَرْأَةِ فِي ثوب وَاحِد» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Sa'id reported God’s Messenger as saying, “A man must not look at a man’s private parts or a woman at a woman’s, and a man must not come close to a man in one garment or a woman to a woman in one garment.” \n\nMuslim transmitted it."}},{"id":22,"idInBook":22,"chapterId":13,"bookId":14,"arabic":"وَعَنْ جَابِرٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِلَّا لَا يبتن رَجُلٌ عِنْدَ امْرَأَةٍ ثَيِّبٍ إِلَّا أَنْ يَكُونَ ناكحا أَو ذَا محرم» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Jabir reported God's Messenger as saying, “A man must not spend the night in the house of a woman who has been married unless he is her husband or a close relative.” \n\nMuslim transmitted it."}},{"id":23,"idInBook":23,"chapterId":13,"bookId":14,"arabic":"وَعَنْ عُقْبَةَ بْنِ عَامِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" إِيَّاكُمْ وَالدُّخُولَ عَلَى النِّسَاءِ فَقَالَ رَجُلٌ: يَا رَسُولَ اللَّهِ أَرَأَيْتَ الْحَمْوَ؟ قَالَ: «الْحَمْوُ الْمَوْتُ»","english":{"narrator":"","text":"‘Uqba b. ‘Amir reported God’s Messenger as saying, “Avoid going in where women are.” A man said, “Messenger of God, tell me about the relatives of a woman’s husband,” to which he replied, “The relatives of a woman’s husband are death.”* \n*The word \"death” is used to indicate a strong prohibition, the idea being that they are a cause of temptation to a man’s wife.\n\n(Bukhari and Muslim.)"}},{"id":24,"idInBook":24,"chapterId":13,"bookId":14,"arabic":"وَعَن جَابِرٍ: أَنَّ أُمَّ سَلَمَةَ اسْتَأْذَنَتْ رَسُولَ اللَّهِ فِي الْحِجَامَةِ فَأَمَرَ أَبَا طَيْبَةَ أَنْ يَحْجُمَهَا قَالَ: حَسِبْتُ أَنَّهُ كَانَ أَخَاهَا مِنَ الرَّضَاعَةِ أَو غُلَاما لم يَحْتَلِم. رَوَاهُ مُسلم","english":{"narrator":"","text":"Jabir said that Umm Salama asked permission of God’s Messenger to be cupped and he ordered Abu Taiba to cup her. He said he thought he was her foster-brother, or a lad who had not reached the age of puberty. \n\nMuslim transmitted it."}},{"id":25,"idInBook":25,"chapterId":13,"bookId":14,"arabic":"وَعَن جرير بْنِ عَبْدِ اللَّهِ قَالَ: سَأَلَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ نَظَرِ الْفُجَاءَةِ فَأمرنِي أَن أصرف بَصرِي. رَوَاهُ مُسلم","english":{"narrator":"Jarir b. ‘Abdallah said:","text":"I asked God’s Messenger about an accidental glance and he ordered me to turn my eyes away. \n\nMuslim transmitted it."}},{"id":26,"idInBook":26,"chapterId":13,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ الْمَرْأَةَ تُقْبِلُ فِي صُورَةِ شَيْطَانٍ وَتُدْبِرُ فِي صُورَةِ شَيْطَانٍ إِذَا أَحَدَكُمْ أَعْجَبَتْهُ الْمَرْأَةُ فَوَقَعَتْ فِي قَلْبِهِ فَلْيَعْمِدْ إِلَى امْرَأَتِهِ فَلْيُوَاقِعْهَا فَإِنَّ ذَلِكَ يَرُدُّ مَا فِي نَفسه» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Jabir reported God’s Messenger as saying, “A woman advances in the form of a devil and retires in the form of a devil. When one of you is charmed by a woman and she affects his heart he should go to his wife and have intercourse with her, for that will repel what he is feeling.” \n\nMuslim transmitted it."}},{"id":27,"idInBook":27,"chapterId":13,"bookId":14,"arabic":"عَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا خَطَبَ أَحَدُكُمُ الْمَرْأَةَ فَإِنِ اسْتَطَاعَ أَنْ يَنْظُرَ إِلَى مَا يَدْعُوهُ إِلَى نِكَاحهَا فَلْيفْعَل» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Jabir reported God’s Messenger as saying, “When one of you asks a woman in marriage, if he is able to look at what will induce him to marry her, he should do so.” \n\nAbu Dawud transmitted it."}},{"id":28,"idInBook":28,"chapterId":13,"bookId":14,"arabic":"وَعَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ قَالَ خَطَبْتُ امْرَأَةً فَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «هَلْ نَظَرْتَ إِلَيْهَا؟» قُلْتُ: لَا قَالَ: «فَانْظُرْ إِلَيْهَا فَإِنَّهُ أَحْرَى أَنْ يُؤْدَمَ بَيْنَكُمَا» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَالنَّسَائِيُّ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ","english":{"narrator":"Al-Mughira b. Shu'ba said:","text":"I asked a woman in marriage and God’s Messenger asked me whether I had looked at her. When I replied that I had not, he said, “Then look at her, for it is better that there should be love between you.” \n\nAhmad, Tirmidhi, Nasa'i, Ibn Majah and Darimi transmitted it."}},{"id":29,"idInBook":29,"chapterId":13,"bookId":14,"arabic":"وَعَنِ ابْنِ مَسْعُودٍ قَالَ: رَأَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ امْرَأَةً فَأَعْجَبَتْهُ فَأَتَى سَوْدَةَ وَهِيَ تَصْنَعُ طِيبًا وَعِنْدَهَا نِسَاءٌ فَأَخْلَيْنَهُ فَقَضَى حَاجَتَهُ ثُمَّ قَالَ: «أَيُّمَا رَجُلٍ رَأَى امْرَأَةً تُعْجِبُهُ فَلْيَقُمْ إِلَى أَهْلِهِ فَإِنَّ مَعَهَا مثل الَّذِي مَعهَا» . رَوَاهُ الدَّارمِيّ","english":{"narrator":"","text":"Ibn Mas'ud said that God’s Messenger saw a woman who charmed him, so he went to Sauda who was making perfume in the company of some women. They left him, and after he had satisfied his desire he said, “If any man sees a woman who charms him he should go to his wife, for she has the same kind of thing as the other woman.” \n\nDarimi transmitted it."}},{"id":30,"idInBook":30,"chapterId":13,"bookId":14,"arabic":"وَعَنْهُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْمَرْأَةُ عَوْرَةٌ فَإِذَا خَرَجَتِ اسْتَشْرَفَهَا الشَّيْطَانُ» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"He reported the Prophet as saying, “A woman should be concealed, for when she goes out the devil looks at her.”* \n* The basic idea is to lift up the eyes to look at something. Here it is explained as meaning either that the devil makes her attractive to men, or that he looks at her to seduce her and to seduce people by her.\n\nTirmidhi transmitted it."}},{"id":31,"idInBook":31,"chapterId":13,"bookId":14,"arabic":"وَعَنْ بُرَيْدَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِعَلِيٍّ: «يَا عَلِيُّ لَا تُتْبِعِ النَّظْرَةَ النَّظْرَةَ فَإِنَّ لَكَ الْأُولَى وَلَيْسَتْ لَكَ الْآخِرَةُ» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَأَبُو دَاوُدَ والدارمي","english":{"narrator":"","text":"Buraida reported God's Messenger as saying to ‘Ali, “Do not give a second look, ‘Ali, for while you are not to blame for the first you have no right to the second.” \n\nAhmad, Tirmidhi, Abu Dawud and Darimi transmitted it."}},{"id":32,"idInBook":32,"chapterId":13,"bookId":14,"arabic":"وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا زَوَّجَ أَحَدُكُمْ عَبْدَهُ أَمَتَهُ فَلَا يَنْظُرَنَّ إِلَى عَوْرَتِهَا» . وَفِي رِوَايَةٍ: «فَلَا يَنْظُرَنَّ إِلَى مَا دُونُ السُّرَّةِ وَفَوْقَ الرُّكْبَةِ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"‘Amr b. Shu'aib, on his father’s authority, told that his grandfather reported the Prophet as saying, “When one of you marries his slave to his slave girl he must not look at her private parts.” A version has, “he must not look at what is below the navel and above the knee.” \n\nAbu Dawud transmitted it."}},{"id":33,"idInBook":33,"chapterId":13,"bookId":14,"arabic":"وَعَنْ جَرْهَدٍ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أَمَا عَلِمْتَ أَنَّ الْفَخِذَ عَوْرَةٌ» . رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد","english":{"narrator":"","text":"Jarhad reported the Prophet as saying, \"Do you not know that the thigh is a private part?” \n\nTirmidhi and Abu Dawud transmitted it."}},{"id":34,"idInBook":34,"chapterId":13,"bookId":14,"arabic":"وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَهُ: «يَا عَلِيُّ لَا تُبْرِزْ فَخِذَكَ وَلَا تَنْظُرْ إِلَى فَخِذِ حَيٍّ وَلَا مَيِّتٍ» . رَوَاهُ أَبُو دَاوُد وَابْن مَاجَه","english":{"narrator":"","text":"‘Ali told that God’s Messenger said to him, \"Do not uncover your thigh, ‘Ali, and do not look at the thigh of anyone alive or dead.” \n\nAbu Dawud and Ibn Majah transmitted it."}},{"id":35,"idInBook":35,"chapterId":13,"bookId":14,"arabic":"وَعَنْ مُحَمَّدِ بْنِ جَحْشٍ قَالَ: مَرَّ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى مَعْمَرٍ وَفَخذه مَكْشُوفَتَانِ قَالَ: «يَا مَعْمَرُ غَطِّ فَخِذَيْكَ فَإِنَّ الفخذين عَورَة» . رَوَاهُ فِي شرح السّنة","english":{"narrator":"","text":"Muhammad b. Jahsh told that God’s Messenger came upon Ma'mar when his thighs were uncovered and said, \"Cover your thighs, Ma'mar, for the thighs are private parts.” \n\nIt is transmitted in Sharh as-sunna."}},{"id":36,"idInBook":36,"chapterId":13,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِيَّاكُمْ وَالتَّعَرِّيَ فَإِنَّ مَعَكُمْ مَنْ لَا يُفَارِقُكُمْ إِلَّا عِنْدَ الْغَائِطِ وَحِينَ يُفْضِي الرَّجُلُ إِلَى أَهْلِهِ فَاسْتَحْيُوهُمْ وَأَكْرِمُوهُمْ» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Ibn ‘Umar reported God’s Messenger as saying, \"Avoid being naked, for with you are those who never leave you (the recording angels) except when you are relieving yourselves and when a man has intercourse with his wife; so observe modesty before them and honour them.” \n\nTirmidhi transmitted it."}},{"id":37,"idInBook":37,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أُمِّ سَلَمَةَ: أَنَّهَا كَانَتْ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَيْمُونَةُ إِذْ أقبل ابْن مَكْتُومٍ فَدَخَلَ عَلَيْهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «احْتَجِبَا مِنْهُ» فَقُلْتُ يَا رَسُولَ اللَّهِ أَلَيْسَ هُوَ أَعْمَى لَا يُبْصِرُنَا؟ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَفَعَمْيَاوَانِ أَنْتُمَا؟ أَلَسْتُمَا تُبْصِرَانِهِ؟» رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَأَبُو دَاوُد","english":{"narrator":"Umm Salama said:","text":"I was with God’s Messenger along with Maimuna when Ibn Umm Maktum approached and came in to visit him, so he told us to veil ourselves. I said, \"Messenger of God, is he not blind and unable to see us?” He replied, \"Are you blind and unable to see him?” \n\nAhmad, Tirmidhi and Abu Dawud transmitted it."}},{"id":38,"idInBook":38,"chapterId":13,"bookId":14,"arabic":"وَعَنْ بَهْزِ بْنِ حَكِيمٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «احْفَظْ عَوْرَتَكَ إِلَّا مِنْ زَوْجَتِكَ أَو مَا ملكت يَمِينك» فَقلت: يَا رَسُول الله أَفَرَأَيْت إِن كَانَ الرَّجُلُ خَالِيًا؟ قَالَ: «فَاللَّهُ أَحَقُّ أَنْ يستحيى مِنْهُ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ","english":{"narrator":"","text":"Bahz b. Hakim, on his father’s authority, told that his grandfather reported God’s Messenger as saying, \"Cover your private parts, except from your wife or your female slave,” and said he asked him to tell him what a man might do when alone. He replied, \"God has most right to modesty from you.” \n\nTirmidhi, Abu Dawud and Ibn Majah transmitted it."}},{"id":39,"idInBook":39,"chapterId":13,"bookId":14,"arabic":"وَعَنْ عُمَرَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يَخْلُوَنَّ رَجُلٌ بِامْرَأَةٍ إِلَّا كَانَ ثالثهما الشَّيْطَان» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"‘Umar reported the Prophet as saying, \"Whenever a man is alone with a woman the devil makes a third.” \n\nTirmidhi transmitted it."}},{"id":40,"idInBook":40,"chapterId":13,"bookId":14,"arabic":"وَعَنْ جَابِرٌ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا تَلِجُوا عَلَى الْمُغَيَّبَاتِ فَإِنَّ الشَّيْطَانَ يَجْرِي مِنْ أَحَدِكُمْ مَجْرَى الدَّمِ» قُلْنَا: وَمِنْكَ يَا رَسُولَ اللَّهِ؟ قَالَ: «وَمِنِّي وَلَكِنَّ الله أعانني عَلَيْهِ فَأسلم» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Jabir reported the Prophet as saying, \"Do not visit women whose husbands are away from home, for the devil circulate in you like your blood.” He was asked if this applied to him also and said, \"To me also, but God has helped me against him so that I may be safe.” \n\nTirmidhi transmitted it."}},{"id":41,"idInBook":41,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَى فَاطِمَةَ بِعَبْدٍ قَدْ وَهَبَهُ لَهَا وَعَلَى فَاطِمَةَ ثَوْبٌ إِذَا قَنَّعَتْ بِهِ رَأْسَهَا لَمْ يَبْلُغْ رِجْلَيْهَا وَإِذَا غَطَّتْ بِهِ رِجْلَيْهَا لَمْ يَبْلُغْ رَأْسَهَا فَلَمَّا رَأَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا تَلْقَى قَالَ: «إِنَّهُ لَيْسَ عَلَيْكِ بَأْسٌ إِنَّمَا هُوَ أَبُوكِ وغلامك» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Anas said that when the Prophet brought Fatima a slave whom he presented to her she was wearing a garment which did not reach her feet when she put it over her head, and did not reach her head when she covered her feet with it. Noticing her predicament, God’s Messenger said, “There is nothing to worry about. It is only your father and your slave.” \n\nAbu Dawud transmitted it."}},{"id":42,"idInBook":42,"chapterId":13,"bookId":14,"arabic":"عَنْ أُمِّ سَلَمَةَ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ عِنْدَهَا وَفِي الْبَيْتِ مُخَنَّثٌ فَقَالَ: لِعَبْدِ اللَّهِ بْنِ أَبِي أُمَيَّةَ أَخِي أُمِّ سَلَمَةَ: يَا عَبْدَ اللَّهِ إِنْ فَتَحَ اللَّهُ لَكُمْ غَدًا الطَّائِفَ فَإِنِّي أَدُلُّكَ عَلَى ابْنَةِ غَيْلَانَ فَإِنَّهَا تُقْبِلُ بِأَرْبَعٍ وَتُدْبِرُ بِثَمَانٍ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يدخلن هَؤُلَاءِ عَلَيْكُم»","english":{"narrator":"","text":"Umm Salama told that once when the Prophet was with her there was in the house a hermaphrodite who said to Abdallah b. Abu Umayya, Umm Salama's brother, “If God conquers at-Ta'if for you tomorrow, I shall lead you to the daughter of Ghailan who has four folds of fat in front and eight behind.” Thereupon the Prophet said, “Do not let these people visit you.” \n\n(Bukhari and Muslim.)"}},{"id":43,"idInBook":43,"chapterId":13,"bookId":14,"arabic":"وَعَنِ الْمِسْوَرِ بْنِ مَخْرَمَةَ قَالَ حَمَلْتُ حَجَرًا ثقيلاً فَبينا أَنَا أَمْشِي سَقَطَ عَنِّي ثَوْبِي فَلَمْ أَسْتَطِعْ أَخْذَهُ فَرَآنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لِي: «خُذْ عَلَيْكَ ثَوْبَكَ وَلَا تَمْشُوا عُرَاة» . رَوَاهُ مُسلم","english":{"narrator":"Al-Miswar b. Makhrama said:","text":"While I was walking along carrying a heavy stone my garment fell off and I was unable to get it. God’s Messenger saw me and said to me, “Put on your garment and do not go naked.”* \n* \"Put on” is singular and “do not go” is plural, indicating that the first part of the sentence is addressed to al-Miswar and that the second is a general injunction.\n\nMuslim transmitted it."}},{"id":44,"idInBook":44,"chapterId":13,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ قَالَتْ: مَا نَظَرْتُ أَوْ مَا رَأَيْتُ فَرْجَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم قطّ. رَوَاهُ ابْن مَاجَه","english":{"narrator":"","text":"‘A'isha said, “I never looked at (or, I never saw) God’s Messenger’s private parts.” \n\nIbn Majah transmitted it."}},{"id":45,"idInBook":45,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أَبِي أُمَامَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَا مِنْ مُسْلِمٍ يَنْظُرُ إِلَى مَحَاسِنِ امْرَأَةٍ أَوَّلَ مَرَّةٍ ثُمَّ يَغُضُّ بَصَرَهُ إِلَّا أَحْدَثَ اللَّهُ لَهُ عِبَادَةً يَجِدُ حلاوتها» . رَوَاهُ أَحْمد","english":{"narrator":"","text":"Abu Umama reported the Prophet as saying, “If any Muslim happens to look at a woman’s beauties and then lowers his eyes, God will produce for him an act of worship whose sweetness he will experience.” \n\nAhmad transmitted it."}},{"id":46,"idInBook":46,"chapterId":13,"bookId":14,"arabic":"وَعَنِ الْحَسَنِ مُرْسَلًا قَالَ: بَلَغَنِي أَنَّ رَسُولَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَعَنَ اللَّهُ النَّاظِرَ وَالْمَنْظُورَ إِلَيْهِ» . رَوَاهُ الْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَانِ","english":{"narrator":"","text":"Al-Hasan told in mursal form that he heard God’s Messenger had said, “God curse the one who looks and the one who is looked at!” \n\nBaihaqi transmitted it in Shu'ab al-iman."}},{"id":47,"idInBook":47,"chapterId":13,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تُنْكَحُ الْأَيِّمُ حَتَّى تُسْتَأْمَرَ وَلَا تُنْكَحُ الْبِكْرُ حَتَّى تُسْتَأْذَنَ» . قَالُوا: يَا رَسُول الله وَكَيف إِذْنهَا؟ قَالَ: «أَن تسكت»","english":{"narrator":"","text":"Abu Huraira reported God’s Messenger as saying, “A woman without a husband* must not be married till she is consulted, and a virgin must not be married till her permission is asked.” When asked how her permission was indicated he replied that it was by her saying nothing. \n* Ayyim. This means a woman who has no husband. It may mean a woman who has not been married, whether a virgin or not, or a woman previously married who has no husband. See n. 2.\n\n(Bukhari and Muslim.)"}},{"id":48,"idInBook":48,"chapterId":13,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْأَيِّمُ أَحَقُّ بِنَفْسِهَا مِنْ وَلِيِّهَا وَالْبِكْرُ تَسْتَأْذِنُ فِي نَفْسِهَا وَإِذْنُهَا صِمَاتُهَا» . وَفِي رِوَايَةٍ: قَالَ: «الثَّيِّبُ أَحَقُّ بِنَفْسِهَا مِنْ وَلِيِّهَا وَالْبِكْرُ تُسْتَأْمَرُ وَإِذْنُهَا سُكُوتُهَا» . وَفِي رِوَايَةٍ: قَالَ: «الثَّيِّبُ أَحَقُّ بِنَفْسِهَا مِنْ وَلِيِّهَا وَالْبِكْرُ يَسْتَأْذِنُهَا أَبُوهَا فِي نَفْسِهَا وَإِذْنُهَا صِمَاتُهَا» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Ibn ‘Abbas reported the Prophet as saying, “A woman without a husband has more right to her person than her guardian, and a virgin’s permission must be asked about herself, her permission being her silence.” In a version he said, “A woman who has been previously married* has more right to her person than her guardian, and a virgin must be consulted, her permission consisting in her saying nothing.” In another version he said, “A woman who has been previously married has more right to her person than her guardian” and a virgin’s father must ask her permission about herself, her permission being her silence.” \n* Thayyib. This means a woman previously married who has no husband. In view of the context it is argued that ayyim is used above in this sense.\n\nMuslim transmitted it."}},{"id":49,"idInBook":49,"chapterId":13,"bookId":14,"arabic":"وَعَن خنساء بنت خذام: أَنْ أَبَاهَا زَوَّجَهَا وَهِيَ ثَيِّبٌ فَكَرِهَتْ ذَلِكَ فَأَتَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَدَّ نِكَاحَهَا. رَوَاهُ الْبُخَارِيُّ وَفِي رِوَايَةِ ابْنِ مَاجَه: نِكَاح أَبِيهَا","english":{"narrator":"","text":"Khansa’ daughter of Khidham told that when her father married her when she had previously been married and she disapproved of that, she went to God's Messenger and he revoked her marriage. \nA version by Ibn Majah has “the marriage  her father.”\n\nBukhari transmitted it."}},{"id":50,"idInBook":50,"chapterId":13,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَزَوَّجَهَا وَهِيَ بِنْتُ سَبْعِ سِنِينَ وَزُفَّتْ إِلَيْهِ وَهِيَ بِنْتُ تِسْعِ سِنِينَ وَلُعَبُهَا مَعَهَا وَمَاتَ عَنْهَا وَهِيَ بِنْتُ ثَمَانِيَ عَشْرَةَ. رَوَاهُ مُسلم","english":{"narrator":"","text":"‘A’isha said that the Prophet married her when she was seven, she was brought to live with him when she was nine bringing her toys with her, and he died when she was eighteen. \n\nMuslim transmitted it."}},{"id":51,"idInBook":51,"chapterId":13,"bookId":14,"arabic":"عَن أَبِي مُوسَى عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا نِكَاحَ إِلَّا بِوَلِيٍّ» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ","english":{"narrator":"","text":"Abu Musa reported the Prophet as saying, “There is no marriage without a guardian.” \n\nAhmad, Tirmidhi, Abu Dawud, Ibn Majah and Darimi transmitted it."}},{"id":52,"idInBook":52,"chapterId":13,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أَيُّمَا امْرَأَةٍ نَكَحَتْ بِغَيْرِ إِذْنِ وَلَيِّهَا فَنِكَاحُهَا بَاطِلٌ فَنِكَاحُهَا بَاطِلٌ فَنِكَاحُهَا بَاطِلٌ فَإِنْ دَخَلَ بِهَا فَلَهَا الْمَهْرُ بِمَا اسْتَحَلَّ مِنْ فَرْجِهَا فَإِنِ اشْتَجَرُوا فَالسُّلْطَانُ وَلِيُّ من لَا ولي لَهُ» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ والدارمي","english":{"narrator":"","text":"‘A’isha reported God’s Messenger as saying, “If any woman marries without the consent of her guardian her marriage is void, her marriage is void, her marriage is void. If there is cohabitation she gets her dower for the intercourse her husband has had. If there is a dispute*, the sultan is the guardian of one who has none.” \n* i.e., among guardians, Mirqat iii. 418 says that if their dispute would keep a woman from being married, they are treated as non-existent.\n\nAhmad, Tirmidhi, Abu Dawud, Ibn Majah and Darimi transmitted it."}},{"id":53,"idInBook":53,"chapterId":13,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْبَغَايَا اللَّاتِي يُنْكِحْنَ أَنْفُسَهُنَّ بِغَيْرِ بَيِّنَةٍ» . وَالْأَصَحُّ أَنَّهُ مَوْقُوفٌ عَلَى ابْنِ عَبَّاس. رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Ibn ‘Abbas reported the Prophet as saying, ‘Adulteresses are those women who marry themselves without evidence.” The soundest view is that it does not go back farther than Ibn ‘Abbas. \n\nTirmidhi transmitted it."}},{"id":54,"idInBook":54,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْيَتِيمَةُ تُسْتَأْمَرُ فِي نَفْسِهَا فَإِنْ صَمَتَتْ فَهُوَ إِذْنُهَا وَإِنْ أَبَتْ فَلَا جَوَازَ عَلَيْهَا» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالنَّسَائِيّ\nوَرَوَاهُ الدَّارمِيّ عَن أبي مُوسَى","english":{"narrator":"","text":"Abu Huraira reported God’s Messenger as saying, “An orphan girl should be consulted about herself; if she says nothing that indicates her permission, but if she refuses, the authority of the guardian cannot be exercised against her will.”\n\nTirmidhi, Abu Dawud and Nasa’i transmitted it, and Darimi transmitted it on the authority of Abu Musa."}},{"id":55,"idInBook":55,"chapterId":13,"bookId":14,"arabic":"وَعَنْ جَابِرٌ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أَيُّمَا عَبْدٍ تَزَوَّجَ بِغَيْرِ إِذْنِ سَيِّدِهِ فَهُوَ عَاهِرٌ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ والدرامي","english":{"narrator":"","text":"Jabir reported the Prophet as saying, “Any slave who marries without his master's permission is a fornicator.” \n\nTirmidhi, Abu Dawud and Darimi transmitted it."}},{"id":56,"idInBook":56,"chapterId":13,"bookId":14,"arabic":"عَنِ ابْنِ عَبَّاسٍ قَالَ: إِنَّ جَارِيَةً بِكْرًا أَتَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذكرت أَن أَبَاهَا زَوجهَا وَهِي كَارِهًا فَخَيَّرَهَا النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ. رَوَاهُ أَبُو دَاوُدَ","english":{"narrator":"","text":"Ibn ‘Abbas told that a virgin came to God’s Messenger and mentioned that her father had married her against her will, so the Prophet allowed her to exercise her choice. \n\nAbu Dawud transmitted it."}},{"id":57,"idInBook":57,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عَلَيْهِ وَسلم: «لَا تزوج الْمَرْأَة الْمَرْأَةَ وَلَا تُزَوِّجُ الْمَرْأَةُ نَفْسَهَا فَإِنَّ الزَّانِيَةَ هِيَ الَّتِي تُزَوِّجُ نَفْسَهَا» . رَوَاهُ ابْنُ مَاجَهْ","english":{"narrator":"","text":"Abu Huraira reported God's Messenger as saying, “A woman may not give a woman in marriage, nor may she give herself in marriage, for the immoral woman is the one who gives herself in marriage.” \n\nIbn Majah transmitted it."}},{"id":58,"idInBook":58,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ وَابْنِ عَبَّاسٍ قَالَا: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «من وُلِدَ لَهُ وَلَدٌ فَلْيُحْسِنِ اسْمَهُ وَأَدَبَهُ فَإِذَا بَلَغَ فَلْيُزَوِّجْهُ فَإِنْ بَلَغَ وَلَمْ يُزَوِّجْهُ فَأَصَابَ إِثْمًا فَإِنَّمَا إثمه على أَبِيه»","english":{"narrator":"","text":"Abu Sa'id and Ibn ‘Abbas reported God’s Messenger as saying, “He who has a son born to him should give him a good name and a good education and marry him when he reaches puberty. If he does not marry him when he reaches puberty and He commits sin, its guilt rests only upon his father.\"\n\nBaihaqi transmitted in Shu'ab al-iman."}},{"id":59,"idInBook":59,"chapterId":13,"bookId":14,"arabic":"وَعَنْ عُمَرَ بْنِ الْخَطَّابِ وَأَنَسِ بْنِ مَالِكٍ رَضِيَ اللَّهُ عَنْهُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" فِي التَّوْرَاةِ مَكْتُوبٌ: مَنْ بَلَغَتِ ابْنَتُهُ اثْنَتَيْ عَشْرَةَ سَنَةً وَلَمْ يُزَوِّجْهَا فَأَصَابَتْ إِثْمًا فَإِثْمُ ذَلِكَ عَلَيْهِ «. رَوَاهُمَا الْبَيْهَقِيُّ فِي» شُعَبِ الْإِيمَانِ \"","english":{"narrator":"","text":"‘Umar b. al-Khattab and Anas b. Malik reported God’s Messenger as saying that it is written in the Torah, “If anyone does not give his daughter in marriage when she reaches twelve and she commits sin, the guilt of that rests on him.\" \n\nBaihaqi transmitted in Shu'ab al-iman."}},{"id":60,"idInBook":60,"chapterId":13,"bookId":14,"arabic":"عَن الرّبيع بنت معوذ بن عَفْرَاءَ قَالَتْ: جَاءَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَدَخَلَ حِينَ بُنِيَ عَلَيَّ فَجَلَسَ عَلَى فِرَاشِي كمجلسك مني فَجعلت جويرات لَنَا يَضْرِبْنَ بِالدُّفِّ وَيَنْدُبْنَ مَنْ قُتِلَ مِنْ آبَائِي يَوْمَ بَدْرٍ إِذْ قَالَتْ إِحْدَاهُنَّ: وَفِينَا نَبِيٌّ يَعْلَمُ مَا فِي غَدٍ فَقَالَ: «دَعِي هَذِهِ وَقُولِي بِالَّذِي كُنْتِ تَقُولِينَ» . رَوَاهُ الْبُخَارِيُّ","english":{"narrator":"Ar-Rubayyi‘ daughter of Mu'awwidh b. ‘Afra’ said:","text":"The Prophet came and entered when I had been conducted to my husband, and sat on my bedding as you are sitting beside me. Some little girls of ours began to play the tambourine and eulogise those of my ancestors who were killed at the battle of Badr, and then one of them said: “And among us is a prophet who knows what will happen tomorrow.\" Thereupon he said, “Stop this and say what you were saying.” \n\nBukhari transmitted it."}},{"id":61,"idInBook":61,"chapterId":13,"bookId":14,"arabic":"وَعَن عَائِشَة رَضِي الله عَنهُ قَالَتْ: زُفَّتِ امْرَأَةٌ إِلَى رَجُلٍ مِنَ الْأَنْصَارِ فَقَالَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا كَانَ مَعَكُمْ لَهْوٌ؟ فَإِنَّ الْأَنْصَارَ يُعْجِبُهُمُ اللَّهْو» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"‘A’isha told that when a bride was conducted to one of the Ansar, God’s Prophet said, “Have you no amusement? The Ansar are delighted by amusement.\" \n\nBukhari transmitted it."}},{"id":62,"idInBook":62,"chapterId":13,"bookId":14,"arabic":"وَعَنْهَا قَالَتْ: تَزَوَّجَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي شَوَّالٍ وَبَنَى بِي فِي شَوَّالٍ فَأَيُّ نِسَاءِ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ أَحْظَى عِنْدَهُ مِنِّي؟ . رَوَاهُ مُسلم","english":{"narrator":"She said:","text":"“God’s Messenger married me in Shawwal and cohabited with me in Shawwal, so which of the wives of God’s Messenger was more beloved by him than I?\" \n\nMuslim transmitted it."}},{"id":63,"idInBook":63,"chapterId":13,"bookId":14,"arabic":"وَعَنْ عُقْبَةَ بْنِ عَامِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَحَقُّ الشُّرُوطِ أَنْ تُوفُوا بِهِ مَا اسْتَحْلَلْتُمْ بِهِ الْفروج»","english":{"narrator":"","text":"‘Uqba b. ‘Amir reported God’s Messenger as saying, “The most worthy conditions you fulfil are those by which you make sexual intercourse lawful.\" \n\n(Bukhari and Muslim.)"}},{"id":64,"idInBook":64,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَخْطُبُ الرَّجُلُ عَلَى خِطْبَةِ أَخِيهِ حَتَّى يَنْكِحَ أَو يتْرك»","english":{"narrator":"","text":"Abu Huraira reported God’s Messenger as saying, “A man must 'not ask a woman in marriage when his brother has done so already, until he marries or gives her up.\" \n\n(Bukhari and Muslim.)"}},{"id":65,"idInBook":65,"chapterId":13,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَسْأَلِ الْمَرْأَةُ طَلَاقَ أُخْتِهَا لِتَسْتَفْرِغَ صَحْفَتَهَا وَلِتَنْكِحَ فَإِنَّ لَهَا مَا قُدِّرَ لَهَا»","english":{"narrator":"","text":"He reported God’s Messenger as saying, “A woman must not ask to have her sister* divorced in order to deprive her of what belongs to her, but she must marry, because she will have what has been decreed for her.\"\n\n(Bukhari and Muslim.)\n\n* The word ‘sister’ is here used in a general sense. The tradition has been explained as referring to one of a man’s wives trying to get him to divorce another, but it probably refers to a woman whom the man has asked in marriage wanting him to divorce his wife before she marries him."}},{"id":66,"idInBook":66,"chapterId":13,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الشِّغَارِ وَالشِّغَارُ: أَنْ يُزَوِّجَ الرَّجُلُ ابْنَتَهُ عَلَى أَنْ يُزَوِّجَهُ الْآخَرُ ابْنَتَهُ وَلَيْسَ بَيْنَهُمَا صَدَاقٌ","english":{"narrator":"","text":"Ibn ‘Umar said God’s Messenger prohibited shighar, which means that a man gives his daughter in marriage on condition that the other gives his daughter to him in marriage without any dower being paid by either. In a version by Muslim he said, “There is no shighar in Islam.\"\n\n(Bukhari and Muslim.)"}},{"id":67,"idInBook":67,"chapterId":13,"bookId":14,"arabic":"وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ مُتْعَةِ النِّسَاءِ يَوْمَ خَيْبَرَ وَعَنْ أكل لُحُوم الْحمر الإنسية","english":{"narrator":"","text":"‘Ali said that at the battle for Khaibar God’s Messenger forbade the temporary marriage (mut’a) of women, and eating the flesh of domestic asses. \n\n(Bukhari and Muslim.)"}},{"id":68,"idInBook":68,"chapterId":13,"bookId":14,"arabic":"وَعَنْ سَلَمَةَ بْنِ الْأَكْوَعِ قَالَ: رَخَّصَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ أَوْطَاسٍ فِي الْمُتْعَةِ ثَلَاثًا ثُمَّ نَهَى عَنْهَا. رَوَاهُ مُسلم","english":{"narrator":"","text":"Salama b. al-Akwa said that in the year of Autas* God's Messenger permitted a temporary marriage for three nights, but afterwards he prohibited it. \n*This was after the battle of Hunain in 8 A.H.\n\nMuslim transmitted it."}},{"id":69,"idInBook":69,"chapterId":13,"bookId":14,"arabic":"عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ: عَلَّمَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ التَّشَهُّدَ فِي الصَّلَاةِ وَالتَّشَهُّدَ فِي الْحَاجَةِ قَالَ: التَّشَهُّدُ فِي الصَّلَاةِ: «التَّحِيَّاتُ لِلَّهِ وَالصَّلَوَاتُ وَالطَّيِّبَاتُ السَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ السَّلَامُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ» . وَالتَّشَهُّدُ فِي الْحَاجَةِ: «إِنَّ الْحَمْدَ لِلَّهِ نَسْتَعِينُهُ وَنَسْتَغْفِرُهُ وَنَعُوذُ بِاللَّهِ مِنْ شُرُورِ أَنْفُسنَا من يهد اللَّهُ فَلَا مُضِلَّ لَهُ وَمَنْ يُضْلِلْ فَلَا هَادِيَ لَهُ وَأَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ» . وَيَقْرَأُ ثَلَاثَ آيَاتٍ (يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ حَقَّ تُقَاتِهِ وَلَا تَمُوتُنَّ إِلَّا وَأَنْتُمْ مُسلمُونَ)\n(يَا أَيُّهَا النَّاسُ اتَّقُوا رَبَّكُمُ الَّذِي خَلَقَكُمْ مِنْ نَفْسٍ وَاحِدَةٍ وَخَلَقَ مِنْهَا زَوْجَهَا وَبَثَّ مِنْهُمَا رِجَالًا كَثِيرًا وَنِسَاءً وَاتَّقُوا اللَّهَ الَّذِي تساءلون وَالْأَرْحَامَ إِنَّ اللَّهَ كَانَ عَلَيْكُمْ رَقِيبًا)\n(يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَقُولُوا قَوْلًا سَدِيدًا يُصْلِحْ لَكُمْ أَعْمَالَكُمْ وَيَغْفِرْ لَكُمْ ذُنُوبَكُمْ وَمَنْ يُطِعِ اللَّهَ وَرَسُولَهُ فَقَدْ فَازَ فَوْزًا عَظِيما)\nرَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالنَّسَائِيُّ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ وَفِي جَامِعِ التِّرْمِذِيِّ فَسَّرَ الْآيَاتِ الثَّلَاثَ سُفْيَانُ الثَّوْرِيُّ وَزَادَ ابْنُ مَاجَهْ بَعْدَ قَوْلِهِ: «إِنَّ الْحَمْدَ لِلَّهِ نَحْمَدُهُ» وَبَعْدَ قَوْلِهِ: «من شرور أَنْفُسنَا وَمن سيئات أَعمالنَا» وَالدَّارِمِيُّ بَعْدَ قَوْلِهِ «عَظِيمًا» ثُمَّ يَتَكَلَّمُ بِحَاجَتِهِ وَرَوَى فِي شَرْحِ السُّنَّةِ عَنِ ابْنِ مَسْعُودٍ فِي خطْبَة الْحَاجة من النِّكَاح وَغَيره","english":{"narrator":"‘Abdallah b. Mas'ud said:","text":"God’s Messenger taught us the tashahhud in the prayer and in case of some need, saying that the tashahhud in the prayer is, “The adorations of the tongue, acts of worship and all good things belong to God. Peace, and God’s mercy and blessings be upon you, O Prophet. Peace be upon us and upon God’s upright servants. I testify that there is no god but God, and I testify that Muhammad is His servant and Messenger.” The tashahhud in case of some need is, “Praise be to God from whom we ask help and pardon. We seek refuge in God from the evils within ourselves. He whom God guides if has no one who can lead him astray, and he whom He leads astray has no one to guide him. I testify that there is no god but God, and   that Muhammad is His servant and Messenger.\" And one should recite three verses: “You who believe, fear God as He should be feared, and die only as Muslims;” (Al-Qur’an 3:102). “You who believe . . . fear God by whom you ask your mutual rights, and reverence the wombs. God has been watching over you;” (Al-Qur’an 4:1 which has ‘O Mankind.’). “You who believe, if you fear God and say what is true He will make your deeds sound and forgive you your sins. He who obeys God and His Messenger has attained a mighty success” (Al-Qur’an 33:70).\nAhmad, Tirmidhi, Abu Dawud, Nasa’i, Ibn Majah and Darimi transmitted it. In Tirmidhi’s Jami' Sufyan ath-Thauri gave a commentary on the three verses. Ibn Majah added “whom we praise” after “praise be to God”, and “from our evil actions” after “from the evils within ourselves.” After “mighty success” Darimi added that one should then express what he needs. In Sharh as-sunna it is transmitted on the authority of Ibn Mas’ud concerning the form of words for some need, whether marriage or something else."}},{"id":70,"idInBook":70,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «كُلُّ خُطْبَةٍ لَيْسَ فِيهَا تَشَهُّدٌ فَهِيَ كَالْيَدِ الْجَذْمَاءِ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ","english":{"narrator":"","text":"Abu Huraira reported God's Messenger as saying, \"Every sermon which does not contain a tashahhud is like a hand cut off.” \n\nTirmidhi transmitted it, saying this is a hasan gharib tradition."}},{"id":71,"idInBook":71,"chapterId":13,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «كُلُّ أَمْرٍ ذِي بَالٍ لَا يُبْدَأُ فِيهِ بِالْحَمْدِ لِلَّهِ فَهُوَ أَقْطَعُ» . رَوَاهُ ابْنُ مَاجَهْ","english":{"narrator":"","text":"He reported God's Messenger as saying, \"Every important matter which is not begun by an expression of praise to God is maimed.” \n\nIbn Majah transmitted it."}},{"id":72,"idInBook":72,"chapterId":13,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَعْلِنُوا هَذَا النِّكَاحَ وَاجْعَلُوهُ فِي الْمَسَاجِدِ وَاضْرِبُوا عَلَيْهِ بِالدُّفُوفِ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ غَرِيبٌ","english":{"narrator":"","text":"‘A’isha reported God's Messenger as saying, “Make this marriage publicly known, solemnise it in the mosques, and play tambourines in honour of it.” \n\nTirmidhi transmitted it, saying this is a gharib tradition."}},{"id":73,"idInBook":73,"chapterId":13,"bookId":14,"arabic":"وَعَنْ مُحَمَّدِ بْنِ حَاطِبٍ الْجُمَحِيِّ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" فَصَلَ مَا بَيْنَ الْحَلَالِ وَالْحَرَامِ: الصَّوْتُ وَالدُّفُّ فِي النِّكَاحِ \". رَوَاهُ أَحْمد وَالتِّرْمِذِيّ وَالنَّسَائِيّ وَابْن مَاجَه","english":{"narrator":"","text":"Muhammad b. Hatib al-Jumahi reported the Prophet as saying, “The distinction between what is lawful and what is unlawful is the song and the tambourine at a wedding.” \n\nAhmad, Tirmidhi, Nasa’i and Ibn Majah transmitted it."}},{"id":74,"idInBook":74,"chapterId":13,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ قَالَتْ: كَانَتْ عِنْدِي جَارِيَةً مِنَ الْأَنْصَارِ زَوَّجْتُهَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَا عَائِشَةُ أَلَا تُغَنِّينَ؟ فَإِنَّ هَذَا الْحَيَّ مِنَ الْأَنْصَارِ يُحِبُّونَ الْغِنَاءَ» . رَوَاهُ ابْن حبَان فِي صَحِيحه","english":{"narrator":"‘A’isha said:","text":"I had a girl of the Ansar whom I gave in marriage, and God's Messenger said, \"Why do you not sing, ‘A’isha, for this clan of the Ansar like singing?” \n\nIbn Hibban transmitted it in his Sahih."}},{"id":75,"idInBook":75,"chapterId":13,"bookId":14,"arabic":"وَعَن ابْن عَبَّاس قَالَ: أنكحت عَائِشَة ذَات قَرَابَةٍ لَهَا مِنَ الْأَنْصَارِ فَجَاءَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «أَهَدَيْتُمُ الْفَتَاةَ؟» قَالُوا: نعم قَالَ: «أرسلتم مَعهَا من تغني؟» قَالَتْ: لَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" إِنَّ الْأَنْصَارَ قَوْمٌ فِيهِمْ غَزَلٌ فَلَوْ بَعَثْتُمْ مَعَهَا مَنْ يَقُولُ:\nأَتَيْنَاكُمْ أَتَيْنَاكُمْ فحيانا وحياكم \". رَوَاهُ ابْن مَاجَه","english":{"narrator":"Ibn ‘Abbas said:","text":"‘A’isha gave a woman relative of hers among the Ansar in marriage and God’s Messenger came and said, “Have you escorted the girl to her husband?” On being told that they had, he asked whether they had sent someone along with her to sing, and when she replied that they had not, he said, “The Ansar are a people who give a place to love songs. I wish you had sent with her someone to say, ‘We have come to you, we have come to you; so may God preserve us and preserve you’.”\n\nIbn Majah transmitted it."}},{"id":76,"idInBook":76,"chapterId":13,"bookId":14,"arabic":"وَعَنْ سَمُرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أَيُّمَا امْرَأَةٍ زَوَّجَهَا وَلِيَّانِ فَهِيَ لِلْأَوَّلِ مِنْهُمَا وَمَنْ بَاعَ بَيْعًا مِنْ رَجُلَيْنِ فَهُوَ لِلْأَوَّلِ مِنْهُمَا» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُد وَالنَّسَائِيّ والدارمي","english":{"narrator":"","text":"Samura reported God’s Messenger as saying, “If two guardians have given any woman in marriage she marries the man for whom the first arranged, and if anyone sells anything to two men it goes to the first of them.” \n\nTirmidhi, Abu Dawud, Nasa’i and Darimi transmitted it."}},{"id":77,"idInBook":77,"chapterId":13,"bookId":14,"arabic":"عَنِ ابْنِ مَسْعُودٍ قَالَ: كُنَّا نَغْزُو مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَعَنَا نِسَاءٌ فَقُلْنَا: أَلَا نَخْتَصِي؟ فَنَهَانَا عَنْ ذَلِكَ ثُمَّ رَخَّصَ لَنَا أَنْ نَسْتَمْتِعَ فَكَانَ أَحَدُنَا يَنْكِحُ الْمَرْأَةَ بِالثَّوْبِ إِلَى أَجَلٍ ثُمَّ قَرَأَ عَبْدُ اللَّهِ: (يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تُحَرِّمُوا طَيِّبَاتِ مَا أَحَلَّ اللَّهُ لَكُمْ)","english":{"narrator":"Ibn Mas'ud said :","text":"When we were on an expedition along with God’s Messenger and had no women with us we asked whether we should not have ourselves castrated, but he forbade us to do that. Then he granted us licence to contract temporary marriages, and one would marry a woman giving a garment as dower up to a fixed date. Then ‘Abdallah recited, “You who believe, do not make unlawful the good things which God has made lawful for you” (Al-Qur’an 5:87).\n\n(Bukhari and Muslim.)"}},{"id":78,"idInBook":78,"chapterId":13,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: إِنَّمَا كَانَتِ الْمُتْعَةُ فِي أول الْإِسْلَام كَانَ الرجل يقدم الْبَلدة لَيْسَ لَهُ بِهَا مَعْرِفَةٌ فَيَتَزَوَّجُ الْمَرْأَةَ بِقَدْرِ مَا يرى أَنَّهُ يُقِيمُ فَتَحْفَظُ لَهُ مَتَاعَهُ وَتُصْلِحُ لَهُ شَيَّهُ حَتَّى إِذَا نَزَلَتِ الْآيَةُ (إِلَّا عَلَى أَزوَاجهم أَو مَا ملكت أَيْمَانهم)\nقَالَ ابْنُ عَبَّاسٍ: فَكُلُّ فَرْجٍ سِوَاهُمَا فَهُوَ حرَام. رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"Ibn ‘Abbas said:","text":"The temporary marriage applied only in the early days of Islam. A man would come to a settlement where he had no acquaintance and marry a woman for the period it was thought he would stay there, and she would look after his belongings and cook for him. But Ibn ‘Abbas said that when the verse came down, “Except their wives or the captives their right hands possess,” (Al-Qur’an 23:6) intercourse with anyone else became unlawful. \n\nTirmidhi transmitted it."}},{"id":79,"idInBook":79,"chapterId":13,"bookId":14,"arabic":"وَعَنْ عَامِرِ بْنِ سَعْدٍ قَالَ: دَخَلْتُ عَلَى قَرَظَةَ بْنِ كَعْبٍ وَأَبِي مَسْعُودٍ الْأَنْصَارِيِّ فِي عُرْسٍ وَإِذَا جِوَارٍ يُغَنِّينَ فَقُلْتُ: أَيْ صَاحِبَيْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَهْلَ بَدْرٍ يُفْعَلُ هَذَا عِنْدَكُمْ؟ فَقَالَا: اجْلِسْ إِنْ شِئْتَ فَاسْمَعْ مَعَنَا وَإِنْ شِئْتَ فَاذْهَبْ فَإِنَّهُ قَدْ رَخَّصَ لَنَا فِي اللَّهْوِ عِنْدَ الْعُرْسِ. رَوَاهُ النَّسَائِيّ","english":{"narrator":"A‘mir b. Sa'd said :","text":"Going in and finding Qaraza b. Ka‘b and Abu Mas'ud al-Ansari at a wedding where girls were singing I said, “Is this being done in the presence of you two who are companions of God’s Messenger and were present at Badr ?” They replied, “Sit down if you wish and listen along with us, or go away if you wish, for we have been given licence for amusement at a wedding.” \n\nNasa’i transmitted it."}},{"id":80,"idInBook":80,"chapterId":13,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يُجْمَعُ بَيْنَ الْمَرْأَة وعمتها وَلَا بَين الْمَرْأَة وخالتها»","english":{"narrator":"","text":"Abu Huraira reported God's Messenger as saying, “A man may not marry a woman and her paternal aunt, or a woman and her maternal aunt.” \n\n(Bukhari and Muslim.)"}},{"id":81,"idInBook":81,"chapterId":13,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَحْرُمُ مِنَ الرَّضَاعَةِ مَا يحرم من الْولادَة» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"‘A’isha reported God’s Messenger as saying, “What is unlawful by reason of consanguinity is unlawful by reason of fosterage.” \n\nBukhari transmitted it."}},{"id":82,"idInBook":82,"chapterId":13,"bookId":14,"arabic":"وَعَنْهَا قَالَتْ: جَاءَ عَمِّي مِنَ الرَّضَاعَةِ فَاسْتَأْذَنَ عَلَيَّ فَأَبَيْتُ أَنْ آذَنَ لَهُ حَتَّى أَسْأَلَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجَاءَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلْتُهُ فَقَالَ: «أَنَّهُ عَمُّكِ فَأْذَنِي لَهُ» قَالَت: فَقلت: يَا رَسُولَ اللَّهِ إِنَّمَا أَرْضَعَتْنِي الْمَرْأَةُ وَلَمْ يرضعني الرَّجُلُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّه عمك فليلج عَلَيْك» وَذَلِكَ بَعْدَمَا ضرب علينا الْحجاب","english":{"narrator":"She said:","text":"My paternal uncle through fosterage came and asked permission to enter, but I refused to allow him till I asked God’s Messenger. When he came I asked him and he said, “He is your paternal uncle, so give him permission.” I replied, “Messenger of God, it was only the woman who suckled me and not the man” whereupon he said, “He is your paternal uncle, so let him come in where you are.” That was after seclusion was instituted for us. \n\n(Bukhari and Muslim.)"}},{"id":83,"idInBook":83,"chapterId":13,"bookId":14,"arabic":"وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ: يَا رَسُولَ اللَّهِ هَلْ لَكَ فِي بِنْتِ عَمِّكَ حَمْزَةَ؟ فَإِنَّهَا أَجْمَلُ فَتَاةٍ فِي قُرَيْشٍ فَقَالَ لَهُ: «أَمَا عَلِمْتَ أَنَّ حَمْزَةَ أَخِي مَنِ الرَّضَاعَةِ؟ وَأَنَّ اللَّهَ حَرَّمَ مِنَ الرَّضَاعَةِ مَا حرم من النّسَب؟» . رَوَاهُ مُسلم","english":{"narrator":"","text":"‘Ali said, “Messenger of God, would you like the daughter of your paternal uncle Hamza, for she is the most beautiful girl in Quraish?” He replied, “Do you not know that Hamza is my foster-brother, and that God has prohibited by reason of fosterage what He has prohibited by reason of genealogy?” \n\nMuslim transmitted it."}},{"id":84,"idInBook":84,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أُمِّ الْفَضْلِ قَالَتْ: أَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا تُحَرِّمُ الرضعة أَو الرضعتان»\nوَفِي رِوَايَةِ عَائِشَةَ قَالَ: «لَا تُحَرِّمُ الْمَصَّةُ والمصتان»\nوَفِي أُخْرَى لِأُمِّ الْفَضْلِ قَالَ: «لَا تُحَرِّمُ الإملاجة والإملاجتان» . هَذِه رِوَايَات لمُسلم","english":{"narrator":"","text":"Umm al-Fadl stated that God’s Prophet said, “Being suckled once or twice does not make marriage unlawful.” In ‘A’isha’s version he said, “One or two sucks do not make marriage unlawful.” In another by Umm al-Fadl he said, “One suckling or two does not make marriage unlawful.” \n\nThese are versions by Muslim."}},{"id":85,"idInBook":85,"chapterId":13,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ قَالَتْ: كَانَ فِيمَا أُنْزِلَ مِنَ الْقُرْآنِ: «عَشْرُ رَضَعَاتٍ مَعْلُومَاتٍ يُحَرِّمْنَ» . ثُمَّ نُسِخْنَ بِخَمْسٍ مَعْلُومَاتٍ فَتُوُفِّيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهِيَ فِيمَا يُقْرَأُ مِنَ الْقُرْآنِ. رَوَاهُ مُسلم","english":{"narrator":"","text":"‘A’isha said that in what was sent down in the Qur’an ten known sucklings made marriage unlawful, but they were abrogated by five known ones, and when God’s Messenger died these words were among what was recited in the Qur’an. \n\nMuslim transmitted it."}},{"id":86,"idInBook":86,"chapterId":13,"bookId":14,"arabic":"وَعَنْهَا: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَيْهَا وَعِنْدَهَا رَجُلٌ فَكَأَنَّهُ كَرِهَ ذَلِكَ فَقَالَت: إِنَّه أخي فَقَالَ: «انظرن من إخوانكن؟ فَإِنَّمَا الرضَاعَة من المجاعة»","english":{"narrator":"","text":"She said that the Prophet visited her when a man was with her and he seemed to disapprove of that. She told him that he was her brother and he replied, “Consider* who your brothers are, for fosterage is that consequent on hunger” (Fosterage applies only to infants and not to children who are able to take solid food).\n* The verb is in the plural, indicating that this is a general instruction and not simply a reply to A’isha.\n\n(Bukhari and Muslim.)"}},{"id":87,"idInBook":87,"chapterId":13,"bookId":14,"arabic":"وَعَنْ عُقْبَةَ بْنِ الْحَارِثِ: أَنَّهُ تَزَوَّجَ ابْنَةً لِأَبِي إِهَابِ بْنِ عَزِيزٍ فَأَتَتِ امْرَأَةٌ فَقَالَتْ: قَدْ أَرْضَعْتُ عُقْبَةَ وَالَّتِي تَزَوَّجَ بِهَا فَقَالَ لَهَا عُقْبَةُ: مَا أَعْلَمُ أَنَّكِ قَدْ أَرْضَعْتِنِي وَلَا أَخْبَرْتِنِي فَأَرْسَلَ إِلَى آلِ أَبِي إِهَابٍ فَسَأَلَهُمْ فَقَالُوا: مَا عَلِمْنَا أَرْضَعْتَ صَاحِبَتُنَا فَرَكِبَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْمَدِينَةِ فَسَأَلَهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «كَيْفَ وَقَدْ قِيلَ؟» فَفَارَقَهَا عُقْبَةُ وَنَكَحَتْ زوجا غَيره. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"‘Uqba b. al-Harith said he married a daughter of Ihab b. 'Aziz and a woman came and said she had suckled 'Uqba and the woman whom he had married, to which he replied, “I am not aware that you suckled me, and you did not inform me.” So he sent to the family of Abu Ihab and asked them, and when they told him that they did not know whether she had suckled their daughter he rode to the Prophet in Medina and asked him. God’s Messenger said, “How can you hesitate when you have been told?” ‘Uqba therefore separated from her and she married another husband. \n\nBukhari transmitted it."}},{"id":88,"idInBook":88,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيُّ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ حُنَيْنٍ بَعَثَ جَيْشًا إِلَى أَوْطَاسٍ فَلَقُوا عَدُوًّا فَقَاتَلُوهُمْ فَظَهَرُوا عَلَيْهِمْ وَأَصَابُوا لَهُمْ سَبَايَا فَكَأَنَّ نَاسًا مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَحَرَّجُوا مِنْ غِشْيَانِهِنَّ مِنْ أَجْلِ أَزْوَاجِهِنَّ مِنَ الْمُشْرِكِينَ فَأَنْزَلَ اللَّهُ تَعَالَى فِي ذَلِكَ (وَالْمُحْصَنَاتُ مِنَ النِّسَاء إِلَّا مَا ملكت أَيْمَانكُم)\nأَيْ فَهُنَّ لَهُمْ حَلَالٌ إِذَا انْقَضَتْ عِدَّتُهُنَّ. رَوَاهُ مُسلم","english":{"narrator":"Abu Sa'id al-Khudri said:","text":"At the battle of Hunain God’s Messenger sent an army to Autas, and they met an enemy and fought with them. . Having prevailed over them and taken captives the Prophet’s companions seemed to hold back from having intercourse with them because of their husbands among the polytheists. Then God most high sent down regarding that, “And women already married, except those whom your right hands possess” (Al-Qur’an 4:24). That means that they were lawful for them when their ‘idda* period came to an end. \n* The period which a widow or divorced woman must observe before remarriage. See Ch. 26.\n\n\nMuslim transmitted it."}},{"id":89,"idInBook":89,"chapterId":13,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ تُنْكَحَ الْمَرْأَةُ عَلَى عَمَّتِهَا أَوِ الْعَمَّةُ عَلَى بِنْتِ أَخِيهَا وَالْمَرْأَةُ عَلَى خَالَتِهَا أَوِ الْخَالَةُ عَلَى بِنْتِ أُخْتِهَا لَا تُنْكَحُ الصُّغْرَى عَلَى الْكُبْرَى وَلَا الْكُبْرَى عَلَى الصُّغْرَى. رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ والدارمي وَالنَّسَائِيّ وَرِوَايَته إِلَى قَوْله: بنت أُخْتهَا","english":{"narrator":"","text":"Abu Huraira said that God’s Messenger forbade that a woman should be married to one who had married her paternal aunt, or a paternal aunt to one who had married her brother’s daughter, or a woman to one who had married her maternal aunt, or a maternal aunt to one who had married her sister's daughter. A younger sister must not be married to one who has married an elder sister, nor an elder sister to one who has married a younger sister. \n\nTirmidhi, Abu Dawud, Darimi and Nasa’i transmitted it, Nasa’i’s version ending with “her sister’s daughter.”"}},{"id":90,"idInBook":90,"chapterId":13,"bookId":14,"arabic":"وَعَنِ الْبَرَاءِ بْنِ عَازِبٍ قَالَ: مَرَّ بِي خَالِي أَبُو بردة بن دِينَار وَمَعَهُ لِوَاءٌ فَقُلْتُ: أَيْنَ تَذْهَبُ؟ قَالَ: بَعَثَنِي النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى رَجُلٍ تَزَوَّجَ امْرَأَةَ أَبِيهِ آتِيهِ بِرَأْسِهِ. رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُد","english":{"narrator":"Al-Bara’ b. ‘Azib said:","text":"My maternal uncle Abu Burda b. Niyar passed me carrying a standard, and I asked him where he was going. He replied, “The Prophet has sent me to bring him the head of a man who has married his father’s wife.” \nA version by Abu Dawud, Nasa’i, Ibn Majah and Darimi has, “He has ordered me to cut off his head and take his property.” This version has “my paternal uncle” instead of “my maternal uncle.”\n\nTirmidhi and Abu Dawud transmitted it."}},{"id":91,"idInBook":91,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أُمِّ سَلَمَةَ قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يُحَرِّمُ مِنَ الرِّضَاعِ إِلَّا مَا فَتَقَ الْأَمْعَاءَ فِي الثَّدْيِ وَكَانَ قبل الْفِطَام» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Umm Salama reported God’s Messenger as saying, “The only suckling which makes marriage unlawful is that which is taken from, the breast and enters the bowels, and is taken before the time of weaning.” \n\nTirmidhi transmitted it."}},{"id":92,"idInBook":92,"chapterId":13,"bookId":14,"arabic":"وَعَنْ حَجَّاجِ بْنِ حَجَّاجٍ الْأَسْلَمِيِّ عَنْ أَبِيهِ أَنَّهُ قَالَ: يَا رَسُولَ اللَّهِ مَا يُذْهِبُ عَنِّي مَذَمَّةَ الرِّضَاعِ؟ فَقَالَ: \n\" غُرَّةٌ: عَبْدٌ أَوْ أَمَةٌ \". رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالنَّسَائِيُّ وَالدَّارِمِيُّ","english":{"narrator":"","text":"Hajjaj b. Hajjaj al-Aslami quoted his father as saying, “Messenger of God, what will remove from me the obligation due for fostering a child.”* He replied, “A slave or a slave-girl of good quality.” \n*It is said that Arabs liked to give a woman who had fostered a child something over and above the hire. This tradition deals with the amount to be considered full compensation for services rendered. \n\nTirmidhi, Abu Dawud, Nasa’i and Darimi transmitted it."}},{"id":93,"idInBook":93,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أَبِي الطُّفَيْلِ الْغَنَوِيِّ قَالَ: كُنْتُ جَالِسًا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذْ أَقْبَلَتِ امْرَأَةٌ فَبَسَطَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رِدَاءَهُ حَتَّى قَعَدَتْ عَلَيْهِ فَلَمَّا ذَهَبَتْ قِيلَ هَذِهِ أَرْضَعَتِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ. رَوَاهُ أَبُو دَاوُدَ","english":{"narrator":"Abut Tufail al-Ghanawi said:","text":"When I was sitting with the Prophet a woman came forward and the Prophet spread out his cloak and she sat on it. Then when she went away someone said that this woman had suckled the Prophet. \n\nAbu Dawud transmitted it."}},{"id":94,"idInBook":94,"chapterId":13,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُ أَنَّ غيلَان بن سَلمَة الثَّقَفِيَّ أَسْلَمَ وَلَهُ عَشْرُ نِسْوَةٍ فِي الْجَاهِلِيَّةِ فَأَسْلَمْنَ مَعَهُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَمْسِكْ أَرْبَعًا وَفَارِقْ سَائِرَهُنَّ» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيّ وَابْن مَاجَه","english":{"narrator":"","text":"Ibn ‘Umar told that Ghailan b. Salama ath-Thaqafi accepted Islam and that he had had ten wives in the pre-Islamic period who accepted Islam along with him; so the Prophet told him to keep four and separate from the rest of them. \n\nAhmad, Tirmidhi and Ibn Majah transmitted it."}},{"id":95,"idInBook":95,"chapterId":13,"bookId":14,"arabic":"وَعَنْ نَوْفَلِ بْنِ مُعَاوِيَةَ قَالَ: أَسْلَمْتُ وَتَحْتِي خَمْسُ نِسْوَةٍ فَسَأَلْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «فَارِقْ وَاحِدَةً وَأَمْسِكْ أَرْبَعًا» فَعَمَدْتُ إِلَى أَقْدَمِهِنَّ صُحْبَةً عِنْدِي: عَاقِرٍ مُنْذُ سِتِّينَ سنة ففارقتها. رَوَاهُ فِي شرح السّنة","english":{"narrator":"Naufal b. Mu’awiya said:","text":"When I accepted Islam I had five wives, so I consulted the Prophet and he said, “Separate from one and keep four.” I therefore decided on the one who had been longest with me and had been barren for sixty years,* and separated from her. \n* This statement may seem strange when one considers that Naufal is said to have died in the Caliphate of Yazid b. Mu'awiya (60-64 A.H.). Some say he lived 60 years in the pre-Islamic period and 60 years in Islam. Others says he died aged 100. He is said to have accepted Islam at the Conquest of Mecca. The tradition cannot mean that he had been married to this woman for 60 years; it probably indicates that she was both barren and much older than he. She was possibly his first wife. Cf. Ibn Abu Hatim, al-Jarh wat-ta’dil, IV, i, 487 i.; Isti'ab, p. 293 ; Ibn Hajar, Tahdhib, x, 492; Isaba, iii, 1191.\n\nIt is transmitted in Sharh as-sunna."}},{"id":96,"idInBook":96,"chapterId":13,"bookId":14,"arabic":"وَعَنِ الضَّحَّاكِ بْنِ فَيْرُوزٍ الدَّيْلَمِيِّ عَنْ أَبِيهِ قَالَ: قَلْتُ: يَا رَسُولَ اللَّهِ إِنِّي أَسْلَمْتُ وتحتي أختَان قَالَ: «اختر أيتها شِئْتَ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ","english":{"narrator":"","text":"Ad-Dahhak b. Fairuz ad-Dailamli told on his father’s authority that he had said, \"Messenger of God, I have accepted Islam and I am married to two sisters.\" He replied, “Choose whichever of them you wish.” \n\nTirmidhi, Abu Dawud and Ibn Majah transmitted it."}},{"id":97,"idInBook":97,"chapterId":13,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: أَسْلَمَتِ امْرَأَةٌ فَتَزَوَّجَتْ فَجَاءَ زَوْجُهَا إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: يَا رَسُولَ اللَّهِ إِنِّي قَدْ أَسْلَمْتُ وَعَلِمَتْ بِإِسْلَامِي فَانْتَزَعَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ زَوْجِهَا الْآخَرِ وَرَدَّهَا إِلَى زَوْجِهَا الْأَوَّلِ وَفِي رِوَايَةٍ: أَنَّهُ قَالَ: إِنَّهَا أَسْلَمَتْ مَعِي فَرَدَّهَا عَلَيْهِ. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Ibn ‘Abbas told that a woman who had accepted Islam married, and her husband (i.e. the one she had left to marry another when she became a Muslim) went to the Prophet and said, \"Messenger of God, I have accepted Islam and she knew that I had done so.” So God’s Messenger took her away from her second husband and restored her to her first. In a version he said, “She accepted Islam along with me,” so he restored her to him. \n\nAbu Dawud transmitted it."}},{"id":98,"idInBook":98,"chapterId":13,"bookId":14,"arabic":"وَرُوِيَ فِي «شَرْحِ السُّنَّةِ» : أَنَّ جَمَاعَةً مِنَ النِّسَاءِ رَدَّهُنَّ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالنِّكَاحِ الأول على أَزوَاجهنَّ عِنْد اجْتِمَاع الإسلاميين بَعْدَ اخْتِلَافِ الدِّينِ وَالدَّارِ مِنْهُنَّ بِنْتُ الْوَلِيدِ بْنِ مُغِيرَةَ كَانَتْ تَحْتَ صَفْوَانَ بْنِ أُمَيَّةَ فَأَسْلَمَتْ يَوْمَ الْفَتْحِ وَهَرَبَ زَوْجُهَا مِنَ الْإِسْلَامِ فَبعث النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَيْهِ ابْنَ عَمِّهِ وَهْبَ بْنَ عُمَيْرٍ بِرِدَاءِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَانًا لِصَفْوَانَ فَلَمَّا قَدِمَ جَعَلَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَسْيِيرَ أَرْبَعَةِ أَشْهُرٍ حَتَّى أَسْلَمَ فَاسْتَقَرَّتْ عِنْدَهُ وَأَسْلَمَتْ أَمُّ حَكِيمٍ بِنْتُ الْحَارِثِ بْنِ هِشَامٍ امْرَأَةُ عِكْرِمَةَ بْنِ أَبِي جَهْلٍ يَوْمَ الْفَتْحِ بِمَكَّةَ وَهَرَبَ زَوْجُهَا مِنَ الْإِسْلَامِ حَتَّى قَدِمَ الْيَمَنَ فَارْتَحَلَتْ أَمُّ حَكِيمٍ حَتَّى قَدِمَتْ عَلَيْهِ الْيَمَنَ فَدَعَتْهُ إِلَى الْإِسْلَامِ فَأَسْلَمَ فَثَبَتَا عَلَى نِكَاحِهِمَا. رَوَاهُ مَالِكٌ عَنِ ابْنِ شهَاب مُرْسلا","english":{"narrator":"","text":"In Sharh as-sunna it is related that the Prophet restored a number of women to their husbands by the first marriage when they had both accepted Islam after the change of religion and dwelling. Among them was the daughter of al-Walid b. Mughira, the wife of Safwan b. Umayya. She accepted Islam on the day of the Conquest, but her husband fled from Islam. Then his cousin Wahb b. ‘Umair was sent to him with God’s Messenger’s cloak as a guarantee of security to Safwan, and when he came God’s Messenger granted him a respite of four months before accepting Islam, so she stayed with him. Umm Hakim daughter of al-Harith b. Hisham, the wife of Ikrima b. Abu Jahl, accepted Islam in Mecca on the day of the Conquest, but her husband fled from Islam and went to the Yemen. Umm Hakim journeyed and came to him in the Yemen, and when she invited him to accept Islam he did so, and they remained married.\n \nMalik transmitted it in mursal form on the authority of Ibn Shihab."}},{"id":99,"idInBook":99,"chapterId":13,"bookId":14,"arabic":"عَنِ ابْنِ عَبَّاسٍ قَالَ: حُرِّمَ مِنَ النَّسَبِ سَبْعٌ وَمِنَ الصِّهْرِ سَبْعٌ ثُمَّ قَرَأَ: (حُرِّمَتْ عَلَيْكُم أُمَّهَاتكُم)\nالْآيَة. رَوَاهُ البُخَارِيّ","english":{"narrator":"Ibn ‘Abbas said:","text":"Seven classes of women are prohibited by reason of consanguinity and seven by reason of relationship by marriage. He then recited, \"Prohibited to you are your mothers ...” (Al-Qur’an 4:23).\n\nBukhari transmitted it."}},{"id":100,"idInBook":100,"chapterId":13,"bookId":14,"arabic":"وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أَيُّمَا رَجُلٍ نَكَحَ امْرَأَةً فَدَخَلَ بهَا فَلَا يَحِلُّ لَهُ نِكَاحُ ابْنَتِهَا وَإِنْ لَمْ يَدْخُلْ بِهَا فَلْيَنْكِحِ ابْنَتَهَا وَأَيُّمَا رَجُلٍ نَكَحَ امْرَأَةً فَلَا يَحِلُّ لَهُ أَنْ يَنْكِحَ أُمَّهَا دَخَلَ أَوْ لَمْ يَدْخُلْ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ لَا يَصِحُّ مِنْ قِبَلِ إِسْنَادِهِ إِنَّمَا رَوَاهُ ابْنُ لَهِيعَةَ وَالْمُثَنَّى بْنُ الصَّبَّاحِ عَنْ عَمْرِو بْنِ شُعَيْبٍ وَهُمَا يُضَعَّفَانِ فِي الْحَدِيثِ","english":{"narrator":"","text":"‘Amr b. Shu’aib, on his father’s authority, said that his grandfather reported God’s Messenger as saying, “If any man marries a woman and cohabits with her it is not lawful for him to marry her daughter, but if he does not cohabit with her he may marry her daughter; and if any man marries a woman it is not lawful of him to marry her mother whether he has cohabited with her or not.” \n\nTirmidhi transmitted it, saying this is a tradition which is not sound, with respect to its isnad. It is transmitted only by Ibn Lahi'a and al-Muthanna b. as-Sabbah on the authority of ‘Amr b. Shu’aib, and they are both declared to be weak in tradition."}},{"id":101,"idInBook":101,"chapterId":13,"bookId":14,"arabic":"عَنْ جَابِرٍ قَالَ: كَانَتِ الْيَهُودُ تَقُولُ: إِذَا أَتَى الرَّجُلُ امْرَأَتَهُ مِنْ دُبُرِهَا فِي قُبُلِهَا كَانَ الْوَلَد أَحول فَنزلت: (نساوكم حرث لكم فَأتوا حَرْثكُمْ أَنى شِئْتُم)","english":{"narrator":"Jabir declared that the Jews used to say:","text":"“When a man has intercourse with his wife through the vagina, but being on her back, the child will have a squint,” so the verse came down, “Your wives are a tilth to you, so come to your tilth however you will” (Al-Qur’an 2:223).\n\n(Bukhari and Muslim.)"}},{"id":102,"idInBook":102,"chapterId":13,"bookId":14,"arabic":"وَعنهُ كُنَّا نَعْزِلُ وَالْقُرْآنُ يَنْزِلُ. مُتَّفَقٌ عَلَيْهِ. وَزَادَ مُسْلِمٌ: فَبَلَغَ ذَلِكَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلم ينهنا","english":{"narrator":"","text":"He said that in the period when the Qur'an was coming down they used to withdraw the penis.* \n* i.e. before emission of semen, to avoid conception.\n\n(Bukhari and Muslim.) Muslim added that the Prophet heard of that and did not prohibit it."}},{"id":103,"idInBook":103,"chapterId":13,"bookId":14,"arabic":"وَعَنْهُ قَالَ: إِنَّ رَجُلًا أَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: \" إِن لي جَارِيَةً هِيَ خَادِمَتُنَا وَأَنَا أَطُوفُ عَلَيْهَا وَأَكْرَهُ أَنْ تَحْمِلَ فَقَالَ: «اعْزِلْ عَنْهَا إِنْ شِئْتَ فَإِنَّهُ سَيَأْتِيهَا مَا قُدِّرَ لَهَا» . فَلَبِثَ الرَّجُلُ ثمَّ أَتَاهُ فَقَالَ: إِن الْجَارِيَة قد حبلت فَقَالَ: «قَدْ أَخْبَرْتُكَ أَنَّهُ سَيَأْتِيهَا مَا قُدِّرَ لَهَا» . رَوَاهُ مُسلم","english":{"narrator":"","text":"He told of a man who went to God's Messenger and said, “I have a slave-girl who is our servant and I have intercourse with her, but do not want her to conceive.” He replied, “Withdraw your penis from her if you wish, for what is decreed for her will come to her.” After a time the man came and told him the girl had become pregnant, and he said, “I told you that what was decreed for her would come to her.” \n\nMuslim transmitted it."}},{"id":104,"idInBook":104,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: خَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَزْوَةِ بَنِي الْمُصْطَلِقِ فَأَصَبْنَا سَبْيًا مِنْ سَبْيِ الْعَرَب فاشتهينا النِّسَاء واشتدت عَلَيْنَا الْعُزْبَةُ وَأَحْبَبْنَا الْعَزْلَ فَأَرَدْنَا أَنْ نَعْزِلَ وَقُلْنَا: نَعْزِلُ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ أَظْهُرِنَا قَبْلَ أَنْ نَسْأَلَهُ؟ فَسَأَلْنَاهُ عَن ذَلِك فَقَالَ: «مَا عَلَيْكُمْ أَلَّا تَفْعَلُوا مَا مِنْ نَسَمَةٍ كَائِنَةٍ إِلَى يَوْمِ الْقِيَامَةِ إِلَّا وَهِيَ كَائِنَةٌ»","english":{"narrator":"Abu Sa'id al-Khudri said:","text":"We went out with God’s Messenger on the expedition to the B. al-Mustaliq (an expedition in 6 A.H) and took some Arab women captive, and we desired the women, for we were suffering from the absence of our wives. We liked withdrawing the penis and wanted to do so, but we asked ourselves whether we could do it when God’s Messenger was among us before asking him. So we asked him about that and he replied, “It does not matter if you do not do it, for every soul that is to be born up to the day of resurrection will be born.” \n\n(Bukhari and Muslim.)"}},{"id":105,"idInBook":105,"chapterId":13,"bookId":14,"arabic":"وَعَنْهُ قَالَ: سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ الْعَزْلِ فَقَالَ: «مَا مِنْ كُلِّ الْمَاءِ يَكُونُ الْوَلَدُ وَإِذَا أَرَادَ اللَّهُ خَلْقَ شَيْءٍ لَمْ يَمْنَعْهُ شَيْءٌ» . رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"He said that when God’s Messenger was asked about withdrawing the penis he replied, “The child does not come from all the liquid, and when God intends to create anything nothing can prevent Him.” \n\nMuslim transmitted it."}},{"id":106,"idInBook":106,"chapterId":13,"bookId":14,"arabic":"وَعَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ: أَنَّ رَجُلًا جَاءَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: إِنِّي أعزل عَن امْرَأَتي. فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «لم تفعل ذَلِك؟» فَقَالَ الرَّجُلُ: أَشْفِقُ عَلَى وَلَدِهَا. فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَوْ كَانَ ذَلِكَ ضاراً ضرّ فَارس وَالروم» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Sa'd b. Abu Waqqas told of a man who came to God's Messenger and said that he withdrew his penis from his wife. He asked him why he did that and the man replied that he feared for her child, so God’s Messenger said, “If that were injurious it would injure the Persians and the Greeks.”*\n* This is explained as referring to a woman who is suckling a child, and the fear that the child, would be injured if she became pregnant.\n\nMuslim transmitted it."}},{"id":107,"idInBook":107,"chapterId":13,"bookId":14,"arabic":"وَعَن جذامة بِنْتِ وَهْبٍ قَالَتْ: حَضَرْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي أُنَاسٍ وَهُوَ يَقُولُ: «لقد هَمَمْت أَن أَنْهَى عَنِ الْغِيلَةِ فَنَظَرْتُ فِي الرُّومِ وَفَارِسَ فَإِذَا هُمْ يُغِيلُونَ أَوْلَادَهُمْ فَلَا يَضُرُّ أَوْلَادَهُمْ ذَلِكَ شَيْئًا» . ثُمَّ سَأَلُوهُ عَنِ الْعَزْلِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" ذَلِكَ الوأد الْخَفي وَهِي (وَإِذا الموؤودة سُئِلت)\nرَوَاهُ مُسلم","english":{"narrator":"Judama daughter of Wahb said:","text":"I was with God’s Messenger along with some people when he was saying, “I intended to prohibit suckling during pregnancy* but I considered the Greeks and the Persians and saw that they suckled their children during pregnancy without any injury being caused to their children thereby.” Then they asked him about withdrawing the penis and God’s Messenger replied, “That is the secret burying alive” and reference is made to it in the words, “When the girl buried alive will be asked (Al-Qur’an 81:8).”\n*(Ghila. It means either suckling during pregnancy, or intercourse with a woman while she is suckling a child.\n  \nMuslim transmitted it."}},{"id":108,"idInBook":108,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:\nإِنَّ أَعْظَمَ الْأَمَانَةِ عِنْدَ اللَّهِ يَوْمَ الْقِيَامَةِ \n\" وَفِي رِوَايَةٍ: إِنَّ مِنْ أَشَرِّ النَّاسِ عِنْدَ اللَّهِ مَنْزِلَةً يَوْمَ الْقِيَامَةِ الرَّجُلُ يُفْضِي إِلَى امْرَأَتِهِ وَتُفْضِي إِلَيْهِ ثمَّ ينشر سرها \". رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Sa'id al-Khudri reported God's Messenger as saying, “The most serious breach of trust in God’s sight on the day of resurrection ...” A version has, “Among those who will have the worst position in God’s sight on the day of resurrection is the man who has intercourse with his wife, and she with him, and then spreads her secret.”*\n* i.e. talks about the subject to others, or tells people about defects or beauties he has found in her.\n\nMuslim transmitted it."}},{"id":109,"idInBook":109,"chapterId":13,"bookId":14,"arabic":"عَنِ ابْنِ عَبَّاسٍ قَالَ: أُوحِيَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: (نساوكم حرث لكم فَأتوا حَرْثكُمْ)\nالْآيَةَ: «أَقْبِلْ وَأَدْبِرْ وَاتَّقِ الدُّبُرَ وَالْحَيْضَةَ» . رَوَاهُ التِّرْمِذِيّ وَابْن مَاجَه","english":{"narrator":"Ibn ‘Abbas said:","text":"God’s Messenger received the revelation, “Your wives are a tilth to you, so come to your tilth . . .” (Al-Qur’an 2:223) that means from in front or behind, but avoid the anus and intercourse during menstruation. \n\nTirmidhi and Ibn Majah transmitted it."}},{"id":110,"idInBook":110,"chapterId":13,"bookId":14,"arabic":"وَعَنْ خُزَيْمَةَ بْنِ ثَابِتٍ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ اللَّهَ لَا يستحيي مِنَ الْحَقِّ لَا تَأْتُوا النِّسَاءَ فِي أَدْبَارِهِنَّ» . رَوَاهُ أَحْمد وَالتِّرْمِذِيّ وَابْن مَاجَه. والدارمي","english":{"narrator":"","text":"Khuzaima b. Thabit reported the Prophet as saying, “God is not ashamed of the truth. Do not have intercourse with women through the anus.”\n\nAhmad, Tirmidhi, Ibn Majah and Darimi transmitted it."}},{"id":111,"idInBook":111,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَلْعُونٌ مَنْ أَتَى امْرَأَتَهُ فِي دُبُرِهَا» . رَوَاهُ أَحْمَدُ وَأَبُو دَاوُدَ","english":{"narrator":"","text":"Abu Huraira reported God’s Messenger as saying, “He who has intercourse with his wife through her anus is accursed.” \n\nAhmad and Abu Dawud transmitted it."}},{"id":112,"idInBook":112,"chapterId":13,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ الَّذِي يَأْتِي امْرَأَتَهُ فِي دُبُرِهَا لَا يَنْظُرُ اللَّهُ إِلَيْهِ» . رَوَاهُ فِي شرح السّنة","english":{"narrator":"","text":"He reported God’s Messenger as saying, “God will not look at him who has intercourse with his wife through her anus.” \n\nIt is transmitted in Sharh as-sunna."}},{"id":113,"idInBook":113,"chapterId":13,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَنْظُرُ اللَّهُ إِلَى رَجُلٍ أَتَى رَجُلًا أَوِ امْرَأَةً فِي الدبر» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Ibn ‘Abbas reported God’s Messenger as saying, “God will not look at a man who has intercourse with a man or a woman through the anus.” \n\nTirmidhi transmitted it."}},{"id":114,"idInBook":114,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أَسْمَاءَ بِنْتِ يَزِيدَ قَالَتْ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَا تَقْتُلُوا أَوْلَادَكُمْ سِرًّا فَإِنَّ الْغَيْلَ يُدْرِكُ الْفَارِسَ فيدعثره عَن فرسه» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Asma’ daughter of Yazid said she heard God’s Messenger say, “Do not kill your children secretly, for the milk with which a child is suckled while his mother is pregnant overtakes the horseman and throws him from his horse.”* \n* It is here said that a child which is suckled while his mother is pregnant will suffer from it in later life, the tradition speaking specifically of his being thrown from his horse and killed.\n\nAbu Dawud transmitted it."}},{"id":115,"idInBook":115,"chapterId":13,"bookId":14,"arabic":"عَنْ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَن يعْزل عَن الْحرَّة إِلَّا بِإِذْنِهَا. رَوَاهُ ابْن مَاجَه","english":{"narrator":"","text":"‘Umar b. al-Khattab said God’s Messenger forbade withdrawing the penis from a free woman unless she gives permission. \n\nIbn Majah transmitted it."}},{"id":116,"idInBook":116,"chapterId":13,"bookId":14,"arabic":"عَنْ عُرْوَةَ عَنْ عَائِشَةَ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَهَا فِي بَرِيرَةَ: «خُذِيهَا فَأَعْتِقِيهَا» . وَكَانَ زَوْجُهَا عَبْدًا فَخَيَّرَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاخْتَارَتْ نَفسهَا وَلَو كَانَ حرا لم يخيرها","english":{"narrator":"","text":"'Urwa told on' A’isha’s authority that God’s Messenger said to her concerning Barira, “Take her and set her free.” Now her husband was a slave, so God’s Messenger gave her her choice and she chose to separate from him; but if he had been free he would not have given her her choice. \n\n(Bukhari and Muslim.)"}},{"id":117,"idInBook":117,"chapterId":13,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: كَانَ زَوْجُ بَرِيرَةَ عبدا أسود يُقَالُ لَهُ مُغِيثٌ كَأَنِّي أَنْظُرُ إِلَيْهِ يَطُوفُ خلفهَا فِي سِكَك الْمَدِينَة يبكي وَدُمُوعُهُ تَسِيلُ عَلَى لِحْيَتِهِ فَقَالَ النَّبِيُّ صَلَىَ اللَّهُ عَلَيْهِ وَسَلَّمَ لِلْعَبَّاسِ: «يَا عَبَّاسُ أَلَا تَعْجَبُ مِنْ حُبِّ مُغِيثٍ بَرِيرَةَ؟ وَمِنْ بُغْضٍ بَرِيرَة مغيثاً؟» فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَوْ راجعته» فَقَالَتْ: يَا رَسُولَ اللَّهِ تَأْمُرُنِي؟ قَالَ: «إِنَّمَا أَشْفَعُ» قَالَتْ: لَا حَاجَةَ لِي فِيهِ. رَوَاهُ البُخَارِيّ","english":{"narrator":"Ibn ‘Abbas said:","text":"Barira’s husband was a negro slave called Mughith whom I can still picture going round behind her in the streets of Medina weeping with the tears flowing on his beard. The Prophet said to al- ‘Abbas, “Are you not astonished, ‘Abbas, at Mughith’s love; of Barira and Barira’s hatred of Mughith?\" The Prophet expressed a wish that she would take him back, but when she asked whether he was giving her a command and he replied that he was merely interceding, she said, “I have no need of him.” \n\nBukhari transmitted it."}},{"id":118,"idInBook":118,"chapterId":13,"bookId":14,"arabic":"عَنْ عَائِشَةَ: أَنَّهَا أَرَادَتْ أَنْ تَعْتِقَ مَمْلُوكَيْنِ لَهَا زَوْجٌ فَسَأَلَتِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَهَا أَنْ تَبْدَأَ بِالرَّجُلِ قَبْلَ الْمَرْأَةِ. رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ","english":{"narrator":"","text":"‘A’isha said she wanted to set free two slaves of hers who were married, so she consulted the Prophet and he ordered her to begin with the man before the woman. \n\nAbu Dawud and Nasa’i transmitted it."}},{"id":119,"idInBook":119,"chapterId":13,"bookId":14,"arabic":"وَعَنْهَا: أَنْ بَرِيرَةَ عَتَقَتْ وَهِيَ عِنْدَ مُغِيثٍ فَخَيَّرَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ لَهَا: «إِنْ قَرِبَكِ فَلَا خِيَارَ لَكِ» . رَوَاهُ أَبُو دَاوُدَ\nوَهَذَا الْبَابُ خَالٍ عَنِ الْفَصْلِ الثَّالِثِ","english":{"narrator":"","text":"She said that Barira became free when she was with Mughith and God’s Messenger gave her her choice saying, “If he has intercourse with you, you will not be allowed to exercise choice.”\n\nAbu Dawud transmitted it."}},{"id":120,"idInBook":120,"chapterId":13,"bookId":14,"arabic":"عَنْ سَهْلِ بْنِ سَعْدٍ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَاءَتْهُ امْرَأَةٌ فَقَالَتْ: يَا رَسُولَ اللَّهِ إِنِّي وَهَبْتُ نَفْسِي لَكَ فَقَامَتْ طَوِيلًا فَقَامَ رَجُلٌ فَقَالَ: يَا رَسُولَ اللَّهِ زَوِّجْنِيهَا إِنْ لَمْ تَكُنْ لَكَ فِيهَا حَاجَةٌ فَقَالَ: «هَلْ عِنْدَكَ مِنْ شَيْءٍ تُصْدِقُهَا؟» قَالَ: مَا عِنْدِي إِلَّا إِزَارِي هَذَا. قَالَ: «فَالْتَمِسْ وَلَوْ خَاتَمًا مِنْ حَدِيدٍ» فَالْتَمَسَ فَلَمْ يَجِدْ شَيْئًا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «هَلْ مَعَكَ مِنَ الْقُرْآنِ شَيْءٌ» قَالَ: نَعَمْ سُورَةُ كَذَا وَسُورَةُ كَذَا فَقَالَ: «زَوَّجْتُكَهَا بِمَا مَعَكَ مِنَ الْقُرْآنِ» . وَفِي رِوَايَةٍ: قَالَ: «انْطَلِقْ فَقَدْ زَوَّجْتُكَهَا فَعَلِّمْهَا مِنَ الْقُرْآنِ»","english":{"narrator":"","text":"Sahl b. Sa'd told of a woman who came to God’s Messenger and offered herself to him. When she had stood for a long time (i.e. without receiving an answer) a man got up and said, “Messenger of God, marry her to me if you have no need of her.” He asked him if he had anything to give her as dower, and when he replied that he had nothing but the lower garment he was wearing, he said, “Look for something, even though it should be an iron ring.” Then when the man had sought and found nothing God’s Messenger asked whether he knew any of the Qur'an, and when he replied that he knew surah so and so and surah so and so, he said, “I have given you her in marriage for the part of the Qur’an which you know.” In a version he said, “Go away, for I have given you her in marriage; and teach her some of the Qur'an.\" \n\n(Bukhari and Muslim.)"}},{"id":121,"idInBook":121,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أَبِي سَلَمَةَ قَالَ: سَأَلْتُ عَائِشَةَ: كَمْ كَانَ صَدَاقُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَت: كَانَ صداقه لأزواجه اثْنَتَيْ عَشْرَةَ أُوقِيَّةً وَنَشٌّ قَالَتْ: أَتَدْرِي مَا النَّشٌّ؟ قُلْتُ: لَا قَالَتْ: نِصْفُ أُوقِيَّةٍ فَتِلْكَ خَمْسُمِائَةِ دِرْهَمٍ. رَوَاهُ مُسْلِمٌ. وَنَشٌّ بِالرَّفْعِ فِي شَرْحِ السّنة وَفِي جَمِيع الْأُصُول","english":{"narrator":"","text":"Abu Salama said he asked ‘A’isha how much the Prophet had given as dower, and she replied that his dower to his wives was twelve uqiyas* and a nashsh. She asked whether he knew what a nashsh was, and when he replied that he did not, she said it was half an uqiya; so the total was five hundred dirhams. \n* The uqiya was 40 dirhams.\n\nMuslim transmitted it. Nashsh is in the nominative in Sharh as-sunna and all the sources."}},{"id":122,"idInBook":122,"chapterId":13,"bookId":14,"arabic":"عَنْ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ قَالَ: أَلَا لَا تُغَالُوا صَدُقَةَ النِّسَاءِ فَإِنَّهَا لَوْ كَانَتْ مَكْرُمَةً فِي الدُّنْيَا وَتَقْوَى عِنْدَ اللَّهِ لَكَانَ أَوْلَاكُمْ بِهَا نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا عَلِمْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَكَحَ شَيْئًا مِنْ نِسَائِهِ وَلَا أَنْكَحَ شَيْئًا مِنْ بَنَاتِهِ عَلَى أَكْثَرَ مِنَ اثْنَتَيْ عَشْرَةَ أُوقِيَّةً. رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالنَّسَائِيُّ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ","english":{"narrator":"'Umar b. al-Khattab said:","text":"Do not go to extremes in giving women their dower, for if it represented honour in this world and piety in Gods sight, the one of you most entitled to do so would have been God's Prophet. I am not aware of God’s Messenger marrying any of his wives or giving any of his daughters in marriage for more than twelve uqiyas. \n\nAhmad, Tirmidhi, Abu Dawud, Nasa’i, Ibn Majah and Darimi transmitted it."}},{"id":123,"idInBook":123,"chapterId":13,"bookId":14,"arabic":"وَعَنْ جَابِرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ أَعْطَى فِي صَدَاقِ امْرَأَتِهِ مِلْءَ كَفَّيْهِ سَوِيقًا أَوْ تَمْرًا فَقَدِ اسْتحلَّ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Jabir reported God’s Messenger as saying, \"If anyone gives as a dower to his wife two handfuls of flour or dates he has made her lawful for him.” \n\nAbu Dawud transmitted it."}},{"id":124,"idInBook":124,"chapterId":13,"bookId":14,"arabic":"وَعَنْ عَامِرِ بْنِ رَبِيعَةَ: أَنَّ امْرَأَةً مَنْ بَنِي فَزَارَةَ تَزَوَّجَتْ عَلَى نَعْلَيْنِ فَقَالَ لَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَرَضِيتِ مِنْ نَفْسِكِ وَمَالِكِ بِنَعْلَيْنِ؟» قَالَتْ: نَعَمْ. فَأَجَازَهُ. رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"‘Amir b. Rabi'a said that a woman of the B. Fazara was married for a dower of two sandals. When God’s Messenger asked whether she was satisfied with two sandals regarding her person and her property and she replied that she was, he gave his approval. \n\nTirmidhi transmitted it."}},{"id":125,"idInBook":125,"chapterId":13,"bookId":14,"arabic":"وَعَنْ عَلْقَمَةَ عَنِ ابْنِ مَسْعُودٍ: أَنَّهُ سُئِلَ عَنْ رَجُلٍ تَزَوَّجَ امْرَأَةً وَلَمْ يَفْرِضْ لَهَا شَيْئا وَلم يدْخل بهَا حَتَّى مَاتَ فَقَالَ ابْنُ مَسْعُودٍ: لَهَا مِثْلُ صَدَاقِ نِسَائِهَا. لَا وَكْسَ وَلَا شَطَطَ وَعَلَيْهَا الْعِدَّةُ وَلَهَا الْمِيرَاثُ فَقَامَ مَعْقِلُ بْنُ سِنَانٍ الْأَشْجَعِيُّ فَقَالَ: قَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي بِرْوَعَ بِنْتِ وَاشَقٍ امْرَأَةٍ مِنَّا بِمِثْلِ مَا قَضَيْتَ. فَفَرِحَ بِهَا ابْنُ مَسْعُودٍ. رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُد وَالنَّسَائِيّ والدارمي","english":{"narrator":"","text":"‘Alqama quoted Ibn Mas'ud as saying he was asked about a man who had married a woman without fixing any settlement on her or cohabiting with her till he died. Ibn Mas'ud said she should receive the type of dower given to women of her class with so diminution or excess, observe the ‘idda period and have her share of the inheritance. Ma'qil b. Sinan al-Ashja‘i then got up and said, \"God’s Messenger gave a decision regarding Birwa’ daughter of Washiq, a woman of our tribe, to the same effect as the decision you have given; and Ibn Mas'ud was pleased about the decision. \n\nTirmidhi, Abu Dawud, Nasa'i and Darimi transmitted it."}},{"id":126,"idInBook":126,"chapterId":13,"bookId":14,"arabic":"عَنْ أُمِّ حَبِيبَةَ: أَنَّهَا كَانَتْ تَحْتَ عَبْدِ اللَّهِ بْنِ جَحْشٍ فَمَاتَ بِأَرْضِ الْحَبَشَةِ فَزَوَّجَهَا النَّجَاشِيُّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَمْهَرَهَا عَنهُ أَرْبَعَة آلَاف. وَفِي رِوَايَة: أَرْبَعَة دِرْهَمٍ وَبَعَثَ بِهَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَعَ شُرَحْبِيل بن حَسَنَة. رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ","english":{"narrator":"","text":"Umm Habiba said she was married to ‘Abdallah b. Jahsh who died in Abyssinia, so the Negus married her to the Prophet, giving her on his behalf a dower of four thousand. (A version has four thousand dirhams.) He sent her to God’s Messenger with Shurahbil b. Hasana. \n\nAbu Dawud and Nasa’i transmitted it."}},{"id":127,"idInBook":127,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: تَزَوَّجَ أَبُو طَلْحَةَ أُمَّ سُلَيْمٍ فَكَانَ صَدَاقُ مَا بَيْنَهُمَا الْإِسْلَامَ أَسْلَمَتْ أُمُّ سُلَيْمٍ قَبْلَ أَبِي طَلْحَةَ فَخَطَبَهَا فَقَالَتْ: إِنِّي قَدْ أَسْلَمْتُ فَإِنْ أَسْلَمْتَ نَكَحْتُكَ فَأَسْلَمَ فَكَانَ صدَاق مَا بَينهمَا. رَوَاهُ النَّسَائِيّ","english":{"narrator":"","text":"Anas said that Abu Talha married Umm Sulaim, the dower between them being acceptance of Islam. Umm Sulaim had become a Muslim before Abu Talha, and when he asked her in marriage she said, \"I have become a Muslim, so if you become one I shall marry you.” He then accepted Islam and that was the dower arranged between them. \n\nNasa’i transmitted it."}},{"id":128,"idInBook":128,"chapterId":13,"bookId":14,"arabic":"عَنْ أَنَسٍ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى عَلَى عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ أَثَرَ صُفْرَةٍ فَقَالَ: «مَا هَذَا؟» قَالَ: إِنِّي تَزَوَّجْتُ امْرَأَةً عَلَى وَزْنِ نَوَاةٍ مِنْ ذَهَبٍ قَالَ: «بَارَكَ اللَّهُ لَكَ أَوْلِمْ وَلَوْ بِشَاةٍ»","english":{"narrator":"","text":"Anas said the Prophet saw the trace of yellow on ‘Abd ar-Rahman b. ‘Auf and asked what that was. He replied, “I have married a woman for a nawat* weight of gold.” He said, “God bless you! Hold a wedding- feast, even if only with a sheep.” \n*a weight of five dirhams.\n\n(Bukhari and Muslim.)"}},{"id":129,"idInBook":129,"chapterId":13,"bookId":14,"arabic":"وَعَنْهُ قَالَ: مَا أَوْلَمَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى أَحَدٍ مِنْ نِسَائِهِ مَا أولم على زَيْنَب أولم بِشَاة","english":{"narrator":"","text":"He said that God's Messenger did not hold such a wedding-feast for any of his wives as he did for Zainab. He held a wedding-feast with a sheep. \n\n(Bukhari and Muslim.)"}},{"id":130,"idInBook":130,"chapterId":13,"bookId":14,"arabic":"وَعَنْهُ قَالَ: أَوْلَمَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ بَنَى بِزَيْنَبَ بِنْتِ جَحْشٍ فأشبع النَّاس خبْزًا وَلَحْمًا. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"He said that God’s Messenger held a wedding-feast when he took up cohabitation with Zainab daughter of Jahsh and gave the people their fill of bread and meat. \n\nBukhari transmitted it."}},{"id":131,"idInBook":131,"chapterId":13,"bookId":14,"arabic":"وَعَنْهُ قَالَ: إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ أَعْتَقَ صَفِيَّةَ وَتَزَوَّجَهَا وَجَعَلَ عِتْقَهَا صَدَاقَهَا وَأَوْلَمَ عَلَيْهَا بحيس. مُتَّفق عَلَيْهِ","english":{"narrator":"","text":"He said that God’s Messenger set Safiya free and married her, making her freedom her dower, and he held a wedding-feast for her with hais (A dish made of dates mixed with clarified butter and dried curd, kneaded and rubbed together. Sometimes flour was added.)\n\n(Bukhari and Muslim.)"}},{"id":132,"idInBook":132,"chapterId":13,"bookId":14,"arabic":"وَعَنْهُ قَالَ: أَقَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ خَيْبَرَ وَالْمَدِينَةِ ثَلَاثَ لَيَالٍ يُبْنَى عَلَيْهِ بِصَفِيَّةَ فَدَعَوْتُ الْمُسْلِمِينَ إِلَى وَلِيمَتِهِ وَمَا كَانَ فِيهَا مِنْ خُبْزٍ وَلَا لَحْمٍ وَمَا كَانَ فِيهَا إِلَّا أَن أمربالأنطاع فَبُسِطَتْ فَأَلْقَى عَلَيْهَا التَّمْرَ وَالْأَقِطَ وَالسَّمْنَ. رَوَاهُ البُخَارِيّ","english":{"narrator":"He said:","text":"The Prophet stayed three nights between Khaibar and Medina when he took up cohabitation with Safiya, and I called the Muslims to his wedding-feast which included no bread or meat. He just ordered some cloths to be spread, and dates, dried curd and clarified butter were thrown on them. \n\nBukhari transmitted it."}},{"id":133,"idInBook":133,"chapterId":13,"bookId":14,"arabic":"وَعَنْ صَفِيَّةَ بِنْتِ شَيْبَةَ قَالَتْ: أَوْلَمَ النَّبِيُّ صلى الله عَلَيْهِ وَسلم على النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى بَعْضِ نِسَائِهِ بمدين من شعير. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Safiya daughter of Shaiba said the Prophet held a wedding-feast for one of his wives with two muds of barley. \n\nBukhari transmitted it."}},{"id":134,"idInBook":134,"chapterId":13,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا دُعِيَ أَحَدُكُمْ إِلَى الْوَلِيمَةِ فَلْيَأْتِهَا» . مُتَّفَقٌ عَلَيْهِ. وَفِي رِوَايَةٍ لِمُسْلِمٍ: فَلْيُجِبْ عُرْسًا كَانَ أَو نَحوه","english":{"narrator":"","text":"‘Abdallah b. ‘Umar reported God’s Messenger as saying, “When one of you is invited to a wedding-feast he must attend it.” In a version by Muslim he said, “He must accept, whether it is a wedding-feast or something of that nature.”\n\n(Bukhari and Muslim.)"}},{"id":135,"idInBook":135,"chapterId":13,"bookId":14,"arabic":"وَعَنْ جَابِرٍ: قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا دُعِيَ أَحَدُكُمْ إِلَى طَعَام فليجب وَإِن شَاءَ طَعِمَ وَإِنْ شَاءَ تَرَكَ» . رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"Jabir reported God’s Messenger as saying, “When one of you is invited to a meal he must accept. If he wishes he may eat, but if he wishes he may leave the food alone.” \n\nMuslim transmitted it."}},{"id":136,"idInBook":136,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «شَرُّ الطَّعَامِ طَعَامُ الْوَلِيمَةِ يُدْعَى لَهَا الْأَغْنِيَاءُ وَيُتْرَكُ الْفُقَرَاءُ وَمَنْ تَرَكَ الدَّعْوَةَ فَقَدْ عَصَى الله وَرَسُوله»","english":{"narrator":"","text":"Abu Huraira reported God’s Messenger as saying, “The worst kind of food is that at a wedding-feast to which the rich are invited and from which the poor are left out. If anyone rejects an invitation he has disobeyed God and His Messenger.” \n\n(Bukhari and Muslim.)"}},{"id":137,"idInBook":137,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أَبِي مَسْعُودٍ الْأَنْصَارِيِّ قَالَ: كَانَ رَجُلٌ مِنَ الْأَنْصَارِ يُكْنَى أَبَا شُعَيْبٍ كَانَ لَهُ غُلَامٌ لَحَّامٌ فَقَالَ: اصْنَعْ لِي طَعَامًا يَكْفِي خَمْسَةً لَعَلِّي أَدْعُو النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَامِسَ خَمْسَةٍ فَصَنَعَ لَهُ طعيما ثمَّ أتها فَدَعَاهُ فَتَبِعَهُمْ رَجُلٌ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَا أَبَا شُعَيْبٍ إِنَّ رَجُلًا تَبِعَنَا فَإِنْ شِئْتَ أَذِنْتَ لَهُ وَإِنْ شِئْتَ تركته» . قَالَ: لَا بل أَذِنت لَهُ","english":{"narrator":"Abu Mas'ud al-Ansari said:","text":"One of the Ansar whose kunya was Abu Shu'aib had a servant who sold meat. He said, “Prepare for me food which will be enough for five; perhaps I shall invite the Prophet along with other four.” He prepared a small meal for him, and then he went and invited him. A man followed them, and the Prophet said, “A man has followed us, Abu Shu'aib, so if you wish you may let him join us, but if you wish you may leave him outside.” He replied, “No, I shall let him join us.” \n\n(Bukhari and Muslim.)"}},{"id":138,"idInBook":138,"chapterId":13,"bookId":14,"arabic":"عَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أولم على صَفِيَّة بسويق وتمر. رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ","english":{"narrator":"","text":"Anas said the Prophet held a wedding-feast for Safiya with meal and dates. \n\nAhmad, Tirmidhi, Abu Dawud and Ibn Majah transmitted it."}},{"id":139,"idInBook":139,"chapterId":13,"bookId":14,"arabic":"وَعَنْ سَفِينَةَ: أَنَّ رَجُلًا ضَافَ عَلِيَّ بْنَ أَبِي طَالِبٍ فَصَنَعَ لَهُ طَعَامًا فَقَالَتْ فَاطِمَةُ: لَوْ دَعَوْنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَكَلَ مَعَنَا فَدَعَوْهُ فَجَاءَ فَوَضَعَ يَدَيْهِ عَلَى عِضَادَتَيِ الْبَابِ فَرَأَى الْقِرَامَ قَدْ ضُرِبَ فِي نَاحِيَةِ الْبَيْتِ فَرَجَعَ. قَالَتْ فَاطِمَةُ: فَتَبِعْتُهُ فَقُلْتُ: يَا رَسُولَ اللَّهِ مَا رَدَّكَ؟ قَالَ: «إِنَّهُ لَيْسَ لِي أَوْ لِنَبِيٍّ أَنْ يَدْخُلَ بَيْتا مزوقا» . رَوَاهُ أَحْمد وَابْن مَاجَه","english":{"narrator":"","text":"Safina told that 'Ali b. Abu Talib prepared food for a man who was his guest, and Fatima said, \"I wish we had invited God’s Messenger and he had eaten with us.” They invited him and when he came he put his hands on the side-posts of the door, but when he saw the figured curtain which had been put at the end of the house he went away. Fatima said she followed him and asked, “What turned you back, Messenger of God?” He replied, “It is not fitting for me or for any prophet to enter a house which is decorated.” \n\nAhmad and Ibn Majah transmitted it."}},{"id":140,"idInBook":140,"chapterId":13,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ دُعِيَ فَلَمْ يُجِبْ فَقَدْ عَصَى اللَّهَ وَرَسُولَهُ وَمن دخل على غَيْرِ دَعْوَةٍ دَخَلَ سَارِقًا وَخَرَجَ مُغِيرًا» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"‘Abdallah b. 'Umar reported God’s Messenger as saying, “He who does not accept an invitation which he receives has disobeyed God and His Messenger, and he who enters without an invitation enters as a thief and goes out as a raider.” \n\nAbu Dawud transmitted it."}},{"id":141,"idInBook":141,"chapterId":13,"bookId":14,"arabic":"وَعَنْ رَجُلٍ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا اجْتَمَعَ الدَّاعِيَانِ فَأَجِبْ أَقْرَبَهُمَا بَابًا وَإِنْ سَبَقَ أَحَدُهُمَا فَأَجِبِ الَّذِي سَبَقَ» . رَوَاهُ أَحْمَدُ وَأَبُو دَاوُدَ","english":{"narrator":"","text":"A companion of God’s Messenger reported him as saying, “When two people come together to issue an invitation accept that of the one who lives nearer you, but if one of them comes before the other accept the invitation of the one who comes first.” \n\nAhmad and Abu Dawud transmitted it."}},{"id":142,"idInBook":142,"chapterId":13,"bookId":14,"arabic":"قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «طَعَامُ أَوَّلِ يَوْمٍ حق وَطَعَام يَوْم الثَّانِي سنة وَطَعَام يَوْم الثَّالِثِ سُمْعَةٌ وَمَنْ سَمَّعَ سَمَّعَ اللَّهُ بِهِ» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Ibn Mas'ud reported God’s Messenger as saying, “The food on the first day is a duty, that on the second is a sunna, but that on the third day is to make men hear of it; and if anyone makes men hear of what he does God will make him heard of” (i.e. will publish his hypocrisy on the day of resurrection). \n\nTirmidhi transmitted it."}},{"id":143,"idInBook":143,"chapterId":13,"bookId":14,"arabic":"وَعَنْ عِكْرِمَةَ عَنِ ابْنِ عَبَّاسٍ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ طَعَامِ الْمُتَبَارِيَيْنِ أَنْ يُؤْكَلَ. رَوَاهُ أَبُو دَاوُدَ وَقَالَ مُحْيِي السُّنَّةِ: وَالصَّحِيحُ أَنَّهُ عَنْ عِكْرِمَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُرْسَلًا","english":{"narrator":"","text":"‘Ikrima, on the authority of Ibn ‘Abbas, said the Prophet forbade that the food of two people who were rivalling one another should be eaten. \n\nAbu Dawud transmitted it. Muhyi as-Sunna said the sound version is that it comes from ‘Ikrima from the Prophet in mursal form."}},{"id":144,"idInBook":144,"chapterId":13,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْمُتَبَارِيَانِ لَا يُجَابَانِ وَلَا يُؤْكَلُ طَعَامُهُمَا» . قَالَ الْإِمَامُ أَحْمَدُ: يَعْنِي المتعارضين بالضيافة فخراً ورياء","english":{"narrator":"","text":"Abu Huraira reported God's Messenger as saying, “The invitations of two people who are rivalling one another should not be accepted, and the food they provide should not be eaten.” The imam Ahmad said it means two people who are competing with one another in providing a feast out of self-glory and ostentation.\n\nBaihaqi transmitted in Shu'ab al-iman"}},{"id":145,"idInBook":145,"chapterId":13,"bookId":14,"arabic":"وَعَن عمرَان ين حُصَيْنٍ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِجَابَة طَعَام الْفَاسِقين","english":{"narrator":"","text":"‘Imran b. Husain said God’s Messenger forbade accepting invitations to food provided by profligates.\n\nBaihaqi transmitted in Shu'ab al-iman"}},{"id":146,"idInBook":146,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا دَخَلَ أَحَدُكُمْ عَلَى أَخِيهِ الْمُسْلِمِ فَلْيَأْكُلْ مِنْ طَعَامِهِ وَلَا يَسْأَلْ وَيَشْرَبْ مِنْ شَرَابِهِ وَلَا يَسْأَلْ»\nرَوَى الْأَحَادِيثَ الثَّلَاثَة الْبَيْهَقِيّ فِي «شُعَبِ الْإِيمَانِ» وَقَالَ: هَذَا إِنْ صَحَّ فَلِأَنَّ الظَّاهِرَ أَنَّ الْمُسْلِمَ لَا يُطْعِمُهُ وَلَا يسْقِيه إِلَّا مَا هُوَ حَلَال عِنْده","english":{"narrator":"","text":"Abu Huraira reported the Prophet as saying, “When one of you visits his brother Muslim he should eat of his food without asking questions and drink from what he provides without asking questions.” \n\nBaihaqi transmitted the three traditions in Shu'ab al-iman, saying that if  is sound, it is because a Muslim would obviously give him only food and drink which were lawful in his opinion."}},{"id":147,"idInBook":147,"chapterId":13,"bookId":14,"arabic":"عَنِ ابْنِ عَبَّاسٍ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قُبِضَ عَنْ تِسْعِ نِسْوَةٍ وَكَانَ يقسم مِنْهُنَّ لثمان","english":{"narrator":"","text":"Ibn ‘Abbas said that when God’s Messenger died he left\tnine wives, eight of whom he used to visit equally.\t (The next tradition explains this)\n\n(Bukhari and Muslim.)"}},{"id":148,"idInBook":148,"chapterId":13,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ أَنَّ سَوْدَةَ لَمَّا كَبِرَتْ قَالَتْ: يَا رَسُولَ اللَّهِ قَدْ جَعَلْتُ يَوْمِي مِنْكَ لِعَائِشَةَ فَكَانَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُقَسَّمُ لِعَائِشَةَ يَوْمَيْنِ يَوْمَهَا وَيَوْم سَوْدَة","english":{"narrator":"","text":"‘A’isha told that when Sauda became old she said, “Messenger of God, I appoint to ‘A'isha the day you visit me” (Cf. the last tradition in this chapter).  So God’s Messenger allotted two days to ‘A’isha, hers and Sauda’s. \n\n(Bukhari and Muslim.)"}},{"id":149,"idInBook":149,"chapterId":13,"bookId":14,"arabic":"وَعَنْهَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَسْأَلُ فِي مَرَضِهِ الَّذِي مَاتَ فِيهِ: «أَيْنَ أَنَا غَدًا؟» يُرِيدُ يَوْمَ عَائِشَةَ فَأَذِنَ لَهُ أَزْوَاجُهُ يَكُونُ حَيْثُ شَاءَ فَكَانَ فِي بَيْتِ عَائِشَةَ حَتَّى مَاتَ عِنْدَهَا. رَوَاهُ الْبُخَارِيُّ","english":{"narrator":"","text":"She said that during the illness of which God’s Messenger died he was asking, “Where do I go tomorrow? Where do I go tomorrow?” That was on ‘A’isha’s day. His wives therefore permitted him to go where he wished, and he stayed in ‘A’isha’s house till he died there. \n\nBukhari transmitted it."}},{"id":150,"idInBook":150,"chapterId":13,"bookId":14,"arabic":"وَعَنْهَا قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَرَادَ سَفَرًا أَقْرَعَ بَيْنَ نِسَائِهِ فأيهن خَرَجَ سَهْمُهَا خَرَجَ بِهَا مَعَهُ","english":{"narrator":"","text":"She said that when God’s Messenger intended to go on a journey he cast lots among his wives and the one who was chosen by lot went on it with him.\t\n\n(Bukhari and Muslim.)"}},{"id":151,"idInBook":151,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أَبِي قِلَابَةَ عَنْ أَنَسٍ قَالَ: مِنَ السُّنَّةِ إِذَا تَزَوَّجَ الرَّجُلُ الْبِكْرَ عَلَى الثَّيِّبِ أَقَامَ عِنْدهَا سبعا وَقسم إِذا تَزَوَّجَ الثَّيِّبَ أَقَامَ عِنْدَهَا ثَلَاثًا ثُمَّ قَسَمَ. قَالَ أَبُو قلَابَة: وَلَو شِئْت لَقلت: إِن أَنَسًا رَفْعَهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ","english":{"narrator":"Abu Qilaba quoted Anas as saying:","text":"It pertains to\tthe sunna that when a man who has a wife marries a virgin he should stay with her for seven nights and then divide the time between them, but if he marries a woman who has been previously married he should stay with her three nights and then divide his time between his wives. Abu (Qilaba remarked that if he wished he could say that Anas traced it to the Prophet.\n\n(Bukhari and Muslim.)"}},{"id":152,"idInBook":152,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِين تَزَوَّجَ أُمَّ سَلَمَةَ وَأَصْبَحَتْ عِنْدَهُ قَالَ لَهَا: «لَيْسَ بِكِ عَلَى أَهْلِكِ هَوَانٌ إِنْ شِئْتِ سَبَّعْتُ عِنْدَكِ وَسَبَّعْتُ عِنْدَهُنَّ وَإِنْ شِئْتِ ثَلَّثْتُ عِنْدَكِ وَدُرْتُ» . قَالَتْ: ثَلِّثْ. وَفِي رِوَايَةٍ: إِنَّهُ قَالَ لَهَا: «لِلْبِكْرِ سَبْعٌ وَلِلثَّيِّبِ ثَلَاثٌ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Bakr b. ‘Abd ar-Rahman told that when God’s Messenger married Umm Salama he said to her in the morning, “You are not being humbled in my estimation. If you wish I shall stay with you seven nights as I did with my other wives, but if you wish I shall stay three and then visit my wives in turn.” She replied, “Stay three nights.” In a version he said, “The virgin gets seven nights and the woman who has had a previous husband three.” \n\nMuslim transmitted it."}},{"id":153,"idInBook":153,"chapterId":13,"bookId":14,"arabic":"عَنْ عَائِشَةَ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْسِمُ بَيْنَ نِسَائِهِ فَيَعْدِلُ وَيَقُولُ: «اللَّهُمَّ هَذَا قَسْمِي فِيمَا أَمْلِكُ فَلَا تَلُمْنِي فِيمَا تَمْلِكُ وَلَا أَمْلِكُ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالنَّسَائِيُّ وَابْنُ مَاجَهْ والدارمي","english":{"narrator":"","text":"‘A’isha told that the Prophet used to divide his time among his wives equally and say, “O God, this is my division concerning what I possess, so do not blame me concerning what Thou possessest and I do not.”\n\nTirmidhi, Abu Dawud, Nasa’i, Ibn Majah and Darimi transmitted it."}},{"id":154,"idInBook":154,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا كَانَتْ عِنْدَ الرَّجُلِ امْرَأَتَانِ فَلَمْ يَعْدِلْ بَيْنَهُمَا جَاءَ يَوْمَ الْقِيَامَةِ وَشِقُّهُ سَاقِطٌ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالنَّسَائِيُّ وَابْنُ مَاجَهْ والدارمي","english":{"narrator":"","text":"Abu Huraira reported the Prophet as saying, “When a man has two wives and does not treat them equally he will come on the day of resurrection with a side hanging down.” \n\nTirmidhi, Abu Dawud, Nasa’i, Ibn Majah and Darimi transmitted it."}},{"id":155,"idInBook":155,"chapterId":13,"bookId":14,"arabic":"عَنْ عَطَاءٍ قَالَ: حَضَرْنَا مَعَ ابْنِ عَبَّاسٍ جَنَازَةَ مَيْمُونَةَ بِسَرِفَ فَقَالَ: هَذِهِ زَوْجَةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَإِذَا رَفَعْتُمْ نَعْشَهَا فَلَا تُزَعْزِعُوهَا وَلَا تُزَلْزِلُوهَا وَارْفُقُوا بِهَا فَإِنَّهُ كَانَ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تِسْعُ نِسْوَةٍ كَانَ يَقْسِمُ مِنْهُنَّ لِثَمَانٍ وَلَا يَقْسِمُ لِوَاحِدَةٍ قَالَ عَطَاءٌ: الَّتِي كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَقْسِمُ لَهَا بَلَغَنَا أَنَّهَا صَفِيَّةُ وَكَانَتْ آخِرهنَّ موتا مَاتَت بِالْمَدِينَةِ\nوَقَالَ رَزِينٌ: قَالَ غَيْرُ عَطَاءٍ: هِيَ سَوْدَةُ وَهُوَ أصح وهبت يَوْمهَا لِعَائِشَةَ حِينَ أَرَادَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طَلَاقَهَا فَقَالَتْ لَهُ: أَمْسِكْنِي قَدْ وهبت يومي لعَائِشَة لعَلي أكون من نِسَائِك فِي الْجنَّة","english":{"narrator":"","text":"‘Ata’ told that when they were with Ibn ‘Abbas at Maimuna’s funeral in Sarif he said, “This is God’s Messenger’s wife, so when you lift her bier do not shake her or disturb her, but be gentle with her, for God’s Messenger had nine wives with eight of whom he shared his time, but to one of them he did not allot a share.” ‘Ata’ said they heard that the one to whom God’s Messenger did not allot a share was Safiya who was the last of them to die. She died in Medina. Razin said that someone other than ‘Ata’ declared she was Sauda, and that is sounder. She gave her day to ‘A’isha when God's Messenger intended to divorce her, saying to him, “Keep me. I have given my day to ‘A’isha. Perhaps I may be one of your wives in paradise.”\n\n(Bukhari and Muslim.)"}},{"id":156,"idInBook":156,"chapterId":13,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «اسْتَوْصُوا بِالنِّسَاءِ خَيْرًا فَإِنَّهُنَّ خُلِقْنَ مِنْ ضِلَعٍ وَإِنَّ أَعْوَجَ شَيْءٍ فِي الضِّلَعِ أَعْلَاهُ فَإِنْ ذَهَبْتَ تُقِيمُهُ كَسْرَتَهُ وَإِنْ تَرَكْتَهُ لَمْ يَزَلْ أَعْوَجَ فَاسْتَوْصُوا بِالنِّسَاءِ»","english":{"narrator":"","text":"Abu Huraira reported God's Messenger as saying, “Act kindly toward women, for they were created from a rib and the most crooked part of a rib is its top. If you attempt to straighten it you will break it, and if you leave it alone it will remain crooked; so act kindly towards women.” \n\n(Bukhari and Muslim.)"}},{"id":157,"idInBook":157,"chapterId":13,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ الْمَرْأَةَ خُلِقَتْ مِنْ ضِلَعٍ لَنْ تَسْتَقِيمَ لَكَ عَلَى طَرِيقَةٍ فَإِنِ اسْتَمْتَعْتَ بِهَا اسْتَمْتَعْتَ بِهَا وَبِهَا عِوَجٌ وَإِنْ ذَهَبْتَ تقيمها كسرتها وَكسرهَا طَلاقهَا» . رَوَاهُ مُسلم","english":{"narrator":"","text":"He reported God’s Messenger as saying, “Woman has been created from a rib and will in no way be straight for you; so if you enjoy her you will do so while crookedness remains in her; but if you attempt to straighten her you will break her, breaking her being divorcing her.” \n\nMuslim transmitted it."}},{"id":158,"idInBook":158,"chapterId":13,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَفْرَكْ مُؤْمِنٌ مُؤْمِنَةً إِنْ كَرِهَ مِنْهَا خُلُقًا رَضِيَ مِنْهَا آخَرَ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"He reported God’s Messenger as saying, “A believer must not hate a believing woman; if he dislikes one of her characteristics he will be pleased with another.” \n\nMuslim transmitted it."}},{"id":159,"idInBook":159,"chapterId":13,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَوْلَا بَنُو إِسْرَائِيلَ لَمْ يَخْنَزِ اللَّحْمُ وَلَوْلَا حَوَّاءُ لَمْ تَخُنْ أُنْثَى زَوجهَا الدَّهْر»","english":{"narrator":"","text":"He reported God’s Messenger as saying, “Had it not been for the B. Isra’il meat would not have gone bad, and had it not been for Eve a woman would never have acted unfaithfully towards her husband.’’ \n\n(Bukhari and Muslim.)"}},{"id":160,"idInBook":160,"chapterId":13,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ زَمَعَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَجْلِدْ أَحَدُكُمُ امْرَأَتَهُ جَلْدَ الْعَبْدِ ثُمَّ يُجَامِعْهَا فِي آخِرِ الْيَوْمِ» وَفِي رِوَايَةٍ: «يَعْمِدُ أَحَدُكُمْ فَيَجْلِدُ امْرَأَتَهُ جَلْدَ الْعَبْدِ فَلَعَلَّهُ يُضَاجِعُهَا فِي آخِرِ يَوْمِهِ» . ثُمَّ وَعَظَهُمْ فِي ضَحِكِهِمْ مِنَ الضَّرْطَةِ فَقَالَ: «لِمَ يَضْحَكُ أَحَدُكُمْ مِمَّا يفعل؟»","english":{"narrator":"","text":"‘Abdallah b. Zam'a reported God’s Messenger as saying, “None of you must whip his wife as a slave is whipped and then have intercourse with her at the end of the day.” A version has, “One of you has recourse to whipping his wife as a slave is whipped and perhaps he lies with her at the end of the day.” He then gave them an exhortation about laughing when someone breaks wind, saying, “Why does one of you laugh at what he does himself?” \n\n(Bukhari and Muslim.)"}},{"id":161,"idInBook":161,"chapterId":13,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ قَالَتْ: كُنْتُ أَلْعَبُ بِالْبَنَاتِ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَانَ لِي صَوَاحِبُ يَلْعَبْنَ مَعِي فَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا دَخَلَ ينقمعن فيسربهن إِلَيّ فيلعبن معي","english":{"narrator":"‘A’isha said:","text":"I was playing with dolls in the Prophet’s house and I had companions who played with me; but when God’s Messenger entered they would withdraw from him. He would then send them to me and they would play with me. \n\n(Bukhari and Muslim.)"}},{"id":162,"idInBook":162,"chapterId":13,"bookId":14,"arabic":"وَعَنْهَا قَالَتْ: وَاللَّهِ لَقَدْ رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُومُ عَلَى بَابِ حُجْرَتِي وَالْحَبَشَةُ يَلْعَبُونَ بِالْحِرَابِ فِي الْمَسْجِدَ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْتُرُنِي بردائه لِأَنْظُرَ إِلَى لَعِبِهِمْ بَيْنَ أُذُنِهِ وَعَاتِقِهِ ثُمَّ يَقُومُ مِنْ أَجْلِي حَتَّى أَكُونَ أَنَا الَّتِي أَنْصَرِفُ فَاقْدُرُوا قَدْرَ الْجَارِيَةِ الْحَدِيثَةِ السِّنِّ الْحَرِيصَةِ على اللَّهْو","english":{"narrator":"She said:","text":"I swear by God that I have seen the Prophet standing at the door of my room when the Abyssinians were playing with spears in the mosque and God’s Messenger was covering me with his cloak in order that I might look over his shoulder* at their sport. He would then stand for my sake till I was the one who departed; so estimate the time a young girl eager for amusement would wait.”\n* Literally “between his ear and his shoulder.”\n\n(Bukhari and Muslim.)"}},{"id":163,"idInBook":163,"chapterId":13,"bookId":14,"arabic":"وَعَنْهَا قَالَتْ: قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنِّي لأعْلم إِذا كنت عني راضية وَإِذا كنت عني غَضْبَى» فَقُلْتُ: مِنْ أَيْنَ تَعْرِفُ ذَلِكَ؟ فَقَالَ: \n\" إِذَا كُنْتِ عَنِّي رَاضِيَةً فَإِنَّكَ تَقُولِينَ: لَا وَرَبِّ مُحَمَّدٍ وَإِذَا كُنْتِ عَلَيَّ غَضْبَى قُلْتِ: لَا وَرَبِّ إِبْرَاهِيمَ \". قَالَتْ: قُلْتُ: أَجَلْ وَاللَّهِ يَا رَسُولَ اللَّهِ مَا أَهْجُرُ إِلَّا اسْمَكَ","english":{"narrator":"","text":"She told that God’s Messenger said to her, “I know when you are pleased with me and when you are angry with me.” She asked how he knew that and he replied that when she was pleased with him she said, ‘'No, by Muhammad’s Lord,” but when she was angry with him she said, “No, by Abraham's Lord.” She then said, “I swear by God, Messenger of God, that that is so; it is only your name that I omit.” \n\n(Bukhari and Muslim.)"}},{"id":164,"idInBook":164,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا دَعَا الرَّجُلُ امْرَأَتَهُ إِلَى فِرَاشِهِ فَأَبَتْ فَبَاتَ غَضْبَانَ لَعَنَتْهَا الْمَلَائِكَةُ حَتَّى تُصْبِحَ» . مُتَّفَقٌ عَلَيْهِ. وَفِي رِوَايَةٍ لَهُمَا قَالَ: «وَالَّذِي نَفْسِي بِيَدِهِ مَا مِنْ رَجُلٍ يَدْعُو امْرَأَتَهُ إِلَى فِرَاشِهِ فَتَأْبَى عَلَيْهِ إِلَّا كَانَ الَّذِي فِي السَّمَاءِ ساخطا عَلَيْهَا حَتَّى يرضى عَنْهَا»","english":{"narrator":"","text":"Abu Huraira reported God's Messenger as saying, “When a woman who has been called to come to her husband’s bed refuses and he spends the night angry, the angels curse her till the morning.” In a version by both of them he said, “By Him in whose hand my soul is, if any woman who has been called to come to her husband’s bed refuses, He who is in heaven is displeased with her till her t husband is pleased with her.”\n\n(Bukhari and Muslim.)"}},{"id":165,"idInBook":165,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أَسْمَاءَ أَنَّ امْرَأَةً قَالَتْ: يَا رَسُولَ اللَّهِ إِنَّ لِي ضَرَّةً فَهَلْ عَلَيَّ جُنَاحٌ إِنْ تَشَبَّعْتُ مِنْ زَوْجِي غَيْرَ الَّذِي يُعْطِينِي؟ فَقَالَ: «الْمُتَشَبِّعُ بِمَا لَمْ يُعْطَ كَلَابِسِ ثَوْبَيْ زُورٍ»","english":{"narrator":"","text":"Asma’ told of a woman who said, “Messenger of God, I have a fellow-wife; will it be wrong for me to boast of receiving from my husband what he does not give me?” He replied, “The one who boasts of receiving what he has not been given is like him who has put on the two garments of falsehood.” \n\n(Bukhari and Muslim.)"}},{"id":166,"idInBook":166,"chapterId":13,"bookId":14,"arabic":"وَعَن أنس قَالَ: آلى رَسُول الله مِنْ نِسَائِهِ شَهْرًا وَكَانَتِ انْفَكَّتْ رِجْلُهُ فَأَقَامَ فِي مَشْرُبَةٍ تِسْعًا وَعِشْرِينَ لَيْلَةً ثُمَّ نَزَلَ فَقَالُوا: يَا رَسُولَ اللَّهِ آلَيْتَ شَهْرًا فَقَالَ: «إِنَّ الشَّهْرَ يَكُونُ تِسْعًا وَعِشْرِينَ» . رَوَاهُ الْبُخَارِيُّ","english":{"narrator":"","text":"Anas said that God’s Messenger swore he would stay away from his wives for a month. His foot being dislocated, he stayed in an upper room for twenty-nine nights and then came down; and when it was remarked to him that he has sworn to stay away for a month, he replied, “The month has twenty-nine days.”*\n*This is most probably with reference to the month in question, as it cannot be considered a general statement.\n\nBukhari transmitted it."}},{"id":167,"idInBook":167,"chapterId":13,"bookId":14,"arabic":"وَعَن جَابر قَالَ: دخل أَبُو بكر رَضِي الله عَنهُ يَسْتَأْذِنُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَوَجَدَ النَّاسَ جُلُوسًا بِبَابِهِ لَمْ يُؤْذَنْ لِأَحَدٍ مِنْهُمْ قَالَ: فَأُذِنَ لِأَبِي بَكْرٍ فَدَخَلَ ثُمَّ أَقْبَلَ عُمَرُ فَاسْتَأْذَنَ فَأُذِنَ لَهُ فَوَجَدَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَالِسًا حَوْلَهُ نِسَائِهِ وَاجِمًا سَاكِتًا قَالَ فَقُلْتُ: لَأَقُولَنَّ شَيْئًا أُضْحِكُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: يَا رَسُولَ اللَّهِ لَوْ رَأَيْتَ بِنْتَ خَارِجَةَ سَأَلَتْنِي النَّفَقَةَ فَقُمْتُ إِلَيْهَا فَوَجَأْتُ عُنُقَهَا فَضَحِكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ: «هُنَّ حَوْلِي كَمَا تَرَى يَسْأَلْنَنِي النَّفَقَةَ» . فَقَامَ أَبُو بكر إِلَى عَائِشَةَ يَجَأُ عُنُقَهَا وَقَامَ عُمَرُ إِلَى حَفْصَةَ يَجَأُ عُنُقَهَا كِلَاهُمَا يَقُولُ: تَسْأَلِينَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا لَيْسَ عِنْدَهُ؟ فَقُلْنَ: وَاللَّهِ لَا نَسْأَلُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَيْئًا أبدا لَيْسَ عِنْدَهُ ثُمَّ اعْتَزَلَهُنَّ شَهْرًا أَوْ تِسْعًا وَعشْرين ثمَّ نزلت هَذِه الْآيَة: (يَا أَيهَا النَّبِي قل لِأَزْوَاجِك)\nحَتَّى بلغ (للمحسنات مِنْكُن أجرا عَظِيما)\nقَالَ: فَبَدَأَ بعائشة فَقَالَ: «يَا عَائِشَةُ إِنِّي أُرِيدُ أَنْ أَعْرِضَ عَلَيْكِ أَمْرًا أُحِبُّ أَنْ لَا تَعْجَلِي فِيهِ حَتَّى تَسْتَشِيرِي أَبَوَيْكِ» . قَالَتْ: وَمَا هُوَ يَا رَسُولَ اللَّهِ؟ فَتَلَا عَلَيْهَا الْآيَةَ قَالَتْ: أَفِيكَ يَا رَسُولَ اللَّهِ أَسْتَشِيرُ أَبَوَيَّ؟ بَلْ أَخْتَارُ اللَّهَ وَرَسُولَهُ وَالدَّارَ الْآخِرَةَ وَأَسْأَلُكَ أَنْ لَا تُخْبِرَ امْرَأَةً مِنْ نِسَائِكَ بِالَّذِي قُلْتُ: قَالَ: «لَا تَسْأَلُنِي امْرَأَةٌ مِنْهُنَّ إِلَّا أَخْبَرْتُهَا إِنَّ اللَّهَ لَمْ يَبْعَثْنِي مُعَنِّتًا وَلَا مُتَعَنِّتًا وَلَكِنْ بَعَثَنِي معلما ميسرًا» . رَوَاهُ مُسلم","english":{"narrator":"Jabir said:","text":"Abu Bakr came and asked permission to go in to see the Prophet, but found the people seated at his door, none of them having been given permission. Permission was, however, given to Abu Bakr and he entered. ‘Umar then came forward, and when he had asked and had been granted permission he found the Prophet sitting sad and silent with his wives around him. He told that he decided to say something which would make the Prophet laugh, so he said, “Messenger of God, I wish you had seen the daughter of Kharija when she asked me for extra money and I got up and slapped her on the neck.” God's Messenger laughed and said, “They are around me as you see asking for extra money.” Abu Bakr then got up, went to ‘A’isha and slapped her on the neck, and ‘Umar did the same to Hafsa, both of them saying, “Are you asking God’s Messenger for what he does not possess?” They all replied, “We swear by God that we never ask God’s Messenger for anything he does not possess.” Thereafter he withdrew from them for a month or twenty-nine days. Then this verse came down, “O prophet, say to your wives ... for those who do well among you a great reward” (Al-Qur’an 33:28 f). He then went first to ‘A’isha and said, “I want to propound something to you, ‘A’isha, but wish no hasty reply before you consult your parents.” When she had asked him what it was and he had recited the verse to her she said, “Shall I consult my parents about you, Messenger of God? Nay, I choose God, His Messenger, and the final abode; but I ask you not to tell any of your wives what I have said.” He replied, “Not one of them will ask me without my informing her. God did not send me to be harsh or cause harm, but sent me to teach and make things easy.” \n\nMuslim transmitted it."}},{"id":168,"idInBook":168,"chapterId":13,"bookId":14,"arabic":"وَعَن عَائِشَة قَالَت: كنت أغار من اللَّاتِي وَهَبْنَ أَنْفُسَهُنَّ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ: أَتَهَبُ الْمَرْأَةُ نَفْسَهَا؟ فَلَمَّا أَنْزَلَ اللَّهُ تَعَالَى: (تُرْجِي مَنْ تَشَاءُ مِنْهُنَّ وَتُؤْوِي إِلَيْكَ مَنْ تَشَاءُ وَمَنِ ابْتَغَيْتَ مِمَّنْ عَزَلْتَ فَلَا جنَاح عَلَيْك) قُلْتُ: مَا أَرَى رَبَّكَ إِلَّا يُسَارِعُ فِي هَوَاكَ. مُتَّفَقٌ عَلَيْهِ.","english":{"narrator":"‘A’isha said:","text":"Being jealous of the women who offered themselves to God's Messenger I asked, “Does a woman offer herself?” Then when God most high sent down, “You may defer any of them you wish and take to yourself any you wish, and if you desire any you have set aside no sin is chargeable to you” (Al-Qur’an 33:51) said, “It seems to me that your Lord hastens to satisfy your desire.” \n\n(Bukhari and Muslim.)"}},{"id":169,"idInBook":169,"chapterId":13,"bookId":14,"arabic":"عَن عَائِشَة رَضِي الله عَنْهَا أَنَّهَا كَانَتْ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ قَالَتْ: فَسَابَقْتُهُ فَسَبَقْتُهُ عَلَى رِجْلَيَّ فَلَمَّا حَمَلْتُ اللَّحْمَ سَابَقْتُهُ فَسَبَقَنِي قَالَ: «هَذِهِ بِتِلْكَ السَّبْقَةِ» . رَوَاهُ أَبُو دَاوُدَ","english":{"narrator":"","text":"'A'isha told that when she was with God's Messenger on a journey she raced him on foot and beat him, but when she grew she raced him and he beat her. He said, “This makes up for that beating.\" \n\nAbu Dawud transmitted it."}},{"id":170,"idInBook":170,"chapterId":13,"bookId":14,"arabic":"وَعَنْهَا قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «خَيْرُكُمْ خَيْرُكُمْ لِأَهْلِهِ وَأَنَا خَيْرُكُمْ لِأَهْلِي وَإِذَا مَاتَ صَاحِبُكُمْ فَدَعُوهُ» . رَوَاهُ التِّرْمِذِيُّ. والدارمي\nوَرَوَاهُ ابْنُ مَاجَهْ عَنِ ابْنِ عَبَّاسٍ إِلَى قَوْله: «لأهلي»","english":{"narrator":"","text":"She reported God's Messenger as saying, “The best of you is he who is best to his family, and I am the best among you to my family. When one of you dies speak no ill of him.\" \n\nTirmidhi and Darimi transmitted it, and Ibn Majah transmitted it up to “to my family” on the authority of Ibn ‘Abbas."}},{"id":171,"idInBook":171,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْمَرْأَةُ إِذَا صَلَّتْ خَمْسَهَا وَصَامَتْ شَهْرَهَا وَأَحْصَنَتْ فَرْجَهَا وَأَطَاعَتْ بَعْلَهَا فَلْتَدْخُلْ مِنْ أَيِّ أَبْوَابِ الْجَنَّةِ شَاءَتْ» . رَوَاهُ أَبُو نعيم فِي الْحِلْية","english":{"narrator":"","text":"Anas reported God’s Messenger as saying, “When a woman observes the five times of prayer, fasts during Ramadan, preserves her chastity and obeys her husband, she may enter by any of the gates of paradise she wishes.”*\n* A way of saying nothing will prevent her from entering paradise.\n\n Abu Nu'aim transmitted it in al-Hilya."}},{"id":172,"idInBook":172,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عَلَيْهِ وَسلم: «لَو كُنْتُ آمُرُ أَحَدًا أَنْ يَسْجُدَ لِأَحَدٍ لَأَمَرْتُ الْمَرْأَة أَن تسْجد لزَوجهَا» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Abu Huraira reported God’s Messenger as saying, “If I were to order anyone to prostrate himself before another, I would order a woman to prostrate herself before her husband.\" \n\nTirmidhi transmitted it."}},{"id":173,"idInBook":173,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أُمِّ سَلَمَةَ قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَيُّمَا امْرَأَةٍ مَاتَتْ وَزَوْجُهَا عَنْهَا رَاضٍ دَخَلَتِ الْجَنَّةَ» . رَوَاهُ التِّرْمِذِيُّ","english":{"narrator":"","text":"Umm Salama reported God’s Messenger as saying, “Any woman who dies when her husband is pleased with her will enter paradise.\" \n\nTirmidhi transmitted it."}},{"id":174,"idInBook":174,"chapterId":13,"bookId":14,"arabic":"وَعَنْ طَلْقِ بْنِ عَلِيٍّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا الرَّجُلُ دَعَا زَوْجَتَهُ لِحَاجَتِهِ فَلْتَأْتِهِ وَإِنْ كَانَتْ عَلَى التَّنور» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Talq b. ‘Ali reported God’s Messenger as saying, “When a man calls his wife to satisfy his desire she must go to him even if she is occupied at the oven.”\n\nTirmidhi transmitted it."}},{"id":175,"idInBook":175,"chapterId":13,"bookId":14,"arabic":"وَعَنْ مُعَاذٍ رَضِيَ اللَّهُ عَنْهُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" لَا تُؤْذِي امْرَأَةٌ زَوْجَهَا فِي الدُّنْيَا إِلَّا قَالَت زَوجته مِنَ الْحُورِ الْعِينِ: لَا تُؤْذِيهِ قَاتَلَكِ اللَّهُ فَإِنَّمَا هُوَ عِنْدَكِ دَخِيلٌ يُوشِكُ أَنْ يُفَارِقَكِ إِلَيْنَا \". رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيث غَرِيب","english":{"narrator":"","text":"Mu'adh reported the Prophet as saying that no woman annoys her husband in this world without his wife among the large-eyed maidens saying, “You must not annoy him. God curse you! He is only a passing guest with you and is about to leave you to come to us.”\n\nTirmidhi and Ibn Majah transmitted it, Tirmidhi saying this is a gharib tradition."}},{"id":176,"idInBook":176,"chapterId":13,"bookId":14,"arabic":"وَعَنْ حَكِيمِ بْنِ مُعَاوِيَةَ الْقُشَيْرِيِّ عَنْ أَبِيهِ قَالَ: قُلْتُ: يَا رَسُولَ اللَّهِ مَا حَقُّ زَوْجَةِ أَحَدِنَا عَلَيْهِ؟ قَالَ: «أَنْ تُطْعِمَهَا إِذَا طَعِمْتَ وَتَكْسُوَهَا إِذَا اكْتَسَيْتَ وَلَا تَضْرِبِ الْوَجْهَ وَلَا تُقَبِّحْ وَلَا تَهْجُرْ إِلَّا فِي الْبَيْتِ» . رَوَاهُ أَحْمد وَأَبُو دَاوُد وَابْن مَاجَه","english":{"narrator":"Hakim b. Mu'awiya al-Qushairi quoted his father as telling that he asked:","text":"“Messenger of God, what right can any wife demand of her husband?’’ He replied, “That you should give her food when you eat, clothe her when you clothe yourself, not strike her on the face, and do not revile her or separate from her except in the house” (Al-Quran 4:34). \n\nAhmad, Abu Dawud and Ibn Majah transmitted it."}},{"id":177,"idInBook":177,"chapterId":13,"bookId":14,"arabic":"وَعَنْ لَقِيطِ بْنِ صَبِرَةَ قَالَ: قُلْتُ: يَا رَسُولَ اللَّهِ إِنَّ لِي امْرَأَةً فِي لِسَانِهَا شَيْءٌ يَعْنِي الْبَذَاءَ قَالَ: «طَلِّقْهَا» . قُلْتُ: إِنَّ لِي مِنْهَا وَلَدًا وَلَهَا صُحْبَةٌ قَالَ: «فَمُرْهَا» يَقُولُ عِظْهَا «فَإِنْ يَكُ فِيهَا خَيْرٌ فَسَتَقْبَلُ وَلَا تَضْرِبَنَّ ظَعِينَتَكَ ضَرْبَكَ أُمَيَّتَكَ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Laqit b. Sabira told that he said, “Messenger of God, I have a wife who has something in her tongue,” meaning foul speech. He told him to divorce her, but when he replied that he had a son from her and she was a companion, he said, “Give her a command (meaning give her an exhortation), and if there is any good in her she will accept it; but do not beat your wife as you would beat your young slave-girl.” \n\nAbu Dawud transmitted it."}},{"id":178,"idInBook":178,"chapterId":13,"bookId":14,"arabic":"وَعَنْ إِيَاسِ بْنِ عَبْدُ اللَّهِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «لَا تَضْرِبُوا إِمَاءِ اللَّهِ» فَجَاءَ عُمَرُ إِلَى رَسُولِ الله فَقَالَ: ذَئِرْنَ النِّسَاءُ عَلَى أَزْوَاجِهِنَّ فَرَخَّصَ فِي ضَرْبِهِنَّ فَأَطَافَ بَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نِسَاءٌ كَثِيرٌ يَشْكُونَ أَزْوَاجَهُنَّ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَقَدْ طَافَ بِآلِ مُحَمَّدٍ نِسَاءٌ كَثِيرٌ يَشْكُونَ أَزْوَاجَهُنَّ لَيْسَ أُولَئِكَ بِخِيَارِكُمْ» . رَوَاهُ أَبُو دَاوُدَ وَابْنُ مَاجَه والدارمي","english":{"narrator":"","text":"Iyas b. ‘Abdallah reported God’s Messenger as saying, “Do not beat God’s handmaidens;” but when ‘Umar came to God’s Messenger and said, “The women have become emboldened towards their husbands,” he gave licence to beat them. Then many women went round God’s Messenger’s family complaining of their husbands, and he said, “Many women have gone round Muhammad’s family complaining of their husbands. Those are not the “best among you.” \n\nAbu Dawud, Ibn Majah and Darimi transmitted it."}},{"id":179,"idInBook":179,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَيْسَ مِنَّا مَنْ خَبَّبَ امْرَأَةً عَلَى زَوْجِهَا أَوْ عَبْدًا عَلَى سَيّده» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Abu Huraira reported God’s Messenger as saying, “He who makes a wife disaffected towards her husband or a slave towards his master is not one of us.” \n\nAbu Dawud transmitted it."}},{"id":180,"idInBook":180,"chapterId":13,"bookId":14,"arabic":"وَعَن عَائِشَة رَضِي الله عَنهُ قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «إِنَّ مِنْ أَكْمَلِ الْمُؤْمِنِينَ إِيمَانًا أَحْسَنُهُمْ خُلُقًا وألطفهم بأَهْله» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"‘A’isha reported God’s Messenger as saying, “Among the believers who show most perfect faith are those who have the best disposition, and are kindest to their families.\" \n\nTirmidhi transmitted it."}},{"id":181,"idInBook":181,"chapterId":13,"bookId":14,"arabic":"قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَكْمَلُ الْمُؤْمِنِينَ إِيمَانًا أَحْسَنُهُمْ خُلُقًا وَخِيَارُكُمْ خِيَارُكُمْ لِنِسَائِهِمْ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَرَوَاهُ أَبُو دَاوُد إِلَى قَوْله «خلقا»","english":{"narrator":"","text":"Abu Huraira reported God’s Messenger as saying, “The believers who show the most perfect faith are those who have the best disposition and the best of you are those who are best to their wives.” \n\nTirmidhi transmitted it, saying this is a hasan sahih tradition, and Abu Dawud transmitted it up to “disposition.”"}},{"id":182,"idInBook":182,"chapterId":13,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: قَدِمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ غَزْوَة تَبُوك أَو حنين وَفِي سَهْوَتِهَا سِتْرٌ فَهَبَّتْ رِيحٌ فَكَشَفَتْ نَاحِيَةَ السِّتْرِ عَنْ بَنَاتٍ لِعَائِشَةَ لُعَبٍ فَقَالَ: «مَا هَذَا يَا عَائِشَةُ؟» قَالَتْ: بَنَاتِي وَرَأَى بَيْنَهُنَّ فَرَسًا لَهُ جَنَاحَانِ مِنْ رِقَاعٍ فَقَالَ: «مَا هَذَا الَّذِي أَرَى وَسْطَهُنَّ؟» قَالَتْ: فَرَسٌ قَالَ: «وَمَا الَّذِي عَلَيْهِ؟» قَالَتْ: جَنَاحَانِ قَالَ: «فَرَسٌ لَهُ جَنَاحَانِ؟» قَالَتْ: أَمَا سَمِعْتَ أَنَّ لِسُلَيْمَانَ خَيْلًا لَهَا أَجْنِحَةٌ؟ قَالَتْ: فَضَحِكَ حَتَّى رَأَيْتُ نَوَاجِذَهُ. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"'A’isha told that when God’s Messenger arrived after the expedition to Tabuk or Hunain the wind raised an end of a curtain which was placed before her storeroom, revealing some dolls which belonged to her. He asked her what this was and she replied that they were her dolls. Among them he saw a horse with wings made of rags and asked what that was that he saw among them. She told him that it was a horse, and when he asked what it was that it had on it and she replied that it had wings, he said, “A horse with wings!” She replied, “Have you not heard that Solomon had horses with wings?” She said that he laughed so heartily that she could see his back teeth. \n\nAbu Dawud transmitted it."}},{"id":183,"idInBook":183,"chapterId":13,"bookId":14,"arabic":"عَنْ قَيْسِ بْنِ سَعْدٍ قَالَ: أَتَيْتُ الْحِيرَةَ فَرَأَيْتُهُمْ يَسْجُدُونَ لِمَرْزُبَانٍ لَهُمْ فَقُلْتُ: لَرَسُولُ اللَّهِ صلى الله عَلَيْهِ وَسلم أَحَق أَن يسْجد لَهُ فَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ: إِنِّي أَتَيْتُ الْحِيرَةَ فَرَأَيْتُهُمْ يَسْجُدُونَ لِمَرْزُبَانٍ لَهُمْ فَأَنْتَ أَحَقُّ بِأَنْ يُسْجَدَ لَكَ فَقَالَ لِي: «أَرَأَيْتَ لَوْ مَرَرْتَ بِقَبْرِى أَكُنْتَ تَسْجُدُ لَهُ؟» فَقُلْتُ: لَا فَقَالَ: «لَا تَفْعَلُوا لَو كنت آمُر أحد أَنْ يَسْجُدَ لِأَحَدٍ لَأَمَرْتُ النِّسَاءَ أَنْ يَسْجُدْنَ لِأَزْوَاجِهِنَّ لِمَا جَعَلَ اللَّهُ لَهُمْ عَلَيْهِنَّ مِنْ حق» . رَوَاهُ أَبُو دَاوُد\nوَرَوَاهُ أَحْمد عَن معَاذ بن جبل","english":{"narrator":"Qais b. Sa'd said:","text":"I went to al-Hira and saw them prostrating themselves before a satrap of theirs, so I said, “God’s Messenger has most right to have prostration made before him.” When I came to God’s Messenger I said, “I went to al-Hira and saw them prostrating themselves before a satrap of theirs, but you have most right to have people prostrating themselves before you.” He replied, “Tell me; if you were to pass my grave, would you prostrate yourself before it?” Then when I said that I would not, he replied, “None of you must do it. If I were to command anyone to make prostration before another I would command women to prostrate themselves before their husbands, because of the special right over them given to the husbands by God.” \n\nAbu Dawud transmitted it, and Ahmad transmitted it on the authority of Mu'adh b. Jabal."}},{"id":184,"idInBook":184,"chapterId":13,"bookId":14,"arabic":"وَعَنْ عُمَرَ رَضِيَ اللَّهُ عَنْهُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يُسْأَلُ الرَّجُلُ فِيمَا ضَرَبَ امْرَأَتَهُ عَلَيْهِ» . رَوَاهُ أَبُو دَاوُد وَابْن مَاجَه","english":{"narrator":"","text":"‘Umar reported the Prophet as saying, “A man will not be asked about why he beat his wife.” \n\nAbu Dawud and Ibn Majah transmitted it."}},{"id":185,"idInBook":185,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ قَالَ: جَاءَتِ امْرَأَةٌ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ عِنْده فَقَالَت: زَوْجِي صَفْوَانُ بْنُ الْمُعَطَّلِ يَضْرِبُنِي إِذَا صَلَّيْتُ وَيُفَطِّرُنِي إِذَا صُمْتُ وَلَا يُصَلِّي الْفَجْرَ حَتَّى تَطْلُعَ الشَّمْسُ قَالَ: وَصَفْوَانُ عِنْدَهُ قَالَ: فَسَأَلَهُ عَمَّا قَالَت فَقَالَ: يَا رَسُولَ اللَّهِ أَمَّا قَوْلُهَا: يَضْرِبُنِي إِذَا صَلَّيْتُ فَإِنَّهَا تَقْرَأُ بِسُورَتَيْنِ وَقَدْ نَهَيْتُهَا قَالَ: فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَوْ كَانَتْ سُورَةً وَاحِدَةً لَكَفَتِ النَّاسَ» . قَالَ: وَأَمَّا قَوْلُهَا يُفَطِّرُنِي إِذَا صُمْتُ فَإِنَّهَا تَنْطَلِقُ تَصُوم وَأَنا رجل شَاب فَلَا أَصْبِر فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَصُومُ امْرَأَةٌ إِلَّا بِإِذْنِ زَوْجِهَا» وَأَمَّا قَوْلُهَا: إِنِّي لَا أُصَلِّي حَتَّى تَطْلُعَ الشَّمْسُ فَإنَّا أهل بَيت قد عرف لنا ذَاك لَا نَكَادُ نَسْتَيْقِظُ حَتَّى تَطْلُعَ الشَّمْسُ قَالَ: «فَإِذَا اسْتَيْقَظْتَ يَا صَفْوَانُ فَصَلِّ» . رَوَاهُ أَبُو دَاوُد وَابْن مَاجَه","english":{"narrator":"Abu Sa'id told of a woman who came to God’s Messenger when he was with him and said, “My husband, Safwan b. al-Mu‘attal, beats me when I pray, makes me break my fast when I am observing it, and does not pray the dawn prayer till the sun rises.” Safwan was present, so he asked him about what she had said and he replied, “Messenger of God, as for her statement that I beat her when she prays, she recites two surahs and I have forbidden her to do so.” God’s Messenger said to him, “If it had been one surah it would be enough for people.” He continued:","text":"“As for her statement that I make her break her fast when she is observing it, she keeps on fasting, and I am a young man who cannot contain himself.” God’s Messenger said, “A woman may fast only with her husband’s permission.”* He continued: “As for her statement that I do not pray till the sun rises; I belong to a family which has such a reputation, hardly awakening till the sun rises.” He said, “Then when you awake, Safwan, you must pray.”\n* This refers to fasting which is not obligatory.\n\nAbu Dawud and Ibn Majah transmitted it."}},{"id":186,"idInBook":186,"chapterId":13,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ فِي نَفَرٍ مِنَ الْمُهَاجِرِينَ وَالْأَنْصَارِ فَجَاءَ بِعِيرٌ فَسَجَدَ لَهُ فَقَالَ أَصْحَابُهُ: يَا رَسُولَ اللَّهِ تَسْجُدُ لَكَ الْبَهَائِمُ وَالشَّجَرُ فَنَحْنُ أَحَقُّ أَنْ نَسْجُدَ لَكَ. فَقَالَ: «اعْبُدُوا رَبَّكُمْ وَأَكْرِمُوا أَخَاكُمْ وَلَوْ كُنْتُ آمُرُ أَحَدًا أَنْ يَسْجُدَ لِأَحَدٍ لَأَمَرْتُ الْمَرْأَةَ أَنْ تَسْجُدَ لِزَوْجِهَا وَلَوْ أَمَرَهَا أَنْ تَنْقُلَ مِنْ جَبَلٍ أَصْفَرَ إِلَى جَبَلٍ أَسْوَدَ وَمِنْ جَبَلٍ أَسْوَدَ إِلَى جَبَلٍ أَبْيَضَ كَانَ يَنْبَغِي لَهَا أَن تَفْعَلهُ» . رَوَاهُ أَحْمد","english":{"narrator":"","text":"'A’isha said that once when God’s Messenger was with a number of the Emigrants and Helpers a camel came and prostrated itself before him. Thereupon his companions said, “Messenger of God, beasts and trees prostrate themselves before you, but we have most right to do so.” He replied, “Worship your Lord and honour your brother. If I were to order any one to prostrate himself before another, I would order a woman to prostrate herself before her husband; and if he were to order her to convey stones from a yellow mountain to a black one, or from a black mountain to a white one, it would be incumbent on her to do so.”\n\nAhmad transmitted it."}},{"id":187,"idInBook":187,"chapterId":13,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «ثَلَاثَةٌ لَا تُقْبَلُ لَهُمْ صَلَاةٌ وَلَا تَصْعَدُ لَهُمْ حَسَنَةٌ الْعَبْدُ الْآبِقُ حَتَّى يَرْجِعَ إِلَى مَوَالِيهِ فَيَضَعَ يَدَهُ فِي أَيْدِيهِمْ وَالْمَرْأَةُ السَّاخِطُ عَلَيْهَا زَوْجُهَا وَالسَّكْرَانُ حَتَّى يصحو» . رَوَاهُ الْبَيْهَقِيّ فِي شعب الْإِيمَان","english":{"narrator":"Jabir reported God’s Messenger as saying, “There are three whose prayer is not accepted and whose good deeds are not taken up to heaven:","text":"a runaway slave, till he returns to his patrons and puts his hand in theirs; a woman with whom her husband is displeased; and a drunkard, till he becomes sober.” \n\nBaihaqi transmitted it in Shu'ab al-iman."}},{"id":188,"idInBook":188,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قِيلَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أَيْ النِّسَاءِ خَيْرٌ؟ قَالَ: «الَّتِي تَسُرُّهُ إِذَا نَظَرَ وَتُطِيعُهُ إِذَا أَمَرَ وَلَا تُخَالِفُهُ فِي نَفْسِهَا وَلَا مَالِهَا بِمَا يَكْرَهُ» . رَوَاهُ النَّسَائِيُّ وَالْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَان","english":{"narrator":"","text":"Abu Huraira told that when God’s Messenger was asked which woman was best he replied, “The one who pleases  when he looks at her, obeys him when he gives a command, and does not go against his wishes regarding her person or property by doing anything of which he disapproves.” \n\nNasa’i and Baihaqi, in Shu'ab al-iman, transmitted it."}},{"id":189,"idInBook":189,"chapterId":13,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا: أَنَّ رَسُولَ اللَّهِ صَلَّى الله عَلَيْهِ وَسلم قَالَ: \n\" أَربع من أعطيهن فقد أعطي خير الدُّنْيَا وَالْآخِرَةِ: قَلْبٌ شَاكِرٌ وَلِسَانٌ ذَاكِرٌ وَبَدَنٌ عَلَى الْبَلَاءِ صَابِرٌ وَزَوْجَةٌ لَا تَبْغِيهِ خَوْنًا فِي نَفسهَا وَلَا مَاله \". رَوَاهُ الْبَيْهَقِيّ فِي شعب الْإِيمَان","english":{"narrator":"Ibn ‘Abbas reported God’s Messenger as saying, \"There are four characteristics which are of such a nature that one who has been given them has been endowed with what is best in this world and the next:","text":"a thankful heart, a tongue which makes mention of God, a body which shows endurance in trial, and a wife who does not seek to be unfaithful to  in her person or his property.” \n\nBaihaqi transmitted it in Shu'ab al-iman."}},{"id":190,"idInBook":190,"chapterId":13,"bookId":14,"arabic":"عَنِ ابْنِ عَبَّاسٍ: أَنَّ امْرَأَةَ ثَابِتِ بْنِ قِيسٍ أَتَتِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ: يَا رَسُولَ اللَّهِ ثَابِتُ بْنُ قَيْسٍ مَا أَعْتِبُ عَلَيْهِ فِي خُلُقٍ وَلَا دِينٍ وَلَكِنِّي أَكْرَهُ الْكُفْرَ فِي الْإِسْلَامِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَتَرُدِّينَ عَلَيْهِ حَدِيقَتَهُ؟» قَالَتْ: نَعَمْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «اقْبَلِ الْحَدِيقَةَ وَطَلِّقْهَا تَطْلِيقَةً» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Ibn ‘Abbas told that the wife of Thabit b. Qais came to the Prophet and said, “Messenger of God, I do not reproach Thabit b. Qais in respect of character or religion, but I do not want to be guilty of infidelity* regarding Islam.” God’s Messenger asked her if she would give him back his garden, and when she replied that she would, he told him to accept the garden and make one declaration of divorce. \n* Meaning she did not like him and so was afraid she might not show him the respect due to a husband. Kufran, translated ‘infidelity’, can also mean ‘ingratitude’.\n\nBukhari transmitted it."}},{"id":191,"idInBook":191,"chapterId":13,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ: أَنَّهُ طَلَّقَ امْرَأَةً لَهُ وَهِيَ حَائِضٌ فَذَكَرَ عُمَرُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَتَغَيَّظَ فِيهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ قَالَ: «ليراجعها ثمَّ يمْسِكهَا حَتَّى تطهر ثمَّ تحيض فَتطهر فَإِن بدا لَهُ أَنْ يُطْلِّقَهَا فَلْيُطْلِّقْهَا طَاهِرًا قَبْلَ أَنْ يَمَسَّهَا فَتِلْكَ الْعِدَّةُ الَّتِي أَمَرَ اللَّهُ أَنْ تُطْلَّقَ لَهَا النِّسَاءُ» . وَفِي رِوَايَةٍ: «مُرْهُ فَلْيُرَاجِعْهَا ثُمَّ لْيُطَلِّقْهَا طَاهِرًا أَوْ حَامِلًا»","english":{"narrator":"","text":"'Abdallah b. ‘Umar said he divorced a wife of his while she was menstruating and that when ‘Umar mentioned the matter to God’s Messenger he became angry and said, “He must take her back and keep her till she is purified, then has another period and is purified. If it then seems good to him to divorce her he may do so when she is pure from the menstrual discharge before having intercourse with her, for that is the period of waiting which God has commanded for the divorce of women.” A version has, “Command him to take her back, then divorce her when she is pure from the menstrual discharge, or pregnant.” \n\n(Bukhari and Muslim.)"}},{"id":192,"idInBook":192,"chapterId":13,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ قَالَتْ: خَيَّرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاخْتَرْنَا اللَّهَ وَرَسُولَهُ فَلَمْ يَعُدَّ ذَلِكَ عَلَيْنَا شَيْئًا","english":{"narrator":"","text":"‘A’isha said that God’s Messenger gave them their choice and they chose God and His Messenger; so that was not reckoned as counting in any way to their divorce. \n\n(Bukhari and Muslim.)"}},{"id":193,"idInBook":193,"chapterId":13,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: فِي الْحَرَامِ يُكَفَّرُ لَقَدْ كَانَ لَكُمْ فِي رَسُولِ الله أُسْوَة حَسَنَة","english":{"narrator":"Ibn ‘Abbas said:","text":"One makes atonement for something he has made unlawful for himself.* You have had a good example in God’s Messenger. \n* i.e. something not in itself unlawful. It is treated like an oath for breaking which atonement must be made. The Prophet’s example refers to his withdrawing from his wives for a period.\n\n(Bukhari and Muslim.)"}},{"id":194,"idInBook":194,"chapterId":13,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَمْكُثُ عِنْدَ زَيْنَبَ بِنْتِ جَحْشٍ وَشَرِبَ عِنْدَهَا عَسَلًا فَتَوَاصَيْتُ أَنَا وَحَفْصَةُ أَنَّ أَيَّتَنَا دَخَلَ عَلَيْهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلْتَقُلْ: إِنِّي أَجِدُ مِنْكَ رِيحَ مَغَافِيرَ أَكَلْتَ مَغَافِيرَ؟ فَدَخَلَ عَلَى إِحْدَاهُمَا فَقَالَتْ لَهُ ذَلِكَ فَقَالَ: «لَا بَأْسَ شَرِبْتُ عَسَلًا عِنْدَ زَيْنَبَ بِنْتِ جَحْشٍ فَلَنْ أَعُودَ لَهُ وَقَدْ حَلَفْتُ لَا تُخْبِرِي بِذَلِكِ أَحَدًا» يَبْتَغِي مرضاة أَزوَاجه فَنَزَلَتْ: (يَا أَيُّهَا النَّبِيُّ لِمَ تُحَرِّمُ مَا أَحَلَّ الله لَك تبتغي مرضاة أَزوَاجك)\nالْآيَة","english":{"narrator":"'A'isha said:","text":"The Prophet used to spend time with Zainab daughter of Jahsh and that he once drank honey at her house, so Hafsa and she agreed that the one whom the Prophet visited first should say, “I notice that you have an odour of the gum of the mimosa.* Have you eaten some?” When he visited one of them and she said that to him he replied, “Don’t worry; I drank some honey at the house of Zainab daughter of Jahsh, but I swear that I shall not do it again. Do not tell anyone of that.”  desiring to please his wives, and then there came down, “O prophet, why do you hold to be forbidden what God has made lawful for you, desiring to please your wives? (Al-Qur’an 66:1).\n*Maghafir; plural of Mughfur, is here used. It is the gum of a kind of mimosa called ‘urfut, the odour of which is unpleasant.\n\n(Bukhari and Muslim.)"}},{"id":195,"idInBook":195,"chapterId":13,"bookId":14,"arabic":"عَنْ ثَوْبَانَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَيُّمَا امْرَأَةٍ سَأَلَتْ زَوْجَهَا طَلَاقًا فِي غَيْرِ مَا بَأْسٍ فَحَرَامٌ عَلَيْهَا رَائِحَةُ الْجَنَّةِ» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ والدارمي","english":{"narrator":"","text":"Thauban reported God's Messenger as saying, “If any woman asks her husband for divorce without some strong reason the odour of paradise will be forbidden to her.” \n\nAhmad, Tirmidhi, Abu Dawud, Ibn Majah and Darimi transmitted it."}},{"id":196,"idInBook":196,"chapterId":13,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أَبْغَضُ الْحَلَالِ إِلَى اللَّهِ الطلاقُ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Ibn ‘Umar reported the Prophet as saying, “The lawful thing which God hates most is divorce.” \n\nAbu Dawud transmitted it."}},{"id":197,"idInBook":197,"chapterId":13,"bookId":14,"arabic":"وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا طَلَاقَ قَبْلَ نِكَاحٍ وَلَا عَتَاقَ إِلَّا بَعْدَ مِلْكٍ وَلَا وِصَالَ فِي صِيَامٍ وَلَا يُتْمَ بَعْدَ احْتِلَامٍ وَلَا رَضَاعَ بَعْدَ فِطَامٍ وَلَا صَمْتَ يَوْمٍ إِلَى اللَّيْلِ» . رَوَاهُ فِي شَرْحِ السُّنَّةِ","english":{"narrator":"","text":"‘Ali reported the Prophet as saying, “There is no divorce before marriage, no manumission till one has possession, no continuous fasting, no orphan hood after the age of puberty, no suckling after weaning, and no silence all day up to the night”.*\n* Observing a complete day's silence as a religious practice is rejected.\n\nIt is transmitted in Sharh as-sunna."}},{"id":198,"idInBook":198,"chapterId":13,"bookId":14,"arabic":"وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا نَذْرَ لِابْنِ آدَمَ فِيمَا لَا يَمْلِكُ وَلَا عِتْقَ فِيمَا لَا يَمْلِكُ وَلَا طَلَاقَ فِيمَا لَا يَمْلِكُ» . رَوَاهُ التِّرْمِذِيُّ وَزَادَ أَبُو دَاوُدَ: «وَلَا بَيْعَ إِلَّا فِيمَا يملك»","english":{"narrator":"","text":"‘Amr b. Shu'aib, on his father’s authority, said his grandfather reported God’s Messenger as saying, “No descendant of Adam may make a vow about what he does not possess, or set free what he does not possess, or divorce what he does not possess.” \n\nTirmidhi transmitted it, and Abu Dawud added, “or sell what he does not possess.”"}},{"id":199,"idInBook":199,"chapterId":13,"bookId":14,"arabic":"وَعَنْ رُكَانَةَ بْنِ عَبْدِ يَزِيدَ أَنَّهُ طَلَّقَ امْرَأَتَهُ سُهَيْمَةَ الْبَتَّةَ فَأَخْبَرَ بِذَلِكَ النَّبِيَّ صَلَّى الله عَلَيْهِ وَسلم وَقَالَ: وَالله مَا أردتُ إِلَّا وَاحِدَةً فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «وَاللَّهِ مَا أَرَدْتَ إِلَّا وَاحِدَةً؟» فَقَالَ ركانةُ: واللَّهِ مَا أردتُ إِلَّا وَاحِدَة فَرَدَّهَا إِلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَطَلَّقَهَا الثَّانِيَةَ فِي زَمَانِ عُمَرَ وَالثَّالِثَةَ فِي زَمَانِ عُثْمَانَ. رَوَاهُ أَبُو دَاوُدَ وَالتِّرْمِذِيُّ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ إِلَّا أَنَّهُمْ لَمْ يَذْكُرُوا الثانيةَ وَالثَّالِثَة","english":{"narrator":"","text":"Rukana b. 'Abd Yazid said he divorced his wife Suhaima absolutely and when the Prophet was informed of that he said, “I swear by God that I meant it to be only a single utterance of divorce.” God’s Messenger asked him if that was so, and when he assured him that it was, he restored her to him. Then he divorced her the second time in the time of ‘Umar and the third time in the time of ‘Uthman. \n\nAbu Dawud, Tirmidhi, Ibn Majah and Darimi transmitted it, but only Abu Dawud mentioned the second and third time (See Abu Dawud’s Sunan, Talaq, 14)."}},{"id":200,"idInBook":200,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" ثَلَاثٌ جَدُّهُنَّ جَدٌّ وَهَزْلُهُنَّ جَدُّ: النِّكَاحُ وَالطَّلَاقُ وَالرِّجْعَةُ \". رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ حَسَنٌ غَرِيب","english":{"narrator":"Abu Huraira reported God’s Messenger as saying, “There are three things which, whether undertaken seriously or in jest, are treated as serious:","text":"marriage, divorce and taking back a wife after a divorce which is not final.” \n\nTirmidhi and Abu Dawud transmitted it, Tirmidhi saying this is a hasan gharib tradition."}},{"id":201,"idInBook":201,"chapterId":13,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ قَالَتْ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَا طَلَاقَ وَلَا عَتَاقَ فِي إِغْلَاقٍ» . رَوَاهُ أَبُو دَاوُدَ وَابْنُ مَاجَه قيل: معنى الإغلاق: الْإِكْرَاه","english":{"narrator":"","text":"‘A’isha told of hearing God’s Messenger say, “There is no divorce or emancipation in case of ighlaq.\" It is said that the meaning of ighlaq is “constraint”.\n\nAbu Dawud and Ibn Majah transmitted it."}},{"id":202,"idInBook":202,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «كُلُّ طَلَاقٍ جَائِزٌ إِلَّا طَلَاقَ الْمَعْتُوهِ وَالْمَغْلُوبِ عَلَى عَقْلِهِ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ غَرِيبٌ وَعَطَاءُ بْنُ عجلانَ الرَّاوي ضعيفٌ ذاهبُ الحَدِيث","english":{"narrator":"","text":"Abu Huraira reported God’s Messenger as saying, “Every divorce is allowable except that by an idiot or one whose mind is deranged.” \n\nTirmidhi transmitted it, saying this is a gharib tradition, and ‘Ata’ b. ‘Ajlan, the transmitter, is a weak authority whose traditions are rejected."}},{"id":203,"idInBook":203,"chapterId":13,"bookId":14,"arabic":"وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" رُفِعَ الْقَلَمُ عَنْ ثَلَاثَةٍ: عَنِ النَّائِمِ حَتَّى يَسْتَيْقِظَ وَعَنِ الصَّبِيِّ حَتَّى يَبْلُغَ وَعَنِ الْمَعْتُوهِ حَتَّى يعقل \". رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد\nوَرَوَاهُ الدَّارِمِيُّ عَنْ عَائِشَةَ وَابْنُ مَاجَهْ عَنْهُمَا","english":{"narrator":"Ali reported God’s Messenger as saying, “There are three whose actions are not recorded:","text":"a sleeper till he awakes, a boy till he reaches puberty, and an idiot till he is restored to reason.” \n\nTirmidhi and Abu Dawud transmitted it. Darimi transmitted it on the authority of 'A’isha, and Ibn Majah on the authority of both (i.e. ‘Ali and ‘A’isha’)"}},{"id":204,"idInBook":204,"chapterId":13,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «طَلَاقُ الْأَمَةِ تَطْلِيقَتَانِ وَعِدَّتُهَا حَيْضَتَانِ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ","english":{"narrator":"","text":"‘A’isha reported God’s Messenger as saying, “The divorce of a slave-woman consists in saying it twice, and her 'idda period is two courses.” \n\nTirmidhi, Abu Dawud, Ibn Majah and Darimi transmitted it."}},{"id":205,"idInBook":205,"chapterId":13,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْمُنْتَزِعَاتُ وَالْمُخْتَلِعَاتُ هُنَّ الْمُنَافِقَاتُ» . رَوَاهُ النَّسَائِيّ","english":{"narrator":"","text":"Abu Huraira reported the Prophet as saying, “Women who withdraw themselves from their husbands and women who persuade their husbands to divorce them for a compensation are hypocrites.”*\n*This type of separation should be by mutual consent. \n\nNasa’i transmitted it."}},{"id":206,"idInBook":206,"chapterId":13,"bookId":14,"arabic":"وَعَنْ نَافِعٍ عَنْ مَوْلَاةٍ لِصَفِيَّةَ بِنْتِ أَبِي عُبَيْدٍ أَنَّهَا اخْتَلَعَتْ مِنْ زَوْجِهَا بِكُلِّ شَيْءٍ لَهَا فَلَمْ يُنْكِرْ ذَلِكَ عَبْدُ اللَّهِ بْنُ عمر. رَوَاهُ مَالك","english":{"narrator":"","text":"Nafi’ quoted a client to Safiya daughter of Abu ‘Ubaid to the effect that she got a divorce from her husband in return for everything she possessed and that ‘Abdallah b. ‘Umar made no objection to that. \n\nMalik transmitted it."}},{"id":207,"idInBook":207,"chapterId":13,"bookId":14,"arabic":"حَدِيث رِجَاله ثِقَات وَعَن مَحْمُود بن لبيد قل: أَخْبَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ رَجُلٍ طَلَّقَ امْرَأَتَهُ ثَلَاثَ تَطْلِيقَاتٍ جَمِيعًا فَقَامَ غَضْبَانَ ثُمَّ قَالَ: «أَيُلْعَبُ بِكِتَابِ اللَّهِ عَزَّ وَجَلَّ وَأَنَا بَيْنَ أَظْهُرِكُمْ؟» حَتَّى قَامَ رَجُلٌ فَقَالَ: يَا رَسُولَ اللَّهِ أَلَا أَقْتُلُهُ؟ . رَوَاهُ النَّسَائِيّ","english":{"narrator":"","text":"Mahmud b. Labid told that when God’s Messenger was informed about a man who had divorced his wife declaring it three times without any interval between them, he arose in anger and said, “Is sport being made of the Book of God who is great and glorious while I am among you?\" As a result a man got up and said, “Messenger of God, shall I kill him?\" \n\nNasa’i transmitted it."}},{"id":208,"idInBook":208,"chapterId":13,"bookId":14,"arabic":"وَعَن مَالك بلغه رَجُلًا قَالَ لِعَبْدِ اللَّهِ بْنِ عَبَّاسٍ: إِنِّي طَلَّقْتُ امْرَأَتِي مِائَةَ تَطْلِيقَةٍ فَمَاذَا تَرَى عَلَيَّ؟ فَقَالَ ابْن عَبَّاس: طلقت مِنْك ثَلَاث وَسَبْعٌ وَتِسْعُونَ اتَّخَذْتَ بِهَا آيَاتِ اللَّهِ هُزُوًا. رَوَاهُ فِي الْمُوَطَّأ","english":{"narrator":"","text":"Malik told of hearing that a man said to ‘Abdallah b. ‘Abbas, “I have divorced my wife, uttering the divorce a hundred times, so what do you think I have made myself liable for?” Ibn ‘Abbas replied, “She was divorced from you by three utterances, and by ninety-seven you have made a mockery of God’s verses.” \n\nHe transmitted it in al- Muwatta’."}},{"id":209,"idInBook":209,"chapterId":13,"bookId":14,"arabic":"وَعَنْ مُعَاذِ بْنِ جَبَلٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَا مُعَاذُ مَا خَلَقَ اللَّهُ شَيْئًا عَلَى وَجْهِ الْأَرْضِ أَحَبَّ إِلَيْهِ مِنَ الْعَتَاقِ وَلَا خَلَقَ اللَّهُ شَيْئًا عَلَى وَجْهِ الْأَرْضِ أَبْغَضَ إِلَيْهِ مِنَ الطَّلاقِ» . رَوَاهُ الدَّارَقُطْنِيّ","english":{"narrator":"","text":"Mu'adh b. Jabal told that God’s Messenger said to him, “Mu'adh, God has created nothing on the face of the earth dearer to Him than emancipation, and God has created nothing on the face of the earth more hateful to Him than divorce.” \n\nDaraqutni transmitted it."}},{"id":210,"idInBook":210,"chapterId":13,"bookId":14,"arabic":"عَنْ عَائِشَةَ قَالَتْ: جَاءَتِ امْرَأَةُ رِفَاعَةَ الْقُرَظِيِّ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ: إِنِّي كُنْتُ عِنْدَ رِفَاعَةَ فَطَلَّقَنِي فَبَتَّ طَلَاقِي فَتَزَوَّجْتُ بَعْدَهُ عَبْدَ الرَّحْمَنِ بْنَ الزُّبَيْرِ وَمَا مَعَهُ إِلَّا مِثْلُ هُدْبَةِ الثَّوْبِ فَقَالَ: «أَتُرِيدِينَ أَنْ تَرْجِعِي إِلَى رِفَاعَةَ؟» قَالَتْ: نَعَمْ قَالَ: «لَا حَتَّى تَذُوقِي عُسَيْلَتَهُ وَيَذُوقَ عُسَيْلَتَكِ»","english":{"narrator":"","text":"‘A’isha told that the wife of Rifa'a al-Qurazi came to God's Messenger and said, “I was married to Rifa’a but he divorced me, making my divorce irrevocable. Afterwards I married ‘Abd ar-Rahman b. az- Zubair, but all he possesses is like the fringe of a garment.” He asked her whether she wanted to return to Rifa'a, but when she replied that she did, he said, “You may not until ‘Abd ar-Rahman and you have experienced the sweetness of intercourse with one another.” \n\n(Bukhari and Muslim.)"}},{"id":211,"idInBook":211,"chapterId":13,"bookId":14,"arabic":"عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ: لَعَنَ رسولُ الله المحلّلَ والمُحلَّلَ لَهُ. رَوَاهُ الدَّارمِيّ\nوَرَوَاهُ ابْنُ مَاجَهْ عَنْ عَلِيٍّ وَابْنِ عَبَّاسٍ وَعقبَة بن عَامر","english":{"narrator":"","text":"‘Abdallah b. Mas'ud said that God’s Messenger cursed the man who made a woman lawful for her first husband and the one for whom she was made lawful.*\n* This refers to an arrangement to marry a divorced woman and to divorce her after having intercourse so that the one who had divorced her might remarry her.\n\n Darimi transmitted it, and Ibn Majah transmitted it on the authority of 'Ali Ibn ‘Abbas and ‘Uqba b. ‘Amir."}},{"id":212,"idInBook":212,"chapterId":13,"bookId":14,"arabic":"وَعَنْ سُلَيْمَانَ بْنِ يَسَارٍ قَالَ: أَدْرَكْتُ بِضْعَةَ عَشَرَ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلُّهُمْ يَقُولُ: يُوقَفُ الْمُؤْلِي. رَوَاهُ فِي شرح السّنة","english":{"narrator":"","text":"Sulaiman b. Yasar said he met over ten of the companions of God’s Messenger all of whom said that the one who swears to stay away from his wife must be made to return to her or divorce her at the end of the period. \n\nIt is transmitted in Sharh as-sunna."}},{"id":213,"idInBook":213,"chapterId":13,"bookId":14,"arabic":"وَعَن أبي سلمةَ: أَنَّ سَلْمَانَ بْنَ صَخْرٍ وَيُقَالُ لَهُ: سَلَمَةُ بْنُ صَخْرٍ الْبَيَاضِيُّ جَعَلَ امْرَأَتَهُ عَلَيْهِ كَظَهْرِ أُمِّهِ حَتَّى يَمْضِيَ رَمَضَانُ فَلَمَّا مَضَى نِصْفٌ مِنْ رَمَضَانَ وَقَعَ عَلَيْهَا لَيْلًا فَأَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ لَهُ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَعْتِقْ رَقَبَةً» قَالَ: لَا أَجِدُهَا قَالَ: «فَصُمْ شَهْرَيْنِ مُتَتَابِعَيْنِ» قَالَ: لَا أَسْتَطِيعُ قَالَ: «أَطْعِمْ سِتِّينَ مِسْكِينًا» قَالَ: لَا أَجِدُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِفَرْوَةَ بْنِ عَمْرٍو: «أَعْطِهِ ذَلِكَ الْعَرَقَ» وَهُوَ مِكْتَلٌ يَأْخُذُ خَمْسَةَ عَشَرَ صَاعًا أَوْ سِتَّةَ عَشَرَ صَاعا «ليُطعِمَ سِتِّينَ مِسْكينا» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Abu Salama told that Sulaiman b. Sakhr, also called Salama b. Sakhr al-Bayadi, made his wife like his mother’s back* to him till the end of Ramadan, but when only half the month had gone he had inter-course with her during the night and went to God’s Messenger and mentioned that to him. He told him to set free a slave, but he replied that he could not get one; so he told him to fast two consecutive months, but he replied that he was unable to do that; he then told him to feed sixty poor people, but he replied that he did not possess the means, God’s Messenger then said to Farwa b. ‘Amr, “Give him that ‘araq (i.e., a date-basket holding fifteen or sixteen sa’s) (Cf. page 426) in order that he may feed sixty poor people.” \n\nTirmidhi transmitted it.\n\n*I have retained the Arabic idiom in the translation. The phrase is said to have been used as a kind of divorce in pre-Islamic times, meaning that intercourse with the woman is being considered as intercourse with one’s mother."}},{"id":214,"idInBook":214,"chapterId":13,"bookId":14,"arabic":"وروى أَبُو دَاوُد وابنُ مَاجَه والدارمي عَن سُلَيْمَانَ بْنِ يَسَارٍ عَنْ سَلَمَةَ بْنِ صَخْرٍ نحوَه قَالَ: كنتُ امْرأ أُصِيبُ مِنَ النِّسَاءِ مَا لَا يُصِيبُ غَيْرِي وَفِي روايتهِما أَعنِي أَبُو دَاوُدَ وَالدَّارِمِيَّ: «فَأَطْعِمْ وَسْقًا مِنْ تَمْرٍ بَيْنَ سِتِّينَ مِسْكينا»","english":{"narrator":"","text":"Abu Dawud, Ibn Majah and Darimi transmitted something similar on the authority of Sulaiman b. Yasar quoting Salama b. Sakhr who said, “I was a man who was more given than others to sexual intercourse.”\n\nAbu Dawud, Ibn Majah and Darimi transmitted.\n\nThe version of Abu Dawud and Darimi has, “Feed sixty poor people with a camel-load of dates."}},{"id":215,"idInBook":215,"chapterId":13,"bookId":14,"arabic":"وَعَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ سَلَمَةَ بْنِ صَخْرٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْمُظَاهِرِ يُوَاقِعُ قَبْلَ أَنْ يُكَفِّرَ قَالَ: «كَفَّارَة وَاحِدَة» . رَوَاهُ التِّرْمِذِيّ وَابْن مَاجَه","english":{"narrator":"","text":"Sulaiman b. Yasar on the authority of Salama b. Sakhr, reported the Prophet as saying about one who vows to make his wife like his mother’s back and has intercourse with her before making atonement, “There is one atonement.”*\n* Atonement for breaking the vow should be made before doing so, but if the vow is broken then the same atonement is enough.\nTirmidhi and Ibn Majah transmitted it."}},{"id":216,"idInBook":216,"chapterId":13,"bookId":14,"arabic":"عَنْ عِكْرِمَةَ عَنِ ابْنِ عَبَّاسٍ: أَنَّ رَجُلًا ظَاهَرَ مِنِ امْرَأَتِهِ فَغَشِيَهَا قَبْلَ أَنْ يَكَفِّرَ فَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ ذَلِكَ لَهُ فَقَالَ: «مَا حَمَلَكَ عَلَى ذَلِكَ؟» قَالَ: يَا رَسُولَ اللَّهِ رَأَيْتُ بَيَاضَ حِجْلَيْهَا فِي الْقَمَرِ فَلَمْ أَمْلِكْ نَفْسِي أَنْ وَقَعَتُ عَلَيْهَا فَضَحِكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَمَرَهُ أَنْ لَا يَقْرَبَهَا حَتَّى يُكَفِّرَ. رَوَاهُ ابْنُ مَاجَهْ. وَرَوَى التِّرْمِذِيُّ نَحْوَهُ وَقَالَ: هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ\nوَرَوَى أَبُو دَاوُدَ وَالنَّسَائِيُّ نَحْوَهُ مُسْنَدًا وَمُرْسَلًا وَقَالَ النَّسَائِيُّ: المُرسل أوْلى بالصَّوابِ من المسْندِ","english":{"narrator":"","text":"‘Ikrima told on the authority of Ibn ‘Abbas that a man who had vowed to make his wife like his mother’s back had intercourse with her before making atonement, so he went to the Prophet and mentioned that to him. He asked him what had induced him to do that and he replied, “Messenger of God, I saw the whiteness of her silver anklets in the moonlight and could not restrain myself from having intercourse with her.” God's Messenger laughed and ordered him not to go near her till he had made atonement. \n\nIbn Majah transmitted it, and Tirmidhi transmitted something similar, saying this is a hasan sahih gharib tradition. Abu Dawud and Nasa’i transmitted something similar both with a full isnad and in mursal form, Nasa’i saying that the mursal version is nearer the truth than the one with a full isnad."}},{"id":217,"idInBook":217,"chapterId":13,"bookId":14,"arabic":"عَن مُعَاوِيَة بنِ الحكمِ قَالَ: أَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ: يَا رَسُولَ اللَّهِ إِنَّ جَارِيَةً كَانَتْ لِي تَرْعَى غَنَمًا لِي فَجِئْتُهَا وَقَدْ فَقَدَتْ شَاةً مِنَ الْغَنَمِ فَسَأَلْتُهَا عَنْهَا فَقَالَتْ: أَكَلَهَا الذِّئْبُ فَأَسِفْتُ عَلَيْهَا وَكُنْتُ مَنْ بَنِي آدَمَ فَلَطَمْتُ وَجْهَهَا وَعَلَيَّ رَقَبَةٌ أَفَأُعْتِقُهَا؟ فَقَالَ لَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَيْنَ اللَّهُ؟» فَقَالَتْ: فِي السَّمَاءِ فَقَالَ: «مَنْ أَنَا؟» فَقَالَتْ: أَنْتَ رَسُولَ اللَّهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَعْتِقْهَا» . رَوَاهُ مَالِكٌ\nوَفِي رِوَايَةِ مُسْلِمٍ قَالَ: كَانَتْ لِي جَارِيَةٌ تَرْعَى غَنَمًا لِي قِبَلَ أُحُدٍ وَالْجَوَّانِيَّةِ فَاطَّلَعْتُ ذَاتَ يَوْمٍ فَإِذَا الذِّئْبُ قَدْ ذَهَبَ بِشَاةٍ مِنْ غَنَمِنَا وَأَنَا رَجُلٌ مِنْ بَنِي آدَمَ آسَفُ كَمَا يَأْسَفُونَ لَكِنْ صَكَكْتُهَا صَكَّةً فَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَعَظَّمَ ذَلِكَ عَلَيَّ قُلْتُ: يَا رَسُولَ اللَّهِ أفَلا أُعتِقُها؟ قَالَ: «ائتِني بهَا؟» فأتيتُه بِهَا فَقَالَ لَهَا: «أَيْنَ اللَّهُ؟» قَالَتْ: فِي السَّمَاءِ قَالَ: «مَنْ أَنَا؟» قَالَتْ: أَنْتَ رَسُولُ الله قَالَ: «أعتِقْها فإنَّها مؤْمنةٌ»","english":{"narrator":"","text":"Mu'awiya b. al-Hakam told that he went to God’s Messenger and said, “Messenger of God, I have a slave girl who was herding sheep of mine. I went to her, having missed a sheep from the flock, and asked her about it, and she told me it had been eaten by a wolf. I was annoyed with her, and being human, I struck her on the face. As it is my duty to set free a slave, should I set her free?” God’s Messenger asked her where God was and she replied that he was in heaven. He asked her who he was and she replied that he was God's Messenger. He then told him to set her free. \n\nMalik transmitted it.\n\nIn Muslim’s version he said, “I had a slave girl who was herding sheep of mine in the direction of Uhud and al-Jawwaniya. One day I looked and saw that a wolf had gone off with one of our sheep. Now I am a man who becomes annoyed just as others do, but I gave her a blow and then went to God’s Messenger. He treated my offence as serious, and so I asked him whether I should set her free. He told me to bring her and when I did so he asked her where God was and she replied that He was in heaven. He asked her who he was and she replied that he was God’s Messenger. He then told me to set her free, for she was a believer.”*\n*This chapter has only one section."}},{"id":218,"idInBook":218,"chapterId":13,"bookId":14,"arabic":"عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ رَضِيَ اللَّهُ عَنهُ قَالَ: إِن عُوَيْمِر الْعَجْلَانِيَّ قَالَ: يَا رَسُولَ اللَّهِ أَرَأَيْتَ رَجُلًا وجدَ معَ امرأتِهِ رجُلاً أيقْتُلُه فيَقْتُلُونه؟ أمْ كَيفَ أفعل؟ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «قدْ أُنْزِلُ فِيكَ وَفِي صَاحِبَتِكَ فَاذْهَبْ فَأْتِ بِهَا» قَالَ سَهْلٌ: فَتَلَاعَنَا فِي الْمَسْجِدِ وَأَنَا مَعَ النَّاسِ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا فَرَغَا قَالَ عُوَيْمِرٌ: كَذَبْتُ عَلَيْهَا يَا رسولَ اللَّهِ إِن أَمْسكْتُها فطلقتها ثَلَاثًا ثُمَّ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" انْظُرُوا فَإِنْ جَاءَتْ بِهِ أَسْحَمَ أَدْعَجَ الْعَيْنَيْنِ عَظِيمَ الْأَلْيَتَيْنِ خَدَلَّجَ السَّاقَيْنِ فَلَا أَحسب عُوَيْمِر إِلَّا قَدْ صَدَقَ عَلَيْهَا وَإِنْ جَاءَتْ بِهِ أُحَيْمِرَ كَأَنَّهُ وَحَرَةٌ فَلَا أَحْسِبُ عُوَيْمِرًا إِلَّا قَدْ كَذَبَ عَلَيْهَا فَجَاءَتْ بِهِ عَلَى النَّعْتِ الَّذِي نَعْتُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ تَصْدِيقِ عُوَيْمِرٍ فَكَانَ بَعْدُ يُنْسَبُ إِلَى أمه","english":{"narrator":"Sahl b. Sa'd as-Sa‘idi told that ‘Uwaimir al-'Ajlani asked God’s Messenger:","text":"“Tell me about a man who finds a man along with his wife. Should he kill him and then be killed by you1, or how should he act?’’ He replied, “A revelation has been sent down about you and your wife2, so go away and bring her.” Sahl said that they cursed one another in the mosque and that he was along with the people who were with God’s Messenger. Then when they finished ‘Uwaimir said, “I shall have lied against her, Messenger of God, if I keep her,” and pronounced her divorce three times. God’s Messenger then said to the people, “Look, and if she bears a child which is black, and has very black eyes, large buttocks and fat legs, I cannot but imagine that ‘Uwaimir has spoken the truth about her; but if she bears a reddish child like the lizard with red spots (wahara), I cannot but imagine that ‘Uwaimir has lied against her.” She gave birth to a child like that described by God’s Messenger in declaring that ‘Uwaimir had spoken the truth, and afterwards its lineage was traced to its mother. \n\n(Bukhari and Muslim.)\n\n1. Some texts read as translated above; others use the third person, with reference to the family of the man and their revenge for killing him.\n2. Al-Qur'an 24:6."}},{"id":219,"idInBook":219,"chapterId":13,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَاعن بَين رجل وَامْرَأَته فانتقى مِنْ وَلَدِهَا فَفَرَّقَ بَيْنَهُمَا وَأَلْحَقَ الْوَلَدَ بِالْمَرْأَةِ. مُتَّفَقٌ عَلَيْهِ. وَفِي حَدِيثِهِ لَهُمَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَظَهُ وَذَكَّرَهُ وَأَخْبَرَهُ أَنَّ عَذَابَ الدُّنْيَا أَهْوَنُ مِنْ عَذَابِ الْآخِرَةِ ثُمَّ دَعَاهَا فَوَعَظَهَا وَذَكَّرَهَا وَأَخْبَرَهَا أَنَّ عَذَاب الدُّنْيَا أَهْون من عَذَاب الْآخِرَة","english":{"narrator":"","text":"Ibn ‘Umar said that the Prophet made a man and his wife invoke curses when the man disowned her child, and separated them and attributed the child to the woman. In his tradition transmitted by both of them it says that God's Messenger exhorted and admonished the man and informed him that punishment in this world is easier than that in the next. He then summoned the woman and exhorted and admonished her and told her that punishment in this world is easier than that in the next.\n\n(Bukhari and Muslim.)"}},{"id":220,"idInBook":220,"chapterId":13,"bookId":14,"arabic":"وَعَنْهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِلْمُتَلَاعِنَيْنِ: «حِسَابُكُمَا عَلَى اللَّهِ أَحَدُكُمَا كَاذِبٌ لَا سَبِيلَ لَكَ عَلَيْهَا» قَالَ: يَا رَسُولَ اللَّهِ مَالِي قَالَ: «لَا مَالَ لَكَ إِنْ كُنْتَ صَدَقْتَ عَلَيْهَا فَهُوَ بِمَا اسْتَحْلَلْتَ مِنْ فَرْجِهَا وَإِنْ كُنْتَ كَذَبْتَ عَلَيْهَا فَذَاكَ أَبْعَدُ وَأبْعد لَك مِنْهَا»","english":{"narrator":"","text":"He reported the Prophet as saying to two who were invoking curses regarding one another, “Your reckoning is in God’s hands, for one of you is lying.” He then told the man that he could not remarry her, whereupon he said, “Messenger of God, what about my property?”* He replied, “There is no property for you. If you have spoken the truth, it is the price of your having had the right to intercourse with her; and if you have lied against her, it is more remote still from you than she is.” \n* Referring to the dower be had paid.\n\n(Bukhari and Muslim.)."}},{"id":221,"idInBook":221,"chapterId":13,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ: أَنَّ هِلَالَ بْنَ أُمَيَّةَ قَذَفَ امْرَأَتَهُ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِشَرِيكِ بْنِ سَحْمَاءَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْبَيِّنَةَ أَوْ حَدًّا فِي ظَهْرِكَ» فَقَالَ: يَا رَسُولَ اللَّهِ إِذَا رَأَى أَحَدُنَا عَلَى امْرَأَتِهِ رَجُلًا يَنْطَلِقُ يَلْتَمِسُ الْبَيِّنَةَ؟ فَجَعَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «الْبَيِّنَةَ وَإِلَّا حَدٌّ فِي ظَهْرِكَ» فَقَالَ هِلَالٌ: وَالَّذِي بَعَثَكَ بِالْحَقِّ إِنِّي لَصَادِقٌ فَلْيُنْزِلَنَّ اللَّهُ مَا يُبَرِّئُ ظَهْرِي مِنَ الْحَدِّ فَنَزَلَ جِبْرِيلُ وَأنزل عَلَيْهِ: (وَالَّذين يرْمونَ أَزوَاجهم)\nفَقَرَأَ حَتَّى بَلَغَ (إِنْ كَانَ مِنَ الصَّادِقِينَ)\nفَجَاءَ هِلَالٌ فَشَهِدَ وَالنَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِنَّ اللَّهَ يَعْلَمُ أَنَّ أَحَدَكُمَا كَاذِبٌ فَهَلْ مِنْكُمَا تَائِبٌ؟» ثُمَّ قَامَتْ فَشَهِدَتْ فَلَمَّا كَانَتْ عِنْدَ الْخَامِسَةِ وَقَفُوهَا وَقَالُوا: إِنَّهَا مُوجِبَةٌ فَقَالَ ابْنُ عَبَّاسٍ: فَتَلَكَّأَتْ وَنَكَصَتْ حَتَّى ظَنَنَّا أَنَّهَا تَرْجِعُ ثُمَّ قَالَتْ: لَا أَفْضَحُ قَوْمِي سَائِرَ الْيَوْمِ فَمَضَتْ وَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَبْصِرُوهَا فَإِنْ جَاءَتْ بِهِ أَكْحَلَ الْعَيْنَيْنِ سَابِغَ الْأَلْيَتَيْنِ خَدَلَّجَ السَّاقِينَ فَهُوَ لِشَرِيكِ بْنِ سَحْمَاءَ» فَجَاءَتْ بِهِ كَذَلِكَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَوْلَا مَا مَضَى مِنْ كِتَابِ اللَّهِ لَكَانَ لِي وَلَهَا شَأْن» . رَوَاهُ البُخَارِيّ","english":{"narrator":"Ibn ‘Abbas said:","text":"Hilal b. Umayya accused his wife in the Prophet’s presence of having committed adultery with Sharik b. Sahma'. When the Prophet told him that he must produce evidence or receive punishment on his back, he said, “Messenger of God, when one of us sees a man having intercourse with his wife, must he go and seek evidence?” But the Prophet merely replied that he must produce evidence or receive punishment on his back. Hilal then said, “By Him who sent you with the truth, I am speaking truly. May God send down something which will free my back from punishment!” Then Gabriel descended and brought down to him, “And those who make charges against their spouses,” reciting till he reached, “if he is one of those who speak the truth” (Al-Qur’an 24:6-9).Then Hilal came and gave testimony and the Prophet was saying, “God knows that one of you is lying. Will one of you repent?” Then the woman got up and testified, but when she was about to do it a fifth time they stopped her and told her that it would be the deciding one. Ibn ‘Abbas told that she then hesitated and drew back, so that they thought she would renounce what she had said; but thereafter she said, “I shall not disgrace my people forever,” and went on with her declaration. The Prophet told them to look and see whether she gave birth to a child with eyes looking as if they had antimony in them, wide buttocks and fat legs, for if she did, Sharik b. Sahma' would be its father. Then when she gave birth to a child of that description the Prophet said, “If it were not for what has already been stated in God’s Book, I would have dealt severely with her.” \n\nBukhari transmitted it."}},{"id":222,"idInBook":222,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ سَعْدُ بْنُ عُبَادَةَ: لَوْ وَجَدْتُ مَعَ أَهْلِي رَجُلًا لَمْ أَمَسَّهُ حَتَّى آتِيَ بِأَرْبَعَةِ شُهَدَاءَ؟ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «نَعَمْ» قَالَ: كَلَّا وَالَّذِي بَعَثَكَ بِالْحَقِّ إِنْ كُنْتُ لَأُعَاجِلُهُ بِالسَّيْفِ قَبْلَ ذَلِكَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «اسْمَعُوا إِلَى مَا يَقُولُ سَيِّدُكُمْ إِنَّهُ لَغَيُورٌ وَأَنَا أَغْيَرُ مِنْهُ وَالله أغير مني» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Huraira told that Sa'd b. ‘Ubada asked, “If I were to find a man with my wife, should I not touch him before bringing four witnesses?” Then when God’s Messenger replied that that was so, he said, “By no means. I swear by Him who has sent you with the truth that I would take my sword to him before that.” God’s Messenger said, “Listen to what your chief says. He is jealous of his honour, but I am more jealous than he is and God is more jealous than I am.” \n\nMuslim transmitted it."}},{"id":223,"idInBook":223,"chapterId":13,"bookId":14,"arabic":"وَعَنِ الْمُغِيرَةَ قَالَ: قَالَ سَعْدُ بْنُ عُبَادَةَ: لَوْ رَأَيْتُ رَجُلًا مَعَ امْرَأَتِي لَضَرَبْتُهُ بِالسَّيْفِ غَيْرَ مُصْفِحٍ فَبَلَغَ ذَلِكَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «أَتَعْجَبُونَ مِنْ غَيْرَةِ سَعْدٍ؟ وَاللَّهِ لَأَنَا أَغْيَرُ مِنْهُ وَاللَّهُ أَغْيَرُ مِنِّي وَمِنْ أَجْلِ غَيْرَةِ اللَّهِ حَرَّمَ اللَّهُ الْفَوَاحِشَ مَا ظَهَرَ مِنْهَا وَمَا بَطَنَ وَلَا أَحَدَ أَحَبُّ إِلَيْهِ الْعُذْرُ مِنَ اللَّهِ مِنْ أَجْلِ ذَلِكَ بَعَثَ الْمُنْذِرِينَ وَالْمُبَشِّرِينَ وَلَا أَحَدَ أَحَبُّ إِلَيْهِ الْمِدْحَةُ مِنَ اللَّهِ وَمِنْ أَجْلِ ذَلِكَ وَعَدَ اللَّهُ الْجَنَّةَ»","english":{"narrator":"","text":"Al-Mughira told that Sa'd b 'Ubada said, “If I saw a man with my wife I would strike him with the sword, and not with the flat of it.” When God’s Messenger heard of that he said, “Are you surprised at Sa'd’s jealousy? I swear by God that I am more jealous than he is and that God is more jealous than I am. Because of God’s jealousy He has prohibited abominations both open and secret. No one is fonder of receiving an excuse than God, on which account He has sent warners and announcers of good news; and no one is fonder of praise than God, on which account God has promised paradise.” \n\n(Bukhari and Muslim.)"}},{"id":224,"idInBook":224,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عَلَيْهِ وَسلم: «إِن اللَّهَ تَعَالَى يَغَارُ وَإِنَّ الْمُؤْمِنَ يَغَارُ وَغَيْرَةُ اللَّهِ أَنْ لَا يَأْتِيَ الْمُؤْمِنُ مَا حَرَّمَ الله»","english":{"narrator":"","text":"Abu Huraira reported God’s Messenger as saying, “God most high is jealous of His honour, and the believer is jealous. God’s jealousy is to the effect that a believer should not commit what God has prohibited.” \n\n(Bukhari and Muslim.)"}},{"id":225,"idInBook":225,"chapterId":13,"bookId":14,"arabic":"وَعَنْهُ أَنَّ أَعْرَابِيًّا أَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: إنَّ امْرَأَتي ولدَتْ غُلَاما أسودَ وَإِنِّي نكرته فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «هَلْ لَكَ مِنْ إِبِلٍ؟» قَالَ: نَعَمْ قَالَ: «فَمَا أَلْوَانُهَا؟» قَالَ: حُمْرٌ قَالَ: «هَلْ فِيهَا مِنْ أَوْرَقَ؟» قَالَ: إِنَّ فِيهَا لَوُرْقًا قَالَ: «فَأَنَّى تُرَى ذَلِكَ جَاءَهَا؟» قَالَ: عِرْقٌ نَزَعَهَا. قَالَ: «فَلَعَلَّ هَذَا عِرْقٌ نَزَعَهُ» وَلَمْ يُرَخِّصْ لَهُ فِي الِانْتِفَاءِ مِنْهُ","english":{"narrator":"","text":"He told of a desert Arab who came to God’s Messenger and said, “My wife has given birth to a black son and I have disowned him.” God’s Messenger asked him whether he had any camels, and when he replied that he had, he asked what their colour was and was told that they were red. He asked if there was a dusky one among them, and was told that there were some. He asked how he thought that had come about, and was told that it was a strain to which they had reverted. Then saying that this was perhaps a strain to which the child had reverted, he did not permit him to disown him. \n\n(Bukhari and Muslim.)"}},{"id":226,"idInBook":226,"chapterId":13,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ قَالَتْ: كَانَ عُتْبَةُ بْنُ أَبِي وَقَّاصٍ عَهِدَ إِلَى أَخِيهِ سَعْدِ بْنِ أَبِي وَقَّاصٍ: أَنَّ ابْنَ وَلِيدَةِ زَمْعَةَ مِنِّي فَاقْبِضْهُ إِلَيْكَ فَلَمَّا كَانَ عَامُ الْفَتْحِ أَخَذَهُ سَعْدٌ فَقَالَ: إِنَّهُ ابْنُ أَخِي وَقَالَ عَبْدُ بْنُ زَمْعَةَ: أَخِي فَتَسَاوَقَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ سَعْدٌ: يَا رَسُولَ اللَّهِ إِنَّ أَخِي كَانَ عَهِدَ إِلَيَّ فِيهِ وَقَالَ عَبْدُ بْنُ زَمْعَةَ: أَخِي وَابْن وليدة أبي وُلِدَ على فرَاشه فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «هُوَ لَكَ يَا عَبْدُ بْنَ زَمْعَةَ الْوَلَدُ لِلْفِرَاشِ وَلِلْعَاهِرِ الْحَجَرُ» ثُمَّ قَالَ لِسَوْدَةَ بِنْتِ زَمْعَةَ: «احْتَجِبِي مِنْهُ» لِمَا رَأَى مِنْ شَبَهِهِ بِعُتْبَةَ فَمَا رَآهَا حَتَّى لَقِيَ اللَّهَ وَفِي رِوَايَةٍ: قَالَ: «هُوَ أَخُوكَ يَا عَبْدُ بْنَ زَمَعَةَ مِنْ أَجْلِ أَنَّهُ وُلِدَ عَلَى فِرَاشِ أَبِيهِ»","english":{"narrator":"","text":"‘A’isha said that ‘Utba b. Abu Waqqas enjoined his brother Sa'd b. Abu Waqqas that the son of Zam'a's slave girl was his, and told him to look after him. In the year of the Conquest Sa'd took him, saying he was his brother’s son, but ‘Abd b. Zam'a claimed him as his brother. They made a simultaneous plea to God’s Messenger, Sa‘d saying, “Messenger of God, my brother has enjoined me regarding him,” and ‘Abd b. Zam'a saying, \"He is my brother and the son of my father's slave girl, being born on his bed.” God’s Messenger then said, \"He belongs to you, ‘Abd b. Zam'a, for the child is attributed to the one on whose bed it is born, and the fornicator is deprived of any right.”1 He then told Sauda daughter of Zam'a to veil herself from him because of the resemblance to ‘Utba which he saw in him, and he did not see her till he went into God’s presence.2 In a version he said, “He is your brother, ‘Abd b. Zam'a because he was born on his father’s bed.”3 \n1. Al-hajar. This might alternatively mean that the fornicator is to be stoned.\n2. i.e., until he died.\n3. This explanatory addition does not occur in Masabih as-sunna.\n\n(Bukhari and Muslim.)"}},{"id":227,"idInBook":227,"chapterId":13,"bookId":14,"arabic":"وَعَنْهَا قَالَتْ: دَخَلَ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ يَوْمٍ وَهُوَ مَسْرُورٌ فَقَالَ: \n\" أَيْ عَائِشَةُ أَلَمْ تَرَيْ أَنَّ مُجَزِّزًا الْمُدْلِجِيَّ دَخَلَ فَلَمَّا رَأَى أُسَامَةَ وَزَيْدًا وَعَلَيْهِمَا قطيفةٌ قد غطيَّا رؤوسَهُما وَبَدَتْ أَقْدَامُهُمَا فَقَالَ: إِنَّ هَذِهِ الْأَقْدَامَ بَعْضُهَا من بعضٍ \"","english":{"narrator":"She said:","text":"One day God's Messenger visited me looking pleased and asked if I was not surprised to hear that Mujazziz al-Mudlijl1 had entered, and seeing Usama and Zaid2 with a rug over them covering their heads and letting their feet appear, said, “These feet are related.” \n\n(Bukhari and Muslim.)\n\n1. Members of the tribe of Mudlij were said to have a reputation for being able to trace relationship from physical features.\n2. Usama was Zaid's son."}},{"id":228,"idInBook":228,"chapterId":13,"bookId":14,"arabic":"وَعَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ وَأَبِي بَكْرَةَ قَالَا: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنِ ادَّعَى إِلَى غَيْرِ أَبِيهِ وَهُوَ يَعْلَمُ أَنَّهُ غَيْرُ أَبِيهِ فَالْجَنَّةُ عَلَيْهِ حرَام»","english":{"narrator":"","text":"Sa‘d b. Abu Waqqas and Abu Bakra reported God’s Messenger as saying, \"If anyone knowingly claims as father one who is not his father, paradise is forbidden to him.” \n\n(Bukhari and Muslim.)"}},{"id":229,"idInBook":229,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَرْغَبُوا عَنْ آبَائِكُمْ فَمَنْ رَغِبَ عَنْ أَبِيهِ فقد كفر»","english":{"narrator":"","text":"‘Abu Huraira reported God’s Messenger as saying, \"Do not turn against your fathers, for he who turns against his father has become an infidel.” \n\n(Bukhari and Muslim.)"}},{"id":230,"idInBook":230,"chapterId":13,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ أَنَّهُ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَمَّا نَزَلَتْ آيَةُ الْمُلَاعَنَةِ: «أَيُّمَا امْرَأَةٍ أَدْخَلَتْ عَلَى قَوْمٍ مَنْ لَيْسَ مِنْهُمْ فَلَيْسَتْ مِنَ اللَّهِ فِي شَيْءٍ وَلَنْ يُدْخِلَهَا اللَّهُ جَنَّتَهُ وَأَيُّمَا رَجُلٍ جَحَدَ وَلَدَهُ وَهُوَ يَنْظُرُ إِلَيْهِ احْتَجَبَ اللَّهُ مِنْهُ وفضَحَهُ على رؤوسِ الْخَلَائِقِ فِي الْأَوَّلِينَ وَالْآخِرِينَ» . رَوَاهُ أَبُو دَاوُدَ وَالنَّسَائِيّ والدارمي","english":{"narrator":"Abu Huraira told that he heard the Prophet say when the verse about invoking curses1 came down:","text":"\"Any woman who brings into a family one who does not belong to it can expect no mercy from God (or is no observer of God’s religion) and God will not bring her into His paradise; and God will veil Himself from any man who disowns his child when he looks at him, and shame him in the presence of all creatures, first and last.” \n\nAbu Dawud, Nasa'i and Darimi transmitted it.\n\n1. Al-Qur’an 24:6"}},{"id":231,"idInBook":231,"chapterId":13,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: جَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: إِن لِي امْرَأَةً لَا تَرُدُّ يَدَ لَامِسٍ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «طَلِّقْهَا» قَالَ: إِنِّي أُحِبُّها قَالَ: «فأمسِكْهَا إِذا» . رَوَاهُ أَبُو دَاوُدَ وَالنَّسَائِيُّ وَقَالَ النَّسَائِيُّ: رَفَعَهُ أَحَدُ الرُّوَاةِ إِلَى ابْنِ عَبَّاسٍ وَأَحَدُهُمْ لَمْ يرفعهُ قَالَ: وَهَذَا الحَدِيث لَيْسَ بِثَابِت","english":{"narrator":"","text":"Ibn ‘Abbas told of a man coming to the Prophet and saying, “I have a wife who rejects no one who wishes intercourse with her,” but when he told him to divorce her he replied that he loved her, so he told him that in that case he should keep her. \n\nAbu Dawud and Nasa’i transmitted it, Nasa’i saying that one of the transmitters traced it to Ibn ‘Abbas and that one did not, adding that this tradition is not well established."}},{"id":232,"idInBook":232,"chapterId":13,"bookId":14,"arabic":"وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قضى أَن كل مستحلق استحلق بَعْدَ أَبِيهِ الَّذِي يُدْعَى لَهُ ادَّعَاهُ وَرَثَتُهُ فَقَضَى أَنَّ كُلَّ مَنْ كَانَ مِنْ أَمَةٍ يملكهَا يَوْم أَصَابَهَا فقد لحق بِمن استحلقه وَلَيْسَ لَهُ مِمَّا قُسِمَ قَبْلَهُ مِنَ الْمِيرَاثِ شَيْءٌ وَمَا أَدْرَكَ مِنْ مِيرَاثٍ لَمْ يُقْسَمْ فَلَهُ نَصِيبُهُ وَلَا يَلْحَقُ إِذَا كَانَ أَبُوهُ الَّذِي يُدْعَى لَهُ أَنْكَرَهُ فَإِنْ كَانَ مِنْ أمَةٍ لم يَملِكْها أَو من حُرَّةٍ عَاهَرَ بِهَا فَإِنَّهُ لَا يَلْحَقُ بِهِ وَلَا يَرِثُ وَإِنْ كَانَ الَّذِي يُدْعَى لَهُ هُوَ الَّذِي ادَّعَاهُ فَهُوَ وَلَدُ زِنْيَةٍ مِنْ حُرَّةٍ كَانَ أَوْ أَمَةٍ. رَوَاهُ أَبُو دَاوُدَ","english":{"narrator":"‘Amr b. Shu'aib, on his father’s authority, told of his grandfather saying:","text":"The Prophet decided regarding one who is treated as a member of a family after the death of his father to whom he is attributed when the heirs say he is one of them, that if he is the child of a slave woman whom the father owned when he had intercourse with her he is included among those who seek his inclusion, but gets none of the inheritance which was previously divided;* he however gets his portion of the inheritance which has not already been divided, but if the father to whom he is attributed had disowned him he is not joined to the heirs. If he is the child of a slave woman whom the father did not possess or of a freewoman with whom he had illicit intercourse, he is not joined to the heirs and does not inherit even if the one to whom he is attributed is the one who claims paternity, for he is a child of fornication whether his mother was free or a slave. \n\nAbu Dawud transmitted it.\n\n*Mirqat 3:506 explains this as a reference to what had happened in the pre-Islamic period."}},{"id":233,"idInBook":233,"chapterId":13,"bookId":14,"arabic":"وَعَن جابرِ بنِ عتيكٍ أَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ الْغَيْرَةِ مَا يُحِبُّ اللَّهُ وَمِنْهَا مَا يُبْغِضُ اللَّهُ فَأَمَّا الَّتِي يُحِبُّهَا اللَّهُ فَالْغَيْرَةُ فِي الرِّيبَةِ وَأَمَّا الَّتِي يُبْغِضُهَا اللَّهُ فَالْغَيْرَةُ فِي غَيْرِ رِيبَةٍ وَإِنَّ مِنَ الْخُيَلَاءِ مَا يُبْغِضُ اللَّهُ وَمِنْهَا مَا يُحِبُّ اللَّهُ فَأَمَّا الْخُيَلَاءُ الَّتِي يُحِبُّ اللَّهُ فَاخْتِيَالُ الرَّجُلِ عِنْدَ الْقِتَالِ وَاخْتِيَالُهُ عِنْدَ الصَّدَقَةِ وَأَمَّا الَّتِي يُبْغِضُ اللَّهُ فَاخْتِيَالُهُ فِي الْفَخْرِ» وَفِي رِوَايَةٍ: «فِي الْبَغْيِ» . رَوَاهُ أَحْمَدُ وَأَبُو دَاوُدَ وَالنَّسَائِيُّ","english":{"narrator":"","text":"Jabir b. ‘Atik reported God’s prophet as saying, ‘‘There is jealousy which God loves and jealousy which God hates. That which He loves is jealousy regarding a matter of doubt, and that which He hates is jealousy regarding something which is not doubtful. There is pride which God hates and pride which God loves. That which He loves is a man’s pride when fighting and when giving sadaqa, and that which God hates is pride shown by boasting.” A version has “by oppression.” \n\nAhmad, Abu Dawud and Nasa’i transmitted it."}},{"id":234,"idInBook":234,"chapterId":13,"bookId":14,"arabic":"عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ: قَامَ رَجُلٌ فَقَالَ: يَا رَسُولَ اللَّهِ إِنَّ فَلَانًا ابْنِي عَاهَرْتُ بِأُمِّهِ فِي الْجَاهِلِيَّةِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا دِعْوَةَ فِي الْإِسْلَامِ ذَهَبَ أَمْرُ الْجَاهِلِيَّةِ الْوَلَدُ لِلْفِرَاشِ وَلِلْعَاهِرِ الْحَجَرُ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"‘Amr b. Shu'aib, on his father’s authority, said that his grandfather told of a man who got up and said, “Messenger of God, so and so is my son; I had illicit intercourse with his mother in the pre-Islamic period.” God’s Messenger replied, “There is no unlawful claiming of paternity in Islam. What was done in pre-Islamic times has been annulled. The child is attributed to the one on whose bed it is born, and the fornicator is deprived of any right.” \n\nAbu Dawud transmitted it."}},{"id":235,"idInBook":235,"chapterId":13,"bookId":14,"arabic":"وَعَنْهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" أَرْبَعٌ مِنَ النِّسَاءِ لَا مُلَاعَنَةَ بَيْنَهُنَّ: النَّصْرَانِيَّةُ تَحْتَ الْمُسْلِمِ وَالْيَهُودِيَّةُ تَحْتَ الْمُسْلِمِ وَالْحُرَّةُ تَحْتَ الْمَمْلُوكِ وَالْمَمْلُوكَةُ تَحْتَ الْحُرِّ \". رَوَاهُ ابْنُ مَاجَه","english":{"narrator":"He reported the Prophet as saying, “There are four types of women with whom there can be no cursing:","text":"* a Christian woman married to a Muslim, a Jewess married to a Muslim, a freewoman married to a slave, and a slave woman married to a freeman.” \n*That is the mutual invoking of curses with which this chapter deals.\n\nIbn Majah transmitted it."}},{"id":236,"idInBook":236,"chapterId":13,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ رَجُلًا حِينَ أَمَرَ الْمُتَلَاعِنَيْنِ أَنْ يَتَلَاعَنَا أَنْ يَضَعَ يَدَهُ عِنْدَ الْخَامِسَةِ عَلَى فِيهِ وَقَالَ: «إِنَّهَا مُوجِبَةٌ» . رَوَاهُ النَّسَائِيُّ","english":{"narrator":"","text":"Ibn ‘Abbas said that when the Prophet ordered a man and wife to invoke curses regarding one another, he ordered a man to put his hand on his mouth when he came to the fifth utterance, saying that it would be the deciding one.\n\n Nasa’i transmitted it."}},{"id":237,"idInBook":237,"chapterId":13,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ مِنْ عِنْدِهَا لَيْلًا قَالَتْ: فَغِرْتُ عَلَيْهِ فَجَاءَ فَرَأَى مَا أَصْنَعُ فَقَالَ: «مَا لَكِ يَا عَائِشَةُ أَغِرْتِ؟» فَقُلْتُ: وَمَا لِي؟ لَا يَغَارُ مِثْلِي عَلَى مِثْلِكَ؟ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَقَدْ جَاءَكِ شَيْطَانُكِ» قَالَتْ: يَا رَسُولَ اللَّهِ أَمْعِي شَيْطَانٌ؟ قَالَ: «نَعَمْ» قُلْتُ: وَمَعَكَ يَا رَسُولَ الله؟ قَالَ: «نعم وَلَكِن أعانني علَيهِ حَتَّى أسلَمَ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"‘A'isha said that once when God’s Messenger went out from her during the night she was jealous regarding him. Then when he came and saw what she was doing he said, “What is the matter with you, ‘A'isha? Are you jealous?” She replied, “Why should one like me not be jealous regarding one like you?” He said, “Your devil has come to you.” She asked, “Messenger of God, have I a devil?” He told her that she had, and when she asked him whether he had one he replied, “Yes, but God has helped me against him so that I may be safe.” \n\nMuslim transmitted it."}},{"id":238,"idInBook":238,"chapterId":13,"bookId":14,"arabic":"عَنْ أَبِي سَلَمَةَ عَنْ فَاطِمَةَ بِنْتِ قَيْسٍ: أَنَّ أَبَا عَمْرِو بْنَ حَفْصٍ طَلَّقَهَا الْبَتَّةَ وَهُوَ غَائِبٌ فَأَرْسَلَ إِلَيْهَا وَكِيْلُهُ الشَّعِيرَ فَسَخِطَتْهُ فَقَالَ: وَاللَّهِ مَا لَكِ عَلَيْنَا مِنْ شَيْءٍ فَجَاءَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرْتُ ذَلِكَ لَهُ فَقَالَ: «لَيْسَ لَكِ نَفَقَةٌ» فَأَمَرَهَا أَنْ تَعْتَدَّ فِي بَيْتِ أُمِّ شَرِيكٍ ثُمَّ قَالَ: «تِلْكِ امْرَأَةٌ يَغْشَاهَا أَصْحَابِي اعْتَدِّي عِنْدَ ابْنِ أُمِّ مَكْتُومٍ فَإِنَّهُ رَجُلٌ أَعْمَى تَضَعِينَ ثِيَابَكِ فَإِذَا حَلَلْتِ فَآذِنِينِي» . قَالَتْ: فَلَمَّا حَلَلْتُ ذَكَرْتُ لَهُ أَنَّ مُعَاوِيَةَ بْنَ أَبِي سُفْيَانَ وَأَبَا جَهْمٍ خَطَبَانِي فَقَالَ: «أَمَّا أَبُو الْجَهْمِ فَلَا يَضَعُ عَصَاهُ عَنْ عَاتِقِهِ وَأَمَّا مُعَاوِيَةُ فَصُعْلُوكٌ لَا مَالَ لَهُ انْكِحِي أُسَامَةَ بْنَ زَيْدٍ» فَكَرِهْتُهُ ثُمَّ قَالَ: «انْكِحِي أُسَامَةَ» فَنَكَحْتُهُ فَجَعَلَ اللَّهُ فِيهِ خَيْرًا وَاغْتَبَطْتُ وَفِي رِوَايَةٍ عَنْهَا: «فَأَمَّا أَبُو جَهْمٍ فَرَجُلٌ ضَرَّابٌ لِلنِّسَاءِ» . رَوَاهُ مُسْلِمٌ وَفِي رِوَايَةٍ: أَنَّ زَوْجَهَا طَلَّقَهَا ثَلَاثًا فَأَتَتِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «لَا نَفَقَةَ لَكِ إِلَّا أَنْ تَكُونِي حَامِلا»","english":{"narrator":"","text":"Abu Salama was told by Fatima daughter of Qais that Abu ‘Amr b. Hafs divorced her absolutely when he was away from home, and his agent sent her some barley. She was displeased with it, and when he said, “I swear by God that you have no claim on us,” she went to God’s Messenger and mentioned that to him. Saying that she was due no maintenance, he ordered her to spend the period before she could remarry in the house of Umm Sharik, but said afterwards, “That is a woman whom my companions visit; spend the period in the house of Ibn Umm Maktum, for he is blind and you can undress. Then when you are in a position to be remarried, tell me.\" She said that when she was in a position to remarry she mentioned to him that Mu'awiya b. Abu Sufyan and Abu Jahm had asked her in marriage, and he replied, “As for Abu Jahm, he does not put down his stick from his shoulder, and as for Mu'awiya, he is a poor man who has no property; marry Usama b. Zaid.\" She objected to him, but he said, “Marry Usama,\" so she married him, God prospered him, and she was envied. A version on her authority has, “As for Abu Jahm, he is a man who is given to beating women.\" In a version it says that her husband divorced her three times and that when she went to the Prophet he said, “You are due no maintenance unless you are pregnant.\"\n\nMuslim transmitted it."}},{"id":239,"idInBook":239,"chapterId":13,"bookId":14,"arabic":"وَعَن عائشةَ قَالَتْ: إِنَّ فَاطِمَةَ كَانَتْ فِي مَكَانٍ وَحِشٍ فَخِيفَ عَلَى نَاحِيَتِهَا فَلِذَلِكَ رَخَّصَ لَهَا النَّبِيُّ صلى الله عَلَيْهِ وَسلم تَعْنِي النُّقْلَةِ وَفِي رِوَايَةٍ: قَالَتْ: مَا لِفَاطِمَةَ؟ أَلَا تَتَّقِي اللَّهَ؟ تَعْنِي فِي قَوْلِهَا: لَا سُكْنَى وَلَا نَفَقَة. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"'A'isha said that Fatima was in a lonely place and fear was entertained regarding the district where she was, so the Prophet gave her permission, i.e., to remove. In a version she asked what was the matter with Fatima and whether she did not fear God, i.e., with reference to her saying that she had no place to live and no maintenance. \n\nBukhari transmitted it."}},{"id":240,"idInBook":240,"chapterId":13,"bookId":14,"arabic":"وَعَن سعيدِ بنِ المسيِّبِ قَالَ: إِنَّمَا نُقِلَتْ فَاطِمَةُ لِطُولِ لِسَانِهَا عَلَى أحمائِها. رَوَاهُ فِي شرح السّنة","english":{"narrator":"","text":"Sa'id b. al-Musayyib said that Fatima was removed simply because she had so much to say against her husband’s relatives. \n\nIt is transmitted in Sharh as-sunna."}},{"id":241,"idInBook":241,"chapterId":13,"bookId":14,"arabic":"وَعَن جابرٍ قَالَ: طُلِّقَتْ خَالَتِي ثَلَاثًا فَأَرَادَتْ أَنْ تَجُدَّ نَخْلَهَا فَزَجَرَهَا رَجُلٌ أَنْ تَخْرُجَ فَأَتَتِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «بَلَى فَجُدِّي نَخْلَكِ فَإِنَّهُ عَسَى أَنْ تَصَّدَّقِي أَوْ تَفْعَلِي مَعْرُوفا» . رَوَاهُ مُسلم","english":{"narrator":"Jabir said:","text":"My maternal aunt was divorced by three utterances of the divorce and wanted to cut down fruit from her palm-trees, but a man forbade her to go out, so she went to the Prophet and he said, “Certainly, cut down fruit from your palm-trees, for perhaps you may give sadaqa or do an act of kindness.” \n\nMuslim transmitted it."}},{"id":242,"idInBook":242,"chapterId":13,"bookId":14,"arabic":"وَعَنِ الْمِسْوَرِ بْنِ مَخْرَمَةَ: أَنَّ سُبَيْعَةَ الْأَسْلَمِيَّةَ نُفِسَتْ بَعْدَ وَفَاةِ زَوْجِهَا بِلَيَالٍ فَجَاءَتِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاسْتَأْذَنَتْهُ أَنْ تَنْكِحَ فأذِنَ لَهَا فنكحت. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Al-Miswar b. Makhrama said that some nights after her husband’s death Subai’a al-Aslamiya gave birth to a child. Then she went to the Prophet and asked permission to marry. He gave her permission and she married. \n\nBukhari transmitted it."}},{"id":243,"idInBook":243,"chapterId":13,"bookId":14,"arabic":"وَعَن أُمِّ سلمةَ قَالَتْ: جَاءَتِ امْرَأَةٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ: يَا رَسُولَ اللَّهِ إِنَّ ابْنَتِي تُوُفِّيَ عَنْهَا زَوْجُهَا وَقَدِ اشْتَكَتْ عَيْنُهَا أَفَنَكْحُلُهَا؟ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا» مَرَّتَيْنِ أَوْ ثَلَاثًا كُلُّ ذَلِكَ يَقُولُ: «لَا» قَالَ: «إِنَّمَا هِيَ أَرْبَعَةُ أَشْهُرٍ وعشرٌ وَقد كَانَت إِحْدَاهُنَّ فِي الجاهليَّةِ تَرْمِي بِالْبَعْرَةِ عَلَى رَأْسِ الْحَوْلِ»","english":{"narrator":"Umm Salama told that a woman came to the Prophet and said:","text":"\"Messenger of God, my daughter’s husband has died and her eye is troubling her, so may we apply collyrium to it?” He said “No” twice or thrice, saying only “No” all the time. Then he said, “It is only four months and ten days, whereas in the pre-Islamic period none of you threw away the piece of dung till a year had passed.”* \n* The reference is to a pre-Islamic custom by which a widow threw a piece of dung when her idda period came to an end. Cf. Lane, Lexicon and Taj al-'arus; Mirqat, 3:513 f.\n  \n(Bukhari and Muslim.)"}},{"id":244,"idInBook":244,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أُمِّ حَبِيبَةَ وَزَيْنَبَ بِنْتِ جحش عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يَحِلُّ لِامْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ أَنْ تُحِدَّ عَلَى مَيِّتٍ فَوْقَ ثَلَاثِ لَيَالٍ إِلَّا عَلَى زَوْجٍ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا»","english":{"narrator":"","text":"Umm Habiba and Zainab daughter of Jahsh reported God’s Messenger as saying, “It is not lawful for a woman who believes in God and the last day to observe mourning for one who has died more than three nights, except for the four months and ten days in the case of a husband.” \n\n(Bukhari and Muslim.)"}},{"id":245,"idInBook":245,"chapterId":13,"bookId":14,"arabic":"وَعَن أُمِّ عطيَّةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا تُحِدُّ امْرَأَةٌ عَلَى مَيِّتٍ فَوْقَ ثَلَاثٍ إِلَّا عَلَى زَوْجٍ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا وَلَا تَلْبَسُ ثَوْبًا مَصْبُوغًا إِلَّا ثَوْبَ عَصْبٍ وَلَا تكتحِلُ وَلَا تَمَسُّ طِيبًا إِلَّا إِذَا طَهُرَتْ نُبْذَةً مِنْ قُسْطٍ أَوْ أَظْفَارٍ» . مُتَّفَقٌ عَلَيْهِ. وَزَادَ أَبُو دَاوُدَ: «وَلَا تختضب»","english":{"narrator":"","text":"Umm 'Atiya reported God’? Messenger as saying, “A woman must not observe mourning for one who has died more than three nights, except for the four months and ten days in the case of a husband, and she must not wear a dyed garment except one of the type made of dyed yarn,1 or apply collyrium, or touch perfume except for a little costus or azfar2 when she has been purified after her courses.” \n    1. ‘Asb. This word is applied to a type of Yemen garment which was made of cloth which\nwas dyed before being woven.\n    2. A certain odoriferous substance resembling finger-nails, used in incense.\n\n(Bukhari and Muslim.) Abu Dawud added, “or apply henna.”"}},{"id":246,"idInBook":246,"chapterId":13,"bookId":14,"arabic":"عَن زَيْنَب بنت كَعْب: أَنَّ الْفُرَيْعَةَ بِنْتَ مَالِكِ بْنِ سِنَانٍ وَهِيَ أُخْتُ أَبِي سَعِيدٍ الْخُدْرِيِّ أَخْبَرَتْهَا أَنَّهَا جَاءَتْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَسْأَلُهُ أَنْ تَرْجِعَ إِلَى أَهْلِهَا فِي بَنِي خُدْرَةَ فَإِنَّ زَوْجَهَا خَرَجَ فِي طَلَبِ أَعْبُدٍ لَهُ أَبَقُوا فَقَتَلُوهُ قَالَتْ: فَسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ أَرْجِعَ إِلَى أَهْلِي فَإِنَّ زَوْجِي لَمْ يَتْرُكْنِي فِي مَنْزِلٍ يَمْلِكُهُ وَلَا نَفَقَةٍ فَقَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «نَعَمْ» . فَانْصَرَفْتُ حَتَّى إِذَا كُنْتُ فِي الْحُجْرَةِ أَوْ فِي الْمَسْجِدِ دَعَانِي فَقَالَ: «امْكُثِي فِي بَيْتِكِ حَتَّى يَبْلُغَ الْكِتَابُ أَجَلَهُ» . قَالَتْ: فَأَعْتَدَدْتُ فِيهِ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا. رَوَاهُ مَالِكٌ وَالتِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالنَّسَائِيُّ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ","english":{"narrator":"","text":"Zainab daughter of Ka‘b said that al-Furai‘a daughter of Malik b. Sinan and sister of Abu Sa'id al-Khudri informed her that she went to God’s Messenger and asked to be allowed to return to her people among the B. Khudra, for her husband had gone out in search of some slaves of his who had run away and they had killed him. She said she asked God's Messenger to be allowed to return to her people, for her husband had not left her in a house which belonged to him, nor had he left any maintenance and that when he agreed she went away, but when she was in the courtyard (or in the mosque) he called her and said, “Stay in your house till the prescribed period is ended.” She said that she observed the period in it for four months and ten days. \n\nMalik, Tirmidhi, Abu Dawud, Nasa’i,. Ibn Majah and Darimi transmitted it."}},{"id":247,"idInBook":247,"chapterId":13,"bookId":14,"arabic":"وَعَن أُمِّ سلمَةَ قَالَتْ: دَخَلَ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ تُوُفِّيَ أَبُو سَلَمَةَ وَقَدْ جعلتُ عليَّ صَبِراً فَقَالَ: «مَا هَذَا يَا أُمَّ سَلَمَةَ؟» . قُلْتُ: إِنَّمَا هُوَ صَبِرٌ لَيْسَ فِيهِ طِيبٌ فَقَالَ: «إِنَّهُ يَشُبُّ الْوَجْهَ فَلَا تَجْعَلِيهِ إِلَّا بِاللَّيْلِ وَتَنْزِعِيهِ بِالنَّهَارِ وَلَا تَمْتَشِطِي بِالطِّيبِ وَلَا بِالْحِنَّاءِ فَإِنَّهُ خضاب» . رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ","english":{"narrator":"Umm Salama said:","text":"God’s Messenger came to visit me when Abu Salama died, and I had put the juice of aloes on myself. He asked me what it was, and I told him it was only the juice of aloes and contained no perfume, so he said, “It gives the face a glow, so apply it only at night and remove it in the daytime, and do not comb yourself with scent or henna, for it is a dye.” I asked God’s Messenger what I should use when combing myself, and he told me to use lote-tree leaves and smear my head copiously with them.\n \nAbu Dawud and Nasa’i transmitted it."}},{"id":248,"idInBook":248,"chapterId":13,"bookId":14,"arabic":"وَعَنْهَا عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «المُتوَفّى عَنْهَا زوجُها لَا تَلبسُ المُعَصفَرَ مِنَ الثِّيَابِ وَلَا الْمُمَشَّقَةَ وَلَا الْحُلِيَّ وَلَا تَخْتَضِبُ وَلَا تَكْتَحِلُ» . رَوَاهُ أَبُو دَاوُدَ وَالنَّسَائِيُّ","english":{"narrator":"","text":"She reported the Prophet as saying, “One whose husband has died must not wear garments dyed with saffron or red clay, or jewels, and she must not apply henna or collyrium. \n\nAbu Dawud and Nasa'i transmitted it."}},{"id":249,"idInBook":249,"chapterId":13,"bookId":14,"arabic":"عَن سُليمانَ بنِ يَسارٍ: أَنَّ الْأَحْوَصَ هَلَكَ بِالشَّامِ حِينَ دَخَلَتِ امْرَأَتُهُ فِي الدَّمِ مِنَ الْحَيْضَةِ الثَّالِثَةِ وَقَدْ كَانَ طَلَّقَهَا فَكَتَبَ مُعَاوِيَةُ بْنُ أَبِي سُفْيَانَ إِلَى زَيْدِ بْنِ ثَابِتٍ يَسْأَلُهُ عَنْ ذَلِكَ فَكَتَبَ إِلَيْهِ زِيدٌ: إِنَّهَا إِذَا دَخَلَتْ فِي الدَّمِ مِنَ الْحَيْضَةِ الثَّالِثَةِ فَقَدْ بَرِئَتْ مِنْهُ وَبَرِئَ مِنْهَا لَا يرِثُها وَلَا ترِثُه. رَوَاهُ مَالك","english":{"narrator":"","text":"Sulaiman b. Yasar told that al-Ahwas died in Syria when his wife whom he had divorced was at the beginning of her third menstrual period, as Mu'awiya b. Abu Sufyan wrote to Zaid b. Thabit asking him about that. Zaid wrote in reply that when she began her third period she was free from him and he was free from her; he could not inherit from her or she from him. \n\nMalik transmitted it."}},{"id":250,"idInBook":250,"chapterId":13,"bookId":14,"arabic":"وَعَنْ سَعِيدِ بْنِ الْمُسَيَّبِ قَالَ: قَالَ عُمَرُ بْنُ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ أَيُّمَا امْرَأَةٍ طُلِّقَتْ فَحَاضَتْ حَيْضَةً أَوْ حَيْضَتَيْنِ ثُمَّ رُفِعَتْهَا حيضتُها فإنَّها تنتظِرُ تسعةَ أشهرٍ فإنْ بانَ لَهَا حَمْلٌ فَذَلِكَ وَإِلَّا اعْتَدَّتْ بَعْدَ التِّسْعَةِ الْأَشْهَرِ ثلاثةَ أشهرٍ ثمَّ حلَّتْ. رَوَاهُ مَالك","english":{"narrator":"","text":"Sa'id b. al-Musayyib reported ‘Umar b. al-Khattab as saying, “If any woman is divorced and has one or two menstrual periods then stops menstruating she must wait nine months, and if it is apparent that she is pregnant the rules concerning that are applied; otherwise she must observe a period of three months after the nine months are ended, after which she may lawfully remarry. \n\nMalik transmitted it."}},{"id":251,"idInBook":251,"chapterId":13,"bookId":14,"arabic":"عَنْ أَبِي الدَّرْدَاءِ قَالَ: مَرَّ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِامْرَأَةٍ مُجِحٍّ فَسَأَلَ عَنْهَا فَقَالُوا: أَمَةٌ لِفُلَانٍ قَالَ: «أَيُلِمُّ بِهَا؟» قَالُوا: نَعَمْ. قَالَ: «لَقَدْ هَمَمْتُ أَنْ أَلْعَنَهُ لَعْنًا يَدْخُلُ مَعَهُ فِي قَبْرِهِ كَيْفَ يَسْتَخْدِمُهُ وَهُوَ لَا يَحِلُّ لَهُ؟ أَمْ كَيْفَ يُوَرِّثُهُ وَهُوَ لَا يحلُّ لَهُ؟» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu-d Darda’ said that when the Prophet passed a woman who was near the time to be delivered of a child he asked about her and was told that she was so and so’s slave woman. He asked whether he was having sexual intercourse with her, and when he was told that he was, he said, “I am inclined to invoke a curse on him which will enter his grave with him. How can he take the child into his service when that is not lawful for him, or how can he make it an heir when that is not lawful for him?”* \n* The reason for the curse is said to be because he did wait the prescribed period after acquiring the woman and so could not know whether the child was his or not. If he treated the child as a slave he might be enslaving his own son, and if he treated it as an heir he might be doing this to one who was not his son.\n\nMuslim transmitted it."}},{"id":252,"idInBook":252,"chapterId":13,"bookId":14,"arabic":"عَن أبي سعيدٍ الخدريِّ رَفْعَهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي سَبَايَا أَوْطَاسٍ: «لَا تُوطَأُ حَامِلٌ حَتَّى تَضَعَ وَلَا غَيْرُ ذَاتِ حَمْلٍ حَتَّى تَحِيضَ حَيْضَةً» . رَوَاهُ أَحْمَدُ وَأَبُو دَاوُدَ وَالدَّارِمِيُّ","english":{"narrator":"","text":"Abu Sa'id al-Khurdi traced to the Prophet the following statement regarding the captives taken at Autas, “There must be no intercourse with a pregnant woman till she gives birth to her child, or with one who is not pregnant till she has had one menstrual period.” \n\nAhmad, Abu Dawud and Darimi transmitted it."}},{"id":253,"idInBook":253,"chapterId":13,"bookId":14,"arabic":"وَعَنْ رُوَيْفِعِ بْنِ ثَابِتٍ الْأَنْصَارِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم يَوْم حُنَيْنٍ: «لَا يَحِلُّ لِامْرِئٍ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ أَنْ يسْقِي مَاء زَرْعَ غَيْرِهِ» يَعْنِي إِتْيَانَ الْحُبَالَى «وَلَا يَحِلُّ لِامْرِئٍ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ أَنْ يَقَعَ عَلَى امْرَأَةٍ مِنَ السَّبْيِ حَتَّى يَسْتَبْرِئَهَا وَلَا يَحِلُّ لِامْرِئٍ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ أَنْ يَبِيعَ مَغْنَمًا حَتَى يُقَسَّمَ» . رَوَاهُ أَبُو دَاوُدَ وَرَوَاهُ التِّرْمِذِيّ إِلَى قَوْله «زرع غَيره»","english":{"narrator":"","text":"Ruwaifi' b. Thabit. reported God’s Messenger as saying on the day of Hunain, “It is not lawful for a man who believes in God and the last day to water what another has sown with his water (meaning intercourse with women who are pregnant); it is not lawful for a man who believes in God and the last day to have intercourse with a captive woman till she has had a menstrual period; and it is not lawful for a man who believes in God and the last day to sell spoil till it is divided.” \n\nAbu Dawud transmitted it, and Tirmidhi transmitted it up to “what another has sown with his water.”"}},{"id":254,"idInBook":254,"chapterId":13,"bookId":14,"arabic":"عَن مَالِكٍ قَالَ: بَلَغَنِي أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَأْمُرُ بِاسْتِبْرَاءِ الْإِمَاءِ بِحَيْضَةٍ إِنْ كَانَتْ مِمَّنْ تَحِيضُ وَثَلَاثَةِ أَشْهُرٍ إِنْ كَانَت مِمَّن تحيض وَينْهى عَن سقِِي مَاء الْغَيْر","english":{"narrator":"","text":"Malik said he heard that God's Messenger used to command that no intercourse be had with slave women till they had had a menstrual period if they were of the number who had such periods, or till three months had passed in the case of those who did not, and forbid watering another man's water.\n\nRazin transmitted."}},{"id":255,"idInBook":255,"chapterId":13,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ: أَنَّهُ قَالَ: إِذَا وُهِبَتْ الْوَلِيدَةُ الَّتِي تُوطَأُ أَوْ بِيعَتْ أَوْ أُعْتِقَتْ فَلْتَسْتَبْرِئْ رَحِمَهَا بِحَيْضَةٍ وَلَا تُسْتَبْرَئُ الْعَذْرَاءُ. رَوَاهُمَا رزين","english":{"narrator":"","text":"Ibn ‘Umar said that when a girl with whom intercourse might be had was given as a present, or sold, or set free, it was necessary to wait till she had had a menstrual period, but that this was unnecessary in the case of a virgin. \n\nRazin transmitted."}},{"id":256,"idInBook":256,"chapterId":13,"bookId":14,"arabic":"عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: إِنَّ هندا بنت عتبَة قَالَت: يَا رَسُول الله إِن أَبَا سُفْيَان رجل شحيح وَلَيْسَ يعطيني مَا يَكْفِينِي وَوَلَدي إِلَّا مَا أخذت مِنْهُ وَهُوَ يعلم فَقَالَ: «خذي مَا يَكْفِيك وولدك بِالْمَعْرُوفِ»","english":{"narrator":"","text":"‘A’isha told that Hind daughter of ‘Utba said, “Messenger of God, Abu Sufyan is a niggardly man who does not give me and my son enough; except what I take from him without his knowledge.” He replied, “Take what is enough for you and your son to the extent recognised by the law.”* \n* Bil ma’roof.This is what is generally recognised as reasonable. The amount would vary according to the circumstances of the people.\n(Bukhari and Muslim.)"}},{"id":257,"idInBook":257,"chapterId":13,"bookId":14,"arabic":"وَعَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «إِذا أعْطى الله أحدكُم خيرا فليبدأ بِنَفسِهِ وَأهل بَيته» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Jabir b. Samura reported God’s Messenger as saying, “When God prospers any of you he should spend first on himself and his family.” \n\nMuslim transmitted it."}},{"id":258,"idInBook":258,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عَلَيْهِ وَسلم: «للمملوك طَعَامه وَكسوته وَلَا يُكَلف من الْعَمَل إِلَّا مَا يُطيق» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Huraira reported God’s Messenger as saying, “A slave is entitled to his food and clothing, and he should have imposed on him only such work as he is capable of doing.” \n\nMuslim transmitted it."}},{"id":259,"idInBook":259,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أَبِي ذَرٍّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِخْوَانُكُمْ جَعَلَهُمُ اللَّهُ تَحْتَ أَيْدِيكُمْ فَمَنْ جَعَلَ اللَّهُ أَخَاهُ تَحْتَ يَدَيْهِ فَلْيُطْعِمْهُ مِمَّا يَأْكُلُ وَلْيُلْبِسْهُ مِمَّا يَلْبَسُ وَلَا يُكَلِّفْهُ مِنَ الْعَمَلِ مَا يَغْلِبُهُ فَإِنْ كَلَّفَهُ مَا يَغْلِبُهُ فَلْيُعِنْهُ عَلَيْهِ»","english":{"narrator":"","text":"Abu Dharr reported God’s Messenger as saying, “God has put your brethren under your authority, so he who has his brother put under his authority by God must feed him from what he eats, clothe him from what he wears, and not impose on him work which is too much for him, but if he does so he must help him with it.” \n\n(Bukhari and Muslim.)"}},{"id":260,"idInBook":260,"chapterId":13,"bookId":14,"arabic":"وَعَن عبد الله بن عَمْرو جَاءَهُ قَهْرَمَانٌ لَهُ فَقَالَ لَهُ: أَعْطَيْتَ الرَّقِيقَ قُوتَهُمْ؟ قَالَ: لَا قَالَ: فَانْطَلِقْ فَأَعْطِهِمْ فَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «كَفَى بِالرَّجُلِ إِثْمًا أَنْ يَحْبِسَ عَمَّنْ يَمْلِكُ قُوتَهُ» . وَفِي رِوَايَةٍ: «كَفَى بِالْمَرْءِ إِثْمًا أَنْ يُضَيِّعَ مَنْ يَقُوتُ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"‘Abdallah b. ‘Amr told that a steward of his came to him and he asked him whether he had given the slaves their food. When he replied that he had not, he told him to go and give it to them, for God’s Messenger had said, “It is a serious enough fault for a man to withhold his food from one whom he possesses.” A version has, “It is a serious enough fault for a man to destroy one he is bound to sustain.”\n\nMuslim transmitted it."}},{"id":261,"idInBook":261,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا صَنَعَ لِأَحَدِكُمْ خَادِمُهُ طَعَامَهُ ثُمَّ جَاءَهُ بِهِ وَقَدْ وَلِيَ حره ودخانه فليقعده مَعَه فَليَأْكُل وَإِن كَانَ الطَّعَامُ مَشْفُوهًا قَلِيلًا فَلْيَضَعْ فِي يَدِهِ مِنْهُ أَكلَة أَو أكلتين» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Huraira reported God’s Messenger as saying, “When anyone’s servant prepares his food and brings it to him after being near its heat and smoke, he should make him sit down with him and eat; but if the company is large* and the food small in quantity he should put one or two mouthfuls of it in his hand.” \n* Mashfuhan qalil'an. The word mashfuhan is applied either to food which is small in quantity, or to food which is being partaken of by a number of people. The latter meaning obviously applies here as it is followed by qalil (small in quantity); but some people understand mashfuh here as 'small in quantity’ followed by qalil expressing the same meaning.\n\nMuslim transmitted it."}},{"id":262,"idInBook":262,"chapterId":13,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ الْعَبْدَ إِذَا نَصَحَ لِسَيِّدِهِ وَأَحْسَنَ عِبَادَةَ اللَّهِ فَلَهُ أَجْرُهُ مرَّتَيْنِ»","english":{"narrator":"","text":"‘Abdallah b. ‘Umar reported God’s Messenger as saying, “When a slave acts sincerely towards his master and worships God well, he has a double reward.” \n\n(Bukhari and Muslim.)"}},{"id":263,"idInBook":263,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «نِعِمَّا لِلْمَمْلُوكِ أَنْ يَتَوَفَّاهُ اللَّهُ بِحُسْنِ عِبَادَةِ رَبِّهِ وَطَاعَة سَيّده نعما لَهُ»","english":{"narrator":"","text":"Abu Huraira reported God's Messenger as saying, “How excellent it is for a slave to be taken in death by God when worshipping his Lord well and obeying his master! How excellent it is for him!” \n\n(Bukhari and Muslim.)"}},{"id":264,"idInBook":264,"chapterId":13,"bookId":14,"arabic":"وَعَنْ جَرِيرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا أَبَقَ الْعَبْدُ لَمْ تُقْبَلْ لَهُ صَلَاةٌ» . وَفِي رِوَايَةٍ عَنْهُ قَالَ: «أَيّمَا عبد أبق فقد بَرِئت مِنْهُ الذِّمَّةُ» . وَفِي رِوَايَةٍ عَنْهُ قَالَ: «أَيُّمَا عَبْدٍ أَبَقَ مِنْ مَوَالِيهِ فَقَدْ كَفَرَ حَتَّى يَرْجِعَ إِلَيْهِم» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Jarir reported God’s Messenger as saying, “When a slave runs away his prayer is not accepted.” In a version on his authority he said, “If any slave runs away protection does not apply to him.” In another version on his authority he said, “If any slave runs away from his masters he has become an infidel till he returns to them.” \n\nMuslim transmitted it."}},{"id":265,"idInBook":265,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: سَمِعْتُ أَبَا الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنْ قَذَفَ مَمْلُوكَهُ وَهُوَ بَرِيءٌ مِمَّا قَالَ جُلِدَ يَوْمَ الْقِيَامَةِ إِلَّا أَنْ يَكُونَ كَمَا قَالَ»","english":{"narrator":"","text":"Abu Huraira told that he heard Abul Qasim (i.e. the Prophet) say, “If any one reviles his slave when he is innocent of what he said, he will be beaten on the day of resurrection, unless it is as he said.” \n\n(Bukhari and Muslim.)"}},{"id":266,"idInBook":266,"chapterId":13,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنْ ضَرَبَ غُلَامًا لَهُ حَدًّا لَمْ يَأْتِهِ أَوْ لَطَمَهُ فَإِن كَفَّارَته أَن يعتقهُ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Ibn ‘Umar told that he heard God’s Messenger say, “If anyone beats a servant for an offence he did not commit, or slaps him, the atonement due from him is to set him free.” \n\nMuslim transmitted it."}},{"id":267,"idInBook":267,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أَبِي مَسْعُودٍ الْأَنْصَارِيِّ قَالَ: كُنْتُ أَضْرِبُ غُلَامًا لِي فَسَمِعْتُ مِنْ خَلْفِي صَوْتًا: «اعْلَمْ أَبَا مَسْعُودٍ لَلَّهُ أَقْدَرُ عَلَيْكَ مِنْكَ عَلَيْهِ» فَالْتَفَتُّ فَإِذَا هُوَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ: يَا رَسُولَ اللَّهِ هُوَ حُرٌّ لِوَجْهِ اللَّهِ فَقَالَ: «أَمَا لَوْ لَمْ تَفْعَلْ لَلَفَحَتْكَ النَّارُ أَوْ لَمَسَّتْكَ النَّارُ» . رَوَاهُ مُسلم","english":{"narrator":"Abu Mas'ud al-Ansari said:","text":"When I was beatinig a servant of mine I heard a voice behind me saying, “Know, Abu Mas'ud, that God has more power over you than you have over him.” On turning round and seeing that it was God’s Messenger, I said, “Messenger of God, he is free for God’s sake.” He replied, “If you had not done it the fire would have burned you,” or, “the fire would have touched you.” \n\nMuslim transmitted it."}},{"id":268,"idInBook":268,"chapterId":13,"bookId":14,"arabic":"عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ: أَنَّ رَجُلًا أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: إِنَّ لِي مَالًا وَإِنَّ وَالِدِي يَحْتَاجُ إِلَى مَالِي قَالَ: «أَنْتَ وَمَالُكَ لِوَالِدِكَ إِنَّ أَوْلَادَكُمْ مِنْ أَطْيَبِ كَسْبِكُمْ كُلُوا مِنْ كَسْبِ أَوْلَادِكُمْ» . رَوَاهُ أَبُو دَاوُدَ وَابْنُ ماجة","english":{"narrator":"","text":"‘Amr b. Shu'aib, on his father’s authority, said his grandfather told of a man coming to the Prophet and saying, “I have property and my father is in need of my property.” He replied, “You and your property belong to your father. Your children are among the finest things you acquire. Eat of what your children acquire.” \n\nAbu Dawud and Ibn Majah transmitted it."}},{"id":269,"idInBook":269,"chapterId":13,"bookId":14,"arabic":"وَعنهُ وَعَن أَبِيهِ عَنْ جَدِّهِ: أَنَّ رَجُلًا أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: إِنِّي فَقِيرٌ لَيْسَ لِي شَيْءٌ وَلِي يَتِيمٌ فَقَالَ: «كُلْ مِنْ مَالِ يَتِيمِكَ غَيْرَ مُسْرِفٍ وَلَا مُبَادِرٍ وَلَا مُتَأَثِّلٍ» . رَوَاهُ أَبُو دَاوُدَ وَالنَّسَائِيُّ وَابْنُ مَاجَه","english":{"narrator":"","text":"On his father’s authority he said his grandfather told of a man coming to the Prophet and saying, “I am poor with no possessions and I have an orphan to care for.” He replied, “Eat from your orphan’s property, provided you are not extravagant, or take anything before you need it, or store up any of it.” \n\nAbu Dawud, Nasa’i and Ibn Majah transmitted it."}},{"id":270,"idInBook":270,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أُمِّ سَلَمَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ يَقُولُ فِي مَرَضِهِ: «الصَّلَاةَ وَمَا مَلَكَتْ أَيْمَانُكُمْ» . رَوَاهُ الْبَيْهَقِيُّ فِي شعب الْإِيمَان\nوَرَوَى أَحْمَدُ وَأَبُو دَاوُدَ عَنْ عَلِيٍّ نَحْوَهُ","english":{"narrator":"","text":"Umm Salama told that the Prophet was saying during his illness, “Maintain the prayer and care for your slaves.” \n\nBaihaqi transmitted it in Shu'ab al-iman, and Ahmad and Abu Dawud transmitted something similar on the authority of ‘Ali."}},{"id":271,"idInBook":271,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أَبِي بَكْرٍ الصِّدِّيقِ رَضِيَ اللَّهُ عَنْهُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يَدْخُلُ الْجَنَّةَ سَيِّئُ الْمَلَكَةِ» . رَوَاهُ التِّرْمِذِيُّ وَابْن مَاجَه","english":{"narrator":"","text":"Abu Bakr as-Siddiq reported the Prophet as saying, “One who treats badly those under his authority will not enter paradise.” \n\nTirmidhi and Ibn Majah transmitted it."}},{"id":272,"idInBook":272,"chapterId":13,"bookId":14,"arabic":"وَعَنْ رَافِعِ بْنِ مَكِيثٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «حُسْنُ الْمَلَكَةِ يُمْنٌ وَسُوءُ الْخُلُقِ شُؤْمٌ» . رَوَاهُ أَبُو دَاوُدَ وَلَمْ أَرَ فِي غَيْرِ الْمَصَابِيحِ مَا زَادَ عَلَيْهِ فيهِ منْ قولِهِ: «والصَّدَقةُ تمنَعُ مِيتةَ السُّوءِ والبِرُّ زيادةٌ فِي العُمُرِ»","english":{"narrator":"","text":"Rafi‘ b. Makith reported the Prophet as saying, “Treating those under one’s authority well produces prosperity, but an evil nature produces evil fortune.” \n\nAbu Dawud transmitted it, but only in al-Masabih have I seen the additional words, “Sadaqa guards against an evil type of death and kindness lengthens life.”"}},{"id":273,"idInBook":273,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا ضَرَبَ أَحَدُكُمْ خَادِمَهُ فَذَكَرَ اللَّهَ فَارْفَعُوا أَيْدِيَكُمْ» . رَوَاهُ التِّرْمِذِيُّ وَالْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَانِ لَكِنْ عِنْدَهُ «فَلْيُمْسِكْ» بدل «فارفعوا أَيْدِيكُم»","english":{"narrator":"","text":"Abu Sa'id reported God’s Messenger as saying, “When one of you beats his servant and he makes mention of God, you must stop beating him.” \n\nTirmidhi and Baihaqi, in Shu'ab al-iman, transmitted it, but the latter has, “he should stop” instead of “you must stop beating him.”"}},{"id":274,"idInBook":274,"chapterId":13,"bookId":14,"arabic":"وَعَن أبي أيوبَ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنْ فَرَّقَ بَيْنَ وَالِدَةٍ وَوَلَدِهَا فَرَّقَ اللَّهُ بَيْنَهُ وَبَيْنَ أَحِبَّتِهِ يَوْمَ الْقِيَامَةِ» . رَوَاهُ التِّرْمِذِيّ والدارمي","english":{"narrator":"","text":"Abu Ayyub told of hearing God’s Messenger say, “If anyone separates a mother from her child, God will separate him from his friends on the day of resurrection.” \n\nTirmidhi and Darimi transmitted it."}},{"id":275,"idInBook":275,"chapterId":13,"bookId":14,"arabic":"وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ: وَهَبَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غلامين أَخَوَيْنِ فَبعث أَحدهمَا فَقَالَ لي رَسُول صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَا عَلِيُّ مَا فَعَلَ غُلَامُكَ؟» فَأَخْبَرْتُهُ. فَقَالَ: «رُدُّهُ رُدُّهُ» . رَوَاهُ التِّرْمِذِيّ وَابْن مَاجَه","english":{"narrator":"‘Ali said:","text":"God’s Messenger presented me with two youths who were brothers, and when I sold one of them God’s Messenger asked me, “What has happened to your young man, ‘Ali?” When I told him he said, “Get him back, get him back.” \n\nTirmidhi and Ibn Majah transmitted it."}},{"id":276,"idInBook":276,"chapterId":13,"bookId":14,"arabic":"وَعَنْهُ أَنَّهُ فَرَّقَ بَيْنَ جَارِيَةٍ وَوَلَدِهَا فَنَهَاهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ذَلِكَ فردَّ البَيعَ. رَوَاهُ أَبُو دَاوُد مُنْقَطِعًا","english":{"narrator":"","text":"He said he separated a slave girl from her child, but when the Prophet forbade him to do that he cancelled the transaction. \n\nAbu Dawud transmitted it with a break in the isnad."}},{"id":277,"idInBook":277,"chapterId":13,"bookId":14,"arabic":"وَعَنْ جَابِرٌ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" ثَلَاثٌ مَنْ كُنَّ فِيهِ يَسَّرَ اللَّهُ حَتْفَهُ وَأَدْخَلَهُ جَنَّتَهُ: رِفْقٌ بِالضَّعِيفِ وَشَفَقَةٌ عَلَى الْوَالِدَيْنِ وَإِحْسَانٌ إِلَى الْمَمْلُوكِ \". رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ غَرِيبٌ","english":{"narrator":"Jabir reported the Prophet as saying, “If anyone possesses three characteristics God will give him an easy death and bring him into His paradise:","text":"gentleness towards the weak, affection towards parents, and kindness to slaves.” \n\nTirmidhi transmitted it, saying this is a gharib tradition."}},{"id":278,"idInBook":278,"chapterId":13,"bookId":14,"arabic":"أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم وَهَبَ لِعَلِيٍّ غُلَامًا فَقَالَ: «لَا تَضْرِبْهُ فَإِنِّي نُهِيتُ عَنْ ضَرْبِ أَهْلِ الصَّلَاةِ وَقَدْ رَأَيْتُهُ يُصَلِّي» . هَذَا لفظ المصابيح","english":{"narrator":"","text":"Abu Umama told that God’s Messenger gave ‘Ali a youth and said, “Do not beat him, for I have been prohibited from beating people who observe the prayer, and I have seen him praying.” \n\nThis is the wording in al-Masabih."}},{"id":279,"idInBook":279,"chapterId":13,"bookId":14,"arabic":"وَفِي «الْمُجْتَبَى» لِلدَّارَقُطْنِيِّ: أَنَّ عُمَرَ بْنَ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ قَالَ: نَهَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ضَرْبِ الْمُصَلِّينَ","english":{"narrator":"","text":"In al-Mujtaba by Daraqutni ‘Umar b. al-Khattab is reported as saying, “God’s Messenger forbade us to beat people who observe the prayers.”"}},{"id":280,"idInBook":280,"chapterId":13,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: جَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: يَا رَسُولَ اللَّهِ كم نَعْفُو عَنِ الْخَادِمِ؟ فَسَكَتَ ثُمَّ أَعَادَ عَلَيْهِ الْكَلَامَ فصمتَ فلمَّا كانتِ الثَّالثةُ قَالَ: «اعفُوا عَنْهُ كُلَّ يَوْمٍ سَبْعِينَ مَرَّةً» . رَوَاهُ أَبُو دَاوُد\nوَرَوَاهُ التِّرْمِذِيُّ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو","english":{"narrator":"","text":"‘Abdallah b. ‘Umar told that a man came to the Prophet and said, “Messenger of God, how often shall I forgive a servant?” He gave no reply, so the man repeated what he had said, but he still kept silence. When he asked a third time he replied, “Forgive him (The verb is in the plural) seventy times daily.”\n \nAbu Dawud transmitted it, but Tirmidhi transmitted it from 'Abdallah b. ‘Amr."}},{"id":281,"idInBook":281,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أَبِي ذَرٍّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ لَاءَمَكُمْ مِنْ مَمْلُوكِيكُمْ فَأَطْعِمُوهُ مِمَّا تَأْكُلُونَ وَاكْسُوهُ مِمَّا تَكْسُونَ وَمَنْ لَا يُلَائِمُكُمْ مِنْهُمْ فَبِيعُوهُ وَلَا تُعَذِّبُوا خَلَقَ اللَّهِ» . رَوَاهُ أَحْمد وَأَبُو دَاوُد","english":{"narrator":"","text":"Abu Dharr reported God’s Messenger as saying, “Feed those of your slaves who please you from what you eat and clothe them from what you clothe yourselves, but sell those who do not please you and do not punish God’s creatures.” \n\nAhmad and Abu Dawud transmitted it."}},{"id":282,"idInBook":282,"chapterId":13,"bookId":14,"arabic":"وَعَن سهلِ بنِ الحَنظلِيَّةِ قَالَ: مَرَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِبَعِيرٍ قَدْ لَحِقَ ظَهْرُهُ بِبَطْنِهِ فَقَالَ: «اتَّقُوا اللَّهَ فِي هَذِهِ الْبَهَائِمِ الْمُعْجَمَةِ فَارْكَبُوهَا صَالِحَة واترُكوها صَالِحَة» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Sahl b. al-Hanzaliya told of God’s Messenger coming upon an emaciated camel and saying, “Fear God regarding these dumb animals. Ride them when they are in good condition and let them free when they are in good condition.” \n\nAbu Dawud transmitted it."}},{"id":283,"idInBook":283,"chapterId":13,"bookId":14,"arabic":"عَنِ ابْنِ عَبَّاسٍ قَالَ: لَمَّا نَزَلَ قَوْلُهُ تَعَالَى (وَلَا تَقْرَبُوا مَالَ الْيَتِيمِ إِلَّا بِالَّتِي هِيَ أحسن)\nوَقَوْلُهُ تَعَالَى: (إِنَّ الَّذِينَ يَأْكُلُونَ أَمْوَالَ الْيَتَامَى ظُلْمًا)\nالْآيَةَ انْطَلَقَ مَنْ كَانَ عِنْدَهُ يَتِيمٌ فَعَزَلَ طَعَامه من طَعَامَهُ وَشَرَابَهُ مِنْ شَرَابِهِ فَإِذَا فَضَلَ مِنْ طَعَامِ الْيَتِيمِ وَشَرَابِهِ شَيْءٌ حُبِسَ لَهُ حَتَّى يَأْكُلَهُ أَوْ يَفْسُدَ فَاشْتَدَّ ذَلِكَ عَلَيْهِمْ فَذَكَرُوا ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَنْزَلَ اللَّهُ تَعَالَى: (وَيَسْأَلُونَكَ عَنِ الْيَتَامَى قُلْ: إصْلَاح لَهُم خير وَإِن تخالطوهم فإخوانكم)\nفَخَلَطُوا طَعَامَهُمْ بِطَعَامِهِمْ وَشَرَابَهُمْ بِشَرَابِهِمْ. رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ","english":{"narrator":"Ibn ‘Abbas said:","text":"When the words of God most high came down, “Do not come near an orphan’s property except to improve it,” (Al-Qur’an 6:152) and “Those who devour unjustly the property of orphans. . .” (Al-Qur’an 4:10) those who were in charge of an orphan went and separated their food and drink from his, and if any of the orphan’s food or drink was left over they kept it for him until he ate it or it went bad. Finding that a burden, they mentioned the matter to God’s Messenger, and God most high sent down, “And they ask you about orphans. Say, to set things right for them is good, and if you intermix with them they are your brethren” (Al-Qur’an 2:220). They then mixed their food and their drink with theirs. \n\nAbu Dawud and Nasa'i transmitted it."}},{"id":284,"idInBook":284,"chapterId":13,"bookId":14,"arabic":"وَعَن أبي مُوسَى قَالَ: لَعَنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ فَرَّقَ بَيْنَ الْوَالِدِ وَوَلَدِهِ وَبَيْنَ الْأَخِ وَبَيْنَ أَخِيهِ. رَوَاهُ ابْنُ مَاجَهْ وَالدَّارَقُطْنِيُّ","english":{"narrator":"","text":"Abu Musa said that God's Messenger cursed those who separated a parent from his child and a brother from his brother. \n\nIbn Majah and Daraqutni transmitted it."}},{"id":285,"idInBook":285,"chapterId":13,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أُتِيَ بِالسَّبْيِ أَعْطَى أَهْلَ الْبَيْتِ جَمِيعًا كَرَاهِيَةَ أَنْ يفرق بَينهم. رَوَاهُ ابْن مَاجَه","english":{"narrator":"","text":"‘Abdallah b. Mas'ud said that when captives were brought to the Prophet he gave families together through dislike of separating them. \n\nIbn Majah transmitted it."}},{"id":286,"idInBook":286,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أَلَا أُنَبِّئُكُمْ بِشِرَارِكُمُ؟ الَّذِي يَأْكُلُ وَحْدَهُ وَيَجْلِدُ عَبْدَهُ وَيَمْنَعُ رِفْدَهُ» . رَوَاهُ رزين","english":{"narrator":"","text":"Abu Huraira reported God’s Messenger as saying, “Let me tell you who your evil ones are. They are those who eat alone, beat their slaves, and withhold their help.” \n\nRazin transmitted it."}},{"id":287,"idInBook":287,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أَبِي بَكْرٍ الصِّدِّيقِ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَدْخُلُ الْجَنَّةَ سَيِّئُ الْمَلَكَةِ» . قَالُوا: يَا رَسُولَ اللَّهِ أَلَيْسَ أَخْبَرْتَنَا أَنَّ هَذِهِ الْأُمَّةَ أَكْثَرُ الْأُمَمِ مَمْلُوكِينَ وَيَتَامَى؟ قَالَ: «نَعَمْ فَأَكْرِمُوهُمْ كَكَرَامَةِ أَوْلَادِكُمْ وَأَطْعِمُوهُمْ مِمَّا تَأْكُلُونَ» . قَالُوا: فَمَا تنفعنا الدُّنْيَا؟ قَالَ: «فَرَسٌ تَرْتَبِطُهُ تُقَاتِلُ عَلَيْهِ فِي سَبِيلِ اللَّهِ وَمَمْلُوكٌ يَكْفِيكَ فَإِذَا صَلَّى فَهُوَ أَخُوكَ» . رَوَاهُ ابْنُ مَاجَهْ","english":{"narrator":"","text":"Abu Bakr as-Siddiq reported God’s Messenger as saying, “One who treats badly those under his authority will not enter paradise.” He was asked whether he had not told them that this people had more slaves and orphans than any other, and replied, “Yes, so treat them as generously as you treat your children and give them food out of what you eat.” They then asked what benefit they got out of the world, and he replied, “A horse which you equip to fight on it in God’s path, and a slave who serves you sufficiently; and when he prays he is your brother.” \n\nIbn Majah transmittted it."}},{"id":288,"idInBook":288,"chapterId":13,"bookId":14,"arabic":"عَنِ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: عُرِضْتُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ أُحُدٍ وَأَنَا ابْنُ أَرْبَعَ عَشْرَةَ سَنَةً فَرَدَّنِي ثُمَّ عُرِضْتُ عَلَيْهِ عَامَ الْخَنْدَقِ وَأَنَا ابْنُ خَمْسَ عَشْرَةَ سَنَةً فَأَجَازَنِي فَقَالَ عُمَرُ بْنُ عَبْدِ الْعَزِيزِ: هَذَا فَرْقُ مَا بَين الْمُقَاتلَة والذرية","english":{"narrator":"Ibn ‘Umar said:","text":"I was brought before God’s Messenger in the year of Uhud when I was fourteen and he sent me back. Then I was brought before him in the year of the Trench when I was fifteen and he gave me permission to fight.* ‘Umar b. ‘Abd al-‘Aziz said this represents the difference between fighting men and children. \n* Ajazani. It may be translated as above or it may mean “he gave me a fighting man's permission”.\n(Bukhari and Muslim.)"}},{"id":289,"idInBook":289,"chapterId":13,"bookId":14,"arabic":"وَعَنِ الْبَرَاءِ بْنِ عَازِبٍ قَالَ: صَالَحَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْحُدَيْبِيَةِ عَلَى ثَلَاثَةِ أَشْيَاءَ: عَلَى أَنَّ مَنْ أَتَاهُ مِنَ الْمُشْرِكِينَ رَدَّهُ إِلَيْهِمْ وَمَنْ أَتَاهُمْ مِنَ الْمُسْلِمِينَ لَمْ يَرُدُّوهُ وَعَلَى أَنْ يَدْخُلَهَا مِنْ قَابِلٍ وَيُقِيمَ بِهَا ثَلَاثَةَ أَيَّامٍ فَلَمَّا دَخَلَهَا وَمَضَى الْأَجَلُ خَرَجَ فَتَبِعَتْهُ ابْنَةُ حَمْزَةَ تُنَادِي: يَا عَمِّ يَا عَمِّ فَتَنَاوَلَهَا عَلِيٌّ فَأَخَذَ بِيَدِهَا فَاخْتَصَمَ فِيهَا عَلِيٌّ وَزَيْدٌ وَجَعْفَرٌ قَالَ عَلِيٌّ: أَنَا أَخَذْتُهَا وَهِيَ بِنْتُ عَمِّي. وَقَالَ جَعْفَرٌ: بِنْتُ عَمِّي وَخَالَتُهَا تَحْتِي وَقَالَ زَيْدٌ: بِنْتُ أَخِي فَقَضَى بِهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِخَالَتِهَا وَقَالَ: «الْخَالَةُ بِمَنْزِلَةِ الْأُمِّ» . وَقَالَ لَعَلِيٍّ: «أَنْتَ مِنِّي وَأَنَا مِنْكَ» وَقَالَ لِجَعْفَرٍ: «أَشْبَهْتَ خَلْقِي وَخُلُقِي» . وَقَالَ لزيد: «أَنْت أخونا ومولانا»","english":{"narrator":"Al-Bara’ b. ‘Azib said the Prophet made peace on the occasion of al-Hudaibiya on three conditions:","text":"that if any of the polytheists came to him he should send them back to them; that if any of the Muslims went to them they should not send them back; and that he should be allowed to enter  the following year and stay in it for three days. When he entered it and the period had passed he went out, and Hamza’s daughter followed him calling, “Uncle, uncle.” ‘Ali took her and held her by the hand, and ‘Ali, Zaid and Ja'far disputed about her. ‘Ali said, “I have taken her, and she is the daughter of my paternal uncle.” Ja'far said, “She is the daughter of my paternal uncle and her maternal aunt is my wife.” Zaid said, “She is my brother’s daughter.” The Prophet then gave decision about her in favour of her maternal aunt, saying, “The maternal aunt is in the position of the mother.” To ‘Ali he said, “You pertain to me and I pertain to you;” to Ja'far, “You resemble my form and nature;” and to Zaid, “You are our brother and client.”\n \n(Bukhari and Muslim.)"}},{"id":290,"idInBook":290,"chapterId":13,"bookId":14,"arabic":"وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ عَبْدِ اللَّهِ بْنِ عَمْرٍو: أَنَّ امْرَأَةً قَالَتْ: يَا رَسُولَ اللَّهِ إِنَّ ابْنِي هَذَا كَانَ بَطْنِي لَهُ وِعَاءً وَثَدْيِي لَهُ سِقَاءً وَحِجْرِي لَهُ حِوَاءً وَإِنَّ أَبَاهُ طَلَّقَنِي وَأَرَادَ أَنْ يَنْزِعَهُ مِنِّي فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَنْتِ أَحَقُّ بِهِ مَا لم تنكحي» . رَوَاهُ أَحْمد وَأَبُو دَاوُد","english":{"narrator":"","text":"‘Amr b. Shu'aib, on his father’s authority, said his grandfather,‘Abdallah b. ‘Amr, told of a woman who said, “Messenger of God, my womb was a vessel to this son of mine, my breasts a water-skin for him, and my lap a guard for him, yet his father has divorced me and wants to take him away from me.” God’s Messenger replied, “You have more right to him as long as you do not marry.” \n\nAhmad and Abu Dawud transmitted it."}},{"id":291,"idInBook":291,"chapterId":13,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيَّرَ غُلَامًا بَيْنَ أَبِيهِ وَأمه. رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Abu Huraira said God’s Messenger gave a boy a choice between his father and his mother. \n\nTirmidhi transmitted it."}},{"id":292,"idInBook":292,"chapterId":13,"bookId":14,"arabic":"وَعنهُ قَالَ: جَاءَتِ امْرَأَةٌ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ: إِنَّ زَوْجِي يُرِيدُ أَنْ يَذْهَبَ بِابْنِي وَقَدْ سَقَانِي وَنَفَعَنِي فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «هَذَا أَبُوكَ وَهَذِهِ أُمُّكَ فَخُذْ بِيَدِ أَيِّهِمَا شِئْتَ» . فَأَخَذَ بِيَدِ أُمِّهِ فَانْطَلَقَتْ بِهِ. رَوَاهُ أَبُو دَاوُدَ وَالنَّسَائِيُّ وَالدَّارِمِيُّ","english":{"narrator":"","text":"He told of a woman who came to God's Messenger and said, “My husband wants to take away my son, and he has provided drink and other benefits for me.” The Prophet said, “This is your father and this is your mother, so take whichever of them you wish by the hand.” He took his mother’s hand and she went off with him. \n\nAbu Dawud, Nasa'i and Darimi transmitted.it."}},{"id":293,"idInBook":293,"chapterId":13,"bookId":14,"arabic":"عَنْ هِلَالِ بْنِ أُسَامَةَ عَنْ أَبِي مَيْمُونَةَ سُلَيْمَانَ مَوْلًى لِأَهْلِ الْمَدِينَةِ قَالَ: بَيْنَمَا أَنَا جَالِسٌ مَعَ أَبِي هُرَيْرَةَ جَاءَتْهُ امْرَأَةٌ فَارِسِيَّةٌ مَعَهَا ابْنٌ لَهَا وَقَدْ طَلَّقَهَا زَوْجُهَا فَادَّعَيَاهُ فَرَطَنَتْ لَهُ تَقُولُ: يَا أَبَا هُرَيْرَةَ زَوْجِي يُرِيدُ أَنْ يَذْهَبَ بِابْنِي. فَقَالَ أَبُو هُرَيْرَةَ: اسْتهمَا رَطَنَ لَهَا بِذَلِكَ. فَجَاءَ زَوْجُهَا وَقَالَ: مَنْ يُحَاقُّنِي فِي ابْنِي؟ فَقَالَ أَبُو هُرَيْرَةَ: اللَّهُمَّ إِنِّي لَا أَقُولُ هَذَا إِلَّا أَنِّي كُنْتُ قَاعِدًا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَتَتْهُ امْرَأَةٌ فَقَالَتْ: يَا رَسُولَ اللَّهِ إِنَّ زَوْجِي يُرِيدُ أَنْ يَذْهَبَ بِابْنِي وَقَدْ نَفَعَنِي وَسَقَانِي مِنْ بِئْرِ أَبِي عِنَبَةَ وَعِنْدَ النَّسَائِيِّ: مِنْ عَذْبِ الْمَاءُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «اسْتَهِمَا عَلَيْهِ» . فَقَالَ زَوْجُهَا مَنْ يُحَاقُّنِي فِي وَلَدِي؟ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «هَذَا أَبُوكَ وَهَذِهِ أُمُّكَ فَخُذْ بِيَدِ أَيِّهِمَا شِئْتَ» فَأَخَذَ بيد أمه. رَوَاهُ أَبُو دَاوُد. وَالنَّسَائِيّ لكنه ذكر الْمسند. وَرَوَاهُ الدَّارمِيّ عَن هِلَال بن أُسَامَة","english":{"narrator":"Hilal b. Usama quoted Abu Maimuna Sulaiman,* client of the people of Medina, as saying:","text":"While I was sitting with Abu Huraira a Persian woman came, to him along with a son of hers. She had been divorced by her husband and they both claimed him. She addressed him in foreign speech telling him that her husband wished to take her son away, and Abu Huraira told them to cast lots for him, saying that to her in foreign speech. Then her husband came and asked who was disputing with him about his son, and Abu Huraira assured him in God's name that the only reason why he said what he had said was because once when he was sitting with God’s Messenger a woman came to him and said, “Messenger of God, my husband wants to take away my son, and he had benefited me and drawn water for me from the well of Abu ‘Inaba.” (Nasa’i has “from sweet water.”) God’s Messenger replied, “Cast lots for him.” Her husband asked, “Who is disputing with me about my son?” and God’s Messenger said, “This is your father and this is your mother, so take whichever of them you wish by the hand,” and he took his mother’s hand. \n* Mirqat, iii, 536 says that while Sulaiman appears in all texts of the Mishkat, the correct form is Salman. Abu Dawud, Talaq, 35 (in the 2-vol. edn. Cairo, 1348 A.H.) has Salma (or Sulma). See further Ibn Hajar, Tahdhib, xii, 253.\n\nAbu Dawud and Nasa’i transmitted it, but Nasa’i mentioned the version which was traced back to the Prophet. Darimi transmitted it on the authority of Hilal b. Usama."}}],"chapter":{"id":13,"bookId":14,"arabic":"كتاب النكاح","english":"Marriage"}}