{"metadata":{"length":24,"arabic":{"title":"مشكاة المصابيح","author":"الإمام الكاتب التبريزي","introduction":"كتاب العتق"},"english":{"title":"Mishkat al-Masabih","author":"Al-Khatib Al-Tabrizi","introduction":"Emancipation"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":14,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَعْتَقَ رَقَبَةً مُسْلِمَةً أَعْتَقَ اللَّهُ بِكُلِّ عُضْوٍ مِنْهُ عُضْوًا مِنَ النَّارِ حَتَّى فَرْجَهُ بِفَرْجِهِ»","english":{"narrator":"","text":"Abu Huraira reported God's Messenger as saying, \"If anyone emancipates a Muslim slave, God will set free from hell a member of the body for every member of his, even his private parts for his.\" \n\n(Bukhari and Muslim.)"}},{"id":2,"idInBook":2,"chapterId":14,"bookId":14,"arabic":"وَعَنْ أَبِي ذَرٍّ قَالَ: سَأَلْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أَيُّ الْعَمَلِ أَفْضَلُ؟ قَالَ: «إِيمَانٌ بِاللَّهِ وَجِهَادٌ فِي سَبِيلِهِ» قَالَ: قُلْتُ: فَأَيُّ الرِّقَابِ أَفْضَلُ؟ قَالَ: «أَغْلَاهَا ثَمَنًا وَأَنْفَسُهَا عِنْدَ أَهْلِهَا» . قُلْتُ: فَإِنْ لَمْ أَفْعَلْ؟ قَالَ: «تُعِينُ صَانِعًا أَوْ تَصْنَعُ لِأَخْرَقَ» . قُلْتُ: فَإِنْ لَمْ أَفْعَلْ؟ قَالَ: «تَدَعُ النَّاسَ مِنَ الشَّرِّ فَإِنَّهَا صَدَقَةٌ تَصَدَّقُ بهَا على نَفسك»","english":{"narrator":"","text":"Abu Dharr said he asked the Prophet what action was most excellent, and he replied, \"Faith in God and jihad in His path.\" He then asked which slaves were most excellent 1 and he replied. “Those whose price is highest and who are held in most esteem by their people.\" He asked what he should do if unable to act accordingly 2 and he replied, \"You should assist a workman, or work for one who is unskilled.\" He asked what he should do if unable to act accordingly and he replied, \"Do no harm to others 3 for that is sadaqa you bestow on yourself.\" \n\nBukhari and Muslim.\n\n1. i.e. for the purpose of emancipating them.\n2. The Arabic is fa-in lam af'al which is somewhat vague. It most probably means he is asking what he should do if unable to emancipate a slave of such quality.\n3. This is an accepted meaning of the Arabic tada'u ‘un-nas min ash-sharr. Another possible meaning is to leave people alone because of their evil."}},{"id":3,"idInBook":3,"chapterId":14,"bookId":14,"arabic":"عَن الْبَراء بن عَازِب قَالَ: جَاءَ أَعْرَابِيٌّ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: عَلِّمْنِي عَمَلًا يُدْخِلُنِي الْجَنَّةَ قَالَ: «لَئِنْ كُنْتَ أَقْصَرْتَ الْخُطْبَةَ لَقَدْ أَعْرَضْتَ الْمَسْأَلَةَ أَعْتِقِ النَّسَمَةَ وَفك الرَّقَبَة» . قَالَ: أَو ليسَا وَاحِدًا؟ قَالَ: \n\" لَا عِتْقُ النَّسَمَةِ: أَنْ تَفَرَّدَ بِعِتْقِهَا وَفَكُّ الرَّقَبَةِ: أَنْ تُعِينَ فِي ثَمَنِهَا وَالْمِنْحَةَ: الْوَكُوفَ وَالْفَيْءَ عَلَى ذِي الرَّحِمِ الظَّالِمِ فَإِنْ لَمْ تُطِقْ ذَلِكَ فَأَطْعِمِ الْجَائِعَ وَاسْقِ الظَّمْآنَ وَأْمُرْ بِالْمَعْرُوفِ وَانْهَ عَنِ الْمُنْكَرِ فَإِنْ لم تطق فَكُفَّ لِسَانَكَ إِلَّا مِنْ خَيْرٍ \". رَوَاهُ الْبَيْهَقِيُّ فِي شعب الْإِيمَان","english":{"narrator":"","text":"Al-Bara’ b. ‘Azib told of a desert Arab who came to the Prophet and said, \"Teach me an action which will bring me into paradise.” He replied, \"You have asked a large question in few words. Emancipate, a man and set free a slave.\" He asked if the two were not the same thing, and he replied, \"No; emancipating a man is doing it by yourself, and setting free a slave is contributing towards his price. You must also lend for milking a she-camel which has much milk and be well disposed towards a relative who does wrong. If you cannot do that, feed the hungry, give drink to the thirsty, recommend what is reputable and forbid what is disreputable. And if you cannot do that, restrain your tongue from everything but what is good.” \n\nBaihaqi transmitted it in Shu'ab al-iman."}},{"id":4,"idInBook":4,"chapterId":14,"bookId":14,"arabic":"وَعَن عَمْرو بن عبسة أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ بَنَى مَسْجِدًا لِيُذْكَرَ اللَّهُ فِيهِ بُنِيَ لَهُ بَيْتٌ فِي الْجَنَّةِ وَمَنْ أَعْتَقَ نَفْسًا مُسْلِمَةً كَانَتْ فِدْيَتَهُ مِنْ جَهَنَّمَ. وَمَنْ شَابَ شَيْبَةً فِي سَبِيلِ اللَّهِ كَانَتْ لَهُ نُورًا يَوْم الْقِيَامَة» . رَوَاهُ فِي شرح السّنة","english":{"narrator":"","text":"‘Amr b. ‘Abasa reported the Prophet as saying, “If anyone builds a mosque that God may be mentioned in it, a house will be built for him in paradise; if anyone emancipates a Muslim, that will be his ransom from jahannam; if anyone develops a grey hair while in 'God’s path, it will be a light for him on the day of resurrection.” \n\nIt is transmitted in Sharh as-sunna."}},{"id":5,"idInBook":5,"chapterId":14,"bookId":14,"arabic":"عَن الغريف بن عَيَّاش الديلمي قَالَ: أَتَيْنَا وَاثِلَة بن الْأَسْقَع فَقُلْنَا: حَدِّثْنَا حَدِيثًا لَيْسَ فِيهِ زِيَادَةٌ وَلَا نُقْصَانٌ فَغَضِبَ وَقَالَ: إِنَّ أَحَدَكُمْ لَيَقْرَأُ وَمُصْحَفُهُ مُعَلَّقٌ فِي بَيْتِهِ فَيَزِيدُ وَيَنْقُصُ فَقُلْنَا: إِنَّمَا أَرَدْنَا حَدِيثًا سَمِعْتَهُ مِنَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسلم فَقَالَ: أَتَيْنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي صَاحِبٍ لَنَا أَوْجَبَ يَعْنِي النَّارَ بِالْقَتْلِ فَقَالَ: «أعتقوا عَنهُ بِعِتْق الله بِكُل عُضْو مِنْهُ عُضْو أَمنه من النَّار» . رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ","english":{"narrator":"l-Gharif b. ‘Ayyash ad-Dailami 1 said:","text":"We went to Wathila b. al-Asqa‘ and said, “Tell us a tradition which has no addition or omission.” He replied angrily, “One of you recites when his copy of the Qur’an is hung up in his house, and he makes additions and omissions.” We declared that all we meant was a tradition he had heard from the Prophet, and he said they had gone to God’s Messenger about a friend of theirs who deserved (i.e., hell) for murder, 2 and he replied, “If you emancipate a slave on his behalf God will set free from hell a member of the body for every member of his.” \nAbu Dawud and Nasa’i transmitted it.\n\n1. Mirqat, iii, 540 gives al-Gharif ad-Dailami but says it should correctly be Ibn ad-Dailami. It adds that Hakim in his Mustadrak says al-Gharif was a laqab of ‘Abdallah b. ad-Dailami, and that in Jami'-al-usul the name is given as al-Gharif b. ‘Ayyash ad-Dailami. This is the form in the Damascus edn. of the Mishkat, the one used in the translation above. It is also given by Ibn Hajar, Tahdhib, viii, 245.\n2. Mirqat, iii, 541 suggests that the reference may be to someone who had killed a man unintentionally."}},{"id":6,"idInBook":6,"chapterId":14,"bookId":14,"arabic":"وَعَن سَمُرَةَ بْنِ جُنْدُبٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَفْضَلُ الصَّدَقَةِ الشَّفَاعَةُ بِهَا تُفَكُّ الرَّقَبَة» . رَوَاهُ الْبَيْهَقِيّ فِي «شعب الْإِيمَان»","english":{"narrator":"","text":"Samura b. Jundub reported God’s Messenger as saying, “The most excellent sadaqa is intercession for which a slave is set free.” \n\nBaihaqi transmitted it in Shu'ab al-iman."}},{"id":7,"idInBook":7,"chapterId":14,"bookId":14,"arabic":"عَنِ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَعْتَقَ شِرْكًا لَهُ فِي عَبْدٍ وَكَانَ لَهُ مَالٌ يَبْلُغُ ثَمَنَ الْعَبْدِ قُوِّمَ الْعَبْدُ قِيمَةَ عَدْلٍ فَأُعْطِيَ شُرَكَاؤُهُ حِصَصَهُمْ وَعَتَقَ عَلَيْهِ الْعَبْدُ وَإِلَّا فَقَدْ عَتَقَ مِنْهُ مَا عَتَقَ»","english":{"narrator":"","text":"Ibn ‘Umar reported God’s Messenger as saying, “If anyone emancipates his share in a slave and has enough money to pay the full price for him, a fair price for the slave should be fixed, his partners given their shares, and the slave be thus emancipated; otherwise he is emancipated only to the extent of the first man’s share.” \n\n(Bukhari and Muslim.)"}},{"id":8,"idInBook":8,"chapterId":14,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ أَعْتَقَ شِقْصًا فِي عَبْدٍ أُعْتِقَ كُلُّهُ إِنْ كَانَ لَهُ مَالٌ فَإِنْ لَمْ يَكُنْ لَهُ مَالٌ اسْتَسْعَى الْبعد غير مشقوق عَلَيْهِ»","english":{"narrator":"","text":"Abu Huraira reported the Prophet as saying, “If anyone emancipates a share in a slave, he is to be completely emancipated if he has money; but if he has none, the slave will be required to work to pay for his freedom, but must not be overburdened.” \n\n(Bukhari and Muslim.)"}},{"id":9,"idInBook":9,"chapterId":14,"bookId":14,"arabic":"وَعَن عمرَان بن حُصَيْن: أَنَّ رَجُلًا أَعْتَقَ سِتَّةَ مَمْلُوكِينَ لَهُ عِنْدَ مَوْتِهِ لَمْ يَكُنْ لَهُ مَالٌ غَيْرُهُمْ فَدَعَا بهم رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجَزَّأَهُمْ أَثْلَاثًا ثُمَّ أَقْرَعَ بَيْنَهُمْ فَأَعْتَقَ اثْنَيْنِ وَأَرَقَّ أَرْبَعَةً وَقَالَ لَهُ قَوْلًا شَدِيدًا. رَوَاهُ مُسْلِمٌ وَرَوَاهُ النَّسَائِيُّ عَنْهُ وَذَكَرَ: «لَقَدْ هَمَمْتُ أَنْ لَا أُصَلِّيَ عَلَيْهِ» بَدَلَ: وَقَالَ لَهُ قَوْلًا شَدِيدًا وَفِي رِوَايَةِ أَبِي دَاوُدَ: قَالَ: «لَوْ شَهِدْتُهُ قَبْلَ أَنْ يُدْفَنَ لَمْ يُدْفَنْ فِي مَقَابِر الْمُسلمين»","english":{"narrator":"","text":"Imran b. Husain said that a man who had no other property emancipated six slaves of his at the time of his death. God’s Messenger called for them, and after dividing them into three sections, casting lots among them, setting two free and keeping four in slavery,* he spoke severely of him. Nasa’i transmitted it on ‘Imran’s authority, but in place of “he spoke severely of him,” he mentioned that the Prophet said, “I was inclined not to pray over him.” In Abu Dawud’s version he said, “Had I been present before his burial, he would not have been buried in a Muslim cemetery.”\n\nMuslim transmitted it. \n\n*The principle is that at least two-thirds of a dead man's property must go to the heirs."}},{"id":10,"idInBook":10,"chapterId":14,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَجْزِي وَلَدٌ وَالِده إِلَّا أَن يجده مَمْلُوكا فيشتر بِهِ فيعتقه» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Huraira reported God's Messenger as saying, “A son does not repay what he owes his father unless he buys him and emancipates him if he finds him in slavery.” \n\nMuslim transmitted it."}},{"id":11,"idInBook":11,"chapterId":14,"bookId":14,"arabic":"وَعَنْ جَابِرٍ: أَنَّ رَجُلًا مِنَ الْأَنْصَارِ دَبَّرَ مَمْلُوكًا وَلَمْ يَكُنْ لَهُ مَالٌ غَيْرُهُ فَبَلَغَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «مَنْ يَشْتَرِيهِ مني؟» فَاشْتَرَاهُ نعيم بن النَّحَّامِ بِثَمَانِمِائَةِ دِرْهَمٍ. مُتَّفَقٌ عَلَيْهِ. وَفِي رِوَايَةٍ لِمُسْلِمٍ: فَاشْتَرَاهُ نُعَيْمُ بْنُ عَبْدِ اللَّهِ الْعَدَوِيُّ بثمانمائة دِرْهَم فجَاء بِهَا إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَدَفَعَهَا إِلَيْهِ ثُمَّ قَالَ: «ابْدَأْ بِنَفْسِكَ فَتَصَدَّقْ عَلَيْهَا فَإِنْ فَضَلَ شَيْءٌ فَلِأَهْلِكَ فَإِنْ فَضَلَ عَنْ أَهْلِكَ شَيْءٌ فَلِذِي قَرَابَتِكَ فَإِنْ فَضَلَ عَنْ ذِي قَرَابَتِكَ شَيْءٌ فَهَكَذَا وَهَكَذَا» يَقُولُ: فَبين يَديك وَعَن يَمِينك وَعَن شمالك","english":{"narrator":"Jabir said that a man of the Ansar declared that a slave would be free after his death, but he had no other property, so when the Prophet heard of that he said, “Who will buy him from me ?” and Nu'aim b. an-Nahham bought him for eight hundred dirhams. A version by Muslim says Nu'aim b. ‘Abdallah al-‘Adawi bought him for eight hundred dirhams which he brought to the Prophet who, when he had handed them over to the man, said, “Spend first on yourself giving yourself sadaqa:","text":"if anything is left over give it to your family; if anything is left over when they have received something, give it to your relatives; and if anything is left over when they have received something, do thus and thus,” meaning that it should be distributed in front of him, on his right and on his left.\n\n(Bukhari and Muslim.)"}},{"id":12,"idInBook":12,"chapterId":14,"bookId":14,"arabic":"عَن الْحسن عَن سَمُرَة عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «من ملك ذَا رحم محرم فَهُوَ حُرٌّ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَه","english":{"narrator":"","text":"Al-Hasan, on Samura’s authority, reported God's Messenger as saying, “If anyone gets possession of a relative who is within the prohibited degrees, that person becomes free.” \n\nTirmidhi, Abu Dawud and Ibn Majah transmitted it."}},{"id":13,"idInBook":13,"chapterId":14,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا وَلَدَتْ أَمَةُ الرَّجُلِ مِنْهُ فَهِيَ مُعْتَقَةٌ عَنْ دُبُرٍ مِنْهُ أَوْ بَعْدَهُ» . رَوَاهُ الدَّارِمِيُّ","english":{"narrator":"","text":"Ibn ‘Abbas reported the Prophet as saying, “When a man’s slave-woman bears him a child she becomes free at his death.”* \n\nDarimi transmitted it.\n\n* The text has 'au durbur in minhu au ba'dahu’ indicating a doubt on the part of a transmitter as to which words were used. Both expressions amount to the same thing so it seems sufficient to give \"at his death\" in the translation above."}},{"id":14,"idInBook":14,"chapterId":14,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: بِعْنَا أُمَّهَاتِ الْأَوْلَادِ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبِي بَكْرٍ فَلَمَّا كَانَ عُمَرُ نَهَانَا عَنْهُ فَانْتَهَيْنَا. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"Jabir said:","text":"In the time of God’s Messenger and of Abu Bakr we sold slave women who had borne children, but when ‘Umar was in power he forbade us to do so and we stopped. \n\nAbu Dawud transmitted it."}},{"id":15,"idInBook":15,"chapterId":14,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَعْتَقَ عَبْدًا وَلَهُ مَالٌ فَمَالُ الْعَبْدِ لَهُ إِلَّا أَنْ يَشْتَرِطَ السَّيِّدُ» . رَوَاهُ أَبُو دَاوُدَ وَابْنُ مَاجَهْ","english":{"narrator":"","text":"Ibn ‘Umar reported God’s Messenger as saying, “If anyone emancipates a slave who owns property he gets the slave’s property, unless the master stipulates otherwise.” \n\nAbu Dawud and Ibn Majah transmitted it."}},{"id":16,"idInBook":16,"chapterId":14,"bookId":14,"arabic":"وَعَن الْمَلِيحِ عَنْ أَبِيهِ: أَنَّ رَجُلًا أَعْتَقَ شِقْصًا مِنْ غُلَامٍ فَذَكَرَ ذَلِكَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «لَيْسَ لِلَّهِ شَرِيكٌ» فَأَجَازَ عتقه. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Abul Malih told on his father's authority that when a man emancipated a share in a slave, and the matter was mentioned to the Prophet he said, “God has no partner,” and decided chat he should be emancipated. \n\nAbu Dawud transmitted it."}},{"id":17,"idInBook":17,"chapterId":14,"bookId":14,"arabic":"وَعَن سفينة قَالَ: كُنْتُ مَمْلُوكًا لِأُمِّ سَلَمَةَ فَقَالَتْ: أُعْتِقُكَ وَأَشْتَرِطُ عَلَيْكَ أَنْ تَخْدُمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا عِشْتَ فَقُلْتُ: إِنْ لَمْ تَشْتَرِطِي عَلَيَّ مَا فَارَقْتُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا عِشْتُ فَأَعْتَقَتْنِي وَاشْتَرَطَتْ عَلَيَّ. رَوَاهُ أَبُو دَاوُدَ وَابْنُ مَاجَهْ","english":{"narrator":"Safina said:","text":"I was a slave of Umm Salama, and she said, “I shall emancipate you, but I stipulate that you must serve God’s Messenger as long as you live” I replied, “Even if you do not make a stipulation with me I shall not leave God’s Messenger as long as I live”. She then emancipated me and made the stipulation with me. \n\nAbu Dawud and Ibn Majah transmitted it."}},{"id":18,"idInBook":18,"chapterId":14,"bookId":14,"arabic":"وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْمُكَاتَبُ عَبْدٌ مَا بَقِيَ عَلَيْهِ مِنْ مُكَاتبَته دِرْهَم» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"‘Amr b. Shu'aib, on his father's authority, told that this grandfather reported the Prophet as saying, “A slave who has entered into an agreement to purchase his freedom is a slave as long as a dirham of the agreed price remains to be paid.\" \n\nAbu Dawud transmitted it."}},{"id":19,"idInBook":19,"chapterId":14,"bookId":14,"arabic":"وَعَنْ أُمِّ سَلَمَةَ قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا كَانَ عِنْدَ مكَاتب إحداكن وَفَاء فلنحتجب مِنْهُ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ","english":{"narrator":"","text":"Umm Salama reported God's Messenger as spying, “When a slave of one of you women has made an agreement to purchase his freedom and can pay the full price, she must veil herself from him.” \n\nTirmidhi, Abu Dawud and Ibn Majah transmitted it."}},{"id":20,"idInBook":20,"chapterId":14,"bookId":14,"arabic":"وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" مَنْ كَاتَبَ عَبْدَهُ عَلَى مِائَةِ أُوقِيَّةٍ فَأَدَّاهَا إِلَّا عَشْرَ أَوَاقٍ أَوْ قَالَ: عَشْرَةَ دَنَانِيرَ ثُمَّ عَجَزَ فَهُوَ رَقِيقٌ \". رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد وَابْن مَاجَه","english":{"narrator":"","text":"‘Amr b. Shu'aib, on his father’s authority, told that his grandfather reported God's Messenger as saying, “If anyone has agreed to let his slave buy his freedom for a hundred uqiyas and he pays them all but ten (or he said, ten dinars), and he is then unable to complete the amount, he remains a slave.” \n\nTirmidhi, Abu Dawud and Ibn Majah transmitted it."}},{"id":21,"idInBook":21,"chapterId":14,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا أَصَابَ الْمُكَاتَبُ حَدًّا أَوْ مِيرَاثًا وَرِثَ بِحِسَابِ مَا عَتَقَ مِنْهُ» . رَوَاهُ أَبُو دَاوُدَ وَالتِّرْمِذِيُّ وَفِي رِوَايَةٍ لَهُ قَالَ: «يُودَى الْمُكَاتَبُ بِحِصَّةِ مَا أَدَّى دِيَةَ حر وَمَا بَقِي دِيَة عبد» . وَضَعفه\nالفص الثَّالِث","english":{"narrator":"","text":"Ibn ‘Abbas reported the Prophet as saying, “When a slave who has made an agreement to purchase his freedom gets blood-money or an inheritance, he can inherit in accordance with the extent to which he has been emancipated.” \nIn a version by Tirmidhi he said, “Blood wit is paid for a slave who has made an agreement to purchase his freedom at the rate paid for a freeman so far as he has paid the purchase money, and at the rate paid for a slave so far as the remainder is concerned,” but he declared it to be weak.\n\nAbu Dawud and Tirmidhi transmitted it."}},{"id":22,"idInBook":22,"chapterId":14,"bookId":14,"arabic":"عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَمْرَةَ الْأَنْصَارِيِّ: أَنَّ أُمَّهُ أَرَادَتْ أَنْ تَعْتِقَ فَأَخَّرَتْ ذَلِكَ إِلَى أَنْ تُصْبِحَ فَمَاتَتْ قَالَ عَبْدُ الرَّحْمَنِ: فَقُلْتُ لِلْقَاسِمِ بْنِ مُحَمَّدٍ: أَيَنْفَعُهَا أَنْ أَعْتِقَ عَنْهَا؟ فَقَالَ الْقَاسِمُ: أَتَى سَعْدُ بْنُ عُبَادَةَ رَسُول الله صلى الله عَلَيْهِ وَسلم فَقَالَ: \" إِنَّ أُمِّي هَلَكَتْ فَهَلْ يَنْفَعُهَا أَنْ أَعْتِقَ عَنْهَا؟ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «نعم» . رَوَاهُ مَالك","english":{"narrator":"","text":"‘Abd ar-Rahman b. Abu ‘Amra al-Ansari told that his mother had intended to emancipate a slave, but she postponed it till the morning, and she died. ‘Abd ar-Rahman said he asked al-Qasim b. Muhammad whether it would benefit her if he emancipated the slave on her behalf, and al-Qasim told him that Sa'd b. ‘Ubada had gone to God’s Messenger saying his mother had died and asking whether it would benefit her if he set free a slave on her behalf, and that God’s Messenger had replied that it would. \n\nMalik transmitted it."}},{"id":23,"idInBook":23,"chapterId":14,"bookId":14,"arabic":"وَعَنْ يَحْيَى بْنِ سَعِيدٍ قَالَ: تُوُفِّيَ عَبْدُ الرَّحْمَنِ بْنُ أَبِي بَكْرٍ فِي نَوْمٍ نَامَهُ فَأَعْتَقَتْ عَنْهُ عَائِشَةُ أُخْتُهُ رِقَابًا كَثِيرَةً. رَوَاهُ مَالك","english":{"narrator":"","text":"Yahya b. Sa'id told that ‘Abd ar-Rahman b. Abu Bakr died in his sleep and that his sister ‘A’isha emancipated many slaves on his behalf.\n \nMalik transmitted it."}},{"id":24,"idInBook":24,"chapterId":14,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنِ اشْتَرَى عَبْدًا فَلَمْ يَشْتَرِطْ مَاله فَلَا شَيْء لَهُ» . رَوَاهُ الدَّارمِيّ","english":{"narrator":"","text":"‘Abdallah b. ‘Umar reported God's Messenger as saying, “If anyone buys a slave and makes no stipulation about his property, he gets none of it.” \n\nDarimi transmitted it."}}],"chapter":{"id":14,"bookId":14,"arabic":"كتاب العتق","english":"Emancipation"}}