{"metadata":{"length":39,"arabic":{"title":"مشكاة المصابيح","author":"الإمام الكاتب التبريزي","introduction":"كتاب الإيمان والنذور"},"english":{"title":"Mishkat al-Masabih","author":"Al-Khatib Al-Tabrizi","introduction":"Oaths and Vows"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":15,"bookId":14,"arabic":"عَنِ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا أَكْثَرُ مَا كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يحلف: «لَا ومقلب الْقُلُوب» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Ibn ‘Umar said the greatest oath the Prophet used was, “No, by Him who overturns the hearts.” \n\nBukhari transmitted it."}},{"id":2,"idInBook":2,"chapterId":15,"bookId":14,"arabic":"وَعَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ اللَّهَ يَنْهَاكُمْ أَنْ تَحْلِفُوا بِآبَائِكُمْ مَنْ كَانَ حَالِفًا فَلْيَحْلِفْ بِاللَّهِ أَوْ ليصمت»","english":{"narrator":"","text":"He reported God’s Messenger as saying, “God forbids you to swear by your fathers. If anyone swears he must swear by God, or keep silent.” \n\n(Bukhari and Muslim.)"}},{"id":3,"idInBook":3,"chapterId":15,"bookId":14,"arabic":"وَعَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَحْلِفُوا بِالطَّوَاغِي وَلَا بِآبَائِكُمْ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"‘Abd ar-Rahman b. Samura reported God's Messenger as saying, “Do not swear by idols or by your fathers.” \n\nMuslim transmitted it."}},{"id":4,"idInBook":4,"chapterId":15,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" مَنْ حَلَفَ فَقَالَ فِي حَلِفِهِ: بِاللَّاتِ وَالْعُزَّى فَلْيَقُلْ: لَا إِلَهَ إِلَّا اللَّهُ. وَمَنْ قَالَ لِصَاحِبِهِ: تَعَالَ أقامرك فليتصدق \"","english":{"narrator":"","text":"Abu Huraira reported the Prophet as saying that if anyone swears an oath in the course of which he says, “By al-Lat and al-‘Uzza”, he should say, “There is no god but God”; and that if anyone says to his friend, “Come and let me play for money with you”, he should pay sadaqa. \n\n(Bukhari and Muslim.)"}},{"id":5,"idInBook":5,"chapterId":15,"bookId":14,"arabic":"وَعَنْ ثَابِتِ بْنِ الضَّحَّاكِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ حَلَفَ عَلَى مِلَّةٍ غَيْرِ الْإِسْلَامِ كَاذِبًا فَهُوَ كَمَا قَالَ وَلَيْسَ عَلَى ابْنِ آدَمَ فِيمَا لَا يَمْلِكُ وَمَنْ قَتَلَ نَفْسَهُ بِشَيْءٍ فِي الدُّنْيَا عُذِّبَ بِهِ يَوْمَ الْقِيَامَةِ وَمَنْ لَعَنَ مُؤْمِنًا فَهُوَ كَقَتْلِهِ وَمَنْ قَذَفَ مُؤْمِنًا بِكُفْرٍ فَهُوَ كَقَتْلِهِ وَمَنِ ادَّعَى دَعْوَى كَاذِبَةً لِيَتَكَثَّرَ بِهَا لَمْ يَزِدْهُ اللَّهُ إِلَّا قِلَّةً»","english":{"narrator":"","text":"Thabit b. ad-Dahhak reported God’s Messenger as saying, “If anyone swears by a religion other than Islam falsely he is like what he has said.* A son of Adam may not take a vow about something which he does not possess, and if anyone kills himself with something in this world he will be punished with it on the day of resurrection. If anyone curses a believer it is like murdering him, if anyone charges a believer with infidelity it is like murdering him, and if anyone makes a false claim to gain much thereby God will give him less instead of more.”\n\n(Bukhari and Muslim.)\n\n*Opinions differ about the meaning. Some say it means he is a liar, others that he is an infidel."}},{"id":6,"idInBook":6,"chapterId":15,"bookId":14,"arabic":"وَعَنْ أَبِي مُوسَى قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَنِّي وَاللَّهِ إِنْ شَاءَ اللَّهُ لَا أَحْلِفُ عَلَى يَمِينٍ فَأَرَى غَيْرَهَا خَيْرًا مِنْهَا إِلَّا كَفَّرْتُ عَنْ يَمِينِي وَأَتَيْتُ الَّذِي هُوَ خَيْرٌ»","english":{"narrator":"","text":"Abu Musa reported God’s Messenger as saying, “I swear by God that if God will, I shall not swear an oath and then consider something else to be better than it without making atonement for my oath and doing the thing that is better.” \n\n(Bukhari and Muslim.)"}},{"id":7,"idInBook":7,"chapterId":15,"bookId":14,"arabic":"وَعَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَا عَبْدَ الرَّحْمَنِ بْنَ سَمُرَةَ لَا تَسْأَلِ الْإِمَارَةَ فَإِنَّكَ إِنْ أُوتِيتَهَا عَنْ مَسْأَلَةٍ وُكِلْتَ إِلَيْهَا وَإِنْ أُوتِيتَهَا عَنْ غَيْرِ مَسْأَلَةٍ أُعِنْتَ عَلَيْهَا وَإِذَا حَلَفْتَ عَلَى يَمِينٍ فَرَأَيْتَ غَيْرَهَا خَيْرًا مِنْهَا فَكَفِّرْ عَنْ يَمِينِكَ وَأْتِ الَّذِي هُوَ خَيْرٌ» . وَفِي رِوَايَةٍ: «فَأْتِ الَّذِي هُوَ خير وَكفر عَن يَمِينك»","english":{"narrator":"‘Abd ar-Rahman b. Samura reported God’s Messenger as saying,\t\n\"Do not ask for rule ship, ‘Abd ar-Rahman b. Samura, for if you are given it as a result of asking you will be left to deal with it yourself, but if you are given it without asking you will be helped in undertaking it. And when you swear an oath and consider something else to be better than it, make atonement for your oath and do the thing that is better.’’* \n\n(Bukhari and Muslim.)\n\n*In the Damascus edn the tradition ends at oath*. Mirqat, iii, S57 gives the full form translated above and adds:","text":"A version has, \"Do the thing that is better and make atonement for your oath.’* Bukhari, al-Aiman wan-nudhur, I and Muslim, Aiman, 19 give the first form in full. I have not found the other version."}},{"id":8,"idInBook":8,"chapterId":15,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ حَلَفَ عَلَى يَمِينٍ فَرَأَى خَيْرًا مِنْهَا فَلْيُكَفِّرْ عَنْ يَمِينِهِ وليفعل» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Huraira reported God’s Messenger as saying, \"If anyone swears an oath and considers something else to be better than it he should make atonement for his oath and do that.” \n\nMuslim transmitted it."}},{"id":9,"idInBook":9,"chapterId":15,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «وَاللَّهِ لَأَنْ يَلَجَّ أَحَدُكُمْ بِيَمِينِهِ فِي أَهْلِهِ آثَمُ لَهُ عِنْدَ الله نم أَنْ يُعْطِيَ كَفَّارَتَهُ الَّتِي افْتَرَضَ اللَّهُ عَلَيْهِ»","english":{"narrator":"","text":"He reported God’s Messenger as saying, \"I swear by God that it is more sinful in God’s sight for one of you to persist in his oath regarding his family than to give for it the atonement God has imposed.” \n\n(Bukhari and Muslim.)"}},{"id":10,"idInBook":10,"chapterId":15,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَمِينُكَ عَلَى مَا يُصَدِّقُكَ عَلَيْهِ صَاحبك» . رَوَاهُ مُسلم","english":{"narrator":"","text":"He reported God’s Messenger as saying, \"Your oath should be about something regarding which your companion will believe you.” \n\nMuslim transmitted it."}},{"id":11,"idInBook":11,"chapterId":15,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْيَمِينُ عَلَى نِيَّةِ الْمُسْتَحْلِفِ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"He reported God's Messenger as saying, \"An oath is to be interpreted according to the intention of the one who takes it.” \n\nMuslim transmitted it."}},{"id":12,"idInBook":12,"chapterId":15,"bookId":14,"arabic":"عَن عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: أُنْزِلَتْ هَذِهِ الْآيَةُ: (لَا يُؤَاخِذُكُمُ اللَّهُ بِاللَّغْوِ فِي أَيْمَانِكُمْ)\nفِي قَوْلِ الرَّجُلِ: لَا وَاللَّهِ وَبَلَى وَاللَّهِ. رَوَاهُ الْبُخَارِيُّ وَفِي شَرْحِ السُّنَّةِ لَفْظُ الْمَصَابِيحِ وَقَالَ: رَفَعَهُ بَعْضُهُمْ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنهُ","english":{"narrator":"","text":"‘A’isha said that the verse, \"God will not take you to account for what is futile in your oaths” (Al-Qu’ran 2:225; 5:89) was sent down about such phrases as \"No, by God,” and \"Yes, by God.” \n\nBukhari transmitted it. Sharh as-sunna has the wording of al-Masabih, saying that some transmitters traced it back to the Prophet on ‘A’isha’s authority."}},{"id":13,"idInBook":13,"chapterId":15,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَحْلِفُوا بِآبَائِكُمْ وَلَا بِأُمَّهَاتِكُمْ وَلَا بِالْأَنْدَادِ وَلَا تَحْلِفُوا بِاللَّهِ إِلَّا وَأَنْتُمْ صَادِقُونَ» . رَوَاهُ أَبُو دَاوُدَ وَالنَّسَائِيُّ","english":{"narrator":"","text":"Abu Huraira reported God’s Messenger as saying, \"Do not swear by your fathers, or by your mothers, or by rivals (Cf. Al-Qur’an 2:22 etc. The reference is to idols or false gods) to God; and swear by God only when you are speaking the truth.” \n\nAbu Dawud and Nasa’i transmitted it."}},{"id":14,"idInBook":14,"chapterId":15,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنْ حَلَفَ بِغَيْرِ اللَّهِ فَقَدْ أَشْرَكَ» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Ibn Umar told that he heard God’s Messenger say, “He who swears by anyone but God is a polytheist.” \n\nTirmidhi transmitted it."}},{"id":15,"idInBook":15,"chapterId":15,"bookId":14,"arabic":"وَعَنْ بُرَيْدَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ حَلَفَ بِالْأَمَانَةِ فَلَيْسَ منا» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Buraida reported God’s Messenger as saying, “He who swears by faithfulness* is not one of our number.” \n\nAbu Dawud transmitted it.\n\n* Amana. It is held that the objection is due to the fact that the word is not the name of one of God's attributes, but merely one of the duties prescribed to mankind. It is an unsuitable word because its use suggests that it is being equated with one of God’s attributes."}},{"id":16,"idInBook":16,"chapterId":15,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" مَنْ قَالَ: إِنِّي بَرِيءٌ مِنَ الْإِسْلَامِ فَإِنْ كَانَ كَاذِبًا فَهُوَ كَمَا قَالَ وَإِنْ كَانَ صَادِقًا فَلَنْ يَرْجِعَ إِلَى الْإِسْلَامِ سَالِمًا \". رَوَاهُ أَبُو دَاوُدَ وَالنَّسَائِيُّ وَابْنُ مَاجَهْ","english":{"narrator":"","text":"He reported God’s Messenger as stating that if anyone says, “I am free from Islam,” that is just as he has said if he is lying, but if he is speaking the truth he will not return safely to Islam. \n\nAbu Dawud, Nasa’i and Ibn Majah transmitted it."}},{"id":17,"idInBook":17,"chapterId":15,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اجْتَهَدَ فِي الْيَمِينِ قَالَ: «لَا وَالَّذِي نفس أَبُو الْقَاسِم بِيَدِهِ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Abu Sa'id al-Khudri told that when God’s Messenger swore strongly he said, “No, by Him in whose hand is the soul of Abu Qasim.” \n\nAbu Dawud transmitted it."}},{"id":18,"idInBook":18,"chapterId":15,"bookId":14,"arabic":"وَعَن أبي هُرَيْرَة قَالَ: كَانَتْ يَمِينُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا حَلَفَ: «لَا وَأَسْتَغْفِرُ اللَّهَ» . رَوَاهُ أَبُو دَاوُد وَابْن مَاجَه","english":{"narrator":"","text":"Abu Huraira said that when God’s Messenger swore an oath it was, “No, and I ask forgiveness of God.” \n\nAbu Dawud and Ibn Majah transmitted it."}},{"id":19,"idInBook":19,"chapterId":15,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى الله ليه وَسَلَّمَ قَالَ: \n\" مَنْ حَلَفَ عَلَى يَمِينٍ فَقَالَ: إِنْ شَاءَ اللَّهُ فَلَا حِنْثَ عَلَيْهِ \". رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالنَّسَائِيُّ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ وَذَكَرَ التِّرْمِذِيُّ جَمَاعَةً وَقَفُوهُ عَلَى ابْنِ عُمَرَ","english":{"narrator":"","text":"Ibn ‘Umar reported God’s Messenger as stating that if anyone says when swearing an oath, “If God will”, he is not held accountable if he breaks it. \n\nTirmidhi, Abu Dawud, Nasa’i, Ibn Majah and Darimi transmitted it, but Tirmidhi mentioned a number who traced it no farther back than Ibn ‘Umar."}},{"id":20,"idInBook":20,"chapterId":15,"bookId":14,"arabic":"عَوْفِ بْنِ مَالِكٍ عَنْ أَبِيهِ قَالَ: قُلْتُ: يَا رَسُولَ اللَّهِ أَرَأَيْتَ ابْنَ عَم لي آتيه فَلَا يُعْطِينِي وَلَا يَصِلُنِي ثُمَّ يَحْتَاجُ إِلَيَّ فَيَأْتِينِي فَيَسْأَلُنِي وَقَدْ حَلَفْتُ أَنْ لَا أُعْطِيَهُ وَلَا أَصِلَهُ فَأَمَرَنِي أَنْ آتِيَ الَّذِي هُوَ خَيْرٌ وَأُكَفِّرَ عَنْ يَمِينِي. رَوَاهُ النَّسَائِيُّ وَابْنُ مَاجَهْ وَفِي رِوَايَةٍ قَالَ: قُلْتُ: يَا رَسُولَ اللَّهِ يَأْتِينِي ابْنُ عَمِّي فَأَحْلِفُ أَنْ لَا أُعْطِيَهُ وَلَا أَصِلَهُ قَالَ: «كَفِّرْ عَنْ يَمِينِكَ»","english":{"narrator":"Abul Ahwas ‘Auf b. Malik quoted his father as saying:","text":"I said, “Messenger of God, tell me what I should do about a cousin of mine to whom I go and ask for something, but who neither gives me anything nor regards my kinship, then when he needs my help comes to me and asks for something, and I have sworn that I would not give him anything or regard his kinship.” He commanded me to do that which is better and make atonement for my oath. \nIn Ibn Majah’s version he told that he said, “Messenger of God, my cousin comes to me and I swear that I will not give him anything or regard his kinship,” and that he replied, “Make atonement for your oath.”\n\nNasa’i and Ibn Majah transmitted it."}},{"id":21,"idInBook":21,"chapterId":15,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ وَابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمْ قَالَا: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَنْذُرُوا فَإِنَّ النَّذْرَ لَا يُغْنِي مِنَ الْقَدَرِ شَيْئًا وَإِنَّمَا يُسْتَخْرَجُ بِهِ من الْبَخِيل»","english":{"narrator":"","text":"Abu Huraira and Ibn ‘Umar reported God’s Messenger as saying, “Do not make vows, for a vow has no effect against fate; it is only from the miserly that it is a means by which something is extracted.” \n\n(Bukhari and Muslim.)"}},{"id":22,"idInBook":22,"chapterId":15,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ نَذَرَ أَنْ يُطِيعَ اللَّهَ فَلْيُطِعْهُ وَمَنْ نَذَرَ أَنْ يَعْصِيَهُ فَلَا يَعْصِهِ» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"‘A’isha reported God’s Messenger as saying, “If anyone vows to obey God let him obey Him, but if anyone vows to disobey Him let him not disobey Him.” \n\nBukhari transmitted it."}},{"id":23,"idInBook":23,"chapterId":15,"bookId":14,"arabic":"وَعَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا وَفَاءَ لِنَذْرٍ فِي مَعْصِيَةٍ وَلَا فِيمَا لَا يَمْلِكُ الْعَبْدُ» . رَوَاهُ مُسْلِمٌ وَفِي رِوَايَةٍ: «لَا نَذْرَ فِي مَعْصِيّة الله»","english":{"narrator":"","text":"‘Imran b. Husain reported God's Messenger as saying, “A vow to do an act of disobedience must not be fulfilled, or one to do something over which one has no control.” \n\nMuslim transmitted it. A version has, “No vow must be taken to disobey God.”"}},{"id":24,"idInBook":24,"chapterId":15,"bookId":14,"arabic":"وَعَن عقبَة بن عَامر عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «كَفَّارَةُ النَّذْرِ كَفَّارَةُ الْيَمِينِ» . رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"‘Uqba b. ‘Amir reported God’s Messenger as saying, “The atonement for a vow is the same as for an oath.” \n\nMuslim transmitted it."}},{"id":25,"idInBook":25,"chapterId":15,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: بَيْنَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ إِذا هُوَ بِرَجُل قَائِم فَسَأَلَهُ عَنْهُ فَقَالُوا: أَبُو إِسْرَائِيلَ نَذَرَ أَنْ يَقُومَ وَلَا يَقْعُدَ وَلَا يَسْتَظِلَّ وَلَا يَتَكَلَّمَ وَيَصُومَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مُرُوهُ فَلْيَتَكَلَّمْ وَلْيَسْتَظِلَّ وَلْيَقْعُدْ وَلْيُتِمَّ صَوْمَهُ» . رَوَاهُ الْبُخَارِيُّ","english":{"narrator":"Ibn ‘Abbas said:","text":"While the Prophet was preaching a man was standing, so he asked about him and was told that he was Abu Isra’il who had taken a vow to stand and not to sit, or go into the shade, or speak, but to fast. Thereupon the Prophet said, “Command him to speak, go into the shade, sit and complete his fast.” \n\nBukhari transmitted it."}},{"id":26,"idInBook":26,"chapterId":15,"bookId":14,"arabic":"وَعَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى شَيْخًا يُهَادَى بَيْنَ ابْنَيْهِ فَقَالَ: «مَا بَالُ هَذَا؟» قَالُوا: نَذَرَ أَنْ يَمْشِيَ إِلَى بَيت الله قَالَ: «إِنَّ اللَّهَ تَعَالَى عَنْ تَعْذِيبِ هَذَا نَفسه لَغَنِيّ» . وَأمره أَن يركب.\nوَفِي رِوَايَةٍ لِمُسْلِمٍ عَنْ أَبِي هُرَيْرَةَ قَالَ: «ارْكَبْ أَيُّهَا الشَّيْخُ فَإِنَّ اللَّهَ غَنِيٌّ عَنْكَ وَعَن نذرك»","english":{"narrator":"","text":"Anas said that the Prophet saw an old man being supported between his sons, and on asking what was the matter with him and being told that he had taken a vow to walk,* he said, “God most high has no need that this man should punish himself,” and he ordered him to ride. In a version by Muslim on Abu Huraira’s authority he said, “Ride, old man, for God is not in need of you and your vow.”\n\n*Mirqat, iii, 565 explains this as a vow to walk to the Ka’ba.\n\n(Bukhari and Muslim)."}},{"id":27,"idInBook":27,"chapterId":15,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ: أَنَّ سَعْدَ بن عبَادَة رَضِي الله عَنْهُم اسْتَفْتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي نَذْرٍ كَانَ عَلَى أُمِّهِ فَتُوُفِّيَتْ قَبْلَ أَنْ تَقْضِيَهُ فَأَفْتَاهُ أَنْ يَقْضِيَهُ عَنْهَا","english":{"narrator":"","text":"Ibn ‘Abbas told that Sa'd b. ‘Ubada asked the Prophet for a decision about a vow taken by his mother who had died before fulfilling it, and that he gave decision that he should fulfil it on her behalf. \n\n(Bukhari and Muslim.)"}},{"id":28,"idInBook":28,"chapterId":15,"bookId":14,"arabic":"وَعَنْ كَعْبِ بْنِ مَالِكٍ قَالَ: قُلْتُ: يَا رَسُولَ اللَّهِ إِنَّ مِنْ تَوْبَتِي أَنْ أَنْخَلِعَ مِنْ مَالِي صَدَقَةً إِلَى اللَّهِ وَإِلَى رَسُولِهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَمْسِكْ بَعْضَ مَالِكَ فَهُوَ خَيْرٌ لَكَ» . قُلْتُ: فَإِنِّي أُمْسِكُ سَهْمِي الَّذِي بِخَيْبَر. وَهَذَا طرف من حَدِيث مطول","english":{"narrator":"","text":"Ka'b b. Malik told that he said, “Messenger of God, to make my repentance complete* I should divest myself of my property as sadaqa for God and His Messenger.” God's Messenger replied, “Retain some of your property, for that will be better for you.” So he said he would retain the portion he had at Khaibar. \n\n(Bukhari and Muslim.) This is part of a long tradition.\n\n* Mirqat, iii, 566 refers this to his withdrawal from the expedition to Tabuk without a valid reason.\nPt. 10"}},{"id":29,"idInBook":29,"chapterId":15,"bookId":14,"arabic":"عَنْ عَائِشَةَ قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا نَذْرَ فِي مَعْصِيَةٍ وَكَفَّارَتُهُ كَفَّارَةُ الْيَمِينِ» . رَوَاهُ أَبُو دَاوُدَ وَالتِّرْمِذِيُّ وَالنَّسَائِيّ","english":{"narrator":"","text":"‘A'isha reported God’s Messenger as saying, “No vow must be taken to do an act of disobedience, and the atonement for it is the same as for an oath.” \n\nAbu Dawud, Tirmidhi and Nasa’i transmitted it."}},{"id":30,"idInBook":30,"chapterId":15,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ نَذَرَ نَذْرًا لم يسمه فَكَفَّارَتُهُ كَفَّارَةُ يَمِينٍ. وَمَنْ نَذَرَ نَذْرًا لَا يُطِيقُهُ فَكَفَّارَتُهُ كَفَّارَةُ يَمِينٍ. وَمَنْ نَذَرَ نَذْرًا أَطَاقَهُ فَلْيَفِ بِهِ» . رَوَاهُ أَبُو دَاوُدَ وَابْنُ مَاجَه وَوَقفه بَعضهم على ابْن عَبَّاس","english":{"narrator":"","text":"Ibn ‘Abbas reported God’s Messenger as saying, “If anyone takes a vow but does not name it, its atonement is the same as that for an oath; if anyone takes a vow to do an act of disobedience, its atonement is the same as that for an oath; if anyone takes a vow he is unable to fulfil, its atonement is the same as that for an oath; but if anyone takes a vow he is able to fulfil, he must do so.” \n\nAbu Dawud and Ibn Majah transmitted it, but some traced it no farther back than Ibn ‘Abbas."}},{"id":31,"idInBook":31,"chapterId":15,"bookId":14,"arabic":"وَعَن ثَابت بن الضَّحَّاك قَالَ: نَذَرَ رَجُلٌ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَنْحَرَ إِبِلًا بِبُوَانَةَ فَأَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرَهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «هَلْ كَانَ فِيهَا وَثَنٌ مِنْ أَوْثَانِ الْجَاهِلِيَّةِ يُعْبَدُ؟» قَالُوا: لَا قَالَ: «فَهَلْ كَانَ فِيهِ عِيدٌ مِنْ أَعْيَادِهِمْ؟» قَالُوا: لَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أوف بِنَذْرِك فَإِنَّهُ لَا وَفَاءَ لِنَذْرٍ فِي مَعْصِيَةِ اللَّهِ وَلَا فِيمَا لَا يَمْلِكُ ابْنُ آدَمَ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Thabit b. ad-Dahhak said that in the time of God's Messenger a man took a vow to slaughter camels at Buwana and came and told him. God’s Messenger asked whether the place contained any idol worshipped in pre-Islamic times and was told that it did not. He asked whether any pre-Islamic festival was observed there and was told that no such thing was observed. He then said to the man, “Fulfil your vow, for a vow to do an act of disobedience to God must not be fulfilled, neither must one to do something over which a human being has no control.”\n\nAbu Dawud transmitted it."}},{"id":32,"idInBook":32,"chapterId":15,"bookId":14,"arabic":"وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جده رَضِي الله عَنهُ أَنَّ امْرَأَةً قَالَتْ: يَا رَسُولَ اللَّهِ إِنِّي نَذَرْتُ أَنْ أَضْرِبَ عَلَى رَأْسِكَ بِالدُّفِّ قَالَ: «أَوْفِي بِنَذْرِكِ» . رَوَاهُ أَبُو دَاوُدَ \nوَزَادَ رَزِينٌ: قَالَتْ: وَنَذَرْتُ أَنْ أَذْبَحَ بِمَكَانِ كَذَا وَكَذَا مَكَانٌ يَذْبَحُ فِيهِ أَهْلُ الْجَاهِلِيَّةِ فَقَالَ: «هَلْ كَانَ بِذَلِكِ الْمَكَانِ وَثَنٌ مِنْ أَوْثَانِ الْجَاهِلِيَّةِ يُعْبَدُ؟» قَالَتْ: لَا قَالَ: «هَلْ كَانَ فِيهِ عِيدٌ مِنْ أَعْيَادِهِمْ؟» قَالَتْ: لَا قَالَ: «أَوْفِي بِنَذْرِك»","english":{"narrator":"","text":"‘Amr b. Shu'aib, on his father’s authority, said that his grandfather told of a woman who said, “Messenger of God, I have taken a vow to play the tambourine over you,” to which he replied, “Fulfil your vow.” \n\nAbu Dawud transmitted it.\n\nRazin added that she said, “And I have taken a vow to perform a sacrifice in such and such a place,” a place in which people had performed sacrifices in pre-Islamic times. He asked whether that place contained any idol worshipped in pre-Islamic times, and she replied that it did not. He asked whether any pre-Islamic festival was observed there, and she replied that none was. He then said, “Fulfil your vow.”\n\nRazin"}},{"id":33,"idInBook":33,"chapterId":15,"bookId":14,"arabic":"وَعَن أبي لبَابَة: أَنَّهُ قَالَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِنَّ مِنْ تَوْبَتِي أَنْ أَهْجُرَ دَارَ قَوْمِي الَّتِي أَصَبْتُ فِيهَا الذَّنْبَ وَأَنْ أَنْخَلِعَ مِنْ مَالِي كُلِّهِ صَدَقَةً قَالَ: «يُجْزِئُ عَنْكَ الثُّلُثُ» . رَوَاهُ رزين","english":{"narrator":"","text":"bu Lubaba told that she said to the Prophet, “To make my repentance complete* I should abandon my people’s abode in which I committed sin and divest myself of all my property to be given as sadaqa.” He replied, “A third will be enough for you to give.” \n\nRazin transmitted it.\n\n* The story is given in Ibn Hisham’s as-Sirat an nabawiya (Cairo, 1355/1936), iii. 247. Quraiza had consulted him as to whether they should surrender unconditionally, and while he replied that they should, he put his hand to his throat to indicate that if they did they would be put to death, thus giving them a warning. Al-Qur’an, 8:27 is said to be connected with this incident."}},{"id":34,"idInBook":34,"chapterId":15,"bookId":14,"arabic":"وَعَن جَابر بن عبد الله: أَنَّ رَجُلًا قَامَ يَوْمَ الْفَتْحِ فَقَالَ: يَا رَسُول الله لِلَّهِ عَزَّ وَجَلَّ إِنْ فَتَحَ اللَّهُ عَلَيْكَ مَكَّةَ أَنْ أُصَلِّيَ فِي بَيْتِ الْمَقْدِسِ رَكْعَتَيْنِ قَالَ: «صلى الله عَلَيْهِ وَسلم هَهُنَا» ثمَّ عَاد فَقَالَ: «صل هَهُنَا» ثُمَّ أَعَادَ عَلَيْهِ فَقَالَ: «شَأْنَكَ إِذًا» . رَوَاهُ أَبُو دَاوُد والدارمي","english":{"narrator":"","text":"Jabir b. ‘Abdallah told that a man got up on the day of the Conquest and said, “Messenger of God, I have vowed to God who is great and glorious that if God conquers Mecca at your hands I shall pray two rak'as in Jerusalem.” He replied, “Pray here.” He repeated his statement to him and he replied, “Pray here.” He again repeated it to him and he replied, “Pursue your own course, then.” \n\nAbu Dawud and Darimi transmitted it."}},{"id":35,"idInBook":35,"chapterId":15,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ: أَنَّ أُخْتَ عُقْبَةَ بْنِ عَامِرٍ رَضِيَ اللَّهُ عَنْهُمْ نَذَرَتْ أَنْ تَحُجَّ مَاشِيَة وَأَنَّهَا لَا تطِيق ذَلِكَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ اللَّهَ لَغَنِيٌّ عَنْ مَشْيِ أُخْتِكَ فَلْتَرْكَبْ وَلْتُهْدِ بَدَنَةً» . رَوَاهُ أَبُو دَاوُدَ وَالدَّارِمِيُّ وَفِي رِوَايَةٍ لِأَبِي دَاوُدَ: فَأَمَرَهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ تَرْكَبَ وَتُهْدِيَ هَدْيًا وَفِي رِوَايَةٍ لَهُ: فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ اللَّهَ لَا يَصْنَعُ بِشَقَاءِ أُخْتِكَ شَيْئًا فَلْتَرْكَبْ ولتحج وتكفر يَمِينهَا»","english":{"narrator":"","text":"Ibn ‘Abbas told that the sister of ‘Uqba b. ‘Amir took a vow to perform the Pilgrimage on foot, but was unable to do so. God’s Messenger then said, “God is not in need of your sister’s walking, so let her ride and present a sacrificial camel.”*\n\nAbu Dawud and Darimi transmitted it. \n\n*Arabic budana\n\nIn a version by Abu Dawud it says the Prophet ordered her to ride and offer animals for sacrifice.* In another version by him the Prophet said, “God gets no good from the affliction your sister imposes on herself, so let her perform the Pilgrimage riding and make atonement for her oath.”\n\nAbu Dawud.\n\n*Arabic hady"}},{"id":36,"idInBook":36,"chapterId":15,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ مَالِكٍ أَنَّ عُقْبَةَ بن عَامر سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أُخْتٍ لَهُ نَذَرَتْ أَنْ تَحُجَّ حَافِيَةً غَيْرَ مُخْتَمِرَةٍ فَقَالَ: «مُرُوهَا فَلْتَخْتَمِرْ وَلْتَرْكَبْ وَلْتَصُمْ ثَلَاثَةَ أَيَّامٍ» . رَوَاهُ أَبُو دَاوُدَ وَالتِّرْمِذِيُّ وَالنَّسَائِيُّ وَابْنُ مَاجَهْ والدارمي","english":{"narrator":"","text":"‘Abdallah b. Malik told that when ‘Uqba b. ‘Amir consulted the Prophet about a sister of his who had vowed to perform the Pilgrimage. If barefoot and bareheaded, he said, “Command her to cover her head and to ride, and to fast three days.” \n\nAbu Dawud, Tirmidhi, Nasa’i, Ibn Majah and Darimi transmitted it."}},{"id":37,"idInBook":37,"chapterId":15,"bookId":14,"arabic":"وَعَن سعيد بن الْمسيب: أَنَّ أَخَوَيْنِ مِنَ الْأَنْصَارِ كَانَ بَيْنَهُمَا مِيرَاثٌ فَسَأَلَ أَحَدُهُمَا صَاحِبَهُ الْقِسْمَةَ فَقَالَ: إِنْ عُدْتَ تَسْأَلُنِي الْقِسْمَةَ فَكُلُّ مَالِي فِي رِتَاجِ الْكَعْبَةِ فَقَالَ لَهُ عُمَرُ: إِنَّ الْكَعْبَةَ غَنِيَّةٌ عَنْ مَالِكَ كَفِّرْ عَنْ يَمِينِكَ وَكَلِّمْ أَخَاكَ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَا يَمِينَ عَلَيْكَ وَلَا نَذْرَ فِي مَعْصِيَةِ الرَّبِّ وَلَا فِي قَطِيعَةِ الرَّحِمِ وَلَا فِيمَا لَا يملك» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Sa'id b. al-Musayyib told that there were two brothers among the Ansar who shared an inheritance and that when one of them asked the other for the portion due to him he replied, “If you ask me again for the portion due to you, all my property will be devoted to the Ka'ba.”1 ‘Umar, telling him that the Ka'ba did not need his property, ordered I him to make atonement for his oath and speak to his brother, for he had heard God’s Messenger say, “An oath or a vow to disobey the Lord, t or to break ties of relationship, or about something over which one has no control is not binding on you.” \n\nAbu Dawud transmitted it.\n\n1. Fi ritaj al-ka'ba. This phrase which speaks of the door of the Ka'ba is used as a phrase for the Ka'ba itself.\n2. Mirqat, iii, 570 says it means he is to speak to his brother about repeating his request."}},{"id":38,"idInBook":38,"chapterId":15,"bookId":14,"arabic":"عَن عِمْرَانَ بْنِ حُصَيْنٍ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: \n\" النَّذْرُ نَذْرَانِ: فَمَنْ كَانَ نَذَرَ فِي طَاعَةٍ فَذَلِكَ لِلَّهِ فِيهِ الْوَفَاءُ وَمَنْ كَانَ نَذَرَ فِي مَعْصِيَةٍ فَذَلِكَ لِلشَّيْطَانِ وَلَا وَفَاء فِيهِ وَيُكَفِّرُهُ مَا يُكَفِّرُ الْيَمِينَ \". رَوَاهُ النَّسَائِيُّ","english":{"narrator":"","text":"‘Imran b. Husain told that he heard God’s Messenger say, “Vows are of two kinds, so if anyone vows to do an act of obedience, that is for God and must be fulfilled; but if anyone vows, to do an act of disobedience, that is for the devil and must not be fulfilled, but he must make atonement for it to the extent he would do in the case of an oath.”"}},{"id":39,"idInBook":39,"chapterId":15,"bookId":14,"arabic":"وَعَنْ مُحَمَّدِ بْنِ الْمُنْتَشِرِ قَالَ: إِنَّ رَجُلًا نَذَرَ أَنْ يَنْحَرَ نَفْسَهُ إِنْ نَجَّاهُ اللَّهُ مِنْ عَدُوِّهِ فَسَأَلَ ابْنَ عَبَّاسٍ فَقَالَ لَهُ: سَلْ مَسْرُوقًا فَسَأَلَهُ فَقَالَ لَهُ: لَا تَنْحَرْ نَفْسَكَ فَإِنَّكَ إِنْ كُنْتَ مُؤْمِنًا قَتَلْتَ نَفْسًا مُؤْمِنَةً وَإِنْ كُنْتَ كَافِرًا تَعَجَّلْتَ إِلَى النَّارِ وَاشْتَرِ كَبْشًا فَاذْبَحْهُ لِلْمَسَاكِينِ فَإِنَّ إِسْحَاقَ خَيْرٌ مِنْكَ وَفُدِيَ بِكَبْشٍ فَأَخْبَرَ ابْنَ عَبَّاسٍ فَقَالَ: هَكَذَا كُنْتُ أَرَدْتُ أَنْ أُفْتِيَكَ. رَوَاهُ رَزِينٌ","english":{"narrator":"","text":"Muhammad b. al-Muntashir told of a man who vowed to sacrifice himself if God rescued him from his enemy. He consulted Ibn ‘Abbas who told him to consult Masruq, and when he consulted him he replied, “Do not sacrifice yourself, for if you are a believer, you will kill a believing soul, and if you are an infidel you will hasten to hell; but buy a ram and sacrifice it for the poor, for Isaac was better than you and he was ransomed with a ram.”* He told Ibn ‘Abbas and he replied, “This is the decision I wanted to give you.” \n\nRazin transmitted it.\n\n*This agrees with the story in the Old Testament which says that Abraham was preparing to sacrifice Isaac, whereas the usual Muslim version is that it was Ishmael."}}],"chapter":{"id":15,"bookId":14,"arabic":"كتاب الإيمان والنذور","english":"Oaths and Vows"}}