{"metadata":{"length":100,"arabic":{"title":"مشكاة المصابيح","author":"الإمام الكاتب التبريزي","introduction":"كتاب القصاص"},"english":{"title":"Mishkat al-Masabih","author":"Al-Khatib Al-Tabrizi","introduction":"Retaliation"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":16,"bookId":14,"arabic":"عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" لَا يَحِلُّ دَمُ امْرِئٍ مُسْلِمٍ يَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنِّي رَسُولُ اللَّهِ إِلَّا بِإِحْدَى ثَلَاثٍ: النَّفْسُ بِالنَّفْسِ وَالثَّيِّبُ الزَّانِي وَالْمَارِقُ لدينِهِ التَّارِكُ للجماعةِ \"","english":{"narrator":"‘Abdallah b. Mas'ud reported God’s Messenger as saying, “The blood of a Muslim who testifies that there is no god but God and that I am God’s Messenger may not lawfully be shed but for one of three reasons:","text":"a life for a life; a married man who commits fornication; and one who turns aside from his religion and abandons the community.” \n\n(Bukhari and Muslim.)"}},{"id":2,"idInBook":2,"chapterId":16,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَنْ يَزَالَ الْمُؤْمِنُ فِي فُسْحَةٍ مِنْ دِينِهِ مَا لَمْ يُصِبْ دَمًا حَرَامًا» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Ibn ‘Umar reported God’s Messenger as saying, “A believer will continue to find ample scope in his religion as long as he does not kill anyone unlawfully.” \n\nBukhari transmitted it."}},{"id":3,"idInBook":3,"chapterId":16,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَوَّلُ مَا يُقْضَى بَيْنَ النَّاسِ يَوْمَ الْقِيَامَةِ فِي الدِّمَاء»","english":{"narrator":"","text":"‘Abdallah b. Mas'ud reported God’s Messenger as saying, “Shedding of blood will be the first matter about which judgment will be given on the day of resurrection.” \n\n(Bukhari and Muslim.)"}},{"id":4,"idInBook":4,"chapterId":16,"bookId":14,"arabic":"وَعَنِ الْمِقْدَادِ بْنِ الْأَسْوَدِ أَنَّهُ قَالَ: يَا رَسُولَ اللَّهِ أَرَأَيْتَ إِنْ لَقِيتُ رَجُلًا مِنَ الْكُفَّارِ فَاقْتَتَلْنَا فَضَرَبَ إِحْدَى يَدَيَّ بِالسَّيْفِ فقطعهما ثُمَّ لَاذَ مِنِّي بِشَجَرَةٍ فَقَالَ: أَسْلَمْتُ لِلَّهِ وَفِي رِوَايَةٍ: فَلَمَّا أَهْوَيْتُ لِأَقْتُلَهُ قَالَ: لَا إِلَهَ إِلَّا اللَّهُ أَأَقْتُلُهُ بَعْدَ أَنْ قَالَهَا؟ قَالَ: «لَا تَقْتُلْهُ» فَقَالَ: يَا رَسُولَ اللَّهِ إِنَّهُ قَطَعَ إِحْدَى يَدَيَّ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَقْتُلْهُ فَإِنْ قَتَلْتَهُ فَإِنَّهُ بِمَنْزِلَتِكَ قَبْلَ أَنْ تَقْتُلَهُ وَإِنَّكَ بِمَنْزِلَتِهِ قَبْلَ أَنْ يَقُولَ كَلِمَتَهُ الَّتِي قَالَ»","english":{"narrator":"","text":"Al-Miqdad b. al-Aswad told that he said, “Tell me, Messenger of God, supposing I meet an infidel and we fight together and he strikes one of my hands with his sword and cuts it off, then flies for refuge from me to a tree and says he has submitted himself to God (or, in another version, says when I intend to kill him that there is no god but God), shall I kill him after he has said it?” He replied, “Do not kill him.” He protested, “But, Messenger of God, he cut off one of my hands.” God’s Messenger then replied, “Do not kill him, for if you do so, he will be in the position in which you were before you killed him, and you will be in the position in which he was before he made his testimony.”* \n\n(Bukhari and Muslim.)\n\n*i.e. he will now be one for whose killing retaliation may be demanded, and you will be one whose blood may lawfully be shed."}},{"id":5,"idInBook":5,"chapterId":16,"bookId":14,"arabic":"وَعَنْ أُسَامَةَ بْنِ زَيْدٍ قَالَ: بَعَثَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى أُنَاسٍ مِنْ جُهَيْنَةَ فَأَتَيْتُ عَلَى رَجُلٍ مِنْهُمْ فَذَهَبْتُ أَطْعَنُهُ فَقَالَ: لَا إِلَهَ إِلَّا اللَّهُ فَطَعَنْتُهُ فَقَتَلْتُهُ فَجِئْتُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرْتُهُ فَقَالَ: «أقَتلتَه وقدْ شَهِدَ أَنْ لَا إِلَهَ إِلَّا اللَّهُ؟» قُلْتُ: يَا رَسُولَ اللَّهِ إِنَّمَا فَعَلَ ذَلِكَ تَعَوُّذًا قَالَ: «فهَلاَّ شقَقتَ عَن قلبه؟»\nوَفِي رِوَايَةِ جُنْدُبِ بْنِ عَبْدِ اللَّهِ الْبَجَلِيِّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «كَيْفَ تَصْنَعُ بِلَا إِلَهَ إِلَّا اللَّهُ إِذَا جَاءَتْ يَوْمَ الْقِيَامَةِ؟» . قَالَهُ مِرَارًا. رَوَاهُ مُسلم","english":{"narrator":"Usama b. Zaid said:","text":"God’s Messenger sent us to some people of Juhaina, and I attacked one of them and was about to spear him when he said, “There is no god but God.” I then speared him and killed him, after which I went and told the Prophet. He said, “Did you kill him when he had testified that there is no god but God?” I replied, “Messenger of God, he did that only as a means to escape death.” He asked, “Why did you not split his heart?”*\n\n(Bukhari and Muslim.) \n\n*He is here rebuked for attributing motives to the man when he could not know his inner motive. Splitting the heart is a figure of speech for examining the inner motives.\n\nIn the version of Jundub b. ‘Abdallah al-Bajali God’s Messenger is reported as saying several times, “How will you deal with ‘There is no god but God’ when it comes on the day of resurrection?” \n\nMuslim transmitted it."}},{"id":6,"idInBook":6,"chapterId":16,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ قَتَلَ مُعَاهِدًا لَمْ يَرَحْ رَائِحَةَ الْجَنَّةِ وَإِنَّ رِيحَهَا تُوجَدُ مِنْ مَسِيرَةِ أربعينَ خَرِيفًا» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"‘Abdallah b. ‘Amr reported God’s Messenger as saying, “If anyone kills a man who has made a covenant* he will not experience the fragrance of paradise, yet its odour can be experienced at a distance of forty years’ journey.” \n\nBukhari transmitted it.\n\n* Mu'ahid. This is used of a member of protected communities, but is also used of anyone who belongs to a non-Muslim community with whom a treaty of peace has been made."}},{"id":7,"idInBook":7,"chapterId":16,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ تَرَدَّى مِنْ جَبَلٍ فَقَتَلَ نَفْسَهُ فَهُوَ فِي نَارِ جَهَنَّمَ يَتَرَدَّى فِيهَا خَالِدًا مُخَلَّدًا فِيهَا أَبَدًا وَمَنْ تَحَسَّى سُمًّا فَقَتَلَ نَفْسَهُ فَسُمُّهُ فِي يَدِهِ يَتَحَسَّاهُ فِي نَارِ جَهَنَّمَ خَالِدًا مُخَلَّدًا فِيهَا أَبَدًا وَمَنْ قَتَلَ نَفْسَهُ بِحَدِيدَةٍ فَحَدِيدَتُهُ فِي يَدِهِ يَتَوَجَّأُ بِهَا فِي بَطْنِهِ فِي نَارِ جهنَّمَ خَالِدا مخلَّداً فِيهَا أبدا»","english":{"narrator":"","text":"Abu Huraira reported God’s Messenger as saying, “He who throws himself from a mountain and kills himself will be thrown down in the fire of jahannam and remain in it for ever and ever; he who sips poison and kills himself will have his poison in his hand and sip it for ever and ever in the fire of jahannam; and he who kills himself with a piece of iron will have his piece of iron in his hand and will be stabbed with it in his belly in the fire of jahannam for ever and ever.” \n\n(Bukhari and Muslim.)"}},{"id":8,"idInBook":8,"chapterId":16,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الَّذِي يَخْنُقُ نَفْسَهُ يَخْنُقُهَا فِي النَّارِ وَالَّذِي يَطْعَنُهَا يَطْعَنُهَا فِي النَّارِ» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"He reported God's Messenger as saying, “He who strangles himself will do so in hell, and he who thrusts a spear into himself will do so in hell.” \n\nBukhari transmitted it."}},{"id":9,"idInBook":9,"chapterId":16,"bookId":14,"arabic":"وَعَنْ جُنْدُبِ بْنِ عَبْدُ اللَّهِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" كَانَ فِيمَنْ كَانَ قَبْلَكُمْ رَجُلٌ بِهِ جُرْحٌ فجزِعَ فأخذَ سكيّناً فحزَّ بِهَا يَدَهُ فَمَا رَقَأَ الدَّمُ حَتَّى مَاتَ قَالَ اللَّهُ تَعَالَى: بَادَرَنِي عَبْدِي بِنَفْسِهِ فَحَرَّمْتُ عَلَيْهِ الْجنَّة \"","english":{"narrator":"","text":"Jundub b. ‘Abdallah reported God’s Messenger as saying that among those who lived before their time there was a man who had a wound and had so little patience to bear it that he took a knife with which he cut off his hand, but the blood did not cease to flow till he died. God most high said, “My servant has tried to outstrip me in taking his life, so I have excluded him from paradise.” \n\n(Bukhari and Muslim.)"}},{"id":10,"idInBook":10,"chapterId":16,"bookId":14,"arabic":"وَعَنْ جَابِرٍ: أَنَّ الطُّفَيْلَ بْنَ عَمْرٍو الدَّوْسِيَّ لَمَّا هَاجَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْمَدِينَةِ هَاجَرَ إِلَيْهِ وَهَاجَرَ مَعَهُ رَجُلٌ مِنْ قَوْمِهِ فَمَرِضَ فَجَزِعَ فَأَخَذَ مَشَاقِصَ لَهُ فَقَطَعَ بِهَا بَرَاجِمَهُ فَشَخَبَتْ يَدَاهُ حَتَّى مَاتَ فَرَآهُ الطُّفَيْلُ بْنُ عَمْرٍو فِي مَنَامِهِ وَهَيْئَتُهُ حسنةٌ ورآهُ مغطيّاً يدَيْهِ فَقَالَ لَهُ: مَا صنع بِكُل رَبُّكَ؟ فَقَالَ: غَفَرَ لِي بِهِجْرَتِي إِلَى نَبِيِّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: مَا لِي أَرَاكَ مُغَطِّيًا يَدَيْكَ؟ قَالَ: قِيلَ لِي: لَنْ تصلح مِنْكَ مَا أَفْسَدْتَ فَقَصَّهَا الطُّفَيْلُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «اللَّهُمَّ وَلِيَدَيْهِ فَاغْفِر» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Jabir said that when the Prophet emigrated to Medina at-Tufail b. ‘Amr ad-Dausi did so also accompanied by one of his people who became ill and had so little patience to bear it that he took some arrow heads of his with which he cut his knuckles, and his hands flowed with blood till he died. Then at-Tufail b. ‘Amr saw him in a dream with a fine appearance and saw him covering his hands, so he said to him, “What did your Lord do to you?\" He replied, “He forgave me because of my emigration to His prophet.” He asked, “How is it that I see you covering your hands? He replied that it had been said to him, “We will not put right what you have spoilt.\" At-Tufail told this to the Prophet and he said, “O God, forgive his hands also.\" \n\nMuslim transmitted it."}},{"id":11,"idInBook":11,"chapterId":16,"bookId":14,"arabic":"وَعَن أبي شُرَيحٍ الكعبيِّ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" ثُمَّ أَنْتُمْ يَا خُزَاعَةُ قَدْ قَتَلْتُمْ هَذَا الْقَتِيلَ مِنْ هُذَيْلٍ وَأَنَا وَاللَّهِ عَاقِلُهُ مَنْ قَتَلَ بَعْدَهُ قَتِيلًا فَأَهْلُهُ بَيْنَ خِيرَتَيْنِ: عَن أَحبُّوا قتلوا وَإِن أَحبُّوا أخذا العقلَ \". رَوَاهُ الترمذيُّ وَالشَّافِعِيّ. وَفِي شرح السنَّة بإِسنادِه وَصَرَّحَ: بِأَنَّهُ لَيْسَ فِي الصَّحِيحَيْنِ عَنْ أَبِي شُرَيْح وَقَالَ:\nوَأَخْرَجَاهُ مِنْ رِوَايَةِ أَبِي هُرَيْرَةَ يَعْنِي بِمَعْنَاهُ","english":{"narrator":"","text":"Abu Shuraih al-Ka'bi reported God’s Messenger as saying, “Then you, Khuza’a, have killed this man of Hudhail, but I swear by God that I will pay his blood wit. If anyone kills a man hereafter his people will have a choice, to kill him if they wish, or to accept blood wit if they wish.\" \n\nTirmidhi and Shafi‘i transmitted it. It occurs in Sharh as-sunna with his isnad, but it states clearly that it does not occur in the two Sahihs on the authority of Abu Shuraih, saying that they rendered it from Abu Huraira’s version, meaning something similar.*\n\n*In Masabih as-sunna the tradition is given among the sound ones without any reference to its source. Here Sharh as-sunna is quoted to the effect that the above tradition is not given by Bukhari or Muslim, but that they give something similar on Abu Huraira’s authority. Section 1 is normally confined to traditions from Bukhari or Muslim, or from both, so it is strange to find that a tradition from another source is here preferred to theirs."}},{"id":12,"idInBook":12,"chapterId":16,"bookId":14,"arabic":"وَعَنْ أَنَسٍ: أَنَّ يَهُودِيًّا رَضَّ رَأْسَ جَارِيَةٍ بَيْنَ حَجَرَيْنِ فَقِيلَ لَهَا: مَنْ فَعَلَ بِكِ هَذَا؟ أَفُلَانٌ؟ حَتَّى سُمِّيَ الْيَهُودِيُّ فَأَوْمَأَتْ بِرَأْسِهَا فَجِيءَ بِالْيَهُودِيِّ فَاعْتَرَفَ فَأَمَرَ بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرُضَّ رَأْسُهُ بِالْحِجَارَةِ","english":{"narrator":"","text":"Anas said that a Jew crushed a girl’s head between two stones and she was asked who had done this to her, whether it was so and so, or so and so, until the Jew was named, whereupon she gave a sign with her head. The Jew was fetched, and when he admitted it God’s Messenger gave command that his head should be crushed with stones.\n\n(Bukhari and Muslim.)"}},{"id":13,"idInBook":13,"chapterId":16,"bookId":14,"arabic":"وَعَنْهُ قَالَ: كَسَرَتِ الرُّبَيِّعُ وَهِيَ عَمَّةُ أَنَسِ بْنِ مَالِكٍ ثَنِيَّةَ جَارِيَةٍ مِنَ الْأَنْصَارِ فَأَتَوُا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَ بِالْقِصَاصِ فَقَالَ أَنَسُ بْنُ النَّضْرِ عَمُّ أَنَسِ بْنِ مَالِكٍ لَا وَاللَّهِ لَا تُكْسَرُ ثَنِيَّتُهَا يَا رَسُولَ اللَّهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَا أَنَسُ كِتَابُ اللَّهِ الْقِصَاصُ» فَرَضِيَ الْقَوْمُ وَقَبِلُوا الْأَرْشَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ مِنْ عِبَادِ اللَّهِ مَنْ لَوْ أَقْسَمَ عَلَى الله لَأَبَره»","english":{"narrator":"","text":"He said that ar-Rubaiyi‘, paternal aunt of Anas b. Malik, broke the front tooth of a girl of the Ansar, and when they went to the Prophet he ordered retaliation to be taken. Then Anas b. an-Nadr, paternal uncle of Anas b. Malik, said, “No, by God, her front tooth will not be broken, Messenger of God.\" He replied, “Anas, God’s decree is retaliation.\" But the people were agreeable to accepting a fine, so God’s Messenger said, “Among God’s servants there are those who, if one adjured God, would consent to it.\" \n\n(Bukhari and Muslim.)"}},{"id":14,"idInBook":14,"chapterId":16,"bookId":14,"arabic":"وَعَن أبي جُحيفةَ قَالَ: سَأَلْتُ عَلِيًّا رَضِيَ اللَّهُ عَنْهُ هَلْ عِنْدَكُمْ شَيْءٌ لَيْسَ فِي الْقُرْآنِ؟ فَقَالَ: وَالَّذِي فَلَقَ الْحَبَّةَ وَبَرَأَ النَّسَمَةَ مَا عِنْدَنَا إِلَّا مَا فِي الْقُرْآنِ إِلَّا فَهْمًا يُعْطَى رَجُلٌ فِي كِتَابِهِ وَمَا فِي الصَّحِيفَةِ قُلْتُ: وَمَا فِي الصَّحِيفَةِ؟ قَالَ: الْعَقْلُ وَفِكَاكُ الْأَسِيرِ وَأَنْ لَا يُقْتَلَ مُسْلِمٌ بِكَافِرٍ. \nرَوَاهُ الْبُخَارِيُّ","english":{"narrator":"","text":"Abu Juhaifa said he asked ‘Ali whether he had any instruction not contained in the Qur’an and he replied, “By Him who split the seed and created the soul, I have nothing but what is in the Qur’an, except understanding which a man is given regarding His Book and what is in the document.” He asked him what the document contained, and he replied, “Blood wit, the setting free of a prisoner, and that a Muslim should not be killed for an infidel.” \n\nBukhari transmitted it."}},{"id":15,"idInBook":15,"chapterId":16,"bookId":14,"arabic":"عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَزَوَالُ الدُّنْيَا أَهْوَنُ عَلَى اللَّهِ مِنْ قَتْلِ رَجُلٍ مُسْلِمٍ» . رَوَاهُ التِّرْمِذِيّ وَالنَّسَائِيّ ووقفَه بعضُهم وَهُوَ الْأَصَح\nوَرَوَاهُ ابْنُ مَاجَهْ عَنِ الْبَرَاءِ بْنِ عَازِبٍ","english":{"narrator":"","text":"'Abdallah b. ‘Amr reported the Prophet as saying, “The passing away of the world would mean less to God than the murder of a Muslim man.” \n\nTirmidhi and Nasa’i transmitted it. Some traced it only to the Companion, and that is the soundest view. Ibn Majah transmitted it on the authority of al-Bara’ b. 'Azib."}},{"id":16,"idInBook":16,"chapterId":16,"bookId":14,"arabic":"وَعَن أبي سعيدٍ وَأبي هريرةَ عَن رسولِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَوْ أَنَّ أَهْلَ السَّمَاءِ وَالْأَرْضِ اشْتَرَكُوا فِي دَمِ مُؤْمِنٍ لَأَكَبَّهُمُ اللَّهُ فِي النَّارِ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ غَرِيبٌ","english":{"narrator":"","text":"Abu Sa'id and Abu Huraira reported God's Messenger as saying, “If the inhabitants of heaven and earth were to share in  the blood of a believer, God would overturn them in hell.” \n\nTirmidhi transmitted it, saying this is a gharib tradition."}},{"id":17,"idInBook":17,"chapterId":16,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" يَجِيءُ الْمَقْتُولُ بِالْقَاتِلِ يَوْمَ الْقِيَامَةِ نَاصِيَتُهُ وَرَأْسُهُ بِيَدِهِ وَأَوْدَاجُهُ تَشْخُبُ دَمًا يَقُولُ: يَا رَبِّ قَتَلَنِي حَتَّى يُدْنِيَهُ مِنَ العرشِ \". رَوَاهُ التِّرْمِذِيّ وَالنَّسَائِيّ وَابْن مَاجَه","english":{"narrator":"","text":"Ibn ‘Abbas reported the Prophet as saying, “On the day of resurrection the slain will bring the slayer with his forelock and his head in his hand, his own jugular vein meanwhile dripping with blood, and he will say, ‘My Lord, he killed me’ till he brings him near the Throne.” \n\nTirmidhi, Nasa’i and Ibn Majah transmitted it."}},{"id":18,"idInBook":18,"chapterId":16,"bookId":14,"arabic":"وَعَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ أَنَّ عُثْمَانَ بْنَ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ أَشْرَفَ يَوْمَ الدَّارِ فَقَالَ: أَنْشُدُكُمْ بِاللَّهِ أَتَعْلَمُونَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" لَا يَحِلُّ دَمُ امْرِئٍ مُسْلِمٍ إِلَّا بِإِحْدَى ثلاثٍ: زِنىً بَعْدَ إِحْصَانٍ أَوْ كُفْرٌ بَعْدَ إِسْلَامٍ أَوْ قتْلِ نفْسٍ بِغَيْر حق فَقتل بِهِ \"؟ فو الله مَا زَنَيْتُ فِي جَاهِلِيَّةٍ وَلَا إِسْلَامٍ وَلَا ارْتَدَدْتُ مُنْذُ بَايَعْتُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَا قَتَلْتُ النَّفْسَ الَّتِي حَرَّمَ اللَّهُ فَبِمَ تَقْتُلُونَنِي؟ رَوَاهُ التِّرْمِذِيُّ وَالنَّسَائِيُّ وَابْنُ مَاجَه وللدارمي لفظ الحَدِيث","english":{"narrator":"Abu Umama b. Sahl b. Hunaif told that when ‘Uthman b. ‘Affan was besieged he looked down and said:","text":"I adjure you by God. Are you aware that God’s Messenger said, “It is not lawful to kill a man who is a Muslim except for one of three reasons: fornication after marriage, or unbelief after accepting Islam, or wrongfully killing someone, for which he may be killed”? I swear by God that I have not committed fornication before or after the coming of Islam, or apostatised since I swore allegiance to God's Messenger, or killed anyone whom God has declared inviolate; so for what reason do you want to kill me? \n\nTirmidhi, Nasa'i and Ibn Majah transmitted it, and Darimi gives the wording of the tradition."}},{"id":19,"idInBook":19,"chapterId":16,"bookId":14,"arabic":"وَعَنْ أَبِي الدَّرْدَاءِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يَزَالُ الْمُؤْمِنُ مُعْنِقًا صَالِحًا مَا لَمْ يُصِبْ دَمًا حَرَامًا فَإِذَا أَصَابَ دَمًا حَرَامًا بَلَّحَ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Abu ad-Darda’ reported God’s Messenger as saying, “A believer will continue to go on quickly and well* so long as he does not kill anyone unlawfully, but when he does so he will grow weary.” \n\nAbu Dawud transmitted it.\n\n*i.e. quick to obey God’s commands and observing well what is due to God and man."}},{"id":20,"idInBook":20,"chapterId":16,"bookId":14,"arabic":"وَعَنْهُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «كُلُّ ذَنْبٍ عَسَى اللَّهُ أَنْ يَغْفِرَهُ إِلَّا مَنْ مَاتَ مُشْرِكًا أَوْ مَنْ يقتُلُ مُؤمنا مُتَعَمدا» . رَوَاهُ أَبُو دَاوُد\nوَرَوَاهُ النَّسَائِيّ عَن مُعَاوِيَة","english":{"narrator":"","text":"He reported God’s Messenger as saying, “God may forgive every sin, except in the case of one who dies a polytheist, or one who purposely kills a believer.” \n\nAbu Dawud transmitted it, and Nasa’i transmitted it on the authority of Mu'awiya."}},{"id":21,"idInBook":21,"chapterId":16,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تُقَامُ الْحُدُودُ فِي الْمَسَاجِدِ وَلَا يُقَادُ بِالْوَلَدِ الْوَالِدُ» . رَوَاهُ التِّرْمِذِيّ والدارمي","english":{"narrator":"","text":"Ibn ‘Abbas reported God’s Messenger as saying, “The prescribed punishments are not to be inflicted in mosques and a father is not to be killed for a son.” \n\nTirmidhi and Darimi transmitted it."}},{"id":22,"idInBook":22,"chapterId":16,"bookId":14,"arabic":"وَعَن أبي رِمْثَةَ قَالَ: أَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَعَ أبي فقالَ: «مَنْ هَذَا الَّذِي مَعَكَ؟» قَالَ: ابْنِي أَشْهَدُ بِهِ قَالَ: «أَمَا إِنَّهُ لَا يَجْنِي عَلَيْكَ وَلَا تَجْنِي عَلَيْهِ» . رَوَاهُ أَبُو دَاوُدَ وَالنَّسَائِيُّ وَزَادَ فِي «شَرْحِ السُّنَّةِ» فِي أَوَّلِهِ قَالَ: دَخَلْتُ مَعَ أَبِي عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَأَى أَبِي الَّذِي بِظَهْرِ رَسُول الله صلى الله عَلَيْهِ وَسلم فَقَالَ: دَعْنِي أُعَالِجُ الَّذِي بِظَهْرِكِ فَإِنِّي طَبِيبٌ. فَقَالَ: «أَنْتَ رفيقٌ واللَّهُ الطبيبُ»","english":{"narrator":"Abu Rimtha said:","text":"I came to God’s Messenger with my father, and on his asking who this was along with him, he replied, “He is my son; be witness to the fact.” He said, “He will not bring evil on you, nor will you bring evil on him.”*\n\nAbu Dawud and Nasa’i transmitted it. \n\n* This is explained as meaning that neither will be punished for the wrong done by the other.\n\nIn Sharh as-sunna there is an addition at the beginning. He said: I went in with my father to see God’s Messenger, and when my father saw what was on God's Messenger’s back he said, “Let me treat what is on your back, for I am a physician.” He replied, “You are the helper, but God is the Physician.”*\n\n*i.e. you act in a gentle manner giving help and advice, but only God can cure."}},{"id":23,"idInBook":23,"chapterId":16,"bookId":14,"arabic":"وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جدِّهِ عَن سُراقةَ بنِ مالكٍ قَالَ: حَضَرْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُقِيدُ الْأَبَ مِنِ ابْنِهِ وَلَا يُقِيدُ الِابْنَ من أَبِيه. رَوَاهُ التِّرْمِذِيّ (لم تتمّ دراسته)\nوَضَعفه","english":{"narrator":"","text":"‘Amr b. Shu'aib, on his father’s authority, said his grandfather told that Suraqa b. Malik said he was present when God's Messenger allowed a father to take retaliation on his son, but did not allow a son to take retaliation on his father. \n\nTirmidhi transmitted it, declaring it to be weak."}},{"id":24,"idInBook":24,"chapterId":16,"bookId":14,"arabic":"وَعَن الْحسن عَن سَمُرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ قَتَلَ عَبْدَهُ قَتَلْنَاهُ وَمَنْ جَدَعَ عَبْدَهُ جَدَعْنَاهُ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ وَزَادَ النَّسَائِيُّ فِي رِوَايَةٍ أُخْرَى: «وَمن خصى عَبده خصيناه»","english":{"narrator":"","text":"Al-Hasan, on Samura’s authority, quoted God’s Messenger as saying, “If anyone kills his slave we will kill him, and if anyone maims his slave we will maim him.” \n\nTirmidhi, Abu Dawud, Ibn Majah and Darimi transmitted it, and Nasa’i added in another version, “If anyone castrates his slave we will castrate him.”"}},{"id":25,"idInBook":25,"chapterId":16,"bookId":14,"arabic":"وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" مَنْ قَتَلَ مُتَعَمِّدًا دُفِعَ إِلَى أولياءِ المقتولِ فإِنْ شاؤوا قَتَلوا وإِنْ شَاؤوا أَخَذُوا الدِّيَةَ: وَهِيَ ثَلَاثُونَ حِقَّةً وَثَلَاثُونَ جَذَعَةً وَأَرْبَعُونَ خَلِفَةً وَمَا صَالَحُوا عَلَيْهِ فَهُوَ لَهُمْ \". رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"'Amr b. Shu'aib, on his father’s authority, said his grandfather reported God’s Messenger as saying, “If anyone kills a man deliberately he is to be handed over to the relatives of the one who has been killed. If they wish they may kill him, but if they wish they may accept blood wit, which is thirty she-camels in their fourth year, thirty in their fifth year, and forty pregnant she-camels. Any arrangement they make with him is for them to decide.” \n\nTirmidhi transmitted it."}},{"id":26,"idInBook":26,"chapterId":16,"bookId":14,"arabic":"وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْمُسْلِمُونَ تَتَكَافَأُ دِمَاؤُهُمْ وَيَسْعَى بِذِمَّتِهِمْ أَدْنَاهُمْ وَيَرُدُّ عَلَيْهِمْ أَقْصَاهُمْ وَهُمْ يَدٌ عَلَى مَنْ سِوَاهُمْ أَلَا لَا يُقْتَلُ مُسْلِمٌ بِكَافِرٍ وَلَا ذُو عَهْدٍ فِي عَهْدِه» . رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ\nوَرَوَاهُ ابْن مَاجَه عَن ابْن عَبَّاس","english":{"narrator":"","text":"‘Ali reported the Prophet as saying, “The lives of all Muslims are equal; the lowliest of them can guarantee their protection, the most distant can keep others from breaking protection he has given,* and they are one band against others. A Muslim must not be killed for an infidel, nor must one who has been given a covenant be killed while his covenant holds.” \n\nAbu Dawud and Nasa’i transmitted it, and Ibn Majah transmitted it on the authority of Ibn ‘Abbas.\n\n* The interpretation which seems to be preferred is that no matter how far one may live from the land of infidels, any protection one may guarantee to an infidel must be respected by all Muslims. Another possible explanation is that when a detachment is sent ahead into infidel country those who remain behind them are entitled to their portion of any spoil they take, but it is felt that this meaning does not suit the context. The Arabic words are wa-yaruddu 'alaihim aqsahum."}},{"id":27,"idInBook":27,"chapterId":16,"bookId":14,"arabic":"وَعَن أبي شُريحِ الخُزاعيِّ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: \n\" مَنْ أُصِيبَ بِدَمٍ أَوْ خَبْلٍ وَالْخَبْلُ: الْجُرْحُ فَهُوَ بِالْخِيَارِ بَيْنَ إِحْدَى ثَلَاثٍ: فَإِنْ أَرَادَ الرَّابِعَةَ فَخُذُوا عَلَى يَدَيْهِ: بَيْنَ أَنْ يَقْتَصَّ أَوْ يَعْفُوَ أَوْ يَأْخُذَ الْعَقْلَ فَإِنْ أَخَذَ مِنْ ذَلِكَ شَيْئًا ثُمَّ عَدَا بَعْدَ ذَلِكَ فَلَهُ النَّارُ خَالِدًا فِيهَا مُخَلَّدًا أبدا \". رَوَاهُ الدَّارمِيّ","english":{"narrator":"","text":"Abu Shuraih al-Khuza'i told that he heard God's Messenger say, “If a relative of anyone is killed, or if he suffers khabal, which means a wound, he may choose one of three things, but if he wants anything more* you must restrain him. He may retaliate, or forgive, or receive compensation; but if he accepts one of these and afterwards asks something more, he will go to hell for ever and ever.” \n\nDarimi transmitted it.\n\n* Literally “the fourth.”"}},{"id":28,"idInBook":28,"chapterId":16,"bookId":14,"arabic":"وَعَن طَاوُوس عَنِ ابْنِ عَبَّاسٍ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ قُتِلَ فِي عِمِّيَّةٍ فِي رَمْيٍ يَكُونُ بَيْنَهُمْ بِالْحِجَارَةِ أَوْ جَلْدٍ بِالسِّيَاطِ أَوْ ضَرْبٍ بِعَصًا فَهُوَ خَطَأٌ عقله الْخَطَأِ وَمَنْ قَتَلَ عَمْدًا فَهُوَ قَوَدٌ وَمَنْ حَالَ دُونَهُ فَعَلَيْهِ لَعْنَةُ اللَّهِ وَغَضَبُهُ لَا يُقْبَلُ مِنْهُ صَرْفٌ وَلَا عَدْلٌ» . رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ","english":{"narrator":"","text":"Ta’us, on the authority of Ibn ‘Abbas, reported God’s Messenger as saying, “If anyone is killed in error when people are throwing stones, or by beating with whips, or striking with a stick, it is accidental and the compensation for accidental death is due.* But if anyone kills someone deliberately retaliation is due, and if anyone tries to prevent it God’s curse and anger will rest on him, and neither supererogatory nor obligatory acts will be accepted from him.” \n\nAbu Dawud and Nasa’i transmitted it.\n\n*These are instances in which the actual person who killed him is not clearly known, or where there was no intention to kill."}},{"id":29,"idInBook":29,"chapterId":16,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا أُعْفِي مَنْ قَتَلَ بعدَ أَخذ الديةِ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Jabir reported God’s Messenger as saying, “I will not forgive any-one who kills after accepting blood wit.” \n\nAbu Dawud transmitted it."}},{"id":30,"idInBook":30,"chapterId":16,"bookId":14,"arabic":"وَعَنْ أَبِي الدَّرْدَاءِ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَا مِنْ رَجُلٍ يُصَابُ بِشَيْءٍ فِي جَسَدِهِ فَتَصَدَّقَ بِهِ إِلَّا رَفَعَهُ اللَّهُ بِهِ دَرَجَةً وَحَطَّ عَنْهُ خَطِيئَة» . رَوَاهُ التِّرْمِذِيّ وَابْن مَاجَه","english":{"narrator":"","text":"Abud Darda’ told that he heard God’s Messenger say, “No one will suffer any bodily injury and forgive it* without God raising him a degree for it and removing a sin from him.” \n\nTirmidhi and Ibn Majah transmitted it.\n\n* Literally \"give it as sadaqa.”"}},{"id":31,"idInBook":31,"chapterId":16,"bookId":14,"arabic":"عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ: أَنَّ عُمَرَ بْنَ الْخطاب قَتَلَ نَفَرًا خَمْسَةً أَوْ سَبْعَةً بِرَجُلٍ وَاحِدٍ قَتَلُوهُ قَتْلَ غِيلَةٍ وَقَالَ عُمَرُ: لَوْ تَمَالَأَ عَلَيْهِ أَهْلُ صَنْعَاءَ لَقَتَلْتُهُمْ جَمِيعًا. رَوَاهُ مَالِكٌ\nوروى البُخَارِيّ عَن ابْن عمر نَحوه","english":{"narrator":"","text":"Sa'id b. al-Musayyib told that ‘Umar b. al-Khattab killed five or seven people for one man whom they had killed treacherously, ‘Umar saying. “If the people of San'a’ had conspired against him I would have killed them all.” \n\nMalik transmitted it, and Bukhari transmitted something similar on the authority of Ibn ‘Umar."}},{"id":32,"idInBook":32,"chapterId":16,"bookId":14,"arabic":"وَعَن جُنْدبٍ قَالَ: حَدَّثَنِي فُلَانٌ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" يَجِيءُ الْمَقْتُولُ بِقَاتِلِهِ يَوْمَ الْقِيَامَةِ فَيَقُولُ: سَلْ هَذَا فِيمَ قَتَلَنِي؟ فَيَقُولُ: قَتَلْتُهُ عَلَى مُلْكِ فُلَانٍ \". قَالَ جُنْدُبٌ: فاتَّقِها. رَوَاهُ النَّسَائِيّ","english":{"narrator":"","text":"Jundub said he was told by so and so that God’s Messenger said, “On the day of resurrection the man who has been killed will bring the one who killed him and say, ‘Ask this man why he killed me,’ and he will say, ‘I killed him on account of so and so's property’.”* Jundub said, “Avoid that.” \n\nNasa’i transmitted it.\n\n* There is some doubt as to whether the word is to be read milk or mulk. The translation above follows the former the latter is the correct reading it would require \"in the time of so and so's reign.\" This, however, does not seem to suit the context."}},{"id":33,"idInBook":33,"chapterId":16,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَعَانَ عَلَى قَتْلِ مُؤْمِنٍ شَطْرَ كَلِمَةٍ لَقِيَ اللَّهَ مَكْتُوبٌ بينَ عينيهِ آيسٌ من رَحْمَة الله» . رَوَاهُ ابْن مَاجَه","english":{"narrator":"","text":"Abu Huraira reported God’s Messenger as saying, “If anyone helps in killing a believer to the extent of half a word,* he will meet God with ‘Despairing of God’s mercy’ written on his forehead.” \n\nIbn Majah transmitted it.\n\n* This is taken to mean that it is a serious matter even to utter half the word which expresses an intention to kill a believer."}},{"id":34,"idInBook":34,"chapterId":16,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا أَمْسَكَ الرَّجُلُ الرَّجُلَ وَقَتَلَهُ الْآخَرُ يُقْتَلُ الَّذِي قتَل ويُحبسُ الَّذِي أمْسَكَ» . رَوَاهُ الدَّارَقُطْنِيّ","english":{"narrator":"","text":"Ibn ‘Umar reported the Prophet as saying, “If a man seizes a man and another kills him, the one who killed him is to be killed and the one who seized him is to be imprisoned.” \n\nDaraqutni transmitted it."}},{"id":35,"idInBook":35,"chapterId":16,"bookId":14,"arabic":"عَنِ ابْنِ عَبَّاسٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «هَذِهِ وَهَذِهِ سَوَاءٌ» يَعْنِي الخِنصرُ والإبهامَ. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Ibn ‘Abbas reported the Prophet as saying, “This and that are equal,” meaning the little finger and the thumb. \n\nBukhari transmitted it."}},{"id":36,"idInBook":36,"chapterId":16,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي جَنِينِ امْرَأَةٍ مَنْ بَنِي لِحْيَانَ سَقَطَ مَيِّتًا بِغُرَّةِ: عَبْدٍ أَوْ أَمَةٍ ثُمَّ إِنَّ الْمَرْأَةَ الَّتِي قُضِيَ عَلَيْهَا بِالْغُرَّةِ تُوُفِّيَتْ فَقَضَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِأَنْ مِيرَاثَهَا لبنيها وَزوجهَا الْعقل على عصبتها","english":{"narrator":"","text":"Abu Huraira told that God’s Messenger gave judgment, when the child of a woman of the B. Lihyan was born dead,* that a male or female slave of the best quality be paid in compensation. Then the woman against whom he had given this judgment died, and God’s Messenger gave judgment that her sons and husband should inherit from her and that the compensation should be paid by her relatives on her father’s side. \n\n(Bukhari and Muslim.)\n\n* Lihyan were a section of the tribe of Hudhail, so this tradition may be explained by what is said in the next ones. It was not merely an instance of a child being born dead; this was due to the injury caused by another woman."}},{"id":37,"idInBook":37,"chapterId":16,"bookId":14,"arabic":"وَعَنْهُ قَالَ: اقْتَتَلَتِ امْرَأَتَانِ مِنْ هُذَيْلٍ فَرَمَتْ إِحْدَاهُمَا الْأُخْرَى بِحَجَرٍ فَقَتَلَتْهَا وَمَا فِي بَطْنِهَا فَقَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ دِيَةَ جَنِينِهَا غُرَّةٌ: عَبْدٌ أَوْ وَلِيدَةٌ وَقَضَى بِدِيَةِ الْمَرْأَةِ عَلَى عَاقِلَتِهَا وورَّثَها ولدَها وَمن مَعَهم","english":{"narrator":"","text":"He said that two women of Hudhail fought together and one of them threw a stone at the other killing both her and what was in her womb. Then God’s Messenger gave judgment that the blood wit for her unborn child should be a male or female slave of the best quality, he gave judgment that the woman responsible for blood wit should pay her blood wit, and he made her sons and those who were with them her heirs. \n\n(Bukhari and Muslim.)"}},{"id":38,"idInBook":38,"chapterId":16,"bookId":14,"arabic":"وَعَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ: أَنَّ امْرَأَتَيْنِ كَانَتَا ضَرَّتَيْنِ فَرَمَتْ إِحْدَاهُمَا الْأُخْرَى بِحَجَرٍ أَوْ عَمُودِ فُسْطَاطٍ فَأَلْقَتْ جَنِينَهَا فَقَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الجَنينِ غُرَّةً: عبْداً أَوْ أَمَةٌ وَجَعَلَهُ عَلَى عَصَبَةِ الْمَرْأَةِ هَذِهِ رِوَايَةُ التِّرْمِذِيِّ وَفِي رِوَايَةِ مُسْلِمٍ: قَالَ: ضَرَبَتِ امْرَأَةٌ ضَرَّتَهَا بِعَمُودِ فُسْطَاطٍ وَهِيَ حُبْلَى فَقَتَلَتْهَا قَالَ: وَإِحْدَاهُمَا لِحْيَانَيَّةٌ قَالَ: فَجَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دِيَة الْمَقْتُول عَلَى عَصَبَةِ الْقَاتِلَةِ وَغُرَّةً لِمَا فِي بَطْنِهَا","english":{"narrator":"","text":"Al-Mughira b. Shu'ba told that one of two women who were fellow-wives threw a stone or a tent-pole at the other causing an abortion, and God’s Messenger gave judgment that a male or female slave of the best quality be given as compensation for the abortion, and he appointed it to be paid by the woman’s relatives on the father's side. This is Tirmidhi’s version.* \n\nTirmidhi\n\n* The principle mentioned in the preface is not observed here. Section 1 should have only traditions from Bukhari or Muslim, but here Tirmidhi’s version is given first.\n\nIn Muslim’s version he said that a woman struck her fellow-wife with a tent-pole when she was pregnant and killed her, adding that one of them belonged to Lihyan. He said that God’s Messenger made the blood wit for the woman who was killed payable by the paternal relatives of the woman who killed her, and made a slave of the best quality the compensation for the child that had been in her womb.\n\nMuslim."}},{"id":39,"idInBook":39,"chapterId":16,"bookId":14,"arabic":"عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" أَلَا إِنَّ دِيَةَ الْخَطَأِ شِبْهِ الْعَمْدِ مَا كَانَ بِالسَّوْطِ وَالْعَصَا مِائَةٌ مِنَ الإِبلِ: مِنْهَا أربعونَ فِي بطونِها أولادُها \". رَوَاهُ النسائيُّ وَابْن مَاجَه والدارمي\nوَرَوَاهُ أَبُو دَاوُد عَنهُ وَابْن مَاجَه وَعَن ابْن عمر. وَفِي «شَرْحِ السُّنَّةِ» لَفْظُ «الْمَصَابِيحِ» عَنِ ابْنِ عمر","english":{"narrator":"","text":"'Abdallah b. ‘Amr reported God's Messenger as saying, “The blood wit for unintentional murder which resembles intentional, such as is done with a whip and a stick, is a hundred camels, forty of which are pregnant.” \n\nNasa'i, Ibn Majah and Darimi transmitted it, and Abu Dawud transmitted it both on his authority and on that of Ibn ‘Umar. Sharh as-sunna has the wording in al-Masabih on the authority of Ibn ‘Umar."}},{"id":40,"idInBook":40,"chapterId":16,"bookId":14,"arabic":"وَعَنْ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَتَبَ إِلَى أَهْلِ الْيَمَنِ وَكَانَ فِي كِتَابِهِ: «أَنَّ مَنِ اعْتَبَطَ مُؤْمِنًا قَتْلًا فَإِنَّهُ قَوَدُ يَدِهِ إِلَّا أَنْ يَرْضَى أَوْلِيَاءُ الْمَقْتُولِ» وَفِيهِ: «أَنَّ الرَّجُلَ يُقْتَلُ بِالْمَرْأَةِ» وَفِيهِ: «فِي النَّفْسِ الدِّيَةُ مِائَةٌ مِنَ الْإِبِلِ وَعَلَى أَهْلِ الذَّهَبِ أَلْفُ دِينَارٍ وَفِي الْأَنْفِ إِذَا أُوعِبَ جَدْعُهُ الدِّيَةُ مِائَةٌ مِنَ الْإِبِلِ وَفِي الْأَسْنَانِ الدِّيَةُ وَفِي الشفتين الدِّيَة وَفِي البيضين الدِّيةُ وَفِي الذَّكرِ الدِّيةُ وَفِي الصُّلبِ الدِّيَةُ وَفِي الْعَيْنَيْنِ الدِّيَةُ وَفِي الرِّجْلِ الْوَاحِدَةِ نِصْفُ الدِّيَةِ وَفِي الْمَأْمُومَةِ ثُلُثُ الدِّيَةِ وَفِي الجائفَةِ ثلث الدِّيَة وَفِي المنقلة خمس عشر مِنَ الْإِبِلِ وَفِي كُلِّ أُصْبُعٍ مِنْ أَصَابِعِ الْيَدِ وَالرِّجْلِ عَشْرٌ مِنَ الْإِبِلِ وَفِي السِّنِّ خَمْسٌ مِنَ الْإِبِلِ» . رَوَاهُ النَّسَائِيُّ وَالدَّارِمِيُّ وَفِي رِوَايَةِ مَالِكٍ: «وَفِي الْعَيْنِ خَمْسُونَ وَفِي الْيَدِ خَمْسُونَ وَفِي الرِّجْلِ خَمْسُونَ وَفِي الْمُوضِحَةِ خَمْسٌ»","english":{"narrator":"Abu Bakr b. Muhammad b. ‘Amr b. Hazm, on his father’s authority, said his grandfather told that God’s Messenger wrote to the people of the Yemen, and that his letter contained the following:","text":"“If anyone kills a believer wrongfully he must suffer retaliation for what his hand has done unless the relatives of the one who is killed are willing to do otherwise.” It also said that a man may be killed in retaliation for a woman; that the blood wit for a life is a hundred camels; that those who have gold should pay a thousand dinars; that for the complete cutting off of a nose the blood wit of a hundred camels must be paid; that full blood wit must be paid for the teeth, the lips, the testicles, the penis, the backbone and the eyes ; that for one foot half the blood wit must be paid, for a wound in the head a third of the blood wit, for a thrust which penetrates the body a third of the blood wit, for a head wound which removes a bone fifteen camels, for each finger and toe ten camels, and for tooth five camels. \n\nNasa’i and Darimi transmitted it. In Malik’s version it says: For an eye fifty, for a hand fifty, for a foot fifty, and for a wound which lays bare the bone five."}},{"id":41,"idInBook":41,"chapterId":16,"bookId":14,"arabic":"وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ: قَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْمَوَاضِحِ خَمْسًا خَمْسًا مِنَ الْإِبِلِ وَفِي الْأَسْنَانِ خَمْسًا خَمْسًا مِنَ الْإِبِلِ. رَوَاهُ أَبُو دَاوُدَ وَالنَّسَائِيُّ وَالدَّارِمِيُّ وَرَوَى التِّرْمِذِيُّ وابنُ مَاجَه الْفَصْل الأول","english":{"narrator":"","text":"‘Amr b. Shu'aib, on his father’s authority, told that his grandfather said God’s Messenger gave judgment that five camels be paid for every wound which lays bare a bone, and five camels for every tooth. \n\nAbu Dawud, Nasa’i and Darimi transmitted it, and Tirmidhi and Ibn Majah transmitted the first part."}},{"id":42,"idInBook":42,"chapterId":16,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: جَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَصَابِعَ الْيَدَيْنِ وَالرِّجْلَيْنِ سَوَاء. رَوَاهُ أَبُو دَاوُد وَالتِّرْمِذِيّ","english":{"narrator":"","text":"Ibn ‘Abbas said that God’s Messenger treated the fingers and toes as equal. \n\nAbu Dawud and Tirmidhi transmitted it."}},{"id":43,"idInBook":43,"chapterId":16,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «الأصابعُ سواءٌ والأسنانُ سواءٌ الثَنِيَّةُ وَالضِّرْسُ سَوَاءٌ هَذِهِ وَهَذِهِ سَوَاءٌ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"He reported God’s Messenger as saying, “The fingers and toes are equal,1 the teeth are equal, the front tooth and the molar tooth are equal, this and that are equal.”2 \n\nAbu Dawud transmitted it.\n\n1. In this tradition only al-asabi' is given, whereas the asabi of the hands and the feet are specified in the preceding. It must obviously mean both fingers and toes here.\n2. It has been suggested that \"this and that” refers only to the little finger and the thumb (cf. the first tradition in the chapter), but it may here refer to the front tooth and the molar tooth mentioned immediately before it."}},{"id":44,"idInBook":44,"chapterId":16,"bookId":14,"arabic":"وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ: خَطَبَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ الفتحِ ثمَّ قَالَ: «أَيُّهَا النَّاسُ إِنَّهُ لَا حِلْفَ فِي الْإِسْلَامِ وَمَا كَانَ مِنْ حِلْفٍ فِي الْجَاهِلِيَّةِ فَإِنَّ الْإِسْلَامَ لَا يَزِيدُهُ إِلَّا شِدَّةً الْمُؤْمِنُونَ يَدٌ عَلَى مَنْ سِوَاهُمْ يُجِيرُ عَلَيْهِمْ أَدْنَاهُمْ وَيَرُدُّ عليهِم أقْصاهم يَردُّ سراياهم على قعيدتِهم لَا يُقْتَلُ مُؤْمِنٌ بِكَافِرٍ دِيَةُ الْكَافِرِ نِصْفُ دِيَةِ الْمُسْلِمِ لَا جَلَبَ وَلَا جَنَبَ وَلَا تُؤْخَذُ صَدَقَاتُهُمْ إِلَّا فِي دُورِهِمْ» . وَفِي رِوَايَةٍ قَالَ: «دِيَةُ الْمُعَاهِدِ نِصْفُ دِيَةِ الْحُرِّ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"‘Amr b. Shu'aib, on his father’s authority, said his grandfather told that God’s Messenger said in the course of an address in the year of the Conquest, “O people, there is no confederacy in Islam, but such as existed in pre-Islamic times is made still stronger by Islam. The believers are one band against others, the lowliest of them gives protection as from all, the most distant of them sends back spoil to them,* their expeditions sending it back to those who are at home. A believer shall not be killed for an infidel. The blood wit for an infidel is half that for a Muslim. There is to be no bringing in of animals to be assessed for zakat, neither are they to be removed to their pastures, but the sadaqat are to be received only in their dwellings.”, And in a version he said, “The blood wit for one with whom a covenant has been made is half that for a freeman.” \n\nAbu Dawud transmitted it.\n\n* Here the context seems to require this translation but cf. p. 739, n 1."}},{"id":45,"idInBook":45,"chapterId":16,"bookId":14,"arabic":"وَعَنْ خِشْفِ بْنِ مَالِكٍ عَنِ ابْنِ مَسْعُودٍ قَالَ: قَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي دِيَةِ الْخَطَأِ عِشْرِينَ بِنْتَ مَخَاضٍ وَعِشْرِينَ ابْنَ مَخَاضٍ ذُكُورٍ وَعِشْرِينَ بِنْتَ لَبُونٍ وَعِشْرِينَ جَذَعَةً وَعِشْرِينَ حِقَّةً \". رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالنَّسَائِيُّ وَالصَّحِيحُ أَنَّهُ مَوْقُوفٌ عَلَى ابْنِ مَسْعُودٍ وَخِشْفٌ مَجْهُولٌ لَا يُعْرَفُ إِلَّا بِهَذَا الْحَدِيثِ وَرُوِيَ فِي شَرْحِ السُّنَّةِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَدَى قَتِيلَ خَيْبَرَ بِمِائَةٍ مِنْ إِبِلِ الصَّدَقَةِ وَلَيْسَ فِي أَسْنَانِ إِبِلِ الصَّدَقَةِ ابْنُ مَخَاضٍ إِنَّمَا فِيهَا ابْنُ لبون","english":{"narrator":"","text":"Khishf b. Malik, on the authority of Ibn Mas'ud, said God’s Messenger gave judgment that the blood wit for accidental killing should be twenty female and twenty male camels which had entered their second year, twenty she-camels which had entered their third year, twenty she-camels in their fifth year and twenty she-camels in their fourth year. \n\nTirmidhi, Abu Dawud and Nasa’i transmitted it, but the sound view is that it does not go back beyond Ibn Mas'ud.\nKhishf is unknown, being known only by this tradition. It is transmitted in Sharh as-sunna that the Prophet paid bloodwit for those slain at Khaibar from the camels of the sadaqa, but the male camel which has entered its second year is not among the age groups of the camels of the sadaqa, only the male camel which has entered its third year being included."}},{"id":46,"idInBook":46,"chapterId":16,"bookId":14,"arabic":"وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ: كَانَتْ قِيمَةُ الدِّيَةِ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَمَانِمِائَةِ دِينَارٍ أَوْ ثَمَانِيَةَ آلَافِ دِرْهَمٍ وَدِيَةُ أَهْلِ الْكِتَابِ يَوْمَئِذٍ النِّصْفُ مِنْ دِيَةِ الْمُسْلِمِينَ قَالَ: فَكَانَ كَذَلِكَ حَتَّى اسْتُخْلِفَ عُمَرُ رَضِيَ اللَّهُ عَنهُ عَلَى أَهْلِ الذَّهَبِ أَلْفَ دِينَارٍ وَعَلَى أَهْلِ الْوَرِقِ اثْنَيْ عَشَرَ أَلْفًا وَعَلَى أَهْلِ الْبَقَرِ مِائَتَيْ بَقَرَةٍ وَعَلَى أَهْلِ الشَّاءِ أَلْفَيْ شَاةٍ وَعَلَى أَهْلِ الْحُلَلِ مِائَتَيْ حُلَّةٍ قَالَ: وَتَرَكَ دِيَةَ أَهْلِ الذِّمَّةِ لَمْ يَرْفَعْهَا فِيمَا رَفَعَ من الدِّيَة. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"‘Amr b. Shu'aib, on his father's authority, said his grandfather told that the value of the blood wit in the time of God’s Messenger was eight hundred dinars or eight thousand dirhams, and that the blood wit for the people of the Book at that time was half that for Muslims. He said that applied till ‘Umar became Caliph, and he made a speech in which he said camels had become dear; so ‘Umar fixed the value for those who possessed gold at a thousand dinars, for those who possessed silver at twelve thousand,* for those who possessed cattle at two hundred cows, for those who possessed sheep at two thousand sheep, and for those who possessed suits of clothing at two hundred suits. But he said he left the blood wit for dhimmis as it was, not raising it in proportion to the increase he made in the blood wit. \n\nAbu Dawud transmitted it.\n\n*i.e. dirhams"}},{"id":47,"idInBook":47,"chapterId":16,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ جَعَلَ الدِّيَةَ اثْنَيْ عَشَرَ أَلْفًا. رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالنَّسَائِيُّ وَالدَّارِمِيُّ","english":{"narrator":"","text":"Ibn ‘Abbas said the Prophet fixed the blood wit at twelve thousand.* \n\nTirmidhi, Abu Dawud, Nasa’i and Darimi transmitted it.\n\n*i.e. dirhams"}},{"id":48,"idInBook":48,"chapterId":16,"bookId":14,"arabic":"وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُقَوِّمُ دِيَةَ الْخَطَأِ عَلَى أَهْلِ الْقُرَى أَرْبَعَمِائَةِ دِينَارٍ أَوْ عِدْلَهَا مِنَ الْوَرِقِ وَيُقَوِّمُهَا عَلَى أَثْمَانِ الْإِبِلِ فَإِذَا غَلَتْ رَفَعَ فِي قيمتِها وإِذا هاجَتْ رُخصٌ نَقَصَ مِنْ قِيمَتِهَا وَبَلَغَتْ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا بَيْنَ أَرْبَعِمِائَةِ دِينَارٍ إِلَى ثَمَانِمِائَةِ دِينَارٍ وَعِدْلُهَا مِنَ الْوَرِقِ ثَمَانِيَةُ آلَافِ دِرْهَمٍ قَالَ: وَقَضَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى أَهْلِ الْبَقَرِ مِائَتَيْ بَقَرَةٍ وَعَلَى أَهْلِ الشَّاءِ أَلْفَيْ شَاةٍ وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ الْعَقْلَ مِيرَاثٌ بَيْنَ وَرَثَةِ الْقَتِيلِ» وَقَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ عَقْلَ الْمَرْأَةِ بَيْنَ عَصَبَتِهَا وَلَا يَرِثُ القاتلُ شَيْئا. رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ","english":{"narrator":"","text":"‘Amr b. Shu'aib, on his father’s authority, said his grandfather told that God’s Messenger was fixing the blood wit for accidental death at the rate of four hundred dinars or their equivalent in silver for townsmen, and he was fixing it according to the price of camels, so when they were dear he increased the amount to be paid and when cheap prices prevailed he reduced the amount to be paid. In the time of God’s Messenger they reached between four hundred and eight hundred dinars, their equivalent in silver being eight thousand dirhams. He said that God's Messenger gave judgment that those who possessed cattle should pay two hundred cows, and those who possessed sheep two thousand sheep. He said that blood wit was to be treated as something to be inherited by the heirs of the one who was killed, and he gave judgment that the blood wit for a woman should be divided among her relatives on her father’s side, but the killer should not inherit anything. \n\nAbu Dawud and Nasa’i transmitted it."}},{"id":49,"idInBook":49,"chapterId":16,"bookId":14,"arabic":"وَعَنْهُ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «عَقْلُ شِبْهِ الْعَمْدِ مُغَلَّظٌ مِثْلُ عَقْلِ الْعَمْدِ وَلَا يُقْتَلُ صاحبُه» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"He said, on his father’s authority, that his grandfather reported the Prophet as saying, “Blood wit for what resembles intentional murder is to be made as severe as that for intentional murder, but the Culprit is not to be killed.” \n\nAbu Dawud transmitted it."}},{"id":50,"idInBook":50,"chapterId":16,"bookId":14,"arabic":"وَعَنْهُ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ: قَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْعَيْنِ الْقَائِمَةِ السَّادَّةِ لِمَكَانِهَا بِثُلْثِ الدِّيَةِ. رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ","english":{"narrator":"","text":"He said, on his father’s authority, that his grandfather told that God’s Messenger gave judgment that a third of the blood wit should be paid for loss of eyesight when the eye is not removed. \n\nAbu Dawud and Nasa’i transmitted it."}},{"id":51,"idInBook":51,"chapterId":16,"bookId":14,"arabic":"وَعَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ: قَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الجَنينِ بغُرَّةٍ: عَبْدٍ أَوْ أَمَةٍ أَوْ فَرَسٍ أَوْ بَغْلٍ. رَوَاهُ أَبُو دَاوُدَ وَقَالَ: رَوَى هَذَا الْحَدِيثَ حَمَّادُ بْنُ سَلَمَةَ وَخَالِدٌ الْوَاسِطِيُّ عَنْ مُحَمَّدِ بْنِ عَمْرٍو وَلَمْ يَذْكُرْ: أَوْ فَرَسٍ أَوْ بغل","english":{"narrator":"","text":"Muhammad b. ‘Amr, on the authority of Abu Salama, said Abu Huraira told that God’s Messenger gave judgment that a male or female slave of the best quality, or a horse, or a mule should be paid for a miscarriage. \n\nAbu Dawud transmitted it, saying this tradition is transmitted by Hammad b. Salama and Khalid al-Wasiti on the authority of Muhammad b. ‘Amr, but he did not mention “or a horse or a mule.”"}},{"id":52,"idInBook":52,"chapterId":16,"bookId":14,"arabic":"وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «من تطيب وَلَمْ يُعْلَمْ مِنْهُ طِبٌّ فَهُوَ ضَامِنٌ» . رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ","english":{"narrator":"","text":"‘Amr b. Shu'aib, on his father’s authority, said his grandfather reported God’s Messenger as saying, “Anyone who practices medicine when he is not known as a practitioner will be held responsible.”* \n\nAbu Dawud and Nasa’i transmitted it.\n\n*He will have to pay blood wit if the patient dies."}},{"id":53,"idInBook":53,"chapterId":16,"bookId":14,"arabic":"وَعَن عِمْران بن حُصَينٍ: أَنَّ غُلَامًا لِأُنَاسٍ فُقَرَاءَ قَطَعَ أُذُنَ غُلَامٍ لِأُنَاسٍ أَغْنِيَاءَ فَأَتَى أَهْلُهُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالُوا: إِنَّا أُنَاسٌ فُقَرَاءُ فَلَمْ يَجْعَلْ عَلَيْهِمْ شَيْئًا. رَوَاهُ أَبُو دَاوُدَ وَالنَّسَائِيُّ","english":{"narrator":"","text":"‘Imran b. Husain told that when the slave of some poor people cut off the ear of a slave of some rich people, and his people came to the Prophet telling him that they were poor, he imposed no compensation on them. \n\nAbu Dawud and Nasa’i transmitted it."}},{"id":54,"idInBook":54,"chapterId":16,"bookId":14,"arabic":"عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ أَنَّهُ قَالَ: دِيَةُ شِبْهِ الْعَمْدِ أَثْلَاثًا ثَلَاثٌ وَثَلَاثُونَ حِقَّةً وَثَلَاثٌ وَثَلَاثُونَ جَذَعَةً وَأَرْبَعٌ وَثَلَاثُونَ ثَنِيَّةً إِلَى بَازِلِ عَامِهَا كُلُّهَا خَلِفَاتٌ وَفِي رِوَايَةٍ: قَالَ: فِي الْخَطَأ أَربَاعًا: خَمْسَة وَعِشْرُونَ حِقَّةً وَخَمْسٌ وَعِشْرُونَ جَذَعَةً وَخَمْسٌ وَعِشْرُونَ بَنَاتِ لَبُونٍ وَخَمْسٌ وَعِشْرُونَ بَنَاتِ مَخَاضٍ. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"‘Ali said that the blood wit for what looked like intentional murder was in three parts:","text":"thirty-three she-camels in their fourth year, thirty- three she-camels in their fifth year, and thirty-four she-camels in the sixth year up to the ninth, all pregnant. In a version he said that the blood wit for unintentional murder was in four parts: twenty-five she-camels in their fourth year, twenty-five she-camels in their fifth year, twenty-five she-camels in their third year, and twenty-five she-camels in their second year. \n\nAbu Dawud transmitted it."}},{"id":55,"idInBook":55,"chapterId":16,"bookId":14,"arabic":"وَعَن مُجاهدٍ قَالَ: قَضَى عُمَرُ رَضِيَ اللَّهُ عَنْهُ فِي شِبْهِ الْعَمْدِ ثَلَاثِينَ حِقَّةً وَثَلَاثِينَ جَذَعَةً وَأَرْبَعِينَ خَلِفَةً مَا بَيْنَ ثَنِيَّةٍ إِلَى بَازِلِ عَامِهَا. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Mujahid said ‘Umar gave judgment that the blood wit for what resembled intentional murder should be thirty she-camels in their fourth year, thirty she-camels in their fifth year, and forty pregnant she-camels in their sixth year up to the ninth. \n\nAbu Dawud transmitted it."}},{"id":56,"idInBook":56,"chapterId":16,"bookId":14,"arabic":"وَعَن سَعِيدِ بْنِ الْمُسَيَّبِ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى فِي الْجَنِينِ يُقْتَلُ فِي بَطْنِ أُمِّهِ بِغُرَّةِ عَبْدٍ أَوْ وَلِيدَةٍ. فَقَالَ الَّذِي قُضِيَ عليهِ: كيفَ أَغْرَمُ مَنْ لَا شَرِبَ وَلَا أَكَلَ وَلَا نَطَقَ وَلَا اسْتَهَلَّ وَمِثْلُ ذَلِكَ يُطَلُّ. فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّمَا هَذَا مِنْ إِخْوَانِ الْكُهَّانِ» . رَوَاهُ مالكٌ وَالنَّسَائِيّ مُرْسلا\nوَرَوَاهُ أَبُو دَاوُدَ عَنْهُ عَنْ أَبِي هُرَيْرَةَ مُتَّصِلا","english":{"narrator":"","text":"Sa'id b. al-Musayyib said God’s Messenger gave judgment that a male or girl slave of the best quality should be paid for a child which is killed in its mother’s womb. When the one against whom this judgment was given asked, “How should I be fined for one who has not eaten or drunk, or spoken, or raised his voice?” adding that compensation is not to be paid for such, God’s Messenger said, “This man simply belongs to the kahins.”* \n\nMalik and Nasa’i transmitted it in mursal form, but Abu Dawud transmitted it on his authority (i.e. Sa'id’s) on the authority of Abu Huraira with a fully connected isnad.\n\n* There is a suggestion of rhyme in the Arabic used by the man who asked the question, so he is compared to the kahins who made their utterances in this form."}},{"id":57,"idInBook":57,"chapterId":16,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْعَجْمَاءُ جَرْحُهَا جُبَارٌ وَالْمَعْدِنُ جُبَارٌ وَالْبِئْرُ جُبَارٌ»","english":{"narrator":"","text":"Abu Huraira reported God’s Messenger as saying, “No retaliation is payable for a wound caused by a dumb animal, for a mine, or for a well.”*\n\n(Bukhari and Muslim.)\n\n* A longer form is given on p. 380. The reference is said to be an animal which is not at the time under anyone's charge. No responsibility attaches to anyone who has dug a mine or a well in a place where he is entitled to do so if someone falls in."}},{"id":58,"idInBook":58,"chapterId":16,"bookId":14,"arabic":"وَعَنْ يَعْلَى بْنِ أُمَيَّةَ قَالَ: غَزَوْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَيْشَ الْعُسْرَةِ وَكَانَ لِي أَجِيرٌ فقاتلَ إِنساناً فعض أَحدهمَا الْآخَرِ فَانْتَزَعَ الْمَعْضُوضُ يَدَهُ مِنْ فِي الْعَاضِّ فَأَنْدَرَ ثَنِيَّتَهُ فَسَقَطَتْ فَانْطَلَقَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَهْدَرَ ثَنِيَّتَهُ وَقَالَ: «أَيَدَعُ يَدَهُ فِي فِيكَ تَقْضِمُهَا كَالْفَحْلِ»","english":{"narrator":"Ya’ la b. Umayya said:","text":"I went with God’s Messenger on the expedition of the army of distress,* and I had a hired servant who fought with a man, one of whom bit the other’s hand. The one who was bitten drew away his hand from the mouth of the one who bit him, dislodging his front tooth which fell out. He went to the Prophet, but he imposed no retaliation for his front tooth, saying, ‘Could he be expected to leave his hand in your mouth when you were crunching it like a male camel?” \n\n(Bukhari and Muslim.)\n\n* This refers to the expedition to Tabuk in 9 A H. Cf. Al-Qur'an, 9:117."}},{"id":59,"idInBook":59,"chapterId":16,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنْ قُتِلَ دُونَ مَالِهِ فَهُوَ شهيدٌ»","english":{"narrator":"","text":"‘Abdallah b. 'Amr told of hearing God’s Messenger say, “He who is killed protecting his property is a martyr.” \n\n(Bukhari and Muslim.)"}},{"id":60,"idInBook":60,"chapterId":16,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: جَاءَ رَجُلٌ فَقَالَ: يَا رَسُولَ اللَّهِ أَرَأَيْتَ إِنْ جَاءَ رَجُلٌ يُرِيدُ أَخْذَ مَالِي؟ قَالَ: «فَلَا تُعْطِهِ مَالَكَ» قَالَ: أَرَأَيْتَ إِنْ قَاتَلَنِي؟ قَالَ: «قَاتِلْهُ» قَالَ: أَرَأَيْتَ إِنْ قَتَلَنِي؟ قَالَ: «فَأَنْتَ شَهِيدٌ» . قَالَ: أَرَأَيْتَ إِنْ قَتَلْتُهُ؟ قَالَ: «هُوَ فِي النَّارِ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Huraira told that a man came and asked God’s Messenger to tell him what he should do if a man came wanting to take his property. He replied, “Do not give him your property.” He asked him to tell him what to do if the man fought with him, and he replied, “Fight with him.” He asked him to tell him what would happen if the man killed him, and he replied, “You will be a martyr.” He asked him to tell him what would happen if he killed the man, and he replied, “He will go to hell.”\n\nMuslim transmitted it."}},{"id":61,"idInBook":61,"chapterId":16,"bookId":14,"arabic":"وَعَنْهُ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَوِ اطَّلَعَ فِي بَيْتِكَ أحدٌ ولمْ تَأذن لَهُ فخذفته بحصاة ففتأت عَيْنَهُ مَا كَانَ عَلَيْكَ مِنْ جُنَاحٍ»","english":{"narrator":"","text":"He told that he heard God’s Messenger say, “If anyone were to look into your house without receiving your permission and you were to throw a pebble at him and put out his eye, you would be guilty of no offence.” \n\n(Bukhari and Muslim)"}},{"id":62,"idInBook":62,"chapterId":16,"bookId":14,"arabic":"وَعَن سهل بنِ سعد: أَنَّ رَجُلًا اطَّلَعَ فِي جُحْرٍ فِي بَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِدْرًى يَحُكُّ بِهِ رَأْسَهُ فَقَالَ: «لَوْ أَعْلَمُ أَنَّكَ تنظُرُني لطَعَنْتُ بهِ فِي عَيْنَيْكَ إِنَّمَا جُعِلَ الِاسْتِئْذَانُ مِنْ أَجْلِ الْبَصَرِ»","english":{"narrator":"","text":"Sahl b. Sa'd said that a man looked through a hole in God’s Messenger’s door when God’s Messenger had a spike with which he was scratching his head, so he said, “If I knew that you were seeing me I would poke it in your eyes, for asking permission has been appointed only on account of what people may see.” \n\n(Bukhari and Muslim.)"}},{"id":63,"idInBook":63,"chapterId":16,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ أَنَّهُ رَأَى رَجُلًا يَخْذِفُ فَقَالَ: لَا تَخْذِفْ فَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنِ الْخَذْفِ وَقَالَ: «إِنَّهُ لَا يُصَادُ بِهِ صَيْدٌ وَلَا يُنْكَأُ بِهِ عَدُوٌّ وَلَكِنَّهَا قَدْ تَكْسِرُ السِّنَّ وَتَفْقَأُ الْعَيْنَ»","english":{"narrator":"","text":"'Abdallah b. Mughaffal told that he saw a man throwing pebbles and told him not to do so, for God’s Messenger had forbidden it, saying, “Game is not caught by such means, neither is an enemy injured, but you may sometimes break a tooth or put out an eye.” \n\n(Bukhari and Muslim.)"}},{"id":64,"idInBook":64,"chapterId":16,"bookId":14,"arabic":"وَعَنْ أَبِي مُوسَى قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا مَرَّ أَحَدُكُمْ فِي مَسْجِدِنَا وَفِي سُوقِنَا وَمَعَهُ نَبْلٌ فَلْيُمْسِكْ عَلَى نِصَالِهَا أَنْ يُصِيبَ أَحَدًا مِنَ الْمُسْلِمِينَ مِنْهَا بِشَيْءٍ»","english":{"narrator":"","text":"Abu Musa reported God’s Messenger as saying, “When one of you passes along in our mosque or in our market having arrows with him he should grasp their points lest he cause any injury by them to a Muslim.” \n\n(Bukhari and Muslim.)"}},{"id":65,"idInBook":65,"chapterId":16,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يُشِيرُ أَحَدُكُمْ عَلَى أَخِيهِ بِالسِّلَاحِ فَإِنَّهُ لَا يَدْرِي لَعَلَّ الشَّيْطَانَ يَنْزِعُ فِي يَدِهِ فَيَقَعُ فِي حُفْرَة من النَّار»","english":{"narrator":"","text":"Abu Huraira reported God’s Messenger as saying, “None of you must point a weapon at his brother, for he does not know whether perhaps the devil may draw it out while it is in his hand as a result of which he will fall into a pit in hell.”\n\n(Bukhari and Muslim.)"}},{"id":66,"idInBook":66,"chapterId":16,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَشَارَ إِلَى أَخِيهِ بِحَدِيدَةٍ فَإِنَّ الْمَلَائِكَةَ تَلْعَنُهُ حَتَّى يَضَعَهَا وَإِنْ كَانَ أخاهُ لأبيهِ وَأمه» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"He reported God’s Messenger as saying, “If anyone points a piece of iron at his brother the angels will curse him till he puts it down, even if he is his brother who has the same father and mother.” \n\nBukhari transmitted it."}},{"id":67,"idInBook":67,"chapterId":16,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ وَأَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُمْ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ حَمَلَ عَلَيْنَا السِّلَاحَ فَلَيْسَ مِنَّا» . رَوَاهُ البُخَارِيّ وزادَ مُسلم: «ومنْ غشَّنا فليسَ منَّا»","english":{"narrator":"","text":"Ibn ‘Umar and Abu Huraira reported the Prophet as saying, “He who points a weapon at us does not belong to us.”\n\nBukhari transmitted it, and Muslim added, “And he who treats us dishonestly does not belong to us.”"}},{"id":68,"idInBook":68,"chapterId":16,"bookId":14,"arabic":"وَعَنْ سَلَمَةَ بْنِ الْأَكْوَعِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ سَلَّ علينا السَّيفَ فليسَ منَّا» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Salama b. al-Akwa' reported God’s Messenger as saying, “He who draws a sword against us does not belong to us.”\n\nMuslim transmitted it."}},{"id":69,"idInBook":69,"chapterId":16,"bookId":14,"arabic":"وَعَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ أَنَّ هشامَ بنَ حكيمٍ مَرَّ بِالشَّامِ عَلَى أُنَاسٍ مِنَ الْأَنْبَاطِ وَقَدْ أُقِيموا فِي الشَّمسِ وصُبَّ على رُؤوسِهِمُ الزَّيْتُ فَقَالَ: مَا هَذَا؟ قِيلَ: يُعَذَّبُونَ فِي الخَراجِ فَقَالَ هِشَامٌ: أَشْهَدُ لَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِنَّ اللَّهَ يُعَذِّبُ الَّذِينَ يُعذبونَ النَّاسَ فِي الدُّنْيَا» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Hisham b. ‘Urwa, on his father’s authority, told that Hisham b. Hakim came upon some Nabataeans in Syria who had been made to stand in the sun with olive-oil poured over their heads. On his asking what the meaning of that was and being told that they were suffering punishment concerning the land-tax, Hisham said he could testify to having heard God’s Messenger say, “God will punish those who punish people in this world.” \n\nMuslim transmitted it."}},{"id":70,"idInBook":70,"chapterId":16,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يُوشِكُ إِنْ طَالَتْ بك مُدَّة أَن ترى أَقْوَامًا فِي أَيْدِيهِمْ مِثْلُ أَذْنَابِ الْبَقَرِ يَغْدُونَ فِي غَضَبِ اللَّهِ وَيَرُوحُونَ فِي سَخَطِ اللَّهِ» . وَفِي رِوَايَةٍ: «وَيَرُوحُونَ فِي لَعْنَةِ اللَّهِ» . رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"Abu Huraira reported God’s Messenger as saying, “If you live long you will soon see people with things like ox-tails in their hands going out in the morning subject to God’s anger and coming back in the evening subject to God’s displeasure.” A version has, “coming back in the evening subject to God’s curse.” \n\nMuslim transmitted it."}},{"id":71,"idInBook":71,"chapterId":16,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" صِنْفَانِ مِنْ أَهْلِ النَّارِ لَمْ أَرَهُمَا: قَوْمٌ مَعَهُمْ سِيَاطٌ كَأَذْنَابِ الْبَقَرِ يَضْرِبُونَ بِهَا النَّاسَ وَنِسَاءٌ كَاسِيَاتٌ عَارِيَاتٌ مُمِيلَاتٌ مَائِلَاتٌ رؤوسهم كَأَسْنِمَةِ الْبُخْتِ الْمَائِلَةِ لَا يَدْخُلْنَ الْجَنَّةَ وَلَا يَجِدْنَ رِيحَهَا وَإِنَّ رِيحَهَا لَتُوجَدُ مِنْ مَسِيرَةِ كَذَا وَكَذَا \". رَوَاهُ مُسلم","english":{"narrator":"He reported God’s Messenger as saying, “There are two classes of those who will go to hell whom I have not seen:","text":"people with whips like ox-tails with which they strike people; and women with such clothing as to be virtually naked, who incite men and are inclined towards men, whose heads are like the swaying humps of Bactrian camels. Such women will not enter paradise or experience its fragrance, though its fragrance can be experienced at such and such a distance.” \n\nMuslim transmitted it."}},{"id":72,"idInBook":72,"chapterId":16,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا قَاتَلَ أَحَدُكُمْ فَلْيَجْتَنِبِ الْوَجْهَ فَإِنَّ اللَّهَ خَلَقَ آدَمَ عَلَى صُورَتِهِ»","english":{"narrator":"","text":"He reported God’s Messenger as saying, “When any of you fights he must avoid the face, for God created Adam in His own image.” \n\n(Bukhari and Muslim.)"}},{"id":73,"idInBook":73,"chapterId":16,"bookId":14,"arabic":"عَنْ أَبِي ذَرٍّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ كَشَفَ سِتْرًا فَأَدْخَلَ بَصَرَهُ فِي الْبَيْتِ قَبْلَ أَنْ يُؤْذَنَ لَهُ فَرَأَى عَوْرَةَ أَهْلِهِ فَقَدْ أَتَى حَدًّا لَا يَحِلُّ لَهُ أَنْ يَأْتِيَهُ وَلَوْ أَنَّهُ حِينَ أَدْخَلَ بَصَرَهُ فَاسْتَقْبَلَهُ رَجُلٌ فَفَقَأَ عَيْنَهُ مَا عَيَّرْتُ عَلَيْهِ وَإِنْ مَرَّ الرَّجُلُ عَلَى بَابٍ لَا سِتْرَ لَهُ غَيْرِ مُغْلَقٍ فَنَظَرَ فَلَا خَطِيئَةَ عَلَيْهِ إِنَّمَا الْخَطِيئَةُ عَلَى أَهْلِ الْبَيْتِ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ غَرِيب","english":{"narrator":"","text":"Abu Dharr reported God’s Messenger as saying, “If anyone removes a curtain and looks into a house before receiving permission and sees anything in those within which should not be seen, he has committed an offence which it is not lawful for him to commit. If a man confronted him when he looked in and put out his eye, I would not blame him; but if a man passes a door which has no curtain and is not shut and looks in, he has committed no sin, for the sin pertains only to the people inside.” \n\nTirmidhi transmitted it, saying this is a gharib tradition."}},{"id":74,"idInBook":74,"chapterId":16,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُتَعَاطَى السَّيْفُ مَسْلُولًا. رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد","english":{"narrator":"","text":"Jabir said God’s Messenger forbade that a sword which has been drawn should be handed to anyone. \n\nTirmidhi and Abu Dawud transmitted it."}},{"id":75,"idInBook":75,"chapterId":16,"bookId":14,"arabic":"وَعَن الحسنِ عَنْ سَمُرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يُقَدَّ السَّيْرُ بَيْنَ أُصبعَينِ. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Al-Hasan said on Samura’s authority that God’s Messenger forbade that a thong of a sandal should be cut off between two toes. \n\nAbu Dawud transmitted it."}},{"id":76,"idInBook":76,"chapterId":16,"bookId":14,"arabic":"وَعَن سعيدِ بنِ زيدٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ قُتِلَ دُونَ دِينِهِ فَهُوَ شَهِيدٌ وَمَنْ قُتِلَ دُونَ دَمِهِ فَهُوَ شَهِيدٌ وَمَنْ قُتِلَ دُونَ مَالِهِ فَهُوَ شَهِيدٌ وَمَنْ قُتِلَ دُونَ أَهْلِهِ فَهُوَ شَهِيدٌ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالنَّسَائِيُّ","english":{"narrator":"","text":"Sa'id b. Zaid reported God’s Messenger as saying, “He who is killed in defence of his religion is a martyr, he who is killed in self-defence is a martyr, he who is killed in defence of his property is a martyr, and he who is killed in defence of his family is a martyr.” \n\nTirmidhi, Abu Dawud and Nasa’i transmitted it."}},{"id":77,"idInBook":77,"chapterId":16,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" لِجَهَنَّمَ سَبْعَةُ أَبْوَابٍ: بَابٌ مِنْهَا لِمَنْ سَلَّ السَّيْفَ عَلَى أُمَّتِي أَوْ قَالَ: عَلَى أُمَّةِ مُحَمَّدٍ \". رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ غَرِيبٌ","english":{"narrator":"","text":"Ibn ‘Umar reported the Prophet as saying, ‘‘Jahannam has seven gates, one of which is for those who draw a sword against my people,” or he said, \"against Muhammad’s people.” \n\nTirmidhi transmitted it, saying this is a gharib tradition."}},{"id":78,"idInBook":78,"chapterId":16,"bookId":14,"arabic":"عَنْ رَافِعِ بْنِ خَدِيجٍ وَسَهْلِ بْنِ أَبِي حَثْمة أَنَّهُمَا حَدَّثَا أَنَّ عَبْدَ اللَّهِ بْنَ سَهْلٍ وَمُحَيِّصَةَ بْنَ مَسْعُودٍ أَتَيَا خَيْبَرَ فَتَفَرَّقَا فِي النَّخْلِ فَقُتِلَ عَبْدُ اللَّهِ بْنُ سَهْلٍ فَجَاءَ عَبْدُ الرَّحْمَنِ بْنُ سَهْلٍ وَحُوَيِّصَةُ وَمُحَيِّصَةُ ابْنَا مَسْعُودٍ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَتَكَلَّمُوا فِي أَمْرِ صَاحِبِهِمْ فَبَدَأَ عَبْدُ الرَّحْمَنِ وَكَانَ أَصْغَر الْقَوْم فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" كبر الْكبر قَالَ يحيى بن سعد: يَعْنِي لِيَلِيَ الْكَلَامَ الْأَكْبَرُ فَتَكَلَّمُوا فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «اسْتَحِقُّوا قَتِيلَكُمْ أَوْ قَالَ صَاحِبَكُمْ بِأَيْمَانِ خَمْسِينَ مِنْكُمْ» . قَالُوا: يَا رَسُولَ اللَّهِ أَمْرٌ لَمْ نَرَهُ قَالَ: فَتُبَرِّئُكُمْ يَهُودُ فِي أَيْمَانِ خَمْسِينَ مِنْهُمْ؟ قَالُوا: يَا رَسُولَ اللَّهِ قَوْمٌ كُفَّارٌ فَفَدَاهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ قِبَلِهِ. وَفِي رِوَايَةٍ: «تَحْلِفُونَ خَمْسِينَ يَمِينًا وَتَسْتَحِقُّونَ قَاتِلَكُمْ أَوْ صَاحِبَكُمْ» فَوَدَاهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ عِنْده بِمِائَة نَاقَة","english":{"narrator":"","text":"Rafi' b. Khadij and Sahl b. Abu Hathma told that ‘Abdallah b. Sahl and Muhayyisa b. Mas'ud came to Khaibar and when they had separated among the palm-trees ‘Abdallah b. Sahl was killed. ‘Abd ar-Rah¬man b. Sahl and Huwayyisa, and Muhayyisa, the sons of Mas'ud, came to the Prophet and spoke about what had happened to their friend. ‘Abd ar-Rahman who was the youngest spoke first, but the Prophet said to him kabbir al-kubr, which was said by Yahya b. Sa'id to mean “Let the oldest take charge of speaking.\" They then spoke and the Prophet said, “Make your demand regarding your dead man (or he said, your friend) by the oaths of fifty of you.\" They replied, “Messenger of God, it is a matter which we did not see.\" He said, “The Jews will exonerate themselves by the oaths of fifty of them,\" but they replied, “Messenger of God, they are a people who are infidels.\" So God’s Messenger paid them the blood wit himself. A version has, “You must swear fifty oaths and make your claim regarding your slain man (or, your friend).\" Then God’s Messenger himself paid his blood wit consisting of a hundred she- camels. \n\n(Bukhari and Muslim.)"}},{"id":79,"idInBook":79,"chapterId":16,"bookId":14,"arabic":"عَنْ رَافِعِ بْنِ خَدِيجٍ قَالَ: أَصْبَحَ رَجُلٌ مِنَ الْأَنْصَارِ مَقْتُولًا بِخَيْبَرَ فَانْطَلَقَ أَوْلِيَاؤُهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرُوا ذَلِكَ لَهُ فَقَالَ: «أَلَكُمْ شَاهِدَانِ يَشْهَدَانِ عَلَى قَاتِلِ صَاحِبِكُمْ؟» قَالُوا: يَا رَسُولَ اللَّهِ لَمْ يَكُنْ ثَمَّ أحدٌ من المسلمينَ وإِنما هُوَ يهود وَقد يجترئون عَلَى أَعْظَمَ مِنْ هَذَا قَالَ: «فَاخْتَارُوا مِنْهُمْ خَمْسِينَ فَاسْتَحْلِفُوهُمْ» . فَأَبَوْا فَوَدَاهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ عِنْدِهِ. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Rafi‘ b. Khadij said that one of the Ansar was killed at Khaibar and his relatives went to the Prophet and mentioned that to him. He asked, “Have you two witnesses who can testify to the murderer of your friend?\" They replied, “Messenger of God, there was not a single Muslim present, but only Jews who sometimes have the audacity to do even greater crimes than this “He said, “Then choose fifty of them and demand that they take an oath;\" but they refused and God’s Messenger paid his blood wit himself. \n\nAbu Dawud transmitted it."}},{"id":80,"idInBook":80,"chapterId":16,"bookId":14,"arabic":"عَنْ عِكْرِمَةَ قَالَ: أُتِيَ عَلِيٌّ بِزَنَادِقَةٍ فَأَحْرَقَهُمْ فَبَلَغَ ذَلِكَ ابْنَ عَبَّاسٍ فَقَالَ: لَوْ كُنْتُ أَنَا لَمْ أُحْرِقْهُمْ لِنَهْيِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تُعَذِّبُوا بِعَذَابِ اللَّهِ» وَلَقَتَلْتُهُمْ لِقَوْلِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ بَدَّلَ دِينَهُ فَاقْتُلُوهُ» . رَوَاهُ الْبُخَارِيُّ","english":{"narrator":"","text":"‘Ikrima told that when some heretics were brought to ‘Ali he had them burned, and that when Ibn ‘Abbas heard of it he said that if it had been he, he would not have had them burned because of God’s Messenger's prohibition, “Do not inflict God’s punishment on anyone”, but would have had them killed on account of the statement made by God’s Messenger, “Kill those who change their religion.” \n\nBukhari transmitted it."}},{"id":81,"idInBook":81,"chapterId":16,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «إِن النَّارَ لَا يُعَذِّبُ بِهَا إِلَّا اللَّهُ» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"‘Abdallah b. ‘Abbas reported God’s Messenger as saying, “Only God punishes with fire.” \n\nBukhari transmitted it."}},{"id":82,"idInBook":82,"chapterId":16,"bookId":14,"arabic":"وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «سَيَخْرُجُ قَوْمٌ فِي آخِرِ الزَّمَانِ حُدَّاثُ الْأَسْنَانِ سُفَهَاءُ الْأَحْلَامِ يَقُولُونَ مِنْ خَيْرِ قَوْلِ الْبَرِيَّةِ لَا يُجَاوِزُ إِيمَانُهُمْ حَنَاجِرَهُمْ يَمْرُقُونَ مِنَ الدِّينِ كَمَا يَمْرُقُ السَّهْمُ مِنَ الرَّمِيَّةِ فَأَيْنَمَا لَقِيتُمُوهُمْ فَاقْتُلُوهُمْ فَإِنَّ فِي قَتْلِهِمْ أَجْرًا لمن قَتلهمْ يَوْم الْقِيَامَة»","english":{"narrator":"","text":"‘Ali told that he heard God’s Messenger say, “In the last time people will come forth, young and foolish, speaking the finest words men speak, but their faith will not pass their throats. They will come out from the religion as an arrow does from the animal it is aimed at. Wherever you meet them kill them, for a reward for killing them will be given on the day of resurrection to those who kill them.” \n\n(Bukhari and Muslim.)"}},{"id":83,"idInBook":83,"chapterId":16,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَكُونُ أُمَّتِي فِرْقَتَيْنِ فَيَخْرُجُ مِنْ بَيْنِهِمَا مَارِقَةٌ يَلِي قَتْلَهُمْ أولاهم بِالْحَقِّ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Sa'id al-Khudri reported God’s Messenger as saying, “My people will be in two sections from among whom a seceding party will go out, and those who are nearest to the truth will undertake the killing of them.” \n\nMuslim transmitted it."}},{"id":84,"idInBook":84,"chapterId":16,"bookId":14,"arabic":"وَعَنْ جَرِيرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَجَّةِ الْوَدَاعِ: «لَا تَرْجِعُنَّ بَعْدِي كُفَّارًا يَضْرِبُ بَعْضُكُمْ رِقَاب بعض»","english":{"narrator":"","text":"Jarir reported God’s Messenger as saying at the Farewell Pilgrimage, “You must never revert to infidelity after my death and cut off one another’s heads.” \n\n(Bukhari and Muslim.)"}},{"id":85,"idInBook":85,"chapterId":16,"bookId":14,"arabic":"وَعَنْ أَبِي بَكْرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا الْتَقَى الْمُسْلِمَانِ حَمَلَ أَحَدُهُمَا عَلَى أَخِيهِ السِّلَاحَ فَهُمَا فِي جُرُفِ جَهَنَّمَ فَإِذَا قَتَلَ أَحَدُهُمَا صَاحِبَهُ دَخَلَاهَا جَمِيعًا» . وَفِي رِوَايَةٍ عَنْهُ: قَالَ: «إِذَا الْتَقَى الْمُسْلِمَانِ بسيفهما فَالْقَاتِلُ وَالْمَقْتُولُ فِي النَّارِ» قُلْتُ: هَذَا الْقَاتِلُ فَمَا بَالُ الْمَقْتُولِ؟ قَالَ: «إِنَّهُ كَانَ حَرِيصًا عَلَى قَتْلِ صَاحِبِهِ»","english":{"narrator":"","text":"Abu Bakra reported the Prophet as saying, “When two Muslims meet and one of them bears arms against his brother, they are both on the brink of hell, and if one of them kills the other they will both enter it.” In a version on Abu Bakra's authority he said, “When two Muslims meet with their swords, the one who kills and the one who is killed will go to hell.\" When he (i.e. Abu Bakr)  remarked that one was the killer and asked what was wrong with the one who was killed, he replied, “He was eager to kill his companion.\" \n\n(Bukhari and Muslim.)"}},{"id":86,"idInBook":86,"chapterId":16,"bookId":14,"arabic":"وَعَن أَنَسٍ قَالَ: قَدِمَ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَفَرٌ مِنْ عُكْلٍ فَأَسْلَمُوا فَاجْتَوَوُا الْمَدِينَةَ فَأَمَرَهُمْ أَنْ يَأْتُوا إِبِلَ الصَّدَقَةِ فَيَشْرَبُوا مِنْ أَبْوَالِهَا وَأَلْبَانِهَا فَفَعَلُوا فَصَحُّوا فَارْتَدُّوا وَقَتَلُوا رُعَاتَهَا وَاسْتَاقُوا الْإِبِلَ فَبَعَثَ فِي آثَارِهِمْ فَأُتِيَ بِهِمْ فَقَطَعَ أَيْدِيَهُمْ وَأَرْجُلَهُمْ وَسَمَلَ أَعْيُنَهُمْ ثُمَّ لَمْ يَحْسِمْهُمْ حَتَّى مَاتُوا \". وَفِي رِوَايَةٍ: فَسَمَّرُوا أَعْيُنَهُمْ وَفِي رِوَايَةٍ: أَمَرَ بِمَسَامِيرَ فَأُحْمِيَتْ فَكَحَّلَهُمْ بِهَا وَطَرَحَهُمْ بِالْحَرَّةِ يَسْتَسْقُونَ فَمَا يُسْقَوْنَ حَتَّى مَاتُوا","english":{"narrator":"","text":"Anas told that some people of ‘Ukl who had come to the Prophet and accepted Islam found Medina unhealthy, so he ordered them to go to the camels of the sadaqa and drink some of their urine and their milk. They did so and became well, after which they apostatised, killed the herdsmen and drove off the camels. So he sent people in pursuit of them, and when they were brought he had their hands and feet cut off and their eyes put out and left them to die without cauterising them to stop the flow of blood. A version says nails were driven into their eyes. Another says he ordered nails to be heated and after having them blinded with them he had them thrown out on the harra, and although they begged for water they were left to die without being given any. \n\n(Bukhari and Muslim.)"}},{"id":87,"idInBook":87,"chapterId":16,"bookId":14,"arabic":"عَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَحُثُّنَا عَلَى الصَّدَقَةِ وَيَنْهَانَا عَنِ الْمُثْلَةِ. رَوَاهُ أَبُو دَاوُدَ\nوَرَوَاهُ النَّسَائِيّ عَن أنس","english":{"narrator":"","text":"‘Imran b. Husain said God's Messenger used to urge them to give sadaqa and forbid them to mutilate anyone. \n\nAba Dawud transmitted it and Nasa’i transmitted it on the authority of Anas."}},{"id":88,"idInBook":88,"chapterId":16,"bookId":14,"arabic":"وَعَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ قَالَ: كُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ فَانْطَلَقَ لِحَاجَتِهِ فَرَأَيْنَا حُمْرَةً مَعَهَا فَرْخَانِ فَأَخَذْنَا فَرْخَيْهَا فَجَاءَتِ الْحُمْرَةُ فَجَعَلَتْ تَفْرُشُ فَجَاءَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «مَنْ فَجَعَ هَذِهِ بِوَلَدِهَا؟ رُدُّوا وَلَدَهَا إِلَيْهَا» . وَرَأَى قَرْيَةَ نَمْلٍ قَدْ حَرَّقْنَاهَا قَالَ: «مَنْ حَرَّقَ هَذِهِ؟» فَقُلْنَا: نَحْنُ قَالَ: «إِنَّهُ لَا يَنْبَغِي أَنْ يُعَذِّبَ بِالنَّارِ إِلاَّ ربُّ النَّار» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"‘Abd ar-Rahman b. Abdallah quoted his father as saying:","text":"When I\twe were on a journey with God’s Messenger and he had gone to relieve himself we saw a hummara* with two young ones and took the young ones, whereupon the hummara came and began to spread out its wings. Then when the Prophet came he said, “Who has pained this one by the loss of her young? Give her young ones back to her.\" He also saw an anthill which we had burned, and when he asked who had burned it and we replied that we had, he said, “It is not fitting that anyone but the Lord of the fire should punish with fire” \n\nAbu Dawud transmitted it. \n\n* A small bird like a sparrow, or a lark."}},{"id":89,"idInBook":89,"chapterId":16,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ وَأَنَسِ بْنِ مَالِكٍ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \" سَيَكُونُ فِي أُمَّتِي اخْتِلَافٌ وَفُرْقَةٌ قَوْمٌ يُحسِنونَ القيلَ ويُسيئونَ الفِعلَ يقرؤون الْقُرْآنَ لَا يُجَاوِزُ تَرَاقِيَهُمْ يَمْرُقُونَ مِنَ الدِّينِ مُروقَ السَّهمِ فِي الرَّمِيَّةِ لَا يَرْجِعُونَ حَتَّى يَرْتَدَّ السَّهْمُ عَلَى فُوقِهِ هُمْ شَرُّ الْخَلْقِ وَالْخَلِيقَةِ طُوبَى لِمَنْ قَتَلَهُمْ وَقَتَلُوهُ يَدْعُونَ إِلَى كِتَابِ اللَّهِ وَلَيْسُوا منَّا فِي شيءٍ مَنْ قاتلَهم كَانَ أَوْلَى بِاللَّهِ مِنْهُمْ قَالُوا: يَا رَسُولَ اللَّهِ مَا سِيمَاهُمْ؟ قَالَ: «التَّحْلِيقُ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Abu Sa'id al-Khudri and Anas b Malik reported God’s Messenger as saying, “Disagreement and division will arise among my people. Some will speak well but do evil; they will recite the Qur’an but it will go no farther than their throats; they will swerve from the religion as an arrow goes through the animal shot at and will not return till an arrow comes back to the place where it was strung. They are the worst of men and animals. Blessed are they who kill them and are killed by them! They summon people to God’s Book, but they have no part with us. He who fights with them is nearer to God than they.” God’s Messenger was asked what mark they had, and said it was shaving.* \n\nAbu Dawud transmitted it.\n\n* Tahliq is here explained as going to extremes in shaving the head and taking the hair out by the roots."}},{"id":90,"idInBook":90,"chapterId":16,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَحِلُّ دَمُ امْرِئٍ مُسْلِمٍ يَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ إِلَّا بِإِحْدَى ثَلَاثٍ زِنا بعدَ إِحْصانٍ فإِنَّهُ يُرجَمُ ورجلٌ خرَجَ مُحارِباً للَّهِ وَرَسُولِهِ فَإِنَّهُ يُقْتَلُ أَوْ يُصْلَبُ أَوْ يُنْفَى مِنَ الْأَرْضِ أَوْ يَقْتُلُ نَفْسًا فَيُقْتَلُ بِهَا» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"A’isha reported God’s Messenger as saying, “The blood of a Muslim man who testifies that there is no god but God and that Muhammad is God’s Messenger may lawfully be shed only for one of three reasons:","text":"fornication after marriage, in which case he should be stoned; one who goes forth to fight with God and His Messenger,* in which case he should be killed, or crucified, or made a fugitive; or one which commits murder for which he is killed.” \n\nAbu Dawud transmitted it.\n\n* Mirqat iv. 53 refers this to such things as highway robbery."}},{"id":91,"idInBook":91,"chapterId":16,"bookId":14,"arabic":"وَعَنِ ابْنِ أَبِي لَيْلَى قَالَ: حَدَّثَنَا أَصْحَابُ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُمْ كَانُوا يَسِيرُونَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنَامَ رَجُلٌ مِنْهُمْ فَانْطَلَقَ بَعْضُهُمْ إِلَى حَبْلٍ مَعَه فَأَخذه فَفَزعَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَحِلُّ لِمُسْلِمٍ أَنْ يُرَوِّعَ مُسْلِمًا» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Ibn Abu Laila said he was told by Muhammad’s companions that during a journey with God’s Messenger while one of them was asleep another went to a rope he had with him and seized him,* with the result that he was startled. God’s Messenger then said, “It is not lawful for a Muslim to frighten another.” \n\nAbu Dawud transmitted it.\n\n* The meaning is that he tied the rope round him while he was asleep, presumably as a joke."}},{"id":92,"idInBook":92,"chapterId":16,"bookId":14,"arabic":"وَعَنْ أَبِي الدَّرْدَاءِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ أَخَذَ أَرْضًا بِجِزْيَتِهَا فَقَدِ اسْتَقَالَ هِجْرَتَهُ وَمَنْ نَزَعَ صَغَارَ كَافِرٍ مِنْ عُنُقِهِ فَجَعَلَهُ فِي عُنُقِهِ فَقَدْ وَلّى الإِسلامَ ظهرَه» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Abud Darda’ reported God’s Messenger as saying, “He who gets land on which tax is due 1 has sought to rescind his emigration,2 and he who takes an infidel’s lowliness from his neck and puts it on his own 3 has turned his back on Islam.” \n\nAbu Dawud transmitted it.\n\n1. The word for \"tax\" here is jizya. Eventually a distinction was made between jizya and kharaj, the former being used for poll-tax and the latter for land-tax.\n2. i.e. to make himself like a dhimmi.\n3. i.e. undertakes the responsibility of paying his tax for him."}},{"id":93,"idInBook":93,"chapterId":16,"bookId":14,"arabic":"وَعَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ قَالَ: بَعَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَرِيَّةً إِلَى خَثْعَمَ فَاعْتَصَمَ نَاسٌ مِنْهُمْ بِالسُّجُودِ فَأَسْرَعَ فِيهِمُ الْقَتْلَ فَبَلَغَ ذَلِكَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَ لَهُمْ بِنِصْفِ الْعَقْلِ وَقَالَ: «أَنَا بَرِيءٌ مِنْ كُلِّ مُسْلِمٍ مُقِيمٍ بَيْنَ أَظْهُرِ الْمُشْرِكِينَ» قَالُوا: يَا رَسُولَ اللَّهِ لِمَ؟ قَالَ: «لَا تَتَرَاءَى نَارَاهُمَا» . رَوَاهُ أَبُو دَاوُدَ","english":{"narrator":"","text":"Jarir b. ‘Abdillah told that when God’s Messenger sent an expedition to Khath'am some of them sought God’s protection by having recourse to prostration* and were quickly killed. When the Prophet heard that, he ordered half the blood wit to be paid for them, saying, “I am not responsible for any Muslim who stays among polytheists.” On being asked why that was, he replied, “Their fires should not be visible to one another.” \n\nAbu Dawud transmitted it.\n\n* Some members of Khath'am who were Muslims prostrated themselves in prayer to God thinking that this would make it clear to the attackers that they were Muslims."}},{"id":94,"idInBook":94,"chapterId":16,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْإِيمَانُ قَيَّدَ الْفَتْكَ لَا يفتِكُ مُؤمنٌ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Abu Huraira reported the Prophet as saying, “Faith is an assurance of safety from being killed unawares. A believer does not kill another unawares.” \n\nAbu Dawud transmitted it."}},{"id":95,"idInBook":95,"chapterId":16,"bookId":14,"arabic":"وَعَنْ جَرِيرٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا أَبَقَ الْعَبْدُ إِلَى الشِّرْكِ فقد حلَّ دَمه» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Jarir reported the Prophet as saying, “When a slave runs away and reverts to polytheism he may lawfully be killed.” \n\nAbu Dawud transmitted it."}},{"id":96,"idInBook":96,"chapterId":16,"bookId":14,"arabic":"وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ أَنَّ يَهُودِيَّةً كَانَتْ تَشْتِمُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَتَقَعُ فِيهِ فَخَنَقَهَا رَجُلٌ حَتَّى مَاتَتْ فَأَبْطَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَمَهَا. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"‘Ali told that a Jewess who was reviling the Prophet and speaking evil of him was strangled to death by a man and the Prophet allowed no payment to be made for her death. \n\nAbu Dawud transmitted it."}},{"id":97,"idInBook":97,"chapterId":16,"bookId":14,"arabic":"وَعَنْ جُنْدُبٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «حَدُّ السَّاحِرِ ضَرْبُهُ بِالسَّيْفِ» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Jundub reported God’s Messenger as saying, “The punishment given to a magician is a stroke with the sword.”\n\nTirmidhi transmitted it."}},{"id":98,"idInBook":98,"chapterId":16,"bookId":14,"arabic":"عَن أُسَامَةَ بْنِ شَرِيكٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَيُّمَا رَجُلٍ خَرَجَ يُفَرِّقُ بَيْنَ أُمَّتِي فَاضْرِبُوا عُنُقَهُ» . رَوَاهُ النَّسَائِيُّ","english":{"narrator":"","text":"Usama b. Sharik reported God’s Messenger as saying, “Cut off the head of any man who goes out and causes division among my people.” \n\nNasa’i transmitted it."}},{"id":99,"idInBook":99,"chapterId":16,"bookId":14,"arabic":"وَعَنْ شَرِيكِ بْنِ شِهَابٍ قَالَ: كُنْتُ أَتَمَنَّى أَنْ أَلْقَى رَجُلًا مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَسْأَلُهُ عَنِ الْخَوَارِجِ فَلَقِيْتُ أَبَا بَرْزَةَ فِي يَوْمِ عِيدٍ فِي نَفَرٍ مِنْ أَصْحَابِهِ فَقُلْتُ لَهُ: هَلْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَذْكُرُ الْخَوَارِجَ؟ قَالَ: نعمْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِأُذُنَيَّ وَرَأَيْتُهُ بِعَيْنَيَّ: أَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَالٍ فَقَسَمَهُ فَأَعْطَى مَنْ عَنْ يَمِينِهِ وَمَنْ عَنْ شِمَالِهِ وَلَمْ يُعْطِ مَنْ وَرَاءَهُ شَيْئًا. فَقَامَ رَجُلٌ مِنْ وَرَائِهِ فَقَالَ: يَا مُحَمَّدُ مَا عَدَلْتَ فِي الْقِسْمَةِ رَجُلٌ أَسْوَدُ مَطْمُومُ الشَّعْرِ عَلَيْهِ ثَوْبَانِ أَبْيَضَانِ فَغَضِبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَضَبًا شَدِيدًا وَقَالَ: «وَاللَّهِ لَا تَجِدُونَ بَعْدِي رَجُلًا هُوَ أَعْدَلُ مِنِّي» ثُمَّ قَالَ: «يخرُجُ فِي آخرِ الزَّمانِ قومٌ كأنَّ هَذَا مِنْهُم يقرؤون الْقُرْآنَ لَا يُجَاوِزُ تَرَاقِيَهُمْ يَمْرُقُونَ مِنَ الْإِسْلَامِ كَمَا يَمْرُقُ السَّهْمُ مِنَ الرَّمِيَّةِ سِيمَاهُمُ التَّحْلِيقُ لَا يَزَالُونَ يَخْرُجُونَ حَتَّى يَخْرُجَ آخِرُهُمْ مَعَ الْمَسِيحِ الدَّجَّالِ فَإِذَا لَقِيتُمُوهُمْ هُمْ شَرُّ الْخَلْقِ والخليقة» . رَوَاهُ النَّسَائِيّ","english":{"narrator":"Sharik b. Shihab said:","text":"I wanted to meet one of the Prophet’s companions to ask him about the Kharijites. Meeting Abu Barza al-Aslami along with some of his companions on a festival day, I asked him whether he had heard God’s Messenger mentioning the Kharijites, and he replied that he had both heard him with his ears and seen him with his eyes. He told that God’s Messenger was brought some property and divided it, giving something to those on his right and those on his left, but giving nothing to those who were behind him. One of those behind him, a black man whose hair was completely cut off and who was wearing two white garments, then said, \"You have not divided justly, Muhammad.” God's Messenger became very angry and said, “I swear by God that after my death you will not find a man more just than I am,” adding, “At the end of time people looking like this man will come forth, reciting the Qur'an, but it will not pass their throats. They will swerve from Islam as an arrow passes through the game at which is it shot, and their distinguishing mark will be shaving. They will continue to come forth till the last of them comes forth with the antichrist. When you meet them they will be the worst of men and beasts.” \n\nNasa’i transmitted it."}},{"id":100,"idInBook":100,"chapterId":16,"bookId":14,"arabic":"وَعَن أبي غالبٍ رأى أَبُو أُمامةَ رؤوساً مَنْصُوبَةً عَلَى دَرَجِ دِمَشْقَ فَقَالَ أَبُو أُمَامَةَ: «كِلَابُ النَّارِ شَرُّ قَتْلَى تَحْتَ أَدِيمِ السَّمَاءِ خَيْرُ قَتْلَى مَنْ قَتَلُوهُ» ثُمَّ قَرَأَ (يَوْمَ تبيَضُّ وُجوهٌ وتَسوَدُّ وُجوهٌ)\nالْآيَةَ قِيلَ لِأَبِي أُمَامَةَ: أَنْتَ سَمِعْتُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ؟ قَالَ: لَوْ لَمْ أَسْمَعْهُ إِلَّا مَرَّةً أَوْ مَرَّتَيْنِ أوْ ثَلَاثًا حَتَّى عَدَّ سَبْعًا مَا حَدَّثْتُكُمُوهُ. رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ حَسَنٌ","english":{"narrator":"","text":"Abu Ghalib told that when Abu Umama saw some heads set up on the road to Damascus he said, “The dogs of hell, the worst people killed under the sky. The best who have been killed are those killed by them.” He then recited, “On the day when some faces will be white and some faces will be black (Al-Qur’an, 3:106). Abu Umama was asked whether he had heard it from God’s Messenger and replied, “If I had heard it only once, twice, or thrice (counting up to seven times) I would not have told you.” \n\nTirmidhi and Ibn Majah transmitted it, Tirmidhi saying this is a hasan tradition."}}],"chapter":{"id":16,"bookId":14,"arabic":"كتاب القصاص","english":"Retaliation"}}