{"metadata":{"length":94,"arabic":{"title":"مشكاة المصابيح","author":"الإمام الكاتب التبريزي","introduction":"كتاب الحدود"},"english":{"title":"Mishkat al-Masabih","author":"Al-Khatib Al-Tabrizi","introduction":"Prescribed Punishments"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":17,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ وَزَيْدِ بْنِ خَالِدٍ: أَنَّ رَجُلَيْنِ اخْتَصَمَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَحَدُهُمَا: اقْضِ بَيْنَنَا بِكِتَابِ اللَّهِ وَقَالَ الْآخَرُ: أَجَلْ يَا رَسُولَ اللَّهِ فاقْضِ بَيْننَا بكتابِ الله وائذَنْ لِي أَنْ أَتَكَلَّمَ قَالَ: «تَكَلَّمْ» قَالَ: إِنَّ ابْنِي كَانَ عَسِيفًا عَلَى هَذَا فَزَنَى بِامْرَأَتِهِ فَأَخْبرُونِي أنَّ على ابْني الرَّجْم فاقتديت مِنْهُ بِمِائَةِ شَاةٍ وَبِجَارِيَةٍ لِي ثُمَّ إِنِّي سَأَلْتُ أَهْلَ الْعِلْمِ فَأَخْبَرُونِي أَنَّ عَلَى ابْنِي جَلْدَ مِائَةٍ وَتَغْرِيبَ عَامٍ وَإِنَّمَا الرَّجْمُ عَلَى امْرَأَتِهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَمَا وَالَّذِي نَفْسِي بِيَدِهِ لَأَقْضِيَنَّ بَيْنَكُمَا بِكِتَابِ اللَّهِ أَمَّا غَنَمُكَ وَجَارِيَتُكَ فَرَدٌّ عَلَيْكَ وَأَمَّا ابْنُكَ فَعَلَيْهِ جَلْدُ مِائَةٍ وَتَغْرِيبُ عَامٍ وَأَمَّا أَنْتَ يَا أُنَيْسُ فَاغْدُ إِلَى امْرَأَةِ هَذَا فَإِن اعْترفت فارجمها» فَاعْترفت فرجمها","english":{"narrator":"","text":"Abu Huraira and Zaid b. Khalid told that two men brought a dispute before God’s Messenger, one of them saying, \"Pronounce judgment between us in accordance with God’s Book,\" and the other saying, \"Yes Messenger of God, pronounce judgment between us in accordance with God’s Book, and allow me to speak.\" He told him to speak and he said, \"My son who was a hired servant with this man committed fornication with his wife, and when I was told that my son must be stoned to death I ransomed him with a hundred sheep and a slave girl of mine; but when I asked the learned they told me that my son should receive a hundred lashes and be banished for a year, and that stoning to death applied only to the man’s wife.\" God’s Messenger replied, \"By Him in whose hand my soul is, I shall certainly pronounce judgment between you in accordance with God's Book. Your sheep and your slave girl must be returned to you, and your son shall receive a hundred lashes and be banished for a year. As for you, Unais, go to this man's wife, and if she confesses stone her to death.\" She confessed and he stoned her. \n\n(Bukhari and Muslim.)"}},{"id":2,"idInBook":2,"chapterId":17,"bookId":14,"arabic":"وَعَنْ زَيْدِ بْنِ خَالِدٍ قَالَ: سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْمُرُ فِيمَنْ زَنَى وَلَمْ يُحْصَنْ جَلْدَ مِائَةٍ وَتَغْرِيبَ عَامٍ. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Zaid b. Khalid told that he heard God’s Messenger giving command that an unmarried man who committed fornication should receive a hundred lashes and be banished for a year. \n\nBukhari transmitted it."}},{"id":3,"idInBook":3,"chapterId":17,"bookId":14,"arabic":"وَعَنْ عُمَرَ رَضِيَ اللَّهُ عَنْهُ قَالَ: إِن الله بعث مُحَمَّدًا وَأَنْزَلَ عَلَيْهِ الْكِتَابَ فَكَانَ مِمَّا أَنْزَلَ اللَّهُ تَعَالَى آيَةُ الرَّجْمِ رَجَمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرَجَمْنَا بَعْدَهُ وَالرَّجْمُ فِي كِتَابِ اللَّهِ حَقٌّ عَلَى مَنْ زَنَى إِذَا أُحْصِنَ مِنَ الرِّجَالِ وَالنِّسَاءِ إِذَا قَامَتِ الْبَيِّنَةُ أَوْ كانَ الحَبَلُ أَو الِاعْتِرَاف","english":{"narrator":"‘Umar said:","text":"God sent Muhammad with the truth and sent down the Book to him, and the verse of stoning was included in what God most high sent down. God's Messenger had people stoned to death and we have done it also since his death. Stoning is a duty laid down in God’s Book for married men and women who commit fornication when proof is established, or if there is pregnancy, or a confession. \n\n(Bukhari and Muslim.)"}},{"id":4,"idInBook":4,"chapterId":17,"bookId":14,"arabic":"وَعَنْ عُبَادَةَ بْنِ الصَّامِتِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" خُذُوا عَنِّي خُذُوا عَنِّي قَدْ جَعَلَ اللَّهُ لَهُنَّ سَبِيلًا: الْبِكْرُ بالبكر جلد مائَة ووتغريب عَام وَالثَّيِّب بِالثَّيِّبِ جلد مائَة وَالرَّجم \"","english":{"narrator":"","text":"‘Ubada b. as-Samit reported the Prophet as saying, “Receive my teaching, receive my teaching God has appointed a way for those women (Cf. Al-Qur'an, 4:15). When the parties are unmarried they shall receive a hundred lashes and be banished for a year when they commit fornication and when they have been married they shall receive a hundred lashes and be stoned to death.” \n\nMuslim transmitted it."}},{"id":5,"idInBook":5,"chapterId":17,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ: أَن الْيَهُود جاؤوا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرُوا لَهُ أَنَّ رَجُلًا مِنْهُمْ وَامْرَأَةً زَنَيَا فَقَالَ لَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا تَجِدُونَ فِي التَّوْرَاةِ فِي شَأْنِ الرَّجْمِ؟» قَالُوا: نَفْضَحُهُمْ وَيُجْلَدُونَ قَالَ عَبْدُ اللَّهِ بْنُ سَلَامٍ: كَذَبْتُمْ إِنَّ فِيهَا الرَّجْمَ فَأْتُوا بِالتَّوْرَاةِ فَنَشَرُوهَا فَوَضَعَ أَحَدُهُمْ يَدَهُ عَلَى آيَةِ الرَّجْمِ فَقَرَأَ مَا قَبْلَهَا وَمَا بَعْدَهَا فَقَالَ عَبْدُ اللَّهِ بْنُ سَلَامٍ: ارْفَعْ يَدَكَ فَرَفَعَ فإِذا فِيهَا آيةُ الرَّجم. فَقَالُوا: صدقَ يَا محمَّدُ فِيهَا آيَة الرَّجْم. فَأمر بهما النَّبِي صلى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرُجِمَا. وَفِي رِوَايَةٍ: قَالَ: ارْفَعْ يَدَكَ فَرَفَعَ فَإِذَا فِيهَا آيَةُ الرَّجْمِ تَلُوحُ فَقَالَ: يَا مُحَمَّدُ إِنَّ فِيهَا آيَةَ الرَّجْمِ وَلِكِنَّا نَتَكَاتَمُهُ بَيْنَنَا فَأَمَرَ بِهِمَا فَرُجِمَا","english":{"narrator":"","text":"‘Abdallah b. ‘Umar told that the Jews came to God’s Messenger and mentioned to him that a man and a woman of their number had committed fornication. He asked them what they found in the Torah about stoning and they replied that they should disgrace them and that they should be beaten. ‘Abdallah b. Salam then said, “You lie; it contains instruction that they should be stoned to death, so bring the Torah.” They spread it out, and one of them put his hand over the verse of stoning and read what preceded it and what followed it. 'Abdallah b. Salam told him to lift his hand and when he did so the verse of stoning was seen to be in it. They then said, “He has spoken the truth, Muhammad; the verse of stoning is in it.” The Prophet then gave command regarding them and they were stoned to death. In a version it says that he told him to lift his hand and that when he did so the verse of stoning was clearly in it. The man then said, “It contains the verse of stoning, Muhammad, but we have been concealing it from one another.” He then gave command regarding them and they were stoned to death. \n\n(Bukhari and Muslim.)"}},{"id":6,"idInBook":6,"chapterId":17,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: أَتَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلٌ وَهُوَ فِي الْمَسْجِدِ فَنَادَاهُ: يَا رَسُولَ اللَّهِ إِنِّي زَنَيْتُ فَأَعْرَضَ عَنْهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَتَنَحَّى لِشِقِّ وَجْهِهِ الَّذِي أَعْرَضَ قِبَلَهُ فَقَالَ: إِنِّي زَنَيْتُ فَأَعْرَضَ عَنْهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا شَهِدَ أَرْبَعَ شَهَادَاتٍ دَعَاهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «أَبِكَ جُنُونٌ؟» قَالَ: لَا فَقَالَ: «أُحْصِنْتَ؟» قَالَ: نَعَمْ يَا رَسُولَ اللَّهِ قَالَ: «اذْهَبُوا بِهِ فَارْجُمُوهُ» قَالَ ابْنُ شِهَابٍ: فَأَخْبَرَنِي مَنْ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ: فَرَجَمْنَاهُ بِالْمَدِينَةِ فَلَمَّا أَذْلَقَتْهُ الْحِجَارَةُ هَرَبَ حَتَّى أَدْرَكْنَاهُ بِالْحَرَّةِ فرجمناه حَتَّى مَاتَ\nوَفِي رِوَايَةٍ لِلْبُخَارِيِّ: عَنْ جَابِرٍ بَعْدَ قَوْلِهِ: قَالَ: نَعَمْ فَأَمَرَ بِهِ فَرُجِمَ بِالْمُصَلَّى فَلَمَّا أَذْلَقَتْهُ الْحِجَارَةُ فَرَّ فَأُدْرِكَ فَرُجِمَ حَتَّى مَاتَ. فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خيرا وَصلى عَلَيْهِ","english":{"narrator":"Abu Huraira told of a man who came to the Prophet when he was in the mosque and called to him, “Messenger of God, I have committed fornication ” The Prophet turned away from him, so the man came round facing him and said, “I have committed fornication,” but the Prophet turned away. Then when he had testified four times the Prophet called him and said, “Are you mad?” When he replied that he was not he asked him if he was married, and when he replied that he was, God’s Messenger said, “Take him away and stone him to death.” Ibn Shihab said:","text":"I was informed by one who heard Jabir b. ‘Abdallah say, “Then we stoned him in Medina, but when the stones hurt him he ran away, and we caught up on him in the harra and stoned him to death.” In aversion by Bukhari on Jabir’s authority, after “he replied that he was” it says that he gave command regarding him and he was stoned in the place of prayer. Then when the stones hurt him he fled, but was overtaken and stoned to death. The Prophet then spoke well of him and prayed over him.\n\n(Bukhari and Muslim.)"}},{"id":7,"idInBook":7,"chapterId":17,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: لَمَّا أَتَى مَاعِزُ بن مَالك النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَهُ: «لَعَلَّكَ قَبَّلْتَ أَوْ غَمَزْتَ أَوْ نَظَرْتَ؟» قَالَ: لَا يَا رَسُولَ اللَّهِ قَالَ: «أَنِكْتَهَا؟» لَا يُكَنِّي قَالَ: نَعَمْ فَعِنْدَ ذَلِكَ أَمر رجمه. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Ibn ‘Abbas said that when Ma'iz b. Malik came to the Prophet and he* said, “Perhaps you kissed, or squeezed, or looked,” he replied, “No, Messenger of God.” He then said, “Did you have intercourse with her?” asking the question in plain words, and when he replied that he had, he gave orders that he should be stoned to death. \n\nBukhari transmitted it.\n\n* i.e. the Prophet. The tradition leaves it to be inferred that Ma'iz had confessed to committing fornication."}},{"id":8,"idInBook":8,"chapterId":17,"bookId":14,"arabic":"وَعَنْ بُرَيْدَةَ قَالَ: جَاءَ مَاعِزُ بْنُ مَالِكٍ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: يَا رَسُولَ اللَّهِ طَهِّرْنِي فَقَالَ: «وَيْحَكَ ارْجِعْ فَاسْتَغْفر الله وَتب إِلَيْهِ» . فَقَالَ: فَرَجَعَ غَيْرَ بَعِيدٍ ثُمَّ جَاءَ فَقَالَ: يَا رَسُولَ اللَّهِ طَهِّرْنِي. فَقَالَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَ ذَلِكَ حَتَّى إِذَا كَانَتِ الرَّابِعَة قَالَه لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «فِيمَ أُطَهِّرُكَ؟» قَالَ: مِنَ الزِّنَا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَبِهِ جُنُونٌ؟» فَأُخْبِرَ أَنَّهُ لَيْسَ بِمَجْنُونٍ فَقَالَ: «أَشَرِبَ خَمْرًا؟» فَقَامَ رَجُلٌ فَاسْتَنْكَهَهُ فَلَمْ يَجِدْ مِنْهُ رِيحَ خَمْرٍ فَقَالَ: «أَزَنَيْتَ؟» قَالَ: نَعَمْ فَأَمَرَ بِهِ فَرُجِمَ فَلَبِثُوا يَوْمَيْنِ أَوْ ثَلَاثَةً ثُمَّ جَاءَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «اسْتَغْفِرُوا لِمَاعِزِ بْنِ مَالِكٍ لَقَدْ تَابَ تَوْبَةً لَوْ قُسِّمَتْ بَيْنَ أُمَّةٍ لَوَسِعَتْهُمْ» ثُمَّ جَاءَتْهُ امْرَأَةٌ مِنْ غَامِدٍ مِنَ الْأَزْدِ فَقَالَتْ: يَا رَسُولَ اللَّهِ طَهِّرْنِي فَقَالَ: «وَيَحَكِ ارْجِعِي فَاسْتَغْفِرِي اللَّهَ وَتُوبِي إِلَيْهِ» فَقَالَتْ: تُرِيدُ أَنْ تَرْدُدَنِي كَمَا رَدَدْتَ مَاعِزَ بْنَ مَالِكٍ: إِنَّهَا حُبْلَى مِنَ الزِّنَا فَقَالَ: «أَنْتِ؟» قَالَتْ: نَعَمْ قَالَ لَهَا: «حَتَّى تَضَعِي مَا فِي بَطْنِكِ» قَالَ: فكَفَلَها رَجُلٌ مِنَ الْأَنْصَارِ حَتَّى وَضَعَتْ فَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: قَدْ وَضَعَتِ الغامديَّةُ فَقَالَ: «إِذاً لَا نرجُمها وندعُ وَلَدَهَا صَغِيرًا لَيْسَ لَهُ مَنْ يُرْضِعُهُ» فَقَامَ رَجُلٌ مِنَ الْأَنْصَارِ فَقَالَ: إِلَيَّ رَضَاعُهُ يَا نَبِيَّ اللَّهِ قَالَ: فَرَجَمَهَا. وَفِي رِوَايَةٍ: أَنَّهُ قَالَ لَهَا: «اذْهَبِي حَتَّى تَلِدِي» فَلَمَّا وَلَدَتْ قَالَ: «اذْهَبِي فَأَرْضِعِيهِ حَتَّى تَفْطِمِيهِ» فَلَمَّا فَطَمَتْهُ أَتَتْهُ بِالصَّبِيِّ فِي يَدِهِ كِسْرَةُ خُبْزٍ فَقَالَتْ: هَذَا يَا نَبِيَّ اللَّهِ قَدْ فَطَمْتُهُ وَقَدْ أَكَلَ الطَّعَامَ فَدَفَعَ الصَّبِيَّ إِلَى رَجُلٍ مِنَ الْمُسْلِمِينَ ثُمَّ أَمَرَ بِهَا فَحُفِرَ لَهَا إِلَى صَدْرِهَا وَأَمَرَ النَّاسَ فَرَجَمُوهَا فَيُقْبِلُ خَالِدُ بْنُ الْوَلِيدِ بِحَجْرٍ فَرَمَى رَأْسَهَا فَتَنَضَّحَ الدَّمُ عَلَى وَجْهِ خَالِدٍ فَسَبَّهَا فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «مهلا يَا خَالِد فو الَّذِي نَفْسِي بِيَدِهِ لَقَدْ تَابَتْ تَوْبَةً لَوْ تَابَهَا صَاحِبُ مَكْسٍ لَغُفِرَ لَهُ» ثُمَّ أَمَرَ بِهَا فصلى عَلَيْهَا ودفنت. رَوَاهُ مُسلم","english":{"narrator":"","text":"Buraida told that Ma'iz b. Malik came to the Prophet and said, “Purify me, Messenger of God.” He replied, “Out upon you! Go back, ask God's forgiveness and turn to Him in repentance.” He said that he went back not very far, then came and said, “Purify me, Messenger of God,” and the Prophet said the same as he had said before. When this went on till a fourth time he asked, “For what am I to purify you?” and he replied that it was because of fornication. God’s Messenger then asked if the man was mad, and when he was told that he was not, he asked if he had drunk wine. A man got up and smelt his breath but noticed no smell of wine, so the Prophet asked him if he had committed fornication, and when he replied that he had, he gave orders regarding him and he was stoned to death. Two or three days later God’s Messenger came and said, “Ask forgiveness for Ma'iz b. Malik. He has repented to such an extent that if it were divided among a people it would be enough for them all.” Then a woman of Ghamid, a branch of Azd came to him and said, “Purify me, Messenger of God.” He replied, “Out upon you! Go back, ask God’s forgiveness and turn to Him in repentance.” She said, “Do you want to send me back as you did to Ma'iz b. Malik when I am 1 pregnant as a result of fornication?” He asked whether she was referring to herself, and when she replied that she was, he told her to wait till she had given birth to what was in her womb. One of the Ansar became responsible for her till she was delivered of a child, and then went to the Prophet and told him that the woman of Ghamid had given birth to a child. He said, \"In that case we shall not stone her and so leave her child as an infant with no one to suckle him.” One of the Ansar then got up and said, \"I shall be responsible for his suckling, Prophet of God.\" He then had her stoned to death. A version says that he told her to go away till she gave birth to a child, then when she did, he told her to go away and suckle him till she had weaned him. When she had weaned him she brought the boy to him with a piece of bread in his hand and said, \"I have weaned this one and he has eaten food.\" He (hen handed the boy over to one of the Muslims, and when he had given command regarding her and she was put in a hole up to her breast, he ordered the people to stone her. Khalid b. al-Walid came forward with a stone which he threw at her head, and when the blood spurted on his face he cursed her, but the Prophet said, \"Gently, Khalid, By Him in whose hand my soul is, she has repented to such an extent that if one who wrongfully takes an extra tax 2 were to repent to a like extent he would be forgiven.\" Then giving command regarding her, he prayed over her and she was buried. \n\nMuslim transmitted it.\n\n    1. The Arabic uses the third person, saying she was pregnant. It may be an explanatory phrase, but I have ventured to treat it as part of the woman's word since this makes the sentence read a little more easily.\n    2. Sahib maks. Maks was money taken from sellers in the market in pre-Islamic times; it is also used of something taken by a tax-collector over and above that is duo."}},{"id":9,"idInBook":9,"chapterId":17,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِذَا زَنَتْ أَمَةُ أَحَدِكُمْ فَتَبَيَّنَ زِنَاهَا فَلْيَجْلِدْهَا الحدَّ وَلَا يُثَرِّبْ عَلَيْهَا ثمَّ إِنْ زنَتْ فلْيجلدْها الحدَّ وَلَا يُثَرِّبْ ثُمَّ إِنْ زَنَتِ الثَّالِثَةَ فَتَبَيَّنَ زِنَاهَا فَلْيَبِعْهَا ولوْ بحبْلٍ منْ شعرٍ»","english":{"narrator":"","text":"Aba Huraira told that he heard the Prophet say, \"When the slave woman of any of you commits fornication and the matter is clear, he should give her the appropriate beating, but not hurl reproaches at her. If she does it again he should give her the appropriate beating, but not hurl reproaches at her. If she does it a third time and the matter is clear he should sell her, even if only for a rope of hair.\" \n\n(Bukhari and Muslim)"}},{"id":10,"idInBook":10,"chapterId":17,"bookId":14,"arabic":"وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ: يَا أَيُّهَا النَّاسُ أَقِيمُوا عَلَى أَرِقَّائِكُمُ الْحَدَّ مَنْ أُحْصِنَ مِنْهُمْ وَمَنْ لَمْ يُحْصَنْ فَإِنَّ أَمَةً لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَنَتْ فَأَمَرَنِي أَنْ أَجْلِدَهَا فَإِذَا هِيَ حَدِيثُ عَهْدٍ بِنِفَاسٍ فَخَشِيتُ إِنْ أَنَا جَلَدْتُهَا أَنْ أَقْتُلَهَا فَذَكَرْتُ ذَلِكَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «أَحْسَنْتَ» . رَوَاهُ مُسْلِمٌ. وَفِي رِوَايَةِ أَبِي دَاوُدَ: قَالَ: «دَعْهَا حَتَّى يَنْقَطِعَ دَمُهَا ثُمَّ أَقِمْ عَلَيْهَا الْحَدَّ وَأَقِيمُوا الْحُدُودَ عَلَى مَا مَلَكَتْ أَيْمَانكُم»","english":{"narrator":"Ali said:","text":"You people must carry out the punishment on your slaves, those of them who are married and those who are not, for a slave woman belonging to God’s Messenger committed fornication and he ordered me to beat her. But she had recently given birth to a child and I was afraid that if I beat her I might kill her, so I mentioned that to the Prophet and he said, “You have done well.\" \n\nMuslim transmitted it.\n\nIn a version by Abd Dawud he said, “Leave her till her blood stops flowing and then carry out the punishment on her, and carry out* the punishment on your female slaves”.\n\nAbu Dawud.\n\n*Here the verb is plural."}},{"id":11,"idInBook":11,"chapterId":17,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ قَالَ: جَاءَ مَاعِزٌ الْأَسْلَمِيُّ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: إِنَّه قدْ زَنى فأعرضَ عَنهُ ثمَّ جَاءَ مِنْ شِقِّهِ الْآخَرِ فَقَالَ: إِنَّهُ قَدْ زنى فَأَعْرض عَنهُ ثمَّ جَاءَ من شقَّه الْآخَرِ فَقَالَ: يَا رَسُولَ اللَّهِ إِنَّهُ قَدْ زَنى فَأَمَرَ بِهِ فِي الرَّابِعَةِ فَأُخْرِجَ إِلَى الْحَرَّةِ فَرُجِمَ بِالْحِجَارَةِ فَلَمَّا وَجَدَ مَسَّ الْحِجَارَةِ فَرَّ يَشْتَدُّ حَتَّى مَرَّ بِرَجُلٍ مَعَهُ لَحْيُ جَمَلٍ فَضَرَبَهُ بِهِ وَضَرَبَهُ النَّاسُ حَتَّى مَاتَ. فَذَكَرُوا ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنه فرحين وَجَدَ مَسَّ الْحِجَارَةِ وَمَسَّ الْمَوْتِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «هَلَّا تَرَكْتُمُوهُ» . رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ وَفِي رِوَايَةٍ: «هَلَّا تَرَكْتُمُوهُ لَعَلَّه أَن يَتُوب الله عَلَيْهِ»","english":{"narrator":"","text":"Abu Huraira told that when Ma'iz al-Aslami came to God’s Messenger and said he had committed fornication he turned away from him. He then came round to the other side and said he had committed fornication, but he turned away from him. He came round again saying he had committed fornication, and when he said it a fourth time God’s Messenger gave command regarding him and he was taken out to the harra and stoned. When he felt the effect of the stones he ran away vigorously till he passed a man who had the jawbone of a camel with which he struck him, and the people struck him till he died. They then mentioned to God’s Messenger that he had fled when he felt the effect of the stones and the touch of death, and he said, “Why did you not leave him alone?” A version has, “Why did you not leave him alone?\tPerhaps he might have repented and been forgiven by God.”\n\nTirmidhi and Ibn Majah transmitted it."}},{"id":12,"idInBook":12,"chapterId":17,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِمَاعِزِ بْنِ مَالِكٍ: «أَحَقٌّ مَا بَلَغَنِي عَنْكَ؟» قَالَ: وَمَا بَلَغَكَ عَنِّي؟ قَالَ: «بَلَغَنِي أَنَّكَ قَدْ وَقَعْتَ عَلَى جَارِيَةِ آلِ فُلَانٍ» قَالَ: نَعَمْ فَشَهِدَ أَرْبَعَ شَهَادَاتٍ فَأمر بهِ فرجم. رَوَاهُ مُسلم","english":{"narrator":"","text":"Ibn ‘Abbas told that the Prophet asked Ma'iz b. Malik, “Is what I have heard about you true?” He asked what he had heard about him, and he replied that he had heard he had had intercourse with a girl belonging to the family of so and so. When he admitted it, and had acknowledged it four times, he ordered him to be stoned to death.\n\nMuslim transmitted it. (Here a tradition by Muslim has been placed in Section II.)"}},{"id":13,"idInBook":13,"chapterId":17,"bookId":14,"arabic":"وَعَنْ يَزِيدَ بْنِ نُعَيْمٍ عَنْ أَبِيهِ أَنَّ مَاعِزًا أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَقَرَّ عِنْدَهُ أَرْبَعَ مَرَّاتٍ فَأَمَرَ بِرَجْمِهِ وَقَالَ لِهَزَّالٍ: «لَوْ سَتَرْتَهُ بِثَوْبِكَ كَانَ خَيْرًا لَكَ» قَالَ ابْنُ الْمُنْكَدِرِ: إِنَّ هَزَّالًا أَمَرَ مَاعِزًا أَنْ يَأْتِيَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فيخبره. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Yazid b. Nu'aim, on his father’s authority, told that Ma‘iz came to the Prophet and confirmed the matter four times in his presence, so he ordered him to be stoned to death, but said to Hazzal, “If you had covered him with your garment it would have been better for you.” Ibn al-Munkadir said Hazzal had ordered Ma'iz to go to the Prophet\nand tell him. \n\nAbu Dawud transmitted it."}},{"id":14,"idInBook":14,"chapterId":17,"bookId":14,"arabic":"وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ عَبْدِ اللَّهِ بْنِ عَمْرٍو بْنِ الْعَاصِ رَضِيَ اللَّهُ عَنْهُمَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «تَعَافَوُا الْحُدُودَ فِيمَا بَيْنَكُمْ فَمَا بَلَغَنِي مِنْ حَدٍّ فَقَدْ وَجَبَ» . رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ","english":{"narrator":"","text":"‘Amr b. Shu'aib, on his father’s authority, told that his grandfather, ‘Abdallah b. ‘Amr b. al-‘As, reported God’s Messenger as saying, “Forgive the infliction of prescribed penalties among yourselves, for any prescribed penalty of which I hear must be carried out.” \n\nAbu Dawud and Nasa’i transmitted it."}},{"id":15,"idInBook":15,"chapterId":17,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أقيلوا ذَوي الهيآت عثراتهم إِلَّا الْحُدُود» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"‘A’isha reported the Prophet as saying, “Forgive the people of good qualities their slips, but not faults to which prescribed penalties apply.” \n\nAbu Dawud transmitted it."}},{"id":16,"idInBook":16,"chapterId":17,"bookId":14,"arabic":"وَعَنْهَا قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «ادرؤا الْحُدُودَ عَنِ الْمُسْلِمِينَ مَا اسْتَطَعْتُمْ فَإِنْ كَانَ لَهُ مَخْرَجٌ فَخَلُّوا سَبِيلَهُ فَإِنَّ الْإِمَامَ أَنْ يُخْطِئَ فِي الْعَفْوِ خَيْرٌ مِنْ أَنْ يُخْطِئَ فِي الْعُقُوبَةِ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: قَدْ رُوِيَ عَنْهَا وَلم يرفع وَهُوَ أصح","english":{"narrator":"","text":"She reported God’s Messenger as saying, “Avert the infliction of prescribed penalties on Muslims as much as you can, and if there is any way out let a man go, for it is better for a leader to make a mistake in forgiving than to make a mistake in punishing.” \n\nTirmidhi transmitted it, saying it has been transmitted from her without tracing it to the Prophet, and that is sounder."}},{"id":17,"idInBook":17,"chapterId":17,"bookId":14,"arabic":"وَعَنْ وَائِلِ بْنِ حُجْرٍ قَالَ: اسْتُكْرِهَتِ امْرَأَةٌ عَلَى عَهْدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَدَرَأَ عَنْهَا الْحَدَّ وَأَقَامَهُ عَلَى الَّذِي أَصَابَهَا وَلَمْ يُذْكَرْ أَنَّهُ جَعَلَ لَهَا مَهْرًا. رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Wa’il b. Hujr said that when a woman was forced against her will in the time of God’s Messenger he averted the punishment from her but inflicted it on the one who had molested her. The transmitter did not mention that he appointed a dower to be paid her. \n\nTirmidhi transmitted it."}},{"id":18,"idInBook":18,"chapterId":17,"bookId":14,"arabic":"وَعَنْهُ: أَنَّ امْرَأَةً خَرَجَتْ عَلَى عَهْدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تُرِيدُ الصَّلَاةَ فَتَلَقَّاهَا رَجُلٌ فَتَجَلَّلَهَا فَقَضَى حَاجَتَهُ مِنْهَا فَصَاحَتْ وَانْطَلَقَ وَمَرَّتْ عِصَابَةٌ مِنَ الْمُهَاجِرِينَ فَقَالَتْ: إِنَّ ذَلِكَ الرَّجُلَ فَعَلَ بِي كَذَا وَكَذَا فَأَخَذُوا الرَّجُلَ فَأَتَوْا بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَهَا: «اذْهَبِي فَقَدْ غَفَرَ اللَّهُ لَكِ» وَقَالَ لِلرَّجُلِ الَّذِي وَقَعَ عَلَيْهَا: «ارْجُمُوهُ» وَقَالَ: «لَقَدْ تَابَ تَوْبَةً لَوْ تَابَهَا أَهْلُ الْمَدِينَةِ لَقُبِلَ مِنْهُمْ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ","english":{"narrator":"","text":"He said that a woman went out in the time of the Prophet to go to prayer, and a man who met her attacked her and got his desire of her. She shouted and he went off, and when a company of the Emigrants came by she said, “That man did such and such to me.” They seized the man and brought him to God’s Messenger who said to the woman, “Go away, for God has forgiven you,” but of the man who had had intercourse with her he said, “Stone him to death.” He also said, “He has repented to such an extent that if the people of Medina had repented similarly it would have been accepted from them.” \n\nTirmidhi and Abu Dawud transmitted it."}},{"id":19,"idInBook":19,"chapterId":17,"bookId":14,"arabic":"وَعَنْ جَابِرٍ: أَنَّ رَجُلًا زَنَى بِامْرَأَةٍ فَأَمَرَ بِهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجُلِدَ الْحَدَّ ثُمَّ أُخْبِرَ أَنَّهُ مُحْصَنٌ فَأَمَرَ بِهِ فرجم. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Jabir said that a man committed fornication with a woman and the Prophet gave command that he be given the appropriate beating, but on being told afterwards that the man was married he gave command that he should be stoned to death. \n\nAbu Dawud transmitted it."}},{"id":20,"idInBook":20,"chapterId":17,"bookId":14,"arabic":"وَعَنْ سَعِيدِ بْنِ سَعْدِ بْنِ عُبَادَةَ أَنَّ سَعْدَ بْنَ عُبَادَةَ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِرَجُلٍ كَانَ فِي الْحَيِّ مُخْدَجٍ سقيم فَوجدَ على أمة من إمَائِهِمْ بخبث بِهَا فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «خُذُوا لَهُ عِثْكَالًا فِيهِ مِائَةُ شِمْرَاخٍ فَاضْرِبُوهُ ضَرْبَة» . رَوَاهُ فِي شَرْحِ السُّنَّةِ وَفِي رِوَايَةِ ابْنِ مَاجَه نَحوه","english":{"narrator":"","text":"Sa'id b. Sa'd b. ‘Ubada told that Sa'd b. ‘Ubada brought the Prophet a man deficient in build and sick, a member of the clan, who had been found in the act of having illicit intercourse with a slave woman of theirs. The Prophet said, “Get for him a stalk of the raceme of a palm-tree with a hundred twigs and strike him once.” \n\nIt is transmitted in Sharh as-sunna; and there is something similar in Ibn Majah’s version."}},{"id":21,"idInBook":21,"chapterId":17,"bookId":14,"arabic":"وَعَنْ عِكْرِمَةَ عَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «من وَجَدْتُمُوهُ يَعْمَلُ عَمَلَ قَوْمِ لُوطٍ فَاقْتُلُوا الْفَاعِلَ وَالْمَفْعُول بِهِ» . رَوَاهُ التِّرْمِذِيّ وَابْن مَاجَه","english":{"narrator":"","text":"‘Ikrima reported on the authority of Ibn ‘Abbas that God’s Messenger said, “If you find anyone doing as Lot’s people did, kill the one who does it and the one to whom it is done.” \n\nTirmidhi and Ibn Majah transmitted it."}},{"id":22,"idInBook":22,"chapterId":17,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَتَى بَهِيمَةً فَاقْتُلُوهُ وَاقْتُلُوهَا مَعَهُ» . قِيلَ لِابْنِ عَبَّاسٍ: مَا شَأْنُ الْبَهِيمَةِ؟ قَالَ: مَا سَمِعْتُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي ذَلِكَ شَيْئا وَلَكِن أره كَرِهَ أَنْ يُؤْكَلَ لَحْمُهَا أَوْ يُنْتَفَعَ بِهَا وَقَدْ فُعِلَ بِهَا ذَلِكَ. رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُد وَابْن مَاجَه","english":{"narrator":"","text":"Ibn ‘Abbas reported God’s Messenger as saying, “If anyone has sexual intercourse with an animal, kill him and kill it along with him.” Ibn ‘Abbas was asked what offence could be attributed to the animal and replied, “I did not hear anything about that from God’s Messenger, but I think he disapproved of its flesh being eaten or of any use being made of it when such a thing had been done to it.” \n\nTirmidhi, Abu Dawud and Ibn Majah transmitted it."}},{"id":23,"idInBook":23,"chapterId":17,"bookId":14,"arabic":"عَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ أَخْوَفَ مَا أَخَافُ عَلَى أُمَّتِي عَمَلُ قَوْمِ لُوطٍ» . رَوَاهُ التِّرْمِذِيُّ وَابْن مَاجَه","english":{"narrator":"","text":"Jabir reported God’s Messenger as saying, “The thing I fear most for my people is what Lot’s people did.” \n\nTirmidhi and Ibn Majah transmitted it."}},{"id":24,"idInBook":24,"chapterId":17,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ: أَنَّ رَجُلًا مِنْ بَنِي بَكْرِ بْنِ لَيْثٍ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَقَرَّ أَنَّهُ زَنَى بِامْرَأَةٍ أَرْبَعَ مَرَّاتٍ فَجَلَدَهُ مِائَةً وَكَانَ بِكْرًا ثُمَّ سَأَلَهُ الْبَيِّنَةَ عَلَى الْمَرْأَةِ فَقَالَتْ: كَذَبَ وَاللَّهِ يَا رَسُولَ اللَّهِ فَجُلِدَ حَدَّ الْفِرْيَةِ. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Ibn ‘Abbas told that a man of B. Bakr b. Laith came to the Prophet and made a statement four times that he had committed fornication with a woman, so he had a hundred lashes administered to him. The man had not been married. He then asked him to produce proof again the woman, and she said, “I swear by God, Messenger of God, that he has lied.” Then he was given the prescribed number of lashes for falsehood. \n\nAbu Dawud transmitted it."}},{"id":25,"idInBook":25,"chapterId":17,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ قَالَتْ: لَمَّا نَزَلَ عُذْرِي قَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمِنْبَرِ فَذَكَرَ ذَلِكَ فَلَمَّا نَزَلَ مِنَ الْمِنْبَرِ أَمَرَ بِالرَّجُلَيْنِ وَالْمَرْأَةِ فَضُرِبُوا حَدَّهُمْ. رَوَاهُ أَبُو دَاوُدَ","english":{"narrator":"‘A’isha said:","text":"When my vindication came down (Al-Qur’an, 24:11 ff) the Prophet mounted the pulpit and mentioned that. Then when he came down from the pulpit he ordered that the two men and the woman* should be given the prescribed beating. \n\nAbu Dawud transmitted it.\n\n*The men are said to have been Mistah b. Uthatha and Hassan b. Thabit, and the woman Hamna daughter of Jahsh. Ibn 'Abd al-Barr, Istiab. p. 285, says Mistah was beaten, but he does not commit himself on p. 127 about Hassan, or on p. 714 about Hamna."}},{"id":26,"idInBook":26,"chapterId":17,"bookId":14,"arabic":"عَنْ نَافِعٍ: أَنَّ صَفِيَّةَ بِنْتَ أَبِي عُبَيْدٍ أَخْبَرَتْهُ أَنَّ عَبْدًا مِنْ رَقِيقِ الْإِمَارَةِ وَقَعَ على وليدةٍ من الخُمسِ فاستَكرهَها حَتَّى افتضَّها فَجَلَدَهُ عُمَرُ وَلَمْ يَجْلِدْهَا مِنْ أَجْلِ أَنَّهُ استكرهها. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Nafi' said he was informed by Safiya daughter of Abu ‘Ubaid that one of the Caliph’s slaves had intercourse with a girl who was among the fifth of the booty, forcing her to it against her will, and deflowered her. ‘Umar had him beaten but did not have her beaten because he had forced her against her will. \n\nBukhari transmitted it."}},{"id":27,"idInBook":27,"chapterId":17,"bookId":14,"arabic":"وَعَنْ يَزِيدَ بْنِ نُعَيْمِ بْنِ هَزَّالٍ عَنْ أَبِيهِ قَالَ: كَانَ مَاعِزُ بْنُ مَالِكٍ يَتِيمًا فِي حِجْرِ أَبِي فَأَصَابَ جَارِيَةً مِنَ الْحَيِّ فَقَالَ لَهُ أَبِي: ائْتِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرَهُ بِمَا صَنَعْتَ لَعَلَّهُ يَسْتَغْفِرُ لَكَ وَإِنَّمَا يُرِيدُ بِذَلِكَ رَجَاءَ أَنْ يَكُونَ لَهُ مَخْرَجًا فَآتَاهُ فَقَالَ: يَا رَسُولَ اللَّهِ إِني زنيتُ فأقِمْ عليَّ كتابَ اللَّهِ حَتَّى قَالَهَا أَرْبَعَ مَرَّاتٍ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِنَّكَ قَدْ قُلْتَهَا أَرْبَعَ مَرَّاتٍ فَبِمَنْ؟ \" قَالَ: بِفُلَانَةَ. قَالَ: «هَلْ ضَاجَعْتَهَا؟» قَالَ: نَعَمْ قَالَ: «هَلْ بَاشَرْتَهَا؟» قَالَ: نَعَمْ قَالَ: «هَلْ جَامَعْتَهَا؟» قَالَ: نَعَمْ قَالَ: فَأَمَرَ بِهِ أَنْ يُرْجَمَ فَأُخْرِجُ بِهِ إِلَى الْحَرَّةِ فَلَمَّا رُجِمَ فَوَجَدَ مَسَّ الْحِجَارَةِ فَجَزِعَ فَخَرَجَ يَشْتَدُّ فَلَقِيَهُ عَبْدُ اللَّهِ بْنُ أُنَيْسٍ وَقَدْ عَجَزَ أَصْحَابُهُ فَنَزَعَ لَهُ بِوَظِيفِ بَعِيرٍ فَرَمَاهُ بِهِ فَقَتَلَهُ ثُمَّ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ ذَلِكَ لَهُ فَقَالَ: «هَلَّا تَرَكْتُمُوهُ لَعَلَّهُ أَنْ يَتُوبَ. فَيَتُوبَ اللَّهُ عَلَيْهِ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Yazid b. Nu'aim b. Hazzal told on his father’s authority that Ma'iz b. Malik who was an orphan under his father's protection had intercourse with a slave girl belonging to the clan, so his father told him to go and inform God's Messenger what he had done, for he might perhaps ask forgiveness for him. His purpose in that was simply a hope that it might be a way of escape for him. He went to him and said, “Messenger of God, I have committed fornication, so inflict on me the punishment ordained by God.” He turned away from him, so he came back and said, “Messenger of God, I have committed fornication, so inflict on me the punishment ordained by God.” When he had said it four times God’s Messenger said, “You have said it four times. With whom did you commit it?” When he replied that it was with so and so he asked whether he had lain with her and he replied that he had. He asked whether his skin had been in contact with hers and he replied that it had. He then asked whether he had had intercourse with her and he replied that he had. He ordered him to be stoned to death and he was taken out to the harra, but when he felt the effect of the stones and could not bear it he went away quickly. But ‘Abdallah b. Unais encountered him when those who had been stoning him could not catch up on him, threw the bone of a camel’s foreleg at him, hit him and killed him. Then when he went to the Prophet and mentioned that to him he said, “Why did you not leave him alone,* for perhaps he might have repented and been forgiven by God.” \n\nAbu Dawud transmitted it.\n\n*The verb is in the plural."}},{"id":28,"idInBook":28,"chapterId":17,"bookId":14,"arabic":"وَعَنْ عَمْرِو بْنِ الْعَاصِ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَا مِنْ قَوْمٍ يَظْهَرُ فِيهِمُ الزِّنَا إِلَّا أُخِذُوا بِالسَّنَةِ وَمَا مِنْ قَوْمٍ يَظْهَرُ فِيهِمُ الرِّشَا إِلَّا أخذُوا بِالرُّعْبِ» . رَوَاهُ أَحْمد","english":{"narrator":"","text":"‘Amr b. al-'As told that he heard God's Messenger say, “Fornication will not appear among any people without their being punished by famine, and bribery will not appear among any people without their being punished by terror.”\n\nAhmad transmitted it."}},{"id":29,"idInBook":29,"chapterId":17,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ وَأَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَلْعُونٌ مَنْ عَمِلَ عَمَلَ قَوْمِ لُوطٍ» . رَوَاهُ رَزِينٌ\nوَفِي رِوَايَةٍ لَهُ عَنِ ابْنِ عَبَّاسٍ: أَنَّ عليَّاً رَضِي الله عَنهُ أحرَقَهما وَأَبا بكرٍ هدم عَلَيْهِمَا حَائِطا","english":{"narrator":"","text":"Ibn ‘Abbas and Abu Huraira reported God’s Messenger as saying, “Accursed is he who does what Lot's people did.\" \nIn a version by him on the authority of Ibn ‘Abbas it says that ‘Ali had the two people concerned burned and that Abu Bakr had a wall thrown down on them.\n\nRazin transmitted it."}},{"id":30,"idInBook":30,"chapterId":17,"bookId":14,"arabic":"وَعَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يَنْظُرُ اللَّهُ عَزَّ وَجَلَّ إِلَى رَجُلٍ أَتَى رَجُلًا أَوِ امْرَأَةً فِي دُبُرِهَا» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ","english":{"narrator":"","text":" reported God’s Messenger as saying, “God who is great and glorious will not look at a man who has intercourse with a man or a woman through the anus.\" \n\nTirmidhi transmitted it, saying; this is a hasan gharib tradition."}},{"id":31,"idInBook":31,"chapterId":17,"bookId":14,"arabic":"وَعَنْهُ أَنَّهُ قَالَ: «مَنْ أَتَى بَهِيمَةً فَلَا حَدَّ عَلَيْهِ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَقَالَ التِّرْمِذِيُّ: عَنْ سُفْيَانَ الثَّوْرِيِّ أَنَّهُ قَالَ: وَهَذَا أَصَحُّ مِنَ الْحَدِيثِ الْأَوَّلِ وَهُوَ: «مَنْ أَتَى بَهِيمَةً فَاقْتُلُوهُ» وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعلم","english":{"narrator":"","text":"He reported him as saying, “There is no prescribed punishment for one who has intercourse with an animal.\"\n\nTirmidhi and Abu Dawud transmitted it. Tirmidhi quoted Sufyan ath-Thauri as saying that this is sounder than the first tradition, “Kill him who has intercourse with an animal,\" (Cf. p. 763) and that the learned act according to this one."}},{"id":32,"idInBook":32,"chapterId":17,"bookId":14,"arabic":"وَعَنْ عُبَادَةَ بْنِ الصَّامِتِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَقِيمُوا حُدُودَ اللَّهِ فِي الْقَرِيبِ وَالْبَعِيدِ وَلَا تَأْخُذْكُمْ فِي اللَّهِ لوْمةُ لائمٍ» . رَوَاهُ ابنُ مَاجَه","english":{"narrator":"","text":"‘Ubada b. as-Samit reported God’s Messenger as saying, “Enforce God’s prescribed punishments on those who are near and those who are distant, and let no one’s blame come upon you regarding .\" \n\nIbn Majah transmitted it."}},{"id":33,"idInBook":33,"chapterId":17,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِقَامَةُ حَدٍّ مِنْ حُدُودِ اللَّهِ خَيْرٌ مِنْ مَطَرِ أَرْبَعِينَ لَيْلَةً فِي بلادِ الله» . رَوَاهُ ابْن مَاجَه\nوَرَوَاهُ النَّسَائِيُّ عَنْ أَبِي هُرَيْرَةَ","english":{"narrator":"","text":"Ibn ‘Umar reported God’s Messenger as saying, “Enforcing one of God’s prescribed punishments is better than forty nights' rain in God’s land.\" \n\nIbn Majah transmitted it, and Nasa’i transmitted it on the authority of Abu Huraira."}},{"id":34,"idInBook":34,"chapterId":17,"bookId":14,"arabic":"عَنْ عَائِشَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا تُقطعُ يدُ السَّارِقِ إِلاَّ بربُعِ دِينَار فَصَاعِدا»","english":{"narrator":"","text":"‘A’isha reported the Prophet as saying, “A thief’s hand should be cut off only for a quarter of a dinar and upwards.”\n\n(Bukhari and Muslim)."}},{"id":35,"idInBook":35,"chapterId":17,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: قَطَعَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَ سَارِقٍ فِي مِجَنٍّ ثَمَنُهُ ثَلَاثَةُ دَرَاهِمَ","english":{"narrator":"","text":"Ibn ‘Umar said the Prophet had a thief’s hand cut off for a shield worth three dirhams. \n\n(Bukhari and Muslim.)"}},{"id":36,"idInBook":36,"chapterId":17,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَعَنَ اللَّهُ السارِقَ يسرقُ البيضةَ فتُقطعُ يَده وَيسْرق الْحَبل فتقطع يَده»","english":{"narrator":"","text":"Abu Huraira reported the Prophet as saying, “God curse a thief who steals an egg and has his hand cut off, and steals a rope and has his hand cut off!”* \n\n(Bukhari and Muslim.)\n\n*It has been suggested that baida (egg or steel helmet) should have the latter meaning and that a ship’s rope should be understood, but the translation above is usually accepted as the meaning."}},{"id":37,"idInBook":37,"chapterId":17,"bookId":14,"arabic":"عَنْ رَافِعِ بْنِ خَدِيجٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا قَطْعَ فِي ثَمَرٍ وَلَا كَثَرٍ» رَوَاهُ مَالِكٌ وَالتِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالنَّسَائِيُّ وَالدَّارِمِيُّ وَابْنُ مَاجَهْ","english":{"narrator":"","text":"Rafi‘ b. Khadij reported the Prophet as saying, “The hand is not to be cut off for taking fruit or the pith of the palm-tree.” \nMalik, Tirmidhi, Abu Dawud, Nasa'i, Darimi and Ibn Majah transmitted it."}},{"id":38,"idInBook":38,"chapterId":17,"bookId":14,"arabic":"وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ عَبْدِ اللَّهِ بْنِ عَمْرٍو بْنِ الْعَاصِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أَنَّهُ سُئِلَ عَنِ الثَّمَرِ الْمُعَلَّقِ قَالَ: «مَنْ سَرَقَ مِنْهُ شَيْئًا بَعْدَ أَنْ يُؤْوِيَهُ الْجَرِينَ فَبَلَغَ ثَمَنَ الْمِجَنِّ فَعَلَيْهِ الْقَطْعُ» . رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ","english":{"narrator":"","text":"‘Amr b. Shu'aib, on his father’s authority, said his grandfather, ‘Abdallah b. ‘Amr b. al-‘As, told that God’s Messenger was asked about fruit which was hung up and said, “If anyone steals any of it after it is put in the place where it is dried and it amounts to the price of a shield, he must have his hand cut off.” \n\nAbu Dawud and Nasa’i transmitted it."}},{"id":39,"idInBook":39,"chapterId":17,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي حُسَيْنٍ الْمَكِّيِّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا قَطْعَ فِي ثَمَرٍ معلَّقٍ وَلَا فِي حَرِيسَةِ جَبَلٍ فَإِذَا آوَاهُ الْمُرَاحُ وَالْجَرِينُ فَالْقَطْعُ قيمًا بلغ ثمن الْمِجَن» . رَوَاهُ مَالك","english":{"narrator":"","text":"‘Abdallah b. ‘Abd ar-Rahman b. Abu Husain al-Makki reported God’s Messenger as saying, “A hand is not to be cut off for fruit which is hung up, or for a sheep stolen by night from the mountain;* but when the sheep is in its fold or the fruit in the place where it is dried a hand is to be cut off for whatever reaches the price of a shield.” \n\nMalik transmitted it.\n\n* Harisa jabal. It is used either of a sheep or goat stolen before it gets back from the mountain to the fold, or of one guarded in the mountain. The most satisfactory reason for the prescription would seem to be that animals kept in the mountain are not sufficiently protected."}},{"id":40,"idInBook":40,"chapterId":17,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَيْسَ عَلَى الْمُنْتَهِبِ قَطْعٌ وَمَنِ انْتَهَبَ نُهْبَةً مَشْهُورَةً فَلَيْسَ مِنَّا» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Jabir reported God’s Messenger as saying, \"Cutting off the hand is not to be inflicted on one who plunders, but he who does so conspicuously does not belong to us.” \n\nAbu Dawud transmitted it."}},{"id":41,"idInBook":41,"chapterId":17,"bookId":14,"arabic":"وَعَنْهُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَيْسَ عَلَى خَائِنٍ وَلَا مُنْتَهِبٍ وَلَا مُخْتَلِسٍ قَطْعٌ» . رَوَاهُ التِّرْمِذِيُّ وَالنَّسَائِيُّ وَابْنُ مَاجَهْ والدارمي","english":{"narrator":"","text":"He reported the Prophet as saying, “Cutting off the hand is not to be inflicted on one who is treacherous, one who plunders, or one who snatches something.” \n\nTirmidhi, Nasa’i, Ibn Majah and Darimi transmitted it."}},{"id":42,"idInBook":42,"chapterId":17,"bookId":14,"arabic":"وَرُوِيَ فِي «شَرْحِ السُّنَّةِ» : أَنَّ صَفْوَانَ بْنَ أُمَيَّةَ قَدِمَ الْمَدِينَةَ فَنَامَ فِي الْمَسْجِدِ وَتَوَسَّدَ رِدَاءَهُ فَجَاءَ سَارِقٌ وَأَخَذَ رِدَاءَهُ فَأَخَذَهُ صَفْوَانُ فَجَاءَ بِهِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَ أَنْ تُقْطَعَ يَدُهُ فَقَالَ صَفْوَانُ: إِنِّي لَمْ أُرِدْ هَذَا هُوَ عَلَيْهِ صَدَقَةٌ. فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «فَهَلا قبل أَن تَأتِينِي بِهِ»\n\nوَرَوَى نَحْوَهُ ابْنُ مَاجَهْ عَنْ عَبْدِ اللَّهِ بن صَفْوَان عَن أَبِيه\n\nوالدارمي عَن ابْن عَبَّاس","english":{"narrator":"","text":"It is transmitted in Sharh as-sunna that Safwan b. Umayya came to Medina and slept in the mosque, using his cloak as a pillow. A thief came and took his cloak and Safwan seized him and brought him to God’s Messenger who ordered that his hand should be cut off. Safwan then said, \"This was not my intention. I give it to him as sadaqa.” God’s Messenger replied, \"Why did you not do so before bringing him to me?” \n\nIbn Majah transmitted something similar on the authority of ‘Abdallah b. Safwan who quoted his father’s authority, and Darimi did so also on the authority of Ibn ‘Abbas."}},{"id":43,"idInBook":43,"chapterId":17,"bookId":14,"arabic":"وَعَنْ بُسْرِ بْنِ أَرْطَاةَ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَا تُقْطَعُ الْأَيْدِي فِي الْغَزْوِ» . رَوَاهُ التِّرْمِذِيُّ وَالدَّارِمِيُّ وَأَبُو دَاوُدَ وَالنَّسَائِيُّ إِلَّا أَنَّهُمَا قَالَا: «فِي السّفر» بدل «الْغَزْو»","english":{"narrator":"","text":"Busr b. Artat told that he heard God’s Messenger say, \"Hands are not to be cut off during a warlike expedition.”\n \nTirmidhi, Darimi, Abu Dawud and Nasa’i transmitted it, but the last two have \"journey” in place of \"warlike expedition.”"}},{"id":44,"idInBook":44,"chapterId":17,"bookId":14,"arabic":"وَعَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم قَالَ فِي السَّارِقِ: «إِنْ سَرَقَ فَاقْطَعُوا يَدَهُ ثُمَّ إِنْ سَرَقَ فَاقْطَعُوا رِجْلَهُ ثُمَّ إِنْ سَرَقَ فَاقْطَعُوا يَدَهُ ثُمَّ إِنْ سَرَقَ فَاقْطَعُوا رِجْلَهُ» . رَوَاهُ فِي شرح السّنة","english":{"narrator":"","text":"Abu Salama quoted Abu Huraira’s authority to the effect that God’s Messenger said regarding a thief, \"If he steals cut off his hand, if he steals again cut off his foot, if he steals again cut off his hand, and if he steals again cut off his foot.” \n\nIt is transmitted in Sharh as-sunna."}},{"id":45,"idInBook":45,"chapterId":17,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: جِيءَ بِسَارِقٍ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «اقْطَعُوهُ» فَقُطِعَ ثُمَّ جِيءَ بِهِ الثَّانِيَةَ فَقَالَ: «اقْطَعُوهُ» فَقُطِعَ ثُمَّ جِيءَ بِهِ الثَّالِثَةَ فَقَالَ: «اقْطَعُوهُ» فَقُطِعَ ثُمَّ جِيءَ بِهِ الرَّابِعَةَ فَقَالَ: «اقْطَعُوهُ» فَقُطِعَ فَأُتِيَ بِهِ الْخَامِسَةَ فَقَالَ: «اقْتُلُوهُ» فَانْطَلَقْنَا بِهِ فَقَتَلْنَاهُ ثُمَّ اجْتَرَرْنَاهُ فَأَلْقَيْنَاهُ فِي بِئْرٍ وَرَمَيْنَا عَلَيْهِ الحجارةَ. رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ\nوَرُوِيَ فِي شَرْحِ السُّنَّةِ فِي قَطْعِ السَّارِقِ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «اقْطَعُوهُ ثمَّ احسموه»","english":{"narrator":"","text":"Jabir told that a thief was brought to the Prophet and he said, \"Maim him,* so this was done. He was brought a second time and he said, \"Maim him,” so this was done. He was brought a third time and he said, \"Maim him,” so this was done. He was brought a fourth time and he said, \"Maim him,” so this was done. He was brought a fifth time and he said, \"Kill him,” so they took him away and killed him. They then dragged him and cast him into a well and threw stones over him. \n\nAbu Dawud and Nasa’i transmitted it. In Sharh as-sunna the Prophet is reported as saying regarding the maiming of a thief, \"Maim him, then cauterise him.\"\n\n* Where there has been one offence I have translated 'cut off the hand’, but here, where the verb 'to cut off’ is used without an object, I have found it more convenient to use a general word. In the previous tradition the hands and feet were mentioned in the Arabic."}},{"id":46,"idInBook":46,"chapterId":17,"bookId":14,"arabic":"وَعَنْ فَضَالَةَ بْنِ عُبَيْدٍ قَالَ: أَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بسارقٍ فقُطِعَتْ يَدَهُ ثُمَّ أَمَرَ بِهَا فَعُلِّقَتْ فِي عُنُقِهِ. رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالنَّسَائِيُّ وَابْنُ مَاجَهْ","english":{"narrator":"","text":"Fadala b. 'Ubaid said a thief was brought to God’s Messenger, and when his hand was cut off he gave command that it should be hung on his neck. \n\nTirmidhi, Aba Dawud, Nasa’i and Ibn Majah transmitted it."}},{"id":47,"idInBook":47,"chapterId":17,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا سَرَقَ الْمَمْلُوكُ فَبِعْهُ وَلَوْ بِنَشٍّ» . رَوَاهُ أَبُو دَاوُدَ وَالنَّسَائِيُّ وَابْن مَاجَه","english":{"narrator":"","text":"Abu Huraira reported God’s Messenger as saying, \"When, a slave steals sell him, even though it be for half an uqiyah.”* \n\nAbu Dawud, Nasa’i and Ibn Majah transmitted it.\n\n* Nashsh, This is half an uqiya, or twenty dirhams."}},{"id":48,"idInBook":48,"chapterId":17,"bookId":14,"arabic":"عَنْ عَائِشَةَ قَالَتْ: أَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِسَارِقٍ فَقَطَعَهُ فَقَالُوا: مَا كُنَّا نَرَاكَ تَبْلُغُ بِهِ هَذَا قَالَ: «لَوْ كانتْ فاطمةُ لقطعتَها» . رَوَاهُ النَّسَائِيّ","english":{"narrator":"","text":"‘A’isha told that when a thief was brought to God’s Messenger and he had his hand cut off, those who brought him said, \"We did not think you would go so far as this with him.” He replied, \"If Fatima had been the one, I would have had her hand cut off.” \n\nNasa’i transmitted it."}},{"id":49,"idInBook":49,"chapterId":17,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: جَاءَ رَجُلٌ إِلَى عُمَرَ بِغُلَامٍ لَهُ فَقَالَ: اقْطَعْ يَدَهُ فَإِنَّهُ سرقَ مرآةَ لأمرأتي فَقَالَ عمَرُ رَضِي اللَّهُ عَنهُ: لَا قَطْعَ عَلَيْهِ وَهُوَ خَادِمُكُمْ أَخَذَ مَتَاعَكُمْ. رَوَاهُ مَالك","english":{"narrator":"","text":"Ibn 'Umar told that a man brought a slave of his to 'Umar and said, \"Cut off his hand, for he has stolen a mirror belonging to my wife.” 'Umar replied, \"Cutting off the hand may not be inflicted on him. It is your servant who has taken your belongings.” \n\nMalik transmitted it."}},{"id":50,"idInBook":50,"chapterId":17,"bookId":14,"arabic":"وَعَنْ أَبِي ذَرٍّ قَالَ: قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَا أَبَا ذَرٍّ» قُلْتُ: لَبَّيْكَ يَا رَسُولَ اللَّهِ وَسَعْدَيْكَ قَالَ: «كَيْفَ أَنْتَ إِذَا أَصَابَ النَّاسَ مَوْتٌ يَكُونُ الْبَيْتُ فِيهِ بِالْوَصِيفِ» يَعْنِي الْقَبْرَ قُلْتُ: اللَّهُ وَرَسُولُهُ أَعْلَمُ. قَالَ: «عَلَيْكَ بِالصَّبْرِ» قَالَ حمَّادُ بنُ أبي سُليمانَ: تُقْطَعُ يَدُ النَّبَّاشِ لِأَنَّهُ دَخَلَ عَلَى الْمَيْتِ بيتَه. رَوَاهُ أَبُو دَاوُدَ","english":{"narrator":"","text":"Abu Dharr told that God’s Messenger addressed him by name and he replied, \"At your service and at your pleasure, Messenger of God.” He said, \"How will you do when death 1 smites people and a house, meaning a grave, will cost as much as a slave?” On his replying that God and His apostle knew best, he said, \"Show endurance.” Hammad b.  Sulaiman said that the hand of one who rifles a grave 2 should be cut off because he had entered the deceased’s house. \n\nAbu Dawud transmitted it.\n\n1. Here \"death” is used as a figure for a severe pestilence.\n2. Mirqat, iv, 59, say this is done to steal the shroud."}},{"id":51,"idInBook":51,"chapterId":17,"bookId":14,"arabic":"عَن عائشةَ رَضِي الله عَنْهَا أَنَّ قُرَيْشًا أَهَمَّهُمْ شَأْنُ الْمَرْأَةِ الْمَخْزُومِيَّةِ الَّتِي سَرَقَتْ فَقَالُوا: مَنْ يُكَلِّمُ فِيهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ؟ فَقَالُوا: وَمَنْ يَجْتَرِئُ عَلَيْهِ إِلَّا أُسَامَةُ بْنُ زَيْدٍ حِبُّ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَلَّمَهُ أُسَامَةُ. فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَتَشْفَعُ فِي حَدٍّ مِنْ حُدُودِ اللَّهِ؟» ثُمَّ قَامَ فَاخْتَطَبَ ثُمَّ قَالَ: «إِنَّمَا أَهْلَكَ الَّذِينَ قَبْلَكُمْ أَنَّهُمْ كَانُوا إِذَا سَرَقَ فِيهِمُ الشَّرِيفُ تَرَكُوهُ وَإِذَا سَرَقَ فِيهِمُ الضَّعِيفُ أَقَامُوا عَلَيْهِ الْحَدَّ وَايْمُ اللَّهِ لَوْ أَنَّ فَاطِمَةَ بِنْتَ مُحَمَّدٍ سَرَقَتْ لَقَطَعْتُ يَدَهَا» . مُتَّفَقٌ عَلَيْهِ. وَفِي روايةٍ لمسلمٍ: قالتْ: كانتِ امرأةٌ مخزوميَّةٌ تَسْتَعِيرُ الْمَتَاعَ وَتَجْحَدُهُ فَأَمَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقَطْعِ يَدِهَا فَأَتَى أَهْلُهَا أُسَامَةَ فَكَلَّمُوهُ فَكَلَّمَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقَطْعِ يَدِهَا فَأَتَى أَهْلُهَا أُسَامَةَ فَكَلَّمُوهُ فَكَلَّمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيهَا ثمَّ ذكرَ الحديثَ بنحوِ مَا تقدَّمَ","english":{"narrator":"","text":"‘A'isha said Quraish were anxious about the Makhzumi woman who had committed theft and asked, “Who will speak to God’s Messenger about her?” Then they said, “Who will be bold enough for it but Usama b. Zaid, God’s Messenger’s friend?” So Usama spoke to him and God’s Messenger said, “Are you interceding regarding one of the punishments prescribed by God?” He then got up and gave an address, saying, “What destroyed your predecessors was just that when a person of rank among them committed a theft they left him alone, but when a weak one of their number committed a theft they inflicted the prescribed punishment on him. I swear by God that if Fatima daughter of Muhammad should steal I would have her hand cut off.” \n\n(Bukhari and Muslim). In a version by Muslim she said that a Makhzumi woman used to borrow goods and deny having received them, so the Prophet gave orders that her hand should be cut off. Her family went and spoke to Usama and he spoke about her to God's Messenger. Then he mentioned the tradition in similar form to what has preceded."}},{"id":52,"idInBook":52,"chapterId":17,"bookId":14,"arabic":"عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم يَقُول: «مَنْ حَالَتْ شَفَاعَتُهُ دُونَ حَدٍّ مِنْ حُدُودِ اللَّهِ فَقَدَ ضَادَّ اللَّهَ وَمَنْ خَاصَمَ فِي بَاطِلٍ وَهُوَ يَعْلَمُهُ لَمْ يَزَلْ فِي سُخْطِ اله تَعَالَى حَتَّى يَنْزِعَ وَمَنْ قَالَ فِي مُؤْمِنٍ مَا لَيْسَ فِيهِ أَسْكَنَهُ اللَّهُ رَدْغَةَ الْخَبَالِ حَتَّى يَخْرُجَ مِمَّا قَالَ» . رَوَاهُ أَحْمَدُ وَأَبُو دَاوُد وَفِي روايةٍ للبيهقيِّ فِي شعبِ الْإِيمَان «مَنْ أَعانَ على خُصُومَةً لَا يَدْرِي أَحَقٌّ أَمْ بَاطِلٌ فَهُوَ فِي سَخطِ اللَّهِ حَتَّى ينْزع»","english":{"narrator":"","text":"‘Abdallah b. ‘Umar told that he heard God’s Messenger say, “If anyone’s intercession intervenes as an obstacle to one of the punishments prescribed by God he has opposed God; if anyone disputes knowingly about something which is false he remains in the displeasure of God most high till he desists; and if anyone makes an untruthful accusation against a Muslim he will be made by God to dwell in the corrupt fluid flowing from the inhabitants of hell* till he retracts his statement.”\n\nAhmad and Abu Dawud transmitted it. \n\n* Radghat al-khabal.\n\nIn a version by Baihaqi in Shu'ab al-iman it says, “He who assists in a dispute, not knowing whether it is true or false, will remain in God’s displeasure till he desists.”\n\nBaihaqi in Shu'ab al-iman"}},{"id":53,"idInBook":53,"chapterId":17,"bookId":14,"arabic":"وَعَنْ أَبِي أُمَيَّةَ الْمَخْزُومِيِّ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَى بِلِصٍّ قَدِ اعْتَرَفَ اعْتِرَافًا وَلَمْ يُوجَدْ مَعَهُ مَتَاعٌ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا أَخَالُكَ سَرَقْتَ» . قَالَ: بَلَى فَأَعَادَ عَلَيْهِ مَرَّتَيْنِ أَوْ ثَلَاثًا كُلَّ ذَلِكَ يَعْتَرِفُ فَأَمَرَ بِهِ فَقُطِعَ وَجِيءَ بِهِ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «اسْتَغْفِرِ اللَّهَ وَتُبْ إِلَيْهِ» فَقَالَ: أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «اللَّهُمَّ تُبْ عليهِ» ثَلَاثًا. رَوَاهُ أَبُو دَاوُدَ وَالنَّسَائِيُّ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ هَكَذَا وجدتُ فِي الْأُصُول الْأَرْبَعَة وجامع الْأُصُول وَشُعَبُ الْإِيمَانِ وَمَعَالِمُ السُّنَنِ عَنْ أَبِي أُمَيَّةَ","english":{"narrator":"","text":"Abu Umayya al-Makhzumi told that a robber who had made acknowledgment was brought to the Prophet, but no goods were found with him. God’s Messenger said to him, “I do not think you have stolen.” He replied that he had and repeated it to him twice or thrice, making acknowledgment all the time, so he gave orders and his hand was cut off. He was then brought to him and God’s Messenger said to him, “Ask God’s pardon and turn to Him in repentance.” He said, “I ask God’s pardon and turn to Him in repentance.” God's Messenger then said three times, “O God, forgive him.” \n\nAbu Dawud, Nasa’i, Ibn Majah and Darimi transmitted it. Thus did I find it in the four texts quoted, in Jami' al-usul, Shu'ab al-iman, and Ma'alim as-sunan on the authority of Abu Umayya, but in the texts of al-Masabih it is given on the authority of Abu Rimtha.*\n\n\n*This is the kind of misunderstanding which can easily arise owing to the similarity of امیۃ and رمثۃ if not carefully written."}},{"id":54,"idInBook":54,"chapterId":17,"bookId":14,"arabic":"عَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ضَرَبَ فِي الْخَمْرِ بِالْجَرِيدِ والنِّعالِ وجلَدَ أَبُو بكرٍ رَضِي الله عَنهُ أربعينَ\nوَفِي رِوَايَة عَنْهُ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَضْرِبُ فِي الْخَمْرِ بِالنِّعَالِ وَالْجَرِيدِ أَرْبَعِينَ","english":{"narrator":"","text":"Anas told that the Prophet gave a beating with palm branches and sandals for drinking wine and that Abu Bakr gave forty lashes. \n\n(Bukhari and Muslim.) In a version on his authority it says that the Prophet used to give forty stripes with palm branches and sandals for drinking wine."}},{"id":55,"idInBook":55,"chapterId":17,"bookId":14,"arabic":"وَعَنِ السَّائِبِ بْنِ يَزِيدَ قَالَ: كَانَ يُؤْتَى بِالشَّارِبِ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَإِمْرَةِ أَبِي بَكْرٍ وَصَدْرًا مِنْ خِلَافَةِ عُمَرَ فَنَقُومُ عَلَيْهِ بِأَيْدِينَا وَنِعَالِنَا وَأَرْدِيَتِنَا حَتَّى كَانَ آخِرُ إِمْرَةِ عُمَرَ فَجَلَدَ أَرْبَعِينَ حَتَّى إِذَا عَتَوْا وَفَسَقُوا جَلَدَ ثَمَانِينَ. رَوَاهُ البُخَارِيّ","english":{"narrator":"As-Sa’ib b. Yazid said:","text":"When a drinker was brought in the time of God’s Messenger, during Abu Bakr’s Caliphate and in the beginning of ‘Umar’s Caliphate, we beat him with our hands, sandals and cloaks, but at the end of ‘Umar’s Caliphate he inflicted forty stripes, and when people were immoderate and excessively wicked he inflicted eighty stripes. \n\nBukhari transmitted it."}},{"id":56,"idInBook":56,"chapterId":17,"bookId":14,"arabic":"عَنْ جَابِرٌ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ شَرِبَ الْخَمْرَ فَاجْلِدُوهُ فَإِنْ عَادَ فِي الرَّابِعَةِ فَاقْتُلُوهُ» قَالَ: ثُمَّ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْدَ ذَلِكَ بِرَجُلٍ قَدْ شَرِبَ فِي الرَّابِعَةِ فَضَرَبَهُ وَلَمْ يقْتله. رَوَاهُ التِّرْمِذِيّ\nوَرَوَاهُ أَبُو دَاوُد عَن قبيصَة بن دؤيب\nوَفِي أُخْرَى لَهُمَا وَلِلنَّسَائِيِّ وَابْنِ مَاجَهْ وَالدَّارِمِيِّ عَنْ نَفَرٍ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْهُمُ ابْنُ عُمَرَ وَمُعَاوِيَةُ وَأَبُو هُرَيْرَة والشريد إِلَى قَوْله: «فَاقْتُلُوهُ»","english":{"narrator":"","text":"Jabir reported the Prophet as saying, “Beat anyone who drinks wine, and if he does it a fourth time kill him.” He said that after that a man who had drunk wine four times was brought to the Prophet and he beat him, but did not kill him. \n\nTirmidhi transmitted it, and Abu Dawud transmitted it on the authority of Qablsa b. Dhu’aib. Another version by both of them and by Nasa’i, Ibn Majah and Darimi on the authority of some of the companions of God’s Messenger, including Ibn ‘Umar, Mu'awiya, Abu Huraira and ash-Sharid, stops at “kill him.”*\n\n* This means that they gave only the Prophet’s words, and did not say anything about the man who was not killed."}},{"id":57,"idInBook":57,"chapterId":17,"bookId":14,"arabic":"وَعَنْ عَبْدِ الرَّحْمَنِ بْنِ الْأَزْهَرِ قَالَ: كَأَنِّي أَنْظُرُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذْ أُتِيَ بِرَجُلٍ قَدْ شَرِبَ الْخَمْرَ فَقَالَ لِلنَّاسِ: «اضْرِبُوهُ» فَمِنْهُمْ مَنْ ضَرَبَهُ بِالنِّعَالِ وَمِنْهُمْ مَنْ ضَرَبَهُ بِالْعَصَا وَمِنْهُمْ مَنْ ضَرَبَهُ بِالْمِيتَخَةِ. قَالَ ابْنُ وَهْبٍ: يَعْنِي الْجَرِيدَةَ الرَّطْبَةَ ثُمَّ أَخَذَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تُرَابًا مِنَ الْأَرْضِ فَرَمَى بِهِ فِي وجهِه. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"‘Abd ar-Rahman b. al-Azhar said:","text":"I can still picture myself looking at God’s Messenger when a man who had drunk wine was brought before him and he told the people to beat him. Some struck him with sandals, some with sticks and some with mitakhas. Ibn Wahb said this means green palm fronds. Then God’s Messenger took some dust from the ground and threw it in his face. \n\nAbu Dawud transmitted it."}},{"id":58,"idInBook":58,"chapterId":17,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُتِيَ بِرَجُلٍ قَدْ شربَ الخمرَ فَقَالَ: «اضْرِبُوهُ» فَمِنَّا الضَّارِبُ بِيَدِهِ وَالضَّارِبُ بِثَوْبِهِ وَالضَّارِبُ بِنَعْلِهِ ثُمَّ قَالَ: «بَكِّتُوهُ» فَأَقْبَلُوا عَلَيْهِ يَقُولُونَ: مَا اتَّقَيْتَ اللَّهَ مَا خَشِيتَ اللَّهَ وَمَا اسْتَحْيَيْتَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ بَعْضُ الْقَوْمِ: أَخْزَاكَ اللَّهُ. قَالَ: \n\" لَا تَقُولُوا هَكَذَا لَا تُعِينُوا عَلَيْهِ الشَّيْطَانَ وَلَكِنْ قُولُوا: اللَّهُمَّ اغْفِرْ لَهُ اللَّهُمَّ ارْحَمْهُ \". رَوَاهُ أَبُو دَاوُد","english":{"narrator":"Abu Huraira said:","text":"When a man who had drunk wine was brought to God’s Messenger he told us to beat him, and some struck him with their hands, some with their garments and some with their sandals. He then told them to reproach him, and they faced him and said, “You have not respected God, you have not feared God, and you have not shown shame before God’s Messenger.” But when some of the people said, “God put you to shame!” he told them not to say that and help the devil to get power over him, but to say, “O God, forgive him. O God show mercy to him.” \n\nAbu Dawud transmitted it."}},{"id":59,"idInBook":59,"chapterId":17,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: شَرِبَ رَجُلٌ فَسَكِرَ فَلُقِيَ يَمِيلُ فِي الْفَجِّ فَانْطُلِقَ بِهِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا حَاذَى دَارَ الْعَبَّاسِ انْفَلَتَ فَدَخَلَ عَلَى الْعَبَّاسِ فَالْتَزَمَهُ فَذَكَرَ ذَلِكَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فضحكَ وَقَالَ: «أفعَلَها؟» وَلم يأمرْ فيهِ بشيءٍ. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Ibn ‘Abbas told that a man who had drunk and become intoxicated was found staggering in the road, so he was taken to God’s Messenger, but when he was opposite al-‘Abbas’s house he escaped, and going in to al-‘Abbas he grasped hold of him. When the Prophet was told that he laughed and said, “Did he do that?” and he gave no command regarding him. \n\nAbu Dawud transmitted it."}},{"id":60,"idInBook":60,"chapterId":17,"bookId":14,"arabic":"عَن عُمَيْر بن سعيد النخفي قَالَ: سَمِعْتُ عَلِيَّ بْنَ أَبِي طَالِبٍ يَقُولُ: مَا كُنْتُ لِأُقِيمَ عَلَى أَحَدٍ حَدًّا فَيَمُوتَ فَأَجِدَ فِي نَفْسِي مِنْهُ شَيْئًا إِلَّا صَاحِبَ الْخَمْرِ فَإِنَّهُ لَوْ مَاتَ وَدَيْتُهُ وَذَلِكَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يسنه","english":{"narrator":"","text":"‘Umair b. Sa'id an-Nakha‘i told that he heard ‘Ali b. Abu Talib say, “I am not one to have any feelings about a man who dies when I inflict a prescribed punishment on him, with the exception of one who has drunk wine, for if he were to die I would pay blood wit for him. Thai is because God’s Messenger did not lay down any specific custom regarding him.” \n\n(Bukhari and Muslim.)"}},{"id":61,"idInBook":61,"chapterId":17,"bookId":14,"arabic":"وَعَنْ ثَوْرِ بْنِ زَيْدٍ الدَّيْلِمِيِّ قَالَ: إِنَّ عُمَرَ اسْتَشَارَ فِي حَدِّ الْخَمْرِ فَقَالَ لَهُ عَلِيٌّ: أَرَى أَنْ تَجْلِدَهُ ثَمَانِينَ جَلْدَةً فَإِنَّهُ إِذَا شَرِبَ سَكِرَ وَإِذَا سَكِرَ هَذَى وَإِذَا هذَى افْتَرى فجلدَ عمرُ رَضِي الله عَنهُ فِي حَدِّ الْخَمْرِ ثَمَانِينَ. رَوَاهُ مَالِكٌ","english":{"narrator":"","text":"Thaur b. Zaid ad-Dailami told that ‘Umar sought counsel about the prescribed punishment for drinking wine and ‘Ali said to him, “I think you should give one who drinks it eighty lashes, for when he drinks he becomes intoxicated, when he is intoxicated he raves, and when he raves he makes up lies.” So ‘Umar inflicted eighty lashes as the punishment prescribed for drinking wine. \n\nMalik transmitted it."}},{"id":62,"idInBook":62,"chapterId":17,"bookId":14,"arabic":"عَنْ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ أنَّ رجلا اسمُه عبدُ اللَّهِ يُلَقَّبُ حمارا كَانَ يُضْحِكُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ جَلَدَهُ فِي الشَّرَابِ فَأُتِيَ بِهِ يَوْمًا فَأَمَرَ بِهِ فَجُلِدَ فَقَالَ رَجُلٌ مِنَ الْقَوْمِ: اللَّهُمَّ الْعَنْهُ مَا أَكْثَرَ مَا يُؤْتَى بِهِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تلعنوه فو الله مَا عَلِمْتُ أَنَّهُ يُحِبُّ اللَّهَ وَرَسُولَهُ» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"‘Umar b. al-Khattab told that a man called ‘Abdallah whose laqab was Ass used to make the Prophet laugh. The Prophet had beaten him because of wine-drinking, but when he was brought to him one day and he gave orders and had him beaten, and then one of those present said, “O God, curse him. How often he is brought!” he said, “Do not curse to him. I swear by God that for all I know he loves God and His messenger.\" \n\nBukhari transmitted it."}},{"id":63,"idInBook":63,"chapterId":17,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: أَتَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِرَجُلٍ قَدْ شَرِبَ الْخَمْرَ فَقَالَ: «اضْرِبُوهُ» فَمِنَّا الضَّارِبُ بِيَدِهِ وَالضَّارِبُ بِنَعْلِهِ وَالضَّارِبُ بِثَوْبِهِ فَلَمَّا انْصَرَفَ قَالَ بَعْضُ الْقَوْمِ: أَخْزَاكَ اللَّهُ قَالَ: «لَا تَقُولُوا هَكَذَا لَا تُعِينُوا عَلَيْهِ الشَّيْطَانَ» . رَوَاهُ الْبُخَارِيُّ","english":{"narrator":"Abu Huraira said:","text":"When a man who had been drinking was brought to the Prophet he told those present to beat him, so some of us beat him with their hands, some with their sandals and some with their garments. Then when the man went away and one of those present said, “God shame you!’' the Prophet said, “Do not say such a thing. Do not help the devil to get power over him.” \n\nBukhari transmitted it."}},{"id":64,"idInBook":64,"chapterId":17,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ قَالَ: جَاءَ الْأَسْلَمِيُّ إِلَى نَبِيِّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَشَهِدَ عَلَى نَفْسِهِ أَنَّهُ أَصَابَ امْرَأَةً حَرَامًا أَرْبَعَ مَرَّاتٍ كُلَّ ذَلِكَ يُعْرِضُ عَنْهُ فَأَقْبَلَ فِي الْخَامِسَةِ فَقَالَ: «أَنِكْتَهَا؟» قَالَ: نَعَمْ قَالَ: «حَتَّى غَابَ ذَلِكَ مِنْكَ فِي ذَلِكَ مِنْهَا» قَالَ: نَعَمْ قَالَ: «كَمَا يَغِيبُ الْمِرْوَدُ فِي الْمُكْحُلَةِ وَالرِّشَاءُ فِي الْبِئْرِ؟» قَالَ: نَعَمْ قَالَ: «هَلْ تَدْرِي مَا الزِّنَا؟» قَالَ: نَعَمْ أَتَيْتُ مِنْهَا حَرَامًا مَا يَأْتِي الرَّجُلُ مِنْ أَهْلِهِ حَلَالًا قَالَ: «فَمَا تُرِيدُ بِهَذَا الْقَوْلِ؟» قَالَ: أُرِيدُ أَنْ تُطَهِّرَنِي فَأَمَرَ بِهِ فَرُجِمَ فَسَمِعَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلَيْنِ مِنْ أَصْحَابِهِ يَقُولُ أَحَدُهُمَا لِصَاحِبِهِ: انْظُرْ إِلَى هَذَا الَّذِي سَتَرَ اللَّهُ عَلَيْهِ فَلَمْ تَدَعْهُ نَفْسُهُ حَتَّى رُجِمَ رَجْمَ الْكَلْبِ فَسَكَتَ عَنْهُمَا ثُمَّ سَارَ سَاعَةً حَتَّى مَرَّ بِجِيفَةِ حِمَارٍ شَائِلٍ برجلِهِ فَقَالَ: «أينَ فلانٌ وفلانٌ؟» فَقَالَا: نَحْنُ ذَانِ يَا رَسُولَ اللَّهِ فَقَالَ: «انْزِلَا فَكُلَا مِنْ جِيفَةِ هَذَا الْحِمَارِ» فَقَالَا: يَا نَبِيَّ اللَّهِ مَنْ يَأْكُلُ مِنْ هَذَا؟ قَالَ: «فَمَا نِلْتُمَا مِنْ عَرْضِ أَخِيكُمَا آنِفًا أَشَدُّ مِنْ أَكْلٍ مِنْهُ وَالَّذِي نَفْسِي بِيَدِهِ إِنَّهُ الْآنَ لَفِي أنهارِ الجنَّةِ ينغمسُ فِيهَا» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Abu Huraira told that al-Aslami (i.e. Ma’iz. See p. 759) came to the Prophet and testified four times that he had had illicit intercourse with a woman, while he all the time was turning away from him. Then when he confessed a fifth time he turned round and asked if he had had intercourse with her, and when he replied that he had he asked if he had done it so that his member penetrated hers. He replied that he had, and he asked whether he had done it like a collyrium stick when enclosed in its case and a rope in a well. On his replying that it was so, he asked whether he knew what fornication was and he replied, “Yes, I have done with her unlawfully what a man may lawfully do with his wife.” He then asked what he wanted by what he had said and he replied that he wanted him to purify him, so he gave command and he was stoned to death. Then God’s prophet heard one of his companions saying to another, “Look at this man whose fault was concealed by God but who could not leave the matter alone, so that he was stoned like a dog.\" He said nothing to them but walked on for a time till he came to the corpse of an ass with its legs in the air. He then asked where so and so and so and so were, and when they replied that they were there he said, “Go down and eat some of this ass’s corpse.” They replied, “Prophet of God, who can eat any of this?” whereupon he said, “The dishonour you have just shown to your brother is more serious than eating some of it. By Him in whose hand my soul is, he is now among the rivers of paradise plunging into them.” \n\nAbu Dawud transmitted it."}},{"id":65,"idInBook":65,"chapterId":17,"bookId":14,"arabic":"وَعَنْ خُزَيْمَةَ بْنِ ثَابِتٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَصَابَ ذَنْبًا أُقِيمَ عَلَيْهِ حَدُّ ذَلِكَ الذَّنْبِ فَهُوَ كفارتُه» رَوَاهُ فِي شرح السّنة","english":{"narrator":"","text":"Khuzaima b. Thabit reported God's Messenger as saying, “If anyone commits a sin and has inflicted on him the prescribed punishment for that sin, it is an atonement for him.” \n\nIt is transmitted in Sharh as-sunna."}},{"id":66,"idInBook":66,"chapterId":17,"bookId":14,"arabic":"وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ أَصَابَ حَدًّا فَعُجِّلَ عُقُوبَتَهُ فِي الدُّنْيَا فَاللَّهُ أَعْدَلُ مِنْ أَنْ يُثَنِّيَ عَلَى عَبْدِهِ الْعُقُوبَةَ فِي الْآخِرَة وَمن أصَاب حد فستره اللَّهُ عليهِ وَعَفَا عَنْهُ فَاللَّهُ أَكْرَمُ مِنْ أَنْ يَعُودَ فِي شَيْءٍ قَدْ عَفَا عَنْهُ» . رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ غَرِيبٌ\nهَذَا الْبَاب خَال عَن الْفَصْل الثَّالِث","english":{"narrator":"","text":"‘Ali reported the Prophet as saying, “If anyone transgresses and receives his punishment in this world, God is too just to repeat the punishment to His servant in the next; and if anyone transgresses and God conceals it and forgives him, He is too generous to go back upon a thing He has forgiven.” \n\nTirmidhi and Ibn Majah transmitted it, Tirmidhi saying this is a gharib tradition."}},{"id":67,"idInBook":67,"chapterId":17,"bookId":14,"arabic":"عَن أبي بردة بن ينار عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يُجْلَدُ فَوْقَ عَشْرِ جَلَدَاتٍ إِلَّا فِي حد من حُدُود الله»","english":{"narrator":"","text":"Abu Burda b. Niyar reported the Prophet as saying, “No more than ten lashes are to be given, except in the case of one of the punishments prescribed by God.” \n\n(Bukhari and Muslim.)"}},{"id":68,"idInBook":68,"chapterId":17,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا ضَرَبَ أَحَدُكُمْ فَلْيَتَّقِ الوجهَ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Abu Huraira reported the Prophet as saying, “When one of you inflicts a beating he should avoid striking the face.”\n\nAbu Dawud transmitted it."}},{"id":69,"idInBook":69,"chapterId":17,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" إِذَا قَالَ الرَّجُلُ لِلرَّجُلِ: يَا يَهُودِيُّ فَاضْرِبُوهُ عِشْرِينَ وَإِذَا قَالَ: يَا مُخَنَّثُ فَاضْرِبُوهُ عِشْرِينَ وَمَنْ وَقَعَ عَلَى ذَاتِ مَحْرَمٍ فَاقْتُلُوهُ \". رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ غَرِيب","english":{"narrator":"","text":"Ibn ‘Abbas reported the Prophet as saying, “When a man calls another a Jew give him twenty lashes, when he calls someone a mukhannath* give him twenty lashes, and kill anyone who has intercourse with a woman who is within the prohibited degress.” \n\nTirmidhi transmitted it, saying this is a gharib tradition.\n\n* Mukhannaths were sexually abnormal men who imitated women. Some of them were signets."}},{"id":70,"idInBook":70,"chapterId":17,"bookId":14,"arabic":"وَعَنْ عُمَرَ رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا وَجَدْتُمُ الرَّجُلَ قَدْ غَلَّ فِي سَبِيلِ اللَّهِ فَاحْرُقُوا مَتَاعَهُ وَاضْرِبُوهُ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيث غَرِيب\nهَذَا الْبَاب خَال من الْفَصْل الثَّالِث","english":{"narrator":"","text":"‘Umar reported God’s Messenger as saying, “When you find a man has been unfaithful about spoil in God’s path, burn his goods and beat him.” \n\nTirmidhi and Abu Dawud transmitted it, Tirmidhi saying this is a gharib tradition."}},{"id":71,"idInBook":71,"chapterId":17,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" الْخَمْرُ مِنْ هَاتَيْنِ الشَّجرتينِ: النخلةِ والعِنَبَةِ \". رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Huraira reported God’s Messenger as saying, “Wine comes from these two trees, the date-palm and the grapevine.” \n\nMuslim transmitted it."}},{"id":72,"idInBook":72,"chapterId":17,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: خطَبَ عمرُ رَضِي الله عَنهُ عَلَى مِنْبَرَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: \n\" إِنَّهُ قَدْ نَزَلَ تَحْرِيمُ الْخَمْرِ وَهِيَ مِنْ خَمْسَةِ أَشْيَاءَ: الْعِنَبِ وَالتَّمْرِ وَالْحِنْطَةِ والشعيرِ والعسلِ وَالْخمر مَا خامر الْعقل \". رَوَاهُ البُخَارِيّ","english":{"narrator":"Ibn 'Umar told that ‘Umar gave an address on God’s Messenger’s pulpit, saying, “The prohibition of wine has come down (Al-Qur’an, 5:90) and it comes from five things:","text":"grapes, dates, wheat, barley and honey. Wine (khamr) is what infects (khamara) the mind.” \n\nBukhari transmitted it."}},{"id":73,"idInBook":73,"chapterId":17,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: لَقَدْ حُرِّمَتِ الْخَمْرُ حِينَ حُرِّمَتْ وَمَا نَجِدُ خَمْرَ الْأَعْنَابِ إِلَّا قَلِيلًا وَعَامة خمرنا الْبُسْر وَالتَّمْر. رَوَاهُ البُخَارِيّ","english":{"narrator":"Anas said:","text":"Wine was forbidden when it was forbidden (i.e. by the Qur’an), but we get only a little of the wine from grapes, most of our wine being from unripe dates and dry dates. \n\nBukhari transmitted it."}},{"id":74,"idInBook":74,"chapterId":17,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ قَالَتْ: سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ الْبِتْعِ وَهُوَ نَبِيذُ الْعَسَلِ فَقَالَ: «كُلُّ شَرَابٍ أَسْكَرَ فَهُوَ حَرَامٌ»","english":{"narrator":"","text":"'A’isha said that when God’s Messenger was asked about bit’, which is the nabidh* from honey, he replied, “Every liquor which intoxicates is forbidden.” \n\n(Bukhari and Muslim.)\n\n* Nabidh is a drink made from dates, raisins, honey, wheat, barley, etc. The ingredients were steeped in water in a vessel, and provided the drink was used before fermentation took place it was lawful."}},{"id":75,"idInBook":75,"chapterId":17,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «كُلُّ مُسْكِرٍ خَمْرٌ وَكُلُّ مُسْكِرٍ حَرَامٌ وَمَنْ شَرِبَ الْخَمْرَ فِي الدُّنْيَا فَمَاتَ وَهُوَ يُدْمِنُهَا لَمْ يَتُبْ لَمْ يَشْرَبْهَا فِي الْآخِرَةِ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Ibn ‘Umar reported God’s Messenger as saying, “Every intoxicant is khamr and every intoxicant is forbidden. He who drinks wine in this world and dies when he is addicted to it, not having repented, will not drink it in the next.” \n\nMuslim transmitted it."}},{"id":76,"idInBook":76,"chapterId":17,"bookId":14,"arabic":"وَعَنْ جَابِرٍ أَنَّ رَجُلًا قَدِمَ مِنَ الْيَمَنِ فَسَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ شَرَابٍ يَشْرَبُونَهُ بِأَرْضِهِمْ مِنَ الذُّرَةِ يُقَالُ لَهُ الْمِزْرُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أوَ مُسْكِرٌ هُوَ؟» قَالَ: نَعَمْ قَالَ: «كُلُّ مُسْكِرٍ حَرَامٌ إِنَّ عَلَى اللَّهِ عَهْدًا لِمَنْ يَشْرَبُ الْمُسْكِرَ أَنْ يَسْقِيَهُ مِنْ طِينَةِ الْخَبَالِ» . قَالُوا: يَا رَسُولَ اللَّهِ وَمَا طِينَةُ الْخَبَالِ؟ قَالَ: «عَرَقُ أَهْلِ النَّارِ أَوْ عُصَارَةُ أَهْلِ النَّارِ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Jabir told of a man who came from the Yemen and asked the Prophet about a liquor made from millet called mizr which they drank in their country. The Prophet asked whether it was intoxicating and when he replied that it was, he said, “Every intoxicant is prohibited. God has made a covenant regarding those who drink intoxicants to give them some tinat al-khabal to drink.” He was asked what that was and replied that it was the sweat of the inhabitants of hell, or the discharge of the inhabitants of hell. \n\nMuslim transmitted it."}},{"id":77,"idInBook":77,"chapterId":17,"bookId":14,"arabic":"وَعَنْ أَبِي قَتَادَةَ: أَنَّ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ خَلِيطِ التَّمْرِ وَالْبُسْرِ وَعَنْ خَلِيطِ الزَّبِيبِ وَالتَّمْرِ وَعَنْ خَلِيطِ الزَّهْوِ وَالرُّطَبِ. وَقَالَ: «انْتَبِذُوا كُلَّ وَاحِدٍ عَلَى حِدَةٍ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Qatada told that the Prophet forbade mixing dried dates and unripe dates, mixing raisins and dried dates, and mixing dates beginning to take on colour and fresh dates, and told them to make nabidh from each separately. \n\nMuslim transmitted it."}},{"id":78,"idInBook":78,"chapterId":17,"bookId":14,"arabic":"وَعَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ عَنِ الْخَمْرِ يُتَّخَذُ خَلًّا؟ فَقَالَ: «لَا» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Anas told that the Prophet was asked about wine which was turned into vinegar* and forbade it. \n\nMuslim transmitted it.\n\n* This is said to have been done by putting onions or salt in it, or by placing it in the sun."}},{"id":79,"idInBook":79,"chapterId":17,"bookId":14,"arabic":"وَعَنْ وَائِلٍ الْحَضْرَمِيِّ أَنَّ طَارِقَ بْنَ سُوَيْدٍ سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْخَمْرِ فَنَهَاهُ. فَقَالَ: إِنَّمَا أَصْنَعُهَا لِلدَّوَاءِ فَقَالَ: «إِنَّهُ لَيْسَ بِدَوَاءٍ وَلَكِنَّهُ دَاءٌ» . رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"Wa’il al-Hadrami said that Tariq b. Suwaid asked the Prophet about wine and he forbade him. When he told him that he made it only as a medicine he replied, “It is not a medicine, but is a disease.” \n\nMuslim transmitted it."}},{"id":80,"idInBook":80,"chapterId":17,"bookId":14,"arabic":"عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «مَنْ شَرِبَ الْخَمْرَ لَمْ يَقْبَلِ اللَّهُ لَهُ صَلَاةَ أَرْبَعِينَ صَبَاحًا فَإِنْ تَابَ تَابَ اللَّهُ عَلَيْهِ. فَإِن عَاد لم يقبل الله لَهُ صَلَاة أَرْبَعِينَ صَبَاحًا فَإِنْ تَابَ تَابَ اللَّهُ عَلَيْهِ فَإِن عَاد لم يقبل الله لَهُ صَلَاة أَرْبَعِينَ صَبَاحًا فَإِنْ تَابَ تَابَ اللَّهُ عَلَيْهِ فَإِنْ عَادَ فِي الرَّابِعَةِ لَمْ يَقْبَلِ اللَّهُ لَهُ صَلَاة أَرْبَعِينَ صباحا فَإِن تَابَ لم يَتُبِ اللَّهُ عَلَيْهِ وَسَقَاهُ مِنْ نَهْرِ الْخَبَالِ» . رَوَاهُ التِّرْمِذِيّ\nوَرَوَاهُ النَّسَائِيُّ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ عَنْ عَبْدِ الله بن عَمْرو","english":{"narrator":"","text":"‘Abdallah b. ‘Umar reported God’s Messenger as saying, “If anyone drinks wine God will not accept prayer from him for forty days,* but if he repents God will forgive him. If he repeats the offence God will not accept prayer from him for forty days, but if he repents God will forgive him. If he again repeats the offence God will not accept prayer from him for forty days, but if he repents God will forgive him. If he repeats it a fourth time God will not accept prayer from him for forty days, and if he repents God will not forgive him,, but will give him to drink of the river of the fluid flowing from the inhabitants of hell.” \n\nTirmidhi transmitted it, and Nasa’i, Ibn Majah and Darimi transmitted it on the authority of ‘Abdallah b. ‘Amr.\n\n* Literally, 'mornings.'"}},{"id":81,"idInBook":81,"chapterId":17,"bookId":14,"arabic":"وَعَنْ جَابِرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَا أَسْكَرَ كَثِيرُهُ فَقَلِيلُهُ حَرَامٌ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ","english":{"narrator":"","text":"Jabir reported God’s Messenger as saying, “If a large amount of anything causes intoxication, a small amount of it is prohibited.” \n\nTirmidhi, Abu Dawud and Ibn Majah transmitted it."}},{"id":82,"idInBook":82,"chapterId":17,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَا أسكرَ مِنْهُ الفرْقُ فَمِلْءُ الْكَفِّ مِنْهُ حَرَامٌ» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَأَبُو دَاوُد","english":{"narrator":"","text":"‘A’isha reported God’s Messenger as saying, “If a faraq of anything causes intoxication, a handful of it is forbidden.”* \n\nAhmad, Tirmidhi and Abu Dawud transmitted it.\n\n* To drink as much as a faraq (see p. 577) would be almost impossible, so the point of the tradition is to forbid anything which might in any conceivable circumstances cause intoxication."}},{"id":83,"idInBook":83,"chapterId":17,"bookId":14,"arabic":"وَعَنِ النُّعْمَانِ بْنِ بَشِيرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ مِنْ الْحِنْطَةِ خَمْرًا وَمِنَ الشَّعِيرِ خَمْرًا وَمِنَ التَّمْرِ خَمْرًا وَمِنَ الزَّبِيبِ خَمْرًا وَمِنَ الْعَسَلِ خَمْرًا» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ غَرِيبٌ","english":{"narrator":"","text":"An-Nu‘man b. Bashir reported God’s Messenger as saying, “From wheat wine is made, from barley wine is made, from dried dates wine is made, from raisins wine is made, and from honey wine is made.” \n\nTirmidhi, Abu Dawud and Ibn Majah transmitted it, Tirmidhi saying this is a gharib tradition."}},{"id":84,"idInBook":84,"chapterId":17,"bookId":14,"arabic":"وَعَن أبي سعيدٍ الخدريِّ قَالَ: كانَ عندَنا خَمْرٌ لِيَتِيمٍ فَلَمَّا نَزَلَتِ (الْمَائِدَةُ)\nسَأَلَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْهُ وَقُلْتُ: إِنَّه ليَتيمٍ فَقَالَ: «أهْريقوهُ» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Abu Sa'id al-Khudri said he had wine belonging to an orphan, and when al-Ma'idah (Al-Qur’an, 5) came down he asked God’s Messenger about it, telling him it belonged to an orphan, but he said, “Pour it out.” \n\nTirmidhi transmitted it."}},{"id":85,"idInBook":85,"chapterId":17,"bookId":14,"arabic":"وَعَنْ أَنَسٍ عَنْ أَبِي طَلْحَةَ: أَنَّهُ قَالَ: يَا نَبِيَّ اللَّهِ إِنِّي اشْتَرَيْتُ خَمْرًا لِأَيْتَامٍ فِي حِجْرِي قَالَ: «أَهْرِقِ الْخَمْرَ وَاكْسِرِ الدِّنَانَ» . رَوَاهُ التِّرْمِذِيُّ وَضَعَّفَهُ. وَفِي رِوَايَةِ أَبِي دَاوُدَ: أَنه سَأَلَهُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أَيْتَامٍ وَرِثُوا خَمْرًا قَالَ: «أَهْرِقْهَا» . قَالَ: أَفَلَا أَجْعَلُهَا خلاًّ؟ قَالَ: «لَا»","english":{"narrator":"","text":"Anas quoted Abu Talha as saying he told God’s Prophet he had bought wine for orphans who were in his charge, and he replied, “Pour out the wine and break the wine-jars.” \n\nTirmidhi transmitted it, but declared it weak.\n\nIn Abu Dawud’s version it says he asked the Prophet about orphans who had inherited wine and he said, “Pour it out.” He asked if he might not make vinegar of it and he told him he must not.\n\nAbu Dawud"}},{"id":86,"idInBook":86,"chapterId":17,"bookId":14,"arabic":"عَنْ أُمِّ سَلَمَةَ قَالَتْ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ كُلِّ مُسْكِرٍ ومقتر. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Umm Salama told that God’s Messenger forbade every intoxicant and everything which produces languidness. \n\nAbu Dawud transmitted it."}},{"id":87,"idInBook":87,"chapterId":17,"bookId":14,"arabic":"وَعَنْ دَيْلَمٍ الْحِمْيَرِيِّ قَالَ: قُلْتُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: يَا رَسُولَ اللَّهِ إِنَّا بِأَرْضٍ بَارِدَةٍ وَنُعَالِجُ فِيهَا عَمَلًا شَدِيدًا وَإِنَّا نَتَّخِذُ شَرَابًا مِنْ هَذَا الْقَمْحِ نَتَقَوَّى بِهِ عَلَى أَعْمَالِنَا وَعَلَى بَرْدِ بِلَادِنَا قَالَ: «هَلْ يُسْكِرُ؟» قُلْتُ: نَعَمْ قَالَ: «فَاجْتَنِبُوهُ» قُلْتُ: إِنَّ النَّاسَ غَيْرُ تَارِكِيهِ قَالَ: «إِنْ لَمْ يَتْرُكُوهُ فقاتلوهم» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Dailam al-Himyari told that he said, “Messenger of God, we live in a cold land in which we do heavy work and we make a liquor from wheat to get strength from it for our work and, to stand the cold of our country.” He asked whether it was intoxicating, and when he replied that it was, he said they must avoid it. When he replied that the people would not abandon it, he said, “If they do not abandon it fight with them.” \n\nAbu Dawud transmitted it."}},{"id":88,"idInBook":88,"chapterId":17,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو: أَنَّ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْخَمْرِ وَالْمَيْسِرِ وَالْكُوبَةِ وَالْغُبَيْرَاءِ وَقَالَ: «كُلُّ مُسْكِرٍ حَرَامٌ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"‘Abdallah b. ‘Amr told that the Prophet forbade wine, maisir, the kuba and ghubaira,* saying, “Every intoxicant is prohibited.” \n\nAbd Dawud transmitted it.\n\n*This is a comprehensive tradition not exclusively dealing with intoxicants, although the Prophet’s words might suggest that it does. Maisir was a game of chance and the kuba was a kind of drum wide at the ends and narrow in the middle which was looked on with disapproval. The parts which refer to intoxicants are the wine (khamr) and the ghubaira' which was an intoxicant made by Abyssinians from millet."}},{"id":89,"idInBook":89,"chapterId":17,"bookId":14,"arabic":"وَعَنْهُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يَدْخُلُ الْجَنَّةَ عَاقٌّ وَلَا قَمَّارٌ وَلَا مَنَّانٌ وَلَا مُدْمِنُ خَمْرٍ» . رَوَاهُ الدَّارِمِيُّ وَفِي رِوَايَةٍ لَهُ: «وَلَا وَلَدَ زِنْيَةٍ» بَدَلَ «قمار»","english":{"narrator":"","text":"He reported the Prophet as saying, “An undutiful son, a gambler, one who casts up what lie has given, and one who is addicted to wine will not enter paradise.” \n\nDarimi transmitted it. A version of his has a bastard instead of a gambler."}},{"id":90,"idInBook":90,"chapterId":17,"bookId":14,"arabic":"وَعَنْ أَبِي أُمَامَةَ قَالَ: قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" إِنَّ اللَّهَ تَعَالَى بَعَثَنِي رَحْمَة للعالمينَ وهُدىً لِلْعَالِمِينَ وَأَمَرَنِي رَبِّي عَزَّ وَجَلَّ بِمَحْقِ الْمَعَازِفِ وَالْمَزَامِيرِ وَالْأَوْثَانِ وَالصُّلُبِ وَأَمْرِ الْجَاهِلِيَّةِ وَحَلَفَ رَبِّي عزَّ وجلَّ: بعِزَّتي لَا يشربُ عبدٌ منْ عَبِيدِي جرعة خَمْرٍ إِلَّا سَقَيْتُهُ مِنَ الصَّدِيدِ مِثْلَهَا وَلَا يَتْرُكُهَا مِنْ مَخَافَتِي إِلَّا سَقَيْتُهُ مِنْ حِيَاضِ الْقُدس \". رَوَاهُ أَحْمد","english":{"narrator":"","text":"Abu Umama reported the Prophet as saying, “God has sent me as a mercy to the universe and as a guidance to the universe, and my Lord who is great and glorious has commanded me to annihilate stringed instruments, wind instruments, idols, crosses and pre-Islamic customs, and my Lord who is great and glorious has sworn, ‘By my might, none of my servants will drink a mouthful of wine without my giving him a similar amount of pus to drink, but he will not abandon it through fear of me without my giving him drink from the holy tanks'.” \n\nAhmad transmitted it."}},{"id":91,"idInBook":91,"chapterId":17,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" ثَلَاثَةٌ قَدْ حَرَّمَ اللَّهُ عَلَيْهِمُ الْجَنَّةَ: مُدْمِنُ الْخَمْرِ وَالْعَاقُّ وَالدَّيُّوثُ الَّذِي يُقِرُّ فِي أَهْلِهِ الْخَبَثَ \". رَوَاهُ أَحْمَدُ وَالنَّسَائِيّ","english":{"narrator":"Ibn ‘Umar reported God's Messenger as saying, “There are three to whom God has forbidden paradise:","text":"one who is addicted to wine, an undutiful son, and a cuckold who agrees to his women-folk’s adultery.\" \n\nAhmad and Nasa'i transmitted it."}},{"id":92,"idInBook":92,"chapterId":17,"bookId":14,"arabic":"وَعَنْ أَبِي مُوسَى الْأَشْعَرِيِّ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" ثَلَاثَةٌ لَا تَدْخُلُ الجنَّةَ: مُدْمنُ الخمرِ وقاطِعُ الرَّحِم ومصدق السحر \" رَوَاهُ أَحْمد","english":{"narrator":"Abu Musa al-Ash‘ari reported the Prophet as saying, “There are three who will not enter paradise:","text":"one who is addicted to wine, one who breaks ties of relationship, and one who believes in magic.” \n\nAhmad transmitted it."}},{"id":93,"idInBook":93,"chapterId":17,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مُدْمِنُ الْخَمْرِ إِنْ مَاتَ لقيَ اللَّهَ كعابِدِ وثن» . رَوَاهُ أَحْمد\n\nوروى ابْن مَاجَه عَن أبي هُرَيْرَة\n\nوَالْبَيْهَقِيُّ فِي «شُعَبِ الْإِيمَانِ» عَنْ مُحَمَّدِ بْنِ عبيد الله عَن أَبِيه. قَالَ: ذَكَرَ الْبُخَارِيُّ فِي التَّارِيخِ عَنْ مُحَمَّدِ بْنِ عبد الله عَن أَبِيه","english":{"narrator":"","text":"Ibn ‘Abbas reported God’s Messenger as saying, “If one who is addicted to wine dies he will meet God most high in the same condition as an idolater.” \n\nAhmad transmitted it, Ibn Majah transmitted on Abu Huraira’s authority, and Baihaqi, in Shu'ab al-iman, gave it on the authority of Muhammad b. ‘Ubaidallah who quoted his father’s authority. He said that Bukhari in his Ta’rikh mentioned it on the authority of Muhammad b. ‘Abdallah who quoted his father's authority."}},{"id":94,"idInBook":94,"chapterId":17,"bookId":14,"arabic":"وَعَنْ أَبِي مُوسَى أَنَّهُ كَانَ يَقُولُ: مَا أُبالي شرِبتُ الخمرَ أَو عبدْتُ هذهِ السَّارِيةَ دونَ اللَّهِ. رَوَاهُ النَّسَائِيّ","english":{"narrator":"Abu Musa used to say:","text":"It is all the same to me whether I drink wine or worship this pillar instead of God.*\n\nNasa’i transmitted it.\n\n*He says that the one sin is as serious as the other."}}],"chapter":{"id":17,"bookId":14,"arabic":"كتاب الحدود","english":"Prescribed Punishments"}}