{"metadata":{"length":121,"arabic":{"title":"مشكاة المصابيح","author":"الإمام الكاتب التبريزي","introduction":"كتاب الإمارة والقضاء"},"english":{"title":"Mishkat al-Masabih","author":"Al-Khatib Al-Tabrizi","introduction":"The Offices of Commander and Qadi"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":18,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَطَاعَنِي فَقَدْ أَطَاعَ اللَّهَ وَمَنْ عَصَانِي فَقَدْ عَصَى اللَّهَ وَمَنْ يُطِعِ الْأَمِيرَ فَقَدْ أَطَاعَنِي وَمَنْ يَعْصِ الْأَمِيرَ فَقَدْ عَصَانِي وَإِنَّمَا الْإِمَامُ جُنَّةٌ يُقَاتَلُ مِنْ وَرَائِهِ وَيُتَّقَى بِهِ فَإِنْ أَمَرَ بِتَقْوَى اللَّهِ وَعَدَلَ فَإِنَّ لَهُ بِذَلِكَ أَجْرًا وَإِنْ قالَ بغَيرِه فَإِن عَلَيْهِ مِنْهُ»","english":{"narrator":"","text":"Abu Huraira reported God's Messenger as saying, “He who obeys me has obeyed God and he who disobeys me has disobeyed God; he who obeys the commander has obeyed me and he who disobeys the commander has disobeyed me. The imam is only a shield behind whom fighting is engaged in and by whom protection is sought; so if he commands piety and acts justly he will have a reward for that, but if he holds another view he will on that account be held guilty.” \n\n(Bukhari and Muslim.)"}},{"id":2,"idInBook":2,"chapterId":18,"bookId":14,"arabic":"وَعَنْ أُمِّ الْحُصَيْنِ قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنْ أُمِّرَ عَلَيْكُمْ عَبْدٌ مُجَدَّعٌ يَقُودُكُمْ بِكِتَابِ اللَّهِ فَاسْمَعُوا لَهُ وَأَطيعُوا» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Umm al-Husain reported God’s Messenger as saying, “If a slave who has been mutilated is made your commander and leads you in accordance with God’s Book, listen to him and obey.” \n\nMuslim transmitted it."}},{"id":3,"idInBook":3,"chapterId":18,"bookId":14,"arabic":"وَعَنْ أَنَسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «اسْمَعُوا وَأَطِيعُوا وَإِنِ اسْتُعْمِلَ عَلَيْكُمْ عَبْدٌ حَبَشِيٌّ كَأَنَّ رَأْسَهُ زَبِيبَةٌ» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Anas reported God’s Messenger as saying, “Listen and obey, even if an Abyssinian slave with a head like a raisin* is made governor over you.” \n\nBukhari transmitted it.\n\n* This is said to refer to the head being small, or to the hair being crisp and curly, or short."}},{"id":4,"idInBook":4,"chapterId":18,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «السَّمعُ والطاعةُ على المرءِ المسلمِ فِيمَا أحب وأكره مَا لَمْ يُؤْمَرْ بِمَعْصِيَةٍ فَإِذَا أُمِرَ بِمَعْصِيَةٍ فَلَا سَمْعَ وَلَا طَاعَةَ»","english":{"narrator":"","text":"Ibn ‘Umar reported God’s Messenger as saying, “Hearing and obeying are the duty of a Muslim man both regarding what he likes and what he dislikes, as long as he is not commanded to perform an act of disobedience to God, in which case he must neither hear nor obey.” \n\n(Bukhari and Muslim.)"}},{"id":5,"idInBook":5,"chapterId":18,"bookId":14,"arabic":"وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا طَاعَةَ فِي مَعْصِيَةٍ إِنَّمَا الطَّاعَةُ فِي الْمَعْرُوف»","english":{"narrator":"","text":"‘Ali reported God’s Messenger as saying, “No obedience is to be given in the case of an act of disobedience to God, obedience is to be given only regarding what is reputable.” \n\n(Bukhari and Muslim.)"}},{"id":6,"idInBook":6,"chapterId":18,"bookId":14,"arabic":"وَعَنْ عُبَادَةَ بْنِ الصَّامِتِ قَالَ: بَايَعْنَا رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى السَّمْعِ وَالطَّاعَةِ فِي الْعُسْرِ وَالْيُسْرِ وَالْمَنْشَطِ وَالْمَكْرَهِ وَعَلَى أَثَرَةٍ عَلَيْنَا وَعَلَى أَنْ لَا نُنَازِعَ الْأَمْرَ أَهْلَهُ وَعَلَى أَنْ نَقُولَ بِالْحَقِّ أَيْنَمَا كُنَّا لَا نَخَافُ فِي اللَّهِ لَوْمَةَ لَائِمٍ. وَفِي رِوَايَةٍ: وَعَلَى أَنْ لَا نُنَازِعَ الْأَمْرَ أَهْلَهُ إِلَّا أَنْ تَرَوْا كُفْرًا بَوَاحًا عِنْدَكُمْ مِنَ اللَّهِ فِيهِ بُرْهَانٌ","english":{"narrator":"‘Ubada b. as-Samit said:","text":"We swore allegiance to God’s Messenger agreeing to hear and obey in time of difficulty and time of ease, in what we liked and what we disliked, to give way to others’ interests, not to dispute about government with those in power, and to say what was right wherever we were, not fearing for God’s sake what anyone who blamed us might say. A version has, “Not to dispute about government with those in power unless you see evident infidelity regarding which you have a proof from God.” \n\n(Bukhari and Muslim.)"}},{"id":7,"idInBook":7,"chapterId":18,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: كُنَّا إِذَا بَايَعْنَا رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى السَّمْعِ وَالطَّاعَةِ يَقُولُ لَنَا: «فِيمَا اسْتَطَعْتُمْ»","english":{"narrator":"","text":"Ibn ‘Umar told that when they swore allegiance to God’s Messenger to hear and obey he was saying to them, “In what you are able.” \n\n(Bukhari and Muslim.)"}},{"id":8,"idInBook":8,"chapterId":18,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «من رأى أميره يَكْرَهُهُ فَلْيَصْبِرْ فَإِنَّهُ لَيْسَ أَحَدٌ يُفَارِقُ الْجَمَاعَةَ شبْرًا فَيَمُوت إِلَّا مَاتَ ميتَة جَاهِلِيَّة»","english":{"narrator":"","text":"Ibn ‘Abbas reported God’s Messenger as saying, “If anyone sees in his commander what he dislikes he should show patience, for no one separates a span's distance from the community and dies without dying like those of pre-Islamic times.” \n\n(Bukhari and Muslim.)"}},{"id":9,"idInBook":9,"chapterId":18,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنْ خَرَجَ مِنَ الطَّاعَةِ وَفَارَقَ الْجَمَاعَةَ فَمَاتَ مَاتَ مِيتَةً جَاهِلِيَّةً وَمَنْ قَاتَلَ تَحْتَ رَايَةٍ عِمِّيَّةٍ يَغْضَبُ لِعَصَبِيَّةٍ أَوْ يَدْعُو لِعَصَبِيَّةٍ أَوْ يَنْصُرُ عَصَبِيَّةً فَقُتِلَ فَقِتْلَةٌ جَاهِلِيَّةٌ وَمَنْ خَرَجَ عَلَى أُمَّتِي بِسَيْفِهِ يَضْرِبُ بَرَّهَا وَفَاجِرَهَا وَلَا يَتَحَاشَى مِنْ مُؤْمِنِهَا وَلَا يَفِي لِذِي عَهْدٍ عَهْدَهُ فَلَيْسَ مِنِّي وَلَسْتُ مِنْهُ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Huraira told that he heard God’s Messenger say, “He who abandons obedience and separates from the community and then dies, will die like those of pre-Islamic times; he who fights under a banner of ignorance* showing anger in support of party spirit, or summoning people to party spirit, or helping party spirit, and then is killed will be killed like those of pre-Islamic times; and he who goes out against my people with his sword smiting the virtuous and the reprobate, not keeping away from those who are believers or observing covenants which have been made, has nothing to do with me and I have nothing to do with him.” \n\nMuslim transmitted it.\n\n*'Immiya, or 'ummiya, meaning either pride or error. I have translated it as ‘‘ignorance, for it is explained as being here used of people who fight without considering whether they are in the right or not."}},{"id":10,"idInBook":10,"chapterId":18,"bookId":14,"arabic":"وَعَنْ عَوْفِ بْنِ مَالِكٍ الْأَشْجَعِيِّ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «خِيَارُ أئمتكم الَّذين يحبونهم وَيُحِبُّونَكُمْ وَتُصَلُّونَ عَلَيْهِمْ وَيُصَلُّونَ عَلَيْكُمْ وَشِرَارُ أَئِمَّتِكُمُ الَّذِي تبغضونهم ويبغضونكم وتلعنوهم ويلعنوكم» قَالَ: قُلْنَا: يَا رَسُولَ اللَّهِ أَفَلَا نُنَابِذُهُمْ عِنْدَ ذَلِكَ؟ قَالَ: «لَا مَا أَقَامُوا فِيكُمُ الصَّلَاةَ لَا مَا أَقَامُوا فِيكُمُ الصَّلَاةَ أَلَا مَنْ وُلِّيَ عَلَيْهِ وَالٍ فَرَآهُ يَأْتِي شَيْئًا مِنْ مَعْصِيَةِ اللَّهِ فَلْيَكْرَهْ مَا يَأْتِي مِنْ مَعْصِيَةِ اللَّهِ وَلَا يَنْزِعَنَّ يَدًا مِنْ طَاعَةٍ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"‘Auf b. Malik al-Ashja‘i reported God's Messenger as saying, “Your best imams are those whom you like and who like you, on whom you invoke blessings and who invoke blessings on you; and your worst imams are those whom you hate and who hate you, whom you curse and who curse you.” They asked God's Messenger whether in that event they should not depose them, but he replied, “No, as long as they observe the prayer among you; no, as long as they observe the prayer among you. If anyone has a governor whom he sees doing anything which is an act of disobedience to God, he must disapprove of the disobedience to God which he commits, but must never withdraw from obedience.” \n\nMuslim transmitted it."}},{"id":11,"idInBook":11,"chapterId":18,"bookId":14,"arabic":"وَعَنْ أُمِّ سَلَمَةَ قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَكُونُ عَلَيْكُمْ أُمَرَاءُ تَعْرِفُونَ وَتُنْكِرُونَ فَمَنْ أَنْكَرَ فَقْدَ بَرِئَ وَمَنْ كَرِهَ فَقَدْ سَلِمَ وَلَكِنْ مَنْ رَضِيَ وَتَابَعَ» قَالُوا: أَفَلَا نُقَاتِلُهُمْ؟ قَالَ: «لَا مَا صَلَّوْا لَا مَا صَلَّوْا» أَيْ: مَنْ كَرِهَ بِقَلْبِهِ وَأنكر بِقَلْبِه. رَوَاهُ مُسلم","english":{"narrator":"","text":"Umm Salama reported God’s Messenger as saying, “You will have commanders some of whom you will approve and some of whom you will disapprove. He who expresses disapproval is guiltless and he who feels disapproval is safe, but he who is pleased and follows them ...” His hearers interrupted, “Shall we not fight with them?” but he replied, “No, as long as they pray; no, as long as they pray.” It means one who feels disapproval in his heart and expresses disapproval in his heart. \n\nMuslim transmitted it."}},{"id":12,"idInBook":12,"chapterId":18,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ: قَالَ لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّكُمْ سَتَرَوْنَ بَعْدِي أَثَرَةً وَأُمُورًا تُنْكِرُونَهَا» قَالُوا: فَمَا تَأْمُرُنَا يَا رَسُولَ اللَّهِ؟ قَالَ: «أَدُّوا إِلَيْهِم حَقهم وسلوا الله حقكم»","english":{"narrator":"","text":"‘Abdallah b. Mas'ud told that God’s Messenger said to them, “After my death you will see  appropriating the best things for themselves and other matters which you will disapprove.” He was asked what he commanded them to do and replied, “Give them what is due to them and ask God for what is due to you.” \n\n(Bukhari and Muslim)."}},{"id":13,"idInBook":13,"chapterId":18,"bookId":14,"arabic":"وَعَنْ وَائِلِ بْنِ حُجْرٍ قَالَ: سَأَلَ سَلَمَةُ بْنُ يَزِيدَ الْجُعْفِيُّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: يَا نَبِيَّ اللَّهِ أَرَأَيْتَ إِنْ قَامَتْ عَلَيْنَا أُمَرَاءُ يَسْأَلُونَا حَقَّهُمْ وَيَمْنَعُونَا حَقَّنَا فَمَا تَأْمُرُنَا؟ قَالَ: «اسْمَعُوا وَأَطِيعُوا فَإِنَّمَا عَلَيْهِمْ مَا حُمِّلُوا وَعَلَيْكُمْ مَا حُمِّلْتُمْ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Wa’il b. Hujr told that Salama b. Yazid al-Ju‘fi questioned God’s Messenger saying, “Prophet of God, tell us what you command us to do if commanders arise over us who demand of us what is due to them and refuse us what is due to us.” He replied, “Listen and obey, for they are responsible only for what has been laid on them (cf. Al-Qur’an, 24:54) and you for what has been laid on you.” \n\nMuslim transmitted it."}},{"id":14,"idInBook":14,"chapterId":18,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم يَقُول: «مَنْ خَلَعَ يَدًا مِنْ طَاعَةٍ لَقِيَ اللَّهَ يَوْمَ الْقِيَامَةِ وَلَا حُجَّةَ لَهُ. وَمَنْ مَاتَ وَلَيْسَ فِي عُنُقِهِ بَيْعَةٌ مَاتَ مِيتَةً جَاهِلِيَّةً» . رَوَاهُ مُسلم","english":{"narrator":"","text":"‘Abdallah b. ‘Umar told that he heard God's Messenger say, “He who throws off obedience will meet God on the day of resurrection without possessing any plea, and he who dies without having taken an oath of allegiance will die like a pagan.” \n\nMuslim transmitted it."}},{"id":15,"idInBook":15,"chapterId":18,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «كَانَتْ بَنُو إِسْرَائِيلَ تَسُوسُهُمُ الْأَنْبِيَاءُ كُلَّمَا هَلَكَ نَبِيُّ خَلَفَهُ نبيٌّ وإِنَّه لَا نبيَّ بعدِي وسيكون حلفاء فَيَكْثُرُونَ» قَالُوا: فَمَا تَأْمُرُنَا؟ قَالَ: «فُوا بَيْعَةَ الْأَوَّلِ فَالْأَوَّلِ أَعْطُوهُمْ حَقَّهُمْ فَإِنَّ اللَّهَ سَائِلُهُمْ عَمَّا استرعاهم»","english":{"narrator":"","text":"Abu Huraira reported the Prophet as saying, “The B. Isra’il were governed by the prophets, as often as one died another taking his place. There will be no prophet after me, but there will be numerous caliphs.” He was asked what command he had to give and replied, “Fulfil the oath of allegiance to each and give them their due for God will question them about what He asked them to guard.” \n\n(Bukhari and Muslim.)"}},{"id":16,"idInBook":16,"chapterId":18,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا بُويِعَ لِخَلِيفَتَيْنِ فاقتُلوا الآخِرَ منهُما» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Sa'id al-Khudri reported God’s Messenger as saying, “When allegiance is sworn to two caliphs kill the second of them.* \n\nMuslim transmitted it.\n\n* Some interpret ‘kill’ here as meaning to fight with. The tradition is directed against the possibility of two Caliphs holding power at the same time, even though the areas might be quite distinct."}},{"id":17,"idInBook":17,"chapterId":18,"bookId":14,"arabic":"وَعَنْ عَرْفَجَةَ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِنَّهُ سَيَكُونُ هَنَاتٌ وَهَنَاتٌ فَمَنْ أَرَادَ أَنْ يُفَرِّقَ أَمْرَ هَذِهِ الْأُمَّةِ وَهِيَ جَمِيعٌ فَاضْرِبُوهُ بِالسَّيْفِ كَائِنًا مَنْ كانَ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"‘Arfaja told that he heard God’s Messenger say, “Various corruptions will arise, so strike with the sword him who tries to cause separation in this people when they are united, whoever he be.” \n\nMuslim transmitted it."}},{"id":18,"idInBook":18,"chapterId":18,"bookId":14,"arabic":"وَعَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنْ أَتَاكُمْ وَأَمْرُكُمْ جَمِيعٌ عَلَى رَجُلٍ وَاحِدٍ يُرِيدُ أَنْ يَشُقَّ عَصَاكُمْ أوْ يُفرِّقَ جماعتكم فَاقْتُلُوهُ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"He told that he heard God’s Messenger say, “If anyone comes to you when you are united under one man desiring to split you or cause parties in your community, kill him.” \n\nMuslim transmitted it."}},{"id":19,"idInBook":19,"chapterId":18,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «من بَايَعَ إِمَامًا فَأَعْطَاهُ صَفْقَةَ يَدِهِ وَثَمَرَةَ قَلْبِهِ فَلْيُطِعْهُ إِنِ اسْتَطَاعَ فَإِنْ جَاءَ آخَرُ يُنَازِعُهُ فاضربوا عنق الآخر» . رَوَاهُ مُسلم","english":{"narrator":"","text":"‘Abdallah b. ‘Amr reported God’s Messenger as saying, “If anyone swears allegiance to an imam, giving him his hand in ratification and sincere agreement in his heart, he must obey him if he can. Then if another comes and contends with him, cut off that other one’s head.” \n\nMuslim transmitted it."}},{"id":20,"idInBook":20,"chapterId":18,"bookId":14,"arabic":"وَعَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ قَالَ: قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَسْأَلِ الْإِمَارَةَ فَإِنَّكَ إِنْ أُعْطِيتَهَا عَنْ مَسْأَلَةٍ وُكِلْتَ إِلَيْهَا وَإِنْ أُعْطِيتَهَا عنْ غيرِ مَسْأَلَة أعنت عَلَيْهَا»","english":{"narrator":"","text":"‘Abd ar-Rahman b. Samura told that God’s Messenger said to him, “Do not ask for the position of commander, for if you are given it after asking you will be left to discharge it yourself; but if you are given it without asking you will be helped to discharge it.” \n\n(Bukhari and Muslim.)"}},{"id":21,"idInBook":21,"chapterId":18,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّكُمْ سَتَحْرِصُونَ عَلَى الْإِمَارَةِ وَسَتَكُونُ نَدَامَةً يَوْمَ الْقِيَامَةِ فَنِعْمَ الْمُرْضِعَةُ وَبِئْسَتِ الفاطمةُ» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Abu Huraira reported the Prophet as saying, “You will be eager for the office of commander, but it will become a cause of regret on the day of resurrection. It is a good suckler but an evil weaner.”* \n\nBukhari transmitted it.\n\n*In the beginning it causes pleasure, but later such pleasures are cut off. The idea is that one gladly undertakes high office, but later finds it to be a cause of grief."}},{"id":22,"idInBook":22,"chapterId":18,"bookId":14,"arabic":"وَعَنْ أَبِي ذَرٍّ قَالَ: قُلْتُ: يَا رَسُولَ اللَّهِ أَلَا تَسْتَعْمِلُنِي؟ قَالَ: فَضَرَبَ بِيَدِهِ عَلَى مَنْكِبِي ثُمَّ قَالَ: «يَا أَبَا ذَرٍّ إِنَّكَ ضَعِيفٌ وَإِنَّهَا أَمَانَةٌ وَإِنَّهَا يَوْمَ الْقِيَامَةِ خِزْيٌ وَنَدَامَةٌ إِلَّا مَنْ أَخَذَهَا بِحَقِّهَا وَأَدَّى الَّذِي عَلَيْهِ فِيهَا» . وَفِي رِوَايَةٍ: قَالَ لَهُ: «يَا أَبَا ذَرٍّ إِنِّي أَرَاكَ ضَعِيفًا وَإِنِّي أُحِبُّ لَكَ مَا أُحِبُّ لِنَفْسِي لَا تَأَمَّرَنَّ عَلَى اثْنَيْنِ وَلَا تَوَلَّيَنَّ مَالَ يَتِيمٍ» . رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"Abu Dharr told that he asked God’s Messenger to make him a governor, but he struck him on his shoulder with his hand and said, “You are weak, Abu Dharr, and it is a trust which will be a cause of shame and regret on the day of resurrection except for him who undertakes it as it ought to be undertaken and fulfils his duty in it.” In a version he said to him, “I see that you are weak, Abu Dharr, and I wish for you what I wish for myself. Do not accept rule over two people and do not become guardian of an orphan’s property.” \n\nMuslim transmitted it."}},{"id":23,"idInBook":23,"chapterId":18,"bookId":14,"arabic":"وَعَنْ أَبِي مُوسَى قَالَ: دَخَلْتُ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَا وَرَجُلَانِ مِنْ بَنِي عَمِّي فَقَالَ أَحَدُهُمَا: يَا رَسُولَ اللَّهِ أَمِّرْنَا عَلَى بَعْضِ مَا وَلَّاكَ اللَّهُ وَقَالَ الْآخَرُ مِثْلَ ذَلِكَ فَقَالَ: «إِنَّا وَاللَّهِ لَا نُوَلِّي عَلَى هَذَا الْعَمَلِ أَحَدًا سَأَلَهُ وَلَا أَحَدًا حَرَصَ عَلَيْهِ» . وَفِي رِوَايَةٍ قَالَ: «لَا نَسْتَعْمِلُ عَلَى عَمَلِنَا مَنْ أَرَادَهُ»","english":{"narrator":"Abu Musa said:","text":"Two of my cousins on my father’s side and I went in to see the Prophet and one of them said, “Messenger of God, put us in command of part of what God has put in your charge,” the other also saying the same. He replied, “I swear by God that I will not put in charge, of this work anyone who asks for it, or anyone who is eager for it.” In a version he said, “We will not employ in our work one who wants it.” \n\n(Bukhari and Muslim.)"}},{"id":24,"idInBook":24,"chapterId":18,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «تَجِدُونَ مِنْ خَيْرِ النَّاسِ أَشَدَّهُمْ كَرَاهِيَةً لِهَذَا الْأَمْرِ حَتَّى يقَعَ فِيهِ»","english":{"narrator":"","text":"Abu Huraira reported God’s Messenger as saying, “You will find among the best people those who have the strongest dislike of this command till they fall into it.”*\n\n(Bukhari and Muslim.)\n\n*This is explained as meaning either they cease to dislike having authority and so cease to be among the best people, or they find that God helps them. Preference is given to the first explanation, but the remark is made that whichever explanation is correct, in the end these people do not object to having authority."}},{"id":25,"idInBook":25,"chapterId":18,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «أَلا كلُّكُمْ راعٍ وكلُّكُمْ مسؤولٌ عَنْ رَعِيَّتِهِ فَالْإِمَامُ الَّذِي عَلَى النَّاسِ رَاعٍ وَهُوَ مسؤولٌ عَنْ رَعِيَّتِهِ وَالرَّجُلُ رَاعٍ عَلَى أَهْلِ بَيْتِهِ وَهُوَ مسؤولٌ عَنْ رَعِيَّتِهِ وَالْمَرْأَةُ رَاعِيَةٌ عَلَى بَيْتِ زَوْجِهَا وولدِهِ وَهِي مسؤولةٌ عَنْهُمْ وَعَبْدُ الرَّجُلِ رَاعٍ عَلَى مَالِ سَيِّدِهِ وَهُوَ مسؤولٌ عَنهُ أَلا فكلُّكُمْ راعٍ وكلكُمْ مسؤولٌ عَن رعيتِه»","english":{"narrator":"","text":"‘Abdallah b. ‘Umar reported God’s Messenger as saying, “Each of you is a shepherd and each of you is responsible for his flock. The imam who is over the people is a shepherd and is responsible for his flock; a man is a shepherd in charge of the inhabitants of his household and he is responsible for his flock; a woman is a shepherdess in charge of her husband’s house and children and she is responsible for them; and a man’s slave is a shepherd in charge of his master’s property and he is responsible for it. So each of you is a shepherd and each of you is responsible for his flock.” \n\n(Bukhari and Muslim.)"}},{"id":26,"idInBook":26,"chapterId":18,"bookId":14,"arabic":"وَعَنْ مَعْقِلِ بْنِ يَسَارٍ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم يقولُ: «مَا مِنْ والٍ بلي رَعِيَّةً مِنَ الْمُسْلِمِينَ فَيَمُوتُ وَهُوَ غَاشٌّ لَهُمْ إِلَّا حَرَّمَ اللَّهُ عَلَيْهِ الْجَنَّةَ»","english":{"narrator":"","text":"Ma'qil b. Yasar told that he heard God’s Messenger say, “Any governor in charge of Muslim subjects who dies while acting dishonestly towards them will be excluded by God from paradise.” \n\n(Bukhari and Muslim.)"}},{"id":27,"idInBook":27,"chapterId":18,"bookId":14,"arabic":"وَعَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَا مِنْ عَبْدٍ يَسْتَرْعِيهِ اللَّهُ رَعِيَّةً فَلَمْ يَحُطْهَا بِنَصِيحَةٍ إِلَّا لَمْ يجد رَائِحَة الْجنَّة»","english":{"narrator":"","text":"He told that he heard God’s Messenger say, “Anyone who is asked by God to take charge of subjects and does not protect them with good counsel will not smell the fragrance of paradise.” \n\n(Bukhari and Muslim.)"}},{"id":28,"idInBook":28,"chapterId":18,"bookId":14,"arabic":"وَعَنْ عَائِذِ بْنِ عَمْرٌو قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِنَّ شرَّ الرعاءِ الحُطَمَة» . رَوَاهُ مُسلم","english":{"narrator":"","text":"‘A’idh b. ‘Amr told that he heard God’s Messenger say, “The worst shepherds are those who are ungentle.” \n\nMuslim transmitted it."}},{"id":29,"idInBook":29,"chapterId":18,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «اللَّهُمَّ مَنْ وَلِيَ مِنْ أَمْرِ أُمَّتِي شَيْئًا فَشَقَّ عَلَيْهِمْ فَاشْقُقْ عَلَيْهِ وَمَنْ وَلِيَ مِنْ أَمْرِ أُمَّتِي شَيْئًا فَرَفَقَ بهم فارفُقْ بِهِ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"‘A’isha reported God’s Messenger as saying, “O God, cause distress to him who has any charge over my people and causes them distress, and be gentle to him who has any charge over my people and is gentle to them.” \n\nMuslim transmitted it."}},{"id":30,"idInBook":30,"chapterId":18,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ الْمُقْسِطِينَ عِنْدَ اللَّهِ عَلَى مَنَابِرَ مِنْ نُورٍ عَنْ يَمِينِ الرَّحْمَنِ وَكِلْتَا يَدَيْهِ يمينٌ الذينَ يعدِلُونَ فِي حُكمِهم وأهليهم وَمَا ولُوا» . رَوَاهُ مُسلم","english":{"narrator":"","text":"‘Abdallah b. ‘Amr b. al-‘As reported God’s Messenger as saying, “Those who act justly will be with God on pulpits of light* at the right hand of the Compassionate One, and both His hands are right. They are those who are just in their jurisdiction, towards their people and what is under their charge.” \n\nMuslim transmitted it.\n\n*This phrase is explained either in a literal sense, or as indicating their high station."}},{"id":31,"idInBook":31,"chapterId":18,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" مَا بَعَثَ اللَّهُ مِنْ نَبِيٍّ وَلَا اسْتَخْلَفَ مِنْ خَلِيفَةٍ إِلَّا كَانَتْ لَهُ بِطَانَتَانِ: بِطَانَةٌ تَأْمُرُهُ بِالْمَعْرُوفِ وَتَحُضُّهُ عَلَيْهِ وَبِطَانَةٌ تَأْمُرُهُ بِالشَّرِّ وَتَحُضُّهُ عَلَيْهِ وَالْمَعْصُومُ مَنْ عصمَه اللَّهُ \". رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Abu Sa'id reported God's Messenger as saying, “No prophet is sent by God and no caliph succeeds another without having two close associates, one who commands and urges him to do what is reputable and one who commands and urges him to do what is evil. The one who is protected is he whom God protects.” \n\nBukhari transmitted it."}},{"id":32,"idInBook":32,"chapterId":18,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: كَانَ قَيْسُ بْنُ سَعْدٍ مِنَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَنْزِلَةِ صاحبِ الشُّرَطِ منَ الأميرِ. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Anas said that Qais b. Sa‘d had a position in relation to the Prophet like that of a prefect of a district in relation to a governor. \n\nBukhari transmitted it."}},{"id":33,"idInBook":33,"chapterId":18,"bookId":14,"arabic":"وَعَنْ أَبِي بَكْرَةَ قَالَ: لَمَّا بَلَغَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ أَهْلَ فَارِسَ قَدْ مَلَّكُوا عَلَيْهِمْ بِنْتَ كِسْرَى قَالَ: «لَنْ يُفْلِحَ قَوْمٌ وَلَّوْا أَمْرَهُمُ امْرَأَةً» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Abu Bakra told that when God’s Messenger heard the people of Persia had made Kisra’s daughter their queen he said, “People who make a woman their ruler will never prosper.” \n\nBukhari transmitted it."}},{"id":34,"idInBook":34,"chapterId":18,"bookId":14,"arabic":"عَن الحارِثِ الْأَشْعَرِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" آمُرُكُمْ بِخَمْسٍ: بِالْجَمَاعَةِ وَالسَّمْعِ وَالطَّاعَةِ وَالْهِجْرَةِ وَالْجِهَادِ فِي سَبِيلِ اللَّهِ وَإِنَّهُ مَنْ خَرَجَ مِنَ الْجَمَاعَةِ قِيدَ شِبْرٍ فَقَدْ خَلَعَ رِبْقَةَ الْإِسْلَامِ مِنْ عُنُقِهِ إِلَّا أَنْ يُرَاجِعَ وَمَنْ دَعَا بِدَعْوَى الْجَاهِلِيَّةِ فَهُوَ مِنْ جُثَى جَهَنَّمَ وَإِنْ صَامَ وَصَلَّى وَزَعَمَ أَنَّهُ مُسْلِمٌ \". رَوَاهُ أَحْمد وَالتِّرْمِذِيّ","english":{"narrator":"Al-Harith al-Ash‘ari reported God's Messenger as saying, “I command you five things:","text":"to maintain the community, to listen, to obey, to emigrate, and to fight in God's path. He who secedes from the community as much as a span has cast off the tie of Islam from his neck unless he returns, and he who summons to what the pre-Islamic people believed belongs to the assemblies of jahannam even if he fasts, prays, and asserts that he is a Muslim.” \n\nAhmad and Tirmidhi transmitted it."}},{"id":35,"idInBook":35,"chapterId":18,"bookId":14,"arabic":"وَعَن زِيادِ بنِ كُسَيبٍ العَدَوِيِّ قَالَ: كُنْتُ مَعَ أَبِي بَكْرَةَ تَحْتَ مِنْبَرِ ابْنِ عَامِرٍ وَهُوَ يَخْطُبُ وَعَلَيْهِ ثِيَابٌ رِقَاقٌ فَقَالَ أَبُو بِلَال: انْظُرُوا إِلَى أَمِير نايلبس ثِيَابَ الْفُسَّاقِ. فَقَالَ أَبُو بَكْرَةَ: اسْكُتْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُول: «مَنْ أَهَانَ سُلْطَانَ اللَّهِ فِي الْأَرْضِ أَهَانَهُ اللَّهُ» رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ","english":{"narrator":"Ziyad b. Kusaib al-‘Adawi said:","text":"I was with Abu Bakra under Ibn ‘Amir’s pulpit when he was preaching and wearing thin garments. Abu Bilal said, “Look at our governor wearing the garments of profligates,” whereupon Abu Bakra told him to be quiet, for he had heard God’s Messenger say, “He who despises God’s ruler in the earth will be despised by God.” \n\nTirmidhi transmitted it, saying this is a hasan gharib tradition."}},{"id":36,"idInBook":36,"chapterId":18,"bookId":14,"arabic":"وَعَنِ النَّوَّاسِ بْنِ سِمْعَانَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا طَاعَةَ لِمَخْلُوقٍ فِي مَعْصِيَةِ الْخَالِقِ» . رَوَاهُ فِي شَرْحِ السّنة","english":{"narrator":"","text":"An-Nawwas b. Sam‘an reported God’s Messenger as saying, “A creature is not to be obeyed when it involves disobedience to the \"Creator.” \n\nIt is transmitted in Sharh as-sunna."}},{"id":37,"idInBook":37,"chapterId":18,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا مِنْ أَمِيرِ عَشرَةٍ إِلا يُؤتى بِهِ يَوْمَ الْقِيَامَةِ مَغْلُولًا حَتَّى يُفَكَّ عَنْهُ الْعَدْلُ أَو يوبقه الْجور» . رَوَاهُ الدَّارمِيّ","english":{"narrator":"","text":"Abu Huraira reported God’s Messenger as saying, “He who has been ruler over ten people will be brought on the day of resurrection shackled till justice loosens his chains or tyranny brings him to destruction.”* \n\nDarimi transmitted it.\n\n*The reference is to the justice or tyranny he has displayed in the administration of his office."}},{"id":38,"idInBook":38,"chapterId":18,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «وَيْلٌ لِلْأُمَرَاءِ وَيْلٌ لِلْعُرَفَاءِ وَيْلٌ لِلْأُمَنَاءِ لَيَتَمَنَّيَنَّ أَقْوَامٌ يَوْمَ الْقِيَامَةِ أَنَّ نَوَاصِيَهُمْ مُعَلَّقَةٌ بِالثُّرَيَّا يَتَجَلْجَلُونَ بَيْنَ السَّمَاءِ وَالْأَرْضِ وَأَنَّهُمْ لَمْ يَلُوا عَمَلًا» . رَوَاهُ فِي «شَرْحِ السُّنَّةِ» وَرَوَاهُ أَحْمد وَفِي رِوَايَته: «أنَّ ذوائِبَهُم كَانَتْ مُعَلَّقَةً بِالثُّرَيَّا يَتَذَبْذَبُونَ بَيْنَ السَّمَاءِ وَالْأَرْضِ ولَمْ يَكُونُوا عُمِّلوا على شَيْء»","english":{"narrator":"","text":"He reported God’s Messenger as saying, “Woe to the governors, woe to the chiefs, woe to the superintendents! On the day of resurrection people will wish that their forelocks were tied to the Pleiades, that they were swinging between heaven and earth, and that they had never exercised any rule.”* \n\nIt is transmitted in Sharh as-sunna. Ahmad transmitted it, his version saying, “that their flowing hair were tied to the Pleiades, that they were dangling between heaven and earth, and that they had never been made governors over anything.”\n\n* The idea of their swinging between heaven and earth is that they will wish they had been far removed from the world during their lifetime so that they would not have exercised rule."}},{"id":39,"idInBook":39,"chapterId":18,"bookId":14,"arabic":"وَعَنْ غَالِبٍ الْقَطَّانِ عَنْ رَجُلٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «إِن العرافة حق ولابد لِلنَّاسِ مِنْ عُرَفَاءَ وَلَكِنَّ الْعُرْفَاءَ فِي النَّارِ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Ghalib al-Qattan quoted a man who stated on the authority of his father that his grandfather reported God’s Messenger as saying, “The office of a chief is necessary, for people must have chiefs, but the chiefs will go to hell.”* \n\nAbu Dawud transmitted it.\n\n* Mirqat. iv, 133 says this means those who are unjust, or is a warning against the temptations to injustice arising from their office."}},{"id":40,"idInBook":40,"chapterId":18,"bookId":14,"arabic":"وَعَنْ كَعْبِ بْنِ عُجْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أُعِيذُكَ بِاللَّهِ مِنْ إِمَارَةِ السُّفَهَاءِ» . قَالَ: وَمَا ذَاكَ يَا رَسُولَ اللَّهِ؟ قَالَ: «أُمَرَاءُ سَيَكُونُونَ مِنْ بَعْدِي مَنْ دَخَلَ عَلَيْهِمْ فَصَدَّقَهُمْ بِكَذِبِهِمْ وَأَعَانَهُمْ عَلَى ظُلْمِهِمْ فَلَيْسُوا مِنِّي وَلَسْتُ مِنْهُمْ وَلَنْ يَرِدُوا عليَّ الحوضَ وَمَنْ لَمْ يَدْخُلْ عَلَيْهِمْ وَلَمْ يُصَدِّقْهُمْ بِكَذِبِهِمْ وَلَمْ يُعِنْهُمْ عَلَى ظُلْمِهِمْ فَأُولَئِكَ مِنِّي وَأَنَا مِنْهُمْ وَأُولَئِكَ يَرِدُونَ عَلَيَّ الْحَوْضَ» . رَوَاهُ التِّرْمِذِيُّ وَالنَّسَائِيّ","english":{"narrator":"","text":"Ka'b b. ‘Ujra told that God's Messenger said to him, “I commend you to God to protect you from the ruler ship of the foolish.” He asked what that was, and God’s Messenger replied, “After my time governors will arise whose falsehood will be believed and who will be assisted in their oppression by those who enter their presence. They have nothing to do with me and I have nothing to do with them, and they will never come down to me at the Pond. But they who do not enter their presence, believe their falsehood and help them in their oppression, those belong to me and I belong to them, and those ones will come down to me at the Pond.”* \n\nTirmidhi and Nasa’i transmitted it.\n\n* This is the tank or pool at which believers will drink on the day of resurrection."}},{"id":41,"idInBook":41,"chapterId":18,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ سَكَنَ الْبَادِيَةَ جَفَا وَمَنِ اتَّبَعَ الصَّيْدَ غَفَلَ وَمَنْ أَتَى السُّلْطَانَ افْتُتِنَ» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَالنَّسَائِيُّ وَفِي رِوَايَةِ أَبِي دَاوُدَ: «مَنْ لَزِمَ السُّلْطَانَ افْتُتِنَ وَمَا ازْدَادَ عَبْدٌ مِنَ السُّلْطَانِ دُنُوًّا إِلَّا ازْدَادَ من اللَّهِ بُعداً»","english":{"narrator":"","text":"Ibn ‘Abbas reported the Prophet as saying, “He who lives in the desert will become rough, he who follows the chase will become negligent, and he who goes to a ruler will be led astray.” \n\nAhmad, Tirmidhi and Nasa’i transmitted it. Abu Dawud’s version has, “He who attaches himself to a ruler will be led astray, and the nearer a man comes to a ruler the farther he goes from God.”"}},{"id":42,"idInBook":42,"chapterId":18,"bookId":14,"arabic":"وَعَن المقدامِ بن معْدي كِربَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ضَرَبَ عَلَى مَنْكِبَيْهِ ثُمَّ قَالَ: «أَفْلَحْتَ يَا قُدَيْمُ إِنْ مُتَّ وَلَمْ تَكُنْ أَمِيرًا وَلَا كَاتبا وَلَا عريفا» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Al-Miqdam b. Ma'dikarib told that God’s Messenger struck him on his shoulders and then said, “You will attain success, Qudaim,* if you die without having been a ruler, a secretary, or a chief.” \n\nAbu Dawud transmitted it.\n\n* This form is used as a diminutive of Miqdam, the diminutive being used as an affectionate form of address."}},{"id":43,"idInBook":43,"chapterId":18,"bookId":14,"arabic":"وَعَنْ عُقْبَةَ بْنِ عَامِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَدْخُلُ الْجَنَّةَ صَاحِبُ مَكْسٍ» : يَعْنِي الَّذِي يَعْشُرُ النَّاسَ. رَوَاهُ أَحْمد وَأَبُو دَاوُد والدارمي","english":{"narrator":"","text":"‘Uqba b. ‘Amir reported God’s Messenger as saying, “Sahib maks, meaning one who tithes people, will not enter paradise.” \n\nAhmad, Abu Dawud and Darimi transmitted it."}},{"id":44,"idInBook":44,"chapterId":18,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ أَحَبَّ النَّاسِ إِلَى اللَّهِ يَوْمَ الْقِيَامَةِ وَأَقْرَبَهُمْ مِنْهُ مَجْلِسًا إِمَامٌ عَادِلٌ وَإِنَّ أَبْغَضَ النَّاسِ إِلَى اللَّهِ يَوْمَ الْقِيَامَةِ وَأَشَدَّهُمْ عَذَابًا» وَفِي رِوَايَةٍ: «وَأَبْعَدَهُمْ مِنْهُ مَجْلِسًا إِمَامٌ جَائِرٌ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ","english":{"narrator":"","text":"Abu Sa'id reported God’s Messenger as saying, “The one who will be dearest to God and nearest to Him in station of the day of resurrection will be a just imam, and the one who will be most hateful to God on the day of resurrection and will receive the severest punishment (or as a version has, will be farthest from Him in station) will be a tyrannical imam.” \n\nTirmidhi transmitted it, saying this is a hasan gharib tradition."}},{"id":45,"idInBook":45,"chapterId":18,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَفْضَلُ الْجِهَادِ مَنْ قَالَ كَلِمَةَ حَقٍّ عِنْدَ سُلْطَانٍ جَائِرٍ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُد وَابْن مَاجَه\nوَرَوَاهُ أَحْمَدُ وَالنَّسَائِيُّ عَنْ طَارِقِ بْنِ شِهَابٍ","english":{"narrator":"","text":"He reported God’s Messenger as saying, “The most excellent jihad is when one speaks a true word in the presence of a tyrannical ruler.” \n\nTirmidhi, Abu Dawud and Ibn Majah transmitted it, and Ahmad and Nasa‘i transmitted it on the authority of Tariq b. Shihab."}},{"id":46,"idInBook":46,"chapterId":18,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا أَرَادَ اللَّهُ بِالْأَمِيرِ خَيْرًا جَعَلَ لَهُ وَزِيرَ صِدْقٍ إِنْ نَسِيَ ذَكَّرَهُ وَإِنْ ذَكَرَ أَعَانَهُ. وَإِذَا أَرَادَ بِهِ غَيْرَ ذَلِكَ جَعَلَ لَهُ وَزِيرَ سُوءٍ إِنْ نَسِيَ لَمْ يُذَكِّرْهُ وَإِنْ ذَكَرَ لَمْ يُعِنْهُ» . رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ","english":{"narrator":"","text":"‘A’isha reported God’s Messenger as saying, “When God has a good purpose for a ruler He appoints for him a sincere minister who reminds him if he forgets and helps him if he remembers; but when God has a different purpose from that for him He appoints for him an evil minister who does not remind him if he forgets and does not help him if he remembers.” \n\nAbu Dawud and Nasa’i transmitted it."}},{"id":47,"idInBook":47,"chapterId":18,"bookId":14,"arabic":"وَعَنْ أَبِي أُمَامَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ الْأَمِيرَ إِذَا ابْتَغَى الرِّيبَةَ فِي النَّاسِ أَفْسَدَهُمْ» . رَوَاهُ أَبُو دَاوُدَ","english":{"narrator":"","text":"Abu Umama reported the Prophet as saying, ‘‘When a ruler seeks to make imputations against the people he corrupts them.” \n\nAbu Dawud transmitted it."}},{"id":48,"idInBook":48,"chapterId":18,"bookId":14,"arabic":"وَعَنْ مُعَاوِيَةَ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِنَّكَ إِذَا اتَّبَعْتَ عَوْرَاتِ النَّاسِ أَفْسَدْتَهُمْ» . رَوَاهُ الْبَيْهَقِيُّ فِي «شُعَبِ الْإِيمَان»","english":{"narrator":"","text":"Mu'awiya told that he heard God’s Messenger say,” When you look into people’s secrets you corrupt them.”* \n\nBaihaqi transmitted it in Shu'ab al-iman.\n\n* This is a prohibition of delving into other people’s affairs and disclosing things which should not be disclosed, as this makes life difficult for them. It is the same idea as in the previous tradition."}},{"id":49,"idInBook":49,"chapterId":18,"bookId":14,"arabic":"وَعَنْ أَبِي ذَرٍّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «كَيْفَ أَنْتُمْ وَأَئِمَّةً مِنْ بَعْدِي يَسْتَأْثِرُونَ بِهَذَا الْفَيْءِ؟» . قُلْتُ: أَمَا وَالَّذِي بَعَثَكَ بِالْحَقِّ أَضَعُ سَيْفِي عَلَى عَاتِقِي ثُمَّ أَضْرِبُ بِهِ حَتَّى أَلْقَاكَ قَالَ: «أَوَلَا أَدُلُّكَ عَلَى خَيْرٍ مِنْ ذَلِكَ؟ تَصْبِرُ حَتَّى تَلقانِي» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Abu Dharr reported God's Messenger as saying, “How will you deal with imams after my death who appropriate to themselves this booty?” He replied, “I swear by Him who sent you with the truth that I shall put my sword on my shoulder and smite with it till I meet you.” He said, “Shall I not guide you to something better than that? You must show endurance till you meet me.” \n\nAbu Dawud transmitted it."}},{"id":50,"idInBook":50,"chapterId":18,"bookId":14,"arabic":"عَنْ عَائِشَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أَتَدْرُونَ مَنِ السَّابِقُونَ إِلَى ظِلِّ اللَّهِ عَزَّ وَجَلَّ يَوْمَ الْقِيَامَةِ؟» قَالُوا: اللَّهُ وَرَسُولُهُ أَعْلَمُ قَالَ: «الَّذِينَ إِذَا أُعْطُوا الْحَقَّ قَبِلُوهُ وَإِذَا سُئِلُوهُ بَذَلُوهُ وَحَكَمُوا لِلنَّاسِ كحكمِهم لأنفُسِهم»","english":{"narrator":"","text":"‘A’isha reported God's Messenger as saying, “Do you know who will go first on the day of resurrection to the shade of God who is great and glorious?” Then on receiving the reply that God and His Messenger knew best, he said, “Those who when given what is right accept it, when asked for something give freely, and who judge in favour of others as they do for themselves.”\n\nAhmad."}},{"id":51,"idInBook":51,"chapterId":18,"bookId":14,"arabic":"وَعَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم يَقُول: \n\" ثلاثةٌ أَخَافُ عَلَى أُمَّتِي: الِاسْتِسْقَاءُ بِالْأَنْوَاءِ وَحَيْفُ السُّلْطَانِ وَتَكْذيب الْقدر \"","english":{"narrator":"Jabir b. Samura told that he heard God’s Messenger say, “There are three things I fear for my people:","text":"seeking rain by the stars,*the injustice of the ruler, and denial of God's decree.”\n\nAhmad.\n\n*This is a reference to the pre-Islamic habit of attributing rain to certain seasons and saying the rain came to them because of a certain star, whereas Muslims ought to recognize that rain comes by God’s favour."}},{"id":52,"idInBook":52,"chapterId":18,"bookId":14,"arabic":"وَعَنْ أَبِي ذَرٍّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «سِتَّةَ أَيَّامٍ اعْقِلْ يَا أَبَا ذَرٍّ مَا يُقَالُ لَكَ بَعْدُ» فَلَمَّا كَانَ الْيَوْمُ السَّابِعُ قَالَ: «أُوصِيكَ بِتَقْوَى اللَّهِ فِي سِرِّ أَمْرِكَ وَعَلَانِيَتِهِ وَإِذَا أَسَأْتَ فَأَحْسِنْ وَلَا تَسْأَلَنَّ أَحَدًا شَيْئًا وَإِنْ سَقَطَ سَوْطُكَ وَلَا تَقْبِضْ أَمَانَةً وَلَا تَقْضِ بَيْنَ اثْنَيْنِ»","english":{"narrator":"","text":"Abu Dharr told that God’s Messenger said to him for six days, “Comprehend, Abu Dharr, what will be said to you afterwards.” Then when the seventh day came he said, “I counsel you to observe fear of God both secretly and openly; when you do wrong do a good deed; do not ask anyone for anything, even if your whip falls;* do not accept a trust; and do not give a decision between two people.”\n\nAhmad.\n\n* This means that help is to be asked only from God and that one should not ask another human being for even the smallest help."}},{"id":53,"idInBook":53,"chapterId":18,"bookId":14,"arabic":"وَعَنْ أَبِي أُمَامَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ: «مَا مِنْ رَجُلٍ يَلِي أَمْرَ عَشَرَةٍ فَمَا فَوْقَ ذَلِكَ إِلَّا أتاهُ اللَّهُ عزَّ وجلَّ مغلولاً يومَ القيامةِ يَدُهُ إِلَى عُنُقِهِ فَكَّهُ بِرُّهُ أَوْ أَوْبَقَهُ إِثْمُهُ أَوَّلُهَا مَلَامَةٌ وَأَوْسَطُهَا نَدَامَةٌ وَآخِرُهَا خِزْيٌ يومَ القيامةِ»","english":{"narrator":"","text":"Abu Umama reported the Prophet as saying, “No one will rule ten people or more without coming to God who is great and glorious on the day of resurrection with his hand chained to his neck and being set free by his goodness, or brought to destruction by his sin. The beginning of it merits blame, its middle produces regret, and its end is disgrace on the day of resurrection.”\n\nAhmad."}},{"id":54,"idInBook":54,"chapterId":18,"bookId":14,"arabic":"وَعَنْ مُعَاوِيَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَا مُعَاوِيَةُ إِنْ وُلِّيتَ أَمْرًا فَاتَّقِ اللَّهَ وَاعْدِلْ» . قَالَ: فَمَا زِلْتُ أَظُنُّ أَنِّي مُبْتَلًى بِعَمَلٍ لِقَوْلِ النَّبِيِّ صَلَّى الله عَلَيْهِ وَسلم حَتَّى ابْتليت","english":{"narrator":"","text":"Mu'awiya reported God’s Messenger as saying, “If you are put in a position of authority, Mu'awiya, fear God and act justly.” He said that he kept thinking he would be afflicted by a governorship in accordance with what the Prophet had said till it actually came true.\n\nAhmad. Baihaqi transmitted Mu‘awiya’s tradition in Dalail an-nubuwa."}},{"id":55,"idInBook":55,"chapterId":18,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «تَعَوَّذُوا بِاللَّهِ مِنْ رَأْسِ السَّبْعِينَ وَإِمَارَةِ الصِّبْيَانِ» . رَوَى الْأَحَادِيثَ السِّتَّةَ أَحْمَدُ وَرَوَى الْبَيْهَقِيُّ حَدِيثَ مُعَاوِيَةَ فِي «دَلَائِلِ النُّبُوَّة»","english":{"narrator":"","text":"Abu Huraira reported God’s Messenger as saying, “Seek refuge in God from the beginning of the year seventy and the governorship exercised by boys.”*\n\nAhmad. \n\n*This tradition is direction against some of the Umayyads."}},{"id":56,"idInBook":56,"chapterId":18,"bookId":14,"arabic":"وَعَنْ يَحْيَى بْنِ هَاشِمٍ عَنْ يُونُسَ بْنِ أَبِي إِسْحَاقَ عَنْ أَبِيهِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «كَمَا تَكُونُونَ كَذَلِك يُؤمر عَلَيْكُم»","english":{"narrator":"","text":"Yahya b. Hashim quoted Yunus b. Abu Ishaq who, on his father’s authority, reported God’s Messenger as saying, “As you are so will you have rulers put over you.”\n\nBaihaqi transmitted in Shuab al iman. This tradition has a broken isnad and that its transmission is weak."}},{"id":57,"idInBook":57,"chapterId":18,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ السُّلْطَانَ ظِلُّ اللَّهِ فِي الْأَرْضِ يَأْوِي إِلَيْهِ كُلُّ مَظْلُومٍ مِنْ عِبَادِهِ فَإِذَا عَدَلَ كَانَ لَهُ الْأَجْرُ وَعَلَى الرَّعِيَّةِ الشُّكْرُ وَإِذَا جَارَ كَانَ عَلَيْهِ الْإِصْرُ وعَلى الرّعية الصَّبْر»","english":{"narrator":"","text":"Ibn ‘Umar reported the Prophet as saying, “The sultan is God’s shade on the earth to which each one of His servants who is wronged repairs. When he is just he will have a reward, and it is the duty of the common people to be grateful; but when he acts tyrannically the burden rests on him, and it is the duty of the common people to show endurance.”\n\nBaihaqi transmitted in Shuab al iman."}},{"id":58,"idInBook":58,"chapterId":18,"bookId":14,"arabic":"وَعَنْ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ أَفْضَلَ عِبَادِ اللَّهِ عِنْدَ اللَّهِ مَنْزِلَةً يَوْمَ الْقِيَامَةِ إِمَامٌ عَادِلٌ رَفِيقٌ وَإِنَّ شَرَّ النَّاسِ عِنْدَ اللَّهِ مَنْزِلَةً يَوْمِ الْقِيَامَةِ إِمامٌ جَائِر خرق»","english":{"narrator":"","text":"‘Umar b. al-Khattab reported God’s Messenger as saying, “The one among God’s servants who will have the best position with God on the day of resurrection will be a just and kindly iman, but the man who will have the worst position with God on the day of resurrection will be a tyrannical and harsh imam.”\n\nBaihaqi transmitted in Shuab al iman."}},{"id":59,"idInBook":59,"chapterId":18,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «من نَظَرَ إِلَى أَخِيهِ نَظْرَةً يُخِيفُهُ أَخَافَهُ اللَّهُ يَوْمَ الْقِيَامَةِ» . رَوَى الْأَحَادِيثَ الْأَرْبَعَةَ الْبَيْهَقِيُّ فِي «شُعَبِ الْإِيمَانِ» وَقَالَ فِي حَدِيثِ يَحْيَى هَذَا: مُنْقَطع وَرِوَايَته ضَعِيف","english":{"narrator":"","text":"‘Abdallah b. ‘Amr reported God’s Messenger as saying, “If anyone gives his brother a look which frightens him, God will frighten him on the day of resurrection.”\n\nBaihaqi transmitted in Shuab al iman."}},{"id":60,"idInBook":60,"chapterId":18,"bookId":14,"arabic":"وَعَنْ أَبِي الدَّرْدَاءِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" إِنَّ اللَّهَ تَعَالَى يَقُولُ: أَنَا اللَّهُ لَا إِلَهَ إِلَّا أَنَا مَالِكُ الْمُلُوكِ وَمَلِكُ الْمُلُوكِ قُلُوبُ الْمُلُوكِ فِي يَدِي وَإِنَّ الْعِبَادَ إِذَا أَطَاعُونِي حَوَّلْتُ قُلُوبَ مُلُوكِهِمْ عَلَيْهِمْ بِالرَّحْمَةِ وَالرَّأْفَةِ وَإِنَّ الْعِبَادَ إِذَا عَصَوْنِي حَوَّلْتُ قُلُوبَهُمْ بِالسُّخْطَةِ وَالنِّقْمَةِ فَسَامُوهُمْ سُوءَ الْعَذَابِ فَلَا تَشْغَلُوا أَنْفُسَكُمْ بِالدُّعَاءِ عَلَى الْمُلُوكِ وَلَكِنِ اشْغَلُوا أَنْفُسَكُمْ بِالذِّكْرِ وَالتَّضَرُّعِ كَيْ أَكْفِيَكُمْ ملوكَكم «. رَوَاهُ أَبُو نُعَيْمٍ فِي» الْحِلْيَةِ \"","english":{"narrator":"","text":"Abud Darda’ reported God’s Messenger as saying that God most high says, \"I am God than whom there is no god, Master of kings, King of kings, in whose hands are the hearts of kings. When men obey me I turn the hearts of kings to them with mercy and gentleness, but when they disobey me I turn their hearts against them with displeasure and vengeance, and they inflict grievous punishment upon them. So do not occupy yourselves with invoking curses on kings, but occupy yourselves with remembrance of me and supplication that I may protect you against your kings.” \n\nAbu Nu'aim transmitted it in al-Hilya."}},{"id":61,"idInBook":61,"chapterId":18,"bookId":14,"arabic":"عَنْ أَبِي مُوسَى قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا بَعَثَ أَحَدًا مِنْ أَصْحَابِهِ فِي بَعْضِ أَمْرِهِ قَالَ: «بَشِّرُوا وَلَا تُنَفِّرُوا وَيَسِّرُوا وَلَا تُعَسِّرُوا»","english":{"narrator":"","text":"Abu Musa told that when God’s Messenger sent one of his companion’s to attend to some of his affairs he said, “Gladden people and do not scare them; make things easy and do not make them difficult. ’ \n\n(Bukhari and Muslim.)"}},{"id":62,"idInBook":62,"chapterId":18,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى الله عَلَيْهِ وَسلم: «يَسِّرُوا وَلَا تُعَسِّرُوا وَسَكِّنُوا وَلَا تُنَفِّرُوا»","english":{"narrator":"","text":"Anas reported God’s Messenger as saying, “Make things easy and do not make them difficult; make people calm and do not scare them.’’ \n\n(Bukhari and Muslim.)"}},{"id":63,"idInBook":63,"chapterId":18,"bookId":14,"arabic":"وَعَن ابنِ أَبِي بُرْدَةَ قَالَ: بَعَثَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَدَّهُ أَبَا مُوسَى وَمُعَاذًا إِلَى الْيَمَنِ فَقَالَ: «يَسِّرَا وَلَا تُعَسِّرَا وَبَشِّرَا وَلَا تُنَفِّرَا وَتَطَاوَعَا وَلَا تَخْتَلِفَا»","english":{"narrator":"","text":"Abu Burda* told that when the Prophet sent his grandfather Abu Musa and Mu'adh to the Yemen he said, “Make things easy and do not make them difficult; gladden and do not scare; comply with one another and do not disagree.” \n\n(Bukhari and Muslim.)\n\n* This should be Sa'id b. Abu Burda on his father’s authority. C f. Bukhari, Maghazi, 60."}},{"id":64,"idInBook":64,"chapterId":18,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" إِنَّ الْغَادِرَ يُنْصَبُ لَهُ لِوَاءٌ يَوْمَ الْقِيَامَةِ فَيُقَالُ: هَذِهِ غَدْرَةُ فُلَانِ بْنِ فُلَانٍ \"","english":{"narrator":"","text":"Ibn ‘Umar reported God’s Messenger as saying, “The perfidious one will have a standard set up for him on the day of resurrection, and announcement will be made that this is the perfidy* of so and so, the son of so and so.” \n\n(Bukhari and Muslim.)\n\n* This is explained as meaning the sign, result, or punishment of his perfidy."}},{"id":65,"idInBook":65,"chapterId":18,"bookId":14,"arabic":"وَعَنْ أَنَسٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لِكُلِّ غَادِرٍ لِوَاءٌ يومَ القيامةِ يُعرَفُ بِهِ»","english":{"narrator":"","text":"Anas reported the Prophet as saying, “Every perfidious one will have a standard on the day of resurrection by which he will be recognized.” \n\n(Bukhari and Muslim.)"}},{"id":66,"idInBook":66,"chapterId":18,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لِكُلِّ غَادِرٍ لِوَاءٌ عِنْدَ اسْتِهِ يَوْمَ الْقِيَامَةِ» . وَفِي رِوَايَةٍ: «لِكُلِّ غَادِرٍ لِوَاءٌ يَوْمَ الْقِيَامَةِ يُرْفَعُ لَهُ بِقَدْرِ غَدْرِهِ أَلا وَلَا غادر أعظم مِن أميرِ عامِّةٍ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Sa'id reported the Prophet as saying, “Every perfidious one will have a standard at his anus on the day of resurrection.” A version has, “On the day of resurrection every perfidious one will have a standard which will be raised for him according to the amount of his perfidy, and no one is more perfidious than the ruler of a community.” \n\nMuslim transmitted it."}},{"id":67,"idInBook":67,"chapterId":18,"bookId":14,"arabic":"عَنْ عَمْرِو بْنِ مُرَّةَ أَنَّهُ قَالَ لِمُعَاوِيَةَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: « (مَنْ وَلَّاهُ اللَّهُ شَيْئًا مِنْ أَمْرِ الْمُسْلِمِينَ فَاحْتَجَبَ دُونَ حَاجَتِهِمْ وَخَلَّتِهِمْ وَفَقْرِهِمُ احْتَجَبَ اللَّهُ دُونَ حَاجَتِهِ وَخَلَّتِهِ وَفَقْرِهِ» . فَجَعَلَ مُعَاوِيَةُ رَجُلًا عَلَى حَوَائِجِ النَّاسِ. رَوَاهُ أَبُو دَاوُدَ وَالتِّرْمِذِيُّ وَفِي رِوَايَةٍ لَهُ وَلِأَحْمَدَ: «أَغْلَقَ اللَّهُ لَهُ أَبْوَابَ السَّمَاءِ دُونَ خَلَّتِهِ وَحَاجَّتِهِ وَمَسْكَنَتِهِ»","english":{"narrator":"","text":"‘Amr b. Murra told that he said to Mu'awiya he had heard God’s Messenger say, \"If anyone is put by God in authority over any matter concerning the Muslims and turns away from dealing with their need, destitution and poverty, God will turn away from dealing with his need, destitution and poverty.” Mu'awiya then appointed a man to deal with the needs of the people. \n\nAbu Dawud and Tirmidhi transmitted it. A version by Ahmad and Tirmidhi has, “God will lock the gates of heaven upon his destitution, need and poverty.”"}},{"id":68,"idInBook":68,"chapterId":18,"bookId":14,"arabic":"عَنْ أَبِي الشَّمَّاخِ الْأَزْدِيِّ عَنِ ابْنِ عَمٍّ لَهُ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ أَتَى مُعَاوِيَةَ فَدَخَلَ عَلَيْهِ فَقَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنْ وَلِيَ مِنْ أَمْرِ النَّاسِ شَيْئًا ثُمَّ أَغْلَقَ بَابَهُ دُونَ الْمُسْلِمِينَ أَوِ الْمَظْلُومِ أَوْ ذِي الْحَاجَةِ أَغْلَقَ اللَّهُ دُونَهُ أَبْوَابَ رَحْمَتِهِ عِنْدَ حَاجَتِهِ وَفَقْرِهِ أَفْقَرَ مَا يَكُونُ إليهِ»","english":{"narrator":"","text":"Abush Shammakh al-Azdi was told by a cousin of his on his father’s side who was a companion of the Prophet that he had gone to Mu'awiya, entered his presence and told him he had heard God's Messenger say, \"If one who has been given any authority over the people locks his gate against Muslims, or one who has been wronged, or one who has a need, God will lock the gates of His mercy against him when he has a need or is in poverty, however much he is in need of Him.”\n\nBaihaqi transmitted in Shuab al iman."}},{"id":69,"idInBook":69,"chapterId":18,"bookId":14,"arabic":"وَعَنْ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ أَنَّهُ كَانَ إِذَا بَعَثَ عُمَّالَهُ شَرَطَ عَلَيْهِمْ: أَنْ لَا تَرْكَبُوا بِرْذَوْنًا وَلَا تَأْكُلُوا نَقِيًّا وَلَا تَلْبَسُوا رَقِيقًا وَلَا تُغْلِقُوا أَبْوَابَكُمْ دُونَ حَوَائِجِ النَّاسِ فَإِنْ فَعَلْتُمْ شَيْئًا مِنْ ذَلِكَ فَقَدْ حَلَّتْ بِكُمُ الْعُقُوبَةُ ثُمَّ يُشَيِّعُهُمْ. رَوَاهُمَا الْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَانِ","english":{"narrator":"","text":"When 'Umar b. al-Khattab sent out his governors he laid on them the condition that they should not ride a horse not of Arabian breed,* or eat white bread, or wear fine clothing, or shut their gates against the needs of the people, telling them that if they did any of these things punishment would befall them. Then he would accompany them some distance. \n\nBaihaqi transmitted in Shuab al iman.\n\n* Birdhaun. This word is used of a horse of poor breed, a horse not of Arab breed, or more specifically a Turkish horse. It is suggested that the reason for the wording is to warn governors against riding horses, this being a sign of pride. Prohibiting a breed considered second-rate makes it obvious that to ride horses of the best Arab breed would be even a greater sign of pride."}},{"id":70,"idInBook":70,"chapterId":18,"bookId":14,"arabic":"عَنْ أَبِي بَكْرَةَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَا يَقْضِيَنَّ حَكَمٌ بَيْنَ اثْنَيْنِ وَهُوَ غَضْبَانُ»","english":{"narrator":"","text":"Abu Bakra told that he heard God’s Messenger say, “No judge must give judgment between two people when he is angry.” \n\n(Bukhari and Muslim.)"}},{"id":71,"idInBook":71,"chapterId":18,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو وَأَبِي هُرَيْرَةَ قَالَا: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا حَكَمَ الْحَاكِمُ فَاجْتَهَدَ فَأَصَابَ فَلَهُ أَجْرَانِ وَإِذَا حَكَمَ فَاجْتَهَدَ فَأَخْطَأَ فلهُ أجرٌ واحدٌ»","english":{"narrator":"","text":"‘Abdallah b. ‘Amr and Abu Huraira reportad God’s Messenger as saying, “When a judge gives a decision having tried his best to decide correctly and is right, he will have a double reward; and when he gives a decision having tried his best to decide correctly and is wrong, he will have a single reward.” \n\n(Bukhari and Muslim.)"}},{"id":72,"idInBook":72,"chapterId":18,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مِنْ جُعِلَ قَاضِيًا بَيْنَ النَّاسِ فَقَدْ ذُبِحَ بِغَيْرِ سِكِّينٍ» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ","english":{"narrator":"","text":"Abu Huraira reported God’s Messenger as saying, “He who has been appointed a qadi among the people has been killed without a knife.”* \n\nAhmad, Tirmidhi, Abu Dawud and Ibn Majah transmitted it.\n\n*This phrase has troubled commentators. Perhaps the best explanation is that he will have reason to repent of his manner of life, for there are many traditions which express disapproval of undertaking such an office. A somewhat ingenious explanation is that his evil characteristics must be cut away, this being a kind of slaughter."}},{"id":73,"idInBook":73,"chapterId":18,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنِ ابْتَغَى الْقَضَاءَ وَسَأَلَ وُكِلَ إِلَى نَفْسِهِ وَمَنْ أُكْرِهَ عَلَيْهِ أَنْزَلَ اللَّهُ عَلَيْهِ مَلَكًا يُسَدِّدُهُ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُد وَابْن مَاجَه","english":{"narrator":"","text":"Anas reported God’s Messenger as saying, “If anyone desires and asks for the office of qadi he will be left to his own devices, but if anyone is forced to accept it God will send down an angle who will direct him aright.” \n\nTirmidhi, Abu Dawud and Ibn Majah transmitted it."}},{"id":74,"idInBook":74,"chapterId":18,"bookId":14,"arabic":"وَعَنْ بُرَيْدَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" الْقُضَاةُ ثَلَاثَةٌ: وَاحِدٌ فِي الْجَنَّةِ وَاثْنَانِ فِي النَّارِ فَأَمَّا الَّذِي فِي الْجَنَّةِ فَرَجُلٌ عَرَفَ الْحَقَّ فَقَضَى بِهِ وَرَجُلٌ عَرَفَ الْحَقَّ فَجَارَ فِي الْحُكْمِ فَهُوَ فِي النَّارِ وَرَجُلٌ قَضَى لِلنَّاسِ عَلَى جَهْلٍ فَهُوَ فِي النَّارِ \". رَوَاهُ أَبُو دَاوُدَ وَابْنُ مَاجَهْ","english":{"narrator":"","text":"Buraida reported God’s Messenger as saying, \"Qadis are of three types, one of whom will go to paradise and two to hell. The one who will go to paradise is a man who knows what is right and gives judgment accordingly; but a man who knows what is right and acts tyrannically in his judgment will go to hell, and a man who gives judgment for people when he is ignorant will go to hell.” \n\nAbu Dawud and Ibn Majah transmitted it."}},{"id":75,"idInBook":75,"chapterId":18,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ طَلَبَ قَضَاءَ الْمُسْلِمِينَ حَتَّى يَنَالَهُ ثُمَّ غَلَبَ عَدْلُهُ جَوْرَهُ فَلَهُ الْجَنَّةُ وَمَنْ غَلَبَ جَوْرُهُ عَدْلَهُ فَلَهُ النَّار» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Abu Huraira reported God’s Messenger as saying, “If anyone seeks the office of qadi among Muslims till he gets it and his justice prevails over his tyranny, he will go to paradise; but the man whose tyranny prevails over his justice will go to hell.\" \n\nAbu Dawud transmitted it."}},{"id":76,"idInBook":76,"chapterId":18,"bookId":14,"arabic":"وَعَنْ مُعَاذِ بْنِ جَبَلٍ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا بَعَثَهُ إِلَى الْيَمين قَالَ: «كَيْفَ تَقْضِي إِذَا عَرَضَ لَكَ قَضَاءٌ؟» قَالَ: أَقْضِي بِكِتَابِ اللَّهِ قَالَ: «فَإِنْ لَمْ تَجِدْ فِي كِتَابِ اللَّهِ؟» قَالَ: فَبِسُنَّةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «فَإِنْ لَمْ تَجِدْ فِي سُنَّةِ رَسُولِ اللَّهِ؟» قَالَ: أَجْتَهِدُ رَأْيِي وَلَا آلُو قَالَ: فَضَرَبَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى صَدْرِهِ وَقَالَ: «الْحَمْدُ لِلَّهِ الَّذِي وَفَّقَ رَسُولَ رَسُولِ اللَّهِ لِمَا يَرْضَى بِهِ رَسُولُ اللَّهِ» . رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد والدارمي","english":{"narrator":"","text":"Mu'adh b. Jabal told that when God’s Messenger sent him to the Yemen he asked him how he would judge when the occasion arose, and he replied that he would judge in accordance with God’s Book. He asked what he would do if he could not find guidance in God’s Book, and he replied that he would act in accordance with God’s Messenger’s sunnah. He asked what he would do if he could find no guidance in God’s Messenger’s sunnah, and he replied that he would do his best to form an opinion and spare no pains. God’s Messenger then tapped him on the breast and said, “Praise be to God who has disposed His Messenger’s Messenger to something with which God’s Messenger is pleased!\" \n\nTirmidhi, Abu Dawud and Darimi transmitted it."}},{"id":77,"idInBook":77,"chapterId":18,"bookId":14,"arabic":"عَن عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ: بَعَثَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْيَمَنِ قَاضِيًا فَقُلْتُ: يَا رَسُولَ اللَّهِ تُرْسِلُنِي وَأَنَا حَدِيثُ السِّنِّ وَلَا عِلْمَ لِي بِالْقَضَاءِ؟ فَقَالَ: «إِنَّ اللَّهَ سَيَهْدِي قَلْبَكَ وَيُثَبِّتُ لِسَانَكَ إِذَا تَقَاضَى إِلَيْكَ رَجُلَانِ فَلَا تَقْضِ لِلْأَوَّلِ حَتَّى تَسْمَعَ كَلَامَ الْآخَرِ فَإِنَّهُ أَحْرَى أَنْ يَتَبَيَّنَ لَكَ الْقَضَاءُ» . قَالَ: فَمَا شَكَكْتُ فِي قَضَاءٍ بَعْدُ. رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ","english":{"narrator":"‘Ali said:","text":"God's Messenger sent me to the Yemen as qadi and I said, “Messenger of God, are you sending me when I am young and have no knowledge of the duties of qadi He replied, “God will guide your heart and keep your tongue true. When two men bring a case before you do not decide in favour of the first till you hear what the other has to say, for it is best that you should have a clear idea of the best decision.\" He said he had no doubts about a decision afterwards. \n\nTirmidhi, Abu Dawud and Ibn Majah transmitted it."}},{"id":78,"idInBook":78,"chapterId":18,"bookId":14,"arabic":"عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" مَا مِنْ حَاكِمٍ يَحْكُمُ بَيْنَ النَّاسِ إِلَّا جَاءَ يَوْمَ الْقِيَامَةِ وَمَلَكٌ آخِذٌ بِقَفَاهُ ثُمَّ يَرْفَعُ رَأْسَهُ إِلَى السَّمَاءِ فَإِنْ قَالَ: أَلْقِهْ أَلْقَاهُ فِي مَهْوَاةٍ أَرْبَعِينَ خَرِيفًا \". رَوَاهُ أَحْمَدُ وَابْنُ مَاجَهْ والْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَان","english":{"narrator":"","text":"‘Abdallah b. Mas'ud reported God’s Messenger as saying, “No judge who pronounces judgment among men will fail to come on the day of resurrection with an angel holding the back of his neck. He* will then raise his head to heaven, and if God gives orders to cast him down, he will cast him into an abyss forty years deep.\" \n\nAhmad, Ibn Majah, and Baihaqi in Shu'ab al-lman transmitted it.\n\n*i.e. the angel."}},{"id":79,"idInBook":79,"chapterId":18,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَيَأْتِيَنَّ عَلَى الْقَاضِي الْعَدْلِ يومُ القيامةِ يَتَمَنَّى أَنَّهُ لَمْ يَقْضِ بَيْنَ اثْنَيْنِ فِي تَمْرَة قطّ» . رَوَاهُ أَحْمد","english":{"narrator":"","text":"‘A’isha reported God's Messenger as saying, “The day of resurrection will come to the just qadi and he will wish he had never given judgment between two men about a single date.”* \n\nAhmad transmitted it.\n\n\n* He will wish he had never given judgment even about the most insignificant matters."}},{"id":80,"idInBook":80,"chapterId":18,"bookId":14,"arabic":"وَعَنْ عَبْدُ اللَّهِ بْنِ أَبِي أَوْفَى قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ اللَّهَ مَعَ الْقَاضِي مَا لَمْ يَجُرْ فَإِذَا جَارَ تَخَلَّى عَنْهُ وَلَزِمَهُ الشَّيْطَانُ» . رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ وَفِي رِوَايَةٍ: «فَإِذَا جارَ وَكله إِلَى نَفسه»","english":{"narrator":"","text":"'Abdallah b. Abu Aufa reported God’s Messenger as saying, “God is with the qadi as long as he is not tyrannical, but when he is He departs from him and the devil attaches himself to him.” A version has, “When he is tyrannical He leaves him to his own devices.”\n\nTirmidhi and Ibn Majah transmitted it."}},{"id":81,"idInBook":81,"chapterId":18,"bookId":14,"arabic":"وَعَنْ سَعِيدِ بْنِ الْمُسَيَّبِ: أَنَّ مُسْلِمًا وَيَهُودِيًّا اخْتَصَمَا إِلَى عُمَرَ فَرَأَى الْحَقَّ لِلْيَهُودِيِّ فَقَضَى لَهُ عُمَرُ بِهِ فَقَالَ لَهُ الْيَهُودِيُّ: وَاللَّهِ لَقَدْ قَضَيْتَ بِالْحَقِّ فَضَرَبَهُ عُمَرُ بِالدِّرَّةِ وَقَالَ: وَمَا يُدْريكَ؟ فَقَالَ الْيَهُودِيُّ: وَاللَّهِ إِنَّا نَجِدُ فِي التَّوْرَاةِ أَنَّهُ لَيْسَ قَاضٍ يَقْضِي بِالْحَقِّ إِلَّا كَانَ عَنْ يَمِينِهِ مَلَكٌ وَعَنْ شِمَالِهِ مَلَكٌ يُسَدِّدَانِهِ وَيُوَفِّقَانِهِ لِلْحَقِّ مَا دَامَ مَعَ الْحَقِّ فَإِذَا تركَ الحقَّ عرَجا وترَكاهُ. رَوَاهُ مَالك","english":{"narrator":"","text":"Said b. al-Musayyib told that a Muslim and a Jew brought a dispute before ‘Umar, and as he considered the Jew was in the right he pronounced judgment in his favour; but when the Jew said, “I swear by God that you have pronounced just judgment,” he struck him with the whip and asked him what caused him to know that. The Jew replied, “I swear by God that we find in the Torah that no qadi judges rightly without having an angel at his right hand and an angel at his left who direct him and dispose him to what is right as long as he adheres to the right; but when he abandons the right they ascend and leave him.” \n\nMalik transmitted it."}},{"id":82,"idInBook":82,"chapterId":18,"bookId":14,"arabic":"وَعَنِ ابْنِ مَوْهَبٍ: أَنَّ عُثْمَانَ بْنِ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ قَالَ لِابْنِ عُمَرَ: اقْضِ بَين النَّاس قَالَ: أَو تعاقبني يَا أَمِيرَ الْمُؤْمِنِينَ؟ قَالَ: وَمَا تَكْرَهُ مِنْ ذَلِك وَقد كَانَ أَبوك قَاضِيا؟ قَالَ: لِأَنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنْ كَانَ قَاضِيًا فَقَضَى بِالْعَدْلِ فَبِالْحَرِيِّ أَنْ يَنْقَلِبَ مِنْهُ كَفَافًا» . فَمَا راجعَه بعدَ ذَلِك. رَوَاهُ التِّرْمِذِيّ\nوَفِي رِوَايَةِ رَزِينٍ عَنْ نَافِعٍ أَنَّ ابْنَ عُمَرَ قَالَ لِعُثْمَانَ: يَا أَمِيرَ الْمُؤْمِنِينَ لَا أَقْضِي بَيْنَ رَجُلَيْنِ: قَالَ: فَإِنَّ أَبَاكَ كَانَ يَقْضِي فَقَالَ: إِنَّ أَبِي لَوْ أُشْكِلَ عَلَيْهِ شَيْءٌ سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَوْ أُشْكِلَ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَيْءٌ سَأَلَ جِبْرِيلَ عَلَيْهِ السَّلَامُ وَإِنِّي لَا أَجِدُ مَنْ أَسْأَلُهُ وَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنْ عَاذَ بِاللَّهِ فَقَدْ عَاذَ بِعَظِيمٍ» . وَسَمِعْتُهُ يَقُولُ: «مَنْ عَاذَ بِاللَّهِ فَأَعِيذُوهُ» . وَإِنِّي أَعُوذُ باللَّهِ أنْ تجعلَني قاضِياً فأعْفاهُ وَقَالَ: لَا تُخبرْ أحدا","english":{"narrator":"","text":"Ibn Mauhib told that when ‘Uthman b. ‘Affan asked Ibn ‘Umar to act as qadi among the people he asked the commander of the faithful to excuse him. He asked him what objection he had to that when his father had been holding such an office, and he replied that it was because he had heard God’s Messenger say, “If anyone is a qadi and fulfils the office with justice he should rather turn away from it with neither credit nor blame.”* After that he did not ask him again. \n\nTirmidhi transmitted it. \n\n* Or, ‘without reward or punishment’.\n\nRazin’s version on the authority of Nafi' tells that Ibn ‘Umar said to ‘Uthman, “Commander of the faithful, I shall not pronounce judgment between two men.” He replied, “Your father used to do so.” He said, “If anything was dubious to my father he asked God’s Messenger, and if anything was dubious to God’s Messenger he asked Gabriel, but I can find no one to ask, and I heard God’s Messenger say, ‘He who seeks refuge in God has sought refuge in a great One.’ I also heard him say, ‘Grant refuge to him who seeks refuge in God’, and I seek refuge in God from your making me a qadi.\" So he excused him, but said, “Do not tell anyone.”\n\nRazin."}},{"id":83,"idInBook":83,"chapterId":18,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا أُعْطِيكُمْ وَلَا أَمْنَعُكُمْ أَنَا قَاسِمٌ أَضَعُ حَيْثُ أُمِرْتُ» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Abu Huraira reported God's Messenger as saying, “What I give you and do not withhold from you I am just distributing, putting it where I have been commanded.\" \n\nBukhari transmitted it."}},{"id":84,"idInBook":84,"chapterId":18,"bookId":14,"arabic":"وَعَن خَوْلةَ الْأَنْصَارِيَّةِ قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ رِجَالًا يَتَخَوَّضُونَ فِي مَالِ اللَّهِ بِغَيْرِ حَقٍّ فَلَهُمُ النَّارُ يَوْمَ الْقِيَامَةِ» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Khaula al-Ansariya reported God’s Messenger as saying, “Men will unjustly acquire for themselves property which belongs to God, and on the day of resurrection they will go to hell.\" \n\nBukhari transmitted it."}},{"id":85,"idInBook":85,"chapterId":18,"bookId":14,"arabic":"وَعَن عائشةَ قَالَتْ: لِمَّا اسْتُخْلِفَ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: لَقَدْ عَلِمَ قَوْمِي أَنَّ حِرْفَتِي لم تكنْ تعجِزُ عَن مَؤونةِ أَهْلِي وَشُغِلْتُ بِأَمْرِ الْمُسْلِمِينَ فَسَيَأْكُلُ آلُ أَبِي بَكْرٍ مِنْ هَذَا الْمَالِ وَيَحْتَرِفُ لِلْمُسْلِمِينَ فِيهِ. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"'A’isha told that when Abu Bakr became caliph he said, “My people know that my trade was not incapable of supporting my family, but I have become occupied with the affairs of the Muslims, so Abu Bakr’s family will be supported from this property while he works for it on behalf of the Muslims.\" \n\nBukhari transmitted it."}},{"id":86,"idInBook":86,"chapterId":18,"bookId":14,"arabic":"عَن بُرَيْدَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنِ اسْتَعْمَلْنَاهُ عَلَى عَمَلٍ فَرَزَقْنَاهُ رِزْقًا فَمَا أَخَذَ بَعْدَ ذَلِكَ فَهُوَ غُلُولٌ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Buraida reported the Prophet as saying, “When we appoint someone to an administrative post and provide him with an allowance, anything he takes beyond that is unfaithful dealing.\" \n\nAbu Dawud transmitted it."}},{"id":87,"idInBook":87,"chapterId":18,"bookId":14,"arabic":"وَعَنْ عُمَرَ رَضِيَ اللَّهُ عَنْهُ قَالَ: عَمِلْتُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فعملني. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"‘Umar said, “I held an administrative post in the time of God's Messenger, and he gave me payment for it.\" \n\nAbu Dawud transmitted it."}},{"id":88,"idInBook":88,"chapterId":18,"bookId":14,"arabic":"وَعَن مُعَاذٍ قَالَ: بَعَثَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْيَمَنِ فَلَمَّا سِرْتُ أَرْسَلَ فِي أَثَرِي فَرُدِدْتُ فَقَالَ: «أَتَدْرِي لِمَ بَعَثْتُ إِلَيْكَ؟ لَا تُصِيبَنَّ شَيْئًا بِغَيْرِ إِذْنِي فَإِنَّهُ غُلُولٌ وَمَنْ يَغْلُلْ يَأْتِ بِمَا غَلَّ يَوْمَ الْقِيَامَةِ لهَذَا دعوتك فَامْضِ لعملك» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"Mu'adh said:","text":"God’s Messenger sent me to the Yemen, but when I set off he sent after me and I was brought back. He then said, “Do you know why I sent for you? Do not take anything without my permission, for it is unfaithful dealing, and he who acts unfaithfully will come on the day of resurrection with the unfaithful deeds he has done. This is why I called you. Now go off to your task.\" \n\nTirmidhi transmitted it."}},{"id":89,"idInBook":89,"chapterId":18,"bookId":14,"arabic":"وَعَن المستَوْرِدِ بنِ شدَّادٍ قَالَ: سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنْ كَانَ لَنَا عَامِلًا فَلْيَكْتَسِبْ زَوْجَةً فَإِنْ لَمْ يَكُنْ لَهُ خَادِمٌ فَلْيَكْتَسِبْ خَادِمًا فَإِنْ لَمْ يَكُنْ لَهُ مَسْكَنٌ فَلْيَكْتَسِبْ مَسْكَنًا» . وَفِي رِوَايَةٍ: «مَنِ اتَّخَذَ غَيْرَ ذَلِكَ فَهُوَ غالٌّ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Al-Mustadrid b. Shaddad told that he heard the Prophet say, “He who acts as a governor for us must get a wife; if he has not a servant he must get one, and if he has not a dwelling he must get one.” A version says, “He who takes anything else than that is acting unfaithfully.” \n\nAbu Dawud transmitted it."}},{"id":90,"idInBook":90,"chapterId":18,"bookId":14,"arabic":"وَعَن عَدِيِّ بنِ عَمِيرةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «يَا أَيُّهَا النَّاسُ مَنْ عُمِّلَ مِنْكُمْ لَنَا عَلَى عَمَلٍ فَكَتَمَنَا مِنْهُ مِخْيَطًا فَمَا فَوْقَهُ فَهُوَ غَالٌّ يَأْتِي بِهِ يَوْمَ الْقِيَامَةِ» . فَقَامَ رَجُلٌ مِنَ الْأَنْصَارِ فَقَالَ: يَا رَسُولَ اللَّهِ اقْبَلْ عَنِّي عَمَلَكَ. قَالَ: «وَمَا ذَاكَ؟» قَالَ: سَمِعْتُكَ تَقُولُ: كَذَا وَكَذَا قَالَ: «وَأَنَا أَقُولُ ذَلِكَ مَنِ اسْتَعْمَلْنَاهُ عَلَى عَمَلٍ فَلْيَأْتِ بِقَلِيلِهِ وَكَثِيرِهِ فَمَا أُوتِيَ مِنْهُ أَخَذَهُ وَمَا نُهِيَ عَنْهُ انْتَهَى» . رَوَاهُ مُسْلِمٌ وَأَبُو دَاوُد وَاللَّفْظ لَهُ","english":{"narrator":"","text":"'Adi b. ‘Amira reported God’s Messenger as saying, “If any of you people is put in an administrative post on our behalf and conceals from us a needle or more, he is acting unfaithfully and will bring it on the day of resurrection.” One of the Ansar then got up and said, “Messenger of God, take back from me my post.” He asked what that meant and he told him he had heard him say such and such. He replied, “And I say that. If we appoint anyone to an office he must bring what is connected with it, both little and much. What he is given he may take, but he must refrain from what is kept away from him.” \n\nMuslim and Abu Dawud transmitted it, the wording being the latter’s."}},{"id":91,"idInBook":91,"chapterId":18,"bookId":14,"arabic":"وَعَن عبد الله بن عَمْرو قَالَ: لَعَنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم الرَّاشِيَ وَالْمُرْتَشِيَ. رَوَاهُ أَبُو دَاوُدَ وَابْنُ مَاجَهْ\nوَرَوَاهُ التِّرْمِذِيّ عَنهُ وَعَن أبي هُرَيْرَة\nوَرَوَاهُ أَحْمَدُ وَالْبَيْهَقِيُّ فِي «شُعَبِ الْإِيمَانِ» عَنِ ثَوْبَانَ وَزَادَ: «وَالرَّائِشَ» يَعْنِي الَّذِي يَمْشِي بَيْنَهُمَا","english":{"narrator":"","text":"'Abdallah b. ‘Amr told that God’s Messenger cursed the one who bribes and the one who takes bribes. \n\nAbu Dawud and Ibn Majah transmitted it. Tirmidhi transmitted it on ‘Abdallah’s authority and on that of Abu Huraira. Ahmad and Baihaqi, in Shu'ab al-iman, transmitted it on the authority of Thauban, who added that the raish is the go-between regarding a bribe."}},{"id":92,"idInBook":92,"chapterId":18,"bookId":14,"arabic":"وَعَن عَمْرِو بن العاصِ قَالَ: أَرْسَلَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَنِ اجْمَعْ عَلَيْكَ سِلَاحَكَ وَثِيَابَكَ ثُمَّ ائْتِنِي» قَالَ: فَأَتَيْتُهُ وَهُوَ يَتَوَضَّأُ فَقَالَ: «يَا عَمْرُو إِنِّي أَرْسَلْتُ إِلَيْكَ لِأَبْعَثَكَ فِي وُجْةٍ يُسَلِّمُكَ اللَّهُ وَيُغَنِّمُكَ وَأَزْعَبَ لَكَ زَعْبَةً مِنَ الْمَالِ» . فَقُلْتُ: يَا رَسُولَ اللَّهِ مَا كَانَتْ هِجْرَتِي لِلْمَالِ وَمَا كَانَتْ إِلَّا لِلَّهِ ولرسولِه قَالَ: «نِعِمَّا بِالْمَالِ الصَّالِحِ لِلرَّجُلِ الصَّالِحِ» . رَوَاهُ فِي «شَرْحِ السُّنَّةِ» وَرَوَى أَحْمَدُ نَحْوَهُ وَفِي روايتِه: قَالَ: «نِعْمَ المالُ الصَّالحُ للرَّجُلِ الصالحِ»","english":{"narrator":"‘Amr b. al-'As said:","text":"God’s Messenger sent ordering me to collect my weapons and clothing and come to him. I came to him when he was performing ablution, and he said, “I sent for you, ‘Amr, to dispatch you on a matter in which God will keep you safe and grant you booty, and I shall make you an allotment from the spoil.” I replied, “My emigration, Messenger of God, was not for the sake of property, but was only for the sake of God and His Messenger.” He said, “Honest property is good 1 for an honest man.” \n\nIt is transmitted in Sharh as- sunna, and Ahmad transmitted something similar. His version has “Good is honest property 2 for an honest man.”\n\n1. Ni'imma bil mal as-salih.\n2. Ni'ma’ al-mal as-salih."}},{"id":93,"idInBook":93,"chapterId":18,"bookId":14,"arabic":"عَنْ أَبِي أُمَامَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ شَفَعَ لِأَحَدٍ شَفَاعَةً فَأَهْدَى لَهُ هَدِيَّةً عَلَيْهَا فَقَبِلَهَا فَقَدْ أَتَى بَابًا عَظِيمًا مِنْ أَبْوَابِ الرِّبَا» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Abu Umama reported God’s Messenger as saying, “If anyone intercedes for, someone and that one gives him for it a present which he accepts, he has been guilty of a serious type-of usury.” \n\nAbu Dawud transmitted it."}},{"id":94,"idInBook":94,"chapterId":18,"bookId":14,"arabic":"عَنِ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَوْ يُعْطَى النَّاسُ بِدَعْوَاهُمْ لَادَّعَى نَاسٌ دِمَاءَ رِجَالٍ وَأَمْوَالَهُمْ وَلَكِنَّ الْيَمِينَ عَلَى الْمُدَّعَى عَلَيْهِ» . رَوَاهُ مُسْلِمٌ وَفِي «شَرْحِهِ لِلنَّوَوِيِّ» أَنَّهُ قَالَ: وَجَاءَ فِي رِوَايَةِ «الْبَيْهَقِيِّ» بِإِسْنَادٍ حَسَنٍ أَوْ صَحِيحٍ زِيَادَةٌ عَنِ ابْنِ عَبَّاسٍ مَرْفُوعًا: «لَكِنَّ الْبَيِّنَةَ على المدَّعي واليمينَ على مَنْ أنكر»","english":{"narrator":"","text":"Ibn ‘Abbas reported the Prophet as saying, “If people were given what they asked when they brought a case some would claim the lives and property of others; but the oath must be taken by the defendant.” \n\nMuslim transmitted it. In the commentary on his work by Nawawi it says that in Baihaqi’s version with an isnad which is hasan or sahih there is an addition on the authority of Ibn ‘Abbas which is traced to the Prophet, “But the proof lies on the plaintiff and the oath must be taken by him who rejects the claim.”"}},{"id":95,"idInBook":95,"chapterId":18,"bookId":14,"arabic":"وَعَنِ ابْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ حَلَفَ عَلَى يَمِينِ صَبْرٍ وَهُوَ فِيهَا فَاجِرٌ يَقْتَطِعُ بِهَا مَالَ امْرِئٍ مُسْلِمٍ لَقِيَ اللَّهَ يَوْمَ الْقِيَامَةِ وَهُوَ عَلَيْهِ غَضْبَانُ» فَأَنْزَلَ اللَّهُ تَصْدِيقَ ذَلِكَ: (إِنَّ الَّذِينَ يشترونَ بعهدِ اللَّهِ وأيمانِهمْ ثمنا قَلِيلا)\nإِلَى آخر الْآيَة","english":{"narrator":"","text":"Ibn Mas'ud reported God’s Messenger as saying, “If anyone swears a firm oath, 1 acting wickedly thereby, and appropriates by it property belonging to a Muslim, God will be angry when he meets Him on the day of resurrection.” And God has sent down the verification of that, “Those who barter for a small price God's covenant and their oaths”2. \n\n(Bukhari and Muslim.)\n\n1. Or an oath he is compelled to take.\n2. Al-Qur’an, 3:77"}},{"id":96,"idInBook":96,"chapterId":18,"bookId":14,"arabic":"وَعَنْ أَبِي أُمَامَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنِ اقْتَطَعَ حَقَّ امْرِئٍ مُسْلِمٍ بِيَمِينِهِ فَقَدْ أَوْجَبَ اللَّهُ لَهُ النَّارَ وَحَرَّمَ اللَّهُ عَلَيْهِ الْجَنَّةَ» فَقَالَ لَهُ رَجُلٌ: وَإِنْ كَانَ شَيْئا يسير يَا رَسُولَ اللَّهِ؟ قَالَ: «وَإِنْ كَانَ قَضِيبًا من أَرَاك» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Umama reported God’s Messenger as saying, “If anyone appropriates by his oath what rightly belongs to a Muslim, God has made hell necessary for him and deprived him of paradise.” A man asked God’s Messenger whether that applied even if it were a small amount, and he replied, “Even if it were a stick from an arak tree.” \n\nMuslim transmitted it."}},{"id":97,"idInBook":97,"chapterId":18,"bookId":14,"arabic":"وَعَنْ أُمِّ سَلَمَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّمَا أَنَا بَشَرٌ وَإِنَّكُمْ تَخْتَصِمُونَ إِلَيَّ وَلَعَلَّ بَعْضَكُمْ أَنْ يَكُونَ أَلْحَنَ بِحُجَّتِهِ مِنْ بَعْضٍ فَأَقْضِي لَهُ عَلَى نَحْوِ مَا أَسْمَعُ مِنْهُ فَمَنْ قَضَيْتُ لَهُ بِشَيْءٍ مِنْ حَقِّ أَخِيهِ فَلَا يَأْخُذَنَّهُ فَإِنَّمَا أَقْطَعُ لَهُ قِطْعَةً مِنَ النَّار»","english":{"narrator":"","text":"Umm Salama reported God’s Messenger as saying, “I am only a human being and you bring your disputes to me, some perhaps being more eloquent in their plea than others, so that I give judgment on their behalf according to what I hear from them. Therefore whatever I decide for anyone which by right belongs to his brother he must not take, for I am granting him only a portion of hell.” \n\n(Bukhari and Muslim.)"}},{"id":98,"idInBook":98,"chapterId":18,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ أَبْغَضَ الرِّجَالِ إِلَى اللَّهِ الْأَلَدُّ الخَصِمُ»","english":{"narrator":"","text":"‘A'isha reported God’s Messenger as saying, “The man who is most hateful to God is the one who quarrels and disputes most.” \n\n(Bukhari and Muslim.)"}},{"id":99,"idInBook":99,"chapterId":18,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ: أَنَّ رَسُولَ اللَّهِ صَلَّى الله عَلَيْهِ وَسلم قضى بِيَمِين وَشَاهد. رَوَاهُ مُسلم","english":{"narrator":"","text":"Ibn ‘Abbas said that God's Messenger gave a decision on the basis of an oath and a single witness. \n\nMuslim transmitted it."}},{"id":100,"idInBook":100,"chapterId":18,"bookId":14,"arabic":"وَعَنْ عَلْقَمَةَ بْنِ وَائِلٍ عَنْ أَبِيهِ قَالَ: جَاءَ رَجُلٌ مِنْ حَضْرَمَوْتَ وَرَجُلٌ مِنْ كِنْدَةَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ الْحَضْرَمِيُّ: يَا رَسُولَ اللَّهِ إِنَّ هَذَا غَلَبَنِي عَلَى أَرْضٍ لِي فَقَالَ الْكِنْدِيُّ: هِيَ أَرْضِي وَفِي يَدِي لَيْسَ لَهُ فِيهَا حَقٌّ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلْحَضْرَمِيِّ: «أَلَكَ بَيِّنَةٌ؟» قَالَ: لَا قَالَ: «فَلَكَ يَمِينُهُ» قَالَ: يَا رَسُولَ اللَّهِ إِنَّ الرَّجُلَ فَاجِرٌ لَا يُبَالِي عَلَى مَا حَلَفَ عَلَيْهِ وَلَيْسَ يَتَوَرَّعُ منْ شيءٍ قَالَ: «ليسَ لكَ مِنْهُ إِلَّا ذَلِكَ» . فَانْطَلَقَ لِيَحْلِفَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا أَدْبَرَ: «لَئِنْ حَلَفَ عَلَى مَالِهِ لِيَأْكُلَهُ ظُلْمًا لَيَلْقَيَنَّ اللَّهَ وَهُوَ عَنهُ معرض» . رَوَاهُ مُسلم","english":{"narrator":"","text":"‘Alqama b. Wa’il told on his father’s authority that a man from Hadramaut and man from Kinda came to the Prophet, the Hadrami saying, ‘‘Messenger of God, this man has seized land belonging to me,” and the Kindi saying, “It is my land and in my possession; he has no right to it.” The Prophet asked the Hadrami if he had any proof, but he replied that he had none, so he told him that he could have the other swear an oath. He replied, “Messenger of God, the man is a reprobate who would swear to anything and stick at nothing,” but he told him that that was his only recourse. The man went off to take an oath, and when he turned his back God’s Messenger said, “If he swears about his property to take it unjustly he will certainly find God turning away from him when he meets Him.” \n\nMuslim transmitted it."}},{"id":101,"idInBook":101,"chapterId":18,"bookId":14,"arabic":"وَعَنْ أَبِي ذَرٍّ رَضِيَ اللَّهُ عَنْهُ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنِ ادَّعَى مَا لَيْسَ لَهُ فَلَيْسَ مِنَّا وَلْيَتَبَوَّأْ مَقْعَدَهُ مِنَ النَّارِ» . رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"Abu Dharr told that he heard God’s Messenger say, “If anyone claims what is not his he does not belong to us, and let him come to his seat in hell.” \n\nMuslim transmitted it."}},{"id":102,"idInBook":102,"chapterId":18,"bookId":14,"arabic":"وَعَنْ زَيْدِ بْنِ خَالِدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَلَا أُخْبِرُكُمْ بِخَيْرِ الشُّهَدَاءِ؟ الَّذِي يَأْتِي بشهادتِه قبلَ أنْ يسْأَلهَا» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Zaid b. Khalid reported God’s Messenger as saying, “Shall I not tell you of the best witness? He is the one who produces his deposition before he is asked for it.” \n\nMuslim transmitted it."}},{"id":103,"idInBook":103,"chapterId":18,"bookId":14,"arabic":"وَعَنِ ابْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «خَيْرُ النَّاسِ قَرْنِي ثُمَّ الَّذِينَ يَلُونَهُمْ ثُمَّ الَّذِينَ يَلُونَهُمْ ثُمَّ يَجِيءُ قَوْمٌ تَسبِقُ شَهَادَة أحدِهمْ يَمِينه وَيَمِينه شَهَادَته»","english":{"narrator":"","text":"Ibn Mas'ud reported God’s Messenger as saying, “The best of men are my generation, then those who come next to them, then those who come next to them. Afterwards people will come who will give testimony before swearing an oath and swear an oath before giving testimony.” \n\n(Bukhari and Muslim.)"}},{"id":104,"idInBook":104,"chapterId":18,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَرَضَ عَلَى قَوْمٍ الْيَمِينَ فَأَسْرَعُوا فَأَمْرَ أَنْ يُسْهَمَ بَيْنَهُمْ فِي اليَمينِ أيُّهُمْ يحْلِفُ. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Abu Huraira told that the Prophet suggested to some people that they should swear an oath and when they hastened to do so he ordered that lots should be cast among them concerning the oath as to who should swear it. \n\nBukhari transmitted it."}},{"id":105,"idInBook":105,"chapterId":18,"bookId":14,"arabic":"عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْبَيِّنَةُ عَلَى الْمُدَّعِي وَالْيَمِينُ عَلَى الْمُدَّعَى عَلَيْهِ» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"‘Amr b. Shu'aib, on his father’s authority, told that his grandfather reported the Prophet as saying, “Proof lies on the plaintiff and the oath is to be sworn by the defendant.” \n\nTirmidhi transmitted it."}},{"id":106,"idInBook":106,"chapterId":18,"bookId":14,"arabic":"وَعَنْ أُمِّ سَلَمَةَ رَضِيَ اللَّهُ عَنْهَا عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: فِي رَجُلَيْنِ اخْتَصَمَا إِلَيْهِ فِي مَوَارِيثَ لَمْ تَكُنْ لَهُمَا بَيِّنَةٌ إِلَّا دَعْوَاهُمَا فَقَالَ: «مَنْ قَضَيْتُ لَهُ بِشَيْءٍ مِنْ حَقِّ أَخِيهِ فَإِنَّمَا أَقْطَعُ لَهُ قِطْعَةً مِنَ النَّارِ» . فَقَالَ الرَّجُلَانِ: كُلُّ وَاحِدٍ مِنْهُمَا: يَا رَسُولَ اللَّهِ حَقِّي هَذَا لِصَاحِبِي فَقَالَ: «لَا وَلَكِنِ اذْهَبَا فَاقْتَسِمَا وَتَوَخَّيَا الْحَقَّ ثُمَّ اسْتَهِمَا ثُمَّ لْيُحَلِّلْ كُلُّ وَاحِدٍ مِنْكُمَا صَاحِبَهُ» . وَفِي رِوَايَةٍ قَالَ: «إِنَّمَا أَقْضِي بَيْنَكُمَا برأيي فِيمَا لم يُنزَلْ عليَّ فِيهِ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Umm Salama told on the Prophet’s authority about two men, who brought a dispute before him about inheritances, but had no proof beyond their claim. He said, “If I give a decision in favour of one respecting what is rightly his brother’s I am allotting him only a portion of hell.” Thereupon both the men said, “Messenger of God, this right of mine may go to my brother,” but he replied, \"No; rather go and divide it up, aiming at what is right, then draw lots, and let each of you consider the other to have what is legitimately his.” In a version he said, “I judge between you only by my opinion regarding matters about which no revelation has been sent down to me.” \n\nAbu Dawud transmitted it."}},{"id":107,"idInBook":107,"chapterId":18,"bookId":14,"arabic":"وَعَن جابرِ بن عبدِ الله: أَنَّ رَجُلَيْنِ تَدَاعَيَا دَابَّةً فَأَقَامَ كُلُّ وَاحِدٍ مِنْهُمَا الْبَيِّنَةَ أَنَّهَا دَابَّتُهُ نَتَجَهَا فَقَضَى بِهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلَّذِي فِي يدِهِ. رَوَاهُ فِي «شرح السّنة»","english":{"narrator":"","text":"Jabir b. ‘Abdallah told that two men claimed an animal and both of them brought proof that it was his animal, the offspring of one of his beasts. God’s Messenger then gave his decision that it should go to the one who had it in his possession. \n\nIt is transmitted in Sharh as-sunna."}},{"id":108,"idInBook":108,"chapterId":18,"bookId":14,"arabic":"وَعَن أبي مُوسَى الأشعريِّ: أَنَّ رَجُلَيْنِ ادَّعَيَا بَعِيرًا عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَبَعَثَ كُلُّ وَاحِدٍ مِنْهُمَا شَاهِدَيْنَ فَقَسَّمَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَهُمَا نِصْفَيْنِ. رَوَاهُ أَبُو دَاوُدَ وَفِي رِوَايَةٍ لَهُ وَلِلنَّسَائِيِّ وَابْنِ مَاجَهْ: أَنَّ رَجُلَيْنِ ادَّعَيَا بَعِيرًا لَيْسَتْ لِوَاحِدٍ مِنْهُمَا بَيِّنَةٌ فَجَعَلَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَهُمَا","english":{"narrator":"","text":"Abu Musa al-Ash'ari told that two men laid claim to a camel in the time of God’s Messenger and both of them sent two witnesses, so the Prophet divided it in halves between them.* \n\nAbu Dawud transmitted it. A version by Nasa’i, Ibn Majah and him says that two men laid claim to a camel, but as neither of them could produce proof the Prophet declared they should share it equally.\n\n* I have kept closely to the Arabic in this translation because the alternative version follows immediately afterwards. The meaning of both versions is the same, viz. that both men were to have equal use of the camel."}},{"id":109,"idInBook":109,"chapterId":18,"bookId":14,"arabic":"وَعَن أبي هريرةَ أنَّ رجُلينِ اختَصما فِي دَابَّة وَلَيْسَ لَهما بَيِّنَةٌ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «استهِما على اليَمينِ» . رَوَاهُ أَبُو دَاوُد وابنُ مَاجَه","english":{"narrator":"","text":"Abu Huraira told that two men disputed about an animal but could produce no proof, so the Prophet said, “Cast lots about the oath.” \n\nAbu Dawud and Ibn Majah transmitted it."}},{"id":110,"idInBook":110,"chapterId":18,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِرَجُلٍ حَلَّفَهُ: «احْلِفْ بِاللَّهِ الَّذِي لَا إِلَهَ إِلَّا هُوَ مَاله عِنْدَكَ شَيْءٌ» يُعْنَى لِلْمُدَّعِي. رَوَاهُ أَبُو دَاوُدَ","english":{"narrator":"","text":"Ibn ‘Abbas told that the Prophet said to a man whom he had asked to take an oath, “Swear by God than Whom there is no god that you have nothing belonging to him,” i.e. the plaintiff. \n\nAbu Dawud transmitted it."}},{"id":111,"idInBook":111,"chapterId":18,"bookId":14,"arabic":"وَعَن الأشعثِ بنِ قيسٍ قَالَ: كَانَ بَيْنِي وَبَيْنَ رَجُلٍ مِنَ الْيَهُودِ أرضٌ فحَجَدني فَقَدَّمْتُهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «أَلَكَ بَيِّنَةٌ؟» قُلْتُ: لَا قَالَ لِلْيَهُودِيِّ: «احْلِفْ» قُلْتُ: يَا رَسُولَ اللَّهِ إِذَنْ يَحْلِفَ وَيَذْهَبَ بِمَالِي فَأَنْزَلَ اللَّهُ تَعَالَى: (إِنَّ الَّذِينَ يشترونَ بعهدِ اللَّهِ وأَيمانِهِم ثمنا قَلِيلا)\nالْآيَة. رَوَاهُ أَبُو دَاوُد وَابْن مَاجَه","english":{"narrator":"Al-Ash‘ath b. Qais said:","text":"A Jew and I shared some land and he denied my right, so I took him to the Prophet who asked me whether I had any proof. When I replied that I had none and he told the Jew to swear an oath, I said, “Messenger of God, he will swear an oath and go off with my property.” Then God most high sent down, “Those who barter for a small price God’s covenant and their oaths . . .” (Al-Qur’an, 3:77)\n\nAbu Dawud and Ibn Majah transmitted it."}},{"id":112,"idInBook":112,"chapterId":18,"bookId":14,"arabic":"وَعَنْهُ أَنْ رَجُلًا مَنْ كِنْدَةَ وَرَجُلًا مِنْ حَضْرَمَوْتَ اخْتَصَمَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي أَرْضٍ مِنَ الْيَمَنِ فَقَالَ الْحَضْرَمِيُّ: يَا رَسُولَ اللَّهِ إِنَّ أَرْضِي اغْتَصَبَنِيهَا أَبُو هَذَا وَهَى فِي يَدِهِ قَالَ: «هَلْ لَكَ بَيِّنَةٌ؟» قَالَ: لَا وَلَكِنْ أُحَلِّفُهُ وَاللَّهِ مَا يَعْلَمُ أَنَّهَا أَرْضِي اغْتَصَبَنِيهَا أَبُوهُ؟ فَتَهَيَّأَ الْكِنْدِيُّ لِلْيَمِينِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَقْطَعُ أَحَدٌ مَالًا بِيَمِينٍ إِلَّا لَقِيَ اللَّهَ وَهُوَ أَجْذَمُ» فَقَالَ الْكِنْدِيُّ: هِيَ أرضُهُ. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"He told that a man of Kinda and a man of Hadramaut brought a dispute before God’s Messenger about land in the Yemen. The Hadrami said, “Messenger of God, this man’s father took my land forcibly from me, and it is in his hands.” He asked him if he had any proof, and he replied, “No, but I shall require him to swear by God he does not know it is my land which his father took forcibly from me.” The Kindi was prepared to take the oath, but when God’s Messenger said, “Anyone who appropriates property by an oath will meet God in a maimed condition,” the Kindi said, “It is his land.” \n\nAbu Dawud transmitted it."}},{"id":113,"idInBook":113,"chapterId":18,"bookId":14,"arabic":"وَعَن عبدِ اللَّهِ بنِ أُنَيْسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ مِنْ أَكْبَرِ الْكَبَائِرِ الشِّرْكَ بِاللَّهِ وَعُقُوقَ الْوَالِدَيْنِ وَالْيَمِينَ الْغَمُوسَ وَمَا حَلَفَ حَالِفٌ بِاللَّهِ يَمِينَ صَبْرٍ فَأَدْخَلَ فِيهَا مِثْلَ جَنَاحِ بَعُوضَةٍ إِلَّا جُعِلَتْ نُكْتَةً فِي قَلْبِهِ إِلَى يَوْمِ الْقِيَامَةِ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ غَرِيب","english":{"narrator":"","text":"‘Abdallah b. Unais reported God’s Messenger as saying, “Among the most serious of major sins are attributing a partner to God, unfilial behaviour, and deliberate perjury. If anyone swears an oath which he is compelled to take (or a firm oath) and introduces into it as much falsehood as a gnat’s wing, a spot will be put in his heart till the day of resurrection.” \n\nTirmidhi transmitted it, saying this is a gharib tradition."}},{"id":114,"idInBook":114,"chapterId":18,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَحْلِفُ أَحَدٌ عِنْدَ مِنْبَرِي هَذَا عَلَى يَمِينٍ آثِمَةٍ وَلَوْ عَلَى سِوَاكٍ أَخْضَرَ إِلَّا تَبَوَّأَ مَقْعَدَهُ مِنَ النَّارِ أَوْ وَجَبَتْ لَهُ النَّارُ» . رَوَاهُ مَالِكٌ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ","english":{"narrator":"","text":"Jabir reported God’s Messenger as saying, “If anyone swears a false oath near this pulpit of mine, even though it be about a green tooth stick, he will come to his place in hell,” or, “he will certainly go to hell.” \n\nMalik, Abu Dawud and Ibn Majah transmitted."}},{"id":115,"idInBook":115,"chapterId":18,"bookId":14,"arabic":"فاتكٍ قَالَ: صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الصُّبْحِ فَلَمَّا انْصَرَفَ قَامَ قَائِمًا فَقَالَ: «عُدِلَتْ شَهَادَةُ الزُّورِ بِالْإِشْرَاكِ بِاللَّهِ» ثَلَاثَ مَرَّاتٍ. ثُمَّ قَرَأَ: (فَاجْتَنِبُوا الرِّجْسَ مِنَ الْأَوْثَانِ وَاجْتَنِبُوا قَوْلَ الزُّورِ حُنَفَاءَ لِلَّهِ غَيْرَ مُشْرِكِينَ بهِ)\nرَوَاهُ أَبُو دَاوُد وَابْن مَاجَه\nوَرَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ عَنْ أَيْمَنَ بْنِ خُرَيْمٍ إِلَّا أَنَّ ابْنَ مَاجَهْ لَمْ يَذْكُرِ الْقِرَاءَةَ","english":{"narrator":"","text":"Khuraim o. Fatik told that when God’s Messenger had finished praying the morning prayer he stood up and said three times, “False witness has been made equivalent to attributing a partner to God. He then recited, “So avoid the abomination of idols and avoid spreading falsehood as people pure of faith to God, not associating anything with Him.\" (Al-Qur’an, 22:30)\n\nAbu Dawud and Ibn Majah transmitted it and Ahmad and Tirmidhi transmitted it on the authority of Aiman b. Khuraim. Ibn Majah did not mention what he recited."}},{"id":116,"idInBook":116,"chapterId":18,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَجُوزُ شَهَادَةُ خَائِنٍ وَلَا خَائِنَةٍ وَلَا مَجْلُودٍ حَدًّا وَلَا ذِي غِمْرٍ عَلَى أَخِيهِ وَلَا ظَنِينٍ فِي وَلَاءٍ وَلَا قَرَابَةٍ وَلَا الْقَانِعِ مَعَ أَهْلِ الْبَيْتِ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حديثٌ غريبٌ ويزيدُ بن زيادٍ الدِّمَشْقِي الرَّاوِي مُنكر الحَدِيث","english":{"narrator":"","text":"‘A’isha reported God’s Messenger as saying, “The testimony of a deceitful man or woman, or of one who has been flogged for transgressing the bounds set by God, or of one who harbours rancour against his brother, or of one suspected regarding the patrons he claims or relationship, or of one who is dependent on a family is not allowable.\"\n\nTirmidhi transmitted it, saying this is a gharib tradition and that the traditions of Yazid b. Ziyad ad-Dimashqi, the transmitter, are rejected."}},{"id":117,"idInBook":117,"chapterId":18,"bookId":14,"arabic":"وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا تَجُوزُ شَهَادَةُ خَائِنٍ وَلَا خَائِنَةٍ وَلَا زَانٍ وَلَا زَانِيَةٍ وَلَا ذِي غِمْرٍ عَلَى أَخِيهِ» . وَرَدَّ شَهَادَةَ الْقَانِعِ لِأَهْلِ الْبَيَتْ. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"‘Amr b. Shu'aib, on his father’s authority, told that his grandfather reported the Prophet as saying, “The testimony of a deceitful man or woman, or of an immoral man or woman, or of one who harbours rancour against his brother is not allowable,\" and he rejected the testimony of one who is dependent on a family. \n\nAbu Dawud transmitted it."}},{"id":118,"idInBook":118,"chapterId":18,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا تَجُوزُ شَهَادَةُ بَدَوِيٍّ عَلَى صَاحِبِ قَرْيَةٍ» . رَوَاهُ أَبُو دَاوُدَ وَابْنُ مَاجَه","english":{"narrator":"","text":"Abu Huraira reported God's Messenger as saying, “The testimony of a nomadic Arab against a townsman is not allowable.\" \n\nAbu Dawud and Ibn Majah transmitted it."}},{"id":119,"idInBook":119,"chapterId":18,"bookId":14,"arabic":"وَعَنْ عَوْفِ بْنِ مَالِكٍ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى بَيْنَ رَجُلَيْنِ فَقَالَ الْمَقْضِيُّ عَلَيْهِ لَمَّا أَدْبَرَ: حَسْبِيَ اللَّهُ وَنِعْمَ الْوَكِيلُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" إِنَّ اللَّهَ تَعَالَى يَلُومُ عَلَى الْعَجْزِ وَلَكِنْ عَلَيْكَ بِالْكَيْسِ فَإِذَا غَلَبَكَ أَمْرٌ فَقُلْ: حَسْبِيَ اللَّهُ ونِعْمَ الوكيلُ \". رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"‘Auf b. Malik told that the Prophet gave a decision between two men and that when the one against whom the decision had been given turned away he said, “My sufficiency is God, and good is the Guardian.\" Thereupon the Prophet said, “God most high blames for falling short, hut apply intelligence, and when a matter gets the better of you say, 'My sufficiency is God, and good is the Guardian’. (Al-Qur’an, 3:173) \n\nAbu Dawud transmitted it."}},{"id":120,"idInBook":120,"chapterId":18,"bookId":14,"arabic":"وَعَنْ بَهْزِ بْنِ حَكِيمٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَبَسَ رَجُلًا فِي تُهْمَةٍ. رَوَاهُ أَبُو دَاوُدَ وزادَ التِّرْمِذِيّ وَالنَّسَائِيّ: ثمَّ خَلّى عَنهُ","english":{"narrator":"","text":"Bahz b. Hakim, on his father’s authority, said his grandfather told that the Prophet imprisoned a man on suspicion.\n\nAbu Dawud transmitted it, and Tirmidhi and Nasa’i added that afterwards let him go."}},{"id":121,"idInBook":121,"chapterId":18,"bookId":14,"arabic":"عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: قَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ الْخَصْمَيْنِ يَقْعُدَانِ بَيْنَ يَدَيِ الْحَاكِمِ. رَوَاهُ أَحْمَدُ وَأَبُو دَاوُدَ","english":{"narrator":"","text":"‘Abdallah b. az-Zubair told that God’s Messenger gave the decision that the two adversaries should be made to sit in front of the judge. \n\nAhmad and Abu Dawud transmitted it."}}],"chapter":{"id":18,"bookId":14,"arabic":"كتاب الإمارة والقضاء","english":"The Offices of Commander and Qadi"}}