{"metadata":{"length":273,"arabic":{"title":"مشكاة المصابيح","author":"الإمام الكاتب التبريزي","introduction":"كتاب الجهاد"},"english":{"title":"Mishkat al-Masabih","author":"Al-Khatib Al-Tabrizi","introduction":"Jihad"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":19,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ آمَنَ بِاللَّهِ وَرَسُولِهِ وَأَقَامَ الصَّلَاةَ وَصَامَ رَمَضَانَ كَانَ حَقًّا عَلَى اللَّهِ أَنْ يُدْخِلَهُ الْجَنَّةَ جَاهَدَ فِي سهل اللَّهِ أَوْ جَلَسَ فِي أَرْضِهِ الَّتِي وُلِدَ فِيهَا» . قَالُوا: أفَلا نُبشِّرُ النَّاسَ؟ قَالَ: «إِنَّ فِي الْجَنَّةِ مِائَةَ دَرَجَةٍ أَعَدَّهَا اللَّهُ لِلْمُجَاهِدِينَ فِي سَبِيلِ اللَّهِ مَا بَيْنَ الدَّرَجَتَيْنِ كَمَا بَيْنَ السَّمَاءِ وَالْأَرْضِ فَإِذَا سَأَلْتُمُ اللَّهَ فَاسْأَلُوهُ الْفِرْدَوْسَ فَإِنَّهُ أَوْسَطُ الْجَنَّةِ وَأَعْلَى الْجَنَّةِ وَفَوْقَهُ عَرْشُ الرَّحْمَنِ وَمِنْهُ تُفَجَّرُ أنهارُ الجنَّةِ» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Abu Huraira reported God’s Messenger as saying, “If anyone believes in God and His Messenger, observes the prayer and fasts during Ramadan, God will assuredly bring him into paradise whether he has engaged in jihad in God’s path or remained in his land in which he was born.” On being asked whether people should not be given this good news he replied, “In paradise there are a hundred degrees which God has prepared for those who engage in jihad in God’s path, between each pair of which there is a distance like that between heaven and earth; so when you make requests of God ask him for Firdaus, for it is the best and highest part of paradise, above it is the throne of the Compassionate One, and from it the rivers of paradise issue.” \n\nBukhari transmitted it."}},{"id":2,"idInBook":2,"chapterId":19,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَثَلُ الْمُجَاهِدِ فِي سَبِيلِ اللَّهِ كَمَثَلِ الصَّائِمِ الْقَائِمِ الْقَانِتِ بِآيَاتِ اللَّهِ لَا يَفْتُرُ مِنْ صِيَامٍ وَلَا صَلَاةٍ حَتَّى يَرْجِعَ الْمُجَاهِدُ فِي سَبِيلِ اللَّهِ»","english":{"narrator":"","text":"He reported God’s Messenger as saying, “He who engages in jihad in God’s path is like him who fasts and spends the night in prayer, who assiduously recites God’s verses and does not slacken from fasting and prayer until he who is engaged in jihad in God’s path returns.” \n\n(Bukhari and Muslim.)"}},{"id":3,"idInBook":3,"chapterId":19,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «انْتَدَبَ اللَّهُ لِمَنْ خَرَجَ فِي سَبِيلِهِ لَا يُخْرِجُهُ إِلَّا إِيمَانٌ بِي وَتَصْدِيقٌ بِرُسُلِي أَنْ أَرْجِعَهُ بِمَا نَالَ مِنْ أَجْرٍ وَغَنِيمَةٍ أَوْ أُدْخِلَهُ الْجَنَّةَ»","english":{"narrator":"","text":"He reported God’s Messenger as saying, “God answers the prayer for forgiveness of him who goes out in His path, being led to do so by nothing but faith in Him and belief in His Messengers, promising to bring him back with the reward or booty he obtains, or bring him into paradise.” \n\n(Bukhari and Muslim.)"}},{"id":4,"idInBook":4,"chapterId":19,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «وَالَّذِي نَفْسِي بِيَدِهِ لَوْلَا أَنَّ رِجَالًا مِنَ الْمُسْلِمِينَ لَا تَطِيبُ أَنْفُسُهُمْ أَنْ يَتَخَلَّفُوا عَنِّي وَلَا أَجِدُ مَا أَحْمِلُهُمْ عَلَيْهِ مَا تَخَلَّفْتُ عَنْ سَرِيَّةٍ تَغْزُو فِي سَبِيلِ اللَّهِ وَالَّذِي نَفْسِي بِيَدِهِ لَوَدِدْتُ أنْ أُقتَلَ فِي سَبِيل الله ثمَّ أُحْيى ثمَّ أُقتَلُ ثمَّ أُحْيى ثمَّ أُقتَلُ ثمَّ أُحْيى ثمَّ أقتل»","english":{"narrator":"","text":"He reported God’s Messenger as saying, “By Him in whose hand my soul is, were it not that men among the believers are not satisfied with remaining behind me when I cannot get mounts for them, I would not stay behind when an expedition goes out in God’s path. By Him in whose hand my soul is, I wish I could be killed in God’s path and brought to life, then be killed and brought to life, then be killed and brought to life, then be killed.” \n\n(Bukhari and Muslim.)"}},{"id":5,"idInBook":5,"chapterId":19,"bookId":14,"arabic":"وَعَنْ سَهْلِ بْنِ سَعْدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «رِبَاطُ يَوْمٍ فِي سَبِيلِ اللَّهِ خَيْرٌ مِنَ الدُّنْيَا وَمَا عَلَيْهَا»","english":{"narrator":"","text":"Sahl b. Sa'd reported God’s Messenger as saying, “Being stationed on the frontier in God’s path for a day is better than the world and what is on it.” \n\n(Bukhari and Muslim.)"}},{"id":6,"idInBook":6,"chapterId":19,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَغَدْوَةٌ فِي سَبِيلِ اللَّهِ أَوْ رَوْحَةٌ خَيْرٌ مِنَ الدُّنْيَا وَمَا فِيهَا»","english":{"narrator":"","text":"Anas reported God’s Messenger as saying, “A morning or an evening expedition in God’s path is better than the world and what it contains.” \n\n(Bukhari and Muslim.)"}},{"id":7,"idInBook":7,"chapterId":19,"bookId":14,"arabic":"وَعَن سلمانَ الفارسيِّ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «رِبَاطُ يَوْمٍ وَلَيْلَةٍ فِي سَبِيلِ اللَّهِ خَيْرٌ مِنْ صِيَامِ شَهْرٍ وَقِيَامِهِ وَإِنْ مَاتَ جَرَى عَلَيْهِ عَمَلُهُ الَّذِي كَانَ يَعْمَلُهُ وَأُجْرِيَ عَلَيْهِ رِزْقُهُ وَأَمِنَ الْفَتَّانَ» . رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"Salman al-Fairisi told that he heard God’s Messenger say, “Being stationed for a day and a night on the frontier in God’s path is better than fasting a month and spending its nights in prayer. If one dies he will be rewarded for the deeds he was doing, he will be given his provision, and will be safe from him who tests him.”* \n\n* Al-fattan. There is some doubt as to the reference here. It may be the devil, this name being used because he tempts people to sin; or it may mean the one who examines men in the grave. Munkar and Nakir are called fattana'l-qabr, the two who test men in the grave.\n\nMuslim transmitted it."}},{"id":8,"idInBook":8,"chapterId":19,"bookId":14,"arabic":"وَعَن أبي عَبْسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا اغْبَرَّتْ قَدَمَا عَبْدٍ فِي سَبِيلِ الله فَتَمَسهُ النَّار» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Abu ‘Abs reported God’s Messenger as saying, “No man whose feet become dusty in God’s path will be touched by hell.” \n\nBukhari transmitted it."}},{"id":9,"idInBook":9,"chapterId":19,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يَجْتَمِعُ كَافِرٌ وَقَاتِلُهُ فِي النَّارِ أبدا» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Huraira reported God's Messenger as saying, “An infidel and the one who killed him will never be brought together in hell.”* \n\n* The meaning is probably that one who kills an infidel in the course of jihad will on that account have his sins forgiven, and will therefore not go to hell where the infidel inevitably goes.\n\nMuslim transmitted it."}},{"id":10,"idInBook":10,"chapterId":19,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مِنْ خَيْرِ مَعَاشِ النَّاسِ لَهُمْ رَجُلٌ مُمْسِكٌ عِنَانَ فَرَسِهِ فِي سَبِيلِ اللَّهِ يَطِيرُ عَلَى مَتْنِهِ كُلَّمَا سَمِعَ هَيْعَةً أَوْ فَزْعَةً طَارَ عَلَيْهِ يَبْتَغِي الْقَتْلَ وَالْمَوْتَ مَظَانَّهُ أَوْ رَجُلٌ فِي غُنَيْمَةٍ فِي رَأْسِ شَعَفَةٍ مِنْ هَذِهِ الشَّعَفِ أَوْ بَطْنِ وَادٍ مِنْ هَذِهِ الْأَوْدِيَةِ يُقِيمُ الصَّلَاةَ وَيُؤْتِي الزَّكَاةَ وَيَعْبُدُ الله حَتَّى يَأْتِيَهُ الْيَقِينُ لَيْسَ مِنَ النَّاسِ إِلَّا فِي خير» . رَوَاهُ مُسلم","english":{"narrator":"","text":"He reported God’s Messenger as saying, “One of the best types of subsistence is that of a man who grasps his horse’s rein in (God’s path and races on its back, making for the places where being killed and dying are liable to take place as often as he hears a terrible shout or a cry for help; or of a man with a few sheep on one of these highlands or down in one of these wadis who observes prayer, pays the zakat and worships his Lord till death* comes. Such a one is in a good condition among men.” \n\n* Al-yaqin, the certainty.\n\nMuslim transmitted it."}},{"id":11,"idInBook":11,"chapterId":19,"bookId":14,"arabic":"وَعَن زيد بن خالدٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ جَهَّزَ غَازِيًا فِي سَبِيلِ اللَّهِ فَقَدْ غَزَا وَمَنْ خَلَفَ غَازِيًا فِي أَهْلِهِ فقد غزا»","english":{"narrator":"","text":"Zaid b. Khalid reported God’s Messenger as saying, “He who equips a fighter in God’s path has taken part in the fighting, and he who looks after a fighter's family when he is away has taken part in the fighting.\" \n\n(Bukhari and Muslim.)"}},{"id":12,"idInBook":12,"chapterId":19,"bookId":14,"arabic":"وَعَنْ بُرَيْدَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «حُرْمَةُ نِسَاءِ الْمُجَاهِدِينَ عَلَى الْقَاعِدِينَ كَحُرْمَةِ أُمَّهَاتِهِمْ وَمَا مِنْ رَجُلٍ مِنَ الْقَاعِدِينَ يَخْلُفُ رَجُلًا مِنَ الْمُجَاهِدِينَ فِي أَهْلِهِ فَيَخُونُهُ فِيهِمْ إِلَّا وُقِفَ لَهُ يَوْمَ الْقِيَامَةِ فيأخذُ مِنْ عَمَلِهِ مَا شَاءَ فَمَا ظَنُّكُمْ؟» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Buraida reported God's Messenger as saying, “The respect to be shown by those who stay at home to the women of those who are engaged in jihad is to be like that shown to their mothers. If any man among those who stay at home is entrusted with the oversight of his family by one who is engaged in jihad and betrays him, he will be set up for him* on the day of resurrection and he may take what he wants from his good deeds. So what do you think?” \n\n*i.e. the betrayer for the man he has betrayed.\n\nMuslim transmitted it."}},{"id":13,"idInBook":13,"chapterId":19,"bookId":14,"arabic":"وَعَن أبي مَسْعُود الْأنْصَارِيّ قَالَ: جَاءَ رَجُلٌ بِنَاقَةٍ مَخْطُومَةٍ فَقَالَ: هَذِهِ فِي سَبِيلِ اللَّهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَكَ بِهَا يَوْمَ الْقِيَامَةِ سَبْعمِائة نَاقَة كلهَا مخطومة» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Mas'ud al-Ansari told that a man brought a she-camel with a rope through its nose-ring and said, “This is to be devoted to God’s path.\" God’s Messenger replied to him, “On the day of resurrection you will get for it seven hundred she-camels each with a rope through its nose-ring.” \n\nMuslim transmitted it."}},{"id":14,"idInBook":14,"chapterId":19,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَ بَعْثًا إِلَى بَنِي لِحْيَانَ مِنْ هُذَيْلٍ فَقَالَ: «لينبعثْ مِنْ كلِّ رجلينِ أحدُهما والأجرُ بَينهمَا» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Sa'id told that God’s Messenger sent an expedition to the B. Lihyan who were a section or Hudhail, saying that one out of every two men should be sent but that both should share the reward. \n\nMuslim transmitted it."}},{"id":15,"idInBook":15,"chapterId":19,"bookId":14,"arabic":"وَعَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَنْ يَبْرَحَ هَذَا الدِّينُ قَائِمًا يُقَاتِلُ عَلَيْهِ عِصَابَةٌ مِنَ الْمُسْلِمِينَ حَتَّى تقوم السَّاعَة» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Jabir b. Samura reported God’s Messenger as saying, “This religion will not cease to endure with a company of the Muslims fighting on its behalf till the last hour comes.” \n\nMuslim transmitted it."}},{"id":16,"idInBook":16,"chapterId":19,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يُكَلَّمُ أَحَدٌ فِي سَبِيلِ اللَّهِ وَاللَّهُ أَعْلَمُ بِمَنْ يُكَلَّمُ فِي سَبِيلِهِ إِلَّا جَاءَ يَوْمَ الْقِيَامَةِ وَجُرْحُهُ يَثْعَبُ دَمًا اللَّوْنُ لَوْنُ الدَّمِ والريحُ ريحُ المسكِ»","english":{"narrator":"","text":"Abu Huraira reported God’s Messenger as saying, “No one is wounded in God's path, and God knows best those who are wounded in His path, without coming on the day of resurrection with his wound spouting blood, the colour being that of blood but the fragrance that of musk.” \n\n(Bukhari and Muslim.)"}},{"id":17,"idInBook":17,"chapterId":19,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا مِنْ أَحَدٍ يَدْخُلُ الْجَنَّةَ يُحِبُّ أَنْ يُرْجَعَ إِلَى الدُّنْيَا وَلَهُ مَا فِي الْأَرْضِ مِنْ شَيْءٍ إِلَّا الشَّهِيدُ يَتَمَنَّى أَنْ يُرْجَعَ إِلَى الدُّنْيَا فَيُقْتَلَ عَشْرَ مَرَّاتٍ لِمَا يَرَى مِنَ الْكَرَامَةِ»","english":{"narrator":"","text":"Anas reported God’s Messenger as saying, “No one who enters paradise will want to return to the world and have anything in the earth except the martyr. He will wish to return to the world and be killed ten times because of the honour he sees.” \n\n(Bukhari and Muslim.)"}},{"id":18,"idInBook":18,"chapterId":19,"bookId":14,"arabic":"وَعَنْ مَسْرُوقٍ قَالَ: سَأَلْنَا عَبْدَ اللَّهِ بْنَ مسعودٍ عَنْ هَذِهِ الْآيَةِ: (وَلَا تَحْسَبَنَّ الَّذِينَ قُتِلُوا فِي سَبِيلِ اللَّهِ أَمْوَاتًا بَلْ أَحْيَاءٌ عِنْدَ ربِّهم يُرزقون)\nالْآيَةَ قَالَ: إِنَّا قَدْ سَأَلْنَا عَنْ ذَلِكَ فَقَالَ: \n\" أَرْوَاحُهُمْ فِي أَجْوَافِ طَيْرٍ خُضْرٍ لَهَا قَنَادِيلُ مُعَلَّقَةٌ بِالْعَرْشِ تَسْرَحُ مِنَ الْجَنَّةِ حَيْثُ شَاءَتْ ثُمَّ تَأْوِي إِلَى تِلْكَ الْقَنَادِيلِ فَاطَّلَعَ إِلَيْهِمْ رَبُّهُمُ اطِّلَاعَةً فَقَالَ: هَلْ تَشْتَهُونَ شَيْئًا؟ قَالُوا: أَيَّ شَيْءٍ نَشْتَهِي وَنَحْنُ نَسْرَحُ مِنَ الْجنَّة حيثُ شِئْنَا ففعلَ ذلكَ بهِمْ ثَلَاثَ مَرَّاتٍ فَلَمَّا رَأَوْا أَنَّهُمْ لَنْ يُتْرَكُوا مِنْ أَنْ يَسْأَلُوا قَالُوا: يَا رَبُّ نُرِيدُ أَنْ تُرَدَّ أَرْوَاحُنَا فِي أَجْسَادِنَا حَتَّى نُقْتَلَ فِي سبيلِكَ مرَّةً أُخرى فَلَمَّا رَأَى أَنْ لَيْسَ لَهُمْ حَاجَةٌ تُرِكُوا \". رَوَاهُ مُسلم","english":{"narrator":"Masruq said:","text":"We asked 'Abdallah b. Mas'ud about this verse, “Do not consider those who have been killed in God’s path to be dead; nay, they are alive in the presence of their Lord and are being supplied with provision\" (Al-Qur’an; 3:169). He replied that he had asked about that, and the Prophet said, \"Their spirits are in the crops of green birds which have lamps suspended from the Throne, which go where they wish in paradise and then return to those lamps. Their Lord looks down on them and asks whether they desire anything, and they ask in reply what they could wish when they can go where they like in paradise. He does that with them three times, and when they see that they will not be left alone without asking something, they tell their Lord that they wish Him to return their spirits to their bodies so that they may be killed in His path once again. Then when He sees that they lack nothing they are left without further questioning.\" \n\nMuslim transmitted it."}},{"id":19,"idInBook":19,"chapterId":19,"bookId":14,"arabic":"عَن أَبِي قَتَادَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَامَ فِيهِمْ فَذَكَرَ لَهُمْ أَنَّ الْجِهَادَ فِي سَبِيلِ اللَّهِ وَالْإِيمَانَ بِاللَّهِ أَفْضَلُ الْأَعْمَالِ فَقَامَ رَجُلٌ فَقَالَ: يَا رَسُولَ اللَّهِ أَرَأَيْتَ إِنْ قُتِلْتُ فِي سَبِيلِ اللَّهِ يُكَفَّرُ عَنَى خَطَايَايَ؟ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «نِعْمَ إِنْ قُتِلْتَ فِي سَبِيلِ اللَّهِ وَأَنْتَ صَابِرٌ مُحْتَسِبٌ مُقْبِلٌّ غَيْرُ مُدْبِرٍ» . ثُمَّ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «كَيْفَ قُلْتَ؟» فَقَالَ: أَرَأَيْتَ إِنْ قُتِلْتُ فِي سَبِيلِ اللَّهِ أَيُكَفَّرُ عَنِّي خَطَايَايَ؟ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «نَعَمْ وَأَنْتَ صَابِرٌ مُحْتَسِبٌ مُقْبِلٌ غَيْرُ مُدْبِرٍ إِلَّا الدَّيْنَ فَإِنَّ جِبْرِيلَ قَالَ لِي ذَلِكَ» . رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"Abu Qatada told that God's Messenger got up among them and mentioned to them that jihad in God’s path and faith in God are the most excellent works. A man rose and asked, \"Tell me, Messenger of God, if I am killed in God’s path will my sins be covered up?\" He replied, \"Yes, if you are killed in God's path while showing endurance, seeking your reward from God, advancing and not retreating.\" Then God’s Messenger said, \"What did you say?”* He replied, \"Tell me, if I am killed in God’s path will my sins be covered up?\" God's Messenger said, \"Yes, while you are showing endurance, seeking your reward from God, advancing and not retreating; but this does not include a debt, for Gabriel told me that.\" \n\n*Mirqat iv, 176 quotes Tibi to explain the request to repeat his question when a reply had already been given. The purpose is said to be to make the exception at the end of the second reply.\n\nMuslim transmitted it."}},{"id":20,"idInBook":20,"chapterId":19,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْقَتْلُ فِي سَبِيلِ اللَّهِ يُكَفِّرُ كُلَّ شَيْءٍ إِلَّا الدّين» . رَوَاهُ مُسلم","english":{"narrator":"","text":"‘Abdallah b. ‘Amr b. al-'As reported the Prophet as saying. \"Being killed in God’s path will cover up everything but debt.\" \n\nMuslim transmitted it."}},{"id":21,"idInBook":21,"chapterId":19,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" يَضْحَكُ اللَّهُ تَعَالَى إِلَى رَجُلَيْنِ يَقْتُلُ أَحَدُهُمَا الْآخَرَ يَدْخُلَانِ الْجَنَّةَ: يُقَاتِلُ هَذَا فِي سَبِيلِ اللَّهِ فَيُقْتَلُ ثُمَّ يَتُوبُ اللَّهُ على الْقَاتِل فيستشهد \"","english":{"narrator":"","text":"Abu Huraira reported God's Messenger as saying, \"God most high will cheerfully welcome two men one of whom kills the other. They will enter paradise, one having fought in God’s path and been killed, and the slayer, after receiving God's pardon, having died as a martyr.\"* \n\n* The man who had fought and killed a Muslim later became a Muslim himself and was killed in the course of jihad.\n\n(Bukhari and Muslim.)"}},{"id":22,"idInBook":22,"chapterId":19,"bookId":14,"arabic":"وَعَن سهل بن حنيف قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" مَنْ سَأَلَ اللَّهَ الشَّهَادَةَ بِصِدْقٍ بَلَّغَهُ اللَّهُ مَنَازِلَ الشُّهَدَاءِ وَإِنْ مَاتَ عَلَى فِرَاشِهِ. رَوَاهُ مُسلم","english":{"narrator":"","text":"Sahl b. Hunaif reported God’s Messenger as saying, “If anyone asks God for martyrdom with a genuine purpose God will bring him to the dwellings of the martyrs, even if he dies on his bed.” \n\nMuslim transmitted it."}},{"id":23,"idInBook":23,"chapterId":19,"bookId":14,"arabic":"وَعَن أنسٍ أَنَّ الرُّبَيِّعَ بِنْتَ الْبَرَاءِ وَهِيَ أَمُّ حَارِثَةَ بْنِ سُرَاقَةَ أَتَتِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ: يَا رَسُولَ اللَّهِ أَلَا تُحَدِّثُنِي عنْ حَارِثَةَ وَكَانَ قُتِلَ يَوْمَ بَدْرٍ أَصَابَهُ سَهْمٌ غَرْبٌ فَإِنْ كَانَ فِي الْجَنَّةِ صَبَرْتُ وَإِنْ كَانَ غَيْرُ ذَلِكَ اجْتَهَدْتُ عَلَيْهِ فِي الْبُكَاءِ فَقَالَ: «يَا أَمَّ حَارِثَةَ إِنَّهَا جِنَانٌ فِي الْجَنَّةِ وَإِنَّ ابْنَكِ أَصَابَ الْفِرْدَوْسَ الْأَعْلَى» . رَوَاهُ البخاريُّ","english":{"narrator":"","text":"Anas told that ar-Rubaiyi‘ daughter of al-Bara’, who was the mother of Haritha b. Suraqa, came to the Prophet and said, “Prophet of God, will you not tell me about Haritha? (He had been killed at the battle of Badr, being struck by a random arrow.) If he is in paradise I shall show endurance, but if he has met another fate I shall exert myself in weeping for him.” He replied, “Mother of Haritha, in paradise there are gardens, and your son has attained to al-Firdaus, the highest.” \n\nBukhari transmitted it."}},{"id":24,"idInBook":24,"chapterId":19,"bookId":14,"arabic":"وَعَنْهُ قَالَ: انْطَلَقَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَصْحَابُهُ حَتَّى سَبَقُوا الْمُشْرِكِينَ إِلَى بَدْرٍ وَجَاءَ الْمُشْرِكُونَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «قُومُوا إِلَى جَنَّةٍ عَرْضُهَا السَّمَاوَاتُ وَالْأَرْضُ» . قَالَ عُمَيْرُ بْنُ الْحُمَامِ: بَخْ بَخْ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" مَا يَحْمِلُكَ عَلَى قَوْلِكَ: بَخْ بَخْ؟ \" قَالَ: لَا وَاللَّهِ يَا رَسُولَ اللَّهِ إِلَّا رَجَاءَ أَنْ أَكُونَ مِنْ أَهْلِهَا قَالَ: «فَإِنَّكَ مِنْ أَهْلِهَا» قَالَ: فَأَخْرَجَ تَمَرَاتٍ مِنْ قَرْنِهِ فَجَعَلَ يَأْكُلُ مِنْهُنَّ ثُمَّ قَالَ: لَئِنْ أَنَا حَيِيتُ حَتَّى آكل تمراتي إِنَّهَا الْحَيَاة طَوِيلَةٌ قَالَ: فَرَمَى بِمَا كَانَ مَعَهُ مِنَ التَّمْرِ ثُمَّ قَاتَلَهُمْ حَتَّى قُتِلَ. رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"He told that God’s Messenger and his companions went off and reached Badr before the polytheists, and when the polytheists arrived he said, “Rise to go to a garden whose breadth is as great as the heavens and the earth.” ‘Umair b. al-Humam thereupon said, “Bravo, bravo!” and when God’s Messenger asked him what had made him say that, he replied, “Nothing, I swear by God, Messenger of God, but a hope that I might be among its inhabitants.” He told him that he would be among them. He then took some dates out of his quiver and began to eat them, but after a little said, “If I live till I eat my dates it will mean a long life.” So he threw away the dates he had and then fought with the enemy till he was killed. \n\nMuslim transmitted it."}},{"id":25,"idInBook":25,"chapterId":19,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا تَعُدُّونَ الشَّهِيدَ فِيكُمْ؟» قَالُوا: يَا رَسُولَ اللَّهِ مَنْ قُتِلَ فِي سَبِيلِ اللَّهِ فَهُوَ شَهِيدٌ قَالَ: \n\" إِنَّ شُهَدَاءَ أُمَّتِي إِذًا لِقَلِيلٌ: مَنْ قُتِلَ فِي سَبِيلِ اللَّهِ فَهُوَ شَهِيدٌ وَمَنْ مَاتَ فِي سَبِيلِ اللَّهِ فَهُوَ شَهِيدٌ وَمَنْ مَاتَ فِي الطَّاعُونِ فَهُوَ شَهِيدٌ وَمَنْ مَاتَ فِي الْبَطْنِ فهوَ شهيدٌ \". رَوَاهُ مُسلم","english":{"narrator":"","text":"'Abu Huraira reported God’s Messenger as saying, “Whom do you reckon to be the martyr among you?” His hearers replied, “The one who is killed in God’s path is the martyr, Messenger of God.” He said, “The martyrs among my people would then be few. He who is killed in God’s path is a martyr, he who dies in God’s path is a martyr, he who dies of plague is a martyr, and he who dies of a disease in the belly is a martyr.” \n\nMuslim transmitted it."}},{"id":26,"idInBook":26,"chapterId":19,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا مِنْ غَازِيَة أَو سَرِيَّة تغزو فتغتنم وَتَسْلَمُ إِلَّا كَانُوا قَدْ تَعَجَّلُوا ثُلُثَيْ أُجُورِهِمْ وَمَا مِنْ غَازِيَةٍ أَوْ سَرِيَّةٍ تَخْفُقُ وَتُصَابُ إِلَّا تمّ أُجُورهم» . رَوَاهُ مُسلم","english":{"narrator":"","text":"‘Abdallah b. ‘Amr reported God’s Messenger as saying, “No war-like party or body of troops will go out to fight, gain booty and return safe without getting beforehand two-thirds of their rewards,* and no war-like party or body of troops will be disappointed of their hopes and be smitten without getting their rewards in full.” \n\n* The suggestion is made that the two-thirds are a safe return and booty which they get in this world, the remaining third being reward in the next.\n\nMuslim transmitted it."}},{"id":27,"idInBook":27,"chapterId":19,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ مَاتَ وَلَمْ يَغْزُو وَلَمْ يُحَدِّثْ بِهِ نَفْسَهُ مَاتَ عَلَى شُعْبَةٍ نفاق» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Huraira reported God’s Messenger as saying, “He who dies without having fought, or having felt it to be his duty will die guilty of a kind of hypocrisy.” \n\nMuslim transmitted it."}},{"id":28,"idInBook":28,"chapterId":19,"bookId":14,"arabic":"وَعَن أبي مُوسَى قَالَ: جَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: الرَّجُلُ يُقَاتِلُ لِلْمَغْنَمِ وَالرَّجُلُ يُقَاتِلُ لِلذِّكْرِ وَالرَّجُلُ يُقَاتِلُ لِيُرَى مَكَانُهُ فَمَنْ فِي سَبِيلِ اللَّهِ؟ قَالَ: «مَنْ قَاتَلَ لِتَكُونَ كَلِمَةُ اللَّهِ هِيَ الْعُلْيَا فَهُوَ فِي سَبِيلِ الله»","english":{"narrator":"","text":"Abu Musa told that a man came to the Prophet and said, “One man fights for booty, one for the reputation of fighting, and one for his degree  to be seen; which of them is in God’s path?” He replied, “The one who fights that God’s word may have preeminence is in God’s path.” \n\n(Bukhari and Muslim.)"}},{"id":29,"idInBook":29,"chapterId":19,"bookId":14,"arabic":"وَعَنْ أَنَسٍ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجَعَ مِنْ غَزْوَةِ تَبُوكَ فَدَنَا مِنَ الْمَدِينَةِ فَقَالَ: «إِنَّ بِالْمَدِينَةِ أَقْوَامًا مَا سِرْتُمْ مَسِيرًا وَلَا قَطَعْتُمْ وَادِيًا إِلَّا كَانُوا مَعَكُمْ» . وَفِي رِوَايَةٍ: «إِلَّا شَرِكُوكُمْ فِي الْأَجْرِ» . قَالُوا: يَا رَسُولَ اللَّهِ وَهُمْ بِالْمَدِينَةِ؟ قَالَ: «وهُم بالمدينةِ حَبسهم الْعذر» . رَوَاهُ البُخَارِيّ\nوَرَوَاهُ مُسلم عَن جَابر","english":{"narrator":"","text":"Anas told that when God’s Messenger returned from the expedition to Tabuk and approached Medina he said, “In Medina there are people who did not fail to be with you wherever you went and whatever wadi you crossed.” A version has, “Who have not failed to share your reward.” On their expressing surprise that that should be true when they were still in Medina, he said, “While they are still in Medina, being kept back by a valid excuse.” \n\nBukhari transmitted it, and Muslim transmitted it on Jabir’s authority."}},{"id":30,"idInBook":30,"chapterId":19,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ: جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاسْتَأْذَنَهُ فِي الْجِهَادِ فَقَالَ: «أَحَي والدك؟» قَالَ: نَعَمْ قَالَ: «فَفِيهِمَا فَجَاهِدْ» . مُتَّفَقٌ عَلَيْهِ. وَفِي رِوَايَةٍ: «فَارْجِعْ إِلَى وَالِدَيْكَ فَأَحْسِنْ صُحْبَتَهُمَا»","english":{"narrator":"","text":"‘Abdallah b. ‘Amr told that a man came to God’s Messenger and asked his permission to take part in jihad. He asked him if his parents were still alive, and when he replied that they were, he told him to exert himself* on their behalf. \n\n*The point is not so clear in English as in Arabic. Jihad, while being the word for fighting against infidels, also means to strive or to exert oneself in general. The man wished to take part in jihad, and when the Prophet heard that his parents were still alive he said fa-fihima fa-jahid (exert yourself on their behalf.)\n(Bukhari and Muslim.) A version has, “Return to your parents and look after them well.”"}},{"id":31,"idInBook":31,"chapterId":19,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَوْم الْفَتْح: ( «اهجرة بَعْدَ الْفَتْحِ وَلَكِنْ جِهَادٌ وَنِيَّةٌ وَإِذَا اسْتُنْفِرْتُمْ فانفروا»","english":{"narrator":"","text":"Ibn ‘Abbas reported the Prophet as saying on the day of the Conquest of Mecca, “There is no emigration after the Conquest, but only jihad and some good intention; so when you are summoned to fight, go forth.” \n\n(Bukhari and Muslim.)"}},{"id":32,"idInBook":32,"chapterId":19,"bookId":14,"arabic":"عَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَزَالُ طَائِفَةٌ مِنْ أُمَّتِي يُقَاتِلُونَ عَلَى الْحَقِّ ظَاهِرِينَ عَلَى مَنْ نَاوَأَهُمْ حَتَّى يُقَاتِلَ آخِرُهُمُ الْمَسِيحَ الدَّجَّالَ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"‘Imran b Husain reported God’s Messenger as saying, “A section, of my people will continue to fight for the right and overcome their opponents till the last of them fight with the antichrist.\" \n\nAbu Dawud transmitted it."}},{"id":33,"idInBook":33,"chapterId":19,"bookId":14,"arabic":"وَعَنْ أَبِي أُمَامَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ لَمْ يَغْزُ وَلَمْ يُجَهِّزْ غَازِيًا أَوْ يَخْلُفْ غَازِيًا فِي أَهْلِهِ بِخَيْرٍ أَصَابَهُ اللَّهُ بِقَارِعَةٍ قَبْلَ يَوْمِ الْقِيَامَةِ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Abu Umama reported the Prophet as saying, “He who does not join a war-like expedition, or equip a warrior, or look well after a warrior’s family when he is away, will be smitten by God with a sudden calamity before the day of resurrection.” \n\nAbu Dawud transmitted it."}},{"id":34,"idInBook":34,"chapterId":19,"bookId":14,"arabic":"وَعَنْ أَنَسٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «جَاهِدُوا الْمُشْرِكِينَ بِأَمْوَالِكُمْ وَأَنْفُسِكُمْ وَأَلْسِنَتِكُمْ» . رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ والدارمي","english":{"narrator":"","text":"Anas reported the Prophet as saying, “Use your property, your persons and your tongues in striving with the polytheists.\" \n\nAbu Dawud, Nasa’i and Darimi transmitted it."}},{"id":35,"idInBook":35,"chapterId":19,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَفْشُوا السَّلَامَ وَأَطْعِمُوا الطَّعَامَ وَاضْرِبُوا الْهَامَ تُوَرَّثُوا الْجِنَانَ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حديثٌ غَرِيب","english":{"narrator":"","text":"Abu Huraira reported God’s Messenger as saying, “If you greet all and sundry, provide food, and strike the pates of enemies, you will be made heirs of paradise.\" \n\nTirmidhi transmitted it, saying this is a gharib tradition."}},{"id":36,"idInBook":36,"chapterId":19,"bookId":14,"arabic":"وَعَن فَضالَةَ بنِ عُبيدٍ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «كُلُّ مَيِّتٍ يُخْتَمُ عَلَى عَمَلِهِ إِلَّا الَّذِي مَاتَ مُرَابِطًا فِي سَبِيلِ اللَّهِ فَإِنَّهُ يُنَمَّى لَهُ عَمَلُهُ إِلَى يَوْمِ الْقِيَامَةِ وَيَأْمَنُ فتْنَة الْقَبْر» . رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد\nوَرَوَاهُ الدَّارمِيّ عَن عقبَة بن عَامر","english":{"narrator":"","text":"Fadala b. ‘Ubaid reported God’s Messenger as saying, “Everyone who dies will have fully completed his actions, except one who is on the frontier in God’s path, for his deeds will be made to go on increasing for him till the day of resurrection, and he will be safe from the trial in the grave.\" \n\nTirmidhi and Abu Dawud transmitted it, and Darimi transmitted it on the authority of ‘Uqba b. ‘Amir."}},{"id":37,"idInBook":37,"chapterId":19,"bookId":14,"arabic":"وَعَن معاذِ بن جبلٍ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنْ قَاتَلَ فِي سَبِيلِ اللَّهِ فَوَاقَ نَاقَةٍ فَقَدْ وَجَبَتْ لَهُ الْجَنَّةُ وَمَنْ جُرِحَ جُرْحًا فِي سَبِيلِ اللَّهِ أَوْ نُكِبَ نَكْبَةً فَإِنَّهَا تَجِيءُ يَوْمَ الْقِيَامَةِ كَأَغْزَرِ مَا كَانَتْ لَوْنُهَا الزَّعْفَرَانُ وَرِيحُهَا الْمِسْكُ وَمَنْ خَرَجَ بِهِ خُرَاجٌ فِي سَبِيلِ اللَّهِ فَإِنَّ عَلَيْهِ طَابَعُ الشُّهَدَاءِ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالنَّسَائِيُّ","english":{"narrator":"","text":"Mu'adh b. Jabal told of his hearing God’s Messenger say, “If anyone fights in God’s path as long as the time between two milkings of a she- camel* paradise will be assured for him; if anyone is wounded in God’s path or suffers a misfortune, it will come on the day of resurrection as copious as possible, its colour saffron and its odour musk; and if anyone suffers from ulcers while in God's path, he will have on him the stamp of the martyrs.\"\n\n* This refers particularly to the practice of milking a camel, then leaving it for a little to suckle its young, after which it is milked again. The period between the two milkings therefore indicates a very short time.\n\nTirmidhi, Abu Dawud and Nasa’i transmitted it."}},{"id":38,"idInBook":38,"chapterId":19,"bookId":14,"arabic":"وَعَن خُرَيمِ بن فاتِكٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَنْفَقَ نَفَقَةً فِي سَبِيلِ اللَّهِ كُتبَ لَهُ بسبعمائةِ ضعف» . رَوَاهُ التِّرْمِذِيّ وَالنَّسَائِيّ","english":{"narrator":"","text":"Khuraim b. Fatik reported God’s Messenger as saying, “If anyone makes a contribution towards God's path, seven hundred times as much will be recorded to his credit.\" \n\nTirmidhi and Nasa’i transmitted it."}},{"id":39,"idInBook":39,"chapterId":19,"bookId":14,"arabic":"وَعَنْ أَبِي أُمَامَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَفْضَلُ الصَّدَقَاتِ ظِلُّ فُسْطَاطٍ فِي سَبِيلِ اللَّهِ وَمِنْحَةُ خَادِمٍ فِي سَبِيلِ اللَّهِ أَوْ طَرُوقَةُ فَحْلٍ فِي سَبِيلِ اللَّهِ» . رَوَاهُ التِّرْمِذِيُّ","english":{"narrator":"","text":"Abu Umama reported God's Messenger as saying, “The best sadaqat are the shade of a large tent in God's path, the gift of a servant in God’s path, or providing in God’s path a she-camel old enough to be covered by a stallion.\" \n\nTirmidhi transmitted it."}},{"id":40,"idInBook":40,"chapterId":19,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَلِجُ النَّارَ مَنْ بَكَى مِنْ خَشْيَةِ اللَّهِ حَتَّى يَعُودَ اللَّبَنُ فِي الضَّرْعِ وَلَا يَجْتَمِعَ عَلَى عَبْدٍ غُبَارٌ فِي سَبِيلِ اللَّهِ وَدُخَانُ جَهَنَّمَ» . رَوَاهُ التِّرْمِذِيُّ وَزَادَ النَّسَائِيُّ فِي أُخْرَى: «فِي مَنْخِرَيْ مُسْلِمٍ أَبَدًا» وَفِي أُخْرَى: «فِي جَوْفِ عَبْدٍ أَبَدًا وَلَا يَجْتَمِعُ الشُّحُّ وَالْإِيمَانُ فِي قَلْبِ عَبْدٍ أَبَدًا»","english":{"narrator":"","text":"Abu Huraira reported God’s Messenger as saying, “No one who weeps from fear of God will go into hell till the milk returns to the udder, and no servant of God will experience both dust in God’s path and the smoke of jahannam.\"\n \nTirmidhi transmitted it, and Nasa'i added in another version, “ever in a Muslim’s nostrils.\" In another by him he added, “ever in the belly of a servant of God; and stinginess and faith will never be combined in the heart of a servant of God.\""}},{"id":41,"idInBook":41,"chapterId":19,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" عَيْنَانِ لَا تَمَسُّهُمَا النَّارُ: عَيْنٌ بَكَتْ مِنْ خَشْيَةِ اللَّهِ وَعَيْنٌ بَاتَتْ تَحْرُسُ فِي سَبِيلِ اللَّهِ \". رَوَاهُ التِّرْمِذِيُّ","english":{"narrator":"","text":"Ibn ‘Abbas reported God's Messenger as saying, “There are two eyes which will never be touched by hell, an eye which weeps from fear of God and an eye which spends the night on guard in God’s path.\" \n\nTirmidhi transmitted it."}},{"id":42,"idInBook":42,"chapterId":19,"bookId":14,"arabic":"وَعَن أبي هريرةَ قَالَ: مَرَّ رَجُلٍ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِشِعْبٍ فِيهِ عُيَيْنَةٌ مِنْ مَاءٍ عَذْبَةٌ فَأَعْجَبَتْهُ فَقَالَ: لَوِ اعْتَزَلْتُ النَّاسَ فَأَقَمْتُ فِي هَذَا الشِّعْبِ فَذَكَرَ ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «لَا تَفْعَلْ فَإِنَّ مَقَامَ أَحَدِكُمْ فِي سَبِيلِ الله أفضل من صلَاته سَبْعِينَ عَامًا أَلَا تُحِبُّونَ أَنْ يَغْفِرَ اللَّهُ لَكُمْ وَيُدْخِلَكُمُ الْجَنَّةَ؟ اغْزُوا فِي سَبِيلِ اللَّهِ مَنْ قَاتَلَ فِي سَبِيلِ اللَّهِ فَوَاقَ نَاقَةٍ وَجَبت لَهُ الْجنَّة» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Abu Huraira told that when one of God’s Messenger’s companion came upon a mountain path containing a small spring of fresh water and was delighted by it, he expressed a desire to withdraw from the people and stay in that path. He mentioned that to God’s Messenger, and he replied, “Do not do it, for when any of you remains in God’s path it is more excellent than prayer in his house during seventy years. Do you not want* God to forgive you and bring you into paradise? Fight* in God's path. He who fights in God's path as long as the time between two milkings of a she-camel will be assured of paradise.\" \n\n*These verbs are in plural.\n\nTirmidhi transmitted it."}},{"id":43,"idInBook":43,"chapterId":19,"bookId":14,"arabic":"وَعَنْ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «رِبَاطُ يَوْمٍ فِي سَبِيلِ اللَّهِ خَيْرٌ مِنْ أَلْفِ يَوْمٍ فِيمَا سِوَاهُ مِنَ الْمَنَازِلِ» . رَوَاهُ التِّرْمِذِيُّ وَالنَّسَائِيّ","english":{"narrator":"","text":"Uthman reported God’s Messenger as saying, “A day on the frontier in God’s path is better than a thousand days in any other place.\" \n\nTirmidhi and Nasa’i transmitted it."}},{"id":44,"idInBook":44,"chapterId":19,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" عَرَضَ عَلَيَّ أَوَّلُ ثَلَاثَةٍ يَدْخُلُونَ الْجَنَّةَ: شَهِيدٌ وَعَفِيفٌ مُتَعَفِّفٌ وَعَبَدٌ أَحْسَنَ عبادةَ اللَّهِ ونصح لمواليه \". رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"Abu Huraira reported God’s Messenger as saying, “I was shown the first three to enter paradise:","text":"a martyr, a continent man who refrains from what is unlawful, and a slave who worships God well and serves his patrons sincerely.\" \n\nTirmidhi transmitted it."}},{"id":45,"idInBook":45,"chapterId":19,"bookId":14,"arabic":"وَعَن عبدِ الله بنِ حُبَشيٍّ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ أَيُّ الْأَعْمَالِ أَفْضَلُ؟ قَالَ: «طُولُ الْقِيَامِ» قِيلَ: فَأَيُّ الصَّدَقَةِ أَفْضَلُ؟ قَالَ: «جُهْدُ الْمُقِلِّ» قِيلَ: فَأَيُّ الْهِجْرَةِ أَفْضَلُ؟ قَالَ: «مَنْ هَجَرَ مَا حَرَّمَ اللَّهُ عَلَيْهِ» قِيلَ: فَأَيُّ الْجِهَادِ أَفْضَلُ؟ قَالَ: «مَنْ جَاهَدَ الْمُشْرِكِينَ بِمَالِهِ وَنَفْسِهِ» . قِيلَ: فَأَيُّ الْقَتْلِ أَشْرَفُ؟ قَالَ: «مَنْ أُهْرِيقَ دَمُهُ وَعُقِرَ جَوَادُهُ» . رَوَاهُ أَبُو دَاوُدَ\nوَفِي رِوَايَةِ للنسائي: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ: أيُّ الأعمالِ أفضلُ؟ قَالَ: «إِيمانٌ لَا شكَّ فِيهِ وَجِهَادٌ لَا غُلُولَ فِيهِ وَحَجَّةٌ مَبْرُورَةٌ» . قِيلَ: فَأَيُّ الصَّلَاةِ أَفْضَلُ؟ قَالَ: «طُولُ الْقُنُوتِ» . ثمَّ اتفقَا فِي الْبَاقِي","english":{"narrator":"","text":"‘Abdallah b. Hubshi told that the Prophet was asked which deed was most excellent and replied, “Standing long in prayer.\" He was asked what sadaqa was most excellent and replied, “The effort of one who possesses little.” He was asked what hijra was most excellent and replied, “That of one who forsakes what God has prohibited.” He was asked what jihad was most excellent and replied, “That of one who strives against the polytheists with his property and his person.” He was asked what manner of being killed was most honourable and replied, “That of one whose blood is shed and whose steed is wounded.” \n\nAbu Dawud transmitted it Nasa’i’s version says that the Prophet was asked which actions were most excellent and replied, “Faith which contains no doubt, jihad which contains no unfaithfulness regarding spoil, and a pilgrimage which is accepted.” He was asked what prayer was most excellent and replied, “Standing long in devotion.” The two versions agree about the remainder."}},{"id":46,"idInBook":46,"chapterId":19,"bookId":14,"arabic":"وَعَنِ الْمِقْدَامِ بْنِ مَعْدِي كَرِبَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" لِلشَّهِيدِ عِنْدَ اللَّهِ سِتُّ خِصَالٍ: يُغْفَرُ لَهُ فِي أوَّلِ دفعةٍ وَيَرَى مَقْعَدَهُ مِنَ الْجَنَّةِ وَيُجَارُ مِنْ عَذَابِ الْقَبْرِ وَيَأْمَنُ مِنَ الْفَزَعِ الْأَكْبَرِ وَيُوضَعُ عَلَى رَأْسِهِ تَاجُ الْوَقَارِ الْيَاقُوتَةُ مِنْهَا خَيْرٌ مِنَ الدُّنْيَا وَمَا فِيهَا ويزوَّجُ ثنتينِ وَسَبْعِينَ زَوْجَةً مِنَ الْحُورِ الْعِينِ وَيُشَفَّعُ فِي سَبْعِينَ مِنْ أَقْرِبَائِهِ \". رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ","english":{"narrator":"Al-Miqdam b. Ma'dikarib reported God’s Messenger as saying, “The martyr receives six1 good things from God:","text":"he is forgiven at the first shedding of his blood, he is shown his abode in paradise, he is preserved from the punishment in the grave, he is kept safe from the greatest terror2, he has placed on his head the crown of honour a ruby of which is better than the world and what it contains, he is married to seventy-two wives of the maidens with large dark eyes,3 and is made intercessor for seventy of his relatives.” \n\n1. There seem to be seven things mentioned in this tradition.\n2. Cf. Al-Qur'an; 21:103.\n3. Cf. Al-Qur’an, 56:22.\n\nTirmidhi and Ibn Majah transmitted it."}},{"id":47,"idInBook":47,"chapterId":19,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ لَقِيَ اللَّهَ بِغَيْرِ أَثَرٍ مِنْ جِهَادٍ لَقِيَ اللَّهَ وَفِيهِ ثُلْمَةٌ» . رَوَاهُ التِّرْمِذِيّ وَابْن مَاجَه","english":{"narrator":"","text":"Abu Huraira reported God’s Messenger as saying, “If anyone meets God with no mark of jihad, he will meet God with a flaw in him.” \n\nTirmidhi and Ibn Majah transmitted it."}},{"id":48,"idInBook":48,"chapterId":19,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الشَّهِيدُ لَا يَجِدُ أَلَمَ الْقَتْلِ إِلَّا كَمَا يَجِدُ أَحَدُكُمْ أَلَمَ الْقَرْصَةِ» . رَوَاهُ التِّرْمِذِيُّ وَالنَّسَائِيُّ وَالدَّارِمِيُّ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ","english":{"narrator":"","text":"He reported God’s Messenger as saying, “The martyr experiences no more pain in being killed than one of you experiences from a sting.” \n\nTirmidhi, Nasa’i and Darimi transmitted it, Tirmidhi saying this is a hasan gharib tradition."}},{"id":49,"idInBook":49,"chapterId":19,"bookId":14,"arabic":"وَعَنْ أَبِي أُمَامَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" لَيْسَ شَيْءٌ أَحَبَّ إِلَى اللَّهِ مِنْ قَطْرَتَيْنِ وَأَثَرَيْنِ: قَطْرَةِ دُمُوعٍ مِنْ خَشْيَةِ اللَّهِ وَقَطْرَةِ دَمٍ يُهْرَاقُ فِي سَبِيلِ اللَّهِ وَأَمَّا الْأَثَرَانِ: فَأَثَرٌ فِي سَبِيلِ اللَّهِ وَأَثَرٌ فِي فَرِيضَةٍ مِنْ فَرَائِضِ اللَّهِ تَعَالَى \". رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ","english":{"narrator":"","text":"Abu Umama reported the Prophet as saying, “Nothing is dearer to God than two drops and two marks, a drop of tears from fear of God and a drop of blood shed in God’s path. Regarding the two marks, they are a mark received in God’s path and one caused by observing one of the ordinances of God most high.”* \n\n* This is said to refer to such things as hacks in hands or feet through performing ablution in cold weather, or a mark on the forehead through prostrating oneself on hot ground, or having dust on one’s feet while performing pilgrimage.\n\nTirmidhi transmitted it, saying this is a hasan gharib tradition."}},{"id":50,"idInBook":50,"chapterId":19,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَرْكَبِ الْبَحْرَ إِلَّا حَاجًّا أَوْ مُعْتَمِرًا أَوْ غَازِيًا فِي سَبِيلِ اللَّهِ فَإِنَّ تَحْتَ الْبَحْرِ نَارًا وَتَحْتَ النَّارِ بَحْرًا» . رَوَاهُ أَبُو دَاوُدَ","english":{"narrator":"","text":"‘Abdallah b. ‘Amr reported God’s Messenger as saying, “Do not sail on the sea except when going to perform the hajj, or the ‘umra, or when fighting in God’s path, for under the sea there is a fire and under the fire there is a sea.” \n\nAbu Dawud transmitted it."}},{"id":51,"idInBook":51,"chapterId":19,"bookId":14,"arabic":"وَعَن أم حرَام عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْمَائِدُ فِي الْبَحْرِ الَّذِي يُصِيبُهُ الْقَيْءُ لَهُ أَجْرُ شَهِيدٍ وَالْغَرِيقُ لَهُ أَجْرُ شَهِيدَيْنِ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Umm Haram reported the Prophet as saying, “He who becomes sick on a stormy sea will have the reward of a martyr, and he who is drowned will have the reward of two martyrs.” \n\nAbu Dawud transmitted it."}},{"id":52,"idInBook":52,"chapterId":19,"bookId":14,"arabic":"وَعَن أبي مالكٍ الأشعريّ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنْ فَصَلَ فِي سَبِيلِ اللَّهِ فَمَاتَ أَوْ قُتِلَ أَوْ وَقَصَهُ فَرَسُهُ أَوْ بَعِيرُهُ أَوْ لَدْغَتْهُ هَامَّةٌ أَو مَاتَ فِي فِرَاشِهِ بِأَيِّ حَتْفٍ شَاءَ اللَّهُ فَإِنَّهُ شَهِيدٌ وَإِن لَهُ الْجنَّة» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Abu Malik al-Ash‘ari told that he heard God’s Messenger say, “He who goes forth in God’s path and dies, or is killed, or has his neck broken through being thrown by his horse or his camel, or is stung by a poisonous creature, or dies on his bed by any kind of death God wishes is a martyr and will go to paradise.” \n\nAbu Dawud transmitted it."}},{"id":53,"idInBook":53,"chapterId":19,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «قَفْلَةٌ كغزوة» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"‘Abdallah b. ‘Amr reported God’s Messenger as saying, “Returning home is like going on an expedition.”* \n\n* This is interpreted as referring to rewards. Returning after an expedition means that an opportunity is given for rest and refreshment before beginning another, so it merits reward similar to that for setting out.\n\nAbu Dawud transmitted it."}},{"id":54,"idInBook":54,"chapterId":19,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لِلْغَازِي أَجْرُهُ وَلِلْجَاعِلِ أَجْرُهُ وَأَجْرُ الْغَازِي» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"He reported God's Messenger as saying, “The fighter gets his reward, and the one who equips him gets his own reward and that of the fighter.” \n\nAbu Dawud transmitted it."}},{"id":55,"idInBook":55,"chapterId":19,"bookId":14,"arabic":"وَعَن أبي أَيُّوب سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «سَتُفْتَحُ عَلَيْكُمُ الْأَمْصَارُ وَسَتَكُونُ جُنُودٌ مُجَنَّدَةٌ يُقْطَعُ عَلَيْكُمْ فِيهَا بُعُوثٌ فَيَكْرَهُ الرَّجُلُ الْبَعْثَ فَيَتَخَلَّصُ مَنْ قَوْمِهِ ثُمَّ يَتَصَفَّحُ الْقَبَائِلَ يَعْرِضُ نَفْسَهُ عَلَيْهِمْ مَنْ أَكْفِيهِ بَعْثَ كَذَا أَلَا وَذَلِكَ الْأَجِيرُ إِلَى آخِرِ قَطْرَةٍ مِنْ دَمِهِ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Abu Ayyub told that he heard the Prophet say, “Capitals will be conquered at your hands and you will have to raise companies in large armies. A man will be unwilling to join a company, so he will escape from his people and go round the tribes offering himself to them, seeking someone whose place he may take in such and such an expedition.* That man is a hireling to the last drop of his blood.” \n\n* This is the type of person who dislikes being sent on a warlike expedition, but who is quite willing to take someone else’s place if he is paid for it.\n\nAbu Dawud transmitted it."}},{"id":56,"idInBook":56,"chapterId":19,"bookId":14,"arabic":"وَعَن يَعْلى بن أُميَّةَ قَالَ: أَذِنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بالغزو وَأَن شَيْخٌ كَبِيرٌ لَيْسَ لِي خَادِمٌ فَالْتَمَسْتُ أَجِيرًا يَكْفِينِي فَوَجَدْتُ رَجُلًا سَمَّيْتُ لَهُ ثَلَاثَةَ دَنَانِيرَ فَلَمَّا حَضَرَتْ غَنِيمَةٌ أَرَدْتُ أَنْ أُجْرِيَ لَهُ سَهْمَهُ فَجِئْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَتْ لَهُ فَقَالَ: «مَا أَجِدُ لَهُ فِي غَزْوَتِهِ هَذِهِ فِي الدُّنْيَا وَالْآخِرَةِ إِلَّا دَنَانِيرَهُ الَّتِي تسمى» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"Ya‘la. b. Umayya said:","text":"God’s Messenger announced an expedition, and as I was a very old man who had no servant I sought a hireling who would serve instead of me. I found a man to whom I offered three dinars, and when some booty arrived I wanted to give him his portion, so I went to the Prophet and mentioned the matter to him, but he said, “All I can find for him regarding this expedition of his in this world and the next is the three dinars which were offered him.\" \n\nAbu Dawud transmitted it."}},{"id":57,"idInBook":57,"chapterId":19,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ أَنَّ رَجُلًا قَالَ: يَا رسولَ الله رجلٌ يُرِيدُ الْجِهَادَ فِي سَبِيلِ اللَّهِ وَهُوَ يَبْتَغِي عَرَضاً من عرَضِ الدُّنْيَا فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا أجر لَهُ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Abu Huraira told that a man said, “Messenger of God, a man wishes to take part in jihad in God’s path desiring some worldly advantage.\" The Prophet replied, “He will have no reward.\" \n\nAbu Dawud transmitted it."}},{"id":58,"idInBook":58,"chapterId":19,"bookId":14,"arabic":"وَعَنْ مُعَاذٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْغَزْوُ غَزْوَانِ فَأَمَّا مَنِ ابْتَغَى وَجْهَ اللَّهِ وَأَطَاعَ الْإِمَامَ وَأَنْفَقَ الْكَرِيمَةَ وَيَاسَرَ الشَّرِيكَ واجتنبَ الْفساد فَإِن نَومه ونهبه أَجْرٌ كُلُّهُ. وَأَمَّا مَنْ غَزَا فَخْرًا وَرِيَاءً وَسُمْعَةً وَعَصَى الْإِمَامَ وَأَفْسَدَ فِي الْأَرْضِ فَإِنَّهُ لَمْ يَرْجِعْ بِالْكَفَافِ» . رَوَاهُ مَالِكٌ وَأَبُو دَاوُدَ وَالنَّسَائِيّ","english":{"narrator":"","text":"Mu'adh reported God’s Messenger as saying, “Fighting is of two kinds. The one who seeks God’s favour, obeys the leader, gives property he values, helps his associate and avoids doing mischief will have a reward for all the time he is asleep and awake, but the one who fights in a boasting spirit, for the sake of display and to gain a reputation, who disobeys the leader and does mischief in the earth will not return without credit or blame.’’*\n\n* i.e. the wrong he has done exceeds the good.\n\nMalik, Abu Dawud and Nasa’i transmitted it."}},{"id":59,"idInBook":59,"chapterId":19,"bookId":14,"arabic":"وَعَن عبد الله بن عَمْرو أَنَّهُ قَالَ: يَا رَسُولَ اللَّهِ أَخْبِرْنِي عَنِ الْجِهَادِ فَقَالَ: «يَا عَبْدَ اللَّهِ بْنَ عَمْرٍو إِنْ قَاتَلْتَ صَابِرًا مُحْتَسِبًا بَعَثَكَ اللَّهُ صَابِرًا مُحْتَسِبًا وَإِنْ قَاتَلْتَ مُرَائِيًا مُكَاثِرًا بَعَثَكَ اللَّهُ مُرَائِيًا مُكَاثِرًا يَا عَبْدَ اللَّهِ بْنَ عَمْرٍو عَلَى أَيِّ حَالٍ قَاتَلْتَ أَوْ قُتِلْتَ بَعَثَكَ اللَّهُ عَلَى تِلْكَ الْحَالِ» . رَوَاهُ أَبُو دَاوُدَ","english":{"narrator":"","text":"'Abdallah b. ‘Amr told that he asked God’s Messenger to tell him about jihad and he replied, “If you fight with endurance, ‘Abdallah b. ‘Amr, seeking from God your reward, God will resurrect you showing endurance and seeking your reward from Him, but if you fight for vain show seeking to acquire much God will resurrect you making a vain show and seeking to acquire much. In whatever state you fight or are killed, ‘Abdallah b. ‘Amr, in that state God will resurrect you.\" \n\nAbu Dawud transmitted it."}},{"id":60,"idInBook":60,"chapterId":19,"bookId":14,"arabic":"وَعَن عقبَة بن مَالك عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أعجزتم إِذا بعثت رجلا فَم يَمْضِ لِأَمْرِي أَنْ تَجْعَلُوا مَكَانَهُ مَنْ يَمْضِي لِأَمْرِي؟» . رَوَاهُ أَبُو دَاوُدَ","english":{"narrator":"","text":"‘Uqba b. Malik reported the Prophet as saying, “When I send out a man and he does not fulfil my command, are you unable to appoint in his place one who will fulfil my command?\" \n\nAbu Dawud transmitted it."}},{"id":61,"idInBook":61,"chapterId":19,"bookId":14,"arabic":"عَن أبي أُمامةَ قَالَ: خَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَرِيَّةٍ فَمَرَّ رَجُلٌ بِغَارٍ فِيهِ شَيْءٌ مِنْ مَاءٍ وَبَقْلٍ فَحَدَّثَ نَفْسَهُ بِأَنْ يُقِيمَ فِيهِ وَيَتَخَلَّى مِنَ الدُّنْيَا فَاسْتَأْذَنَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي ذَلِكَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنِّي لَمْ أُبْعَثْ بِالْيَهُودِيَّةِ وَلَا بِالنَّصْرَانِيَّةِ وَلَكَنِّي بُعِثْتُ بِالْحَنِيفِيَّةِ السَّمْحَةِ وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَغَدْوَةٌ أَوْ رَوْحَةٌ فِي سَبِيلِ اللَّهِ خَيْرٌ مِنَ الدُّنْيَا وَمَا فِيهَا وَلَمَقَامُ أَحَدِكُمْ فِي الصَّفِّ خَيْرٌ مِنْ صَلَاتِهِ سِتِّينَ سَنَةً» . رَوَاهُ أَحْمد","english":{"narrator":"Abu Umama said:","text":"We went out with God’s Messenger on an expedition and when a man came upon a cave containing some water and vegetables he felt inclined to stay in it and withdraw from the world, so he asked God’s Messenger’s permission regarding that, but he replied, “I was not commissioned with Judaism, or Christianity, but with the easy Hanif religion. By Him in whose hand Muhammad's soul is, a morning or an evening expedition in God’s path is better than the world and what it contains, and for one of you to remain in the line of battle is better than his prayers for sixty years.” \n\nAhmad transmitted it."}},{"id":62,"idInBook":62,"chapterId":19,"bookId":14,"arabic":"وَعَنْ عُبَادَةَ بْنِ الصَّامِتِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ غَزَا فِي سَبِيلِ اللَّهِ وَلَمْ يَنْوِ إِلَّا عِقَالًا فَلَهُ مَا نَوَى» . رَوَاهُ النَّسَائِيّ","english":{"narrator":"","text":"‘Ubada b. as-Samit reported God’s Messenger as saying, “He who fights in God’s path with no intention but getting a tethering rope will have what he intended.”* \n\n* This saying advocates the necessity of having proper motives. If all one wants is some material gain that is all he will get, for he will not deserve any eternal reward.\n\nNasa’i transmitted it."}},{"id":63,"idInBook":63,"chapterId":19,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى الله عَلَيْهِ وَسلم قَالَ: «من رَضِي بِاللَّه رَبًّا وَالْإِسْلَام دِينًا وَبِمُحَمَّدٍ رَسُولًا وَجَبَتْ لَهُ الْجَنَّةُ» . فَعَجِبَ لَهَا أَبُو سَعِيدٍ فَقَالَ: أَعِدْهَا عَلَيَّ يَا رَسُولَ اللَّهِ فَأَعَادَهَا عَلَيْهِ ثُمَّ قَالَ: «وَأُخْرَى يَرْفَعُ اللَّهُ بِهَا الْعَبْدَ مِائَةَ دَرَجَةٍ فِي الْجَنَّةِ مَا بَيْنَ كُلِّ دَرَجَتَيْنِ كَمَا بَيْنَ السَّمَاءِ وَالْأَرْضِ» . قَالَ: وَمَا هِيَ يَا رَسُولَ الله؟ قَالَ: «الْجِهَاد فِي سَبِيل الْجِهَادُ فِي سَبِيلِ اللَّهِ الْجِهَادُ فِي سَبِيلِ الله» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Sa'id reported God’s Messenger as saying, “If anyone is pleased with God as Lord, with Islam as religion and with Muhammad as Messenger, paradise will be assured to him.” Abu Sa'id was delighted with this and asked him to repeat it. He did so and then said, “There is also something else for which God will raise a servant in paradise a hundred degrees between each two of which there is a distance like that between heaven and earth.” He asked God's Messenger what it was and he replied, “jihad in God's path; jihad in God’s path; jihad in God’s path.” \n\nMuslim transmitted it."}},{"id":64,"idInBook":64,"chapterId":19,"bookId":14,"arabic":"وَعَنْ أَبِي مُوسَى قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ أَبْوَابَ الْجَنَّةِ تَحْتَ ظِلَالِ السُّيُوفِ» فَقَامَ رَجُلٌ رَثُّ الْهَيْئَةِ فَقَالَ: يَا أَبَا مُوسَى أَنْتَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ هَذَا؟ قَالَ: نَعَمْ فَرَجَعَ إِلَى أَصْحَابِهِ فَقَالَ: أَقْرَأُ عَلَيْكُمُ السَّلَامَ ثُمَّ كَسَرَ جَفْنَ سَيْفِهِ فَأَلْقَاهُ ثُمَّ مَشَى بِسَيْفِهِ إِلَى الْعَدُوِّ فَضَرَبَ بِهِ حَتَّى قُتِلَ. رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Musa reported God’s Messenger as saying, “The gates of paradise are under the shadow of the swords.” A man with a ragged appearance got up and asked Abu Musa whether he had heard God's Messenger say that; and when he received the reply that he had, he returned to his companions, said, “I salute you,” then broke the scabbard of his sword and threw it away, then went towards the enemy with his sword and plied it till he was killed. \n\nMuslim transmitted it."}},{"id":65,"idInBook":65,"chapterId":19,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى الله عَلَيْهِ وَسلم قَالَ لِأَصْحَابِهِ: \" إِنَّهُ لَمَّا أُصِيبَ إِخْوَانُكُمْ يَوْمَ أُحُدٍ جَعَلَ اللَّهُ أَرْوَاحَهُمْ فِي جَوْفِ طَيْرٍ خُضْرٍ تَرِدُ أَنْهَارَ الْجَنَّةِ تَأْكُلُ مِنْ ثِمَارِهَا وَتَأْوِي إِلَى قَنَادِيلَ مِنْ ذَهَبٍ مُعَلَّقَةٍ فِي ظلِّ العرْشِ فلمَّا وجَدوا طِيبَ مأكَلِهِم ومشرَبِهمْ ومَقِيلهِم قَالُوا: مَنْ يُبلِّغُ إِخْوانَنا عنَا أَنَّنا أَحْيَاءٌ فِي الْجَنَّةِ لِئَلَّا يَزْهَدُوا فِي الْجَنَّةِ وَلَا يَنكُلوا عندَ الحربِ فَقَالَ اللَّهُ تَعَالَى: أَنا أبلغكم عَنْكُمْ فَأَنْزَلَ اللَّهُ تَعَالَى: (وَلَا تَحْسَبَنَّ الَّذِينَ قُتِلُوا فِي سَبِيلِ اللَّهِ أَمْوَاتًا بَلْ أَحْيَاءٌ)\nإِلَى أخر الْآيَات)\nرَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Ibn ‘Abbas reported God’s Messenger as saying to his companions, “When your brethren were smitten at the battle of Uhud God put their spirits in the crops of green birds which go down to the rivers of paradise, eat its fruits and nestle in lamps of gold in the shade of the Throne. Then when they experienced the sweetness of their food, drink and rest they asked who would tell their brethren about them that they were alive in paradise in order that they might not cease to desire paradise or recoil in war. God most high said He would tell them about them, so He sent down, ‘And do not consider those who have been killed in God’s path to be dead; nay, they are alive in the presence of their Lord and are being supplied with provision . ..” (Al-Qur’an; 3:169 ff.)\n \nAbu Dawud transmitted it."}},{"id":66,"idInBook":66,"chapterId":19,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيُّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" الْمُؤْمِنُونَ فِي الدُّنْيَا عَلَى ثَلَاثَةِ أَجْزَاءٍ: الَّذِينَ آمَنُوا بِاللَّهِ وَرَسُولِهِ ثُمَّ لَمْ يَرْتَابُوا وَجَاهَدُوا بِأَمْوَالِهِمْ وَأَنْفُسِهِمْ فِي سَبِيلِ اللَّهِ وَالَّذِي يأمنه النَّاس على النَّاسُ عَلَى أَمْوَالِهِمْ وَأَنْفُسِهِمْ ثُمَّ الَّذِي إِذَا أَشْرَفَ عَلَى طَمَعٍ تَرَكَهُ لِلَّهِ عَزَّ وَجَلَّ \". رَوَاهُ أَحْمد","english":{"narrator":"Aba Sa'id al-Khudri reported God’s Messenger as saying, “The believers in the world are in three classes:","text":"those who believe in God and His Messenger and do not doubt, but strive with their property and their persons in God’s path; the man whom people trust with their property and their persons; then the man who, when he is about to display greed, abandons it for the sake of God who is great and glorious.” \n\nAhmad transmitted it."}},{"id":67,"idInBook":67,"chapterId":19,"bookId":14,"arabic":"وَعَن عبدِ الرَّحمنِ بن أبي عَميرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَا مِنْ نَفْسٍ مُسْلِمَةٍ يَقْبِضُهَا رَبُّهَا تُحِبُّ أَنْ تَرْجِعَ إِلَيْكُمْ وَأَنَّ لَهَا الدُّنْيَا وَمَا فِيهَا غير الشَّهِيد» قَالَ ابْن عَمِيرَةَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَأَنْ أُقْتَلَ فِي سَبِيلِ اللَّهِ أَحَبُّ إِلَيَّ مِنْ أَنْ يَكُونَ لِي أَهْلُ الْوَبَرِ وَالْمَدَرِ» . رَوَاهُ النَّسَائِيّ","english":{"narrator":"","text":"‘Abd ar-Rahman b. Abu ‘Amira* reported God’s Messenger as saying, “No Muslim soul which God takes wants to return to you and have the world and what it contains except the martyr.” Ibn Abu ‘Amira told that God’s Messenger said, “That I should be slain in God’s path is dearer to me than to possess the nomads and the townsmen.” \n\n* On p. 725 the name appears as 'Abd ar-Rahman b. Abu ‘Amra al-Ansari. Ibn 'Abd al-Barr, Isti'ab, p 395 treats the two as one man, quoting al-Walid b. Muslim to the effect that he was ‘Abd ar-Rahman b. 'Amra or 'Amira al-Muzani, but in the heading of the section he gives the name as 'Abd ar-Rahman b. Abu 'Amira. He says he has been reputed to have been a companion of the Prophet, but that this is not correct. He was a Syrian.\nNasa’i transmitted it."}},{"id":68,"idInBook":68,"chapterId":19,"bookId":14,"arabic":"وَعَنْ حَسْنَاءَ بِنْتِ مُعَاوِيَةَ قَالَتْ: حَدَّثَنَا عَمِّي قَالَ: قَلْتُ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مَنْ فِي الْجَنَّةِ؟ قَالَ: «النَّبِيُّ فِي الْجَنَّةِ وَالشَّهِيدُ فِي الْجَنَّةِ وَالْمَوْلُودُ فِي الْجَنَّةِ وَالْوَئِيدُ فِي الْجنَّة» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Hasna’ daughter of Mu'awiya said her paternal uncle told her he had asked the Prophet who were in paradise, and he replied, “Prophets are in paradise, martyrs are in paradise, infants are in paradise, and children buried alive are in paradise.” \n\nAbu Dawud transmitted it."}},{"id":69,"idInBook":69,"chapterId":19,"bookId":14,"arabic":"وَعَنْ عَلِيٍّ وَأَبِي الدَّرْدَاءِ وَأَبِي هُرَيْرَةَ وَأَبِي أُمَامَةَ وَعَبْدُ اللَّهِ بْنُ عُمَرَ وَعَبْدُ اللَّهِ بْنُ عَمْرٍو وَجَابِرِ بْنِ عَبْدِ اللَّهِ وَعِمْرَانَ بْنِ حُصَيْنٍ رَضِيَ اللَّهُ عَنْهُمْ أَجْمَعِينَ كُلُّهُمْ يُحَدِّثُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ: «مَنْ أَرْسَلَ نَفَقَةً فِي سبيلِ الله وأقامَ فِي بيتِه فلَه بكلِّ دِرْهَمٍ سَبْعُمِائَةِ دِرْهَمٍ وَمَنْ غَزَا بِنَفْسِهِ فِي سَبِيلِ اللَّهِ وَأَنْفَقَ فِي وَجْهِهِ ذَلِكَ فَلَهُ بِكُلِّ دِرْهَمٍ سَبْعُمِائَةِ أَلْفِ دِرْهَمٍ» . ثُمَّ تَلَا هذهِ الآيةَ: (واللَّهُ يُضاعفُ لمنْ يشاءُ)\nرَوَاهُ ابنُ مَاجَه","english":{"narrator":"","text":"‘Ali, Abud Darda’, Abu Huraira, Abu Umama, ‘Abdallah b. ‘Umar, ‘Abdallah b. ‘Amr, Jabir b. ‘Abdallah and ‘Imran b. Husain all reported God’s Messenger as saying, \"He who sends a contribution towards God’s path and stays in his house will have seven hundred dirhams for every dirham he contributes, but he who fights in person and contributes towards that expedition of his will have seven hundred thousand dirhams for every dirham he contributes.” Then he recited this verse, \"And God multiplies to whom He will.” (Al-Qur’an; 2:261)\n\nIbn Majah transmitted it."}},{"id":70,"idInBook":70,"chapterId":19,"bookId":14,"arabic":"وَعَن فَضالةَ بنِ عُبيد قَالَ: سمِعْتُ عمَرَ بن الْخطاب يَقُولُ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: \n\" الشُّهَدَاءُ أَرْبَعَةٌ: رَجُلٌ مُؤْمِنٌ جَيِّدُ الْإِيمَانِ لَقِيَ الْعَدُوَّ فَصَدَقَ اللَّهَ حَتَّى قُتِلَ فَذَلِكَ الَّذِي يَرْفَعُ النَّاسُ إِلَيْهِ أَعْيُنَهُمْ يَوْمَ الْقِيَامَةِ هَكَذَا \" وَرَفَعَ رَأْسَهُ حَتَّى سَقَطَتْ قَلَنْسُوَتُهُ فَمَا أَدْرِي أَقَلَنْسُوَةَ عُمَرَ أَرَادَ أَمْ قَلَنْسُوَةَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ؟ قَالَ: «وَرَجُلٌ مُؤْمِنٌ جَيِّدُ الْإِيمَانِ لَقِيَ الْعَدُوَّ كَأَنَّمَا ضَرَبَ جِلْدَهُ بِشَوْكٍ طَلْحٍ مِنَ الْجُبْنِ أَتَاهُ سَهْمٌ غَرْبٌ فَقَتَلَهُ فَهُوَ فِي الدَّرَجَةِ الثَّانِيَةِ وَرَجُلٌ مُؤْمِنٌ خَلَطَ عَمَلًا صَالِحًا وَآخَرَ سَيِّئًا لَقِيَ الْعَدُوَّ فَصَدَقَ اللَّهَ حَتَّى قُتِلَ فَذَلِكَ فِي الدَّرَجَةِ الثَّالِثَةِ وَرَجُلٌ مُؤْمِنٌ أَسْرَفَ عَلَى نَفْسِهِ لَقِيَ الْعَدُوَّ فَصَدَقَ اللَّهَ حَتَّى قُتِلَ فَذَاكَ فِي الدَّرَجَةِ الرَّابِعَةِ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ","english":{"narrator":"Fadala b. ‘Ubaid told of hearing ‘Umar b. al-Khattab say he had heard God’s Messenger saying, \"The martyrs are of four types:","text":"(1) a believing man whose faith is good who meets the enemy and is sincere towards God till he is killed, and that is the one to whom men will raise their eyes on the day of resurrection thus (raising his head till his cap fell off, but I do not know whether he meant ‘Umar’s cap or the Prophet’s cap); (2) a believing man whose faith is good, who meets the enemy and appears as if his skin had been torn by acacia thorns through cowardice, and then is killed by a random arrow, he being in the second class; (3) a believing man who mingles a good deed with another which is bad who meets the enemy and is sincere towards God till he is killed, that one being in the third class; (4) a believing man who has been dissipated who meets the enemy and is sincere towards God till he is killed, that one being in the fourth class.” \n\nTirmidhi transmitted it, saying this is hasan gharib tradition."}},{"id":71,"idInBook":71,"chapterId":19,"bookId":14,"arabic":"وَعَن عُتبةَ بن عبدٍ السَّلَميِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: \n\" الْقَتْلَى ثَلَاثَة: مُؤمن جَاهد نَفسه وَمَالِهِ فِي سَبِيلِ اللَّهِ فَإِذَا لَقِيَ الْعَدُوَّ قَاتَلَ حَتَّى يُقْتَلَ \" قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيهِ: «فَذَلِكَ الشَّهِيدُ الْمُمْتَحَنُ فِي خَيْمَةِ اللَّهِ تَحْتَ عَرْشِهِ لَا يَفْضُلُهُ النَّبِيُّونَ إِلَّا بِدَرَجَةِ النُّبُوَّةِ وَمُؤْمِنٌ خَلَطَ عَمَلًا صَالِحًا وَآخَرَ سَيِّئًا جَاهَدَ بِنَفْسِهِ وَمَالِهِ فِي سَبِيلِ اللَّهِ إِذَا لَقِيَ الْعَدُوَّ قَاتَلَ حَتَّى يُقْتَلَ» قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيهِ: «مُمَصْمِصَةٌ مَحَتْ ذُنُوبَهُ وَخَطَايَاهُ إِنَّ السَّيْفَ مَحَّاءٌ لِلْخَطَايَا وَأُدْخِلَ مِنْ أَيِّ أَبْوَابِ الْجَنَّةِ شَاءَ وَمُنَافِقٌ جَاهَدَ بِنَفْسِهِ وَمَالِهِ فَإِذَا لَقِيَ الْعَدُوَّ قَاتَلَ حَتَّى يُقْتَلَ فَذَاكَ فِي النَّارِ إِنَّ السيفَ لَا يمحُو النِّفاقَ» . رَوَاهُ الدارميُّ","english":{"narrator":"‘Utba b. ‘Abd as-Sulami reported God’s Messenger as saying, “The slain are of three types:","text":"(1) a believer who strives with his property and person in God’s path and when he meets the enemy fights till he is killed. (Of him the Prophet said that that martyr who has suffered trial is in God's tent under- His Throne and is not excelled by the prophets except in the degree of the prophetic office.) (2) A believer who mingles a good deed with another which is evil, who fights with his person and property in God’s path, fighting till he is killed when he meets the enemy. (Of him the Prophet said that it is a cleansing agent which has obliterated his sins and his errors, for the sword obliterates errors, and he will be introduced by whichever of the gates of paradise he wishes.) (3) A hypocrite who strives with his person and property, and when he meets the enemy fights till he is killed; but that one will go to hell, for the sword does not obliterate hypocrisy.” \n\nDarimi transmitted it."}},{"id":72,"idInBook":72,"chapterId":19,"bookId":14,"arabic":"وَعَن ابْن عائذٍ قَالَ: خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي جِنَازَةِ رَجُلٍ فَلَمَّا وُضِعَ قَالَ عُمَرُ بْنُ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ: لَا تُصَلِّ عَلَيْهِ يَا رَسُولَ اللَّهِ فَإِنَّهُ رَجُلٌ فَاجِرٌ فَالْتَفَتَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى النَّاسِ فَقَالَ: «هَلْ رَآهُ أَحَدٌ مِنْكُمْ عَلَى عَمَلِ الْإِسْلَامِ؟» فَقَالَ رَجُلٌ: نَعَمْ يَا رَسُولَ اللَّهِ حَرَسَ لَيْلَةً فِي سَبِيلِ اللَّهِ فَصَلَّى عَلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَحَثَا عَلَيْهِ التُّرَابَ وَقَالَ: «أَصْحَابُكَ يَظُنُّونَ أَنَّكَ مِنْ أَهْلِ النَّارِ وَأَنَا أَشْهَدُ أَنَّكَ مِنْ أَهْلِ الْجَنَّةِ» وَقَالَ: «يَا عُمَرُ إِنَّكَ لَا تُسْأَلُ عَنْ أَعْمَالِ النَّاسِ وَلَكِنْ تُسْأَلُ عَنِ الْفِطْرَةِ» . رَوَاهُ الْبَيْهَقِيُّ فِي «شُعَبِ الْإِيمَانِ»","english":{"narrator":"","text":"Ibn ‘A’idh told that God’s Messenger went out to a man’s funeral, and when he was laid down ‘Umar b. al-Khattab said, \"Do not pray over him, Messenger of God, for he was a wicked man. Thereupon God’s Messenger turned to the people and asked whether any of them has seen him engaged in anything which indicated that he was a Muslim, and when a man replied, \"Yes, Messenger of God, he acted as guard one night in God's path,” he prayed over him, scattered dust over him, and then said, \"Your companions think you are one of those who go to hell, but I testify that you are one of those who go to paradise.” He then said, \"You will not be questioned, ‘Umar, about what people have done, but you will be questioned about the true religion.”* \n\n* This is taken to mean that he will not be questioned about acts of disobedience, but about indication that one is a Muslim.\n\nBaihaqi transmitted it in Shu'ab al-lman."}},{"id":73,"idInBook":73,"chapterId":19,"bookId":14,"arabic":"عَن عُقْبَةَ بْنِ عَامِرٍ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ عَلَى الْمِنْبَرِ يَقُول: \" (وَأَعدُّوا لَهُ مَا استطَعْتُمْ منْ قُوَّةٍ)\nأَلَا إِنَّ الْقُوَّةَ الرَّمْيُ أَلَا إِنَّ الْقُوَّةَ الرَّمْيُ أَلَا إِنَّ الْقُوَّةَ الرَّمْيُ)\nرَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"‘Uqba b. ‘Amir told that he heard God's Messenger say when he was on the pulpit, “Prepare for them as much strength as you can. Strength is shooting; strength is shooting; strength is shooting.” \n\nMuslim transmitted it."}},{"id":74,"idInBook":74,"chapterId":19,"bookId":14,"arabic":"وَعَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «سَتُفْتَحُ عَلَيْكُمُ الرُّومُ وَيَكْفِيكُمُ اللَّهُ فَلَا يَعْجِزْ أَحَدُكُمْ أَنْ يَلْهُوَ بِأَسْهُمِهِ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"He told that he heard God's Messenger say, “The Byzantines will be defeated at your hands and God will defend you, but let none of you be so careless as not to employ his arrows.”* \n\n* i.e. they must not neglect to practise archery. The idea is that although God defends them, this does not absolve them from effort.\n\nMuslim transmitted it."}},{"id":75,"idInBook":75,"chapterId":19,"bookId":14,"arabic":"وَعَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم يقولُ: «مَنْ علِمَ الرَّميَ ثمَّ تَرَكَهُ فَلَيْسَ مِنَّا أَوْ قَدْ عَصَى» . رَوَاهُ مُسلم","english":{"narrator":"","text":"He told that he heard God’s Messenger say, “If anyone knows how to shoot and gives it up he does not belong to us,” or, “he has been disobedient.” \n\nMuslim transmitted it."}},{"id":76,"idInBook":76,"chapterId":19,"bookId":14,"arabic":"وَعَن سلَمةَ بنِ الأكوَعِ قَالَ: خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى قَوْمٍ مِنْ أَسْلَمَ يَتَنَاضَلُونَ بِالسُّوقِ فَقَالَ: «ارْمُوا بَنِي إِسْمَاعِيلَ فَإِنَّ أَبَاكُمْ كَانَ رَامِيًا وَأَنَا مَعَ بَنِي فُلَانٍ» لِأَحَدِ الْفَرِيقَيْنِ فَأَمْسَكُوا بِأَيْدِيهِمْ فَقَالَ: «مَا لَكُمْ؟» قَالُوا: وَكَيْفَ نَرْمِي وَأَنْتَ مَعَ بَنِي فُلَانٍ؟ قَالَ: «ارْمُوا وَأَنا مَعكُمْ كلكُمْ» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Salama b. al-Akwa‘ told that God’s Messenger went out to some people of Aslam who were having a shooting match in the suq* and said, “Shoot, sons of Ishmael, for your ancestor was an archer. I am supporting the B. so and so,” referring to one of the two parties. They then stopped, and when he asked what was the matter, they replied, “How can we shoot when you are supporting the B. so and so?” He said, “Shoot; I am supporting you all.” \n\n* Different explanations are given. It may be in the market-place (suq). Mirqat, iv, 202 is inclined to understand suq as the plural of saq (leg) and interpret it as meaning that they were on their feet, not riding camels. It has even been said that the reading is as-Sauq and that this is the name of a place; but I can find no reference to any such place. This all goes to show how difficult interpreters can make a passage seem when they let their imagination loose.\n\nBukhari transmitted it."}},{"id":77,"idInBook":77,"chapterId":19,"bookId":14,"arabic":"وَعَن أنسٍ قَالَ: كَانَ أَبُو طَلْحَةَ يَتَتَرَّسُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِتُرْسٍ وَاحِدٍ وَكَانَ أَبُو طَلْحَةَ حَسَنَ الرَّمْيِ فَكَانَ إِذَا رَمَى تَشَرَّفَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَيَنْظُرُ إِلَى مَوضِع نبله. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Anas told that Abu Talha and the Prophet were both using one shield. Abu Talha was a good archer, and when he shot the Prophet looked over and watched where his arrows went. \n\nBukhari transmitted it."}},{"id":78,"idInBook":78,"chapterId":19,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: (الْبَرَكَةُ فِي نَوَاصِي الْخَيل)","english":{"narrator":"","text":"He reported God’s Messenger as saying, “Blessing rests on the forelocks of the horses.” \n\n(Bukhari and Muslim.)"}},{"id":79,"idInBook":79,"chapterId":19,"bookId":14,"arabic":"وَعَن جَرِيرِ بْنِ عَبْدِ اللَّهِ قَالَ: رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَلْوِي نَاصِيَةَ فرسٍ بأصبعِه ويقولُ: \n\" الْخَيْلُ مَعْقُودٌ بِنَوَاصِيهَا الْخَيْرُ إِلَى يَوْمِ الْقِيَامَةِ: الأجْرُ والغَنيمةُ \". رَوَاهُ مُسلم","english":{"narrator":"","text":"Jarir b. ‘Abdallah told that he saw God’s Messenger twisting his finger in a horse’s forelock and saying, \"The horses have good tied in their forelocks till the day of resurrection, i.e. reward and spoil.” \n\nMuslim transmitted it."}},{"id":80,"idInBook":80,"chapterId":19,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنِ احْتَبَسَ فَرَسًا فِي سَبِيل الله إِيمَانًا وتصْديقاً بوَعْدِه فإِنَّ شِبَعَه ورِيَّه ورَوْثَه وبَوْلَه فِي مِيزَانه يَوْم الْقِيَامَة» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Abu Huraira reported God’s Messenger as saying, \"If anyone reserves a horse in God’s path with faith in God and belief in His promise, its food, drink, dung and urine will be in his scale on the day of resurrection.” \n\nBukhari transmitted it."}},{"id":81,"idInBook":81,"chapterId":19,"bookId":14,"arabic":"وَعَنْهُ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم يكرَهُ الشَّكالَ فِي الْخَيْلِ وَالشِّكَالُ: أَنْ يَكُونَ الْفَرَسُ فِي رِجْلِهِ الْيُمْنَى بَيَاضٌ وَفِي يَدِهِ الْيُسْرَى أَوْ فِي يدِه اليُمنى ورِجلِه اليُسرى. رَوَاهُ مُسلم","english":{"narrator":"","text":"He said that God’s Messenger disliked horses with shikal, which means a horse having a white mark on its right hind leg and left foreleg, or on its right foreleg and left hind leg. \n\nMuslim transmitted it."}},{"id":82,"idInBook":82,"chapterId":19,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سابَقَ بينَ الخيلِ الَّتِي أُضمِرَتْ منَ الحَفْياءِ وَأَمَدُهَا ثَنِيَّةُ الْوَدَاعِ وَبَيْنَهُمَا سِتَّةُ أَمْيَالٍ وَسَابَقَ بَيْنَ الْخَيْلِ الَّتِي لَمْ تَضْمُرُ مِنَ الثِّنْيَةِ إِلَى مَسْجِد بني زُرَيْق وَبَينهمَا ميل","english":{"narrator":"","text":"‘Abdallah b. ‘Umar told that God’s Messenger held race between the horses which had been made lean by training from al-Hafya’ to Thaniyat al-Wada’, a distance of six miles, and he held a race between the horses which had not undergone such training from the thaniya* to the mosque of the B. Zuraiq, a distance of a mile. \n\n* Thaniya is a mountain pass. Thaniyat al-Wada' is a pass overlooking Medina by which people went on the road to Mecca.\n\n(Bukhari and Muslim)"}},{"id":83,"idInBook":83,"chapterId":19,"bookId":14,"arabic":"وَعَن أنسٍ قَالَ: كَانَتْ نَاقَةٌ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تُسَمَّى الْعَضْبَاءَ وَكَانَتْ لَا تُسْبَقُ فَجَاءَ أَعْرَابِيٌّ عَلَى قَعُودٍ لَهُ فَسَبَقَهَا فَاشْتَدَّ ذَلِكَ عَلَى الْمُسْلِمِينَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ حَقًّا عَلَى اللَّهِ أَنْ لَا يَرْتَفِعَ شَيْءٌ مِنَ الدُّنْيَا إِلَّا وضَعه» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Anas told that God’s Messenger had a she-camel called al-‘Adba' which had not been outstripped by any other, but a nomadic Arab came on a young riding camel of his and it outstripped it. That distressed the Muslims, but God’s Messenger said, \"It is God’s right that nothing should become exalted in the world without His lowering it.” \n\nBukhari transmitted it."}},{"id":84,"idInBook":84,"chapterId":19,"bookId":14,"arabic":"عَن عُقْبَةَ بْنِ عَامِرٍ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: \n\" إِنَّ اللَّهَ تَعَالَى يُدْخِلُ بِالسَّهْمِ الْوَاحِدِ ثَلَاثَةَ نَفَرٍ الْجَنَّةَ: صَانِعَهُ يَحْتَسِبُ فِي صَنْعَتِهِ الْخَيْرَ وَالرَّامِيَ بِهِ وَمُنَبِّلَهُ فَارْمُوا وَارْكَبُوا وَأَنْ تَرْمُوا أَحَبُّ إِلَيَّ مِنْ أَنْ تَرْكَبُوا كُلُّ شَيْءٍ يَلْهُو بِهِ الرَّجُلُ بَاطِلٌ إِلَّا رَمْيَهُ بِقَوْسِهِ وَتَأْدِيبَهُ فَرَسَهُ وَمُلَاعَبَتَهُ امْرَأَتَهُ فَإِنَّهُنَّ مِنَ الْحَقِّ \". رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ وَزَادَ أَبُو دَاوُد والدارمي: «ومَنْ تركَ الرَّميَ بعدَ مَا عَلِمَهُ رَغْبَةً عَنْهُ فَإِنَّهُ نِعْمَةٌ تَرَكَهَا» . أَوْ قَالَ: «كفرها»","english":{"narrator":"‘Uqba b. ‘Amir told that he heard God’s Messenger say, \"God most high will cause three persons to enter paradise for one arrow:","text":"the maker when he has a good motive in making it, the one who shoots it, and the one who hands it; so shoot and ride, but your shooting is more appreciated by me than your riding. Everything with which a man amuses himself is vain, except his shooting with his bow, his training of his horse, and his playing with his wife, for they pertain to what is right.”\n\t\nTirmidhi and Ibn Majah transmitted it, and Abu Dawud and Darimi added, “If anyone abandons archery after becoming an adept through distaste for it, it is a blessing he has abandoned,\" or he said “for which he has been ungrateful.\""}},{"id":85,"idInBook":85,"chapterId":19,"bookId":14,"arabic":"وَعَن أبي نَجِيحٍ السُّلَميِّ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنْ بَلَغَ بِسَهْمٍ فِي سَبِيلِ اللَّهِ فَهُوَ لَهُ دَرَجَةٌ فِي الْجَنَّةِ وَمَنْ رَمَى بِسَهْمٍ فِي سَبِيلِ اللَّهِ فَهُوَ لَهُ عِدْلُ مُحَرِّرٍ وَمَنْ شَابَ شَيْبَةً فِي الْإِسْلَامِ كَانَتْ لَهُ نُورًا يَوْمَ الْقِيَامَةِ» . رَوَاهُ الْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَانِ. وَرَوَى أَبُو دَاوُدَ الْفَصْلَ الْأَوَّلَ وَالنَّسَائِيُّ الْأَوَّلَ وَالثَّانِيَ وَالتِّرْمِذِيُّ الثَّانِيَ وَالثَّالِثَ وَفِي رِوَايَتِهِمَا: «مَنْ شَابَ شَيْبَةً فِي سَبِيلِ الله» بدَلَ «فِي الْإِسْلَام»","english":{"narrator":"","text":"Abu Najih as-Sulami told that he heard God’s Messenger say, “He who causes an arrow to hit its mark in God’s path will have it count as a degree for him in paradise, if anyone shoots an arrow in God’s path it is equivalent to his setting someone free, and if anyone develops a grey hair on behalf of Islam it will be a light for him on the day of resurrection.\" \n\nBaihaqi transmitted it in Shu'ab al-iman. Abu Dawud transmitted the first section, Nasa’i the first and second, and Tirmidhi the second and third. The version of Nasa’i and Tirmidhi has, “If anyone develops a grey hair in God’s path,” instead of “on behalf of Islam.\""}},{"id":86,"idInBook":86,"chapterId":19,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا سَبَقَ إِلَّا فِي نَصْلٍ أَوْ خُفٍّ أَوْ حَافِرٍ» . رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد وَالنَّسَائِيّ","english":{"narrator":"","text":"Abu Huraira reported God’s Messenger as saying, “Wagers are allowed only for shooting arrows, or racing camels or horses.” \n\nTirmidhi, Abu Dawud and Nasa’i transmitted it."}},{"id":87,"idInBook":87,"chapterId":19,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَدْخَلَ فَرَسًا بَيْنَ فَرَسَيْنِ فَإِنْ كَانَ يُؤْمَنُ أَنْ يَسْبِقَ فَلَا خَيْرَ فِيهِ وَإِنْ كَانَ لَا يُؤْمَنُ أَنْ يَسْبِقَ فَلَا بَأْسَ بِهِ» . رَوَاهُ فِي شَرْحِ السُّنَّةِ وَفِي رِوَايَةِ أَبِي دَاوُدَ: قَالَ: «مَنْ أَدْخَلَ فَرَسًا بَيْنَ فَرَسَيْنِ يَعْنِي وَهُوَ لَا يَأْمَنُ أَنْ يَسْبِقَ فَلَيْسَ بِقِمَارٍ وَمَنْ أَدْخَلَ فَرَسًا بَيْنَ فَرَسَيْنِ وَقَدْ أَمِنَ أَنْ يَسْبِقَ فَهُوَ قمار»","english":{"narrator":"","text":"He reported God's Messenger as saying, “If one enters a horse with two others there is no good in it if he is certain it cannot be beaten, but there is no harm if he is not.\" \n\nIt is transmitted in Sharh as-sunna. In Abu Dawud’s version he said, “If one enters a horse with two others when he is not certain that it cannot be beaten, it is not gambling; but when one enters a horse with two others when he is certain it cannot be beaten, it is gambling.\""}},{"id":88,"idInBook":88,"chapterId":19,"bookId":14,"arabic":"وَعَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا جَلَبَ وَلَا جَنَبَ» . زَادَ يَحْيَى فِي حَدِيثِهِ: «فِي الرِّهَانِ» . رَوَاهُ أَبُو دَاوُدَ وَالنَّسَائِيُّ وَرَوَاهُ التِّرْمِذِيُّ مَعَ زِيَادَة فِي بَاب «الْغَضَب»","english":{"narrator":"","text":"‘Imran b. Husain reported God’s Messenger as saying, “There must be no shouting or leading another horse at one’s side.\"* Yahya added in his tradition, “when racing for a wager.\" \n\n* There must be no shouting to urge one’s horse on, and one must not take a horse alongside him to which he may transfer if he is afraid his horse may be beaten.\n\nAbu Dawud and Nasa’i transmitted it, and Tirmidhi transmitted it with an addition in the section on seizing forcibly."}},{"id":89,"idInBook":89,"chapterId":19,"bookId":14,"arabic":"وَعَن أبي قَتَادَة عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «خَيْرُ الْخَيْلِ الْأَدْهَمُ الْأَقْرَحُ الْأَرْثَمُ ثُمَّ الْأَقْرَحُ الْمُحَجَّلُ طُلُقُ الْيَمِينِ فَإِنْ لَمْ يَكُنْ أَدْهَمَ فَكُمَيْتٌ عَلَى هَذِهِ الشِّيَةِ» . رَوَاهُ التِّرْمِذِيُّ وَالدَّارِمِيُّ","english":{"narrator":"","text":"Abu Qatada reported the Prophet as saying, “The best type of horse is the black one with a blaze on its face and a white spot on its upper lip* next comes the horse with a blaze on its face and white on the legs, except on a right one. If it is not black, then a dark bay horse with those markings.”\n\n* Artham. This may mean either that it has a white spot on its upper lip, or on the point of its nose.\nTirmidhi and Darimi transmitted it."}},{"id":90,"idInBook":90,"chapterId":19,"bookId":14,"arabic":"وَعَنْ أَبِي وَهَبٍ الْجُشَمِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «عَلَيْكُمْ بِكُلِّ كُمَيْتٍ أَغَرَّ مُحَجَّلٍ أَوْ أَشْقَرَ أَغَرَّ مُحَجَّلٍ أَوْ أَدْهَمَ أَغَرَّ مُحَجَّلٍ» . رَوَاهُ أَبُو دَاوُدَ وَالنَّسَائِيّ","english":{"narrator":"","text":"Abu Wahb al-Jushami reported God’s Messenger as saying, ‘‘Keep to every dark bay horse with a white blaze and white on the legs, or sorrel with a white blaze and white on the legs, or black with a white blaze and white on the legs.” \n\nAba Dawud and Nasa'i transmitted it."}},{"id":91,"idInBook":91,"chapterId":19,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يُمْنُ الْخَيْلِ فِي الشُّقْرِ» . رَوَاهُ الترمذيُّ وَأَبُو دَاوُد","english":{"narrator":"","text":"Ibn ‘Abbas reported God's Messenger as saying, “The most favored horses are the sorrel.” \n\nTirmidhi and Abu Dawud transmitted it."}},{"id":92,"idInBook":92,"chapterId":19,"bookId":14,"arabic":"وَعَن عُتبةَ بن عبدٍ السُّلميِّ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَا تَقُصُّوا نَوَاصِيَ الْخَيْلِ وَلَا مَعَارِفَهَا وَلَا أَذْنَابَهَا فَإِنَّ أَذْنَابَهَا مَذَابُّهَا وَمَعَارِفَهَا دِفاءُها وَنَوَاصِيهَا مَعْقُودٌ فِيهَا الْخَيْرُ» . رَوَاهُ أَبُو دَاوُدَ","english":{"narrator":"","text":"‘Utba b. ‘Abd as-Sulami told that he heard God’s Messenger say, “Do not cut the forelocks, manes, or tails of horses, for their tails are their means of driving off flies, their manes provide them with warmth, and blessing is tied to their forelocks.” \n\nAbu Dawud transmitted it."}},{"id":93,"idInBook":93,"chapterId":19,"bookId":14,"arabic":"وَعَنْ أَبِي وَهَبٍ الْجُشَمِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" ارْتَبِطُوا الْخَيْلَ وامسحُوا بنواصيها وأعجازِها أَو قَالَ: كفالِها وَقَلِّدُوهَا وَلَا تُقَلِّدُوهَا الْأَوْتَارَ \". رَوَاهُ أَبُو دَاوُدَ وَالنَّسَائِيّ","english":{"narrator":"","text":"Aba Wahb al-Jushami reported God’s Messenger as saying, “Tie the horses, rub down their forelocks and rumps (or he said, their buttocks), and put things on their necks, but do not put bowstrings.”* \n\n* The reason for this is that bowstrings may injure them.\n\nAbu Dawud and Nasa’i transmitted it."}},{"id":94,"idInBook":94,"chapterId":19,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَبْدًا مَأْمُورًا مَا اخْتَصَّنَا دُونَ النَّاسِ بِشَيْءٍ إِلَّا بِثَلَاثٍ: أَمَرَنَا أَنْ نُسْبِغَ الْوُضُوءَ وَأَنْ لَا نَأْكُلَ الصَّدَقَةَ وَأَنْ لَا نَنْزِيَ حمارا على فرس. رَوَاهُ التِّرْمِذِيّ وَالنَّسَائِيّ","english":{"narrator":"Ibn ‘Abbas said:","text":"God’s Messenger was a servant under command who applied to us* only three things which he did not apply to the people in general. He ordered us to perform ablution fully, not to consume sadaqa, and not to make an ass cover a mare. \n\n* He means the members of the Prophet’s family.\n\nTirmidhi and Nasa’i transmitted it."}},{"id":95,"idInBook":95,"chapterId":19,"bookId":14,"arabic":"وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ: أُهْدِيَتْ رَسُول الله صلى الله عَلَيْهِ وَسلم بغلةٌ فركِبَهَا فَقَالَ عَلِيٌّ: لَوْ حَمَلْنَا الْحَمِيرَ عَلَى الْخَيْلِ فَكَانَتْ لَنَا مِثْلُ هَذِهِ؟ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّمَا يَفْعَلُ ذَلِكَ الَّذِينَ لَا يعلمُونَ» . رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ","english":{"narrator":"","text":"‘Ali told that God's Messenger was presented with a she-mule which he rode, so ‘Ali said, “If we made asses cover mares we would have animals of this type,” to which God’s Messenger replied, “Only those who do not know do that.” \n\nAbu Dawud and Nasa’i transmitted it."}},{"id":96,"idInBook":96,"chapterId":19,"bookId":14,"arabic":"وَعَن أنسٍ قَالَ: كَانَتْ قَبِيعَةُ سَيْفِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ فِضَّةٍ. رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُد وَالنَّسَائِيّ والدارمي","english":{"narrator":"","text":"Anas said the pommel of God's Messenger’s sword was of silver. \n\nTirmidhi, Abu Dawud, Nasa'i and Darimi transmitted it."}},{"id":97,"idInBook":97,"chapterId":19,"bookId":14,"arabic":"وَعَنْ هُودِ بْنِ عَبْدِ اللَّهِ بْنِ سَعْدٍ عَن جدِّهِ مِزيدةَ قَالَ: دَخَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْفَتْحِ وَعَلَى سَيْفِهِ ذَهَبٌ وَفِضَّةٌ. رَوَاهُ التِّرْمِذِيّ وَقَالَ: هَذَا حَدِيث غَرِيب","english":{"narrator":"","text":"Hud b, ‘Abdallah b. Sa'd quoted his grandfather Mazida* as saying that on the day of the Conquest of Mecca God’s Messenger entered with gold and silver on his sword. \n\n*i.e. on his mother’s side.\n\nTirmidhi transmitted it, saying this is a gharib tradition."}},{"id":98,"idInBook":98,"chapterId":19,"bookId":14,"arabic":"وَعَن السَّائِب بْنِ يَزِيدَ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ عَلَيْهِ يَوْمَ أُحُدٍ دِرْعَانِ قَدْ ظَاهَرَ بَيْنَهُمَا. رَوَاهُ أَبُو دَاوُدَ وَابْنُ مَاجَهْ","english":{"narrator":"","text":"As-Sa’ib b. Yazid told that the Prophet wore two coats of mail at the battle of Uhud as a double protection. \n\nAbu Dawud and Ibn Majah transmitted it."}},{"id":99,"idInBook":99,"chapterId":19,"bookId":14,"arabic":"قَالَ: كَانَتْ رَايَةُ نَبِيِّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَوْدَاءَ وَلِوَاؤُهُ أبيضَ. رَوَاهُ التِّرْمِذِيّ وَابْن مَاجَه","english":{"narrator":"","text":"Ibn ‘Abbas said that the Prophet’s standard1 was black and his banner2 white. \n\n1. Raya.\n2. Liwa’. The standard was larger than the banner.\n\nTirmidhi and Ibn Majah transmitted it."}},{"id":100,"idInBook":100,"chapterId":19,"bookId":14,"arabic":"وَعَنْ مُوسَى بْنِ عُبَيْدَةَ مَوْلَى مُحَمَّدِ بْنِ الْقَاسِمِ قَالَ: بَعَثَنِي مُحَمَّدُ بْنُ الْقَاسِمِ إِلَى الْبَرَاءِ بْنِ عَازِبٍ يَسْأَلُهُ عَنْ رَايَةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: كَانَتْ سَوْدَاءَ مُرَبَّعَةً مِنْ نَمِرَةٍ. رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَأَبُو دَاوُد","english":{"narrator":"","text":"Musa b. ‘Ubaida, client of Muhammad b. al-Qasim, told that Muhammad b. al-Qasim sent him to al-Bara’ b. ‘Azib to ask him about God’s Messenger’s standard, and he said it was black and square, being made of a woollen rug.\n\nAhmad, Tirmidhi and Abu Dawud transmitted it."}},{"id":101,"idInBook":101,"chapterId":19,"bookId":14,"arabic":"وَعَنْ جَابِرٌ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ مَكَّةَ وَلِوَاؤُهُ أَبْيَضُ. رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ","english":{"narrator":"","text":"Jabir said that when the Prophet entered Mecca his banner was white. \n\nTirmidhi, Abu Dawud and Ibn Majah transmitted it."}},{"id":102,"idInBook":102,"chapterId":19,"bookId":14,"arabic":"عَن أنسٍ قَالَ: لَمْ يَكُنْ شَيْءٌ أَحَبَّ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْدَ النِّسَاءِ من الْخَيل. رَوَاهُ النَّسَائِيّ","english":{"narrator":"","text":"Anas said that, after women, nothing was dearer to God's Messenger than horses. \n\nNasa’i transmitted it."}},{"id":103,"idInBook":103,"chapterId":19,"bookId":14,"arabic":"وَعَن عَليّ قَالَ: كَانَتْ بِيَدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَوْسٌ عَرَبِيَّةٌ فَرَأَى رَجُلًا بِيَدِهِ قَوْسٌ فَارِسِيَّةٌ قَالَ: «مَا هَذِهِ؟ أَلْقِهَا وَعَلَيْكُمْ بِهَذِهِ وَأَشْبَاهِهَا وَرِمَاحِ الْقَنَا فَإِنَّهَا يُؤَيِّدُ اللَّهُ لَكُمْ بِهَا فِي الدِّينِ وَيُمَكِّنُ لَكُمْ فِي البلادِ» . رَوَاهُ ابْن مَاجَه","english":{"narrator":"","text":"‘Ali told that God’s Messenger had in his hand an Arab bow, and on seeing a man with a Persian bow in his hand he said, “What is this? Throw it away. Keep* to this and such like, and to spears with shafts, for God will help you to support the religion with them and establish you in the land.” \n\n* This verb is in the plural, indicating that, after the man is told to throw away the bow he is carrying, a general command is given to the people.\n\nIbn Majah transmitted it."}},{"id":104,"idInBook":104,"chapterId":19,"bookId":14,"arabic":"عَن كَعْب بْنِ مَالِكٍ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ يَوْمَ الْخَمِيسِ فِي غَزْوَةِ تَبُوكَ وَكَانَ يُحِبُّ أَنْ يَخْرُجَ يَوْمَ الْخَمِيسِ. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Ka'b b. Malik said that the Prophet set out on a Thursday in the expedition to Tabuk and that he used to like to set out on a Thursday. \n\nBukhari transmitted it."}},{"id":105,"idInBook":105,"chapterId":19,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَوْ يَعْلَمُ النَّاسُ مَا فِي الْوَحْدَةِ مَا أَعْلَمُ مَا سَارَ رَاكِبٌ بِلَيْلٍ وَحْدَهُ» . رَوَاهُ الْبُخَارِيُّ","english":{"narrator":"","text":"‘Abdallah b. ‘Umar reported God’s Messenger as saying, “If people knew what I know about the dangers of being alone, no rider would travel alone at night.\" \n\nBukhari transmitted it."}},{"id":106,"idInBook":106,"chapterId":19,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَصْحَبُ الْمَلَائِكَةُ رُفْقَةً فِيهَا كَلْبٌ وَلَا جَرَسٌ» . رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"Abu Huraira reported God’s Messenger as saying, “The angels do not go along with a travelling company in which there is a dog or a bell.\" \n\nMuslim transmitted it."}},{"id":107,"idInBook":107,"chapterId":19,"bookId":14,"arabic":"وَعَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْجَرَسُ مَزَامِيرُ الشَّيْطَانِ» . رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"He reported God’s Messenger as saying, “The bell is the devil’s pipes.” \n\nMuslim transmitted it."}},{"id":108,"idInBook":108,"chapterId":19,"bookId":14,"arabic":"وَعَن أبي بشيرٍ الأنصاريِّ: أَنَّهُ كَانَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي بَعْضِ أَسْفَارِهِ فَأَرْسَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَسُولًا: «لَا تبقين فِي رَقَبَة بِغَيْر قِلَادَةٌ مِنْ وَتَرٍ أَوْ قِلَادَةٌ إِلَّا قُطِعَتْ»","english":{"narrator":"","text":"Abu Bashir al-Ansari told that when he was with God's Messenger on one of his journeys God’s Messenger sent one to say, “No necklace of bowstring or anything else must be left on a camel’s neck, but must be cut off.” \n\n(Bukhari and Muslim.)"}},{"id":109,"idInBook":109,"chapterId":19,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا سَافَرْتُمْ فِي الْخِصْبِ فَأَعْطُوا الْإِبِلَ حَقَّهَا مِنَ الْأَرْضِ وَإِذَا سَافَرْتُمْ فِي السَّنَةِ فَأَسْرِعُوا عَلَيْهَا السَّيْرَ وَإِذَا عَرَّسْتُمْ بِاللَّيْلِ فَاجْتَنِبُوا الطَّرِيقَ فَإِنَّهَا طُرُقُ الدَّوَابِّ وَمَأْوَى الْهَوَامِّ بِاللَّيْلِ» . وَفِي رِوَايَةٍ: «إِذَا سَافَرْتُمْ فِي السَّنَةِ فَبَادِرُوا بِهَا نِقْيَهَا» . رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"Abu Huraira reported God’s Messenger as saying, “When you travel in fertile country give the camels their due from the ground, and when you travel in time of drought make them go quickly. When you encamp at night keep away from the roads, for they are where the beasts pass and are the resort of insects at night.\" A version has, “When you travel in time of drought hasten with them while they have their marrow.\" \n\nMuslim transmitted it."}},{"id":110,"idInBook":110,"chapterId":19,"bookId":14,"arabic":"وَعَن أبي سعيد الْخُدْرِيّ قَالَ: بَيْنَمَا نَحْنُ فِي سَفَرٍ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذ جَاءَهُ رَجُلٌ عَلَى رَاحِلَةٍ فَجَعَلَ يَضْرِبُ يَمِينًا وَشِمَالًا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ كَانَ مَعَهُ فَضْلُ ظَهْرٌ فَلْيَعُدْ بِهِ عَلَى مَنْ لَا ظَهْرَ لَهُ وَمَنْ كَانَ لَهُ فَضْلُ زَادٍ فَلْيَعُدْ بِهِ عَلَى مَنْ لَا زَادَ لَهُ» قَالَ: فَذَكَرَ مِنْ أَصْنَافِ الْمَالِ حَتَّى رَأَيْنَا أَنَّهُ لَا حَقَّ لأحدٍ منا فِي فضل. رَوَاهُ مُسلم","english":{"narrator":"Abu Sa'id al-Khudri said:","text":"While we were on a journey with God’s Messenger a man came on a riding beast and began to turn right and left,* whereupon God’s Messenger said, “He who has an extra mount should lend it to him who has none, and he who has extra provision should give it to him who has none.” He said that he mentioned various kinds of property till they began to think none of them had a right to anything extra. \n\n* The camel was evidently tired, and the man seems to have been looking around to see whether he could get any help. Another suggestion is that the man was walking with his goods loaded on the camel, but the wording hardly supports this. Cf. Mirqat, iv, 213 f.\n\nMuslim transmitted it."}},{"id":111,"idInBook":111,"chapterId":19,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «السَّفَرُ قِطْعَةٌ مِنَ الْعَذَابِ يَمْنَعُ أَحَدَكُمْ نَوْمَهُ وَطَعَامَهُ وَشَرَابه فَإِذا قضى نهمه من وَجهه فليعجل إِلَى أَهله»","english":{"narrator":"","text":"Abu Huraira reported God’s Messenger as saying, “Travel is a piece of punishment which deprives a man of his sleep, food and drink; so when he accomplishes his purpose where he has gone he should hasten to his family.” \n\n(Bukhari and Muslim.)"}},{"id":112,"idInBook":112,"chapterId":19,"bookId":14,"arabic":"وَعَن عبدِ اللَّهِ بنِ جعفرٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَدِمَ مَنْ سَفَرٍ تُلُقِّيَ بِصِبْيَانِ أَهْلِ بَيْتِهِ وَإِنَّهُ قَدِمَ مَنْ سَفَرٍ فَسُبِقَ بِي إِلَيْهِ فَحَمَلَنِي بَيْنَ يَدَيْهِ ثُمَّ جِيءَ بِأَحَدِ ابْنَيْ فَاطِمَةَ فَأَرْدَفَهُ خَلْفَهُ قَالَ: فَأُدْخِلْنَا المدينةَ ثلاثةَ على دَابَّة. رَوَاهُ مُسلم","english":{"narrator":"‘Abdallah b. Ja'far said:","text":"When God’s Messenger arrived after a journey he was met by the children of his household. Once when he arrived after a journey I was the first to meet him and he lifted me in front of him. Then one of Fatima’s two sons was brought along and he set him behind him, and we were brought into Medina, three on one beast. \n\nMuslim transmitted it."}},{"id":113,"idInBook":113,"chapterId":19,"bookId":14,"arabic":"وَعَن أنسٍ: أَنَّهُ أَقْبَلَ هُوَ وَأَبُو طَلْحَةَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَفِيَّةُ مُرْدِفَهَا عَلَى رَاحِلَته. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Anas told that he and Abu Talha arrived with God’s Messenger who had Safiya riding behind him on his mount.\n\nBukhari transmitted it."}},{"id":114,"idInBook":114,"chapterId":19,"bookId":14,"arabic":"وَعَنْهُ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَطْرُقُ أَهْلَهُ لَيْلًا وَكَانَ لَا يَدْخُلُ إِلَّا غُدْوَةً أَوْ عَشِيَّةً","english":{"narrator":"","text":"He said that God’s Messenger did not come to his family during the night, but was accustomed to enter only in the morning or in the evening. \n\n(Bukhari and Muslim.)"}},{"id":115,"idInBook":115,"chapterId":19,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «إِذا طَال أَحَدُكُمُ الْغَيْبَةَ فَلَا يَطْرُقْ أَهْلَهُ لَيْلًا»","english":{"narrator":"","text":"Jabir reported God’s Messenger as saying, “When one of you has been away from home for a long time he must not come to his family during the night.” \n\n(Bukhari and Muslim.)"}},{"id":116,"idInBook":116,"chapterId":19,"bookId":14,"arabic":"وَعَنْهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا دَخَلْتَ لَيْلًا فَلَا تَدَخُلْ عَلَى أهلك حَتَّى تستحد المغيبة وتمتشط الشعثة»","english":{"narrator":"","text":"He reported the Prophet as saying, “When you arrive during the night do not go in to your family till the woman whose husband has been away cleans herself and the dishevelled woman combs herself.” \n\n(Bukhari and Muslim.)"}},{"id":117,"idInBook":117,"chapterId":19,"bookId":14,"arabic":"وَعَنْهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا قَدِمَ الْمَدِينَةَ نَحَرَ جَزُورًا أَوْ بَقَرَةً. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"He told that when the Prophet came to Medina he slew a camel or a cow.* \n\n* There seems to be no certainty as to whether this refers to the arrival at the time of the Hijra, or whether the tradition means to indicate a general practice. It is said that the sunna requires one who returns from a journey to provide such entertainment as is within his means. If the use of \"or” in the tradition does not indicate a doubt on the part of the transmitter as to which word is correct, but is a real alternative, this would justify the view that the tradition speaks of a practice of the Prophet. But the Arabic construction really suggests one occasion rather than any time the Prophet came back to Medina.\n\nBukhari transmitted it."}},{"id":118,"idInBook":118,"chapterId":19,"bookId":14,"arabic":"وَعَنْ كَعْبِ بْنِ مَالِكٍ قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَقْدَمُ مِنْ سَفَرٍ إِلَّا نَهَارًا فِي الضُّحَى فَإِذَا قَدِمَ بَدَأَ بِالْمَسْجِدِ فَصَلَّى فِيهِ رَكْعَتَيْنِ ثمَّ جلس فِيهِ للنَّاس","english":{"narrator":"","text":"Ka'b b. Malik said that the Prophet used to arrive from a journey only in the daytime during the forenoon, and that when he arrived he went first to the mosque where he prayed two rak'as, after which he sat in it and gave audience to the people. \n\n(Bukhari and Muslim.)"}},{"id":119,"idInBook":119,"chapterId":19,"bookId":14,"arabic":"وَعَن جَابر قَالَ: كُنْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ فَلَمَّا قَدِمْنَا الْمَدِينَةَ قَالَ لِي: «ادْخُلِ الْمَسْجِدَ فَصَلِّ فِيهِ رَكْعَتَيْنِ» . رَوَاهُ البُخَارِيّ","english":{"narrator":"Jabir said:","text":"I was with the Prophet on a journey, and when we came to Medina he said to me, \"Enter the mosque and pray two rak'as in it.\" \n\nBukhari transmitted it."}},{"id":120,"idInBook":120,"chapterId":19,"bookId":14,"arabic":"عَن صخْرِ بن وَداعةَ الغامِديِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «اللَّهُمَّ بَارِكْ لِأُمَّتِي فِي بُكُورِهَا» وَكَانَ إِذا بعثَ سريَّةً أوْ جَيْشًا بَعَثَهُمْ مِنْ أَوَّلِ النَّهَارِ وَكَانَ صَخْرٌ تَاجِرًا فَكَانَ يَبْعَثُ تِجَارَتَهُ أَوَّلَ النَّهَارِ فَأَثْرَى وَكَثُرَ مالُه. رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد والدارمي","english":{"narrator":"","text":"Sakhr b. Wada'a al-Ghamidi reported God’s Messenger as saying, \"O God, bless my people in their early morning.” When he sent out a detachment or an army he sent them at the beginning of the day. Sakhr was a merchant, and he would send off his merchandise at the beginning of the day; and he became rich and had much wealth. \n\nTirmidhi, Abu Dawud and Darimi transmitted it."}},{"id":121,"idInBook":121,"chapterId":19,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «عَلَيْكُمْ بِالدُّلْجَةِ فَإِنَّ الْأَرْضَ تُطوَى بالليلِ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Anas reported God’s Messenger as saying, \"Keep to travelling by night, for the earth is traversed * by night.” \n\n*Literally ‘the earth is folded up.' The idea is that at night the journey seems shorter.\n\nAbu Dawud transmitted it."}},{"id":122,"idInBook":122,"chapterId":19,"bookId":14,"arabic":"وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الرَّاكِبُ شَيْطَانٌ وَالرَّاكِبَانِ شَيْطَانَانِ وَالثَّلَاثَةُ رَكبٌ» . رَوَاهُ مالكٌ وَالتِّرْمِذِيّ وَأَبُو دَاوُد وَالنَّسَائِيّ","english":{"narrator":"","text":"‘Amr b. Shu'aib, on his father’s authority, told that his grandfather reported God's Messenger as saying, \"A single rider is a devil and a pair of riders are a pair of devils, but three are a company of riders.” \n\nMalik, Tirmidhi, Abu Dawud and Nasa’i transmitted it."}},{"id":123,"idInBook":123,"chapterId":19,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيُّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا كَانَ ثَلَاثَةٌ فِي سَفَرٍ فَلْيُؤَمِّرُوا أحدهم» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Abu Sa'id al-Khudri reported God’s Messenger as saying, \"When three are on a journey they should appoint one of them as their commander.” \n\nAbu Dawud transmitted it."}},{"id":124,"idInBook":124,"chapterId":19,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «خَيْرُ الصَّحَابَةِ أَرْبَعَةٌ وَخَيْرُ السَّرَايَا أَرْبَعُمِائَةٍ وَخَيْرُ الْجُيُوشِ أَرْبَعَةُ آلَافٍ وَلَنْ يُغْلَبَ اثْنَا عَشَرَ أَلْفًا مِنْ قِلَّةٍ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالدَّارِمِيُّ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيث غَرِيب","english":{"narrator":"","text":"Ibn ‘Abbas reported the Prophet as saying, \"The best number of companions is four, the best number in expeditions four hundred, and the best number in armies four thousand; and twelve thousand will not be overcome through smallness of numbers.\" \n\nTirmidhi, Abu Dawud and Darimi transmitted it, Tirmidhi saying this is a gharib tradition."}},{"id":125,"idInBook":125,"chapterId":19,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَخَلَّفُ فِي الْمَسِيرِ فَيُزْجِي الضَّعِيفَ وَيُرْدِفُ ويدْعو لَهُم. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Jabir told that God’s Messenger used to keep to the rear when traveling and urge on the weak. He would take someone up behind him and would make supplication for them all. \n\nAbu Dawud transmitted it."}},{"id":126,"idInBook":126,"chapterId":19,"bookId":14,"arabic":"وَعَن أبي ثعلبَةَ الخُشَنيِّ قَالَ: كَانَ النَّاسُ إِذَا نَزَلُوا مَنْزِلًا تَفَرَّقُوا فِي الشِّعَابِ وَالْأَوْدِيَةِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ تَفَرُّقَكُمْ فِي هَذِهِ الشِّعَابِ وَالْأَوْدِيَةِ إِنَّمَا ذَلِكُمْ مِنَ الشَّيْطَانِ» . فَلَمْ يَنْزِلُوا بَعْدَ ذَلِكَ مَنْزِلًا إِلَّا انْضَمَّ بَعْضُهُمْ إِلَى بَعْضٍ حَتَّى يُقَالَ: لَوْ بُسِطَ عَلَيْهِمْ ثوبٌ لعمَّهم. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Abu Tha'laba al-Khushani said that when the people encamped they scattered in the glens and wadis, but when God’s Messenger said, “Your scattering in these glens and wadis is only of the devil,\" they afterwards kept close together when they encamped to such an extent that it used to be said that if a cloth were spread over them it would cover them all. \n\nAbu Dawud transmitted it."}},{"id":127,"idInBook":127,"chapterId":19,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: كُنَّا يَوْمَ بَدْرٍ كُلَّ ثَلَاثَةٍ عَلَى بَعِيرٍ فَكَانَ أَبُو لُبَابَةَ وَعَلِيُّ بْنُ أَبِي طَالِبٍ زَمِيلَيْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: فَكَانَتْ إِذَا جَاءَتْ عُقْبَةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَا: نَحْنُ نَمْشِي عَنْكَ قَالَ: «مَا أَنْتُمَا بِأَقْوَى مِنِّي وَمَا أَنَا بِأَغْنَى عَنِ الْأَجْرِ مِنْكُمَا» . رَوَاهُ فِي شرح السّنة","english":{"narrator":"‘Abdallah b. Mas’ud said:","text":"At the battle of Badr there was one camel to every three men of us. Abu Lubaba and ‘Ali b. Abu Talib were the travelling companions of God’s Messenger, and when his turn to dismount came they would offer to walk instead of him, but he would reply, “You are not stronger than I am, and I am not more able to dispense with the reward* than you are.\" \n\n* i.e. the reward in the next world for walking part of the way.\n\nIt is transmitted in Sharh as-sunna."}},{"id":128,"idInBook":128,"chapterId":19,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا تَتَّخِذُوا ظُهُورَ دَوَابِّكُمْ مَنَابِرَ فَإِنَّ اللَّهَ تَعَالَى إِنَّمَا سَخَّرَهَا لَكُمْ لِتُبَلِّغَكُمْ إِلَى بَلَدٍ لَمْ تَكُونُوا بَالِغِيهِ إِلَّا بِشِقِّ الْأَنْفُسِ وَجَعَلَ لَكُمُ الْأَرْضَ فَعَلَيْهَا فَاقْضُوا حَاجَاتِكُمْ» . رَوَاهُ أَبُو دَاوُدَ","english":{"narrator":"","text":"Abu Huraira reported the Prophet as saying, “Do not treat the backs of your beasts as pulpits, for God most high has made them subject to you only to convey you to a town which you could not reach without difficulty; and He has appointed the earth for you, so conduct your business on it.\" \n\nAbu Dawud transmitted it."}},{"id":129,"idInBook":129,"chapterId":19,"bookId":14,"arabic":"وَعَن أنسٍ قَالَ: كُنَّا إِذَا نَزَلْنَا مَنْزِلًا لَا نُسَبِّحُ حَتَّى نحُلَّ الرِّحالَ. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"Anas said:","text":"When we encamped we did not glorify God* till we had loosened the saddles. \n\n* This is explained as meaning to perform the salat. Cf. Mirqat, iv, 218.\n\nAbu Dawud transmitted it."}},{"id":130,"idInBook":130,"chapterId":19,"bookId":14,"arabic":"وَعَن بُرَيْدَة قَالَ: بَيْنَمَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَمْشِي إِذا جَاءَهُ رَجُلٌ مَعَهُ حِمَارٌ فَقَالَ: يَا رَسُولَ اللَّهِ ارْكَبْ وَتَأَخَّرَ الرَّجُلُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا أَنْتَ أَحَقُّ بِصَدْرِ دَابَّتِكَ إِلَّا أَنْ تَجْعَلَهُ لِي» . قَالَ: جَعَلْتُهُ لَكَ فَرَكِبَ. رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ","english":{"narrator":"","text":"Buraida told that while God’s Messenger was walking a man who had an ass came to him and, moving to the back of the animal, invited him to mount, but he said, “No; you have more right to ride in front on your animal unless you grant that right to me.\" The man replied that he did, and so he mounted. \n\nTirmidhi and Abu Dawud transmitted it."}},{"id":131,"idInBook":131,"chapterId":19,"bookId":14,"arabic":"وَعَنْ سَعِيدِ بْنِ أَبِي هِنْدٍ عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «تَكُونُ إِبِلٌ لِلشَّيَاطِينِ وَبُيُوتٌ لِلشَّيَاطِينِ» . فَأَمَّا إِبِلُ الشَّيَاطِينِ فَقَدْ رَأَيْتُهَا: يَخْرُجُ أَحَدُكُمْ بِنَجِيبَاتٍ مَعَهُ قَدْ أَسْمَنَهَا فَلَا يَعْلُو بَعِيرًا مِنْهَا وَيَمُرُّ بِأَخِيهِ قَدِ انْقَطَعَ بِهِ فَلَا يَحْمِلُهُ وَأَمَّا بُيُوتُ الشَّيَاطِينِ فَلَمْ أَرَهَا كَانَ سَعِيدٌ يَقُولُ: لَا أُرَاهَا إِلَّا هَذِهِ الْأَقْفَاصَ الَّتِي يَسْتُرُ النَّاسُ بِالدِّيبَاجِ. رَوَاهُ أَبُو دَاوُدَ","english":{"narrator":"","text":"Sa'id b. Abu Hind told that Abu Huraira reported God’s Messenger as saying, “There are camels which belong to devils and houses which belong to devils.\" He1 said he had seen the devils’ camels; one goes out with fine she-camels which he has fattened, neither riding any of them nor giving a lift to a tired brother whom he meets, but he had not seen the devils' houses. Sa'id used to say he thought they were those cages which concealed people2 with brocade. \n\n    1. It is commonly held that this refers to Abu Huraira.\n    2. A various reading has ‘which people concealed’. The cages mean the litters on camels' backs.\n\nAbu Dawud transmitted it."}},{"id":132,"idInBook":132,"chapterId":19,"bookId":14,"arabic":"وَعَن سهلِ بن مُعاذٍ عَن أبيهِ قَالَ: غَزَوْنَا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَضَيَّقَ النَّاسُ الْمُنَازِلَ وَقَطَعُوا الطَّرِيقَ فَبَعَثَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُنَادِيًا يُنادي فِي النَّاسِ: «أَنَّ مَنْ ضَيَّقَ مَنْزِلًا أَوْ قَطَعَ طَرِيقًا فَلَا جِهَادَ لَهُ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"Sahl b. Mu'adh reported his father as saying:","text":"We went on an expedition with the Prophet and the people occupied so much space that they encroached on the road,* so God’s Prophet sent a man to announce among the people, “Those who occupy much space or encroach on the road will not be credited with jihad.” \n\n* This refers to times when they were encamping.\n\nAbu Dawud transmitted it."}},{"id":133,"idInBook":133,"chapterId":19,"bookId":14,"arabic":"وَعَنْ جَابِرٍ رَضِيَ اللَّهُ عَنْهُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ أَحْسَنَ مَا دَخَلَ الرَّجُلُ أَهْلَهُ إِذَا قَدِمَ مِنْ سفرٍ أوَّلُ الليلِ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Jabir reported the Prophet as saying, “The best time for a man to go in to his family on returning from a journey is at the beginning of the night.” \n\nAbu Dawud transmitted it."}},{"id":134,"idInBook":134,"chapterId":19,"bookId":14,"arabic":"عَن أبي قتادةَ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا كَانَ فِي سَفَرٍ فَعَرَّسَ بِلَيْلٍ اضْطَجَعَ عَلَى يَمِينِهِ وَإِذَا عَرَّسَ قُبَيْلَ الصُّبْحِ نَصَبَ ذِرَاعَهُ وَوَضَعَ رَأْسَهُ عَلَى كَفِّهِ. رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Qatada told that when God's Messenger encamped at night on a journey he lay down on his right side, and when he encamped a little before morning he raised his forearm and placed his head on the palm of his hand. \n\nMuslim transmitted it."}},{"id":135,"idInBook":135,"chapterId":19,"bookId":14,"arabic":"وَعَن ابْن عَبَّاس قَالَ: بَعَثَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَبْدَ اللَّهِ بْنَ رَوَاحَةَ فِي سَرِيَّةٍ فَوَافَقَ ذَلِكَ يَوْمَ الْجُمُعَةِ فَغَدَا أَصْحَابُهُ وَقَالَ: أَتَخَلَّفُ وأُصلّي مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ أَلْحَقُهُمْ فَلَمَّا صَلَّى مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَآهُ فَقَالَ: «مَا مَنَعَكَ أَنْ تَغْدُوَ مَعَ أَصْحَابِكَ؟» فَقَالَ: أَرَدْتُ أَنْ أُصَلِّيَ مَعَكَ ثُمَّ أَلْحَقُهُمْ فَقَالَ: «لَوْ أَنْفَقْتَ مَا فِي الْأَرْضِ جَمِيعًا مَا أدركْتَ فضلَ غدْوَتهمْ» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Ibn ‘Abbas told that the Prophet sent ‘Abdallah b. Rawaha with a detachment and that happened to be on a Friday. His companions set off in the morning, but he decided to stay behind and catch up on them after saying the prayer along with God’s Messenger. When he did so he saw him and asked him what had prevented him from going out in the morning with his companions. He replied, “I wanted to pray along with you and then catch up with them,” whereupon he said, “If you were to contribute all the earth contains you would not attain to the excellence of their going out in the morning.” \n\nTirmidhi transmitted it."}},{"id":136,"idInBook":136,"chapterId":19,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَصْحَبُ الْمَلَائِكَةُ رُفْقَةً فِيهَا جِلْدُ نَمِرٍ» . رَوَاهُ أَبُو دَاوُدَ","english":{"narrator":"","text":"Abu Huraira reported God’s Messenger as saying, “The angels do not go with a travelling company in which there is a panther skin.” \n\nAbu Dawud transmitted it."}},{"id":137,"idInBook":137,"chapterId":19,"bookId":14,"arabic":"وَعَنْ سَهْلِ بْنِ سَعْدَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «سَيِّدُ الْقَوْمِ فِي السَّفَرِ خَادِمُهُمْ فَمَنْ سَبَقَهُمْ بِخِدْمَةٍ لَمْ يَسْبِقُوهُ بِعَمَلٍ إِلَّا الشَّهَادَةَ» . رَوَاهُ الْبَيْهَقِيّ فِي «شعب الْإِيمَان»","english":{"narrator":"","text":"Sahl b. Sa'd reported God’s Messenger as saying, “The lord of the people on a journey is their servant,* and he who precedes them in service will not be preceded by them on account of any deed but martyrdom.” \n\n* This is said to mean either that the leader must look after the interests of his followers, or that even the humblest member who serves the others is rewarded by God as if he were the dealer.\n\nBaihaqi transmitted it in Shu'ab al-iman."}},{"id":138,"idInBook":138,"chapterId":19,"bookId":14,"arabic":"عَنِ ابْنِ عَبَّاسٍ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَتَبَ إِلَى قَيْصَرَ يَدْعُوهُ إِلَى الْإِسْلَامِ وَبَعَثَ بِكِتَابِهِ إِلَيْهِ دِحْيَةَ الْكَلْبِيَّ وَأَمَرَهُ أَنْ يَدْفَعَهُ إِلَى عَظِيمِ بُصْرَى لِيَدْفَعَهُ إِلَى قَيْصَرَ فَإِذَا فِيهِ: \n\" بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ مِنْ مُحَمَّدٍ عَبْدِ اللَّهِ وَرَسُولِهِ إِلَى هِرَقْلَ عَظِيمِ الرُّومِ سَلَامٌ عَلَى مَنِ اتَّبَعَ الْهُدَى أَمَّا بَعْدُ فَإِنِّي أدْعوكَ بداعيَةِ الْإِسْلَامِ أَسْلِمْ تَسْلَمْ وَأَسْلِمْ يُؤْتِكَ اللَّهُ أَجَرَكَ مَرَّتَيْنِ وَإِنْ تَوَلَّيْتَ فَعَلَيْكَ إِثْمُ الْأَرِيسِيِّينَ وَ (يَا أَهْلَ الْكِتَابِ تَعَالَوْا إِلَى كَلِمَةٍ سَوَاءٍ بَيْنَنَا وَبَيْنَكُمْ أَن لَا نَعْبُدَ إِلَّا اللَّهَ وَلَا نُشْرِكَ بِهِ شَيْئًا وَلَا يَتَّخِذَ بَعْضُنَا بَعْضًا أَرْبَابًا مِنْ دُونِ اللَّهِ فَإِنْ تَوَلَّوْا فَقُولُوا: اشْهَدُوا بِأَنَّا مُسْلِمُونَ)\nمُتَّفَقٌ عَلَيْهِ. وَفِي رِوَايَةٍ لِمُسْلِمٍ قَالَ:\nمِنْ محمَّدٍ رسولِ اللَّهِ \" وَقَالَ: «إِثمُ اليريسيِّينَ» وَقَالَ: «بِدِعَايَةِ الْإِسْلَام»","english":{"narrator":"Ibn ‘Abbas told that the Prophet wrote to Qaisar summoning him to Islam. He sent Dihya al-Kalbi with his letter to him and ordered him to hand it to the governor of Busra for him to convey to Qaisar. Its contents were:","text":"In the name of God, the Compassionate, the Merciful. From Muhammad, God’s servant and Messenger, to Hiraql1 chief of the Byzantines. Peace be to those who follow the guidance. To proceed: I send you the summons to accept Islam (bi da'iyat al-islam). If you accept Islam you will be safe, and if you accept Islam God will bring you your reward twofold; but if you turn away you will be guilty of the sin of your followers (al-arisiyin).2 “0 people of the Book, come to a word which is common between us and you, that we should worship only God, not attribute any partner to Him, or take one another as lords apart from God. But if they turn away say, Testify that we are Muslims.\"3 \n\n    1. Heraclius.\n    2. Arisi means a tiller of the soil, but is here used as a general reference to the common people who will follow his example.\n    3. Al-Qur’an; 3:64.\n\n(Bukhari and Muslim.) A version by Muslim has “From Muhammad God’s Messenger,\" “the sin of al-yarisiyin” and bi-di'ayat al-islam."}},{"id":139,"idInBook":139,"chapterId":19,"bookId":14,"arabic":"وَعَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَ بِكِتَابِهِ إِلَى كِسْرَى مَعَ عَبْدِ اللَّهِ بْنِ حُذَافَةَ السَّهْمِيِّ فَأَمَرَهُ أَنْ يَدْفَعَهُ إِلَى عَظِيمِ الْبَحْرَيْنِ فَدَفَعَهُ عَظِيمُ الْبَحْرَيْنِ إِلَى كِسْرَى فَلَمَّا قَرَأَ مَزَّقَهُ قَالَ ابْنُ الْمُسَيَّبِ: فَدَعَا عَلَيْهِمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُمَزَّقُوا كُلَّ مُمَزَّقٍ. رَوَاهُ الْبُخَارِيُّ","english":{"narrator":"","text":"He told that God’s Messenger sent his letter to Kisra with ‘Abdallah b. Hudhafa as-Sahmi, ordering him to hand it to the governor of al- Bahrain. The governor of al-Bahrain conveyed it to Kisra, and when he read it he tore it up. Ibn al-Musayyib said that God’s Messenger then invoked a curse on them to the effect that they might be torn into little pieces. \n\nBukhari transmitted it."}},{"id":140,"idInBook":140,"chapterId":19,"bookId":14,"arabic":"وَعَنْ أَنَسٍ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَتَبَ إِلَى كِسْرَى وَإِلَى قَيْصَرَ وَإِلَى النَّجَاشِيِّ وَإِلَى كُلِّ جَبَّارٍ يَدْعُوهُمْ إِلَى اللَّهِ وَلَيْسَ بِالنَّجَاشِيِّ الَّذِي صَلَّى عَلَيْهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ. رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"Anas told that the Prophet wrote to Kisra, Qaisar, the Najashi, and every powerful man, summoning them to God, but it was not the Najashi on whom the Prophet invoked a blessing.* \n\n* It says that the Najashi (Negus) of Abyssinia to whom this letter was sent was not the same as the one who ruled at the time when the early emigration from Mecca to Abyssinia took place.\n\nMuslim transmitted it."}},{"id":141,"idInBook":141,"chapterId":19,"bookId":14,"arabic":"وَعَن سليمانَ بنِ بُريدةَ عَنْ أَبِيهِ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَمَّرَ أَمِيرًا عَلَى جَيْشٍ أَوْ سَرِيَّةٍ أَوْصَاهُ فِي خَاصَّتِهِ بِتَقْوَى اللَّهِ وَمَنْ مَعَهُ مِنَ الْمُسْلِمِينَ خَيْرًا ثُمَّ قَالَ: \n\" اغْزُوَا بسمِ اللَّهِ قَاتَلُوا مَنْ كَفَرَ بِاللَّهِ اغْزُوَا فَلَا تَغُلُّوا وَلَا تَغْدِرُوا وَلَا تَمْثُلُوا وَلَا تَقْتُلُوا وَلِيدًا وَإِذَا لَقِيتَ عَدُوَّكَ مِنَ الْمُشْرِكِينَ فَادْعُهُمْ إِلَى ثَلَاثِ خِصَالٍ أَوْ خِلَالٍ فَأَيَّتَهُنَّ مَا أَجَابُوكَ فَاقْبَلْ مِنْهُمْ وَكُفَّ عَنْهُمْ ثُمَّ ادْعُهُمْ إِلَى الْإِسْلَامِ فَإِنْ أَجَابُوكَ فَاقْبَلْ مِنْهُمْ وَكُفَّ عَنْهُمْ ثُمَّ ادْعُهُمْ إِلَى التَّحَوُّلِ مِنْ دَارِهِمْ إِلَى دَارِ الْمُهَاجِرِينَ وَأَخْبِرْهُمْ أَنَّهُمْ إِنْ فَعَلُوا ذَلِكَ فَلَهُمْ مَا لِلْمُهَاجِرِينَ وَعَلَيْهِمْ مَا عَلَى الْمُهَاجِرِينَ فَإِنْ أَبَوْا أَنْ يَتَحَوَّلُوا مِنْهَا فَأَخْبِرْهُمْ أَنَّهُمْ يَكُونُونَ كَأَعْرَابِ الْمُسْلِمِينَ يُجْرَى عَلَيْهِمْ حُكْمُ الله الَّذِي يُجْرَى عَلَيْهِمْ حُكْمُ اللَّهِ الَّذِي يُجْرَى عَلَى الْمُؤْمِنِينَ وَلَا يَكُونُ لَهُمْ فِي الْغَنِيمَةِ وَالْفَيْءِ شَيْءٌ إِلَّا أَنْ يُجَاهِدُوا مَعَ الْمُسْلِمِينَ فَإِنْ هم أَبَوا فعلهم الْجِزْيَةَ فَإِنْ هُمْ أَجَابُوكَ فَاقْبَلْ مِنْهُمْ وَكُفَّ عَنْهُمْ فَإِنْ هُمْ أَبَوْا فَاسْتَعِنْ بِاللَّهِ وَقَاتِلْهُمْ وَإِذَا حَاصَرْتَ أَهْلَ حِصْنٍ فَأَرَادُوكَ أَنْ تَجْعَلَ لَهُمْ ذِمَّةَ اللَّهِ وَذِمَّةَ نَبِيِّهِ فَلَا تَجْعَلْ لَهُمْ ذِمَّةَ اللَّهِ وَلَا ذِمَّةَ نَبِيِّهِ وَلَكِنِ اجْعَلْ لَهُمْ ذِمَّتَكَ وَذِمَّةَ أَصْحَابِكَ فَإِنَّكُمْ أَنْ تُخْفِرُوا ذِمَمَكُمْ وَذِمَمَ أَصْحَابِكُمْ أَهْوَنُ مِنْ أَنْ تُخْفِرُوا ذِمَّةَ اللَّهِ وَذِمَّةَ رَسُولِهِ وَإِنْ حَاصَرْتَ أَهْلَ حِصْنٍ فَأَرَادُوكَ أَنْ تُنْزِلَهُمْ عَلَى حُكْمِ اللَّهِ فَلَا تُنْزِلْهُمْ عَلَى حُكْمِ اللَّهِ وَلَكِنْ أَنْزِلْهُمْ عَلَى حُكْمِكَ فَإِنَّكَ لَا تَدْرِي: أَتُصِيبُ حُكْمَ اللَّهِ فِيهِمْ أَمْ لَا؟ \". رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"Sulaiman b. Buraida told on his father’s authority that when God’s Messenger appointed a commander over an army or a detachment he instructed him to fear God himself and consider the welfare of the Muslims who were with him. He then said, “Go forth in God’s name in God’s path and fight with those who disbelieve in God. Go forth and do not be unfaithful regarding booty, or treacherous, or mutilate anyone, or kill a child. When you meet the polytheists who are your enemy summon them to three things, and accept whichever of them they are willing to agree to, and refrain from them. Then* summon them to Islam, and if they agree accept it from them and refrain from them. Then summon them to leave their abodes and transfer to the abode of the Emigrants, and tell them that if they do so they will have the same rights and responsibilities as the Emigrants; but if they refuse to transfer from them tell them they will be like the desert Arabs who are Muslims, subject to God’s jurisdiction which applies to the believers, but will have no spoil or booty unless they strive with the Muslims. If they refuse demand the jizya from them, and if they agree accept it from them and refrain from them; but if they refuse seek God’s help and fight with them. When you invest a fortress and its people wish you to grant them the protection of God and His prophet, grant them neither but grant them your protection and that of your companions, for it is less serious to break your guarantee of protection and that of your companions than to break that of God and His Messenger. If you invest a fortress and its people offer to capitulate and have the matter referred to God’s jurisdiction, do not grant this, but let them capitulate and have the matter referred to your jurisdiction, for you do not know whether or not you will hit on God’s jurisdiction regarding them.” \n\n* What follows gives in detail the three things mentioned above.\n\nMuslim transmitted it."}},{"id":142,"idInBook":142,"chapterId":19,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ أَبِي أوفى: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي بَعْضِ أَيَّامِهِ الَّتِي لَقِيَ فِيهَا الْعَدُوَّ انْتَظَرَ حَتَّى مَالَتِ الشَّمْسُ ثُمَّ قَامَ فِي النَّاسِ فَقَالَ: «يَا أَيُّهَا النَّاسُ لَا تَتَمَنَّوْا لِقَاءَ الْعَدُوِّ وَاسْأَلُوا اللَّهَ الْعَافِيَةَ فَإِذَا لَقِيتُمْ فَاصْبِرُوا وَاعْلَمُوا أَنَّ الْجَنَّةَ تَحْتَ ظِلَالِ السُّيُوفِ» ثُمَّ قَالَ: «اللَّهُمَّ مُنْزِلَ الْكِتَابِ وَمُجْرِيَ السَّحَابِ وهازم الْأَحْزَاب واهزمهم وَانْصُرْنَا عَلَيْهِم»","english":{"narrator":"","text":"‘Abdallah b. Abu Aufa told that at one of his battles in which God’s Messenger met the enemy he waited till the sun declined, then stood up among the people and said, “You people must not desire to meet the enemy, but must ask God for wellbeing, and when you meet them show endurance and know that paradise is under the shadows of the swords.\" He then said, “O God, who sendest down the Book, makest the clouds to travel and routest the confederates, rout them and give us victory over them.” \n\n(Bukhari and Muslim.)"}},{"id":143,"idInBook":143,"chapterId":19,"bookId":14,"arabic":"وَعَنْ أَنَسٍ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا غَزَا بِنَا قَوْمًا لَمْ يَكُنْ يَغْزُو بِنَا حَتَّى يُصْبِحَ وَيَنْظُرَ إِلَيْهِمْ فَإِنْ سَمِعَ أَذَانًا كَفَّ عَنْهُمْ وَإِنْ لَمْ يَسْمَعْ أَذَانًا أَغَارَ عَلَيْهِمْ قَالَ: فَخَرَجْنَا إِلَى خَيْبَرَ فَانْتَهَيْنَا إِلَيْهِمْ لَيْلًا فَلَمَّا أَصْبَحَ وَلَمْ يسمَعْ أذاناً رِكبَ ورَكِبْتُ خلفَ أبي طلحةَ وَإِنَّ قَدَمِي لَتَمَسُّ قَدِمَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: فَخَرَجُوا إِلَيْنَا بَمَكَاتِلِهِمْ ومساحيهم فَلَمَّا رأى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالُوا: مُحَمَّدٌ واللَّهِ محمّدٌ والخميسُ فلَجؤوا إِلَى الْحِصْنِ فَلَمَّا رَآهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ خَرِبَتْ خَيْبَرُ إِنَّا إِذَا نَزَلْنَا بِسَاحَةِ قومٍ فساءَ صباحُ المُنْذَرينَ»","english":{"narrator":"Anas said:","text":"When the Prophet took us out on an expedition against a people he did not set out with us till the morning. He would look at them, and if he heard a call to prayer he refrained from them, but if he did not hear any he attacked them. We went out to Khaibar and reached them by night, but when the morning came and he heard no call to prayer he mounted. I mounted behind Abu Talha and my foot was touching God’s Prophet’s They came out to us with their large baskets and their spades, and when they saw the Prophet they said, “Muhammad, by God, Muhammad and the army,\" and went for refuge to the fortress. When God's Messenger saw them he said, “God is most great, God is most great. Khaibar has fallen.1 When we alight in the courtyard of a people it is an evil morning for those who have been warned.\"2 \n\n1.\t Or, 'May Khaibar fall. \n2.\t Cf. Al-Qur'an; 37:177.\n\n(Bukhari and Muslim.)"}},{"id":144,"idInBook":144,"chapterId":19,"bookId":14,"arabic":"وَعَن النُّعْمَانِ بْنِ مُقَرِّنٍ قَالَ: شَهِدْتُ الْقِتَالَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَانَ إِذَا لَمْ يُقَاتِلْ أَوَّلَ النَّهَارِ انْتَظَرَ حَتَّى تهب الْأَرْوَاح وتحضر الصَّلَاة. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"An-Nu‘man b. Muqarrin said he was present at fighting along with God’s Messenger, and when he did not fight at the beginning of the day he waited till the winds blew and the time of prayer came. \n\nBukhari transmitted it."}},{"id":145,"idInBook":145,"chapterId":19,"bookId":14,"arabic":"عَن النُّعْمَان بن مقرن قَالَ: شَهِدْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَانَ إِذَا لَمْ يُقَاتِلْ أَوَّلَ النَّهَارِ انْتَظَرَ حَتَّى تَزُولَ الشَّمْسُ وَتَهُبَّ الرِّيَاحُ وينزِلَ النَّصرُ. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"An-Nu‘man b. Muqarrin said he was present at fighting along with God’s Messenger, and when he did not fight at the beginning of the day he waited till the sun had passed the meridian, the winds blew and help came down. \n\nAbu Dawud transmitted it."}},{"id":146,"idInBook":146,"chapterId":19,"bookId":14,"arabic":"وَعَن قتادةَ عَنِ النُّعْمَانِ بْنِ مُقَرِّنٍ قَالَ: غَزَوْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَانَ إِذَا طَلَعَ الْفَجْرُ أَمْسَكَ حَتَّى تَطْلُعَ الشَّمْسُ فَإِذَا طَلَعَتْ قَاتَلَ فَإِذَا انْتَصَفَ النَّهَارُ أَمْسَكَ حَتَّى تَزُولَ الشَّمْسُ فَإِذَا زَالَتِ الشَّمْسُ قَاتَلَ حَتَّى الْعَصْرِ ثُمَّ أَمْسَكَ حَتَّى يُصَلَّى الْعَصْرُ ثُمَّ يُقَاتِلُ قَالَ قَتَادَةُ: كَانَ يُقَالُ: عِنْدَ ذَلِكَ تُهِيجُ رِيَاحُ النَّصْرِ وَيَدْعُو الْمُؤْمِنُونَ لِجُيُوشِهِمْ فِي صلَاتهم. رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"Qatada quoted an-Nu‘man b. Muqarrin as saying:","text":"I went on an expedition with God's Messenger, and when dawn came he waited till the sun rose and when it rose he fought. Then when midday came he stopped till the sun passed the meridian and when it had done so he fought till the afternoon, when he stopped till he prayed the afternoon prayer, and then fought. Qatada told that it used to be said that the winds of victory blew at that time and the believers made supplication for their armies during their prayer. \n\nTirmidhi transmitted it."}},{"id":147,"idInBook":147,"chapterId":19,"bookId":14,"arabic":"وَعَن عصامٍ المزنيِّ قَالَ بَعَثَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَرِيَّةٍ فَقَالَ: «إِذَا رَأَيْتُمْ مَسْجِدًا أَوْ سَمِعْتُمْ مُؤَذِّنًا فَلَا تَقْتُلُوا أَحَدًا» . رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد","english":{"narrator":"Islam al-Muzani said:","text":"God’s Messenger sent us in a detachment and said, “When you see a mosque or hear a mu’adhdhin (The one who makes the call to prayer) do not kill anyone.” \n\nTirmidhi and Abu Dawud transmitted it."}},{"id":148,"idInBook":148,"chapterId":19,"bookId":14,"arabic":"عَن أبي وائلٍ قَالَ: كَتَبَ خَالِدُ بْنُ الْوَلِيدِ إِلَى أَهْلِ فَارِسَ: بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ مِنْ خَالِدِ بْنِ الْوَلِيدِ إِلَى رُسْتَمَ وَمِهْرَانَ فِي مَلَأِ فَارِسَ. سَلَامٌ عَلَى مَنِ اتَّبَعَ الْهُدَى. أَمَّا بَعْدُ فَإِنَّا نَدْعُوكُمْ إِلَى الْإِسْلَامِ فَإِنْ أَبَيْتُمْ فَأَعْطُوا الْجِزْيَةَ عَنْ يَدٍ وَأَنْتُمْ صَاغِرُونَ فَإِنْ أَبَيْتُمْ فَإِنَّ مَعِيَ قَوْمًا يُحِبُّونَ الْقَتْلَ فِي سَبِيلِ اللَّهِ كَمَا يُحِبُّ فَارِسُ الْخَمْرَ وَالسَّلَامُ عَلَى مَنِ اتَّبَعَ الْهُدَى. رَوَاهُ فِي شَرْحِ السّنة 0","english":{"narrator":"Abu Wa’il told that Khalid b. al-Walid wrote to the people of Persia:","text":"In the name of God, the Compassionate, the Merciful. From Khalid b. al-Walid to Rustum and Mih'an among the nobles of Persia. Peace be to those who follow the guidance. To proceed: We summon you to Islam, but if you refuse then pay the jizya in subjection feeling humbled (Cf. Al-Qur'an, 9:29).  If you refuse to do that, I have with me people who love being killed in God’s path as the Persians love wine. Peace be to those who follow the guidance. \n\nIt is transmitted in Sharh as-sunna."}},{"id":149,"idInBook":149,"chapterId":19,"bookId":14,"arabic":"عَن جَابر قَالَ: قَالَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ أُحُدٍ: أَرَأَيْتَ إِنْ قُتِلْتُ فَأَيْنَ أَنَا؟ قَالَ: «فِي الْجنَّة» فَألْقى ثَمَرَات فِي يَده ثمَّ قَاتل حَتَّى قتل","english":{"narrator":"","text":"Jabir told that a man said to the Prophet at the battle of Uhud, “Tell me where I shall be if I am killed,” and that when he replied that he would be in paradise he threw away some dates he had in his hand and fought till he was killed. \n\n(Bukhari and Muslim.)"}},{"id":150,"idInBook":150,"chapterId":19,"bookId":14,"arabic":"وَعَن كَعْب بن مالكٍ قَالَ: لَمْ يَكُنْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُرِيدُ غَزْوَةً إِلَّا وَرَّى بِغَيْرِهَا حَتَّى كَانَتْ تِلْكَ الْغَزْوَةُ يَعْنِي غَزْوَةَ تَبُوكَ غَزَاهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَرٍّ شَدِيدٍ وَاسْتَقْبَلَ سَفَرًا بَعِيدًا وَمَفَازًا وَعَدُوًّا كَثِيرًا فَجَلَّى لِلْمُسْلِمِينَ أَمْرَهُمْ لِيَتَأَهَّبُوا أُهْبَةَ غَزْوِهِمْ فَأَخْبَرَهُمْ بِوَجْهِهِ الَّذِي يُرِيدُ. رَوَاهُ الْبُخَارِيُّ","english":{"narrator":"Ka‘b b. Malik said:","text":"When God’s Messenger intended to go on an expedition he always pretended to be going somewhere else till that expedition, meaning the one to Tabuk. God’s Messenger undertook it in extreme heat, facing a long journey, desert country and a numerous enemy. He made clear to the Muslims what they were about to do in order that they might get ready the equipment for their expedition, telling them where he was going. \n\nBukhari transmitted it."}},{"id":151,"idInBook":151,"chapterId":19,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «الْحَرْب خدعة»","english":{"narrator":"","text":"Jabir reported God's Messenger as saying, “War is deception.”\n\n(Bukhari and Muslim.)"}},{"id":152,"idInBook":152,"chapterId":19,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَغْزُو بِأُمِّ سُلَيْمٍ وَنِسْوَةٍ مِنَ الْأَنْصَارِ مَعَهُ إِذَا غَزَا يَسْقِينَ الْمَاءَ وَيُدَاوِينَ الْجَرْحَى. رَوَاهُ مُسلم","english":{"narrator":"","text":"Anas told that when God’s Messenger went on an expedition he took Umm Sulaim, and he had some women of the Ansar who supplied water and tended the wounded when he made an expedition. \n\nMuslim transmitted it."}},{"id":153,"idInBook":153,"chapterId":19,"bookId":14,"arabic":"وَعَن أُمِّ عطيَّةَ قَالَتْ: غَزَوْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَبْعَ غَزَوَاتٍ أَخْلُفُهُمْ فِي رِحَالِهِمْ فَأَصْنَعُ لَهُمُ الطَّعَامَ وَأُدَاوِي الْجَرْحَى وَأَقُومُ عَلَى المرضى. رَوَاهُ مُسلم","english":{"narrator":"Umm ‘Atiya said:","text":"I went on seven expeditions with God's Messenger and stayed behind to look after the baggage, prepare food for them, tend the wounded and look after the sick. \n\nMuslim transmitted it."}},{"id":154,"idInBook":154,"chapterId":19,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ قَتْلِ النِّسَاءِ وَالصِّبْيَانِ","english":{"narrator":"","text":"‘Abdallah b. ‘Umar said God’s Messenger forbade killing women and children. \n\n(Bukhari and Muslim.)"}},{"id":155,"idInBook":155,"chapterId":19,"bookId":14,"arabic":"وَعَن الصَّعبِ بنِ جِثَّامةَ قَالَ: سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عنْ أهلِ الدَّارِ يَبِيتُونَ مِنَ الْمُشْرِكِينَ فَيُصَابَ مِنْ نِسَائِهِمْ وَذَرَارِيِّهِمْ قَالَ: «هُمْ مِنْهُمْ» . وَفِي رِوَايَةٍ: «هُمْ مِنْ آبائِهم»","english":{"narrator":"","text":"As-Sa‘b b. Jaththama told that God’s Messenger was asked about the polytheists whose settlements were attacked at night when some of their women and offspring were smitten, and replied that they were of their number. A version has it that they were regarded in the same way as their parents. \n\n(Bukhari and Muslim.)"}},{"id":156,"idInBook":156,"chapterId":19,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَطَعَ نَخْلَ بني النَّضيرِ وحرَّقَ وَلها يقولُ حسَّانٌ:\nوَهَانَ عَلَى سَرَاةِ بَنِي لُؤَيٍّ حَرِيقٌ بِالْبُوَيْرَةِ مُستَطيرُ\nوَفِي ذَلِكَ نَزَلَتْ (مَا قَطَعْتُمْ مِنْ لِينَةٍ أَوْ تَرَكْتُمُوهَا قَائِمَةً عَلَى أُصُولِهَا فَبِإِذْنِ اللَّهِ)","english":{"narrator":"Ibn ‘Umar told that God’s Messenger cut down the palm-trees of the B. an-Nadir and burned them. On that Hassan says:","text":"The nobles of the B. Lu’ayy treated lightly a widely dispersed conflagration in al-Buwaira. Concerning that came down, “The palm-trees you cut down or left standing on their roots, it was by God’s permission” (Al-Quran 59:5). \n\n(Bukhari and Muslim.)"}},{"id":157,"idInBook":157,"chapterId":19,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عَوْنٍ: أَنَّ نَافِعًا كَتَبَ إِلَيْهِ يُخْبِرُهُ أَنَّ ابْنَ عمر أخبرهُ أَن ابْن عمر أَخْبَرَهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَغَارَ عَلَى بَنِي الْمُصْطَلِقِ غَارِّينِ فِي نَعَمِهِمْ بِالْمُرَيْسِيعِ فَقتل الْمُقَاتلَة وسبى الذُّرِّيَّة","english":{"narrator":"","text":"‘Abdallah b. ‘Aun said that Nafi‘  wrote to tell him that Ibn ‘Umar informed him the Prophet made an attack on the B. al-Mustaliq attacking their camels in al-Muraisi‘.* He killed the fighting men and took the children captive. \n\n* Ibn Ishaq says this expedition took place in Sha'ban, 6 A.H., but this has been questioned, Muraisi’ was a watering-place belonging to the B. al-Mustaliq.\n\n(Bukhari and Muslim.)"}},{"id":158,"idInBook":158,"chapterId":19,"bookId":14,"arabic":"وَعَن أبي أَسِيدٍ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَنَا يَوْمَ بَدْرٍ حِينَ صَفَفَنَا لِقُرَيْشٍ وَصَفُّوا لَنَا: «إِذَا أَكْثَبُوكُمْ فَعَلَيْكُمْ بِالنَّبْلِ» . وَفِي رِوَايَةٍ: «إِذَا أَكْثَبُوكُمْ فَارْمُوهُمْ وَاسْتَبْقُوا نَبْلَكُمْ» . رَوَاهُ الْبُخَارِيُّ","english":{"narrator":"","text":"Abu Usaid reported the Prophet as saying to them at the battle of Badr when they drew up in line to meet Quraish and they drew up in line to meet them, “When they come near you shoot arrows at them.” A version has, “When they come near you shoot at them, but do not use all your arrows.” \n\nBukhari transmitted it."}},{"id":159,"idInBook":159,"chapterId":19,"bookId":14,"arabic":"عَن عبدِ الرَّحمنِ بن عَوفٍ قَالَ: عَبَّأَنَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ببدر لَيْلًا. رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"‘Abd ar-Rahman b. ‘Auf told that at Badr the Prophet equipped hem at night for battle. \n\nTirmidhi transmitted it."}},{"id":160,"idInBook":160,"chapterId":19,"bookId":14,"arabic":"وَعَن الْمُهلب أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" إِنْ بَيَّتَكُمُ الْعَدُوُّ فَلْيَكُنْ شِعَارُكُمْ: حم لَا ينْصرُونَ \". رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد","english":{"narrator":"","text":"Al-Muhallab reported God’s Messenger as saying, “If the enemy attacks you at night let your war-cry be Ha’ Mim'. They will not be helped’.”*\n\n*These words may be taken from sura 41 which is one beginning with Ha Mim. The other words are in verse 16 of that sura. Cf. 44: 41.\n\nTirmidhi and Abu Dawud transmitted it."}},{"id":161,"idInBook":161,"chapterId":19,"bookId":14,"arabic":"وَعَن سَمُرةَ بن جُندبٍ قَالَ: كَانَ شِعَارُ الْمُهَاجِرِينَ: عَبْدَ اللَّهِ وَشِعَارُ الْأَنْصَار: عبدُ الرَّحمنِ. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Samura b. Jundub said that the war-cry of the Emigrants was ‘Abdallah and that of the Helpers ‘Abd ar-Rahman. \n\nAbu Dawud transmitted it."}},{"id":162,"idInBook":162,"chapterId":19,"bookId":14,"arabic":"وَعَنْ سَلَمَةَ بْنِ الْأَكْوَعِ قَالَ: غَزَوْنَا مَعَ أبي بكر زمن النَّبِي صلى الله عَلَيْهِ وَسلم فبيَّتْناهُم نَقْتُلُهُمْ وَكَانَ شِعَارُنَا تِلْكَ اللَّيْلَةَ: أَمِتْ أَمِتْ. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"Salama b. al-Akwa‘  said:","text":"We went on an expedition with Abu Bakr in the time of the Prophet. We attacked the enemy by night and killed them, and our war-cry that night was “Put to death; put to death.” \n\nAbu Dawud transmitted it."}},{"id":163,"idInBook":163,"chapterId":19,"bookId":14,"arabic":"وَعَن قيسِ بنِ عُبادٍ قَالَ: كَانَ أَصْحَابُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَكْرَهُونَ الصَّوْتَ عِنْدَ الْقِتَالِ. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Qais b. ‘Ubad said that God’s Messenger’s companions disliked shouting while fighting. \n\nAbu Dawud transmitted it."}},{"id":164,"idInBook":164,"chapterId":19,"bookId":14,"arabic":"وَعَن سَمُرَة بن جُنْدُبٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «اقْتُلُوا شُيُوخَ الْمُشْرِكِينَ وَاسْتَحْيُوا شَرْخَهُمْ» أَيْ صِبْيَانَهُمْ. رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد","english":{"narrator":"","text":"Samura b. Jundub reported the Prophet as saying, “Kill the old men who are polytheists, but spare their sharkh i.e., their children. \n\nTirmidhi and Abu Dawud transmitted it."}},{"id":165,"idInBook":165,"chapterId":19,"bookId":14,"arabic":"وَعَن عُروَةَ قَالَ: حدَّثني أسامةُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ عَهِدَ إِلَيْهِ قَالَ: «أَغِرْ عَلَى أُبْنَى صباحا وَحرق» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"‘Urwa said Usama told him that God's Messenger enjoined him to attack Ubna in the morning and burn the place. \n\nAbu Dawud transmitted it."}},{"id":166,"idInBook":166,"chapterId":19,"bookId":14,"arabic":"وَعَنْ أَبِي أُسَيْدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ بَدْرٍ: «إِذَا أَكْثَبُوكُمْ فَارْمُوهُمْ وَلَا تَسُلُّوا السُّيُوفَ حَتَّى يَغْشَوْكُمْ» . رَوَاهُ أَبُو دَاوُدَ","english":{"narrator":"","text":"Abu Usaid reported God’s Messenger as saying at the battle of Badr, “When they come near you shoot at them, but do not draw your swords till they are close upon you.” \n\nAbu Dawud transmitted it."}},{"id":167,"idInBook":167,"chapterId":19,"bookId":14,"arabic":"وَعَن رَبَاح بن الرَّبيعِ قَالَ: كُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غزوةٍ فَرَأى الناسَ مجتمعينَ عَلَى شَيْءٍ فَبَعَثَ رَجُلًا فَقَالَ: «انْظُرُوا عَلَى من اجْتمع هَؤُلَاءِ؟» فَقَالَ: عَلَى امْرَأَةٍ قَتِيلٍ فَقَالَ: «مَا كَانَتْ هَذِهِ لِتُقَاتِلَ» وَعَلَى الْمُقَدِّمَةِ خَالِدُ بْنُ الْوَلِيدِ فَبَعَثَ رَجُلًا فَقَالَ: \n\" قُلْ لِخَالِدٍ: لَا تَقْتُلِ امْرَأَة وَلَا عسيفا \". رَوَاهُ أَبُو دَاوُد","english":{"narrator":"Rabah b. ar-Rabi’ said:","text":"When we were with God’s Messenger on an expedition he saw some people collected together over something and sent a man whom he told to see what these people were collected around. When he came and told him they were round a woman who had been killed he said, “This is not one with whom fighting should have taken place.” Khalid b. al-Walid was in charge of the van, so he sent a man to tell him not to kill a woman or a hired servant. \n\nAbu Dawud transmitted it."}},{"id":168,"idInBook":168,"chapterId":19,"bookId":14,"arabic":"وَعَنْ أَنَسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «انْطَلِقُوا بِاسْمِ اللَّهِ وَبِاللَّهِ وعَلى ملِّة رسولِ الله لَا تقْتُلوا شَيْخًا فَانِيًا وَلَا طِفْلًا صَغِيرًا وَلَا امْرَأَةً وَلَا تَغُلُّوا وَضُمُّوا غَنَائِمَكُمْ وَأَصْلِحُوا وَأَحْسِنُوا فَإِنَّ اللَّهَ يحبُّ المحسنينَ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Anas reported God's Messenger as saying, “Go in God’s name, trusting in God, and adhering to the religion of God’s Messenger. Do not kill a decrepit old man, or a young infant, or a woman; do not be dishonest about booty, but collect your spoils, do right and act well, for God loves those who do well.”* \n\n* Cf. Al-Qur’an; 2: 195; 5:13.\n\nAbu Dawud transmitted it."}},{"id":169,"idInBook":169,"chapterId":19,"bookId":14,"arabic":"وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ: لَمَّا كَانَ يَوْمُ بَدْرٍ تَقَدَّمَ عُتْبَةُ بْنُ رَبِيعَةَ وَتَبِعَهُ ابْنُهُ وَأَخُوهُ فَنَادَى: مَنْ يُبَارِزُ؟ فَانْتُدِبَ لَهُ شبابٌ مِنَ الْأَنْصَارِ فَقَالَ: مَنْ أَنْتُمْ؟ فَأَخْبَرُوهُ فَقَالَ: لَا حَاجَةَ لَنَا فِيكُمْ إِنَّمَا أَرَدْنَا بَنِي عَمِّنَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «قُمْ يَا حَمْزَةُ قُمْ يَا عَلِيُّ قُمْ يَا عُبَيْدَةُ بْنَ الْحَارِثِ» . فَأَقْبَلَ حَمْزَةُ إِلى عتبةَ وَأَقْبَلْتُ إِلَى شَيْبَةَ وَاخْتَلَفَ بَيْنَ عُبَيْدَةَ وَالْوَلِيدِ ضَرْبَتَانِ فَأَثْخَنَ كُلُّ وَاحِدٍ مِنْهُمَا صَاحِبَهُ ثُمَّ مِلْنَا عَلَى الْوَلِيدِ فَقَتَلْنَاهُ وَاحْتَمَلْنَا عُبَيْدَةَ. رَوَاهُ أَحْمد وَأَبُو دَاوُد","english":{"narrator":"‘Ali said:","text":"At the battle of Badr 'Utba b. Rabi'a came forward followed by his son and his brother and cried out, “Who will engage in single combat?” Some young men of the Helpers responded to his call, but when he asked them who they were and they told him he said, “I have no use for you; I want only my cousins on my father’s side.” God’s Messenger then said, “Get up, Hamza; get up, ‘Ali; get up, ‘Ubaida b. al-Harith.” Hamza went forward to ‘Utba, I went forward to Shaiba, and after two blows had been exchanged between ‘Ubaida and al-Walid they wounded one another severely; so we turned against al-Walid, and when we had killed him we carried ‘Ubaida away. \n\nAhmad and Abu Dawud transmitted it."}},{"id":170,"idInBook":170,"chapterId":19,"bookId":14,"arabic":"وَعَن ابنِ عُمر قَالَ: بَعَثَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَرِيَّةٍ فَحَاصَ النَّاسُ حَيْصَةً فَأَتَيْنَا الْمَدِينَةَ فَاخْتَفَيْنَا بِهَا وَقُلْنَا: هَلَكْنَا ثُمَّ أَتَيْنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْنَا: يَا رَسُول الله نَحن الفارون. قَالَ: «بَلْ أَنْتُمُ الْعَكَّارُونَ وَأَنَا فِئَتُكُمْ» . رَوَاهُ التِّرْمِذِيُّ. وَفِي رِوَايَةِ أَبِي دَاوُدَ نَحْوَهُ وَقَالَ: «لَا بَلْ أَنْتُمُ الْعَكَّارُونَ» قَالَ: فَدَنَوْنَا فَقَبَّلْنَا يَده فَقَالَ: «أَنا فِئَة من الْمُسْلِمِينَ»","english":{"narrator":"Ibn ‘Umar said:","text":"God’s Messenger sent us with a detachment and the people wheeled round in flight, so when we came to Medina we hid in it thinking that we had become corrupted.1 Then we went to God’s Messenger and told him we were those who had fled, but he replied, “No, you are the ones who return to fight after wheeling away, and I am your main body.”2 \n\n1. Literally “had perished.” They thought that they had committed a serious sin by turning in flight.\n2. The word fi’a is here used. The suggestion is that to withdraw to join one’s unit stationed in the rear is not flying from the enemy. Cf. Al-Qur’an; 8:16.\n\nTirmidhi transmitted it. Abu Dawud’s version has something similar. He said, “No, you are the ones who return to fight after wheeling away.” We then approached and kissed his hand, and he said, “I am the main body of the Muslims.”"}},{"id":171,"idInBook":171,"chapterId":19,"bookId":14,"arabic":"عَنْ ثَوْبَانَ بْنِ يَزِيدَ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَصَبَ الْمَنْجَنِيقَ عَلَى أَهْلِ الطائفِ. رَوَاهُ التِّرْمِذِيّ مُرْسلا","english":{"narrator":"","text":"Thauban b. Yazid told that the Prophet set up the ballista when attacking the people of at-Ta’if. \n\nTirmidhi transmitted it in mursal form."}},{"id":172,"idInBook":172,"chapterId":19,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «عَجِبَ اللَّهُ مِنْ قَوْمٍ يُدْخَلُونَ الْجَنَّةَ فِي السَّلَاسِلِ» . وَفِي رِوَايَةٍ: «يُقَادُونَ إِلى الجنَّةِ بالسلاسل» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Abu Huraira reported the Prophet as saying, “God is charmed with people who will enter paradise in chains.”* A version has, “who will be led to paradise in chains.” \n\n*This is explained as meaning non-Muslims who are taken prisoner and accept Islam.\n\nBukhari transmitted it."}},{"id":173,"idInBook":173,"chapterId":19,"bookId":14,"arabic":"وَعَنْ سَلَمَةَ بْنِ الْأَكْوَعِ قَالَ أَتَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَيْنٌ مِنَ الْمُشْرِكِينَ وَهُوَ فِي سَفَرٍ فَجَلَسَ عِنْدَ أَصْحَابِهِ يَتَحَدَّثُ ثُمَّ انْفَتَلَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «اطْلُبُوهُ وَاقْتُلُوهُ» . فَقَتَلْتُهُ فنفَّلَني سلبَه","english":{"narrator":"Salama b. al-Akwa‘ said:","text":"A spy of the polytheists who came to the Prophet when he was on a journey sat and talked with his companions and afterwards withdrew. The Prophet then said, “Look for him and kill him,” so I killed him and the Prophet gave me the spoil taken from him. \n\n(Bukhari and Muslim.)"}},{"id":174,"idInBook":174,"chapterId":19,"bookId":14,"arabic":"وَعَنْهُ قَالَ: غَزَوْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَوَازِنَ فَبَيْنَا نَحْنُ نَتَضَحَّى مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذْ جَاءَ رَجُلٌ عَلَى جَمَلٍ أَحْمَرَ فَأَنَاخَهُ وَجَعَلَ يَنْظُرُ وَفِينَا ضَعْفَةٌ وَرِقَّةٌ مِنَ الظَّهْرِ وَبَعْضُنَا مُشَاةٌ إِذْ خَرَجَ يَشْتَدُّ فَأَتَى جَمَلَهُ فَأَثَارَهُ فَاشْتَدَّ بِهِ الْجَمَلُ فَخَرَجْتُ أَشْتَدُّ حَتَّى أَخَذْتُ بِخِطَامِ الْجَمَلِ فَأَنَخْتُهُ ثُمَّ اخْتَرَطْتُ سَيْفِي فَضَرَبْتُ رَأْسَ الرَّجُلِ ثُمَّ جِئْتُ بِالْجَمَلِ أَقُودُهُ وَعَلَيْهِ رَحْلُهُ وَسِلَاحُهُ فَاسْتَقْبَلَنِي رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالنَّاسُ فَقَالَ: «مَنْ قَتَلَ الرَّجُلَ؟» قَالُوا: ابْنُ الْأَكْوَعِ فَقَالَ: «لَهُ سَلَبُهُ أَجْمَعُ»","english":{"narrator":"He said:","text":"We went on an expedition with God’s Messenger against Hawazin, and while we were having a meal in the forenoon with God’s Messenger a man came on a red camel, and after he had made it kneel he began to look around. Now we were in a weak condition and in a poor way with regard to mounts, and some of us were on foot. He went out in a hurry and coming to his camel made it go and it went off quickly with him. I hastened out and catching the camel’s nose-rein I made it kneel, then drew my sword and struck the man on his head. I then brought the camel leading it with his saddle and weapons on it, and when God's Messenger and the people met me he asked who had killed the man. On their replying that it was the son of al-Akwa‘, he said, “He gets all his spoil.” \n\n(Bukhari and Muslim.)"}},{"id":175,"idInBook":175,"chapterId":19,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: لَمَّا نَزَلَتْ بَنُو قُرَيْظَةَ عَلَى حُكْمِ سَعْدِ بْنِ مُعَاذٍ بَعَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِليه فَجَاءَ عَلَى حِمَارٍ فَلَمَّا دَنَا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «قُومُوا إِلَى سَيِّدِكُمْ» فَجَاءَ فَجَلَسَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ هَؤُلَاءِ نَزَلُوا عَلَى حُكْمِكَ» . قَالَ: فَإِنِّي أَحْكُمُ أَنْ تَقْتُلَ الْمُقَاتِلَةُ وَأَنْ تُسْبَى الذُّرِّيَّةُ. قَالَ: «لَقَدْ حَكَمْتَ فِيهِمْ بحُكْمِ المَلِكِ» . وَفِي رِوَايَة: «بِحكم الله»","english":{"narrator":"Abu Sa'id al-Khudri said:","text":"When the B. Quraiza surrendered agreeing to have their fate decided by Sa‘d b. Mu'adh God’s Messenger sent for him and he came on an ass. When he drew near God's Messenger said, “Rise up in respect to your chief.” Then when he had come and sat down God's Messenger said, “These people have surrendered agreeing that you should decide their fate,” so he said, “I decide that the fighting men be killed and that the offspring be taken into captivity.” He then declared, “You have given regarding them the decision of the King.” A version has, “God’s decision.” \n\n(Bukhari and Muslim.)"}},{"id":176,"idInBook":176,"chapterId":19,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: بَعَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْلًا قِبَلَ نَجْدٍ فَجَاءَتْ بِرَجُلٍ مِنْ بَنِي حَنِيفَةَ يُقَالُ لَهُ: ثُمَامَةُ بْنُ أُثَالٍ سَيِّدُ أَهْلِ الْيَمَامَةِ فَرَبَطُوهُ بِسَارِيَةٍ مِنْ سَوَارِي الْمَسْجِدِ فَخَرَجَ إِلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «مَاذَا عِنْدَكَ يَا ثُمَامَةُ؟» فَقَالَ: عنْدي يَا مُحَمَّد خير إِن نقْتل تَقْتُلْ ذَا دَمٍ وَإِنْ تُنْعِمْ تُنْعِمْ عَلَى شَاكِرٍ وَإِنْ كُنْتُ تُرِيدُ الْمَالَ فَسَلْ تُعْطَ مِنْهُ مَا شِئْتَ فَتَرَكَهُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى كَانَ الْغَدُ فَقَالَ لَهُ: «مَا عِنْدَكَ يَا ثُمَامَةُ؟» فَقَالَ: عِنْدِي مَا قُلْتُ لَكَ: إِنْ تُنْعِمْ تُنْعِمْ عَلَى شَاكِرٍ وَإِنْ تَقْتُلْ تَقْتُلْ ذَا دَمٍ وَإِنْ كنتَ تريدُ المالَ فسَلْ تعط مِنْهُ مَا شِئْتَ. فَتَرَكَهُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى كَانَ بَعْدَ الْغَدِ فَقَالَ لَهُ: «مَا عِنْدَكَ يَا ثُمَامَةُ؟» فَقَالَ: عِنْدِي مَا قُلْتُ لَكَ: إِنْ تُنْعِمْ تُنْعِمْ عَلَى شَاكِرٍ وَإِنْ تَقْتُلْ تَقْتُلْ ذَا دَمٍ وَإِنْ كُنْتَ تُرِيدُ الْمَالَ فَسَلْ تُعْطَ مِنْهُ مَا شِئْتَ. فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَطْلَقُوا ثُمَامَةَ» فَانْطَلَقَ إِلَى نَخْلٍ قَرِيبٍ مِنَ الْمَسْجِدِ فَاغْتَسَلَ ثُمَّ دَخَلَ الْمَسْجِدَ فَقَالَ: أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَشْهَدُ أَن مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ يَا مُحَمَّدُ وَاللَّهِ مَا كَانَ عَلَى وَجْهِ الْأَرْضِ وَجْهٌ أَبْغَضُ إِلَيَّ مِنْ وَجْهِكَ فَقَدْ أَصْبَحَ وَجْهُكَ أَحَبَّ الْوُجُوهِ كُلِّهَا إِلَيَّ وَاللَّهِ مَا كَانَ مِنْ دِينٍ أَبْغَضَ إِلَيَّ مِنْ دِينِكَ فَأَصْبَحَ دِينُكَ أَحَبَّ الدِّينِ كُلِّهِ إِلَيَّ وَوَاللَّهِ مَا كَانَ مِنْ بَلَدٌ أَبْغَضَ إِلَيَّ مِنْ بَلَدِكَ فَأَصْبَحَ بَلَدُكَ أَحَبَّ الْبِلَادِ كُلِّهَا إِلَيَّ. وَإِنَّ خَيْلَكَ أَخَذَتْنِي وَأَنَا أُرِيدَ الْعُمْرَةَ فَمَاذَا تَرَى؟ فَبَشَّرَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَمَرَهُ أَنْ يَعْتَمِرَ فَلَمَّا قَدِمَ مَكَّةَ قَالَ لَهُ قَائِلٌ: أَصَبَوْتَ؟ فَقَالَ: لَا وَلَكِنَّى أَسْلَمْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاللَّهِ لَا يَأْتِيكُمْ مِنَ الْيَمَامَةِ حَبَّةُ حِنْطَةٍ حَتَّى يَأْذَنَ فِيهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ. رَوَاهُ مُسلم وَاخْتَصَرَهُ البُخَارِيّ","english":{"narrator":"","text":"Abu Huraira told that God's Messenger sent some horsemen to Najd and they brought a man of the B. Hanifa called Thumama b. Uthal who was the chief of the people of al-Yamama and bound him to one of the pillars of the mosque. God’s Messenger came out to him and said, “What are you expecting, Thumama?” He replied, “I expect good, Muhammad. If you kill me you will kill one whose blood will be avenged, if you show favour you will show it to one who is grateful, and if you want property and ask you will be given as much of it as you wish.” God’s Messenger left him till the next day, and asked him, “What are you expecting, Thumama?” He replied, “I am expecting what I said to you. If you show favour you will show it to one who is grateful, if you kill me you will kill one whose blood will be avenged, and if you want property and ask you will be given as much of it as you wish.” God's Messenger left him till the following day, and asked him, “What are you expecting, Thumama?” He replied, “I am expecting what I said to you. If you show favour you will show it to one who is grateful, if you kill me you will kill one whose blood will be avenged, and if you want property and ask you will be given as much of it as you wish.” God’s Messenger then said, “Set Thumama free.” He went off to some palm-trees near the mosque, and after bathing he entered the mosque and said, “I testify that there is no god but God, and I testify that Muhammad is His servant and Messenger. I swear by God, Muhammad, that there was no face on the face of the earth more hateful to me than yours, but your face has become the dearest of all to me. I swear by God that there was no religion more hateful to me than yours, but your religion has become the dearest of all to me. I swear by God that there was no town more hateful to me than yours, but your town has become the dearest of all to me. Your cavalry seized me when I was on my way to perform the umra, so what do you think I should do? God’s Messenger congratulated him and told him to perform the umra. When he came to Mecca someone asked him whether he had turned to folly* and he replied, “No, but I have accepted Islam along with God’s Messenger. I swear by God that not one grain of wheat will come to you from al-Yamama till God’s Messenger gives permission for it.” \n\n*Sabaut. The verb saba has as one of its meanings to turn to folly. It has been suggested that here it is used in the sense of the verb saba’a which means to change one’s religion. Final Hamza verbs very often do drop the Hamza, but they more normally follow the pattern of final ya’ verbs rather than final waw when they do so.\n\nMuslim transmitted it, and Bukhari gave it more concisely."}},{"id":177,"idInBook":177,"chapterId":19,"bookId":14,"arabic":"وَعَن جُبَير بن مطعم أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي أُسَارَى بَدْرٍ: «لَوْ كَانَ الْمُطْعِمُ بْنُ عَدِيٍّ حَيًّا ثُمَّ كَلَّمَنِي فِي هَؤُلَاءِ النَّتْنَى لتركتهم لَهُ» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Jubair b. Mut'im reported the Prophet as saying about the prisoners taken at Badr, “If al-Mut‘im b. ‘Adi* had been alive and spoken to me about these filthy ones, I would have left them for him.” \n\n* He was head of the B. Naufal. He agreed to give Muhammad protection after his return from at-Ta'if where he had gone after Abu Talib’s death. Al-Mut‘im died before the battle of Badr. He did not become a Muslim.\n\nBukhari transmitted it."}},{"id":178,"idInBook":178,"chapterId":19,"bookId":14,"arabic":"وَعَن أنسٍ: أَنَّ ثَمَانِينَ رَجُلًا مِنْ أَهْلِ مَكَّةَ هَبَطُوا عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ جَبَلِ التَّنْعِيمِ مُتَسَلِّحِينَ يُرِيدُونَ غِرَّةَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَصْحَابِهِ فَأَخَذَهُمْ سِلْمًا فَاسْتَحْيَاهُمْ. وَفِي رِوَايَةٍ: فَأَعْتَقَهُمْ فَأَنْزَلَ اللَّهُ تَعَالَى (وَهُوَ الَّذِي كَفَّ أَيْدِيَهُمْ عَنْكُمْ وَأَيْدِيَكُمْ عَنْهُمْ ببطنِ مكةَ)\nرَوَاهُ مُسلم","english":{"narrator":"","text":"Anas told that eighty Meccans came down armed from the mountain of at-Tan‘im against God’s Messenger intending to take him and his companions unawares, but he took them captive without fighting and spared them. A version says he set them free and God most high sent down, “He it is who averted their hands from you and your hands from them in the valley of Mecca” (Al-Qur’an; 48:24).\n\nMuslim transmitted it."}},{"id":179,"idInBook":179,"chapterId":19,"bookId":14,"arabic":"وَعَنْ قَتَادَةَ قَالَ: ذَكَرَ لَنَا أَنَسُ بْنُ مَالِكٍ عَنْ أَبِي طَلْحَةَ أَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ يَوْمَ بَدْرٍ بِأَرْبَعَةٍ وَعِشْرِينَ رَجُلًا مِنْ صَنَادِيدِ قُرَيْشٍ فَقَذَفُوا فِي طَوِيٍّ مِنْ أَطْوَاءِ بَدْرٍ خَبِيثٍ مُخْبِثٍ وَكَانَ ذَا ظهرَ عَلَى قَوْمٍ أَقَامَ بِالْعَرْصَةِ ثَلَاثَ لَيَالٍ فَلَمَّا كَانَ بِبَدْرٍ الْيَوْمَ الثَّالِثَ أَمَرَ بِرَاحِلَتِهِ فَشَدَّ عَلَيْهَا رَحْلَهَا ثُمَّ مَشَى وَاتَّبَعَهُ أَصْحَابُهُ حَتَّى قَامَ عَلَى شَفَةِ الرَّكِيِّ فَجَعَلَ يُنَادِيهِمْ بِأَسْمَائِهِمْ وأسماءِ آبائِهم: «يَا فُلَانَ بْنَ فُلَانٍ وَيَا فُلَانُ بْنَ فُلَانٍ أَيَسُرُّكُمْ أَنَّكُمْ أَطَعْتُمُ اللَّهَ وَرَسُولَهُ؟ فَإِنَّا قَدْ وَجَدْنَا مَا وَعَدَنَا رَبُّنَا حَقًّا فَهَلْ وَجدتمْ مَا وعدَكم رَبُّكُمْ حَقًّا؟» فَقَالَ عُمَرُ: يَا رَسُولَ اللَّهِ مَا تُكَلِّمَ مِنْ أَجْسَادٍ لَا أَرْوَاحَ لَهَا؟ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ مَا أَنْتُمْ بِأَسْمَعَ لِمَا أَقُولُ مِنْهُمْ» . وَفِي رِوَايَةٍ: «مَا أَنْتُمْ بِأَسْمَعَ مِنْهُمْ وَلَكِنْ لَا يُجِيبُونَ» . مُتَّفَقٌ عَلَيْهِ. وَزَادَ الْبُخَارِيُّ: قَالَ قَتَادَةُ: أَحْيَاهُمُ اللَّهُ حَتَّى أَسْمَعَهُمْ قولَه توْبيخاً وتصغيرا ونقمة وحسرة وندما","english":{"narrator":"","text":"Qatada told that Anas b. Malik mentioned to him on the authority of Abu Talha that at the battle of Badr God’s prophet ordered twenty-four of the strong men of Quraish to be cast into one of the wells of Badr cased with stones which was corrupt and corrupting. When he prevailed over an enemy he stayed three nights on the field of battle; and when the third day came at Badr he ordered his riding-beast to be saddled. He then walked followed by his companions till he came to the mouth of the well, when he began to call them by their names and their fathers’ names, saying, “So and so son of so and so, so and so son of so and so, does it please you that you obeyed God and His Messenger? We have found what our Lord promised us to be true. Have you found what your Lord promised you to be true?” ‘Umar said, “Messenger of God, what you are addressing are only bodies without spirits.” The Prophet replied, “By Him in whose hand Muhammad's soul is, you cannot hear what I say better than they.” A version has, “You cannot hear better than they, but they cannot answer.” \n\n(Bukhari and Muslim.) Bukhari added that Qatada said God brought them to life and made them hear what he said by way of rebuke, humiliation, revenge, and to produce grief and repentance."}},{"id":180,"idInBook":180,"chapterId":19,"bookId":14,"arabic":"وَعَنْ مَرْوَانَ وَالْمِسْوَرِ بْنِ مَخْرَمَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَامَ حِينَ جَاءَهُ وَفد من هَوَازِنَ مُسْلِمِينَ فَسَأَلُوهُ أَنْ يَرُدَّ إِلَيْهِمْ أَمْوَالَهُمْ وَسَبْيَهُمْ فَقَالَ: \n\" فَاخْتَارُوا إِحْدَى الطَّائِفَتَيْنِ: إِمَّا السَّبْيَ وَإِمَّا الْمَالَ \". قَالُوا: فَإِنَّا نَخْتَارُ سَبْيَنَا. فَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَثْنَى عَلَى اللَّهِ بِمَا هُوَ أَهْلُهُ ثُمَّ قَالَ: «أمَّا بعدُ فإِنَّ إِخْوانَكم قدْ جاؤوا تَائِبِينَ وَإِنِّي قَدْ رَأَيْتُ أَنْ أَرُدَّ إِلَيْهِمْ سَبْيَهُمْ فَمَنْ أَحَبَّ مِنْكُمْ أَنْ يُطَيِّبَ ذَلِكَ فَلْيَفْعَلْ وَمَنْ أَحَبَّ مِنْكُمْ أَنْ يَكُونَ عَلَى حظِّه حَتَّى نُعطِيَه إِيَّاهُ منْ أوَّلِ مَا يَفِيءُ اللَّهُ عَلَيْنَا فَلْيَفْعَلْ» فَقَالَ النَّاسُ: قَدْ طَيَّبْنَا ذَلِكَ يَا رَسُولَ اللَّهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّا لَا نَدْرِي مَنْ أَذِنَ مِنْكُمْ مِمَّنْ لَمْ يَأْذَنْ فَارْجِعُوا حَتَّى يَرْفَعَ إِلَيْنَا عُرَفَاؤُكُمْ أَمْرَكُمْ» . فَرَجَعَ النَّاسُ فَكَلَّمَهُمْ عُرَفَاؤُهُمْ ثُمَّ رَجَعُوا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرُوهُ أَنَّهُمْ قد طيَّبوا وأَذنوا. رَوَاهُ البُخَارِيّ","english":{"narrator":"Marwan and al-Miswar b. Makhrama told that when the deputation of Hawain came to God’s Messenger to accept Islam and asked him to return to them their property and their captives he stood up and said, “Choose one of the two, either the captives or the property.” When they replied that they chose their captives God’s Messenger stood up, and after extolling God in a fitting manner said, “To proceed:","text":"Your brethren have come repentant and I have considered that I should return their captives to them, so let those of you who are willing to release the captives act accordingly, but those who wish to hold on to what they have till I give them some of the first booty God gives us may do so.” The people told God’s Messenger that they were willing to release the captives, and he said, “I cannot distinguish between those of you who have granted that and those who have not, so return that your headmen may tell me about you.” They did so, and after their headmen had spoken to them they came back to God’s Messenger and told him they were agreeable and had given permission. \n\nBukhari transmitted it."}},{"id":181,"idInBook":181,"chapterId":19,"bookId":14,"arabic":"وَعَن عمرَان بن حُصَيْن قَالَ: كَانَت ثَقِيفٌ حَلِيفًا لِبَنِي عُقَيْلٍ فَأَسَرَتْ ثَقِيفٌ رَجُلَيْنِ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَسَرَ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلًا مِنْ بَنِي عُقَيْلٍ فَأَوْثَقُوهُ فَطَرَحُوهُ فِي الْحَرَّةِ فَمَرَّ بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنَادَاهُ: يَا مُحَمَّدُ يَا مُحَمَّدُ فِيمَ أُخِذْتُ؟ قَالَ: «بِجَرِيرَةِ حُلَفَائِكُمْ ثَقِيفٍ» فَتَرَكَهُ وَمَضَى فَنَادَاهُ: يَا مُحَمَّدُ يَا مُحَمَّدُ فَرَحِمَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم فرجعَ فَقَالَ: «مَا شَأْنُكَ؟» قَالَ: إِنِّي مُسْلِمٌ. فَقَالَ: «لَوْ قُلْتَهَا وَأَنْتَ تَمْلِكُ أَمْرَكَ أَفْلَحْتَ كُلَّ الْفَلَاحِ» . قَالَ: فَفَدَاهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بالرجلينِ اللَّذينِ أسرَتْهُما ثقيفٌ. رَوَاهُ مُسلم","english":{"narrator":"‘Imran b. Husain said:","text":"Thaqif were allies of the B. ‘Uqail, so when Thaqif took two of God’s Messenger’s companions prisoner, his companions took prisoner a man of the B. ‘Uqail, bound him and threw him out on the lava plain. God’s Messenger passed him and he called to him, “Muhammad, Muhammad, for what have I been taken?” He replied, “For the crime of your allies Thaqif.” He then left him and passed on, but when he cried, “Muhammad, Muhammad,” God’s Messenger took pity on him and returned and asked him about himself. When he told him he was a Muslim he said, “If you had said it when you were your own master you would have been completely successful.”* Then God’s Messenger ransomed him for the two men Thaqif had taken prisoner. \n\n*This means that not only would he go to paradise in the next life, but he would have been saved the experience of being taken a captive in this.\n\nMuslim transmitted it."}},{"id":182,"idInBook":182,"chapterId":19,"bookId":14,"arabic":"عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: لَمَّا بَعَثَ أَهْلُ مَكَّةَ فِي فِدَاءِ أُسَرَائِهِمْ بَعَثَتْ زَيْنَبُ فِي فِدَاءِ أَبِي الْعَاصِ بِمَالٍ وَبَعَثَتْ فِيهِ بِقِلَادَةٍ لَهَا كَانَتْ عِنْدَ خَدِيجَةَ أَدْخَلَتْهَا بِهَا عَلَى أَبِي الْعَاصِ فَلَمَّا رَآهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَقَّ لَهَا رِقَّةً شَدِيدَةً وَقَالَ: «إِنْ رَأَيْتُمْ أَنْ تُطْلِقُوا لَهَا أَسِيرَهَا وَتَرُدُّوا عَلَيْهَا الَّذِي لَهَا» فَقَالُوا: نَعَمْ وَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخَذَ عَلَيْهِ أَنْ يُخَلِّيَ سَبِيلَ زَيْنَبَ إِلَيْهِ وَبَعَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَيْدَ بْنَ حَارِثَةَ وَرَجُلًا مِنَ الْأَنْصَارِ فَقَالَ: «كونا ببطنِ يأحج حَتَّى تَمُرَّ بِكُمَا زَيْنَبُ فَتَصْحَبَاهَا حَتَّى تَأْتِيَا بهَا» . رَوَاهُ أَحْمد وَأَبُو دَاوُد","english":{"narrator":"","text":"‘A’isha told that when the people of Mecca sent about ransoming their prisoners1 Zainab sent some property to ransom Abul ‘As, sending among it a necklace of hers which Khadija had had and had sent with her when she married Abul ‘As. When God’s Messenger saw it he felt great tenderness about it and said, “If you consider that you should free her prisoner for her and return to her what belongs to her it will be well.” To this they agreed. The Prophet had made an agreement with him that he should let Zainab come to him, so he sent Zaid b. Haritha and a man of the Helpers, telling them to wait in the valley of Yajij2 till Zainab came along and bring her back with them.\n\n    1. After the battle of Badr.\n    2. Near at-Tan'im.\n\nAhmad and Abu Dawud transmitted it."}},{"id":183,"idInBook":183,"chapterId":19,"bookId":14,"arabic":"وَعَنْهَا: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا أَسَرَ أَهْلَ بَدْرٍ قَتَلَ عُقْبَةَ بْنَ أَبِي مُعَيْطٍ وَالنَّضْرَ بْنَ الْحَارِثِ وَمَنَّ عَلَى أَبِي عَزَّةَ الْجُمَحِيِّ. رَوَاهُ فِي شَرْحِ السّنة وَالشَّافِعِيّ وَابْن إِسْحَاق فِي «السِّيرَة»","english":{"narrator":"","text":"She told that when God’s Messenger took prisoner the people at Badr he killed ‘Uqba b. Aba Mu'ait and an-Nadr b. al-Harith, but showed favour to Abu ‘Azza al-Jumahi. \n\nIt is transmitted in Sharh as-sunna."}},{"id":184,"idInBook":184,"chapterId":19,"bookId":14,"arabic":"وَعَنِ ابْنِ مَسْعُودٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا أَرَادَ قَتْلَ عُقْبَةَ بْنَ أَبِي مُعَيْطٍ قَالَ: مَنْ لِلصِّبْيَةِ؟ قَالَ: «النَّار» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Ibn Mas'ud told that when God’s Messenger intended to kill ‘Uqba b. Abu Mu'ait he asked who would look after the children, and he replied that hell would. \n\nAbu Dawud transmitted it."}},{"id":185,"idInBook":185,"chapterId":19,"bookId":14,"arabic":"وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" أَنَّ جِبْرِيلَ هَبَطَ عَلَيْهِ فَقَالَ لَهُ: خَيِّرْهُمْ يَعْنِي أَصْحَابَكَ فِي أُسارى بدر: القتلَ والفداءَ عَلَى أَنْ يُقْتَلَ مِنْهُمْ قَابِلًا مِثْلُهُمْ \" قَالُوا الْفِدَاءَ وَيُقْتَلَ مِنَّا. رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيث غَرِيب","english":{"narrator":"","text":"‘Ali reported God's Messenger as saying that Gabriel came down to him and said to him, “Give them (i.e. your companions) their choice regarding the prisoners at Badr whether they should be killed or ransomed on condition that a like number of them should be killed the following year.” They replied, “We shall accept ransom and have some of us killed.” \n\nTirmidhi transmitted it, saying this is a gharib tradition."}},{"id":186,"idInBook":186,"chapterId":19,"bookId":14,"arabic":"عَن عَطِيَّة القَرظِي قَالَ: كنتُ فِي سَبي قُرَيْظَةَ عُرِضْنَا عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَانُوا يَنْظُرُونَ فَمَنْ أَنْبَتَ الشَّعَرَ قُتِلَ وَمَنْ لَمْ يُنْبِتْ لَمْ يُقْتَلْ فَكَشَفُوا عَانَتِي فَوَجَدُوهَا لَمْ تُنْبِتْ فَجَعَلُونِي فِي السَّبْيِ. رَوَاهُ أَبُو دَاوُد وَابْن مَاجَه. والدارمي","english":{"narrator":"‘Atiya al-Qurazi said:","text":"I was among the captives of Quraiza who were brought before the Prophet. The Companions examined us, and those who had begun to grow hair were killed, but those who had not were not killed. They uncovered my private parts and when they found that the hair had not begun to grow they put me among the captives. \n\nAbu Dawud, Ibn Majah and Darimi transmitted it."}},{"id":187,"idInBook":187,"chapterId":19,"bookId":14,"arabic":"وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ: خَرَجَ عِبْدَانٌ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعْنِي الْحُدَيْبِيَةَ قَبْلَ الصُّلْحِ فَكَتَبَ إِلَيْهِ مَوَالِيهِمْ قَالُوا: يَا مُحَمَّدُ وَاللَّهِ مَا خَرَجُوا إِلَيْكَ رَغْبَةً فِي دِينِكَ وَإِنَّمَا خَرَجُوا هَرَبًا مِنَ الرِّقِّ. فَقَالَ نَاسٌ: صَدَقُوا يَا رَسُولَ اللَّهِ رُدَّهُمْ إِلَيْهِمْ فَغَضِبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ: «مَا أَرَاكُم تنتهونَ يَا مَعْشَرَ قُرَيْشٍ حَتَّى يَبْعَثَ اللَّهُ عَلَيْكُمْ مَنْ يَضْرِبُ رِقَابَكُمْ عَلَى هَذَا» . وَأَبَى أَنْ يَرُدَّهُمْ وَقَالَ: «هُمْ عُتَقَاءَ اللَّهِ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"‘Ali told that some slaves came out to God’s Messenger, i.e. on the day of al-Hudaibiya, before the peace was ratified, and their masters wrote to him saying, “We swear by God, Muhammad, that they have not gone out to you through desire for your religion, but they have done so only to fly from servitude.” Some people assured him they had spoken the truth and advised him to send them back to them, but God’s Messenger became angry and said, “I do not think you people of Quraish will cease till God sends someone to you who will cut off your heads for this.” He refused to send them back, saving they were God’s freedmen. \n\nAbu Dawud transmitted it."}},{"id":188,"idInBook":188,"chapterId":19,"bookId":14,"arabic":"عَنِ ابْنِ عُمَرَ قَالَ: بَعَثَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَالِدَ بْنَ الْوَلِيدِ إِلَى بَنِي جَذِيمَةَ فَدَعَاهُمْ إِلَى الْإِسْلَامِ فَلَمْ يُحْسِنُوا أَنْ يَقُولُوا: أَسْلَمْنَا فَجَعَلُوا يَقُولُونَ: صَبَأْنَا صَبَأْنَا فجعلَ خالدٌ يقتلُ ويأسِرُ وَدَفَعَ إِلَى كُلِّ رَجُلٍ مِنَّا أَسِيرَهُ حَتَّى إِذَا كَانَ يَوْمٌ أَمَرَ خَالِدٌ أَنْ يَقْتُلَ كُلُّ رَجُلٍ مِنَّا أَسِيرَهُ فَقُلْتُ: وَاللَّهِ لَا أَقْتُلُ أَسِيرِي وَلَا يَقْتُلُ رَجُلٌ مِنْ أَصْحَابِي أسيره حَتَّى قدمنَا إِلَى النَّبِي صلى الله عَلَيْهِ وَسلم فذكرناهُ فَرَفَعَ يَدَيْهِ فَقَالَ: «اللَّهُمَّ أَنِّي أَبْرَأُ إِلَيْكَ مِمَّا صنعَ خالدٌ» مرَّتينِ. رَوَاهُ البُخَارِيّ","english":{"narrator":"Ibn ‘Umar said:","text":"The Prophet sent Khalid b. al-Walid to the B. Hadhima and he summoned them to accept Islam. When they did not express their acceptance of Islam properly but began to say, “We have changed our religion, we have changed our religion,”* Khalid began to kill them and take prisoners, and he handed a prisoner to each one of us. But when a day came when Khalid ordered each of us to kill his prisoner, I said, “I swear by God that I will not kill my prisoner and that not one of my companions will kill his prisoner till we come to the Prophet.” When we mentioned the matter to him he raised his hands and said twice, “O God, I declare myself innocent in Thy sight of what Khalid has done.” \n\n*Here the verb saba'a is used.\n\nBukhari transmitted it."}},{"id":189,"idInBook":189,"chapterId":19,"bookId":14,"arabic":"عَن أم هَانِئ بنت أَي طالبٍ قالتْ: ذهبتُ إِلى رسولِ الله عَامَ الْفَتْحِ فَوَجَدْتُهُ يَغْتَسِلُ وَفَاطِمَةُ ابْنَتُهُ تَسْتُرُهُ بِثَوْبٍ فَسَلَّمْتُ فَقَالَ: «مَنْ هَذِهِ؟» فَقُلْتُ: أَنَا أُمُّ هَانِئٍ بِنْتُ أَبِي طَالِبٍ فَقَالَ: «مَرْحَبًا بِأُمِّ هَانِئٍ» فَلَمَّا فَرَغَ مِنْ غُسْلِهِ قَامَ فَصَلَّى ثَمَانِيَ رَكَعَاتٍ مُلْتَحِفًا فِي ثَوْبٍ ثُمَّ انْصَرَفَ فَقُلْتُ: يَا رَسُولَ اللَّهِ زَعَمَ ابْنُ أُمِّي عَلِيٌّ أَنَّهُ قَاتِلٌ رَجُلًا أَجَرْتُهُ فُلَانَ بْنَ هُبَيْرَةَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «قَدْ أَجَرْنَا مَنْ أَجَرْتِ يَا أم هَانِئ» قَالَت أُمَّ هَانِئٍ وَذَلِكَ ضُحًى. مُتَّفَقٌ عَلَيْهِ. وَفِي رِوَايَةٍ لِلتِّرْمِذِيِّ: قَالَتْ: أَجَرْتُ رَجُلَيْنِ مِنْ أَحْمَائِي فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «قد أمنا من أمنت»","english":{"narrator":"Umm Hani' daughter of Abu Talib said:","text":"I went to God’s Messenger in the year of the Conquest and found him bathing while his daughter Fatima was screening him with a garment. I gave a salutation and he asked who was there, then when I told him I was Umm Hani’ daughter of Abu Talib he said, “Welcome, Umm Hani’.” After he finished his bathing he got up and prayed eight rak'as wrapped in a garment, and when he was done I said, “Messenger of God, my mother’s son ‘Ali has asserted that he is going to kill a man to whom I have given protection, so and so the son of Hubaira.” He replied, “We have given protection to those to whom you have granted it, Umm Hani'.” She said that that was in the forenoon. \n\n(Bukhari and Muslim.) In a version by Tirmidhi she said, “I have given protection to two of my husband’s male relatives,” and God’s Messenger replied, “We have given security to those to whom you have given it.”"}},{"id":190,"idInBook":190,"chapterId":19,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ الْمَرْأَةَ لَتَأْخُذُ لِلْقَوْمِ» يَعْنِي تُجيرُ على الْمُسلمين. رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Abu Huraira reported the Prophet as saying, “A woman acts for the people,” i.e. she gives protection on behalf of the Muslims. \n\nTirmidhi transmitted it."}},{"id":191,"idInBook":191,"chapterId":19,"bookId":14,"arabic":"وَعَنْ عَمْرِو بْنِ الْحَمِقِ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم يَقُول: «من أَمَّنَ رَجُلًا عَلَى نَفْسِهِ فَقَتَلَهُ أُعْطِيَ لِوَاءَ الْغَدْرِ يَوْمَ الْقَيَامَةِ» . رَوَاهُ فِي شَرْحِ السُّنَّةِ","english":{"narrator":"","text":"‘Amr b. al-Hamiq told that he heard God's Messenger say, “He who grants a man security and then kills him will be given the banner of treachery on the day of resurrection.” \n\nIt is transmitted in Sharh as-sunna."}},{"id":192,"idInBook":192,"chapterId":19,"bookId":14,"arabic":"وَعَنْ سُلَيْمِ بْنِ عَامِرٍ قَالَ: كَانَ بَيْنَ مُعَاوِيَةَ وَبَيْنَ الرُّومِ عَهْدٌ وَكَانَ يَسِيرُ نَحْوَ بِلَادِهِمْ حَتَّى إِذَا انْقَضَى الْعَهْدُ أَغَارَ عَلَيْهِمْ فَجَاءَ رَجُلٌ عَلَى فَرَسٍ أَوْ بِرْذَوْنٍ وَهُوَ يَقُولُ: اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ وَفَاءٌ لَا غدر فَنظر فَإِذا هُوَ عَمْرو ابْن عَبَسَةَ فَسَأَلَهُ مُعَاوِيَةُ عَنْ ذَلِكَ فَقَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُول: «مَنْ كَانَ بَيْنَهُ وَبَيْنَ قَوْمٍ عَهْدٌ فَلَا يَحُلَّنَّ عَهْدًا وَلَا يَشُدَّنَّهُ حَتَّى يُمْضِيَ أَمَدَهُ أَوْ يَنْبِذَ إِلَيْهِمْ عَلَى سَوَاءٍ» . قَالَ: فَرَجَعَ مُعَاوِيَة بِالنَّاسِ. رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد","english":{"narrator":"Sulaim b. ‘Amir said:","text":"There was a covenant between Mu'awiya and the Byzantines, and he was going towards their country; then when the covenant came to an end he attacked them. A man came on a horse, or a packhorse, saying, “God is most great, God is most great; let there be faithfulness and not treachery.”* And when they looked they found that he was 'Amr b. ‘Abasa. Mu'awiya questioned him about that and he replied that he had heard God’s Messenger say, \"When one has a covenant with people he must not loosen or strengthen it till its term comes, or he brings it to an end in agreement with them.” He said that Mu'awiya then took the people back. \n\n*Mirqat, 4, 255 says that 'Amr b. ‘Abasa felt it was an act of treachery to make a treaty while in one’s own country and then approach the enemy’s country when the period of the treaty was near an end, so as to be able to make an immediate attack.\n\nTirmidhi and Abu Dawud transmitted it."}},{"id":193,"idInBook":193,"chapterId":19,"bookId":14,"arabic":"وَعَن أبي رافعٍ قَالَ: بعثَني قُرَيْشٌ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُلْقِيَ فِي قَلْبِيَ الْإِسْلَامُ فَقُلْتُ: يَا رَسُولَ اللَّهِ إِنِّي وَاللَّهِ لَا أَرْجِعُ إِلَيْهِمْ أَبَدًا قَالَ: «إِنِّي لَا أَخِيسُ بِالْعَهْدِ وَلَا أَحْبِسُ الْبُرُدَ وَلَكِنِ ارْجِعْ فَإِنْ كَانَ فِي نَفْسِكَ الَّذِي فِي نَفْسِكَ الْآنَ فَارْجِعْ» . قَالَ: فَذَهَبْتُ ثُمَّ أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسلم فَأسْلمت. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"Abu Rafi' said:","text":"Quraish sent me to God’s Messenger and when I saw him Islam was cast into my heart, so I said, \"Messenger of God, I swear by God that I shall never return to them.” He replied, \"I do not break a covenant or imprison messengers; but return, and if you feel the same as you do just now, come back.” So I went away and then came to the Prophet and accepted Islam. \n\nAbu Dawud transmitted it."}},{"id":194,"idInBook":194,"chapterId":19,"bookId":14,"arabic":"وَعَنْ نُعَيْمِ بْنِ مَسْعُودٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِرَجُلَيْنِ جَاءَا مِنْ عِنْدِ مُسَيْلِمَةَ: «أَمَّا وَاللَّهِ لَوْلَا أَنَّ الرُّسُلَ لَا تُقْتَلُ لَضَرَبْتُ أَعْنَاقَكُمَا» . رَوَاهُ أَحْمَدُ وَأَبُو دَاوُد","english":{"narrator":"","text":"Nu'aim b. Mas'ud reported God's Messenger as saying to two men who came from Musailima, \"I swear by God that were it not that messengers are not killed, I would cut off your heads.” \n\nAhmad and Abu Dawud transmitted it."}},{"id":195,"idInBook":195,"chapterId":19,"bookId":14,"arabic":"وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي خطْبَة: «أَوْفوا بِحلف الْجَاهِلِيَّة فَإِنَّهُ لَا يزِيد يَعْنِي الْإِسْلَامَ إِلَّا شِدَّةً وَلَا تُحْدِثُوا حَلِفًا فِي الإِسلامِ» . رَوَاهُ الترمذيُّ من طريقِ ابنِ ذَكْوَانَ عَنْ عَمْرٍو وَقَالَ: حَسَنٌ.","english":{"narrator":"","text":"‘Amr b. Shu'aib, on his father’s authority, told that his grandfather reported God’s Messenger as saying in the course of his sermon, \"Observe fully the alliance made in the pre-Islamic period, for it, i.e. Islam, will only make it stronger; but make no new alliances in Islam.” \n\nThe source is not given. See Tirmidhi, Siyar, 30"}},{"id":196,"idInBook":196,"chapterId":19,"bookId":14,"arabic":"عَنِ ابْنِ مَسْعُودٍ قَالَ: جَاءَ ابْنُ النَّوَّاحَةِ وَابْنُ أُثَالٍ رَسُولَا مُسَيْلِمَةَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَهُمَا: «أَتَشْهَدَانِ أَنِّي رَسُولُ اللَّهِ؟» فَقَالَا: نَشْهَدُ أَنَّ مُسَيْلِمَةَ رَسُولَ اللَّهِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «آمَنْتُ بِاللَّهِ وَرَسُولِهِ وَلَوْ كُنْتُ قَاتِلًا رَسُولًا لَقَتَلْتُكُمَا» . قَالَ عَبْدُ اللَّهِ: فَمَضَتِ السُّنَّةُ أَنَّ الرَّسول لَا يُقتَلُ. رَوَاهُ أَحْمد","english":{"narrator":"","text":"Ibn Mas'ud told that when Ibn an-Nawwaha and Ibn Uthal, Musailima’s messengers, came to the Prophet he asked them whether they testified that he was God’s Messenger. On their replying, \"We testify that Musailima is God’s messenger,” he said, \"I believe in God and His Messenger. If it was my custom to kill a messenger I would kill you.” ‘Abdallah (i.e. Ibn Mas'ud) said that the sunna that a messenger should not be killed then came into force.\n\nAhmad transmitted it."}},{"id":197,"idInBook":197,"chapterId":19,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «فَلَمْ تَحِلَّ الْغَنَائِمُ لِأَحَدٍ مِنْ قَبْلِنَا ذَلِكَ بِأَنَّ اللَّهَ رَأَى ضعفنا وعجزنا فطيها لنا»","english":{"narrator":"","text":"Abu Huraira reported God’s Messenger as saying, \"Spoils were not lawful for anyone before us, that being because God saw our weakness and incapacity and made them allowable for us.” \n\n(Bukhari and Muslim.)"}},{"id":198,"idInBook":198,"chapterId":19,"bookId":14,"arabic":"وَعَن أبي قتادةَ قَالَ: خَرَجْنَا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ حُنَيْنٍ فَلَمَّا الْتَقَيْنَا كَانَتْ لِلْمُسْلِمِينَ جَوْلَةٌ فَرَأَيْتُ رَجُلًا مِنَ الْمُشْرِكِينَ قَدْ عَلَا رَجُلًا مِنَ الْمُسْلِمِينَ فَضَرَبْتُهُ مِنْ وَرَائِهِ عَلَى حَبْلِ عَاتِقِهِ بِالسَّيْفِ فَقَطَعْتُ الدِّرْعَ وَأَقْبَلَ عَلَيَّ فَضَمَّنِي ضَمَّةً وَجَدْتُ مِنْهَا رِيحَ الْمَوْتِ ثُمَّ أَدْرَكَهُ الْمَوْتُ فَأَرْسَلَنِي فَلَحِقْتُ عُمَرَ بْنَ الْخَطَّابِ فَقُلْتُ: مَا بَالُ النَّاسِ؟ قَالَ: أَمْرُ اللَّهِ ثُمَّ رَجَعُوا وَجَلَسَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «مَنْ قَتَلَ قَتِيلًا لَهُ عَلَيْهِ بَيِّنَةٌ فَلَهُ سَلَبُهُ» فَقُلْتُ: مَنْ يَشْهَدُ لِي؟ ثُمَّ جَلَسْتُ ثُمَّ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ فَقُمْتُ فَقَالَ: «مَا لَكَ يَا أَبَا قَتَادَةَ؟» فَأَخْبَرْتُهُ فَقَالَ رَجُلٌ: صَدَقَ وَسَلَبُهُ عِنْدِي فَأَرْضِهِ مِنِّي فَقَالَ أَبُو بَكْرٍ: لَا هَا اللَّهِ إِذاً لَا يعمدُ أَسَدٍ مِنْ أُسْدِ اللَّهِ يُقَاتِلُ عَنِ اللَّهِ وَرَسُولِهِ فَيُعْطِيكَ سَلَبَهُ. فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «صَدَقَ فأعطه» فأعطانيه فاتبعت بِهِ مَخْرَفًا فِي بَنِي سَلِمَةَ فَإِنَّهُ لَأَوَّلُ مالٍ تأثَّلْتُه فِي الإِسلامِ","english":{"narrator":"Abu Qatada said:","text":"We went out with God’s Messenger in the year of Hunain, and when the armies met, the Muslims suffered a reverse. I saw one of the polytheists getting the better of one of the Muslims, so I struck him with my sword from behind on his shoulder-blade and cut his coat of mail. He came at me and closed with me, so that I felt death was near, but he was overtaken by death and let me go. I then caught up on ‘Umar b. al-Khattab and asked him what was the matter with the people, to which he replied that it was what God had commanded.1 Then they returned and the Prophet sat down and said, \"If anyone kills a man and can prove it he will get his spoil.” I said, \"Who will testify for me?” and then sat down. The Prophet said the same again and I said, \"Who will testify for me?”2 and then sat down. Again the Prophet said the same and I stood up He asked, \"What is the matter with you, Qatada?” and when I informed him a man said, \"He has spoken the truth. I have his spoil, so make him agreeable to take something in exchange.” Abu Bakr said, “In that case I swear by God that he did not do so. One of God’s heroes3 does not fight for God and His Messenger and then give you his spoil.” The Prophet said he had spoken the truth and told the man to hand it over to me. He did so, and I bought a garden among the B. Salima. This was the first property I acquired in the Islamic period. \n\n    1. He wondered why the Muslims had fled from the enemy, and 'Umar replied that it was what God had decreed.\n    2. There is doubt as to whether Abu Qatada spoke aloud the first two times, or inwardly. In the translation I have kept strictly to the wording in the Arabic.\n\n(Bukhari and Muslim.)"}},{"id":199,"idInBook":199,"chapterId":19,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَسْهَمَ لِلرَّجُلِ وَلِفَرَسِهِ ثَلَاثَةَ أَسْهُمٍ: سَهْمًا لَهُ وَسَهْمَيْنِ لِفَرَسِهِ","english":{"narrator":"","text":"Ibn ‘Umar told that God’s Messenger allotted three portions for a man and his horse, one for him and two for his horse. \n\n(Bukhari and Muslim.)"}},{"id":200,"idInBook":200,"chapterId":19,"bookId":14,"arabic":"وَعَنْ يَزِيدَ بْنِ هُرْمُزَ قَالَ: كَتَبَ نَجْدَةُ الْحَرُورِيُّ إِلَى ابْنِ عَبَّاسٍ يَسْأَلُهُ عَنِ الْعَبْدِ وَالْمَرْأَة يحْضرَانِ لمغنم هلْ يُقسَمُ لَهما؟ فَقَالَ ليزيدَ: اكْتُبْ إِلَيْهِ أَنَّهُ لَيْسَ لَهُمَا سَهْمٌ إِلَّا أَنْ يُحْذَيَا. وَفِي رِوَايَةٍ: كَتَبَ إِلَيْهِ ابْنُ عَبَّاسٍ: إِنَّكَ كَتَبْتَ إِلَيَّ تَسْأَلُنِي: هَلْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَغْزُو بِالنِّسَاءِ؟ وَهَلْ كَانَ يَضْرِبُ لَهُنَّ بِسَهْمٍ؟ فَقَدْ كَانَ يَغْزُو بِهِنَّ يُدَاوِينَ الْمَرْضَى وَيُحْذَيْنَ مِنَ الْغَنِيمَةِ وَأَمَّا السَّهْمُ فَلَمْ يَضْرِبْ لَهُنَّ بِسَهْمٍ. رَوَاهُ مُسلم","english":{"narrator":"","text":"Yazid b. Hurmuz told that Najda al-Haruri wrote to Ibn ‘Abbas asking whether a slave and a woman should be allotted a portion when they are present at the division of the spoil, and he told Yazid to write telling him they are not entitled to a portion, but may have a small amount given them. A version says that Ibn ‘Abbas wrote to him, “You have written asking me whether God’s Messenger took women on military expeditions and whether he allotted them a portion. He used to take them on military expeditions to tend the sick, and they would be given a little of the spoil, but so far as a portion is concerned he allotted them none.’’ \n\nMuslim transmitted it."}},{"id":201,"idInBook":201,"chapterId":19,"bookId":14,"arabic":"وَعَنْ سَلَمَةَ بْنِ الْأَكْوَعِ قَالَ: بَعَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِظَهْرِهِ مَعَ رَبَاحٍ غُلَامِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا مَعَهُ فَلَمَّا أَصْبَحْنَا إِذَا عَبْدُ الرَّحْمَنِ الْفَزَارِيُّ قَدْ أَغَارَ عَلَى ظَهْرِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُمْتُ عَلَى أَكَمَةٍ فَاسْتَقْبَلْتُ الْمَدِينَةَ فَنَادَيْتُ ثَلَاثًا يَا صَبَاحَاهْ ثُمَّ خَرَجْتُ فِي آثَارِ الْقَوْمِ أَرْمِيهِمْ بِالنَّبْلِ وَأَرْتَجِزُ وَأَقُولُ:\nأَنَا ابْنُ الْأَكْوَعْ وَالْيَوْمُ يَوْمُ الرُّضَّعْ\nفَمَا زِلْتُ أَرْمِيهِمْ وَأَعْقِرُ بِهِمْ حَتَّى مَا خلَقَ اللَّهُ مِنْ بَعِيرٍ مِنْ ظَهْرِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّا خَلَّفْتُهُ وَرَاءَ ظَهْرِي ثُمَّ اتَّبَعْتُهُمْ أَرْمِيهِمْ حَتَّى أَلْقَوْا أَكْثَرَ مِنْ ثَلَاثِينَ بُرْدَةً وَثَلَاثِينَ رُمْحًا يَسْتَخِفُّونَ وَلَا يَطْرَحُونَ شَيْئًا إِلَّا جَعَلْتُ عَلَيْهِ آرَامًا مِنَ الْحِجَارَةِ يَعْرِفُهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَصْحَابُهُ حَتَّى رَأَيْتُ فَوَارِسَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَحِقَ أَبُو قَتَادَةَ فَارِسُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِعَبْدِ الرَّحْمَنِ فَقَتَلَهُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «خَيْرُ فُرْسَانِنَا الْيَوْمَ أَبُو قَتَادَةَ وَخَيْرُ رَجَّالَتِنَا سَلَمَةُ» . قَالَ: ثُمَّ أَعْطَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَهْمَيْنِ: سَهْمَ الْفَارِسِ وَسَهْمَ الرَّاجِلِ فَجَمَعَهُمَا إِلَيَّ جَمِيعًا ثُمَّ أَرْدَفَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرَاءَهُ عَلَى الْعَضْبَاءِ رَاجِعَيْنِ إِلَى الْمَدِينَةِ. رَوَاهُ مُسلم","english":{"narrator":"Salama b. al-Akwa‘ said:","text":"God’s Messenger sent his riding-beasts with his servant Rabah and I went along with him. In the morning ‘Abd ar-Rahman al-Fazari raided God’s Messenger’s riding-beasts, so I went up on a mound and shouted three times facing Medina, “A morning raid!” I then went after the people shooting arrows at them and composing words in the rajaz metre saying, “I am the son of al-Akwa‘; today is the day  of the ignoble ones.”* I kept on shooting at them and killing their beasts so that they had to go on foot till there was no riding beast of God’s Messenger created by God which I had not gone ahead of. Then I followed them shooting at them till they threw away more than thirty cloaks and thirty lances to lighten themselves, and they threw nothing away without my putting stones on it to mark it for God’s Messenger and his companions to notice them. This went on till I saw God’s Messenger’s horsemen. Aba Qatada, God's Messenger's horseman, caught up on 'Abd ar-Rahman and killed him, and God's Messenger said, “Our best horseman today is Abu Qatada and our best footman Salama.” He then gave me two portions a horseman’s and a footman’s, and after giving me them both he took me up behind him on al-‘Adba’ on our way back to Medina. \n\n*The line, which is evidently an example of the dimeter of the rajaz metre, has something missing at the beginning. It goes:       انا ابن الاکوع والیوم الرضع             \nThe full form of the rajaz has the foot mustaf'ilun six times; the dimeter has it four times. In the line above two extra syallables are required at the beginning.\n\nMuslim transmitted it."}},{"id":202,"idInBook":202,"chapterId":19,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُنَفِّلُ بَعْضَ مَنْ يَبْعَثُ مِنَ السَّرَايَا لِأَنْفُسِهِمْ خَاصَّةً سِوَى قِسْمَةِ عَامَّةِ الْجَيْشِ","english":{"narrator":"","text":"Ibn ‘Umar told that God's Messenger used to give to some of the detachments he sent out booty for themselves in particular apart from the division made to the whole army. \n\n(Bukhari and Muslim.)"}},{"id":203,"idInBook":203,"chapterId":19,"bookId":14,"arabic":"وَعَنْهُ قَالَ: نَفَّلَنَا رَسُولُ اللَّهِ صلى الله عَلَيْهِ وَسلم نَفَلًا سِوَى نَصِيبِنَا مِنَ الْخُمُسِ فَأَصَابَنِي شَارِفٌ والشارف: المسن الْكَبِير","english":{"narrator":"He said:","text":"God’s Messenger gave us booty apart from our share of the fifth, and I got a sharif, which is a very old camel. \n\n(Bukhari and Muslim.)"}},{"id":204,"idInBook":204,"chapterId":19,"bookId":14,"arabic":"وَعَنْهُ قَالَ: ذَهَبَتْ فَرَسٌ لَهُ فَأَخَذَهَا الْعَدُوُّ فَظَهَرَ عَلَيْهِمُ الْمُسْلِمُونَ فَرُدَّ عَلَيْهِ فِي زَمَنِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ. وَفِي رِوَايَةٍ: أَبَقَ عَبْدٌ لَهُ فَلَحِقَ بِالرُّومِ فَظَهَرَ عَلَيْهِمُ الْمُسْلِمُونَ فَرَدَّ عَلَيْهِ خَالِدُ بْنُ الْوَلِيدِ بَعْدَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ. رَوَاهُ الْبُخَارِيُّ","english":{"narrator":"","text":"He told that in the time of God's Messenger a horse of his went off and was taken by the enemy, but when the Muslims conquered them it was returned to him. A version says that after the death of the Prophet a slave of his ran away and joined himself to the Byzantines, and when the Muslims conquered them Khalid b. al-Walid returned him to him. \n\nBukhari transmitted it."}},{"id":205,"idInBook":205,"chapterId":19,"bookId":14,"arabic":"وَعَن جُبيرِ بن مُطعمٍ قَالَ: مَشَيْتُ أَنَا وَعُثْمَانُ بْنُ عَفَّانَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْنَا: أَعْطَيْتَ بَنِي الْمُطَّلِبِ مِنْ خُمُسِ خَيْبَرَ وَتَرَكْتَنَا وَنَحْنُ بِمَنْزِلَةٍ وَاحِدَةٍ مِنْكَ؟ فَقَالَ: «إِنَّمَا بَنُو هَاشِمٍ وَبَنُو المطلبِ وَاحِدٌ» . قَالَ جُبَيْرٌ: وَلَمْ يَقْسِمِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِبَنِي عَبْدِ شَمْسٍ وَبَنِي نوفلٍ شَيْئا. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Jubair b. Mut'im told that ‘Uthman b. ‘Affan and he went to the Prophet and said, “You have given the B. al-Muttalib some of the fifth from Khaibar and left us out although we are all alike in relationship to you.\"* He replied, “The only people who are one and the same are the B. Hashim and the B. al-Muttalib.\" Jubair said that the Prophet gave no share to the B. ‘Abd Shams and the B. Naufal. \n\n*They were all descendants of 'Abd Manaf.\n\nBukhari transmitted it."}},{"id":206,"idInBook":206,"chapterId":19,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَيُّمَا قَرْيَةٍ أَتَيْتُمُوهَا وأقمتمْ فِيهَا فَسَهْمُكُمْ فِيهَا وَأَيُّمَا قَرْيَةٍ عَصَتِ اللَّهَ وَرَسُولَهُ فَإِنَّ خُمُسَهَا لِلَّهِ وَلِرَسُولِهِ ثُمَّ هِيَ لَكُمْ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Huraira reported Gods Messenger as saying, “Whatever town you come to and stay in, your portion is in it; but whatever town disobeys God and His Messenger, a fifth of it goes to God and His Messenger and what remains is yours.” \n\nMuslim transmitted it."}},{"id":207,"idInBook":207,"chapterId":19,"bookId":14,"arabic":"وَعَن خوْلَةَ الْأَنْصَارِيَّةِ قَالَتْ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِنَّ رِجَالًا يَتَخَوَّضُونَ فِي مَالِ اللَّهِ بِغَيْرِ حَقٍّ فَلَهُمُ النَّارُ يَوْمَ الْقِيَامَةِ» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Khaula al-Ansariya told that she heard God's Messenger say, “Men will wrongfully acquire God’s property and will go to hell on the day of resurrection.\" \n\nBukhari transmitted it."}},{"id":208,"idInBook":208,"chapterId":19,"bookId":14,"arabic":"وَعَن أبي هُرَيْرَة قَالَ: قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ يَوْمٍ فَذَكَرَ الْغُلُولَ فَعَظَّمَهُ وَعَظَّمَ أَمْرَهُ ثُمَّ قَالَ: \n\" لَا أُلْفِيَنَّ أَحَدَكُمْ يَجِيءُ يَوْمَ الْقِيَامَةِ عَلَى رَقَبَتِهِ بَعِيرٌ لَهُ رُغَاءٌ يَقُولُ: يَا رَسُولَ اللَّهِ أَغِثْنِي فَأَقُولُ: لَا أَمْلِكُ لَكَ شَيْئًا قَدْ أَبْلَغْتُكَ. لَا أُلْفِيَنَّ أَحَدَكُمْ يَجِيءُ يَوْمَ الْقِيَامَةِ عَلَى رَقَبَتِهِ فُرْسٌ لَهُ حَمْحَمَةٌ فَيَقُولُ: يَا رَسُولَ اللَّهِ أَغِثْنِي فَأَقُولُ: لَا أَمْلِكُ لَكَ شَيْئًا قَدْ أَبْلَغْتُكَ لَا أُلْفِيَنَّ أَحَدَكُمْ يَجِيءُ يَوْمَ الْقِيَامَةِ عَلَى رَقَبَتِهِ شَاةٌ لَهَا ثُغَاءٌ يَقُولُ: يَا رَسُولَ اللَّهِ أَغِثْنِي فَأَقُولُ: لَا أَمْلِكُ لَكَ شَيْئًا قَدْ أَبْلَغْتُكَ لَا أُلْفِيَنَّ أَحَدَكُمْ يَجِيءُ يَوْمَ الْقِيَامَةِ عَلَى رَقَبَتِهِ نَفْسٌ لَهَا صِيَاحٌ فَيَقُولُ: يَا رَسُولَ اللَّهِ أَغِثْنِي فَأَقُولُ: لَا أَمْلِكُ لَكَ شَيْئًا قَدْ أَبْلَغْتُكَ لَا أُلْفِيَنَّ أَحَدَكُمْ يَجِيءُ يَوْمَ الْقِيَامَةِ عَلَى رَقَبَتِهِ رِقَاعٌ تَخْفُقُ فَيَقُولُ: يَا رَسُولَ اللَّهِ أَغِثْنِي فَأَقُولُ: لَا أَمْلِكُ لَكَ شَيْئًا قَدْ أَبْلَغْتُكَ لَا أُلْفِيَنَّ أَحَدَكُمْ يَجِيءُ يَوْمَ الْقِيَامَةِ عَلَى رَقَبَتِهِ صَامِتٌ فَيَقُولُ: يَا رَسُولَ اللَّهِ أَغِثْنِي فَأَقُولُ: لَا أَمْلِكُ لَكَ شَيْئا قد أبلغتك \". وَهَذَا لفظ مُسلم وَهُوَ أتم","english":{"narrator":"","text":"Abu Huraira told that God's Messenger stood up among them one day and mentioned dishonesty regarding spoil, treating it and everything connected with it as a serious matter. He then said, “Let me not find any of you coming on the day of resurrection with a camel rumbling on his neck and asking me to rescue him,* for I shall say that I can do nothing for him as I have given him full instruction. Let me not find any of you coming on the day of resurrection with a horse whinnying on his neck and asking me to rescue him, for I shall say that I can do nothing for him as I have given him full instruction. Let me not find any of you coming on the day of resurrection with a sheep bleating on his neck and asking me to rescue him, for I shall say that I can do nothing for him as I have given him full instruction. Let me not find any of you coming on the day of resurrection with a soul shouting on his neck asking me to rescue him, for I shall say that I can do nothing for him as I have given him full instruction. Let me not find any of you coming on the day of resurrection with patches flapping on his neck and asking me to rescue him, for I shall say that I can do nothing for him as I have given him full instruction. Let me not find any of you coming on the day of resurrection with gold and silver on his neck asking me to rescue him, for I shall say that I can do nothing for him as I have given him full instruction. \n\n*Here and in the following phrases the man seeks to be rescued from the thing about which he was dishonest, it being tied to his neck.\n\n(Bukhari and Muslim, this being Muslim’s wording which is more complete.)"}},{"id":209,"idInBook":209,"chapterId":19,"bookId":14,"arabic":"وَعَنْهُ قَالَ: أَهْدَى رَجُلٌ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غُلَامًا يُقَالُ لَهُ: مِدْعَمٌ فَبَيْنَمَا مِدْعَمٌ يَحُطُّ رَحْلًا لِرَسُولِ اللَّهِ صَلَّى الله عَلَيْهِ وَسلم إِذْ أَصَابَهُ سهم عاثر فَقَتَلَهُ فَقَالَ النَّاسُ: هَنِيئًا لَهُ الْجَنَّةُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «كَلَّا وَالَّذِي نَفسِي بِيَدِهِ إِن الثملة الَّتِي أَخَذَهَا يَوْمَ خَيْبَرَ مِنَ الْمَغَانِمِ لَمْ تُصِبْهَا الْمَقَاسِمُ لَتَشْتَعِلُ عَلَيْهِ نَارًا» . فَلَمَّا سَمِعَ ذَلِك النَّاس جَاءَ رجل بشرك أَوْ شِرَاكَيْنِ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «شِرَاكٌ مِنْ نَارٍ أَوْ شِرَاكَانِ من نارٍ»","english":{"narrator":"","text":"He told that a man presented God’s Messenger with a slave called Mid'am, and while Mid'am was unsaddling a camel belonging to God’s Messenger he was struck by a random arrow which killed him. The people said, “Congratulations to him! He will go to paradise;” but God’s Messenger said, “Not at all. By Him in whose hand my soul is, the cloak he took on the day of Khaibar from the spoils which was not among the shares divided will blaze with fire upon him.” When the people heard that, a man brought a sandal-strap, or two sandal-straps, to the Prophet and said, “A sandal-strap of fire,” or, “Two sandal-straps of fire.” \n\n(Bukhari and Muslim.)"}},{"id":210,"idInBook":210,"chapterId":19,"bookId":14,"arabic":"وَعَن عبدِ الله بنِ عَمْروٍ قَالَ: كَانَ عَلَى ثَقَلِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلٌ يُقَالُ لَهُ كَرْكَرَةُ فَمَاتَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «هُوَ فِي النَّارِ» فَذَهَبُوا يَنْظُرُونَ فَوَجَدُوا عَبَاءَةً قد غلها. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"'Abdallah b. ‘Amr told that when a man called Karkara* who was in charge of the Prophet’s belongings died God’s Messenger said, “He will go to hell. “The people went off and looked and found a striped woollen garment which he had dishonestly appropriated from the spoil. \n\n*There is doubt about the spelling of this man’s name. Karkira and Kirkira are also mentioned.\n\nBukhari transmitted it."}},{"id":211,"idInBook":211,"chapterId":19,"bookId":14,"arabic":"وَعَن ابْن عمر قَالَ: كُنَّا نُصِيبُ فِي مَغَازِينَا الْعَسَلَ وَالْعِنَبَ فنأكله وَلَا نرفعُه رَوَاهُ البُخَارِيّ","english":{"narrator":"Ibn ‘Umar said:","text":"On our expeditions we used to get honey and grapes and eat them without bringing them to the Prophet. \n\nBukhari transmitted it."}},{"id":212,"idInBook":212,"chapterId":19,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ قَالَ: أَصَبْتُ جِرَابًا مِنْ شَحْمٍ يَوْمَ خَيْبَرَ فَالْتَزَمْتُهُ فَقُلْتُ: لَا أُعْطِي الْيَوْمَ أَحَدًا مِنْ هَذَا شَيْئًا فَالْتَفَتُّ فَإِذَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يبتسم إِلَيّ. مُتَّفق عَلَيْهِ. وَذكر الحَدِيث أَبِي هُرَيْرَةَ «مَا أُعْطِيكُمْ» فِي بَابِ «رِزْقِ الْوُلَاة»","english":{"narrator":"‘Abdallah b. Mughaffal said:","text":"On the day of Khaibar I got a skin of fat, and when I decided not to give anyone any of it that day I turned round and saw God’s Messenger smiling at me. \n\n(Bukhari and Muslim.)"}},{"id":213,"idInBook":213,"chapterId":19,"bookId":14,"arabic":"عَنْ أَبِي أُمَامَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" إِنَّ اللَّهَ فَضَّلَنِي عَلَى الْأَنْبِيَاءِ أَوْ قَالَ: فَضَّلَ أُمَّتِي عَلَى الْأُمَمِ وأحلَّ لنا الْغَنَائِم \". رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Abu Umama reported the Prophet as saying, “God has given me superiority over the prophets,” or as saying, “has given my people superiority over other peoples and made spoils lawful to us.” \n\nTirmidhi transmitted it."}},{"id":214,"idInBook":214,"chapterId":19,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى الله عَلَيْهِ وَسلم: يَوْمئِذٍ يَوْمَ حُنَيْنٍ: «مَنْ قَتَلَ كَافِرًا فَلَهُ سَلَبُهُ» فَقَتَلَ أَبُو طَلْحَةَ يَوْمَئِذٍ عِشْرِينَ رَجُلًا وَأَخَذَ أسلابهم. رَوَاهُ الدَّارمِيّ","english":{"narrator":"","text":"Anas reported God’s Messenger as saying on that day, meaning the day of Hunain, “He who kills an infidel gets what he takes from him.” Abu Talha killed twenty men that day and got what was taken from them. \n\nDarimi transmitted it."}},{"id":215,"idInBook":215,"chapterId":19,"bookId":14,"arabic":"وَعَنْ عَوْفِ بْنِ مَالِكٍ الْأَشْجَعِيِّ وَخَالِدِ بْنِ الْوَلِيدِ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى فِي السَّلَبِ لِلْقَاتِلِ. وَلَمْ يُخَمِّسِ السَلَب. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"‘Auf b. Malik al-Ashja‘i and Khalid b. al-Walid told that God’s Messenger gave judgment that the killer should have what was taken from the man he killed, and did not make this subject to division into fifths. \n\nAbu Dawud transmitted it."}},{"id":216,"idInBook":216,"chapterId":19,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ: نَفَّلَنِي رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ بَدْرٍ سَيْفَ أَبِي جَهْلٍ وَكَانَ قَتَلَهُ. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"‘Abdallah b. Mas'ud said that at the battle of Badr God’s Messenger gave him Abu Jahl’s sword, as he had killed him. \n\nAbu Dawud transmitted it."}},{"id":217,"idInBook":217,"chapterId":19,"bookId":14,"arabic":"وَعَنْ عُمَيْرٍ مَوْلَى آبِي اللَّحْمِ قَالَ: شَهِدْتُ خَيْبَر مَعَ ساداتي فَكَلَّمُوا فِي رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَلَّمُوهُ أَنِّي مَمْلُوكٌ فَأَمَرَنِي فَقُلِّدْتُ سَيْفًا فَإِذَا أَنَا أَجُرُّهُ فَأَمَرَ لِي بِشَيْءٍ مِنْ خُرْثِيِّ الْمَتَاعِ وَعَرَضْتُ عَلَيْهِ رُقْيَةً كَنْتُ أَرْقِي بِهَا الْمَجَانِينَ فَأَمَرَنِي بِطَرْحِ بَعْضِهَا وَحَبْسِ بَعْضِهَا. رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ إِلَّا أَنَّ رِوَايَتَهُ انتهتْ عِنْد قَوْله: الْمَتَاع","english":{"narrator":"‘Umair client of Abul Lahm said:","text":"I was present at Khaibar along with my masters who spoke about me to God's Messenger, telling him that I was a slave. He ordered that I should have a sword girded on me, and I was trailing it.* He then ordered that I should be given some inferior goods. I submitted to him a spell with which I used to treat people who were possessed and he ordered me to reject part of it and retain part. \n\n*Either because he was a small man, or because he was young.\n\nTirmidhi and Abu Dawud transmitted it, but the latter's version ended at “goods”."}},{"id":218,"idInBook":218,"chapterId":19,"bookId":14,"arabic":"وَعَن محمع بن جاريةَ قَالَ: قُسِمَتْ خَيْبَرُ عَلَى أَهْلِ الْحُدَيْبِيَةِ فَقَسَمَهَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَمَانِيَةَ عَشَرَ سَهْمًا وَكَانَ الْجَيْشُ أَلْفًا وَخَمْسَمِائَةٍ فِيهِمْ ثَلَاثُمِائَةِ فَارِسٍ فَأُعْطِيَ الْفَارِسُ سَهْمَيْنِ وَالرَّاجِلُ سَهْمًا رَوَاهُ أَبُو دَاوُدَ وَقَالَ: حَدِيثُ ابْنِ عُمَرَ أصح فَالْعَمَل عَلَيْهِ وَأَتَى الْوَهْمُ فِي حَدِيثِ مُجَمِّعٍ أَنَّهُ قَالَ: أَنَّهُ قَالَ: ثَلَاثُمِائَةِ فَارِسٍ وَإِنَّمَا كَانُوا مِائَتَيْ فَارس\nوَعَن حبيب بن مسلَمةَ الفِهْريِّ قَالَ شَهِدْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نفل الرّبع فِي البدأة وَالثلث فِي الرجمة. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"Mujammi' b. Jariya said:","text":"Khaibar was divided among those who had been at al-Hudaibiya, and God’s Messenger divided it into eighteen portions. The army was one thousand five hundred of which three hundred were cavalry, and he gave two shares to a horseman and one to a footman. Abu Dawud transmitted it, saying Ibn ‘Umar’s tradition1 is sounder, and it is the one which is followed. The error in the tradition of Mujammi’ was because he said three hundred horsemen when there were only two hundred.\nHabib b. Maslama al-Fihri said he saw the Prophet give a quarter of the spoil on the outward journey and a third on the return journey.2 \n\n1. I have available two editions of Abu Dawud’s Sunan (Cairo, 1280 and 1348 A .H.). Both give Ibn Mu'awiya in place of Ibn 'Umar. See Jihad, 144.\n2. This tradition and the following one are explained as referring to a section of the army which comes in contact with the enemy. The greater amount granted them when this happens on the return journey is because there is more difficulty and danger in fighting after having gone through the campaign. The second tradition is more explicit by making it clear that the fifth was deducted.\n\nAbu Dawud transmitted it."}},{"id":219,"idInBook":219,"chapterId":19,"bookId":14,"arabic":"وَعَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُنَفِّلُ الرُّبُعَ بَعْدَ الْخُمُسِ وَالثُّلُثَ بَعْدَ الْخُمُسِ إِذَا قَفَلَ. رَوَاهُ أَبُو دَاوُدَ","english":{"narrator":"","text":"He said that God’s Messenger used to give a quarter as booty after the fifth had been kept off, and a third after the fifth had been kept off when he returned. \n\nAbu Dawud transmitted it."}},{"id":220,"idInBook":220,"chapterId":19,"bookId":14,"arabic":"وَعَنْ أَبِي الْجُوَيْرِيَّةِ الْجَرْمِيِّ قَالَ: أَصَبْتُ بِأَرْضِ الرُّومِ جَرَّةً حَمْرَاءَ فِيهَا دَنَانِيرُ فِي إِمْرَةِ مُعَاوِيَةَ وَعَلَيْنَا رَجُلٍ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ بَنِي سُلَيْمٍ يُقَالُ لَهُ: مَعْنُ بْنُ يَزِيدَ فَأَتَيْتُهُ بِهَا فَقَسَمَهَا بَيْنَ الْمُسْلِمِينَ وَأَعْطَانِي مِنْهَا مِثْلَ مَا أَعْطَى رَجُلًا مِنْهُمْ ثُمَّ قَالَ: لَوْلَا أَنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَا نَفَلَ إِلَّا بَعْدَ الْخُمُسِ» لَأَعْطَيْتُكَ. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"Abul Juwairiya al-Jarmi said:","text":"In the period when Mu'awiya was governor he got a red jar containing dinars in the land of the Byzantines. A man of the B. Sulaim called Ma'n b. Yazid who was a companion of God’s Messenger was in charge of us, and when I took it to him he divided it among the Muslims giving me the same as he gave the others. He then said that if he had not heard God’s Messenger say, “Booty is granted only after the fifth has been kept off,” he would have given it to me. \n\nAbu Dawud transmitted it."}},{"id":221,"idInBook":221,"chapterId":19,"bookId":14,"arabic":"وَعَن أبي مُوسَى الأشعريِّ قَالَ: قَدِمْنَا فَوَافَقْنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ افْتَتَحَ خَيْبَرَ فَأَسْهَمَ لَنَا أَوْ قَالَ: فَأَعْطَانَا مِنْهَا وَمَا قَسَمَ لِأَحَدٍ غَابَ عَنْ فَتْحِ خَيْبَرَ مِنْهَا شَيْئًا إِلَّا لمَنْ شهِدَ معَه إِلَّا أَصْحَابَ سَفِينَتِنَا جَعْفَرًا وَأَصْحَابَهُ أَسْهَمَ لَهُمْ مَعَهم. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"Abu Musa al-Ash'ari said:","text":"We arrived just at the moment when God’s Messenger had conquered Khaibar and he appointed us a portion (or he said he gave us some of it). He allotted nothing to anyone who was not present at the conquest of Khaibar, giving shares only to those who were present with him, except for those who were in our ship,* Ja'far and his companions to whom he appointed something along with them. \n\n*The party to which reference is made is that of people who had emigrated from Mecca to Abyssinia and were now returning.\n\nAba Dawud transmitted it."}},{"id":222,"idInBook":222,"chapterId":19,"bookId":14,"arabic":"وَعَنْ يَزِيدَ بْنِ خَالِدٍ: أَنِّ رَجُلًا مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تُوُفِّيَ يَوْمَ خَيْبَرَ فَذَكَرُوا لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «صَلُّوا عَلَى صَاحِبِكُمْ» فَتَغَيَّرَتْ وُجُوهُ النَّاسِ لِذَلِكَ فَقَالَ: «إِنَّ صَاحِبَكُمْ غَلَّ فِي سَبِيلِ اللَّهِ» فَفَتَّشْنَا مَتَاعَهُ فَوَجَدْنَا خَرَزًا مِنْ خَرَزِ يَهُودَ لَا يُسَاوِي دِرْهَمَيْنِ. رَوَاهُ مَالك وَأَبُو دَاوُد وَالنَّسَائِيّ","english":{"narrator":"","text":"Yazid b. Khalid told that when one of God’s Messenger’s companions died at the battle of Khaibar they mentioned the matter to him and he replied, “Pray over your companion.” When the people looked perplexed at that he said, “Your companion was dishonest about booty in God’s path.” They searched his belongings and found some Jewish beads not worth two dirhams. \n\nMalik, Abu Dawud and Nasa’i transmitted it."}},{"id":223,"idInBook":223,"chapterId":19,"bookId":14,"arabic":"وَعَن عبدِ الله بنِ عَمْروٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَصَابَ غَنِيمَةً أَمَرَ بِلَالًا فَنَادَى فِي النَّاسِ فَيَجِيئُونَ بِغَنَائِمِهِمْ فَيُخَمِّسُهُ وَيُقَسِّمُهُ فَجَاءَ رَجُلٌ يَوْمًا بَعْدَ ذَلِكَ بِزِمَامٍ مِنْ شَعَرٍ فَقَالَ: يَا رَسُولَ اللَّهِ هَذَا فِيمَا كُنَّا أَصَبْنَاهُ مِنَ الْغَنِيمَةِ قَالَ: «أَسْمَعْتَ بِلَالًا نَادَى ثَلَاثًا؟» قَالَ: نَعَمْ قَالَ: «فَمَا مَنَعَكَ أَنْ تَجِيءَ بِهِ؟» فَاعْتَذَرَ قَالَ: «كُنْ أَنْتَ تَجِيءُ بِهِ يومَ القيامةِ فلنْ أقبلَه عَنْك» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"‘Abdallah b. ‘Amr told that when God’s Messenger gained booty he ordered Bilal to make a public announcement, and when the people brought their booty he would take a fifth and divide it. One day a man brought a halter of hair after that and said, “Messenger of God, this is part of the booty we got.” He asked whether he had heard Bilal making announcement three times, and when he replied that he had, he asked what had prevented him from bringing it. He made some excuse, so he said, “You must bring it yourself on the day of resurrection, for I shall never accept it from you.” \n\nAbu Dawud transmitted it."}},{"id":224,"idInBook":224,"chapterId":19,"bookId":14,"arabic":"وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبَا بَكْرٍ وَعُمَرَ حَرَّقُوا مَتَاعَ الْغَالِّ وضربوه. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"‘Amr b. Shu'aib, on his father’s authority, said that his grandfather told that God’s Messenger, Abu Bakr and ‘Umar burned the belongings of anyone who was dishonest about booty and beat him. \n\nAbu Dawud transmitted it."}},{"id":225,"idInBook":225,"chapterId":19,"bookId":14,"arabic":"وَعَنْ سَمُرَةَ بْنِ جُنْدَبٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنْ يَكْتُمُ غَالًّا فَإِنَّهُ مِثْلُهُ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Samura b. Jundub told that God’s Messenger used to say, “Anyone who conceals one who has been dishonest about booty is like him.\n\nAbu Dawud transmitted it."}},{"id":226,"idInBook":226,"chapterId":19,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَن شري الْمغنم حَتَّى تقسم. رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Aba Sa'id told that God’s Messenger forbade selling booty before it was divided. \n\nTirmidhi transmitted it."}},{"id":227,"idInBook":227,"chapterId":19,"bookId":14,"arabic":"وَعَنْ أَبِي أُمَامَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: نَهْيٌ أَنْ تُبَاعَ السِّهَامُ حَتَّى تُقْسَمَ. رَوَاهُ الدَّارمِيّ","english":{"narrator":"","text":"Abu Umama told that the Prophet forbade the sale of portions before they were divided. \n\nTirmidhi transmitted it."}},{"id":228,"idInBook":228,"chapterId":19,"bookId":14,"arabic":"وَعَن خولةَ بنتِ قيسٍ: قَالَتْ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِنَّ هَذِهِ الْمَالَ خَضِرَةٌ حُلْوَةٌ فَمَنْ أَصَابَهُ بِحَقِّهِ بُورِكَ لَهُ فِيهِ وَرُبَّ متخوض فَمَا شَاءَتْ بِهِ نَفْسُهُ مِنْ مَالِ اللَّهِ وَرَسُولِهِ لَيْسَ لَهُ يَوْمَ الْقِيَامَةِ إِلَّا النَّارُ» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Khaula, daughter of Qais, told of hearing God’s Messenger say, “This property is fresh and sweet and he who gets it in a proper way will be blessed in it, but he who improperly acquires such property of God and His Messenger as his soul wishes will have nothing but hell on the day of resurrection.” \n\nTirmidhi transmitted it."}},{"id":229,"idInBook":229,"chapterId":19,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَنَفَّلَ سيفَه ذَا الفَقارِ يومَ بدْرٍ رَوَاهُ أَحْمد وَابْن مَاجَهْ وَزَادَ التِّرْمِذِيُّ وَهُوَ الَّذِي رَأَى فِيهِ الرُّؤْيَا يَوْم أحد","english":{"narrator":"","text":"Ibn 'Abbas said that the Prophet got his sword Dhul Fiqar as private booty at the battle of Badr. \n\nIbn Majah transmitted it, and Tirmidhi added that it was that about which he had the vision at the battle of Uhud."}},{"id":230,"idInBook":230,"chapterId":19,"bookId":14,"arabic":"وَعَن رويفع بْنِ ثَابِتٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلَا يَرْكَبْ دَابَّةً مِنْ فَيْءِ الْمُسْلِمِينَ حَتَّى إِذَا أَعْجَفَهَا رَدَّهَا فِيهِ وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلَا يَلْبَسْ ثَوْبًا مِنْ فَيْءِ الْمُسلمين حَتَّى إِذا أخلقه ردهَا فِيهِ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Ruwaifi' b. Thabit reported the Prophet as saying, “He who believes in God and the last day must not ride a packhorse belonging to the booty of the Muslims and put it back when he has emaciated it; and he who believes in God and the last day must not wear a garment belonging to the booty of the Muslims and put it back when he has made it threadbare.” \n\nAbu Dawud transmitted it."}},{"id":231,"idInBook":231,"chapterId":19,"bookId":14,"arabic":"وَعَنْ مُحَمَّدِ بْنِ أَبِي الْمُجَالِدِ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى قَالَ: قُلْتُ: هَلْ كُنْتُمْ تُخَمِّسُونَ الطَّعَامَ فِي عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ؟ قَالَ: أَصَبْنَا طَعَامًا يَوْمَ خَيْبَرَ فَكَانَ الرَّجُلُ يَجِيءُ فَيَأْخُذُ مِنْهُ مقدارَ مَا يكفيهِ ثمَّ ينْصَرف. وَرَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Muhammad b. Abul Mujalid reported ‘Abdallah b. Abu Aufa as saying he asked whether they set aside the fifth of food in the time of God’s Messenger and received the reply that on the day of Khaibar they captured food and a man would come and take as much of it as he needed and then go away. \n\nAbu Dawud transmitted it."}},{"id":232,"idInBook":232,"chapterId":19,"bookId":14,"arabic":"وَعَن ابنِ عُمَرَ: أَنَّ جَيْشًا غَنِمُوا فِي زَمَنِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طَعَامًا وَعَسَلًا فَلَمْ يُؤخذْ منهمُ الْخمس. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Ibn ‘Umar said that in the time of God’s Messenger an army got food and honey in booty and a fifth was not taken from them. \n\nAbu Dawud transmitted it."}},{"id":233,"idInBook":233,"chapterId":19,"bookId":14,"arabic":"وَعَنِ الْقَاسِمِ مَوْلَى عَبْدِ الرَّحْمَنِ عَنْ بَعْضِ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: كنَّا نأكلُ الجَزورَ فِي الغزْوِ وَلَا نُقَسِّمُهُ حَتَّى إِذَا كُنَّا لَنَرْجِعُ إِلَى رِحَالِنَا وأخْرِجَتُنا مِنْهُ مَمْلُوءَة. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"Al-Qasim the client of ‘Abd ar-Rahman quoted one of the Prophet’s companions as saying:","text":"We would eat a camel on an expedition without dividing it, and when we returned to our dwellings our saddle-bags would be full with its flesh.\n\nAbu Dawud transmitted it."}},{"id":234,"idInBook":234,"chapterId":19,"bookId":14,"arabic":"وَعَنْ عُبَادَةَ بْنِ الصَّامِتِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ: «أَدُّوا الْخِيَاطَ وَالْمِخْيَطَ وَإِيَّاكُمْ وَالْغُلُولَ فَإِنَّهُ عَارٌ عَلَى أَهْلِهِ يَوْمَ الْقِيَامَةِ» . رَوَاهُ الدَّارِمِيُّ\nوَرَوَاهُ النَّسَائِيُّ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ","english":{"narrator":"","text":"‘Ubada b. as-Samit told that the Prophet used to say, “Hand over threads and needles and avoid dishonesty about booty, for it will be a reproach to those who are guilty of it on the day of resurrection.” \n\nDarimi transmitted it, and Nasa’i transmitted on the authority of ‘Amr b. Shu'aib who gave it on his father’s authority as coming from his grandfather."}},{"id":235,"idInBook":235,"chapterId":19,"bookId":14,"arabic":"وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ: دَنَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ بَعِيرٍ فَأَخَذَ وَبَرَةً مِنْ سَنَامِهِ ثُمَّ قَالَ: «يَا أَيُّهَا النَّاسُ إِنَّهُ لَيْسَ لِي مِنْ هَذَا الْفَيْءِ شَيْءٌ وَلَا هَذَا وَرَفَعَ إِصْبَعَهُ إِلَّا الْخُمُسَ وَالْخُمُسُ مَرْدُودٌ عَلَيْكُمْ فَأَدُّوا الْخِيَاطَ وَالْمِخْيَطَ» فَقَامَ رَجُلٌ فِي يَدِهِ كُبَّةٌ شَعَرٍ فَقَالَ: أَخَذْتُ هَذِهِ لِأُصْلِحَ بِهَا بَرْدَعَةً فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَمَّا مَا كانَ لي ولبني عبدِ المطلبِ فهوَ لكَ» . فَقَالَ: أمّا إِذا بَلَغَتْ مَا أَرَى فَلَا أَرَبَ لِي فِيهَا ونبَذَها. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"‘Amr b. Shu'aib, on his father’s authority, said his grandfather told that, the Prophet approached a camel, and taking a hair from its hump said, “O people, I get nothing of this booty, not even this (meanwhile raising his finger), but the fifth, and the fifth is returned to you, so hand over threads and needles.\" A man got up with a ball of hair in his hand and said, “I took this to repair the cloth under a pack-saddle.\" The Prophet replied, “You can have what belongs to me and to the B. ‘Abd al-Muttalib,\" but the man said, \"If it produces the result I now realise,* I have no desire for it,\" and he threw it away. \n\n*Literally \"If it reaches what I see.\"\n\nAbu Dawud transmitted it."}},{"id":236,"idInBook":236,"chapterId":19,"bookId":14,"arabic":"وَعَن عمْرو بن عَبَسةَ قَالَ: صَلَّى بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى بَعِيرٍ مِنَ الْمَغْنَمِ فَلَمَّا سَلَّمَ أَخَذَ وَبَرَةً مِنْ جَنْبِ الْبَعِيرِ ثُمَّ قَالَ: «وَلَا يَحِلُّ لِي مِنْ غَنَائِمِكُمْ مِثْلُ هَذَا إِلَّا الْخُمُسُ وَالْخُمُسُ مَرْدُودٌ فِيكُمْ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"‘Amr b. ‘Abasa said:","text":"God’s Messenger led us in prayer facing a camel which had been taken in booty, and when he had given the salutation he took a hair from the camel’s side and said, \"I have no right to as much as this of your booty, but only to the fifth, and the fifth is returned to you.\" \n\nAbu Dawud transmited it."}},{"id":237,"idInBook":237,"chapterId":19,"bookId":14,"arabic":"وَعَن جُبير بنُ مُطعِمٍ قَالَ: لَمَّا قَسَمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَهْمَ ذَوِي الْقُرْبَى بَيْنَ بَنِي هَاشِمٍ وَبَنِي الْمُطَّلِبِ أَتَيْتُهُ أَنَا وَعُثْمَانُ بْنُ عَفَّانَ فَقُلْنَا: يَا رَسُولَ اللَّهِ هَؤُلَاءِ إِخْوَانُنَا مِنْ بَنِي هَاشِمٍ لَا نُنْكِرُ فَضْلَهُمْ لِمَكَانِكَ الَّذِي وضعكَ اللَّهُ مِنْهُمْ أَرَأَيْتَ إِخْوَانَنَا مِنْ بَنِي الْمُطَّلِبِ أَعْطَيْتَهُمْ وَتَرَكْتَنَا وَإِنَّمَا قَرَابَتُنَا وَقَرَابَتُهُمْ وَاحِدَةً فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّمَا بَنُو هَاشِمٍ وَبَنُو الْمُطَّلِبِ شَيْءٌ وَاحِدٌ هَكَذَا» . وَشَبَّكَ بَيْنَ أَصَابِعِهِ. رَوَاهُ الشَّافِعِيُّ وَفِي رِوَايَةِ أَبِي دَاوُدَ وَالنَّسَائِيِّ نَحْوُهُ وَفِيهِ: «إِنَّا وَبَنُو الْمُطَّلِبِ لَا نَفْتَرِقُ فِي جَاهِلِيَّةٍ وَلَا إِسْلَامٍ وَإِنَّمَا نَحْنُ وَهُمْ شَيْءٌ وَاحِدٌ» وَشَبَّكَ بَيْنَ أَصَابِعه","english":{"narrator":"Jubair b. Mut'im said:","text":"When God’s Messenger divided the portion of the relatives among the B. Hashim and the B. al-Muttalib, ‘Uthman b. ‘Affan and I came to him and said, \"Messenger of God, these are our brethren of the B. Hashim whose superiority we do not deny because of the position in which God has placed you in relation to them, but tell us about our brethren of the B. al-Muttalib to whom you have given something while omitting us though our relationship is the same as theirs.\"* God’s Messenger replied, \"The B. Hashim and the B. al- Muttalib are one body like this,\" and he intertwined his fingers. \n\n* Cf. Chapter 8a\n\nShafi'i transmitted it, and there is something to the same effect in the version of Abu Dawud and Nasa'i. It says, \"I and the B. al-Muttalib have not been separate in the pre-Islamic or in the Islamic period and they and we are one,\" intertwining his fingers."}},{"id":238,"idInBook":238,"chapterId":19,"bookId":14,"arabic":"عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ قَالَ: إِنِّي وَاقِفٌ فِي الصَّفِّ يَوْمَ بَدْرٍ فَنَظَرْتُ عَنْ يَمِينِي وَعَنْ شِمَالِي فَإِذَا بِغُلَامَيْنِ مِنَ الْأَنْصَارِ حَدِيثَة أسنانها فتمنيت أَنْ أَكُونَ بَيْنَ أَضْلَعَ مِنْهُمَا فَغَمَزَنِي أَحَدُهُمَا فَقَالَ: يَا عَمِّ هَلْ تَعْرِفُ أَبَا جَهْلٍ؟ قُلْتُ: نَعَمْ فَمَا حَاجَتُكَ إِلَيْهِ يَا ابْنَ أَخِي؟ قَالَ: أُخْبِرْتُ أَنَّهُ يَسُبُّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالَّذِي نَفْسِي بِيَدِهِ لَئِنْ رَأَيْتُهُ لَا يُفَارِقُ سَوَادِي سَوَادَهُ حَتَّى يَمُوتَ الْأَعْجَلُ مِنَّا فَتَعَجَّبْتُ لِذَلِكَ قَالَ: وَغَمَزَنِي الْآخَرُ فَقَالَ لِي مِثْلَهَا فَلَمْ أَنْشَبْ أَنْ نَظَرْتُ إِلَى أَبِي جَهْلٍ يَجُولُ فِي النَّاسِ فَقُلْتُ: أَلَا تَرَيَانِ؟ هَذَا صَاحِبُكُمَا الَّذِي تَسْأَلَانِي عَنْهُ قَالَ: فابتدراه بسيفهما فَضَرَبَاهُ حَتَّى قَتَلَاهُ ثُمَّ انْصَرَفَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فأخبراهُ فَقَالَ: «أَيُّكُمَا قَتَلَهُ؟» فَقَالَ كُلُّ وَاحِدٍ مِنْهُمَا: أَنَا قَتله فَقَالَ: «هلْ مسحتُما سيفَيكما؟» فَقَالَا: لَا فَنَظَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى السَّيْفَيْنِ فَقَالَ: «كِلَاكُمَا قَتَلَهُ» . وَقَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِسَلَبِهِ لِمُعَاذِ بن عَمْرِو بن الْجَمُوحِ وَالرَّجُلَانِ: مُعَاذُ بْنُ عَمْرِو بْنِ الْجَمُوحِ ومعاذ بن عفراء","english":{"narrator":"‘Abdar-Rahman b. ‘Auf said:","text":"When I stood in the rank at the battle of Badr I looked to my right and my left, and when I saw that I was between two young men of the Ansar I wished that I had been between men who were stronger than they. One of them pinched me and said, \"Do you know Abu Jahl, uncle?\" and I replied, \"Yes, but what do you want with him, nephew?” He said, “I have been told that he reviles God's Messenger. By Him in whose hand my soul is, if I see him I shall not leave him till the one of us who is to die first dies.” I was astonished at that, and then the other pinched me and said the same to me. Before long I saw Abu Jahl going round among the people and I said, “Look, this is the man about whom you were asking.” They then hastened to him with their swords and struck him till they killed him, after which they went to God’s Messenger and informed him. He asked which of them had killed him and they both claimed to have done so. He then asked if they had wiped their swords, and when they replied that they had not he looked at the swords and said, “Both of you killed him.” God’s Messenger then decided that what was taken from him should go to Mu'adh b. ‘Amr b. al-Jamuh. The two men were Mu'adh b. ‘Amr b. al-Jamah and Mu'adh b. ‘Afra’.* \n\n*’Afra’ was his mother. His father was al-Harith.\n\n(Bukhari and Muslim.)"}},{"id":239,"idInBook":239,"chapterId":19,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ بَدْرٍ: «مَنْ يَنْظُرُ لَنَا مَا صَنَعَ أَبُو جَهْلٍ؟» فَانْطَلَقَ ابْنُ مَسْعُودٍ فَوَجَدَهُ قَدْ ضَرَبَهُ ابْنَا عَفْرَاءَ حَتَّى بَرَدَ قَالَ: فَأَخَذَ بِلِحْيَتِهِ فَقَالَ: أَنْتَ أَبُو جَهْلٍ فَقَالَ: وَهَلْ فَوْقَ رَجُلٍ قَتَلْتُمُوهُ. وَفِي رِوَايَةٍ: قَالَ: فَلَوْ غَيْرُ أَكَّارٍ قتلني","english":{"narrator":"","text":"Anas reported God’s Messenger as saying at the battle of Badr, “Who will find out for us what has happened to Abu Jahl?” Ibn Mas'ud went and. found that the two sons of ‘Afra,’ had struck him till he was almost dead, so he seized him by his beard and said, “Are you Abu Jahl?” He replied, “Have you killed more than a man?” In a version he said, “I wish someone other than a tiller of the ground had killed me.” \n\n(Bukhari and Muslim.)"}},{"id":240,"idInBook":240,"chapterId":19,"bookId":14,"arabic":"وَعَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ قَالَ: أَعْطَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَهْطًا وَأَنَا جَالِسٌ فَتَرَكَ رَسُولُ اللَّهِ صلى الله عَلَيْهِ وَسلم مِنْهُم رَجُلًا وَهُوَ أَعْجَبُهُمْ إِلَيَّ فَقُمْتُ فَقُلْتُ: مَا لَكَ عَنْ فُلَانٍ؟ وَاللَّهِ إِنِّي لَأُرَاهُ مُؤْمِنًا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أوْ مُسلما» ذكرَ سَعْدٌ ثَلَاثًا وَأَجَابَهُ بِمِثْلِ ذَلِكَ ثُمَّ قَالَ: «إِنِّي لَأُعْطِي الرَّجُلَ وَغَيْرُهُ أَحَبُّ إِلَيَّ مِنْهُ خَشْيَةَ أَنْ يُكَبَّ فِي النَّارِ عَلَى وَجْهِهِ» . مُتَّفَقٌ عَلَيْهِ. وَفِي رِوَايَةٍ لَهُمَا: قَالَ الزُّهْرِيُّ: فترى: أَن الْإِسْلَام الْكَلِمَة وَالْإِيمَان الْعَمَل الصَّالح","english":{"narrator":"Sa‘d b. Abu Waqqas said:","text":"While I was sitting God’s Messenger gave a company something but omitted the one who was most attractive to me. I therefore got up and said, ‘Why have you omitted so and so? I swear by God that I consider him to be a believer.” God’s Messenger replied, “No, a Muslim.” Sa'd mentioned that three times and he gave him the same reply, then said, “I give a man something although I like someone else better, from fear he may be thrown face downwards in hell.” \n\n(Bukhari and Muslim.) In a version by both of them Zuhri said be considered that Islam is the attestation of belief and faith is good action."}},{"id":241,"idInBook":241,"chapterId":19,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَامَ يَعْنِي يَوْمَ بَدْرٍ فَقَالَ: «إِنَّ عُثْمَانَ انْطَلَقَ فِي حَاجَةِ اللَّهِ وَحَاجَةِ رَسُولِهِ وَإِنِّي أُبَايِعُ لَهُ» فَضَرَبَ لَهُ رسولُ الله بِسَهْمٍ وَلَمْ يَضْرِبْ بِشَيْءٍ لِأَحَدٍ غَابَ غَيْرَهُ. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Ibn ‘Umar told that God's Messenger stood up, i.e. on the day of Badr, and said, ‘Uthman has gone off on the business of God and His Messenger and I shall take the oath of allegiance on his behalf. God’s Messenger then appointed him a share, but did not do so for anyone else who was absent. \n\nAbu Dawud transmitted it."}},{"id":242,"idInBook":242,"chapterId":19,"bookId":14,"arabic":"وَعَن رافعِ بن خديجٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَجْعَلُ فِي قَسْمِ الْمَغَانِمِ عَشْرًا مِنَ الشّاءِ بِبَعِير. رَوَاهُ النَّسَائِيّ","english":{"narrator":"","text":"Rafi' b. Khadij said that in the division of the booty God’s Messenger used to treat ten sheep as equivalent to a camel.\n\nNasa’i transmitted it."}},{"id":243,"idInBook":243,"chapterId":19,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" غَزَا نَبِيٌّ مِنَ الْأَنْبِيَاءِ فَقَالَ لِقَوْمِهِ: لَا يَتْبَعُنِي رَجُلٌ مَلَكَ بُضْعَ امْرَأَةٍ وَهُوَ يُرِيدُ أَنْ يَبْنِيَ بِهَا وَلَمَّا يَبْنِ بِهَا وَلَا أَحَدٌ بَنَى بُيُوتًا وَلَمْ يَرْفَعْ سُقُوفَهَا وَلَا رَجُلٌ اشْتَرَى غَنَمًا أَوْ خَلِفَاتٍ وَهُوَ يَنْتَظِرُ وِلَادَهَا فَغَزَا فَدَنَا مِنَ الْقَرْيَةِ صَلَاةَ الْعَصْرِ أَوْ قَرِيبًا مِنْ ذَلِكَ فَقَالَ لِلشَّمْسِ: إِنَّكِ مَأْمُورَةٌ وَأَنَا مَأْمُورٌ اللَّهُمَّ احْبِسْهَا عَلَيْنَا فَحُبِسَتْ حَتَّى فَتَحَ اللَّهُ عَلَيْهِ فَجَمَعَ الْغَنَائِمَ فَجَاءَتْ يَعْنِي النَّارَ لِتَأْكُلَهَا فَلَمْ تَطْعَمْهَا فَقَالَ: إِنَّ فِيكُمْ غُلُولًا فَلْيُبَايِعْنِي مِنْ كُلِّ قَبِيلَةٍ رَجُلٌ فَلَزِقَتْ يدُ رجلٍ بيدِه فَقَالَ: فيكُم الغُلولُ فجاؤوا بِرَأْسٍ مِثْلِ رَأْسِ بَقَرَةٍ مِنَ الذَّهَبِ فَوَضَعَهَا فَجَاءَتِ النَّارُ فَأَكَلَتْهَا \". زَادَ فِي رِوَايَةٍ: «فَلَمْ تَحِلَّ الْغَنَائِمُ لِأَحَدٍ قَبْلَنَا ثُمَّ أَحَلَّ اللَّهُ لَنَا الْغَنَائِمَ رَأَى ضَعْفَنَا وَعَجْزَنَا فَأَحَلَّهَا لَنَا»","english":{"narrator":"","text":"Abu Huraira reported God’s Messenger as saying, “A prophet who went out on an expedition told his people that no man should follow him who had married a woman with whom he wished to cohabit but had not yet done so, or who had built houses on which he had not yet put the roofs, or who had bought sheep or pregnant she-camels and was expecting them to produce young. He then went on the expedition and approached the town at the time of the afternoon prayer or thereabouts. He then told the sun that both it and he were under command and prayed God to keep it back for them, so it was kept back till God gave him victory. He collected the spoils and it (meaning fire) came to devour them, but did not do so. Saying that there was dishonesty about spoil among them he told them that a man from every tribe must swear allegiance to him, and when a man’s hand stuck in his he said there was dishonesty about spoil among them. They brought him a head of gold like a cow’s head an when he had laid it down the fire came and devoured the spoil.* A version has, \"Spoils were not allowable to anyone before us .Then God allowed spoils to us. He saw our weakness and incapacity and allowed them to us.” \n\n*This tradition combines elements of the story of Joshua commanding the sun to stand still (Joshua, 10:12) and the story of Achan’s sin (Joshua, 7:10 ff ).\n\n(Bukhari and Muslim.)"}},{"id":244,"idInBook":244,"chapterId":19,"bookId":14,"arabic":"وَعَن ابْن عَبَّاس قَالَ: حَدثنِي عمر قَالَ: لَمَّا كَانَ يَوْمَ خَيْبَرَ أَقْبَلَ نَفَرٌ مِنْ صَحَابَةِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالُوا: فُلَانٌ شَهِيدٌ وَفُلَانٌ شَهِيدٌ حَتَّى مَرُّوا عَلَى رَجُلٍ فَقَالُوا: فُلَانٌ شَهِيدٌ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «كَلَّا إِنِّي رَأَيْتُهُ فِي النَّارِ فِي بُرْدَةٍ غَلَّهَا أَوْ عَبَاءَةٍ» ثُمَّ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" يَا ابْنَ الْخَطَّابِ اذْهَبْ فَنَادِ فِي النَّاسِ: أَنَّهُ لَا يَدْخُلُ الْجَنَّةَ إِلَّا الْمُؤْمِنُونَ ثَلَاثًا \" قَالَ: فَخَرَجْتُ فَنَادَيْتُ: أَلَا إِنَّهُ لَا يَدْخُلُ الْجَنَّةَ إِلَّا الْمُؤْمِنُونَ ثَلَاثًا. رَوَاهُ مُسلم","english":{"narrator":"","text":"Ibn ‘Abbas said he was told by ‘Umar that on the day of Khaibar some of the Prophet’s companions came and said, So and so is a martyr and so and so is a martyr,” but when they came to a man about whom they said, \"So and so is a martyr” God’s Messenger declared, \"By no means, I have seen him in hell in a mantle (or cloak) which he took dishonestly.” God's Messenger then said, \"Go, Ibn al-Khattab, and announce among the people three times that only the believers will enter paradise.” He said he went out and announced three times, \"Only the believers will enter paradise.” \n\nMuslim transmitted it."}},{"id":245,"idInBook":245,"chapterId":19,"bookId":14,"arabic":"عَن بَجالَةَ قَالَ: كُنْتُ كَاتِبًا لِجَزْءِ بْنِ مُعَاوِيَةَ عَمِّ الْأَحْنَفِ فَأَتَانَا كِتَابُ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ قَبْلَ مَوْتِهِ بِسَنَةٍ: فَرِّقُوا بَيْنَ كُلِّ ذِي مَحْرَمٍ مِنَ الْمَجُوسِ وَلَمْ يَكُنْ عُمَرُ أَخَذَ الْجِزْيَةَ مِنَ الْمَجُوسِ حَتَّى شَهِدَ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخَذَهَا مِنْ مَجُوسِ هجَرَ. رَوَاهُ البُخَارِيّ\nوذُكرَ حديثُ بُريدةَ: إِذَا أَمَّرَ أَمِيرًا عَلَى جَيْشٍ فِي «بَابِ الْكتاب إِلى الْكفَّار»","english":{"narrator":"Bajala said:","text":"I was a clerk of Jaz’ b. Mu'awiya the paternal uncle of al-Ahnaf, and a year before the death of ‘Umar b. al-Khattab we received his letter in which he gave instruction to separate married couples among the Magians who were within the prohibited degrees. ‘Umar had not taken the jizya from the Magians till ‘Abd ar-Rahman b. ‘Auf testified that God’s Messenger had taken it from the Magians of Hajar. \n\nBukhari transmitted it."}},{"id":246,"idInBook":246,"chapterId":19,"bookId":14,"arabic":"عَنْ مُعَاذٍ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا وَجَّهَهُ إِلَى الْيَمَنِ أَمْرَهُ أَنْ يَأْخُذَ مِنْ كُلِّ حَالِمٍ يَعْنِي مُحْتَلِمٍ دِينَارًا أَوْ عَدْلَهُ مِنَ الْمَعَافِرِيِّ: ثِيَابٌ تَكُونُ بِالْيمن. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Mu'adh said that when God’s Messenger sent him to the Yemen he ordered him to take from every halim, meaning one who had reached puberty, a dinar or its equivalent in Ma'afiri,* i.e. garments of Yemen origin. \n\n*This word, which is usually an adjective qualifying thaub (garment), is here used by itself with an explanation of the meaning following Ma'afir is the name of a tribe which was a section of Hamdan, the Yemen tribal group.\n\nAbu Dawud transmitted it."}},{"id":247,"idInBook":247,"chapterId":19,"bookId":14,"arabic":"عَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَصْلُحُ قِبْلَتَانِ فِي أَرْضٍ وَاحِدَةٍ وَلَيْسَ عَلَى الْمُسْلِمِ جِزْيَةٌ» . رَوَاهُ أَحْمد وَالتِّرْمِذِيّ وَأَبُو دَاوُد","english":{"narrator":"","text":"Ibn ‘Abbas reported God’s Messenger as saying “Two qiblas in one land are not right, and no jizya is to be levied on a Muslim.” \n\nAhmad, Tirmidhi and Abu Dawud transmitted it."}},{"id":248,"idInBook":248,"chapterId":19,"bookId":14,"arabic":"وَعَن أنس قَالَ: بَعَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَالِدَ بْنَ الْوَلِيدِ إِلَى أُكَيْدِرِ دُومَةَ فَأَخَذُوهُ فَأَتَوْا بِهِ فَحَقَنَ لَهُ دَمَهُ وَصَالَحَهُ على الْجِزْيَة. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Anas told that God’s Messenger sent Khalid b. al-Walid to Ukaidir of Duma,* and when they seized him and brought him he spared his life and made peace with him on condition that he should pay jizya. \n\n*Duma was a fortress-near Tabuk. Ukaidir was a Christian. The incident took place in the year 9 A.H during the expedition to Tabuk.\n\nAbu Dawud transmitted it."}},{"id":249,"idInBook":249,"chapterId":19,"bookId":14,"arabic":"وَعَنْ حَرْبِ بْنِ عُبَيْدِ اللَّهِ عَنْ جَدِّهِ أبي أُمِّه عَنْ أَبِيهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّمَا الْعُشُورُ عَلَى الْيَهُودِ وَالنَّصَارَى وَلَيْسَ عَلَى الْمُسْلِمِينَ عُشُورٌ» . رَوَاهُ أَحْمَدُ وَأَبُو دَاوُدَ","english":{"narrator":"","text":"Harb b. ‘Ubaidallah told on the authority of his grandfather, his mother’s father, that he had it on the authority of his father that God’s Messenger said, “Tithes are to be levied on Jews and Christians, but are not to be levied on Muslims.” \n\nAhmad and Abu Dawud transmitted it."}},{"id":250,"idInBook":250,"chapterId":19,"bookId":14,"arabic":"وَعَنْ عُقْبَةَ بْنِ عَامِرٍ قَالَ: قُلْتُ: يَا رَسُولَ اللَّهِ إِنَّا نَمَرُّ بِقَوْمٍ فَلَا هُمْ يُضَيِّفُونَا وَلَا هُمْ يُؤَدُّونَ مَا لنا عَلَيْهِم منَ الحقِّ وَلَا نَحْنُ نَأْخُذُ مِنْهُمْ. فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنْ أَبَوْا إِلَّا أنْ تأخُذوا كُرهاً فَخُذُوا» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"‘Uqba b. 'Amir told that he said, “Messenger of God, we come to people who do not give us hospitality, or pay what is due to us from them, and we take nothing from them.’’ He replied, “If they make it necessary for you to take it by force, do so.” \n\nTirmidhi transmitted it."}},{"id":251,"idInBook":251,"chapterId":19,"bookId":14,"arabic":"عَنْ أَسْلَمَ أَنَّ عُمَرَ بْنَ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ ضَرَبَ الْجِزْيَةَ عَلَى أَهْلِ الذَّهَبِ أربعةَ دنانيرَ وعَلى أهلِ الوَرِقِ أَرْبَعِينَ دِرْهَمًا مَعَ ذَلِكَ أَرْزَاقُ الْمُسْلِمِينَ وَضِيَافَةُ ثلاثةِ أيامٍ. رَوَاهُ مَالك","english":{"narrator":"","text":"Aslam told that ‘Umar b. al-Khattab imposed as jizya four dinars on those who possessed gold and forty dirhams on those who possessed silver along with provisions for the Muslims and three days’ hospitality. \n\nMalik transmitted it."}},{"id":252,"idInBook":252,"chapterId":19,"bookId":14,"arabic":"عَنِ الْمِسْوَرِ بْنِ مَخْرَمَةَ وَمَرْوَانَ بْنِ الْحَكَمِ قَالَا: خَرَجَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ الْحُدَيْبِيَةِ فِي بِضْعَ عَشْرَةَ مِائَةً مِنْ أَصْحَابِهِ فَلَمَّا أَتَى ذَا الْحُلَيْفَةِ قَلَّدَ الْهَدْيَ وَأَشْعَرَ وَأَحْرَمَ مِنْهَا بِعُمْرَةٍ وَسَارَ حَتَّى إِذَا كَانَ بِالثَّنِيَّةِ الَّتِي يُهْبَطُ عَلَيْهِمْ مِنْهَا بَرَكَتْ بِهِ رَاحِلَتُهُ فَقَالَ النَّاسُ: حَلْ حَلْ خَلَأَتِ القَصْواءُ خلأت الْقَصْوَاء فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا خَلَأَتِ الْقَصْوَاءُ وَمَا ذَاكَ لَهَا بِخُلُقٍ وَلَكِنْ حَبَسَهَا حَابِسُ الْفِيلِ» ثُمَّ قَالَ: «وَالَّذِي نَفْسِي بِيَدِهِ لَا يَسْأَلُونِي خُطَّةً يُعَظِّمُونَ فِيهَا حُرُمَاتِ اللَّهِ إِلَّا أَعْطَيْتُهُمْ إِيَّاهَا» ثُمَّ زَجَرَهَا فَوَثَبَتْ فَعَدَلَ عَنْهُمْ حَتَّى نَزَلَ بِأَقْصَى الْحُدَيْبِيَةِ عَلَى ثَمَدٍ قَلِيلِ الْمَاءِ يَتَبَرَّضُهُ النَّاسُ تَبَرُّضًا فَلَمْ يَلْبَثْهُ النَّاسُ حَتَّى نَزَحُوهُ وَشُكِيَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْعَطَشَ فَانْتَزَعَ سَهْمًا مِنْ كِنَانَتِهِ ثُمَّ أَمَرَهُمْ أَنْ يَجْعَلُوهُ فِيهِ فو الله مَا زَالَ يَجِيشُ لَهُمْ بِالرِّيِّ حَتَّى صَدَرُوا عَنْهُ فَبَيْنَا هُمْ كَذَلِكَ إِذْ جَاءَ بُدَيْلُ بْنُ وَرْقَاءَ الخزاعيُّ فِي نفَرٍ منْ خُزَاعَةَ ثُمَّ أَتَاهُ عُرْوَةُ بْنُ مَسْعُودٍ وَسَاقَ الْحَدِيثَ إِلَى أَنْ قَالَ: إِذْ جَاءَ سُهَيْلُ بْنُ عَمْرٍو فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" اكْتُبْ: هَذَا مَا قَاضَى عَلَيْهِ مُحَمَّدٌ رَسُولُ اللَّهِ \". فَقَالَ سُهَيْلٌ: وَاللَّهِ لَوْ كُنَّا نَعْلَمُ أَنَّكَ رَسُولُ اللَّهِ مَا صَدَدْنَاكَ عَنِ الْبَيْتِ وَلَا قَاتَلْنَاكَ وَلَكِنِ اكْتُبْ: مُحَمَّدَ بْنَ عَبْدِ اللَّهِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" وَاللَّهِ إِنِّي لَرَسُولُ اللَّهِ وَإِنْ كَذَّبْتُمُونِي اكْتُبْ: مُحَمَّدَ بْنَ عَبْدِ اللَّهِ \" فَقَالَ سُهَيْلٌ: وَعَلَى أَنْ لَا يَأْتِيَكَ مِنَّا رَجُلٌ وَإِنْ كانَ على دينِكَ إِلاَّ ردَدْتَه علينا فَلَمَّا فَرَغَ مِنْ قَضِيَّةِ الْكِتَابِ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأَصْحَابِهِ: «قُومُوا فَانْحَرُوا ثُمَّ احْلِقُوا» ثُمَّ جَاءَ نِسْوَةٌ مُؤْمِنَاتٌ فَأَنْزَلَ اللَّهُ تَعَالَى: (يَا أَيُّهَا الَّذِينَ آمَنُوا إِذا جاءكُم المؤمناتُ مهاجِراتٌ)\nالْآيَةَ. فَنَهَاهُمُ اللَّهُ تَعَالَى أَنْ يَرُدُّوهُنَّ وَأَمَرَهُمْ أَنْ يَرُدُّوا الصَّدَاقَ ثُمَّ رَجَعَ إِلَى الْمَدِينَةِ فَجَاءَهُ أَبُو بَصِيرٍ رَجُلٌ مِنْ قُرَيْشٍ وَهُوَ مُسْلِمٌ فَأَرْسَلُوا فِي طَلَبِهِ رَجُلَيْنِ فَدَفَعَهُ إِلَى الرَّجُلَيْنِ فَخَرَجَا بِهِ حَتَّى إِذَا بَلَغَا ذَا الْحُلَيْفَةِ نَزَلُوا يَأْكُلُونَ مِنْ تَمْرٍ لَهُمْ فَقَالَ أَبُو بَصِيرٍ لِأَحَدِ الرَّجُلَيْنِ: وَاللَّهِ إِنِّي لَأَرَى سَيْفَكَ هَذَا يَا فُلَانُ جَيِّدًا أَرِنِي أَنْظُرْ إِلَيْهِ فَأَمْكَنَهُ مِنْهُ فَضَرَبَهُ حَتَّى بَرَدَ وَفَرَّ الْآخَرُ حَتَّى أَتَى الْمَدِينَةَ فَدَخَلَ الْمَسْجِدَ يَعْدُو فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَقَدْ رأى هَذَا ذُعراً» فَقَالَ: قُتِلَ واللَّهِ صَحَابِيّ وَإِنِّي لَمَقْتُولٌ فَجَاءَ أَبُو بَصِيرٍ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «وَيْلَ أُمِّهِ مِسْعَرَ حَرْبٍ لَوْ كَانَ لَهُ أَحَدٌ» فَلَمَّا سَمِعَ ذَلِكَ عَرَفَ أَنَّهُ سَيَرُدُّهُ إِلَيْهِمْ فَخَرَجَ حَتَّى أَتَى سِيفَ الْبَحْرِ قَالَ: وَانْفَلَتَ أَبُو جَنْدَلِ بْنُ سُهَيْلٍ فَلَحِقَ بِأَبِي بَصِيرٍ فَجَعَلَ لَا يَخْرُجُ مِنْ قُرَيْشٍ رَجُلٌ قَدْ أَسْلَمَ إِلَّا لَحِقَ بِأَبِي بَصِيرٍ حَتَّى اجْتَمَعَتْ مِنْهُمْ عِصَابَةٌ فو الله مَا يَسْمَعُونَ بِعِيرٍ خَرَجَتْ لِقُرَيْشٍ إِلَى الشَّامِ إِلَّا اعْتَرَضُوا لَهَا فَقَتَلُوهُمْ وَأَخَذُوا أَمْوَالَهُمْ فَأَرْسَلَتْ قُرَيْشٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تُنَاشِدُهُ اللَّهَ وَالرَّحِمَ لَمَّا أَرْسَلَ إِلَيْهِمْ فَمَنْ أَتَاهُ فَهُوَ آمِنٌ فَأَرْسَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسلم إِلَيْهِم. رَوَاهُ البُخَارِيّ","english":{"narrator":"Al-Miswar b. Makhrama and Marwan b. al-Hakam told that the Prophet went out in the year of al-Hudaibiya with over ten hundreds of his companions, and when he came to Dhul Hulaifa he garlanded and marked the votive animals, entered the sacred state for an ‘umra, and then moved on. When he came to the mountain pass by which one descends to Mecca his riding-beasts knelt down and the people said, “Go on, go on! Al-Qaswa’ has become jaded.” But the Prophet said, “Al- Qaswa’ has not become jaded, for that is not a characteristic of hers, but He who restrained the elephant1 has restrained her.” Then he said, “By Him in whose hand my soul is, they will not ask me any good thing by which they honour what God has made sacred without my giving them it.” He then urged her and she leaped up and he turned aside from the road to Mecca and stopped at the farthest point of al-Hudaibiya at a pool with little water which the people collected in small quantities and soon exhausted. Complaint of thirst was made to God’s Messenger, so he drew an arrow from his quiver and ordered them to put it in it, whereupon to their astonishment it kept gushing out to them with water till they left it. Meanwhile Budail b. Warqa’ al Khuza’i came with some members of Khuza’a and ‘Urwa b. Mas'ud joined him. He went on with the tradition2 to the point where he said that when Suhail b. ‘Amr came the Prophet said, “Write:","text":"This is what Muhammad God's Messenger has decided.” Suhail protested, “I swear by God that if we knew you were God’s Messenger we would not turn you away from the House or fight with you; but write: Muhammad b. ‘Abdallah.” The Prophet replied, “I swear by God that I am God’s Messenger even if you disbelieve me; write Muhammad b. ‘Abdallah.” Suhail said, “And that a man will not come to you from us, even if he follows your religion, without your sending him back to us.\" Then when he finished drawing up the document God’s Messenger said to his companions, \"Get up and sacrifice, and then shave.” Thereafter some believing women came and God most high sent down, \"O you who believe, when believing women come to you as emigrants…”3 God most high forbade them to send them back, but ordered them to restore the dower. When the Prophet returned to Medina Abu Basir, a man of Quraish who was a Muslim, came to him and they sent two men to look for him, so he handed him over to the two men. They took him away, and when they reached Dhul Hulaifa and alighted to eat some dates which they had Abu Basir said to one of the men, \"I swear by God, so and so, that I think this sword of yours is a fine one; let me look at it.” He let him have it and he struck him till he died, whereupon the other fled from him and when he reached Medina went running into the mosque. The Prophet said, “This man has seen something frightful.” He said, “I swear by God that my companion has been killed, and I am as good as dead.”4 Abu Basir arrived and the Prophet said, \"Woe to his mother, stirrer up of war! Would that he had some kinsfolk!”5 When he heard that he knew that he would send him back to them, so he went out and came to the seashore. Abu Jandal b. Suhail escaped and joined Abu Basir, and it became the practice that every man of Quraish who went out having accepted Islam joined Abu Basir, till a band of them collected. Whenever they heard of a caravan which belonged to Quraish going out to Syria they intercepted it, killed the men and seized their goods; so Quraish sent a message to the Prophet adjuring him by God and the ties of relationship to send instructions to them to stop, and agreeing that anyone who came to him would be safe. So the Prophet sent them instructions. \n\n    1. Cf. Al-Qur'an; 105.\n    2. This indicates that a part of Bukhari’s tradition is omitted here.\n    3. Al-Qur'an; 60:10.\n    4. Literally “and I am killed.\"\n    5. Literally “would that he had someone!” It probably means that the Prophet wished Abu Basir had had some kinsfolk to whom he could go, and so save him the necessity of returning him to Mecca.\n    6. Bukhari's tradition is very long. In the version given here it is much reduced, the purpose evidently being to give the essential parts of it without including every detail.\n\nBukhari transmitted it.6"}},{"id":253,"idInBook":253,"chapterId":19,"bookId":14,"arabic":"وَعَنِ الْبَرَاءِ بْنِ عَازِبٍ قَالَ: صَالَحَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمُشْرِكِينَ يَوْمَ الْحُدَيْبِيَةِ عَلَى ثَلَاثَةِ أَشْيَاءَ: عَلَى أَنَّ مَنْ أَتَاهُ مِنَ الْمُشْرِكِينَ رَدَّهُ إِلَيْهِمْ وَمَنْ أَتَاهُمْ مِنَ الْمُسْلِمِينَ لَمْ يَرُدُّوهُ وَعَلَى أَنْ يَدْخُلَهَا مِنْ قَابِلٍ وَيُقِيمَ بِهَا ثَلَاثَةَ أَيَّامٍ وَلَا يَدْخُلَهَا إِلَّا بِجُلُبَّانِ السِّلَاحِ وَالسَّيْفِ وَالْقَوْسِ وَنَحْوِهِ فَجَاءَ أَبُو جَنْدَلٍ يَحْجِلُ فِي قُيُودِهِ فَرده إِلَيْهِم","english":{"narrator":"Al-Bara’ b. ‘Azib said the Prophet made agreement with the polytheists on the day of al-Hudaibiya regarding three matters:","text":"that he should return to the polytheists anyone who came to him from them, but they should not return any of the Muslims who came to them; that he should enter Mecca the following year and stay in it three days; and that he should enter it only with such weapons as swords and bows in cases. Then Abu Jandal came hobbling in his fetters and he sent him back to them. \n\n(Bukhari and Muslim.)"}},{"id":254,"idInBook":254,"chapterId":19,"bookId":14,"arabic":"وَعَن أنس: أَنَّ قُرَيْشًا صَالَحُوا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاشْتَرَطُوا عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ مَنْ جَاءَنَا مِنْكُمْ لَمْ نَرُدَّهُ عَلَيْكُمْ وَمَنْ جَاءَكُمْ مِنَّا رَدَدْتُمُوهُ عَلَيْنَا فَقَالُوا: يَا رَسُولَ اللَّهِ أَنَكْتُبُ هَذَا؟ قَالَ: «نَعَمْ إِنه من ذهبَ منَّا إِليهم فَأَبْعَدَهُ اللَّهُ وَمَنْ جَاءَنَا مِنْهُمْ سَيَجْعَلُ اللَّهُ لَهُ فرجا ومخرجاً» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Anas told that Quraish made an agreement with the Prophet laying down the condition that if anyone came to them from him they should not send him back, but that if anyone came to him from them he should send him back. They asked God’s Messenger whether they should write that down and he replied, “Yes; may God remove far from His mercy anyone who goes from us to them, but God will make an escape and a way out for anyone who comes to us from them.” \n\nMuslim transmitted it."}},{"id":255,"idInBook":255,"chapterId":19,"bookId":14,"arabic":"وَعَن عَائِشَة قَالَتْ فِي بَيْعَةِ النِّسَاءِ: إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَمْتَحِنُهُنَّ بِهَذِهِ الْآيَة: (يَا أيُّها النبيُّ صلى الله عَلَيْهِ وَسلم إِذا جاءكَ المؤمناتُ يبايِعنَكَ)\nفَمَنْ أَقَرَّتْ بِهَذَا الشَّرْطِ مِنْهُنَّ قَالَ لَهَا: «قَدْ بَايَعْتُكِ» كَلَامًا يُكَلِّمُهَا بِهِ وَاللَّهِ مَا مَسَّتْ يَدُهُ يَدَ امْرَأَةٍ قَطُّ فِي الْمُبَايَعَةِ","english":{"narrator":"","text":"‘A’isha said regarding the oath of allegiance taken from women that God’s Messenger used to test them with this verse, “O Prophet, when believing women come to you to swear allegiance to you...” (Al-Qur’an; 60:12). When one of them acknowledged this condition he said to her, “I have made a covenant with you,” doing this only by words which he spoke to her. His hand never touched a woman’s hand when an oath of allegiance was taken. \n\n(Bukhari and Muslim.)"}},{"id":256,"idInBook":256,"chapterId":19,"bookId":14,"arabic":"عَن المِسْوَرِ وَمَرْوَانَ: أَنَّهُمُ اصْطَلَحُوا عَلَى وَضْعِ الْحَرْبِ عَشْرَ سِنِينَ يَأْمَنُ فِيهَا النَّاسُ وَعَلَى أَنَّ بَيْنَنَا عَيْبَةً مَكْفُوفَةً وَأَنَّهُ لَا إِسْلَالَ وَلَا إِغْلَالَ. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Al-Miswar and Marwan said they agreed to abandon war for ten years during which the people would have security, on the basis that there should be sincerity between them and that there should be no theft or treachery. \n\nAbu Dawud transmitted it."}},{"id":257,"idInBook":257,"chapterId":19,"bookId":14,"arabic":"وَعَنْ صَفْوَانَ بْنِ سُلَيْمٍ عَنْ عِدَّةٍ مِنْ أَبْنَاءِ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ آبَائِهِمْ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أَلَا مَنْ ظَلَمَ مُعَاهِدًا أَوِ انْتَقَصَهُ أَوْ كَلَّفَهُ فَوْقَ طَاقَتِهِ أَوْ أَخَذَ مِنْهُ شَيْئًا بِغَيْرِ طِيبِ نَفْسٍ فَأَنَا حَجِيجُهُ يَوْمَ الْقِيَامَةِ» . رَوَاهُ أَبُو دَاوُدَ","english":{"narrator":"","text":"Safwan b. Sulaim quoted the authority of a number of the sons of the Companions of God’s Messenger who told on the authority of their fathers that God’s Messenger said, “If anyone wrongs a man with whom a covenant has been made, or curtails any right of his, or imposes on him more than he can bear, or takes anything from him without his ready agreement, I shall be his adversary on the day of resurrection.” \n\nAbu Dawud transmitted it."}},{"id":258,"idInBook":258,"chapterId":19,"bookId":14,"arabic":"وَعَن أُميمةَ بنت رقيقَة قَالَتْ: بَايَعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي نِسْوَةٍ فَقَالَ لَنَا: «فِيمَا اسْتَطَعْتُنَّ وَأَطَقْتُنَّ» قُلْتُ: اللَّهُ وَرَسُولُهُ أَرْحَمُ بِنَا مِنَّا بِأَنْفُسِنَا قُلْتُ: يَا رَسُولَ اللَّهِ بَايِعْنَا تَعْنِي صَافِحْنَا قَالَ: «إِنَّمَا قَوْلِي لِمِائَةِ امْرَأَةٍ كَقَوْلِي لِامْرَأَةٍ وَاحِدَةٍ» . رَوَاهُ التِّرْمِذِيُّ وَالنَّسَائِيُّ وَابْنُ مَاجَهْ وَمَالِكٌ فِي الْمُوَطَّأ","english":{"narrator":"Umaima daughter of Ruqaiqa said:","text":"I swore allegiance to the Prophet along with some women and he said to us, \"As far as you are able and are capable.” I said, \"God and His Messenger are more merciful to us than we are to ourselves.” I asked God's Messenger to ratify our covenant, meaning to shake hands with us, but he replied, \"I say the same to a hundred women as I do to one.” \n\n…transmitted it. The name of the collection of traditions where this is found is omitted. Cf. Nasa’i, Bai'a, 18; Ibn Majah, Jihad, 43; Ahmad b. Hanbal, vi, p. 357; Malik, Muwatta', Bai'a, 1."}},{"id":259,"idInBook":259,"chapterId":19,"bookId":14,"arabic":"عَن الْبَرَاءِ بْنِ عَازِبٍ قَالَ: اعْتَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي ذِي الْقَعْدَةِ فَأَبَى أَهْلُ مَكَّةَ أَنْ يَدَعُوهُ يَدْخُلُ مَكَّةَ حَتَّى قَاضَاهُمْ عَلَى أَنْ يَدْخُلَ يَعْنِي مِنَ الْعَامِ الْمُقْبِلِ يُقِيمُ بِهَا ثَلَاثَةَ أَيَّامٍ فَلَمَّا كَتَبُوا الْكِتَابَ كَتَبُوا: هَذَا مَا قَاضَى عَلَيْهِ مُحَمَّدٌ رَسُولُ اللَّهِ. قَالُوا: لَا نُقِرُّ بِهَا فَلَوْ نَعْلَمُ أَنَّكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا منعناك وَلَكِنْ أَنْتَ مُحَمَّدُ بْنُ عَبْدِ اللَّهِ فَقَالَ: «أَنَا رَسُولُ اللَّهِ وَأَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ» . ثُمَّ قَالَ لِعَلِيِّ بْنِ أَبِي طَالِبٍ: \" امْحُ: رَسُولَ اللَّهِ \" قَالَ: لَا وَاللَّهِ لَا أَمْحُوكَ أَبَدًا فَأَخَذَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَيْسَ يُحْسِنُ يَكْتُبُ فَكَتَبَ: \" هَذَا مَا قَاضَى عَلَيْهِ مُحَمَّدُ بْنُ عَبْدِ اللَّهِ: لَا يُدْخِلُ مَكَّةَ بِالسِّلَاحِ إِلَّا السَّيْفَ فِي الْقِرَابِ وَأَنْ لَا يَخْرُجَ مِنْ أَهْلِهَا بِأَحَدٍ إِنْ أَرَادَ أَنْ يَتْبَعَهُ وَأَنْ لَا يَمْنَعَ مِنْ أَصْحَابِهِ أَحَدًا إِنْ أَرَادَ أَنْ يُقِيمَ بِهَا \" فَلَمَّا دَخَلَهَا وَمَضَى الْأَجَلُ أَتَوْا عَلِيًّا فَقَالُوا: قُلْ لِصَاحِبِكَ: اخْرُجْ عَنَّا فَقَدْ مَضَى الْأَجَلُ فَخَرَجَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ","english":{"narrator":"Al-Bara’ b. ‘Azib said:","text":"God’s Messenger went to perform an ‘umra in Dhul Qa'da, but the people of Mecca refused to let him enter Mecca till he had made an agreement with them to enter (i.e. in the following year) and stay three days. Then when on writing the document they wrote, \"This is what Muhammad God’s Messenger has agreed,” the Meccans said, “We do not acknowledge it, for if we knew you were God’s Messenger we would not prevent you; but you are Muhammad b. ‘Abdallah.” He replied, \"I am' both God's Messenger and Muhammad b. ‘Abdallah.” He then told ‘Ali b. Abu Talib to obliterate \"Messenger of God”, and when he protested, \"No, I swear by God, I will never obliterate it,” God's Messenger took it, and although he did not write well, he wrote, ‘‘this is what Muhammad b. ‘Abdallah has agreed. The only weapon with which he will enter Mecca will be a sword in the scabbard; if any of its people wishes to follow him he will not take him out; and if any of his companions wishes to stay in it he will not prevent him.” Then when he entered and the appointed period elapsed they went to 'Ali and told him to tell his friend to leave them for the appointed period had elapsed. So the Prophet went out. \n\n(Bukhari and Muslim.)"}},{"id":260,"idInBook":260,"chapterId":19,"bookId":14,"arabic":"عَن أبي هُرَيْرَة قَالَ: بَيْنَا نَحْنُ فِي الْمَسْجِدِ خَرَجَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «انْطَلِقُوا إِلَى يهود» فخرجنا مَعَه حَتَّى جِئْنَا بَيت الْمدَارِس فَقَامَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «يَا مَعْشَرَ يَهُودَ أَسْلِمُوا تَسْلَمُوا اعْلَمُوا أَنَّ الْأَرْضَ لِلَّهِ وَلِرَسُولِهِ وَأَنِّي أُرِيدُ أَنْ أُجْلِيَكُمْ مِنْ هَذِهِ الْأَرْضِ. فَمَنْ وَجَدَ مِنْكُمْ بِمَالِهِ شَيْئا فليبعه»","english":{"narrator":"Abu Huraira said:","text":"While we were in the mosque the Prophet came out and said, “Come on to the Jews.” So we went out with him and came to the house where they read their Scriptures, and the Prophet stood up and said, “If you Jews accept Islam you will be safe. Know that the land belongs to God and His Messenger, and I intend to deport you from this land; so if any of you has property  he must sell it.” \n\n(Bukhari and Muslim.)"}},{"id":261,"idInBook":261,"chapterId":19,"bookId":14,"arabic":"وَعَن ابْن عمر قَالَ: قَامَ عُمَرُ خَطِيبًا فَقَالَ: إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ عَامَلَ يَهُودَ خَيْبَرَ عَلَى أَمْوَالِهِمْ وَقَالَ: «نُقِرُّكُمْ مَا أَقَرَّكُمُ اللَّهُ» . وَقَدْ رَأَيْتُ إِجْلَاءَهُمْ فَلَمَّا أَجْمَعَ عُمَرُ عَلَى ذَلِكَ أَتَاهُ أَحَدُ بَنِي أَبِي الحُقَيقِ فَقَالَ: يَا أَمِيرَ الْمُؤْمِنِينَ أَتُخْرِجُنَا وَقَدْ أَقَرَّنَا مُحَمَّدٌ وَعَامَلَنَا عَلَى الْأَمْوَالِ؟ فَقَالَ عُمَرُ: أَظْنَنْتَ أَنِّي نَسِيتُ قَوْلُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «كَيْفَ بِكَ إِذَا أُخْرِجْتَ مِنْ خَيْبَرَ تَعْدُو بِكَ قَلُوصُكَ لَيْلَةً بَعْدَ لَيْلَةٍ؟» فَقَالَ: هَذِهِ كَانَتْ هُزَيْلَةً مِنْ أَبِي الْقَاسِمِ فَقَالَ كَذَبْتَ يَا عَدُوَّ اللَّهِ فَأَجْلَاهُمْ عُمَرُ وَأَعْطَاهُمْ قِيمَةَ مَا كَانَ لَهُمْ مِنَ الثَّمَرِ مَالًا وَإِبِلًا وَعُرُوضًا مِنْ أَقْتَابٍ وَحِبَالٍ وَغَيْرِ ذَلِكَ. رَوَاهُ الْبُخَارِيُّ","english":{"narrator":"","text":"Ibn 'Umar told that 'Umar stood up to make a speech and said, “God’s Messenger employed the Jews of Khaibar to work their property and told them he would confirm them in it as long as God did; and I have now seen good to deport them.” When ‘Umar decided on that one of the B. Abul Huqaiq came to him and said, “Commander of the Faithful, are you expelling us when Muhammad has confirmed us in our property and employed us to work it?” 'Umar replied, “Do you think I have forgotten what God’s Messenger said when he asked how you would feel when you were expelled from Khaibar, your camel running along with you night after night?” He said, “This was a little joke on the part of Abul Qasim,” to which ‘Umar retorted, “You lie, enemy of God.” He then deported them, giving them the value of the fruits they possessed in money, camels and goods such as saddles, ropes, etc. \n\nBukhari transmitted it."}},{"id":262,"idInBook":262,"chapterId":19,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى الله عَلَيْهِ وَسلم أَوْصَى بِثَلَاثَةٍ: قَالَ: «أَخْرِجُوا الْمُشْرِكِينَ مِنْ جَزِيرَةِ الْعَرَبِ وَأَجِيزُوا الْوَفْدَ بِنَحْوِ مَا كُنْتُ أُجِيزُهُمْ» . قَالَ ابْنُ عَبَّاسٍ: وَسَكَتَ عَن الثَّالِثَة أَو قَالَ: فأنسيتها","english":{"narrator":"","text":"Ibn ‘Abbas told that God’s Messenger gave three instructions saying, “Expel the polytheists from Arabia; reward deputations as I did.” Ibn 'Abbas said either that he did not mention the third, or that he* had been caused to forget it. \n\n*i.e. Ibn ‘Abbas.\n\n(Bukhari and Muslim.)"}},{"id":263,"idInBook":263,"chapterId":19,"bookId":14,"arabic":"وَعَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ: أَخْبَرَنِي عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لأخرِجنَّ اليهودَ والنصَارى من جزيرةِ الْعَرَب حَتَّى لَا أَدَعَ فِيهَا إِلَّا مُسْلِمًا» . رَوَاهُ مُسْلِمٌ وَفِي رِوَايَةٍ: «لَئِنْ عِشْتُ إِنْ شَاءَ اللَّهُ لَأُخْرِجَنَّ الْيَهُودَ وَالنَّصَارَى مِنْ جَزِيرَةِ الْعَرَبِ»","english":{"narrator":"","text":"Jabir b. ‘Abdallah said he was told by ‘Umar b. al-Khattab that he had heard God’s Messenger say, “I will certainly expel the Jews and the Christians from Arabia so as to leave only Muslims in it.” \n\nMuslim transmitted it. A version has, “If I live, God willing, I will certainly expel the Jews and the Christians from Arabia.”"}},{"id":264,"idInBook":264,"chapterId":19,"bookId":14,"arabic":"عَنِ ابْنِ عُمَرَ: أَنَّ عُمَرَ بْنَ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُمَا أَجْلَى الْيَهُودَ وَالنَّصَارَى مِنْ أَرْضِ الْحِجَازِ وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا ظَهَرَ عَلَى أَهْلِ خَيْبَرَ أَرَادَ أَنْ يُخْرِجَ الْيَهُودَ مِنْهَا وَكَانَتِ الْأَرْضُ لَمَّا ظُهِرَ عَلَيْهَا لِلَّهِ وَلِرَسُولِهِ وَلِلْمُسْلِمِينَ فَسَأَلَ الْيَهُودُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَتْرُكَهُمْ عَلَى أَنْ يَكْفُوا الْعَمَلَ وَلَهُمْ نِصْفُ الثَّمَرِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «نُقِرُّكُمْ على ذَلِك مَا شِئْنَا» فَأُقِرُّوا حَتَّى أَجْلَاهُمْ عُمَرُ فِي إِمارته إِلى تَيماءَ وأريحاء","english":{"narrator":"","text":"Ibn ‘Umar told that ‘Umar b. al-Khattab deported the Jews and the Christians from the land of the Hijaz and when God’s Messenger got supremacy over the people of Khaibar he intended to expel the Jews from it, for when the land was conquered it belonged to God, His Messenger and the Muslims. But the Jews asked God’s Messenger to leave them on condition that they should do all the cultivation and have half the produce, and he replied, “We shall confirm you on that condition as long as we wish.” So they were confirmed till ‘Umar deported them during his period of rule to Taima and Jericho. \n\n(Bukhari and Muslim.)"}},{"id":265,"idInBook":265,"chapterId":19,"bookId":14,"arabic":"عَن مالكِ بن أوْسِ بنِ الحَدَثانِ قَالَ: قَالَ عُمَرُ بْنُ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ: إِنَّ اللَّهَ قَدْ خَصَّ رَسُولَهُ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي هَذَا الْفَيْءِ بِشَيْءٍ لَمْ عطه أحدا غيرَه ثُمَّ قَرَأَ (مَا أَفَاءَ اللَّهُ عَلَى رَسُولِهِ مِنْهُم)\nإِلى قولِه (قديرٌ)\nفكانتْ هَذِه خَالِصَة لرَسُول اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُنْفِقُ عَلَى أَهْلِهِ نَفَقَةَ سَنَتِهِمْ مِنْ هَذَا الْمَالِ. ثُمَّ يَأْخُذُ مَا بَقِيَ فَيَجْعَلُهُ مَجْعَلَ مَالِ اللَّهِ","english":{"narrator":"","text":"Malik b. Aus b. al-Hadathan reported \"Umar b. al-Khattab as saying that God appointed His Messenger a special portion in this fai’* which He gave to no other. He then recited, “What God has bestowed on His Messenger from them . . . omnipotent\" (Al-Qur’an; 59:6). This was purely for God’s Messenger who used to give his family their annual contribution from this property, then take what remained and deal with it as he did with God’s property.\n\n *Fai’ is the term used for tribute from territory the Muslims have conquered.\n\n(Bukhari and Muslim.)"}},{"id":266,"idInBook":266,"chapterId":19,"bookId":14,"arabic":"وَعَن عمر قَالَ: كَانَتْ أَمْوَالُ بَنِي النَّضِيرِ مِمَّا أَفَاءَ اللَّهُ عَلَى رَسُولِهِ مِمَّا لَمْ يُوجِفِ الْمُسْلِمُونَ عَلَيْهِ بِخَيْلٍ وَلَا رِكَابٍ فَكَانَتْ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَالِصَة يُنْفِقُ عَلَى أَهْلِهِ نَفَقَةَ سَنَتِهِمْ ثُمَّ يَجْعَلُ مَا بَقِيَ فِي السِّلَاحِ وَالْكُرَاعِ عُدَّةً فِي سَبِيل الله","english":{"narrator":"","text":"‘Umar said that the properties of the B. an-Nadir were part of what God bestowed on His Messenger from what the Muslims had not ridden on horses or camels to get; so they belonged specially to God’s Messenger who gave his family their annual contribution, then applied what remained for weapons and horses as equipment in God’s path. \n\n(Bukhari and Muslim.)"}},{"id":267,"idInBook":267,"chapterId":19,"bookId":14,"arabic":"عَن عوفِ بْنِ مَالِكٍ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا أَتَاهُ الْفَيْءُ قَسَمَهُ فِي يَوْمِهِ فَأَعْطَى الْآهِلَ حَظَّيْنِ وَأَعْطَى الْأَعْزَبَ حَظًّا فَدُعِيتُ فَأَعْطَانِي حَظَّيْنِ وَكَانَ لِي أَهْلٌ ثُمَّ دُعِيَ بَعْدِي عَمَّارُ بْنُ يَاسِرٍ فَأُعْطِيَ حَظًّا وَاحِدًا. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"‘Auf b. Malik said:","text":"When the fai’ came to God's Messenger he divided it that day, giving two portions to a married man and one to a bachelor. I was summoned and he gave me two portions, for I had a family; then ‘Ammar b. Yasir was summoned after me and given one. \n\nAbu Dawud transmitted it."}},{"id":268,"idInBook":268,"chapterId":19,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوَّلُ مَا جَاءَهُ شيءٌ بدَأَ بالمحرَّرينَ. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Ibn ‘Umar told that he saw the first thing God’s Messenger did immediately anything came to him was to give something to those who had been set free. \n\nAbu Dawud transmitted it."}},{"id":269,"idInBook":269,"chapterId":19,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَى بطبية فِيهَا خَرَزٌ فَقَسَمَهَا لِلْحُرَّةِ وَالْأَمَةِ قَالَتْ عَائِشَةُ: كَانَ أَبِي يَقْسِمُ لِلْحُرِّ وَالْعَبْدِ. رَوَاهُ أَبُو دَاوُدَ","english":{"narrator":"","text":"‘A’isha said the Prophet was brought a pouch containing beads and divided it among freewomen and slave women. She said her father used to divide things between freemen and slaves. \n\nAbu Dawud transmitted it."}},{"id":270,"idInBook":270,"chapterId":19,"bookId":14,"arabic":"وَعَن مالكِ بن أوسِ بن الحدَثانِ قَالَ: ذكر عمر بن الْخطاب يَوْمًا الْفَيْءَ فَقَالَ: مَا أَنَا أَحَقُّ بِهَذَا الْفَيْءِ مِنْكُمْ وَمَا أَحَدٌ مِنَّا بِأَحَقَّ بِهِ مِنْ أَحَدٍ إِلَّا أَنَّا عَلَى مَنَازِلِنَا مِنْ كِتَابِ اللَّهِ عَزَّ وَجَلَّ وَقَسْمِ رَسُولِهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَالرَّجُلُ وَقِدَمُهُ وَالرَّجُلُ وَبَلَاؤُهُ وَالرَّجُلُ وَعِيَالُهُ وَالرَّجُلُ وَحَاجَتُهُ. رَوَاهُ أَبُو دَاوُدَ","english":{"narrator":"Malik b. Aus b. al-Hadathan told that one day ‘Umar b. al-Khattab mentioned the fai’ saying:","text":"I have no more right to this fai’ than you, and none of us has more right to it than another, except that we occupy our positions fixed by the Book of God who is great and glorious and the division made by His Messenger, people being arranged according to their precedence in accepting Islam, the hardships they have endured, their having children, and their need. \n\nAbu Dawud transmitted it."}},{"id":271,"idInBook":271,"chapterId":19,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَرَأَ عُمَرُ بْنُ الْخَطَّابِ رَضِيَ اللَّهُ عَنهُ: (إِنَّما الصَّدَقاتُ للفقراءِ والمساكينِ)\nحَتَّى بَلَغَ (عَلِيمٌ حَكِيمٌ)\nفَقَالَ: هَذِهِ لِهَؤُلَاءِ. ثُمَّ قَرَأَ (وَاعْلَمُوا أَنَّ مَا غَنِمْتُمْ مِنْ شيءٍ فإنَّ للَّهِ خُمُسَه وللرَّسولِ)\nحَتَّى بلغَ (وابنِ السَّبِيلِ)\nثُمَّ قَالَ: هَذِهِ لِهَؤُلَاءِ. ثُمَّ قَرَأَ (مَا أَفَاءَ اللَّهُ عَلَى رَسُولِهِ مِنْ أَهْلِ الْقرى)\nحَتَّى بلغَ (للفقراءِ)\nثمَّ قرأَ (والذينَ جاؤوا منْ بعدِهِم)\nثُمَّ قَالَ: هَذِهِ اسْتَوْعَبَتِ الْمُسْلِمِينَ عَامَّةً فَلَئِنْ عِشْتُ فَلَيَأْتِيَنَّ الرَّاعِيَ وَهُوَ بِسَرْوِ حِمْيَرَ نَصِيبُهُ مِنْهَا لَمْ يَعْرَقْ فِيهَا جَبِينُهُ. رَوَاهُ فِي شرح السّنة","english":{"narrator":"","text":"He told that ‘Umar b. al-Khattab recited, “Alms are for the poor and needy…Knowing, Wise,\" (Al-Qur’an; 9:60) and said that this verse applies to such. He then recited, “Know that a fifth of whatever booty you acquire goes to God and the Messenger . . . the traveller,\" (Al-Qur’an; 8:41) and said that this verse applies to such. He then recited, “What God has bestowed on His Messenger from the people of the towns ... to the poor\" (Al-Qur’an; 59:7 f. The last word mentioned is the first word of verse 8. It may mean that he recited the whole of verse 8). He then recited, “And those who came after them,\" (Al-Qur’an; 59:10) saying that this includes all the Muslims, and adding that if he lived the herdsman in the sarw* of Himyar would certainly get his share which he had not earned by the sweat of his brow.\t\n\n* The word means a hill slope above a valley, not right upon the mountain. When associated with Himyar it is said to mean their settlement, cf. Yaqut, Mu'jam, iii, 82. The Himyarites were a famous South Arabian people.\n\nIt is transmitted in Sharh as-sunna."}},{"id":272,"idInBook":272,"chapterId":19,"bookId":14,"arabic":"وَعنهُ قَالَ: كانَ فِيمَا احتجَّ فيهِ عُمَرُ أَنْ قَالَ: كَانَتْ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَلَاثُ صَفَايَا بَنُو النَّضِيرِ وخيبرُ وفَدَكُ فَأَمَّا بَنُو النَّضِيرِ فَكَانَتْ حَبْسًا لِنَوَائِبِهِ وَأَمَّا فَدَكُ فَكَانَتْ حَبْسًا لِأَبْنَاءِ السَّبِيلِ وَأَمَّا خَيْبَرُ فَجَزَّأَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَلَاثَةٌ أَجزَاء: جزأين بينَ المسلمينَ وجزءً نَفَقَةً لِأَهْلِهِ فَمَا فَضُلَ عَنْ نَفَقَةِ أَهْلِهِ جَعَلَهُ بَيْنَ فُقَرَاءِ الْمُهَاجِرِينَ. رَوَاهُ أَبُو دَاوُدَ","english":{"narrator":"He told that one of the arguments put forward by 'Umar was that he said God’s Messenger received three things exclusively to himself:","text":"the B. an-Nadir, Khaibar and Fadak.1 The B. an-Nadir property was kept wholly for his own purposes,2 Fadak for travellers, and Khaibar was divided by God’s Messenger into three sections, two for the Muslims and one as a contribution for his family. If anything remained after making the contribution to his family, he divided it among the poor Emigrants. \n\n    1. Fadak was near Khaibar. It capitulated without fighting.\n    2. This would include, besides personal needs, the cost of entertaining guests, providing weapons and animals, etc.\n\nAbu Dawud transmitted it."}},{"id":273,"idInBook":273,"chapterId":19,"bookId":14,"arabic":"عَن المغيرةِ قَالَ: إِنَّ عمَرَ بنَ عبد العزيزِ جَمَعَ بَنِي مَرْوَانَ حِينَ اسْتُخْلِفَ فَقَالَ: إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَتْ لَهُ فَدَكُ فَكَانَ يُنْفِقُ مِنْهَا وَيَعُودُ مِنْهَا عَلَى صَغِيرِ بَنِي هَاشِمٍ وَيُزَوِّجُ مِنْهَا أَيِّمَهُمْ وَإِنَّ فَاطِمَةَ سَأَلَتْهُ أَنْ يَجْعَلَهَا لَهَا فَأَبَى فَكَانَتْ كَذَلِكَ فِي حَيَاةَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَيَاتِهِ حَتَّى مَضَى لسبيلِه فَلَمَّا وُلّيَ أَبُو بكرٍ علم فِيهَا بِمَا عَمِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَيَاتِهِ حَتَّى مَضَى لِسَبِيلِهِ فَلَمَّا أَنْ وُلِّيَ عُمَرُ بْنُ الْخَطَّابِ عَمِلَ فِيهَا بِمِثْلِ مَا عَمِلَا حَتَّى مَضَى لِسَبِيلِهِ ثُمَّ اقْتَطَعَهَا مَرْوَانُ ثُمَّ صَارَتْ لِعُمَرَ بْنِ عَبْدِ الْعَزِيزِ فَرَأَيْتُ أَمْرًا مَنَعَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاطِمَةَ لَيْسَ لِي بِحَقٍّ وَإِنِّي أُشْهِدُكُمْ أَنِّي رَدَدْتُهَا عَلَى مَا كَانَتْ. يَعْنِي عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبِي بَكْرٍ وعمَرَ. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"Al-Mughira b. Shu’ba told that when ‘Umar b. ‘Abd al-‘Aziz was made Caliph he gathered the family, of Marwan and said:","text":"Fadak belonged, to God’s Messenger, and he made contributions from it, showing repeated kindness to the poor members of the B. Hashim from it and supplying: from it the cost of marriages for those of them who were unmarried. Fatima asked him to give it to her, but he refused. That is how matters stood during the lifetime of God’s Messenger till he went his way (i.e. he died). When Abu Bakr was made ruler he administered it as God's Messenger had done in his lifetime till he went his way. Then when ‘Umar b. al- Khattab was made ruler he administered it as they had done till he went his way. Then Marwan took it for himself and it afterwards came to ‘Umar b. ‘Abd al-‘Aziz, but I consider that I have no right to something which God’s Messenger refused to Fatima, and I call you to witness that I have restored it to its former condition; meaning in the time of God’s Messenger, Abu Bakr and ‘Umar. \n\nAbu Dawud transmitted it."}}],"chapter":{"id":19,"bookId":14,"arabic":"كتاب الجهاد","english":"Jihad"}}