{"metadata":{"length":93,"arabic":{"title":"مشكاة المصابيح","author":"الإمام الكاتب التبريزي","introduction":"كتاب الصيد والذبائح"},"english":{"title":"Mishkat al-Masabih","author":"Al-Khatib Al-Tabrizi","introduction":"Game and Animals Which May Be Slaughtered"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":20,"bookId":14,"arabic":"عَن عدِيِّ بنِ حاتِمٍ قَالَ: قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا أَرْسَلْتَ كَلْبَكَ فَاذْكُرِ اسْمَ اللَّهِ فَإِنْ أَمْسَكَ عَلَيْكَ فَأَدْرَكْتَهُ حَيًّا فَاذْبَحْهُ وَإِنْ أَدْرَكْتَهُ قَدْ قَتَلَ وَلَمْ يَأْكُلْ مِنْهُ فَكُلْهُ وَإِنْ أَكَلَ فَلَا تَأْكُلْ فَإِنَّمَا أَمْسَكَ عَلَى نَفْسِهِ فَإِنْ وَجَدْتَ مَعَ كَلْبِكَ كَلْبًا غَيْرَهُ وَقَدْ قَتَلَ فَلَا تَأْكُلْ فَإِنَّكَ لَا تَدْرِي أَيُّهُمَا قَتَلَ. وَإِذَا رَمَيْتَ بِسَهْمِكَ فَاذْكُرِ اسْمَ اللَّهِ فَإِنْ غَابَ عَنْكَ يَوْمًا فَلَمْ تَجِدْ فِيهِ إِلَّا أَثَرَ سَهْمِكَ فَكُلْ إِنْ شِئْتَ وَإِنْ وَجَدْتَهُ غَرِيقًا فِي الْمَاءِ فَلَا تأكُلْ»","english":{"narrator":"","text":"‘Adi b. Hatim told that God’s messenger said to him, “When you set off your dog mention God's name, and if it catches anything for you and you come up to it while it is still alive cut its throat; if you come up to it when the dog has killed it but not eaten any of it eat it; but if it has eaten any of it do not eat, for it has caught it only for itself. If you find another dog with yours and a kill has been made, do not eat, for you do not know which of them killed the animal. When you shoot your arrow mention God’s name and if the game goes out of your sight for a day and you find in it only the mark of your arrow eat if you wish, but if you find it drowned in water do not eat.” \n\n(Bukhari and Muslim.)"}},{"id":2,"idInBook":2,"chapterId":20,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قُلْتُ: يَا رَسُولَ اللَّهِ إِنَّا نُرْسِلُ الْكِلَابَ الْمُعَلَّمَةَ قَالَ: «كُلْ مَا أَمْسَكْنَ عَلَيْكَ» قُلْتُ: وَإِنْ قَتَلْنَ؟ قَالَ: «وَإِنْ قَتَلْنَ» قُلْتُ: إِنَّا نَرْمِي بِالْمِعْرَاضِ. قَالَ: «كُلُّ مَا خزق وَمَا أصَاب بعرضه فَقتله فَإِنَّهُ وقيذ فَلَا تَأْكُل»","english":{"narrator":"","text":"He said he told God’s messenger that he set off trained dogs, and he replied, “Eat what they catch for you.” He asked if that applied even if they killed the game, and he replied that it did. He told him that he shot featherless arrows (mi'rad)* and he replied, “Eat what they pierce, but what they strike with the middle part and kill is beaten to death, so do not eat it.” \n*The mi'rad was thick in the middle and slender at the ends. It was liable to strike the animal with its middle part.\n\n(Bukhari and Muslim.)"}},{"id":3,"idInBook":3,"chapterId":20,"bookId":14,"arabic":"وَعَن أبي ثَعْلَبَة الْخُشَنِي قَالَ: قُلْتُ: يَا نَبِيَّ اللَّهِ إِنَّا بِأَرْضِ قوم أهل كتاب أَفَنَأْكَلُ فِي آنِيَتِهِمْ وَبِأَرْضِ صَيْدٍ أَصِيدُ بِقَوْسِي وَبِكَلْبِي الَّذِي لَيْسَ بِمُعَلَّمٍ وَبِكَلْبِي الْمُعَلَّمِ فَمَا يصلح؟ قَالَ: «أما ذَكَرْتَ مِنْ آنِيَةِ أَهْلِ الْكِتَابِ فَإِنْ وَجَدْتُمْ غَيْرَهَا فَلَا تَأْكُلُوا فِيهَا وَإِنْ لَمْ تَجِدُوا فاغسلوها وَكُلُوا فِيهَا وَمَا صِدْتَ بِقَوْسِكَ فَذَكَرْتَ اسْمَ اللَّهِ فَكُلْ وَمَا صِدْتَ بِكَلْبِكَ الْمُعَلَّمِ فَذَكَرْتَ اسْمَ اللَّهِ فَكُلْ وَمَا صِدْتَ بِكَلْبِكَ غَيْرِ معلم فأدركت ذَكَاته فَكل»","english":{"narrator":"","text":"Abu Tha'laba al-Khushani told that he said, “Prophet of God, we are in a land belonging to folk who are people of the Book, so may we eat out of their vessels? In a hunting region I hunt with my bow, my dog which is not trained and my dog which is trained, so what is right for me?” He replied, “Regarding what you have mentioned about the vessels of the people of the Book, if you can get anything else do not eat out of them, but if you cannot, wash them and eat out of them. Eat what you catch with your bow when you have mentioned God’s name; eat what you catch by your trained dog when you have mentioned God’s name; and eat what you catch by your untrained dog when you are present at the kill.” \n\n(Bukhari and Muslim.)"}},{"id":4,"idInBook":4,"chapterId":20,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا رَمَيْتَ بِسَهْمِكَ فَغَابَ عَنْكَ فَأَدْرَكْتَهُ فَكُلْ مَا لَمْ يُنْتِنْ» . رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"He reported God’s messenger as saying, “When you shoot your arrow and the animal goes out of your sight, eat it when you come upon it, provided it has not a stench.” \n\n(Bukhari and Muslim.)"}},{"id":5,"idInBook":5,"chapterId":20,"bookId":14,"arabic":"وَعَنْهُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي الَّذِي يُدْرِكُ صَيْدَهُ بَعْدَ ثَلَاثٍ: «فكله مَا لم ينتن» . رَوَاهُ مُسلم","english":{"narrator":"","text":"He reported the Prophet as saying about one who comes three days later on the game he has shot, “Eat it, provided it has not a stench.”\n\nMuslim transmitted it."}},{"id":6,"idInBook":6,"chapterId":20,"bookId":14,"arabic":"وَعَن عَائِشَة قَالَت: قَالُوا: يَا رَسُولَ اللَّهِ إِنَّ هُنَا أَقْوَامًا حَدِيثٌ عَهْدُهُمْ بِشِرْكٍ يَأْتُونَنَا بِلُحْمَانٍ لَا نَدْرِي أَيَذْكُرُونَ اسْمَ اللَّهِ عَلَيْهَا أَمْ لَا؟ قَالَ: «اذْكُرُوا أَنْتُم اسمَ اللَّهِ وكلوا» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"‘A'isha told that some people said, “Messenger of God, there are people here, recent converts from polytheism, who bring us meat and we do not know whether or not they mention God’s name over it.” He replied, “Mention God’s name yourselves and eat.” \n\nBukhari transmitted it."}},{"id":7,"idInBook":7,"chapterId":20,"bookId":14,"arabic":"وَعَن أبي الطُّفَيْل قَالَ: سُئِلَ عَليّ: هَلْ خَصَّكُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِشَيْءٍ؟ فَقَالَ: مَا خَصَّنَا بِشَيْءٍ لَمْ يَعُمَّ بِهِ النَّاسَ إِلَّا مَا فِي قِرَابِ سَيْفِي هَذَا فَأَخْرَجَ صَحِيفَةً فِيهَا: «لَعَنَ اللَّهُ مَنْ ذَبَحَ لِغَيْرِ اللَّهِ وَلَعَنَ اللَّهُ مَنْ سَرَقَ مَنَارَ الْأَرْضِ وَفِي رِوَايَةٍ مَنْ غَيَّرَ مَنَارَ الْأَرْضِ وَلَعَنَ اللَّهُ مَنْ لَعَنَ وَالِدَهُ وَلَعَنَ اللَّهُ مَنْ آوَى مُحْدِثًا» . رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"Abut Tufail said ‘Ali was asked whether God’s messenger had given them* any instruction for themselves alone and replied that he had given them none which did not apply to all the people except what was in the scabbard of his sword. He then drew out a document containing, “God curse him who kills an animal mentioning anyone other than God, and God curse him who steals a landmark!” A version has, “who changes a landmark; God curse him who curses his father; and God curse him who protects an innovator!” \n*i.e. the members of the Prophet's family.\n\nMuslim transmitted it."}},{"id":8,"idInBook":8,"chapterId":20,"bookId":14,"arabic":"وَعَن رَافع بن خديج قَالَ: قُلْتُ: يَا رَسُولَ اللَّهِ إِنَّا لَاقُوا الْعَدُوَّ غَدًا وَلَيْسَتْ مَعَنَا مُدًى أَفَنَذْبَحُ بِالْقَصَبِ؟ قَالَ: \n\" مَا أَنْهَرَ الدَّمَ وَذُكِرَ اسْمُ اللَّهِ فَكُلْ لَيْسَ السِّنَّ وَالظُّفُرَ وَسَأُحَدِّثُكَ عَنْهُ: أَمَّا السِّنُّ فَعَظْمٌ وَأَمَّا الظُّفُرُ فَمُدَى الْحَبَشِ \" وَأَصَبْنَا نَهْبَ إِبِلٍ وَغَنَمٍ فَنَدَّ مِنْهَا بِعِيرٌ فَرَمَاهُ رَجُلٌ بِسَهْمٍ فَحَبَسَهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ لِهَذِهِ الْإِبِلِ أَوَابِدَ كَأَوَابِدِ الْوَحْشِ فَإِذَا غَلَبَكُمْ مِنْهَا شَيْءٌ فَافْعَلُوا بِهِ هَكَذَا»","english":{"narrator":"","text":"Rafi‘ b. Khadij told that he said, “Messenger of God, we shall meet the enemy tomorrow and we have no knives; may we kill animals with canes?”* He replied, “When God’s name is mentioned you may eat what is killed by anything which causes the blood to flow, except tooth and claw. I shall tell you about it. The tooth is a bone and the claw is the knife of the Abyssinians.” We got some camels and sheep as booty, and when one of the camels ran away a man shot an arrow at it and prevented it from escaping, whereupon God’s messenger said, “Among camels there are some which bolt like wild animals, so when any of them get the better of you do thus to them.” \n\n(Bukhari and Muslim.)"}},{"id":9,"idInBook":9,"chapterId":20,"bookId":14,"arabic":"وَعَن كعبِ بنِ مَالك أَنه كانَ لَهُ غَنَمٌ تُرْعَى بِسَلْعٍ فَأَبْصَرَتْ جَارِيَةٌ لَنَا بِشَاةٍ مِنْ غَنَمِنَا مَوْتًا فَكَسَرَتْ حَجَرًا فَذَبَحَتْهَا بِهِ فَسَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأمره بأكلها. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Ka‘b b. Malik told that he had sheep which were pastured at Sal‘,  and when a slavegirl of his saw one of their sheep which was dying she broke a stone and cut its throat with it. He questioned the Prophet and he ordered him to eat it. \n\nBukhari transmitted it."}},{"id":10,"idInBook":10,"chapterId":20,"bookId":14,"arabic":"وَعَنْ شَدَّادِ بْنِ أَوْسٍ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى كَتَبَ الْإِحْسَانَ عَلَى كُلِّ شَيْءٍ فَإِذَا قَتَلْتُمْ فَأَحْسِنُوا الْقِتْلَةَ وَإِذَا ذَبَحْتُمْ فَأَحْسِنُوا الذَّبْحَ وَلْيُحِدَّ أَحَدُكُمْ شَفْرَتَهُ وَلْيُرِحْ ذَبِيحَتَهُ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Shaddad b. Aus reported God’s messenger as saying, “God who is blessed and exalted has decreed that everything should be done in a good way, so when you kill use a good method, and when you cut an animal’s throat you should use a good method, for each of you should sharpen his knife and give the animal as little pain as possible.” \n\nMuslim transmitted it."}},{"id":11,"idInBook":11,"chapterId":20,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْهَى أَنْ تُصْبَرَ بهيمةٌ أَو غيرُها للْقَتْل","english":{"narrator":"","text":"Ibn ‘Umar told that he heard God’s messenger prohibit keeping an animal or anything else* waiting to be killed. \n*The word translated animal is bahima, which indicates a quadruped. “Anything else” means other creatures which are killed for food. The prohibition is said to refer either to keeping such animals without food and drink, or to imprisoning them and using them as targets.\n\n(Bukhari and Muslim.)"}},{"id":12,"idInBook":12,"chapterId":20,"bookId":14,"arabic":"وَعَنْهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَعَنَ مَنِ اتَّخَذَ شَيْئًا فِيهِ الرُّوحُ غَرَضًا","english":{"narrator":"","text":"He told that the Prophet cursed those who used a living creature as a target. \n\n(Bukhari and Muslim.)"}},{"id":13,"idInBook":13,"chapterId":20,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا تَتَّخِذُوا شَيْئًا فِيهِ الرُّوحُ غَرَضًا» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Ibn ‘Abbas reported the Prophet as saying, \"Do not take any living creature as a target.\" \n\nMuslim transmitted it."}},{"id":14,"idInBook":14,"chapterId":20,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ الضَّرْبِ فِي الْوَجْهِ وَعَنِ الْوَسْمِ فِي الْوَجْه. رَوَاهُ مُسلم","english":{"narrator":"","text":"Jabir told that God’s messenger forbade striking the face and branding on the face. \n\nMuslim transmitted it."}},{"id":15,"idInBook":15,"chapterId":20,"bookId":14,"arabic":"وَعَنْهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ عَلَيْهِ حِمَارٌ وَقَدْ وُسِمَ فِي وَجْهِهِ قَالَ: «لَعَنَ اللَّهُ الَّذِي وَسَمَهُ» . رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"He reported the Prophet as saying when an ass which had been branded on its face passed him, “God curse the one who branded it!”\n\nMuslim transmitted it."}},{"id":16,"idInBook":16,"chapterId":20,"bookId":14,"arabic":"وَعَن أنس قَالَ: غَدَوْتُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِعَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ لِيُحَنِّكَهُ فَوَافَيْتُهُ فِي يَدِهِ الْمِيسَمُ يَسِمُ إِبِلَ الصَّدَقَة","english":{"narrator":"","text":"Anas told that one morning he took ‘Abdallah b. Abu Talha to God’s messenger for him to chew something and rub his palate with it,* and found him with a branding-iron in his hand branding the camels of the sadaqa. \n*This was a custom for the purpose of acquiring a blessing for children.\n\n(Bukhari and Muslim.)"}},{"id":17,"idInBook":17,"chapterId":20,"bookId":14,"arabic":"وَعَنْ هِشَامِ بْنِ زَيْدٍ عَنْ أَنَسٍ قَالَ: دَخَلْتُ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ فِي مِرْبَدٍ فَرَأَيْتُهُ يَسِمُ شَاءَ حسبته قَالَ: فِي آذانها","english":{"narrator":"","text":"Hisham b. Zaid quoted Anas as saying that he went to visit the Prophet when he was in an enclosure and saw him branding sheep. He thought he said it was on their ears. \n\n(Bukhari and Muslim.)"}},{"id":18,"idInBook":18,"chapterId":20,"bookId":14,"arabic":"عَنْ عَدِيِّ بْنِ حَاتِمٍ قَالَ: قُلْتُ يَا رَسُولَ اللَّهِ أَرَأَيْتَ أَحَدُنَا أَصَابَ صَيْدًا وَلَيْسَ مَعَهُ سِكِّينٌ أَيَذْبَحُ بِالْمَرْوَةِ وَشِقَّةِ الْعَصَا؟ فَقَالَ: «أَمْرِرِ الدَّمَ بِمَ شِئْتَ وَاذْكُرِ اسْمَ اللَّهِ» . رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ","english":{"narrator":"","text":"‘Adi b. Hatim told that he said, “Tell me, messenger of God; when one of us catches game and has no knife, may he cut its throat with a flint and a splinter of stick?” He replied, “Cause the blood to flow with whatever you take and mention God’s name.” \n\nAbu Dawud and Nasa’i transmitted it."}},{"id":19,"idInBook":19,"chapterId":20,"bookId":14,"arabic":"وَعَن أبي العُشَراءِ عَنْ أَبِيهِ أَنَّهُ قَالَ: يَا رَسُولَ اللَّهِ أَمَا تَكُونُ الذَّكَاةُ إِلَّا فِي الْحَلْقِ وَاللَّبَّةِ؟ فَقَالَ: «لَوْ طَعَنْتَ فِي فَخِذِهَا لَأَجْزَأَ عَنْكَ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالنَّسَائِيُّ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ وَقَالَ أَبُو دَاوُدَ: وَهَذِهِ ذَكَاةُ الْمُتَرَدِّي وَقَالَ التِّرْمِذِيُّ: هَذَا فِي الضَّرُورَة","english":{"narrator":"","text":"Abul ‘Ushara’* quoted his father as telling that he said, “Is the slaughtering to be done, messenger of God, only in the throat and the upper part of the breast?” He replied, “If you pierced its thigh that would serve you.” \n*He was Usama b. Malik b. Qahtam (or Qahtam). See Ibn *Abd al-Barr. Isti'ab, p. 246, No. 10S9.\n\nTirmidhi, Abu Dawud, Nasa’i, Ibn Majah and Darimi transmitted it. Abu Dawud said this is the way to slaughter an animal which has fallen into a well, and Tirmidhi said it is in case of necessity."}},{"id":20,"idInBook":20,"chapterId":20,"bookId":14,"arabic":"وَعَن عدي بن حَاتِم أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَا عَلَّمْتَ مِنْ كَلْبٍ أَوْ بَازٍ ثُمَّ أَرْسَلْتَهُ وَذَكَرْتَ اسْمَ اللَّهِ فَكُلْ مِمَّا أَمْسَكَ عَلَيْكَ» . قُلْتُ: وَإِنْ قَتَلَ؟ قَالَ: «إِذَا قَتَلَهُ وَلَمْ يَأْكُلْ مِنْهُ شَيْئًا فَإِنَّمَا أَمْسَكَهُ عَلَيْكَ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"‘Adi b. Hatim reported the Prophet as saying, “Eat whatever is caught for you by a dog or a hawk which you have trained and set off when you have mentioned God’s name.” He asked whether that applied if it killed the animal and he replied, “When it kills it without eating any of it, for it caught it only for you.” \n\nAbu Dawud transmitted it."}},{"id":21,"idInBook":21,"chapterId":20,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قُلْتُ: يَا رَسُولَ اللَّهِ أَرْمِي الصَّيْدَ فَأَجِدُ فِيهِ مِنَ الْغَدِ سَهْمِي قَالَ: «إِذَا عَلِمْتَ أَنَّ سَهْمَكَ قَتَلَهُ وَلَمْ تَرَ فِيهِ أَثَرَ سَبُعٍ فَكُلْ» . رَوَاهُ أَبُو دَاوُدَ","english":{"narrator":"","text":"He told that he said, “Messenger of God, I shoot at game and find my arrow in it the next day.” He replied, “When you know your arrow killed it and see no mark of a beast of prey on the animal you may eat it.” \n\nAbu Dawud transmitted it."}},{"id":22,"idInBook":22,"chapterId":20,"bookId":14,"arabic":"وَعَن جابرٍ قَالَ: نُهِينَا عَنْ صَيْدِ كَلْبِ الْمَجُوسِ. رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Jabir said they were forbidden game caught by a dog belonging to Magians. \n\nTirmidhi transmitted it."}},{"id":23,"idInBook":23,"chapterId":20,"bookId":14,"arabic":"وَعَن أبي ثَعْلَبَة الْخُشَنِي قَالَ: قُلْتُ: يَا رَسُولَ اللَّهِ إِنَّا أَهْلُ سفر تمر الْيَهُود وَالنَّصَارَى وَالْمَجُوسِ فَلَا نَجِدُ غَيْرَ آنِيَتِهِمْ قَالَ: «فَإِنْ لَمْ تَجِدُوا غَيْرَهَا فَاغْسِلُوهَا بِالْمَاءِ ثُمَّ كلوا فِيهَا وَاشْرَبُوا» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Abu Tha'laba al-Khushani told that he said, “Messenger of God, we travel about and when we come to Jews, Christians and Magians we can get nothing but their vessels.” He replied, “If you can get nothing else, wash them with water and then eat and drink out of them.” \n\nTirmidhi transmitted it."}},{"id":24,"idInBook":24,"chapterId":20,"bookId":14,"arabic":"وَعَنْ قَبِيصَةَ بْنِ هُلْبٍ عَنْ أَبِيهِ قَالَ: سَأَلْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ طَعَامِ النَّصَارَى وَفِي رِوَايَةٍ: سَأَلَهُ رَجُلٌ فَقَالَ: إِنَّ مِنَ الطَّعَامِ طَعَامًا أَتَحَرَّجُ مِنْهُ فَقَالَ: «لَا يَتَخَلَّجَنَّ فِي صَدْرِكَ شَيْءٌ ضَارَعْتَ فِيهِ النَّصْرَانِيَّة» . رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد","english":{"narrator":"","text":"Qabisa b. Hulb quoted his father as saying that he asked the Prophet about the food of the Christians, (a version saying it was a man who asked him), adding that it was a kind of food from which he kept aloof. He replied, “Let no doubt enter your breast by which you resemble Christianity.”* \n*The general sense is that such food is allowable.\n\nTirmidhi and Abu Dawud transmitted it."}},{"id":25,"idInBook":25,"chapterId":20,"bookId":14,"arabic":"وَعَنْ أَبِي الدَّرْدَاءِ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أَكْلِ الْمُجَثَّمَةِ وهيَ الَّتِي تُصْبَرُ بالنَّبلِ. رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Abud Darda’ said God’s messenger forbade eating the mujaththama, which is the animal kept as a target for arrows. \n\nTirmidhi transmitted it."}},{"id":26,"idInBook":26,"chapterId":20,"bookId":14,"arabic":"وَعَنِ الْعِرْبَاضِ بْنِ سَارِيَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى يَوْمَ خَيْبَرَ عَنْ كُلِّ ذِي نَابٍ مِنَ السِّبَاعِ وَعَنْ كُلِّ ذِي مِخْلَبٍ مِنَ الطَّيْرِ وَعَنْ لُحُومِ الْحُمُرِ الْأَهْلِيَّةِ وَعَنِ الْمُجَثَّمَةِ وَعَنِ الْخَلِيسَةِ وَأَنْ تُوطَأَ الْحَبَالَى حَتَّى يَضَعْنَ مَا فِي بُطُونِهِنَّ قَالَ مُحَمَّدُ بْنُ يَحْيَى: سُئِلَ أَبُو عَاصِمٍ عَنِ الْمُجَثَّمَةِ فَقَالَ: أَنْ يُنْصَبَ الطَّيْرُ أَوِ الشَّيْءُ فَيُرْمَى وَسُئِلَ عَنِ الْخَلِيسَةِ فَقَالَ: الذِّئْبُ أَوِ السَّبُعُ يُدْرِكُهُ الرَّجُلُ فَيَأْخُذُ مِنْهُ فَيَمُوتُ فِي يَدِهِ قَبْلَ أَنْ يذكيها. رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Al-Irbad b. Sariya told that on the day of Khaibar God's messenger forbade every carnivorous beast which had a fang, every bird which had a claw, the flesh of domestic asses, the mujaththama, the khalisa, and sexual intercourse with pregnant wbmen till they have given birth to a child. Muhammad b. Yahya* said that Abu ‘Asim was asked about the mujaththama and said it meant a bird or something else being set up and shot at. He was asked about the khalisa and said it was an animal taken from a wolf or a beast of prey by a man who has caught up on it, but which dies in his hand before he can slaughter it. \n*Tirmidhi’s immediate authority.\n\nTirmidhi transmitted it."}},{"id":27,"idInBook":27,"chapterId":20,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ وَأَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ شَرِيطَةِ الشَّيْطَانِ. زَادَ ابْنُ عِيسَى: هِيَ الذَّبِيحَةُ يُقْطَعُ مِنْهَا الْجِلْدُ وَلَا تُفْرَى الْأَوْدَاجُ ثُمَّ تُتْرَكُ حَتَّى تَمُوتَ. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Ibn ‘Abbas and Abu Huraira said God's messenger forbade the devil’s sacrification. Ibn Isa* added that this refers to the slaughtered animal whose skin is cut off and is then left to die without its jugular veins being severed. \n*Cf. Abu Dawud, Adahi, 17.\n\nAbu Dawud transmitted it."}},{"id":28,"idInBook":28,"chapterId":20,"bookId":14,"arabic":"وَعَنْ جَابِرٌ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «ذَكَاةُ الْجَنِينِ ذَكَاةُ أُمِّهِ» . رَوَاهُ أَبُو دَاوُد والدارمي\nوَرَوَاهُ التِّرْمِذِيّ عَن أبي سعيد","english":{"narrator":"","text":"Jabir reported the Prophet as saying, “The slaughter of the embryo is included when its mother is slaughtered.” \n\nAbu Dawud and Darimi transmitted it, and Tirmidhi transmitted it on the authority of Abu Sa‘id."}},{"id":29,"idInBook":29,"chapterId":20,"bookId":14,"arabic":"وَعَن أبي سعيدٍ الخدريِّ قَالَ: قُلْنَا: يَا رَسُولَ اللَّهِ نَنْحَرُ النَّاقَةَ ونذبح الْبَقَرَة وَالشَّاة فنجد فِي بَطنهَا جَنِينا أَنُلْقِيهِ أَمْ نَأْكُلُهُ؟ قَالَ: «كُلُوهُ إِنْ شِئْتُمْ فَإِنَّ ذَكَاتَهُ ذَكَاةُ أُمِّهِ» . رَوَاهُ أَبُو دَاوُدَ وَابْن مَاجَه","english":{"narrator":"","text":"Abu Sa'id al-Khudri told th at they said, “Messenger of God, we cut the throat of a she-camel and slaughter a cow and a sheep and find an embryo in its womb. Shall we throw it away or eat it?” He replied, “Eat it if you wish, for its slaughter is included when its mother is slaughtered.” \n\nAbu Dawud and Ibn Majah transmitted it."}},{"id":30,"idInBook":30,"chapterId":20,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ قَتَلَ عُصْفُورًا فَمَا فَوْقَهَا بِغَيْرِ حَقِّهَا سَأَلَهُ اللَّهُ عَنْ قَتْلِهِ» قِيلَ: يَا رَسُولَ اللَّهِ وَمَا حَقُّهَا؟ قَالَ: «أَنْ يَذْبَحَهَا فَيَأْكُلَهَا وَلَا يَقْطَعَ رَأْسَهَا فَيَرْمِيَ بِهَا» . رَوَاهُ أَحْمد وَالنَّسَائِيّ والدرامي","english":{"narrator":"","text":"‘Abdallah b. ‘Amr b. al-‘As reported God’s messenger as saying, “If anyone kills a sparrow or anything greater wrongfully God will question him about killing it.” On being asked what was the right way he replied, “To cut its throat and eat it, but not to cut off its head and throw it away.” \n\nAhmad, Nasa’i and Darimi transmitted it."}},{"id":31,"idInBook":31,"chapterId":20,"bookId":14,"arabic":"عَن أبي وَافد اللَّيْثِيّ قَالَ: قَدِمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةَ وَهُمْ يَجُبُّونَ أَسْنِمَةَ الْإِبِلِ وَيَقْطَعُونَ أَلْيَاتِ الْغَنَمِ فَقَالَ: «مَا يُقْطَعُ مِنَ الْبَهِيمَةِ وَهِيَ حَيَّةٌ فَهِيَ مَيْتَةٌ لَا تُؤْكَلُ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُد","english":{"narrator":"","text":"Abu Waqid al-Laithi told that when the Prophet came to Medina the people used to cut off camels' humps and cut the fat tails of sheep, so he said, “Whatever is cut off an animal when it is alive is dead* and must not be eaten.” \n*i.e. it is treated as something which had died a natural death, and therefore may not be lawfully eaten.\n\nTirmidhi and Abu Dawud transmitted it."}},{"id":32,"idInBook":32,"chapterId":20,"bookId":14,"arabic":"عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ رَجُلٍ مِنْ بَنِي حَارِثَةَ أَنَّهُ كَانَ يَرْعَى لِقْحَةً بِشِعْبٍ مِنْ شِعَابِ أُحُدٍ فَرَأَى بِهَا الْمَوْتَ فَلَمْ يَجِدْ مَا يَنْحَرُهَا بِهِ فَأَخَذَ وَتِدًا فَوَجَأَ بِهِ فِي لَبَّتِهَا حَتَّى أَهْرَاقَ دَمَهَا ثُمَّ أَخْبَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَهُ بِأَكْلِهَا. رَوَاهُ أَبُو دَاوُدَ وَمَالِكٌ وَفِي رِوَايَته: قَالَ: فذكاها بشظاظ","english":{"narrator":"","text":"‘Ata’ b. Yasar was told by a man of the B. Haritha that when he was pasturing a pregnant she-camel in one of the ravines of Uhud he saw that it was about to die, and as he could find nothing with which to cut its throat he took a stake and stabbed it in the upper part of its breast till he made its blood flow. He then informed the Prophet and he ordered him to eat it. \n\nAbu Dawud and Malik transmitted it. In his version he said he slaughtered it with a pointed piece of wood."}},{"id":33,"idInBook":33,"chapterId":20,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «مَا من دَابَّة إِلَّا وَقَدْ ذَكَّاهَا اللَّهُ لِبَنِي آدَمَ» . رَوَاهُ الدَّارَقُطْنِيّ","english":{"narrator":"","text":"Jabir reported God’s messenger as saying, “There is no creature in the sea which God has not slaughtered for the sons of Adam.”*\n*A way of saying that fish are lawful food although they are not slaughtered.\n\nDaraqutni transmitted it."}},{"id":34,"idInBook":34,"chapterId":20,"bookId":14,"arabic":"عَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «مَنِ اقْتَنَى كَلْبًا إِلَّا كَلْبَ مَاشِيَةٍ أَوْ ضَارٍ نَقَصَ مِنْ عَمَلِهِ كُلَّ يَوْمٍ قِيرَاطَانِ»","english":{"narrator":"","text":"Ibn ‘Umar reported God’s messenger as saying, \"If anyone acquires a dog, except a sheepdog or one trained for hunting, two qirats will be deducted from his good deeds daily.\" \n\n(Bukhari and Muslim.)"}},{"id":35,"idInBook":35,"chapterId":20,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عَلَيْهِ وَسلم: «من اتَّخَذَ كَلْبًا إِلَّا كَلْبَ مَاشِيَةٍ أَوْ صَيْدٍ أَو زرعٍ انتقَصَ منْ أجرِه كلَّ يومٍ قِيرَاط»","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, \"If anyone gets a dog, except a sheepdog or a hunting dog or a farm dog, a qirat of his reward will be deducted daily.\" \n\n(Bukhari and Muslim.)"}},{"id":36,"idInBook":36,"chapterId":20,"bookId":14,"arabic":"وَعَن جَابر قَالَ: أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقَتْلِ الْكِلَابِ حَتَّى إِنَّ الْمَرْأَةَ تَقْدَمُ منَ البادِيةِ بكلبِها فتقتلَه ثُمَّ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ قَتْلِهَا وَقَالَ: «عَلَيْكُمْ بِالْأَسْوَدِ الْبَهِيمِ ذِي النقطتين فَإِنَّهُ شَيْطَان» . رَوَاهُ مُسلم","english":{"narrator":"Jabir said:","text":"God’s messenger ordered us to kill dogs, and we were even killing a dog which a woman brought with her from the desert. Afterwards God’s messenger forbade us to kill dogs, saying, \"Confine yourselves to the type which is pure black and has two spots, for it is a devil.\" \n\nMuslim transmitted it."}},{"id":37,"idInBook":37,"chapterId":20,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ بِقَتْلِ الْكِلَابِ إِلَّا كَلْبَ صيدٍ أَو كلب غنم أَو مَاشِيَة","english":{"narrator":"","text":"Ibn ‘Umar said the Prophet ordered dogs to be killed, except hunting dogs or sheepdogs or dogs used for looking after animals. \n\n(Bukhari and Muslim.)"}},{"id":38,"idInBook":38,"chapterId":20,"bookId":14,"arabic":"عَن عبد الله بنِ مُغفَّلٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَوْلَا أَنَّ الْكِلَابَ أُمَّةٌ مِنَ الْأُمَمِ لَأَمَرْتُ بِقَتْلِهَا كُلِّهَا فَاقْتُلُوا مِنْهَا كُلَّ أَسْوَدَ بَهِيمٍ» . رَوَاهُ أَبُو دَاوُدَ وَالدَّارِمِيُّ وَزَادَ التِّرْمِذِيُّ وَالنَّسَائِيُّ: «وَمَا مِنْ أَهْلِ بَيْتٍ يَرْتَبِطُونَ كَلْبًا إِلَّا نَقَصَ مِنْ عَمَلِهِمْ كُلَّ يَوْمٍ قِيرَاطٌ إِلَّا كَلْبَ صَيْدٍ أَوْ كَلْبَ حَرْثٍ أَوْ كَلْبَ غنم»","english":{"narrator":"","text":"Abdallah b. Mughaffal reported the Prophet as saying, \"Were dogs not a species of creature I should command that they all be killed; but kill every pure black one.\" \n\nAbu Dawud and Darimi transmitted it. Tirmidhi and Nasa'i added, \"No family attaches itself to a dog without a qirat of their good deeds being deducted daily, except in the case of a hunting dog, a farm dog, or a sheepdog.”"}},{"id":39,"idInBook":39,"chapterId":20,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ التَّحْرِيشِ بَيْنَ الْبَهَائِمِ. رَوَاهُ التِّرْمِذِيُّ","english":{"narrator":"","text":"Ibn ‘Abbas told that God's messenger forbade inciting animals to fight with one another. \n\nTirmidhi and Abu Dawud transmitted it."}},{"id":40,"idInBook":40,"chapterId":20,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «كُلُّ ذِي نَابٍ منَ السِّباعِ فأكلُه حرامٌ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, \"Eating any fanged beast of prey is prohibited.\" \n\nMuslim transmitted it."}},{"id":41,"idInBook":41,"chapterId":20,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ كُلِّ ذِي نَابٍ مِنَ السِّبَاعِ وَكُلِّ ذِي مِخْلَبٍ مِنَ الطَّيْرِ. رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"Ibn Abbas said God’s messenger prohibited every beast of prey with a fang and every bird with a talon. \n\nMuslim transmitted it."}},{"id":42,"idInBook":42,"chapterId":20,"bookId":14,"arabic":"وَعَن أبي ثَعلبةَ قَالَ: حَرَّمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لُحُومَ الْحُمُرِ الْأَهْلِيَّةِ","english":{"narrator":"","text":"Abu Tha'laba said God's messenger prohibited the flesh of domestic asses. \n\n(Bukhari and Muslim.)"}},{"id":43,"idInBook":43,"chapterId":20,"bookId":14,"arabic":"وَعَنْ جَابِرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى يَوْمَ خَيْبَرَ عَنْ لُحُومِ الْحُمُرِ الْأَهْلِيَّةِ وَأَذِنَ فِي لُحُومِ الْخَيْلِ","english":{"narrator":"","text":"Jabir said that on the day of Khaibar God’s messenger forbade the flesh of domestic asses, but permitted horseflesh. \n\n(Bukhari and Muslim.)"}},{"id":44,"idInBook":44,"chapterId":20,"bookId":14,"arabic":"وَعَن أبي قتادةَ أَنَّهُ رَأَى حِمَارًا وَحْشِيًّا فَعَقَرَهُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «هَلْ مَعَكُمْ مِنْ لَحْمِهِ شَيْءٌ؟» قَالَ: مَعَنَا رِجْلُهُ فَأَخَذَهَا فَأَكَلَهَا","english":{"narrator":"","text":"Abu Qatada told that he saw a wild ass and killed it. The Prophet asked whether they had any of its flesh and when he replied that they had a leg he took it and ate it. \n\n(Bukhari and Muslim.)"}},{"id":45,"idInBook":45,"chapterId":20,"bookId":14,"arabic":"وَعَن أنس قَالَ: أَنْفَجْنَا أَرْنَبًا بِمَرِّ الظَّهْرَانِ فَأَخَذْتُهَا فَأَتَيْتُ بهَا أَبَا طلحةَ فذبحها وَبَعَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بوَرِكِها وفخذْيها فقبِله","english":{"narrator":"Anas said:","text":"We started a hare at Marr az-Zahran1 and when I caught it and brought it to Abu Talha he cut its throat and sent its haunch and two hindlegs to God’s messenger, and he accepted it. \n1. A wadi near Mecca.\n\n(Bukhari and Muslim.)"}},{"id":46,"idInBook":46,"chapterId":20,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الضَّبُّ لَسْتُ آكُلُهُ وَلَا أُحَرِّمُهُ»","english":{"narrator":"","text":"Ibn ‘Umar reported God’s messenger as saying, \"I neither eat nor prohibit the eating of lizards.\" \n\n(Bukhari and Muslim.)"}},{"id":47,"idInBook":47,"chapterId":20,"bookId":14,"arabic":"وَعَن ابنِ عبَّاسٍ: أَنَّ خَالِدَ بْنَ الْوَلِيدِ أَخْبَرَهُ أَنَّهُ دَخَلَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى مَيْمُونَةَ وَهِيَ خَالَتُهُ وَخَالَةُ ابْنِ عَبَّاسٍ فَوَجَدَ عِنْدَهَا ضَبًّا مَحْنُوذًا فَقَدَّمَتِ الضَّبَّ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَفَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَهُ عَنِ الضَّبِّ فَقَالَ خَالِدٌ: أَحْرَامٌ الضَّبُّ يَا رَسُولَ اللَّهِ؟ قَالَ: «لَا وَلَكِنْ لَمْ يَكُنْ بِأَرْضِ قَوْمِي فَأَجِدُنِي أَعَافُهُ» قَالَ خَالِدٌ: فَاجْتَرَرْتُهُ فَأَكَلْتُهُ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْظُرُ إِلَيّ","english":{"narrator":"","text":"Ibn Abbas said he was told by Khalid b. al-Walid that he went with God’s messenger to visit Maimuna who was both his and Ibn 'Abbas's maternal aunt and found that she had a roasted lizard. She offered the lizard to God's messenger, and when he withdrew his hand from it Khalid asked him whether lizards were prohibited. He replaid, ''No; but there were none in the land of my people, and I find that I dislike them.'' Khalid said, ''I then chewed and ate it while God’s messenger was looking at me.\" \n\n(Bukhari and Muslim.)"}},{"id":48,"idInBook":48,"chapterId":20,"bookId":14,"arabic":"وَعَن أبي مُوسَى قَالَ: رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْكُلُ لَحْمَ الدَّجَاجِ","english":{"narrator":"","text":"Abu Musa told that he saw God’s messenger eating fowl. \n\n(Bukhari and Muslim.)"}},{"id":49,"idInBook":49,"chapterId":20,"bookId":14,"arabic":"وَعَن ابنِ أبي أوْفى قَالَ: غَزَوْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَبْعَ غَزَوَاتٍ كُنَّا نَأْكُلُ مَعَهُ الجرادَ","english":{"narrator":"","text":"Ibn Abu Aufa told that they went on seven expeditions along with God's messenger and ate locusts along with him. \n\n(Bukhari and Muslim.)"}},{"id":50,"idInBook":50,"chapterId":20,"bookId":14,"arabic":"وَعَن جابرٍ قَالَ: غَزَوْتُ جَيْشَ الْخَبْطِ وَأُمِّرَ عَلَيْنَا أَبُو عُبَيْدَةَ فَجُعْنَا جُوعًا شَدِيدًا فَأَلْقَى الْبَحْرُ حُوتًا مَيِّتًا لَمْ نَرَ مِثْلَهُ يُقَالُ لَهُ: الْعَنْبَرُ فَأَكَلْنَا مِنْهُ نِصْفَ شَهْرٍ فَأَخَذَ أَبُو عُبَيْدَةَ عَظْمًا مِنْ عِظَامِهِ فَمَرَّ الرَّاكِبُ تَحْتَهُ فَلَمَّا قَدِمْنَا ذَكَرْنَا ذَلِكَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «كُلُوا رِزْقًا أَخْرَجَهُ اللَّهُ إِلَيْكُمْ وَأَطْعِمُونَا إِنْ كَانَ مَعَكُمْ» قَالَ: فَأَرْسَلْنَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْهُ فَأَكله","english":{"narrator":"Jabir said:","text":"I was on the expedition when the army had to beat leaves off trees for food and Abu ‘Ubaida was placed in charge. We suffered severe hunger, and then the sea cast up a dead fish the like of which we had never seen before, called the spermaceti whale, and we ate of it for half a month. Abu ‘Ubaida took one of its bones and a rider was able to pass under it. When we arrived and mentioned the matter to the Prophet he said, ''Eat a provision which God has brought forth for you, and give us some to eat if you have any.\" He said they sent some of it to God’s messenger and he ate it. \n\n(Bukhari and Muslim.)"}},{"id":51,"idInBook":51,"chapterId":20,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا وَقَعَ الذُّبَابُ فِي إِناءِ أحدِكم فَلْيَغْمِسْهُ كُلَّهُ ثُمَّ لِيَطْرَحْهُ فَإِنَّ فِي أَحَدِ جَنَاحَيْهِ شِفَاءً وَفِي الْآخَرِ دَاءً» . رَوَاهُ الْبُخَارِيُّ","english":{"narrator":"","text":"Abu Huraira reported God’s messsenger as saying, \"When a fly alights in anyone’s vessel he should plunge it all in and then throw it away, for in one of its wings there is a cure and in the other disease.\" \n\nBukhari transmitted it."}},{"id":52,"idInBook":52,"chapterId":20,"bookId":14,"arabic":"وَعَن ميمونةَ أَنَّ فَأْرَةً وَقَعَتْ فِي سَمْنٍ فَمَاتَتْ فَسُئِلَ رَسُول الله صلى الله عَلَيْهِ وَسلم فَقَالَ: «ألقوها وَمَا حولهَا وكلوه» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Maimuna said that when a mouse fell into some clarified butter and died God's messenger was asked about it and replied, \"Throw it and what is round it away and eat what is left.\" \n\nBukhari transmitted it."}},{"id":53,"idInBook":53,"chapterId":20,"bookId":14,"arabic":"وَعَن ابْن عمر أَنَّهُ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: \" اقْتُلُوا الْحَيَّاتِ وَاقْتُلُوا ذَا الطُّفْيَتَيْنِ وَالْأَبْتَرَ فَإِنَّهُمَا يَطْمِسَانِ الْبَصَرَ وَيَسْتَسْقِطَانِ الْحَبَلَ قَالَ عَبْدُ اللَّهِ: فَبَيْنَا أَنَا أُطَارِدُ حَيَّةً أَقْتُلَهَا نَادَانِي أَبُو لُبَابَةَ: لَا تَقْتُلْهَا فَقُلْتُ: إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ بِقَتْلِ الْحَيَّاتِ. فَقَالَ: إِنَّهُ نَهَى بَعْدَ ذَلِكَ عَنْ ذَوَات الْبيُوت وَهن العوامر","english":{"narrator":"","text":"Ibn ‘Umar told of hearing the Prophet say, \"Kill snakes, kill those which have two streaks and those with small tails, for they obliterate the eyesight and cause miscarriage.\" ‘Abdallah  said that while he was chasing a snake and trying to kill it Abu Lubaba called to him not to kill it, but he replied that God's messenger had given command that snakes should be killed. He then said that he had later prohibited killing house-snakes, for they are resident jinn. \n\n(Bukhari and Muslim.)"}},{"id":54,"idInBook":54,"chapterId":20,"bookId":14,"arabic":"وَعَن أبي السَّائِب قَالَ: دَخَلْنَا عَلَى أَبِي سَعِيدٍ الْخُدْرِيِّ فَبَيْنَمَا نحنُ جلوسٌ إِذ سمعنَا تَحت سَرِيره فَنَظَرْنَا فَإِذَا فِيهِ حَيَّةٌ فَوَثَبْتُ لِأَقْتُلَهَا وَأَبُو سَعِيدٍ يُصَلِّي فَأَشَارَ إِلَيَّ أَنِ اجْلِسْ فَجَلَسْتُ فَلَمَّا انْصَرَفَ أَشَارَ إِلَى بَيْتٍ فِي الدَّارِ فَقَالَ: أَتَرَى هَذَا البيتَ؟ فَقلت: نعم فَقَالَ: كَانَ فِيهِ فَتًى مِنَّا حَدِيثُ عَهْدٍ بِعُرْسٍ قَالَ: فَخَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْخَنْدَقِ فَكَانَ ذَلِكَ الْفَتَى يَسْتَأْذِنُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِأَنْصَافِ النَّهَارِ فَيَرْجِعُ إِلَى أَهْلِهِ فَاسْتَأْذَنَهُ يَوْمًا فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «خُذْ عَلَيْكَ سِلَاحَكَ فَإِنِّي أَخْشَى عَلَيْكَ قُرَيْظَةَ» . فَأَخَذَ الرَّجُلُ سِلَاحَهُ ثُمَّ رَجَعَ فَإِذَا امْرَأَتُهُ بَيْنَ الْبَابَيْنِ قَائِمَةٌ فَأَهْوَى إِلَيْهَا بِالرُّمْحِ لِيَطْعَنَهَا بِهِ وَأَصَابَتْهُ غَيْرَةٌ فَقَالَتْ لَهُ: اكْفُفْ عَلَيْكَ رُمْحَكَ وَادْخُلِ الْبَيْتَ حَتَّى تَنْظُرَ مَا الَّذِي أَخْرَجَنِي فَدَخَلَ فَإِذَا بِحَيَّةٍ عَظِيمَةٍ مُنْطَوِيَةٍ عَلَى الْفِرَاشِ فَأَهْوَى إِلَيْهَا بِالرُّمْحِ فَانْتَظَمَهَا بِهِ ثُمَّ خَرَجَ فَرَكَزَهُ فِي الدَّارِ فَاضْطَرَبَتْ عَلَيْهِ فَمَا يُدْرَى أَيُّهُمَا كَانَ أَسْرَعَ مَوْتًا: الْحَيَّةُ أَمِ الْفَتَى؟ قَالَ: فَجِئْنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَذَكَرْنَا ذَلِكَ لَهُ وَقُلْنَا: ادْعُ اللَّهَ يُحْيِيهِ لَنَا فَقَالَ: «اسْتَغْفِرُوا لِصَاحِبِكُمْ» ثُمَّ قَالَ: «إِنَّ لِهَذِهِ الْبُيُوتِ عَوَامِرَ فَإِذَا رأيتُم مِنْهَا شَيْئا فحرِّجوا عَلَيْهَا ثَلَاثًا فإنْ ذَهَبَ وَإِلَّا فَاقْتُلُوهُ فَإِنَّهُ كَافِرٌ» . وَقَالَ لَهُمْ: «اذْهَبُوا فَادْفِنُوا صَاحِبَكُمْ» وَفِي رِوَايَةٍ قَالَ: «إِنَّ بالمدينةِ جِنَّاً قد أَسْلمُوا فَإِذا رأيتُم مِنْهُم شَيْئًا فَآذِنُوهُ ثَلَاثَةَ أَيَّامٍ فَإِنْ بَدَا لَكُمْ بَعْدَ ذَلِكَ فَاقْتُلُوهُ فَإِنَّمَا هُوَ شَيْطَانٌ» . رَوَاهُ مُسلم","english":{"narrator":"Abus Sa’ib said:","text":"We went in to visit Abu Sa'id al-Khudri, and while we were sitting we heard a movement under his couch. When we had looked and found a snake in it I jumped up to kill it, but Abu Sa'id who was engaged in prayer made a gesture to me indicating that I should sit down, so I sat down. When he finished he pointed to a room in the house and asked if I saw it, and when I said I did he told me that a servant of theirs who had recently been married had occupied it. They went out with God’s messenger to the Trench, and that young man was asking permission from God’s messenger to leave after staying half the day and would return to his wife. One day when he asked God's messenger’s permission he told him to carry his weapons with him as he feared Quraiza might do him harm. The man took his weapons and returned, and finding his wife standing between the two doors he was smitten with jealousy and made to pierce her with his lance, but she told him to put away his lance and enter the house to see what had made her come out. He entered and found a huge snake coiled on the bedding, so he made for it with the lance and pierced it with it and then went out and fixed it in the ground in the house, but the snake quivered and attacked him, and no one knew which of them died first, the snake or the young man. They went to God's messenger and mentioned that incident to him, asking him to supplicate God to restore him to life for them, but he replied, \"Ask forgiveness for your friend.\" Then he said, \"These houses have resident jinn, so when you see one of them give it a warning three times. 1 If it goes away, well and good; otherwise kill it, for it is an infidel.'' He then told them to go and bury their friend. A version reports him as saying, ''In Medina there are jinn who have accepted Islam, so when you see one of them pronounce a warning to it for three days and if it appears to you after that kill it, for it is only a devil.\" \n1. Hiarrijiu ‘alaiha thalithan. The verb means to make things difficult. This phrase is explained as meaning that one should tell the snake three times that it will be in difficulties if it returns, and that it must not blame one if, after this warning, it is driven away and killed.\n\nMuslim transmitted it."}},{"id":55,"idInBook":55,"chapterId":20,"bookId":14,"arabic":"وَعَن أم شريك: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ بِقَتْلِ الْوَزَغِ وَقَالَ: «كَانَ يَنْفُخُ عَلَى إِبْرَاهِيم»","english":{"narrator":"","text":"Umm Sharik told that God’s messenger ordered geckos to be killed, saying the gecko blew on Abraham.1 \n\n1. Al-Qur’an 21:68 speaks of Abraham being put into a fire. In this tradition it is said that the gecko blew on the fire to stir it up.\n\n(Bukhari and Muslim.)"}},{"id":56,"idInBook":56,"chapterId":20,"bookId":14,"arabic":"وَعَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ بِقَتْلِ الْوَزَغِ وَسَمَّاهُ فُوَيْسِقًا. رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"Sa‘d b. Abu Waqqas told that God’s messenger ordered geckos to be killed, calling them noxious little creatures. \n\nMuslim transmitted it."}},{"id":57,"idInBook":57,"chapterId":20,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ قَتَلَ وَزَغًا فِي أولَّ ضَرْبَة كتبت لَهُ مِائَةُ حَسَنَةٍ وَفِي الثَّانِيَةِ دُونَ ذَلِكَ وَفِي الثَّالِثَة دون ذَلِك» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Huraira reported God's messenger as saying, \"If anyone kills a gecko with the first blow a hundred good deeds will be recorded for him, less if he kills it at the second and less still if he kills it at the third.\" \n\nMuslim transmitted it."}},{"id":58,"idInBook":58,"chapterId":20,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" قَرَصَتْ نَمْلَةٌ نَبِيًّا من الأنبياءِ فأمرَ بقربةِ النَّمْلِ فَأُحْرِقَتْ فَأَوْحَى اللَّهُ تَعَالَى إِلَيْهِ: أَنْ قَرَصَتْكَ نَمْلَةٌ أَحْرَقْتَ أُمَّةً مِنَ الْأُمَمِ تُسَبِّحُ؟ \"","english":{"narrator":"","text":"He reported God’s messenger as saying that when a prophet was stung by an ant he ordered a colony of ants to be burned, and God most high revealed to him, \"Because an ant stung you you have burned a community which glorifies me.\" \n\n(Bukhari and Muslim.)"}},{"id":59,"idInBook":59,"chapterId":20,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا وَقَعَتِ الْفَأْرَةُ فِي السَّمْنِ فَإِنْ كَانَ جَامِدًا فَأَلْقُوهَا وَمَا حَوْلَهَا وَإِنْ كَانَ مَائِعًا فَلَا تَقْرَبُوهُ» . رَوَاهُ أَحْمد وَأَبُو دَاوُد\nوَرَوَاهُ الدَّارمِيّ عَن ابْن عَبَّاس","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, \"When a mouse falls into clarified butter which, is solid throw the mouse and what is around it away; but if it is in a liquid state do not go near it.\" \n\nAhmad and Abu Dawud transmitted it, and Darimi transmitted it on the authority of Ibn ‘Abbas."}},{"id":60,"idInBook":60,"chapterId":20,"bookId":14,"arabic":"وَعَنْ سَفِينَةَ قَالَ: أَكَلْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَحْمَ حُبَارَى. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Safina told that he and God's messenger ate the flesh of a bustard. \n\nAbu Dawud transmitted it."}},{"id":61,"idInBook":61,"chapterId":20,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أَكْلِ الْجَلَّالَةِ وَأَلْبَانِهَا. رَوَاهُ التِّرْمِذِيُّ وَفِي رِوَايَةِ أَبِي دَاوُدَ: قَالَ: نُهِيَ عَنْ ركوبِ الْجَلالَة","english":{"narrator":"","text":"Ibn ‘Umar told that God's messenger prohibited eating the animal which feeds on filth or drinking its milk. \n\nTrimidhi transmitted it. In Abu Dawud’s version he said that he forbade riding the animal which feeds on filth."}},{"id":62,"idInBook":62,"chapterId":20,"bookId":14,"arabic":"وَعَن عبدِ الرَّحمنِ بنِ شِبْلٍ: أَنَّ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ أَكْلِ لَحْمِ الضَّبِّ. رَوَاهُ أَبُو دَاوُدَ","english":{"narrator":"","text":"‘Abd ar-Rahman b. Shibl said the Prophet forbade eating the flesh of lizards. \n\nAbu Dawud transmitted it."}},{"id":63,"idInBook":63,"chapterId":20,"bookId":14,"arabic":"وَعَنْ جَابِرٍ رَضِيَ اللَّهُ عَنْهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ أَكْلِ الْهِرَّةِ وَأَكْلِ ثَمَنِهَا. رَوَاهُ أَبُو دَاوُدَ وَالتِّرْمِذِيُّ","english":{"narrator":"","text":"Jabir said the Prophet forbade eating cats or what is paid for them. 1\n1. This might be either what was paid in kind, or what was bought with money paid for them.\n\nAbu Dawud and Tirmidhi transmitted it."}},{"id":64,"idInBook":64,"chapterId":20,"bookId":14,"arabic":"وَعنهُ حَرَّمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعْنِي يَوْمَ خَيْبَرَ الْحُمُرَ الْإِنْسِيَّةَ وَلُحُومَ الْبِغَالِ وَكُلَّ ذِي نَابٍ مِنَ السِّبَاعِ وَكُلَّ ذِي مِخْلَبٍ مِنَ الطَّيْرِ. رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيث غَرِيب","english":{"narrator":"","text":"He said, referring to the day of Khaibar, that God’s messenger declared domestic asses, the flesh of mules, every beast of prey with a fang and every bird with a talon to be unlawful. \n\nTirmidhi transmitted it, saying this is a gharib tradition."}},{"id":65,"idInBook":65,"chapterId":20,"bookId":14,"arabic":"وَعَن خالدِ بْنِ الْوَلِيدِ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ أَكْلِ لُحُومِ الْخَيْلِ والبِغالِ والحميرِ. رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ","english":{"narrator":"","text":"Khalid b. al-Walld said God’s messenger prohibited eating the flesh of horses, mules and asses. \n\nAbu Dawud and Nasa’i transmitted it."}},{"id":66,"idInBook":66,"chapterId":20,"bookId":14,"arabic":"وَعَنْهُ قَالَ: غَزَوْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ خَيْبَرَ فَأَتَتِ الْيَهُودُ فَشَكَوْا أَنَّ النَّاسَ قَدْ أَسْرَعُوا إِلَى خَضَائِرِهِمْ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَلَا لَا يَحِلُّ أَمْوَالُ المعاهِدينَ إِلاَّ بحقِّها» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"He said that he went with the Prophet to fight at the battle of Khaibar and the Jews came and complained that the people had hastened to take their green dates, 2 so God’s messenger said, ''The property of those who have been given a covenant is not lawful except for the dues which are levied.\" \n2. The reference is to dates which fall from the tree while still green.\n\nAbu Dawud transmitted it."}},{"id":67,"idInBook":67,"chapterId":20,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" أُحِلَّتْ لَنَا مَيْتَتَانِ وَدَمَانِ: الْمَيْتَتَانِ: الْحُوتُ وَالْجَرَادُ وَالدَّمَانِ: الْكَبِدُ وَالطِّحَالُ \". رَوَاهُ أحمدُ وابنُ مَاجَه وَالدَّارَقُطْنِيّ","english":{"narrator":"","text":"Ibn ‘Umar reported God’s messenger as saying, \"Two types of animals which have died a natural death and two types of blood have been made allowable to us, the two which die a natural death being the fish and the locust, and the two types of blood being the liver and the spleen.\" \n\nAhmad, Ibn Majah and Daraqutni transmitted it."}},{"id":68,"idInBook":68,"chapterId":20,"bookId":14,"arabic":"وَعَن أبي الزُّبيرِ عَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «مَا ألقاهُ البحرُ وجزر عَنْهُ الْمَاءُ فَكُلُوهُ وَمَا مَاتَ فِيهِ وَطَفَا فَلَا تَأْكُلُوهُ» . رَوَاهُ أَبُو دَاوُدَ وَابْنُ مَاجَهْ\nوَقَالَ مُحْيِي السُّنَّةِ: الْأَكْثَرُونَ عَلَى أَنَّهُ مَوْقُوفٌ على جَابر","english":{"narrator":"","text":"Abuz Zubair quoted Jabir’s authority for the statement that God's messenger said, \"What the sea throws up and is left by the tide you may eat, but what dies in the sea and floats you must not eat.\" \n\nAbu Dawud and Ibn Majah transmitted it, but Muhyi as-Sunna said most people hold that it goes no farther back than Jabir."}},{"id":69,"idInBook":69,"chapterId":20,"bookId":14,"arabic":"وَعَن سلمَان قَالَ: سُئِلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْجَرَادِ فَقَالَ: «أَكْثَرُ جُنُودِ اللَّهِ لَا آكُلُهُ وَلَا أُحَرِّمُهُ» . رَوَاهُ أَبُو دَاوُدُ وَقَالَ محيي السّنة: ضَعِيف","english":{"narrator":"","text":"Salman said the Prophet was asked about locusts and replied, \"They are the most numerous of God’s hosts. I neither eat them nor declare them unlawful.\"\n\nAbu Dawud transmitted it, but Muhyi as-Sunna said it is weak."}},{"id":70,"idInBook":70,"chapterId":20,"bookId":14,"arabic":"وَعَن زيدِ بن خالدٍ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ سَبِّ الدِّيكِ وَقَالَ: «إِنَّهُ يُؤَذِّنُ للصَّلاةِ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Zaid b. Khalid said that God’s messenger prohibited reviling a cock, saying that it is making the caH to prayer. \n\nIt is transmitted in Sharh as-sunna."}},{"id":71,"idInBook":71,"chapterId":20,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَسُبُّوا الدِّيكَ فَإِنَّهُ يُوقِظُ للصلاةِ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"He reported God’s messenger as saying, \"Do not revile a cock, for it wakens people for prayer.\" \n\nAbu Dawud transmitted it."}},{"id":72,"idInBook":72,"chapterId":20,"bookId":14,"arabic":"وَعَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى قَالَ: قَالَ أَبُو لَيْلَى: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" إِذَا ظَهَرَتِ الْحَيَّةُ فِي الْمَسْكَنِ فَقُولُوا لَهَا: إِنَّا نَسْأَلُكِ بِعَهْدِ نُوحٍ وَبِعَهْدِ سُلَيْمَانَ بْنِ دَاوُدَ أَنْ لَا تُؤْذِينَا فَإِنْ عَادَتْ فَاقْتُلُوهَا \". رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ","english":{"narrator":"","text":"'Abd ar-Rahman b. Abu Laila. said that Abu Laila reported God’s messenger as saying, \"When a snake appears in a dwelling say to it, ‘We ask you by the covenant made with Noah and the covenant made with Solomon son of David not to harm us.’ Then if it comes back, kill it.\" \n\nTirmidhi and Abu Dawud transmitted it."}},{"id":73,"idInBook":73,"chapterId":20,"bookId":14,"arabic":"وَعَن عكرمةَ عَن ابنِ عبَّاسٍ قَالَ: لَا أَعْلَمُهُ إِلَّا رَفَعَ الْحَدِيثَ: أَنَّهُ كَانَ يَأْمُرُ بِقَتْلِ الْحَيَّاتِ وَقَالَ: «مَنْ تَرَكَهُنَّ خَشْيَةَ ثَائِرٍ فَلَيْسَ مِنَّا» . رَوَاهُ فِي شَرْحِ السّنة","english":{"narrator":"","text":"‘Ikrima told on the authority of Ibn ‘Abbas, saying he was sure that he traced it back to the Prophet, that he used to order snakes to be killed and say, \"He who leaves them alone fearing that one will come to take revenge does not belong to us.\" \n\nIt is transmitted in Sharh as-sunna."}},{"id":74,"idInBook":74,"chapterId":20,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا سَالَمْنَاهُمْ مُنْذُ حَارَبْنَاهُمْ وَمَنْ تَرَكَ شَيْئًا مِنْهُمْ خِيفَةً فَلَيْسَ منَّا» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Abu Huraira reported God's messenger as saying, \"We have not made peace with them 1 since we fought with them, so he who leaves any of them alone through fear does not belong to us.\" \n1. i.e. snakes.\n\nAbu Dawud transmitted it."}},{"id":75,"idInBook":75,"chapterId":20,"bookId":14,"arabic":"وَعَنِ ابْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «اقْتُلُوا الْحَيَّاتِ كُلَّهُنَّ فَمَنْ خَافَ ثَأْرَهُنَّ فَلَيْسَ مِنِّي» . رَوَاهُ أَبُو دَاوُدَ وَالنَّسَائِيُّ","english":{"narrator":"","text":"Ibn Mas'ud reported God's messenger as saying, \"Kill all the snakes, and he who fears their revenge does not belong to me.\" \n\nAbu Dawud and Nasa'i transmitted it."}},{"id":76,"idInBook":76,"chapterId":20,"bookId":14,"arabic":"وَعَن العبَّاسِ رَضِيَ اللَّهُ عَنْهُ قَالَ: يَا رَسُولَ اللَّهِ إِنَّا نُرِيدُ أَنْ نَكْنُسَ زَمْزَمَ وَإِنَّ فِيهَا مِنْ هَذِهِ الْجِنَّانِ يَعْنِي الْحَيَّاتِ الصِّغَارِ فَأَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقَتْلِهِنَّ. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Al-'Abbas said, \"Messenger of God, we wish to sweep out Zamzam, but in it there are some of these jinnan,\" meaning small snakes; so God’s messenger ordered that they should be killed. \n\nAbu Dawud transmitted it."}},{"id":77,"idInBook":77,"chapterId":20,"bookId":14,"arabic":"وَعَنِ ابْنِ مَسْعُودٍ رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى الله عَلَيْهِ وَسلم قَالَ: «اقْتُلُوا الْحَيَّاتِ كُلَّهَا إِلَّا الْجَانَّ الْأَبْيَضَ الَّذِي كَأَنَّهُ قضيب فضَّة» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Ibn Mas'ud reported God’s messenger as saying, \"Kill all the snakes except the little white one which looks like a silver wand.\" \n\nAbu Dawud transmitted it."}},{"id":78,"idInBook":78,"chapterId":20,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا وَقَعَ الذُّبَابُ فِي إِنَاءِ أَحَدِكُمْ فَامْقُلُوهُ فَإِنَّ فِي أَحَدِ جَنَاحَيْهِ دَاءً وَفِي الْآخَرِ شِفَاءً فَإِنَّهُ يَتَّقِي بِجَنَاحِهِ الَّذِي فِيهِ الدَّاءُ فَلْيَغْمِسْهُ كُلَّهُ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, \"When a fly alights in the vessel of any of you plunge it in, for in one of its wings there is disease and in the other a cure; it puts forward the one containing the disease, so dip it all in.\" \n\nAbu Dawud transmitted it."}},{"id":79,"idInBook":79,"chapterId":20,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ رَضِيَ اللَّهُ عَنْهُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا وَقَعَ الذُّبَابُ فِي الطَّعَامِ فَامْقُلُوهُ فَإِنَّ فِي أَحَدِ جَنَاحَيْهِ سُمًّا وَفِي الْآخَرِ شِفَاءً وَإِنَّهُ يُقَدِّمُ السَّمَّ وَيُؤَخِّرُ الشِّفَاءَ» . رَوَاهُ فِي شرح السّنة","english":{"narrator":"","text":"Abu Sa'id al-Khudri reported the Prophet as saying, \"When a fly alights on food plunge it in, for one of its wings contains poison and the other a cure, and it puts the poison first and the cure second.\" \n\nIt is transmitted in Sharh as-sunna."}},{"id":80,"idInBook":80,"chapterId":20,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ قَتْلِ أَرْبَعٍ مِنَ الدَّوَابِّ: النَّمْلَةِ وَالنَّحْلَةِ وَالْهُدْهُدُ وَالصُّرَدُ. رَوَاهُ أَبُو دَاوُدَ وَالدَّارِمِيُّ","english":{"narrator":"Ibn ‘Abbas said God’s messenger prohibited killing four creatures:","text":"ants, bees, hoopoes and sparrow-hawks. Abu Dawud and Darimi transmitted it."}},{"id":81,"idInBook":81,"chapterId":20,"bookId":14,"arabic":"عَنِ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: كَانَ أَهْلُ الْجَاهِلِيَّةِ يَأْكُلُونَ أَشْيَاءَ وَيَتْرُكُونَ أَشْيَاءَ تَقَذُّرًا فَبَعَثَ اللَّهُ نَبِيَّهُ وَأَنْزَلَ كِتَابَهُ وَأَحَلَّ حَلَالَهُ وَحَرَّمَ حَرَامَهُ فَمَا أَحَلَّ فَهُوَ حَلَالٌ وَمَا حَرَّمَ فَهُوَ حَرَامٌ وَمَا سَكَتَ عَنْهُ فهوَ عفْوٌ وتَلا (قُلْ لَا أَجِدُ فِيمَا أُوحِيَ إِلَيَّ مُحَرَّمًا عَلَى طَاعِمٍ يَطْعَمُهُ إِلَّا أَنْ يَكُونَ مَيْتَةً أَو دَمًا)\nرَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Ibn ‘Abbas said that the people of pre-Islamic times used to eat some things and leave others alone, considering them unclean. Then God sent His Prophet and sent down His Book, marking some things lawful and others unlawful; so what He made lawful is lawful, what He made unlawful is unlawful, and what He said nothing about is allowable. And he recited, ''Say, I do not find in what is revealed to me anything forbidden to him who eats it, except carrion or blood...\" 1 \n1. Qur'an, vi, 145.\n\nAbu Dawud transmitted it."}},{"id":82,"idInBook":82,"chapterId":20,"bookId":14,"arabic":"وَعَن زاهرٍ الأسلميِّ قَالَ: إِنِّي لَأُوقِدُ تَحْتَ الْقُدُورِ بِلُحُومِ الْحُمُرِ إِذْ نَادَى مُنَادِي رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْهَاكُمْ عَنْ لُحُومِ الْحُمُرِ. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Zahir al-Aslami said he was kindling fire under pots which contained asses' flesh when God's messenger's crier made an announcement to the effect that God's messenger prohibited asses' flesh to the people. \n\nBukhari transmitted it."}},{"id":83,"idInBook":83,"chapterId":20,"bookId":14,"arabic":"وَعَن أبي ثعلبةَ الخُشَنيَّ يَرْفَعُهُ: «الْجِنُّ ثَلَاثَةُ أَصْنَافٍ صِنْفٌ لَهُمْ أَجْنِحَةٌ يَطِيرُونَ فِي الْهَوَاءِ وَصِنْفٌ حَيَّاتٌ وَكِلَابٌ وَصِنْفٌ يُحلُّونَ ويظعنونَ» . رَوَاهُ فِي شرح السنَّة","english":{"narrator":"","text":"Abu Tha'laba al-Khushani traced to the Prophet the saying that the jinn are of three classes, one which have wings and fly in the air, one which consists of snakes and dogs, and one which stay in places and travel about. \n\nIt is transmitted in Sharh as-sunna."}},{"id":84,"idInBook":84,"chapterId":20,"bookId":14,"arabic":"عَن سلمانَ بن عامرٍ الضَّبي قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَعَ الْغُلَامِ عَقِيقَةٌ فَأَهْرِيقُوا عَنْهُ دَمًا وأمِيطوا عَنهُ الْأَذَى» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Salman b. ‘Amir ad Dabbl told that he heard God's messenger say, “Along with a boy there is an ‘aqiqa, so shed blood on his behalf and remove injury from him.”* \n*This is variously explained as shaving the hair of the infant, or removing the impurities with which it is defiled at birth, or even circumcision.\n\nBukhari transmitted it."}},{"id":85,"idInBook":85,"chapterId":20,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُؤْتَى بِالصِّبْيَانِ فَيُبَرِّكُ عَلَيْهِمْ وَيُحَنِّكُهُمْ. رَوَاهُ مُسلم","english":{"narrator":"","text":"‘A’isha told that boys used to be brought to God’s messenger, and he would invoke blessings on them and soften some dates and rub their palates with them. \n\nMuslim transmitted it."}},{"id":86,"idInBook":86,"chapterId":20,"bookId":14,"arabic":"وَعَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ أَنَّهَا حَمَلَتْ بِعَبْدِ اللَّهِ بْنِ الزُّبَيْرِ بِمَكَّةَ قَالَتْ: فَوَلَدْتُ بِقُبَاءَ ثُمَّ أَتَيْتُ بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَوَضَعْتُهُ فِي حِجْرِهِ ثُمَّ دَعَا بِتَمْرَةٍ فَمَضَغَهَا ثُمَّ تَفَلَ فِي فِيهِ ثُمَّ حَنَّكَهُ ثُمَّ دَعَا لَهُ وبرك عَلَيْهِ فَكَانَ أَوَّلَ مَوْلُودٍ وُلِدَ فِي الْإِسْلَامِ","english":{"narrator":"","text":"Asma’ daughter of Abu Bakr said she conceived ‘Abdallah b. azZubair in Mecca and gave birth to him in Quba’, then took him to God’s messenger and placed him in his lap. He called for a date, chewed it and spat in his mouth, after which he rubbed his palate and then made supplication for him and invoked a blessing on him. He was the first child to be born in the Islamic period. \n\n(Bukhari and Muslim.)"}},{"id":87,"idInBook":87,"chapterId":20,"bookId":14,"arabic":"عَن أُمِّ كُرْزٍ قَالَتْ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «أَقِرُّوا الطَّيْرَ عَلَى مَكِنَاتِهَا» . قَالَتْ: وَسَمِعْتُهُ يَقُولُ: «عَنِ الْغُلَامِ شَاتَانِ وَعَنِ الْجَارِيَةِ شَاةٌ وَلَا يَضُرُّكُمْ ذُكْرَانًا كُنَّ أَوْ إِنَاثًا» . رَوَاهُ أَبُو دَاوُد وللترمذي وَالنَّسَائِيّ من قَوْله: يَقُول: «عَن الْغُلَام» إِلَّا آخِره وَقَالَ التِّرْمِذِيّ: هَذَا صَحِيح","english":{"narrator":"","text":"Umm Kurz told that she heard God’s messenger say, “Let the birds stay in their roosts.”* She told that she also heard him say, “Two sheep are to be sacrificed for a boy and one for a girl, but it does you no harm whether they are male or female.” \n*Either that they are not to be molested, or that they are not to be disturbed for the purpose of taking omens.\n\nAbu Dawud transmitted it. Tirmidhi and Nasa’i transmit it from “two sheep” to the end, Tirmidhi saying this is a sahih tradition."}},{"id":88,"idInBook":88,"chapterId":20,"bookId":14,"arabic":"وَعَن الحسنِ عَن سَمُرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْغُلَامُ مُرْتَهَنٌ بِعَقِيقَتِهِ تُذْبَحُ عَنْهُ يَوْمَ السَّابِعِ وَيُسَمَّى وَيُحْلَقُ رَأْسُهُ» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالنَّسَائِيُّ لَكِنْ فِي رِوَايَتِهِمَا «رَهِينَةٌ» بدل «مرتهنٌ» وَفِي رِوَايَة لِأَحْمَد وَأبي دَاوُد: «وَيُدْمَى» مَكَانَ: «وَيُسَمَّى» وَقَالَ أَبُو دَاوُدَ: «وَيُسَمَّى» أصحُّ","english":{"narrator":"","text":"Al-Hasan quoted Samura who reported God’s messenger as saying, \"A boy is in pledge for his ‘aqiqa. Sacrifice is made for him on the seventh day, he is given a name and his head is shaved.” \n\nAhmad, Tirmidhi, Abu Dawud and Nasa’i transmitted it, but the last two have “a pledge” for “in pledge.” A version by Ahmad and Abu Dawud has “is smeared with blood” 1 in place of “is given a name.” Abu Dawud says th at “is given a name” is sounder."}},{"id":89,"idInBook":89,"chapterId":20,"bookId":14,"arabic":"وَعَنْ مُحَمَّدِ بْنِ عَلِيِّ بْنِ حُسَيْنٍ عَنْ عَليّ بن أبي طَالب قَالَ: عَقَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ الْحَسَنِ بِشَاةٍ وَقَالَ: «يَا فَاطِمَةُ احْلِقِي رَأْسَهُ وَتَصَدَّقِي بِزِنَةِ شَعْرِهِ فِضَّةً» فَوَزَنَّاهُ فَكَانَ وَزْنُهُ دِرْهَمًا أَوْ بَعْضَ دِرْهَمٍ. رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ وَإِسْنَادُهُ لَيْسَ بِمُتَّصِلٍ لِأَنَّ مُحَمَّدَ بْنَ عَلِيِّ بْنِ حُسَيْنٍ لَمْ يُدْرِكْ عَلِيَّ بْنَ أَبِي طَالِبٍ","english":{"narrator":"","text":"Muhammad b. ‘All b. Husain quoted ‘Ali b. Abu Talib as saying that God’s messenger sacrificed a sheep on the seventh day for al-Hasan and said, “Shave his head, Fatima, and give the weight of his hair in silver as sadaqa.” So they weighed it and it amounted to a dirham or part of a dirham. \n\nTirmidhi transmitted it, saying this is a hasan gharib tradition, but its isnad is not fully connected because Muhammad b. ‘Ali b. Husain was not born in the time of ‘Ali b. Abu Talib."}},{"id":90,"idInBook":90,"chapterId":20,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَقَّ عَنِ الْحَسَنِ وَالْحُسَيْنِ كَبْشًا كَبْشًا. رَوَاهُ أَبُو دَاوُدَ وَعِنْدَ النَّسَائِيِّ: كبشين كبشين","english":{"narrator":"","text":"Ibn ‘Abbas told that God’s messenger sacrificed a ram on the seventh day for both al-Hasan and al-Husain. \n\nAbu Dawud transmitted it. Nasa’i says two rams each."}},{"id":91,"idInBook":91,"chapterId":20,"bookId":14,"arabic":"وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ: سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ الْعَقِيقَةِ فَقَالَ: «لَا يُحِبُّ اللَّهُ الْعُقُوقَ» كَأَنَّهُ كَرِهَ الِاسْمَ وَقَالَ: «مَنْ وُلِدَ لَهُ وَلَدٌ فَأَحَبَّ أَنْ يَنْسِكَ عَنْهُ فَلْيَنْسِكْ عَنِ الْغُلَامِ شَاتَيْنِ وَعَنِ الْجَارِيَةِ شَاةً» . رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ","english":{"narrator":"","text":"'Amr b. Shu'aib, on his father's authority, said his grandfather told that God’s messenger was asked about the ‘aqiqa and replied, “God does not like the breaking of ties (‘uquq),” as though he disliked the name. And he said, “If anyone has a child born to him and wishes to offer a sacrifice on its behalf, he may offer two sheep for a boy and one for a girl. \n\nAbu Dawud and Nasa’i transmitted it."}},{"id":92,"idInBook":92,"chapterId":20,"bookId":14,"arabic":"وَعَن أبي رافعٍ قَالَ: رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أذَّنَ فِي أُذُنِ الحسنِ ابنِ عليٍّ حِينَ وَلَدَتْهُ فَاطِمَةُ بِالصَّلَاةِ. رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ. وَقَالَ التِّرْمِذِيُّ: هَذَا حَيْثُ حسن صَحِيح","english":{"narrator":"","text":"Abu Rafi' told th at he saw God's messenger uttering the call to prayer in the ear of al-Hasan b. ‘Ali when Fatima gave birth to him.\n\nTirmidhi and Abu Dawud transmitted it, Tirmidhi saying this is a hasan sahih tradition."}},{"id":93,"idInBook":93,"chapterId":20,"bookId":14,"arabic":"عَن بُريدةَ قَالَ: كُنَّا فِي الْجَاهِلَيَّةِ إِذَا وُلِدَ لِأَحَدِنَا غلامٌ ذَبَحَ شاةٌ ولطَّخَ رأسَه بدمه فَلَمَّا جَاءَ الْإِسْلَامُ كُنَّا نَذْبَحُ الشَّاةَ يَوْمَ السَّابِعِ وَنَحْلِقُ رَأْسَهُ وَنُلَطِّخُهُ بِزَعْفَرَانٍ. رَوَاهُ أَبُو دَاوُد وَزَاد رزين: ونُسمِّيه","english":{"narrator":"Buraida said:","text":"When a boy was born to one of us in the pre-Islamic period he sacrificed a sheep and smeared his head with its blood; but when Islam came we sacrificed a sheep on the seventh day, shaved his head and smeared it with saffron. \n\nAbu Dawud transmitted it, and Razin added, “and gave him his name.”"}}],"chapter":{"id":20,"bookId":14,"arabic":"كتاب الصيد والذبائح","english":"Game and Animals Which May Be Slaughtered"}}