{"metadata":{"length":135,"arabic":{"title":"مشكاة المصابيح","author":"الإمام الكاتب التبريزي","introduction":"كتاب الأطعمة"},"english":{"title":"Mishkat al-Masabih","author":"Al-Khatib Al-Tabrizi","introduction":"Foods"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":21,"bookId":14,"arabic":"عَن عمر بن أبي سَلمَة قَالَ: كُنْتُ غُلَامًا فِي حِجْرِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَانَتْ يَدِي تَطِيشُ فِي الصفحة. فَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ «سم الله وكل يَمِينك وكل مِمَّا يليك»","english":{"narrator":"‘Umar b. Abu Salama said:","text":"I was a boy under the protection of God’s messenger, and as my hand used to roam at large in the dish he said to me, “Mention God’s name, eat with your right hand, and eat from what is next you.” \n\n(Bukhari and Muslim.)"}},{"id":2,"idInBook":2,"chapterId":21,"bookId":14,"arabic":"وَعَن حُذَيْفَة قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ الشَّيْطَانَ يَسْتَحِلُّ الطَّعَامَ أَنْ لَا يُذْكَرَ اسْم الله عَلَيْهِ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Hudhaifa reported God’s messenger as saying, “The devil considers food lawful for him when God’s name is not mentioned over it.” \n\nMuslim transmitted it."}},{"id":3,"idInBook":3,"chapterId":21,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" إِذَا دَخَلَ الرَّجُلُ بَيْتَهُ فَذَكَرَ اللَّهَ عِنْدَ دُخُولِهِ وَعِنْدَ طَعَامِهِ قَالَ الشَّيْطَانُ: لَا مَبِيتَ لَكُمْ وَلَا عَشَاءَ وَإِذَا دَخَلَ فَلَمْ يَذْكُرِ اللَّهَ عِنْدَ دُخُولِهِ قَالَ الشَّيْطَانُ: أَدْرَكْتُمُ الْمَبِيتَ وَإِذَا لَمْ يَذْكُرِ اللَّهَ عِنْدَ طَعَامِهِ قَالَ: أَدْرَكْتُمُ الْمَبِيتَ وَالْعَشَاءَ \". رَوَاهُ مُسلم","english":{"narrator":"","text":"Jabir reported God’s messenger as saying that when a man enters his house and mentions God’s name on entering and when at his food, the devil says, “You* have no place to spend the night and no evening meal; ” but when he enters without mentioning God’s name on entering the devil says, “You have found a place to spend the night; ” and when he does not mention God at his food he says, “You have found a place to spend the night and an evening meal.” \n*The pronoun is plural. The devil is said to be addressing his assistants.\n\nMuslim transmitted it."}},{"id":4,"idInBook":4,"chapterId":21,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا أَكَلَ أَحَدُكُمْ فَلْيَأْكُلْ بِيَمِينِهِ وَإِذَا شَرِبَ فَلْيَشْرَبْ بِيَمِينِهِ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Ibn ‘Umar reported God’s messenger as saying, “When any of you eats he should eat with his right hand, and when he drinks he should drink with his right hand.” \n\nMuslim transmitted it."}},{"id":5,"idInBook":5,"chapterId":21,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَأْكُلَنَّ أَحَدُكُمْ بِشِمَالِهِ وَلَا يَشْرَبَنَّ بِهَا فَإِنَّ الشَّيْطَانَ يَأْكُلُ بِشِمَالِهِ وَيَشْرَبُ بهَا» . رَوَاهُ مُسلم","english":{"narrator":"","text":"He reported God’s messenger as saying, “None of you must ever eat or drink with his left hand, for the devil eats and drinks with his left hand.” \n\nMuslim transmitted it."}},{"id":6,"idInBook":6,"chapterId":21,"bookId":14,"arabic":"وَعَنْ كَعْبِ بْنِ مَالِكٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْكُلُ بِثَلَاثَةِ أَصَابِعَ وَيَلْعَقُ يَدَهُ قَبْلَ أَن يمسحها. رَوَاهُ مُسلم","english":{"narrator":"","text":"Ka'b b. Malik said that God's messenger used to eat with three fingers and lick his hand before wiping it. \n\nMuslim transmitted it."}},{"id":7,"idInBook":7,"chapterId":21,"bookId":14,"arabic":"وَعَنْ جَابِرٌ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ بِلَعْقِ الْأَصَابِعِ وَالصَّفْحَةِ وَقَالَ: \n\" إِنَّكُمْ لَا تَدْرُونَ: فِي أَيَّهِ الْبَرَكَةُ؟ \". رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"Jabir said the Prophet ordered people to lick their fingers and the dish, saying, “You do not know in what portion blessing lies.” \n\nMuslim transmitted it."}},{"id":8,"idInBook":8,"chapterId":21,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا أَكَلَ أَحَدُكُمْ فَلَا يمسحْ يدَه حَتَّى يلعقها أَو يلعقها»","english":{"narrator":"","text":"Ibn ‘Abbas reported the Prophet as saying, “When one of you eats he must not wipe his hand till he licks it, or gives it to someone to lick.” \n\n(Bukhari and Muslim.)"}},{"id":9,"idInBook":9,"chapterId":21,"bookId":14,"arabic":"وَعَن جَابر قَالَ: النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: \n\" إِنَّ الشَّيْطَانَ يَحْضُرُ أَحَدَكُمْ عِنْدَ كُلِّ شَيْءٍ مِنْ شَأْنِهِ حَتَّى يَحْضُرَهُ عِنْدَ طَعَامِهِ فَإِذَا سَقَطَتْ من أحدكُم لقْمَة فَلْيُمِطْ مَا كَانَ بِهَا مِنْ أَذًى ثُمَّ ليأكلها وَلَا يَدعهَا للشَّيْطَان فَإِذا فرع فليلعق أصَاب فَإِنَّهُ لَا يَدْرِي: فِي أَيِّ طَعَامِهِ يَكُونُ الْبركَة؟ \". رَوَاهُ مُسلم","english":{"narrator":"","text":"Jabir told that he heard the Prophet say, “The devil is present with one of you in everything he does, even being present when he is at food; so if any of you drops a mouthful he should wipe away anything injurious on it and eat it and not leave it for the devil; and when he finishes he should lick his fingers, for he does not know in what part of the food the blessing lies.” \n\nMuslim transmitted it."}},{"id":10,"idInBook":10,"chapterId":21,"bookId":14,"arabic":"وَعَن أبي جُحَيْفَة قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «لَا آكل مُتكئا» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Abu Juhaifa reported the Prophet as saying, “I do not eat reclining.” \n\nBukhari transmitted it."}},{"id":11,"idInBook":11,"chapterId":21,"bookId":14,"arabic":"وَعَن قَتَادَة عَنْ أَنَسٍ قَالَ: مَا أَكَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى خِوَانٍ وَلَا فِي سُكُرَّجَةٍ وَلَا خُبِزَ لَهُ مُرَقَّقٌ قِيلَ لِقَتَادَةَ: على مَ يَأْكُلُون؟ قَالَ: على السّفر. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Qatada quoted Anas as saying that the Prophet never ate at a low table or from a small bowl* and that thin bread was not baked for him. Qatada was asked what they ate off and replied that it was off leather cloths. \n*This would have indicated pride throngh keeping himself apart, or niggardliness.\n\nBukhari transmitted it."}},{"id":12,"idInBook":12,"chapterId":21,"bookId":14,"arabic":"وَعَن أنس قَالَ: مَا أَعْلَمُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى رَغِيفًا مُرَقَّقًا حَتَّى لَحِقَ بِاللَّهِ وَلَا رَأَى شَاةً سَمِيطًا بِعَيْنِهِ قَطُّ. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Anas said he was not aware of the Prophet having seen a thin loaf till he met God,  nor did he ever see with his eye a sheep roasted in its skin. \n\nBukhari transmitted it."}},{"id":13,"idInBook":13,"chapterId":21,"bookId":14,"arabic":"وَعَن سهل بن سعد قَالَ: مَا رَأَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ النَّقِيَّ مِنْ حِينِ ابْتَعَثَهُ اللَّهُ حَتَّى قَبَضَهُ اللَّهُ وَقَالَ: مَا رَأَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُنْخُلًا مِنْ حِين ابتعثهُ الله حَتَّى قبضَهُ قِيلَ: كَيْفَ كُنْتُمْ تَأْكُلُونَ الشَّعِيرَ غَيْرَ مَنْخُولٍ؟ قَالَ: كُنَّا نَطْحَنُهُ وَنَنْفُخُهُ فَيَطِيرُ مَا طَارَ وَمَا بَقِي ثريناه فأكلناه. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Sahl b. Sa‘d said that God’s messenger never saw white bread from the time God commissioned him till God took him. He also said that God's messenger did not see a sieve from the time God commissioned him till God took him. He was asked how they could eat unsifted barley and replied that they ground it and blew it, and when some of it had flown away they moistened and ate what was left. \n\nBukhari transmitted it."}},{"id":14,"idInBook":14,"chapterId":21,"bookId":14,"arabic":"وَعَن أبي هُرَيْرَة قَالَ: مَا عَابَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طَعَامًا قَطُّ إِنِ اشْتَهَاهُ أَكَلَهُ وَإِنْ كرهه تَركه","english":{"narrator":"","text":"Abu Huraira said that the Prophet never expressed disapproval of food; if he desired it he ate it and if he disliked it he left it alone.\n\n(Bukhari and Muslim.)"}},{"id":15,"idInBook":15,"chapterId":21,"bookId":14,"arabic":"وَعَنْهُ أَنَّ رَجُلًا كَانَ يَأْكُلُ أَكْلًا كَثِيرًا فَأَسْلَمَ فَكَانَ يَأْكُلُ قَلِيلًا فَذَكَرَ ذَلِكَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «إِنَّ الْمُؤْمِنَ يَأْكُلُ فِي مِعًى وَاحِدٍ وَالْكَافِرُ يَأْكُلُ فِي سبعةِ أمعاء» . رَوَاهُ البُخَارِيّ.\nوَرَوَى مُسْلِمٌ عَنْ أَبِي مُوسَى وَابْنِ عُمَرَ الْمسند مِنْهُ فَقَط.\nوَفِي أُخْرَى لَهُ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ضَافَهُ ضَيْفٌ وَهُوَ كَافِرٌ فَأَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِشَاةٍ فَحُلِبَتْ فَشَرِبَ حِلَابَهَا ثُمَّ أُخْرَى فَشَرِبَهُ ثُمَّ أُخْرَى فَشَرِبَهُ حَتَّى شَرِبَ حِلَابَ سَبْعِ شِيَاهٍ ثُمَّ إِنَّهُ أَصْبَحَ فَأَسْلَمَ فَأَمَرَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِشَاةٍ فَحُلِبَتْ فَشَرِبَ حِلَابَهَا ثُمَّ أَمَرَ بِأُخْرَى فَلَمْ يَسْتَتِمَّهَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْمُؤْمِنُ يَشْرَبُ فِي مِعًى وَاحِدٍ وَالْكَافِرُ يشربُ فِي سَبْعَة أمعاء»","english":{"narrator":"","text":"He told that a man who used to eat a great amount accepted Islam and began to eat little. When that was mentioned to the Prophet he said, “The believer eats in one intestine but the infidel in seven.”*\n*This is explained as a figure of speech to indicate the greed of the infidel and the lack of greed on the part of the believer.\n\nBukhari transmitted it. Muslim transmitted on the authority of Abu Musa and Ibn ‘Umar only the part which quotes the Prophet. In another version by him on the authority of Abu Huraira it says that a man who was an infidel was entertained by God’s messenger. He ordered a sheep to be milked and the man drank what was drawn from it, then another and he drank it, then another and he drank it, till he had drunk the milk drawn from seven sheep. In the morning the man accepted Islam and God’s messenger ordered a sheep to be milked for him . When he had drunk what was drawn from it he ordered another to be milked, but when he did not finish all the milk God’s messenger said, “ The believer drinks in one intestine, but the infidel drinks in seven.”"}},{"id":16,"idInBook":16,"chapterId":21,"bookId":14,"arabic":"وَعَنْهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «طَعَامُ الِاثْنَيْنِ كَافِي الثلاثةِ وطعامِ الثلاثةِ كَافِي الْأَرْبَعَة»","english":{"narrator":"","text":"He reported God’s messenger as saying, “Two people’s food is enough for three and three people’s is enough for four.” \n\n(Bukhari and Muslim.)"}},{"id":17,"idInBook":17,"chapterId":21,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «طَعَامُ الْوَاحِدِ يَكْفِي الِاثْنَيْنِ وَطَعَامُ الِاثْنَيْنِ يَكْفِي الْأَرْبَعَةَ وَطَعَامُ الْأَرْبَعَةِ يَكْفِي الثمانيَة» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Jabir told of hearing God's messenger say, “One person’s food is enough for two, two persons’ food is enough for four, and four persons' food is enough for eight.” \n\nMuslim transmitted it."}},{"id":18,"idInBook":18,"chapterId":21,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «التَّلْبِينَةُ مُجِمَّةٌ لِفُؤَادِ الْمَرِيضِ تَذْهَبُ بِبَعْض الْحزن»","english":{"narrator":"","text":"‘A’isha told that she heard God’s messenger say, “Talbina* gives rest to an invalid’s heart and removes some of his grief.” \n*A kind of gruel made of flour or bran and milk, sometimes having honey mixed with it.\n\n(Bukhari and Muslim.)"}},{"id":19,"idInBook":19,"chapterId":21,"bookId":14,"arabic":"وَعَنْ أَنَسٍ أَنَّ خَيَّاطًا دَعَا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِطَعَامٍ صَنَعَهُ فَذَهَبْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَرَّبَ خُبْزَ شَعِيرٍ وَمَرَقًا فِيهِ دُبَّاءُ وَقَدِيدٌ فَرَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَتَبَّعُ الدُّبَّاءَ مِنْ حَوَالَيِ الْقَصْعَةِ فَلَمْ أَزَلْ أُحِبُّ الدباءَ بعد يومِئذٍ","english":{"narrator":"Anas said:","text":"A tailor invited the Prophet to a meal which he had prepared and I went along with the Prophet. He presented barley bread and soup containing pumpkin and dried sliced meat, and I saw the Prophet going after the pumpkin round the dish, so I have always liked pumpkin since that day. \n\n(Bukhari and Muslim.)"}},{"id":20,"idInBook":20,"chapterId":21,"bookId":14,"arabic":"وَعَن عَمْرو بنِ أُميَّةَ أَنَّهُ رَأَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يحتزمن كتف الشَّاة فِي يَدِهِ فَدُعِيَ إِلَى الصَّلَاةِ فَأَلْقَاهَا وَالسِّكِّينَ الَّتِي يَحْتَزُّ بِهَا ثُمَّ قَامَ فَصَلَّى وَلَمْ يتَوَضَّأ","english":{"narrator":"","text":"‘Amr b. Umayya told that he saw the Prophet cutting slices from a shoulder of mutton in his hand. He was summoned to prayer, and after throwing it and the knife with which he was slicing it away, he stood up and prayed without performing ablution. \n\n(Bukhari and Muslim.)"}},{"id":21,"idInBook":21,"chapterId":21,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُحِبُّ الْحَلْوَاء وَالْعَسَل. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"‘A’isha said God's messenger liked sweetmeats and honey. \n\nBukhari transmitted it."}},{"id":22,"idInBook":22,"chapterId":21,"bookId":14,"arabic":"وَعَنْ جَابِرٌ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَأَلَ أَهْلَهُ الْأُدْمَ. فَقَالُوا: مَا عِنْدَنَا إِلَّا خَلٌّ فَدَعَا بِهِ فَجَعَلَ يَأْكُلُ بِهِ وَيَقُولُ: «نِعْمَ الْإِدَامُ الْخَلُّ نِعْمَ الْإِدَامُ الْخَلُّ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Jabir told th at when the Prophet asked his family for condiments and was told that they had only vinegar, he called for it and as he was using it in his food he said, “Vinegar is a good condiment; vinegar is a good condiment.” \n\nMuslim transmitted it."}},{"id":23,"idInBook":23,"chapterId":21,"bookId":14,"arabic":"وَعَن سعيد بنِ زيدٍ قَالَ: قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْكَمْأَةُ مِنَ الْمَنِّ وَمَاؤُهَا شِفَاءٌ لِلْعَيْنِ» . مُتَّفَقٌ عَلَيْهِ. وَفِي رِوَايَةٍ لِمُسْلِمٍ: «مِنَ الْمَنِّ الَّذِي أنزلَ اللَّهُ تَعَالَى على مُوسَى عَلَيْهِ السَّلَام»","english":{"narrator":"","text":"Sa'id b. Zaid reported the Prophet as saying, “Truffles are a kind of manna, and their juice is a medicine for the eye.” \n\n(Bukhari and Muslim.) A version by Muslim has, “a kind of the manna which God most high sent down to Moses.”"}},{"id":24,"idInBook":24,"chapterId":21,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ قَالَ: رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْكُلُ الرُّطَبَ بِالْقِثَّاءِ","english":{"narrator":"","text":"‘Abdallah b. Ja'far told that he saw God’s messenger eating fresh dates with cucumber. \n\n(Bukhari and Muslim.)"}},{"id":25,"idInBook":25,"chapterId":21,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: كُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَرِّ الظَّهْرَانِ نَجْنِي الْكَبَاثَ فَقَالَ: «عَلَيْكُم بالأسْوَدِ مِنْهُ فإِنَّه أَطْيَبُ» فَقِيلَ: أَكُنْتَ تَرْعَى الْغَنَمَ؟ قَالَ: «نَعَمْ وهلْ منْ نبيٍّ إِلاَّ رعاها؟»","english":{"narrator":"","text":"Jabir told that when they were with God’s messenger at Marr az-Zahran and were plucking the fruit of the arak tree he said, “Keep to its black ones, for they are the most pleasant.” He was asked if he had shepherded sheep and replied, “Yes; has there been a prophet who did not shepherd them?” \n\n(Bukhari and Muslim.)"}},{"id":26,"idInBook":26,"chapterId":21,"bookId":14,"arabic":"وَعَن أنس قَالَ: رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُقْعِيًا يَأْكُلُ تَمْرًا وَفِي رِوَايَةٍ: يَأْكُلُ مِنْهُ أكلا ذريعا. رَوَاهُ مُسلم","english":{"narrator":"","text":"Anas told that he saw the Prophet squatting and eating dates. A version says he was eating some quickly. \n\nMuslim transmitted it."}},{"id":27,"idInBook":27,"chapterId":21,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَقْرِنَ الرَّجُلُ بَيْنَ التَّمْرَتَيْنِ حَتَّى يستأذِنَ أَصْحَابه","english":{"narrator":"","text":"Ibn ‘Umar said God’s messenger prohibited anyone taking two dates together before asking permission from his companions. \n\n(Bukhari and Muslim.)"}},{"id":28,"idInBook":28,"chapterId":21,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يَجُوعُ أَهْلُ بَيْتٍ عِنْدَهُمُ التَّمْرُ» . وَفِي رِوَايَةٍ: قَالَ: «يَا عَائِشَةُ بَيْتٌ لَا تَمْرَ فِيهِ جِيَاعٌ أَهْلُهُ» قَالَهَا مَرَّتَيْنِ أَوْ ثَلَاثًا. رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"‘A’isha reported the Prophet as saying, “A family which has dates will not be hungry.” A version reports him as saying twice or three times, “A family which has no dates, ‘A’isha, will be hungry.” \n\nMuslim transmitted it."}},{"id":29,"idInBook":29,"chapterId":21,"bookId":14,"arabic":"وَعَن سعدٍ قَالَ: سمعتُ رسولَ الله يَقُولُ: «مَنْ تَصَبَّحَ بِسَبْعِ تَمَرَاتٍ عَجْوَةٍ لَمْ يضرَّه ذَلِك الْيَوْم سم وَلَا سحر»","english":{"narrator":"","text":"Sa‘d told of hearing God’s messenger say, “He who has a morning meal of seven 'ajwa* dates will not suffer harm that day through poison or magic.\" \n*The name of a good quality of Medina dates.\n\n(Bukhari and Muslim.)"}},{"id":30,"idInBook":30,"chapterId":21,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ فِي عَجْوَةِ الْعَالِيَةِ شِفَاءً وَإِنَّهَا تِرْيَاقٌ أَوَّلَ البكرة» . رَوَاهُ مُسلم","english":{"narrator":"","text":"‘A’isha reported God’s messenger as saying, \"The 'ajwa dates of al-‘Aliya* contain healing, and they are an antidote first thing in the morning.\" \n*A name applied to some villages a few miles east of Medina.\n\nMuslim transmitted it."}},{"id":31,"idInBook":31,"chapterId":21,"bookId":14,"arabic":"وَعَنْهَا قَالَتْ: كَانَ يَأْتِي عَلَيْنَا الشَّهْرُ مَا نُوقِدُ فِيهِ نَارًا إِنَّمَا هُوَ التَّمْرُ وَالْمَاءُ إِلَّا أَنْ يُؤْتَى بِاللُّحَيْمِ","english":{"narrator":"","text":"She said that sometimes a month would come in which they did not kindle a fire,  having only dates and water, unless a little meat was brought. \n\n(Bukhari and Muslim.)"}},{"id":32,"idInBook":32,"chapterId":21,"bookId":14,"arabic":"وَعَنْهَا قَالَتْ: مَا شَبِعَ آلُ مُحَمَّدٍ يَوْمَيْنِ مِنْ خُبْزِ بُرٍّ إِلَّا وَأَحَدُهُمَا تمر","english":{"narrator":"","text":"She said Muhammad’s family did not have a full meal of wheaten bread on two successive days, but would have dates on one of them.\n\n(Bukhari and Muslim.)"}},{"id":33,"idInBook":33,"chapterId":21,"bookId":14,"arabic":"وَعَنْهَا قَالَتْ: تُوُفِّيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَا شَبِعْنَا مِنَ الأسودين","english":{"narrator":"","text":"She said that up to the death of God’s messenger they did not have a full meal of dates and water.  \n\n(Bukhari and Muslim.)"}},{"id":34,"idInBook":34,"chapterId":21,"bookId":14,"arabic":"وَعَن النّعمانِ بن بشيرٍ قَالَ: أَلَسْتُمْ فِي طَعَامٍ وَشَرَابٍ مَا شِئْتُمْ؟ لَقَدْ رَأَيْتُ نَبِيَّكُمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَا يَجِدُ مِنَ الدَّقَلِ مَا يَمْلَأُ بَطْنَهُ. رَوَاهُ مُسلم","english":{"narrator":"An-Nu‘man b. Bashir said:","text":"Do you not have the food and drink you desire? I have seen your Prophet unable to get enough poor dates to fill his belly. \n\nMuslim transmitted it."}},{"id":35,"idInBook":35,"chapterId":21,"bookId":14,"arabic":"وَعَن أَيُّوب قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أُتِيَ بِطَعَامٍ أَكَلَ مِنْهُ وَبَعَثَ بِفَضْلِهِ إِلَيَّ وَإِنَّهُ بَعَثَ إِلَيَّ يَوْمًا بِقَصْعَةٍ لمْ يأكُلْ مِنْهَا لأنَّ فِيهَا ثُومًا فَسَأَلْتُهُ: أَحْرَامٌ هُوَ؟ قَالَ: «لَا وَلَكِنْ أَكْرَهُهُ مِنْ أَجْلِ رِيحِهِ» . قَالَ: فَإِنِّي أَكْرَهُ مَا كرهْت. رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Ayyub said that when food was brought to the Prophet he ate some of it and sent him what was left over. One day when he sent him a dish from which he had eaten nothing because it contained garlic, he asked him whether it was unlawful and he replied, “No; but I dislike it because of its odour;” so he said, “I dislike what you dislike.\" \n\nMuslim transmitted it."}},{"id":36,"idInBook":36,"chapterId":21,"bookId":14,"arabic":"وَعَنْ جَابِرٌ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ أَكَلَ ثُومًا أَوْ بَصَلًا فَلْيَعْتَزِلْنَا» أَوْ قَالَ: «فَلْيَعْتَزِلْ مَسْجِدَنَا أَوْ لِيَقْعُدْ فِي بَيْتِهِ» . وَإِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُتِيَ بِقِدْرٍ فِيهِ خَضِرَاتٌ مِنْ بُقُولٍ فَوَجَدَ لَهَا رِيحًا فَقَالَ: «قَرِّبُوهَا» إِلَى بَعْضِ أَصْحَابِهِ وَقَالَ: «كُلْ فَإِنِّي أُنَاجِي مَنْ لَا تُناجي»","english":{"narrator":"","text":"Jabir reported the Prophet as saying, “He who eats garlic or onions must keep away from us.” Or he said, “must keep away from our mosque,” or, “must sit in his house.” A pot containing green vegetables was brought to the Prophet, but on noticing that it had an odour he told them to give it to one of his Companions, to whom he said, \"Eat, for I hold intimate converse with one with whom you do not.\"*\n*The reference is here said to be to angels, or particularly to Gabriel. Cf. Mirqat, iv, 373\n\n(Bukhari and Muslim.)"}},{"id":37,"idInBook":37,"chapterId":21,"bookId":14,"arabic":"وَعَن المِقدامِ بن معدي كرب عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «كيلوا طَعَامك يُبَارك لكم فِيهِ» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Al-Miqdam b. Ma'dikarib reported the Prophet as saying, “If you measure out your food* you will be blessed in it.\" \n*This is said to refer to such matters as buying and selling, and taking care that suitable portions are given to one’s children.\n\nBukhari transmitted it."}},{"id":38,"idInBook":38,"chapterId":21,"bookId":14,"arabic":"وَعَنْ أَبِي أُمَامَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا رَفَعَ مَائِدَتَهُ قَالَ: «الْحَمْدُ لِلَّهِ حَمْدًا كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ غَيْرَ مَكْفِيٍّ وَلَا مُوَدَّعٍ وَلَا مُسْتَغْنًى عَنْهُ رَبُّنَا» . رَوَاهُ الْبُخَارِيُّ","english":{"narrator":"","text":"Abu Umama told that when the Prophet's cloth* was removed he said, \"Praise be to God abundantly and sincerely, of such a nature as is productive of blessing, is not insufficient, abandoned, or ignored, O our Lord.\" \n*The word ma'ida means a piece of leather or some other material spread on the ground for the food, and it comes to mean the food itself. It is often translated ‘table’, but this is misleading with reference to the early days of Islam.\n\nBukhari transmitted it."}},{"id":39,"idInBook":39,"chapterId":21,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ اللَّهَ تَعَالَى لَيَرْضَى عنِ العبدِ أنْ يأكلَ الأكلَةَ فيحمدُه عَلَيْهِ أَوْ يَشْرَبَ الشَّرْبَةَ فَيَحْمَدَهُ عَلَيْهَا» . رَوَاهُ مُسْلِمٌ وسنذكرُ حَدِيثي عائشةَ وَأبي هريرةَ: مَا شَبِعَ آلُ مُحَمَّدٍ وَخَرَجَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنَ الدُّنْيَا فِي «بَابِ فَضْلِ الْفُقَرَاءِ» إِنْ شَاءَ اللَّهُ تَعَالَى","english":{"narrator":"","text":"Anas reported God’s messenger as saying, “God most high is pleased when a man eats something and praises Him for it, or drinks something and praises Him for it.\" \n\nMuslim transmitted it."}},{"id":40,"idInBook":40,"chapterId":21,"bookId":14,"arabic":"عَن أبي أَيُّوب قَالَ: كُنَّا عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُرِّبَ طَعَامٌ فَلَمْ أَرَ طَعَامًا كَانَ أَعْظَمَ بَرَكَةً مِنْهُ أَوَّلَ مَا أَكَلْنَا وَلَا أَقَلَّ بَرَكَةً فِي آخِرِهِ قُلْنَا: يَا رَسُولَ اللَّهِ كَيْفَ هَذَا؟ قَالَ: «إِنَّا ذَكَرْنَا اسْمَ اللَّهِ عَلَيْهِ حِينَ أَكَلْنَا ثُمَّ قَعَدَ مَنْ أَكَلَ وَلَمْ يُسَمِّ اللَّهَ فَأَكَلَ مَعَهُ الشَّيْطَانُ» . رَوَاهُ فِي شرح السّنة","english":{"narrator":"Abu Ayyub said:","text":"We were with the Prophet when food was presented to him, and I never saw food which had greater blessing when we began to eat, or less when we finished. We asked God’s messenger how that was, and he replied, “We mentioned God’s name when we ate, then one who ate sat down without mentioning God's name and the devil ate with him.” \n\nIt is transmitted in Sharh as-sunna."}},{"id":41,"idInBook":41,"chapterId":21,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" إِذَا أَكَلَ أَحَدُكُمْ فَنَسِيَ أَنْ يَذْكُرَ اللَّهَ عَلَى طَعَامِهِ فَلْيَقُلْ: بِسْمِ اللَّهِ أوَّلَه وآخرَه \". رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد","english":{"narrator":"","text":"‘A’isha reported God’s messenger as saying, “When one of you eats and forgets to mention God over his food he should say, ‘In the name of God at the beginning and at the end of it’.” \n\nTirmidhi and Abu Dawud transmitted it."}},{"id":42,"idInBook":42,"chapterId":21,"bookId":14,"arabic":"وَعَن أُميَّةَ بن مَخْشِيٍّ قَالَ: كَانَ رَجُلٌ يَأْكُلُ فَلَمْ يُسَمِّ حَتَّى لَمْ يَبْقَ مِنْ طَعَامِهِ إِلَّا لُقْمَةٌ فَلَمَّا رَفَعَهَا إِلَى فِيهِ قَالَ: بِسْمِ اللَّهِ أَوَّلَهُ وَآخِرَهُ فَضَحِكَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ قَالَ: «مَا زَالَ الشَّيْطَانُ يَأْكُلُ مَعَهُ فَلَمَّا ذَكَرَ اسْمَ اللَّهِ اسْتَقَاءَ مَا فِي بَطْنه» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Umayya b. Makhshi told that a man who was eating and had not mentioned God’s name said when he raised the last morsel to his mouth, “In the name of God at the beginning and at the end of it.” The Prophet laughed and said, “The devil kept eating along with him, but when he mentioned God’s name he vomited what was in his belly.”\n\nAbu Dawud transmitted it."}},{"id":43,"idInBook":43,"chapterId":21,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا فَرَغَ مِنْ طَعَامِهِ قَالَ: «الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنَا وَسَقَانَا وَجَعَلَنَا مُسْلِمِينَ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْن مَاجَه","english":{"narrator":"","text":"Abu Sa'id al-Khudri told that when God’s messenger finished his food he said, “Praise be to God who has given us food and drink and made us Muslims.” \n\nTirmidhi, Abu Dawud and Ibn Majah transmitted it."}},{"id":44,"idInBook":44,"chapterId":21,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الطَّاعِمُ الشَّاكِرُ كَالصَّائِمِ الصابر» . رَوَاهُ التِّرْمِذِيّ\nوَابْن مَاجَهْ وَالدَّارِمِيُّ عَنْ سِنَانِ بْنِ سَنَّةَ عَنْ أَبِيه","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “The one who eats and is grateful is like the one who fasts and shows endurance.”\n\nTirmidhi transmitted it, and Ibn Majah and Darimi transmitted it on the authority of Sinan b. Sanna on his father’s authority."}},{"id":45,"idInBook":45,"chapterId":21,"bookId":14,"arabic":"وَعَن أبي أيوبٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَكَلَ أَوْ شَرِبَ قَالَ: «الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَ وَسَقَى وَسَوَّغَهُ وَجَعَلَ لَهُ مخرجا» رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Abu Ayyub told that when God’s messenger ate or drank he said, “Praise be to God who has given food and drink, made it easy to swallow, and provided an exit for it.” \n\nAbu Dawud transmitted it."}},{"id":46,"idInBook":46,"chapterId":21,"bookId":14,"arabic":"وَعَن سلمانَ قَالَ: قَرَأْتُ فِي التَّوْرَاةِ أَنَّ بَرَكَةَ الطَّعَامِ الْوُضُوءُ بَعْدَهُ فَذَكَرْتُ ذَلِكَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «بَرَكَةُ الطَّعَامِ الْوُضُوءُ قَبْلَهُ وَالْوُضُوءُ بعدَه» . رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد","english":{"narrator":"","text":"Salman said he read in the Torah that the blessing of food consists in ablution after it, and when he mentioned that to the Prophet he said, “The blessing of food consists in ablution before it and ablution after it.” \n\nTirmidhi and Abu Dawud transmitted it."}},{"id":47,"idInBook":47,"chapterId":21,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ مِنَ الْخَلَاءِ فَقُدِّمَ إِلَيْهِ طَعَامٌ فَقَالُوا: أَلَا نَأْتِيكَ بِوَضُوءٍ؟ قَالَ: «إِنَّمَا أُمِرْتُ بِالْوُضُوءِ إِذَا قُمْتُ إِلَى الصَّلَاةِ» . رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد وَالنَّسَائِيّ\nوَرَوَاهُ ابْن مَاجَه عَن أبي هُرَيْرَة","english":{"narrator":"","text":"Ibn ‘Abbas told that when food was presented to the Prophet or, his coming out from the privy and he was asked whether they should bring him water for ablution, he replied, “I have been commanded to perform ablution only when I get up for prayer.” \n\nTirmidhi, Abu Dawud and Nasa’i transmitted it, and Ibn Majah transmitted it on Abu Huraira’s authority."}},{"id":48,"idInBook":48,"chapterId":21,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أَنَّهُ أُتِيَ بِقَصْعَةٍ مِنْ ثَرِيدٍ فَقَالَ: «كُلُوا مِنْ جَوَانِبِهَا وَلَا تَأْكُلُوا مِنْ وَسَطِهَا فَإِنَّ الْبَرَكَةَ تَنْزِلُ فِي وَسَطِهَا» . رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ حسن صَحِيح","english":{"narrator":"","text":"Ibn ‘Abbas told that the Prophet was brought a dish containing tharid* and said, “Eat from its sides and not from the middle, for the blessing descends in the middle of it.” \n*Bread crumbled and mixed with soup which may have pieces of meat in it.\n\nTirmidhi, Ibn Majah and Darimi transmitted it, Tirmidhi saying this is a hasan sahih tradition. In Abu Dawud’s version he said, “When one of you eats he must not eat from the top of the dish, but from the bottom, for the blessing descends from the top of it.”"}},{"id":49,"idInBook":49,"chapterId":21,"bookId":14,"arabic":"وَعَن عبد الله بن عَمْرو قَالَ: مَا رُئِيَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْكُلُ مُتَّكِئًا قَطُّ وَلَا يَطَأُ عقبه رجلَانِ. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"“Abdallah b. 'Amr said God’s messenger was never seen reclining while eating, nor walking with two men at his heels. \n\nAbu Dawud transmitted it."}},{"id":50,"idInBook":50,"chapterId":21,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ بْنِ جَزْءٍ قَالَ: أَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِخُبْزٍ وَلَحْمٍ وَهُوَ فِي الْمَسْجِدِ فَأَكَلَ وَأَكَلْنَا مَعَهُ ثُمَّ قَامَ فَصَلَّى وَصَلَّيْنَا مَعَهُ وَلَمْ نَزِدْ عَلَى أَنْ مَسَحْنَا أَيْدِيَنَا بِالْحَصْبَاءِ. رَوَاهُ ابْن مَاجَه","english":{"narrator":"‘Abdallah b. al-Harith b. Jaz’ said:","text":"God’s messenger was brought some bread and meat when he was in the mosque, and he ate and we ate along with him. He then stood up and prayed and we prayed along with him, doing no more than wiping our hands with pebbles. \n\nIbn Majah transmitted it."}},{"id":51,"idInBook":51,"chapterId":21,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: أَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِلَحْمٍ فَرُفِعَ إِلَيْهِ الذِّرَاعُ وَكَانَتْ تُعْجِبُهُ فَنَهَسَ مِنْهَا. رَوَاهُ التِّرْمِذِيُّ وَابْن مَاجَه","english":{"narrator":"","text":"Abu Huraira told that God’s messenger was brought some meat, and when the foreleg, which was a part he liked, was offered to him he took a bite of it. \n\nTirmidhi and Ibn Majah transmitted it."}},{"id":52,"idInBook":52,"chapterId":21,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَقْطَعُوا اللَّحْمَ بِالسِّكِّينِ فَإِنَّهُ مِنْ صُنْعِ الْأَعَاجِمِ وَانْهَسُوهُ فَإِنَّهُ أَهْنَأُ وَأَمْرَأُ» . رَوَاهُ أَبُو دَاوُدَ وَالْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَانِ وَقَالا: ليسَ هُوَ بِالْقَوِيّ","english":{"narrator":"","text":"‘A’isha reported God’s messenger as saying, “Do not cut meat with a knife, for it is a foreign practice, but bite it, for that is more beneficial and wholesome.” \n\nAbu Dawud and Baihaqi, in Shu'ab al-iman, transmitted it, both saying it is not strong."}},{"id":53,"idInBook":53,"chapterId":21,"bookId":14,"arabic":"وَعَن أُمِّ المنذِر قَالَتْ: دَخَلَ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَعَهُ عَلِيٌّ وَلَنَا دَوَالٍ مُعَلَّقَةٌ فَجَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْكُلُ وَعَلِيٌّ مَعَهُ يَأْكُلُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَعَلِيٍّ: «مَهْ يَا عَلِيُّ فَإِنَّكَ نَاقِهٌ» قَالَتْ: فَجَعَلْتُ لَهُمْ سِلْقًا وَشَعِيرًا فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَا عَلِيُّ مِنْ هَذَا فَأَصِبْ فَإِنَّهُ أَوْفَقُ لَكَ» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَابْنُ مَاجَهْ","english":{"narrator":"Umm al-Mundhir said:","text":"God’s messenger came in to visit me accompanied by ‘Ali when we had some ripening dates hung up. He began to eat, and ‘Ali along with him, but God’s messenger said to ‘Ali, “Stop, Ali, for you are convalescing.” I then prepared some beetroot and barley for them and the Prophet said, “Take some of this, ‘Ali, for it will be more beneficial for you.” \n\nAhmad, Tirmidhi and Ibn Majah transmitted it."}},{"id":54,"idInBook":54,"chapterId":21,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُعْجِبُهُ الثُّفْلُ. رَوَاهُ التِّرْمِذِيُّ وَالْبَيْهَقِيُّ فِي شعب الْإِيمَان","english":{"narrator":"","text":"Anas said God’s messenger liked what was at the bottom of the pot.* \n*Mirqat, iv, 381 has quite a long discussion of the meaning of thufl. It means 'dregs', or 'what sinks to the bottom'. The preference for the meaning in the translation above is said to \"be either because what is in the bottom of the pot is cooked longer and so is better than the rest, or because the Prophet liked others to be served first. It is also suggested that here thufl means tharid.\n\nTirmidhi and Baihaqi, in Shu'ab al-iman, transmitted it."}},{"id":55,"idInBook":55,"chapterId":21,"bookId":14,"arabic":"وَعَن نُبَيْشَة عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ أَكَلَ فِي قَصْعَةٍ فَلَحَسَهَا اسْتَغْفَرَتْ لَهُ الْقَصْعَةُ» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ غَرِيب","english":{"narrator":"","text":"Nubaisha reported God’s messenger as saying, “If anyone eats from a dish and licks it, the dish will ask forgiveness for him.” \n\nAhmad, Tirmidhi, Ibn Majah and Darimi transmitted it, Tirmidhi saying this is a gharib tradition."}},{"id":56,"idInBook":56,"chapterId":21,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ بَاتَ وَفِي يَدِهِ غَمَرٌ لَمْ يَغْسِلْهُ فَأَصَابَهُ شَيْءٌ فَلَا يَلُومَنَّ إِلَّا نَفْسَهُ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْن مَاجَه","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “If anyone spends the night with grease on his hand which he has not washed away, he can blame only himself if some trouble comes to him.” \n\nTirmidhi, Abu Dawud and Ibn Majah transmitted it."}},{"id":57,"idInBook":57,"chapterId":21,"bookId":14,"arabic":"وَعَن ابنِ عبَّاسٍ قَالَ: كَانَ أَحَبَّ الطَّعَامَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الثَّرِيدُ مِنَ الْخُبْزِ والثريدُ منَ الحَيسِ. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Ibn ‘Abbas said the food God’s messenger liked best was tharid made from bread and tharid made from hais.  \n\nAbu Dawud transmitted it."}},{"id":58,"idInBook":58,"chapterId":21,"bookId":14,"arabic":"وَعَن أبي أُسَيدٍ الْأَنْصَارِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «كَلُوا الزَّيْتَ وَادَّهِنُوا بِهِ فَإِنَّهُ مِنْ شَجَرَةٍ مُبَارَكَةٍ» . رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ","english":{"narrator":"","text":"Abu Usaid al-Ansari reported God’s messenger as saying, “Eat olive oil and anoint yourselves with it, for it comes from a blessed tree.”\n\nTirmidhi, Ibn Majah and Darimi transmitted it."}},{"id":59,"idInBook":59,"chapterId":21,"bookId":14,"arabic":"وَعَن أم هَانِئ قَالَتْ: دَخَلَ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «أَعِنْدَكِ شَيْءٌ» قُلْتُ: لَا إِلَّا خُبْزٌ يَابِسٌ وَخَلٌّ فَقَالَ: «هَاتِي مَا أَقْفَرَ بَيْتٌ مِنْ أَدَمٍ فِيهِ خَلٌّ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ","english":{"narrator":"Umm Hani’ said:","text":"The Prophet came in to visit me and asked whether I had anything. When I replied that I had nothing but some dry bread and vinegar he said, “Produce it; a house in which there is vinegar is not devoid of condiments.” \n\nTirmidhi transmitted it, saying this is a hasan gharib tradition."}},{"id":60,"idInBook":60,"chapterId":21,"bookId":14,"arabic":"وَعَنْ يُوسُفَ بْنِ عَبْدِ اللَّهِ بْنِ سَلَامٍ قَالَ: رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخَذَ كِسْرَةً مِنْ خُبْزِ الشَّعِيرِ فَوَضَعَ عَلَيْهَا تَمْرَةً فَقَالَ: «هَذِهِ إِدَامُ هَذِهِ» وَأَكَلَ. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Yusuf b. ‘Abdallah b. Salam said he saw the Prophet take a piece of barley bread and put a date on it. Saying, “This is the condiment of this,” he ate it. \n\nAbu Dawud transmitted it."}},{"id":61,"idInBook":61,"chapterId":21,"bookId":14,"arabic":"وَعَن سعدٍ قَالَ: مَرِضْتُ مَرَضًا أَتَانِي النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعُودُنِي فَوَضَعَ يَدَهُ بَيْنَ ثَدْيِيَّ حَتَّى وَجَدْتُ بَرْدَهَا عَلَى فُؤَادِي وَقَالَ: «إِنَّكَ رجلٌ مفْؤودٌ ائْتِ الْحَارِثَ بْنَ كَلَدَةَ أَخَا ثَقِيفٍ فَإِنَّهُ رجل يتطبب فليأخذ سبع تمرات منم عَجْوَةِ الْمَدِينَةِ فَلْيَجَأْهُنَّ بِنَوَاهُنَّ ثُمَّ لِيَلُدَّكَ بِهِنَّ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"Sa‘d said:","text":"When I was ill the Prophet came to visit me, and putting his hand between my nipples so that I felt its coolness on my heart, he said, “You are suffering from a heart disease. Go to al-Harith b. Kalada who belongs to Thaqif, for he practices medicine, and get him to take seven of the 'ajwa dates of Medina and pound them together with their stones, then administer them to you.” \n\nAbu Dawud transmitted it."}},{"id":62,"idInBook":62,"chapterId":21,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَأْكُلُ الْبِطِّيخَ بِالرُّطَبِ. رَوَاهُ التِّرْمِذِيُّ وَزَادَ أَبُو دَاوُدَ: وَيَقُولُ: «يَكْسِرُ حَرَّ هَذَا بِبَرْدِ هَذَا وَبَرْدَ هَذَا بِحَرِّ هَذَا» . وَقَالَ التِّرْمِذِيّ: هَذَا حَدِيث حسن غَرِيب","english":{"narrator":"","text":"‘A’isha said the Prophet used to eat melon with fresh dates.\n\nTirmidhi transmitted it. Abu Dawud added that he used to say, “The heat of the one is broken by the coolness of the other, and the coolness of the one by the heat of the other.” Tirmidhi said this is a hasan gharib tradition."}},{"id":63,"idInBook":63,"chapterId":21,"bookId":14,"arabic":"وَعَن أَنَسٍ قَالَ: أَتَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِتَمْرٍ عَتِيقٍ فَجَعَلَ يُفَتِّشُهُ وَيُخْرِجُ السُّوسَ مِنْهُ. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Anas told that when the Prophet was brought some old dates he began to examine them and remove the worms from them. \n\nAbu Dawud transmitted it."}},{"id":64,"idInBook":64,"chapterId":21,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: أَتَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِجُبُنَّةٍ فِي تَبُوكَ فَدَعَا بالسكين فسمَّى وقطَعَ. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Ibn ‘Umar told that when the Prophet was brought a piece of  cheese in Tabuk he called for a knife, and after mentioning God’s name, he cut it. \n\nAbu Dawud transmitted it."}},{"id":65,"idInBook":65,"chapterId":21,"bookId":14,"arabic":"وَعَنْ سَلْمَانَ قَالَ: سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ السَّمْنِ وَالْجُبْنِ وَالْفِرَاءِ فَقَالَ: «الْحَلَالُ مَا أَحَلَّ اللَّهُ فِي كِتَابِهِ وَالْحَرَامُ مَا حَرَّمَ اللَّهُ فِي كِتَابِهِ وَمَا سَكَتَ عَنْهُ فَهُوَ مِمَّا عَفَا عَنْهُ» . رَوَاهُ ابْنُ مَاجَهْ وَالتِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ غَرِيبٌ وموقوفٌ على الأصحِّ","english":{"narrator":"","text":"Salman told that when God’s messenger was questioned about clarified butter, cheese and wild asses he replied, “What is lawful is what God has declared lawful in His Book, what is unlawful is what God has declared unlawful in His Book, and what He has said nothing about belongs to the things He ignores.”\n\nIbn Majah and Tirmidhi transmitted it, Tirmidhi saying this is a gharib tradition which, according to the soundest opinion, is mauquf."}},{"id":66,"idInBook":66,"chapterId":21,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «وَدِدْتُ أَنَّ عِنْدِي خُبزةً بيضاءَ منْ بُرَّةٍ سَمْرَاءَ مُلَبَّقَةً بِسَمْنٍ وَلَبَنٍ» فَقَامَ رَجُلٌ مِنَ الْقَوْمِ فَاتَّخَذَهُ فَجَاءَ بِهِ فَقَالَ: «فِي أَيِّ شَيْءٍ كَانَ هَذَا؟» قَالَ فِي عُكَّةِ ضَبٍّ قَالَ: «ارْفَعْهُ» . رَوَاهُ أَبُو دَاوُدَ وَابْنُ مَاجَهْ وَقَالَ أَبُو دَاوُد: هَذَا حَدِيث مُنكر","english":{"narrator":"","text":"Ibn ‘Umar reported God's messenger as saying, “I wish I had a white loaf made from tawny wheat and softened with clarified butter and milk.” A man who was present rose up and getting one brought it. He asked what it had been in, and when he was told it had been in a lizard skin, he told him to take it away. \n\nAbu Dawud and Ibn Majah transmitted it, Abu Dawud saying this is a tradition which is rejected."}},{"id":67,"idInBook":67,"chapterId":21,"bookId":14,"arabic":"وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَن أَكْلِ الثُّومِ إِلَّا مَطْبُوخًا. رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُد","english":{"narrator":"","text":"‘Ali said God’s messenger forbade eating garlic unless it was cooked.\n\nTirmidhi and Abu Dawud transmitted it."}},{"id":68,"idInBook":68,"chapterId":21,"bookId":14,"arabic":"وَعَن أبي زيادٍ قَالَ: سُئلتْ عائشةُ عَنِ الْبَصَلِ فَقَالَتْ: إِنَّ آخِرَ طَعَامٍ أَكَلَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طَعَامُ فِيهِ بصل. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Abu Ziyad told that when he asked ‘A’isha about onions she replied that the last food God’s messenger ate was some which contained onions.\n\nAbu Dawud transmitted it."}},{"id":69,"idInBook":69,"chapterId":21,"bookId":14,"arabic":"وَعَن ابْنيْ بُسرٍ السُّلَمِيَّين قَالَا: دَخَلَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَدَّمْنَا زُبْدًا وَتَمْرًا وَكَانَ يُحِبُّ الزبدَ والتمرِ. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"The two Sulami sons of Busr* told that when God’s messenger came in to visit them they offered him butter and dates, for he liked butter and dates. \n*These are said to have been 'Abdallah and'Atlya. But each is called Mizini. Ibn Abd al-Barr, Ist'iab, p. 67, mentions Busr as-Sulami, saying he is also called al-Mazini. Tahdhib, v, 158 calls ‘Abdallah al-Mazini al-Qaisi and vii, 223 calls 'Atiya al-Mazini al-Hilali.\n\nAbu Dawud transmitted it."}},{"id":70,"idInBook":70,"chapterId":21,"bookId":14,"arabic":"وَعَنْ عِكْرَاشِ بْنِ ذُؤَيْبٍ قَالَ: أُتِينَا بِجَفْنَةٍ كَثِيرَة من الثَّرِيدِ وَالْوَذْرِ فَخَبَطْتُ بِيَدِي فِي نَوَاحِيهَا وَأَكَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ بَيْنِ يَدَيْهِ فَقَبَضَ بِيَدِهِ الْيُسْرَى عَلَى يَدِيَ الْيُمْنَى ثُمَّ قَالَ: «يَا عِكْرَاشُ كُلْ مِنْ مَوْضِعٍ وَاحِدٍ فَإِنَّهُ طَعَامٌ وَاحِدٌ» . ثُمَّ أَتَيْنَا بِطَبَقٍ فِيهِ أَلْوَانُ التَّمْرِ فَجَعَلْتُ آكُلُ مِنْ بَيْنِ يَدَيَّ وَجَالَتْ يَدُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الطبقِ فَقَالَ: «يَا عِكْرَاشُ كُلْ مِنْ حَيْثُ شِئْتَ فَإِنَّهُ غَيْرُ لَوْنٍ وَاحِدٍ» ثُمَّ أَتَيْنَا بِمَاءٍ فَغَسَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَيْهِ وَمسح بَلل كَفَّيْهِ وَجْهَهُ وَذِرَاعَيْهِ وَرَأْسَهُ وَقَالَ: «يَا عِكْرَاشُ هَذَا الْوُضُوءُ مِمَّا غَيَّرَتِ النَّارُ» . رَوَاهُ التِّرْمِذِيُّ","english":{"narrator":"‘Ikrash b. Dhu’aib said:","text":"We were brought a platter with a large amount of tharid and slices of boneless meat and I plunged in my hand in all directions, but God’s messenger ate what was in front of him. He seized my right hand with his left and said, “Eat from one place, Ikrash, for it is all one kind of food.” Afterwards we were brought a plate containing various kinds of dates and I began to eat what was.in front of me while God’s messenger’s hand went round in the plate. He then said, “Eat where you wish, ‘Ikrash, for it is not all one kind.” Next water was brought to us and when God’s messenger had washed his hands and wiped his face, forearms and head with the moisture on the palms of his hands, he said, “This, ‘Ikrash, is the ablution for what has been changed by fire.”\n\nTirmidhi transmitted it."}},{"id":71,"idInBook":71,"chapterId":21,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَخَذَ أَهْلَهُ الْوَعْكُ أَمَرَ بِالْحَسَاءِ فصُنعَ ثمَّ أَمر فَحَسَوْا مِنْهُ وَكَانَ يَقُولُ: «إِنَّهُ لَيَرْتُو فُؤَادُ الحزين ويسرو عَن فؤاد السقيم كَمَا تسروا إِحْدَاكُنَّ الْوَسَخَ بِالْمَاءِ عَنْ وَجْهِهَا» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ","english":{"narrator":"","text":"‘A’isha said that when his family were exhausted by fever God’s messenger ordered some hasa’* to be prepared and then ordered them to sip some of it; and he used to say, “It heartens the sad and clears the heart of the invalid as one of you clears dirt away from her face with water.” \n*A kind of soap made of flour, water and either oil or clarified butter.\n\nTirmidhi transmitted it, saying this is a hasan sahih tradition."}},{"id":72,"idInBook":72,"chapterId":21,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْعَجْوَةُ مِنَ الْجَنَّةِ وَفِيهَا شِفَاءٌ مِنَ السُّمِّ وَالْكَمْأَةُ مِنَ الْمَنِّ وماؤُها شفاءٌ للعينِ» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “The 'ajwa dates come from paradise and contain a cure for poison; truffles are a kind of manna and their juice is a medicine for the eye.” \n\nTirmidhi transmitted it."}},{"id":73,"idInBook":73,"chapterId":21,"bookId":14,"arabic":"عَن المغيرةِ بن شعبةَ قَالَ: ضِفْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ لَيْلَةٍ فَأَمَرَ بِجَنْبٍ فَشُوِيَ ثُمَّ أَخَذَ الشَّفْرَةَ فَجَعَلَ يَحُزُّ لِي بِهَا مِنْهُ فَجَاءَ بِلَالٌ يُؤْذِنُهُ بِالصَّلَاةِ فَأَلْقَى الشَّفْرَةَ فَقَالَ: «مَا لَهُ تَرِبَتْ يَدَاهُ؟» قَالَ: وَكَانَ شارِبُه وَفَاء فَقَالَ لي: «أُقْصُّه عَلَى سِوَاكٍ؟ أَوْ قُصَّهُ عَلَى سِوَاكٍ» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"Al-Mughira b. ‘Shu'ba said:","text":"I was a guest one night along with God's messenger and he ordered a haunch to be roasted, then took a broad knife and began to cut off slices for me. Bilal then came to tell him the time for prayer had come, and he threw down the knife saying, “What is the m atter with him! May his hands be covered with dust!”* My moustache was long, so he said, “I shall clip it for you over a tooth-stick,” or, “Clip it over a tooth-stick.”\n*Taribat yadahu. I have here translated the phrase literally, but cf. p. 658. It is not normally to be taken literally. In this tradition the Prophet is evidently displeased because the call to prayer has been made so soon, but it should not be understood that he is calling down a curse on Bilal. In its use here it may indicate some degree of displeasure, but nothing more.\n\nTirmidhi transmitted it*"}},{"id":74,"idInBook":74,"chapterId":21,"bookId":14,"arabic":"وَعَن حُذيفةَ قَالَ: كُنَّا إِذَا حَضَرْنَا مَعَ النَّبِيِّ صَلَّى الله عَلَيْهِ وَسلم لَمْ نَضَعْ أَيْدِيَنَا حَتَّى يَبْدَأُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَيَضَعُ يَدَهُ وَإِنَّا حَضَرْنَا مَعَهُ مَرَّةً طَعَامًا فَجَاءَتْ جَارِيَةٌ كَأَنَّهَا تُدْفَعُ فَذَهَبَتْ لِتَضَعَ يَدَهَا فِي الطَّعَامِ فَأَخَذَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِيَدِهَا ثُمَّ جَاءَ أَعْرَابِيٌّ كَأَنَّمَا يُدْفَعُ فَأَخَذَهُ بِيَدِهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ الشَّيْطَانَ يَسْتَحِلُّ الطَّعَامَ أَنْ لَا يُذْكَرَ اسمُ اللَّهِ عليهِ وإِنَّه جَاءَ بِهَذِهِ الْجَارِيَةِ لِيَسْتَحِلَّ بِهَا فَأَخَذْتُ بِيَدِهَا فَجَاءَ بِهَذَا الْأَعْرَابِيِّ لِيَسْتَحِلَّ بِهِ فَأَخَذْتُ بِيَدِهِ وَالَّذِي نَفْسِي بِيَدِهِ إِنَّ يَدَهُ فِي يَدِي مَعَ يَدِهَا» . زَادَ فِي رِوَايَةٍ: ثُمَّ ذَكَرَ اسمَ اللَّهِ وأكَلَ. رَوَاهُ مُسلم","english":{"narrator":"Hudhaifa said:","text":"When we were at food with the Prophet we did not put in our hands till he had put his in first. Once when we were at food with him a girl came in as though she were being impelled and was about to put her hand in the food when God’s messenger seized her by the hand. Then a nomadic Arab came in as though he were being impelled and he seized his hand. God’s messenger then said, “The devil considers food lawful when God’s name is not mentioned over it, and he brought this girl th at it might be lawful by means of her, so I seized her hand; then he brought this nomadic Arab that it might be lawful by means of him, so I seized his hand. By Him in whose hand my soul is, the devil’s hand is in mine along with hers.” He added in a version, ‘Then he mentioned God’s name and ate.’\n\nMuslim transmitted it."}},{"id":75,"idInBook":75,"chapterId":21,"bookId":14,"arabic":"عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرَادَ أَنْ يَشْتَرِيَ غُلَامًا فَأَلْقَى بَيْنَ يَدَيْهِ تَمْرًا فَأَكَلَ الْغُلَامُ فَأَكْثَرَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ كَثْرَةَ الْأَكْلِ شُؤْمٌ» . وَأَمَرَ بِرَدِّهِ. رَوَاهُ الْبَيْهَقِيُّ فِي شعب الْإِيمَان","english":{"narrator":"","text":"‘A'isha told that God’s messenger wanted to buy a young slave, so he threw some dates in front of him, but when the youth ate greedily he said, “Voracious eating is ominous,” and ordered him to be sent back.\n\nBaihaqi transmitted it in Shu‘ab al-iman."}},{"id":76,"idInBook":76,"chapterId":21,"bookId":14,"arabic":"وَعَنْ أَنَسِ بْنِ مَالِكٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «سَيِّدُ إِدَامِكُمُ الْمِلْحُ» . رَوَاهُ ابْنُ مَاجَهْ","english":{"narrator":"","text":"Anas b. Malik reported God’s messenger as saying, “The lord of your condiment is salt.”*\n*Probably meaning that salt is necessary to make food palatable, while other condiments are extras.\n\nIbn Majah transmitted it."}},{"id":77,"idInBook":77,"chapterId":21,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا وُضِعَ الطَّعَامُ فَاخْلَعُوا نِعَالَكُمْ فإِنَّه أرْوَحُ لأقدامكم»","english":{"narrator":"","text":"He reported God’s messenger as saying, \"When food is set down take off your sandals, for it gives more rest to your feet.\""}},{"id":78,"idInBook":78,"chapterId":21,"bookId":14,"arabic":"وَعَن أسماءَ بنتِ أبي بكرٍ: أَنَّهَا كَانَتْ إِذَا أَتَيْتُ بِثَرِيدٍ أَمَرَتْ بِهِ فَغُطِّيَ حَتَّى تَذْهَبَ فَوْرَةُ دُخَانِهِ وَتَقُولُ: أَنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُول: «هُوَ أعظم للبركة» . رَوَاهُمَا الدَّارمِيّ","english":{"narrator":"","text":"Asma’ daughter of Abu Bakr told that when she was brought tharid she ordered it to be covered until the force of its steam had gone, saying she had heard God’s messenger say it is more effective in producing a blessing. \n\nDarimi transmitted the two traditions."}},{"id":79,"idInBook":79,"chapterId":21,"bookId":14,"arabic":"وَعَن نُبَيْشَة قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" مَنْ أَكَلَ فِي قَصْعَةٍ ثُمَّ لَحِسَهَا تَقُولُ لَهُ الْقَصْعَةُ: أَعْتَقَكَ اللَّهُ مِنَ النَّارِ كَمَا أعتقتَني منَ الشيطانِ \". رَوَاهُ رزين","english":{"narrator":"","text":"Nubaisha reported God’s messenger as saying, “If anyone eats from a dish and licks it, the dish will express to him the wish that God may free him from hell as he has freed it from the devil.” \n\nRazin transmitted it."}},{"id":80,"idInBook":80,"chapterId":21,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيُكْرِمْ ضَيْفَهُ وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلَا يُؤْذِ جَارَهُ وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيَقُلْ خَيْرًا أَوْ لِيَصْمُتْ» . وَفِي رِوَايَةٍ: بَدَلَ «الْجَارِ» وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيَصِلْ رحِمَه \"","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, \"He who believes in God and the last day should honour his guest; he who believes in God and the last day should not annoy his neighbour ; and he who believes in God and the last day should say what is good, or keep silent.\" In a version instead of speaking of the neighbour he said, \"He who believes in God and the last day should join ties of relationship.\"\n\n(Bukhari and Muslim.)"}},{"id":81,"idInBook":81,"chapterId":21,"bookId":14,"arabic":"وَعَنْ أَبِي شُرَيْحٍ الْكَعْبِيِّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيُكْرِمْ ضَيْفَهُ جَائِزَتُهُ يَوْمٌ وَلَيْلَةٌ وَالضِّيَافَةُ ثَلَاثَةُ أَيَّامٍ فَمَا بَعْدَ ذَلِكَ فَهُوَ صَدَقَةٌ وَلَا يَحِلُّ لَهُ أَنْ يَثْوِيَ عِنْدَهُ حَتَّى يُحَرِّجَهُ»","english":{"narrator":"","text":"Abu Shuraih al-Ka'bi reported God's messenger as saying, \"He who believes in God and the last day should honour his guest. Provisions for the road are what will serve for a day and a night; hospitality extends for three days ; what goes beyond that is sadaqa ; and it is not allowable that a guest should stay till he makes himself an encumbrance.'' \n\n(Bukhari and Muslim.)"}},{"id":82,"idInBook":82,"chapterId":21,"bookId":14,"arabic":"وَعَنْ عُقْبَةَ بْنِ عَامِرٍ قَالَ: قَلْتُ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" إِنَّك تبعثنا فتنزل بِقَوْمٍ لَا يُقْرُونَنَا فَمَا تَرَى؟ فَقَالَ لَنَا: «إِنْ نَزَلْتُمْ بِقَوْمٍ فَأَمَرُوا لَكُمْ بِمَا يَنْبَغِي لِلضَّيْفِ فَاقْبَلُوا فَانْ لَمْ يَفْعَلُوا فَخُذُوا مِنْهُمْ حق الضَّيْف الَّذِي يَنْبَغِي لَهُم»","english":{"narrator":"","text":"'Uqba b. 'Amir told that he said to the Prophet, \"You send us out and we come to people who do not give us hospitality, so what is your opinion?\" He replied, \"If you come to people who order for you what is fitting for a guest accept it; but if they do not, take from them what is fitting for them to give to a guest.\" \n\n(Bukhari and Muslim.)"}},{"id":83,"idInBook":83,"chapterId":21,"bookId":14,"arabic":"وَعَن أبي هريرةَ قَالَ: خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ يَوْم وَلَيْلَة فَإِذَا هُوَ بِأَبِي بَكْرٍ وَعُمَرَ فَقَالَ: «مَا أَخْرَجَكُمَا مِنْ بُيُوتِكُمَا هَذِهِ السَّاعَةَ؟» قَالَا: الْجُوعُ قَالَ: «وَأَنَا وَالَّذِي نَفْسِي بِيَدِهِ لَأَخْرَجَنِي الَّذِي أَخْرَجَكُمَا قُومُوا» فَقَامُوا مَعَهُ فَأَتَى رَجُلًا مِنَ الْأَنْصَارِ فَإِذَا هُوَ لَيْسَ فِي بَيْتِهِ فَلَمَّا رَأَتْهُ المرأةُ قَالَت: مرْحَبًا وَأهلا فَقَالَ لَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَيْنَ فُلَانٌ؟» قَالَتْ: ذَهَبَ يَسْتَعْذِبُ لَنَا مِنَ الْمَاءِ إِذْ جَاءَ الْأَنْصَارِيُّ فَنَظَرَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَصَاحِبَيْهِ ثُمَّ قَالَ: الْحَمْدُ لِلَّهِ مَا أَحَدٌ الْيَوْمَ أكرمَ أضيافاً مني قَالَ: فانطَلَق فَجَاءَهُمْ بِعِذْقٍ فِيهِ بُسْرٌ وَتَمْرٌ وَرُطَبٌ فَقَالَ: كُلُوا مِنْ هَذِهِ وَأَخَذَ الْمُدْيَةَ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِيَّاكَ وَالْحَلُوبَ» فَذَبَحَ لَهُمْ فَأَكَلُوا مِنَ الشَّاةِ وَمِنْ ذَلِكَ الْعِذْقِ وَشَرِبُوا فَلَمَّا أَنْ شَبِعُوا وَرَوُوا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأَبِي بَكْرٍ وَعُمَرَ: «وَالَّذِي نَفْسِي بِيَدِهِ لَتُسْأَلُنَّ عَنْ هَذَا النَّعِيمِ يَوْمَ الْقِيَامَةِ أَخْرَجَكُمْ مِنْ بُيُوتِكُمُ الْجُوعُ ثُمَّ لَمْ تَرْجِعُوا حَتَّى أَصَابَكُمْ هَذَا النعيمُ» . رَوَاهُ مُسلم. وَذَكَرَ حَدِيثَ أَبِي مَسْعُودٍ: كَانَ رَجُلٌ مِنَ الْأَنْصَار فِي «بَاب الْوَلِيمَة»","english":{"narrator":"","text":"Abu Huraira told that when God’s messenger went out one day, or night, he met Abu Bakr and 'Umar and asked them what had brought them out of their houses at that hour. When they replied that it was hunger he said, \"It is the same with me. By Him in whose hand my soul is, what has brought you out has brought me out. Get up.\" They got up and went with him to a man of the Ansar, but he was not at home. When his wife saw him she gave a hearty welcome and God’s messenger asked her where so and so had gone, to which she replied that he had gone to get them some fresh water. At that moment the Ansari appeared, and seeing God’s messenger and his two companions he said, \"Praise be to God! No one has more honourable guests to-day than I.\" He then went and brought them a bunch containing ripening dates, dried dates and fresh dates, and telling them to eat some of that he took his knife. God’s messenger having warned him not to kill an animal which was giving milk, he killed a sheep for them; and after they had eaten of it and of the bunch and drunk to their satisfaction God’s messenger said to Abu Bakr and 'Umar, \"By Him in whose hand my soul is, you 1 will be questioned about this bounty on the day of resurrection. Hunger brought you out of your houses, then you did not return till this bounty came to you.\" \n1. It it noteworthy that the second person pronouns in this and the following sentence are plural although two people are addressed.\n\nMuslim transmitted it. Abu Mas'ud’s tradition, \"One of the Ansar...\" has been mentioned in the chapter on the wedding-feast. 2\n2. See p. 684."}},{"id":84,"idInBook":84,"chapterId":21,"bookId":14,"arabic":"عَن المقدامِ بن معدي كرب سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «أَيُّمَا مُسْلِمٍ ضَافَ قَوْمًا فَأَصْبَحَ الضَّيْفُ مَحْرُومًا كَانَ حَقًّا عَلَى كُلِّ مُسْلِمٍ نَصْرُهُ حَتَّى يَأْخُذَ لَهُ بِقِرَاهُ مِنْ مَالِهِ وَزَرْعِهِ» . رَوَاهُ الدَّارمِيّ وَأَبُو دَاوُد\nوَفِي رِوَايَة: «وَأَيُّمَا رَجُلٍ ضَافَ قَوْمًا فَلَمْ يُقْرُوهُ كَانَ لَهُ أَن يعقبهم بِمثل قراه»","english":{"narrator":"","text":"Al-Miqdam b. Ma'dikarib heard the Prophet say, \"If any Muslim is a guest of people and is given nothing, it is the duty of every Muslim to help him to the extent of taking for him from their property and crops the amount of entertainment he should have received.\"\n\nDarimi and Abu Dawud transmitted it. A version by the latter has, \"If anyone is a guest of people who provide no hospitality for him, he is entitled to take from them the equivalent of the hospitality due him.\""}},{"id":85,"idInBook":85,"chapterId":21,"bookId":14,"arabic":"وَعَنْ أَبِي الْأَحْوَصِ الْجُشَمِيِّ عَنْ أَبِيهِ قَالَ: قُلْتُ: يَا رَسُولَ اللَّهِ أَرَأَيْتَ إِنْ مَرَرْتُ بِرَجُلٍ فَلَمْ يُقِرْنِي وَلَمْ يُضِفْنِي ثُمَّ مَرَّ بِي بَعْدَ ذَلِكَ أَأَقْرِيهِ أَمْ أَجْزِيهِ؟ قَالَ: «بل اقره» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Abul Ahwas al-Jushami quoted his father to the effect that he said, \"Messenger of God, tell me, if I come to a man who gives me no entertainment or hospitality and he afterwards comes to me, shall I give him entertainment or treat him as he treated me?\" He replied, \"No, give him entertainment.\" \n\nTirmidhi transmitted it."}},{"id":86,"idInBook":86,"chapterId":21,"bookId":14,"arabic":"وَعَنْ أَنَسٍ أَوْ غَيْرِهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْتَأْذَنَ عَلَى سَعْدِ بْنِ عُبَادَةَ فَقَالَ: «السَّلَامُ عَلَيْكُمْ وَرَحْمَةُ اللَّهِ» فَقَالَ سَعْدٌ: وَعَلَيْكُمُ السَّلَامُ وَرَحْمَةُ اللَّهِ وَلَمْ يُسْمِعِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى سَلَّمَ ثَلَاثًا وَرَدَّ عَلَيْهِ سَعْدٌ ثَلَاثًا وَلَمْ يُسْمِعْهُ فَرَجَعَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاتَّبَعَهُ سَعْدٌ فَقَالَ: يَا رَسُولَ اللَّهِ بِأَبِي أَنْتَ وَأُمِّي مَا سَلَّمْتَ تَسْلِيمَةً إِلَّا هِيَ بِأُذُنِي: وَلَقَدْ رَدَدْتُ عَلَيْكَ وَلَمْ أُسْمِعْكَ أَحْبَبْتُ أَنْ أَسْتَكْثِرَ مِنْ سَلَامِكَ وَمِنَ الْبَرَكَةِ ثُمَّ دَخَلُوا الْبَيْتَ فَقَرَّبَ لَهُ زَبِيبًا فَأَكَلَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا فَرَغَ قَالَ: «أَكَلَ طَعَامَكُمُ الْأَبْرَارُ وَصَلَّتْ عَلَيْكُمُ الْمَلَائِكَةُ وَأَفْطَرَ عِنْدَكُمُ الصَّائِمُونَ» . رَوَاهُ فِي «شَرْحِ السُّنَّةِ»","english":{"narrator":"","text":"Anas or someone else told that God's messenger asked permission to enter the house of Sa'd b. 'Ubada saying, \"Peace and God's mercy be upon you,\" and Sa'd replied, \"And upon you be peace and God's mercy,\" but did not speak loud enough for the Prophet to hear. He gave the salutation three times and Sa'd responded three times, but did not speak loud enough for him to hear, so the Prophet went away. Sa'd went after him and said, \"Messenger of God, for whom I would give my father and mother as ransom, you did not give a salutation without my hearing it and responding to you, but I did not speak loud enough for you to hear because I wanted to receive many of your salutations and so receive great blessing.\" They then entered the house and he offered him raisins which God's prophet ate. Then when he finished he said, \"May the righteous eat your food, may the angels invoke blessings on you, and may those who have been fasting break their fast with you!\"\n\nIt is transmitted in Sharh as-sunna."}},{"id":87,"idInBook":87,"chapterId":21,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَثَلُ الْمُؤْمِنِ وَمَثَلُ الْإِيمَانِ كَمَثَلِ الْفَرَسِ فِي آخِيَّتِهِ يَجُولُ ثُمَّ يَرْجِعُ إِلَى آخِيَّتِهِ وَإِنَّ الْمُؤْمِنَ يَسْهُو ثُمَّ يَرْجِعُ إِلَى الْإِيمَانِ فَأَطْعِمُوا طَعَامَكُمُ الْأَتْقِيَاءَ وَأَوْلُوا مَعْرُوفَكُمُ الْمُؤْمِنِينَ» . رَوَاهُ الْبَيْهَقِيُّ فِي «شُعَبِ الْإِيمَانِ» وَأَبُو نُعَيْمٍ فِي «الْحِلْية»","english":{"narrator":"","text":"Abu Sa'id reported the Prophet as saying, \"The believer and faith are like a horse with the stake to which it is tethered, which moves round and then returns to its stake, for the believer is negligent and then returns to faith. Feed the pious with your food and confer your kindness on the believers.\" \n\nBaihaqi, in Shu'ab al-iman, and Abu Nu'aim, in al-Hilya, transmitted it."}},{"id":88,"idInBook":88,"chapterId":21,"bookId":14,"arabic":"عَن عبد الله بنِ بُسر قَالَ: كَانَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَصْعَةٌ يَحْمِلُهَا أَرْبَعَةُ رِجَالٍ يُقَالُ لَهَا: الْغَرَّاءُ فَلَمَّا أَضْحَوْا وَسَجَدُوا الضُّحَى أُتِيَ بِتِلْكَ الْقَصْعَةِ وَقَدْ ثُرِدَ فِيهَا فَالْتَفُّوا عَلَيْهَا فَلَمَّا كَثُرُوا جَثَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَعْرَابِيٌّ: مَا هَذِهِ الْجِلْسَةُ؟ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ اللَّهَ جَعَلَنِي عَبْدًا كَرِيمًا وَلَمْ يَجْعَلْنِي جَبَّارًا عَنِيدًا» ثُمَّ قَالَ: «كُلُوا مِنْ جَوَانِبِهَا وَدَعُوا ذِرْوَتَهَا يُبَارَكْ فِيهَا» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"'Abdallah b. Busr told that the Prophet had a dish called al-gharra' 1 which was carried by four men, and when they had offered the forenoon prayer that dish in which tharid had been prepared was brought and the people gathered round it. When they were numerous God's messenger knelt down, and when a nomadic Arab asked what kind of sitting that was, God’s messenger replied, \"God has made me a kindly servant and not a refractory tyrant.\" He then said, \"If you eat from its sides and leave the top a blessing will be conferred on it.\" \n1. Meaning the white one.\n\nAbu Dawud transmitted it."}},{"id":89,"idInBook":89,"chapterId":21,"bookId":14,"arabic":"وَعَنْ وَحْشِيِّ بْنِ حَرْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ: إِنَّ أَصْحَابَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالُوا: يَا رَسُولَ اللَّهِ إِنَّا نَأْكُلُ وَلَا نَشْبَعُ قَالَ: «فَلَعَلَّكُمْ تَفْتَرِقُونَ؟» قَالُوا: نَعَمْ قَالَ: «فَاجْتَمِعُوا عَلَى طَعَامِكُمْ وَاذْكُرُوا اسْمَ اللَّهِ يُباركْ لكم فِيهِ» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Wahshi b. Harb, on his father’s authority, said his grandfather told of God's messenger's Companions saying, \"Messenger of God, we eat but are not satisfied.\" He suggested that they ate separately, and when they replied that that was so he said, \"If you gather together at your food and mention God’s name you will be blessed in it.\" \n\nAbu Dawud transmitted it."}},{"id":90,"idInBook":90,"chapterId":21,"bookId":14,"arabic":"عَنْ أَبِي عَسِيبٍ قَالَ: خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْلًا فَمَرَّ بِي فَدَعَانِي فَخَرَجْتُ إِلَيْهِ ثُمَّ مَرَّ بِأَبِي بَكْرٍ فَدَعَاهُ فَخَرَجَ إِلَيْهِ ثُمَّ مَرَّ بِعُمَرَ فَدَعَاهُ فَخَرَجَ إِلَيْهِ فَانْطَلَقَ حَتَّى دَخَلَ حَائِطًا لِبَعْضِ الْأَنْصَارِ فَقَالَ لِصَاحِبِ الْحَائِطِ: «أَطْعِمْنَا بُسْرًا» فَجَاءَ بِعِذْقٍ فَوَضَعَهُ فَأَكَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَصْحَابُهُ ثُمَّ دَعَا بِمَاءٍ بَارِدٍ فَشَرِبَ فَقَالَ: «لَتُسْأَلُنَّ عَنْ هَذَا النَّعِيمِ يَوْمَ القيامةِ» قَالَ: فَأخذ عمر العذق فَضرب فِيهِ الْأَرْضَ حَتَّى تَنَاثَرَ الْبُسْرُ قَبْلَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ قَالَ: يَا رَسُول الله إِنَّا لمسؤولونَ عَنْ هَذَا يَوْمَ الْقِيَامَةِ؟ قَالَ: «نَعَمْ إِلَّا مِنْ ثَلَاثٍ خِرْقَةٍ لَفَّ بِهَا الرَّجُلُ عَوْرَتَهُ أَوْ كِسْرَةٍ سَدَّ بِهَا جَوْعَتَهُ أَوْ حُجْرٍ يتدخَّلُ فِيهِ مَنِ الْحَرِّ وَالْقُرِّ» . رَوَاهُ أَحْمَدُ وَالْبَيْهَقِيُّ فِي «شعب الْإِيمَان» . مُرْسلا","english":{"narrator":"Abu 'Asib said:","text":"God's messenger went out during the night and when he passed me by and called to me I went out to him. He then passed by Abu Bakr, and when he called him he went out to him. He then passed by 'Umar and when he called him he went out to him. He then set off and when he had entered a garden belonging to one of the Ansar he asked the owner of the garden to give us some ripening dates to eat. He brought a bunch and laid it down, and when he and his companions had eaten he called for some cold water, after drinking which he said, \"You will be questioned about this bounty on the day of resurrection.\" Thereupon 'Umar seized the bunch, and when he had thrown it on the ground so that the ripening dates were scattered towards God’s messenger he said, \"Messenger of God, shall we be questioned about this on the day of resurrection?\" He replied, \"Yes, but not for three things: a rag with which a man covers his private parts, or a crumb with which he allays his hunger, or a shelter 1 into which he warms himself to escape heat and cold.\" \n1. The word is hujr which is basically something forbidden It is then used as a place of protection covered with mud or stone. The following words indicate that something very small is intended. Cf. Mirqat, iv, 397. Pt. 12\n\nAhmad and Baihaqi, in Shu'ab al-iman, transmitted it."}},{"id":91,"idInBook":91,"chapterId":21,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا وُضِعَتِ الْمَائِدَةُ فَلَا يَقُومُ رَجُلٌ حَتَّى تُرْفَعَ الْمَائِدَةُ وَلَا يَرْفَعْ يَدَهُ وَإِنْ شَبِعَ حَتَّى يَفْرُغَ الْقَوْمُ وَلْيُعْذِرْ فَإِنَّ ذَلِكَ يُخْجِلُ جَلِيسَهُ فَيَقْبِضُ يَدَهُ وَعَسَى أَنْ يَكُونَ لَهُ فِي الطَّعَامِ حَاجَةٌ» رَوَاهُ ابْنُ مَاجَهْ وَالْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَانِ","english":{"narrator":"","text":"Ibn ‘Umar reported God’s messenger as saying, \"When the cloth is set down a man must not get up till it is removed, nor must he withdraw his hand even if he has had enough till the people have finished, but if he does he should make his excuse, for that embarrasses his companion and he does not stretch out his hand although he may perhaps require the food.\" \n\nIbn Majah and Baihaqi, in Shu'ab al-iman, transmitted it."}},{"id":92,"idInBook":92,"chapterId":21,"bookId":14,"arabic":"وَعَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَكَلَ مَعَ قَوْمٍ كَانَ آخِرَهُمْ أَكْلًا. رَوَاهُ الْبَيْهَقِيّ فِي «شعب الْإِيمَان» مُرْسلا","english":{"narrator":"","text":"Ja'far b. Muhammad told on his father's authority that when God's messenger ate along with people he was the last to finish eating. \n\nBaihaqi transmitted it in Shu'ab al-iman in mursal form."}},{"id":93,"idInBook":93,"chapterId":21,"bookId":14,"arabic":"وَعَن أَسمَاء بنتِ يزِيد قَالَتْ: أُتِيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِطَعَامٍ فَعَرَضَ عَلَيْنَا فَقُلْنَا: لَا نَشْتَهِيهِ. قَالَ: «لَا تَجْتَمِعْنَ جُوعًا وَكَذِبًا» . رَوَاهُ ابْنُ مَاجَهْ","english":{"narrator":"Asma' daughter of Yazid said:","text":"The Prophet was brought some food which he offered to us, and when we said we did not want it he replied, \"Do not combine falsehood with hunger.\" \n\nIbn Majah transmitted it."}},{"id":94,"idInBook":94,"chapterId":21,"bookId":14,"arabic":"وَعَنْ عُمَرَ بْنِ الْخَطَّابِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «كُلُوا جَمِيعًا وَلَا تَفَرَّقُوا فَإِنَّ الْبَرَكَةَ معَ الجماعةِ» . رَوَاهُ ابْنُ مَاجَهْ","english":{"narrator":"","text":"'Umar b. al-Khattab reported God's messenger as saying, \"Eat together and not separately, for the blessing is associated with the company.\" \n\nIbn Majah transmitted it."}},{"id":95,"idInBook":95,"chapterId":21,"bookId":14,"arabic":"قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مِنَ السَّنَةِ أَنْ يَخْرُجَ الرَّجُلُ مَعَ ضَيْفِهِ إِلَى بَابِ الدَّارِ» . رَوَاهُ ابْن مَاجَه\nوَرَوَاهُ الْبَيْهَقِيُّ فِي «شُعَبِ الْإِيمَانِ» عَنْهُ وَعَنِ ابْن عَبَّاس وَقَالَ: فِي إِسْنَاده ضَعِيف","english":{"narrator":"","text":"Abu Huraira reported God's messenger as saying, \"It is a part of the sunna that a man should accompany his guest to the door of the house.\" \n\nIbn Majah transmitted it, and Baihaqi, in Shu‘ab al-iman, transmitted it on the authority both of Abu Huraira and of Ibn 'Abbas, but said there is a weakness in its isnad."}},{"id":96,"idInBook":96,"chapterId":21,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْخَيْرُ أَسْرَعُ إِلَى الْبَيْتِ الَّذِي يُؤْكَلُ فِيهِ مِنَ الشَّفْرَةِ إِلَى سنامِ الْبَعِير» . رَوَاهُ ابْن مَاجَه","english":{"narrator":"","text":"Ibn 'Abbas reported God’s messenger as saying, \"Good comes more quickly to the house in which food is provided than the knife comes to the camel's hump.\" 1 \n1. This tradition speaks of a hospitable house, the camel’s hump is mentioned because it is the first part of the animal from which meat is cut off, as it is considered the most pleasant part of its meat.\n\nIbn Majah transmitted it."}},{"id":97,"idInBook":97,"chapterId":21,"bookId":14,"arabic":"عَن الفجيع العامري أَنَّهُ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: مَا يَحِلُّ لَنَا مِنَ الْمِيتَةِ؟ قَالَ: «مَا طعامُكم؟» قُلنا: نَغْتَبِقُ وَنَصْطَبِحُ قَالَ أَبُو نُعَيْمٍ: فَسَّرَهُ لِي عُقْبَةُ: قَدَحٌ غُدْوَةً وَقَدَحٌ عَشِيَّةً قَالَ: «ذَاكَ وَأَبِي الْجُوعُ» فَأَحَلَّ لَهُمُ الْمَيْتَةَ عَلَى هَذِهِ الحالِ. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Al-Fujai' al-'Amiri told that he came to the Prophet and asked what animals which had died a natural death might be eaten. He asked what they ate, and on receiving the reply niaghtabiq wa-nastabih, which was explained to Abu Nu'aim by 'Uqba as meaning that they drank a cup in the morning and a cup in the evening, he said, \"That, by my father, is hunger,\" and permitted them in such circumstances to eat what had died a natural death.\n\nAbu Dawud transmitted it."}},{"id":98,"idInBook":98,"chapterId":21,"bookId":14,"arabic":"وَعَنْ أَبِي وَاقِدٍ اللَّيْثِيِّ أَنْ رَجُلًا قَالَ: يَا رَسُولَ اللَّهِ إِنَّا نَكُونُ بِأَرْضٍ فَتُصِيبُنَا بهَا المخصمة فَمَتَى يحلُّ لنا الميتةُ؟ قَالَ: «مَا لم تصطبحوا وتغتبقوا أَوْ تَحْتَفِئُوا بِهَا بَقْلًا فَشَأْنَكُمْ بِهَا» . مَعْنَاهُ: إِذَا لَمْ تَجِدُوا صَبُوحًا أَوْ غَبُوقًا وَلَمْ تَجِدُوا بَقْلَةً تَأْكُلُونَهَا حَلَّتْ لَكُمُ الْمَيْتَةُ. رَوَاهُ الدَّارمِيّ","english":{"narrator":"","text":"Abu Waqid al-Laithi told that a man said, \"Messenger of God, we live in a land where we are afflicted by hunger, so when may we eat animals which have died a natural death?\" He replied, \"As long as you do not have a morning drink or an evening drink or gather vegetables you may eat them,\" meaning that when you do not find a morning drink or an evening drink, or find a vegetable to eat, animals which have died a natural death are allowable to you. \n\nDarimi transmitted it."}},{"id":99,"idInBook":99,"chapterId":21,"bookId":14,"arabic":"عَنْ أَنَسٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَنَفَّسُ فِي الشَّرَابِ ثَلَاثًا. مُتَّفق عَلَيْهِ. وزادَ مسلمُ فِي روايةٍ ويقولُ: «إِنَّه أرْوَى وأبرَأُ وأمرأ»","english":{"narrator":"","text":"Anas said that God's messenger used to breathe three times in the course of a drink. \n\n(Bukhari and Muslim.) In a version Muslim added that he used to say, \"It is more thirst-quenching, healthier and more wholesome.\""}},{"id":100,"idInBook":100,"chapterId":21,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَن الشّرْب من قي السقاء","english":{"narrator":"","text":"Ibn ‘Abbas said God’s messenger forbade drinking from the mouth of a water-skin. \n\n(Bukhari and Muslim.)"}},{"id":101,"idInBook":101,"chapterId":21,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ اخْتِنَاثِ الْأَسْقِيَةِ. زَادَ فِي رِوَايَةٍ: وَاخْتِنَاثُهَا: أَنْ يُقْلَبَ رَأْسُهَا ثُمَّ يُشْرَبَ مِنْهُ","english":{"narrator":"","text":"Abu Sa'id al-Khudri said God’s messenger forbade the ikhtibath of water-skins, adding in a version that this means having their heads inverted and then being drunk from. \n\n(Bukhari and Muslim.)"}},{"id":102,"idInBook":102,"chapterId":21,"bookId":14,"arabic":"وَعَنْ أَنَسٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ نَهَى أَنْ يَشْرَبَ الرَّجُلُ قَائِمًا. رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"Anas said the Prophet forbade that a man should drink standing.\n\nMuslim transmitted it."}},{"id":103,"idInBook":103,"chapterId":21,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَشْرَبَنَّ أَحَدٌ مِنْكُمْ قَائِمًا فَمَنْ نَسِيَ مِنْكُمْ فَلْيَسْتَقِئْ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, \"None of you must drink standing, and if anyone forgets he must vomit.\" \n\nMuslim transmitted it."}},{"id":104,"idInBook":104,"chapterId":21,"bookId":14,"arabic":"وَعَن ابْن عَبَّاس قَالَ: أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِدَلْوٍ مِنْ مَاءِ زَمْزَمَ فَشَرِبَ وَهُوَ قَائِمٌ","english":{"narrator":"","text":"Ibn 'Abbas told that when he brought the Prophet a bucket of Zamzam water he drank it while standing. \n\n(Bukhari and Muslim.)"}},{"id":105,"idInBook":105,"chapterId":21,"bookId":14,"arabic":"وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ: أَنَّهُ صَلَّى الظُّهْرَ ثُمَّ قَعَدَ فِي حَوَائِجِ النَّاسِ فِي رَحَبَةِ الْكُوفَةِ حَتَّى حَضَرَتْ صَلَاةُ الْعَصْرِ ثُمَّ أُتِيَ بِمَاءٍ فَشَرِبَ وَغَسَلَ وَجْهَهُ وَيَدَيْهِ وَذَكَرَ رَأسه وَرجلَيْهِ ثمَّ قَامَ فَشرب فَصله وَهُوَ قَائِمٌ ثُمَّ قَالَ: إِنَّ أُنَاسًا يَكْرَهُونَ الشُّرْبَ قَائِمًا وَإِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَنَعَ مِثْلَ مَا صَنَعْتُ. رَوَاهُ الْبُخَارِيُّ","english":{"narrator":"","text":"‘Ali prayed the noon prayer, then held a session to attend to the people’s needs in the open square of Kufa till the time of the afternoon prayer came. He was then brought water, drank some, washed his face and hands, the transmitter also mentioning his head and his feet, then stood up and drank what was left while standing. He then said, \"Some people disapprove of drinking while standing, but the Prophet did as I have done.\" \n\nBukhari transmitted it."}},{"id":106,"idInBook":106,"chapterId":21,"bookId":14,"arabic":"وَعَنْ جَابِرٌ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَى رَجُلٍ مِنَ الْأَنْصَارِ وَمَعَهُ صَاحِبٌ لَهُ فَسَلَّمَ فَرَدَّ الرَّجُلُ وَهُوَ يُحَوِّلُ الْمَاءَ فِي حَائِطٍ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ كَانَ عِنْدَكَ مَاءٌ بَاتَ فِي شَنَّةٍ وَإِلَّا كَرَعْنَا؟» فَقَالَ: عِنْدِي مَاءٌ بَاتَ فِي شَنٍّ فَانْطَلَقَ إِلَى الْعَرِيشِ فَسَكَبَ فِي قَدَحٍ مَاءً ثُمَّ حَلَبَ عَلَيْهِ مِنْ دَاجِنٍ فَشَرِبَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ أَعَادَ فَشَرِبَ الرَّجُلُ الَّذِي جَاءَ مَعَهُ. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Jabir told that the Prophet went in to visit a man of the Ansar accompanied by one of his companions. He gave a salutation, and the man, who was watering his garden, responded to it. The Prophet said, “If you have any water which has remained overnight in an old skin we should like it, otherwise we shall sip some from a streamlet.” He told him he had water which had been in old skins overnight, then went to the trellis and poured some water into a jug to which he added some milk which he drew from a domestic sheep, and the Prophet drank. He repeated this and the man who had accompanied him drank.\n\nBukhari transmitted it."}},{"id":107,"idInBook":107,"chapterId":21,"bookId":14,"arabic":"وَعَنْ أُمِّ سَلَمَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الَّذِي يَشْرَبُ فِي آنِيَةِ الْفِضَّةِ إِنَّمَا يُجَرْجِرُ فِي بَطْنِهِ نَارَ جَهَنَّمَ» . مُتَّفَقٌ عَلَيْهِ. وَفِي رِوَايَةٍ لِمُسْلِمٍ: «إِنَّ الَّذِي يَأْكُلُ وَيَشْرَبُ فِي آنِية الْفضة وَالذَّهَب»","english":{"narrator":"","text":"Umm Salama reported God’s messenger as saying, “If anyone drinks from silver vessels the fire of jahannam will bubble in his belly.”\n\n(Bukhari and Muslim.) A version by Muslim has, “He who eats and drinks from vessels of silver and gold.”"}},{"id":108,"idInBook":108,"chapterId":21,"bookId":14,"arabic":"وَعَنْ حُذَيْفَةَ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَا تَلْبَسُوا الْحَرِيرَ وَلَا الدِّيبَاجَ وَلَا تَشْرَبُوا فِي آنِيَةِ الذَّهَبِ وَالْفِضَّةِ وَلَا تَأْكُلُوا فِي صِحَافِهَا فَإِنَّهَا لَهُمْ فِي الدُّنْيَا وَهِيَ لَكُمْ فِي الْآخِرَةِ»","english":{"narrator":"","text":"Hudhaifa told that he heard God’s messenger say, “Do not wear silk or brocade, do not drink from gold and silver vessels, and do not eat from gold and silver dishes, for others have them in this world, but you will have them in the next.” \n\n(Bukhari and Muslim.)"}},{"id":109,"idInBook":109,"chapterId":21,"bookId":14,"arabic":"وَعَن أنسٍ قَالَ: حُلِبَتْ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَاةٌ دَاجِنٌ وَشِيبَ لَبَنُهَا بِمَاءٍ مِنَ الْبِئْرِ الَّتِي فِي دَارِ أَنَسٍ فَأُعْطِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْقَدَحَ فَشَرِبَ وَعَلَى يَسَارِهِ أَبُو بَكْرٍ وَعَنْ يَمِينِهِ أَعْرَابِيٌّ فَقَالَ عُمَرُ: أَعْطِ أَبَا بَكْرٍ يَا رَسُولَ اللَّهِ فَأَعْطَى الْأَعْرَابِيَّ الَّذِي عَنْ يَمِينِهِ ثُمَّ قَالَ: \" الْأَيْمَنُ فَالْأَيْمَنُ وَفِي رِوَايَةٍ: «الْأَيْمَنُونَ الْأَيْمَنُونَ أَلاَ فيَمِّنوا»","english":{"narrator":"","text":"Anas told that a domestic sheep was milked for God’s messenger and its milk was mixed with water from a well in Anas’s house. God’s messenger was then given a cup and drank, Abu Bakr being on his left and a nomadic Arab on his right. ‘Umar asked God’s messenger to give it to Abu Bakr, but he gave it to the nomadic Arab who was on his right saying, “He who is on the right, then he who is on his right.” A version has, “Those on the right, then those on their right; go to the right.”* \n*This tradition indicates that people should band a drink to the one on their right irrespective of the relative importance of the people present. The tradition immediately following brings this out clearly.\n\n(Bukhari and Muslim.)"}},{"id":110,"idInBook":110,"chapterId":21,"bookId":14,"arabic":"وَعَنْ سَهْلِ بْنِ سَعْدٍ قَالَ: أَتَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقَدَحٍ فَشَرِبَ مِنْهُ وَعَنْ يَمِينِهِ غُلَامٌ أَصْغَرُ الْقَوْمِ وَالْأَشْيَاخُ عَنْ يَسَارِهِ فَقَالَ: «يَا غُلَامُ أَتَأْذَنُ أَنْ أُعْطِيَهُ الْأَشْيَاخَ؟» فَقَالَ: مَا كُنْتُ لِأُوثِرَ بِفَضْلٍ مِنْكَ أَحَدًا يَا رَسُولَ اللَّهِ فَأعْطَاهُ إِيَّاه.","english":{"narrator":"","text":"Sahl b. Sa'd told that the Prophet was brought a cup from which he drank, and on his right was a youth who was the youngest present, while the old men were on his left. He asked the youth to permit him to give it to the old men, but he replied, “I am not one to give anyone preference in a favour from you, messenger of God.” So he gave it to him.\n\n(Bukhari and Muslim.)"}},{"id":111,"idInBook":111,"chapterId":21,"bookId":14,"arabic":"عَن ابنِ عمَرَ قَالَ: كُنَّا نَأْكُلُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ نَمْشِي وَنَشْرَبُ وَنَحْنُ قِيَامٌ. رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ","english":{"narrator":"Ibn ‘Umar said:","text":"In the time of God’s messenger we used to eat while walking and drink while standing. \n\nTirmidhi, Ibn Majah and Darimi transmitted it, Tirmidhi saying this is a hasan sahih gharib tradition."}},{"id":112,"idInBook":112,"chapterId":21,"bookId":14,"arabic":"وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جده قَالَ: رَأَيْت رَسُول لله صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَشْرَبُ قَائِمًا وَقَاعِدًا. رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"‘Amr b. Shu'aib, on his father’s authority, said his grandfather told that he saw God’s messenger drink both standing and sitting.\n\nTirmidhi transmitted it."}},{"id":113,"idInBook":113,"chapterId":21,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُتَنَفَّسَ فِي الْإِنَاءِ أَوْ يُنْفَخَ فِيهِ. رَوَاهُ أَبُو دَاوُد وَابْن مَاجَه","english":{"narrator":"","text":"Ibn ‘Abbas said God’s messenger forbade breathing or blowing into a vessel. \n\nAbu Dawud and Ibn Majah transmitted it."}},{"id":114,"idInBook":114,"chapterId":21,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَشْرَبُوا وَاحِدًا كَشُرْبِ الْبَعِيرِ وَلَكِنِ اشْرَبُوا مَثنى وثُلاثَ وَسَمُّوا إِذَا أَنْتُمْ شَرِبْتُمْ وَاحْمَدُوا إِذَا أَنْتُمْ رفعتُم» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"He reported God’s messenger as saying, “Do not drink without stopping as a camel does,* but divide your drink into two or three sections; mention God’s name when you drink and praise Him when you finish.” \n*This is to avoid blowing into the vessel.\n\nTirmidhi transmitted it."}},{"id":115,"idInBook":115,"chapterId":21,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ النَّفْخِ فِي الشَّرَابِ فَقَالَ رَجُلٌ: الْقَذَاةَ أَرَاهَا فِي الْإِنَاءِ قَالَ: «أَهْرِقْهَا» قَالَ: فَإِنِّي لَا أُرْوَى مِنْ نَفَسٍ وَاحِدٍ قَالَ: «فَأَبِنِ الْقَدَحَ عَنْ فِيكَ ثُمَّ تَنَفَّسْ» . رَوَاهُ التِّرْمِذِيُّ والدارمي","english":{"narrator":"","text":"Abu Sa'id al-Khudri told that the Prophet forbade blowing into a drink. When a man said he saw specks in the vessel he told him to pour them out, and when he said his thirst was not quenched in one breath he told him to remove the cup from his mouth and take a breath.\n\nTirmidhi and Darimi transmitted it."}},{"id":116,"idInBook":116,"chapterId":21,"bookId":14,"arabic":"وَعَنْهُ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ الشُّرْبِ مِنْ ثُلْمَةِ الْقَدَحِ وَأَنْ يُنْفَخَ فِي الشَّرَابِ. رَوَاهُ أَبُو دَاوُدَ","english":{"narrator":"","text":"He told that God’s messenger forbade drinking from a broken place in a cup and blowing into a drink. \n\nAbu Dawud transmitted it."}},{"id":117,"idInBook":117,"chapterId":21,"bookId":14,"arabic":"وَعَن كبْشَةَ قَالَتْ: دَخَلَ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَشَرِبَ مِنْ فِي قِرْبَةٍ مُعَلَّقَةٍ قَائِمًا فَقُمْتُ إِلَى فِيهَا فَقَطَعْتُهُ. رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ حَسَنٌ غريبٌ صَحِيح","english":{"narrator":"Kabsha said:","text":"God’s messenger came in to visit me and drank standing from the mouth of a water-skin which was hung up, whereupon I went and cut off its mouth. \n\nTirmidhi and Ibn Majah transmitted it, Tirmidhi saying this is a hasan gharib sahih tradition."}},{"id":118,"idInBook":118,"chapterId":21,"bookId":14,"arabic":"وَعَنِ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْ: كَانَ أَحَبُّ الشَّرَابِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْحُلْوَ الْبَارِدَ. رَوَاهُ التِّرْمِذِيُّ وَقَالَ: وَالصَّحِيحُ مَا رُوِيَ عَنِ الزُّهْرِيِّ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُرْسَلًا","english":{"narrator":"","text":"Zuhri, on ‘Urwa’s authority, told that ‘A’isha said the drink God’s messenger liked best was cold sweet water. \n\nTirmidhi transmitted it, saying the sound version is what was transmitted by Zuhri from the Prophet in mursal form."}},{"id":119,"idInBook":119,"chapterId":21,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" إِذَا أَكَلَ أَحَدُكُمْ طَعَامًا فَلْيَقُلِ: اللَّهُمَّ بَارِكْ لَنَا فِيهِ وَأَطْعِمْنَا خَيْرًا مِنْهُ. وَإِذَا سُقِيَ لَبَنًا فَلْيَقُلِ: اللَّهُمَّ بَارِكْ لَنَا فِيهِ وَزِدْنَا مِنْهُ فَإِنَّهُ لَيْسَ شَيْء يجزى مِنَ الطَّعَامِ وَالشَّرَابِ إِلَّا اللَّبَنُ \". رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُد","english":{"narrator":"","text":"Ibn ‘Abbas reported God’s messenger as saying, “When one of you eats food he should say, ‘O God, bless us in it and give us good nourishment from it', and when he is given a drink of milk he should say, ‘O God, bless us in it and prosper us from it’, for no food or drink satisfies like milk.” \n\nTirmidhi and Abu Dawud transmitted it."}},{"id":120,"idInBook":120,"chapterId":21,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ قَالَتْ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُسْتَعْذَبُ لَهُ الْمَاءُ مِنَ السُّقْيَا. قِيلَ: هِيَ عَيْنٌ بَيْنَهَا وَبَيْنَ الْمَدِينَةِ يَوْمَانِ. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"‘A’isha said the water from as-Suqya was considered sweetest by the Prophet. It is said it was a well two days’ journey from Medina.\n\nAbu Dawud transmitted it."}},{"id":121,"idInBook":121,"chapterId":21,"bookId":14,"arabic":"عَنِ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ شَرِبَ فِي إِنَاءِ ذَهَبٍ أَوْ فِضَّةٍ أَوْ إِنَاءٍ فِيهِ شَيْءٌ مِنْ ذَلِكَ فَإِنَّمَا يُجَرْجِرُ فِي بَطْنِهِ نَارَ جهنمَ» . رَوَاهُ الدَّارَقُطْنِيّ","english":{"narrator":"","text":"Ibn ‘Umar reported the Prophet as saying, “If anyone drinks from a vessel of gold or silver, or one containing something of that nature, the fire of jahannam will bubble in his belly.” \n\nDaraqutni transmitted it."}},{"id":122,"idInBook":122,"chapterId":21,"bookId":14,"arabic":"عَن أنسٍ قَالَ: لَقَدْ سَقَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقَدَحِي هَذَا الشَّرَابَ كُلَّهُ: الْعَسَلَ والنَّبيذَ والماءَ وَاللَّبن. رَوَاهُ مُسلم","english":{"narrator":"Anas said:","text":"I have given God’s messenger in this cup of mine all kinds of drink: honey, nabidh, water and milk. \n\nMuslim transmitted it."}},{"id":123,"idInBook":123,"chapterId":21,"bookId":14,"arabic":"وَعَن عائشةَ قَالَتْ: كُنَّا نَنْبِذُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سِقَاءٍ يُوكَأُ أَعْلَاهُ وَلَهُ عَزْلَاءُ نَنْبِذُهُ غُدْوَةً فَيَشْرَبُهُ عِشَاءً وَنَنْبِذُهُ عِشَاءً فيشربُه غُدوةً. رَوَاهُ مُسلم","english":{"narrator":"‘A’isha said:","text":"We used to steep dates for God’s messenger in a skin which was tied at the top and had a mouth. What we steeped in the morning he would drink in the evening, and what we steeped in the evening he would drink in the morning. \n\nMuslim transmitted it."}},{"id":124,"idInBook":124,"chapterId":21,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُنْبَذُ لَهُ أَوَّلَ اللَّيْلِ فَيَشْرَبُهُ إِذَا أَصْبَحَ يَوْمَهُ ذَلِكَ وَاللَّيْلَةَ الَّتِي تَجِيءُ وَالْغَدَ وَاللَّيْلَةَ الْأُخْرَى وَالْغَدَ إِلَى الْعَصْرِ فَإِنْ بَقِيَ شَيْءٌ سَقَاهُ الْخَادِمَ أَوْ أَمَرَ بهِ فصُبَّ. رَوَاهُ مُسلم","english":{"narrator":"","text":"Ibn ‘Abbas told that dates were steeped for God’s messenger at the beginning of the night and he would drink it in the morning and the night after, the following day and the night after, and the next day up to the afternoon. If anything remained, he gave it to the servant to drink, or gave orders and it was poured out. \n\nMuslim transmitted it."}},{"id":125,"idInBook":125,"chapterId":21,"bookId":14,"arabic":"وَعَن جابرٍ قَالَ: كَانَ يُنْبَذُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سِقَائِهِ فَإِذَا لَمْ يَجِدُوا سِقَاءً يُنْبَذُ لَهُ فِي تَوْرٍ مِنْ حِجَارَةٍ. رَوَاهُ مُسلم","english":{"narrator":"","text":"Jabir said dates were steeped for God’s messenger in a skin, but when they could not find a skin they were steeped for him in a small stone vessel. \n\nMuslim transmitted it."}},{"id":126,"idInBook":126,"chapterId":21,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نهى عَن الدُّبَّاء والحنتم والمرفت وَالنَّقِيرِ وَأَمَرَ أَنْ يُنْبَذَ فِي أَسْقِيَةِ الْأَدَمِ. رَوَاهُ مُسلم","english":{"narrator":"","text":"Ibn ‘Umar said God’s messenger forbade the use of pumpkins,  green jars, vessels smeared with pitch and hollow stumps, giving command that dates should be steeped in skins. \n\nMuslim transmitted it."}},{"id":127,"idInBook":127,"chapterId":21,"bookId":14,"arabic":"وَعَن بُرَيْدَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «نَهَيْتُكُمْ عَنِ الظُّرُوفِ فَإِنَّ ظَرْفًا لَا يُحِلُّ شَيْئًا وَلَا يُحَرِّمُهُ وَكُلُّ مُسْكِرٍ حَرَامٌ» . وَفِي رِوَايَةٍ: قَالَ: «نَهَيْتُكُمْ عَنِ الْأَشْرِبَةِ إِلَّا فِي ظُرُوفِ الْأَدَمِ فَاشْرَبُوا فِي كُلِّ وِعَاءٍ غَيْرَ أَنْ لَا تَشْرَبُوا مُسْكِرًا» . رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"Buraida reported God’s messenger as saying, “I have forbidden you receptacles, for while a receptacle does not make anything lawful or unlawful, every intoxicant is unlawful.” In a version he said, “I have forbidden you drinks except from skin vessels, but now you may drink from any kind of vessel, but do not drink an intoxicant.” \n\nMuslim transmitted it."}},{"id":128,"idInBook":128,"chapterId":21,"bookId":14,"arabic":"عَن أبي مَالك الْأَشْعَرِيّ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَيَشْرَبَنَّ نَاسٌ مِنْ أُمَّتِي الْخَمْرَ يُسَمُّونَهَا بِغَيْرِ اسْمِهَا» . رَوَاهُ أَبُو دَاوُدَ وَابْنُ مَاجَهْ","english":{"narrator":"","text":"Abu Malik al-Ash'ari told of hearing God’s messenger say, “Some of my people will assuredly drink wine calling it by another name.”\n\nAbu Dawud and Ibn Majah transmitted it."}},{"id":129,"idInBook":129,"chapterId":21,"bookId":14,"arabic":"عَنْ عَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ نَبِيذِ الْجَرِّ الْأَخْضَرِ قُلْتُ: أَنَشْرَبُ فِي الأبيضِ؟ قَالَ: «لَا» . رَوَاهُ البُخَارِيّ","english":{"narrator":"‘Abdallah b. Abu Aufa said:","text":"God’s messenger forbade nabidh in green jars, and when I asked whether we might drink it from white ones he replied that we might not. \n\nBukhari transmitted it."}},{"id":130,"idInBook":130,"chapterId":21,"bookId":14,"arabic":"عَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا كَانَ جِنْحُ اللَّيْلِ أَوْ أَمْسَيْتُمْ فَكُفُّوا صِبْيَانَكُمْ فَإِنَّ الشَّيْطَانَ يَنْتَشِرُ حِينَئِذٍ فَإِذَا ذَهَبَ سَاعَةً مِنَ اللَّيْلِ فَخَلَّوهُمْ وَأَغْلِقُوا الْأَبْوَابَ وَاذْكُرُوا اسْمَ اللَّهِ فَإِنَّ الشَّيْطَانَ لَا يَفْتَحُ بَابًا مُغْلَقًا وَأَوْكُوا قِرَبَكُمْ وَاذْكُرُوا اسْمَ اللَّهِ وَخَمِّرُوا آنِيَتَكُمْ وَاذْكُرُوا اسْمَ اللَّهِ وَلَوْ أنْ تعرِضوا عَلَيْهِ شَيْئا وأطفئوا مصابيحكم»\nوَفِي رِوَايَةٍ لِلْبُخَارِيِّ: قَالَ: «خَمِّرُوا الْآنِيَةَ وَأَوْكُوا الْأَسْقِيَةَ وَأَجِيفُوا الْأَبْوَابَ وَاكْفِتُوا صِبْيَانَكُمْ عِنْدَ الْمَسَاءِ فَإِن للجن انتشارا أَو خطْفَة وَأَطْفِئُوا الْمَصَابِيحَ عِنْدَ الرُّقَادِ فَإِنَّ الْفُوَيْسِقَةَ رُبَّمَا اجْتَرَّتْ الفتيلة فأحرقت أهل الْبَيْت»\nوَفِي رِوَايَةٍ لِمُسْلِمٍ قَالَ: «غَطُّوا الْإِنَاءَ وَأَوْكُوا السِّقَاءَ وَأَغْلِقُوا الْأَبْوَابَ وَأَطْفِئُوا السِّرَاجَ فَإِنَّ الشَّيْطَانَ لَا يَحُلُّ سِقَاءً وَلَا يَفْتَحُ بَابًا وَلَا يَكْشِفُ إِنَاءً فَإِنْ لَمْ يَجِدْ أَحَدُكُمْ إِلَّا أنْ يعرضَ على إِنائِه عوداً ويذكرَ اسمَ اللَّهَ فَلْيَفْعَلْ فَإِنَّ الْفُوَيْسِقَةَ تُضْرِمُ عَلَى أَهْلِ الْبَيْت بَيتهمْ»\nوَفِي رِوَايَةٍ لَهُ: قَالَ: «لَا تُرْسِلُوا فَوَاشِيكُمْ وَصِبْيَانَكُمْ إِذَا غَابَتِ الشَّمْسُ حَتَّى تَذْهَبَ فَحْمَةُ الْعِشَاءِ فَإِنَّ الشَّيْطَانَ يَبْعَثُ إِذَا غَابَتِ الشَّمْسُ حَتَّى تذْهب فَحْمَة الْعشَاء»\nوَفِي رِوَايَةٍ لَهُ: قَالَ: «غَطُّوا الْإِنَاءَ وَأَوْكُوا السِّقَاءَ فَإِنَّ فِي السَّنَةِ لَيْلَةً يَنْزِلُ فِيهَا وَبَاءٌ لَا يَمُرُّ بِإِنَاءٍ لَيْسَ عَلَيْهِ غِطَاءٌ أَوْ سِقَاءٌ لَيْسَ عَلَيْهِ وِكَاءٌ إِلَّا نَزَلَ فِيهِ من ذَلِك الوباء»","english":{"narrator":"","text":"Jabir reported God’s messenger as saying, “When the darkness of night comes, or in the evening, collect your children, for the devil is abroad at that time, and when an hour of the night has passed let them free and shut the doors, making mention of God’s name, for the devil does not open a shut door. Tie up you buckets, mentioning God's name; cover up your vessels, mentioning God’s name, even though you should just put something on them, and extinguish your lamps.”\n\n(Bukhari and Muslim.) In a version by Bukhari he said, “Cover up the vessels, tie the water-skins, shut the doors, and gather your children in the evening, for the jinn are abroad and seize them; and extinguish the lamps when you go to sleep, for a mouse often drags a wick and burns a household.” In a verison by Muslim he said, “Cover the vessel, tie up the water-skin, shut the doors and extinguish the lamp, for the devil does not loosen a water-skin, or open a door, or uncover a vessel. If all one can do is to put a piece of wood over his vessel and mention God's name let him do so, for a mouse sets a house on fire over its inhabitants.” In a version by him he said, “Do not let your animals and children go at large when the sun sets till the first and darkest part of the night has passed, for the devil is sent out; from the time the sun sets till the first and darkest part of the night is past.” In a version by him he said, “Cover the vessel and tie up the water-skin, for there is a night in the year when pestilence descends, and it does not pass an uncovered vessel or an untied water-skin without some of that pesti- lence descending into it.”"}},{"id":131,"idInBook":131,"chapterId":21,"bookId":14,"arabic":"وَعَنْهُ قَالَ: جَاءَ أَبُو حُمَيْدٍ رَجُلٌ مِنَ الْأَنْصَارِ مِنَ النَّقِيعِ بِإِنَاءٍ مِنْ لَبَنٍ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَلَّا خَمَّرْتَهُ وَلَوْ أنْ تعرِضَ عليهِ عوداً»","english":{"narrator":"","text":"He told that when Abu Humaid, one of the Ansar, brought a vessel of milk to the Prophet from an-Naqi'* the Prophet said, “Why did you not cover it up, even by putting a piece of wood on it?” \n*A place in the wadi al-'Aqiq where camels which had been given in sadaqa were kept.\n\n(Bukhari and Muslim.)"}},{"id":132,"idInBook":132,"chapterId":21,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا تَتْرُكُوا النَّارَ فِي بُيُوتِكُمْ حِينَ تنامون»","english":{"narrator":"","text":"Ibn ‘Umar reported the Prophet as saying, “Do not leave a fire burning in your houses while you are asleep.” \n\n(Bukhari and Muslim.)"}},{"id":133,"idInBook":133,"chapterId":21,"bookId":14,"arabic":"وَعَنْ أَبِي مُوسَى قَالَ: احْتَرَقَ بَيْتٌ بِالْمَدِينَةِ عَلَى أَهْلِهِ مِنَ اللَّيْلِ فَحُدِّثَ بِشَأْنِهِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ هَذِهِ النَّارُ إِنَّمَا هِيَ عَدُوٌّ لَكُمْ فَإِذَا نِمْتُمْ فأطفئوها عَنْكُم»","english":{"narrator":"","text":"Abu Musa said that when a house in Medina was burned down during the night over its inhabitants and the Prophet was told, he said, “This fire is just an enemy to you, so when you go to sleep extinguish it.” \n\n(Bukhari and Muslim.)"}},{"id":134,"idInBook":134,"chapterId":21,"bookId":14,"arabic":"عَنْ جَابِرٍ قَالَ: سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِذَا سَمِعْتُمْ نُبَاحَ الْكِلَابِ وَنَهِيقَ الْحَمِيرِ مِنَ اللَّيْلِ فَتَعَوَّذُوا بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيمِ فَإِنَّهُنَّ يَرَيْنَ مَا لَا تَرَوْنَ. وَأَقِلُّوا الْخُرُوجَ إِذَا هَدَأَتِ الْأَرْجُلُ فَإِنَّ اللَّهَ عَزَّ وَجَلَّ يَبُثُّ مِنْ خَلْقِهِ فِي لَيْلَتِهِ مَا يَشَاءُ وَأَجِيفُوا الْأَبْوَابَ وَاذْكُرُوا اسْمَ اللَّهِ عَلَيْهِ فَإِنَّ الشَّيْطَانَ لَا يَفْتَحُ بَابًا إِذَا أُجِيفَ وَذُكِرَ اسْمُ اللَّهِ عَلَيْهِ وَغَطُّوا الْجِرَارَ وَأَكْفِئُوا الْآنِيَةَ وأوكوا الْقرب» . رَوَاهُ فِي شرح السّنة","english":{"narrator":"","text":"Jabir told of hearing God’s messenger say, “When you hear the barking of dogs and the braying of asses at night seek refuge in God from the accursed devil, for they see what you do not see. Do not go out much when there are few people about, for God who is great and glorious scatters abroad such of His creatures as He wishes at night* Shut the doors, making mention of God's name, for the devil does not open a door which has been shut accompanied by mention of God’s name. Cover up jars, invert vessels and tie up buckets.”\n\nIt is transmitted in Sharh as-sunna."}},{"id":135,"idInBook":135,"chapterId":21,"bookId":14,"arabic":"وَعَن ابنِ عبَّاسٍ قَالَ: جَاءَتْ فَأْرَةٌ تَجُرُّ الْفَتِيلَةَ فَأَلْقَتْهَا بَيْنَ يَدَيْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْخَمْرَةِ الَّتِي كَانَ قَاعِدًا عَلَيْهَا فَأَحْرَقَتْ مِنْهَا مِثْلَ مَوْضِعِ الدِّرْهَمِ فَقَالَ: «إِذَا نِمْتُمْ فَأَطْفِئُوا سُرُجَكُمْ فَإِنَّ الشَّيْطَانَ يَدُلُّ مِثْلَ هَذِهِ عَلَى هَذَا فَيَحْرِقُكُمْ» . رَوَاهُ أَبُو دَاوُدَ.","english":{"narrator":"","text":"Ibn ‘Abbas told that when a mouse came dragging a wick and dropped it in front of God’s messenger on the mat on which he was sitting with the result th at it burned a hole in it about the size of dirham, he said, “When you go to sleep extinguish your lamps, for the devil guides a creature like this to do thus and sets you on fire.”\n\nAbu Dawud transmitted it."}}],"chapter":{"id":21,"bookId":14,"arabic":"كتاب الأطعمة","english":"Foods"}}