{"metadata":{"length":193,"arabic":{"title":"مشكاة المصابيح","author":"الإمام الكاتب التبريزي","introduction":"كتاب اللباس"},"english":{"title":"Mishkat al-Masabih","author":"Al-Khatib Al-Tabrizi","introduction":"Clothing"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":22,"bookId":14,"arabic":"عَن أنسٍ قَالَ: كَانَ أَحَبُّ الثِّيَابِ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَلْبَسَهَا الْحِبَرَةُ","english":{"narrator":"","text":"Anas said the clothing the Prophet liked best wear was a striped cloak. \n\n(Bukhari and Muslim.)"}},{"id":2,"idInBook":2,"chapterId":22,"bookId":14,"arabic":"وَعَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَبِسَ جُبَّةً رُومِيَّةً ضَيِّقَةَ الْكُمَّيْنِ","english":{"narrator":"","text":"Al-Mughira b. Shu'ba said the Prophet wore a Byzantine cloak with narrow sleeves.\n(Bukhari and Muslim.)"}},{"id":3,"idInBook":3,"chapterId":22,"bookId":14,"arabic":"وَعَنْ أَبِي بُرْدَةَ قَالَ: أَخْرَجَتْ إِلَيْنَا عَائِشَةُ كِسَاءً مُلَبَّدًا وَإِزَارًا غَلِيظًا فَقَالَتْ: قُبِضَ رُوحُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي هذَيْن","english":{"narrator":"","text":"Abu Burda said ‘A’isha brought out to them a patched garment and a coarse lower garment and told them that God’s messenger’s spirit was taken when he was wearing those.\n(Bukhari and Muslim.)"}},{"id":4,"idInBook":4,"chapterId":22,"bookId":14,"arabic":"وَعَن عَائِشَة قَالَتْ: كَانَ فِرَاشُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الَّذِي يَنَامُ عَلَيْهِ أَدَمًا حَشْوُهُ لِيف","english":{"narrator":"","text":"‘A’isha said the bedding on which God’s messenger slept consisted of leather stuffed with palm fibre. \n(Bukhari and Muslim)"}},{"id":5,"idInBook":5,"chapterId":22,"bookId":14,"arabic":"وَعَنْهَا قَالَتْ: كَانَ وِسَادُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الَّذِي يَتَّكِئُ عَلَيْهِ مَنْ أَدَمٍ حشْوُهُ ليفٌ. رَوَاهُ مُسلم","english":{"narrator":"","text":"She said the pillow on which God’s messenger reclined was of leather stuffed with palm fibre. ' \nMuslim transmitted it."}},{"id":6,"idInBook":6,"chapterId":22,"bookId":14,"arabic":"وعنها قَالَت: بَينا نَحْنُ جُلُوسٌ فِي بَيْتِنَا فِي حَرِّ الظَّهِيرَةِ قَالَ قَائِلٌ لِأَبِي بَكْرٍ: هَذَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُقْبِلًا مُتَقَنِّعًا. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"She told that while they were seated in their house in the noonday heat someone said to Abu Bakr, “Here is God’s messenger coming shading his head.” \nBukhari transmitted it."}},{"id":7,"idInBook":7,"chapterId":22,"bookId":14,"arabic":"وَعَنْ جَابِرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَهُ: «فِرَاشٌ لِلرَّجُلِ وَفِرَاشٌ لِامْرَأَتِهِ وَالثَّالِثُ للضيف وَالرَّابِع للشَّيْطَان» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Jabir told that God’s messenger said to him, “There should be bedding for a man, bedding for his wife, and a third for a guest, but a fourth is for the devil.”(It is explainedt that to have more than is necessary suggests fondness for worldly goods, or a desire to make some display. Such practices are blameworthy, and what is blameworthy is connected with the devil).\nMuslim transmitted it."}},{"id":8,"idInBook":8,"chapterId":22,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يَنْظُرُ اللَّهُ يَوْمَ الْقِيَامَةِ إِلَى مَنْ جَرَّ إزَاره بطرا»","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “On the day of resurrection God will not look at him who trails his lower garment conceitedly.\" \n(Bukhari and Muslim.)"}},{"id":9,"idInBook":9,"chapterId":22,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ جَرَّ ثَوْبَهُ خُيَلَاءَ لَمْ يَنْظُرِ اللَّهُ إِلَيْهِ يَوْمَ الْقِيَامَةِ»","english":{"narrator":"","text":"Ibn ‘Umar reported the Prophet as saying, ‘If anyone trails his garment arrogantly, God will not look at him on the day of resurrection.\" \n(Bukhari and Muslim.)"}},{"id":10,"idInBook":10,"chapterId":22,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «بَيْنَمَا رَجُلٌ يَجُرُّ إِزَارَهُ مِنَ الْخُيَلَاءِ خُسِفَ بِهِ فَهُوَ يَتَجَلْجَلُ فِي الْأَرْضِ إِلى يومِ الْقِيَامَة» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"He reported God’s messenger as saying, “While a man was trailing his lower garment he was swallowed up by the earth, and he will be tossed about in it till the day of resurrection.\"\nBukhari transmitted it."}},{"id":11,"idInBook":11,"chapterId":22,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا أَسْفَلَ مِنَ الْكَعْبَيْنِ مِنَ الْإِزَارِ فِي النَّارِ» . رَوَاهُ الْبُخَارِيُّ","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “The part of the lower garment which goes below the ankles is in hell.\"\nBukhari transmitted it."}},{"id":12,"idInBook":12,"chapterId":22,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَأْكُلَ الرَّجُلُ بِشِمَالِهِ أَو يمشي فِي نعل وَاحِد وَأَن يشْتَمل الصماء أَو يجتني فِي ثَوْبٍ وَاحِدٍ كَاشِفًا عَنْ فَرْجِهِ. رَوَاهُ مُسلم","english":{"narrator":"","text":"Jabir said God’s messenger forbade that a man should eat with his left hand, or walk with one sandal, or wrap himself completely in a garment, or sit in a single garment with his hands round his knees and uncover his private parts. \nMuslim transmitted it."}},{"id":13,"idInBook":13,"chapterId":22,"bookId":14,"arabic":"وعن عمر وأنس وابن الزبير وأبي أمامة رضي الله عنهم أجمعين عن النبي صلى الله عليه وسلم قال : \n\" من لبس الحرير في الدنيا لم يلبسه في الآخرة \"","english":{"narrator":"","text":"‘Umar, Anas, Ibn az-Zubair and Abu Umama reported the Prophet as saying, *“He who wears silk in this world will not wear it in the next.\" \n(Bukhari and Muslim.)"}},{"id":14,"idInBook":14,"chapterId":22,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّمَا يَلْبَسُ الْحَرِيرَ فِي الدُّنْيَا مَنْ لَا خَلَاقَ لَهُ فِي الْآخِرَة»","english":{"narrator":"","text":"Ibn ‘Umar reported God’s messenger as saying, “Only he who has no portion in the next world wears silk in this world.\" \n(Bukhari and Muslim.)"}},{"id":15,"idInBook":15,"chapterId":22,"bookId":14,"arabic":"وَعَنْ حُذَيْفَةَ قَالَ: نَهَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَشْرَبَ فِي آنِيَةِ الْفِضَّةِ وَالذَّهَبِ وَأَنْ نَأْكُلَ فِيهَا وَعَنْ لُبْسِ الْحَرِيرِ وَالدِّيبَاجِ وَأَنْ نَجْلِسَ عَلَيْهِ","english":{"narrator":"","text":"Hudhaifa told that God’s messenger forbade them to eat or drink from a vessel of silver or gold, or to wear or sit upon silk and brocade.\n(Bukhari and Muslim.)"}},{"id":16,"idInBook":16,"chapterId":22,"bookId":14,"arabic":"وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ: أُهْدِيَتْ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم حُلّة سِيَرَاءَ فَبَعَثَ بِهَا إِلَيَّ فَلَبِسْتُهَا فَعَرَفْتُ الْغَضَبَ فِي وَجْهِهِ فَقَالَ: «إِنِّي لَمْ أَبْعَثْ بِهَا إِلَيْكَ لِتَلْبَسَهَا إِنَّمَا بَعَثْتُ بِهَا إِلَيْكَ لِتُشَقِّقَهَا خُمُراً بَين النساءِ»","english":{"narrator":"","text":"‘Ali told that God’s messenger was presented with a striped robe containing silk and sent it to him, but when ‘Ali wore it he saw he was looking angry. He then said, “I did not send it to you to wear, but only to cut it up into veils for the women.\" \n(Bukhari and Muslim.)"}},{"id":17,"idInBook":17,"chapterId":22,"bookId":14,"arabic":"وَعَنْ عُمَرَ رَضِيَ اللَّهُ عَنْهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ لُبْسِ الْحَرِيرِ إِلَّا هَكَذَا وَرَفَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إصبعيه: الْوُسْطَى والسبابة وضمهما\nوَفِي رِوَايَةٍ لِمُسْلِمٍ: أَنَّهُ خَطَبَ بِالْجَابِيَةِ فَقَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ لُبْسِ الْحَرِيرِ إِلَّا مَوْضِعَ إِصْبَعَيْنِ أَوْ ثَلَاث أَو أَربع","english":{"narrator":"","text":"‘Umar said the Prophet forbade wearing silk except to this extent, which was indicated by God's messenger raising his middle and forefinger and joining them. \n\n(Bukhari and Muslim.)\n\nA version by Muslim tells that in an address given by him at al-Jabiya (a town to the east of the Sea of Galilee, north of the Yarmuk battlefield. ‘Umar went there before the fall of Jerusalem.) he said God’s messenger forbade wearing silk except to the extent of two, three, or four fingers."}},{"id":18,"idInBook":18,"chapterId":22,"bookId":14,"arabic":"وَعَن أسماءَ بنت أبي بكر: أَنَّهَا أَخْرَجَتْ جُبَّةَ طَيَالِسَةٍ كِسْرَوَانِيَّةٍ لَهَا لِبْنَةُ ديباجٍ وفُرجَيْها مكفوفَين بالديباجِ وَقَالَت: هَذِه جبَّةُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَتْ عِنْدَ عَائِشَةَ فَلَمَّا قُبِضَتْ قَبَضْتُهَا وَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَلْبَسُهَا فَنَحْنُ نَغْسِلُهَا للمَرضى نستشفي بهَا. رَوَاهُ مُسلم","english":{"narrator":"Asma’ daughter of Abu Bakr brought out a mantle of royal Persian quality with a gore of brocade and hemmed front and back with brocade, and said :","text":"This was God’s messenger’s mantle which was with ‘A’isha, which I inherited when she died. The Prophet used to wear it, and we washed it for the sick and sought a cure by means of it. (The water in which it was washed would be given to the sick to drink, or the garment itself was placed on them, or given to them to touch or kiss, and so receive a blessing) \nMuslim transmitted it."}},{"id":19,"idInBook":19,"chapterId":22,"bookId":14,"arabic":"وَعَن أنسٍ قَالَ: رَخَّصَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلزُّبَيْرِ وَعَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ فِي لبس الْحَرِير لحكة بهما\nوَفِي رِوَايَة لمُسلم قَالَ: إنَّهُمَا شكوا من الْقمل فَرخص لَهما فِي قمص الْحَرِير","english":{"narrator":"","text":"Anas told that God’s messenger gave licence to az-Zubair and ‘Abd ar-Rahman b. ‘Auf to wear silk because of an itch which they had.\n\n(Bukhari and Muslim.)\n\nIn a version by Muslim he said they complained of bugs and he gave them licence to wear silk shirts."}},{"id":20,"idInBook":20,"chapterId":22,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ قَالَ: رَأَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى ثَوْبَيْنِ مُعَصْفَرَيْنِ فَقَالَ: «إِنَّ هَذِهِ من ثِيَاب الْكفَّار فَلَا تلبسها»\nوَفِي رِوَايَة: قلت: أغسلهما؟ قَالَ: «بل احرقها» . رَوَاهُ مُسْلِمٌ\nوَسَنَذْكُرُ حَدِيثَ عَائِشَةَ: خَرَجَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ غَدَاةٍ فِي «بَابِ مَنَاقِبِ أَهْلِ بَيْتِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسلم»","english":{"narrator":"","text":"‘Abdallah b. ‘Amr b. al-‘As told that when God's messenger saw him wearing two garments dyed with saffron he said, “These are the garments worn by infidels ; do not wear them.” A version says that when he suggested washing them he replied, “No, burn them.” \nMuslim transmitted it."}},{"id":21,"idInBook":21,"chapterId":22,"bookId":14,"arabic":"عَن أم سَلمَة قَالَتْ: كَانَ أَحَبُّ الثِّيَابِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْقَمِيصَ. رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُد","english":{"narrator":"","text":"Umm Salama said the clothing God’s messenger liked best was a shirt. \nTirmidhi and Abu Dawud transmitted it."}},{"id":22,"idInBook":22,"chapterId":22,"bookId":14,"arabic":"وَعَن أسماءَ بنت يزِيد قَالَتْ: كَانَ كُمُّ قَمِيصِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الرُّصْغِ. رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ","english":{"narrator":"","text":"Asma’ daughter of Yazid said the sleeve of God’s messenger’s shirt came to the wrist. \nTirmidhi and Abu Dawud transmitted it, Tirmidhi saying this is a hasan gharib tradition."}},{"id":23,"idInBook":23,"chapterId":22,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا لَبِسَ قَمِيصًا بَدَأَ بميامنه. رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Abu Huraira said that when God’s messenger put on a shirt he began with the right side.\nTirmidhi transmitted it."}},{"id":24,"idInBook":24,"chapterId":22,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ رَضِيَ اللَّهُ عَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِزْرَةُ الْمُؤْمِنِ إِلَى أَنْصَافِ سَاقَيْهِ لَا جُنَاحَ عَلَيْهِ فِيمَا بَيْنَهُ وَبَيْنَ الْكَعْبَيْنِ مَا أَسْفَلَ مِنْ ذَلِكَ فَفِي النَّارِ» قَالَ ذَلِكَ ثَلَاثَ مَرَّاتٍ «وَلَا يَنْظُرُ اللَّهُ يَوْمَ الْقِيَامَةِ إِلَى مَنْ جَرَّ إِزَارَهُ بَطَرًا» . رَوَاهُ أَبُو دَاوُد وَابْن مَاجَه","english":{"narrator":"","text":"Abu Sa'id al-Khudrl told that he heard God’s messenger say, \"The way for a believer to wear a lower garment is to have it halfway down his legs, and he is guilty of no sin if it comes halfway between that and the ankles, but what comes lower than that is in hell (saying that three times). On the day of resurrection God will not look at him who trails his lower garment conceitedly.\" \nAbu Dawud and Ibn Majah transmitted it."}},{"id":25,"idInBook":25,"chapterId":22,"bookId":14,"arabic":"وَعَن سَالم عَنْ أَبِيهِ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْإِسْبَالُ فِي الْإِزَارِ وَالْقَمِيصِ وَالْعِمَامَةِ مِنْ جَرَّ مِنْهَا شَيْئًا خُيَلَاءَ لَمْ يَنْظُرِ اللَّهُ إِلَيْهِ يَوْمَ الْقِيَامَةِ» . رَوَاهُ أَبُو دَاوُدَ وَالنَّسَائِيّ وَابْن مَاجَه","english":{"narrator":"","text":"Salim quoted his father to the effect that the Prophet said, \"If anyone trails arrogantly anything allowed to hang down in a lower garment, a shirt and a turban, God will not look at him on the day of resurrection.\" \nAbu Dawud, Nasa’i and Ibn Majah transmitted it."}},{"id":26,"idInBook":26,"chapterId":22,"bookId":14,"arabic":"وَعَن أبي كبشةَ قَالَ: كَانَ كِمَامُ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بُطْحًا. رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حديثٌ مُنكر","english":{"narrator":"","text":"Abu Kabsha said the headgear worn by God's messenger's Companions was flat. (It is not clear whether the reference here is to headgear which was low and wide, or to wide sleeves. The former seems to be preferred. Cf. Mirqat, iv, 424.)\nTirmidhi transmitted it, saying this is a tradition which is rejected."}},{"id":27,"idInBook":27,"chapterId":22,"bookId":14,"arabic":"وَعَن أم سَلمَة قَالَتْ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ ذَكَرَ الْإِزَارَ: فَالْمَرْأَةُ يَا رَسُولَ اللَّهِ؟ قَالَ: «تُرْخِي شِبْرًا» فَقَالَتْ: إِذًا تَنْكَشِفُ عَنْهَا قَالَ: «فَذِرَاعًا لَا تَزِيدُ عَلَيْهِ» . رَوَاهُ مَالِكٌ وَأَبُو دَاوُد وَالنَّسَائِيّ وَابْن مَاجَه\nوَفِي رِوَايَةِ التِّرْمِذِيِّ وَالنَّسَائِيِّ عَنِ ابْنِ عُمَرَ فَقَالَتْ: إِذًا تَنْكَشِفُ أَقْدَامُهُنَّ قَالَ: «فَيُرْخِينَ ذِرَاعًا لَا يزدن عَلَيْهِ»","english":{"narrator":"","text":"When God’s messenger mentioned the lower garment Umm Salama asked what a woman should do and he said she should let it down a span. She replied that in that case she would not be completely covered, and he said she might let it down a cubit, but no more.\n\nMalik, Abu Dawud, Nasa’i and Ibn Majah transmitted it. In the version of Tirmidhi and Nasa’i on the authority of Ibn ‘Umar she said their feet would then be uncovered, and he replied that they should let it down a cubit, but no more."}},{"id":28,"idInBook":28,"chapterId":22,"bookId":14,"arabic":"وَعَنْ مُعَاوِيَةَ بْنِ قُرَّةَ عَنْ أَبِيهِ قَالَ: أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي رَهْطٍ مِنْ مُزَيْنَةَ فَبَايَعُوهُ وَإِنَّهُ لَمُطْلَقُ الْأَزْرَارِ فَأَدْخَلْتُ يَدِي فِي جَيْبِ قَمِيصِهِ فَمَسِسْتُ الْخَاتم. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"Mu'awiya b. Qurra quoted his father as saying:","text":"I came to the Prophet with a company of Muzaina who swore allegiance to him, and as his buttons were open I put my hand inside his shirt and felt the seal.\nAbu Dawud transmitted it."}},{"id":29,"idInBook":29,"chapterId":22,"bookId":14,"arabic":"وَعَن سَمُرَة أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْبَسُوا الثِّيَابَ الْبِيضَ فَإِنَّهَا أَطْهَرُ وَأَطْيَبُ وَكَفِّنُوا فِيهَا مَوْتَاكُمْ» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَالنَّسَائِيُّ وَابْنُ مَاجَه","english":{"narrator":"","text":"Samura reported the Prophet as saying, \"Wear white clothes, for they are purer and better ; and shroud your dead in them.\"\nAhmad, Tirmidhi, Nasa'i and Ibn Majah transmitted it."}},{"id":30,"idInBook":30,"chapterId":22,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اعْتَمَّ سَدَلَ عِمَامَتَهُ بَيْنَ كَتِفَيْهِ. رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ","english":{"narrator":"","text":"Ibn ‘Umar told that when God’s messenger put on a turban he let the end hang between his shoulders. \nTirmidhi transmitted it, saying this is a hasan gharib tradition."}},{"id":31,"idInBook":31,"chapterId":22,"bookId":14,"arabic":"وَعَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ قَالَ: عَمَّمَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَدَلَهَا بَيْنَ يَدَيَّ وَمِنْ خَلْفِي. رَوَاهُ أَبُو دَاوُدَ","english":{"narrator":"","text":"‘Abd ar-Rahman b. ‘Auf told that God’s messenger put a turban on him and let the ends hang in front of him and behind him. \nAbu Dawud transmitted it."}},{"id":32,"idInBook":32,"chapterId":22,"bookId":14,"arabic":"وَعَن ركَانَة عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «فَرْقُ مَا بَيْنَنَا وَبَيْنَ الْمُشْرِكِينَ الْعَمَائِمُ عَلَى الْقَلَانِسِ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ وَإِسْنَاده لَيْسَ بالقائم","english":{"narrator":"","text":"Rukana reported the Prophet as saying, “The difference between us and the polytheists is that we wear turbans over caps.” \nTirmidhi transmitted it, saying this is a gharib tradition whose isnad is not reliable."}},{"id":33,"idInBook":33,"chapterId":22,"bookId":14,"arabic":"وَعَنْ أَبِي مُوسَى الْأَشْعَرِيِّ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أُحِلَّ الذَّهَبُ وَالْحَرِيرُ لِلْإِنَاثِ مِنْ أُمَّتِي وَحُرِّمَ عَلَى ذُكُورِهَا» . رَوَاهُ التِّرْمِذِيّ وَالنَّسَائِيّ وَقَالَ التِّرْمِذِيّ: هَذَا صَحِيح","english":{"narrator":"","text":"Abu Musa al-Ash‘ari reported the Prophet as saying, “Gold and silk are permitted to the females among my people but prohibited to the males.” \n\nTirmidhi and Nasa’i transmitted it, Tirmidhi saying this is a hasan sahih  tradition."}},{"id":34,"idInBook":34,"chapterId":22,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اسْتَجَدَّ ثَوْبًا سَمَّاهُ بِاسْمِهِ عِمَامَةً أَوْ قَمِيصًا أَوْ رِدَاءً ثُمَّ يَقُولُ «اللَّهُمَّ لَكَ الْحَمْدُ كَمَا كسوتَنيه أَسأَلك خَيره وخيرَ مَا صُنِعَ لَهُ وَأَعُوذُ بِكَ مِنْ شَرِّهِ وَشَرِّ مَا صُنِعَ لَهُ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ","english":{"narrator":"","text":"Abu Sa'id al-Khudri told that when God's messenger put on a new garment he mentioned it by name, turban, shirt, or cloak, and would then say, “O God, praise be to Thee ! As Thou hast clothed me with it, I ask Thee for its good and the good of that for which it was made, and I seek refuge in Thee from its evil and the evil of that for which it was made.”\n\nTirmidhi and Abu Dawud transmitted it."}},{"id":35,"idInBook":35,"chapterId":22,"bookId":14,"arabic":"وَعَن معاذِ بن أَنَسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \" مَنْ أَكَلَ طَعَامًا ثُمَّ قَالَ: الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنِي هَذَا الطَّعَامَ وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِنِّي وَلَا قُوَّةٍ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ \". رَوَاهُ التِّرْمِذِيُّ وَزَادَ أَبُو دَاوُدَ: \" وَمَنْ لَبِسَ ثَوْبًا فَقَالَ: الْحَمْدُ لِلَّهِ الَّذِي كَسَانِي هَذَا وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِنِّي وَلَا قُوَّةٍ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ وَمَا تَأَخَّرَ \"","english":{"narrator":"","text":"Mu'adh b. Anas reported God’s messenger as stating that if anyone eats food and then says, “Praise be to God who has fed me with this food and provided me with it through no might or power on my part,” he will be forgiven his former sins. \nTirmidhi transmitted it, and Abu Dawud added that if anyone puts on a garment and says, “Praise be to God who has clothed me with this and provided me with it through no might or power on my part,” he will be forgiven his former and latter sins."}},{"id":36,"idInBook":36,"chapterId":22,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ قَالَتْ قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَا عَائِشَةُ إِذَا أَرَدْتِ اللُّحُوقَ بِي فَلْيَكْفِكِ مِنَ الدُّنْيَا كَزَادِ الرَّاكِبِ وَإِيَّاكِ وَمُجَالَسَةَ الْأَغْنِيَاءِ وَلَا تَسْتَخْلِقِي ثَوْبًا حَتَّى تُرَقِّعِيهِ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ صَالِحِ بْنِ حَسَّانَ قَالَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ: صَالِحُ بْنُ حَسَّانَ مُنكر الحَدِيث","english":{"narrator":"","text":"‘A’isha told that God’s messenger said to her, “If you wish to join me, ‘A’isha, be satisfied with worldly things to the extent of a rider’s provision, avoid sitting with the rich, and do not consider a garment worn out till you patch it.” \nTirmidhi transmitted it saying this is a gharib tradition which he knew only among the traditions of Salih b. Hassan whose traditions are stated by Muhammad b. Isma'il ( i.e. Bukhari) to be rejected."}},{"id":37,"idInBook":37,"chapterId":22,"bookId":14,"arabic":"عَن أبي أُمَامَة إِياس بن ثعلبةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَلَا تَسْمَعُونَ؟ أَلَا تَسْمَعُونَ أَنَّ الْبَذَاذَةَ مِنَ الْإِيمَانِ أَنَّ الْبَذَاذَةَ مِنَ الْإِيمَانِ؟» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Abu Umama lyas b. Tha'laba reported God’s messenger as saying, “Listen, listen! Wearing old clothes is a part of faith, wearing old clothes is a part of faith.” \nAbu Dawud transmitted it."}},{"id":38,"idInBook":38,"chapterId":22,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ لَبِسَ ثَوْبَ شهرةٍ منَ الدُّنْيَا أَلْبَسَهُ اللَّهُ ثَوْبَ مَذَلَّةٍ يَوْمَ الْقِيَامَةِ» . رَوَاهُ أَحْمد وَأَبُو دَاوُد وَابْن مَاجَه","english":{"narrator":"","text":"Ibn ‘Umar reported God’s messenger as saying, “He who wears grand clothes in this world will be made by God to wear humble clothes on the day of resurrection.” \nAhmad, Abu Dawud and Ibn Majah transmitted it."}},{"id":39,"idInBook":39,"chapterId":22,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ تَشَبَّهَ بِقَوْمٍ فَهُوَ مِنْهُمْ» . رَوَاهُ أَحْمد وَأَبُو دَاوُد","english":{"narrator":"","text":"He reported God’s messenger as saying, “He who copies any people is one of them.” \nAhmad and Abu Dawud transmitted it."}},{"id":40,"idInBook":40,"chapterId":22,"bookId":14,"arabic":"وَعَنْ سُوَيْدِ بْنِ وَهْبٍ عَنْ رَجُلٍ مِنْ أَبْنَاءِ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أَبِيهِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" مَنْ تَرَكَ لُبْسَ ثوبِ جمالٍ وَهُوَ يقدرُ عَلَيْهِ وَفِي رَاوِيه: تَوَاضُعًا كَسَاهُ اللَّهُ حُلَّةَ الْكَرَامَةِ وَمَنْ تَزَوَّجَ لِلَّهِ تَوَجَّهُ اللَّهُ تَاجَ الْمُلْكِ \". رَوَاهُ أَبُو دَاوُد\nوَرَوَى التِّرْمِذِيُّ مِنْهُ عَنْ مُعَاذِ بْنِ أَنَسٍ حَدِيث اللبَاس","english":{"narrator":"","text":"Suwaid b. Wahb quoted a son of a Companion of God’s messenger who said his father reported God’s messenger as saying, “He who gives up wearing beautiful garments when he is able to do so (out of humility, as is stated in a version) will be clothed by God with the robe of honour, and he who marries for God's sake will be crowned by God with the crown of the kingdom.” \nAbu Dawud transmitted it, and Tirmidhi transmitted the tradition about the clothing on Suwaid’s authority on the authority of Mu'adh b. Anas."}},{"id":41,"idInBook":41,"chapterId":22,"bookId":14,"arabic":"وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ اللَّهَ يُحِبُّ أَنْ يُرَى أَثَرَ نِعْمَتِهِ على عَبده» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"‘ Amr b. Shu'aib, on his father’s authority, told that his grandfather reported God’s messenger as saying, “God likes the mark of His favour to be seen on his servant.” (People whom God has prospered should wear clothes suitable for their station, for the poor may recognise them as people able to give charity. The learned should not conceal their learning, so that others may benefit from it)\nTirmidhi transmitted it."}},{"id":42,"idInBook":42,"chapterId":22,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: أَتَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَائِرًا فَرَأَى رَجُلًا شَعِثًا قد تفرق شعرُه فَقَالَ: «مَا كَانَ يَجِدُ هَذَا مَا يُسَكِّنُ بِهِ رَأْسَهُ؟» وَرَأى رجلا عَلَيْهِ ثيابٌ وسِخةٌ فَقَالَ: «مَا كَانَ يَجِدُ هَذَا مَا يَغْسِلُ بِهِ ثَوْبَهُ؟» . رَوَاهُ أَحْمد وَالنَّسَائِيّ","english":{"narrator":"","text":"Jabir said God’s messenger came to pay them a visit, and seeing a dishevelled man whose hair was untidy he said, “Could this man not find something to make his hair lie down ?” He saw a man wearing dirty clothes and said, “Could this man not find something to wash his garment with?” \nAhmad and Nasa’i transmitted it."}},{"id":43,"idInBook":43,"chapterId":22,"bookId":14,"arabic":"وَعَن أبي الأحوصِ عَن أبيهِ قَالَ: أَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَى ثَوْبٌ دُونٌ فَقَالَ لِي: «أَلَكَ مَالٌ؟» قُلْتُ: نَعَمْ. قَالَ: «مِنْ أَيِّ الْمَالِ؟» قُلْتُ: مِنْ كُلِّ الْمَالِ قَدْ أَعْطَانِي اللَّهُ منَ الإِبلِ وَالْبَقر وَالْخَيْلِ وَالرَّقِيقِ. قَالَ: «فَإِذَا آتَاكَ اللَّهُ مَالًا فَلْيُرَ أَثَرُ نِعْمَةِ اللَّهِ عَلَيْكَ وَكَرَامَتِهِ» . رَوَاهُ أَحْمَدُ وَالنَّسَائِيُّ وَفِي شَرْحِ السُّنَّةِ بِلَفْظِ الْمَصَابِيحِ","english":{"narrator":"Abul Ahwas quoted his father as saying:","text":"I came to God’s messenger wearing a poor garment and he asked me whether I had any property. When I replied that I had, he asked me what kind it was, and I said, \"Every kind; God has given me camels, cattle, sheep, horses and slaves.” He then said, “When God gives you property let the mark of His favour and honour to you be seen.” \nAhmad and Nasa'i transmitted it. In Sharh as-sunna it has the wording in al-Masabih."}},{"id":44,"idInBook":44,"chapterId":22,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ: مَرَّ رَجُلٌ وَعَلَيْهِ ثَوْبَانِ أَحْمَرَانِ فَسَلَّمَ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمْ يَرُدَّ عَلَيْهِ. رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد","english":{"narrator":"","text":"‘Abdallah b. ‘Amr told that when a man wearing two red garments passed the Prophet and gave him a greeting he did not respond to his greeting. \nTirmidhi and Abu Dawud transmitted it."}},{"id":45,"idInBook":45,"chapterId":22,"bookId":14,"arabic":"وَعَنْ عِمْرَانَ بْنِ حُصَيْنٍ أَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا أَرْكَبُ الْأُرْجُوَانَ وَلَا أَلْبَسُ الْمُعَصْفَرَ وَلَا أَلْبَسُ الْقَمِيصَ الْمُكَفَّفَ بِالْحَرِيرِ» وَقَالَ: «أَلَا وَطِيبُ الرِّجَالِ رِيحٌ لَا لَوْنَ لَهُ وَطِيبُ النِّسَاءِ لَوْنٌ لَا ريح لَهُ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"‘Imran b. Husain reported God’s Prophet as saying, “I do not ride on purple, or wear a garment dyed with saffron, or wear a shirt hemmed with silk.” He also said, “The perfume used by men should have an odour but no colour, and the perfume used by women should have a colour but no odour.” \nAbu Dawud transmitted it."}},{"id":46,"idInBook":46,"chapterId":22,"bookId":14,"arabic":"وَعَن أبي ريحانةَ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ عَشْرٍ: عَنِ الْوَشْرِ وَالْوَشْمِ وَالنَّتْفِ وَعَنْ مُكَامَعَةِ الرَّجُلِ الرَّجُلَ بِغَيْرِ شِعَارٍ وَمُكَامَعَةِ الْمَرْأَةِ الْمَرْأَةَ بِغَيْرِ شِعَارٍ وَأَنْ يَجْعَلَ الرَّجُلُ فِي أَسْفَلِ ثِيَابِهِ حَرِيرًا مِثْلَ الْأَعَاجِمِ أَوْ يجعلَ على مَنْكِبَيْه حَرِير مِثْلَ الْأَعَاجِمِ وَعَنِ النُّهْبَى وَعَنْ رُكُوبِ النُّمُورِ وَلُبُوسِ الْخَاتَمِ إِلَّا لِذِي سُلْطَانٍ \". رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ","english":{"narrator":"Abu Raihana said God’s messenger forbade ten things :","text":"sharpening the ends of the teeth, tattooing, plucking hairs, men sleeping together without an under garment, women sleeping together without an under garment, men putting silk at the bottom of their garments like Persians, or putting silk on their shoulders like Persians, plundering, riding on panther skins, wearing signet-rings, except in the case of one in authority.\nAbu Dawud and Nasa'i transmitted it."}},{"id":47,"idInBook":47,"chapterId":22,"bookId":14,"arabic":"وَعَن عَليّ قَالَ: نَهَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ خَاتَمِ الذَّهَبِ وَعَنْ لُبْسِ الْقَسِّيِّ وَالْمَيَاثِرِ. رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالنَّسَائِيُّ وَابْنُ مَاجَهْ وَفِي رِوَايَة لأبي دَاوُد قَالَ: نهى عَن مياثر الأرجوان","english":{"narrator":"","text":"‘Ali said God’s messenger forbade him to wear a gold ring, or a Qassi garment, or to use saddle-cloths. \nTirmidhi, Abu Dawud, Nasa’i and Ibn Majah transmitted it. In a version by Abu Dawud he said he forbade purple saddle-cloths."}},{"id":48,"idInBook":48,"chapterId":22,"bookId":14,"arabic":"وَعَنْ مُعَاوِيَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَرْكَبُوا الْخَزَّ وَلَا النِّمَارَ» . رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ","english":{"narrator":"","text":"Mu'awjya reported God’s messenger as saying, “Do not ride on silk stuff or panther skins.” \nAbu Dawud and Nasa’i transmitted it."}},{"id":49,"idInBook":49,"chapterId":22,"bookId":14,"arabic":"وَعَنِ الْبَرَاءِ بْنِ عَازِبٍ: أَنَّ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْمِيثَرَةِ الْحَمْرَاءِ. رَوَاهُ فِي شرح السّنة","english":{"narrator":"","text":"Al-Bara’ b. ‘Azib told that the Prophet forbade red saddle-cloths. It is transmitted in Sharh as-sunna."}},{"id":50,"idInBook":50,"chapterId":22,"bookId":14,"arabic":"وَعَن أبي رِمْثةَ التيميِّ قَالَ: أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَيْهِ ثَوْبَانِ أَخْضَرَانِ وَلَهُ شَعَرٌ قَدْ عَلَاهُ الشَّيْبُ وَشَيْبُهُ أَحْمَرُ. رَوَاهُ التِّرْمِذِيُّ وَفِي رِوَايَةٍ لِأَبِي دَاوُدَ: وَهُوَ ذُو وَفْرَةٍ وَبِهَا رَدْعٌ من حناء","english":{"narrator":"Abu Rimtha at-Taimi said:","text":"When I came to the Prophet he was wearing two green garments, his hair was turning grey, but the grey was dyed red. \nTirmidhi transmitted it; In a version by Abu Dawud it says he had hanging locks (These locks would hang down as far as the lobes of the ears) stained with henna."}},{"id":51,"idInBook":51,"chapterId":22,"bookId":14,"arabic":"وَعَنْ أَنَسٍ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ شَاكِيًا فَخَرَجَ يَتَوَكَّأُ عَلَى أُسَامَةَ وَعَلَيْهِ ثَوْبُ قِطْرٍ قَدْ تَوَشَّحَ بِهِ فَصَلَّى بهم. رَوَاهُ فِي شرح السّنة","english":{"narrator":"","text":"Anas told that when the Prophet was ill he came out leaning on Usama, wearing a striped garment with an end over his left shoulder, and led them in the prayer. \nIt is transmitted in Sharh as-sunna."}},{"id":52,"idInBook":52,"chapterId":22,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ قَالَتْ: كَانَ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَوْبَانِ قِطْرِيَّانِ غَلِيظَانِ وَكَانَ إِذا قعد فرق ثَقُلَا عَلَيْهِ فَقَدِمَ بَزٌّ مِنَ الشَّامِ لِفُلَانٍ الْيَهُودِيِّ. فَقُلْتُ: لَوْ بَعَثْتَ إِلَيْهِ فَاشْتَرَيْتَ مِنْهُ ثَوْبَيْنِ إِلَى الْمَيْسَرَةِ فَأَرْسَلَ إِلَيْهِ فَقَالَ: قَدْ عَلِمْتُ مَا تُرِيدُ إِنَّمَا تُرِيدُ أَنْ تَذْهَبَ بِمَالِي فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «كَذَبَ قَدْ عَلِمَ أَنِّي مِنْ أَتْقَاهُمْ وآداهُم للأمانة» . رَوَاهُ التِّرْمِذِيّ وَالنَّسَائِيّ","english":{"narrator":"","text":"‘A’isha said ; The Prophet wore two coarse striped garments, and when he sat and sweated he felt them heavy. A certain Jew received a consignment of cloth from Syria, so I suggested he should send to him and buy two garments from him to be paid when circumstances were easier. He did so, and when the man replied, “I know what you want; all you want is to go off with my property,” God’s messenger said, “He has lied; he knows I am one of the most pious of them and most accustomed to pay what is given on trust.” \nTirmidhi and Nasa’i transmitted it."}},{"id":53,"idInBook":53,"chapterId":22,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ قَالَ: رَآنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَى ثَوْبٌ مَصْبُوغٌ بِعُصْفُرٍ مُوَرَّدًا فَقَالَ: «مَا هَذَا؟» فَعَرَفْتُ مَا كَرِهَ فَانْطَلَقْتُ فَأَحْرَقْتُهُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا صَنَعْتَ بِثَوْبِكَ؟» قُلْتُ: أَحْرَقْتُهُ قَالَ: «أَفَلَا كَسَوْتَهُ بَعْضَ أَهْلِكَ؟ فَإِنَّهُ لَا بَأْسَ بِهِ لِلنِّسَاءِ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"‘Abdallah b. ‘Amr b. al-‘As said :","text":"God’s messenger saw me wearing a garment dyed with a reddish yellow dye and asked what this was, so as I recognised what he disliked I went away and burned it. He asked me what I had done with my garment, and when I told him I had burned it he said, “Why did you not give it to one of your family to wear, for there is no harm in it for women ?” \nAbu Dawud transmitted it."}},{"id":54,"idInBook":54,"chapterId":22,"bookId":14,"arabic":"وَعَن هلالِ بن عَامر عَن أَبِيه قَالَ: رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِنًى يَخْطُبُ عَلَى بَغْلَةٍ وَعَلَيْهِ بُرْدٌ أَحْمَرُ وَعَلِيٌّ أَمَامَهُ يُعَبِّرُ عَنْهُ. رَوَاهُ أَبُو دَاوُدَ","english":{"narrator":"","text":"Hilal b. ‘Amir quoted his father as saying he saw the Prophet in Mina on a she-mule giving an address, wearing a red cloak, with ‘Ali in front of him repeating what he said. (This was because the crowd was too large for all to hear the Prophet. ‘AIi was repeating his words for the benefit of those too far away to bear the address) \nAbu Dawud transmitted it."}},{"id":55,"idInBook":55,"chapterId":22,"bookId":14,"arabic":"وَعَن عَائِشَة قَالَتْ: صُنِعَتْ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بُرْدَةٌ سَوْدَاءُ فَلَبِسَهَا فَلَمَّا عَرِقَ فِيهَا وَجَدَ ريح الصُّوف فقذفها. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"‘A’isha said a black cloak was made for the Prophet and he put it on, but when he sweated in it and noticed the odour of the wool, he threw it away. \nAbu Dawud transmitted it."}},{"id":56,"idInBook":56,"chapterId":22,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ مُحْتَبٍ بِشَمْلَةٍ قَدْ وَقَعَ هُدْبها على قَدَمَيْهِ. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Jabir said ; When I came to the Prophet he was sitting with his hands round his knees wearing a cloak the fringe of which was over his feet. \nAbu Dawud transmitted it."}},{"id":57,"idInBook":57,"chapterId":22,"bookId":14,"arabic":"وَعَن دِحيةَ بن خليفةَ قَالَ: أَتَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقَبَاطِيَّ فَأَعْطَانِي مِنْهَا قُبْطِيَّةً فَقَالَ: «اصْدَعْهَا صَدْعَيْنِ فَاقْطَعْ أَحَدَهُمَا قَمِيصًا وَأَعْطِ الْآخَرَ امْرَأَتَكَ تَخْتَمِرُ بِهِ» . فَلَمَّا أَدْبَرَ قَالَ: «وَأْمُرِ امْرَأَتَكَ أَنْ تَجْعَلَ تَحْتَهُ ثَوْبًا لَا يَصِفُهَا» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"Dihya b. Khalifa said :","text":"When the Prophet was brought some pieces of fine Egyptian linen he gave me one and said, “Divide it into two; cut one of the pieces into a shirt and give the other to your wife for a veil.” Then when he turned away he said, “And order your wife to wear a garment below it and not show her figure.” \nAbu Dawud transmitted it."}},{"id":58,"idInBook":58,"chapterId":22,"bookId":14,"arabic":"وَعَنْ أُمِّ سَلَمَةَ إِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَيْهَا وَهِيَ تَخْتَمِرُ فَقَالَ: «ليَّةً لَا ليَّتينِ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Umm Salama said the Prophet came to visit her when she was veiled and said, “Use one fold, not two.” \nAbu Dawud transmitted it."}},{"id":59,"idInBook":59,"chapterId":22,"bookId":14,"arabic":"عَن ابنِ عمَرِ قَالَ: مَرَرْتُ بِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَفِي إِزَارِي اسْتِرْخَاءٌ فَقَالَ: «يَا عَبْدَ اللَّهِ ارْفَعْ إِزَارَكَ» فَرَفَعْتُهُ ثُمَّ قَالَ: «زِدْ» فَزِدْتُ فَمَا زِلْتُ أَتَحَرَّاهَا بَعْدُ فَقَالَ: بَعْضُ الْقَوْمِ: إِلَى أَيْنَ؟ قَالَ: «إِلَى أَنْصَافِ السَّاقَيْنِ» . رَوَاهُ مُسلم","english":{"narrator":"Ibn ‘Umar said:","text":"Part of my lower garment was hanging down when I passed by God’s messenger, so he said, “Raise your lower garment, ‘Abdallah.” I did so and he told mo to raise it higher. I did so, and as I was still trying to find the best place  one of the people asked where it should reach and he replied, “Halfway up the legs.” \nMuslim transmitted it."}},{"id":60,"idInBook":60,"chapterId":22,"bookId":14,"arabic":"وَعَنْهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ جَرَّ ثَوْبَهُ خُيَلَاءَ لَمْ يَنْظُرِ اللَّهُ إِلَيْهِ يَوْمَ الْقِيَامَةِ» . فَقَالَ أَبُو بَكْرٍ: يَا رَسُولَ اللَّهِ إِزَارِي يَسْتَرْخِي إِلَّا أَنْ أَتَعَاهَدَهُ. فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّكَ لَسْتَ مِمَّنْ يَفْعَلُهُ خُيَلَاءَ» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"He reported the Prophet as saying, “On the day of resurrection God will not look at him who trails his garment arrogantly.” Abu Bakr then said, “Messenger of God, my lower garment hangs down unless I keep paying attention to it,” to which God’s messenger replied, “You are not one of those who do it arrogantly.” \nBukhari transmitted it."}},{"id":61,"idInBook":61,"chapterId":22,"bookId":14,"arabic":"وَعَن عِكْرِمَة قَالَ: رأيتُ ابنَ عَبَّاس يَأْتَزِرُ فَيَضَعُ حَاشِيَةَ إِزَارِهِ مِنْ مُقَدَّمِهِ عَلَى ظَهْرِ قَدَمِهِ وَيَرْفَعُ مِنْ مُؤَخَّرِهِ قُلْتُ لِمَ تَأْتَزِرُ هَذِهِ الْإِزْرَةَ؟ قَالَ: رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يأتزرها. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"‘Ikrima told that when he saw Ibn ‘Abbas putting on a lower garment, letting the hem in front fall on the top of his foot and raising it behind, he asked why he did it that way and he replied that that was how he had seen God’s messenger do it. \nAbu Dawud transmitted it."}},{"id":62,"idInBook":62,"chapterId":22,"bookId":14,"arabic":"وَعَنْ عُبَادَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «عَلَيْكُمْ بالعمائم فَإِنَّهَا سيماء الْمَلَائِكَة وأخوها خلف ظهوركم» . رَوَاهُ الْبَيْهَقِيّ","english":{"narrator":"","text":"‘Ubada reported God’s messenger as saying, “Keep to turbans, for they are the mark of the angels, and let  hang down behind your backs.” \nBaihaqi transmitted it in Shu'ab al-iman."}},{"id":63,"idInBook":63,"chapterId":22,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ أَنَّ أَسْمَاءَ بِنْتَ أَبِي بَكْرٍ دَخَلْتُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَيْهَا ثِيَاب رقاق فَأَعْرض عَنهُ وَقَالَ: «يَا أَسْمَاءُ إِنَّ الْمَرْأَةَ إِذَا بَلَغَتِ الْمَحِيضَ لَنْ يَصْلُحَ أَنْ يُرَى مِنْهَا إِلَّا هَذَا وَهَذَا» . وَأَشَارَ إِلَى وَجْهِهِ وَكَفَّيْهِ. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"A’isha told that when Asma’ daughter of Abu Bakr came in to visit God's messenger wearing thin clothes he turned away from her and said, “When a woman is old enough to menstruate, Asma’, it is not right that any part of her should be seen but this and this,” pointing to his face and his hands. \nAbu Dawud transmitted it."}},{"id":64,"idInBook":64,"chapterId":22,"bookId":14,"arabic":"وَعَنْ أَبِي مَطَرٍ قَالَ: إِنْ عَلِيًّا اشْتَرَى ثَوْبًا بِثَلَاثَةِ دَرَاهِمَ فَلَمَّا لَبِسَهُ قَالَ: «الْحَمْدُ لِلَّهِ الَّذِي رَزَقَنِي مِنَ الرِّيَاشِ مَا أَتَجَمَّلُ بِهِ فِي الناسِ وأُواري بِهِ عورتي» ثُمَّ قَالَ: هَكَذَا سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُول. رَوَاهُ أَحْمد","english":{"narrator":"","text":"Abu Matar told that ‘Ali bought a garment for three dirhams, and when he put it on he said, “Praise be to God who has provided me with fine clothes with which to adorn myself among men and cover my nakedness.” He then said, “Thus did I hear God's messenger say.” \nAhmad transmitted it."}},{"id":65,"idInBook":65,"chapterId":22,"bookId":14,"arabic":"وَعَن أبي أُمامةَ قَالَ: لَبِسَ عُمَرُ بْنُ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ ثَوْبًا جَدِيدًا فَقَالَ: الْحَمْدُ لِلَّهِ الَّذِي كَسَانِي مَا أُوَارِي بِهِ عَوْرَتِي وَأَتَجَمَّلُ بِهِ فِي حَيَاتِي ثُمَّ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: \n\" مَنْ لَبِسَ ثَوْبًا جَدِيدًا فَقَالَ: الْحَمْدُ لِلَّهِ الَّذِي كَسَانِي مَا أُوَارِي بِهِ عَوْرَتِي وَأَتَجَمَّلُ بِهِ فِي حَيَاتِي ثُمَّ عَمَدَ إِلَى الثَّوْبِ الَّذِي أَخْلَقَ فَتَصَدَّقَ بِهِ كَانَ فِي كَنَفِ اللَّهِ وَفِي حِفْظِ اللَّهِ وَفِي سِتْرِ اللَّهِ حَيًّا وَمَيِّتًا \". رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَابْنُ مَاجَهْ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ غَرِيبٌ","english":{"narrator":"","text":"Abu Umama told that ‘Umar b. al-Khattab put on a new garment and said, “Praise be to God who has clothed me with something with which to cover my nakedness and adorn myself in my lifetime.” He then told that he had heard God's messenger say that if anyone who puts on a new garment says, “Praise be to God who has clothed me with something with which to cover my nakedness and adorn myself in my lifetime,” then takes the old garment and gives it as sadaqa, he will be in God’s protection, guardianship and shelter both when alive and when dead. \nAhmad, Tirmidhi and Ibn Majah transmitted it, Tirmidhi saying this is a gharib tradition."}},{"id":66,"idInBook":66,"chapterId":22,"bookId":14,"arabic":"وَعَنْ عَلْقَمَةَ بْنِ أَبِي عَلْقَمَةَ عَنْ أُمِّهِ قَالَتْ: دَخَلَتْ حَفْصَةُ بِنْتُ عَبْدِ الرَّحْمَنِ عَلَى عَائِشَةَ وَعَلَيْهَا خِمَارٌ رَقِيقٌ فَشَقَّتْهُ عَائِشَةُ وَكَسَتْهَا خمارا كثيفا. رَوَاهُ مَالك","english":{"narrator":"","text":"‘Alqama b. Abu ‘Alqama quoted his mother as saying that when Hafsa daughter of ‘Abd ar-Rahman visited ‘A’isha wearing a thin veil, ‘A’isha tore it and put a thick veil on her. \nMalik transmitted it."}},{"id":67,"idInBook":67,"chapterId":22,"bookId":14,"arabic":"وَعَنْ عَبْدِ الْوَاحِدِ بْنِ أَيْمَنَ عَنْ أَبِيهِ قَالَ: دَخَلَتْ عَلَى عَائِشَةَ وَعَلَيْهَا دِرْعٌ قِطْرِيٌّ ثَمَنُ خَمْسَةِ دَرَاهِمَ فَقَالَتْ: ارْفَعْ بَصَرَكَ إِلَى جَارِيَتِي انْظُرْ إِلَيْهَا فَإِنَّهَا تُزْهَى أَنْ تَلْبَسَهُ فِي البيتِ وَقد كَانَ لِي مِنْهَا دِرْعٌ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَا كَانَتِ امْرَأَةٌ تُقَيَّنُ بِالْمَدِينَةِ إِلَّا أَرْسَلَتْ إِلَيَّ تَسْتَعِيرُهُ. رَوَاهُ البُخَارِيّ","english":{"narrator":"‘Abd al-Wahid b. Aiman quoted his father as saying :","text":"I went in to visit ‘A’isha, and she was wearing a Qitri (A coarse kind of material. The name is said to be connected with a place, but there is a difference of opinion as to whether it was in Egypt or in the neighbourhood of al-Bahrain) shift which had cost five dirhams. She said, “Lift up your eyes to my slavegirl and look at her, for she is too proud to wear it in the house, yet I had a shift of this type in the time of God’s messenger, and there was not a woman in Medina who was being adorned who did not send to me to borrow it.” \nBukhari transmitted it."}},{"id":68,"idInBook":68,"chapterId":22,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: لَبِسَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمًا قَبَاءَ دِيبَاجٍ أُهْدِيَ لَهُ ثُمَّ أَوْشَكَ أَنْ نَزَعَهُ فَأَرْسَلَ بِهِ إِلَى عُمَرَ فَقِيلَ: قَدْ أَوْشَكَ مَا انْتَزَعْتَهُ يَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «نهاني عَنهُ جبريلُ» فَجَاءَ عُمَرُ يَبْكِي فَقَالَ: يَا رَسُولَ اللَّهِ كرهتَ أَمْرًا وَأَعْطَيْتَنِيهِ فَمَا لِي؟ فَقَالَ: «إِنِّي لَمْ أُعْطِكَهُ تَلْبَسُهُ إِنَّمَا أَعْطَيْتُكَهُ تَبِيعُهُ» . فَبَاعَهُ بِأَلْفَيْ دِرْهَم. رَوَاهُ مُسلم","english":{"narrator":"","text":"Jabir told that one day God’s messenger put on a sleeved gown of brocade which had been presented to him, but quickly took it off and sent it to ‘Umar., When remarks were made about the speed with which he had taken it off he replied, “Gabriel forbade it to me.\" ‘Umar then came weeping and said, “Messenger of God, you disliked something and gave it to me. ‘Now what is the matter with me ?\" He replied, “I did not give it to you to wear it, but I gave it to you simply that you might sell it.\" He then sold it for two thousand dirhams. \nMuslim transmitted it."}},{"id":69,"idInBook":69,"chapterId":22,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: إِنَّمَا نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ثَوْبِ الْمُصْمَتِ مِنَ الْحَرِيرِ فَأَمَّا الْعَلَمُ وَسَدَى الثَّوْبِ فَلَا بَأْسَ بِهِ. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Ibn ‘Abbas said it was only a garment wholly made of silk which God’s messenger forbade, but there was no harm in the ornamented border and the warp. \nAbu Dawud transmitted it."}},{"id":70,"idInBook":70,"chapterId":22,"bookId":14,"arabic":"وَعَنْ أَبِي رَجَاءٍ قَالَ: خَرَجَ عَلَيْنَا عِمْرَانُ بْنُ حُصَيْنٍ وَعَلَيْهِ مِطْرَفٌ مِنْ خَزٍّ وَقَالَ: إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ أَنْعَمَ اللَّهُ عَلَيْهِ نِعْمَةً فَإِنَّ اللَّهَ يُحِبُّ أَنْ يَرَى أَثَرَ نِعْمَتِهِ عَلَى عَبده» . رَوَاهُ أَحْمد","english":{"narrator":"Abu Raja’ said :","text":"‘Imran b. Husain came out to us wearing a robe of silk ware with ornamented borders and declared that God's messenger had said, “If God shows favour to anyone, He likes the mark of His favour to be seen on His servant.\" \nAhmad transmitted it."}},{"id":71,"idInBook":71,"chapterId":22,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: كُلْ مَا شِئْتَ وَالْبَسْ مَا شِئْتَ مَا أَخْطَأَتْكَ اثْنَتَانِ: سَرَفٌ وَمَخِيلَةٌ. رَوَاهُ الْبُخَارِيُّ فِي تَرْجَمَة بَاب","english":{"narrator":"Ibn ‘Abbas said :","text":"Eat what you like and wear what you like as long as two things miss you : prodigality and pride. \nBukhari transmitted it in a chapter heading."}},{"id":72,"idInBook":72,"chapterId":22,"bookId":14,"arabic":"وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «كُلُوا وَاشْرَبُوا وَتَصَدَّقُوا وَالْبَسُوا مَا لم يُخالطْ إِسْرَافٌ وَلَا مَخِيلَةٌ» . رَوَاهُ أَحْمَدُ وَالنَّسَائِيُّ وَابْنُ مَاجَه","english":{"narrator":"","text":"‘Amr b. Shu'aib, on his father’s authority, told that his grandfather reported God’s messenger as saying, “Eat, drink, give sadaqa and wear clothes so long as neither prodigality nor pride is mixed up with it.\" \nAhmad, Nasa’i and Ibn Majah transmitted it."}},{"id":73,"idInBook":73,"chapterId":22,"bookId":14,"arabic":"وَعَنْ أَبِي الدَّرْدَاءِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ أَحْسَنَ مَا زُرْتُمُ اللَّهَ فِي قُبُورِكُمْ وَمَسَاجِدِكُمُ الْبَيَاضُ» . رَوَاهُ ابْن مَاجَه","english":{"narrator":"","text":"Abud Darda’ reported God’s messenger as saying, “The best thing in which to visit God in your graves and in your mosques is white.\" \nIbn Majah transmitted it."}},{"id":74,"idInBook":74,"chapterId":22,"bookId":14,"arabic":"عَنِ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: اتَّخَذَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَاتَمًا مِنْ ذَهَبٍ وَفِي رِوَايَةٍ: وَجَعَلَهُ فِي يَدِهِ الْيُمْنَى ثُمَّ أَلْقَاهُ ثُمَّ اتَّخَذَ خَاتَمًا مِنْ الْوَرق نُقِشَ فِيهِ: مُحَمَّدٌ رَسُولُ اللَّهِ وَقَالَ: «لَا يَنْقُشَنَّ أَحَدٌ عَلَى نَقْشِ خَاتَمِي هَذَا» . وَكَانَ إِذَا لَبِسَهُ جَعَلَ فَصَّهُ مِمَّا يَلِي بَطْنَ كَفه","english":{"narrator":"Ibn ‘Umar said the Prophet took a signet-ring of gold. A version:","text":"says he put it on his right hand, then threw it away and took one of silver on which he engraved, “Muhammad God’s messenger,” saying, “No one must engrave anything in the manner of this signet-ring of mine.” When he wore it he put the stone next the palm of his hand. \n(Bukhari and Muslim.)"}},{"id":75,"idInBook":75,"chapterId":22,"bookId":14,"arabic":"وَعَنْ عَلِيٍّ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ لُبْسِ الْقَسِّيِّ وَالْمُعَصْفَرِ وَعَنْ تَخْتُّمِ الذَّهَبِ وَعَنْ قِرَاءَةِ الْقُرْآنِ فِي الرُّكُوعِ. رَوَاهُ مُسلم","english":{"narrator":"","text":"‘Ali said God's messenger forbade wearing Qassi material and anything dyed with saffron, using a gold ring, and reciting the Qur'an when making the bow. \nMuslim transmitted it."}},{"id":76,"idInBook":76,"chapterId":22,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى خَاتَمًا مِنْ ذَهَبٍ فِي يَدِ رَجُلٍ فَنَزَعَهُ فَطَرَحَهُ فَقَالَ: «يَعْمِدُ أَحَدُكُمْ إِلَى جَمْرَةٍ مِنْ نَارٍ فَيَجْعَلُهَا فِي يَدِهِ؟» فَقِيلَ لِلرَّجُلِ بَعْدَمَا ذَهَبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: خُذْ خَاتَمَكَ انْتَفِعْ بِهِ. قَالَ: لَا وَاللَّهِ لَا آخُذُهُ أَبَدًا وَقَدْ طَرَحَهُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ. رَوَاهُ مُسلم","english":{"narrator":"","text":"‘Abdallah b. ‘Abbas told that when God’s messenger saw a gold signet-ring on a man’s hand he pulled it off and threw it away saying, “One of you is making for a coal from hell and putting it on his hand.” After God’s messenger had departed someone said to the man, “Take your signet-ring and get some good from it,” but he replied, “No, I swear by God that I shall never take it when God’s messenger has thrown it away.” \nMuslim transmitted it."}},{"id":77,"idInBook":77,"chapterId":22,"bookId":14,"arabic":"وَعَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرَادَ أَنْ يَكْتُبَ إِلَى كِسْرَى وَقَيْصَرَ وَالنَّجَاشِيِّ فَقِيلَ: إِنَّهُمْ لَا يَقْبَلُونَ كِتَابًا إِلَّا بِخَاتَمٍ فَصَاغَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَاتَمًا حَلْقَةَ فِضَّةٍ نُقِشَ فِيهِ: مُحَمَّدٌ رَسُولُ اللَّهِ. رَوَاهُ مُسْلِمٌ. وَفِي رِوَايَةٍ لِلْبُخَارِيِّ: كَانَ نَقْشُ الْخَاتَمِ ثَلَاثَةَ أَسْطُرٍ: مُحَمَّدٌ سَطْرٌ ورسولُ الله سطر وَالله سطر","english":{"narrator":"","text":"Anas said that when the Prophet wanted to write to the Persian Emperor, the Byzantine Emperor and the Negus he was told that they would not accept a letter without a seal; so God’s messenger fashioned a seal in the form of a silver ring on which he engraved “Muhammad God’s messenger.” \nMuslim transmitted it. A version by Bukhari says the engraving on the seal was in three lines, “Muhammad” being one, “messenger” another, and “of God” another."}},{"id":78,"idInBook":78,"chapterId":22,"bookId":14,"arabic":"وَعَنْهُ أَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ خَاتَمُهُ مِنْ فِضَّةٍ وَكَانَ فَصُّهُ مِنْهُ. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"He said the Prophet’s signet-ring was of silver as was also its stone. \nBukhari transmitted it."}},{"id":79,"idInBook":79,"chapterId":22,"bookId":14,"arabic":"وَعَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَبِسَ خَاتَمَ فِضَّةٍ فِي يَمِينِهِ فِيهِ فَصٌّ حَبَشِيٌّ كَانَ يَجْعَلُ فَصَّهُ مِمَّا يَلِي كَفه","english":{"narrator":"","text":"He said God’s messenger wore on his right hand a silver signet-ring with an Abyssinian stone, and put its stone next the palm of his hand. \n(Bukhari and Muslim.)"}},{"id":80,"idInBook":80,"chapterId":22,"bookId":14,"arabic":"وَعَنْهُ قَالَ: كَانَ خَاتَمُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي هَذِهِ وَأَشَارَ إِلَى الْخِنْصِرِ منْ يَده الْيُسْرَى. رَوَاهُ مُسلم","english":{"narrator":"","text":"He said, pointing to the little finger of his left hand, “The Prophet’s signet-ring was on this.” \nMuslim transmitted it."}},{"id":81,"idInBook":81,"chapterId":22,"bookId":14,"arabic":"وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ: نَهَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم إِن أَتَخَتَّمَ فِي إِصْبَعِي هَذِهِ أَوْ هَذِهِ قَالَ: فَأَوْمَأَ إِلَى الْوُسْطَى وَالَّتِي تَلِيهَا. رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"‘Ali, pointing to the middle finger and the one next it, said, “God’s messenger forbade me to wear a signet-ring on this finger of mine or on this.” \nMuslim transmitted it."}},{"id":82,"idInBook":82,"chapterId":22,"bookId":14,"arabic":"عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَخَتَّمُ فِي يَمِينه. رَوَاهُ ابْن مَاجَه\nوَرَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ عَن عَليّ","english":{"narrator":"","text":"‘Abdallah b. Ja'far said the Prophet used to wear a signet-ring on his right hand. \nIbn Majah transmitted it, and Abu Dawud and Nasa’i transmitted it on ‘Ali’s authority."}},{"id":83,"idInBook":83,"chapterId":22,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يتختم فِي يسَاره. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Ibn ‘Umar said the Prophet used to wear a signet-ring on his left hand.\nAbu Dawud transmitted it."}},{"id":84,"idInBook":84,"chapterId":22,"bookId":14,"arabic":"وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخَذَ حَرِيرًا فَجَعَلَهُ فِي يَمِينِهِ وَأَخَذَ ذَهَبًا فَجَعَلَهُ فِي شِمَالِهِ ثُمَّ قَالَ: «إِنَّ هَذَيْنِ حَرَامٌ عَلَى ذُكُورِ أُمتي» . رَوَاهُ أَحْمد وَأَبُو دَاوُد وَالنَّسَائِيّ","english":{"narrator":"","text":"‘Ali told that the Prophet, taking some silk and putting it in his right hand, and taking some gold and putting it in his left hand, said, “These are prohibited to the male members of my people.”\nAhmad, Abu Dawud and Nasa’i transmitted it."}},{"id":85,"idInBook":85,"chapterId":22,"bookId":14,"arabic":"وَعَن مُعَاوِيَةُ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ رُكُوبِ النُّمُورِ وَعَنْ لُبْسِ الذَّهَبِ إِلَّا مُقَطَّعًا. رَوَاهُ أَبُو دَاوُدَ وَالنَّسَائِيُّ","english":{"narrator":"","text":"Mu'awiya said God’s messenger forbade riding on panther-skins and wearing gold, except in small pieces. \nAbu Dawud and Nasa'i transmitted it."}},{"id":86,"idInBook":86,"chapterId":22,"bookId":14,"arabic":"وَعَنْ بُرَيْدَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِرَجُلٍ عَلَيْهِ خَاتَمٌ مِنْ شَبَهٍ: «مَا لِي أَجِدُ مِنْكَ رِيحَ الْأَصْنَامِ؟» فَطَرَحَهُ ثُمَّ جَاءَ وَعَلَيْهِ خَاتَمٌ مِنْ حَدِيدٍ فَقَالَ: «مَا لِي أَرَى عَلَيْكَ حِلْيَةَ أَهْلِ النَّارِ؟» فَطَرَحَهُ فَقَالَ: يَا رَسُولَ اللَّهِ مِنْ أَيِّ شَيْءٍ أَتَّخِذُهُ؟ قَالَ: «مِنْ وَرِقٍ وَلَا تُتِمَّهُ مِثْقَالا» . رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد وَالنَّسَائِيّ","english":{"narrator":"","text":"Buraida reported the Prophet as saying to a man who was wearing a signet-ring of yellow copper, “How is it that I notice the odour of idols in you ?” So he threw it away and came wearing an iron signet- ring, and when he said, “How is it that I see you wearing the adornment of the inhabitants of hell ?” he threw it away and asked God’s messenger what material he should use. He replied, “Silver, but do not let it weigh as much as a mithqal.” \nTirmidhi, Abu Dawud and Nasa’i transmitted it. Muhyi as-Sunna said there is a sound tradition on the authority of Sahl b. Sa'd about the dower that the Prophet said to a man, “Seek something, even though it should be an iron signet-ring.”"}},{"id":87,"idInBook":87,"chapterId":22,"bookId":14,"arabic":"وَعَنِ ابْنِ مَسْعُودٍ قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَكْرَهُ عَشْرَ خِلَالٍ: الصُّفْرَةَ يَعْنِي الخلوق وتغييرَ الشيب وجر الأزرار وَالتَّخَتُّمَ بِالذَّهَبِ وَالتَّبَرُّجَ بِالزِّينَةِ لِغَيْرِ مَحِلِّهَا وَالضَّرْبَ بِالْكِعَابِ وَالرُّقَى إِلَّا بِالْمُعَوِّذَاتِ وَعَقْدَ التَّمَائِمِ وَعَزْلَ الْمَاءِ لِغَيْرِ مَحِلِّهِ وَفَسَادَ الصَّبِيِّ غَيْرَ مُحَرِّمِهِ. رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ","english":{"narrator":"Ibn Mas'ud said there were ten things the Prophet disliked :","text":"yellow colouring, meaning khaluq, dyeing grey hair, trailing the lower garment, wearing a gold signet-ring, a woman decking herself before people who are not within the prohibited degrees, throwing dice, using spells, except with the mu'awwidhat (The last two suras of the Qur'an are known as al mu’awwidhatan. Here the plural is used, and the suggestion is made that it may include certain supplications and prayers using names of God ; or that suras cxii and cix may be added to the last two), wearing amulets, withdrawing the penis before the semen is discharged, and having intercourse with a woman who is suckling a child; but he did not declare them to be prohibited.\nAbu Dawud and Nasa’i transmitted it."}},{"id":88,"idInBook":88,"chapterId":22,"bookId":14,"arabic":"وَعَن ابنِ الزبيرِ: أَنَّ مَوْلَاةً لَهُمْ ذَهَبَتْ بِابْنَةِ الزُّبَيْرِ إِلَى عُمَرَ بْنِ الْخَطَّابِ وَفِي رِجْلِهَا أَجْرَاسٌ فَقَطَعَهَا عمر وَقَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَعَ كُلِّ جَرَسٍ شَيْطَانٌ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Ibn az-Zubair told that a woman client of theirs took az-Zubair’s daughter to ‘Umar b. al-Khattab wearing bells on her leg. ‘Umar cut them off and said he had heard God’s messenger say, “There is a devil along with each bell.” \nAbu Dawud transmitted it."}},{"id":89,"idInBook":89,"chapterId":22,"bookId":14,"arabic":"وَعَنْ بُنَانَةَ مَوْلَاةِ عَبْدِ الرَّحْمَنِ بْنِ حَيَّانَ الْأنْصَارِيّ كانتْ عندَ عائشةَ إِذْ دُخِلَتْ عَلَيْهَا بِجَارِيَةٍ وَعَلَيْهَا جَلَاجِلُ يُصَوِّتْنَ فَقَالَتْ: لَا تُدْخِلُنَّهَا عَلَيَّ إِلَّا أَنْ تُقَطِّعُنَّ جَلَاجِلَهَا سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَا تَدْخُلُ الْمَلَائِكَةُ بَيْتًا فِيهِ أَجْرَاس» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Bunana, female client of ‘Abd ar-Rahman b. Hayyan al-Ansari, told that when she was with ‘A’isha a girl wearing tinkling little bells was brought in to her, whereupon she ordered that they were not to bring her in, where she was unless they cut off her little bells, for she had heard God’s messenger say, “The angels do not enter a house in which there is a bell.” \nAbu Dawud transmitted it."}},{"id":90,"idInBook":90,"chapterId":22,"bookId":14,"arabic":"وَعَنْ عَبْدِ الرَّحْمَنِ بْنِ طَرَفَةَ أَنَّ جَدَّهُ عَرفجةَ بن أسعد قُطِعَ أَنْفُهُ يَوْمَ الْكُلَابِ فَاتَّخَذَ أَنْفًا مِنْ وَرِقٍ فَأَنْتَنَ عَلَيْهِ فَأَمَرَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَتَّخِذَ أَنْفًا مِنْ ذَهَبٍ. رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد وَالنَّسَائِيّ","english":{"narrator":"","text":"‘Abd ar-Rahman b. Tarafa told that his grandfather ‘Arfaja b. As'ad who had had his nose cut off at the battle of al-Kulab (This was a battle about ten years before the Hijra in which the tribe of Tamim was engaged) got a silver nose, but it developed a stench, so the Prophet ordered him to get a gold nose. \nTirmidhi, Abu Dawud and Nasa’i transmitted it."}},{"id":91,"idInBook":91,"chapterId":22,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ أَحَبَّ أَنْ يُحَلِّقَ حَبِيبَهُ حَلَقَةً مِنْ نَارٍ فَلْيُحَلِّقْهُ حَلَقَةً مِنْ ذَهَبٍ وَمَنْ أَحَبَّ أَنْ يُطَوِّقَ حَبِيبَهُ طَوْقًا مِنْ نَارٍ فَلْيُطَوِّقْهُ طَوْقًا مِنْ ذَهَبٍ وَمَنْ أَحَبَّ أَنْ يُسَوِّرَ حَبِيبَهُ سِوَارًا مِنْ نَار فليسوره مِنْ ذَهَبٍ وَلَكِنْ عَلَيْكُمْ بِالْفِضَّةِ فَالْعَبُوا بِهَا» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “If anyone wants to put a ring of fire on one he loves let him put a gold ring on him ; if anyone wants to put a necklace of fire on one he loves let him put a gold necklace on him ; and if anyone wants to put a bracelet of fire on one he loves let him put a gold bracelet on him. Keep to silver and amuse yourselves with it.” \nAbu Dawud transmitted it."}},{"id":92,"idInBook":92,"chapterId":22,"bookId":14,"arabic":"وَعَن أَسْمَاءَ بِنْتِ يَزِيدَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أَيُّمَا امْرَأَةٍ تَقَلَّدَتْ قِلَادَةً مِنْ ذَهَبٍ قُلِّدَتْ فِي عُنُقِهَا مِثْلُهَا مِنَ النَّارِ يَوْمَ الْقِيَامَةِ وَأَيُّمَا امْرَأَةٍ جَعَلَتْ فِي أُذُنِهَا خُرْصًا مِنْ ذَهَبٍ جَعَلَ اللَّهُ فِي أُذُنِهَا مِثْلَهُ مِنَ النَّارِ يَوْمَ الْقِيَامَةِ» . رَوَاهُ أَبُو دَاوُدَ وَالنَّسَائِيّ","english":{"narrator":"","text":"Asma’ daughter of Yazid reported God’s messenger as saying, “Any woman who wears a gold necklace will have a similar one of fire put on her neck on the day of resurrection, and any woman who puts a gold earring in her ear will have a similar one of fire put in her ear by God on the day of resurrection.” \nAbu Dawud and Nasa’i transmitted it."}},{"id":93,"idInBook":93,"chapterId":22,"bookId":14,"arabic":"وَعَن أُخْت لِحُذَيْفَة أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «يَا مَعْشَرَ النِّسَاءِ أَمَا لَكُنَّ فِي الْفِضَّةِ مَا تُحَلَّيْنَ بِهِ؟ أَمَا إِنَّهُ لَيْسَ مِنْكُنَّ امْرَأَةٌ تُحَلَّى ذَهَبًا تُظْهِرُهُ إِلَّا عُذِّبَتْ بِهِ» . رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ","english":{"narrator":"","text":"A sister of Hudhaifa reported God’s messenger as saying, “You women have in silver something with which to adorn yourselves. I assure you that any woman of you who adorns herself with gold which she displays will be punished for it.” \nAbu Dawud and Nasa’i transmitted it."}},{"id":94,"idInBook":94,"chapterId":22,"bookId":14,"arabic":"عَنْ عُقْبَةَ بْنِ عَامِرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كانَ يمنعُ أهلَ الْحِلْيَةَ وَالْحَرِيرَ وَيَقُولُ: «إِنْ كُنْتُمْ تُحِبُّونَ حِلْيَةَ الْجَنَّةِ وَحَرِيرَهَا فَلَا تَلْبَسُوهَا فِي الدُّنْيَا» . رَوَاهُ النَّسَائِيّ","english":{"narrator":"","text":"‘Uqba b. ‘Amir told that God's messenger used to restrain people who adorned themselves and wore silk, saying, “If you want the adornment and silk of paradise, do not wear them in this world.” \nNasa'i transmitted it."}},{"id":95,"idInBook":95,"chapterId":22,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اتَّخَذَ خَاتَمًا فَلَبِسَهُ قَالَ: «شَغَلَنِي هَذَا عَنْكُمْ مُنْذُ الْيَوْمَ إِلَيْهِ نَظْرَةٌ وإِليكم نظرة» ثمَّ أَلْقَاهُ. رَوَاهُ النَّسَائِيّ","english":{"narrator":"","text":"Ibn ‘Abbas told that God’s messenger got a signet-ring, but when he wore it he said, “This has distracted me from you ; since today I have been giving a look at it and giving a look at you.” He then threw it away. \nNasa’i transmitted it."}},{"id":96,"idInBook":96,"chapterId":22,"bookId":14,"arabic":"وَعَن مَالك قَالَ: أَنا أكره ن يُلْبَسَ الْغِلْمَانُ شَيْئًا مِنَ الذَّهَبِ لِأَنَّهُ بَلَغَنِي أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نهى عَن التختمِ بالذهبِ فَأَنا أكره لِلرِّجَالِ الْكَبِيرِ مِنْهُمْ وَالصَّغِيرِ. رَوَاهُ فِي الْمُوَطَّأِ","english":{"narrator":"Malik said :","text":"I dislike youths being dressed with any gold, for I have heard that God's messenger forbade wearing a gold signet-ring ; and I disapprove of it for men, both old and young. \nHe transmitted it in al-Muwatta."}},{"id":97,"idInBook":97,"chapterId":22,"bookId":14,"arabic":"عَنِ ابْنِ عُمَرَ قَالَ: رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَلْبَسُ النِّعَالَ الَّتِي ليسَ فِيهَا شعرٌ. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Ibn ‘Umar told that he saw God’s messenger wearing sandals which had no hair on them.\nBukhari transmitted it."}},{"id":98,"idInBook":98,"chapterId":22,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: إِنَّ نَعْلَ النَّبِيِّ صَلَّى الله عَلَيْهِ وَسلم كَانَ لَهَا قبالان","english":{"narrator":"","text":"Anas said the Prophet’s sandal had two thongs. \nBukhari transmitted it."}},{"id":99,"idInBook":99,"chapterId":22,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَزْوَةٍ غَزَاهَا يَقُولُ: «اسْتَكْثِرُوا مِنَ النِّعَالِ فَإِنَّ الرَّجُلَ لَا يَزَالُ رَاكِبًا مَا انتعَلَ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Jabir told that he heard the Prophet say on one of his expeditions, “Make a general practice of wearing sandals, for a man keeps riding as long as he wears sandals.” (The meaning is that wearing sandals makes movement easier and protects the feet lrom toughness or thorns on the road. So it is here compared with riding on an animal.)\nMuslim transmitted it."}},{"id":100,"idInBook":100,"chapterId":22,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا انْتَعَلَ أَحَدُكُمْ فَلْيَبْدَأْ بِالْيُمْنَى وَإِذَا نَزَعَ فَلْيَبْدَأْ بِالشِّمَالِ لِتَكُنِ الْيُمْنَى أَوَّلَهُمَا تُنْعَلُ وَآخِرَهُمَا تُنْزَعُ»","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “When one of you puts on sandals he should put on the right one first and when he takes them off he should take off the left one first, so that the right one should be the first to be put on and the last to be taken off. “\n(Bukhari and Muslim.)"}},{"id":101,"idInBook":101,"chapterId":22,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَمْشِي أَحَدُكُمْ فِي نعلٍ واحدةٍ ليُحفيهُما جَمِيعًا أَو لينعلهما جَمِيعًا»","english":{"narrator":"","text":"He reported God’s messenger as saying, “None of you should walk with one sandal, but should walk barefoot or wear a pair.” \n(Bukhari and Muslim.)"}},{"id":102,"idInBook":102,"chapterId":22,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا انْقَطَعَ شِسْعُ نَعْلِهِ فَلَا يَمْشِ فِي نَعْلٍ وَاحِدَةٍ حَتَّى يُصْلِحَ شِسْعَهُ وَلَا يَمْشِ فِي خُفٍّ وَاحِدٍ وَلَا يأكلْ بِشمَالِهِ وَلَا يجتبي بِالثَّوْبِ الْوَاحِدِ وَلَا يَلْتَحِفِ الصَّمَّاءَ» . رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"Jabir reported God’s messenger as saying, “When the thong of a man’s sandal is cut off he should not walk with one sandal till he repairs his thong ; he should not walk with one shoe, or eat with his left hand, or support himself when sitting with a single garment wrapped round his knees, or wrap himself up completely leaving no opening for the arms.” \nMuslim transmitted it."}},{"id":103,"idInBook":103,"chapterId":22,"bookId":14,"arabic":"عَنِ ابْنِ عَبَّاسٍ قَالَ: كَانَ لِنَعْلِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قِبَالَانِ مُثَنًّى شراكهما. رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Ibn ‘Abbas said God’s messenger’s sandal had two thongs, their straps being doubled. \nTirmidhi transmitted it."}},{"id":104,"idInBook":104,"chapterId":22,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَنْتَعِلَ الرَّجُلُ قَائِمًا. رَوَاهُ أَبُو دَاوُد\nوَرَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ عَنْ أَبِي هُرَيْرَةَ","english":{"narrator":"","text":"Jabir said God's messenger forbade that a man should put on sandals while standing. \nAbu Dawad transmitted it, and Tirmidhi and Ibn Majah transmitted it on Abu Huraira’s authority."}},{"id":105,"idInBook":105,"chapterId":22,"bookId":14,"arabic":"وَعَن القاسمِ بن محمَّدٍ عَنْ عَائِشَةَ قَالَتْ: رُبَّمَا مَشَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي نَعْلٍ وَاحِدَةٍ وَفِي رِوَايَةٍ: أَنَّهَا مَشَتْ بِنَعْلٍ وَاحِدَةٍ. رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا أصحُّ","english":{"narrator":"","text":"Al-Qasim b. Muhammad quoted ‘A’isha as saying the Prophet often walked wearing one sandal. A version says she walked wearing one sandal. \nTirmidhi transmitted it, saying this is sounder"}},{"id":106,"idInBook":106,"chapterId":22,"bookId":14,"arabic":"وَعَن ابنِ عبَّاسٍ قَالَ: مِنَ السُّنَّةِ إِذَا جَلَسَ الرَّجُلُ أَنْ يَخْلَعَ نَعْلَيْهِ فَيَضَعَهُمَا بِجَنْبِهِ. رَوَاهُ أَبُو دَاوُدَ","english":{"narrator":"","text":"Ibn Abbas said it is part of the sunna that when a man sits down he should take off his sandals and place them at his side. \nAbu Dawud transmitted it."}},{"id":107,"idInBook":107,"chapterId":22,"bookId":14,"arabic":"وَعَنِ ابْنِ بُرَيْدَةَ عَنْ أَبِيهِ أَنَّ النَّجَاشِيَّ أَهْدَى إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خُفَّيْنِ أَسْوَدَيْنِ سَاذَجَيْنِ فَلَبِسَهُمَا. رَوَاهُ ابْنُ مَاجَهْ. وَزَادَ التِّرْمِذِيُّ عَنِ ابْنِ بُرَيْدَةَ عَنْ أَبِيهِ: ثمَّ تَوَضَّأ وَمسح عَلَيْهِمَا\nهَذَا الْبَاب خَال من الْفَصْل الثَّالِث","english":{"narrator":"","text":"Ibn Buraida told on his father’s authority that the Negus presented the Prophet with two plain black shoes and he wore them. \nIbn Majah transmitted it, and Tirmidhi added on Ibn Buraida's authority quoting his father’s authority, that he then performed ablution and wiped over them."}},{"id":108,"idInBook":108,"chapterId":22,"bookId":14,"arabic":"عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: كُنْتُ أُرَجِّلُ رَأْسَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا حَائِض","english":{"narrator":"","text":"'A’isha said she used to comb God’s messenger’s head when she was menstruating. \n(Bukhari and Muslim.)"}},{"id":109,"idInBook":109,"chapterId":22,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" الْفِطْرَةُ خَمْسٌ: الْخِتَانُ وَالِاسْتِحْدَادُ وَقَصُّ الشَّارِبِ وَتَقْلِيمُ الْأَظْفَارِ ونتفُ الإِبطِ \"","english":{"narrator":"Abu Huraira reported God’s messenger as saying, “The ancient prophetical sunna (The Arabic word is fitra. Its basic meaning is the manner in which one is created. It is also used for the religion of Islam. But in this tradition the meaning is said to be the sunna followed by the prophets from of old, and therefore it is translated above in accordance with this explanation) has five characteristics :","text":"circumcision, shaving with a razor, clipping the moustache, paring the nails, and plucking out hairs under the armpit.” \n(Bukhari and Muslim.)"}},{"id":110,"idInBook":110,"chapterId":22,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" خَالِفُوا الْمُشْرِكِينَ: أَوْفِرُوا اللِّحَى وَأَحْفُوا الشَّوَارِبَ \". وَفِي رِوَايَةٍ: «أنهكوا الشَّوَارِب وأعفوا اللحى»","english":{"narrator":"","text":"Ibn ‘Umar reported God’s messenger as saying, \"Do the opposite of what the polytheists do ; let the beard grow long and clip the moustache.” A version has, “Cut the moustache down and leave the beard.” \n(Bukhari and Muslim.)"}},{"id":111,"idInBook":111,"chapterId":22,"bookId":14,"arabic":"وَعَن أَنس قَالَ: وُقِّتَ لَنَا فِي قَصِّ الشَّارِبِ وَتَقْلِيمِ الْأَظْفَارِ وَنَتْفِ الْإِبِطِ وَحَلْقِ الْعَانَةِ أَنْ لَا تُتْرَكَ أَكثر من أَرْبَعِينَ لَيْلَة. رَوَاهُ مُسلم","english":{"narrator":"","text":"Anas said they were told not to let more than forty days elapse between the times they clipped the moustache, pared the nails, plucked out hairs under the armipits and shaved the pubes. \nMuslim transmitted it."}},{"id":112,"idInBook":112,"chapterId":22,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ الْيَهُودَ وَالنَّصَارَى لَا يَصبِغون فخالفوهم»","english":{"narrator":"","text":"Abu Huraira reported the Prophet as saying, “Jews and Christians do not dye , so act differently from them.” \n(Bukhari and Muslim.)"}},{"id":113,"idInBook":113,"chapterId":22,"bookId":14,"arabic":"وَعَن جَابر قَالَ: أُتِيَ بِأَبِي قُحَافَةَ يَوْمَ فَتْحِ مَكَّةَ وَرَأْسُهُ وَلِحْيَتُهُ كَالثُّغَامَةِ بَيَاضًا فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «غَيِّرُوا هَذَا بِشَيْءٍ وَاجْتَنِبُوا السَّواد» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Jabir told that when Abu Quhafa (Abu Bakr’s father) was brought on the day of the Conquest of Mecca with his head and beard white like hyssop, the Prophet said, “Change this with something, but avoid black.” \nMuslim transmitted it."}},{"id":114,"idInBook":114,"chapterId":22,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُحِبُّ مُوَافَقَةَ أَهْلِ الْكِتَابِ فِيمَا لَمْ يُؤْمَرْ فِيهِ وَكَانَ أَهْلُ الْكِتَابِ يَسْدُلُونَ أَشْعَارَهُمْ وَكَانَ الْمُشْرِكُونَ يَفْرِقُونَ رؤوسهم فَسَدَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَاصِيَتَهُ ثمَّ فرق بعدُ","english":{"narrator":"","text":"Ibn ‘Abbas said the Prophet liked to do the same as the People of the Book in matters about which he had received no command. The People of the Book used to let their hair hang down and the polytheists used to part their hair, so the Prophet let his forelock hang down, but afterwards he parted it. \n(Bukhari and Muslim.)"}},{"id":115,"idInBook":115,"chapterId":22,"bookId":14,"arabic":"وَعَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ قَالَ: سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْهَى عَنِ الْقَزَعِ. قِيلَ لِنَافِعٍ: مَا الْقَزَعُ؟ قَالَ: يُحْلَقُ بعضُ رَأس الصبيِّ وَيتْرك البعضُ\nوَألْحق بَعضهم التَّفْسِير بِالْحَدِيثِ","english":{"narrator":"","text":"Nafi‘ quoted Ibn ‘Umar as saying he had heard the Prophet forbidding qaza'. Nafi' was asked what qaza’ was and replied that it was having part of a boy’s head shaved arid leaving part unshaven. \n(Bukhari and Muslim.) Some made the explanation a part of the tradition."}},{"id":116,"idInBook":116,"chapterId":22,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى صَبِيًّا قَدْ حُلِقَ بَعْضُ رَأْسِهِ وَتُرِكَ بَعْضُهُ فَنَهَاهُمْ عَنْ ذَلِكَ وَقَالَ: «احْلِقُوا كُلَّهُ أَوِ اتْرُكُوا كُلَّهُ» . رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"Ibn ‘Umar told that when the Prophet saw a boy with part of his head shaved and part left unshaven he forbade them to do that, saying, ‘‘Shave it al or leave it all.\" \nMuslim transmitted it."}},{"id":117,"idInBook":117,"chapterId":22,"bookId":14,"arabic":"وَعَن ابْن عَبَّاس قَالَ: لعن الله الْمُخَنَّثِينَ مِنَ الرِّجَالِ وَالْمُتَرَجِّلَاتِ مِنَ النِّسَاءِ وَقَالَ: «أخرجوهم من بُيُوتكُمْ» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Ibn ‘Abbas said the Prophet cursed the mukhannaths among men and the women who imitated men, saying, “Put them out of your houses.” \nBukhari transmitted it."}},{"id":118,"idInBook":118,"chapterId":22,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَعَنَ اللَّهُ الْمُتَشَبِّهِينَ مِنَ الرِّجَالِ بِالنِّسَاءِ والمتشبِّهات من النِّسَاء بِالرِّجَالِ» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"He reported the Prophet as saying, “God has cursed men who imitate women and women who imitate men.” \nBukhari transmitted it."}},{"id":119,"idInBook":119,"chapterId":22,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَعَنَ اللَّهُ الْوَاصِلَةَ وَالْمُسْتَوْصِلَةَ والواشمة والمستوشمة»","english":{"narrator":"","text":"Ibn ‘Umar reported the Prophet as saying, “God has cursed the woman who adds some false hair and the woman who asks for it, the woman who tattoos and the woman who asks for it.”\n(Bukhari and Muslim.)"}},{"id":120,"idInBook":120,"chapterId":22,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ: لَعَنَ اللَّهُ الْوَاشِمَاتِ وَالْمُسْتَوْشِمَاتِ وَالْمُتَنَمِّصَاتِ وَالْمُتَفَلِّجَاتِ لِلْحُسْنِ الْمُغَيِّرَاتِ خَلْقَ اللَّهِ فَجَاءَتْهُ امْرَأَةٌ فَقَالَتْ: إِنَّهُ بَلَغَنِي أَنَّكَ لَعَنْتَ كَيْتَ وَكَيْتَ فَقَالَ: مَا لِي لَا أَلْعَنُ مَنْ لَعَنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَنْ هُوَ فِي كِتَابِ اللَّهِ فَقَالَتْ: لَقَدْ قَرَأْتُ مَا بَيْنَ اللَّوْحَيْنِ فَمَا وجدت فِيهِ مَا نقُول قَالَ: لَئِنْ كُنْتِ قَرَأْتِيهِ لَقَدْ وَجَدْتِيهِ أَمَا قَرَأت: (مَا آتَاكُمُ الرَّسُولُ فَخُذُوهُ وَمَا نَهَاكُمْ عَنْهُ فَانْتَهُوا)\n؟ قَالَت: بلَى قَالَ: فإِنه قد نهى عَنهُ","english":{"narrator":"arfan p930\n‘Abdallah b. Mas'ud said :","text":"God has cursed the women who tattoo and the women who have themselves tattooed, the women who pluck hairs from their faces and who make spaces between their teeth for beauty, changing what God has created. When a woman came and told him she had heard he had cursed such and such he asked why he should not curse those whom God’s messenger had cursed and those who were mentioned in God’s Book. She told him she had read it from cover to cover and had not found in it what he had been saying, to which he replied that if she had read it she would have found it, and asked her whether she had not read, “What the apostle has brought you accept, and what he has forbidden you refrain from.” (Qur’an, 59, 7). On her replying that she had, he said he had forbidden what he had been talking about.\n(Bukhari and Muslim.)"}},{"id":121,"idInBook":121,"chapterId":22,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْعَيْنُ حَقٌّ» وَنَهَى عَن الوشم. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Abu Huraira told that God’s messenger said, “The influence of the evil eye is true,” and forbade tattooing. (It would seem from this tradition that tattooing was used as a protection agains; the evil eye.) \nBukhari transmitted it."}},{"id":122,"idInBook":122,"chapterId":22,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: لَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُلَبِّدًا. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Ibn ‘Umar said he had seen God’s messenger with matted hair. \nBukhari transmitted it."}},{"id":123,"idInBook":123,"chapterId":22,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَتَزَعْفَرَ الرَّجُلُ","english":{"narrator":"","text":"Anas said the Prophet forbade men to use saffron. (Mirqat, iv, 461, says this applies to their clothing and their bodies, as it is a female custom but does not prohibit a small use of it.)\n(Bukhari and Muslim.)"}},{"id":124,"idInBook":124,"chapterId":22,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ قَالَتْ: كُنْتُ أُطَيِّبُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِأَطْيَبِ مَا نَجِدُ حَتَّى أَجِدَ وَبِيصَ الطِّيبِ فِي رَأْسِهِ ولحيته","english":{"narrator":"","text":"‘A’isha said she used to perfume the Prophet with the sweetest perfume she could find till she saw the perfume shining on his head and beard. \n(Bukhari and Muslim.)"}},{"id":125,"idInBook":125,"chapterId":22,"bookId":14,"arabic":"وَعَنْ نَافِعٍ قَالَ: كَانَ ابْنُ عُمَرَ إِذَا اسْتَجْمَرَ اسْتَجْمَرَ بِأَلُوَّةٍ غَيْرِ مُطَرَّاةٍ وَبِكَافُورٍ يَطْرَحُهُ مَعَ الْأَلُوَّةِ ثُمَّ قَالَ: هَكَذَا كَانَ يَسْتَجْمِرُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ. رَوَاهُ مُسلم","english":{"narrator":"","text":"Nafi' said that when Ibn ‘Umar perfumed himself he used aloes-wood mixed with no other perfume, and also used camphor which he mixed in with the aloes-wood. Then he said that God’s messenger had perfumed himself thus. \nMuslim transmitted it."}},{"id":126,"idInBook":126,"chapterId":22,"bookId":14,"arabic":"عَنِ ابْنِ عَبَّاسٍ قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُصُّ أَوْ يَأْخُذُ مِنْ شَارِبِهِ وَكَانَ إِبْرَاهِيمُ خَلِيلُ الرَّحْمَنِ صَلَوَاتُ الرَّحْمَنِ عَلَيْهِ يَفْعَله. رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Ibn ‘Abbas said the Prophet used to clip or take something off his moustache, and Abraham the friend of the Compassionate One used to do it. \nTirmidhi transmitted it."}},{"id":127,"idInBook":127,"chapterId":22,"bookId":14,"arabic":"وَعَنْ زَيْدِ بْنِ أَرْقَمَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ لَمْ يَأْخُذ شَارِبِهِ فَلَيْسَ مِنَّا» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَالنَّسَائِيُّ","english":{"narrator":"","text":"Zaid b. Arqam reported God’s messenger as saying, “He who does not take something off his moustache is not one of us.” \nAhmad, Tirmidhi and Nasa'i transmitted it."}},{"id":128,"idInBook":128,"chapterId":22,"bookId":14,"arabic":"وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَأْخُذُ مِنْ لِحْيَتِهِ مِنْ عَرْضِهَا وَطُولِهَا. رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ غَرِيبٌ","english":{"narrator":"","text":"‘Amr b. Shu'aib; on his father's authority, said his grandfather told that the Prophet used to take something off the side and the bottom of his beard. \nTirmidhi transmitted it, saying this is a gharib tradition."}},{"id":129,"idInBook":129,"chapterId":22,"bookId":14,"arabic":"مرّة أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى عَلَيْهِ خَلُوقًا فَقَالَ: «أَلَكَ امْرَأَةٌ؟» قَالَ: لَا قَالَ: «فَاغْسِلْهُ ثُمَّ اغْسِلْهُ ثُمَّ اغْسِلْهُ ثُمَّ لَا تعد» . رَوَاهُ التِّرْمِذِيّ وَالنَّسَائِيّ","english":{"narrator":"","text":"Ya‘la b. Murra told that when the Prophet saw some khaluq (A liquid, yellow perfume mainly composed of saffron) on him he asked whether he had a wife, and when he replied that he had not he said, “Wash it, then wash it, then wash it, and do not use it again.” \nTirmidhi and Nasa'i transmitted it."}},{"id":130,"idInBook":130,"chapterId":22,"bookId":14,"arabic":"وَعَنْ أَبِي مُوسَى قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَقْبَلُ اللَّهُ صَلَاةَ رَجُلٍ فِي جَسَدِهِ شَيْءٌ مِنْ خَلُوقٍ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Abu Musa reported God’s messenger as saying, “God does not accept the prayer of a man who has any khaluq on his body.” \nAbu Dawud transmitted it."}},{"id":131,"idInBook":131,"chapterId":22,"bookId":14,"arabic":"وَعَنْ عَمَّارِ بْنِ يَاسِرٍ قَالَ: قَدِمْتُ عَلَى أَهْلِي مِنْ سَفَرٍ وَقَدْ تَشَقَّقَتْ يَدَايَ فَخَلَّقُونِي بِزَعْفَرَانٍ فَغَدَوْتُ عَلَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَلَّمْتُ عَلَيْهِ فَلَمْ يَرُدَّ عَلَيَّ وَقَالَ: «اذْهَبْ فَاغْسِلْ هَذَا عَنْكَ» . رَوَاهُ أَبُو دَاوُدَ","english":{"narrator":"‘Ammar b. Yasir said :","text":"I came to my family after a journey with my hands chapped and they perfumed me with saffron. In the morning I went to the Prophet and gave him a greeting, but instead of responding to it he said, “Go away and wash this off yourself.” \nAbu Dawud transimitted it."}},{"id":132,"idInBook":132,"chapterId":22,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «طِيبُ الرِّجَالِ مَا ظَهَرَ رِيحُهُ وَخَفِيَ لَوْنُهُ وَطِيبُ النِّسَاءِ مَا ظَهَرَ لَوْنُهُ وَخَفِيَ رِيحُهُ» . رَوَاهُ التِّرْمِذِيُّ وَالنَّسَائِيُّ","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “The perfume for men is that whose odour is apparent but whose colour is hidden, and the perfume for women is that whose colour is apparent but whose odour is hidden. \nTirmidhi and Nasa’i transmitted it."}},{"id":133,"idInBook":133,"chapterId":22,"bookId":14,"arabic":"وَعَن أنس قَالَ: كَانَتْ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُكَّةٌ يَتَطَيَّبُ مِنْهَا. رَوَاهُ أَبُو دَاوُدَ","english":{"narrator":"","text":"Anas said God’s messenger had sukka (A perfume made from ramik, a black substance mixed with musk. After an elaborate process of pounding and moistening it was left for a year before being used. Its perfume is said to have improved with age. Cf. Mirqat, iv, 463 f.) with which he perfumed himself. \nAbu Dawud transmitted it."}},{"id":134,"idInBook":134,"chapterId":22,"bookId":14,"arabic":"وَعَنْهُ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم يُكثر دهن رَأسه وتسريحَ لحيته وَيُكْثِرُ الْقِنَاعَ كَأَنَّ ثَوْبَهُ ثَوْبُ زَيَّاتٍ. رَوَاهُ فِي شرح السّنة","english":{"narrator":"","text":"He said God’s messenger often greased his head and combed his beard, and he often wore a head veil as though his garment (the explanation which seems to be preferred is that the word \"garment’’ here refers to the cloth like a veil which was used to protect the turban from the grease.) were that of an olive-oil seller. \nIt is transmitted in Sharh as sunna."}},{"id":135,"idInBook":135,"chapterId":22,"bookId":14,"arabic":"وَعَن أم هَانِئ قَالَتْ: قَدِمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَيْنَا بِمَكَّةَ قَدْمَةً وَلَهُ أَرْبَعُ غَدَائِرَ. رَوَاهُ أَحْمَدُ وَأَبُو دَاوُدَ وَالتِّرْمِذِيُّ وَابْنُ مَاجَهْ","english":{"narrator":"Umm Hani’ said :","text":"God’s messenger came to us once in Mecca and he had four plaits of hair.\nAhmad, Abu Dawud, Tirmidhi and Ibn Majah transmitted it."}},{"id":136,"idInBook":136,"chapterId":22,"bookId":14,"arabic":"وَعَن عَائِشَة قَالَتْ: إِذَا فَرَقْتُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأْسَهُ صَدَّعْتُ فَرْقَهُ عَنْ يَافُوخِهِ وَأَرْسَلْتُ نَاصِيَتَهُ بَيْنَ عَيْنَيْهِ. رَوَاهُ أَبُو دَاوُدَ","english":{"narrator":"","text":"‘A'isha said that when she parted God’s messenger’s hair she made a parting from the crown of his head and let his forelock hang between his eyes. \nAbu Dawud transmitted it."}},{"id":137,"idInBook":137,"chapterId":22,"bookId":14,"arabic":"وَعَن عبد الله بن مغفَّل قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ التَّرَجُّلِ إِلَّا غِبًّا. رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُد وَالنَّسَائِيّ","english":{"narrator":"","text":"‘Abdallah b. Mughaffal said God’s messenger forbade combing the hair except every second day. \nTirmidhi, Abu Dawud and Nasa'i transmitted it."}},{"id":138,"idInBook":138,"chapterId":22,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ قَالَ: قَالَ رَجُلٌ لِفَضَالَةَ بْنِ عُبَيْدٍ: مَا لِي أَرَاكَ شَعِثًا؟ قَالَ: إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَنْهَانَا عَنْ كَثِيرٍ مِنَ الإِرفاه قَالَ: مَالِي لَا أَرَى عَلَيْكَ حِذَاءً؟ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْمُرُنَا أَنْ نحتفي أَحْيَانًا. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"‘Abdallah b. Buraida told that a man asked Fadala b. ‘Ubaid why it was he saw him dishevelled and he replied that God's messenger had forbidden them to indulge much in luxury. He asked why it was he saw him unshod and he replied that God's messenger used to command them to go barefoot at times. \nAbu Dawud transmitted it."}},{"id":139,"idInBook":139,"chapterId":22,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ كَانَ لَهُ شعرٌ فليُكرمه» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “He who has hair should honour it.” \nAbu Dawud trrnsmitted it."}},{"id":140,"idInBook":140,"chapterId":22,"bookId":14,"arabic":"وَعَنْ أَبِي ذَرٍّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ أَحْسَنَ مَا غُيِّرَ بِهِ الشَّيْبُ الْحِنَّاءُ وَالْكَتَمُ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُد وَالنَّسَائِيّ","english":{"narrator":"","text":"Abu Dharr reported God’s messenger as saying, “The best things with which grey hairs are changed are henna and katam (leaves of the salam tree (mimosa flava). This dye applied with henna to the hair is said to preserve its original colour. Katam is also said to lighten the colour of the hair).\n Tirmidhi, Abu Dawud and Nasa’i transmitted it."}},{"id":141,"idInBook":141,"chapterId":22,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «يَكُونُ قَوْمٌ فِي آخِرِ الزَّمَانِ يَخْضِبُونَ بِهَذَا السَّوَادِ كَحَوَاصِلِ الْحَمَامِ لَا يَجِدُونَ رَائِحَةَ الْجَنَّةِ» . رَوَاهُ أَبُو دَاوُدَ وَالنَّسَائِيُّ","english":{"narrator":"","text":"Ibn ‘Abbas reported the Prophet as saying, “At the end of time there will be people who will use this black dye like the crops of doves who will not experience the fragrance of paradise.” \nAbu Dawud and Nasa’i transmitted it."}},{"id":142,"idInBook":142,"chapterId":22,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَلْبَسُ النِّعَالَ السِّبْتِيَّةَ وَيَصْفِرُّ لِحْيَتَهُ بِالْوَرْسِ وَالزَّعْفَرَانِ وَكَانَ ابْنُ عُمَرَ يَفْعَلُ ذَلِك. رَوَاهُ النَّسَائِيّ","english":{"narrator":"","text":"Ibn ‘Umar said the Prophet used to wear tanned leather sandals and dye his beard yellow with  wars (a plant of yellow colour in the Yemen, like sesame) and saffron. And Ibn ‘Umar used to do that. \nNasa’i transmitted it."}},{"id":143,"idInBook":143,"chapterId":22,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: مَرَّ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلٌ قَدْ خَضَبَ بِالْحِنَّاءِ فَقَالَ: «مَا أَحْسَنَ هَذَا» . قَالَ: فَمَرَّ آخَرُ قَدْ خَضَبَ بِالْحِنَّاءِ وَالْكَتَمِ فَقَالَ: «هَذَا أَحْسَنُ مِنْ هَذَا» ثُمَّ مَرَّ آخَرُ قَدْ خَضَبَ بِالصُّفْرَةِ فَقَالَ: «هَذَا أَحْسَنُ مِنْ هَذَا كُله» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Ibn ‘Abbas told that when a man who had dyed himself with henna passed the Prophet he said, “How fine this is! ” When another who had dyed himself with henna and katam passed by he said, “This is better than that.” Then when another who had dyed himself with yellow dye passed by he said, “This is better than all that.” \nAbu Dawud transmitted it."}},{"id":144,"idInBook":144,"chapterId":22,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «غَيِّرُوا الشَّيْبَ وَلَا تشبَّهوا باليهودِ» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “Change grey hairs and do not copy the Jews.” \nTirmidhi transmitted it, and Nasa’i transmitted it on the authority of Ibn ‘Umar and az-Zubair."}},{"id":145,"idInBook":145,"chapterId":22,"bookId":14,"arabic":"وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَنْتِفُوا الشَّيْبَ فَإِنَّهُ نُورُ الْمُسْلِمِ مَنْ شَابَ شَيْبَةً فِي الْإِسْلَامِ كَتَبَ اللَّهُ لَهُ بِهَا حَسَنَةً وَكَفَّرَ عَنْهُ بِهَا خَطِيئَةً وَرَفَعَهُ بِهَا دَرَجَةً» . رَوَاهُ أَبُو دَاوُدَ","english":{"narrator":"","text":"‘Amr b. Shu'aib, on his father’s authority, told that his grandfather reported God’s messenger as saying. “Do not pluck out grey hairs, for they are the Muslim’s light. If anyone grows a grey hair in Islam God will record on his behalf a good deed for it, will blot out a sin for it, and raise him a degree for it.” \nAbu Dawud transmitted it."}},{"id":146,"idInBook":146,"chapterId":22,"bookId":14,"arabic":"وَعَنْ كَعْبِ بْنِ مُرَّةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ شَابَ شَيْبَةً فِي الْإِسْلَامِ كَانَتْ لَهُ نُورًا يَوْمَ القيامةِ» . رَوَاهُ التِّرْمِذِيّ وَالنَّسَائِيّ","english":{"narrator":"","text":"Ka'b b. Murra reported God’s messenger as saying, “If anyone grows a grey hair in Islam it will be a light for him on the day of resurrection.” \nTirmidhi and Nasa’i transmitted it."}},{"id":147,"idInBook":147,"chapterId":22,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ قَالَتْ: كُنْتُ أَغْتَسِلُ أَنَا وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ إِنَاءٍ وَاحِدٍ وَكَانَ لَهُ شَعْرٌ فَوْقَ الْجُمَّةِ وَدُونَ الوفرة. رَوَاهُ التِّرْمِذِيّ وَالنَّسَائِيّ","english":{"narrator":"‘A’isha said :","text":"God’s messenger and I used to wash from one vessel; and he had hair which did not reach the shoulder but which came lower than the ear. \nTirmidhi transmitted it."}},{"id":148,"idInBook":148,"chapterId":22,"bookId":14,"arabic":"وَعَن ابنِ الحنظليَّةِ رَجُلٌ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «نِعْمَ الرَّجُلُ خُرَيْمٌ الْأَسْدِيُّ لَوْلَا طُولُ جُمَّتِه وإسبال إزراه» فَبَلَغَ ذَلِكَ خُرَيْمًا فَأَخَذَ شَفْرَةً فَقَطَعَ بِهَا جمته إِلَى أُذُنَيْهِ وَرفع إزراه إِلَى أَنْصَاف سَاقيه. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Ibn al-Hanzaliya, one of the Prophet’s Companions, reported the Prophet as saying, “Khuraim al-Asadi would be a fine man were it not for the length of his hair which reaches the shoulders and the way he lets his lower garment hang down.” When Khuraim heard that he took a knife and cut his hair in line with his ears, and he raised his lower garment halfway up his legs. \nAbu Dawud transmitted it."}},{"id":149,"idInBook":149,"chapterId":22,"bookId":14,"arabic":"وَعَن أنسٍ قَالَ: كَانَتْ لِي ذُؤَابَةٌ فَقَالَتْ لِي أُمِّي: لَا أَجُزُّهَا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَمُدُّهَا وَيَأْخُذُهَا. رَوَاهُ أَبُو دَاوُدَ","english":{"narrator":"","text":"Anas said he had a hanging lock of hair and his mother told him not to cut it, for God’s messenger used to stretch it out and hold it. \nAbu Dawud transmitted it."}},{"id":150,"idInBook":150,"chapterId":22,"bookId":14,"arabic":"وَعَن عبدِ الله بن جَعْفَرٍ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمْهَلَ آلَ جَعْفَرٍ ثَلَاثًا ثُمَّ أَتَاهُمْ فَقَالَ: «لَا تَبْكُوا عَلَى أَخِي بَعْدِ الْيَوْمِ» . ثُمَّ قَالَ: «ادْعُوا لِي بَنِي أَخِي» . فَجِيءَ بِنَا كَأَنَّا أَفْرُخٌ فَقَالَ: «ادْعُوا لِي الْحَلَّاقَ» فَأَمَرَهُ فَحَلَقَ رؤوسنا. رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ","english":{"narrator":"‘Abdallah b. Ja'far said:","text":"The Prophet waited three days before visiting the family of Ja'far (Ja'far b. Abu Talib was killed at Mu'ta in the year 7 A.H). He said, “Do not weep for my brother after today,” and then said, “Call my brother’s children to me.” When we had been brought like a number of chickens he said, “Call me a barber,” and then ordered him to shave our heads.\n\nAbu Dawud and Nasa’i transmitted it."}},{"id":151,"idInBook":151,"chapterId":22,"bookId":14,"arabic":"وَعَن أُمِّ عطيَّةَ الأنصاريَّةِ: أنَّ امْرَأَة كَانَت تختن بِالْمَدِينَةِ. فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تُنْهِكِي فَإِنَّ ذَلِكَ أَحْظَى لِلْمَرْأَةِ وَأَحَبُّ إِلَى الْبَعْلِ» . رَوَاهُ أَبُو دَاوُدَ وَقَالَ: هَذَا الْحَدِيثُ ضَعِيفٌ وَرَاوِيه مَجْهُول","english":{"narrator":"","text":"Umm 'Atiya al-Ansariya told that the Prophet said to a woman who used to perform circumcision (on girls) in Medina, “Do not cut severely, as that is better for a woman and more desirable to a husband.” \nAbu Dawud transmitted it, saying this is a weak tradition one of whose transmitters is an unknown man."}},{"id":152,"idInBook":152,"chapterId":22,"bookId":14,"arabic":"وَعَنْ كَرِيمَةَ بِنْتِ هَمَّامٍ: أَنَّ امْرَأَةً سَأَلَتْ عائشةَ عَنْ خِضَابِ الْحِنَّاءِ فَقَالَتْ: لَا بَأْسَ وَلَكِنِّي أَكْرَهُهُ كَانَ حَبِيبِي يَكْرَهُ رِيحَهُ. رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ","english":{"narrator":"","text":"Karima daughter of Hammam told that a woman asked ‘A’isha about dyeing with henna and she replied, “There is no harm, but I do not like it. My beloved disliked its odour.\"\nAbu Dawud and Nasa’i transmitted it."}},{"id":153,"idInBook":153,"chapterId":22,"bookId":14,"arabic":"وَعَن عائشةَ أَنَّ هِنْدًا بِنْتَ عُتْبَةَ قَالَتْ: يَا نَبِيَّ اللَّهِ بَايِعْنِي فَقَالَ: «لَا أُبَايِعُكِ حَتَّى تُغَيِّرِي كَفَّيْكِ فَكَأَنَّهُمَا كَفَّا سَبُعٍ» . رَوَاهُ أَبُو دَاوُدَ","english":{"narrator":"","text":"‘A’isha told that when Hind daughter of ‘Utba said, “Prophet of God, accept my allegiance,\" he replied, “Not till you make a difference to the palms of your hands ; for they look like the paws of a beast of prey.\" (A strong way of saying that a woman's hands with no henna on them are ugly) \nAbu Dawud transmitted it."}},{"id":154,"idInBook":154,"chapterId":22,"bookId":14,"arabic":"وَعَنْهَا قَالَتْ: أَوَمَتِ امْرَأَةٌ مِنْ وَرَاءِ سِتْرٍ بِيَدِهَا كِتَابٌ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَبَضَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَهُ فَقَالَ: «مَا أَدْرِي أَيَدُ رَجُلٍ أَمْ يَدُ امْرَأَةٍ؟» قَالَتْ: بَلْ يَدُ امْرَأَةٍ قَالَ: «لَوْ كُنْتِ امْرَأَةً لَغَيَّرْتِ أَظْفَارَكِ» يَعْنِي الْحِنَّاء. رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ","english":{"narrator":"","text":"She told that a woman made a sign from behind a curtain to indicate that she had a letter for God's messenger. The Prophet closed his hand saying, “I do not know whether this is a man’s or a woman’s hand,\" and when she declared that it was a woman’s he said, “If you were a woman you would make a difference to your nails,\" meaning with henna. \nAbu Dawud and Nasa'i transmitted it."}},{"id":155,"idInBook":155,"chapterId":22,"bookId":14,"arabic":"وَعَن ابنِ عبَّاسٍ قَالَ: لُعِنَتِ الْوَاصِلَةُ وَالْمُسْتَوْصِلَةُ وَالنَّامِصَةُ وَالْمُتَنَمِّصَةُ وَالْوَاشِمَةُ والمشتوشمة من غير دَاء. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Ibn ‘Abbas said the woman who supplies false hair and the one who asks for it, the woman who pulls out hair for other people and the woman who depilates herself, the woman who tattoos and the one who has it done when there was no disease to justify it were cursed.\nAbu Dawud transmitted it."}},{"id":156,"idInBook":156,"chapterId":22,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: لَعَنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الرَّجُلَ يَلْبَسُ لِبْسَةَ الْمَرْأَةِ وَالْمَرْأَةَ تَلْبَسُ لِبْسَةَ الرَّجُلِ. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Abu Huraira said God’s messenger cursed the man who dressed like a woman and the woman who dressed like a man. \nAbu Dawud transmitted it."}},{"id":157,"idInBook":157,"chapterId":22,"bookId":14,"arabic":"وَعَنِ ابْنِ أَبِي مُلَيْكَةَ قَالَ: قِيلَ لِعَائِشَةَ: إِنَّ امْرَأَةً تَلْبَسُ النَّعْلَ قَالَتْ: لَعَنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الرَّجُلَةَ مِنَ النِّسَاء. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Ibn Abu Mulaika told that when someone remarked to ‘A’isha that a woman was wearing sandals (in refrence to men’s footwear) she replied that God’s messenger cursed mannish women. \nAbu Dawud transmitted it."}},{"id":158,"idInBook":158,"chapterId":22,"bookId":14,"arabic":"وَعَنْ ثَوْبَانَ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا سَافَرَ كَانَ آخِرُ عَهْدِهِ بِإِنْسَانٍ مِنْ أَهْلِهِ فَاطِمَةَ وَأَوَّلُ مَنْ يَدْخُلُ عَلَيْهَا فَاطِمَةَ فَقَدِمَ مِنْ غَزَاةٍ وَقَدْ عَلَّقَتْ مَسْحًا أَوْ سِتْرًا عَلَى بَابِهَا وَحَلَّتِ الْحَسَنَ وَالْحُسَيْنَ قُلْبَيْنِ مِنْ فِضَّةٍ فَقَدِمَ فَلَمْ يَدْخُلْ فَظَنَّتْ أَنَّ مَا مَنَعَهُ أَنْ يَدْخُلَ مَا رَأَى فَهَتَكَتِ السِّتْرَ وَفَكَّتِ الْقُلْبَيْنِ عَنِ الصَّبِيَّيْنِ وَقَطَعَتْهُ مِنْهُمَا فَانْطَلَقَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَبْكِيَانِ فَأَخَذَهُ مِنْهُمَا فَقَالَ: «يَا ثَوْبَانُ اذْهَبْ بِهَذَا إِلَى فُلَانٍ إِنَّ هَؤُلَاءِ أَهْلِي أَكْرَهُ أَنْ يَأْكُلُوا طَيِّبَاتِهِمْ فِي حَيَاتِهِمُ الدُّنْيَا. يَا ثَوْبَانُ اشْتَرِ لِفَاطِمَةَ قِلَادَةً مِنْ عَصْبٍ وَسُوَارَيْنِ مِنْ عَاجٍ» . رَوَاهُ أَحْمَدُ وَأَبُو دَاوُد","english":{"narrator":"","text":"Thauban told that when God’s messenger went on a journey the last member of his family he saw was Fatima and the first he visited on his return was Fatima. Once when he returned from an expedition she had hung up a hair-cloth, or a curtain, at her door and adorned al-Hasan and al-Husain with silver bracelets, so when he arrived he did not enter. Thinking that he had been prevented from entering by what he had seen she tore down the curtain, unfastened the bracelets from the boys and cut them off them. They went weeping to God's messenger, and when he had taken them from them he said, “Take this to so and so’s family, Thauban. These are my family and I dislike their enjoying their good things in the present life. Buy Fatima a necklace of ‘asb( the meaning is not clear. It is suggested that it means the tendons of the joints of animals cut into beads, or the teeth or bones of the hippopotamus) , Thauban, and two ivory (Or, 'tortoise-shell’ (’aj) bracelets.”\nAhmad and Abu Dawud transmitted it."}},{"id":159,"idInBook":159,"chapterId":22,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «اكْتَحِلُوا بِالْإِثْمِدِ فَإِنَّهُ يَجْلُو الْبَصَرَ وَيُنْبِتُ الشَّعْرَ» . وَزَعَمَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَتْ لَهُ مُكْحُلَةٌ يَكْتَحِلُ بِهَا كُلَّ لَيْلَةٍ ثَلَاثَةً فِي هَذِهِ وَثَلَاثَةً فِي هَذِه. رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Ibn ‘Abbas reported the Prophet as saying, “Apply antimony, for it clears the sight and makes the hair grow.” And he asserted that the Prophet had a collyrium-case from which he applied collyrium every night in each eye three times. \nTirmidhi transmitted it."}},{"id":160,"idInBook":160,"chapterId":22,"bookId":14,"arabic":"وَعَنْهُ قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَكْتَحِلُ قَبْلَ أَنْ يَنَامَ بِالْإِثْمِدِ ثَلَاثًا فِي كُلِّ عَيْنٍ قَالَ: وَقَالَ: «إِنَّ خَيْرَ مَا تَدَاوَيْتُمْ بِهِ اللَّدُودُ وَالسَّعُوطُ وَالْحِجَامَةُ وَالْمَشِيُّ وَخَيْرَ مَا اكْتَحَلْتُمْ بِهِ الْإِثْمِدُ فَإِنَّهُ يَجْلُو الْبَصَرَ وَيُنْبِتُ الشَّعْرَ وَإِنَّ خَيْرَ مَا تَحْتَجِمُونَ فِيهِ يَوْمُ سَبْعَ عَشْرَةَ وَيَوْمُ تِسْعَ عَشْرَةَ وَيَوْمُ إِحْدَى وَعِشْرِينَ» وَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَيْثُ عُرِجَ بِهِ مَا مَرَّ عَلَى مَلَأٍ مِنَ الْمَلَائِكَةِ إِلَّا قَالُوا: عَلَيْكَ بِالْحِجَامَةِ. رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ","english":{"narrator":"","text":"He said the Prophet used to apply antimony three times in each eye before going to sleep, and reported him as saying, “The best medicines you apply are those sipped at the corners of the mouth, those snuffed up the nose, cupping, purgatives; the best thing you apply to your eyes is antimony, for it clears the sight and makes the hair grow ; and the best days for cupping are the seventeenth, nineteenth and twenty-first.” When God’s messenger was taken up to visit heaven every company of angels he passed said, “Keep up the practice of cupping.” \nTirmidhi transmitted it, saying this is a hasan  gharib tradition."}},{"id":161,"idInBook":161,"chapterId":22,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى الرِّجَالَ وَالنِّسَاءَ عَنْ دُخُولِ الْحَمَّامَاتِ ثُمَّ رَخَّصَ لِلرِّجَالِ أَنْ يَدْخُلُوا بِالْمَيَازِرِ. رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد","english":{"narrator":"","text":"‘A’isha said the Prophet forbade men and women from entering baths, but afterwards permitted men to enter them wearing lower garments. \nTirmidhi and Abu Dawud transmitted it."}},{"id":162,"idInBook":162,"chapterId":22,"bookId":14,"arabic":"وَعَنْ أَبِي الْمَلِيحِ قَالَ: قَدِمَ عَلَى عَائِشَةَ نِسْوَةٌ مِنْ أَهْلِ حِمْصٍ فَقَالَتْ: مَنْ أَيْنَ أنتنَّ؟ قلنَ: من الشَّامِ فَلَعَلَّكُنَّ مِنَ الْكُورَةِ الَّتِي تَدْخُلُ نِسَاؤُهَا الْحَمَّامَاتِ؟ قُلْنَ: بَلَى قَالَتْ: فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَا تَخْلَعُ امْرَأَةٌ ثِيَابَهَا فِي غَيْرِ بَيْتِ زَوْجِهَا إِلَّا هَتَكَتِ السِّتْرَ بَيْنَهَا وَبَيْنَ رَبِّهَا» . وَفِي رِوَايَةٍ: «فِي غيرِ بيتِها إِلا هتكت سترهَا بَيْنَهَا وَبَيْنَ اللَّهِ عَزَّ وَجَلَّ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُد","english":{"narrator":"","text":"Abul Malih told that some women who belonged to Hims came to ‘A’isha and she asked where they were from. On their replying that they came from Syria she said, “Perhaps you come from the region whose women enter the baths.” They replied that that was so, and then she told them she had heard God’s messenger say, “A woman does not remoye her clothes elsewhere than in her husband’s house without tearing down the veil between her and her Lord.” A version has, \"elsewhere than in her house without tearing down her veil between her and God who is great and glorious.” \nTirmidhi and Abu Dawud transmitted it."}},{"id":163,"idInBook":163,"chapterId":22,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" سَتُفْتَحُ لَكُمْ أَرْضُ الْعَجَمِ وَسَتَجِدُونَ فِيهَا بُيُوتًا يُقَالُ لَهَا: الْحَمَّامَاتُ فَلَا يَدْخُلَنَّهَا الرِّجَالُ إِلَّا بِالْأُزُرِ وَامْنَعُوهَا النِّسَاءَ إِلَّا مَرِيضَةً أَوْ نُفَسَاءَ \". رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"‘Abdallah b. 'Amr reported God’s messenger as saving, \"The land of the foreigners will be conquered for you, and you will find in it houses called baths. Men must not enter them without lower garments. Keep women away from them, except those who are ill or in childbed.” \nAbu Dawud transmitted it."}},{"id":164,"idInBook":164,"chapterId":22,"bookId":14,"arabic":"وَعَنْ جَابِرٌ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلَا يَدخلِ الحمّامَ بِغَيْر إِزارٍ وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلَا يدْخل حَلِيلَتَهُ الْحَمَّامَ وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلَا يَجْلِسُ عَلَى مَائِدَةٍ تُدَارُ عَلَيْهَا الْخمر» . رَوَاهُ التِّرْمِذِيّ وَالنَّسَائِيّ","english":{"narrator":"","text":"Jabir reported the Prophet as saying, \"He who believes in God and the last day must not enter a bath without a lower garment; he who believes in God and the last day must not bring his spouse into a bath ; and he who believes in God and the last day must not sit at a cloth where wine is being circulated.” \nTirmidhi and Nasa'i transmitted it."}},{"id":165,"idInBook":165,"chapterId":22,"bookId":14,"arabic":"عَن ثابتٍ قَالَ: سُئِلَ أَنَسٌ عَنْ خِضَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: لَوْ شِئْتَ أَنْ أَعُدَّ شَمَطَاتٍ كُنَّ فِي رَأْسِهِ فَعَلْتُ قَالَ: وَلَمْ يَخْتَضِبْ زَادَ فِي رِوَايَةٍ: وَقَدِ اخْتَضَبَ أَبُو بَكْرٍ بِالْحِنَّاءِ وَالْكَتَمِ وَاخْتَضَبَ عُمَرُ بِالْحِنَّاءِ بحتا","english":{"narrator":"","text":"Thabit told that when Anas was asked whether the Prophet dyed his hair he replied, \"If I had wanted to count the hoary hairs which were on his head I could have done so,” adding that he did not dye his hair. In a version he added that Abu Bakr dyed his hair with henna and katam, and ‘Umar dyed it with henna alone. \n(Bukhari and Muslim.)"}},{"id":166,"idInBook":166,"chapterId":22,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ أَنَّهُ كَانَ يَصْفِّرُ لِحْيَتَهُ بِالصُّفْرَةِ حَتَّى تَمْتَلِئَ ثِيَابُهُ مِنَ الصُّفْرَةِ فَقِيلَ لَهُ: لِمَ تُصْبِغُ بِالصُّفْرَةِ؟ قَالَ: أَنِّي رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصْبُغُ بِهَا وَلَمْ يَكُنْ شَيْءٌ أَحَبَّ إِلَيْهِ مِنْهَا وَقد كَانَ يصْبغ ثِيَابَهُ كُلَّهَا حَتَّى عِمَامَتَهُ. رَوَاهُ أَبُو دَاوُدَ وَالنَّسَائِيّ","english":{"narrator":"","text":"Ibn ‘Umar used to make his beard yellow with a yellow dye so that his clothes were full of it. He was asked why he used the yellow dye and replied, \"I saw God's messenger using it as a dye, and he liked nothing better than it. He used to dye all his clothes with it, even his turban.” \nAbu Dawud and Nasa’i transmitted it."}},{"id":167,"idInBook":167,"chapterId":22,"bookId":14,"arabic":"وَعَن عُثْمَانَ بْنِ عَبْدِ اللَّهِ بْنِ مَوْهَبٍ قَالَ: دَخَلْتُ عَلَى أُمِّ سَلَمَةَ فَأَخْرَجَتْ إِلَيْنَا شَعْرًا مِنْ شَعْرِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مخضوبا. رَوَاهُ البُخَارِيّ","english":{"narrator":"‘Uthman b. ‘Abdallah b. Mauhib said :","text":"I went to visit Umm Salama and she brought out for us some hairs of the Prophet which had been dyed. \nBukhari transmitted it."}},{"id":168,"idInBook":168,"chapterId":22,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: أَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمُخَنَّثٍ قَدْ خَضَبَ يَدَيْهِ وَرِجْلَيْهِ بِالْحِنَّاءِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا بَالُ هَذَا؟» قَالُوا: يَتَشَبَّهُ بِالنِّسَاءِ فَأَمَرَ بِهِ فَنُفِيَ إِلَى النَّقِيعِ. فَقيل: يَا رَسُولَ اللَّهِ أَلَا تَقْتُلُهُ؟ فَقَالَ: «إِنِّي نُهِيتُ عَنْ قَتْلِ الْمُصَلِّينَ» . رَوَاهُ أَبُو دَاوُدَ","english":{"narrator":"","text":"Abu Huraira told that a mukhannath who had dyed his hands and feet with henna was brought to God’s messenger who asked, \"What is the matter with this man?” On being told that he affected women’s get-up he ordered him to be banished to an-Naqi'. The people suggested that they should kill him, but he said, “I have been prohibited from killing people who pray.”\nAbu Dawud transmitted it."}},{"id":169,"idInBook":169,"chapterId":22,"bookId":14,"arabic":"وَعَن الوليدِ بن عقبةَ قَالَ: لَمَّا فَتَحَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَكَّةَ جَعَلَ أَهْلُ مَكَّةَ يَأْتُونَهُ بصبيانهم فيدعو لَهُم بِالْبركَةِ وَيمْسَح رؤوسهم فَجِيءَ بِي إِلَيْهِ وَأَنَا مُخَلَّقٌ فَلَمْ يَمَسَّنِي من أجل الخَلوق. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"Al-Walid b. ‘Uqba said :","text":"When God’s messenger conquered Mecca the people of Mecca began to bring their boys and he would invoke a blessing on them and rub their heads. I was brought, but as I had been perfumed with a mixture of saffron he did not touch me because of the perfume.\nAbu Dawud transmitted it."}},{"id":170,"idInBook":170,"chapterId":22,"bookId":14,"arabic":"وَعَنْ أَبِي قَتَادَةَ أَنَّهُ قَالَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ لِي جُمَّةً أَفَأُرَجِّلُهَا؟ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «نَعَمْ وَأَكْرِمْهَا» قَالَ: فَكَانَ أَبُو قَتَادَةَ رُبَّمَا دَهَنَهَا فِي الْيَوْمِ مَرَّتَيْنِ مِنْ أَجْلِ قَوْلُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «نِعْمَ وَأَكْرمهَا» . رَوَاهُ مَالك","english":{"narrator":"","text":"Abu Qatada told that he said to God’s messenger, \"I have locks coming down to the shoulders, so should I comb it ?” He replied, “Yes, and show honour to it.” Abu Qatada often greased it twice a day because God’s messenger said, “Yes, and show honour to it.” \nMalik transmitted it."}},{"id":171,"idInBook":171,"chapterId":22,"bookId":14,"arabic":"وَعَن الحجاح بْنِ حَسَّانَ قَالَ دَخَلْنَا عَلَى أَنَسِ بْنِ مَالك فَحَدَّثَتْنِي أُخْتِي الْمُغِيرَةُ قَالَتْ: وَأَنْتَ يَوْمَئِذٍ غُلَامٌ وَلَكَ قَرْنَانِ أَوْ قُصَّتَانِ فَمَسَحَ رَأْسَكَ وَبَرَّكَ عَلَيْكَ وَقَالَ: «احْلِقُوا هَذَيْنِ أَوْ قُصُّوهُمَا فَإِنَّ هَذَا زِيُّ الْيَهُود» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"Al-Hajjaj b. Hassan said :","text":"We went in to visit Anas b. Malik, and my sister al-Mughira told me that at that time I was a youth with two plaits of hair (The text mentions qarnan or qussatan. The former would mean two side plaits and the latter two plaits over the forehead. The alternative is given evidently because the transmitter is not sure which was the correct word), and he wiped my head, invoked a blessing on me and said, “Shave these two, or clip them, for this is the style of the Jews.” \nAbu Dawud transmitted it."}},{"id":172,"idInBook":172,"chapterId":22,"bookId":14,"arabic":"وَعَنْ عَلِيٍّ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ تَحْلِقَ الْمَرْأَةُ رَأْسَهَا. رَوَاهُ النَّسَائِيُّ","english":{"narrator":"","text":"‘Ali said God's messenger forbade that a woman should shave her head. \nNasa'i transmitted it."}},{"id":173,"idInBook":173,"chapterId":22,"bookId":14,"arabic":"وَعَن عطاءِ بن يسارٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْمَسْجِدِ فَدَخَلَ رَجُلٌ ثَائِرُ الرَّأْسِ وَاللِّحْيَةِ فَأَشَارَ إِلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِيَدِهِ كَأَنَّهُ يَأْمُرُهُ بِإِصْلَاحِ شَعْرِهِ وَلِحْيَتِهِ فَفَعَلَ ثُمَّ رَجَعَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَلَيْسَ هَذَا خَيْرًا مِنْ أَنْ يَأْتِيَ أَحَدُكُمْ وَهُوَ ثَائِرُ الرَّأْسِ كَأَنَّهُ شَيْطَان» . رَوَاهُ مَالك","english":{"narrator":"","text":"‘Ata’ b. Yasar told that when God’s messenger was in the mosque a man whose head and beard were dishevelled entered, and God’s messenger pointed his hand at him as though he were ordering him to arrange his hair and his beard. When he had done so and returned, God's messenger said, “Is this not better than that one of you should come with his head dishevelled, as though he were a devil ?” \nMalik transmitted it."}},{"id":174,"idInBook":174,"chapterId":22,"bookId":14,"arabic":"وَعَن ابنِ الْمسيب سُمِعَ يَقُولُ: \n\" إِنَّ اللَّهَ طَيِّبٌ يُحِبُّ الطِّيبَ نَظِيفٌ يُحِبُّ النَّظَافَةَ كَرِيمٌ يُحِبُّ الْكَرَمَ جَوَادٌ يُحِبُّ الْجُودَ فَنَظِّفُوا أُرَاهُ قَالَ: أَفْنِيَتَكُمْ وَلَا تشبَّهوا باليهود \" قَالَ: فذكرتُ ذَلِك لمهاجرين مِسْمَارٍ فَقَالَ: حَدَّثَنِيهِ عَامِرُ بْنُ سَعْدٍ عَنْ أَبِيهِ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ إِلَّا أَنَّهُ قَالَ: «نَظِّفُوا أَفْنِيتَكُمْ» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"Ibn al-Musayyib was heard saying :","text":"“God is good and likes what is fragrant (Tayyib is ‘good’ and tib is ‘perfume’, or ‘fragrance.’); clean and likes cleanliness; generous and likes generosity; munificent and likes munificence; so cleanse (I think he said, your courtyards), and do not imitate the Jews.” I mentioned that to Muhajir b. Mismar and he said he had been told by ‘Amir b. Sa‘d, on his father’s authority, that the Prophet had said something similar, but he said, “Cleanse your courtyards.” \nTirmidhi transmitted it."}},{"id":175,"idInBook":175,"chapterId":22,"bookId":14,"arabic":"وَعَنْ يَحْيَى بْنِ سَعِيدٍ أَنَّهُ سَمِعَ سَعِيدَ بْنَ الْمُسَيَّبِ يَقُولُ: كَانَ إِبْرَاهِيمُ خَلِيلُ الرَّحْمَنِ أوَّلَ النَّاس ضيَّف الضَّيْف وَأَوَّلَ النَّاسِ اخْتَتَنَ وَأَوَّلَ النَّاسِ قَصَّ شَارِبَهُ وَأَوَّلَ النَّاسِ رَأَى الشَّيْبَ فَقَالَ: يَا رَبِّ: مَا هَذَا؟ قَالَ الرَّبُّ تَبَارَكَ وَتَعَالَى: وَقَارٌ يَا إِبْرَاهِيمُ قَالَ: رَبِّ زِدْنِي وَقَارًا. رَوَاهُ مَالك","english":{"narrator":"Yahya b. Sa'id told that he heard Sa'id b. al-Musayyib say :","text":"Abraham, the friend of the Compassionate One, was the first man to entertain a guest, the first man to be circumcised, the first man to clip his moustache, and he first man to notice grey hairs, so he said, “What is this, my Lord?” The Lord who is blessed and exalted replied, “Dignity, Abraham.” He said, “My Lord, give me more dignity.” \nMalik transmitted it."}},{"id":176,"idInBook":176,"chapterId":22,"bookId":14,"arabic":"عَن أبي طَلْحَة قَالَ: قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَدْخُلُ الْمَلَائِكَةُ بَيْتًا فِيهِ كَلْبٌ وَلَا تصاوير»","english":{"narrator":"","text":"Abu Talha reported the Prophet as saying, “The angels do not enter a house which contains a dog or pictures.” \n(Bukhari and Muslim.)"}},{"id":177,"idInBook":177,"chapterId":22,"bookId":14,"arabic":"وَعَن ابنِ عبَّاسٍ عَنْ مَيْمُونَةَ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أصبحَ يَوْمًا واجماً وَقَالَ: «إِنَّ جِبْرِيلَ كَانَ وَعَدَنِي أَنْ يَلْقَانِيَ اللَّيْلَةَ فَلَمْ يَلْقَنِي أَمَ وَاللَّهِ مَا أَخْلَفَنِي» . ثُمَّ وَقَعَ فِي نَفْسِهِ جِرْوُ كَلْبٍ تَحْتَ فُسْطَاطٍ لَهُ فَأَمَرَ بِهِ فَأُخْرِجَ ثُمَّ أَخَذَ بيدِه مَاء فنضحَ مَكَانَهُ فَلَمَّا أَمْسَى لقِيه جِبْرِيلَ فَقَالَ: «لَقَدْ كُنْتَ وَعَدْتَنِي أَنْ تَلْقَانِي الْبَارِحَةَ» . قَالَ: أَجَلْ وَلَكِنَّا لَا نَدْخُلُ بَيْتًا فِيهِ كَلْبٌ وَلَا صُورَةٌ فَأَصْبَحَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَئِذٍ فَأَمَرَ بِقَتْلِ الْكلاب حَتَّى إِنه يَأْمر بقتل الْكَلْب الْحَائِطِ الصَّغِيرِ وَيَتْرُكُ كَلْبَ الْحَائِطِ الْكَبِيرِ. رَوَاهُ مُسلم","english":{"narrator":"","text":"Ibn ‘Abbas told on Maimuna’s authority that one morning God’s messenger was silent with grief, and said, “Gabriel promised to meet me last night, but he did not do so. I swear by God that he has never broken his promise before.” He then thought of a puppy which he had seen under a (Fustat Mirqat, iv, 484 considers that here it means a couch) tent of his, and when he had given orders and had it put out he took some water in his hand and sprinkled the place where it had been. In the evening Gabriel met him and he said, “You promised to meet me yesterday,” to which he replied, “Yes, but we do not enter a house which contains a dog or a picture.” So next morning God’s messenger ordered that dogs should be killed, even to the extent of ordering that dogs which guarded small gardens should be killed, but leaving out of account those which guarded large gardens. \nMuslim transmitted it."}},{"id":178,"idInBook":178,"chapterId":22,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَكُنْ يَتْرُكُ فِي بَيْتِهِ شَيْئًا فِيهِ تَصَالِيبُ إِلَّا نَقَضَهُ. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"‘A’isha told that the Prophet never left in his house anything containing figures of a cross without destroying it. \nBukhari transmitted it."}},{"id":179,"idInBook":179,"chapterId":22,"bookId":14,"arabic":"وَعَنْهَا أَنَّهَا اشْتَرَتْ نُمْرُقَةً فِيهَا تَصَاوِيرُ فَلَمَّا رَآهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَامَ عَلَى الْبَابِ فَلَمْ يَدْخُلْ فَعَرَفْتُ فِي وَجْهِهِ الْكَرَاهِيَةَ قَالَتْ: فَقُلْتُ: يَا رَسُولَ اللَّهِ أتوبُ إِلى الله وإِلى رَسُوله مَا أذنبتُ؟ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا بَالُ هَذِهِ النُّمْرُقَةِ؟» قُلْتُ: اشْتَرَيْتُهَا لَكَ لِتَقْعُدَ عَلَيْهَا وَتَوَسَّدَهَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" إِنَّ أَصْحَابَ هَذِهِ الصُّوَرِ يُعَذَّبُونَ يَوْمَ الْقِيَامَةِ وَيُقَالُ لَهُمْ: أَحْيُوا مَا خَلَقْتُمْ \". وَقَالَ: «إِنَّ الْبَيْتَ الَّذِي فِيهِ الصُّورَةُ لَا تدخله الْمَلَائِكَة»","english":{"narrator":"","text":"She told that she bought a cushion on which were pictures, and when God’s messenger saw it he stopped at the door and did not enter. Seeing the signs of disapproval in his face she said, “Messenger of God, I repent towards God and His messenger. What have I done wrong ?” He asked, “What is the meaning of this cushion ?” and when she replied that she had bought it for him to sit and recline on he said, “The people who make these pictures will be punished on the day of resurrection and be told to bring to life what they have created,” adding, “The angels do not enter a house which contains a picture.” \n(Bukhari and Muslim.)"}},{"id":180,"idInBook":180,"chapterId":22,"bookId":14,"arabic":"وعنها أَنَّهَا كَانَت عَلَى سَهْوَةٍ لَهَا سِتْرًا فِيهِ تَمَاثِيلُ فَهَتَكَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاتَّخَذَتْ مِنْهُ نُمرُقتين فكانتا فِي الْبَيْت يجلسُ عَلَيْهِم","english":{"narrator":"","text":"She told that she had screened a store-room of hers with a curtain on which there were figures and the Prophet tore it down ; so she made two cushions out of it and had them in the house for sitting on.” \n(Bukhari and Muslim.)"}},{"id":181,"idInBook":181,"chapterId":22,"bookId":14,"arabic":"وَعَنْهَا أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ فِي غَزَاةٍ فَأَخَذَتْ نَمَطًا فَسَتَرَتْهُ عَلَى الْبَابِ فَلَمَّا قَدِمَ فَرَأَى النَّمَطَ فَجَذَبَهُ حَتَّى هَتَكَهُ ثُمَّ قَالَ: «إِنَّ اللَّهَ لَمْ يَأْمُرْنَا أَنْ نَكْسُوَ الْحِجَارَةَ وَالطِّينَ»","english":{"narrator":"She said :","text":"The Prophet went out on an expedition and I got a carpet which I hung as a screen at the door, but when he came and saw the carpet he pulled it and tore it down, saying, “God has not commanded us to clothe stones and clay.” \n(Bukhari and Muslim.)"}},{"id":182,"idInBook":182,"chapterId":22,"bookId":14,"arabic":"وَعَنْهَا عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أَشَدُّ النَّاسِ عَذَابًا يَوْمَ الْقِيَامَةِ الَّذِينَ يُضَاهُونَ بِخلق الله»","english":{"narrator":"","text":"She reported the Prophet as saying, “Those who will receive the severest punishment on the day of resurrection will be they who imitate what God has created.” \n(Bukhari and Muslim.)"}},{"id":183,"idInBook":183,"chapterId":22,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: \n\" قَالَ اللَّهُ تَعَالَى: وَمَنْ أَظْلَمُ مِمَّنْ ذَهَبَ بِخلق كخلقي فلْيخلقوا ذَرَّةً أَوْ لِيَخْلُقُوا حَبَّةً أَوْ شَعِيرَةً \"","english":{"narrator":"","text":"Abu Huraira told of hearing God’s messenger state that God most high says, “Who is more in the wrong than he who sets about creating things like what I have created ? Well, let such people create an atom, let them create a grain, or a grain of barley.” \n(Bukhari and Muslim)."}},{"id":184,"idInBook":184,"chapterId":22,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «أَشَدُّ النَّاسِ عَذَابًا عِنْدَ اللَّهِ المصوِّرون»","english":{"narrator":"","text":"'Abdallah b. Mas'ud told that he heard God’s messenger say, “Those who will receive the severest punishment from God will be the people who make representations of things.” (Al-musawwiruna. There is a difference of opinion as to whether this refers to those who make snch representations as idols to be worshipped, or whether the reference is to representations of living creatures in general.)\n(Bukhari and Muslim.)"}},{"id":185,"idInBook":185,"chapterId":22,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم يَقُول: «كُلُّ مُصَوِّرٍ فِي النَّارِ يُجْعَلُ لَهُ بِكُلِّ صُورَةٍ صَوَّرَهَا نَفْسًا فَيُعَذِّبُهُ فِي جَهَنَّمَ» . قَالَ ابْن عَبَّاس: فَإِن كنت لابد فَاعِلًا فَاصْنَعِ الشَّجَرَ وَمَا لَا رُوحَ فِيهِ","english":{"narrator":"Ibn ‘Abbas told that he heard God’s messenger say, “Everyone who makes representations of things will go to hell, and for every representation he has made there will be produced a soul which will punish him in jahannam.” Ibn ‘Abbas said :","text":"If you must do it, make pictures of trees and of things which do not possess a soul. \n(Bukhari and Muslim.)"}},{"id":186,"idInBook":186,"chapterId":22,"bookId":14,"arabic":"وَعَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنْ تَحَلَّمَ بِحُلْمٍ لَمْ يَرَهُ كُلِّفَ أَنْ يَعْقِدَ بَيْنَ شَعِيرَتَيْنِ وَلَنْ يَفْعَلَ وَمَنِ اسْتَمَعَ إِلَى حَدِيثِ قَوْمٍ وَهُمْ لَهُ كَارِهُونَ أَوْ يَفِرُّونَ مِنْهُ صُبَّ فِي أُذُنَيْهِ الْآنُكُ يَوْمَ الْقِيَامَةِ وَمَنْ صَوَّرَ صُورَةً عُذِّبَ وَكُلِّفَ أَنْ يَنْفُخَ فِيهَا وَلَيْسَ بِنَافِخٍ» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"He told that he heard God’s messenger say, “If anyone pretends to have had a dream which he did not see he will be given the task of joining two barley-seeds, but will be unable to do so ; if anyone listens to other people’s talk when they do not want him to hear, or try to avoid him, lead will be poured into his ears on the day of resurrection; and he who makes a representation of anything will be punished and given the task of breathing into it, but will be unable to do so.”\nBukhari transmitted it."}},{"id":187,"idInBook":187,"chapterId":22,"bookId":14,"arabic":"وَعَنْ بُرَيْدَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ لَعِبَ بِالنَّرْدَشِيرِ فَكَأَنَّمَا صَبَغَ يَدَهُ فِي لَحْمِ خِنْزِيرٍ وَدَمِهِ» . رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"Buraida reported the Prophet as saying, \"He who plays backgammon is as though he had dipped his hand in a pig’s flesh and blood.” \nMuslim transmitted it."}},{"id":188,"idInBook":188,"chapterId":22,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" أَتَانِي جِبْرِيلُ عَلَيْهِ السَّلَامُ قَالَ: أَتَيْتُكَ الْبَارِحَةَ فَلَمْ يَمْنَعْنِي أَنْ أَكُونَ دَخَلْتُ إِلَّا أَنَّهُ كَانَ عَلَى الْبَابِ تَمَاثِيلُ وَكَانَ فِي الْبَيْتِ قِرَامُ سِتْرٍ فِيهِ تَمَاثِيلُ وَكَانَ فِي الْبَيْتِ كَلْبٌ فَمُرْ بِرَأْسِ التِّمْثَالِ الَّذِي عَلَى بَابِ الْبَيْتِ فَيُقْطَعْ فَيَصِيرُ كَهَيْئَةِ الشَّجَرَةِ وَمُرْ بِالسِّتْرِ فَلْيُقْطَعْ فَلْيُجْعَلْ وِسَادَتَيْنِ مَنْبُوذَتَيْنِ تُوطَآنِ وَمُرْ بِالْكَلْبِ فَلْيُخْرَجْ \". فَفَعَلَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ. رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُد","english":{"narrator":"","text":"Abu Huraira said God's messenger told that Gabriel came to him and said, \"I came to you last night and was prevented from entering simply by the fact that there were images at the door, for there was a figured curtain with images on it and there was a dog in the house. So order that the head of the image which is at the door of the house be cut off so that it may become like the form of a tree; order that the curtain be cut up and made into two cushions spread out on which people may tread; and order that the dog be put out.” God’s messenger then did so.\nTirmidhi and Abu Dawud transmitted it."}},{"id":189,"idInBook":189,"chapterId":22,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" يَخْرُجُ عُنُقٌ مِنَ النَّارِ يَوْمَ الْقِيَامَةِ لَهَا عَيْنَانِ تُبْصِرَانِ وَأُذُنَانِ تَسْمَعَانِ وَلِسَانٌ يَنْطِقُ يَقُولُ: إِنِّي وُكِّلْتُ بِثَلَاثَةٍ: بِكُلِّ جَبَّارٍ عَنِيدٍ وَكُلِّ مَنْ دَعَا مَعَ اللَّهِ إِلَهًا آخر وبالمصوِّرين \". رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"He reported God’s messenger as saying, \"On the day of resurrection there will issue from hell a portion having two eyes which see, two ears which hear and a tongue which speaks, and it will say it has been put in charge of three classes :","text":"everyone who is proud and obstreperous, everyone who invokes another god along with God, and those who make representations of things.” \nTirmidhi transmitted it."}},{"id":190,"idInBook":190,"chapterId":22,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" إِنَّ اللَّهَ تَعَالَى حَرَّمَ الْخَمْرَ وَالْمَيْسِرَ وَالْكُوبَةَ وَقَالَ: كُلُّ مُسْكِرٍ حَرَامٌ \". قِيلَ: الْكُوبَةُ الطَّبْلُ. رَوَاهُ الْبَيْهَقِيُّ فِي شعب الْإِيمَان","english":{"narrator":"","text":"Ibn ‘Abbas reported God’s messenger as saying, \"God most high has made wine, maisir and the kuba unlawfuland he said, \"Every intoxicant is unlawful.” The kuba is said to be the drum. \nBaihaqi transmitted it in Shu’ab al-iman."}},{"id":191,"idInBook":191,"chapterId":22,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنِ الْخَمْرِ وَالْمَيْسِرِ وَالْكُوبَةِ والغبيراء. الغبيراء: شَرَابٌ يَعْمَلُهُ الْحَبَشَةُ مِنَ الذُّرَةِ يُقَالُ لَهُ: السكركة. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Ibn ‘Umar said the Prophet prohibited wine, maisir, the kuba,/i>, and ghubaira’ which is an intoxicating drink made by Abyssinians from millet. It is called sukruka. \nAbu Dawud transmitted it."}},{"id":192,"idInBook":192,"chapterId":22,"bookId":14,"arabic":"وَعَنْ أَبِي مُوسَى الْأَشْعَرِيِّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ لَعِبَ بِالنَّرْدِ فَقَدْ عَصَى اللَّهَ وَرَسُولَهُ» . رَوَاهُ أَحْمَدُ وَأَبُو دَاوُد","english":{"narrator":"","text":"Abu Musa al-Ash‘ari reported God’s messenger as saying, \"He who plays backgammon has disobeyed God and His messenger.\" \nAhmad and Abu Dawud transmitted it."}},{"id":193,"idInBook":193,"chapterId":22,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى رَجُلًا يَتْبَعُ حَمَامَةً فَقَالَ: «شَيْطَانٌ يَتْبَعُ شَيْطَانَةً» . رَوَاهُ أَحْمَدُ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ وَالْبِيهَقِيُّ فِي شُعَبِ الْإِيمَانِ","english":{"narrator":"","text":"Abu Huraira told that God’s messenger saw a man following a pigeon and said, \"A devil is following a she-devil.\" \nAhmad, Abu Dawud, Ibn Majah and Baihaqi, in Shu’ab al-iman, transmitted it."}}],"chapter":{"id":22,"bookId":14,"arabic":"كتاب اللباس","english":"Clothing"}}