{"metadata":{"length":88,"arabic":{"title":"مشكاة المصابيح","author":"الإمام الكاتب التبريزي","introduction":"كتاب الطب والرقى"},"english":{"title":"Mishkat al-Masabih","author":"Al-Khatib Al-Tabrizi","introduction":"Medicine and Spells"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":23,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا أَنْزَلَ اللَّهُ دَاء إِلا أنزل لَهُ دَوَاء» . رَوَاهُ البُخَارِيّ","english":{"narrator":"Abu Huraira reported God’s messenger as saying:","text":"“God has not sent down a disease without sending down remedy for it.” \n\nBukhari transmitted it."}},{"id":2,"idInBook":2,"chapterId":23,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لِكُلِّ دَاءٍ دَوَاءٌ فَإِذَا أُصِيبَ دَوَاءٌ الدَّاءَ بَرَأَ بِإِذْنِ اللَّهِ» . رَوَاهُ مُسلم","english":{"narrator":"Jabir reported God's messenger as saying:","text":"“There is a medicine for every disease, and when the medicine is applied to the disease it is cured by God’s permission.” \n\nMuslim transmitted it."}},{"id":3,"idInBook":3,"chapterId":23,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" الشِّفَاءُ فِي ثَلَاثٍ: فِي شَرْطَةِ مِحْجَمٍ أَوْ شَرْبَةِ عَسَلٍ أَوْ كَيَّةٍ بِنَارٍ وَأَنَا أَنْهَى أُمَّتِي عَنِ الْكَيِّ \". رَوَاهُ البُخَارِيّ","english":{"narrator":"Ibn ‘Abbas reported God’s messenger as saying:","text":"“There is a remedy in three things: the incision of a cupping-glass, a drink of honey, or cauterization by fire, but I forbid my people to cauterize.” \n\nBukhari transmitted.it."}},{"id":4,"idInBook":4,"chapterId":23,"bookId":14,"arabic":"وَعَن جابرٍ قَالَ: رُمِيَ أَبِي يَوْمَ الْأَحْزَابِ عَلَى أَكْحَلِهِ فَكَوَاهُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ. رَوَاهُ مُسلم","english":{"narrator":"","text":"Jabir told that at the battle of the Confederates* Ubayy was struck by an arrow in the median vein of the arm and God’s messenger cauterized it. \n\nMuslim transmitted it.\n\n* i.e. the battle of the Trench, 5 A. H."}},{"id":5,"idInBook":5,"chapterId":23,"bookId":14,"arabic":"وَعَنْهُ قَالَ: رُمِيَ سَعْدُ بْنُ مُعَاذٍ فِي أكحله فحمسه النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِيَدِهِ بِمِشْقَصٍ ثمَّ ورمت فحمسه الثَّانِيَة. رَوَاهُ مُسلم","english":{"narrator":"","text":"He told that when Sa'id b. Mu'adh was shot in the median vein of his arm the Prophet with his own hand cauterized it with a broad arrow head. Afterwards it swelled up and he cauterized it a second time. \n\nMuslim transmitted it."}},{"id":6,"idInBook":6,"chapterId":23,"bookId":14,"arabic":"وَعَنْهُ قَالَ: بَعَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى أُبيِّ بن كَعْب طَبِيبا فَقَطَعَ مِنْهُ عِرْقًا ثُمَّ كَوَاهُ عَلَيْهِ. رَوَاهُ مُسلم","english":{"narrator":"","text":"He told that God’s messenger sent to Ubayy b. Ka'b a physician who cut a vein of his and cauterized it.\n\nMuslim transmitted it."}},{"id":7,"idInBook":7,"chapterId":23,"bookId":14,"arabic":"وَعَن أَبِي هُرَيْرَةَ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «فِي الْحَبَّةِ السَّوْدَاءِ شِفَاءٌ مِنْ كُلِّ دَاءٍ إِلَّا السَّامَ» . قَالَ ابْنُ شِهَابٍ: السَّامُ: الْمَوْتُ وَالْحَبَّةُ السَّوْدَاءُ: الشُّونِيزُ","english":{"narrator":"Aba Huraira told of hearing God’s messenger say:","text":"“Nigella seed is a remedy for every disease but sam.” \nIbn Shihab said sant is death and the nigella seed is shuniz.* \n\n(Bukhari and Muslim.)\n* Taj al-’arus says this is a Persian word which came to be used by Arabs. It indicates a seed of a species of nigella."}},{"id":8,"idInBook":8,"chapterId":23,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: جَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: أَخِي اسْتَطْلَقَ بَطْنُهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «اسقيه عسَلاً» فَسَقَاهُ ثُمَّ جَاءَ فَقَالَ: سَقَيْتُهُ فَلَمْ يَزِدْهُ إِلَّا اسْتِطْلَاقًا فَقَالَ لَهُ ثَلَاثَ مَرَّاتٍ. ثُمَّ جَاءَ الرَّابِعَةَ فَقَالَ: «اسْقِهِ عَسَلًا» . فَقَالَ: لَقَدْ سَقَيْتُهُ فَلَمْ يَزِدْهُ إِلَّا اسْتِطْلَاقًا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «صَدَقَ اللَّهُ وَكَذَبَ بَطْنُ أَخِيكَ» . فَسَقَاهُ فَبَرَأَ","english":{"narrator":"","text":"Abu Sa'id al-Khudri said that a man came to the Prophet and told him his brother's bowels were loose, so God’s messenger told him to give him honey to drink . He did so and then came and said, “I gave it him to drink but it has only made his bowels more loose.” This he said three times, and when he came a fourth time and was told to give him honey to drink he said, “I have done so, but it has only increased the looseness.” God's messenger replied, “God has spoken the truth and your brother’s bowels have lied.” He then gave him it to drink and he recovered.\n\n (Bukhari and Muslim.)"}},{"id":9,"idInBook":9,"chapterId":23,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ أَمْثَلَ مَا تَدَاوَيْتُمْ بِهِ الْحجامَة والقُسْط البحري»","english":{"narrator":"","text":"Anas reported God's messenger as saying, \"The best medical treatments you apply are cupping and sea costus.” \n\n(Bukhari and Muslim.)"}},{"id":10,"idInBook":10,"chapterId":23,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تُعَذِّبُوا صِبْيَانَكُمْ بِالْغَمْزِ مِنَ الْعُذْرَةِ عَلَيْكُمْ بِالْقُسْطِ»","english":{"narrator":"He reported God’s messenger as saying:","text":"“Do not afflict your children by squeezing for a swelling in the uvula, but apply costus.” \n\n(Bukhari and Muslim .)"}},{"id":11,"idInBook":11,"chapterId":23,"bookId":14,"arabic":"وَعَن أُمِّ قَيْسٍ قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «على مَ تَدْغَرْنَ أَوْلَادَكُنَّ بِهَذَا الْعِلَاقِ؟ عَلَيْكُنَّ بِهَذَا الْعُودِ الْهِنْدِيِّ فَإِنَّ فِيهِ سَبْعَةَ أَشْفِيَةٍ مِنْهَا ذَاتُ الْجَنْبِ يُسْعَطُ مِنَ الْعُذْرَةِ وَيُلَدُّ مِنْ ذَاتِ الْجنب»","english":{"narrator":"Umm Qais reported God's messenger as saying:","text":"“Why do you compress the uvula in this way? Use this Indian aloes wood, for it contains seven types of remedy, among them being a remedy for pleurisy. It is applied through the nose for a swelling of the uvula and poured into the side of the mouth for pleurisy.” \n\n(Bukhari and Muslim )"}},{"id":12,"idInBook":12,"chapterId":23,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ وَرَافِعِ بْنِ خَدِيجٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْحمى من فيج جَهَنَّم فَأَبْرِدُوهَا بِالْمَاءِ»","english":{"narrator":"‘A’isha and Raf’i b. Khadij reported the Prophet as saying:","text":"“Fever is due to the vehemence of the heat of hell, so cool it with water.” \n\n(Bukhari and Muslim.)."}},{"id":13,"idInBook":13,"chapterId":23,"bookId":14,"arabic":"وَعَن أنسٍ قَالَ: رَخَّصَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الرُّقْيَةِ مِنَ الْعَيْنِ وَالْحُمَّةِ وَالنَّمْلَةِ. رَوَاهُ مُسلم","english":{"narrator":"","text":"Anas said God’s messenger gave permission to use a spell for the evil eye, scorpion sting and small pustules. \n\nMuslim transmitted it."}},{"id":14,"idInBook":14,"chapterId":23,"bookId":14,"arabic":"وَعَن عَائِشَة قَالَتْ: أَمَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَسْتَرْقِيَ مِنَ الْعَيْنِ","english":{"narrator":"'Aisha said :","text":"The Prophet gave command that we should use a spell against the evil eye. \n\n(Bukhari and Muslim.)"}},{"id":15,"idInBook":15,"chapterId":23,"bookId":14,"arabic":"وَعَنْ أُمِّ سَلَمَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى فِي بَيْتِهَا جَارِيَةً فِي وجهِها سفعة يَعْنِي صُفْرَةً فَقَالَ: «اسْتَرْقُوا لَهَا فَإِنَّ بِهَا النَّظْرَةَ»","english":{"narrator":"Umm Salama told that the Prophet saw in her house a girl with saf’a, i.e. yellowness,* in her face and said:","text":"“Use a spell for her, for she has been affected by the evil eye.” \n\n(Bukhari and Muslim.)\n\n* Saf’a is explained as a stroke from the devil, or the influence of the evil eye. It may be read suf’a which means blackness, or blackness tinged with red. Sufra normally means yellowness, but it can also mean blackness, and that may be the interpretation it should have here, in which case one should read suf'a."}},{"id":16,"idInBook":16,"chapterId":23,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ الرُّقَى فَجَاءَ آلُ عَمْرِو بْنِ حَزْمٍ فَقَالُوا: يَا رَسُولَ اللَّهِ إِنَّهُ كَانَتْ عِنْدَنَا رُقْيَةٌ نَرْقِي بِهَا مِنَ الْعَقْرَبِ وَأَنْتَ نَهَيْتَ عَنِ الرُّقَى فَعَرَضُوهَا عَلَيْهِ فَقَالَ: «مَا أَرَى بِهَا بَأْسًا مَنِ اسْتَطَاعَ مِنْكُمْ أَنْ يَنْفَعَ أَخَاهُ فَلْيَنْفَعْهُ» . رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"Jabir told that God’s messenger prohibited spells, and the family of ‘Amr b. Hazm came and said, “Messenger of God, we had a spell proved efficacious which we applied for scorpion bite, but you have prohibited spells.” They submitted it to him and he said, “I see no harm in it. If any of you is able to benefit his brother, let him do so.” \n\nMuslim transmitted it."}},{"id":17,"idInBook":17,"chapterId":23,"bookId":14,"arabic":"وَعَن عوفِ بن مَالك الْأَشْجَعِيّ قَالَ: كُنَّا نَرْقِي فِي الْجَاهِلِيَّةِ فَقُلْنَا: يَا رَسُولَ اللَّهِ كَيْفَ تَرَى فِي ذَلِكَ؟ فَقَالَ: «اعْرِضُوا عَلَيَّ رُقَاكُمْ لَا بَأْسَ بِالرُّقَى مَا لم يكن فِيهِ شرك» . رَوَاهُ مُسلم","english":{"narrator":"‘Auf b. Malik al-Ashja‘i said:","text":"In the pre-Islamic period we used to apply spells, and we asked God’s messenger how he looked upon that. He replied, “Submit your spells to me. There is no harm in spells so long as they involve no polytheism.” \n\nMuslim transmitted it."}},{"id":18,"idInBook":18,"chapterId":23,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْعَيْنُ حَقٌّ فَلَوْ كَانَ شَيْءٌ سَابَقَ الْقَدَرِ سَبَقَتْهُ الْعَيْنُ وَإِذَا اسْتُغْسِلْتُمْ فاغسِلوا» . رَوَاهُ مُسلم","english":{"narrator":"Ibn ‘Abbas reported the Prophet as saying:","text":"“The evil eye is genuine If anything could get ahead of the decree the evil eye would do so. And when you are asked to bathe do so.”*\n\nMuslim transmitted it.\n\n* An indication of the practice here intended will be found in the tradition of Abu Umama near the end of Section II of this chapter."}},{"id":19,"idInBook":19,"chapterId":23,"bookId":14,"arabic":"عَنْ أُسَامَةَ بْنِ شَرِيكٍ قَالَ: قَالُوا: يَا رَسُول الله أفنتداوى؟ قَالَ: «نعم يَا عبد اللَّهِ تَدَاوَوْا فَإِنَّ اللَّهَ لَمْ يَضَعْ دَاءً إِلَّا وَضَعَ لَهُ شِفَاءً غَيْرَ دَاءٍ وَاحِدٍ الْهَرم» . رَوَاهُ أَحْمد وَالتِّرْمِذِيّ وَأَبُو دَاوُد","english":{"narrator":"","text":"Usama b. Sharik told that when God’s messenger was asked whether they should make use of medical treatment he replied, “Yes servants of God, make use of medical treatment, for God has not made a disease without appointing a remedy for it, with the exception of one disease; viz., old age.” \n\nAhmad, Tirmidhi and Abu Dawud transmitted it."}},{"id":20,"idInBook":20,"chapterId":23,"bookId":14,"arabic":"وَعَنْ عُقْبَةَ بْنِ عَامِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تُكْرِهُوا مَرْضَاكُمْ عَلَى الطَّعَامِ فَإِنَّ اللَّهَ يُطْعِمُهُمْ وَيَسْقِيهِمْ» . رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيث غَرِيب","english":{"narrator":"‘Uqba b. ‘Amir reported God’s messenger as saying:","text":"“Do not force your invalids to eat, for God most high gives them food and drink.”\n\nTirmidhi and Ibn Majah transmitted it, Tirmidhi saying this is a gharib tradition."}},{"id":21,"idInBook":21,"chapterId":23,"bookId":14,"arabic":"وَعَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَوَى أَسْعَدَ بْنَ زُرَارَةَ مِنَ الشَّوْكَةِ. رَوَاهُ التِّرْمِذِيّ وَقَالَ: هَذَا حَدِيث غَرِيب","english":{"narrator":"","text":"Anas told that the Prophet cauterized As'ad b. Zurara because of a redness from which he suffered. \n\nTirmidhi transmitted it, saying this is a gharib tradition."}},{"id":22,"idInBook":22,"chapterId":23,"bookId":14,"arabic":"وَعَن زيد بن أَرقم قَالَ: أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَتَدَاوَى مِنْ ذَاتِ الْجَنْبِ بِالْقُسْطِ البحريِّ وَالزَّيْت. رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Zaid b. Arqam told that God’s messenger ordered them to treat pleurisy with sea costus and olive oil. \n\nTirmidhi transmitted it."}},{"id":23,"idInBook":23,"chapterId":23,"bookId":14,"arabic":"وَعَنْهُ قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْعَتُ الزَّيْتَ وَالْوَرْسَ مِنْ ذَاتِ الْجَنْبِ. رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"He told that the Prophet used to recommend olive oil and wars for pleurisy. \n\nTirmidhi transmitted it."}},{"id":24,"idInBook":24,"chapterId":23,"bookId":14,"arabic":"وَعَن أَسْمَاءَ بِنْتِ عُمَيْسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَأَلَهَا: «بمَ تستَمشِينَ؟» قَالَت: بالشُّبْرمِ قَالَ: «حارٌّ حارٌّ» . قَالَتْ: ثُمَّ اسْتَمْشَيْتُ بِالسَّنَا فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَوْ أَنَّ شَيْئًا كَانَ فِيهِ الشِّفَاءُ مِنَ الْمَوْتِ لَكَانَ فِي السَّنَا» . رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيث حسن غَرِيب","english":{"narrator":"Asma’ daughter of ‘Umais told that the Prophet asked her what laxative she used and she replied that she used spurge, whereupon he declared that it was very hot. She then used senna as a purgative, and. the Prophet said:","text":"“If anything contained a remedy for death it would be senna.” \n\nTirmidhi and Ibn Majah transmitted it, Tirmidhi saying this is a hasan gharlb tradition."}},{"id":25,"idInBook":25,"chapterId":23,"bookId":14,"arabic":"وشطره الأول (صَحِيحٌ)\nوَعَنْ أَبِي الدَّرْدَاءِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ اللَّهَ أَنْزَلَ الدَّاءَ وَالدَّوَاءَ وَجَعَلَ لِكُلِّ دَاءٍ دَوَاءً فَتَدَاوُوا وَلَا تداوَوْا بحرامٍ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Abud Darda’ reported God's messenger as saying, “God has sent down both the disease and the cure, and He has appointed a cure for every disease, so treat yourselves medically, but use nothing unlawful.” \n\nAbu Dawud transmitted it."}},{"id":26,"idInBook":26,"chapterId":23,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ الدَّوَاءِ الْخَبِيثِ. رَوَاهُ أَحْمَدُ وَأَبُو دَاوُدَ وَالتِّرْمِذِيُّ وَابْنُ مَاجَهْ","english":{"narrator":"","text":"Abu Huraira told that God’s messenger prohibited unclean medicine. \n\nAhmad, Abu Dawud, Tirmidhi and Ibn Majah transmitted it."}},{"id":27,"idInBook":27,"chapterId":23,"bookId":14,"arabic":"وَعَنْ سَلْمَى خَادِمَةِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ: مَا كَانَ أَحَدٌ يَشْتَكِي إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَجَعًا فِي رَأْسِهِ إِلَّا قَالَ: «احْتَجِمْ» وَلَا وَجَعًا فِي رِجْلَيْهِ إِلَّا قَالَ: «اخْتَضِبْهُمَا» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Salma, the Prophet’s woman-servant, told that no one complained to God’s messenger of a headache without his telling him to get cupped, or of a pain in his legs without his telling him to dye them with henna. \n\nAbu Dawud transmitted it."}},{"id":28,"idInBook":28,"chapterId":23,"bookId":14,"arabic":"وعنها قَالَت: مَا كَانَ يَكُونَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قُرْحَةٌ وَلَا نَكْبَةٌ إِلَّا أَمَرَنِي أَنْ أَضَعَ عَلَيْهَا الْحِنَّاء. رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"She said that God’s messenger never had a wound or a bleeding foot* without ordering her to put henna on it. \n\nTirmidhi transmitted it.\n\n* Nakba is used. It means an injury to the foot caused by a stone which produce bleeding."}},{"id":29,"idInBook":29,"chapterId":23,"bookId":14,"arabic":"وَعَن أبي كَبْشَة الْأَنْمَارِيِّ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يحتجم على هامته وَبَين كفيه وَهُوَ يَقُولُ: «مَنْ أَهْرَاقَ مِنْ هَذِهِ الدِّمَاءِ فَلَا يَضُرُّهُ أَنْ لَا يَتَدَاوَى بِشَيْءٍ لِشَيْءٍ» . رَوَاهُ أَبُو دَاوُد وَابْن مَاجَه","english":{"narrator":"Abu Kabsha al-Anmari told that God’s messenger used to have himself cupped on the top of his head and between his shoulders and that he used to say:","text":"“If anyone pours out any of this blood he will not suffer if he applies no medical treatment for anything.” \n\nAbu Dawud and Ibn Majah transmitted it."}},{"id":30,"idInBook":30,"chapterId":23,"bookId":14,"arabic":"وَعَنْ جَابِرٌ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ احْتَجَمَ عَلَى وَرِكِهِ مِنْ وَثْءٍ كَانَ بِهِ. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Jabir told that the Prophet had himself cupped above the thigh for a contusion from which he suffered. \n\nAbu Dawud transmitted it."}},{"id":31,"idInBook":31,"chapterId":23,"bookId":14,"arabic":"وَعَن ابنِ مَسْعُود قَالَ: حَدَّثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ علن لَيْلَةَ أُسَرِيَ بِهِ: أَنَّهُ لَمْ يَمُرَّ عَلَى مَلَأٍ مِنَ الْمَلَائِكَةِ إِلَّا أَمَرُوهُ: «مُرْ أُمَّتَكَ بِالْحِجَامَةِ» . رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيث حسن غَرِيب","english":{"narrator":"Ibn Mas'ud said:","text":"In telling about the night when he was taken up to heaven God’s messenger said that he did not pass a company of angels without their ordering him to command his people to have themselves cupped. \n\nTirmidhi and Ibn Majah transmitted it, Tirmidhi saying that this is a hasan gharlb tradition."}},{"id":32,"idInBook":32,"chapterId":23,"bookId":14,"arabic":"وَعَنْ عَبْدِ الرَّحْمَنِ بْنِ عُثْمَانَ: إِنَّ طَبِيبًا سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ضِفْدَعٍ يَجْعَلُهَا فِي دَوَاءٍ فَنَهَاهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ قَتْلِهَا. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"‘Abd ar-Rahman b. ‘Uthman told that when a physician consulted the Prophet about putting frogs in medicine he forbade him to kill them.* \n\nAbu Dawud transmitted it.\n\n* The flesh of frogs mixed with olive oil was used as an antidote for snake bite, and the fat was considered helpful for extracting teeth. The prohibition of killing frogs most probably applies only to killing them for medicinal purposes."}},{"id":33,"idInBook":33,"chapterId":23,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَحْتَجِمُ فِي الْأَخْدَعَيْنِ وَالْكَاهِلِ. رَوَاهُ أَبُو دَاوُدَ وَزَادَ التِّرْمِذِيُّ وَابْنُ مَاجَهْ: وَكَانَ يحتجمُ سبعَ عشرَة وتسع عشرَة وَإِحْدَى وَعشْرين","english":{"narrator":"","text":"Anas said that God's messenger used to have himself cupped in the two veins at the sides of the neck and on the shoulder. \n\nAbu Dawud transmitted it, and Tirmidhi and Ibn Majah added that he used to have himself cupped on the 17th, 19th, and 21st."}},{"id":34,"idInBook":34,"chapterId":23,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَسْتَحِبُّ الْحِجَامَةَ لِسَبْعَ عَشْرَةَ وَتِسْعَ عَشْرَةَ وَإِحْدَى وَعِشْرِينَ. رَوَاهُ فِي شرح السّنة","english":{"narrator":"","text":"Ibn ‘Abbas said the Prophet liked to have himself cupped on the 17th, 19th, and 21st. \n\nBaghawi transmitted it in Sharh as-sunna."}},{"id":35,"idInBook":35,"chapterId":23,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنِ احْتَجَمَ لِسَبْعَ عَشْرَةَ وَتِسْعَ عَشْرَةَ وَإِحْدَى وَعِشْرِينَ كَانَ شِفَاءً لَهُ مِنْ كُلِّ دَاء» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “If anyone has himself cupped on the 17th, 19th, and 21st, it will be a remedy for every disease.” \n\nAbu Dawud transmitted it."}},{"id":36,"idInBook":36,"chapterId":23,"bookId":14,"arabic":"وَعَن كبشةَ بنت أبي بكرةَ: أَنَّ أَبَاهَا كَانَ يُنْهِي أَهْلَهُ عَنِ الْحِجَامَةِ يَوْمَ الثُّلَاثَاءِ وَيَزْعُمُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَنَّ يَوْمَ الثُّلَاثَاءِ يَوْمُ الدَّمِ وَفِيهِ سَاعَةٌ لَا يَرْقَأُ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Kabsha daughter of Abu Bakra told that her father used to forbid his family to have themselves cupped on a Tuesday, and used to assert on the authority of God’s messenger that Tuesday is the day of blood in which there is an hour when it does not stop. \n\nAbu Dawud transmitted it."}},{"id":37,"idInBook":37,"chapterId":23,"bookId":14,"arabic":"وَعَنِ الزُّهْرِيِّ مُرْسَلًا عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مِنْ احْتَجَمَ يَوْمَ الْأَرْبِعَاءِ أَوْ يَوْمَ السَّبْتِ فَأَصَابَهُ وَضَحٌ فَلَا يَلُومَنَّ إِلَّا نَفْسَهُ» . رَوَاهُ أَحْمَدُ وَأَبُو دَاوُدَ وَقَالَ: وَقَدْ أسْند وَلَا يَصح","english":{"narrator":"Zuhri reported in mursal form that the Prophet said:","text":"“If anyone has himself cupped on a Wednesday or a Saturday and is smitten by leprosy, he must blame no one but himself .” \n\nAhmad and Abu Dawud transmitted it. \nIt has been given an isnad, but Abu Dawud said that that is not sound;"}},{"id":38,"idInBook":38,"chapterId":23,"bookId":14,"arabic":"وَعَنْهُ مُرْسَلًا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنِ احْتَجَمَ أَوِ اطَّلَى يَوْمَ السَّبْتِ أَوِ الْأَرْبِعَاءِ فَلَا يَلُومَنَّ إِلَّا نَفْسَهُ فِي الوَضَحِ» . رَوَاهُ فِي شرح السّنة","english":{"narrator":"He reported in mursal form that God’s messenger said:","text":"“If anyone has himself cupped or smeared with something on a Saturday or a Wednesday, he must blame no one but himself if he gets leprosy.” \n\nIt is transmitted in Sharh as-sunna."}},{"id":39,"idInBook":39,"chapterId":23,"bookId":14,"arabic":"وَعَنْ زَيْنَبَ امْرَأَةِ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ أَنَّ عَبْدَ اللَّهِ رَأَى فِي عُنُقِي خَيْطًا فَقَالَ: مَا هَذَا؟ فَقُلْتُ: خَيْطٌ رُقِيَ لِي فِيهِ قَالَتْ: فَأَخَذَهُ فَقَطَعَهُ ثُمَّ قَالَ: أَنْتُمْ آلَ عَبْدَ اللَّهِ لَأَغْنِيَاءٌ عَنِ الشِّرْكِ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُول: «إِنَّ الرُّقَى وَالتَّمَائِمَ وَالتِّوَلَةَ شِرْكٌ» فَقُلْتُ: لِمَ تَقُولُ هَكَذَا؟ لَقَدْ كَانَتْ عَيْنِي تُقْذَفُ وَكُنْتُ أَخْتَلِفُ إِلَى فُلَانٍ الْيَهُودِيِّ فَإِذَا رَقَاهَا سَكَنَتْ فَقَالَ عَبْدُ اللَّهِ: إِنَّمَا ذَلِكِ عَمَلُ الشَّيْطَانِ كَانَ يَنْخَسُهَا بِيَدِهِ فَإِذَا رُقِيَ كُفَّ عَنْهَا إِنَّمَا كَانَ يَكْفِيكِ أَنْ تَقُولِي كَمَا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «أَذْهِبِ الْبَاسَ رَبَّ النَّاسِ وَاشْفِ أَنْتَ الشَّافِي لَا شِفَاءَ إِلَّا شِفَاؤُكَ شِفَاءٌ لَا يُغَادِرُ سقما» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Zainab the wife of ‘Abdallah b. Mas'ud told that ‘Abdallah saw a thread on her neck and asked what it was. When she told him that it was a thread over which a spell had been recited for her he took it, cut it up and said, “You, family of ‘Abdallah, are independent of polytheism. I have heard God’s messenger say that spells, charms and love-spells are polytheism.” \nShe replied, “Why do you speak like this? My eye was discharging and I kept going to so and so, the Jew, and when he applied a spell to it it calmed down.” \n‘Abdallah said, “That was just the work of the devil who was pricking it with his hand, and when a spell was uttered he desisted. All you need to do is to say as God’s messenger did, ‘Remove the harm, O Lord of men, and heal. Thou art the Healer. There is no remedy but Thine which leaves no disease behind.” \n\nAbu Dawud transmitted it."}},{"id":40,"idInBook":40,"chapterId":23,"bookId":14,"arabic":"وَعَن جَابر قَالَ: سُئِلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ النُّشْرَةِ فَقَالَ: «هُوَ مِنْ عَمَلِ الشَّيْطَانِ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Jabir told that when the Prophet was asked about a charm for one who is possessed (nushra)* he replied, \n“It pertains to the work of the devil.” \n\nAbu Dawud transmitted it.\n\n* Nushra comes from a root meaning to disperse and is said to be used meaning a charm for one who is possessed because it disperses the trouble."}},{"id":41,"idInBook":41,"chapterId":23,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَا أُبَالِي مَا أَتَيْتُ إِنْ أَنَا شَرِبْتُ تِرْيَاقًا أَوْ تَعَلَّقْتُ تَمِيمَةً أَوْ قُلْتُ الشِّعْرَ مِنْ قِبَلِ نَفْسِي» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"‘Abdallah b. ‘Umar told that he heard God’s messenger say:","text":"“If I drink an antidote, or tie on an amulet, or compose poetry, I am the type who does not care what he does.”*\n\nAbu Dawud transmitted it.\n\n* Meaning that one who does any such thing is an abandoned character."}},{"id":42,"idInBook":42,"chapterId":23,"bookId":14,"arabic":"وَعَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ قَالَ: قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ اكْتَوَى أَوِ اسْتَرْقَى فَقَدْ بَرِئَ مِنَ التَّوَكُّلِ» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيّ وَابْن مَاجَه","english":{"narrator":"Al-Mughira b. Shu'ba reported the Prophet as saying:","text":"“He who has himself cauterized or uses a spell has exempted himself from trust in God.” \n\nAhmad, Tirmidhi and Ibn Majah transmitted it."}},{"id":43,"idInBook":43,"chapterId":23,"bookId":14,"arabic":"وَعَنْ عِيسَى بْنِ حَمْزَةَ قَالَ: دَخَلْتُ عَلَى عبدِ الله بن عُكيم وَبِهِ حُمْرَةٌ فَقُلْتُ: أَلَا تُعَلِّقُ تَمِيمَةً؟ فَقَالَ: نَعُوذُ بِاللَّهِ مِنْ ذَلِكَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ تَعَلَّقَ شَيْئًا وُكِلَ إِليهِ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"‘Isa b. Hamza told that he went to visit ‘Abdallah b. ‘Ukaim* who was suffering from erysipelas and asked why he did not attach an amulet. He replied, “We seek refuge in God from that. God’s messenger said that if anyone hangs anything on himself he will be left to it.”**\n\nAbu Dawud transmitted it.\n\n* Mirqat, iv, 510 wrongly gives Hukaim. Cf. Tahdhib, v, 323 f.\n** If anyone puts his trust in a charm instead of seeking God’s help His help will be withheld from him."}},{"id":44,"idInBook":44,"chapterId":23,"bookId":14,"arabic":"وَعَن عِمْرَانَ بْنِ حُصَيْنٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا رُقْيَةَ إِلَّا مِنْ عَيْنٍ أَوْ حُمَةٍ» . رَوَاهُ أَحْمد وَالتِّرْمِذِيّ وَأَبُو دَاوُد\nوَرَوَاهُ ابْن مَاجَه عَن بُرَيْدَة","english":{"narrator":"‘Imran b. Husain reported God’s messenger as saying:","text":"“No spell is to be used except for the evil eye or a scorpion sting.” \n\nAhmad, Tirmidhi and Abu Dawud transmitted it, and Ibn Majah transmitted it on the authority of Buraida."}},{"id":45,"idInBook":45,"chapterId":23,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا رُقْيَةَ إِلَّا مِنْ عَيْنٍ أَوْ حُمَةٍ أَوْ دَمٍ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"Anas reported God’s messenger as saying:","text":"“No spell is to be used except for the evil eye, or a scorpion sting, or bleeding.”*\n\nAbu Dawud transmitted it.\n\n* The text has dam (blood), but it is said that nose-bleeding in particular is what is meant here. Cf. Mirqat, iv, 5U."}},{"id":46,"idInBook":46,"chapterId":23,"bookId":14,"arabic":"وَعَن أَسمَاء بنت عُميس قَالَتْ: يَا رَسُولَ اللَّهِ إِنَّ وَلَدَ جَعْفَرٍ تُسْرِعُ إِلَيْهِمُ الْعَيْنُ أَفَأَسْتَرْقِي لَهُمْ؟ قَالَ: «نَعَمْ فَإِنَّهُ لَوْ كَانَ شَيْءٌ سَابِقُ الْقَدَرِ لَسَبَقَتْهُ العينُ» . رَوَاهُ أَحْمد وَالتِّرْمِذِيّ وَابْن مَاجَه","english":{"narrator":"","text":"Asma’ daughter of ‘Umais said, “Messenger of Go'd, Ja’far’s children are readily susceptible to the influence of the evil eye, so may I use a spell for them?” He replied, “Yes, for if anything could get ahead of the decree the evil eye could.” \n\nAhmad, Tirmidhi and Ibn Majah transmitted it."}},{"id":47,"idInBook":47,"chapterId":23,"bookId":14,"arabic":"وَعَن الشَّفاءِ بنت عبد الله قَالَتْ: دَخَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا عِنْدَ حَفْصَةَ فَقَالَ: «أَلَا تُعَلِّمِينَ هَذِهِ رُقْيَةَ النَّمْلَةِ كَمَا عَلَّمْتِيهَا الْكِتَابَةَ؟» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"Ash-Shifa’ daughter of ‘Abdallah told that when she was with Hafsa God’s messenger entered and said:","text":"“Why do you not teach this one the spell for skin eruptions as you taught her writing?” \n\nAbu Dawud transmitted it."}},{"id":48,"idInBook":48,"chapterId":23,"bookId":14,"arabic":"وَعَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ قَالَ: رَأَى عَامِرُ بْنُ رَبِيعَةَ سَهْلَ بْنَ حُنَيْفٍ يَغْتَسِلُ فَقَالَ: وَاللَّهِ مَا رَأَيْتُ كَالْيَوْمِ وَلَا جِلْدَ مُخَبَّأَةٍ قَالَ: فَلُبِطَ سَهْلٌ فَأَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقِيلَ لَهُ: يَا رَسُولَ اللَّهِ هَلْ لَكَ فِي سَهْلِ بْنِ حُنَيْفٍ؟ وَاللَّهِ مَا يَرْفَعُ رَأْسَهُ فَقَالَ: «هَلْ تَتَّهِمُونَ لَهُ أَحَدًا؟» فَقَالُوا: نَتَّهِمُ عَامِرَ بْنَ رَبِيعَةَ قَالَ: فَدَعَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامِرًا فَتُغُلِّظَ عَلَيْهِ وَقَالَ: «عَلَامَ يَقْتُلُ أَحَدُكُمْ أَخَاهُ؟ أَلَا بَرَّكْتَ؟ اغْتَسِلْ لَهُ» . فَغَسَلَ لَهُ عَامِرٌ وَجْهَهُ وَيَدَيْهِ وَمِرْفَقَيْهِ وَرُكْبَتَيْهِ وَأَطْرَافَ رِجْلَيْهِ وَدَاخِلَةَ إِزَارِهِ فِي قَدَحٍ ثُمَّ صُبَّ عَلَيْهِ فَرَاحَ مَعَ النَّاسِ لَيْسَ لَهُ بَأْس. رَوَاهُ فِي شَرْحِ السُّنَّةِ وَرَوَاهُ مَالِكٌ وَفِي رِوَايَتِهِ: قَالَ: «إِن الْعين حق تَوَضَّأ لَهُ»","english":{"narrator":"","text":"Abu Umama b. Sahl b. Hunaif told that ‘Amir b. Rabi'a saw Sahl b. Hunaif bathing and said, “I swear by God that I have seen no skin to compare with what I have seen to-day, not even that of a secluded girl.” \nSahl fell to the ground and people went to God’s messenger and said to him, “Messenger of God, can you do anything for Sahl b. Hunaif? We swear by God that he cannot raise his head ” \nHe asked if they suspected anyone, and when they replied that they suspected ‘Amir b. Rabl‘a.\nGod’s messenger summoned ‘Amir, and speaking roughly to him, said, “Why does one of you kill his brother? Why did you not invoke a blessing? Bathe on his behalf ” \n‘Amir then washed on his behalf his face, hands, elbows, knees and toes, and inside his lower garment, collected the water in a vessel and poured it over him, so he recovered and went away with the people none the worse.*\n\nIt is transmitted in Sharh as-sunna. \nMalik transmitted it, and in his version he said, “The evil eye is real. Perform ablution for him.” He therefore did so.\n\n* The trouble was due to the words of praise which were not qualified by any reference to what God might will, and accordingly attributed to the evil eye."}},{"id":49,"idInBook":49,"chapterId":23,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَعَوَّذُ مِنَ الْجَانِّ وَعَيْنِ الْإِنْسَانِ حَتَّى نَزَلَتِ الْمُعَوِّذَتَانِ فَلَمَّا نزلت أَخذ بهما وَترك سِوَاهُمَا. رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيث حسن غَرِيب","english":{"narrator":"","text":"Abu Sa'id al-Khudri told that God’s messenger used to seek refuge in God from jinn and the evil eye in men till the Mu’awwidhatan* came down, after which he made use of them and abandoned everything else. \n\nTirmidhi and Ibn Majah transmitted it, Tirmidhi saying this is a hasan gharib tradition.\n\n* Qur’an, 113 & 114."}},{"id":50,"idInBook":50,"chapterId":23,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ قَالَتْ: قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «هَلْ رُئِيَ فِيكُمُ الْمُغَرِّبُونَ؟» قُلْتُ: وَمَا الْمُغَرِّبُونَ؟ قَالَ: «الَّذِينَ يَشْتَرِكُ فِيهِمُ الْجِنُّ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"‘A'isha told that God’s messenger asked her, “Have the mugharribun been seen among you?”\nShe asked what that meant and he replied, “They are those in whom is a strain of the jinn.”* \n\nAbu Dawud transmitted it.\n\n* Mirqat, iv, 514, says this happens if a man neglects to mention God when he has sexual intercourse with his wife."}},{"id":51,"idInBook":51,"chapterId":23,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْمَعِدَةُ حَوْضُ الْبَدَنِ وَالْعُرُوقُ إِلَيْهَا وَارِدَةٌ فَإِذَا صَحَّتِ الْمَعِدَةُ صَدَرَتِ الْعُرُوقُ بِالصِّحَّةِ وَإِذَا فَسَدَتِ الْمَعِدَةُ صَدَرَتِ الْعُرُوقُ بِالسقمِ»","english":{"narrator":"Abu Huraira reported God’s messenger as saying:","text":"“The stomach is the tank of the body and the veins go down to it. When the stomach is healthy the veins come back in a healthy condition, but when it is in a bad condition they return diseased.”"}},{"id":52,"idInBook":52,"chapterId":23,"bookId":14,"arabic":"وَعَن عَليّ قَالَ: بَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ لَيْلَةٍ يُصَلِّي فَوَضَعَ يَدَهُ عَلَى الْأَرْضِ فَلَدَغَتْهُ عَقْرَبٌ فَنَاوَلَهَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِنَعْلِهِ فَقَتَلَهَا فَلَمَّا انْصَرَفَ قَالَ: «لَعَنَ اللَّهُ الْعَقْرَبَ مَا تَدَعُ مُصَلِّيًا وَلَا غَيْرَهُ أَوْ نَبِيًّا وَغَيْرَهُ» ثُمَّ دَعَا بملحٍ وماءٍ فَجعله فِي إِناءٍ ثمَّ جَعَلَ يَصُبُّهُ عَلَى أُصْبُعِهِ حَيْثُ لَدَغَتْهُ وَيَمْسَحُهَا وَيُعَوِّذُهَا بِالْمُعَوِّذَتَيْنِ. رَوَاهُمَا الْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَانِ","english":{"narrator":"‘Ali said:","text":"When God’s messenger was praying one night he placed his hand on the ground and was stung by a scorpion, so he struck it with his sandal and killed it. Then when he departed he said:\n“God curse the scorpion! It does not leave alone one who is praying or anyone else, or a prophet or anyone else.” \nHe then called for salt and water, and putting it in a vessel he began to pour it over his finger where it had stung him and wipe it, seeking refuge in God by reciting the Mu’awwidhatan. \n\nBaihaqi transmitted the two traditions in Shu’ab al-iman."}},{"id":53,"idInBook":53,"chapterId":23,"bookId":14,"arabic":"وَعَن عُثْمَانَ بْنِ عَبْدِ اللَّهِ بْنِ مَوْهَبٍ قَالَ: أَرْسَلَنِي أَهْلِي إِلَى أُمِّ سَلَمَةَ بِقَدَحٍ مِنْ مَاءٍ وَكَانَ إِذَا أَصَابَ الْإِنْسَانَ عَيْنٌ أَوْ شَيْءٌ بَعَثَ إِلَيْهَا مِخْضَبَهُ فَأَخْرَجَتْ مِنْ شَعْرُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَانَتْ تُمْسِكُهُ فِي جُلْجُلٍ مِنْ فِضَّةٍ فَخَضْخَضَتْهُ لَهُ فَشَرِبَ مِنْهُ قَالَ: فَاطَّلَعْتُ فِي الْجُلْجُلِ فَرَأَيْت شَعرَات حَمْرَاء. رَوَاهُ البُخَارِيّ","english":{"narrator":"‘Uthman b. ‘Abdallah b. Mauhib said:","text":"My people sent me to Umm Salama with a bowl of water. Whenever anyone was smitten by the evil eye or anything else he sent her a basin, and she took out some hairs of God’s messenger which she kept in a little silver bell.* She moved it about for him in the water and he drank some of it. I looked into the little bell and saw some red hairs. \n\nBukhari transmitted it.\n\n* Mirqat, iv, 515, says that although the word means a bell, it may here be used of a small box in the shape of a bell. This is the kind of bell that would be used on a tambourine."}},{"id":54,"idInBook":54,"chapterId":23,"bookId":14,"arabic":"وَعَن أبي هريرةَ إِنَّ نَاسًا مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالُوا لرسولِ الله: الْكَمْأَةُ جُدَرِيُّ الْأَرْضِ؟ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْكَمْأَةُ مِنَ الْمَنِّ وَمَاؤُهَا شِفَاءٌ لِلْعَيْنِ وَالْعَجْوَةُ مِنَ الْجَنَّةِ وَهِيَ شِفَاءٌ مِنَ السُّمِّ» . قَالَ أَبُو هُرَيْرَةَ: فَأَخَذْتُ ثَلَاثَةَ أَكْمُؤٍ أَوْ خَمْسًا أَوْ سَبْعًا فَعَصَرْتُهُنَّ وَجَعَلْتُ مَاءَهُنَّ فِي قَارُورَةٍ وَكَحَّلْتُ بِهِ جَارِيَةً لِي عَمْشَاءَ فَبَرَأَتْ. رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ حسن","english":{"narrator":"Abu Huraira told that when some of the companions of God's messenger remarked to him that truffles are the smallpox of the earth he replied:","text":"“Truffles are a kind of manna, and their juice is a remedy for the evil eye. The 'ajwa dates come from paradise, and they are a remedy for poison.” \nAbu Huraira said that he took three, five, or seven truffles, pressed them, put their juice in a bottle and applied it as an eye-lotion to a slavegirl of his who was blear-eyed, and she recovered. \n\nTirmidhi transmitted it, saying this is a hasan tradition."}},{"id":55,"idInBook":55,"chapterId":23,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ لَعِقَ الْعَسَلَ ثَلَاثَ غَدَوَاتٍ فِي كلِّ شهر لم يصبهُ عَظِيم الْبلَاء»","english":{"narrator":"He reported God’s messenger as saying:","text":"“If anyone licks honey three mornings every month, he will not be afflicted with any serious trouble.”"}},{"id":56,"idInBook":56,"chapterId":23,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" عَلَيْكُمْ بِالشِّفَاءَيْنِ: الْعَسَلِ وَالْقُرْآنِ \". رَوَاهُمَا ابْنُ مَاجَهْ وَالْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَانِ وَقَالَ: وَالصَّحِيحُ أَنَّ الْأَخِيرَ مَوْقُوفٌ عَلَى ابْنِ مَسْعُودٍ","english":{"narrator":"'Abdallah b. Mas'ud reported God’s messenger as saying:","text":"“Make use of the two remedies: honey and the Qur’an.” \n\nIbn Majah and Baihaqi, in Shu'ab al-lman, transmitted the two traditions, Baihaqi saying the correct view is that the second goes no farther back than Ibn Mas'ud."}},{"id":57,"idInBook":57,"chapterId":23,"bookId":14,"arabic":"وَعَن أبي كَبْشَة الْأَنْمَارِيِّ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ احْتَجَمَ عَلَى هَامَتِهِ مِنَ الشَّاةِ الْمَسْمُومَةِ قَالَ مَعْمَرٌ: فَاحْتَجَمْتُ أَنَا مِنْ غَيْرِ سُمٍّ كَذَلِكَ فِي يَافُوخِي فَذَهَبَ حُسْنُ الْحِفْظِ عَنِّي حَتَّى كُنْتُ أُلَقَّنُ فَاتِحَةَ الْكِتَابِ فِي الصَّلَاةِ. رَوَاهُ رزين","english":{"narrator":"Abu Kabsha al-Anmari told that God’s messenger had himself cupped on the top of his head because of the poisoned sheep.* Ma'mar said:","text":"I had myself cupped like that in the middle of my head for a reason other than poison and suffered some loss of memory till I was recommended to use Fatihat al-Kitab in the prayer. \n\nRazin transmitted it.\n\n* An attempt was made to poison the Prophet after the conquest of Khaibar in 7 A.H., but when he had taken a mouthful of the poisoned meat he spat it out realizing that it was poisoned."}},{"id":58,"idInBook":58,"chapterId":23,"bookId":14,"arabic":"وَعَن نافعٍ قَالَ: قَالَ ابنُ عمر: يَا نَافِع يَنْبغ بِي الدَّمُ فَأْتِنِي بِحَجَّامٍ وَاجْعَلْهُ شَابًّا وَلَا تَجْعَلهُ شَيخا وَلَا صَبيا. وَقَالَ ابْنِ عُمَرُ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «الْحِجَامَةُ عَلَى الرِّيقِ أَمْثَلُ وَهِيَ تُزِيدُ فِي الْعَقْلِ وَتُزِيدُ فِي الْحِفْظِ وَتُزِيدُ الْحَافِظَ حِفْظًا فَمَنْ كَانَ مُحْتَجِمًا فَيَوْمَ الْخَمِيسِ عَلَى اسْمِ اللَّهِ تَعَالَى وَاجْتَنِبُوا الْحِجَامَةَ يَوْمَ الْجُمُعَةِ وَيَوْمَ السَّبْتِ وَيَوْمَ الْأَحَدِ فَاحْتَجِمُوا يَوْمَ الِاثْنَيْنِ وَيَوْمَ الثُّلَاثَاءِ وَاجْتَنِبُوا الْحِجَامَةَ يَوْمَ الْأَرْبِعَاءِ فَإِنَّهُ الْيَوْمُ الَّذِي أُصِيبَ بِهِ أَيُّوبُ فِي الْبَلَاءِ. وَمَا يَبْدُو جُذَامٌ وَلَا بَرَصٌ إِلَّا فِي يَوْمِ الْأَرْبِعَاءِ أَوْ لَيْلَةِ الأربعاءِ» . رَوَاهُ ابنُ مَاجَه","english":{"narrator":"Nafi' said Ibn ‘Umar told him he was suffering from blood pressure and asked him to bring him a cupper, telling him to be sure to bring a young man and see that he brought neither an old man nor a boy. And Ibn ‘Umar said he had heard God’s messenger say:","text":"“Cupping before food is best; it increases the intelligence, increases the memory and increases the memory of one who has a good memory. He who has himself cupped should choose Thursday, doing it in the name of God most high; but avoid cupping on Friday, Saturday and Sunday. Get yourselves cupped on Monday and Tuesday, but avoid cupping on Wednesday for it is the day when Job was smitten with affliction. Tubercular leprosy and leprosy make their appearance only on Wednesday or Tuesday night.” \n\nIbn Majah transmitted it."}},{"id":59,"idInBook":59,"chapterId":23,"bookId":14,"arabic":"وَعَنْ مَعْقِلِ بْنِ يَسَارٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْحِجَامَةُ يَوْمُ الثُّلَاثَاءِ لِسَبْعَ عَشْرَةَ مِنَ الشَّهْرِ دَوَاءٌ لِدَاءِ السَّنَةِ» . رَوَاهُ حَرْبُ بْنُ إِسْمَاعِيلَ الْكِرْمَانِيُّ صَاحِبُ أَحْمَدَ وَلَيْسَ إِسْنَادُهُ بِذَاكَ هَكَذَا فِي الْمُنْتَقى\nوروى رزين نَحوه عَن أبي هُرَيْرَة","english":{"narrator":"Ma'qil b. Yasar reported God’s messenger as saying:","text":"“Cupping on Tuesday the 17th of the month is a cure for a year’s illness.” \n\nHarb b. Isma'il al-Kirmani, Ahmad’s companion, transmitted it, but his isnad is worthless. Thus it is stated in al-Muntaqa. \nRazin transmitted something to the same effect on the authority of Abu Huraira."}},{"id":60,"idInBook":60,"chapterId":23,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَا طِيَرَةَ وَخَيْرُهَا الْفَأْلُ» قَالُوا: وَمَا الْفَأْلُ؟ قَالَ: «الْكَلِمَةُ الصَّالِحَة يسْمعهَا أحدكُم»","english":{"narrator":"","text":"Abu Huraira told of hearing God's messenger say, “There should be no taking of omens, but the best type is the good omen.\" \nHe was asked what a good omen was and replied, “A good word which one of you hears.\" \n\n(Bukhari and Muslim.)"}},{"id":61,"idInBook":61,"chapterId":23,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا عَدْوَى وَلَا طِيَرَةَ وَلَا هَامة وَلَا صقر وفر الْمَجْذُومِ كَمَا تَفِرُّ مِنَ الْأَسَدِ» . رَوَاهُ الْبُخَارِيُّ","english":{"narrator":"","text":"He reported God's messenger as saying, “There is no infection, no evil omen, no hama*, and no serpent in a hungry belly*; but flee from one who has tubercular leprosy as you would from a lion.\" \n\nBukhari transmitted it.\n\n* The word means an owl, or a night-bird which frequents graves. The pre-Islamic Arabs believed that when vengeance had not been taken for one who had been killed a bird called hama came forth from the dead and screeched demanding vengeance.\n** The word is safar. The pre-Islaraic Arabs used the word as meaning a serpent which bites a man from within when he is hungry and causes the sense of stinging a man feels when hungry. It was also used of a serpent within the belly which was believed to cause a disease more contagious than mange or scab."}},{"id":62,"idInBook":62,"chapterId":23,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا عَدْوَى وَلَا هَامَةَ وَلَا صفر» . فَقَالَ أَعْرَابِي: يَا رَسُول فَمَا بَالُ الْإِبِلِ تَكُونُ فِي الرَّمْلِ لَكَأَنَّهَا الظباء فيخالها الْبَعِير الأجرب فيجر بِهَا؟ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «فَمن أعدى الأول» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"He reported God's messenger as saying, “There is no infection, no hama, and no serpent in a hungry belly.\" \nA nomadic Arab asked, “Messenger of God, how is it that when camels are in the sand as if they were gazelles* and a mangy camel comes among them it gives them mange?\" \nGod’s messenger replied, “Who infected the first one?\" \n\nBukhari transmitted it.\n\n* The comparison is used to indicate the clearness of their skin."}},{"id":63,"idInBook":63,"chapterId":23,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا عَدْوَى وَلَا هَامَةَ وَلَا نَوْءَ وَلَا صفر» . رَوَاهُ مُسلم","english":{"narrator":"He reported God’s messenger as saying:","text":"“There is no infection, no hama, no star promising rain, and no serpent in a hungry belly.\" \n\nMuslim transmitted it."}},{"id":64,"idInBook":64,"chapterId":23,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَا عَدْوَى وَلَا صَفَرَ وَلَا غُولَ» . رَوَاهُ مُسلم","english":{"narrator":"Jabir told that he heard the Prophet say:","text":"“There is no infection, no serpent in a hungry belly, and no ghoul.”* \n\nMuslim transmitted it.\n\n* I have used the English word derived from the Arabic ghul. It was used of a creature which was a type of jinni or devil which was believed to appear to people in various forms and lead them astray in the desert and cause their destruction."}},{"id":65,"idInBook":65,"chapterId":23,"bookId":14,"arabic":"وَعَنْ عَمْرِو بْنِ الشَّرِيدِ عَنْ أَبِيهِ قَالَ: كَانَ فِي وَفْدِ ثَقِيفٍ رَجُلٌ مَجْذُومٌ فَأَرْسَلَ إِلَيْهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّا قد بايعناك فَارْجِع» . رَوَاهُ مُسلم","english":{"narrator":"‘Amr b. ash-Sharid told on his father’s authority that there was a man with tubercular leprosy in the deputation of Thaqif and the Prophet sent to him a message:","text":"\"We have taken your oath of allegiance, so go home.\" \n\nMuslim transmitted it."}},{"id":66,"idInBook":66,"chapterId":23,"bookId":14,"arabic":"عَنِ ابْنِ عَبَّاسٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَفَاءَلُ وَلَا يَتَطَيَّرُ وَكَانَ يُحِبُّ الِاسْمَ الْحَسَنَ. رَوَاهُ فِي شَرْحِ السّنة","english":{"narrator":"","text":"Ibn ‘Abbas told that God’s messenger took good omens but not evil ones, and that he liked a pleasing name. \n\nIt is transmitted in Sharh as-sunna."}},{"id":67,"idInBook":67,"chapterId":23,"bookId":14,"arabic":"وَعَن قَطن بن قَبيصةَ عَنْ أَبِيهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْعِيَافَةُ وَالطَّرْقُ وَالطِّيَرَةُ مِنَ الْجِبْتِ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"Qatan b. Qabisa told on his father’s authority that the Prophet said:","text":"\"Augury from the flight of birds, the practice of pessomancy,* and taking evil omens pertain to divination.\"**\n\nAbu Dawud transmitted it.\n\n* Tarq. It is used of the practice of divinantion in which women threw stones. It is also used of geomancy by drawing lines.\n** Min al-jibt. Jibt means devil and also divination. An alternative translation would be that these practices come from the devil."}},{"id":68,"idInBook":68,"chapterId":23,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الطِّيَرَةُ شِرْكٌ» قَالَهُ ثَلَاثًا وَمَا مِنَّا إِلَّا وَلَكِنَّ اللَّهَ يُذْهِبُهُ بِالتَّوَكُّلِ. رَوَاهُ أَبُو دَاوُدَ وَالتِّرْمِذِيُّ وَقَالَ: سَمِعْتُ مُحَمَّدَ بْنَ إِسْمَاعِيلَ يَقُولُ: كَانَ سُلَيْمَانُ بْنُ حَرْبٍ يَقُولُ فِي هَذَا الْحَدِيثِ: «وَمَا مِنَّا إِلَّا وَلَكِنَّ اللَّهَ يُذْهِبُهُ بِالتَّوَكُّلِ» . هَذَا عِنْدِي قَوْلُ ابْنِ مَسْعُودٍ","english":{"narrator":"‘Abdallah b. Mas'ud reported God’s messenger as saying:","text":"\"Taking evil omens is polytheism (saying it three times). None of us fails to be affected by it, but God removes such influence by trust in Him.\" \n\nAbu Dawud and Tirmidhi transmitted it. \n\nTirmidhi told that he heard Muhammad b. Isma'il* say that Sulaiman b. Harb used to say about this tradition that in his opinion \"None of us fails to be affected by it, but God removes such influence by trust in Him\" are Ibn Mas'ud’s words.\n\n* i.e. Bukhari."}},{"id":69,"idInBook":69,"chapterId":23,"bookId":14,"arabic":"وَعَنْ جَابِرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخَذَ بِيَدِ مَجْذُومٍ فَوَضَعَهَا مَعَهُ فِي الْقَصْعَةِ وَقَالَ: «كُلْ ثِقَةً بِاللَّهِ وَتَوَكُّلًا عَلَيْهِ» . رَوَاهُ ابْن مَاجَه","english":{"narrator":"Jabir told that God’s messenger took a man who was suffering from tubercular leprosy by the hand, and putting it along with his own in the dish said:","text":"\"Eat with confidence in God and trust in Him.\" \n\nIbn Majah transmitted it."}},{"id":70,"idInBook":70,"chapterId":23,"bookId":14,"arabic":"وَعَن سعدِ بْنِ مَالِكٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا هَامَةَ وَلَا عَدْوَى وَلَا طِيَرَةَ وَإِنْ تَكُنِ الطِّيَرَةُ فِي شَيْءٍ فَفِي الدَّارِ وَالْفرس وَالْمَرْأَة» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"Sa'd b. Malik reported God’s messenger as saying:","text":"\"There is no hama, no infection and no evil omen; but if anything is affected by an evil omen it is a house, a horse, and a woman.\" \n\nAbu Dawud transmitted it."}},{"id":71,"idInBook":71,"chapterId":23,"bookId":14,"arabic":"وَعَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُعْجِبُهُ إِذَا خَرَجَ لِحَاجَةٍ أَنْ يَسْمَعَ: يَا رَاشِدُ يَا نَجِيحُ. رَوَاهُ التِّرْمِذِيُّ","english":{"narrator":"","text":"Anas told that when the Prophet went out to attend to some business he was delighted to hear someone say, “O rightly guided one! O successful one!” \n\nTirmidhi transmitted it."}},{"id":72,"idInBook":72,"chapterId":23,"bookId":14,"arabic":"وَعَنْ بُرَيْدَةَ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ لَا يَتَطَيَّرُ مِنْ شَيْءٍ فَإِذَا بَعَثَ عَامِلًا سَأَلَ عَنِ اسْمِهِ فَإِذَا أَعْجَبَهُ اسْمه فَرح بِهِ ورئي بشر ذَلِك على وَجْهِهِ وَإِنْ كَرِهَ اسْمَهُ رُئِيَ كَرَاهِيَةُ ذَلِكَ على وَجْهِهِ وَإِذَا دَخَلَ قَرْيَةً سَأَلَ عَنِ اسْمِهَا فَإِنْ أَعْجَبَهُ اسْمُهَا فَرِحَ بِهِ وَرُئِيَ بِشْرُ ذَلِكَ فِي وَجْهِهِ وَإِنْ كَرِهَ اسْمَهَا رُئِيَ كَرَاهِيَة ذَلِك فِي وَجهه. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Buraida told that the Prophet did not take omens from anything; but when he sent out an agent he asked about his name and if it pleased him he was glad about it and his cheerfulness on that account was visible in his face, but if he disliked his name his displeasure on that account was visible in his face. \nWhen he entered a village he asked about its name and if it pleased him he was glad about it and his cheerfulness on that account was visible in his face, but if he disliked its name his displeasure on that account was visible in his face. \n\nAbu Dawud transmitted it."}},{"id":73,"idInBook":73,"chapterId":23,"bookId":14,"arabic":"وَعَن أنس قَالَ: قَالَ رَجُلٌ: يَا رَسُولَ اللَّهِ إِنَّا كُنَّا فِي دَارٍ كَثُرَ فِيهَا عَدَدُنَا وَأَمْوَالُنَا فَتَحَوَّلْنَا إِلَى دَارٍ قَلَّ فِيهَا عَدَدُنَا وَأَمْوَالُنَا. فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «ذروها ذميمة» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Anas told that a man said, “Messenger of God, we were in an abode in which our numbers and our goods were many and changed to an abode in which our numbers and our goods have become few.” \nHe replied, “Leave it, for it is reprehensible.” \n\nAbu Dawud transmitted it."}},{"id":74,"idInBook":74,"chapterId":23,"bookId":14,"arabic":"وَعَنْ يَحْيَى بْنِ عَبْدِ اللَّهِ بْنِ بَحِيرٍ قَالَ: أَخْبَرَنِي مَنْ سَمِعَ فَرْوَةَ بْنَ مُسَيْكٍ يَقُولُ: قُلْتُ: يَا رَسُولَ اللَّهِ عِنْدَنَا أَرْضٌ يُقَالُ لَهَا أَبْيَنُ وَهِيَ أَرْضُ رِيفِنَا وَمِيرَتِنَا وَإِنَّ وَبَاءَهَا شَدِيدٌ. فَقَالَ: «دَعْهَا عَنْكَ فَإِنَّ من القَرَف التّلف» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Yahya b. ‘Abdallah b. Bahir said he was informed by one who had heard Farwa b. Musaik tell that he said, “Messenger of God, we have land called Abyan* which is the land where we have our fields and grow our crops, but it is very unhealthy.” \nHe replied, “Leave it, for destruction comes from being near disease.” \n\nAbu Dawud transmitted it.\n\n* To the east of Aden some early riders held it was either a place on the rocks of Adea, or a name of Aden itself."}},{"id":75,"idInBook":75,"chapterId":23,"bookId":14,"arabic":"عَن عُرْوَة بن عَامر قَالَ: ذُكِرَتِ الطِّيَرَةُ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: \n\" أَحْسَنُهَا الْفَأْلُ وَلَا تَرُدُّ مُسْلِمًا فَإِذَا رَأَى أَحَدُكُمْ مَا يَكْرَهُ فَلْيَقُلْ: اللَّهُمَّ لَا يَأْتِي بِالْحَسَنَاتِ إِلَّا أَنْتَ وَلَا يَدْفَعُ السَّيِّئَاتِ إِلَّا أَنْتَ وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ \". رَوَاهُ أَبُو دَاوُدَ","english":{"narrator":"","text":"‘Urwa b. ‘Amir told that when taking omens was mentioned in the presence of God’s messenger he replied that the best type was the good omen, adding that a Muslim is not turned back from anything because of an omen. \nHe told them that when any of them saw anything he disliked he should say, “O God, Thou alone bringest good things, Thou alone avertest evil things, and there is no might or power but in God.” \n\nAbu Dawud transmitted it in mursal form."}},{"id":76,"idInBook":76,"chapterId":23,"bookId":14,"arabic":"عَن مُعَاوِيَة بن الحكم قَالَ: قُلْتُ: يَا رَسُولَ اللَّهِ أُمُورًا كُنَّا نَصْنَعُهَا فِي الْجَاهِلِيَّةِ كُنَّا نَأْتِي الْكُهَّانَ قَالَ: «فَلَا تَأْتُوا الْكُهَّانَ» قَالَ: قُلْتُ: كُنَّا نَتَطَيَّرُ قَالَ: «ذَلِكَ شَيْءٌ يَجِدُهُ أَحَدُكُمْ فِي نَفْسِهِ فَلَا يصدَّنَّكم» . قَالَ: قُلْتُ: وَمِنَّا رِجَالٌ يَخُطُّونَ قَالَ: «كَانَ نَبِيٌّ مِنَ الْأَنْبِيَاءِ يَخُطُّ فَمَنْ وَافَقَ خَطَّهُ فَذَاك» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Mu'awiya b. al-Hakam told that he said, “Messenger of God, there were things we used to do in the pre-Islamic period. We used to visit kahins.” He replied, “Do not visit kdhins” \nHe said, “We used to take omens.” He replied, “That is an idea a man has, but it must not turn you aside from your purposes.” \nHe said, “Among us there were men who practised divination by drawing lines on the ground.” He replied, “There was a prophet who drew lines, so if anyone does it in the same way as he did, that is allowable.” \n\nMuslim transmitted it."}},{"id":77,"idInBook":77,"chapterId":23,"bookId":14,"arabic":"وَعَن عَائِشَة قَالَتْ: سَأَلَ أُنَاسٌ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ الْكُهَّانِ فَقَالَ لَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّهُمْ لَيْسُوا بِشَيْءٍ» قَالُوا: يَا رَسُولَ اللَّهِ فَإِنَّهُمْ يُحَدِّثُونَ أَحْيَانًا بِالشَّيْءِ يَكُونُ حَقًّا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «تِلْكَ الْكَلِمَةُ مِنَ الْحَقِّ يَخْطَفُهَا الْجِنِّيُّ فَيَقُرُّهَا فِي أُذُنِ وَلَيِّهِ قَرَّ الدَّجَاجَةِ فَيَخْلِطُونَ فِيهَا أَكْثَرَ مِنْ مِائَةِ كذبة»","english":{"narrator":"","text":"'A’isha told that when God’s messenger was asked by some people about kahins he replied, “They are of no account.” \nThey said, “Messenger of God, they sometimes tell a thing which is true.” \nHe replied, “That is a word pertaining to truth which a jinni snatches and cackles into the ear of his friend as a hen does; then they mix more than a hundred lies with it.” \n\n(Bukhari and Muslim.)"}},{"id":78,"idInBook":78,"chapterId":23,"bookId":14,"arabic":"وَعَنْهَا قَالَتْ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: \" إِنَّ الْمَلَائِكَةَ تَنْزِلُ فِي الْعَنَانِ وَهُوَ السَّحَابُ فَتَذْكُرُ الْأَمْرَ قُضِيَ فِي السَّماءِ فتسترق الشياطينُ السمعَ فَتُوحِيهِ إِلَى الْكُهَّانِ فَيَكْذِبُونَ مَعَهَا مِائَةَ كَذْبَةٍ من عِنْد أنفسهم. رَوَاهُ البُخَارِيّ","english":{"narrator":"She told that she heard God’s messenger say:","text":"“The angels descend in al-’anan, i e. the clouds, and mention a matter which has been decreed in heaven, then the devils listening by stealth and hearing it communicate it to the kahins who tell along with it a hundred lies of their own making.” \n\nBukhari transmitted it."}},{"id":79,"idInBook":79,"chapterId":23,"bookId":14,"arabic":"وعن حفصة قالت : قال رسول الله صلى الله عليه وسلم : \n\" من أتى عرافا فسأله عن شيء لم تقبل صلاة أربعين ليلة \" . رواه مسلم","english":{"narrator":"Hafsa reported God’s messenger as saying:","text":"“If anyone resorts to a diviner (arraf) and asks him about anything prayer will not be accepted from him for forty days.”*\n\nMuslim transmitted it.\n\n* Literally, Nights."}},{"id":80,"idInBook":80,"chapterId":23,"bookId":14,"arabic":"وَعَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ قَالَ: صَلَّى لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الصُّبْحِ بِالْحُدَيْبِيَةِ عَلَى أَثَرِ سَمَاءٍ كَانَتْ مِنَ اللَّيْلِ فَلَمَّا انْصَرَفَ أَقْبَلَ عَلَى النَّاسِ فَقَالَ: «هَلْ تَدْرُونَ مَاذَا قَالَ ربُّكم؟» قَالُوا: الله وَرَسُوله أعلم قَالَ: أَصْبَحَ مِنْ عِبَادِي مُؤْمِنٌ بِي وَكَافِرٌ فَأَمَّا مَنْ قَالَ: مُطِرْنَا بِفَضْلِ اللَّهِ وَرَحْمَتِهِ فَذَلِكَ مُؤْمِنٌ بِي كَافِرٌ بِالْكَوْكَبِ وَأَمَّا مَنْ قَالَ: مُطِرْنَا بِنَوْءِ كَذَا وَكَذَا فَذَلِكَ كَافِرٌ بِي وَمُؤمن بالكوكب \"","english":{"narrator":"Zaid b. Khalid al-Juhani said:","text":"God’s messenger led us in the morning prayer at al-Hudaibiya after rain which had fallen during the night, and when he finished he turned to the people and said, “Do you know what your Lord has said?” \nOn their replying that God and His messsenger knew best he told them that He had said, “This morning there were among my servants one who believes in me and one who disbelieves. The one who said, ‘We have been given rain by God’s grace and mercy' is the one who believes in me and disbelieves in the star, but the one who said, ‘We have been given rain by such and such a rainy star’ is the one who disbelieves in me and believes in the star.” \n\n(Bukhari and Muslim.)"}},{"id":81,"idInBook":81,"chapterId":23,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" مَا أَنْزَلَ اللَّهُ مِنَ السَّمَاءِ مِنْ بَرَكَةٍ إِلَّا أَصْبَحَ فَرِيقٌ مِنَ النَّاسِ بِهَا كَافِرِينَ يُنْزِلُ اللَّهُ الْغَيْثَ فَيَقُولُونَ: بِكَوْكَبِ كَذَا وَكَذَا \". رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “God has not sent down any blessing from heaven without a section of the people disbelieving in it. God sends down the rain but they say it comes by means of such and such a star.” \n\nMuslim transmitted it."}},{"id":82,"idInBook":82,"chapterId":23,"bookId":14,"arabic":"عَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنِ اقْتَبَسَ عِلْمًا مِنَ النُّجُومِ اقْتَبَسَ شُعْبَةً مِنَ السِّحْرِ زَادَ مَا زَادَ» . رَوَاهُ أَحْمَدُ وَأَبُو دَاوُدَ وَابْنُ مَاجَه","english":{"narrator":"Ibn ‘Abbas reported God's messenger as saying:","text":"“If anyone acquires any knowledge of astrology he acquires a branch of magic of which he gets more as long as he continues to do so.” \n\nAhmad, Abu Dawud and Ibn Majah transmitted it."}},{"id":83,"idInBook":83,"chapterId":23,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَتَى كَاهِنًا فَصَدَّقَهُ بِمَا يَقُولُ أَوْ أَتَى امْرَأَتَهُ حَائِضًا أَو أَتَى امْرَأَته من دُبُرِهَا فَقَدْ بَرِئَ مِمَّا أُنْزِلَ عَلَى مُحَمَّدٍ» . رَوَاهُ أَحْمد وَأَبُو دَاوُد","english":{"narrator":"Abu Huraira reported God’s messenger as saying:","text":"“If anyone resorts to a kahin and believes him m what he says, or has intercourse with his wife when she is menstruating, or has intercourse with his wife through her anus, he has nothing to do with what has been sent down to Muhammad.” \n\nAhmad and Abu Dawud transmitted it."}},{"id":84,"idInBook":84,"chapterId":23,"bookId":14,"arabic":"عَن أبي هُرَيْرَة أَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: إِذَا قَضَى اللَّهُ الْأَمْرَ فِي السَّمَاءِ ضَرَبَتِ الْمَلَائِكَةُ بِأَجْنِحَتِهَا خُضْعَانًا لِقَوْلِهِ كَأَنَّهُ سِلْسِلَةٌ عَلَى صَفْوَانٍ فَإِذَا فُزِّعَ عَنْ قُلُوبِهِمْ قَالُوا: مَاذَا قَالَ رَبُّكُمْ؟ قَالُوا: لِلَّذِي قَالَ الْحَقَّ وهوَ العليُّ الكبيرُ فَسَمعَهَا مُسترِقوا السَّمعِ ومُسترقوا السَّمْعِ هَكَذَا بَعْضُهُ فَوْقَ بَعْضٍ «وَوَصَفَ سُفْيَانُ بِكَفِّهِ فَحَرَّفَهَا وَبَدَّدَ بَيْنَ أَصَابِعِهِ» فَيَسْمَعُ الْكَلِمَةَ فَيُلْقِيهَا إِلَى مَنْ تَحْتَهُ ثُمَّ يُلْقِيهَا الْآخَرُ إِلَى مَنْ تَحْتَهُ حَتَّى يُلْقِيَهَا عَلَى لِسَانِ السَّاحِرِ أَوِ الْكَاهِنِ. فَرُبَّمَا أَدْرَكَ الشِّهَابُ قَبْلَ أَنْ يُلْقِيَهَا وَرُبَّمَا أَلْقَاهَا قَبْلَ أَنْ يُدْرِكَهُ فكذب مَعَهَا مِائَةَ كَذْبَةٍ فَيُقَالُ: أَلَيْسَ قَدْ قَالَ لَنَا يَوْمَ كَذَا وَكَذَا: كَذَا وَكَذَا؟ فَيَصْدُقُ بِتِلْكَ الْكَلِمَةِ الَّتِي سُمِعَتْ مِنَ السَّمَاءِ \". رَوَاهُ البُخَارِيّ","english":{"narrator":"Abu Huraira reported the Prophet as saying:","text":"“When God decrees a matter in heaven the angels move their wings in submission to His word which is like a chain on a smooth stone. Then when their hearts are delivered from fear they say, ‘What did your Lord say?’ and receive the reply, ‘That which He said is the truth and He is the Most High and the Most Great.’ Then those who listen by stealth hear it, and they are thus, some above others (Sufyan* illustrating it with the palm of his hand, turning it and separating the fingers). Then one hears the word and passes it on to the one who is below him and the other passes it on to the one who is below him, and so on till one passes it on the tongue of the magician or the kahin. Often a flame catches him before he passes it on,** but often he passes it on before it catches him, and he tells a hundred lies along with it. People ask whether he did not say such and such on such and such a day, and he is believed because of that word which was heard from heaven.\" \n\nBukhari transmitted it.\n\n* i.e, Sufyan b. ‘Uyaina through whom the tradition was transmitted.\n** Cf. Qur’an, 15: 18"}},{"id":85,"idInBook":85,"chapterId":23,"bookId":14,"arabic":"وَعَن ابنِ عبَّاسٍ قَالَ: أَخْبَرَنِي رَجُلٌ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنَ الْأَنْصَارِ: أَنَّهُمْ بَيْنَا جُلُوسٌ لَيْلَةً مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رُمِيَ بِنَجْمٍ وَاسْتَنَارَ فَقَالَ لَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا كُنْتُمْ تَقُولُونَ فِي الْجَاهِلِيَّةِ إِذَا رُمِيَ بِمِثْلِ هَذَا؟» قَالُوا: اللَّهُ وَرَسُولُهُ أَعْلَمُ كُنَّا نَقُولُ: وُلِدَ اللَّيْلَةَ رَجُلٌ عَظِيمٌ وَمَاتَ رَجُلٌ عَظِيمٌ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" فَإِنَّهَا لَا يُرْمَى بِهَا لِمَوْتِ أَحَدٍ وَلَا لِحَيَاتِهِ وَلَكِنَّ رَبَّنَا تَبَارَكَ اسْمُهُ إِذَا قَضَى أَمر سَبَّحَ حَمَلَةُ الْعَرْشِ ثُمَّ سَبَّحَ أَهْلُ السَّمَاءِ الَّذِينَ يَلُونَهُمْ حَتَّى يَبْلُغَ التَّسْبِيحُ أَهْلَ هَذِهِ السَّمَاء الدُّنْيَا ثمَّ قَالَ الَّذِي يَلُونَ حَمَلَةَ الْعَرْشِ لِحَمَلَةِ الْعَرْشِ: مَاذَا قَالَ رَبُّكُمْ؟ فَيُخْبِرُونَهُمْ مَا قَالَ: فَيَسْتَخْبِرُ بَعْضُ أَهْلِ السَّمَاوَاتِ بَعْضًا حَتَّى يَبْلُغَ هَذِهِ السَّمَاءَ الدُّنْيَا فَيَخْطَفُ الْجِنُّ السَّمْعَ فَيَقْذِفُونَ إِلَى أَوْلِيَائِهِمْ وَيُرْمَوْنَ فَمَا جاؤوا بِهِ عَلَى وَجْهِهِ فَهُوَ حَقٌّ وَلَكِنَّهُمْ يَقْرِفُونَ فِيهِ وَيزِيدُونَ \". رَوَاهُ مُسلم","english":{"narrator":"Ibn 'Abbas said:","text":"A man of the Ansar who was a companion of the Prophet told me that while they were sitting one night along with God’s messenger, a star was thrown and shone brightly. He asked them what they used to say in the pre-Islamic period when something of that nature was thrown, and they replied, “God and His messenger know best. We used to say that a great man had been born that night, or that a great man had died.\" \nThen God’s messenger said, “It is not thrown because of anyone’s death or life; but when our Lord whose name is blessed decrees a matter the bearers of the Throne extol Him, then the inhabitants of heaven who are next to them extol Him till the extolling reaches the inhabitants of this lowest heaven. Then those who are near the bearers of the Throne ask them what their Lord has said and they tell them what He said. Then the inhabitants of the heavens ask one another till it reaches this lowest heaven. The jinn then snatch a hearing and pass it on to their friends and have  thrown at them. Now what they bring as it came is true, but they mix things with it and make additions.\" \n\nMuslim transmitted it."}},{"id":86,"idInBook":86,"chapterId":23,"bookId":14,"arabic":"وَعَن قتادةَ قَالَ: خلقَ اللَّهُ تَعَالَى هَذِه النجومَ لثلاثٍ جَعَلَهَا زِينَةً لِلسَّمَاءِ وَرُجُومًا لِلشَّيَاطِينِ وَعَلَامَاتٍ يُهْتَدَى بهَا فَمن تأوَّلَ فِيهَا بِغَيْرِ ذَلِكَ أَخَطَأَ وَأَضَاعَ نَصِيبَهُ وَتَكَلَّفَ مَالا يَعْلَمُ. رَوَاهُ الْبُخَارِيُّ تَعْلِيقًا وَفِي رِوَايَةِ رَزِينٍ: «تكلّف مَالا يعنيه ومالا عِلْمَ لَهُ بِهِ وَمَا عَجَزَ عَنْ عِلْمِهِ الْأَنْبِيَاء وَالْمَلَائِكَة»\nوَعَن الربيعِ مِثْلُهُ وَزَادَ: وَاللَّهِ مَا جَعَلَ اللَّهُ فِي نَجْمٍ حَيَاةَ أَحَدٍ وَلَا رِزْقَهُ وَلَا مَوْتَهُ وَإِنَّمَا يَفْتَرُونَ عَلَى اللَّهِ الْكَذِبَ وَيَتَعَلَّلُونَ بِالنُّجُومِ","english":{"narrator":"","text":"Qatada said God most high created these stars for three purposes; He made them an adornment for the sky, missiles for the devils, and signs by which people find their way. \nIf anyone explains them differently he makes a mistake, squanders what is allotted to him, and occupies himself with something he does not know. \n\nBukhari transmitted it without a full isnad. \nRazln’s version has, “occupies himself with what does not concern him, what he has no knowledge of, and what prophets and angels are incapable of knowing.” \nOn the authority of ar-Rabi’* there is something to the same effect with the addition, “I swear by God that God has not set in a star anyone’s life, provision, or death. They are only speaking lies against God and attributing causes to the stars.”\n\n* Ar-Rabi’ b. Ziyad, Qatada's authority."}},{"id":87,"idInBook":87,"chapterId":23,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنِ اقْتَبَسَ بَابًا مِنْ عِلْمِ النُّجُومِ لِغَيْرِ مَا ذَكَرَ اللَّهُ فَقَدِ اقْتَبَسَ شُعْبَةً مِنَ السِّحْرِ الْمُنَجِّمُ كَاهِنٌ والكاهنُ ساحرٌ والساحرُ كافرٌ» . رَوَاهُ رزين","english":{"narrator":"Ibn ‘Abbas reported God’s messenger as saying:","text":"“If anyone acquires a section of the science of the stars for a purpose other than what God has mentioned he has acquired a branch of magic. The astrologer is a kahin, the kahin is a magician, and the magician is an infidel.” \n\nRazin transmitted it."}},{"id":88,"idInBook":88,"chapterId":23,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" لَوْ أَمْسَكَ اللَّهُ الْقَطْرَ عَنْ عِبَادِهِ خَمْسَ سِنِينَ ثُمَّ أَرْسَلَهُ لَأَصْبَحَتْ طَائِفَةٌ مِنَ النَّاسِ كَافِرِينَ يَقُولُونَ: سُقِينَا بِنَوْءِ الْمِجْدَحِ \". رَوَاهُ النَّسَائِيّ","english":{"narrator":"Abu Sa'id reported God’s messenger as saying:","text":"“If God were to withhold rain from his servants for five years and then send it, a section of mankind would be infidels saying they had been supplied with water through the agency of the rainy star al-Mijdah*.”\n\nNasa’i transmitted it.\n\n* The word comet from a root meaning to stir up, and the plural is used as a general name for stars which are said to stir up rain, the singular used here may refer to the Hyades, but other explanations are also given. As rainy seasons were connected with particular times at which certain stars rose, the rain was attributed to them."}}],"chapter":{"id":23,"bookId":14,"arabic":"كتاب الطب والرقى","english":"Medicine and Spells"}}