{"metadata":{"length":20,"arabic":{"title":"مشكاة المصابيح","author":"الإمام الكاتب التبريزي","introduction":"كتاب الرؤيا"},"english":{"title":"Mishkat al-Masabih","author":"Al-Khatib Al-Tabrizi","introduction":"Visions"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":24,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَمْ يَبْقَ مِنَ النُّبُوَّةِ إِلَّا الْمُبَشِّرَاتُ» قَالُوا: وَمَا الْمُبَشِّرَاتُ؟ قَالَ: «الرُّؤْيَا الصالحةُ» . رَوَاهُ البُخَارِيّ\nوَزَادَ مَالِكٌ بِرِوَايَةِ عَطَاءِ بْنِ يَسَارٍ: «يَرَاهَا الرجل الْمُسلم أَو ترى لَهُ»","english":{"narrator":"Abu Huraira reported God’s messenger as saying:","text":"\"All that is left of prophecy is the mubashshirat.”* \nHe was asked what that meant and said it was a good vision. \n\nBukhari transmitted it.\nMalik added in the version of ‘Ata’ b. Yasar, \"which a Muslim man sees, or which is shown to him.”\n\n* Literally the things which bring news. The news may cause either pleasure or pain."}},{"id":2,"idInBook":2,"chapterId":24,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الرُّؤْيَا الصَّالِحَةُ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ»","english":{"narrator":"Anas reported God’s messenger as saying:","text":"\"A good vision is a forty- sixth part of prophecy.” \n\n(Bukhari and Muslim.)"}},{"id":3,"idInBook":3,"chapterId":24,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم قَالَ: «من رَآنِي فِي الْمَنَامِ فَقَدْ رَآنِي فَإِنَّ الشَّيْطَانَ لَا يَتَمَثَّلُ فِي صُورَتِي»","english":{"narrator":"Abu Huraira reported God’s messenger as saying:","text":"\"He who sees me in a dream has seen me, for the devil does not appear in my form.” \n\n(Bukhari and Muslim.)"}},{"id":4,"idInBook":4,"chapterId":24,"bookId":14,"arabic":"وَعَنْ أَبِي قَتَادَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ رَآنِي فَقَدْ رَأَى الْحَقَّ»","english":{"narrator":"Abu Qatada reported God's messenger as saying:","text":"\"He who sees me has seen what is genuine.” \n\n(Bukhari and Muslim.)"}},{"id":5,"idInBook":5,"chapterId":24,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عَلَيْهِ وَسلم: «من رَآنِي فِي الْمَنَام فيسراني فِي الْيَقَظَةِ وَلَا يَتَمَثَّلُ الشَّيْطَانُ بِي»","english":{"narrator":"Abu Huraira reported God’s messenger as saying:","text":"\"He who sees me in a dream will see me when awake*, for the devil, does not take my likeness.” \n\n(Bukhari and Muslim.)\n\n* This tradition has Caused some difficulty. It is suggested that if it refers to people in the Prophet’s time who have not yet emigrated to Medina, it means that they will emigrate and see the Prophet there; if it refers to people of later times, it means that they will see him in the next world."}},{"id":6,"idInBook":6,"chapterId":24,"bookId":14,"arabic":"وَعَنْ أَبِي قَتَادَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الرُّؤْيَا الصَّالِحَةُ مِنَ اللَّهِ وَالْحُلْمُ مِنَ الشَّيْطَانِ فَإِذَا رَأَى أَحَدُكُمْ مَا يُحِبُّ فَلَا يُحَدِّثُ بِهِ إِلَّا مَنْ يُحِبُّ وَإِذَا رَأَى مَا يَكْرَهُ فَلْيَتَعَوَّذْ بِاللَّهِ مِنْ شَرِّهَا وَمِنْ شَرِّ الشَّيْطَانِ وَلْيَتْفُلْ ثَلَاثًا وَلَا يُحَدِّثْ بِهَا أحدا فَإِنَّهَا لن تضره»","english":{"narrator":"Abu Qatada reported God’s messenger as saying:","text":"\"A good vision comes from God and a dream (hulm) from the devil. So when one of you sees what he likes he must tell it only to one whom he likes; but when he sees What he dislikes he must seek refuge in God from its evil and from the evil of the devil, spit on his left three times, and not tell anyone of it. It will then not harm him.” \n\n(Bukhari and Muslim.)"}},{"id":7,"idInBook":7,"chapterId":24,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا رَأَى أَحَدُكُمُ الرُّؤْيَا يَكْرَهُهَا فَلْيَبْصُقْ عَنْ يَسَارِهِ ثَلَاثًا وَلْيَسْتَعِذْ بِاللَّهِ مِنَ الشَّيْطَانِ ثَلَاثًا وَلْيَتَحَوَّلْ عَنْ جَنْبِهِ الَّذِي كانَ عَلَيْهِ» . رَوَاهُ مُسلم","english":{"narrator":"Jabir reported God’s messenger as saying:","text":"\"When one of you sees a vision which he dislikes he must spit on his left three times, seek refuge in God from the devil three times, and turn from the side on which he was lying.\"\n\nMuslim transmitted it."}},{"id":8,"idInBook":8,"chapterId":24,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا اقْتَرَبَ الزَّمَانُ لَمْ يَكَدْ يَكْذِبُ رُؤْيَا الْمُؤْمِنِ وَرُؤْيَا الْمُؤْمِنِ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ وَمَا كَانَ مِنَ النُّبُوَّةِ فَإِنَّهُ لَا يَكْذِبُ» . قَالَ مُحَمَّدُ بْنُ سِيرِينَ: وَأَنَا أَقُولُ: الرُّؤْيَا ثَلَاثٌ: حَدِيثُ النَّفْسِ وَتَخْوِيفُ الشَّيْطَانِ وَبُشْرَى مِنَ اللَّهِ فَمَنْ رَأَى شَيْئًا يَكْرَهُهُ فَلَا يَقُصَّهُ عَلَى أَحَدٍ وَلْيَقُمْ فَلْيُصَلِّ قَالَ: وَكَانَ يُكْرَهُ الْغُلُّ فِي النَّوْمِ وَيُعْجِبُهُمُ الْقَيْدُ وَيُقَال: الْقَيْد ثبات فِي الدّين\nقَالَ البُخَارِيّ: رَوَاهُ قَتَادَة وَيُونُس وَهِشَام وَأَبُو هِلَالٍ عَنِ ابْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ وَقَالَ يُونُسُ: لَا أَحْسَبُهُ إِلَّا عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْقَيْدِ\nوَقَالَ مُسْلِمٌ: لَا أَدْرِي هُوَ فِي الْحَدِيثِ أَمْ قَالَهُ ابْنُ سِيرِينَ؟ وَفِي رِوَايَةٍ نَحْوُهُ وَأَدْرَجَ فِي الْحَدِيثِ قَوْلَهُ: «وَأَكْرَهُ الْغُلَّ. . .» إِلَى تَمام الْكَلَام","english":{"narrator":"Abu Huraira reported God’s messenger as saying:","text":"‘‘When the time draws near* a believer’s vision can hardly be false. A believer’s vision is a forty-sixth part of prophecy, and what pertains to prophecy cannot be false.\" \nMuhammad b. Sirin said he held that visions were of three types: ideas which come from within, terrifying caused by the devil, and good news from God; so when one sees anything he dislikes he should not tell it to anyone, but should get up and pray. He said he disliked seeing a shackle on the neck in sleep, but that people were pleased by a fetter, as it is said that a fetter indicates being firmly established in the religion. \n\n(Bukhari and Muslim.) \nBukhari said that Qatada, Yunus, Hushaim** and Abu Hilal transmitted it on the authority of Ibn Sirin who quoted Abu Huraira's authority. Yunus said he thought that what was said about the fetter comes from the Prophet, but Muslim said he did not know whether it was in the tradition, or whether Ibn Sirin said it. \nIn a version there is something to the same effect, and the words “he disliked seeing a shackle on the neck ...\" to the end have been inserted in the tradition.\n\n* The suggestions made are that this means when the last hour draws near, at the equinox, or when the Mahdi comes.\n** Bukhari, Ta'bir, 26, has Hisham."}},{"id":9,"idInBook":9,"chapterId":24,"bookId":14,"arabic":"وَعَن جَابر قَالَ: جَاءَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: رَأَيْتُ فِي الْمَنَامِ كَأَنَّ رَأْسِي قُطِعَ قَالَ: فَضَحِكَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ: «إِذَا لَعِبَ الشَّيْطَانُ بِأَحَدِكُمْ فِي مَنَامِهِ فَلَا يُحَدِّثْ بِهِ النَّاس» . رَوَاهُ مُسلم","english":{"narrator":"Jabir told that a man came to the Prophet and said:","text":"“In a dream I seemed to see any head had been cut off.\"  The Prophet laughed and replied:\n“When the devil makes sport of any of you in a dream he should not tell people about it.\" \n\nMuslim transmitted it."}},{"id":10,"idInBook":10,"chapterId":24,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «رَأَيْتُ ذَاتَ لَيْلَةٍ فِيمَا يَرَى النَّائِمُ كَأَنَّا فِي دَارِ عُقْبَةَ بْنِ رَافِعٍ فَأُوتِينَا بِرُطَبٍ مِنْ رُطَبِ ابْنِ طَابٍ فَأَوَّلْتُ أَنَّ الرِّفْعَةَ لَنَا فِي الدُّنْيَا وَالْعَاقِبَةَ فِي الْآخِرَةِ وَأَنَّ دِينَنَا قَدْ طَابَ» . رَوَاهُ مُسلم","english":{"narrator":"Anas reported God’s messenger as saying:","text":"“One night it seemed to me in a dream that I was in the house of ‘Uqba b. Rafi' and was brought some of the fresh dates of Ibn Tab*. I interpreted it as meaning that to us is granted eminence (rif’a) in this world, a blessed hereafter (al- ‘aqiba) in the next, and that our religion has been good (tab).\"** \n\nMuslim transmitted it.\n\t\n* While some suggest that Ibn Tab was a man who lived either in the desert or in Medina who had dates, the correct explanation is more likely that this is the name of a type of Medina dates and not a man’s name.\n** A good omen is taken from the basic meanings of the parts of these names."}},{"id":11,"idInBook":11,"chapterId":24,"bookId":14,"arabic":"وَعَنْ أَبِي مُوسَى عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" رَأَيْتُ فِي الْمَنَامِ أَنِّي أُهَاجِرُ مِنْ مَكَّةَ إِلَى أَرْضٍ بِهَا نَخْلٌ فَذَهَبَ وَهْلِي إِلَى أَنَّهَا الْيَمَامَةُ أَوْ هَجَرُ فَإِذَا هِيَ الْمَدِينَةُ يَثْرِبُ وَرَأَيْتُ فِي رُؤْيَايَ هَذِهِ: أَنِّي هَزَزْتُ سَيْفًا فَانْقَطَعَ صَدْرُهُ فَإِذَا هُوَ مَا أُصِيبَ مِنَ الْمُؤْمِنِينَ يَوْمَ أُحُدٍ ثُمَّ هَزَزْتُهُ أُخْرَى فعادَ أحسنَ مَا كانَ فإِذا هوَ جَاءَ اللَّهُ بِهِ مِنَ الْفَتْحِ وَاجْتِمَاعِ الْمُؤْمِنِينَ \"","english":{"narrator":"Abu Musa reported the Prophet as saying:","text":"“I saw in a dream that I was emigrating from Mecca to a land containing palm-trees and I conjectured that it was to al-Yamama or to Hajar, but it was the city of Yathrib.* In this vision of mine I saw that I brandished a sword and the front part of it was cut off; this represented those believers who were smitten at the battle of Uhud. I brandished it again and it was restored to perfect condition; and this represented the victory and the community of believers which God brought about.”**\n\n(Bukhari and Muslim.)\n\n* The old name of Medina.\n** Probably a reference to the Conquest of Mecca and the numbers who accepted Islam. Cf. Qur'an, 110"}},{"id":12,"idInBook":12,"chapterId":24,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «بَيْنَا أَنَا نَائِمٌ بِخَزَائِنِ الْأَرْضِ فَوُضِعَ فِي كَفَّيَّ سِوَارَانِ مِنْ ذَهَبٍ فَكَبُرَا عَلَيَّ فَأُوحِيَ إِلَيَّ أَنِ انْفُخْهُمَا فَنَفَخْتُهُمَا فَذَهَبَا فَأَوَّلْتُهُمَا الْكَذَّابَيْنِ اللَّذَيْنِ أَنَا بَيْنَهُمَا صَاحِبَ صَنْعَاءَ وَصَاحِبَ الْيَمَامَةِ» . مُتَّفَقٌ عَلَيْهِ. وَفِي رِوَايَةٍ: «يُقَالُ لِأَحَدِهِمَا مُسَيْلِمَةُ صَاحِبُ الْيَمَامَةِ وَالْعَنْسِيُّ صَاحِبُ صَنْعَاءَ» لَمْ أَجِدْ هَذِهِ الرِّوَايَةَ فِي (الصَّحِيحَيْنِ)\nوَذكرهَا صَاحب الْجَامِع عَن التِّرْمِذِيّ","english":{"narrator":"Abu Huraira reported God’s messenger as saying:","text":"“While I was asleep I was brought the treasures of the earth, and two bracelets of gold which were placed in my hands weighed upon me. Then it was revealed to me that I should blow on them, and when I did so they departed. I interpreted them as representing the two liars between whom I am placed, the one in San'a' and the one in al-Yamama.” \n\n(Bukhari and Muslim.) \nA version says that one of them was Musailima,* the man in al-Yamama, and the other al-‘Ansi,** the man in San'a’. I (the translator) have not found this version in the two Sahihs, but the author of the Jami' mentioned it on Tirmidhi’s authority.\n\n* He set himself up as a prophet.\n** Al-Aswad al-'Ansi who attacked al-Muhajir b. Abu Umayya b. Al-Mughira, the Prophet’s agent sent to San'a' to collect sadaqat. He caused a considerable insurrection in the south."}},{"id":13,"idInBook":13,"chapterId":24,"bookId":14,"arabic":"وَعَنْ أُمِّ الْعَلَاءِ الْأَنْصَارِيَّةِ قَالَتْ: رَأَيْتُ لِعُثْمَانَ بْنِ مَظْعُونٍ فِي النَّوْمِ عَيْنًا تَجْرِي فَقَصَصْتُهَا عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «ذَلِكِ عَمَلُهُ يُجْرَى لَهُ» . رَوَاهُ الْبُخَارِيُّ","english":{"narrator":"Umm al-‘Ala’ al-Ansariya said that while she was asleep she saw a spring belonging to 'Uthman b. Maz'un flowing, and when she told God’s messenger he replied:","text":"“That represents his good deeds* which are kept increasing for him.” \n\nBukhari transmitted it.\n\n* ‘Uthman had died after the battle of Badr, but this vision is taken as showing that his good deeds were still increasing. This is said to mean their reward. Cf. Mirqat, iv, 545."}},{"id":14,"idInBook":14,"chapterId":24,"bookId":14,"arabic":"وَعَن سُمرةَ بنِ جُندب قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا صَلَّى أَقْبَلَ عَلَيْنَا بِوَجْهِهِ فَقَالَ: «مَنْ رَأَى مِنْكُمُ اللَّيْلَةَ رُؤْيَا؟» قَالَ: فَإِنْ رَأَى أَحَدٌ قَصَّهَا فَيَقُولُ: مَا شَاءَ اللَّهُ فَسَأَلَنَا يَوْمًا فَقَالَ: «هَلْ رَأَى مِنْكُمْ أَحَدٌ رُؤْيَا؟» قُلْنَا: لَا قَالَ: \" لَكِنِّي رَأَيْتُ اللَّيْلَةَ رَجُلَيْنِ أَتَيَانِي فَأَخَذَا بِيَدَيَّ فَأَخْرَجَانِي إِلَى أَرْضٍ مُقَدَّسَةٍ فَإِذَا رَجُلٌ جَالِسٌ وَرَجُلٌ قَائِمٌ بِيَدِهِ كَلُّوبٌ مِنْ حَدِيدٍ يُدْخِلُهُ فِي شِدْقِهِ فَيَشُقُّهُ حَتَّى يَبْلُغَ قَفَاهُ ثُمَّ يَفْعَلُ بِشِدْقِهِ الْآخَرِ مِثْلَ ذَلِكَ وَيَلْتَئِمُ شِدْقُهُ هَذَا فَيَعُودُ فَيَصْنَعُ مِثْلَهُ. قُلْتُ: مَا هَذَا؟ قَالَا: انْطَلِقْ فَانْطَلَقْنَا حَتَّى أَتَيْنَا عَلَى رَجُلٍ مُضْطَجِعٍ عَلَى قَفَاهُ وَرَجُلٌ قَائِمٌ عَلَى رَأْسِهِ بِفِهْرٍ أَوْ صَخْرَةٍ يَشْدَخُ بِهَا رَأْسَهُ فَإِذَا ضَرَبَهُ تَدَهْدَهَ الْحَجَرُ فَانْطَلَقَ إِلَيْهِ لِيَأْخُذَهُ فَلَا يَرْجِعُ إِلَى هَذَا حَتَّى يَلْتَئِمَ رَأْسُهُ وَعَادَ رَأْسُهُ كَمَا كَانَ فَعَادَ إِلَيْهِ فَضَرَبَهُ فَقُلْتُ: مَا هَذَا؟ قَالَا: انْطَلِقْ فَانْطَلَقْنَا حَتَّى أَتَيْنَا إِلَى ثَقْبٍ مِثْلِ التَّنُّورِ أَعْلَاهُ ضَيِّقٌ وَأَسْفَلَهُ وَاسِعٌ تَتَوَقَّدُ تَحْتَهُ نَارٌ فَإِذَا ارْتَفَعَتِ ارْتَفَعُوا حَتَّى كَادَ أَنْ يَخْرُجُوا مِنْهَا وَإِذَا خَمَدَتْ رَجَعُوا فِيهَا وَفِيهَا رِجَالٌ وَنِسَاءٌ عُرَاةٌ فَقُلْتُ: مَا هَذَا؟ قَالَا: انْطَلِقْ فَانْطَلَقْنَا حَتَّى أَتَيْنَا عَلَى نَهَرٍ مِنْ دَمٍ فِيهِ رَجُلٌ قَائِمٌ عَلَى وَسْطِ النَّهَرِ وَعَلَى شَطِّ النَّهَرِ رَجُلٌ بَيْنَ يَدَيْهِ حِجَارَةٌ فَأَقْبَلَ الرَّجُلُ الَّذِي فِي النَّهَرِ فَإِذَا أَرَادَ أَنْ يَخْرُجَ رَمَى الرَّجُلُ بِحَجَرٍ فِي فِيهِ فَرَدَّهُ حَيْثُ كَانَ فَجَعَلَ كُلَّمَا جَاءَ لِيَخْرُجَ رَمَى فِي فِيهِ بِحَجَرٍ فَيَرْجِعُ كَمَا كَانَ فَقُلْتُ مَا هَذَا؟ قَالَا: انْطَلِقْ فَانْطَلَقْنَا حَتَّى انْتَهَيْنَا إِلَى رَوْضَةٍ خَضْرَاءَ فِيهَا شَجَرَةٌ عَظِيمَةٌ وَفِي أَصْلِهَا شَيْخٌ وَصِبْيَانٌ وَإِذَا رَجُلٌ قَرِيبٌ مِنَ الشجرةِ بَيْنَ يَدَيْهِ نَارٌ يُوقِدُهَا فَصَعِدَا بِيَ الشَّجَرَةَ فأدخلاني دَار أوسطَ الشَّجَرَةِ لَمْ أَرَ قَطُّ أَحْسَنَ مِنْهَا فِيهَا رِجَالٌ شُيُوخٌ وَشَبَابٌ وَنِسَاءٌ وَصِبْيَانٌ ثُمَّ أَخْرَجَانِي مِنْهَا فصعدا بِي الشَّجَرَة فأدخلاني دَار هِيَ أَحْسَنُ وَأَفْضَلُ مِنْهَا فِيهَا شُيُوخٌ وَشَبَابٌ فَقُلْتُ لَهُمَا: إِنَّكُمَا قَدْ طَوَّفْتُمَانِي اللَّيْلَةَ فَأَخْبِرَانِي عَمَّا رَأَيْتُ قَالَا: نَعَمْ أَمَّا الرَّجُلُ الَّذِي رَأَيْتَهُ يُشَقُّ شِدْقُهُ فَكَذَّابٌ يُحَدِّثُ بِالْكَذْبَةِ فَتُحْمَلُ عَنْهُ حَتَّى تَبْلُغَ الْآفَاقَ فَيُصْنَعُ بِهِ مَا تَرَى إِلَى يَوْمِ الْقِيَامَةِ وَالَّذِي رَأَيْتَهُ يُشْدَخُ رَأْسُهُ فَرَجُلٌ عَلَّمَهُ اللَّهُ الْقُرْآنَ فَنَامَ عَنْهُ بِاللَّيْلِ وَلَمْ يَعْمَلْ بِمَا فِيهِ بِالنَّهَارِ يُفْعَلُ بِهِ مَا رَأَيْتَ إِلَى يَوْمِ الْقِيَامَةِ وَالَّذِي رَأَيْتَهُ فِي الثَّقْبِ فَهُمُ الزُّنَاةُ وَالَّذِي رَأَيْتَهُ فِي النَّهَرِ آكِلُ الرِّبَا وَالشَّيْخُ الَّذِي رَأَيْتَهُ فِي أَصْلِ الشَّجَرَةِ إِبْرَاهِيمُ وَالصِّبْيَانُ حَوْلَهُ فَأَوْلَادُ النَّاسِ وَالَّذِي يُوقِدُ النَّارَ مَالِكٌ خَازِنُ النَّارِ وَالدَّارُ الْأُولَى الَّتِي دَخَلْتَ دَارُ عَامَّةِ الْمُؤْمِنِينَ وَأَمَّا هَذِهِ الدَّارُ فَدَارُ الشُّهَدَاءِ وَأَنَا جِبْرِيلُ وَهَذَا مِيكَائِيلُ فَارْفَعْ رَأْسَكَ فَرَفَعْتُ رَأْسِي فَإِذَا فَوْقِي مِثْلُ السَّحَابِ وَفِي رِوَايَةٍ مِثْلُ الرَّبَابَةِ الْبَيْضَاءِ قَالَا: ذَلِكَ مَنْزِلُكَ قُلْتُ: دَعَانِي أَدْخُلْ مَنْزِلِي قَالَا: إِنَّهُ بَقِيَ لَكَ عُمُرٌ لَمْ تَسْتَكْمِلْهُ فَلَوِ اسْتَكْمَلْتَهُ أَتَيْتَ مَنْزِلَكَ «. رَوَاهُ الْبُخَارِيُّ.","english":{"narrator":"Samura b. Jundub said:","text":"When the Prophet prayed he turned his face to us and asked, “Who among you had a vision last night?” If one of us had had one he told it and he would interpret it as God willed. One day he asked us, “Has any of you had a vision?” and when we replied that we had not he said:\n“But last night I saw two men who came to me, took me by the hand and brought me out to a holy land. I saw a man sitting and a man standing with a hooked piece of iron in his hand which he was inserting into the other man's jaw and cleaving it till it reached the back of his neck, and doing the same with the other jaw. This jaw was recovering, and then he would do the same again. I asked what this was and they told me to come away. So we went on till we came to a man who was lying on his back over whom a man was standing with a stone the size of his hand, or a rock, with which he was pounding his head. When he struck him the stone rolled away and he went after it to get it, and did not return to this man till his head was healed and restored to its former condition. He then went back to him and struck him. I asked what this was and they told me to come away. So we went on till we came to a hole like an oven, narrow at the top and wide at the bottom, under which there was a fire. It contained naked men and women who when the fire rose mounted till they almost came out, but who returned into it when it subsided. I asked what this was and they told me to come away. So we went on till we came to a river of blood in the middle of which a man was standing and on the bank of which there was a man with some stones in front of him. The man who was in the river came forward and when he wanted to come out the other threw a stone into his mouth and sent him back where he came from; and as often as he tried to come out he threw a stone into his mouth and he returned to where he came from. I asked what this was and they\" told me to come away. So we went on till we reached a green garden containing a huge tree at the foot of which were an old man and some boys and near which there was a man in front of whom there was a fire which he was kindling. My two companions took me up the tree and brought me into a house in the middle of the tree more beautiful than any I had seen in which were old men, youths, women and boys. They then took me out of it and brought me up the tree and took me into a more beautiful and more excellent house in which were old men and youths. Telling them that they had taken me round this night, I asked them to inform me about what I had seen, to which they agreed. \nThey said that the man I had seen having his jaw cloven was a liar who told lies which were reported from him and carried to the ends of the earth, so what I had seen would be done to him till the day of resurrection. The man whose head I had seen being pounded was a man whom God had taught the Qur’an but who had slept at night and neglected it and had not acted according to its teachings in the daytime, so what I had seen would be done to him till the day of resurrection. Those I had seen in the hole were fornicators and the one I had seen in the river was the one who devoured usury. The old man I had seen at the foot of the tree was Abraham, the boys around him were the children of men, and the one who was kindling the fire was Malik the guardian of hell. The first house I entered was the abode of the generality of believers, but this house was the abode of the martyrs. One of them informing me that he was Gabriel and that the other was Michael told me to raise my head, and when I did so I saw something like a white cloud (a version giving cumulus cloud) and they told me that would be my abode. I asked them to let me enter my dwelling, but they told me I had still some time to live which I had not completed and that if I had completed it I would have entered my dwelling.” \n\nBukhari transmitted it."}},{"id":15,"idInBook":15,"chapterId":24,"bookId":14,"arabic":"عَن أبي رزين العقيليِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «رُؤْيَا الْمُؤْمِنِ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ وَهِيَ عَلَى رِجْلِ طَائِرٍ مَا لَمْ يُحَدِّثْ بِهَا فَإِذَا حَدَّثَ بِهَا وَقَعَتْ» . وَأَحْسِبُهُ قَالَ: «لَا تُحَدِّثْ إِلَّا حَبِيبًا أَوْ لَبِيبًا» . رَوَاهُ التِّرْمِذِيُّ وَفِي رِوَايَةِ أَبِي دَاوُدَ قَالَ: «الرُّؤْيَا عَلَى رِجْلِ طَائِرٍ مَا لَمْ تُعْبَرْ فَإِذَا عُبِرَتْ وَقَعَتْ» . وَأَحْسِبُهُ قَالَ: «وَلَا تَقُصَّهَا إِلَّا عَلَى وَادٍّ أَوْ ذِي رأيٍ»","english":{"narrator":"Abu Razin al-‘Uqaili reported God’s messenger as saying:","text":"“A believer’s vision is a forty-sixth part of prophecy. It flutters over a man as long as he does not talk about it, but when he talks about it it settles.” \nAnd I think he said, “Talk only to a friend or one with sound judgment.\"\n\nTirmidhi transmitted it. \nIn Abu Dawud’s version he said, The vision flutters over a man as long as it is not interpreted, but when it is interpreted it settles.” And I think he said, “Tell it only to one who loves him or one who has judgment.”"}},{"id":16,"idInBook":16,"chapterId":24,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَن وَرَقَةَ. فَقَالَتْ لَهُ خَدِيجَةُ: إِنَّهُ كَانَ قَدْ صَدَّقَكَ وَلَكِنْ مَاتَ قَبْلَ أَنْ تَظْهَرَ. فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أُرِيتُهُ فِي الْمَنَامِ وَعَلَيْهِ ثِيَابٌ بِيضٌ وَلَوْ كَانَ مِنْ أَهْلِ النَّارِ لَكَانَ عَلَيْهِ لِبَاسٌ غَيْرُ ذَلِك» . رَوَاهُ أَحْمد وَالتِّرْمِذِيّ","english":{"narrator":"A‘isha told that God’s messenger was questioned about Waraqa and Khadija said to him, “He believed on you, but died before you appeared as a prophet.” God’s messenger then said:","text":"“I was shown him in a dream wearing white clothes, and if he had been one of the inhabitants of hell he would have been wearing different clothing.” \n\nAhmad and Tirmidhi transmitted it."}},{"id":17,"idInBook":17,"chapterId":24,"bookId":14,"arabic":"وَعَنِ ابْنِ خُزَيْمَةَ بْنِ ثَابِتٍ عَنْ عَمِّهِ أَبِي خُزَيْمَةَ رَضِيَ اللَّهُ عَنْهُمْ أَنَّهُ رَأَى فِيمَا يَرَى النَّائِمُ أَنَّهُ سَجَدَ عَلَى جَبْهَةِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرَهُ فَاضْطَجَعَ لَهُ وَقَالَ: «صَدِّقْ رُؤْيَاكَ» فَسَجَدَ عَلَى جَبْهَتِهِ. رَوَاهُ فِي شَرْحِ السُّنَّةِ.","english":{"narrator":"","text":"Ibn Khuzaima b. Thabit quoted his paternal uncle Aba Khuzaima as saying he had had a dream in which he prostrated himself on the Prophet's forehead. When he told him he lay down for him and said, “Verify your vision,” so he prostrated himself on his forehead. \n\nIt is transmitted in Sharh as-sunna."}},{"id":18,"idInBook":18,"chapterId":24,"bookId":14,"arabic":"عَن سَمُرَةَ بْنِ جُنْدَبٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِمَّا يَكْثُرُ أَنْ يَقُولَ لِأَصْحَابِهِ: «هَلْ رَأَى أَحَدٌ مِنْكُمْ مِنْ رُؤْيَا؟» فَيَقُصُّ عَلَيْهِ مَنْ شَاءَ اللَّهُ أَنْ يَقُصَّ وَإِنَّهُ قَالَ لَنَا ذَاتَ غَدَاةٍ: \" إِنَّهُ أَتَانِي اللَّيْلَةَ آتِيَانِ وَإِنَّهُمَا ابْتَعَثَانِي وَإِنَّهُمَا قَالَا لِي: انْطَلِقْ وَإِنِّي انْطَلَقْتُ مَعَهُمَا \". وَذَكَرَ مِثْلَ الْحَدِيثِ الْمَذْكُورِ فِي الْفَصْلِ الْأَوَّلِ بِطُولِهِ وَفِيهِ زِيَادَةٌ لَيْسَتْ فِي الْحَدِيثِ الْمَذْكُورِ وَهِيَ قَوْلُهُ: \" فَأَتَيْنَا عَلَى رَوْضَةٍ مُعْتِمَةٍ فِيهَا مِنْ كُلِّ نَوْرِ الرَّبِيعِ وَإِذَا بَيْنَ ظَهْرَيِ الرَّوْضَةِ رَجُلٌ طَوِيلٌ لَا أَكَادُ أَرَى رَأْسَهُ طُولًا فِي السَّمَاءِ وَإِذَا حَوْلَ الرَّجُلِ مِنْ أَكْثَرِ وِلْدَانٍ رَأَيْتُهُمْ قَطُّ قُلْتُ لَهُمَا: مَا هَذَا مَا هَؤُلَاءِ؟ \" قَالَ: \" قَالَا لِيَ: انْطَلِقْ فَانْطَلَقْنَا فَانْتَهَيْنَا إِلَى رَوْضَةٍ عَظِيمَةٍ لَمْ أَرَ رَوْضَةً قَطُّ أَعْظَمَ مِنْهَا وَلَا أَحْسَنَ \". قَالَ: \" قَالَا لِيَ: ارْقَ فِيهَا \". قَالَ: «فَارْتَقَيْنَا فِيهَا فَانْتَهَيْنَا إِلَى مَدِينَةٍ مَبْنِيَّةٍ بِلَبِنِ ذَهَبٍ وَلَبِنِ فِضَّةٍ فَأَتَيْنَا بَابَ الْمَدِينَةِ فَاسْتَفْتَحْنَا فَفُتِحَ لَنَا فَدَخَلْنَاهَا فَتَلَقَّانَا فِيهَا رِجَالٌ شَطْرٌ مِنْ خَلْقِهِمْ كَأَحْسَنِ مَا أَنْتَ رَاءٍ وَشَطْرٌ مِنْهُمْ كَأَقْبَحِ مَا أَنْتَ رَاءٍ» . قَالَ: \" قَالَا لَهُمُ: اذْهَبُوا فَقَعُوا فِي ذَلِكَ النَّهَرِ \" قَالَ: «وَإِذَا نَهَرٌ مُعْتَرِضٌ يَجْرِي كَأَنَّ مَاءَهُ الْمَحْضُ فِي الْبَيَاضِ فَذَهَبُوا فَوَقَعُوا فِيهِ ثُمَّ رَجَعُوا إِلَيْنَا قَدْ ذَهَبَ ذَلِكَ السُّوءُ عَنْهُمْ فَصَارُوا فِي أَحْسَنِ صُورَةٍ» وَذَكَرَ فِي تَفْسِير هَذِه الزِّيَادَة: «وَأما الرجلُ الطويلُ الَّذِي فِي الرَّوْضَةِ فَإِنَّهُ إِبْرَاهِيمُ وَأَمَّا الْوِلْدَانُ الَّذِينَ حَوْلَهُ فَكُلُّ مَوْلُودٍ مَاتَ عَلَى الْفِطْرَةِ» قَالَ: فَقَالَ بَعْضُ الْمُسْلِمِينَ: يَا رَسُولَ اللَّهِ وَأَوْلَادُ الْمُشْرِكِينَ؟ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «وَأَوْلَادُ الْمُشْرِكِينَ وَأَمَّا الْقَوْمُ الَّذِينَ كَانُوا شطرٌ مِنْهُم حسن وَشطر مِنْهُمْ حَسَنٌ وَشَطْرٌ مِنْهُمْ قَبِيحٌ فَإِنَّهُمْ قَوْمٌ قَدْ خَلَطُوا عَمَلًا صَالِحًا وَآخَرَ سَيِّئًا تَجَاوَزَ الله عَنْهُم» . رَوَاهُ البُخَارِيّ","english":{"narrator":"Samura b. Jundub told that one of the things God’s messenger often asked his companions was, “Has any of you had a vision?” Then anyone whom God wished to do so would tell him. One morning he said to them, “Two people came to me last night and rousing me told me to set out, so I set out along with them.” \nHe mentioned at length something similar to the tradition mentioned in the first section, but it contains this addition which is not in the aforementioned tradition:","text":"“We came to a luxuriant garden containing all kinds of Spring blossom in the middle of which there was a man who was so tall that I could scarcely see his head, so high it went up into the sky; and around the man there were more children than I had ever seen. I asked my companions who this was and who these were, but they told me to come away. So we went on and came to a huge garden than which I had never seen any larger or more beautiful. They told me to go up into it, and when we had done so we came to a city built of gold and silver bricks. When we came to the gate of the city we asked that it should be opened, and when that was done and we had entered we were met by men half of whose frame was like the most beautiful you could see while the other half was like the most ugly you could see. There was a river opposite flowing with water as white as pure milk, and my companions told them to go and plunge into that river. They did so and returned to us having had that ugliness removed from them and having become most beautiful in appearance.\" \nIn the exposition of this addition he mentioned, “The tall man who was in the garden was Abraham and the children who were around him were all who had been born and had died following the true religion.\" \nSome Muslims asked God’s messenger about the children of the polytheists, and he replied that they were there too. He continued: “The people who, were half beautiful and half ugly were people Who had mixed a good deed with another which was evil and had been forgiven by God.\"\n\nBukhari transmitted it."}},{"id":19,"idInBook":19,"chapterId":24,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مِنْ أَفْرَى الْفِرَى أَنْ يُرِيَ الرَّجُلُ عَيْنَيْهِ مَا لم تريا» . رَوَاهُ البُخَارِيّ","english":{"narrator":"Ibn ‘Umar reported God’s messenger as saying:","text":"“The worst lie is when a man pretends to have seen what he has not seen.\" \n\nBukhari transmitted it,"}},{"id":20,"idInBook":20,"chapterId":24,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أَصْدَقُ الرُّؤْيَا بِالْأَسْحَارِ» . رَوَاهُ التِّرْمِذِيّ والدارمي\nنِهَايَة الْجُزْء الثَّانِي","english":{"narrator":"Abu Sa'id reported the Prophet as saying:","text":"“The truest vision comes a little before daybreak.” \n\nTirmidhi and Darimi transmitted it."}}],"chapter":{"id":24,"bookId":14,"arabic":"كتاب الرؤيا","english":"Visions"}}