{"metadata":{"length":243,"arabic":{"title":"مشكاة المصابيح","author":"الإمام الكاتب التبريزي","introduction":"كتاب الجنائز"},"english":{"title":"Mishkat al-Masabih","author":"Al-Khatib Al-Tabrizi","introduction":"Funerals"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":5,"bookId":14,"arabic":"عَنْ أَبِي مُوسَى قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَطْعِمُوا الْجَائِعَ وَعُودُوا الْمَرِيض وفكوا العاني» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Abu Musa reported God’s messenger as saying, “Feed the hungry, visit the sick and free the captive.” \n\nBukhari transmitted it."}},{"id":2,"idInBook":2,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" حَقُّ الْمُسْلِمِ عَلَى الْمُسْلِمِ خَمْسٌ: رَدُّ السَّلَامِ وَعِيَادَةُ الْمَرِيضِ وَاتِّبَاعُ الْجَنَائِزِ وَإِجَابَةُ الدعْوَة وتشميت الْعَاطِس \"","english":{"narrator":"Abu Huraira reported God’s messenger as saying, “A Muslim has five duties towards another Muslim:","text":"to return a salutation, visit the sick, follow funerals, accept an invitation and say ‘God have mercy on you’ when one sneezes.”\n\n(Bukhari and Muslim.)"}},{"id":3,"idInBook":3,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «حَقُّ الْمُسْلِمِ عَلَى الْمُسْلِمِ سِتٌّ» . قِيلَ: مَا هُنَّ يَا رَسُولَ اللَّهِ؟ قَالَ: «إِذَا لَقِيتَهُ فَسَلِّمْ عَلَيْهِ وَإِذَا دَعَاكَ فَأَجِبْهُ وَإِذَا اسْتَنْصَحَكَ فَانْصَحْ لَهُ وَإِذَا عَطَسَ فَحَمِدَ اللَّهَ فَشَمِّتْهُ وَإِذَا مَرِضَ فَعُدْهُ وَإِذَا مَاتَ فَاتَّبِعْهُ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"He reported God’s messenger as saying, “A Muslim has six duties towards another Muslim.” When asked what they were he replied, “When you meet him salute him ; when he issues an invitation to you, accept it; when he asks your advice give it to him ; when he sneezes and praises God say, ‘God have mercy on you’; when he is ill visit him ; and when he dies follow him to the grave.”\n\nMuslim transmitted it."}},{"id":4,"idInBook":4,"chapterId":5,"bookId":14,"arabic":"وَعَنِ الْبَرَاءِ بْنِ عَازِبٍ قَالَ: أَمَرَنَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِسَبْعٍ وَنَهَانَا عَنْ سَبْعٍ أَمَرَنَا: بِعِيَادَةِ الْمَرِيضِ وَاتِّبَاعِ الْجَنَائِزِ وَتَشْمِيتِ الْعَاطِسِ وَرَدِّ السَّلَامِ وَإِجَابَةِ الدَّاعِي وَإِبْرَارِ الْمُقْسِمِ وَنَصْرِ الْمَظْلُومِ وَنَهَانَا عَنْ خَاتَمِ الذَّهَبِ وَعَنِ الْحَرِيرِ والْإِسْتَبْرَقِ وَالدِّيبَاجِ وَالْمِيثَرَةِ الْحَمْرَاءِ وَالْقَسِّيِّ وَآنِيَةِ الْفِضَّةِ وَفِي رِوَايَةٍ وَعَنِ الشُّرْبِ فِي الْفِضَّةِ فَإِنَّهُ مَنْ شَرِبَ فِيهَا فِي الدُّنْيَا لم يشرب فِيهَا فِي الْآخِرَة","english":{"narrator":"Al-Bara’ b. ‘Azib said :","text":"The Prophet gave us seven commands and seven prohibitions. He commanded us to visit the sick, to follow funerals, to say ‘God have mercy on you’ when someone sneezes, to return salutations, to accept invitations, to help people to fulfil their oaths, and to help the wronged; and he forbade us gold rings, silk, thick brocade, embroidered silk, red stuffing placed on a saddle, Qassi garments (said to be cloth made of flax and raw silk which came from a place in Egypt called Qass between al-'Arish  and al-Farama. Another suggestion is that the name is changed from qazzi  and means silk.) and silver vessels. A version says drinking from silver vessels, for he who drinks out of them in this world will not drink out of them in the next. \n\n(Bukhari and Muslim.)"}},{"id":5,"idInBook":5,"chapterId":5,"bookId":14,"arabic":"وَعَنْ ثَوْبَانَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ الْمُسْلِمَ إِذَا عَادَ أَخَاهُ الْمُسلم لم يزل فِي خُرْفَةِ الْجَنَّةِ حَتَّى يَرْجِعَ» . رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"Thauban reported God’s messenger as saying, “When a Muslim pays a sick visit to his brother Muslim he continues to gather the fruits of paradise till he returns.” \n\nMuslim transmitted it."}},{"id":6,"idInBook":6,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" إِن الله عز وَجل يَقُولُ يَوْمَ الْقِيَامَةِ: يَا ابْنَ آدَمَ مَرِضْتُ فَلَمْ تَعُدْنِي قَالَ: يَا رَبِّ كَيْفَ أَعُودُكَ وَأَنْتَ رَبُّ الْعَالَمِينَ؟ قَالَ: أَمَّا عَلِمْتَ أَنَّ عَبْدِي فُلَانًا مَرِضَ فَلَمْ تَعُدْهُ؟ أَمَا عَلِمْتَ أَنَّكَ لَوْ عُدْتَهُ لَوَجَدْتَنِي عِنْدَهُ؟ يَا ابْنَ آدَمَ اسْتَطْعَمْتُكَ فَلَمْ تُطْعِمْنِي قَالَ: يَا رَبِّ كَيْفَ أُطْعِمُكَ وَأَنْتَ رَبُّ الْعَالَمِينَ؟ قَالَ: أَمَا عَلِمْتَ أَنَّهُ اسْتَطْعَمَكَ عَبْدِي فُلَانٌ فَلَمْ تُطْعِمْهُ؟ أَمَا عَلِمْتَ أَنَّكَ لَوْ أَطْعَمْتَهُ لَوَجَدْتَ ذَلِكَ عِنْدِي؟ يَا ابْنَ آدَمَ اسْتَسْقَيْتُكَ فَلَمْ تَسْقِنِي قَالَ: يَا رَبِّ كَيْفَ أَسْقِيكَ وَأَنْتَ رَبُّ الْعَالَمِينَ؟ قَالَ: اسْتَسْقَاكَ عَبْدِي فُلَانٌ فَلَمْ تَسْقِهِ أما إِنَّك لَو سقيته لوجدت ذَلِك عِنْدِي \". رَوَاهُ مُسلم","english":{"narrator":"Abu Huraira reported God’s messenger as saying:","text":"On the day of resurrection God most high will say, “Son of Adam, I was sick and you did not visit me.” He will reply, “My Lord, how could I visit Thee when Thou art the Lord of the universe?” He will say, “Did you not know that my servant so and so was ill and yet you did not visit him? Did you not know that if you had visited him you would have found me with him? Son of Adam, I asked you for food but you gave me none.” He will reply, “My Lord, how could I feed Thee when Thou art the Lord of the universe?” He will say, “Did you not know that my servant so and so asked you for food and yet you gave him none? Did you not know that if you had fed him you would have found that with me? Son of Adam, I asked you for drink but you gave me none.” He will reply “My Lord, how could I give Thee drink when Thou art the Lord of the universe?” He will say, “My servant so and so asked you for drink but you gave him none. Did you not know that if you had given him something to drink you would have found that with me?’’\n\nMuslim transmitted it."}},{"id":7,"idInBook":7,"chapterId":5,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَى أَعْرَابِيٍّ يَعُودُهُ وَكَانَ إِذَا دَخَلَ عَلَى مَرِيضٍ يَعُودُهُ قَالَ: «لَا بَأْسَ طَهُورٌ إِنْ شَاءَ اللَّهُ» فَقَالَ لَهُ: «لَا بَأْسَ طَهُورٌ إِنْ شَاءَ اللَّهُ» . قَالَ: كَلَّا بَلْ حُمَّى تَفُورُ عَلَى شَيْخٍ كَبِيرٍ تزيره الْقُبُور. فَقَالَ: «فَنعم إِذن» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Ibn ‘Abbas said that the Prophet went in to visit a Bedouin Arab, and when he entered to visit a sick man he was accustomed to say, “No harm will come; it is a purification, if God will.” He repeated these words, and when the man replied, “Not at all; it is on the contrary a fever which is boiling in an old man and will cause him to visit the graves,” the Prophet said, “Very well, then.”\n\nBukharl transmitted it."}},{"id":8,"idInBook":8,"chapterId":5,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اشْتَكَى مِنَّا إِنْسَانٌ مَسَحَهُ بِيَمِينِهِ ثُمَّ قَالَ: «أَذْهِبِ الْبَاسَ رَبَّ النَّاسِ وَاشْفِ أَنْتَ الشَّافِي لَا شِفَاءَ إِلَّا شِفَاؤُكَ شِفَاءٌ لَا يُغَادِرُ سَقَمًا»","english":{"narrator":"‘A’isha said:","text":"When one of us had a complaint God’s messenger wiped him with his right hand and then said, “Remove the harm, Lord of men, and give healing. Thou art the Healer. There is no healing but Thine, a healing which leaves no illness behind.” \n\n(Bukharl and Muslim.)"}},{"id":9,"idInBook":9,"chapterId":5,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: كَانَ إِذَا اشْتَكَى الْإِنْسَانُ الشَّيْءَ مِنْهُ أَوْ كَانَتْ بِهِ قَرْحَةٌ أَوْ جُرْحٌ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِأُصْبُعِهِ: «بِسْمِ اللَّهِ تُرْبَةُ أَرْضِنَا بِرِيقَةِ بَعْضِنَا لِيُشْفَى سَقِيمُنَا بِإِذن رَبنَا»","english":{"narrator":"","text":"She said that when a person complained of some trouble, or if he had a sore or a wound, the Prophet would say while pointing with his finger, “In the name of God. It is the soil of our land with the spittle of one of us (the suggestion is that the Prophet took some earth on his finger and spat on it), that our sick one may be healed by our Lord’s permission.”\n\n(Bukharl and Muslim.)"}},{"id":10,"idInBook":10,"chapterId":5,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اشْتَكَى نَفَثَ عَلَى نَفْسِهِ بِالْمُعَوِّذَاتِ وَمَسَحَ عَنْهُ بِيَدِهِ فَلَمَّا اشْتَكَى وَجَعَهُ الَّذِي تُوُفِّيَ فِيهِ كُنْتُ أَنْفِثُ عَلَيْهِ بِالْمُعَوِّذَاتِ الَّتِي كَانَ يَنْفِثُ وَأَمْسَحُ بِيَدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ\nوَفِي رِوَايَةٍ لِمُسْلِمٍ قَالَتْ: كَانَ إِذَا مَرِضَ أَحَدٌ مِنْ أَهْلِ بَيْتِهِ نَفَثَ عَلَيْهِ بِالْمُعَوِّذَاتِ","english":{"narrator":"","text":"She said that when the Prophet had a complaint he would blow on himself, ejecting saliva, reciting the Mu'awwidhat (See n. 1, p, 197.), and wipe himself with his hand. She said, “When he suffered from the pain of which he died, I would blow on him ejecting saliva and recite the Mu'awwidhat  as he did, and would take the Prophet’s hand to wipe him.” \n\n(Bukhari and Muslim.)\n\nIn a version by Muslim she said, “When one of his family was ill he would blow on him ejecting saliva and recite the Mu'awwidhat."}},{"id":11,"idInBook":11,"chapterId":5,"bookId":14,"arabic":"وَعَنْ عُثْمَانَ بْنِ أَبِي الْعَاصِ أَنَّهُ شَكَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَجَعًا يَجِدُهُ فِي جَسَدِهِ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" ضَعْ يَدَكَ عَلَى الَّذِي يَأْلَمُ مِنْ جَسَدِكَ وَقُلْ: بِسْمِ اللَّهِ ثَلَاثًا وَقُلْ سَبْعَ مَرَّاتٍ: أَعُوذُ بِعِزَّةِ اللَّهِ وَقُدْرَتِهِ مِنْ شَرِّ مَا أَجِدُ وَأُحَاذِرُ \". قَالَ: فَفَعَلْتُ فَأَذْهَبَ اللَّهُ مَا كَانَ بِي. رَوَاهُ مُسلم","english":{"narrator":"","text":"Uthman b. Abul ‘As said he complained to God’s messenger of a pain he had in his body, and he told him to put his hand on the part of his body which was sore and say three times “In the name of God,” and seven times, “I seek refuge in God’s might and power from the evil of what I am experiencing and trying to avert.” He said he did so, and God removed his trouble.\n\nMuslim transmitted it."}},{"id":12,"idInBook":12,"chapterId":5,"bookId":14,"arabic":"وَعَن أبي سعيد الْخُدْرِيّ أَن جِبْرِيلَ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: يَا مُحَمَّدُ أَشْتَكَيْتَ؟ فَقَالَ: «نَعَمْ» . قَالَ: بِسْمِ اللَّهِ أَرْقِيكَ مِنْ كُلِّ شَيْءٍ يُؤْذِيكَ مِنْ شرك كُلِّ نَفْسٍ أَوْ عَيْنِ حَاسِدٍ اللَّهُ يَشْفِيكَ بِسم الله أرقيك. رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Sa'id al-Khudri said Gabriel came to the Prophet and asked, “Have you a complaint, Muhammad?” When he replied that he had, he said, “In the name of God I am applying a charm to you from everything which may harm you, from the evil of every evil eye, or eye of an envious one. God heals you. In the name of God I am applying a charm to you.”\n\nMuslim transmitted it."}},{"id":13,"idInBook":13,"chapterId":5,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم يعوذ الْحسن وَالْحسن: «أُعِيذُكُمَا بِكَلِمَاتِ اللَّهِ التَّامَّةِ مِنْ كُلِّ شَيْطَانٍ وَهَامَّةٍ وَمِنْ كُلِّ عَيْنٍ لَامَّةٍ» وَيَقُولُ: «إِنَّ أَبَاكُمَا كَانَ يعوذ بهما إِسْمَاعِيلَ وَإِسْحَاقَ» . رَوَاهُ الْبُخَارِيُّ وَفِي أَكْثَرِ نُسَخِ المصابيح: «بهما» على لفظ التَّثْنِيَة","english":{"narrator":"","text":"Ibn ‘Abbas said that God’s messenger used to commend al-Hasan and al-Husain to God’s protection, saying “With God’s perfect words I commend you to God’s protection from every devil and poisonous creature and from every evil eye.” And he would say, “Your ancestor used to commend Ishmael and Isaac with them to God’s protection.”(Abraham is here said to have done to his sons the same as the Prophet did to his grandsons.) \n\nBukhari transmitted it. Most texts of al-Masabih have “with them” in the dual."}},{"id":14,"idInBook":14,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ يُرِدِ اللَّهُ بِهِ خَيْرًا يُصِبْ مِنْهُ» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “Anyone for whom God intends good is made to suffer some affliction from Him.”\n\nBukhari transmitted it."}},{"id":15,"idInBook":15,"chapterId":5,"bookId":14,"arabic":"وَعَن أبي هُرَيْرَة وَأبي سَعِيدٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَا يُصِيبُ الْمُسْلِمَ مِنْ نَصَبٍ وَلَا وَصَبٍ وَلَا هَمٍّ وَلَا حُزْنٍ وَلَا أَذًى وَلَا غَمٍّ حَتَّى الشَّوْكَةُ يُشَاكُهَا إِلَّا كَفَّرَ اللَّهُ بهَا من خطاياه»","english":{"narrator":"","text":"He and Abu Sa'id reported the Prophet as saying, “No Muslim is afflicted by difficulty, continuous pain, anxiety, grief, injury, or care, or even by a thorn with which he is pierced, without God thereby making an atonement for his sins.”\n\n(Bukhari and Muslim.)"}},{"id":16,"idInBook":16,"chapterId":5,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ: دَخَلْتُ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يُوعَكُ فَمَسِسْتُهُ بِيَدِي فَقُلْتُ: يَا رَسُولَ اللَّهِ إِنَّكَ لَتُوعَكُ وَعْكًا شَدِيدًا. فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَجَلْ إِنِّي أُوعَكُ كَمَا يُوعَكُ رَجُلَانِ مِنْكُمْ» . قَالَ: فَقُلْتُ: ذَلِكَ لِأَنَّ لَكَ أَجْرَيْنِ؟ فَقَالَ: «أَجَلْ» . ثُمَّ قَالَ: «مَا مِنْ مُسْلِمٍ يُصِيبُهُ أَذًى مِنْ مَرَضٍ فَمَا سِوَاهُ إِلَّا حَطَّ اللَّهُ تَعَالَى بِهِ سَيِّئَاتِهِ كَمَا تَحُطُّ الشَّجَرَةُ وَرَقَهَا»","english":{"narrator":"‘Abdallah b. Mas'ud said:","text":"I went in to visit the Prophet when he was jaded by fever, and touching him with my hand, I said, “You are seriously jaded by fever, messenger of God.” The Prophet replied, “Yes, I am twice as jaded as any of you.” I said, “That is because you have a double reward.” He replied that that was so and then said, “No Muslim is afflicted by injury, be it illness or something else, without God thereby causing his sins to drop away just as a tree sheds its leaves.”\n \n(Bukhari and Muslim.)"}},{"id":17,"idInBook":17,"chapterId":5,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: مَا رَأَيْتُ أَحَدًا الْوَجَعُ عَلَيْهِ أَشَدُّ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ","english":{"narrator":"","text":"‘A’isha said she never saw anyone suffering severer pain than God’s messenger. \n\n(Bukhari and Muslim.)"}},{"id":18,"idInBook":18,"chapterId":5,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: مَاتَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ حَاقِنَتِي وَذَاقِنَتِي فَلَا أَكْرَهُ شِدَّةَ الْمَوْتِ لِأَحَدٍ أَبَدًا بَعْدَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ. رَوَاهُ الْبُخَارِيُّ","english":{"narrator":"","text":"She said, “The Prophet died lying between my breast and my collarbone. I will never feel bad about anyone having a painful death after what I saw the Prophet suffer.” \n\nBukhari transmitted it."}},{"id":19,"idInBook":19,"chapterId":5,"bookId":14,"arabic":"وَعَنْ كَعْبِ بْنِ مَالِكٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَثَلُ الْمُؤْمِنِ كَمَثَلِ الْخَامَةِ مِنَ الزَّرْعِ تُفَيِّئُهَا الرِّيَاح تصرعها مرّة وتعدلها أُخْرَى حَتَّى يَأْتِيهِ أَجَلُهُ وَمَثَلُ الْمُنَافِقِ كَمَثَلِ الْأَرْزَةِ الْمُجْذِيَةِ الَّتِي لَا يُصِيبُهَا شَيْءٌ حَتَّى يَكُونَ انْجِعَافُهَا مَرَّةً وَاحِدَة»","english":{"narrator":"","text":"Ka‘b b. Malik reported God’s messenger as saying, “The believer is like a tender plant moved by the winds, sometimes being bent down and sometimes made to stand up straight, till his appointed time comes; but the hypocrite is like the cedar standing firmly, which is unaffected by anything, till it is completely cast down.”( The idea of this tradition is that believers have many troubles during their lifetime, whereas hypocrites escape them.)\n\n(Bukharl and Muslim.)"}},{"id":20,"idInBook":20,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَثَلُ الْمُؤْمِنِ كَمَثَلِ الزَّرْعِ لَا تزَال لاريح تميله وَلَا يزَال الْمُؤمن يصبيه الْبَلَاءُ وَمَثَلُ الْمُنَافِقِ كَمَثَلِ شَجَرَةِ الْأَرْزَةِ لَا تهتز حَتَّى تستحصد»","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “The believer is like a plant which is continually swayed by the wind, for the believer is continually afflicted by trial; but the hypocrite is like a cedar tree which does not shake till it is cut down.”\n(Bukharl and Muslim.)"}},{"id":21,"idInBook":21,"chapterId":5,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: دَخَلَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى أُمِّ السَّائِبِ فَقَالَ: «مَالك تُزَفْزِفِينَ؟» . قَالَتِ: الْحُمَّى لَا بَارَكَ اللَّهُ فِيهَا فَقَالَ: «لَا تَسُبِّي الْحُمَّى فَإِنَّهَا تُذْهِبُ خَطَايَا بَنِي آدَمَ كَمَا يُذْهِبُ الْكِيرُ خَبَثَ الْحَدِيدِ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Jabir told of God’s messenger visiting Umm as-Sa’ib (Ibn 'Abd al-Barr (Isti'ab, p. 781) gives her name in this form, but says she is called by some Umm al-Musayyib) and asking, “What is the matter with you that you are trembling?” She replied, “Fever; may God not bless it.” He said, “Do not revile fever, for it removes the sins of the sons of Adam just as the bellows remove the dross of iron.”\nMuslim transmitted it."}},{"id":22,"idInBook":22,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَبِي مُوسَى قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا مَرِضَ الْعَبْدُ أَوْ سَافَرَ كُتِبَ لَهُ بِمِثْلِ مَا كَانَ يعْمل مُقيما صَحِيحا» رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Abu Musa reported God’s messenger as saying, “When a man is ill or on a journey, what he was accustomed to do when staying at home and well will be recorded for him.”(This refers to his observance of salat, etc., cf. the traditions of ‘Abdallah b. 'Amr and Anas on p. 326.) \n\nBukhari transmitted it."}},{"id":23,"idInBook":23,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الطَّاعُونُ شَهَادَةٌ لكل مُسلم»","english":{"narrator":"","text":"Anas reported God’s messenger as saying, “Every Muslim who dies of plague is credited with martyrdom.”\n\n(Bukhari and Muslim.)"}},{"id":24,"idInBook":24,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الشُّهَدَاءُ خَمْسَةٌ الْمَطْعُونُ وَالْمَبْطُونُ وَالْغَرِيقُ وَصَاحب الْهدم والشهيد فِي سَبِيل الله»","english":{"narrator":"Abu Huraira reported God’s messenger as saying, “There are five types of martyr:","text":"one who dies of plague, one who dies of an internal complaint, one who is drowned, one who is killed by his house falling on him, and the martyr in God’s path.”\n\n(Bukhari and Muslim.)"}},{"id":25,"idInBook":25,"chapterId":5,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: سَأَلَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ الطَّاعُونِ فَأَخْبَرَنِي: «أَنَّهُ عَذَابٌ يَبْعَثُهُ اللَّهُ عَلَى مَنْ يَشَاءُ وَأَنَّ اللَّهَ جَعَلَهُ رَحْمَةً لِلْمُؤْمِنِينَ لَيْسَ مِنْ أَحَدٍ يَقَعُ الطَّاعُونُ فَيَمْكُثُ فِي بَلَدِهِ صَابِرًا مُحْتَسِبًا يَعْلَمُ أَنَّهُ لَا يُصِيبُهُ إِلَّا مَا كَتَبَ اللَّهُ لَهُ إِلَّا كَانَ لَهُ مِثْلُ أَجْرِ شَهِيدٍ» . رَوَاهُ الْبُخَارِيُّ","english":{"narrator":"","text":"‘A’isha said, “I asked God’s messenger about plague and he told me it is a punishment God sends upon whomsoever He wills, but God has made it a blessing to the believers. When plague comes, anyone who stays patiently in his town looking for his reward from God, knowing that only what God has decreed for him can happen to him, will have a reward like that of a martyr.” \n\nBukhari transmitted it."}},{"id":26,"idInBook":26,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أُسَامَةَ بْنِ زَيْدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الطَّاعُونُ رِجْزٌ أُرْسِلَ عَلَى طَائِفَةٍ مِنْ بَنِي إِسْرَائِيلَ أَوْ عَلَى مَنْ كَانَ قَبْلَكُمْ فَإِذَا سَمِعْتُمْ بِهِ بِأَرْضٍ فَلَا تَقْدَمُوا عَلَيْهِ وَإِذَا وَقَعَ بِأَرْضٍ وَأَنْتُمْ بِهَا فَلَا تَخْرُجُوا فِرَارًا مِنْهُ»","english":{"narrator":"","text":"Usama b. Zaid reported God’s messenger as saying, “Plague is a punishment which was sent down on a section of the B. Isrs’il, or on people before your time. When you hear of it in a land do not go to it, and if it occurs in a land while you are in it do not go out fleeing from it.\n\n(Bukhari and Muslim.)"}},{"id":27,"idInBook":27,"chapterId":5,"bookId":14,"arabic":"وَعَن أَنَسٍ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: \n\" قَالَ اللَّهُ سُبْحَانَهُ وَتَعَالَى: إِذَا ابْتَلَيْتُ عَبْدِي بِحَبِيبَتَيْهِ ثُمَّ صَبَرَ عَوَّضْتُهُ مِنْهُمَا الْجنَّة \" يُرِيد عَيْنَيْهِ. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Anas said he heard the Prophet declare that God who is glorious and exalted said, “When I afflict my servant in his two loved things (i.e. his eyes), and he endures patiently, I shall compensate him for them with paradise.” \n\nBukhari transmitted it."}},{"id":28,"idInBook":28,"chapterId":5,"bookId":14,"arabic":"عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: مَا مِنْ مُسْلِمٍ يَعُودُ مُسْلِمًا غُدْوَةً إِلَّا صَلَّى عَلَيْهِ سَبْعُونَ أَلْفَ مَلَكٍ حَتَّى يُصْبِحَ وَكَانَ لَهُ خَرِيفٌ فِي الْجَنَّةِ \". رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُد","english":{"narrator":"","text":"‘All said he heard God’s messenger say, “No Muslim will pay a sick visit to another in the morning without seventy thousand angels invoking blessings on him till the evening, or visit him in the evening without seventy thousand angels invoking blessings on him till the morning, and he will have gathered fruits (the word used here is kharif, one of whose meanings is gathered or plucked fruits) in paradise.”\n\nTirmidhi and Abu Dawud transmitted it."}},{"id":29,"idInBook":29,"chapterId":5,"bookId":14,"arabic":"وَعَن زَيْدَ بْنَ أَرْقَمَ قَالَ: عَادَنِي النَّبِيُّ صَلَّى الله عَلَيْهِ وَسلم من وجع كَانَ يُصِيبنِي. رَوَاهُ أَحْمد وَأَبُو دَاوُد","english":{"narrator":"","text":"Zaid b. Arqam said the Prophet visited him when he had a pain in his eyes. \n\nAhmad and Abu Dawud transmitted it."}},{"id":30,"idInBook":30,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَنَسٍ: قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ تَوَضَّأَ فَأَحْسَنَ الْوُضُوءَ وَعَادَ أَخَاهُ الْمُسْلِمَ مُحْتَسِبًا بُوعِدَ مِنْ جَهَنَّمَ مسيرَة سِتِّينَ خَرِيفًا» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"Anas reported God’s messenger:","text":"as saying, “If anyone performs ablution well and pays a sick visit to his brother Muslim seeking his reward from God, he will be removed a distance of sixty years (here kharif is used in another of its meanings) from jahannam.” \n\nAbu Dawud transmitted it."}},{"id":31,"idInBook":31,"chapterId":5,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" مَا مِنْ مُسْلِمٍ يَعُودُ مُسْلِمًا فَيَقُولُ سَبْعَ مَرَّاتٍ: أَسْأَلُ اللَّهَ الْعَظِيمَ رَبَّ الْعَرْشِ الْعَظِيمِ أَنْ يَشْفِيَكَ إِلَّا شُفِيَ إِلَّا أَنْ يَكُونَ قَدْ حَضَرَ أَجَلُهُ \". رَوَاهُ أَبُو دَاوُد وَالتِّرْمِذِيّ","english":{"narrator":"","text":"Ibn ‘Abbas reported God’s messenger as saying, \"No Muslim will visit another and say seven times, ‘I ask God, the Mighty, the Lord of the mighty throne, to cure you’ without his being cured, unless his time has come.” \n\nAbu Dawud and Tirmidhi transmitted it."}},{"id":32,"idInBook":32,"chapterId":5,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: كَانَ يعلمهُمْ من الْحمى وم الأوجاع كلهَا أَن يَقُولُوا: «بِسم الله الْكَبِيرِ أَعُوذُ بِاللَّهِ الْعَظِيمِ مِنْ شَرِّ كُلِّ عرق نعار وَمن شَرّ حر النَّارِ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ هَذَا حَدِيثٌ غَرِيبٌ لَا يُعْرَفُ إِلَّا مِنْ حَدِيثِ إِبْرَاهِيمَ بْنِ إِسْمَاعِيلَ وَهُوَ يضعف فِي الحَدِيث","english":{"narrator":"","text":"He said that the Prophet used to teach them to say when afflicted by fever or any pain, \"In the name of God, the Great, I seek refuge in God, the Mighty, from the evil of every vein that bleeds and from the evil of the heat of hell.” \n\nTirmidhi transmitted it, but said this was a gharib tradition which he knew only among the traditions of Ibrahim b. Isma'il who is declared to be weak in tradition."}},{"id":33,"idInBook":33,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَبِي الدَّرْدَاءِ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: \n\" مَنِ اشْتَكَى مِنْكُمْ شَيْئًا أَوِ اشْتَكَاهُ أَخٌ لَهُ فَلْيَقُلْ: رَبُّنَا اللَّهُ الَّذِي فِي السَّمَاءِ تَقَدَّسَ اسْمُكَ أَمرك فِي السَّمَاء وَالْأَرْض كَمَا أَن رَحْمَتُكَ فِي السَّمَاءِ فَاجْعَلْ رَحْمَتَكَ فِي الْأَرْضِ اغْفِرْ لَنَا حُوبَنَا وَخَطَايَانَا أَنْتَ رَبُّ الطَّيِبِينَ أَنْزِلْ رَحْمَةً مِنْ رَحْمَتِكَ وَشِفَاءً مِنْ شِفَائِكَ عَلَى هَذَا الْوَجَعِ. فَيَبْرَأُ \". رَوَاهُ أَبُو دَاوُدَ","english":{"narrator":"","text":"Abud Darda’ said he heard God’s messenger say, \"If one of you has any complaint, or if a brother of his complains of it, he should say, ‘Our Lord God who art in heaven, hallowed be Thy name. Thy command is in the heaven and the earth. As Thy mercy is in the heaven so place Thy mercy in the earth. Forgive us our faults and sins. Thou art the Lord of the good ones. Send down some of Thy mercy and some of Thy healing on this pain’ and it will be cured.” \n\nAbu Dawud transmitted it."}},{"id":34,"idInBook":34,"chapterId":5,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا جَاءَ الرجل يعود مَرِيضا فَلْيقل ك اللَّهُمَّ اشْفِ عَبْدَكَ يَنْكَأُ لَكَ عَدُوًّا أَوْ يَمْشِي لَكَ إِلَى جِنَازَةٍ» رَوَاهُ أَبُو دَاوُدَ","english":{"narrator":"","text":"‘Abdallah b. ‘Amr reported God’s messenger as saying, \"When a man comes to visit an invalid he should say, ‘O God, cure Thy servant who may then wreak havoc on an enemy for Thy sake, or walk at a funeral for Thy sake’.” \n\nAbu Dawud transmitted it."}},{"id":35,"idInBook":35,"chapterId":5,"bookId":14,"arabic":"عَن عَلِيِّ بْنِ زَيْدٍ عَنْ أُمَيَّةَ أَنَّهَا سَأَلَتْ عَائِشَة عَن قَول الله تبَارك وَتَعَالَى: (إِن تُبْدُوا مَا فِي أَنْفُسِكُمْ أَوْ تُخْفُوهُ يُحَاسِبْكُمْ بِهِ الله)\nوَعَنْ قَوْلِهِ: (مَنْ يَعْمَلْ سُوءًا يُجْزَ بِهِ)\nفَقَالَتْ: مَا سَأَلَنِي عَنْهَا أَحَدٌ مُنْذُ سَأَلَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «هَذِه معاتبة الله العَبْد فِيمَا يُصِيبُهُ مِنَ الْحُمَّى وَالنَّكْبَةِ حَتَّى الْبِضَاعَةِ يَضَعُهَا فِي يَدِ قَمِيصِهِ فَيَفْقِدُهَا فَيَفْزَعُ لَهَا حَتَّى إِنَّ الْعَبْدَ لَيَخْرُجُ مِنْ ذُنُوبِهِ كَمَا يَخْرُجُ التبر الْأَحْمَر من الْكِير» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"‘Ali b. Zaid quoted Umayya as saying that she asked ‘A’isha about the words of God who is great and glorious, \"Whether you publish what is in your minds or conceal it, God will call you to account for it,” ( Qur’an,  ii, 284) and His words, \"If anyone does evil he will be requited for it.”(Qur’an, iv, 123). She replied that no one had asked her about them since she had asked God’s messenger and received the reply, \"This is God’s rebuke of His servant, by means of fever or misfortune with which He afflicts him, even such a matter as something he puts in his sleeve and grieves for when he loses it. The result is that the servant comes out of his sins as the pure gold comes out of the crucible.\" \n\nTirmidhi transmitted it."}},{"id":36,"idInBook":36,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَبِي مُوسَى أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \" لَا يُصِيبُ عَبْدًا نَكْبَةٌ فَمَا فَوْقَهَا أَوْ دُونَهَا إِلَّا بِذَنَبٍ وَمَا يَعْفُو اللَّهُ عَنْهُ أَكْثَرُ وَقَرَأَ: (وَمَا أَصَابَكُمْ مِنْ مُصِيبَةٍ فَبِمَا كَسَبَتْ أَيْدِيكُمْ وَيَعْفُو عَن كثير)\nرَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Abu Musa reported the Prophet as saying, “No affliction great or small afflicts a man but for a sin, but there are more which God forgives.” Then he recited, “Whatever misfortune befalls you, it is because of what your hands have done; but He forgives much.”(Qur’an, xlii, 30)\n\nTirmidhi transmitted it."}},{"id":37,"idInBook":37,"chapterId":5,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: \n\" إِن الْعَبْدَ إِذَا كَانَ عَلَى طَرِيقَةٍ حَسَنَةٍ مِنَ الْعِبَادَةِ ثُمَّ مَرِضَ قِيلَ لِلْمَلَكِ الْمُوَكَّلِ بِهِ: اكْتُبْ لَهُ مِثْلَ عَمَلِهِ إِذَا كَانَ طَلِيقًا حَتَّى أطلقهُ أَو أكفته إِلَيّ \"","english":{"narrator":"","text":"‘Abdallah b. ‘Amr reported God’s messenger as saying, “When a servant of God is accustomed to worship Him in a good manner, then becomes ill, the angel who is entrusted with him is told to record for him actions equivalent to those which he did when he was well till God sets him free from his illness or takes him in death.”\n\nTransmitted in Sharh as-sunna."}},{"id":38,"idInBook":38,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَنَسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" إِذَا ابْتُلِيَ الْمُسْلِمُ بِبَلَاءٍ فِي جَسَدِهِ قِيلَ لِلْمَلَكِ: اكْتُبْ لَهُ صَالِحَ عَمَلِهِ الَّذِي كَانَ يَعْمَلُ فَإِنْ شَفَاهُ غَسَّلَهُ وَطَهَّرَهُ وَإِنْ قَبَضَهُ غَفَرَ لَهُ وَرَحِمَهُ \". رَوَاهُمَا فِي شرح السّنة","english":{"narrator":"","text":"Anas reported God’s messenger as saying, “When a Muslim is afflicted with some trouble in his body the angel is told to record for him his good deeds which he was accustomed to do. Then if God cures him He washes and purifies him , and if He takes him in death He forgives him and shows mercy to him.” \n\nTransmitted in Sharh as-sunna."}},{"id":39,"idInBook":39,"chapterId":5,"bookId":14,"arabic":"وَعَنْ جَابِرِ بْنِ عَتِيكٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" الشَّهَادَةُ سَبْعٌ سِوَى الْقَتْلِ فِي سَبِيلِ اللَّهِ: الْمَطْعُونُ شَهِيدٌ وَالْغَرِيقُ شَهِيدٌ وَصَاحِبُ ذَاتِ الْجَنْبِ شَهِيدٌ وَالْمَبْطُونُ شَهِيدٌ وَصَاحِبُ الْحَرِيقِ شَهِيدٌ وَالَّذِي يَمُوتُ تَحْتَ الْهَدْمِ شَهِيدٌ وَالْمَرْأَةُ تَمُوتُ بِجُمْعٍ شَهِيدٌ \". رَوَاهُ مَالك وَأَبُو دَاوُد وَالنَّسَائِيّ","english":{"narrator":"","text":"Jabir b. ‘Atik reported God’s messenger as saying, “There are seven types of martyrdom apart from being killed in God’s path. Those who die of plague, those who are drowned, those who die of pleurisy, those who die of an internal complaint, those who are burnt to death, those who are killed by a building falling on them, and women who die while pregnant are martyrs.” \n\nMalik, Abu Dawud and Nasa’i transmitted it."}},{"id":40,"idInBook":40,"chapterId":5,"bookId":14,"arabic":"وَعَنْ سَعْدٍ قَالَ: سُئِلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أَيُّ النَّاسِ أَشَدُّ بَلَاءً؟ قَالَ: «الْأَنْبِيَاء ثمَّ الْمثل فَالْأَمْثَلُ يُبْتَلَى الرَّجُلُ عَلَى حَسَبِ دِينِهِ فَإِنْ كَانَ صلبا فِي دينه اشْتَدَّ بَلَاؤُهُ وَإِنْ كَانَ فِي دِينِهِ رِقَّةٌ هُوِّنَ عَلَيْهِ فَمَا زَالَ كَذَلِكَ حَتَّى يَمْشِيَ على الأَرْض مَال ذَنْبٌ» . رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ حسن صَحِيح","english":{"narrator":"","text":"Sa'd said that when the Prophet was asked which people suffered the greatest affliction he replied, “The prophets, then those who come next to them, then those who come next to them. A man is afflicted in keeping with his religion; if he is firm in his religion his trial is severe, but if there is weakness in his religion it is made light for him, and it continues like that till he walks on the earth having no sin.”\n\nTirmidhi, Ibn Majah and Darimi transmitted it, and Tirmidhi said this is a hasan sahih tradition."}},{"id":41,"idInBook":41,"chapterId":5,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: مَا أَغْبِطُ أَحَدًا بِهَوْنِ مَوْتٍ بَعْدَ الَّذِي رَأَيْتُ مِنْ شِدَّةِ مَوْتِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ. رَوَاهُ التِّرْمِذِيّ وَالنَّسَائِيّ","english":{"narrator":"","text":"‘A isha said, “I do not envy anyone an easy death after having seen the severity of the death of God’s messenger.” \n\nTirmidhi and Nasa’i transmitted it."}},{"id":42,"idInBook":42,"chapterId":5,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ بِالْمَوْتِ وَعِنْدَهُ قَدَحٌ فِيهِ مَاءٌ وَهُوَ يُدْخِلُ يَدَهُ فِي الْقَدَحِ ثُمَّ يَمْسَحُ وَجْهَهُ ثُمَّ يَقُولُ: «اللَّهُمَّ أَعِنِّي عَلَى مُنْكَرَاتِ الْمَوْتِ أَوْ سَكَرَاتِ الْمَوْتِ» . رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ","english":{"narrator":"She said :","text":"I saw the Prophet when he was dying. He had a drinking-cup containing water, and he would put his hand into the cup, then wipe his face, then say, “O God, help me to bear the evils of death,” or, “the pangs of death.” \n\nTirmidhi and Ibn Majah transmitted it."}},{"id":43,"idInBook":43,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا أَرَادَ اللَّهُ تَعَالَى بِعَبْدِهِ الْخَيْرَ عَجَّلَ لَهُ الْعُقُوبَةَ فِي الدُّنْيَا وَإِذَا أَرَادَ اللَّهُ بِعَبْدِهِ الشَّرَّ أَمْسَكَ عَنْهُ بِذَنْبِهِ حَتَّى يُوَافِيَهُ بِهِ يَوْمَ الْقِيَامَةِ» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Anas reported God’s messenger as saying, “When God has a good purpose towards His servant He gives him punishment beforehand in this world, but when He has an evil purpose towards His servant He refrains from dealing with his sin till He takes from him full payment for it on the day of resurrection.” \n\nTirmidhi transmitted it."}},{"id":44,"idInBook":44,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ عِظَمَ الْجَزَاءِ مَعَ عِظَمِ الْبَلَاءِ وَإِنَّ اللَّهَ عَزَّ وَجَلَّ إِذَا أَحَبَّ قَوْمًا ابْتَلَاهُمْ فَمَنْ رَضِيَ فَلَهُ الرِّضَا وَمَنْ سَخِطَ فَلَهُ السَّخَطُ» . رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَه","english":{"narrator":"","text":"He reported God’s messenger as saying, “The magnitude of the reward goes along with the magnitude of the affliction. When God who is great and glorious loves people He afflicts them, and those who accept it gladly receive God’s good pleasure, but those who are displeased receive God’s displeasure. \n\nTirmidhi and Ibn Majah transmitted it."}},{"id":45,"idInBook":45,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَزَالُ الْبَلَاءُ بِالْمُؤْمِنِ أَوِ الْمُؤْمِنَةِ فِي نَفْسِهِ وَمَالِهِ وَوَلَدِهِ حَتَّى يَلْقَى اللَّهَ تَعَالَى وَمَا عَلَيْهِ مِنْ خَطِيئَةٍ» . رَوَاهُ التِّرْمِذِيُّ وَرَوَى مَالِكٌ نَحْوَهُ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ حَسَنٌ صَحِيح","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “The believing man or woman continues to have affliction in person, property and children so that they (this is a little difficult to translate. The Arabic has “he”, but the pronoun refers to the man or woman mentioned. I have therefore compromised by using the plural)  may finally meet God free from sin.” \n\nTirmidhi transmitted it, and Malik transmitted something similar. Tirmidhi said this is a hasan sahih tradition."}},{"id":46,"idInBook":46,"chapterId":5,"bookId":14,"arabic":"وَعَنْ مُحَمَّدِ بْنِ خَالِدٍ السُّلَمِيِّ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ الْعَبْدَ إِذَا سَبَقَتْ لَهُ مِنَ اللَّهِ مَنْزِلَةٌ لَمْ يَبْلُغْهَا بِعَمَلِهِ ابتلاه الله فِي جسده أَفِي مَالِهِ أَوْ فِي وَلَدِهِ ثُمَّ صَبَّرَهُ عَلَى ذَلِكَ يُبَلِّغُهُ الْمَنْزِلَةَ الَّتِي سَبَقَتْ لَهُ مِنَ الله» . رَوَاهُ أَحْمد وَأَبُو دَاوُد","english":{"narrator":"","text":"Muhammad b. Khalid as-Sulami on his father’s authority said his grandfather reported God’s messenger as saying, “When God has previously decreed for a servant a rank which he has not attained by his action, He afflicts him in his body, or his property, or his children. He then enables him to endure that so that He may bring him to the rank previously decreed for him by God.” \n\nAhmad and Abu Dawud transmitted it."}},{"id":47,"idInBook":47,"chapterId":5,"bookId":14,"arabic":"وَعَن عبد الله بن شخير قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مُثِّلَ ابْنُ آدَمَ وَإِلَى جَنْبِهِ تِسْعٌ وَتِسْعُونَ مَنِيَّةً إِنْ أَخْطَأَتْهُ الْمَنَايَا وَقَعَ فِي الْهَرَمِ حَتَّى يَمُوتَ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ غَرِيبٌ","english":{"narrator":"","text":"‘Abdallah b.  Shikhkhir reported God’s messenger as saying, “The son of Adam was created with ninety-nine trials at his side. If the trials miss him he falls into decrepitude till he dies.” \n\nTirmidhi transmitted it, saying that this is a gharib tradition."}},{"id":48,"idInBook":48,"chapterId":5,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَوَدُّ أَهْلُ الْعَافِيَةِ يَوْمَ الْقِيَامَةِ حِينَ يُعْطَى أَهْلُ الْبَلَاءِ الثَّوَابَ لَوْ أَنَّ جُلُودَهُمْ كَانَتْ قُرِضَتْ فِي الدُّنْيَا بِالْمَقَارِيضِ» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Jabir reported God’s messenger as saying, \"On the day of resurrection, when people who have suffered affliction are given their reward, those who are healthy will wish their skins had been cut to pieces with scissors when they were in the world.” \n\nTirmidhi transmitted it, saying that this is a gharib tradition."}},{"id":49,"idInBook":49,"chapterId":5,"bookId":14,"arabic":"وَعَن عَامر الرام قَالَ: ذَكَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْأَسْقَامَ فَقَالَ: «إِنَّ الْمُؤْمِنَ إِذَا أَصَابَهُ السقم ثمَّ أَعْفَاهُ الله مِنْهُ كَانَ كَفَّارَةً لِمَا مَضَى مِنْ ذُنُوبِهِ وَمَوْعِظَةً لَهُ فِيمَا يَسْتَقْبِلُ. وَإِنَّ الْمُنَافِقَ إِذَا مرض ثمَّ أعفي كَانَ كالبعير عَقَلَهُ أَهْلُهُ ثُمَّ أَرْسَلُوهُ فَلَمْ يَدْرِ لِمَ عقلوه وَلم يدر لم أَرْسَلُوهُ» . فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ وَمَا الْأَسْقَامُ؟ وَاللَّهِ مَا مَرِضْتُ قَطُّ فَقَالَ: «قُمْ عَنَّا فلست منا» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"‘Amir ar-Ram told that God’s messenger mentioned illnesses and said, \"When a believer is afflicted by illness and God who is great and glorious cures him of it, it serves as an atonement for his previous sins and a warning to him for the future; but when a hypocrite becomes ill and then is cured he is like a camel which has been tethered and then let loose by its owners, but does not know why they tethered it and why they let it loose.” When a man asked God’s messenger what illnesses were, adding that he swore by God he had never been ill, he said, \"Get up and leave us ; you do not belong to our number.”\n\nAbu Dawud transmitted it."}},{"id":50,"idInBook":50,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا دَخَلْتُمْ عَلَى الْمَرِيضِ فَنَفِّسُوا لَهُ فِي أَجَلِهِ فَإِنَّ ذَلِكَ لَا يَرُدُّ شَيْئًا وَيُطَيِّبُ بِنَفْسِهِ» . رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ غَرِيبٌ","english":{"narrator":"","text":"Abu Sa'id reported God’s messenger as saying, \"When you go in to visit an invalid, express a hope that he will live long. That will not avert anything, but it will comfort him.” \n\nTirmidhl and Ibn Majah transmitted it, and Tirmidhi said this is a gharib tradition."}},{"id":51,"idInBook":51,"chapterId":5,"bookId":14,"arabic":"وَعَن سُلَيْمَان بن صرد قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «مَنْ قَتَلَهُ بَطْنُهُ لَمْ يُعَذَّبْ فِي قَبْرِهِ» رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ غَرِيبٌ","english":{"narrator":"","text":"Sulaiman b. Surad reported God’s messenger as saying, \"He who dies of an internal trouble will not be punished in his grave.” \n\nAhmad and Tirmidhi transmitted it, the latter saying this is a gharib tradition."}},{"id":52,"idInBook":52,"chapterId":5,"bookId":14,"arabic":"عَن أنس قَالَ: كَانَ غُلَامٌ يَهُودِيٌّ يَخْدُمُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَرِضَ فَأَتَاهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعُودُهُ فَقَعَدَ عِنْدَ رَأْسِهِ فَقَالَ لَهُ: «أَسْلِمْ» . فَنَظَرَ إِلَى أَبِيهِ وَهُوَ عِنْدَهُ فَقَالَ: أَطِعْ أَبَا الْقَاسِمِ. فَأَسْلَمَ. فَخَرَجَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَقُولُ: «الْحَمْدُ لِلَّهِ الَّذِي أَنْقَذَهُ مِنَ النَّارِ» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Anas told that when a young Jew who was a servant of the Prophet became ill the Prophet went to visit him and, sitting down by his head, said to him, “Accept Islam.” He looked at his father who was beside him, and he said, \"Obey Abul Qasim.” So he accepted Islam, and the Prophet went out saying, \"Praise be to God who has saved him from hell.” \n\nBukhari transmitted it."}},{"id":53,"idInBook":53,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" مَنْ عَادَ مَرِيضًا نَادَى مُنَادٍ فِي السَّمَاءِ: طِبْتَ وَطَابَ مَمْشَاكَ وَتَبَوَّأْتَ مِنَ الْجَنَّةِ مَنْزِلًا \". رَوَاهُ ابْن مَاجَه","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, '\"If anyone visits an invalid, one cries out from heaven, ‘May you be good, may your walk be good, and may you come to an abode in paradise!”’ \n\nIbn Majah transmitted it."}},{"id":54,"idInBook":54,"chapterId":5,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: إِنَّ عَلِيًّا خَرَجَ مِنْ عِنْدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي وَجَعِهِ الَّذِي تُوُفِّيَ فِيهِ فَقَالَ النَّاسُ: يَا أَبَا الْحَسَنِ كَيْفَ أَصْبَحَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ؟ قَالَ: أَصْبَحَ بِحَمْدِ الله بارئا. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Ibn ‘Abbas said that when ‘Ali came out after visiting the Prophet during the painful illness of which he died, the people asked, “How is God's messenger this morning, Abul Hasan?” He replied, “Praise be to God, he is getting better.” \n\nBukhari transmitted it."}},{"id":55,"idInBook":55,"chapterId":5,"bookId":14,"arabic":"وَعَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ قَالَ: قَالَ لي ابْن عَبَّاس رَضِي الله عَنهُ: أَلا أريك امْرَأَة من أهل الْجنَّة؟ فَقلت: بَلَى. قَالَ: هَذِهِ الْمَرْأَةُ السَّوْدَاءُ أَتَتِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ: إِنِّي أصرع وَإِنِّي أتكشف فَادع الله تَعَالَى لي. قَالَ: «إِنْ شِئْتِ صَبَرْتِ وَلَكِ الْجَنَّةُ وَإِنْ شِئْتِ دَعَوْت الله تَعَالَى أَنْ يُعَافِيَكَ» فَقَالَتْ: أَصْبِرُ فَقَالَتْ: إِنِّي أَتَكَشَّفُ فَادْعُ اللَّهَ أَنْ لَا أَتَكَشَّفَ فَدَعَا لَهَا","english":{"narrator":"‘Ata’ b. Abu Rabah said Ibn ‘Abbas asked whether he would like him to show him a woman who would go to paradise. When he replied that he certainly would, he said:","text":"This black woman came to the Prophet and said, “Messenger of God, I am subject to fits and become uncovered, so make supplication to God for me.” He replied, “If you wish you may endure it and be rewarded with paradise, but if your wish I shall make supplication to God to cure you.” She said, “I shall endure it.” Then she added, “But since I become uncovered, make supplication to God that that may not happen.” He then made supplication for her. \n\n(Bukhari and Muslim.)"}},{"id":56,"idInBook":56,"chapterId":5,"bookId":14,"arabic":"وَعَنْ يَحْيَى بْنِ سَعِيدٍ قَالَ: إِنَّ رَجُلًا جَاءَهُ الْمَوْتُ فِي زَمَنِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ رجل: هيئا لَهُ مَاتَ وَلَمْ يُبْتَلَ بِمَرَضٍ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «وَيْحَكَ وَمَا يُدْرِيكَ لَوْ أَنَّ اللَّهَ ابْتَلَاهُ بِمَرَضٍ فَكَفَّرَ عَنهُ من سيئاته» . رَوَاهُ مَالك مُرْسلا","english":{"narrator":"","text":"Yahya b. Sa'id said that when a certain man died in the time of God’s messenger another said, “Congratulations to him! He has died without being afflicted by illness.” God’s messenger then said, “I’m sorry for you. What do you know about it? (literally, ‘What makes you know?’ After this one understands some such words as, ‘that lack of illness is a mark of honour.’) Would that God had afflicted him with illness, and it had atoned for his evil deeds!” \n\nMalik transmitted it in mursal form."}},{"id":57,"idInBook":57,"chapterId":5,"bookId":14,"arabic":"وَعَن شَدَّاد بن أَوْس والصنابحي أَنَّهُمَا دَخَلَا عَلَى رَجُلٍ مَرِيضٍ يَعُودَانِهِ فَقَالَا لَهُ: كَيفَ أَصبَحت قَالَ أَصبَحت بِنِعْمَة. فَقَالَ لَهُ شَدَّادٌ: أَبْشِرْ بِكَفَّارَاتِ السَّيِّئَاتِ وَحَطِّ الْخَطَايَا فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: \n\" إِنَّ اللَّهَ عَزَّ وَجَلَّ يَقُولُ إِذَا أَنَا ابْتَلَيْتُ عَبْدًا مِنْ عِبَادِي مُؤْمِنًا فَحَمِدَنِي عَلَى مَا ابْتَلَيْتُهُ فَإِنَّهُ يَقُومُ مِنْ مَضْجَعِهِ ذَلِكَ كَيَوْمِ وَلَدَتْهُ أُمُّهُ مِنَ الْخَطَايَا. وَيَقُولُ الرَّبُّ تَبَارَكَ وَتَعَالَى: أَنَا قَيَّدْتُ عَبْدِي وَابْتَلَيْتُهُ فَأَجْرُوا لَهُ مَا كُنْتُمْ تُجْرُونَ لَهُ وَهُوَ صَحِيح \". رَوَاهُ احْمَد","english":{"narrator":"","text":"Shaddad b. Aus and as-Sunabihi told how, when they went to visit an invalid, they said to him, “How are you this morning?” He replied, “I am quite comfortable this morning.” Shaddad told him to rejoice that his evil deeds had been atoned for and his sins remitted, for he had heard God’s messenger declare that God who is great and glorious says, “When I afflict a servant of mine who is a believer and he praises me for the affliction I have brought upon him, he will rise from that couch of his as sinless as he was the day his mother gave birth to him.” The Lord who is blessed and exalted will say, “I fettered and afflicted my servant, so record for him what you were recording for him when he was well.” \n\nAhmad transmitted it."}},{"id":58,"idInBook":58,"chapterId":5,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا كَثُرَتْ ذُنُوبُ الْعَبْدِ وَلَمْ يَكُنْ لَهُ مَا يُكَفِّرُهَا مِنَ الْعَمَلِ ابْتَلَاهُ اللَّهُ بِالْحَزَنِ لِيُكَفِّرَهَا عَنهُ» . رَوَاهُ أَحْمد","english":{"narrator":"","text":"‘A’isha reported God’s messenger as saying, “When a man’s sins are numerous and he has no good deeds wherewith to atone for them, God afflicts him with sorrow to remove them from him.” \n\nAhmad transmitted it."}},{"id":59,"idInBook":59,"chapterId":5,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ عَادَ مَرِيضًا لَمْ يَزَلْ يَخُوضُ الرَّحْمَةَ حَتَّى يَجْلِسَ فَإِذَا جَلَسَ اغتمس فِيهَا» . رَوَاهُ مَالك وَأحمد","english":{"narrator":"","text":"Jabir reported God’s messenger as saying, \"When one visits an invalid he continues to plunge into mercy till he sits down, and when he sits down he is immersed in it.” \n\nMalik and Ahmad transmitted it."}},{"id":60,"idInBook":60,"chapterId":5,"bookId":14,"arabic":"وَعَنْ ثَوْبَانَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" إِذَا أَصَابَ أَحَدَكُمُ الْحُمَّى فَإِنَّ الْحمى قِطْعَة من النَّار فليطفها عَنْهُ بِالْمَاءِ فَلْيَسْتَنْقِعْ فِي نَهْرٍ جَارٍ وَلْيَسْتَقْبِلْ جِرْيَتَهُ فَيَقُولُ: بِسْمِ اللَّهِ اللَّهُمَّ اشْفِ عَبْدَكَ وَصدق رَسُولك بعد صَلَاة الصُّبْح وَقبل طُلُوعِ الشَّمْسِ وَلْيَنْغَمِسْ فِيهِ ثَلَاثَ غَمْسَاتٍ ثَلَاثَةَ أَيَّامٍ فَإِنْ لَمْ يَبْرَأْ فِي ثَلَاثٍ فَخَمْسٍ فَإِنْ لَمْ يَبْرَأْ فِي خَمْسٍ فَسَبْعٍ فَإِنْ لَمْ يَبْرَأْ فِي سَبْعٍ فَتِسْعٍ فَإِنَّهَا لَا تَكَادَ تُجَاوِزُ تِسْعًا بِإِذْنِ اللَّهِ عَزَّ وَجَلَّ \". رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ غَرِيبٌ","english":{"narrator":"","text":"Thauban reported God’s messenger as saying, \"When one of you has an attack of fever the fever is a portion of hell, so he should quench it with water, bathing in a flowing stream facing the direction of the current and saying, ‘In the name of God. O God, heal Thy servant and varify Thy messenger’ after the morning  prayer before sunrise. He should dip himself in it three times a day for three days, and if he is not cured in three days, then for five days, and if he is not cured in five days, then for seven, and if he is not cured in seven days, then for nine, for it will hardly last more than nine days by the permission of God who is great and glorious.” \n\nTirmidhi transmitted it, saying this is a gharib tradition."}},{"id":61,"idInBook":61,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: ذُكِرَتِ الْحُمَّى عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَبَّهَا رَجُلٌ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَسُبَّهَا فَإِنَّهَا تَنْفِي الذُّنُوبَ كَمَا تَنْفِي النَّارُ خَبَثَ الْحَدِيدِ» . رَوَاهُ ابْن مَاجَه","english":{"narrator":"","text":"Abu Huraira said that fever was mentioned in the presence of God’s messenger, and when a man reviled it the Prophet said, \"Do not revile it, for it removes sins as fire removes the dross of iron.” \n\nIbn Majah transmitted it."}},{"id":62,"idInBook":62,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَادَ مَرِيضًا فَقَالَ: \n\" أَبْشِرْ فَإِنَّ اللَّهَ تَعَالَى يَقُولُ: هِيَ نَارِي أُسَلِّطُهَا عَلَى عَبْدِي الْمُؤْمِنِ فِي الدُّنْيَا لِتَكَوُنَ حَظَّهُ مِنَ النَّارِ يَوْمَ الْقِيَامَةِ \". رَوَاهُ أَحْمَدُ وَابْنُ مَاجَهْ والْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَان","english":{"narrator":"","text":"He said that God’s messenger said to an invalid whom he visited, \"Cheer up, for God most high says, ‘It is my fire to which I give power over my believing servant in the world to be his portion of hell on the day of resurrection.” \n\nAhmad, Ibn Majah and Baihaqi, in Shu'ab al- iman, transmitted it."}},{"id":63,"idInBook":63,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَنَسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" إِنَّ الرَّبَّ سُبْحَانَهُ وَتَعَالَى يَقُولُ: وَعِزَّتِي وَجَلَالِي لَا أُخْرِجُ أَحَدًا مِنَ الدُّنْيَا أُرِيد أَغْفِرَ لَهُ حَتَّى أَسْتَوْفِيَ كُلَّ خَطِيئَةٍ فِي عُنُقِهِ بِسَقَمٍ فِي بَدَنِهِ وَإِقْتَارٍ فِي رِزْقِهِ \". رَوَاهُ رزين","english":{"narrator":"","text":"Anas reported God’s messenger as stating that the Lord who is glorious and exalted says, \"By my might and glory, I will not take out of the world anyone I intend to forgive till I get payment for every sin which hangs on his neck by illness in his body and scarcity in his provision.” \n\nRazin transmitted it."}},{"id":64,"idInBook":64,"chapterId":5,"bookId":14,"arabic":"وَعَن شَقِيق قَالَ: مرض عبد الله بن مَسْعُود فَعُدْنَاهُ فَجَعَلَ يَبْكِي فَعُوتِبَ فَقَالَ: إِنِّي لَا أَبْكِي لِأَجْلِ الْمَرَضِ لِأَنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «الْمَرَضُ كَفَّارَةٌ» وَإِنَّمَا أبْكِي أَنه أَصَابَنِي عَلَى حَالِ فَتْرَةٍ وَلَمْ يُصِبْنِي فِي حَال اجْتِهَاد لِأَنَّهُ يكْتب للْعَبد من الْجَرّ إِذَا مَرِضَ مَا كَانَ يُكْتَبُ لَهُ قَبْلَ أَنْ يَمْرَضَ فَمَنَعَهُ مِنْهُ الْمَرَضُ. رَوَاهُ رَزِينٌ","english":{"narrator":"","text":"Shaqiq said he visited ‘Abdallah b. Mas'ud when he was ill, and he began to weep. On being reproved by someone he said, \"I am not weeping because of the illness, because I heard God’s messenger say that illness is an atonement; I am weeping simply because it has come to me when my powers are weakened and did not come when I was active, because a servant of God has recorded for him such reward when he is ill as was being recorded for him before he became ill and the illness prevented him from doing .” \n\nRazln transmitted it."}},{"id":65,"idInBook":65,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَعُودُ مَرِيضًا إِلَّا بَعْدَ ثَلَاثٍ. رَوَاهُ ابْنُ مَاجَهْ وَالْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَانِ","english":{"narrator":"","text":"Anas said the Prophet was not accustomed to visit an invalid till he had been ill for three days. \n\nIbn Majah and Baihaqi, in Shu'ab al- iman, transmitted it."}},{"id":66,"idInBook":66,"chapterId":5,"bookId":14,"arabic":"وَعَنْ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ قَالَ ك قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا دَخَلْتَ عَلَى مَرِيضٍ فَمُرْهُ يَدْعُو لَكَ فَإِنَّ دُعَاءَهُ كَدُعَاءِ الْمَلَائِكَةِ» . رَوَاهُ ابْنُ مَاجَهْ","english":{"narrator":"","text":"‘Umar b. al-Khattab reported God’s messenger as saying, “When you visit an invalid tell him to make supplication for you, for his supplication is like that of the angels.” \n\nIbn Majah transmitted it."}},{"id":67,"idInBook":67,"chapterId":5,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: مِنَ السُّنَّةِ تَخْفِيفُ الْجُلُوسِ وَقِلَّةُ الصَّخَبِ فِي الْعِيَادَةِ عِنْدَ الْمَرِيضِ قَالَ: وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا كَثُرَ لَغَطُهُمْ وَاخْتِلَافُهُمْ: «قُومُوا عَنِّي» رَوَاهُ رزين","english":{"narrator":"","text":"Ibn ‘Abbas said that staying for a short time and making little noise when visiting an invalid is part of the sunna. He reported God’s messenger as saying, when their clamour and disagreement became excessive, ‘‘Get up and leave me.”(This was during the Prophet's last illness, the disagreement taking place regarding the advisability of the Prophet giving them further written instructions.) \n\nRazin transmitted it."}},{"id":68,"idInBook":68,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى الله عَلَيْهِ وَسلم: «العيادة فوَاق نَاقَة»\nوَفِي رِوَايَةِ سَعِيدِ بْنِ الْمُسَيَّبِ مُرْسَلًا: «أَفْضَلُ الْعِيَادَةِ سُرْعَةُ الْقِيَامِ» . رَوَاهُ الْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَان","english":{"narrator":"","text":"Anas reported God's messenger as saying, “A visit should last as long as the time between the two milkings of a she-camel.”(The reference is to the practice of drawing some milk from the camel, then leaving her for a little for her young to suck milk. When she then let her milk flow copiously she was milked again.) In the version of Sa'id b. al-Musayyib in mursal form it says, “The best type of sick visit is when one gets up and departs soon.”(While this is more explicit to one who is not familiar with the milking of camels, the meaning is the same as in the form given by Anas.) \n\nBaihaqi transmitted it in Shu'ab al-iman."}},{"id":69,"idInBook":69,"chapterId":5,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَادَ رَجُلًا فَقَالَ لَهُ: «مَا تستهي؟» قَالَ: أشتهي خبز بر. قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ كَانَ عِنْدَهُ خُبْزُ بُرٍّ فَلْيَبْعَثْ إِلَى أَخِيهِ» . ثُمَّ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا اشْتَهَى مَرِيضُ أحدكُم شَيْئا فليطعمه» . رَوَاهُ ابْن مَاجَه","english":{"narrator":"","text":"Ibn ‘Abbas said the Prophet once visited a  man and asked him what he would like. When he replied that he would like some wheaten bread the Prophet said, “Let anyone who has any wheaten bread send it to his brother,” adding, “When any of you has an invalid who expresses a desire for something, give it to him to eat.” \n\nIbn Majah transmitted it."}},{"id":70,"idInBook":70,"chapterId":5,"bookId":14,"arabic":"وَعَن عبد الله بن عَمْرو قَالَ ك تُوُفِّيَ رَجُلٌ بِالْمَدِينَةِ مِمَّنْ وُلِدَ بِهَا فَصَلَّى عَلَيْهِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «يَا لَيْتَهُ مَاتَ بِغَيْرِ مَوْلِدِهِ» . قَالُوا وَلِمَ ذَاكَ يَا رَسُولَ اللَّهِ؟ قَالَ: «إِنَّ الرَّجُلَ إِذَا مَاتَ بِغَيْرِ مَوْلِدِهِ قِيسَ لَهُ مِنْ مَوْلِدِهِ إِلَى مُنْقَطَعِ أَثَرِهِ فِي الْجَنَّةِ» . رَوَاهُ النَّسَائِيّ وَابْن مَاجَه","english":{"narrator":"","text":"‘Abdallah b. ‘Amr said that when a man who had been born in Medina died there, the Prophet prayed at his funeral and said, “Would that he had died somewhere else than in his birthplace!” On being asked why he had said that he replied, “When a man dies somewhere else than in his birthplace a space will be measured for him in paradise equal to the distance between his birthplace and the place where he died.” \n\nNasa’I  and Ibn Majah transmitted it."}},{"id":71,"idInBook":71,"chapterId":5,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَوْتُ غُرْبَةٍ شَهَادَةٌ» . رَوَاهُ ابْن مَاجَه","english":{"narrator":"","text":"Ibn ‘Abbas reported God’s messenger as saying, “Dying abroad is treated as martyrdom.\" \n\nIbn Majah transmitted it."}},{"id":72,"idInBook":72,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ مَاتَ مَرِيضًا مَاتَ شَهِيدًا أَوْ وُقِيَ فِتْنَةَ الْقَبْرِ وَغُدِيَ وَرِيحَ عَلَيْهِ بِرِزْقِهِ مِنَ الْجَنَّةِ» . رَوَاهُ ابْنُ مَاجَهْ وَالْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَانِ","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “He who dies of an illness dies as a martyr, or he will be guarded from the trial in the grave, and will have his provision brought him morning and evening from paradise.\" \n\nIbn Majah and BaihaqI, in Shu'ab al-iman, transmitted it."}},{"id":73,"idInBook":73,"chapterId":5,"bookId":14,"arabic":"عَن الْعِرْبَاضِ بْنِ سَارِيَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" يَخْتَصِمُ الشُّهَدَاءُ وَالْمُتَوَفَّوْنَ على فرشهم إِلَى رَبنَا فِي الَّذِينَ يُتَوَفَّوْنَ مِنَ الطَّاعُونِ فَيَقُولُ الشُّهَدَاءُ: إِخْوَاننَا قتلوا كَمَا قتلنَا وَيَقُول: المتوفون على فرشهم إِخْوَانُنَا مَاتُوا عَلَى فُرُشِهِمْ كَمَا مِتْنَا فَيَقُولُ رَبنَا: انْظُرُوا إِلَى جراحهم فَإِن أشبهت جراحهم جِرَاحَ الْمَقْتُولِينَ فَإِنَّهُمْ مِنْهُمْ وَمَعَهُمْ فَإِذَا جِرَاحُهُمْ قد أشبهت جراحهم \". رَوَاهُ أَحْمد وَالنَّسَائِيّ","english":{"narrator":"Al'Irbad b. Sariya reported God’s messenger as saying:","text":"The martyrs and those who die on their beds will apply to our Lord who is great and glorious for a decision regarding those who die of plague. The martyrs will say, “Our brethren were killed just as we were and those who died a natural death will say, “Our brethren died on their beds just as we died.”. Our Lord will reply, “Look at their wound, for if their wounds resemble those of people who have been killed they are of their number and will be associated with them, for their wounds have resembled theirs.\" \n\nAhmad and Nasa’i transmitted it."}},{"id":74,"idInBook":74,"chapterId":5,"bookId":14,"arabic":"وَعَنْ جَابِرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الْفَارُّ مِنَ الطَّاعُونِ كَالْفَارِّ مِنَ الزَّحْفِ وَالصَّابِرُ فِيهِ لَهُ أَجْرُ شَهِيدٍ» . رَوَاهُ أَحْمد","english":{"narrator":"","text":"Jabir reported God’s messenger as saying, “He who runs away from plague like him who runs away from battle, but he who meets it with endurance will have a martyr’s reward.\" \n\nAhmad transmitted it."}},{"id":75,"idInBook":75,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَتَمَنَّى أَحَدُكُمُ الْمَوْتَ إِمَّا مُحْسِنًا فَلَعَلَّهُ أَنْ يَزْدَادَ خَيْرًا وَإِمَّا مُسِيئًا فَلَعَلَّهُ أَنْ يستعتب» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, \"None of you must wish for death; neither one who does well, for perhaps he may do still more good, nor one who does ill, for perhaps he may seek to please God.” \n\nBukhari transmitted it."}},{"id":76,"idInBook":76,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَتَمَنَّى أَحَدُكُمُ الْمَوْتَ وَلَا يَدْعُ بِهِ مِنْ قَبْلِ أَنْ يَأْتِيَهُ إِنَّهُ إِذَا مَاتَ انْقَطَعَ أَمَلُهُ وَإِنَّهُ لَا يَزِيدُ الْمُؤْمِنَ عُمْرُهُ إِلَّا خيرا» . رَوَاهُ مُسلم","english":{"narrator":"","text":"He reported God’s messenger as saying, \"None of you must wish or pray for death before it comes to him. When one dies his hope is cut off, but the continued life of a believer only brings him more good.” \n\nMuslim transmitted it."}},{"id":77,"idInBook":77,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" لَا يَتَمَنَّيَنَّ أَحَدُكُمُ الْمَوْتَ مِنْ ضُرٍّ أَصَابَهُ فَإِنْ كَانَ لابد فَاعِلًا فَلْيَقُلِ: اللَّهُمَّ أَحْيِنِي مَا كَانَتِ الْحَيَاةُ خَيْرًا لِي وَتَوَفَّنِي إِذَا كَانَتِ الْوَفَاةُ خَيْرًا لي \"","english":{"narrator":"","text":"Anas reported God's messenger as saying, \"None of you must wish for death because he is afflicted by evil circumstances, but if he cannot help doing so he should say, ‘O God, give me life as long as life is better for me, and take me when death is better for me.’ ” \n\n(Bukhari and Muslim.)"}},{"id":78,"idInBook":78,"chapterId":5,"bookId":14,"arabic":"وَعَنْ عُبَادَةَ بْنِ الصَّامِتِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَحَبَّ لِقَاءَ اللَّهِ أَحَبَّ اللَّهُ لِقَاءَهُ وَمَنْ كَرِهَ لِقَاءَ اللَّهِ كَرِهَ اللَّهُ لِقَاءَهُ» فَقَالَتْ عَائِشَةُ أَوْ بَعْضُ أَزْوَاجِهِ: إِنَّا لَنَكْرَهُ الْمَوْتَ قَالَ: «لَيْسَ ذَلِكَ وَلَكِنَّ الْمُؤْمِنَ إِذَا حَضَرَهُ الْمَوْتُ بُشِّرَ بِرِضْوَانِ اللَّهِ وَكَرَامَتِهِ فَلَيْسَ شَيْءٌ أَحَبَّ إِلَيْهِ مِمَّا أَمَامَهُ فَأَحَبَّ لِقَاءَ اللَّهِ وَأَحَبَّ اللَّهُ لِقَاءَهُ وَإِنَّ الْكَافِرَ إِذَا حضر بشر بِعَذَاب الله وعقوبته فَلَيْسَ شَيْء أكره إِلَيْهِ مِمَّا أَمَامَهُ فَكَرِهَ لِقَاءَ اللَّهِ وَكَرِهَ الله لقاءه»\nوَفِي رِوَايَةِ عَائِشَةَ: «وَالْمَوْتَ قَبْلَ لِقَاء الله»","english":{"narrator":"","text":"‘Ubada b. as-Samit reported God's messenger as saying, \"If anyone wishes to meet God, God wishes to meet him; but if anyone does not wish to meet God, God does not wish to meet him.” When ‘A'isha or one of his wives said she did not want to die, he replied, \"That is not what I mean; but when death comes to a believer he is given glad tidings of God’s good pleasure and regard, so nothing is dearer to him than what lies before him, and he wishes to meet God and God wishes to meet him. But when an infidel approaches death he is given tidings of God’s punishment and chastisement, so nothing is more objectionable to him than what lies before him, and he does not wish to meet God and God does not wish to meet him.” In ‘A’isha's version it says that death precedes the meeting with God.\n\n(Bukhari and Muslim.)"}},{"id":79,"idInBook":79,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَبِي قَتَادَةَ أَنَّهُ كَانَ يُحَدِّثُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُرَّ عَلَيْهِ بِجِنَازَةٍ فَقَالَ: «مُسْتَرِيحٌ أَوْ مُسْتَرَاحٌ مِنْهُ» فَقَالُوا: يَا رَسُولَ اللَّهِ مَا المستريح والمستراح مِنْهُ؟ فَقَالَ: «الْعَبْدُ الْمُؤْمِنُ يَسْتَرِيحُ مِنْ نَصَبِ الدُّنْيَا وَأَذَاهَا إِلَى رَحْمَةِ اللَّهِ وَالْعَبْدُ الْفَاجِرُ يستريح مِنْهُ الْعباد والبلاد وَالشَّجر وَالدَّوَاب»","english":{"narrator":"","text":"Abu Qatada used to tell that when a funeral was brought past God’s messenger he said, \"He is at rest, or others are at rest from him.” When asked what he meant by these words he replied, \"The believing servant is at rest from the toil and harm of the world and departs to God’s mercy, but  servants (i.e.. mankind),  the country, the trees and the animals are at rest from the profligate.” \n\n(Bukhari and Muslim.)"}},{"id":80,"idInBook":80,"chapterId":5,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَ: أَخَذَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَنْكِبِي فَقَالَ: «كُنْ فِي الدُّنْيَا كَأَنَّكَ غَرِيبٌ أَوْ عَابِرُ سَبِيلٍ» . وَكَانَ ابْنُ عُمَرَ يَقُولُ: إِذَا أَمْسَيْتَ فَلَا تَنْتَظِرِ الصَّبَاحَ وَإِذَا أَصْبَحْتَ فَلَا تَنْتَظِرِ الْمَسَاءَ وَخُذْ مِنْ صِحَّتِكَ لِمَرَضِكَ وَمِنْ حياتك لموتك. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"‘Abdallah b. ‘Umar told of God’s messenger taking him by the shoulders and saying, ‘‘Be in the world as though you were a stranger or one who is passing through.” Ibn ‘Umar used to say, “In the evening do not expect to see the morning and in the morning do not expect to see the evening, but take something when in health to serve you in time of illness and something in your life to serve you in your death.” \n\nBukhari transmitted it."}},{"id":81,"idInBook":81,"chapterId":5,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَبْلَ مَوْتِهِ بِثَلَاثَةِ أَيَّامٍ يَقُولُ: «لَا يَمُوتَنَّ أَحَدُكُمْ إِلَّا وَهُوَ يُحْسِنُ الظَّنَّ بِاللَّه» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Jabir said he heard God’s messenger say three days before his death, “See that none of you dies without having good expectations from God.” \n\nMuslim transmitted it."}},{"id":82,"idInBook":82,"chapterId":5,"bookId":14,"arabic":"عَنْ مُعَاذِ بْنِ جَبَلٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِن شِئْتُم أنبأتكم مَا أَوَّلُ مَا يَقُولُ اللَّهُ لِلْمُؤْمِنِينَ يَوْمَ الْقِيَامَةِ؟ وَمَا أَوَّلُ مَا يَقُولُونَ لَهُ؟» قُلْنَا: نَعَمْ يَا رَسُولَ اللَّهِ قَالَ: \n\" إِنَّ اللَّهَ يَقُول للْمُؤْمِنين هَل أَحْبَبْتُم لقائي؟ فَيَقُولُونَ نَعَمْ يَا رَبَّنَا فَيَقُولُ: لِمَ؟ فَيَقُولُونَ: رَجَوْنَا عَفْوَكَ وَمَغْفِرَتَكَ. فَيَقُولُ: قَدْ وَجَبَتْ لَكُمْ مَغْفِرَتِي \". رَوَاهُ فِي شَرْحِ السُّنَّةِ وَأَبُو نُعَيْمٍ فِي الْحِلْية","english":{"narrator":"","text":"Mu'adh b. Jabal told of God’s messenger saying that if they wished he would tell them the first thing God would say to the believers on the day of resurrection and the first thing they would say to Him. When his hearers expressed a desire to be told, he said that God would say to the believers, “Did you wish to meet me?” and that they would reply, “Yes, our Lord.” He would ask them why, and they would reply that it was because they hoped for His forgiveness and pardon. He would then say, “My forgiveness has become necessary for you.” \n\n transmitted it in Sharh as-sunna and Abu Nu'aim in al-Hilya."}},{"id":83,"idInBook":83,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَكْثِرُوا ذِكْرَ هَاذِمِ اللَّذَّاتِ الْمَوْتِ» . رَوَاهُ التِّرْمِذِيُّ وَالنَّسَائِيّ وَابْن مَاجَه","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “Keep much in your remembrance the cutter off of delights, i.e., death.” \n\nTirmidhi, Nasa'i and Ibn Majah transmitted it."}},{"id":84,"idInBook":84,"chapterId":5,"bookId":14,"arabic":"وَعَنِ ابْنِ مَسْعُودٍ أَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ ذَاتَ يَوْمٍ لِأَصْحَابِهِ: «اسْتَحْيُوا مِنَ اللَّهِ حَقَّ الْحَيَاءِ» قَالُوا: إِنَّا نَسْتَحْيِي مِنَ اللَّهِ يَا نَبِيَّ اللَّهِ وَالْحَمْدُ لِلَّهِ قَالَ: «لَيْسَ ذَلِكَ وَلَكِنَّ مَنِ اسْتَحْيَى مِنَ اللَّهِ حَقَّ الْحَيَاءِ فَلْيَحْفَظِ الرَّأْسَ وَمَا وَعَى وَلْيَحْفَظِ الْبَطْنَ وَمَا حَوَى وَلْيَذْكُرِ الْمَوْتُ وَالْبِلَى وَمَنْ أَرَادَ الْآخِرَةَ تَرَكَ زِينَةَ الدُّنْيَا فَمَنْ فَعَلَ ذَلِكَ فَقَدِ اسْتَحْيَى مِنَ اللَّهِ حَقَّ الْحَيَاءِ» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ غَرِيبٌ","english":{"narrator":"","text":"Ibn Mas'ud told of the Prophet saying to his companions one day, “Show due respect towards God.” On their replying, “Prophet of God, we show due respect towards God, praise be to God,” he said, “That is not what I mean; but he who shows due respect to God must guard the head and what it retains, must guard the belly and what it contains, and keep death and decay in remembrance; and he who desires the next world must abandon the adornment of this world. He who does that has shown due respect towards God.” \n\nAhmad and Tirmidhi transmitted it, the latter saying this is a gharib tradition."}},{"id":85,"idInBook":85,"chapterId":5,"bookId":14,"arabic":"وَعَن عبد الله بن عَمْرو قَالَ ك قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «تُحْفَةُ الْمُؤْمِنِ الْمَوْتُ» . رَوَاهُ الْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَان","english":{"narrator":"","text":"‘Abdallah b. ‘Amr reported God’s messenger as saying, ‘‘The gift to a believer is death.”( i.e. death is the means by which he gains an introduction to the delights of paradise.) \n\nBaihaqi transmitted it in Shu'ab al-iman."}},{"id":86,"idInBook":86,"chapterId":5,"bookId":14,"arabic":"وَعَنْ بُرَيْدَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْمُؤْمِنُ يَمُوتُ بِعَرَقِ الْجَبِينِ» . رَوَاهُ التِّرْمِذِيّ وَالنَّسَائِيّ وَابْن مَاجَه","english":{"narrator":"","text":"Buraida reported God’s messenger as saying, “The believer dies with the sweat on his brow.” \n\nTirmidhi, Nasa'i and Ibn Majah transmitted it."}},{"id":87,"idInBook":87,"chapterId":5,"bookId":14,"arabic":"وَعَنْ عُبَيْدِ اللَّهِ بْنِ خَالِدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَوْتُ الْفُجَاءَة أَخْذَةُ الْأَسَفِ» . رَوَاهُ أَبُو دَاوُدَ وَزَادَ الْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَانِ وَرَزِينٌ فِي كِتَابِهِ: «أَخْذَةُ الأسف للْكَافِرِ وَرَحْمَة لِلْمُؤمنِ»","english":{"narrator":"","text":"‘Ubaidallah b Khalid reported God’s messenger as saying, “Sudden death is an act of punishment out of anger.” Abu Dawud transmitted it. \n\nBaihaqi in Shu'ab al-iman  and Razin in his book made an addition, saying “An act of punishment out of anger for the infidel and a mercy for the believer.”"}},{"id":88,"idInBook":88,"chapterId":5,"bookId":14,"arabic":"وَعَن أنس قَالَ: دخل النَّبِي عَلَى شَابٍّ وَهُوَ فِي الْمَوْتِ فَقَالَ: «كَيْفَ تجدك؟» قَالَ: أرجوالله يَا رَسُولَ اللَّهِ وَإِنِّي أَخَافُ ذُنُوبِي فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَجْتَمِعَانِ فِي قَلْبِ عَبْدٍ فِي مِثْلِ هَذَا الْمَوْطِنِ إِلَّا أَعْطَاهُ اللَّهُ مَا يَرْجُو وَآمَنَهُ مِمَّا يَخَافُ» . رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ وَقَالَ التِّرْمِذِيُّ هَذَا حَدِيث غَرِيب","english":{"narrator":"","text":"Anas said that the Prophet visited a young man who was dying and asked him how he was. He replied, “I am hoping in God, messenger of God, but I am afraid of my sins,” whereupon God's messenger said, “The two cannot come together in a man’s heart at such a time without God giving him what he hopes for and granting him security from what he fears.”\n\nTirmidhi and Ibn Majah transmitted it, Tirmidhi saying that this is a gharib tradition."}},{"id":89,"idInBook":89,"chapterId":5,"bookId":14,"arabic":"عَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَمَنَّوُا الْمَوْتَ فَإِنَّ هَوْلَ الْمُطَّلَعِ شَدِيدٌ وَإِنَّ مِنَ السَّعَادَةِ أَنْ يَطُولَ عُمْرُ الْعَبْدِ وَيَرْزُقَهُ اللَّهُ عَزَّ وَجَلَّ الْإِنَابَة» . رَوَاهُ أَحْمد","english":{"narrator":"","text":"Jabir reported God’s messenger as saying, “Do not wish for death, for the terror of the place whence one looks down in severe. It is part of a man’s happiness that his life should be long and God who is great and glorious should supply him with repentance.” \n\nAhmad transmitted it."}},{"id":90,"idInBook":90,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَبِي أُمَامَةَ قَالَ: جَلَسْنَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَّرَنَا وَرَقَّقَنَا فَبَكَى سَعْدُ بْنُ أَبِي وَقَّاصٍ فَأَكْثَرَ الْبُكَاءَ فَقَالَ: يَا لَيْتَنِي مِتُّ. فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَا سَعْدُ أَعِنْدِي تَتَمَنَّى الْمَوْتَ؟» فَرَدَّدَ ذَلِكَ ثَلَاثَ مَرَّاتٍ ثُمَّ قَالَ: «يَا سَعْدُ إِنْ كُنْتَ خُلِقْتَ لِلْجَنَّةِ فَمَا طَالَ عُمْرُكَ وَحَسُنَ مِنْ عَمَلِكَ فَهُوَ خَيْرٌ لَك» . رَوَاهُ أَحْمد","english":{"narrator":"Abu Umama said:","text":"We sat attentive to God’s messenger who gave us an exhortation and softened our hearts. Then Sa'd b. Abu Waqqas wept copiously and said, “Would that I were dead! ” God’s messenger said, “Do you wish for death in my presence, Sa'd?’’ repeating it three times. He then said, “Sa'd, if you have been created for paradise, it will be better for you if your life is prolonged and your deeds are good.” \n\nAhmad transmitted it."}},{"id":91,"idInBook":91,"chapterId":5,"bookId":14,"arabic":"عَن حَارِثَةَ بْنِ مُضَرَّبٍ قَالَ: دَخَلْتُ عَلَى خَبَّابٍ وَقَدِ اكْتَوَى سَبْعًا فَقَالَ: لَوْلَا أَنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُول: «لَا يَتَمَنَّ أَحَدُكُمُ الْمَوْتَ» لَتَمَنَّيْتُهُ. وَلَقَدْ رَأَيْتُنِي مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا أَمْلِكُ دِرْهَمًا وَإِنَّ فِي جَانِبِ بَيْتِيَ الْآنَ لَأَرْبَعِينَ أَلْفَ دِرْهَمٍ قَالَ ثُمَّ أُتِيَ بِكَفَنِهِ فَلَمَّا رَآهُ بَكَى وَقَالَ لَكِنَّ حَمْزَةَ لَمْ يُوجَدْ لَهُ كَفَنٌ إِلَّا بُرْدَةٌ مَلْحَاءُ إِذَا جُعِلَتْ عَلَى رَأْسِهِ قَلَصَتْ عَنْ قَدَمَيْهِ وَإِذَا جُعِلَتْ عَلَى قَدَمَيْهِ قَلَصَتْ عَنْ رَأْسِهِ حَتَّى مُدَّتْ عَلَى رَأْسِهِ وَجُعِلَ عَلَى قَدَمَيْهِ الْإِذْخِرُ. رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ إِلَّا أَنَّهُ لَمْ يذكر: ثمَّ أُتِي بكفنه إِلَى آخِره","english":{"narrator":"","text":"Haritha b. Mudarrab said he visited Khabbab who had been cauterised seven times. He said that were it not for the fact that he had heard God’s messenger say that no one must wish for death he would wish for it. He added, “I have seen myself in the company of God’s messenger when I did not possess a dirham, but now there are 40,000 dirhams in my house.” His shroud was produced, and when he saw it he wept and said, “No shroud was found for Hamza (the Prophet’s uncle. He was killed at Uhud and his remains were treated with indignity by Hind.) but a garment with black and white stripes, which did not reach his feet when put over his head and did not reach his head when put over his feet. It was eventually stretched over his head and grass was put on his feet.” \n\nAhmad and Tirmidhi transmitted it, but Tirmidhi did not include the passage from “His shroud was produced” to the end."}},{"id":92,"idInBook":92,"chapterId":5,"bookId":14,"arabic":"عَنْ أَبِي سَعِيدٍ وَأَبِي هُرَيْرَةَ قَالَا: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَقِّنُوا مَوْتَاكُمْ لَا إِلَهَ إِلَّا اللَّهُ» . رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"Abu Sa'id and Abu Huraira reported God's messenger as saying, “Recite to those of you who are dying, ‘There is no god but God. ’ ” \n\nMuslim transmitted it."}},{"id":93,"idInBook":93,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أُمِّ سَلَمَةَ قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا حَضَرْتُمُ الْمَرِيضَ أَو الْمَيِّت فَقولُوا خيرا فَإِن الْمَلَائِكَةَ يُؤَمِّنُونَ عَلَى مَا تَقُولُونَ» . رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"Umm Salama reported God’s messenger as saying, “When you are with one who is ill or dying speak good words, for the angels say Amen to what you say.” \n\nMuslim transmitted it."}},{"id":94,"idInBook":94,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أُمِّ سَلَمَةَ قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" مَا مِنْ مُسْلِمٍ تُصِيبُهُ مُصِيبَةٌ فَيَقُولُ مَا أَمَرَهُ اللَّهُ بِهِ: (إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ)\nاللَّهُمَّ أَجِرْنِي فِي مُصِيبَتِي وَاخْلُفْ لِي خَيْرًا مِنْهَا إِلَّا أَخْلَفَ اللَّهُ لَهُ خَيْرًا مِنْهَا \". فَلَمَّا مَاتَ أَبُو سَلمَة قَالَت: أَيُّ الْمُسْلِمِينَ خَيْرٌ مِنْ أَبِي سَلَمَةَ؟ أَوَّلُ بَيْتِ هَاجَرَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ إِنِّي قُلْتُهَا فَأَخْلَفَ اللَّهُ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ. رَوَاهُ مُسلم","english":{"narrator":"","text":"She reported God’s messenger as saying, “If any Muslim who suffers some calamity says what God has commanded him, ‘We belong to God and to Him do we return ; O God, reward me for my affliction and give me something better than it in exchange for it,’ God will give him something better than it in exchange.” When Abu Salama died she said, “What Muslim is better than Abu Salama whose family was the first to emigrate to God’s messenger? ”(He and his wife, Umm Salama, were among those who emigrated to Abyssinia. Abu Salama died of wounds received at the battle of Uhud, and the Prophet later married Umm Salama.) She then said the words, and God gave her God’s messenger in exchange. \n\nMuslim transmitted it."}},{"id":95,"idInBook":95,"chapterId":5,"bookId":14,"arabic":"وَعَن أُمِّ سَلَمَةَ قَالَتْ: دَخَلَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى أبي سَلمَة قد شَقَّ بَصَرَهُ فَأَغْمَضَهُ ثُمَّ قَالَ: «إِنَّ الرُّوحَ إِذَا قُبِضَ تَبِعَهُ الْبَصَرُ» فَضَجَّ نَاسٌ مِنْ أَهْلِهِ فَقَالَ: «لَا تَدْعُوا عَلَى أَنْفُسِكُمْ إِلَّا بِخَير فَإِن الْمَلَائِكَة يُؤمنُونَ على ماتقولون» ثُمَّ قَالَ: «اللَّهُمَّ اغْفِرْ لِأَبِي سَلَمَةَ وَارْفَعْ دَرَجَتَهُ فِي الْمَهْدِيِّينَ وَاخْلُفْهُ فِي عَقِبِهِ فِي الْغَابِرِينَ وَاغْفِرْ لَنَا وَلَهُ يَا رَبَّ الْعَالَمِينَ وَأَفْسِحْ لَهُ فِي قَبْرِهِ وَنَوِّرْ لَهُ فِيهِ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"She said that God’s messenger came in to Abu Salama when his eyes were fixedly open. Closing them he said, “When the soul is taken the sight follows it.” Some of his family wept and wailed, so he said, “Do not supplicate for yourselves anything but good, for the angels say Amen to what you say.” He then said, “O God, forgive Abu Salama, raise his degree among those who are rightly guided, and grant him a succession in his descendants who remain. Forgive both us and him, Lord of the universe, make his grave spacious for him and grant him light in it.” \n\nMuslim transmitted it."}},{"id":96,"idInBook":96,"chapterId":5,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ قَالَتْ: إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ تُوُفِّيَ سجي بِبرد حبرَة","english":{"narrator":"","text":"‘A’isha said that when God’s messenger died he was covered with a striped Yemen garment.\n\n (Bukharl and Muslim.)"}},{"id":97,"idInBook":97,"chapterId":5,"bookId":14,"arabic":"عَنْ مُعَاذِ بْنِ جَبَلٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ كَانَ آخِرُ كَلَامِهِ لَا إِلَهَ إِلَّا اللَّهُ دَخَلَ الْجَنَّةَ» رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Mu`adh b. Jabal reported God’s messenger as saying, “If anyone’s last words are ‘There is no god but God,’ he will enter paradise.” \n\nAbu Dawud transmitted it."}},{"id":98,"idInBook":98,"chapterId":5,"bookId":14,"arabic":"وَعَنْ مَعْقِلِ بْنِ يَسَارٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «اقرؤوا سُورَةَ (يس)\nعَلَى مَوْتَاكُمْ» . رَوَاهُ أَحْمَدُ وَأَبُو دَاوُد وَابْن مَاجَه","english":{"narrator":"","text":"Ma'qil b. Yasar reported God’s messenger as saying, “Recite sura. Ya Sin(Qur’an, xxxvi) over your dead.”(This is a literal translation. The meaning is probably those who are on the point of death.) \n\nAhmad, Abu Dawud and Ibn Majah transmitted it."}},{"id":99,"idInBook":99,"chapterId":5,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ قَالَتْ: إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَبَّلَ عُثْمَانَ بْنَ مَظْعُونٍ وَهُوَ مَيِّتٌ وَهُوَ يَبْكِي حَتَّى سَالَ دُمُوعُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى وَجْهِ عُثْمَانَ. رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ","english":{"narrator":"","text":"‘A’isha said that God’s messenger kissed ‘Uthman b. Maz'un (The first of the Emigrants to die in Medina after returning from Badr) when he was dead, and the Prophet wept so much that his tears flowed over ‘Uthman's face. \n\nTirmidhl, Abu Dawud and Ibn Majah transmitted it."}},{"id":100,"idInBook":100,"chapterId":5,"bookId":14,"arabic":"وَعَن عَائِشَةَ قَالَتْ: إِنَّ أَبَا بَكْرٍ قَبَّلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ مَيِّتٌ. رَوَاهُ التِّرْمِذِيّ وَابْن مَاجَه","english":{"narrator":"","text":"She said that Abu Bakr kissed the Prophet when he was dead. \n\nTirmidhi and Ibn Majah transmitted it."}},{"id":101,"idInBook":101,"chapterId":5,"bookId":14,"arabic":"وَعَنْ حُصَيْنِ بْنِ وَحْوَحٍ أَنَّ طَلْحَةَ بْنَ الْبَرَاءِ مَرِضَ فَأَتَاهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعُودُهُ فَقَالَ: «إِنِّي لَا أَرَى طَلْحَةَ إِلَّا قَدْ حَدَثَ بِهِ الْمَوْتُ فَآذِنُونِي بِهِ وَعَجِّلُوا فَإِنَّهُ لَا يَنْبَغِي لِجِيفَةِ مُسْلِمٍ أَنْ تُحْبَسَ بَيْنَ ظَهْرَانَيْ أَهْلِهِ» . رَوَاهُ أَبُو دَاوُدَ","english":{"narrator":"","text":"Husain b. Wahwah said that when Talha b. al-Bara’(He was a youth belonging to Medina who pleased the Prophet by his desire to do whatever he commanded) was ill the Prophet came to visit him and said, “I cannot help feeling that Talha’s death is near; so tell me when it occurs and hasten the funeral preparations, for it is not fitting that the corpse of a Muslim should be detained among his family.” \n\nAbu Dawud transmitted it."}},{"id":102,"idInBook":102,"chapterId":5,"bookId":14,"arabic":"وَعَن عَبْدِ اللَّهِ بْنِ جَعْفَرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَقِّنُوا مَوْتَاكُمْ لَا إِلَهَ إِلَّا اللَّهُ الْحَلِيمُ الْكَرِيمُ سُبْحَانَ اللَّهِ رَبِّ الْعَرْشِ الْعَظِيمِ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ» قَالُوا: يَا رَسُولَ اللَّهِ كَيْفَ لِلْأَحْيَاءِ؟ قَالَ: «أَجود وأجود» . رَوَاهُ ابْن مَاجَه","english":{"narrator":"‘Abdallah b. Ja'far reported God’s messenger assaying:","text":"Recite to those of you who die, “There is no god but God, the Clement, the Beneficent; glory be to God the Lord of the mighty throne; praise be to God the Lord of the universe.” On being asked what is appropriate for the living, he replied that these words were better and better. \n\nIbn Majah transmitted it."}},{"id":103,"idInBook":103,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: الْمَيِّتُ تَحْضُرُهُ الْمَلَائِكَةُ فَإِذَا كَانَ الرَّجُلُ صَالِحًا قَالُوا: اخْرُجِي أَيَّتُهَا النَّفْسُ الطَّيِّبَةُ كَانَتْ فِي الْجَسَدِ الطَّيِّبِ اخْرُجِي حَمِيدَةً وَأَبْشِرِي بِرَوْحٍ وَرَيْحَانٍ وَرَبٍّ غَيْرِ غَضْبَانَ فَلَا تَزَالُ يُقَالُ لَهَا ذَلِكَ حَتَّى تَخْرُجَ ثُمَّ يُعْرَجُ بِهَا إِلَى السَّمَاءِ فَيُفْتَحَ لَهَا فَيُقَالُ: مَنْ هَذَا؟ فَيَقُولُونَ: فُلَانٌ فَيُقَالُ: مَرْحَبًا بِالنَّفسِ الطّيبَة كَانَت فِي الْجَسَدِ الطَّيِّبِ ادْخُلِي حَمِيدَةً وَأَبْشِرِي بِرَوْحٍ وَرَيْحَانٍ وَرَبٍّ غَيْرِ غَضْبَانَ فَلَا تَزَالُ يُقَالُ لَهَا ذَلِكَ حَتَّى تَنْتَهِيَ إِلَى السَّمَاءِ الَّتِي فِيهَا اللَّهُ فَإِذَا كَانَ الرَّجُلُ السُّوءُ قَالَ: اخْرُجِي أَيَّتُهَا النَّفْسُ الْخَبِيثَةُ كَانَتْ فِي الْجَسَدِ الْخَبِيثِ اخْرُجِي ذَمِيمَةً وَأَبْشِرِي بِحَمِيمٍ وَغَسَّاقٍ وَآخَرَ مِنْ شَكْلِهِ أَزْوَاجٌ فَمَا تَزَالُ يُقَالُ لَهَا ذَلِكَ حَتَّى تَخْرُجَ ثُمَّ يُعْرَجُ بِهَا إِلَى السَّمَاءِ فَيُفْتَحُ لَهَا فَيُقَالُ: مَنْ هَذَا؟ فَيُقَالُ: فُلَانٌ فَيُقَالُ: لَا مَرْحَبًا بِالنَّفْسِ الْخَبِيثَةِ كَانَتْ فِي الْجَسَدِ الْخَبِيثِ ارْجِعِي ذَمِيمَةً فَإِنَّهَا لَا تفتح لَهُ أَبْوَابُ السَّمَاءِ فَتُرْسَلُ مِنَ السَّمَاءِ ثُمَّ تَصِيرُ إِلَى الْقَبْر \". رَوَاهُ ابْن مَاجَه","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “The angels are present with one who dies, and if a man is good they say, ‘Come out, good soul, which was in the good body; come out praiseworthy and be happy with rest and provision and a Lord who is not angry.’ That continues to be said to it till it comes out. It is then taken up to heaven and the door is opened for it. The angels are asked who this is and reply that he is so and so, whereupon these words are spoken, ‘Welcome, good soul, which was in the good body; enter praiseworthy and be happy with rest and provision(Cf. Qur'an, lvi, 89) and a Lord who is not angry.’ That continues to be said to it till it comes to the heaven in which God is. But when it is a bad man what is said is, ‘Come out, wicked soul, which was in the wicked body; come out blameworthy and be grieved by a boiling liquid, one dark and intensely cold (Cf. Qur’an, xxxviii, 57) and other kinds of its type.’ That continues to be said to it till it comes out. It is then taken up to heaven and the door is opened for it. The question will be asked who this is and the reply given that it is so and so, whereupon these words are spoken, 'There is no welcome for the wicked soul which was in the wicked body; go back blameworthy, for the gates of heaven will not be opened for you.' It will then be sent away from heaven and come to the grave.” \n\nIbn Majah transmitted it."}},{"id":104,"idInBook":104,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا خَرَجَتْ رُوحُ الْمُؤْمِنِ تَلَقَّاهَا مَلَكَانِ يُصْعِدَانِهَا» . قَالَ حَمَّادٌ: فَذَكَرَ مِنْ طِيبِ رِيحِهَا وَذَكَرَ الْمِسْكَ قَالَ: \" وَيَقُولُ أَهْلُ السَّمَاءِ: رُوحٌ طَيِّبَةٌ جَاءَتْ مِنْ قِبَلِ الْأَرْضِ صَلَّى اللَّهُ عَلَيْكِ وَعَلَى جَسَدٍ كُنْتِ تُعَمِّرِينَهُ فَيُنْطَلَقُ بِهِ إِلَى رَبِّهِ ثُمَّ يَقُولُ: انْطَلِقُوا بِهِ إِلَى آخِرِ الْأَجَلِ \". قَالَ: «وَإِنَّ الْكَافِرَ إِذَا خَرَجَتْ رُوحُهُ» قَالَ حَمَّادٌ: وَذَكَرَ من نتنها وَذكر لعنها. \" وَيَقُولُ أَهْلُ السَّمَاءِ: رُوحٌ خَبِيثَةٌ جَاءَتْ مِنْ قِبَلِ الْأَرْضِ فَيُقَالُ: انْطَلِقُوا بِهِ إِلَى آخِرِ الْأَجَل \" قَالَ أَبُو هُرَيْرَة: فَرد رَسُول الله صلى الله عَلَيْهِ وَسلم ريطة كَانَت عَلَيْهِ على أَنفه هَكَذَا. رَوَاهُ مُسلم","english":{"narrator":"","text":"He reported God’s messenger as saying, “When the soul of a believer comes out, two angels meet it and take it up.” Hammad said he mentioned some of the fragrance of its odour and made mention of musk, and said, “The inhabitants of heaven will say, ‘A good soul has come from the earth. God bless you and a body which you inhabited!' He will then be taken to his Lord who will tell them to take him away till the end of the appointed time.\"(A reference to the day of resurrection. Cf. Qur’an, vi, 2) He said, “When an infidel’s soul comes out (Hammad saying that he mentioned some of its stench and made mention of cursing), the inhabitants of heaven say, ‘A wicked soul has come from the earth,’ and they will be told to take him away till the end of the appointed time.\" Abu Huraira said that God’s messenger then put a seamless garment he was wearing over his nose thus( This would be indicated by putting his garment over his nose).\n\nMuslim transmitted it."}},{"id":105,"idInBook":105,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" إِذَا حُضِرَ الْمُؤْمِنُ أَتَتْ مَلَائِكَةُ الرَّحْمَةِ بِحَرِيرَةٍ بَيْضَاءَ فَيَقُولُونَ: اخْرُجِي رَاضِيَةً مَرْضِيًّا عَنْكِ إِلَى رَوْحِ اللَّهِ وَرَيْحَانٍ وَرَبٍّ غَيْرِ غَضْبَانَ فَتَخْرُجُ كَأَطْيَبِ رِيحِ الْمِسْكِ حَتَّى إِنَّهُ لَيُنَاوِلُهُ بَعْضُهُمْ بَعْضًا حَتَّى يَأْتُوا بِهِ أَبْوَابَ السَّمَاءِ فَيَقُولُونَ: مَا أَطْيَبَ هَذِهِ الرِّيحَ الَّتِي جَاءَتْكُمْ مِنَ الْأَرْضِ فَيَأْتُونَ بِهِ أَرْوَاحَ الْمُؤْمِنِينَ فَلَهُمْ أَشَدُّ فَرَحًا بِهِ مِنْ أَحَدِكُمْ بِغَائِبِهِ يَقْدُمُ عَلَيْهِ فَيَسْأَلُونَهُ: مَاذَا فَعَلَ فُلَانٌ مَاذَا فَعَلَ فُلَانٌ؟ فَيَقُولُونَ: دَعُوهُ فَإِنَّهُ كَانَ فِي غَمِّ الدُّنْيَا. فَيَقُولُ: قَدْ مَاتَ أَمَا أَتَاكُمْ؟ فَيَقُولُونَ: قَدْ ذُهِبَ بِهِ إِلَى أُمِّهِ الْهَاوِيَةِ. وَإِنَّ الْكَافِرَ إِذَا احْتُضِرَ أَتَتْهُ مَلَائِكَةُ الْعَذَابِ بِمِسْحٍ فَيَقُولُونَ: أَخْرِجِي ساخطة مسخوطا عَلَيْكِ إِلَى عَذَابِ اللَّهِ عَزَّ وَجَلَّ. فَتَخْرُجُ كأنتن ريح جيفة حَتَّى يأْتونَ بِهِ بَابِ الْأَرْضِ فَيَقُولُونَ: مَا أَنْتَنَ هَذِهِ الرِّيحَ حَتَّى يَأْتُونَ بِهِ أَرْوَاحَ الْكُفَّارِ \". رَوَاهُ أَحْمَدُ وَالنَّسَائِيّ","english":{"narrator":"","text":"He reported God’s messenger as saying, “When a believer’s death is near the angels of mercy bring a piece of white silk and say, ‘Come out pleased and accepted to God’s rest and provision and to a Lord who is not angry.’ Then the soul comes out with a fragrance like that of the sweetest musk, they pass him from one to another till they bring him to the gates of heaven, and say, ‘How sweet is this fragrance which has come to you from the earth.’ Then they bring him to the souls of the believers, and they are happier over seeing him than any of you are when one who has been away from home comes back. They ask him, ‘How is so and so? How is so and so?’ Then they say, ‘Leave him alone just now, for he has just come from the grief of the world. He replies, ‘He has died. Has he not come to you?' and they say, ‘He has been taken to his destination, the pit.'(Cf. Qur’an, ci, 9) When an infidel's death is near the angels of punishment bring him hair-cloth and say, ‘Come out, displeased and subject to displeasure, to the punishment from God who is great and glorious.' The soul comes out with a stench like the most unpleasant stench of a corpse, they take him to the gate of the earth (The meaning is probably the gate to the lowest heaven) and say, ‘How offensive is this odour !’ They finally bring him to the souls of the infidels.\" \n\nAhmad and Nasa’i transmitted it."}},{"id":106,"idInBook":106,"chapterId":5,"bookId":14,"arabic":"وَعَنِ الْبَرَاءِ بْنِ عَازِبٍ قَالَ: خَرَجْنَا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي جَنَازَة رَجُلٍ مِنَ الْأَنْصَارِ فَانْتَهَيْنَا إِلَى الْقَبْرِ وَلَمَّا يُلْحَدْ فَجَلَسَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَجَلَسْنَا حوله كَأَن على رؤوسنا الطَّيْرَ وَفِي يَدِهِ عُودٌ يَنْكُتُ بِهِ فِي الْأَرْضِ فَرَفَعَ رَأْسَهُ فَقَالَ: «اسْتَعِيذُوا بِاللَّهِ مِنْ عَذَابِ الْقَبْرِ» مَرَّتَيْنِ أَوْ ثَلَاثًا ثُمَّ قَالَ: \" إِنَّ الْعَبْدَ الْمُؤْمِنَ إِذَا كَانَ فِي انْقِطَاعٍ مِنَ الدُّنْيَا وَإِقْبَالٍ مِنَ الْآخِرَةِ نَزَلَ إِلَيْهِ من السَّمَاء مَلَائِكَة بِيضُ الْوُجُوهِ كَأَنَّ وُجُوهَهُمُ الشَّمْسُ مَعَهُمْ كَفَنٌ مِنْ أَكْفَانِ الْجَنَّةِ وَحَنُوطٌ مِنْ حَنُوطِ الْجَنَّةِ حَتَّى يَجْلِسُوا مِنْهُ مَدَّ الْبَصَرِ ثُمَّ يَجِيءُ مَلَكُ الْمَوْتِ حَتَّى يَجْلِسَ عِنْدَ رَأْسِهِ فَيَقُولُ: أَيَّتُهَا النَّفْسُ الطَّيِّبَةُ اخْرُجِي إِلَى مَغْفِرَةٍ مِنَ الله ورضوان \" قَالَ: «فَتَخْرُجُ تَسِيلُ كَمَا تَسِيلُ الْقَطْرَةُ مِنَ فِي السِّقَاءِ فَيَأْخُذُهَا فَإِذَا أَخَذَهَا لَمْ يَدَعُوهَا فِي يَدِهِ طَرْفَةَ عَيْنٍ حَتَّى يَأْخُذُوهَا فَيَجْعَلُوهَا فِي ذَلِكَ الْكَفَنِ وَفِي ذَلِكَ الْحَنُوطِ وَيَخْرُجُ مِنْهَا كَأَطْيَبِ نَفْحَةِ مِسْكٍ وُجِدَتْ عَلَى وَجْهِ الْأَرْضِ» قَالَ: \" فَيَصْعَدُونَ بِهَا فَلَا يَمُرُّونَ - يَعْنِي بِهَا - عَلَى مَلَأٍ مِنَ الْمَلَائِكَةِ إِلَّا قَالُوا: مَا هَذِه الرّوح الطّيب فَيَقُولُونَ: فلَان بن فُلَانٍ بِأَحْسَنِ أَسْمَائِهِ الَّتِي كَانُوا يُسَمُّونَهُ بِهَا فِي الدُّنْيَا حَتَّى ينْتَهوا بهَا إِلَى سَمَاء الدُّنْيَا فيستفتحون لَهُ فَيفتح لَهُ فَيُشَيِّعُهُ مِنْ كُلِّ سَمَاءٍ مُقَرَّبُوهَا إِلَى السَّمَاءِ الَّتِي تَلِيهَا حَتَّى ينتهى بهَا إِلَى السَّمَاءِ السَّابِعَةِ - فَيَقُولُ اللَّهُ عَزَّ وَجَلَّ: اكْتُبُوا كِتَابَ عَبْدِي فِي عِلِّيِّينَ وَأَعِيدُوهُ إِلَى الْأَرْضِ فَإِنِّي مِنْهَا خَلَقْتُهُمْ وَفِيهَا أُعِيدُهُمْ وَمِنْهَا أخرجهم تَارَة أُخْرَى قَالَ: \" فتعاد روحه فيأتيه ملكان فَيُجْلِسَانِهِ فَيَقُولُونَ لَهُ: مَنْ رَبُّكَ؟ فَيَقُولُ: رَبِّيَ الله فَيَقُولُونَ لَهُ: مَا دِينُكَ؟ فَيَقُولُ: دِينِيَ الْإِسْلَامُ فَيَقُولَانِ لَهُ: مَا هَذَا الرَّجُلُ الَّذِي بُعِثَ فِيكُمْ؟ فَيَقُول: هُوَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَيَقُولَانِ لَهُ: وَمَا عِلْمُكَ؟ فَيَقُولُ: قَرَأْتُ كِتَابَ اللَّهِ فَآمَنْتُ بِهِ وَصَدَّقْتُ فَيُنَادِي مُنَادٍ مِنَ السَّمَاء أَن قد صدق فَأَفْرِشُوهُ مِنَ الْجَنَّةِ وَأَلْبِسُوهُ مِنَ الْجَنَّةِ وَافْتَحُوا لَهُ بَابًا إِلَى الْجَنَّةِ \" قَالَ: «فَيَأْتِيهِ مِنْ رَوْحِهَا وَطِيبِهَا وَيُفْسَحُ لَهُ فِي قَبْرِهِ مَدَّ بَصَرِهِ» قَالَ: \" وَيَأْتِيهِ رجل حسن الْوَجْه حسن الثِّيَاب طيب الرّيح فَيَقُولُ: أَبْشِرْ بِالَّذِي يَسُرُّكَ هَذَا يَوْمُكَ الَّذِي كُنْتَ تُوعَدُ فَيَقُولُ لَهُ: مَنْ أَنْتَ؟ فَوَجْهُكَ الْوَجْه يَجِيء بِالْخَيْرِ فَيَقُولُ: أَنَا عَمَلُكَ الصَّالِحُ فَيَقُولُ: رَبِّ أَقِمِ السَّاعَةَ رَبِّ أَقِمِ السَّاعَةَ حَتَّى أَرْجِعَ إِلَى أَهْلِي وَمَالِي \". قَالَ: \" وَإِنَّ الْعَبْدَ الْكَافِرَ إِذَا كَانَ فِي انْقِطَاعٍ مِنَ الدُّنْيَا وَإِقْبَالٍ مِنَ الْآخِرَةِ نَزَلَ إِلَيْهِ مِنَ السَّمَاءِ مَلَائِكَةٌ سُودُ الْوُجُوهِ مَعَهُمُ الْمُسُوحُ فَيَجْلِسُونَ مِنْهُ مَدَّ الْبَصَرِ ثُمَّ يَجِيءُ مَلَكُ الْمَوْتِ حَتَّى يَجْلِسَ عِنْدَ رَأْسِهِ فَيَقُولُ: أَيَّتُهَا النَّفْسُ الْخَبِيثَةُ اخْرُجِي إِلَى سَخَطٍ مِنَ اللَّهِ \" قَالَ: \" فَتُفَرَّقُ فِي جسده فينتزعها كَمَا ينتزع السفود من الصُّوف المبلول فَيَأْخُذُهَا فَإِذَا أَخَذَهَا لَمْ يَدَعُوهَا فِي يَدِهِ طَرْفَةَ عَيْنٍ حَتَّى يَجْعَلُوهَا فِي تِلْكَ الْمُسُوحِ وَيخرج مِنْهَا كَأَنْتَنِ رِيحِ جِيفَةٍ وُجِدَتْ عَلَى وَجْهِ الْأَرْضِ فَيَصْعَدُونَ بِهَا فَلَا يَمُرُّونَ بِهَا عَلَى مَلَأٍ مِنَ الْمَلَائِكَةِ إِلَّا قَالُوا: مَا هَذَا الرّوح الْخَبيث؟ فَيَقُولُونَ: فلَان بن فُلَانٍ - بِأَقْبَحِ أَسْمَائِهِ الَّتِي كَانَ يُسَمَّى بِهَا فِي الدُّنْيَا - حَتَّى يَنْتَهِي بهَا إِلَى السَّمَاءِ الدُّنْيَا فَيُسْتَفْتَحُ لَهُ فَلَا يُفْتَحُ لَهُ \" ثُمَّ قَرَأَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ (لَا تُفَتَّحُ لَهُمْ أَبْوَابُ السَّمَاءِ وَلَا يَدْخُلُونَ الْجَنَّةَ حَتَّى يَلِجَ الْجَمَلُ فِي سم الْخياط)\nفَيَقُولُ اللَّهُ عَزَّ وَجَلَّ: اكْتُبُوا كِتَابَهُ فِي سِجِّين فِي الأَرْض السُّفْلى فتطرح روحه طرحا\nثُمَّ قَرَأَ: (وَمَنْ يُشْرِكْ بِاللَّهِ فَكَأَنَّمَا خَرَّ مِنَ السَّمَاءِ فَتَخْطَفُهُ الطَّيْرُ أَوْ تَهْوِي بِهِ الرّيح فِي مَكَان سحيق)\nفَتُعَادُ رُوحُهُ فِي جَسَدِهِ وَيَأْتِيهِ مَلَكَانِ فَيُجْلِسَانِهِ فَيَقُولَانِ لَهُ: مَنْ رَبُّكَ: فَيَقُولُ: هَاهْ هَاهْ لَا أَدْرِي فَيَقُولَانِ لَهُ: مَا دِينُكَ؟ فَيَقُولُ: هَاهْ هَاهْ لَا أَدْرِي فَيَقُولَانِ لَهُ: مَا هَذَا الرَّجُلُ الَّذِي بُعِثَ فِيكُمْ؟ فَيَقُولُ: هَاهْ هَاهْ لَا أَدْرِي فَيُنَادِي مُنَادٍ مِنَ السَّمَاءِ أَن كذب عَبدِي فأفرشوا لَهُ مِنَ النَّارِ وَافْتَحُوا لَهُ بَابًا إِلَى النَّارِ فَيَأْتِيهِ حَرُّهَا وَسَمُومُهَا وَيُضَيَّقُ عَلَيْهِ قَبْرُهُ حَتَّى تَخْتَلِفَ فِيهِ أَضْلَاعُهُ وَيَأْتِيهِ رَجُلٌ قَبِيحُ الْوَجْهِ قَبِيحُ الثِّيَابِ مُنْتِنُ الرِّيحِ فَيَقُولُ أَبْشِرْ بِالَّذِي يسوؤك هَذَا يَوْمُكَ الَّذِي كُنْتَ تُوعَدُ فَيَقُولُ: مَنْ أَنْتَ؟ فَوَجْهُكَ الْوَجْهُ يَجِيءُ بِالشَّرِّ فَيَقُولُ: أَنَا عَمَلُكَ الْخَبِيثُ فَيَقُولُ: رَبِّ لَا تُقِمِ السَّاعَةَ\nوَفِي رِوَايَة نَحوه وَزَاد فِيهِ:\nإِذَا خَرَجَ رُوحُهُ صَلَّى عَلَيْهِ كُلُّ مَلَكٍ بَيْنَ السَّمَاءِ وَالْأَرْضِ وَكُلُّ مَلَكٍ فِي السَّمَاءِ وَفُتِحَتْ لَهُ أَبْوَابُ السَّمَاءِ لَيْسَ مِنْ أَهْلِ بَابٍ إِلَّا وَهُمْ يَدْعُونَ اللَّهَ أَنْ يُعْرَجَ بِرُوحِهِ مِنْ قِبَلِهِمْ. وَتُنْزَعُ نَفْسُهُ يَعْنِي الْكَافِرَ مَعَ الْعُرُوقِ فَيَلْعَنُهُ كُلُّ مَلَكٍ بَيْنَ السَّمَاءِ وَالْأَرْضِ وَكُلُّ مَلَكٍ فِي السَّمَاءِ وَتُغْلَقُ أَبْوَابُ السَّمَاءِ لَيْسَ مِنْ أَهْلِ بَابٍ إِلَّا وَهُمْ يَدْعُونَ اللَّهَ أَنْ لَا يُعْرِجَ رُوحَهُ مِنْ قبلهم \". رَوَاهُ أَحْمد","english":{"narrator":"Al-Bara' b. ‘Azib said :","text":"We went out with the Prophet to the funeral of a man of the Ansar and came to the grave. It had not yet been dug, so God’s messenger sat down and we sat down around him quietly. He had in his hand a stick with which he was making marks on the ground. Then he raised his head and said, “Seek refuge in God from the punishment of the grave saying it twice or thrice. He then said, “When a believer is about to leave the world and go forward to the next world, angels with faces white as the sun come down to him from heaven with one of the shrouds of paradise and some of the perfume of paradise and sit away from him as far as the eye can see. Then the angel of death comes and sits at his head and says, 'Good soul, come out to forgiveness and acceptance from God.' It then comes out as a drop flows from a water-skin and he seizes it; and when he does so, they do not leave it in his hand for an instant, but take it and place it in that shroud and that perfume, and from it there comes forth a fragrance like that of the sweetest musk found on the face of the earth. They then take it up and do not bring it past a company of angels without their asking, “Who is this good soul?' to which they reply, ‘So and so, the son of so and so,’ using the best of his names by which people called him on the earth. They then bring him to the lowest heaven and ask that the gate should be opened for him. This is done, and from every heaven its archangels escort him to the next heaven till he is brought to the seventh heaven, and God who is great and glorious says, ‘Record the book of my servant in ‘Illiyun (Cf. Qur’an, lxxxiii, 18) and take him back to earth, for I created mankind from it, I shall return them into it, and from it I shall bring them forth another time.' His soul is then restored to his body, two angels come to him, and making him sit up say to him, ‘Who is your Lord?’ He replies, ‘My Lord is God.’ They ask, ‘What is your religion?’ and he replies, ‘My religion is Islam.’ They ask, ‘Who is this man who was sent among you?’ and he replies, ‘He is God’s messenger.’ They ask, ‘What is your  knowledge?’ and he replies, ‘I have read God’s Book, believed in it and declared it to be true.’ Then one cries from heaven, ‘My servant has spoken the truth, so spread out carpets from paradise for him, clothe him from paradise, and open a gate for him into paradise.’ Then some of its joy and fragrance comes to him, his grave is made spacious for him as far as the eye can see, and a man with a beautiful face, beautiful garments and a sweet odour comes to him and says, ‘Rejoice in what pleases you for this is your day which you have been promised.' He asks, ‘Who are you, for your face is perfectly beautiful and brings good?” He replies, ‘I am your good deeds.’ He then says, ‘My Lord, bring the last hour; my Lord, bring the last hour, so that I may return to my people and my property.’ But when an infidel is about to leave the world and proceed to the next world, angels with black faces come down to him from heaven with hair-cloth and sit away from him as far as the eye can see. Then the angel of death comes and sits at his head and says, ‘Wicked soul, come out to displeasure from God.’ Then it becomes dissipated in his body, and he draws it out as a spit is drawn out from moistened wool. He then seizes it, and when he does so they do not leave it in his hand for an instant, but put it in that hair-cloth and from it there comes forth a stench like the most offensive stench of a corpse found on the face of the earth. They then take it up and do not bring it past a company of angels without their asking, ‘Who is this wicked soul?’ to which they reply, ‘So and so, the son of so and so,’ using the worst names he was called in the world. When he is brought to the lowest heaven request is made that the gate be opened for him, but it is not opened for him. (God’s messenger then recited, ‘The gates of heaven will not be opened for them and they will not enter paradise until a camel can pass through the eye of a needle.)(Qur'an, vii, 40) God who is great and glorious then says, ‘Record his book in Sijjin (Cf. Qur’an, Ixxxiii, 7 ff) in the lowest earth,’ and his soul is thrown down. (He then recited, ‘He who assigns partners to God is as if he had fallen down from heaven and been snatched up by birds, or made to fall by the wind in a place far distant.')(Qur’an, xxii, 31). His soul is then restored to his body, two angels come to him, and making him sit up say to him, ‘Who is your Lord?’. He replies, ‘Alas, alas, I do not know.’ They ask, ‘What is your religion?' and he replies, ‘Alas, alas, I do not know.’ They ask, ‘Who is this man who was sent among you?' and he replies, ‘Alas, alas, I do not know.’ Then one cries from heaven, ‘He has lied, so spread out carpets from hell for him, and open a gate for him into hell.’ Then some of its heat and hot air comes to him, his grave is made narrow for him so that his ribs are pressed together in it, and a man with an ugly, face, ugly garments and an offensive odour come to him and says, ‘Be grieved with what displeases you, for this is your day which you have been promised.’ He asks, ‘Who are you, for your face is most ugly and brings evil?' He replies, ‘I am your wicked deeds.’ He then says, ‘My Lord, do not bring the last hour.’ ” In a version there is something similar containing an addition: “When his soul comes out every angel between heaven and earth and every angel in heaven invoke blessings on him, and the gates of heaven are opened for him, no guardians of a gate failing to supplicate God that his soul may be taken up beyond them. But his soul, i.e., the infidel’s, is pulled out along with the veins and every angel between heaven and earth and every angel in heaven curse him, and the gates of heaven are locked, no guardians of a gate failing to supplicate God that his soul may not be taken up beyond them. \n\nAhmad transmitted it."}},{"id":107,"idInBook":107,"chapterId":5,"bookId":14,"arabic":"وَعَنْ عَبْدِ الرَّحْمَنِ بْنِ كَعْبٍ عَنْ أَبِيهِ قَالَ: لَمَّا حَضَرَتْ كَعْبًا الْوَفَاةُ أَتَتْهُ أُمُّ بِشْرٍ بِنْتُ الْبَرَاءِ بْنِ مَعْرُورٍ فَقَالَتْ: يَا أَبَا عَبْدِ الرَّحْمَنِ إِنْ لَقِيتَ فُلَانًا فَاقْرَأْ عَلَيْهِ مِنِّي السَّلَامَ. فَقَالَ: غَفَرَ اللَّهُ لَكِ يَا أُمَّ بِشْرٍ نَحْنُ أَشْغَلُ مِنْ ذَلِكَ فَقَالَتْ: يَا أَبَا عَبْدِ الرَّحْمَنِ أَمَا سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُول: «إِنَّ أَرْوَاحَ الْمُؤْمِنِينَ فِي طَيْرٍ خُضْرٍ تَعْلُقُ بِشَجَرِ الْجَنَّةِ؟» قَالَ: بَلَى. قَالَتْ: فَهُوَ ذَاكَ. رَوَاهُ ابْنُ مَاجَهْ وَالْبَيْهَقِيُّ فِي كِتَابِ الْبَعْثِ والنشور","english":{"narrator":"","text":"‘Abd ar-Rahman b. Ka‘b told on his father's authority that when death came to Ka‘b,( Ibn Majah in Jana'iz. 4 gives Ka'b b. Malik.) Umm Bishr, daughter of al-Bara’ b. Ma'rur visited him and said, “Abu ‘Abd ar-Rahman, if you meet so and so, give him a greeting from me.\" He replied, “God forgive you, Umm Bishr, I shall be too occupied to do that.” She said, “Abu ‘Abd ar-Rahman, have you not heard God’s messenger say that the souls of believers are in green birds which are suspended on and feed on (The Arabic uses ta'luqu followed by bi. Mirqat explains the meaning in the sense given above) the trees of paradise?” On his replying that he had, she said that that was what she meant. \n\nIbn Majah and BaihaqI, in Kitab ul-ba‘th wannushur, transmitted it."}},{"id":108,"idInBook":108,"chapterId":5,"bookId":14,"arabic":"وَعَنْ عَبْدِ الرَّحْمَنِ بْنِ كَعْبٍ عَنْ أَبِيهِ قَالَ: أَنَّهُ كَانَ يُحَدِّثُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّا نسمَة الْمُؤمن طير طَيْرٌ تَعْلُقُ فِي شَجَرِ الْجَنَّةِ حَتَّى يُرْجِعَهُ اللَّهُ فِي جَسَدِهِ يَوْمَ يَبْعَثُهُ» . رَوَاهُ مَالِكٌ وَالنَّسَائِيّ وَالْبَيْهَقِيّ فِي كتاب الْبَعْث والنشور","english":{"narrator":"","text":"He quoted his father to the effect that he used to tell that God’s messenger said, “The spirit of a believer is only a bird which feeds on (Here the Arabic is ta'luqu fi. Mirqat quotes Suyuti who explains it as in the translation above. The verb can have either the sense of being attached to something or of eating) the trees of paradise till God restores him to his body on the day He resurrects it.” \n\nMalik, Nasa’i and Baihaqi, in Kitab al-ba'th wan-nushur, transmitted it."}},{"id":109,"idInBook":109,"chapterId":5,"bookId":14,"arabic":"وَعَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ قَالَ: دَخَلْتُ عَلَى جَابِرِ بْنِ عَبْدِ اللَّهِ وَهُوَ يَمُوتُ فَقُلْتُ: اقْرَأْ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ السَّلَام. رَوَاهُ ابْن مَاجَه","english":{"narrator":"","text":"Muhammad b. al-Munkadir told that he visited Jabir b. 'Abdallah when he was dying and said, “Give a greeting to God’s messenger.” \n\nIbn Majah transmitted it."}},{"id":110,"idInBook":110,"chapterId":5,"bookId":14,"arabic":"عَنْ أُمِّ عَطِيَّةَ قَالَتْ: دَخَلَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ نُغَسِّلُ ابْنَتَهُ فَقَالَ: اغْسِلْنَهَا ثَلَاثًا أَوْ خَمْسًا أَوْ أَكْثَرَ مِنْ ذَلِكِ إِنْ رَأَيْتُنَّ ذَلِكَ بِمَاءٍ وَسِدْرٍ وَاجْعَلْنَ فِي الْآخِرَةِ كَافُورًا أَوْ شَيْئًا مِنْ كَافُورٍ فَإِذَا فَرَغْتُنَّ فَآذِنَّنِي فَلَمَّا فَرَغْنَا آذناه فَألْقى إِلَيْنَا حقوه وَقَالَ: «أَشْعِرْنَهَا إِيَّاهُ» وَفِي رِوَايَةٍ: \n\" اغْسِلْنَهَا وِتْرًا: ثَلَاثًا أَوْ خَمْسًا أَوْ سَبْعًا وَابْدَأْنَ بِمَيَامِنِهَا وَمَوَاضِعِ الْوُضُوءِ مِنْهَا \". وَقَالَتْ فَضَفَّرْنَا شَعَرَهَا ثَلَاثَةَ قُرُونٍ فألقيناها خلفهَا","english":{"narrator":"Umm 'Atiya said:","text":"God’s messenger came in where we were when we were washing his daughter and said, “Wash her with water and lotus leaves three or five times, or more than that if you think fit, and put camphor, or some camphor, in the last washing, then inform me when you are finished.” When we had finished we informed him, and he threw us his lower garment saying, “Put it next her body.” A version has, \"Wash her an odd number of times, three, or five, or seven, beginning with the right side and the places where ablution is performed.” She said that they braided her hair in three plaits and placed them behind her back. \n\n(Bukharl and Muslim.)"}},{"id":111,"idInBook":111,"chapterId":5,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُفِّنَ فِي ثَلَاثَةِ أَثْوَابٍ يَمَانِيَّةٍ بِيضٍ سَحُولِيَّةٍ مِنْ كُرْسُفٍ لَيْسَ فِيهَا قَمِيصٌ وَلَا عِمَامَة","english":{"narrator":"","text":"'A’isha said that God’s messenger was shrouded in three cotton garments of white Yemeni stuff from Sahul (This is said to have been cither the place where the cloth was woven, or the place from which it was exported), among which was neither a shirt nor a turban. \n\n(Bukharl and Muslim.)"}},{"id":112,"idInBook":112,"chapterId":5,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا كَفَّنَ أَحَدُكُمْ أَخَاهُ فليحسن كَفنه» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Jabir reported God’s messenger as saying, “When one of you shrouds his brother he should use a shroud of good quality.” \n\nMuslim transmitted it."}},{"id":113,"idInBook":113,"chapterId":5,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ قَالَ: إِنَّ رَجُلًا كَانَ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَوَقَصَتْهُ نَاقَتُهُ وَهُوَ مُحْرِمٌ فَمَاتَ ن فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «اغْسِلُوهُ بِمَاءٍ وَسِدْرٍ وَكَفِّنُوهُ فِي ثَوْبَيْهِ وَلَا تَمَسُّوهُ بِطِيبٍ وَلَا تُخَمِّرُوا رَأْسَهُ فَإِنَّهُ يُبْعَثُ يَوْم الْقِيَامَة ملبيا»","english":{"narrator":"‘Abdallah b. 'Abbas said that a man wearing the ihram who was along with the Prophet was thrown by his she-camel and had his neck broken and died. God's messenger then said, “Wash him with water and lotus leaves, shroud him in his two garments, but do not put any perfume on him or cover his head, for he will be raised on the day of resurrection saying the talbiya.”(The cry of pilgrims! “At Thy service (labbaika), O God, at Thy service, at Thy service; Thou hast no partner:","text":"at Thy service; praise and grace are Thine, and the dominion ; Thou hast no partner.\" See Book XI, chap. ii) \n\n(Bukharl and Muslim.)"}},{"id":114,"idInBook":114,"chapterId":5,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْبَسُوا مِنْ ثِيَابِكُمُ الْبَيَاضَ فَإِنَّهَا مَنْ خَيْرِ ثِيَابِكُمْ وَكَفِّنُوا فِيهَا مَوْتَاكُمْ وَمِنْ خَيْرِ أَكْحَالِكُمُ الْإِثْمِدُ فَإِنَّهُ يُنْبِتُ الشّعْر ويجلوا الْبَصَر» . رَوَاهُ أَبُو دَاوُد وَالتِّرْمِذِيّ","english":{"narrator":"","text":"Ibn 'Abbas reported God’s messenger as saying, “Wear your white garments, for they are among your best garments, and shroud your dead in them. Among the best types of collyrium you use is antimony (ithmid) for it makes the hair sprout and clears the vision.\" \n\nAbu Da wad and Tirmidhi transmitted it, and Ibn Majah transmitted' up to “shroud your dead in them.\""}},{"id":115,"idInBook":115,"chapterId":5,"bookId":14,"arabic":"وَعَنْ عَلِيٍّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَغَالَوْا فِي الْكَفَنِ فَإِنَّهُ يُسْلَبُ سَلْبًا سَرِيعًا» . رَوَاهُ أَبُو دَاوُدَ","english":{"narrator":"","text":"'All reported God’s messenger as saying 'Do not be extravagant in shrouding, for it will quickly be decayed.\" \n\nAbu Dawud transmitted it."}},{"id":116,"idInBook":116,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّهُ لَمَّا حَضَرَهُ الْمَوْتُ. دَعَا بِثِيَابٍ جُدُدٍ فَلَبِسَهَا ثُمَّ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم يَقُولُ: «الْمَيِّتُ يُبْعَثُ فِي ثِيَابِهِ الَّتِي يَمُوتُ فِيهَا» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"When Abu Sa'id al-Khudri was about to die he called for new clothes and put them on, then said he had heard God’s messenger say, “The dead will be resurrected in the clothes in which he died.\" \n\nAbu Dawud transmitted it."}},{"id":117,"idInBook":117,"chapterId":5,"bookId":14,"arabic":"وَعَنْ عُبَادَةَ بْنِ الصَّامِتِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «خَيْرُ الْكَفَنِ الْحُلَّةُ وَخَيْرُ الْأُضْحِيَةِ الْكَبْشُ الْأَقْرَنُ» . رَوَاهُ أَبُو دَاوُد\nوَرَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ عَنْ أَبِي أُمَامَةَ","english":{"narrator":"","text":"‘Ubada b. as-Samit reported God's messenger as saying, “The best shroud is a lower garment and one which covers the whole body, (The Arabic has al-kulla, which means the two garments known as the izar (lower garment) and rida' (a cloak which covers the whole body)) and the best sacrifice is a horned ram.\" \n\nAbu Dawud transmitted it; and Tirmidhi and Ibn Majah transmitted it from Abu Umama."}},{"id":118,"idInBook":118,"chapterId":5,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: أَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقَتْلَى أُحُدٍ أَنْ ينْزع عَنْهُم الْحَدِيدُ وَالْجُلُودُ وَأَنْ يُدْفَنُوا بِدِمَائِهِمْ وَثِيَابِهِمْ. رَوَاهُ أَبُو دَاوُدَ وَابْنُ مَاجَهْ","english":{"narrator":"","text":"Ibn ‘Abbas said God’s messenger commanded that those killed at Uhud should be stripped of iron and skins and buried in their clothing without having the blood washed off. \n\nAbu Dawud and Ibn Majah transmitted it."}},{"id":119,"idInBook":119,"chapterId":5,"bookId":14,"arabic":"عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ عَنْ أَبِيهِ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ عَوْفٍ أُتِيَ بِطَعَامٍ وَكَانَ صَائِمًا فَقَالَ: قُتِلَ مُصْعَبُ بْنُ عُمَيْرٍ وَهُوَ خَيْرٌ مِنِّي كُفِّنَ فِي بُرْدَةٍ إِنْ غُطِّيَ رَأْسُهُ بَدَتْ رِجْلَاهُ وَإِنْ غُطِّيَ رِجْلَاهُ بَدَا رَأْسُهُ وَأَرَاهُ قَالَ: وَقُتِلَ حَمْزَةُ وَهُوَ خَيْرٌ مِنِّي ثُمَّ بُسِطَ لَنَا مِنَ الدُّنْيَا مَا بُسِطَ أَوْ قَالَ: أُعْطِينَا مِنَ الدُّنْيَا مَا أُعْطِينَا وَلَقَدْ خَشِينَا أَنْ تَكُونَ حَسَنَاتُنَا عُجِّلَتْ لَنَا ثُمَّ جَعَلَ يَبْكِي حَتَّى تَرَكَ الطَّعَامَ. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Sa'd b. Ibrahim told on his father’s authority that ‘Abd ar-Rahman b. ‘Auf was brought food when he was fasting and said, “Mus'ab b. ‘Umair who was better than I am was killed and was shrouded in a cloak  added that he thought he said ‘And Hamza who was better than I am was killed.’) Then we were given such great worldly wealth as we have been given (or, We have been given such worldly goods as we have been given), and I am afraid that my good things have been given me in advance.” He then began to weep and left the food untouched.\n\nBukhari transmitted it."}},{"id":120,"idInBook":120,"chapterId":5,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: أَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَبْدَ اللَّهِ بْنَ أُبَيٍّ بَعْدَمَا أُدْخِلَ حُفْرَتَهُ فَأَمَرَ بِهِ فَاخْرُج فَوَضعه على رُكْبَتَيْهِ ن فَنَفَثَ فِيهِ مِنْ رِيقِهِ وَأَلْبَسَهُ قَمِيصَهُ قَالَ: وَكَانَ كسا عباسا قَمِيصًا الْمَشْي بالجنازة وَالصَّلَاة عَلَيْهَا","english":{"narrator":"","text":"Jabir said that God’s messenger came to ‘Abdallah b. Ubayy after he had been placed in his grave and ordered him to be taken out. He then placed him on his knees, blew some of his saliva into him, and clothed him with his shirt. He said that he had clothed ‘Abbas with a shirt. ( i.e.. Jabir said the Prophet had clothed ‘Abbas with a shirt) \n\n(Bukhari and Muslim.)"}},{"id":121,"idInBook":121,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَسْرِعُوا بِالْجَنَازَةِ فَإِنْ تَكُ صَالِحَةً فَخَيْرٌ تُقَدِّمُونَهَا إِلَيْهِ وَإِنْ تَكُ سِوَى ذَلِكَ فشر تضعونه عَن رقابك»","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “Walk quickly at a funeral, for if the dead person was good it is a good condition to which you are sending him on, but if he was otherwise it is an evil of which you are ridding yourselves.” \n\n(Bukhari and Muslim.)"}},{"id":122,"idInBook":122,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" إِذَا وُضِعَتِ الْجَنَازَةُ فَاحْتَمَلَهَا الرِّجَالُ عَلَى أَعْنَاقِهِمْ فَإِنْ كَانَتْ صَالِحَةً قَالَتْ: قَدِّمُونِي وَإِنْ كَانَتْ غَيْرَ صَالِحَةٍ قَالَت لأَهْلهَا: يَا وَيْلَهَا أَيْن يذهبون بِهَا؟ يَسْمَعُ صَوْتَهَا كُلُّ شَيْءٍ إِلَّا الْإِنْسَانَ وَلَو سمع الْإِنْسَان لصعق \". رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Abu Sa'id reported God’s messenger as saying, “When a corpse is placed on a bier and men carry it on their shoulders, if it was a good man it says, ‘Take me quickly’; but if it was not good it says to its bearers, ‘Woe to it, where are you taking it?’ Everything but mankind hears its voice, and were a human being to hear it he would faint.” \n\nBukhari transmitted it."}},{"id":123,"idInBook":123,"chapterId":5,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا رَأَيْتُمُ الْجَنَازَةَ فَقُومُوا فَمَنْ تَبِعَهَا فَلَا يَقْعُدْ حَتَّى تُوضَعَ»","english":{"narrator":"","text":"He reported God’s messenger as saying, “When you see a funeral stand up; but anyone who follows it must not sit down till the bier is placed on the ground.” \n\n(Bukhari and Muslim.)"}},{"id":124,"idInBook":124,"chapterId":5,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: مَرَّتْ جَنَازَةٌ فَقَامَ لَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقُمْنَا مَعَهُ فَقُلْنَا: يَا رَسُولَ اللَّهِ إِنَّهَا يَهُودِيَّةٌ فَقَالَ: «إِنَّ الْمَوْتَ فَزَعٌ فَإِذَا رَأَيْتُمْ الْجِنَازَة فَقومُوا»","english":{"narrator":"","text":"Jabir said that when a funeral passed by God’s messenger stood up  and they stood up along with him. They told him it was a Jewish funeral and he replied, “Death is a fearful event, so when you see a funeral stand up.” \n\n(Bukhari and Muslim.)"}},{"id":125,"idInBook":125,"chapterId":5,"bookId":14,"arabic":"وَعَن عَليّ رَضِي الله عَنهُ قَالَ: رَأَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَامَ فَقُمْنَا وَقَعَدَ فَقَعَدْنَا يَعْنِي فِي الْجَنَازَةِ. رَوَاهُ مُسْلِمٌ وَفِي رِوَايَةِ مَالِكٍ وَأَبِي دَاوُدَ: قَامَ فِي الْجَنَازَةِ ثُمَّ قَعَدَ بَعْدُ","english":{"narrator":"","text":"‘Ali said, “We saw God’s messenger stand up so we stood up; he then sat down and we sat down,” the reference being to a funeral. \n\nMuslim transmitted it. The version of Malik and Abu Dawud says, “He stood up for a funeral, then sat down afterwards.”(There is some doubt as to whether this means that he sat down after the funeral had passed, or whether the point is that the Prophet’s practice had been to stand up but that he later stopped doing so. Cf. the tradition from ‘Ali on p. 353)"}},{"id":126,"idInBook":126,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنِ اتَّبَعَ جَنَازَةَ مُسْلِمٍ إِيمَانًا وَاحْتِسَابًا وَكَانَ مَعَهُ حَتَّى يُصَلَّى عَلَيْهَا وَيُفْرَغَ مِنْ دَفْنِهَا فَإِنَّهُ يَرْجِعُ مِنَ الْأَجْرِ بِقِيرَاطَيْنِ كُلُّ قِيرَاطٍ مِثْلُ أُحُدٍ وَمَنْ صَلَّى عَلَيْهَا ثُمَّ رَجَعَ قَبْلَ أَنْ تُدْفَنَ فَإِنَّهُ يَرْجِعُ بقيراط»","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “If anyone attends the funeral of a Muslim out of faith and seeking a reward from God, and stays till prayer is offered and the burial is complete, he will return with a reward of two qirats, each qirat being equivalent to Uhud (The qirat is a small weight, a twentieth, or twenty-fourth of a dinar. Here it is used somewhat figuratively. The statement that it is equivalent to the hill Uhud is a way of expressing that the reward will be very great); and if anyone prays over the dead and returns before the burial, he will come back with one qirat.” \n\n(Bukharl and Muslim.)"}},{"id":127,"idInBook":127,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَعَى لِلنَّاسِ النَّجَاشِيَّ الْيَوْمَ الَّذِي مَاتَ فِيهِ وَخرج بِهِمْ إِلَى الْمُصَلَّى فَصَفَّ بِهِمْ وَكَبَّرَ أَرْبَعَ تَكْبِيرَات","english":{"narrator":"","text":"He said the Prophet gave the people news of the death of the Negus on the day on which he died, took them out to the place of prayer, drew them up in rows and said “God is most great” four times. \n\n(Bukhari and Muslim.)"}},{"id":128,"idInBook":128,"chapterId":5,"bookId":14,"arabic":"وَعَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى قَالَ: كَانَ زَيْدُ بْنُ أَرْقَمَ يُكَبِّرُ عَلَى جَنَائِزِنَا أَرْبَعًا وَأَنَّهُ كَبَّرَ عَلَى جَنَازَةٍ خَمْسًا فَسَأَلْنَاهُ فَقَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يكبرها. رَوَاهُ مُسلم","english":{"narrator":"","text":"‘Abd ar-Rahman b. Abu Laila said that Zaid b. Arqam used to say “God is most great” four times over their dead at funerals, but once he said it five times. On being questioned about it he replied that God's messenger used to do so.\n Muslim transmitted it."}},{"id":129,"idInBook":129,"chapterId":5,"bookId":14,"arabic":"وَعَنْ طَلْحَةَ بْنِ عَبْدِ اللَّهِ بْنِ عَوْفٍ قَالَ: صَلَّيْتُ خَلْفَ ابْنِ عَبَّاسٍ عَلَى جَنَازَةٍ فَقَرَأَ فَاتِحَةَ الْكِتَابِ فَقَالَ: لِتَعْلَمُوا أَنَّهَا سُنَّةٌ. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Talha b. ‘Abdallah b. ‘Auf said he prayed behind Ibn ‘Abbas at a funeral and he recited Fatihat al-Kltab (Qur'an, sura i). He then said that it was to let them know it was a sunna.\n\n Bukhari transmitted it."}},{"id":130,"idInBook":130,"chapterId":5,"bookId":14,"arabic":"وَعَنْ عَوْفِ بْنِ مَالِكٍ قَالَ: صَلَّى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى جَنَازَةٍ فَحَفِظْتُ مِنْ دُعَائِهِ وَهُوَ يَقُولُ: «اللَّهُمَّ اغْفِرْ لَهُ وَارْحَمْهُ وَعَافِهِ وَاعْفُ عَنْهُ وَأَكْرِمْ نُزُلَهُ وَوَسِّعْ مُدْخَلَهُ وَاغْسِلْهُ بِالْمَاءِ وَالثَّلْجِ وَالْبَرَدِ وَنَقِّهِ مِنَ الْخَطَايَا كَمَا نَقَّيْتَ الثَّوْبَ الْأَبْيَضَ مِنَ الدنس وأبدله دَارا خيرا من دَاره وَأهلا خَيْرًا مِنْ أَهْلِهِ وَزَوْجًا خَيْرًا مِنْ زَوْجِهِ وَأدْخلهُ الْجنَّة وأعذه من عَذَاب الْقَبْر وَمن عَذَاب النَّار» . وَفِي رِوَايَةٍ: «وَقِهِ فِتْنَةَ الْقَبْرِ وَعَذَابَ النَّارِ» قَالَ حَتَّى تَمَنَّيْتُ أَنْ أَكُونَ أَنَا ذَلِكَ الْمَيِّت. رَوَاهُ مُسلم","english":{"narrator":"‘Auf b. Malik said:","text":"God’s messenger prayed at a funeral and I have retained in my memory some of his supplication. He was saying, “O God, forgive him, show him mercy, grant him security, pardon him, grant him a noble provision and a spacious lodging, wash him with water, snow and ice, purify him from sins as Thou hast purified the white garment from filth, give him a better abode in place of his present one, a better family in place of his present one, and a better spouse in place of his present one, cause him to enter paradise and preserve him from the trial in the grave and the punishment in hell.” A version has “And guard him from the trial in the grave and the punishment in hell.” He added that the result was that he wished he had been that dead man. \n\nMuslim transmitted it."}},{"id":131,"idInBook":131,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ أَنَّ عَائِشَة لما توفّي سعد بن أبي وَقاص قَالَت: ادخُلُوا بِهِ الْمَسْجِد حَتَّى أُصَلِّي عَلَيْهِ فَأُنْكِرَ ذَلِكَ عَلَيْهَا فَقَالَتْ: وَاللَّهِ لَقَدْ صَلَّى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى ابْنَيْ بَيْضَاءَ فِي الْمَسْجِدِ: سُهَيْلٍ وَأَخِيهِ. رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Salama b. ‘Abd ar-Rahman told how, when Sa'd b. Abu Waqqas died, ‘A’isha said, “Take him into the mosque so that I may pray over him.” When objection was made to this she said, “I swear by God that God’s messenger prayed in the mosque over Suhail and his brother, the sons of Baida’. ” \n\nMuslim transmitted it."}},{"id":132,"idInBook":132,"chapterId":5,"bookId":14,"arabic":"وَعَنْ سَمُرَةَ بْنِ جُنْدُبٍ قَالَ: صَلَّيْتُ وَرَاءَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى امْرَأَةٍ مَاتَتْ فِي نِفَاسِهَا فَقَامَ وَسَطَهَا","english":{"narrator":"","text":"Samura b. Jundub said, “I prayed behind God’s messenger over a woman who had died in childbirth, and he stood opposite her waist.” \n\n(Bukhar! and Muslim.)"}},{"id":133,"idInBook":133,"chapterId":5,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ بِقَبْرٍ دُفِنَ لَيْلًا فَقَالَ: «مَتَى دُفِنَ هَذَا؟» قَالُوا: الْبَارِحَةَ. قَالَ: «أَفَلَا آذَنْتُمُونِي؟» قَالُوا: دَفَنَّاهُ فِي ظُلْمَةِ اللَّيْلِ فَكَرِهْنَا أَنْ نُوقِظَكَ فَقَامَ فَصَفَفْنَا خَلفه فصلى عَلَيْهِ","english":{"narrator":"","text":"Ibn ‘Abbas said that God's messenger came upon a grave where an interment had taken place at night and asked when this person had been buried. On being told that he had been buried the previous night, he asked why they had not informed him. They told him that they had conducted the burial in the darkness of night and had not liked to waken him, whereupon he stood up, and when they formed a row behind him he prayed over the dead. \n\n(Bukharl and Muslim.)"}},{"id":134,"idInBook":134,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ أَنَّ امْرَأَةً سَوْدَاءَ كَانَتْ تَقُمُّ الْمَسْجِدَ أَوْ شَابٌّ فَفَقَدَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلَ عَنْهَا أَوْ عَنْهُ فَقَالُوا: مَاتَ. قَالَ: «أَفَلَا كُنْتُمْ آذَنْتُمُونِي؟» قَالَ: فَكَأَنَّهُمْ صَغَّرُوا أَمْرَهَا أَوْ أَمْرَهُ. فَقَالَ: «دلوني على قَبره» فدلوه فصلى عَلَيْهَا. قَالَ: «إِنَّ هَذِهِ الْقُبُورَ مَمْلُوءَةٌ ظُلْمَةً عَلَى أَهْلِهَا وَإِنَّ اللَّهَ يُنَوِّرُهَا لَهُمْ بِصَلَاتِي عَلَيْهِمْ» . وَلَفظه لمُسلم","english":{"narrator":"","text":"Abu Huraira said that a negress (or a youth) used to sweep the mosque. God’s messenger missed her, and when he asked about her (or him) the people told him he had died. He asked why they had not informed him, and it appeared as if they had treated her (or him) as of little account. He asked the people to lead him to the grave, and when they did so he prayed over her (The wording of this tradition causes some difficulty owing to the indefiniteness as to whether the person was a man or a woman. Sometimes the alternative is mentioned, as in the translation, but sometimes merely the masculine singular pronoun and at others merely the feminine singular pronoun is used) and then said, \"These graves are full of darkness for their occupants, but God will illuminate them for them by reason of my prayer over them.” \n\n(Bukhari and Muslim, the wording being Muslim’s.)"}},{"id":135,"idInBook":135,"chapterId":5,"bookId":14,"arabic":"وَعَنْ كُرَيْبٍ مَوْلَى ابْنِ عَبَّاسٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ أَنَّهُ مَاتَ لَهُ ابْنٌ بِقُدَيْدٍ أَوْ بِعُسْفَانَ فَقَالَ: يَا كُرَيْبُ انْظُرْ مَا اجْتَمَعَ لَهُ مِنَ النَّاسِ. قَالَ: فَخَرَجْتُ فَإِذَا نَاسٌ قَدِ اجْتَمَعُوا لَهُ فَأَخْبَرْتُهُ فَقَالَ: تَقُولُ: هُمْ أَرْبَعُونَ؟ قَالَ: نَعَمْ. قَالَ: أَخْرِجُوهُ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَا مِنْ رَجُلٍ مُسْلِمٍ يَمُوتُ فَيَقُومُ عَلَى جَنَازَتِهِ أَرْبَعُونَ رَجُلًا لَا يُشْرِكُونَ بِاللَّهِ شَيْئًا إِلَّا شَفَّعَهُمُ اللَّهُ فِيهِ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Kuraib the client of Ibn ‘Abbas told that a son of ‘Abdallah b. ‘Abbas died in Qudaid or ‘Usfan and he asked him to go out and see how many people had gathered for the funeral. Going out and finding that people had gathered for the funeral, he told him. Ibn ‘Abbas asked him if he thought there would be forty present, and when he replied that that was so, he gave orders for the body to be brought out, adding that he had heard God’s messenger say, \"If any Muslim man dies and forty men who associate nothing with God stand over his bier, God will accept them as intercessors for him.” \n\nMuslim transmitted it."}},{"id":136,"idInBook":136,"chapterId":5,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" مَا مِنْ مَيِّتٍ تُصَلِّي عَلَيْهِ أُمَّةٌ مِنَ الْمُسْلِمِينَ يَبْلُغُونَ مِائَةً كُلُّهُمْ يَشْفَعُونَ لَهُ: إِلَّا شفعوا فِيهِ \". رَوَاهُ مُسلم","english":{"narrator":"","text":"‘A’isha reported the Prophet as saying, \"If a company of Muslims to the number of a hundred pray over a dead person, all of them interceding for him, their intercession for him will be accepted.” \n\nMuslim transmitted it."}},{"id":137,"idInBook":137,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: مَرُّوا بِجَنَازَةٍ فَأَثْنَوْا عَلَيْهَا خَيْرًا. فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «وَجَبَتْ» ثُمَّ مَرُّوا بِأُخْرَى فَأَثْنَوْا عَلَيْهَا شَرًّا. فَقَالَ: «وَجَبَتْ» فَقَالَ عُمَرُ: مَا وَجَبَتْ؟ فَقَالَ: «هَذَا أَثْنَيْتُمْ عَلَيْهِ خَيْرًا فَوَجَبَتْ لَهُ الْجَنَّةُ وَهَذَا أَثْنَيْتُمْ عَلَيْهِ شَرًّا فَوَجَبَتْ لَهُ النَّارُ أَنْتُم شُهَدَاء الله فِي الأَرْض» . وَفِي رِوَايَةٍ: «الْمُؤْمِنُونَ شُهَدَاءُ اللَّهِ فِي الْأَرْضِ»","english":{"narrator":"","text":"Anas told that when some people passed a dead body on a bier and spoke highly of the dead man the Prophet said, “It is certain.” When they passed another and spoke very badly of the dead man he said, “It is certain.” ‘Umar asked what was certain, and he replied, “You spoke highly of this one, so paradise is certain for him; but you spoke very badly of that one, so hell is certain for him. You are God’s witnesses in the earth.” \n\n(Bukhari and Muslim.) A version has “The believers are God's witnesses in the earth.”"}},{"id":138,"idInBook":138,"chapterId":5,"bookId":14,"arabic":"وَعَنْ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَيُّمَا مُسْلِمٍ شَهِدَ لَهُ أَرْبَعَةٌ بِخَيْرٍ أَدْخَلَهُ اللَّهُ الْجَنَّةَ» قُلْنَا: وَثَلَاثَةٌ؟ قَالَ: «وَثَلَاثَةٌ» . قُلْنَا وَاثْنَانِ؟ قَالَ: «وَاثْنَانِ» ثُمَّ لم نَسْأَلهُ عَن الْوَاحِد. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"‘Umar reported God’s messenger as saying, “If four people give a good testimony about any Muslim, God will cause him to enter paradise.” ‘Umar said they asked whether this would apply if three testified, and he said it would. They further asked if it would apply if two testified, and he said it would; but they did not ask him about one.\n\nBukhari transmitted it."}},{"id":139,"idInBook":139,"chapterId":5,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَسُبُّوا الْأَمْوَاتَ فَإِنَّهُمْ قَدْ أَفْضَوْا إِلَى مَا قدمُوا» رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"‘A’isha reported God’s messenger as saying, “Do not revile the dead, for they have come to what they have sent before them.” \n\nBukhari transmitted it."}},{"id":140,"idInBook":140,"chapterId":5,"bookId":14,"arabic":"وَعَنْ جَابِرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يجمع بَين الرجلَيْن فِي قَتْلَى أُحُدٍ فِي ثَوْبٍ وَاحِدٍ ثُمَّ يَقُولُ: «أَيُّهُمْ أَكْثَرُ أَخْذًا لِلْقُرْآنِ؟» فَإِذَا أُشِيرَ لَهُ إِلَى أَحَدِهِمَا قَدَّمَهُ فِي اللَّحْدِ وَقَالَ: «أَنَا شَهِيدٌ عَلَى هَؤُلَاءِ يَوْمَ الْقِيَامَةِ» . وَأَمَرَ بِدَفْنِهِمْ بِدِمَائِهِمْ وَلَمْ يُصَلِّ عَلَيْهِمْ وَلَمْ يُغَسَّلُوا. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Jabir said God’s messenger had each pair of those killed at Uhud wrapped in a single garment and asked which of them knew more of the Qur’an. When one of them was pointed out to him, he had him put first in the side of the grave, and he said, “I shall be a witness to these men on the day of resurrection.” He ordered that they should be buried without the marks of blood being removed ; he did not pray over them, and they were not washed. \n\nBukhari transmitted it."}},{"id":141,"idInBook":141,"chapterId":5,"bookId":14,"arabic":"وَعَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ: أَتَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِفَرَسٍ مَعْرُورٍ فَرَكِبَهُ حِينَ انْصَرَفَ مِنْ جَنَازَةِ ابْنِ الدَّحْدَاحِ وَنَحْنُ نمشي حوله. رَوَاهُ مُسلم","english":{"narrator":"","text":"Jabir b. Samura said the Prophet was brought an unsaddled horse which he rode when he went away after the funeral of Ibn ad-Dahdah, and they went on foot around him. \n\nMuslim transmitted it."}},{"id":142,"idInBook":142,"chapterId":5,"bookId":14,"arabic":"وَعَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الرَّاكِبُ يَسِيرُ خَلْفَ الْجَنَازَةِ والماشي يمشي خلفهَا وأمامها وَعَن يَمِينهَا وَعَن يسارها قَرِيبا مِنْهَا وَالسَّقْطُ يُصَلَّى عَلَيْهِ وَيُدْعَى لِوَالِدَيْهِ بِالْمَغْفِرَةِ وَالرَّحْمَةِ» . رَوَاهُ أَبُو دَاوُدَ\nوَفِي رِوَايَةِ أَحْمَدَ وَالتِّرْمِذِيِّ وَالنَّسَائِيّ وَابْن مَاجَه قَالَ: «الرَّاكِب خلف الْجِنَازَة وَالْمَاشِي حَيْثُ شَاءَ مِنْهَا وَالطِّفْلُ يُصَلَّى عَلَيْهِ» وَفِي المصابيح عَن الْمُغيرَة بن زِيَاد","english":{"narrator":"","text":"Al-Mughira b. Shu'ba reported the Prophet as saying, “A rider should go behind the bier, and those on foot should walk behind it, in front of it, on its right and on its left keeping near it. Prayer should be said over an abortion and forgiveness and mercy supplicated for its parents.” \n\nAbu Dawud transmitted it. In the version of Ahmad, Tirmidhi, Nasa’i and Ibn Majah he said, “The rider should go behind the bier and those on foot wherever they wish round about it, and prayer should be said over an infant.\" In al-Masabih it is given on the authority of al-Mughira b. Ziyad."}},{"id":143,"idInBook":143,"chapterId":5,"bookId":14,"arabic":"وَعَنِ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ قَالَ: رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبَا بَكْرٍ وَعُمَرَ يَمْشُونَ أَمَامَ الْجَنَازَةِ. رَوَاهُ أَحْمَدُ وَأَبُو دَاوُدَ وَالتِّرْمِذِيُّ وَالنَّسَائِيُّ وَابْنُ مَاجَهْ وَقَالَ التِّرْمِذِيُّ وَأَهْلُ الْحَدِيثِ كَأَنَّهُمْ يَرَوْنَهُ مُرْسَلًا","english":{"narrator":"","text":"Zuhri said that Salim reported his father as saying, “I saw God’s messenger, Abu Bakr and ‘Umar walking in front of the bier.” \n\nAhmad, Abu Dawud, Tirmidhi, Nasa'i and Ibn Majah transmitted it, and Tirmidhi said the traditionists seem to consider it is in mursat form."}},{"id":144,"idInBook":144,"chapterId":5,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْجَنَازَةُ مَتْبُوعَةٌ وَلَا تَتْبَعُ لَيْسَ مَعَهَا مَنْ تَقَدَّمَهَا» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ وَقَالَ التِّرْمِذِيّ وَأَبُو ماجد الرَّاوِي رجل مَجْهُول","english":{"narrator":"","text":"‘Abdallah b. Mas'ud reported God’s messenger as saying, “The bier should be followed and should not follow. Those who go in front of it are not accompanying it.\"\n\nTirmidhi, Abu Dawud and Ibn Majah transmitted it. Tirmidhi said that Abu Majid the transmitter is unknown."}},{"id":145,"idInBook":145,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" من تبع جَنَازَة وحلمها ثَلَاثَ مَرَّاتٍ: فَقَدْ قَضَى مَا عَلَيْهِ مِنْ حَقِّهَا \". رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ غَرِيبٌ\nوَقَدْ رَوَى فِي «شَرْحِ السُّنَّةِ» : أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَمَلَ جَنَازَةَ سَعْدِ ابْن معَاذ بَين العمودين","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “He who follows a bier and carries it three times has accomplished what is ’due to it from him.\" \n\nTirmidhi transmitted it, saying that this is a gharib tradition. In Sharh as-sunna it is reported that the Prophet carried the bier of Sa‘d b. Mu'adh between the two poles."}},{"id":146,"idInBook":146,"chapterId":5,"bookId":14,"arabic":"وَعَنْ ثَوْبَانَ قَالَ: خَرَجْنَا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي جَنَازَةٍ فَرَأَى نَاسًا رُكْبَانًا فَقَالَ: «أَلَا تَسْتَحْيُونَ؟ إِنَّ مَلَائِكَةَ اللَّهِ عَلَى أَقْدَامِهِمْ وَأَنْتُمْ عَلَى ظُهُورِ الدَّوَابِّ» . رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ وَرَوَى أَبُو دَاوُدَ نَحْوَهُ وَقَالَ التِّرْمِذِيّ: وَقد روى عَن ثَوْبَان مَوْقُوفا","english":{"narrator":"","text":"Thauban told how when they went out with the Prophet to a funeral he saw some people riding and said, “Are you not ashamed ? God’s angels are on their feet, while you are on the backs of animals.\" \n\nTirmidhi and Ibn Majah transmitted it, and Abu Dawud transmitted something similar. Tirmidhi said it has been transmitted from Thauban in mauquf form."}},{"id":147,"idInBook":147,"chapterId":5,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَرَأَ عَلَى الْجَنَازَةِ بِفَاتِحَةِ الْكِتَابِ. رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد وَابْن مَاجَه","english":{"narrator":"","text":"Ibn ‘Abbas said the Prophet recited Fatihat al-Kitab at funerals. \n\nTirmidhi, Abu Dawud and Ibn Majah transmitted it."}},{"id":148,"idInBook":148,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا صَلَّيْتُمْ عَلَى الْمَيِّتِ فَأَخْلِصُوا لَهُ الدُّعَاءَ» . رَوَاهُ أَبُو دَاوُد وَابْن مَاجَه","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “When you pray over the dead, make a sincere supplication for him.\" \n\nAbu Dawud and Ibn Majah transmitted it."}},{"id":149,"idInBook":149,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا صَلَّى عَلَى الْجَنَازَةِ قَالَ: «اللَّهُمَّ اغْفِرْ لِحَيِّنَا وَمَيِّتِنَا وَشَاهِدِنَا وَغَائِبِنَا وَصَغِيرِنَا وَكَبِيرِنَا وَذَكَرِنَا وَأُنْثَانَا. اللَّهُمَّ مَنْ أَحْيَيْتَهُ مِنَّا فَأَحْيِهِ عَلَى الْإِسْلَامِ وَمَنْ تَوَفَّيْتَهُ مِنَّا فَتَوَفَّهُ عَلَى الْإِيمَانِ. اللَّهُمَّ لَا تَحْرِمْنَا أَجْرَهُ وَلَا تَفْتِنَّا بَعْدَهُ» . رَوَاهُ أَحْمَدُ وَأَبُو دَاوُدَ وَالتِّرْمِذِيُّ وَابْنُ مَاجَهْ\nوَرَوَاهُ النَّسَائِيُّ عَنْ إِبْرَاهِيمَ الْأَشْهَلِيِّ عَنْ أَبِيهِ وانتهت رِوَايَته عِنْد قَوْله: و «أنثانا» . وَفِي رِوَايَةِ أَبِي دَاوُدَ: «فَأَحْيِهِ عَلَى الْإِيمَانِ وَتَوَفَّهُ عَلَى الْإِسْلَامِ» . وَفِي آخِرِهِ: «وَلَا تُضِلَّنَا بعده»","english":{"narrator":"","text":"He reported that when God’s messenger prayed over a bier he said, “O God, forgive those of us who are living and those of us who are dead, those of us who are present and those of us who are absent, our young and our old, our male and our female. O God, to whomsoever of us Thou givest life keep him faithful to Islam whilst Thou givest him life, and whomsoever of us Thou takest in death take him as a believer. O God, do not withhold from us the reward of faith (the Arabic is variously explained either as translated above, or as the reward of the man who has died, or of the believer. The text is ajrahu which means 'his reward’, or ‘its reward.’ Cf. Mir gat, ii, 365.), or try us after his death.” \n\nAhmad, Abu Dawud, Tirmidhi and Ibn Majah transmitted it. Nasa'i transmitted it from Abu Ibrahim al-Ashhali who quoted his father’s authority, his version ending at “female”. Abu Dawud’s version has, “Grant him life as a believer and take him in death as a follower of Islam.” It ends, “Do not lead us astray after his death.”"}},{"id":150,"idInBook":150,"chapterId":5,"bookId":14,"arabic":"وَعَنْ وَاثِلَةَ بْنِ الْأَسْقَعِ قَالَ: صَلَّى بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى رَجُلٍ مِنَ الْمُسْلِمِينَ فَسَمِعْتُهُ يَقُولُ: «اللَّهُمَّ إِنَّ فُلَانَ بْنَ فُلَانٍ فِي ذِمَّتِكَ وَحَبْلِ جِوَارِكَ فَقِهِ مِنْ فِتْنَةِ الْقَبْرِ وَعَذَابِ النَّارِ وَأَنْتَ أَهْلُ الْوَفَاءِ وَالْحَقِّ اللَّهُمَّ اغْفِرْ لَهُ وَارْحَمْهُ إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ» . رَوَاهُ أَبُو دَاوُدَ وَابْن مَاجَه","english":{"narrator":"","text":"Wathila b. al-Asqa‘ said God’s messenger led them in prayer over a Muslim and he heard him say, “O God, so and so son of so and so is in Thy protection and in Thy nearer presence, so guard him from the trial in the grave and the punishment in hell. Thou art faithful and true. O God, forgive him and show him mercy. Thou art the forgiving and the merciful One.” \n\nAbu Dawud and Ibn Majah transmitted it."}},{"id":151,"idInBook":151,"chapterId":5,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «اذْكُرُوا مَحَاسِنَ مَوْتَاكُمْ وَكُفُّوا عَنْ مُسَاوِيهِمْ» . رَوَاهُ أَبُو دَاوُدَ وَالتِّرْمِذِيُّ","english":{"narrator":"","text":"Ibn ‘Umar reported God’s messenger as saying, “Mention the good qualities of your dead and refrain from mentioning their bad ones.” \n\nAbu Dawud and Tirmidhi transmitted it."}},{"id":152,"idInBook":152,"chapterId":5,"bookId":14,"arabic":"وَعَنْ نَافِعٍ أَبِي غَالِبٍ قَالَ: صَلَّيْتُ مَعَ أَنَسِ بْنِ مَالِكٍ عَلَى جَنَازَةِ رَجُلٍ فَقَامَ حِيَال رَأسه ثمَّ جاؤوا بِجَنَازَةِ امْرَأَةٍ مِنْ قُرَيْشٍ فَقَالُوا: يَا أَبَا حَمْزَةَ صَلِّ عَلَيْهَا فَقَامَ حِيَالَ وَسَطِ السَّرِيرِ فَقَالَ لَهُ الْعَلَاءُ بْنُ زِيَادٍ: هَكَذَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَامَ على الْجِنَازَة مَقَامَكَ مِنْهَا؟ وَمِنَ الرَّجُلِ مَقَامَكَ مِنْهُ؟ قَالَ: نَعَمْ. رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ وَفِي رِوَايَةِ أَبِي دَاوُدَ نَحْوُهُ مَعَ زِيَادَةٍ وَفِيهِ: فَقَامَ عِنْد عجيزة الْمَرْأَة","english":{"narrator":"","text":"Nafi‘ Abu Ghalib said he prayed along with Anas b. Malik at a man's funeral and he stood opposite his head. Then some people brought along the bier of a woman of Quraish and said, “Abu Hamza (The kunya of Anas b. Malik, the Prophet’s servant), pray over her,” and he stood opposite the middle of the bier. Al-‘Ala’ b. Ziyad said to him, “Thus did I see God’s messenger do. He stood over the bier in the same position as you did in relation to her and in the same position as you did in relation to the man.” He replied, “That is so.” \n\nTirmidhi and Ibn Majah transmitted it. In Abu Dawud’s version there is something similar, along with an addition containing the words “He stood at the woman’s buttocks.”"}},{"id":153,"idInBook":153,"chapterId":5,"bookId":14,"arabic":"عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى قَالَ: كَانَ ابْن حنيف وَقيس ابْن سَعْدٍ قَاعِدَيْنِ بِالْقَادِسِيَّةِ فَمُرَّ عَلَيْهِمَا بِجَنَازَةٍ فَقَامَا فَقيل لَهما: إِنَّهَا مِنْ أَهْلِ الْأَرْضِ أَيْ مِنْ أَهْلِ الذِّمَّةِ فَقَالَا: إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّتْ بِهِ جَنَازَةٌ فَقَامَ فَقِيلَ لَهُ: إِنَّهَا جَنَازَة يَهُودِيّ. فَقَالَ: «أليست نفسا؟»","english":{"narrator":"","text":"‘Abd ar-Rahman b. Abu Laila said that Sahl b. Hunaif and Qais b. Sa'd were sitting at al-QadisIya when a bier was brought past them. They stood up, and when they were told that it was one of the people of the land, i.e. of the dhimmis( Protected communities such as Jews and Christians), they replied that a bier came past God’s messenger and he stood up. On being told that it contained a Jew he said, “Is it not a soul?” \n\n(Bukhari and Muslim.)"}},{"id":154,"idInBook":154,"chapterId":5,"bookId":14,"arabic":"وَعَنْ عُبَادَةَ بْنِ الصَّامِتِ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا تَبِعَ جَنَازَةً لَمْ يَقْعُدْ حَتَّى تُوضَعَ فِي اللَّحْدِ فَعَرَضَ لَهُ حَبْرٌ مِنَ الْيَهُودِ فَقَالَ لَهُ: إِنَّا هَكَذَا نضع يَا مُحَمَّدُ قَالَ: فَجَلَسَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ: «خَالِفُوهُمْ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ غَرِيبٌ وَبِشْرُ بْنُ رَافِعٍ الرَّاوِي لَيْسَ بِالْقَوِيّ","english":{"narrator":"","text":"‘Ubada b. as-Samit said that when God’s messenger followed a bier he did not sit down till the corpse was placed in the side of the grave. On being accosted by a learned Jew and told that that was how they did, God’s messenger sat down and said, “Act differently from them.” \n\nTirmidhi, Abu Dawud and Ibn Majah transmitted it, Tirmidhi saying that this is a gharib tradition and that Bishr b. Rafi' the transmitter was not strong."}},{"id":155,"idInBook":155,"chapterId":5,"bookId":14,"arabic":"وَعَنْ عَلِيٍّ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَنَا بِالْقِيَامِ فِي الْجَنَازَةِ ثُمَّ جَلَسَ بَعْدَ ذَلِكَ وَأَمَرَنَا بِالْجُلُوسِ. رَوَاهُ أَحْمد","english":{"narrator":"","text":"‘Ali said that God’s messenger had told them to stand at a funeral, but later he sat and ordered them to sit. \n\nAhmad transmitted it."}},{"id":156,"idInBook":156,"chapterId":5,"bookId":14,"arabic":"وَعَنْ مُحَمَّدِ بْنِ سِيرِينَ قَالَ: إِنَّ جَنَازَةً مَرَّتْ بِالْحَسَنِ بْنِ عَلِيٍّ وَابْنِ عَبَّاسٍ فَقَامَ الْحَسَنُ وَلَمْ يَقُمِ ابْنُ عَبَّاسٍ فَقَالَ الْحَسَنُ: أَلَيْسَ قَدْ قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِجَنَازَةِ يَهُودِيٍّ؟ قَالَ: نَعَمْ ثُمَّ جلس. رَوَاهُ النَّسَائِيّ","english":{"narrator":"","text":"Muhammad b. Sinn said that when a bier came past al-Hasan b. ‘All and Ibn ‘Abbas al-Hasan stood up but Ibn ‘Abbas did not, so al- Hasan said, “Did God’s messenger not stand up out of respect for the bier of a Jew ?” He replied, “Yes, but thereafter he sat.” \n\nNasa’i transmitted it."}},{"id":157,"idInBook":157,"chapterId":5,"bookId":14,"arabic":"وَعَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ أَنَّ الْحَسَنَ بْنَ عَلِيٍّ كَانَ جَالِسًا فَمُرَّ عَلَيْهِ بِجَنَازَةٍ فَقَامَ النَّاسُ حَتَّى جَاوَزَتِ الْجَنَازَةُ فَقَالَ الْحَسَنُ: إِنَّمَا مُرَّ بِجَنَازَةِ يَهُودِيٍّ وَكَانَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى طَرِيقِهَا جَالِسا وَكره أَن تعلوا رَأسه جَنَازَة يَهُودِيّ فَقَامَ. رَوَاهُ النَّسَائِيّ","english":{"narrator":"","text":"Ja'far b. Muhammad told on his father’s authority that when al- Hasan b. ‘All was sitting a bier was brought past him and the people stood up till the bier had gone by. Al-Hasan then said, “A bier carrying a Jew was brought past when God’s messenger was sitting in its path, and just because he did not like having a Jew’s bier higher than his head he stood up.”\n\nNasa’i transmitted it."}},{"id":158,"idInBook":158,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَبِي مُوسَى أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا مَرَّتْ بِكَ جَنَازَةُ يَهُودِيٍّ أَوْ نَصْرَانِيٍّ أَوْ مُسْلِمٍ فَقُومُوا لَهَا فَلَسْتُمْ لَهَا تَقُومُونَ إِنَّمَا تَقُومُونَ لِمَنْ مَعهَا من الْمَلَائِكَة» . رَوَاهُ أَحْمد","english":{"narrator":"","text":"Abu Musa reported God’s messenger as saying, “When the bier of a Jew, a Christian, or a Muslim passes you, stand up for it. You are not standing for its sake, but for the angels who are accompanying it.” \n\nAhmad transmitted it."}},{"id":159,"idInBook":159,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَنَسٍ أَنَّ جَنَازَةً مَرَّتْ بِرَسُولِ اللَّهِ فَقَامَ فَقِيلَ: إِنَّهَا جَنَازَةُ يَهُودِيٍّ فَقَالَ: «إِنَّمَا قُمْت للْمَلَائكَة» . رَوَاهُ النَّسَائِيّ","english":{"narrator":"","text":"Anas said that when a bier came past God’s messenger and he stood up he was told that it was carrying a Jew. He replied, “I stood up simply out of respect for the angels.” \n\nNasa’i transmitted it."}},{"id":160,"idInBook":160,"chapterId":5,"bookId":14,"arabic":"وَعَنْ مَالِكِ بْنِ هُبَيْرَةَ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَا مِنْ مُسْلِمٍ يَمُوتُ فَيُصَلِّي عَلَيْهِ ثَلَاثَةُ صُفُوفٍ مِنَ الْمُسْلِمِينَ إِلَّا أَوْجَبَ» . فَكَانَ مَالِكٌ إِذَا اسْتَقَلَّ أَهْلَ الْجَنَازَةِ جَزَّأَهُمْ ثَلَاثَةَ صُفُوفٍ لِهَذَا الْحَدِيثِ. رَوَاهُ أَبُو دَاوُدَ\nوَفِي رِوَايَةِ التِّرْمِذِيِّ: قَالَ كَانَ مَالِكُ بْنُ هُبَيْرَةَ إِذَا صَلَّى الْجِنَازَة فَتَقَالَّ النَّاسَ عَلَيْهَا جَزَّأَهُمْ ثَلَاثَةَ أَجْزَاءٍ ثُمَّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ صَلَّى عَلَيْهِ ثَلَاثَةُ صُفُوفٍ أَوْجَبَ» . وروى ابْن مَاجَه نَحوه","english":{"narrator":"","text":"Malik b. Hubaira said he heard God’s messenger say, “If any Muslim dies and three rows of Muslims pray over him it will assure him .” When Malik considered those who accompanied a bier to be few, he divided them into three rows in accordance with this tradition. \n\nAbu Dawud transmitted it. In Tirmidhi’s version he said that when Malik b. Hubaira prayed over a bier and found few people present, he divided them into three sections, then said that God’s messenger had stated, “If three rows pray over anyone it will assure him .” Ibn Majah transmitted something similar."}},{"id":161,"idInBook":161,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الصَّلَاةِ عَلَى الْجَنَازَةِ: \" اللَّهُمَّ أَنْتَ رَبُّهَا وَأَنْتَ خَلَقْتَهَا وَأَنْتَ هَدَيْتَهَا إِلَى الْإِسْلَامِ وَأَنْتَ قَبَضْتَ رُوحَهَا وَأَنْتَ أَعْلَمُ بِسِرِّهَا وَعَلَانِيَتِهَا جِئْنَا شُفَعَاءَ فَاغْفِرْ لَهُ. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Abu Huraira reported the Prophet as saying in the course of prayer over a dead body, “O God, Thou art its Lord, Thou didst create it, Thou didst guide it to Islam, Thou hast taken its spirit, and Thou knowest best its inner nature and outer aspect. We have come as intercessors, so forgive him.” \n\nAbu Dawud transmitted it."}},{"id":162,"idInBook":162,"chapterId":5,"bookId":14,"arabic":"وَعَنْ سَعِيدِ بْنِ الْمُسَيَّبِ قَالَ: صَلَّيْتُ وَرَاءَ أَبِي هُرَيْرَةَ عَلَى صَبِيٍّ لَمْ يَعْمَلْ خَطِيئَةً قَطُّ فَسَمِعْتُهُ يَقُولُ: اللَّهُمَّ أَعِذْهُ مِنْ عَذَابِ الْقَبْر. رَوَاهُ مَالك","english":{"narrator":"","text":"Sa'id b. al-Musayyib said he prayed behind Abu Huraira at the funeral of a boy who had never sinned and heard him say, “O God, protect him from the punishment in the grave.”\n\nMalik transmitted it."}},{"id":163,"idInBook":163,"chapterId":5,"bookId":14,"arabic":"وَعَنِ الْبُخَارِيِّ تَعْلِيقًا قَالَ: يَقْرَأُ الْحَسَنُ عَلَى الطِّفْلِ فَاتِحَةَ الْكِتَابِ وَيَقُولُ: اللَّهُمَّ اجْعَلْهُ لَنَا سلفا وفرطا وذخرا وَأَجرا","english":{"narrator":"","text":"Bukhari said without a complete isnad that al-Hasan (i.e. al-Hasan al-Basri (21-110. A.H ))  recited Fatihat al-Kitab over an infant and said, “O God, make him for us a righteous deed which has gone before us, a recompense gone ahead, a treasure and a reward.”"}},{"id":164,"idInBook":164,"chapterId":5,"bookId":14,"arabic":"وَعَنْ جَابِرٌ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الطِّفْلُ لَا يُصَلَّى عَلَيْهِ وَلَا يَرِثُ وَلَا يُوَرَّثُ حَتَّى يَسْتَهِلَّ» . رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ إِلَّا أَنَّهُ لَمْ يَذْكُرْ: «وَلَا يُورث»","english":{"narrator":"","text":"Jabir reported the Prophet as saying, “Prayer should not be said over an infant which has not uttered a sound, neither may he inherit nor leave an inheritance.” \n\nTirmidhi and Ibn Majah transmitted it, but the latter did not mention “nor leave an inheritance”."}},{"id":165,"idInBook":165,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَبِي مَسْعُودٍ الْأَنْصَارِيِّ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَقُومَ الْإِمَامُ فَوْقَ شَيْءٍ وَالنَّاسُ خَلْفَهُ يَعْنِي أَسْفَلَ مِنْهُ. رَوَاهُ الدراقطني وَأَبُو دَاوُد","english":{"narrator":"","text":"Abu Mas'ud al-Ansari said God’s messenger forbade that the imam should stand on anything when the people were behind him, meaning on a lower level than he was.\n\nDaraqutnl transmitted it in al-Mujtaba in Kitab al-jana’iz."}},{"id":166,"idInBook":166,"chapterId":5,"bookId":14,"arabic":"عَنْ عَامِرِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ أَن سَعْدِ بْنِ أَبِي وَقَّاصٍ قَالَ فِي مَرَضِهِ الَّذِي هَلَكَ فِيهِ: أَلْحِدُوا لِي لَحْدًا وَانْصِبُوا عَلَى اللَّبِنِ نَصْبًا كَمَا صُنِعَ بِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ. رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"‘Amir b. Sa‘d b. Abu Waqqas told that Sa‘d b. Abu Waqqas said during his illness of which he died, “Make a niche for me in the side of the grave, and set up bricks over me as was done with God’s messenger.” \n\nMuslim transmitted it."}},{"id":167,"idInBook":167,"chapterId":5,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: جُعِلَ فِي قَبْرِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَطِيفَةٌ حَمْرَاء. رَوَاهُ مُسلم","english":{"narrator":"","text":"Ibn ‘Abbas said that a piece of red stuff was put in God’s messenger’s grave. \n\nMuslim transmitted it."}},{"id":168,"idInBook":168,"chapterId":5,"bookId":14,"arabic":"وَعَنْ سُفْيَانَ التَّمَّارِ: أَنَّهُ رَأَى قَبْرَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُسَنَّمًا. رَوَاهُ الْبُخَارِيُّ","english":{"narrator":"","text":"Sufyan at-Tammar said he saw the grave of the Prophet humped. \n\nBukhari transmitted it."}},{"id":169,"idInBook":169,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَبِي الْهَيَّاجِ الْأَسَدِيِّ قَالَ: قَالَ لِي عَلِيٌّ: أَلَا أَبْعَثُكَ عَلَى مَا بَعَثَنِي عَلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِن لَا تَدَعَ تِمْثَالًا إِلَّا طَمَسْتَهُ وَلَا قَبْرًا مشرفا إِلَّا سويته. رَوَاهُ مُسلم","english":{"narrator":"","text":"Abul Hayyaj al-Asadi told that ‘Ali said to him, “I am sending you on the same mission as God’s messenger sent me. Do not leave an image without obliterating it, or a high grave without levelling it.” \n\nMuslim transmitted it."}},{"id":170,"idInBook":170,"chapterId":5,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُجَصَّصَ الْقَبْرُ وَأَنْ يُبْنَى عَلَيْهِ وَأَنْ يُقْعَدَ عَلَيْهِ. رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"Jabir said God’s messenger forbade that graves should be plastered with gypsum, that any erection should be built over them, and that people should sit on them. \n\nMuslim transmitted it."}},{"id":171,"idInBook":171,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَبِي مَرْثَدٍ الْغَنَوِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَجْلِسُوا عَلَى الْقُبُورِ وَلَا تُصَلُّوا إِلَيْهَا» . رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"Abu Marthad al-Ghanawi reported God’s messenger as saying, “Do not sit on graves, and do not pray facing them.” \n\nMuslim transmitted it."}},{"id":172,"idInBook":172,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَأَنْ يَجْلِسَ أَحَدُكُمْ عَلَى جَمْرَةٍ فَتُحْرِقَ ثِيَابَهُ فَتَخْلُصَ إِلَى جِلْدِهِ خَيْرٌ لَهُ مِنْ أَنْ يجلس على قبر» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “It is better that one of you should sit on live coals which burn his clothing and come in contact with his skin than that he should sit on a grave.” \n\nMuslim transmitted it."}},{"id":173,"idInBook":173,"chapterId":5,"bookId":14,"arabic":"عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ قَالَ: كَانَ بِالْمَدِينَةِ رَجُلَانِ أَحَدُهُمَا يَلْحَدُ وَالْآخَرُ لَا يَلْحَدُ. فَقَالُوا: أَيُّهُمَا جَاءَ أَوَّلًا عَمِلَ عَمَلَهُ. فَجَاءَ الَّذِي يَلْحَدُ فَلَحَدَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ. رَوَاهُ فِي شَرْحِ السّنة","english":{"narrator":"","text":"‘Urwa b. az-Zubair said there were two men in Medina, one of whom made a niche when digging a grave, the other of whom did not. The people said that the one who came first should do as he was accustomed to do, and the one who made a niche came and made one for God’s messenger. \n\n transmitted it in Sharh as-sunna."}},{"id":174,"idInBook":174,"chapterId":5,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «اللَّحْدُ لَنَا وَالشَّقُّ لغيرنا» رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد وَابْن مَاجَه\nوَرَوَاهُ أَحْمَدُ عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ","english":{"narrator":"","text":"Ibn ‘Abbas reported God’s messenger as saying, “The niche in the side of the grave is for us and the excavation in the middle is for others.” \n\nTirmidhi, Abu Dawud, Nasa’i and Ibn Majah transmitted it, and Ahmad transmitted it from Jarir b. ‘Abdallah."}},{"id":175,"idInBook":175,"chapterId":5,"bookId":14,"arabic":"وَعَنْ هِشَامِ بْنِ عَامِرٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَوْمَ أُحُدٍ: «احْفُرُوا وَأَوْسِعُوا وَأَعْمِقُوا وَأَحْسِنُوا وَادْفِنُوا الِاثْنَيْنِ وَالثَّلَاثَةَ فِي قبر وَاحِد وَقدمُوا أَكْثَرهم قُرْآنًا» . رَوَاهُ أمد وَالتِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالنَّسَائِيُّ وَرَوَى ابْنُ مَاجَهْ إِلَى قَوْله وأحسنوا","english":{"narrator":"","text":"Hisham b. ‘Amir told that the Prophet said on the day of Uhud, “Dig graves, make them wide, deep and beautiful, bury two or three together in a single grave, and put first the one who knew most of the Qur’an.” \n\nAhmad, Tirmidhi, Abu Dawud and Nasa'i transmitted it, and Ibn Majah transmitted up to “beautiful”."}},{"id":176,"idInBook":176,"chapterId":5,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: لَمَّا كَانَ يَوْمُ أُحُدٍ جَاءَتْ عَمَّتِي بِأَبِي لِتَدْفِنَهُ فِي مَقَابِرِنَا فَنَادَى مُنَادِي رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «رُدُّوا الْقَتْلَى إِلَى مَضَاجِعِهِمْ» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالنَّسَائِيُّ وَالدَّارِمِيُّ وَلَفظه لِلتِّرْمِذِي","english":{"narrator":"Jabir said:","text":"On the day of Uhud my paternal aunt brought my father to bury him in our cemetery, but God’s messenger’s crier called out, “Take back the dead to the place where they fell.” \n\nAhmad, Tirmidhi Abu Dawud, Nasa'i and Darimi transmitted it, the wording being Tirmidhi’s."}},{"id":177,"idInBook":177,"chapterId":5,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: سُلَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ قِبَلِ رَأْسِهِ. رَوَاهُ الشَّافِعِي","english":{"narrator":"","text":"Ibn 'Abbas said God’s messenger was lowered gently into the grave head first. \n\nShafi'i transmitted it."}},{"id":178,"idInBook":178,"chapterId":5,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ قَبْرًا لَيْلًا فَأُسْرِجَ لَهُ بسراج فَأخذ مِنْ قِبَلِ الْقِبْلَةِ وَقَالَ: «رَحِمَكَ اللَّهُ إِنْ كُنْتَ لَأَوَّاهًا تَلَّاءً لِلْقُرْآنِ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ فِي شرح السّنة: إِسْنَاده ضَعِيف","english":{"narrator":"","text":"He told that the Prophet entered a grave during the night, and when a lamp was lit for him he faced the qibla and said, “God have mercy on you if you were devoted to supplication with tears (The Arabic is awwah which cannot easily be translated by one word. It is variously explained as meaning one much given to sighing through fear of God, one much given to supplication from love of God, one much given to weeping from fefir, or one much given to prayer asking for God’s mercy. Cf. Mirqat, ii, 376) and to the recitation of the Qur’an.” \n\nTirmidhi transmitted it, but in Sharh as- sunna its isnad is said to be weak."}},{"id":179,"idInBook":179,"chapterId":5,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا أَدْخَلَ الْمَيِّتَ الْقَبْرَ قَالَ: «بِسم الله وَبِاللَّهِ وعَلى ملكة رَسُولِ اللَّهِ» . وَفِي رِوَايَةٍ: \" وَعَلَى سُنَّةِ رَسُولِ اللَّهِ. رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَابْنُ مَاجَهْ وَرَوَى أَبُو دَاوُد الثَّانِيَة","english":{"narrator":"","text":"Ibn ‘Umar told that when the dead was placed in the grave the Prophet said, “In the name of God, by God’s grace, and following the religion of God’s messenger.” A version has “And following the sunna of God’s messenger.” \n\nAhmad, Tirmidhi and Ibn Majah transmitted it, and Abu Dawud transmitted the second version."}},{"id":180,"idInBook":180,"chapterId":5,"bookId":14,"arabic":"وَعَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ مُرْسَلًا أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حثا عَلَى الْمَيِّتِ ثَلَاثَ حَثَيَاتٍ بِيَدَيْهِ جَمِيعًا وَأَنَّهُ رَشَّ عَلَى قَبْرِ ابْنِهِ إِبْرَاهِيمَ وَوَضَعَ عَلَيْهِ حَصْبَاءَ. رَوَاهُ فِي شَرْحِ السُّنَّةِ وَرَوَى الشَّافِعِيُّ من قَوْله: «رش»","english":{"narrator":"","text":"Ja'far b. Muhammad told in mursal form on his father’s authority that the Prophet cast three handfuls of earth on the dead with both hands, that he sprinkled water on his son Ibrahim’s grave, and that he put small pebbles on it. \n\nIt is transmitted in Sharh as-sunna, and Shafi’i transmitted from “he sprinkled\"."}},{"id":181,"idInBook":181,"chapterId":5,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَن تجصص الْقُبُور وَأَن يكْتب لعيها وَأَن تُوطأ. رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Jabir said God’s messenger forbade that graves should be plastered with gypsum, have any writing on them, or be trodden on. \n\nTirmidhi transmitted it."}},{"id":182,"idInBook":182,"chapterId":5,"bookId":14,"arabic":"وَعَن جَابر قَالَ: رُشَّ قَبْرُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَانَ الَّذِي رَشَّ الْمَاءَ عَلَى قَبْرِهِ بِلَالُ بْنُ رَبَاحٍ بِقِرْبَةٍ بَدَأَ مِنْ قِبَلِ رَأْسِهِ حَتَّى انْتَهَى إِلَى رِجْلَيْهِ. رَوَاهُ الْبَيْهَقِيُّ. فِي دَلَائِل النُّبُوَّة","english":{"narrator":"","text":"He said that the Prophet’s grave was sprinkled and that the one who sprinkled the water over his grave from a water-skin was Bilal b. Rabah. He began where the head was and sprinkled it to his feet. \n\nBaihaqi transmitted it in Dalail an-nubuwa."}},{"id":183,"idInBook":183,"chapterId":5,"bookId":14,"arabic":"وَعَنِ الْمُطَّلِبِ بْنِ أَبِي وَدَاعَةَ قَالَ: لَمَّا مَاتَ عُثْمَان ابْن مَظْعُونٍ أُخْرِجَ بِجَنَازَتِهِ فَدُفِنَ أَمَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلًا أَنْ يَأْتِيَهُ بِحَجَرٍ فَلم يسْتَطع حملهَا فَقَامَ إِلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَحَسَرَ عَنْ ذِرَاعَيْهِ. قَالَ الْمُطَّلِبُ: قَالَ الَّذِي يُخْبِرُنِي عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: كَأَنِّي أَنْظُرُ إِلَى بَيَاضِ ذِرَاعَيْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ حَسَرَ عَنْهُمَا ثُمَّ حَمَلَهَا فَوَضَعَهَا عِنْدَ رَأْسِهِ وَقَالَ: «أُعَلِّمُ بِهَا قَبْرَ أَخِي وَأَدْفِنُ إِلَيْهِ مَنْ مَاتَ من أَهلِي» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Al-Muttalib b. Abu Wada'a said that when ‘Uthman b. Maz'un died, was brought out on his bier and buried, the Prophet ordered a man to bring him a stone, but he was unable to carry it; so God’s messenger got up and, going over to it, rolled up his sleeves. Al-Muttalib remarked that the one who told him about God’s messenger said, “I still seem to see the whiteness of the forearms of God’s messenger when he rolled up his sleeves.” He then carried it and placed it at his head saying, “I am marking my brother’s grave with it, and I shall bury beside him those of my family who die.” \n\nAbu Dawud transmitted it."}},{"id":184,"idInBook":184,"chapterId":5,"bookId":14,"arabic":"وَعَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ قَالَ: دَخَلْتُ عَلَى عَائِشَةَ فَقُلْتُ: يَا أُمَّاهُ اكْشِفِي لِي عَنْ قَبْرِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَصَاحِبَيْهِ فَكَشَفَتْ لِي عَنْ ثَلَاثَةِ قُبُورٍ لَا مُشْرِفَةٍ وَلَا لَا طئة مَبْطُوحَةٍ بِبَطْحَاءِ الْعَرْصَةِ الْحَمْرَاءِ. رَوَاهُ أَبُو دَاوُدَ","english":{"narrator":"","text":"Al-Qasim b. Muhammad told of his going to visit ‘A’isha and saying, “Mother, show me the grave of the Prophet and his two companions.” She showed him three graves which were neither high nor low, but were spread over with soft red pebbles in an open space. \n\nAbu Dawud transmitted it."}},{"id":185,"idInBook":185,"chapterId":5,"bookId":14,"arabic":"وَعَنِ الْبَرَاءِ بْنِ عَازِبٍ قَالَ: خَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي جَنَازَة رجل من الْأَنْصَار فَانْتَهَيْنَا إِلَى الْقَبْر وَلما يُلْحَدْ بَعْدُ فَجَلَسَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُسْتَقْبِلَ الْقِبْلَةِ وَجَلَسْنَا مَعَهُ. رَوَاهُ أَبُو دَاوُدَ وَالنَّسَائِيُّ وَابْنُ مَاجَهْ وَزَادَ فِي آخِرِهِ: كن على رؤوسنا الطير","english":{"narrator":"","text":"Al-Bara’ b. ‘Azib said, “We went out with God’s messenger to the funeral of a man of the Ansar, but when we reached the grave the niche in the side had not yet been made, so the Prophet sat down facing the qibla and we sat down along with him.” \n\nAbu Dawud, Nasa’i and Ibn Majah transmitted it, Ibn Majah adding “quietly”. (Literally, as though the birds were over our heads. An explanation of the phrase is that when a bird alights on a camel’s head and begins to pick the ticks off it, the camel stands perfectly still so as not to frighten it away.)"}},{"id":186,"idInBook":186,"chapterId":5,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «كَسْرُ عَظْمِ الْمَيِّتِ كَكَسْرِهِ حَيًّا» . رَوَاهُ مَالِكٌ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ","english":{"narrator":"","text":"‘A’isha reported God’s messenger as saying, “Breaking a dead man’s bone is like breaking it when he is alive.” \n\nMalik, Abu Dawud and Ibn Majah transmitted it."}},{"id":187,"idInBook":187,"chapterId":5,"bookId":14,"arabic":"عَنْ أَنَسٍ قَالَ: شَهِدْنَا بِنْتَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تُدْفَنُ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَالِسٌ عَلَى الْقَبْرِ فَرَأَيْتُ عَيْنَيْهِ تَدْمَعَانِ فَقَالَ: \n\" هَلْ فِيكُمْ مَنْ أَحَدٍ لَمْ يُقَارِفِ اللَّيْلَةَ؟ . فَقَالَ أَبُو طَلْحَةَ: أَنَا. قَالَ: فَانْزِلْ فِي قَبْرِهَا فَنَزَلَ فِي قبرها \". رَوَاهُ البُخَارِيّ","english":{"narrator":"Anas said:","text":"I was present when the daughter of God’s messenger was being buried. He was sitting beside the grave and I saw his eyes shedding tears. He then asked, “Is there any of you who did not have sexual intercourse last night?” Abu Talha replied that he had not, so he told him to go down into her grave, and he did so. \n\nBukhari transmitted it."}},{"id":188,"idInBook":188,"chapterId":5,"bookId":14,"arabic":"وَعَنْ عَمْرِو بْنِ الْعَاصِ قَالَ لِابْنِهِ وَهُوَ فِي سِيَاقِ الْمَوْتِ: إِذَا أَنَا مُتُّ فَلَا تَصْحَبْنِي نَائِحَةٌ وَلَا نَارٌ فَإِذَا دَفَنْتُمُونِي فَشُنُّوا عَلَيَّ التُّرَابَ شَنًّا ثُمَّ أَقِيمُوا حَوْلَ قَبْرِي قَدْرَ مَا يُنْحَرُ جَزُورٌ وَيُقَسَّمُ لَحْمُهَا حَتَّى أَسْتَأْنِسَ بِكُمْ وَأَعْلَمَ مَاذَا أُرَاجِعُ بِهِ رُسُلَ رَبِّي. رَوَاهُ مُسلم","english":{"narrator":"","text":"‘Amr b. al-‘As said to his son when he was in the throes of death, “When I die let no wailing woman or fire accompany me, and when you bury me scatter earth lightly over me, then stand round my grave as long as it takes to sacrifice an animal and have its flesh distributed, so that I may feel you near and know what to answer my Lord’s messengers.”( i.e. Munkar and Naklr who examine the dead in the grave)\n\nMuslim transmitted it."}},{"id":189,"idInBook":189,"chapterId":5,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَ: سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِذَا مَاتَ أَحَدُكُمْ فَلَا تَحْبِسُوهُ وَأَسْرِعُوا بِهِ إِلَى قَبْرِهِ وَلْيُقْرَأْ عِنْدَ رَأْسِهِ فَاتِحَةُ الْبَقَرَةِ وَعِنْدَ رِجْلَيْهِ بِخَاتِمَةِ الْبَقَرَةِ» . رَوَاهُ الْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَان. وَقَالَ: وَالصَّحِيح أَنه مَوْقُوف عَلَيْهِ","english":{"narrator":"","text":"‘Abdallah b. ‘Umar said he heard the Prophet say, “When one of you dies do not keep him long, but take him quickly to his grave, and have the opening verses of sura al-Baqara recited at his head and the concluding verses of the same sura at his feet.” \n\nBaihaqi transmitted it in Shu'ab al-iman, saying the correct view is that it does not go farther back than him."}},{"id":190,"idInBook":190,"chapterId":5,"bookId":14,"arabic":"وَعَنِ ابْنِ أَبِي مُلَيْكَةَ قَالَ: لَمَّا تُوُفِّيَ عبد الرَّحْمَن بن أبي بكر بالحبشي (مَوضِع قريب من مَكَّة)\nوَهُوَ مَوْضِعٌ فَحُمِلَ إِلَى مَكَّةَ فَدُفِنَ بِهَا فَلَمَّا قَدِمَتْ عَائِشَةُ أَتَتْ قَبْرَ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ فَقَالَتْ:\nوَكُنَّا كَنَدْمَانَيْ جَذِيمَةَ حِقْبَةً مِنَ الدَّهْرِ حَتَّى قِيلَ لَنْ يَتَصَدَّعَا\nفَلَمَّا تَفَرَّقْنَا كَأَنِّي وَمَالِكًا لِطُولِ اجْتِمَاعٍ لَمْ نَبِتْ لَيْلَةً مَعَا\nثُمَّ قَالَتْ: وَاللَّهِ لَوْ حَضَرْتُكَ مَا دُفِنْتَ إِلَّا حَيْثُ مُتَّ وَلَوْ شهدتك مَا زرتك رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"Ibn Abu Mulaika said that when ‘Abd ar-Rahman b. Abu Bakr died in al-Hubshi, the name of a palce, he was conveyed to Mecca and buried there. When ‘A’isha arrived she went to the grave of ‘Abd ar. Rahman b. Abu Bakr and said:","text":"We were like the companions of Jadhima (Jadhima was a legendary pre-Islamic king with his centre in al-Anbar. He had two boon- companions, 'Aqil and Malik, who are said to have been together for forty years. The verses are from a lament by Mutammim b. Nuwaira al-Yarbu'i over his brother Malik) for a long time, so that people said the two will never be separated.\nBut when we separated it seemed, in spite of long association, as if Malik and I had not spent a single night together.\nShe then said, “I swear by God that if I had been present with you, you would have been buried nowhere but where you died, and if I had been with you I would not have visited you.” \n\nTirmidhi transmitted it."}},{"id":191,"idInBook":191,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَبِي رَافِعٍ قَالَ: سَلَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَعْدًا وَرَشَّ عَلَى قَبره مَاء. رَوَاهُ ابْن مَاجَه","english":{"narrator":"","text":"Abu Rafi‘ said that God's messenger lowered Sa‘d and sprinkled water over his grave.\n\nIbn Majah transmitted it."}},{"id":192,"idInBook":192,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى عَلَى جَنَازَةٍ ثُمَّ أَتَى الْقَبْر فَحَثَا عَلَيْهِ مِنْ قِبَلِ رَأْسِهِ ثَلَاثًا. رَوَاهُ ابْنُ مَاجَه","english":{"narrator":"","text":"Abu Huraira said that God’s messenger prayed over a bier, then went to the grave and threw three handfuls of earth towards the head of the dead man. \n\nIbn Majah transmitted it."}},{"id":193,"idInBook":193,"chapterId":5,"bookId":14,"arabic":"وَعَنْ عَمْرِو بْنِ حَزْمٍ قَالَ: رَآنِي النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُتَّكِئًا عَلَى قَبْرٍ فَقَالَ: لَا تؤذ صَاحب هَذَا الْقَبْر أَولا تؤذه. رَوَاهُ أَحْمد","english":{"narrator":"","text":"‘Amr b. Hazm told how, when the Prophet saw him leaning on a grave, he said, “Do not molest the occupant of this grave”; or, “Do not molest it.” \n\nAhmad transmitted it."}},{"id":194,"idInBook":194,"chapterId":5,"bookId":14,"arabic":"عَنْ أَنَسٍ قَالَ: دَخَلْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى أَبِي سَيْفٍ الْقَيْنِ وَكَانَ ظِئْرًا لِإِبْرَاهِيمَ فَأَخَذَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِبْرَاهِيمَ فَقَبَّلَهُ وَشَمَّهُ ثُمَّ دَخَلْنَا عَلَيْهِ بَعْدَ ذَلِكَ وَإِبْرَاهِيمُ يَجُودُ بِنَفْسِهِ فَجَعَلَتْ عَيْنَا رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَذْرِفَانِ. فَقَالَ لَهُ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ: وَأَنْتَ يَا رَسُولَ اللَّهِ؟ فَقَالَ: \n\" يَا ابْنَ عَوْفٍ إِنَّهَا رَحْمَةٌ ثُمَّ أَتْبَعَهَا بِأُخْرَى فَقَالَ: إِنَّ الْعَيْنَ تَدْمَعُ وَالْقَلْبَ يَحْزَنُ وَلَا نَقُولُ إِلَّا مَا يُرْضِي رَبَّنَا وَإِنَّا بِفِرَاقِك يَا إِبْرَاهِيم لَمَحْزُونُونَ \"","english":{"narrator":"Anas said:","text":"We went in with God’s messenger to visit Abu Saif the smith who was foster-father of Ibrahim (The Prophet’s son who died in infancy), and God’s messenger took Ibrahim, kissed him and smelt him. We went in to visit him later when Ibrahim was giving up his soul, and tears began to fall from God’s messenger's eyes, whereupon ‘Abd ar-Rahman b. ‘Auf said to him, “You too, messenger of God?” He replied, “Ibn ‘Auf, it is compassion,” then shed more tears and said, “The eye weeps and the heart grieves, but we say only what our Lord is pleased with, and we are grieved over being separated from you, Ibrahim.”\n\n(Bukhari and Muslim.)"}},{"id":195,"idInBook":195,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أُسَامَةَ بْنِ زَيْدٍ قَالَ: أَرْسَلَتِ ابْنَةُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَيْهِ: إِنَّ ابْنًا لِي قُبِضَ فَأْتِنَا. فَأَرْسَلَ يُقْرِئُ السَّلَامَ وَيَقُولُ: «إِنَّ لِلَّهِ مَا أَخَذَ وَلَهُ مَا أَعْطَى وَكُلٌّ عِنْدَهُ بِأَجَلٍ مُسَمًّى فَلْتَصْبِرْ وَلْتَحْتَسِبْ» . فَأَرْسَلَتْ إِلَيْهِ تُقْسِمُ عَلَيْهِ لَيَأْتِيَنَّهَا فَقَامَ وَمَعَهُ سَعْدُ بْنُ عُبَادَةَ وَمُعَاذُ بْنُ جبل وَأبي بن كَعْب وَزيد ابْن ثَابِتٍ وَرِجَالٌ فَرُفِعَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الصَّبِيُّ وَنَفْسُهُ تَتَقَعْقَعُ فَفَاضَتْ عَيْنَاهُ. فَقَالَ سَعْدٌ: يَا رَسُولَ اللَّهِ مَا هَذَا؟ فَقَالَ: «هَذِهِ رَحْمَةٌ جَعَلَهَا اللَّهُ فِي قُلُوبِ عِبَادِهِ. فَإِنَّمَا يَرْحَمُ اللَّهُ مِنْ عِبَادِهِ الرُّحَمَاء»","english":{"narrator":"","text":"Usama b. Zaid said the Prophet’s daughter sent him a message telling him that a son of hers was dying and asking him to come to them. He sent her a greeting, saying at the same time, “What God has taken belongs to Him, what He has given belongs to Him, and He has an appointed time for everyone, so let her show endurance and seek her reward from God.” She then sent adjuring him to come to her, and he got up to go accompanied by Sa'd b. ‘Ubada, Mu'adh b. Jabal, Ubayy b. Ka'b, Zaid b. Thabit and some other men. The boy who was on the point of death (This is an attempt to express the meaning of the Arabic which says literally ‘his soul was disquieted ) was lifted up to God’s messenger whose eyes overflowed with tears. Sa'd said, “What is this, messenger of God?” He replied, “This is compassion which God has placed in the hearts of His servants. God shows compassion only to those of His servants who are compassionate.” \n\n(Bukhari and Muslim.)"}},{"id":196,"idInBook":196,"chapterId":5,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَ: اشْتَكَى سَعْدُ بْنُ عُبَادَةَ شَكْوًى لَهُ فَأَتَاهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعُودُهُ مَعَ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ وَسَعْدِ بْنِ أَبِي وَقَّاصٍ وَعَبْدِ اللَّهِ بْنِ مَسْعُودٍ فَلَمَّا دَخَلَ عَلَيْهِ وَجَدَهُ فِي غَاشِيَةٍ فَقَالَ: (قَدْ قَضَى؟ قَالُوا: لَا يَا رَسُولَ اللَّهِ فَبَكَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا رَأَى الْقَوْمُ بُكَاءَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَكَوْا فَقَالَ: أَلَا تَسْمَعُونَ؟ أَنَّ اللَّهَ لَا يُعَذِّبُ بِدَمْعِ الْعَيْنِ وَلَا بِحُزْنِ الْقَلْبِ وَلَكِنْ يُعَذِّبُ بِهَذَا وَأَشَارَ إِلَى لِسَانِهِ أَوْ يَرْحَمُ وَإِن الْمَيِّت لعيذب ببكاء أَهله","english":{"narrator":"","text":"‘Abdallah b. ‘Umar said that when Sa'd b. ‘Ubada complained of a trouble, the Prophet came to visit him accompanied by ‘Abd ar-Rahman b. ‘Auf, Sa'd b. Abu Waqqas and ‘Abdallah b. Mas'ud. On entering and finding him in a bad way (Or, in a faint) he suggested that his end was near, but was assured that that was not so. The Prophet wept, and when the people saw him weeping they wept also. He then said, \"Listen; God does not punish for the tears the eye sheds or the grief the heart experiences, but He punishes for this (pointing to his tongue), or He shows compassion; and the dead is punished because of his family’s weeping for him.\"( Cf. the second tradition in section III where 'A’isha says Ibn ‘Umar has forgotten or made a mistake. This has given rise to much discussion and efforts have been made to show that the tradition of Ibn ‘Umar refers particularly to excessive weeping and wailing, or to the desire of pre-Islamic Arabs that people should lament them to an excessive extent when they died. The reference to the tongue indicates loud lamentation in contrast to silent weeping)\n\n(Bukharl and Muslim.)"}},{"id":197,"idInBook":197,"chapterId":5,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَيْسَ مِنَّا مَنْ ضَرَبَ الْخُدُودَ وَشَقَّ الْجُيُوبَ وَدَعَا بِدَعْوَى الْجَاهِلِيَّةِ»","english":{"narrator":"","text":"'Abdallah b. Mas'ud reported God’s messenger as saying, \"He who beats the cheeks, tears the front of the garments, and cries out as people did in pre-Islamic times, does not belong to us.\" \n\n(Bukhari and Muslim.)"}},{"id":198,"idInBook":198,"chapterId":5,"bookId":14,"arabic":"وَعَن أبي بردة قَالَ: أُغمي على أبي مُوسَى فَأَقْبَلَتِ امْرَأَتُهُ أُمُّ عَبْدِ اللَّهِ تَصِيحُ بِرَنَّةٍ ثُمَّ أَفَاقَ فَقَالَ: أَلَمْ تَعْلَمِي؟ وَكَانَ يُحَدِّثُهَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أَنَا بَرِيءٌ مِمَّنْ حَلَقَ وَصَلَقَ وَخَرَقَ» . وَلَفظه لمُسلم","english":{"narrator":"","text":"Abu Burda said that Abu Musa al-Ash'ari fainted and his wife Umm ‘Abdallah began to shout with a piercing cry. He then came round, and asking her if she was quite ignorant, he told her that God’s messenger had said, \"I have no connection with one who shaves, shouts and tears his clothing.\" \n\n(Bukharl and Muslim, the wording being Muslim's.)"}},{"id":199,"idInBook":199,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَبِي مَالِكٍ الْأَشْعَرِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" أَرْبَعٌ فِي أُمَّتِي مِنْ أَمْرِ الْجَاهِلِيَّةِ لَا يَتْرُكُونَهُنَّ: الْفَخْرُ فِي الْأَحْسَابِ وَالطَّعْنُ فِي الْأَنْسَابِ وَالِاسْتِسْقَاءُ بِالنُّجُومِ وَالنِّيَاحَةُ \". وَقَالَ: «النَّائِحَةُ إِذَا لَمْ تَتُبْ قَبْلَ مَوْتِهَا تُقَامُ يَوْمَ الْقِيَامَةِ وَعَلَيْهَا سِرْبَالٌ مِنْ قطران وَدرع من جرب» . رَوَاهُ مُسلم","english":{"narrator":"Abu Malik al-Ash'ari reported God’s messenger as saying, \"Among my people there are four characteristics belonging to the pre-Islamic period which they do not abandon:","text":"boasting of high rank, reviling other people’s genealogies, seeking rain by the stars, and wailing.\" And he said, \"If the wailing-woman does not repent before she dies, she will be made to stand on the day of resurrection wearing a garment of pitch and a chemise of mange.” \n\nMuslim transmitted it."}},{"id":200,"idInBook":200,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: مَرَّ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِامْرَأَةٍ تَبْكِي عِنْدَ قَبْرٍ فَقَالَ: «اتَّقِي اللَّهَ وَاصْبِرِي» قَالَتْ: إِلَيْكَ عَنِّي فَإِنَّكَ لَمْ تُصَبْ بِمُصِيبَتِي وَلَمْ تَعْرِفْهُ فَقِيلَ لَهَا: إِنَّهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ. فَأَتَتْ بَابَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمْ تَجِدْ عِنْدَهُ بَوَّابِينَ فَقَالَتْ: لَمْ أَعْرِفْكَ. فَقَالَ: «إِنَّمَا الصَّبْرُ عِنْدَ الصَّدْمَةِ الْأُولَى»","english":{"narrator":"","text":"Anas told that when the Prophet came upon a woman weeping at a grave he said, \"Fear God and show endurance.” She, not recognising him, replied, \"Go away, for you have not been afflicted as I have.” She was told that he was the Prophet, so she went to his door, and finding no doorkeepers there she said, \"I did not recognise you.\" He replied, \"Endurance is shown only at the first blow.” \n\n(Bukharl and Muslim.)"}},{"id":201,"idInBook":201,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «لَا يَمُوت لمُسلم ثَلَاث مِنَ الْوَلَدِ فَيَلِجُ النَّارَ إِلَّا تَحِلَّةَ الْقَسَمِ»","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “No Muslim will suffer the death of three sons and go to hell, except to expiate the oath.”(Cf. Qur'an, xix, 71, which says everyone shall go down to it, and that this is a decree from God which must be accomplished. The meaning of the tradition is said to be that such people will go for a very brief time which will be enough to make this decree no longer applicable to them. The decree is treated as equivalent to an oath)\n\n(Bukharl and Muslim.)"}},{"id":202,"idInBook":202,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِنِسْوَةٍ مِنَ الْأَنْصَارِ: \n\" لَا يَمُوتُ لِإِحْدَاكُنَّ ثَلَاثَةٌ من الْوَلَد فتحتسبه إِلَّا دخلت الْجنَّة. فَقَالَ امْرَأَةٌ مِنْهُنَّ: أَوِ اثْنَانِ يَا رَسُولَ اللَّهِ؟ قَالَ: أَوْ اثْنَانِ \". رَوَاهُ مُسْلِمٌ وَفِي رِوَايَةٍ لَهما: «ثَلَاثَة لم يبلغُوا الْحِنْث»","english":{"narrator":"","text":"He reported God’s messenger as saying to some women of the Ansar, “None of you will lose three children by death and seek a reward from God without entering paradise.” One of them asked, “Or two, messenger of God?” He replied, “Or two.” \n\nMuslim transmitted it. Bukharl and Muslim have a version which says, “three who were not old enough to sin.”"}},{"id":203,"idInBook":203,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" يَقُولُ اللَّهُ: مَا لِعَبْدِي الْمُؤْمِنِ عِنْدِي جَزَاءٌ إِذَا قَبَضْتُ صَفِيَّهُ مِنْ أَهْلِ الدُّنْيَا ثُمَّ احتسبه إِلَّا الْجنَّة \". رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"He reported God’s messenger as declaring that God says, “When I take away from my believing servant his favourite friend among the people of this world and he seeks his reward from me, he will have no other reward from me but paradise.” \n\nBukhari transmitted it."}},{"id":204,"idInBook":204,"chapterId":5,"bookId":14,"arabic":"عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: لَعَنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ النَّائِحَةَ وَالْمُسْتَمِعَةَ. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Abd Sa'id al-Khudri said that God’s messenger cursed the wailing-woman and the woman who listens to her. \n\nAbu Dawud transmitted it."}},{"id":205,"idInBook":205,"chapterId":5,"bookId":14,"arabic":"وَعَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" عَجَبٌ لِلْمُؤْمِنِ: إِنْ أَصَابَهُ خَيْرٌ حمد الله وَشَكَرَ وَإِنْ أَصَابَتْهُ مُصِيبَةٌ حَمِدَ اللَّهَ وَصَبَرَ فالمؤمن يُؤْجَرُ فِي كُلِّ أَمْرِهِ حَتَّى فِي اللُّقْمَةِ يَرْفَعُهَا إِلَى فِي امْرَأَتِهِ. رَوَاهُ الْبَيْهَقِيُّ فِي شعب الْإِيمَان","english":{"narrator":"","text":"Sa'd b. Abu Waqqas reported God’s messenger as saying, “It is a fine thing when a believer praises and thanks God if good comes to him, and praises God and shows endurance if smitten by affliction. ' The believer is rewarded for everything, even for the morsel he raises to his wife’s mouth.”(The idea of the tradition is that by virtue of his faith the believer receives a reward for all his actions, none being too insignificant)\n\nBaihaqi transmitted it in Shu'ab al-iman."}},{"id":206,"idInBook":206,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" مَا مِنْ مُؤْمِنٍ إِلَّا وَله بَابَانِ: بَاب يصعد مِنْهُ علمه وَبَابٌ يَنْزِلُ مِنْهُ رِزْقُهُ. فَإِذَا مَاتَ بَكَيَا عَلَيْهِ فَذَلِكَ قَوْلُهُ تَعَالَى: (فَمَا بَكَتْ عَلَيْهِمُ السَّمَاء وَالْأَرْض)\nرَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Anas reported God’s messenger as saying, “Every believer has two gates, one by which deeds ascend and one by which his provision comes down, and when he dies they weep for him.” That agrees with God's words, “Neither the heaven nor the earth wept for them.”(Qur’an xliv, 29) \n\nTirmidhi transmitted it."}},{"id":207,"idInBook":207,"chapterId":5,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:\nمَنْ كَانَ لَهُ فرطان من متي أَدْخَلَهُ اللَّهُ بِهِمَا الْجَنَّةَ \". فَقَالَتْ عَائِشَةُ: فَمَنْ كَانَ لَهُ فَرَطٌ مَنْ أُمَّتِكَ؟ قَالَ: «وَمَنْ كَانَ لَهُ فَرَطٌ يَا مُوَفَّقَةُ» . فَقَالَتْ: فَمَنْ لَمْ يَكُنْ لَهُ فَرَطٌ مِنْ أُمَّتِكَ؟ قَالَ: «فَأَنَا فَرَطُ أُمَّتِي لَنْ يُصَابُوا بِمِثْلِي» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ غَرِيبٌ","english":{"narrator":"","text":"Ibn ‘Abbas reported God’s messenger as saying, “If any member of my people has two children who die before him, God will cause him to enter paradise on their account.” ‘A’isha asked, “Does it apply to a member of your people who has one child who dies before him?” He replied, “It does, you who have been helped by God to ask this.” She then asked, “What about a member of your people who has no children who die before him?” He replied, “I am the one who dies before my people, and they will never suffer any loss to compare with the loss of me.” \n\nTirmidhi transmitted it, saying this is a gharib tradition."}},{"id":208,"idInBook":208,"chapterId":5,"bookId":14,"arabic":"وَعَن أبي مُوسَى اشعري قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" إِذَا مَاتَ وَلَدُ الْعَبْدِ قَالَ اللَّهُ تَعَالَى لِمَلَائِكَتِهِ: قَبَضْتُمْ وَلَدَ عَبْدِي؟ فَيَقُولُونَ: نَعَمْ. فَيَقُولُ: قَبَضْتُمْ ثَمَرَةَ فُؤَادِهِ؟ فَيَقُولُونَ: نَعَمْ. فَيَقُولُ: مَاذَا قَالَ عَبْدِي؟ فَيَقُولُونَ: حَمِدَكَ وَاسْتَرْجَعَ. فَيَقُولُ اللَّهُ: ابْنُوا لِعَبْدِي بَيْتًا فِي الْجَنَّةِ وَسَمُّوهُ بَيت الْحَمد \". رَوَاهُ أَحْمد وَالتِّرْمِذِيّ","english":{"narrator":"Abu Musa al-Ash'ari reported God's messenger as saying:","text":"When a man's child dies God most high asks His angels whether they have taken His servant's child and they reply that they have. He then asks whether they have taken the fruit of his heart (This is said by some to mean either children or grandchildren, and a basis for that meaning is found in Qur’an, ii, 155, where the plural ath-thamarat is interpreted that way), and when they reply that they have, He asks what His servant said. On their replying that he praised God and said, “We belong to God and to Him do we return,” God says, “Build a house in paradise for my servant and call it the house of praise.” \n\nAhmad and Tirmidhi transmitted it."}},{"id":209,"idInBook":209,"chapterId":5,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «من عَزَّى مُصَابًا فَلَهُ مِثْلُ أَجْرِهِ» . رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ مَرْفُوعًا إِلَّا مِنْ حَدِيثِ عَلِيِّ بْنِ عَاصِمٍ الرَّاوِي وَقَالَ: وَرَوَاهُ بَعْضُهُمْ عَنْ مُحَمَّد بن سوقة بِهَذَا الْإِسْنَاد مَوْقُوفا","english":{"narrator":"","text":"‘Abdallah b. Mas'ud reported God's messenger as saying, “If anyone comforts one who has been afflicted he will have a reward equivalent to his.” \n\nTirmidhi and Ibn Majah transmitted it, Tirmidhi saying this is a gharib tradition which was known to him as traced back to the Prophet only among the traditions of ‘Ali b. ‘Asim the transmitter. He added that some transmitted it with this isnad from Muhammad b. Suqa in mauquf form."}},{"id":210,"idInBook":210,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَبِي بَرْزَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ عَزَّى ثَكْلَى كسي بردا فِي الْجَنَّةِ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ غَرِيب","english":{"narrator":"","text":"Abu Barza reported God’s messenger as saying, “He who comforts a bereaved woman will be clothed with a striped garment in paradise.” \n\nTirmidhi transmitted it, saying this is a gharib tradition."}},{"id":211,"idInBook":211,"chapterId":5,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ قَالَ: لَمَّا جَاءَ نَعْيُ جَعْفَرٍ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسلم: صانعوا لِآلِ جَعْفَرٍ طَعَامًا فَقَدْ أَتَاهُمْ مَا يَشْغَلُهُمْ)\nرَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ","english":{"narrator":"","text":"‘Abdallah b. Ja'far told that when the news of Ja'far’s death came the Prophet said, “Prepare food for Ja'far’s family, for they have heard something which takes up their whole attention.” \n\nTirmidhi, Abu Dawud and Ibn Majah transmitted it."}},{"id":212,"idInBook":212,"chapterId":5,"bookId":14,"arabic":"عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم يَقُول: «من نِيحَ عَلَيْهِ فَإِنَّهُ يُعَذَّبُ بِمَا نِيحَ عَلَيْهِ يَوْم الْقِيَامَة»","english":{"narrator":"","text":"Al-Mughira b. Shu'ba said he heard God’s messenger say, “If people wail for anyone he will be punished for it on the day of resurrection.” \n\n(Bukharl and Muslim.)"}},{"id":213,"idInBook":213,"chapterId":5,"bookId":14,"arabic":"وَعَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ أَنَّهَا قَالَتْ: سَمِعْتُ عَائِشَةَ وَذُكِرَ لَهَا أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ يَقُولُ: إِنَّ الْمَيِّتَ لَيُعَذَّبُ بِبُكَاءِ الْحَيِّ عَلَيْهِ تَقُولُ: يَغْفِرُ اللَّهُ لِأَبِي عَبْدِ الرَّحْمَنِ أَمَا إِنَّهُ لَمْ يَكْذِبْ وَلَكِنَّهُ نَسِيَ أَوْ أَخْطَأَ إِنَّمَا مَرَّ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى يَهُودِيَّةٍ يُبْكَى عَلَيْهَا فَقَالَ: «إِنَّهُمْ لَيَبْكُونَ عَلَيْهَا وَإِنَّهَا لتعذب فِي قبرها»","english":{"narrator":"","text":"‘Amra daughter of ‘Abd ar-Rahman said that when ‘A’isha was told that ‘Abdallah b. ‘Umar said the dead was punished because of the weeping of the living for him, she heard her say, “God forgive Abu ‘Abd ar-Rahman ! He has not lied, but he has forgotten, or has made a mistake. What happened was just that God’s messenger came upon some people weeping for a Jewess and said, ‘They are weeping for her, and she is being punished in her grave.’ ”\n\n(Bukharl and Muslim.)"}},{"id":214,"idInBook":214,"chapterId":5,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ أَبِي مُلَيْكَةَ قَالَ: تُوُفِّيَتْ بِنْتٌ لِعُثْمَانَ بْنِ عَفَّانَ بِمَكَّةَ فَجِئْنَا لِنَشْهَدَهَا وَحَضَرَهَا ابْنُ عُمَرَ وَابْنُ عَبَّاسٍ فَإِنِّي لَجَالِسٌ بَيْنَهُمَا فَقَالَ عَبْدُ اللَّهِ بن عمر لعَمْرو بْنِ عُثْمَانَ وَهُوَ مُوَاجِهُهُ: أَلَا تَنْهَى عَنِ الْبُكَاءِ؟ فَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ الْمَيِّتَ لَيُعَذَّبُ بِبُكَاءِ أَهْلِهِ عَلَيْهِ» . فَقَالَ ابْنُ عَبَّاسٍ: قَدْ كَانَ عُمَرُ يَقُولُ بَعْضَ ذَلِكَ. ثُمَّ حَدَّثَ فَقَالَ: صَدَرْتُ مَعَ عُمَرَ مِنْ مَكَّةَ حَتَّى إِذَا كُنَّا بِالْبَيْدَاءِ فَإِذَا هُوَ بِرَكْبٍ تَحْتَ ظِلِّ سَمُرَةٍ فَقَالَ: اذْهَبْ فَانْظُرْ مَنْ هَؤُلَاءِ الرَّكْبُ؟ فَنَظَرْتُ فَإِذَا هُوَ صُهَيْبٌ. قَالَ: فَأَخْبَرْتُهُ فَقَالَ: ادْعُهُ فَرَجَعْتُ إِلَى صُهَيْبٍ فَقُلْتُ: ارْتَحِلْ فَالْحَقْ أَمِيرَ الْمُؤْمِنِينَ فَلَمَّا أَنْ أُصِيبَ عُمَرُ دَخَلَ صُهَيْبٌ يبكي يَقُول: وَا أَخَاهُ واصاحباه. فَقَالَ عُمَرُ: يَا صُهَيْبُ أَتَبْكِي عَلَيَّ وَقَدْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ الْمَيِّتَ لَيُعَذَّبُ بِبَعْضِ بُكَاءِ أَهْلِهِ عَلَيْهِ؟» فَقَالَ ابْنُ عَبَّاسٍ: فَلَمَّا مَاتَ عُمَرُ ذَكَرْتُ ذَلِك لعَائِشَة فَقَالَت: يَرْحَمُ اللَّهُ عُمَرَ لَا وَاللَّهِ مَا حَدَّثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَن الْمَيِّتَ لَيُعَذَّبُ بِبُكَاءِ أَهْلِهِ عَلَيْهِ وَلَكِنْ: إِنَّ اللَّهَ يَزِيدُ الْكَافِرَ عَذَابًا بِبُكَاءِ أَهْلِهِ عَلَيْهِ. وَقَالَتْ عَائِشَةُ: حَسْبُكُمُ الْقُرْآنُ: (وَلَا تَزِرُ وَازِرَةٌ وزر أُخْرَى)\nقَالَ ابْن عَبَّاس عِنْد ذَلِك: وَالله أضح وأبكي. قَالَ ابْنُ أَبِي مُلَيْكَةَ: فَمَا قَالَ ابْنُ عمر شَيْئا","english":{"narrator":"'Abdallah b. Abu Mulaika said:","text":"A daughter of ‘Uthman b. ‘Affan died in Mecca and we went to attend her funeral. Ibn ‘Umar and Ibn ‘Abbas were present and I was sitting between them. ‘Abdallah b. ‘Umar told ‘Amr b. ‘Uthman who was opposite him to make the people stop weeping, for God's messenger had said that the dead is punished because of his people’s weeping for him. Ibn ‘Abbas then said that ‘Umar used to say something of that nature, and told of an occasion when he had gone from Mecca with ‘Umar and they saw a party of riders under the shade of a gum-acacia tree when they came to al-Baida,. ‘Umar told him to go and see who these riders were, and when he looked he saw that Suhaib was among them, so he told ‘Umar and he asked him to call him. He therefore returned to Suhaib and told him to come over and attach himself to the Commander of the Faithful. Then when ‘Umar was smitten Suhaib entered weeping and saying, “Alas for the brother! Alas for the companion!” ‘Umar asked Suhaib if he was weeping for him when God’s messenger had said that the dead would certainly be punished because of some of the weeping of his family for him. Ibn ‘Abbas said that when ‘Umar died he mentioned that to ‘A’isha and she said, “God have mercy on ‘Umar! I answer by God that God’s messenger never said the dead will certainly be punished because of his family’s weeping for him; what he said was that God will increase the punishment of the infidel because of his family’s weeping for him.” She added, “What the Qur’an says is enough for you: ‘No bearer of a burden will bear another’s burden.’ ” (Qur’an, vi, 164; xvii, 15; xxxv, 18; xxxix, 7) Thereupon Ibn ‘Abbas said, “God is He who has caused laughter and weeping.” (Cf. Qur’an, liii, 43) Ibn Abu Mulaika said that Ibn ‘Umar remained silent. \n\n(Bukharl and Muslim.)"}},{"id":215,"idInBook":215,"chapterId":5,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ قَالَتْ: لَمَّا جَاءَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَتْلُ ابْنِ حَارِثَةَ وَجَعْفَرٍ وَابْنِ رَوَاحَةَ جَلَسَ يُعْرَفُ فِيهِ الْحُزْنُ وَأَنَا أَنْظُرُ مِنْ صَائِرِ الْبَابِ تَعْنِي شَقَّ الْبَابِ فَأَتَاهُ رَجُلٌ فَقَالَ: إِنَّ نِسَاءَ جَعْفَرٍ وَذَكَرَ بُكَاءَهُنَّ فَأَمَرَهُ أَنْ يَنْهَاهُنَّ فَذَهَبَ ثُمَّ أَتَاهُ الثَّانِيَةَ لَمْ يُطِعْنَهُ فَقَالَ: انْهَهُنَّ فَأَتَاهُ الثَّالِثَةَ قَالَ: وَاللَّهِ غَلَبْنَنَا يَا رَسُولَ اللَّهِ فَزَعَمْتُ أَنَّهُ قَالَ: «فَاحْثُ فِي أَفْوَاهِهِنَّ التُّرَابَ» . فَقُلْتُ: أَرْغَمَ اللَّهُ أَنْفَكَ لَمْ تَفْعَلْ مَا أَمَرَكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَمْ تَتْرُكْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ العناء","english":{"narrator":"","text":"‘A’isha said that when the Prophet was told that Ibn Haritha, Ja'far and Ibn Rawaha (They were Zaid b. Haritha, Ja'far Abu Talib, and 'Abdallah b. Rawaha who were killed at Mu’ta in 7 A.H) had been killed, he sat down showing signs of grief, while she was looking at him through the sa’ir, i.e. the slit, of the door. A man came to him and mentioned that Ja'far’s women were weeping, and on being told to tell them to stop he went away. He came a second time saying they had not obeyed him, and he told him to tell them to stop. When he came a third time and said he could make no impression on them, God’s messenger, so ‘A’isha asserted, said, “Throw dust in their mouths.” Thereupon she said, “God humble you! You did not do what God’s messenger ordered you, nor did you stop annoying God’s messenger.” \n\n(Bukharl and Muslim.)"}},{"id":216,"idInBook":216,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أُمِّ سَلَمَةَ قَالَتْ: لَمَّا مَاتَ أَبُو سَلَمَةَ قُلْتُ غَرِيبٌ وَفِي أَرْضِ غُرْبَةٍ لَأَبْكِيَنَّهُ بُكَاءً يُتَحَدَّثُ عَنْهُ فَكُنْتُ قَدْ تَهَيَّأْتُ لِلْبُكَاءِ عَلَيْهِ إِذْ أَقْبَلَتِ امْرَأَةٌ تُرِيدُ أَنْ تُسْعِدَنِي فَاسْتَقْبَلَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «أَتُرِيدِينَ أَنْ تُدْخُلِي الشَّيْطَانَ بَيْتًا أَخْرَجَهُ اللَّهُ مِنْهُ؟» مَرَّتَيْنِ وَكَفَفْتُ عَنِ الْبُكَاءِ فَلَمْ أبك. رَوَاهُ مُسلم","english":{"narrator":"","text":"Umm Salama told that when Abu Salama died she said he had been a stranger in a strange land and that she would weep for him in a manner which would be talked of. She had made preparations for weeping and a woman who meant to assist her was on her way when she was met by God’s messenger who said, “Do you intend to bring the devil into a house from which God has twice driven him out?”(Abu Salama had emigrated both to Abyssinia and to Medina and this may be the reference here; or it may be explained as meaning that the devil was driven out first when he accepted Islam and secondly when he died as a Muslim) Umm Salama therefore refrained from weeping and did not weep. \n\nMuslim transmitted it."}},{"id":217,"idInBook":217,"chapterId":5,"bookId":14,"arabic":"وَعَنِ النُّعْمَانِ بْنِ بَشِيرٍ قَالَ: أُغْمِيَ عَلَى عَبْدِ اللَّهِ بْنِ رَوَاحَةَ فَجَعَلَتْ أُخْتُهُ عَمْرَةُ تبْكي: واجبلاه واكذا واكذا تُعَدِّدُ عَلَيْهِ فَقَالَ حِينَ أَفَاقَ: مَا قُلْتِ شَيْئًا إِلَّا قِيلَ لِي: أَنْتَ كَذَلِكَ؟ زَادَ فِي رِوَايَةٍ فَلَمَّا مَاتَ لَمْ تَبْكِ عَلَيْهِ. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"An-Nu‘man b. Bashir said that when ‘Abdallah b. Rawaha fainted his sister ‘Amra began to weep and shout, “Alas for the mountain! (The word which basically means a mountain is also used for a chief. In the next tradition from Abu Musa two expressions are used, one being the same as here and the other using a normal word for a chief. I have therefore kept the flavour of the original by retaining the word mountain) Alas for such and such! Alas for such and such !” eulogising him. When he came round he said, “I was asked about everything you said whether I am like that.” A version has the addition that when he died she did not weep for him. \n\nBukhari tranmitted it."}},{"id":218,"idInBook":218,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَبِي مُوسَى قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: \n\" مَا من ميت يَمُوت فَيقوم باكيهم فيقولك: واجبلاه واسيداه وَنَحْوَ ذَلِكَ إِلَّا وَكَّلَ اللَّهُ بِهِ مَلَكَيْنِ يَلْهَزَانِهِ وَيَقُولَانِ: أَهَكَذَا كُنْتَ؟ \". رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ غَرِيبٌ حَسَنٌ","english":{"narrator":"","text":"Abu Musa said he heard God’s messenger say, “If anyone dies and the mourner gets up and says, ‘Alas for the mountain! Alas for the chief!’ and such like, God will put two angels in charge of him who will beat him on the breast and ask him whether he was like that.”\n\nTirmidhi transmitted it, saying this is a gharib hasan tradition."}},{"id":219,"idInBook":219,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: مَاتَ مَيِّتٌ مِنْ آلِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاجْتَمَعَ النِّسَاءُ يَبْكِينَ عَلَيْهِ فَقَامَ عُمَرُ يَنْهَاهُنَّ وَيَطْرُدُهُنَّ. فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «دَعْهُنَّ فَإِنَّ الْعَيْنَ دَامِعَةٌ وَالْقَلْبَ مُصَابٌ وَالْعَهْدَ قَرِيبٌ» . رَوَاهُ أَحْمد وَالنَّسَائِيّ","english":{"narrator":"","text":"Abu Huraira said that a member of the family of God’s messenger died and that the women gathered and wept for him. ‘Umar then arose and forbade and repulsed them, but God’s messenger said, “Let them alone, ‘Umar, for the eye is tearful, the heart is afflicted, and the matter has happened recently.” \n\nAhmad and Nasa’i transmitted it."}},{"id":220,"idInBook":220,"chapterId":5,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: مَاتَتْ زَيْنَبُ بِنْتُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَبَكَتِ النِّسَاء فَجعل عُمَرُ يَضْرِبُهُنَّ بِسَوْطِهِ فَأَخَّرَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِيَدِهِ وَقَالَ: «مهلا يَا عمر» ثُمَّ قَالَ: «إِيَّاكُنَّ وَنَعِيقَ الشَّيْطَانِ» ثُمَّ قَالَ: «إِنَّهُ مَهْمَا كَانَ مِنَ الْعَيْنِ وَمِنَ الْقَلْبِ فَمِنَ اللَّهِ عَزَّ وَجَلَّ وَمِنَ الرَّحْمَةِ وَمَا كَانَ مِنَ الْيَدِ وَمِنَ اللِّسَانِ فَمِنَ الشَّيْطَانِ» . رَوَاهُ أَحْمد","english":{"narrator":"","text":"Ibn ‘Abbas said that when God’s messenger’s daughter Zainab died and the women wept, ‘Umar began to strike them with his whip, but God's messenger pushed him back saying, “Gently, ‘Umar.” He then said, “Beware of the devil’s clamour,” and added, “Whatever comes from the eye and from the heart is from God who is great and glorious and pertains to compassion, but what comes from the hand and from the tongue is of the devil.” \n\nAhmad transmitted it."}},{"id":221,"idInBook":221,"chapterId":5,"bookId":14,"arabic":"وَعَنِ الْبُخَارِيِّ تَعْلِيقًا قَالَ: لَمَّا مَاتَ الْحَسَنُ بن الْحسن بن عَليّ ضَرَبَتِ امْرَأَتُهُ الْقُبَّةَ عَلَى قَبْرِهِ سَنَةً ثُمَّ رَفَعَتْ فَسَمِعَتْ صَائِحًا يَقُولُ: أَلَا هَلْ وَجَدُوا مَا فَقَدُوا؟ فَأَجَابَهُ آخَرُ: بَلْ يَئِسُوا فَانْقَلَبُوا","english":{"narrator":"","text":"Bukhari said without a full isnad that when al-Hasan b. ‘Ali died, his wife put a tent over his grave for a year; then when she removed it she heard one shouting and saying, “Have they found what they lost?” and another replied, “No, they have given up hope and gone away.”"}},{"id":222,"idInBook":222,"chapterId":5,"bookId":14,"arabic":"وَعَنْ عِمْرَانَ بْنِ حُصَيْنٍ وَأَبِي بَرْزَةَ قَالَا: خَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي جَنَازَةٍ فَرَأَى قَوْمًا قَدْ طَرَحُوا أَرْدَيْتَهُمْ يَمْشُونَ فِي قُمُصٍ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَبِفِعْلِ الْجَاهِلِيَّةِ تَأْخُذُونَ؟ أَوْ بِصَنِيعِ الْجَاهِلِيَّةِ تَشَبَّهُونَ؟ لَقَدْ هَمَمْتُ أَنْ أَدْعُوَ عَلَيْكُمْ دَعْوَةً تَرْجِعُونَ فِي غَيْرِ صُوَرِكُمْ» قَالَ: فَأخذُوا أرديتهم وَلم يعودوا لذَلِك. رَوَاهُ ابْن مَاجَه","english":{"narrator":"","text":"‘Imran b. Husain and Abu Barza said that when they went out with God’s messenger to a funeral he saw some people who had removed their cloaks and were walking in shirts, and said, “Do you adhere to the practice of pre-Islamic times?” or, “Do you copy what was done in pre-Islamic times ? I feel inclined to invoke a curse on you that you should return metamorphosed.” Then they took their cloaks and did not do that again. \n\nIbn Majah transmitted it."}},{"id":223,"idInBook":223,"chapterId":5,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ تُتْبَعَ جَنَازَةٌ مَعهَا رانة. رَوَاهُ أَحْمد وَابْن مَاجَه","english":{"narrator":"","text":"Ibn ‘Umar said God’s messenger forbade the following of a bier which was accompanied by a woman wailing shrilly. \n\nAhmad and Ibn Majah transmitted it."}},{"id":224,"idInBook":224,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ أَنَّ رَجُلًا قَالَ لَهُ: مَاتَ ابْنٌ لِي فَوَجَدْتُ عَلَيْهِ هَلْ سَمِعْتَ مِنْ خَلِيلِكَ صَلَوَاتُ اللَّهِ عَلَيْهِ شَيْئًا يَطَيِّبُ بِأَنْفُسِنَا عَنْ مَوْتَانَا؟ قَالَ: نَعَمْ سَمِعْتُهُ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «صِغَارُهُمْ دَعَامِيصُ الْجَنَّةِ يلقى أحدهم أَبَاهُ فَيَأْخُذ بِنَاحِيَةِ ثَوْبِهِ فَلَا يُفَارِقُهُ حَتَّى يُدْخِلَهُ الْجَنَّةَ» . رَوَاهُ مُسلم وَأحمد وَاللَّفْظ لَهُ","english":{"narrator":"","text":"Abu Huraira said that a man who told him a son of his had died and that he was grieved asked him if he had heard anything from his friend which would comfort them regarding their dead. He replied that he had, for he had heard him say, “Their young ones roam freely in paradise. One of them meets his father, seizes the end of his garment and does not leave him until he brings him into paradise.\" \n\nMuslim and Ahmad transmitted it, the wording being the latter’s."}},{"id":225,"idInBook":225,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ قَالَ: جَاءَتِ امْرَأَةٌ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ: يَا رَسُولَ اللَّهِ ذَهَبَ الرِّجَالُ بِحَدِيثِكَ فَاجْعَلْ لَنَا مِنْ نَفْسِكَ يَوْمًا نَأْتِيكَ فِيهِ تُعَلِّمُنَا مِمَّا عَلَّمَكَ اللَّهُ. فَقَالَ: «اجْتَمِعْنَ فِي يَوْمِ كَذَا وَكَذَا فِي مَكَانِ كَذَا وَكَذَا» فَاجْتَمَعْنَ فَأَتَاهُنَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَعَلَّمَهُنَّ مِمَّا عَلَّمَهُ اللَّهُ ثُمَّ قَالَ: «مَا مِنْكُنَّ امْرَأَةٌ تُقَدِّمَ بَيْنَ يَدَيْهَا من وَلَدهَا ثَلَاثَة إِلَّا كَانَ لَهَا حِجَابا ن النَّارِ» فَقَالَتِ امْرَأَةٌ مِنْهُنَّ: يَا رَسُولَ اللَّهِ أَوِ اثْنَيْنِ؟ فَأَعَادَتْهَا مَرَّتَيْنِ. ثُمَّ قَالَ: «وَاثْنَيْنِ وَاثْنَيْنِ وَاثْنَيْنِ» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Abu Sa'id told a woman coming to God’s messenger and saying, “Messenger of God, the men have a monopoly of what you say, so appoint us a day on which we may come to you to teach us some of what God has taught you.” He told them to gather on such and such a day in such and such a place, and when they did so he came to them and taught them some of what God had taught him. Then he said, “No woman among you will be predeceased by three of her children without that being a curtain from hell for her.\" One of the women asked whether that applied if there were two, repeating the question twice, and he replied, “Two also, two also, two also.\" \n\nBukharl transmitted it."}},{"id":226,"idInBook":226,"chapterId":5,"bookId":14,"arabic":"وَعَنْ مُعَاذِ بْنِ جَبَلٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا مِنْ مُسْلِمَيْنِ يُتَوَفَّى لَهُمَا ثَلَاثَةٌ إِلَّا أَدْخَلَهُمَا اللَّهُ الْجَنَّةَ بِفَضْلِ رَحْمَتِهِ إِيَّاهُمَا» . فَقَالُوا: يَا رَسُولَ الله أَو اثْنَان؟ قَالَ: «أواثنان» . قَالُوا: أَوْ وَاحِدٌ؟ قَالَ: «أَوْ وَاحِدٌ» . ثُمَّ قَالَ: «وَالَّذِي نَفْسِي بِيَدِهِ إِنَّ السِّقْطَ لَيَجُرُّ أُمَّهُ بِسَرَرِهِ إِلَى الْجَنَّةِ إِذَا احْتَسَبَتْهُ» . رَوَاهُ أَحْمَدُ وَرَوَى ابْنُ مَاجَهْ مِنْ قَوْلِهِ: «وَالَّذِي نَفسِي بِيَدِهِ»","english":{"narrator":"","text":"Mu'adh b. Jabal reported God’s messenger as saying, “No pair of Muslims will lose three  by death without God bringing them into paradise by His great mercy.” He was asked if that applied if they lost two, and said it did. He was also asked if it applied if they lost one, and said it did. Then he said, “By Him in whose hand my soul is, the abortion draws his mother to paradise by his umbilical cord when she seeks her reward for him from God.\" \n\nAhmad transmitted it, and Ibn Majah transmitted from “By Him in whose hand my soul is.\""}},{"id":227,"idInBook":227,"chapterId":5,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: \n\" من قَدَّمَ ثَلَاثَةً مِنَ الْوَلَدِ لَمْ يَبْلُغُوا الْحِنْثَ: كَانُوا لَهُ حِصْنًا حَصِينًا مِنَ النَّارِ \" فَقَالَ أَبُو ذَرٍّ: قَدَّمْتُ اثْنَيْنِ. قَالَ: «وَاثْنَيْنِ» . قَالَ أُبَيُّ بْنُ كَعْبٍ أَبُو الْمُنْذِرِ سَيِّدُ الْقُرَّاءِ: قدمت وَاحِد. قَالَ: «وَوَاحِد» . رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيث غَرِيب","english":{"narrator":"","text":"‘Abdallah b. Mas'ud reported God’s messenger as saying, “If anyone is predeceased by three of his children who did not grow old enough to sin, they will be a strong protection for him from hell.” When Abu Dharr said he had been predeceased by two, he told him that the same applied. Ubayy b. Ka'b Abu Mundhir, the chief of the Qur'an readers, said he had been predeceased by one, and he told him the same applied. \n\nTirmidhi and Ibn Majah transmitted it, Tirmidhi saying that this is a gharib tradition."}},{"id":228,"idInBook":228,"chapterId":5,"bookId":14,"arabic":"وَعَنْ قُرَّةَ الْمُزَنِيِّ: أَنَّ رَجُلًا كَانَ يَأْتِي النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَعَهُ ابْنٌ لَهُ. فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَتُحِبُّهُ؟» فَقَالَ: يَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَحَبَّكَ اللَّهُ كَمَا أُحِبُّهُ. فَفَقَدَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «مَا فَعَلَ ابْنُ فُلَانٍ؟» قَالُوا: يَا رَسُولَ اللَّهِ مَاتَ. فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَمَّا تحب أَلا تَأْتِيَ بَابًا مِنْ أَبْوَابِ الْجَنَّةِ إِلَّا وَجَدْتَهُ يَنْتَظِرُكَ؟» فَقَالَ رَجُلٌ: يَا رَسُولَ اللَّهِ لَهُ خَاصَّةً أَمْ لِكُلِّنَا؟ قَالَ: «بَلْ لِكُلِّكُمْ» . رَوَاهُ أَحْمد","english":{"narrator":"","text":"Qurra al-Muzani said that the Prophet asked a man who used to come to him along with a son of his whether he loved his son, and the man replied, “Messenger of God, may God love you as I love him.\" The Prophet missed him, and on enquiring what had happened to so and so’s son he was told that he had died. Thereupon he said, “Would you not like to find him waiting for you no matter to which gate of paradise you came?” A man asked whether that applied particularly to him, or to all of them, and he told him that it applied to them all.\n\nAhmad transmitted it."}},{"id":229,"idInBook":229,"chapterId":5,"bookId":14,"arabic":"وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" إِن السِّقْطَ لَيُرَاغِمُ رَبَّهُ إِذَا أَدْخَلَ أَبَوَيْهِ النَّارَ فَيُقَالُ: أَيُّهَا السِّقْطُ الْمُرَاغِمُ رَبَّهُ أَدْخِلْ أَبَوَيْكَ الْجَنَّةَ فَيَجُرُّهُمَا بِسَرَرِهِ حَتَّى يُدْخِلَهُمَا الْجَنَّةَ \". رَوَاهُ ابْن مَاجَه","english":{"narrator":"","text":"‘Ali reported God’s messenger as saying, “The abortion will dispute with his Lord when He causes his parents to enter hell, and will receive the reply, ‘You abortion who are disputing with your Lord, bring your parents into paradise.’ He will then draw them with his umbilical cord till he brings them into paradise.” \n\nIbn Majah transmitted it."}},{"id":230,"idInBook":230,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَبِي أُمَامَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" يَقُولُ اللَّهُ تَبَارَكَ وَتَعَالَى: ابْنَ آدَمَ إِنْ صَبَرْتَ وَاحْتَسَبْتَ عِنْدَ الصَّدْمَةِ الْأُولَى لَمْ أَرْضَ لَكَ ثَوَابًا دُونَ الْجَنَّةِ \". رَوَاهُ ابْن مَاجَه","english":{"narrator":"","text":"Abu Umama reported the Prophet as stating that God who is blessed and exalted says, “Son of Adam, if you show endurance and seek your reward from me in the first affliction, I shall be pleased with no lesser reward than paradise for you.” \n\nIbn Majah transmitted it."}},{"id":231,"idInBook":231,"chapterId":5,"bookId":14,"arabic":"وَعَنِ الْحُسَيْنِ بْنِ عَلِيٍّ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَا مِنْ مُسْلِمٍ وَلَا مُسْلِمَةٍ يُصَابُ بِمُصِيبَةٍ فَيَذْكُرُهَا وَإِنْ طَالَ عَهْدُهَا فَيُحْدِثُ لِذَلِكَ اسْتِرْجَاعًا إِلَّا جَدَّدَ اللَّهُ تَبَارَكَ وَتَعَالَى لَهُ عِنْدَ ذَلِكَ فَأَعْطَاهُ مِثْلَ أَجْرِهَا يَوْمَ أُصِيبَ بِهَا» . رَوَاهُ أَحْمَدُ وَالْبَيْهَقِيُّ فِي شعب الْإِيمَان","english":{"narrator":"","text":"Al-Husain b. ‘Ali reported the Prophet as saying, “If any Muslim man or woman suffers a calamity and keeps it in his memory, even if it happened a long time ago, saying each time it is remembered, ‘We belong to God and to Him do we return,’ God who is blessed and exalted will give a fresh reward each time it is said, equivalent to the reward when it happened.” \n\nAhmad and Baihaqi, in Shu'ab al-lman, transmitted it."}},{"id":232,"idInBook":232,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا انْقَطَعَ شِسْعُ أَحَدِكُمْ فَلْيَسْتَرْجِعْ فَإِنَّهُ مِنَ المصائب» . رَوَاهُ الْبَيْهَقِيّ فِي شعب الْإِيمَان","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “When the thong of someone’s sandal breaks he should say, ‘We belong to God and to Him do we return,' for it is one of the calamities.”"}},{"id":233,"idInBook":233,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أُمِّ الدَّرْدَاءِ قَالَتْ: سَمِعْتُ أَبَا الدَّرْدَاءِ يَقُولُ: سَمِعْتُ أَبَا الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: \n\" إِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى قَالَ: يَا عِيسَى إِنِّي بَاعِثٌ مِنْ بَعْدِكَ أُمَّةً إِذَا أَصَابَهُمْ مَا يُحِبُّونَ حَمِدُوا اللَّهَ وَإِنْ أَصَابَهُمْ مَا يَكْرَهُونَ احْتَسَبُوا وَصَبَرُوا وَلَا حِلْمَ وَلَا عَقْلَ. فَقَالَ: يَا رَبِّ كَيْفَ يَكُونُ هَذَا لَهُمْ وَلَا حِلْمَ وَلَا عَقْلَ؟ قَالَ: أُعْطِيهِمْ مِنْ حِلْمِي وَعِلْمِي \". رَوَاهُمَا الْبَيْهَقِيُّ فِي شعب الْإِيمَان","english":{"narrator":"","text":"Umm ad-Darda’ said she heard Abud Darda’ say he heard Abul Qasim (i.e the Prophet) say that God who is blessed and exalted said, “I am sending after your time, Jesus, a people who will praise God when what they like happens to them, and seek their reward from God and show endurance when what they dislike afflicts them, though they do not possess forbearance and intelligence.” He asked, “My Lord, how can this be when they do not possess forbearance or intelligence?” God replied, “I shall give them some of my forbearance and my knowledge.” \n\nBaihaqi transmitted the two traditions in Shu'ab al-lman."}},{"id":234,"idInBook":234,"chapterId":5,"bookId":14,"arabic":"عَنْ بُرَيْدَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «نَهَيْتُكُمْ عَنْ زِيَارَةِ الْقُبُورِ فَزُورُوهَا وَنَهَيْتُكُمْ عَنْ لُحُومِ الْأَضَاحِي فَوْقَ ثَلَاثٍ فَأَمْسِكُوا مَا بَدَا لَكُمْ وَنَهَيْتُكُمْ عَنِ النَّبِيذِ إِلَّا فِي سِقَاءٍ فَاشْرَبُوا فِي الْأَسْقِيَةِ كُلِّهَا وَلَا تشْربُوا مُسكرا» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Buraida reported God's messenger as saying, “I forbade you to visit graves, but you may now visit them; I forbade you to eat the flesh of sacrificial animals after three days, but you may now keep it as long as you feel inclined; and I forbade you nabidh except in a water-skin, so you may drink it from all kinds of water-skins, but you must not drink anything intoxicating.” \n\nMuslim transmitted it."}},{"id":235,"idInBook":235,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: زَارَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَبْرَ أُمِّهِ فَبَكَى وَأَبْكَى مَنْ حَوْلَهَ فَقَالَ: «اسْتَأْذَنْتُ رَبِّي فِي أَن أسْتَغْفر لَهَا فَلم يُؤذن لي ن وَاسْتَأْذَنْتُهُ فِي أَنْ أَزُورَ قَبْرَهَا فَأُذِنَ لِي فَزُورُوا الْقُبُورَ فَإِنَّهَا تُذَكِّرُ الْمَوْتَ» . رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"Abu Huraira said that the Prophet visited his mother’s grave and wept and caused those around him to weep. He then said, \"I asked my Lord's permission to pray for forgiveness for her, but I was not allowed; I then asked His permission to visit her grave and I was allowed; so visit graves, for they make one mindful of death.” \n\nMuslim transmitted it."}},{"id":236,"idInBook":236,"chapterId":5,"bookId":14,"arabic":"وَعَنْ بُرَيْدَةَ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُعَلِّمُهُمْ إِذَا خَرَجُوا إِلَى الْمَقَابِرِ: «السَّلَامُ عَلَيْكُمْ أَهْلَ الدِّيَارِ مِنَ الْمُؤْمِنِينَ وَالْمُسْلِمِينَ وَإِنَّا إِنْ شَاءَ اللَّهُ بِكُمْ لَلَاحِقُونَ نَسْأَلُ اللَّهَ لَنَا وَلَكُمُ الْعَافِيَةَ» . رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"Buraida said that God's messenger used to teach them to say when they went out to the cemeteries, “Peace be upon you, inhabitants of the dwellings who are of the number of the believers and the Muslims. If God will, we shall join you. We ask God to grant us and you wellbeing.” \n\nMuslim transmitted it."}},{"id":237,"idInBook":237,"chapterId":5,"bookId":14,"arabic":"عَنِ ابْنِ عَبَّاسٍ قَالَ: مَرَّ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقُبُورٍ بِالْمَدِينَةِ فَأَقْبَلَ عَلَيْهِمْ بِوَجْهِهِ فَقَالَ: «السَّلَامُ عَلَيْكُمْ يَا أَهْلَ الْقُبُورِ يَغْفِرُ اللَّهُ لَنَا وَلَكُمْ أَنْتُمْ سَلَفُنَا وَنَحْنُ بِالْأَثَرِ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ","english":{"narrator":"","text":"Ibn 'Abbas said that when God's messenger passed by some graves in Medina he turned his face towards them and said, “Peace be upon you, inhabitants of the graves. God forgive us and you. You have gone before us and we are coming after.” \n\nTirmidhi transmitted it saying this is a hasan gharib tradition."}},{"id":238,"idInBook":238,"chapterId":5,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلَّمَا كَانَ لَيْلَتُهَا مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْرُجُ مِنْ آخِرِ اللَّيْلِ إِلَى الْبَقِيعِ فَيَقُولُ: «السَّلَامُ عَلَيْكُمْ دَارَ قَوْمٍ مُؤْمِنِينَ وَأَتَاكُمْ مَا تُوعِدُونَ غَدًا مُؤَجَّلُونَ وَإِنَّا إِنْ شَاءَ اللَّهُ بِكُمْ لَاحِقُونَ اللَّهُمَّ اغْفِرْ لأهل بَقِيع الْغَرْقَد» . رَوَاهُ مُسلم","english":{"narrator":"","text":"‘A'isha said that whenever it was her turn for God's messenger to spend the night with her he would go out towards the end of the night to al-Baqi' and say, “Peace be upon you, household of a people who are believers. What you were being promised will come to you tomorrow, you receiving it after some delay, and if God will we shall join you. O God, grant forgiveness to the inhabitants of Baqi' al- Gharqad.” (This is the full name of the cemetery at Medina. Baqi' properly means a place with tree roots, and gharqad is the name of a thorny type of tree. The name was retained even when all signs of trees were removed.)\n\nMuslim transmitted it."}},{"id":239,"idInBook":239,"chapterId":5,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: كَيْفَ أَقُولُ يَا رَسُولَ اللَّهِ؟ تَعْنِي فِي زِيَارَةِ الْقُبُورِ قَالَ: \n\" قُولِي: السَّلَامُ عَلَى أَهْلِ الدِّيَارِ مِنَ الْمُؤْمِنِينَ وَالْمُسْلِمِينَ وَيَرْحَمُ اللَّهُ الْمُسْتَقْدِمِينَ مِنَّا وَالْمُسْتَأْخِرِينَ وَإِنَّا إِنْ شَاءَ اللَّهُ بِكُمْ للاحقون \". رَوَاهُ مُسلم","english":{"narrator":"","text":"She said she asked God’s messenger what she should say, i.e. when visiting graves, and he told her to say, “Peace be upon the inhabitants of the abodes, believers and Muslims, and God show mercy to those of us who go before and those who go later. If God will we shall join you.\" \n\nMuslim transmitted it."}},{"id":240,"idInBook":240,"chapterId":5,"bookId":14,"arabic":"وَعَنْ مُحَمَّدِ بْنِ النُّعْمَانِ يُرْفَعُ الْحَدِيثَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ زَارَ قَبْرَ أَبَوَيْهِ أَوْ أَحَدِهِمَا فِي كُلِّ جُمُعَةٍ غُفِرَ لَهُ وَكُتِبَ بَرًّا» . رَوَاهُ الْبَيْهَقِيُّ فِي شعب الْإِيمَان مُرْسلا","english":{"narrator":"","text":"Muhammad b. an-Nu‘man who traced the tradition back to the Prophet reported him as saying, “If anyone visits the grave of his parents, or of one of them, every Friday he will be granted forgiveness and it will be recorded as filial piety.” \n\nBaihaqi transmitted it in mursal form in Shu'ab al-iman."}},{"id":241,"idInBook":241,"chapterId":5,"bookId":14,"arabic":"وَعَنِ ابْنِ مَسْعُودٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «كُنْتُ نَهَيْتُكُمْ عَنْ زِيَارَةِ الْقُبُورِ فَزُورُوهَا فَإِنَّهَا تُزَهِّدُ فِي الدُّنْيَا وتذكر الْآخِرَة» . رَوَاهُ ابْن مَاجَه","english":{"narrator":"","text":"Ibn Mas'ud reported God’s messenger as saying, “I forbade you to visit graves, but you may now visit them, for they produce abstinence in this world and act as a reminder of the next.”\n\nIbn Majah transmitted it."}},{"id":242,"idInBook":242,"chapterId":5,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم لعن زوارات الْقُبُورِ. رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَابْنُ مَاجَهْ وَقَالَ التِّرْمِذِيُّ هَذَا حَدِيثٌ حَسَنٌ صَحِيح\nوَقَالَ: قَدْ رَأَى بَعْضُ أَهْلِ الْعِلْمِ أَنَّ هَذَا كَانَ قبل أَن يرخص النَّبِي فِي زِيَارَةِ الْقُبُورِ فَلَمَّا رَخَّصَ دَخَلَ فِي رُخْصَتِهِ الرِّجَالُ وَالنِّسَاءُ. وَقَالَ بَعْضُهُمْ: إِنَّمَا كَرِهَ زِيَارَةَ الْقُبُورِ لِلنِّسَاءِ لِقِلَّةِ صَبْرِهِنَّ وَكَثْرَةِ جَزَعِهِنَّ. تمّ كَلَامه","english":{"narrator":"","text":"Abu Huraira said God's messenger cursed women who visited graves. \n\nAhmad, Tirmidhi and Ibn Majah transmitted it, Tirmidhi saying this is a hasan sahih tradition. He added that some learned men consider this was before the Prophet gave licence to visit graves, and when he gave it both men and women were included. But some hold that he disapproved of women visiting graves because of the small amount of self-control they possess and their tendency to be greatly upset. The quotation from him ends here."}},{"id":243,"idInBook":243,"chapterId":5,"bookId":14,"arabic":"وَعَن عَائِشَة قَالَتْ: كُنْتُ أَدْخُلُ بَيْتِيَ الَّذِي فِيهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَإِنِّي وَاضِعٌ ثَوْبِي وَأَقُولُ: إِنَّمَا هُوَ زَوْجِي وَأَبِي فَلَمَّا دُفِنَ عُمَرُ رَضِيَ اللَّهُ عَنْهُ مَعَهُمْ فَوَاللَّهِ مَا دَخَلْتُهُ إِلَّا وَأَنَا مَشْدُودَةٌ عَلَيَّ ثِيَابِي حَيَاء من عمر. رَوَاهُ أَحْمد","english":{"narrator":"‘A’isha said:","text":"I used to enter my house in which God’s messenger was and put off my garment, saying that only my husband and my father were there; but when ‘Umar was buried along with them, I swear by God that I did not enter it without having my clothes wrapped round me owing to modesty regarding ‘Umar. (The tradition refers to the time after the death of the Prophet and Abu Bakr who were buried in ‘A’isha’s house. When 'Umar died he was buried beside them. As ‘A’isha was not related to him she felt she must observe the usual conventions regarding men who were not near relatives, even although ‘Umar was dead, for it evidently seemed to her as if he were really in the house.)\n\nAhmad transmitted it."}}],"chapter":{"id":5,"bookId":14,"arabic":"كتاب الجنائز","english":"Funerals"}}