{"metadata":{"length":180,"arabic":{"title":"مشكاة المصابيح","author":"الإمام الكاتب التبريزي","introduction":"كتاب الزكاة"},"english":{"title":"Mishkat al-Masabih","author":"Al-Khatib Al-Tabrizi","introduction":"Zakat"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":6,"bookId":14,"arabic":"عَنِ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَ مُعَاذًا إِلَى الْيَمَنِ فَقَالَ: «إِنَّك تَأتي قوما من أهل الْكتاب. فَادْعُهُمْ إِلَى شَهَادَةِ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ. فَإِنْ هُمْ أطاعوا لذَلِك. فَأَعْلِمْهُمْ أَنَّ اللَّهَ قَدْ فَرَضَ عَلَيْهِمْ خَمْسَ صَلَوَاتٍ فِي الْيَوْمِ وَاللَّيْلَةِ. فَإِنْ هم أطاعوا لذَلِك فأعلمهم أَن الله قد فرض عَلَيْهِم صَدَقَة تُؤْخَذ من أغنيائهم فَترد فِي فُقَرَائِهِمْ. فَإِنْ هُمْ أَطَاعُوا لِذَلِكَ. فَإِيَّاكَ وَكَرَائِمَ أَمْوَالِهِمْ وَاتَّقِ دَعْوَةَ الْمَظْلُومِ فَإِنَّهُ لَيْسَ بَيْنَهَا وَبَين الله حجاب»","english":{"narrator":"","text":"Ibn 'Abbas reported God's messenger as saying when he sent Mu'adh to the Yemen, \n“You will come to folk who are people of a book, so invite them to testify that there is no god but God and that Muhammad is God's messenger. If they obey that, tell them God has made obligatory for them five times of prayer every twenty-four hours. If they obey that, tell them God has made obligatory for them sadaqa to be taken from their rich and handed over to their poor. If they obey that, avoid taking the best parts of their property; and regard the claim of him who is wronged, for there is no veil between it and God.\" \n\n(Bukhari and Muslim.)"}},{"id":2,"idInBook":2,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا مِنْ صَاحِبِ ذَهَبٍ وَلَا فِضَّةٍ لَا يُؤَدِّي مِنْهَا حَقَّهَا إِلَّا إِذَا كَانَ يَوْمُ الْقِيَامَةِ صُفِّحَتْ لَهُ صَفَائِحُ مِنْ نَارٍ فَأُحْمِيَ عَلَيْهَا فِي نَارِ جَهَنَّمَ فَيُكْوَى بِهَا جَنْبُهُ وجبينه وظهره كلما بردت أُعِيدَتْ لَهُ فِي يَوْمٍ كَانَ مِقْدَارُهُ خَمْسِينَ أَلْفَ سَنَةٍ حَتَّى يُقْضَى بَيْنَ الْعِبَادِ فَيُرَى سَبِيلُهُ إِمَّا إِلَى الْجَنَّةِ وَإِمَّا إِلَى النَّارِ» قِيلَ: يَا رَسُولَ اللَّهِ فَالْإِبِلُ؟ قَالَ: «وَلَا صَاحِبُ إِبِلٍ لَا يُؤَدِّي مِنْهَا حَقَّهَا وَمِنْ حَقِّهَا حَلْبُهَا يَوْمَ وِرْدِهَا إِلَّا إِذَا كَانَ يَوْمُ الْقِيَامَةِ بُطِحَ لَهَا بِقَاعٍ قَرْقَرٍ أَوْفَرَ مَا كَانَت لَا يفقد مِنْهَا فصيلا وَاحِدًا تَطَؤُهُ بِأَخْفَافِهَا وَتَعَضُّهُ بِأَفْوَاهِهَا كُلَّمَا مَرَّ عَلَيْهِ أولاها رد عَلَيْهِ أخراها فِي يَوْمٍ كَانَ مِقْدَارُهُ خَمْسِينَ أَلْفَ سَنَةٍ حَتَّى يُقْضَى بَيْنَ الْعِبَادِ فَيُرَى سَبِيلُهُ إِمَّا إِلَى الْجَنَّةِ وَإِمَّا إِلَى النَّار» قيل: يَا رَسُول الله فَالْبَقَرُ وَالْغَنَمُ؟ قَالَ: «وَلَا صَاحِبُ بَقْرٍ وَلَا غَنَمٍ لَا يُؤَدِّي مِنْهَا حَقَّهَا إِلَّا إِذَا كَانَ يَوْمُ الْقِيَامَةِ بُطِحَ لَهَا بِقَاعٍ قَرْقَرٍ لَا يَفْقِدُ مِنْهَا شَيْئًا لَيْسَ فِيهَا عَقْصَاءُ وَلَا جَلْحَاءُ وَلَا عَضْبَاءُ تَنْطِحُهُ بِقُرُونِهَا وَتَطَؤُهُ بِأَظْلَافِهَا كُلَّمَا مَرَّ عَلَيْهِ أُولَاهَا رُدَّ عَلَيْهِ أُخْرَاهَا فِي يَوْمٍ كَانَ مِقْدَارُهُ خَمْسِينَ أَلْفَ سَنَةٍ حَتَّى يُقْضَى بَيْنَ الْعِبَادِ فَيُرَى سَبِيلُهُ إِمَّا إِلَى الْجَنَّةِ وَإِمَّا إِلَى النَّارِ» . قِيلَ: يَا رَسُول الله فالخيل؟ قَالَ: \" الْخَيل ثَلَاثَةٌ: هِيَ لِرَجُلٍ وِزْرٌ وَهِيَ لِرَجُلٍ سِتْرٌ وَهِيَ لِرَجُلٍ أَجْرٌ. فَأَمَّا الَّتِي هِيَ لَهُ وِزْرٌ فَرَجُلٌ رَبَطَهَا رِيَاءً وَفَخْرًا وَنِوَاءً عَلَى أَهْلِ الْإِسْلَامِ فَهِيَ لَهُ وِزْرٌ. وَأَمَّا الَّتِي لَهُ سِتْرٌ فَرَجُلٌ رَبَطَهَا فِي سَبِيلِ اللَّهِ ثُمَّ لَمْ يَنْسَ حَقَّ اللَّهِ فِي ظُهُورِهَا وَلَا رِقَابِهَا فَهِيَ لَهُ سِتْرٌ. وَأَمَّا الَّتِي هِيَ لَهُ أَجْرٌ فَرَجُلٌ رَبَطَهَا فِي سَبِيلِ الله لأهل الْإِسْلَام فِي مرج أَو رَوْضَة فَمَا أَكَلَتْ مِنْ ذَلِكَ الْمَرْجِ أَوِ الرَّوْضَةِ مِنْ شَيْءٍ إِلَّا كُتِبَ لَهُ عَدَدَ مَا أَكَلَتْ حَسَنَاتٌ وَكُتِبَ لَهُ عَدَدَ أَرْوَاثِهَا وَأَبْوَالِهَا حَسَنَاتٌ وَلَا تَقْطَعُ طِوَلَهَا فَاسْتَنَّتْ شَرَفًا أَوْ شَرَفَيْنِ إِلَّا كَتَبَ اللَّهُ لَهُ عَدَدَ آثَارِهَا وأوراثها حَسَنَاتٍ وَلَا مَرَّ بِهَا صَاحِبُهَا عَلَى نَهْرٍ فَشَرِبَتْ مِنْهُ وَلَا يُرِيدُ أَنْ يَسْقِيَهَا إِلَّا كَتَبَ اللَّهُ لَهُ عَدَدَ مَا شَرِبَتْ حَسَنَاتٍ \" قِيلَ: يَا رَسُولَ اللَّهِ فَالْحُمُرُ؟ قَالَ: \" مَا أُنْزِلَ عَلَيَّ فِي الْحُمُرِ شَيْءٌ إِلَّا هَذِهِ الْآيَةُ الْفَاذَّةُ الْجَامِعَةُ (فَمَنْ يَعْمَلْ مِثْقَالَ ذَرَّةٍ خَيْرًا يَرَهُ وَمَنْ يَعْمَلْ مِثْقَالَ ذَرَّةٍ شَرًّا يَرَهُ)\nالزلزلة. رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, \n“If any owner of gold or silver does not pay what is due on it, when the day of resurrection comes plates of fire will be beaten out for him, they will be heated in the fire of jahannam, and his side, forehead and back will be cauterised with them. Every time they are put back in the fire they will be returned to him during a day whose extent will be fifty thousand years, until judgment is pronounced among mankind and he sees whether his path is to take him to paradise or to hell.\" \nHe was asked about camels and replied, “If any owner of camels does not pay what is due on them, one thing which is due being to milk them on the day they come down to water,* when the day of resurrection comes a soft sandy plain will be spread out for them, as extensive as possible, he will find that not a single young one is missing, and they will trample him with their hoofs and bite him with their mouths. As often as the first of them pass him the last of them will be brought back to him during a day whose extent will be fifty thousand years, until judgment is pronounced among mankind and he sees whether his path is to take him to paradise or to hell.\" \nHe was asked about cattle and sheep and said, “If any owner of cattle or sheep does not pay what is due on them, when the day of resurrection comes a soft sandy plain will be spread out for them, he will find none of them missing, with twisted horns, without horns, or with a broken horn, and they will gore him with their horns and trample him with their hoofs. As often as the first of them pass him the last of them will be brought back to him during a day whose extent will be fifty thousand years, until judgment is pronounced among mankind and he sees whether his path is to take him to paradise or to hell”. \nHe was asked about horses and said, “Horses are of three types; to one man they are a load, to another a covering, and to another a reward. The first class is exemplified when a man keeps them in hypocrisy, vainglory and opposition to the people of Islam, so they are a load to him. The second class is exemplified when a man keeps them to be used in God's path and is not forgetful of God’s right concerning their backs and necks, so they are a covering to him. The third class is exemplified when a man keeps them to be used in God's path by the people of Islam and puts them in a meadow and field. The amount of what they eat in that meadow or field will be recorded on his behalf as good deeds, as will also the amount of their dung and urine. If they break their halter and prance a course or two God will record the amount of their hoofmarks and their dung on his behalf as good deeds. If their master brings them past a river from which they drink, although he did not intend to water them, God will record the amount of what they drink on his behalf as good deeds.” \nHe was asked about asses and said, \"I have had no revelation about asses except this solitary verse of a composite nature, ‘He who does an atom’s weight of good will see it, and he who does an atom’s weight of evil will see it'.”**\n\nMuslim transmitted it.\n\n* This is said to be in order that he may be able to give a drink to passers-by and the poor.\n** Qur’an 99: 7."}},{"id":3,"idInBook":3,"chapterId":6,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" مَنْ آتَاهُ اللَّهُ مَالًا فَلَمْ يُؤَدِّ زَكَاتَهُ مُثِّلَ لَهُ مَالُهُ شُجَاعًا أَقْرَعَ لَهُ زَبِيبَتَانِ يُطَوَّقُهُ يَوْمَ الْقِيَامَةِ يَأْخُذ بِلِهْزِمَتَيْهِ - يَعْنِي بشدقيه - يَقُولُ: أَنَا مَالُكَ أَنَا كَنْزُكَ \". ثُمَّ تَلَا هَذِه الْآيَة: (وَلَا يَحْسَبَنَّ الَّذِينَ يَبْخَلُونَ بِمَا آتَاهُمُ اللَّهُ من فَضله)\nإِلَى آخر الْآيَة. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"He reported God s messenger as saying, \n“If God gives anyone property and he does not pay the zakat on it, his property will be made to appear to him on the day of resurrection as a large bald snake with black spots over its eyes. It will be put round his neck on the day of resurrection, then seize his lihzamatani, i.e. his jaws, then say, ‘I am your property; I am your treasure’.” \nHe then recited, “Let not those who are niggardly think…”*  \n\nBukhari transmitted it.\n\n* Quran 3:180"}},{"id":4,"idInBook":4,"chapterId":6,"bookId":14,"arabic":"عَنْ أَبِي ذَرٍّ رَضِيَ اللَّهُ عَنْهُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَا مِنْ رَجُلٍ يَكُونُ لَهُ إِبِلٌ أَوْ بَقَرٌ أَوْ غَنَمٌ لَا يُؤَدِّي حَقَّهَا إِلَّا أَتَى بِهَا يَوْمَ الْقِيَامَةِ أعظم مَا يكون وَأَسْمَنَهُ تَطَؤُهُ بِأَخْفَافِهَا وَتَنْطِحُهُ بِقُرُونِهَا كُلَّمَا جَازَتْ أُخْرَاهَا رُدَّتْ عَلَيْهِ أُولَاهَا حَتَّى يُقْضَى بَيْنَ النَّاس»","english":{"narrator":"","text":"Abu Dharr reported the Prophet as saying, \n“If any man has camels, cattle, or sheep on which he does not pay what is due, they will be produced as large and fat as can be on the day of resurrection and will trample him with their hoofs and gore him with their horns. As often as the last of them pass him the first of them will be brought back to him until judgment is pronounced among mankind.” \n\n(Bukhari and Muslim.)"}},{"id":5,"idInBook":5,"chapterId":6,"bookId":14,"arabic":"وَعَنْ جَرِيرِ بْنِ عَبْدُ اللَّهِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «إِذا أَتَاكُمُ الْمُصَدِّقُ فَلْيَصْدُرْ عَنْكُمْ وَهُوَ عَنْكُمْ رَاضٍ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Jarir b. ‘Abdallah reported God’s messenger as saying, “When the collector of sadaqa comes to you see that he is pleased with you when he leaves you.” \n\nMuslim transmitted it."}},{"id":6,"idInBook":6,"chapterId":6,"bookId":14,"arabic":"وَعَنْ عَبْدُ اللَّهِ بْنِ أَبِي أَوْفَى رَضِيَ اللَّهُ عَنْهُمَا قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَتَاهُ قَوْمٌ بِصَدَقَتِهِمْ قَالَ: «اللَّهُمَّ صلى على آل فلَان» . فَأَتَاهُ أبي بِصَدَقَتِهِ فَقَالَ: «اللَّهُمَّ صلى الله على آل أبي أوفى»\nوَفِي رِوَايَة: \" إِذا أَتَى الرجل النَّبِي بِصَدَقَتِهِ قَالَ: «اللَّهُمَّ صلي عَلَيْهِ»","english":{"narrator":"","text":"‘Abdallah b. Abu Aufa told that the Prophet said when people brought him their sadaqa, “O God, bless the family of so and so.” He told how, when his father brought him his sadaqa, he said, “O God, bless the family of Abu Aufa.” \n\n(Bukhari and Muslim.) \n\nA version says that when a man brought the Prophet his sadaqa he said, “O God, bless him.”"}},{"id":7,"idInBook":7,"chapterId":6,"bookId":14,"arabic":"عَن أَبِي هُرَيْرَةَ. قَالَ: بَعَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عُمَرَ عَلَى الصَّدَقَةِ. فَقِيلَ: مَنَعَ ابْنُ جَمِيلٍ وَخَالِدُ بْنُ الْوَلِيدِ وَالْعَبَّاسُ. فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا يَنْقِمُ ابْنُ جَمِيلٍ إِلَّا أَنَّهُ كَانَ فَقِيرًا فَأَغْنَاهُ اللَّهُ وَرَسُولُهُ. وَأَمَّا خَالِدٌ فَإِنَّكُمْ تَظْلِمُونَ خَالِدًا. قَدِ احْتَبَسَ أَدْرَاعَهُ وَأَعْتُدَهُ فِي سَبِيلِ اللَّهِ. وَأَمَّا الْعَبَّاسُ فَهِيَ عَلَيَّ. وَمِثْلُهَا مَعَهَا» . ثُمَّ قَالَ: «يَا عُمَرُ أَمَا شَعَرْتَ أَن عَم الرجل صنوا أَبِيه؟»","english":{"narrator":"","text":"Abu Huraira told how when God’s messenger sent ‘Umar to collect sadaqa people said that Ibn Jamil, Khalid b. al-Walid and al-‘Abbas refused. So God’s messenger said, \n“Ibn Jamil is not  objecting, but he was poor and God and His messenger enriched him. * As for Khalid, you are wronging him, for he has kept back his coats of mail and weapons to use them in God’s path. As for al-‘Abbas, I shall be responsible for it and an equal amount along with it.” \nThen he said, “Did you not know, ‘Umar, that a man’s paternal uncle is of the same stock as his father?” \n\n(Bukhari and Muslim.)\n\n* This sentence has given commentators trouble, and several explanations of the meaning are given. It appears best to understand it as a seeming defence of Ibn Jamil which is really a rebuke. The idea is therefore that the seriousness of his action is not so much in his actual objection to paying zakat as in his being induced to do this by ingratitude to God who has enriched him."}},{"id":8,"idInBook":8,"chapterId":6,"bookId":14,"arabic":"عَن أبي حميد السَّاعِدِيّ: اسْتَعْمَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلًا مِنَ الأزد يُقَال لَهُ ابْن اللتبية الأتبية عَلَى الصَّدَقَةِ فَلَمَّا قَدِمَ قَالَ: هَذَا لَكُمْ وَهَذَا أُهْدِيَ لِي فَخَطَبَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَحَمِدَ اللَّهَ وَأثْنى عَلَيْهِ وَقَالَ: \n\" أَمَّا بَعْدُ فَإِنِّي أَسْتَعْمِلُ رِجَالًا مِنْكُمْ عَلَى أُمُور مِمَّا ولاني الله فَيَأْتِي أحدكُم فَيَقُول: هَذَا لكم وَهَذَا هَدِيَّةٌ أُهْدِيَتْ لِي فَهَلَّا جَلَسَ فِي بَيْتِ أَبِيهِ أَوْ بَيْتِ أُمِّهِ فَيَنْظُرُ أَيُهْدَى لَهُ أَمْ لَا؟ وَالَّذِي نَفْسِي بِيَدِهِ لَا يَأْخُذُ أَحَدٌ مِنْهُ شَيْئًا إِلَّا جَاءَ بِهِ يَوْمَ الْقِيَامَةِ يَحْمِلُهُ عَلَى رَقَبَتِهِ إِنْ كَانَ بَعِيرًا لَهُ رُغَاءٌ أَوْ بَقْرًا لَهُ خُوَارٌ أَوْ شَاة تَيْعر \" ثمَّ رفع يَدَيْهِ حَتَّى رَأينَا عفرتي إِبِطَيْهِ ثُمَّ قَالَ: «اللَّهُمَّ هَلْ بَلَّغْتُ اللَّهُمَّ هَل بلغت» . . قَالَ الْخَطَّابِيُّ: وَفِي قَوْلِهِ: «هَلَّا جَلَسَ فِي بَيْتِ أُمِّهِ أَوْ أَبِيهِ فَيَنْظُرُ أَيُهْدَى إِلَيْهِ أَمْ لَا؟» دَلِيلٌ عَلَى أَنَّ كُلَّ أَمْرٍ يُتَذَرَّعُ بِهِ إِلَى مَحْظُورٍ فَهُوَ مَحْظُورٌ وَكُلُّ دخل فِي الْعُقُودِ يُنْظَرُ هَلْ يَكُونُ حُكْمُهُ عِنْدَ الِانْفِرَادِ كَحُكْمِهِ عِنْدَ الِاقْتِرَانِ أَمْ لَا؟ هَكَذَا فِي شرح السّنة","english":{"narrator":"Abu Humaid as-Sa‘idi said that God’s messenger appointed a man of Azd called Ibn al-Lutbiya to collect the sadaqa and when he returned he said, “This is for you, and this was given me as a present.” So the Prophet delivered an address, and after praising and extolling God he said, \n\"To proceed:","text":"I employ men of your number to deal with certain matters which God has entrusted to me, yet one of them comes and says, 'This is for you and this is a present which was given to me.’ Why did he not sit in his father’s or his mother’s house and see whether it would be given to him or not? By Him in whose hand my soul is, whoever takes any of it will inevitably bring it on the day of resurrection carrying it on his neck, be it a camel which rumbles, an ox which bellows, or a sheep which bleats.” \nThen raising his arms so that we could see the place where the hair grew under his armpits he said, \"O God, have I given full information? O God, have I given full information?” \n\n(Bukhari and Muslim.) \n\nKhattabi said: The words \"Why did he not sit in his father’s or his mother's house and see whether it would be given to him or not?” are a proof that every matter which, when it is adopted, leads to something forbidden is itself forbidden, and that note is taken of everyone who enters into covenants as to whether or not his decision made by himself is like his decision when he is associated with others. Thus it is quoted in Sharh as-sunna."}},{"id":9,"idInBook":9,"chapterId":6,"bookId":14,"arabic":"وَعَنْ عَدِيِّ بْنِ عُمَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنِ اسْتَعْمَلْنَاهُ مِنْكُم على عمر فَكَتَمَنَا مِخْيَطًا فَمَا فَوْقَهُ كَانَ غُلُولًا يَأْتِي بِهِ يَوْم الْقِيَامَة» . رَوَاهُ مُسلم","english":{"narrator":"","text":"‘Adi b. ‘Amira reported God’s messenger as saying, \n\"If I appoint any of you to deal with a matter and he conceals from me a needle and what is above that, it is dishonesty, and he will bring it on the day of resurrection.” *\n\nMuslim transmitted it.\n\n* Quran 3:161."}},{"id":10,"idInBook":10,"chapterId":6,"bookId":14,"arabic":"عَنِ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: لَمَّا نَزَلَتْ (وَالَّذِينَ يَكْنِزُونَ الذَّهَبَ وَالْفِضَّةَ)\nكَبُرَ ذَلِكَ عَلَى الْمُسْلِمِينَ. فَقَالَ عُمَرُ أَنَا أُفَرِّجُ عَنْكُمْ فَانْطَلَقَ. فَقَالَ: يَا نَبِيَّ اللَّهِ قد كبر على أَصْحَابك هَذِه الْآيَة. فَقَالَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ اللَّهَ لم يفْرض الزَّكَاة إِلَّا ليطيب بهَا مَا بَقِيَ مِنْ أَمْوَالِكُمْ وَإِنَّمَا فَرَضَ الْمَوَارِيثَ وَذكر كلمة لتَكون لمن بعدكم» قَالَ فَكَبَّرَ عُمَرُ. ثُمَّ قَالَ لَهُ: «أَلَا أُخْبِرُكَ بِخَيْرِ مَا يَكْنِزُ الْمَرْءُ الْمَرْأَةُ الصَّالِحَةُ إِذَا نَظَرَ إِلَيْهَا سَرَّتْهُ وَإِذَا أَمَرَهَا أَطَاعَتْهُ وَإِذَا غَابَ عَنْهَا حفظته» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Ibn ‘Abbas told how, when this verse was revealed, \"And those who hoard gold and silver…”* the Muslims were grieved about it and ‘Umar told them he would dispel their care. He therefore went and told God’s Prophet that his companions were grieved by this verse, and received the reply, \n\"God has made the zakat obligatory simply to purify your remaining property, and He made inheritances obligatory (mentioning a word)** that they might come to those who survive you.” \n'Umar then said, \"God is most great,” after which he said to him, \"Let me inform you about the best a man hoards; it is a virtuous woman who pleases him when he looks at her, obeys him when he gives her a command, and guards his interests when he is away from her.\" \n\nAbu Dawud transmitted it.\n\n* Qur'an 9: 34.\n** i.e. a word about which Ibn ‘Abbas was uncertain."}},{"id":11,"idInBook":11,"chapterId":6,"bookId":14,"arabic":"عَن جَابِرِ بْنِ عَتِيكٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «سَيَأْتِيكُمْ رُكَيْبٌ مُبَغَّضُونَ فَإِذا جاؤكم فَرَحِّبُوا بِهِمْ وَخَلُّوا بَيْنَهُمْ وَبَيْنَ مَا يَبْتَغُونَ فَإِنْ عَدَلُوا فَلِأَنْفُسِهِمْ وَإِنْ ظَلَمُوا فَعَلَيْهِمْ وَأَرْضُوهُمْ فَإِنَّ تَمَامَ زَكَاتِكُمْ رِضَاهُمْ وَلْيَدْعُوا لَكُمْ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Jabir b. ‘Atik reported God’s messenger as saying, \n“Riders who are rendered objects of dislike to you* will come to you, but you must welcome them when they come to you and give them a free hand regarding what they desire. If they are just they will receive credit for it, but if they are unjust they will be held responsible. Please them, for the perfection of your zakat consists in their good pleasure, and let them ask a blessing for you.\"\n\nAbu Dawud transmitted it.\n\n* These are collectors of zakat."}},{"id":12,"idInBook":12,"chapterId":6,"bookId":14,"arabic":"عَن جَرِيرِ بْنِ عَبْدِ اللَّهِ قَالَ: جَاءَ نَاسٌ يَعْنِي مِنَ الْأَعْرَابِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالُوا: إِنَّ نَاسًا مِنَ المصدقين يَأْتُونَا فيظلمونا قَالَ: فَقَالَ: «أَرْضُوا مُصَدِّقِيكُمْ وَإِنْ ظُلِمْتُمْ» رَوَاهُ أَبُو دَاوُدَ","english":{"narrator":"","text":"Jarir b. ‘Abdallah told of some people, meaning nomadic Arabs, who came to God’s messenger and said, “Collectors of sadaqa come to us and act unjustly.” He told them to please the collectors who came to them, and when they asked if they must do so even if they wronged them, he replied, \n“Please those who collect sadaqa from you, even if you are wronged.” \n\nAbu Dawud transmitted it."}},{"id":13,"idInBook":13,"chapterId":6,"bookId":14,"arabic":"وَعَنْ بَشِيرِ بْنِ الْخَصَاصِيَّةِ قَالَ: قُلْنَا: أَنَّ أَهْلَ الصَّدَقَةِ يَعْتَدُونَ عَلَيْنَا أَفَنَكْتُمُ مِنْ أَمْوَالِنَا بِقَدْرِ مَا يَعْتَدُونَ؟ قَالَ: «لَا» رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Bashir b. al-Khasasiya said they told how the collectors of sadaqa went over the score and asked whether they might conceal their property to the extent to which they went over the score, but  told them that they must not. \n\nAbu Dawud transmitted it."}},{"id":14,"idInBook":14,"chapterId":6,"bookId":14,"arabic":"وَعَن رَافع بن خديح قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْعَامِلُ عَلَى الصَّدَقَةِ بِالْحَقِّ كَالْغَازِي فِي سَبِيلِ اللَّهِ حَتَّى يَرْجِعَ إِلَى بَيْتِهِ» . رَوَاهُ أَبُو دَاوُد وَالتِّرْمِذِيّ","english":{"narrator":"","text":"Rafi‘ b. Khadij reported God’s messenger as saying, \n“The official who collects sadaqa in a just manner is like him who fights in God’s path till he returns home.\" \n\nAbu Dawud and Tirmidhi transmitted it."}},{"id":15,"idInBook":15,"chapterId":6,"bookId":14,"arabic":"وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا جَلَبَ وَلَا جَنَبَ وَلَا تُؤْخَذُ صَدَقَاتُهُمْ إِلَّا فِي دُورِهِمْ» . رَوَاهُ أَبُو دَاوُدَ","english":{"narrator":"","text":"‘Amr b. Shu'aib on his father’s authority said his grandfather reported the Prophet as saying, \n“There is to be no collecting of sadaqa from a distance, nor must people who own property remove it far away,* for their sadaqat are to be received only in their dwellings.” \n\nAbu Dawud transmitted it.\n\n* The point is that the collector of zakat must not make people bring their animals a long distance to him, and they must not remove their animals to a distance when he is coming to collect zakat."}},{"id":16,"idInBook":16,"chapterId":6,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنِ اسْتَفَادَ مَالًا فَلَا زَكَاة فِيهِ حَتَّى يحول عيه الْحَوْلُ» . رَوَاهُ التِّرْمِذِيُّ وَذَكَرَ جَمَاعَةٌ أَنَّهُمْ وَقَفُوهُ على ابْن عمر","english":{"narrator":"","text":"Ibn ‘Umar reported God’s messenger as saying, \n“He who acquires property is not liable for zakat on it till a year passes.” \n\nTirmidhi transmitted it, mentioning that a number traced the tradition no farther back than Ibn ‘Umar."}},{"id":17,"idInBook":17,"chapterId":6,"bookId":14,"arabic":"وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ: أَنَّ الْعَبَّاسَ سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي تَعْجِيل صَدَقَة قَبْلَ أَنْ تَحِلَّ: فَرَخَّصَ لَهُ فِي ذَلِكَ. رَوَاهُ أَبُو دَاوُدَ وَالتِّرْمِذِيُّ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ","english":{"narrator":"","text":"Ali said that al-'Abbas asked God’s messenger about paying his sadaqa in advance before it became due, and he gave him permission to do that. \n\nAbu Dawud, Tirmidhi, Ibn Majah and Darimi transmitted it."}},{"id":18,"idInBook":18,"chapterId":6,"bookId":14,"arabic":"وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَطَبَ النَّاسَ فَقَالَ: «أَلَا مَنْ وَلِيَ يَتِيمًا لَهُ مَالٌ فَلْيَتَّجِرْ فِيهِ وَلَا يَتْرُكْهُ حَتَّى تَأْكُلَهُ الصَّدَقَةُ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: فِي إِسْنَادِهِ مقَال: لِأَن الْمثنى بن الصَّباح ضَعِيف","english":{"narrator":"","text":"‘Amr b. Shu'aib on his father’s authority said that his grandfather told of the Prophet addressing the people and saying, \n“If anyone is guardian of an orphan who owns property, he must trade with it and not leave it till the sadaqa consumes it.\" \n\nTirmidhi transmitted it, adding that its isnad has been criticised because al-Muthanna b. as- Sabbah was weak."}},{"id":19,"idInBook":19,"chapterId":6,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ قَالَ: لَمَّا تُوُفِّيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاسْتُخْلِفَ أَبُو بَكْرٍ وَكَفَرَ مَنْ كَفَرَ مِنَ الْعَرَبِ قَالَ عُمَرُ: يَا أَبَا بَكْرٍ كَيْفَ تُقَاتِلُ النَّاسَ وَقَدْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَقُولُوا: لَا إِلَهَ إِلَّا اللَّهُ فَمَنْ قَالَ: لَا إِلَهَ إِلَّا اللَّهُ عَصَمَ مِنِّي مَالَهُ وَنَفْسَهُ إِلَّا بِحَقِّهِ وَحِسَابُهُ على الله \". قَالَ أَبُو بَكْرٍ: وَاللَّهِ لَأُقَاتِلَنَّ مَنْ فَرَّقَ بَيْنَ الصَّلَاةِ وَالزَّكَاةِ فَإِنَّ الزَّكَاةَ حَقُّ الْمَالِ وَاللَّهِ لَوْ مَنَعُونِي عَنَاقًا كَانُوا يُؤَدُّونَهَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَقَاتَلْتُهُمْ عَلَى مَنْعِهَا. قَالَ عُمَرُ: فَوَاللَّهِ مَا هُوَ إِلَّا أَن رَأَيْت أَن قد شرح الله صَدْرَ أَبِي بَكْرٍ لِلْقِتَالِ فَعَرَفْتُ أَنَّهُ الْحَقُّ","english":{"narrator":"","text":"Abu Huraira said that when Abu Bakr was made the Prophet's successor after his death and infidelity arose among certain Arabs, ‘Umar b. al-Khattab asked Abu Bakr how he could fight with the people when God’s messenger had said, “I have been commanded to fight with the people till they say there is no god but God, so whoever says so has protected his property and his person from me except for what is due from him, and his reckoning is left to God.” \nAbu Bakr replied, “I swear by God that I will certainly fight with those who make a distinction between prayer and zakat, for the zakat is what is due from property. I swear by God that if they were to refuse me a female kid which they used to pay to God’s messenger I would fight with them over the refusal of it.\" \n‘Umar then said, “I swear by God that I clearly saw God had made Abu Bakr feel justified in fighting, and I recognised that it was right.\" \n\n(Bukhari and Muslim)."}},{"id":20,"idInBook":20,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَكُونُ كَنْزُ أَحَدِكُمْ يَوْمَ الْقِيَامَةِ شُجَاعًا أَقْرَعَ يَفِرُّ مِنْهُ صَاحِبُهُ وَهُوَ يَطْلُبُهُ حَتَّى يُلْقِمَهُ أَصَابِعه» . رَوَاهُ أَحْمد","english":{"narrator":"","text":"He reported God’s messenger as saying, \n“The treasure of one of you on the day of resurrection will be a large bald snake from which he will flee, but it will keep following after him till he gives it his fingers to eat.\" \n\nAhmad transmitted it."}},{"id":21,"idInBook":21,"chapterId":6,"bookId":14,"arabic":"وَعَنِ ابْنِ مَسْعُودٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَا مِنْ رَجُلٍ لَا يُؤَدِّي زَكَاةَ مَالِهِ إِلَّا جَعَلَ اللَّهُ يَوْمَ الْقِيَامَةِ فِي عُنُقِهِ شُجَاعًا» ثُمَّ قَرَأَ عَلَيْنَا مِصْدَاقَهُ مِنْ كِتَابِ اللَّهِ: (وَلَا يَحْسَبَنَّ الَّذِينَ يبلخون بِمَا آتَاهُم الله من فَضله)\nالْآيَة. رَوَاهُ التِّرْمِذِيّ وَالنَّسَائِيّ وَابْن مَاجَه","english":{"narrator":"","text":"Ibn Mas'ud reported the Prophet as saying, \n“No man will fail to pay the zakat on his property without God putting a large snake on his neck on the day of resurrection.\" He then recited to them the justification of it from God s Book, “Let not those who are niggardly with what God has given them from His bounty suppose…”*\n\nTirmidhi, Nasa’i and Ibn Majah transmitted it.\n\n* Quran 3:180."}},{"id":22,"idInBook":22,"chapterId":6,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَا خَالَطَتِ الزَّكَاةُ مَالًا قَطُّ إِلَّا أَهْلَكَتْهُ» . رَوَاهُ الشَّافِعِيُّ وَالْبُخَارِيُّ فِي تَارِيخِهِ وَالْحُمَيْدِيُّ وَزَادَ قَالَ: يَكُونُ قَدْ وَجَبَ عَلَيْكَ صَدَقَةٌ فَلَا تُخْرِجْهَا فَيُهْلِكُ الْحَرَامُ الْحَلَالَ. وَقَدِ احْتَجَّ بِهِ من يرى تعلق الزَّكَاةِ بِالْعَيْنِ هَكَذَا فِي الْمُنْتَقَى\nوَرَوَى الْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَانِ عَنْ أَحْمَدَ بْنِ حَنْبَلٍ بِإِسْنَادِهِ إِلَى عَائِشَةَ. وَقَالَ أَحْمَدُ فِي «خَالَطَتْ» : تَفْسِيرُهُ أَنَّ الرَّجُلَ يَأْخُذُ الزَّكَاةَ وَهُوَ مُوسِرٌ أَو غَنِي وَإِنَّمَا هِيَ للْفُقَرَاء","english":{"narrator":"","text":"‘A’isha said she heard God’s messenger say, \n“zakat is never mingled with any property without destroying it.” \n\nShafi'i, Bukhari in his Ta’rikh, and al-Humaidi transmitted it, al-Humaidl adding He said, “Sadaqa will have been incumbent on you and you will not pay it, so what is forbidden will destroy what is lawful.” Those who hold that the zakat is connected with the property itself have used this as an argument. It is given thus in al-Muntaqa.\n\nBaihaqi transmitted in Shu’ab al-iman from Ahmad b. Hanbal with, his isnad to ‘A’isha, and Ahmad said “mingled” means that a man accepts zakat when he is opulent or rich, whereas it is only for the poor."}},{"id":23,"idInBook":23,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَيْسَ فِيمَا دُونَ خَمْسَةِ أَوْسُقٍ مِنَ التَّمْرِ صَدَقَةٌ وَلَيْسَ فِيمَا دُونَ خَمْسِ أَوَاقٍ مِنَ الْوَرِقِ صَدَقَةٌ وَلَيْسَ فِيمَا دُونَ خَمْسِ ذَوْدٍ من الْإِبِل صَدَقَة»","english":{"narrator":"","text":"Abu Sa'id al-Khudri reported God’s messenger as saying, \n“No sadaqa is payable on less than five camel-loads (wasq) of dates, on less than five ounces of silver, and on less than five camels.” \n\n(Bukhari and Muslim.)"}},{"id":24,"idInBook":24,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَيْسَ عَلَى الْمُسْلِمِ صَدَقَةٌ فِي عَبْدِهِ وَلَا فِي فَرَسِهِ» . وَفِي رِوَايَةٍ قَالَ: «لَيْسَ فِي عَبْدِهِ صَدَقَةٌ إِلَّا صَدَقَةُ الْفِطْرِ»","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, \n“No sadaqa is due from a Muslim on his slave or his horse.” \nIn a version he said, “There is no sadaqa on his slave except that given at the breaking of the fast.” \n\n(Bukhari and Muslim.)"}},{"id":25,"idInBook":25,"chapterId":6,"bookId":14,"arabic":"وَعَن أنس بن مَالك: أَن أَبَا بكر رَضِي الله عَنهُ كَتَبَ لَهُ هَذَا الْكِتَابَ لَمَّا وَجَّهَهُ إِلَى الْبَحْرِينِ: بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ هَذِهِ فَرِيضَةُ الصَّدَقَةِ الَّتِي فَرَضَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمُسْلِمِينَ وَالَّتِي أَمَرَ اللَّهُ عز وَجل بهَا رَسُوله فَمن سَأَلَهَا مِنَ الْمُسْلِمِينَ عَلَى وَجْهِهَا فَلْيُعْطِهَا وَمَنْ سُئِلَ فَوْقَهَا فَلَا يُعْطِ: فِي أَرْبَعٍ وَعِشْرِينَ مِنَ الْإِبِل فَمَا دونهَا خَمْسٍ شَاةٌ. فَإِذَا بَلَغَتْ خَمْسًا وَعِشْرِينَ إِلَى خَمْسٍ وَثَلَاثِينَ فَفِيهَا بِنْتُ مَخَاضٍ أُنْثَى فَإِذَا بلغت سِتا وَثَلَاثِينَ فَفِيهَا بنت لبون أُنْثَى. فَإِذا بلغت سِتَّة وَأَرْبَعين إِلَى سِتِّينَ فَفِيهَا حِقَّةٌ طَرُوقَةُ الْجَمَلِ فَإِذَا بَلَغَتْ وَاحِدَةً وَسِتِّينَ فَفِيهَا جَذَعَة. فَإِذا بلغت سِتا وَسبعين فَفِيهَا بِنْتَا لَبُونٍ. فَإِذَا بَلَغَتْ إِحْدَى وَتِسْعِينَ إِلَى عِشْرِينَ وَمِائَةٍ فَفِيهَا حِقَّتَانِ طَرُوقَتَا الْجَمَلِ. فَإِذَا زَادَتْ عَلَى عِشْرِينَ وَمِائَةٍ فَفِي كُلِّ أَرْبَعِينَ بِنْتُ لَبُونٍ وَفِي كُلِّ خَمْسِينَ حِقَّةٌ. وَمَنْ لَمْ يَكُنْ مَعَهُ إِلَّا أَرْبَعٌ مِنَ الْإِبِلِ فَلَيْسَ فِيهَا صَدَقَةٌ إِلَّا أَنْ يَشَاءَ رَبُّهَا. فَإِذَا بَلَغَتْ خَمْسًا فَفِيهَا شَاةٌ وَمَنْ بَلَغَتْ عِنْدَهُ مِنَ الْإِبِلِ صَدَقَةَ الْجَذَعَةِ وَلَيْسَتْ عِنْده جَذَعَة وَعِنْده حقة فَإِنَّهَا تقبل مِنْهُ الْحِقَّةُ وَيُجْعَلُ مَعَهَا شَاتَيْنِ إِنِ اسْتَيْسَرَتَا لَهُ أَوْ عِشْرِينَ دِرْهَمًا. وَمَنْ بَلَغَتْ عِنْدَهُ صَدَقَةَ الْحِقَّةِ وَلَيْسَتْ عِنْدَهُ الْحِقَّةُ وَعِنْدَهُ الْجَذَعَةُ فَإِنَّهَا تُقْبَلُ مِنْهُ الْجَذَعَةُ وَيُعْطِيهِ الْمُصَدِّقُ عِشْرِينَ دِرْهَمًا أَوْ شَاتَيْنِ. وَمَنْ بَلَغَتْ عِنْدَهُ صَدَقَةَ الْحِقَّةِ وَلَيْسَت إِلَّا عِنْده بِنْتُ لَبُونٍ فَإِنَّهَا تُقْبَلُ مِنْهُ بِنْتُ لَبُونٍ وَيُعْطِي مَعهَا شَاتَيْنِ أَوْ عِشْرِينَ دِرْهَمًا. وَمَنْ بَلَغَتْ صَدَقَتُهُ بنت لبون وَعِنْده حقة فَإِنَّهَا تقبل مِنْهُ الْحِقَّةُ وَيُعْطِيهِ الْمُصَدِّقُ عِشْرِينَ دِرْهَمًا أَوْ شَاتَيْنِ. وَمَنْ بَلَغَتْ صَدَقَتُهُ بَنْتَ لِبَوْنٍ وَلَيْسَتْ عِنْدَهُ وَعِنْدَهُ بِنْتُ مَخَاضٍ فَإِنَّهَا تُقْبَلُ مِنْهُ بِنْتُ مَخَاضٍ وَيُعْطَى مَعَهَا عِشْرِينَ دِرْهَمًا أَوْ شَاتَيْنِ. وَمَنْ بَلَغَتْ صَدَقَتُهُ بَنْتَ مَخَاضٍ وَلَيْسَتْ عِنْدَهُ وَعِنْدَهُ بِنْتُ لَبُونٍ فَإِنَّهَا تُقْبَلُ مِنْهُ وَيُعْطِيهِ الْمُصَدِّقُ عِشْرِينَ دِرْهَمًا أَوْ شَاتَيْنِ. فَإِنْ لَمْ تَكُنْ عِنْدَهُ بِنْتُ مَخَاضٍ عَلَى وَجْهِهَا وَعِنْدَهُ ابْن لَبُونٍ فَإِنَّهُ يُقْبَلُ مِنْهُ وَلَيْسَ مَعَهُ شَيْءٌ. وَفِي صَدَقَةِ الْغَنَمِ فِي سَائِمَتِهَا إِذَا كَانَتْ أَرْبَعِينَ فَفِيهَا شَاة إِلَى عشْرين وَمِائَة شَاة فَإِن زَادَتْ عَلَى عِشْرِينَ وَمِائَةٍ إِلَى مِائَتَيْنِ فَفِيهَا شَاتَان. فَإِن زَادَتْ عَلَى مِائَتَيْنِ إِلَى ثَلَاثِمِائَةٍ فَفِيهَا ثَلَاثُ شِيَاهٍ. فَإِذَا زَادَتْ عَلَى ثَلَاثِمِائَةٍ فَفِي كُلِّ مِائَةٍ شَاةٌ. فَإِذَا كَانَتْ سَائِمَةُ الرَّجُلِ نَاقِصَةً مِنْ أَرْبَعِينَ شَاةً وَاحِدَةً فَلَيْسَ فِيهَا صَدَقَةٌ إِلَّا أَنْ يَشَاءَ رَبُّهَا. وَلَا تُخْرَجَ فِي الصَّدَقَة هرمة وَلَا ذَات عور وَلَا تَيْسٌ إِلَّا مَا شَاءَ الْمُصَدِّقُ. وَلَا يجمع بَين متفرق وَلَا يفرق بَين مُجْتَمع خَشْيَةَ الصَّدَقَةِ وَمَا كَانَ مِنْ خَلِيطَيْنِ فَإِنَّهُمَا يَتَرَاجَعَانِ بَيْنَهُمَا بِالسَّوِيَّةِ. وَفِي الرِّقَةِ رُبُعُ الْعُشْرِ فَإِنْ لَمْ تَكُنْ إِلَّا تِسْعِينَ وَمِائَةً فَلَيْسَ فِيهَا شَيْءٌ إِلَّا أَنْ يَشَاءَ رَبُّهَا. رَوَاهُ البُخَارِيّ","english":{"narrator":"Anas said that when Abu Bakr sent him to al-Bahrain he wrote him this letter:","text":"In the name of God, the Compassionate, the Merciful. This is the obligatory sadaqa which God’s messenger imposed on the Muslims which God commanded him to impose. Those Muslims who are asked for the proper amount must give it, but those who are asked for more than that must not give it. For twenty-four camels or less, a sheep is to be given for every five. When they reach twenty-five to thirty-five, a she-camel in her second year is to be given. When they reach thirty-six to forty-five, a she-camel in her third year is to be given. When they reach forty-six to sixty, a she-camel in her fourth year which is ready to be covered by a stallion is to be given. When they reach sixty-one to seventy-five, a she-camel in her fifth year is to be given. When they reach seventy-six to ninety, two she-camels in their third year are to be given. When they reach ninety-one to a hundred and twenty, two she-camels in their fourth year which are ready to be covered by a stallion are to be given. When they exceed a hundred and twenty, a she-camel in her third year is to be given for every forty and a she-camel in her fourth year for every fifty. If anyone has only four camels, no sadaqa is payable on them unless their owner wishes, but when they reach five a sheep is payable on them. If anyone whose camels reach the number on which a she-camel in her fifth year is payable does not possess one but possesses one in her fourth year, that will be accepted from him along with two sheep if he can conveniently give them, or else twenty dirhams. If anyone whose camels reach the number on which a she-camel in her fourth year is payable does not possess one but possesses one in her fifth year, that will be accepted from him, and the collector must give him twenty dirhams or two sheep. If anyone whose camels reach the number on which a she-camel in her fourth year is payable possesses only one in her third year, that will be accepted from him along with two sheep or twenty dirhams. If any one whose camels reach the number on which a she-camel in her third year is payable possesses one in her fourth year, that will be accepted from him, and the collector must give him twenty dirhams or two sheep. If anyone whose camels reach the number on which a she-camel in her third year is payable does not possess one but possesses one in her second year, that will be accepted from him, and he must give along with it twenty dirhams or two sheep. If anyone whose camels reach the number on which a she-camel in her second year is payable does not possess one but possesses one in her third year, that will be accepted from him, and the collector must give him twenty dirhams or two sheep; but if he does not possess a she-camel in her second year as is required and possesses a male camel in its third year, that will be accepted from him and nothing extra is to be demanded along with it. Concerning the sadaqa on sheep which are pasturing, when they number from forty to a hundred and twenty, a sheep is to be given. On over a hundred and twenty up to two hundred two sheep are to be given. On over two hundred up to three hundred three sheep are to be given. If they exceed three hundred, a sheep is to be given for every hundred. If a man’s pasturing animals are one less than forty no sadaqa is due on them unless their owner wishes. An old sheep, one with a defect in the eye, or a male goat is not to be brought forth as sadaqa unless the collector is willing. Those which are in separate flocks are not to be brought together and those which are in one flock are not to be separated from fear of sadaqa. * Regarding what belongs to two partners, they can make claims for restitution from one another with equity. On dirhams a fortieth is payable, but if there are only a hundred and ninety nothing is payable unless their owner wishes. \n\nBukhari transmitted it.\n\n* The principle is that there is to be no rearrangement either so that the collector may get more than he might, or the owner may give less than he might."}},{"id":26,"idInBook":26,"chapterId":6,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «فِيمَا سَقَتِ السَّمَاءُ وَالْعُيُونُ أَوْ كَانَ عَثَرِيًّا الْعُشْرُ. وَمَا سقِِي بالنضح نصف الْعشْر» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"‘Abdallah b. ‘Umar reported the Prophet as saying, \n“A tenth is payable on what is watered by rain or wells, or from underground moisture, and a twentieth on what is watered by draught camels.” \n\nBukhari transmitted it."}},{"id":27,"idInBook":27,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «العجماء جرحها جَبَّار والبشر جَبَّار والمعدن جَبَّار وَفِي الرِّكَاز الْخمس»","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, \n“No retaliation is payable for a wound caused by a dumb animal, or for an accident in a well or a mine, but a fifth is payable on buried treasure.” *\n\n(Bukhari and Muslim.)\n\n* The word used (rikaz) is applied to treasure buried by people in pre-Islamic times; but the word may also mean metal in mines."}},{"id":28,"idInBook":28,"chapterId":6,"bookId":14,"arabic":"عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" قَدْ عَفَوْتُ عَنِ الْخَيْلِ وَالرَّقِيقِ فَهَاتُوا صَدَقَةً الرِّقَةِ: مِنْ كُلِّ أَرْبَعِينَ دِرْهَمًا دِرْهَمٌ وَلَيْسَ فِي تِسْعِينَ وَمِائَةٍ شَيْءٌ فَإِذَا بَلَغَتْ مِائَتَيْنِ فَفِيهَا خَمْسَةُ دَرَاهِمَ \". رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَفِي رِوَايَةٍ لأبي دَاوُد عَن الْحَارِث عَنْ عَلِيٍّ قَالَ زُهَيْرٌ أَحْسَبُهُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ: \" هَاتُوا رُبْعَ الْعُشْرِ مِنْ كُلِّ أَرْبَعِينَ دِرْهَمًا دِرْهَمٌ وَلَيْسَ عَلَيْكُمْ شَيْءٌ حَتَّى تَتِمَّ مِائَتَيْ دِرْهَمٍ. فَإِذَا كَانَتْ مِائَتَيْ دِرْهَمٍ فَفِيهَا خَمْسَةُ دَرَاهِمَ. فَمَا زَادَ فَعَلَى حِسَابِ ذَلِكَ. وَفِي الْغَنَمِ فِي كُلِّ أَرْبَعِينَ شَاةً شَاةٌ إِلَى عِشْرِينَ وَمِائَة ز فَإِن زَادَت وَاحِدَة فشاتان إِلَى مِائَتَيْنِ. فَإِن زَادَتْ فَثَلَاثُ شِيَاهٍ إِلَى ثَلَاثِمِائَةٍ فَإِذَا زَادَتْ على ثَلَاث مائَة فَفِي كُلِّ مِائَةٍ شَاةٌ. فَإِنْ لَمْ تَكُنْ إِلَّا تِسْعٌ وَثَلَاثُونَ فَلَيْسَ عَلَيْكَ فِيهَا شَيْءٌ\nوَفِي الْبَقَرِ: فِي كُلِّ ثَلَاثِينَ تَبِيعٌ وَفِي الْأَرْبَعين مُسِنَّة وَلَيْسَ على العوامل شَيْء \"","english":{"narrator":"","text":"‘Ali reported God’s messenger as saying, \n“I have given exemption regarding horses and slaves; with regard to coins, however, you must pay a dirham for every forty, but nothing is payable on a hundred and ninety. When the total reaches two hundred, five dirhams are payable.” \n\nTirmidhi and Abu Dawud transmitted it. \n\nIn a version by Abu Dawud from al-Harith al-A'war from ‘Ali, from the Prophet, as Zuhair thought,* he said, “Pay a fortieth.” A dirham is payable on every forty, but you are not liable for payment till you have a complete two hundred dirhams. When they reach two hundred five dirhams are payable, and that proportion is applicable to larger amounts. Regarding sheep, for every forty sheep up to a hundred and twenty, one sheep is payable. If there is one more, then up to two hundred two sheep are payable. If there are more, then up to three hundred three sheep are payable, and if there are more than three hundred a sheep is payable for every hundred. But if you possess only thirty-nine, nothing is payable on them. Regarding cattle, a male calf of a year old is payable for every thirty and a cow in its third year for forty, but nothing is payable on working animals.\n\n* Zuhair, from whom Abu Dawud’s immediate informant got the tradition, is here quoted as saying he thought 'Ali got the tradition from the Prophet directly. See Abu Dawud, zakat, 5. There are three stages in the isnad between Zuhair and Ali."}},{"id":29,"idInBook":29,"chapterId":6,"bookId":14,"arabic":"وَعَنْ مُعَاذٍ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا وَجَّهَهُ إِلَى الْيَمَنِ أَمْرَهُ أَنْ يَأْخُذَ مِنْ الْبَقَرَة: مِنْ كُلِّ ثَلَاثِينَ تَبِيعًا أَوْ تَبِيعَةً وَمِنْ كل أَرْبَعِينَ مُسِنَّةً. رَوَاهُ أَبُو دَاوُدَ وَالتِّرْمِذِيُّ وَالنَّسَائِيُّ والدارمي","english":{"narrator":"","text":"Mu'adh said that when the Prophet sent him to the Yemen he ordered him to take a male or female calf of a year old for every thirty cattle and a cow in its third year for every forty. \n\nAbu Dawud, Tirmidhi, Nasa’i and Darimi transmitted it."}},{"id":30,"idInBook":30,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْمُعْتَدِي فِي الصَّدَقَةِ كَمَانِعِهَا» . رَوَاهُ أَبُو دَاوُد وَالتِّرْمِذِيّ","english":{"narrator":"","text":"Anas reported God’s messenger as saying, \n“He who collects more sadaqa than is due is like him who refuses to pay it.” *\n\nAbu Dawud and Tirmidhi transmitted it.\n\n* Meaning that the sin committed by both is similar in its seriousness."}},{"id":31,"idInBook":31,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَيْسَ فِي حَبٍّ وَلَا تَمْرٍ صَدَقَةٌ حَتَّى يَبْلُغَ خَمْسَةَ أَوْسُقٍ» . رَوَاهُ النَّسَائِيّ","english":{"narrator":"","text":"Abu Sa’id al-Khudri reported the Prophet as saying, \n“There is no sadaqa payable on grain or dates till they reach five camel-loads.” \n\nNasa’i transmitted it."}},{"id":32,"idInBook":32,"chapterId":6,"bookId":14,"arabic":"وَعَنْ مُوسَى بْنِ طَلْحَةَ قَالَ: عِنْدَنَا كِتَابُ مُعَاذِ بْنِ جَبَلٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ: إِنَّمَا أَمَرَهُ أَنْ يَأْخُذَ الصَّدَقَةَ مِنَ الْحِنْطَةِ وَالشَّعِيرِ وَالزَّبِيبِ وَالتَّمْرِ. مُرْسل رَوَاهُ فِي شرح السّنة","english":{"narrator":"","text":"Musa b. Talha said he had the letter of Mu'adh b. Jabal from the Prophet to the effect that he ordered him to collect sadaqa only on wheat, barley, raisins and dates. \n\nIt is in mursal form and is transmitted in Sharh as-sunna."}},{"id":33,"idInBook":33,"chapterId":6,"bookId":14,"arabic":"وَعَنْ عَتَّابِ بْنِ أَسِيدٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي زَكَاةِ الْكُرُومِ: «إِنَّهَا تُخْرَصُ كَمَا تُخْرَصُ النَّخْلُ ثُمَّ تُؤَدَّى زَكَاتُهُ زَبِيبًا كَمَا تُؤَدَّى زَكَاةُ النَّخْلِ تَمْرًا» . رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد","english":{"narrator":"","text":"‘Attab b. Usaid reported the Prophet as saying regarding the zakat on vines, \n“They are to be estimated as palm-trees are, then the zakat is to be paid in raisins as the zakat on palm-trees is paid in dried dates.” \n\nTirmidhi and Abu Dawud transmitted it."}},{"id":34,"idInBook":34,"chapterId":6,"bookId":14,"arabic":"وَعَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ حَدَّثَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ: «إِذَا خَرَصْتُمْ فَخُذُوا وَدَعُوا الثُّلُثَ فَإِنْ لَمْ تَدَعُوا الثُّلُثَ فَدَعُوا الرُّبُعَ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُد وَالنَّسَائِيّ","english":{"narrator":"","text":"Sahl b. Abu Hathma related that God’s messenger used to say, \n“When you estimate take them leaving a third, and if you do not leave a third leave a quarter.” *\n\nTirmidhi, Abu Dawud and Nasa'i transmitted it.\n\n* This is interpreted by some as meaning that a third or a quarter was not to be reckoned when assessing the tax."}},{"id":35,"idInBook":35,"chapterId":6,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ قَالَتْ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يبْعَث عبد الله ابْن رَوَاحَةَ إِلَى يَهُودٍ فَيَخْرُصُ النَّخْلَ حِينَ يَطِيبُ قَبْلَ أَنْ يُؤْكَلَ مِنْهُ. رَوَاهُ أَبُو دَاوُدَ","english":{"narrator":"","text":"'A’isha said the Prophet used to send 'Abdallah b. Rawaha to Jews, and he would make an estimate of the palm trees when the fruit was in good condition before any of it was eaten.\n\nAbu Dawud transmitted it."}},{"id":36,"idInBook":36,"chapterId":6,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم فِي الْعَمَل: «فِي كُلِّ عَشْرَةِ أَزُقٍّ زِقٌّ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: فِي إِسْنَادِهِ مَقَالٌ وَلَا يَصِحُّ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي هَذَا الْبَاب كثير شَيْء","english":{"narrator":"","text":"Ibn ‘Umar reported God’s messenger as saying regarding honey, \n“A skin is payable on every ten.” \n\nTirmidhi transmitted it, saying its isnad is criticised and that little on this subject is soundly reported from the Prophet."}},{"id":37,"idInBook":37,"chapterId":6,"bookId":14,"arabic":"وَعَنْ زَيْنَبَ امْرَأَةِ عَبْدِ اللَّهِ قَالَتْ: خَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «يَا مَعْشَرَ النِّسَاءِ تَصَدَّقْنَ وَلَوْ مِنْ حُلِيِّكُنَّ فَإِنَّكُنَّ أَكْثَرُ أَهْلِ جَهَنَّمَ يَوْمَ الْقِيَامَةِ» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Zainab the wife of ‘Abdallah said God’s messenger addressed them saying, \n“You women should give alms even if it consists of your jewellery, * for you will be the majority of the inhabitants of jahannam on the day of resurrection.” \n\nTirmidhi transmitted it.\n\n* There is a difference of opinion as to whether this means simply giving some of their jewellery, or whether it means that zakat must be paid on jewellery which they possess."}},{"id":38,"idInBook":38,"chapterId":6,"bookId":14,"arabic":"وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ: أَنَّ امْرَأَتَيْنِ أَتَتَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَفِي أَيْدِيهِمَا سِوَارَانِ مِنْ ذَهَبٍ فَقَالَ لَهُمَا: «تُؤَدِّيَانِ زَكَاتَهُ؟» قَالَتَا: لَا. فَقَالَ لَهُمَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَتُحِبَّانِ أَنْ يُسَوِّرَكُمَا اللَّهُ بِسِوَارَيْنِ مِنْ نَارٍ؟» قَالَتَا: لَا. قَالَ: «فَأَدِّيَا زَكَاتَهُ» رَوَاهُ التِّرْمِذِيّ وَقَالَ: هَذَا حَدِيث قد رَوَاهُ الْمُثَنَّى بْنُ الصَّبَّاحِ عَنْ عَمْرِو بْنِ شُعَيْبٍ نَحْوَ هَذَا وَالْمُثَنَّى بْنُ الصَّبَّاحِ وَابْنُ لَهِيعَةَ يُضَعَّفَانِ فِي الْحَدِيثِ وَلَا يَصِحُّ فِي هَذَا الْبَابِ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَيْء","english":{"narrator":"","text":"‘Amr b. Shu'aib on his father’s authority said that his grandfather told of two women wearing gold bangles on their wrists coming to God’s messenger, who asked them whether they paid zakat on them. On their replying that they did not, he asked them whether they wanted God to put two bangles of fire on them, and when they replied that they did not, he told them to pay the zakat due on them. \n\nTirmidhi transmitted it, saying something similar to this tradition has been transmitted by al-Muthanna b. as-Sabbah from ‘Amr b. Shu'aib; but al-Muthanna b. as-Sabbah and Ibn Lahi'a are declared to be weak in tradition; and nothing on this subject is soundly reported from the Prophet."}},{"id":39,"idInBook":39,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أُمِّ سَلَمَةَ قَالَتْ: كُنْتُ أَلْبَسُ أَوْضَاحًا مِنْ ذَهَبٍ فَقُلْتُ: يَا رَسُولَ اللَّهِ أَكَنْزٌ هُوَ؟ فَقَالَ: «مَا بلغ أَن يُؤدى زَكَاتُهُ فَزُكِّيَ فَلَيْسَ بِكَنْزٍ» . رَوَاهُ مَالِكٌ وَأَبُو دَاوُد","english":{"narrator":"","text":"Umm Salama said she was wearing gold ornaments and asked God’s messenger whether that was a treasure,* to which he replied, \n“Whatever reaches a quantity on which zakat is payable is not a treasure when the zakat is paid.” \n\nMalik and Abu Dawud transmitted it.\n\n* The word kanz which means a treasure is used as a technical term for property liable to zakat on which the zakat is not paid."}},{"id":40,"idInBook":40,"chapterId":6,"bookId":14,"arabic":"وَعَنْ سَمُرَةَ بْنِ جُنْدُبٍ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَأْمُرُنَا أَنْ نُخْرِجَ الصَّدَقَةَ مِنَ الَّذِي نُعِدُّ لِلْبَيْعِ. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Samura b. Jundub said God’s messenger used to order them to deduct the sadaqa from what they prepared for trade. \n\nAbu Dawud transmitted it."}},{"id":41,"idInBook":41,"chapterId":6,"bookId":14,"arabic":"وَعَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ عَنْ غَيْرِ وَاحِدٍ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَقْطَعَ لِبِلَالِ بْنِ الْحَارِثِ الْمُزَنِيِّ معادن الْقبلية وَهِيَ مِنْ نَاحِيَةِ الْفُرْعِ فَتِلْكَ الْمَعَادِنُ لَا تُؤْخَذُ مِنْهَا إِلَّا الزَّكَاةُ إِلَى الْيَوْمِ. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Rabi'a b. ‘Abd ar-Rahman on more than one person’s authority said, \n“God’s messenger assigned as a fief to Bilal b. al-Harith al-Muzani the mines of al-Qabaliya which is in the neighbourhood of al-Fur‘,* and only zakat is levied on those mines up to the present day.” \n\nAbu Dawud transmitted it.\n\n* Yaqut, Mu'jam, ii, 471, says it is a village in the neighbourhood of ar-Rabadha, eight stages from Medina on the way to Mecca; some say four days’ journey."}},{"id":42,"idInBook":42,"chapterId":6,"bookId":14,"arabic":"عَنْ عَلِيٍّ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَيْسَ فِي الْخَضْرَاوَاتِ صَدَقَةٌ وَلَا فِي الْعَرَايَا صَدَقَةٌ وَلَا فِي أَقَلَّ مِنْ خَمْسَةِ أَوْسُقٍ صَدَقَةٌ وَلَا فِي الْعَوَامِلِ صَدَقَةٌ وَلَا فِي الْجَبْهَةِ صَدَقَةٌ» . قَالَ الصَّقْرُ: الْجَبْهَةُ الْخَيل وَالْبِغَال وَالْعَبِيد. رَوَاهُ الدَّارَقُطْنِيّ","english":{"narrator":"","text":"‘Ali reported the Prophet as saying, \n“There is no sadaqa on green herbs, palm-trees given in usufruct for a year, less than five camel-loads, working animals, or al-jabha.” As-Saqr said al-jabha* consists of horses, mules and slaves. \n\nDaraqutni transmitted it.\n\n* Applied usually to horses, meaning the best type."}},{"id":43,"idInBook":43,"chapterId":6,"bookId":14,"arabic":"وَعَنْ طَاوُسٍ أَنَّ مُعَاذَ بْنَ جَبَلٍ أَتَى بِوَقَصِ الْبَقَرِ فَقَالَ: لَمْ يَأْمُرْنِي فِيهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِشَيْءٍ. رَوَاهُ الدَّارَقُطْنِيُّ وَالشَّافِعِيُّ وَقَالَ: الْوَقَصُ مَا لَمْ يَبْلُغِ الْفَرِيضَةَ","english":{"narrator":"","text":"Tawus told that a waqs of cattle was brought to Mu'adh b. Jabal and he said the Prophet did not command him to pay anything on them. \n\nDaraqutni and Shafi' transmitted it, the latter saying that a waqs is a number less than that on which sadaqa is payable. *\n\n* The word waqs or waqas is applied to odd numbers of animals (usually cattle) between one limit of assessment and the next."}},{"id":44,"idInBook":44,"chapterId":6,"bookId":14,"arabic":"عَنِ ابْنِ عُمَرَ قَالَ: فَرَضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَكَاةَ الْفِطْرِ صَاعًا مِنْ تَمْرٍ أَوْ صَاعًا مِنْ شَعِيرٍ عَلَى الْعَبْدِ وَالْحُرِّ وَالذَّكَرِ وَالْأُنْثَى وَالصَّغِيرِ وَالْكَبِيرِ مِنَ الْمُسْلِمِينَ وَأَمَرَ بِهَا أَنْ تُؤَدَّى قَبْلَ خُرُوجِ النَّاس إِلَى الصَّلَاة","english":{"narrator":"","text":"Ibn ‘Umar said God’s messenger prescribed as the zakat payable by slave and freeman, male and female, young and old among the Muslims on breaking the fast of Ramadan a sa'*  of dried dates or a sa' of barley, and gave command that this should be paid before the people went out to prayer. \n\n(Bukhari and Muslim.)\n\n* The Hijazi sa' is described as a measure equivalent to four mudds, the mudd being the amount a man with average size hands can hold with both hands extended."}},{"id":45,"idInBook":45,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: كُنَّا نُخْرِجُ زَكَاةَ الْفِطْرِ صَاعًا مِنْ طَعَامٍ أَو صَاعا من شعير أَو صَاعا من تَمْرٍ أَوْ صَاعًا مَنْ أَقِطٍ أَوْ صَاعًا من زبيب","english":{"narrator":"","text":"Abu Sa'id al-Khudrl said, \n“We used to bring forth as the zakat on breaking the fast of Ramadan a sa’ of grain, or of barley, or of dried dates, or of cheese, or of raisins.\" \n\n(Bukhari and Muslim.)"}},{"id":46,"idInBook":46,"chapterId":6,"bookId":14,"arabic":"عَنِ ابْنِ عَبَّاسٍ قَالَ: فِي آخِرِ رَمَضَانَ أخرجُوا صَدَقَة صومكم. فرض رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَذِهِ الصَّدَقَةَ صَاعًا مِنْ تَمْرٍ أَوْ شَعِيرٍ أَوْ نِصْفَ صَاعٍ مِنْ قَمْحٍ عَلَى كُلِّ حُرٍّ أَوْ مَمْلُوكٍ ذَكَرٍ أَوْ أُنْثَى صَغِيرٍ أَوْ كَبِيرٍ. رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ","english":{"narrator":"","text":"Ibn 'Abbas said, \n“At the end of Ramadan bring forth the sadaqa relating to your fast. God's messenger prescribed this sadaqa as a sa' of dried dates or barley, or half a sa' of wheat payable by every free¬man or slave, male or female, young or old.\" \n\nAbu Dawud and Nasa’i transmitted it."}},{"id":47,"idInBook":47,"chapterId":6,"bookId":14,"arabic":"وَعَن ابْنِ عَبَّاسٍ قَالَ: فَرَضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَكَاةَ الْفِطْرِ طُهْرَ الصِّيَامِ مِنَ اللَّغْوِ وَالرَّفَثِ وَطُعْمَةً لِلْمَسَاكِينِ. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"He said that God’s messenger prescribed the zakat relating to the breaking of the fast as a purification of the fasting from empty and obscene talk and as food for the poor. \n\nAbu Dawud transmitted it."}},{"id":48,"idInBook":48,"chapterId":6,"bookId":14,"arabic":"عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَ مُنَادِيًا فِي فِجَاجِ مَكَّةَ: «أَلَا إِنَّ صَدَقَةَ الْفِطْرِ وَاجِبَةٌ عَلَى كُلِّ مُسْلِمٍ ذَكَرٍ أَوْ أُنْثَى حُرٍّ أَوْ عَبْدٍ صَغِيرٍ أَوْ كَبِيرٍ مُدَّانِ مِنْ قَمْحٍ أَوْ سِوَاهُ أَوْ صَاع من طَعَام» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"‘Amr b. Shu'aib on his father’s authority said his grandfather told that the Prophet sent someone to announce in the ravines of Mecca, \n“The sadaqa relating to the breaking of the fast is incumbent on every Muslim, male or female, freeman or slave, young or old, consisting of two mudds of wheat or such like, or a sa' of grain.\" \n\nTirmidhi transmitted it."}},{"id":49,"idInBook":49,"chapterId":6,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ ثَعْلَبَةَ أَوْ ثَعْلَبَةَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي صُعَيْرٍ عَنْ أَبِيهِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «صَاعٌ مِنْ بُرٍّ أَوْ قَمْحٍ عَنْ كُلِّ اثْنَيْنِ صَغِيرٍ أَوْ كَبِيرٍ حُرٍّ أَوْ عَبْدٍ ذَكَرٍ أَوْ أُنْثَى. أَمَّا غَنِيُّكُمْ فَيُزَكِّيهِ اللَّهُ. وَأَمَّا فَقِيرُكُمْ فَيَرُدُّ عَلَيْهِ أَكْثَرَ مَا أعطَاهُ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"‘Abdallah b. Tha'laba, or Tha'laba b. ‘Abdallah b. Abu Su'air* reported on his father’s authority that God’s messenger said, \n“A sa’ of wheat** is to be taken from every two, young or old, freeman or slave, male or female. Those of you who are rich will be purified by God and those of you who are poor will have more than they gave returned by Him to them.” \n\nAbu Dawud transmitted it.\n\n* Abu Dawud, zakat, 21 gives the name as above, but others often give b. Su'air. Ibn 'Abd al-Barr in Isti'ab and Ibn Hajar in Tahdhib give b. Su'air, adding that b. Abu Su'air also occurs.\n** The transmitter is not sure which word for \"wheat” was used, so he gives either burr or qamh."}},{"id":50,"idInBook":50,"chapterId":6,"bookId":14,"arabic":"عَنْ أَنَسٍ قَالَ: مَرَّ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اللَّهُ عَلَيْهِ وَسَلَّمَ بِتَمْرَةٍ فِي الطَّرِيقِ فَقَالَ: «لَوْلَا أَنِّي أَخَافُ أَنْ تَكُونَ مِنَ الصَّدَقَةِ لأكلتها»","english":{"narrator":"","text":"Anas told that the Prophet came upon a date on the road and said, \n“Were it not that I fear it may be part of the sadaqa I would eat it.”\n\n(Bukhari and Muslim.)"}},{"id":51,"idInBook":51,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: أَخَذَ الْحَسَنُ بْنُ عَلِيٍّ تَمْرَةً مِنْ تَمْرِ الصَّدَقَةِ فَجَعَلَهَا فِي فِيهِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «كِخْ كِخْ» لِيَطْرَحَهَا ثُمَّ قَالَ: «أما شَعرت أَنا لَا نَأْكُل الصَّدَقَة؟»","english":{"narrator":"","text":"Abu Huraira told that al-Hasan b. 'All took one of the dates of the sadaqa and put it in his mouth, whereupon the Prophet said, “Leave it alone, leave it alone,” in order that he might throw it away. He then said, \n“Do you not know that we* do not eat the sadaqa?’ \n\n(Bukhari and Muslim.)\n\n* The pronoun includes the Prophet and his family, al Hasan being his grandson. The idea is more definitely expressed in 'Abd al-Muttalib's tradition."}},{"id":52,"idInBook":52,"chapterId":6,"bookId":14,"arabic":"وَعَنْ عَبْدِ الْمُطَّلِبِ بْنِ رَبِيعَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «إِن هَذِهِ الصَّدَقَاتِ إِنَّمَا هِيَ أَوْسَاخُ النَّاسِ وَإِنَّهَا لَا تَحِلُّ لِمُحَمَّدٍ وَلَا لِآلِ مُحَمَّدٍ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"‘Abd al-Muttalib b. Rabi'a reported God’s messenger as saying, \n“These sadaqat are only people’s impurities,* and they are not lawful for Muhammad or Muhammad’s family.” \n\nMuslim transmitted it.\n\n* i.e. an atonement for their sins."}},{"id":53,"idInBook":53,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أُتِيَ بِطَعَامٍ سَأَلَ عَنْهُ: «أَهَدْيَةٌ أَمْ صَدَقَةٌ؟» فَإِنْ قِيلَ: صَدَقَةٌ: قَالَ لِأَصْحَابِهِ: «كُلُوا» وَلَمْ يَأْكُلْ وَإِنْ قِيلَ: هَدِيَّةٌ ضَرَبَ بِيَدِهِ فَأَكَلَ مَعَهم","english":{"narrator":"","text":"Abu Huraira said that when God’s messenger was brought food he asked whether it was a present or sadaqa, and if he was informed that it was sadaqa he told his companions to eat, but did not eat himself; if however he was informed that it was a present he put in his hand and ate along with them.\n\n(Bukhari and Muslim.)"}},{"id":54,"idInBook":54,"chapterId":6,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: كَانَ فِي بَرِيرَةَ ثَلَاثُ سُنَنٍ: إِحْدَى السُّنَنِ أَنَّهَا عُتِقَتْ فَخُيِّرَتْ فِي زَوْجِهَا وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْوَلَاءُ لِمَنْ أَعْتَقَ» . وَدَخَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالْبُرْمَةُ تَفُورُ بِلَحْمٍ فَقُرِّبَ إِلَيْهِ خُبْزٌ وَأُدْمٌ مِنْ أُدْمِ الْبَيْتِ فَقَالَ: «أَلَمْ أَرَ بُرْمَةً فِيهَا لَحْمٌ؟» قَالُوا: بَلَى وَلَكِنَّ ذَلِكَ لَحْمٌ تُصُدِّقَ بِهِ عَلَى بَرِيرَةَ وَأَنْتَ لَا تَأْكُلُ الصَّدَقَةَ قَالَ: «هُوَ عَلَيْهَا صَدَقَةٌ وَلنَا هَدِيَّة»","english":{"narrator":"","text":"‘A’isha said that three sunnas concerned Barira.* One was that she became free and was given her choice regarding her husband. God’s messenger said, \n\"The right of inheritance from an emancipated slave belongs to the one who set him free.”* \nGod’s messenger once came in when the pot was boiling with meat in it, and he was presented with some of the bread and condiments which were in the house. \nHe asked, “Did I not see a pot containing meat?” and was told, “Yes, but that is meat which was given as sadaqa to Barira and you do not eat the sadaqa.” \nHe replied, “It is sadaqa for her and a gift to us.” ***\n\n\n(Bukhari and Muslim.)\n\n* A slave-woman whom 'A’isha bought and set free.\n** The context shows that these words are said to have been spoken in connection with Barira.\n*** This is the part of the tradition which makes it relevant in this chapter, as it declares that one who may not lawfully receive sadaqa may accept as a gift sadaqa which has been received by one who may lawfully receive it."}},{"id":55,"idInBook":55,"chapterId":6,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُقَبِّلُ الْهَدِيَّة ويثيب عَلَيْهَا. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"She said that God’s messenger would accept a present and give something in return for it. \n\nBukhari transmitted it."}},{"id":56,"idInBook":56,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَوْ دُعِيتُ إِلَى كُرَاعٍ لَأَجَبْتُ وَلَوْ أُهْدِيَ إِلَيَّ ذِرَاع لقبلت» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “If I were invited to eat a trotter I would accept the invitation, and if I were presented with a fore-leg I would accept it.” \n\nBukhari transmitted it."}},{"id":57,"idInBook":57,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَيْسَ الْمِسْكِينُ الَّذِي يَطُوفُ عَلَى النَّاسِ تَرُدُّهُ اللُّقْمَةُ وَاللُّقْمَتَانِ وَالتَّمْرَةُ وَالتَّمْرَتَانِ وَلَكِنَّ الْمِسْكِينَ الَّذِي لَا يَجِدُ غِنًى يُغْنِيهِ وَلَا يُفْطَنُ بِهِ فَيُتَصَدَّقَ عَلَيْهِ وَلَا يَقُومُ فَيَسْأَلَ النَّاس»","english":{"narrator":"","text":"He reported God’s messenger as saying, \n\"The poor man (miskin) is not the one who goes round to people and is dismissed with one or two morsels, and one or two dates, but is he who does not get enough to satisfy him, is not taken notice of so that alms may be given him, yet does not get up and beg from people.” \n\n(Bukhari and Muslim.)"}},{"id":58,"idInBook":58,"chapterId":6,"bookId":14,"arabic":"عَنْ أَبِي رَافِعٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَ رَجُلًا مِنْ بَنِي مَخْزُومٍ عَلَى الصَّدَقَةِ فَقَالَ لِأَبِي رَافِعٍ: اصْحَبْنِي كَيْمَا تُصِيبُ مِنْهَا. فَقَالَ: لَا حَتَّى أَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَسْأَلَهُ. فَانْطَلَقَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلَهُ فَقَالَ: «إِنَّ الصَّدَقَةَ لَا تَحِلُّ لَنَا وَإِنَّ مَوَالِيَ الْقَوْمِ مِنْ أَنْفُسِهِمْ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُد وَالنَّسَائِيّ","english":{"narrator":"","text":"Abu Rafi' said God’s messenger sent a man of the B. Makhzum to collect sadaqa and he asked him to accompany him so that he might get some of it; but he refused to do so till he went to God's messenger and asked him. He went to the Prophet and asked him, and he said, \n“The sadaqa is not lawful for us, and the clients of a people are treated as being of their number.” *\n\nTirmidhi, Abu Dawud and Nasa’i transmitted it.\n* Abu Rafi’ had been a slave of the Prophet by whom he was set free. The point of the tradition is that the rules which apply to any people apply to their freedmen as well, and so Abu Rafi' was not entitled to receive sadaqa."}},{"id":59,"idInBook":59,"chapterId":6,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَحِلُّ الصَّدَقَةُ لِغَنِيٍّ وَلَا لِذِي مِرَّةٍ سَوِيٍّ» . رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد والدارمي\nوَرَوَاهُ أَحْمَدُ وَالنَّسَائِيُّ وَابْنُ مَاجَهْ عَنْ أَبِي هُرَيْرَة","english":{"narrator":"","text":"'Abdallah b. ‘Amr reported God’s messenger as saying, \n“Sadaqa may not be given to a rich man, or to one who has strength and is sound in limb.” \n\nTirmidhi, Abu Dawud and Darimi transmitted it, \nand Ahmad, Nasa’i and Ibn Majah transmitted it from Abu Huraira."}},{"id":60,"idInBook":60,"chapterId":6,"bookId":14,"arabic":"وَعَنْ عُبَيْدِ اللَّهِ بْنِ عَدِيِّ بْنِ الْخِيَارِ قَالَ: أَخْبَرَنِي رَجُلَانِ أَنَّهُمَا أَتَيَا النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ فِي حَجَّةِ الْوَدَاعِ وَهُوَ يُقَسِّمُ الصَّدَقَةَ فَسَأَلَاهُ مِنْهَا فَرَفَعَ فِينَا النَّظَرَ وَخَفَضَهُ فَرَآنَا جَلْدَيْنِ فَقَالَ: «إِنْ شِئْتُمَا أَعْطَيْتُكُمَا وَلَا حَظَّ فِيهَا لِغَنِيٍّ وَلَا لِقَوِيٍّ مكتسب» . رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ","english":{"narrator":"","text":"‘Ubaidallah b. ‘Adi b. al-Khiyar said two men informed him that they had come to the Prophet when he was at the Farewell Pilgrimage while he was dividing the sadaqa and asked him for some of it. He looked them up and down, and seeing that they were robust, he said, \n“If you wish I shall give you something, but there is no share in it for a rich man or for one who is strong and able to earn a living.” \n\nAbu Dawud and Nasa’i transmitted it."}},{"id":61,"idInBook":61,"chapterId":6,"bookId":14,"arabic":"وَعَنْ عَطَاءِ بْنِ يَسَارٍ مُرْسَلًا قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: \n\" لَا تَحِلُّ الصَّدَقَةُ لِغَنِيٍّ إِلَّا لِخَمْسَةٍ: لِغَازٍ فِي سَبِيلِ اللَّهِ أَوْ لِعَامِلٍ عَلَيْهَا أَوْ لِغَارِمٍ أَوْ لِرَجُلٍ اشْتَرَاهَا بِمَالِهِ أَوْ لِرَجُلٍ كَانَ لَهُ جَارٌ مِسْكِينٌ فَتَصَدَّقَ عَلَى الْمِسْكِينِ فَأَهْدَى الْمِسْكِين للغني \". رَوَاهُ مَالك وَأَبُو دَاوُد\nوَفِي رِوَايَةٍ لِأَبِي دَاوُدَ عَنْ أَبِي سَعِيدٍ: «أوابن السَّبِيل»","english":{"narrator":"‘Ata’ b. Yasar reported in mursal form that God’s messenger said, \n''Sadaqa may not be given to a rich man, with the exception of five classes:","text":"one who fights in God’s path, or one who collects it, or a debtor, a man who buys it with his money, or a man who has a poor neighbour a no has been given sadaqa and gives a present to the rich man.” \n\nMalik and Abu Dawud transmitted it. A version by Abu Dawud from Abu Sa'id has ‘‘or a traveller.”"}},{"id":62,"idInBook":62,"chapterId":6,"bookId":14,"arabic":"وَعَنْ زِيَادِ بْنِ الْحَارِثِ الصُّدَائِيِّ قَالَ: أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَبَايَعْتُهُ فَذَكَرَ حَدِيثًا طَوِيلًا فَأَتَاهُ رَجُلٌ فَقَالَ: أَعْطِنِي مِنَ الصَّدَقَةِ. فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ اللَّهَ لَمْ يَرْضَ بِحُكْمِ نَبِيٍّ وَلَا غَيْرِهِ فِي الصَّدَقَاتِ حَتَّى حَكَمَ فِيهَا هُوَ فَجَزَّأَهَا ثَمَانِيَةَ أَجْزَاءٍ فَإِنْ كُنْتَ مِنْ تِلْكَ الْأَجْزَاء أَعطيتك» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Ziyad b. al-Harith as-Suda’i said he came to the Prophet and swore allegiance to him, and after telling a long story he said that a man came to him and asked him to give him some of the sadaqa. God’s messenger then said to him, \n‘‘God is not pleased with a prophet's or anyone else's decision about sadaqat till He has given a decision about them Himself. He has divided those entitled to them into eight categories,* so if you come within those categories I shall give you something.” \n\nAbu Dawud transmitted it.\n\n* Reference is to Al-Qur'an 9:60"}},{"id":63,"idInBook":63,"chapterId":6,"bookId":14,"arabic":"عَنْ زَيْدِ بْنِ أَسْلَمَ قَالَ: شَرِبَ عُمَرُ بْنُ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ لَبَنًا فَأَعْجَبَهُ فَسَأَلَ الَّذِي سَقَاهُ: مِنْ أَيْنَ هَذَا اللَّبَنُ؟ فَأَخْبَرَهُ أَنَّهُ وَرَدَ عَلَى مَاءٍ قَدْ سَمَّاهُ فَإِذَا نَعَمٌ مِنْ نَعَمِ الصَّدَقَةِ وَهُمْ يَسْقُونَ فَحَلَبُوا مِنْ أَلْبَانِهَا فَجَعَلْتُهُ فِي سِقَائِي فَهُوَ هَذَا: فَأدْخل عمر يَده فاستقاءه. رَوَاهُ مَالِكٌ وَالْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَانِ","english":{"narrator":"","text":"Zaid b. Aslam said that ‘Umar b. al-Khattab drank some milk which pleased him and asked the man who gave him the drink where that milk had come from. He informed him that he had gone down to a watering-place which he named and found there some camels which had been given as sadaqa being watered. Saying that the people had drawn off some of their milk, he added, “I put it in this milk-skin of mine, and this is it.” \n‘Umar thereupon put his hand in his mouth and made himself vomit. \n\nMalik and Baihaqi, in Shu’ab al-iman, transmitted it."}},{"id":64,"idInBook":64,"chapterId":6,"bookId":14,"arabic":"عَن قبيصَة بن مُخَارق الْهِلَالِي قَالَ: تَحَمَّلْتُ حَمَالَةً فَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَسْأَلُهُ فِيهَا. فَقَالَ: «أَقِمْ حَتَّى تَأْتِينَا الصَّدَقَة فنأمر لَك بهَا» . قَالَ ثُمَّ قَالَ: «يَا قَبِيصَةُ إِنَّ الْمَسْأَلَةَ لَا تَحِلُّ إِلَّا لِأَحَدِ ثَلَاثَةٍ رَجُلٍ تَحَمَّلَ حَمَالَةً فَحَلَّتْ لَهُ الْمَسْأَلَةُ حَتَّى يُصِيبَهَا ثُمَّ يُمْسِكُ وَرَجُلٍ أَصَابَتْهُ جَائِحَةٌ اجْتَاحَتْ مَالَهُ فَحَلَّتْ لَهُ الْمَسْأَلَةُ حَتَّى يُصِيبَ قِوَامًا مِنْ عَيْشٍ أَوْ قَالَ سِدَادًا مِنْ عَيْشٍ وَرَجُلٍ أَصَابَتْهُ فَاقَةٌ حَتَّى يقوم ثَلَاثَة من ذَوي الحجى مِنْ قَوْمِهِ. لَقَدْ أَصَابَتْ فُلَانًا فَاقَةٌ فَحَلَّتْ لَهُ الْمَسْأَلَةُ حَتَّى يُصِيبَ قِوَامًا مِنْ عَيْشٍ أَوْ قَالَ سِدَادًا مِنْ عَيْشٍ فَمَا سِوَاهُنَّ من الْمَسْأَلَة يَا قبيصَة سحتا يأكلها صَاحبهَا سحتا» . رَوَاهُ مُسلم","english":{"narrator":"Qabisa b. Mukhariq said he had become a guarantor for a payment* and he went to God’s messenger to beg from him regarding it. He said, “Wait till I receive the sadaqa and I shall order it to be given you.” He then said, \n“Begging, Qabisa, is allowable only to one of three classes:","text":"a man who has become a guarantor for a payment, to whom begging is allowed till he gets it, after which he must stop begging; a man whose property has been destroyed by a calamity which has smitten him, to whom begging is allowed till he gets what will support life (or he said, what will provide a reasonable subsistence); and a man who has been smitten by poverty, the genuineness of which is confirmed by three intelligent members of his people, to whom begging is allowed till he gets what will support life (or he said, what will provide a reasonable subsistence). Any other reason for begging, Qabisa, is forbidden, and one who engages in such consumes it as a thing which is forbidden.”**\n\nMuslim transmitted it.\n\n* The word hamala is used of an undertaking to pay a debt or bloodwit.\n** The word here used is suht, for its use of Quran (5:42,62,63)"}},{"id":65,"idInBook":65,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ سَأَلَ النَّاسَ أَمْوَالَهُمْ تَكَثُّرًا فَإِنَّمَا يَسْأَلُ جمرا. فليستقل أَو ليستكثر» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, \n“He who begs the property of others to increase his own is asking only for live coals,* so let him ask little or much.” \n\nMuslim transmitted it.\n\n* A reference incurring some of the punishment of hell."}},{"id":66,"idInBook":66,"chapterId":6,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا يَزَالُ الرَّجُلُ يَسْأَلُ النَّاسَ حَتَّى يَأْتِيَ يَوْمَ الْقِيَامَةِ لَيْسَ فِي وَجْهِهِ مُزْعَةُ لحم»","english":{"narrator":"","text":"‘Abdallah b. ‘Umar reported God’s messenger as saying, \n“When a man is always begging from people the result will be that he will come on the day of resurrection with no flesh on his face.” \n\n(Bukhari and Muslim.)"}},{"id":67,"idInBook":67,"chapterId":6,"bookId":14,"arabic":"وَعَنْ مُعَاوِيَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تُلْحِفُوا فِي الْمَسْأَلَةِ فوَاللَّه لَا يسألني أحدق مِنْكُمِ شَيْئًا فَتُخْرِجَ لَهُ مَسْأَلَتُهُ مِنِّي شَيْئًا وَأَنَا لَهُ كَارِهٌ فَيُبَارَكَ لَهُ فِيمَا أَعْطَيْتُهُ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Mu'awiya reported God’s messenger as saying, \n“Do not beg importunately, for I swear by God that none of you who asks me for anything and gets out of me what he asks when I disapprove of it will receive a blessing concerning what I have given him.” \n\nMuslim\ttransmitted it."}},{"id":68,"idInBook":68,"chapterId":6,"bookId":14,"arabic":"وَعَنِ الزُّبَيْرِ بْنِ الْعَوَّامِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَأَنْ يَأْخُذَ أَحَدُكُمْ حَبْلَهُ فَيَأْتِيَ بِحُزْمَةِ حَطَبٍ عَلَى ظَهْرِهِ فَيَبِيعَهَا فَيَكُفَّ اللَّهُ بِهَا وَجْهَهُ خَيْرٌ لَهُ مِنْ أَنْ يَسْأَلَ النَّاسَ أَعْطَوْهُ أَوْ مَنَعُوهُ» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Az-Zubair b. al-‘Awwam reported God’s messenger as saying, \n“It is better for one of you to take his rope, bring a load of firewood on his back and sell it, God thereby preserving his self-respect, than that he should beg from people whether they give him anything or refuse him.” \n\nBukhari transmitted it."}},{"id":69,"idInBook":69,"chapterId":6,"bookId":14,"arabic":"وَعَنْ حَكِيمِ بْنِ حِزَامٍ قَالَ: سَأَلَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَعْطَانِي ثُمَّ سَأَلْتُهُ فَأَعْطَانِي ثُمَّ قَالَ لِي: «يَا حَكِيمُ إِنَّ هَذَا الْمَالَ خَضِرٌ حُلْوٌ فَمَنْ أَخَذَهُ بِسَخَاوَةِ نَفْسٍ بُورِكَ لَهُ فِيهِ وَمَنْ أَخَذَهُ بِإِشْرَافِ نَفْسٍ لَمْ يُبَارَكْ لَهُ فِيهِ. وَكَانَ كَالَّذِي يَأْكُلُ وَلَا يَشْبَعُ وَالْيَدُ الْعُلْيَا خَيْرٌ مِنَ الْيَدِ السُّفْلَى» . قَالَ حَكِيمٌ: فَقُلْتُ: يَا رَسُولَ اللَّهِ وَالَّذِي بَعَثَكَ بِالْحَقِّ لَا أَرْزَأُ أَحَدًا بَعْدَكَ شَيْئًا حَتَّى أُفَارِقَ الدُّنْيَا \"","english":{"narrator":"","text":"Hakim b. Hizam said he begged from God’s messenger and he gave him something, later he begged again and when he had given him something he said, \n“Hakim, this property is green and sweet, and he who receives it with a liberal mind will be blessed in it, but he who receives it with an avaricious mind will not be blessed in it, being like one who eats without being satisfied. And the upper hand is better than the lower one.” * \nHakim told that he replied, “Messenger of God, by Him who sent you with the truth, I shall not accept anyone’s bounty after this till I leave the world.” \n\n(Bukhari and Muslim.)\n\n* The upper hand is that of the giver and the lower hand is that of the receiver. The sentence is equivalent to saying that it is better to give than to receive."}},{"id":70,"idInBook":70,"chapterId":6,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ وَهُوَ عَلَى الْمِنْبَرِ وَهُوَ يَذْكُرُ الصَّدَقَةَ وَالتَّعَفُّفَ عَنِ الْمَسْأَلَةِ: «الْيَدُ الْعُلْيَا خَيْرٌ مِنَ الْيَدِ السُّفْلَى وَالْيَد الْعليا هِيَ المنفقة وَالْيَد السُّفْلى هِيَ السائلة»","english":{"narrator":"","text":"Ibn ‘Umar reported that God’s messenger said when he was on the pulpit speaking of sadaqa and abstention from begging, \n“The upper hand is better than the lower one, the upper being the one which bestows and the lower the one which begs.” \n\n(Bukhari and Muslim.)"}},{"id":71,"idInBook":71,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: إِنَّ أُنَاسًا مِنَ الْأَنْصَارِ سَأَلُوا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَعْطَاهُمْ ثُمَّ سَأَلُوهُ فَأَعْطَاهُمْ حَتَّى نَفِدَ مَا عِنْدَهُ. فَقَالَ: «مَا يَكُونُ عِنْدِي مِنْ خَيْرٍ فَلَنْ أَدَّخِرَهُ عَنْكُمْ وَمَنْ يَسْتَعِفَّ يُعِفَّهُ اللَّهُ وَمَنْ يَسْتَغْنِ يُغْنِهِ اللَّهُ وَمَنْ يَتَصَبَّرْ يُصَبِّرْهُ اللَّهُ وَمَا أُعْطِيَ أَحَدٌ عَطَاءً هُوَ خَيْرٌ وَأَوْسَعُ مِنَ الصَّبْرِ»","english":{"narrator":"","text":"Abu Sa'id al-Khudri said some of the Ansar begged from God’s messenger and he gave them something. They later begged from him again and he gave them something so that what he had was exhausted. He then said, \n“What I have I shall never store away from you, but God will strengthen the abstinence of him who abstains, will give a competence to him who is satisfied, and will strengthen the endurance of him who shows endurance. No one has been given a better or more ample gift than endurance.” \n\n(Bukhari and Muslim.)"}},{"id":72,"idInBook":72,"chapterId":6,"bookId":14,"arabic":"وَعَنْ عُمَرَ بْنِ الْخَطَّابِ قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُعْطِينِي الْعَطَاءَ فَأَقُولُ: أَعْطِهِ أَفْقَرَ إِلَيْهِ مِنِّي. فَقَالَ: «خُذْهُ فَتَمَوَّلْهُ وَتَصَدَّقْ بِهِ فَمَا جَاءَكَ مِنْ هَذَا الْمَالِ وَأَنْتَ غَيْرُ مُشْرِفٍ وَلَا سَائِلٍ فَخذه. ومالا فَلَا تتبعه نَفسك»","english":{"narrator":"‘Umar b. al-Khattab said:","text":"The Prophet was giving me something and I asked him to give it to someone who had more need of it than I had, but he said, \n“Take it, keep it with your property and give it as sadaqa. Take what comes to you from this property when you are neither avaricious nor begging, but in other circumstances do not let your desire go after it.” \n\n(Bukhari and Muslim.)"}},{"id":73,"idInBook":73,"chapterId":6,"bookId":14,"arabic":"عَنْ سَمُرَةَ بْنِ جُنْدُبٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْمَسَائِلُ كُدُوحٌ يَكْدَحُ بِهَا الرَّجُلُ وَجْهَهُ فَمَنْ شَاءَ أَبْقَى عَلَى وَجْهِهِ وَمَنْ شَاءَ تَرَكَهُ إِلَّا أَنْ يَسْأَلَ الرَّجُلُ ذَا سُلْطَانٍ أَوْ فِي أَمْرٍ لَا يَجِدُ مِنْهُ بُدًّا» . رَوَاهُ أَبُو دَاوُدَ وَالتِّرْمِذِيّ وَالنَّسَائِيّ","english":{"narrator":"","text":"Samura b. Jundub reported God's messenger as saying, \n“Acts of begging are lacerations with which a man disfigures his face, so he who wishes may preserve his self-respect and he who wishes may do otherwise; but this does not apply to one who asks from a ruler, or in a situation which makes it necessary.” \n\nAbu Dawud, Tirmidhi and Nasa’i transmitted it."}},{"id":74,"idInBook":74,"chapterId":6,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «من سَأَلَ النَّاسَ وَلَهُ مَا يُغْنِيهِ جَاءَ يَوْمَ الْقِيَامَةِ وَمَسْأَلَتُهُ فِي وَجْهِهِ خُمُوشٌ أَوْ خُدُوشٌ أَوْ كُدُوحٌ» . قِيلَ يَا رَسُولَ اللَّهِ وَمَا يُغْنِيهِ؟ قَالَ: «خَمْسُونَ دِرْهَمًا أَوْ قِيمَتُهَا مِنَ الذَّهَبِ» . رَوَاهُ أَبُو دَاوُدَ وَالتِّرْمِذِيُّ وَالنَّسَائِيُّ وَابْنُ مَاجَهْ والدارمي","english":{"narrator":"","text":"‘Abdallah b. Mas'ud reported God’s messenger as saying, \n“He who begs from people when he has a sufficiency will come on the day of resurrection with his begging showing itself as scrapes, scratching or lacerations on his face.” \nOn being asked what constituted a sufficiency, God’s messenger replied that it was fifty dirhams or their value in gold. \n\nAbu Dawud, Tirmidhi, Nasa’i, Ibn Majah and Darimi transmitted it."}},{"id":75,"idInBook":75,"chapterId":6,"bookId":14,"arabic":"وَعَنْ سَهْلِ بْنِ الْحَنْظَلِيَّةِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ سَأَلَ وَعِنْدَهُ مَا يُغْنِيهِ فَإِنَّمَا يَسْتَكْثِرُ مِنَ النَّارِ» . قَالَ النُّفَيْلِيُّ. وَهُوَ أَحَدُ رُوَاتِهِ فِي مَوْضِعٍ آخر: وَمَا الْغنى الَّذِي لَا يَنْبَغِي مَعَهُ الْمَسْأَلَةُ؟ قَالَ: «قَدْرُ مَا يُغَدِّيهِ وَيُعَشِّيهِ» . وَقَالَ فِي مَوْضِعٍ آخَرَ: «أَنْ يَكُونَ لَهُ شِبَعُ يَوْمٍ أَوْ لَيْلَةٍ وَيَوْمٍ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Sahl b. al-Hanzaliya reported God’s messenger as saying, \n“He who begs when he has a sufficiency is simply asking for a great amount of hell.”\nAn-Nufaili, who was one of its transmitters, said in another place that he was asked what was a sufficiency which made begging unfitting and replied that it was what would provide a morning and an evening meal. In another place he said it was when one had enough for a day, or for a night and a day. \n\nAbu Dawud transmitted it."}},{"id":76,"idInBook":76,"chapterId":6,"bookId":14,"arabic":"وَعَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ رَجُلٍ مِنْ بَنِي أَسَدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ سَأَلَ مِنْكُمْ وَلَهُ أُوقِيَّةٌ أَوْ عَدْلُهَا فَقَدْ سَأَلَ إِلْحَافًا» . رَوَاهُ مَالك وَأَبُو دَاوُد وَالنَّسَائِيّ","english":{"narrator":"","text":"‘Ata’ b. Yasar, on the authority of a man of the B. Asad, reported God’s messenger as saying, \n“If any of you begs when he has an Uqiya*  or its equivalent, he has begged immoderately.” \n\nMalik, Abu DawQd and Nasa’i transmitted it.\n\n* The Uqiya (ounce) of the Arabs was forty dirhams."}},{"id":77,"idInBook":77,"chapterId":6,"bookId":14,"arabic":"وَعَنْ حُبْشِيِّ بْنِ جُنَادَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" إِنَّ الْمَسْأَلَةَ لَا تَحِلُّ لِغَنِيٍّ وَلَا لِذِي مِرَّةٍ سَوِيٍّ إِلَّا لِذِي فَقْرٍ مُدْقِعٍ أَوْ غُرْمٍ مُفْظِعٍ وَمَنْ سَأَلَ النَّاسَ لِيُثْرِيَ بِهِ مَالَهُ: كَانَ خُمُوشًا فِي وَجْهِهِ يَوْمَ الْقِيَامَةِ وَرَضْفًا يَأْكُلُهُ مِنْ جَهَنَّمَ فَمَنْ شَاءَ فَلْيَقُلْ وَمَنْ شَاءَ فليكثر \". رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Hubshi b. Janada reported God’s messenger as saying, \n“Begging is not allowable to a rich man, or to one who has strength and is sound in limb, but only to one who is in grinding poverty or is seriously in debt. If anyone begs to increase thereby his property, it will appear as lacerations on his face on the day of resurrection and as heated stones which he will eat from jahannam. So let him who wishes ask little, and let him who wishes ask much.”\n\nTirmidhi transmitted it."}},{"id":78,"idInBook":78,"chapterId":6,"bookId":14,"arabic":"وَعَن أنس بن مَالك: أَنَّ رَجُلًا مِنَ الْأَنْصَارِ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْأَلُهُ فَقَالَ: «أَمَا فِي بَيْتك شَيْء؟» قَالَ بَلَى حِلْسٌ نَلْبَسُ بَعْضَهُ وَنَبْسُطُ بَعْضَهُ وَقَعْبٌ نَشْرَبُ فِيهِ مِنَ الْمَاءِ. قَالَ: «ائْتِنِي بِهِمَا» قَالَ فَأَتَاهُ بِهِمَا فَأَخَذَهُمَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِيَدِهِ وَقَالَ: «مَنْ يَشْتَرِي هَذَيْنِ؟» قَالَ رَجُلٌ أَنَا آخُذُهُمَا بِدِرْهَمٍ قَالَ: «مَنْ يَزِيدُ عَلَى دِرْهَمٍ؟» مَرَّتَيْنِ أَوْ ثَلَاثًا قَالَ رجل أَنا آخذهما بِدِرْهَمَيْنِ فَأَعْطَاهُمَا إِيَّاه وَأخذ الدِّرْهَمَيْنِ فَأَعْطَاهُمَا الْأَنْصَارِيُّ وَقَالَ: «اشْتَرِ بِأَحَدِهِمَا طَعَامًا فانبذه إِلَى أهلك واشتر بِالْآخرِ قدومًا فأتني بِهِ» . فَأَتَاهُ بِهِ فَشَدَّ فِيهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عُودًا بِيَدِهِ ثُمَّ قَالَ لَهُ اذْهَبْ فَاحْتَطِبْ وَبِعْ وَلَا أَرَيَنَّكَ خَمْسَةَ عَشَرَ يَوْمًا \". فَذهب الرجل يحتطب وَيبِيع فجَاء وَقَدْ أَصَابَ عَشَرَةَ دَرَاهِمَ فَاشْتَرَى بِبَعْضِهَا ثَوْبًا وَبِبَعْضِهَا طَعَامًا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «هَذَا خَيْرٌ لَكَ مِنْ أَنْ تَجِيءَ الْمَسْأَلَةُ نُكْتَةً فِي وَجْهِكَ يَوْمَ الْقِيَامَةِ إِنَّ الْمَسْأَلَةَ لَا تَصْلُحُ إِلَّا لِثَلَاثَةٍ لِذِي فَقْرٍ مُدْقِعٍ أَوْ لِذِي غُرْمٍ مُفْظِعٍ أَوْ لِذِي دَمٍ مُوجِعٍ» . رَوَاهُ أَبُو دَاوُدَ وَرَوَى ابْن مَاجَه إِلَى قَوْله: «يَوْم الْقِيَامَة»","english":{"narrator":"Anas said that when a man of the Ansar came to the Prophet and begged from him, he asked him whether he had nothing in his house.\nWhen he said he had a cloth part of which he wore and part of which he spread on the ground and a wooden bowl from which he drank water, God's messenger told him to bring them to him, and when he did so he took them in his hand and asked, “Who will buy these?” When a man offered a dirham he asked twice or thrice, “Who will offer more than a dirham?” and he gave them to a man who offered two dirhams. \nHe then took the two dirhams and giving them to the Ansari he said, “Buy food with one of them and hand it to your family, and buy an axe with the other and bring it to me.” When he brought it God’s messenger fixed a handle on it with his own hand and said, “Go, gather firewood and sell it, and don’t let me see you for a fortnight.” \nThe man went away and gathered firewood and sold it. When he had earned ten dirhams he came to him and bought a garment with some of them and food with others. \nThen God’s messenger said, \n“This is better for you than that begging should come as a spot on your face on the day of resurrection. Begging is right for only three people:","text":"one who is in grinding poverty, one who is seriously in debt, or one who is responsible for blood-wit he finds it difficult to pay.” \n\nAbu Dawud transmitted it, and Ibn Majah transmitted up to “the day of resurrection.”"}},{"id":79,"idInBook":79,"chapterId":6,"bookId":14,"arabic":"وَعَنِ ابْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَصَابَتْهُ فَاقَةٌ فَأَنْزَلَهَا بِالنَّاسِ لَمْ تُسَدَّ فَاقَتُهُ. وَمَنْ أَنْزَلَهَا بِاللَّه أوشك الله لَهُ بالغنى إِمَّا بِمَوْتٍ عَاجِلٍ أَوْ غِنًى آجِلٍ» . رَوَاهُ أَبُو دَاوُد وَالتِّرْمِذِيّ","english":{"narrator":"","text":"Ibn Mas'ud reported God’s messenger as saying, \n“If one who is afflicted by poverty refers it to men, his poverty will not be brought to an end; but if one refers it to God, He will soon give him sufficiency, either by a speedy death or by a sufficiency which comes later.”\n\nAbu Dawud and Tirmidhi transmitted it."}},{"id":80,"idInBook":80,"chapterId":6,"bookId":14,"arabic":"عَنِ ابْنِ الْفِرَاسِيِّ أَنَّ الْفِرَاسِيَّ قَالَ: قُلْتُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَسْأَلُ يَا رَسُولَ اللَّهِ؟ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا وَإِن كنت لابد فسل الصَّالِحين» . رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ","english":{"narrator":"","text":"Ibn al-Firasi said that al-Firasi asked God's messenger whether he might beg, and the Prophet replied, \n“No; but if there is no escape from it, beg from the upright.” \n\nAbu Dawud and Nasa’i transmitted it."}},{"id":81,"idInBook":81,"chapterId":6,"bookId":14,"arabic":"وَعَن ابْن السَّاعِدِيّ الْمَالِكِي أَنه قَالَ: استعملني عمر بن الْخطاب رَضِي الله عَنْهُم عَلَى الصَّدَقَةِ فَلَمَّا فَرَغْتُ مِنْهَا وَأَدَّيْتُهَا إِلَيْهِ أَمَرَ لِي بِعُمَالَةٍ فَقُلْتُ إِنَّمَا عَمِلْتُ لِلَّهِ وَأجْرِي على الله فَقَالَ خُذْ مَا أُعْطِيتَ فَإِنِّي قَدْ عَمِلْتُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَعَمَّلَنِي فَقُلْتُ مِثْلَ قَوْلِكَ فَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا أُعْطِيتَ شَيْئا من غير أَن تسْأَل فَكل وَتصدق» . رَوَاهُ مُسلم وَأَبُو دَاوُد","english":{"narrator":"Ibn as-Sa‘idi said:","text":"‘Umar employed me to collect the sadaqa, and when I finished doing so and gave it to him he ordered payment to be given me, but I said, “I did it only for God’s sake, and my reward will come from God.” He replied, \n“Take what you are given, for I acted as a collector in the time of God’s messenger, and when he assigned me a payment I said the same kind of thing as you have said, to which he replied that when I was given something without asking for it I should use it for my own purposes and as sadaqa.” \n\nAbu Dawud transmitted it."}},{"id":82,"idInBook":82,"chapterId":6,"bookId":14,"arabic":"وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ أَنَّهُ سَمِعَ يَوْمَ عَرَفَةَ رَجُلًا يَسْأَلُ النَّاسَ فَقَالَ: أَفِي هَذَا الْيَوْمِ: وَفِي هَذَا الْمَكَانِ تسْأَل من يغر الله؟ فخفقه بِالدرةِ. رَوَاهُ رزين","english":{"narrator":"","text":"'Ali told how, when he heard a man begging from the people on the day of ‘Arafa, he said, \n\"On this day and in this place do you beg from anyone but God?” He then struck him with a whip. \n\nRazin transmitted it."}},{"id":83,"idInBook":83,"chapterId":6,"bookId":14,"arabic":"وَعَن عمر رَضِي الله عَنهُ قَالَ: تَعْلَمُنَّ أَيُّهَا النَّاسُ أَنَّ الطَّمَعَ فَقْرٌ وَأَنَّ الْإِيَاسَ غِنًى وَأَنَّ الْمَرْءَ إِذَا يَئِسَ عَن شَيْء اسْتغنى عَنهُ. رَوَاهُ رزين","english":{"narrator":"","text":"'Umar said, \n\"You people must know that covetousness is poverty, despair is wealth, and that when a man despairs of anything he can dispense with it.”. \n\nRazin transmitted it."}},{"id":84,"idInBook":84,"chapterId":6,"bookId":14,"arabic":"وَعَنْ ثَوْبَانَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ يَكْفُلُ لِي أَنْ لَا يَسْأَلَ النَّاسَ شَيْئًا فَأَتَكَفَّلَ لَهُ بِالْجَنَّةِ؟» فَقَالَ ثَوْبَانُ: أَنَا فَكَانَ لَا يَسْأَلُ أَحَدًا شَيْئا. رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ","english":{"narrator":"","text":"Thauban reported God’s messenger as saying, \n\"If anyone guarantees me that he will not beg from people, I will guarantee him paradise.” \nThauban said that he would, and he never asked anyone for anything. \n\nAbu Dawud and Nasa'i transmitted it."}},{"id":85,"idInBook":85,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي ذَرٍّ قَالَ: دَعَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَشْتَرِطُ عَلَيَّ: «أَنْ لَا تَسْأَلَ النَّاسَ شَيْئًا» قُلْتُ: نَعَمْ. قَالَ: «وَلَا سَوْطَكَ إِنْ سَقَطَ مِنْكَ حَتَّى تنزل إِلَيْهِ فتأخذه» . رَوَاهُ أَحْمَدُ","english":{"narrator":"","text":"Abu Dharr said that God's messenger called him and laid a condition on him that he should not ask people for anything. When he agreed he said, \n\"Not even for your whip when you drop it. You must dismount and get it yourself.”\n\nAhmad transmitted it."}},{"id":86,"idInBook":86,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَوْ كَانَ لِي مِثْلُ أُحُدٍ ذَهَبًا لَسَرَّنِي أَنْ لَا يَمُرَّ عَلَيَّ ثَلَاثُ لَيَالٍ وَعِنْدِي مِنْهُ شَيْءٌ إِلَّا شَيْءٌ أَرْصُدُهُ لِدَيْنٍ» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, \n\"If I had gold to the extent of Uhud I would not like to keep any of it more than three days, except what I put aside to pay a debt.” \n\nBukhari transmitted it."}},{"id":87,"idInBook":87,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" مَا مِنْ يَوْمٍ يُصْبِحُ الْعِبَادُ فِيهِ إِلَّا مَلَكَانِ يَنْزِلَانِ فَيَقُولُ أَحَدُهُمَا: اللَّهُمَّ أطع مُنْفِقًا خَلَفًا وَيَقُولُ الْآخَرُ: اللَّهُمَّ أَعْطِ مُمْسِكًا تلفا \"","english":{"narrator":"","text":"He reported him as saying that two angels come down every morning and one says, \"O God, give him who spends something in place of it;” the other says, “O God, give him who withholds destruction.” \n\n(Bukhari and Muslim.)"}},{"id":88,"idInBook":88,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَسْمَاءَ قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَنَفِقِي وَلَا تُحْصِي فَيُحْصِيَ اللَّهُ عَلَيْكِ وَلَا تُوعِي فَيُوعِيَ اللَّهُ عَلَيْكِ ارْضَخِي مَا اسْتَطَعْتِ»","english":{"narrator":"","text":"Asma’ reported God’s messenger as saying,\n\"Spend, do not calculate and so have God calculating against you, do not hoard and so have God hoarding from you, but give such small amounts as you can.” \n\n(Bukhari and Muslim.)"}},{"id":89,"idInBook":89,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" قَالَ اللَّهُ تَعَالَى: أَنْفِقْ يَا ابْن آدم أنْفق عَلَيْك \"","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as stating that God most high had said, \n\"If you spend, son of Adam, I shall spend on you.” \n\n(Bukhari and Muslim.)"}},{"id":90,"idInBook":90,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي أُمَامَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَا ابْنَ آدَمَ إِنْ تَبْذُلِ الْفَضْلَ خَيْرٌ لَكَ وَإِنْ تُمْسِكْهُ شَرٌّ لَكَ وَلَا تُلَامُ عَلَى كَفَافٍ وَابْدَأْ بِمن تعول» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Umama reported God’s messenger as saying, \n\"Son of Adam, to give away what you have extra is better for you and to withhold it is worse for you, but you are not blamed for having a sufficiency. Give first to those who are dependent on you.” \n\nMuslim transmitted it."}},{"id":91,"idInBook":91,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَثَلُ الْبَخِيلِ وَالْمُتَصَدِّقِ كَمَثَلِ رَجُلَيْنِ عَلَيْهِمَا جُنَّتَانِ مِنْ حَدِيدٍ قَدِ اضْطُرَّتْ أَيْدِيهِمَا إِلَى ثُدُيِّهِمَا وَتَرَاقِيهِمَا فَجَعَلَ الْمُتَصَدِّقُ كُلَّمَا تَصَدَّقَ بِصَدقَة انبسطت عَنهُ الْبَخِيلُ كُلَّمَا هَمَّ بِصَدَقَةٍ قَلَصَتْ وَأَخَذَتْ كُلُّ حَلقَة بمكانها»","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, \n\"The niggardly man and the one who gives alms are like two men wearing coats of iron with their hands pressed closely to their breasts and their collar-bones. As often as the one who gives alms does so it becomes expanded for him, but as often as the niggardly man thinks about giving alms it contracts and every ring keeps to its place.” \n\n(Bukhari and Muslim.)"}},{"id":92,"idInBook":92,"chapterId":6,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" اتَّقُوا الظُّلْمَ فَإِنَّ الظُّلْمَ ظُلُمَاتٌ يَوْمَ الْقِيَامَةِ وَاتَّقُوا الشُّحَّ فَإِنَّ الشُّحَّ أَهْلَكَ مَنْ كَانَ قَبْلَكُمْ: حَمَلَهُمْ عَلَى أَنْ سَفَكُوا دِمَاءَهُمْ وَاسْتَحَلُّوا مَحَارِمهمْ \". رَوَاهُ مُسلم","english":{"narrator":"","text":"Jabir reported God’s messenger as saying, \n\"Beware of oppression, for oppression (zulm) will produce excessive darkness (zulumat) on the day of resurrection; and beware of niggardliness, for niggardliness destroyed your predecessor, inducing them to shed one another's blood and to treat things forbidden them as lawful.\" \n\nMuslim transmitted it."}},{"id":93,"idInBook":93,"chapterId":6,"bookId":14,"arabic":"وَعَنْ حَارِثَةَ بْنِ وَهْبٌ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" تصدقوا فَإِنَّهُ يَأْتِي عَلَيْكُمْ زَمَانٌ يَمْشِي الرَّجُلُ بِصَدَقَتِهِ فَلَا يَجِدُ مَنْ يَقْبَلُهَا يَقُولُ الرَّجُلُ: لَوْ جِئْت بهَا بِالْأَمْسِ لَقَبِلْتُهَا فَأَمَّا الْيَوْمَ فَلَا حَاجَةَ لِي بهَا \"","english":{"narrator":"","text":"Haritha b. Wahb told that God's messenger exhorted the people to give sadaqa, for the time was coming when a man would go with his sadaqa and find no one to accept it. A man would say, “If you had brought it yesterday I would have accepted it, but I have no need of it today.\" \n\n(Bukhari and Muslim.)"}},{"id":94,"idInBook":94,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَجُلٌ: يَا رَسُولَ اللَّهِ أَيُّ الصَّدَقَةِ أَعْظَمُ أَجْرًا؟ قَالَ: \n\" أَنْ تَصَدَّقَ وَأَنْتَ صَحِيحٌ شَحِيحٌ تَخْشَى الْفَقْرَ وَتَأْمُلُ الْغِنَى وَلَا تُمْهِلَ حَتَّى إِذَا بَلَغَتِ الْحُلْقُومَ قُلْتَ: لِفُلَانٍ كَذَا وَلِفُلَانٍ كَذَا وَقَدْ كَانَ لِفُلَانٍ \"","english":{"narrator":"","text":"Abu Huraira told that when a man asked God’s messenger which sadaqa produced the greatest reward he replied, \n“That which you give when you are healthy and inclined to be mean, fearing poverty and hoping for a competence. Do not put it off and then say when you are about to die that you give such and such to so and so and such and such to so and so when it has already become the property of so and so.”*\n\n(Bukhari and Muslim.)\n\n* i.e. by inheritance."}},{"id":95,"idInBook":95,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي ذَرٍّ قَالَ: انْتَهَيْتُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ جَالِسٌ فِي ظِلِّ الْكَعْبَةِ فَلَمَّا رَآنِي قَالَ: «هُمُ الْأَخْسَرُونَ وَرَبِّ الْكَعْبَةِ» فَقُلْتُ: فَدَاكَ أَبِي وَأُمِّي مَنْ هُمْ؟ قَالَ: \n\" هُمُ الْأَكْثَرُونَ أَمْوَالًا إِلَّا مَنْ قَالَ: هَكَذَا وَهَكَذَا وَهَكَذَا مِنْ بَين يَدَيْهِ وَمن خَلفه وعني مينه وَعَن شِمَاله وَقَلِيل مَا هم \"","english":{"narrator":"Abu Dharr said:","text":"I came to the Prophet when he was sitting in the shade of the Ka'ba, and when he saw me he said, \n“By the Lord of the Ka'ba, they are the ones who suffer the greatest loss.\" \nI asked, “Who are they, you for whom I would give my father and my mother as ransom?\" \nHe replied, “Those who have most property, except those who say, ‘Take this and this and this,’ before them, behind them, on their right and on their left; but they are few.\" \n\n(Bukhari and Muslim.)"}},{"id":96,"idInBook":96,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «السَّخِيُّ قَرِيبٌ مِنَ اللَّهِ قَرِيبٌ مِنَ الْجَنَّةِ قَرِيبٌ مِنَ النَّاسِ بَعِيدٌ مِنَ النَّارِ. وَالْبَخِيلُ بَعِيدٌ مِنَ اللَّهِ بَعِيدٌ مِنَ الْجَنَّةِ بَعِيدٌ مِنَ النَّاسِ قَرِيبٌ مِنَ النَّارِ. وَلَجَاهِلٌ سَخِيٌّ أَحَبُّ إِلَى اللَّهِ مِنْ عَابِدٍ بَخِيلٍ» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, \n“The generous man is near God, near paradise, near men and far from hell, but the miserly man is far from God, far from paradise, far from men and near hell. Indeed, an ignorant man who is generous is dearer to God than a worshipper who is miserly.\" \n\nTirmidhi transmitted it."}},{"id":97,"idInBook":97,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَأَنْ يَتَصَدَّقَ الْمَرْءُ فِي حَيَاتِهِ بِدِرْهَمٍ خَيْرٌ لَهُ مِنْ أَنْ يَتَصَدَّقَ بِمِائَةٍ عِنْدِ مَوته» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Abu Sa'id al-Khudri reported God’s messenger as saying,\n“It is better for a man to give a dirham as sadaqa during his lifetime than to give a hundred at the time of his death.” \n\nAbu Dawud transmitted it."}},{"id":98,"idInBook":98,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي الدَّرْدَاءِ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَثَلُ الَّذِي يَتَصَدَّقُ عِنْدَ مَوْتِهِ أَوْ يُعْتِقُ كَالَّذِي يُهْدِي إِذَا شَبِعَ» . رَوَاهُ أَحْمَدُ وَالنَّسَائِيُّ والدارمي وَالتِّرْمِذِيّ وَصحح","english":{"narrator":"","text":"Abud Darda’ reported God’s messenger as saying, \n“One who gives sadaqa or who frees a slave at the time of his death is like one who gives gifts when he has more than enough.” \n\nAhmad, Nasa’i, Darimi and Tirmidhi transmitted it, and Tirmidhi said it is sahih."}},{"id":99,"idInBook":99,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: \n\" خصلتان لَا تجتمعان فِي مُؤْمِنٍ: الْبُخْلُ وَسُوءُ الْخُلُقِ \". رَوَاهُ التِّرْمِذِيُّ","english":{"narrator":"Abu Sa'id reported God's messenger as saying, \n“There are two characteristics which are not combined in a believer:","text":"miserliness and a bad disposition.\" \n\nTirmidhi transmitted it."}},{"id":100,"idInBook":100,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي بَكْرٍ الصِّدِّيقِ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَدْخُلُ الْجَنَّةَ خِبٌّ وَلَا بَخِيلٌ وَلَا منان» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Abu Bakr as-Siddiq reported God’s messenger as saying, \n“A crafty one, a miser, and one who keeps reminding people of what he has given will not enter paradise.”\n\nTirmidhi transmitted it."}},{"id":101,"idInBook":101,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «شَرُّ مَا فِي الرَّجُلِ شُحٌّ هَالِعٌ وَجُبْنٌ خَالِعٌ» . رَوَاهُ أَبُو دَاوُدَ","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, \n“The worst things in a man are anxious niggardliness and unrestrained cowardice.” \n\nAbd Dawud transmitted it."}},{"id":102,"idInBook":102,"chapterId":6,"bookId":14,"arabic":"عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا أَنَّ بَعْضُ أَزْوَاجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قُلْنَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّنَا أَسْرَعُ بِكَ لُحُوقًا؟ قَالَ: \" أَطْوَلُكُنَّ يَدًا فَأَخَذُوا قَصَبَةً يَذْرَعُونَهَا فَكَانَت سَوْدَة أَطْوَلهنَّ يدا فَعلمنَا بعد أَنما كَانَت طُولُ يَدِهَا الصَّدَقَةَ وَكَانَتْ أَسْرَعَنَا لُحُوقًا بِهِ زَيْنَبُ وَكَانَتْ تُحِبُّ الصَّدَقَةَ. رَوَاهُ الْبُخَارِيُّ. وَفِي رِوَايَةِ مُسْلِمٍ قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «أَسْرَعكُنَّ لُحُوقا بَين أَطْوَلكُنَّ يَدًا» . قَالَتْ: فَكَانَتْ أَطْوَلَنَا يَدًا زَيْنَبُ؟ لِأَنَّهَا كَانَت تعْمل بِيَدِهَا وَتَتَصَدَّق","english":{"narrator":"","text":"‘A’isha said that when some of the Prophet’s wives asked him which of them would join him soonest, he replied that it would be the one with the longest arm. So they took a rod and measured, and Sauda was the one among them who had the longest arm. They later came to know that sadaqa was the meaning of the length of the arm, for Zainab was the one who joined him soonest and she was fond of giving sadaqa.* \n\nBukhari transmitted it. \n\nIn Muslim’s version she reported God’s messsenger as saying, “The one of you who will join me first is the one who has the longest arm.” She said they measured one another’s arms to see which was the longest, and the one with the longest was Zainab because she worked with her hand and gave sadaqa.\n\n* She was called Umm al-masakin (mother of the needy), a title given her in the pre-Islamic period."}},{"id":103,"idInBook":103,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" قَالَ رَجُلٌ: لَأَتَصَدَّقَنَّ بِصَدَقَةٍ فَخَرَجَ بِصَدَقَتِهِ فَوَضَعَهَا فِي يَدِ سَارِقٍ فَأَصْبَحُوا يَتَحَدَّثُونَ تصدق عَلَى سَارِقٍ فَقَالَ اللَّهُمَّ لَكَ الْحَمْدُ عَلَى سَارِقٍ لَأَتَصَدَّقَنَّ بِصَدَقَةٍ فَخَرَجَ بِصَدَقَتِهِ فَوَضَعَهَا فِي يَدي زَانِيَةٍ فَأَصْبَحُوا يَتَحَدَّثُونَ تُصُدِّقَ اللَّيْلَةَ عَلَى زَانِيَةٍ فَقَالَ اللَّهُمَّ لَكَ الْحَمْدُ عَلَى زَانِيَةٍ لَأَتَصَدَّقَنَّ بِصَدقَة فَخرج بِصَدَقَتِهِ فوضعها فِي يَدي غَنِي فَأَصْبحُوا يتحدثون تصدق عَلَى غَنِيٍّ فَقَالَ اللَّهُمَّ لَكَ الْحَمْدُ عَلَى سَارِق وعَلى زَانِيَة وعَلى غَنِي فَأُتِيَ فَقِيلَ لَهُ أَمَّا صَدَقَتُكَ عَلَى سَارِقٍ فَلَعَلَّهُ أَنْ يَسْتَعِفَّ عَنْ سَرِقَتِهِ وَأَمَّا الزَّانِيَةُ فَلَعَلَّهَا أَنْ تَسْتَعِفَّ عَنْ زِنَاهَا وَأَمَّا الْغَنِيُّ فَلَعَلَّهُ يَعْتَبِرُ فَيُنْفِقَ مِمَّا أَعْطَاهُ اللَّهُ \". مُتَّفَقٌ عَلَيْهِ وَلَفظه للْبُخَارِيّ","english":{"narrator":"","text":"Abu Huraira said that God’s messenger told of a man who expressed his intention to give sadaqa, and who when he took it out placed it in a thief’s hand. In the morning the people were talking and saying, “Sadaqa was given to a thief last night.” The man said, “O God, to Thee be the praise—to a thief!’’ \nHe then expressed his intention to give sadaqa and when he took it out he placed it in a prostitute’s hand. In the morning the people were talking and saying, “Sadaqa was given to a prostitute last night.\" The man said, \"O God, to Thee be the praise— to a prostitute!\" \nHe then expressed his intention to give sadaqa and when he took it out he placed it in a rich man’s hand. In the morning the people were talking and saying, “Sadaqa was given to a rich man last night.\" The man said, “O God, to Thee be the praise—to a thief, a prostitute and a rich man!” \nHe then had a vision in which he was told that his sadaqa to a thief might result in his refraining from his theft, the prostitute might perhaps refrain from her immorality, and the rich man might perhaps pay heed and spend from what God had given him. \n\n(Bukhari and Muslim, the wording being Bukhari’s.)"}},{"id":104,"idInBook":104,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «بَيْنَا رَجُلٌ بِفَلَاةٍ مِنَ الْأَرْضِ فَسَمِعَ صَوْتًا فِي سَحَابَةٍ اسْقِ حَدِيقَةَ فُلَانٍ فَتَنَحَّى ذَلِكَ السَّحَابُ فَأَفْرَغَ مَاءَهُ فِي حَرَّةٍ فَإِذَا شَرْجَةٌ مِنْ تِلْكَ الشِّرَاجِ قَدِ اسْتَوْعَبَتْ ذَلِكَ الْمَاءَ كُلَّهُ فَتَتَبَّعَ الْمَاءَ فَإِذَا رَجُلٌ قَائِمٌ فِي حَدِيقَتِهِ يُحَوِّلُ الْمَاءَ بِمِسْحَاتِهِ فَقَالَ لَهُ يَا عَبْدَ اللَّهِ مَا اسْمُكَ فَقَالَ لَهُ يَا عَبْدَ اللَّهِ لِمَ تَسْأَلُنِي عَنِ اسْمِي فَقَالَ إِنِّي سَمِعْتُ صَوْتًا فِي السَّحَابِ الَّذِي هَذَا مَاؤُهُ يَقُول اسْقِ حَدِيقَةَ فُلَانٍ لِاسْمِكَ فَمَا تَصْنَعُ فِيهَا قَالَ أما إِذْ قُلْتَ هَذَا فَإِنِّي أَنْظُرُ إِلَى مَا يَخْرُجُ مِنْهَا فَأَتَصَدَّقُ بِثُلُثِهِ وَآكُلُ أَنَا وَعِيَالِي ثُلُثًا وأرد فِيهَا ثلثه» . رَوَاهُ مُسلم","english":{"narrator":"","text":"He said that the Prophet told of a man in a waterless plain hearing a voice from a cloud say, “Water so and so’s garden.” \nThose clouds then moved away and emptied their water on a lava tract, and a channel collected the whole of that water. He followed the water and came upon a man standing in his garden diverting the water with his spade. He asked him his name, and when he told him, it was the very name he had heard from the cloud. The man then asked him why he had asked his name, and he replied that he had heard a voice from the clouds from which that water had come saying, “Water so and so’s garden,\" using his name. \nHe then asked him what he was doing in the garden and he replied, “Since you have said this, I am waiting for what it produces, when I shall give a third as sadaqa, use a third as food for myself and my family, and put a third back into it.” \n\nMuslim transmitted it."}},{"id":105,"idInBook":105,"chapterId":6,"bookId":14,"arabic":"وَعَن أَبِي هُرَيْرَةَ أَنَّهُ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِنَّ ثَلَاثَة فِي بَنِي إِسْرَائِيلَ أَبْرَصَ وَأَقْرَعَ وَأَعْمَى فَأَرَادَ اللَّهُ أَنْ يَبْتَلِيَهُمْ فَبَعَثَ إِلَيْهِمْ مَلَكًا فَأَتَى الْأَبْرَصَ فَقَالَ أَيُّ شَيْءٍ أَحَبُّ إِلَيْكَ قَالَ لَوْنٌ حَسَنٌ وَجِلْدٌ حَسَنٌ وَيَذْهَبُ عَنِّي الَّذِي قَدْ قَذِرَنِي النَّاسُ» قَالَ: «فَمَسَحَهُ فَذَهَبَ عَنْهُ قَذَرُهُ وَأُعْطِيَ لَوْنًا حَسَنًا وَجِلْدًا حَسَنًا قَالَ فَأَيُّ الْمَالِ أَحَبُّ إِلَيْكَ قَالَ الْإِبِلُ - أَوْ قَالَ الْبَقر شكّ إِسْحَق - إِلَّا أَنَّ الْأَبْرَصَ أَوِ الْأَقْرَعَ قَالَ أَحَدُهُمَا الْإِبِلُ وَقَالَ الْآخَرُ الْبَقَرُ قَالَ فَأُعْطِيَ نَاقَةً عُشَرَاءَ فَقَالَ بَارَكَ اللَّهُ لَكَ فِيهَا» قَالَ: «فَأتى الْأَقْرَع فَقَالَ أَي شَيْء أحب إِلَيْك قَالَ شَعَرٌ حَسَنٌ وَيَذْهَبُ عَنِّي هَذَا الَّذِي قَدْ قَذِرَنِي النَّاسُ» . قَالَ: \" فَمَسَحَهُ فَذَهَبَ عَنْهُ وَأُعْطِيَ شَعَرًا حَسَنًا قَالَ فَأَيُّ الْمَالِ أَحَبُّ إِلَيْكَ قَالَ الْبَقَرُ فَأُعْطِيَ بَقَرَةً حَامِلًا قَالَ: «بَارَكَ اللَّهُ لَكَ فِيهَا» قَالَ: «فَأَتَى الْأَعْمَى فَقَالَ أَيُّ شَيْءٍ أَحَبُّ إِلَيْكَ قَالَ أَنْ يَرُدَّ اللَّهُ إِلَيَّ بَصَرِي فَأُبْصِرَ بِهِ النَّاسَ» . قَالَ: «فَمَسَحَهُ فَرَدَّ اللَّهُ إِلَيْهِ بَصَرَهُ قَالَ فَأَيُّ الْمَالِ أَحَبُّ إِلَيْكَ قَالَ الْغَنَمُ فَأُعْطِيَ شَاة والدا فأنتج هَذَانِ وَولد هَذَا قَالَ فَكَانَ لِهَذَا وَادٍ مِنِ الْإِبِلِ وَلِهَذَا وَادٍ مِنَ الْبَقَرِ وَلِهَذَا وَادٍ مِنَ الْغَنَمِ» . قَالَ: «ثُمَّ إِنَّهُ أَتَى الْأَبْرَصَ فِي صُورَتِهِ وَهَيْئَتِهِ فَقَالَ رَجُلٌ مِسْكِينٌ قَدِ انْقَطَعَتْ بِيَ الْحِبَالُ فِي سَفَرِي فَلَا بَلَاغَ لِيَ الْيَوْمَ إِلَّا بِاللَّهِ ثُمَّ بِكَ أَسْأَلُكَ بِالَّذِي أَعْطَاكَ اللَّوْنَ الْحسن وَالْجَلد الْحسن وَالْمَال بَعِيرًا أتبلغ عَلَيْهِ فِي سَفَرِي فَقَالَ الْحُقُوق كَثِيرَة فَقَالَ لَهُ كَأَنِّي أَعْرِفُكَ أَلَمْ تَكُنْ أَبْرَصَ يَقْذَرُكَ النَّاسُ فَقِيرًا فَأَعْطَاكَ اللَّهُ مَالًا فَقَالَ إِنَّمَا وَرِثْتُ هَذَا الْمَالَ كَابِرًا عَنْ كَابِرٍ فَقَالَ إِنْ كُنْتَ كَاذِبًا فَصَيَّرَكَ اللَّهُ إِلَى مَا كُنْتَ» . قَالَ: «وَأَتَى الْأَقْرَعَ فِي صُورَتِهِ فَقَالَ لَهُ مِثْلَ مَا قَالَ لِهَذَا وَرَدَّ عَلَيْهِ مِثْلَ مَا رَدَّ عَلَى هَذَا فَقَالَ إِنْ كُنْتَ كَاذِبًا فَصَيَّرَكَ اللَّهُ إِلَى مَا كُنْتَ» . قَالَ: «وَأَتَى الْأَعْمَى فِي صُورَتِهِ وَهَيْئَتِهِ فَقَالَ رَجُلٌ مِسْكِينٌ وَابْنُ سَبِيلٍ انْقَطَعَتْ بِيَ الْحِبَالُ فِي سَفَرِي فَلَا بَلَاغَ لِيَ الْيَوْمَ إِلَّا بِاللَّهِ ثُمَّ بِكَ أَسْأَلُكَ بِالَّذِي رَدَّ عَلَيْكَ بَصَرَكَ شَاةً أَتَبَلَّغُ بِهَا فِي سَفَرِي فَقَالَ قَدْ كُنْتُ أَعْمَى فَرَدَّ اللَّهُ إِلَيَّ بَصَرِي فَخُذْ مَا شِئْتَ وَدَعْ مَا شِئْتَ فَوَاللَّهِ لَا أجهدك الْيَوْم شَيْئا أَخَذْتَهُ لِلَّهِ فَقَالَ أَمْسِكْ مَالَكَ فَإِنَّمَا ابْتُلِيتُمْ فقد رَضِي عَنْك وَسخط على صاحبيك»","english":{"narrator":"","text":"He said he had heard the Prophet say there were three men among the B. Isra’il, one leprous, one bald and one blind, whom God wished to test. He therefore sent to them an angel who came to the leper and asked him what he would like best and he replied, “A good colour, a good skin, and to be rid of what makes me loathsome to people.” Thereupon he stroked him and his loathsomeness departed and he was given a good colour and a good skin. He then asked What property he would like best and he replied that he would like camels—or perhaps he said cattle, for Ishaq* was uncertain, but either the leper or bald man said camels and the other said cattle. He was given a she-camel ten months gone with young, the angel expressing the wish that God’s blessing might accompany it. \nHe then went to the bald man and asked him what he would like best and he replied, \"Good hair, and to be rid of what makes me loathsome to people.” Thereupon he stroked him and it departed from him and he was given good hair. He then asked what property he would like best and he replied that he would like cattle, so he was given a pregnant cow, the angel expressing the wish that God’s blessing might accompany it. \nHe then went to the blind man and asked him what he would like best, and he replied, \"That God should restore my sight to me so that I may see people.” Thereupon he stroked him and God restored his sight to him. He then asked what property he would like best and he replied that he would like sheep, so he was given a pregnant ewe. \nFlocks and herds were produced for the three men, the one having a wadi with camels, the second one with cattle, and the third one with sheep. Then the angel came to the one who had been a leper in the form and appearance of a leper and said, “I am a poor man whose resources are exhausted in my journey, and my only means of arriving at my destination are dependent on God and then on you, so I ask you by Him who gave you the good colour, the good skin and the property for a camel by which I may get to the end of my journey,” but he replied, \"I have many dues to pay.” He then said, \"I seem to recognise you. Were you not a leper whom people found loathsome and a poor man to whom God gave property?” He replied, \"I became heir to this property as one great in dignity from one great in dignity.”** Then he said, \"If you are lying, may God return you to your former condition.” \nHe went to the one who had been bald in the form of a bald man and said the same as he had said to the other and received a similar reply, so he said, \"If you are lying, may God return you to your former condition.” \nHe then went to the one who had been blind in the form and appearance of a blind man and said, \"I am a poor man and a traveller whose resources are exhausted in my journey, and my only means of arriving at my destination are dependent on God and then on you, so I ask you by Him who restored your sight to you for a sheep by which I may get to the end of my journey.\" He replied, “I have been blind and God restored my sight to me, so take what you wish and leave what you wish. I swear by God that I shall not importune you today for anything you take, as I give it for God's sake.\" \nHe said, “Keep your property, for you have all simply been put to a test, and God is pleased with you and displeased with your two companions.” \n\n(Bukhari and Muslim.)\n\n* Ishaq b. 'Abdallah, one of the transmitters of the tradition.\n** Meaning that, he was the oldest of his family, their leader, and of the best stock. His inheritance had come from people of similar nature."}},{"id":106,"idInBook":106,"chapterId":6,"bookId":14,"arabic":"وَعَن أم بجيد قَالَتْ: قُلْتُ يَا رَسُولَ اللَّهِ إِنَّ الْمِسْكِينَ لِيَقِفُ عَلَى بَابِي حَتَّى أَسْتَحْيِيَ فَلَا أَجِدُ فِي بَيْتِي مَا أَدْفَعُ فِي يَدِهِ. فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «ادْفَعِي فِي يَدِهِ وَلَوْ ظِلْفًا مُحْرَقًا» . رَوَاهُ أَحْمَدُ وَأَبُو دَاوُد وَالتِّرْمِذِيّ","english":{"narrator":"","text":"Umm Bujaid said she told God’s messenger that a poor man would stand at her door till she was ashamed, for she had nothing in her house to put in his hand, and he replied, \n“Put something in his hand, even though it should be a burnt hoof.\" \n\nAhmad, Abu Dawud and Tirmidhi transmitted it, Tirmidhi saying that this is a hasan sahih tradition."}},{"id":107,"idInBook":107,"chapterId":6,"bookId":14,"arabic":"وَعَن مولى لعُثْمَان رَضِي الله عَنهُ قَالَ: أُهْدِيَ لِأُمِّ سَلَمَةَ بُضْعَةٌ مِنْ لَحْمٍ وَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُعْجِبُهُ اللَّحْمُ فَقَالَتْ لِلْخَادِمِ: ضَعِيهِ فِي الْبَيْتِ لَعَلَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْكُلُهُ فَوَضَعَتْهُ فِي كَوَّةِ الْبَيْتِ. وَجَاءَ سَائِلٌ فَقَامَ عَلَى الْبَابِ فَقَالَ: تَصَدَّقُوا بَارَكَ اللَّهُ فِيكُمْ. فَقَالُوا: بَارَكَ اللَّهُ فِيكَ. فَذَهَبَ السَّائِلُ فَدَخَلَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «يَا أَمَّ سَلَمَةَ هَلْ عِنْدَكُمْ شَيْءٌ أَطْعَمُهُ؟» . فَقَالَتْ: نَعَمْ. قَالَتْ لِلْخَادِمِ: اذْهَبِي فَأَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِذَلِكِ اللَّحْمِ. فَذَهَبَتْ فَلَمْ تَجِدْ فِي الْكَوَّةِ إِلَّا قِطْعَةَ مَرْوَةٍ فَقَالَ النَّبِي صلى الله عَلَيْهِ وَسلم: «فَإِن ذَلِك اللَّحْمَ عَادَ مَرْوَةً لِمَا لَمْ تُعْطُوهُ السَّائِلَ» . رَوَاهُ الْبَيْهَقِيّ فِي دَلَائِل النُّبُوَّة","english":{"narrator":"","text":"A client of ‘Uthman said that Umm Salama was presented with a piece of meat, and because the Prophet liked meat she told the servant to put it in the house as the Prophet might perhaps eat it. She put it in the window ledge in the house. A beggar came and stood at the door and said, “Give alms, may God bless you,\" and when they replied, “God bless you,\"* the beggar went away. \nThen the Prophet entered and asked Umm Salama whether she had anything for him to eat. She replied that she had, and told the servant to go and bring God's messenger that meat, but when she went she found only a piece of flint in the window ledge. \nThe Prophet then said, “That meat changed into flint because you did not give it to the beggar.\" \n\nBaihaqi transmitted it in Dalail an-nubuwa.\n\n* A pious remark used to indicate that there is no intention of giving anything. The most common phrase in such circumstances is Allah karim (God is generous)."}},{"id":108,"idInBook":108,"chapterId":6,"bookId":14,"arabic":"وَعَن ابْن عَبَّاس رَضِي الله عَنْهُمَا قَالَتْ: قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" أَلَا أُخْبِرُكُمْ بِشَرِّ النَّاسِ مَنْزِلًا؟ قِيلَ: نَعَمْ قَالَ: الَّذِي يُسْأَلُ بِاللَّهِ وَلَا يُعْطِي بِهِ \". رَوَاهُ أَحْمد","english":{"narrator":"","text":"Ibn ‘Abbas said that the Prophet asked some people whether they would like him to tell them who was in the worst position, and when they replied that they would, he said, \n“The one who is asked for something in God’s name and does not give it in His name.”\n\nAhmad transmitted it."}},{"id":109,"idInBook":109,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي ذَرٍّ أَنَّهُ اسْتَأْذَنَ عَلَى عُثْمَانَ فَأَذِنَ لَهُ وَبِيَدِهِ عَصَاهُ فَقَالَ عُثْمَانُ: يَا كَعْبُ إِنَّ عَبْدَ الرَّحْمَنِ تُوُفِّيَ وَتَرَكَ مَالًا فَمَا تَرَى فِيهِ؟ فَقَالَ: إِنْ كَانَ يَصِلُ فِيهِ حَقَّ اللَّهِ فَلَا بَأْسَ عَلَيْهِ. فَرَفَعَ أَبُو ذَرٍّ عَصَاهُ فَضَرَبَ كَعْبًا وَقَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَا أُحِبُّ لَوْ أَنَّ لِي هَذَا الْجَبَلَ ذَهَبًا أُنْفِقُهُ وَيُتَقَبَّلُ مِنِّي أَذَرُ خَلْفِي مِنْهُ سِتَّ أَوَاقِيَّ» . أَنْشُدُكَ بِاللَّهِ يَا عُثْمَانُ أَسَمِعْتَهُ؟ ثَلَاثَ مَرَّاتٍ. قَالَ: نعم. رَوَاهُ أَحْمد","english":{"narrator":"","text":"Abu Dharr said that he came with his stick in his hand and asked ‘Uthman for permission to enter and this was granted. ‘Uthman then told Ka‘b that ‘Abd ar-Rahman had died leaving some property and asked what he thought about it. When he replied that if he had given what was due to God on it there was no harm in it, Abu Dharr raised his stick and struck Ka'b and said he had heard God’s messenger say, \n“If I had a quantity of gold equivalent to this mountain which I could spend and have accepted from me, I would not like to leave six uqiyas behind me.” \nHe then adjured ‘Uthman three times to tell him if he had not heard him, and he replied that he had. \n\nAhmad transmitted it."}},{"id":110,"idInBook":110,"chapterId":6,"bookId":14,"arabic":"وَعَنْ عُقْبَةَ بْنِ الْحَارِثِ قَالَ: صَلَّيْتُ وَرَاءَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْمَدِينَةِ الْعَصْرَ فَسَلَّمَ ثُمَّ قَامَ مُسْرِعًا فَتَخَطَّى رِقَابَ النَّاسِ إِلَى بَعْضِ حُجَرِ نِسَائِهِ فَفَزِعَ النَّاسُ مِنْ سُرْعَتِهِ فَخَرَجَ عَلَيْهِمْ فَرَأَى أَنَّهُمْ قَدْ عَجِبُوا مِنْ سُرْعَتِهِ قَالَ: «ذَكَرْتُ شَيْئًا مِنْ تِبْرٍ عِنْدَنَا فَكَرِهْتُ أَنْ يَحْبِسَنِي فَأَمَرْتُ بِقِسْمَتِهِ» . رَوَاهُ الْبُخَارِيُّ. وَفِي رِوَايَةٍ لَهُ قَالَ: «كُنْتُ خَلَّفْتُ فِي الْبَيْتِ تِبْرًا مِنَ الصَّدَقَةِ فَكَرِهْتُ أَنْ أبيته»","english":{"narrator":"","text":"‘Uqba b. al-Harith said that on an occasion when he had prayed the afternoon prayer in Medina behind the Prophet, he got up quickly after uttering the salutation and, stepping over the people, went to one of the rooms of his wives. The people were startled at his haste, and when he came out and saw their astonishment at his quick movement he said, \n“I remembered some gold which we had and did not want to be under its thrall, so I gave orders that it should be distributed.” \n\nBukhari transmitted it. \nIn a version by him he said, “I had left some gold belonging to the sadaqa in the house, and did not wish to keep it till night.”"}},{"id":111,"idInBook":111,"chapterId":6,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: كَانَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عِنْدِي فِي مَرضه سِتَّةُ دَنَانِيرَ أَوْ سَبْعَةٌ فَأَمَرَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ أُفَرِّقَهَا فَشَغَلَنِي وَجَعُ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ سَأَلَنِي عَنْهَا: «مَا فَعَلَتِ السِّتَّةُ أَوِ السَّبْعَة؟» قلت: لَا وَالله لقد كَانَ شَغَلَنِي وَجَعُكَ فَدَعَا بِهَا ثُمَّ وَضَعَهَا فِي كَفِّهِ فَقَالَ: «مَا ظَنُّ نَبِيِّ اللَّهِ لَوْ لَقِيَ اللَّهَ عَزَّ وَجَلَّ وَهَذِهِ عِنْدَهُ؟» . رَوَاهُ أَحْمد","english":{"narrator":"","text":"‘A’isha said that during the illness of God’s messenger she had six or seven dinars belonging to him which he ordered her to distribute, but she was kept busy ministering to his suffering. He asked her what had happened to the six or seven dinars, and when she replied she had done nothing about them because she had been kept busy ministering to his suffering, he called for them, and placing them in his hand he said, \n“What would God’s prophet think if he were to meet God who is great and glorious while possessing these?” \n\nAhmad transmitted it."}},{"id":112,"idInBook":112,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَى بِلَالٍ وَعِنْدَهُ صُبْرَةٌ مِنْ تَمْرٍ فَقَالَ: «مَا هَذَا يَا بِلَالُ؟» قَالَ: شَيْءٌ ادَّخَرْتُهُ لِغَدٍ. فَقَالَ: «أَمَا تَخْشَى أَنْ تَرَى لَهُ غَدًا بخارا فِي نَار جَهَنَّمَ يَوْمَ الْقِيَامَةِ أَنْفِقْ بِلَالُ وَلَا تَخْشَ من ذِي الْعَرْش إقلالا»","english":{"narrator":"","text":"Abu Huraira said that when the Prophet once visited Bilal and saw he had a heap of dates, he asked him what it was. One his replying, “It is something I have stored up for tomorrow,” he said, “Are you not afraid that tomorrow you may see on account of it steam in the fire of jahannam on the day of resurrection? Spend it, Bilal, and do not fear poverty from the Lord of the Throne.”\n\nBaihaqi transmitted it in Shu’ab al-iman."}},{"id":113,"idInBook":113,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «السَّخَاءُ شَجَرَةٌ فِي الْجَنَّةِ فَمَنْ كَانَ سَخِيًّا أَخَذَ بِغُصْنٍ مِنْهَا فَلَمْ يَتْرُكْهُ الْغُصْنُ حَتَّى يُدْخِلَهُ الْجَنَّةَ. وَالشُّحُّ شَجَرَةٌ فِي النَّارِ فَمَنْ كَانَ شَحِيحًا أَخَذَ بِغُصْنٍ مِنْهَا فَلَمْ يَتْرُكْهُ الْغُصْنُ حَتَّى يُدْخِلَهُ النَّارَ» . رَوَاهُمَا الْبَيْهَقِيُّ فِي شعب الْإِيمَان","english":{"narrator":"","text":"He reported God’s messenger as saying, \n“Liberality is a tree in paradise of which he who is liberal will seize a branch, and the branch will not leave him till it brings him into paradise. And niggardliness is a tree in hell of which he who is niggardly will seize a branch, and the branch will not leave him till it brings him into hell.” \n\nBaihaqi transmitted it in Shu’ab al-iman."}},{"id":114,"idInBook":114,"chapterId":6,"bookId":14,"arabic":"وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «بَادِرُوا بِالصَّدَقَةِ فَإِنَّ الْبَلَاءَ لَا يَتَخَطَّاهَا» . رَوَاهُ رَزِينٌ","english":{"narrator":"","text":"‘Ali reported God’s messenger as saying, \n“Give the sadaqa without delay, for it stands in the way of calamity.”* \n\nRazln transmitted it.\n\n* The idea is that it acts as a barrier beyond which calamity cannot pass."}},{"id":115,"idInBook":115,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ تَصَدَّقَ بِعَدْلِ تَمْرَةٍ مِنْ كَسْبٍ طَيِّبٍ وَلَا يَقْبَلُ اللَّهُ إِلَّا الطَّيِّبَ فَإِنَّ اللَّهَ يَتَقَبَّلُهَا بِيَمِينِهِ ثُمَّ يُرَبِّيهَا لِصَاحِبِهَا كَمَا يُرَبِّي أَحَدُكُمْ فَلُوَّهُ حَتَّى تَكُونَ مِثْلَ الْجَبَل»","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, \n“If anyone gives as sadaqa the equivalent of a date from something lawfully earned, for God accepts only what is lawful, God will accept it with His right hand, then foster it for the one who gave it as one of you fosters his colt, till it becomes like a mountain.” \n\n(Bukhari and Muslim.)"}},{"id":116,"idInBook":116,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا نقصت صَدَقَة من مَال شَيْئا وَمَا زَادَ اللَّهُ عَبْدًا بِعَفْوٍ إِلَّا عِزًّا وَمَا تَوَاضَعَ أَحَدٌ لِلَّهِ إِلَّا رَفَعَهُ اللَّهُ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"He reported God’s messenger as saying, \n“Sadaqa does not reduce property; God increases the honour of him who forgives another; and no one will humble himself for God’s sake without God exalting him.” \n\nMuslim transmitted it."}},{"id":117,"idInBook":117,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَنْفَقَ زَوْجَيْنِ مِنْ شَيْءٍ مِنَ الْأَشْيَاءِ فِي سَبِيلِ اللَّهِ دُعِيَ مِنْ أَبْوَاب الْجنَّة واللجنة أَبْوَابٌ فَمَنْ كَانَ مِنْ أَهْلِ الصَّلَاةِ دُعِيَ مِنْ بَابِ الصَّلَاةِ وَمَنْ كَانَ مِنْ أَهْلِ الْجِهَاد دعِي من بَاب الْجِهَاد وَمن كَانَ مَنْ أَهْلِ الصَّدَقَةِ دُعِيَ مِنْ بَابِ الصَّدَقَةِ وَمَنْ كَانَ مِنْ أَهْلِ الصِّيَامِ دُعِيَ مِنْ بَابِ الرَّيَّانِ» . فَقَالَ أَبُو بَكْرٍ: مَا عَلَى مَنْ دُعِيَ مِنْ تِلْكَ الْأَبْوَابِ مِنْ ضَرُورَةٍ فَهَلْ يُدْعَى أَحَدٌ مِنْ تِلْكَ الْأَبْوَابِ كُلِّهَا؟ قَالَ: «نعم وَأَرْجُو أَن تكون مِنْهُم»","english":{"narrator":"","text":"He reported God’s messenger as saying, \n“If anyone contributes a pair of anything in God’s path he will be invited to enter by the gates of paradise, for paradise has gates. Those who engage in prayer will be invited to enter by the gate of prayer; those who take part in jihad will be invited to enter by the gate of jihad; those who give sadaqa will be invited to enter by the gate of sadaqa; and those who fast will be invited to enter by the gate ar-Rayyan.”* Abu Bakr said, “No distress will rest on him who is invited to enter by those gates,** but will anyone be invited to enter by all those gates?” He replied, “Yes, and I hope you may be one.” \n\n(Bukhari and Muslim.)\n\n* This word means literally 'well-watered,’ or 'fresh’.\n** This is explained as meaning ‘by one of those gates,’as one who enters by any gate will get into paradise"}},{"id":118,"idInBook":118,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَصْبَحَ مِنْكُمُ الْيَوْمَ صَائِمًا؟» قَالَ أَبُو بكر: أَنا قَالَ: «فن تَبِعَ مِنْكُمُ الْيَوْمَ جِنَازَةً؟» قَالَ أَبُو بَكْرٍ: أَنَا. قَالَ: «فَمَنْ أَطْعَمَ مِنْكُمُ الْيَوْمَ مِسْكِينًا؟» قَالَ أَبُو بَكْرٍ: أَنَا. قَالَ: «فَمَنْ عَادَ مِنْكُمُ الْيَوْمَ مَرِيضًا؟» . قَالَ أَبُو بَكْرٍ: أَنَا. فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا اجْتَمَعْنَ فِي امْرِئٍ إِلَّا دَخَلَ الْجَنَّةَ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"He said that God’s messenger  asked who had observed a fast that day and Abu Bakr said he had. \nHe asked who had followed a bier that day and Abu Bakr said he had. \nHe asked who had fed a poor man that day and Abu Bakr said he had. \nHe asked who had visited an invalid that day and Abu Bakr said he had. \nGod’s messenger then said, “Anyone in whom these good deeds are combined will certainly enter paradise.\"\n\nMuslim transmitted it."}},{"id":119,"idInBook":119,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَا نِسَاءَ الْمُسْلِمَاتِ لَا تَحْقِرَنَّ جَارَةٌ لِجَارَتِهَا وَلَوْ فِرْسِنَ شَاةٍ»","english":{"narrator":"","text":"He reported God’s messenger as saying, \n“None of you Muslim women must consider even a sheep’s trotter too insignificant a gift to give to her neighbour.” \n\n(Bukhari and Muslim.)"}},{"id":120,"idInBook":120,"chapterId":6,"bookId":14,"arabic":"وَعَنْ جَابِرٍ وَحُذَيْفَةَ قَالَا: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «كُلُّ مَعْرُوف صَدَقَة»","english":{"narrator":"","text":"Jabir and Hudhaifa reported God’s messenger as saying, \n“Every act of kindness is sadaqa.” \n\n(Bukhari and Muslim.)"}},{"id":121,"idInBook":121,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي ذَرٍّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَحْقِرَنَّ مِنَ الْمَعْرُوفِ شَيْئًا وَلَوْ أَنْ تَلْقَى أَخَاكَ بِوَجْهٍ طليق» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Dharr reported God’s messenger as saying, \n“Do not consider any act of kindness insignificant, even meeting your brother with a cheerful face.”\n\nMuslim transmitted it."}},{"id":122,"idInBook":122,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي مُوسَى الْأَشْعَرِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «عَلَى كُلِّ مُسْلِمٍ صَدَقَةٌ» . قَالُوا: فَإِنْ لَمْ يَجِدْ؟ قَالَ: «فَلْيَعْمَلْ بِيَدَيْهِ فَيَنْفَعَ نَفْسَهُ وَيَتَصَدَّقَ» . قَالُوا: فَإِنْ لَمْ يَسْتَطِعْ؟ أَوْ لَمْ يَفْعَلْ؟ قَالَ: «فيعين ذَا الْحَاجَةِ الْمَلْهُوفَ» . قَالُوا: فَإِنْ لَمْ يَفْعَلْهُ؟ قَالَ: «فيأمر بِالْخَيرِ» . قَالُوا: فَإِن لمي فعل؟ قَالَ: «فَيمسك عَن الشَّرّ فَإِنَّهُ لَهُ صَدَقَة»","english":{"narrator":"","text":"Abu Musa al-Ash‘ari reported God’s messenger as saying that every Muslim must give sadaqa. \nHe was asked how this could apply to one who had nothing and replied that he should work with his hands, gaining benefit for himself thereby, and give sadaqa. \nHe was asked what would happen if he were unable to do this or did not do it, and replied that he should help one who was in need and sad. \nHe was asked what he should do if he did not do that and replied that he should enjoin what is good. \nHe was asked what he should do if he did not do that, and replied that he should refrain from evil, for that would be sadaqa for him. \n\n(Bukhari and Muslim.)"}},{"id":123,"idInBook":123,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" كُلُّ سُلَامَى مِنَ النَّاسِ عَلَيْهِ صَدَقَةٌ: كُلَّ يَوْمٍ تَطْلُعُ فِيهِ الشَّمْسُ يَعْدِلُ بَيْنَ الِاثْنَيْنِ صَدَقَةٌ وَيُعِينُ الرَّجُلَ عَلَى دَابَّتِهِ فَيَحْمِلُ عَلَيْهَا أَوْ يَرْفَعُ عَلَيْهَا مَتَاعَهُ صَدَقَةٌ والكلمة الطّيبَة صَدَقَة وكل خطْوَة تخطوها إِلَى الصَّلَاةِ صَدَقَةٌ وَيُمِيطُ الْأَذَى عَنِ الطَّرِيقِ صَدَقَة \"","english":{"narrator":"","text":"Abu Huraira reported God's messenger as saying, \n“Every bone of men’s fingers and toes must give sadaqa every day the sun rises. If one gives justice between two men it is sadaqa; if one helps a man with his beast, loading or lifting* his goods on it, it is sadaqa; a good word is sadaqa; every step one takes towards prayer is sadaqa; and if anyone removes anything injurious from the road it is sadaqa.”\n\n(Bukhari and Muslim.)\n\n* Mirqat suggests that the transmitter says 'loading or lifting', being doubtful which word was used."}},{"id":124,"idInBook":124,"chapterId":6,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «خَلَقَ كُلَّ إِنْسَانٍ مِنْ بَنِي آدَمَ عَلَى سِتِّينَ وَثَلَاثِمِائَةِ مَفْصِلٍ فَمَنْ كَبَّرَ اللَّهَ وَحَمِدَ اللَّهَ وَهَلَّلَ اللَّهَ وَسَبَّحَ اللَّهَ وَاسْتَغْفَرَ اللَّهَ وَعَزَلَ حَجَرًا عَنْ طَرِيقِ النَّاسِ أَوْ شَوْكَةً أَوْ عَظْمًا أَوْ أَمَرَ بِمَعْرُوفٍ أَوْ نَهَى عَنْ مُنْكَرٍ عَدَدَ تِلْكَ السِّتِّينَ وَالثَّلَاثِمِائَةِ فَإِنَّهُ يَمْشِي يَوْمَئِذٍ وَقَدْ زَحْزَحَ نَفْسَهُ عَنِ النَّارِ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"‘A’isha reported God’s messenger as saying, \n“Everyone of the children of Adam has been created with three hundred and sixty joints, so he who declares God’s greatness, praises God, declares that He is the only God, glorifies God, asks forgiveness of God, removes a stone, a thorn, or a bone from people’s path, enjoins what is reputable, or forbids what is objectionable to the number of those three hundred and sixty, will walk that day having removed himself from hell.” \n\nMuslim transmitted it."}},{"id":125,"idInBook":125,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي ذَرٍّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ بِكُلِّ تَسْبِيحَةٍ صَدَقَةً وَكُلُّ تَكْبِيرَةٍ صَدَقَةٌ وَكُلُّ تَحْمِيدَةٍ صَدَقَةٌ وَكُلُّ تَهْلِيلَةٍ صَدَقَةٌ وَأَمْرٌ بِالْمَعْرُوفِ صَدَقَةٌ وَنَهْيٌ عَنِ الْمُنْكَرِ صَدَقَةٌ وَفِي بُضْعِ أَحَدِكُمْ صَدَقَةٌ» قَالُوا: يَا رَسُولَ اللَّهِ أَيَأْتِي أَحَدُنَا شَهْوَتَهُ وَيَكُونُ لَهُ فِيهَا أَجْرٌ؟ قَالَ: «أَرَأَيْتُمْ لَوْ وَضَعَهَا فِي حَرَامٍ أَكَانَ عَلَيْهِ فِيهِ وِزْرٌ؟ فَكَذَلِكَ إِذَا وَضَعَهَا فِي الْحَلَالِ كَانَ لَهُ أجر» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Aba Dharr reported God’s messenger as saying, \n“In every ascription of glory to God, every declaration of His greatness, every utterance of praise to Him, every declaration that He is the only God, in enjoining what is reputable, in forbidding what is objectionable, and in a man’s sexual intercourse there is sadaqa.”\nOn being asked whether a reward would be given for satisfying one’s passion, he said, \n“Tell me; if he were to devote it to something forbidden, would it not be a sin on his part? Similarly, if he were to devote it to something lawful, he would have a reward.” \n\nMuslim transmitted it."}},{"id":126,"idInBook":126,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «نِعْمَ الصَّدَقَةُ اللِّقْحَةُ الصَّفِيُّ مِنْحَةً وَالشَّاةُ الصَّفِيُّ مِنْحَةً تَغْدُو بِإِنَاءٍ وَتَرُوحُ بِآخَرَ»","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, \n“A milch-camel with abundant milk given as a loan and a ewe with abundant milk given as a loan, which produces a vessel of milk in the morning and another in the evening, is good sadaqa.” \n\n(Bukhari and Muslim.)"}},{"id":127,"idInBook":127,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا مِنْ مُسْلِمٍ يَغْرِسُ غَرْسًا أَوْ يَزْرَعُ زَرْعًا فَيَأْكُلُ مِنْهُ إِنْسَانٌ أَوْ طَيْرٌ أَوْ بَهِيمَةٌ إِلَّا كَانَت لَهُ صَدَقَة»\nوَفِي رِوَايَةٍ لِمُسْلِمٍ عَنْ جَابِرٍ: «وَمَا سُرِقَ مِنْهُ لَهُ صَدَقَة»","english":{"narrator":"","text":"Anas reported God’s messenger as saying, \n“If any Muslim plants something or sows seed from which man, bird, or beast eats, it counts as sadaqa for him.” \n\n(Bukhari and Muslim.) \n\nIn a version by Muslim from Jabir it says that what is stolen from it counts as sadaqa for him."}},{"id":128,"idInBook":128,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «غُفِرَ لِامْرَأَةٍ مُومِسَةٍ مَرَّتْ بِكَلْبٍ عَلَى رَأْسِ رَكِيٍّ يَلْهَثُ كَادَ يَقْتُلُهُ الْعَطَشُ فَنَزَعَتْ خُفَّهَا فَأَوْثَقَتْهُ بِخِمَارِهَا فَنَزَعَتْ لَهُ مِنَ الْمَاءِ فَغُفِرَ لَهَا بِذَلِكَ» . قِيلَ: إِنَّ لَنَا فِي الْبَهَائِمِ أَجْرًا؟ قَالَ: «فِي كُلِّ ذَاتِ كبد رطبَة أجر»","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, \n“Forgiveness was granted to an unchaste woman who coming upon a dog panting and almost dead with thirst at the mouth of a well, took off her shoe, tied it with her head-covering, and drew some water for it. On that account she was forgiven.” He was asked whether people received a reward for what they did to animals, and replied, “A reward is given in connection with every living creature.”*\n\n(Bukhari and Muslim.)\n\n* Literally, everything possessed of a moist liver."}},{"id":129,"idInBook":129,"chapterId":6,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ وَأَبِي هُرَيْرَةَ قَالَا: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «عُذِّبَتِ امْرَأَةٌ فِي هِرَّةٍ أَمْسَكَتْهَا حَتَّى مَاتَتْ مِنَ الْجُوعِ فَلَمْ تَكُنْ تُطْعِمُهَا وَلَا تُرْسِلُهَا فَتَأْكُلَ مِنْ خَشَاشِ الْأَرْضِ»","english":{"narrator":"","text":"Ibn ‘Umar and Abu Huraira reported God’s messenger as saying, \n“A woman was punished on account of a cat which she kept shut up till it died of hunger. She did not feed it or let it out so that it might eat things creeping on the earth.”\n\n(Bukhari and Muslim.)"}},{"id":130,"idInBook":130,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" مَرَّ رَجُلٌ بِغُصْنِ شَجَرَةٍ عَلَى ظَهْرِ طَرِيقٍ فَقَالَ: لِأُنَحِّيَنَّ هَذَا عَنْ طَرِيقِ الْمُسلمين لَا يؤذيهم فَأدْخل الْجنَّة \"","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, \n“A man who came upon a branch of a tree overhanging a road and decided to move if from the way of Muslims to keep it from annoying them was brought into paradise.\" \n\n(Bukhari and Muslim.)"}},{"id":131,"idInBook":131,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَقَدْ رَأَيْتُ رَجُلًا يَتَقَلَّبُ فِي الْجَنَّةِ فِي شَجَرَةٍ قَطَعَهَا مِنْ ظَهْرِ الطَّرِيقِ كَانَتْ تُؤْذِي النَّاس» . رَوَاهُ مُسلم","english":{"narrator":"","text":"He reported God’s messenger as saying, \n“I have seen a man going about in paradise as a reward for cutting down a tree which was overhanging a road and annoying people.\" \n\nMuslim transmitted it."}},{"id":132,"idInBook":132,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي بَرْزَةَ قَالَ: قُلْتُ: يَا نَبِيَّ اللَّهِ عَلِّمْنِي شَيْئًا أَنْتَفِعْ بِهِ قَالَ: «اعْزِلِ الْأَذَى عَنْ طَرِيقِ الْمُسْلِمِينَ» . رَوَاهُ مُسْلِمٌ\nوَسَنَذْكُرُ حَدِيث عدي ابْن حَاتِمٍ: «اتَّقُوا النَّارَ» فِي بَابِ عَلَامَاتِ النُّبُوَّةِ","english":{"narrator":"","text":"Abu Barza said that when he asked God’s Prophet to teach him something from which he would receive benefit he told him to remove things which caused annoyance to Muslims from their path. \n\nMuslim transmitted it."}},{"id":133,"idInBook":133,"chapterId":6,"bookId":14,"arabic":"عَنْ عَبْدِ اللَّهِ بْنِ سَلَامٍ قَالَ: لَمَّا قَدِمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةَ جِئْتُ فَلَمَّا تَبَيَّنْتُ وَجْهَهُ عَرَفْتُ أَنَّ وَجْهَهُ لَيْسَ بِوَجْهِ كَذَّابٍ. فَكَانَ أَوَّلُ مَا قَالَ: «أَيُّهَا النَّاسُ أَفْشُوا السَّلَامَ وَأَطْعِمُوا الطَّعَامَ وَصِلُوا الْأَرْحَامَ وَصَلُّوا بِاللَّيْلِ وَالنَّاسُ نِيَامٌ تَدْخُلُوا الْجَنَّةَ بِسَلام» . رَوَاهُ التِّرْمِذِيّ وَابْن مَاجَه والدارمي","english":{"narrator":"‘Abdallah b. Salam said:","text":"When the Prophet came to Medina and I went and examined his face, I recognised that it was not the face of a liar. The first thing he said was, \n“If you people greet all whom you meet, provide food, care for the wellbeing of your kindred, and pray at night when people are asleep, you will enter paradise in peace.’’\n\nTirmidhi, Ibn Majah and Darimi transmitted it."}},{"id":134,"idInBook":134,"chapterId":6,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «اعْبُدُوا الرَّحْمَنَ وَأَطْعِمُوا الطَّعَامَ وَأَفْشُوا السَّلَامَ تَدْخُلُوا الْجَنَّةَ بِسَلام» . رَوَاهُ التِّرْمِذِيّ وَابْن مَاجَه","english":{"narrator":"","text":"‘Abdallah b. ‘Amr reported God’s messenger as saying, \n“If you worship the Compassionate One, provide food, and greet all Whom you meet, you will enter paradise in peace.” \n\nTirmidhi and Ibn Majah transmitted it."}},{"id":135,"idInBook":135,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ الصَّدَقَةَ لَتُطْفِئُ غَضَبَ الرَّبِّ وَتَدْفَعُ مِيتَةَ السَّوْءِ» . رَوَاهُ التِّرْمِذِيُّ","english":{"narrator":"","text":"Anas reported God’s messenger as saying, \n“Sadaqa appeases the Lord’s anger and averts an evil death.\" \n\nTirmidhi transmitted it."}},{"id":136,"idInBook":136,"chapterId":6,"bookId":14,"arabic":": قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «كُلُّ مَعْرُوفٍ صَدَقَةٌ وَإِنَّ مِنَ الْمَعْرُوفِ أَنْ تَلْقَى أَخَاكَ بِوَجْهٍ طَلْقٍ وَأَنْ تُفْرِغَ مِنْ دَلْوِكَ فِي إِنَاءِ أَخِيكَ» . رَوَاهُ أَحْمد وَالتِّرْمِذِيّ","english":{"narrator":"","text":"Jabir reported God’s messenger as saying, \n“Every act of kindness is sadaqa, and kindness includes meeting your brother with a cheerful face and pouring water from your bucket into your brother’s vessel.\" \n\nAhmad and Tirmidhi transmitted it."}},{"id":137,"idInBook":137,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي ذَرٍّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «تَبَسُّمُكَ فِي وَجْهِ أَخِيك صَدَقَة وأمرك بِالْمَعْرُوفِ صَدَقَة ن وَنَهْيُكَ عَنِ الْمُنْكَرِ صَدَقَةٌ وَإِرْشَادُكَ الرَّجُلَ فِي أَرْضِ الضَّلَالِ لَكَ صَدَقَةٌ وَنَصْرُكَ الرَّجُلَ الرَّدِيءَ الْبَصَرِ لَكَ صَدَقَةٌ وَإِمَاطَتُكَ الْحَجَرَ وَالشَّوْكَ وَالْعَظْمَ عَن الطَّرِيقِ لَكَ صَدَقَةٌ وَإِفْرَاغُكَ مِنْ دَلْوِكَ فِي دَلْوِ أَخِيكَ لَكَ صَدَقَةٌ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ غَرِيبٌ","english":{"narrator":"","text":"Abu Dharr reported God’s messenger as saying, \n“When you smile in your brother’s face, or enjoin what is reputable, or forbid what is objectionable, or direct someone who has lost his way, or help a man who has bad eyesight, or remove stones, thorns and bones from the road, or pour water from your bucket into your brother’s, it counts to you as sadaqa.” \n\nTirmidhi transmitted it, saying this is a gharib tradition."}},{"id":138,"idInBook":138,"chapterId":6,"bookId":14,"arabic":"وَعَنْ سَعْدِ بْنِ عُبَادَةَ قَالَ: يَا رَسُولَ اللَّهِ إِنَّ أُمَّ سَعْدٍ مَاتَتْ فَأَيُّ الصَّدَقَةِ أَفْضَلُ؟ قَالَ: «الْمَاءُ» . فَحَفَرَ بِئْرًا وَقَالَ: هَذِهِ لأم سعد. رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ","english":{"narrator":"","text":"Sa‘d b. ‘Ubada told God’s messenger that Umm Sa'd had died and asked him what form of sadaqa was best. When he replied that water was best, he dug a well and said it was for Umm Sa'd. \n\nAbu Dawud and Nasa’i transmitted it."}},{"id":139,"idInBook":139,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَيُّمَا مُسْلِمٍ كَسَا مُسْلِمًا ثَوْبًا عَلَى عُرْيٍ كَسَاهُ اللَّهُ مِنْ خُضْرِ الْجَنَّةِ وَأَيُّمَا مُسْلِمٍ أَطْعَمَ مُسْلِمًا عَلَى جُوعٍ أَطْعَمَهُ اللَّهُ مِنْ ثِمَارِ الْجَنَّةِ. وَأَيُّمَا مُسلم سقا مُسْلِمًا عَلَى ظَمَأٍ سَقَاهُ اللَّهُ مِنَ الرَّحِيقِ الْمَخْتُوم» . رَوَاهُ أَبُو دَاوُد وَالتِّرْمِذِيّ","english":{"narrator":"","text":"Abu Sa'id reported God’s messenger as saying, \n“If any Muslim clothes a Muslim when he is naked, God will clothe him with some of the green garments of paradise; if any Muslim feeds a Muslim when he is hungry, God will feed him with some of the fruits of paradise; and if any Muslim gives a Muslim drink when he is thirsty, God will give him some of the pure wine which is sealed* to drink.”\n\nAbu Dawud and Tirmidhi transmitted it.\n\n* Cf Quran 83:25."}},{"id":140,"idInBook":140,"chapterId":6,"bookId":14,"arabic":"وَعَن فَاطِمَة بنت قبيس قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ فِي الْمَالِ لَحَقًّا سِوَى الزَّكَاةِ» ثُمَّ تَلَا: (لَيْسَ الْبَرَّ أَنْ تُوَلُّوا وُجُوهَكُمْ قبل الْمشرق وَالْمغْرب)\nالْآيَة. رَوَاهُ التِّرْمِذِيّ وَابْن مَاجَه والدارمي","english":{"narrator":"","text":"Fatima daughter of Qais reported God’s messenger as saying, \n“There is something due on property apart from zakat.”* \nHe then recited, “It is not piety that you should turn your faces to the east and west. . .”** \n\nTirmidhi, Ibn Majah and Darimi transmitted it.\n\n* This is said to include such acts as generosity to a beggar, readiness to lend money or goods to one who asks, and ordinary hospitality.\n** Quran 2:177."}},{"id":141,"idInBook":141,"chapterId":6,"bookId":14,"arabic":"وَعَنْ بُهَيْسَةَ عَنْ أَبِيهَا قَالَتْ: قَالَ: يَا رَسُول الله مَا لشَيْء الَّذِي لَا يَحِلُّ مَنْعُهُ؟ قَالَ: «الْمَاءُ» . قَالَ: يَا نَبِيَّ اللَّهِ مَا الشَّيْءُ الَّذِي لَا يَحِلُّ مَنْعُهُ؟ قَالَ: «الْمِلْحُ» . قَالَ: يَا نَبِيَّ الله مَا لاشيء الَّذِي لَا يَحِلُّ مَنْعُهُ؟ قَالَ: «أَنْ تَفْعَلَ الْخَيْر خير لَك» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Buhaisa quoted her father as saying that he asked God’s messenger what was the thing which it is unlawful to refuse and was told that it was water. \nHe repeated the question to God’s Prophet and was told that it was salt. \nWhen he asked God’s Prophet a third time he received the reply, “To do good is better for you.” \n\nAbu Dawud transmitted it."}},{"id":142,"idInBook":142,"chapterId":6,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «من أحيى أَرْضًا مَيِّتَةً فَلَهُ فِيهَا أَجْرٌ وَمَا أَكَلَتِ الْعَافِيَةُ مِنْهُ فَهُوَ لَهُ صَدَقَةٌ» . رَوَاهُ النَّسَائِيُّ والدارمي","english":{"narrator":"","text":"Jabir reported God’s messenger as saying, \n“If anyone cultivates waste land he will have a reward for it, and what any creature seeking food* eats of it will count as sadaqa to him.” \n\nNasa’i and Darimi transmitted it.\n\n* This includes man, beast and bird. The word is 'afiya."}},{"id":143,"idInBook":143,"chapterId":6,"bookId":14,"arabic":"وَعَنِ الْبَرَاءِ قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ مَنَحَ مِنْحَةَ لَبَنٍ أَو روق أَوْ هَدَى زُقَاقًا كَانَ لَهُ مِثْلَ عِتْقِ رَقَبَة» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Al-Bara’ reported God’s messenger as saying, \n“If anyone lends an animal for milking, or silver coins, or shows someone the way, it will be equivalent to his having emancipated a slave.” \n\nTirmidhi transmitted it."}},{"id":144,"idInBook":144,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي جُرَيٍّ جَابِرِ بْنِ سُلَيْمٍ قَالَ: أَتَيْتُ الْمَدِينَةَ فَرَأَيْتُ رَجُلًا يَصْدُرُ النَّاسُ عَنْ رَأْيِهِ لَا يَقُولُ شَيْئًا إِلَّا صَدَرُوا عَنْهُ قُلْتُ مَنْ هَذَا قَالُوا: هَذَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قُلْتُ: عَلَيْكَ السَّلَامُ يَا رَسُولَ اللَّهِ مَرَّتَيْنِ قَالَ: «لَا تقل عَلَيْك السَّلَام فَإِن عَلَيْكَ السَّلَامُ تَحِيَّةُ الْمَيِّتِ قُلِ السَّلَامُ عَلَيْكَ» قلت: أَنْت رَسُول الله؟ قَالَ: «أَنا رَسُول الله الَّذِي إِذا أَصَابَكَ ضُرٌّ فَدَعَوْتَهُ كَشَفَهُ عَنْكَ وَإِنْ أَصَابَكَ عَامُ سَنَةٍ فَدَعَوْتَهُ أَنْبَتَهَا لَكَ وَإِذَا كُنْتَ بِأَرْض قفراء أَوْ فَلَاةٍ فَضَلَّتْ رَاحِلَتُكَ فَدَعَوْتَهُ رَدَّهَا عَلَيْكَ» . قُلْتُ: اعْهَدْ إِلَيَّ. قَالَ: «لَا تَسُبَّنَّ أَحَدًا» قَالَ فَمَا سَبَبْتُ بَعْدَهُ حُرًّا وَلَا عَبْدًا وَلَا بَعِيرًا وَلَا شَاةً. قَالَ: «وَلَا تَحْقِرَنَّ شَيْئًا مِنَ الْمَعْرُوفِ وَأَنْ تُكَلِّمَ أَخَاكَ وَأَنْتَ مُنْبَسِطٌ إِلَيْهِ وَجْهُكَ إِنَّ ذَلِكَ مِنَ الْمَعْرُوفِ وَارْفَعْ إِزَاَرَكَ إِلَى نِصْفِ السَّاقِ فَإِنْ أَبَيْتَ فَإِلَى الْكَعْبَيْنِ وَإِيَّاكَ وَإِسْبَالَ الْإِزَارِ فَإِنَّهَا مِنَ الْمَخِيلَةِ وَإِنَّ اللَّهَ لَا يُحِبُّ الْمَخِيلَةَ وَإِنِ امْرُؤٌ شَتَمَكَ وَعَيَّرَكَ بِمَا يَعْلَمُ فِيكَ فَلَا تعيره بِمَا تعلم فِيهِ فَإِنَّمَا وَبَالُ ذَلِكَ عَلَيْهِ» . رَوَاهُ أَبُو دَاوُدَ وَرَوَى التِّرْمِذِيُّ مِنْهُ حَدِيثَ السَّلَامِ. وَفِي رِوَايَةٍ: «فَيَكُونَ لَكَ أَجْرُ ذَلِكَ وَوَبَالُهُ عَلَيْهِ»","english":{"narrator":"Abu Jurayy Jabir b. Sulaim said:","text":"I came to Medina and saw a man whose opinion was followed by the people, for he said nothing without their acting on it. I asked who he was, and when I was told that he was God’s messenger, I said twice, “Upon you be peace, messenger of God.” \nHe replied, ‘Do not say, “Upon you be peace,’ for that is the salutation to the dead, but say, ‘Peace be upon you’.” \nI asked him if he was God’s messenger, and he replied, “I am the messenger of God who, if injury befalls you and you call on Him, will remove it; if a year of famine comes upon you and you call on Him, will make things grow; if you lose your riding-beast in a barren land or desert and call upon Him, will restore it to you.” \nI asked him to give me an injunction, and he said, “Do not revile anyone.” After that I never reviled a freeman or a slave, a camel or a sheep.” He said, \n“And do not consider any act of kindness insignificant, for looking pleasantly at your brother when you speak to him is an act of kindness. Wear your lower garment halfway up to the knee, but if you dislike that, let it go down to the ankles; on no account, however, must you let it trail, for that is a kind of pride, and God does not like pride. If anyone reviles or reproaches you for something he knows about you, do not reproach him for something you know about him, for the mischief of that will lie at his door.” \n\nAbu Dawud transmitted it, and Tirmidhi transmitted the part about the salutation. \n\nA version has, “The reward of that will be yours and its mischief will be his.”"}},{"id":145,"idInBook":145,"chapterId":6,"bookId":14,"arabic":"وَعَن عَائِشَة إِنَّهُمْ ذَبَحُوا شَاةً فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا بَقِيَ مِنْهَا؟» قَالَتْ: مَا بَقِي مِنْهَا إِلَّا كتفها قَالَ: «بَقِي كلهَا غير كتفها» . رَوَاهُ التِّرْمِذِيّ وَصَححهُ","english":{"narrator":"","text":"‘A’isha said the Prophet asked how much was left of a sheep which they had killed, and when she told him that only its shoulder Remained, he replied, \n“The whole of it is left except its shoulder.”*\n\nTirmidhi transmitted it and said it is sahih.\n\n* Meaning that what one gives to others has lasting value, as such giving is fundamentally done for God’s sake; whereas what one keeps indicates selfishness and so has only transient value."}},{"id":146,"idInBook":146,"chapterId":6,"bookId":14,"arabic":"وَعَن ابْن عَبَّاس قَالَ ك سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَا مِنْ مُسْلِمٍ كَسَا مُسْلِمًا ثَوْبًا إِلَّا كَانَ فِي حفظ من الله مادام عَلَيْهِ مِنْهُ خرقَة» . رَوَاهُ أَحْمد وَالتِّرْمِذِيّ","english":{"narrator":"","text":"Ibn 'Abbas said he heard God’s messenger say, \n“Any Muslim who gives a Muslim a garment to wear will be in God’s safe keeping as long as a shred of it remains on him.” \n\nAhmad and Tirmidhi transmitted it."}},{"id":147,"idInBook":147,"chapterId":6,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ يَرْفَعُهُ قَالَ: \n\" ثَلَاثَةٌ يُحِبُّهُمُ اللَّهُ: رَجُلٌ قَامَ مِنَ اللَّيْلِ يَتْلُوا كِتَابَ اللَّهِ وَرَجُلٌ يَتَصَدَّقُ بِصَدَقَةٍ بِيَمِينِهِ يُخْفِيهَا أُرَاهُ قَالَ: مِنْ شِمَالِهِ وَرَجُلٌ كَانَ فِي سَرِيَّةٍ فَانْهَزَمَ أَصْحَابُهُ فَاسْتَقْبَلَ الْعَدُوَّ \". رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ غَيْرُ مَحْفُوظٍ أَحَدُ رُوَاتِهِ أَبُو بكر بن عَيَّاش كثير الْغَلَط","english":{"narrator":"‘Abdallah b. Mas'ud attributed the following to the Prophet, \n“There are three whom God loves:","text":"a man who gets up at night and recites God’s book; a man who gives sadaqa with his right hand and concealing it (‘Abdallah thought he added ‘from his left hand’); and a man who is on an expedition and faces the enemy when his companions are routed.” \n\nTirmidhi transmitted it, but said that this is a tradition to which regard is not paid, one of its transmitters, Abu Bakr b. 'Ayyash, being guilty of many errors."}},{"id":148,"idInBook":148,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي ذَرٍّ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «ثَلَاثَةٌ يُحِبُّهُمُ اللَّهُ وَثَلَاثَةٌ يُبْغِضُهُمُ اللَّهُ فَأَمَّا الَّذِينَ يُحِبُّهُمُ اللَّهُ فَرَجُلٌ أَتَى قَوْمًا فَسَأَلَهُمْ بِاللَّه وَلم يسألهم بِقرَابَة بَيْنَهُ وَبَيْنَهُمْ فَمَنَعُوهُ فَتَخَلَّفَ رَجُلٌ بِأَعْيَانِهِمْ فَأَعْطَاهُ سِرًّا لَا يَعْلَمُ بِعَطِيَّتِهِ إِلَّا اللَّهُ وَالَّذِي أَعْطَاهُ وَقَوْمٌ سَارُوا لَيْلَتَهُمْ حَتَّى إِذَا كَانَ النَّوْمُ أَحَبَّ إِلَيْهِمْ مِمَّا يُعْدَلُ بِهِ فَوَضَعُوا رُءُوسَهُمْ فَقَامَ يَتَمَلَّقُنِي وَيَتْلُو آيَاتِي وَرَجُلٌ كَانَ فِي سَرِيَّة فلقي الْعَدو فهزموا وَأَقْبل بِصَدْرِهِ حَتَّى يُقْتَلَ أَوْ يُفْتَحَ لَهُ وَالثَّلَاثَةُ الَّذِينَ يُبْغِضُهُمُ اللَّهُ الشَّيْخُ الزَّانِي وَالْفَقِيرُ الْمُخْتَالُ والغني الظلوم» . رَوَاهُ التِّرْمِذِيّ وَالنَّسَائِيّ","english":{"narrator":"Abu Dharr reported God's messenger as saying, \n“There are three whom God loves and three whom God hates. Those whom God loves are:","text":"a man who, when one came and begged from some people in God’s name, not because of any relationship between him and them, and was refused by them, withdrew from them and gave him something secretly, no one knowing of the gift but God and the one who gave it; \na man who travelled all night with people till sleep was more desirable to them than anything which could be compared with it, and when they laid down their heads got up and engaged in his devotions and recited verses of the Qur’an; \nand a man who was in a detachment which met the enemy and was routed, yet went straight forward till he was killed or given victory. \nThe three whom God hates are an old man who commits fornication, a poor man who is proud, and a rich man who is oppressive.” \n\nTirmidhi and Nasa’i transmitted it but Nasa'i did not mention the three whom God hates."}},{"id":149,"idInBook":149,"chapterId":6,"bookId":14,"arabic":"وَعَن أنس بن مَالك عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَمَّا خَلَقَ اللَّهُ الْأَرْضَ جَعَلَتْ تَمِيدُ فَخَلَقَ الْجِبَالَ فَقَالَ بِهَا عَلَيْهَا فَاسْتَقَرَّتْ فَعَجِبَتِ الْمَلَائِكَةُ مِنْ شِدَّةِ الْجِبَالِ فَقَالُوا يَا رَبِّ هَلْ مِنْ خَلْقِكَ شَيْءٌ أَشَدُّ مِنِ الْجِبَالِ قَالَ نعم الْحَدِيد قَالُوا يَا رَبِّ هَلْ مِنْ خَلْقِكَ شَيْءٌ أَشَدُّ مِنَ الْحَدِيدِ قَالَ نَعَمِ النَّارُ فَقَالُوا يَا رب هَل من خلقك شَيْء أَشد من النَّار قَالَ نعم المَاء قَالُوا يَا رب فَهَل مِنْ خَلْقِكَ شَيْءٌ أَشَدُّ مِنَ الْمَاءِ قَالَ نَعَمِ الرِّيحُ فَقَالُوا يَا رَبِّ هَلْ مِنْ خَلْقِكَ شَيْءٌ أَشَدُّ مِنَ الرِّيحِ قَالَ نَعَمِ ابْن آدم تصدق بِصَدقَة بِيَمِينِهِ يخفيها من شِمَالِهِ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ غَرِيبٌ\nوَذُكِرَ حَدِيثُ مُعَاذٍ: «الصَّدَقَةُ تُطْفِئُ الْخَطِيئَةَ» . فِي كتاب الْإِيمَان","english":{"narrator":"Anas reported God’s messenger as saying:","text":"When God created the earth it began to oscillate, so He created the mountains, ordered them on to it, and it became steady. The angels marvelled at the strength of the mountains and asked their Lord whether there was anything in His creation stronger than the mountains, to which He replied that iron was stronger. \nThey asked if anything in His creation was stronger than iron, and He replied that fire was. \nThey asked if anything in His creation was stronger than fire and He replied that water was. \nThey asked if anything in His creation was stronger than water and He replied that wind was. \nThey asked if anything in His creation was stronger than wind and He replied, \n“Yes, the son of Adam who gives sadaqa with his right hand concealing it from his left.” \n\nTirmidhi transmitted it, saying this is a gharib tradition."}},{"id":150,"idInBook":150,"chapterId":6,"bookId":14,"arabic":"عَنْ أَبِي ذَرٍّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا مِنْ عَبْدٍ مُسْلِمٍ يُنْفِقُ مِنْ كُلِّ مَالٍ لَهُ زَوْجَيْنِ فِي سَبِيلِ اللَّهِ إِلَّا اسْتَقْبَلَتْهُ حَجَبَةُ الْجَنَّةِ كُلُّهُمْ يَدْعُوهُ إِلَى مَا عِنْدَهُ» . قُلْتُ: وَكَيْفَ ذَلِكَ؟ قَالَ: «إِنْ كَانَتْ إِبِلًا فَبَعِيرَيْنِ وَإِنْ كَانَت بقرة فبقرتين» . رَوَاهُ النَّسَائِيّ","english":{"narrator":"","text":"Abu Dharr reported God's messenger as saying, \n“No Muslim will contribute a pair from every class of property he possesses to be devoted to God’s path without all the guards of paradise meeting him and summoning him to receive what they have.” \nAbu Dharr asked him what the nature of that would be, and he replied, “If they are camels there will be two, and if they are cows there will be two.” \n\nNasa’i transmitted it."}},{"id":151,"idInBook":151,"chapterId":6,"bookId":14,"arabic":"وَعَنْ مَرْثَدِ بْنِ عَبْدِ اللَّهِ قَالَ: حَدَّثَنِي بَعْضِ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِنَّ ظِلَّ الْمُؤْمِنِ يَوْمَ الْقِيَامَة صدقته» . رَوَاهُ أَحْمد","english":{"narrator":"","text":"Marthad b. ‘Abdallah said one of the companions of God’s messenger told him that he had heard him say, \n“The believer's shade on the day of resurrection will be his sadaqa.” \n\nAhmad transmitted it."}},{"id":152,"idInBook":152,"chapterId":6,"bookId":14,"arabic":"وَعَنِ ابْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ وَسَّعَ عَلَى عِيَالِهِ فِي النَّفَقَةِ يَوْمَ عَاشُورَاءَ وَسَّعَ اللَّهُ عَلَيْهِ سَائِرَ سَنَتِهِ» . قَالَ سُفْيَانُ: إِنَّا قَدْ جربناه فوجدناه كَذَلِك. رَوَاهُ رزين\nوَرَوَى الْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَانِ عَنْهُ وَعَنْ أبي هُرَيْرَة وَأبي سعيد وَجَابِر وَضَعفه","english":{"narrator":"","text":"Ibn Mas'ud reported God’s messenger as saying, \n“If anyone gives liberally to his family on the day of ‘Ashura, God will be liberal to him the rest of the year.” \nSufyan said he had tested it and found it to be so.\n\nRazin transmitted it, and Baihaqi in Shu’ab al-iman transmitted it from , Abu Huraira, Abu Sa'id andjabir, but declared it to be weak."}},{"id":153,"idInBook":153,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي أُمَامَةَ قَالَ: قَالَ أَبُو ذَرٍّ: يَا نَبِيَّ اللَّهِ أَرَأَيْتَ الصَّدَقَةُ مَاذَا هِيَ؟ قَالَ: «أَضْعَافٌ مُضَاعَفَةٌ وَعِنْدَ اللَّهِ الْمَزِيدُ» . رَوَاهُ أَحْمد","english":{"narrator":"","text":"Abu Umama told of Abu Dharr asking God’s Prophet to tell him what the reward for sadaqa would be, and receiving the reply, \n“Many times as much, and more still with God.” \n\nAhmad transmitted it."}},{"id":154,"idInBook":154,"chapterId":6,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ وَحَكِيمِ بْنِ حِزَامٍ قَالَا: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «خَيْرُ الصَّدَقَةِ مَا كَانَ عَنْ ظَهْرِ غِنًى وأبدأ بِمن تعول» . رَوَاهُ البُخَارِيّ وَمُسلم عَن حَكِيم وَحده","english":{"narrator":"","text":"Abu Huraira and Hakim b. Hizam reported God’s messenger as saying, \n“The best sadaqa is that which leaves a competence; and begin with those for whom you are responsible.” \n\nBukhari transmitted it, but Muslim transmitted it from Hakim alone."}},{"id":155,"idInBook":155,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «إِذا أَنْفَقَ الْمُسْلِمُ نَفَقَةً عَلَى أَهْلِهِ وَهُوَ يَحْتَسِبُهَا كَانَت لَهُ صَدَقَة»","english":{"narrator":"","text":"Abu Mas'ud reported God’s messenger as saying, \n“When someone spends on his family seeking his reward for it from God, it counts to him as sadaqa.”\n\n(Bukhari and Muslim.)"}},{"id":156,"idInBook":156,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «دِينَار أنفقته فِي سَبِيل الله ودينار أنفقته فِي رَقَبَةٍ وَدِينَارٌ تَصَدَّقْتَ بِهِ عَلَى مِسْكِينٍ وَدِينَارٌ أَنْفَقْتَهُ عَلَى أَهْلِكَ أَعْظَمُهَا أَجْرًا الَّذِي أنفقته على أهلك» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, \n“Of a dinar you spend as a contribution in God’s path, or to set free a slave, or as sadaqa given to a poor man, or in support of your family, the one spent in support of your family produces the greatest reward.” \n\nMuslim transmitted it."}},{"id":157,"idInBook":157,"chapterId":6,"bookId":14,"arabic":"وَعَنْ ثَوْبَانَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَفْضَلُ دِينَارٍ يُنْفِقُهُ الرَّجُلُ دِينَارٌ يُنْفِقُهُ عَلَى عِيَالِهِ وَدِينَارٌ يُنْفِقُهُ عَلَى دَابَّتِهِ فِي سَبِيلِ اللَّهِ وَدِينَارٌ يُنْفِقُهُ عَلَى أَصْحَابه فِي سَبِيل الله» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Thauban reported God’s messenger as saying, \n“The most excellent dinar a man spends is one he spends on his family, one which he spends on his animal in God’s path, and one he spends on his companions in God’s path.” \n\nMuslim transmitted it."}},{"id":158,"idInBook":158,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أُمِّ سَلَمَةَ قَالَتْ: قُلْتُ: يَا رَسُولَ اللَّهِ أَلِيَ أَجْرٌ أَنْ أَنْفِقَ عَلَى بَنِي أَبِي سَلَمَةَ؟ إِنَّمَا هُمْ بَنِيَّ فَقَالَ: «أَنَفِقِي عَلَيْهِمْ فَلَكِ أَجْرُ مَا أَنْفَقْتِ عَلَيْهِم»","english":{"narrator":"","text":"Umm Salama said she asked God’s messenger whether she would have a reward for what she spent on Abu Salama’s sons, for they were only her sons, and he replied, \n“Spend on them and you will have the reward for what you spend on them.” \n\n(Bukhari and Muslim.)"}},{"id":159,"idInBook":159,"chapterId":6,"bookId":14,"arabic":"وَعَنْ زَيْنَبَ امْرَأَةِ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «تَصَدَّقْنَ يَا مَعْشَرَ النِّسَاءِ وَلَوْ مِنْ حُلِيِّكُنَّ» قَالَتْ فَرَجَعْتُ إِلَى عَبْدِ اللَّهِ فَقُلْتُ إِنَّكَ رَجُلٌ خَفِيفُ ذَاتِ الْيَدِ وَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ أَمَرَنَا بِالصَّدَقَةِ فَأْتِهِ فَاسْأَلْهُ فَإِنْ كَانَ ذَلِك يَجْزِي عني وَإِلَّا صرفتها إِلَى غَيْركُمْ قَالَت فَقَالَ لِي عَبْدُ اللَّهِ بَلِ ائْتِيهِ أَنْتِ قَالَتْ فَانْطَلَقْتُ فَإِذَا امْرَأَةٌ مِنَ الْأَنْصَارِ بِبَابِ رَسُولِ الله صلى الله عَلَيْهِ وَسلم حَاجَتي حَاجَتهَا قَالَتْ وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قد ألقيت عَلَيْهِ المهابة. فَقَالَت فَخَرَجَ عَلَيْنَا بِلَالٌ فَقُلْنَا لَهُ ائْتِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرَهُ أَنَّ امْرَأتَيْنِ بِالْبَابِ تسألانك أتجزئ الصَّدَقَة عَنْهُمَا على أَزْوَاجِهِمَا وَعَلَى أَيْتَامٍ فِي حُجُورِهِمَا وَلَا تُخْبِرْهُ مَنْ نَحْنُ. قَالَتْ فَدَخَلَ بِلَالٌ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلَهُ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ هما» . فَقَالَ امْرَأَة من الْأَنْصَار وَزَيْنَب فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَيُّ الزَّيَانِبِ» . قَالَ امْرَأَةُ عَبْدِ اللَّهِ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَهما أَجْرَانِ أجر الْقَرَابَة وَأجر الصَّدَقَة» . وَاللَّفْظ لمُسلم","english":{"narrator":"","text":"Zainab the wife of ‘Abdallah b. Mas'ud said that when God's messenger told the women that they should give sadaqa, even though it should be some of their jewellery, she returned to ‘Abdallah and said, “you are a man who does not possess much, and God’s messenger has commanded us to give sadaqa; so go and ask him, and if giving to you will serve for me I shall do so, otherwise I shall give it to someone else.” \nHe told her it would be better to go herself, so she went and found a woman of the Ansar at God's messenger’s door who had come for the same purpose as she had. Now God’s messenger was invested with respect, and when Bilal came out to them they said to him, “Go to God’s messenger and tell him that there are two women at the door who have come to ask him whether it will serve them to give sadaqa to their husbands and to orphans who are in their charge, but do not tell him who we are.” \nBilal went in and asked him, and God’s messenger asked him who the women were. When he told him that they were the women of the Ansar and Zainab, he asked him which Zainab it was, and when he was told that it was the wife of ‘Abdallah he said. \n“They will have two rewards, the reward for kinship and the reward for sadaqa. \n\n(Bukhari and Muslim, the wording being Muslim’s.)"}},{"id":160,"idInBook":160,"chapterId":6,"bookId":14,"arabic":"وَعَنْ مَيْمُونَةَ بِنْتِ الْحَارِثِ: أَنَّهَا أَعْتَقَتْ وَلِيدَةً فِي زَمَانِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَتْ ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «لَوْ أَعْطَيْتِهَا أخوالك كَانَ أعظم لأجرك»","english":{"narrator":"","text":"Maimuna daughter of al-Harith told that she set free a girl in the time of God’s messenger, and when she mentioned that to him he said, \n“If you had given her to your maternal uncles it would have increased your reward.” \n\n(Bukhari and Muslim.)"}},{"id":161,"idInBook":161,"chapterId":6,"bookId":14,"arabic":"وَعَن عَائِشَة قَالَت: يَا رَسُول الله إِن لِي جَارَيْنِ فَإِلَى أَيِّهِمَا أُهْدِي؟ قَالَ: «إِلَى أقربهما مِنْك بَابا» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"'A’isha said that when she told God’s messenger she had two neighbours and asked to which of them she should send a present, he replied, \n“To the one who lives nearer you.”\n\nBukhari transmitted it."}},{"id":162,"idInBook":162,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي ذَرٍّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا طَبَخْتَ مَرَقَةً فَأكْثر ماءها وتعاهد جيرانك» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Dharr reported God’s messenger as saying, \n“When you make soup put in a lot of water and be mindful of your neighbours.” \n\nMuslim transmitted it."}},{"id":163,"idInBook":163,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: يَا رَسُولَ اللَّهِ أَيُّ الصَّدَقَةِ أَفْضَلُ؟ قَالَ: «جُهْدُ الْمُقِلِّ وَابْدَأْ بِمَنْ تَعُولُ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Abu Huraira asked God’s messenger what kind of sadaqa was most excellent and he replied, \n“What a man with little property can afford to give; and begin with those for whom you are responsible.” \n\nAbu Dawud transmitted it."}},{"id":164,"idInBook":164,"chapterId":6,"bookId":14,"arabic":"وَعَنْ سَلْمَانَ بْنِ عَامِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" الصَّدَقَةُ عَلَى الْمِسْكِينِ صَدَقَةٌ وَهِيَ عَلَى ذِي الرَّحِمِ ثِنْتَانِ: صَدَقَةٌ وَصِلَةٌ \". رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَالنَّسَائِيُّ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ","english":{"narrator":"","text":"Sulaiman b. ‘Amir reported God’s messenger as saying, \n“Sadaqa given to a poor man is just sadaqa, but when given to a relative it serves a double purpose, being both sadaqa and a connecting link.” \n\nAhmad, Tirmidhi, Nasa’i, Ibn Majah and Darimi transmitted it."}},{"id":165,"idInBook":165,"chapterId":6,"bookId":14,"arabic":"وَعَن أَي هُرَيْرَةَ قَالَ: جَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: عِنْدِي دِينَار فَقَالَ: «أَنْفِقْهُ عَلَى نَفْسِكَ» قَالَ: عِنْدِي آخَرُ قَالَ: «أَنْفِقْهُ عَلَى وَلَدِكَ» قَالَ: عِنْدِي آخَرُ قَالَ: «أَنْفِقْهُ عَلَى أَهْلِكَ» قَالَ: عِنْدِي آخَرُ قَالَ: «أَنْفِقْهُ عَلَى خَادِمِكَ» . قَالَ: عِنْدِي آخَرُ قَالَ: «أَنْت أعلم» . رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ","english":{"narrator":"","text":"Abu Huraira said that when a man came to the Prophet saying that he had a dinar, he told him to spend it on himself. \nHe said that he had another, and he told him to spend it on his children. \nHe said that he had another, and he told him to spend it on his wife. \nHe said that he had another, and he told him to spend it on his servant. \nHe said he had another and he replied, “You know best .\" \n\nAbu Dawud and Nasa’i transmitted it."}},{"id":166,"idInBook":166,"chapterId":6,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَلَا أُخْبِرُكُمْ بِخَيْرِ النَّاسِ؟ رَجُلٌ مُمْسِكٌ بِعِنَانِ فَرَسِهِ فِي سَبِيلِ اللَّهِ. أَلَا أُخْبِرُكُمْ بِالَّذِي يَتْلُوهُ؟ رَجُلٌ مُعْتَزِلٌ فِي غُنَيْمَةٍ لَهُ يُؤَدِّي حَقَّ اللَّهِ فِيهَا. أَلَا أُخْبِرُكُمْ بِشَرِّ النَّاسِ رَجُلٌ يُسْأَلُ بِاللَّهِ وَلَا يُعْطِي بِهِ» . رَوَاهُ التِّرْمِذِيُّ وَالنَّسَائِيُّ وَالدَّارِمِيّ","english":{"narrator":"","text":"Ibn ‘Abbas reported God’s messenger as saying, \n“I shall tell you who is the best of men; he is a man who holds his horse's rein in God’s path. \nI shall tell you who comes next to him; he is a man who retires with some few goats which he possesses and pays what is due to God on them. \nI shall tell you who is the worst of men; he is a man from whom someone begs in God’s name, but who does not give anything in His name.’’ \n\nTirmidhi, Nas&’l and Darimi transmitted it."}},{"id":167,"idInBook":167,"chapterId":6,"bookId":14,"arabic":"وَعَن أم بحيد قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «رُدُّوا السَّائِلَ وَلَوْ بِظِلْفٍ مُحْرَقٍ» . رَوَاهُ مَالِكٌ وَالنَّسَائِيُّ وَرَوَى التِّرْمِذِيُّ وَأَبُو دَاوُدَ مَعْنَاهُُُُُُُ","english":{"narrator":"","text":"Umm Bujaid reported God’s messenger as saying, \n“Send away the beggar , even with only a burnt hoof.” \n\nMalik and Nasa’i transmitted it, and Tirmidhi and Abu Dawud transmitted something to the same effect."}},{"id":168,"idInBook":168,"chapterId":6,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنِ اسْتَعَاذَ مِنْكُمْ بِاللَّهِ فَأَعِيذُوهُ وَمَنْ سَأَلَ بِاللَّهِ فَأَعْطُوهُ وَمَنْ دَعَاكُمْ فَأَجِيبُوهُ وَمَنْ صَنَعَ إِلَيْكُمْ مَعْرُوفًا فَكَافِئُوهُ فَإِنْ لَمْ تَجِدُوا مَا تُكَافِئُوهُ فَادْعُوا لَهُ حَتَّى تُرَوْا أَنْ قَدْ كَافَأْتُمُوهُ» . رَوَاهُ أَحْمَدُ وَأَبُو دَاوُد وَالنَّسَائِيّ","english":{"narrator":"","text":"Ibn ‘Umar reported God’s messenger as saying, \n“If anyone seeks protection in God’s name grant him protection; \nif anyone begs in God’s name give him something; \nif anyone gives you an invitation accept it; \nand if anyone does you a kindness recompense him, \nbut if you have not the means to do so pray for him until you feel that you have recompensed him.” \n\nAhmad, Abu Dawud and Nasa’i transmitted it."}},{"id":169,"idInBook":169,"chapterId":6,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يُسْأَلُ بِوَجْهِ اللَّهِ إِلَّا الْجنَّة» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Jabir reported God’s messenger as saying, \n“Nothing but paradise must be begged for God’s sake.” \n\nAbu Dawud transmitted it."}},{"id":170,"idInBook":170,"chapterId":6,"bookId":14,"arabic":"عَن أنس بن مَالك قَالَ: كَانَ أَبُو طَلْحَة أَكثر أَنْصَارِي بِالْمَدِينَةِ مَالًا مِنْ نَخْلٍ وَكَانَ أَحَبُّ أَمْوَالِهِ إِلَيْهِ بيرحاء وَكَانَت مُسْتَقْبل الْمَسْجِدَ وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدْخُلُهَا وَيَشْرَبُ مِنْ مَاءٍ فِيهَا طَيِّبٍ قَالَ أنس فَلَمَّا نزلت (لَنْ تَنَالُوا الْبِرَّ حَتَّى تُنْفِقُوا مِمَّا تُحِبُّونَ)\nقَامَ أَبُو طَلْحَة فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ اللَّهَ تَعَالَى يَقُول: (لَنْ تَنَالُوا الْبِرَّ حَتَّى تُنْفِقُوا مِمَّا تُحِبُّونَ)\nوَإِنَّ أَحَبَّ مَالِي إِلَيَّ بَيْرَحَاءُ وَإِنَّهَا صَدَقَةٌ لله أَرْجُو بِرَّهَا وَذُخْرَهَا عِنْدَ اللَّهِ فَضَعْهَا يَا رَسُولَ اللَّهِ حَيْثُ أَرَاكَ اللَّهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «بَخٍ بَخٍ ذَلِكَ مَالٌ رَابِحٌ وَقَدْ سَمِعْتُ مَا قُلْتَ وَإِنَّى أَرَى أَنْ تَجْعَلَهَا فِي الْأَقْرَبِينَ» . فَقَالَ أَبُو طَلْحَةَ أَفْعَلُ يَا رَسُولَ اللَّهِ فَقَسَّمَهَا أَبُو طَلْحَة فِي أَقَاربه وَفِي بني عَمه","english":{"narrator":"","text":"Anas said that Abu Talha was the one among the Ansar who possessed most palm trees, the property he prized most being Bairaha’ which was opposite the mosque and was often entered by God’s messenger who drank some of the sweet water it contained. \nWhen this verse came down, “You will never attain righteousness till you give freely of what you love,”* Abu Talha got up and going to God's messenger said, “Messenger of God, God says, ‘You will never attain righteousness till you give freely of what you love,' and my property which I prize most is Bairaha’, so I give it as sadaqa to God most high from whom I hope for reward for the act of righteousness and the treasure relating to it;** so apply it, messenger of God, to whatever purpose God shows you.” \nHe replied, “Bravo! That is profitable property. I have heard what you said, and I think you should apply it to your nearest relatives.” \nAbu Talha told God’s messenger he would do so, and divided it among his nearest relatives and his cousins on his father’s side. \n\n(Bukhari and Muslim.)\n\n* Quran 3:92\n** The Arabic is dhukhraha, which conveys the idea of this good deed being stored up with God who will give a reward for it in the next world"}},{"id":171,"idInBook":171,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَفْضَلُ الصَّدَقَةِ أَنْ تُشْبِعَ كَبِدًا جَائِعًا» . رَوَاهُ الْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَانِ","english":{"narrator":"","text":"He reported God’s messenger as saying, “The most excellent sadaqa consists in your satisfying a hungry stomach.”* \n\nBaihaqi transmitted it in Shu’ab al-iman.\n\n* Literally “liver.”"}},{"id":172,"idInBook":172,"chapterId":6,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «إِذْ أَنْفَقَتِ الْمَرْأَةُ مِنْ طَعَامِ بَيْتِهَا غَيْرَ مُفْسِدَةٍ كَانَ لَهَا أَجْرُهَا بِمَا أَنْفَقَتْ وَلِزَوْجِهَا أَجْرُهُ بِمَا كَسَبَ وَلِلْخَازِنِ مِثْلُ ذَلِكَ لَا يَنْقُصُ بَعْضُهُمْ أَجْرَ بعض شَيْئا»","english":{"narrator":"","text":"‘A’isha reported God’s messenger as saying, \n“When a woman gives some of the food in her house, not wasting it, she will have her reward for what she has given and her husband will have his for what he earned. The same applies to a storekeeper. In no respect does the one diminish the reward of the other.” \n\n(Bukhari and Muslim.)"}},{"id":173,"idInBook":173,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا أَنْفَقَتِ الْمَرْأَةُ مِنْ كَسْبِ زَوْجِهَا مِنْ غَيْرِ أَمْرِهِ فَلَهَا نِصْفُ أَجْرِهِ»","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, \n“When a woman gives something her husband has earned without being commanded by him to do so, she has half his reward.” \n\n(Bukhari and Muslim.)"}},{"id":174,"idInBook":174,"chapterId":6,"bookId":14,"arabic":"وَعَنْ أَبِي مُوسَى الْأَشْعَرِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْخَازِنُ الْمُسْلِمُ الْأَمِينُ الَّذِي يُعْطِي مَا أُمِرَ بِهِ كَامِلًا مُوَفَّرًا طَيِّبَةً بِهِ نَفْسُهُ فَيَدْفَعُهُ إِلَى الَّذِي أَمر لَهُ بِهِ أحد المتصدقين»","english":{"narrator":"","text":"Abu Musa al-Ash'ari reported God’s messenger as saying, \n“The faithful Muslim storekeeper who gives what he is commanded completely and in full with a good will, and delivers it to the one to whom he was told to give it, is one of the two* who give sadaqa.” \n\n(Bukhari and Muslim.)\n\n* The two are his master and himself."}},{"id":175,"idInBook":175,"chapterId":6,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: أَنَّ رَجُلًا قَالَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِنَّ أُمِّي افْتُلِتَتْ نَفْسَهَا وَأَظُنُّهَا لَوْ تَكَلَّمَتْ تَصَدَّقَتْ فَهَلْ لَهَا أَجْرٌ إِنْ تَصَدَّقت عَنْهَا؟ قَالَ: نعم \"","english":{"narrator":"","text":"‘A’isha said that a man told the Prophet his mother had died suddenly adding that he thought she would have given sadaqa if she had been able to speak. He therefore asked if she would have a reward supposing he gave sadaqa on her behalf, and was told that she would. \n\n(Bukhari and Muslim.)"}},{"id":176,"idInBook":176,"chapterId":6,"bookId":14,"arabic":"عَنْ أَبِي أُمَامَةَ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي خُطْبَتِهِ عَامَ حُجَّةِ الْوَدَاعِ: «لَا تُنْفِقُ امْرَأَةٌ شَيْئًا مِنْ بَيْتِ زَوْجِهَا إِلَّا بِإِذْنِ زَوْجِهَا» . قِيلَ: يَا رَسُولَ اللَّهِ وَلَا الطَّعَامَ؟ قَالَ: «ذَلِكَ أفضل أَمْوَالنَا» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Abu Umama said he heard God’s messenger say in the course of his sermon in the year of the Farewell Pilgrimage, \n“A woman must not give anything away from her husband’s house without her husbnnd’s permission.” \nHe was asked whether she might not even give away food and replied, “That is the most excellent property we possess.” \n\nTirmidhi transmitted it"}},{"id":177,"idInBook":177,"chapterId":6,"bookId":14,"arabic":"وَعَنْ سَعْدٍ قَالَ: لَمَّا بَايَعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ النِّسَاءُ قَامَتِ امْرَأَةٌ جَلِيلَةٌ كَأَنَّهَا مِنْ نِسَاءِ مُضَرَ فَقَالَتْ: يَا نَبِيَّ اللَّهِ إِنَّا كَلٌّ عَلَى آبَائِنَا وَأَبْنَائِنَا وَأَزْوَاجِنَا فَمَا يَحِلُّ لَنَا مِنْ أَمْوَالِهِمْ؟ قَالَ: «الرطب تأكلنه وتهدينه» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"Sa'd said that when God’s messenger took the oath of allegiance from the women, a woman of high rank who seemed to be one of the women of Mudar rose and said, “Prophet of God, we are dependent* on our parents, our sons and our husbands, so with what part of their property can we do what we like?” He replied, “Fresh food which you eat and give as a present.” \n\nAbu Dawud transmitted it.\n\n* The Arabic is kall, meaning:","text":"literally ‘a burden’"}},{"id":178,"idInBook":178,"chapterId":6,"bookId":14,"arabic":"عَنْ عُمَيْرٍ مَوْلَى آبِي اللَّحْمِ قَالَ: أَمَرَنِي مَوْلَايَ أَنْ أُقَدِّدَ لَحْمًا فَجَاءَنِي مِسْكِينٌ فَأَطْعَمْتُهُ مِنْهُ فَعَلِمَ بِذَلِكَ مَوْلَايَ فَضَرَبَنِي فَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرْتُ ذَلِكَ لَهُ فَدَعَاهُ فَقَالَ: «لِمَ ضَرَبْتَهُ؟» فَقَالَ يُعْطِي طَعَامِي بِغَيْرِ أَنْ آمُرَهُ فَقَالَ: «الْأَجْرُ بَيْنَكُمَا» . وَفِي رِوَايَةٍ قَالَ: كُنْتُ مَمْلُوكًا فَسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أأتصدق مِنْ مَالِ مَوَالِيَّ بِشَيْءٍ؟ قَالَ: «نَعَمْ وَالْأَجْرُ بَيْنَكُمَا نِصْفَانِ» . رَوَاهُ مُسْلِمٌ","english":{"narrator":"‘Umair the client of Abul Lahm said:","text":"My patron ordered me to cut some meat in strips and spread it in the sun to dry, and when a poor man came to me I gave him some of it to eat. My patron got to know of that and beat me, so I went to God’s messenger and mentioned the matter to him. He summoned him and asked, “Why did you beat him?” He replied, “He gives away my food without instruction from me.” Then he said, “The reward is shared between you.” \nIn a version he said: I was a slave and I asked God’s messenger whether I could give any sadaqa from my patron’s property. He replied, “Yes, and the reward will be shared equally between you.” \n\nMuslim transmitted it."}},{"id":179,"idInBook":179,"chapterId":6,"bookId":14,"arabic":"عَنْ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ قَالَ: حَمَلْتُ عَلَى فَرَسٍ فِي سَبِيلِ اللَّهِ فَأَضَاعَهُ الَّذِي كَانَ عِنْدَهُ فَأَرَدْتُ أَنْ أَشْتَرِيَهُ وَظَنَنْتُ أَنَّهُ يَبِيعُهُ بِرُخْصٍ فَسَأَلْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «لَا تَشْتَرِهِ وَلَا تَعُدْ فِي صَدَقَتِكَ وَإِنْ أَعْطَاكَهُ بِدِرْهَمٍ فَإِنَّ الْعَائِدَ فِي صَدَقَتِهِ كَالْكَلْبِ يَعُودُ فِي قَيْئِهِ» . وَفِي رِوَايَةٍ: «لَا تَعُدْ فِي صَدَقَتِكَ فَإِنَّ الْعَائِدَ فِي صَدَقَتِهِ كالعائد فِي قيئه»","english":{"narrator":"‘Umar b. al-Rhattab said:","text":"I provided a man with a horse to ride in God’s path, but as the one who had it did not look after it well, I wanted to buy it and thought he would sell it at a cheap price. I therefore asked the Prophet, but he said, \n“Do not buy it, and do not take back what you gave as sadaqa even if he gives it to you for a dirham, for the one who takes back what he gave as sadaqa is like a dog which returns to its vomit.” \nA version has, “Do not take back what you gave as sadaqa, for the one who does so is like one who takes back what he has vomited.” \n\n(Bukhari and Muslim.)"}},{"id":180,"idInBook":180,"chapterId":6,"bookId":14,"arabic":"وَعَنْ بُرَيْدَةَ قَالَ: كُنْتُ جَالِسًا عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذْ أَتَتْهُ امْرَأَةٌ فَقَالَت يَا رَسُول الله إِنِّي كنت تَصَدَّقْتُ عَلَى أُمِّي بِجَارِيَةٍ وَإِنَّهَا مَاتَتْ قَالَ: «وَجَبَ أَجَرُكِ وَرَدَّهَا عَلَيْكِ الْمِيرَاثُ» . قَالَتْ يَا رَسُولَ اللَّهِ إِنَّهُ كَانَ عَلَيْهَا صَوْمُ شَهْرٍ أفأصوم عَنْهَا قَالَ: «صومي عَنْهَا» . قَالَت يَا رَسُول الله إِنَّهَا لَمْ تَحُجَّ قَطُّ أَفَأَحُجُّ عَنْهَا قَالَ: «نعم حجي عَنْهَا» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Buraida said that when he was sitting with the Prophet a woman came to him and said, “Messenger of God, I gave a slavegirl as sadaqa to my mother who has now died.” \nHe replied. “Your reward is sure, and the inheritance has given her back to you.” \nShe said, \"Messenger of God, a month's fast was due from her; may I fast on her behalf ?” He replied, “Fast on her behalf.” \nShe said, “She never performed the pilgrimage, so may I do so on her behalf ?” He replied, “Yes, perform the pilgrimage on her behalf.” \n\nMuslim transmitted it."}}],"chapter":{"id":6,"bookId":14,"arabic":"كتاب الزكاة","english":"Zakat"}}