{"metadata":{"length":148,"arabic":{"title":"مشكاة المصابيح","author":"الإمام الكاتب التبريزي","introduction":"كتاب الصوم"},"english":{"title":"Mishkat al-Masabih","author":"Al-Khatib Al-Tabrizi","introduction":"Fasting"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":7,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «إِذا دخل شهر رَمَضَانُ فُتِحَتْ أَبْوَابُ السَّمَاءِ» . وَفِي رِوَايَةٍ: «فُتِّحَتْ أَبْوَابُ الْجَنَّةِ وَغُلِّقَتْ أَبْوَابُ جَهَنَّمَ وَسُلْسِلَتِ الشَّيَاطِينُ» . وَفِي رِوَايَةٍ: «فُتِحَتْ أَبْوَابُ الرَّحْمَةِ»","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, \"When Ramadan begins the gates of heaven are opened.\" A version has, \"The gates of paradise are opened, the gates of jahannam are locked, and the devils are chained.\" Another has, \"The gates of mercy are opened.\"\n\n(Bukhari and Muslim)."}},{"id":2,"idInBook":2,"chapterId":7,"bookId":14,"arabic":"وَعَنْ سَهْلِ بْنِ سَعْدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" فِي الْجَنَّةِ ثَمَانِيَةُ أَبْوَابٍ مِنْهَا: بَابٌ يُسَمَّى الرَّيَّانَ لَا يدْخلهُ إِلَّا الصائمون \"","english":{"narrator":"","text":"Sahl b. Sa'd reported God’s messenger as saying, \"In paradise there are eight gates among which is a gate called ar-Rayyan which only those who fast will enter.\"\n\n(Bukhari and Muslim.)"}},{"id":3,"idInBook":3,"chapterId":7,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ صَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ. وَمَنْ قَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ. وَمَنْ قَامَ لَيْلَةَ الْقَدْرِ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ»","english":{"narrator":"","text":"Abu Huraira reported God's messenger as saying, \"He who fasts during Ramadan with faith and seeking his reward from God will have his past sins forgiven; he who prays during the night in Ramadan with faith and seeking his reward from God will have his past sins forgiven; and he who passes Lailat al-qadr  in prayer with faith and seeking his reward from God will have his past sins forgiven.\"\n\n(Bukhari and Muslim.)"}},{"id":4,"idInBook":4,"chapterId":7,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" كُلُّ عَمَلِ ابْنِ آدَمَ يُضَاعَفُ الْحَسَنَةُ بِعَشْرِ أَمْثَالِهَا إِلَى سَبْعِمِائَةِ ضِعْفٍ قَالَ اللَّهُ تَعَالَى: إِلَّا الصَّوْمَ فَإِنَّهُ لِي وَأَنَا أَجْزِي بِهِ يَدَعُ شَهْوَتَهُ وَطَعَامَهُ مِنْ أَجْلِي لِلصَّائِمِ فَرْحَتَانِ: فَرْحَةٌ عِنْدَ فِطْرِهِ وَفَرْحَةٌ عِنْدَ لِقَاءِ رَبِّهِ وَلَخُلُوفِ فَمِ الصَّائِمِ أَطْيَبُ عِنْدَ اللَّهِ مِنْ رِيحِ الْمِسْكِ وَالصِّيَامُ جُنَّةٌ وَإِذَا كَانَ يَوْمُ صَوْمِ أَحَدِكُمْ فَلَا يَرْفُثْ وَلَا يصخب وفإن سَابَّهُ أَحَدٌ أَوْ قَاتَلَهُ فَلْيَقُلْ إِنِّي امْرُؤٌ صَائِم \"","english":{"narrator":"","text":"He reported God’s messenger as saying, \"Every  and when the day of the fast of any of you comes he must not use vile language or raise his voice, and if anyone reviles him or tries to fight with him he should tell him he is fasting.” \n*This is not from the Qur’an, but is a hadith qudsi, a tradition which gives words spoken by God.\n\n(Bukhari and Muslim.)"}},{"id":5,"idInBook":5,"chapterId":7,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" إِذَا كَانَ أَوَّلُ لَيْلَةٍ مِنْ شَهْرِ رَمَضَانَ صُفِّدَتِ الشَّيَاطِينُ وَمَرَدَةُ الْجِنِّ وَغُلِّقَتْ أَبْوَابُ النَّارِ فَلم يفتح مِنْهَا بَاب الْجَنَّةِ فَلَمْ يُغْلَقْ مِنْهَا بَابٌ وَيُنَادِي مُنَادٍ: يَا بَاغِيَ الْخَيْرِ أَقْبِلْ وَيَا بَاغِيَ الشَّرِّ أقصر ن وَلِلَّهِ عُتَقَاءُ مِنَ النَّارِ وَذَلِكَ كُلَّ لَيْلَةٍ \". رَوَاهُ التِّرْمِذِيّ وَابْن مَاجَه\nوَرَوَاهُ أَحْمد عَن رجل وَقَالَ التِّرْمِذِيّ هَذَا حَدِيث غَرِيب","english":{"narrator":"","text":"Abu Huraira reported God's messenger as saying, \"When the first night of Ramadan comes the devils and the rebellious jinn are chained, the gates of hell are locked and not one of them is opened; the gates of paradise are opened and not one of them is locked, and a crier calls, 'You who desire what is good, come forward, and you who desire evil refrain.' Some are freed from hell by God, and that happens every night.\" \n\nTirmidhi and Ibn Majah transmitted it, and Ahmad transmitted it from a man.  Tirmidhi said this is a gharib tradition."}},{"id":6,"idInBook":6,"chapterId":7,"bookId":14,"arabic":"عن أبي هريرة رضي الله عنه قال : قال رسول الله صلى الله عليه وسلم : \n\" أتاكم رمضان شهر مبارك فرض الله عليكم صيامه تفتح فيه أبواب السماء وتغلق فيه أبواب الجحيم وتغل فيه مردة الشياطين لله فيه ليلة خير من ألف شهر من حرم خيرها فقد حرم \" . رواه أحمد والنسائي","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “Ramadan, a blessed month, has come to you during which God has made it obligatory for you to fast. In it the gates of heaven are opened, the gates of al-Jahim are locked, and the rebellious devils are chained. In it God has a night which is better than a thousand months. He who is deprived of its good has indeed suffered deprivation.\" \n\nAhmad and Nasa’i transmitted it."}},{"id":7,"idInBook":7,"chapterId":7,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" الصِّيَامُ وَالْقُرْآنُ يَشْفَعَانِ لِلْعَبْدِ يَقُولُ الصِّيَامُ: أَيْ رَبِّ إِنِّي مَنَعْتُهُ الطَّعَامَ وَالشَّهَوَاتِ بِالنَّهَارِ فَشَفِّعْنِي فِيهِ وَيَقُولُ الْقُرْآنُ: مَنَعْتُهُ النُّوْمَ بِاللَّيْلِ فَشَفِّعْنِي فِيهِ فيشفعان \". رَوَاهُ الْبَيْهَقِيّ فِي شعب الْإِيمَان","english":{"narrator":"","text":"‘Abdallah b. ‘Amr reported God’s messenger as saying, “Fasting and the Qur’an intercede for a man. Fasting says, ‘O my Lord, I have kept him away from his food and his passions by day, so accept my intercession for him.’ The Qur’an says, ‘I have kept him away from sleep by night, so accept my intercession for him.’ Then their intercession is accepted.\" \n\nBaihaqi transmitted it in Shu'ab al-iman."}},{"id":8,"idInBook":8,"chapterId":7,"bookId":14,"arabic":"وَعَنْ أَنَسِ بْنِ مَالِكٍ قَالَ: دَخَلَ رَمَضَانُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ هَذَا الشَّهْرَ قَدْ حَضَرَكُمْ وَفِيهِ لَيْلَةٌ خَيْرٌ مَنْ أَلْفِ شَهْرٍ مَنْ حُرِمَهَا فَقَدْ حُرِمَ الْخَيْرَ كُلَّهُ وَلَا يُحْرَمُ خَيْرَهَا إِلَّا كل محروم» . رَوَاهُ ابْن مَاجَه","english":{"narrator":"","text":"Anas b. Malik told of God’s messenger saying when Ramadan began, “This month has come to you, and it contains a night which is better than a thousand months. He who is deprived of it is deprived of all good, but only those who are denied prosperity are deprived of it.\" \n\nIbn Majah transmitted it."}},{"id":9,"idInBook":9,"chapterId":7,"bookId":14,"arabic":"وَعَن سلمَان قَالَ: خَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي آخِرِ يَوْمٍ مِنْ شَعْبَانَ فَقَالَ: «يَا أَيُّهَا النَّاسُ قَدْ أَظَلَّكُمْ شَهْرٌ عَظِيمٌ مُبَارَكٌ شَهْرٌ فِيهِ لَيْلَةٌ خَيْرٌ مَنْ أَلْفِ شهر جعل الله تَعَالَى صِيَامَهُ فَرِيضَةً وَقِيَامَ لَيْلِهِ تَطَوُّعًا مَنْ تَقَرَّبَ فِيهِ بخصلة من الْخَيْرِ كَانَ كَمَنْ أَدَّى فَرِيضَةً فِيمَا سِوَاهُ وَمَنْ أَدَّى فَرِيضَةً فِيهِ كَانَ كَمَنْ أَدَّى سَبْعِينَ فَرِيضَةً فِيمَا سِوَاهُ وَهُوَ شَهْرُ الصَّبْرِ وَالصَّبْر ثَوَابه الْجنَّة وَشهر الْمُوَاسَاة وَشهر يزْدَاد فِيهِ رِزْقُ الْمُؤْمِنِ مَنْ فَطَّرَ فِيهِ صَائِمًا كَانَ لَهُ مَغْفِرَةً لِذُنُوبِهِ وَعِتْقَ رَقَبَتِهِ مِنَ النَّارِ وَكَانَ لَهُ مِثْلُ أَجْرِهِ مِنْ غَيْرِ أَنْ يَنْقُصَ مِنْ أَجْرِهِ شَيْءٌ» قُلْنَا: يَا رَسُولَ اللَّهِ لَيْسَ كلنا يجد مَا نُفَطِّرُ بِهِ الصَّائِمَ. فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يُعْطِي اللَّهُ هَذَا الثَّوَابَ مَنْ فَطَّرَ صَائِمًا عَلَى مَذْقَةِ لَبَنٍ أَوْ تَمْرَةٍ أَوْ شَرْبَةٍ مِنْ مَاءٍ وَمَنْ أَشْبَعَ صَائِمًا سَقَاهُ اللَّهُ مِنْ حَوْضِي شَرْبَةً لَا يَظْمَأُ حَتَّى يَدْخُلَ الْجَنَّةَ وَهُوَ شَهْرٌ أَوَّلُهُ رَحْمَةٌ وَأَوْسَطُهُ مَغْفِرَةٌ وَآخِرُهُ عِتْقٌ مِنَ النَّارِ وَمَنْ خَفَّفَ عَنْ مَمْلُوكِهِ فِيهِ غَفَرَ الله لَهُ وَأعْتقهُ من النَّار» . رَوَاهُ الْبَيْهَقِيّ","english":{"narrator":"","text":"Salman al-Farisi told of God’s messenger saying in a sermon which he delivered to them on the last day of Sha'ban, “A great month, a blessed month, a month containing a night which is better than a thousand months has approached you people. God has appointed the observance of fasting during it as an obligatory duty, and the passing of its night in prayer as a voluntary practice. If someone draws near to God during it with some good act he will be like one who fulfils an obligatory duty in another month, and he who fulfills an obligatory duty in it will be like one who fulfills seventy obligatory duties in another month. It is the month of endurance, and the reward of endurance is paradise. It is the month of sharing with others, and a month in which the believer’s provision is increased. If someone gives one who has been fasting something with which to break his fast it will provide forgiveness of his sins and save him from hell, and he will have a reward equal to his without his reward being diminished in any respect.” Some of them remarked to God’s messenger that they did not all have the means to give one who had been fasting something with which to break his fast, and he replied, “God gives this reward to him who gives one who has been fasting some milk mixed with water, or a date, or a drink of water with which to break his fast, and anyone who gives a full meal to one who has been fasting will be given a drink from any tank by God and will not thirst till he enters paradise. It is a month whose beginning is mercy, whose middle is forgiveness, and whose end is freedom from hell. If anyone makes things easy for his slave during it, God will forgive him and free him from hell.”"}},{"id":10,"idInBook":10,"chapterId":7,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا دَخَلَ شَهْرُ رَمَضَانَ أَطْلَقَ كُلَّ أَسِيرٍ وَأَعْطَى كُلَّ سَائِلٍ. رَوَاهُ الْبَيْهَقِيّ","english":{"narrator":"","text":"Ibn ‘Abbas said that when the month of Ramadan began God's messenger set every prisoner free and gave to every beggar."}},{"id":11,"idInBook":11,"chapterId":7,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ الْجَنَّةَ تُزَخْرَفُ لِرَمَضَانَ مِنْ رَأْسِ الْحَوْلِ إِلَى حَوْلِ قَابِلٍ» . قَالَ: \n\" فَإِذَا كَانَ أَوَّلُ يَوْمٍ مِنْ رَمَضَانَ هَبَّتْ رِيحٌ تَحْتَ الْعَرْشِ مِنْ وَرَقِ الْجَنَّةِ عَلَى الْحُورِ الْعِينِ فَيَقُلْنَ: يَا رَبِّ اجْعَلْ لَنَا مِنْ عِبَادِكَ أَزْوَاجًا تَقَرَّ بِهِمْ أَعْيُنُنَا وَتَقَرَّ أَعْيُنُهُمْ بِنَا \". رَوَى الْبَيْهَقِيُّ الْأَحَادِيثَ الثَّلَاثَةَ فِي شُعَبِ الْإِيمَانِ","english":{"narrator":"","text":"Ibn ‘Umar reported the Prophet as saying, “Paradise is decorated for Ramadan from the beginning of the year till a following year, and when the first day of Ramadan comes a wind under the throne blows some of the leaves of paradise on the maidens with bright large eyes,* and they say, ‘My Lord, appoint us husbands from among Thy servants with whom we shall be happy and who will be happy with us’.” \n*cf. Qur’an, xliv, 54; lvi, 22.\n\nBaihaqi transmitted the three traditions in Shu'ab al-iman."}},{"id":12,"idInBook":12,"chapterId":7,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ: «يُغْفَرُ لِأُمَّتِهِ فِي آخِرِ لَيْلَةٍ فِي رَمَضَانَ» . قِيلَ: يَا رَسُولَ اللَّهِ أَهِيَ لَيْلَةُ الْقَدْرِ؟ قَالَ: «لَا وَلَكِنَّ الْعَامِلَ إِنَّمَا يُوَفَّى أجره إِذا قضى عمله» . رَوَاهُ أَحْمد","english":{"narrator":"","text":"Abu Huraira said that when the Prophet stated that his people would be granted forgiveness on the last night in Ramadan and was asked whether it was Lailat al-qadr, he replied, “No, but a workman is paid his full wages only when he has finished his work.” \n\nAhmad transmitted it."}},{"id":13,"idInBook":13,"chapterId":7,"bookId":14,"arabic":"عَنْ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَصُومُوا حَتَّى تَرَوُا الْهِلَالَ وَلَا تُفْطِرُوا حَتَّى تَرَوْهُ فَإِنْ غُمَّ عَلَيْكُمْ فَاقْدِرُوا لَهُ» . وَفِي رِوَايَةٍ قَالَ: «الشَّهْرُ تِسْعٌ وَعِشْرُونَ لَيْلَةً فَلَا تَصُومُوا حَتَّى تَرَوْهُ فَإِنْ غُمَّ عَلَيْكُمْ فَأَكْمِلُوا الْعِدَّةَ ثَلَاثِينَ»","english":{"narrator":"","text":"Ibn ‘Umar reported God’s messenger as saying, “Do not fast till you see the new moon, and do not break your fast till you see it; but if the weather is cloudy calculate when it should appear.” In a version he said, “The month consists of twenty-nine days, but do not fast till you see it, and if the weather is cloudy wait till thirty days of the previous month have passed.” \n\n(Bukhari and Muslim.)"}},{"id":14,"idInBook":14,"chapterId":7,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «صُومُوا لِرُؤْيَتِهِ وَأَفْطِرُوا لِرُؤْيَتِهِ فَإِنْ غم عَلَيْكُم فَأَكْمِلُوا عِدَّةَ شَعْبَانَ ثَلَاثِينَ»","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “Fast when you see it and break your fast when you see it, and if the weather is cloudy treat Sha‘ban as having thirty days.” \n\n(Bukhari and Muslim.)"}},{"id":15,"idInBook":15,"chapterId":7,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَنَا أمة أُميَّة لَا تكْتب وَلَا تحسب الشَّهْرُ هَكَذَا وَهَكَذَا وَهَكَذَا» . وَعَقَدَ الْإِبْهَامَ فِي الثَّالِثَةِ. ثُمَّ قَالَ: «الشَّهْرُ هَكَذَا وَهَكَذَا وَهَكَذَا» . يَعْنِي تَمَامَ الثَّلَاثِينَ يَعْنِي مَرَّةً تِسْعًا وَعِشْرِينَ وَمرَّة ثَلَاثِينَ \"","english":{"narrator":"","text":"Ibn ‘Umar reported God’s messenger as saying, “We are an unlettered people who can neither write nor count. The month is thus and thus and thus,” drawing in his thumb when he said it the third time.* Then he said, “The month is thus and thus and thus,” meaning a complete thirty days. He meant alternately twenty-nine and thirty. \n*Spreading out the ten fingers the first two times and nine the third time.\n\n(Bukhari and Muslim.)"}},{"id":16,"idInBook":16,"chapterId":7,"bookId":14,"arabic":"وَعَنْ أَبِي بَكْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" شَهْرَا عِيدٍ لَا يَنْقُصَانِ: رَمَضَانُ وَذُو الْحِجَّةِ \"","english":{"narrator":"","text":"Abu Bakra reported God’s messenger as saying, “The months of festival, Ramadan and Dhul-hijja, are not defective.”* \n*The most probable meaning is that, even if these months have only twenty-nine days, they are not on that account to be considered deficient in comparison with a month which has thirty days.\n\n(Bukhari and Muslim.)"}},{"id":17,"idInBook":17,"chapterId":7,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَتَقَدَّمَنَّ أَحَدُكُمْ رَمَضَانَ بِصَوْمِ يَوْمٍ أَوْ يَوْمَيْنِ إِلَّا أَنْ يَكُونَ رَجُلٌ كَانَ يَصُوم صوما فليصم ذَلِك الْيَوْم»","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “None of you must fast one day or two days just before Ramadan, except in the case of a man who has been in the habit of observing a particular fast, for he may fast on that day.”* \n*If a man is in the habit of fasting on a particular day of the week and one or other of the two days before Ramadan falls on that day, he may observe his usual practice.\n\n(Bukhari and Muslim.)"}},{"id":18,"idInBook":18,"chapterId":7,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا انْتَصَفَ شَعْبَانُ فَلَا تَصُومُوا» . رَوَاهُ أَبُو دَاوُدَ وَالتِّرْمِذِيُّ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ","english":{"narrator":"","text":"Abu Huraira reported God's messenger as saying, \"When the middle of Sha'ban comes do not fast.\" \n\nAbu Dawud, Tirmidhi, Ibn Majah and Darimi transmitted it."}},{"id":19,"idInBook":19,"chapterId":7,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أحصوا هِلَال شعْبَان لرمضان» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"He reported God’s messenger as saying, \"Calculate on the basis of the new moon of Sha'ban when Ramadan begins.\" \n\nTirmidhi transmitted it."}},{"id":20,"idInBook":20,"chapterId":7,"bookId":14,"arabic":"وَعَن أم سَلمَة قَالَتْ: مَا رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ شَهْرَيْنِ مُتَتَابِعَيْنِ إِلَّا شَعْبَانَ وَرَمَضَانَ. رَوَاهُ أَبُو دَاوُدَ وَالتِّرْمِذِيُّ وَالنَّسَائِيُّ وَابْنُ مَاجَهْ","english":{"narrator":"","text":"Umm Salama said she never saw the Prophet fasting two consecutive months, except Sha'ban and Ramadan. \n\nAbu Dawud, Tirmidhi, Nasa’i and Ibn Majah transmitted it."}},{"id":21,"idInBook":21,"chapterId":7,"bookId":14,"arabic":"وَعَنْ عَمَّارِ بْنِ يَاسِرٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: «مَنْ صَامَ الْيَوْمَ الَّذِي يُشَكُّ فِيهِ فَقَدَ عَصَى أَبَا الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ» . رَوَاهُ أَبُو دَاوُدَ وَالتِّرْمِذِيُّ وَالنَّسَائِيُّ وَابْنُ مَاجَهْ والدارمي","english":{"narrator":"","text":"‘Ammar b. Yasir said, \"He who fasts on a day about which he is doubtful has disobeyed Abul Qasim\"* \n*i.e., the Prophet.\n\nAbu Dawud, Tirmidhi, Nasa’i, Ibn Majah and Darimi transmitted it."}},{"id":22,"idInBook":22,"chapterId":7,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: \" جَاءَ أَعْرَابِيٌّ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: إِنِّي رَأَيْتُ الْهِلَالَ يَعْنِي هِلَالَ رَمَضَانَ فَقَالَ: «أَتَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ؟» قَالَ: نَعَمْ قَالَ: «أَتَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ؟» قَالَ: نَعَمْ. قَالَ: «يَا بِلَالُ أَذِّنْ فِي النَّاسِ أَن يَصُومُوا غَدا» . رَوَاهُ أَبُو دَاوُدَ وَالتِّرْمِذِيُّ وَالنَّسَائِيُّ وَابْنُ مَاجَهْ والدارمي","english":{"narrator":"","text":"Ibn ‘Abbas told a desert Arab coming to the Prophet and saying he had seen the new moon, i.e. the new moon of Ramadan. He asked him whether he testified that there is no god but God and he replied that he did. He then asked if he testified that Muhammad is God’s messenger, and when he replied that he did he said, “Bilal, announce to the people that they must fast tomorrow.\" \n\nAbu Dawud, Tirmidhi, Nasa’i, Ibn Majah and Darimi transmitted it."}},{"id":23,"idInBook":23,"chapterId":7,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: تَرَاءَى النَّاسُ الْهِلَالَ فَأَخْبَرْتُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي رَأَيْتُهُ فَصَامَ وَأَمَرَ النَّاسَ بِصِيَامِهِ. رَوَاهُ أَبُو دَاوُد والدارمي","english":{"narrator":"","text":"Ibn ‘Umar said that the people tried to see the new moon and he informed God’s messenger that he had seen it, so he fasted and commanded the people to observe the fast.\" \n\nAbu Dawud and Darimi transmitted it."}},{"id":24,"idInBook":24,"chapterId":7,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَحَفَّظُ مِنْ شَعْبَانَ مَالَا يَتَحَفَّظُ مِنْ غَيْرِهِ. ثُمَّ يَصُومُ لِرُؤْيَةِ رَمَضَانَ فَإِنْ غُمَّ عَلَيْهِ عَدَّ ثَلَاثِينَ يَوْمًا ثُمَّ صَامَ. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"‘A’isha said that God’s messenger used to count the days in Sha'ban in a manner he did not practise any other month, then fasted when he saw the new moon of Ramadan; but if the weather was cloudy he counted thirty days and then fasted. \n\nAbu Dawud transmitted it."}},{"id":25,"idInBook":25,"chapterId":7,"bookId":14,"arabic":"وَعَنْ أَبِي الْبَخْتَرِيِّ قَالَ: خَرَجْنَا لِلْعُمْرَةِ فَلَمَّا نَزَلْنَا بِبَطْنِ نَخْلَةَ تَرَاءَيْنَا الْهِلَالَ. فَقَالَ بَعْضُ الْقَوْمِ: هُوَ ابْنُ ثَلَاثٍ. وَقَالَ بَعْضُ الْقَوْمِ: هُوَ ابْنُ لَيْلَتَيْنِ فَلَقِينَا ابْنَ عَبَّاسٍ فَقُلْنَا: إِنَّا رَأَيْنَا الْهِلَالَ فَقَالَ بَعْضُ الْقَوْمِ: هُوَ ابْنُ ثَلَاثٍ وَقَالَ بَعْضُ الْقَوْمِ: هُوَ ابْنُ لَيْلَتَيْنِ. فَقَالَ: أَيُّ لَيْلَةٍ رَأَيْتُمُوهُ؟ قُلْنَا: لَيْلَةَ كَذَا وَكَذَا. فَقَالَ: إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَدَّهُ لِلرُّؤْيَةِ فَهُوَ لِلَيْلَةِ رَأَيْتُمُوهُ وَفِي رِوَايَةٍ عَنْهُ. قَالَ: أَهَلَلْنَا رَمَضَانَ وَنَحْنُ بِذَاتِ عِرْقٍ فَأَرْسَلْنَا رَجُلًا إِلَى ابْنِ عَبَّاسٍ يَسْأَلُهُ فَقَالَ ابْنُ عَبَّاسٍ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِن الله تَعَالَى قد أَمَدَّهُ لِرُؤْيَتِهِ فَإِنْ أُغْمِيَ عَلَيْكُمْ فَأَكْمِلُوا الْعِدَّةَ» . رَوَاهُ مُسلم","english":{"narrator":"Abul Bakhtari said:","text":"We went out to perform the ‘umra, and when we encamped in the valley of Nakhla we tried to see the new moon. Some of the people said it was three nights old and others that it was two nights old. We then met Ibn ‘Abbas and told him we had seen the new moon, but that some of the people said it was three nights old and others that it was two nights old. He asked what night we had seen it, and when we told him we had seen it on such and such a night he said, “God’s messenger deferred it till the time it is seen, so it is to be reckoned as being on the night you saw it.” In a version he said: We saw the new moon of Ramadan when we were in Dhat ‘Irq* and we sent a man to Ibn ‘Abbas to enquire of him. He replied that God’s messenger had said, “God most high has deferred it till it is seen, but if the weather is cloudy observe the fast after the complete number of days have passed.” \n*Dhat 'Irq was near Nakhla, so this version is simply a little more precise than the other about were they were.\n\nMuslim transmitted it."}},{"id":26,"idInBook":26,"chapterId":7,"bookId":14,"arabic":"عَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «تَسَحَّرُوا فَإِنَّ فِي السَّحُورِ بركَة»","english":{"narrator":"","text":"Anas reported God's messenger as saying, “Take a meal a little before dawn, for there is a blessing in taking a meal at that time.”\n\n(Bukhari and Muslim.)"}},{"id":27,"idInBook":27,"chapterId":7,"bookId":14,"arabic":"وَعَنْ عَمْرِو بْنِ الْعَاصِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «فَصْلُ مَا بَيْنَ صِيَامِنَا وَصِيَامِ أَهْلِ الْكِتَابِ أَكْلَةُ السَّحَرِ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"‘Amr b. al-‘As reported God’s messenger as saying, “The difference between our fasting and that of the People of the Book is eating shortly before dawn.” \n\nMuslim transmitted it."}},{"id":28,"idInBook":28,"chapterId":7,"bookId":14,"arabic":"وَعَنْ سَهْلٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَزَالُ النَّاسُ بِخَيْرٍ مَا عَجَّلُوا الْفِطْرَ»","english":{"narrator":"","text":"Sahl reported God’s messenger as saying, “The people will continue to prosper as long as they hasten the breaking of the fast.”* \n*This refers to each day during Ramadan, and recommends that the fast should be broken as early as that may lawfully be done. \n\n(Bukhari and Muslim.)"}},{"id":29,"idInBook":29,"chapterId":7,"bookId":14,"arabic":"وَعَنْ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا أَقْبَلَ اللَّيْل من هَهُنَا وَأدبر النَّهَار من هَهُنَا وَغَرَبَتِ الشَّمْسُ فَقَدْ أَفْطَرَ الصَّائِمُ»","english":{"narrator":"","text":"‘Umar reported God’s messenger as saying, “When the night approaches on this side and the day retreats on that side and the sun sets, he who fasts has reached the time to break it.” \n\n(Bukhari and Muslim.)"}},{"id":30,"idInBook":30,"chapterId":7,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ الْوِصَالِ فِي الصَّوْمِ. فَقَالَ لَهُ رجل: إِنَّك تواصل يَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: وَأَيُّكُمْ مِثْلِي إِنِّي أَبَيْتُ يُطْعِمُنِي رَبِّي ويسقيني \"","english":{"narrator":"","text":"Abu Huraira said that God’s messenger forbade uninterrupted fasting, and when a man said, “You fast uninterruptedly, messenger of God,” he replied, “Which of you is like me? During the night my Lord gives me food and drink.” \n\n(Bukhari and Muslim.)"}},{"id":31,"idInBook":31,"chapterId":7,"bookId":14,"arabic":"عَن حَفْصَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ لَمْ يَجْمَعِ الصِّيَامَ قَبْلَ الْفَجْرِ فَلَا صِيَامَ لَهُ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالنَّسَائِيُّ وَالدَّارِمَيُّ وَقَالَ أَبُو دَاوُد: وَقفه على حَفْصَة معمر والزبيدي وَابْنُ عُيَيْنَةَ وَيُونُسُ الَأَيْلِيُّ كُلُّهُمْ عَنِ الزُّهْرِيِّ","english":{"narrator":"","text":"Hafsa reported God’s messenger as saying, “He who does not before dawn express his intention of fasting is not credited with it.” \n\nTirmidhi, Abu Dawud, Nasa’i and Darimi transmitted it. Abu Dawud said that Ma'mar, az-Zubaidi, Ibn ‘Uyaina and Yunus al-Aili, all of whom got it on Zuhri’s authority, traced it no farther back than Hafsa."}},{"id":32,"idInBook":32,"chapterId":7,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا سَمِعَ النِّدَاءَ أَحَدُكُمْ وَالْإِنَاءُ فِي يَدِهِ فَلَا يَضَعْهُ حَتَّى يَقْضِيَ حَاجَتَهُ مِنْهُ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “When any of you hears the summons to prayer while he has a vessel in his hand he should not lay it down till he finishes his drink.”* \n*This is interpreted as referring to the dawn prayer during Ramadan.\n\nAbu Dawud transmitted it."}},{"id":33,"idInBook":33,"chapterId":7,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" قَالَ اللَّهُ تَعَالَى: أَحَبُّ عِبَادِي إِلَيَّ أَعْجَلُهُمْ فطرا \". رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"He reported God’s messenger as stating that God Most High has said, “Those of my servants who are quickest in breaking their fast are dearest to me.” \n\nTirmidhi transmitted it."}},{"id":34,"idInBook":34,"chapterId":7,"bookId":14,"arabic":"وَعَنْ سَلْمَانَ بْنِ عَامِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا أَفْطَرَ أَحَدُكُمْ فَلْيُفْطِرْ عَلَى تَمْرٍ فَإِنَّهُ بَرَكَةٌ فَإِنْ لَمْ يَجِدْ فَلْيُفْطِرْ عَلَى مَاءٍ فَإِنَّهُ طَهُورٌ» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ. وَلَمْ يَذْكُرْ: «فَإِنَّهُ بَرَكَةٌ» غَيْرُ التِّرْمِذِيِّ","english":{"narrator":"","text":"Salman b. ‘Amir reported God’s messenger as saying, “When one of you breaks his fast he should do so with dates for they provide blessing; but if he cannot get any he should break his fast with water for it is purifying.” \n\nAhmad, Tirmidhi, Abu Dawud, Ibn Majah and Darimi transmitted it, but only Tirmidhi included “for they provide blessing.”"}},{"id":35,"idInBook":35,"chapterId":7,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُفْطِرُ قَبْلَ أَنْ يُصَلِّيَ عَلَى رطبات فَإِن لم تكن فتميرات فإنلم تكن تُمَيْرَات حسى حَسَوَاتٍ مِنْ مَاءٍ. رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ. وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ حَسَنٌ غَرِيب","english":{"narrator":"","text":"Anas said that the Prophet used to break his fast before praying with some fresh dates, but if there were no fresh dates he had a few dry dates, and if there were no dry dates he took some mouthfuls* of water.\n*Mirqat explains this as three mouthfuls, but 'three' does not occur in the text.\n\nTirmidhi and Abu Dawud transmitted it, Tirmidhi saying that this is a hasan gharib tradition."}},{"id":36,"idInBook":36,"chapterId":7,"bookId":14,"arabic":"وَعَنْ زَيْدِ بْنِ خَالِدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «من فَطَّرَ صَائِمًا أَوْ جَهَّزَ غَازِيًا فَلَهُ مِثْلُ أَجْرِهِ» . رَوَاهُ الْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَانِ وَمُحْيِي السّنة فِي شرح السّنة وَقَالَ صَحِيح","english":{"narrator":"","text":"Zaid b. Khalid reported God’s messenger as saying, ‘He who gives one who has been fasting something with which to break his fast, or who equips a fighter will have a reward equivalent to his.” \n\nBaihaqi transmitted it in Shu'ab al-iman, and Muhyi as-sunna, who said it is sahih, in Sharh as-sunna."}},{"id":37,"idInBook":37,"chapterId":7,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَفْطَرَ قَالَ: «ذَهَبَ الظَّمَأُ وَابْتَلَّتِ الْعُرُوقُ وَثَبَتَ الْأَجْرُ إِنْ شَاءَ الله» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Ibn ‘Umar told that the Prophet said when he broke his fast, “Thirst has gone, the arteries are moist, and the reward is sure, if God wills.” \n\nAbu Dawud transmitted it."}},{"id":38,"idInBook":38,"chapterId":7,"bookId":14,"arabic":"وَعَنْ مُعَاذٍ بْنِ زُهْرَةَ قَالَ: إِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا أَفْطَرَ قَالَ: «اللَّهُمَّ لَكَ صَمْتُ وَعَلَى رِزْقِكَ أَفْطَرْتُ» . رَوَاهُ أَبُو دَاوُد مُرْسلا","english":{"narrator":"","text":"Mu'adh b. Zuhra told that when the Prophet broke his fast he said, “O God, for Thee I have fasted and with Thy provision I have broken my fast.”\n\nAbu Dawud transmitted it in mursal form."}},{"id":39,"idInBook":39,"chapterId":7,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَزَالُ الدِّينُ ظَاهِرًا مَا عَجَّلَ النَّاسُ الْفِطْرَ لِأَنَّ الْيَهُودَ وَالنَّصَارَى يُؤَخِّرُونَ» . رَوَاهُ أَبُو دَاوُد وَابْن مَاجَه","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “The religion will continue to prevail as long as people hasten to break the fast, because the Jews and the Christians delay doing so.” \n\nAbu Dawud and Ibn Majah transmitted it."}},{"id":40,"idInBook":40,"chapterId":7,"bookId":14,"arabic":"وَعَنْ أَبِي عَطِيَّةَ قَالَ: دَخَلْتُ أَنَا وَمَسْرُوقٌ عَلَى عَائِشَةَ فَقُلْنَا: يَا أُمَّ الْمُؤْمِنِينَ رَجُلَانِ مِنْ أَصْحَابِ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَحَدُهُمَا يُعَجِّلُ الْإِفْطَارَ وَيُعَجِّلُ الصَّلَاةَ وَالْآخَرُ: يُؤَخِّرُ الْإِفْطَارَ وَيُؤَخِّرُ الصَّلَاةَ. قَالَتْ: أَيُّهُمَا يُعَجِّلُ الْإِفْطَارَ وَيُعَجِّلُ الصَّلَاةَ؟ قُلْنَا عَبْدُ اللَّهِ بْنُ مَسْعُودٍ. قَالَتْ: هَكَذَا صَنَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالْآخَرُ أَبُو مُوسَى. رَوَاهُ مُسْلِمٌ","english":{"narrator":"Abu ‘Atiya said:","text":"Masruq and I visited ‘A'isha and said, “Mother of the faithful, there are two of Muhammad’s companions one of whom hastens to break the fast and hastens to pray while the other delays breaking the fast and delays praying. She asked which of them hastened to break the fast and hastened to pray, and when we told her that he was ‘Abdallah b. Mas'ud she said, \"Thus did God’s messenger do.\" The other was Abu Musa. \n\nMuslim transmitted it."}},{"id":41,"idInBook":41,"chapterId":7,"bookId":14,"arabic":"وَعَنِ الْعِرْبَاضِ بْنِ سَارِيَةَ قَالَ: دَعَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى السَّحُورِ فِي رَمَضَانَ فَقَالَ: «هَلُمَّ إِلَى الْغَدَاءِ الْمُبَارَكِ» . رَوَاهُ أَبُو دَاوُد والسنائي","english":{"narrator":"","text":"Al-‘Irbad b. Sariya told that God’s messenger invited him to a meal shortly before dawn in Ramadan saying, “Come to the blessed morning meal.” \n\nAbu Dawud and Nasa’i transmitted it."}},{"id":42,"idInBook":42,"chapterId":7,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «نِعْمَ سَحُورُ الْمُؤْمِنَ التَّمْرُ» . رَوَاهُ أَبُو دَاوُدَ","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “How good is the believer’s meal of dates shortly before dawn!” \n\nAbu Dawud transmitted it."}},{"id":43,"idInBook":43,"chapterId":7,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ لَمْ يَدَعْ قَوْلَ الزُّورِ وَالْعَمَلَ بِهِ فَلَيْسَ لِلَّهِ حَاجَةٌ فِي أَنْ يَدَعَ طَعَامَهُ وَشَرَابه» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “If one does not abandon falsehood and action in accordance with it, God had no need that he should abandon his food and his drink.” \n     \nBukhari transmitted it."}},{"id":44,"idInBook":44,"chapterId":7,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُقَبِّلُ وَيُبَاشِرُ وَهُوَ صَائِمٌ وَكَانَ أَمْلَكَكُمْ لأربه","english":{"narrator":"","text":"‘A'isha said, “God’s messenger used to kiss and embrace while he was fasting, but he was the one of you who had most control over his desire.” \n\n(Bukhari and Muslim.)"}},{"id":45,"idInBook":45,"chapterId":7,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُدْرِكُهُ الْفَجْرُ فِي رَمَضَانَ وَهُوَ جُنُبٌ مِنْ غَيْرِ حُلْمٍ فَيَغْتَسِلُ وَيَصُومُ","english":{"narrator":"","text":"She said that God’s messenger would be overtaken by the dawn in Ramadan when he was in a state of sexual defilement, not owing to a dream, and would wash and fast. \n\n(Bukhari and Muslim.)"}},{"id":46,"idInBook":46,"chapterId":7,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: إِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ احْتَجَمَ وَهُوَ مُحْرِمٌ وَاحْتَجَمَ وَهُوَ صَائِمٌ","english":{"narrator":"","text":"Ibn ‘Abbas said that the Prophet had himself cupped when he was wearing the ihram and also when he was fasting. \n\n(Bukhari and Muslim.)"}},{"id":47,"idInBook":47,"chapterId":7,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «من نسي وَهُوَ صَائِم فأل أَوْ شَرِبَ فَلْيُتِمَّ صَوْمَهُ فَإِنَّمَا أَطْعَمَهُ اللَّهُ وسقاه»","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “If anyone forgets when he is fasting and eats or drinks he should complete his fast, for it is only God who has fed him and given him drink.” \n\n(Bukhari and Muslim.)"}},{"id":48,"idInBook":48,"chapterId":7,"bookId":14,"arabic":"وَعَن أبي هُرَيْرَة قَالَ: بَيْنَمَا نَحْنُ جُلُوسٌ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذْ جَاءَهُ رَجُلٌ فَقَالَ: يَا رَسُول الله هَلَكت. قَالَ: «مَالك؟» قَالَ: وَقَعْتُ عَلَى امْرَأَتِي وَأَنَا صَائِمٌ. فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «هَلْ تَجِدُ رَقَبَةً تُعْتِقُهَا؟» . قَالَ: لَا قَالَ: «فَهَلْ تَسْتَطِيعُ أَنْ تَصُومَ شَهْرَيْنِ مُتَتَابِعَيْنِ؟» قَالَ: لَا. قَالَ: «هَلْ تَجِدُ إِطْعَامَ سِتِّينَ مِسْكِينًا؟» قَالَ: لَا. قَالَ: «اجْلِسْ» وَمَكَثَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسلم فَبينا نَحْنُ عَلَى ذَلِكَ أُتِيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِعَرَقٍ فِيهِ تَمْرٌ وَالْعَرَقُ الْمِكْتَلُ الضَّخْمُ قَالَ: «أَيْنَ السَّائِلُ؟» قَالَ: أَنَا. قَالَ: «خُذْ هَذَا فَتَصَدَّقْ بِهِ» . فَقَالَ الرَّجُلُ: أَعَلَى أَفْقَرَ مِنِّي يَا رَسُولَ اللَّهِ؟ فَوَاللَّهِ مَا بَيْنَ لَابَتَيْهَا يُرِيدُ الْحَرَّتَيْنِ أَهْلُ بَيْتِ أَفْقَرُ م أَهْلِ بَيْتِي. فَضَحِكَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى بَدَتْ أَنْيَابُهُ ثُمَّ قَالَ: «أَطْعِمْهُ أهلك»","english":{"narrator":"","text":"He said that while they were sitting with the Prophet a man came to him and said, “Messenger of God, I am undone.” He asked him what had happened to him and he replied that he had had intercourse with his wife while he was fasting. God’s messenger then asked him whether he could get a slave to free, but he replied that he could not. He asked if he could fast two consecutive months, but he replied that he could not. He asked if he could provide food for sixty poor people, and when he replied that he could not, he told him to sit down. The Prophet then waited for a time, and meanwhile an ‘araq containing dates was brought to him, an ‘araq being a huge basket.* He asked where the man who had questioned him was, and when he replied, \" I am,\" he said, \"Take this and give it as sadaqa.\" The man replied, “Am I to give it to one who is poorer than I am, messenger of God? I swear by God that there is no poorer family than mine between the two lava plains of Medina,\" i.e. the two harras. The Prophet thereupon laughed so that his eye-teeth became visible and said, \"Give it to your family to eat.\"\n*In explaining the word 'araq the tradition calls it a hugh miktal. The miktal was a basket containing fifteen sa's. It is also said to have had double that capacity.\n\n(Bukhari and Muslim.)"}},{"id":49,"idInBook":49,"chapterId":7,"bookId":14,"arabic":"عَن عَائِشَة: أَن الني صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: كَانَ يُقَبِّلُهَا وَهُوَ صَائِم ويمص لسنانها. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"‘A'isha said that the Prophet used to kiss her and suck her tongue when he was fasting. \n\nAbu Dawud transmitted it.*\n*Saum, 34. This is said by some to be weak because Muhammad b. Dinar and Sa'd b. Aus\nare among its transmitters."}},{"id":50,"idInBook":50,"chapterId":7,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ إِنَّ رَجُلًا سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمُبَاشَرَةِ لِلصَّائِمِ فَرخص لَهُ. وَأَتَاهُ آخَرُ فَسَأَلَهُ فَنَهَاهُ فَإِذَا الَّذِي رَخَّصَ لَهُ شَيْخٌ وَإِذَا الَّذِي نَهَاهُ شَابٌّ. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Abu Huraira said that a man asked the Prophet whether one who was fasting might embrace his wife and he gave him permission, but when another came to him and asked him he forbade him. The one to whom he gave permission was an old man and the one whom he forbade was a youth.\n\nAbu Dawud transmitted it."}},{"id":51,"idInBook":51,"chapterId":7,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عَلَيْهِ وَسلم: «من ذرعه الْقَيْء وَهُوَ صَائِمٌ فَلَيْسَ عَلَيْهِ قَضَاءٌ وَمَنِ اسْتَقَاءَ عَمْدًا فَلْيَقْضِ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ. وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ عِيسَى بْنِ يُونُس. وَقَالَ مُحَمَّد يَعْنِي البُخَارِيّ لَا أرَاهُ مَحْفُوظًا","english":{"narrator":"","text":"He reported God’s messenger as saying, \"If one has a sudden attack of vomiting while he is fasting no atonement is required of him, but if he vomits intentionally he must make atonement.\"\n\nTirmidhi, Abu Dawud, Ibn Majah and Darimi transmitted it. Tirmidhi said this is a gharib tradition which he knew only among the traditions of ‘Isa. b. Yunus, and that Muhammad, i.e. Bukhari, said he did not consider it one which was held in estimation."}},{"id":52,"idInBook":52,"chapterId":7,"bookId":14,"arabic":"وَعَنْ مَعْدَانَ بْنِ طَلْحَةَ أَنَّ أَبَا الدَّرْدَاءِ حَدَّثَهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَاءَ فَأَفْطَرَ. قَالَ: فَلَقِيتُ ثَوْبَانَ فِي مَسْجِدِ دِمَشْقَ فَقُلْتُ: إِنَّ أَبَا الدَّرْدَاءِ حَدَّثَنِي أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَاءَ فَأَفْطَرَ. قَالَ: صَدَقَ وَأَنَا صَبَبْتُ لَهُ وضوءه. رَوَاهُ أَبُو دَاوُد وَالتِّرْمِذِيّ والدارمي","english":{"narrator":"","text":"Ma'dan b. Talha said Abu Darda’ told him that God’s messenger vomited and broke his fast. He said that he met Thauban in the mosque of Damascus, and when he remarked that Abu Darda’ told him that God’s messenger vomited and broke his fast he said, \"He spoke the truth; and I was the one who poured out the water for his ablution.\"\n\nAbu Dawud, Tirmidhi and Darimi transmitted it."}},{"id":53,"idInBook":53,"chapterId":7,"bookId":14,"arabic":"وَعَنْ عَامِرِ بْنِ رَبِيعَةَ قَالَ: رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا لَا أُحْصِي يَتَسَوَّكُ وَهُوَ صَائِمٌ \". رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ","english":{"narrator":"","text":"‘Amir b. Rabi'a said he had seen the Prophet more often than he could count using a toothstick while he was fasting. \n\nTirmidhi and Abu Dawud transmitted it."}},{"id":54,"idInBook":54,"chapterId":7,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: جَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \" اشتكيت عَيْني أَفَأَكْتَحِلُ وَأَنَا صَائِمٌ؟ قَالَ: «نَعَمْ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: لَيْسَ إِسْنَادُهُ بِالْقَوِيِّ وَأَبُو عَاتِكَةَ الرَّاوِي يضعف","english":{"narrator":"","text":"Anas told of a man coming to the Prophet and saying, “I have a complaint in my eyes, so may I apply collyrium while I am fasting?” He replied, “Yes.” \n\nTirmidhi transmitted it, saying its isnad is not strong and Abu ‘Atika the transmitter is declared to be weak."}},{"id":55,"idInBook":55,"chapterId":7,"bookId":14,"arabic":"وَعَنْ بَعْضِ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: لَقَدْ رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْعَرْجِ يَصُبُّ عَلَى رَأْسِهِ الْمَاءَ وَهُوَ صَائِمٌ مِنَ الْعَطَشِ أَوْ مِنَ الْحَرِّ. رَوَاهُ مَالك","english":{"narrator":"","text":"One of the Prophet’s companions said he had seen the Prophet in al-'Arj* pouring water over his head while he was fasting; either because of thirst or because of the heat. \n*A wadi in the neighbourhood of at-Ta’if.\n\nMalik and Abu Dawud transmitted it."}},{"id":56,"idInBook":56,"chapterId":7,"bookId":14,"arabic":"وَعَنْ شَدَّادِ بْنِ أَوْسٍ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَى رَجُلًا بِالْبَقِيعِ وَهُوَ يَحْتَجِمُ وَهُوَ آخِذٌ بِيَدِي لِثَمَانِيَ عَشْرَةَ خَلَتْ مِنْ رَمَضَانَ فَقَالَ: «أَفْطَرَ الْحَاجِمُ وَالْمَحْجُومُ» . رَوَاهُ أَبُو دَاوُدَ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ. قَالَ الشَّيْخُ الْإِمَامُ مُحْيِي السُّنَّةِ رَحِمَهُ اللَّهُ عَلَيْهِ: وَتَأَوَّلَهُ بَعْضُ مَنْ رَخَّصَ فِي الْحِجَامَةِ: أَيْ تَعَرُّضًا لِلْإِفْطَارِ: الْمَحْجُومُ لِلضَّعْفِ وَالْحَاجِمُ لِأَنَّهُ لَا يَأْمَنُ مِنْ أَنْ يَصِلَ شَيْءٌ إِلَى جَوْفِهِ بمص الملازم","english":{"narrator":"","text":"Shaddad b. Aus said that when God’s messenger was walking hand in hand with him on the eighteenth of Ramadan he came across a man in al-Baqi who was being cupped and said, “The one who cups and the one who is cupped have broken their fast.” \n\nAbu Dawud, Ibn Majah and Darimi transmitted it. The shaikh and imam Muhyi as-sunna said that some of those who allow cupping have interpreted it as meaning that they exposed themselves to the danger of breaking the fast, the one who was cupped on account of weakness, and the one who did the cupping because he could not guarantee that something would not get into his stomach by sucking the flask."}},{"id":57,"idInBook":57,"chapterId":7,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ أَفْطَرَ يَوْمًا مِنْ رَمَضَانَ مِنْ غَيْرِ رُخْصَةٍ وَلَا مَرَضٍ لَمْ يَقْضِ عَنْهُ صَوْمُ الدَّهْرِ كُلِّهِ وَإِنْ صَامَهُ» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ وَالْبُخَارِيُّ فِي تَرْجَمَةِ بَابٍ وَقَالَ التِّرْمِذِيُّ: سَمِعْتُ مُحَمَّدًا يَعْنِي البُخَارِيّ يَقُول. أَبُو المطوس الرَّاوِي لَا أَعْرِفُ لَهُ غَيْرَ هَذَا الْحَدِيثِ","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “If anyone breaks his fast one day in Ramadan without a concession* or without being ill, a perpetual fast will not atone for it even if he observes it.” \n*e.g. while travelling.\n\nAhmad, Tirmidhi, Abu Dawud, Ibn Majah, Darimi and Bukhari in a chapter heading transmitted it. Tirmidhi said that he heard Muhammad, i.e. Bukhari, say this was the only tradition he knew by Abul Mutawwis the transmitter."}},{"id":58,"idInBook":58,"chapterId":7,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «كَمْ مِنْ صَائِمٍ لَيْسَ لَهُ مِنْ صِيَامِهِ إِلَّا الظَّمَأُ وَكَمْ مِنْ قَائِمٍ لَيْسَ لَهُ من قِيَامه إِلَّا السهر» . رَوَاهُ الدَّارمِيّ","english":{"narrator":"","text":"He reported God’s messenger as saying, “Many a one who fasts gets nothing from his fasting but thirst, and many a one who prays\nduring the night gets nothing from his night prayers but wakefulness.”\n\nDarimi transmitted it. The tradition of Laqit b. Sabira has been mentioned in the chapter on how to perform ablution. "}},{"id":59,"idInBook":59,"chapterId":7,"bookId":14,"arabic":"عَنْ أَبِي سَعِيدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «ثَلَاثٌ لَا يُفْطِرْنَ الصَّائِمَ الْحِجَامَةُ وَالْقَيْءُ وَالِاحْتِلَامُ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ غَيْرُ مَحْفُوظٍ وَعَبْدُ الرَّحْمَنِ بْنُ زيد الرَّاوِي يضعف فِي الحَدِيث","english":{"narrator":"Abu Sa'id al-Khudri reported God’s messenger as saying, “Three things do not break the fast of one who is fasting:","text":"cupping, vomiting, and a nocturnal emission.” \n\nTirmidhi transmitted it saying this is a tradition which is not regarded, its transmitter ‘Abd ar-Rahman b. Zaid being declared a weak traditionist."}},{"id":60,"idInBook":60,"chapterId":7,"bookId":14,"arabic":"وَعَنْ ثَابِتٍ الْبُنَانِيِّ قَالَ: سُئِلَ أَنَسُ بْنُ مَالِكٍ: كُنْتُمْ تَكْرَهُونَ الْحِجَامَةَ لِلصَّائِمِ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ؟ قَالَ: لَا إِلَّا مِنْ أَجْلِ الضَّعْفِ. رَوَاهُ الْبُخَارِيُّ","english":{"narrator":"","text":"Thabit al-Bunani said that when Anas b. Malik was asked whether they disapproved of cupping for one who was fasting in the time of God’s messenger he replied, “No, except if it had a weakening effect.”\n\nBukhari transmitted it."}},{"id":61,"idInBook":61,"chapterId":7,"bookId":14,"arabic":"وَعَنِ الْبُخَارِيِّ تَعْلِيقًا قَالَ: كَانَ ابْنُ عُمَرَ يَحْتَجِمُ وَهُوَ صَائِمٌ ثُمَّ تَرَكَهُ فَكَانَ يَحْتَجِمُ بِاللَّيْلِ","english":{"narrator":"","text":"Bukhari said without a complete isnad that Ibn ‘Umar used to have himself cupped whan he was fasting. Then he abandoned it and had himself cupped at night."}},{"id":62,"idInBook":62,"chapterId":7,"bookId":14,"arabic":"وَعَن عَطاء قَالَ: إِن مضمض ثُمَّ أَفْرَغَ مَا فِي فِيهِ مِنَ الْمَاءِ لَا يضيره أَنْ يَزْدَرِدَ رِيقَهُ وَمَا بَقِيَ فِي فِيهِ وَلَا يَمْضُغُ الْعِلْكَ فَإِنِ ازْدَرَدَ رِيقَ الْعِلْكَ لَا أَقُولُ: إِنَّهُ يُفْطِرُ وَلَكِنْ يُنْهَى عَنْهُ. رَوَاهُ الْبُخَارِيُّ فِي تَرْجَمَةِ بَابٍ","english":{"narrator":"","text":"‘Ata’ said, “If one rinses his mouth and ejects the water in it, swallowing his saliva and anything that remains in it does him no harm; but one should not chew gum, for although I do not say that he breaks his fast  he swallows the saliva produced by the gum, he is nevertheless prohibited from doing it.” \n\nBukhari transmitted it in a chapter heading."}},{"id":63,"idInBook":63,"chapterId":7,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: إِنَّ حَمْزَةَ بْنَ عَمْرٍو الْأَسْلَمِيَّ قَالَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَصُومُ فِي السَّفَرِ وَكَانَ كَثِيرَ الصِّيَامِ. فَقَالَ: «إِنْ شِئْتَ فَصم وَإِن شِئْت فَأفْطر»","english":{"narrator":"","text":"‘A'isha said that Hamza b. ‘Amr al-Aslami who was greatly devoted to fasting asked the Prophet whether he should fast when on a journey, and received the reply, “Fast if you like, or break your fast if you like.” \n\n(Bukhari and Muslim.)"}},{"id":64,"idInBook":64,"chapterId":7,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: غَزَوْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَسِتَّ عَشْرَةَ مَضَتْ مِنْ شَهْرِ رَمَضَانَ فَمِنَّا مَنْ صَامَ وَمِنَّا مَنْ أَفْطَرَ فَلَمْ يَعِبِ الصَّائِمُ عَلَى الْمُفْطِرِ وَلَا الْمُفْطِرُ عَلَى الصَّائِمِ. رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Sa'id al-Khudri said that when they went out on an expedition with God’s messenger on the sixteenth of Ramadan some fasted and some broke their fast, but neither party found fault with the other. \n\nMuslim transmitted it."}},{"id":65,"idInBook":65,"chapterId":7,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ فَرَأَى زِحَامًا وَرَجُلًا قَدْ ظُلِّلَ عَلَيْهِ فَقَالَ: «مَا هَذَا؟» قَالُوا: صَائِمٌ. فَقَالَ: «لَيْسَ مِنَ الْبِرِّ الصَّوْمُ فِي السَّفَرِ»","english":{"narrator":"","text":"Jabir said that in the course of a journey God’s messenger saw a crowd and a man who had been put in the shade. On asking the reason and being told that he was fasting he said, “Fasting while on a journey is not a part of righteousness.” \n\n(Bukhari and Muslim.)"}},{"id":66,"idInBook":66,"chapterId":7,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: كُنَّا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي السَّفَرِ فَمِنَّا الصَّائِمُ وَمِنَّا الْمُفْطِرُ فَنَزَلْنَا مَنْزِلًا فِي وم حَارٍّ فَسَقَطَ الصَّوَّامُونَ وَقَامَ الْمُفْطِرُونَ فَضَرَبُوا الْأَبْنِيَةَ وَسَقَوُا الرِّكَابَ. فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «ذَهَبَ الْمُفْطِرُونَ الْيَوْمَ بِالْأَجْرِ»","english":{"narrator":"","text":"Anas said that in the course of a journey with the Prophet when some of them were fasting and others broke their fast, they alighted at a stage on a hot day, and while those who fasted collapsed those who had broken their fast rose and set up the tents and watered the riding-beasts, whereupon God's messenger said, “Those who broke their fast have earned all the reward today.” \n\n(Bukhari and Muslim.)"}},{"id":67,"idInBook":67,"chapterId":7,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ الْمَدِينَةِ إِلَى مَكَّةَ فَصَامَ حَتَّى بَلَغَ عُسْفَانَ ثُمَّ دَعَا بِمَاءٍ فَرَفَعَهُ إِلَى يَدِهِ لِيَرَاهُ النَّاسُ فَأَفْطَرَ حَتَّى قَدِمَ مَكَّةَ وَذَلِكَ فِي رَمَضَانَ. فَكَانَ ابْنُ عَبَّاسٍ يَقُولُ: قَدْ صَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَفْطَرَ. فَمن شَاءَ صَامَ وَمن شَاءَ أفطر \"\nوَفِي رِوَايَة لمُسلم عَن جَابر رَضِي الله عَنهُ أَنه شرب بعد الْعَصْر","english":{"narrator":"","text":"Ibn ‘Abbas said God's messenger left Medina to go to Mecca and fasted till he reached ‘Usfan. He then called for water, and raising it aloft so that the people might see it, he broke his fast and did not resume it till he reached Mecca, and that was in Ramadan. Ibn ‘Abbas used to say, “God’s messenger has fasted and has broken his fast, so he who wishes may fast and he who wishes may break his fast.” \n\n(Bukhari and Muslim.) \nIn a version by Muslim from Jabir it says that he drank after the afternoon prayer."}},{"id":68,"idInBook":68,"chapterId":7,"bookId":14,"arabic":"عَنْ أَنَسِ بْنِ مَالِكٍ الْكَعْبِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «إِن اللَّهَ وَضَعَ عَنِ الْمُسَافِرِ شَطْرَ الصَّلَاةِ وَالصَّوْمَ عَنِ الْمُسَافِرِ وَعَنِ الْمُرْضِعِ وَالْحُبْلَى» . رَوَاهُ أَبُو دَاوُدَ وَالتِّرْمِذِيُّ وَالنَّسَائِيُّ وَابْنُ مَاجَهْ","english":{"narrator":"","text":"Anas b. Malik al-Ka‘bi reported God’s messenger as saying, “God has remitted half the prayer to the traveller, and fasting to the traveller, the woman who is suckling an infant and the woman who is pregnant.” \n\nAbu Dawud, Tirmidhi, Nasa’i and Ibn Majah transmitted it."}},{"id":69,"idInBook":69,"chapterId":7,"bookId":14,"arabic":"وَعَنْ سَلَمَةَ بْنِ الْمُحَبَّقِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ كَانَ لَهُ حَمُولَةٌ تَأْوِي إِلَى شِبْعٍ فَلْيَصُمْ رَمَضَانَ من حَيْثُ أدْركهُ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Salama b. al-Muhabbiq reported God’s messenger as saying, “If anyone has a riding-beast which carries him to where he can get sufficient food he should observe the fast of Ramadan wherever he is when it comes.” \n\nAbu Dawud transmitted it."}},{"id":70,"idInBook":70,"chapterId":7,"bookId":14,"arabic":"عَنْ جَابِرٍ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ عَامَ الْفَتْحِ إِلَى مَكَّةَ فِي رَمَضَانَ فَصَامَ حَتَّى بَلَغَ كُرَاعَ الْغَمِيمِ فَصَامَ النَّاسُ ثُمَّ دَعَا بِقَدَحٍ مِنْ مَاءٍ فَرَفَعَهُ حَتَّى نَظَرَ النَّاسُ إِلَيْهِ ثُمَّ شَرِبَ فَقِيلَ لَهُ بَعْدَ ذَلِكَ إِنَّ بَعْضَ النَّاسِ قَدْ صَامَ. فَقَالَ: «أُولَئِكَ الْعُصَاةُ أُولَئِكَ الْعُصَاةُ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Jabir said that God’s messenger went off to Mecca in Ramadan in the year of the Conquest, and he and the people fasted till he came to Kura' al-Ghamim.* He then called for a cup of water which he raised till the people looked at it, and then he drank. He was told afterwards that some of the people had continued to fast, and said, “Those are the disobedient ones; those are the disobedient ones.” \n*A wadi two stages from Mecca on the way to Medina.\n\nMuslim transmitted it."}},{"id":71,"idInBook":71,"chapterId":7,"bookId":14,"arabic":"وَعَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «صَائِمُ رَمَضَانَ فِي السَّفَرِ كَالْمُفْطِرِ فِي الْحَضَرِ» . رَوَاهُ ابْن مَاجَه","english":{"narrator":"","text":"‘Abd ar-Rahman b. ‘Auf reported God’s messenger as saying, “One who fasts in Ramadan while travelling is like one who breaks his fast when not travelling.” \n\nIbn Majah transmitted it."}},{"id":72,"idInBook":72,"chapterId":7,"bookId":14,"arabic":"وَعَن حَمْزَة بن عَمْرو السّلمِيّ أَنَّهُ قَالَ: يَا رَسُولَ اللَّهِ إِنِّي أَجِدُ بِي قُوَّةً عَلَى الصِّيَامِ فِي السَّفَرِ فَهَلْ عَلَيَّ جُنَاحٌ؟ قَالَ: «هِيَ رُخْصَةٌ مِنَ اللَّهِ عَزَّ وَجَلَّ فَمَنْ أَخَذَ بِهَا فَحَسَنٌ وَمَنْ أَحَبَّ أَنْ يَصُومَ فَلَا جُنَاحَ عَلَيْهِ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Hamza b. ‘Amr al-Aslami told God’s messenger that he found himself strong enough to fast while travelling and asked whether it would be wrong for him to do so. He was told that licence had been given by God who is great and glorious, so that if anyone acted upon this he did well, but if anyone wished to fast he would not be guilty of sin. \n\nMuslim transmitted it."}},{"id":73,"idInBook":73,"chapterId":7,"bookId":14,"arabic":"عَنْ عَائِشَةَ قَالَتْ: كَانَ يَكُونُ عَلَيَّ الصَّوْمُ مِنْ رَمَضَانَ فَمَا أَسْتَطِيعُ أَنْ أَقْضِيَ إِلَّا فِي شَعْبَانَ. قَالَ يَحْيَى بْنُ سَعِيدٍ: تَعْنِي الشّغل من النَّبِي أَو بِالنَّبِيِّ صلى الله عَلَيْهِ وَسلم","english":{"narrator":"","text":"‘A'isha said that when she had some part of the fast of Ramadan to make up she would be able to do so only in Sha'ban. Yahya b. Sa'id said she meant this was due to her being kept from it by her duty to the Prophet. \n\n(Bukhari and Muslim.)"}},{"id":74,"idInBook":74,"chapterId":7,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَحِلُّ لِلْمَرْأَةِ أَنْ تَصُومَ وَزَوْجُهَا شَاهِدٌ إِلَّا بِإِذْنِهِ وَلَا تَأْذَنَ فِي بَيْتِهِ إِلَّا بِإِذْنِهِ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “It is not allowable for a woman to fast when her husband is present without his permission,* and she may not allow anyone to enter his house without his permission.” \n*This refers not to Ramadan, but to a supererogatory fast.\n\nMuslim transmitted it."}},{"id":75,"idInBook":75,"chapterId":7,"bookId":14,"arabic":"وَعَنْ مُعَاذَةَ الْعَدَوِيَّةِ أَنَّهَا قَالَتْ لِعَائِشَةَ: مَا بَالُ الْحَائِضِ تَقْضِي الصَّوْمَ وَلَا تَقْضِي الصَّلَاةَ؟ قَالَتْ عَائِشَةُ: كَانَ يُصِيبُنَا ذَلِكَ فَنُؤْمَرُ بِقَضَاءِ الصَّوْمِ وَلَا نُؤْمَرُ بِقَضَاءِ الصَّلَاةِ. رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"Mu'adha al-‘Adawiya said that when she asked ‘A'isha why one who has been menstruating must make up for her fast but not for her prayer, she replied, “That happened to us, and we were ordered to make up for the fast, but were not ordered to make up for the prayer.” \n\nMuslim transmitted it."}},{"id":76,"idInBook":76,"chapterId":7,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ مَاتَ وَعَلَيْهِ صَوْمٌ صَامَ عَنْهُ وليه»","english":{"narrator":"","text":"‘A'isha reported God’s messenger as saying, “If anyone dies when some fast due from him has been unfulfilled, his heir must fast on his behalf.” \n\n(Bukhari and Muslim.)"}},{"id":77,"idInBook":77,"chapterId":7,"bookId":14,"arabic":"عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ مَاتَ وَعَلَيْهِ صِيَامُ شَهْرِ رَمَضَانَ فَلْيُطْعَمْ عَنْهُ مَكَانَ كُلِّ يَوْمٍ مِسْكِينٌ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: وَالصَّحِيحُ أَنه مَوْقُوف على ابْن عمر","english":{"narrator":"","text":"Nafi‘, on Ibn ‘Umar’s authority, reported the Prophet as saying, “If anyone dies when fasting in the month of Ramadan has been unfulfilled by him, a poor man should be fed on his behalf in place of every day.” \n\nTirmidhi transmitted it, saying that correctly this goes no farther back than Ibn ‘Umar."}},{"id":78,"idInBook":78,"chapterId":7,"bookId":14,"arabic":"عَنْ مَالِكٍ بَلَغَهُ أَنَّ ابْنَ عُمَرَ كَانَ يُسْأَلُ: هَلْ يَصُومُ أَحَدٌ عَنْ أَحَدٍ أَوْ يُصَلِّي أَحَدٌ عَنْ أَحَدٍ؟ فَيَقُولُ: لَا يَصُومُ أَحَدٌ عَنْ أَحَدٍ. وَلَا يُصَلِّي أَحَدٌ عَنْ أحد. رَوَاهُ فِي الْمُوَطَّأ","english":{"narrator":"","text":"Malik said he heard that Ibn ‘Umar used to be asked whether one might fast or pray on behalf of another, and reply, “One may neither fast nor pray on behalf of another.” \n\nHe transmitted it in al-Muwatta’."}},{"id":79,"idInBook":79,"chapterId":7,"bookId":14,"arabic":"عَنْ عَائِشَةَ قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ حَتَّى نَقُولَ: لَا يُفْطِرُ وَيُفْطِرُ حَتَّى نَقُولَ: لَا يَصُومُ وَمَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْتكْمل صِيَام شهر قطّ إِلَّا رَمَضَانَ وَمَا رَأَيْتُهُ فِي شَهْرٍ أَكْثَرَ مِنْهُ صِيَامًا فِي شَعْبَانَ\nوَفِي رِوَايَةٍ قَالَتْ: كَانَ يَصُوم شعْبَان كُله وَكن يَصُوم شعْبَان إِلَّا قَلِيلا","english":{"narrator":"","text":"‘A'isha said, \"God’s messenger used to fast to such an extent that we thought he would never break his fast, and he would go without fasting to such an extent that we thought he would never fast. I never saw God’s messenger fast a complete month except in Ramadan, and I never saw him fast more in any month than in Sha'ban.\" In a version she said he used to fast the whole of Sha'ban, i.e. he would fast all but a little of Sha'ban. \n\n(Bukhari and Muslim.)"}},{"id":80,"idInBook":80,"chapterId":7,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ قَالَ: قُلْتُ لِعَائِشَةَ: أَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُوم شهرا كُله؟ قَالَ: مَا عَلِمْتُهُ صَامَ شَهْرًا كُلَّهُ إِلَّا رَمَضَانَ وَلَا أَفْطَرَهُ كُلَّهُ حَتَّى يَصُومَ مِنْهُ حَتَّى مضى لسبيله. رَوَاهُ مُسلم","english":{"narrator":"","text":"‘Abdallah b. Shaqiq said that when he asked ‘A'isha whether the Prophet used to fast a whole month she replied, \"I never knew him to fast a whole month except Ramadan, nor to refrain from fasting some part of every month till he died.\" \n\nMuslim transmitted it."}},{"id":81,"idInBook":81,"chapterId":7,"bookId":14,"arabic":"وَعَنْ عِمْرَانَ بْنِ حُصَيْنٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أَنَّهُ سَأَلَهُ أَوْ سَأَلَ رَجُلًا وَعِمْرَانَ يَسْمَعُ فَقَالَ: «يَا أَبَا فُلَانٍ أَمَا صُمْتَ مِنْ سَرَرِ شَعْبَانَ؟» قَالَ: لَا قَالَ: «فَإِذَا أَفْطَرْتَ فَصُمْ يَوْمَيْنِ»","english":{"narrator":"","text":"‘Imran b. Husain said that the Prophet asked him, or that he asked a man in ‘Imran’s hearing, “Father of so and so, did you not fast the last day of Sha'ban?\" When, he replied that he had not, he said, “If you did not observe a fast, you must fast for two days.\"* \n*To reconcile this tradition with that of Abu Huraira at the foot of p.420 it is suggested that the man had made a vow to observe this fast, or that it was his custom.\n\n(Bukhari and Muslim.)"}},{"id":82,"idInBook":82,"chapterId":7,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَفْضَلُ الصِّيَامِ بَعْدَ رَمَضَانَ شَهْرُ اللَّهِ الْمُحَرَّمِ وَأَفْضَلُ الصَّلَاةِ بَعْدَ الْفَرِيضَةِ صَلَاةُ اللَّيْلِ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “The most excellent fast after Ramadan is in God’s month al-Muharram, and the most excellent prayer after what is prescribed is prayer during the night.\"\n\nMuslim transmitted it."}},{"id":83,"idInBook":83,"chapterId":7,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: مَا رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَحَرَّى صِيَامَ يَوْمٍ فَضَّلَهُ عَلَى غَيْرِهِ إِلَّا هَذَا الْيَوْمَ: يَوْمَ عَاشُورَاءَ وَهَذَا الشَّهْرُ يَعْنِي شَهْرَ رَمَضَان","english":{"narrator":"","text":"Ibn ‘Abbas said, \"I never saw the Prophet singling out any day’s fast and considering it more excellent than another, except this day, the day of ‘Ashura’,* and this month, meaning the month of Ramadan.\"\n*The 10th of Muharram.\n\n(Bukhari and Muslim.)"}},{"id":84,"idInBook":84,"chapterId":7,"bookId":14,"arabic":"وَعَن ابْنِ عَبَّاسٍ قَالَ: حِينَ صَامَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ عَاشُورَاءَ وَأَمَرَ بِصِيَامِهِ قَالُوا: يَا رَسُولَ اللَّهِ إِنَّهُ يَوْمٌ يُعَظِّمُهُ الْيَهُودُ وَالنَّصَارَى. فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَئِنْ بَقِيتُ إِلَى قَابِلٍ لأصومن التَّاسِع» . رَوَاهُ مُسلم","english":{"narrator":"","text":"He said that when God’s messenger fasted on the day of ‘Ashura’ and commanded that it should be observed as a fast, he was told it was a day held in honour by Jews and Christians, and said, “If I am spared till next year I shall fast on the ninth.” \n\nMuslim transmitted it."}},{"id":85,"idInBook":85,"chapterId":7,"bookId":14,"arabic":"وَعَنْ أُمِّ الْفَضْلِ بِنْتِ الْحَارِثِ: أَنَّ نَاسًا تَمَارَوْا عِنْدَهَا يَوْمَ عَرَفَةَ فِي صِيَامِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ بَعْضُهُمْ: هُوَ صَائِمٌ وَقَالَ بَعْضُهُمْ: لَيْسَ بِصَائِمٍ فَأَرْسَلْتُ إِلَيْهِ بقدح لبن وَهُوَ وَاقِف عل بعيره بِعَرَفَة فشربه","english":{"narrator":"","text":"Umm al-Fadl daughter of al-Harith said that on the day of 'Arafa some people near her argued about whether God’s messenger was fasting, some saying that he was and others saying that he was not. She therefore sent him a cup of milk while he was observing the halt at ‘Arafa on his camel, and he drank it. \n\n(Bukhari and Muslim.)"}},{"id":86,"idInBook":86,"chapterId":7,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: مَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَائِما فِي الْعشْر قطّ. رَوَاهُ مُسلم","english":{"narrator":"","text":"‘A'isha said she never saw God’s messenger fasting during the first ten days of Dhul Hijja. \n\nMuslim transmitted it."}},{"id":87,"idInBook":87,"chapterId":7,"bookId":14,"arabic":"وَعَنْ أَبِي قَتَادَةَ: أَنَّ رَجُلًا أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ كَيْفَ تَصُومُ فَغَضِبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ قَوْله. فَلَمَّا رأى عمر رَضِي الله عَنْهُم غَضَبَهُ قَالَ رَضِينَا بِاللَّهِ رَبًّا وَبِالْإِسْلَامِ دِينًا وَبِمُحَمَّدٍ نَبِيًّا نَعُوذُ بِاللَّهِ مِنْ غَضَبِ اللَّهِ وَغَضب رَسُوله فَجعل عمر رَضِي الله عَنْهُم يُرَدِّدُ هَذَا الْكَلَامَ حَتَّى سَكَنَ غَضَبُهُ فَقَالَ عمر يَا رَسُول الله كَيفَ بِمن يَصُومُ الدَّهْرَ كُلَّهُ قَالَ: «لَا صَامَ وَلَا أَفْطَرَ» . أَوْ قَالَ: «لَمْ يَصُمْ وَلَمْ يُفْطِرْ» . قَالَ كَيْفَ مَنْ يَصُومُ يَوْمَيْنِ وَيُفْطِرُ يَوْمًا قَالَ: «وَيُطِيقُ ذَلِكَ أَحَدٌ» . قَالَ كَيْفَ مَنْ يَصُوم يَوْمًا وَيفْطر يَوْمًا قَالَ: «ذَاك صَوْم دَاوُد عَلَيْهِ السَّلَام» قَالَ كَيْفَ مَنْ يَصُومُ يَوْمًا وَيُفْطِرُ يَوْمَيْنِ قَالَ: «وَدِدْتُ أَنِّي طُوِّقْتُ ذَلِكَ» . ثُمَّ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «ثَلَاث مِنْ كُلِّ شَهْرٍ وَرَمَضَانُ إِلَى رَمَضَانَ فَهَذَا صِيَامُ الدَّهْرِ كُلِّهِ صِيَامُ يَوْمِ عَرَفَةَ أَحْتَسِبُ عَلَى اللَّهِ أَنْ يُكَفِّرَ السَّنَةَ الَّتِي قَبْلَهُ وَالسَّنَةَ الَّتِي بَعْدَهُ وَصِيَامُ يَوْمِ عَاشُورَاءَ أَحْتَسِبُ عَلَى اللَّهِ أَنْ يُكَفِّرَ السَّنَةَ الَّتِي قَبْلَهُ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Qatada said that when a man came to the Prophet and asked him how he fasted, he was angry at what he said, and when 'Umar observed his anger he said, “We are satisfied with God as Lord, with Islam as religion and with Muhammad as Prophet. We seek refuge in God from the anger of God and His messenger.” ‘Umar kept on repeating these words till his anger calmed down, then asked, “Messenger of God, what is the position of one who observes a perpetual fast?” He replied, “May he not fast or break his fast!” or he said, “He has neither fasted nor broken his fast.” He asked, “What is the position of one who fasts two days out of every three?” and received the reply, “Is anyone able to do that?” He asked what was the position of one who fasted every second day and was told that was the fast David observed. He asked what was the position of one who fasted one day out of every three, and God’s messenger replied, “I wish I were given power to observe that.” Thereafter he said, “The observance of three days’ fast every month and of Ramadan every year is a perpetual fast. I seek from God that fasting on the day of ‘Arafa may atone for the sins of the preceding and the coming year, and I seek from God that fasting on the day of ‘Ashura’ may atone for the sins of the preceding year.” \n\nMuslim transmitted it."}},{"id":88,"idInBook":88,"chapterId":7,"bookId":14,"arabic":"وَعَن أَبِي قَتَادَةَ قَالَ: سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ صَوْمِ الِاثْنَيْنِ فَقَالَ: «فِيهِ وُلِدْتُ وَفِيهِ أُنْزِلَ عَلَيَّ» . رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"He said that when God’s messenger was asked about fasting on Monday he said, “On it I was born and on it the revelation was first sent down to me.”* \n*The meaning seems to be that as this day is so distinguished, one could not choose a better one.\n\nMuslim transmitted it."}},{"id":89,"idInBook":89,"chapterId":7,"bookId":14,"arabic":"وَعَنْ مُعَاذَةَ الْعَدَوِيَّةِ أَنَّهَا سَأَلَتْ عَائِشَةَ: أَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ مِنْ كُلِّ شَهْرٍ ثَلَاثَةَ أَيَّامٍ؟ قَالَتْ: نَعَمْ فَقُلْتُ لَهَا: مِنْ أَيِّ أَيَّامِ الشَّهْرِ كَانَ يَصُومُ؟ قَالَتْ: لَمْ يَكُنْ يُبَالِي مِنْ أَيِّ أَيَّام الشَّهْر يَصُوم. رَوَاهُ مُسلم","english":{"narrator":"","text":"Mu'adha al-‘Adawiya said she asked ‘A'isha whether God’s messenger used to fast three days every month, and she replied that he did. She asked which days in the month he fasted, and she replied that he did not care which days of the month he fasted. \n\nMuslim transmitted it."}},{"id":90,"idInBook":90,"chapterId":7,"bookId":14,"arabic":"وَعَنْ أَبِي أَيُّوبَ الْأَنْصَارِيِّ أَنَّهُ حَدَّثَهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ صَامَ رَمَضَانَ ثُمَّ أَتْبَعَهُ سِتًّا مِنْ شَوَّال كَانَ كصيام الدَّهْر» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Ayyub al-Ansari told that God’s messenger said, “If anyone fasts during Ramadan, then follows it with six days in Shawwal, it will be like a perpetual fast.” \n\nMuslim transmitted it."}},{"id":91,"idInBook":91,"chapterId":7,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ صَوْمِ يَوْمِ الْفِطْرِ وَالنَّحْرِ","english":{"narrator":"","text":"Abu Sa'id al-Khudri said God’s messenger forbade fasting on the day of breaking the fast of Ramadan and on the day of sacrifice.\n\n(Bukhari and Muslim.)"}},{"id":92,"idInBook":92,"chapterId":7,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" لَا صَوْم فِي يَوْمَيْنِ: الْفطر وَالضُّحَى \"","english":{"narrator":"","text":"He reported God’s messenger as saying, “No fast is to be observed on two days, al-Fitr and al-Adha.* \n*In this tradition I have used the Arabic words, but have translated them in the preceding tradition. In the preceding tradition an-nahr is used where al-Adha is used here. Al-Adha means literally the victims.\n\n(Bukhari and Muslim.)"}},{"id":93,"idInBook":93,"chapterId":7,"bookId":14,"arabic":"وَعَنْ نُبَيْشَةَ الْهُذَلِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَيَّامُ التَّشْرِيقِ أَيَّامُ أكل وَشرب وَذكر الله» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Nubaisha al-Hudhali reported God’s messenger as saying, “The days of at-tashriq* are days of eating, drinking, and remembrance of God.” \n*The three days after the sacrifice on the tenth of Dhul Hijja. The name is said to have been given because the flesh of the victims is cut into strips and put in the sun to dry; but other explanations are also given.\n\nMuslim transmitted it."}},{"id":94,"idInBook":94,"chapterId":7,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَصُومُ أَحَدُكُمْ يَوْمَ الْجُمُعَةِ إِلَّا أَن بِصَوْم قبله أَو بِصَوْم بعده»","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying. “None of you must fast on a Friday unless he fasts the day before or the day after.”\n\n(Bukhari and Muslim.)"}},{"id":95,"idInBook":95,"chapterId":7,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَخْتَصُّوا لَيْلَةَ الْجُمُعَةِ بِقِيَامٍ مِنْ بَيْنِ اللَّيَالِي وَلَا تَخْتَصُّوا يَوْمَ الْجُمُعَةِ بِصِيَامٍ مِنْ بَيْنِ الْأَيَّامِ إِلَّا أَنْ يَكُونَ فِي صَوْمٍ يَصُومهُ أحدكُم» . رَوَاهُ مُسلم","english":{"narrator":"","text":"He reported God’s messenger as saying, “Do not choose Thursday night as a particular night for prayer, and do not choose Friday as a particular day for fasting, unless it occurs during a fast one of you is observing.” \n\nMuslim transmitted it."}},{"id":96,"idInBook":96,"chapterId":7,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ صَامَ يَوْمًا فِي سَبِيلِ اللَّهِ بَعَّدَ اللَّهُ وَجْهَهُ عَنِ النَّارِ سَبْعِينَ خَرِيفًا»","english":{"narrator":"","text":"Abu Sa‘id al-Khudri reported God’s messenger as saying, “If anyone fasts for a day while engaged in jihad, God will remove him* seventy years’ distance from hell.” \n*Literally, ‘his face’. \n\n(Bukhari and Muslim.)"}},{"id":97,"idInBook":97,"chapterId":7,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو بْنِ الْعَاصِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَا عَبْدَ اللَّهِ أَلَمْ أُخْبَرْ أَنَّكَ تَصُومُ النَّهَارَ وَتَقُومُ اللَّيْلَ؟» فَقُلْتُ: بَلَى يَا رَسُولَ اللَّهِ. قَالَ: «فَلَا تَفْعَلْ صُمْ وَأَفْطِرْ وَقُمْ وَنَمْ فَإِنَّ لِجَسَدِكَ عَلَيْكَ حَقًّا وَإِنَّ لِعَيْنِكَ عَلَيْكَ حَقًّا وَإِنَّ لِزَوْجِكَ عَلَيْكَ حَقًّا وَإِنَّ لِزَوْرِكَ عَلَيْكَ حَقًّا. لَا صَامَ مَنْ صَامَ الدَّهْرَ. صَوْمُ ثَلَاثَةِ أَيَّامٍ مِنْ كُلِّ شَهْرٍ صَوْمُ الدَّهْرِ كُلِّهِ. صُمْ كُلَّ شَهْرٍ ثَلَاثَةَ أَيَّامٍ وَاقْرَأِ الْقُرْآنَ فِي كُلِّ شَهْرٍ» . قُلْتُ: إِنِّي أُطِيقُ أَكْثَرَ مِنْ ذَلِكَ. قَالَ: \n\" صُمْ أَفْضَلَ الصَّوْمِ صَوْمَ دَاوُدَ: صِيَامُ يَوْمٍ وَإِفْطَارُ يَوْمٍ. وَاقْرَأْ فِي كُلِّ سَبْعِ لَيَالٍ مَرَّةً وَلَا تَزِدْ عَلَى ذَلِكَ \"","english":{"narrator":"","text":"‘Abdallah b. ‘Amr b. al-‘As told of God’s messenger saying to him, “Have I not been informed, ‘Abdallah, that you fast during the day and get up at night for prayer?”  When he replied that that was so, he said, “Do not do it. Fast and break your fast, get up for prayer and sleep, for you have a duty to your body, your eye, your wife, and your visitors. May he who observe a perpetual fast never fast!* Fasting three days every month is equivalent to a perpetual fast. Fast three days every month and recite the Qur'an every month.” When he replied that he was able to do more than that, he said, “Observe the most excellent fast, that of David, fasting every second day, and recite the Qur’an once every seven nights, but do no more than that.”\n* Cf. the similar phrase in the tradition of Abu Qatada (p.434). Some hold that the meaning here is, ‘He who observes a perpetual fast has not fasted.’\n\n(Bukhari and Muslim.)"}},{"id":98,"idInBook":98,"chapterId":7,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ الِاثْنَيْنِ وَالْخَمِيس. رَوَاهُ التِّرْمِذِيّ وَالنَّسَائِيّ","english":{"narrator":"","text":"‘A'isha said that God’s messenger used to fast on Mondays and Thursdays. \n\nTirmidhi and Nasa’i transmitted it."}},{"id":99,"idInBook":99,"chapterId":7,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «تُعْرَضُ الْأَعْمَالُ يَوْمَ الِاثْنَيْنِ وَالْخَمِيسِ فَأُحِبُّ أَنْ يُعْرَضَ عَمَلِي وَأَنَا صَائِمٌ» . رَوَاهُ التِّرْمِذِيُّ","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “Men’s deeds are presented  on Mondays and Thursdays, and I like mine to be presented when I am fasting.” \n\nTirmidhi transmitted it."}},{"id":100,"idInBook":100,"chapterId":7,"bookId":14,"arabic":"قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَا أَبَا ذَرٍّ إِذَا صُمْتَ مِنَ الشَّهْرِ ثَلَاثَةَ أَيَّامٍ فَصُمْ ثَلَاثَ عَشْرَةَ وَأَرْبَعَ عَشْرَةَ وَخَمْسَ عَشْرَةَ» . رَوَاهُ التِّرْمِذِيّ وَالنَّسَائِيّ","english":{"narrator":"","text":"Abu Dharr reported God’s messenger as saying, “When you fast three days in the month, Abu Dharr, fast on the thirteenth, fourteenth and fifteenth.” \n\nTirmidhi and Nasa'i transmitted it."}},{"id":101,"idInBook":101,"chapterId":7,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ مِنْ غُرَّةِ كُلِّ شَهْرٍ ثَلَاثَةَ أَيَّامٍ وَقَلَّمَا كَانَ يفْطر يَوْم الْجُمُعَةَ. رَوَاهُ التِّرْمِذِيُّ وَالنَّسَائِيُّ وَرَوَاهُ أَبُو دَاوُدَ إِلَى ثَلَاثَة أَيَّام","english":{"narrator":"","text":"‘Abdallah b. Mas'ud said that God’s messenger used to fast the first three days every month, and he would seldom break his fast on a Friday. \n\nTirmidhi and Nasa’i transmitted it, and Abu Dawud transmitted up to “three days every month.”"}},{"id":102,"idInBook":102,"chapterId":7,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ مِنَ الشَّهْرِ السَّبْتَ وَالْأَحَدَ وَالِاثْنَيْنِ وَمِنَ الشَّهْرِ الآخر الثُّلَاثَاء وَالْأَرْبِعَاء وَالْخَمِيس. رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"‘A'isha said that God’s messenger used to fast on Saturday, Sunday, and Monday one month, and on Tuesday, Wednesday, and Thursday the next. \n\nTirmidhi transmitted it."}},{"id":103,"idInBook":103,"chapterId":7,"bookId":14,"arabic":"وَعَنْ أُمِّ سَلَمَةَ قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْمُرُنِي أَنْ أَصُومَ ثَلَاثَةَ أَيَّامٍ مِنْ كُلِّ شَهْرٍ أَوَّلُهَا الِاثْنَيْنِ وَالْخَمِيس. رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ","english":{"narrator":"","text":"Umm Salama said that God’s messenger used to command her to fast three days every month beginning with Monday or Thursday. \n\nAbu Dawud and Nasa’i transmitted it."}},{"id":104,"idInBook":104,"chapterId":7,"bookId":14,"arabic":"وَعَن مُسلم الْقرشِي قَالَ: سَأَلت أَوْ سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَن صِيَام الدَّهْر فَقَالَ: «إِنَّ لِأَهْلِكَ عَلَيْكَ حَقًّا صُمْ رَمَضَانَ وَالَّذِي يَلِيهِ وَكُلَّ أَرْبِعَاءَ وَخَمِيسٍ فَإِذًا أَنْتَ قَدْ صُمْتَ الدَّهْرَ كُلَّهُ» . رَوَاهُ أَبُو دَاوُدَ وَالتِّرْمِذِيُّ","english":{"narrator":"","text":"Muslim al-Qurashi said that he or someone else asked God's messenger about perpetual fasting, and he replied, “You have a duty to your family. Fast during Ramadan and the following month, and every Wednesday and Thursday. You will then have observed a perpetual fast.\"\n\nAbu Dawud and Tirmidhi transmitted it."}},{"id":105,"idInBook":105,"chapterId":7,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: نَهَى عَنْ صَوْمِ يَوْمِ عَرَفَةَ بِعَرَفَةَ. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Abu Huraira said that God’s messenger prohibited fasting on the day of ‘Arafa at ‘Arafa. \n\nAbu Dawud transmitted it."}},{"id":106,"idInBook":106,"chapterId":7,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ بُسْرٍ عَنْ أُخْتِهِ الصَّمَّاءِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا تَصُومُوا يَوْمَ السَّبْتِ إِلَّا فِيمَا افْتُرِضَ عَلَيْكُمْ فَإِنْ لَمْ يَجِدْ أَحَدُكُمْ إِلَّا لِحَاءَ عِنَبَةٍ أَوْ عُودَ شَجَرَةٍ فَلْيَمْضُغْهُ» . رَوَاهُ أَحْمَدُ وَأَبُو دَاوُدَ وَالتِّرْمِذِيُّ وَابْنُ مَاجَهْ والدارمي","english":{"narrator":"","text":"‘Abdallah b. Busr, on the authority of his sister as-Samma’, reported God’s messenger as saying, “Do not fast on Saturday except during what has been made obligatory for you; and if one of you can get nothing but a grape skin or a piece of wood from a tree, he should chew it.” \n\nAhmad, Abu Dawud, Tirmidhi, Ibn Majah and Darimi transmitted it."}},{"id":107,"idInBook":107,"chapterId":7,"bookId":14,"arabic":"وَعَنْ أَبِي أُمَامَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ صَامَ يَوْمًا فِي سَبِيلِ اللَّهِ جَعَلَ اللَّهُ بَيْنَهُ وَبَيْنَ النَّارِ خَنْدَقًا كَمَا بَيْنَ السَّمَاءِ وَالْأَرْضِ» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Abu Umama reported God’s messenger as saying, \"If anyone fasts for a day while on jihad,* God will put between him and hell a ditch as wide as the distance between heaven and earth.\" \n*Mirqat gives this meaning, but says it may refer to the hajj, the 'umra, seeking knowledge, or desiring to please God. The Arabic is 'in God’s way.'\n\nTirmidhi transmitted it."}},{"id":108,"idInBook":108,"chapterId":7,"bookId":14,"arabic":"وَعَنْ عَامِرِ بْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْغَنِيمَةُ الْبَارِدَةُ الشِّتَاءِ» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ مُرْسل","english":{"narrator":"","text":"‘Amir b. Mas'ud reported God’s messenger as saying, “Fasting in winter is booty gained without trouble.”*\n*Literally, 'the cold booty.' The idea is that in winter one does not suffer from hunger and thirst as in summer.\n\nAhmad and Tirmidhi transmitted it, the latter saying this is a mursal tradition."}},{"id":109,"idInBook":109,"chapterId":7,"bookId":14,"arabic":"وَذَكَرَ حَدِيثَ أَبِي هُرَيْرَةَ: «مَا مِنْ أَيَّامٍ أحب إِلَى الله» فِي بَاب الْأُضْحِية","english":{"narrator":"","text":"The tradition of Abu Huraira, “No days are dearer to God”, has been mentioned in the chapter on the sacrifices.*\n*Reference to the first ten days of the month of Dhul Hijjah."}},{"id":110,"idInBook":110,"chapterId":7,"bookId":14,"arabic":"عَنِ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدِمَ الْمَدِينَةِ فَوَجَدَ الْيَهُودَ صِيَامًا يَوْمَ عَاشُورَاءَ فَقَالَ لَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا هَذَا الْيَوْمُ الَّذِي تَصُومُونَهُ؟» فَقَالُوا: هَذَا يَوْمٌ عَظِيمٌ: أَنْجَى اللَّهُ فِيهِ مُوسَى وَقَوْمَهُ وَغَرَّقَ فِرْعَوْنَ وَقَوْمَهُ فَصَامَهُ مُوسَى شُكْرًا فَنَحْنُ نَصُومُهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «فَنَحْنُ أَحَقُّ وَأَوْلَى بِمُوسَى مِنْكُمْ» فَصَامَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَمَرَ بصيامه","english":{"narrator":"","text":"Ibn ‘Abbas said that God’s messenger came to Medina and found the Jews observing the fast on the day of ‘Ashura’, so he asked them what was the significance of that day which they were observing and they replied, “It is a great day on which God delivered Moses and his people and drowned Pharaoh and his people; so Moses observed it as a fast out of gratitude, and we do so also.” He said, “We have more right, and we have a closer connection with Moses than you have,” so God’s messenger observed it as a fast himself and gave orders that it should be observed. \n\n(Bukhari and Muslim.)"}},{"id":111,"idInBook":111,"chapterId":7,"bookId":14,"arabic":"قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ يَوْمَ السَّبْتِ وَيَوْمَ الْأَحَدِ أَكْثَرَ مَا يَصُومُ مِنَ الْأَيَّامِ وَيَقُولُ: «إِنَّهُمَا يَوْمَا عِيدٍ لِلْمُشْرِكِينَ فَأَنَا أُحِبُّ أَن أخالفهم» . رَوَاهُ أَحْمد","english":{"narrator":"","text":"Umm Salama said that God's messenger used to fast on Saturdays and Sundays more than on other days, and he used to say, “They are days of festival for the polytheists, and I like to act contrary to them.”\n\nAhmad transmitted it."}},{"id":112,"idInBook":112,"chapterId":7,"bookId":14,"arabic":"وَعَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْمُرُ بِصِيَامِ يَوْمِ عَاشُورَاءَ وَيَحُثُّنَا عَلَيْهِ وَيَتَعَاهَدُنَا عِنْدَهُ فَلَمَّا فُرِضَ رَمَضَانُ لَمْ يَأْمُرْنَا وَلَمْ يَنْهَنَا عَنْهُ وَلم يتعاهدنا عِنْده. رَوَاهُ مُسلم","english":{"narrator":"","text":"Jabir b. Samura said, “God’s messenger used to command us to observe the day of ‘Ashura’ as a fast, urge us to observe it and pay attention to us when it came; but when Ramadan was made obligatory he neither commanded nor forbade us to observe it, nor did he pay attention to us when it came.” \n\nMuslim transmitted it."}},{"id":113,"idInBook":113,"chapterId":7,"bookId":14,"arabic":"وَعَنْ حَفْصَةَ قَالَتْ: أَرْبَعٌ لَمْ يَكُنْ يَدَعُهُنَّ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «صِيَامُ عَاشُورَاءَ وَالْعَشْرِ وَثَلَاثَةُ أَيَّامٍ مِنْ كُلِّ شَهْرٍ وَرَكْعَتَانِ قبل الْفجْر» . رَوَاهُ النَّسَائِيّ","english":{"narrator":"Hafsa said there were four things the Prophet never omitted:","text":"fasting on ‘Ashura’, the first ten days of Dhul Hijja* and three days every month, and praying two rak'as before dawn. \n*The Arabic has simply 'the ten', to be understood as translated above.\n\nNasa’i transmitted it."}},{"id":114,"idInBook":114,"chapterId":7,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يُفْطِرُ أَيَّامَ الْبيض فِي حضر وَلَا فِي سفر. رَوَاهُ النَّسَائِيّ","english":{"narrator":"","text":"Ibn ‘Abbas said that it was the custom of God’s messenger not to eat on the middle days* of the month whether travelling or not. \n*Literally, the days of the white (nights). These are the days following the thirteenth, fourteenth, and fifteenth nights of the month, the nights when there is most moonlight.\n\nNasa’i transmitted it."}},{"id":115,"idInBook":115,"chapterId":7,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لِكُلِّ شَيْءٍ زَكَاةٌ وَزَكَاةُ الْجَسَدِ الصَّوْمُ» . رَوَاهُ ابْن مَاجَه","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “There is zakat applicable to everything, and the zakat of the body is fasting.” \n\nIbn Majah transmitted it."}},{"id":116,"idInBook":116,"chapterId":7,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: كَانَ يَصُومُ يَوْمَ الِاثْنَيْنِ وَالْخَمِيسِ. فَقِيلَ: يَا رَسُولَ اللَّهِ إِنَّكَ تَصُومُ يَوْمَ الِاثْنَيْنِ وَالْخَمِيسِ. فَقَالَ: \n\" إِنَّ يَوْمَ الِاثْنَيْنِ وَالْخَمِيسِ يَغْفِرُ اللَّهُ فِيهِمَا لِكُلِّ مُسْلِمٍ إِلَّا ذَا هَاجِرَيْنِ يَقُولُ: دَعْهُمَا حَتَّى يصطلحا \". رَوَاهُ أَحْمد وَابْن مَاجَه","english":{"narrator":"","text":"He said that the Prophet used to fast on Mondays and Thursdays, and when someone remarked on this to him he said, “On Monday and Thursday God forgives every Muslim except two who are at variance, for He says they must be left till they make peace with one another.”\n\nAhmad and Ibn Majah transmitted it."}},{"id":117,"idInBook":117,"chapterId":7,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ صَامَ يَوْمًا ابْتِغَاءَ وَجْهِ اللَّهِ بَعَّدَهُ اللَّهُ مِنْ جَهَنَّمَ كَبُعْدِ غُرَابٍ طَائِرٍ وَهُوَ فرخ حَتَّى مَاتَ هرما» . رَوَاهُ أَحْمد\nوَرَوَى الْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَانِ عَنْ سَلَمَةَ بن قيس","english":{"narrator":"","text":"He reported God’s messenger as saying, “If anyone out of a desire to please God fasts for a day, God will remove him from jahannam as far as a crow flies from the time it is a young bird till it dies of old age.”\n\nAhmad transmitted it, and Baihaqi transmitted it in Shu'ab al-iman from Salama b. Qais."}},{"id":118,"idInBook":118,"chapterId":7,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: دَخَلَ عَلَيَّ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ يَوْمٍ فَقَالَ: «هَلْ عِنْدَكُمْ شَيْءٌ؟» فَقُلْنَا: لَا قَالَ: «فَإِنِّي إِذًا صَائِمٌ» . ثُمَّ أَتَانَا يَوْمًا آخَرَ فَقُلْنَا: يَا رَسُولَ اللَّهِ أُهْدِيَ لَنَا حَيْسٌ فَقَالَ: «أَرِينِيهِ فَلَقَدْ أَصْبَحْتُ صَائِمًا» فَأَكَلَ. رَوَاهُ مُسلم","english":{"narrator":"‘A'isha said:","text":"The Prophet came to visit me one day and asked if I had anything . When I said I had nothing he replied, “Then I shall observe a fast.” When he came to me another day and I told him I had been given a present of some hais* he said, “Show me it, for I began the day fasting.” Then he ate. \n*A mixture of dates and clarified butter.\n\nMuslim transmitted it."}},{"id":119,"idInBook":119,"chapterId":7,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: دَخَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى أُمِّ سُلَيْمٍ فَأَتَتْهُ بِتَمْرٍ وَسَمْنٍ فَقَالَ: «أَعِيدُوا سَمْنَكُمْ فِي سِقَائِهِ وَتَمْرَكُمْ فِي وِعَائِهِ فَإِنِّي صَائِمٌ» . ثُمَّ قَامَ إِلَى نَاحِيَةٍ مِنَ الْبَيْتِ فَصَلَّى غَيْرَ الْمَكْتُوبَةِ فَدَعَا لأم سليم وَأهل بَيتهَا. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Anas said that the Prophet visited Umm Sulaim, and when she brought him some dates and clarified butter he said, “Put your butter back in its container and your dates in their vessel, for I am fasting.” He then went to a separate part of the house and prayed a prayer which was not one of the prescribed prayers, and invoked a blessing on Umm Sulaim and the inhabitants of her house. \n\nBukhari transmitted it."}},{"id":120,"idInBook":120,"chapterId":7,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" إِذَا دُعِيَ أَحَدُكُمْ إِلَى طَعَامٍ وَهُوَ صَائِمٌ فَلْيَقُلْ: إِنِّي صَائِمٌ \". وَفِي رِوَايَةٍ قَالَ: «إِذَا دُعِيَ أَحَدُكُمْ فَلْيُجِبْ فَإِنْ كَانَ صَائِمًا فَلْيُصَلِّ وَإِن كَانَ مُفطرا فيطعم» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “When one of you is invited to a meal at a time when he is fasting he should say he is fasting.” In a version he said, “When one of you receives an invitation he should accept it. If he is fasting he should pray, but if not, he should eat.” \n\nMuslim transmitted it."}},{"id":121,"idInBook":121,"chapterId":7,"bookId":14,"arabic":"عَنْ أُمِّ هَانِئٍ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: لَمَّا كَانَ يَوْمُ الْفَتْحِ فَتْحِ مَكَّةَ جَاءَتْ فَاطِمَةُ فَجَلَسَتْ عَلَى يَسَارِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَمُّ هَانِئٍ عَنْ يَمِينِهِ فَجَاءَتِ الْوَلِيدَةُ بِإِنَاءٍ فِيهِ شَرَابٌ فَنَاوَلَتْهُ فَشَرِبَ مِنْهُ ثُمَّ نَاوَلَهُ أُمَّ هَانِئٍ فَشَرِبَتْ مِنْهُ فَقَالَتْ: يَا رَسُولَ اللَّهِ لَقَدْ أَفْطَرْتُ وَكُنْتُ صَائِمَةً فَقَالَ لَهَا: «أَكُنْتِ تَقْضِينَ شَيْئًا؟» قَالَتْ: لَا. قَالَ: «فَلَا يَضُرُّكِ إِنْ كَانَ تَطَوُّعًا» . رَوَاهُ أَبُو دَاوُدَ وَالتِّرْمِذِيُّ وَالدَّارِمِيُّ وَفِي رِوَايَةٍ لِأَحْمَدَ وَالتِّرْمِذِيِّ نَحْوُهُ وَفِيهِ فَقَالَتْ: يَا رَسُولَ اللَّهِ أَمَا إِنِّي كُنْتُ صَائِمَةً فَقَالَ: «الصَّائِم أَمِيرُ نَفْسِهِ إِنْ شَاءَ صَامَ وَإِنْ شَاءَ أفطر»","english":{"narrator":"","text":"Umm Hani’ said that on the day of the conquest of Mecca Fatima came and sat on God’s messenger’s left and Umm Hani on his right, and when the maidservant brought a vessel containing; drinking water and handed it to him, he drank some of it and handed it to Umm Hani’ who drank some of it. She then said, “Messenger of God, I was fasting and I have broken my fast.” He asked if she was making up for anything, and when she replied that she was not, he said, “It will not harm you if it was a voluntary fast.” \n\nAbu Dawud, Tirmidhi and Darimi transmitted it. A version by Ahmad and Tirmidhi has something similar. In it she said, “Messenger of God, I was fasting,” and he replied, “The one who observes a voluntary fast is his own master; if he wishes he may fast, and if he wishes he may break it.”"}},{"id":122,"idInBook":122,"chapterId":7,"bookId":14,"arabic":"وَعَنِ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْ: كُنْتُ أَنَا وَحَفْصَةُ صَائِمَتَيْنِ فَعَرَضَ لَنَا طَعَامٌ اشْتَهَيْنَاهُ فَأَكَلَنَا مِنْهُ فَقَالَتْ حَفْصَةُ: يَا رَسُولَ اللَّهِ إِنَّا كُنَّا صَائِمَتَيْنِ فَعُرِضَ لَنَا طَعَامٌ اشْتَهَيْنَاهُ فَأَكَلَنَا مِنْهُ. قَالَ: «اقْضِيَا يَوْمًا آخَرَ مَكَانَهُ» . رَوَاهُ التِّرْمِذِيُّ وَذَكَرَ جَمَاعَةً مِنَ الْحُفَّاظِ رَوَوْا عَنِ الزُّهْرِيِّ عَنْ عَائِشَةَ مُرْسَلًا وَلَمْ يذكرُوا فِيهِ عَن عُرْوَة وَهَذَا أصح\nوَرَوَاهُ أَبُو دَاوُدَ عَنْ زُمَيْلٍ مَوْلَى عُرْوَةَ عَن عُرْوَة عَن عَائِشَة","english":{"narrator":"Zuhri reported on ‘Urwa’s authority that ‘A'isha said:","text":"When Hafsa and I were fasting we were offered food which we liked very much and ate some of it. Hafsa told God’s messenger of this, and he said, “Make up for it by fasting on another day.” \n\nTirmidhi transmitted it, but he mentioned a number of huffaz* who transmitted on the authority of Zuhri on the authority of ‘A'isha in mursal form, omitting to mention ‘Urwa’s authority, and this is sounder. Abu Dawud transmitted it from Zumail the client of ‘Urwa from ‘Urwa from ‘A'isha.\n*Traditionists who have a reputation for their accurate memory."}},{"id":123,"idInBook":123,"chapterId":7,"bookId":14,"arabic":"وَعَن أم عمَارَة بنت كَعْب إِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَيْهَا فَدَعَتْ لَهُ بِطَعَامٍ فَقَالَ لَهَا: «كُلِي» . فَقَالَتْ: إِنِّي صَائِمَةٌ. فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ الصَّائِمَ إِذَا أُكِلَ عِنْدَهُ صَلَّتْ عَلَيْهِ الْمَلَائِكَةُ حَتَّى يَفْرَغُوا» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيّ وَابْن مَاجَه والدارمي","english":{"narrator":"","text":"Umm ‘Umara, daughter of Ka‘b, said that once when the Prophet visited her and she called for food for him, he told her that she must eat also; but when she replied that she was fasting he said, “When people eat beside one who is fasting the angels invoke blessings on him till they finish eating.” \n\nAhmad, Tirmidhi, Ibn Majah and Darimi transmitted it."}},{"id":124,"idInBook":124,"chapterId":7,"bookId":14,"arabic":"عَن بُرَيْدَة قَالَ: دَخَلَ بِلَالٌ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَتَغَدَّى فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْغَدَاءَ يَا بِلَالُ» . قَالَ: إِنِّي صَائِمٌ يَا رَسُولَ اللَّهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «نَأْكُلُ رِزْقَنَا وَفَضْلُ رِزْقِ بِلَالٍ فِي الْجَنَّةِ أشعرت يَا بِلَال أَن الصَّائِم نُسَبِّح عِظَامه وَتَسْتَغْفِر لَهُ الْمَلَائِكَةُ مَا أَكَلَ عِنْدَهُ؟» . رَوَاهُ الْبَيْهَقِيُّ فِي شعب الْإِيمَان","english":{"narrator":"","text":"Buraida said that once when Bilal went in to visit God’s messenger while he was having his morning meal he invited him to join him, and when Bilal replied that he was fasting, he said, “We are eating our provision and Bilal’s superior provision is in paradise. Did you know, Bilal, that the bones of one who fasts extol God and that the angels ask forgiveness for him as long as people eat beside him?” \n\nBaihaqi transmitted it in Shu'ab al-iman."}},{"id":125,"idInBook":125,"chapterId":7,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «تَحَرَّوْا لَيْلَةَ الْقَدْرِ فِي الْوِتْرِ مِنَ الْعَشْرِ الْأَوَاخِرِ من رَمَضَان» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"‘A'isha reported God's messenger as saying, “Seek lailat al-qadr on an old number night among the last ten in Ramadan.” \n\nBukhari transmitted it."}},{"id":126,"idInBook":126,"chapterId":7,"bookId":14,"arabic":"وَعَن ابْن عمر قَالَ: أَنَّ رَجُلًا مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُرُوا لَيْلَةَ الْقَدْرِ فِي الْمَنَامِ فِي السَّبْعِ الْأَوَاخِرِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَرَى رُؤْيَاكُمْ قَدْ تَوَاطَأَتْ فِي السَّبْعِ الْأَوَاخِرِ فَمَنْ كَانَ مُتَحَرِّيهَا فَلْيَتَحَرَّهَا فِي السَّبْعِ الْأَوَاخِر»","english":{"narrator":"","text":"Ibn ‘Umar said that some of the Prophet’s companions had a dream that lailat al-qadr was among the last seven nights, so God’s messenger said, “ I see that your dreams agree regarding the last seven nights, so if anyone seeks it he should do so during the last seven nights.”\n\n(Bukhari and Muslim.)"}},{"id":127,"idInBook":127,"chapterId":7,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: الْتَمِسُوهَا فِي الْعَشْرِ الْأَوَاخِرِ مِنْ رَمَضَانَ لَيْلَةَ الْقَدْرِ: فِي تَاسِعَةٍ تَبْقَى فِي سَابِعَةٍ تَبْقَى فِي خَامِسَةٍ تَبْقَى. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Ibn ‘Abbas reported the Prophet as saying, “Seek lailat al-qadr in the last ten nights of Ramadan, on the twenty-first, twenty-third and twenty-fifth.” \n\nBukhari transmitted it."}},{"id":128,"idInBook":128,"chapterId":7,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ رَضِيَ اللَّهُ عَنْهُمْ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اعْتَكَفَ الْعَشْرَ الْأَوَّلَ مِنْ رَمَضَانَ ثُمَّ اعْتَكَفَ الْعَشْرَ الْأَوْسَطَ فِي قُبَّةٍ تُرْكِيَّةٍ ثُمَّ أَطْلَعَ رَأسه. فَقَالَ: «إِنِّي اعتكفت الْعشْر الأول ألتمس هَذِه اللَّيْلَة ثمَّ اعتكفت الْعَشْرَ الْأَوْسَطَ ثُمَّ أُتِيتُ فَقِيلَ لِي إِنَّهَا فِي الْعشْر الْأَوَاخِر فَمن اعْتَكَفْ مَعِي فَلْيَعْتَكِفِ الْعَشْرَ الْأَوَاخِرَ فَقَدْ أُرِيتُ هَذِهِ اللَّيْلَةَ ثُمَّ أُنْسِيتُهَا وَقَدْ رَأَيْتُنِي أَسْجُدُ فِي مَاءٍ وَطِينٍ مِنْ صَبِيحَتِهَا فَالْتَمِسُوهَا فِي الْعَشْرِ الْأَوَاخِرِ وَالْتَمِسُوهَا فِي كُلِّ وِتْرٍ» . قَالَ: فَمَطَرَتِ السَّمَاءُ تِلْكَ اللَّيْلَةَ وَكَانَ الْمَسْجِدُ عَلَى عَرِيشٍ فَوَكَفَ الْمَسْجِدُ فَبَصُرَتْ عَيْنَايَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَى جَبْهَتِهِ أَثَرُ المَاء والطين وَالْمَاء مِنْ صَبِيحَةِ إِحْدَى وَعِشْرِينَ. مُتَّفَقٌ عَلَيْهِ فِي الْمَعْنَى وَاللَّفْظُ لِمُسْلِمٍ إِلَى قَوْلِهِ: \n\" فَقِيلَ لِي: إِنَّهَا فِي الْعشْر الْأَوَاخِر \". وَالْبَاقِي للْبُخَارِيّ\nوَفِي رِوَايَةِ عَبْدِ اللَّهِ بْنِ أُنَيْسٍ قَالَ: «لَيْلَة ثَلَاث وَعشْرين» . رَوَاهُ مُسلم","english":{"narrator":"Abu Sa'id al-Khudri said:","text":"God’s messenger spent the first ten nights of Ramadan in devotion, and spent the middle ten nights in devotion in a round Turkish tent, after which he raised his head and said, “I have spent the first ten nights in devotion seeking this night, then I spent the middle ten nights in devotion, and after that I had a heavenly visitant and was told that it is in the last ten, so he who has engaged in devotion along with me should do so during the last ten nights, for I was shown this nights, then was caused to forget it, but I have seen myself prostrating in water and clay on the morning following, so seek it among the last ten and seek it in every night with an odd number.” He said: Rain fell that night, the mosque which was a thatched building dripped, and my eyes saw God’s messenger with traces of water and clay on his forehead on the morning after the twenty-first night. Bukhari and Muslim agree on the subject-matter, the wording being Muslim's up to “and was told it is it the last ten”, the remainder being Bukhari's. In the version of ‘Abdallah b. Unais he said it was the twenty-third night.\n\nMuslim transmitted it."}},{"id":129,"idInBook":129,"chapterId":7,"bookId":14,"arabic":"وَعَنْ زِرِّ بْنِ حُبَيْشٍ قَالَ: سَأَلْتُ أُبَيَّ بْنَ كَعْبٍ فَقُلْتُ إِنَّ أَخَاكَ ابْنَ مَسْعُودٍ يَقُولُ: مَنْ يَقُمِ الْحَوْلَ يُصِبْ لَيْلَةَ الْقَدْرِ. فَقَالَ C أَرَادَ أَنْ لَا يَتَّكِلَ النَّاسُ أَمَا إِنَّهُ قَدْ عَلِمَ أَنَّهَا فِي رَمَضَانَ وَأَنَّهَا فِي الْعَشْرِ الْأَوَاخِرِ وَأَنَّهَا لَيْلَةُ سَبْعٍ وَعِشْرِينَ ثُمَّ حَلَفَ لَا يَسْتَثْنِي أَنَّهَا لَيْلَةُ سَبْعٍ وَعِشْرِينَ. فَقُلْتُ: بِأَيِّ شَيْءٍ تَقُولُ ذَلِكَ يَا أَبَا الْمُنْذِرِ؟ قَالَ: بِالْعَلَامَةِ أَوْ بِالْآيَةِ الَّتِي أَخْبَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّهَا تَطْلُعُ يَوْمَئِذٍ لَا شُعَاعَ لَهَا. رَوَاهُ مُسْلِمٌ","english":{"narrator":"Zirr b. Hubaish said:","text":"I questioned Ubayy b. Ka'b about a statement by his brother ” he replied, “By the indication (or sign)* of which God’s messenger informed us, viz. that the sun rises on that day without rays.” *An alternative, the transmitter not being sure which word was used.\n*An alternative, the transmitter not being sure which word was used.\n\nMuslim transmitted it."}},{"id":130,"idInBook":130,"chapterId":7,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَجْتَهِدُ فِي الْعَشْرِ الْأَوَاخِرِ مَا لَا يَجْتَهِدُ فِي غَيره. رَوَاهُ مُسلم","english":{"narrator":"","text":"‘A'isha said that God’s messenger used to exert himself in devotion during the last ten nights to a greater extent than at any other time.\n\nMuslim transmitted it."}},{"id":131,"idInBook":131,"chapterId":7,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا دَخَلَ الْعَشْرُ شَدَّ مِئْزَرَهُ وَأَحْيَا ليله وَأَيْقَظَ أَهله","english":{"narrator":"","text":"She said that when the last ten nights began God’s messenger prepared himself for religious exercises, stayed awake at night and wakened his family. \n\n(Bukhari and Muslim.)"}},{"id":132,"idInBook":132,"chapterId":7,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: قُلْتُ: يَا رَسُولَ اللَّهِ أَرَأَيْتَ إِنْ عَلِمْتُ أَيُّ لَيْلَةٍ الْقَدْرِ مَا أَقُولُ فِيهَا؟ قَالَ: \n\" قُولِي: اللَّهُمَّ إِنَّكَ عَفُوٌّ تُحِبُّ الْعَفْوَ فَاعَفُ عَنِّي \". رَوَاهُ أَحْمد وَابْن مَاجَه وَالتِّرْمِذِيّ وَصَححهُ","english":{"narrator":"","text":"‘A'isha said she asked God’s messenger to tell her what prayers to say on lailat al-qadr if she knew which night it was, and he told her to say, “O God, Thou art forgiving and lovest forgiveness, so forgive me.” \n\nAhmad, Ibn Majah, and Tirmidhi transmitted it, and Tirmidhi declared it to be sound."}},{"id":133,"idInBook":133,"chapterId":7,"bookId":14,"arabic":"وَعَنْ أَبِي بَكْرَةَ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «الْتَمِسُوهَا يَعْنَى لَيْلَة الْقدر فِي تسع بَقينَ أَو فِي سبع بَقينَ أَو فِي خمس بَقينَ أَوْ ثَلَاثٍ أَوْ آخِرِ لَيْلَةٍ» . رَوَاهُ التِّرْمِذِيُّ","english":{"narrator":"","text":"Abu Bakra said he heard God’s messenger say, “Seek it (meaning lailat al-qadr), on the twenty-first, twenty-third, twenty-fifth, twentyseventh, or on the last night.” \n\nTirmidhi transmitted it."}},{"id":134,"idInBook":134,"chapterId":7,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ لَيْلَةِ الْقَدْرِ فَقَالَ: «هِيَ فِي كُلِّ رَمَضَانَ» . رَوَاهُ أَبُو دَاوُد وَقَالَ: رَوَاهُ سُفْيَان وَشعْبَة عَن أبي إِسْحَق مَوْقُوفا على ابْن عمر","english":{"narrator":"","text":"Ibn ‘Umar said God’s messenger was asked about lailat al-qadr and replied, “It occurs every Ramadan.” \n\nAbu Dawud transmitted it and said that Sufyan and Shu'ba transmitted it on the authority of Abu\nIshaq tracing it no farther back than Ibn ‘Umar."}},{"id":135,"idInBook":135,"chapterId":7,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ أُنَيْسٍ قَالَ: قُلْتُ يَا رَسُولَ اللَّهِ إِنَّ لِي بَادِيَةً أَكُونُ فِيهَا وَأَنا أُصَلِّي فِيهَا بِحَمْد الله فَمُرْنِي بِلَيْلَةٍ أَنْزِلُهَا إِلَى هَذَا الْمَسْجِدِ فَقَالَ: «انْزِلْ لَيْلَة ثَلَاث وَعشْرين» . قيل لِابْنِهِ: كَيْفَ كَانَ أَبُوكَ يَصْنَعُ؟ قَالَ: كَانَ يَدْخُلُ الْمَسْجِدَ إِذَا صَلَّى الْعَصْرَ فَلَا يَخْرُجُ مِنْهُ لِحَاجَةٍ حَتَّى يُصَلِّيَ الصُّبْحَ فَإِذَا صَلَّى الصُّبْحَ وَجَدَ دَابَّتَهُ عَلَى بَابِ الْمَسْجِدِ فَجَلَسَ عَلَيْهَا وَلحق بباديته. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"‘Abdallah b. Unais told that he said, “Messenger of God, I have a place in the desert where I live and in which I pray praising God, but give me command about a night when I may leave it and come to this mosque.” He replied, “Come on the twenty-third night.” His son was asked how his father used to act and said he used to enter the mosque when he had prayed the afternoon prayer and not leave it for any purpose till he prayed the morning prayer. Then when he had prayed the morning prayer he found his beast at the door of the mosque, mounted it and got back to his desert region. \n\nAbu Dawud transmitted it."}},{"id":136,"idInBook":136,"chapterId":7,"bookId":14,"arabic":"عَنْ عُبَادَةَ بْنِ الصَّامِتِ قَالَ: خَرَجَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِيُخْبِرَنَا بِلَيْلَةِ الْقَدْرِ فَتَلَاحَى رَجُلَانِ مِنَ الْمُسْلِمِينَ فَقَالَ: «خَرَجْتُ لِأُخْبِرَكُمْ بِلَيْلَةِ الْقَدْرِ فَتَلَاحَى فُلَانٌ وَفُلَانٌ فَرُفِعَتْ وَعَسَى أَنْ يَكُونَ خَيْرًا لَكُمْ فَالْتَمِسُوهَا فِي التَّاسِعَةِ وَالسَّابِعَة وَالْخَامِسَة» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"‘Ubada b. as-Samit said that the Prophet came out to inform them about lailat al-qadr, but finding two Muslims disputing together he said, “I came out to inform you about lailat al-qadr, but so and so and so and so had a dispute, and the knowledge of it has been withdrawn. That, however, may perhaps be better for you, so seek it on the ninth, the seventh and the fifth.”*\n*i.e. the twenty-ninth, twenty-seventh, and twenty-fifth.\n\nBukhari transmitted it."}},{"id":137,"idInBook":137,"chapterId":7,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" إِذَا كَانَ لَيْلَةُ الْقَدْرِ نزل جِبْرِيل عَلَيْهِ السَّلَام فِي كُبْكُبَةٍ مِنَ الْمَلَائِكَةِ يُصَلُّونَ عَلَى كُلِّ عَبْدٍ قَائِمٍ أَوْ قَاعِدٍ يَذْكُرُ اللَّهَ عَزَّ وَجَلَّ فَإِذَا كَانَ يَوْمُ عِيدِهِمْ يَعْنِي يَوْمَ فِطْرِهِمْ بَاهَى بِهِمْ مَلَائِكَتَهُ فَقَالَ: يَا مَلَائِكَتِي مَا جَزَاءُ أَجِيرٍ وَفَّى عَمَلَهُ؟ قَالُوا: رَبَّنَا جَزَاؤُهُ أَنْ يُوَفَّى أَجْرَهُ. قَالَ: مَلَائِكَتِي عَبِيدِي وَإِمَائِي قَضَوْا فَرِيضَتِي عَلَيْهِمْ ثُمَّ خَرَجُوا يَعُجُّونَ إِلَى الدُّعَاءِ وَعِزَّتِي وَجَلَالِي وَكَرَمِي وَعُلُوِّي وَارْتِفَاعِ مَكَاني لأجيبنهم. فَيَقُول: ارْجعُوا فقد غَفَرْتُ لَكُمْ وَبَدَّلْتُ سَيِّئَاتِكُمْ حَسَنَاتٍ. قَالَ: فَيَرْجِعُونَ مَغْفُورًا لَهُمْ \". رَوَاهُ الْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَانِ","english":{"narrator":"","text":"Anas reported God's messenger as saying that when lailat al-qadr comes Gabriel descends with a company of angels who invoke blessings on everyone who is standing or sitting and remembering God who is great and glorious. Then when their festival day comes, i.e. the day when they break their fast, God speaks proudly of them to His angels saying, “My angels, what is the reward of a hired servant who has fully accomplished his work?” They reply, “Our Lord, his reward is that he should be paid his wage in full.” He says, “My angels, my male and female servants have fulfilled what I have made obligatory for them, and then have come out raising their voices in supplication. By my might, glory, honour, high dignity, and exalted station, I will certainly answer them.” Then He says, “Return, for I have forgiven you and changed your evil deeds into good deeds.” He said that they then return having received forgiveness. \n\nBaihaqi transmitted it in Shu'ab al-iman."}},{"id":138,"idInBook":138,"chapterId":7,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَعْتَكِفُ الْعَشْرَ الْأَوَاخِرَ مِنْ رَمَضَانَ حَتَّى تَوَفَّاهُ اللَّهُ ثُمَّ اعْتَكَفَ أَزْوَاجُهُ مِنْ بعده","english":{"narrator":"","text":"‘A'isha said that the Prophet used to engage in private devotions in the mosque during the last ten nights of Ramadan till God took him, and then his wives followed this practice after his death.* \n*Mirqat says that the Prophet’s wives observed periods of seclusion for devotion, not in the mosque but in their houses.\n\n(Bukhari and Muslim.)"}},{"id":139,"idInBook":139,"chapterId":7,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَجْوَدَ النَّاسِ بِالْخَيْرِ وَكَانَ أَجْوَدَ مَا يَكُونُ فِي رَمَضَان وَكَانَ جِبْرِيلُ يَلْقَاهُ كُلَّ لَيْلَةٍ فِي رَمَضَانَ يَعْرِضُ عَلَيْهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْقُرْآنَ فَإِذَا لَقِيَهُ جِبْرِيلُ كَانَ أَجْوَدُ بِالْخَيْرِ مِنَ الرّيح الْمُرْسلَة","english":{"narrator":"","text":"Ibn ‘Abbas said that God’s messenger was the most generous of men, and he was as generous as possible in Ramadan. Gabriel used to meet him every night in Ramadan and the Prophet would go over the Qur’an to him. When Gabriel met him he was more generous than the wind which blows freely. \n\n(Bukhari and Muslim.)"}},{"id":140,"idInBook":140,"chapterId":7,"bookId":14,"arabic":"وَعَن أبي هُرَيْرَة قَالَ: كَانَ يعرض على النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْقُرْآنَ كُلَّ عَامٍ مَرَّةً فَعَرَضَ عَلَيْهِ مَرَّتَيْنِ فِي الْعَامِ الَّذِي قُبِضَ وَكَانَ يَعْتَكِفُ كُلَّ عَامٍ عَشْرًا فَاعْتَكَفَ عِشْرِينَ فِي الْعَامِ الَّذِي قُبِضَ. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Abu Huraira said that the Qur’an was gone over* to the Prophet once annually, but that this was done twice in the year in which he died. He used to engage in private devotions in the mosque during ten nights every year, but he did this during twenty nights in the year in which he died. \n*Mirqat remarks that some expositors say the passive is used here because the person who went over the Quran to the Prophet was well-known, viz. Gabriel.\n\nBukhari transmitted it."}},{"id":141,"idInBook":141,"chapterId":7,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اعْتَكَفَ أَدْنَى إِلَيَّ رَأَسَهِ وَهُوَ فِي الْمَسْجِدِ فَأُرَجِّلُهُ وَكَانَ لَا يَدْخُلُ الْبَيْتَ إِلَّا لحَاجَة الْإِنْسَان \"","english":{"narrator":"","text":"‘A'isha said, “During his private devotional exercises God’s messenger would put his head near me when he was in the mosque, and I would comb it; and he entered the house only to relieve himself.” \n\n(Bukhari and Muslim.)"}},{"id":142,"idInBook":142,"chapterId":7,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ: أَنَّ عُمَرَ سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \" كُنْتُ نَذَرْتُ فِي الْجَاهِلِيَّةِ أَنْ أَعْتَكِفَ لَيْلَةً فِي الْمَسْجِد الْحَرَام؟ قَالَ: «فأوف بِنَذْرِك»","english":{"narrator":"","text":"Ibn ‘Umar said that when ‘Umar consulted the Prophet about a vow he had made in the pre-Islamic period to spend a night in devotion in the sacred mosque, he said, “Fulfill your vow.” \n\n(Bukhari and Muslim.)"}},{"id":143,"idInBook":143,"chapterId":7,"bookId":14,"arabic":"عَنْ أَنَسٍ قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعْتَكِفُ فِي الْعَشْرِ الْأَوَاخِرِ مِنْ رَمَضَانَ فَلَمْ يَعْتَكِفْ عَامًا. فَلَمَّا كَانَ الْعَامُ الْمقبل اعْتكف عشْرين. رَوَاهُ التِّرْمِذِيّ\nوَرَوَاهُ أَبُو دَاوُدَ وَابْنُ مَاجَهْ عَنْ أَبِي بن كَعْب","english":{"narrator":"","text":"Anas said that the Prophet was accustomed to engage in private devotion in the mosque during the last ten nights of Ramadan; but one year he omitted it and he engaged in it during twenty nights the next year. \n\nTirmidhi transmitted it, and Abu Dawud and Ibn Majah transmitted it from Ubayy b. Ka'b."}},{"id":144,"idInBook":144,"chapterId":7,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَرَادَ أَنْ يَعْتَكِفَ صَلَّى الْفَجْرَ ثُمَّ دَخَلَ فِي مُعْتَكَفِهِ. رَوَاهُ أَبُو دَاوُدَ وَابْنُ مَاجَهْ","english":{"narrator":"","text":"‘A'isha said that when God’s messenger intended to engage in private devotion in the mosque he prayed the dawn prayer and then entered his place of seclusion. \n\nAbu Dawud and Ibn Majah transmitted it."}},{"id":145,"idInBook":145,"chapterId":7,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعُودُ الْمَرِيضَ وَهُوَ مُعْتَكِفٌ فَيَمُرُّ كَمَا هُوَ فَلَا يُعَرِّجُ يَسْأَلُ عَنْهُ. رَوَاهُ أَبُو دَاوُدَ وَابْنُ مَاجَهْ","english":{"narrator":"","text":"She said that the Prophet used to visit the sick while engaged in a period of private devotion in the mosque and he would pass on straight ahead without pausing and ask for him. \n\nAbu Dawud transmitted it."}},{"id":146,"idInBook":146,"chapterId":7,"bookId":14,"arabic":"وَعَن عَائِشَة رَضِي الله عَنْهَا قَالَتْ: السُّنَّةُ عَلَى الْمُعْتَكِفِ أَنْ لَا يَعُودَ مَرِيضًا وَلَا يَشْهَدُ جِنَازَةً وَلَا يَمَسُّ الْمَرْأَةَ وَلَا يُبَاشِرُهَا وَلَا يَخْرُجُ لِحَاجَةٍ إِلَّا لِمَا لابد مِنْهُ وَلَا اعْتِكَافَ إِلَّا بِصَوْمٍ وَلَا اعْتِكَافَ إِلَّا فِي مَسْجِدٍ جَامِعٍ. رَوَاهُ أَبُو دَاوُدَ","english":{"narrator":"","text":"She said that the sunna for one who is observing a period of private devotion in a mosque is not to visit an invalid, or attend a funeral, or touch or embrace one’s wife, or go out for anything but necessary purposes. There is no period of private devotion in a mosque without fasting, and it must be carried out in a congregational mosque. \n\nAbu Dawud transmitted it."}},{"id":147,"idInBook":147,"chapterId":7,"bookId":14,"arabic":"عَنِ ابْنِ عُمَرَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ إِذَا اعْتَكَفَ طُرِحَ لَهُ فِرَاشُهُ أَوْ يُوضَعُ لَهُ سَرِيرُهُ وَرَاءَ أسطوانه التَّوْبَة. رَوَاهُ ابْن مَاجَه","english":{"narrator":"","text":"Ibn ‘Umar said that when the Prophet observed a period of private devotion in the mosque his bedding was placed for him, or a couch was put down for him, behind the column of repentance.* \n*A column in the Prophet's mosque in Medina, said to have got this name because the repentance of Abu Lubaba was accepted beside it.\n\nIbn Majah transmitted it."}},{"id":148,"idInBook":148,"chapterId":7,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي الْمُعْتَكَفِ: «هُوَ يَعْتَكِفُ الذُّنُوبَ وَيُجْرَى لَهُ مِنَ الْحَسَنَاتِ كَعَامِلِ الْحَسَنَات كلهَا» . رَوَاهُ ابْن مَاجَه","english":{"narrator":"","text":"Ibn ‘Abbas reported God’s messenger as saying about one who observes a period of private devotion in a mosque, “He turns away from sins and he is rewarded for good deeds like one who does all good deeds.” \n\nIbn Majah transmitted it."}}],"chapter":{"id":7,"bookId":14,"arabic":"كتاب الصوم","english":"Fasting"}}