{"metadata":{"length":112,"arabic":{"title":"مشكاة المصابيح","author":"الإمام الكاتب التبريزي","introduction":"كتاب فضائل القرآن"},"english":{"title":"Mishkat al-Masabih","author":"Al-Khatib Al-Tabrizi","introduction":"The Excellent Qualities of the Qur'an"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":8,"bookId":14,"arabic":"عَنْ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «خَيْرُكُمْ من تعلم الْقُرْآن وَعلمه» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"‘Uthmān reported God’s messenger as saying, “The best among you is he who learns and teaches the Qur’ān.” \n\nBukhārī transmitted it."}},{"id":2,"idInBook":2,"chapterId":8,"bookId":14,"arabic":"وَعَنْ عُقْبَةَ بْنِ عَامِرٍ قَالَ: خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ فِي الصُّفَّةِ فَقَالَ: «أَيُّكُمْ يُحِبُّ أَنْ يَغْدُوَ كُلَّ يَوْم إِلَى بطحان أَو إِلَى العقيق فَيَأْتِي مِنْهُ بِنَاقَتَيْنِ كَوْمَاوَيْنِ فِي غَيْرِ إِثْمٍ وَلَا قَطْعِ رحم» فَقُلْنَا يَا رَسُول الله نُحِبُّ ذَلِكَ قَالَ: «أَفَلَا يَغْدُو أَحَدُكُمْ إِلَى الْمَسْجِدِ فَيَعْلَمُ أَوْ يَقْرَأُ آيَتَيْنِ مِنْ كِتَابِ الله عز وَجل خير لَهُ من نَاقَة أَو نَاقَتَيْنِ وَثَلَاثٍ خَيْرٌ لَهُ مِنْ ثَلَاثٍ وَأَرْبَعٍ خَيْرٌ لَهُ مِنْ أَرْبَعٍ وَمِنْ أَعْدَادِهِنَّ مِنَ الْإِبِل» . رَوَاهُ مُسلم","english":{"narrator":"‘Uqba b. ‘Āmir said:","text":"When we were in the Suffa (A kind of verandah at the mosque in Medina where certain poor people lived) God’s mes­senger came out and asked, “Which of you would like to go out every morning to Buthān or al-‘Aqīq (Two wādis not far from Medina where camels were sold) and bring two large-humped she-camels without being guilty of sin or severing ties of relationship?” We replied, “Messenger of God, we would all like that.” He said, “Does not one of you go out in the morning to the mosque and teach or recite two verses of God’s Book? That is better for him than two she- camels, and three verses are better for him than three she-camels, and four verses are better for him than four she-camels, and so on than their numbers in camels.” \n\nMuslim transmitted it."}},{"id":3,"idInBook":3,"chapterId":8,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَيُحِبُّ أَحَدُكُمْ إِذَا رَجَعَ إِلَى أَهْلِهِ أَنْ يَجِدَ فِيهِ ثَلَاثَ خَلِفَاتٍ عِظَامٍ سِمَانٍ» . قُلْنَا: نَعَمْ. قَالَ : «فَثَلَاثُ آيَاتٍ يَقْرَأُ بِهِنَّ أَحَدُكُمْ فِي صلَاته خَيْرٌ لَهُ مِنْ ثَلَاثِ خَلِفَاتٍ عِظَامٍ سِمَانٍ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abū Huraira reported God’s messenger as saying, “Would one of you like, when he returns to his family, to find there three large, fat pregnant she-camels? When we replied that we would, he said, “Three verses which one of you recites in his prayer are better for him than three large, fat, pregnant she-camels.” \n\nMuslim transmitted it."}},{"id":4,"idInBook":4,"chapterId":8,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْمَاهِرُ بِالْقُرْآنِ مَعَ السَّفَرَةِ الْكِرَامِ الْبَرَرَةِ وَالَّذِي يَقْرَأُ الْقُرْآنَ وَيَتَتَعْتَعُ فِيهِ وَهُوَ عَلَيْهِ شاق لَهُ أَجْرَانِ»","english":{"narrator":"","text":"‘Ā’isha reported God’s messenger as saying, “One who is skilled in the Qur’ān is associated with the noble, upright recording angels; and he who falters when reciting the Qur’ān and finds it difficult for him will have a double reward.” \n\n(Bukhārī and Muslim.)"}},{"id":5,"idInBook":5,"chapterId":8,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" لَا حَسَدَ إِلَّا على اثْنَيْنِ: رَجُلٌ آتَاهُ اللَّهُ الْقُرْآنَ فَهُوَ يَقُومُ بِهِ آنَاءَ اللَّيْلِ وَآنَاءَ النَّهَارِ وَرَجُلٌ آتَاهُ اللَّهُ مَالًا فَهُوَ يُنْفِقُ مِنْهُ آنَاءَ اللَّيْلِ وَآنَاءَ النَّهَار \"","english":{"narrator":"Ibn ‘Umar reported God’s messenger as saying, “Envy is justified only regarding two types:","text":"a man who, having been given  the Qur’ān by God, stands reciting it during the night and during the day; and a man who having been given property by God, spends on others from it during the night and during the day.” \n\n(Bukhārī and Muslim.)"}},{"id":6,"idInBook":6,"chapterId":8,"bookId":14,"arabic":"وَعَنْ أَبِي مُوسَى الْأَشْعَرِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مثل الْمُؤمن الَّذِي يقْرَأ الْقُرْآن كَمثل الْأُتْرُجَّةِ رِيحُهَا طِيبٌ وَطَعْمُهَا طَيِّبٌ وَمَثَلُ الْمُؤْمِنِ الَّذِي لَا يقْرَأ الْقُرْآن كَمثل التمرة لَا ريح لَهَا وطعمها حلوومثل الْمُنَافِقِ الَّذِي لَا يَقْرَأُ الْقُرْآنَ كَمَثَلِ الْحَنْظَلَةِ لَيْسَ لَهَا رِيحٌ وَطَعْمُهَا مُرٌّ وَمَثَلُ الْمُنَافِقِ الَّذِي يقْرَأ الْقُرْآن مثل الريحانة رِيحهَا طيب وَطَعْمُهَا مَرٌّ» . مُتَّفَقٌ عَلَيْهِ. وَفِي رِوَايَةٍ: «الْمُؤْمِنُ الَّذِي يَقْرَأُ الْقُرْآنَ وَيَعْمَلُ بِهِ كَالْأُتْرُجَّةِ وَالْمُؤْمِنُ الَّذِي لَا يَقْرَأُ الْقُرْآنَ وَيَعْمَلُ بِهِ كَالتَّمْرَةِ»","english":{"narrator":"","text":"Abū Mūsa al-Ash'ari reported God’s messenger as saying, “A be­liever who recites the Qur’ān is like a citron whose fragrance is sweet and whose taste is sweet, a believer who does not recite the Qur’ān is like a date which has no fragrance but has a sweet state, a hypocrite who does not recite the Qur’ān is like the colocynth which has no fragrance and has a better taste, and the hypocrite who recites the Qur’ān is like basil whose fragrance is sweet but whose taste is bitter.” A version has, “A believer who recites the Qur’ān and acts according to it is like a citron, and a believer who does not recite the Qur’ān but acts according to it is like a date.”\n\n(Bukhārī and Muslim.)"}},{"id":7,"idInBook":7,"chapterId":8,"bookId":14,"arabic":"وَعَنْ عُمَرَ بْنِ الْخَطَّابِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «إِن الله يَرْفَعُ بِهَذَا الْكِتَابِ أَقْوَامًا وَيَضَعُ بِهِ آخَرِينَ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"‘Umar b. al Khattāb reported God’s messenger as saying, “By this Book God exalts some peoples and lowers others.” \n\nMuslim trans­mitted it."}},{"id":8,"idInBook":8,"chapterId":8,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّ أُسَيْدَ بنَ حُضَيْرٍ قَالَ: بَيْنَمَا هُوَ يَقْرَأُ مِنَ اللَّيْلِ سُورَةَ الْبَقَرَةِ وَفَرَسُهُ مَرْبُوطَةٌ عِنْدَهُ إِذْ جَالَتِ الْفرس فَسكت فَسَكَتَتْ فَقَرَأَ فجالت الْفرس فَسكت فَسَكَتَتْ الْفرس ثُمَّ قَرَأَ فَجَالَتِ الْفَرَسُ فَانْصَرَفَ وَكَانَ ابْنُهُ يحيى قَرِيبا مِنْهَا فأشفق أَن تصيبه فَلَمَّا أَخَّرَهُ رَفْعَ رَأْسَهُ إِلَى السَّمَاءِ فَإِذَا مِثْلُ الظُّلَّةِ فِيهَا أَمْثَالُ الْمَصَابِيحِ فَلَمَّا أَصْبَحَ حَدَّثَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «اقْرَأْ يَا ابْنَ حُضَيْرٍ اقْرَأْ يَا ابْنَ حُضَيْرٍ» . قَالَ فَأَشْفَقْتُ يَا رَسُولَ اللَّهِ أَنْ تَطَأَ يحيى وَكَانَ مِنْهَا قَرِيبا فَرفعت رَأْسِي فَانْصَرَفْتُ إِلَيْهِ وَرَفَعْتُ رَأْسِي إِلَى السَّمَاءِ فَإِذَا مِثْلُ الظُّلَّةِ فِيهَا أَمْثَالُ الْمَصَابِيحِ فَخَرَجَتْ حَتَّى لَا أَرَاهَا قَالَ: «وَتَدْرِي مَا ذَاكَ؟» قَالَ لَا قَالَ: «تِلْكَ الْمَلَائِكَةُ دَنَتْ لِصَوْتِكَ وَلَوْ قَرَأْتَ لَأَصْبَحَتْ يَنْظُرُ النَّاسُ إِلَيْهَا لَا تَتَوَارَى مِنْهُمْ» . مُتَّفَقٌ عَلَيْهِ. وَاللَّفْظُ لِلْبُخَارِيِّ وَفِي مُسْلِمٍ: «عرجت فِي الجو» بدل: «خرجت على صِيغَة الْمُتَكَلّم»","english":{"narrator":"","text":"Abū Sa'īd al-Khudrī told of Usaid b. Hudair saying that one night when he was reciting sūra al-Baqara (Qur’ān, 2) with his mare tied beside him it moved round in a circle, so he stopped reciting and it stopped moving. He resumed his recitation and it went round in a circle, so he stopped reciting and it stopped moving. Once more he recited and the mare moved round in a circle, so he left off reciting, for his son Yahyā was near it and he was afraid it might injure him. When he had moved him back he raised his head to the sky and saw something like a canopy with what seemed to be lamps in it, and when he told the Prophet of it in the morning, he said, “You should have kept on reciting, Ibn Hudair, you should have kept on reciting, Ibn Hudair.” He replied, “I was afraid, messenger of God, that it might trample on Yahyā who was near it, so I went to him, and when I raised my head to the sky and saw something like a canopy with what seemed to be lamps in it, I went out but could not see them.” He asked whether he knew what that was, and when he replied that he did not, he said, “Those were the angles who had drawn near to listen to your voice, and if you had continued reciting the people would have looked at them in the morning and they would not have concealed themselves from them.” \n\n(Bukhārī and Muslim, the wording being Bukhārī’s). Muslim has, “They went up into the air” instead of “I went out.”"}},{"id":9,"idInBook":9,"chapterId":8,"bookId":14,"arabic":"وَعَنِ الْبَرَاءِ بْنِ عَازِبٍ قَالَ: كَانَ رَجُلٌ يَقْرَأُ سُورَةَ الْكَهْفِ وَإِلَى جَانِبِهِ حِصَانٌ مَرْبُوطٌ بِشَطَنَيْنِ فَتَغَشَّتْهُ سَحَابَةٌ فَجَعَلَتْ تَدْنُو وَتَدْنُو وَجَعَلَ فَرَسُهُ يَنْفِرُ فَلَمَّا أَصْبَحَ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ ذَلِكَ لَهُ فَقَالَ: «تِلْكَ السكينَة تنزلت بِالْقُرْآنِ»","english":{"narrator":"","text":"Al-Barā said that when a man was reciting sūra al-Kahf (Qur’ān,18) with a horse tied with two ropes at his side a cloud overshadowed him, and as it began to come nearer and nearer his horse began to take fright. He went and mentioned that to the Prophet in the morning and he said, “That was the Shechina* which came down by reason of the Qur’ān.” \n*The word in Arabic is as-sakīna which may be translated calmness; but here it has the article which indicates something more precise. It may therefore here refer to the Jewish idea of the Shechina which indicates a divine visitation,\n\n(Bukhārī and Muslim.)"}},{"id":10,"idInBook":10,"chapterId":8,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ بْنِ الْمُعَلَّى قَالَ: كُنْتُ أُصَلِّي فِي الْمَسْجِدِ فَدَعَانِي النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسلم فَلم أجبه حَتَّى صليت ثُمَّ أَتَيْتُهُ. فَقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي كنت أُصَلِّي فَقَالَ أَلَمْ يَقُلِ اللَّهُ (اسْتَجِيبُوا لِلَّهِ وَلِلرَّسُولِ إِذَا دعَاكُمْ)\nثمَّ قَالَ لي: «أَلَا أُعَلِّمُكَ أَعْظَمَ سُورَةٍ فِي الْقُرْآنِ قَبْلَ أَنْ تَخْرُجَ مِنَ الْمَسْجِدِ» . فَأَخَذَ بِيَدِي فَلَمَّا أَرَادَ أَن يخرج قلت لَهُ ألم تقل لأعلمنك سُورَة هِيَ أعظم سُورَةً مِنَ الْقُرْآنِ قَالَ: (الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ)\nهِيَ السَّبْعُ الْمَثَانِي وَالْقُرْآنُ الْعَظِيمُ الَّذِي أُوتِيتهُ \". رَوَاهُ البُخَارِيّ","english":{"narrator":"Abū Sa'īd b. al-Mu‘allā said:","text":"When I was praying in the mosque the Prophet called me and I did not answer him, but I went to him afterwards and explained that I had been praying, whereupon he asked me whether God had not said, “Respond to God and to the messenger when He calls you,” (Qur’ān, 8:24)  adding, “Let me teach you the greatest sūra in the Qur’ān before you leave the mosque.” He then took me by the hand, and when we were about to go out I reminded him of saying he would teach me the greatest sūra in the Qur’ān. He said, “It is, ‘Praise be to God, the Lord of the universe’, (Qur'ān,1) which is the seven oft-repeated verses and the mighty Qur’ān’ (Qur’ān, 15:87) which has been brought to me.”  \n\nBukhārī transmitted it."}},{"id":11,"idInBook":11,"chapterId":8,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَجْعَلُوا بِيُوتَكُمْ مَقَابِرَ إِنَّ الشَّيْطَانَ يَنْفِرُ من الْبَيْت الَّذِي يقْرَأ فِيهِ سُورَة الْبَقَرَة» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abū Huraira reported God’s messenger as saying, “Do not make your houses graveyards*. The devil flies from the house in which sūra al-Baqara is recited.” \n*A house in which there is no prayer or recitation of the Qur'ān is here intended. The dead cannot engage in these practices, so such a house is likened to a graveyard.\nMuslim transmitted it."}},{"id":12,"idInBook":12,"chapterId":8,"bookId":14,"arabic":"عَنْ أَبِي أُمَامَةَ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم يَقُول: «اقْرَءُوا الْقُرْآنَ فَإِنَّهُ يَأْتِي يَوْمَ الْقِيَامَةِ شَفِيعًا لِأَصْحَابِهِ اقْرَءُوا الزَّهْرَاوَيْنِ الْبَقَرَةَ وَسُورَةَ آلِ عِمْرَانَ فَإِنَّهُمَا تَأْتِيَانِ يَوْمَ الْقِيَامَةِ كَأَنَّهُمَا غَمَامَتَانِ أَوْ كَأَنَّهُمَا غَيَايَتَانِ أَو فِرْقَانِ مِنْ طَيْرٍ صَوَافَّ تُحَاجَّانِ عَنْ أَصْحَابِهِمَا اقْرَءُوا سُورَةَ الْبَقَرَةِ فَإِنَّ أَخْذَهَا بَرَكَةٌ وَتَرْكَهَا حَسْرَةٌ وَلَا تستطيعها البطلة» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abū Umāma said he heard God’s messenger say, “Recite the Qur’ān, for on the day of resurrection it will come as an intercessor for those who recite it. Recite the two shining ones, Baqara and sūra Āl Imrān (Qur’ān, 2 and 3). for on the day of resurrection they will come as two clouds or two shades, or two flocks of birds in ranks* pleading for those who recite them. Recite sūra al-Baqara, for using it produces blessing and abandoning it produces regret, and the slothful are unable to recite it.”\n *The alternative may indicate that the transmitter was not sure which word was used, “clouds” or \"shades”.\n\nMuslim transmitted it."}},{"id":13,"idInBook":13,"chapterId":8,"bookId":14,"arabic":"وَعَن النواس بن سمْعَان قَالَ: سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «يُؤْتَى بِالْقُرْآنِ يَوْمَ الْقِيَامَةِ وَأَهْلِهِ الَّذِينَ كَانُوا يَعْمَلُونَ بِهِ تَقْدُمُهُ سُورَةُ الْبَقَرَةِ وَآلُ عِمْرَانَ كَأَنَّهُمَا غَمَامَتَانِ أَوْ ظُلَّتَانِ سَوْدَاوَانِ بَيْنَهُمَا شَرْقٌ أَوْ كَأَنَّهُمَا فِرْقَانِ مِنْ طَيْرٍ صَوَافَّ تحاجان عَن صَاحبهمَا» . رَوَاهُ مُسلم","english":{"narrator":"","text":"An-Nawwās b. Sam'ān said he heard the Prophet say, “On the day of resurrection the Qur’ān and those who acted according to it will be brought with sūra al-Baqara and Āl ‘Imran preceding them* like two black clouds or canopies with light between them, or as though they were two flocks of birds in ranks pleading for the one who recited them.” \n* Mirqāt says the pronoun may refer either to the people ahl mentioned, or to the Qur’ān, One may therefore read here either ‘them’ or 'it.'\n\nMuslim transmitted it."}},{"id":14,"idInBook":14,"chapterId":8,"bookId":14,"arabic":"وَعَنْ أُبَيِّ بْنِ كَعْبٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَا أَبَا الْمُنْذِرِ أَتَدْرِي أَيُّ آيَةٍ مِنْ كِتَابِ اللَّهِ مَعَك أعظم؟» . قَالَ: قُلْتُ اللَّهُ وَرَسُولُهُ أَعْلَمُ قَالَ: «يَا أَبَا الْمُنْذِرِ أَتَدْرِي أَيُّ آيَةٍ مِنْ كِتَابِ اللَّهِ مَعَك أعظم؟» . قَالَ: قُلْتُ (اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ القيوم)\nقَالَ فَضرب فِي صَدْرِي وَقَالَ: «وَالله لِيَهنك الْعلم أَبَا الْمُنْذر» . رَوَاهُ مُسلم","english":{"narrator":"Ubayy b. Ka‘b said:","text":"God’s messenger asked, “Abul Mundhir (this is Ubayy’s Kunya), do you know which verse of God’s Book that you have is greatest?” I replied, “God and His messenger know best.” He repeated his question and I said, “God, there is no god but He, the Living, the Eternal.” Thereupon he struck me on the breast and said, “May knowledge be pleasant for you, Abul Mundhir!” \n\nMuslim transmitted it."}},{"id":15,"idInBook":15,"chapterId":8,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: وَكَّلَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِحِفْظِ زَكَاةِ رَمَضَانَ فَأَتَانِي آتٍ فَجَعَلَ يَحْثُو من الطَّعَام فَأَخَذته وَقلت وَالله لَأَرْفَعَنَّكَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنِّي مُحْتَاجٌ وَعَلَيَّ عِيَالٌ وَلِي حَاجَةٌ شَدِيدَةٌ قَالَ فَخَلَّيْتُ عَنْهُ فَأَصْبَحْتُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَا أَبَا هُرَيْرَة مَا فعل أسيرك البارحة» . قَالَ قُلْتُ يَا رَسُولَ اللَّهِ شَكَا حَاجَةً شَدِيدَةً وَعِيَالًا فَرَحِمْتُهُ فَخَلَّيْتُ سَبِيلَهُ قَالَ: «أَمَا إِنَّهُ قَدْ كَذَبَكَ وَسَيَعُودُ» . فَعَرَفْتُ أَنَّهُ سَيَعُودُ لِقَوْلِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَنَّهُ سيعود» . فَرَصَدْتُهُ فَجَاءَ يَحْثُو مِنَ الطَّعَامِ فَأَخَذْتُهُ فَقُلْتُ: لَأَرْفَعَنَّكَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ دَعْنِي فَإِنِّي مُحْتَاجٌ وَعَلَيَّ عِيَالٌ لَا أَعُودُ فَرَحِمْتُهُ فَخَلَّيْتُ سَبِيلَهُ فَأَصْبَحْتُ فَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَا أَبَا هُرَيْرَةَ مَا فَعَلَ أَسِيرُكَ؟» قُلْتُ يَا رَسُولَ اللَّهِ شَكَا حَاجَةً شَدِيدَةً وَعِيَالًا فَرَحِمْتُهُ فَخَلَّيْتُ سَبِيلَهُ قَالَ: «أَمَا إِنَّهُ قَدْ كَذبك وَسَيَعُودُ» . فرصدته الثَّالِثَة فَجَاءَ يَحْثُو مِنَ الطَّعَامِ فَأَخَذْتُهُ فَقُلْتُ لَأَرْفَعَنَّكَ إِلَى رَسُول الله وَهَذَا آخِرُ ثَلَاثِ مَرَّاتٍ إِنَّكَ تَزْعُمُ لَا تَعُودُ ثُمَّ تَعُودُ قَالَ دَعْنِي أُعَلِّمُكَ كَلِمَاتٍ ينفعك الله بهَا قلت مَا هُوَ قَالَ إِذَا أَوَيْتَ إِلَى فِرَاشِكَ فَاقْرَأْ آيَةَ الْكُرْسِيِّ (اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ)\nحَتَّى تَخْتِمَ الْآيَةَ فَإِنَّكَ لَنْ يَزَالَ عَلَيْكَ من الله حَافظ وَلَا يقربنك شَيْطَانٌ حَتَّى تُصْبِحَ فَخَلَّيْتُ سَبِيلَهُ فَأَصْبَحْتُ فَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا فَعَلَ أَسِيرُكَ؟» قُلْتُ: زَعَمَ أَنَّهُ يُعَلِّمُنِي كَلِمَات يَنْفَعنِي الله بهَا فخليت سبيلهقال النَّبِي صلى الله عَلَيْهِ وَسلم: «أما إِنَّه قد صدقك وَهُوَ كذوب تعلم من تخاطب مُنْذُ ثَلَاث لَيَال» . يَا أَبَا هُرَيْرَة قَالَ لَا قَالَ: «ذَاك شَيْطَان» . رَوَاهُ البُخَارِيّ","english":{"narrator":"Abū Huraira said:","text":"I had been placed in charge of the zakāt of Ramadān by God’s messenger, and when someone came to me and began to take up handfuls of the food, I seized him and told him I was certainly going to take him before God’s messenger. But when he said, “I am needy, have children dependent on me, and my need is great,” I let him go. In the morning the Prophet asked, “What happened to your prisoner last night, Abū Huraira?” and I replied, “Messenger of God, he complained of great need and of having children dependent on him, so I had pity on him and let him go.” He said, “He lied to you, and he will come back.” I realised that he would return because God’s messenger had told me so, and therefore I lay in wait for him. When he came and began to take up handfuls of the food, I seized him and told him I was certainly going to take him before God's messenger; but when he said, “Let me go, for I am needy with children dependent on me, and I shall not return” I had pity on him and let him go. In the morning God’s messenger asked me, “What has happened to your prisoner, Abū Huraira?” and I replied, “Messenger of God, he complained of great need and of having children dependent on him, so I had pity on him and let him go.” He said, “He has certainly lied to you, and he will come back,” so I lay in wait for him, and when he came and took up handfuls of food I seized him and said, “I am certainly going to take you before God’s messenger, for this is the third time you assert you will not return, and then you do.” He said, “If you let me go I will teach you some words by which God will benefit you. When you go to your bed recite the Throne Verse (Qur’ān 2:255), ‘God, there is no god but He, the Living, the Eternal’ to the end of the verse, for a guardian from God will then remain over you and no devil will come near you till the morning.” I therefore let him go, and in the morning God’s messenger asked me, “What has happened to your prisoner?” I replied, “He asserted that he would teach me some words by which God would benefit me.” He said, “He has certainly told you the truth though he is a great liar. Do you know to whom you have been talking for, three nights?” When I replied that I did not, he said, “That was a devil.”\n\nBukhārī transmit­ted it."}},{"id":16,"idInBook":16,"chapterId":8,"bookId":14,"arabic":"وَعَن ابْن عَبَّاس قَالَ: بَيْنَمَا جِبْرِيلُ قَاعِدٌ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَمِعَ نَقِيضًا مِنْ فَوْقِهِ فَرَفَعَ رَأْسَهُ فَقَالَ: «هَذَا بَابٌ مِنَ السَّمَاءِ فُتِحَ الْيَوْمَ لَمْ يُفْتَحْ قَطُّ إِلَّا الْيَوْمَ فَنَزَلَ مِنْهُ مَلَكٌ فَقَالَ هَذَا مَلَكٌ نَزَلَ إِلَى الْأَرْضِ لَمْ يَنْزِلْ قَطُّ إِلَّا الْيَوْمَ فَسَلَّمَ وَقَالَ أَبْشِرْ بِنُورَيْنِ أُوتِيتَهُمَا لَمْ يُؤْتَهُمَا نَبِيٌّ قَبْلَكَ فَاتِحَةُ الْكِتَابِ وَخَوَاتِيمُ سُورَةِ الْبَقَرَةِ لَنْ تَقْرَأَ بِحَرْفٍ مِنْهُمَا إِلَّا أَعْطيته» . رَوَاهُ مُسلم","english":{"narrator":"Ibn ‘Abbas said that while Gabriel was sitting with the Prophet he heard a creaking sound above him, and after raising his head he said, “This is a gate opened in heaven to-day which has never been opened before.” Then when an angel descended through it he said, “This is an angel come down to earth who has never come down before.” He gave a salutation and said, “Rejoice in two lights brought to you which have not been brought to any prophet before you:","text":"Fātihat al-Kitāb (Qur’ān, 1) and the last verses of sūra al-Baqara (Qur’ān, 2). You will not recite a phrase of them without being given the blessing it contains.” \n\nMuslim transmitted it."}},{"id":17,"idInBook":17,"chapterId":8,"bookId":14,"arabic":"وَعَنْ أَبِي مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْآيَتَانِ مِنْ آخَرِ سُورَة الْبَقَرَة من قَرَأَ بهما فِي لَيْلَة كفتاه»","english":{"narrator":"","text":"Abū Mas'ūd reported God’s messenger as saying, “If anyone recites the two verses at the end of sūra al-Baqara at night they will avert harm from him.” *Or will be enough for him. \n\n(Bukhārī and Muslim.)"}},{"id":18,"idInBook":18,"chapterId":8,"bookId":14,"arabic":"وَعَنْ أَبِي الدَّرْدَاءِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ حَفِظَ عشر آيَات من أول سُورَة الْكَهْف عصم من فتْنَة الدَّجَّال» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abūd Dardā’ reported God’s messenger as saying, “If anyone learns by heart ten verses at the beginning of sūra al-Kahf (Qur’ān, 18) he will be pro­tected from the dajjal.”\n \nMuslim transmitted it."}},{"id":19,"idInBook":19,"chapterId":8,"bookId":14,"arabic":"وَعَنْ أَبِي الدَّرْدَاءِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَيَعْجَزُ أَحَدُكُمْ أَنْ يَقْرَأَ فِي لَيْلَةٍ ثُلُثَ الْقُرْآنِ؟» قَالُوا: وَكَيْفَ يَقْرَأُ ثُلُثَ الْقُرْآنِ؟ قَالَ: «قُلْ هُوَ الله أحد» يعدل ثلث الْقُرْآن \". رَوَاهُ مُسلم\nوَرَوَاهُ البُخَارِيّ عَن أبي سعيد","english":{"narrator":"","text":"He reported God’s messenger as saying, “Is any of you incapable of reciting a third of the Qur’ān in a night?” On being asked how they could recite a third of the Qur’ān he replied. “‘Say, He is God, One’ (Qur’ān, 112) is equivalent to a third of the Qur’ān.” \n\nMuslim transmitted it, and Bukhārī transmitted it from Abū Sa'īd."}},{"id":20,"idInBook":20,"chapterId":8,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَ رَجُلًا عَلَى سَرِيَّةٍ وَكَانَ يَقْرَأُ لأَصْحَابه فِي صلَاتهم فيختم ب (قل هُوَ اللَّهُ أَحَدٌ)\nفَلَمَّا رَجَعُوا ذَكَرُوا ذَلِكَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «سَلُوهُ لِأَيِّ شَيْءٍ يَصْنَعُ ذَلِكَ» فَسَأَلُوهُ فَقَالَ لِأَنَّهَا صفة الرَّحْمَن وَأَنا أحب أَن أَقرَأ بِهَا فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَخْبِرُوهُ أَن الله يُحِبهُ»","english":{"narrator":"","text":"‘Ā’isha said that the Prophet sent a man in charge of an expedition and he would recite for his companions during their prayer, finishing with “Say, He is God, One.” When they returned they mentioned that to the Prophet, and he told them to ask him why he did that. They asked him and he replied, “Because it is a description of the Com­passionate One, and I like to recite it.” Then the Prophet said, “Tell him that God loves him.” \n\n(Bukhārī and Muslim.)"}},{"id":21,"idInBook":21,"chapterId":8,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: إِنَّ رَجُلًا قَالَ: يَا رَسُولَ اللَّهِ إِنِّي أُحِبُّ هَذِهِ السُّورَةَ: (قُلْ هُوَ الله أحد)\nقَالَ: إِنَّ حُبَّكَ إِيَّاهَا أَدْخَلَكَ الْجَنَّةَ \". رَوَاهُ التِّرْمِذِيّ وروى البُخَارِيّ مَعْنَاهُ","english":{"narrator":"","text":"Anas said a man told God's messenger that he liked the sūra “Say, He is God, One,” to which he replied, “Your love of it will bring you into paradise.” \n\nTirmidhī transmitted it and Bukhārī transmitted some­thing to the same effect."}},{"id":22,"idInBook":22,"chapterId":8,"bookId":14,"arabic":"وَعَنْ عُقْبَةَ بْنِ عَامِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" أَلَمْ تَرَ آيَاتٍ أُنْزِلَتِ اللَّيْلَةَ لَمْ يُرَ مِثْلُهُنَّ قَطُّ (قل أعوذ بِرَبّ الفلق)\nو (قل أعوذ بِرَبّ النَّاس)\nرَوَاهُ مُسلم","english":{"narrator":"","text":"‘Uqba b. ‘Āmir reported God’s messenger as saying, “What won­derful verses have been sent down to-night! The like of them has never been seen. They are ‘Say, I seek refuge in the Lord of the dawn’ and ‘Say, I seek refuge in the Lord of men.’” (Qur’ān, 113 and 114).\n\nMuslim transmitted it."}},{"id":23,"idInBook":23,"chapterId":8,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا أَوَى إِلَى فِرَاشِهِ كُلَّ لَيْلَةٍ جَمَعَ كَفَّيْهِ ثُمَّ نَفَثَ فِيهِمَا فَقَرَأَ فيهمَا (قل هُوَ الله أحد)\nو (قل أعوذ بِرَبّ الفلق)\nو (قل أَعُوذُ بِرَبِّ النَّاسِ)\nثُمَّ يَمْسَحُ بِهِمَا مَا اسْتَطَاعَ مِنْ جَسَدِهِ يَبْدَأُ بِهِمَا عَلَى رَأْسِهِ وَوَجْهِهِ وَمَا أَقْبَلَ مِنْ جَسَدِهِ يَفْعَلُ ذَلِكَ ثَلَاث مَرَّات \"\nوَسَنَذْكُرُ حَدِيثَ ابْنِ مَسْعُودٍ: لَمَّا أُسْرِيَ بِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي بَابِ الْمِعْرَاج إِن شَاءَ الله تَعَالَى","english":{"narrator":"","text":"‘Ā’isha said that every night when the Prophet went to his bed he joined his hands and breathed into them, reciting into them, ‘Say, He is God, One’; ‘Say, I seek refuge in the Lord of the dawn’; and ‘Say, I seek refuge in the Lord of men.’ Then he would wipe as much of his body as he could with his hands, beginning with his head, his face and the front of his body, doing that three times. \n\n(Bukhārī and Muslim)"}},{"id":24,"idInBook":24,"chapterId":8,"bookId":14,"arabic":"عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" ثَلَاثَةٌ تَحْتَ الْعَرْشِ يَوْمَ الْقِيَامَةِ الْقُرْآنُ يُحَاجُّ الْعِبَادَ لَهُ ظَهْرٌ وَبَطْنٌ وَالْأَمَانَةُ وَالرَّحِمُ تُنَادِي: أَلَا مَنْ وَصَلَنِي وَصَلَهُ اللَّهُ وَمَنْ قَطَعَنِي قَطَعَهُ اللَّهُ \". رَوَاهُ فِي شرح السّنة","english":{"narrator":"Ibn Mas'ūd’s tradition, “When God’s messenger was taken up to heaven ...” will be mentioned in the chapter on the Mi'rāj, if God most high will. \nMi'rāj, Book 25, ch. 23, second last tradition in I.\n‘Abd ar-Rahmān b. ‘Auf reported the Prophet as saying, “Three things will be under the Throne on the day of resurrection:","text":"the Qur’ān which will contend with men, having an exoteric and an esoteric mean­ing; the trust;* and ties of relationship which will say, ‘God join those who joined me and sever those who severed me’!” \n*Cf. Qur’ān, 33:72\n\nIt is transmitted in Sharh as-sunna"}},{"id":25,"idInBook":25,"chapterId":8,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" يُقَالُ لِصَاحِبِ الْقُرْآنِ: اقْرَأْ وَارَتْقِ وَرَتِّلْ كَمَا كُنْتَ تُرَتِّلُ فِي الدُّنْيَا فَإِنَّ مَنْزِلَكَ عِنْدَ آخِرِ آيَة تقرؤها \". رَوَاهُ أَحْمد وَالتِّرْمِذِيّ أَبُو دَاوُد وَالنَّسَائِيّ","english":{"narrator":"","text":"‘Abdallāh b. ‘Amr reported God’s messenger as saying, “The one who was devoted to the Qur’ān will be told to recite, ascend and recite carefully as he recited carefully when he was in the world, for he will reach his abode when he comes to the last verse he recites.” \n\nAhmad, Tirmidhī, Abū Dāwūd and Nasā’ī transmitted it."}},{"id":26,"idInBook":26,"chapterId":8,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ الَّذِي لَيْسَ فِي جَوْفِهِ شَيْءٌ مِنَ الْقُرْآنِ كَالْبَيْتِ الْخَرِبِ» . رَوَاهُ التِّرْمِذِيُّ وَالدَّارِمِيُّ. وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ صَحِيح","english":{"narrator":"","text":"Ibn 'Abbas reported God’s messenger as saying, “Anyone who has nothing of the Qur’ān within him is like a ruined house.” \n\nTirmidhī and Dārimī transmitted it, and Tirmidhī said this is a sahīh tradition."}},{"id":27,"idInBook":27,"chapterId":8,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" يَقُولُ الرَّبُّ تَبَارَكَ وَتَعَالَى: مَنْ شَغَلَهُ الْقُرْآنُ عَنْ ذِكْرِي وَمَسْأَلَتِي أَعْطَيْتُهُ أَفْضَلَ مَا أُعْطِي السَّائِلِينَ. وَفَضْلُ كَلَامِ اللَّهِ عَلَى سَائِرِ الْكَلَامِ كَفَضْلِ اللَّهِ عَلَى خَلْقِهِ \". رَوَاهُ التِّرْمِذِيُّ وَالدَّارِمِيُّ وَالْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَانِ وَقَالَ التِّرْمِذِيُّ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ","english":{"narrator":"","text":"Abū Sa'id reported God’s messenger as stating, “God who is blessed and exalted says, ‘To him who is so occupied with the Qur’ān as to neglect making mention of me and making request of me I will give the most excellent things I give to those who ask.’ The superiority of God’s words over all other words is like God’s superiority over His creatures.” \n\nTirmidhī, Dārimī, and Baihaqī, in Shu’ab al-īmān, transmitted it, and Tirmidhī said this is a hasan gharīb tradition."}},{"id":28,"idInBook":28,"chapterId":8,"bookId":14,"arabic":"وَعَنِ ابْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" مَنْ قَرَأَ حَرْفًا مِنْ كِتَابِ اللَّهِ فَلَهُ بِهِ حَسَنَةٌ وَالْحَسَنَةُ بِعَشْرِ أَمْثَالِهَا لَا أَقُولُ: آلم حَرْفٌ. أَلْفٌ حَرْفٌ وَلَامٌ حَرْفٌ وَمِيمٌ حَرْفٌ \". رَوَاهُ التِّرْمِذِيُّ وَالدَّارِمِيُّ وَقَالَ التِّرْمِذِيُّ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيب إِسْنَادًا","english":{"narrator":"Ibn Mas'ūd reported God’s messenger as saying:","text":"“If anyone recites a letter of God’s Book he will be credited with a good deed, and a good deed gets a tenfold reward (Al-Qur’ān, 6:160). I do not say that A.L.M are one letter*, but alif is a letter, lām is a letter and mīm is a letter.” \n*These letters occur at the beginning of sūras 2, 3, 29, 30, 31 and 32. No satisfactory explanation of their meaning has been given. A brief discussion of them is given by Abdullāh Yūsuf Ali in The Holy Qur’ān, Text, Translation & Commentary (Lahore, 1934 and later editions), note 25. Sea also pp. 118-120.\n\nTirmidhī and Dārimī transmitted it, Tirmidhī saying this is a hasan sahīh tradition whose isnad is gharīb."}},{"id":29,"idInBook":29,"chapterId":8,"bookId":14,"arabic":"وَعَنِ الْحَارِثِ الْأَعْوَرِ قَالَ: مَرَرْتُ فِي الْمَسْجِدِ فَإِذَا النَّاسُ يَخُوضُونَ فِي الْأَحَادِيثِ فَدَخَلْتُ عَلَى عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ فَأَخْبَرْتُهُ قَالَ: أَوَقَدْ فَعَلُوهَا؟ قلت نعم قَالَ: أما إِنِّي قَدْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُول: «أَلا إِنَّهَا سَتَكُون فتْنَة» . فَقلت مَا الْمَخْرَجُ مِنْهَا يَا رَسُولَ اللَّهِ قَالَ: «كتاب الله فِيهِ نبأ مَا كَانَ قبلكُمْ وَخبر مَا بعدكم وَحكم مَا بَيْنكُم وَهُوَ الْفَصْلُ لَيْسَ بِالْهَزْلِ مَنْ تَرَكَهُ مِنْ جَبَّارٍ قَصَمَهُ اللَّهُ وَمَنِ ابْتَغَى الْهُدَى فِي غَيْرِهِ أَضَلَّهُ اللَّهُ وَهُوَ حَبْلُ اللَّهِ الْمَتِينُ وَهُوَ الذِّكْرُ الْحَكِيمُ وَهُوَ الصِّرَاطُ الْمُسْتَقِيمُ هُوَ الَّذِي لَا تَزِيغُ بِهِ الْأَهْوَاءُ وَلَا تَلْتَبِسُ بِهِ الْأَلْسِنَةُ وَلَا يَشْبَعُ مِنْهُ الْعُلَمَاءُ وَلَا يَخْلِقُ على كَثْرَةِ الرَّدِّ وَلَا يَنْقَضِي عَجَائِبُهُ هُوَ الَّذِي لَمْ تَنْتَهِ الْجِنُّ إِذْ سَمِعَتْهُ حَتَّى قَالُوا (إِنَّا سَمِعْنَا قُرْآنًا عَجَبًا يَهْدِي إِلَى الرُّشْدِ فَآمَنا بِهِ)\nمَنْ قَالَ بِهِ صَدَقَ وَمَنْ عَمِلَ بِهِ أُجِرَ وَمَنْ حَكَمَ بِهِ عَدَلَ وَمَنْ دَعَا إِلَيْهِ هُدِيَ إِلَى صِرَاطٍ مُسْتَقِيمٍ» . رَوَاهُ التِّرْمِذِيُّ وَالدَّارِمِيُّ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ إِسْنَادُهُ مَجْهُولٌ وَفِي الْحَارِث مقَال","english":{"narrator":"Al-Hārith al-A‘war said:","text":"While passing in the mosque I found the people engrossed in talk, so I went to visit ‘Alī and told him. He asked if that was really so, and when I assured him that it was, he said he had heard God’s messenger say, “Dissension will certainly come,” and asked him how it could be avoided, to which he replied, “God’s Book is the way, for it contains information of what has happened before you, news of what will happen after you, and a decision regarding matters which occur among you (This is explained as a reference to such matters as unbelief and faith, obedience and dis-obedience, what is lawful and what is forbidden, etc.). It is the distinguisher and is not jesting, (Qur’ān, 86:13). If any overweening person abandons it God will break him, and if anyone seeks guidance elsewhere God will lead him astray. It is God’s strong cord, it is the wise reminder, it is the straight path, it is that by which the desires do not swerve nor the tongues become confused, and the learned cannot grasp it completely.* It does not become worn out by repetition and its wonders do not come to an end. It is that of which the jinn did not hesitate to say when they heard it, ‘We have heard a wonderful recital which guides to what is right, and we believe in it,’ (Qur’ān, 72). He who utters it speaks the truth, he who acts according to it is rewarded, he who pronounces judgment according to it is just, and he who invites people to it guides to a straight path.” \n*The verb used is one ordinarily meaning 'to be satisfied'. Here it is used to indicate that the learned can never learn all there is to be known about the teaching and meaning of the Qur’ān, so that they should be satisfied and feel no need to continue their study of it.  \n\nTirmidhī and Dārimī transmit­ted it, Tirmidhī saying this is a tradition whose isnād is unknown, and al-Hārith is adversely criticised."}},{"id":30,"idInBook":30,"chapterId":8,"bookId":14,"arabic":"وَعَن معَاذ الْجُهَنِيّ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ قَرَأَ الْقُرْآنَ وَعَمِلَ بِمَا فِيهِ أُلْبِسَ وَالِدَاهُ تَاجًا يَوْمَ الْقِيَامَةِ ضَوْءُهُ أَحْسَنُ مِنْ ضَوْءِ الشَّمْسِ فِي بُيُوتِ الدُّنْيَا لَوْ كَانَتْ فِيكُمْ فَمَا ظَنُّكُمْ بِالَّذِي عَمِلَ بِهَذَا؟» . رَوَاهُ أَحْمد وَأَبُو دَاوُد","english":{"narrator":"","text":"Mu'ādh al-Juhani reported God’s messenger as saying, “If anyone recites the Qur’ān and acts according to its contents, on the day of resurrection his parents will be given to wear a crown whose light is better than the light of the sun in the dwellings of this world if it were among you. So what do you think of him who acts according to this?” \n\nAhmad and Abū Dāwūd transmitted it."}},{"id":31,"idInBook":31,"chapterId":8,"bookId":14,"arabic":"وَعَنْ عُقْبَةَ بْنِ عَامِرٍ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَوْ جُعِلَ الْقُرْآنُ فِي إِهَابٍ ثُمَّ أُلْقِيَ فِي النَّار مَا احْتَرَقَ» . رَوَاهُ الدَّارمِيّ","english":{"narrator":"","text":"‘Uqba b. ‘Amir said he heard God's messenger say, “If the Qur’ān were put in a skin and thrown into the fire it would not burn.” \n\nDārimī transmitted it."}},{"id":32,"idInBook":32,"chapterId":8,"bookId":14,"arabic":"وَعَنْ عَلِيَّ بْنَ أَبِي طَالِبٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" مَنْ قَرَأَ الْقُرْآنَ فَاسْتَظْهَرَهُ فَأَحَلَّ حَلَالَهُ وَحَرَّمَ حَرَامَهُ أَدْخَلَهُ اللَّهُ بِهِ الْجَنَّةَ وَشَفَّعَهُ فِي عَشَرَةٍ مِنْ أَهْلِ بَيْتِهِ كُلِّهِمْ قَدْ وَجَبَتْ لَهُ النَّارُ. رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ غَرِيب وَحَفْص بن سُلَيْمَان الرَّاوِي لَيْسَ هُوَ بِالْقَوِيِّ يَضْعُفُ فِي الْحَدِيثِ","english":{"narrator":"","text":"‘Alī reported God’s messenger as saying, “If anyone recites the Qur’ān, learns it by heart, declares what is lawful in it to be lawful and what is unlawful in it to be unlawful, God will bring him into paradise and make him intercessor for ten of his family all of whom have deserved hell.” \n\nAhmad, Tirmidhī, Ibn Majah and Dārimī transmitted it, Tirmidhī saying that this is a gharīb tradition, and that Hafs b. Sulaīmān the transmitter is not strong, but is declared to be a weak traditionist."}},{"id":33,"idInBook":33,"chapterId":8,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم قَالَ لِأُبَيِّ بْنِ كَعْبٍ: «كَيْفَ تَقْرَأُ فِي الصَّلَاةِ؟» فَقَرَأَ أُمَّ الْقُرْآنِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «وَالَّذِي نَفْسِي بِيَدِهِ مَا أنزلت فِي التَّوْرَاة وَلَا فِي الْإِنْجِيل وَلَا فِي الزبُور وَلَا فِي الْفرْقَان مِثْلُهَا وَإِنَّهَا سَبْعٌ مِنَ الْمَثَانِي وَالْقُرْآنُ الْعَظِيمُ الَّذِي أُعْطِيتُهُ» . رَوَاهُ التِّرْمِذِيُّ وَرَوَى الدَّارِمِيُّ مِنْ قَوْلِهِ: «مَا أُنْزِلَتْ» وَلَمْ يَذْكُرْ أُبَيُّ بْنُ كَعْبٍ. وَقَالَ التِّرْمِذِيُّ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ","english":{"narrator":"Abū Huraira said:","text":"When God’s Messenger once asked Ubayy b. Ka'b how he recited in the course of the prayer and he recited Umm al- Qur’ān (Al-Qur’ān 1) , he said, “By Him in whose hand my soul is, nothing like it has been sent down in the Torah, the Injīl, the Zabūr, or the Qur’ān, and it is seven of the oft-repeated verses and the mighty Qur’ān (Qur’ān, 15:87) which I have been given.” \n\nTirmidhī transmitted it, and Dārimī transmitted from “nothing like it has been sent down,” but he did not mention Ubayy b. Ka‘b. Tirmidhī said this is a hasan sahīh tradition."}},{"id":34,"idInBook":34,"chapterId":8,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «تَعَلَّمُوا الْقُرْآنَ فَاقْرَءُوهُ فَإِن مثل الْقُرْآن لمن تعلم وَقَامَ بِهِ كَمثل جراب محشو مسكا يفوح رِيحُهُ كُلَّ مَكَانٍ وَمَثَلُ مَنْ تَعَلَّمَهُ فَرَقَدَ وَهُوَ فِي جَوْفِهِ كَمَثَلِ جِرَابٍ أُوكِئَ عَلَى مسك» . رَوَاهُ التِّرْمِذِيّ وَالنَّسَائِيّ وَابْن مَاجَه","english":{"narrator":"","text":"He reported God's messenger as saying, “Learn and recite the Qur’ān, for to one who learns, recites and uses it in prayer at night it is like a bag filled with musk whose fragrance diffuses itself everywhere; and he who learns it and goes to sleep having it within him is like a bag with musk tied up in it.” \n\nTirmidhī, Nasā’ī and Ibn Mājah transmitted it."}},{"id":35,"idInBook":35,"chapterId":8,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مَنْ قَرَأَ (حم)\nالْمُؤْمِنَ إِلَى (إِلَيْهِ الْمَصِيرُ)\nوَآيَةَ الْكُرْسِيِّ حِينَ يُصْبِحُ حُفِظَ بِهِمَا حَتَّى يُمْسِيَ. وَمَنْ قَرَأَ بِهِمَا حِينَ يُمْسِي حُفِظَ بهما حَتَّى يصبح \". رَوَاهُ التِّرْمِذِيّ والدرامي وَقَالَ التِّرْمِذِيّ هَذَا حَدِيث غَرِيب","english":{"narrator":"He reported God's Messenger as saying:","text":"“If anyone recites in the morning Hā Mīm al-Mu’min (Al-Qur’ān, 40:1-3) to ‘to Him is the final goal’ and the Throne Verse (Al-Qur’ān, 2:255) he will be guarded by them till the evening, and if anyone recites them in the evening he will be guarded by them till the morning.” \n\nTirmidhī and Dārimī transmitted it, Tirmidhī saying this is a gharīb tradition."}},{"id":36,"idInBook":36,"chapterId":8,"bookId":14,"arabic":"وَعَنِ النُّعْمَانِ بْنِ بَشِيرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ اللَّهَ كتب كتابا قبل أَن يخلق السَّمَوَات وَالْأَرْضَ بِأَلْفَيْ عَامٍ أَنْزَلَ مِنْهُ آيَتَيْنِ خَتَمَ بِهِمَا سُورَةَ الْبَقَرَةِ وَلَا تُقْرَآنِ فِي دَارٍ ثَلَاثَ لَيَالٍ فَيَقْرَبَهَا الشَّيْطَانُ» . رَوَاهُ التِّرْمِذِيُّ وَالدَّارِمِيُّ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ غَرِيب","english":{"narrator":"An-Nu‘mān b. Bashīr reported God’s messenger as saying:","text":"“Two thousand years before creating the heavens and the earth God inscribed a book of which He sent down two verses with which He concluded Sūrat al-Baqara. The devil will not come near a house in which they are recited three nights.” \n\nTirmidhī and Dārimī transmitted it, Tirmidhī saying this is a gharīb tradition."}},{"id":37,"idInBook":37,"chapterId":8,"bookId":14,"arabic":"وَعَن أبي الدَّرْدَاء قَالَ ك قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ قَرَأَ ثَلَاثَ آيَاتٍ مِنْ أَوَّلِ الْكَهْفِ عُصِمَ مِنْ فِتْنَةِ الدَّجَّالِ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ","english":{"narrator":"","text":"Abūd Dardā’ reported God’s messenger as saying, “He who recites three verses at the beginning of al-Kahf will be protected from the trial of the dajjāl.”\n\n Tirmidhī transmitted it, saying this is a hasan sahīh tradition."}},{"id":38,"idInBook":38,"chapterId":8,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ لِكُلِّ شَيْءٍ قَلْبًا وَقَلْبُ الْقُرْآنِ (يس)\nوَمَنْ قَرَأَ (يس)\nكَتَبَ اللَّهُ لَهُ بِقِرَاءَتِهَا قِرَاءَةَ الْقُرْآنِ عَشْرَ مَرَّاتٍ» . رَوَاهُ التِّرْمِذِيُّ وَالدَّارِمِيُّ وَقَالَ التِّرْمِذِيُّ هَذَا حَدِيثٌ غَرِيب","english":{"narrator":"","text":"Anas reported God’s messenger as saying, “Everything has a heart, and the heart of the Qur’ān is Yā Sīn (Qur’ān, 36). God will record anyone who recites Yā Sīn as having recited the Qur’ān ten times.” \n\nTirmidhī and Dārimī transmitted it, Tirmidhī saying this is a gharīb tradition."}},{"id":39,"idInBook":39,"chapterId":8,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى قَرَأَ (طه)\nو (يس)\nقبل أَن يخلق السَّمَوَات وَالْأَرْضَ بِأَلْفِ عَامٍ فَلَمَّا سَمِعَتِ الْمَلَائِكَةُ الْقُرْآنَ قَالَتْ طُوبَى لِأُمَّةٍ يَنْزِلُ هَذَا عَلَيْهَا وَطُوبَى لِأَجْوَافٍ تَحْمِلُ هَذَا وَطُوبَى لِأَلْسِنَةٍ تَتَكَلَّمُ بِهَذَا» . رَوَاهُ الدَّارمِيّ","english":{"narrator":"","text":"Abū Huraira reported God’s messenger as saying, “A thousand years before creating the heavens and the earth God recited Tā’ Hā’ (Qur’ān, 20) and Yā’ Sīn, and when the angels heard the recitation they said, ‘Happy are a people to whom this comes down, happy are the minds which carry this, and happy are the tongues which utter this’.” \n\nDārimī transmitted it."}},{"id":40,"idInBook":40,"chapterId":8,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ قَرَأَ (حم)\nالدُّخَانِ فِي لَيْلَةٍ أَصْبَحَ يَسْتَغْفِرُ لَهُ سَبْعُونَ أَلْفَ مَلَكٍ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيث غَرِيب وَعمر بن أبي خَثْعَمٍ الرَّاوِي يُضَعَّفُ وَقَالَ مُحَمَّدٌ يَعْنِي الْبُخَارِيَّ هُوَ مُنكر الحَدِيث","english":{"narrator":"","text":"He reported God’s messenger as saying, “If someone recites Hā’ Mīm ad-Dukhān (Qur’ān, 44) any night, seventy thousand angels will ask forgiveness for him in the morning.” \n\nTirmidhī transmitted it, saying that this is a gharīb tradition and that ‘Umar b. Abū Khath'am the transmitter is declared to be weak. Muhammad, i.e. Bukhārī, said his traditions were rejected."}},{"id":41,"idInBook":41,"chapterId":8,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ قَرَأَ (حم)\nالدُّخَانِ فِي لَيْلَةِ الْجُمْعَةِ غُفِرَ لَهُ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ غَرِيبٌ وَهِشَام أَبُو الْمِقْدَام الرَّاوِي يضعف","english":{"narrator":"","text":"He reported God's messenger as saying, “If anyone recites Hā’ Mīm ad-Dukhān on a Thursday night his sins will be forgiven.” \n\nTirmidhī transmitted it, saying that this is a gharīb da’īf tradition and that Hishām Abūl Miqdām its transmitter is declared to be weak."}},{"id":42,"idInBook":42,"chapterId":8,"bookId":14,"arabic":"وَعَنِ الْعِرْبَاضِ بْنِ سَارِيَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْرَأُ الْمُسَبِّحَاتِ قَبْلَ أَنْ يَرْقُدَ يَقُولُ: «إِنَّ فِيهِنَّ آيَةٌ خَيْرٌ مِنْ أَلْفِ آيَةٍ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ. \nوَرَوَاهُ الدَّارِمِيُّ عَنْ خَالِدِ بْنِ مَعْدَانَ مُرْسَلًا.\nوَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ","english":{"narrator":"","text":"Al-Irbād b. Sāriya said the Prophet used to recite al-Musabbihāt* before going to sleep, and say they contained a verse which is better than a thousand verses.\n *These are said to be sūras 57, 59, 61, 62, 64, 87 which begin with the perfect, imperfect, or imperative of the verb sabbaha ('to glorify').\n\nTirmidhī and Abū Dāwūd transmitted it, and Dārimī transmitted it in mursal form on the authority of Khalid b. Ma'dān. Tirmidhī said this is a hasan gharīb tradition."}},{"id":43,"idInBook":43,"chapterId":8,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" إِنَّ سُورَةً فِي الْقُرْآنِ ثَلَاثُونَ آيَةً شَفَعَتْ لِرَجُلٍ حَتَّى غُفِرَ لَهُ وَهِيَ: (تَبَارَكَ الَّذِي بِيَدِهِ الْمُلْكُ)\nرَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالنَّسَائِيُّ وَابْنُ مَاجَه","english":{"narrator":"","text":"Abū Huraira reported God’s messenger as saying, “A sūra in the Qur’ān containing thirty verses interceded for a man till his sins were forgiven. It was ‘Blessed is He in whose hand is the kingdom.'” (Qur’ān, 67) \n\nAhmad, Tirmidhī, Abū Dāwūd, Nasā’i and Ibn Mājah transmitted it."}},{"id":44,"idInBook":44,"chapterId":8,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: ضَرَبَ بَعْضِ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خِبَاءَهُ عَلَى قَبْرٍ وَهُوَ لَا يَحْسَبُ أَنَّهُ قَبْرٌ فَإِذَا فِيهِ إِنْسَان يَقْرَأُ سُورَةَ (تَبَارَكَ الَّذِي بِيَدِهِ الْمُلْكُ)\nحَتَّى خَتَمَهَا فَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرَهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «هِيَ الْمَانِعَةُ هِيَ الْمُنْجِيَةُ تُنْجِيهِ مِنْ عَذَابِ الْقَبْر» . رَوَاهُ التِّرْمِذِيّ وَقَالَ: هَذَا حَدِيث غَرِيب","english":{"narrator":"","text":"Ibn ‘Abbās said that one of the Prophet's companions set up his tent over a grave without realising that it was a grave, and it contained a man who was reciting the sūra, “Blessed is He in whose hand is the kingdom,” up to the end. He went and told the Prophet, who said, “It is the defender; it is the protector which is protecting him from God's punishment.” \n\nTirmidhi transmitted it, .saying this is a gharīb tradition."}},{"id":45,"idInBook":45,"chapterId":8,"bookId":14,"arabic":"وَعَنْ جَابِرٌ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ لَا يَنَامُ حَتَّى يَقْرَأَ: (آلم تَنْزِيل)\nو (تَبَارَكَ الَّذِي بِيَدِهِ الْمُلْكُ)\nرَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَالدَّارِمِيُّ\nوَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ صَحِيحٌ. وَكَذَا فِي شرح السّنة. وَفِي المصابيح","english":{"narrator":"","text":"Jabir said it was the Prophet’s custom not to go to sleep till he had recited “A. L. M The sending down,” (Qur’ān, 32) and “Blessed is He in whose hand is the kingdom.” \n\nAhmad, Tirmidhī and Dārimī transmitted it, Tirmidhī saying this is a sahīh tradition. The same is said in Sharh as-sunna, but in al-Masābīh it is called gharīb."}},{"id":46,"idInBook":46,"chapterId":8,"bookId":14,"arabic":"وَعَن ابْن عَبَّاس وَأنس بن مَالك رَضِيَ اللَّهُ عَنْهُمْ قَالَا: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: (إِذا زلزلت)\nتعدل نصف الْقُرْآن (قل هُوَ الله أحد)\nتعدل ثلث الْقُرْآن و (قل يَا أَيُّهَا الْكَافِرُونَ)\nتَعْدِلُ رُبْعَ الْقُرْآنِ \". رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Ibn ‘Abbās and Anas b. Mālik reported God’s messenger as saying that “When is shaken” (Qur’ān, 99) is equivalent to half the Qur’ān, “Say, He is God, One” (Qur’ān, 112) is equivalent to a third of the Qur’ān, and “Say, O infidels” (Qur’ān, 109) is equivalent to a quarter of the Qur’ān. \n\nTirmidhī transmitted it."}},{"id":47,"idInBook":47,"chapterId":8,"bookId":14,"arabic":"وَعَنْ مَعْقِلِ بْنِ يَسَارٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" مَنْ قَالَ حِينَ يُصْبِحُ ثَلَاثَ مَرَّاتٍ: أَعُوذُ بِاللَّهِ السَّمِيعِ الْعَلِيمِ مِنَ الشَّيْطَانِ الرَّجِيمِ فَقَرَأَ ثَلَاثَ آيَاتٍ مِنْ آخِرِ سُورَةِ (الْحَشْرِ)\nوَكَّلَ اللَّهُ بِهِ سَبْعِينَ أَلْفَ مَلَكٍ يُصَلُّونَ عَلَيْهِ حَتَّى يُمْسِيَ وَإِنْ مَاتَ فِي ذَلِكَ الْيَوْمِ مَاتَ شَهِيدًا. وَمَنْ قَالَهَا حِينَ يُمْسِي كَانَ بِتِلْكَ الْمَنْزِلَةِ \". رَوَاهُ التِّرْمِذِيُّ وَالدَّارِمِيُّ. وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ غَرِيبٌ","english":{"narrator":"","text":"Ma‘qil b Yasār reported the Prophet as saying, “If anyone says three times in the morning, ‘I seek refuge in God, the Hearer and Knower, from the accursed devil’, and recites three verses at the end of sūra al-Hashr (Qur’ān, 59), God will put in charge of him seventy thousand angels who will invoke blessings on him till the evening, and if he dies that day he will die as a martyr. If anyone says them in the evening he will be in that rank.”\n\nTirmidhī and Dārimī transmitted it, Tirmidhī saying this is a gharīb tradition."}},{"id":48,"idInBook":48,"chapterId":8,"bookId":14,"arabic":"وَعَنْ أَنَسٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ قَرَأَ كُلَّ يَوْمٍ مِائَتَيْ مَرَّةٍ (قُلْ هُوَ اللَّهُ أَحَدٌ)\nمُحِيَ عَنْهُ ذُنُوبُ خَمْسِينَ سَنَةً إِلَّا أَنْ يَكُونَ عَلَيْهِ دَيْنٌ» . رَوَاهُ التِّرْمِذِيُّ وَالدَّارِمِيُّ وَفِي رِوَايَتِهِ «خَمْسِينَ مَرَّةٍ» وَلَمْ يَذْكُرْ «إِلَّا أَنْ يَكُونَ عَلَيْهِ دين»","english":{"narrator":"","text":"Anas reported the Prophet as saying, 'If anyone recites two hundred times daily, ‘Say, He is God, One’, the sins of fifty years will be wiped out, unless he is in debt.” \n\nTirmidhī and Dārimī transmitted it. The latter’s version has “fifty times”, and he did not mention “unless he is in debt.”"}},{"id":49,"idInBook":49,"chapterId":8,"bookId":14,"arabic":"وَعَنْ أَنَسٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" مِنْ أَرَادَ أَنْ يَنَامَ عَلَى فِرَاشِهِ فَنَامَ عَلَى يَمِينِهِ ثُمَّ قَرَأَ مِائَةَ مَرَّةٍ (قل هُوَ الله أحد)\nإِذا كَانَ يَوْم الْقِيَامَةِ يَقُولُ لَهُ الرَّبُّ: يَا عَبْدِي ادْخُلْ عَلَى يَمِينِكَ الْجَنَّةَ \". رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ","english":{"narrator":"","text":"He reported the Prophet as saying, “If anyone who is about to sleep on his bed lies on his right side, then recites ‘Say, He is God, One’ a hundred times, the Lord will say to him on the day of resurrection, ‘My servant, enter paradise to your right’.” \n\nTirmidhī transmitted it, saying this is a hasan gharīb tradition."}},{"id":50,"idInBook":50,"chapterId":8,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَمِعَ رَجُلًا يَقْرَأُ (قُلْ هُوَ اللَّهُ أَحَدٌ)\nفَقَالَ: «وَجَبَتْ» قُلْتُ: وَمَا وَجَبَتْ؟ قَالَ: «الْجنَّة» . رَوَاهُ مَالك وَالتِّرْمِذِيّ وَالنَّسَائِيّ","english":{"narrator":"Abū Huraira said:","text":"The Prophet, on hearing a man reciting “Say, He is God, One” remarked, “It is certain.” I asked him what was certain, and he replied that it was paradise. \n\nMālik, Tirmidhī and Nasā’i transmitted it."}},{"id":51,"idInBook":51,"chapterId":8,"bookId":14,"arabic":"وَعَنْ فَرْوَةَ بْنِ نَوْفَلٍ عَنْ أَبِيهِ: أَنَّهُ قَالَ: يَا رَسُولَ اللَّهِ عَلِّمْنِي شَيْئًا أَقُولُهُ إِذَا أَوَيْتُ إِلَى فِرَاشِي. فَقَالَ: «اقْرَأْ (قُلْ يَا أَيُّهَا الْكَافِرُونَ)\nفَإِنَّهَا بَرَاءَةٌ مِنَ الشِّرْكِ» . رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد والدارمي","english":{"narrator":"","text":"Farwa b. Naufal quoted his father as saying that he had asked God's messenger to teach him something to say when he went to bed, and was told to recite, “Say, O infidels”, for it is a declaration of freedom from polytheism. \n\nTirmidhī, Abū Dāwūd and Dārimī transmitted it."}},{"id":52,"idInBook":52,"chapterId":8,"bookId":14,"arabic":"وَعَنْ عُقْبَةَ بْنِ عَامِرٍ قَالَ: بَيْنَا أَنَا سير مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ الْجُحْفَةِ وَالْأَبْوَاءِ إِذْ غَشِيَتْنَا رِيحٌ وَظُلْمَةٌ شَدِيدَةٌ فَجَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُعَوِّذُ ب (أعوذ بِرَبّ الفلق)\nو (أعوذ بِرَبِّ النَّاسِ)\nوَيَقُولُ: «يَا عُقْبَةُ تَعَوَّذْ بِهِمَا فَمَا تَعَوَّذَ مُتَعَوِّذٌ بِمِثْلِهِمَا» . رَوَاهُ أَبُو دَاوُدَ","english":{"narrator":"‘Uqba b. ‘Āmir said :","text":"While I was travelling with God's messenger between *al-Juhfa and al-Abwa’ a wind and intense darkness enveloped us, whereupon God’s messenger began to seek refuge in God, reciting “I seek refuge in the Lord of the dawn” and “I seek refuge in the Lord of men.”(Qur’ān, 113 &114) He then said, “Use them, ‘Uqba, when seeking refuge in God, for no one can use anything to compare with them for the purpose.” \n*Al Juhfa- a village about 82 miles from Mecca. Al Abwa’- a village between twenty and thirty miles nearer Medina than al-Juhfa.\n\nAbū Dāwūd transmitted it."}},{"id":53,"idInBook":53,"chapterId":8,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ خَبِيبٍ قَالَ: خَرَجْنَا فِي لَيْلَةِ مَطَرٍ وَظُلْمَةٍ شَدِيدَةٍ نَطْلُبُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَدْرَكْنَاهُ فَقَالَ: «قُلْ» . قُلْتُ مَا أَقُولُ؟ قَالَ: « (قُلْ هُوَ اللَّهُ أَحَدٌ)\nوَالْمُعَوِّذَتَيْنِ حِينَ تُصْبِحُ وَحِينَ تُمْسِي ثَلَاثَ مَرَّاتٍ تَكْفِيكَ مِنْ كُلِّ شَيْءٍ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالنَّسَائِيُّ","english":{"narrator":"‘Abdullah b. Khubaib said:","text":"We went out one rainy and intensely dark night to look for God’s messenger, and when we caught up on him he said to me, “Say.” I asked him what I was to say, and he replied, “If you recite ‘Say, He is God, One’ and al-Mu'awidhatān (The last 3 sūras of the Qur’ān) three times morning and evening, they will serve you for every purpose.” \n\nTirmidhī, Abū Dāwūd and Nasā’i transmitted it."}},{"id":54,"idInBook":54,"chapterId":8,"bookId":14,"arabic":"وَعَنْ عُقْبَةَ بْنِ عَامِرٍ قَالَ: قُلْتُ يَا رَسُولَ اللَّهِ أَقْرَأُ سُورَةَ (هُودٍ)\nأَوْ سُورَةَ (يُوسُفَ)\n؟ قَالَ: \" لَنْ تَقْرَأَ شَيْئًا أَبْلَغَ عِنْدَ اللَّهِ مِنْ (قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ)\nرَوَاهُ أَحْمد وَالنَّسَائِيّ والدارمي","english":{"narrator":"","text":"‘Uqba b. ‘Āmir said that when he asked God’s messenger whether he should recite sūra Hūd (Qur’ān, 11) or sūra Yūsuf (Qur’ān, 12), he told him he could recite nothing more effective with God than “Say, I seek refuge in the Lord of the dawn.” \n\nAhmad, Nasā’i and Dārimī transmitted it."}},{"id":55,"idInBook":55,"chapterId":8,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَعْرِبُوا الْقُرْآنَ وَاتَّبِعُوا غَرَائِبَهُ وَغَرَائِبُهُ فَرَائِضُهُ وَحُدُودُهُ» . رَوَاهُ الْبَيْهَقِيّ فِي شعب الْإِيمَان","english":{"narrator":"","text":"Abū Huraira reported God’s messenger as saying, “Expound the Qur’ān and take as guide its unusual expressions, they being the things made obligatory in it and the limits set in it.”\n\nTransmitted by Baihaqī in Shu'ab al-īmān."}},{"id":56,"idInBook":56,"chapterId":8,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «قِرَاءَةُ الْقُرْآنِ فِي الصَّلَاةِ أَفْضَلُ مِنْ قِرَاءَةِ الْقُرْآنِ فِي غَيْرِ الصَّلَاةِ وَقِرَاءَةُ الْقُرْآنِ فِي غَيْرِ الصَّلَاةِ أَفْضَلُ مِنَ التَّسْبِيحِ وَالتَّكْبِيرِ وَالتَّسْبِيحُ أَفْضَلُ مِنَ الصَّدَقَةِ وَالصَّدَقَةُ أَفْضَلُ مِنَ الصَّوْمِ وَالصَّوْمُ جُنَّةٌ مِنَ النَّارِ» . رَوَاهُ الْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَانِ","english":{"narrator":"","text":"‘Ā’isha reported the Prophet as saying, “Reciting the Qur’ān during prayer is more excellent than reciting it at other times, and reciting the Qur’ān at a time other than during prayer is more excellent than extolling God and declaring His greatness. Extolling God is more excellent than sadaqa, sadaqa is more excellent than fasting, and fasting is a protection from hell.”\n\nTransmitted by Baihaqī in Shu'ab al-īmān."}},{"id":57,"idInBook":57,"chapterId":8,"bookId":14,"arabic":"وَعَنْ عُثْمَانَ بْنِ عَبْدِ اللَّهِ بْنِ أَوْسٍ الثَّقَفِيِّ عَنْ جَدِّهِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «قِرَاءَةُ الرَّجُلِ الْقُرْآنَ فِي غَيْرِ الْمُصْحَفِ أَلْفُ دَرَجَةٍ وَقِرَاءَتُهُ فِي الْمُصحف تضعف عل ذَلِك إِلَى ألفي دَرَجَة» . رَوَاهُ الْبَيْهَقِيّ فِي شعب الْإِيمَان","english":{"narrator":"","text":"‘Uthmān b. ‘ Abdallāh b. Aus ath-Thaqafī, on his grandfather’s authority, reported God’s messenger as saying, “A man’s recitation of the Qur’ān without using a copy of it produces a thousand degrees of reward, but his recitation while using a copy is double that, reaching two thousand degrees.”\n\nTransmitted by Baihaqī in Shu'ab al-īmān."}},{"id":58,"idInBook":58,"chapterId":8,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ هَذِهِ الْقُلُوبَ تَصْدَأُ كَمَا يَصْدَأُ الْحَدِيدُ إِذَا أَصَابَهُ الْمَاءُ» . قِيلَ يَا رَسُولَ اللَّهِ وَمَا جِلَاؤُهَا؟ قَالَ: «كَثْرَةُ ذِكْرِ الْمَوْتِ وَتِلَاوَةِ الْقُرْآنِ» . رَوَى الْبَيْهَقِيُّ الْأَحَادِيثَ الْأَرْبَعَةَ فِي شُعَبِ الْإِيمَانِ","english":{"narrator":"","text":"Ibn ‘Umar reported God’s messenger as saying, “These hearts be­come rusty just as iron does when water gets to it.” On being asked what could clear them he replied, “A great amount of remembrance of death and recitation of the Qur’ān.” \n\nTransmitted by Baihaqī in Shu'ab al-īmān."}},{"id":59,"idInBook":59,"chapterId":8,"bookId":14,"arabic":"وَعَنْ أَيْفَعَ بْنِ عَبْدٍ الْكَلَاعِيِّ قَالَ: قَالَ رَجُلٌ: يَا رَسُولَ اللَّهِ أَيُّ سُورَةِ الْقُرْآنِ أَعْظَمُ؟ قَالَ: (قُلْ هُوَ اللَّهُ أَحَدٌ)\nقَالَ: فَأَيُّ آيَةٍ فِي الْقُرْآنِ أَعْظَمُ؟ قَالَ: آيَةُ الْكُرْسِيِّ (اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ)\nقَالَ: فَأَيُّ آيَةٍ يَا نَبِيَّ اللَّهِ تُحِبُّ أَنْ تُصِيبَكَ وَأُمَّتَكَ؟ قَالَ: «خَاتِمَةُ سُورَةِ الْبَقَرَةِ فَإِنَّهَا مِنْ خَزَائِنِ رَحْمَةِ اللَّهِ تَعَالَى مِنْ تَحْتِ عَرْشِهِ أَعْطَاهَا هَذِهِ الْأُمَّةَ لَمْ تتْرك خيرا من يخر الدُّنْيَا وَالْآخِرَةِ إِلَّا اشْتَمَلَتْ عَلَيْهِ» . رَوَاهُ الدَّارِمِيُّ","english":{"narrator":"","text":"Aifa‘ b. ‘Abd al-Kilā‘ī told of a man who asked God’s messenger which sūra of the Qur’ān was greatest and was told that it is “Say, He is God, One.” He asked which verse of the Qur’ān was greatest and was told that it is the Throne Verse, “God, there is no god but He, the Living, he Eternal.” He asked God’s prophet which verse he would like to bring good to him and his people and was told, ‘‘The end of sūra al-Baqara, for it is one of the treasures of God’s mercy from under His Throne which He gave to this people, and there is no good in this world and the next which it does not include.” \n\nDārimī transmitted it."}},{"id":60,"idInBook":60,"chapterId":8,"bookId":14,"arabic":"وَعَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ مُرْسَلًا قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «فِي فَاتِحَةِ الْكِتَابِ شِفَاءٌ مِنْ كُلِّ دَاءٍ» . رَوَاهُ الدَّارمِيّ وَالْبَيْهَقِيّ فِي شعب الْإِيمَان","english":{"narrator":"","text":"‘Abd al-Mālik b. ‘Umair reported in mursal form that God's mes­senger said, “Fātihat al-Kitāb contains healing for every disease.” \n\nDārimī and Baihaqi, in Shu'ab al-īmān, transmitted it."}},{"id":61,"idInBook":61,"chapterId":8,"bookId":14,"arabic":"وَعَنْ عُثْمَانَ بْنِ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ قَالَ: مَنْ قَرَأَ آخِرَ آلِ عِمْرَانَ فِي لَيْلَة كتب لَهُ قيام لَيْلَة. رَوَاهُ الدَّارمِيّ","english":{"narrator":"","text":"‘Uthmān b. ‘Affān said, “If anyone recites the end of Āl ‘Imrān (Qur’ān, 3) on a night, the reward for a night spent in prayer will be recorded for him.”\n\nTransmitted by Dārimī."}},{"id":62,"idInBook":62,"chapterId":8,"bookId":14,"arabic":"وَعَنْ مَكْحُولٍ قَالَ: مَنْ قَرَأَ سُورَةَ آلِ عِمْرَانَ يَوْمَ الْجُمُعَةِ صَلَّتْ عَلَيْهِ الْمَلَائِكَةُ إِلَى اللَّيْل. رَوَاهُ الدَّارمِيّ","english":{"narrator":"","text":"Makhūl said, “If anyone recites Āl ‘Imrān on a Friday, the angels will invoke blessings on him till night comes.” \n\nTransmitted by Dārimī."}},{"id":63,"idInBook":63,"chapterId":8,"bookId":14,"arabic":"وَعَن جُبَير بن نفير رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ اللَّهَ خَتَمَ سُورَةَ الْبَقَرَةِ بِآيَتَيْنِ أُعْطِيتُهُمَا مِنْ كَنْزِهِ الَّذِي تَحْتَ الْعَرْشِ فَتَعَلَّمُوهُنَّ وَعَلِّمُوهُنَّ نِسَاءَكُمْ فَإِنَّهَا صَلَاةٌ وقربان وَدُعَاء» . رَوَاهُ الدِّرَامِي مُرْسلا","english":{"narrator":"","text":"Jubair b. Nufair reported God’s messenger as saying, “God finished sūra al Baqara with two verses which I have been given from His treasure which is under the Throne ; so learn them and teach them to your womenfolk, for they are a blessing, a means of approach  and a supplication.” \n\nDārimī transmitted it in mursal form."}},{"id":64,"idInBook":64,"chapterId":8,"bookId":14,"arabic":"وَعَن كَعْب رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى الله عَلَيْهِ وَسلم قَالَ: «اقرؤوا سُورَة هود يَوْم الْجُمُعَة» . رَوَاهُ الدِّرَامِي مُرْسلا","english":{"narrator":"","text":"Ka‘b reported God's messenger as saying, “Recite sūra Hūd (Qur’ān, 9) on Fridays.” \n\nDārimī transmitted it in mursal form."}},{"id":65,"idInBook":65,"chapterId":8,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ رَضِيَ اللَّهُ عَنْهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «من قَرَأَ سُورَة الْكَهْف فِي يَوْم الْجُمُعَة أَضَاء لَهُ النُّور مَا بَيْنَ الْجُمْعَتَيْنِ» . رَوَاهُ الْبَيْهَقِيُّ فِي الدَّعَوَاتِ الْكَبِير","english":{"narrator":"","text":"Abū Sa'id reported the Prophet as saying, “If anyone recites sūra al-Kahf (Qur’ān, 18) on Friday, light will shine brightly for him till the next Friday.” \n\nBaihaqī transmitted it in  al-Da‘awāt al-kabir."}},{"id":66,"idInBook":66,"chapterId":8,"bookId":14,"arabic":"وَعَن خَالِد بن معدان قَالَ: اقرؤوا المنجية وَهِي (آلم تَنْزِيل)\nفَإِن بَلَغَنِي أَنَّ رَجُلًا كَانَ يَقْرَؤُهَا مَا يَقْرَأُ شَيْئًا غَيْرَهَا وَكَانَ كَثِيرَ الْخَطَايَا فَنَشَرَتْ جَنَاحَهَا عَلَيْهِ قَالَتْ: رَبِّ اغْفِرْ لَهُ فَإِنَّهُ كَانَ يُكْثِرُ قِرَاءَتِي فَشَفَّعَهَا الرَّبُّ تَعَالَى فِيهِ وَقَالَ: اكْتُبُوا لَهُ بِكُلِّ خَطِيئَةٍ حَسَنَةٍ وَارْفَعُوا لَهُ دَرَجَةً \". وَقَالَ أَيْضًا: \" إِنَّهَا تُجَادِلُ عَنْ صَاحِبِهَا فِي الْقَبْرِ تَقُولُ: اللَّهُمَّ إِنْ كُنْتُ مِنْ كِتَابِكَ فَشَفِّعْنِي فِيهِ وَإِنْ لَمْ أَكُنْ مِنْ كِتَابِكَ فَامْحُنِي عَنْهُ وَإِنَّهَا تَكُونُ كَالطَّيْرِ تَجْعَلُ جَنَاحَهَا عَلَيْهِ فَتَشْفَعُ لَهُ فَتَمْنَعُهُ مِنْ عَذَابِ الْقَبْر \" وَقَالَ فِي (تبَارك)\nمثله. وَكَانَ خَالِد لَا يَبِيتُ حَتَّى يَقْرَأَهُمَا. وَقَالَ طَاوُوسُ: فُضِّلَتَا عَلَى كُلِّ سُورَةٍ فِي الْقُرْآنِ بِسِتِّينَ حَسَنَةً. رَوَاهُ الدَّارمِيّ","english":{"narrator":"Khālid b. Ma'dān said:","text":"Recite the rescuer, which is A.L.M. The sending down (Qur’ān, 32) for I have heard that a man who had committed many sins used to recite it and nothing else. It spread its wing over him and said, “My Lord, forgive him, for he often used to recite me so the Lord most high made it an intercessor for him and said, “Record for him a good deed and raise him a degree in place of every sin.” Khālid said also: It will dispute on behalf of the one who recites it when he is in his grave saying, “O God, if I am a part of Thy Book, make me an intercessor for him; but if I am not a part of Thy Book, blot me out of it.” It will be like a bird putting its wing on him, it will intercede for him and will protect him from the punishment in the grave. He said the same about “Blessed is He.” (Qur’ān, 67) Khālid did not go to sleep at night till he had recited them. Tā’ūs said they were given sixty virtues more than any other sūra in the Qur’ān. \n\nDārimī transmitted it."}},{"id":67,"idInBook":67,"chapterId":8,"bookId":14,"arabic":"وَعَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ قَالَ: بَلَغَنِي أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ قَرَأَ (يس)\nفِي صَدْرِ النَّهَارِ قضيت حَوَائِجه» رَوَاهُ الدَّارمِيّ مُرْسلا","english":{"narrator":"","text":"‘Atā b. Abū Rabāh told of hearing that God’s messenger said, “If anyone recites Yā’ Sīn at the beginning of the day, his wants will be supplied.” \n\nDārimī transmitted it in mursal form."}},{"id":68,"idInBook":68,"chapterId":8,"bookId":14,"arabic":"وَعَن معقل بن يسَار الْمُزنِيّ رَضِيَ اللَّهُ عَنْهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ قَرَأَ (يس)\nابْتِغَاءَ وَجْهِ اللَّهِ تَعَالَى غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنبه فاقرؤوها عِنْدَ مَوْتَاكُمْ» . رَوَاهُ الْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَانِ","english":{"narrator":"","text":"Ma'qil b. Yasār al-Muzanī reported the Prophet as saying, “If anyone recites Yā’ Sīn (Qur’ān, 36) out of a desire for God's favour, his past sins will be forgiven him; so recite it over those of you who are dying.” \n\nBaihaqī transmitted it in Shu'ab al-īmān."}},{"id":69,"idInBook":69,"chapterId":8,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ أَنَّهُ قَالَ: إِنَّ لِكُلِّ شَيْءٍ سَنَامًا وَإِنَّ سَنَامَ الْقُرْآنِ سُورَةُ الْبَقَرَةِ وَإِنَّ لِكُلِّ شَيْءٍ لُبَابًا وَإِنَّ لباب الْقُرْآن الْمفصل. رَوَاهُ الدَّارمِيّ","english":{"narrator":"‘Abdallāh b. Mas'ūd said, “Everything has a hump, and the hump of the Qur’ān is sūra al-Baqara. Everything has a kernel, and the kernel of the Qur’ān is al-Mufassal.*\n*A title given to the sūras from 49 to the end, but several other sūras are also mentioned:","text":"37, 45, 47, 48, 50, 61, 67, and 93. The name is most appropriately explained as meaning that this is the section of the Qur’ān which contains many shorter sūras. \n\nDārimī transmitted it."}},{"id":70,"idInBook":70,"chapterId":8,"bookId":14,"arabic":"وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم يَقُول: «لكل شَيْء عروس وعروس الْقُرْآن الرَّحْمَن» . رَوَاهُ الْبَيْهَقِيّ فِي شعب الْإِيمَان","english":{"narrator":"","text":"‘Alī told that he heard God’s messenger say, “Everything has an adornment, and the adornment of the Qur’ān is ar-Rahmān” (Qur’ān, 57)\n\nTransmitted by Baihaqī in Shu'ab al-īmān."}},{"id":71,"idInBook":71,"chapterId":8,"bookId":14,"arabic":"وَعَنِ ابْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ قَرَأَ سُورَةَ الْوَاقِعَةِ فِي كُلِّ لَيْلَةٍ لَمْ تُصِبْهُ فَاقَةٌ أَبَدًا» . وَكَانَ ابْنُ مَسْعُودٍ يَأْمُرُ بَنَاتَهُ يَقْرَأْنَ بهَا فِي كل لَيْلَة. رَوَاهُ الْبَيْهَقِيّ فِي شعب الْإِيمَان","english":{"narrator":"","text":"Ibn Mas’ūd reported God’s messenger as saying, “He who recites sūra al-Waqi'a (Qur’ān, 56) every night will never be afflicted by want.” Ibn Mas’ūd used to order his daughters to recite it every night. \n\nTransmitted by Baihaqī in Shu'ab al-īmān."}},{"id":72,"idInBook":72,"chapterId":8,"bookId":14,"arabic":"وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ: \" كَانَ رَسُولُ اللَّهِ صلى الله عَلَيْهِ وَسلم يجب هَذِهِ السُّورَةَ (سَبِّحِ اسْمِ رَبِّكَ الْأَعْلَى)\nرَوَاهُ أَحْمد","english":{"narrator":"","text":"‘Alī said that God's messenger used to like this sūra, “Glorify the name of thy most high Lord.”(Qur’ān, 87) \n\nAhmad transmitted it."}},{"id":73,"idInBook":73,"chapterId":8,"bookId":14,"arabic":"وَعَن عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ: أَتَى رَجُلٌ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَقْرِئْنِي يَا رَسُولَ اللَّهِ فَقَالَ: \" اقْرَأْ ثَلَاثًا مِنْ ذَوَاتِ (ألر)\nفَقَالَ: كَبُرَتْ سِنِّي وَاشْتَدَّ قَلْبِي وَغَلُظَ لِسَانِي قَالَ: \" فَاقْرَأْ ثَلَاثًا مِنْ ذَوَاتِ (حم)\nفَقَالَ مِثْلَ مَقَالَتِهِ. قَالَ الرَّجُلُ: يَا رَسُولَ اللَّهِ أَقْرِئْنِي سُورَةً جَامِعَةً فَأَقْرَأَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ (إِذَا زُلْزِلَتْ الأَرْض)\nحَتَّى فَرَغَ مِنْهَا فَقَالَ الرَّجُلُ: وَالَّذِي بَعَثَكَ بِالْحَقِّ لَا أَزِيد عَلَيْهَا أبدا ثمَّ أدبر الرَّجُلُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ\nأَفْلَحَ الرُّوَيْجِلُ \" مَرَّتَيْنِ. رَوَاهُ أَحْمَدُ وَأَبُو دَاوُدَ","english":{"narrator":"","text":"‘Abdallāh b. ‘Amr told of a man coming to the Prophet and asking him to teach him to recite. On being told to recite three of the sūras with A. L. R (Qur’ān, 10, 11, 12, 14, and 15) he replied, “I am old, my heart has difficulty in remem­bering, and my tongue is sluggish.” When told that in that case he should recite three with Hā’ Mīm (Qur’ān, 40 to 46) he gave the same reply and then asked God’s messenger to teach him to recite a comprehensive sūra. He taught him to recite “When is shaken” (Qur’ān, 99) up to the end, and the man said, “I swear by Him who has sent you with the truth that I shall never recite more than that.” Then when the man turned away God's messenger said twice, “The little man has come into a state of felicity.” \n\nAhmad and Abū Dāwūd transmitted it."}},{"id":74,"idInBook":74,"chapterId":8,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَلَا يَسْتَطِيعُ أَحَدُكُمْ أَنْ يَقْرَأَ أَلْفَ آيَةٍ فِي كُلِّ يَوْمٍ؟» قَالُوا: وَمَنْ يَسْتَطِيعُ أَنْ يَقْرَأَ أَلْفَ آيَةٍ فِي كل يَوْم؟ قَالَ: \" أَمَا يَسْتَطِيعُ أَحَدُكُمْ أَنْ يَقْرَأَ: (أَلْهَاكُمُ التكاثر)\n؟)\nرَوَاهُ الْبَيْهَقِيّ فِي شعب الْإِيمَان","english":{"narrator":"","text":"Ibn ‘Umar reported God’s messenger as saying, “Can one of you not recite a thousand verses daily?” Then when he was asked who could recite a thousand verses daily he replied, “Can one of you not recite ‘Rivalry has distracted you’?”(Qur’ān, 102)\n\nBaihaqi transmitted it in Shu'ab al-īmān."}},{"id":75,"idInBook":75,"chapterId":8,"bookId":14,"arabic":"وَعَنْ سَعِيدِ بْنِ الْمُسَيَّبِ مُرْسَلًا عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ قَرَأَ (قل هُوَ الله أحد)\nعشر مَرَّات بني لَهُ بِهَا قَصْرٌ فِي الْجَنَّةِ وَمَنْ قَرَأَ عِشْرِينَ مَرَّةً بُنِي لَهُ بِهَا قَصْرَانِ فِي الْجَنَّةِ وَمَنْ قَرَأَهَا ثَلَاثِينَ مَرَّةً بُنِيَ لَهُ بِهَا ثَلَاثَةُ قُصُورٍ فِي الْجَنَّةِ» . فَقَالَ عُمَرُ بْنُ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ: وَاللَّهِ يَا رَسُولَ اللَّهِ إِذَا لَنُكَثِّرَنَّ قُصُورَنَا. فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «اللَّهُ أَوْسَعُ من ذَلِك» . رَوَاهُ الدَّارمِيّ","english":{"narrator":"","text":"Sa'īd b. al-Musayyib reported in mursal form that the Prophet said, “If anyone recites ten times ‘Say, He is God, One’, a palace will be built for him in paradise because of it; if anyone recites twenty times two palaces will be built for him in paradise because of it; and if anyone recites it thirty times three palaces will be built for him in paradise be­cause of it.” ‘Umar b. al-Khattāb said, “I swear by God, messenger of God, that we shall then produce many palaces for ourselves;” to which he replied, “God's abundant grace is even more comprehensive than that.” \n\nDārimī transmitted it."}},{"id":76,"idInBook":76,"chapterId":8,"bookId":14,"arabic":"وَعَنِ الْحَسَنِ مُرْسَلًا: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ قَرَأَ فِي لَيْلَةٍ مِائَةَ آيَةٍ لَمْ يُحَاجِّهِ الْقُرْآنُ تِلْكَ اللَّيْلَةَ وَمَنْ قَرَأَ فِي لَيْلَةٍ مِائَتَيْ آيَةٍ كُتِبَ لَهُ قُنُوتُ لَيْلَةٍ وَمَنْ قَرَأَ فِي لَيْلَةٍ خَمْسَمِائَةً إِلَى الْأَلْفِ أَصْبَحَ وَلَهُ قِنْطَارٌ مِنَ الْأَجْرِ» . قَالُوا: وَمَا الْقِنْطَارُ؟ قَالَ: «اثْنَا عَشَرَ ألفا» . رَوَاهُ الدِّرَامِي","english":{"narrator":"","text":"Al-Hasan reported in mursal form that the Prophet said, “If anyone recites a hundred verses in a night the Qur’ān will not argue against him that night; if anyone recites two hundred verses in a night he will be recorded as having spent a night standing in prayer; and if anyone recites five hundred to a thousand verses in a night, in the morning he will have a reward equivalent to a qintār*. He was asked what a qintar was and replied that it was twelve thousand . \n*This is the measure to which many different values have been ascribed. \n\nDārimī transmitted it."}},{"id":77,"idInBook":77,"chapterId":8,"bookId":14,"arabic":"عَنْ أَبِي مُوسَى الْأَشْعَرِيِّ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «تَعَاهَدُوا الْقُرْآنَ فَوَالَّذِي نَفْسِي بِيَدِهِ لَهْوَ أَشَدُّ تَفَصِّيًا مِنَ الْإِبِلِ فِي عُقُلِهَا»","english":{"narrator":"","text":"Abū Mūsā al-Ash’arī reported God’s messenger as saying, “Keep refreshing your knowledge of the Qur’ān, for I swear by Him in whose hand my soul is that it is more liable to escape than camels which are tethered.” \n\n(Bukhārī and Muslim.)"}},{"id":78,"idInBook":78,"chapterId":8,"bookId":14,"arabic":"وَعَنِ ابْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: \n\" بئس مالأحدهم أَنْ يَقُولَ: نَسِيتُ آيَةَ كَيْتَ وَكَيْتَ بَلْ نُسِّيَ وَاسْتَذْكِرُوا الْقُرْآنَ فَإِنَّهُ أَشَدُّ تَفَصِّيًا مِنْ صُدُورِ الرِّجَالِ مِنَ النَّعَمِ \". مُتَّفَقٌ عَلَيْهِ. وَزَادَ مُسلم: «بعقلها»","english":{"narrator":"","text":"Ibn Mas’ūd reported God’s messenger as saying, “It is wrong for one to say that he has forgotten such and such a verse, for he has been made to forget. Study the Qur’ān, for it is more apt to escape from men’s minds than animals.” \n\n(Bukhārī and Muslim, Muslim adding \"which are tethered”.)"}},{"id":79,"idInBook":79,"chapterId":8,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّمَا مَثَلُ صَاحِبِ الْقُرْآنِ كَمَثَلِ صَاحِبِ الْإِبِلِ الْمُعَقَّلَةِ إِنْ عَاهَدَ عَلَيْهَا أَمْسَكَهَا وَإِنْ أَطْلَقَهَا ذَهَبَتْ»","english":{"narrator":"","text":"Ibn ‘Umar reported the Prophet as saying, “He who studies the Qur’ān is like the owner of tethered camels. If he pays attention to them he keeps hold of them, but if he lets them loose they go away.\" \n\n(Bukhārī and Muslim.)"}},{"id":80,"idInBook":80,"chapterId":8,"bookId":14,"arabic":"وَعَنْ جُنْدُبِ بْنِ عَبْدُ اللَّهِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «اقرؤوا الْقُرْآنَ مَا ائْتَلَفَتْ عَلَيْهِ قُلُوبُكُمْ فَإِذَا اخْتَلَفْتُمْ فَقومُوا عَنهُ»","english":{"narrator":"","text":"Jundub b. ‘Abdallāh reported God’s messenger as saying, “Recite the Qur’ān as long as you can concentrate on it, but when your concentra­tion flags give it up.” \n\n(Bukhārī and Muslim.)"}},{"id":81,"idInBook":81,"chapterId":8,"bookId":14,"arabic":"وَعَنْ قَتَادَةَ قَالَ: سُئِلَ أَنَسٌ: كَيْفَ كَانَتْ قِرَاءَةُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: كَانَت مدا مَدًّا ثُمَّ قَرَأَ: بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ يَمُدُّ بِبَسْمِ اللَّهِ وَيَمُدُّ بِالرَّحْمَنِ وَيَمُدُّ بِالرَّحِيمِ. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Qatādā said that when Anas was asked how the Prophet recited the Qur’ān he replied that he did so prolonging the words. Then he recited “In the name of God, the Compassionate, the Merciful,” prolonging each phrase. \n\nBukhārī transmitted it."}},{"id":82,"idInBook":82,"chapterId":8,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا أَذِنَ اللَّهُ لِشَيْءٍ مَا أَذِنَ لِنَبِيٍّ يَتَغَنَّى بِالْقُرْآنِ»","english":{"narrator":"","text":"Abū Huraira reported God’s messenger as saying, “God has not listened to anything as He does to a prophet chanting* the Qur’ān.” \n*There are different opinions about the meaning of yataghannā which is here used. While some explain it as in the translation, others prefer to understand it in the sense of yastaghnī which means being content with. \n\n(Bukhārī and Muslim.)"}},{"id":83,"idInBook":83,"chapterId":8,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا أَذِنَ اللَّهُ لِشَيْءٍ مَا أَذِنَ لِنَبِيٍّ حَسِنِ الصَّوْتِ بِالْقُرْآنِ يَجْهَرُ بِهِ»","english":{"narrator":"","text":"He reported God’s messenger as saying, “God has not listened to anything as He does to a prophet with a good voice reciting the Qur’ān aloud.” \n\n(Bukhārī and Muslim.)"}},{"id":84,"idInBook":84,"chapterId":8,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَيْسَ مِنَّا مَنْ لَمْ يَتَغَنَّ بِالْقُرْآنِ» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"He reported God’s messenger as saying, “He does not belong to us who does not chant the Qur’ān.” \n\nBukhārī transmitted it."}},{"id":85,"idInBook":85,"chapterId":8,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ: قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ عَلَى الْمِنْبَرِ: «اقْرَأْ عَلَيَّ» . قُلْتُ: أَقْرَأُ عَلَيْكَ وَعَلَيْكَ أُنْزِلَ؟ قَالَ: «إِنِّي أُحِبُّ أَنْ أَسْمَعَهُ مِنْ غَيْرِي» . فَقَرَأْتُ سُورَةَ النِّسَاءِ حَتَّى أَتَيْتُ إِلَى هَذِهِ الْآيَةِ (فَكَيْفَ إِذَا جِئْنَا مِنْ كُلِّ أُمَّةٍ بِشَهِيدٍ وَجِئْنَا بِكَ عَلَى هَؤُلَاءِ شَهِيدا)\nقَالَ: «حَسْبُكَ الْآنَ» . فَالْتَفَتُّ إِلَيْهِ فَإِذَا عَيْنَاهُ تَذْرِفَانِ","english":{"narrator":"Abdallāh b. Mas'ūd said:","text":"When God’s Messenger was on the pulpit he asked him to recite to him and he replied, “Shall I recite to you when it was sent down to you?” He said that he liked to hear it from someone else, so ‘Abdallāh recited Sūrat an-Nisa’ up to this verse, “How then shall it be when We bring from every people a witness and bring you against them as witness?”(Al-Qur’ān, 4:1-41) Then on being told that that was enough for the present, he turned round to him and saw the tears falling from his eyes. \n\n(Bukhārī and Muslim.)"}},{"id":86,"idInBook":86,"chapterId":8,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأُبَيِّ بْنِ كَعْبٍ: «إِنَّ اللَّهَ أَمَرَنِي أَنْ أَقْرَأَ عَلَيْكَ الْقُرْآنَ» قَالَ: آللَّهُ سَمَّانِي لَكَ؟ قَالَ: «نَعَمْ» . قَالَ: وَقَدْ ذُكِرْتُ عِنْدَ رَبِّ الْعَالَمِينَ؟ قَالَ: «نَعَمْ» . فَذَرَفَتْ عَيْنَاهُ. وَفِي رِوَايَةٍ: \" إِنَّ اللَّهَ أَمَرَنِي أَنْ أَقْرَأَ عَلَيْكَ (لَمْ يَكُنِ الَّذِينَ كَفَرُوا)\nقَالَ: وَسَمَّانِي؟ قَالَ: «نَعَمْ» . فَبَكَى","english":{"narrator":"","text":"Anas reported God’s messenger as saying to Ubayy b. Kā'b, “God has commanded me to recite the Qur’ān to you.” He asked, “Did God mention me to you by name?” and when he was told that He had, he said, “Have I been mentioned in the presence of the Lord of the uni­verse?” On being told that he had, tears fell from his eyes. In a version he said God had commanded him to recite to him “Those who disbelieve were not …” (Qur’ān, 98). He asked if He had mentioned him by name, and when he was told that He had, he wept. \n\n(Bukhārī and Muslim.)"}},{"id":87,"idInBook":87,"chapterId":8,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِن يُسَافَرَ بِالْقُرْآنِ إِلَى أَرْضِ الْعَدُوِّ. مُتَّفَقٌ عَلَيْهِ. وَفِي رِوَايَةٍ لِمُسْلِمٍ: «لَا تُسَافِرُوا بِالْقُرْآنِ فَإِنِّي لَا آمن أَن يَنَالهُ الْعَدو»","english":{"narrator":"","text":"Ibn ‘Umar said that God’s-messenger forbade taking the Qur’ān into enemy territory.\nA version by Muslim has, “Do not take the Qur’ān with you when travelling, for I cannot guarantee that the enemy will not get it.”\n\n(Bukhārī and Muslim.)"}},{"id":88,"idInBook":88,"chapterId":8,"bookId":14,"arabic":"عَن أبي سعيد الْخُدْرِيّ قَالَ: جَلَست فِي عِصَابَةٍ مِنْ ضُعَفَاءِ الْمُهَاجِرِينَ وَإِنَّ بَعْضَهُمْ لِيَسْتَتِرُ بِبَعْضٍ مِنَ الْعُرْيِ وَقَارِئٌ يَقْرَأُ عَلَيْنَا إِذْ جَاءَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَامَ عَلَيْنَا فَلَمَّا قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَكَتَ الْقَارِئُ فَسَلَّمَ ثُمَّ قَالَ: «مَا كُنْتُمْ تَصْنَعُونَ؟» قُلْنَا: كُنَّا نَسْتَمِعُ إِلَى كتاب الله قَالَ فَقَالَ: «الْحَمْدُ لِلَّهِ الَّذِي جَعَلَ مِنْ أُمَّتِي مَنْ أُمِرْتُ أَنْ أَصْبِرَ نَفْسِي مَعَهُمْ» . قَالَ فَجَلَسَ وَسَطَنَا لِيَعْدِلَ بِنَفْسِهِ فِينَا ثُمَّ قَالَ بِيَدِهِ هَكَذَا فَتَحَلَّقُوا وَبَرَزَتْ وُجُوهُهُمْ لَهُ فَقَالَ: «أَبْشِرُوا يَا مَعْشَرَ صَعَالِيكِ الْمُهَاجِرِينَ بِالنُّورِ التَّامِّ يَوْمَ الْقِيَامَةِ تَدْخُلُونَ الْجَنَّةَ قَبْلَ أَغْنِيَاءِ النَّاسِ بِنصْف يَوْم وَذَاكَ خَمْسمِائَة سنة» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"Abū Sa'īd al-Khudrī said:","text":"I sat with a company of the poor*members of the Emigrants who were sitting close together because of lack of clothing while a reader was reciting to us. God’s messenger came along and stood beside us, and when he did so the reader stopped and gave him a salutation. He asked what we were doing, and when we told him we were listening to God’s Book he said, “Praise be to God who has put among my people those with whom I have been ordered to keep myself.”(Qur’ān,18:28) He then sat down among us so as to be like one of us, and when he had made a sign with his hand they sat in a circle with their faces turned towards him, and he said, “Rejoice, you group of poor Emigrants, in the announcement that you will have perfect light on the day of resurrection. You will enter paradise half a day before the rich, and that is five hundred years.” \n*Lit. 'Weak'. This is said to refer to the people who lived in the Suffa \n\nAbū Dāwūd transmitted it."}},{"id":89,"idInBook":89,"chapterId":8,"bookId":14,"arabic":"وَعَنِ الْبَرَاءِ بْنِ عَازِبٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «زَيِّنُوا الْقُرْآنَ بِأَصْوَاتِكُمْ» . رَوَاهُ أَحْمَدُ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ","english":{"narrator":"","text":"Al-Barā’ b. Āzib reported God’s messenger as saying, “Beautify the Qur’ān with your voices.” \n\nAhmad, Abū Dāwūd, Ibn Mājah and Dārimī transmitted it."}},{"id":90,"idInBook":90,"chapterId":8,"bookId":14,"arabic":"وَعَنْ سَعْدِ بْنِ عُبَادَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «مَا من امْرِئٍ يَقْرَأُ الْقُرْآنَ ثُمَّ يَنْسَاهُ إِلَّا لَقِيَ اللَّهَ يَوْمَ الْقِيَامَةِ أَجْذَمَ» . رَوَاهُ أَبُو دَاوُدَ والدارمي","english":{"narrator":"","text":"Sā‘d b. Ubāda reported God’s messenger as saying, “Every man who recites the' Qur’ān and then forgets it* will meet God on the day of resurrection in a maimed condition.” \n*This has been explained as referring to one who has learned the Qur’ān by heart and later forgets it, or neglects to recite it.\n\nAbū Dāwūd and Dārimī trans­mitted it."}},{"id":91,"idInBook":91,"chapterId":8,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَمْ يَفْقَهْ مَنْ قَرَأَ الْقُرْآنَ فِي أَقَلَّ مِنْ ثَلَاث» . رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد والدارمي","english":{"narrator":"","text":"Abdallāh b. ‘Amr reported God’s messenger as saying, “The one who recites the Qur’ān in less than three nights does not understand it.” \n\nTirmidhī, Abū Dāwūd and Dārimī transmitted it."}},{"id":92,"idInBook":92,"chapterId":8,"bookId":14,"arabic":"وَعَنْ عُقْبَةَ بْنِ عَامِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْجَاهِرُ بِالْقُرْآنِ كالجاهر بِالصَّدَقَةِ ولامسر بِالْقُرْآنِ كَالْمُسِرِّ بِالصَّدَقَةِ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالنَّسَائِيُّ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ","english":{"narrator":"","text":"‘Uqba b. ‘Āmir reported God’s messenger as saying, “He who recites the Qur’ān loudly is like him who gives sadaqa openly, and he who recites the Qur’ān quietly is like him who gives sadaqa secretly.” \n\nTirmidhī, Abū Dāwūd and Nasā’i transmitted it, Tirmidhī saying this is a hasan gharīb tradition."}},{"id":93,"idInBook":93,"chapterId":8,"bookId":14,"arabic":"وَعَنْ صُهَيْبٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا آمَنَ بِالْقُرْآنِ مَنِ اسْتَحَلَّ مَحَارِمَهُ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ لَيْسَ إِسْنَادُهُ بِالْقَوِيّ","english":{"narrator":"","text":"Suhaib reported God’s messenger as saying, “He who treats what the Qur’ān prohibits as permissible does not believe in it.” \n\nTirmidhī transmitted it, but said this is a tradition whose isnād is not strong."}},{"id":94,"idInBook":94,"chapterId":8,"bookId":14,"arabic":"وَعَنِ اللَّيْثِ بْنِ سَعْدٍ عَنِ ابْنِ أَبِي مليكَة عَنْ يَعْلَى بْنِ مُمَلَّكٍ أَنَّهُ سَأَلَ أُمَّ سَلَمَةَ عَنْ قِرَاءَةِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَإِذَا هِيَ تَنْعَتُ قِرَاءَةً مُفَسَّرَةً حَرْفًا حَرْفًا. رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد وَالنَّسَائِيّ","english":{"narrator":"","text":"Al-Laith b. Sa‘d quoted Ibn Abū Mulaika who quoted Yā'lā b. Mamlak as saying that he asked Umm Salama about the manner in which the Prophet recited, and she described it in a manner by which it was explained word by word.*\n*This is explained as meaning that she showed how he pronounced each syllable distinctly, or simply that she gave an illustration of the fine quality of the Prophet’s recitation.\n\nTirmidhī, Abū Dāwūd and Nasā’i trans­mitted it."}},{"id":95,"idInBook":95,"chapterId":8,"bookId":14,"arabic":"وَعَنِ ابْنِ جُرَيْجٍ عَنِ ابْنِ أَبِي مُلَيْكَةَ عَنْ أُمِّ سَلَمَةَ قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُقَطِّعُ قِرَاءَتَهُ يَقُولُ: الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ ثُمَّ يَقِفُ ثُمَّ يَقُولُ: الرَّحْمَنِ الرَّحِيمِ ثُمَّ يَقِفُ. رَوَاهُ التِّرْمِذِيُّ وَقَالَ: لَيْسَ إِسْنَادُهُ بِمُتَّصِلٍ لِأَنَّ اللَّيْثَ رَوَى هَذَا الْحَدِيثَ عَنِ ابْنِ أَبِي مُلَيْكَةَ عَنْ يَعْلَى بْنِ مَمْلَكٍ عَنْ أُمِّ سَلَمَةَ وَحَدِيثُ اللَّيْث أصح","english":{"narrator":"","text":"Ibn Juraij quoted Ibn Abū Mulaika who reported Umm Salama as saying, ‘God’s messenger used to make pauses in his recitation. He would say, ‘Praise be to God, the Lord of the universe’, then stop. He would next say, ‘The Compassionate, the Merciful’, then stop.” \n\nTirmidhī transmitted it, but he said that its isnād is not fully connected, because al-Laith transmitted this tradition from Ibn Abū Mulaika from Yā'lā b. Mamlak from Umm Salama, and al-Laith's tradition is sounder."}},{"id":96,"idInBook":96,"chapterId":8,"bookId":14,"arabic":"عَنْ جَابِرٍ قَالَ: خَرَجَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ نَقْرَأُ الْقُرْآنَ وَفينَا الْأَعرَابِي والأعجمي قَالَ: «اقرؤوا فَكُلٌّ حَسَنٌ وَسَيَجِيءُ أَقْوَامٌ يُقِيمُونَهُ كَمَا يُقَامُ الْقِدْحُ يَتَعَجَّلُونَهُ وَلَا يَتَأَجَّلُونَهُ» . رَوَاهُ أَبُو دَاوُدَ وَالْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَانِ","english":{"narrator":"Jabir said:","text":"God's messenger came out to us when we were reciting the Qur’ān, our number including nomad Arabs and non-Arabs, and said, \"Recite, for it is all good; but after you people will come who will straighten it as an arrow is straightened, seeking a reward for it in this world and not waiting for their reward in the next.” \n\nAbū Dāwūd and Baihaqī, in Shu'ab al-īmān, transmitted it."}},{"id":97,"idInBook":97,"chapterId":8,"bookId":14,"arabic":"وَعَنْ حُذَيْفَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «اقرؤوا الْقُرْآنَ بِلُحُونِ الْعَرَبِ وَأَصْوَاتِهَا وَإِيَّاكُمْ وَلُحُونَ أَهْلِ الْعِشْق وَلُحُون أهل الْكِتَابَيْنِ وسيجي بعدِي قوم يرجعُونَ بِالْقُرْآنِ ترجع الْغِنَاءِ وَالنَّوْحِ لَا يُجَاوِزُ حَنَاجِرَهُمْ مَفْتُونَهٌ قُلُوبُهُمْ وَقُلُوبُ الَّذِينَ يُعْجِبُهُمْ شَأْنُهُمْ» . رَوَاهُ الْبَيْهَقِيُّ فِي شعب الْإِيمَان","english":{"narrator":"","text":"Hudhaifa reported God’s messenger as saying, \"Recite the Qur’ān with the modulations and tones of the Arabs, but avoid the modulations of those who recite love poetry and the modulations of the people of the two Books. After my death people will come who will trill when they recite the Qur’ān as is done in singing and wailing, but it will go no farther than their throats, and they and those who are charmed by their performance will be led into error.” \n\nBaihaqī in Shu'ab al-īmān and Razīn in his book transmitted it."}},{"id":98,"idInBook":98,"chapterId":8,"bookId":14,"arabic":"وَعَنِ الْبَرَاءِ بْنِ عَازِبٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «حَسِّنُوا الْقُرْآنَ بِأَصْوَاتِكُمْ فَإِنَّ الصَّوْتَ الْحَسَنَ يُزِيدُ الْقُرْآنَ حُسْنًا» . رَوَاهُ الدَّارمِيّ","english":{"narrator":"","text":"Al-Barā’ b. ‘Āzib told that he heard God's messenger say, \"Beautify the Qur’ān with your voices, for the beautiful voice increases the beauty of the Qur’ān.” \n\nDārimī transmitted it."}},{"id":99,"idInBook":99,"chapterId":8,"bookId":14,"arabic":"وَعَنْ طَاوُوسٍ مُرْسَلًا قَالَ: سُئِلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أَيُّ النَّاسِ أَحْسَنُ صَوْتًا لِلْقُرْآنِ؟ وَأَحْسَنُ قِرَاءَةً؟ قَالَ: «مَنْ إِذَا سَمِعْتَهُ يقْرَأ أَرَأَيْت أَنَّهُ يَخْشَى اللَّهَ» . قَالَ طَاوُوسٌ: وَكَانَ طَلْقٌ كَذَلِك. رَوَاهُ الدَّارمِيّ","english":{"narrator":"","text":"Tāwūs told in mursal form that when the Prophet was asked who had the most beautiful voice for the Qur’ān and whose recitation was most beautiful he replied, \"The one of whom you think when you hear him recite that he fears God.” Tāwūs added that Talq* was like that.\n* A companion of the Prophet who belonged to al-Yamāma.\n\nDārimī transmitted it."}},{"id":100,"idInBook":100,"chapterId":8,"bookId":14,"arabic":"وَعَنْ عُبَيْدَةَ الْمُلَيْكِيِّ وَكَانَتْ لَهُ صُحْبَةٌ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَا أَهْلَ الْقُرْآنِ لَا تَتَوَسَّدُوا الْقُرْآنَ وَاتْلُوهُ حَقَّ تِلَاوَتِهِ مِنْ آنَاءِ اللَّيْلِ وَالنَّهَارِ وَأَفْشُوهُ وَتَغَنُّوهُ وَتَدَبَّرُوا مَا فِيهِ لَعَلَّكُمْ تُفْلِحُونَ وَلَا تَعْجَلُوا ثَوَابَهُ فَإِنَّ لَهُ ثَوَابًا» . رَوَاهُ الْبَيْهَقِيُّ فِي شعب الْإِيمَان","english":{"narrator":"","text":"‘Abīda al-Mulaikī who was a Companion reported God’s messenger as saying, \"Do not make the Qur’ān a pillow,* but recite it as it deserves to be recited during the night and the day. Recite it aloud, chant it and consider its contents, perhaps you may prosper; but do not seek to get reward for it in this world, for it provides rewards.”(i.e., in the next world)\n*A figure of speech warning against laziness or neglect.\n\nBaihaqi trans­mitted it in Shu'ab' al-īmān."}},{"id":101,"idInBook":101,"chapterId":8,"bookId":14,"arabic":"وَعَنْ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ قَالَ: سَمِعْتُ هِشَامَ بْنَ حَكِيمِ بْنِ حِزَامٍ يقْرَأ سُورَة الْفرْقَان على غير مَا أقرؤوها. وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَقْرَأَنِيهَا فَكِدْتُ أَنْ أَعْجَلَ عَلَيْهِ ثُمَّ أَمْهَلْتُهُ حَتَّى انْصَرَفَ ثُمَّ لَبَّبْتُهُ بِرِدَائِهِ فَجِئْتُ بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ. فَقلت يَا رَسُولَ اللَّهِ إِنِّي سَمِعْتُ هَذَا يَقْرَأُ سُورَةَ الْفُرْقَانِ عَلَى غَيْرِ مَا أَقْرَأْتَنِيهَا. فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أَرْسِلْهُ اقْرَأ \" فَقَرَأت الْقِرَاءَةَ الَّتِي سَمِعْتُهُ يَقْرَأُ. فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «هَكَذَا أُنْزِلَتْ» . ثُمَّ قَالَ لي: «اقْرَأ» . فَقَرَأت. فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «هَكَذَا أنزلت إِن الْقُرْآنَ أُنْزِلَ عَلَى سَبْعَةِ أَحْرُفٍ فَاقْرَءُوا مَا تيَسّر مِنْهُ» . مُتَّفق عَلَيْهِ. وَاللَّفْظ لمُسلم","english":{"narrator":"‘Umar b. al-Khattab said:","text":"I heard Hishām b. Hakīm b. Hizām reciting sūra al-Furqān (Qur’ān, 25) in a different manner from my way of reciting it, and God’s messenger had taught me to recite it. I nearly spoke sharply to him, but I delayed till he had finished, and then catching his cloak at the neck I brought him to God’s messenger and said, “Messen­ger of God, I heard this man reciting sūra al-Furqān in a manner different from that in which you taught me to recite it.” He told me to let him go and told him to recite. When he recited it in the manner in which I had heard him recite it God's messenger said, “Thus was it sent down.” He then told me to recite it and when I had done so he said, “Thus was it sent down. The Qur’ān was sent down in seven modes of reading, so recite according to what comes most easily.” \n\n(Bukhārī and Muslim, the wording being Muslim’s.)"}},{"id":102,"idInBook":102,"chapterId":8,"bookId":14,"arabic":"وَعَنِ ابْنِ مَسْعُودٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: سَمِعْتُ رَجُلًا قَرَأَ وَسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ خِلَافَهَا فَجِئْتُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرْتُهُ فَعَرَفْتُ فِي وَجهه الْكَرَاهِيَة فَقَالَ: «كِلَاكُمَا مُحْسِنٌ فَلَا تَخْتَلِفُوا فَإِنَّ مَنْ كَانَ قبلكُمْ اخْتلفُوا فهلكوا» . رَوَاهُ البُخَارِيّ","english":{"narrator":"Ibn Mas’ūd said:","text":"I heard a man who recited, and as I had heard the Prophet reciting differently I took him to the Prophet and told him and noticed that he gave a disapproving look. He then said, “Both of you are doing it well, so do not disagree, for your predecessors disagreed and perished.” \n\nBukhārī transmitted it."}},{"id":103,"idInBook":103,"chapterId":8,"bookId":14,"arabic":"وَعَنْ أُبَيِّ بْنِ كَعْبٍ قَالَ: كُنْتُ فِي الْمَسْجِدِ فَدَخَلَ رَجُلٌ يُصَلِّي فَقَرَأَ قِرَاءَةً أَنْكَرْتُهَا عَلَيْهِ ثُمَّ دَخَلَ آخَرُ فَقَرَأَ قِرَاءَةً سِوَى قِرَاءَةِ صَاحِبِهِ فَلَمَّا قَضَيْنَا الصَّلَاةَ دَخَلْنَا جَمِيعًا عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ إِنَّ هَذَا قَرَأَ قِرَاءَةً أَنْكَرْتُهَا عَلَيْهِ وَدخل آخر فَقَرَأَ سوى قِرَاءَة صَاحبه فَأَمَرَهُمَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَرَآ فَحَسَّنَ شَأْنَهُمَا فَسَقَطَ فِي نَفْسِي مِنَ التَّكْذِيبِ وَلَا إِذْ كُنْتُ فِي الْجَاهِلِيَّةِ فَلَمَّا رَأَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا قَدْ غَشِيَنِي ضَرَبَ فِي صَدْرِي فَفِضْت عَرَقًا وكأنما أنظر إِلَى الله عز وَجل فَرَقَا فَقَالَ لِي: «يَا أُبَيُّ أُرْسِلَ إِلَيَّ أَن اقْرَأِ الْقُرْآنَ عَلَى حَرْفٍ فَرَدَدْتُ إِلَيْهِ أَنْ هَوِّنْ عَلَى أُمَّتِي فَرَدَّ إِلَيَّ الثَّانِيَةَ اقْرَأْهُ عَلَى حَرْفَيْنِ فَرَدَّدَتْ إِلَيْهِ أَنْ هَوِّنْ عَلَى أُمَّتِي فَرَدَّ إِلَيَّ الثَّالِثَةِ اقْرَأْهُ عَلَى سَبْعَةِ أَحْرُفٍ وَلَكَ بِكُلِّ رَدَّةٍ رَدَدْتُكَهَا مَسْأَلَةٌ تَسْأَلُنِيهَا فَقُلْتُ اللَّهُمَّ اغْفِرْ لِأُمَّتِي اللَّهُمَّ اغْفِرْ لِأُمَّتِي وَأَخَّرْتُ الثَّالِثَةَ لِيَوْمٍ يَرْغَبُ إِلَيَّ الْخَلْقُ كُلُّهُمْ حَتَّى إِبْرَاهِيم صلى الله عَلَيْهِ وَسلم» . رَوَاهُ مُسلم","english":{"narrator":"Ubayy b. Kā'b said:","text":"When I was in the mosque a man entered and prayed and recited in a manner to which I objected. Afterwards a man entered and recited in a manner different from the other. When we had finished the prayer we all went to visit God’s messenger, and I said, “This man recited in a manner to which I objected and the other entered and recited in a manner different from his.” The Prophet then commanded them to recite, and when they had done so he expressed approval of both of them. This made me inclined to tell him he was wrong, even to an extent I had never reached in the pre-Islamic period; and when God’s messenger noticed how I was affected he gave me a pat on the chest, whereupon I broke into a sweat and was filled with fear as though I were looking at God. He then said to me, “A message was sent to me, Ubayy, to recite the Qur’ān in one mode, but when I replied that I wished matters to be made easy for my people, a second message instructed me to recite it in two modes. Again I replied that I wished matters to be made easy for my people, and a third message instructed me to recite it in seven modes, I being told at the same time that I might ask something for each reply I had received. I therefore said, ‘O God, forgive my people. O God, forgive my people;’ and I have delayed the third request till the day when all creatures, even including Abraham, seek my intercession.\"\n \nMuslim transmitted it."}},{"id":104,"idInBook":104,"chapterId":8,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أَقْرَأَنِي جِبْرِيل على حرف فَرَاجعه فَلم أزل استزيده ويزيدني حَتَّى انْتهى إِلَى سَبْعَةِ أَحْرُفٍ» . قَالَ ابْنُ شِهَابٍ: بَلَغَنِي أَنَّ تِلْكَ السَّبْعَةَ الْأَحْرُفَ إِنَّمَا هِيَ فِي الْأَمْرِ تَكُونُ وَاحِدًا لَا تَخْتَلِفُ فِي حَلَالٍ وَلَا حرَام","english":{"narrator":"","text":"Ibn ‘Abbās reported God’s messenger as saying, “Gabriel taught me to recite in one mode, and when I replied to him and kept asking him to give me more he did so till he reached seven modes.\" Ibn Shihāb said he had heard that those seven modes are essentially one, not differing about what is permitted and what is prohibited. \n\n(Bukhārī and Muslim.)"}},{"id":105,"idInBook":105,"chapterId":8,"bookId":14,"arabic":"عَنْ أُبَيِّ بْنِ كَعْبٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: لَقِيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جِبْرِيلَ فَقَالَ: \" يَا جِبْرِيلُ إِنِّي بُعِثْتُ إِلَى أُمَّةٍ أُمِّيِّينَ مِنْهُمُ الْعَجُوزُ وَالشَّيْخُ الْكَبِيرُ وَالْغُلَامُ وَالْجَارِيَةُ وَالرَّجُلُ الَّذِي لَمْ يَقْرَأْ كِتَابًا قَطُّ قَالَ: يَا مُحَمَّد إِن الْقُرْآن أونزل عَلَى سَبْعَةِ أَحْرُفٍ \". رَوَاهُ التِّرْمِذِيُّ وَفِي رِوَايَةٍ لِأَحْمَدَ وَأَبِي دَاوُدَ: قَالَ: «لَيْسَ مِنْهَا إِلَّا شَافٍ كَافٍ» . وَفِي رِوَايَةٍ لِلنَّسَائِيِّ قَالَ: \" إِنَّ جِبْرِيلَ وَمِيكَائِيلَ أَتَيَانِي فَقَعَدَ جِبْرِيلُ عَنْ يَمِينِي وَمِيكَائِيلُ عَنْ يَسَارِي فَقَالَ جِبْرِيلُ: اقْرَأِ الْقُرْآنَ عَلَى حَرْفٍ قَالَ مِيكَائِيلُ: اسْتَزِدْهُ حَتَّى بَلَغَ سَبْعَة أحرف فَكل حرف شاف كَاف \"","english":{"narrator":"","text":"Ubayy b. Ka‘b told of God’s messenger meeting Gabriel and saying, “I have been sent, Gabriel, to a people who are unlettered, among whom are old women and old men, boys and girls, and men who have never read a book.” He replied, “The Qur’ān, Muhammad, has been sent down in seven modes.\" \nIn a version by Ahmad and Abū Dāwūd he said, “They include only what is sufficiently health-giving.” In a version by Nasā’i the Prophet is quoted as saying that Gabriel and Michael came to him, and when Gabriel had sat down at his right and Michael at his left, Gabriel told him to recite the Qur’ān in one mode, and Michael told him to ask more, till he reached seven modes, each mode being sufficiently health-giving.\n\nTirmidhī transmitted it."}},{"id":106,"idInBook":106,"chapterId":8,"bookId":14,"arabic":"وَعَنْ عِمْرَانَ بْنِ حُصَيْنٍ رَضِيَ اللَّهُ عَنْهُمَا أَنَّهُ مَرَّ عَلَى قَاصٍّ يَقْرَأُ ثُمَّ يَسْأَلُ. فَاسْتَرْجَعَ ثُمَّ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنْ قَرَأَ الْقُرْآنَ فليسأل الله بِهِ فَإِنَّهُ سَيَجِيءُ أَقوام يقرؤون الْقُرْآنَ يَسْأَلُونَ بِهِ النَّاسَ» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ","english":{"narrator":"","text":"‘Imran b. Husain said that when he came upon a story-teller who was reciting the Qur’ān and then asking for payment he first uttered the words, “We belong to God and to Him do we return” and then told that he had heard God’s messenger say, “When anyone recites the Qur’ān, let him ask a reward for it from God, for people will arise who will recite the Qur’ān and ask a reward for it from men.” \n\nAhmad and Tirmidhī transmitted it."}},{"id":107,"idInBook":107,"chapterId":8,"bookId":14,"arabic":"عَن بُرَيْدَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ قَرَأَ الْقُرْآنَ يَتَأَكَّلُ بِهِ النَّاسَ جَاءَ يَوْمَ الْقِيَامَةِ وَوَجْهُهُ عظم لَيْسَ عَلَيْهِ لحم» . رَوَاهُ الْبَيْهَقِيّ فِي شعب الْإِيمَان","english":{"narrator":"","text":"Buraida reported God’s messenger as saying, “If anyone recites the Qur’ān seeking thereby to get a living from people, he will come on the day of resurrection with his face as a fleshless bone.” \n\nBaihaqi trans­mitted it in Shu’ab al-īmān."}},{"id":108,"idInBook":108,"chapterId":8,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَعْرِفُ فَصْلَ السُّورَةِ حَتَّى يَنْزِلَ عَلَيْهِ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيم. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Ibn ‘Abbās said that God's messenger did not know where sūras were to be separated till “In the name of God, the Compassionate, the Merciful,” was sent down. \n\nAbū Dāwūd transmitted it."}},{"id":109,"idInBook":109,"chapterId":8,"bookId":14,"arabic":"وَعَنْ عَلْقَمَةَ قَالَ: كُنَّا بِحِمْصَ فَقَرَأَ ابْنُ مَسْعُودٍ سُورَةَ يُوسُفَ فَقَالَ رَجُلٌ: مَا هَكَذَا أُنْزِلَتْ. فَقَالَ عَبْدُ اللَّهِ: وَاللَّهِ لَقَرَأْتُهَا عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «أَحْسَنْتَ» فَبَيْنَا هُوَ يُكَلِّمُهُ إِذْ وَجَدَ مِنْهُ رِيحَ الْخَمْرِ فَقَالَ: أَتَشْرَبُ الْخَمْرَ وَتُكَذِّبُ بِالْكِتَابِ؟ فَضَرَبَهُ الْحَد","english":{"narrator":"‘Alqama said:","text":"When we were in Hims Ibn Mas’ūd recited sūra Yūsuf (Quran, 12) and a man declared that it was not sent down like that. To this ‘Abdallāh replied, “I swear by God that I recited it in the time of God’s messenger and he told me I had done it well.” While speaking to him he noticed the smell of wine on him, so he said, “Do you drink wine and declare the Book false?” and then gave him the prescribed beating. \n\n(Bukhārī and Muslim.)"}},{"id":110,"idInBook":110,"chapterId":8,"bookId":14,"arabic":"وَعَنْ زَيْدِ بْنِ ثَابِتٍ قَالَ: أَرْسَلَ إِلَيَّ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ مَقْتَلَ أَهْلِ الْيَمَامَةِ. فَإِذَا عُمَرُ بْنُ الْخَطَّابِ عِنْدَهُ. قَالَ أَبُو بَكْرٍ إِنَّ عُمَرَ أَتَانِي فَقَالَ إِنَّ الْقَتْلَ قَدِ اسْتَحَرَّ يَوْمَ الْيَمَامَةِ بِقُرَّاءِ الْقُرْآنِ وَإِنِّي أَخْشَى أَنِ اسْتَحَرَّ الْقَتْلُ بِالْقُرَّاءِ بِالْمَوَاطِنِ فَيَذْهَبُ كَثِيرٌ مِنَ الْقُرْآنِ وَإِنِّي أَرَى أَنْ تَأْمُرَ بِجَمْعِ الْقُرْآنِ قُلْتُ لِعُمَرَ كَيْفَ تَفْعَلُ شَيْئًا لَمْ يَفْعَلْهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ؟ فَقَالَ عُمَرُ هَذَا وَاللَّهِ خَيْرٌ فَلم يزل عمر يراجعني فِيهِ حَتَّى شرح الله صَدْرِي لذَلِك وَرَأَيْت الَّذِي رَأَى عُمَرُ قَالَ زَيْدٌ قَالَ أَبُو بَكْرٍ إِنَّكَ رَجُلٌ شَابٌّ عَاقِلٌ لَا نَتَّهِمُكَ وَقَدْ كُنْتَ تَكْتُبُ الْوَحْيَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَتَتَبَّعِ الْقُرْآنَ فَاجْمَعْهُ فَوَاللَّهِ لَوْ كَلَّفُونِي نَقْلَ جَبَلٍ مِنَ الْجِبَالِ مَا كَانَ أَثْقَلَ عَلَيَّ مِمَّا أَمَرَنِي بِهِ مِنْ جمع الْقُرْآن قَالَ: قلت كَيفَ تَفْعَلُونَ شَيْئا لم يَفْعَله النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ. قَالَ هُوَ وَاللَّهِ خير فَلم أزل أراجعه حَتَّى شرح الله صَدْرِي للَّذي شرح الله لَهُ صدر أبي بكر وَعمر. فَقُمْت فَتَتَبَّعْتُ الْقُرْآنَ أَجْمَعُهُ مِنَ الْعُسُبِ وَاللِّخَافِ وَصُدُورِ الرِّجَال حَتَّى وجدت من سُورَة التَّوْبَة آيَتَيْنِ مَعَ أَبِي خُزَيْمَةَ الْأَنْصَارِيِّ لَمْ أَجِدْهَا مَعَ أَحَدٍ غَيْرِهِ (لَقَدْ جَاءَكُمْ رَسُولٌ مِنْ أَنْفُسِكُمْ)\nحَتَّى خَاتِمَةِ بَرَاءَةَ. فَكَانَتِ الصُّحُفُ عِنْدَ أَبِي بَكْرٍ حَتَّى تَوَفَّاهُ اللَّهُ ثُمَّ عِنْدَ عُمَرَ حَيَاته ثمَّ عِنْد حَفْصَة. رَوَاهُ البُخَارِيّ","english":{"narrator":"Zaid b. Thābit said:","text":"Abū Bakr sent for me after the slaughter of those who fought at al-Yamāma and ‘Umar b. al-Khattāb was with him. Abū Bakr told me that ‘Umar had come to him and drawn attention to the extensive slaughter among Qur’ān readers at the battle of al- Yamāma, saying he was afraid that if readers continued to be killed in large numbers at other battles a large amount of the Qur’ān would be lost, and that he therefore thought he should give command that the Qur’ān be collected. He had asked. ‘Umar how he could do a thing which God’s messenger had not done, and ‘Umar, swearing by God that this was best, had kept at him till God made him inclined to do that, and he came to hold ‘Umar’s opinion about the matter. Zaid told how Abū Bakr said to him, “You are an intelligent young man whom we do not suspect and you have been writing down the revelation which came to God’s messenger, so search for the Qur’ān and collect it,” adding: I swear by God that if they had imposed on me the transportation of a mountain it would not have been a heavier load for me than the collecting of the Qur’ān which he ordered me to undertake. I asked how they could do a thing which God’s messenger had not done and Abū Bakr, swearing by God that this was best, kept at me till God made me in­clined to do what He had made Abū Bakr and ‘Umar inclined to do. I therefore searched for the Qur’ān and collected it from leafless palm branches, white stones and the breasts of men till I found the end of sūra at-Tauba (Qur’ān, 9) with Abū Khuzaima al-Ansārī, not having found it with anyone else: \"A messenger from among yourselves has come to you . . .” to the end of Barā'a* (Qur’ān, 9 128-129). The sheets were deposited with Abū Bakr till God took him, then with ‘Umar during his lifetime, then with Hafsa, ‘Umar’s daughter. \n*Tauba and Barā’a are alternative titles of sūra 9.\n\nBukhārī transmitted it."}},{"id":111,"idInBook":111,"chapterId":8,"bookId":14,"arabic":"وَعَنْ أَنَسِ بْنِ مَالِكٍ: أَنَّ حُذَيْفَةَ بْنَ الْيَمَانِ قَدِمَ عَلَى عُثْمَانَ وَكَانَ يُغَازِي أَهْلَ الشَّامِ فِي فَتْحِ أَرْمِينِيَّةَ وَأَذْرَبِيجَانَ مَعَ أَهْلِ الْعِرَاقِ فَأَفْزَعَ حُذَيْفَةَ اخْتِلَافُهُمْ فِي الْقِرَاءَةِ فَقَالَ حُذَيْفَةُ لِعُثْمَانَ يَا أَمِيرَ الْمُؤْمِنِينَ أَدْرِكْ هَذِهِ الْأُمَّةَ قَبْلَ أَنْ يَخْتَلِفُوا فِي الْكِتَابِ اخْتِلَافَ الْيَهُودِ وَالنَّصَارَى فَأَرْسَلَ عُثْمَانُ إِلَى حَفْصَةَ أَنْ أَرْسِلِي إِلَيْنَا بِالصُّحُفِ نَنْسَخُهَا فِي الْمَصَاحِفِ ثُمَّ نَرُدُّهَا إِلَيْكِ فَأَرْسَلَتْ بِهَا حَفْصَةُ إِلَى عُثْمَانَ فَأَمَرَ زَيْدَ بْنَ ثَابِتٍ وَعَبْدَ اللَّهِ بْنَ الزبير وَسَعِيد بن الْعَاصِ وَعبد الرَّحْمَن بْنَ الْحَارِثِ بْنِ هِشَامٍ فَنَسَخُوهَا فِي الْمَصَاحِفِ وَقَالَ عُثْمَانُ لِلرَّهْطِ الْقُرَشِيِّينَ الثَّلَاثِ إِذَا اخْتَلَفْتُمْ فِي شَيْءٍ مِنَ الْقُرْآنِ فَاكْتُبُوهُ بِلِسَانِ قُرَيْشٍ فَإِنَّمَا نَزَلَ بِلِسَانِهِمْ فَفَعَلُوا حَتَّى إِذَا نَسَخُوا الصُّحُفَ فِي الْمَصَاحِفِ رَدَّ عُثْمَانُ الصُّحُفَ إِلَى حَفْصَةَ وَأَرْسَلَ إِلَى كُلِّ أُفُقٍ بِمُصْحَفٍ مِمَّا نَسَخُوا وَأَمَرَ بِمَا سِوَاهُ مِنَ الْقُرْآنِ فِي كُلِّ صَحِيفَةٍ أَوْ مُصْحَفٍ أَنْ يُحْرَقَ قَالَ ابْن شهَاب وَأَخْبرنِي خَارِجَة بن زيد بن ثَابت سَمِعَ زَيْدَ بْنَ ثَابِتٍ قَالَ فَقَدْتُ آيَةً مِنَ الْأَحْزَابِ حِينَ نَسَخْنَا الْمُصْحَفَ قَدْ كُنْتُ أَسْمَعُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ بِهَا فَالْتَمَسْنَاهَا فَوَجَدْنَاهَا مَعَ خُزَيْمَةَ بْنِ ثَابِتٍ الْأَنْصَارِيِّ (مِنَ الْمُؤْمِنِينَ رِجَالٌ صَدَقُوا مَا عَاهَدُوا الله عَلَيْهِ)\nفَأَلْحَقْنَاهَا فِي سُورَتِهَا فِي الْمُصْحَفِ. رَوَاهُ الْبُخَارِيُّ","english":{"narrator":"Anas b. Mālik told of Hudhaifa b. al-Yamān coming to ‘Uthmān after having led the Syrians along with the ‘Irāqīs at the conquest of Armenia and Azerbaijan:","text":"Being alarmed at their difference in reading the Qur’ān he said to ‘Uthmān, “Commander of the faithful, set this people right before they disagree about the Book in the manner of the Jews and the Christians.” ‘Uthmān therefore sent a message to Hafsa asking her to send the sheets to him so that they might make copies of them, after which he would return them to her. Hafsa sent them to ‘Uthmān and he commanded Zaid b. Thābit, ‘Abdallāh b. az-Zubair, Sa'īd b. al-‘Ās and ‘Abdallāh b. al-Hārith b. Hishām who made copies of them. ‘Uthmān gave instructions to the three members of Quraish that when they and Zaid b. Thābit disagreed about anything in the Qur’ān they were to write in the dialect of Quraish, for it came down only in their dialect. They did so, and when they had made several copies of the sheets ‘Uthmān returned the sheets to Hafsa. He then sent a copy of those which they had transcribed to every region, giving orders that every sheet or volume which contained a part of the Qur’ān in different form should be burned. Ibn Shihāb said he was told by Khārija b. Zaid b. Thābit that he heard Zaid b. Thābit say that when they transcribed the Qur’ān he failed to find a verse in al-Ahzāb which he had heard God’s messenger reciting. He therefore sought it and found it with Khuzaima b. Thābit al-Ansārī, “Among the believers are men who have been true to the covenant they made with God” (Qur’ān, 33:23). They then added it to its sūra in the copy of the Qur’ān. \n\nBukhārī transmit­ted it."}},{"id":112,"idInBook":112,"chapterId":8,"bookId":14,"arabic":"وَعَن ابْن عَبَّاس قَالَ: قلت لعُثْمَان بن عَفَّان مَا حملكم أَنْ عَمَدْتُمْ إِلَى الْأَنْفَالِ وَهِيَ مِنَ الْمَثَانِي وَإِلَى بَرَاءَةٍ وَهِيَ مِنَ الْمَئِينِ فَقَرَنْتُمْ بَيْنَهُمَا وَلم تكْتبُوا بَينهمَا سَطْرَ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ وَوَضَعْتُمُوهَا فِي السَّبع الطول مَا حملكم على ذَلِك فَقَالَ عُثْمَانُ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِمَّا يَأْتِي عَلَيْهِ الزَّمَان وَهُوَ تنزل عَلَيْهِ السُّور ذَوَات الْعدَد فَكَانَ إِذا نزل عَلَيْهِ الشَّيْء دَعَا بعض من كَانَ يَكْتُبُ فَيَقُولُ: «ضَعُوا هَؤُلَاءِ الْآيَاتِ فِي السُّورَةِ الَّتِي يُذْكَرُ فِيهَا كَذَا وَكَذَا» فَإِذَا نَزَلَتْ عَلَيْهِ الْآيَةُ فَيَقُولُ: «ضَعُوا هَذِهِ الْآيَةَ فِي السُّورَةِ الَّتِي يُذْكَرُ فِيهَا كَذَا وَكَذَا» . وَكَانَتِ الْأَنْفَالُ مِنْ أَوَائِلِ مَا نَزَلَتْ بِالْمَدِينَةِ وَكَانَتْ بَرَاءَة من آخر الْقُرْآن وَكَانَت قصَّتهَا شَبيهَة بِقِصَّتِهَا فَظَنَنْت أَنَّهَا مِنْهَا فَقُبِضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَمْ يبين لنا أَنَّهَا مِنْهَا فَمِنْ أَجْلِ ذَلِكَ قَرَنْتُ بَيْنَهُمَا وَلِمَ أكتب بَينهمَا سَطْرَ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ وَوَضَعْتُهَا فِي السَّبْعِ الطُّوَلِ. رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَأَبُو دَاوُدَ","english":{"narrator":"","text":"Ibn 'Abbas said he asked ‘Uthmān what had induced them to deal with al-Anfāl (Qur’ān, 8) which is one of the Mathānī* and with Barā'a which is one with a hundred verses, joining them without writing the line contain­ing \"In the name of God, the Compassionate, the Merciful,” and putting it among the seven long ones. When he asked again what had induced them to do that, ‘Uthmān replied, \"Over a period sūras with numerous verses would come down to God’s messenger, and when some­thing came down to him he would call one of those who wrote and tell him to put these verses in the sūra in which such and such is mentioned, and when a verse came down he would tell them to put it in the sūra in which such and such is mentioned. Now al-Anfāl was one of the first to come down in Medina and Barā’a was among the last of the Qur’ān to come down, and the subject-matter of the one resembled that of the other, so because God’s messenger was taken without having explained to us whether it belonged to it, for that reason I joined them without writing the line containing ‘In the name of God, the Compassionate, the Merciful, and put it among the long sūras.'’ \n*Sūras with less than a hundred verses, but more than those in al mufassal.\n\nAhmad, Tirmidhī and Abū Dāwūd transmitted it."}}],"chapter":{"id":8,"bookId":14,"arabic":"كتاب فضائل القرآن","english":"The Excellent Qualities of the Qur'an"}}