{"metadata":{"length":272,"arabic":{"title":"مشكاة المصابيح","author":"الإمام الكاتب التبريزي","introduction":"كتاب الدعوات"},"english":{"title":"Mishkat al-Masabih","author":"Al-Khatib Al-Tabrizi","introduction":"Supplications"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":9,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لِكُلِّ نَبِيٍّ دَعْوَةٌ مُسْتَجَابَةٌ فَتَعَجَّلَ كُلُّ نَبِيٍّ دَعْوَتَهُ وَإِنِّي اخْتَبَأْتُ دَعْوَتِي شَفَاعَةً لِأُمَّتِي إِلَى يومِ القِيامةِ فَهِيَ نَائِلَةٌ إِنْ شَاءَ اللَّهُ مَنْ مَاتَ مِنْ أُمَّتِي لَا يُشْرِكُ بِاللَّهِ شَيْئًا» . رَوَاهُ مُسلم وللبخاري أقصر مِنْهُ","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “Every prophet has a supplication which receives an answer, but whereas every prophet made his supplication in this world, I have kept mine till the day of resurrection to be used in intercession for my people, and if God will, it will reach those of my people who have died without associating anything with God.” \n\nMuslim transmitted it, and Bukhari has a shorter version."}},{"id":2,"idInBook":2,"chapterId":9,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «اللَّهُمَّ إِنِّي اتَّخَذْتُ عِنْدَكَ عَهْدًا لَنْ تُخْلِفَنِيهِ فَإِنَّمَا أَنَا بَشَرٌ فَأَيُّ الْمُؤْمِنِينَ آذَيْتُهُ شَتَمْتُهُ لَعَنْتُهُ جَلَدْتُهُ فَاجْعَلْهَا لَهُ صَلَاةً وَزَكَاةً وَقُرْبَةً تُقَرِّبُهُ بِهَا إِلَيْكَ يَوْم الْقِيَامَة»","english":{"narrator":"","text":"He reported God’s messenger as. saying, “O God, I have entered into a covenant with Thee which Thou wilt not break. I am only a human being, so when I have injured, reviled, cursed or beaten a believer, make that for him a mercy, a purification and a means by which Thou wilt bring him near to Thee on the day of resurrection.”\n\n(Bukhari and Muslim.)"}},{"id":3,"idInBook":3,"chapterId":9,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" إِذَا دَعَا أَحَدُكُمْ فَلَا يقُلْ: اللهُمَّ اغفِرْ لي إِنْ شِئتَ ارْحمْني إِنْ شِئْتَ ارْزُقْنِي إِنْ شِئْتَ وَلِيَعْزِمْ مَسْأَلَتَهُ إِنَّه يفعلُ مَا يَشَاء وَلَا مكره لَهُ \". رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"He reported God's messenger as saying, “When one of you makes supplication he must not say, ‘O God, forgive me if Thou wilt, show mercy to me if Thou wilt, provide for me if Thou wilt’, but must make his request definite, for He does what He wills and there is no one to impose compulsion on Him.” \n\nBukhari transmitted it."}},{"id":4,"idInBook":4,"chapterId":9,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" إِذَا دَعَا أَحَدُكُمْ فَلَا يَقُلِ: اللَّهُمَّ اغْفِرْ لِي إِنْ شِئْتَ وَلَكِنْ لِيَعْزِمْ وَلْيُعَظِّمِ الرَّغْبَةَ فَإِنَّ اللَّهَ لَا يَتَعَاظَمُهُ شيءٌ أعطاهُ \". رَوَاهُ مُسلم","english":{"narrator":"","text":"He reported God’s messenger as saying, “When one of you makes supplication he must not say, ‘O God, forgive me if Thou wilt, but must be definite and cherish a great desire, for nothing which God gives is burdensome to Him.” \n\nMuslim transmitted it."}},{"id":5,"idInBook":5,"chapterId":9,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يُسْتَجَابُ لِلْعَبْدِ مَا لَمْ يَدْعُ بِإِثْمٍ أَوْ قَطِيعَةِ رَحِمٍ مَا لَمْ يَسْتَعْجِلْ» . قِيلَ: يَا رَسُولَ اللَّهِ مَا الِاسْتِعْجَالُ؟ قَالَ: \n\" يَقُولُ: قَدْ دَعَوْتُ وَقَدْ دَعَوْتُ فَلَمْ أَرَ يُسْتَجَابُ لِي فَيَسْتَحْسِرُ عِنْدَ ذَلِكَ وَيَدَعُ الدُّعاءَ \". رَوَاهُ مُسلم","english":{"narrator":"","text":"He reported God’s messenger as saying, “A servant is granted an answer provided he does not ask for anything sinful or for breaking ties of relationship, and provided he does not demand an answer quickly.” On being asked what demanding an answer quickly meant, God’s messenger replied, “It is when he says he has prayed and prayed and does not think he will be answered, so he grows weary in such circumstances and gives up supplication.” \n\nMuslim transmitted it."}},{"id":6,"idInBook":6,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي الدَّرْدَاءِ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" دعوةُ الْمُسْلِمِ لِأَخِيهِ بِظَهْرِ الْغَيْبِ مُسْتَجَابَةٌ عِنْدَ رَأْسِهِ مَلَكٌ مُوَكَّلٌ كُلَّمَا دَعَا لِأَخِيهِ بِخَيْرٍ قَالَ الْمَلَكُ الْمُوَكَّلُ بِهِ: آمِينَ وَلَكَ بِمِثْلٍ \". رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Darda’ reported God’s messenger as saying, “A Muslim’s supplication for an absent brother receives an answer. An angel is stationed at his head, and as often as he makes supplication that his brother may be given what is good the angel who is put in charge of him says, ‘Amen, and may you receive the like’.” \n\nMuslim transmitted it."}},{"id":7,"idInBook":7,"chapterId":9,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَدْعُوا عَلَى أَنْفُسِكُمْ وَلَا تدْعُوا على أَوْلَادكُم لَا تُوَافِقُوا مِنَ اللَّهِ سَاعَةً يُسْأَلُ فِيهَا عَطَاءً فَيَسْتَجِيبَ لَكُمْ» . رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"Jabir reported God’s messenger as saying, “Do not invoke curses on yourselves, or on your children, or on your possessions lest you happen to do it at a time when God is asked for something and grants your requests.” \n\nMuslim transmitted it."}},{"id":8,"idInBook":8,"chapterId":9,"bookId":14,"arabic":"عَنِ النُّعْمَانِ بْنِ بَشِيرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الدُّعَاءُ هُوَ الْعِبَادَةُ» ثُمَّ قَرَأَ: (وَقَالَ رَبُّكُمُ ادْعُونِي أَسْتَجِبْ لَكم)\nرَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالنَّسَائِيُّ وَابْنُ مَاجَه","english":{"narrator":"","text":"An-Nu‘man b. Bashir reported God’s messenger as saying, “Supplication is worship.” He then recited, “And your Lord said, If you call on me I will aswer you.”* \n*Qur’an, xl, 60.\n\nAhmad, Tirmidhi, Abu Dawud, Nasa'i and Ibn Majah transmitted it."}},{"id":9,"idInBook":9,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الدُّعَاءُ مُخُّ الْعِبَادَةِ» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Anas reported God’s messsenger as saying, “Supplication is the pith of worship.” \n\nTirmidhi transmitted it."}},{"id":10,"idInBook":10,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَيْسَ شَيْءٌ أَكْرَمَ عَلَى اللَّهِ مِنَ الدُّعَاءِ»","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “Nothing is more honourable in God’s sight than supplication.” \n\nTirmidhi and Ibn Majah transmitted it, Tirmidhi saying this is a hasan gharib tradition."}},{"id":11,"idInBook":11,"chapterId":9,"bookId":14,"arabic":"وَعَنْ سَلْمَانَ الْفَارِسِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَرُدُّ الْقَضَاءَ إِلَّا الدُّعَاءُ وَلَا يَزِيدُ فِي الْعُمْرِ إِلَّا الْبر» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Salman al-Farisi reported God’s messenger as saying, “Nothing but supplication averts the decree, and nothing but righteousness increases life.” \n\nTirmidhi transmitted it."}},{"id":12,"idInBook":12,"chapterId":9,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ الدُّعَاءَ يَنْفَعُ مِمَّا نَزَلَ وَمِمَّا لَمْ يَنْزِلْ فَعَلَيْكُمْ عِبَادَ اللَّهِ بِالدُّعَاءِ» . رَوَاهُ التِّرْمِذِيُّ\nوَرَوَاهُ أَحْمَدُ عَنْ مُعَاذِ بْنِ جَبَلٍ. وَقَالَ التِّرْمِذِيّ هَذَا حَدِيث غَرِيب","english":{"narrator":"","text":"Ibn ‘Umar reported God’s messenger as saying, \"Supplication is beneficial regarding things which have happened and things which have not happened, so devote yourselves to supplication, servants of God.\"\n\nTirmidhi transmitted it, and Ahmad transmitted it from Mu'adh b. Jabal. Tirmidhi said this is a gharib tradition."}},{"id":13,"idInBook":13,"chapterId":9,"bookId":14,"arabic":"وَعَنْ جَابِرٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا مِنْ أَحَدٍ يَدْعُو بِدُعَاءٍ إِلَّا آتَاهُ اللَّهُ مَا سَأَلَ أَوْ كَفَّ عَنْهُ مِنَ السُّوءِ مِثْلَهُ مَا لَمْ يَدْعُ بِإِثْمٍ أَوْ قَطِيعَةِ رحم» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Jabir reported God’s messenger as saying, “No one offers a supplication without God bringing him what he asks or keeping away from him a like amount of evil, provided he does not ask for something sinful or for breaking ties of relationship.” \n\nTirmidhi transmitted it."}},{"id":14,"idInBook":14,"chapterId":9,"bookId":14,"arabic":"وَعَنِ ابْنِ مَسْعُودٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «سَلُوا اللَّهَ مِنْ فَضْلِهِ فَإِنَّ اللَّهَ يُحِبُّ أَنْ يُسْأَلَ وَأَفْضَلُ الْعِبَادَةِ انْتِظَارُ الْفَرَجِ» . رَوَاهُ التِّرْمِذِيّ وَقَالَ هَذَا حَدِيث غَرِيب","english":{"narrator":"","text":"Ibn Mas'ud reported God’s messenger as saying, “Ask God for some of His bounty, for God likes to be asked, and the most excellent worship is expectation of relief.” \n\nTirmidhi transmitted it, saying this is a gharib tradition."}},{"id":15,"idInBook":15,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ لَمْ يَسْأَلِ اللَّهَ يغضبْ عَلَيْهِ» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “God will be angry with those who do not make requests from Him.” \n\nTirmidhi transmitted it."}},{"id":16,"idInBook":16,"chapterId":9,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ فُتِحَ لَهُ مِنْكُمْ بَابُ الدُّعَاءِ فُتِحَتْ لَهُ أَبْوَابُ الرَّحْمَةِ وَمَا سُئِلَ اللَّهُ شَيْئًا يَعْنِي أَحَبَّ إِلَيْهِ مِنْ أَنْ يُسْأَلَ الْعَافِيَةَ» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Ibn ‘Umar reported God's messenger as saying, “If the gate of supplication is opened for any of you, the gates of mercy will be opened for him, and God is not asked for anything He likes so much as to be asked for security.” \n\nTirmidhi transmitted it."}},{"id":17,"idInBook":17,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ سَرَّهُ أَنْ يَسْتَجِيبَ اللَّهُ لَهُ عِنْدَ الشَّدَائِدِ فَلْيُكْثِرِ الدُّعَاءَ فِي الرَّخَاءِ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيث غَرِيب","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “If anyone finds pleasure in receiving an answer from God in times of difficulty, he should make many supplications when times are easy.” \n\nTirmidhi transmitted it, saying this is a gharib tradition."}},{"id":18,"idInBook":18,"chapterId":9,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «ادْعُوا اللَّهَ وَأَنْتُمْ مُوقِنُونَ بِالْإِجَابَةِ وَاعْلَمُوا أَنَّ اللَّهَ لَا يَسْتَجِيبُ دُعَاءً مِنْ قَلْبٍ غَافِلٍ لَاهٍ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حديثٌ غَرِيب","english":{"narrator":"","text":"He reported God’s messenger as saying, “Supplicate God when you are assured of being answered, and know that God does not answer a supplication which comes from a careless and inattentive heart.”\n\nTirmidhi transmitted it, saying this is a gharib tradition."}},{"id":19,"idInBook":19,"chapterId":9,"bookId":14,"arabic":"وَعَنْ مَالِكِ بْنِ يَسَارٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا سَأَلْتُمُ اللَّهَ فَاسْأَلُوهُ بِبُطُونِ أَكُفِّكُمْ وَلَا تَسْأَلُوهُ بِظُهُورِهَا»\nوَفِي رِوَايَةِ ابْنِ عَبَّاسٍ قَالَ: «سَلُوا اللَّهَ بِبُطُونِ أَكُفِّكُمْ وَلَا تَسْأَلُوهُ بِظُهُورِهَا فَإِذَا فَرَغْتُمْ فامسحوا بهَا وُجُوهكُم» . رَوَاهُ دَاوُد","english":{"narrator":"","text":"Malik b. Yasar reported God’s messenger as saying, “When you make requests of God, do so with the palms of your hands and not the backs upward.” In the version of Ibn ‘Abbas he said, “When you make requests of God, do so with the palms of your hands and not the backs upward, and when you are finished wipe your faces with them.” \n\nAbu Dawud transmitted it."}},{"id":20,"idInBook":20,"chapterId":9,"bookId":14,"arabic":"وَعَن سَلْمَانَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ رَبَّكُمْ حَيِيٌّ كَرِيمٌ يَسْتَحْيِي مِنْ عَبْدِهِ إِذَا رَفَعَ يَدَيْهِ إِلَيْهِ أَنْ يَرُدَّهُمَا صِفْرًا» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالْبَيْهَقِيُّ فِي الدَّعوات الْكَبِير","english":{"narrator":"","text":"Salman reported God’s messenger as saying, “Your Lord is munificent and generous, and is ashamed to turn away empty the hands of a servant when he raises them to Him .” \n\nTirmidhi, Abu Dawud and Baihaqi, in  ad-Da'awat al-kabir, transmitted it."}},{"id":21,"idInBook":21,"chapterId":9,"bookId":14,"arabic":"وَعَنْ عُمَرَ رَضِيَ اللَّهُ عَنْهُ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا رَفَعَ يَدَيْهِ فِي الدُّعَاءِ لَمْ يَحُطَّهُمَا حَتَّى يمسح بهما وَجهه. رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"‘Umar said that when God’s messenger raised his hands in supplication he did not lower them till he wiped his face with them. \n\nTirmidhi transmitted it."}},{"id":22,"idInBook":22,"chapterId":9,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْتَحِبُّ الْجَوَامِعَ مِنَ الدُّعَاءِ وَيَدَعُ مَا سِوَى ذَلِكَ. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"‘A’isha said that God’s messenger liked comprehensive supplications and abandoned other kinds. \n\nAbu Dawud transmitted it."}},{"id":23,"idInBook":23,"chapterId":9,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «إِن أَسْرَعَ الدُّعَاءِ إِجَابَةً دَعْوَةُ غَائِبٍ لِغَائِبٍ» . رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد","english":{"narrator":"","text":"‘Abdallah b. ‘Amr reported God’s messenger as saying, “The supplication which gets the quickest answer is that made by one distant friend for another.” \n\nTirmidhi and Abu Dawud transmitted it."}},{"id":24,"idInBook":24,"chapterId":9,"bookId":14,"arabic":"وَعَنْ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ قَالَ اسْتَأْذَنْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْعُمْرَةِ فَأَذِنَ لِي وَقَالَ: «أَشْرِكْنَا يَا أُخَيُّ فِي دُعَائِكَ وَلَا تَنْسَنَا» . فَقَالَ كَلِمَةً مَا يَسُرُّنِي أَنَّ لِيَ بِهَا الدُّنْيَا. رَوَاهُ أَبُو دَاوُدَ وَالتِّرْمِذِيُّ وَانْتَهَتْ رِوَايَتُهُ عِنْدَ قَوْلِهِ «لَا تنسنا»","english":{"narrator":"‘Umar b. al-Khattab said:","text":"I asked the Prophet’s permission to perform an ‘umra and he gave me permission, saying, “Include me in your supplication, little brother, and do not forget me.” Then he said a word to me for which I would not be willing to take the world in exchange. \n\nAbu Dawud and Tirmidhi transmitted it, Tirmidhi’s version ending with “do not forget me.”"}},{"id":25,"idInBook":25,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" ثَلَاثَةٌ لَا تُرَدُّ دَعْوَتُهُمْ: الصَّائِمُ حِينَ يُفْطِرُ وَالْإِمَامُ الْعَادِلُ وَدَعْوَةُ الْمَظْلُومِ يَرْفَعُهَا اللَّهُ فَوْقَ الْغَمَامِ وَتُفْتَحُ لَهَا أَبْوَابُ السَّمَاءِ وَيَقُولُ الرَّبُّ: وَعِزَّتِي لَأَنْصُرَنَّكِ وَلَوْ بعد حِين \". رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"Abu Huraira reported God’s messenger as saying, “There are three whose supplication is not rejected:","text":"one who has just ended a fast, a just imam, and one who has been wronged whose supplication is raised by God above the clouds and for which the gates of heaven are opened. The Lord says, ‘I swear by my might that I will certainly help you, though it be after some time’.” \n\nTirmidhi transmitted it."}},{"id":26,"idInBook":26,"chapterId":9,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" ثَلَاثُ دَعَوَاتٍ مُسْتَجَابَاتٍ لَا شَكَّ فِيهِنَّ: دَعْوَةُ الْوَالِدِ وَدَعْوَةُ الْمُسَافِرِ وَدَعْوَةُ الْمَظْلُومِ \". رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ","english":{"narrator":"He reported God’s messenger as saying, “Three supplications are answered, there being no doubt about them:","text":"that of a parent, that of a traveller, and that of one who has been wronged.” \n\nTirmidhi, Abu Dawud and Ibn Majah transmitted it."}},{"id":27,"idInBook":27,"chapterId":9,"bookId":14,"arabic":"عَنْ أَنَسٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لِيَسْأَلْ أَحَدُكُمْ رَبَّهُ حَاجَتَهُ كُلَّهَا حَتَّى يَسْأَلَهُ شِسْعَ نَعله إِذا انْقَطع»\nزَادَ فِي رِوَايَةٍ عَنْ ثَابِتٍ الْبُنَانِيِّ مُرْسَلًا «حَتَّى يَسْأَلَهُ الْمِلْحَ وَحَتَّى يَسْأَلَهُ شِسْعَهُ إِذَا انْقَطع» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Anas reported God's messenger as saying, “Let one of you ask his Lord for all that he needs, even for the thong of his sandal when it is cut.” He added in a version from Thabit al-Bunani in mursal form, “even asking Him for salt, and even asking Him for his thong when it is cut.” \n\nTirmidhi transmitted it."}},{"id":28,"idInBook":28,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَرْفَعُ يَدَيْهِ فِي الدُّعَاءِ حَتَّى يُرى بياضُ إبطَيْهِ","english":{"narrator":"","text":"Anas said that God’s messenger used to raise his hands in supplication so that the whiteness under his armpits was visible."}},{"id":29,"idInBook":29,"chapterId":9,"bookId":14,"arabic":"وَعَن سهل بن سَعْدٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: كَانَ يَجْعَل أصبعيه حذاء مَنْكِبَيْه وَيَدْعُو","english":{"narrator":"","text":"Sahl b. Sa‘d told of the Prophet being accustomed to place his two fingers opposite his shoulders and make supplication."}},{"id":30,"idInBook":30,"chapterId":9,"bookId":14,"arabic":"وَعَنِ السَّائِبِ بْنِ يَزِيدَ عَنْ أَبِيهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا دَعَا فَرفع يَدَيْهِ مَسَحَ وَجْهَهُ بِيَدَيْهِ\nرَوَى الْبَيْهَقِيُّ الْأَحَادِيثَ الثَّلَاثَة فِي «الدَّعْوَات الْكَبِير»","english":{"narrator":"","text":"As-Sa’ib b. Yazid, on his father’s authority, said that when the Prophet made supplication and raised his hands, he wiped his face with them. \n\nBaihaqi transmitted the three traditions in  ad-Da'awat al-kabir."}},{"id":31,"idInBook":31,"chapterId":9,"bookId":14,"arabic":"وَعَنْ عِكْرِمَةَ عَنِ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: الْمَسْأَلَةُ أَنْ تَرْفَعَ يَدَيْكَ حَذْوَ مَنْكِبَيْكَ أَوْ نَحْوِهِمَا وَالِاسْتِغْفَارُ أَنْ تُشِيرَ بِأُصْبُعٍ وَاحِدَةٍ وَالِابْتِهَالُ أَنْ تَمُدَّ يَدَيْكَ جَمِيعًا وَفِي رِوَايَةٍ قَالَ: والابتهالُ هَكَذَا وَرَفَعَ يَدَيْهِ وَجَعَلَ ظُهُورَهُمَا مِمَّا يَلِي وَجْهَهُ. رَوَاهُ أَبُو دَاوُ","english":{"narrator":"","text":"‘Ikrima quoted Ibn ‘Abbas as saying, “When asking for something you should raise your hands opposite your shoulders or thereabout, when asking for forgiveness you should point with one finger, and when making earnest supplication you should stretch out both your hands.” In a version he said, “Earnest supplication should be made thus,” raising his hands and putting their backs next his face. \n\nAbu Dawud transmitted it."}},{"id":32,"idInBook":32,"chapterId":9,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ أَنَّهُ يَقُولُ: إِنَّ رَفْعَكُمْ أَيْدِيَكُمْ بِدْعَةٌ مَا زَادَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى هَذَا يَعْنِي إِلَى الصَّدْر رَوَاهُ أَحْمد","english":{"narrator":"","text":"Ibn ‘Umar used to say, “Your raising of your hands is an innovation. God’s messenger did no more than this,” meaning that he raised them to his breast. \n\nAhmad transmitted it."}},{"id":33,"idInBook":33,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أُبَيِّ بْنِ كَعْبٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا ذَكَرَ أَحَدًا فَدَعَا لَهُ بَدَأَ بِنَفْسِهِ رَوَاهُ التِّرْمِذِيُّ وَقَالَ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ صَحِيح","english":{"narrator":"","text":"Ubayy b. Ka‘b said that when God’s messenger mentioned anyone for whom he made supplication, he began with himself. \n\nTirmidhi transmitted it, saying this is a hasan gharib sahih tradition."}},{"id":34,"idInBook":34,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" مَا مِنْ مُسْلِمٍ يَدْعُو بِدَعْوَةٍ لَيْسَ فِيهَا إِثْمٌ وَلَا قَطِيعَةُ رَحِمٍ إِلَّا أَعْطَاهُ اللَّهُ بِهَا إِحْدَى ثَلَاثٍ: إِمَّا أَنْ يُعَجِّلَ لَهُ دَعْوَتَهُ وَإِمَّا أَنْ يَدَّخِرَهَا لَهُ فِي الْآخِرَةِ وَإِمَّا أَنْ يَصْرِفَ عنهُ من السُّوءِ مثلَها \" قَالُوا: إِذنْ نُكثرُ قَالَ: «الله أَكثر» . رَوَاهُ أَحْمد","english":{"narrator":"Abu Sa'id al-Khudri reported the Prophet as saying, “Any Muslim who makes a supplication containing nothing which is sinful or which involves breaking ties of relationship will be given for it by God one of three things:","text":"He will give him as peedy answer, or store it up for him in the next world, or turn away from him an equivalent amount of evil.” Those who heard it said they would then make many supplications and he replied that God was more ready to answer than they were to ask.\n\nAhmad transmitted it."}},{"id":35,"idInBook":35,"chapterId":9,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ \n\" خَمْسُ دَعَوَاتٍ يُسْتَجَابُ لَهُنَّ: دَعْوَةُ الْمَظْلُومِ حَتَّى يَنْتَصِرَ وَدَعْوَةُ الْحَاجِّ حَتَّى يَصْدُرَ وَدَعْوَةُ الْمُجَاهِدِ حَتَّى يَقْعُدَ وَدَعْوَةُ الْمَرِيضِ حَتَّى يَبْرَأَ وَدَعْوَةُ الْأَخِ لِأَخِيهِ بِظَهْرِ الْغَيْبِ \". ثُمَّ قَالَ: «وَأَسْرَعُ هَذِهِ الدَّعْوَات إِجَابَة دَعْوَة الْأَخ لِأَخِيهِ بِظَهْرِ الْغَيْبِ» . رَوَاهُ الْبَيْهَقِيُّ فِي الدَّعَوَاتِ الْكَبِيرِ","english":{"narrator":"Ibn ‘Abbas quoted the Prophet as saying, “Five supplications receive an answer:","text":"that of one who is wronged till help comes, that of a pilgrim till he comes home, that of one engaged in jihad till he stops, that of a sick person till he recovers, and that of someone for an absent brother. Then he added, “The one of those which gets the quickest answer is that for an absent brother.” \n\nBaihaqi transmitted it in  ad-Da'awat al-kabir."}},{"id":36,"idInBook":36,"chapterId":9,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ وَأَبِي سَعِيدٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَا: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَقْعُدُ قَوْمٌ يَذْكُرُونَ اللَّهَ إِلَّا حَفَّتْهُمُ الْمَلَائِكَةُ وَغَشِيَتْهُمُ الرَّحْمَةُ وَنَزَلَتْ عَلَيْهِمُ السَّكِينَةُ وَذَكَرَهُمُ اللَّهُ فَيْمَنْ عِنْدَهُ» . رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"Abu Huraira and Abu Said reported God’s messenger as saying, “People will not sit remembering God without the angels surrounding them, mercy covering them, peace(1) descending on them, and God mentioning them among those who are with Him.” \n1. Here I have translated as-sakina as \"peace” , but cf. p.448, n. 2.\n\nMuslim transmitted it."}},{"id":37,"idInBook":37,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسِيرُ فِي طَرِيقِ مَكَّةَ فَمَرَّ عَلَى جَبَلٍ يُقَالُ لَهُ: جُمْدَانُ فَقَالَ: «سِيرُوا هَذَا جُمْدَانُ سَبَقَ الْمُفَرِّدُونَ» . قَالُوا: وَمَا الْمُفَرِّدُونَ؟ يَا رَسُولَ اللَّهِ قَالَ: «الذَّاكِرُونَ الله كثيرا وَالذَّاكِرَات» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Huraira said that when God’s messenger was travelling on the way to Mecca and came to a mountain called Jumdan he said, “Go on, this is Jumdan; the mufarriduna have gone ahead.” On being asked what the mufarriduna meant he replied, “Those men and women who make frequent remembrance of God.” \n\nMuslim transmitted it."}},{"id":38,"idInBook":38,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي مُوسَى قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَثَلُ الَّذِي يَذْكُرُ رَبَّهُ وَالَّذِي لَا يَذْكُرُ مَثَلُ الْحَيّ وَالْمَيِّت»","english":{"narrator":"","text":"Abu Musa reported God’s messenger as saying, “He who remembers his Lord and he who does not are like the living and the dead.” \n\n(Bukhari and Muslim.)"}},{"id":39,"idInBook":39,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" يَقُولُ اللَّهُ تَعَالَى: أَنَا عِنْدَ ظَنِّ عَبْدِي بِي وَأَنَا مَعَهُ إِذَا ذَكَرَنِي فَإِنْ ذَكَرَنِي فِي نَفْسِهِ ذَكَرْتُهُ فِي نَفْسِي وَإِنْ ذَكَرَنِي فِي مَلَأٍ ذَكَرْتُهُ فِي مَلَأٍ خير مِنْهُم","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as stating that God says, “I am present when my servant thinks of me, and I am with him when he remembers me. If he remembers me inwardly I shall remember him inwardly, and if he remembers me among people I shall remember him among people who are better than they.” \n\n(Bukhari and Muslim.)"}},{"id":40,"idInBook":40,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي ذَرٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" يَقُولُ اللَّهُ تَعَالَى: مَنْ جَاءَ بِالْحَسَنَةِ فَلَهُ عَشْرُ أَمْثَالِهَا وأزيد وَمن جَاءَ بِالسَّيِّئَةِ فجزاء سَيِّئَة مِثْلُهَا أَوْ أَغْفِرُ وَمَنْ تَقَرَّبَ مِنِّي شِبْرًا تَقَرَّبْتُ مِنْهُ ذِرَاعًا وَمِنْ تَقَرَّبَ مِنِّي ذِرَاعًا تَقَرَّبْتُ مِنْهُ بَاعًا وَمَنْ أَتَانِي يَمْشِي أَتَيْتُهُ هَرْوَلَةً وَمَنْ لَقِيَنِي بِقُرَابِ الْأَرْضِ خَطِيئَةً لَا يُشْرِكُ بِي شَيْئًا لَقِيتُهُ بِمِثْلِهَا مَغْفِرَةً \". رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Dharr reported God’s messenger as stating that God says, “He who does a good deed will have ten times that amount of blessing, and I shall give more; but he who does an evil deed will have an equivalent reward of evil, or I shall grant forgiveness. If anyone draws the length of a span near me I shall draw the length of a cubit near him, and if anyone draws the length of a cubit near me I shall draw the length of a fathom near him. If anyone comes to me walking I shall come to him at a run, and if anyone meets me with sins tantamount to the size of the earth, but has not associated anything with me, I shall meet him with a similar amount of forgiveness.” \n\nMuslim transmitted it."}},{"id":41,"idInBook":41,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" إِنَّ اللَّهَ تَعَالَى قَالَ: مَنْ عَادَى لِي وَلِيًّا فَقَدْ آذَنْتُهُ بِالْحَرْبِ وَمَا تَقَرَّبَ إِلَيَّ عَبْدِي بِشَيْءٍ أَحَبَّ إِلَيَّ مِمَّا افْتَرَضْتُ عَلَيْهِ وَمَا يَزَالُ عَبْدِي يَتَقَرَّبُ إِلَيَّ بِالنَّوَافِلِ حَتَّى أُحِبَّهُ فَإِذَا أَحْبَبْتُهُ كُنْتُ سَمْعَهُ الَّذِي يَسْمَعُ بِهِ وَبَصَرَهُ الَّذِي يُبْصِرُ بِهِ وَيَدَهُ الَّتِي يَبْطِشُ بِهَا وَرِجْلَهُ الَّتِي يَمْشِي بِهَا وَإِنْ سَأَلَنِي لَأُعْطِيَنَّهُ وَلَئِنِ اسْتَعَاذَنِي لَأُعِيذَنَّهُ وَمَا تَرَدَّدْتُ عَنْ شَيْءٍ أَنَا فَاعِلُهُ تَرَدُّدِي عَنْ نَفْسِ الْمُؤْمِنِ يَكْرَهُ الْمَوْتَ وَأَنَا أَكْرَهُ مُسَاءَتَهُ وَلَا بُدَّ لَهُ مِنْهُ \". رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as stating that God has said, “If anyone is hostile to a friend of mine, I have declared war against him. No one draws near to me with anything dearer to me than what I have made obligatory for him. If my servant keeps drawing near to me with supererogatory acts I shall love him, and when I love him I shall be his hearing with which he hears, his sight with which he sees, his hand with which he grasps and his foot with which he walks. If he asks from me I shall certainly give him and if he seeks refuge in me I shall certainly give him refuge. I have not hesitated about anything I do as I hesitate about taking the soul of a believer who dislikes death, for I dislike grieving him, but he cannot escape it.” \n\nBukhari transmitted it."}},{"id":42,"idInBook":42,"chapterId":9,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" إِنَّ لِلَّهِ مَلَائِكَةً يَطُوفُونَ فِي الطُّرُقِ يَلْتَمِسُونَ أَهْلَ الذِّكْرِ فَإِذَا وَجَدُوا قَوْمًا يَذْكُرُونَ اللَّهَ تَنَادَوْا: هَلُمُّوا إِلَى حَاجَتِكُمْ \" قَالَ: «فَيَحُفُّونَهُمْ بِأَجْنِحَتِهِمْ إِلَى السَّمَاءِ الدُّنْيَا» قَالَ: \" فَيَسْأَلُهُمْ رَبُّهُمْ وَهُوَ أَعْلَمُ بِهِمْ: مَا يَقُولُ عِبَادِي؟ \" قَالَ: \" يَقُولُونَ: يُسَبِّحُونَكَ وَيُكَبِّرُونَكَ وَيُحَمِّدُونَكَ وَيُمَجِّدُونَكَ \" قَالَ: \" فَيَقُولُ: هَلْ رَأَوْنِي؟ \" قَالَ: \" فَيَقُولُونَ: لَا وَاللَّهِ مَا رَأَوْكَ \" قَالَ فَيَقُولُ: كَيْفَ لَوْ رَأَوْنِي؟ قَالَ: \" فَيَقُولُونَ: لَوْ رَأَوْكَ كَانُوا أَشَدَّ لَكَ عِبَادَةً وَأَشَدَّ لَكَ تَمْجِيدًا وَأَكْثَرَ لَكَ تَسْبِيحًا \" قَالَ: \" فَيَقُولُ: فَمَا يَسْأَلُونَ؟ قَالُوا: يسألونكَ الجنَّةَ \" قَالَ: \" يَقُول: وَهل رأوها؟ \" قَالَ: \" فَيَقُولُونَ: لَا وَاللَّهِ يَا رَبِّ مَا رَأَوْهَا \" قَالَ: \" فَيَقُولُ: فَكَيْفَ لَوْ رَأَوْهَا؟ \" قَالَ: \" يقولونَ: لَو أنَّهم رأوها كَانُوا أَشد حِرْصًا وَأَشَدَّ لَهَا طَلَبًا وَأَعْظَمَ فِيهَا رَغْبَةً قَالَ: فممَّ يتعوذون؟ \" قَالَ: \" يَقُولُونَ: مِنَ النَّارِ \" قَالَ: \" يَقُولُ: فَهَلْ رَأَوْهَا؟ \" قَالَ: يَقُولُونَ: «لَا وَاللَّهِ يَا رَبِّ مَا رَأَوْهَا» قَالَ: \" يَقُولُ: فَكَيْفَ لَوْ رَأَوْهَا؟ \" قَالَ: «يَقُولُونَ لَوْ رَأَوْهَا كَانُوا أَشَدَّ مِنْهَا فِرَارًا وَأَشَدَّ لَهَا مَخَافَةً» قَالَ: \" فَيَقُولُ: فَأُشْهِدُكُمْ أَنِّي قَدْ غَفَرْتُ لَهُمْ \" قَالَ: \" يَقُولُ مَلَكٌ مِنَ الْمَلَائِكَةِ: فِيهِمْ فُلَانٌ لَيْسَ مِنْهُمْ إِنَّمَا جَاءَ لِحَاجَةٍ قَالَ: هُمُ الْجُلَسَاءُ لَا يَشْقَى جَلِيسُهُمْ \". رَوَاهُ الْبُخَارِيُّ\nوَفِي رِوَايَةِ مُسْلِمٍ قَالَ: \" إِنَّ لِلَّهِ مَلَائِكَةً سَيَّارَةً فُضْلًا يَبْتَغُونَ مَجَالِسَ الذِّكْرِ فَإِذَا وَجَدُوا مَجْلِسًا فِيهِ ذِكْرٌ قَعَدُوا معَهُم وحفَّ بعضُهم بَعْضًا بأجنحتِهم حَتَّى يملأوا مَا بَيْنَهُمْ وَبَيْنَ السَّمَاءِ الدُّنْيَا فَإِذَا تَفَرَّقُوا عَرَجُوا وَصَعِدُوا إِلَى السَّمَاءِ قَالَ: فَيَسْأَلُهُمُ اللَّهُ وَهُوَ أَعْلَمُ: مِنْ أَيْنَ جِئْتُمْ؟ فَيَقُولُونَ: جِئْنَا مِنْ عِنْدِ عِبَادِكَ فِي الْأَرْضِ يُسَبِّحُونَكَ وَيُكَبِّرُونَكَ وَيُهَلِّلُونَكَ وَيُمَجِّدُونَكَ وَيَحْمَدُونَكَ وَيَسْأَلُونَكَ قَالَ: وَمَاذَا يَسْأَلُونِي؟ قَالُوا: يَسْأَلُونَكَ جَنَّتَكَ قَالَ: وَهَلْ رَأَوْا جَنَّتِي؟ قَالُوا: لَا أَيْ رَبِّ قَالَ: وَكَيْفَ لَوْ رَأَوْا جَنَّتِي؟ قَالُوا: وَيَسْتَجِيرُونَكَ قَالَ: وَمِمَّ يَسْتَجِيرُونِي؟ قَالُوا: مِنْ نَارِكَ قَالَ: وَهَلْ رَأَوْا نَارِي؟ قَالُوا: لَا. قَالَ: فَكَيْفَ لَوْ رَأَوْا نَارِي؟ قَالُوا: يَسْتَغْفِرُونَكَ \" قَالَ: \" فَيَقُولُ: قَدْ غَفَرْتُ لَهُمْ فَأَعْطَيْتُهُمْ مَا سَأَلُوا وَأَجَرْتُهُمْ مِمَّا اسْتَجَارُوا \" قَالَ: \" يَقُولُونَ: رَبِّ فِيهِمْ فُلَانٌ عَبْدٌ خَطَّاءٌ وَإِنَّمَا مَرَّ فَجَلَسَ مَعَهُمْ \" قَالَ: «فَيَقُولُ وَلَهُ غَفَرْتُ هم الْقَوْم لَا يشقى بهم جليسهم»","english":{"narrator":"","text":"He reported God’s messenger as saying, “God has angels who go about on the roads seeking those who remember God, and when they find people doing so they call to one another, ‘Come to what you are looking for’, and surround them with their wings up to the lowest heaven.” He said that their Lord then asks them, although He is best informed about them, “What are my servants saying?” They reply, “They are extolling, magnifying, praising and glorifying Thee.” He asks whether they have seen Him, and when they reply, “No indeed, they have not seen Thee,” He asks how they would act if they had seen Him, to which they reply, “If they had seen Thee they would have engaged more earnestly in worshipping and glorifying Thee, and would have extolled Thee much more.” He then says, “What are they asking for?” and they reply, “They are asking Thee for paradise.” He asks whether they have seen it, and when they reply, “No indeed, my Lord, they have not seen it,” He asks how they would act if they had seen it to which they reply, “If they had seen it they would have been more intensely eager for it, would have asked more earnestly for it, and would have had a greater desire for it.” He asks what they are seeking refuge from, to which they reply that it is from hell. He asks whether they have seen it, and when they reply, “No indeed, my Lord, they have not seen it,” He asks how they would act if they had seen it, to which they reply, “If they had seen it they would have been more earnest in flying from it and fearing it.” He then says, “I call you to witness that I have forgiven them.” One of the angels says, “Among them is so and so who does not belong to their number, but has come only for something he wants,” and He replies, “They are people who are seated together, and he who sits with them will not be miserable.” \n\nBukhari transmitted it.\n\nIn Muslim's version he said that God has angels who travel round to a great extent looking for meetings where remembrance is being made of God, and when they find a meeting where this is being done they sit with them and surround one another, with their wings so as to fill the space between them and the lowest heaven. When the people separate they ascend up to heaven, and God who knows best asks them where they have come from. They reply, “We have come from Thy servants on the earth who are extolling and magnifying Thee, declaring Thy unity, praising Thee and making request of Thee.” He says, “For what are they asking me?” and they reply, “They are asking Thee for Thy paradise.” He asks whether they have seen His paradise, and when they reply, “No my Lord.” He asks how they would act if they had seen His paradise. They say, “They are also seeking Thy protection.” He asks, “From what are they seeking my protection?” and they reply, “From Thy fire.” He asks whether they have seen His fire, and when they reply that they have not, He asks how they would act if they had seen His fire. They say, “They are also asking Thy forgiveness,” to which He replies, “I have forgiven them, given them what they have asked for, and protected them from what they sought protection.” They say, “My Lord, so and so, a sinner, is among them, who just happening to pass by sat down with them.” He replies, “Him also I have forgiven. They are the people by reason of whom their associate will not be miserable.”"}},{"id":43,"idInBook":43,"chapterId":9,"bookId":14,"arabic":"وَعَن حَنْظَلَة بن الرّبيع الأسيدي قَالَ: لَقِيَنِي أَبُو بكر فَقَالَ: كَيْفَ أَنْتَ يَا حَنْظَلَةُ؟ قُلْتُ: نَافَقَ حَنْظَلَةُ قَالَ: سُبْحَانَ اللَّهِ مَا تَقُولُ؟ قُلْتُ: نَكُونُ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُذَكِّرُنَا بِالنَّارِ وَالْجَنَّةِ كَأَنَّا رَأْيُ عَيْنٍ فَإِذَا خَرَجْنَا مِنْ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَافَسْنَا الْأَزْوَاجَ وَالْأَوْلَادَ وَالضَّيْعَاتِ نَسِينَا كثيرا قَالَ أَبُو بكر: فو الله إِنَّا لَنَلْقَى مِثْلَ هَذَا فَانْطَلَقْتُ أَنَا وَأَبُو بَكْرٍ حَتَّى دَخَلْنَا عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ: نَافَقَ حَنْظَلَةُ يَا رَسُولَ اللَّهُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «وَمَا ذَاكَ؟» قُلْتُ: يَا رَسُولَ اللَّهِ نَكُونُ عِنْدَكَ تُذَكِّرُنَا بِالنَّارِ وَالْجَنَّةِ كَأَنَّا رَأْيَ عَيْنٍ فَإِذَا خَرَجْنَا مِنْ عِنْدِكَ عَافَسْنَا الْأَزْوَاجَ وَالْأَوْلَادَ وَالضَّيْعَاتِ نَسِينَا كَثِيرًا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الَّذِي نَفْسِي بِيَدِهِ لَوْ تَدُومُونَ عَلَى مَا تَكُونُونَ عِنْدِي وَفِي الذِّكْرِ لَصَافَحَتْكُمُ الْمَلَائِكَةُ عَلَى فُرُشِكُمْ وَفِي طُرُقِكُمْ وَلَكِنْ يَا حَنْظَلَةُ سَاعَةٌ وَسَاعَةٌ» ثَلَاث مَرَّات. رَوَاهُ مُسلم","english":{"narrator":"Hanzala b. ar-Rabi al-Usaidi said:","text":"Abu Bakr met me and asked, “How are you, Hanzala?” I replied, “Hanzala has become a hypocrite.\"He said, “Praise be to God! What are you saying?” I replied, “We are with God’s messenger and he reminds us of hell and paradise making us almost seem to see them, then when we go out and leave God’s messenger we have dealings with our wives, our children and our properties and forget much.” On hearing this Abu Bakr said, “I swear by God that I have the same kind of experience.” He and I then went to visit God’s messenger, and I said, “Hanzala has become a hypocrite, messenger of God.” He asked what I meant by that and I replied, “Messenger of God, we are with you when you are reminding us of hell and paradise and making us almost seem to see them, then when we go out and leave you we have dealings with our wives, our children and our properties and forget much.” God's messenger replied, “By Him in whose hand my soul is, if you were to continue in what you have been engaged in with me and in remembering God, the angles would shake hands with you when you lie down and when you walk about; 1. but, Hanzala, there is a time for everything.” He said this three times. \n1. i.e. when you are at leisure and when you are engaged in business\n\nMuslim transmitted it."}},{"id":44,"idInBook":44,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي الدَّرْدَاءِ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَلَا أُنَبِّئُكُمْ بِخَيْرِ أَعْمَالِكُمْ وَأَزْكَاهَا عِنْدَ مَلِيكِكُمْ؟ وَأَرْفَعِهَا فِي دَرَجَاتِكُمْ؟ وَخَيْرٍ لَكُمْ مِنْ إِنْفَاقِ الذهبِ والوَرِقِ؟ وخيرٍ لكم مِنْ أَنْ تَلْقَوْا عَدُوَّكُمْ فَتَضْرِبُوا أَعْنَاقَهُمْ وَيَضْرِبُوا أَعْنَاقَكُمْ؟» قَالُوا: بَلَى قَالَ: «ذِكْرُ اللَّهِ» . رَوَاهُ مَالِكٌ وَأَحْمَدُ وَالتِّرْمِذِيُّ وَابْنُ مَاجَهْ إِلَّا أَنَّ مَالِكًا وَقفه على أبي الدَّرْدَاء","english":{"narrator":"","text":"Abud Darda’ reported God's messenger as saying, “Would you like me to tell you the best and purest of your deeds in the estimation of your King, those which raise your degrees highest, those which are better for you than spending gold and silver, and are better for you than that you should meet your enemy and cut off one another's head?” On receiving a reply in the affirmative he said, “It is remembering God.” \n\nMalik, Ahmad, Tirmidhi and Ibn Majah transmitted it, but Malik traced it no farther back than Abud Darda’."}},{"id":45,"idInBook":45,"chapterId":9,"bookId":14,"arabic":"وَعَن عبد الله بن يسر قَالَ: جَاءَ أَعْرَابِيٌّ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: أَيُّ النَّاسِ خَيْرٌ؟ فَقَالَ: «طُوبَى لِمَنْ طَالَ عُمْرُهُ وَحَسُنَ عَمَلُهُ» قَالَ: يَا رَسُولَ اللَّهِ أَيُّ الْأَعْمَالِ أَفْضَلُ؟ قَالَ: ( «ن تُفَارِقَ الدُّنْيَا وَلِسَانُكَ رَطْبٌ مِنْ ذِكْرِ اللَّهِ» رَوَاهُ أَحْمد وَالتِّرْمِذِيّ","english":{"narrator":"","text":"‘Abdallah b. Busr told of a desert Arab coming to the Prophet and asking who was best among men, to which he replied, “Happy is he whose life is long and whose deeds are good.” He asked God’s messenger what deed was most excellent, and he replied, “That you should leave the world with the mention of God fresh on your tongue.” \n\nAhmad and Tirmidhi transmitted it."}},{"id":46,"idInBook":46,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَنَسٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا مَرَرْتُمْ بِرِيَاضِ الْجَنَّةِ فَارْتَعُوا» قَالُوا: وَمَا رِيَاضُ الْجِنّ؟ قَالَ: «حلق الذّكر» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Anas reported God’s messenger as saying, “When you come upon the pastures of paradise feed on them.” On being asked what the pastures of paradise were he replied that they were circles where God is remembered. \n\nTirmidhi transmitted it."}},{"id":47,"idInBook":47,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ قَعَدَ مَقْعَدًا لَمْ يَذْكُرِ اللَّهَ فِيهِ كَانَتْ عَلَيْهِ مِنَ اللَّهِ تِرَةٌ وَمَنِ اضْطَجَعَ مَضْجَعًا لَا يذكر الله فِيهِ كَانَ عَلَيْهِ مِنَ اللَّهِ تِرَةٌ» . رَوَاهُ أَبُو دَاوُدَ","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “If anyone sits in a place where he does not remember God, deprivation will descend on him from God; and if anyone lies down in a place where he does not remember God, vengeance will descend on him from God.” \n\nAbu Dawud transmitted it."}},{"id":48,"idInBook":48,"chapterId":9,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا مِنْ قَوْمٍ يَقُومُونَ مِنْ مَجْلِسٍ لَا يَذْكُرُونَ اللَّهَ فِيهِ إِلَّا قَامُوا عَنْ مِثْلِ جِيفَةِ حِمَارٍ وَكَانَ عَلَيْهِمْ حَسرَةً» . رَوَاهُ أحمدُ وَأَبُو دَاوُد","english":{"narrator":"","text":"He reported God's messenger as saying, \"People who arise from an assembly in which they did not remember God will be just as if they had got up from an ass's corpse, and it will be a cause of grief to them.\"\n\nAhmad and Abu Dawud transmitted it."}},{"id":49,"idInBook":49,"chapterId":9,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا جَلَسَ قَوْمٌ مَجْلِسًا لَمْ يَذْكُرُوا اللَّهَ فِيهِ وَلَمْ يُصَلُّوا عَلَى نَبِيِّهِمْ إِلَّا كَانَ عَلَيْهِمْ تِرَةً فَإِنْ شَاءَ عَذَّبَهُمْ وَإِنْ شَاءَ غَفَرَ لَهُمْ» . رَوَاهُ التِّرْمِذِيُّ","english":{"narrator":"","text":"He reported God's messenger as saying, \"If people sit in an assembly in which they do not remember God or invoke a blessing on their Prophet, vengeance will descend upon them. If God will He will punish them, but if He wills He will forgive them.” \n\nTirmidhi transmitted it."}},{"id":50,"idInBook":50,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أُمِّ حَبِيبَةَ قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «كُلُّ كَلَامِ ابْنِ آدَمَ عَلَيْهِ لَا لَهُ إِلَّا أَمْرٌ بِمَعْرُوفٍ أَوْ نَهْيٌ عَنْ مُنْكَرٍ أَوْ ذِكْرُ اللَّهِ» . رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيث غَرِيب","english":{"narrator":"","text":"Umm Habiba reported God's messenger as saying, \"Everything a son of Adam says counts against him and not in his favour, except recommending what is good, prohibiting what is objectionable, or making mention of God.\"\n\nTirmidhi and Ibn Majah transmitted it, Tirmidhi saying this is a gharib tradition."}},{"id":51,"idInBook":51,"chapterId":9,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تُكْثِرُوا الْكَلَامَ بِغَيْرِ ذِكْرِ اللَّهِ فَإِنَّ كَثْرَةَ الْكَلَامِ بِغَيْرِ ذِكْرِ اللَّهِ قَسْوَةٌ لِلْقَلْبِ وَإِنَّ أَبْعَدَ النَّاسِ مِنَ اللَّهِ الْقَلْبُ الْقَاسِي» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Ibn ‘Umar reported God’s messenger as saying, \"Do not speak much without mentioning God, for much talk without mention of God produces hardness of heart, and the one who is farthest from God is he who has a hard heart.\" \n\nTirmidhi transmitted it."}},{"id":52,"idInBook":52,"chapterId":9,"bookId":14,"arabic":"وَعَنْ ثَوْبَانَ قَالَ: لَمَّا نَزَلَتْ (وَالَّذِينَ يَكْنِزُونَ الذَّهَب وَالْفِضَّة)\nكُنَّا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي بَعْضِ أَسْفَارِهِ فَقَالَ بَعْضُ أَصْحَابِهِ: نَزَلَتْ فِي الذَّهَبِ وَالْفِضَّةِ لَوْ عَلِمْنَا أَيُّ الْمَالِ خَيْرٌ فَنَتَّخِذَهُ؟ فَقَالَ: «أَفْضَلُهُ لِسَانٌ ذَاكِرٌ وَقَلْبٌ شَاكِرٌ وَزَوْجَةٌ مُؤْمِنَةٌ تُعِينُهُ عَلَى إِيمَانِهِ» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَابْنُ مَاجَهْ","english":{"narrator":"","text":"Thauban said that when \"And those who hoard gold and silver\" 1. came down they were with the Prophet on one of his journeys. One of his companions said, \"It has come down about gold and silver. Would that we knew what property is best so that we might get it!\" He replied, \"The best property is a tongue which makes mention of God, a grateful heart, and a believing wife who helps a man with his faith.\" \n1. Qur’an, ix, 34.\n\nAhmad, Tirmidhi and Ibn Majah transmitted it."}},{"id":53,"idInBook":53,"chapterId":9,"bookId":14,"arabic":"عَنْ أَبِي سَعِيدٍ قَالَ: خَرَجَ مُعَاوِيَةُ عَلَى حَلْقَةٍ فِي الْمَسْجِدِ فَقَالَ: مَا أَجْلَسَكُمْ؟ قَالُوا: جَلَسْنَا نَذْكُرُ اللَّهَ قَالَ: آللَّهِ مَا أَجْلَسَكُمْ إِلَّا ذَلِكَ؟ قَالُوا: آللَّهِ مَا أَجْلَسَنَا غَيْرُهُ قَالَ: أما إِنِّي لم أستحلفكم تُهْمَة لكم وَمَا كَانَ أَحَدٌ بِمَنْزِلَتِي مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَقَلَّ عَنْهُ حَدِيثًا مِنِّي وَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ عَلَى حَلْقَةٍ مِنْ أَصْحَابِهِ فَقَالَ: «مَا أَجْلَسَكُمْ هَاهُنَا» قَالُوا: جَلَسْنَا نَذْكُرُ اللَّهَ وَنَحْمَدُهُ عَلَى مَا هَدَانَا لِلْإِسْلَامِ وَمَنَّ بِهِ علينا قَالَ: \" آالله مَا أجلسكم إِلَّا ذَلِك؟ قَالُوا: آالله مَا أَجْلَسَنَا إِلَّا ذَلِكَ قَالَ: «أَمَا إِنِّي لَمْ أَسْتَحْلِفْكُمْ تُهْمَةً لَكُمْ وَلَكِنَّهُ أَتَانِي جِبْرِيلُ فَأَخْبَرَنِي أَنَّ اللَّهَ عَزَّ وَجَلَّ يُبَاهِي بِكُمُ الْمَلَائِكَة» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Sa'id said that Mu'awiya went out to a circle in the mosque and asked them what had made them sit together. When they replied that they had sat down to remember God, he said, \"I adjure you by God, has nothing else made you sit together?\" On their reply that there was certainly no other cause he said, \"I did not adjure you because I suspected you. No one in my position with relation to God’s messenger has fewer traditions from him than I have; but God’s messenger went out to a circle of his companions and asked them what had made them sit there, and when they replied that they had sat together to remember God and praise Him for guiding them to Islam and bestowing favour on them he said, ‘I adjure you by God, has nothing else made you sit together?’ On their replying that there was certainly no other cause he said, ‘I did not adjure you because’ I suspected you, but Gabriel came to me and told me God is speaking proudly of you to the angels’.\"\n\nMuslim transmitted it."}},{"id":54,"idInBook":54,"chapterId":9,"bookId":14,"arabic":"وَعَن عبد الله بن يسر: أَنَّ رَجُلًا قَالَ: يَا رَسُولَ اللَّهِ إِنَّ شَرَائِعَ الْإِسْلَامِ قَدْ كَثُرَتْ عَلَيَّ فَأَخْبِرْنِي بِشَيْءٍ أَتَشَبَّثُ بِهِ قَالَ: \" لَا يَزَالُ لِسَانُكَ رَطْبًا بِذكر اللَّهِ)\nرَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيث حسن غَرِيب","english":{"narrator":"","text":"‘Abdallah b. Busr told of a man saying, “Messenger of God, the ordinances of Islam are too many for me, so tell me something to which I may cling.” He replied, “Your tongue will continue to be supple by making mention of God.” \n\nTirmidhi and Ibn Majah transmitted it. Tirmidhi saying this is a hasan gharib tradition."}},{"id":55,"idInBook":55,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ: أَيُّ الْعِبَادِ أَفْضَلُ وَأَرْفَعُ دَرَجَةً عِنْدَ اللَّهِ يَوْمَ الْقِيَامَةِ؟ قَالَ: «الذَّاكِرُونَ اللَّهَ كَثِيرًا وَالذَّاكِرَاتُ» قِيلَ: يَا رَسُولَ اللَّهِ وَمِنَ الْغَازِي فِي سَبِيلِ اللَّهِ؟ قَالَ: «لَوْ ضَرَبَ بِسَيْفِهِ فِي الْكُفَّارِ وَالْمُشْرِكِينَ حَتَّى يَنْكَسِرَ وَيَخْتَضِبَ دَمًا فَإِنَّ الذَّاكِرَ لِلَّهِ أَفْضَلُ مِنْهُ دَرَجَة» . رَوَاهُ أَحْمد وَالتِّرْمِذِيّ وَقَالَ التِّرْمِذِيّ: هَذَا حَدِيث حسن غَرِيب","english":{"narrator":"","text":"Abu Sa'id said God’s messenger was asked who would be most excellent and most exalted in degree in God’s estimation on the day of resurrection, and replied, “The men and women who make frequent mention of God.” He was asked if they would be superior even to the man who had fought in God’s path, and replied, “Even though he plied his sword among infidels and polytheists till it was broken and smeared with blood, the one who made mention of God would have a more excellent degree than he.” \n\nAhmad and Tirmidhi transmitted it, the latter saying this is a gharib tradition."}},{"id":56,"idInBook":56,"chapterId":9,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الشَّيْطَانُ جَاثِمٌ عَلَى قَلْبِ ابْنِ آدَمَ فَإِذَا ذَكَرَ اللَّهَ خَنَسَ وَإِذا غفَلَ وسوس» . رَوَاهُ البُخَارِيّ تَعْلِيقا","english":{"narrator":"","text":"Ibn ‘Abbas reported God’s messenger as saying, “The devil is couching at the heart of the son of Adam. When he mentions God he withdraws, but when he is neglectful he makes evil suggestions.” \n\nBukhari mentioned it in a note."}},{"id":57,"idInBook":57,"chapterId":9,"bookId":14,"arabic":"وَعَنْ مَالِكٍ قَالَ: بَلَغَنِي أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ: «ذَاكِرُ اللَّهِ فِي الْغَافِلِينَ كَالْمُقَاتِلِ خَلْفَ الْفَارِّينَ وَذَاكِرُ اللَّهِ فِي الْغَافِلِينَ كَغُصْنٍ أَخْضَرَ فِي شَجَرٍ يَابِس»\nوَفِي رِوَايَةٍ: «مَثَلُ الشَّجَرَةِ الْخَضْرَاءِ فِي وَسَطِ الشَّجَرِ وَذَاكِرُ اللَّهِ فِي الْغَافِلِينَ مَثَلُ مِصْبَاحٍ فِي بَيْتٍ مُظْلِمٍ وَذَاكِرُ اللَّهِ فِي الْغَافِلِينَ يُرِيهِ اللَّهُ مَقْعَدَهُ مِنَ الْجَنَّةِ وَهُوَ حَيٌّ وَذَاكِرُ اللَّهِ فِي الْغَافِلِينَ يُغْفَرُ لَهُ بِعَدَدِ كُلِّ فَصِيحٍ وَأَعْجَمٍ» . وَالْفَصِيحُ: بَنُو آدَمَ وَالْأَعْجَمُ: الْبَهَائِم. رَوَاهُ رزين","english":{"narrator":"","text":"Malik said he heard God’s messenger used to say, “The one who makes mention of God among those who are negligent is like one who goes on fighting after others have fled; the one who makes mention of God among those who are negligent is like a green branch upon a withered tree; (A version has, “Like a green tree amidst the trees”); the one who makes mention of God among those who are negligent is like a lamp in a dark house; the one who makes mention of God among those who are negligent will be shown by God during his lifetime his resting-place in paradise; and the one who makes mention of God among those who are negligent will be forgiven as many sins as the number of those who have the faculty of speech (fasih) and those who are destitute of it (a'jam)” Fasih refers to human beings and a'jam to animals. \n\nRazin transmitted it."}},{"id":58,"idInBook":58,"chapterId":9,"bookId":14,"arabic":"وَعَنْ مُعَاذِ بْنِ جَبَلٍ قَالَ: مَا عَمِلَ الْعَبْدُ عَمَلًا أَنْجَى لَهُ مِنْ عَذَابِ اللَّهِ مِنْ ذِكْرِ اللَّهِ. رَوَاهُ مَالِكٌ وَالتِّرْمِذِيُّ وَابْنُ مَاجَه","english":{"narrator":"","text":"Mu'adh b. Jabal said, “A man does nothing more calculated to rescue him from God’s punishment than making mention of God.” \n\nMalik, Tirmidhi and Ibn Majah transmitted it."}},{"id":59,"idInBook":59,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" إِنَّ اللَّهَ تَعَالَى يَقُولُ: أَنَا مَعَ عَبْدِي إِذَا ذَكَرَنِي وتحركت بِي شفتاه \". رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Abu Huraira reported God's messenger as stating that God says, \"I am with my servant when he remembers me and his lips move making mention of me.\" \n\nBukhari transmitted it."}},{"id":60,"idInBook":60,"chapterId":9,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ يَقُولُ: «لِكُلِّ شَيْءٍ صِقَالَةٌ وَصِقَالَةُ الْقُلُوبِ ذِكْرُ اللَّهِ وَمَا مِنْ شَيْءٍ أَنْجَى مِنْ عَذَابِ اللَّهِ مِنْ ذِكْرِ اللَّهِ» قَالُوا: وَلَا الْجِهَادُ فِي سَبِيلِ اللَّهِ؟ قَالَ: «وَلَا أَنْ يَضْرِبَ بِسَيْفِهِ حَتَّى يَنْقَطِعَ» . رَوَاهُ الْبَيْهَقِيُّ فِي الدَّعَوَاتِ الْكَبِيرِ","english":{"narrator":"","text":"‘Abdallah b. ‘Umar told that the Prophet used to say, “Everything has a polish, and the polish for hearts is rememberance of God. Nothing is more calculated to resuce from God’s punishment than remembrance of God.” He was asked whether this did not apply also to jihad in God’s path, and said, “Not even if one should ply his sword till it is broken.” \n\nBaihaqi transmitted it in  ad-Da'awat al-kabir."}},{"id":61,"idInBook":61,"chapterId":9,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ لِلَّهِ تَعَالَى تِسْعَةً وَتِسْعِينَ اسْمًا مِائَةً إِلَّا وَاحِدًا مَنْ أَحْصَاهَا دَخَلَ الْجَنَّةَ» . وَفِي رِوَايَة: «وَهُوَ وتر يحب الْوتر»","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “God had ninety-nine names, one short of a hundered. He who retains them in his memory* will enter paradise.” A version has, “And He is One. He loves what is single.” \n*The Arabic is ahsaha, a word which has different meanings. Besides the meaning above can mean to number, to reach the last number, to understand, to attain comprehensive knowledge.\n\n(Bukhari and Muslim.)"}},{"id":62,"idInBook":62,"chapterId":9,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ لِلَّهِ تَعَالَى تِسْعَةً وَتِسْعِينَ اسْمًا مَنْ أَحْصَاهَا دَخَلَ الْجَنَّةَ هُوَ اللَّهُ الَّذِي لَا إِلَه هُوَ الرَّحْمَنُ الرَّحِيمُ الْمَلِكُ الْقُدُّوسُ السَّلَامُ الْمُؤْمِنُ الْمُهَيْمِنُ الْعَزِيزُ الْجَبَّارُ الْمُتَكَبِّرُ الْخَالِقُ الْبَارِئُ الْمُصَوِّرُ الْغَفَّارُ الْقَهَّارُ الْوَهَّابُ الرَّزَّاقُ الْفَتَّاحُ الْعَلِيمُ الْقَابِضُ الْبَاسِطُ الْخَافِضُ الرَّافِعُ الْمُعِزُّ الْمُذِلُّ السَّمِيعُ الْبَصِيرُ الْحَكَمُ الْعَدْلُ اللَّطِيفُ الْخَبِيرُ الْحَلِيمُ الْعَظِيمُ الْغَفُورُ الشَّكورُ العَلِيُّ الكَبِيرُ الحَفيظُ المُقِيتُ الْحَسِيبُ الْجَلِيلُ الْكَرِيمُ الرَّقِيبُ الْمُجِيبُ الْوَاسِعُ الْحَكِيمُ الْوَدُودُ الْمَجِيدُ الْبَاعِثُ الشَّهِيدُ الْحَقُّ الْوَكِيلُ الْقَوِيُّ الْمَتِينُ الْوَلِيُّ الْحَمِيدُ الْمُحْصِي الْمُبْدِئُ الْمُعِيدُ الْمُحْيِي المُميتُ الحَيُّ القَيُّومُ الواجِدُ الماجِدُ الواحِدُ الأحَدُ الصَّمَدُ الْقَادِرُ الْمُقْتَدِرُ الْمُقَدِّمُ الْمُؤَخِّرُ الْأَوَّلُ الْآخِرُ الظَّاهِرُ الْبَاطِنُ الْوَالِي الْمُتَعَالِي الْبَرُّ التَّوَّابُ الْمُنْتَقِمُ العَفُوُّ الرَّؤوفُ مَالِكُ الْمُلْكِ ذُو الْجَلَالِ وَالْإِكْرَامِ الْمُقْسِطُ الْجَامِعُ الْغَنِيُّ الْمُغْنِي الْمَانِعُ الضَّارُّ النَّافِعُ النُّورُ الْهَادِي الْبَدِيعُ الْبَاقِي الْوَارِثُ الرَّشِيدُ الصَّبُورُ» . رَوَاهُ التِّرْمِذِيُّ والبيهقيُّ فِي الدَّعواتِ الْكَبِير. وَقَالَ التِّرْمِذِيّ: هَذَا حَدِيث غَرِيب","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “God Most High has ninety-nine names. He who retains them in his memory will enter paradise. He is God than whom there is no god, the Compassionate, the Merciful, the King, the Holy, the Source of Peace, the Preserver of security, the Protector, the Mighty, the Overpowering, the Great in Majesty, the Creator, the Maker, the Fashioner, the Forgiver, the Dominant, the Bestower, the Provider, the Decider, the Knower, the Withholder, the Plentiful Giver, the Abaser, the Exalter, the Honourer, the Humiliator, the Hearer, the Seer, the Judge, the Just, the Gracious, the Informed, the Clement, the Incomparably Great, the Forgiving, the Rewarder, the Most High, the Most Great, the Preserver, the Sustainer, the Reckoner, the Majestic, the Generous, the Watcher, the Answerer, the Liberal, the Wise, the Loving, the Glorious, the Raiser, the Witness, the Real, the Trustee, the Strong, the Firm, the Patron, the Praiseworthy, the All-Knowing, the Originator, the Restorer to life, the Giver of life, the Giver of death, the Living, the Eternal, the Self-sufficient, the Grand, the One, the Single, He to whom men repair, the Powerful, the Prevailing, the Advancer, the Delayer, the First, the Last, the Outward, the Inward, the Governor, the Sublime, the Amply Beneficent, the Accepter of Repentance, the Avenger, the Pardoner, the Kindly, the Ruler of the Kingdom, the Lord of Majesty and Splendour, the Equitable, the Gatherer, the Independent, the Enricher, the Depriver, the Harmer, the Benefiter, the Light, the Guide, the First Cause*, the Enduring, the Inheritor, the Director, the Patient.” \n*Or, 'the Incomparable' (al-badi').\n\nTirmidhi and Baihaqi, in  ad-Da'awat al-kabir, transmitted it, Tirmidhi saying this a gharib tradition."}},{"id":63,"idInBook":63,"chapterId":9,"bookId":14,"arabic":"وَعَن بُرَيْدَةَ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَمِعَ رَجُلًا يَقُولُ: اللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنَّكَ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ الْأَحَدُ الصَّمَدُ الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ فَقَالَ: «دَعَا اللَّهَ بِاسْمِهِ الْأَعْظَمِ الَّذِي إِذَا سُئِلَ بِهِ أَعْطَى وَإِذَا دُعِيَ بِهِ أَجَابَ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُد","english":{"narrator":"","text":"Buraida told that God’s messenger heard a man saying, “O God I ask Thee by virtue of Thy being God than whom there is no god, the One, He to whom men repair, who has not begotten and has not been begotten, and to whom no one is equal,” and said, “He has supplicated God using His greatest name, when asked by which He gives and when supplicated by which He answers.” \n\nTirmidhi and Abu Dawud transmitted it."}},{"id":64,"idInBook":64,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: كُنْتُ جَالِسًا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْمَسْجِدِ وَرَجُلٌ يُصَلِّي فَقَالَ: اللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنَّ لَكَ الْحَمْدَ لَا إِلَهَ إِلَّا أَنْتَ الْحَنَّانُ الْمَنَّانُ بَدِيعُ السَّمَاوَاتِ وَالْأَرْضِ يَا ذَا الْجَلَالِ وَالْإِكْرَامِ يَا حَيُّ يَا قَيُّومُ أَسْأَلُكَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «دَعَا اللَّهَ بِاسْمِهِ الْأَعْظَمِ الَّذِي إِذَا دُعِيَ بِهِ أَجَابَ وَإِذَا سُئِلَ بِهِ أَعْطَى» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالنَّسَائِيُّ وَابْنُ مَاجَهْ","english":{"narrator":"","text":"Anas said that when he was sitting with the Prophet in the mosque a man who was praying said, “O God, I ask Thee by virtue of the fact that praise is due to Thee than whom there is no god, who showest favour and beneficence, the Originator of the heavens and the earth, O Lord of Majesty and Splendour, O Living One; O Eternal One, I ask of Thee.” The Prophet then said, “He has supplicated God using His greatest name, when supplicated by which He answers and when asked by which He gives.” \n\nTirmidhi, Abu Dawud, Nasa’i and Ibn Majah transmitted it."}},{"id":65,"idInBook":65,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَسْمَاءَ بِنْتِ يَزِيدَ رَضِيَ اللَّهُ عَنْهَا أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \" اسْمُ اللَّهِ الْأَعْظَمُ فِي هَاتَيْنِ الْآيَتَيْنِ: (وَإِلَهُكُمْ إِلَهٌ وَاحِدٌ لَا إِلَهَ إِلَّا هُوَ الرَّحْمَنُ الرَّحيمُ)\nوفاتحة (آل عمرانَ)\n: (آلم اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ)\nرَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ وَالدَّارِمِيُّ","english":{"narrator":"","text":"Asma’ daughter of Yazid reported the Prophet as saying, “God’s greatest name is in these two verses, ‘And your God is one God; there is no god but He, the Compassionate, the Merciful’ ”  \n\nTirmidhi, Abu Dawud, Ibn Majah and Darimi transmitted it."}},{"id":66,"idInBook":66,"chapterId":9,"bookId":14,"arabic":"وَعَنْ سَعْدَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:\nدَعْوَةُ ذِي النُّونِ إِذا دَعَا رَبَّهُ وَهُوَ فِي بَطْنِ الْحُوتِ (لَا إِلَهَ إِلَّا أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظالمينَ)\nلَمْ يَدْعُ بِهَا رَجُلٌ مُسْلِمٌ فِي شَيْءٍ إلاَّ استجابَ لَهُ \". رَوَاهُ أَحْمد وَالتِّرْمِذِيّ","english":{"narrator":"Sa'd reported God’s messenger as saying that no Muslim will supplicate God for anything and fail to receive an answer when he uses Dhun Nun’s supplication when he was in the belly of the fish:","text":"“There is no god but Thee to whom be the glory. I was indeed a wrongdoer.” \n\nAhmad and Tirmidhi transmitted it."}},{"id":67,"idInBook":67,"chapterId":9,"bookId":14,"arabic":"عَنْ بُرَيْدَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: دَخَلْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَسْجِدَ عِشَاءً فَإِذَا رَجُلٌ يَقْرَأُ وَيَرْفَعُ صَوْتَهُ فَقُلْتُ: يَا رَسُولَ اللَّهِ أَتَقُولُ: هَذَا مُرَاءٍ؟ قَالَ: «بَلْ مُؤْمِنٌ مُنِيبٌ» قَالَ: وَأَبُو مُوسَى الْأَشْعَرِيُّ يَقْرَأُ وَيَرْفَعُ صَوْتَهُ فَجَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَسَمَّعُ لِقِرَاءَتِهِ ثُمَّ جَلَسَ أَبُو مُوسَى يَدْعُو فَقَالَ: اللَّهُمَّ إِنِّي أُشْهِدُكَ أَنَّكَ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ أَحَدًا صَمَدًا لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُنْ لَهُ كُفُوًا أُحُدٍ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَقَدْ سَأَلَ اللَّهَ بِاسْمِهِ الَّذِي إِذَا سُئِلَ بِهِ أَعْطَى وَإِذَا دُعِيَ بِهِ أَجَابَ» قُلْتُ: يَا رَسُولَ اللَّهِ أُخْبِرُهُ بِمَا سَمِعْتُ مِنْكَ؟ قَالَ: «نَعَمْ» فَأَخْبَرْتُهُ بِقَوْلِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لِي: أَنْتَ الْيَوْمَ لِي أَخٌ صَدِيقٌ حَدَّثْتَنِي بِحَدِيثِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ. رَوَاهُ رزين","english":{"narrator":"","text":"Buraida said that once when he entered the mosque with God’s messenger at the time of the evening prayer a man was reciting with a loud voice, so he asked God’s messenger whether he thought the man was hypocritical, but he replied’ “No, he is a penitent believer.” He said that Abu Musa al-Ash‘ari was * reciting in a loud voice, and God’s messenger began to listen to his recitation. Afterwards Abu Musa sat down and engaged in supplication saying, “O God, I call Thee to witness that Thou art God than whom there is no god, One, to whom men repair, who hast not begotten and hast not been begotten, and to whom no one is equal.” God’s messenger then said, “He has asked God using His name when asked by which He gives, and when supplicated by which He answers.” Buraida asked God’s messenger whether he should tell him what he had heard him say, and when he agreed he told him what God’s messenger had said, and Abu Musa said to him, “Today you are a true brother to me, having told me the words of God’s messenger.” \n*This word is not in the text, but Mirqat explains that it must be understood as Abu Musa as not the man referred to above.\n\nRazin transmitted it."}},{"id":68,"idInBook":68,"chapterId":9,"bookId":14,"arabic":"عَنْ سَمُرَةَ بْنِ جُنْدُبٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" أَفْضَلُ الْكَلَامِ أَرْبَعٌ: سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَلَا إِلَهَ إِلَّا اللَّهُ وَاللَّهُ أَكْبَرُ \"\nوَفِي رِوَايَةٍ: \" أَحَبُّ الْكَلَامِ إِلَى اللَّهِ أَرْبَعٌ: سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَلَا إِلَهَ إِلَّا اللَّهُ وَاللَّهُ أَكْبَرُ لَا يَضُرُّكَ بِأَيِّهِنَّ بَدَأْتَ \". رَوَاهُ مُسلم","english":{"narrator":"Samura b. Jundub reported God's messenger as saying, \"The most excellent words are four:","text":"Glory be to God; Praise be to God; there is no god but God; and God is most great.\" A version has, \"The words dearest to God are four: Glory be to God; Praise be to God; there is no god but God; and God is most great. It does not matter which you say first.\" \n\nMuslim transmitted it."}},{"id":69,"idInBook":69,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" لَأَنْ أَقُولَ: سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَلَا إِلَهَ إِلَّا اللَّهُ وَاللَّهُ أَكْبَرُ أَحَبُّ إِلَيَّ مِمَّا طَلَعَتْ عَلَيْهِ الشَّمْس \". رَوَاهُ مُسلم","english":{"narrator":"Abu Huraira reported God’s messenger as saying, \"To say:","text":"Glory be to God; Praise be to God; there is no god but God; and God is most great, is dearer to me than everything on which the sun rises.\" \n\nMuslim transmitted it."}},{"id":70,"idInBook":70,"chapterId":9,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" مَنْ قَالَ: سُبْحَانَ اللَّهِ وَبِحَمْدِهِ فِي يَوْمٍ مِائَةَ مَرَّةٍ حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ \"","english":{"narrator":"","text":"He reported God’s messenger as saying that if anyone says a hundred times in a day, \"Glory be to God, and I begin with praise to Him\", his sins will be removed from him though they are like the foam of the sea. \n\n(Bukhari and Muslim.)"}},{"id":71,"idInBook":71,"chapterId":9,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" مَنْ قَالَ حِينَ يُصْبِحُ وَحِينَ يُمْسِي: سُبْحَانَ اللَّهِ وَبِحَمْدِهِ مِائَةَ مَرَّةٍ لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ)","english":{"narrator":"","text":"He reported God’s messenger as saying that if anyone says a hundred times morning and evening, \"Glory be to God, and I begin with praise of Him\", only one who said what he said, or more than it, will bring anything more excellent than he on the day of resurrection.\n\n(Bukhari and Muslim.)"}},{"id":72,"idInBook":72,"chapterId":9,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" كَلِمَتَانِ خَفِيفَتَانِ عَلَى اللِّسَانِ ثَقِيلَتَانِ فِي الْمِيزَانِ حَبِيبَتَانِ إِلَى الرَّحْمَنِ: سُبْحَانَهُ الله وَبِحَمْدِهِ سُبْحَانَهُ الله الْعَظِيم \"","english":{"narrator":"He reported God’s messenger as saying, \"Two expressions which are light on the tongue but heavy in the scale are dear to the Compassionate One:","text":"Glory be to God, and I begin with praise of Him; and Glory be to God the Incomparably Great.\" \n\n(Bukhari and Muslim.)"}},{"id":73,"idInBook":73,"chapterId":9,"bookId":14,"arabic":"وَعَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ: قَالَ: كُنَّا عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «أَيَعْجِزُ أَحَدُكُمْ أَنْ يَكْسِبَ كُلَّ يَوْمٍ أَلْفَ حَسَنَةٍ؟» فَسَأَلَهُ سَائِلٌ مِنْ جُلَسَائِهِ: كَيْفَ يَكْسِبُ أَحَدُنَا أَلْفَ حَسَنَةٍ؟ قَالَ: «يُسَبِّحُ مِائَةَ تَسْبِيحَةٍ فَيُكْتَبُ لَهُ أَلْفُ حَسَنَةٍ أَوْ يُحَطُّ عَنهُ ألفُ خطيئةٍ» . رَوَاهُ مُسلم\nوَفِي كِتَابه: فِي جَمِيعِ الرِّوَايَاتِ عَنْ مُوسَى الْجُهَنِيِّ: «أَوْ يُحَطُّ» قَالَ أَبُو بكر البرقاني وَرَوَاهُ شُعْبَةُ وَأَبُو عَوَانَةَ وَيَحْيَى بْنُ سَعِيدٍ الْقطَّان عَن مُوسَى فَقَالُوا: «ويحُطُّ» بِغَيْر ألف هَكَذَا فِي كتاب الْحميدِي","english":{"narrator":"Sa'd b. Abu Waqqas said:","text":"Once when we were with God’s messenger he asked whether any of us was incapable of acquiring a thousand blessings daily, and when one of those who were sitting with him asked how any of them could acquire a thousand blessings he replied, “If he says ‘Glory be to God' a hundred times, a thousand blessings will be recorded for him or a thousand sins will be removed from him.”\n\nMuslim transmitted it. In his book, in all the versions on the authority of Musa al-Juhani, “or . . . will be removed” is given, but Abu Bakr al-Burqani said that Shu'ba, Abu ‘Awana and Yahya b. Sa'id al-Qattan quoted Musa’s authority, saying “ and . . . will be removed.” Thus it is stated in al-Humaidi’s book."}},{"id":74,"idInBook":74,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي ذَرٍّ قَالَ: سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّ الْكَلَامِ أَفْضَلُ؟ قَالَ: \n\" مَا اصْطَفَى اللَّهُ لِمَلَائِكَتِهِ: سُبْحَانَ اللَّهِ وَبِحَمْدِهِ \". رَوَاهُ مُسلم","english":{"narrator":"Abu Dharr said that God’s messenger was asked what words were most excellent and replied, “What God has chosen for His angles:","text":"Glory be to God and I begin with praise of Him.” \n\nMuslim transmitted it."}},{"id":75,"idInBook":75,"chapterId":9,"bookId":14,"arabic":"وَعَن جوَيْرِية أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ مِنْ عِنْدِهَا بُكْرَةً حِينَ صَلَّى الصُّبْحَ وَهِيَ فِي مَسْجِدِهَا ثُمَّ رَجَعَ بَعْدَ أَنْ أَضْحَى وَهِيَ جَالِسَةٌ قَالَ: «مَا زِلْتِ عَلَى الْحَالِ الَّتِي فَارَقْتُكِ عَلَيْهَا؟» قَالَتْ: نَعَمْ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" لَقَدْ قُلْتُ بَعْدَكِ أَرْبَعَ كَلِمَاتٍ ثَلَاثَ مَرَّاتٍ لَوْ وُزِنَتْ بِمَا قُلْتِ مُنْذُ الْيَوْمِ لَوَزَنَتْهُنَّ: سُبْحَانَ اللَّهِ وَبِحَمْدِهِ عَدَدَ خَلْقِهِ وَرِضَاءَ نَفْسِهِ وَزِنَةَ عَرْشِهِ وَمِدَادَ كَلِمَاته \". رَوَاهُ مُسلم","english":{"narrator":"Juwairiya said that the Prophet went out from her one morning at the time when he prayed the morning prayer while she was in her place of worship. He returned in the forenoon and found her sitting. He asked her if she was still in the same position as that in which he had left her, and when she replied that that was so, he said, \"Since leaving you I have three times said four phrases which, if weighed against all you have said today, would prove to be heavier:","text":"Glory be to God, and I begin with praise of Him to the number of His creatures, in accordance with His good pleasure, to the weight of His throne and the extent of His words.\" \n\nMuslim transmitted it."}},{"id":76,"idInBook":76,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عَلَيْهِ وَسلم: \n\" من قَالَ: لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ فِي يَوْمٍ مِائَةَ مَرَّةٍ كَانَتْ لَهُ عَدْلَ عَشْرِ رِقَابٍ وَكُتِبَتْ لَهُ مِائَةُ حَسَنَةٍ وَمُحِيَتْ عَنْهُ مِائَةُ سَيِّئَةٍ وَكَانَتْ لَهُ حِرْزًا مِنَ الشَّيْطَانِ يَوْمَهُ ذَلِكَ حَتَّى يُمْسِيَ وَلَمْ يَأْتِ أَحَدٌ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا رَجُلٌ عَمِلَ أَكْثَرَ مِنْهُ \"","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying that if anyone says a hundred times in a day, “There is no god but God alone who has no partner, to whom dominion belongs, to whom praise is due, who is omnipotent”, he will have a reward equivalent to that for emancipating ten slaves, a hundred blessings recorded for him, a hundred evil deeds obliterated from him; it will be a protection for him from the devil all that day till evening, and no one will bring anything more excellent than he brings, except a man who has done more than he has. \n\n(Bukhari and Muslim.)"}},{"id":77,"idInBook":77,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي مُوسَى الْأَشْعَرِيِّ قَالَ: كُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ فَجَعَلَ النَّاسُ يَجْهَرُونَ بِالتَّكْبِيرِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَا أَيُّهَا النَّاسُ ارْبَعُوا عَلَى أَنْفُسِكُمْ إِنَّكُمْ لَا تَدْعُونَ أَصَمَّ وَلَا غَائِبًا إِنَّكُمْ تَدْعُونَ سَمِيعًا بَصِيرًا وَهُوَ مَعَكُمْ وَالَّذِي تَدْعُونَهُ أَقْرَبُ إِلَى أَحَدِكُمْ مِنْ عُنُقِ رَاحِلَتِهِ» قَالَ أَبُو مُوسَى: وَأَنَا خَلْفَهُ أَقُولُ: لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ فِي نَفْسِي فَقَالَ: «يَا عَبْدَ اللَّهِ بْنَ قَيْسٍ أَلَا أَدُلُّكَ عَلَى كَنْزٍ مِنْ كُنُوزِ الْجَنَّةِ؟» فَقُلْتُ: بَلَى يَا رَسُولَ اللَّهِ قَالَ: «لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ»","english":{"narrator":"Abu Musa al-Ash‘ari said:","text":"Once when we accompanied God’s messenger on a journey and the people began to say aloud, “God is most great”, he said, “Restrain yourselves, people; you are not supplicating one who is deaf or absent, but are supplicating One who hears, sees and is with you. He whom you are supplicating is nearer to each of you than the neck of his riding-beast.” Abu Musa said: I was behind him saying within myself, “There is no might and no power except in God,” and he said, “‘Abdallah b. Qais,* would you like me to guide you to one of the treasures of paradise?” On my replying that I certainly would, he said that it was, “There is no might and no power except in God.”\n*This is Abu Musa’s name and his father's name. He is most commonly known by his kunya.\nand nisba as given at the beginning of the tradition.\n\n(Bukhari and Muslim.)"}},{"id":78,"idInBook":78,"chapterId":9,"bookId":14,"arabic":"عَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ قَالَ سُبْحَانَ اللَّهِ الْعَظِيمِ وَبِحَمْدِهِ غُرِسَتْ لَهُ نَخْلَةٌ فِي الْجَنَّةِ» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Jabir reported God’s messenger as saying that if anyone says “Glory be to God the Incomparably Great, and I begin with praise of Him,” a palm tree will be planted for him in paradise. \n\nTirmidhi transmitted it."}},{"id":79,"idInBook":79,"chapterId":9,"bookId":14,"arabic":"وَعَنِ الزُّبَيْرِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا مِنْ صَبَاحٍ يُصْبِحُ الْعِبَادُ فِيهِ إِلَّا مُنَادٍ يُنَادِي سَبِّحُوا الْمَلِكَ القدوس» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Az-Zubair reported God’s messenger as saying that no morning comes to mankind without a crier calling, “Glorify the Kind, the Holy.”\n\nTirmidhi transmitted it."}},{"id":80,"idInBook":80,"chapterId":9,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" أَفْضَلُ الذِّكْرِ: لَا إِلَهَ إِلَّا اللَّهُ وَأَفْضَلُ الدُّعَاءِ: الْحَمْدُ لِلَّهِ \". رَوَاهُ التِّرْمِذِيّ وَابْن مَاجَه","english":{"narrator":"","text":"Jabir reported God’s messenger as saying that the most excellent way to make mention of God is to say, “There is no god but God” and that the most excellent supplication is “Praise be to God.” \n\nTirmidhi and Ibn Majah transmitted it."}},{"id":81,"idInBook":81,"chapterId":9,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْحَمْدُ رَأْسُ الشُّكْرِ مَا شَكَرَ اللَّهَ عَبْدٌ لَا يحمده»","english":{"narrator":"","text":"‘Abdallah b. ‘Amr reported God's messenger as saying that “Praise be to God” is the beginning of thanksgiving, for the man who does not praise God has not thanked Him."}},{"id":82,"idInBook":82,"chapterId":9,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَوَّلُ مَنْ يُدْعَى إِلَى الْجَنَّةِ يَوْمَ الْقِيَامَةِ الَّذِينَ يَحْمَدُونَ اللَّهَ فِي السَّرَّاءِ وَالضَّرَّاءِ» . رَوَاهُمَا الْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَان","english":{"narrator":"","text":"Ibn ‘Abbas reported God’s messenger as saying, “The first to be summoned to paradise on the day of resurrection will be those who praise God in prosperity and adversity.” \n\nBaihaqi transmitted the two traditions in Shu'ab al-iman."}},{"id":83,"idInBook":83,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" قَالَ مُوسَى عَلَيْهِ السَّلَامُ: يَا رَبِّ عَلِّمْنِي شَيْئًا أَذْكُرُكَ بِهِ وَأَدْعُوكَ بِهِ فَقَالَ: يَا مُوسَى قُلْ: لَا إِلَهَ إِلَّا اللَّهُ فَقَالَ: يَا رَبِّ كلُّ عبادكَ يقولُ هَذَا إِنَّما أيد شَيْئًا تَخُصُّنِي بِهِ قَالَ: يَا مُوسَى لَوْ أَنَّ السَّمَاوَاتِ السَّبْعَ وَعَامِرَهُنَّ غَيْرِي وَالْأَرَضِينَ السَّبْعَ وُضِعْنَ فِي كِفَّةٍ وَلَا إِلَهَ إِلَّا اللَّهُ فِي كِفَّةٍ لَمَالَتْ بِهِنَّ لَا إِلَهَ إِلَّا اللَّهُ \". رَوَاهُ فِي شرح السّنة","english":{"narrator":"","text":"Abu Sa'id al-Khudri reported God’s messenger as saying that Moses asked his Lord to teach him something with which to make mention of Him or to supplicate Him, and was told to say, “There is no god but God.” He replied to his Lord that all His servants said this, but he wanted something particularly for himself, and He said, “Moses, were the seven heavens and their inhabitants apart from me and the seven earths put in one side of a balance and ‘There is no god but God’ in the other, ‘There is no god but God’ would outweigh them.” \n\nIt is transmitted in Shar as-sunna."}},{"id":84,"idInBook":84,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ وَأَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُمَا قَالَا: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" مَنْ قَالَ: لَا إِلَهَ إِلَّا اللَّهُ وَاللَّهُ أَكْبَرُ صَدَّقَهُ رَبُّهُ قَالَ: لَا إِلَهَ إِلَّا أَنَا وَأَنَا أَكْبَرُ وَإِذَا قَالَ: لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ يَقُولُ اللَّهُ: لَا إِلَهَ إِلَّا أَنَا وَحْدِي لَا شَرِيكَ لِي وَإِذَا قَالَ: لَا إِلَهَ إِلَّا اللَّهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ قَالَ: لَا إِلَهَ إِلَّا أَنَا لِيَ الْمُلْكُ وَلِيَ الْحَمْدُ وَإِذَا قَالَ: لَا إِلَهَ إِلَّا الله وَلَا وحول وَلَا قُوَّةَ إِلَّا بِاللَّهِ قَالَ: لَا إِلَهَ إِلَّا أَنَا لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِي \" وَكَانَ يَقُولُ: «مَنْ قَالَهَا فِي مَرَضِهِ ثُمَّ مَاتَ لَمْ تَطْعَمْهُ النَّارُ» . رَوَاهُ التِّرْمِذِيُّ وَابْن مَاجَه","english":{"narrator":"","text":"Abu Sa'id and Abu Huraira reported God’s messenger as saying that if anyone says “There is no god but God and God is most great”, his Lord will declare that he has spoken the truth, saying, “There is no god but me, and I am most great.” When he says, “There is no god but God alone who has no partner,” God says, “There is no god but me alone who has no partner.” When he says, “There is no god but God to whom belongs the dominion and to whom praise is due,” He says, “There is no god but me to whom belongs the dominion and to whom praise is due.” When he says, “There is no god but God, and there is no might and no power except in God,” He says, “There is no god but me, and there is no might and no power except in me.” He used to say that if anyone said these words in his last illness, hell would not devour him. \n\nTirmidhi and Ibn Majah transmitted it."}},{"id":85,"idInBook":85,"chapterId":9,"bookId":14,"arabic":"وَعَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ أَنَّهُ دَخَلَ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى امْرَأَةٍ وَبَيْنَ يَدَيْهَا نَوًى أَوْ حَصًى تُسَبِّحُ بِهِ فَقَالَ: «أَلَا أُخْبِرُكَ بِمَا هُوَ أَيْسَرُ عليكِ مِنْ هَذَا أَوْ أَفْضَلُ؟ سُبْحَانَ اللَّهِ عَدَدَ مَا خَلَقَ فِي السَّمَاءِ وَسُبْحَانَ اللَّهِ عَدَدَ مَا خَلَقَ فِي الْأَرْضِ وَسُبْحَانَ اللَّهِ عَدَدَ مَا بَيْنَ ذَلِكَ وَسُبْحَانَ اللَّهِ عَدَدَ مَا هُوَ خَالِقٌ وَاللَّهُ أَكْبَرُ مِثْلَ ذَلِكَ وَالْحَمْدُ لِلَّهِ مِثْلَ ذَلِكَ وَلَا إِلَهَ إِلَّا اللَّهُ مِثْلَ ذَلِكَ وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ مِثْلَ ذَلِكَ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيث غَرِيب","english":{"narrator":"","text":"Sa‘d b. Abu Waqqas said that along with the Prophet he once visited a woman in front of whom were some date-stones or pebbles which she was using as a rosary to glorify God. The Prophet suggested that he would tell her something which would be easier (or more excellent)* for her than that, and told her it consisted of saying, “Glory be to God as many times as the number of what He has created in the heaven; Glory be to God as many times as the number of what He has created in the earth; Glory be to God as many times as the number of what is between them; Glory be to God as many times as the number of what He is creating; God is most great (a similar number of times); Praise be to God (a similar number of times); There is no god but God (a similar number of times); There is no might and no power except in God (a similar number of times).” \n*The transmitter was not sure whether \"easier\" or \"more excellent\" was used.\n\nTirmidhi and Abu Dawud transmitted it, Tirmidhi saying this is a gharib tradition."}},{"id":86,"idInBook":86,"chapterId":9,"bookId":14,"arabic":"وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" مَنْ سَبَّحَ اللَّهَ مِائَةً بِالْغَدَاةِ وَمِائَةً بِالْعَشِيِّ كَانَ كَمَنْ حَجَّ مِائَةَ حَجَّةٍ وَمَنْ حَمِدَ اللَّهَ مِائَةً بِالْغَدَاةِ وَمِائَةً بِالْعَشِيِّ كَانَ كَمَنْ حَمَلَ عَلَى مِائَةِ فَرَسٍ فِي سَبِيلِ اللَّهِ وَمَنْ هَلَّلَ اللَّهَ مِائَةً بِالْغَدَاةِ وَمِائَةً بِالْعَشِيِّ كَانَ كَمَنْ أَعْتَقَ مِائَةَ رَقَبَةٍ مِنْ وَلَدِ إِسْمَاعِيلَ وَمَنْ كَبَّرَ اللَّهَ مِائَةً بِالْغَدَاةِ وَمِائَةً بِالْعَشِيِّ لَمْ يَأْتِ فِي ذَلِكَ الْيَوْمِ أَحَدٌ بِأَكْثَرِ مِمَّا أَتَى بِهِ إِلَّا مَنْ قَالَ مِثْلَ ذَلِكَ أَوْ زَادَ عَلَى مَا قَالَ. رَوَاهُ التِّرْمِذِيُّ. وَقَالَ: هَذَا حَدِيثٌ غَرِيب","english":{"narrator":"","text":"‘Amr b. Shu'aib, on his father’s authority, said that his grandfather reported God's messenger as saying, “If anyone glorifies God a hundred times in the morning and a hundred times in the evening, he will be like one who makes the Pilgrimage a hundred times; if anyone praises God a hundred times in the morning and a hundred times in the evening, he will be like one who provides a hundred horses, as mounts in God’s path; if anyone declares that God is the only God a hundred times in the morning and a hundred times in the evening, he will be like one who frees a hundred of the descendants of Ishmael who are slaves; if anyone declares God’s greatness a hundred times in the morning and a hundred times in the evening, no one will bring more than he does that day, except one who says the same as he did or more.” \n\nTirmidhi transmitted it, saying this is a hasan gharib tradition."}},{"id":87,"idInBook":87,"chapterId":9,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «التَّسْبِيحُ نِصْفُ الْمِيزَانِ وَالْحَمْدُ لِلَّهِ يَمْلَؤُهُ وَلَا إِلَهَ إِلَّا اللَّهُ لَيْسَ لَهَا حِجَابٌ دُونَ اللَّهِ حَتَّى تَخْلُصَ إِلَيْهِ» . رَوَاهُ التِّرْمِذِيُّ. وَقَالَ: هَذَا حَدِيثٌ غَرِيبٌ وَلَيْسَ إِسْنَاده بِالْقَوِيّ","english":{"narrator":"","text":"‘Abdallah b. ‘Amr reported God’s messenger as saying that “Glory be to God” fills half the scale, “Praise be to God” fills it, and “There is no god but God” has no veil between it and God till it reaches Him.\n\nTirmidhi transmitted it, saying this is a gharib tradition whose isnad is not strong."}},{"id":88,"idInBook":88,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا قَالَ عَبْدٌ لَا إِلَهَ إِلَّا اللَّهُ مُخْلِصًا قَطُّ إِلَّا فُتِحَتْ لَهُ أَبْوَابُ السَّمَاءِ حَتَّى يُفْضِيَ إِلَى الْعَرْشِ مَا اجْتَنَبَ الْكَبَائِرَ» . رَوَاهُ التِّرْمِذِيُّ. وَقَالَ: هَذَا حَدِيث غَرِيب","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying that no one will ever say sincerely, “There is no god but God” without the gates of heaven being opened for it so that it may come to the Throne, as long as he avoids major sins. \n\nTirmidhi transmitted it, saying this is a gharib tradition."}},{"id":89,"idInBook":89,"chapterId":9,"bookId":14,"arabic":"وَعَنِ ابْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" لَقِيتُ إِبْرَاهِيمَ لَيْلَةَ أُسَرِيَ بِي فَقَالَ: يَا مُحَمَّدُ أَقْرِئْ أُمَّتَكَ مِنِّي السَّلَامَ وَأَخْبِرْهُمْ أَنَّ الْجَنَّةَ طَيِّبَةُ التُّرْبَةِ عَذْبَةُ الْمَاءِ وَأَنَّهَا قِيعَانٌ وَأَنَّ غِرَاسَهَا سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَلَا إِلَهَ إِلَّا اللَّهُ وَاللَّهُ أَكْبَرُ \". رَوَاهُ التِّرْمِذِيُّ. وَقَالَ: هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ إِسْنَادًا","english":{"narrator":"","text":"Ibn Mas'ud reported God's messenger as saying he met Abraham on the night he was taken up to heaven, and he said, “Convey my greeting to your people, Muhammad, and tell them that paradise has good soil and sweet water, that it consists of level, treeless plains, and that its plants are ‘Glory be to God’; ‘Praise be to God’; ‘There is no god but God’; and ‘God is most great’.” \n\nTirmidhi transmitted it, saying this is a hasan tradition whose isnad is gharib."}},{"id":90,"idInBook":90,"chapterId":9,"bookId":14,"arabic":"وَعَنْ يُسَيْرَةَ رَضِيَ اللَّهُ عَنْهَا وَكَانَتْ مِنَ الْمُهَاجِرَاتِ قَالَتْ: قَالَ لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «عَلَيْكُنَّ بِالتَّسْبِيحِ وَالتَّهْلِيلِ وَالتَّقْدِيسِ واعقِدْنَ بالأناملِ فإِنهنَّ مسؤولات مُسْتَنْطَقَاتٌ وَلَا تَغْفُلْنَ فَتَنْسَيْنَ الرَّحْمَةَ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُد","english":{"narrator":"","text":"Busaira, who was one of the women emigrants, told of God’s messenger saying to them, “Apply yourselves to glorifying God, saying there is no god but He, and declaring His holiness; and count them on your fingers, for they  will be questioned and asked to speak; and do not be negligent and so be deprived of mercy.” \n\nTirmidhi and Abu Dawud transmitted it."}},{"id":91,"idInBook":91,"chapterId":9,"bookId":14,"arabic":"عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ قَالَ: جَاءَ أَعْرَابِيٌّ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: عَلِّمْنِي كَلَامًا أَقُولُهُ قَالَ: «قُلْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ اللَّهُ أَكْبَرُ كَبِيرًا وَالْحَمْدُ لِلَّهِ كَثِيرًا وَسُبْحَانَ اللَّهِ رَبِّ الْعَالَمِينَ لَا حَوْلَ وَلَا قُوَّةَ إِلَى بِاللَّهِ الْعَزِيزِ الْحَكِيمِ» . فَقَالَ فَهَؤُلَاءِ لِرَبِّي فَمَا لِي؟ فَقَالَ: «قُلِ اللَّهُمَّ اغْفِرْ لِي وَارْحَمْنِي وَاهْدِنِي وَارْزُقْنِي وَعَافِنِي» . شَكَّ الرَّاوِي فِي «عَافِنِي» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Sa‘d b. Abu Waqqas said that a nomadic Arab come to God's messenger and asked him to teach him some words to say. He told him to say, “There is no god but God alone who has no partner; God is very great; Abundant praise is due to God; Glory be to God, the Lord of the universe; There is no might and no power except in God, the Mighty, the Wise.” On his remarking that these were for his Lord but he wanted to know what he should say for himself, he told him to say, “O God, forgive me, show mercy to me, guide me, provide for me, and grant me security.” The transmitter was doubtful about “grant me security.” \n\nMuslim transmitted it."}},{"id":92,"idInBook":92,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَنَسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ عَلَى شَجَرَةٍ يَابِسَةِ الْوَرَقِ فَضَرَبَهَا بِعَصَاهُ فَتَنَاثَرَ الْوَرَقُ فَقَالَ: «إِنَّ الْحَمْدُ لِلَّهِ وَسُبْحَانَ اللَّهِ وَلَا إِلَهَ إِلَّا اللَّهُ وَاللَّهُ أَكْبَرُ تُساقطُ ذُنوبَ العَبدِ كَمَا يتَساقطُ وَرَقُ هَذِهِ الشَّجَرَةِ» . رَوَاهُ التِّرْمِذِيُّ. وَقَالَ: هَذَا حديثٌ غَرِيب","english":{"narrator":"","text":"Anas said that, on coming upon a tree whose leaves were withered, God's messenger struck it with his staff, and the leaves were scattered. He then said that “Praise be to God; Glory be to God; There is no god but God; and God is most great” cause a man's sins to fall away just as the leaves of that tree were falling. \n\nTirmidhi transmitted it, saying this is a gharib tradition."}},{"id":93,"idInBook":93,"chapterId":9,"bookId":14,"arabic":"وَعَن مَكحولِ عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" أَكْثِرْ مِنْ قَوْلِ: لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ فَإِنَّهَا مِنْ كَنْزِ الْجَنَّةِ \". قَالَ مَكْحُولٌ: فَمَنْ قَالَ: لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ وَلَا مَنْجًى مِنَ اللَّهِ إِلَّا إِلَيْهِ كَشَفَ اللَّهُ عَنْهُ سَبْعِينَ بَابًا مِنَ الضُّرِّ أَدْنَاهَا الْفَقْرُ. رَوَاهُ التِّرْمِذِيُّ. وَقَالَ: هَذَا حَدِيثٌ لَيْسَ إِسْنَادُهُ بِمُتَّصِلٍ وَمَكْحُولٌ لَمْ يَسْمَعْ عَنْ أَبِي هُرَيْرَةَ","english":{"narrator":"","text":"Makhul quoted Abu Huraira as saying that God's messenger told him to say frequently “There is no might and no power except in God”, for it is part of the treasure of paradise. Makhul said that if anyone says, “There is no might and no power except in God” and “There is no refuge from God except by repairing to Him”, God will remove from him seventy categories of distress, the least of them being poverty.\n\nTirmidhi transmitted it, saying this is a tradition whose isnad is not fully connected, and Makhul did not hear anything from Abu Huraira."}},{"id":94,"idInBook":94,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ دَوَاءٌ مِنْ تِسْعَةٍ وَتِسْعِينَ دَاء أيسرها الْهم»","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying that “There is no might and no power except in God” is a remedy for ninety-nine diseases, the lightest of which is anxiety."}},{"id":95,"idInBook":95,"chapterId":9,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" أَلَا أَدُلُّكَ عَلَى كَلِمَةٍ مِنْ تَحْتِ الْعَرْشِ مِنْ كَنْزِ الْجَنَّةِ لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ يَقُولُ اللَّهُ تَعَالَى: أَسلَمَ عَبدِي واستسلم \". رَوَاهُمَا الْبَيْهَقِيّ فِي الدَّعْوَات الْكَبِير","english":{"narrator":"","text":"He said that God’s messenger offered to guide him to a word from under the Throne which was part of the treasure of paradise, it being “There is no might and no power except in God.” He added that God most high says, \"My servant has resigned and submitted himself to me.\"\n\nBaihaqi transmitted the two traditions in  ad-Da’awat al-kabir."}},{"id":96,"idInBook":96,"chapterId":9,"bookId":14,"arabic":"وَعَن ابْن عمر أَنَّهُ قَالَ: سُبْحَانَ اللَّهِ هِيَ صَلَاةُ الْخَلَائِقِ وَالْحَمْدُ لِلَّهِ كَلِمَةُ الشُّكْرِ وَلَا إِلَهَ إِلَّا اللَّهُ كَلِمَةُ الْإِخْلَاصِ وَاللَّهُ أَكْبَرُ تَمْلَأُ مَا بَيْنَ السَّمَاءِ وَالْأَرْضِ وَإِذَا قَالَ الْعَبْدُ: لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ قَالَ اللَّهُ تَعَالَى: أسلم عَبدِي واستَسلَم. رَوَاهُ رزين","english":{"narrator":"Ibn ‘Umar said:","text":"\"Glory be to God\" is the prayer of the creatures; \"Praise be to God\" is the word of thanksgiving; \"There is no god but God\" is the sentence which declares belief in God’s unity; and \"God is most great\" fills the space between heaven and earth. When a servant says, \"There is no might and no power except in God\", God says, \"He has resigned and submitted himself to me.\" \n\nRazin transmitted it."}},{"id":97,"idInBook":97,"chapterId":9,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «وَاللَّهِ إِنِّي لِأَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ فِي الْيَوْمِ أَكْثَرَ مِنْ سبعينَ مرَّةً» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “I swear by God that I ask God’s pardon and turn to him in repentance more than seventy times a day.” \n\nBukhari transmitted it."}},{"id":98,"idInBook":98,"chapterId":9,"bookId":14,"arabic":"وَعَنِ الْأَغَرِّ الْمُزَنِيِّ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّهُ لَيُغَانُ عَلَى قَلْبِي وَإِنِّي لَأَسْتَغْفِرُ اللَّهَ فِي الْيَوْم مائَة مرّة» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Al-Agharr al-Muzani reported God’s messenger as saying, “My heart is invaded by unmindfulness, and I ask God’s pardon a hundred times in the day.” \n\nMuslim transmitted it."}},{"id":99,"idInBook":99,"chapterId":9,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَا أَيُّهَا النَّاسُ تُوبُوا إِلَى اللَّهِ فَإِنِّي أَتُوبُ إِلَيْهِ فِي الْيَوْمِ مائةَ مرِّةٍ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"He reported God’s messenger as saying, “Turn, you people, in repentance to God, for I turn in repentance to Him a hundred times a day.” \n\nMuslim transmitted it."}},{"id":100,"idInBook":100,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي ذَرٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيمَا يَرْوِي عَنِ اللَّهِ تَبَارَكَ وَتَعَالَى أَنَّهُ قَالَ: «يَا عِبَادِي إِنِّي حَرَّمْتُ الظُّلْمَ عَلَى نَفْسِي وَجَعَلْتُهُ بَيْنَكُمْ مُحَرَّمًا فَلَا تَظَالَمُوا يَا عِبَادِي كُلُّكُمْ ضَالٌّ إِلَّا مَنْ هَدَيْتُهُ فَاسْتَهْدُونِي أَهْدِكُمْ يَا عِبَادِي كُلُّكُمْ جَائِعٌ إِلَّا مَنْ أَطْعَمْتُهُ فَاسْتَطْعِمُونِي أُطْعِمْكُمْ يَا عِبَادِي كُلُّكُمْ عَارٍ إِلَّا مَنْ كَسَوْتُهُ فَاسْتَكْسُونِي أَكْسُكُمْ يَا عِبَادِي إِنَّكُمْ تُخْطِئُونَ بِاللَّيْلِ وَالنَّهَارِ وَأَنَا أَغْفِرُ الذُّنُوبَ جَمِيعًا فَاسْتَغْفِرُونِي أَغْفِرْ لَكُمْ يَا عِبَادِي إِنَّكُمْ لَنْ تَبْلُغُوا ضَرِّي فَتَضُرُّونِي وَلَنْ تَبْلُغُوا نَفْعِي فَتَنْفَعُونِي يَا عِبَادِي لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ وإنسكم وجنكم كَانُوا أَتْقَى قَلْبِ رَجُلٍ وَاحِدٍ مِنْكُمْ مَا زَادَ ذَلِكَ فِي مُلْكِي شَيْئًا يَا عِبَادِي لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَإِنْسَكُمْ وَجِنَّكُمْ كَانُوا عَلَى أفجر قلب وَاحِد مِنْكُم مَا نقص مِنْ مُلْكِي شَيْئًا يَا عِبَادِي لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَإِنْسَكُمْ وَجِنَّكُمْ قَامُوا فِي صَعِيدٍ وَاحِدٍ فَسَأَلُونِي فَأَعْطَيْتُ كُلَّ إِنْسَانٍ مَسْأَلَتَهُ مَا نَقَصَ ذَلِكَ مِمَّا عِنْدِي إِلَّا كَمَا يَنْقُصُ الْمِخْيَطُ إِذَا أُدْخِلَ الْبَحْرَ يَا عِبَادِي إِنَّمَا هِيَ أَعمالكُم أحصها عَلَيْكُمْ ثُمَّ أُوَفِّيكُمْ إِيَّاهَا فَمَنْ وَجَدَ خَيْرًا فَلْيَحْمَدِ اللَّهَ وَمِنْ وَجَدَ غَيْرَ ذَلِكَ فَلَا يَلُومن إِلَّا نَفسه» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Dharr quoted God’s messenger as saying among the things he transmitted from God who is blessed and exalted that He has said, “My servants, I have made oppression unlawful for myself and I have made it unlawful among you, so do not oppress one another. My servants, you are all straying except those whom I guide, but if you ask for my guidance I will guide you. My servants, you are all hungry except those whom I feed, but if you ask me for food I will feed you. My servants, you are all naked except those whom I have clothed, but if you ask me for clothing I will clothe you. My servants, you are all sinning night and day, but I forgive all sins, so if you ask me forgiveness I will forgive you. My servants, you will not be able to injure me and succeed in such a purpose, neither will you be able to benefit me and succeed in such a purpose. My servants, even if the first and last of you, men and jinn, were as pious as the one with the most pious heart among you, that would not cause any increase in my dominion. My servants, if the first and last of you, men and jinn, were as wicked as the man with the most wicked heart among you, that would not cause any diminution in my dominion. My servants, if the first and last of you, men and jinn, were to stand in one plain and make request of me and I were to give every man what he asked, that would make no more diminution of what I possess than a needle would when put into the sea. My servants, they are only your deeds which I put to your account and then pay you in full for them; so let him who experiences good praise God, and let him whose experience is different blame no one but himself.” \n\nMuslim transmitted it."}},{"id":101,"idInBook":101,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" كَانَ فِي بَنِي إِسْرَائِيلَ رَجُلٌ قَتَلَ تِسْعَةً وَتِسْعِينَ إِنْسَانًا ثُمَّ خَرَجَ يَسْأَلُ فَأَتَى رَاهِبًا فَسَأَلَهُ فَقَالَ: أَلَهَ تَوْبَةٌ قَالَ: لَا فَقَتَلَهُ وَجَعَلَ يَسْأَلُ فَقَالَ لَهُ رَجُلٌ ائْتِ قَرْيَةَ كَذَا وَكَذَا فَأَدْرَكَهُ الْمَوْتُ فَنَاءَ بِصَدْرِهِ نَحْوَهَا فَاخْتَصَمَتْ فِيهِ مَلَائِكَةُ الرَّحْمَةِ وَمَلَائِكَةُ الْعَذَابِ فَأَوْحَى اللَّهُ إِلَى هَذِهِ أَنْ تَقَرَّبِي وَإِلَى هَذِهِ أَنْ تَبَاعَدِي فَقَالَ قِيسُوا مَا بَيْنَهُمَا فَوُجِدَ إِلَى هَذِهِ أَقْرَبَ بِشِبْرٍ فَغُفِرَ لَهُ \"","english":{"narrator":"Abu Sa'id al-Khudri reported God’s messenger as saying:","text":"Among the B. Isra’il there was a man who killed ninety-nine people and then went out to make enquiry. He went to a monk and asked him whether repentance would be accepted for what he had done, and when he replied that it would not, he killed him. He then began to make enquiry, and a man told him to go to such and such a village. When he was upon the point of death he arose to go towards it, and the angels of mercy and the angels of punishment disputed over him. God then told the one village to come near and the other to remove to a distance, and told the angels to measure the distance between them. He was found to be the distance of a span nearer to the one towards which he was going, and so he was forgiven. \n\n(Bukhari and Muslim.)"}},{"id":102,"idInBook":102,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «وَالَّذِي نَفْسِي بِيَدِهِ لَوْ لَمْ تُذْنِبُوا لَذَهَبَ اللَّهُ بِكُمْ وَلَجَاءَ بِقَوْمٍ يُذْنِبُونَ فَيَسْتَغْفِرُونَ اللَّهَ فَيَغْفِرُ لَهُمْ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, \"By Him in whose hand my soul is, if you had not sinned God would have removed you and brought a people who sin, then ask God’s pardon and are forgiven.\" \n\nMuslim transmitted it."}},{"id":103,"idInBook":103,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي مُوسَى رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ اللَّهَ يَبْسُطُ يَدَهُ بِاللَّيْلِ لِيَتُوبَ مُسِيءُ النَّهَارِ وَيَبْسُطُ يَدَهُ بِالنَّهَارِ لِيَتُوبَ مُسِيءُ اللَّيْلِ حَتَّى تَطْلُعَ الشَّمْسُ مِنْ مَغْرِبِهَا» . رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"Abu Musa reported God’s messenger as saying, \"God stretches out His hand at night that those who have done evil during the day may repent and stretches out His hand in the day-time that those who have done evil during the night may repent, until  the sun rises in the west.\" \n\nMuslim transmitted it."}},{"id":104,"idInBook":104,"chapterId":9,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «إِنَّ الْعَبَدَ إِذَا اعْتَرَفَ ثُمَّ تَابَ تَابَ الله عَلَيْهِ»","english":{"narrator":"","text":"'A’isha reported God’s messenger as saying, \"When a servant acknowledges his sin and repents, God forgives him.” \n\n(Bukhari and Muslim.)"}},{"id":105,"idInBook":105,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ تَابَ قَبْلَ أَنْ تَطْلُعَ الشَّمْسُ مِنْ مَغْرِبِهَا تَابَ الله عَلَيْهِ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, \"If anyone repents before the sun rises in the west, God will forgive him.\" \n\nMuslim transmitted it."}},{"id":106,"idInBook":106,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" لَلَّهُ أَشَدُّ فَرَحًا بِتَوْبَةِ عَبْدِهِ حِينَ يَتُوبُ إِلَيْهِ مِنْ أَحَدِكُمْ كانَ رَاحِلَتُهُ بِأَرْضٍ فَلَاةٍ فَانْفَلَتَتْ مِنْهُ وَعَلَيْهَا طَعَامُهُ وَشَرَابُهُ فَأَيِسَ مِنْهَا فَأَتَى شَجَرَةً فَاضْطَجَعَ فِي ظِلِّهَا قَدْ أَيِسَ مِنْ رَاحِلَتِهِ فَبَيْنَمَا هُوَ كذلكَ إِذ هُوَ بِهَا قَائِمَةً عِنْدَهُ فَأَخَذَ بِخِطَامِهَا ثُمَّ قَالَ مِنْ شِدَّةِ الْفَرَحِ: اللَّهُمَّ أَنْتَ عَبْدِي وَأَنَا رَبُّكَ أَخْطَأَ مِنْ شِدَّةِ الْفَرَحِ \". رَوَاهُ مُسلم","english":{"narrator":"","text":"Anas reported God’s messenger as saying, \"God is more pleased with the repentance of His servant when he turns penitently towards Him than one of you would be if his riding-beast which was carrying his food and drink escaped from him in a waterless desert and he, despairing of recovering it, went and lay down in the shade of a tree, then suddenly saw it standing beside him and, seizing its halter, said from excess of joy, ‘O God, Thou art my servant and I am Thy lord’, making a mistake from excess of joy.” \n\nMuslim transmitted it."}},{"id":107,"idInBook":107,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" إِنَّ عَبْدًا أَذْنَبَ ذَنْبًا فَقَالَ: رَبِّ أَذْنَبْتُ فَاغْفِرْهُ فَقَالَ رَبُّهُ أَعَلِمَ عَبْدِي أَنَّ لَهُ رَبًّا يَغْفِرُ الذَّنْبَ وَيَأْخُذُ بِهِ؟ غَفَرْتُ لِعَبْدِي ثُمَّ مَكَثَ مَا شَاءَ اللَّهُ ثُمَّ أَذْنَبَ ذَنْبًا فَقَالَ: رَبِّ أَذْنَبْتُ ذَنْبًا فَاغْفِرْهُ فَقَالَ رَبُّهُ: أَعَلِمَ عَبْدِي أَنَّ لَهُ رَبًّا يَغْفِرُ الذَّنْبَ وَيَأْخُذُ بِهِ؟ غَفَرْتُ لِعَبْدِي ثُمَّ مَكَثَ مَا شَاءَ اللَّهُ ثُمَّ أَذْنَبَ ذَنبا قالَ: رب أذنبت ذَنبا آخر فَاغْفِر لِي فَقَالَ: أَعَلِمَ عَبْدِي أَنَّ لَهُ رَبًّا يَغْفِرُ الذَّنْبَ وَيَأْخُذُ بِهِ؟ غَفَرْتُ لِعَبْدِي فَلْيَفْعَلْ مَا شَاءَ \"","english":{"narrator":"","text":"Abu Huraira said that God’s messenger told of a man who committed a sin and said, \"My Lord, I have sinned, so forgive me.” His Lord replied, “Does my servant know that he has a Lord who pardons sin and punishes for it? I have pardoned my servant.\" After remaining  such time as God willed he committed a sin and said, “My Lord, I have committed another sin, so forgive me.” He replied, “Does my servant know that he has a Lord who pardons sin and punishes for it? I have pardoned my servant, so let him do what he likes.”\n\n(Bukhari and Muslim.)"}},{"id":108,"idInBook":108,"chapterId":9,"bookId":14,"arabic":"وَعَنْ جُنْدُبٍ رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدَّثَ: \n\" أَنَّ رَجُلًا قَالَ: وَاللَّهِ لَا يَغْفِرُ اللَّهُ لِفُلَانٍ وَأَنَّ اللَّهَ تَعَالَى قَالَ: مَنْ ذَا الَّذِي يَتَأَلَّى عَلَيَّ أَنِّي لَا أَغْفِرُ لِفُلَانٍ فَإِنِّي قَدْ غَفَرْتُ لِفُلَانٍ وَأَحْبَطْتُ عَمَلَكَ \". أَوْ كَمَا قَالَ. رَوَاهُ مُسلم","english":{"narrator":"","text":"Jundub said that God’s messenger told of a man saying, “I swear by God that God will not forgive so and so,” whereupon God most high said, “Who is this who swears that I will not forgive so and so? For I have forgiven so and so and have made your deeds to come to nothing”, or words to that effect. \n\nMuslim transmitted it."}},{"id":109,"idInBook":109,"chapterId":9,"bookId":14,"arabic":"وَعَنْ شَدَّادِ بْنِ أَوْسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" سَيِّدُ الِاسْتِغْفَارِ أَنْ تَقُولَ: اللَّهُمَّ أَنْتَ رَبِّي لَا إِلَهَ إِلَّا أَنْتَ خَلَقْتَنِي وَأَنَا عَبْدُكَ وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعَتُ أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ وَأَبُوءُ بِذَنْبِي فَاغْفِرْ لِي فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ \". قَالَ: «وَمَنْ قَالَهَا مِنَ النَّهَارِ مُوقِنًا بِهَا فَمَاتَ مِنْ يَوْمِهِ قَبْلَ أَنْ يُمْسِيَ فَهُوَ مِنْ أَهْلِ الْجَنَّةِ وَمَنْ قَالَهَا مِنَ اللَّيْلِ وَهُوَ مُوقِنٌ بِهَا فَمَاتَ قَبْلَ أَنْ يُصْبِحَ فَهُوَ مِنْ أَهْلِ الْجَنَّةِ» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Shaddad b. Aus reported God’s messenger as saying that the best manner of asking pardon is to say, “O God, Thou art my Lord. There is no god but Thee. Thou hast created me, and I am Thy servant and hold to Thy covenant and promise as much as I can. I seek refuge in Thee from the evil of what I have done. I acknowledge Thy favour to me, and I acknowledge my sin. Pardon me, for none but Thee pardons sins.” He said that if anyone says it during the day-time with firm belief in it and dies that day before evening, he will be one of those who go to paradise; and if anyone says it during the night with firm belief in it and dies before morning, he will be one of those who go to paradise. \n\nBukhari transmitted it."}},{"id":110,"idInBook":110,"chapterId":9,"bookId":14,"arabic":"عَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" قَالَ اللَّهُ تَعَالَى: يَا ابْنَ آدَمَ إِنَّكَ مَا دَعَوْتَنِي وَرَجَوْتَنِي غَفَرْتُ لَكَ عَلَى مَا كَانَ فِيكَ وَلَا أُبَالِي يَا ابنَ آدمَ إِنَّك لَوْ بَلَغَتْ ذُنُوبُكَ عَنَانَ السَّمَاءِ ثُمَّ اسْتَغْفَرْتَنِي غَفَرْتُ لَكَ وَلَا أُبَالِي يَا ابْنَ آدَمَ إِنَّكَ لَوْ لَقِيتَنِي بِقُرَابِ الْأَرْضِ خَطَايَا ثُمَّ لَقِيتَنِي لَا تُشْرِكُ بِي شَيْئًا لَأَتَيْتُكَ بِقُرَابِهَا مغْفرَة \". رَوَاهُ التِّرْمِذِيّ\nوَرَوَاهُ أَحْمَدُ وَالدَّارِمِيُّ عَنْ أَبِي ذَرٍّ\nوَقَالَ التِّرْمِذِيّ: هَذَا حَدِيث حسن غَرِيب","english":{"narrator":"","text":"Anas reported God’s messenger as stating that God has said, “Son of Adam, as long as you supplicate me and hope in me I will pardon you in spite of what you have done, and I do not care. Son of Adam, if your sins were so numerous as to reach the lofty regions of the sky, then you asked my forgiveness, I would forgive you, and I do not care. Son of Adam, if you were to meet me with enough sins to fill the earth, then met me not associating anything with me, I would bring you as much pardon as would fill the earth.” \n\nTirmidhi transmitted it, and Ahmad and Darimi transmitted it from Abu Dharr. Tirmidhi said this is a hasan gharib tradition."}},{"id":111,"idInBook":111,"chapterId":9,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا عَنِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" قَالَ اللَّهُ تَعَالَى: مَنْ عَلِمَ أَنِّي ذُو قُدْرَةٍ عَلَى مَغْفِرَةِ الذُّنُوبِ غَفَرْتُ لَهُ وَلَا أُبَالِي مَا لم تشرك بِي شَيْئا \". رَوَاهُ فِي شرح السّنة","english":{"narrator":"","text":"Ibn ‘Abbas reported God’s messenger as stating that God has said, “If anyone knows that I have power to forgive sins I will pardon him and not care, so long as he associatesi nothing with me.” \n\nIt is transmitted in Sharh as-sunna."}},{"id":112,"idInBook":112,"chapterId":9,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ لَزِمَ الِاسْتِغْفَارَ جَعَلَ اللَّهُ لَهُ مِنْ كُلِّ ضِيقٍ مَخْرَجًا وَمِنْ كُلِّ هَمٍّ فَرَجًا وَرَزَقَهُ مِنْ حَيْثُ لَا يَحْتَسِبُ» . رَوَاهُ أحمدُ وَأَبُو دَاوُد وَابْن مَاجَه","english":{"narrator":"","text":"He reported God’s messenger as saying, “If anyone continually asks pardon, God will appoint for him a way out of every distress and a relief from every anxiety, and will provide for him from where he did not reckon.” \n\nAhmad, Abu Dawud and Ibn Majah transmitted it."}},{"id":113,"idInBook":113,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي بَكْرٍ الصِّدِّيقِ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا أَصَرَّ مَنِ اسْتَغْفَرَ وَإِنْ عَادَ فِي الْيَوْمِ سَبْعِينَ مَرَّةً» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ","english":{"narrator":"","text":"Abu Bakr as-Siddiq reported God's messenger as saying, “He who asks pardon is not a confirmed sinner, even if he returns to his sin seventy times a day.” \n\nTirmidhi and Abu Dawud transmitted it."}},{"id":114,"idInBook":114,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «كُلُّ بَنِي آدَمَ خَطَّاءٌ وَخَيْرُ الْخَطَّائِينَ التَّوَّابُونَ» . رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ والدارمي","english":{"narrator":"","text":"Anas reported God’s messenger as saying, \"All the sons of Adam are sinners, but the best of sinners are those who are given to repentance.\" \n\nTirmidhi, Ibn Majah and Darimi transmitted it."}},{"id":115,"idInBook":115,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" إِنِ الْمُؤْمِنَ إِذَا أَذْنَبَ كَانَتْ نُكْتَةٌ سَوْدَاءُ فِي قَلْبِهِ فَإِنْ تَابَ وَاسْتَغْفَرَ صُقِلَ قَلْبُهُ وَإِنْ زَادَ زَادَتْ حَتَّى تَعْلُوَ قَلْبَهُ فَذَلِكُمُ الرَّانُ الَّذِي ذَكَرَ اللَّهُ تَعَالَى (كَلَّا بَلْ رَانَ عَلَى قُلُوبِهِمْ مَا كَانُوا يكسِبونَ)\nرَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَابْنُ مَاجَهْ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ حَسَنٌ صَحِيح","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “When a believer sins there is black spot in his heart, and if he repents and asks pardon his heart is polished; but if he does more it increases till it gains the ascendancy over his heart. That is the rust mentioned by God most high, 'Nay, but what they were committing has spread like rust over their hearts'.” 1\n1. Qur’an, lxxxiii, 14.\n\nAhmad, Tirmidhi and Ibn Majah transmitted it, Tirmidhi saying this is a hasan sahih tradition."}},{"id":116,"idInBook":116,"chapterId":9,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ اللَّهَ يَقْبَلُ تَوْبَةَ الْعَبْدِ مَا لَمْ يُغَرْغِرْ» . رَوَاهُ التِّرْمِذِيُّ وَابْن مَاجَه","english":{"narrator":"","text":"Ibn ‘Umar reported God’s messenger as saying, “God accepts a servant’s repentance till he gives up his spirit in death.”* \n*The Arabic is ma lam yugharghir, which might, be translated literally \"as long as he has not died with the death rattle in his throat.\"\n\nTirmidhi and Ibn Majah transmitted it."}},{"id":117,"idInBook":117,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" إِنَّ الشَّيْطَانَ قَالَ: وَعِزَّتِكَ يَا رَبِّ لَا أَبْرَحُ أُغْوِي عِبَادَكَ مَا دَامَتْ أَرْوَاحُهُمْ فِي أَجْسَادِهِمْ فَقَالَ الرَّبُّ عَزَّ وَجَلَّ: وَعِزَّتِي وَجَلَالِي وَارْتِفَاعِ مَكَانِي لَا أَزَالُ أَغْفِرُ لَهُمْ مَا اسْتَغْفَرُونِي \" رَوَاهُ أَحْمَدُ","english":{"narrator":"","text":"Abu Sa'id reported God’s messenger as saying that the devil said, “By Thy might, my Lord, I shall continue to lead Thy servants astray as long as their spirits are in their bodies” The Lord who is great and glorious replied, “By my might, glory and exalted station, I shall con­ tinue to pardon them as long as they ask my forgiveness.” \n\nAhmad transmitted it."}},{"id":118,"idInBook":118,"chapterId":9,"bookId":14,"arabic":"وَعَنْ صَفْوَانَ بْنِ عَسَّالٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" إِنَّ اللَّهَ تَعَالَى جَعَلَ بِالْمَغْرِبِ بَابًا عَرْضُهُ مَسِيرَةُ سَبْعِينَ عَامًا لِلتَّوْبَةِ لَا يُغْلَقُ مَا لم تطلع عَلَيْهِ الشَّمْسُ مِنْ قِبَلِهِ وَذَلِكَ قَوْلُ اللَّهِ عَزَّ وَجَلَّ: (يَوْمَ يَأْتِي بَعْضُ آيَاتِ رَبِّكَ لَا يَنْفَعُ نَفْسًا إِيمَانُهَا لَمْ تَكُنْ آمَنَتْ مِنْ قبل)\nرَوَاهُ التِّرْمِذِيّ وَابْن مَاجَه","english":{"narrator":"","text":"Safwan b. ‘Assal reported God’s messenger as saying, “God most high has placed in the west for repentance a gate with a breadth of seventy years’ journey, and it will not be locked as long the sun does not rise in its direction. That agrees with God’s words, ‘On the day that certain of the signs of your Lord come, a soul which has not believed before will not be benefited by believing in them ’.”* \n*Qur’an, vi, 158\n\nTirmidhi and Ibn Majah transmitted it."}},{"id":119,"idInBook":119,"chapterId":9,"bookId":14,"arabic":"وَعَنْ مُعَاوِيَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَنْقَطِعُ الْهِجْرَةُ حَتَّى يَنْقَطِع التَّوْبَةُ وَلَا تَنْقَطِعُ التَّوْبَةُ حَتَّى تَطْلُعَ الشَّمْسُ مِنْ مَغْرِبِهَا» . رَوَاهُ أَحْمَدُ وَأَبُو دَاوُدَ وَالدَّارِمِيُّ","english":{"narrator":"","text":"Mu'awiya reported God’s messenger as saying, \"Emigration will not come to an end* till repentance comes to an end and repentance will not come to an end till the sun rises in-the place where it sets.” \n*This probably means that people will continue to leave districts in which it is difficult for them to observe their religion.\n\nAhmad Abu Dawud and Darimi transmitted it."}},{"id":120,"idInBook":120,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" إِنَّ رَجُلَيْنِ كَانَا فِي بَنِي إِسْرَائِيلَ مُتَحَابَّيْنِ أَحدهمَا مُجْتَهد لِلْعِبَادَةِ وَالْآخَرُ يَقُولُ: مُذْنِبٌ فَجَعَلَ يَقُولُ: أَقْصِرْ عَمَّا أَنْتَ فِيهِ فَيَقُولُ خَلِّنِي وَرَبِّي حَتَّى وَجَدَهُ يَوْمًا عَلَى ذَنْبٍ اسْتَعْظَمَهُ فَقَالَ: أَقْصِرْ فَقَالَ: خَلِّنِي وَرَبِّيَ أَبُعِثْتَ عَلَيَّ رَقِيبًا؟ فَقَالَ: وَاللَّهِ لَا يَغْفِرُ اللَّهُ لَكَ أَبَدًا وَلَا يُدْخِلُكَ الْجَنَّةَ فَبَعَثَ اللَّهُ إِلَيْهِمَا مَلَكًا فَقَبَضَ أَرْوَاحَهُمَا فَاجْتَمَعَا عِنْدَهُ فَقَالَ لِلْمُذْنِبِ: ادْخُلِ الْجَنَّةَ بِرَحْمَتِي وَقَالَ لِلْآخَرِ: أَتَسْتَطِيعُ أَنْ تَحْظِرَ عَلَى عَبْدِي رَحْمَتِي؟ فَقَالَ: لَا يَا رَبِّ قَالَ: اذْهَبُوا بِهِ إِلَى النَّار \". رَوَاهُ أَحْمد","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “There were two men among the B. Israil who loved one another, 'one of whom engaged ardently in worship while the other called himself a sinner. The former began to say, \"Refrain from what you are doing,\" and the other would reply, “Let me alone with my Lord.” One day he found him committing a sin which he considered serious and said, “Refrain;\" to which he replied, “Let me alone with my Lord. Were you sent to watch over me?” He then said, \"I swear by God that God will never pardon you, nor will He bring you into paradise.\" God then sent to them an angel who took their spirits, and they came together into His presence To the sinner He said, “Enter paradise by my mercy;” and to the other He said, “Can you forbid my mercy to my servant?” He replied, “No, my Lord.” Then He said, “Take him away to hell.” \n\nAhmad transmitted it."}},{"id":121,"idInBook":121,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَسْمَاءَ بِنْتِ يَزِيدَ قَالَتْ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم يقْرَأ: (يَا عبَادي الَّذِي أَسْرَفُوا عَلَى أَنْفُسِهِمْ لَا تَقْنَطُوا مِنْ رَحْمَةِ اللَّهِ إِنَّ اللَّهَ يَغْفِرُ الذُّنُوبَ جَمِيعًا)\nوَلَا يُبَالِي\nرَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَقَالَ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ وَفِي شَرْحِ السُّنَّةِ يَقُولُ: بَدَلَ: يقْرَأ","english":{"narrator":"","text":"Asma’ daughter of Yazid said she heard God’s messenger reciting, “My servants who have transgressed against their souls, do not despair of God’s mercy, for God pardons all sins,”*  “and He does not care.” \n*Qur’an, xxxix, 53.\n\nAhmad and Tirmidhi transmitted it, the latter saying this is a hasan gharib tradition. Sharh as-sunna has “saying” instead of “reciting.”"}},{"id":122,"idInBook":122,"chapterId":9,"bookId":14,"arabic":"وَعَن ابْن عَبَّاس: فِي قَوْله تَعَالَى: (إِلَّا اللمم)\nقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:\nإِنْ تَغْفِرِ اللَّهُمَّ تَغْفِرْ جَمَّا وَأَيُّ عَبْدٍ لَكَ لَا أَلَمَّا\nرَوَاهُ التِّرْمِذِيُّ. وَقَالَ: هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيب","english":{"narrator":"","text":"With reference to God’s words, “Except for slight faults ”* Ibn ‘Abbas reported God's messenger as saying, “If Thou forgivest, O God, Thou wilt forgive much sin, for which of Thy servants has not committed slight faults?” \n*Qur'an, liii, 32.\n\nTirmidhi transmitted it, saying this is a hasan sahih gharib tradition."}},{"id":123,"idInBook":123,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي ذَرٍّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" يَقُولُ اللَّهُ تَعَالَى يَا عِبَادِي كُلُّكُمْ ضَالٌّ إِلَّا مَنْ هَدَيْتُ فَاسْأَلُونِي الْهُدَى أَهْدِكُمْ وَكُلُّكُمْ فُقَرَاءُ إِلَّا مَنْ أَغْنَيْتُ فَاسْأَلُونِي أُرْزَقْكُمْ وَكُلُّكُمْ مُذْنِبٌ إِلَّا مَنْ عَافَيْتُ فَمَنْ عَلِمَ مِنْكُمْ أَنِّي ذُو قُدْرَةٍ عَلَى الْمَغْفِرَةِ فَاسْتَغْفَرَنِي غَفَرْتُ لَهُ وَلَا أُبَالِي وَلَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَحَيَّكُمْ وَمَيِّتَكُمْ وَرَطْبَكُمْ وَيَابِسَكُمُ اجْتَمَعُوا عَلَى أَتْقَى قَلْبِ عَبْدٍ مِنْ عبَادي مَا زَاد فِي ملكي جنَاح بعوضةولو أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَحَيَّكُمْ وَمَيِّتَكُمْ وَرَطْبَكُمْ وَيَابِسَكُمُ اجْتَمَعُوا عَلَى أَشْقَى قَلْبِ عَبْدٍ مِنْ عِبَادِي مَا نَقَصَ ذَلِكَ مِنْ مُلْكِي جَنَاحَ بَعُوضَةٍ. وَلَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَحَيَّكُمْ وَمَيِّتَكُمْ وَرَطْبَكُمْ وَيَابِسَكُمُ اجْتَمَعُوا فِي صَعِيدٍ وَاحِدٍ فَسَأَلَ كُلُّ إِنْسَانٍ مِنْكُمْ مَا بَلَغَتْ أُمْنِيَّتُهُ فَأَعْطَيْتُ كُلَّ سَائِلٍ مِنْكُمْ مَا نَقَصَ ذَلِكَ مِنْ مُلْكِي إِلَّا كَمَا لَوْ أَنَّ أَحَدَكُمْ مَرَّ بِالْبَحْرِ فَغَمَسَ فِيهِ إِبْرَةً ثُمَّ رَفَعَهَا ذَلِكَ بِأَنِّي جَوَادٌ مَاجِدٌ أَفْعَلُ مَا أُرِيدُ عَطَائِي كَلَامٌ وَعَذَابِي كَلَامٌ إِنَّمَا أَمْرِي لِشَيْءٍ إِذَا أَرَدْتُ أَنْ أَقُولَ لَهُ (كُنْ فَيَكُونُ)\nرَوَاهُ أَحْمَدُ وَالتِّرْمِذِيّ وَابْن مَاجَه","english":{"narrator":"","text":"Abu Dharr reported God’s messenger as stating that God most high says, “My servants, all of you are astray except him whom I have guided, but if you ask me for guidance I will guide you; all of you are poor except him whom I have enriched, but if you ask of me I will give you provision; all of you are sinners except him whom I have preserved \n3. i.e., young and old.\n\nAhmad, Tirmidhi and Ibn Majah transmitted it."}},{"id":124,"idInBook":124,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَنَسٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَرَأَ (هُوَ أَهْلُ التَّقْوَى وَأَهْلُ الْمَغْفِرَة)\nقَالَ:\nقَالَ رَبُّكُمْ أَنَا أَهْلٌ أَنْ أُتَّقَى فَمَنِ اتَّقَانِي فَأَنَا أَهْلٌ أَنْ أَغْفِرَ لَهُ \". رَوَاهُ التِّرْمِذِيّ وَابْن مَاجَه والدارمي","english":{"narrator":"","text":"Anas reported that after the Prophet had recited, “He is entitled to be feared and He is entitled to grant pardon,” 2 he stated that their Lord has said, “I am entitled to be feared, and to him who fears me I am entitled to grant pardon.” \n2. Qur’an, lxxiv, 56.\n\nTirmidhi, Ibn Majah and Darimi transmitted it."}},{"id":125,"idInBook":125,"chapterId":9,"bookId":14,"arabic":"وَعَن ابْن عمر قَالَ: إِنْ كُنَّا لَنَعُدُّ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْمَجْلِسِ يَقُولُ: «رَبِّ اغْفِرْ لِي وَتُبْ عَلَيَّ إِنَّكَ أَنْتَ التَّوَّابُ الْغَفُورُ» مِائَةَ مَرَّةٍ. رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ","english":{"narrator":"Ibn ‘Umar said:","text":"We counted that God’s messenger would say a hundred times during a meeting, “My Lord, forgive me and pardon me; Thou art the Pardoning and Forgiving One.” \n\nAhmad, Tirmidhi, Abu Dawud and Ibn Majah transmitted it."}},{"id":126,"idInBook":126,"chapterId":9,"bookId":14,"arabic":"وَعَن بِلَال بن يسَار بن زيدٍ مَوْلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: حَدَّثَنِي أَبِي عَنْ جَدِّي أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: \n\" مَنْ قَالَ: أَسْتَغْفِرُ اللَّهَ الَّذِي لَا إِلَهَ إِلَّا هُوَ الْحَيَّ الْقَيُّومَ وَأَتُوبُ إِلَيْهِ غُفِرَ لَهُ وَإِنْ كَانَ قَدْ فَرَّ مِنَ الزَّحْفِ \". رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ لَكِنَّهُ عِنْدَ أَبِي دَاوُدَ هِلَالُ بْنُ يَسَارٍ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ غَرِيب","english":{"narrator":"","text":"Bilal b. Yasar b. Zaid, the Prophet’s client,1 told on his father’s authority that his grandfather said he had heard God's messenger state that if anyone says, “I ask pardon of God than whom there is no god, the Living, the Eternal, and I turn to Him in repentance,” he will be pardoned, even if he has fled in time of battle. \n1. The client was Zaid, Bilal’s grandfather.\n\nTirmidhi and Abu Dawud transmitted it; but Abu Dawud has Hilal b. Yasar, and Tirmidhi calls this a gharib tradition."}},{"id":127,"idInBook":127,"chapterId":9,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" إِنَّ اللَّهَ عَزَّ وَجَلَّ لَيَرْفَعُ الدَّرَجَةَ لِلْعَبْدِ الصَّالِحِ فِي الْجَنَّةِ فَيَقُولُ: يَا رَبِّ أَنَّى لِي هَذِهِ؟ فَيَقُولُ: باستغفار ولدك لَك \". رَوَاهُ أَحْمد","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “God who is great and glorious will raise a righteous servant’s degree in paradise, and when he asks his Lord how this has been granted him, He will reply that it is because his son has asked pardon for him.” \n\nAhmad transmitted it."}},{"id":128,"idInBook":128,"chapterId":9,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا الْمَيِّتُ فِي الْقَبْرِ إِلَّا كَالْغَرِيقِ الْمُتَغَوِّثِ يَنْتَظِرُ دَعْوَةً تَلْحَقُهُ مِنْ أَبٍ أَوْ أُمٍّ أَوْ أَخٍ أَوْ صَدِيقٍ فَإِذَا لَحِقَتْهُ كَانَ أَحَبَّ إِلَيْهِ مِنَ الدُّنْيَا وَمَا فِيهَا وَإِنَّ اللَّهَ تَعَالَى لَيُدْخِلُ عَلَى أَهْلِ الْقُبُورِ مِنْ دُعَاءِ أَهْلِ الْأَرْضِ أَمْثَالَ الْجِبَالِ وَإِنَّ هَدِيَّةَ الْأَحْيَاءِ إِلَى الْأَمْوَاتِ الِاسْتِغْفَارُ لَهُمْ» . رَوَاهُ الْبَيْهَقِيُّ فِي شعب الْإِيمَان","english":{"narrator":"","text":"‘Abdallah b. ‘Abbas reported God’s messenger as saying, “A dead man in his grave is just like a drowning man calling for help, for he hopes that a supplication from a father, a mother, a brother, or a friend may reach him, and when it does it is dearer to him than the world and what it contains. God most high brings to those who are in the graves blessings several times as great as the size of the mountains because of the supplication of those who are on the earth. The gift of the living to the dead is to ask pardon for them.” \n\nBaihaqi transmitted it in Shu'ab al-iman."}},{"id":129,"idInBook":129,"chapterId":9,"bookId":14,"arabic":"وَعَن عبد الله بن يسر قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «طُوبَى لِمَنْ وَجَدَ فِي صَحِيفَتِهِ اسْتِغْفَارًا كَثِيرًا» . رَوَاهُ ابْنُ مَاجَهْ وَرَوَى النَّسَائِيُّ فِي «عملِ يَوْم وَلَيْلَة»","english":{"narrator":"","text":"‘Abdallah b. Busr reported God's messenger as saying, “Blessed is he who finds a great amount of asking for pardon in his record.” \n\nIbn Majah transmitted it, and Nasa'i transmitted in 'Amal yaum walaila. 1\n1. Mirqat, iii, 78 gives this as the title of a book by Nasa’i. The only reference to this tradition in the Concordance is Ibn Majah, Adab, 57."}},{"id":130,"idInBook":130,"chapterId":9,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ: «اللَّهُمَّ اجْعَلْنِي مِنَ الَّذِينَ إِذا أحْسَنوا استبشَروا وإِذا أساؤوا اسْتَغْفَرُوا» . رَوَاهُ ابْنُ مَاجَهْ وَالْبَيْهَقِيُّ فِي الدَّعَوَاتِ الْكَبِير","english":{"narrator":"","text":"‘A’isha said that the Prophet used to say, “O God, put me among those who, when they do good are glad, and when they do evil ask pardon.” \n\nIbn Majah and Baihaqi, in  ad-Da'awat al-kabir, transmitted it."}},{"id":131,"idInBook":131,"chapterId":9,"bookId":14,"arabic":"وَعَن الْحَارِث بن سُويَدٍ قَالَ: حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْعُودٍ حَدِيثَيْنِ: أحدُهما عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالْآخِرُ عَنْ نَفْسِهِ قَالَ: إِنَّ الْمُؤْمِنَ يَرَى ذُنُوبَهُ كَأَنَّهُ قَاعِدٌ تَحْتَ جَبَلٍ يَخَافُ أَنْ يَقَعَ عَلَيْهِ وَإِنَّ الْفَاجِرَ يَرَى ذُنُوبَهُ كَذُبَابٍ مَرَّ عَلَى أَنْفِهِ فَقَالَ بِهِ هَكَذَا أَيْ بِيَدِهِ فَذَبَّهُ عَنْهُ ثُمَّ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم يَقُول: \n\" لَلَّهُ أَفْرَحُ بِتَوْبَةِ عَبْدِهِ الْمُؤْمِنِ مِنْ رَجُلٍ نَزَلَ فِي أَرْضٍ دَوِيَّةٍ مَهْلَكَةٍ مَعَهُ رَاحِلَتُهُ عَلَيْهَا طَعَامُهُ وَشَرَابُهُ فَوَضَعَ رَأْسَهُ فَنَامَ نَوْمَةً فَاسْتَيْقَظَ وَقَدْ ذَهَبَتْ رَاحِلَتُهُ فَطَلَبَهَا حَتَّى إِذَا اشْتَدَّ عَلَيْهِ الْحَرُّ وَالْعَطَشُ أَوْ مَا شَاءَ اللَّهُ قَالَ: أَرْجِعُ إِلَى مَكَانِي الَّذِي كُنْتُ فِيهِ فَأَنَامُ حَتَّى أَمُوتَ فَوَضَعَ رَأْسَهُ عَلَى سَاعِدِهِ لِيَمُوتَ فَاسْتَيْقَظَ فَإِذَا رَاحِلَتُهُ عِنْدَهُ عَلَيْهَا زَادُهُ وَشَرَابُهُ فَاللَّهُ أَشَدُّ فَرَحًا بِتَوْبَةِ الْعَبْدِ الْمُؤْمِنِ مِنْ هَذَا بِرَاحِلَتِهِ وَزَادِهِ \". رَوَى مُسْلِمٌ الْمَرْفُوع إِلَى رَسُول صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْهُ فَحَسْبُ وَرَوَى البُخَارِيّ الموقوفَ على ابنِ مَسْعُود أَيْضا","english":{"narrator":"","text":"Al-Harith b. Suwaid said that ‘Abdallah b. Mas'ud told him two traditions, one of them from God’s messenger and the other from him­ self. He said, “The believer sees in his sins as though he were sitting under a mountain which he fears may fall on him, but the profligate sees his sins like a fly which has passed over his nose and which he has brushed away with his hand.” Then he said that he heard God’s mes­ senger say, “God rejoices more over the repentance of a believer than a man who goes down to a desert and dangerous district with his riding- beast which carries his food and drink, who lays down his head and sleeps for a time, then awakening and finding that his riding-beast has gone, looks for it, and when distressed by heat and thirst or what God wills, says he will return to the place where he was and sleep till he dies, lays his head on his arm to die, then awakens and sees his riding-beast beside him with his food and drink on it. God rejoices more intensely over the repentance of a believing servant than this man does over his riding-beast and his provisions.” \n\nMuslim transmitted only the tradition which is traced back to God’s messenger from him, but Bukhari transmitted also the one which goes no farther back than Ibn Mas'ud."}},{"id":132,"idInBook":132,"chapterId":9,"bookId":14,"arabic":"وَعَنْ عَلِيٍّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ اللَّهَ يُحِبُّ الْعَبْدَ المؤمنَ المفتَّنَ التوَّابَ»","english":{"narrator":"","text":"‘Ali reported God’s messenger as saying, “God loves the believing servant who is severely tried and is penitent.”"}},{"id":133,"idInBook":133,"chapterId":9,"bookId":14,"arabic":"وَعَنْ ثَوْبَانَ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَا أُحِبُّ أَنَّ لِي الدُّنْيَا بِهَذِهِ الْآيَةِ (يَا عِبَادِيَ الَّذِينَ أَسْرفُوا على أنْفُسِهم لَا تَقْنَطوا)\nالْآيَةَ» فَقَالَ رَجُلٌ: فَمَنْ أَشْرَكَ؟ فَسَكَتَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ قَالَ: «أَلا وَمن أشرَكَ» ثَلَاث مرَّاتٍ","english":{"narrator":"","text":"Thauban said that he heard God’s messenger say, \"I would not give this verse for the whole world, 'My servants who have transgressed against their souls, do not despair . . .’ ”1 A man asked whether that included those who had associated partners with God, and after remaining silent for a time the Prophet said three times, “Yes, it includes even those who have associated partners with God.”\n1 . Qur'an, xxxix, 53"}},{"id":134,"idInBook":134,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي ذَرٍّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ اللَّهَ تَعَالَى لَيَغْفِرُ لِعَبْدِهِ مَا لَمْ يَقَعِ الْحِجَابُ» . قَالُوا: يَا رَسُولَ اللَّهِ وَمَا الْحِجَابُ؟ قَالَ: «أَنْ تَمُوتَ النَّفْسُ وَهِيَ مُشْرِكَةٌ»\nرَوَى الْأَحَادِيثَ الثَّلَاثَةَ أَحْمَدُ وَرَوَى الْبَيْهَقِيُّ الْأَخِيرَ فِي كِتَابِ الْبَعْثُ والنشور","english":{"narrator":"","text":"Abu Dharr reported God’s messenger as saying, “God most high forgives His servant as long as the veil has not fallen.” He was asked what the veil meant and replied, “That a soul should die while associating partners with God.” \n\nAhmad transmitted the three traditions and Baihaqi transmitted the last in Kitab al-ba'th wan-nushur."}},{"id":135,"idInBook":135,"chapterId":9,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ لَقِيَ اللَّهَ لَا يَعْدِلُ بِهِ شَيْئًا فِي الدُّنْيَا ثُمَّ كَانَ عَلَيْهِ مِثْلَ جِبَالٍ ذُنُوبٌ غَفَرَ اللَّهُ لَهُ» . رَوَاهُ الْبَيْهَقِيّ فِي كتاب الْبَعْث والنشور","english":{"narrator":"","text":"He reported God’s messenger as saying, “If anyone meets God, not having treated anything as equal to Him in the world, and has committed sins equal in quantity to the mountains, God will forgive him.” \n\nBaihaqi transmitted it in Kitab al-ba'th wan-nushur."}},{"id":136,"idInBook":136,"chapterId":9,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «التَّائِبَ مِنَ الذَّنْبِ كَمَنْ لَا ذَنْبَ لَهُ» . رَوَاهُ ابْنُ مَاجَهْ وَالْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَانِ وَقَالَ تَفَرَّدَ بِهِ النَّهْرَانَيُّ وَهُوَ مَجْهُولٌ. وَفِي (شَرْحِ السُّنَّةِ)\nرَوَى عَنْهُ مَوْقُوفًا قَالَ: النَّدَمُ تَوْبَةٌ والتَّائبُ كمن لَا ذَنْبَ لَهُ","english":{"narrator":"","text":"‘Abdallah b. Mas'ud reported God’s messenger as saying, “He who repents of a sin is like him who has committed no sin.” \n\nIn Majah and Baihaqi, in Shu'ab al-iman, transmitted it, the latter saying its only transmitter was an-Nahrani who is unknown. In Sharh as-sunna a tradition traced no farther back than him is transmitted in which he said, “Nadam is repentance, and he who repents is like him who has committed no sin.”"}},{"id":137,"idInBook":137,"chapterId":9,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" لَمَّا قَضَى اللَّهُ الْخَلْقَ كَتَبَ كِتَابًا فَهُوَ عِنْدَهُ فَوْقَ عَرْشِهِ: إِنَّ رَحْمَتِي سَبَقَتْ غَضَبِي «. وَفِي رِوَايَةٍ» غَلَبَتْ غَضَبي \"","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “When God completed the creation He wrote the following which is with Him above His Throne, ‘My mercy has taken precedence over my anger’.” A version says, “Has prevailed over my anger.” \n\n(Bukhari and Muslim)."}},{"id":138,"idInBook":138,"chapterId":9,"bookId":14,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «إِنَّ للَّهِ مائةَ رَحْمَةٍ أَنْزَلَ مِنْهَا رَحْمَةً وَاحِدَةً بَيْنَ الْجِنِّ وَالْإِنْسِ وَالْبَهَائِمِ وَالْهَوَامِّ فَبِهَا يَتَعَاطَفُونَ وَبِهَا يَتَرَاحَمُونَ وَبِهَا تَعْطُفُ الْوَحْشُ عَلَى وَلَدِهَا وَأَخَّرَ اللَّهُ تِسْعًا وَتِسْعِينَ رَحْمَةً يَرْحَمُ بِهَا عِبَادَهُ يَوْمَ الْقِيَامَة»\nوَفِي رِوَايَةٍ لِمُسْلِمٍ عَنْ سَلْمَانَ نَحْوُهُ وَفِي آخِرِهِ قَالَ: «فَإِذَا كَانَ يَوْمُ الْقِيَامَةِ أَكْمَلَهَا بِهَذِهِ الرَّحْمَة»","english":{"narrator":"","text":"He reported God’s messenger as saying, “God has a hundred, mercies of which He has sent down one among jinn and men, animals and creeping things. By it they are kind to one another, by it they show mercy to one another, and by it the wild beast is kind to its young. But God has kept back ninety-nine mercies by which He will show mercy to His servants on the day of resurrection.” \n\n(Bukhari and Muslim). A version by Muslim from Salman has something similar, at the end of which he said, “When the day of resurrection comes He will complete them with this one.”"}},{"id":139,"idInBook":139,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَوْ يَعْلَمُ الْمُؤْمِنُ مَا عِنْدَ اللَّهِ مِنَ الْعُقُوبَةِ مَا طَمِعَ بِجَنَّتِهِ أَحَدٌ وَلَوْ يُعْلَمُ الْكَافِرُ مَا عِنْدَ اللَّهِ مِنَ الرَّحْمَةِ مَا قَنَطَ من جنته أحد»","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “If the believer knew the punishment God has prepared, no one would hope for His paradise; and if the infidel knew the extent of His mercy, no one would despair of attaining His paradise.” \n\n(Bukhari and Muslim.)"}},{"id":140,"idInBook":140,"chapterId":9,"bookId":14,"arabic":"وَعَنِ ابْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْجَنَّةُ أَقْرَبُ إِلَى أَحَدِكُمْ مِنْ شِرَاكِ نَعْلِهِ وَالنَّارُ مِثْلُ ذَلِكَ» . رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Ibn Mas'ud reported God’s messenger as saying, “Paradise is nearer to each of you than the thong of his sandal, and the same applies to hell.” \n\nBukhari transmitted it."}},{"id":141,"idInBook":141,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عَلَيْهِ وَسلم: \n\" قَالَ رَجُلٌ لَمْ يَعْمَلْ خَيْرًا قَطُّ لِأَهْلِهِ وَفِي رِوَايَةٍ أَسْرَفَ رَجُلٌ عَلَى نَفْسِهِ فَلَمَّا حَضَرَهُ الْمَوْتُ أَوْصَى بَنِيهِ إِذَا مَاتَ فَحَرِّقُوهُ ثُمَّ اذْرُوا نِصْفَهُ فِي الْبَرِّ وَنِصْفَهُ فِي الْبَحْرِ فو الله لَئِنْ قَدَرَ اللَّهُ عَلَيْهِ لَيُعَذِّبَنَّهُ عَذَابًا لَا يُعَذِّبُهُ أَحَدًا مِنَ الْعَالَمِينَ فَلَمَّا مَاتَ فَعَلُوا مَا أَمَرَهُمْ فَأَمَرَ اللَّهُ الْبَحْرَ فَجَمَعَ مَا فِيهِ وَأَمَرَ الْبَرَّ فَجَمَعَ مَا فِيهِ ثُمَّ قَالَ لَهُ: لِمَ فَعَلْتَ هَذَا؟ قَالَ: مِنْ خَشْيَتِكَ يَا رَبِّ وَأَنْتَ أَعْلَمُ فَغَفَرَ لَهُ \"","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying that a man declared he had never done any good to his family. (A version says that a man had committed an excessive amount of sin), and when he was about to die gave instruction to his sons to burn him when he died and scatter half his ashes on the land and half in the sea, swearing by God that if God had him in His power He would give him such a punishment as He would give to no other in the universe. When he died they did what he had commanded them, but God gave command to the sea and it gathered what was in it, and He gave command to the land and it gathered what was in it. He then asked him, \"Why did you do this?\" and he replied, “From fear of Thee, my Lord, but Thou knowest best.” Then He pardoned him. \n\n(Bukhari and Muslim.)"}},{"id":142,"idInBook":142,"chapterId":9,"bookId":14,"arabic":"وَعَنْ عُمَرَ بْنِ الْخَطَّابِ قَالَ: قَدِمَ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَبْيٌ فَإِذَا امْرَأَةٌ مِنَ السَّبْيِ قَدْ تَحَلَّبَ ثديُها تسْعَى إِذا وَجَدَتْ صَبِيًّا فِي السَّبْيِ أَخَذَتْهُ فَأَلْصَقَتْهُ بِبَطْنِهَا وَأَرْضَعَتْهُ فَقَالَ لَنَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَتُرَوْنَ هَذِهِ طَارِحَةً وَلَدَهَا فِي النَّارِ؟» فَقُلْنَا: لَا وَهِيَ تَقْدِرُ عَلَى أَنْ لَا تَطْرَحَهُ فَقَالَ: «لَلَّهُ أَرْحَمُ بِعِبَادِهِ مِنْ هَذِهِ بِوَلَدِها»","english":{"narrator":"","text":"‘Umar b. al-Khattab said that captives came to the Prophet among whom was a woman whose breast was oozing with milk. She was running, and when she found a boy among the captives she took him, put him to her breast and suckled him. Then the Prophet said to us, “Do you think this woman will cast her child into the fire?” We replied, “No, so long as is she in a position not to do so.” He said, “God is more merciful to His servants than this woman is to her child.” \n\n(Bukhari and Muslim.)"}},{"id":143,"idInBook":143,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَنْ يُنْجِيَ أَحَدًا مِنْكُمْ عَمَلُهُ» قَالُوا: وَلَا أَنْتَ يَا رَسُولَ اللَّهِ؟ قَالَ: «وَلَا أَنَا إِلَّا أَنْ يَتَغَمَّدَنِي اللَّهُ مِنْهُ بِرَحْمَتِهِ فَسَدِّدُوا وَقَارِبُوا واغْدُوا وروحوا وشيءٌ من الدُّلْجَةِ والقَصدَ القصدَ تبلغوا»","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “None of you will be rescued by his works.” He was asked if not even he would, and replied, “Not even I unless God covers me with His mercy; but if you keep to the straight path, are moderate, pray morning and evening and part of the night, and earnestly practise moderation, you will reach .” \n\n(Bukhari and Muslim.)"}},{"id":144,"idInBook":144,"chapterId":9,"bookId":14,"arabic":"وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يُدْخِلُ أَحَدًا مِنْكُمْ عَمَلُهُ الْجَنَّةَ وَلَا يُجِيرُهُ مِنَ النَّارِ وَلَا أَنا إِلا برحمةِ الله» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Jabir reported God’s messenger as saying, “What you do will not bring any of you into paradise or protect you from hell, including myself, except by God’s mercy.” \n\nMuslim transmitted it."}},{"id":145,"idInBook":145,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" إِذَا أَسْلَمَ الْعَبْدُ فَحَسُنَ إِسْلَامُهُ يُكَفِّرُ اللَّهُ عَنْهُ كُلَّ سَيِّئَةٍ كَانَ زَلَفَهَا وَكَانَ بَعْدَ الْقِصَاصِ: الْحَسَنَةُ بِعَشْرِ أَمْثَالِهَا إِلَى سَبْعِمِائَةِ ضِعْفٍ إِلَى أَضْعَافٍ كَثِيرَةٍ وَالسَّيِّئَةُ بِمِثْلِهَا إِلَّا أَنْ يَتَجَاوَزَ اللَّهُ عَنْهَا \". رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Abu Sa'id reported God’s messenger as saying, “When a man accepts Islam sincerely God removes from him every sin he has previously committed. After that there will be requital, a good deed getting ten to seven hundred times as much and many times more, and an evil deed getting a punishment equivalent to it, unless God overlooks it.”\n\nBukhari transmitted it."}},{"id":146,"idInBook":146,"chapterId":9,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" إِنَّ اللَّهَ كَتَبَ الحسناتِ والسيِّئاتِ: فَمَنْ هَمَّ بِحَسَنَةٍ فَلَمْ يَعْمَلْهَا كَتَبَهَا اللَّهُ لهُ عندَهُ حَسَنَة كَامِلَة فَإِن هم بعملها كَتَبَهَا اللَّهُ لَهُ عِنْدَهُ عَشْرَ حَسَنَاتٍ إِلَى سَبْعِمِائَةِ ضِعْفٍ إِلَى أَضْعَافٍ كَثِيرَةٍ وَمَنْ هَمَّ بسيئة فَلَمْ يَعْمَلْهَا كَتَبَهَا اللَّهُ عِنْدَهُ حَسَنَةً كَامِلَةً فَإِن هُوَ هم بعملها كتبهَا الله لَهُ سَيِّئَة وَاحِدَة \"","english":{"narrator":"Ibn ‘Abbas reported God’s messenger as saying, “God records the good deeds and the evil deeds. If anyone intends to do a good deed but does not do it, God enters it for him in His record as a complete good deed:","text":"and if he intends to do a good deed and does it, God enters it for him in His record as ten to seven hundred and many more times as much. If anyone intends to do an evil deed and does not do it, God enters it for him in His record as a complete good deed; but if he intends to do it and does it, God records it for him as one evil deed.”\n\n(Bukhari and Muslim.)"}},{"id":147,"idInBook":147,"chapterId":9,"bookId":14,"arabic":"عَنْ عُقْبَةَ بْنِ عَامِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ مَثَلَ الَّذِي يعْمل السَّيئَة ثُمَّ يَعْمَلُ الْحَسَنَاتِ كَمَثَلِ رَجُلٍ كَانَتْ عَلَيْهِ دِرْعٌ ضَيِّقَةٌ قَدْ خَنَقَتْهُ ثُمَّ عَمِلَ حَسَنَةً فَانْفَكَّتْ حَلْقَةٌ ثُمَّ عَمِلَ أُخْرَى فَانْفَكَّتْ أُخْرَى حَتَّى تَخْرُجَ إِلَى الْأَرْضِ»\nرَوَاهُ فِي شَرْحِ السّنة","english":{"narrator":"","text":"‘Uqba b. ‘Amir reported God’s messenger as saying, “One who does evil deeds and afterwards does good deeds is like a man who was wearing a tight coat of mail which choked him, then did a good deed and a ring was loosened, then did another and another was loosened, so that it fell at last to the ground.” \n\nIt is transmitted in Sharh as-sunna."}},{"id":148,"idInBook":148,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي الدَّرْدَاءِ: أَنَّهُ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُصُّ عَلَى الْمِنْبَرِ وَهُوَ يَقُول: (ولِمنْ خافَ مقامَ رَبِّهِ جنَّتانِ)\nقُلْتُ: وَإِنْ زَنَى وَإِنْ سَرَقَ؟ يَا رَسُولَ اللَّهِ فَقَالَ الثَّانِيَةَ: (وَلِمَنْ خَافَ مَقَامَ رَبِّهِ جنَّتان)\nفقلتُ الثانيةَ: وإِنْ زنى وسرق؟ يَا رَسُولَ اللَّهِ فَقَالَ الثَّالِثَةَ: (وَلِمَنْ خَافَ مَقَامَ رَبِّهِ جَنَّتَانِ)\nفَقُلْتُ الثَّالِثَةَ: وَإِنْ زَنَى وسرق؟ يَا رَسُولَ اللَّهِ قَالَ: «وَإِنْ رَغِمَ أَنْفُ أبي الدَّرْدَاء» . رَوَاهُ أَحْمد","english":{"narrator":"","text":"Abud Darda’ told of his hearing the Prophet delivering a discourse on the pulpit and saying, “He who fears standing before his Lord will have two paradises.” He asked, “Even if he commits fornication and even if he steals, messenger of God?” but he said a second time, “He who fears standing before his Lord will have two paradises.” He asked a second time, “Even if he commits fornication and even if he steals, messenger of God?” and he said a third time, “He who fears standing before his Lord will have two paradises.” He asked a third time, “Even if he commits fornication and even if he steals, messenger of God?” to which he replied, “Even in spite of Abud Darda’.” \n\nAhmad transmitted it."}},{"id":149,"idInBook":149,"chapterId":9,"bookId":14,"arabic":"وَعَنْ عَامِرٍ الرَّامِ قَالَ: بَيْنَا نَحْنُ عِنْدَهُ يَعْنِي عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذْ أَقْبَلَ رَجُلٌ عَلَيْهِ كِسَاءٌ وَفِي يَدِهِ شَيْءٌ قَدِ الْتَفَّ عَلَيْهِ فَقَالَ: يَا رَسُولَ اللَّهِ مَرَرْتُ بَغِيضَةِ شَجَرٍ فَسَمِعْتُ فِيهَا أَصْوَاتَ فِرَاخِ طَائِرٍ فَأَخَذْتُهُنَّ فَوَضَعْتُهُنَّ فِي كِسَائِي فَجَاءَتْ أُمُّهُنَّ فَاسْتَدَارَتْ عَلَى رَأْسِي فَكَشَفْتُ لَهَا عَنْهُنَّ فَوَقَعَتْ عَلَيْهِنَّ فَلَفَفْتُهُنَّ بِكِسَائِي فَهُنَّ أُولَاءِ مَعِي قَالَ: «ضَعْهُنَّ» فَوَضَعْتُهُنَّ وَأَبَتْ أُمُّهُنَّ إِلَّا لُزُومَهُنَّ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" أتعجبون لرحم أم الْفِرَاخ فراخها؟ فو الَّذِي بَعَثَنِي بِالْحَقِّ: لَلَّهُ أَرْحَمُ بِعِبَادِهِ مِنْ أُمِّ الْفِرَاخ بِفِرَاخِهَا ارْجِعْ بِهِنَّ حَتَّى تَضَعَهُنَّ مِنْ حَيْثُ أَخَذْتَهُنَّ وَأُمُّهُنَّ مَعَهُنَّ \". فَرَجَعَ بِهِنَّ. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"‘Amir ar-Ram said:","text":"While we were with him, meaning with the Prophet, a man came forward wearing a garment and carrying something wrapped up in his hand. He said, “Messenger of God, I passed by a thicket of trees in which I heard the chirping of young birds, so I took them and put them in my garment. Their mother came and flew round over my head, so I uncovered them to let her see them, and when she alighted on them I wrapped them all up in my garment, and these are what I have with me.” He gave command to put them down, and I did so,* but their mother would not leave them, whereupon God’s messenger said, “Do you wonder at the pity of the young birds’ mother for her young? By Him who sent me with the truth, God shows more pity towards His servants than the mother of young birds shows to her young. Take them back and put them where you got them, their mother being with them.” So he took them back. \n*The use of the first person seems strange here. The command was given to the man who was holding the bundle, and so one would have expected \"and he did so.\" This is not the kind of sentence in which the change of person frequently used in Arabic style seems natural. As the text stands it would seem that ‘Amir took the bundle from the man and laid it down.\n\nAbu Dawud transmitted it."}},{"id":150,"idInBook":150,"chapterId":9,"bookId":14,"arabic":"عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَ: كُنَّا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي بَعْضِ غَزَوَاتِهِ فَمَرَّ بِقَوْمٍ فَقَالَ: «مَنِ الْقَوْمُ؟» قَالُوا: نَحْنُ الْمُسْلِمُونَ وَامْرَأَةٌ تَحْضِبُ بِقِدْرِهَا وَمَعَهَا ابْنٌ لَهَا فَإِذَا ارْتَفَعَ وَهَجٌ تَنَحَّتْ بِهِ فَأَتَتِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: أَنْتَ رَسُولُ اللَّهِ؟ قَالَ: «نَعَمْ» قَالَتْ: بِأَبِي أَنْتَ وَأُمِّي أَلَيْسَ اللَّهُ أَرْحَمَ الرَّاحِمِينَ؟ قَالَ: «بَلَى» قَالَتْ: أَلَيْسَ اللَّهُ أَرْحَمَ بِعِبَادِهِ مِنَ الْأُم على وَلَدهَا؟ قَالَ: «بَلَى» قَالَتْ: إِنَّ الْأُمَّ لَا تُلْقِي وَلَدَهَا فِي النَّارِ فَأَكَبَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَبْكِي ثُمَّ رَفَعَ رَأْسَهُ إِلَيْهَا فَقَالَ: \n\" إِنَّ اللَّهَ لَا يُعَذِّبُ مِنْ عِبَادِهِ إِلَّا الْمَارِدَ الْمُتَمَرِّدَ الَّذِي يَتَمَرَّدُ عَلَى اللَّهِ وَأَبَى أَنْ يَقُولَ: لَا إِلَهَ إِلَّا الله \". رَوَاهُ ابْن مَاجَه","english":{"narrator":"‘Abdallah b. ‘Umar said:","text":"When we were with the Prophet on one of his expeditions he came upon some people and asked who they were, to which they replied that they were Muslims. A woman who had a son of hers with her was kindling a fire under her pot, and when the heat increased she moved him away. She then went to the Prophet and asked, “Are you God’s messenger?” On his replying that he was, she said, “You for whom I would give my father and mother as ransom, tell me if God is not the most merciful of those who are merciful.” He replied that He certainly is, and she asked, “Is God not more merciful to His servants than a mother to her child?” and when he assured her that He certainly is, she replied that a mother does not cast her child into the fire. God’s messenger then bowed his head and wept, and afterwards raised it, looked at her and said, “God punishes only those of His servants who act audaciously towards Him and refuse to say that there is no god but God.” \n\nIbn Majah transmitted it."}},{"id":151,"idInBook":151,"chapterId":9,"bookId":14,"arabic":"وَعَنْ ثَوْبَانَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" إِنَّ الْعَبْدَ لَيَلْتَمِسُ مَرْضَاةَ اللَّهِ فَلَا يَزَالُ بِذَلِكَ فَيَقُولُ اللَّهُ عَزَّ وَجَلَّ لجبريل: إِن فلَانا عَبدِي يتلمس أَنْ يُرْضِيَنِي أَلَا وَإِنَّ رَحْمَتِي عَلَيْهِ فَيَقُولُ جِبْرِيلُ: رَحْمَةُ اللَّهِ عَلَى فُلَانٍ وَيَقُولُهَا حَمَلَةُ العرشِ ويقولُها مَن حَولهمْ حَتَّى يَقُولُهَا أَهْلُ السَّمَاوَاتِ السَّبْعِ ثُمَّ تَهْبِطُ لَهُ إِلى الأَرْض \". رَوَاهُ أَحْمد","english":{"narrator":"","text":"Thauban reported the Prophet as saying that a servant seeks to please God and keeps on doing so, then God who is great and glorious says to Gabriel, “My servant so and so seeks to please me, therefore my mercy had descended on him.” Gabriel says, “God’s mercy has descended on so and so,” and the bearers of the Throne and those who are around them say it until the inhabitants of the seven heavens say it, after which it comes down to him on the earth. \n\nAhmad transmitted it."}},{"id":152,"idInBook":152,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أُسَامَةَ بْنِ زَيْدٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي قَوْلِ اللَّهِ عَزَّ وَجَلَّ: (فَمِنْهُمْ ظَالِمٌ لِنَفْسِهِ وَمِنْهُمْ مُقْتَصِدٌ وَمِنْهُمْ سابقٌ بالخيراتَ)\nقَالَ: كُلُّهُمْ فِي الْجَنَّةِ \". رَوَاهُ الْبَيْهَقِيُّ فِي كِتَابِ الْبَعْثِ وَالنُّشُورِ","english":{"narrator":"","text":"In connection with God’s words, “Among them are some who wrong themselves, some who follow a middle course, and some who are foremost in good deeds,”  Usama b. Zaid reported the Prophet as saying, “They will all go to paradise.” \n\nBaihaqi transmitted it in Kitab al-ba'th wan-nushur."}},{"id":153,"idInBook":153,"chapterId":9,"bookId":14,"arabic":"عَن عَبْدِ اللَّهِ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَمْسَى قَالَ: «أَمْسَيْنَا وَأَمْسَى الْمُلْكُ لِلَّهِ وَالْحَمْدُ لِلَّهِ وَلَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِ هَذِهِ اللَّيْلَةِ وَخَيْرِ مَا فِيهَا وَأَعُوذُ بِكَ مِنْ شَرِّهَا وَشَرِّ مَا فِيهَا اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكَسَلِ وَالْهَرَمِ وَسُوءِ الْكِبَرِ وَفِتْنَةِ الدُّنْيَا وَعَذَابِ الْقَبْرِ»\nوَإِذَا أَصْبَحَ قَالَ أَيْضًا: «أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ» . وَفِي رِوَايَةٍ: «رَبِّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّار وَعَذَاب فِي الْقَبْر» . رَوَاهُ مُسلم","english":{"narrator":"‘Abdallah told that when evening came God’s messenger would say, \"We have come to the evening, and in the evening the dominion belongs to God; praise be to God; there is no god but God alone who has no partner; to Him belongs the dominion, to Him praise is due, and He is omnipotent. O God, I ask Thee for something of the good of this night and the good of what it contains, and I seek refuge in Thee from its evil and the evil of what it contains. O God, I seek refuge in Thee from indolence, decrepitude, the evil of old age, temptation in this world, and the punishment in the grave.\" In the morning he said that also:","text":"\"We have come to the morning, and in the morning the dominion belongs to God ...\" A version has, \"My Lord, I seek refuge in Thee from a punishment in hell and a punishment in the grave.\" \n\nMuslim transmitted it."}},{"id":154,"idInBook":154,"chapterId":9,"bookId":14,"arabic":"وَعَنْ حُذَيْفَةَ قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَخَذَ مَضْجَعَهُ مِنَ اللَّيْلِ وَضَعَ يَدَهُ تَحْتَ خَدِّهِ ثُمَّ يَقُولُ: «اللَّهُمَّ بِاسْمِكَ أَمُوتُ وَأَحْيَا» . وَإِذَا اسْتَيْقَظَ قَالَ: «الْحَمْدُ الله الَّذِي أَحْيَانًا بَعْدَمَا مَا أماتنا وَإِلَيْهِ النشور» . رَوَاهُ البُخَارِيّ\nوَمُسلم عَن الْبَراء","english":{"narrator":"","text":"Hudhaifa said that when the Prophet lay down on his bed at night he placed his hand under his cheek, and would then say, \"O God, in Thy name I die and live.\" When he awoke he said, \"Praise be to God who has given us life after causing us to die,* and to whom we shall be resurrected.\" \n*Behind this phrase probably lies the idea expressed in Qur’an, xxxix, 42 which says, \"It is God who takes the souls at the time of their death, and those which do not die during their sleep.\"\n\nBukhari transmitted it, Muslim transmitting from al-Bara’."}},{"id":155,"idInBook":155,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" إِذَا أَوَى أَحَدُكُمْ إِلَى فِرَاشِهِ فَلْيَنْفُضْ فِرَاشَهُ بِدَاخِلَةِ إِزَارِهِ فَإِنَّهُ لَا يَدْرِي مَا خَلَفَهُ عَلَيْهِ ثُمَّ يَقُولُ: بِاسْمِكَ رَبِّي وَضَعْتُ جَنْبِي وَبِكَ أرفعه إِن أَمْسَكت نَفسِي فارحمهما وَإِنْ أَرْسَلْتَهَا فَاحْفَظْهَا بِمَا تَحْفَظُ بِهِ عِبَادَكَ الصَّالِحِينَ \". وَفِي رِوَايَةٍ: \" ثُمَّ لْيَضْطَجِعْ عَلَى شِقِّهِ الْأَيْمن ثمَّ ليقل: بِاسْمِك \"\nوَفِي رِوَايَةٍ: «فَلْيَنْفُضْهُ بِصَنِفَةِ ثَوْبِهِ ثَلَاثَ مَرَّاتٍ وَإِن أَمْسَكت نَفسِي فَاغْفِر لَهَا»","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying that when any of them went to bed he should dust his bedding with the inner extremity of his lower garment, for he does not know what has come on to it since he left it. He should then say, “In Thy name, my Lord, I lay down my side and in Thee I raise it up. If Thou keepest my soul have mercy on it, but if Thou lettest it go guard it with that with which Thou guardest Thy upright servants.” A version says that he should then lie down on his right side and say, “In Thy name...” \n\n(Bukhari and Muslim). A version says he should dust it three times with the border of his garment, and has “If Thou keepest my soul grant it pardon.”"}},{"id":156,"idInBook":156,"chapterId":9,"bookId":14,"arabic":"وَعَنِ الْبَرَاءِ بْنِ عَازِبٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَوَى إِلَى فِرَاشِهِ نَامَ عَلَى شِقِّهِ الْأَيْمَنِ ثُمَّ قَالَ: «اللَّهُمَّ أَسْلَمْتُ نَفَسِي إِلَيْكَ وَوَجَّهْتُ وَجْهِي إِلَيْكَ وَفَوَّضْتُ أَمْرِي إِلَيْكَ وَأَلْجَأْتُ ظَهْرِي إِلَيْكَ رَغْبَةً وَرَهْبَةً إِلَيْكَ لَا مَلْجَأَ وَلَا مَنْجَا مِنْكَ إِلَّا إِلَيْكَ آمَنْتُ بِكِتَابِكَ الَّذِي أَنْزَلْتَ وَنَبِيِّكَ الَّذِي أَرْسَلْتَ» . وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ قَالَهُنَّ ثُمَّ مَاتَ تَحْتَ لَيْلَتِهِ مَاتَ عَلَى الْفِطْرَةِ»\nوَفِي رِوَايَةٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِرَجُلٍ: \n\" يَا فُلَانُ إِذَا أَوَيْتَ إِلَى فِرَاشِكَ فَتَوَضَّأْ وُضُوءَكَ لِلصَّلَاةِ ثُمَّ اضْطَجِعْ عَلَى شِقِّكَ الْأَيْمَنِ ثُمَّ قُلِ: اللَّهُمَّ أَسْلَمْتُ نَفَسِي إِلَيْكَ إِلَى قَوْلِهِ: أَرْسَلْتَ \" وَقَالَ: «فَإِنْ مِتَّ مِنْ لَيْلَتِكَ مِتَّ عَلَى الْفِطْرَةِ وإِن أصبحتَ أصبتَ خيرا»","english":{"narrator":"","text":"Al-Bara’ b. ‘Azib said that when God’s messenger went to bed he lay on his right side and then said, “O God, I have handed over my soul to Thee, turned my face to Thee, entrusted my affairs to Thee, and committed my back to Thee out of desire for and fear of Thee. There is no refuge and no place of safety from Thee except by having recourse to Thee. I believe in Thy Book which Thou hast sent down and in Thy Prophet whom Thou hast sent.” God’s messenger said that if anyone repeated these words and died that night, he would die in the true religion. In a version he reported God’s messenger as telling a man to perform the ablution for prayer when he went to bed, lie down on his right side, and say, “O God, I have handed over my soul to Thee . . . Thou hast sent.” He added, “If you die during the night you will die in the true religion, and if you live till the morning you will obtain good.”\n\n(Bukhari and Muslim.)"}},{"id":157,"idInBook":157,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَنَسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا أَوَى إِلَى فِرَاشِهِ قَالَ: «الحمدُ للَّهِ الَّذِي أطعمنَا وَسَقَانَا وكفانا وَآوَانَا فَكَمْ مِمَّنْ لَا كَافِيَ لَهُ وَلَا مؤوي» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Anas told that when God’s messenger went to his bed he said, “Praise be to God who has fed us, given us drink, satisfied us and given us refuge. Many there are who have no one to provide sufficiency for them, or give them refuge.” \n\nMuslim transmitted it."}},{"id":158,"idInBook":158,"chapterId":9,"bookId":14,"arabic":"وَعَن عَليّ: أَن فَاطِمَة أَنْت النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَشْكُو إِلَيْهِ مَا تَلْقَى فِي يَدِهَا مِنَ الرَّحَى وَبَلَغَهَا أَنَّهُ جَاءَهُ رَقِيقٌ فَلَمْ تُصَادِفْهُ فَذَكَرَتْ ذَلِكَ لِعَائِشَةَ فَلَمَّا جَاءَ أَخْبَرَتْهُ عَائِشَةُ قَالَ: فَجَاءَنَا وَقَدْ أَخَذْنَا مَضَاجِعَنَا فَذَهَبْنَا نَقُومُ فَقَالَ: عَلَى مَكَانِكُمَا فَجَاءَ فَقَعَدَ بَيْنِي وَبَيْنَهَا حَتَّى وَجَدْتُ بَرْدَ قَدَمِهِ عَلَى بَطْنِي فَقَالَ: «أَلَا أَدُلُّكُمَا عَلَى خَيْرٍ مِمَّا سَأَلْتُمَا؟ إِذَا أَخَذْتُمَا مَضْجَعَكُمَا فَسَبِّحَا ثَلَاثًا وَثَلَاثِينَ وَاحْمَدَا ثَلَاثًا وَثَلَاثِينَ وَكَبِّرَا ثَلَاثًا وَثَلَاثِينَ فَهُوَ خير لَكمَا من خَادِم»","english":{"narrator":"‘Ali said that Fatima went to the Prophet to complain of the effect of the grinding-stone on her hand, as she had heard that he had acquired some slaves, but did not find him, so she mentioned the matter to ‘A'isha. When he came ‘A'isha informed him. ‘Ali said:","text":"He visited us when we had gone to bed, and when we were about to get up he told us to stay where we were. He then came and sat down between her and me, and I felt the coldness of his foot on my belly. He then said, “Let me guide you to something better than what you have asked. When you go to bed, say ‘Glory be to God’ thirty-three times, ‘Praise be to God’ thirty-three times, and ‘God is most great’ thirty-four times. That will be better for you than a servant.” \n\n(Bukhari and Muslim.)"}},{"id":159,"idInBook":159,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: جَاءَتْ فَاطِمَةُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَسْأَلُهُ خَادِمًا فَقَالَ: «أَلَا أَدُلُّكِ عَلَى مَا هُوَ خَيْرٌ مِنْ خَادِمٍ؟ تُسَبِّحِينَ اللَّهَ ثَلَاثًا وَثَلَاثِينَ وَتَحْمَدِينَ اللَّهَ ثَلَاثًا وَثَلَاثِينَ وَتُكَبِّرِينَ اللَّهَ أَرْبَعًا وَثَلَاثِينَ عِنْدَ كُلِّ صَلَاةٍ وَعِنْدَ مَنَامِكِ» . رَوَاهُ مُسْلِمٌ","english":{"narrator":"","text":"Abu Huraira said that when Fatima went to the Prophet and asked him for a servant, he said, “Let me guide you to something which is better than a servant. You should say ‘Glory be to God thirty-three times, ‘Praise be to God\" thirty-three times, and ‘God is most great’ thirty-four times at each time of prayer and when you go to bed.” \n\nMuslim transmitted it."}},{"id":160,"idInBook":160,"chapterId":9,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَصْبَحَ قَالَ: «اللَّهُمَّ بِكَ أَصْبَحْنَا وَبِكَ أَمْسَيْنَا وَبِكَ نَحْيَا وَبِكَ نَمُوتُ وَإِلَيْكَ الْمَصِيرُ» . وَإِذَا أَمْسَى قَالَ: «اللَّهُمَّ بِكَ أَمْسَيْنَا وَبِكَ أَصْبَحْنَا وَبِكَ نَحْيَا وَبِكَ نَمُوتُ وَإِلَيْكَ النُّشُورُ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُد وَابْن مَاجَه","english":{"narrator":"","text":"Abu Huraira said that God’s messenger would say in the morning, \"O God, by, Thee we come to the morning, by Thee we come to the evening, by Thee we live, by Thee we die, and to Thee do we come.\" In the evening he said, “O God, by Thee we come to the evening, by Thee we come to the morning, by Thee we live, by Thee we die, and to Thee are we resurrected.” \n\nTirmidhi, Abu Dawud and Ibn Majah transmitted it."}},{"id":161,"idInBook":161,"chapterId":9,"bookId":14,"arabic":"وَعنهُ قَالَ: قَالَ أَبُو بَكْرٍ: قُلْتُ يَا رَسُولَ اللَّهِ مُرْنِي بِشَيْءٍ أَقُولُهُ إِذَا أَصْبَحْتُ وَإِذَا أَمْسَيْتُ قَالَ: «قُلِ اللَّهُمَّ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ قُلْهُ إِذَا أَصْبَحْتَ وَإِذَا أَمْسَيْتَ وَإِذَا أَخَذْتَ مضجعك» . رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد والدارمي","english":{"narrator":"","text":"He told how Abu Bakr said he had asked God’s messenger to command him something to say in the morning and the evening, and he had told him to say, “O God, who knowest the unseen and the seen, Creator of the heavens and the earth, Lord and Possessor of everything, I testify that there is no god but Thee; I seek refuge in Thee from the evil within myself, from the evil of the devil and his .”* He instructed him to say it morning and evening, and when he went to bed. \n*The Arabic word may be read either as shirk (attributing a partner to God), or as sharah\n(snare). The former is preferred. Cf. Mirqat, ili, 99.\n\nTirmidhi, Abu Dawud and Darimi transmitted it."}},{"id":162,"idInBook":162,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبَانَ بْنِ عُثْمَانَ قَالَ: سَمِعْتُ أَبِي يَقُولَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا مِنْ عَبْدٍ يَقُولُ فِي صَبَاحِ كُلِّ يَوْمٍ وَمَسَاءِ كُلِّ لَيْلَةٍ بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ ثَلَاثَ مَرَّاتٍ فَيَضُرَّهُ شَيْءٌ» . فَكَانَ أَبَانُ قَدْ أَصَابَهُ طَرَفُ فَالَجٍ فَجَعَلَ الرَّجُلَ يَنْظُرُ إِلَيْهِ فَقَالَ لَهُ أَبَانُ: مَا تَنْظُرُ إِلَيَّ؟ أَمَا إِنَّ الْحَدِيثَ كَمَا حَدَّثْتُكَ وَلَكِنِّي لَمْ أَقُلْهُ يَوْمَئِذٍ لِيُمْضِيَ اللَّهُ عَلَيَّ قَدَرَهُ. رَوَاهُ التِّرْمِذِيُّ وَابْن مَاجَه وَأَبُو دَاوُد وَفِي رِوَايَته: «لَمْ تُصِبْهُ فُجَاءَةُ بَلَاءٍ حَتَّى يُصْبِحَ وَمَنْ قَالَهَا حِينَ يُصْبِحُ لَمْ تُصِبْهُ فُجَاءَةُ بَلَاءٍ حَتَّى يُمسيَ»","english":{"narrator":"","text":"Aban b. ‘Uthman said he heard his father quoting God’s messenger as saying that if anyone says three times every morning and evening, “In the name of God, when whose name is mentioned nothing in earth or heaven can cause harm, and He is the Hearer, the Knower,” he will not be harmed by anything. Aban was afflicted by some paralysis, and when a man began to look at him Aban would say, “Why are you looking at me? The tradition is as I told it to you, but I did not say the words that day in order that God might carry out what He had decreed for me.” \n\nTirmidhi, Ibn Majah and Abu Dawud transmitted it. Abu Dawud’s version has, “He will not suffer sudden affliction till the morning, and if anyone says it in the morning he will not suffer sudden affliction till the evening.”"}},{"id":163,"idInBook":163,"chapterId":9,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ إِذَا أَمْسَى: «أَمْسَيْنَا وَأَمْسَى الْمُلْكُ لِلَّهِ وَالْحَمْدُ لِلَّهِ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ رَبِّ أَسْأَلُكَ خَيْرَ مَا فِي هَذِهِ اللَّيْلَةِ وَخَيْرَ مَا بَعْدَهَا وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذِهِ اللَّيْلَةِ وَشَرِّ مَا بَعْدَهَا رَبِّ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَمِنْ سُوءِ الْكِبَرِ أَوِ الْكُفْرِ» . وَفِي رِوَايَةٍ: «مِنْ سُوءِ الْكِبَرِ وَالْكِبْرِ رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ» . وَإِذَا أَصْبَحَ قَالَ ذَلِكَ أَيْضًا: «أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ» . رَوَاهُ أَبُو دَاوُدَ وَالتِّرْمِذِيُّ وَفِي رِوَايَتِهِ لم يذكر: «من سوءِ الكفرِ»","english":{"narrator":"‘Abdallah  said that the Prophet used to say in the evening, “We have come to the evening, and in the evening the dominion belongs to God; praise be to God; there is no god but God alone who has no partner; to Him belongs the dominion, to Him praise is due, and He is omnipotent. My Lord, I ask Thee for the good of what this night contains and the good of what comes after it; I seek refuge in Thee from the evil of what this night contains and the evil of what comes after it; my Lord, I seek refuge in Thee from indolence and from the evil of old age, or infidelity.\"* A version has, \"From the evil of old age and pride. My Lord, I seek refuge in Thee from a punishment in hell and a punishment in the grave.\" In the morning he said that also:","text":"\"We have come to the morning, and in the morning the dominion belongs to God...\"\n*The transmitter was not sure which word was used.\n\nAbu Dawud and Tirmidhi transmitted it. Tirmidhi did not mention \"from the evil of infidelity\" in his version."}},{"id":164,"idInBook":164,"chapterId":9,"bookId":14,"arabic":"وَعَنْ بَعْضِ بَنَاتِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُعَلِّمُهَا فَيَقُولُ: \n\" قُولِي حِينَ تُصْبِحِينَ: سُبْحَانَ اللَّهِ وَبِحَمْدِهِ وَلَا قُوَّةَ إِلَّا بِاللَّهِ مَا شَاءَ اللَّهُ كَانَ وَمَا لَمْ يَشَأْ لَمْ يَكُنْ أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا فَإِنَّهُ مَنْ قَالَهَا حِينَ يُصْبِحُ حُفِظَ حَتَّى يُمْسِيَ وَمَنْ قَالَهَا حِينَ يُمْسِي حُفِظَ حَتَّى يصبح \". رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"One of the Prophet's daughters said that he used to teach her, telling her to say in the morning, \"Glory be to God, and I begin with praise of Him; there is no power but in God; what God wills comes to pass, and what He does not will does not come to pass; I know that God is omnipotent and that God has comprehended everything in knowledge;\" for whoever says it in the morning will be guarded till the evening, and whoever says it in the evening will be guarded till the morning. \n\nAbu Dawud transmitted it."}},{"id":165,"idInBook":165,"chapterId":9,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" مَنْ قَالَ حِينَ يُصْبِحُ: (فَسُبْحَانَ اللَّهِ حِينَ تُمْسُونَ وَحِينَ تُصْبِحُونَ ولهُ الحمدُ فِي السمواتِ والأرضِ وعشيَّاً وحينَ تُظهرون)\nإِلى قَوْله: (وَكَذَلِكَ تُخْرَجونَ)\nأَدْرَكَ مَا فَاتَهُ فِي يَوْمِهِ ذَلِكَ وَمَنْ قَالَهُنَّ حِينَ يُمْسِي أَدْرَكَ مَا فَاتَهُ فِي ليلتِهِ \". رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Ibn ‘Abbas reported God’s messenger as saying that if anyone repeats in the morning, \"So glory be to God in the evening and in the morning; to Him is the praise in the heavens and the earth; and in the late evening and at noon .. . thus shall you be brought forth,\"  he will get that day what he has missed; and if anyone repeats these words in the evening he will get that night what he has missed. \n\nAbu Dawud transmitted it."}},{"id":166,"idInBook":166,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي عَيَّاشٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" مَنْ قَالَ إِذَا أَصْبَحَ: لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ كَانَ لَهُ عَدْلُ رَقَبَةٍ مِنْ وَلَدِ إِسْمَاعِيلَ وَكُتِبَ لَهُ عَشْرُ حَسَنَاتٍ وَحَطَّ عَنْهُ عَشْرَ سَيِّئَاتٍ وَرفع عَشْرُ دَرَجَاتٍ وَكَانَ فِي حِرْزٍ مِنَ الشَّيْطَانِ حَتَّى يُمْسِيَ وَإِنْ قَالَهَا إِذَا أَمْسَى كَانَ لهُ مثلُ ذَلِك حَتَّى يُصبحَ \". قَالَ حَمَّاد بن سَلمَة: فَرَأَى رَجُلٌ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيمَا يَرَى النَّائِمُ فَقَالَ: يَا رَسُولَ اللَّهِ إِنَّ أَبَا عَيَّاشٍ يُحَدِّثُ عَنْكَ بِكَذَا وَكَذَا قَالَ: «صَدَقَ أَبُو عَيَّاشٍ» . رَوَاهُ أَبُو دَاوُد وَابْن مَاجَه","english":{"narrator":"","text":"Abu ‘Ayyash reported God's messenger as saying that if anyone says in the morning, “There is no god but God alone who has no partner; to Him belongs the dominion, to Him praise is due, and He is omnipotent,” he will have a reward equivalent to that for setting free a slave from among the descendants of Ishmael, will have ten good deeds recorded for him, will have ten evil deeds deducted from him, will be advanced ten degrees, and will be guarded from the devil till the evening. If he says them in the evening he will have a similar recompense till the morning. Hammad b. Salama said that a man saw God’s messenger in a dream and said, “Messenger of God, Abu ‘Ayyash is relating such and such on your authority,” to which he received the reply, “Abu ‘Ayyash has spoken the truth.” \n\nAbu Dawud and Ibn Majah transmitted it."}},{"id":167,"idInBook":167,"chapterId":9,"bookId":14,"arabic":"وَعَنِ الْحَارِثِ بْنِ مُسْلِمٍ التَّمِيمِيِّ عَنْ أَبِيهِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ أَسَرَّ إِلَيْهِ فَقَالَ: «إِذَا انْصَرَفْتَ مِنْ صَلَاةِ الْمَغْرِبِ فَقُلْ قَبْلَ أَنْ تُكَلِّمَ أَحَدًا اللَّهُمَّ أَجِرْنِي مِنَ النَّارِ سَبْعَ مَرَّاتٍ فَإِنَّكَ إِذَا قُلْتَ ذَلِكَ ثُمَّ مِتَّ فِي لَيْلَتِكَ كُتِبَ لَكَ جَوَازٌ مِنْهَا» . رَوَاهُ أَبُو دَاوُدَ","english":{"narrator":"","text":"Al-Harith b. Muslim at-Tamimi quoted his father as saying that God’s messenger told him secretly to say seven times when he had finished the sunset prayer, before speaking to anyone, “O God, protect me from hell”; for if he said that and died that night, exemption from it would be recorded for him. He also told him to say that when he had prayed the morning prayer, for if he died that day, exemption from it would be recorded for him. \n\nAbu Dawud transmitted it."}},{"id":168,"idInBook":168,"chapterId":9,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: لَمْ يَكُنْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَعُ هَؤُلَاءِ الْكَلِمَاتِ حِينَ يُمْسِي وَحِينَ يُصْبِحُ: «اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَايَ وَأَهْلِي وَمَالِي اللَّهُمَّ اسْتُرْ عَوْرَاتِي وَآمِنْ رَوْعَاتِي اللَّهُمَّ احْفَظْنِي مِنْ بَيْنِ يَدِي وَمِنْ خَلْفِي وَعَنْ يَمِينِي وَعَنْ شِمَالِي وَمِنْ فَوْقِي وَأَعُوذُ بِعَظَمَتِكَ أَن أُغتالَ من تحتي» . قَالَ وَكِيع يَعْنِي الْخَسْف رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Ibn ‘Umar said that God’s messenger never failed to use these words evening and morning, “O God, I ask Thee for security in this world and the next; O God, I ask Thee for forgiveness and security in my religion and my worldly affairs, in my family and my property; O God, conceal my faults  and keep me safe from the things which I fear; O God, guard me in front of me and behind me, on my right hand and on my left, and from above me; and I seek refuge in Thy greatness from receiving unexpected harm from below me.” Waki‘ said he meant being swallowed up by the earth. \n\nAbu Dawud transmitted it."}},{"id":169,"idInBook":169,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" مَنْ قَالَ حِينَ يُصْبِحُ: اللَّهُمَّ أَصْبَحْنَا نُشْهِدُكَ وَنُشْهِدُ حَمَلَةَ عَرْشِكَ وَمَلَائِكَتَكَ وَجَمِيعَ خَلْقِكَ أَنَّكَ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ وَحْدَكَ لَا شَرِيكَ لَكَ وَأَنَّ مُحَمَّدًا عَبْدُكَ وَرَسُولُكَ إِلَّا غَفَرَ اللَّهُ لَهُ مَا أَصَابَهُ فِي يَوْمِهِ ذَلِكَ مِنْ ذَنْبٍ \". رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيث غَرِيب","english":{"narrator":"","text":"Anas reported God's messenger as saying that if anyone says in the morning, “O God, in the morning we call Thee, the bearers of Thy Throne, Thy angels and all Thy creatures to witness that Thou art God than whom alone there is no god, being without a partner, and that Muhammad is Thy servant and messenger,” God will forgive him any sins he commits that day; and if he says it in the evening, God will forgive him any sins he commits that night. \n\nTirmidhi and Abu Dawud transmitted it, Tirmidhi saying this is a gharib tradition."}},{"id":170,"idInBook":170,"chapterId":9,"bookId":14,"arabic":"وَعَنْ ثَوْبَانَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا مِنْ عَبْدٍ مُسْلِمٍ يَقُولُ إِذَا أَمْسَى وَإِذَا أَصْبَحَ ثَلَاثًا رَضِيتُ بِاللَّهِ رَبًّا وَبِالْإِسْلَامِ دِينًا وَبِمُحَمَّدٍ نَبِيًّا إِلَّا كَانَ حَقًّا عَلَى اللَّهِ أَنْ يُرْضِيَهُ يَوْمَ الْقِيَامَة» . رَوَاهُ أَحْمد وَالتِّرْمِذِيّ","english":{"narrator":"","text":"Thauban reported God’s messenger as saying that if any Muslim says three times evening and morning, \"I am pleased with God as Lord, with Islam as religion, and with Muhammad as Prophet,\" God will certainly please him on the day of resurrection. \n\nAhmad and Tirmidhi transmitted it."}},{"id":171,"idInBook":171,"chapterId":9,"bookId":14,"arabic":"وَعَنْ حُذَيْفَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا أَرَادَ أَنْ يَنَامَ وَضَعَ يَدَهُ تَحْتَ رَأْسِهِ ثُمَّ قَالَ: «اللَّهُمَّ قِنِي عَذَابَكَ يَوْمَ تَجْمَعُ عِبَادَكَ أَوْ تَبْعَثُ عِبَادَكَ» . رَوَاهُ التِّرْمِذِيّ\nوَرَوَاهُ أَحْمد عَن الْبَراء","english":{"narrator":"","text":"Hudhaifa said that when the Prophet wanted to go to sleep he placed his hand under his head and said, \"O God, guard me from thy punishment on the day when Thou gatherest Thy servants,\" or \"raisest up Thy servants.\" \n\nTirmidhi transmitted it, and Ahmad gave al-Bara’ as his authority."}},{"id":172,"idInBook":172,"chapterId":9,"bookId":14,"arabic":"وَعَن حَفصةَ رَضِيَ اللَّهُ عَنْهَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا أَرَادَ أَنْ يَرْقُدَ وَضَعَ يَدَهُ الْيُمْنَى تَحْتَ خَدِّهِ ثُمَّ يَقُولُ: «اللَّهُمَّ قِنِي عَذَابَكَ يَوْمَ تَبْعَثُ عِبَادَكَ» . ثَلَاثَ مَرَّاتٍ رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Hafsa said that when God’s messenger wanted to go to sleep he put his right hand under his cheek, and would then say three times, \"O God, guard me from Thy punishment on the day when Thou raisest up Thy servants.\" \n\nAbu Dawud transmitted it."}},{"id":173,"idInBook":173,"chapterId":9,"bookId":14,"arabic":"وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ عِنْدَ مَضْجَعِهِ: «اللَّهُمَّ إِنِّي أَعُوذُ بِوَجْهِكَ الْكَرِيمِ وَكَلِمَاتِكَ التَّامَّاتِ مِنْ شَرِّ مَا أَنْتَ آخِذٌ بناصيتهِ اللهُمَّ أَنْت تكشِفُ المغرمَ والمأْثمَ اللهُمَّ لَا يُهْزَمُ جُنْدُكَ وَلَا يُخْلَفُ وَعْدُكَ وَلَا يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ سُبْحَانَكَ وَبِحَمْدِكَ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"‘Ali reported that God’s messenger used to say when he lay down, \"O God, I seek refuge in Thy noble Person and in Thy perfect words from the evil of what Thou seizest by its forelock; O God, Thou removest debt and sin; O God, Thy troop is not routed, Thy promise is not broken, and the riches of the rich do not avail against Thee. Glory and praise be unto Thee.\" \n\nAbu Dawud transmitted it."}},{"id":174,"idInBook":174,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" مَنْ قَالَ حِينَ يَأْوِي إِلَى فِرَاشِهِ: أَسْتَغْفِرُ اللَّهَ الَّذِي لَا إِله إِلا هوَ الحيَّ القيومَ وأتوبُ إِليهِ ثَلَاثَ مَرَّاتٍ غَفَرَ اللَّهُ لَهُ ذُنُوبُهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ أَوْ عَدَدَ رَمْلِ عَالَجٍ أَوْ عَدَدَ وَرَقِ الشَّجَرِ أَوْ عَدَدَ أَيَّامِ الدُّنْيَا \". رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ غَرِيب","english":{"narrator":"","text":"Abu Sa'id reported God's messenger as saying that if anyone says three times when going to bed, \"I ask the forgiveness of God than whom there is no god, the Living, the Eternal, and I turn in repentance to Him,\" God will forgive him his sins, even if they are like the foam of the sea, or in number like the sand which is accumulated,* or as many as the leaves of the trees, or as numerous as the days of this world.\n*The word is ‘alij. Some say ‘Alij is a place in the desert, the translation being ‘the sand of ‘Alij; others treat it as translated above.\n\nTirmidhi transmitted it, saying this is a gharib tradition."}},{"id":175,"idInBook":175,"chapterId":9,"bookId":14,"arabic":"وَعَنْ شَدَّادِ بْنِ أَوْسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «مَا من مُسْلِمٍ يَأْخُذُ مَضْجَعَهُ بِقِرَاءَةِ سُورَةٍ مِنْ كِتَابِ اللَّهِ إِلَّا وَكَّلَ اللَّهُ بِهِ مَلَكًا فَلَا يَقْرَبُهُ شَيْءٌ يُؤْذِيهِ حَتَّى يَهُبَّ مَتَى هَبَّ» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Shaddad b. Aus reported God’s messenger as saying, \"If any Muslim recites a sura from God’s Book when he goes to bed, God will put an angel in charge of him, and nothing which may harm him will come near him till he wakes\". \n\nTirmidhi transmitted it."}},{"id":176,"idInBook":176,"chapterId":9,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «خَلَّتَانِ لَا يُحْصِيهِمَا رَجُلٌ مُسْلِمٌ إِلَّا دَخَلَ الْجَنَّةَ أَلَا وَهُمَا يَسِيرٌ وَمَنْ يَعْمَلُ بِهِمَا قَلِيلٌ يُسَبِّحُ اللَّهَ فِي دُبُرِ كُلِّ صَلَاةٍ عَشْرًا وَيَحْمَدُهُ عَشْرًا ويكبِّرهُ عَشراً» قَالَ: فَأَنَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعْقِدُهَا بِيَدِهِ قَالَ: «فَتِلْكَ خَمْسُونَ وَمِائَةٌ فِي اللِّسَان وَأَلْفٌ وَخَمْسُمِائَةٍ فِي الْمِيزَانِ وَإِذَا أَخَذَ مَضْجَعَهُ يُسَبِّحُهُ وَيُكَبِّرُهُ وَيَحْمَدُهُ مِائَةً فَتِلْكَ مِائَةٌ بِاللِّسَانِ وَأَلْفٌ فِي الْمِيزَانِ فَأَيُّكُمْ يَعْمَلُ فِي الْيَوْمِ وَاللَّيْلَةِ أَلْفَيْنِ وَخَمْسَمِائَةِ سَيِّئَةٍ؟» قَالُوا: وَكَيْفَ لَا نُحْصِيهَا؟ قَالَ: \" يَأْتِي أَحَدَكُمُ الشَّيْطَانُ وَهُوَ فِي صِلَاتِهِ فَيَقُولُ: اذْكُرْ كَذَا اذْكُرْ كَذَا حَتَّى يَنْفَتِلَ فَلَعَلَّهُ أَنْ لَا يَفْعَلَ وَيَأْتِيهِ فِي مَضْجَعِهِ فَلَا يَزَالُ يُنَوِّمُهُ حَتَّى يَنَامَ \". رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالنَّسَائِيُّ وَفِي رِوَايَةِ أَبِي دَاوُدَ قَالَ: «خَصْلَتَانِ أَوْ خَلَّتَانِ لَا يُحَافِظُ عَلَيْهِمَا عَبْدٌ مُسْلِمٌ» . وَكَذَا فِي رِوَايَتِهِ بَعْدَ قَوْلِهِ: «وَأَلْفٌ وَخَمْسُمِائَةٍ فِي الْمِيزَانِ» قَالَ: «وَيُكَبِّرُ أَرْبَعًا وَثَلَاثِينَ إِذَا أَخَذَ مَضْجَعَهُ» وَيَحْمَدُ ثَلَاثًا وَثَلَاثِينَ وَيُسَبِّحُ ثَلَاثًا وَثَلَاثِينَ \". وَفِي أَكْثَرِ نُسَخِ المصابيح عَن: عبد الله بن عمر","english":{"narrator":"","text":"‘Abdallah b. ‘Amr b. al-‘As reported God’s messenger as saying there are two characteristics which will not be retained by any Muslim without his entering paradise. While they are easy, those who act upon them are few. One should say ‘Glory be to God’ ten times after every prayer, ‘Praise be to God’ ten times and ‘God is most great’ ten times. (He said he had seen God’s messenger counting them on his hand, and saying, “That is a hundred and fifty on the tongue, but one thousand five hundred in the scale”). When he goes to his bed he should say ‘Glory be to God,’ ‘God is most Great’ and ‘Praise be to God’ a hundred times, for that is a hundred on the tongue, but a thousand in the scale. He asked them which of them could commit two thousand five hundred sins in a day and a night.* He was asked how they could not retain these characteristics, and told them that the devil comes to a man while he is engaged in prayer, calling such and such and such and such to his memory until he turns away and perhaps may not do it. He also comes to him on his bed and keeps on making him sleep till he falls asleep.\n*The thousand plus the preceding fifteen hundred make two thousand five hundred good deeds with which the man who observes the two characteristics mentioned is credited, and as one could hardly commit as many sins in a day and a night there is a balance in his favour.\n\nTirmidhi, Abu Dawud and Nasa’i transmitted it. In Abu Dawud's version he said, “Two qualities or two characteristics will not be adhered to by a Muslim ...” And also in his version after saying “One thousand five hundred in the scale” he said, “When he goes to his bed he should say ‘God is most great’ thirty-four times, ‘Praise be to God’ thirty-three times and ‘Glory be to God’ thirty-three times.” In most texts of al-Masabih it is given on the authority of ‘Abdallah b. ‘Umar."}},{"id":177,"idInBook":177,"chapterId":9,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ غَنَّامٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: \n\" من قَالَ حِينَ يُصْبِحُ: اللَّهُمَّ مَا أَصْبَحَ بِي مِنْ نِعْمَةٍ أَوْ بِأَحَدٍ مِنْ خَلْقِكَ فَمِنْكَ وَحْدَكَ لَا شَرِيكَ لَكَ فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ فَقَدْ أَدَّى شُكْرَ يَوْمِهِ وَمَنْ قَالَ مِثْلَ ذَلِكَ حِينَ يُمْسِي فَقَدْ أَدَّى شُكْرَ ليلته \". رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"‘Abdallah b. Ghannam reported God’s messenger as saying, that if anyone says in the morning, \"O God, whatever favour has come to me or to any of Thy creatures in the morning, it comes from Thee alone who hast no partner, to whom be praise and thanksgiving,\" he will have expressed full thanksgiving for the day; and if anyone says the same in the evening he will have expressed full thanksgiving for the night.\n\nAbu Dawud transmitted it."}},{"id":178,"idInBook":178,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ يَقُولُ إِذَا أَوَى إِلَى فِرَاشِهِ: «اللَّهُمَّ رَبَّ السَّمَاوَاتِ وَرَبَّ الْأَرْضِ وَرَبَّ كُلِّ شَيْءٍ فَالِقَ الْحَبِّ وَالنَّوَى مُنْزِلَ التوراةِ والإِنجيل والقرآنِ أعوذُ بِكَ مِنْ شَرِّ كُلِّ ذِي شَرٍّ أَنْتَ آخِذٌ بِنَاصِيَتِهِ أَنْتَ الْأَوَّلُ فَلَيْسَ قَبْلَكَ شَيْءٌ وَأَنْتَ الْآخِرُ فَلَيْسَ بَعْدَكَ شَيْءٌ وَأَنْتَ الظَّاهِرُ فَلَيْسَ فَوْقَكَ شَيْءٌ وَأَنْتَ الْبَاطِنُ فَلَيْسَ دُونَكَ شَيْءٌ اقْضِ عَنِّي الدَّيْنَ وَاغْنِنِي مِنَ الْفَقْرِ» . رَوَاهُ أَبُو دَاوُدَ وَالتِّرْمِذِيُّ وَابْنُ مَاجَهْ وَرَوَاهُ مُسلم مَعَ اخْتِلَاف يسير","english":{"narrator":"","text":"Abu Huraira told that when the Prophet went to his bed he used to say, “O God, Lord of the heavens, Lord of the earth, Lord of everything, who splittest the grain and the kernel, who hast sent down the Torah, the Injil and the Qur’an, I seek refuge in Thee from the evil of every evil agent whose forelock Thou seizest. Thou art the First and there is nothing before Thee; Thou art the Last and there is nothing after Thee; Thou art the Outward and there is nothing above Thee; Thou art the Inward and there is nothing below Thee. Pay the debt for me and grant me riches instead of poverty.” \n\nAbu Dawud, Tirmidhi and Ibn Majah transmitted it. Muslim also transmitted it with a slight difference."}},{"id":179,"idInBook":179,"chapterId":9,"bookId":14,"arabic":"وَعَن أبي الْأَزْهَر الأيماري أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا أَخَذَ مَضْجَعَهُ مِنَ اللَّيْلِ قَالَ: «بسمِ اللَّهِ وضعْتُ جَنْبي للَّهِ اللَّهُمَّ اغْفِرْ لِي ذَنْبِي وَاخْسَأْ شَيْطَانِي وَفُكَّ رِهَانِي وَاجْعَلْنِي فِي النَّدِيِّ الْأَعْلَى» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Abul Azhar al-Aimari told that when God’s messenger went to his bed at night he said, “In the name of God. I have laid down my side for God. O God, forgive me my sin, drive away my devil, free me from my responsibility, and place me in the highest assembly.” \n\nAbu Dawud transmitted it."}},{"id":180,"idInBook":180,"chapterId":9,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا أَخَذَ مَضْجَعَهُ مِنَ اللَّيْلِ قَالَ: «الْحَمْدُ لِلَّهِ الَّذِي كَفَانِي وَآوَانِي وَأَطْعَمَنِي وَسَقَانِي وَالَّذِي مَنَّ عَلَيَّ فَأَفْضَلَ وَالَّذِي أَعْطَانِي فَأَجْزَلَ الْحَمْدُ لِلَّهِ عَلَى كُلِّ حَالٍ اللَّهُمَّ رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ وَإِلَهَ كُلِّ شَيْءٍ أَعُوذُ بِكَ مِنَ النَّارِ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Ibn ‘Umar told that when God’s messenger went to his bed at night he said, “Praise be to God who has given me sufficiency, has guarded me, given me food and drink, been most gracious to me, and given to me most lavishly. Praise be to God in every circumstance. O God, Lord and King of everything, God of everything, I seek refuge in Thee from hell.” \n\nAbu Dawud transmitted it."}},{"id":181,"idInBook":181,"chapterId":9,"bookId":14,"arabic":"وَعَنْ بُرَيْدَةَ قَالَ: شَكَا خَالِدُ بْنُ الْوَلِيدِ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُول الله مَا أَنَام من اللَّيْلَ مِنَ الْأَرَقِ فَقَالَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" إِذَا أَوَيْتَ إِلَى فِرَاشِكَ فَقُلْ: اللَّهُمَّ رَبَّ السَّمَاوَاتِ السَّبْعِ وَمَا أَظَلَّتْ وَرَبَّ الْأَرَضِينَ وَمَا أَقَلَّتْ وَرَبَّ الشَّيَاطِينِ وَمَا أَضَلَّتْ كُنْ لِي جَارًا مِنْ شَرِّ خَلْقِكَ كُلِّهِمْ جَمِيعًا أَنْ يَفْرُطَ عَلَيَّ أَحَدٌ مِنْهُمْ أَوْ أَنْ يَبْغِيَ عَزَّ جَارُكَ وَجَلَّ ثَنَاؤُكَ وَلَا إِلَهَ غَيْرُكَ لَا إِلَهَ إِلَّا أَنْتَ \". رَوَاهُ التِّرْمِذِيُّ وَقَالَ هَذَا حَدِيثٌ لَيْسَ إِسْنَادُهُ بِالْقَوِيّ والحكَمُ بن ظُهيرٍ الرَّاوِي قد ترَكَ حديثَهُ بعضُ أهل الحَدِيث","english":{"narrator":"","text":"Buraida said that Khalid b. al-Walid complained to God’s messenger that he was afflicted by sleeplessness at night, and God’s Prophet told him to say when he went to his bed, “O God, Lord of the seven heavens and what they overshadow, Lord of the earths and what they carry, Lord of the devils and what they lead astray, be a Protector to me from the evil of Thy entire creation lest any of them do evil or act wrongfully to me. Strong is Thy protection and glorious is Thy praise. There is no god other than Thee. There is no god but Thee.”\n\nTirmidhi transmitted it, saying this is a tradition whose isnad is not strong, and the traditions of al-Hakam b. Zuhair, the transmitter, are abandoned by some traditionists."}},{"id":182,"idInBook":182,"chapterId":9,"bookId":14,"arabic":"وَعَن أَبِي مَالِكٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" إِذَا أَصْبَحَ أَحَدُكُمْ فَلْيَقُلْ: أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ رَبِّ الْعَالَمِينَ اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ هَذَا الْيَوْمِ فَتْحَهُ وَنَصْرَهُ وَنُورَهُ وَبِرْكَتَهُ وَهُدَاهُ وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِيهِ وَمِنْ شَرِّ مَا بَعْدَهُ ثُمَّ إِذَا أَمْسَى فَلْيَقُلْ مِثْلَ ذَلِكَ \". رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Abu Malik reported God’s messenger as saying that when one got up in the morning he should say, \"We have reached the morning, and in the morning the dominion belongs to God, the Lord of the universe, O God, I ask Thee for the good this day contains, for conquest, victory, light, blessing and guidance during it; and I seek refuge in Thee from the evil it contains and the evil contained in what comes after it.\" In the evening he should say the like. \n\nAbu Dawud transmitted it."}},{"id":183,"idInBook":183,"chapterId":9,"bookId":14,"arabic":"وَعَنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرَةَ قَالَ: قُلْتُ لِأَبِي: يَا أَبَتِ أَسْمَعُكَ تَقُولُ كُلَّ غَدَاةٍ: «اللَّهُمَّ عَافِنِي فِي بَدَنِي اللَّهُمَّ عَافِنِي فِي سَمْعِي اللَّهُمَّ عَافِنِي فِي بَصَرِي لَا إِلَهَ إِلَّا أَنْتَ» تُكَرِّرُهَا ثَلَاثًا حِينَ تُصْبِحُ وَثَلَاثًا حِين تمسي فَقَالَ: يَا بُنَيَّ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدْعُو بِهِنَّ فَأَنَا أُحِبُّ أَنْ أستن بسننه. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"‘Abd ar-Rahman b. Abu Bakra said that he remarked to his father that he had heard him say every morning, “O God, grant me soundness in my body; O God, grant me soundness in my hearing; O God, grant me soundness in my sight. There is no god but Thee and that he repeated it three times morning and evening. He replied, \"Sonny, I heard God’s messenger using these words as a supplication and I like to follow his practice.\" \n\nAbu Dawud transmitted it."}},{"id":184,"idInBook":184,"chapterId":9,"bookId":14,"arabic":"وَعَنْ عَبْدُ اللَّهِ بْنِ أَبِي أَوْفَى قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَصْبَحَ قَالَ: «أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ وَالْحَمْدُ لِلَّهِ وَالْكِبْرِيَاءُ وَالْعَظَمَةُ لِلَّهِ وَالْخَلْقُ وَالْأَمْرُ وَاللَّيْلُ وَالنَّهَارُ وَمَا سَكَنَ فِيهِمَا لِلَّهِ اللَّهُمَّ اجْعَلْ أَوَّلَ هَذَا النَّهَارِ صَلَاحًا وَأَوْسَطَهُ نَجَاحًا وَآخِرَهُ فَلَاحًا يَا أَرْحَمَ الرَّاحِمِينَ» . ذَكَرَهُ النَّوَوِيُّ فِي كِتَابِ الْأَذْكَارِ بِرِوَايَةِ ابْنِ السّني","english":{"narrator":"","text":"‘Abdallah b. Abu Aufa told that God’s messenger said in the morning, \"We have reached the morning, and in the morning the dominion belongs to God; praise is due to God; majesty and might belong to God; the creation, the command, night and day and what is at rest by night and day belong to God. O God, make the beginning of this day uprightness, its middle success, and its end attainment, O most merciful among those who show mercy.\" \n\nNawawi mentioned it in Kitab al-adhkar by the transmission of Ibn as-Sunni."}},{"id":185,"idInBook":185,"chapterId":9,"bookId":14,"arabic":"وَعَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا أَصْبَحَ: «أَصْبَحْنَا عَلَى فِطْرَةِ الْإِسْلَامِ وَكَلِمَةِ الْإِخْلَاصِ وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَى مِلَّةِ أَبِينَا إِبْرَاهِيمَ حَنِيفًا وَمَا كَانَ مِنَ الْمُشْرِكِينَ» . رَوَاهُ أَحْمَدُ وَالدَّارِمِيُّ","english":{"narrator":"","text":"‘Abd ar-Rahman b. Abza told that God's messenger used to say in the morning, “We have reached the morning following the original religion of Islam, the assertion of God’s unity, the religion of our Prophet Muhammad, and the rite of our father Abraham who was a hanif and was not one of the polytheists.\"  \n\nAhmad and Darimi transmitted it."}},{"id":186,"idInBook":186,"chapterId":9,"bookId":14,"arabic":"عَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" لَوْ أَنَّ أَحَدَكُمْ إِذَا أَرَادَ أَنْ يَأْتِيَ أَهْلَهُ قَالَ: بِسْمِ اللَّهِ اللَّهُمَّ جَنِّبْنَا الشَّيْطَانَ وَجَنِّبِ الشَّيْطَانَ مَا رَزَقْتَنَا فَإِنَّهُ إِنْ يُقَدَّرْ بَيْنَهُمَا وَلَدٌ فِي ذَلِكَ لَمْ يَضُرَّهُ شَيْطَانٌ أَبَدًا \"","english":{"narrator":"","text":"Ibn ‘Abbas reported God’s messenger as saying that if anyone who means to have intercourse with his wife says, “In the name of God. O God, keep us away from the devil and keep the devil away from what Thou hast provided us,” should it be ordained that a child be born to them thereby, no devil will ever harm it. \n\n(Bukhari and Muslim.)"}},{"id":187,"idInBook":187,"chapterId":9,"bookId":14,"arabic":"وَعَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ عِنْدَ الْكَرْبِ: «لَا إِلَهَ إِلَّا اللَّهُ الْعَظِيمُ الْحَلِيمُ لَا إِلَهَ إِلَّا اللَّهُ رَبُّ الْعَرْشِ الْعَظِيمِ لَا إِلَهَ إِلَّا اللَّهُ رَبُّ السَّمَاوَاتِ وَرَبُّ الْأَرْضِ رَبُّ الْعَرْشِ الْكَرِيم»","english":{"narrator":"","text":"He told that God’s messenger used to say when he was anxious “There is no god but God, the Incomparably Great, the Clement; there is no god but God, the Lord of the mighty Throne; there is no god but God, the Lord of the heavens, the Lord of the earth, and the Lord of the noble Throne.” \n\n(Bukhari and Muslim.)"}},{"id":188,"idInBook":188,"chapterId":9,"bookId":14,"arabic":"وَعَنْ سُلَيْمَانَ بْنِ صُرَدَ قَالَ: اسْتَبَّ رَجُلَانِ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ عِنْدَهُ جُلُوسٌ وَأَحَدُهُمَا يَسُبُّ صَاحِبَهُ مُغْضَبًا قَدِ احْمَرَّ وَجْهُهُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنِّي لَأَعْلَمُ كَلِمَةً لَوْ قَالَهَا لَذَهَبَ عَنْهُ مَا يَجِدُ أَعُوذُ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيمِ» . فَقَالُوا لِلرَّجُلِ: لَا تَسْمَعُ مَا يَقُولُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ؟ قَالَ: إِنِّي لستُ بمجنون","english":{"narrator":"Sulaiman b. Surad said:","text":"Two men reviled one another in the Prophet’s presence when we were sitting near him, and when one of them who had become red in the face reviled the other angrily the Prophet said that he knew a phrase by repeating which the man could get rid of his angry feelings: “I seek refuge in God from that accursed devil.” Those present asked the man whether he heard what the Prophet was saying, and he replied, “I am not possessed by a devil.”*\n*Majnun. The word literally means to be possessed by a jinni, but it can also mean to be possessed by a devil. Shaitan is used in the preceding sentence. Majnun is also used meaning ‘mad’, but that does not fit this context.\n\n(Bukhari and Muslim.)"}},{"id":189,"idInBook":189,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا سَمِعْتُمْ صِيَاحَ الدِّيَكَةِ فَسَلُوا اللَّهَ مِنْ فَضْلِهِ فَإِنَّهَا رَأَتْ مَلَكًا وَإِذَا سَمِعْتُمْ نَهِيقَ الْحِمَارِ فَتَعَوَّذُوا بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيمِ فَإِنَّهُ رَأَى شَيْطَانا»","english":{"narrator":"","text":"Abu Huraira reported God's messenger as saying, “When you hear the cocks crowing ask God for some of His grace, for they have seen an angel; but when you hear an ass braying seek refuge in God from the devil, for it has seen a devil.” \n\n(Bukhari and Muslim.)"}},{"id":190,"idInBook":190,"chapterId":9,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا اسْتَوَى عَلَى بَعِيرِهِ خَارِجًا إِلَى السَّفَرِ كَبَّرَ ثَلَاثًا ثُمَّ قَالَ: (سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ)\nاللَّهُمَّ إِنَّا نَسْأَلُكَ فِي سَفَرِنَا هَذَا الْبِرَّ وَالتَّقْوَى وَمِنَ الْعَمَلِ مَا تَرْضَى اللَّهُمَّ هَوِّنْ عَلَيْنَا سَفَرَنَا هَذَا وَاطْوِ لَنَا بُعْدَهُ اللَّهُمَّ أَنْتَ الصَّاحِبُ فِي السَّفَرِ وَالْخَلِيفَةُ فِي الْأَهْلِ وَالْمَالِ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ وَعْثَاءِ السَّفَرِ وَكَآبَةِ الْمَنْظَرِ وَسُوءِ الْمُنْقَلَبِ فِي الْمَالِ والأهلِ \". وإِذا رجعَ قالَهنَّ وزادَ فيهِنَّ: «آيِبُونَ تائِبُونَ عابِدُونَ لربِّنا حامدون» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Ibn ‘Umar said that when God’s messenger sat on his camel to go out on a journey, he said “God is most great” three times. Then he said, \"Glory be to Him who has made this subservient to us, for we had not the strength for it, and to our Lord do we return. O God, we ask Thee in this journey of ours for uprightness, piety and such deeds as are pleasing to Thee. O God, make easy for us this journey of ours and make its length short for us. O God, Thou art the Companion in the journey and the One who looks after the family and the property in our absence. O God, I seek refuge in Thee from the difficulty of travelling, unhappiness in what I see, and finding harm has come when I return to my property and family.\" When he returned he said these words, adding, \"Returning, repentant, serving and praising our Lord.\" \n\nMuslim transmitted it."}},{"id":191,"idInBook":191,"chapterId":9,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ سَرْجِسَ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا سَافَرَ يَتَعَوَّذُ مِنْ وَعْثَاءِ السَّفَرِ وَكَآبَةِ الْمُنْقَلَبِ وَالْحَوْرِ بَعْدَ الْكَوْرِ وَدَعْوَةِ الْمَظْلُومِ وَسُوءِ الْمَنْظَرِ فِي الْأَهْل وَالْمَال. رَوَاهُ مُسلم","english":{"narrator":"","text":"‘Abdallah b. Sarjis said that when God’s messenger went on a journey he sought refuge in God from the difficulty of the journey, sorrow when he returned, scarcity after abundance, the claim of the oppressed, and seeing harm come to his family and property. \n\nMuslim transmitted it."}},{"id":192,"idInBook":192,"chapterId":9,"bookId":14,"arabic":"وَعَن خَوْلَةَ بِنْتِ حَكِيمٍ قَالَتْ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: \n\" مَنْ نَزَلَ مَنْزِلًا فَقَالَ: أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ لَمْ يَضُرَّهُ شَيْءٌ حَتَّى يرحل من منزله ذَلِك \". رَوَاهُ مُسلم","english":{"narrator":"","text":"Khaula daughter of Hakim said she heard God’s messenger say that if anyone says when he alights somewhere, \"I seek refuge in God’s perfect words from the evil of what He has created,\" no evil will befall him till he departs from that alighting-place of his. \n\nMuslim transmitted it."}},{"id":193,"idInBook":193,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: يَا رَسُولَ اللَّهِ مَا لَقِيتُ مِنْ عَقْرَبٍ لَدَغَتْنِي الْبَارِحَةَ قَالَ: \n\" أَمَا لَوْ قُلْتَ حِينَ أَمْسَيْتَ: أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خلق لم تَضُرك \". رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Huraira told of a man coming to God’s messenger and saying, “Messenger of God, what I have suffered from a scorpion which stung me last night!” He replied that if he had said in the evening, \"I seek refuge in God’s perfect words from the evil of what He has created,\" it would not have harmed him. \n\nMuslim transmitted it."}},{"id":194,"idInBook":194,"chapterId":9,"bookId":14,"arabic":"وَعَنْهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا كَانَ فِي سَفَرٍ وَأَسْحَرَ يَقُولُ: «سمع سامع يحمد الله وَحسن بلائه علينا وربنا صَاحِبْنَا وَأَفْضِلْ عَلَيْنَا عَائِذًا بِاللَّهِ مِنَ النَّارِ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"He said that when the Prophet was on a journey he would say at daybreak, \"Let a hearer hear beginning with praise of God and His good favour towards us. Our Lord, accompany us and show favour to us who are seeking refuge in God from hell.\" \n\nMuslim transmitted it."}},{"id":195,"idInBook":195,"chapterId":9,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَفَلَ مِنْ غَزْوٍ أَوْ حَجٍّ أَوْ عُمْرَةٍ يُكَبِّرُ عَلَى كُلِّ شَرَفٍ مِنَ الْأَرْضِ ثَلَاثَ تَكْبِيرَاتٍ ثُمَّ يَقُولُ: «لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كلِّ شيءٍ قديرٌ آيِبونَ تَائِبُونَ عَابِدُونَ سَاجِدُونَ لِرَبِّنَا حَامِدُونَ صَدَقَ اللَّهُ وَعْدَهُ وَنَصَرَ عَبْدَهُ وَهَزَمَ الْأَحْزَابَ وَحْدَهُ»","english":{"narrator":"","text":"Ibn ‘Umar said that when God’s messenger returned from an expedition, a hajj, or an ‘umra, on every rising piece of ground he would say three times, \"God is most great.\" Then he would say, “There is no god but God alone who has no partner, to whom the dominion belongs, to whom praise is due, and who is omnipotent. We are returning repentant, serving, prostrating ourselves before our Lord, and expressing praise. God alone has verified His promise, helped His servant, and routed the Confederates.”* \n*The reference is to the siege of Medina in 5 A.H. when a trench was dug as a protection.\n\n(Bukhari and Muslim.)"}},{"id":196,"idInBook":196,"chapterId":9,"bookId":14,"arabic":"وَعَنْ عَبْدُ اللَّهِ بْنِ أَبِي أَوْفَى قَالَ: دَعَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْأَحْزَابِ عَلَى الْمُشْرِكِينَ فَقَالَ: «اللَّهُمَّ مُنْزِلَ الْكِتَابِ سَرِيعَ الْحِسَابِ اللَّهُمَّ اهْزِمِ الأحزابَ اللهُمَّ اهزمهم وزلزلهم»","english":{"narrator":"","text":"‘Abdallah b. Abu Aufa said that God’s messenger invoked a curse on the polytheists at the battle of the Confederates, saying, “O God, who hast sent down the Book and art quick to take reckoning; O God, rout the Confederates, rout them and convulse them.” \n\n(Bukhari and Muslim.)"}},{"id":197,"idInBook":197,"chapterId":9,"bookId":14,"arabic":"وَعَن عبد الله بن يسر قَالَ: نَزَلَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى أَبِي فَقَرَّبْنَا إِلَيْهِ طَعَامًا وَوَطْبَةً فَأَكَلَ مِنْهَا ثُمَّ أُتِيَ بِتَمْرٍ فَكَانَ يَأْكُلُهُ وَيُلْقِي النَّوَى بَيْنَ أُصْبُعَيْهِ وَيَجْمَعُ السَّبَّابَةَ وَالْوُسْطَى وَفِي رِوَايَةٍ: فَجَعَلَ يُلْقِي النَّوَى عَلَى ظَهْرِ أُصْبُعَيْهِ السَّبَّابَةِ وَالْوُسْطَى ثُمَّ أُتِيَ بِشَرَابٍ فَشَرِبَهُ فَقَالَ أَبِي وَأَخَذَ بِلِجَامِ دَابَّتِهِ: ادْعُ اللَّهَ لَنَا فَقَالَ: «اللَّهُمَّ بَارِكْ لَهُمْ فِيمَا رَزَقْتَهُمْ واغفرْ لَهُم وارحمهم» . رَوَاهُ مُسلم","english":{"narrator":"","text":"‘Abdallah b. Busr said that God’s messenger visited his father and they presented him with some food and a mixture of dates, dried curd and clarified butter,* some of which he ate. Then some dates were brought to him and he ate them, throwing away the stones between two fingers, joining the forefinger and the middle finger. A version says that he began to throw away the stones on the outside of his forefinger and middle finger. He was then brought something to drink, and when he had drunk it  father took hold of the bridle of his beast and said, “Supplicate God for us.” So he said, “O God, bless them in that with which Thou hast provided them, forgive them and show them mercy.” \n*The Arabic word for this dish is watba. The word hais is used for very much the same dish. See p. 439, n.1.\n\nMuslim transmitted it."}},{"id":198,"idInBook":198,"chapterId":9,"bookId":14,"arabic":"عَن طلحةَ بنِ عبيدِ اللَّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا رَأَى الْهِلَالَ قَالَ: «اللَّهُمَّ أَهِلَّهُ عَلَيْنَا بِالْأَمْنِ وَالْإِيمَانِ وَالسَّلَامَةِ وَالْإِسْلَامِ رَبِّي وَرَبُّكَ اللَّهُ» . رَوَاهُ التِّرْمِذِيُّ. وَقَالَ: هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ","english":{"narrator":"","text":"Talha b. ‘Ubaidallah told that when the Prophet saw the new moon he said, “O God, make the new moon rise on us with security, faith, safety and Islam. My Lord and your Lord is God.” \n\nTirmidhi transmitted it, saying this is a hasan gharib tradition."}},{"id":199,"idInBook":199,"chapterId":9,"bookId":14,"arabic":"وَعَنْ عُمَرَ بْنِ الْخَطَّابِ وَأَبِي هُرَيْرَةَ قَالَا: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" مَا مِنْ رَجُلٍ رَأَى مُبْتَلًى فَقَالَ: الْحَمْدُ لِلَّهِ الَّذِي عَافَانِي مِمَّا ابْتَلَاكَ بِهِ وَفَضَّلَنِي عَلَى كَثِيرٍ مِمَّنْ خَلَقَ تَفْضِيلًا إِلَّا لَمْ يُصِبْهُ ذَلِكَ الْبَلَاءُ كَائِنا مَا كانَ \". رَوَاهُ التِّرْمِذِيّ\nوَرَوَاهُ ابْنُ مَاجَهْ عَنِ ابْنِ عُمَرَ. وَقَالَ التِّرْمِذِيُّ هَذَا حَدِيثٌ غَرِيبٌ وَعَمْرُو بْنُ دِينَارٍ الرَّاوِي لَيْسَ بِالْقَوِيّ","english":{"narrator":"","text":"‘Umar b. al-Khattab and Abu Huraira reported God’s messenger as saying that if anyone says, on seeing someone who is suffering affliction, “Praise be to God who has kept me free from the affliction He has brought on him and has shown me favour above many whom He has created,” that affliction, whatever it may be, will not smite him.\n\nTirmidhi transmitted it, and Ibn Majah transmitted it from Ibn ‘Umar. Tirmidhi said this is a gharib tradition, and ‘Amr b. Dinar, the transmitter, is not strong."}},{"id":200,"idInBook":200,"chapterId":9,"bookId":14,"arabic":"وَعَنْ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" مَنْ دَخَلَ السُّوقَ فَقَالَ: لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِي وَيُمِيتُ وَهُوَ حَيٌّ لَا يَمُوتُ بِيَدِهِ الْخَيْرُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ كَتَبَ اللَّهُ لَهُ أَلْفَ أَلْفَ حَسَنَةٍ وَمَحَا عَنْهُ أَلْفَ أَلْفَ سَيِّئَةٍ وَرَفَعَ لَهُ أَلْفَ أَلْفَ دَرَجَةٍ وَبَنَى لَهُ بَيْتًا فِي الْجَنَّةِ \". رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ غَرِيبٌ وَفِي شَرْحِ السُّنَّةِ: «مَنْ قَالَ فِي سُوقٍ جَامِعٍ يباعُ فِيهِ» بدل «من دخل السُّوق»","english":{"narrator":"","text":"‘Umar reported God’s messenger as saying that if anyone says on entering the market, “There is no god but God alone who has no partner, to whom belongs the dominion, to whom praise is due, who gives life and causes death while He is living and does not die, in whose hand is good, and who is omnipotent,” God will record for him a million good deeds, obliterate from him a million evil deeds, raise him a million degrees, and build him a house in paradise. \n\nTirmidhi and Ibn Majah transmitted it, Tirmidhi saying this is a gharib tradition. Sharh as-sunna has, “Says in a general market in which things are sold,” instead of “on entering the market.”"}},{"id":201,"idInBook":201,"chapterId":9,"bookId":14,"arabic":"وَعَنْ مُعَاذِ بْنِ جَبَلٍ قَالَ: سَمِعَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلًا يَدْعُو يَقُولُ: اللهُمَّ إِني أسألكَ تمامَ النعمةِ فَقَالَ: «أيُّ شَيْءٍ تَمَامُ النِّعْمَةِ؟» قَالَ: دَعْوَةٌ أَرْجُو بِهَا خَيْرًا فَقَالَ: «إِنَّ مِنْ تَمَامِ النِّعْمَةِ دُخُولَ الْجَنَّةِ وَالْفَوْزَ مِنَ النَّارِ» . وَسَمِعَ رَجُلًا يَقُولُ: يَا ذَا الْجَلَالِ وَالْإِكْرَامِ فَقَالَ: «قَدِ اسْتُجِيبَ لَكَ فَسَلْ» . وَسَمِعَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلًا وَهُوَ يَقُولُ: اللَّهُمَّ إِنِّي أَسْأَلُكَ الصَّبْرَ فَقَالَ: «سَأَلْتَ اللَّهَ الْبَلَاءَ فَاسْأَلْهُ الْعَافِيَةَ» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Mu'adh b. Jabal said the Prophet heard a man making supplication saying, “O God, I ask Thee for complete favour,” and asked him what complete favour meant. On his replying that it was a supplication by which he hoped to receive good, he said, “Part of complete favour is to enter paradise and be safe from hell.” He heard a man saying, “O Possessor of majesty and splendour,” and said, “Your prayer is answered, so make request.” The Prophet also heard a man who was saying, “O God, I ask Thee for endurance,” and said, “You have asked God for trial; now ask Him for wellbeing.”   \n\nTirmidhi transmitted it."}},{"id":202,"idInBook":202,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" مَنْ جَلَسَ مَجْلِسًا فَكَثُرَ فِيهِ لَغَطُهُ فَقَالَ قَبْلَ أَنْ يَقُومَ: سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيْكَ إِلَّا غُفِرَ لَهُ مَا كَانَ فِي مَجْلِسِهِ ذَلِكَ \". رَوَاهُ التِّرْمِذِيّ وَالْبَيْهَقِيّ فِي الدَّعْوَات الْكَبِير","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying that if anyone sits in an assembly where there is much clamour* and says before getting up to leave, “Glory be to Thee, O God, and I begin with praise of Thee; I testify that there is no god but Thou; I ask Thy pardon and turn to Thee in repentance,” he will be forgiven for what took place in that assembly where he was. \n*Or, ‘wicked talk,’ or, 'meaningless talk'\n\nTirmidhi and Baihaqi in  ad-Da'awat al-kabir, transmitted it."}},{"id":203,"idInBook":203,"chapterId":9,"bookId":14,"arabic":"وَعَنْ عَلِيٍّ: أَنَّهُ أُتِيَ بِدَابَّةٍ لِيَرْكَبَهَا فَلَمَّا وضَعَ رِجْلَه فِي الركابِ قَالَ: بسمِ اللَّهِ فَلَمَّا اسْتَوَى عَلَى ظَهْرِهَا قَالَ: الْحَمْدُ لِلَّهِ ثُمَّ قَالَ: (سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ وَإِنَّا إِلَى رَبنَا لمنُقلِبون)\nثُمَّ قَالَ: الْحَمْدُ لِلَّهِ ثَلَاثًا وَاللَّهُ أَكْبَرُ ثَلَاثًا سُبْحَانَكَ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ ثُمَّ ضَحِكَ فَقِيلَ: مِنْ أَيِّ شَيْءٍ ضَحِكْتَ يَا أَمِيرَ الْمُؤْمِنِينَ؟ قَالَ: رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَنَعَ كَمَا صَنَعْتُ ثُمَّ ضَحِكَ فَقُلْتُ: مِنْ أَيِّ شَيْءٍ ضَحِكْتَ يَا رَسُولَ اللَّهِ؟ قَالَ: \n\" إِنَّ رَبَّكَ لَيَعْجَبُ مِنْ عَبْدِهِ إِذَا قَالَ: رَبِّ اغْفِرْ لِي ذُنُوبِي يَقُولُ: يَعْلَمُ أَنَّهُ لَا يَغْفِرُ الذُّنُوبَ غَيْرِي \" رَوَاهُ أَحْمد وَالتِّرْمِذِيّ وَأَبُو دَاوُد","english":{"narrator":"","text":"‘Ali was brought a beast to ride, and when he put his foot in the stirrup he said, “In the name of God.” Then when he sat on its back he said, “Praise be to God.” He then said, “Glory be to Him who has made this subservient to us, for we had not the strength, and to our Lord do we return.” He then said, “Praise be to God (thrice); God is most great (thrice); Glory be to Thee. I have wronged myself, so forgive me, for only Thou forgivest sins.” He then laughed, and when he was asked what he was laughing at, he replied that he had seen God’s messenger do as he had done and laugh after that. He had asked him what he was laughing at, and he told him that his Lord was pleased with His servant when he asked Him to forgive him his sins, for God says, “He knows that I alone forgive sins.” \n\nAhmad, Tirmidhi and Abu Dawud transmitted it."}},{"id":204,"idInBook":204,"chapterId":9,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا وَدَّعَ رَجُلًا أَخَذَ بِيَدِهِ فَلَا يَدَعُهَا حَتَّى يَكُونَ الرَّجُلُ هُوَ يَدَعُ يَدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَيَقُولُ: «أَسْتَوْدِعُ اللَّهَ دِينَكَ وَأَمَانَتَكَ وَآخِرَ عَمَلِكَ» وَفِي رِوَايَة «خَوَاتِيم عَمَلِكَ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ وَفِي روايتهما لم يذكر: «وَآخر عَمَلك»","english":{"narrator":"","text":"Ibn ‘Umar told that when the Prophet said farewell to a man he took him by the hand and did not let it go till the man let go the Prophet’s hand, and he would say, “I entrust to God your religion, what you are responsible for, and your last deeds.” A version has “Your final deeds.”* \n*The text of the tradition has akhira 'amalika and the version khawatima 'amalika,\n\nTirmidhi, Abu Dawud and Ibn Majah transmitted it, but in the version of the last two “your last deeds” is not mentioned."}},{"id":205,"idInBook":205,"chapterId":9,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ الْخَطْمِيِّ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَرَادَ أَنْ يَسْتَوْدِعَ الْجَيْشَ قَالَ: «أَسْتَوْدِعُ اللَّهَ دِينَكُمْ وأمانتكم وخواتيم أَعمالكُم» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"‘Abdallah al-Khatmi told that when God’s messenger wanted to commend an army  he said, “I entrust to God your religion, what you are responsible for, and your final deeds.” \n\nAbu Dawud transmitted it."}},{"id":206,"idInBook":206,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: جَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: يَا رَسُولَ اللَّهِ إِنِّي أُرِيدُ سَفَرًا فَزَوِّدْنِي فَقَالَ: «زَوَّدَكَ اللَّهُ التَّقْوَى» . قَالَ: زِدْنِي قَالَ: «وَغَفَرَ ذَنْبَكَ» قَالَ: زِدْنِي بِأَبِي أَنْتَ وَأُمِّي قَالَ: «وَيَسَّرَ لكَ الْخَيْر حيثُما كُنْتَ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ","english":{"narrator":"","text":"Anas told of a man coming to the Prophet and saying, “Messenger of God, I intend to make a journey, so give me provisions.” He replied, “May God provide you with piety!” He asked for more, so he added, “And forgive your sin.” He said, “Say more, you for whom I would give my father and mother as ransom,” and he added, “And give you abundance of good wherever you are,” \n\nTirmidhi transmitted it, saying this is a hasan gharib tradition."}},{"id":207,"idInBook":207,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: إِنَّ رَجُلًا قَالَ: يَا رَسُولَ اللَّهِ إِنِّي أُرِيدُ أَنْ أُسَافِرَ فَأَوْصِنِي قَالَ: «عَلَيْكَ بِتَقْوَى اللَّهِ وَالتَّكْبِيرِ عَلَى كل شرف» . قَالَ: فَلَمَّا وَلَّى الرَّجُلُ قَالَ: «اللَّهُمَّ اطْوِ لَهُ الْبعد وهون عَلَيْهِ السّفر» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Abu Huraira told of a man who said, “Messenger of God, I intend to make a journey, so give me an injunction.” He told him to maintain fear of God and say “God is most great” on every rising ground, and when the man turned away he said, “O God, make the distance short for him and make the journey easy for him.” \n\nTirmidhi transmitted it."}},{"id":208,"idInBook":208,"chapterId":9,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا سَافَرَ فَأَقْبَلَ اللَّيْلُ قَالَ: «يَا أَرْضُ رَبِّي وَرَبُّكِ اللَّهُ أَعُوذُ بِاللَّهِ مِنْ شَرِّكِ وَشَرِّ مَا فِيكِ وَشَرِّ مَا خُلِقَ فِيكِ وَشَرِّ مَا يَدِبُّ عَلَيْكِ وَأَعُوذُ بِاللَّهِ مِنْ أَسَدٍ وَأَسْودَ وَمِنَ الْحَيَّةِ وَالْعَقْرَبِ وَمِنْ شَرِّ سَاكِنِ الْبَلَدِ وَمِنْ والدٍ وَمَا ولد» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Ibn ‘Umar said that when God’s messenger was travelling and night came on he said, \"O earth, my Lord and your Lord is God; I seek refuge in God from your evil, the evil of what you contain, the evil of what has been created in you, and the evil of what creeps upon you; I seek refuge in God from lions, from large black snakes, from other snakes, from scorpions, from the evil of jinn  which inhabit a settlement and from a parent and his offspring.\"* \n*This last phrase occurs in Qur’an, xc, 3 where it appears to be used in a straightforward sense; but in the tradition it is said to be a reference to lblis and his offspring of devils.\n\nAbu Dawud transmitted it."}},{"id":209,"idInBook":209,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَنَسٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا غَزَا قَالَ: «اللَّهُمَّ أَنْتَ عَضُدِي وَنَصِيرِي بِكَ أَحُولُ وَبِكَ أَصُولُ وَبِكَ أُقَاتِلُ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُد","english":{"narrator":"","text":"Anas told that when God’s messenger went on an expedition he said, \"O God, Thou art my aider and helper; by Thee I move, by Thee I attack, and by Thee I fight.\" \n\nTirmidhi and Abu Dawud transmitted it."}},{"id":210,"idInBook":210,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي مُوسَى: أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا خَافَ قَوْمًا قَالَ: «اللَّهُمَّ إِنَّا نَجْعَلُكَ فِي نُحُورِهِمْ وَنَعُوذُ بِكَ من شرورهم» . رَوَاهُ أَحْمد وَأَبُو دَاوُد","english":{"narrator":"","text":"Abu Musa told that when the Prophet feared a people he said, \"O God, we put Thee in front of them, and we seek refuge in Thee from their evils.\" \n\nAhmad and Abu Dawud transmitted it."}},{"id":211,"idInBook":211,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أُمُّ سَلَمَةَ رَضِيَ اللَّهُ عَنْهَا أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا خَرَجَ مِنْ بَيْتِهِ قَالَ: «بِسْمِ اللَّهِ تَوَكَّلْتُ عَلَى اللَّهِ اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نَزِلَّ أَوْ نَضِلَّ أَوْ نَظْلِمَ أَوْ نُظْلَمَ أَوْ نَجْهَلَ أَوْ يُجْهَلَ عَلَيْنَا» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَالنَّسَائِيُّ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَفِي رِوَايَةِ أَبِي دَاوُدَ وَابْنِ مَاجَهْ قَالَتْ أُمُّ سَلَمَةَ: مَا خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ بَيْتِي قَطُّ إِلَّا رَفَعَ طَرْفَهُ إِلَى السَّمَاءِ فَقَالَ: «اللَّهُمَّ إِنِّي أَعُوذُ بِكَ أَنْ أَضِلَّ أَوْ أُضَلَّ أَوْ أَظْلِمَ أَوْ أُظْلَمَ أَوْ أَجْهَلَ أَو يجهل عَليّ»","english":{"narrator":"","text":"Umm Salama told that when the Prophet went out of his house he said, “In the name of God; I trust in God; O God, we seek refuge in Thee from slipping, or straying, or causing injustice, or suffering injustice, or doing wrong, or having wrong done to us.\" \n\nAhmad, Tirmidhi and Nasa'i transmitted it, Tirmidhi saying this is a hasan sahih tradition, In the version of Abu Dawud and Ibn Majah, Umm Salama said that God’s messenger never went out of her house without raising his eye to the sky and saying, “O God, I seek refuge in Thee lest I stray or lead others stray,* or cause injustice, or suffer injustice, or do wrong, or have wrong done to me.”\n*Some read as above, but others read 'or be led astray'."}},{"id":212,"idInBook":212,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" إِذَا خَرَجَ الرَّجُلُ مِنْ بَيْتِهِ فَقَالَ: بِسْمِ اللَّهِ تَوَكَّلْتُ عَلَى اللَّهِ لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ يُقَالُ لَهُ حِينَئِذٍ هُدِيتَ وَكُفِيتَ وَوُقِيتَ فَيَتَنَحَّى لَهُ الشَّيْطَانُ وَيَقُولُ شَيْطَانٌ آخَرُ: كَيْفَ لَكَ بِرَجُلٍ قَدْ هُدِيَ وَكُفِيَ وَوُقِيَ \". رَوَاهُ أَبُو دَاوُدَ وروى التِّرْمِذِيّ إِلى قَوْله: «الشَّيْطَان»","english":{"narrator":"","text":"Anas reported God’s messenger as saying that when a man goes out of his house and says, \"In the name of God; I trust in God; there is no might and no power but in God,\" the following will be said to him at that time, \"You are guided, defended and protected.\" The devil will go far from him and another devil will say, \"How can you deal with a man who has been guided, defended and protected?\" \n\nAbu Dawud transmitted it, and Tirmidhi transmitted up to “the devil will go far from him.\""}},{"id":213,"idInBook":213,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي مَالِكٍ الْأَشْعَرِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" إِذَا وَلَجَ الرَّجُلُ بَيْتَهُ فَلْيَقُلْ: اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ الْمَوْلِجِ وَخَيْرَ الْمَخْرَجِ بِسْمِ اللَّهِ وَلَجْنَا وَعَلَى اللَّهِ رَبِّنَا تَوَكَّلْنَا ثُمَّ لْيُسَلِّمْ عَلَى أَهْلِهِ \". رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Abu Malik al-Ash'ari reported God's messenger as saying that when a man goes into his house he should say, “O God, I ask Thee for good both when entering and when going out; in the name of God we have entered and in God our Lord do we trust.” He should then greet his family. \n\nAbu Dawud transmitted it."}},{"id":214,"idInBook":214,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا رَفَّأَ الْإِنْسَانَ إِذَا تَزَوَّجَ قَالَ: «بَارَكَ اللَّهُ لَكَ وَبَارَكَ عَلَيْكُمَا وَجَمَعَ بَيْنَكُمَا فِي خَيْرٍ» رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَأَبُو دَاوُدَ وَابْنُ مَاجَهْ","english":{"narrator":"","text":"Abu Huraira said that when the Prophet congratulated* a man on his marriage he said, “God bless you, bless you both, and prosper your union.” \n*The verb used is raffa'a which originally meant saying to someone who had just been married, \"may the marriage produce close union and sons.\" It is said that because this was a phrase used in pre-lslamic times, the Prophet substituted for it the words used in this tradition. The verb thus develops simply the meaning of congratulating without in itself involving any particular formula.\n\nAhmad, Tirmidhi, Abu Dawud and Ibn Majah transmitted it."}},{"id":215,"idInBook":215,"chapterId":9,"bookId":14,"arabic":"وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا تَزَوَّجَ أَحَدُكُمُ امْرَأَةً أَوِ اشْتَرَى خَادِمًا فَلْيَقُلْ اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا وَخَيْرَ مَا جَبَلْتَهَا عَلَيْهِ وَأَعُوذُ بِكَ مِنْ شَرِّهَا وَشَرِّ مَا جَبَلْتَهَا عَلَيْهِ وَإِذَا اشْتَرَى بَعِيرًا فليأخُذْ بِذروةِ سنامِهِ ولْيَقُلْ مِثْلَ ذَلِكَ» . وَفِي رِوَايَةٍ فِي الْمَرْأَةِ وَالْخَادِمِ: «ثُمَّ لْيَأْخُذْ بِنَاصِيَتِهَا وَلْيَدْعُ بِالْبَرَكَةِ» . رَوَاهُ أَبُو دَاوُد وَابْن مَاجَه","english":{"narrator":"","text":"'Amr b. Shu'aib, on his father’s authority, said his grandfather told how the Prophet said that when anyone of them married a woman, or bought a servant he should say, “O God, I ask Thee for the good in her and in the disposition Thou hast given her, and I seek refuge in Thee from the evil in her and in the disposition Thou hast given her.” When he buys a camel he should take hold of the top of its hump and say the same kind of thing. In a version regarding a woman and a servant it says he should take hold of her forelock and make supplication for a blessing. \n\nAbu Dawud and Ibn Majah transmitted it."}},{"id":216,"idInBook":216,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي بَكْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «دَعَوَاتُ الْمَكْرُوبِ اللَّهُمَّ رَحْمَتَكَ أَرْجُو فَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ وَأَصْلِحْ لِي شَأْنِي كُلَّهُ لَا إِلَهَ إِلَّا أَنْتَ» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Abu Bakra reported God’s messenger as saying that the supplications to be used by one who is distressed are, “O God, Thy mercy is what I hope for. Do not abandon me to myself for an instant, but put all my affairs in good order for me. There is no god but Thou.”\n\nAbu Dawud transmitted it."}},{"id":217,"idInBook":217,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: قَالَ رَجُلٌ: هُمُومٌ لَزِمَتْنِي وَدُيُونٌ يَا رَسُولَ اللَّهِ قَالَ: «أَفَلَا أُعَلِّمُكَ كَلَامًا إِذَا قُلْتَهُ أَذْهَبَ اللَّهُ هَمَّكَ وَقَضَى عَنْكَ دَيْنَكَ؟» قَالَ: قُلْتُ: بَلَى قَالَ: \n\" قُلْ إِذَا أَصْبَحْتَ وَإِذَا أَمْسَيْتَ: اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحُزْنِ وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ وَقَهْرِ الرِّجَالِ \". قَالَ: فَفعلت ذَلِك فَأذْهب الله همي وَقضى عَن ديني. رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Abu Sa'id al-Khudri told of a man who said to God’s messenger that he was entangled in cares and debts. He replied, “Shall I not teach you words by which, when you say them, God will remove your care and settle your debt?” and when the man expressed a desire to hear them he told him to say morning and evening, “O God, I seek refuge in Thee from care and grief; I seek refuge in Thee from incapacity and slackness; I seek refuge in Thee from niggardliness and cowardice; I seek refuge in Thee from being overcome by debt and being put in subjection by men.” He said that when he did that God removed his care and settled his debt. \n\nAbu Dawud transmitted it."}},{"id":218,"idInBook":218,"chapterId":9,"bookId":14,"arabic":"وَعَن عليّ: أَنَّهُ جَاءَهُ مُكَاتَبٌ فَقَالَ: إِنِّي عَجَزْتُ عَنْ كتابي فَأَعِنِّي قَالَ: أَلَا أُعَلِّمُكَ كَلِمَاتٍ عَلَّمَنِيهِنَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْ كَانَ عَلَيْكَ مِثْلُ جَبَلٍ كَبِيرٍ دَيْنًا أَدَّاهُ اللَّهُ عَنْكَ. قُلْ: «اللَّهُمَّ اكْفِنِي بِحَلَالِكَ عَنْ حَرَامِكَ وَأَغْنِنِي بِفَضْلِكَ عَمَّنْ سِوَاكَ» . رَوَاهُ التِّرْمِذِيُّ وَالْبَيْهَقِيُّ فِي الدَّعَوَاتِ الْكَبِيرِ\nوَسَنَذْكُرُ حَدِيثَ جَابِرٍ: «إِذَا سَمِعْتُمْ نُبَاحَ الْكِلَابِ» فِي بَابِ «تَغْطِيَةِ الْأَوَانِي» إِن شَاءَ الله تَعَالَى","english":{"narrator":"","text":"‘Ali told of a slave who had made a contract with his master to pay for his freedom(1) coming to him and saying, “I am unable to fulfill my contract,* so give me help.” He suggested teaching him words he had been taught by God’s messenger, which would be so effective that if he had a debt as large as a huge mountain God would pay it for him, telling him to say, “O God, grant me enough of what Thou makest lawful so that I may dispense with what Thou makest unlawful, and make me able by Thy grace to dispense with all but Thee.” \n1. Mukatab. Although the term comes from the root meaning to write, the contract was not necessarily written.\n*Kitabati. While the word properly refers to something written, it is used for a contract whether written or not.\n\nTirmidhi and Baihaqi, in  ad-Da'awat al-kabir, transmitted it."}},{"id":219,"idInBook":219,"chapterId":9,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ قَالَتْ: إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا جَلَسَ مَجْلِسًا أَوْ صَلَّى تكلَّم بِكَلِمَاتٍ فَسَأَلْتُهُ عَنِ الْكَلِمَاتِ فَقَالَ: \n\" إِنْ تُكُلِّمَ بِخَيْرٍ كَانَ طَابَعًا عَلَيْهِنَّ إِلَى يَوْمِ الْقِيَامَةِ وَإِنْ تُكُلِّمَ بِشَرٍّ كَانَ كَفَّارَةً لَهُ: سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ لَا إِلَهَ إِلَّا أَنْتَ أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيْكَ \". رَوَاهُ النَّسَائِيّ","english":{"narrator":"","text":"‘A'isha said that when God’s messenger sat in an assembly or prayed he spoke some words, so she asked him about them. Saying that they were, “Glory be to Thee, O God, and I begin with praise of Thee; there is no god but Thou; I ask forgiveness of Thee and turn to Thee in repentance,” he told her that if one speaks what is good this will act as a seal on his words till the day of resurrection, and that if one speaks what is evil this will act as an atonement for what he has said. \n\nNasa’i transmitted it."}},{"id":220,"idInBook":220,"chapterId":9,"bookId":14,"arabic":"وَعَن قَتَادَة: بَلَغَهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا رَأَى الْهِلَالَ قَالَ: «هِلَالُ خَيْرٍ وَرُشْدٍ هِلَالُ خَيْرٍ وَرُشْدٍ هِلَالُ خَيْرٍ وَرُشْدٍ آمَنْتُ بِالَّذِي خَلَقَكَ» ثَلَاثَ مَرَّاتٍ ثُمَّ يَقُولُ: «الْحَمْدُ لِلَّهِ الَّذِي ذَهَبَ بِشَهْرِ كَذَا وَجَاء بِشَهْر كَذَا» . رَوَاهُ أَبُو دَاوُد","english":{"narrator":"","text":"Qatada told of hearing that when God’s messenger saw the new moon he said, “A new moon of good and right guidance; a new moon of good and right guidance; a new moon of good and right guidance. I believe in Him who created you” (three times). He would then say, “Praise be to God who has made such and such a month to pass and has brought such and such a month.” \n\nAbu Dawud transmitted it."}},{"id":221,"idInBook":221,"chapterId":9,"bookId":14,"arabic":"وَعَنِ ابْنِ مَسْعُودٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" مَنْ كَثُرَ هَمُّهُ فَلْيَقُلْ: اللَّهُمَّ إِنِّي عَبْدُكَ وَابْنُ عَبْدِكَ وَابْنُ أَمَتِكَ وَفِي قَبْضَتِكَ نَاصِيَتِي بِيَدِكَ مَاضٍ فِيَّ حُكْمُكَ عَدْلٌ فِيَّ قَضَاؤُكَ أَسْأَلُكَ بِكُلِّ اسْمٍ هُوَ لَكَ سَمَّيْتَ بِهِ نَفْسَكَ أَوْ أَنْزَلْتَهُ فِي كِتَابِكَ أَوْ عَلَّمْتَهُ أَحَدًا مِنْ خَلْقِكَ أَوْ أَلْهَمْتَ عِبَادَكَ أَوِ اسْتَأْثَرْتَ بِهِ فِي مَكْنُونِ الْغَيْبِ عِنْدَكَ أَنْ تَجْعَلَ الْقُرْآنَ رَبِيعَ قلبِي وجِلاء هَمِّي وغَمِّي مَا قَالَهَا عَبْدٌ قَطُّ إِلَّا أَذْهَبَ اللَّهُ غمه وأبدله فرجا \". رَوَاهُ رزين","english":{"narrator":"","text":"Ibn Mas'ud reported God’s messenger as saying that if anyone is afflicted by much care he should say, “O God, I am Thy servant, the son of Thy servant, the son of Thy handmaid, and at Thy disposal; my forelock is in Thy hand; Thy judgment is effective regarding me; just concerning me is Thy decree; I ask Thee by every name Thou hast by which Thou hast called Thyself, or sent down in Thy Book, or taught any of Thy creatures, or kept to Thyself in the hidden place of the unseen, to make the Qur’an the Spring of my heart and the means of clearing away my care and grief.” He declared that no one had ever said it without God removing his grief and giving him joy instead of it. \n\nRazin transmitted it."}},{"id":222,"idInBook":222,"chapterId":9,"bookId":14,"arabic":"وَعَن جابرٍ قَالَ: كُنَّا إِذَا صَعِدْنَا كَبَّرْنَا وَإِذَا نَزَلْنَا سبحنا. رَوَاهُ البُخَارِيّ","english":{"narrator":"","text":"Jabir said that when they went up to high ground they said, “God is most great,” and when they descended they said, “Glory be to God.” \n\nBukhari transmitted it."}},{"id":223,"idInBook":223,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَنَسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا كَرَبَهُ أَمْرٌ يَقُولُ: «يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغِيثُ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ غَرِيبٌ وَلَيْسَ بِمَحْفُوظٍ","english":{"narrator":"","text":"Anas told that when anything caused God’s messenger anxiety he would say, “O Living One, O Eternal One, in Thy mercy I seek help.”\n\nTirmidhi transmitted it, saying this is a gharib tradition which is not committed to memory.*\n*Laisa bi-mahfuz is used here. A tradition called mahfuz is one which is considered superior when compared with a shadhdh tradition (cf. p. xii)."}},{"id":224,"idInBook":224,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: قُلْنَا يَوْمَ الْخَنْدَقِ: يَا رَسُولَ اللَّهِ هَلْ مِنْ شَيْءٍ نَقُولُهُ؟ فَقَدْ بَلَغَتِ الْقُلُوبُ الْحَنَاجِرَ قَالَ: «نَعَمْ اللَّهُمَّ اسْتُرْ عَوْرَاتِنَا وَآمِنْ رَوْعَاتِنَا» قَالَ: فَضَرَبَ اللَّهُ وُجُوهَ أَعْدَائِهِ بِالرِّيحِ وَهَزَمَ اللَّهُ بِالرِّيحِ. رَوَاهُ أَحْمد","english":{"narrator":"","text":"Abu Sa'id al-Khudri said that at the battle of the Trench  they asked God’s messenger whether there was anything they could repeat, for their hearts were in their mouths.* He replied that there was; they should say, “O God, cover our danger points(1) and give security from fears.” He said that God then sent a wind in the faces of His enemies and God routed them by the wind. \n*Literally, ‘For the hearts had reached the windpipes.’\n1. The word is 'aurat used in a similar prayer on p. 510. There it was translated 'faults'. Another meaning refers to places on a frontier, etc., which give openings to an enemy, and so are places where caution is necessary. This seems more suitable in the present context. Cf. Mirqat, iii, 134.\n\nAhmad transmitted it."}},{"id":225,"idInBook":225,"chapterId":9,"bookId":14,"arabic":"وَعَن بُرَيْدَة قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا دَخَلَ السُّوقَ قَالَ: «بِسْمِ اللَّهِ اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ هَذِهِ السُّوقِ وَخَيْرِ مَا فِيهَا وَأَعُوذُ بِكَ مِنْ شَرِّهَا وَشَرِّ مَا فِيهَا اللَّهُمَّ إِنِّي أَعُوذُ بِكَ أَنْ أُصِيبَ فِيهَا صَفْقَةً خَاسِرَةً» . رَوَاهُ الْبَيْهَقِيُّ فِي الدَّعَوَاتِ الْكَبِير","english":{"narrator":"","text":"Buraida reported that when the Prophet entered the market he said, “In the name of God. O God, I ask Thee for the good of this market and the good of what it contains, and I seek refuge in Thee from its evil and the evil of what it contains. O God, I seek refuge in Thee lest I get a bad bargain in it.” \n\nBaihaqi transmitted it in  ad-Da‘ awat al-kabir."}},{"id":226,"idInBook":226,"chapterId":9,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ «تَعَوَّذُوا بِاللَّهِ مِنْ جَهْدِ الْبَلَاءِ وَدَرَكِ الشَّقَاءِ وَسُوءِ القضاءِ وشَماتة الْأَعْدَاء»","english":{"narrator":"","text":"Abu Huraira reported God’s messenger as saying, “Seek refuge in God from severe calamity, being overtaken by misery, (1) evil destiny, and the triumphant mockery of enemies.” \n1. darak ash-shaqa. It might be translated “the depth of misery.” Cf. Qur’an, iv, 145 where the accepted reading is dark, although the word has also been read darak.\n\n(Bukhari and Muslim.)"}},{"id":227,"idInBook":227,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحُزْنِ وَالْعَجْزِ وَالْكَسَلِ وَالْجُبْنِ وَالْبُخْلِ وَضَلَعِ الدَّيْنِ وَغَلَبَةِ الرِّجَالِ»","english":{"narrator":"","text":"Anas said that the Prophet used to say, “O God, I seek refuge in Thee from care, grief, incapacity, slackness, cowardliness, niggardliness, the burden of debt, and being overpowered by men.” \n\n(Bukhari and Muslim.)"}},{"id":228,"idInBook":228,"chapterId":9,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ قَالَتْ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكَسَلِ وَالْهَرَمِ وَالْمَغْرَمِ وَالْمَأْثَمِ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ النَّارِ وَفِتْنَةِ النَّارِ وَفِتْنَةِ الْقَبْرِ وَعَذَابِ الْقَبْرِ وَمِنْ شَرِّ فِتْنَةِ الْغِنَى وَمِنْ شَرِّ فِتْنَةِ الْفَقْرِ وَمِنْ شَرِّ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ اللَّهُمَّ اغْسِلْ خَطَايَايَ بِمَاءِ الثَّلْجِ وَالْبَرَدِ وَنَقِّ قَلْبِي كَمَا يُنَقَّى الثَّوْبُ الْأَبْيَضُ مِنَ الدَّنَسِ وَبَاعِدْ بَيْنِي وَبَيْنَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمغْرب»","english":{"narrator":"","text":"‘A’isha said that the Prophet used to say, “O God, I seek refuge in Thee from slackness, decrepitude, debt and sin. O God, I seek refuge in Thee from the punishment in hell, the trial  hell, the trial in the grave, (2) the punishment in the grave, the evil of the trial of riches, the evil of the trial of poverty, (3) and the evil of the testing of the antichrist. (4) O God, wash away my sins with snow and hail water, purify my heart as a white garment is purified from filth, and put my sins as far away from me as Thou hast put the East from the West.”\n2. Being unable to answer the two angels.\n3. Riches may lead to oppression and poverty to envy.\n4. al-Masih ad-dajjal. The false Christ who is to appear in the last days.\n\n(Bukhari and Muslim.)"}},{"id":229,"idInBook":229,"chapterId":9,"bookId":14,"arabic":"وَعَنْ زَيْدِ بْنِ أَرْقَمَ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْعَجْزِ وَالْكَسَلِ وَالْجُبْنِ وَالْبُخْلِ وَالْهَرَمِ وَعَذَابِ الْقَبْرِ اللَّهُمَّ آتِ نَفْسِي تَقْوَاهَا وَزَكِّهَا أَنْتَ خَيْرُ مَنْ زَكَّاهَا أَنْتَ وَلِيُّهَا وَمَوْلَاهَا اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عِلْمٍ لَا يَنْفَعُ وَمِنْ قَلْبٍ لَا يَخْشَعُ وَمِنْ نَفْسٍ لَا تَشْبَعُ وَمِنْ دَعْوَةٍ لَا يُسْتَجَاب لَهَا» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Zaid b. Arqam said that God’s messenger used to say, “O God, I seek refuge in Thee from incapacity, slackness, cowardliness, niggardliness, decrepitude, and the punishment in the grave. O God, bring my soul to fear of Thee and purify it; Thou art the best of those who purify it; Thou art its Patron and Master. O God, I seek refuge in Thee from knowledge which does not profit, from a heart which is not submissive, from an appetite which is insatiable, and from a supplication which is not granted an answer.” \n\nMuslim transmitted it."}},{"id":230,"idInBook":230,"chapterId":9,"bookId":14,"arabic":"وَعَن عبد بنِ عمرَ قَالَ: كَانَ مِنْ دُعَاءِ رَسُولِ اللَّهِ صَلَّى الله عَلَيْهِ سوسلم: «اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ زَوَالِ نِعْمَتِكَ وَتَحَوُّلِ عَافِيَتِكَ وَفُجَاءَةِ نِقْمَتِكَ وَجَمِيعِ سَخَطِكَ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"‘Abdallah b. ‘Umar said that one of the supplications of God’s messenger was, “O God, I seek refuge in Thee from the decline of Thy favour, change in Thy granting wellbeing, sudden vengeance from Thee, and all Thy displeasure.” \n\nMuslim transmitted it."}},{"id":231,"idInBook":231,"chapterId":9,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ مَا عَمِلْتُ وَمِنْ شَرِّ مَا لَمْ أعمَلْ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"‘A’isha said that God’s messenger used to say, “O God, I seek refuge in Thee from the evil of what I have done and from the evil of what I have not done.” \n\nMuslim transmitted it."}},{"id":232,"idInBook":232,"chapterId":9,"bookId":14,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ: «اللَّهُمَّ لَكَ أَسْلَمْتُ وَبِكَ آمَنْتُ وَعَلَيْكَ تَوَكَّلْتُ وَإِلَيْكَ أَنَبْتُ وَبِكَ خَاصَمْتُ اللَّهُمَّ إِنِّي أَعُوذُ بِعِزَّتِكَ لَا إِلَهَ إِلَّا أَنْتَ أَنْ تُضِلَّنِي أَنْتَ الْحَيُّ الَّذِي لَا يَمُوتُ وَالْجِنُّ وَالْإِنْسُ يموتون»","english":{"narrator":"","text":"Ibn ‘Abbas said that God’s messenger used to say, “O God, to Thee I have submitted, in Thee I believe, on Thee I rely, to Thee I turn in repentance, and by Thee I contend. O God, I seek refuge in Thy might, than whom there is no god, lest Thou leadest me into error. Thou art the Living One who dost not die, while jinn and men die.” \n\n(Bukhari and Muslim.)"}},{"id":233,"idInBook":233,"chapterId":9,"bookId":14,"arabic":"عَنْ أَبِي هُرَيْرَةَ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: \n\" اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْأَرْبَعِ: مِنْ عِلْمٍ لَا يَنْفَعُ وَمِنْ قَلْبٍ لَا يَخْشَعُ وَمِنْ نَفْسٍ لَا تَشْبَعُ وَمِنْ دُعَاءٍ لَا يُسْمَعُ \". رَوَاهُ أحمدُ وَأَبُو دَاوُد وابنُ مَاجَه\nوَرَوَاهُ التِّرْمِذِيُّ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو. وَالنَّسَائِيّ عَنْهُمَا","english":{"narrator":"Abu Huraira said that God’s messenger used to say, “O God, I seek refuge in Thee from the four things:","text":"knowledge which does not profit, a heart which is not submissive, an appetite which is insatiable, and a supplication which is not heard.” \n\nAhmad, Abu Dawud and Ibn Majah transmitted it. Tirmidhi transmitted it from ‘Abdallah b. 'Amr, and Nasa’i from both sources."}},{"id":234,"idInBook":234,"chapterId":9,"bookId":14,"arabic":"وَعَنْ عُمَرَ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَعَوَّذُ مِنْ خَمْسٍ: مِنَ الْجُبْنِ وَالْبُخْلِ وَسُوءِ الْعُمُرِ وَفِتْنَةِ الصَّدْرِ وَعَذَابِ القَبرِ. رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ","english":{"narrator":"‘Umar said that God’s messenger used to seek refuge in God from five things:","text":"cowardliness, niggardliness, the evils of old age, evil thoughts, and the punishment in the grave. \n\nAbu Dawud and Nasa'i transmitted it."}},{"id":235,"idInBook":235,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ: «اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْفَقْرِ وَالْقِلَّةِ وَالذِّلَّةِ وَأَعُوذُ مِنْ أَنْ أَظْلِمَ أَوْ أُظْلَمَ» رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ","english":{"narrator":"","text":"Abu Huraira said that God’s messenger used to say, “O God, I seek refuge in Thee from poverty, lack and abasement, and I seek refuge in Thee lest I cause or suffer wrong.” \n\nAbu Dawud and Nasa'i transmitted it."}},{"id":236,"idInBook":236,"chapterId":9,"bookId":14,"arabic":"وَعَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ: «اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الشِّقَاقِ وَالنِّفَاقِ وَسُوءِ الْأَخْلَاقِ» . رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ","english":{"narrator":"","text":"He said that God’s messenger used to say, \"O God, I seek refuge in Thee from divisiveness, hypocrisy and evil character.\" \n\nAbu Dawud transmitted it."}},{"id":237,"idInBook":237,"chapterId":9,"bookId":14,"arabic":"وَعَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ: «اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْجُوعِ فَإِنَّهُ بِئْسَ الضَّجِيعُ وَأَعُوذُ بِكَ مِنَ الْخِيَانَةِ فَإِنَّهَا بِئْسَتِ الْبِطَانَةُ» . رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ وَابْن مَاجَه","english":{"narrator":"","text":"He said that God’s messenger used to say, \"O God, I seek refuge in Thee from hunger, for it is an evil bedfellow; and I seek refuge in Thee from treachery, for it is an evil hidden trait.\" 1 \n1. Literally, ‘lining.’\n\nAbu Dawud, Nasa’i and Ibn Majah transmitted it."}},{"id":238,"idInBook":238,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَنَسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ: «اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْبَرَصِ وَالْجُذَامِ وَالْجُنُونِ وَمِنْ سَيِّئِ الأسقام» . رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ","english":{"narrator":"","text":"Anas said that God’s messenger used to say, “O God, I seek refuge in Thee from leprosy, elephantiasis, madness, and evil diseases.” \n\nAbu Dawud and Nasa’i transmitted it."}},{"id":239,"idInBook":239,"chapterId":9,"bookId":14,"arabic":"وَعَن قُطْبةَ بْنِ مَالِكٍ قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ مُنْكَرَاتِ الْأَخْلَاق والأعمال والأهواء» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Qutba b. Malik said that the Prophet used to say, \"O God, I seek refuge in Thee from objectionable characteristics, deeds and passions.\" \n\nTirmidhi transmitted it."}},{"id":240,"idInBook":240,"chapterId":9,"bookId":14,"arabic":"وَعَنْ شُتَيْرِ بْنِ شَكَلِ بْنِ حُمَيْدٍ عَنْ أَبِيه قَالَ: قُلْتُ: يَا نَبِيَّ اللَّهِ عَلِّمْنِي تَعْوِيذًا أَتَعَوَّذُ بِهِ قَالَ: «قُلِ اللَّهُمَّ إِنِّي أَعُوذُ بك من شَرّ سَمْعِي وَمن شَرّ بَصَرِي وَشَرِّ لِسَانِي وَشَرِّ قَلْبِي وَشَرِّ مَنِيِّي» . رَوَاهُ أَبُو دَاوُد وَالتِّرْمِذِيّ وَالنَّسَائِيّ","english":{"narrator":"","text":"Shutair b. Shakal b. Humaid said that his father asked God’s Prophet to teach him a formula by which he might seek refuge in God, and he told him to say, “O God, I seek refuge in Thee from evil in what I hear, see, speak, think about, and from evil arising from my sexual passion.”\n\nAbu Dawud, Tirmidhi and Nasa’i transmitted it."}},{"id":241,"idInBook":241,"chapterId":9,"bookId":14,"arabic":"وَعَن أبي الْيُسْر أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَدْعُو: «اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَدْمِ وَأَعُوذُ بِكَ مِنَ التَّرَدِّي وَمِنَ الْغَرَقِ وَالْحَرْقِ وَالْهَرَمِ وَأَعُوذُ بِكَ مِنْ أَنْ يَتَخَبَّطَنِي الشَّيْطَانُ عِنْدَ الْمَوْتِ وَأَعُوذُ بِكَ مِنْ أَنْ أَمُوتَ فِي سَبِيلِكَ مُدْبِرًا وَأَعُوذُ بِكَ مِنْ أَنْ أَمُوتَ لَدِيغًا»\nرَوَاهُ أَبُو دَاوُدَ وَالنَّسَائِيُّ وَزَادَ فِي رِوَايَةٍ أُخْرَى «الْغم»","english":{"narrator":"","text":"Abul Yasar said, that God’s messenger used to make this supplication, “O God, I seek refuge in Thee from my house falling on me; I seek refuge, in Thee from falling into an abyss, drowning, burning and decrepitude; I seek refuge in Thee from the devil harming me at the time of my death; I seek refuge in Thee from dying in Thy path while retreating; and I seek refuge in Thee from dying of the sting of a poisonous creature.” \n\nAbu Dawud and Nasa’i transmitted it. In another version Nasa’i added, “and from sorrow.”"}},{"id":242,"idInBook":242,"chapterId":9,"bookId":14,"arabic":"وَعَنْ مُعَاذٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \" أستعيذُ بِاللَّهِ مِنْ طَمَعٍ يَهْدِي إِلَى طَبَعٍ)\nرَوَاهُ أَحْمد وَالْبَيْهَقِيّ فِي الدَّعْوَات الْكَبِير","english":{"narrator":"","text":"Mu'adh reported the Prophet as saying, “Seek refuge in God from covetousness which leads to disgrace.” \n\nAhmad and Baihaqi, in  ad-Da'awat al-kabir, transmitted it."}},{"id":243,"idInBook":243,"chapterId":9,"bookId":14,"arabic":"وَعَنْ عَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَظَرَ إِلَى الْقَمَرِ فَقَالَ: «يَا عَائِشَةُ اسْتَعِيذِي بِاللَّهِ مِنْ شَرِّ هَذَا فَإِنَّ هَذَا هُوَ الْغَاسِقُ إِذا وَقب» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"‘A’isha told of the Prophet looking at the moon and saying, “Seek refuge in God from the evil of this one, ‘A'isha, for this is the darkness when it overspreads.” 2 \n2. cf. Qur’an, cxiii, 3. The tradition is said to refer to the moon being eclipsed.\n\nTirmidhi transmitted it."}},{"id":244,"idInBook":244,"chapterId":9,"bookId":14,"arabic":"وَعَن عمرانَ بنِ حُصينٍ قَالَ: قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لأبي: «يَا حُصَيْن كم تعبد الْيَوْم إِلَهًا؟» قَالَ أَبِي: سَبْعَةً: سِتًّا فِي الْأَرْضِ وواحداً فِي السَّماءِ قَالَ: «فَأَيُّهُمْ تَعُدُّ لِرَغْبَتِكَ وَرَهْبَتِكَ؟» قَالَ: الَّذِي فِي السَّمَاءِ قَالَ: «يَا حُصَيْنُ أَمَا إِنَّكَ لَوْ أَسْلَمْتَ عَلَّمْتُكَ كَلِمَتَيْنِ تَنْفَعَانِكَ» قَالَ: فَلَمَّا أَسْلَمَ حُصينٌ قَالَ: يَا رسولَ الله علِّمني الكلمتينِ اللَّتينِ وَعَدتنِي فَقَالَ: «قل اللَّهُمَّ أَلْهِمْنِي رُشْدِي وَأَعِذْنِي مِنْ شَرِّ نَفْسِي» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"'Imran b. Husain told of the Prophet asking his father, “How many gods do you worship to-day, Husain?” His father replied, “Seven, six in the earth and one in heaven.” He asked, “Which of them do you take account of regarding your hopes and your fears?” On receiving his reply that it was the one in heaven, he said, “If you were to accept Islam, Husain, I would teach you two phrases which would benefit you.” When Husain accepted Islam\" he asked God’s messenger to teach him the two phrases he had promised him, and he told him to say, “O God, direct me in the right way and deliver me from the evil within myself.”\n\nTirmidhi transmitted it."}},{"id":245,"idInBook":245,"chapterId":9,"bookId":14,"arabic":"وَعَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \" إِذَا فَزِعَ أَحَدُكُمْ فِي النَّوْمِ فَلْيَقُلْ: أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ غَضَبِهِ وَعِقَابِهِ وَشَرِّ عِبَادِهِ وَمِنْ هَمَزَاتِ الشَّيَاطِينِ وَأَنْ يَحْضُرُونَ فَإِنَّهَا لَنْ تَضُرَّهُ «وَكَانَ عَبْدُ اللَّهِ بْنُ عَمْرٍو يُعَلِّمُهَا مَنْ بَلَغَ مِنْ وَلَدِهِ وَمَنْ لَمْ يَبْلُغْ مِنْهُمْ كَتَبَهَا فِي صَكٍّ ثُمَّ عَلَّقَهَا فِي عُنُقِهِ» . رَوَاهُ أَبُو دَاوُدَ وَالتِّرْمِذِيّ وَهَذَا لَفظه","english":{"narrator":"","text":"‘Amr b. Shu'aib, on his father’s authority, said that his grandfather reported God’s messenger as saying that when anyone was alarmed while asleep he should say, “I seek refuge in God's perfect words from His anger, His punishment, the evil of His servants, the evil suggestions of the devils and their presence,” for they will not injure him. 'Abdallah b. ‘Amr used to teach them to those of his children who had reached puberty and those who had not. He wrote them down on some material (1) and hung the writing on the child’s neck. \n1. The word is sakh which usually means a document.\n\nAbu Dawud and Tirmidhi transmitted it, this being Tirmidhi's wording."}},{"id":246,"idInBook":246,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَنَسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" مَنْ سَأَلَ اللَّهَ الْجَنَّةَ ثَلَاثَ مَرَّاتٍ قَالَتِ الْجَنَّةُ: اللَّهُمَّ أَدْخِلْهُ الْجَنَّةَ وَمَنِ اسْتَجَارَ مِنَ النَّارِ ثَلَاثَ مَرَّاتٍ قَالَتِ النَّارُ: اللَّهُمَّ أَجِرْهُ مِنَ النَّارِ \" رَوَاهُ التِّرْمِذِيُّ وَالنَّسَائِيّ","english":{"narrator":"","text":"Anas reported God’s messsenger as saying that if anyone asks God for paradise three times, paradise will say, ‘‘O God, bring him into paradise;” and if anyone asks for protection from hell three times, hell will say, \"O God, grant him protection from hell.” \n\nTirmidhi and Nasa’i transmitted it."}},{"id":247,"idInBook":247,"chapterId":9,"bookId":14,"arabic":"عَنِ الْقَعْقَاعِ: أَنَّ كَعْبَ الْأَحْبَارِ قَالَ: لَوْلَا كَلِمَاتٌ أَقُولُهُنَّ لَجَعَلَتْنِي يَهُودُ حِمَارًا فَقِيلَ لَهُ: مَا هُنَّ؟ قَالَ: أَعُوذُ بِوَجْهِ اللَّهِ الْعَظِيمِ الَّذِي لَيْسَ شَيْءٌ أَعْظَمَ مِنْهُ وَبِكَلِمَاتِ اللَّهِ التامَّاتِ الَّتِي لَا يُجاوزُهنَّ بَرٌّ وَلَا فاجرٌ وَبِأَسْمَاءِ اللَّهِ الْحُسْنَى مَا عَلِمْتُ مِنْهَا وَمَا لَمْ أَعْلَمْ مِنْ شَرِّ مَا خَلَقَ وَذَرَأَ وبرأ. رَوَاهُ مَالك","english":{"narrator":"","text":"Al-Qa'qa' reported Ka‘b al-Ahbar as saying, “Were it not for some words which I say, the Jews would treat me as an ass.” (2) He was asked what they were and replied, “I seek refuge in God’s mighty Person than which nothing is mightier, in God’s perfect words which no one, whether pious or profligate, can go beyond and in God’s beautiful names, those which I know and those which I do not know, from the evil of what He has created, produced and brought into being.” \n2. This might be translated “turn me into an ass.” If that is the correct translation it would suggest the use of magic.\n\nMalik transmitted it."}},{"id":248,"idInBook":248,"chapterId":9,"bookId":14,"arabic":"وَعَن مُسلم بن أبي بَكرةَ قَالَ: كَانَ أَبِي يَقُولُ فِي دُبُرِ الصَّلَاةِ: اللَّهُمَّ إِن أَعُوذُ بِكَ مِنَ الْكُفْرِ وَالْفَقْرِ وَعَذَابِ الْقَبْرِ فَكُنْتُ أَقُولُهُنَّ فَقَالَ: أَيْ بُنَيَّ عَمَّنْ أَخَذْتَ هَذَا؟ قُلْتُ: عَنْكَ قَالَ: إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يقولهُنَّ فِي دُبرِ الصَّلاةِ. رَوَاهُ النَّسَائِيّ وَالتِّرْمِذِيّ إِلَّا أَنَّهُ لَمْ يُذْكَرْ فِي دُبُرِ الصَّلَاةِ\nوَرَوَى أَحْمَدُ لَفْظَ الْحَدِيثِ وَعِنْدَهُ: فِي دُبُرِ كل صَلَاة","english":{"narrator":"Muslim b. Abu Bakra said:","text":"My father used to say at the end of the prayer, “O God, I seek refuge in Thee from infidelity, poverty and the punishment in the grave.” I used to say these words also, so he asked me, “From whom did you get this, sonny?” When I told him that I had got it from him, he said that God’s messenger used to say these words at the end of the prayer. \n\nNasa'i and Tirmidhi transmitted it, but the latter did not mention \"at the end of the prayer.\" Ahmad transmitted the wording of the tradition, but he had, \"at the end of every prayer.\""}},{"id":249,"idInBook":249,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي سَعِيدٍ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «أَعُوذُ بِاللَّهِ مِنَ الْكُفْرِ وَالدَّيْنِ» فَقَالَ رَجُلٌ: يَا رَسُولَ اللَّهِ أَتَعْدِلُ الْكُفْرَ بِالدَّيْنِ؟ قَالَ: «نَعَمْ» . وَفِي رِوَايَةٍ «اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكُفْرِ وَالْفَقْرِ» . قَالَ رَجُلٌ: وَيُعْدَلَانِ؟ قَالَ: «نَعَمْ» . رَوَاهُ النَّسَائِيّ","english":{"narrator":"","text":"Abu Sa'id said he heard God’s messenger say, \"I seek refuge in God from infidelity and debt.\" A man asked him whether he treated infidelity on a level with debt, and he replied that he did. A version has, \"O God, I seek refuge in Thee from infidelity and poverty.\" A man asked whether they were equal, and replied that they were. \n\nNasa’i transmitted it."}},{"id":250,"idInBook":250,"chapterId":9,"bookId":14,"arabic":"عَنْ أَبِي مُوسَى الْأَشْعَرِيِّ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أَنَّهُ كَانَ يَدْعُو بِهَذَا الدُّعَاءِ: «اللَّهُمَّ اغْفِرْ لِي خَطِيئَتِي وَجَهْلِي وَإِسْرَافِي فِي أَمْرِي وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي اللَّهُمَّ اغْفِرْ لِي جَدِّي وَهَزْلِي وَخَطَئِي وَعَمْدِي وكلُّ ذلكَ عِنْدِي اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ وَمَا أَسْرَرْتُ وَمَا أعلنت وَمَا أَنْت بِهِ أَعْلَمُ بِهِ مِنِّي أَنْتَ الْمُقَدِّمُ وَأَنْتَ الْمُؤَخِّرُ وَأَنت على كل شَيْء قدير»","english":{"narrator":"Abu Musa al-Ash‘ari told on the Prophet’s authority that he used to use this supplication:","text":"“O God, forgive me my sin, my ignorance, my extravagance in my affairs, and what Thou knowest better than I do. O God, forgive me my serious and my frivolous sins, my unintentional and my intentional sins, for I am guilty of all that. O God, forgive me my former and my latter sins, what I have kept secret and what I have done openly, and what Thou knowest better than I do. Thou art the Advancer, Thou art the Delayer, and Thou art omnipotent.” \n\n(Bukhari and Muslim.)"}},{"id":251,"idInBook":251,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «اللَّهُمَّ أَصْلِحْ لِي دِينِي الَّذِي هُوَ عِصْمَةُ أَمْرِي وَأَصْلِحْ لِي دُنْيَايَ الَّتِي فِيهَا مَعَاشِي وَأَصْلِحْ لِي آخِرَتِي الَّتِي فِيهَا مَعَادِي وَاجْعَلِ الْحَيَاةَ زِيَادَةً لِي فِي كُلِّ خَيْرٍ وَاجْعَلِ الْمَوْتَ رَاحَةً لِي مِنْ كُلِّ شَرٍّ» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Huraira said that God’s messenger used to say, “O God, order well for me my religion which is the support of my affairs; order well for me my worldly affairs in which my livelihood is found; order well for me my life to come where is my ultimate destination; make life for me a means of increase in all that is good; and make death a rest for me from every evil.” \n\nMuslim transmitted it."}},{"id":252,"idInBook":252,"chapterId":9,"bookId":14,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ يَقُولُ: «اللَّهُمَّ إِنِّي أَسْأَلُكَ الْهُدَى وَالتُّقَى وَالْعَفَافَ وَالْغِنَى» . رَوَاهُ مُسلم","english":{"narrator":"","text":"‘Abdallah b. Mas'ud told on the authority of the Prophet that he used to say, \"O God, I ask Thee for guidance, piety, self-control and a competence.\" \n\nMuslim transmitted it."}},{"id":253,"idInBook":253,"chapterId":9,"bookId":14,"arabic":"وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «قُلْ اللَّهُمَّ اهْدِنِي وَسَدِّدْنِي وَاذْكُرْ بِالْهُدَى هِدَايَتَكَ الطَّرِيقَ وبالسداد سداد السهْم» . رَوَاهُ مُسلم","english":{"narrator":"","text":"‘Ali said that God’s messenger told him to say, \"O God, guide me and dispose me to do what is right,” keeping in mind when asking for guidance his being guided in the right way, and when asking for disposal to do what is right an arrow’s faculty of hitting the mark.\n\nMuslim transmitted it."}},{"id":254,"idInBook":254,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي مَالِكٍ الْأَشْجَعِي عَنْ أَبِيهِ قَالَ: كَانَ الرجل إِذا أسلم علمه النَّبِي صلى اللَّهُ عَلَيْهِ وَسَلَّمَ الصَّلَاةَ ثُمَّ أَمَرَهُ أَنْ يَدْعُوَ بِهَؤُلَاءِ الْكَلِمَاتِ: «اللَّهُمَّ اغْفِرْ لِي وَارْحَمْنِي وَاهْدِنِي وَعَافِنِي وَارْزُقْنِي» . رَوَاهُ مُسلم","english":{"narrator":"","text":"Abu Malik al-Ashja‘i told on his father’s authority that when a man accepted Islam the Prophet instructed him in the prayer, then commanded him to make supplication with these words, “O God, forgive me, show mercy to me, guide me, grant me health, and grant me provision.” \n\nMuslim transmitted it."}},{"id":255,"idInBook":255,"chapterId":9,"bookId":14,"arabic":"وَعَن أنسٍ قَالَ: كَانَ أَكْثَرُ دُعَاءِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ «اللَّهُمَّ آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وقنا عَذَاب النَّار»","english":{"narrator":"","text":"Anas said that the Prophet's most frequent supplication was, \"O God, bring us blessing in this world, blessing in the next, and guard us from the punishment of hell.\" \n\n(Bukhari and Muslim.)"}},{"id":256,"idInBook":256,"chapterId":9,"bookId":14,"arabic":"عَنِ ابْنِ عَبَّاسٍ قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدْعُو يَقُولُ: «رَبِّ أَعِنِّي وَلَا تُعِنْ عَلَيَّ وَانْصُرْنِي وَلَا تَنْصُرْ عَلَيَّ وَامْكُرْ لِي وَلَا تَمْكُرْ عَلَيَّ وَاهْدِنِي وَيَسِّرِ الْهُدَى لِي وَانْصُرْنِي عَلَى مَنْ بَغَى عَلَيَّ ربِّ اجعَلني لكَ شَاكِرًا لَكَ ذَاكِرًا لَكَ رَاهِبًا لَكَ مِطْوَاعًا لَكَ مُخْبِتًا إِلَيْكَ أَوَّاهًا مُنِيبًا رَبِّ تَقَبَّلْ تَوْبَتِي وَاغْسِلْ حَوْبَتِي وَأَجِبْ دَعْوَتِي وَثَبِّتْ حُجَّتِي وَسَدِّدْ لِسَانِي وَاهْدِ قَلْبِي وَاسْلُلْ سَخِيمَةَ صَدْرِي» . رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد وَابْن مَاجَه","english":{"narrator":"","text":"Ibn ‘Abbas told that the Prophet used to say when making supplication, \"My Lord, help me and do not give help against me; grant me victory and do not grant victory over me; plan on my behalf and do not plan against me; guide me and make right guidance easy for me; grant me victory over those who act wrongfully towards me. My Lord, make me grateful to Thee, mindful of Thee, full of fear towards Thee, devoted to Thy obedience, humble before Thee, earnest in supplication, and penitent. My Lord, accept my repentance, wash away my sin, answer my supplication, clearly establish my evidence, make true my tongue, guide my heart, and draw out the malice in my breast.” \n\nTirmidhi, Abu Dawud and Ibn Majah transmitted it."}},{"id":257,"idInBook":257,"chapterId":9,"bookId":14,"arabic":"وَعَن أبي بكرٍ قَالَ: قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمِنْبَرِ ثُمَّ بَكَى فَقَالَ: «سَلُوا اللَّهَ الْعَفْوَ وَالْعَافِيَةَ فَإِنَّ أَحَدًا لَمْ يُعْطَ بَعْدَ الْيَقِينِ خَيْرًا مِنَ الْعَافِيَةِ» . رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ حَسَنٌ غَرِيب إِسْنَادًا","english":{"narrator":"","text":"Abu Bakr said that God’s messenger mounted the pulpit, then wept and said, \"Ask God for forgiveness and health, for after being granted certainty, one is given nothing better than health.\" \n\nTirmidhi and Ibn Majah transmitted it, Tirmidhi saying this is a hasan tradition whose isnad is gharib."}},{"id":258,"idInBook":258,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَنَسٍ أَنَّ رَجُلًا جَاءَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: يَا رَسُولَ اللَّهِ أَيُّ الدُّعَاءِ أَفْضَلُ؟ قَالَ: «سَلْ رَبَّكَ الْعَافِيَةَ وَالْمُعَافَاةَ فِي الدُّنْيَا وَالْآخِرَةِ» ثُمَّ أَتَاهُ فِي الْيَوْمِ الثَّانِي فَقَالَ: يَا رَسُولَ اللَّهِ أَيُّ الدُّعَاءِ أَفْضَلُ؟ فَقَالَ لَهُ مِثْلَ ذَلِكَ ثُمَّ أَتَاهُ فِي الْيَوْمِ الثَّالِثِ فَقَالَ لَهُ مِثْلَ ذَلِكَ قَالَ: «فَإِذَا أُعْطِيتَ الْعَافِيَةَ وَالْمُعَافَاةَ فِي الدُّنْيَا وَالْآخِرَةِ فَقَدْ أَفْلَحْتَ» . رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ حَسَنٌ غَرِيب إِسْنَادًا","english":{"narrator":"","text":"Anas told of a man who came to the Prophet and asked him which supplication was most excellent. To this he replied, \"Ask your Lord for health and for security from evil in this world and the next.\" He came to him on the following day, asked the same question, and received a similar reply. Then when he came on the third day he received a similar reply with this addition, \"If you are given health and security from evil in this world and the next, you have attained felicity.\"\n\nTirmidhi and Ibn Majah transmitted it, Tirmidhi saying this is a hasan tradition whose isnad is gharib."}},{"id":259,"idInBook":259,"chapterId":9,"bookId":14,"arabic":"وَعَن عبد الله يزِيد الخطمي عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ يَقُولُ فِي دُعَائِهِ: «اللَّهُمَّ ارْزُقْنِي حُبَّكَ وَحُبَّ مَنْ يَنْفَعُنِي حُبُّهُ عِنْدَكَ اللَّهُمَّ مَا رَزَقْتَنِي مِمَّا أُحِبُّ فَاجْعَلْهُ قُوَّةً لِي فِيمَا تُحِبُّ اللَّهُمَّ مَا زَوَيْتَ عَنِّي مِمَّا أحب فاجعله فراغا ي فِيمَا تحب» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"‘Abdallah b. Yazid al-Khatmi told on the authority of God's messenger that he used to say in his supplication, \"O God, provide me with Thy love 1 and the love of those whose love will benefit me with Thee; O God, make the things I love with which Thou hast provided me a strength to me regarding what Thou lovest; O God, make the things I love which Thou hast turned away from me a means of my devoting myself to what Thou lovest.\" \n1. hibbaka. This could be translated either as above or as \"love of Thee\", but the phrase which follows it suggests that the translation given above is the correct one in this context.\n\nTirmidhi transmitted it."}},{"id":260,"idInBook":260,"chapterId":9,"bookId":14,"arabic":"وَعَنِ ابْنِ عُمَرَ قَالَ: قَلَّمَا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُومُ مِنْ مَجْلِسٍ حَتَّى يَدْعُوَ بِهَؤُلَاءِ الدَّعَوَاتِ لِأَصْحَابِهِ: «اللَّهُمَّ اقْسِمْ لَنَا مِنْ خَشْيَتِكَ مَا تَحُولُ بِهِ بَيْنَنَا وَبَيْنَ مَعَاصِيكَ وَمِنْ طَاعَتِكَ مَا تُبَلِّغُنَا بِهِ جَنَّتَكَ وَمِنَ الْيَقِينِ مَا تُهَوِّنُ بِهِ عَلَيْنَا مُصِيْبَاتِ الدُّنْيَا وَمَتِّعْنَا بِأَسْمَاعِنَا وَأَبْصَارِنَا وَقُوَّتِنَا مَا أَحْيَيْتَنَا وَاجْعَلْهُ الْوَارِثَ مِنَّا وَاجْعَلْ ثَأْرَنَا عَلَى مَنْ ظَلَمَنَا وَانْصُرْنَا عَلَى مَنْ عَادَانَا وَلَا تَجْعَلْ مُصِيبَتَنَا فِي دِينِنَا وَلَا تَجْعَلِ الدُّنْيَا أَكْبَرَ هَمِّنَا وَلَا مَبْلَغَ عِلْمِنَا وَلَا تُسَلِّطْ عَلَيْنَا مَنْ لَا يَرْحَمُنَا» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ","english":{"narrator":"Ibn ‘Umar said that God’s messenger seldom got up to leave an assembly without using these supplications for his companions:","text":"“O God, apportion to us such fear of Thee as will come between us and acts of disobedience to Thee, such obedience to Thee as will bring us to Thy paradise, and such certainty that the calamities of this world will be made easy for us by Thee; let us enjoy our hearing, our sight and our power as long as Thou dost grant us life, and do the same for those who inherit from us; grant us revenge on those who have wronged us and help us against those who are hostile to us; let no calamity befall our religion, let not worldly affairs be our greatest care or all that we know about, and let not those who do not show mercy towards us rule over us.” \n\nTirmidhi transmitted it, saying this is a hasan gharib tradition."}},{"id":261,"idInBook":261,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «اللَّهُمَّ انْفَعْنِي بِمَا عَلَّمْتَنِي وَعَلِّمْنِي مَا يَنْفَعُنِي وَزِدْنِي عِلْمًا الْحَمْدُ لِلَّهِ عَلَى كُلِّ حَالٍ وَأَعُوذُ بِاللَّهِ مِنْ حَالِ أَهْلِ النَّارِ» . رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ غَرِيبٌ إِسْنَادًا","english":{"narrator":"","text":"Abu Huraira told that God's messenger used to say, “O God, grant me benefit in what Thou hast taught me, teach me what will benefit me, and increase my knowledge. Praise be to God in all circumstances. I seek refuge in God from the state of those who go to hell.” \n\nTirmidhi and Ibn Majah transmitted it, Tirmidhi saying this is a tradition whose isnad is gharib."}},{"id":262,"idInBook":262,"chapterId":9,"bookId":14,"arabic":"وَعَنْ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ قَالَ: كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أُنْزِلَ عَلَيْهِ الْوَحْيُ سُمِعَ عِنْدَ وَجْهِهِ دوِي كَدَوِيِّ النَّحْل فأنل عَلَيْهِ يَوْمًا فَمَكَثْنَا سَاعَةً فَسُرِّيَ عَنْهُ فَاسْتَقْبَلَ الْقِبْلَةَ وَرَفَعَ يَدَيْهِ وَقَالَ: «اللَّهُمَّ زِدْنَا وَلَا تَنْقُصْنَا وَأَكْرِمْنَا وَلَا تُهِنَّا وَأَعْطِنَا وَلَا تَحْرِمْنَا وَآثِرْنَا وَلَا تُؤْثِرْ عَلَيْنَا وَأَرْضِنَا وَارْضَ عَنَّا» . ثُمَّ قَالَ: «أُنْزِلَ عَلَيَّ عَشْرُ آيَاتٍ مَنْ أَقَامَهُنَّ دَخَلَ الْجَنَّةَ» ثُمَّ قَرَأَ: (قَدْ أَفْلَحَ الْمُؤْمِنُونَ)\nحَتَّى خَتَمَ عَشْرَ آيَاتٍ. رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيّ","english":{"narrator":"‘Umar b. al-Khattab said:","text":"When the inspiration was sent down to the Prophet, a low sound was heard near his face like the humming of bees. One day when inspiration was sent down to him and we had waited for a time, it left him, then facing the qibla and raising his hands, he said, “O God, give us more and do not give us less; honour us and do not humiliate us; give us and do not withhold from us; choose us and do not prefer others to us; please us and be pleased with us.” He then said, “I have had sent down to me ten verses which will provide entrance to paradise for those who recite them.” He then recited, “The believers have been successful” and continued till he had completed ten verses, 1 \n1. Qur'an, xxiii, 1-10.\n\nAhmad and Tirmidhi transmitted it."}},{"id":263,"idInBook":263,"chapterId":9,"bookId":14,"arabic":"عَن عثمانَ بنِ حُنَيفٍ قَالَ: إِنَّ رَجُلًا ضَرِيرَ الْبَصَرِ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: ادْعُ اللَّهَ أَنْ يُعَافِيَنِي فَقَالَ: «إِنْ شِئْتَ دَعَوْتُ وَإِنْ شِئْتَ صَبَرْتَ فَهُوَ خَيْرٌ لَكَ» . قَالَ: فَادْعُهُ قَالَ: فَأَمَرَهُ أَنْ يَتَوَضَّأَ فَيُحْسِنَ الْوُضُوءَ وَيَدْعُو بِهَذَا الدُّعَاءِ: «اللَّهُمَّ إِنِّي أَسْأَلُكَ وَأَتَوَجَّهُ إِلَيْكَ بِنَبِيِّكَ مُحَمَّدٍ نَبِيِّ الرَّحْمَةِ إِنِّي تَوَجَّهْتُ بِكَ إِلَى رَبِّي لِيَقْضِيَ لِي فِي حَاجَتِي هَذِهِ اللهُمَّ فشفّعْه فيَّ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيب","english":{"narrator":"‘Uthman b. Hunaif told that a blind man came to the Prophet and asked him to pray to God to cure him. He replied, “If you wish, I shall make supplication to God, but if you wish you will endure, for that is better for you.\" The man asked him to make supplication.  said:","text":"He then commanded him to perform ablution, doing it well, and make this supplication, “O God, I make request of Thee and I turn towards Thee by means of Thy prophet Muhammad, the prophet of mercy. By means of you 1 have turned towards my Lord to accomplish for me this need of mine. O God, make him an intercessor for me.”\n1. bika. This would seem here to refer to the Prophet, although by itself it might naturally be taken to refer to God. The sentence which precedes certainly suggests that it must refer to the Prophet, in which case the translation might go, “by means of whom I have turned towards my Lord.” Changes of pronouns in Arabic often present difficulties to the translator.\n\nTirmidhi transmitted it, saying this is a hasan sahih gharib tradition."}},{"id":264,"idInBook":264,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَبِي الدَّرْدَاءِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ مِنْ دُعَاءِ دَاوُدَ يَقُولُ: «اللَّهُمَّ إِنِّي أَسْأَلُكَ حُبَّكَ وَحُبَّ مَنْ يُحِبُّكَ وَالْعَمَلَ الَّذِي يُبَلِّغُنِي حُبَّكَ اللَّهُمَّ اجْعَلْ حُبَّكَ أَحَبَّ إِلَيَّ مِنْ نَفْسِي وَمَالِي وَأَهْلِي وَمِنَ الْمَاءِ الْبَارِدِ» . قَالَ: وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا ذَكَرَ دَاوُدَ يُحَدِّثُ عَنْهُ يَقُولُ: «كَانَ أَعْبَدَ الْبَشَرِ» رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ","english":{"narrator":"","text":"Abud Darda’ reported God's messenger as saying that part of David's supplication was that he would say, “O God, I ask Thee for Thy love, 2 the love of those who love Thee, and deeds which will cause me to attain to Thy love. O God, make Thy love dearer to me than myself, my property, my family, and than cold water.\" He said that when God’s messenger mentioned David and talked about him, he would say that he was most devoted of men to worship. \n2. cf. page 530, n. 1.\n\nTirmidhi transmitted it, saying this is a hasan gharib tradition."}},{"id":265,"idInBook":265,"chapterId":9,"bookId":14,"arabic":"وَعَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ أَبِيهِ قَالَ: صَلَّى بِنَا عَمَّارُ بْنُ يَاسِرٍ صَلَاةً فَأَوْجَزَ فِيهَا فَقَالَ لَهُ بَعْضُ الْقَوْمِ: لَقَدْ خَفَّفْتَ وَأَوْجَزْتَ الصَّلَاةَ فَقَالَ أَمَا عَلَيَّ ذَلِكَ لَقَدْ دَعَوْتُ فِيهَا بِدَعَوَاتٍ سَمِعْتُهُنَّ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا قَامَ تَبِعَهُ رَجُلٌ مِنَ الْقَوْمِ هُوَ أَبِي غَيْرَ أَنَّهُ كَنَّى عَنْ نَفْسِهِ فَسَأَلَهُ عَنِ الدُّعَاءِ ثُمَّ جَاءَ فَأَخْبَرَ بِهِ الْقَوْمَ: «اللَّهُمَّ بِعِلْمِكَ الْغَيْبَ وقُدرتِكَ على الخَلقِ أَحْيني مَا عَلِمْتَ الْحَيَاةَ خَيْرًا لِي وَتَوَفَّنِي إِذَا عَلِمْتَ الْوَفَاةَ خَيْرًا لِي اللَّهُمَّ وَأَسْأَلُكَ خَشْيَتَكَ فِي الْغَيْبِ وَالشَّهَادَةِ وَأَسْأَلُكَ كَلِمَةَ الْحَقِّ فِي الرِّضَى وَالْغَضَبِ وَأَسْأَلُكَ الْقَصْدَ فِي الْفَقْرِ وَالْغِنَى وَأَسْأَلُكَ نَعِيمًا لَا يَنْفَدُ وَأَسْأَلُكَ قُرَّةَ عَيْنٍ لَا تَنْقَطِعُ وَأَسْأَلُكَ الرِّضَى بَعْدَ الْقَضَاءِ وَأَسْأَلُكَ بَرْدَ الْعَيْشِ بَعْدَ الْمَوْتِ وَأَسْأَلُكَ لَذَّةَ النَّظَرِ إِلَى وَجْهِكَ وَالشَّوْقِ إِلَى لِقَائِكَ فِي غَيْرِ ضَرَّاءَ مُضِرَّةٍ وَلَا فِتْنَةٍ مُضِلَّةٍ اللَّهُمَّ زِيِّنَا بِزِينَةِ الْإِيمَانِ وَاجْعَلْنَا هُدَاةً مَهْدِيِّينَ» . رَوَاهُ النَّسَائِيُّ","english":{"narrator":"‘Ata’ b. as-Sa’ib told that his father said:","text":"‘Ammar b. Yasir led us in a prayer and did so in brief form. One of the people camplained that he had shortened the prayer and conducted it briefly, but he replied that that would cause him no harm, for he had used in it various supplica­ tions he had heard from God’s messenger.\" When he got up to depart one of the people followed him (‘Ata’ explaining that this was his father although he made a vague reference to himself) 3 and asked him about the supplication, whereupon he came and informed the people of it as follows: “O God, by Thy knowledge of the unseen and Thy power to create, grant me life as long as Thou knowest life to be best for me, and take me when Thou knowest death to be best for me; O God, I ask Thee for fear of Thee both within my secret heart and openly; I ask Thee for the word of truth in pleasure and anger; I ask Thee for moderation both in poverty and riches; I ask Thee for felicity which does not pass away; I ask Thee for comfort which is not cut off; I ask Thee for satisfaction with what is decreed; I ask Thee for a pleasant life 1 after death; I ask Thee for the pleasure of looking at Thy face, and longing to meet Thee in a state in which distress does not cause harm or testing lead astray. O God, beautify us with the adornment of faith, and make us guides who are rightly guided.” \n\nNasa’i transmitted it.\n\n3. The vague reference consists in his saying \"one of the people.\"\n1. Literally \"coolness of life.\" The word bard (coolness) develops the meaning of pleasantness."}},{"id":266,"idInBook":266,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أُمِّ سَلَمَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ فِي دُبُرِ صَلَاةِ الْفَجْرِ: «اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا وَعَمَلًا مُتَقَبَّلًا وَرِزْقًا طَيِّبًا» . رَوَاهُ أَحْمَدُ وَابْنُ مَاجَهْ وَالْبَيْهَقِيّ فِي الدَّعوات الْكَبِير","english":{"narrator":"","text":"Umm Salama said that the Prophet used to say after the dawn prayer, “O God, I ask Thee for beneficial knowledge, acceptable action, and good provision.” \n\nAhmad, Ibn Majah and Baihaqi, in  ad- Da'awat al-kabir, transmitted it."}},{"id":267,"idInBook":267,"chapterId":9,"bookId":14,"arabic":"وَعَن أبي هريرةَ قَالَ: دُعَاءٌ حَفِظْتُهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا أَدَعُهُ: «اللَّهُمَّ اجْعَلْنِي أُعْظِمُ شُكْرَكَ وَأُكْثِرُ ذِكْرَكَ وَأَتَّبِعُ نُصْحَكَ وَأَحْفَظُ وصيتك» . رَوَاهُ التِّرْمِذِيّ","english":{"narrator":"","text":"Abu Huraira said that a supplication he had learned from God’s messenger and which he would never give up was, “O God, make me thank Thee greatly, keep Thee in my memory often, follow Thy counsel, and keep Thy injunction.” \n\nTirmidhi transmitted it."}},{"id":268,"idInBook":268,"chapterId":9,"bookId":14,"arabic":"وَعَن عبدِ الله بنِ عَمْروٍ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «اللَّهُمَّ إِنِّي أَسْأَلُكَ الصِّحَّةَ وَالْعِفَّةَ والأمانةَ وحُسنَ الْخلق والرضى بِالْقدرِ»","english":{"narrator":"","text":"‘Abdallah b. 'Amr told that God’s messenger used to say, “O God, I ask Thee for health, continence, integrity, a good character, and acceptance of what is decreed.”"}},{"id":269,"idInBook":269,"chapterId":9,"bookId":14,"arabic":"وَعَن أُمِّ مَعْبدٍ قَالَتْ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «اللَّهُمَّ طَهِّرْ قَلْبِي مِنَ النِّفَاقِ وَعَمَلِي مِنَ الرِّيَاءِ وَلِسَانِي مِنَ الْكَذِبِ وَعَيْنِي مِنَ الْخِيَانَةِ فَإِنَّكَ تَعْلَمُ خَائِنَةَ الْأَعْيُنِ وَمَا تُخْفِي الصُّدُورُ» . رَوَاهُمَا الْبَيْهَقِيُّ فِي الدَّعَوَاتِ الْكَبِيرِ","english":{"narrator":"","text":"Umm Ma'bad said she heard God’s messenger say, “O God, purify my heart from hypocrisy, my action from vain show, my tongue from falsehood and my eyes from wrongful glances, for Thou knowest the surreptitious looks of the eyes and what is concealed in the breasts.” 2 \n\nBaihaqi transmitted the two traditions in  ad-Da'awat al-kabir.\n\n2. cf. Qur’an, xl, 19."}},{"id":270,"idInBook":270,"chapterId":9,"bookId":14,"arabic":"وَعَنْ أَنَسٍ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَادَ رَجُلًا مِنَ الْمُسْلِمِينَ قَدْ خَفَتَ فَصَارَ مِثْلَ الْفَرْخِ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «هَلْ كُنْتَ تَدْعُو اللَّهَ بِشَيْءٍ أَوْ تَسْأَلُهُ إِيَّاهُ؟» . قَالَ: نَعَمْ كُنْتُ أَقُولُ: اللَّهُمَّ مَا كُنْتَ مُعَاقِبِي بِهِ فِي الْآخِرَةِ فَعَجِّلْهُ لِي فِي الدُّنْيَا. فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" سُبْحَانَ اللَّهِ لَا تُطِيقُهُ وَلَا تَسْتَطِيعُهُ أَفَلَا قُلْتَ: اللَّهُمَّ آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ \". قَالَ: فَدَعَا الله بِهِ فشفاه الله. رَوَاهُ مُسلم","english":{"narrator":"Anas told of God’s messenger visiting a Muslim who had become as weak as a chicken and asking him whether he had been accustomed to make any supplication to God or ask Him for anything. On his replying that he had, for he was accustomed to say, \"O God, what Thou meanest to punish me with in the next world inflict on me beforehand in this world,\" God’s messenger said, “Glory be to God! You are not capable of it or able to endure it.” He then asked why he had not said, \"O God bring us blessing in this world, blessing in the next, and guard us from the punishment of hell.\"  said:","text":"The man used it in supplication to God, and God healed him. \n\nMuslim transmitted it."}},{"id":271,"idInBook":271,"chapterId":9,"bookId":14,"arabic":"وَعَنْ حُذَيْفَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَنْبَغِي لِلْمُؤْمِنِ أَنْ يُذِلَّ نَفْسَهُ» . قَالُوا: وَكَيْفَ يُذِلُّ نَفْسَهُ؟ قَالَ: «يَتَعَرَّضُ مِنَ الْبَلَاءِ لِمَا لَا يُطِيقُ» رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ وَالْبَيْهَقِيُّ فِي شُعَبِ الْإِيمَانِ. وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيث حسن غَرِيب","english":{"narrator":"","text":"Hudhaifa reported God’s messenger as saying, “It is not fitting for a believer to demean himself.\" On being asked how he could demean himself he replied, “By exposing himself to a calamity which he has not the capacity to endure.\" \n\nTirmidhi, Ibn Majah and Baihaqi, in Shu'ab al-iman, transmitted it, Tirmidhi saying this is a hasan gharib tradition."}},{"id":272,"idInBook":272,"chapterId":9,"bookId":14,"arabic":"وَعَنْ عُمَرَ رَضِيَ اللَّهُ عَنْهُ قَالَ: عَلَّمَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" قُلْ: اللَّهُمَّ اجْعَلْ سَرِيرَتِي خَيْرًا مِنْ عَلَانِيَتِي وَاجْعَلْ عَلَانِيَتِي صَالِحَةً اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ صَالِحِ مَا تُؤْتِي النَّاسَ مِنَ الْأَهْلِ وَالْمَالِ وَالْوَلَدِ غَيْرِ الضَّالِّ وَلَا الْمُضِلِّ \" رَوَاهُ التِّرْمِذِيُّ","english":{"narrator":"","text":"‘Umar told that God’s messenger taught him to say, “O God, make my inner nature better than my outer, and make my outer nature good. O God, I ask Thee to give me some of the abundance Thou givest to men, in family, property and children, which neither strays nor leads astray.\"\n\nTirmidhi transmitted it."}}],"chapter":{"id":9,"bookId":14,"arabic":"كتاب الدعوات","english":"Supplications"}}