{"metadata":{"length":171,"arabic":{"title":"سنن ابن ماجه","author":"الإمام محمد بن يزيد بن ماجه القزويني","introduction":"كتاب التجارات"},"english":{"title":"Sunan Ibn Majah","author":"Imam Muhammad ibn Yazid Ibn Majah al-Qazwini","introduction":"The Chapters on Business Transactions"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ بْنِ حَبِيبٍ، قَالُوا حَدَّثَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا الأَعْمَشُ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ إِنَّ أَطْيَبَ مَا أَكَلَ الرَّجُلُ مِنْ كَسْبِهِ وَإِنَّ وَلَدَهُ مِنْ كَسْبِهِ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from 'Aishah that the Messenger of Allah (ﷺ) said:","text":"'The best (most pure) food a man consumes is that which he has earned himself, and his child (and his child's wealth) is part of his earnings.\""}},{"id":2,"idInBook":2,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ، عَنْ بَحِيرِ بْنِ سَعْدٍ، عَنْ خَالِدِ بْنِ مَعْدَانَ، عَنِ الْمِقْدَامِ بْنِ مَعْدِيكَرِبَ الزُّبَيْدِيِّ، عَنْ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ مَا كَسَبَ الرَّجُلُ كَسْبًا أَطْيَبَ مِنْ عَمَلِ يَدِهِ وَمَا أَنْفَقَ الرَّجُلُ عَلَى نَفْسِهِ وَأَهْلِهِ وَوَلَدِهِ وَخَادِمِهِ فَهُوَ صَدَقَةٌ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from Miqdam bin Ma'dikarib (Ar- Zubaidi) that the Messenger of Allah (ﷺ) said:","text":"\"No man earns anything better than that which he earns with his own hands, and what a man spends on himself, his wife, his child and his servant, then it is charity.\""}},{"id":3,"idInBook":3,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ سِنَانٍ، حَدَّثَنَا كَثِيرُ بْنُ هِشَامٍ، حَدَّثَنَا كُلْثُومُ بْنُ جَوْشَنٍ الْقُشَيْرِيُّ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ التَّاجِرُ الأَمِينُ الصَّدُوقُ الْمُسْلِمُ مَعَ الشُّهَدَاءِ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from Ibn 'Umar that the Messenger of Allah (ﷺ) said:","text":"'The trustworthy, honest Muslim merchant will be with the martyrs on the Day of Resurrection.\""}},{"id":4,"idInBook":4,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ الدَّرَاوَرْدِيُّ، عَنْ ثَوْرِ بْنِ زَيْدٍ الدِّيلِيِّ، عَنْ أَبِي الْغَيْثِ، مَوْلَى ابْنِ مُطِيعٍ عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ السَّاعِي عَلَى الأَرْمَلَةِ وَالْمِسْكِينِ كَالْمُجَاهِدِ فِي سَبِيلِ اللَّهِ وَكَالَّذِي يَقُومُ اللَّيْلَ وَيَصُومُ النَّهَارَ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from Abu Hurairah that the Prophet (ﷺ) said:","text":"'The one who strives to support the widow and the poor is like a Mujahid who fights in the cause of Allah, and like one who stands in the night (in voluntary prayer) and fasts by day.\""}},{"id":5,"idInBook":5,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سُلَيْمَانَ، عَنْ مُعَاذِ بْنِ عَبْدِ اللَّهِ بْنِ خُبَيْبٍ، عَنْ أَبِيهِ، عَنْ عَمِّهِ، قَالَ كُنَّا فِي مَجْلِسٍ فَجَاءَ النَّبِيُّ ـ صلى الله عليه وسلم ـ وَعَلَى رَأْسِهِ أَثَرُ مَاءٍ فَقَالَ لَهُ بَعْضُنَا نَرَاكَ الْيَوْمَ طَيِّبَ النَّفْسِ ‏.‏ فَقَالَ ‏\"‏ أَجَلْ وَالْحَمْدُ لِلَّهِ ‏\"‏ ‏.‏ ثُمَّ أَفَاضَ الْقَوْمُ فِي ذِكْرِ الْغِنَى فَقَالَ ‏\"‏ لاَ بَأْسَ بِالْغِنَى لِمَنِ اتَّقَى وَالصِّحَّةُ لِمَنِ اتَّقَى خَيْرٌ مِنَ الْغِنَى وَطِيبُ النَّفْسِ مِنَ النِّعَمِ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from Mu'adh bin 'Abdullah bin Khubaib, from his father, that his paternal uncle said:","text":"\"We were sitting in a gathering, and the Prophet (ﷺ) came with traces of water on his head. One of us said to him: 'We see that you are of good cheer today.' He said: 'Yes, praise is to Allah.' Then he spoke to the people about being rich. He said: 'There is nothing wrong with being rich for one who has piety, but good health for one who has piety is better than riches, and being of good cheer is a blessing.\""}},{"id":6,"idInBook":6,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ، عَنْ عُمَارَةَ بْنِ غَزِيَّةَ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ عَبْدِ الْمَلِكِ بْنِ سَعِيدٍ الأَنْصَارِيِّ، عَنْ أَبِي حُمَيْدٍ السَّاعِدِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ أَجْمِلُوا فِي طَلَبِ الدُّنْيَا فَإِنَّ كُلاًّ مُيَسَّرٌ لِمَا خُلِقَ لَهُ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from Abu Humaid As-Sa'idi that the Messenger of Allah (ﷺ) said:","text":"Be moderate in seeking worldly things, for everyone will be facilitated for which he was created.\""}},{"id":7,"idInBook":7,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ بْنُ بَهْرَامَ، حَدَّثَنَا الْحَسَنُ بْنُ مُحَمَّدِ بْنِ عُثْمَانَ، زَوْجُ بِنْتِ الشَّعْبِيِّ حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ يَزِيدَ الرَّقَاشِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ أَعْظَمُ النَّاسِ هَمًّا الْمُؤْمِنُ الَّذِي يَهُمُّ بِأَمْرِ دُنْيَاهُ وَأَمْرِ آخِرَتِهِ ‏\"‏ ‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ هَذَا حَدِيثٌ غَرِيبٌ تَفَرَّدَ بِهِ إِسْمَاعِيلُ ‏.‏","english":{"narrator":"It was narrated from Anas bin Malik that the Messenger of Allah (ﷺ) said:","text":"The one who has the most concerns is the believer who is concerned about both his worldly affairs and his Hereafter.\"' (Da'if)Abu 'Abdullah said: \"This Hadith is Gharib' Isma'il, alone, has narrated it.\""}},{"id":8,"idInBook":8,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى الْحِمْصِيُّ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، عَنِ ابْنِ جُرَيْجٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ أَيُّهَا النَّاسُ اتَّقُوا اللَّهَ وَأَجْمِلُوا فِي الطَّلَبِ فَإِنَّ نَفْسًا لَنْ تَمُوتَ حَتَّى تَسْتَوْفِيَ رِزْقَهَا وَإِنْ أَبْطَأَ عَنْهَا فَاتَّقُوا اللَّهَ وَأَجْمِلُوا فِي الطَّلَبِ خُذُوا مَا حَلَّ وَدَعُوا مَا حَرُمَ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from Jabir bin 'Abdullah that the Messenger of Allah (ﷺ) said:","text":"\"O people, fear Allah and be moderate in seeking a living, for no soul will die until it has received all its provision, even if it is slow in coming. So fear Allah and be moderate in seeking provision; take that which is permissible and leave that which is forbidden. \""}},{"id":9,"idInBook":9,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ شَقِيقٍ، عَنْ قَيْسِ بْنِ أَبِي غَرَزَةَ، قَالَ كُنَّا نُسَمَّى فِي عَهْدِ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ السَّمَاسِرَةَ فَمَرَّ بِنَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ فَسَمَّانَا بِاسْمٍ هُوَ أَحْسَنُ مِنْهُ فَقَالَ ‏\n\"‏ يَا مَعْشَرَ التُّجَّارِ إِنَّ الْبَيْعَ يَحْضُرُهُ الْحَلِفُ وَاللَّغْوُ فَشُوبُوهُ بِالصَّدَقَةِ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated that Qais bin Abu Gharazah said:","text":"\"At the time of the Messenger of Allah (ﷺ) we used to be called brokers, but the Messenger of Allah (ﷺ) passed by us and called by a name that was better than that. He said: 'O merchants, selling involves (false) oaths and idle talk, so mix some charity with it.\"'"}},{"id":10,"idInBook":10,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ، حَدَّثَنَا يَحْيَى بْنُ سُلَيْمٍ الطَّائِفِيُّ، عَنْ عَبْدِ اللَّهِ بْنِ عُثْمَانَ بْنِ خُثَيْمٍ، عَنْ إِسْمَاعِيلَ بْنِ عُبَيْدِ بْنِ رِفَاعَةَ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، رِفَاعَةَ قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ فَإِذَا النَّاسُ يَتَبَايَعُونَ بُكْرَةً فَنَادَاهُمْ ‏\"‏ يَا مَعْشَرَ التُّجَّارِ ‏\"‏ ‏.‏ فَلَمَّا رَفَعُوا أَبْصَارَهُمْ وَمَدُّوا أَعْنَاقَهُمْ قَالَ ‏\"‏ إِنَّ التُّجَّارَ يُبْعَثُونَ يَوْمَ الْقِيَامَةِ فُجَّارًا إِلاَّ مَنِ اتَّقَى اللَّهَ وَبَرَّ وَصَدَقَ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from Isma'il bin 'Ubaid bin Rifa'ah, from his father, that his grandfather Rifa'ah said:","text":"\"We went out with the Messenger of Allah (ﷺ)  and the people were trading early in the morning. He called them: 'O merchants!' and when they looked up and craned their necks, he said : 'The merchants will be raised on the Day of Resurrection as immoral people, apart from those who fear Allah and act righteously and speak the truth (i.e. those who are honest).\"'"}},{"id":11,"idInBook":11,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا فَرْوَةُ أَبُو يُونُسَ، عَنْ هِلاَلِ بْنِ جُبَيْرٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ مَنْ أَصَابَ مِنْ شَىْءٍ فَلْيَلْزَمْهُ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from Anas bin Malik that the Messenger of Allah (ﷺ) said:","text":"'Whoever achieves at something, let him stick with It.'\""}},{"id":12,"idInBook":12,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا أَبُو عَاصِمٍ، أَخْبَرَنِي أَبِي، عَنِ الزُّبَيْرِ بْنِ عُبَيْدٍ، عَنْ نَافِعٍ، قَالَ كُنْتُ أُجَهِّزُ إِلَى الشَّامِ وَإِلَى مِصْرَ فَجَهَّزْتُ إِلَى الْعِرَاقِ فَأَتَيْتُ عَائِشَةَ أُمَّ الْمُؤْمِنِينَ فَقُلْتُ لَهَا يَا أُمَّ الْمُؤْمِنِينَ كُنْتُ أُجَهِّزُ إِلَى الشَّامِ فَجَهَّزْتُ إِلَى الْعِرَاقِ ‏.‏ فَقَالَتْ لاَ تَفْعَلْ مَالَكَ وَلِمَتْجَرِكَ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\n\"‏ إِذَا سَبَّبَ اللَّهُ لأَحَدِكُمْ رِزْقًا مِنْ وَجْهٍ فَلاَ يَدَعْهُ حَتَّى يَتَغَيَّرَ لَهُ أَوْ يَتَنَكَّرَ لَهُ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated that Nafi' said:","text":"I used to send trade goods to Sham and Egypt, then I prepared to send trade goods to 'Iraq. I went to 'Aishah, the Mother of the Believers, and said to her: \" O Mother of the Believers I used to send trade goods to Sham and I am preparing to send trade goods to 'Iraq.\" She said: \"Do not do that. What is wrong with the way you have been doing it? I heard the Messenger of Allah (ﷺ) say: 'If Allah causes provision to come to one of you through a certain means, he should not leave it unless it changes or deteriorates.\""}},{"id":13,"idInBook":13,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا عَمْرُو بْنُ يَحْيَى بْنِ سَعِيدٍ الْقُرَشِيُّ، عَنْ جَدِّهِ، سَعِيدِ بْنِ أَبِي أُحَيْحَةَ عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ مَا بَعَثَ اللَّهُ نَبِيًّا إِلاَّ رَاعِيَ غَنَمٍ ‏\"‏ ‏.‏ قَالَ لَهُ أَصْحَابُهُ وَأَنْتَ يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\"‏ وَأَنَا كُنْتُ أَرْعَاهَا لأَهْلِ مَكَّةَ بِالْقَرَارِيطِ ‏\"‏ ‏.‏ قَالَ سُوَيْدٌ يَعْنِي كُلُّ شَاةٍ بِقِيرَاطٍ ‏.‏","english":{"narrator":"It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:","text":"\"Allah has not sent any Prophet but he was a shepherd.\" His Companions said to him: \"Even you, O Messenger of Allah?\" He said: \"Even me I used to tend the sheep of the people of Makkah for a few Qirats.\" (Sahih)(One of the narrators) Suwaid said: \" Meaning one Qirat for every sheep.\""}},{"id":14,"idInBook":14,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الْخُزَاعِيُّ، وَالْحَجَّاجُ، وَالْهَيْثَمُ بْنُ جَمِيلٍ، قَالُوا حَدَّثَنَا حَمَّادٌ، عَنْ ثَابِتٍ، عَنْ أَبِي رَافِعٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ كَانَ زَكَرِيَّا نَجَّارًا ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:","text":"\"Zakariyya was a carpenter.\""}},{"id":15,"idInBook":15,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنْ نَافِعٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ إِنَّ أَصْحَابَ الصُّوَرِ يُعَذَّبُونَ يَوْمَ الْقِيَامَةِ يُقَالُ لَهُمْ أَحْيُوا مَا خَلَقْتُمْ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from 'Aishah that the Messenger of Allah (ﷺ) said:","text":"\"The image-makers will be punished on the Day of Resurrection and will be told: 'Give life to that which you have created.' \""}},{"id":16,"idInBook":16,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ، حَدَّثَنَا عُمَرُ بْنُ هَارُونَ، عَنْ هَمَّامٍ، عَنْ فَرْقَدٍ السَّبَخِيِّ، عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ أَكْذَبُ النَّاسِ الصَّبَّاغُونَ وَالصَّوَّاغُونَ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:","text":"\"The most dishonest of people are the dyers and the goldsmiths. \""}},{"id":17,"idInBook":17,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، حَدَّثَنَا أَبُو أَحْمَدَ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ عَلِيِّ بْنِ سَالِمِ بْنِ ثَوْبَانَ، عَنْ عَلِيِّ بْنِ زَيْدِ بْنِ جُدْعَانَ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ عُمَرَ بْنِ الْخَطَّابِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ الْجَالِبُ مَرْزُوقٌ وَالْمُحْتَكِرُ مَلْعُونٌ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from 'Umar bin Khattab that the Messenger of Allah (ﷺ) said:","text":"\"The importer is blessed with provision and the hoarder is cursed.\""}},{"id":18,"idInBook":18,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ مَعْمَرِ بْنِ عَبْدِ اللَّهِ بْنِ نَضْلَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ لاَ يَحْتَكِرُ إِلاَّ خَاطِئٌ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from Ma'mar bin 'Abdullah bin Nadlah that the Messenger of Allah (ﷺ) said:","text":"\"No one hoards but a sinner.\"'"}},{"id":19,"idInBook":19,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ، حَدَّثَنَا أَبُو بَكْرٍ الْحَنَفِيُّ، حَدَّثَنَا الْهَيْثَمُ بْنُ رَافِعٍ، حَدَّثَنِي أَبُو يَحْيَى الْمَكِّيُّ، عَنْ فَرُّوخَ، مَوْلَى عُثْمَانَ بْنِ عَفَّانَ عَنْ عُمَرَ بْنِ الْخَطَّابِ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\n\"‏ مَنِ احْتَكَرَ عَلَى الْمُسْلِمِينَ طَعَامَهُمْ ضَرَبَهُ اللَّهُ بِالْجُذَامِ وَالإِفْلاَسِ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated that 'Umar bin Khattab said:","text":"\"I heard the Messenger of Allah (ﷺ) say: 'Whoever hoards food (and keeps it from) the Muslims, Allah will afflict him with leprosy and bankruptcy.\"'"}},{"id":20,"idInBook":20,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا الأَعْمَشُ، عَنْ جَعْفَرِ بْنِ إِيَاسٍ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ بَعَثَنَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ثَلاَثِينَ رَاكِبًا فِي سَرِيَّةٍ فَنَزَلْنَا بِقَوْمٍ فَسَأَلْنَاهُمْ أَنْ يَقْرُونَا فَأَبَوْا فَلُدِغَ سَيِّدُهُمْ فَأَتَوْنَا فَقَالُوا أَفِيكُمْ أَحَدٌ يَرْقِي مِنَ الْعَقْرَبِ فَقُلْتُ نَعَمْ أَنَا وَلَكِنْ لاَ أَرْقِيهِ حَتَّى تُعْطُونَا غَنَمًا ‏.‏ قَالُوا فَإِنَّا نُعْطِيكُمْ ثَلاَثِينَ شَاةً ‏.‏ فَقَبِلْنَاهَا فَقَرَأْتُ عَلَيْهِ ‏(‏ الْحَمْدُ ‏)‏ سَبْعَ مَرَّاتٍ فَبَرِئَ وَقَبَضْنَا الْغَنَمَ فَعَرَضَ فِي أَنْفُسِنَا مِنْهَا شَىْءٌ فَقُلْنَا لاَ تَعْجَلُوا حَتَّى نَأْتِيَ النَّبِيَّ ـ صلى الله عليه وسلم ـ فَلَمَّا قَدِمْنَا ذَكَرْتُ لَهُ الَّذِي صَنَعْتُ فَقَالَ ‏\n\"‏ أَوَ مَا عَلِمْتَ أَنَّهَا رُقْيَةٌ اقْتَسِمُوهَا وَاضْرِبُوا لِي مَعَكُمْ سَهْمًا ‏\"‏ ‏.‏ \n حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا هُشَيْمٌ، حَدَّثَنَا أَبُو بِشْرٍ، عَنْ أَبِي الْمُتَوَكِّلِ، عَنْ أَبِي سَعِيدٍ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ بِنَحْوِهِ ح وَحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي بِشْرٍ، عَنْ أَبِي الْمُتَوَكِّلِ، عَنْ أَبِي سَعِيدٍ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ بِنَحْوِهِ ‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ وَالصَّوَابُ هُوَ أَبُو الْمُتَوَكِّلِ إِنْ شَاءَ اللَّهُ ‏.‏","english":{"narrator":"It was narrated that Abu Sa'eed Al-Khudri said:","text":"\"The Messenger of Allah (ﷺ) sent us, thirty horsemen, on a military campaign. We camped near some people and asked them for hospitality but they refused. Then their leader was stung by a scorpion and they said: 'Is there anyone among you who can recite Ruqyah for a scorpion sting?' I said: 'Yes, I can, but I will not recite Ruqyah for him until you give us some sheep.' They said: 'We will give you thirty sheep.' So we accepted them, and I recited Al-Hamd (i.e. Al-Fatihah) over him seven times. Then he recovered, and I took the sheep. Then some doubts occurred within ourselves. Then we said: 'Let us not hasten (to make a decision concerning the sheep) until we come to the Prophet (ﷺ)' So when we came back: 'I told him what I had done. He said: 'How did you know that it is a Ruqyah? Divide them up and give me a share as well.'\""}},{"id":21,"idInBook":21,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، وَمُحَمَّدُ بْنُ إِسْمَاعِيلَ، قَالاَ حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا مُغِيرَةُ بْنُ زِيَادٍ الْمَوْصِلِيُّ، عَنْ عُبَادَةَ بْنِ نُسَىٍّ، عَنِ الأَسْوَدِ بْنِ ثَعْلَبَةَ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، قَالَ عَلَّمْتُ نَاسًا مِنْ أَهْلِ الصُّفَّةِ الْقُرْآنَ وَالْكِتَابَةَ فَأَهْدَى إِلَىَّ رَجُلٌ مِنْهُمْ قَوْسًا فَقُلْتُ لَيْسَتْ بِمَالٍ وَأَرْمِي عَنْهَا فِي سَبِيلِ اللَّهِ فَسَأَلْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ عَنْهَا فَقَالَ ‏\n\"‏ إِنْ سَرَّكَ أَنْ تُطَوَّقَ بِهَا طَوْقًا مِنْ نَارٍ فَاقْبَلْهَا ‏\"‏ ‏.‏","english":{"narrator":"It was narrated that 'Ubadah bin Samit said:","text":"\"I taught people from Ahtus-Suffah\" Qur'an and how to write, and one of them gave me a bow. I said: 'It is not money, and I can shoot (with it) for the sake of Allah., I asked the Messenger of Allah (ﷺ) about it and he said: 'If it would please you to have a necklace of fire placed around your neck, then accept it.'\""}},{"id":22,"idInBook":22,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا سَهْلُ بْنُ أَبِي سَهْلٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ ثَوْرِ بْنِ يَزِيدَ، حَدَّثَنَا خَالِدُ بْنُ مَعْدَانَ، حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ سَلْمٍ، عَنْ عَطِيَّةَ الْكَلاَعِيِّ، عَنْ أُبَىِّ بْنِ كَعْبٍ، قَالَ عَلَّمْتُ رَجُلاً الْقُرْآنَ فَأَهْدَى إِلَىَّ قَوْسًا فَذَكَرْتُ ذَلِكَ لِرَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ فَقَالَ ‏\n\"‏ إِنْ أَخَذْتَهَا أَخَذْتَ قَوْسًا مِنْ نَارٍ ‏\"‏ ‏.‏ فَرَدَدْتُهَا ‏.‏","english":{"narrator":"It was narrated that Ubayy bin Ka'b said:","text":"\"I taught a man the Qur'an, and he gave me a bow. I mentioned that to the Messenger of Allah (ﷺ) and he said: 'If you accept it you will be accepting a bow of fire.' So I returned it.\""}},{"id":23,"idInBook":23,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، وَمُحَمَّدُ بْنُ الصَّبَّاحِ، قَالاَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي مَسْعُودٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ نَهَى عَنْ ثَمَنِ الْكَلْبِ وَمَهْرِ الْبَغِيِّ وَحُلْوَانِ الْكَاهِنِ ‏.‏","english":{"narrator":"It was narrated from Abu Mas'ud that :","text":"the Prophet (ﷺ) forbade the price of a dog, the payment (given to a prostitute) and the payment made to a soothsayer."}},{"id":24,"idInBook":24,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، وَمُحَمَّدُ بْنُ طَرِيفٍ، قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، حَدَّثَنَا الأَعْمَشُ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنْ ثَمَنِ الْكَلْبِ وَعَسْبِ الْفَحْلِ‏.‏","english":{"narrator":"It was narrated that Abu Hurairah said:","text":"\"The Messenger of Allah (ﷺ) forbade the price of a dog and studding a stallion.\""}},{"id":25,"idInBook":25,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا الْوَلِيدُ، أَنْبَأَنَا ابْنُ لَهِيعَةَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنْ ثَمَنِ السِّنَّوْرِ ‏.‏","english":{"narrator":"lt was narrated from Abu Az-Zubair that Jabir said:","text":"\"The Messenger of Allah (ﷺ) forbade the price of a cat.\""}},{"id":26,"idInBook":26,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُمَرَ الْعَدَنِيُّ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ احْتَجَمَ وَأَعْطَاهُ أَجْرَهُ ‏.‏ قَالَ ابْنُ مَاجَهْ تَفَرَّدَ بِهِ ابْنُ أَبِي عُمَرَ وَحْدَهُ ‏.‏","english":{"narrator":"It was narrated from Ibn 'Abbas that :","text":"the Prophet (ﷺ) was treated with cupping and he gave him (the cupper) his wages. (Sahih)Ibn Abu 'Umar was alone in narrating it. That was said by Ibn Majah. "}},{"id":27,"idInBook":27,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ أَبُو حَفْصٍ الصَّيْرَفِيُّ، حَدَّثَنَا أَبُو دَاوُدَ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبَادَةَ الْوَاسِطِيُّ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، قَالاَ حَدَّثَنَا وَرْقَاءُ، عَنْ عَبْدِ الأَعْلَى، عَنْ أَبِي جَمِيلَةَ عَنْ عَلِيٍّ، قَالَ احْتَجَمَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ وَأَمَرَنِي فَأَعْطَيْتُ الْحَجَّامَ أَجْرَهُ ‏.‏","english":{"narrator":"It was narrated that 'Ali said:","text":"\"The Messenger of Allah (ﷺ) was treated with cupping and he told me to give the cupper his wages.\""}},{"id":28,"idInBook":28,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ بَيَانٍ الْوَاسِطِيُّ، حَدَّثَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ، عَنْ يُونُسَ، عَنِ ابْنِ سِيرِينَ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ احْتَجَمَ وَأَعْطَى الْحَجَّامَ أَجْرَهُ ‏.‏","english":{"narrator":"It was narrated from Anas bin Malik that:","text":"the Prophet (ﷺ) was treated with cupping and gave the cupper his wages."}},{"id":29,"idInBook":29,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ، حَدَّثَنِي الأَوْزَاعِيُّ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ، عَنْ أَبِي مَسْعُودٍ، عُقْبَةَ بْنِ عَمْرٍو قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنْ كَسْبِ الْحَجَّامِ ‏.‏","english":{"narrator":"It was narrated that Abu Mas'ud, 'Uqbah bin 'Amr, said:","text":"\"The Messenger of Allah (ﷺ), forbade the earnings of a cupper.\""}},{"id":30,"idInBook":30,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا شَبَابَةُ بْنُ سَوَّارٍ، عَنِ ابْنِ أَبِي ذِئْبٍ، عَنِ الزُّهْرِيِّ، عَنْ حَرَامِ بْنِ مُحَيِّصَةَ، عَنْ أَبِيهِ، أَنَّهُ سَأَلَ النَّبِيَّ ـ صلى الله عليه وسلم ـ عَنْ كَسْبِ الْحَجَّامِ فَنَهَاهُ عَنْهُ فَذَكَرَ لَهُ الْحَاجَةَ فَقَالَ ‏\n\"‏ اعْلِفْهُ نَوَاضِحَكَ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from  Haram bin Munayyisah that :","text":"his father asked the Prophet (ﷺ) about the earnings of a cupper and he forbade him from that. Then he mentioned his need and he said: \"Spend it on feeding your she-camels that draw water.\""}},{"id":31,"idInBook":31,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا عِيسَى بْنُ حَمَّادٍ الْمِصْرِيُّ، أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، أَنَّهُ قَالَ قَالَ عَطَاءُ بْنُ أَبِي رَبَاحٍ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَامَ الْفَتْحِ وَهُوَ بِمَكَّةَ ‏\"‏ إِنَّ اللَّهَ وَرَسُولَهُ حَرَّمَ بَيْعَ الْخَمْرِ وَالْمَيْتَةِ وَالْخِنْزِيرِ وَالأَصْنَامِ ‏\"‏ ‏.‏ فَقِيلَ لَهُ عِنْدَ ذَلِكَ يَا رَسُولَ اللَّهِ أَرَأَيْتَ شُحُومَ الْمَيْتَةِ فَإِنَّهُ يُدْهَنُ بِهَا السُّفُنُ وَيُدْهَنُ بِهَا الْجُلُودُ وَيَسْتَصْبِحُ بِهَا النَّاسُ قَالَ ‏\"‏ لاَ هُنَّ حَرَامٌ ‏\"‏ ‏.‏ ثُمَّ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ قَاتَلَ اللَّهُ الْيَهُودَ إِنَّ اللَّهَ حَرَّمَ عَلَيْهِمُ الشُّحُومَ فَأَجْمَلُوهُ ثُمَّ بَاعُوهُ فَأَكَلُوا ثَمَنَهُ ‏\"‏ ‏.‏","english":{"narrator":"Ata' bin Abu Rabah said:","text":"I heard Jabir bin 'Abdullah say: \"In the Year of the Conquest, while he was in Makkah the Messenger of Allah (ﷺ), said: 'Allah and His Messenger have forbidden the sale of wines, meat of dead animals, pigs and 'idols.' It was said to him: 'O Messenger of Allah, what do you think of the fat of dead animals, for it is used to caulk ships, it is daubed on animal skins and people use it to light their lamps?' He said: 'No, it is unlawful.' Then the Messenger of Allah (ﷺ) said: 'May Allah curse the jews, for Allah forbade them the fat (of animals) but they rendered it, (i.e. melted it) sold it and consumed its price.\"'"}},{"id":32,"idInBook":32,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ يَحْيَى بْنِ سَعِيدٍ الْقَطَّانُ، حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ، حَدَّثَنَا أَبُو جَعْفَرٍ الرَّازِيُّ، عَنْ عَاصِمٍ، عَنْ أَبِي الْمُهَلَّبِ، عَنْ عُبَيْدِ اللَّهِ الإِفْرِيقِيِّ، عَنْ أَبِي أُمَامَةَ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنْ بَيْعِ الْمُغَنِّيَاتِ وَعَنْ شِرَائِهِنَّ وَعَنْ كَسْبِهِنَّ وَعَنْ أَكْلِ أَثْمَانِهِنَّ ‏.‏","english":{"narrator":"It was narrated that Abu Umamah said:","text":"\"The Messenger of Allah, forbade selling or buying singing girls, and their wages, and consuming their price.\""}},{"id":33,"idInBook":33,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، وَأَبُو أُسَامَةَ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ حَفْصِ بْنِ عَاصِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنْ بَيْعَتَيْنِ عَنِ الْمُلاَمَسَةِ وَالْمُنَابَذَةِ ‏.‏","english":{"narrator":"It was narrated that Abu Hurairah said:","text":"\"The Messenger of Allah (ﷺ) forbade two kinds of transactions: Mulimasah and Mundbadhah."}},{"id":34,"idInBook":34,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَسَهْلُ بْنُ أَبِي سَهْلٍ، قَالاَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ نَهَى عَنِ الْمُلاَمَسَةِ وَالْمُنَابَذَةِ ‏.‏ زَادَ سَهْلٌ قَالَ سُفْيَانُ الْمُلاَمَسَةُ أَنْ يَلْمِسَ الرَّجُلُ الشَّىْءَ بِيَدِهِ وَلاَ يَرَاهُ وَالْمُنَابَذَةُ أَنْ يَقُولَ أَلْقِ إِلَىَّ مَا مَعَكَ وَأُلْقِي إِلَيْكَ مَا مَعِي ‏.‏","english":{"narrator":"It was narrated from Abu Sa'eed Al-Khudri that  :","text":"the Messenger of Allah (ﷺ) forbade Mulamasah and Munabadhah. (Sahih) Sahl added: \"Sufyan said: 'Mulamasah means when a man touches something with his hand without seeing it, and Munabadhah means when he says: \"Toss me what you have, and I will toss you what have.\""}},{"id":35,"idInBook":35,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ لاَ يَبِيعُ بَعْضُكُمْ عَلَى بَيْعِ بَعْضٍ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from Ibn 'Umar that the Messenger of Allah (ﷺ) said:","text":"\"Let one of you not undersell another.\""}},{"id":36,"idInBook":36,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ لاَ يَبِيعُ الرَّجُلُ عَلَى بَيْعِ أَخِيهِ وَلاَ يَسُومُ عَلَى سَوْمِ أَخِيهِ ‏\"‏ ‏.‏","english":{"narrator":"lt was narrated from Abu Hurairah that the Prophet (ﷺ) said:","text":"\"A man is not to undersell his brother, nor is he to fry to outhaggle his brother.\""}},{"id":37,"idInBook":37,"chapterId":12,"bookId":6,"arabic":"قَرَأْتُ عَلَى مُصْعَبِ بْنِ عَبْدِ اللَّهِ الزُّبَيْرِيِّ عَنْ مَالِكٍ، ح وَحَدَّثَنَا أَبُو حُذَافَةَ، حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ نَهَى عَنِ النَّجْشِ ‏.‏","english":{"narrator":"It was narrated from Ibn 'Umar that :","text":"the Prophet (ﷺ) forbade the Najsh."}},{"id":38,"idInBook":38,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، وَسَهْلُ بْنُ أَبِي سَهْلٍ، قَالاَ حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ لاَ تَنَاجَشُوا ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from Abu Hurairah that the Prophet said:","text":"\"Do not practice Najsh.\""}},{"id":39,"idInBook":39,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ لاَ يَبِيعُ حَاضِرٌ لِبَادٍ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:","text":"\"A City-dweller should not sell for a Bedouin.\""}},{"id":40,"idInBook":40,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ لاَ يَبِيعُ حَاضِرٌ لِبَادٍ دَعُوا النَّاسَ يَرْزُقُ اللَّهُ بَعْضَهُمْ مِنْ بَعْضٍ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from Jabir bin 'Abdullah that the Prophet (ﷺ) said:","text":"\"A city-dweller should not sell for a Bedouin. Leave people to (engage in trade) and Allah will grant them provision through one another.\""}},{"id":41,"idInBook":41,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا الْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ الْعَنْبَرِيُّ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَنْبَأَنَا مَعْمَرٌ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ أَنْ يَبِيعَ حَاضِرٌ لِبَادٍ ‏.‏ قُلْتُ لاِبْنِ عَبَّاسٍ مَا قَوْلُهُ حَاضِرٌ لِبَادٍ قَالَ لاَ يَكُونُ لَهُ سِمْسَارًا ‏.‏","english":{"narrator":"Ibn Tawus narrated from his father that Ibn 'Abbas said:","text":"\"The Messenger of Allah (ﷺ) forbade a city-dweller to sell for a Bedouin.\" (Sahih)I (Tawus) said to Ibn 'Abbas: \"What is meant by the words: 'A city-dweller selling for a Bedouin?' He said: \"He should not be a broker for him.\""}},{"id":42,"idInBook":42,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا أَبُو أُسَامَةَ، عَنِ هِشَامِ بْنِ حَسَّانَ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ لاَ تَلَقَّوُا الأَجْلاَبَ فَمَنْ تَلَقَّى مِنْهُ شَيْئًا فَاشْتَرَى فَصَاحِبُهُ بِالْخِيَارِ إِذَا أَتَى السُّوقَ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from Abu Hurairah that the Prophet (ﷺ) said:","text":"\"Do not meet the traders on the way, and whoever meets any of them and buys from him, the vendor has the choice of annulling the transaction when he comes to the marketplace.''"}},{"id":43,"idInBook":43,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنْ تَلَقِّي الْجَلَبِ ‏.‏","english":{"narrator":"It was narrated that Ibn 'Umar said:","text":"\"The Messenger of Allah (ﷺ) forbade meeting traders on the way.\""}},{"id":44,"idInBook":44,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، وَحَمَّادُ بْنُ مَسْعَدَةَ، عَنْ سُلَيْمَانَ التَّيْمِيِّ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ بْنِ حَبِيبِ بْنِ الشَّهِيدِ، حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ، قَالَ سَمِعْتُ أَبِي قَالَ، حَدَّثَنَا أَبُو عُثْمَانَ النَّهْدِيُّ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنْ تَلَقِّي الْبُيُوعِ ‏.‏","english":{"narrator":"It was narrated that 'Abdullah bin Mas'ud said:","text":"\"The Messenger of Allah (ﷺ) forbade. meeting the owners of goods (away from the market).\""}},{"id":45,"idInBook":45,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ الْمِصْرِيُّ، أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ إِذَا تَبَايَعَ الرَّجُلاَنِ فَكُلُّ وَاحِدٍ مِنْهُمَا بِالْخِيَارِ مَا لَمْ يَتَفَرَّقَا وَكَانَا جَمِيعًا أَوْ يُخَيِّرْ أَحَدُهُمَا الآخَرَ فَإِنْ خَيَّرَ أَحَدُهُمَا الآخَرَ فَتَبَايَعَا عَلَى ذَلِكَ فَقَدْ وَجَبَ الْبَيْعُ ‏.‏ وَإِنْ تَفَرَّقَا بَعْدَ أَنْ تَبَايَعَا وَلَمْ يَتْرُكْ وَاحِدٌ مِنْهُمَا الْبَيْعَ فَقَدْ وَجَبَ الْبَيْعُ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from 'Abdullah bin 'Umar that the Messenger of Allah said:","text":"\"When two men enter into a transaction, each of them has the choice (of annulling it) so long as they have not yet parted and are still together, or one of them has given the option or choice to the other. Once he has accepted the terms of the other, then the transaction is binding. If they part after concluding the transaction and neither of them has rescinded the transaction then the transaction is binding.”"}},{"id":46,"idInBook":46,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ، وَأَحْمَدُ بْنُ الْمِقْدَامِ، قَالاَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ جَمِيلِ بْنِ مُرَّةَ، عَنْ أَبِي الْوَضِيءِ، عَنْ أَبِي بَرْزَةَ الأَسْلَمِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ الْبَيِّعَانِ بِالْخِيَارِ مَا لَمْ يَتَفَرَّقَا ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from Abu Barzah Al-Aslami that the Messenger of Allah (ﷺ) said:","text":"”The two parties to a transaction have the choice (of annulling it) so long as they have not yet parted.\""}},{"id":47,"idInBook":47,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، وَإِسْحَاقُ بْنُ مَنْصُورٍ، قَالاَ حَدَّثَنَا عَبْدُ الصَّمَدِ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ سَمُرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ الْبَيِّعَانِ بِالْخِيَارِ مَا لَمْ يَتَفَرَّقَا ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from Samurah that the Messenger of Allah (ﷺ) said:","text":"\"The two parties to a transaction have the choice (of annulling it) so long as they have not yet parted. \""}},{"id":48,"idInBook":48,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى، وَأَحْمَدُ بْنُ عِيسَى الْمِصْرِيَّانِ، قَالاَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي ابْنُ جُرَيْجٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ اشْتَرَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ مِنْ رَجُلٍ مِنَ الأَعْرَابِ حِمْلَ خَبَطٍ فَلَمَّا وَجَبَ الْبَيْعُ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ اخْتَرْ ‏\"‏ ‏.‏ فَقَالَ الأَعْرَابِيُّ عَمْرَكَ اللَّهَ بَيِّعًا ‏.‏","english":{"narrator":"It was narrated that Jabir bin' Abdullah said:","text":"\"The Messenger of Allah (ﷺ) bought a load of fodder from a Bedouin man. When the transaction was concluded, the Messenger of Allah (ﷺ) said: 'Choose (either to go ahead or to cancel the transaction).' The Bedouin said: 'May Allah grant you a long life of good transaction!\"'"}},{"id":49,"idInBook":49,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا الْعَبَّاسُ بْنُ الْوَلِيدِ الدِّمَشْقِيُّ، حَدَّثَنَا مَرْوَانُ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، عَنْ دَاوُدَ بْنِ صَالِحٍ الْمَدَنِيِّ، عَنْ أَبِيهِ، قَالَ سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ، يَقُولُ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ إِنَّمَا الْبَيْعُ عَنْ تَرَاضٍ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from Dawud bin Salih Al Madani that his father said:","text":"I heard Abu Sa'eed Al-Khudri say: \"The Messenger of Allah (ﷺ) said: 'Transactions may only be done by mutual consent.\"'"}},{"id":50,"idInBook":50,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ الصَّبَّاحِ، قَالاَ حَدَّثَنَا هُشَيْمٌ، أَنْبَأَنَا ابْنُ أَبِي لَيْلَى، عَنِ الْقَاسِمِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِيهِ، أَنَّ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ، بَاعَ مِنَ الأَشْعَثِ بْنِ قَيْسٍ رَقِيقًا مِنْ رَقِيقِ الإِمَارَةِ فَاخْتَلَفَا فِي الثَّمَنِ ‏.‏ فَقَالَ ابْنُ مَسْعُودٍ بِعْتُكَ بِعِشْرِينَ أَلْفًا ‏.‏ وَقَالَ الأَشْعَثُ بْنُ قَيْسٍ إِنَّمَا اشْتَرَيْتُ مِنْكَ بِعَشْرَةِ آلاَفٍ ‏.‏ فَقَالَ عَبْدُ اللَّهِ إِنْ شِئْتَ حَدَّثْتُكَ بِحَدِيثٍ سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ ‏.‏ فَقَالَ هَاتِهِ ‏.‏ قَالَ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\n\"‏ إِذَا اخْتَلَفَ الْبَيِّعَانِ وَلَيْسَ بَيْنَهُمَا بَيِّنَةٌ وَالْبَيْعُ قَائِمٌ بِعَيْنِهِ فَالْقَوْلُ مَا قَالَ الْبَائِعُ أَوْ يَتَرَادَّانِ الْبَيْعَ ‏\"‏ ‏.‏ قَالَ فَإِنِّي أَرَى أَنْ أَرُدَّ الْبَيْعَ ‏.‏ فَرَدَّهُ ‏.‏","english":{"narrator":"It was narrated from Qasim bin 'Abdur Rahman from his father that :","text":"Abdullah bin Mas'ud sold one of the slaves from the state to Ash'ath bin Qais, and they differed concerning the price. Ibn Mas'ud said: \"I sold him to you for twenty thousand,' but Ash'ath bin Qais said: \"I bought him from you for ten thousand.\" 'Abdullah said: \"If you want, I will tell you a Hadith which I heard from the Messenger of Allah (ﷺ)\" He said: \"Tell me it.\" He said: \"I heard the Messenger of Allah (ﷺ) say: 'If two parties to a transaction differ, and they have no proof, and the sale item remains (unredeemed), then what the seller says is valid. Or they may cancel the transaction.\" He said: \"I want to cancel the transaction.\" And he cancelled it."}},{"id":51,"idInBook":51,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي بِشْرٍ، قَالَ سَمِعْتُ يُوسُفَ بْنَ مَاهَكَ، يُحَدِّثُ عَنْ حَكِيمِ بْنِ حِزَامٍ، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ الرَّجُلُ يَسْأَلُنِي الْبَيْعَ وَلَيْسَ عِنْدِي أَفَأَبِيعُهُ قَالَ ‏\n\"‏ لاَ تَبِعْ مَا لَيْسَ عِنْدَكَ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated that Hakim bin Hizam said:","text":"\"I said: 'O Messenger of Allah, a man is asking me to sell him something that I do not possess; Shall I sell it to him?' He said: 'Do not sell what is not with you.\"'"}},{"id":52,"idInBook":52,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا أَزْهَرُ بْنُ مَرْوَانَ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، ح وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، قَالاَ حَدَّثَنَا أَيُّوبُ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ لاَ يَحِلُّ بَيْعُ مَا لَيْسَ عِنْدَكَ وَلاَ رِبْحُ مَا لَمْ يُضْمَنْ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from 'Amr bin Shu'aib, from his father, that his grandfather said:","text":"\"The Messenger of Allah (ﷺ) said: 'It is not permissible to sell something that is not with you, nor to profit from what  you do not possess.\"'"}},{"id":53,"idInBook":53,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ الْفُضَيْلِ، عَنْ لَيْثٍ، عَنْ عَطَاءٍ، عَنْ عَتَّابِ بْنِ أَسِيدٍ، قَالَ لَمَّا بَعَثَهُ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ إِلَى مَكَّةَ نَهَاهُ عَنْ شِفِّ مَا لَمْ يُضْمَنْ ‏.‏","english":{"narrator":"It was narrated from 'Ata that 'Attab bin Asid said that :","text":"when the Messenger of Allah (ﷺ) sent him to Makkah, he forbade him from profiting off of what he did not possess."}},{"id":54,"idInBook":54,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ عُقْبَةَ بْنِ عَامِرٍ، أَوْ سَمُرَةَ بْنِ جُنْدُبٍ عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ أَيُّمَا رَجُلٍ بَاعَ بَيْعًا مِنْ رَجُلَيْنِ فَهُوَ لِلأَوَّلِ مِنْهُمَا ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from 'Uqbah bin 'Amir or Samurah bin Jundab that the Messenger of Allah (ﷺ) said:","text":"\"Any man who sells to two men, it is for the one who was first.\""}},{"id":55,"idInBook":55,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا الْحُسَيْنُ بْنُ أَبِي السَّرِيِّ الْعَسْقَلاَنِيُّ، وَمُحَمَّدُ بْنُ إِسْمَاعِيلَ، قَالاَ حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا سَعِيدُ بْنُ بَشِيرٍ، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ سَمُرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ إِذَا بَاعَ الْمُجِيزَانِ فَهُوَ لِلأَوَّلِ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from Samurah that the Messenger of Allah (ﷺ), said:","text":"\"If two (separate) authorized persons make a sale (of the same thing), then the first transaction is the one that is valid. \""}},{"id":56,"idInBook":56,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، قَالَ بَلَغَنِي عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ نَهَى عَنْ بَيْعِ الْعُرْبَانِ ‏.‏","english":{"narrator":"It was narrated from 'Amr bin Shu'aib, from his father, from his grandfather that :","text":"the Prophet (ﷺ) forbade the deal involving earnest money ."}},{"id":57,"idInBook":57,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا الْفَضْلُ بْنُ يَعْقُوبَ الرُّخَامِيُّ، حَدَّثَنَا حَبِيبُ بْنُ أَبِي حَبِيبٍ أَبُو مُحَمَّدٍ، كَاتِبُ مَالِكِ بْنِ أَنَسٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَامِرٍ الأَسْلَمِيُّ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ نَهَى عَنْ بَيْعِ الْعُرْبَانِ ‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ الْعُرْبَانُ أَنْ يَشْتَرِيَ الرَّجُلُ دَابَّةً بِمِائَةِ دِينَارٍ فَيُعْطِيَهُ دِينَارَيْنِ أَرْبُونًا فَيَقُولَ إِنْ لَمْ أَشْتَرِ الدَّابَّةَ فَالدِّينَارَانِ لَكَ ‏.‏","english":{"narrator":"It was narrated from 'Amr bin Shu'aib, from his father, from his grandfather that :","text":"the Prophet (ﷺ) forbade the deal involving earnest money. (Hasan)Abu 'Abdullah said: Earnest money refers to when a man buys an animal for one hundred Dinar, then he gives the seller two Dinar in advance and says: \"If I do not buy the animal, then the two Dinar are yours.\"  And it was said that it refers, and Allah knows best, to when a man buys something, and gives the seller a Dirham or less or more, and says: \"If I take it (all well and good), and if I do not, then the Dirham is yours.\""}},{"id":58,"idInBook":58,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا مُحْرِزُ بْنُ سَلَمَةَ الْعَدَنِيُّ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، عَنْ عُبَيْدِ اللَّهِ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنْ بَيْعِ الْغَرَرِ وَعَنْ بَيْعِ الْحَصَاةِ ‏.‏","english":{"narrator":"It was narrated that Abu Hurairah said:","text":"\"The Messenger of Allah (ﷺ) forbade Gharar transaction sand Hasah transactions. \""}},{"id":59,"idInBook":59,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا أَبُو كُرَيْبٍ، وَالْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ الْعَنْبَرِيُّ، قَالاَ حَدَّثَنَا الأَسْوَدُ بْنُ عَامِرٍ، حَدَّثَنَا أَيُّوبُ بْنُ عُتْبَةَ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنْ بَيْعِ الْغَرَرِ ‏.‏","english":{"narrator":"It was narrated that Ibn 'Abbas said:","text":"\"The Messenger of Allah (ﷺ) forbade Gharar transactions. \""}},{"id":60,"idInBook":60,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا جَهْضَمُ بْنُ عَبْدِ اللَّهِ الْيَمَامِيُّ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ الْبَاهِلِيِّ، عَنْ مُحَمَّدِ بْنِ زَيْدٍ الْعَبْدِيِّ، عَنْ شَهْرِ بْنِ حَوْشَبٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنْ شِرَاءِ مَا فِي بُطُونِ الأَنْعَامِ حَتَّى تَضَعَ وَعَمَّا فِي ضُرُوعِهَا إِلاَّ بِكَيْلٍ وَعَنْ شِرَاءِ الْعَبْدِ وَهُوَ آبِقٌ وَعَنْ شِرَاءِ الْمَغَانِمِ حَتَّى تُقْسَمَ وَعَنْ شِرَاءِ الصَّدَقَاتِ حَتَّى تُقْبَضَ وَعَنْ ضَرْبَةِ الْغَائِصِ ‏.‏","english":{"narrator":"It was narrated that Abu Sa'eed Al-Khudri said:","text":"“The Messenger of Allah (ﷺ) forbade selling what is in the wombs of cattle until they give birth, and selling what is in their udders unless it is measured out, and selling a slave who has fled, and selling spoils of war until it has been distributed, and selling Sadaqah until it has been received, and what a diver is going to bring up.\""}},{"id":61,"idInBook":61,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا سُفْيَانُ، عَنْ أَيُّوبَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ نَهَى عَنْ بَيْعِ حَبَلِ الْحَبَلَةِ ‏.‏","english":{"narrator":"It was narrated from Ibn 'Umar that :","text":"the Prophet (ﷺ) forbade selling Hablul-Habalah."}},{"id":62,"idInBook":62,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ، حَدَّثَنَا الأَخْضَرُ بْنُ عَجْلاَنَ، حَدَّثَنَا أَبُو بَكْرٍ الْحَنَفِيُّ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَجُلاً، مِنَ الأَنْصَارِ جَاءَ إِلَى النَّبِيِّ ـ صلى الله عليه وسلم ـ يَسْأَلُهُ فَقَالَ ‏\"‏ لَكَ فِي بَيْتِكَ شَىْءٌ ‏\"‏ ‏.‏ قَالَ بَلَى حِلْسٌ نَلْبَسُ بَعْضَهُ وَنَبْسُطُ بَعْضَهُ وَقَدَحٌ نَشْرَبُ فِيهِ الْمَاءَ ‏.‏ قَالَ ‏\"‏ ائْتِنِي بِهِمَا ‏\"‏ ‏.‏ قَالَ فَأَتَاهُ بِهِمَا فَأَخَذَهُمَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ بِيَدِهِ ثُمَّ قَالَ ‏\"‏ مَنْ يَشْتَرِي هَذَيْنِ ‏\"‏ ‏.‏ فَقَالَ رَجُلٌ أَنَا آخُذُهُمَا بِدِرْهَمٍ ‏.‏ قَالَ ‏\"‏ مَنْ يَزِيدُ عَلَى دِرْهَمٍ ‏\"‏ ‏.‏ مَرَّتَيْنِ أَوْ ثَلاَثًا قَالَ رَجُلٌ أَنَا آخُذُهُمَا بِدِرْهَمَيْنِ ‏.‏ فَأَعْطَاهُمَا إِيَّاهُ وَأَخَذَ الدِّرْهَمَيْنِ فَأَعْطَاهُمَا الأَنْصَارِيَّ وَقَالَ ‏\"‏ اشْتَرِ بِأَحَدِهِمَا طَعَامًا فَانْبِذْهُ إِلَى أَهْلِكَ وَاشْتَرِ بِالآخَرِ قَدُومًا فَأْتِنِي بِهِ ‏\"‏ ‏.‏ فَفَعَلَ فَأَخَذَهُ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ فَشَدَّ فِيهِ عُودًا بِيَدِهِ وَقَالَ ‏\"‏ اذْهَبْ فَاحْتَطِبْ وَلاَ أَرَاكَ خَمْسَةَ عَشَرَ يَوْمًا ‏\"‏ ‏.‏ فَجَعَلَ يَحْتَطِبُ وَيَبِيعُ فَجَاءَ وَقَدْ أَصَابَ عَشْرَةَ دَرَاهِمَ فَقَالَ ‏\"‏ اشْتَرِ بِبَعْضِهَا طَعَامًا وَبِبَعْضِهَا ثَوْبًا ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ هَذَا خَيْرٌ لَكَ مِنْ أَنْ تَجِيءَ وَالْمَسْأَلَةُ نُكْتَةٌ فِي وَجْهِكَ يَوْمَ الْقِيَامَةِ إِنَّ الْمَسْأَلَةَ لاَ تَصْلُحُ إِلاَّ لِذِي فَقْرٍ مُدْقِعٍ أَوْ لِذِي غُرْمٍ مُفْظِعٍ أَوْ دَمٍ مُوجِعٍ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from Anas bin Malik that :","text":"a man from among the Ansar came to the Prophet (ﷺ) and begged from him. He said, \"Do you have anything in your house?\" He said: \"Yes, a blanket, part of which we cover ourselves with and part we spread beneath us, and a bowl from which we drink water.\" He said: \"Givethem to me.\" So he brought them to him, and the Messenger of Allah (ﷺ) took them in his hand and said, \"Who will by these two things?\" A man said: \"I will by them for one Dirham.\" He said: \"Who will offer more than a Dirham?\" two or three times. A man said: \"I will buy them for two Dirham.\" So he gave them to him and took the two Dirham, which he gave to the Ansari and said: \"Buy food with one of them and give it to your family, and buy an axe with the other and bring it to me.\" So he did that, and the Messenger of Allah (ﷺ) took it and fixed a handle to it, and said: \"Go and gather firewood, and I do not want to see you for fifteen days.\" So he went and gathered firewood and sold it, then he came back, and he had earned ten Dirham. (The Prophet (ﷺ)) said: \"Buy food with some of it and clothes with some.\" Then he said: \"This is better for you than coming with begging (appearing)  as a spot on your face on the Day of Resurrection. Begging is only appropriate for one who is extremely poor or who is in severe debt, or one who must pay painful blood money.”"}},{"id":63,"idInBook":63,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا زِيَادُ بْنُ يَحْيَى أَبُو الْخَطَّابِ، حَدَّثَنَا مَالِكُ بْنُ سُعَيْرٍ، حَدَّثَنَا الأَعْمَشُ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ مَنْ أَقَالَ مُسْلِمًا أَقَالَهُ اللَّهُ عَثْرَتَهُ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:","text":"Whoever agrees with a Muslim to cancel a transaction Allah will forgive his sins on the Day of Resurrection. \""}},{"id":64,"idInBook":64,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا حَجَّاجٌ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ قَتَادَةَ، وَحُمَيْدٍ، وَثَابِتٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ غَلاَ السِّعْرُ عَلَى عَهْدِ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ فَقَالُوا يَا رَسُولَ اللَّهِ قَدْ غَلاَ السِّعْرُ فَسَعِّرْ لَنَا ‏.‏ فَقَالَ ‏\n\"‏ إِنَّ اللَّهَ هُوَ الْمُسَعِّرُ الْقَابِضُ الْبَاسِطُ الرَّازِقُ إِنِّي لأَرْجُو أَنْ أَلْقَى رَبِّي وَلَيْسَ أَحَدٌ يَطْلُبُنِي بِمَظْلَمَةٍ فِي دَمٍ وَلاَ مَالٍ ‏\"‏ ‏.‏","english":{"narrator":"It was nanated that Anas bin Malik said:","text":"\"Prices rose during the time of the Messenger of Allah (ﷺ), and they said: 'O Messenger of Allah, prices have risen, so fix the prices for us.' He said: 'Indeed Allah is the Musa'ir,  the Razzaq (Provider). And I am hopeful that I meet my Lord and none of you are seeking (recompense from) me for an injustice involving blood or wealth.\""}},{"id":65,"idInBook":65,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ زِيَادٍ، حَدَّثَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ، قَالَ غَلاَ السِّعْرُ عَلَى عَهْدِ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ فَقَالُوا لَوْ قَوَّمْتَ يَا رَسُولَ اللَّهِ قَالَ ‏\n\"‏ إِنِّي لأَرْجُو أَنْ أُفَارِقَكُمْ وَلاَ يَطْلُبَنِي أَحَدٌ مِنْكُمْ بِمَظْلَمَةٍ ظَلَمْتُهُ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated that Abu Sa'eed said:","text":"\"Prices rose at the time of the Messenger of Allah (ﷺ), and they said: 'Why do you not fix the food prices, O Messenger of Allah?' He said: 'I hope that when I leave you, no one among you will be demanding restitution for a wrong that I have done to him.\"'"}},{"id":66,"idInBook":66,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ أَبَانَ الْبَلْخِيُّ أَبُو بَكْرٍ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، عَنْ يُونُسَ بْنِ عُبَيْدٍ، عَنْ عَطَاءِ بْنِ فَرُّوخَ، قَالَ قَالَ عُثْمَانُ بْنُ عَفَّانَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ أَدْخَلَ اللَّهُ رَجُلاً الْجَنَّةَ كَانَ سَهْلاً بَائِعًا وَمُشْتَرِيًا ‏\"‏ ‏.‏","english":{"narrator":"'Uthman bin 'Affan narrated that the Messenger of Allah (ﷺ) said:","text":"“Allah will admit to Paradise a man who was lenient when he sold and when he bought. \""}},{"id":67,"idInBook":67,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ بْنِ سَعِيدِ بْنِ كَثِيرِ بْنِ دِينَارٍ الْحِمْصِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا أَبُو غَسَّانَ، مُحَمَّدُ بْنُ مُطَرِّفٍ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ رَحِمَ اللَّهُ عَبْدًا سَمْحًا إِذَا بَاعَ سَمْحًا إِذَا اشْتَرَى سَمْحًا إِذَا اقْتَضَى ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from Jabir bin 'Abdullah that the Messenger of Allah (ﷺ) said:","text":"\"May Allah have mercy on a person who is lenient when he sells, lenient when he buys, and lenient when he asks for payment. \""}},{"id":68,"idInBook":68,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ، حَدَّثَنَا يَعْلَى بْنُ شَبِيبٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُثْمَانَ بْنِ خُثَيْمٍ، عَنْ قَيْلَةَ أُمِّ بَنِي أَنْمَارٍ، قَالَتْ أَتَيْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ فِي بَعْضِ عُمَرِهِ عِنْدَ الْمَرْوَةِ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي امْرَأَةٌ أَبِيعُ وَأَشْتَرِي فَإِذَا أَرَدْتُ أَنْ أَبْتَاعَ الشَّىْءَ سُمْتُ بِهِ أَقَلَّ مِمَّا أُرِيدُ ثُمَّ زِدْتُ ثُمَّ زِدْتُ حَتَّى أَبْلُغَ الَّذِي أُرِيدُ وَإِذَا أَرَدْتُ أَنْ أَبِيعَ الشَّىْءَ سُمْتُ بِهِ أَكْثَرَ مِنَ الَّذِي أُرِيدُ ثُمَّ وَضَعْتُ حَتَّى أَبْلُغَ الَّذِي أُرِيدُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ لاَ تَفْعَلِي يَا قَيْلَةُ إِذَا أَرَدْتِ أَنْ تَبْتَاعِي شَيْئًا فَاسْتَامِي بِهِ الَّذِي تُرِيدِينَ أُعْطِيتِ أَوْ مُنِعْتِ ‏\"‏ ‏.‏ وَقَالَ ‏\"‏ إِذَا أَرَدْتِ أَنْ تَبِيعِي شَيْئًا فَاسْتَامِي بِهِ الَّذِي تُرِيدِينَ أَعْطَيْتِ أَوْ مَنَعْتِ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated that Qailah Umm Bani Anmar said:","text":"\"I came to the Messenger of Allah (ﷺ), during one of his 'Umrah at Marwah and said: 'O Messenger of Allah, I am a woman who buys and sells. When I want to buy something, I state a price less than I want to pay, then I raise it gradually until it reaches the price I want to pay. And when I want to sell something, I state a price more than I want, then I lower it until it reaches the price I want.' The Messenger of Allah (ﷺ) said: 'Do not do that, O Qailah. When you want to buy something, state the price you want, whether it is given or not. And when you want to sell something, state the price you want, whether it is given or not.'\""}},{"id":69,"idInBook":69,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، عَنِ الْجُرَيْرِيِّ، عَنْ أَبِي نَضْرَةَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ كُنْتُ مَعَ النَّبِيِّ ـ صلى الله عليه وسلم ـ فِي غَزْوَةٍ فَقَالَ لِي ‏\"‏ أَتَبِيعُ نَاضِحَكَ هَذَا بِدِينَارٍ وَاللَّهُ يَغْفِرُ لَكَ ‏\"‏ ‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ هُوَ نَاضِحُكُمْ إِذَا أَتَيْتُ الْمَدِينَةَ ‏.‏ قَالَ ‏\"‏ فَتَبِيعُهُ بِدِينَارَيْنِ وَاللَّهُ يَغْفِرُ لَكَ ‏\"‏ ‏.‏ قَالَ فَمَا زَالَ يَزِيدُنِي دِينَارًا دِينَارًا وَيَقُولُ مَكَانَ كُلِّ دِينَارٍ ‏\"‏ وَاللَّهُ يَغْفِرُ لَكَ ‏\"‏ ‏.‏ حَتَّى بَلَغَ عِشْرِينَ دِينَارًا فَلَمَّا أَتَيْتُ الْمَدِينَةَ أَخَذْتُ بِرَأْسِ النَّاضِحِ فَأَتَيْتُ بِهِ النَّبِيَّ ـ صلى الله عليه وسلم ـ فَقَالَ ‏\"‏ يَا بِلاَلُ أَعْطِهِ مِنَ الْعَيْبَةِ عِشْرِينَ دِينَارًا ‏\"‏ ‏.‏ وَقَالَ ‏\"‏ انْطَلِقْ بِنَاضِحِكَ وَاذْهَبْ بِهِ إِلَى أَهْلِكَ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated that Jabir bin 'Abdullah said:","text":"\"I was with the Prophet (ﷺ) on a military campaign, and he said to me: 'Will you sell this camel of yours for a Dinar?' I said: 'O Messenger of Allah, it is yours when I get to Al-Madinah.' He said: 'Then sell it for two Dinar, may Allah forgive you.' And he kept increasing the price for me, saying: 'May Allah forgive you,' each time, until the amount reached twenty Dinar. When I came to Al-Madinah, I took hold of the camel's head and brought it to the Prophet (ﷺ) and he said: 'O Bilal, give him twenty Dinar from the spoils of war.' And he said: 'Take your camel away and go to your people with it.'\""}},{"id":70,"idInBook":70,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، وَسَهْلُ بْنُ أَبِي سَهْلٍ، قَالاَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، أَنْبَأَنَا الرَّبِيعُ بْنُ حَبِيبٍ، عَنْ نَوْفَلِ بْنِ عَبْدِ الْمَلِكِ، عَنْ أَبِيهِ، عَنْ عَلِيٍّ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنِ السَّوْمِ قَبْلَ طُلُوعِ الشَّمْسِ وَعَنْ ذَبْحِ ذَوَاتِ الدَّرِّ ‏.‏","english":{"narrator":"It was narrated that 'Ali said:","text":"\"The Messenger of Allah (ﷺ) forbade haggling before sunrise, and (he forbade) slaughtering animals that yield milk.\""}},{"id":71,"idInBook":71,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، وَأَحْمَدُ بْنُ سِنَانٍ، قَالُوا حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ ثَلاَثَةٌ لاَ يُكَلِّمُهُمُ اللَّهُ عَزَّ وَجَلَّ يَوْمَ الْقِيَامَةِ وَلاَ يَنْظُرُ إِلَيْهِمْ وَلاَ يُزَكِّيهِمْ وَلَهُمْ عَذَابٌ أَلِيمٌ رَجُلٌ عَلَى فَضْلِ مَاءٍ بِالْفَلاَةِ يَمْنَعُهُ ابْنَ السَّبِيلِ وَرَجُلٌ بَايَعَ رَجُلاً سِلْعَةً بَعْدَ الْعَصْرِ فَحَلَفَ بِاللَّهِ لأَخَذَهَا بِكَذَا وَكَذَا فَصَدَّقَهُ وَهُوَ عَلَى غَيْرِ ذَلِكَ وَرَجُلٌ بَايَعَ إِمَامًا لاَ يُبَايِعُهُ إِلاَّ لِدُنْيَا فَإِنْ أَعْطَاهُ مِنْهَا وَفَى لَهُ وَإِنْ لَمْ يُعْطِهِ مِنْهَا لَمْ يَفِ لَهُ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:","text":"\"There are three to whom Allah will not speak on the Day of Resurrection, nor will He look at them or purify them, and theirs will be a painful torment: A man who has surplus water in the desert but refuses to give any to a wayfarer; a man who sells a product to a man after 'Asr and swears by Allah that he bought it for such and such amount, and he believes him, when that is not the case; and a man who swears allegiance to a ruler, and only does so for worldly gains, so if he gives him some of (these worldly benefits) he fulfills his oath of allegiance, and if he is not given anything he does not uphold his oath of allegiance. \""}},{"id":72,"idInBook":72,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، وَمُحَمَّدُ بْنُ إِسْمَاعِيلَ، قَالاَ حَدَّثَنَا وَكِيعٌ، عَنِ الْمَسْعُودِيِّ، عَنْ عَلِيِّ بْنِ مُدْرِكٍ، عَنْ خَرَشَةَ بْنِ الْحُرِّ، عَنْ أَبِي ذَرٍّ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ ح وَحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَلِيِّ بْنِ مُدْرِكٍ، عَنْ أَبِي زُرْعَةَ بْنِ عَمْرِو بْنِ جَرِيرٍ، عَنْ خَرَشَةَ بْنِ الْحُرِّ، عَنْ أَبِي ذَرٍّ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ ثَلاَثَةٌ لاَ يُكَلِّمُهُمُ اللَّهُ يَوْمَ الْقِيَامَةِ وَلاَ يَنْظُرُ إِلَيْهِمْ وَلاَ يُزَكِّيهِمْ وَلَهُمْ عَذَابٌ أَلِيمٌ ‏\"‏ ‏.‏ فَقُلْتُ مَنْ هُمْ يَا رَسُولَ اللَّهِ فَقَدْ خَابُوا وَخَسِرُوا ‏.‏ قَالَ ‏\"‏ الْمُسْبِلُ إِزَارَهُ وَالْمَنَّانُ عَطَاءَهُ وَالْمُنَفِّقُ سِلْعَتَهُ بِالْحَلِفِ الْكَاذِبِ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from Abu Dharr that the Prophet (ﷺ) said:","text":"\"There are three to whom Allah will not speak on the Day of Resurrection nor will He look at them or purify them, and theirs will be a painful torment.\" I said: \"Who are they, O Messenger of Allah? For they are indeed losers.\" He said: \"The one who lets his garment hang beneath his ankles, the one who reminds another of what he has given him, and the one who sells his product by means of false oaths.\""}},{"id":73,"idInBook":73,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا يَحْيَى بْنُ خَلَفٍ، حَدَّثَنَا عَبْدُ الأَعْلَى، ح وَحَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ، قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاقَ، عَنْ مَعْبَدِ بْنِ كَعْبِ بْنِ مَالِكٍ، عَنْ أَبِي قَتَادَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ إِيَّاكُمْ وَالْحَلِفَ فِي الْبَيْعِ فَإِنَّهُ يُنَفِّقُ ثُمَّ يَمْحَقُ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from Abu Qatadah that the Messenger of Allah (ﷺ), said:","text":"\"Beware of swearing oaths when selling, for it may help you to make a sale but it destroys the blessing.\"'"}},{"id":74,"idInBook":74,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، قَالَ حَدَّثَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ مَنِ اشْتَرَى نَخْلاً قَدْ أُبِّرَتْ فَثَمَرَتُهَا لِلْبَائِعِ إِلاَّ أَنْ يَشْتَرِطَ الْمُبْتَاعُ ‏\"‏ ‏.‏ \n حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ بِنَحْوِهِ ‏.‏","english":{"narrator":"It was narrated from Ibn 'Umar that the Messenger of Allah (ﷺ) said:","text":"\"Whoever buys a palm tree that has been pollinated, its fruits belong to the seller, unless the purchaser stipulated a condition.\" (Sahih)\n\nAnother chain from Ibn 'Umar, from the Prophet (ﷺ), with similar wording."}},{"id":75,"idInBook":75,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، ح وَحَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، جَمِيعًا عَنِ ابْنِ شِهَابٍ الزُّهْرِيِّ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ مَنْ بَاعَ نَخْلاً قَدْ أُبِّرَتْ فَثَمَرَتُهَا لِلَّذِي بَاعَهَا إِلاَّ أَنْ يَشْتَرِطَ الْمُبْتَاعُ وَمَنِ ابْتَاعَ عَبْدًا وَلَهُ مَالٌ فَمَالُهُ لِلَّذِي بَاعَهُ إِلاَّ أَنْ يَشْتَرِطَ الْمُبْتَاعُ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from Salim bin 'Abdullah, bin 'Umar, from Ibn 'Umar, that :","text":"the Messenger of Allah (ﷺ) said: \"Whoever sells a palm tree that has been pollinated, its fruits belong to the seller, unless the purchaser stipulated a condition. And whoever buys a slave who has wealth, his wealth belongs to the seller, unless the purchaser stipulated a condition.\""}},{"id":76,"idInBook":76,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْوَلِيدِ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ رَبِّهِ بْنِ سَعِيدٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ أَنَّهُ قَالَ ‏\n\"‏ مَنْ بَاعَ نَخْلاً وَبَاعَ عَبْدًا جَمَعَهُمَا جَمِيعًا ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from Nafi' from Ibn 'Umar that the Prophet (ﷺ) said:","text":"\"Whoever sells a palm tree and sells a slave.\" Mentioning both of them together."}},{"id":77,"idInBook":77,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا عَبْدُ رَبِّهِ بْنُ خَالِدٍ النُّمَيْرِيُّ أَبُو الْمُغَلِّسِ، حَدَّثَنَا الْفُضَيْلُ بْنُ سُلَيْمَانَ، عَنْ مُوسَى بْنِ عُقْبَةَ، حَدَّثَنِي إِسْحَاقُ بْنُ يَحْيَى بْنِ الْوَلِيدِ بْنِ عُبَادَةَ بْنِ الصَّامِتِ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، قَالَ قَضَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ أَنَّ ثَمَرَ النَّخْلِ لِمَنْ أَبَّرَهَا إِلاَّ أَنْ يَشْتَرِطَ الْمُبْتَاعُ وَأَنَّ مَالَ الْمَمْلُوكِ لِمَنْ بَاعَهُ إِلاَّ أَنْ يَشْتَرِطَ الْمُبْتَاعُ ‏.‏","english":{"narrator":"It was narrated that 'Ubadah bin Samit said:","text":"\"The Messenger of Allah (ﷺ) ruled that the fruit of a palm tree belongs to the one who pollinated it, and that the wealth of a slave belongs to the one who sold him, unless the purchaser stipulated a condition.\""}},{"id":78,"idInBook":78,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنْ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ لاَ تَبِيعُوا الثَّمَرَةَ حَتَّى يَبْدُوَ صَلاَحُهَا ‏\"‏ ‏.‏ نَهَى الْبَائِعَ وَالْمُشْتَرِيَ ‏.‏","english":{"narrator":"It was narrated from Ibn 'Umar that the Messenger of Allah (ﷺ) said:","text":"\"Do not sell fruits until they have ripened.\" And he forbade (both) the seller and the purchaser (to engage in such a transaction)."}},{"id":79,"idInBook":79,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ عِيسَى الْمِصْرِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، عَنْ يُونُسَ بْنِ يَزِيدَ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، وَأَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ لاَ تَبِيعُوا الثَّمَرَ حَتَّى يَبْدُوَ صَلاَحُهُ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:","text":"\"Do not sell fruits until they have ripened.\"'"}},{"id":80,"idInBook":80,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ جُرَيْجٍ، عَنْ عَطَاءٍ، عَنْ جَابِرٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ نَهَى عَنْ بَيْعِ الثَّمَرِ حَتَّى يَبْدُوَ صَلاَحُهُ ‏.‏","english":{"narrator":"It was narrated from Jabir that :","text":"the Prophet (ﷺ) forbade selling fruits until they have ripened."}},{"id":81,"idInBook":81,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا حَجَّاجٌ، حَدَّثَنَا حَمَّادٌ، عَنْ حُمَيْدٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ نَهَى عَنْ بَيْعِ الثَّمَرَةِ حَتَّى تَزْهُوَ وَعَنْ بَيْعِ الْعِنَبِ حَتَّى يَسْوَدَّ وَعَنْ بَيْعِ الْحَبِّ حَتَّى يَشْتَدَّ ‏.‏","english":{"narrator":"It was narrated from Anas bin Malik that :","text":"the Messenger of Allah (ﷺ) forbade selling fruits until they have changed the color, and selling grapes until they have turned black, and selling grains until they have hardened."}},{"id":82,"idInBook":82,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، وَمُحَمَّدُ بْنُ الصَّبَّاحِ، قَالاَ حَدَّثَنَا سُفْيَانُ، عَنْ حُمَيْدٍ الأَعْرَجِ، عَنْ سُلَيْمَانَ بْنِ عَتِيقٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ نَهَى عَنْ بَيْعِ السِّنِينَ ‏.‏","english":{"narrator":"It was narrated from Jabir bin 'Abdullah that :","text":"the Messenger of Allah (ﷺ) forbade selling for many years ahead."}},{"id":83,"idInBook":83,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ، حَدَّثَنَا ثَوْرُ بْنُ يَزِيدَ، عَنِ ابْنِ جُرَيْجٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ مَنْ بَاعَ ثَمَرًا فَأَصَابَتْهُ جَائِحَةٌ فَلاَ يَأْخُذْ مِنْ مَالِ أَخِيهِ شَيْئًا عَلاَمَ يَأْخُذُ أَحَدُكُمْ مَالَ أَخِيهِ الْمُسْلِمِ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from Jabir bin 'Abdullah that the Messenger of Allah (ﷺ) said:","text":"\"Whoever sells fruits then the crop fails, should not take any of his brother's money. Why would any of you take the money of his Muslim brother?\""}},{"id":84,"idInBook":84,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، وَمُحَمَّدُ بْنُ إِسْمَاعِيلَ، قَالُوا حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا سُفْيَانُ، عَنْ سِمَاكِ بْنِ حَرْبٍ، عَنْ سُوَيْدِ بْنِ قَيْسٍ، قَالَ جَلَبْتُ أَنَا وَمَخْرَفَةُ الْعَبْدِيُّ، بَزًّا مِنْ هَجَرَ فَجَاءَنَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ فَسَاوَمَنَا سَرَاوِيلَ وَعِنْدَنَا وَزَّانٌ يَزِنُ بِالأَجْرِ فَقَالَ لَهُ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏\n\"‏ يَا وَزَّانُ زِنْ وَأَرْجِحْ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated that Suwaid bin Qais said:","text":"\"Makhrafah Al' Abdi and I brought linens from Hajar The Messenger of Allah (ﷺ) came to us to bargain with us with some trousers. There was someone with me who weighed (the goods) in exchange for a wage. So the Prophet (ﷺ) said to the one weighing: 'Weigh and add more.'\""}},{"id":85,"idInBook":85,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، وَمُحَمَّدُ بْنُ الْوَلِيدِ، قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ سِمَاكِ بْنِ حَرْبٍ، قَالَ سَمِعْتُ مَالِكًا أَبَا صَفْوَانَ بْنَ عُمَيْرَةَ، قَالَ بِعْتُ مِنْ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ رِجْلَ سَرَاوِيلَ قَبْلَ الْهِجْرَةِ فَوَزَنَ لِي فَأَرْجَحَ لِي ‏.‏","english":{"narrator":"It was narrated that Simak bin Harb said:","text":"\"I heard Malik Abu Safwan bin 'Umairah, say: 'I bought a pair of trousers from the Messenger of Allah (ﷺ) before the Hijrah, and he weighed it for me and allowed more.\"'"}},{"id":86,"idInBook":86,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا عَبْدُ الصَّمَدِ، حَدَّثَنَا شُعْبَةُ، عَنْ مُحَارِبِ بْنِ دِثَارٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ إِذَا وَزَنْتُمْ فَأَرْجِحُوا ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from Jabir bin 'Abdullah that the Messenger of Allah (ﷺ) said:","text":"\"When you weigh, allow more. \""}},{"id":87,"idInBook":87,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ بِشْرِ بْنِ الْحَكَمِ، وَمُحَمَّدُ بْنُ عَقِيلِ بْنِ خُوَيْلِدٍ، قَالاَ حَدَّثَنَا عَلِيُّ بْنُ الْحُسَيْنِ بْنِ وَاقِدٍ، حَدَّثَنِي أَبِي، حَدَّثَنِي يَزِيدُ النَّحْوِيُّ، أَنَّ عِكْرِمَةَ، حَدَّثَهُ عَنِ ابْنِ عَبَّاسٍ، قَالَ لَمَّا قَدِمَ النَّبِيُّ ـ صلى الله عليه وسلم ـ الْمَدِينَةَ كَانُوا مِنْ أَخْبَثِ النَّاسِ كَيْلاً فَأَنْزَلَ اللَّهُ سُبْحَانَهُ ‏{وَيْلٌ لِلْمُطَفِّفِينَ}‏ فَأَحْسَنُوا الْكَيْلَ بَعْدَ ذَلِكَ ‏.‏","english":{"narrator":"It was narrated that Ibn 'Abbas said:","text":"\"When the Prophet (ﷺ) came to Al-Madinah, they were the worst people in weights and measures. Then Allah, Glorious is He revealed: \"Woe to the Mutaffifun (those who give less in measure and weight)\", and they were fair in weights and measures after that."}},{"id":88,"idInBook":88,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا سُفْيَانُ، عَنِ الْعَلاَءِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ مَرَّ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ بِرَجُلٍ يَبِيِعُ طَعَامًا فَأَدْخَلَ يَدَهُ فِيهِ فَإِذَا هُوَ مَغْشُوشٌ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ لَيْسَ مِنَّا مَنْ غَشَّ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated that Abu Hurairah said:","text":"\"The Messenger of Allah (ﷺ) passed by a man who was selling food. He put his hand in it and saw that there was something wrong with it. The Messenger of Allah (ﷺ) said, 'He is not one of us who cheats.\"'"}},{"id":89,"idInBook":89,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا يُونُسُ بْنُ أَبِي إِسْحَاقَ، عَنْ أَبِي دَاوُدَ، عَنْ أَبِي الْحَمْرَاءِ، قَالَ رَأَيْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ مَرَّ بِجَنَبَاتِ رَجُلٍ عِنْدَهُ طَعَامٌ فِي وِعَاءٍ فَأَدْخَلَ يَدَهُ فِيهِ فَقَالَ ‏\n\"‏ لَعَلَّكَ غَشَشْتَهُ مَنْ غَشَّنَا فَلَيْسَ مِنَّا ‏\"‏ ‏.‏","english":{"narrator":"It was narrated that Abu Hamra' said:","text":"\"I saw the Messenger of Allah (ﷺ) pass by a man having food in a vessel. He put his hand in it and said: 'Perhaps you are cheating. Whoever cheats us is not one of us.\"'"}},{"id":90,"idInBook":90,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ مَنِ ابْتَاعَ طَعَامًا فَلاَ يَبِعْهُ حَتَّى يَسْتَوْفِيَهُ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from Ibn 'Umar that the Prophet (ﷺ) said:","text":"\"Whoever buys food, let him not sell it until he has taken full possession of it.\""}},{"id":91,"idInBook":91,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا عِمْرَانُ بْنُ مُوسَى اللَّيْثِيُّ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، ح وَحَدَّثَنَا بِشْرُ بْنُ مُعَاذٍ الضَّرِيرُ، حَدَّثَنَا أَبُو عَوَانَةَ، وَحَمَّادُ بْنُ زَيْدٍ، قَالاَ حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ مَنِ ابْتَاعَ طَعَامًا فَلاَ يَبِعْهُ حَتَّى يَسْتَوْفِيَهُ ‏\"‏ ‏.‏ قَالَ أَبُو عَوَانَةَ فِي حَدِيثِهِ قَالَ ابْنُ عَبَّاسٍ وَأَحْسِبُ كُلَّ شَىْءٍ مِثْلَ الطَّعَامِ ‏.‏","english":{"narrator":"It was narrated that Ibn 'Abbas said:","text":"\"The Messenger of Allah (ﷺ) said: 'Whoever buys food, let him not sell it until he has taken full possession of it.'\" (Sahih)  In his narration, (one of the narrators) Abu 'Awanah said: \"Ibn 'Abbas said: 'I think everything is like food.\"'"}},{"id":92,"idInBook":92,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنِ ابْنِ أَبِي لَيْلَى، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنْ بَيْعِ الطَّعَامِ حَتَّى يَجْرِيَ فِيهِ الصَّاعَانِ صَاعُ الْبَائِعِ وَصَاعُ الْمُشْتَرِي ‏.‏","english":{"narrator":"It was narrated that Jabir said:","text":"'The Messenger of Allah (ﷺ) forbade selling food bought by measure until two Sa' have been measured - the Sa' of the seller and the Sa' of the buyer.\""}},{"id":93,"idInBook":93,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا سَهْلُ بْنُ أَبِي سَهْلٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ كُنَّا نَشْتَرِي الطَّعَامَ مِنَ الرُّكْبَانِ جِزَافًا فَنَهَانَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ أَنْ نَبِيعَهُ حَتَّى نَنْقُلَهُ مِنْ مَكَانِهِ ‏.‏","english":{"narrator":"It was narrated that Ibn 'Umar said:","text":"\"We used to buy food from troops of riders (i.e., the caravans) without knowing the amount, but the Messenger of Allah (ﷺ) forbade us to sell it until it had been delivered to us.\""}},{"id":94,"idInBook":94,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مَيْمُونٍ الرَّقِّيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ، عَنِ ابْنِ لَهِيعَةَ، عَنْ مُوسَى بْنِ وَرْدَانَ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ عُثْمَانَ بْنِ عَفَّانَ، قَالَ كُنْتُ أَبِيعُ التَّمْرَ فِي السُّوقِ فَأَقُولُ كِلْتُ فِي وَسْقِي هَذَا كَذَا ‏.‏ فَأَدْفَعُ أَوْسَاقَ التَّمْرِ بِكَيْلِهِ وَآخُذُ شِفِّي فَدَخَلَنِي مِنْ ذَلِكَ شَىْءٌ فَسَأَلْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ فَقَالَ ‏\n\"‏ إِذَا سَمَّيْتَ الْكَيْلَ فَكِلْهُ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated that 'Uthman bin 'Affan said:","text":"\"I used to sell dates in the marketplace, and I would say: 'This was such and such an amount (when I bought it).' I Would give the purchaser a specific amount of dates according to the way it had been measured for me, and take my profit. Then I began to have some doubts about that, so I asked the Messenger of Allah (ﷺ), and he said: ‘When you name the amount, measure it in front of the purchaser.\"'"}},{"id":95,"idInBook":95,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ الْيَحْصُبِيُّ، عَنْ عَبْدِ اللَّهِ بْنِ بُسْرٍ الْمَازِنِيِّ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\n\"‏ كِيلُوا طَعَامَكُمْ يُبَارَكْ لَكُمْ فِيهِ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated that Abdullah bin Busr Al-Mazini said:","text":"\"I heard the Messenger of Allah (ﷺ) say: 'Measure your food, may you be blessed therein.\"'"}},{"id":96,"idInBook":96,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ بْنِ سَعِيدِ بْنِ كَثِيرِ بْنِ دِينَارٍ الْحِمْصِيُّ، حَدَّثَنَا بَقِيَّةُ بْنُ الْوَلِيدِ، عَنْ بَحِيرِ بْنِ سَعْدٍ، عَنْ خَالِدِ بْنِ مَعْدَانَ، عَنِ الْمِقْدَامِ بْنِ مَعْدِيكَرِبَ، عَنْ أَبِي أَيُّوبَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ كِيلُوا طَعَامَكُمْ يُبَارَكْ لَكُمْ فِيهِ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from Abu Ayyub that the Prophet (ﷺ) said:","text":"\"Measure your food, may you be blessed therein.\""}},{"id":97,"idInBook":97,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ الْحِزَامِيُّ، حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ بْنِ سَعِيدٍ، حَدَّثَنِي صَفْوَانُ بْنُ سُلَيْمٍ، حَدَّثَنِي مُحَمَّدٌ، وَعَلِيٌّ، ابْنَا الْحَسَنِ بْنِ أَبِي الْحَسَنِ الْبَرَّادِ أَنَّ الزُّبَيْرَ بْنَ الْمُنْذِرِ بْنِ أَبِي أُسَيْدٍ السَّاعِدِيِّ، حَدَّثَهُمَا أَنَّ أَبَاهُ الْمُنْذِرَ حَدَّثَهُ عَنْ أَبِي أُسَيْدٍ، أَنَّ أَبَا أُسَيْدٍ، حَدَّثَهُ أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ ذَهَبَ إِلَى سُوقِ النَّبِيطِ فَنَظَرَ إِلَيْهِ فَقَالَ ‏\"‏ لَيْسَ هَذَا لَكُمْ بِسُوقٍ ‏\"‏ ‏.‏ ثُمَّ ذَهَبَ إِلَى سُوقٍ فَنَظَرَ إِلَيْهِ فَقَالَ ‏\"‏ لَيْسَ هَذَا لَكُمْ بِسُوقٍ ‏\"‏ ‏.‏ ثُمَّ رَجَعَ إِلَى هَذَا السُّوقِ فَطَافَ فِيهِ ثُمَّ قَالَ ‏\"‏ هَذَا سُوقُكُمْ فَلاَ يُنْتَقَصَنَّ وَلاَ يُضْرَبَنَّ عَلَيْهِ خَرَاجٌ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated that Abu Usaid said that :","text":"the Messenger of Allah (ﷺ) went to the market of Nabit, and looked at it, and said: \"This is not a market for you.\" Then we went to another market and looked at it, and said: \"This is not a market for you.\" Then he came back to this market and walked around in it then he said: \"This is your market. It will always be your market and no duty will be levied on it.\" (Do,if)"}},{"id":98,"idInBook":98,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُسْتَمِرِّ الْعُرُوقِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا عُبَيْسُ بْنُ مَيْمُونٍ، حَدَّثَنَا عَوْنٌ الْعُقَيْلِيُّ، عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ، عَنْ سَلْمَانَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\n\"‏ مَنْ غَدَا إِلَى صَلاَةِ الصُّبْحِ غَدَا بِرَايَةِ الإِيمَانِ وَمَنْ غَدَا إِلَى السُّوقِ غَدَا بِرَايَةِ إِبْلِيسَ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated that Salman said :","text":"\"I heard the Messenger of Allah (ﷺ) saying: 'Whoever goes to the Morning prayer first thing in the morning, he goes out with the banner of faith but whoever goes out to the marketplace first thing in the morning, he goes out under the banner of Iblis (Satan).' \""}},{"id":99,"idInBook":99,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا بِشْرُ بْنُ مُعَاذٍ الضَّرِيرُ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَمْرِو بْنِ دِينَارٍ، مَوْلَى آلِ الزُّبَيْرِ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ مَنْ قَالَ حِينَ يَدْخُلُ السُّوقَ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِي وَيُمِيتُ وَهُوَ حَىٌّ لاَ يَمُوتُ بِيَدِهِ الْخَيْرُ كُلُّهُ وَهُوَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ - كَتَبَ اللَّهُ لَهُ أَلْفَ أَلْفِ حَسَنَةٍ وَمَحَا عَنْهُ أَلْفَ أَلْفِ سَيِّئَةٍ وَبَنَى لَهُ بَيْتًا فِي الْجَنَّةِ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from Salim bin 'Abdullah bin 'Umar, from his father, that his grandfather told that the Messenger of Allah (ﷺ) said:","text":"\"Whoever says, when he enters the marketplace: 'La ilaha illallah wahdahu la sharika lahu, lahul-mulk wa lahul-hamdu, yuhyi wa yumitu, wa Huwa hayyun la yamutu, bi yadihil-khairu kulluhu, wa Huwa ala kulli shay’in Qadir (None has the right to be worshiped but Allah alone, with no partner, to Him belongs all sovereignty and to Him is the praise, He gives life and gives death, and He is Ever-Living and does not die; in His Hand is all goodness and He is Able to do all things),' Allah will record for him one million good deeds, and will erase from him one million bad deeds, and will build for him a house in Paradise. \""}},{"id":100,"idInBook":100,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا هُشَيْمٌ، عَنْ يَعْلَى بْنِ عَطَاءٍ، عَنْ عُمَارَةَ بْنِ حَدِيدٍ، عَنْ صَخْرٍ الْغَامِدِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ اللَّهُمَّ بَارِكْ لأُمَّتِي فِي بُكُورِهَا ‏\"‏ ‏.‏ قَالَ وَكَانَ إِذَا بَعَثَ سَرِيَّةً أَوْ جَيْشًا بَعَثَهُمْ فِي أَوَّلِ النَّهَارِ ‏.‏ قَالَ وَكَانَ صَخْرٌ رَجُلاً تَاجِرًا فَكَانَ يَبْعَثُ تِجَارَتَهُ فِي أَوَّلِ النَّهَارِ فَأَثْرَى وَكَثُرَ مَالُهُ ‏.‏","english":{"narrator":"It was narrated from Sakhr Al-Ghamidi that the  Messenger of Allah (ﷺ) said:","text":"\"O Allah, bless my nation in their early mornings (i.e., what they do early in the morning).\" (Hasan)He said: \"When he sent out a raiding party or an army, he would send them at the beginning of the day.\" He said: (1) \"Sakhr was a man engaged in trade, and he used to send his goods out at the beginning of the day, and his wealth grew and increased.\""}},{"id":101,"idInBook":101,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا أَبُو مَرْوَانَ، مُحَمَّدُ بْنُ عُثْمَانَ الْعُثْمَانِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ مَيْمُونٍ الْمَدَنِيُّ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي الزِّنَادِ، عَنْ أَبِيهِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ اللَّهُمَّ بَارِكْ لأُمَّتِي فِي بُكُورِهَا يَوْمَ الْخَمِيسِ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:","text":"\"O Allah, bless my nation early in the morning of Thursday.' \""}},{"id":102,"idInBook":102,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ، حَدَّثَنَا إِسْحَاقُ بْنُ جَعْفَرِ بْنِ مُحَمَّدِ بْنِ عَلِيِّ بْنِ الْحُسَيْنِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ الْجُدْعَانِيِّ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ اللَّهُمَّ بَارِكْ لأُمَّتِي فِي بُكُورِهَا ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from Ibn Umar that the Messenger of Allah (ﷺ) said:","text":"\"O Allah, bless my nation early in the morning.' \""}},{"id":103,"idInBook":103,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامِ بْنِ حَسَّانَ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ مَنِ ابْتَاعَ مُصَرَّاةً فَهُوَ بِالْخِيَارِ ثَلاَثَةَ أَيَّامٍ فَإِنْ رَدَّهَا رَدَّ مَعَهَا صَاعًا مِنْ تَمْرٍ لاَ سَمْرَاءَ ‏\"‏ ‏.‏ يَعْنِي الْحِنْطَةَ ‏.‏","english":{"narrator":"It was narrated from Ibn 'Umar that the Prophet (ﷺ) said:","text":"\"O Allah, bless my nation in their early mornings.\". It was narrated from Abu Hurairah that the Prophet (ﷺ) said: \"Whoever buys a Musarrah, he has the choice (of annulling the deal) for three days. If he returns it, then he must also give a Sa' of dates, not Samra'.\" Meaning wheat."}},{"id":104,"idInBook":104,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي الشَّوَارِبِ، حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، حَدَّثَنَا صَدَقَةُ بْنُ سَعِيدٍ الْحَنَفِيُّ، حَدَّثَنَا جُمَيْعُ بْنُ عُمَيْرٍ التَّيْمِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ يَا أَيُّهَا النَّاسُ مَنْ بَاعَ مُحَفَّلَةً فَهُوَ بِالْخِيَارِ ثَلاَثَةَ أَيَّامٍ فَإِنْ رَدَّهَا رَدَّ مَعَهَا مِثْلَىْ لَبَنِهَا - أَوْ قَالَ مِثْلَ لَبَنِهَا - قَمْحًا ‏\"‏ ‏.‏","english":{"narrator":"'Abdullah bin 'Umar said:","text":"\"The Messenger of Allah (ﷺ) said: 'Whoever buys a Muhaffalah, (1) he has the choice (of annulling the deal) for three days. If he returns it, then he must also give wheat equal to twice, the amount of its milk, or equal to the amount of its milk.\"'"}},{"id":105,"idInBook":105,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا الْمَسْعُودِيُّ، عَنْ جَابِرٍ، عَنْ أَبِي الضُّحَى، عَنْ مَسْرُوقٍ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، أَنَّهُ قَالَ أَشْهَدُ عَلَى الصَّادِقِ الْمَصْدُوقِ أَبِي الْقَاسِمِ ـ صلى الله عليه وسلم ـ أَنَّهُ حَدَّثَنَا قَالَ ‏\n\"‏ بَيْعُ الْمُحَفَّلاَتِ خِلاَبَةٌ وَلاَ تَحِلُّ الْخِلاَبَةُ لِمُسْلِمٍ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated that 'Abdullah bin Mas'ud said:","text":"\"I bear witness that the true and truly inspired one Abul-Qasim (ﷺ) told us: 'Selling a Muhaffalah is Khilabah, and Khilabah is not lawful for the Muslim.\"' (Ibn Majah said: \" Meaning: 'Deception.\")"}},{"id":106,"idInBook":106,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا وَكِيعٌ، عَنِ ابْنِ أَبِي ذِئْبٍ، عَنْ مَخْلَدِ بْنِ خُفَافِ بْنِ إِيمَاءَ بْنِ رَحَضَةَ الْغِفَارِيِّ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَضَى أَنَّ خَرَاجَ الْعَبْدِ بِضَمَانِهِ ‏.‏","english":{"narrator":"It was narrated from Aishah that :","text":"the Messenger of Allah (ﷺ) ruled that what a slave earns belongs to his guarantor."}},{"id":107,"idInBook":107,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا مُسْلِمُ بْنُ خَالِدٍ الزَّنْجِيُّ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ رَجُلاً، اشْتَرَى عَبْدًا فَاسْتَغَلَّهُ ثُمَّ وَجَدَ بِهِ عَيْبًا فَرَدَّهُ ‏.‏ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّهُ قَدِ اسْتَغَلَّ غُلاَمِي ‏.‏ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ الْخَرَاجُ بِالضَّمَانِ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from 'Aishah that:","text":"a man bought a slave and put him to work, then he found some defect in him, so he returned him. He (the seller) said: \"O Messenger of Allah he put my slave to work.\" The Messenger of Allah (ﷺ) said: \"A slave's earnings belong to his guarantor.\""}},{"id":108,"idInBook":108,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، إِنْ شَاءَ اللَّهُ عَنْ سَمُرَةَ بْنِ جُنْدُبٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ عُهْدَةُ الرَّقِيقِ ثَلاَثَةُ أَيَّامٍ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from Samurah bin Jundab that the Messenger of Allah (ﷺ) said:","text":"\"The contractual obligation regarding a slave lasts for three days.\" (1)"}},{"id":109,"idInBook":109,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ، حَدَّثَنَا هُشَيْمٌ، عَنْ يُونُسَ بْنِ عُبَيْدٍ، عَنِ الْحَسَنِ، عَنْ عُقْبَةَ بْنِ عَامِرٍ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ لاَ عُهْدَةَ بَعْدَ أَرْبَعٍ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from 'Uqbah bin 'Amir that the Messenger of Allah (ﷺ) said:","text":"\"There is no contractual obligation after four (days).\""}},{"id":110,"idInBook":110,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا أَبِي، سَمِعْتُ يَحْيَى بْنَ أَيُّوبَ، يُحَدِّثُ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ شُمَاسَةَ، عَنْ عُقْبَةَ بْنِ عَامِرٍ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\n\"‏ الْمُسْلِمُ أَخُو الْمُسْلِمِ وَلاَ يَحِلُّ لِمُسْلِمٍ بَاعَ مِنْ أَخِيهِ بَيْعًا فِيهِ عَيْبٌ إِلاَّ بَيَّنَهُ لَهُ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated that 'Uqbah bin 'Amir said:","text":"\"I heard the Messenger of Allah (ﷺ) say: 'The Muslim is the brother of another Muslim, and it is not permissible for a Muslim to sell his brother goods in which there is a defect, without pointing that out to him.\"'"}},{"id":111,"idInBook":111,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ الضَّحَّاكِ، حَدَّثَنَا بَقِيَّةُ بْنُ الْوَلِيدِ، عَنْ مُعَاوِيَةَ بْنِ يَحْيَى، عَنْ مَكْحُولٍ، وَسُلَيْمَانَ بْنِ مُوسَى، عَنْ وَاثِلَةَ بْنِ الأَسْقَعِ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\n\"‏ مَنْ بَاعَ عَيْبًا لَمْ يُبَيِّنْهُ لَمْ يَزَلْ فِي مَقْتٍ مِنَ اللَّهِ وَلَمْ تَزَلِ الْمَلاَئِكَةُ تَلْعَنُهُ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated that Wathilah bin Asqa' said:","text":"\"I heard the Messenger of Allah (ﷺ) say: 'Whoever sells defective goods without pointing it out, he will remain subject to the wrath of Allah, and the angels will continue to curse him.'\""}},{"id":112,"idInBook":112,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، وَمُحَمَّدُ بْنُ إِسْمَاعِيلَ، قَالاَ حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا سُفْيَانُ، عَنْ جَابِرٍ، عَنِ الْقَاسِمِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، قَالَ كَانَ النَّبِيُّ ـ صلى الله عليه وسلم ـ إِذَا أُتِيَ بِالسَّبْىِ أَعْطَى أَهْلَ الْبَيْتِ جَمِيعًا كَرَاهِيَةَ أَنْ يُفَرِّقَ بَيْنَهُمْ ‏.‏","english":{"narrator":"It was narrated that 'Abdullah bin Mas'ud said:","text":"\"When captives were brought to him, the Prophet (ﷺ) would give the members of one family together (to one person), not wanting to separate them.\""}},{"id":113,"idInBook":113,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا عَفَّانُ، عَنْ حَمَّادٍ، أَنْبَأَنَا الْحَجَّاجُ، عَنِ الْحَكَمِ، عَنْ مَيْمُونِ بْنِ أَبِي شَبِيبٍ، عَنْ عَلِيٍّ، قَالَ وَهَبَ لِي رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ غُلاَمَيْنِ أَخَوَيْنِ فَبِعْتُ أَحَدَهُمَا فَقَالَ ‏\"‏ مَا فَعَلَ الْغُلاَمَانِ ‏\"‏ ‏.‏ قُلْتُ بِعْتُ أَحَدَهُمَا قَالَ ‏\"‏ رُدَّهُ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated that 'Ali said:","text":"\"The Messenger of Allah (ﷺ) gave me two slaves who were brothers, and I sold one of them. He said: 'What happened with the two slaves?' I said: 'I sold one of them.' He said: 'Take him back.\"'"}},{"id":114,"idInBook":114,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عُمَرَ بْنِ الْهَيَّاجِ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، أَنْبَأَنَا إِبْرَاهِيمُ بْنُ إِسْمَاعِيلَ، عَنْ طَلِيقِ بْنِ عِمْرَانَ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ لَعَنَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ مَنْ فَرَّقَ بَيْنَ الْوَالِدَةِ وَوَلَدِهَا وَبَيْنَ الأَخِ وَبَيْنَ أَخِيهِ ‏.‏","english":{"narrator":"It was narrated that Abu Musa said:","text":"\"The Messenger of Allah (ﷺ) cursed the one who separates a mother and her child, or a brother from his brother.\""}},{"id":115,"idInBook":115,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبَّادُ بْنُ لَيْثٍ، صَاحِبُ الْكَرَابِيسِيِّ حَدَّثَنَا عَبْدُ الْمَجِيدِ بْنُ وَهْبٍ، قَالَ قَالَ لِي الْعَدَّاءُ بْنُ خَالِدِ بْنِ هَوْذَةَ أَلاَ نُقْرِئُكَ كِتَابًا كَتَبَهُ لِي رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏.‏ قَالَ قُلْتُ بَلَى ‏.‏ فَأَخْرَجَ لِي كِتَابًا فَإِذَا فِيهِ ‏\n\"‏ هَذَا مَا اشْتَرَى الْعَدَّاءُ بْنُ خَالِدِ بْنِ هَوْذَةَ مِنْ مُحَمَّدٍ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ اشْتَرَى مِنْهُ عَبْدًا أَوْ أَمَةً لاَ دَاءَ وَلاَ غَائِلَةَ وَلاَ خِبْثَةَ بَيْعَ الْمُسْلِمِ لِلْمُسْلِمِ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated that 'Abdul-Majid bin Wahb said:","text":"\"Adda' bin Khalid bin Hawdhah said to me: 'Shall I not read to you a letter that the Messenger of Allah (ﷺ), wrote to me?' I said: 'Yes.' So he took out a letter. In it was: 'This is what 'Adda' bin Khalid bin Hawdhah bought  Muhammad the Messenger of Allah (ﷺ)  He bought from him a slave' or 'a female slave, having no ailments, nor being a runaway, not having any malicious behavior. Sold by a Muslim to a Muslim.'\""}},{"id":116,"idInBook":116,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ، حَدَّثَنَا أَبُو خَالِدٍ الأَحْمَرُ، عَنِ ابْنِ عَجْلاَنَ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ إِذَا اشْتَرَى أَحَدُكُمُ الْجَارِيَةَ فَلْيَقُلِ اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا وَخَيْرَ مَا جَبَلْتَهَا عَلَيْهِ وَأَعُوذُ بِكَ مِنْ شَرِّهَا وَشَرِّ مَا جَبَلْتَهَا عَلَيْهِ وَلْيَدْعُ بِالْبَرَكَةِ وَإِذَا اشْتَرَى أَحَدُكُمْ بَعِيرًا فَلْيَأْخُذْ بِذِرْوَةِ سَنَامِهِ وَلْيَدْعُ بِالْبَرَكَةِ وَلْيَقُلْ مِثْلَ ذَلِكَ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from 'Amr bin Shu'aib from his father that his grandfather told that the Messenger of Allah (ﷺ) said:","text":"\"When anyone of you buys a slave woman let him say: 'Allahumma inni as'aluka khairaha wa khaira ma jabaltaha alaihi, wa a'udhu bika min sharriha wa sharri ma jabaltaha alaihi (O Allah, I ask You for the goodness within her and the goodness that You have made her inclined towards, and I seek refuge with You from the evil within her and the evil that You have made her inclined towards).' And he should pray for blessing. And if anyone of you buys a camel then he should take hold of its hump and pray for. blessing and say similar words.\""}},{"id":117,"idInBook":117,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، وَهِشَامُ بْنُ عَمَّارٍ، وَنَصْرُ بْنُ عَلِيٍّ، وَمُحَمَّدُ بْنُ الصَّبَّاحِ، قَالُوا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ مَالِكِ بْنِ أَوْسِ بْنِ الْحَدَثَانِ النَّصْرِيِّ، قَالَ سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ، يَقُولُ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ الذَّهَبُ بِالذَّهَبِ رِبًا إِلاَّ هَاءَ وَهَاءَ وَالْبُرُّ بِالْبُرِّ رِبًا إِلاَّ هَاءَ وَهَاءَ وَالشَّعِيرُ بِالشَّعِيرِ رِبًا إِلاَّ هَاءَ وَهَاءَ وَالتَّمْرُ بِالتَّمْرِ رِبًا إِلاَّ هَاءَ وَهَاءَ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated that Malik bin Aws bin Hadathan Nasri said:","text":"\"I heard 'Umar bin Al-Khattab say: 'The Messenger of Allah (ﷺ) said: \"Exchanging gold for gold is usury  unless it is done on the spot. (Exchanging) wheat for wheat is usury, unless it is done on the spot. (Exchanging) barley for barley is usury unless it is done on the spot. (Exchanging) dates for dates is usury, unless it is done on the spot.\""}},{"id":118,"idInBook":118,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ خَالِدِ بْنِ خِدَاشٍ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، قَالاَ حَدَّثَنَا سَلَمَةُ بْنُ عَلْقَمَةَ التَّمِيمِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ سِيرِينَ، أَنَّ مُسْلِمَ بْنَ يَسَارٍ، وَعَبْدَ اللَّهِ بْنَ عُبَيْدٍ، حَدَّثَاهُ قَالاَ، جَمَعَ الْمَنْزِلُ بَيْنَ عُبَادَةَ بْنِ الصَّامِتِ وَمُعَاوِيَةَ إِمَّا فِي كَنِيسَةٍ وَإِمَّا فِي بِيعَةٍ فَحَدَّثَهُمْ عُبَادَةُ بْنُ الصَّامِتِ فَقَالَ نَهَانَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنْ بَيْعِ الْوَرِقِ بِالْوَرِقِ وَالذَّهَبِ بِالذَّهَبِ وَالْبُرِّ بِالْبُرِّ وَالشَّعِيرِ بِالشَّعِيرِ وَالتَّمْرِ بِالتَّمْرِ - قَالَ أَحَدُهُمَا وَالْمِلْحِ بِالْمِلْحِ وَلَمْ يَقُلْهُ الآخَرُ - وَأَمَرَنَا أَنْ نَبِيعَ الْبُرَّ بِالشَّعِيرِ وَالشَّعِيرَ بِالْبُرِّ يَدًا بِيَدٍ كَيْفَ شِئْنَا ‏.‏","english":{"narrator":"Muslim bin Yasar and 'Abdullah bin 'Ubaid said :","text":"\"Ubadah bin Samit and Mu'awiyah happened to meet, either in a church or in a synagogue. 'Ubadah bin Samit narrated to them and said: 'The Messenger of Allah (ﷺ) forbade us from selling silver for silver, gold for gold, wheat for wheat, barley for barley, and dates for dates.'I one of them said: \"And salt for salt,\" but the other did not say it. \"And he commanded us to sell wheat for barley, or barley for wheat, hand-to-hand, however we wished.\""}},{"id":119,"idInBook":119,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَعْلَى بْنُ عُبَيْدٍ، حَدَّثَنَا فُضَيْلُ بْنُ غَزْوَانَ، عَنِ ابْنِ أَبِي نُعْمٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ الْفِضَّةُ بِالْفِضَّةِ وَالذَّهَبُ بِالذَّهَبِ وَالشَّعِيرُ بِالشَّعِيرِ وَالْحِنْطَةُ بِالْحِنْطَةِ مِثْلاً بِمِثْلٍ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from Abu Hurairah that the Prophet (ﷺ) said:","text":"'(Sell) silver for silver, gold for gold, barley for barley, wheat for wheat, like for like.\""}},{"id":120,"idInBook":120,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي سَعِيدٍ، قَالَ كَانَ النَّبِيُّ ـ صلى الله عليه وسلم ـ يَرْزُقُنَا تَمْرًا مِنْ تَمْرِ الْجَمْعِ فَنَسْتَبْدِلُ بِهِ تَمْرًا هُوَ أَطْيَبُ مِنْهُ وَنَزِيدُ فِي السِّعْرِ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ لاَ يَصْلُحُ صَاعُ تَمْرٍ بِصَاعَيْنِ وَلاَ دِرْهَمٌ بِدِرْهَمَيْنِ وَالدِّرْهَمُ بِالدِّرْهَمِ وَالدِّينَارُ بِالدِّينَارِ لاَ فَضْلَ بَيْنَهُمَا إِلاَّ وَزْنًا ‏\"‏ ‏.‏","english":{"narrator":"It was narrated that Abu Sa’eed said:","text":"“The Prophet used to give us dates from the collection (mixed)  The Messenger of Allah said: ‘It is not right to give one Sa of dates for two Sa, nor one Dirham for two Dirham. A Dirham for a Dirham and a Dinar for a Dinar is allowed: the only difference between them is in weight (i.e., the weight must be equal.)’” Sahih"}},{"id":121,"idInBook":121,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ، يَقُولُ الدِّرْهَمُ بِالدِّرْهَمِ وَالدِّينَارُ بِالدِّينَارِ ‏.‏ فَقُلْتُ إِنِّي سَمِعْتُ ابْنَ عَبَّاسٍ يَقُولُ غَيْرَ ذَلِكَ ‏.‏ قَالَ أَمَا إِنِّي لَقِيتُ ابْنَ عَبَّاسٍ فَقُلْتُ أَخْبِرْنِي عَنْ هَذَا الَّذِي تَقُولُ فِي الصَّرْفِ أَشَىْءٌ سَمِعْتَهُ مِنْ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ أَمْ شَىْءٌ وَجَدْتَهُ فِي كِتَابِ اللَّهِ ‏.‏ فَقَالَ مَا وَجَدْتُهُ فِي كِتَابِ اللَّهِ وَلاَ سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ وَلَكِنْ أَخْبَرَنِي أُسَامَةُ بْنُ زَيْدٍ أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ إِنَّمَا الرِّبَا فِي النَّسِيئَةِ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated that Abu Hurairah said:","text":"\"I heard Abu Saeed Al-Khudri say: 'A Dirham for a Dirham and a Dinar for a Dinar.' So I said: 'I heard Ibn 'Abbas say something other than that.' He said: 'But I met Ibn 'Abbas and said: \"Tell me about what you say concerning  exchange is it something that you heard from the Messenger of Allah (ﷺ) or something that You found in the Book of Allah?\" He said: \"I did not find it in the Book of Allah, and I did not hear it from the Messenger of Allah; rather Usamah bin Zaid told me that the Messenger of Allah (ﷺ) said: \"Usury is only in credit.\""}},{"id":122,"idInBook":122,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ، أَنْبَأَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ سُلَيْمَانَ بْنِ عَلِيٍّ الرِّبْعِيِّ، عَنْ أَبِي الْجَوْزَاءِ، قَالَ سَمِعْتُهُ يَأْمُرُ، بِالصَّرْفِ - يَعْنِي ابْنَ عَبَّاسٍ - وَيُحَدَّثُ ذَلِكَ عَنْهُ ثُمَّ بَلَغَنِي أَنَّهُ رَجَعَ عَنْ ذَلِكَ فَلَقِيتُهُ بِمَكَّةَ فَقُلْتُ إِنَّهُ بَلَغَنِي أَنَّكَ رَجَعْتَ ‏.‏ قَالَ نَعَمْ إِنَّمَا كَانَ ذَلِكَ رَأْيًا مِنِّي وَهَذَا أَبُو سَعِيدٍ يُحَدِّثُ عَنْ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ أَنَّهُ نَهَى عَنِ الصَّرْفِ ‏.‏","english":{"narrator":"It was narrated that Abu Jawza' said:","text":"\"I heard him meaning Ibn 'Abbas allowing exchange (of Dirhams for Dirham etc., if extra was given) and that was narrated from him. Then I heard that he has taken back this opinion. I met him in Makkah and said: 'I heard that you had taken back (your opinion).' He said: 'Yes. That was just my own opinion, but Abu Sa'eed narrated from the Messenger of Allah (ﷺ) that he forbade exchange (of like items if extra is given).\"'"}},{"id":123,"idInBook":123,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، سَمِعَ مَالِكَ بْنَ أَوْسِ بْنِ الْحَدَثَانِ، يَقُولُ سَمِعْتُ عُمَرَ، يَقُولُ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ الذَّهَبُ بِالْوَرِقِ رِبًا إِلاَّ هَاءَ وَهَاءَ ‏\"‏ ‏.‏ قَالَ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ سَمِعْتُ سُفْيَانَ يَقُولُ الذَّهَبُ بِالْوَرِقِ احْفَظُوا ‏.‏","english":{"narrator":"It was narrated that Zuhri heard Malik bin Aws bin Hadathan say:","text":"\"I heard 'Umar say: \"The Messenger of Allah (ﷺ), said: 'Gold for silver is usury, unless it is exchanged on the spot.\"' (Sahih) Abu Bakr bin Abu-Shaibah said: \"I heard sufyan saying: 'Gold for silver.\" memorize (this)."}},{"id":124,"idInBook":124,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنِ ابْنِ شِهَابٍ، عَنْ مَالِكِ بْنِ أَوْسِ بْنِ الْحَدَثَانِ، قَالَ أَقْبَلْتُ أَقُولُ مَنْ يَصْطَرِفُ الدَّرَاهِمَ فَقَالَ طَلْحَةُ بْنُ عُبَيْدِ اللَّهِ وَهُوَ عِنْدَ عُمَرَ بْنِ الْخَطَّابِ أَرِنَا ذَهَبَكَ ثُمَّ ائْتِنَا إِذَا جَاءَ خَازِنُنَا نُعْطِكَ وَرِقَكَ ‏.‏ فَقَالَ عُمَرُ كَلاَّ وَاللَّهِ لَتُعْطِيَنَّهُ وَرِقَهُ أَوْ لَتَرُدَّنَّ إِلَيْهِ ذَهَبَهُ فَإِنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ الْوَرِقُ بِالذَّهَبِ رِبًا إِلاَّ هَاءَ وَهَاءَ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated that Malik bin Aws bin Hadathan said:","text":"\"I came saying. 'Who will exchange Dirham?' Talhah bin 'Ubaidullah, who was with 'Umar bin Khattab, said: 'Show us your gold, then come to us; when our treasure comes, we will give you your silver.' 'Umar said: 'No, by Allah, you will give him silver (now), or give him back his gold, for the Messenger of Allah (ﷺ) said: \"Silver for gold is usury, unless it is exchanged on the spot.\"'"}},{"id":125,"idInBook":125,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا أَبُو إِسْحَاقَ الشَّافِعِيُّ، إِبْرَاهِيمُ بْنُ مُحَمَّدِ بْنِ الْعَبَّاسِ حَدَّثَنِي أَبِي، عَنْ أَبِيهِ الْعَبَّاسِ بْنِ عُثْمَانَ بْنِ شَافِعٍ، عَنْ عُمَرَ بْنِ مُحَمَّدِ بْنِ عَلِيِّ بْنِ أَبِي طَالِبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ الدِّينَارُ بِالدِّينَارِ وَالدِّرْهَمُ بِالدِّرْهَمِ لاَ فَضْلَ بَيْنَهُمَا فَمَنْ كَانَتْ لَهُ حَاجَةٌ بِوَرِقٍ فَلْيَصْطَرِفْهَا بِذَهَبٍ وَمَنْ كَانَتْ لَهُ حَاجَةٌ بِذَهَبٍ فَلْيَصْطَرِفْهَا بِالْوَرِقِ وَالصَّرْفُ هَاءَ وَهَاءَ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from Umar bin Muhammad bin 'Ali bin abi Talib, from his father, that his grandfather said:","text":"'The Messenger of Allah (ﷺ) said: 'Dinar for Dinar, Dirham for Dirham, with no increase between them. Whoever has need of silver, let him trade gold for it, and whoever has need of gold, let him trade silver for it, and let the transaction be done on the spot.\"'"}},{"id":126,"idInBook":126,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ بْنِ حَبِيبٍ، وَسُفْيَانُ بْنُ وَكِيعٍ، وَمُحَمَّدُ بْنُ عُبَيْدِ بْنِ ثَعْلَبَةَ الْحِمَّانِيُّ، قَالُوا حَدَّثَنَا عُمَرُ بْنُ عُبَيْدٍ الطَّنَافِسِيُّ، حَدَّثَنَا عَطَاءُ بْنُ السَّائِبِ، أَوْ سِمَاكٌ - وَلاَ أَعْلَمُهُ إِلاَّ سِمَاكًا - عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنِ ابْنِ عُمَرَ قَالَ كُنْتُ أَبِيعُ الإِبِلَ فَكُنْتُ آخُذُ الذَّهَبَ مِنَ الْفِضَّةِ وَالْفِضَّةَ مِنَ الذَّهَبِ وَالدَّنَانِيرَ مِنَ الدَّرَاهِمِ وَالدَّرَاهِمَ مِنَ الدَّنَانِيرِ ‏.‏ فَسَأَلْتُ النَّبِيَّ ـ صلى الله عليه وسلم ـ فَقَالَ ‏\n\"‏ إِذَا أَخَذْتَ أَحَدَهُمَا وَأَعْطَيْتَ الآخَرَ فَلاَ تُفَارِقْ صَاحِبَكَ وَبَيْنَكَ وَبَيْنَهُ لَبْسٌ ‏\"‏ ‏.‏ \n حَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ، حَدَّثَنَا يَعْقُوبُ بْنُ إِسْحَاقَ، أَنْبَأَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ سِمَاكِ بْنِ حَرْبٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ نَحْوَهُ ‏.‏","english":{"narrator":"It was narrated that Ibn 'Umar said:","text":"\"I used to sell camels, and I used to buy gold for silver and silver for gold, Dinar for Dirham and Dirham for Dinar. I asked the Prophet (ﷺ) about that, and he said: 'If you take one of them and give the other, then you and your companion should not separate until everything is clear (i.e., the exchange is completed).’” (Hasan) Another chain with similar wording."}},{"id":127,"idInBook":127,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَسُوَيْدُ بْنُ سَعِيدٍ، وَهَارُونُ بْنُ إِسْحَاقَ، قَالُوا أَنْبَأَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ، عَنْ مُحَمَّدِ بْنِ فَضَاءٍ، عَنْ أَبِيهِ، عَنْ عَلْقَمَةَ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِيهِ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنْ كَسْرِ سِكَّةِ الْمُسْلِمِينَ الْجَائِزَةِ بَيْنَهُمْ إِلاَّ مِنْ بَأْسٍ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from 'Alqamah bin 'Abdullah that his father said:","text":"\"The Messenger of Allah (ﷺ) forbade breaking the coins of the Muslims that are in circulation among them, without any necessary reason.”(1)"}},{"id":128,"idInBook":128,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، وَإِسْحَاقُ بْنُ سُلَيْمَانَ، قَالاَ حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ، مَوْلَى الأَسْوَدِ بْنِ سُفْيَانَ أَنَّ زَيْدًا أَبَا عَيَّاشٍ، - مَوْلًى لِبَنِي زُهْرَةَ - أَخْبَرَهُ أَنَّهُ، سَأَلَ سَعْدَ بْنَ أَبِي وَقَّاصٍ عَنِ اشْتِرَاءِ الْبَيْضَاءِ، بِالسُّلْتِ فَقَالَ لَهُ سَعْدٌ أَيَّتُهُمَا أَفْضَلُ قَالَ الْبَيْضَاءُ ‏.‏ فَنَهَانِي عَنْهُ وَقَالَ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ سُئِلَ عَنِ اشْتِرَاءِ الرُّطَبِ بِالتَّمْرِ فَقَالَ ‏\n\"‏ أَيَنْقُصُ الرُّطَبُ إِذَا يَبِسَ ‏\"‏ ‏.‏ قَالُوا نَعَمْ ‏.‏ فَنَهَى عَنْ ذَلِكَ ‏.‏","english":{"narrator":"It was narrated from 'Abdullah bin Yazid, the freed slave of Al-Aswad bin Sufyan, that :","text":"Zaid, Abu 'Ayyash, the freed slave of Bani Zuhrah, told him that he asked Sa'd bin Abu Waqqas about buying wheat with barley. Sa'd said to him: \"Which of them is better?\" He said: \"Wheat.\" He told him not to do that and said: \"I heard the Messenger of Allah (ﷺ) being asked about buying fresh dates with dried dates, and he said: 'Do fresh dates decrease in weight when they become dry?' They said: 'Yes.' So he told them not to do that.\""}},{"id":129,"idInBook":129,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنِ الْمُزَابَنَةِ ‏.‏ وَالْمُزَابَنَةُ أَنْ يَبِيعَ الرَّجُلُ تَمْرَ حَائِطِهِ إِنْ كَانَتْ نَخْلاً بِتَمْرٍ كَيْلاً وَإِنْ كَانَتْ كَرْمًا أَنْ يَبِيعَهُ بِزَبِيبٍ كَيْلاً وَإِنْ كَانَتْ زَرْعًا أَنْ يَبِيعَهُ بِكَيْلِ طَعَامٍ نَهَى عَنْ ذَلِكَ كُلِّهِ ‏.‏","english":{"narrator":"It was narrated that 'Abduilah bin 'Umar said:","text":"\"The Messenger of Allah (ﷺ) forbade the Muzabanah. The Muzdbanah means when a man sells the dates of his grove when they are still on the tree, for a measure of dty dates; or, if it is grapes, he sells them when they are still on the vine, for a measure of raisins; or if it is a crop, he sells it for food, estimating the amount (of the crop in the field). He forbade all of these things.\""}},{"id":130,"idInBook":130,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا أَزْهَرُ بْنُ مَرْوَانَ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ أَبِي الزُّبَيْرِ، وَسَعِيدِ بْنِ مِينَاءَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ نَهَى عَنِ الْمُحَاقَلَةِ وَالْمُزَابَنَةِ ‏.‏","english":{"narrator":"lt was narrated from Sabir bin 'Abdullah that :","text":"the Messenger of Allah (ﷺ) forbade the Muhaqalah and the Muzabanah."}},{"id":131,"idInBook":131,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ طَارِقِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ رَافِعِ بْنِ خَدِيجٍ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنِ الْمُحَاقَلَةِ وَالْمُزَابَنَةِ ‏.‏","english":{"narrator":"It was narrated that Rafi, bin Khadij said:","text":"\"The Messenger of Allah (ﷺ) forbade the Muhaqalah and the Muzabanah.\""}},{"id":132,"idInBook":132,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، وَمُحَمَّدُ بْنُ الصَّبَّاحِ، قَالاَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، حَدَّثَنِي زَيْدُ بْنُ ثَابِتٍ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ رَخَّصَ فِي الْعَرَايَا ‏.‏","english":{"narrator":"It was narrated from Salim from his father:","text":"\"Zaid bin Thabit narrated to me that the Messenger of Allah (ﷺ) gave a concession regarding the sale of 'Araya.”"}},{"id":133,"idInBook":133,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ قَالَ حَدَّثَنِي زَيْدُ بْنُ ثَابِتٍ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ أَرْخَصَ فِي بَيْعِ الْعَرِيَّةِ بِخَرْصِهَا تَمْرًا ‏.‏ قَالَ يَحْيَى الْعَرِيَّةُ أَنْ يَشْتَرِيَ الرَّجُلُ ثَمَرَ النَّخَلاَتِ بِطَعَامِ أَهْلِهِ رُطَبًا بِخَرْصِهَا تَمْرًا ‏.‏","english":{"narrator":"It was narrated from 'Abdullah bin 'Umar that he said:","text":"\"Zaid bin Thabit told me that the Messenger of Allah (ﷺ) gave a concession regarding the sale of the estimated harvest of 'Araya return for dried dates.\" (Sahih) Yahya (one of the narrators) said: \"The 'Araya is when a man purchases dates on the trees for food that his family has that is ripe, by estimating them (the dates).\""}},{"id":134,"idInBook":134,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ سَمُرَةَ بْنِ جُنْدُبٍ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ نَهَى عَنْ بَيْعِ الْحَيَوَانِ بِالْحَيَوَانِ نَسِيئَةً ‏.‏","english":{"narrator":"It was narrated from Samurah bin Jundub that :","text":"the Messenger of Allah (ﷺ) forbade selling animals for animals on credit."}},{"id":135,"idInBook":135,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، وَأَبُو خَالِدٍ عَنْ حَجَّاجٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ لاَ بَأْسَ الْحَيَوَانُ بِالْحَيَوَانِ وَاحِدًا بِاثْنَيْنِ يَدًا بِيَدٍ ‏\"‏ ‏.‏ وَكَرِهَهُ نَسِيئَةً ‏.‏","english":{"narrator":"It was narrated from Jabir that the Messenger of Allah (ﷺ) said:","text":"\"There is nothing wrong with selling animals, one for two, hand to hand,\" but he disliked selling them on credit."}},{"id":136,"idInBook":136,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، حَدَّثَنَا الْحُسَيْنُ بْنُ عُرْوَةَ، ح وَحَدَّثَنَا أَبُو عُمَرَ، حَفْصُ بْنُ عَمْرٍو حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، قَالاَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ اشْتَرَى صَفِيَّةَ بِسَبْعَةِ أَرْؤُسٍ ‏.‏ قَالَ عَبْدُ الرَّحْمَنِ مِنْ دِحْيَةَ الْكَلْبِيِّ ‏.‏","english":{"narrator":"It was narrated from Anas that :","text":"the Prophet (ﷺ) bought Safiyyah for seven slaves. (Sahih) (One of the narrators) 'Abdur-Rahman said: \"From Dihyah Kalbi.'"}},{"id":137,"idInBook":137,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى، عَنْ حَمَّادِ بْنِ سَلَمَةَ، عَنْ عَلِيِّ بْنِ زَيْدٍ، عَنْ أَبِي الصَّلْتِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ أَتَيْتُ لَيْلَةَ أُسْرِيَ بِي عَلَى قَوْمٍ بُطُونُهُمْ كَالْبُيُوتِ فِيهَا الْحَيَّاتُ تُرَى مِنْ خَارِجِ بُطُونِهِمْ فَقُلْتُ مَنْ هَؤُلاَءِ يَا جِبْرَائِيلُ قَالَ هَؤُلاَءِ أَكَلَةُ الرِّبَا ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:","text":"'\n\"'On the night in which I was taken on the Night Journey (Al-Isra'), I came to people whose stomachs were like houses, in which there were snakes that could be seen from outside their stomachs. I said: 'Who are these, O Jibra’il?’ He said: 'They are the ones who consumed usury.\"'"}},{"id":138,"idInBook":138,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، عَنْ أَبِي مَعْشَرٍ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ الرِّبَا سَبْعُونَ حُوبًا أَيْسَرُهَا أَنْ يَنْكِحَ الرَّجُلُ أُمَّهُ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:","text":"\"There are seventy degrees of usury, the least of which is equivalent to a man having intercourse with his mother.\""}},{"id":139,"idInBook":139,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ الصَّيْرَفِيُّ أَبُو حَفْصٍ، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ شُعْبَةَ، عَنْ زُبَيْدٍ، عَنْ إِبْرَاهِيمَ، عَنْ مَسْرُوقٍ، عَنْ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ الرِّبَا ثَلاَثَةٌ وَسَبْعُونَ بَابًا ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from 'Abdullah that the Prophet (ﷺ) said:","text":"\"There are seventy-three degrees of usury.\""}},{"id":140,"idInBook":140,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ عُمَرَ بْنِ الْخَطَّابِ، قَالَ إِنَّ آخِرَ مَا نَزَلَتْ آيَةُ الرِّبَا وَإِنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قُبِضَ وَلَمْ يُفَسِّرْهَا لَنَا فَدَعُوا الرِّبَا وَالرِّيبَةَ ‏.‏","english":{"narrator":"It was narrated that 'Umar bin Khattab said:","text":"\"The last thing to be revealed was the Verse on usury but the Messenger of Allah (ﷺ) died before he had explained it to us. So give up usury (interest) and doubtful things.\""}},{"id":141,"idInBook":141,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا سِمَاكُ بْنُ حَرْبٍ، قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ عَبْدِ اللَّهِ، يُحَدِّثُ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ لَعَنَ آكِلَ الرِّبَا وَمُوكِلَهُ وَشَاهِدَيْهِ وَكَاتِبَهُ ‏.‏","english":{"narrator":"It was narrated from 'Abdullah bin Mas'ud that :","text":"Xthe Messenger of Allah (ﷺ) cursed the one who consumes usury, the one who pays it, those who witness it and the one who writes it down."}},{"id":142,"idInBook":142,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، حَدَّثَنَا دَاوُدُ بْنُ أَبِي هِنْدٍ، عَنْ سَعِيدِ بْنِ أَبِي خَيْرَةَ، عَنِ الْحَسَنِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ لَيَأْتِيَنَّ عَلَى النَّاسِ زَمَانٌ لاَ يَبْقَى مِنْهُمْ أَحَدٌ إِلاَّ أَكَلَ الرِّبَا فَمَنْ لَمْ يَأْكُلْ أَصَابَهُ مِنْ غُبَارِهِ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:","text":"“There will come a time when there will be no one left who does not consume usury (interest), and whoever does not consume it will nevertheless be affected by it.\"'"}},{"id":143,"idInBook":143,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا الْعَبَّاسُ بْنُ جَعْفَرٍ، حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ، حَدَّثَنَا يَحْيَى بْنُ أَبِي زَائِدَةَ، عَنْ إِسْرَائِيلَ، عَنْ رُكَيْنِ بْنِ الرَّبِيعِ بْنِ عَمِيلَةَ، عَنْ أَبِيهِ، عَنِ ابْنِ مَسْعُودٍ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ مَا أَحَدٌ أَكْثَرَ مِنَ الرِّبَا إِلاَّ كَانَ عَاقِبَةُ أَمْرِهِ إِلَى قِلَّةٍ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from Ibn Mas'ud that the Prophet (ﷺ) said:","text":"\"There is no one who deals in usury a great deal (to increase his wealth) but he will end up with little (i.e., his wealth will be decreased).\""}},{"id":144,"idInBook":144,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ ابْنِ أَبِي نَجِيحٍ، عَنْ عَبْدِ اللَّهِ بْنِ كَثِيرٍ، عَنْ أَبِي الْمِنْهَالِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَدِمَ النَّبِيُّ ـ صلى الله عليه وسلم ـ وَهُمْ يُسْلِفُونَ فِي التَّمْرِ السَّنَتَيْنِ وَالثَّلاَثَ فَقَالَ ‏\n\"‏ مَنْ أَسْلَفَ فِي تَمْرٍ فَلْيُسْلِفْ فِي كَيْلٍ مَعْلُومٍ وَوَزْنٍ مَعْلُومٍ إِلَى أَجَلٍ مَعْلُومٍ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated that Ibn 'Abbas said:","text":"\"When the Prophet (ﷺ) came (to Al-Madinah), they used to pay in advance for dates, two or three years in advance. He said: 'Whoever pays in advance for dates, let him pay for a known amount or a known weight, to be delivered at a known time.’”"}},{"id":145,"idInBook":145,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، عَنْ مُحَمَّدِ بْنِ حَمْزَةَ بْنِ يُوسُفَ بْنِ عَبْدِ اللَّهِ بْنِ سَلاَمٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ عَبْدِ اللَّهِ بْنِ سَلاَمٍ، قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ ـ صلى الله عليه وسلم ـ فَقَالَ إِنَّ بَنِي فُلاَنٍ أَسْلَمُوا - لِقَوْمٍ مِنَ الْيَهُودِ - وَإِنَّهُمْ قَدْ جَاعُوا فَأَخَافُ أَنْ يَرْتَدُّوا ‏.‏ فَقَالَ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏\"‏ مَنْ عِنْدَهُ ‏\"‏ ‏.‏ فَقَالَ رَجُلٌ مِنَ الْيَهُودِ عِنْدِي كَذَا وَكَذَا - لِشَىْءٍ قَدْ سَمَّاهُ أُرَاهُ قَالَ ثَلاَثُمِائَةِ دِينَارٍ بِسِعْرِ كَذَا وَكَذَا مِنْ حَائِطِ بَنِي فُلاَنٍ ‏.‏ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ بِسِعْرِ كَذَا وَكَذَا إِلَى أَجَلِ كَذَا وَكَذَا وَلَيْسَ مِنْ حَائِطِ بَنِي فُلاَنٍ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from Muhammad bin Hamzah bin Yusuf bin 'Abdullah bin Salam, from his father, that his grandfather 'Abdullah bin Salam said:","text":"\"A man came to the Prophet (ﷺ) and said, 'The tribe of Banu so-and- so, who were descended from the Jews, have become Muslim, and they are starving, and I am afraid that they may apostatize.' The Prophet (ﷺ) said:  'Who has something with him?' A Jewish man said: 'I have such and such, and he named it, and I think he said three hundred Dinar for such and such 'an amount (of produce) from the garden of the tribe of Banu so-and-so.' The Messenger of Allah (ﷺ) said: 'For such and such a price at such and such a time, but not from the garden of the tribe of Banu so-and- so.\"'"}},{"id":146,"idInBook":146,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، وَعَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، قَالاَ حَدَّثَنَا شُعْبَةُ، - قَالَ يَحْيَى عَنْ عَبْدِ اللَّهِ بْنِ أَبِي الْمُجَالِدِ، وَقَالَ عَبْدُ الرَّحْمَنِ، عَنِ ابْنِ أَبِي الْمُجَالِدِ، - قَالَ امْتَرَى عَبْدُ اللَّهِ بْنُ شَدَّادٍ وَأَبُو بُرْدَةَ فِي السَّلَمِ فَأَرْسَلُونِي إِلَى عَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى فَسَأَلْتُهُ فَقَالَ كُنَّا نُسْلِمُ عَلَى عَهْدِ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ وَعَهْدِ أَبِي بَكْرٍ وَعُمَرَ فِي الْحِنْطَةِ وَالشَّعِيرِ وَالزَّبِيبِ وَالتَّمْرِ عِنْدَ قَوْمٍ مَا عِنْدَهُمْ ‏.‏ \n فَسَأَلْتُ ابْنَ أَبْزَى فَقَالَ مِثْلَ ذَلِكَ ‏.‏","english":{"narrator":"It was narrated that Abu Mujalid said:","text":"\"Abdullah bin Shaddad and Abu Barzah had a dispute about paying in advance. They sent me to 'Abdullah bin Abu Awfa to ask him about it. He said: 'We used to make payments in advance at the time of the Messenger of Allah (ﷺ) and the time of Abu Bakr and 'Umar, for wheat, barley, raisins and dates, to people who did not yet possess those things.' I asked Ibn Abza, and he said something similar.\""}},{"id":147,"idInBook":147,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا شُجَاعُ بْنُ الْوَلِيدِ، حَدَّثَنَا زِيَادُ بْنُ خَيْثَمَةَ، عَنْ سَعْدٍ، عَنْ عَطِيَّةَ، عَنْ أَبِي سَعِيدٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ إِذَا أَسْلَفْتَ فِي شَىْءٍ فَلاَ تَصْرِفْهُ إِلَى غَيْرِهِ ‏\"‏ ‏.‏ \n حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ، حَدَّثَنَا شُجَاعُ بْنُ الْوَلِيدِ، عَنْ زِيَادِ بْنِ خَيْثَمَةَ، عَنْ عَطِيَّةَ، عَنْ أَبِي سَعِيدٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ فَذَكَرَ مِثْلَهُ وَلَمْ يَذْكُرْ سَعْدًا ‏.‏","english":{"narrator":"It was narrated from Abu Sa'eed that the Messenger of Allah (ﷺ) said:","text":"\"When you have paid in advance for something, do not exchange it for something else.\" (Da'if)Another chain with similar wording."}},{"id":148,"idInBook":148,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ أَبِي إِسْحَاقَ، عَنِ النَّجْرَانِيِّ، قَالَ قُلْتُ لِعَبْدِ اللَّهِ بْنِ عُمَرَ أُسْلِمُ فِي نَخْلٍ قَبْلَ أَنْ يُطْلِعَ قَالَ لاَ ‏.‏ قُلْتُ لِمَ قَالَ إِنَّ رَجُلاً أَسْلَمَ فِي حَدِيقَةِ نَخْلٍ فِي عَهْدِ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ قَبْلَ أَنْ يُطْلِعَ النَّخْلُ فَلَمْ يُطْلِعِ النَّخْلُ شَيْئًا ذَلِكَ الْعَامَ فَقَالَ الْمُشْتَرِي هُوَ لِي حَتَّى يُطْلِعَ ‏.‏ وَقَالَ الْبَائِعُ إِنَّمَا بِعْتُكَ النَّخْلَ هَذِهِ السَّنَةَ ‏.‏ فَاخْتَصَمَا إِلَى رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ فَقَالَ لِلْبَائِعِ ‏\"‏ أَخَذَ مِنْ نَخْلِكَ شَيْئًا ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ فَبِمَ تَسْتَحِلُّ مَالَهُ ارْدُدْ عَلَيْهِ مَا أَخَذْتَ مِنْهُ وَلاَ تُسْلِمُوا فِي نَخْلٍ حَتَّى يَبْدُوَ صَلاَحُهُ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated that Najrani said:","text":"\"I said to 'Abdullah bin 'Umar: 'Can I pay in advance for a date palm before it bears fruit?' He said: 'No.' I said: 'Why not?' He said: 'A man paid in advance for a grove of trees during the time of the Messenger of Allah (ﷺ), before they had produced any fruit, and they did not bear anything that year. The purchaser said: 'They belong to me until they produce but the seller said: 'I only sold the trees to you for this year! They referred their dispute to the Messenger of Allah who said to the seller: 'Did he take anything from your date palms?' He said: 'No.' He said: 'Then why do you regard his wealth as lawful for You? Give back what you took from him, and do not take payment in advance for date palms until their usefulness appears.\"'"}},{"id":149,"idInBook":149,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا مُسْلِمُ بْنُ خَالِدٍ، حَدَّثَنَا زَيْدُ بْنُ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي رَافِعٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ اسْتَسْلَفَ مِنْ رَجُلٍ بَكْرًا وَقَالَ ‏\"‏ إِذَا جَاءَتْ إِبِلُ الصَّدَقَةِ قَضَيْنَاكَ ‏\"‏ ‏.‏ فَلَمَّا قَدِمَتْ قَالَ ‏\"‏ يَا أَبَا رَافِعٍ اقْضِ هَذَا الرَّجُلَ بَكْرَهُ ‏\"‏ ‏.‏ فَلَمْ أَجِدْ إِلاَّ رَبَاعِيًا فَصَاعِدًا فَأَخْبَرْتُ النَّبِيَّ ـ صلى الله عليه وسلم ـ فَقَالَ ‏\"‏ أَعْطِهِ فَإِنَّ خَيْرَ النَّاسِ أَحْسَنُهُمْ قَضَاءً ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from Abu Rafi' that:","text":"the Prophet (ﷺ) asked a man to give as a loan a young camel and said: “When the camels of the Sadaqah come, we will pay you back.” When the camels came, he said: \" O Abu Rafi', pay this man back for his Young camel.\" But all I could find was a seven-year-old camel or that which is better. I told the Prophet  (ﷺ) and he said: \"Give it to him, for the best of People are those who are best in repaying.\""}},{"id":150,"idInBook":150,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ، حَدَّثَنَا مُعَاوِيَةُ بْنُ صَالِحٍ، حَدَّثَنِي سَعِيدُ بْنُ هَانِئٍ، قَالَ سَمِعْتُ الْعِرْبَاضَ بْنَ سَارِيَةَ، يَقُولُ كُنْتُ عِنْدَ النَّبِيِّ ـ صلى الله عليه وسلم ـ فَقَالَ أَعْرَابِيٌّ اقْضِنِي بَكْرِي ‏.‏ فَأَعْطَاهُ بَعِيرًا مُسِنًّا فَقَالَ الأَعْرَابِيُّ يَا رَسُولَ اللَّهِ هَذَا أَسَنُّ مِنْ بَعِيرِي ‏.‏ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ خَيْرُ النَّاسِ خَيْرُهُمْ قَضَاءً ‏\"‏ ‏.‏","english":{"narrator":"Sa'eed bin Hani' said:","text":"\"I heard 'Irbad bin Sariyah say: 'I was with the Prophet (ﷺ) and a Bedouin said: \"Pay me back for my young camel, and he gave him an older (i.e., better) camel.\" He said: 'O Messenger of Allah! It is older (i.e., better) than my camel.' The Messenger of Allah (ﷺ) said: 'The best of people are those who are best in repaying.\"'"}},{"id":151,"idInBook":151,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا عُثْمَانُ، وَأَبُو بَكْرٍ ابْنَا أَبِي شَيْبَةَ قَالاَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنْ سُفْيَانَ، عَنْ إِبْرَاهِيمَ بْنِ مُهَاجِرٍ، عَنْ مُجَاهِدٍ، عَنْ قَائِدِ السَّائِبِ، عَنِ السَّائِبِ، قَالَ لِلنَّبِيِّ ـ صلى الله عليه وسلم ـ كُنْتَ شَرِيكِي فِي الْجَاهِلِيَّةِ فَكُنْتَ خَيْرَ شَرِيكٍ كُنْتَ لاَ تُدَارِينِي وَكُنْتَ لاَ تُمَارِينِي ‏.‏","english":{"narrator":"It was narrated that Sa'ib said to the Prophet (ﷺ):","text":"\"You were my partner during the Ignorance period and you were the best of partners, you did not contend or dispute.\""}},{"id":152,"idInBook":152,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا أَبُو السَّائِبِ، سَلْمُ بْنُ جُنَادَةَ حَدَّثَنَا أَبُو دَاوُدَ الْحَفَرِيُّ، عَنْ سُفْيَانَ، عَنْ أَبِي إِسْحَاقَ، عَنْ أَبِي عُبَيْدَةَ، عَنْ عَبْدِ اللَّهِ، قَالَ اشْتَرَكْتُ أَنَا وَسَعْدٌ، وَعَمَّارٌ، يَوْمَ بَدْرٍ فِيمَا نُصِيبُ فَلَمْ أَجِئْ أَنَا وَلاَ عَمَّارٌ بِشَىْءٍ وَجَاءَ سَعْدٌ بِرَجُلَيْنِ ‏.‏","english":{"narrator":"It was narrated that 'Abdullah said:","text":"\"Sa'd, 'Ammar and I entered into a partnership on the day of Badr, (agreeing to share) whatever was allotted to us. 'Ammar and I did not get anything, but Sa'd got two men (slaves).\""}},{"id":153,"idInBook":153,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلاَّلُ، حَدَّثَنَا بِشْرُ بْنُ ثَابِتٍ الْبَزَّارُ، حَدَّثَنَا نَصْرُ بْنُ الْقَاسِمِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ دَاوُدَ، عَنْ صَالِحِ بْنِ صُهَيْبٍ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ ثَلاَثٌ فِيهِنَّ الْبَرَكَةُ الْبَيْعُ إِلَى أَجَلٍ وَالْمُقَارَضَةُ وَإِخْلاَطُ الْبُرِّ بِالشَّعِيرِ لِلْبَيْتِ لاَ لِلْبَيْعِ ‏\"‏ ‏.‏","english":{"narrator":"lt was narrated from Salih bin Suhaib that his father said:","text":"\"The Messenger of Allah (ﷺ) said: 'There are three things in which there is blessing: A sale with deferred payment; Muqaradhah (profit sharing); and mixing wheat with barley for one's house, but not for sale.\"'"}},{"id":154,"idInBook":154,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ، عَنِ الأَعْمَشِ، عَنْ عُمَارَةَ بْنِ عُمَيْرٍ، عَنْ عَمَّتِهِ، عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ إِنَّ أَطْيَبَ مَا أَكَلْتُمْ مِنْ كَسْبِكُمْ وَإِنَّ أَوْلاَدَكُمْ مِنْ كَسْبِكُمْ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from 'Aishah that the Messenger of Allah (ﷺ) said:","text":"\"The best of your provision is what you earn, and your children are part of what you earn. \""}},{"id":155,"idInBook":155,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ، حَدَّثَنَا يُوسُفُ بْنُ إِسْحَاقَ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَجُلاً، قَالَ يَا رَسُولَ اللَّهِ إِنَّ لِي مَالاً وَوَلَدًا وَإِنَّ أَبِي يُرِيدُ أَنْ يَجْتَاحَ مَالِي فَقَالَ ‏\n\"‏ أَنْتَ وَمَالُكَ لأَبِيكَ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from Jabir bin 'Abdullah that a man said:","text":"\"O Messenger of Allah, I have wealth and a son, and my father wants to take all my wealth.\" He said: \"You and your wealth belong to your father.\""}},{"id":156,"idInBook":156,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، وَيَحْيَى بْنُ حَكِيمٍ، قَالاَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَنْبَأَنَا حَجَّاجٌ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ ـ صلى الله عليه وسلم ـ فَقَالَ إِنَّ أَبِي اجْتَاحَ مَالِي ‏.‏ فَقَالَ ‏\"‏ أَنْتَ وَمَالُكَ لأَبِيكَ ‏\"‏ ‏.‏ وَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ إِنَّ أَوْلاَدَكُمْ مِنْ أَطْيَبِ كَسْبِكُمْ فَكُلُوا مِنْ أَمْوَالِهِمْ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from 'Amr bin Shu'aib, from his father, that his grandfather said:","text":"\"A man came to the Messenger of Allah (ﷺ), and said: 'My father is taking all my wealth.' He said: 'You and your wealth belong to your father.' And the Messenger of Allah (ﷺ) said: 'Your children are among the best of your earnings, so eat from your wealth.’”"}},{"id":157,"idInBook":157,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، وَأَبُو عُمَرَ الضَّرِيرُ قَالُوا حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ جَاءَتْ هِنْدٌ إِلَى النَّبِيِّ ـ صلى الله عليه وسلم ـ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ أَبَا سُفْيَانَ رَجُلٌ شَحِيحٌ وَلاَ يُعْطِينِي مَا يَكْفِينِي وَوَلَدِي إِلاَّ مَا أَخَذْتُ مِنْ مَالِهِ وَهُوَ لاَ يَعْلَمُ ‏.‏ فَقَالَ ‏\n\"‏ خُذِي مَا يَكْفِيكِ وَوَلَدَكِ بِالْمَعْرُوفِ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated that 'Aishah said:","text":"'Hind came to the Prophet (ﷺ) and said: 'O Messenger of Allah, Abu Sufyan is a stingy man and he does not give me enough for me and my child, except for what I take from his wealth without him realizing.' He said: Take what is sufficient for you and your child, on a reasonable basis.' \""}},{"id":158,"idInBook":158,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي وَأَبُو مُعَاوِيَةَ عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ إِذَا أَنْفَقَتِ الْمَرْأَةُ - وَقَالَ أَبِي فِي حَدِيثِهِ إِذَا أَطْعَمَتِ الْمَرْأَةُ - مِنْ بَيْتِ زَوْجِهَا غَيْرَ مُفْسِدَةٍ كَانَ لَهَا أَجْرُهَا وَلَهُ مِثْلُهُ بِمَا اكْتَسَبَ وَلَهَا بِمَا أَنْفَقَتْ وَلِلْخَازِنِ مِثْلُ ذَلِكَ مِنْ غَيْرِ أَنْ يَنْقُصَ مِنْ أُجُوِرِهِمْ شَيْئًا ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from 'Aishah that the Messenger of Allah (ﷺ) said:","text":"\"When a woman spends\" and my father said: - \"When a woman feeds (the poor) from her husband's house, without spending too much, she will have her reward, and he will be rewarded likewise because he earned it , and she will be rewarded for what she spent. The same applies to the storekeeper, without anything being detracted from their rewards.”"}},{"id":159,"idInBook":159,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ، حَدَّثَنِي شُرَحْبِيلُ بْنُ مُسْلِمٍ الْخَوْلاَنِيُّ، قَالَ سَمِعْتُ أَبَا أُمَامَةَ الْبَاهِلِيَّ، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\"‏ لاَ تُنْفِقُ الْمَرْأَةُ مِنْ بَيْتِهَا شَيْئًا إِلاَّ بِإِذْنِ زَوْجِهَا ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ وَلاَ الطَّعَامَ قَالَ ‏\"‏ ذَلِكَ أَفْضَلُ أَمْوَالِنَا ‏\"‏ ‏.‏","english":{"narrator":"Shurahbil bin Muslim Al-Khawlani said:","text":"I heard Abu Umamah Al-Bahili say: I heard the Messenger of Allah (ﷺ) say: \" No woman should spend anything from her house without her husband's permission.\" They said: \"O Messenger of Allah, not even food?\" He said: \"That is among the best of our wealth.\""}},{"id":160,"idInBook":160,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، حَدَّثَنَا سُفْيَانُ، ح وَحَدَّثَنَا عَمْرُو بْنُ رَافِعٍ، حَدَّثَنَا جَرِيرٌ، عَنْ مُسْلِمٍ الْمُلاَئِيِّ، سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَقُولُ كَانَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ يُجِيبُ دَعْوَةَ الْمَمْلُوكِ ‏.‏","english":{"narrator":"It was narrated from Muslim Al-Mula'i that he heard Anas bin Malik say:","text":"\"The Messenger of Allah (ﷺ) used to accept the invitation of a slave.\""}},{"id":161,"idInBook":161,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، عَنْ مُحَمَّدِ بْنِ زَيْدٍ، عَنْ عُمَيْرٍ، - مَوْلَى آبِي اللَّحْمِ - قَالَ كَانَ مَوْلاَىَ يُعْطِينِي الشَّىْءَ فَأُطْعِمُ مِنْهُ فَمَنَعَنِي - أَوْ قَالَ فَضَرَبَنِي - فَسَأَلْتُ النَّبِيَّ ـ صلى الله عليه وسلم ـ أَوْ سَأَلَهُ فَقُلْتُ لاَ أَنْتَهِي أَوْ لاَ أَدَعُهُ ‏.‏ فَقَالَ ‏\n\"‏ الأَجْرُ بَيْنَكُمَا ‏\"‏ ‏.‏","english":{"narrator":"It was narrated that 'Umair, the freed slave of Aabi Lahm, said:","text":"\"My master used to give me food and I would feed others from it, then he stopped me,\" or he said: \"He beat me. So I asked the Prophet,” -or- \"he asked him and I said: 'I will not stop.' He said: 'Both of you will be rewarded.\"'"}},{"id":162,"idInBook":162,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا شَبَابَةُ بْنُ سَوَّارٍ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، وَمُحَمَّدُ بْنُ الْوَلِيدِ، قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي بِشْرٍ، جَعْفَرِ بْنِ إِيَاسٍ قَالَ سَمِعْتُ عَبَّادَ بْنَ شُرَحْبِيلَ، - رَجُلاً مِنْ بَنِي غُبَرَ - قَالَ أَصَابَنَا عَامُ مَخْمَصَةٍ فَأَتَيْتُ الْمَدِينَةَ فَأَتَيْتُ حَائِطًا مِنْ حِيطَانِهَا فَأَخَذْتُ سُنْبُلاً فَفَرَكْتُهُ وَأَكَلْتُهُ وَجَعَلْتُهُ فِي كِسَائِي فَجَاءَ صَاحِبُ الْحَائِطِ فَضَرَبَنِي وَأَخَذَ ثَوْبِي فَأَتَيْتُ النَّبِيَّ ـ صلى الله عليه وسلم ـ فَأَخْبَرْتُهُ فَقَالَ لِلرَّجُلِ ‏\n\"‏ مَا أَطْعَمْتَهُ إِذْ كَانَ جَائِعًا أَوْ سَاغِبًا وَلاَ عَلَّمْتَهُ إِذْ كَانَ جَاهِلاً ‏\"‏ ‏.‏ فَأَمَرَهُ النَّبِيُّ ـ صلى الله عليه وسلم ـ فَرَدَّ إِلَيْهِ ثَوْبَهُ وَأَمَرَ لَهُ بِوَسْقٍ مِنْ طَعَامٍ أَوْ نِصْفِ وَسْقٍ ‏.‏","english":{"narrator":"It was narrated that Abu Bishr Ja'far bin Abu Jyas said:","text":"“I heard 'Abbad bin Shurahbil, a man from Banu Ghubar, say: ‘We suffered a year of famine, and I came to Al-Madinah. I came to one of its gardens and took an ear of corn, I rubbed it, ate some and put the rest in my garment. The owner of the garden came and beat me and took my garment. I came to the Prophet (ﷺ) and told him (what had happened). He said to the man: \"You did not feed him when he was hungry and you did not teach him when he was ignorant.\"' Then the Prophet (ﷺ) told him to give back his garment and ordered that a Wasq or half a Wasq of food be brought to him.\""}},{"id":163,"idInBook":163,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، وَيَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ، قَالاَ حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ، قَالَ سَمِعْتُ ابْنَ أَبِي الْحَكَمِ الْغِفَارِيَّ، قَالَ حَدَّثَتْنِي جَدَّتِي، عَنْ عَمِّ، أَبِيهَا رَافِعِ بْنِ عَمْرٍو الْغِفَارِيِّ قَالَ كُنْتُ وَأَنَا غُلاَمٌ، أَرْمِي نَخْلَنَا - أَوْ قَالَ نَخْلَ الأَنْصَارِ - فَأُتِيَ بِيَ النَّبِيَّ ـ صلى الله عليه وسلم ـ فَقَالَ ‏\"‏ يَا غُلاَمُ - وَقَالَ ابْنُ كَاسِبٍ فَقَالَ يَا بُنَىَّ - لِمَ تَرْمِي النَّخْلَ ‏\"‏ ‏.‏ قَالَ قُلْتُ آكُلُ ‏.‏ قَالَ ‏\"‏ فَلاَ تَرْمِي النَّخْلَ وَكُلْ مِمَّا يَسْقُطُ فِي أَسَافِلِهَا ‏\"‏ ‏.‏ قَالَ ثُمَّ مَسَحَ رَأْسِي وَقَالَ ‏\"‏ اللَّهُمَّ أَشْبِعْ بَطْنَهُ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated that Rafi' bin 'Amr Al-Ghifari said:","text":"\"When I was a boy, I used to throw stones at our date-palm trees\" - or he said: \"the date-palm trees of the Ansar.\" I was brought to the Prophet (ﷺ) and he said: 'O boy' - (one of the narrators) Ibn Kasib said: He said: 'O my son - why are you throwing stones at the date-palm trees?' I said: 'So I can eat.' He said: 'Do not throw stones at the date-palm trees. Eat from what falls to the ground from them.' Then he patted me on the head and said: 'O Allah give him enough to eat.'”"}},{"id":164,"idInBook":164,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَنْبَأَنَا الْجُرَيْرِيُّ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ إِذَا أَتَيْتَ عَلَى رَاعٍ فَنَادِهِ ثَلاَثَ مِرَارٍ فَإِنْ أَجَابَكَ وَإِلاَّ فَاشْرَبْ فِي غَيْرِ أَنْ تُفْسِدَ وَإِذَا أَتَيْتَ عَلَى حَائِطِ بُسْتَانٍ فَنَادِ صَاحِبَ الْبُسْتَانِ ثَلاَثَ مَرَّاتٍ فَإِنْ أَجَابَكَ وَإِلاَّ فَكُلْ فِي أَنْ لاَ تُفْسِدَ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from Abu Sa'eed that the Prophet (ﷺ) said:","text":"\"When you come to a shepherd, call him three times. If he answers (all well and good), otherwise drink (milk from the flock) without taking advantage. And when you come to a garden call the owner of the garden three times. If he answers (all well and good), otherwise eat (from the produce of the garden) without taking advantage.\""}},{"id":165,"idInBook":165,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا هَدِيَّةُ بْنُ عَبْدِ الْوَهَّابِ، وَأَيُّوبُ بْنُ حَسَّانَ الْوَاسِطِيُّ، وَعَلِيُّ بْنُ سَلَمَةَ، قَالُوا حَدَّثَنَا يَحْيَى بْنُ سُلَيْمٍ الطَّائِفِيُّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ إِذَا مَرَّ أَحَدُكُمْ بِحَائِطٍ فَلْيَأْكُلْ وَلاَ يَتَّخِذْ خُبْنَةً ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from Ibn 'Umar that the Messenger of Allah (ﷺ) said:","text":"\"When anyone of you passes by a garden let him eat therefrom, but he should not carry any away in his garment.\"'"}},{"id":166,"idInBook":166,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، قَالَ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ أَنَّهُ قَامَ فَقَالَ ‏\n\"‏ لاَ يَحْتَلِبَنَّ أَحَدُكُمْ مَاشِيَةَ رَجُلٍ بِغَيْرِ إِذْنِهِ أَيُحِبُّ أَحَدُكُمْ أَنْ تُؤْتَى مَشْرُبَتُهُ فَيُكْسَرَ بَابُ خِزَانَتِهِ فَيُنْتَثَلَ طَعَامُهُ فَإِنَّمَا تَخْزُنُ لَهُمْ ضُرُوعُ مَوَاشِيهِمْ أَطْعِمَاتِهِمْ فَلاَ يَحْتَلِبَنَّ أَحَدُكُمْ مَاشِيَةَ امْرِئٍ بِغَيْرِ إِذْنِهِ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from 'Abdullah bin 'Umar that the Messenger of Allah (ﷺ) stood up and said:","text":"\"No one of you should milk from the livestock of another man without his permission. Would anyone of you like someone to break into his storeroom and take his food? The udders of their livestock store food for them, so none of you should milk the livestock of another man without his permission.\""}},{"id":167,"idInBook":167,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ بْنُ بِشْرِ بْنِ مَنْصُورٍ، حَدَّثَنَا عُمَرُ بْنُ عَلِيٍّ، عَنْ حَجَّاجٍ، عَنْ سَلِيطِ بْنِ عَبْدِ اللَّهِ الطُّهَوِيِّ، عَنْ ذُهَيْلِ بْنِ عَوْفِ بْنِ شَمَّاخٍ الطُّهَوِيِّ، حَدَّثَنَا أَبُو هُرَيْرَةَ، قَالَ بَيْنَمَا نَحْنُ مَعَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ فِي سَفَرٍ إِذْ رَأَيْنَا إِبِلاً مَصْرُورَةً بِعِضَاهِ الشَّجَرِ فَثُبْنَا إِلَيْهَا فَنَادَانَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ فَرَجَعْنَا إِلَيْهِ فَقَالَ ‏\"‏ إِنَّ هَذِهِ الإِبِلَ لأَهْلِ بَيْتٍ مِنَ الْمُسْلِمِينَ هُوَ قُوتُهُمْ وَيُمْنُهُمْ بَعْدَ اللَّهِ أَيَسُرُّكُمْ لَوْ رَجَعْتُمْ إِلَى مَزَاوِدِكُمْ فَوَجَدْتُمْ مَا فِيهَا قَدْ ذُهِبَ بِهِ أَتُرَوْنَ ذَلِكَ عَدْلاً ‏\"‏ ‏.‏ قَالُوا لاَ ‏.‏ قَالَ ‏\"‏ فَإِنَّ هَذَا كَذَلِكَ ‏\"‏ ‏.‏ قُلْنَا أَفَرَأَيْتَ إِنِ احْتَجْنَا إِلَى الطَّعَامِ وَالشَّرَابِ فَقَالَ ‏\"‏ كُلْ وَلاَ تَحْمِلْ وَاشْرَبْ وَلاَ تَحْمِلْ ‏\"‏ ‏.‏","english":{"narrator":"Abu Hurairah said:","text":"“While we were with the Messenger of Allah (ﷺ) on a journey, we saw some camels with their udders tied, among some thorny trees. We rushed towards it, but the Messenger of Allah (ﷺ) called us and we came back to him. He said: 'These camels belong to a family of Muslims, and this is their support (and blessing) after Allah. Would you be happy if you went back to your vessels and found that what was in them had been taken away? Do you think that is fair?' They said: 'No.' He said: 'This is like that.' We said: 'What do you think if we are in need of food and drink?' He said: 'Eat but do not carry any away: drink but do not carry any away.\"'"}},{"id":168,"idInBook":168,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ أُمِّ هَانِئٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ لَهَا ‏\n\"‏ اتَّخِذِي غَنَمًا فَإِنَّ فِيهَا بَرَكَةً ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from Umm Hani' that the Prophet (ﷺ) said to her:","text":"\"Keep sheep, for in them is blessing!'"}},{"id":169,"idInBook":169,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، عَنْ حُصَيْنٍ، عَنْ عَامِرٍ، عَنْ عُرْوَةَ الْبَارِقِيِّ، يَرْفَعُهُ قَالَ ‏\n\"‏ الإِبِلُ عِزٌّ لأَهْلِهَا وَالْغَنَمُ بَرَكَةٌ وَالْخَيْرُ مَعْقُودٌ فِي نَوَاصِي الْخَيْلِ إِلَى يَوْمِ الْقِيَامَةِ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated that 'Urwah Al-Bariqi said in a Marfu’ report:","text":"\"Camels are the pride of their owners, and sheep are a blessing, and goodness is tied to the forelocks of horses until the Day of Resurrection.\""}},{"id":170,"idInBook":170,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا عِصْمَةُ بْنُ الْفَضْلِ النَّيْسَابُورِيُّ، وَمُحَمَّدُ بْنُ فِرَاسٍ أَبُو هُرَيْرَةَ الصَّيْرَفِيُّ، قَالاَ حَدَّثَنَا حَرَمِيُّ بْنُ عُمَارَةَ، حَدَّثَنَا زَرْبِيٌّ، إِمَامُ مَسْجِدِ هِشَامِ بْنِ حَسَّانَ حَدَّثَنَا مُحَمَّدُ بْنُ سِيرِينَ، عَنِ ابْنِ عُمَرَ، رضى الله عنه قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ الشَّاةُ مِنْ دَوَابِّ الْجَنَّةِ ‏\"‏ ‏.‏","english":{"narrator":"It was narrated from Ibn 'Umar that the Messenger of Allah (ﷺ) said:","text":"\"Sheep are among the animals of Paradise.\"'"}},{"id":171,"idInBook":171,"chapterId":12,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عُثْمَانُ بْنُ عَبْدِ الرَّحْمَنِ، حَدَّثَنَا عَلِيُّ بْنُ عُرْوَةَ، عَنِ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، رضى الله عنه قَالَ أَمَرَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ الأَغْنِيَاءَ بِاتِّخَاذِ الْغَنَمِ وَأَمَرَ الْفُقَرَاءَ بِاتِّخَاذِ الدَّجَاجِ وَقَالَ ‏\n\"‏ عِنْدَ اتِّخَاذِ الأَغْنِيَاءِ الدَّجَاجَ يَأْذَنُ اللَّهُ بِهَلاَكِ الْقُرَى ‏\"‏ ‏.‏","english":{"narrator":"It was narrated that Abu Hurairah said:","text":"\"The  Messenger of Allah (ﷺ) commanded the rich to keep sheep, and he commanded the poor to keep chickens, and he said: 'When the rich keep chickens, then Allah will give permission for the town to be destroyed.\"'"}}],"chapter":{"id":12,"bookId":6,"arabic":"كتاب التجارات","english":"The Chapters on Business Transactions"}}