{"metadata":{"length":238,"arabic":{"title":"سنن ابن ماجه","author":"الإمام محمد بن يزيد بن ماجه القزويني","introduction":"كتاب المناسك"},"english":{"title":"Sunan Ibn Majah","author":"Imam Muhammad ibn Yazid Ibn Majah al-Qazwini","introduction":"Chapters on Hajj Rituals"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، وَأَبُو مُصْعَبٍ الزُّهْرِيُّ وَسُوَيْدُ بْنُ سَعِيدٍ قَالُوا حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، عَنْ سُمَىٍّ، مَوْلَى أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي صَالِحٍ السَّمَّانِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ السَّفَرُ قِطْعَةٌ مِنَ الْعَذَابِ يَمْنَعُ أَحَدَكُمْ نَوْمَهُ وَطَعَامَهُ وَشَرَابَهُ فَإِذَا قَضَى أَحَدُكُمْ نَهْمَتَهُ مِنْ سَفَرِهِ فَلْيُعَجِّلِ الرُّجُوعَ إِلَى أَهْلِهِ ‏\"‏ ‏.‏     \n حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِنَحْوِهِ ‏.‏","english":{"narrator":"It was\nnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)\nsaid:","text":"“Traveling is a kind of torment, it keeps anyone of you from his\nsleep, food and drink. When anyone of you has fulfilled the purpose\nfor which he travled, let him hasten to return to his family.”\n\nAnother chain reports a similar hadith."}},{"id":2,"idInBook":2,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، وَعَمْرُو بْنُ عَبْدِ اللَّهِ، قَالاَ حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا إِسْمَاعِيلُ أَبُو إِسْرَائِيلَ، عَنْ فُضَيْلِ بْنِ عَمْرٍو، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، عَنِ الْفَضْلِ، - أَوْ أَحَدِهِمَا عَنِ الآخَرِ، - قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ أَرَادَ الْحَجَّ فَلْيَتَعَجَّلْ فَإِنَّهُ قَدْ يَمْرَضُ الْمَرِيضُ وَتَضِلُّ الضَّالَّةُ وَتَعْرِضُ الْحَاجَةُ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Ibn ‘Abbas that Fadl said – or vice verse:","text":"“The\nMessenger of Allah (ﷺ) said: ‘Whoever intends to perform Hajj,\nlet\nhim hasten to do so, for he may fall sick, lose his mount, or be\nfaced\nwith some need.’”"}},{"id":3,"idInBook":3,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا مَنْصُورُ بْنُ وَرْدَانَ، حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ الأَعْلَى، عَنْ أَبِيهِ، عَنْ أَبِي الْبَخْتَرِيِّ، عَنْ عَلِيٍّ، قَالَ لَمَّا نَزَلَتْ ‏{‏وَلِلَّهِ عَلَى النَّاسِ حِجُّ الْبَيْتِ مَنِ اسْتَطَاعَ إِلَيْهِ سَبِيلاً‏}‏‏.‏ قَالُوا يَا رَسُولَ اللَّهِ الْحَجُّ فِي كُلِّ عَامٍ فَسَكَتَ ثُمَّ قَالُوا أَفِي كُلِّ عَامٍ فَقَالَ ‏\"‏ لاَ وَلَوْ قُلْتُ نَعَمْ لَوَجَبَتْ ‏\"‏ ‏.‏ فَنَزَلَتْ ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا لاَ تَسْأَلُوا عَنْ أَشْيَاءَ إِنْ تُبْدَ لَكُمْ تَسُؤْكُمْ ‏}‏‏.‏","english":{"narrator":"It was\nnarrated that ‘Ali said:","text":"“When the following was revealed:\n“And\nHajj (pilgrimage to Makkah) to the House (Ka’bah) is a duty that\nmankind owes to Allah, for whoever can bear the way.”  They\nasked: ‘O Messenger of Allah, is Hajj every year?’ He remained\nsilent.\nThey asked: ‘Is it every year?’ He said: ‘No. If I had\nsaid yes, it\nwould have become obligatory.’ Then the following was\nrevealed: “O you\nwho believe! Ask not about things which, if made\nplain to you, may\ncause you trouble.’” "}},{"id":4,"idInBook":4,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُبَيْدَةَ، عَنْ أَبِيهِ، عَنِ الأَعْمَشِ، عَنْ أَبِي سُفْيَانَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَالُوا يَا رَسُولَ اللَّهِ الْحَجُّ فِي كُلِّ عَامٍ قَالَ ‏\n\"‏ لَوْ قُلْتُ نَعَمْ لَوَجَبَتْ وَلَوْ وَجَبَتْ لَمْ تَقُومُوا بِهَا وَلَوْ لَمْ تَقُومُوا بِهَا عُذِّبْتُمْ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Anas bin Malik said:","text":"“They said: ‘O Messenger of\nAllah, is Hajj (required) every year?’ He said: ‘If I were to say\nyes,\nit would have become obligatory, and if it were to become\nobligatory,\nyou would not (be able to) do it, and if you did not do\nit you would\nbe punished.’”"}},{"id":5,"idInBook":5,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَنْبَأَنَا سُفْيَانُ بْنُ حُسَيْنٍ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سِنَانٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ الأَقْرَعَ بْنَ حَابِسٍ، سَأَلَ النَّبِيَّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ الْحَجُّ فِي كُلِّ سَنَةٍ أَوْ مَرَّةً وَاحِدَةً قَالَ ‏\n\"‏ بَلْ مَرَّةً وَاحِدَةً فَمَنِ اسْتَطَاعَ فَتَطَوُّعٌ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Ibn ‘Abbas that Aqra’ bin Habis asked the\nProphet\n(ﷺ):","text":"“O Messenger of Allah, is Hajj (required) every year,\nor\njust once” He said: “Rather it is just once. And whoever can\nperform Hajj voluntarily, let him do so.”"}},{"id":6,"idInBook":6,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَاصِمِ بْنِ عُبَيْدِ اللَّهِ، عَنْ عَبْدِ اللَّهِ بْنِ عَامِرٍ، عَنْ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ تَابِعُوا بَيْنَ الْحَجِّ وَالْعُمْرَةِ فَإِنَّ الْمُتَابَعَةَ بَيْنَهُمَا تَنْفِي الْفَقْرَ وَالذُّنُوبَ كَمَا يَنْفِي الْكِيرُ خَبَثَ الْحَدِيدِ ‏\"‏ ‏.‏     \n حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ، عَنْ عَاصِمِ بْنِ عُبَيْدِ اللَّهِ، عَنْ عَبْدِ اللَّهِ بْنِ عَامِرِ بْنِ رَبِيعَةَ، عَنْ أَبِيهِ، عَنْ عُمَرَ بْنِ الْخَطَّابِ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ نَحْوَهُ ‏.‏","english":{"narrator":"It was\nnarrated from ‘Umar that the Prophet (ﷺ) said:","text":"“Perform Hajj\nand ‘Umrah, one after the other, for performing them one after the\nother removes poverty and sin as the bellows removes impurity from\niron.”\n\nAnother chain reports a similar hadith."}},{"id":7,"idInBook":7,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو مُصْعَبٍ، حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، عَنْ سُمَىٍّ، - مَوْلَى أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ - عَنْ أَبِي صَالِحٍ السَّمَّانِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ الْعُمْرَةُ إِلَى الْعُمْرَةِ كَفَّارَةُ مَا بَيْنَهُمَا وَالْحَجُّ الْمَبْرُورُ لَيْسَ لَهُ جَزَاءٌ إِلاَّ الْجَنَّةُ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Abu Hurairah that the Prophet (ﷺ) said:","text":"“From\none\n‘Umrah to another is an expiation for the sins that came in\nbetween\nthem, and Hajj Mabrur (an accepted Hajj) brings no less a\nreward than\nParadise.”"}},{"id":8,"idInBook":8,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ مِسْعَرٍ، وَسُفْيَانَ، عَنْ مَنْصُورٍ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ مَنْ حَجَّ هَذَا الْبَيْتَ فَلَمْ يَرْفُثْ وَلَمْ يَفْسُقْ رَجَعَ كَمَا وَلَدَتْهُ أُمُّهُ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)\nsaid:","text":"“Whoever performs Hajj to this House, and does not have sexual\nrelations nor commit any disobedience, will go back like the day his\nmother bore him.”"}},{"id":9,"idInBook":9,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنِ الرَّبِيعِ بْنِ صَبِيحٍ، عَنْ يَزِيدَ بْنِ أَبَانَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ حَجَّ النَّبِيُّ ـ صلى الله عليه وسلم ـ عَلَى رَحْلٍ رَثٍّ وَقَطِيفَةٍ تُسَاوِي أَرْبَعَةَ دَرَاهِمَ أَوْ لاَ تُسَاوِي ثُمَّ قَالَ ‏\n\"‏ اللَّهُمَّ حِجَّةٌ لاَ رِيَاءَ فِيهَا وَلاَ سُمْعَةَ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Anas bin Malik said:","text":"“The Prophet (ﷺ)\nperformed\nHajj on an old saddle, wearing a cloak that was worth four\nDirham or\nless. Then he said: ‘O Allah, a Hajj in which there is no\nshowing\noff nor reputation sought.’”"}},{"id":10,"idInBook":10,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بِشْرٍ، بَكْرُ بْنُ خَلَفٍ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ، عَنْ أَبِي الْعَالِيَةِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كُنَّا مَعَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ بَيْنَ مَكَّةَ وَالْمَدِينَةِ فَمَرَرْنَا بِوَادٍ فَقَالَ ‏\"‏ أَىُّ وَادٍ هَذَا ‏\"‏ ‏.‏ قَالُوا وَادِي الأَزْرَقِ ‏.‏ قَالَ ‏\"‏ كَأَنِّي أَنْظُرُ إِلَى مُوسَى ـ صلى الله عليه وسلم ـ - فَذَكَرَ مِنْ طُولِ شَعَرِهِ شَيْئًا لاَ يَحْفَظُهُ دَاوُدُ - وَاضِعًا إِصْبَعَيْهِ فِي أُذُنَيْهِ لَهُ جُؤَارٌ إِلَى اللَّهِ بِالتَّلْبِيَةِ مَارًّا بِهَذَا الْوَادِي ‏\"‏ ‏.‏ قَالَ ثُمَّ سِرْنَا حَتَّى أَتَيْنَا عَلَى ثَنِيَّةٍ فَقَالَ ‏\"‏ أَىُّ ثَنِيَّةٍ هَذِهِ ‏\"‏ ‏.‏ قَالُوا ثَنِيَّةُ هَرْشَى أَوْ لَفْتٍ ‏.‏ قَالَ ‏\"‏ كَأَنِّي أَنْظُرُ إِلَى يُونُسَ عَلَى نَاقَةٍ حَمْرَاءَ عَلَيْهِ جُبَّةُ صُوفٍ وَخِطَامُ نَاقَتِهِ خُلْبَةٌ مَارًّا بِهَذَا الْوَادِي مُلَبِّيًا ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Ibn ‘Abbas said:","text":"“We were with the Messenger of\nAllah (ﷺ) between Makkah and Al-Madinah, and we passed through a\nvalley. He said: ‘What valley is this?’ They said: ‘Azraq\nValley.’ He\nsaid: ‘It is as if I can see Musa (as) – and he\nmentioned something\nabout the length of his hair, which Dawud (one of\nthe narrators) did\nnot remember – ‘putting his fingers in his\nears and raising his voice\nto Allah reciting the Talbiyah, passing\nthrough this valley.’ Then we\ntraveled on until we came to a narrow\npass, and he said: ‘What pass is\nthis?’ They said: ‘Thaniyyat\nHarsha’ or ‘Laft.’ He said: ‘It is as if\nI can see Yunus, on\na red she-camel, wearing a woollen cloak and\nholding the reins of his\nshe-camel, woven from palm fibres, passing\nthrough this valley,\nreciting the Talbiyah.’”"}},{"id":11,"idInBook":11,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ الْحِزَامِيُّ، حَدَّثَنَا صَالِحُ بْنُ عَبْدِ اللَّهِ بْنِ صَالِحٍ، - مَوْلَى بَنِي عَامِرٍ - حَدَّثَنِي يَعْقُوبُ بْنُ يَحْيَى بْنِ عَبَّادِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، عَنْ أَبِي صَالِحٍ السَّمَّانِ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ أَنَّهُ قَالَ ‏\n\"‏ الْحُجَّاجُ وَالْعُمَّارُ وَفْدُ اللَّهِ إِنْ دَعَوْهُ أَجَابَهُمْ وَإِنِ اسْتَغْفَرُوهُ غَفَرَ لَهُمْ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)\nsaid:","text":"“The pilgrims performing Hajj and ‘Umrah are a delegation to\nAllah. If they call upon Him, He will answer them; and if they ask\nfor\nHis forgiveness, He will forgive them.”"}},{"id":12,"idInBook":12,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ طَرِيفٍ، حَدَّثَنَا عِمْرَانُ بْنُ عُيَيْنَةَ، عَنْ عَطَاءِ بْنِ السَّائِبِ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ الْغَازِي فِي سَبِيلِ اللَّهِ وَالْحَاجُّ وَالْمُعْتَمِرُ وَفْدُ اللَّهِ دَعَاهُمْ فَأَجَابُوهُ وَسَأَلُوهُ فَأَعْطَاهُمْ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Ibn ‘Umar that the Prophet (ﷺ) said:","text":"“The one\nwho\nfights in the cause of Allah, and the pilgrim performing Hajj and\n‘Umrah are a delegation to Allah. He invited them, so they\nresponded\nto Him, and they ask Him and He gives to them.”"}},{"id":13,"idInBook":13,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ عَاصِمِ بْنِ عُبَيْدِ اللَّهِ، عَنْ سَالِمٍ، عَنِ ابْنِ عُمَرَ، عَنْ عُمَرَ، أَنَّهُ اسْتَأْذَنَ النَّبِيَّ ـ صلى الله عليه وسلم ـ فِي الْعُمْرَةِ فَأَذِنَ لَهُ وَقَالَ ‏\n\"‏ يَا أُخَىَّ أَشْرِكْنَا فِي شَىْءٍ مِنْ دُعَائِكَ وَلاَ تَنْسَنَا ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Ibn ‘Umar (from ‘Umar) that he asked the Prophet\n(ﷺ) for permission to perform ‘Umrah, and he gave him permission\nand\nsaid to him:","text":"“O younger brother, give us a share of your\nsupplication,\nand do not forget us.”"}},{"id":14,"idInBook":14,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي سُلَيْمَانَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ صَفْوَانَ بْنِ عَبْدِ اللَّهِ بْنِ صَفْوَانَ، قَالَ وَكَانَتْ تَحْتَهُ ابْنَةُ أَبِي الدَّرْدَاءِ فَأَتَاهَا فَوَجَدَ أُمَّ الدَّرْدَاءِ وَلَمْ يَجِدْ أَبَا الدَّرْدَاءِ فَقَالَتْ لَهُ تُرِيدُ الْحَجَّ الْعَامَ قَالَ نَعَمْ ‏.‏ قَالَتْ فَادْعُ اللَّهَ لَنَا بِخَيْرٍ فَإِنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ كَانَ يَقُولُ ‏\n\"‏ دَعْوَةُ الْمَرْءِ مُسْتَجَابَةٌ لأَخِيهِ بِظَهْرِ الْغَيْبِ عِنْدَ رَأْسِهِ مَلَكٌ يُؤَمِّنُ عَلَى دُعَائِهِ كُلَّمَا دَعَا لَهُ بِخَيْرٍ قَالَ آمِينَ وَلَكَ بِمِثْلِهِ ‏\"‏ ‏.‏ قَالَ ثُمَّ خَرَجْتُ إِلَى السُّوقِ فَلَقِيتُ أَبَا الدَّرْدَاءِ فَحَدَّثَنِي عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ بِمِثْلِ ذَلِكَ ‏.‏","english":{"narrator":"It was\nnarrated from Safwan bin ‘Abdullah bin Safwan said that he was\nmarried to a daughter of Abu Darda’. He came to her and found Umm\nDarda’ there, but he did not find Abu Darda’. She said to him:","text":"“Do you\nintend to perform Hajj this year?” He said: “Yes.”\nShe said: “Pray to\nAllah for us to grant us goodness, for the\nProphet (ﷺ) used to say:\n‘The supplication of a man for his\nbrother in his absence will be\nanswered. By his head there is an\nangel who says Amin to his\nsupplication, and every time he prays for\nhis brother, he says: “Amin,\nand the same for you.’” He said:\n“Then I went out to the marketplace\nwhere I met Abu Darda’, and\nhe told me something similar from the\nProphet (ﷺ).”"}},{"id":15,"idInBook":15,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ، ح وَحَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، وَعَمْرُو بْنُ عَبْدِ اللَّهِ، قَالاَ حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ يَزِيدَ الْمَكِّيُّ، عَنْ مُحَمَّدِ بْنِ عَبَّادِ بْنِ جَعْفَرٍ الْمَخْزُومِيِّ، عَنِ ابْنِ عُمَرَ، قَالَ قَامَ رَجُلٌ إِلَى النَّبِيِّ ـ صلى الله عليه وسلم ـ فَقَالَ يَا رَسُولَ اللَّهِ مَا يُوجِبُ الْحَجَّ قَالَ ‏\"‏ الزَّادُ وَالرَّاحِلَةُ ‏\"‏ ‏.‏ قَالَ يَا رَسُولَ اللَّهِ فَمَا الْحَاجُّ قَالَ ‏\"‏ الشَّعِثُ التَّفِلُ ‏\"‏ ‏.‏ وَقَامَ آخَرُ فَقَالَ يَا رَسُولَ اللَّهِ وَمَا الْحَجُّ قَالَ ‏\"‏ الْعَجُّ وَالثَّجُّ ‏\"‏ ‏.‏ قَالَ وَكِيعٌ يَعْنِي بِالْعَجِّ الْعَجِيجَ بِالتَّلْبِيَةِ وَالثَّجُّ نَحْرُ الْبُدْنِ ‏.‏","english":{"narrator":"It was\nnarrated that Ibn ‘Umar said:","text":"“A man stood up and said to the\nProphet (ﷺ): ‘O Messenger of Allah! What makes Hajj obligatory?’\nHe\nsaid: ‘Provision and a mount.’ He said: ‘O Messenger of\nAllah, what is\nthe (real) Hajj?’ He said: ‘The one with\ndishevelled hair and no\nperfume.’ Another (man) stood up and said:\n‘O Messenger of Allah, what\nis the (real) Hajj?’ He said:\n‘Raising one’s voice and slaughtering\nthe sacrificial animal.’”"}},{"id":16,"idInBook":16,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا هِشَامُ بْنُ سُلَيْمَانَ الْقُرَشِيُّ، عَنِ ابْنِ جُرَيْجٍ، قَالَ وَأَخْبَرَنِيهِ أَيْضًا، عَنِ ابْنِ عَطَاءٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ الزَّادُ وَالرَّاحِلَةُ ‏\"‏ ‏.‏ يَعْنِي قَوْلَهُ ‏{‏ مَنِ اسْتَطَاعَ إِلَيْهِ سَبِيلاً ‏}‏ ‏.‏","english":{"narrator":"It was\nnarrated from Ibn ‘Abbas that the Messenger of Allah (ﷺ)\nsaid:","text":"“Provision and a mount,” meaning, about Allah’s saying:\n“Whoever\ncan bear the way.” "}},{"id":17,"idInBook":17,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا الأَعْمَشُ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي سَعِيدٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ لاَ تُسَافِرُ الْمَرْأَةُ سَفَرَ ثَلاَثَةِ أَيَّامٍ فَصَاعِدًا إِلاَّ مَعَ أَبِيهَا أَوْ أَخِيهَا أَوِ ابْنِهَا أَوْ زَوْجِهَا أَوْ ذِي مَحْرَمٍ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Abu Sa’eed that the Messenger of Allah (ﷺ)\nsaid:","text":"“No woman should travel the distance of three days or more,\nunless\nshe is with her father, brother, son, husband or a Mahram.”"}},{"id":18,"idInBook":18,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا شَبَابَةُ، عَنِ ابْنِ أَبِي ذِئْبٍ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ لاَ يَحِلُّ لاِمْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ أَنْ تُسَافِرَ مَسِيرَةَ يَوْمٍ وَاحِدٍ لَيْسَ لَهَا ذُو حُرْمَةٍ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Abu Hurairah that the Prophet (ﷺ) said:","text":"“It is\nnot\npermissible for a woman who believes in Allah and the Last Day to\ntravel for more than one day’s distance without a Mahram.”"}},{"id":19,"idInBook":19,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا شُعَيْبُ بْنُ إِسْحَاقَ، حَدَّثَنَا ابْنُ جُرَيْجٍ، حَدَّثَنِي عَمْرُو بْنُ دِينَارٍ، أَنَّهُ سَمِعَ أَبَا مَعْبَدٍ، مَوْلَى ابْنِ عَبَّاسٍ عَنِ ابْنِ عَبَّاسٍ، قَالَ جَاءَ أَعْرَابِيٌّ إِلَى النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ إِنِّي اكْتُتِبْتُ فِي غَزْوَةِ كَذَا وَكَذَا وَامْرَأَتِي حَاجَّةٌ ‏.‏ قَالَ ‏\n\"‏ فَارْجِعْ مَعَهَا ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Ibn ‘Abbas said:","text":"“A Bedouin came to the Prophet\n(ﷺ) and said: ‘I have enlisted for such and such a military\ncampaign\nand my wife is going for Hajj.’ He said: ‘Go back with\nher.’”"}},{"id":20,"idInBook":20,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، عَنْ حَبِيبِ بْنِ أَبِي عَمْرَةَ، عَنْ عَائِشَةَ بِنْتِ طَلْحَةَ، عَنْ عَائِشَةَ، قَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ عَلَى النِّسَاءِ جِهَادٌ قَالَ ‏\n\"‏ نَعَمْ عَلَيْهِنَّ جِهَادٌ لاَ قِتَالَ فِيهِ الْحَجُّ وَالْعُمْرَةُ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Aishah said:","text":"“I said: ‘O Messenger of Allah, is\nJihad obligatory for women?’ He said: “Yes: Upon them is a Jihad\nin\nwhich there is no fighting: Al-Hajj and Al-‘Umrah.”"}},{"id":21,"idInBook":21,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنِ الْقَاسِمِ بْنِ الْفَضْلِ الْحُدَّانِيِّ، عَنْ أَبِي جَعْفَرٍ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ الْحَجُّ جِهَادُ كُلِّ ضَعِيفٍ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Umm Salamah that the Messenger of Allah (ﷺ)\nsaid:","text":"“Hajj is the Jihad of every weak person.”"}},{"id":22,"idInBook":22,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، عَنْ عَزْرَةَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ سَمِعَ رَجُلاً يَقُولُ لَبَّيْكَ عَنْ شُبْرُمَةَ ‏.‏ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ مَنْ شُبْرُمَةُ ‏\"‏ ‏.‏ قَالَ قَرِيبٌ لِي ‏.‏ قَالَ ‏\"‏ هَلْ حَجَجْتَ قَطُّ ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ فَاجْعَلْ هَذِهِ عَنْ نَفْسِكَ ثُمَّ احْجُجْ عَنْ شُبْرُمَةَ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Ibn ‘Abbas that the Messenger of Allah (ﷺ)\nheard a\nman saying:","text":"“Labbaik ‘an Shubrumah (Here I am (O Allah) on\nbehalf\nof Shubrumah.” The Messenger of Allah (ﷺ) said: “Who is\nShubrumah?” He said: “A relative of mine.” He said: “Have you\never\nperformed Hajj?” He said: “No.” He said: “Then make this\nfor yourself,\nthen perform Hajj on behalf of Shubrumah.”"}},{"id":23,"idInBook":23,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى الصَّنْعَانِيُّ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَنْبَأَنَا سُفْيَانُ الثَّوْرِيُّ، عَنْ سُلَيْمَانَ الشَّيْبَانِيِّ، عَنْ يَزِيدَ بْنِ الأَصَمِّ، عَنِ ابْنِ عَبَّاسٍ، قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ ـ صلى الله عليه وسلم ـ فَقَالَ أَحُجُّ عَنْ أَبِي قَالَ ‏\n\"‏ نَعَمْ حُجَّ عَنْ أَبِيكَ فَإِنْ لَمْ تَزِدْهُ خَيْرًا لَمْ تَزِدْهُ شَرًّا ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Ibn ‘Abbas said:","text":"“A man came to the Prophet\n(ﷺ)\nand said: ‘Shall I perform Hajj on behalf of my father?’ He\nsaid:\n‘Yes, perform Hajj on behalf of your father, for if you cannot\nadd\nany good to his record (at least) you will not add anything bad.’”"}},{"id":24,"idInBook":24,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا عُثْمَانُ بْنُ عَطَاءٍ، عَنْ أَبِيهِ، عَنْ أَبِي الْغَوْثِ بْنِ حُصَيْنٍ، - رَجُلٌ مِنَ الْفُرْعِ - أَنَّهُ اسْتَفْتَى النَّبِيَّ ـ صلى الله عليه وسلم ـ عَنْ حِجَّةٍ كَانَتْ عَلَى أَبِيهِ مَاتَ وَلَمْ يَحُجَّ قَالَ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏\"‏ حُجَّ عَنْ أَبِيكَ ‏\"‏ ‏.‏ وَقَالَ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏\"‏ وَكَذَلِكَ الصِّيَامُ فِي النَّذْرِ يُقْضَى عَنْهُ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Abu Ghawth bin Husain – a man from Furu’ – that\nhe consulted the Prophet (ﷺ) about a Hajj that his father owed, but\nhe had died and had not gone for Hajj. The Prophet (ﷺ) said:","text":"“Perform Hajj on behalf of your father.” And the Prophet (ﷺ)\nsaid:\n“The same applies to fasting in fulfillment of a vow – it\nshould be\nmade up for.”"}},{"id":25,"idInBook":25,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا وَكِيعٌ، عَنْ شُعْبَةَ، عَنِ النُّعْمَانِ بْنِ سَالِمٍ، عَنْ عَمْرِو بْنِ أَوْسٍ، عَنْ أَبِي رَزِينٍ الْعُقَيْلِيِّ، أَنَّهُ أَتَى النَّبِيَّ ـ صلى الله عليه وسلم ـ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ أَبِي شَيْخٌ كَبِيرٌ لاَ يَسْتَطِيعُ الْحَجَّ وَلاَ الْعُمْرَةَ وَلاَ الظَّعَنَ ‏.‏ قَالَ ‏\n\"‏ حُجَّ عَنْ أَبِيكَ وَاعْتَمِرْ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Abu Razin Al-‘Uqaili that he came to the Prophet\n(ﷺ) and said:","text":"“O Messenger of Allah, my father is an old man and\nhe\ncannot perform Hajj or ‘Umrah, and he is not able to ride the\nmount\n(due to old age).” He said: “Perform Hajj and ‘Umrah on\nbehalf of your\nfather.”"}},{"id":26,"idInBook":26,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو مَرْوَانَ، مُحَمَّدُ بْنُ عُثْمَانَ الْعُثْمَانِيُّ حَدَّثَنَا عَبْدُ الْعَزِيزِ الدَّرَاوَرْدِيُّ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ عَيَّاشِ بْنِ أَبِي رَبِيعَةَ الْمَخْزُومِيِّ، عَنْ حَكِيمِ بْنِ حَكِيمِ بْنِ عَبَّادِ بْنِ حُنَيْفٍ الأَنْصَارِيِّ، عَنْ نَافِعِ بْنِ جُبَيْرٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، أَنَّ امْرَأَةً، مِنْ خَثْعَمٍ جَاءَتِ النَّبِيَّ ـ صلى الله عليه وسلم ـ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ أَبِي شَيْخٌ كَبِيرٌ قَدْ أَفْنَدَ وَأَدْرَكَتْهُ فَرِيضَةُ اللَّهِ عَلَى عِبَادِهِ فِي الْحَجِّ وَلاَ يَسْتَطِيعُ أَدَاءَهَا فَهَلْ يُجْزِئُ عَنْهُ أَنْ أُؤَدِّيَهَا عَنْهُ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ نَعَمْ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from ‘Abdullah bin ‘Abbas that a woman from Khath’am\ncame to the Prophet (ﷺ) and said:","text":"“O Messenger of Allah, my\nfather\nis an old man who has become weak, and now the command of\nAllah has\ncome for His slaves to perform Hajj, but he cannot do it.\nWill it\ndischarge his duty if I perform it on his behalf?” The\nMessenger of\nAllah (ﷺ) said: “Yes.”"}},{"id":27,"idInBook":27,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبُو خَالِدٍ الأَحْمَرُ، حَدَّثَنَا مُحَمَّدُ بْنُ كُرَيْبٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ أَخْبَرَنِي حُصَيْنُ بْنُ عَوْفٍ، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ إِنَّ أَبِي أَدْرَكَهُ الْحَجُّ وَلاَ يَسْتَطِيعُ أَنْ يَحُجَّ إِلاَّ مُعْتَرِضًا ‏.‏ فَصَمَتَ سَاعَةً ثُمَّ قَالَ ‏\n\"‏ حُجَّ عَنْ أَبِيكَ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Ibn ‘Abbas said:","text":"Husain bin ‘Awf told me: I\nsaid:\n“O Messenger of Allah, the command for Hajj has come but my\nfather\ncannot perform Hajj unless he is tied to a saddle.” Some time\npassed, then he said: “Perform Hajj on behalf of your father.”"}},{"id":28,"idInBook":28,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا الأَوْزَاعِيُّ، عَنِ الزُّهْرِيِّ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنِ ابْنِ عَبَّاسٍ، عَنْ أَخِيهِ الْفَضْلِ، أَنَّهُ كَانَ رِدْفَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ غَدَاةَ النَّحْرِ فَأَتَتْهُ امْرَأَةٌ مِنْ خَثْعَمٍ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ فَرِيضَةَ اللَّهِ فِي الْحَجِّ عَلَى عِبَادِهِ أَدْرَكَتْ أَبِي شَيْخًا كَبِيرًا لاَ يَسْتَطِيعُ أَنْ يَرْكَبَ أَفَأَحُجُّ عَنْهُ قَالَ ‏\n\"‏ نَعَمْ فَإِنَّهُ لَوْ كَانَ عَلَى أَبِيكِ دَيْنٌ قَضَيْتِيهِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Ibn ‘Abbas that his brother Fadl was riding\nbehind\nthe Messenger of Allah (ﷺ) in the morning of sacrifice (i.e.,\nthe\n10th of Dhul-Hijjah), when a woman from Khath’am came\nand said:","text":"“O\nMessenger of Allah, the command of Allah has come for\nHis slaves to\nperform Hajj, but my father is an old man and cannot\nride. May I\nperform Hajj on his behalf?” He said: “Yes, because\nif your father\nowed a debt you would pay it off.”"}},{"id":29,"idInBook":29,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، وَمُحَمَّدُ بْنُ طَرِيفٍ، قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنِي مُحَمَّدُ بْنُ سُوقَةَ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ رَفَعَتِ امْرَأَةٌ صَبِيًّا لَهَا إِلَى النَّبِيِّ ـ صلى الله عليه وسلم ـ فِي حَجَّتِهِ فَقَالَتْ يَا رَسُولَ اللَّهِ أَلِهَذَا حَجٌّ قَالَ ‏\n\"‏ نَعَمْ وَلَكِ أَجْرٌ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Jabir bin ‘Abdullah said:","text":"“A woman held up a\nchild\nof hers to the Prophet (ﷺ) during Hajj and said: ‘O Messenger\nof\nAllah, is there Hajj for this one?’ He said: ‘Yes, and you will\nbe\nrewarded.’”"}},{"id":30,"idInBook":30,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، عَنْ عُبَيْدِ اللَّهِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ نُفِسَتْ أَسْمَاءُ بِنْتُ عُمَيْسٍ بِالشَّجَرَةِ فَأَمَرَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ أَبَا بَكْرٍ أَنْ يَأْمُرَهَا أَنْ تَغْتَسِلَ وَتُهِلَّ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Aishah said:","text":"“Asma’ bint ‘Umais gave birth at\nShajarah, and the Messenger of Allah (ﷺ) told Abu Bakr to tell her\nto take a bath and begin the Talbiyah.”"}},{"id":31,"idInBook":31,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، عَنْ سُلَيْمَانَ بْنِ بِلاَلٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، أَنَّهُ سَمِعَ الْقَاسِمَ بْنَ مُحَمَّدٍ، يُحَدِّثُ عَنْ أَبِيهِ، عَنْ أَبِي بَكْرٍ، أَنَّهُ خَرَجَ حَاجًّا مَعَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ وَمَعَهُ أَسْمَاءُ بِنْتُ عُمَيْسٍ فَوَلَدَتْ بِالشَّجَرَةِ مُحَمَّدَ بْنَ أَبِي بَكْرٍ فَأَتَى أَبُو بَكْرٍ النَّبِيَّ ـ صلى الله عليه وسلم ـ فَأَخْبَرَهُ فَأَمَرَهُ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ أَنْ يَأْمُرَهَا أَنْ تَغْتَسِلَ ثُمَّ تُهِلَّ بِالْحَجِّ وَتَصْنَعَ مَا يَصْنَعُ النَّاسُ إِلاَّ أَنَّهَا لاَ تَطُوفُ بِالْبَيْتِ ‏.‏","english":{"narrator":"","text":"It was\nnarrated from Abu Bakr that he went out for Hajj with the\nMessenger\nof Allah (ﷺ), and Asma’ bint ‘Umais was with him. She gave\nbirth, at Shajarah, to Muhammad bin Abu Bakr. Abu Bakr came to the\nProphet (ﷺ) and told him about that, and the Messenger of Allah\n(ﷺ) told him to tell her to take a bath, then begin the Talbiyah\nfor\nHajj, and to do everything that the people did, apart from\ncircumambulating the House (Tawaf)."}},{"id":32,"idInBook":32,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، عَنْ سُفْيَانَ، عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ، عَنْ أَبِيهِ، عَنْ جَابِرٍ، قَالَ نُفِسَتْ أَسْمَاءُ بِنْتُ عُمَيْسٍ بِمُحَمَّدِ بْنِ أَبِي بَكْرٍ فَأَرْسَلَتْ إِلَى النَّبِيِّ ـ صلى الله عليه وسلم ـ فَأَمَرَهَا أَنْ تَغْتَسِلَ وَتَسْتَثْفِرَ بِثَوْبٍ وَتُهِلَّ ‏.‏","english":{"narrator":"It was\nnarrated that Jabir said:","text":"“Asma’ bint ‘Umais gave birth to\nMuhammad bin Abi Bakr and sent word to the Prophet (ﷺ). He told her\nto take a bath, fasten a cloth around her private part and begin the\nTalbiyah.”"}},{"id":33,"idInBook":33,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو مُصْعَبٍ، حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ يُهِلُّ أَهْلُ الْمَدِينَةِ مِنْ ذِي الْحُلَيْفَةِ وَأَهْلُ الشَّامِ مِنَ الْجُحْفَةِ وَأَهْلُ نَجْدٍ مِنْ قَرْنٍ ‏\"‏ ‏.‏ فَقَالَ عَبْدُ اللَّهِ أَمَّا هَذِهِ الثَّلاَثَةُ فَقَدْ سَمِعْتُهَا مِنْ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ وَبَلَغَنِي أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ وَيُهِلُّ أَهْلُ الْيَمَنِ مِنْ يَلَمْلَمَ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Ibn ‘Umar that the Messenger of Allah (ﷺ)\nsaid:","text":"“The people of Al-Madinah should begin the Talbiyah from\nDhul-\nHulaifah, the people of Sham from Juhfah, and the people of Najd\nfrom\nQarn.” ‘Abdullah said: “As for these three, I heard them\nfrom the\nMessenger of Allah (ﷺ). And it reached me that the\nMessenger of\nAllah (ﷺ) said: ‘And the people of Yemen should\nenter Ihram from\nYalamlam.’”"}},{"id":34,"idInBook":34,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ يَزِيدَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ خَطَبَنَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ فَقَالَ ‏\"‏ مُهَلُّ أَهْلِ الْمَدِينَةِ مِنْ ذِي الْحُلَيْفَةِ وَمُهَلُّ أَهْلِ الشَّامِ مِنَ الْجُحْفَةِ وَمُهَلُّ أَهْلِ الْيَمَنِ مِنْ يَلَمْلَمَ وَمُهَلُّ أَهْلِ نَجْدٍ مِنْ قَرْنٍ وَمُهَلُّ أَهْلِ الْمَشْرِقِ مِنْ ذَاتِ عِرْقٍ ‏\"‏ ‏.‏ ثُمَّ أَقْبَلَ بِوَجْهِهِ لِلأُفُقِ ثُمَّ قَالَ ‏\"‏ اللَّهُمَّ أَقْبِلْ بِقُلُوبِهِمْ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Jabir said:","text":"“The Messenger of Allah (ﷺ)\naddressed\nus and said: ‘The Talbiyah of the people of Al-Madinah\nbegins at\nDhul-Hulaifah. The Talbiyah of the people of Sham begins at\nJuhfah.\nThe Talbiyah of the people of Yemen begins at Yalamlam. The\nTalbiyah\nof the people of Najd begins at Qarn. The Talbiyah of the\npeople of\nthe east begins at Dhat ‘Irq.’ Then he turned to face the\n(eastern) horizon and said: ‘O Allah, make their hearts\nsteadfast.’”"}},{"id":35,"idInBook":35,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا مُحْرِزُ بْنُ سَلَمَةَ الْعَدَنِيُّ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ الدَّرَاوَرْدِيُّ، حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ كَانَ إِذَا أَدْخَلَ رِجْلَهُ فِي الْغَرْزِ وَاسْتَوَتْ بِهِ رَاحِلَتُهُ أَهَلَّ مِنْ عِنْدِ مَسْجِدِ ذِي الْحُلَيْفَةِ ‏.‏","english":{"narrator":"","text":"It was\nnarrated from Ibn ‘Umar that when the Messenger of Allah (ﷺ)\nput\nhis foot in the stirrup and his riding beast rose up with him, he\nwould say the Talbiyah from the mosque of Dhul-Hulaifah."}},{"id":36,"idInBook":36,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، وَعُمَرُ بْنُ عَبْدِ الْوَاحِدِ، قَالاَ حَدَّثَنَا الأَوْزَاعِيُّ، عَنْ أَيُّوبَ بْنِ مُوسَى، عَنْ عَبْدِ اللَّهِ بْنِ عُبَيْدِ بْنِ عُمَيْرٍ، عَنْ ثَابِتٍ الْبُنَانِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ إِنِّي عِنْدَ ثَفِنَاتِ نَاقَةِ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ عِنْدَ الشَّجَرَةِ فَلَمَّا اسْتَوَتْ بِهِ قَائِمَةً قَالَ ‏\n\"‏ لَبَّيْكَ بِعُمْرَةٍ وَحَجَّةٍ مَعًا ‏\"‏ ‏.‏ وَذَلِكَ فِي حَجَّةِ الْوَدَاعِ ‏.‏","english":{"narrator":"It was\nnarrated that Anas bin Malik said:","text":"“I was by the knees of the\nshe-camel of the Messenger of Allah (ﷺ), at Shajarah. When it rose\nup with him, he said: ‘Labbaika bi ‘Umrah wa Hajjah ma’an [Here\nI am\n(O Allah) for ‘Umrah and Hajj together].’ That was during\nthe Farewell\nPilgrimage.”"}},{"id":37,"idInBook":37,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، وَأَبُو أُسَامَةَ وَعَبْدُ اللَّهِ بْنُ نُمَيْرٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ تَلَقَّفْتُ التَّلْبِيَةَ مِنْ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ وَهُوَ يَقُولُ ‏\n\"‏ لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ لَبَّيْكَ لاَ شَرِيكَ لَكَ لَبَّيْكَ إِنَّ الْحَمْدَ وَالنِّعْمَةَ لَكَ وَالْمُلْكَ لاَ شَرِيكَ لَكَ ‏\"‏ ‏.‏ قَالَ وَكَانَ ابْنُ عُمَرَ يَزِيدُ فِيهَا لَبَّيْكَ لَبَّيْكَ لَبَّيْكَ وَسَعْدَيْكَ وَالْخَيْرُ فِي يَدَيْكَ لَبَّيْكَ وَالرَّغْبَاءُ إِلَيْكَ وَالْعَمَلُ ‏.‏","english":{"narrator":"It was\nnarrated from Nafi’, that Ibn ‘Umar said:","text":"“I learned the\nTalbiyah from the Messenger of Allah (ﷺ) who said: Labbaika\nAllahumma labbaik, labbaika la sharika laka labbaik. Innal-hamda\nwan-\nni’mata laka, wal-mulk. La sharika laka (Here I am, O Allah,\nhere I\nam. Here I am, You have no partner, here I am. Verily all\npraise and\nblessings are Yours, and all sovereignty, You have no\npartner).” He\nsaid: “And Ibn ‘Umar used to add: Labbaika\nlabbaika labbaika wa\nsa’daika wal-khairu fi yadaika, labbaika\nwar-raghba’u ilaika wal-‘amal\n(Here I am, here I am, here I am,\nand at Your service; all good is in\nYour Hands, here I am, seeking\nYour pleasure and striving for Your\nsake).”"}},{"id":38,"idInBook":38,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا زَيْدُ بْنُ أَخْزَمَ، حَدَّثَنَا مُؤَمَّلُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا سُفْيَانُ، عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ، عَنْ أَبِيهِ، عَنْ جَابِرٍ، قَالَ كَانَتْ تَلْبِيَةُ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ لَبَّيْكَ لاَ شَرِيكَ لَكَ لَبَّيْكَ إِنَّ الْحَمْدَ وَالنِّعْمَةَ لَكَ وَالْمُلْكَ لاَ شَرِيكَ لَكَ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Jabir said:","text":"“The Talbiyah of the Messenger of\nAllah\n(ﷺ) was: ‘Labbaika Allahumma labbaik, (labbaika) la sharika\nlaka\nlabbaik. Innal-hamd wan-ni’mata laka, wal-mulk. La sharika laka\n(Here I am, O Allah, here I am. Here I am, You have no partner, here\nI\nam. Verily all praise and blessings are Yours, and all sovereignty,\nYou have no partner).’”"}},{"id":39,"idInBook":39,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي سَلَمَةَ، عَنْ عَبْدِ اللَّهِ بْنِ الْفَضْلِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ فِي تَلْبِيَتِهِ ‏\n\"‏ لَبَّيْكَ إِلَهَ الْحَقِّ لَبَّيْكَ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)\nused to\nsay in his Talbiyah:","text":"“Labbaika ilahal-haqq, labbaika (Here I\nam, O\ngod of Truth, here I am).”"}},{"id":40,"idInBook":40,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ، حَدَّثَنَا عُمَارَةُ بْنُ غَزِيَّةَ الأَنْصَارِيُّ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ، عَنْ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ مَا مِنْ مُلَبٍّ يُلَبِّي إِلاَّ لَبَّى مَا عَنْ يَمِينِهِ وَشِمَالِهِ مِنْ حَجَرٍ أَوْ شَجَرٍ أَوْ مَدَرٍ حَتَّى تَنْقَطِعَ الأَرْضُ مِنْ هَا هُنَا وَهَا هُنَا ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Sahl bin Sa’d As-Sa’idi that the Messenger of\nAllah\n(ﷺ) said:","text":"“There is no (pilgrim) who recites the Talbiyah but\nthat which is to his right and left also recites it, rocks and trees\nand hills, to the farthest ends of the earth in each direction, from\nhere and from there.”"}},{"id":41,"idInBook":41,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ، حَدَّثَهُ عَنْ خَلاَّدِ بْنِ السَّائِبِ، عَنْ أَبِيهِ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ أَتَانِي جِبْرِيلُ فَأَمَرَنِي أَنْ آمُرَ أَصْحَابِي أَنْ يَرْفَعُوا أَصْوَاتَهُمْ بِالإِهْلاَلِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Khallad bin Sa’ib, from his father, that the\nMessenger of Allah (ﷺ) said:","text":"“Jibra’il came to me and told me\nto\ncommand my Companions to raise their voices when reciting the\nTalbiyah.”"}},{"id":42,"idInBook":42,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي لَبِيدٍ، عَنِ الْمُطَّلِبِ بْنِ عَبْدِ اللَّهِ بْنِ حَنْطَبٍ، عَنْ خَلاَّدِ بْنِ السَّائِبِ، عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ جَاءَنِي جِبْرِيلُ فَقَالَ يَا مُحَمَّدُ مُرْ أَصْحَابَكَ فَلْيَرْفَعُوا أَصْوَاتَهُمْ بِالتَّلْبِيَةِ فَإِنَّهَا مِنْ شِعَارِ الْحَجِّ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Zaid bin Khalid Al-Juhani that the Messenger of\nAllah\n(ﷺ) said:","text":"“Jibril came to me and said: ‘O Muhammad! Tell your\nCompanions to raise their voices when reciting the Talbiyah, for it\nis\none of the symbols of Hajj.’”"}},{"id":43,"idInBook":43,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ الْحِزَامِيُّ، وَيَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ، قَالاَ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، عَنِ الضَّحَّاكِ بْنِ عُثْمَانَ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَرْبُوعٍ، عَنْ أَبِي بَكْرٍ الصِّدِّيقِ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ سُئِلَ أَىُّ الأَعْمَالِ أَفْضَلُ قَالَ ‏\n\"‏ الْعَجُّ وَالثَّجُّ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Abu Bakr As-Siddiq that the Messenger of Allah\n(ﷺ)\nwas asked:","text":"“Which actions are best?” He said: “Raising one’s\nvoice and slaughtering the sacrificial animal.”"}},{"id":44,"idInBook":44,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ الْحِزَامِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نَافِعٍ، وَعَبْدُ اللَّهِ بْنُ وَهْبٍ، وَمُحَمَّدُ بْنُ فُلَيْحٍ، قَالُوا حَدَّثَنَا عَاصِمُ بْنُ عُمَرَ بْنِ حَفْصٍ، عَنْ عَاصِمِ بْنِ عُبَيْدِ اللَّهِ، عَنْ عَبْدِ اللَّهِ بْنِ عَامِرِ بْنِ رَبِيعَةَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ مَا مِنْ مُحْرِمٍ يَضْحَى لِلَّهِ يَوْمَهُ يُلَبِّي حَتَّى تَغِيبَ الشَّمْسُ إِلاَّ غَابَتْ بِذُنُوبِهِ فَعَادَ كَمَا وَلَدَتْهُ أُمُّهُ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Jabir bin ‘Abdullah that the Messenger of Allah\n(ﷺ)\nsaid:","text":"“There is no Muhrim (pilgrim in Ihram) who exposes himself\nto\nthe sun all day for the sake of Allah, reciting the Talbiyah until\nthe sun goes down, but his sins will disappear and he will go back\nlike on the day his mother bore him.”"}},{"id":45,"idInBook":45,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، جَمِيعًا عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّهَا قَالَتْ طَيَّبْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ لإِحْرَامِهِ قَبْلَ أَنْ يُحْرِمَ وَلِحِلِّهِ قَبْلَ أَنْ يُفِيضَ - قَالَ سُفْيَانُ - بِيَدَىَّ هَاتَيْنِ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Aishah said:","text":"“I put perfume on the Messenger of\nAllah (ﷺ) for his Ihram before he entered into it, and when he\nexited Ihram before he returned.”*"}},{"id":46,"idInBook":46,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا الأَعْمَشُ، عَنْ أَبِي الضُّحَى، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، قَالَتْ كَأَنِّي أَنْظُرُ إِلَى وَبِيصِ الطِّيبِ فِي مَفَارِقِ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ وَهُوَ يُلَبِّي ‏.‏","english":{"narrator":"It was\nnarrated that ‘Aishah said:","text":"“It is as if I can see the races\nof\nperfume in the parting (of hair) of the Messenger of Allah (ﷺ),\nwhile he is reciting the Talbiyah.”"}},{"id":47,"idInBook":47,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ بْنُ مُوسَى، حَدَّثَنَا شَرِيكٌ، عَنْ أَبِي إِسْحَاقَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ كَأَنِّي أَرَى وَبِيصَ الطِّيبِ فِي مَفْرِقِ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ بَعْدَ ثَلاَثَةٍ وَهُوَ مُحْرِمٌ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Aishah said:","text":"“It is as if I can see the traces\nof\nperfume in the parting (of hair) of the Messenger of Allah (ﷺ)\nafter three days, and he was a Muhrim.”"}},{"id":48,"idInBook":48,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو مُصْعَبٍ، حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَجُلاً، سَأَلَ النَّبِيَّ ـ صلى الله عليه وسلم ـ مَا يَلْبَسُ الْمُحْرِمُ مِنَ الثِّيَابِ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ لاَ يَلْبَسُ الْقُمُصَ وَلاَ الْعَمَائِمَ وَلاَ السَّرَاوِيلاَتِ وَلاَ الْبَرَانِسَ وَلاَ الْخِفَافَ إِلاَّ أَنْ لاَ يَجِدَ نَعْلَيْنِ فَلْيَلْبَسْ خُفَّيْنِ وَلْيَقْطَعْهُمَا أَسْفَلَ مِنَ الْكَعْبَيْنِ وَلاَ تَلْبَسُوا مِنَ الثِّيَابِ شَيْئًا مَسَّهُ الزَّعْفَرَانُ أَوِ الْوَرْسُ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from ‘Abdullah bin ‘Umar that a man asked the\nMessenger\nof Allah (ﷺ), what clothes may the Muhrim wear? The\nMessenger of\nAllah (ﷺ) said:","text":"“He should not wear a shirt, or turbans\n(or head\ncover), pants or pajamas, hooded cloaks and no leather socks,\nunless\nhe cannot find sandals, in which case he may wear leather socks\nbut\nshould cut them to below the ankles. And he should not wear any\nclothes that have been touched (dyed) with saffron or Wars.”*"}},{"id":49,"idInBook":49,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو مُصْعَبٍ، حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ أَنْ يَلْبَسَ الْمُحْرِمُ ثَوْبًا مَصْبُوغًا بِوَرْسٍ أَوْ زَعْفَرَانٍ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Abdullah bin ‘Umar said:","text":"“The Messenger of\nAllah\n(ﷺ) forbade the Muhrim to wear a garment dyed with Wars or\nsaffron.”"}},{"id":50,"idInBook":50,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، وَمُحَمَّدُ بْنُ الصَّبَّاحِ، قَالاَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ جَابِرِ بْنِ زَيْدٍ أَبِي الشَّعْثَاءِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ سَمِعْتُ النَّبِيَّ ـ صلى الله عليه وسلم ـ يَخْطُبُ - قَالَ هِشَامٌ عَلَى الْمِنْبَرِ - فَقَالَ ‏\"‏ مَنْ لَمْ يَجِدْ إِزَارًا فَلْيَلْبَسْ سَرَاوِيلَ وَمَنْ لَمْ يَجِدْ نَعْلَيْنِ فَلْيَلْبَسْ خُفَّيْنِ ‏\"‏ ‏.‏ وَقَالَ هِشَامٌ فِي حَدِيثِهِ ‏\"‏ فَلْيَلْبَسْ سَرَاوِيلَ إِلاَّ أَنْ يَفْقِدَ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Ibn ‘Abbas said:","text":"“I heard the Prophet (ﷺ)\ndelivering a sermon – (one of the narrators) Hisham said: ‘On the\npulpit’ – and he said: ‘Whoever does not have a waist wrap, let\nhim\nwear pants or pajamas, and whoever does not have sandals, let him\nwear\nleather socks.’” In his narration, Hisham said: “If he\ndoes not find\nany, then let him wear pants or pajamas.”"}},{"id":51,"idInBook":51,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو مُصْعَبٍ، حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، عَنْ نَافِعٍ، وَعَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ مَنْ لَمْ يَجِدْ نَعْلَيْنِ فَلْيَلْبَسْ خُفَّيْنِ وَلْيَقْطَعْهُمَا أَسْفَلَ مِنَ الْكَعْبَيْنِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Ibn ‘Umar that the Messenger of Allah (ﷺ)\nsaid:","text":"“Whoever does not have sandals let him wear leather socks, and\nlet\nhim cut them to below the ankle.”"}},{"id":52,"idInBook":52,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنْ يَحْيَى بْنِ عَبَّادِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، عَنْ أَبِيهِ، عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ، قَالَتْ خَرَجْنَا مَعَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ حَتَّى إِذَا كُنَّا بِالْعَرْجِ نَزَلْنَا فَجَلَسَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ وَعَائِشَةُ إِلَى جَنْبِهِ وَأَنَا إِلَى جَنْبِ أَبِي بَكْرٍ وَكَانَتْ زِمَالَتُنَا وَزِمَالَةُ أَبِي بَكْرٍ وَاحِدَةً مَعَ غُلاَمِ أَبِي بَكْرٍ قَالَ فَطَلَعَ الْغُلاَمُ وَلَيْسَ مَعَهُ بَعِيرُهُ فَقَالَ لَهُ أَيْنَ بَعِيرُكَ قَالَ أَضْلَلْتُهُ الْبَارِحَةَ ‏.‏ قَالَ مَعَكَ بَعِيرٌ وَاحِدٌ تُضِلُّهُ قَالَ فَطَفِقَ يَضْرِبُهُ وَرَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\n\"‏ انْظُرُوا إِلَى هَذَا الْمُحْرِمِ مَا يَصْنَعُ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Asma’ bint Abu Bakr said:","text":"“We went out with the\nMessenger of Allah (ﷺ) until, when we were in ‘Arj, we stopped to\ncamp. The Messenger of Allah (ﷺ) sat, with ‘Aishah by his side,\nand\nI was sitting beside Abu Bakr. Our mount* and the mount of Abu\nBakr\nwas one, under the care of the slave of Abu Bakr. The slave\nlooked and\nhis camel was not with him, so he said to him: ‘Where is\nyour camel?’\nHe said: ‘I lost it yesterday.’ He said: ‘You\nhave one camel with you\nand you lost it?’ He started to beat him,\nand the Messenger of Allah\n(ﷺ) said: ‘Look at what this Muhrim is\ndoing!’”"}},{"id":53,"idInBook":53,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو مُصْعَبٍ، حَدَّثَنَا مَالِكٌ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ بْنِ حُنَيْنٍ، عَنْ أَبِيهِ، أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، وَالْمِسْوَرَ بْنَ مَخْرَمَةَ، اخْتَلَفَا بِالأَبْوَاءِ فَقَالَ عَبْدُ اللَّهِ بْنُ عَبَّاسٍ يَغْسِلُ الْمُحْرِمُ رَأْسَهُ ‏.‏ وَقَالَ الْمِسْوَرُ بْنُ مَخْرَمَةَ لاَ يَغْسِلُ الْمُحْرِمُ رَأْسَهُ ‏.‏ فَأَرْسَلَنِي ابْنُ عَبَّاسٍ إِلَى أَبِي أَيُّوبَ الأَنْصَارِيِّ أَسْأَلُهُ عَنْ ذَلِكَ، فَوَجَدْتُهُ يَغْتَسِلُ بَيْنَ الْقَرْنَيْنِ وَهُوَ يَسْتَتِرُ بِثَوْبٍ فَسَلَّمْتُ عَلَيْهِ فَقَالَ مَنْ هَذَا قُلْتُ أَنَا عَبْدُ اللَّهِ بْنُ حُنَيْنٍ أَرْسَلَنِي إِلَيْكَ عَبْدُ اللَّهِ بْنُ عَبَّاسٍ أَسْأَلُكَ كَيْفَ كَانَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ يَغْسِلُ رَأْسَهُ وَهُوَ مُحْرِمٌ قَالَ فَوَضَعَ أَبُو أَيُّوبَ يَدَهُ عَلَى الثَّوْبِ فَطَأْطَأَهُ حَتَّى بَدَا لِي رَأْسُهُ ثُمَّ قَالَ لإِنْسَانٍ يَصُبُّ عَلَيْهِ اصْبُبْ ‏.‏ فَصَبَّ عَلَى رَأْسِهِ ثُمَّ حَرَّكَ رَأْسَهُ بِيَدَيْهِ فَأَقْبَلَ بِهِمَا وَأَدْبَرَ ‏.‏ ثُمَّ قَالَ هَكَذَا رَأَيْتُهُ ـ صلى الله عليه وسلم ـ يَفْعَلُ ‏.‏","english":{"narrator":"It was\nnarrated from Ibrahim bin ‘Abdullah bin Hunain, from his father,\nthat ‘Abdullah bin ‘Abbas and Miswar bin Makhramah disagreed at\nAbwa’. Abdullah bin ‘Abbas said that the Muhrim may wash his\nhead, and Miswar said that the Muhrim may not wash his head.\nIbn ‘Abbas sent me to Abu Ayyub Al-Ansari to ask him about that, and I found him taking a bath near the well, screened with a piece of cloth. I greeted him with Salam, and he said:","text":"“Who is this?” I said: “I am ‘Abdullah bin Hunain. ‘Abdullah bin ‘Abbas sent me to you to ask you how the Messenger of Allah (ﷺ) used to wash his head when he was in Ihram.” He said: “Abu Ayyub put his hand on the cloth and lowered it until his head appeared, then he said to someone who was pouring water for him, Pour water. So he poured water on his head. Then he rubbed his head with his hands, forwards and backwards, and said: ‘This is what I saw him (ﷺ) doing.’”"}},{"id":54,"idInBook":54,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ، عَنْ مُجَاهِدٍ، عَنْ عَائِشَةَ، قَالَتْ \n\"كُنَّا مَعَ النَّبِيِّ ـ صلى الله عليه وسلم ـ وَنَحْنُ مُحْرِمُونَ فَإِذَا لَقِيَنَا الرَّاكِبُ أَسْدَلْنَا ثِيَابَنَا مِنْ فَوْقِ رُءُوسِنَا فَإِذَا جَاوَزَنَا رَفَعْنَاهَا\".‏     \n حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ، عَنْ مُجَاهِدٍ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ بِنَحْوِهِ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Aishah said:","text":"“We were with the Prophet (ﷺ),\nand\nwe were in Ihram. When a rider met us we would lower our garments\nfrom the top of our heads, and when he has gone, we would lift them\nup again.”\n\nAnother chain reports a similar hadith."}},{"id":55,"idInBook":55,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي ح، وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، حَدَّثَنَا عُثْمَانُ بْنُ حَكِيمٍ، عَنْ أَبِي بَكْرِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، عَنْ جَدَّتِهِ، - قَالَ لاَ أَدْرِي أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ أَوْ سُعْدَى بِنْتِ عَوْفٍ ‏.‏ أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ دَخَلَ عَلَى ضُبَاعَةَ بِنْتِ عَبْدِ الْمُطَّلِبِ فَقَالَ ‏\"‏ مَا يَمْنَعُكِ يَا عَمَّتَاهُ مِنَ الْحَجِّ ‏\"‏ ‏.‏ فَقَالَتْ أَنَا امْرَأَةٌ سَقِيمَةٌ وَأَنَا أَخَافُ الْحَبْسَ ‏.‏ قَالَ ‏\"‏ فَأَحْرِمِي وَاشْتَرِطِي أَنَّ مَحِلَّكِ حَيْثُ حُبِسْتِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Abu Bakr bin ‘Abdullah bin Zubair from his\ngrandmother – he (the narrator) said:","text":"“I do not know if it was\nAsma’\nbint Abu Bakr or Su’da bint ‘Awf’ – that the\nMessenger of Allah (ﷺ)\nentered upon Duba’ah bint ‘Abdul-Muttalib\nand said: “What is keeping\nyou, O my aunt, from performing Hajj?”\nShe said: “I am a sick woman,\nand I am afraid of being prevented\n(from completing Hajj).” He said:\n‘Enter Ihram and stipulate the\ncondition that you will exit Ihram from\nthe point where you are\nprevented.’”"}},{"id":56,"idInBook":56,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، وَوَكِيعٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ ضُبَاعَةَ، قَالَتْ دَخَلَ عَلَىَّ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ وَأَنَا شَاكِيَةٌ فَقَالَ ‏\"‏ أَمَا تُرِيدِينَ الْحَجَّ الْعَامَ ‏\"‏ قُلْتُ إِنِّي لَعَلِيلَةٌ يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\"‏ حُجِّي وَقُولِي مَحِلِّي حَيْثُ تَحْبِسُنِي ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Duba’ah said:","text":"“The Messenger of Allah (ﷺ)\nentered\nupon me when I was unwell. He said: ‘Do you intend to perform\nHajj\nthis year?’ I said: ‘I am sick, O Messenger of Allah.’ He said:\n‘Go for Hajj and say: “I will exit Ihram from the point where I\nam\nprevented.’”"}},{"id":57,"idInBook":57,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بِشْرٍ، بَكْرُ بْنُ خَلَفٍ حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ طَاوُسًا، وَعِكْرِمَةَ، يُحَدِّثَانِ عَنِ ابْنِ عَبَّاسٍ، قَالَ جَاءَتْ ضُبَاعَةُ بِنْتُ الزُّبَيْرِ بْنِ عَبْدِ الْمُطَّلِبِ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ فَقَالَتْ إِنِّي امْرَأَةٌ ثَقِيلَةٌ وَإِنِّي أُرِيدُ الْحَجَّ فَكَيْفَ أُهِلُّ قَالَ ‏\n\"‏ أَهِلِّي وَاشْتَرِطِي أَنَّ مَحِلِّي حَيْثُ حَبَسْتَنِي ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Ibn ‘Abbas said:","text":"Duba’ah bint Zubair bin\n‘Abdul-\nMuttalib came to the Messenger of Allah (ﷺ) and said: “I\nam a heavy\nwoman and I want to go for Hajj. How should I enter\nIhram?” He said:\n“Enter Ihram and stipulate the condition that\nyou will exit Ihram from\nthe point where you are prevented.”"}},{"id":58,"idInBook":58,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ صَبِيحٍ، حَدَّثَنَا مُبَارَكُ بْنُ حَسَّانَ أَبُو عَبْدِ اللَّهِ، عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، قَالَ كَانَتِ الأَنْبِيَاءُ تَدْخُلُ الْحَرَمَ مُشَاةً حُفَاةً وَيَطُوفُونَ بِالْبَيْتِ وَيَقْضُونَ الْمَنَاسِكَ حُفَاةً مُشَاةً ‏.‏","english":{"narrator":"It was\nnarrated that ‘Abdullah bin ‘Abbas said:","text":"“The Prophets used to\nenter the Haram walking barefoot. They would circumambulate the House\nand complete all the rituals barefoot and walking.”"}},{"id":59,"idInBook":59,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ كَانَ يَدْخُلُ مَكَّةَ مِنَ الثَّنِيَّةِ الْعُلْيَا وَإِذَا خَرَجَ خَرَجَ مِنَ الثَّنِيَّةِ السُّفْلَى ‏.‏","english":{"narrator":"","text":"It was\nnarrated from Ibn ‘Umar that the Messenger of Allah (ﷺ) used\nto\nenter Makkah from the upper mountain pass and when he left, he\nwould\nleave from the lower mountain pass."}},{"id":60,"idInBook":60,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا الْعُمَرِيُّ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ دَخَلَ مَكَّةَ نَهَارًا ‏.‏","english":{"narrator":"","text":"It was\nnarrated from Ibn ‘Umar that the Prophet (ﷺ) entered Makkah\nby\nday."}},{"id":61,"idInBook":61,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَنْبَأَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عَلِيِّ بْنِ الْحُسَيْنِ، عَنْ عَمْرِو بْنِ عُثْمَانَ، عَنْ أُسَامَةَ بْنِ زَيْدٍ، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ أَيْنَ تَنْزِلُ غَدًا وَذَلِكَ فِي حَجَّتِهِ قَالَ ‏\"‏ وَهَلْ تَرَكَ لَنَا عَقِيلٌ مَنْزِلاً ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ نَحْنُ نَازِلُونَ غَدًا بِخَيْفِ بَنِي كِنَانَةَ - يَعْنِي الْمُحَصَّبَ - حَيْثُ قَاسَمَتْ قُرَيْشٌ عَلَى الْكُفْرِ ‏\"‏ ‏.‏ وَذَلِكَ أَنَّ بَنِي كِنَانَةَ حَالَفَتْ قُرَيْشًا عَلَى بَنِي هَاشِمٍ أَنْ لاَ يُنَاكِحُوهُمْ وَلاَ يُبَايِعُوهُمْ ‏.‏ قَالَ مَعْمَرٌ قَالَ الزُّهْرِيُّ وَالْخَيْفُ الْوَادِي ‏.‏","english":{"narrator":"It was\nnarrated that Usamah bin Zaid said:","text":"“I said: ‘O Messenger of\nAllah, where will you stay tomorrow?’ That was during his Hajj. He\nsaid: ‘Has ‘Aqil left us any house?’ Then he said: ‘Tomorrow\nwe will stay in the valley of Banu Kinanah, Muhassab where the\nQuraish swore an oath of disbelief.’”\nThat was where the Banu Kinana had sworn an oath with the Quriash against Banu Hashim, that they would not intermarry with them or engage in trade with them.\nMa’mar said: “Zuhri said: Khaif means a valley.’”"}},{"id":62,"idInBook":62,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا عَاصِمٌ الأَحْوَلُ، عَنْ عَبْدِ اللَّهِ بْنِ سَرْجِسَ، قَالَ رَأَيْتُ الأُصَيْلِعَ عُمَرَ بْنَ الْخَطَّابِ يُقَبِّلُ الْحَجَرَ وَيَقُولُ إِنِّي لأُقَبِّلُكَ وَإِنِّي لأَعْلَمُ أَنَّكَ حَجَرٌ لاَ تَضُرُّ وَلاَ تَنْفَعُ وَلَوْلاَ أَنِّي رَأَيْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يُقَبِّلُكَ مَا قَبَّلْتُكَ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Abdullah bin Sarjis said:","text":"“I saw the bald\nforehead\nof ‘Umar bin Khattab when he kissed the Black Stone and said:\n‘I\nam kissing you, although I know that you are only a stone and you\ncan\nneither cause harm nor bring benefit. Had I not seen the Messenger\nof\nAllah (ﷺ) kissing you, I would not have kissed you.’”"}},{"id":63,"idInBook":63,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الرَّحِيمِ الرَّازِيُّ، عَنِ ابْنِ خُثَيْمٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ، يَقُولُ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ لَيَأْتِيَنَّ هَذَا الْحَجَرُ يَوْمَ الْقِيَامَةِ وَلَهُ عَيْنَانِ يُبْصِرُ بِهِمَا وَلِسَانٌ يَنْطِقُ بِهِ يَشْهَدُ عَلَى مَنْ يَسْتَلِمُهُ بِحَقٍّ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Sa’eed bin Jubair said:","text":"I heard Ibn ‘Abbas say:\nThe\nMessenger of Allah (ﷺ) said: “This Stone will be brought on the\nDay of Resurrection, and it will be given two eyes with which to see,\nand a tongue with which to speak, and it will bear witness for those\nwho touched it in sincerity.”"}},{"id":64,"idInBook":64,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا خَالِي، يَعْلَى عَنْ مُحَمَّدِ بْنِ عَوْنٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ اسْتَقْبَلَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ الْحَجَرَ ثُمَّ وَضَعَ شَفَتَيْهِ عَلَيْهِ يَبْكِي طَوِيلاً ثُمَّ الْتَفَتَ فَإِذَا هُوَ بِعُمَرَ بْنِ الْخَطَّابِ يَبْكِي فَقَالَ ‏\n\"‏ يَا عُمَرُ هَاهُنَا تُسْكَبُ الْعَبَرَاتُ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Ibn ‘Umar said:","text":"“The Messenger of Allah (ﷺ)\nturned to face the Stone, then he put his lips on it and wept for a\nlong time. Then he turned and saw ‘Umar bin Khattab weeping. He\nsaid:\n‘O ‘Umar, this is the place where tears should be shed.’”"}},{"id":65,"idInBook":65,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ الْمِصْرِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِيهِ، قَالَ لَمْ يَكُنْ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ يَسْتَلِمُ مِنْ أَرْكَانِ الْبَيْتِ إِلاَّ الرُّكْنَ الأَسْوَدَ وَالَّذِي يَلِيهِ مِنْ نَحْوِ دُورِ الْجُمَحِيِّينَ ‏.‏","english":{"narrator":"It was\nnarrated from Salim bin ‘Abdullah that his father said:","text":"“The\nMessenger of Allah (ﷺ) did not touch the corners of the Ka’bah\napart\nfrom the Black Corner (i.e., the corner where the Black Stone\nis) and\nthe one that is next to it facing the houses of Banu Jumah\n(i.e., the\nYemenite Corner).”"}},{"id":66,"idInBook":66,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا يُونُسُ بْنُ بُكَيْرٍ، حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاقَ، عَنْ مُحَمَّدِ بْنِ جَعْفَرِ بْنِ الزُّبَيْرِ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي ثَوْرٍ، عَنْ صَفِيَّةَ بِنْتِ شَيْبَةَ، قَالَتْ لَمَّا اطْمَأَنَّ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَامَ الْفَتْحِ طَافَ عَلَى بَعِيرِهِ يَسْتَلِمُ الرُّكْنَ بِمِحْجَنٍ بِيَدِهِ ثُمَّ دَخَلَ الْكَعْبَةَ فَوَجَدَ فِيهَا حَمَامَةَ عَيْدَانٍ فَكَسَرَهَا ثُمَّ قَامَ عَلَى بَابِ الْكَعْبَةِ فَرَمَى بِهَا وَأَنَا أَنْظُرُهُ ‏.‏","english":{"narrator":"It was\nnarrated that Safiyyah bint Shaibah said:","text":"“When the Messenger\nof\nAllah (ﷺ) saw that things had settled down, in the year of the\nConquest (of Makkah), he performed Tawaf on his camel, touching the\ncorner with a staff in his hand. Then he entered the House and found\na\ndove made of aloeswood. He broke it, then he stood at the door of\nthe\nKa’bah and threw it out, and I was watching him.”"}},{"id":67,"idInBook":67,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ، أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ طَافَ فِي حَجَّةِ الْوَدَاعِ عَلَى بَعِيرٍ يَسْتَلِمُ الرُّكْنَ بِمِحْجَنٍ ‏.‏","english":{"narrator":"","text":"It was\nnarrated from Ibn ‘Abbas that the Prophet (ﷺ) performed\nTawaf on\na camel during the Farewell Pilgrimage, touching the corner\nwith a\nstaff."}},{"id":68,"idInBook":68,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنَا هَدِيَّةُ بْنُ عَبْدِ الْوَهَّابِ، حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى، قَالاَ حَدَّثَنَا مَعْرُوفُ بْنُ خَرَّبُوذَ الْمَكِّيُّ، قَالَ سَمِعْتُ أَبَا الطُّفَيْلِ، عَامِرَ بْنَ وَاثِلَةَ قَالَ رَأَيْتُ النَّبِيَّ ـ صلى الله عليه وسلم ـ يَطُوفُ بِالْبَيْتِ عَلَى رَاحِلَتِهِ يَسْتَلِمُ الرُّكْنَ بِمِحْجَنِهِ وَيُقَبِّلُ الْمِحْجَنَ ‏.‏","english":{"narrator":"Ma’ruf\nbin Kharrabudh Al-Makki narrated:","text":"“I heard Abu Tufail, ‘Amir\nbin\nWathilah, say: ‘I saw the Prophet (ﷺ) performing Tawaf on his\ncamel, touching the corner with his staff and kissing the staff.’”"}},{"id":69,"idInBook":69,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَحْمَدُ بْنُ بَشِيرٍ، ح وَحَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ، قَالاَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ كَانَ إِذَا طَافَ بِالْبَيْتِ الطَّوَافَ الأَوَّلَ رَمَلَ ثَلاَثَةً وَمَشَى أَرْبَعَةً مِنَ الْحَجَرِ إِلَى الْحَجَرِ وَكَانَ ابْنُ عُمَرَ يَفْعَلُهُ ‏.‏","english":{"narrator":"","text":"It was\nnarrated from Nafi’, from Ibn ‘Umar that when the Messenger of\nAllah (ﷺ) performed Tawaf around the House for the first time, he\nwalked briskly with short steps in the first three circuits, and\nwalked normally in the last four, starting and ending at the Hijr.*\nAnd Ibn ‘Umar used to do that."}},{"id":70,"idInBook":70,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا أَبُو الْحُسَيْنِ الْعُكْلِيُّ، عَنْ مَالِكِ بْنِ أَنَسٍ، عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ، عَنْ أَبِيهِ، عَنْ جَابِرٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ رَمَلَ مِنَ الْحَجَرِ إِلَى الْحَجَرِ ثَلاَثًا وَمَشَى أَرْبَعًا ‏.‏","english":{"narrator":"","text":"It was\nnarrated from Jabir that the Prophet (ﷺ) walked briskly\n(Ramala),\nfrom the Hijr to the Hijr, three times, then he walked\nnormally for\nfour."}},{"id":71,"idInBook":71,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ، عَنْ هِشَامِ بْنِ سَعْدٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَبِيهِ، قَالَ سَمِعْتُ عُمَرَ، يَقُولُ فِيمَ الرَّمَلاَنُ الآنَ وَقَدْ أَطَّأَ اللَّهُ الإِسْلاَمَ وَنَفَى الْكُفْرَ وَأَهْلَهُ وَايْمُ اللَّهِ مَا نَدَعُ شَيْئًا كُنَّا نَفْعَلُهُ عَلَى عَهْدِ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ ‏.‏","english":{"narrator":"It was\nnarrated from Zaid bin Aslam that his father said:","text":"“I heard\n‘Umar\nsay: ‘Why do they perform Ramal now, when Allah has established\nIslam and done away with disbelief and its people? By Allah,* we will\nnot give up something that we used to do at the time of the Messenger\nof Allah (ﷺ).’”"}},{"id":72,"idInBook":72,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَنْبَأَنَا مَعْمَرٌ، عَنِ ابْنِ خُثَيْمٍ، عَنْ أَبِي الطُّفَيْلِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ النَّبِيُّ ـ صلى الله عليه وسلم ـ لأَصْحَابِهِ حِينَ أَرَادُوا دُخُولَ مَكَّةَ فِي عُمْرَتِهِ بَعْدَ الْحُدَيْبِيَةِ ‏\n\"‏ إِنَّ قَوْمَكُمْ غَدًا سَيَرَوْنَكُمْ فَلَيَرَوُنَّكُمْ جُلْدًا ‏\"‏ ‏.‏ فَلَمَّا دَخَلُوا الْمَسْجِدَ اسْتَلَمُوا الرُّكْنَ وَرَمَلُوا وَالنَّبِيُّ ـ صلى الله عليه وسلم ـ مَعَهُمْ حَتَّى إِذَا بَلَغُوا الرُّكْنَ الْيَمَانِيَّ مَشَوْا إِلَى الرُّكْنِ الأَسْوَدِ ثُمَّ رَمَلُوا حَتَّى بَلَغُوا الرُّكْنَ الْيَمَانِيَّ ثُمَّ مَشَوْا إِلَى الرُّكْنِ الأَسْوَدِ فَفَعَلَ ذَلِكَ ثَلاَثَ مَرَّاتٍ ثُمَّ مَشَى الأَرْبَعَ ‏.‏","english":{"narrator":"It was\nnarrated that Ibn ‘Abbas said:","text":"“During his ‘Umrah after\nHudaibiyah – when they wanted to enter Makkah – the Prophet (ﷺ)\nsaid\nto his Companions: ‘Your people will see you tomorrow, so let\nthem see\nyou looking strong.’ When they entered the mosque, they\ntouched the\ncorner and started to walk briskly, and the Prophet (ﷺ)\nwas with\nthem. When they reached the Yemenite Corner, they walked\nnormally to\nthe Black Corner (the corner where the Black Stone is),\nthen they\nwalked briskly until they reached the Yemenite Corner, then\nthey\nwalked normally to the Black Corner. They did that three times,\nthen\nthey walked normally for four circuits.”"}},{"id":73,"idInBook":73,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، وَقَبِيصَةُ، قَالاَ حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ جُرَيْجٍ، عَنْ عَبْدِ الْحَمِيدِ، عَنِ ابْنِ يَعْلَى بْنِ أُمَيَّةَ، عَنْ أَبِيهِ، يَعْلَى أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ طَافَ مُضْطَبِعًا ‏.‏ قَالَ قَبِيصَةُ وَعَلَيْهِ بُرْدٌ ‏.‏","english":{"narrator":"It was\nnarrated from Ibn Ya’la bin Umayyah that his father Ya’la\nsaid:","text":"“The Prophet (ﷺ) performed Tawaf while doing Idtiba’.”* (In\nhis narration, one of the narrators) Qabisah said: “While wearing a\nYemenite cloth.”"}},{"id":74,"idInBook":74,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، حَدَّثَنَا شَيْبَانُ، عَنْ أَشْعَثَ بْنِ أَبِي الشَّعْثَاءِ، عَنِ الأَسْوَدِ بْنِ يَزِيدَ، عَنْ عَائِشَةَ، قَالَتْ سَأَلْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ عَنِ الْحِجْرِ ‏.‏ فَقَالَ ‏\"‏ هُوَ مِنَ الْبَيْتِ ‏\"‏ ‏.‏ قُلْتُ مَا مَنَعَهُمْ أَنْ يُدْخِلُوهُ فِيهِ قَالَ ‏\"‏ عَجَزَتْ بِهِمُ النَّفَقَةُ ‏\"‏ ‏.‏ قُلْتُ فَمَا شَأْنُ بَابِهِ مُرْتَفِعًا لاَ يُصْعَدُ إِلَيْهِ إِلاَّ بِسُلَّمٍ قَالَ ‏\"‏ ذَلِكَ فِعْلُ قَوْمِكِ لِيُدْخِلُوهُ مَنْ شَاءُوا وَيَمْنَعُوهُ مَنْ شَاءُوا وَلَوْلاَ أَنَّ قَوْمَكِ حَدِيثُ عَهْدٍ بِكُفْرٍ مَخَافَةَ أَنْ تَنْفِرَ قُلُوبُهُمْ لَنَظَرْتُ هَلْ أُغَيِّرُهُ فَأُدْخِلَ فِيهِ مَا انْتَقَصَ مِنْهُ وَجَعَلْتُ بَابَهُ بِالأَرْضِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Aishah said:","text":"“I asked the Messenger of Allah\n(ﷺ)\nabout the Hijr, and he said: ‘It is part of the House.’ I said:\n‘What kept them from incorporating it into it?’ He said: ‘They\nran out\nof funds.’ I said: ‘Why is its door so high up that it\ncan only be\nreached with a ladder?’* He said: ‘That is what your\npeople did so\nthat they could let in whoever they wanted and keep out\nwhoever they\nwanted. Were it not that your people have so recently\nleft disbelief\nbehind, and I am afraid that it would bother them, I\nwould have\nchanged it, incorporating what they left out and I would\nput its door\nat ground level.”"}},{"id":75,"idInBook":75,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا مُحَمَّدُ بْنُ الْفُضَيْلِ، عَنِ الْعَلاَءِ بْنِ الْمُسَيَّبِ، عَنْ عَطَاءٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\n\"‏ مَنْ طَافَ بِالْبَيْتِ وَصَلَّى رَكْعَتَيْنِ كَانَ كَعِتْقِ رَقَبَةٍ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Abdullah bin ‘Umar said:","text":"“I heard the Messenger\nof Allah (ﷺ) say: ‘Whoever performs Tawaf around the House and\nprays\ntwo Rak’ah, it is as if he freed a slave.’”"}},{"id":76,"idInBook":76,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ، حَدَّثَنَا حُمَيْدُ بْنُ أَبِي سَوِيَّةَ، قَالَ سَمِعْتُ ابْنَ هِشَامٍ، يَسْأَلُ عَطَاءَ بْنَ أَبِي رَبَاحٍ عَنِ الرُّكْنِ الْيَمَانِيِّ، وَهُوَ يَطُوفُ بِالْبَيْتِ فَقَالَ عَطَاءٌ حَدَّثَنِي أَبُو هُرَيْرَةَ أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ وُكِلَ بِهِ سَبْعُونَ مَلَكًا فَمَنْ قَالَ اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالآخِرَةِ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ - قَالُوا آمِينَ ‏\"‏ ‏.‏ فَلَمَّا بَلَغَ الرُّكْنَ الأَسْوَدَ قَالَ يَا أَبَا مُحَمَّدٍ مَا بَلَغَكَ فِي هَذَا الرُّكْنِ الأَسْوَدِ فَقَالَ عَطَاءٌ حَدَّثَنِي أَبُو هُرَيْرَةَ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\"‏ مَنْ فَاوَضَهُ فَإِنَّمَا يُفَاوِضُ يَدَ الرَّحْمَنِ ‏\"‏ ‏.‏ قَالَ لَهُ ابْنُ هِشَامٍ يَا أَبَا مُحَمَّدٍ فَالطَّوَافُ قَالَ عَطَاءٌ حَدَّثَنِي أَبُو هُرَيْرَةَ أَنَّهُ سَمِعَ النَّبِيَّ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\"‏ مَنْ طَافَ بِالْبَيْتِ سَبْعًا وَلاَ يَتَكَلَّمُ إِلاَّ بِسُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَلاَ إِلَهَ إِلاَّ اللَّهُ وَاللَّهُ أَكْبَرُ وَلاَ حَوْلَ وَلاَقُوَّةَ إِلاَّ بِاللَّهِ مُحِيَتْ عَنْهُ عَشْرُ سِيِّئَاتٍ وَكُتِبَتْ لَهُ عَشْرُ حَسَنَاتٍ وَرُفِعَ لَهُ بِهَا عَشْرُ دَرَجَاتٍ وَمَنْ طَافَ فَتَكَلَّمَ وَهُوَ فِي تِلْكَ الْحَالِ خَاضَ فِي الرَّحْمَةِ بِرِجْلَيْهِ كَخَائِضِ الْمَاءِ بِرِجْلَيْهِ ‏\"‏ ‏.‏","english":{"narrator":"Humaid\nbin Abu Sawiyyah said:","text":"I heard Ibn Hisham asking ‘Ata’ bin Abu\nRabah about the Yemenite Corner, when he was performing Tawaf around\nthe House. ‘Ata’ said: Abu Hurairah told me that the Prophet\n(ﷺ) said: “Seventy angels have been appointed over it. Whoever\nsays: Allahumma inni as’alukal-‘afwa wal-‘afiyah fid-dunya\nwal-akhirah; Rabbana atina fid-dunya hasanah, wa fil-akhirati\nhasanah, wa qina ‘adhaban-Nar (O Allah, I ask You for pardon and\nwell-being in this world and in the Hereafter. Our Lord, give us good\nin this world and good in the Hereafter and protect us from the\ntorment of the Fire), they say: Amin.” When he reached the Black\nCorner (where the Black Stone is), he said: O Abu Muhammad! What have\nyou heard about this Black Corner? ‘Ata’ said: Abu Hurairah told\nme that he heard the Messenger of Allah (ﷺ) say: “Whoever faces\nit is facing the Hand of the Most Merciful.’”\nIbn Hisham said to him: O Abu Muhammad, what about Tawaf? ‘Ata’ said: Abu Hurairah told me that he heard the Prophet (ﷺ) say: “Whoever performs Tawaf around the House seven times and does not say anything except: Subhan Allah wal-hamdu lillah, wa la ilaha illallah wa Allahu Akbar, wa la hawla wa la quwwata illa billah (Glory is to Allah, praise is to Allah, none has the right to be worshipping but Allah, and there is no power nor strength except with Allah), ten bad deeds will be erased from him, ten merits will be recorded for him, and he will be raised ten degrees in status. Whoever performs Tawaf and talks when he is in that situation, is wading in mercy like one who wades in water.”"}},{"id":77,"idInBook":77,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنِ ابْنِ جُرَيْجٍ، عَنْ كَثِيرِ بْنِ كَثِيرِ بْنِ الْمُطَّلِبِ بْنِ أَبِي وَدَاعَةَ السَّهْمِيِّ، عَنْ أَبِيهِ، عَنِ الْمُطَّلِبِ، قَالَ رَأَيْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ إِذَا فَرَغَ مِنْ سَبْعِهِ جَاءَ حَتَّى يُحَاذِيَ بِالرُّكْنِ فَصَلَّى رَكْعَتَيْنِ فى حَاشِيَةِ الْمَطَافِ وَلَيْسَ بَيْنَهُ وَبَيْنَ الطُّوَّافِ أَحَدٌ ‏.‏ قَالَ ابْنُ مَاجَهْ هَذَا بِمَكَّةَ خَاصَّةً ‏.‏","english":{"narrator":"It was\nnarrated that Muttalib said:","text":"“When he finished seven (circuits\nof\nTawaf), I saw the Messenger of Allah (ﷺ) come until he was\nparallel\nwith the Corner, then he prayed two Rak’ah at the edge of the\nMataf\n(area for Tawaf), and there was nothing between him and the\npeople\nwho were performing Tawaf.”"}},{"id":78,"idInBook":78,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، وَعَمْرُو بْنُ عَبْدِ اللَّهِ، قَالاَ حَدَّثَنَا وَكِيعٌ، عَنْ مُحَمَّدِ بْنِ ثَابِتٍ الْعَبْدِيِّ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَدِمَ فَطَافَ بِالْبَيْتِ سَبْعًا ثُمَّ صَلَّى رَكْعَتَيْنِ - قَالَ وَكِيعٌ يَعْنِي عِنْدَ الْمَقَامِ - ثُمَّ خَرَجَ إِلَى الصَّفَا ‏.‏","english":{"narrator":"It was\nnarrated from Ibn ‘Umar that the Messenger of Allah (ﷺ) came\nand\nperformed Tawaf around the House seven times, then he prayed two\nRak’ahs. Waki’ said:","text":"“Meaning, at the Maqam,* then he went out\nto\nSafa.”"}},{"id":79,"idInBook":79,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا الْعَبَّاسُ بْنُ عُثْمَانَ الدِّمَشْقِيُّ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، عَنْ مَالِكِ بْنِ أَنَسٍ، عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ، عَنْ أَبِيهِ، عَنْ جَابِرٍ، أَنَّهُ قَالَ لَمَّا فَرَغَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ مِنْ طَوَافِ الْبَيْتِ أَتَى مَقَامَ إِبْرَاهِيمَ فَقَالَ عُمَرُ يَا رَسُولَ اللَّهِ هَذَا مَقَامُ أَبِينَا إِبْرَاهِيمَ الَّذِي قَالَ اللَّهُ سُبْحَانَهُ ‏{وَاتَّخِذُوا مِنْ مَقَامِ إِبْرَاهِيمَ مُصَلًّى}‏ ‏.‏ قَالَ الْوَلِيدُ فَقُلْتُ لِمَالِكٍ هَكَذَا قَرَأَهَا ‏{وَاتَّخِذُوا مِنْ مَقَامِ إِبْرَاهِيمَ مُصَلًّى}‏ قَالَ نَعَمْ ‏.‏","english":{"narrator":"It was\nnarrated that Jabir said:","text":"“When Allah’s Messenger (ﷺ)\nfinished\ncircumambulating the House, he came to Maqam Ibrahim. ‘Umar\nsaid:\n‘O Messenger of Allah, this is the Maqam of our father Ibrahim,\nabout which Allah says, “And take you (people) the Maqam (place) of\nIbrahim as a place of prayer.’” "}},{"id":80,"idInBook":80,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُعَلَّى بْنُ مَنْصُورٍ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، وَأَحْمَدُ بْنُ سِنَانٍ، قَالاَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، قَالاَ حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ نَوْفَلٍ، عَنْ عُرْوَةَ، عَنْ زَيْنَبَ، عَنْ أُمِّ سَلَمَةَ، أَنَّهَا مَرِضَتْ فَأَمَرَهَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ أَنْ تَطُوفَ مِنْ وَرَاءِ النَّاسِ وَهِيَ رَاكِبَةٌ ‏.‏ قَالَتْ فَرَأَيْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يُصَلِّي إِلَى الْبَيْتِ وَهُوَ يَقْرَأُ ‏{وَالطُّورِ * وَكِتَابٍ مَسْطُورٍ}‏ ‏.‏ قَالَ ابْنُ مَاجَهْ هَذَا حَدِيثُ أَبِي بَكْرٍ ‏.‏","english":{"narrator":"It was\nnarrated from Umm Salamah that she fell sick, so the Messenger\nof\nAllah (ﷺ) told her to perform Tawaf from behind the people,\nriding.\nShe said:","text":"“I saw the Messenger of Allah (ﷺ) praying facing\nthe\nHouse, and reciting: “By the Tur (Mount), And by the Book\nInscribed.’” "}},{"id":81,"idInBook":81,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَ سَمِعْتُ الْمُثَنَّى بْنَ الصَّبَّاحِ، يَقُولُ حَدَّثَنِي عَمْرُو بْنُ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ طُفْتُ مَعَ عَبْدِ اللَّهِ بْنِ عَمْرٍو فَلَمَّا فَرَغْنَا مِنَ السَّبْعِ رَكَعْنَا فِي دُبُرِ الْكَعْبَةِ فَقُلْتُ أَلاَ نَتَعَوَّذُ بِاللَّهِ مِنَ النَّارِ ‏.‏ قَالَ أَعُوذُ بِاللَّهِ مِنَ النَّارِ ‏.‏ قَالَ ثُمَّ مَضَى فَاسْتَلَمَ الرُّكْنَ ثُمَّ قَامَ بَيْنَ الْحَجَرِ وَالْبَابِ فَأَلْصَقَ صَدْرَهُ وَيَدَيْهِ وَخَدَّهُ إِلَيْهِ ثُمَّ قَالَ هَكَذَا رَأَيْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَفْعَلُ ‏.‏","english":{"narrator":"‘Amr\nbin Shu’aib narrated from his father that his grandfather said:","text":"“I\nperformed Tawaf with ‘Abdullah bin ‘Amr, and when we had finished\nseven (circuits), we prayed two Rak’ah at the back of the Ka’bah.\nI\nsaid: ‘Why do you not seek refuge with Allah from the Fire?’ He\nsaid:\n‘I seek refuge with Allah from the fire.’ Then he went and\ntouched the\nCorner, then he stood between the (Black) Stone and the\ndoor (of the\nKa’bah) and clung with his chest, hands and cheek\nagainst it. Then he\nsaid: ‘I saw the Messenger of Allah (ﷺ) do\nthis.’”"}},{"id":82,"idInBook":82,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ خَرَجْنَا مَعَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ لاَ نَرَى إِلاَّ الْحَجَّ فَلَمَّا كُنَّا بِسَرِفَ أَوْ قَرِيبًا مِنْ سَرِفَ حِضْتُ فَدَخَلَ عَلَىَّ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ وَأَنَا أَبْكِي فَقَالَ مَالَكِ أَنَفِسْتِ ‏\"‏ ‏.‏ قُلْتُ نَعَمْ ‏.‏ قَالَ ‏\"‏ إِنَّ هَذَا أَمْرٌ كَتَبَهُ اللَّهُ عَلَى بَنَاتِ آدَمَ فَاقْضِي الْمَنَاسِكَ كُلَّهَا غَيْرَ أَنْ لاَ تَطُوفِي بِالْبَيْتِ ‏\"‏ ‏.‏ قَالَتْ وَضَحَّى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنْ نِسَائِهِ بِالْبَقَرِ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Aishah said:","text":"“We went out with the Messenger of\nAllah (ﷺ), intending only to perform Hajj. When we were in Sarif or\nclose to Sarif, my menses came. The Messenger of Allah (ﷺ) entered\nupon me when I was weeping. He said: ‘What is the matter with you?\nHave your menses come?’ I said: ‘Yes.’ He said: ‘This is\nsomething\nthat Allah has decreed for the daughters of Adam. Do all\nthe rites,\nbut do not circumambulate the House.’” She said: “And\nthe Messenger of\nAllah (ﷺ) sacrificed a cow on behalf of his\nwives.”"}},{"id":83,"idInBook":83,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، وَأَبُو مُصْعَبٍ قَالاَ حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ أَفْرَدَ الْحَجَّ ‏.‏","english":{"narrator":"","text":"It was\nnarrated from ‘Aishah that the Messenger of Allah (ﷺ)\nperformed\nHajj Ifrad.*"}},{"id":84,"idInBook":84,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو مُصْعَبٍ، حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، عَنْ أَبِي الأَسْوَدِ، مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ نَوْفَلٍ - وَكَانَ يَتِيمًا فِي حِجْرِ عُرْوَةَ بْنِ الزُّبَيْرِ - عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ أَفْرَدَ الْحَجَّ ‏.‏","english":{"narrator":"","text":"It was\nnarrated from ‘Aishah the Mother of the Believers that the\nMessenger of Allah (ﷺ) performed Hajj Ifrad."}},{"id":85,"idInBook":85,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ الدَّرَاوَرْدِيُّ، وَحَاتِمُ بْنُ إِسْمَاعِيلَ، عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ، عَنْ أَبِيهِ، عَنْ جَابِرٍ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ أَفْرَدَ الْحَجَّ ‏.‏","english":{"narrator":"","text":"It was\nnarrated from Jabir that the Messenger of Allah (ﷺ)\nperformed Hajj\nIfrad (Single Hajj)."}},{"id":86,"idInBook":86,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا الْقَاسِمُ بْنُ عَبْدِ اللَّهِ الْعُمَرِيُّ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرٍ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ وَأَبَا بَكْرٍ وَعُمَرَ وَعُثْمَانَ أَفْرَدُوا الْحَجَّ ‏.‏","english":{"narrator":"","text":"It was\nnarrated from Jabir that the Messenger of Allah (ﷺ), Abu\nBakr,\n‘Umar and ‘Uthman performed Hajj Ifrad (Single Hajj)."}},{"id":87,"idInBook":87,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، حَدَّثَنَا عَبْدُ الأَعْلَى بْنُ عَبْدِ الأَعْلَى، حَدَّثَنَا يَحْيَى بْنُ أَبِي إِسْحَاقَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ إِلَى مَكَّةَ فَسَمِعْتُهُ يَقُولُ ‏\n\"‏ لَبَّيْكَ عُمْرَةً وَحَجَّةً ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Anas bin Malik said:","text":"“We went out with the\nMessenger\nof Allah (ﷺ) to Makkah, and I heard him say: ‘Labbaika\n‘Umratan\nwa hajjatan .’”"}},{"id":88,"idInBook":88,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنَا حُمَيْدٌ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ لَبَّيْكَ بِعُمْرَةٍ وَحَجَّةٍ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Anas that the Prophet (ﷺ) said:","text":"“Labbaika\nbi-‘Umratin wa hajjatin [Here I am (O Allah), for ‘Umrah and\nHajj].”"}},{"id":89,"idInBook":89,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَهِشَامُ بْنُ عَمَّارٍ، قَالاَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَبْدَةَ بْنِ أَبِي لُبَابَةَ، قَالَ سَمِعْتُ أَبَا وَائِلٍ، شَقِيقَ بْنَ سَلَمَةَ يَقُولُ سَمِعْتُ الصُّبَىَّ بْنَ مَعْبَدٍ، يَقُولُ كُنْتُ رَجُلاً نَصْرَانِيًّا فَأَسْلَمْتُ فَأَهْلَلْتُ بِالْحَجِّ وَالْعُمْرَةِ فَسَمِعَنِي سَلْمَانُ بْنُ رَبِيعَةَ وَزَيْدُ بْنُ صُوحَانَ وَأَنَا أُهِلُّ بِهِمَا جَمِيعًا بِالْقَادِسِيَّةِ فَقَالاَ لَهَذَا أَضَلُّ مِنْ بَعِيرِهِ فَكَأَنَّمَا حَمَلاَ عَلَىَّ جَبَلاً بِكَلِمَتِهِمَا فَقَدِمْتُ عَلَى عُمَرَ بْنِ الْخَطَّابِ فَذَكَرْتُ ذَلِكَ لَهُ فَأَقْبَلَ عَلَيْهِمَا فَلاَمَهُمَا ثُمَّ أَقْبَلَ عَلَىَّ فَقَالَ هُدِيتَ لِسُنَّةِ النَّبِيِّ ـ صلى الله عليه وسلم ـ هُدِيتَ لِسُنَّةِ النَّبِيِّ ـ صلى الله عليه وسلم ـ ‏.‏ قَالَ هِشَامٌ فِي حَدِيثِهِ قَالَ شَقِيقٌ: فَكَثِيرًا مَا ذَهَبْتُ أَنَا وَمَسْرُوقٌ نَسْأَلُهُ عَنْهُ ‏.‏ \n حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، وَأَبُو مُعَاوِيَةَ وَخَالِي يَعْلَى قَالُوا حَدَّثَنَا الأَعْمَشُ، عَنْ شَقِيقٍ، عَنِ الصُّبَىِّ بْنِ مَعْبَدٍ، قَالَ كُنْتُ حَدِيثَ عَهْدٍ بِنَصْرَانِيَّةٍ فَأَسْلَمْتُ فَلَمْ آلُ أَنْ أَجْتَهِدَ، فَأَهْلَلْتُ بِالْحَجِّ وَالْعُمْرَةِ ‏.‏ فَذَكَرَ نَحْوَهُ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Abdah bin Abu Lubabah said:","text":"“I heard Abu Wa’il,\nShaqiq bin Salamah, say: ‘I heard Subai bin Ma’bad say: “I was\na\nChristian man, then I became Muslim and I entered Ihram for Hajj\nand\n‘Umrah. Salman bin Rabi’ah and Zaid bin Suhan heard me when I\nwas\nentering Ihram for them both together at Qadisiyyah. They said:\n‘This\nman is more lost than his camel!’ It was as if they had\nheaped a\nmountain on me with their words. I went to ‘Umar bin\nKhattab and told\nhim about that. He turned to them and reproached\nthem, then he turned\nto me and said: ‘You have been guided to the\nSunnah of the Prophet\n(ﷺ), you have been guided to the Sunnah of\nthe Prophet (ﷺ).’”\n\nAnother chain reports a similar narration."}},{"id":90,"idInBook":90,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا حَجَّاجٌ، عَنِ الْحَسَنِ بْنِ سَعْدٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ أَخْبَرَنِي أَبُو طَلْحَةَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَرَنَ الْحَجَّ وَالْعُمْرَةَ ‏.‏","english":{"narrator":"It was\nnarrated that Ibn ‘Abbas said:","text":"“Abu Talhah told me that the\nMessenger of Allah (ﷺ) performed Hajj and ‘Umrah together\n(Qiran).”"}},{"id":91,"idInBook":91,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا يَحْيَى بْنُ يَعْلَى بْنِ حَارِثٍ الْمُحَارِبِيُّ، حَدَّثَنَا أَبِي، عَنْ غَيْلاَنَ بْنِ جَامِعٍ، عَنْ لَيْثٍ، عَنْ عَطَاءٍ، وَطَاوُسٍ، وَمُجَاهِدٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، وَابْنِ، عُمَرَ وَابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ لَمْ يَطُفْ هُوَ وَأَصْحَابُهُ لِعُمْرَتِهِمْ وَحَجَّتِهِمْ حِينَ قَدِمُوا إِلاَّ طَوَافًا وَاحِدًا ‏.‏","english":{"narrator":"","text":"It was\nnarrated from Jabir bin ‘Abdullah, Ibn ‘Umar and Ibn ‘Abbas\nthat when the Messenger of Allah (ﷺ) and his Companions came (to\nMakkah) to perform their Hajj and ‘Umrah, they only performed Tawaf\nonce."}},{"id":92,"idInBook":92,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ، حَدَّثَنَا عَبْثَرُ بْنُ الْقَاسِمِ، عَنْ أَشْعَثَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ طَافَ لِلْحَجِّ وَالْعُمْرَةِ طَوَافًا وَاحِدًا ‏.‏","english":{"narrator":"","text":"It was\nnarrated from Jabir that the Prophet (ﷺ) performed one Tawaf\nfor\nHajj and ‘Umrah."}},{"id":93,"idInBook":93,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا مُسْلِمُ بْنُ خَالِدٍ الزَّنْجِيُّ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّهُ قَدِمَ قَارِنًا فَطَافَ بِالْبَيْتِ سَبْعًا وَسَعَى بَيْنَ الصَّفَا وَالْمَرْوَةِ ثُمَّ قَالَ هَكَذَا فَعَلَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏.‏","english":{"narrator":"It was\nnarrated from Ibn ‘Umar that he came (to Makkah) to perform\nHajj\nand ‘Umrah together (Qiran). He circumambulated the House seven\ntimes, and performed Sa’y between Safa and Marwah, then he said:","text":"“This\nis what the Messenger of Allah (ﷺ) did.”"}},{"id":94,"idInBook":94,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا مُحْرِزُ بْنُ سَلَمَةَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ مَنْ أَحْرَمَ بِالْحَجِّ وَالْعُمْرَةِ كَفَى لَهُمَا طَوَافٌ وَاحِدٌ وَلَمْ يَحِلَّ حَتَّى يَقْضِيَ حَجَّهُ وَيَحِلَّ مِنْهُمَا جَمِيعًا ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Ibn ‘Umar that the Messenger of Allah (ﷺ)\nsaid:","text":"“Whoever enters Ihram for Hajj and ‘Umrah, one Tawaf is\nsufficient for both, and he should not exit Ihram until he has\ncompleted his Hajj, when he should exit Ihram for both.”"}},{"id":95,"idInBook":95,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ مُصْعَبٍ، ح وَحَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ، - يَعْنِي دُحَيْمًا - حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، قَالاَ حَدَّثَنَا الأَوْزَاعِيُّ، حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ، حَدَّثَنِي عِكْرِمَةُ، قَالَ حَدَّثَنَا ابْنُ عَبَّاسٍ، قَالَ حَدَّثَنِي عُمَرُ بْنُ الْخَطَّابِ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ وَهُوَ بِالْعَقِيقِ ‏\n\"‏ أَتَانِي آتٍ مِنْ رَبِّي فَقَالَ صَلِّ فِي هَذَا الْوَادِي الْمُبَارَكِ وَقُلْ عُمْرَةٌ فِي حَجَّةٍ ‏\"‏ ‏.‏ وَاللَّفْظُ لِدُحَيْمٍ ‏.‏","english":{"narrator":"‘Umar\nbin Khattab said:","text":"I heard the Messenger of Allah (ﷺ) say,\nwhen he\nwas in ‘Aqiq: “Someone came to me from my Lord and said: ‘Pray\nin this blessed valley and say: (I intend to do) ‘Umrah in Hajj.’”"}},{"id":96,"idInBook":96,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا وَكِيعٌ، عَنْ مِسْعَرٍ، عَنْ عَبْدِ الْمَلِكَ بْنِ مَيْسَرَةَ، عَنْ طَاوُسٍ، عَنْ سُرَاقَةَ بْنِ جُعْشُمٍ، قَالَ قَامَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ خَطِيبًا فِي هَذَا الْوَادِي فَقَالَ ‏\n\"‏ أَلاَ إِنَّ الْعُمْرَةَ قَدْ دَخَلَتْ فِي الْحَجِّ إِلَى يَوْمِ الْقِيَامَةِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Suraqah bin Ju’shum said:","text":"“The Messenger of\nAllah\n(ﷺ) stood up to deliver a speech in this valley, and said:\n‘Lo!\n‘Umrah has been included in Hajj until the Day of Resurrection.”"}},{"id":97,"idInBook":97,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنِ الْجُرَيْرِيِّ، عَنْ أَبِي الْعَلاَءِ، يَزِيدَ بْنِ الشِّخِّيرِ عَنْ أَخِيهِ، مُطَرِّفِ بْنِ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ قَالَ قَالَ لِي عِمْرَانُ بْنُ الْحُصَيْنِ إِنِّي أُحَدِّثُكَ حَدِيثًا لَعَلَّ اللَّهَ أَنْ يَنْفَعَكَ بِهِ بَعْدَ الْيَوْمِ اعْلَمْ أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَدْ أَعْمَرَ طَائِفَةً مِنْ أَهْلِهِ فِي الْعَشْرِ مِنْ ذِي الْحِجَّةِ وَلَمْ يَنْهَ عَنْهُ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ وَلَمْ يَنْزِلْ نَسْخُهُ قَالَ فِي ذَلِكَ بَعْدُ رَجُلٌ بِرَأْيِهِ مَا شَاءَ أَنْ يَقُولَ ‏.‏","english":{"narrator":"It was\nnarrated that Mutarrif bin ‘Abdullah bin Shikhkhir said:","text":"“Imran\nbin Husain said to me: ‘I will tell you a Hadith, that Allah\nmay\nbenefit you thereby after this day. Know that Allah’s Messenger\n(ﷺ) had a group from his family perform ‘Umrah during the ten\n(days)\nof Dhul-Hijjah, and the Messenger of Allah (ﷺ) did not\nforbid that,\nand no abrogation of that was revealed, and it does not\nmatter what\nanyone else suggests.’”"}},{"id":98,"idInBook":98,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ بَشَّارٍ، قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، ح وَحَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، حَدَّثَنِي أَبِي قَالاَ، حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنْ عُمَارَةَ بْنِ عُمَيْرٍ، عَنْ إِبْرَاهِيمَ بْنِ أَبِي مُوسَى، عَنْ أَبِي مُوسَى الأَشْعَرِيِّ، أَنَّهُ كَانَ يُفْتِي بِالْمُتْعَةِ فَقَالَ لَهُ رَجُلٌ رُوَيْدَكَ بَعْضَ فُتْيَاكَ فَإِنَّكَ لاَ تَدْرِي مَا أَحْدَثَ أَمِيرُ الْمُؤْمِنِينَ فِي النُّسُكِ بَعْدَكَ ‏.‏ حَتَّى لَقِيتُهُ بَعْدُ فَسَأَلْتُهُ فَقَالَ عُمَرُ قَدْ عَلِمْتُ أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ فَعَلَهُ وَأَصْحَابُهُ وَلَكِنِّي كَرِهْتُ أَنْ يَظَلُّوا بِهِنَّ مُعْرِسِينَ تَحْتَ الأَرَاكِ ثُمَّ يَرُوحُونَ بِالْحَجِّ تَقْطُرُ رُءُوسُهُمْ ‏.‏","english":{"narrator":"It was\nnarrated from Ibrahim bin Abu Musa:","text":"“Abu Musa Al-Ash’ari used\nto\nissue rulings concerning Tamattu’. Then a man said to him:\n‘Withhold some of your rulings, for you do not know what the\nCommander\nof the Believers has introduced into the rites after you.’\n(Abu Musa\nsaid:) ‘Then when I met him later on, I asked him.’\n‘Umar said: ‘I\nknow that the Messenger of Allah (ﷺ) and his\nCompanions did it, but\nI did not like that people should lie with\ntheir wives in the shade of\nthe Arak trees and then go out for Hajj\nwith their heads dripping,’\n(i.e. due to the bath after sexual\nrelations).”"}},{"id":99,"idInBook":99,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا الأَوْزَاعِيُّ، عَنْ عَطَاءٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ أَهْلَلْنَا مَعَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ بِالْحَجِّ خَالِصًا لاَ نَخْلِطُهُ بِعُمْرَةٍ فَقَدِمْنَا مَكَّةَ لأَرْبَعِ لَيَالٍ خَلَوْنَ مِنْ ذِي الْحِجَّةِ فَلَمَّا طُفْنَا بِالْبَيْتِ وَسَعَيْنَا بَيْنَ الصَّفَا وَالْمَرْوَةِ أَمَرَنَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ أَنْ نَجْعَلَهَا عُمْرَةً وَأَنْ نَحِلَّ إِلَى النِّسَاءِ ‏.‏ فَقُلْنَا مَا بَيْنَنَا لَيْسَ بَيْنَنَا وَبَيْنَ عَرَفَةَ إِلاَّ خَمْسٌ فَنَخْرُجُ إِلَيْهَا وَمَذَاكِيرُنَا تَقْطُرُ مَنِيًّا فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ إِنِّي لأَبَرُّكُمْ وَأَصْدَقُكُمْ وَلَوْلاَ الْهَدْىُ لأَحْلَلْتُ ‏\"‏ ‏.‏ فَقَالَ سُرَاقَةُ بْنُ مَالِكٍ أَمُتْعَتُنَا هَذِهِ لِعَامِنَا هَذَا أَمْ لأَبَدٍ فَقَالَ ‏\"‏ لاَ بَلْ لأَبَدِ الأَبَدِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Jabir bin ‘Abdullah said:","text":"“We began our Talbiyah\nfor Hajj only with Allah’s Messenger (ﷺ), and we did not mix it\nwith\n‘Umrah. We arrived in Makkah when four nights of Dhul-Hijjah\nhad\npassed, and when we had performed Tawaf around the Ka’bah and\nSa’y\nbetween Safa and Marwah, the Messenger of Allah (ﷺ)\ncommanded us to\nmake it ‘Umrah, and to come out of Ihram and have\nrelations with our\nwives. We said: ‘There are only five (days)\nuntil ‘Arafah. Will we g\nout to it with our male organs dripping\nwith semen?’ The Messenger of\nAllah (ﷺ) said: ‘I am the most\nrighteous and truthful among you, and\nwere it not for the sacrificial\nanimal, I would have exited Ihram.’\nSuraqah bin Malik said: ‘Is\nthis Tamattu’ for this year only or\nforever?’ He said: ‘No, it\nis forever and ever.’”"}},{"id":100,"idInBook":100,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ، قَالَتْ خَرَجْنَا مَعَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ لِخَمْسٍ بَقِينَ مِنْ ذِي الْقَعْدَةِ لاَ نُرَى إِلاَّ الْحَجَّ حَتَّى إِذَا قَدِمْنَا وَدَنَوْنَا أَمَرَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ مَنْ لَمْ يَكُنْ مَعَهُ هَدْىٌ أَنْ يَحِلَّ فَحَلَّ النَّاسُ كُلُّهُمْ إِلاَّ مَنْ كَانَ مَعَهُ هَدْىٌ فَلَمَّا كَانَ يَوْمُ النَّحْرِ دُخِلَ عَلَيْنَا بِلَحْمِ بَقَرٍ فَقِيلَ ذَبَحَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنْ أَزْوَاجِهِ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Aishah said:","text":"“We went out with the Messenger of\nAllah (ﷺ) when there were five nights left of Dhul-Qa’dah,\nintending\nonly to perform Hajj. When we came close, the Messenger of\nAllah (ﷺ)\nordered that whoever did not have a sacrificial animal,\nthen he should\nexit the Ihram. So all the people exited Ihram, except\nthose who had\nthe sacrificial animal. When the Day of Sacrifice i.e.,\nthe 10th of\nDhul-Hijjah) came, some beef was brought to\nus, and it was said: ‘The\nMessenger of Allah (ﷺ) has offered a\nsacrifice on behalf of his\nwives.’”"}},{"id":101,"idInBook":101,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، قَالَ خَرَجَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ وَأَصْحَابُهُ فَأَحْرَمْنَا بِالْحَجِّ فَلَمَّا قَدِمْنَا مَكَّةَ قَالَ ‏\"‏ اجْعَلُوا حَجَّكُمْ عُمْرَةً ‏\"‏ ‏.‏ فَقَالَ النَّاسُ يَا رَسُولَ اللَّهِ قَدْ أَحْرَمْنَا بِالْحَجِّ فَكَيْفَ نَجْعَلُهَا عُمْرَةً قَالَ ‏\"‏ انْظُرُوا مَا آمُرُكُمْ بِهِ فَافْعَلُوا ‏\"‏ ‏.‏ فَرَدُّوا عَلَيْهِ الْقَوْلَ فَغَضِبَ فَانْطَلَقَ حَتَّى دَخَلَ عَلَى عَائِشَةَ غَضْبَانَ فَرَأَتِ الْغَضَبَ فِي وَجْهِهِ فَقَالَتْ مَنْ أَغْضَبَكَ أَغْضَبَهُ اللَّهُ قَالَ ‏\"‏ وَمَالِي لاَ أَغْضَبُ وَأَنَا آمُرُ أَمْرًا فَلاَ أُتْبَعُ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Bara’ bin ‘Azib said:","text":"“The Messenger of Allah\n(ﷺ) and his Companions came out to us and we entered Ihram for\nHajj.\nWhen we came to Makkah, he said: ‘Make your Hajj (to)\n‘Umrah.’ The\npeople said: ‘O Messenger of Allah, we have\nentered Ihram for Hajj,\nhow can we make it ‘Umrah?’ He said:\n‘Look at what I command you to\ndo, and do it.’ They repeated\ntheir question and he got angry and went\naway. Then he entered upon\n‘Aishah angry and she saw anger in his\nface, and said: ‘Who has\nmade you angry? May Allah vex him!’ He said:\n‘Why should I not\nget angry, when I give a command and it is not\nobeyed?’”"}},{"id":102,"idInBook":102,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا بَكْرُ بْنُ خَلَفٍ أَبُو بِشْرٍ، حَدَّثَنَا أَبُو عَاصِمٍ، أَنْبَأَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي مَنْصُورُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أُمِّهِ، صَفِيَّةَ عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ، قَالَتْ خَرَجْنَا مَعَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ مُحْرِمِينَ فَقَالَ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏\n\"‏ مَنْ كَانَ مَعَهُ هَدْىٌ فَلْيُقِمْ عَلَى إِحْرَامِهِ وَمَنْ لَمْ يَكُنْ مَعَهُ هَدْىٌ فَلْيَحْلِلْ ‏\"‏ ‏.‏ قَالَتْ وَلَمْ يَكُنْ مَعِي هَدْىٌ فَأَحْلَلْتُ وَكَانَ مَعَ الزُّبَيْرِ هَدْىٌ فَلَمْ يَحِلَّ فَلَبِسْتُ ثِيَابِي وَجِئْتُ إِلَى الزُّبَيْرِ فَقَالَ قُومِي عَنِّي ‏.‏ فَقُلْتُ أَتَخْشَى أَنْ أَثِبَ عَلَيْكَ ‏.‏","english":{"narrator":"It was\nnarrated that Asma’ bint Abi Bakr said:","text":"“We went out with the\nMessenger of Allah (ﷺ) in Ihram. The Prophet (ﷺ) said: ‘Whoever\nhas a sacrificial animal with him, let him remain in Ihram. Whoever\ndoes not have a sacrificial animal with him, let him exit Ihram.’\nShe\nsaid: ‘I did not have a sacrificial animal with me, so I exited\nIhram,\nbut Zubair had a sacrificial animal with him, so he did not\nexit\nIhram. So I put on my regular clothes and came to Zubair, and he\nsaid:\n‘Go away from me.’ I said: ‘Are you afraid I am going to\njump on\nyou?!’”"}},{"id":103,"idInBook":103,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو مُصْعَبٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ الدَّرَاوَرْدِيُّ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنِ الْحَارِثِ بْنِ بِلاَلِ بْنِ الْحَارِثِ، عَنْ أَبِيهِ، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ أَرَأَيْتَ فَسْخَ الْحَجِّ فِي الْعُمْرَةِ لَنَا خَاصَّةً أَمْ لِلنَّاسِ عَامَّةً فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ بَلْ لَنَا خَاصَّةً ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Harith bin Bilal bin Harith, that his father\nsaid:","text":"“I\nsaid: ‘O Messenger of Allah, do you think that this\ncancellation of\nHajj and it being replaced with ‘Umrah is only for us,\nor for all\npeople?’ The Messenger of Allah (ﷺ) said: ‘No, it is only\nfor\nus.’”"}},{"id":104,"idInBook":104,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ التَّيْمِيِّ، عَنْ أَبِيهِ، عَنْ أَبِي ذَرٍّ، قَالَ كَانَتِ الْمُتْعَةُ فِي الْحَجِّ لأَصْحَابِ مُحَمَّدٍ ـ صلى الله عليه وسلم ـ خَاصَّةً ‏.‏","english":{"narrator":"It was\nnarrated that Abu Dharr said:","text":"“Tamattu’ in Hajj was for the\nCompanions of Muhammad (ﷺ) specifically.”"}},{"id":105,"idInBook":105,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، قَالَ أَخْبَرَنِي أَبِي قَالَ، قُلْتُ لِعَائِشَةَ مَا أَرَى عَلَىَّ جُنَاحًا أَنْ لاَ أَطَّوَّفَ بَيْنَ الصَّفَا وَالْمَرْوَةِ ‏.‏ قَالَتْ إِنَّ اللَّهَ يَقُولُ ‏{إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ فَمَنْ حَجَّ الْبَيْتَ أَوِ اعْتَمَرَ فَلاَ جُنَاحَ عَلَيْهِ أَنْ يَطَّوَّفَ بِهِمَا}‏ وَلَوْ كَانَ كَمَا تَقُولُ لَكَانَ فَلاَ جُنَاحَ عَلَيْهِ أَنْ لاَ يَطَّوَّفَ بِهِمَا ‏.‏ إِنَّمَا أُنْزِلَ هَذَا فِي نَاسٍ مِنَ الأَنْصَارِ كَانُوا إِذَا أَهَلُّوا أَهَلُّوا لِمَنَاةَ فَلاَ يَحِلُّ لَهُمْ أَنْ يَطَّوَّفُوا بَيْنَ الصَّفَا وَالْمَرْوَةِ فَلَمَّا قَدِمُوا مَعَ النَّبِيِّ ـ صلى الله عليه وسلم ـ فِي الْحَجِّ ذَكَرُوا ذَلِكَ لَهُ فَأَنْزَلَهَا اللَّهُ فَلَعَمْرِي مَا أَتَمَّ اللَّهُ عَزَّ وَجَلَّ حَجَّ مَنْ لَمْ يَطُفْ بَيْنَ الصَّفَا وَالْمَرْوَةِ ‏.‏","english":{"narrator":"It was\nnarrated that Hisham bin ‘Urwah said:","text":"“My father told me: ‘I\nsaid to ‘Aishah: “I do not think there is any sin on me if I do\nnot\nperform Tawaf* between Safa and Marwah.” She said: “Allah\nsays:\n‘Verily, Safa and Marwah are of the Symbols of Allah. So it\nis not a\nsin on him who performs Hajj or ‘Umrah of the House to\nperform Tawaf\nbetween them.’”  If the matter were as you\nsay, then it would\nhave said, ‘it is not a sin on him to not\nperform the Sa’y between\nthem.’ Rather this was revealed\nconcerning some people among the Ansar\nwho previously, when they\nstated the Talbiyah, they used to recite it\nfor Manat, and it was not\nlawful for them to perform Sa’y between Safa\nand Marwah. When they\narrived with the Prophet (ﷺ) for Hajj, they\nmentioned that to him,\nand Allah revealed this Verse. By Allah, Allah\nwill not accept the\nHajj as complete if one who does not perform Sa’y\nbetween Safa and\nMarwah.’”"}},{"id":106,"idInBook":106,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا هِشَامٌ الدَّسْتَوَائِيُّ، عَنْ بُدَيْلِ بْنِ مَيْسَرَةَ، عَنْ صَفِيَّةَ بِنْتِ شَيْبَةَ، عَنْ أُمِّ وَلَدِ، شَيْبَةَ قَالَتْ رَأَيْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَسْعَى بَيْنَ الصَّفَا وَالْمَرْوَةِ وَهُوَ يَقُولُ ‏\n\"‏ لاَ يُقْطَعُ الأَبْطَحُ إِلاَّ شَدًّا ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarratd that an Umm Walad* of Shaibah said:","text":"“I saw the\nMessenger of\nAllah (ﷺ) performing Sa’y between Safa and Marwah\nsaying: ‘The\nvalley should not be crossed except quickly.’”"}},{"id":107,"idInBook":107,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، وَعَمْرُو بْنُ عَبْدِ اللَّهِ، قَالاَ حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا أَبِي، عَنْ عَطَاءِ بْنِ السَّائِبِ، عَنْ كَثِيرِ بْنِ جُمْهَانَ، عَنِ ابْنِ عُمَرَ، قَالَ إِنْ أَسْعَ بَيْنَ الصَّفَا وَالْمَرْوَةِ فَقَدْ رَأَيْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَسْعَى وَإِنْ أَمْشِ فَقَدْ رَأَيْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَمْشِي وَأَنَا شَيْخٌ كَبِيرٌ ‏.‏","english":{"narrator":"It was\nnarrated that Ibn ‘Umar said:","text":"“If I go quickly between Safa\nand\nMarwah, that is because I saw the Messenger of Allah (ﷺ) going\nquickly, and if I walk that is because I saw the Messenger of Allah\n(ﷺ) walking, even though I am an old man.”"}},{"id":108,"idInBook":108,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا الْحَسَنُ بْنُ يَحْيَى الْخُشَنِيُّ، حَدَّثَنَا عُمَرُ بْنُ قَيْسٍ، أَخْبَرَنِي طَلْحَةُ بْنُ يَحْيَى، عَنْ عَمِّهِ، إِسْحَاقَ بْنِ طَلْحَةَ عَنْ طَلْحَةَ بْنِ عُبَيْدِ اللَّهِ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\n\"‏ الْحَجُّ جِهَادٌ وَالْعُمْرَةُ تَطَوُّعٌ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Talhah bin ‘Ubaidullah that he heard the\nMessenger of\nAllah (ﷺ) say:","text":"“Hajj is Jihad and ‘Umrah is voluntary.”"}},{"id":109,"idInBook":109,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا يَعْلَى، حَدَّثَنَا إِسْمَاعِيلُ، سَمِعْتُ عَبْدَ اللَّهِ بْنَ أَبِي أَوْفَى، يَقُولُ كُنَّا مَعَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ حِينَ اعْتَمَرَ فَطَافَ وَطُفْنَا مَعَهُ وَصَلَّى وَصَلَّيْنَا مَعَهُ وَكُنَّا نَسْتُرُهُ مِنْ أَهْلِ مَكَّةَ لاَ يُصِيبُهُ أَحَدٌ بِشَىْءٍ ‏.‏","english":{"narrator":"Isma’il\nnarrated:","text":"“I heard ‘Abdullah bin Abu Awfa say: ‘We were with\nthe Messenger of Allah (ﷺ) when he performed ‘Umrah. He performed\nTawaf (around the Ka’bah) and we performed Tawaf with him. He\nprayed\nand we prayed with him, and we were shielding him from the\npeople of\nMakkah lest anyone harm him.’”"}},{"id":110,"idInBook":110,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا سُفْيَانُ، عَنْ بَيَانٍ، وَجَابِرٍ، عَنِ الشَّعْبِيِّ، عَنْ وَهْبِ بْنِ خَنْبَشٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ عُمْرَةٌ فِي رَمَضَانَ تَعْدِلُ حِجَّةً ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Wahb bin Khanbash that the Messenger of Allah\n(ﷺ)\nsaid:","text":"“ ‘Umrah during Ramadan is equivalent to Hajj (i.e. in\nreward).”"}},{"id":111,"idInBook":111,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، حَدَّثَنَا سُفْيَانُ، ح وَحَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، وَعَمْرُو بْنُ عَبْدِ اللَّهِ، قَالاَ حَدَّثَنَا وَكِيعٌ، جَمِيعًا عَنْ دَاوُدَ بْنِ يَزِيدَ الزَّعَافِرِيِّ، عَنِ الشَّعْبِيِّ، عَنْ هَرِمِ بْنِ خَنْبَشٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ عُمْرَةٌ فِي رَمَضَانَ تَعْدِلُ حِجَّةً ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Harim bin Khanbash that the Messenger of Allah\n(ﷺ)\nsaid:","text":"‘ ‘Umrah during Ramadan is equivalent to Hajj (i.e., in\nreward).’”"}},{"id":112,"idInBook":112,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا جُبَارَةُ بْنُ الْمُغَلِّسِ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ عُثْمَانَ، عَنْ أَبِي إِسْحَاقَ، عَنِ الأَسْوَدِ بْنِ يَزِيدَ، عَنْ أَبِي مَعْقِلٍ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ عُمْرَةٌ فِي رَمَضَانَ تَعْدِلُ حِجَّةً ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Abu Ma’qil that the Prophet (ﷺ) said:","text":"“ ‘Umrah\nduring Ramadan is equivalent to Hajj.”"}},{"id":113,"idInBook":113,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنْ حَجَّاجٍ، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ عُمْرَةٌ فِي رَمَضَانَ تَعْدِلُ حِجَّةً ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Ibn ‘Abbas that the Messenger of Allah (ﷺ)\nsaid:","text":"“Umrah during Ramadan is equivalent to Hajj.”"}},{"id":114,"idInBook":114,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ الْمَلِكِ بْنِ وَاقِدٍ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَمْرٍو، عَنْ عَبْدِ الْكَرِيمِ، عَنْ عَطَاءٍ، عَنْ جَابِرٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ عُمْرَةٌ فِي رَمَضَانَ تَعْدِلُ حِجَّةً ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Jabir that the Prophet (ﷺ) said:","text":"“ ‘Umrah\nduring\nRamadan is equivalent to Hajj.”"}},{"id":115,"idInBook":115,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ، عَنِ ابْنِ أَبِي لَيْلَى، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ لَمْ يَعْتَمِرْ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ إِلاَّ فِي ذِي الْقَعْدَةِ ‏.‏","english":{"narrator":"","text":"It was\nnarrated from Ibn ‘Abbas that the Messenger of Allah (ﷺ) did\nnot\nperform any ‘Umrah except in Dhul-Qa’dah.”"}},{"id":116,"idInBook":116,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، عَنِ الأَعْمَشِ، عَنْ مُجَاهِدٍ، عَنْ عَائِشَةَ، قَالَتْ لَمْ يَعْتَمِرْ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عُمْرَةً إِلاَّ فِي ذِي الْقَعْدَةِ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Aishah said:","text":"“The Messenger of Allah (ﷺ) did\nnot\nperform any ‘Umrah except in Dhul-Qa’dah.”"}},{"id":117,"idInBook":117,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، عَنْ أَبِي بَكْرِ بْنِ عَيَّاشٍ، عَنِ الأَعْمَشِ، عَنْ حَبِيبٍ، - يَعْنِي ابْنَ أَبِي ثَابِتٍ - عَنْ عُرْوَةَ، قَالَ سُئِلَ ابْنُ عُمَرَ فِي أَىِّ شَهْرٍ اعْتَمَرَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ فِي رَجَبٍ ‏.‏ فَقَالَتْ عَائِشَةُ مَا اعْتَمَرَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ فِي رَجَبٍ قَطُّ وَمَا اعْتَمَرَ إِلاَّ وَهُوَ مَعَهُ - تَعْنِي ابْنَ عُمَرَ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Urwah said:","text":"“Ibn ‘Umar was asked: ‘In which\nmonth did the Messenger of Allah (ﷺ) perform ‘Umrah?’ He said:\n‘In\nRajab.’ But ‘Aishah said: “The Messenger of Allah (ﷺ)\nnever\nperformed ‘Umrah during Rajab, and he never performed ‘Umrah,\nbut he\n(meaning Ibn ‘Umar) was with him.”"}},{"id":118,"idInBook":118,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو إِسْحَاقَ الشَّافِعِيُّ إِبْرَاهِيمُ بْنُ مُحَمَّدِ بْنِ الْعَبَّاسِ بْنِ عُثْمَانَ بْنِ شَافِعٍ قَالاَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرِو بْنِ دِينَارٍ، أَخْبَرَنِي عَمْرُو بْنُ أَوْسٍ، حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ أَبِي بَكْرٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ أَمَرَهُ أَنْ يُرْدِفَ عَائِشَةَ فَيُعْمِرَهَا مِنَ التَّنْعِيمِ ‏.‏","english":{"narrator":"","text":"‘Abdur-Rahman bin Abu Bakr narrated that the Prophet (ﷺ) told him\nto seat ‘Aishah behind him on his riding animal, and perform ‘Umrah\nwith her from Tan’im."}},{"id":119,"idInBook":119,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ خَرَجْنَا مَعَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ فِي حِجَّةِ الْوَدَاعِ نُوَافِي هِلاَلَ ذِي الْحِجَّةِ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ مَنْ أَرَادَ مِنْكُمْ أَنْ يُهِلَّ بِعُمْرَةٍ فَلْيُهْلِلْ فَلَوْلاَ أَنِّي أَهْدَيْتُ لأَهْلَلْتُ بِعُمْرَةٍ ‏\"‏ ‏.‏ قَالَتْ فَكَانَ مِنَ الْقَوْمِ مَنْ أَهَلَّ بِعُمْرَةٍ وَمِنْهُمْ مَنْ أَهَلَّ بِحَجٍّ فَكُنْتُ أَنَا مِمَّنْ أَهَلَّ بِعُمْرَةٍ ‏.‏ قَالَتْ فَخَرَجْنَا حَتَّى قَدِمْنَا مَكَّةَ فَأَدْرَكَنِي يَوْمُ عَرَفَةَ وَأَنَا حَائِضٌ لَمْ أَحِلَّ مِنْ عُمْرَتِي فَشَكَوْتُ ذَلِكَ إِلَى النَّبِيِّ ـ صلى الله عليه وسلم ـ فَقَالَ ‏\"‏ دَعِي عُمْرَتَكِ وَانْقُضِي رَأْسَكِ وَامْتَشِطِي وَأَهِلِّي بِالْحَجِّ ‏\"‏ ‏.‏ قَالَتْ فَفَعَلْتُ فَلَمَّا كَانَتْ لَيْلَةُ الْحَصْبَةِ وَقَدْ قَضَى اللَّهُ حَجَّنَا أَرْسَلَ مَعِي عَبْدَ الرَّحْمَنِ بْنَ أَبِي بَكْرٍ فَأَرْدَفَنِي وَخَرَجَ إِلَى التَّنْعِيمِ فَأَهْلَلْتُ بِعُمْرَةٍ فَقَضَى اللَّهُ حَجَّنَا وَعُمْرَتَنَا وَلَمْ يَكُنْ فِي ذَلِكَ هَدْىٌ وَلاَ صَدَقَةٌ وَلاَ صَوْمٌ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Aishah said:","text":"“We went out with the Messenger of\nAllah (ﷺ) on the Farewell Pilgrimage, close to the time of the\ncrescent of Dhul-Hijjah. The Messenger of Allah (ﷺ) said: ‘Whoever\namong you wants to begin the Talbiyah for ‘Umrah, let him do so. If\nit\nwere not for the fact that I have brought a sacrificial animal\nwith\nme, I would have began the Talbiyah for ‘Umrah.’” She\nsaid: “Some of\nthe people began the Talbiyah for ‘Umrah, and some\nbegan the Talbiyah\nfor Hajj. I was one of those who began the\nTalbiyah for ‘Umrah.” She\nsaid: “We set out until we reached\nMakkah, then the Day of ‘Arafah\ncame while I was in menses, but I\ndid not exit Ihram for ‘Umrah I\ncomplained about that to the\nProphet (ﷺ) and he said: ‘Leave your\n‘Umrah, undo your hair and\ncomb it, and begin the Talbiyah for Hajj.’”\nShe said: “So I did\nthat, then on the night of Hasbah (i.e., the\ntwelfth night of\nDhul-Hijjah), when Allah had enables us to complete\nour Hajj, he sent\n‘Abdur-Rahman bin Abu Bakr with me. He seated me\nbehind him and\nwent out to Tan’im, then I began the Talbiyah for\n‘Umrah and\nAllah enabled us to complete our Hajj and ‘Umrah, and there\nwas no\nsacrificial animal, charity nor fasting.”"}},{"id":120,"idInBook":120,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ الأَعْلَى بْنُ عَبْدِ الأَعْلَى، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، حَدَّثَنِي سُلَيْمَانُ بْنُ سُحَيْمٍ، عَنْ أُمِّ حَكِيمٍ بِنْتِ أُمَيَّةَ، عَنْ أُمِّ سَلَمَةَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ مَنْ أَهَلَّ بِعُمْرَةٍ مِنْ بَيْتِ الْمَقْدِسِ غُفِرَ لَهُ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Umm Salamah that the Messenger of Allah (ﷺ)\nsaid:","text":"“Whoever begins the Talbiyah for ‘Umrah from Baitul-Maqdis, will\nbe forgiven.”"}},{"id":121,"idInBook":121,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى الْحِمْصِيُّ، حَدَّثَنَا أَحْمَدُ بْنُ خَالِدٍ، حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاقَ، عَنْ يَحْيَى بْنِ أَبِي سُفْيَانَ، عَنْ أُمِّهِ أُمِّ حَكِيمٍ بِنْتِ أُمَيَّةَ، عَنْ أُمِّ سَلَمَةَ، زَوْجِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَتْ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ مَنْ أَهَلَّ بِعُمْرَةٍ مِنْ بَيْتِ الْمَقْدِسِ كَانَتْ لَهُ كَفَّارَةً لِمَا قَبْلَهَا مِنَ الذُّنُوبِ ‏\"‏ ‏.‏ قَالَتْ فَخَرَجْتُ - أَىْ مِنْ بَيْتِ الْمَقْدِسِ - بِعُمْرَةٍ ‏.‏","english":{"narrator":"It was\nnarrated from Umm Salamah, the wife of the Prophet (ﷺ), that\nthe\nMessenger of Allah (ﷺ) said:","text":"“Whoever begins the Talbiyah for\n‘Umrah from Baitul-Maqdis, that will be an expiation for all his\nprevious sins.” She said: “So I went out.” Meaning, from\nBaitul-Maqdis\nfor ‘Umrah."}},{"id":122,"idInBook":122,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو إِسْحَاقَ الشَّافِعِيُّ، إِبْرَاهِيمُ بْنُ مُحَمَّدٍ حَدَّثَنَا دَاوُدُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ اعْتَمَرَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ أَرْبَعَ عُمَرٍ عُمْرَةَ الْحُدَيْبِيَةِ وَعُمْرَةَ الْقَضَاءِ مِنْ قَابِلٍ وَالثَّالِثَةَ مِنَ الْجِعْرَانَةِ وَالرَّابِعَةَ الَّتِي مَعَ حَجَّتِهِ ‏.‏","english":{"narrator":"It was\nnarrated that Ibn ‘Abbas said:","text":"“The Messenger of Allah (ﷺ)\nperformed ‘Umrah four times: The ‘Umrah of Hudaibiyah, the ‘Umrah\nto\nmake up for (the one not completed previously), the third from\nJi’ranah and the fourth that he did with his Hajj.”"}},{"id":123,"idInBook":123,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنْ إِسْمَاعِيلَ، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ صَلَّى بِمِنًى يَوْمَ التَّرْوِيَةِ الظُّهْرَ وَالْعَصْرَ وَالْمَغْرِبَ وَالْعِشَاءَ وَالْفَجْرَ ثُمَّ غَدَا إِلَى عَرَفَةَ ‏.‏","english":{"narrator":"","text":"It was\nnarrated from Ibn ‘Abbas that the Messenger of Allah (ﷺ)\nprayed\nin Mina, on the Day of Tarwiyah (the 8th of Dhul-Hijjah),\nZuhr,\n‘Asr, Maghrib, ‘Isha’ and Fajr, then he went in the\nmorning to\n‘Arafat."}},{"id":124,"idInBook":124,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّهُ كَانَ يُصَلِّي الصَّلَوَاتِ الْخَمْسَ بِمِنًى ثُمَّ يُخْبِرُهُمْ أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ كَانَ يَفْعَلُ ذَلِكَ ‏.‏","english":{"narrator":"","text":"It was\nnarrated from Ibn ‘Umar that he used to pray all five prayers\nin\nMina, then he would tell them that the Messenger of Allah (ﷺ)\nused\nto do that."}},{"id":125,"idInBook":125,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ إِسْرَائِيلَ، عَنْ إِبْرَاهِيمَ بْنِ مُهَاجِرٍ، عَنْ يُوسُفَ بْنِ مَاهَكَ، عَنْ أُمِّهِ، عَنْ عَائِشَةَ، قَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ أَلاَ نَبْنِي لَكَ بِمِنًى بَيْتًا قَالَ ‏\n\"‏ لاَ مِنًى مُنَاخُ مَنْ سَبَقَ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Aishah said:","text":"‘I said: ‘O Messenger of Allah,\nshould we not build you a house in Mina?’ He said: ‘No, Mina is\njust a\nstopping place for those who get there first.’”"}},{"id":126,"idInBook":126,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، وَعَمْرُو بْنُ عَبْدِ اللَّهِ، قَالاَ حَدَّثَنَا وَكِيعٌ، عَنْ إِسْرَائِيلَ، عَنْ إِبْرَاهِيمَ بْنِ مُهَاجِرٍ، عَنْ يُوسُفَ بْنِ مَاهَكَ، عَنْ أُمِّهِ، مُسَيْكَةَ عَنْ عَائِشَةَ، قَالَتْ قُلْنَا يَا رَسُولَ اللَّهِ أَلاَ نَبْنِي لَكَ بِمِنًى بُنْيَانًا يُظِلُّكَ قَالَ ‏\n\"‏ لاَ مِنًى مُنَاخُ مَنْ سَبَقَ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Aishah said:","text":"“We said: ‘O Messenger of Allah,\nshould we not build you a house in Mina that will be a means of shade\nfor you?’ He said: ‘No, Mina is just a stopping place for those\nwho\nget there first.’”"}},{"id":127,"idInBook":127,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُمَرَ الْعَدَنِيُّ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ مُحَمَّدِ بْنِ عُقْبَةَ، عَنْ مُحَمَّدِ بْنِ أَبِي بَكْرٍ، عَنْ أَنَسٍ، قَالَ غَدَوْنَا مَعَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ فِي هَذَا الْيَوْمِ مِنْ مِنًى إِلَى عَرَفَةَ فَمِنَّا مَنْ يُكَبِّرُ وَمِنَّا مَنْ يُهِلُّ فَلَمْ يَعِبْ هَذَا عَلَى هَذَا وَلاَ هَذَا عَلَى هَذَا - وَرُبَّمَا قَالَ هَؤُلاَءِ عَلَى هَؤُلاَءِ وَلاَ هَؤُلاَءِ عَلَى هَؤُلاَءِ ‏.‏","english":{"narrator":"It was\nnarrated that Anas said:","text":"“We went in the morning on this day\nwith\nthe Messenger of Allah (ﷺ) from Mina to ‘Arafat. Some of us\nrecited the Takbir (Allahu Akbar) and some of us recited the Tahlil\n(La ilaha illallah), and neither criticized the other.”"}},{"id":128,"idInBook":128,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، وَعَمْرُو بْنُ عَبْدِ اللَّهِ، قَالاَ حَدَّثَنَا وَكِيعٌ، أَنْبَأَنَا نَافِعُ بْنُ عُمَرَ الْجُمَحِيُّ، عَنْ سَعِيدِ بْنِ حَسَّانَ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ كَانَ يَنْزِلُ بِعَرَفَةَ فِي وَادِي نَمِرَةَ ‏.‏ قَالَ فَلَمَّا قَتَلَ الْحَجَّاجُ ابْنَ الزُّبَيْرِ أَرْسَلَ إِلَى ابْنِ عُمَرَ أَىَّ سَاعَةٍ كَانَ النَّبِيُّ ـ صلى الله عليه وسلم ـ يَرُوحُ فِي هَذَا الْيَوْمِ قَالَ إِذَا كَانَ ذَلِكَ رُحْنَا ‏.‏ فَأَرْسَلَ الْحَجَّاجُ رَجُلاً يَنْظُرُ إِلَى سَاعَةِ يَرْتَحِلُ ‏.‏ فَلَمَّا أَرَادَ ابْنُ عُمَرَ أَنْ يَرْتَحِلَ قَالَ أَزَاغَتِ الشَّمْسُ قَالُوا لَمْ تَزِغْ بَعْدُ ‏.‏ فَجَلَسَ ثُمَّ قَالَ أَزَاغَتِ الشَّمْسُ قَالُوا لَمْ تَزِغْ بَعْدُ ‏.‏ فَجَلَسَ ثُمَّ قَالَ أَزَاغَتِ الشَّمْسُ قَالُوا لَمْ تَزِغْ بَعْدُ ‏.‏ فَجَلَسَ ثُمَّ قَالَ أَزَاغَتِ الشَّمْسُ قَالُوا نَعَمْ ‏.‏ فَلَمَّا قَالُوا قَدْ زَاغَتِ ارْتَحَلَ ‏.‏ قَالَ وَكِيعٌ يَعْنِي رَاحَ ‏.‏","english":{"narrator":"It was\nnarrated from Ibn ‘Umar that the Messenger of Allah (ﷺ) used to\nstop at ‘Arafat in Namirah Valley. When Hajjaj killed Ibn Zubair,\nhe sent word to Ibn ‘Umar asking:","text":"“At what hour did the Prophet\n(ﷺ) go out on this day?” He said: “When that time comes, we\nwill go out.” So Hajjah sent a man to watch for the time when they\nwent out.\nWhen Ibn ‘Umar wanted to set out, he said: “Has the sun passed the zenith?” They said: “It has not passed the zenith yet.” So he sat down. Then he said: “Has the sun passed the zenith?” They said: “It has not passed the zenith yet.” So he sat down. Then he said: “Has the sun passed the zenith?” They said: “Yes.” When they said that it had passed the zenith, he set out."}},{"id":129,"idInBook":129,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، عَنْ سُفْيَانَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَيَّاشٍ، عَنْ زَيْدِ بْنِ عَلِيٍّ، عَنْ أَبِيهِ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ، عَنْ عَلِيٍّ، قَالَ وَقَفَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ بِعَرَفَةَ فَقَالَ ‏\n\"‏ هَذَا الْمَوْقِفُ وَعَرَفَةُ كُلُّهَا مَوْقِفٌ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Ali said:","text":"“The Messenger of Allah (ﷺ) stopped\nat\n‘Arafat and said: ‘This is the place of standing, and all of\n‘Arafat is a place of standing.’”"}},{"id":130,"idInBook":130,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ عَمْرِو بْنِ عَبْدِ اللَّهِ بْنِ صَفْوَانَ، عَنْ يَزِيدَ بْنِ شَيْبَانَ، قَالَ كُنَّا وُقُوفًا فِي مَكَانٍ تُبَاعِدُهُ مِنَ الْمَوْقِفِ فَأَتَانَا ابْنُ مِرْبَعٍ فَقَالَ إِنِّي رَسُولُ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ إِلَيْكُمْ يَقُولُ ‏\n\"‏ كُونُوا عَلَى مَشَاعِرِكُمْ فَإِنَّكُمُ الْيَوْمَ عَلَى إِرْثٍ مِنْ إِرْثِ إِبْرَاهِيمَ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Yazid bin Shaiban said:","text":"“We were standing in a\nplace\nthat was far from the place of standing. Ibn Mirba’ came to us\nand\nsaid: ‘I am the messenger of the Messenger of Allah (ﷺ) to you.\nHe said: “Stay where you are today for today you are on the legacy\nof\nIbrahim.’”"}},{"id":131,"idInBook":131,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا الْقَاسِمُ بْنُ عَبْدِ اللَّهِ الْعُمَرِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ الْمُنْكَدِرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ كُلُّ عَرَفَةَ مَوْقِفٌ وَارْفَعُوا عَنْ بَطْنِ عُرَنَةَ وَكُلُّ الْمُزْدَلِفَةِ مَوْقِفٌ وَارْفَعُوا عَنْ بَطْنِ مُحَسِّرٍ وَكُلُّ مِنًى مَنْحَرٌ إِلاَّ مَا وَرَاءَ الْعَقَبَةِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Jabir bin ‘Abdullah that the Messenger of Allah\n(ﷺ)\nsaid:","text":"“All of ‘Arafat is the place of standing, but keep away\nfrom the interior of ‘Uranah. And all of Muzdalifah is the place of\nstanding but keep away from the interior of Muhassir. And all of Mina\nis the place of sacrifice, except for what is beyond ‘Aqaba.”"}},{"id":132,"idInBook":132,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَيُّوبُ بْنُ مُحَمَّدٍ الْهَاشِمِيُّ، حَدَّثَنَا عَبْدُ الْقَاهِرِ بْنُ السَّرِيِّ السُّلَمِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ كِنَانَةَ بْنِ عَبَّاسِ بْنِ مِرْدَاسٍ السُّلَمِيُّ، أَنَّ أَبَاهُ، أَخْبَرَهُ عَنْ أَبِيهِ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ دَعَا لأُمَّتِهِ عَشِيَّةَ عَرَفَةَ بِالْمَغْفِرَةِ فَأُجِيبَ إِنِّي قَدْ غَفَرْتُ لَهُمْ مَا خَلاَ الظَّالِمَ فَإِنِّي آخُذُ لِلْمَظْلُومِ مِنْهُ ‏.‏ قَالَ ‏\"‏ أَىْ رَبِّ إِنْ شِئْتَ أَعْطَيْتَ الْمَظْلُومَ مِنَ الْجَنَّةِ وَغَفَرْتَ لِلظَّالِمِ ‏\"‏ ‏.‏ فَلَمْ يُجَبْ عَشِيَّتَهُ فَلَمَّا أَصْبَحَ بِالْمُزْدَلِفَةِ أَعَادَ الدُّعَاءَ فَأُجِيبَ إِلَى مَا سَأَلَ ‏.‏ قَالَ فَضَحِكَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏.‏ أَوْ قَالَ تَبَسَّمَ ‏.‏ فَقَالَ لَهُ أَبُو بَكْرٍ وَعُمَرُ بِأَبِي أَنْتَ وَأُمِّي إِنَّ هَذِهِ لَسَاعَةٌ مَا كُنْتَ تَضْحَكُ فِيهَا فَمَا الَّذِي أَضْحَكَكَ أَضْحَكَ اللَّهُ سِنَّكَ قَالَ ‏\"‏ إِنَّ عَدُوَّ اللَّهِ إِبْلِيسَ لَمَّا عَلِمَ أَنَّ اللَّهَ عَزَّ وَجَلَّ قَدِ اسْتَجَابَ دُعَائِي وَغَفَرَ لأُمَّتِي أَخَذَ التُّرَابَ فَجَعَلَ يَحْثُوهُ عَلَى رَأْسِهِ وَيَدْعُو بِالْوَيْلِ وَالثُّبُورِ فَأَضْحَكَنِي مَا رَأَيْتُ مِنْ جَزَعِهِ ‏\"‏ ‏.‏","english":{"narrator":"‘Abdullah bin Kinanah bin ‘Abbas bin Mirdas As-Sulami narrated\nthat\nhis father told him, from his father, that the Messenger of\nAllah\n(ﷺ) prayed for forgiveness for his nation one evening at\n‘Arafat,\nand the response came:","text":"“I have forgiven them, except for\nthe\nwrongdoer, with whom I will settle the score in favor of the one\nwhom\nhe wronged.” He said: “O Lord, if You will, then grant\nParadise to the\none who is wronged, and forgive the wrongdoer.” No\nresponse came (that\nevening).The next day at Muzdalifah he repeated\nthe supplication, and\nreceived a response to what he asked for. He\n(the narrator) said: “The\nMessenger of Allah (ﷺ) laughed,” or\nhe said, “He smiled. Abu Bakr\nand ‘Umar said to him: ‘May my\nfather and mother be ransomed for you,\nthis is not a time when you\nusually laugh. What made you laugh, may\nAllah make your years filled\nwith laughter?’ He said: ‘The enemy of\nAllah, Iblis, when he came\nto know that Allah answered my prayer and\nforgiven my nation, took\nsome dust and started to sprinkle it on his\nhead, uttering cries of\nwoe and doom, and what I saw of his anguish\nmade me laugh.’”"}},{"id":133,"idInBook":133,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الْمِصْرِيُّ أَبُو جَعْفَرٍ، أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي مَخْرَمَةُ بْنُ بُكَيْرٍ، عَنْ أَبِيهِ، قَالَ سَمِعْتُ يُونُسَ بْنَ يُوسُفَ، يَقُولُ عَنِ ابْنِ الْمُسَيَّبِ، قَالَ قَالَتْ عَائِشَةُ إِنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ مَا مِنْ يَوْمٍ أَكْثَرَ مِنْ أَنْ يُعْتِقَ اللَّهُ عَزَّ وَجَلَّ فِيهِ عَبْدًا مِنَ النَّارِ مِنْ يَوْمِ عَرَفَةَ وَإِنَّهُ لَيَدْنُو عَزَّ وَجَلَّ ثُمَّ يُبَاهِي بِهِمُ الْمَلاَئِكَةَ فَيَقُولُ مَا أَرَادَ هَؤُلاَءِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Ibn Musayyab that ‘Aishah said that the\nMessenger of\nAllah (ﷺ) said:","text":"“There is no day on which Allah ransoms\nmore\nslaves from the Fire than the Day of ‘Arafah. He draws closer and\ncloser, then He boasts about them before the angels and says: ‘What\ndo\nthese people want?’”"}},{"id":134,"idInBook":134,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا سُفْيَانُ، عَنْ بُكَيْرِ بْنِ عَطَاءٍ، سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ يَعْمُرَ الدِّيلِيَّ، قَالَ شَهِدْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ وَهُوَ وَاقِفٌ بِعَرَفَةَ وَأَتَاهُ نَاسٌ مِنْ أَهْلِ نَجْدٍ فَقَالُوا يَا رَسُولَ اللَّهِ كَيْفَ الْحَجُّ قَالَ ‏\n\"‏ الْحَجُّ عَرَفَةُ فَمَنْ جَاءَ قَبْلَ صَلاَةِ الْفَجْرِ لَيْلَةَ جَمْعٍ فَقَدْ تَمَّ حَجُّهُ أَيَّامُ مِنًى ثَلاَثَةٌ فَمَنْ تَعَجَّلَ فِي يَوْمَيْنِ فَلاَ إِثْمَ عَلَيْهِ وَمَنْ تَأَخَّرَ فَلاَ إِثْمَ عَلَيْهِ ‏\"‏ ‏.‏ ثُمَّ أَرْدَفَ رَجُلاً خَلْفَهُ فَجَعَلَ يُنَادِي بِهِنَّ ‏.‏ \nحَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَنْبَأَنَا الثَّوْرِيُّ، عَنْ بُكَيْرِ بْنِ عَطَاءٍ اللَّيْثِيِّ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَعْمُرَ الدِّيلِيِّ، قَالَ أَتَيْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ بِعَرَفَةَ فَجَاءَهُ نَفَرٌ مِنْ أَهْلِ نَجْدٍ فَذَكَرَ نَحْوَهُ ‏.‏ قَالَ مُحَمَّدُ بْنُ يَحْيَى مَا أُرَى لِلثَّوْرِيِّ حَدِيثًا أَشْرَفَ مِنْهُ ‏.‏","english":{"narrator":"Sufyan\nbin Bukair bin ‘Ata’ said:","text":"“I heard ‘Abdur-Rahman bin Ya’mur\nDili say: ‘I saw the Messenger of Allah (ﷺ) when he was standing\nat\n‘Arafat, and some people from Najd came to him and said: “O\nMessenger\nof Allah, what is Hajj?” He said: “Hajj is ‘Arafah.\nWhoever comes\nbefore Fajr prayer on the night of Jam’, he has\ncompleted his Hajj.\nThe days at Mina are three. ‘But whosoever\nhastens to leave in two\ndays, there is no sin on him and whosoever\nstays on, there is no sin\non him.’”  Then he seated a man\nbehind him on his mount and he\nstarted calling out these words.’”\n\nAnother chain reports a similar hadith."}},{"id":135,"idInBook":135,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ أَبِي خَالِدٍ، عَنْ عَامِرٍ، - يَعْنِي الشَّعْبِيَّ - عَنْ عُرْوَةَ بْنِ مُضَرِّسٍ الطَّائِيِّ، أَنَّهُ حَجَّ عَلَى عَهْدِ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ فَلَمْ يُدْرِكِ النَّاسَ إِلاَّ وَهُمْ بِجَمْعٍ ‏.‏ قَالَ فَأَتَيْتُ النَّبِيَّ ـ صلى الله عليه وسلم ـ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي أَنْضَيْتُ رَاحِلَتِي وَأَتْعَبْتُ نَفْسِي وَاللَّهِ إِنْ تَرَكْتُ مِنْ حَبْلٍ إِلاَّ وَقَفْتُ عَلَيْهِ فَهَلْ لِي مِنْ حَجٍّ فَقَالَ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏\n\"‏ مَنْ شَهِدَ مَعَنَا الصَّلاَةَ وَأَفَاضَ مِنْ عَرَفَاتٍ لَيْلاً أَوْ نَهَارًا فَقَدْ قَضَى تَفَثَهُ وَتَمَّ حَجُّهُ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from ‘Urwah bin Mudarris At-Ta’i that he performed\nHajj\nduring the time of the Messenger of Allah (ﷺ), and he did not\ncatch\nup with the people until they were at Jam’ (Al-Muzdalifah). He\nsaid:","text":"“I came to the Prophet (ﷺ) and said: ‘O Messenger of\nAllah, I\nhave made my camel lean (because of the long journey) and I\nhave worn\nmyself out. By Allah, there is no sand hill on which I did\nnot stand.\nHave I performed Hajj?’ The Prophet (ﷺ) said: ‘Whoever\nattended the\nprayer (i.e., Fajr at Muzdalifah) with us and departed\nfrom ‘Arafat,\nby night or day, may remove the dirt and has\ncompleted his Hajj.’”"}},{"id":136,"idInBook":136,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، وَعَمْرُو بْنُ عَبْدِ اللَّهِ، قَالاَ حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ أُسَامَةَ بْنِ زَيْدٍ، أَنَّهُ سُئِلَ كَيْفَ كَانَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ يَسِيرُ حِينَ دَفَعَ مِنْ عَرَفَةَ قَالَ كَانَ يَسِيرُ الْعَنَقَ فَإِذَا وَجَدَ فَجْوَةً نَصَّ ‏.‏ قَالَ وَكِيعٌ وَالنَّصُّ يَعْنِي فَوْقَ الْعَنَقِ ‏.‏","english":{"narrator":"It was\nnarrated from Usamah bin Zaid that he was asked:","text":"“How did the\nMessenger of Allah (ﷺ) travel when he departed from ‘Arafat?”\nHe\nsaid: “He moved at a quick pace, and when he reached an open\nspace he\nwould make his camel run.”"}},{"id":137,"idInBook":137,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَنْبَأَنَا الثَّوْرِيُّ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ قَالَتْ قُرَيْشٌ نَحْنُ قَوَاطِنُ الْبَيْتِ لاَ نُجَاوِزُ الْحَرَمَ ‏.‏ فَقَالَ اللَّهُ عَزَّ وَجَلَّ ‏{ثُمَّ أَفِيضُوا مِنْ حَيْثُ أَفَاضَ النَّاسُ }‏ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Aishah said:","text":"“The Quraish said: ‘We are the\nneighbors of the House and we do not leave the sanctuary.’ Allah\nsaid:\n‘Then depart from the place whence all the people depart.’”\n"}},{"id":138,"idInBook":138,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا سُفْيَانُ، عَنْ إِبْرَاهِيمَ بْنِ عُقْبَةَ، عَنْ كُرَيْبٍ، عَنْ أُسَامَةَ بْنِ زَيْدٍ، قَالَ أَفَضْتُ مَعَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ فَلَمَّا بَلَغَ الشِّعْبَ الَّذِي يَنْزِلُ عِنْدَهُ الأُمَرَاءُ نَزَلَ فَبَالَ وَتَوَضَّأَ قُلْتُ الصَّلاَةَ ‏.‏ قَالَ ‏\n\"‏ الصَّلاَةُ أَمَامَكَ ‏\"‏ ‏.‏ فَلَمَّا انْتَهَى إِلَى جَمْعٍ أَذَّنَ وَأَقَامَ ثُمَّ صَلَّى الْمَغْرِبَ ثُمَّ لَمْ يَحِلَّ أَحَدٌ مِنَ النَّاسِ حَتَّى قَامَ فَصَلَّى الْعِشَاءَ ‏.‏","english":{"narrator":"It was\nnarrated that Usamah bin Zaid said:","text":"“I departed from ‘Arafat\nwith\nthe Messenger of Allah (ﷺ), and when he reached the mountain\npath\nat which the chiefs would dismount, he dismounted and urinated,\nthen\nperformed ablution. I said: ‘(Is it time for) prayer?’ He said:\n‘The prayer is still ahead of you.’ When he reached Jam’\n(Muzdalifah)\nhe called the Adhan and Iqamah, then he prayed Maghrib.\nThen no one\namong the people unloaded (the camels) until he had\nprayed ‘Isha’.”"}},{"id":139,"idInBook":139,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَدِيِّ بْنِ ثَابِتٍ الأَنْصَارِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ الْخَطْمِيِّ، أَنَّهُ سَمِعَ أَبَا أَيُّوبَ الأَنْصَارِيَّ، يَقُولُ صَلَّيْتُ مَعَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ الْمَغْرِبَ وَالْعِشَاءَ فِي حِجَّةِ الْوَدَاعِ بِالْمُزْدَلِفَةِ ‏.‏","english":{"narrator":"It was\nnarrated from ‘Abdullah bin Yazid Al-Khatmi that he heard Abu\nAyyub\nAl-Ansari say:","text":"“I prayed Maghrib and ‘Isha’ with the Messenger\nof Allah (ﷺ) during the Farewell Pilgrimage, at Muzdalifah.”"}},{"id":140,"idInBook":140,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا مُحْرِزُ بْنُ سَلَمَةَ الْعَدَنِيُّ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، عَنْ عُبَيْدِ اللَّهِ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ صَلَّى الْمَغْرِبَ بِالْمُزْدَلِفَةِ فَلَمَّا أَنَخْنَا قَالَ ‏\n\"‏ الصَّلاَةُ بِإِقَامَةٍ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from ‘Ubaidullah, from Salim, from his father, that\nthe\nProphet (ﷺ) prayed Maghrib at Muzdalifah. When we halted he\nsaid:","text":"“Prayer should be done with Iqamah.”"}},{"id":141,"idInBook":141,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو خَالِدٍ الأَحْمَرُ، عَنْ حَجَّاجٍ، عَنْ أَبِي إِسْحَاقَ، عَنْ عَمْرِو بْنِ مَيْمُونٍ، قَالَ حَجَجْنَا مَعَ عُمَرَ بْنِ الْخَطَّابِ فَلَمَّا أَرَدْنَا أَنْ نُفِيضَ، مِنَ الْمُزْدَلِفَةِ قَالَ إِنَّ الْمُشْرِكِينَ كَانُوا يَقُولُونَ أَشْرِقْ ثَبِيرُ كَيْمَا نُغِيرُ ‏.‏ وَكَانُوا لاَ يُفِيضُونَ حَتَّى تَطْلُعَ الشَّمْسُ فَخَالَفَهُمْ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ فَأَفَاضَ قَبْلَ طُلُوعِ الشَّمْسِ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Amr bin Maimun said:","text":"“We performed Hajj with\n‘Umar\nbin Khattab, and when we wanted to depart from Muzdalifah, he\nsaid:\n‘The idolators used to say: “May the sun rise over you, O\nThabir!* So that we may begin our journey (to Mina),” and they did\nnot\ndepart until the sun had risen.’ So the Messenger of Allah\n(ﷺ)\ndiffered from them by departing before the sun rose.”"}},{"id":142,"idInBook":142,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ رَجَاءٍ الْمَكِّيُّ، عَنِ الثَّوْرِيِّ، قَالَ قَالَ أَبُو الزُّبَيْرِ قَالَ جَابِرٌ أَفَاضَ النَّبِيُّ ـ صلى الله عليه وسلم ـ فِي حَجَّةِ الْوَدَاعِ وَعَلَيْهِ السَّكِينَةُ وَأَمَرَهُمْ بِالسَّكِينَةِ وَأَمَرَهُمْ أَنْ يَرْمُوا بِمِثْلِ حَصَى الْخَذْفِ وَأَوْضَعَ فِي وَادِي مُحَسِّرٍ ‏.‏ وَقَالَ ‏\n\"‏ لِتَأْخُذْ أُمَّتِي نُسُكَهَا فَإِنِّي لاَ أَدْرِي لَعَلِّي لاَ أَلْقَاهُمْ بَعْدَ عَامِي هَذَا ‏\"‏ ‏.‏","english":{"narrator":"Jabir\nsaid:","text":"“The Messenger of Allah (ﷺ) departed during the\nFarewell\nPilgrimage in a tranquil manner, and he urged them to be\ntranquil. He\ntold them to throw small pebbles. He hastened through\nMuhassir\nValley, and said: ‘Let my nation learn its rites (of Hajj),\nfor I\ndo not know, perhaps I will not meet them again after this\nyear.’”"}},{"id":143,"idInBook":143,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، وَعَمْرُو بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا ابْنُ أَبِي رَوَّادٍ، عَنْ أَبِي سَلَمَةَ الْحِمْصِيِّ، عَنْ بِلاَلِ بْنِ رَبَاحٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ لَهُ غَدَاةَ جَمْعٍ ‏\"‏ يَا بِلاَلُ أَسْكِتِ النَّاسَ ‏\"‏ ‏.‏ أَوْ ‏\"‏ أَنْصِتِ النَّاسَ ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ إِنَّ اللَّهَ تَطَوَّلَ عَلَيْكُمْ فِي جَمْعِكُمْ هَذَا فَوَهَبَ مُسِيئَكُمْ لِمُحْسِنِكُمْ وَأَعْطَى مُحْسِنَكُمْ مَا سَأَلَ ادْفَعُوا بِاسْمِ اللَّهِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Bilal bin Rabah that the Prophet (ﷺ) said to\nhim, on\nthe morning of Jama’:","text":"“O Bilal, calm the people down,” or\n“make\nthem be quiet.” Then he said: “Allah has been very gracious to\nyou in this Jam’ of yours. He has forgiven the wrongdoers among you\nbecause of the righteous among you, and He has given the righteous\namong you whatever they ask. Move on in the Name of Allah.”"}},{"id":144,"idInBook":144,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا مِسْعَرٌ، وَسُفْيَانُ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، عَنِ الْحَسَنِ الْعُرَنِيِّ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَدَّمَنَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ أُغَيْلِمَةَ بَنِي عَبْدِ الْمُطَّلِبِ عَلَى حُمُرَاتٍ لَنَا مِنْ جَمْعٍ فَجَعَلَ يَلْطَحُ أَفْخَاذَنَا وَيَقُولُ ‏\"‏ أُبَيْنِيَّ لاَ تَرْمُوا الْجَمْرَةَ حَتَّى تَطْلُعَ الشَّمْسُ ‏\"‏ ‏.‏ زَادَ سُفْيَانُ فِيهِ ‏\"‏ وَلاَ إِخَالُ أَحَدًا يَرْمِيهَا حَتَّى تَطْلُعَ الشَّمْسُ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Ibn ‘Abbas said:","text":"“We youngsters from the clan of\n‘Abdul-Muttalib came to the Messenger of Allah (ﷺ), from Jam’,\non donkeys of ours. He started striking our thighs and saying: ‘O\nmy sons, do not stone the Pillar until the sun rises.’”"}},{"id":145,"idInBook":145,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا عَمْرٌو، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كُنْتُ فِيمَنْ قَدَّمَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ فِي ضَعَفَةِ أَهْلِهِ ‏.‏","english":{"narrator":"It was\nnarrated that Ibn ‘Abbas said:","text":"“I was among the weak ones of\nhis\nfamily (i.e., the women and children) whom the Messenger of Allah\n(ﷺ) sent on ahead.”"}},{"id":146,"idInBook":146,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ سَوْدَةَ بِنْتَ زَمْعَةَ، كَانَتِ امْرَأَةً ثَبِطَةً فَاسْتَأْذَنَتْ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ أَنْ تَدْفَعَ مِنْ جَمْعٍ قَبْلَ دُفْعَةِ النَّاسِ فَأَذِنَ لَهَا ‏.‏","english":{"narrator":"","text":"It was\nnarrated from ‘Aishah that Sawdah bint Zam’ah was a slow-\nmoving\nwoman, so she asked the Messenger of Allah (ﷺ) for permission\nto\ndepart from Jam’ ahead of the people, and he gave her permission."}},{"id":147,"idInBook":147,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ، عَنْ سُلَيْمَانَ بْنِ عَمْرِو بْنِ الأَحْوَصِ، عَنْ أُمِّهِ، قَالَتْ رَأَيْتُ النَّبِيَّ ـ صلى الله عليه وسلم ـ يَوْمَ النَّحْرِ عِنْدَ جَمْرَةِ الْعَقَبَةِ وَهُوَ رَاكِبٌ عَلَى بَغْلَةٍ فَقَالَ ‏\n\"‏ يَا أَيُّهَا النَّاسُ إِذَا رَمَيْتُمُ الْجَمْرَةَ فَارْمُوا بِمِثْلِ حَصَى الْخَذْفِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Sulaiman bin ‘Amr bin Ahwas that his mother\nsaid:","text":"“I\nsaw the Prophet (saw0 on the Day of Sacrifice, at ‘Aqabah\nPillar,\nriding a mule. He said: ‘O people! When you stone the Pillar,\nthrow\nsmall pebbles.’”"}},{"id":148,"idInBook":148,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ عَوْفٍ، عَنْ زِيَادِ بْنِ الْحُصَيْنِ، عَنْ أَبِي الْعَالِيَةِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ غَدَاةَ الْعَقَبَةِ وَهُوَ عَلَى نَاقَتِهِ ‏\"‏ الْقُطْ لِي حَصًى ‏\"‏ ‏.‏ فَلَقَطْتُ لَهُ سَبْعَ حَصَيَاتٍ هُنَّ حَصَى الْخَذْفِ فَجَعَلَ يَنْفُضُهُنَّ فِي كَفِّهِ وَيَقُولُ ‏\"‏ أَمْثَالَ هَؤُلاَءِ فَارْمُوا ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ يَا أَيُّهَا النَّاسُ إِيَّاكُمْ وَالْغُلُوَّ فِي الدِّينِ فَإِنَّمَا أَهْلَكَ مَنْ كَانَ قَبْلَكُمُ الْغُلُوُّ فِي الدِّينِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Ibn ‘Abbas said:","text":"“On the morning of ‘Aqabah,\nwhen\nhe was atop his she-camel, the Messenger of Allah (ﷺ) said:\n‘Pick\nup some pebbles for me.’ So I picked up seven pebbles for him,\nsuitable for Khadhf.* He began to toss them in his hand, saying:\n‘Throw something like these.’ Then he said: ‘O people, beware\nof\nexaggeration in religious matters for those who came before you\nwere\ndoomed because of exaggeration in religious matters.’”"}},{"id":149,"idInBook":149,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنِ الْمَسْعُودِيِّ، عَنْ جَامِعِ بْنِ شَدَّادٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ، قَالَ لَمَّا أَتَى عَبْدُ اللَّهِ بْنُ مَسْعُودٍ جَمْرَةَ الْعَقَبَةِ اسْتَبْطَنَ الْوَادِيَ وَاسْتَقْبَلَ الْكَعْبَةَ وَجَعَلَ الْجَمْرَةَ عَلَى حَاجِبِهِ الأَيْمَنِ ثُمَّ رَمَى بِسَبْعِ حَصَيَاتٍ يُكَبِّرُ مَعَ كُلِّ حَصَاةٍ ثُمَّ قَالَ مِنْ هَاهُنَا وَالَّذِي لاَ إِلَهَ غَيْرُهُ رَمَى الَّذِي أُنْزِلَتْ عَلَيْهِ سُورَةُ الْبَقَرَةِ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Abdur-Rahman bin Yazid said:","text":"“When ‘Abdullah\nbin\nMas’ud stoned ‘Aqabah Pillar, he went to the bottom of the valley\nand turned to face the Ka’bah, with the Pillar on his right hand\nside.\nThen he threw seven pebbles, saying the Takbir with each one.\nThen he\nsaid: ‘From here, by the One besides Whom there is none\nworthy of\nworship, did the one throw, to whom Surat Al-Baqarah was\nrevealed.’”"}},{"id":150,"idInBook":150,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ، عَنْ سُلَيْمَانَ بْنِ عَمْرِو بْنِ الأَحْوَصِ، عَنْ أُمِّهِ، قَالَتْ رَأَيْتُ النَّبِيَّ ـ صلى الله عليه وسلم ـ يَوْمَ النَّحْرِ عِنْدَ جَمْرَةِ الْعَقَبَةِ اسْتَبْطَنَ الْوَادِيَ فَرَمَى الْجَمْرَةَ بِسَبْعِ حَصَيَاتٍ يُكَبِّرُ مَعَ كُلِّ حَصَاةٍ ثُمَّ انْصَرَفَ ‏.‏ \n حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ، عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ، عَنْ سُلَيْمَانَ بْنِ عَمْرِو بْنِ الأَحْوَصِ، عَنْ أُمِّ جُنْدُبٍ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ بِنَحْوِهِ ‏.‏","english":{"narrator":"It was\nnarrated from Sulaiman bin ‘Amr bin Ahwas that his mother\nsaid:","text":"“I\nsaw the Prophet (ﷺ) on the Day of Sacrifice, at ‘Aqabah\nPillar.\nHe went to the interior of the valley and threw seven pebbles,\nsaying\nTakbir with each pebble, then he departed.”\n\nAnother chain reports a similar hadith."}},{"id":151,"idInBook":151,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا طَلْحَةُ بْنُ يَحْيَى، عَنْ يُونُسَ بْنِ يَزِيدَ، عَنِ الزُّهْرِيِّ، عَنِ سَالِمٍ، عَنِ ابْنِ عُمَرَ، أَنَّهُ رَمَى جَمْرَةَ الْعَقَبَةِ وَلَمْ يَقِفْ عِنْدَهَا وَذَكَرَ أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ فَعَلَ مِثْلَ ذَلِكَ ‏.‏","english":{"narrator":"","text":"It was\nnarrated that Ibn ‘Umar stoned ‘Aqabah Pillar, but he did not\nstay there, and he mentioned that the Prophet (ﷺ) had done\nlikewise."}},{"id":152,"idInBook":152,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنِ الْحَجَّاجِ، عَنِ الْحَكَمِ بْنِ عُتَيْبَةَ، عَنْ مِقْسَمٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ إِذَا رَمَى جَمْرَةَ الْعَقَبَةِ مَضَى وَلَمْ يَقِفْ ‏.‏","english":{"narrator":"It was\nnarrated that Ibn ‘Abbas said:","text":"“When the Messenger of Allah\n(ﷺ)\nhad stoned ‘Aqabah Pillar, he would continue on, and would not\nstay\nthere.”"}},{"id":153,"idInBook":153,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو خَالِدٍ الأَحْمَرُ، عَنْ حَجَّاجٍ، عَنِ الْحَكَمِ، عَنْ مِقْسَمٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ رَمَى الْجَمْرَةَ عَلَى رَاحِلَتِهِ ‏.‏","english":{"narrator":"","text":"It was\nnarrated from Ibn ‘Abbas that the Prophet (ﷺ) stoned the\nPillar\nfrom atop his mount."}},{"id":154,"idInBook":154,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ أَيْمَنَ بْنِ نَابِلٍ، عَنْ قُدَامَةَ بْنِ عَبْدِ اللَّهِ الْعَامِرِيِّ، قَالَ رَأَيْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ رَمَى الْجَمْرَةَ يَوْمَ النَّحْرِ عَلَى نَاقَةٍ لَهُ صَهْبَاءَ لاَ ضَرْبَ وَلاَ طَرْدَ وَلاَ إِلَيْكَ إِلَيْكَ ‏.‏","english":{"narrator":"It was\nnarrated that Qudamah bin ‘Abdullah Al-‘Amiri said:","text":"“I saw the\nProphet (ﷺ) stone the Pillar, on the Day of Sacrifice, from atop a\nreddish-brown camel of his, without beating anyone, driving them off\nor telling them to go away.”"}},{"id":155,"idInBook":155,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي بَكْرٍ، عَنْ أَبِي الْبَدَّاحِ بْنِ عَاصِمٍ، عَنْ أَبِيهِ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ رَخَّصَ لِلرِّعَاءِ أَنْ يَرْمُوا يَوْمًا وَيَدَعُوا يَوْمًا ‏.‏","english":{"narrator":"","text":"It was\nnarrated from Abu Baddah bin ‘Asim, from his father, that the\nProphet (ﷺ) granted permission for some shepherds to stone one day\nand to not stone (the next) day."}},{"id":156,"idInBook":156,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَنْبَأَنَا مَالِكُ بْنُ أَنَسٍ، ح وَحَدَّثَنَا أَحْمَدُ بْنُ سِنَانٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنْ مَالِكِ بْنِ أَنَسٍ، حَدَّثَنِي عَبْدُ اللَّهِ بْنُ أَبِي بَكْرٍ، عَنْ أَبِيهِ، عَنْ أَبِي الْبَدَّاحِ بْنِ عَاصِمٍ، عَنْ أَبِيهِ، قَالَ رَخَّصَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ لِرِعَاءِ الإِبِلِ فِي الْبَيْتُوتَةِ أَنْ يَرْمُوا يَوْمَ النَّحْرِ ثُمَّ يَجْمَعُوا رَمْىَ يَوْمَيْنِ بَعْدَ النَّحْرِ فَيَرْمُونَهُ فِي أَحَدِهِمَا - قَالَ مَالِكٌ ظَنَنْتُ أَنَّهُ قَالَ فِي الأَوَّلِ مِنْهُمَا - ثُمَّ يَرْمُونَ يَوْمَ النَّفْرِ ‏.‏","english":{"narrator":"It was\nnarrated from Abu Baddah bin ‘Asim that his father said:","text":"“The\nMessenger of Allah (ﷺ) granted permission to some camel herders\nregarding staying (in Mina),* and allowing them to stone the Pillars\non the Day of Sacrifice, then to combine the stoning of two days\nafter\nthe sacrifice, so that they could do it on one of the two\ndays.”**\nMalik said: “I think that he said: ‘On the first of\nthe first of the\ntwo days, then they could stone them on the day of\ndeparture (from\nMina).’”"}},{"id":157,"idInBook":157,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، عَنْ أَشْعَثَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ حَجَجْنَا مَعَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ وَمَعَنَا النِّسَاءُ وَالصِّبْيَانُ فَلَبَّيْنَا عَنِ الصِّبْيَانِ وَرَمَيْنَا عَنْهُمْ ‏.‏","english":{"narrator":"It was\nnarrated that Jabir said:","text":"“We performed Hajj with the\nMessenger of\nAllah (ﷺ), and there were women and children with us.\nWe recited\nTalbiyah on behalf of the children and stoned the Pillars\non their\nbehalf.”"}},{"id":158,"idInBook":158,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا بَكْرُ بْنُ خَلَفٍ أَبُو بِشْرٍ، حَدَّثَنَا حَمْزَةُ بْنُ الْحَارِثِ بْنِ عُمَيْرٍ، عَنْ أَبِيهِ، عَنْ أَيُّوبَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ لَبَّى حَتَّى رَمَى جَمْرَةَ الْعَقَبَةِ ‏.‏","english":{"narrator":"","text":"It was\nnarrated from Ibn ‘Abbas that the Prophet (ﷺ) recited\nTalbiyah\nuntil he stoned ‘Aqabah Pillar."}},{"id":159,"idInBook":159,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ خُصَيْفٍ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ الْفَضْلُ بْنُ عَبَّاسٍ كُنْتُ رِدْفَ النَّبِيِّ ـ صلى الله عليه وسلم ـ فَمَا زِلْتُ أَسْمَعُهُ يُلَبِّي حَتَّى رَمَى جَمْرَةَ الْعَقَبَةِ فَلَمَّا رَمَاهَا قَطَعَ التَّلْبِيَةَ ‏.‏","english":{"narrator":"It was\nnarrated that Ibn ‘Abbas said:","text":"“Fadl bin ‘Abbas said: ‘I was\nriding behind the Prophet (ﷺ) and I continued to hear him reciting\nthe Talbiyah until he stoned ‘Aqabah Pillar, and when he stoned it,\nhe\nstopped reciting the Talbiyah.’”"}},{"id":160,"idInBook":160,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ خَلاَّدٍ الْبَاهِلِيُّ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، وَوَكِيعٌ، وَعَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، قَالُوا حَدَّثَنَا سُفْيَانُ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، عَنِ الْحَسَنِ الْعُرَنِيِّ، عَنِ ابْنِ عَبَّاسٍ، قَالَ إِذَا رَمَيْتُمُ الْجَمْرَةَ فَقَدْ حَلَّ لَكُمْ كُلُّ شَىْءٍ إِلاَّ النِّسَاءَ ‏.‏ فَقَالَ لَهُ رَجُلٌ يَا ابْنَ عَبَّاسٍ وَالطِّيبُ فَقَالَ أَمَّا أَنَا فَقَدْ رَأَيْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يُضَمِّخُ رَأْسَهُ بِالْمِسْكِ أَفَطِيبٌ ذَلِكَ أَمْ لاَ ‏.‏","english":{"narrator":"It was\nnarrated that Ibn ‘Abbas said:","text":"“When you have stoned the\nPillar,\neverything becomes permissible to you except your wives. A man\nsaid\nto him: ‘O Ibn ‘Abbas, and perfume?’ He said: ‘I saw the\nMessenger of Allah (ﷺ) perfume his head with musk. Is that perfume\nor not?’”"}},{"id":161,"idInBook":161,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا خَالِي، مُحَمَّدٌ وَأَبُو مُعَاوِيَةَ وَأَبُو أُسَامَةَ عَنْ عُبَيْدِ اللَّهِ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ، قَالَتْ طَيَّبْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ لإِحْرَامِهِ حِينَ أَحْرَمَ وَلإِحْلاَلِهِ حِينَ أَحَلَّ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Aishah said:","text":"“I applied perfume to the\nMessenger\nof Allah (ﷺ) for his Ihram when he entered Ihram, and when\nhe\nexited Ihram.”"}},{"id":162,"idInBook":162,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، حَدَّثَنَا عُمَارَةُ بْنُ الْقَعْقَاعِ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ اللَّهُمَّ اغْفِرْ لِلْمُحَلِّقِينَ ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ وَالْمُقَصِّرِينَ قَالَ ‏\"‏ اللَّهُمَّ اغْفِرْ لِلْمُحَلِّقِينَ ‏\"‏ ‏.‏ ثَلاَثًا قَالُوا يَا رَسُولَ اللَّهِ وَالْمُقَصِّرِينَ قَالَ ‏\"‏ وَالْمُقَصِّرِينَ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)\nsaid:","text":"“O\nAllah, forgive those who shave (their heads).” They said: “O\nMessenger of Allah, and those who cut (their hair)?’ He said; “O\nAllah, forgive those who shave (their heads),” three times. They\nsaid:\n“O Messenger of Allah, and those who cut (their hair)?” He\nsaid: “And\nthose who cut (their hair).”"}},{"id":163,"idInBook":163,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، وَأَحْمَدُ بْنُ أَبِي الْحَوَارِيِّ الدِّمَشْقِيُّ، قَالاَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ رَحِمَ اللَّهُ الْمُحَلِّقِينَ ‏\"‏ ‏.‏ قَالُوا وَالْمُقَصِّرِينَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ رَحِمَ اللَّهُ الْمُحَلِّقِينَ ‏\"‏ ‏.‏ قَالُوا وَالْمُقَصِّرِينَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ رَحِمَ اللَّهُ الْمُحَلِّقِينَ ‏\"‏ ‏.‏ قَالُوا وَالْمُقَصِّرِينَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ وَالْمُقَصِّرِينَ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Ibn ‘Umar that the Messenger of Allah (ﷺ)\nsaid:","text":"“May Allah have mercy on those who shave (their heads).” They\nsaid: “And those who cut (their hair), O Messenger of Allah!” He\nsaid:\n“May Allah have mercy on those who shave (their heads).”\nThey said:\n“And those who cut (their hair), O Messenger of Allah!”\nHe said: “May\nAllah have mercy on those who shave (their heads).”\nThey said: “And\nthose who cut (their hair), O Messenger of Allah!”\nHe said: “And those\nwho cut (their hair).”"}},{"id":164,"idInBook":164,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا يُونُسُ بْنُ بُكَيْرٍ، حَدَّثَنَا ابْنُ إِسْحَاقَ، حَدَّثَنَا ابْنُ أَبِي نَجِيحٍ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قِيلَ يَا رَسُولَ اللَّهِ لِمَ ظَاهَرْتَ لِلْمُحَلِّقِينَ ثَلاَثًا وَلِلْمُقَصِّرِينَ وَاحِدَةً قَالَ ‏\n\"‏ إِنَّهُمْ لَمْ يَشُكُّوا ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Ibn ‘Abbas said:","text":"“It was said: ‘O Messenger of\nAllah, why did you support (by supplicating for) those who shave\n(their heads) three times and those who cut (their hair) only once?’\nHe said: ‘Because they did not entertain any doubts.’”"}},{"id":165,"idInBook":165,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ حَفْصَةَ، زَوْجَ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ مَا شَأْنُ النَّاسِ حَلُّوا وَلَمْ تَحِلَّ أَنْتَ مِنْ عُمْرَتِكَ قَالَ ‏\n\"‏ إِنِّي لَبَّدْتُ رَأْسِي وَقَلَّدْتُ هَدْيِي فَلاَ أَحِلُّ حَتَّى أَنْحَرَ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Ibn ‘Umar that Hafsah, the wife of the Prophet\n(ﷺ),\nsaid:","text":"“I said: ‘O Messenger of Allah, what is the matter with\npeople who have exited Ihram when you have not exited your Ihram?’\nHe\nsaid: ‘I have applied something to my head to keep my hair\ntogether,\nand I have garlanded my sacrificial animal, so I will not\nexit Ihram\nuntil I have offered my sacrifice.’”"}},{"id":166,"idInBook":166,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ الْمِصْرِيُّ، أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَنْبَأَنَا يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يُهِلُّ مُلَبِّدًا ‏.‏","english":{"narrator":"It was\nnarrated from Salim, from his father:","text":"“I heard the Messenger\nof\nAllah (ﷺ) reciting the Talbiyah when he entered Ihram with\nsomething applied to his head to keep the hair together.’”"}},{"id":167,"idInBook":167,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، وَعَمْرُو بْنُ عَبْدِ اللَّهِ، قَالاَ حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا أُسَامَةُ بْنُ زَيْدٍ، عَنْ عَطَاءٍ، عَنْ جَابِرٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ مِنًى كُلُّهَا مَنْحَرٌ وَكُلُّ فِجَاجِ مَكَّةَ طَرِيقٌ وَمَنْحَرٌ وَكُلُّ عَرَفَةَ مَوْقِفٌ وَكُلُّ الْمُزْدَلِفَةِ مَوْقِفٌ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Jabir that the Messenger of Allah (ﷺ) said:","text":"“All of\nMina is a place of sacrifice. Every road of Makkah is a\nthoroughfare\nand a place of sacrifice. All of ‘Arafat is the place of\nstanding,\nand all of Muzdalifah is a place of standing.”"}},{"id":168,"idInBook":168,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ أَيُّوبَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ مَا سُئِلَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَمَّنْ قَدَّمَ شَيْئًا قَبْلَ شَىْءٍ إِلاَّ يُلْقِي بِيَدَيْهِ كِلْتَيْهِمَا ‏\n\"‏ لاَ حَرَجَ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Ibn ‘Abbas said:","text":"“The Messenger of Allah (ﷺ)\nwas\nnever asked about someone who had done one thing before another,\nbut\nhe would gesture with both his hands to say: ‘There is no harm in\nthat.’”"}},{"id":169,"idInBook":169,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بِشْرٍ، بَكْرُ بْنُ خَلَفٍ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ يُسْأَلُ يَوْمَ مِنًى فَيَقُولُ ‏\"‏ لاَ حَرَجَ لاَ حَرَجَ ‏\"‏ ‏.‏ فَأَتَاهُ رَجُلٌ فَقَالَ حَلَقْتُ قَبْلَ أَنْ أَذْبَحَ قَالَ ‏\"‏ لاَ حَرَجَ ‏\"‏ ‏.‏ قَالَ رَمَيْتُ بَعْدَ مَا أَمْسَيْتُ قَالَ ‏\"‏ لاَ حَرَجَ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Ibn ‘Abbas said:","text":"“The Messenger of Allah (ﷺ)\nwas\nasked on the Day of Mina, and he would say: ‘There is no harm in\nthat, there is no harm in that.’ A man came to him and said: ‘I\nshaved\nmy head before I slaughtered (my sacrifice),’ and he said:\n‘There is\nno harm in that.’ He said: ‘I stoned (the Pillar)\nafter evening came,’\nand he said: ‘There is no harm in that.’”"}},{"id":170,"idInBook":170,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ عِيسَى بْنِ طَلْحَةَ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ سُئِلَ عَمَّنْ ذَبَحَ قَبْلَ أَنْ يَحْلِقَ أَوْ حَلَقَ قَبْلَ أَنْ يَذْبَحَ قَالَ ‏\n\"‏ لاَ حَرَجَ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from ‘Abdullah bin ‘Amr that the Prophet (ﷺ) was\nasked\nabout a man who slaughtered his sacrifice before shaving his\nhead, or\nwho shaved his head before slaughtering his sacrifice, and he\nsaid:","text":"“There is no harm in that.”"}},{"id":171,"idInBook":171,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الْمِصْرِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي أُسَامَةُ بْنُ زَيْدٍ، حَدَّثَنِي عَطَاءُ بْنُ أَبِي رَبَاحٍ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ قَعَدَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ بِمِنًى يَوْمَ النَّحْرِ لِلنَّاسِ فَجَاءَهُ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي حَلَقْتُ قَبْلَ أَنْ أَذْبَحَ قَالَ ‏\"‏ لاَ حَرَجَ ‏\"‏ ‏.‏ ثُمَّ جَاءَهُ آخَرُ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي نَحَرْتُ قَبْلَ أَنْ أَرْمِيَ قَالَ ‏\"‏ لاَ حَرَجَ ‏\"‏ ‏.‏ فَمَا سُئِلَ يَوْمَئِذٍ عَنْ شَىْءٍ قُدِّمَ قَبْلَ شَىْءٍ إِلاَّ قَالَ ‏\"‏ لاَ حَرَجَ ‏\"‏ ‏.‏","english":{"narrator":"Jabir\nbin ‘Abdullah said:","text":"“The Messenger of Allah (ﷺ) sat in Mina,\non\nthe Day of Sacrifice, for the people (to come and speak to him). A\nman came to him and said: ‘O Messenger of Allah, I shaved my head\nbefore I slaughtered my sacrifice.’ He said: ‘There is no harm in\nthat.’ Then another man came and said: ‘O Messenger of Allah, I\nslaughtered my sacrifice before I stoned (the Pillar).’ He said:\n‘There is no harm in that.’ And he was not asked that day about\nanything being done before another but he replied: ‘There is no\nharm\nin that.’”"}},{"id":172,"idInBook":172,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى الْمِصْرِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، حَدَّثَنَا ابْنُ جُرَيْجٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ رَأَيْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ رَمَى جَمْرَةَ الْعَقَبَةِ ضُحًى وَأَمَّا بَعْدَ ذَلِكَ فَبَعْدَ زَوَالِ الشَّمْسِ ‏.‏","english":{"narrator":"It was\nnarrated that Jabir said:","text":"“I saw the Messenger of Allah (ﷺ)\nstoning ‘Aqabah Pillar at forenoon, but after that day, he would do\nit\nafter the sun had passed its zenith.”"}},{"id":173,"idInBook":173,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا جُبَارَةُ بْنُ الْمُغَلِّسِ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ عُثْمَانَ بْنِ أَبِي شَيْبَةَ أَبُو شَيْبَةَ، عَنِ الْحَكَمِ، عَنْ مِقْسَمٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ كَانَ يَرْمِي الْجِمَارَ إِذَا زَالَتِ الشَّمْسُ قَدْرَ مَا إِذَا فَرَغَ مِنْ رَمْيِهِ صَلَّى الظُّهْرَ ‏.‏","english":{"narrator":"","text":"It was\nnarrated from Ibn ‘Abbas that the Messenger of Allah (ﷺ)\nused to\nstone the Pillars when the sun had passed its zenith, to the\nextent\nthat, as soon as he finished stoning them, he would pray Zuhr."}},{"id":174,"idInBook":174,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَهَنَّادُ بْنُ السَّرِيِّ، قَالاَ حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ شَبِيبِ بْنِ غَرْقَدَةَ، عَنْ سُلَيْمَانَ بْنِ عَمْرِو بْنِ الأَحْوَصِ، عَنْ أَبِيهِ، قَالَ سَمِعْتُ النَّبِيَّ ـ صلى الله عليه وسلم ـ يَقُولُ فِي حَجَّةِ الْوَدَاعِ ‏\"‏ يَا أَيُّهَا النَّاسُ أَلاَ أَىُّ يَوْمٍ أَحْرَمُ ‏\"‏ ‏.‏ ثَلاَثَ مَرَّاتٍ قَالُوا يَوْمُ الْحَجِّ الأَكْبَرِ ‏.‏ قَالَ ‏\"‏ فَإِنَّ دِمَاءَكُمْ وَأَمْوَالَكُمْ وَأَعْرَاضَكُمْ بَيْنَكُمْ حَرَامٌ كَحُرْمَةِ يَوْمِكُمْ هَذَا فِي شَهْرِكُمْ هَذَا فِي بَلَدِكُمْ هَذَا أَلاَ لاَ يَجْنِي جَانٍ إِلاَّ عَلَى نَفْسِهِ وَلاَ يَجْنِي وَالِدٌ عَلَى وَلَدِهِ وَلاَ مَوْلُودٌ عَلَى وَالِدِهِ ‏.‏ أَلاَ إِنَّ الشَّيْطَانَ قَدْ أَيِسَ أَنْ يُعْبَدَ فِي بَلَدِكُمْ هَذَا أَبَدًا وَلَكِنْ سَيَكُونُ لَهُ طَاعَةٌ فِي بَعْضِ مَا تَحْتَقِرُونَ مِنْ أَعْمَالِكُمْ فَيَرْضَى بِهَا أَلاَ وَكُلُّ دَمٍ مِنْ دِمَاءِ الْجَاهِلِيَّةِ مَوْضُوعٌ وَأَوَّلُ مَا أَضَعُ مِنْهَا دَمُ الْحَارِثِ بْنِ عَبْدِ الْمُطَّلِبِ - كَانَ مُسْتَرْضِعًا فِي بَنِي لَيْثٍ فَقَتَلَتْهُ هُذَيْلٌ - أَلاَ وَإِنَّ كُلَّ رِبًا مِنْ رِبَا الْجَاهِلِيَّةِ مَوْضُوعٌ لَكُمْ رُءُوسُ أَمْوَالِكُمْ لاَ تَظْلِمُونَ وَلاَ تُظْلَمُونَ أَلاَ يَا أُمَّتَاهُ هَلْ بَلَّغْتُ ‏\"‏ ‏.‏ ثَلاَثَ مَرَّاتٍ قَالُوا نَعَمْ ‏.‏ قَالَ ‏\"‏ اللَّهُمَّ اشْهَدْ ‏\"‏ ‏.‏ ثَلاَثَ مَرَّاتٍ ‏.‏","english":{"narrator":"It was\nnarrated from Sulaiman bin ‘Amr bin Ahwas that his father\nsaid:","text":"“I\nheard the Prophet (ﷺ) say, during the Farewell Pilgrimage:\n‘O\npeople! Which day is the most sacred?’ three times. They said: ‘The\nday of the greatest Hajj.’ He said: ‘Your blood and your wealth\nand\nyour honor are sacred to one another, as sacred as this day of\nyours,\nin this land of your. No sinner commits a sin but it is\nagainst\nhimself. No father is to be punished for the sins of his\nchild, and no\nchild is to be punished for the sins of his father.\nSatan has\ndespaired of ever being worshipping in this land of yours,\nbut he will\nbe obeyed in some matters which you regard as\ninsignificant, and he\nwill be content with that. All the blood feuds\nof the Ignorance days\nare abolished, and the first of them that I\nabolish is the blood feud\nof Harith bin ‘Abdul-Muttalib, who was\nnursed among Banu Laith and\nkilled by Hudhail. All the usuries of the\nIgnorance days are\nabolished, but you will have your capital. Do not\nwrong others and you\nwill not be wronged. O my nation, have I\nconveyed (the message)?’ (He\nasked this) three times. They said:\n‘Yes.’ He said: ‘O Allah, bear\nwitness!’ three times.”"}},{"id":175,"idInBook":175,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنْ عَبْدِ السَّلاَمِ، عَنِ الزُّهْرِيِّ، عَنْ مُحَمَّدِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ، عَنْ أَبِيهِ، قَالَ قَامَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ بِالْخَيْفِ مِنْ مِنًى فَقَالَ ‏\n\"‏ نَضَّرَ اللَّهُ امْرَأً سَمِعَ مَقَالَتِي فَبَلَّغَهَا فَرُبَّ حَامِلِ فِقْهٍ غَيْرُ فَقِيهٍ وَرُبَّ حَامِلِ فِقْهٍ إِلَى مَنْ هُوَ أَفْقَهُ مِنْهُ ثَلاَثٌ لاَ يُغِلُّ عَلَيْهِنَّ قَلْبُ مُؤْمِنٍ إِخْلاَصُ الْعَمَلِ لِلَّهِ وَالنَّصِيحَةُ لِوُلاَةِ الْمُسْلِمِينَ وَلُزُومُ جَمَاعَتِهِمْ فَإِنَّ دَعْوَتَهُمْ تُحِيطُ مِنْ وَرَائِهِمْ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Muhammad bin Jubair bin Mut’im that his father\nsaid:","text":"“The Messenger of Allah (ﷺ) stood up in Khaif in Mina, and\nsaid:\n‘May Allah make his face shine, the man who hears my words and\nconveys them. It may be that the bearer of knowledge does not\nunderstand it, and it may be that he takes it to one who will\nunderstand it more than he does. There are three things in which the\nheart of the believer does not betray: sincerity of action for the\nsake of Allah, offering sincere advice to the rulers of the Muslims,\nand adhering to the Jama’ah (main body of the Muslims). Their\nsupplication is answered (i.e. encompassing every good, and all of\nthe\npeople).”"}},{"id":176,"idInBook":176,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ بْنُ تَوْبَةَ، حَدَّثَنَا زَافِرُ بْنُ سُلَيْمَانَ، عَنْ أَبِي سِنَانٍ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ مُرَّةَ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ وَهُوَ عَلَى نَاقَتِهِ الْمُخَضْرَمَةِ بِعَرَفَاتٍ فَقَالَ ‏\"‏ أَتَدْرُونَ أَىُّ يَوْمٍ هَذَا وَأَىُّ شَهْرٍ هَذَا وَأَىُّ بَلَدٍ هَذَا ‏\"‏ ‏.‏ قَالُوا هَذَا بَلَدٌ حَرَامٌ وَشَهْرٌ حَرَامٌ وَيَوْمٌ حَرَامٌ ‏.‏ قَالَ ‏\"‏ أَلاَ وَإِنَّ أَمْوَالَكُمْ وَدِمَاءَكُمْ عَلَيْكُمْ حَرَامٌ كَحُرْمَةِ شَهْرِكُمْ هَذَا فِي بَلَدِكُمْ هَذَا فِي يَوْمِكُمْ هَذَا أَلاَ وَإِنِّي فَرَطُكُمْ عَلَى الْحَوْضِ وَأُكَاثِرُ بِكُمُ الأُمَمَ فَلاَ تُسَوِّدُوا وَجْهِي أَلاَ وَإِنِّي مُسْتَنْقِذٌ أُنَاسًا وَمُسْتَنْقَذٌ مِنِّي أُنَاسٌ فَأَقُولُ يَا رَبِّ أُصَيْحَابِي ‏.‏ فَيَقُولُ إِنَّكَ لاَ تَدْرِي مَا أَحْدَثُوا بَعْدَكَ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Abdullah bin Mas’ud said:","text":"“The Messenger of\nAllah (ﷺ) said, when he was atop his camel with the clipped ears in\n‘Arafat: ‘Do you know what day this is, what month this is and\nwhat\nland this is?’ They said: ‘This is a sacred land, a sacred\nmonth and a\nsacred day.’ He said: ‘Your wealth and your blood are\nsacred to you as\nthis month of yours, in this land of yours, on this\nday of yours. I\nwill reach the Cistern (Hawd) before you, and I will\nbe proud of your\ngreat numbers before the nations, so do not blacken\nmy face (i.e.,\ncause me to be ashamed). I will rescue some people,\nand some people\nwill be taken away from me. I will say: “O Lord, my\ncompanions!” and\nHe will say: “You do not know what innovations\nthey introduced after\nyou were gone.’”"}},{"id":177,"idInBook":177,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا صَدَقَةُ بْنُ خَالِدٍ، حَدَّثَنَا هِشَامُ بْنُ الْغَازِ، قَالَ سَمِعْتُ نَافِعًا، يُحَدِّثُ عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ وَقَفَ يَوْمَ النَّحْرِ بَيْنَ الْجَمَرَاتِ فِي الْحَجَّةِ الَّتِي حَجَّ فِيهَا فَقَالَ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏\"‏ أَىُّ يَوْمٍ هَذَا ‏\"‏ ‏.‏ قَالُوا يَوْمُ النَّحْرِ ‏.‏ قَالَ ‏\"‏ فَأَىُّ بَلَدٍ هَذَا ‏\"‏ ‏.‏ قَالُوا هَذَا بَلَدُ اللَّهِ الْحَرَامُ ‏.‏ قَالَ ‏\"‏ فَأَىُّ شَهْرٍ هَذَا ‏\"‏ ‏.‏ قَالُوا شَهْرُ اللَّهِ الْحَرَامُ ‏.‏ قَالَ ‏\"‏ هَذَا يَوْمُ الْحَجِّ الأَكْبَرِ وَدِمَاؤُكُمْ وَأَمْوَالُكُمْ وَأَعْرَاضُكُمْ عَلَيْكُمْ حَرَامٌ كَحُرْمَةِ هَذَا الْبَلَدِ فِي هَذَا الشَّهْرِ فِي هَذَا الْيَوْمِ ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ هَلْ بَلَّغْتُ ‏\"‏ ‏.‏ قَالُوا نَعَمْ ‏.‏ فَطَفِقَ النَّبِيُّ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\"‏ اللَّهُمَّ اشْهَدْ ‏\"‏ ‏.‏ ثُمَّ وَدَّعَ النَّاسَ فَقَالُوا هَذِهِ حَجَّةُ الْوَدَاعِ ‏.‏","english":{"narrator":"It was\nnarrated from Ibn ‘Umar that the Messenger of Allah (ﷺ)\nstood, on\nthe Day of Sacrifice, between the Pillars, during the Hajj\nthat he\nperformed. The Prophet (ﷺ) said:","text":"“What day is this?” They\nsaid:\n“The day of sacrifice.” He said: “What land is this?” They\nsaid:\n“This is the sacred land of Allah.” He said: “What month\nis this?”\nThey said: “The sacred month of Allah.” He said:\n“This is the day of\nthe greatest Hajj, and your blood, your wealth\nand your honor are\nsacred to you, as sacred as this land, in this\nmonth, on this day.”\nThen he said: “Have I conveyed (the\nmessage)?” They said: “Yes.” Then\nthe Prophet (ﷺ) started to\nsay: “O Allah, bear witness.” Then he\nbade farewell to the\npeople, and they said: “This is the Farewell\nPilgrimage.”"}},{"id":178,"idInBook":178,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا بَكْرُ بْنُ خَلَفٍ أَبُو بِشْرٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنِي مُحَمَّدُ بْنُ طَارِقٍ، عَنْ طَاوُسٍ، وَأَبُو الزُّبَيْرِ، عَنْ عَائِشَةَ، وَابْنِ، عَبَّاسٍ أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ أَخَّرَ طَوَافَ الزِّيَارَةِ إِلَى اللَّيْلِ ‏.‏","english":{"narrator":"","text":"It was\nnarrated from ‘Aishah and Ibn ‘Abbas that the Prophet (ﷺ)\ndelayed Tawafuz-Ziyarah until nighttime."}},{"id":179,"idInBook":179,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى، حَدَّثَنَا ابْنُ وَهْبٍ، أَنْبَأَنَا ابْنُ جُرَيْجٍ، عَنْ عَطَاءٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ لَمْ يَرْمُلْ فِي السَّبْعِ الَّذِي أَفَاضَ فِيهِ ‏.‏ قَالَ عَطَاءٌ وَلاَ رَمَلَ فِيهِ ‏.‏","english":{"narrator":"","text":"It was\nnarrated from ‘Abdullah bin ‘Abbas that the Prophet (ﷺ) did\nnot\nwalk quickly (Ramal) during the seven circuits of Tawaful-Ifadah\n(done on 10th day of Dhul-Hijjah)."}},{"id":180,"idInBook":180,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنْ عُثْمَانَ بْنِ الأَسْوَدِ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ، قَالَ كُنْتُ عِنْدَ ابْنِ عَبَّاسٍ جَالِسًا فَجَاءَهُ رَجُلٌ فَقَالَ مِنْ أَيْنَ جِئْتَ قَالَ مِنْ زَمْزَمَ ‏.‏ قَالَ فَشَرِبْتَ مِنْهَا كَمَا يَنْبَغِي قَالَ وَكَيْفَ قَالَ إِذَا شَرِبْتَ مِنْهَا فَاسْتَقْبِلِ الْكَعْبَةَ وَاذْكُرِ اسْمَ اللَّهِ وَتَنَفَّسْ ثَلاَثًا وَتَضَلَّعْ مِنْهَا فَإِذَا فَرَغْتَ فَاحْمَدِ اللَّهَ عَزَّ وَجَلَّ فَإِنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ إِنَّ آيَةَ مَا بَيْنَنَا وَبَيْنَ الْمُنَافِقِينَ أَنَّهُمْ لاَ يَتَضَلَّعُونَ مِنْ زَمْزَمَ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Muhammad bin ‘Abdur-Rahman bin Abu Bakr said:","text":"“I\nwas sitting with Ibn ‘Abbas, and a man came to him and he said:\n‘Where\nhave you come from?’ He said: ‘From Zamzam.’ He said:\n‘Did you drink\nfrom it as you should?’ He said: ‘How is that?’\nHe said: ‘When you\ndrink from it, turn to face the Qiblah and\nmention the name of Allah,\ndrink three draughts and drink your fill\nof it. When you have\nfinished, then praise Allah.’ The Messenger of\nAllah (ﷺ) said: ‘The\nsign (that differentiates) between us and\nthe hypocrites is that they\ndo not drink their fill from Zamzam.”"}},{"id":181,"idInBook":181,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، قَالَ قَالَ عَبْدُ اللَّهِ بْنُ الْمُؤَمَّلِ إِنَّهُ سَمِعَ أَبَا الزُّبَيْرِ، يَقُولُ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\n\"‏ مَاءُ زَمْزَمَ لِمَا شُرِبَ لَهُ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Jabir bin ‘Abdullah said:","text":"“I heard the Messenger\nof\nAllah (ﷺ) say: ‘The water of Zamzam is for whatever it is drunk\nfor.’”"}},{"id":182,"idInBook":182,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ، حَدَّثَنَا عُمَرُ بْنُ عَبْدِ الْوَاحِدِ، عَنِ الأَوْزَاعِيِّ، حَدَّثَنِي حَسَّانُ بْنُ عَطِيَّةَ، حَدَّثَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ، قَالَ دَخَلَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ يَوْمَ الْفَتْحِ الْكَعْبَةَ وَمَعَهُ بِلاَلٌ وَعُثْمَانُ بْنُ شَيْبَةَ فَأَغْلَقُوهَا عَلَيْهِمْ مِنْ دَاخِلٍ فَلَمَّا خَرَجُوا سَأَلْتُ بِلاَلاً أَيْنَ صَلَّى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ فَأَخْبَرَنِي أَنَّهُ صَلَّى عَلَى وَجْهِهِ حِينَ دَخَلَ بَيْنَ الْعَمُودَيْنِ عَنْ يَمِينِهِ ثُمَّ لُمْتُ نَفْسِي أَنْ لاَ أَكُونَ سَأَلْتُهُ كَمْ صَلَّى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏.‏","english":{"narrator":"It was\nnarrated that Ibn ‘Umar said:","text":"“The Messenger of Allah (ﷺ)\nentered the Ka’bah on the Day of the Conquest (of Makkah), with\nBilal and ‘Uthman bin Shaibah, and they locked the door behind them\nfrom the inside. When they came out, I asked Bilal: ‘Where did the\nMessenger of Allah (ﷺ) pray?’ He told me that when he entered, he\nturned to his right and prayed in the direction that he was facing,\nbetween the two columns.”"}},{"id":183,"idInBook":183,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ الْمَلِكِ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنْ عَائِشَةَ، قَالَتْ خَرَجَ النَّبِيُّ ـ صلى الله عليه وسلم ـ مِنْ عِنْدِي وَهُوَ قَرِيرُ الْعَيْنِ طَيِّبُ النَّفْسِ ثُمَّ رَجَعَ إِلَىَّ وَهُوَ حَزِينٌ فَقُلْتُ يَا رَسُولَ اللَّهِ خَرَجْتَ مِنْ عِنْدِي وَأَنْتَ قَرِيرُ الْعَيْنِ وَرَجَعْتَ وَأَنْتَ حَزِينٌ ‏.‏ فَقَالَ ‏\n\"‏ إِنِّي دَخَلْتُ الْكَعْبَةَ وَوَدِدْتُ أَنِّي لَمْ أَكُنْ فَعَلْتُ إِنِّي أَخَافُ أَنْ أَكُونَ أَتْعَبْتُ أُمَّتِي مِنْ بَعْدِي ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Aishah said:","text":"“The Messenger of Allah (ﷺ) went\nout delighted, then he came back to me sad. I said: ‘O Messenger of\nAllah, (why did) you go out happy and come back sad?’ He said: ‘I\nentered the Ka’bah, and I wish that I had not done that, because I\nam\nafraid that I may have caused difficulty for my nation after I am\ngone.’”"}},{"id":184,"idInBook":184,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ اسْتَأْذَنَ الْعَبَّاسُ بْنُ عَبْدِ الْمُطَّلِبِ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ أَنْ يَبِيتَ بِمَكَّةَ أَيَّامَ مِنًى مِنْ أَجْلِ سِقَايَتِهِ فَأَذِنَ لَهُ ‏.‏","english":{"narrator":"It was\nnarrated that Ibn ‘Umar said:","text":"“Abbas bin ‘Abdul-Muttalib asked\nthe Messenger of Allah (ﷺ) for permission to stay overnight in\nMakkah on the nights of Mina for the purpose of supplying water to\nthe\npilgrims, and he gave him permission."}},{"id":185,"idInBook":185,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، وَهَنَّادُ بْنُ السَّرِيِّ، قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنْ إِسْمَاعِيلَ بْنِ مُسْلِمٍ، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ لَمْ يُرَخِّصِ النَّبِيُّ ـ صلى الله عليه وسلم ـ لأَحَدٍ يَبِيتُ بِمَكَّةَ إِلاَّ لِلْعَبَّاسِ مِنْ أَجْلِ السِّقَايَةِ ‏.‏","english":{"narrator":"It was\nnarrated that Ibn ‘Abbas said:","text":"“The Prophet (ﷺ) did not\nallow\nanyone to stay overnight in Makkah apart from ‘Abbas, for the\npurpose of supplying water to the pilgrims.”"}},{"id":186,"idInBook":186,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ، حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ، وَعَبْدَةُ، وَوَكِيعٌ، وَأَبُو مُعَاوِيَةَ ح وَحَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، وَأَبُو مُعَاوِيَةَ ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، كُلُّهُمْ عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ إِنَّ نُزُولَ الأَبْطَحِ لَيْسَ بِسُنَّةٍ إِنَّمَا نَزَلَهُ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ لِيَكُونَ أَسْمَحَ لِخُرُوجِهِ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Aishah said:","text":"“Staying in Abtah is not Sunnah;\nthe\nMessenger of Allah (ﷺ) only stayed there because it was more\nconvenient for his departure.”"}},{"id":187,"idInBook":187,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ، عَنْ عَمَّارِ بْنِ رُزَيْقٍ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتِ ادَّلَجَ النَّبِيُّ ـ صلى الله عليه وسلم ـ لَيْلَةَ النَّفْرِ مِنَ الْبَطْحَاءِ ادِّلاَجًا ‏.‏","english":{"narrator":"It was\nnarrated that ‘Aishah said:","text":"“The Prophet (ﷺ) set out before\ndaybreak, on the night of departure, from Batha’.”"}},{"id":188,"idInBook":188,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَنْبَأَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ كَانَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ وَأَبُو بَكْرٍ وَعُمَرُ وَعُثْمَانُ يَنْزِلُونَ بِالأَبْطَحِ ‏.‏","english":{"narrator":"It was\nnarrated that Ibn ‘Umar said:","text":"“The Messenger of Allah (ﷺ),\nAbu\nBakr, ‘Umar and ‘Uthman used to stay at Abtah.”"}},{"id":189,"idInBook":189,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ سُلَيْمَانَ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَ النَّاسُ يَنْصَرِفُونَ كُلَّ وَجْهٍ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ لاَ يَنْفِرَنَّ أَحَدٌ حَتَّى يَكُونَ آخِرُ عَهْدِهِ بِالْبَيْتِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Ibn ‘Abbas said:","text":"“The people were going in all\ndirections, and the Messenger of Allah (ﷺ) said: ‘No one should\ndepart until the last thing he does is (Tawaf around) the House.’”"}},{"id":190,"idInBook":190,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ يَزِيدَ، عَنْ طَاوُسٍ، عَنِ ابْنِ عُمَرَ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ أَنْ يَنْفِرَ الرَّجُلُ حَتَّى يَكُونَ آخِرُ عَهْدِهِ بِالْبَيْتِ ‏.‏","english":{"narrator":"It was\nnarrated that Ibn ‘Umar said:","text":"“The Messenger of Allah (ﷺ)\nforbade a man to depart until the last thing he did was (Tawaf\naround)\nthe House.”"}},{"id":191,"idInBook":191,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ، وَعُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ حَاضَتْ صَفِيَّةُ بِنْتُ حُيَىٍّ بَعْدَمَا أَفَاضَتْ ‏.‏ قَالَتْ عَائِشَةُ فَذَكَرْتُ ذَلِكَ لِرَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ ‏.‏ فَقَالَ ‏\"‏ أَحَابِسَتُنَا هِيَ ‏\"‏ ‏.‏ فَقُلْتُ إِنَّهَا قَدْ أَفَاضَتْ ثُمَّ حَاضَتْ بَعْدَ ذَلِكَ ‏.‏ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ فَلْتَنْفِرْ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Aishah said:","text":"“Safiyyah bint Huyai got her\nmenses\nafter she had done Tawaful-Ifadah.” ‘Aishah said: “I mentioned\nthat to the Messenger of Allah (ﷺ) and he said: ‘Has she detained\nus?’ I said: ‘She performed Tawaful-Ifadah then she got her\nmenses\nafter that.’ The Messenger of Allah (ﷺ) said: ‘Then let\nher\ndepart.’”"}},{"id":192,"idInBook":192,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا الأَعْمَشُ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ ذَكَرَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ صَفِيَّةَ فَقُلْنَا قَدْ حَاضَتْ ‏.‏ فَقَالَ ‏\"‏ عَقْرَى حَلْقَى مَا أُرَاهَا إِلاَّ حَابِسَتَنَا ‏\"‏ ‏.‏ فَقُلْنَا يَا رَسُولَ اللَّهِ إِنَّهَا قَدْ طَافَتْ يَوْمَ النَّحْرِ ‏.‏ قَالَ ‏\"‏ فَلاَ إِذًا مُرُوهَا فَلْتَنْفِرْ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Aishah said:","text":"“The Messenger of Allah (ﷺ)\nmentioned Safiyyah and we said: ‘She has got her menses.’ He\nsaid: ‘\n‘Aqra Halqa!* I think that she has detained us.’ I\nsaid: ‘O Messenger\nof Allah, she performed Tawaful-Ifadah on the\nDay of Sacrifice.’ He\nsaid: ‘No then, tell her to depart.’”"}},{"id":193,"idInBook":193,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا جَعْفَرُ بْنُ مُحَمَّدٍ، عَنْ أَبِيهِ، قَالَ دَخَلْنَا عَلَى جَابِرِ بْنِ عَبْدِ اللَّهِ فَلَمَّا انْتَهَيْنَا إِلَيْهِ سَأَلَ عَنِ الْقَوْمِ، حَتَّى انْتَهَى إِلَىَّ فَقُلْتُ أَنَا مُحَمَّدُ بْنُ عَلِيِّ بْنِ الْحُسَيْنِ، ‏.‏ فَأَهْوَى بِيَدِهِ إِلَى رَأْسِي فَحَلَّ زِرِّي الأَعْلَى ثُمَّ حَلَّ زِرِّي الأَسْفَلَ ثُمَّ وَضَعَ كَفَّهُ بَيْنَ ثَدْيَىَّ وَأَنَا يَوْمَئِذٍ غُلاَمٌ شَابٌّ فَقَالَ مَرْحَبًا بِكَ سَلْ عَمَّا شِئْتَ ‏.‏ فَسَأَلْتُهُ وَهُوَ أَعْمَى فَجَاءَ وَقْتُ الصَّلاَةِ فَقَامَ فِي نِسَاجَةٍ مُلْتَحِفًا بِهَا كُلَّمَا وَضَعَهَا عَلَى مَنْكِبَيْهِ رَجَعَ طَرَفَاهَا إِلَيْهِ مِنْ صِغَرِهَا وَرِدَاؤُهُ إِلَى جَانِبِهِ عَلَى الْمِشْجَبِ فَصَلَّى بِنَا فَقُلْتُ أَخْبِرْنَا عَنْ حَجَّةِ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ ‏.‏ فَقَالَ بِيَدِهِ فَعَقَدَ تِسْعًا وَقَالَ إِنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ مَكَثَ تِسْعَ سِنِينَ لَمْ يَحُجَّ فَأَذَّنَ فِي النَّاسِ فِي الْعَاشِرَةِ أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ حَاجٌّ فَقَدِمَ الْمَدِينَةَ بَشَرٌ كَثِيرٌ كُلُّهُمْ يَلْتَمِسُ أَنْ يَأْتَمَّ بِرَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ وَيَعْمَلَ بِمِثْلِ عَمَلِهِ فَخَرَجَ وَخَرَجْنَا مَعَهُ فَأَتَيْنَا ذَا الْحُلَيْفَةِ فَوَلَدَتْ أَسْمَاءُ بِنْتُ عُمَيْسٍ مُحَمَّدَ بْنَ أَبِي بَكْرٍ فَأَرْسَلَتْ إِلَى رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ كَيْفَ أَصْنَعُ قَالَ ‏\"‏ اغْتَسِلِي وَاسْتَثْفِرِي بِثَوْبٍ وَأَحْرِمِي ‏\"‏ ‏.‏ فَصَلَّى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ فِي الْمَسْجِدِ ثُمَّ رَكِبَ الْقَصْوَاءَ ‏.‏ حَتَّى إِذَا اسْتَوَتْ بِهِ نَاقَتُهُ عَلَى الْبَيْدَاءِ - قَالَ جَابِرٌ نَظَرْتُ إِلَى مَدِّ بَصَرِي مِنْ بَيْنِ يَدَيْهِ بَيْنَ رَاكِبٍ وَمَاشٍ وَعَنْ يَمِينِهِ مِثْلُ ذَلِكَ وَعَنْ يَسَارِهِ مِثْلُ ذَلِكَ وَمِنْ خَلْفِهِ مِثْلُ ذَلِكَ وَرَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ بَيْنَ أَظْهُرِنَا وَعَلَيْهِ يَنْزِلُ الْقُرْآنُ وَهُوَ يَعْرِفُ تَأْوِيلَهُ مَا عَمِلَ مِنْ شَىْءٍ عَمِلْنَا بِهِ فَأَهَلَّ بِالتَّوْحِيدِ ‏\"‏ لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ لَبَّيْكَ لاَ شَرِيكَ لَكَ لَبَّيْكَ إِنَّ الْحَمْدَ وَالنِّعْمَةَ لَكَ وَالْمُلْكَ لاَ شَرِيكَ لَكَ ‏\"‏ ‏.‏ وَأَهَلَّ النَّاسُ بِهَذَا الَّذِي يُهِلُّونَ بِهِ فَلَمْ يَرُدَّ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَلَيْهِمْ شَيْئًا مِنْهُ وَلَزِمَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ تَلْبِيَتَهُ ‏.‏ قَالَ جَابِرٌ لَسْنَا نَنْوِي إِلاَّ الْحَجَّ لَسْنَا نَعْرِفُ الْعُمْرَةَ حَتَّى إِذَا أَتَيْنَا الْبَيْتَ مَعَهُ اسْتَلَمَ الرُّكْنَ فَرَمَلَ ثَلاَثًا وَمَشَى أَرْبَعًا ثُمَّ قَامَ إِلَى مَقَامِ إِبْرَاهِيمَ فَقَالَ ‏\"‏ ‏{وَاتَّخِذُوا مِنْ مَقَامِ إِبْرَاهِيمَ مُصَلًّى}‏ ‏\"‏ ‏.‏ فَجَعَلَ الْمَقَامَ بَيْنَهُ وَبَيْنَ الْبَيْتِ فَكَانَ أَبِي يَقُولُ - وَلاَ أَعْلَمُهُ إِلاَّ ذَكَرَهُ عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ - إِنَّهُ كَانَ يَقْرَأُ فِي الرَّكْعَتَيْنِ ‏{قُلْ يَا أَيُّهَا الْكَافِرُونَ}‏ وَ ‏{قُلْ هُوَ اللَّهُ أَحَدٌ }‏ ‏.‏ ثُمَّ رَجَعَ إِلَى الْبَيْتِ فَاسْتَلَمَ الرُّكْنَ ثُمَّ خَرَجَ مِنَ الْبَابِ إِلَى الصَّفَا حَتَّى إِذَا دَنَا مِنَ الصَّفَا قَرَأَ ‏\"‏ ‏{إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ ‏)‏ ‏.‏ نَبْدَأُ بِمَا بَدَأَ اللَّهُ بِهِ ‏\"‏ ‏.‏ فَبَدَأَ بِالصَّفَا ‏.‏ فَرَقِيَ عَلَيْهِ حَتَّى رَأَى الْبَيْتَ فَكَبَّرَ اللَّهَ وَهَلَّلَهُ وَحَمِدَهُ وَقَالَ ‏\"‏ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِي وَيُمِيتُ وَهُوَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ أَنْجَزَ وَعْدَهُ وَنَصَرَ عَبْدَهُ وَهَزَمَ الأَحْزَابَ وَحْدَهُ ‏\"‏ ‏.‏ ثُمَّ دَعَا بَيْنَ ذَلِكَ وَقَالَ مِثْلَ هَذَا ثَلاَثَ مَرَّاتٍ ثُمَّ نَزَلَ إِلَى الْمَرْوَةِ فَمَشَى حَتَّى إِذَا انْصَبَّتْ قَدَمَاهُ رَمَلَ فِي بَطْنِ الْوَادِي حَتَّى إِذَا صَعِدَتَا - يَعْنِي قَدَمَاهُ - مَشَى حَتَّى أَتَى الْمَرْوَةَ فَفَعَلَ عَلَى الْمَرْوَةِ كَمَا فَعَلَ عَلَى الصَّفَا فَلَمَّا كَانَ آخِرُ طَوَافِهِ عَلَى الْمَرْوَةِ ‏.‏ قَالَ ‏\"‏ لَوْ أَنِّي اسْتَقْبَلْتُ مِنْ أَمْرِي مَا اسْتَدْبَرْتُ لَمْ أَسُقِ الْهَدْىَ وَجَعَلْتُهَا عُمْرَةً فَمَنْ كَانَ مِنْكُمْ لَيْسَ مَعَهُ هَدْىٌ فَلْيَحْلِلْ وَلْيَجْعَلْهَا عُمْرَةً ‏\"‏ ‏.‏ فَحَلَّ النَّاسُ كُلُّهُمْ وَقَصَّرُوا إِلاَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ وَمَنْ كَانَ مَعَهُ الْهَدْىُ فَقَامَ سُرَاقَةُ بْنُ مَالِكِ بْنِ جُعْشُمٍ فَقَالَ يَا رَسُولَ اللَّهِ أَلِعَامِنَا هَذَا أَمْ لأَبَدِ الأَبَدِ قَالَ فَشَبَّكَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ أَصَابِعَهُ فِي الأُخْرَى وَقَالَ ‏\"‏ دَخَلَتِ الْعُمْرَةُ فِي الْحَجِّ هَكَذَا - مَرَّتَيْنِ - لاَ بَلْ لأَبَدِ الأَبَدِ ‏\"‏ ‏.‏ قَالَ وَقَدِمَ عَلِيٌّ بِبُدْنٍ إِلَى النَّبِيِّ ـ صلى الله عليه وسلم ـ ‏.‏ فَوَجَدَ فَاطِمَةَ مِمَّنْ حَلَّ وَلَبِسَتْ ثِيابًا صَبِيغًا وَاكْتَحَلَتْ فَأَنْكَرَ ذَلِكَ عَلَيْهَا عَلِيٌّ فَقَالَتْ أَمَرَنِي أَبِي بِهَذَا ‏.‏ فَكَانَ عَلِيٌّ يَقُولُ بِالْعِرَاقِ فَذَهَبْتُ إِلَى رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ مُحَرِّشًا عَلَى فَاطِمَةَ فِي الَّذِي صَنَعَتْهُ مُسْتَفْتِيًا رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ فِي الَّذِي ذَكَرَتْ عَنْهُ وَأَنْكَرْتُ ذَلِكَ عَلَيْهَا ‏.‏ فَقَالَ ‏\"‏ صَدَقَتْ صَدَقَتْ مَاذَا قُلْتَ حِينَ فَرَضْتَ الْحَجَّ ‏\"‏ ‏.‏ قَالَ قُلْتُ اللَّهُمَّ إِنِّي أُهِلُّ بِمَا أَهَلَّ بِهِ رَسُولُكَ ـ صلى الله عليه وسلم ـ ‏.‏ قَالَ ‏\"‏ فَإِنَّ مَعِيَ الْهَدْىَ فَلاَ تَحِلُّ ‏\"‏ ‏.‏ قَالَ فَكَانَ جَمَاعَةُ الْهَدْىِ الَّذِي جَاءَ بِهِ عَلِيٌّ مِنَ الْيَمَنِ وَالَّذِي أَتَى بِهِ النَّبِيُّ ـ صلى الله عليه وسلم ـ مِنَ الْمَدِينَةِ مِائَةً ثُمَّ حَلَّ النَّاسُ كُلُّهُمْ وَقَصَّرُوا إِلاَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ وَمَنْ كَانَ مَعَهُ هَدْىٌ فَلَمَّا كَانَ يَوْمُ التَّرْوِيَةِ وَتَوَجَّهُوا إِلَى مِنًى أَهَلُّوا بِالْحَجِّ ‏.‏ فَرَكِبَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ فَصَلَّى بِمِنًى الظُّهْرَ وَالْعَصْرَ وَالْمَغْرِبَ وَالْعِشَاءَ وَالصُّبْحَ ثُمَّ مَكَثَ قَلِيلاً حَتَّى طَلَعَتِ الشَّمْسُ وَأَمَرَ بِقُبَّةٍ مِنْ شَعَرٍ فَضُرِبَتْ لَهُ بِنَمِرَةَ فَسَارَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ لاَ تَشُكُّ قُرَيْشٌ إِلاَّ أَنَّهُ وَاقِفٌ عِنْدَ الْمَشْعَرِ الْحَرَامِ أَوِ الْمُزْدَلِفَةِ كَمَا كَانَتْ قُرَيْشٌ تَصْنَعُ فِي الْجَاهِلِيَّةِ فَأَجَازَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ حَتَّى أَتَى عَرَفَةَ فَوَجَدَ الْقُبَّةَ قَدْ ضُرِبَتْ لَهُ بِنَمِرَةَ فَنَزَلَ بِهَا حَتَّى إِذَا زَاغَتِ الشَّمْسُ أَمَرَ بِالْقَصْوَاءِ فَرُحِلَتْ لَهُ فَرَكِبَ حَتَّى أَتَى بَطْنَ الْوَادِي فَخَطَبَ النَّاسَ فَقَالَ ‏\"‏ إِنَّ دِمَاءَكُمْ وَأَمْوَالَكُمْ عَلَيْكُمْ حَرَامٌ كَحُرْمَةِ يَوْمِكُمْ هَذَا فِي شَهْرِكُمْ هَذَا فِي بَلَدِكُمْ هَذَا أَلاَ وَإِنَّ كُلَّ شَىْءٍ مِنْ أَمْرِ الْجَاهِلِيَّةِ مَوْضُوعٌ تَحْتَ قَدَمَىَّ هَاتَيْنِ وَدِمَاءُ الْجَاهِلِيَّةِ مَوْضُوعَةٌ وَأَوَّلُ دَمٍ أَضَعُهُ دَمُ رَبِيعَةَ بْنِ الْحَارِثِ - كَانَ مُسْتَرْضِعًا فِي بَنِي سَعْدٍ فَقَتَلَتْهُ هُذَيْلٌ - وَرِبَا الْجَاهِلِيَّةِ مَوْضُوعٌ وَأَوَّلُ رِبًا أَضَعُهُ رِبَانَا رِبَا الْعَبَّاسِ بْنِ عَبْدِ الْمُطَّلِبِ فَإِنَّهُ مَوْضُوعٌ كُلُّهُ فَاتَّقُوا اللَّهَ فِي النِّسَاءِ فَإِنَّكُمْ أَخَذْتُمُوهُنَّ بِأَمَانَةِ اللَّهِ وَاسْتَحْلَلْتُمْ فُرُوجَهُنَّ بِكَلِمَةِ اللَّهِ وَإِنَّ لَكُمْ عَلَيْهِنَّ أَنْ لاَ يُوطِئْنَ فُرُشَكُمْ أَحَدًا تَكْرَهُونَهُ فَإِنْ فَعَلْنَ ذَلِكَ فَاضْرِبُوهُنَّ ضَرْبًا غَيْرَ مُبَرِّحٍ وَلَهُنَّ عَلَيْكُمْ رِزْقُهُنَّ وَكِسْوَتُهُنَّ بِالْمَعْرُوفِ وَقَدْ تَرَكْتُ فِيكُمْ مَا لَمْ تَضِلُّوا إِنِ اعْتَصَمْتُمْ بِهِ كِتَابَ اللَّهِ وَأَنْتُمْ مَسْئُولُونَ عَنِّي فَمَا أَنْتُمْ قَائِلُونَ ‏\"‏ ‏.‏ قَالُوا نَشْهَدُ أَنَّكَ قَدْ بَلَّغْتَ وَأَدَّيْتَ وَنَصَحْتَ ‏.‏ فَقَالَ بِإِصْبَعِهِ السَّبَّابَةِ إِلَى السَّمَاءِ وَيَنْكُبُهَا إِلَى النَّاسِ ‏\"‏ اللَّهُمَّ اشْهَدِ اللَّهُمَّ اشْهَدْ ‏\"‏ ‏.‏ ثَلاَثَ مَرَّاتٍ ثُمَّ أَذَّنَ بِلاَلٌ ثُمَّ أَقَامَ فَصَلَّى الظُّهْرَ ثُمَّ أَقَامَ فَصَلَّى الْعَصْرَ وَلَمْ يُصَلِّ بَيْنَهُمَا شَيْئًا ثُمَّ رَكِبَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ حَتَّى أَتَى الْمَوْقِفَ فَجَعَلَ بَطْنَ نَاقَتِهِ إِلَى الصَّخَرَاتِ وَجَعَلَ حَبْلَ الْمُشَاةِ بَيْنَ يَدَيْهِ وَاسْتَقْبَلَ الْقِبْلَةَ فَلَمْ يَزَلْ وَاقِفًا حَتَّى غَرَبَتِ الشَّمْسُ وَذَهَبَتِ الصُّفْرَةُ قَلِيلاً حَتَّى غَابَ الْقُرْصُ وَأَرْدَفَ أُسَامَةَ بْنَ زَيْدٍ خَلْفَهُ فَدَفَعَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ وَقَدْ شَنَقَ الْقَصْوَاءَ بِالزِّمَامِ حَتَّى إِنَّ رَأْسَهَا لَيُصِيبُ مَوْرِكَ رَحْلِهِ وَيَقُولُ بِيَدِهِ الْيُمْنَى ‏\"‏ أَيُّهَا النَّاسُ السَّكِينَةَ السَّكِينَةَ ‏\"‏ ‏.‏ كُلَّمَا أَتَى حَبْلاً مِنَ الْحِبَالِ أَرْخَى لَهَا قَلِيلاً حَتَّى تَصْعَدَ ثُمَّ أَتَى الْمُزْدَلِفَةَ فَصَلَّى بِهَا الْمَغْرِبَ وَالْعِشَاءَ بِأَذَانٍ وَاحِدٍ وَإِقَامَتَيْنِ وَلَمْ يُصَلِّ بَيْنَهُمَا شَيْئًا ثُمَّ اضْطَجَعَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ حَتَّى طَلَعَ الْفَجْرُ فَصَلَّى الْفَجْرَ حِينَ تَبَيَّنَ لَهُ الصُّبْحُ بِأَذَانٍ وَإِقَامَةٍ ثُمَّ رَكِبَ الْقَصْوَاءَ حَتَّى أَتَى الْمَشْعَرَ الْحَرَامَ فَرَقِيَ عَلَيْهِ فَحَمِدَ اللَّهَ وَكَبَّرَهُ وَهَلَّلَهُ فَلَمْ يَزَلْ وَاقِفًا حَتَّى أَسْفَرَ جِدًّا ثُمَّ دَفَعَ قَبْلَ أَنْ تَطْلُعَ الشَّمْسُ وَأَرْدَفَ الْفَضْلَ بْنَ الْعَبَّاسِ وَكَانَ رَجُلاً حَسَنَ الشَّعَرِ أَبْيَضَ وَسِيمًا فَلَمَّا دَفَعَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ مَرَّ الظُّعُنُ يَجْرِينَ فَطَفِقَ الْفَضْلُ يَنْظُرُ إِلَيْهِنَّ فَوَضَعَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ يَدَهُ مِنَ الشِّقِّ الآخَرِ فَصَرَفَ الْفَضْلُ وَجْهَهُ مِنَ الشِّقِّ الآخَرِ يَنْظُرُ حَتَّى أَتَى مُحَسِّرًا حَرَّكَ قَلِيلاً ثُمَّ سَلَكَ الطَّرِيقَ الْوُسْطَى الَّتِي تُخْرِجُكَ إِلَى الْجَمْرَةِ الْكُبْرَى حَتَّى أَتَى الْجَمْرَةَ الَّتِي عِنْدَ الشَّجَرَةِ فَرَمَى بِسَبْعِ حَصَيَاتٍ يُكَبِّرُ مَعَ كُلِّ حَصَاةٍ مِنْهَا مِثْلِ حَصَى الْخَذْفِ وَرَمَى مِنْ بَطْنِ الْوَادِي ثُمَّ انْصَرَفَ إِلَى الْمَنْحَرِ فَنَحَرَ ثَلاَثًا وَسِتِّينَ بَدَنَةً بِيَدِهِ وَأَعْطَى عَلِيًّا فَنَحَرَ مَا غَبَرَ وَأَشْرَكَهُ فِي هَدْيِهِ ثُمَّ أَمَرَ مِنْ كُلِّ بَدَنَةٍ بِبَضْعَةٍ فَجُعِلَتْ فِي قِدْرٍ فَطُبِخَتْ فَأَكَلاَ مِنْ لَحْمِهَا وَشَرِبَا مِنْ مَرَقِهَا ثُمَّ أَفَاضَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ إِلَى الْبَيْتِ فَصَلَّى بِمَكَّةَ الظُّهْرَ فَأَتَى بَنِي عَبْدِ الْمُطَّلِبِ وَهُمْ يَسْقُونَ عَلَى زَمْزَمَ فَقَالَ ‏\"‏ انْزِعُوا بَنِي عَبْدِ الْمُطَّلِبِ لَوْلاَ أَنْ يَغْلِبَكُمُ النَّاسُ عَلَى سِقَايَتِكُمْ لَنَزَعْتُ مَعَكُمْ ‏\"‏ ‏.‏ فَنَاوَلُوهُ دَلْوًا فَشَرِبَ مِنْهُ ‏.‏","english":{"narrator":"Ja’far\nbin Muhammad narrated that his father said:","text":"“We entered upon Jabir\nbin ‘Abdullah, and when we reached him he asked about the people\n(i.e., what their names were, etc.). When he reached me, I said: ‘I\nam Muhammad bin ‘Ali bin Husain.’ He stretched forth his hand\ntowards my head, and undid my top button, then undid my lower button.\nThen he placed his hand on my chest, and I was a young boy at that\ntime. Then he said: ‘Welcome to you, ask whatever you want.’ So I\nasked him, and he was blind. The time for prayer came, so he stood\nup, wrapping himself in a woven cloth. Every time he put it on his\nshoulders, its edges came up, because it was too small. And his cloak\nwas beside him on a hook. He led us in prayer, then he said: ‘Tell\nus about the Hajj of the Messenger of Allah (ﷺ).’ He held up his\nhands, showing nine (fingers), and said: ‘The Messenger of Allah\n(ﷺ) stayed for nine years without performing Hajj, then it was\nannounced to the people in the tenth year that the Messenger of Allah\n(ﷺ) was going for Hajj. So many people came to Al-Madinah, all of\nthem seeking to follow the Messenger of Allah (ﷺ) and do what he\ndid. He set out and we set out with him, and we came to Dhul-Hulaifah\nwhere Asma’ bint ‘Umais gave birth to Muhammad bin Abu Bakr. She\nsent word to the Messenger of Allah (ﷺ) asking what she should do.\nHe said: “Perform Ghusl, fasten a cloth around your waist and enter\nIhram.” The Messenger of Allah (ﷺ) prayed in the mosque, then he\nrode Qaswa’ (his she-camel) until, when his she-camel arose with\nhim upon Baida’,’ Jabir said: ‘As far as I could see, I saw\npeople riding and walking in front of him, and I saw the same to his\nright and left, and behind him, and the Messenger of Allah (ﷺ) was\namong us and Qur’an was being revealed to him, and he understood\nits meaning. Whatever he did, we did too. Then he began the Talbiyah of\nmonotheism: “Labbaika Allahumma labbaik, labbaika la sharika laka\nlabbaik. Innal-hamda wan-ni’mata laka wal-mulk, la sharika laka\n(Here I am, O Allah, here I am. Here I am, You have no partner, here\nI am. Verily all praise and blessings are Yours, and all sovereignty,\nYou have no partner).” And the people repeated his words. And the\nMessenger of Allah (ﷺ) approved of that. And the Messenger of Allah\n(ﷺ) continued to recite the Talbiyah.’ Jabir said: ‘We did not\nintend (to do) anything but Hajj. We were not aware of ‘Umrah. Then\nwhen we reached the House with him, he touched the Corner, and walked\nquickly (Ramal) for three circuits and walked (normally) for four.\nThen he stood at the place of Ibrahim and said: “And take you\n(people) the place of Ibrahim as a place of prayer.”  He\nstood with the place between him and the House. My father used to\nsay:* “And I do not think that he mentioned it other than from the\nProphet (ﷺ): ‘That he used to recite in those two Rak’ah (at\nthe place of Ibrahim): “Say: ‘O you disbelievers!’”\n and “Say: ‘He is Allah, (the) One.’”\n\n“Then he went back to the House and touched the Corner, then he went out through the gate to Safa. When he drew near to Safa he recited: “Verily, Safa and Marwah are among the symbols of Allah,”  (and said:) “We will start with that with which Allah started.” So he started with Safa and climbed it until he could see the House, then proclaimed the greatness of Allah (by saying: Allahu Akbar) and said Tahlil (La ilaha illallah) and praised Him (saying Al-Hamdulillah), and he said: “La ilaha illallah wahdahu la sharika lahu, lahul-mulku, wa lahul-hamdu, yuhyi wa yumit wa huwa ‘ala kulli shai’in Qadir. La ilaha illallah wahdahu, La sharika lahu anjaza wa’dahu, wa nasara ‘abduhu, wa hazamal-Ahzaba wahdahu (None has the right to be worshiped but Allah alone, with no partner or associate; His is the dominion, all praise is due to Him, He gives life and causes death and He is able to do all things. None has the right to be worshiped but Allah alone; He has no partner or associate, He fulfilled His promise, granted victory to His slave, and defeated the Confederates alone).” And he said that three times, supplication in between. Then he headed towards Marwah walking normally until, when he started to go downhill, he walked quickly (Ramal) in the bottom of the valley. When he started to go uphill, he walked normally, until he reached Marwah, and he did atop Marwah what he had done atop Safa. At the end of his Sa’y, atop Marwah he said: “If I had known before what I have come to know now, I would not have garlanded the sacrificial animal, and I would have made it ‘Umrah. Whoever among you does not have a sacrificial animal with him, let him exit Ihram and make it ‘Umrah.” So all the people exited Ihram and cut their hair, except the Prophet (ﷺ) and those who had sacrificial animals with them. Suraqah bin Malik bin Ju’shum stood up and said: “O Messenger of Allah! Is this for this year only, or forever and ever?” The Messenger of Allah (ﷺ) interlaced his fingers and said: “‘Umrah is included in Hajj like this,” twice. “No, it is forever and ever.” ‘Ali brought the camels of the Prophet (ﷺ), and he found that Fatimah was one of those who had exited Ihram. She had put on a dyed garment and used kohl. ‘Ali disliked this action on her part, but she said: “My father told me to do this.” ‘Ali used to say in Iraq: “So I went to the Messenger of Allah (ﷺ), feeling upset with Fatimah because of what she had done, to ask the Messenger of Allah (ﷺ) about what she had said that he said, and that I had disliked that. He said: ‘She spoke the truth, she spoke the truth. What did you say when you began your Hajj?’” He said: “I said: ‘O Allah, I begin the Talbiyah for that for which your Messenger (ﷺ) begins the Talbiyah.’ (He said:) ‘And I have the sacrificial animal with me, so do not exit Ihram.’ He said: “The total number of sacrificial animals that ‘Ali had brought from Yemen and that the Prophet (ﷺ) brought from Al-Madinah were one hundred. Then all the people exited Ihram and cut their hair, apart from the Prophet (ﷺ) and those who had sacrificial animals with them. When the day of Tarwiyah came (the 8th of Dhul-Hijjah), they headed for Mina and began the Talbiyah for Hajj. The Messenger of Allah (ﷺ) rode. He prayed Zuhr, ‘Asr, Maghrib, ‘Isha’ and Fajr at Mina. Then he stayed for a short while until the sun rose, and he ordered that a tent of goat hair be pitched for him in Namirah. Then the Messenger of Allah (ﷺ) set out, and the Quraish were certain that he was going to stay at Al-Mash’ar Haram or at Al-Muzdalifah, as Quraish used to do during the Ignorance days. But the Messenger of Allah (ﷺ) continued until he came to ‘Arafat, where he found that the tent had been pitched for him in Namirah, and he stopped there. Then when the sun had passed its zenith, he called for Qaswa’ and she was saddled for him. He rode until he came to the bottom of the valley, and he addressed the people and said: ‘Your blood and your wealth are sacred to you, as sacred as this day of yours, in this month of yours, in this land of yours. Every matter of Ignorance days is abolished, beneath these two feet of mine. The blood feuds of the Ignorance days are abolished, and the first blood feud of Rabi’ah bin Harith, who was nursed among Banu Sa’d and killed by Hudhail. The usuries of Ignorance days are abolished, and the first usury (that I abolish) is our usury, the usury due to ‘Abbas bin ‘Abdul-Muttalib. It is all abolished. Fear Allah with regard to women, for you have taken them as a trust from Allah, and intimacy with them has become permissible to you through Allah’s Word. Your rights over them are that they should not allow anyone whom you dislike to sit on your bedding.** If they do that, then hit them, but in a manner that does not cause injury or leave a mark. Their rights over you are that you should provide for them and clothe them in a reasonable manner. I have left behind you something which, if you adhere to it, you will never go astray: the Book of Allah. You will be asked about me. What will you say?’ They said: ‘We bear witness that you have conveyed (the message) and fulfilled (your duty) and offered sincere advice.’ He gestured with his forefinger towards the sky and then towards the people, (and said:) ‘O Allah, bear witness, O Allah bear witness,’ three times. Then Bilal called the Adhan, then the Iqamah, and he prayed Zuhr. Then he made Iqamah and prayed ‘Asr, and he did not offer any prayer between them. Then the Messenger of Allah (ﷺ) rode until he came to the place of standing, and he made his she-camel face Sakharat*** with the path in the sand in front of him, and he faced the Qiblah, then he remained standing until the sun had set and the afterglow had lessened somewhat, when the disk of the sun disappeared. Then he seated Usamah bin Zaid behind him and the Messenger of Allah (ﷺ) set out. He pulled Qaswa’s reins tight until her head was touching the saddle, and he gestured with his right hand: ‘O people, calmly, calmly!’ Every time he came to a hill, he released the reins a little so that she could climb. Then he came to Muzdalifah where he prayed Maghrib and ‘Isha’ with one Adhan and two Iqamah, offering no prayer in between. Then the Messenger of Allah (ﷺ) lay down until dawn came, and he prayed Fajr, when he saw that morning had come, with one Adhan and one Iqamah. Then he rode Qaswa’ until he came to Al-Mash’ar Al-Haram. He climbed it and praised Allah and proclaimed His greatness and that He is the only One worthy of worship. Then he remained standing until it had become quite bright, then he moved on before the sun rose. He seated Fadl bin ‘Abbas behind him, who was a man with lovely hair, white and handsome. When the Messenger of Allah (ﷺ) moved on, he passed some women riding camels. Fadl started to look at them, so the Messenger of Allah (ﷺ) put his hand on the other side. Fadl turned his face to the other side to look. When he came to Muhassir, he sped up a little. Then he followed the middle road that brings you out to the biggest Pillar, until he reached the Pillar that is by the tree. He threw seven pebbles, saying the Takbir with each throw, pebbles suitable for Khadhf (i.e., the size of a chickpea) throwing from the bottom of the valley. Then he went to the place of slaughter, and slaughtered sixty-three camels with his own hand. Then he handed it over to ‘Ali who slaughtered the rest, and he gave him a share in his sacrificial animal. Then he ordered that a piece from each camel be brought; (the pieces) were put in a pot and cooked, and they (the Prophet (ﷺ) and ‘Ali) ate from the meat and drank from the soup. Then the Messenger of Allah (ﷺ) hastened to the House, and prayed Zuhr in Makkah. He came to Banu ‘Abdul-Muttalib, who were providing water to the pilgrims at Zamzam, and said: ‘Draw me some water, O Banu ‘Abdul-Muttalib. Were it not that the people would overwhelm you, I would have drawn water with you.’ So they drew up a bucket for him and he drank from it.’”\n\n\n* It appears that the speaker is Ja’far bin Muhammad who is narrating from his father, from Jabir. \n**And they say that the meaning if ‘your furniture’ or, ‘your special place’ in which case the objective is to say that the wife is not to admit anyone in the house whom the husband would be displeased with.\n***Sakharat plural of Sakhrah rock or boulder. Nawawi said: “They are the rocks that lay at the base of the Mount of Mercy, and it is the mount in the middle of ‘Arafat.”"}},{"id":194,"idInBook":194,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ الْعَبْدِيُّ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، حَدَّثَنِي يَحْيَى بْنُ عَبْدِ الرَّحْمَنِ بْنِ حَاطِبٍ، عَنْ عَائِشَةَ، قَالَتْ خَرَجْنَا مَعَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ لِلْحَجِّ عَلَى أَنْوَاعٍ ثَلاَثَةٍ فَمِنَّا مَنْ أَهَلَّ بِحَجٍّ وَعُمْرَةٍ مَعًا وَمِنَّا مَنْ أَهَلَّ بِحَجٍّ مُفْرَدٍ وَمِنَّا مَنْ أَهَلَّ بِعُمْرَةٍ مُفْرَدَةٍ ‏.‏ فَمَنْ كَانَ أَهَلَّ بِحَجٍّ وَعُمْرَةٍ مَعًا لَمْ يَحْلِلْ مِنْ شَىْءٍ مِمَّا حَرُمَ مِنْهُ حَتَّى يَقْضِيَ مَنَاسِكَ الْحَجِّ وَمَنْ أَهَلَّ بِالْحَجِّ مُفْرَدًا لَمْ يَحْلِلْ مِنْ شَىْءٍ مِمَّا حَرُمَ مِنْهُ حَتَّى يَقْضِيَ مَنَاسِكَ الْحَجِّ وَمَنْ أَهَلَّ بِعُمْرَةٍ مُفْرَدَةٍ فَطَافَ بِالْبَيْتِ وَبَيْنَ الصَّفَا وَالْمَرْوَةِ حَلَّ مَا حَرُمَ مِنْهُ حَتَّى يَسْتَقْبِلَ حَجًّا ‏.‏","english":{"narrator":"It was\nnarrated that ‘Aishah said:","text":"“We went out with the Messenger of\nAllah (ﷺ) for Hajj in three ways. Some of us began the Talbiyah for\nHajj and ‘Umrah together, some of us began the Talbiyah for Hajj on\nits own, and some of us began the Talbiyah for ‘Umrah on its own.\nThose who began the Talbiyah for Hajj and ‘Umrah together did not\nexit\nIhram at all until they had completed the rites of Hajj. Those\nwho\nbegan the Talbiyah for Hajj on its own did not exit ihram at all\nuntil\nthey had completed the rites of Hajj. And those who began the\nTalbiyah\nfor ‘Umrah on its own circumambulated the House and ran\nbetween Safa\nand Marwah, then whatever had been forbidden to them\nbecame\npermissible until the time for Hajj came.”"}},{"id":195,"idInBook":195,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا الْقَاسِمُ بْنُ مُحَمَّدِ بْنِ عَبَّادٍ الْمُهَلَّبِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دَاوُدَ، حَدَّثَنَا سُفْيَانُ، قَالَ حَجَّ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ثَلاَثَ حَجَّاتٍ حِجَّتَيْنِ قَبْلَ أَنْ يُهَاجِرَ وَحَجَّةً بَعْدَ مَا هَاجَرَ مِنَ الْمَدِينَةِ وَقَرَنَ مَعَ حَجَّتِهِ عُمْرَةً وَاجْتَمَعَ مَا جَاءَ بِهِ النَّبِيُّ ـ صلى الله عليه وسلم ـ وَمَا جَاءَ بِهِ عَلِيٌّ مِائَةَ بَدَنَةٍ مِنْهَا جَمَلٌ لأَبِي جَهْلٍ فِي أَنْفِهِ بُرَةٌ مِنْ فِضَّةٍ فَنَحَرَ النَّبِيُّ ـ صلى الله عليه وسلم ـ بِيَدِهِ ثَلاَثًا وَسِتِّينَ وَنَحَرَ عَلِيٌّ مَا غَبَرَ ‏.‏ قِيلَ لَهُ مَنْ ذَكَرَهُ قَالَ جَعْفَرٌ عَنْ أَبِيهِ عَنْ جَابِرٍ وَابْنُ أَبِي لَيْلَى عَنِ الْحَكَمِ عَنْ مِقْسَمٍ عَنِ ابْنِ عَبَّاسٍ ‏.‏","english":{"narrator":"Sufyan\nsaid:","text":"“The Messenger of Allah (ﷺ) performed Hajj three\ntimes,\ntwice before he emigrated, and once after he had emigrated, and\nonce\nafter he had emigrated to Al-Madinah. He performed ‘Umrah along\nwith his Hajj. The total number of camels brought by the Prophet\n(ﷺ)\nand ‘Ali was one hundred. Among them was a (male) camel\nbelonging to\nAbu Jahl, which had a silver ring in its nose. The\nProphet (ﷺ)\nslaughtered sixty-three with his own hand, and ‘Ali\nslaughtered the\nrest.”"}},{"id":196,"idInBook":196,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، وَابْنُ، عُلَيَّةَ عَنْ حَجَّاجِ بْنِ أَبِي عُثْمَانَ، حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ، حَدَّثَنِي عِكْرِمَةُ، حَدَّثَنِي الْحَجَّاجُ بْنُ عَمْرٍو الأَنْصَارِيُّ، قَالَ سَمِعْتُ النَّبِيَّ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\n\"‏ مَنْ كُسِرَ أَوْ عَرِجَ فَقَدْ حَلَّ وَعَلَيْهِ حَجَّةٌ أُخْرَى ‏\"‏ ‏.‏ \n فَحَدَّثْتُ بِهِ ابْنَ عَبَّاسٍ، وَأَبَا، هُرَيْرَةَ فَقَالاَ صَدَقَ ‏.‏","english":{"narrator":"It was\nnarrated from ‘Ikrimah:","text":"“Hajjaj bin ‘Amr Ansari narrated to\nme,\nhe said: ‘I heard the Prophet (ﷺ) say: “Whoever breaks a bone\nor\nbecomes lame, has exited Ihram, but he must perform another Hajj.”"}},{"id":197,"idInBook":197,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَنْبَأَنَا مَعْمَرٌ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ عِكْرِمَةَ، عَنْ عَبْدِ اللَّهِ بْنِ رَافِعٍ، - مَوْلَى أُمِّ سَلَمَةَ - قَالَ سَأَلْتُ الْحَجَّاجَ بْنَ عَمْرٍو عَنْ حَبْسِ الْمُحْرِمِ فَقَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ مَنْ كُسِرَ أَوْ مَرِضَ أَوْ عَرِجَ فَقَدْ حَلَّ وَعَلَيْهِ الْحَجُّ مِنْ قَابِلٍ ‏\"‏ ‏.‏ \n قَالَ عِكْرِمَةُ فَحَدَّثْتُ بِهِ ابْنَ عَبَّاسٍ، وَأَبَا، هُرَيْرَةَ فَقَالاَ صَدَقَ ‏.‏ قَالَ عَبْدُ الرَّزَّاقِ فَوَجَدْتُهُ فِي جُزْءِ هِشَامٍ صَاحِبِ الدَّسْتَوَائِيِّ فَأَتَيْتُ بِهِ مَعْمَرًا فَقَرَأَ عَلَىَّ أَوْ قَرَأْتُ عَلَيْهِ ‏.‏","english":{"narrator":"It was\nnarrated from ‘Ikrimah, from ‘Abdullah bin Rafi’, the freed\nslave of Umm Salamah, that he said:","text":"“I asked Hajjaj bin ‘Amr\nabout a Muhrim being prevented (from completing Hajj). He said: ‘The\nMessenger of Allah (ﷺ) said: “Whoever breaks a bone, falls sick\nor becomes lame, has exited Ihram, and he has to perform Hajj the\nfollowing year.”\n\n'Ikrimah (a subnarrator) said: I narrated it to Ibn 'Abbas and Abu Hurairah. They said he spoke the truth."}},{"id":198,"idInBook":198,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، وَمُحَمَّدُ بْنُ الْوَلِيدِ، قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الأَصْبَهَانِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ مَعْقِلٍ، قَالَ قَعَدْتُ إِلَى كَعْبِ بْنِ عُجْرَةَ فِي الْمَسْجِدِ فَسَأَلْتُهُ عَنْ هَذِهِ الآيَةِ، ‏{فَفِدْيَةٌ مِنْ صِيَامٍ أَوْ صَدَقَةٍ أَوْ نُسُكٍ}‏ ‏.‏ قَالَ كَعْبٌ فِيَّ أُنْزِلَتْ كَانَ بِي أَذًى مِنْ رَأْسِي فَحُمِلْتُ إِلَى رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ وَالْقَمْلُ يَتَنَاثَرُ عَلَى وَجْهِي فَقَالَ ‏\"‏ مَا كُنْتُ أُرَى الْجُهْدَ بَلَغَ مِنْكَ مَا أَرَى أَتَجِدُ شَاةً ‏\"‏ ‏.‏ قُلْتُ لاَ ‏.‏ قَالَ فَنَزَلَتْ هَذِهِ الآيَةُ ‏{فَفِدْيَةٌ مِنْ صِيَامٍ أَوْ صَدَقَةٍ أَوْ نُسُكٍ}‏ ‏.‏ قَالَ فَالصَّوْمُ ثَلاَثَةُ أَيَّامٍ وَالصَّدَقَةُ عَلَى سِتَّةِ مَسَاكِينَ لِكُلِّ مِسْكِينٍ نِصْفُ صَاعٍ مِنْ طَعَامٍ وَالنُّسُكُ شَاةٌ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Abdullah bin Ma’qil said:","text":"“I sat with Ka’b bin\n‘Ujrah in the mosque and asked him about this Verse: ‘He must pay\na\ncompensation of either fasting (three days) or giving charity\n(feeding\nsix poor persons) or offering sacrifice (one sheep).’\n Ka’b\nsaid: it was revealed concerning me. I had trouble\nwith my head, so I\nwas carried to the Messenger of Allah (ﷺ), with\nlice crawling on my\nface. He said: ‘I did not think that you were\nsuffering as much as I\nsee. Do you have a sheep?’ I said: ‘No.’\nThen this Verse was revealed:\n“He must pay a Fidyah (ransom) of\neither fasting (three days) or\ngiving Sadaqah (charity – feeding\nsix poor persons) or offering\nsacrifice (one sheep).”  He\nsaid: ‘Fasting is three days,\ncharity is to be given to six poor\npersons, giving each one half of a\nSa’ of food, and the sacrifice\nis a sheep.’”"}},{"id":199,"idInBook":199,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نَافِعٍ، عَنْ أُسَامَةَ بْنِ زَيْدٍ، عَنْ مُحَمَّدِ بْنِ كَعْبٍ، عَنْ كَعْبِ بْنِ عُجْرَةَ، قَالَ أَمَرَنِي النَّبِيُّ ـ صلى الله عليه وسلم ـ حِينَ آذَانِي الْقَمْلُ أَنْ أَحْلِقَ رَأْسِي وَأَصُومَ ثَلاَثَةَ أَيَّامٍ أَوْ أُطْعِمَ سِتَّةَ مَسَاكِينَ وَقَدْ عَلِمَ أَنْ لَيْسَ عِنْدِي مَا أَنْسُكُ ‏.‏","english":{"narrator":"It was\nnarrated that Ka’b bin ‘Ujrah said:","text":"“The Prophet (ﷺ)\ncommanded me, when I was suffering, from live, to shave my head and\nfast for three days or feed six poor persons. He knew that I did not\nhave an animal I could sacrifice.”"}},{"id":200,"idInBook":200,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، أَنْبَأَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ، عَنْ مِقْسَمٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ احْتَجَمَ وَهُوَ صَائِمٌ مُحْرِمٌ ‏.‏","english":{"narrator":"","text":"It was\nnarrated from Ibn ‘Abbas that the Prophet (ﷺ) was treated\nwith\ncupping when he was fasting and in the state of Ihram."}},{"id":201,"idInBook":201,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا بَكْرُ بْنُ خَلَفٍ أَبُو بِشْرٍ، حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي الضَّيْفِ، عَنِ ابْنِ خُثَيْمٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ احْتَجَمَ وَهُوَ مُحْرِمٌ مِنْ رَهْصَةٍ أَخَذَتْهُ ‏.‏","english":{"narrator":"","text":"It was\nnarrated from Jabir that the Prophet (ﷺ) was treated with\ncupping\nwhen he was in the state of Ihram, because he did not feel\nwell."}},{"id":202,"idInBook":202,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ فَرْقَدٍ السَّبَخِيِّ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ كَانَ يَدَّهِنُ رَأْسَهُ بِالزَّيْتِ وَهُوَ مُحْرِمٌ غَيْرَ الْمُقَتَّتِ ‏.‏","english":{"narrator":"","text":"It was\nnarrated from Ibn ‘Umar that the Prophet (ﷺ) used to put oil\non\nhis head when he was in the state of Ihram, but not oil that was\nperfumed."}},{"id":203,"idInBook":203,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَجُلاً، أَوْقَصَتْهُ رَاحِلَتُهُ وَهُوَ مُحْرِمٌ فَقَالَ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏\"‏ اغْسِلُوهُ بِمَاءٍ وَسِدْرٍ وَكَفِّنُوهُ فِي ثَوْبَيْهِ وَلاَ تُخَمِّرُوا وَجْهَهُ وَلاَ رَأْسَهُ فَإِنَّهُ يُبْعَثُ يَوْمَ الْقِيَامَةِ مُلَبِّيًا ‏\"‏ ‏.‏ \n حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، مِثْلَهُ إِلاَّ أَنَّهُ قَالَ أَعْقَصَتْهُ رَاحِلَتُهُ ‏.‏ وَقَالَ ‏\"‏ لاَ تُقَرِّبُوهُ طِيبًا فَإِنَّهُ يُبْعَثُ يَوْمَ الْقِيَامَةِ مُلَبِّيًا ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Ibn ‘Abbas that a man’s neck was broken by his\nmount (from falling) while he was in the state of Ihram. The Prophet\n(ﷺ) said:","text":"“Wash him with water and lote leaves, and shroud him in\nhis two garments, but do not cover his face or his head, for he will\nbe raised on the Day of Resurrection reciting the Talbiyah.”\n\nAnother chain reports the same except a different verb was used for the break of the neck and he said \"do not bring him near perfume, for he will be raised on the Day of Resurrection reciting the Talbiyah.”"}},{"id":204,"idInBook":204,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُبَيْدِ بْنِ عُمَيْرٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَمَّارٍ، عَنْ جَابِرٍ، قَالَ جَعَلَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ فِي الضَّبُعِ يُصِيبُهُ الْمُحْرِمُ كَبْشًا وَجَعَلَهُ مِنَ الصَّيْدِ ‏.‏","english":{"narrator":"It was\nnarrated that Jabir said:","text":"“The Messenger of Allah (ﷺ)\nstipulated\n(the penalty of) a man for a hyena killed by a man in\nIhram, and he\nconsidered it as game.”"}},{"id":205,"idInBook":205,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ مُوسَى الْقَطَّانُ الْوَاسِطِيُّ، حَدَّثَنَا يَزِيدُ بْنُ مَوْهَبٍ، حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ الْفَزَارِيُّ، حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ الْعَزِيزِ، حَدَّثَنَا حُسَيْنٌ الْمُعَلِّمُ، عَنْ أَبِي الْمُهَزِّمِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ فِي بَيْضِ النَّعَامِ يُصِيبُهُ الْمُحْرِمُ ‏\n\"‏ ثَمَنُهُ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)\nsaid,\nconcerning an ostrich egg taken by a Muhrim:","text":"“Its cost (must be\npaid as a penalty).”"}},{"id":206,"idInBook":206,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ بَشَّارٍ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ الْوَلِيدِ، قَالُوا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، سَمِعْتُ قَتَادَةَ، يُحَدِّثُ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ خَمْسٌ فَوَاسِقُ يُقْتَلْنَ فِي الْحِلِّ وَالْحَرَمِ الْحَيَّةُ وَالْغُرَابُ الأَبْقَعُ وَالْفَأْرَةُ وَالْكَلْبُ الْعَقُورُ وَالْحِدَأَةُ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from ‘Aishah that the Prophet (ﷺ) said:","text":"“There are\nfive vermin that might be killed whether one is in or outside the\nsacred precincts: the snake, the speckled crow, the mouse, the\nvicious\ndog, and the kite.”"}},{"id":207,"idInBook":207,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ خَمْسٌ مِنَ الدَّوَابِّ لاَ جُنَاحَ عَلَى مَنْ قَتَلَهُنَّ - أَوْ قَالَ فِي قَتْلِهِنَّ - وَهُوَ حَرَامٌ الْعَقْرَبُ وَالْغُرَابُ وَالْحِدَأَةُ وَالْفَأْرَةُ وَالْكَلْبُ الْعَقُورُ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Ibn ‘Umar that the Messenger of Allah (ﷺ)\nsaid:","text":"“There are five animals, for which there is no sin on a person\nif\nhe kills them” – or he said: “if he kills them when in Ihram –\nthe\nscorpion, the crow, the kite, the mouse and the vicious dog.”"}},{"id":208,"idInBook":208,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ، عَنِ ابْنِ أَبِي نُعْمٍ، عَنْ أَبِي سَعِيدٍ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ أَنَّهُ قَالَ ‏\n\"‏ يَقْتُلُ الْمُحْرِمُ الْحَيَّةَ وَالْعَقْرَبَ وَالسَّبُعَ الْعَادِيَ وَالْكَلْبَ الْعَقُورَ وَالْفَأْرَةَ الْفُوَيْسِقَةَ ‏\"‏ ‏.‏ فَقِيلَ لَهُ لِمَ قِيلَ لَهَا الْفُوَيْسِقَةُ قَالَ لأَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ اسْتَيْقَظَ لَهَا وَقَدْ أَخَذَتِ الْفَتِيلَةَ لِتُحْرِقَ بِهَا الْبَيْتَ ‏.‏","english":{"narrator":"It was\nnarrated from Abu Sa’eed that the Prophet (ﷺ) said:","text":"‘The one\nin\nIhram may kill the snake, the scorpion, the aggressive predator,\nthe\nvicious dog and the harmful mouse.” It was said to him: “Why is\nit\nsaid that they are harmful?” He said:* “Because the Messenger\nof Allah\n(ﷺ) woke up because of one, and it had taken the wick (of\nthe lamp)\nto burn down the house.”"}},{"id":209,"idInBook":209,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَهِشَامُ بْنُ عَمَّارٍ، قَالاَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، جَمِيعًا عَنِ ابْنِ شِهَابٍ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ أَنْبَأَنَا صَعْبُ بْنُ جَثَّامَةَ، قَالَ مَرَّ بِي رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ وَأَنَا بِالأَبْوَاءِ أَوْ بِوَدَّانَ فَأَهْدَيْتُ لَهُ حِمَارَ وَحْشٍ فَرَدَّهُ عَلَىَّ فَلَمَّا رَأَى فِي وَجْهِيَ الْكَرَاهِيَةَ ‏.‏ قَالَ ‏\n\"‏ إِنَّهُ لَيْسَ بِنَا رَدٌّ عَلَيْكَ وَلَكِنَّا حُرُمٌ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Ibn ‘Abbas said:","text":"“Sa;b bin Jaththamah told us:\n‘The\nMessenger of Allah (ﷺ) passed by me when I was in Abwa’ or\nWaddan, and I gave him some meat of a wild donkey, but he gave it\nback\nto me, and when he saw from my face that I was upset, he said:\n‘The\nonly reason that we are giving it back is that we are in\nIhram.’”"}},{"id":210,"idInBook":210,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عِمْرَانُ بْنُ مُحَمَّدِ بْنِ أَبِي لَيْلَى، عَنْ أَبِيهِ، عَنْ عَبْدِ الْكَرِيمِ، عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ، عَنِ ابْنِ عَبَّاسٍ، عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ، قَالَ أُتِيَ النَّبِيُّ ـ صلى الله عليه وسلم ـ بِلَحْمِ صَيْدٍ وَهُوَ مُحْرِمٌ فَلَمْ يَأْكُلْهُ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Ali bin Abu Talib said:","text":"“The Prophet (ﷺ)\nbrought\nsome meat from some game when he was in Ihram, and he did not\neat\nit.”"}},{"id":211,"idInBook":211,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ التَّيْمِيِّ، عَنْ عِيسَى بْنِ طَلْحَةَ، عَنْ طَلْحَةَ بْنِ عُبَيْدِ اللَّهِ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ أَعْطَاهُ حِمَارَ وَحْشٍ وَأَمَرَهُ أَنْ يُفَرِّقَهُ فِي الرِّفَاقِ وَهُمْ مُحْرِمُونَ ‏.‏","english":{"narrator":"","text":"It was\nnarrated from Talhah bin ‘Ubaidullah that the Prophet (ﷺ)\ngave\nhim some wild donkey meat, and told him to distribute it among\nhis\nCompanions, who were in Ihram."}},{"id":212,"idInBook":212,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَنْبَأَنَا مَعْمَرٌ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ، عَنْ أَبِيهِ، قَالَ خَرَجْتُ مَعَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ زَمَنَ الْحُدَيْبِيَةِ فَأَحْرَمَ أَصْحَابُهُ وَلَمْ أُحْرِمْ فَرَأَيْتُ حِمَارًا فَحَمَلْتُ عَلَيْهِ وَاصْطَدْتُهُ فَذَكَرْتُ شَأْنَهُ لِرَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ وَذَكَرْتُ أَنِّي لَمْ أَكُنْ أَحْرَمْتُ وَأَنِّي إِنَّمَا اصْطَدْتُهُ لَكَ فَأَمَرَ النَّبِيُّ ـ صلى الله عليه وسلم ـ أَصْحَابَهُ فَأَكَلُوا وَلَمْ يَأْكُلْ مِنْهُ حِينَ أَخْبَرْتُهُ أَنِّي اصْطَدْتُهُ لَهُ ‏.‏","english":{"narrator":"It was\nnarrated from ‘Abdullah bin Abu Qatadah that his father said:","text":"“I\nwent out with the Messenger of Allah (ﷺ) at the time of\nHudaibiyah,\nand his Companions entered Ihram, but I did not. I saw a\ndonkey do I\nhunted it. I mentioned that to the Messenger of Allah\n(ﷺ) and told\nhim: ‘I had not entered Ihram, and I was hunting it for\nyou.’ The\nProphet (ﷺ) told his Companions to eat it, but he did not\neat from\nit, because I told him that I had hunted it for him.”"}},{"id":213,"idInBook":213,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، وَعَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، أَنَّ عَائِشَةَ، زَوْجَ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَتْ كَانَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ يُهْدِي مِنَ الْمَدِينَةِ فَأَفْتِلُ قَلاَئِدَ هَدْيِهِ ثُمَّ لاَ يَجْتَنِبُ شَيْئًا مِمَّا يَجْتَنِبُ الْمُحْرِمُ ‏.‏","english":{"narrator":"","text":"‘Aishah\nthe wife of the Prophet (ﷺ) said; “The Messenger of Allah\n(ﷺ)\nused to send the sacrificial animal from Al-Madinah, and I would\ntwist the garlands for his sacrificial animal, then, he would not\n(because of that) avoid the things that the one in Ihram avoids.”"}},{"id":214,"idInBook":214,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَتْ كُنْتُ أَفْتِلُ الْقَلاَئِدَ لِهَدْىِ النَّبِيِّ ـ صلى الله عليه وسلم ـ فَيُقَلِّدُ هَدْيَهُ ثُمَّ يَبْعَثُ بِهِ ثُمَّ يُقِيمُ لاَ يَجْتَنِبُ شَيْئًا مِمَّا يَجْتَنِبُهُ الْمُحْرِمُ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Aishah the wife of the Prophet (ﷺ) said:","text":"“I\nused\nto twist the garlands for the sacrificial animal of the Prophet\n(ﷺ), and his sacrificial animal would be garlanded and sent (to\nMakkah), and he would stay (in Al-Madinah) without avoiding any of\nthe\nthings that the one in Ihram avoids.”"}},{"id":215,"idInBook":215,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ أَهْدَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ مَرَّةً غَنَمًا إِلَى الْبَيْتِ فَقَلَّدَهَا ‏.‏","english":{"narrator":"It was\nnarrated that ‘Aishah said:","text":"“On one occasion the Messenger of\nAllah (ﷺ) sent sheep to the House, and he garlanded them.”"}},{"id":216,"idInBook":216,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا وَكِيعٌ، عَنْ هِشَامٍ الدَّسْتَوَائِيِّ، عَنْ قَتَادَةَ، عَنْ أَبِي حَسَّانَ الأَعْرَجِ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ أَشْعَرَ الْهَدْىَ فِي السَّنَامِ الأَيْمَنِ وَأَمَاطَ عَنْهُ الدَّمَ ‏.‏ وَقَالَ عَلِيٌّ فِي حَدِيثِهِ بِذِي الْحُلَيْفَةِ وَقَلَّدَ نَعْلَيْنِ ‏.‏","english":{"narrator":"","text":"It was\nnarrated from Ibn ‘Abbas that the Prophet (ﷺ) marked the\nsacrificial animal on the right side of the hump and wiped away the\nblood."}},{"id":217,"idInBook":217,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حَمَّادُ بْنُ خَالِدٍ، عَنْ أَفْلَحَ، عَنِ الْقَاسِمِ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَلَّدَ وَأَشْعَرَ وَأَرْسَلَ بِهَا وَلَمْ يَجْتَنِبْ مَا يَجْتَنِبُ الْمُحْرِمُ ‏.‏","english":{"narrator":"","text":"It was\nnarrated from ‘Aishah that the Prophet (ﷺ) garlanded, and\nmarked,\nand sent (the sacrificial animals), but he did not avoid\nanything\nthat the one in Ihram avoids."}},{"id":218,"idInBook":218,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، أَنْبَأَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَبْدِ الْكَرِيمِ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ أَبِي لَيْلَى، عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ، قَالَ أَمَرَنِي رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ أَنْ أَقُومَ عَلَى بُدْنِهِ وَأَنْ أَقْسِمَ جِلاَلَهَا وَجُلُودَهَا وَأَنْ لاَ أُعْطِيَ الْجَازِرَ مِنْهَا شَيْئًا وَقَالَ ‏\n\"‏ نَحْنُ نُعْطِيهِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Ali bin Abu Talib said:","text":"“The Messenger of Allah\n(ﷺ) commanded me to look after his sacrificial camels, to share out\ntheir covers and skins, and not to give the butcher any of it. He\nsaid: ‘We will give him (his wages).’”"}},{"id":219,"idInBook":219,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ أَبِي لَيْلَى، عَنِ الْحَكَمِ، عَنْ مِقْسَمٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ أَهْدَى فِي بُدْنِهِ جَمَلاً لأَبِي جَهْلٍ بُرَتُهُ مِنْ فِضَّةٍ ‏.‏","english":{"narrator":"","text":"It was\nnarrated from Ibn ‘Abbas that among the sacrificial animals\nthe\nProphet (ﷺ) included a (male) camel belonging to Abu Jahl, which\nhad a silver nose ring."}},{"id":220,"idInBook":220,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، أَنْبَأَنَا مُوسَى بْنُ عُبَيْدَةَ، عَنْ إِيَاسِ بْنِ سَلَمَةَ، عَنْ أَبِيهِ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ كَانَ فِي بُدْنِهِ جَمَلٌ ‏.‏","english":{"narrator":"","text":"It was\nnarrated from Iyas bin Salamah, from his father, that the\nProphet\n(ﷺ) had a (male) camel among his sacrificial animals."}},{"id":221,"idInBook":221,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا يَحْيَى بْنُ يَمَانٍ، عَنْ سُفْيَانَ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ اشْتَرَى هَدْيَهُ مِنْ قُدَيْدٍ ‏.‏","english":{"narrator":"","text":"It was\nnarrated from Ibn ‘Umar that the Prophet (ﷺ) bought his\nsacrificial animal from Qudaid.*"}},{"id":222,"idInBook":222,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ الثَّوْرِيِّ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، ‏.‏ أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ رَأَى رَجُلاً يَسُوقُ بَدَنَةً فَقَالَ ‏\"‏ ارْكَبْهَا ‏\"‏ ‏.‏ قَالَ إِنَّهَا بَدَنَةٌ ‏.‏ قَالَ ‏\"‏ ارْكَبْهَا وَيْحَكَ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Abu Hurairah that the Prophet (ﷺ) saw a man\ndriving a\ncamel and said:","text":"“Ride it.” He said: “It is a sacrificial\nanimal.” He said: “Ride it, woe to you!”"}},{"id":223,"idInBook":223,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنْ هِشَامٍ، - صَاحِبِ الدَّسْتَوَائِيِّ - عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ مُرَّ عَلَيْهِ بِبَدَنَةٍ فَقَالَ ‏\"‏ ارْكَبْهَا ‏\"‏ ‏.‏ قَالَ إِنَّهَا بَدَنَةٌ ‏.‏ قَالَ ‏\"‏ ارْكَبْهَا ‏\"‏ ‏.‏ قَالَ فَرَأَيْتُهُ رَاكِبَهَا مَعَ النَّبِيِّ ـ صلى الله عليه وسلم ـ فِي عُنُقِهَا نَعْلٌ ‏.‏","english":{"narrator":"It was\nnarrated from Anas bin Malik that the Prophet (ﷺ) was brought a\nsacrificial animal and he said (to the man driving the animal):","text":"“Ride\nit.” He said: “It is a sacrificial animal.” He said: “Ride\nit.” He said: “I saw him riding it with the Prophet (ﷺ), and there was a sandal (tied) around its neck.”"}},{"id":224,"idInBook":224,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ الْعَبْدِيُّ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، عَنْ سِنَانِ بْنِ سَلَمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ ذُؤَيْبًا الْخُزَاعِيَّ، حَدَّثَ أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ كَانَ يَبْعَثُ مَعَهُ بِالْبُدْنِ ثُمَّ يَقُولُ ‏\n\"‏ إِذَا عَطِبَ مِنْهَا شَىْءٌ فَخَشِيتَ عَلَيْهِ مَوْتًا فَانْحَرْهَا ثُمَّ اغْمِسْ نَعْلَهَا فِي دَمِهَا ثُمَّ اضْرِبْ صَفْحَتَهَا وَلاَ تَطْعَمْ مِنْهَا أَنْتَ وَلاَ أَحَدٌ مِنْ أَهْلِ رُفْقَتِكَ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Ibn ‘Abbas that Dhu’aib Al-Khuza’i narrated that\nthe Prophet (ﷺ) used to send the sacrificial animals with him, then\nhe would say:","text":"“If any of them becomes unfit and you are afraid that\nit\nwill die, then slaughter it, dip the sandal (tied around its neck)\nin\nits blood and place it on its side, but neither you nor any of\nyour\ncompanions should eat anything from it.”"}},{"id":225,"idInBook":225,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، وَعَمْرُو بْنُ عَبْدِ اللَّهِ، قَالُوا حَدَّثَنَا وَكِيعٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ نَاجِيَةَ الْخُزَاعِيِّ، - قَالَ عَمْرٌو فِي حَدِيثِهِ وَكَانَ صَاحِبَ بُدْنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ - قَالَ قُلْتُ يَا رَسُولَ اللَّهِ كَيْفَ أَصْنَعُ بِمَا عَطِبَ مِنَ الْبُدْنِ قَالَ ‏\n\"‏ انْحَرْهُ وَاغْمِسْ نَعْلَهُ فِي دَمِهِ ثُمَّ اضْرِبْ صَفْحَتَهُ وَخَلِّ بَيْنَهُ وَبَيْنَ النَّاسِ فَلْيَأْكُلُوهُ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Najiyah Al-Khuza’i – in his narration, ‘Amr (one\nof the narrators) said that he was the one who looked after the\nsacrificial animals of the Prophet (ﷺ) – said:","text":"“I said: ‘O\nMessenger\nof Allah, what should I do with those sacrificial animals\nthat become\nunfit?’ He said: ‘Slaughter them, dip its sandal in\nits blood, then\nplace it on its side, and leave them for the people\nto eat.’”"}},{"id":226,"idInBook":226,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ، عَنْ عُمَرَ بْنِ سَعِيدِ بْنِ أَبِي حُسَيْنٍ، عَنْ عُثْمَانَ بْنِ أَبِي سُلَيْمَانَ، عَنْ عَلْقَمَةَ بْنِ نَضْلَةَ، قَالَ تُوُفِّيَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ وَأَبُو بَكْرٍ وَعُمَرُ وَمَا تُدْعَى رِبَاعُ مَكَّةَ إِلاَّ السَّوَائِبَ مَنِ احْتَاجَ سَكَنَ وَمَنِ اسْتَغْنَى أَسْكَنَ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Alqamah bin Nadlah said:","text":"“The Messenger of\nAllah\n(ﷺ), Abu Bakr and ‘Umar died, and the houses in Makkah were\nstill\ncalled free. Whoever needed to, lived there, and whoever had no\nneed\nof them allowed others to live there (without asking for rent).”"}},{"id":227,"idInBook":227,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا عِيسَى بْنُ حَمَّادٍ الْمِصْرِيُّ، أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، أَخْبَرَنِي عُقَيْلٌ، عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ، أَنَّهُ قَالَ إِنَّ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ أَخْبَرَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عَدِيِّ بْنِ الْحَمْرَاءِ قَالَ لَهُ رَأَيْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ وَهُوَ عَلَى رَاحِلَتِهِ وَاقِفٌ بِالْحَزْوَرَةِ يَقُولُ ‏\n\"‏ وَاللَّهِ إِنَّكِ لَخَيْرُ أَرْضِ اللَّهِ وَأَحَبُّ أَرْضِ اللَّهِ إِلَيَّ وَاللَّهِ لَوْلاَ أَنِّي أُخْرِجْتُ مِنْكِ مَا خَرَجْتُ ‏\"‏ ‏.‏","english":{"narrator":"Abu\nSalamah bin ‘Abdur-Rahman bin ‘Awf narrated that ‘Abdullah bin\n‘Adiy bin Hamra’ said to him:","text":"“I saw the Messenger of Allah\n(ﷺ),\nwhen he was on his she-camel, standing in Al-Hazwarah* saying:\n‘By\nAllah, you are the best land of Allah, and the dearest of the\nland of\nAllah to me. By Allah, had I not been expelled from you I\nwould never\nhave left.’”\n\n*A place in Makkah."}},{"id":228,"idInBook":228,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا يُونُسُ بْنُ بُكَيْرٍ، حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاقَ، حَدَّثَنَا أَبَانُ بْنُ صَالِحٍ، عَنِ الْحَسَنِ بْنِ مُسْلِمِ بْنِ يَنَّاقٍ، عَنْ صَفِيَّةَ بِنْتِ شَيْبَةَ، قَالَتْ سَمِعْتُ النَّبِيَّ ـ صلى الله عليه وسلم ـ يَخْطُبُ عَامَ الْفَتْحِ فَقَالَ ‏\"‏ يَا أَيُّهَا النَّاسُ إِنَّ اللَّهَ حَرَّمَ مَكَّةَ يَوْمَ خَلَقَ السَّمَوَاتِ وَالأَرْضَ فَهِيَ حَرَامٌ إِلَى يَوْمِ الْقِيَامَةِ لاَ يُعْضَدُ شَجَرُهَا وَلاَ يُنَفَّرُ صَيْدُهَا وَلاَ يَأْخُذُ لُقَطَتَهَا إِلاَّ مُنْشِدٌ ‏\"‏ ‏.‏ فَقَالَ الْعَبَّاسُ إِلاَّ الإِذْخِرَ فَإِنَّهُ لِلْبُيُوتِ وَالْقُبُورِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ إِلاَّ الإِذْخِرَ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Safiyyah bint Shaibah said:","text":"“I heard the Prophet\n(ﷺ) delivering a sermon in the Year of the Conquest (of Makkah),\nand he said: ‘O people, Allah made Makkah sacred the day He created\nthe heavens and the earth, and it is sacred until the Day of\nResurrection. Its trees are not to be cut, its game is not to be\ndisturbed, and its lost property is not to be taken except by one who\nwill announce it.’‘Abbas said: ‘Except for Idhkhir (a kind of fragrant grass), for it is (used) for houses and graves.’ The messenger of Allah (ﷺ) said: ‘Except for Idhkhir.’”"}},{"id":229,"idInBook":229,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، وَابْنُ الْفُضَيْلِ، عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ، أَنْبَأَنَا عَبْدُ الرَّحْمَنِ بْنُ سَابِطٍ، عَنْ عَيَّاشِ بْنِ أَبِي رَبِيعَةَ الْمَخْزُومِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ لاَ تَزَالُ هَذِهِ الأُمَّةُ بِخَيْرٍ مَا عَظَّمُوا هَذِهِ الْحُرْمَةَ حَقَّ تَعْظِيمِهَا فَإِذَا ضَيَّعُوا ذَلِكَ هَلَكُوا ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from ‘Ayyash bin Abu Rabi’ah (Makhzumi) that the\nMessenger of Allah (ﷺ) said:","text":"‘The goodness of this nation will\nnot\ncease as long as they revere this sanctuary* as it is due. But\nwhen\nthey lose that reverence, they will be doomed.”"}},{"id":230,"idInBook":230,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، وَأَبُو أُسَامَةَ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ حَفْصِ بْنِ عَاصِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ إِنَّ الإِيمَانَ لَيَأْرِزُ إِلَى الْمَدِينَةِ كَمَا تَأْرِزُ الْحَيَّةُ إِلَى جُحْرِهَا ‏\"‏ ‏.‏","english":{"narrator":"it was\nnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)\nsaid:","text":"“Faith will retreat to Al-Madinah as a snake retreats to its\nhole.”"}},{"id":231,"idInBook":231,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا بَكْرُ بْنُ خَلَفٍ، حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، حَدَّثَنَا أَبِي، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ مَنِ اسْتَطَاعَ مِنْكُمْ أَنْ يَمُوتَ بِالْمَدِينَةِ فَلْيَفْعَلْ فَإِنِّي أَشْهَدُ لِمَنْ مَاتَ بِهَا ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Ibn ‘Umar that the Messenger of Allah (ﷺ)\nsaid:","text":"‘Whoever among you can die in Al-Madinah, let him do so, for I\nwill\nbear witness in favor of those who die there.”"}},{"id":232,"idInBook":232,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو مَرْوَانَ، مُحَمَّدُ بْنُ عُثْمَانَ الْعُثْمَانِيُّ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، عَنِ الْعَلاَءِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ اللَّهُمَّ إِنَّ إِبْرَاهِيمَ خَلِيلُكَ وَنَبِيُّكَ وَإِنَّكَ حَرَّمْتَ مَكَّةَ عَلَى لِسَانِ إِبْرَاهِيمَ اللَّهُمَّ وَأَنَا عَبْدُكَ وَنَبِيُّكَ وَإِنِّي أُحَرِّمُ مَا بَيْنَ لاَبَتَيْهَا ‏\"‏ ‏.‏ قَالَ أَبُو مَرْوَانَ لاَبَتَيْهَا حَرَّتَىِ الْمَدِينَةِ ‏.‏","english":{"narrator":"It was\nnarrated from Abu Hurairah that the Prophet (ﷺ) said:","text":"“O\nAllah!\nIbrahim was Your Friend and Prophet, and You declared Makkah to\nbe\nsacred through Ibrahim. O Allah! I am Your slave and Prophet, and I\ndeclare what is between its two lava fields to be sacred.”"}},{"id":233,"idInBook":233,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ مَنْ أَرَادَ أَهْلَ الْمَدِينَةِ بِسُوءٍ أَذَابَهُ اللَّهُ كَمَا يَذُوبُ الْمِلْحُ فِي الْمَاءِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)\nsaid:","text":"“Whoever wishes bad upon the people of Al-Madinah, Allah will\ncause\nhim to melt as salt melts in water.”"}},{"id":234,"idInBook":234,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ، حَدَّثَنَا عَبْدَةُ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنْ عَبْدِ اللَّهِ بْنِ مِكْنَفٍ، قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، يَقُولُ إِنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ إِنَّ أُحُدًا جَبَلٌ يُحِبُّنَا وَنُحِبُّهُ وَهُوَ عَلَى تُرْعَةٍ مِنْ تُرَعِ الْجَنَّةِ وَعَيْرٌ عَلَى تُرْعَةٍ مِنْ تُرَعِ النَّارِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Abdullah bin Miknaf said:","text":"“I heard Anas bin\nMalik\nsay: ‘The Messenger of Allah (ﷺ) said: “Uhud is a mountain\nwhich loves us and we love it, and it stands at one of the gates of\nParadise. And ‘Aer* stands at one of the gates of Hell.’”"}},{"id":235,"idInBook":235,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا الْمُحَارِبِيُّ، عَنِ الشَّيْبَانِيِّ، عَنْ وَاصِلٍ الأَحْدَبِ، عَنْ شَقِيقٍ، قَالَ بَعَثَ رَجُلٌ مَعِيَ بِدَرَاهِمَ هَدِيَّةً إِلَى الْبَيْتِ ‏.‏ قَالَ فَدَخَلْتُ الْبَيْتَ وَشَيْبَةُ جَالِسٌ عَلَى كُرْسِيٍّ فَنَاوَلْتُهُ إِيَّاهَا ‏.‏ فَقَالَ أَلَكَ هَذِهِ قُلْتُ لاَ وَلَوْ كَانَتْ لِي لَمْ آتِكَ بِهَا ‏.‏ قَالَ أَمَا لَئِنْ قُلْتَ ذَلِكَ لَقَدْ جَلَسَ عُمَرُ بْنُ الْخَطَّابِ مَجْلِسَكَ الَّذِي جَلَسْتَ فِيهِ فَقَالَ لاَ أَخْرُجُ حَتَّى أَقْسِمَ مَالَ الْكَعْبَةِ بَيْنَ فُقَرَاءِ الْمُسْلِمِينَ ‏.‏ قُلْتُ مَا أَنْتَ بِفَاعِلٍ ‏.‏ قَالَ لأَفْعَلَنَّ ‏.‏ قَالَ وَلِمَ ذَاكَ قُلْتُ لأَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَدْ رَأَى مَكَانَهُ ‏.‏ وَأَبُو بَكْرٍ وَهُمَا أَحْوَجُ مِنْكَ إِلَى الْمَالِ فَلَمْ يُحَرِّكَاهُ ‏.‏ فَقَامَ كَمَا هُوَ فَخَرَجَ ‏.‏","english":{"narrator":"It was\nnarrated that Shaqiq said:","text":"“A man sent some Dirham through me\nto\nthe House.” He said: “I entered the House and Shaibah was sitting\non a chair. I handed it (the money) to him and he said: ‘Is this\nyours?’ I said: ‘No, if it were mine I would not have given it to\nyou.’ He said: ‘Since you say that, ‘Umar was sitting in the\nplace\nwhere you are sitting now and said: “I will not go out until\nI\ndistribute the wealth of the poor Muslims.” I said: “You will\nnot do\nthat.” He said: “I will certainly do that.” He said:\n“Why is that?” I\nsaid: “Because, the Prophet (ﷺ) and Abu Bakr\nsaw where it was, and\nthey had more need of the money than you do.\nBut, they did not move\nit. Then, he stood up just as he was and went\nout.”"}},{"id":236,"idInBook":236,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُمَرَ الْعَدَنِيُّ، حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ زَيْدٍ الْعَمِّيِّ، عَنْ أَبِيهِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ مَنْ أَدْرَكَ رَمَضَانَ بِمَكَّةَ فَصَامَ وَقَامَ مِنْهُ مَا تَيَسَّرَ لَهُ كَتَبَ اللَّهُ لَهُ مِائَةَ أَلْفِ شَهْرِ رَمَضَانَ فِيمَا سِوَاهَا ‏.‏ وَكَتَبَ اللَّهُ لَهُ بِكُلِّ يَوْمٍ عِتْقَ رَقَبَةٍ وَكُلِّ لَيْلَةٍ عِتْقَ رَقَبَةٍ وَكُلِّ يَوْمٍ حُمْلاَنَ فَرَسٍ فِي سَبِيلِ اللَّهِ وَفِي كُلِّ يَوْمٍ حَسَنَةً وَفِي كُلِّ لَيْلَةٍ حَسَنَةً ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Ibn ‘Abbas that the Messenger of Allah (ﷺ)\nsaid:","text":"“Whoever is in Makkah when the month of Ramadan comes, and he\nfasts\nit and prays at night as much as he can, Allah will record for\nhim\n(reward equivalent to that for) one hundred thousand months of\nRamadan observed elsewhere. For each day Allah will record for him\n(reward equivalent to that for) freeing a slave, and for each day\n(reward equivalent to that for) providing a horse in the cause of\nAllah, and for every day merits and for every night merits.”"}},{"id":237,"idInBook":237,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُمَرَ الْعَدَنِيُّ، حَدَّثَنَا دَاوُدُ بْنُ عَجْلاَنَ، قَالَ طُفْنَا مَعَ أَبِي عِقَالٍ فِي مَطَرٍ فَلَمَّا قَضَيْنَا طَوَافَنَا أَتَيْنَا خَلْفَ الْمَقَامِ فَقَالَ طُفْتُ مَعَ أَنَسِ بْنِ مَالِكٍ فِي مَطَرٍ فَلَمَّا قَضَيْنَا الطَّوَافَ أَتَيْنَا الْمَقَامَ فَصَلَّيْنَا رَكْعَتَيْنِ فَقَالَ لَنَا أَنَسٌ ‏\n\"‏ ائْتَنِفُوا الْعَمَلَ فَقَدْ غُفِرَ لَكُمْ ‏\"‏ ‏.‏ هَكَذَا قَالَ لَنَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ وَطُفْنَا مَعَهُ فِي مَطَرٍ ‏.‏","english":{"narrator":"Dawud\nbin ‘Ajlan said:","text":"“We performed Tawaf with Abu ‘Iqal in the\nrain, and when we finished our Tawaf, we came behind the Maqam. He\nsaid: I performed Tawaf with Anas bin Malik in the rain. When we\nfinished the Tawaf, we came behind the Maqam and prayed two Rak’ah.’\nAnas said to us: ‘Start your deeds anew, for you have been\nforgiven.\nThis is what the Messenger of Allah (ﷺ) said to us when\nwe performed\nTawaf with him in the rain.’”"}},{"id":238,"idInBook":238,"chapterId":25,"bookId":6,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ بْنُ حَفْصٍ الأُبُلِّيُّ، حَدَّثَنَا يَحْيَى بْنُ يَمَانٍ، عَنْ حَمْزَةَ بْنِ حَبِيبٍ الزَّيَّاتِ، عَنْ حُمْرَانَ بْنِ أَعْيَنَ، عَنْ أَبِي الطُّفَيْلِ، عَنْ أَبِي سَعِيدٍ، قَالَ حَجَّ النَّبِيُّ ـ صلى الله عليه وسلم ـ وَأَصْحَابُهُ مُشَاةً مِنَ الْمَدِينَةِ إِلَى مَكَّةَ وَقَالَ ‏\n\"‏ ارْبُطُوا أَوْسَاطَكُمْ بِأُزُرِكُمْ ‏\"‏ ‏.‏ وَمَشَى خِلْطَ الْهَرْوَلَةِ ‏.‏","english":{"narrator":"It was\nnarrated that Abu Sa’eed said:","text":"“The Prophet (ﷺ) and his\nCompanions performed Hajj walking from Al-Madinah to Makkah. He said:\n‘Tie your lower garments around your waists,’ and he alternated\nbetween walking and jogging.”"}}],"chapter":{"id":25,"bookId":6,"arabic":"كتاب المناسك","english":"Chapters on Hajj Rituals"}}