{"metadata":{"length":114,"arabic":{"title":"سنن ابن ماجه","author":"الإمام محمد بن يزيد بن ماجه القزويني","introduction":"كتاب الطب"},"english":{"title":"Sunan Ibn Majah","author":"Imam Muhammad ibn Yazid Ibn Majah al-Qazwini","introduction":"Chapters on Medicine"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَهِشَامُ بْنُ عَمَّارٍ، قَالاَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ زِيَادِ بْنِ عِلاَقَةَ، عَنْ أُسَامَةَ بْنِ شَرِيكٍ، قَالَ شَهِدْتُ الأَعْرَابَ يَسْأَلُونَ النَّبِيَّ ـ صلى الله عليه وسلم ـ أَعَلَيْنَا حَرَجٌ فِي كَذَا أَعَلَيْنَا حَرَجٌ فِي كَذَا فَقَالَ لَهُمْ ‏\"‏ عِبَادَ اللَّهِ وَضَعَ اللَّهُ الْحَرَجَ إِلاَّ مَنِ اقْتَرَضَ مِنْ عِرْضِ أَخِيهِ شَيْئًا فَذَاكَ الَّذِي حَرَجٌ ‏\"‏ ‏.‏ فَقَالُوا يَا رَسُولَ اللَّهِ هَلْ عَلَيْنَا جُنَاحٌ أَنْ نَتَدَاوَى قَالَ ‏\"‏ تَدَاوَوْا عِبَادَ اللَّهِ فَإِنَّ اللَّهَ سُبْحَانَهُ لَمْ يَضَعْ دَاءً إِلاَّ وَضَعَ مَعَهُ شِفَاءً إِلاَّ الْهَرَمَ ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ مَا خَيْرُ مَا أُعْطِيَ الْعَبْدُ قَالَ ‏\"‏ خُلُقٌ حَسَنٌ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Usamah bin Sharik said:","text":"“I saw the Bedouins\nasking\nthe Prophet (ﷺ): ‘Is there any harm in such and such, is\nthere\nany harm in such and such?’ He said to them: ‘O slaves of Allah!\nAllah has only made harm in that which transgresses the honor of\none’s\nbrother. That is what is sinful.’ They said: ‘O Messenger\nof Allah! Is\nthere any sin if we do not seek treatment?’ He said:\n‘Seek treatment,\nO slaves of Allah! For Allah does not create any\ndisease but He also\ncreates with it the cure, except for old age.’\nThey said: ‘O Messenger\nof Allah, what is the best thing that a\nperson may be given?’ He said:\n‘Good manners.’”"}},{"id":2,"idInBook":2,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، أَنْبَأَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنِ ابْنِ أَبِي خِزَامَةَ، عَنْ أَبِي خِزَامَةَ، قَالَ سُئِلَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ أَرَأَيْتَ أَدْوِيَةً نَتَدَاوَى بِهَا وَرُقًى نَسْتَرْقِي بِهَا وَتُقًى نَتَّقِيهَا هَلْ تَرُدُّ مِنْ قَدَرِ اللَّهِ شَيْئًا قَالَ ‏\n\"‏ هِيَ مِنْ قَدَرِ اللَّهِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Abu Khizamah said:","text":"“The Messenger of Allah (ﷺ)\nwas\nasked: ‘Do you think that the medicines with which we treat\nourselves, the Ruqyah by which we seek healing, and the means of\nprotection that we seek, change the decree of Allah at all?’ He\nsaid:\n‘They are part of the decree of Allah.’”"}},{"id":3,"idInBook":3,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا سُفْيَانُ، عَنْ عَطَاءِ بْنِ السَّائِبِ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ مَا أَنْزَلَ اللَّهُ دَاءً إِلاَّ أَنْزَلَ لَهُ دَوَاءً ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from ‘Abdullah that the Prophet (ﷺ) said:","text":"“Allah\ndoes\nnot send down any disease, but He also sends down the cure for\nit.”"}},{"id":4,"idInBook":4,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَإِبْرَاهِيمُ بْنُ سَعِيدٍ الْجَوْهَرِيُّ، قَالاَ حَدَّثَنَا أَبُو أَحْمَدَ، عَنْ عُمَرَ بْنِ سَعِيدِ بْنِ أَبِي حُسَيْنٍ، حَدَّثَنَا عَطَاءٌ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ مَا أَنْزَلَ اللَّهُ دَاءً إِلاَّ أَنْزَلَ لَهُ شِفَاءً ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)\nsaid:","text":"“Allah does not send down any disease, but He also sends down\nthe\ncure.”"}},{"id":5,"idInBook":5,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلاَّلُ، حَدَّثَنَا صَفْوَانُ بْنُ هُبَيْرَةَ، حَدَّثَنَا أَبُو مَكِينٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ عَادَ رَجُلاً فَقَالَ لَهُ ‏\"‏ مَا تَشْتَهِي ‏\"‏ ‏.‏ فَقَالَ أَشْتَهِي خُبْزَ بُرٍّ ‏.‏ فَقَالَ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏\"‏ مَنْ كَانَ عِنْدَهُ خُبْزُ بُرٍّ فَلْيَبْعَثْ إِلَى أَخِيهِ ‏\"‏ ‏.‏ ثُمَّ قَالَ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏\"‏ إِذَا اشْتَهَى مَرِيضُ أَحَدِكُمْ شَيْئًا فَلْيُطْعِمْهُ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Ibn ‘Abbas that the Prophet (ﷺ) visited a man\n(who\nwas sick) and said to him:","text":"“What do you desire?” He said: “I\nwant\nwheat bread.” The Prophet (ﷺ) said: “Whoever has wheat\nbread, let\nhim send it to his brother.” Then the Prophet (ﷺ)\nsaid: “When a sick\nperson among you desires something, give it to\nhim.”"}},{"id":6,"idInBook":6,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ، حَدَّثَنَا أَبُو يَحْيَى الْحِمَّانِيُّ، عَنِ الأَعْمَشِ، عَنْ يَزِيدَ الرَّقَاشِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ دَخَلَ النَّبِيُّ ـ صلى الله عليه وسلم ـ عَلَى مَرِيضٍ يَعُودُهُ قَالَ ‏\n\"‏ أَتَشْتَهِي شَيْئًا أَتَشْتَهِي كَعْكًا ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏ فَطَلَبُوا لَهُ ‏.‏","english":{"narrator":"It was\nnarrated that Anas bin Malik said:","text":"“The Prophet (ﷺ) went to\nvisit\na sick person, and said: ‘Do you want anything? Do you want\ncake?’\nHe said: ‘Yes.’ So they looked for some for him.”"}},{"id":7,"idInBook":7,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ، حَدَّثَنَا فُلَيْحُ بْنُ سُلَيْمَانَ، عَنْ أَيُّوبَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي صَعْصَعَةَ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا أَبُو عَامِرٍ، وَأَبُو دَاوُدَ قَالاَ حَدَّثَنَا فُلَيْحُ بْنُ سُلَيْمَانَ، عَنْ أَيُّوبَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ يَعْقُوبَ بْنِ أَبِي يَعْقُوبَ، عَنْ أُمِّ الْمُنْذِرِ بِنْتِ قَيْسٍ الأَنْصَارِيَّةِ، قَالَتْ دَخَلَ عَلَيْنَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ وَمَعَهُ عَلِيُّ بْنُ أَبِي طَالِبٍ وَعَلِيٌّ نَاقِهٌ مِنْ مَرَضٍ وَلَنَا دَوَالِي مُعَلَّقَةٌ وَكَانَ النَّبِيُّ ـ صلى الله عليه وسلم ـ يَأْكُلُ مِنْهَا فَتَنَاوَلَ عَلِيٌّ لِيَأْكُلَ فَقَالَ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏\"‏ مَهْ يَا عَلِيُّ إِنَّكَ نَاقِهٌ ‏\"‏ ‏.‏ قَالَتْ فَصَنَعْتُ لِلنَّبِيِّ ـ صلى الله عليه وسلم ـ سِلْقًا وَشَعِيرًا فَقَالَ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏\"‏ يَا عَلِيُّ مِنْ هَذَا فَأَصِبْ فَإِنَّهُ أَنْفَعُ لَكَ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Umm Mundhir bint Qais Ansariyyah said:","text":"“The\nMessenger\nof Allah (ﷺ) entered upon us, and with him was ‘Ali bin\nAbu\nTalib, who had recently recovered from an illness. We had bunches\nof\nunripe dates hanging up, and the Prophet (ﷺ) was eating from\nthem.\n‘Ali reached out to eat some, and the Prophet (ﷺ) said to\n‘Ali:\n‘Stop, O ‘Ali! You have just recovered from an illness.’ I made\nsome greens and barley for the Prophet (ﷺ), and the Prophet (ﷺ)\nsaid to ‘Ali: ‘O ‘Ali, eat some of this, for it is better for\nyou.’”"}},{"id":8,"idInBook":8,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ الْوَهَّابِ، حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا ابْنُ الْمُبَارَكِ، عَنْ عَبْدِ الْحَمِيدِ بْنِ صَيْفِيٍّ، - مِنْ وَلَدِ صُهَيْبٍ - عَنْ أَبِيهِ، عَنْ جَدِّهِ، صُهَيْبٍ قَالَ قَدِمْتُ عَلَى النَّبِيِّ ـ صلى الله عليه وسلم ـ وَبَيْنَ يَدَيْهِ خُبْزٌ وَتَمْرٌ فَقَالَ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏\"‏ ادْنُ فَكُلْ ‏\"‏ ‏.‏ فَأَخَذْتُ آكُلُ مِنَ التَّمْرِ فَقَالَ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏\"‏ تَأْكُلُ تَمْرًا وَبِكَ رَمَدٌ ‏\"‏ ‏.‏ قَالَ فَقُلْتُ إِنِّي أَمْضُغُ مِنْ نَاحِيَةٍ أُخْرَى ‏.‏ فَتَبَسَّمَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏.‏","english":{"narrator":"It was\nnarrated that Suhaib said:","text":"“I came to the Prophet (ﷺ) and in\nfront of him there were some bread and dates. The Prophet (ﷺ) said:\n‘Come and eat.’ So I started to eat some of the dates. Then the\nProphet (ﷺ) said: ‘Are you eating dates when you have an\ninflammation in your eye?’ I said: ‘I am chewing from the other\nside.’\nAnd the Messenger of Allah (ﷺ) smiled.”"}},{"id":9,"idInBook":9,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا بَكْرُ بْنُ يُونُسَ بْنِ بُكَيْرٍ، عَنْ مُوسَى بْنِ عَلِيِّ بْنِ رَبَاحٍ، عَنْ أَبِيهِ، عَنْ عُقْبَةَ بْنِ عَامِرٍ الْجُهَنِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ لاَ تُكْرِهُوا مَرْضَاكُمْ عَلَى الطَّعَامِ وَالشَّرَابِ فَإِنَّ اللَّهَ يُطْعِمُهُمْ وَيَسْقِيهِمْ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from ‘Uqbah bin ‘Amir Al-Juhani that the Messenger of\nAllah (ﷺ) said:","text":"“Do not force your sick ones to eat or drink.\nAllah\nwill feed them and give them to drink.”"}},{"id":10,"idInBook":10,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعِيدٍ الْجَوْهَرِيُّ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، حَدَّثَنَا مُحَمَّدُ بْنُ السَّائِبِ بْنِ بَرَكَةَ، عَنْ أُمِّهِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ إِذَا أَخَذَ أَهْلَهُ الْوَعْكُ أَمَرَ بِالْحَسَاءِ ‏.‏ قَالَتْ وَكَانَ يَقُولُ ‏\n\"‏ إِنَّهُ لَيَرْتُو فُؤَادَ الْحَزِينِ وَيَسْرُو عَنْ فُؤَادِ السَّقِيمِ كَمَا تَسْرُو إِحْدَاكُنَّ الْوَسَخَ عَنْ وَجْهِهَا بِالْمَاءِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Aishah said:","text":"“If any of his family members\nbecame\nill, the Messenger of Allah (ﷺ) would order that some broth\nbe\nmade. And he would say: ‘It consoles the grieving heart and\ncleanses the ailing heart, as anyone of you cleanses her face of dirt\nwith water.’”"}},{"id":11,"idInBook":11,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ أَبِي الْخَصِيبِ، حَدَّثَنَا وَكِيعٌ، عَنْ أَيْمَنَ بْنِ نَابِلٍ، عَنِ امْرَأَةٍ، مِنْ قُرَيْشٍ يُقَالَ لَهَا كَلْثَمُ عَنْ عَائِشَةَ، قَالَتْ قَالَ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏\n\"‏ عَلَيْكُمْ بِالْبَغِيضِ النَّافِعِ التَّلْبِينَةِ ‏\"‏ ‏.‏ يَعْنِي الْحَسَاءَ ‏.‏ قَالَتْ وَكَانَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ إِذَا اشْتَكَى أَحَدٌ مِنْ أَهْلِهِ لَمْ تَزَلِ الْبُرْمَةُ عَلَى النَّارِ حَتَّى يَنْتَهِيَ أَحَدُ طَرَفَيْهِ ‏.‏ يَعْنِي يَبْرَأُ أَوْ يَمُوتُ ‏.‏","english":{"narrator":"It was\nnarrated from ‘Aishah that the Prophet (ﷺ) said:","text":"“You should\neat the beneficial thing that is unpleasant to eat: Talbinah,”\nmeaning\nbroth. If any member of the family of the Messenger of Allah\n(ﷺ) was\nsick, the cooking pot would remain on the fire until one of\ntwo things\nhappened, either the person recovered or died."}},{"id":12,"idInBook":12,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، وَمُحَمَّدُ بْنُ الْحَارِثِ الْمِصْرِيَّانِ، قَالاَ حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، وَسَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ، أَخْبَرَهُمَا أَنَّهُ، سَمِعَ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\n\"‏ إِنَّ فِي الْحَبَّةِ السَّوْدَاءِ شِفَاءً مِنْ كُلِّ دَاءٍ إِلاَّ السَّامَ ‏\"‏ ‏.‏ وَالسَّامُ الْمَوْتُ ‏.‏ وَالْحَبَّةُ السَّوْدَاءُ الشُّونِيزُ ‏.‏","english":{"narrator":"Abu\nHurairah narrated that he heard the Messenger of Allah (ﷺ) say:","text":"“In\nblack seed there is healing for every disease, except the Sam.” \"Sam means death. And black seed is Shuwniz.\""}},{"id":13,"idInBook":13,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا أَبُو سَلَمَةَ، يَحْيَى بْنُ خَلَفٍ حَدَّثَنَا أَبُو عَاصِمٍ، عَنْ عُثْمَانَ بْنِ عَبْدِ الْمَلِكِ، قَالَ سَمِعْتُ سَالِمَ بْنَ عَبْدِ اللَّهِ، يُحَدِّثُ عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ عَلَيْكُمْ بِهَذِهِ الْحَبَّةِ السَّوْدَاءِ فَإِنَّ فِيهَا شِفَاءً مِنْ كُلِّ دَاءٍ إِلاَّ السَّامَ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Uthman bin ‘Abdul-Malik said:","text":"“I heard Salim\nbin\n‘Abdullah narrating from his father that the Messenger of Allah\n(ﷺ) said: ‘You should eat this black seed, for in it there is\nhealing from every disease, except the Sam (death).’”"}},{"id":14,"idInBook":14,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عُبَيْدُ اللَّهِ، أَنْبَأَنَا إِسْرَائِيلُ، عَنْ مَنْصُورٍ، عَنْ خَالِدِ بْنِ سَعْدٍ، قَالَ خَرَجْنَا وَمَعَنَا غَالِبُ بْنُ أَبْجَرَ فَمَرِضَ فِي الطَّرِيقِ فَقَدِمْنَا الْمَدِينَةَ وَهُوَ مَرِيضٌ فَعَادَهُ ابْنُ أَبِي عَتِيقٍ وَقَالَ لَنَا عَلَيْكُمْ بِهَذِهِ الْحَبَّةِ السَّوْدَاءِ فَخُذُوا مِنْهَا خَمْسًا أَوْ سَبْعًا فَاسْحَقُوهَا ثُمَّ اقْطُرُوهَا فِي أَنْفِهِ بِقَطَرَاتِ زَيْتٍ فِي هَذَا الْجَانِبِ وَفِي هَذَا الْجَانِبِ فَإِنَّ عَائِشَةَ حَدَّثَتْهُمْ أَنَّهَا سَمِعَتْ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\"‏ إِنَّ هَذِهِ الْحَبَّةَ السَّوْدَاءَ شِفَاءٌ مِنْ كُلِّ دَاءٍ إِلاَّ أَنْ يَكُونَ السَّامُ ‏\"‏ ‏.‏ قُلْتُ وَمَا السَّامُ قَالَ ‏\"‏ الْمَوْتُ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Khalid bin Sa’d said:","text":"“We went out and with us\nwas\nGhalib bin Abjar. He fell sick along the way, and when we came to\nAl-Madinah he was sick. Ibn Abu ‘Atiq came to visit him and said to\nus: ‘You should use this black seed. Take five or seven (seeds) and\ngrind them to a powder, then drop them into his nose with drops of\nolive oil, on this side and on this side. For ‘Aishah narrated to\nthem\nthat she heard the Messenger of Allah (ﷺ) say: “This black\nseed is a\nhealing for every disease, except the Sam.” I said: “What\nis the Sam?”\nHe said: “Death.”"}},{"id":15,"idInBook":15,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا مَحْمُودُ بْنُ خِدَاشٍ، حَدَّثَنَا سَعِيدُ بْنُ زَكَرِيَّاءَ الْقُرَشِيُّ، حَدَّثَنَا الزُّبَيْرُ بْنُ سَعِيدٍ الْهَاشِمِيُّ، عَنْ عَبْدِ الْحَمِيدِ بْنِ سَالِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ مَنْ لَعِقَ الْعَسَلَ ثَلاَثَ غَدَوَاتٍ كُلَّ شَهْرٍ لَمْ يُصِبْهُ عَظِيمٌ مِنَ الْبَلاَءِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)\nsaid:","text":"“Whoever eats honey three mornings each month, will not suffer\nany\nserious calamity.”"}},{"id":16,"idInBook":16,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بِشْرٍ، بَكْرُ بْنُ خَلَفٍ حَدَّثَنَا عُمَرُ بْنُ سَهْلٍ، حَدَّثَنَا أَبُو حَمْزَةَ الْعَطَّارُ، عَنِ الْحَسَنِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ أُهْدِيَ لِلنَّبِيِّ ـ صلى الله عليه وسلم ـ عَسَلٌ فَقَسَمَ بَيْنَنَا لُعْقَةً لُعْقَةً فَأَخَذْتُ لُعْقَتِي ثُمَّ قُلْتُ يَا رَسُولَ اللَّهِ أَزْدَادُ أُخْرَى قَالَ ‏\n\"‏ نَعَمْ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Jabir bin ‘Abdullah said:","text":"“Some honey was given\nas\na gift to the Prophet (ﷺ), and he shared among us spoonful by\nspoonful. I took my spoonful then I said: ‘O Messenger of Allah,\ncan I\nhave another?’ He said: ‘Yes.’”"}},{"id":17,"idInBook":17,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ سَلَمَةَ، حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي إِسْحَاقَ، عَنْ أَبِي الأَحْوَصِ، عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ عَلَيْكُمْ بِالشِّفَاءَيْنِ الْعَسَلِ وَالْقُرْآنِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from ‘Abdullah that the Messenger of Allah (ﷺ)\nsaid:","text":"“You should take the two that bring healing: Honey and the\nQur’an.”"}},{"id":18,"idInBook":18,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَسْبَاطُ بْنُ مُحَمَّدٍ، حَدَّثَنَا الأَعْمَشُ، عَنْ جَعْفَرِ بْنِ إِيَاسٍ، عَنْ شَهْرِ بْنِ حَوْشَبٍ، عَنْ أَبِي سَعِيدٍ، وَجَابِرٍ، قَالاَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ الْكَمْأَةُ مِنَ الْمَنِّ وَمَاؤُهَا شِفَاءٌ لِلْعَيْنِ وَالْعَجْوَةُ مِنَ الْجَنَّةِ وَهِي شِفَاءٌ مِنَ الْجَنَّةَ ‏\"‏ ‏.‏ \n حَدَّثَنَا عَلِيُّ بْنُ مَيْمُونٍ، وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ الرَّقِّيَّانِ، قَالاَ حَدَّثَنَا سَعِيدُ بْنُ مَسْلَمَةَ بْنِ هِشَامٍ، عَنِ الأَعْمَشِ، عَنْ جَعْفَرِ بْنِ إِيَاسٍ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ مِثْلَهُ ‏.‏","english":{"narrator":"It was\nnarrated from Abu Sa`eed and Jabir that the Messenger of Allah\n(ﷺ) said:","text":"“Truffles are a type of manna, and their water is a\nhealing for eye (diseases). And the `Ajwah* are from Paradise, and\nthey are healing for possession.”**\n\nAnother chain from Abu Sa`eed from the Prophet (ﷺ) with similar wording."}},{"id":19,"idInBook":19,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، أَنْبَأَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، سَمِعَ عَمْرَو بْنَ حُرَيْثٍ، يَقُولُ سَمِعْتُ سَعِيدَ بْنَ زَيْدِ بْنِ عَمْرِو بْنِ نُفَيْلٍ، يُحَدِّثُ عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ أَنَّ ‏\n\"‏ الْكَمْأَةُ مِنَ الْمَنِّ الَّذِي أَنْزَلَ اللَّهُ عَلَى بَنِي إِسْرَائِيلَ وَمَاؤُهَا شِفَاءٌ لِلْعَيْنِ ‏\"‏ ‏.‏","english":{"narrator":"‘Amr\nbin Huraith said:","text":"“I heard Sa’eed bin Zaid bin ‘Amr bin Nufail\nnarrating from the Prophet (ﷺ) that: ‘Truffles are a type of\nmanna\nthat Allah sent down to the Children of Israel, and their water\nis a\nhealing for eye (diseases).’”"}},{"id":20,"idInBook":20,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا أَبُو عَبْدِ الصَّمَدِ، حَدَّثَنَا مَطَرٌ الْوَرَّاقُ، عَنْ شَهْرِ بْنِ حَوْشَبٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ كُنَّا نَتَحَدَّثُ عِنْدَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ فَذَكَرْنَا الْكَمْأَةَ فَقَالُوا هِيَ جُدَرِيُّ الأَرْضِ ‏.‏ فَنُمِيَ الْحَدِيثُ إِلَى رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ فَقَالَ ‏\n\"‏ الْكَمْأَةُ مِنَ الْمَنِّ وَالْعَجْوَةُ مِنَ الْجَنَّةِ وَهِيَ شِفَاءٌ مِنَ السَّمِّ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Abu Hurairah said:","text":"“We used to narrate from the\nMessenger of Allah (ﷺ) and mention truffles, and they said: ‘(It\nis)\nthe smallpox of the earth.’ When the Messenger of Allah (ﷺ)\nwas told\nof what they were saying: he said: ‘Truffles are a type of\nmanna, and\nthe Ajwah are from Paradise, and they are a healing from\npoison.’”"}},{"id":21,"idInBook":21,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا الْمُشْمَعِلُّ بْنُ إِيَاسٍ الْمُزَنِيُّ، حَدَّثَنِي عَمْرُو بْنُ سُلَيْمٍ، قَالَ سَمِعْتُ رَافِعَ بْنَ عَمْرٍو الْمُزَنِيَّ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\n\"‏ الْعَجْوَةُ وَالصَّخْرَةُ مِنَ الْجَنَّةِ ‏\"‏ ‏.‏ قَالَ عَبْدُ الرَّحْمَنِ حَفِظْتُ الصَّخْرَةَ مِنْ فِيهِ ‏.‏","english":{"narrator":"Rafi’\nbin ‘Amr Al-Muzani said:","text":"“I heard the Messenger of Allah (ﷺ)\nsay: “Ajwah and the rock* are from Paradise.’”"}},{"id":22,"idInBook":22,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُحَمَّدِ بْنِ يُوسُفَ بْنِ سَرْجٍ الْفِرْيَابِيُّ، حَدَّثَنَا عَمْرُو بْنُ بَكْرٍ السَّكْسَكِيُّ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ أَبِي عَبْلَةَ، قَالَ سَمِعْتُ أَبَا أُبَىٍّ ابْنَ أُمِّ حَرَامٍ، وَكَانَ، قَدْ صَلَّى مَعَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ الْقِبْلَتَيْنِ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\"‏ عَلَيْكُمْ بِالسَّنَى وَالسَّنُّوتِ فَإِنَّ فِيهِمَا شِفَاءً مِنْ كُلِّ دَاءٍ إِلاَّ السَّامَ ‏.‏ قِيلَ يَا رَسُولَ اللَّهِ وَمَا السَّامُ قَالَ ‏\"‏ الْمَوْتُ ‏\"‏ ‏.‏ قَالَ عَمْرٌو قَالَ ابْنُ أَبِي عَبْلَةَ السَّنُّوتُ الشِّبِتُّ ‏.‏ وَقَالَ آخَرُونَ بَلْ هُوَ الْعَسَلُ الَّذِي يَكُونُ فِي زِقَاقِ السَّمْنِ وَهُوَ قَوْلُ الشَّاعِرِ هُمُ السَّمْنُ بِالسَّنُّوتِ لاَ أَلْسَ فِيهِمُ وَهُمْ يَمْنَعُونَ جَارَهُمْ أَنْ يُقَرَّدَا","english":{"narrator":"Ibrahim\nbin Abu ‘Ablah said:","text":"“I heard Abu Ubayy bin Umm Haram, who had\nprayed with the Messenger of Allah (ﷺ) facing both the Qiblah,\nsaying: ‘I heard the Messenger of Allah (ﷺ) say: “You should\nuse senna and the Sannut, for in them there is healing for every\ndisease, except the Sam.” It was said: “O Messenger of Allah,\nwhat is the Sam?” He said: “Death.”\n(One of the narrators) ‘Amr said: “Ibn Abu ‘Ablah said: the ‘Sannut is dill.” Others said: “Rather, it is honey that is kept in a skin (i.e., receptacle) used for ghee.”*"}},{"id":23,"idInBook":23,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا جَعْفَرُ بْنُ مُسَافِرٍ، حَدَّثَنَا السَّرِيُّ بْنُ مِسْكِينٍ، حَدَّثَنَا ذُؤَادُ بْنُ عُلْبَةَ، عَنْ لَيْثٍ، عَنْ مُجَاهِدٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ هَجَّرَ النَّبِيُّ ـ صلى الله عليه وسلم ـ فَهَجَّرْتُ فَصَلَّيْتُ ثُمَّ جَلَسْتُ فَالْتَفَتَ إِلَىَّ النَّبِيُّ ـ صلى الله عليه وسلم ـ فَقَالَ ‏\"‏ اشِكَمَتْ دَرْدْ ‏\"‏ ‏.‏ قُلْتُ نَعَمْ يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\"‏ قُمْ فَصَلِّ فَإِنَّ فِي الصَّلاَةِ شِفَاءً ‏\"‏ ‏.‏ \n قَالَ أَبُو الْحَسَنِ الْقَطَّانُ حَدَّثَنَا إِبْرَاهِيمُ بْنُ نَصْرٍ، حَدَّثَنَا أَبُو سَلَمَةَ، حَدَّثَنَا ذُؤَادُ بْنُ عُلْبَةَ، فَذَكَرَ نَحْوَهُ وَقَالَ فِيهِ اشِكَمَتْ دَرْدْ ‏.‏ يَعْنِي تَشْتَكِي بَطْنَكَ بِالْفَارِسِيَّةِ ‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ حَدَّثَ بِهِ رَجُلٌ لأَهْلِهِ فَاسْتَعْدَوْا عَلَيْهِ ‏.‏","english":{"narrator":"It was\nnarrated that Abu Hurairah said:","text":"“The Prophet (ﷺ) set out in\nthe\nearly morning and I did likewise. I prayed, then I sat. The\nProphet\n(ﷺ) turned to me and said: ‘Do you have a stomach problem?’*\nI\nsaid: ‘Yes, O Messenger of Allah.’ He said: ‘Get up and pray,\nfor in\nprayer there is healing.’”\n\nAnother chain with similar wording. Abu `Abdullah said: A man narrated it to his people, then they were stirred up against him."}},{"id":24,"idInBook":24,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ يُونُسَ بْنِ أَبِي إِسْحَاقَ، عَنْ مُجَاهِدٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنِ الدَّوَاءِ الْخَبِيثِ ‏.‏ يَعْنِي السُّمَّ ‏.‏","english":{"narrator":"It was\nnarrated that Abu Hurairah said:","text":"“The Messenger of Allah (ﷺ)\nforbade treating illness with foul things (Khabith), meaning\npoison.”*"}},{"id":25,"idInBook":25,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ مَنْ شَرِبَ سُمًّا فَقَتَلَ نَفْسَهُ فَهُوَ يَتَحَسَّاهُ فِي نَارِ جَهَنَّمَ خَالِدًا مُخَلَّدًا فِيهَا أَبَدًا ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)\nsaid:","text":"“Whoever drinks poison and kills himself, will be sipping it in\nthe\nfire of Hell forever and ever.’”"}},{"id":26,"idInBook":26,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ عَبْدِ الْحَمِيدِ بْنِ جَعْفَرٍ، عَنْ زُرْعَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ مَوْلًى، لِمَعْمَرٍ التَّيْمِيِّ عَنْ مَعْمَرٍ التَّيْمِيِّ، عَنْ أَسْمَاءَ بِنْتِ عُمَيْسٍ، قَالَتْ قَالَ لِي رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ بِمَاذَا كُنْتِ تَسْتَمْشِينَ ‏\"‏ ‏.‏ قُلْتُ بِالشُّبْرُمِ قَالَ ‏\"‏ حَارٌّ جَارٌّ ‏\"‏ ‏.‏ ثُمَّ اسْتَمْشَيْتُ بِالسَّنَى ‏.‏ فَقَالَ ‏\"‏ لَوْ كَانَ شَىْءٌ يَشْفِي مِنَ الْمَوْتِ كَانَ السَّنَى وَالسَّنَى شِفَاءٌ مِنَ الْمَوْتِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Asma’ bint ‘Umais said:","text":"“The Messenger of Allah\n(ﷺ) said to me: ‘What do you use as a laxative?’ I said: ‘The\nShubrum (spurge – Euphorb).’ He said: (It is) hot and powerful.’\nThen\nI used senna as a laxative and he said: ‘If anything were to\ncure\ndeath, it would be senna. Senna is a cure for death.’”"}},{"id":27,"idInBook":27,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ الصَّبَّاحِ، قَالاَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنْ أُمِّ قَيْسٍ بِنْتِ مِحْصَنٍ، قَالَتْ دَخَلْتُ بِابْنٍ لِي عَلَى النَّبِيِّ ـ صلى الله عليه وسلم ـ وَقَدْ أَعْلَقْتُ عَلَيْهِ مِنَ الْعُذْرَةِ فَقَالَ ‏\n\"‏ عَلاَمَ تَدْغَرْنَ أَوْلاَدَكُنَّ بِهَذَا الْعِلاَقِ عَلَيْكُمْ بِهَذَا الْعُودِ الْهِنْدِيِّ فَإِنَّ فِيهِ سَبْعَةَ أَشْفِيَةٍ يُسْعَطُ بِهِ مِنَ الْعُذْرَةِ وَيُلَدُّ بِهِ مِنْ ذَاتِ الْجَنْبِ ‏\"‏ ‏.‏ \n حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ الْمِصْرِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَنْبَأَنَا يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ، عَنْ أُمِّ قَيْسٍ بِنْتِ مِحْصَنٍ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ بِنَحْوِهِ ‏.‏ قَالَ يُونُسُ أَعْلَقْتُ يَعْنِي غَمَزْتُ ‏.‏","english":{"narrator":"It was\nnarrated that Umm Qais bint Mihsan said:","text":"“I brought a son of\nmine\nto the Prophet (ﷺ), and I had pressed on an area of his throat\ndue\nto tonsillitis. He said: ‘Why do you poke your children with this\npressing?’ You should use this aloeswood, for in it there are seven\ncures. It should be inhaled for pustules in the throat, and given in\nthe side of the mouth for pleurisy.”\n\n(Another chain) from Umm Qais bint Mihsan, from the Prophet (ﷺ) with similar wording."}},{"id":28,"idInBook":28,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، وَرَاشِدُ بْنُ سَعِيدٍ الرَّمْلِيُّ، قَالاَ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا هِشَامُ بْنُ حَسَّانَ، حَدَّثَنَا أَنَسُ بْنُ سِيرِينَ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\n\"‏ شِفَاءُ عِرْقِ النَّسَا أَلْيَةُ شَاةٍ أَعْرَابِيَّةٍ تُذَابُ ثُمَّ تُجَزَّأُ ثَلاَثَةَ أَجْزَاءٍ ثُمَّ يُشْرَبُ عَلَى الرِّيقِ فِي كُلِّ يَوْمٍ جُزْءٌ ‏\"‏ ‏.‏","english":{"narrator":"Anas bin\nMalik said:","text":"“I heard the Messenger of Allah (ﷺ) saying:\n‘The\ncure for sciatica is the fat from the tail of a Bedouin sheep (or\nwild sheep), which should be melted and divided into three parts, one\npart to be taken each day on an empty stomach.’”"}},{"id":29,"idInBook":29,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، وَمُحَمَّدُ بْنُ الصَّبَّاحِ، قَالاَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، عَنْ أَبِيهِ، عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ، قَالَ جُرِحَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ يَوْمَ أُحُدٍ وَكُسِرَتْ رَبَاعِيَتُهُ وَهُشِمَتِ الْبَيْضَةُ عَلَى رَأْسِهِ فَكَانَتْ فَاطِمَةُ تَغْسِلُ الدَّمَ عَنْهُ وَعَلِيٌّ يَسْكُبُ عَلَيْهِ الْمَاءَ بِالْمِجَنِّ فَلَمَّا رَأَتْ فَاطِمَةُ أَنَّ الْمَاءَ لاَ يَزِيدُ الدَّمَ إِلاَّ كَثْرَةً أَخَذَتْ قِطْعَةَ حَصِيرٍ فَأَحْرَقَتْهَا حَتَّى إِذَا صَارَ رَمَادًا أَلْزَمَتْهُ الْجُرْحَ فَاسْتَمْسَكَ الدَّمُ ‏.‏","english":{"narrator":"It was\nnarrated that Sahl bin Sa’d As-Sa’idi said:","text":"“The Messenger of\nAllah (ﷺ) was wounded on the Day of Uhud. His molar was broken and\nhis helmet was crushed on his head. Fatimah was washing the blood\nfrom\nhim and ‘Ali was pouring water on him from a shield. When\nFatimah\nrealized that the water was only making the bleeding worse,\nshe took a\npiece of a mat and burnt it, and when it had turned to\nashes, she\napplied it to the wound to stop the bleeding."}},{"id":30,"idInBook":30,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، عَنْ عَبْدِ الْمُهَيْمِنِ بْنِ عَبَّاسِ بْنِ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ إِنِّي لأَعْرِفُ يَوْمَ أُحُدٍ مَنْ جَرَحَ وَجْهَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ وَمَنْ كَانَ يُرْقِئُ الْكَلْمَ مِنْ وَجْهِ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ وَيُدَاوِيهِ وَمَنْ يَحْمِلُ الْمَاءَ فِي الْمِجَنِّ وَبِمَا دُووِيَ بِهِ الْكَلْمُ حَتَّى رَقَأَ ‏.‏ قَالَ أَمَّا مَنْ كَانَ يَحْمِلُ الْمَاءَ فِي الْمِجَنِّ فَعَلِيٌّ وَأَمَّا مَنْ كَانَ يُدَاوِي الْكَلْمَ فَفَاطِمَةُ أَحْرَقَتْ لَهُ حِينَ لَمْ يَرْقَأْ قِطْعَةَ حَصِيرٍ خَلَقٍ فَوَضَعَتْ رَمَادَهُ عَلَيْهِ فَرَقَأَ الْكَلْمُ ‏.‏","english":{"narrator":"It was\nnarrated from ‘Abdul-Muhaimin bin ‘Abbas bin Sahl bin Sa’d\nAs-\nSa’idi, from his father, that his grandfather said:","text":"“On the\nDay of\nUhud, I recognized the one who wounded the face of the\nMessenger of\nAllah (ﷺ), the one who was washing the blood from the\nface of the\nMessenger of Allah (ﷺ) and treating him, and the one\nwho was\nbringing the water in a shield, and with what the wound was\ntreated\nuntil the bleeding stopped. The one who was carrying the\nwater in the\nshield was ‘Ali. The one who was treating the wound\nwas Fatimah. When\nthe bleeding would not stop, she burned a piece of\na worn out mat and\napplied the ashes to it (the wound), then the\nbleeding stopped."}},{"id":31,"idInBook":31,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، وَرَاشِدُ بْنُ سَعِيدٍ الرَّمْلِيُّ، قَالاَ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا ابْنُ جُرَيْجٍ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ مَنْ تَطَبَّبَ وَلَمْ يُعْلَمْ مِنْهُ طِبٌّ قَبْلَ ذَلِكَ فَهُوَ ضَامِنٌ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from ‘Amr bin Shu’aib, from his father, that his\ngrandfather said:","text":"“The Messenger of Allah (ﷺ) said: ‘Whoever\ngives\nmedical treatment, with no prior knowledge of medicine, is\nresponsible\n(for any harm done).’”"}},{"id":32,"idInBook":32,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ الْوَهَّابِ، حَدَّثَنَا يَعْقُوبُ بْنُ إِسْحَاقَ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَيْمُونٍ، حَدَّثَنِي أَبِي، عَنْ زَيْدِ بْنِ أَرْقَمَ، قَالَ نَعَتَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ مِنْ ذَاتِ الْجَنْبِ وَرْسًا وَقُسْطًا وَزَيْتًا يُلَدُّ بِهِ ‏.‏","english":{"narrator":"It was\nnarrated that Zaid bin Arqam said:","text":"“The Messenger of Allah\n(ﷺ)\nprescribed Wars (memecyclon tinctorium), Indian aloeswood and\nolive\noil for pleurisy, to be administered through the side of the\nmouth.”"}},{"id":33,"idInBook":33,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا أَبُو طَاهِرٍ، أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ الْمِصْرِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَنْبَأَنَا يُونُسُ، وَابْنُ، سَمْعَانَ عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنْ أُمِّ قَيْسٍ بِنْتِ مِحْصَنٍ، قَالَتْ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ عَلَيْكُمْ بِالْعُودِ الْهِنْدِيِّ - يَعْنِي بِهِ الْكُسْتَ - فَإِنَّ فِيهِ سَبْعَةَ أَشْفِيَةٍ مِنْهَا ذَاتُ الْجَنْبِ ‏\"‏ ‏.‏ قَالَ ابْنُ سَمْعَانَ فِي الْحَدِيثِ ‏\"‏ فَإِنَّ فِيهِ شِفَاءً مِنْ سَبْعَةِ أَدْوَاءٍ مِنْهَا ذَاتُ الْجَنْبِ ‏\"‏ ‏.‏","english":{"narrator":"Umm Qais\nbint Mihsan said:","text":"“The Messenger of Allah (ﷺ) said: ‘You\nshould\nuse Indian aloeswood for it contains seven cures, including (a\ncure\nfor) pleurisy.’”"}},{"id":34,"idInBook":34,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ مُوسَى بْنِ عُبَيْدَةَ، عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ، عَنْ حَفْصِ بْنِ عُبَيْدِ اللَّهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ ذُكِرَتِ الْحُمَّى عِنْدَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ فَسَبَّهَا رَجُلٌ فَقَالَ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏\n\"‏ لاَ تَسُبَّهَا فَإِنَّهَا تَنْفِي الذُّنُوبَ كَمَا تَنْفِي النَّارُ خَبَثَ الْحَدِيدِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Abu Hurairah said:","text":"“Mention of fever was made in\nthe\npresence of the Messenger of Allah (ﷺ), and a man cursed it. The\nProphet (ﷺ) said: ‘Do not curse it, for it erases sin as fire\nremoves filth from iron.’”"}},{"id":35,"idInBook":35,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ، عَنْ إِسْمَاعِيلَ بْنِ عُبَيْدِ اللَّهِ، عَنْ أَبِي صَالِحٍ الأَشْعَرِيِّ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ أَنَّهُ عَادَ مَرِيضًا وَمَعَهُ أَبُو هُرَيْرَةَ مِنْ وَعْكٍ كَانَ بِهِ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ أَبْشِرْ فَإِنَّ اللَّهَ يَقُولُ هِيَ نَارِي أُسَلِّطُهَا عَلَى عَبْدِيَ الْمُؤْمِنِ فِي الدُّنْيَا لِتَكُونَ حَظَّهُ مِنَ النَّارِ فِي الآخِرَةِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Abu Hurairah that the Prophet (ﷺ) visited a\nsick\nperson, due to an illness that he was suffering from and Abu\nHurairah\nwas with him. The Messenger of Allah (ﷺ) said:","text":"“Be of good\ncheer,\nfor Allah says: ‘It is My fire which I have causes to overwhelm\nMy\nbelieving slave in this world, to be his share of the Fire in the\nHereafter.”"}},{"id":36,"idInBook":36,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ إِنَّ الْحُمَّى مِنْ فَيْحِ جَهَنَّمَ فَابْرُدُوهَا بِالْمَاءِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from ‘Aishah that the Prophet (ﷺ) said:","text":"“Fever is\nfrom\nthe heat of the Hell-fire, so cool it down with water.”"}},{"id":37,"idInBook":37,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ أَنَّهُ قَالَ ‏\n\"‏ إِنَّ شِدَّةَ الْحُمَّى مِنْ فَيْحِ جَهَنَّمَ فَابْرُدُوهَا بِالْمَاءِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Ibn ‘Umar that the Prophet (ﷺ) said:","text":"“Intense\nfever is from the heat of Hell-fire, so cool it down with water.”"}},{"id":38,"idInBook":38,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا مُصْعَبُ بْنُ الْمِقْدَامِ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ سَعِيدِ بْنِ مَسْرُوقٍ، عَنْ عَبَايَةَ بْنِ رِفَاعَةَ، عَنْ رَافِعِ بْنِ خَدِيجٍ، قَالَ سَمِعْتُ النَّبِيَّ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\"‏ الْحُمَّى مِنْ فَيْحِ جَهَنَّمَ فَابْرُدُوهَا بِالْمَاءِ ‏\"‏ ‏.‏ فَدَخَلَ عَلَى ابْنٍ لِعَمَّارٍ فَقَالَ ‏\"‏ اكْشِفِ الْبَاسْ رَبَّ النَّاسْ إِلَهَ النَّاسْ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Rafi’ bin Khadij said:","text":"“I heard the Prophet\n(ﷺ)\nsay: ‘Fever is from the heat of the Hell-fire, so cool it down\nwith\nwater.’ He entered upon a son of ‘Ammar and said: ‘Take away\nthe\nharm, O Lord of mankind, O God of mankind.’”"}},{"id":39,"idInBook":39,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ فَاطِمَةَ بِنْتِ الْمُنْذِرِ، عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ، أَنَّهَا كَانَتْ تُؤْتَى بِالْمَرْأَةِ الْمَوْعُوكَةِ فَتَدْعُو بِالْمَاءِ فَتَصُبُّهُ فِي جَيْبِهَا وَتَقُولُ إِنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ ابْرُدُوهَا بِالْمَاءِ ‏\"‏ ‏.‏ وَقَالَ ‏\"‏ إِنَّهَا مِنْ فَيْحِ جَهَنَّمَ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Asma’ bint Abu Bakr that a woman suffering from\nfever\nwould be brought to her, and she would call for water and pour\nit\nonto the neck of her garment. She said:","text":"The Prophet (ﷺ) said:\n“Cool\nit down with water,” and he said: “It is from the heat of\nHell-fire.”"}},{"id":40,"idInBook":40,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا أَبُو سَلَمَةَ، يَحْيَى بْنُ خَلَفٍ حَدَّثَنَا عَبْدُ الأَعْلَى، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ الْحُمَّى كِيرٌ مِنْ كِيرِ جَهَنَّمَ فَنَحُّوهَا عَنْكُمْ بِالْمَاءِ الْبَارِدِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)\nsaid:","text":"“Fever is one of the bellows of Hell, so avert it from\nyourselves\nwith cold water.”"}},{"id":41,"idInBook":41,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَسْوَدُ بْنُ عَامِرٍ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ إِنْ كَانَ فِي شَىْءٍ مِمَّا تَدَاوَوْنَ بِهِ خَيْرٌ فَالْحِجَامَةُ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Abu Hurairah that the Prophet (ﷺ) said:","text":"“If\nthere\nis any good in any of the remedies you use, it is in cupping.”"}},{"id":42,"idInBook":42,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، حَدَّثَنَا زِيَادُ بْنُ الرَّبِيعِ، حَدَّثَنَا عَبَّادُ بْنُ مَنْصُورٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ مَا مَرَرْتُ لَيْلَةَ أُسْرِيَ بِي بِمَلإٍ مِنَ الْمَلاَئِكَةِ إِلاَّ كُلُّهُمْ يَقُولُ لِي عَلَيْكَ يَا مُحَمَّدُ بِالْحِجَامَةِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Ibn ‘Abbas that the Messenger of Allah (ﷺ)\nsaid:","text":"“On the night on which I was taken on the Night Journey (Isra’),\nI did not pass by any group of angels but all of them said to me: ‘O\nMuhammad, you should use cupping.’”"}},{"id":43,"idInBook":43,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بِشْرٍ، بَكْرُ بْنُ خَلَفٍ حَدَّثَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا عَبَّادُ بْنُ مَنْصُورٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ نِعْمَ الْعَبْدُ الْحَجَّامُ يَذْهَبُ بِالدَّمِ وَيُخِفُّ الصُّلْبَ وَيَجْلُو الْبَصَرَ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Ibn ‘Abbas said:","text":"“The Messenger of Allah (ﷺ)\nsaid: ‘What a good slave is the cupper. He takes away the blood,\nreduces pressure on the spine, and improves the eyesight.’”"}},{"id":44,"idInBook":44,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا جُبَارَةُ بْنُ الْمُغَلِّسِ، حَدَّثَنَا كَثِيرُ بْنُ سُلَيْمٍ، سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، يَقُولُ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ مَا مَرَرْتُ لَيْلَةَ أُسْرِيَ بِي بِمَلإٍ إِلاَّ قَالُوا يَا مُحَمَّدُ مُرْ أُمَّتَكَ بِالْحِجَامَةِ ‏\"‏ ‏.‏","english":{"narrator":"Anas bin\nMalik said:","text":"“The Messenger of Allah (ﷺ) said: ‘On the\nnight on\nwhich I was taken on the Night Journey (Isra’), I did not\npass by\nany group (of angels) but they said to me: “O Muhammad, tell\nyour\nnation to use cupping.”"}},{"id":45,"idInBook":45,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ الْمِصْرِيُّ، أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّ أُمَّ سَلَمَةَ، زَوْجَ النَّبِيِّ ـ صلى الله عليه وسلم ـ اسْتَأْذَنَتْ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ فِي الْحِجَامَةِ فَأَمَرَ النَّبِيُّ ـ صلى الله عليه وسلم ـ أَبَا طَيْبَةَ أَنْ يَحْجُمَهَا ‏.‏ وَقَالَ حَسِبْتُ أَنَّهُ كَانَ أَخَاهَا مِنَ الرَّضَاعَةِ أَوْ غُلاَمًا لَمْ يَحْتَلِمْ ‏.‏","english":{"narrator":"","text":"It was\nnarrated from Jabir that Umm Salamah, the wife of the Prophet\n(ﷺ),\nasked the Messenger of Allah (ﷺ) for permission to be cupped,\nand\nthe Prophet (ﷺ) told Abu Taibah to cup her."}},{"id":46,"idInBook":46,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ، حَدَّثَنِي عَلْقَمَةُ بْنُ أَبِي عَلْقَمَةَ، قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ الأَعْرَجَ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ ابْنَ بُحَيْنَةَ، يَقُولُ احْتَجَمَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ بِلَحْىِ جَمَلٍ وَهُوَ مُحْرِمٌ وَسْطَ رَأْسِهِ ‏.‏","english":{"narrator":"‘Abdur-Rahman Al-A’raj said:","text":"“I heard ‘Abdullah bin Buhainah\nsay:\n‘The Messenger of Allah (ﷺ) was cupped in Lahyi Jamal,* in\nthe\nmiddle of his head, while he was a Muhrim.”"}},{"id":47,"idInBook":47,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ سَعْدٍ الإِسْكَافِ، عَنِ الأَصْبَغِ بْنِ نُبَاتَةَ، عَنْ عَلِيٍّ، قَالَ نَزَلَ جِبْرِيلُ عَلَى النَّبِيِّ ـ صلى الله عليه وسلم ـ بِحِجَامَةِ الأَخْدَعَيْنِ وَالْكَاهِلِ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Ali said:","text":"“Jibra’il came down to the Prophet\n(ﷺ) with (the recommendation of) cupping in the two veins at the\nside of the neck and the base of the neck.”"}},{"id":48,"idInBook":48,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ أَبِي الْخَصِيبِ، حَدَّثَنَا وَكِيعٌ، عَنْ جَرِيرِ بْنِ حَازِمٍ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ احْتَجَمَ فِي الأَخْدَعَيْنِ وَعَلَى الْكَاهِلِ ‏.‏","english":{"narrator":"","text":"It was\nnarrated from Anas that the Prophet (ﷺ) was cupped in the\ntwo veins\nat theside of the neck and the base of the neck."}},{"id":49,"idInBook":49,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى الْحِمْصِيُّ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا ابْنُ ثَوْبَانَ، عَنْ أَبِيهِ، عَنْ أَبِي كَبْشَةَ الأَنْمَارِيِّ، أَنَّهُ حَدَّثَهُ أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ كَانَ يَحْتَجِمُ عَلَى هَامَتِهِ وَبَيْنَ كَتِفَيْهِ وَيَقُولُ ‏\n\"‏ مَنْ أَهْرَاقَ مِنْهُ هَذِهِ الدِّمَاءَ فَلاَ يَضُرُّهُ أَنْ لاَ يَتَدَاوَى بِشَىْءٍ لِشَىْءٍ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Abu Kabshah Al-Anmari that the Prophet (ﷺ)\nused to be\ncupped on his head and between his shoulders, and he said:","text":"“Whoever\nlets blood from these places, it does not matter if he does\nnot seek\ntreatment for anything else.”"}},{"id":50,"idInBook":50,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ طَرِيفٍ، حَدَّثَنَا وَكِيعٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ سَقَطَ مِنْ فَرَسِهِ عَلَى جِذْعٍ فَانْفَكَّتْ قَدَمُهُ ‏.‏ قَالَ وَكِيعٌ يَعْنِي أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ احْتَجَمَ عَلَيْهَا مِنْ وَثْءٍ ‏.‏","english":{"narrator":"It was\nnarrated from Jabir that the Prophet (ﷺ) fell from his horse onto\nthe truck of a palm tree and dislocated his foot.\n(One of the narrators) Waki’ said:","text":"“Meaning that the Prophet (ﷺ) was cupped because of that for bruising.”"}},{"id":51,"idInBook":51,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا عُثْمَانُ بْنُ مَطَرٍ، عَنْ زَكَرِيَّا بْنِ مَيْسَرَةَ، عَنِ النَّهَّاسِ بْنِ قَهْمٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ مَنْ أَرَادَ الْحِجَامَةَ فَلْيَتَحَرَّ سَبْعَةَ عَشَرَ أَوْ تِسْعَةَ عَشَرَ أَوْ إِحْدَى وَعِشْرِينَ وَلاَ يَتَبَيَّغْ بِأَحَدِكُمُ الدَّمُ فَيَقْتُلَهُ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Anas bin Malik that the Messenger of Allah (ﷺ)\nsaid:","text":"“Whoever wants to be cupped, let him seek out the seventeenth,\nnineteenth or twenty-first (of the month); and let none of you allow\nhis blood to rage so that it kills him.”"}},{"id":52,"idInBook":52,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا عُثْمَانُ بْنُ مَطَرٍ، عَنِ الْحَسَنِ بْنِ أَبِي جَعْفَرٍ، عَنْ مُحَمَّدِ بْنِ جُحَادَةَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ يَا نَافِعُ قَدْ تَبَيَّغَ بِيَ الدَّمُ فَالْتَمِسْ لِي حَجَّامًا وَاجْعَلْهُ رَفِيقًا إِنِ اسْتَطَعْتَ وَلاَ تَجْعَلْهُ شَيْخًا كَبِيرًا وَلاَ صَبِيًّا صَغِيرًا فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\n\"‏ الْحِجَامَةُ عَلَى الرِّيقِ أَمْثَلُ وَفِيهِ شِفَاءٌ وَبَرَكَةٌ وَتَزِيدُ فِي الْعَقْلِ وَفِي الْحِفْظِ فَاحْتَجِمُوا عَلَى بَرَكَةِ اللَّهِ يَوْمَ الْخَمِيسِ وَاجْتَنِبُوا الْحِجَامَةَ يَوْمَ الأَرْبِعَاءِ وَالْجُمُعَةِ وَالسَّبْتِ وَيَوْمَ الأَحَدِ تَحَرِّيًا وَاحْتَجِمُوا يَوْمَ الاِثْنَيْنِ وَالثُّلاَثَاءِ فَإِنَّهُ الْيَوْمُ الَّذِي عَافَى اللَّهُ فِيهِ أَيُّوبَ مِنَ الْبَلاَءِ وَضَرَبَهُ بِالْبَلاَءِ يَوْمَ الأَرْبِعَاءِ فَإِنَّهُ لاَ يَبْدُو جُذَامٌ وَلاَ بَرَصٌ إِلاَّ يَوْمَ الأَرْبِعَاءِ أَوْ لَيْلَةَ الأَرْبِعَاءِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Ibn ‘Umar said:","text":"“O Nafi’! The blood is boiling\nin\nme, find me a cupper, but let it be someone gentle if you can, not\nan\nold man or a young boy. For I heard the Messenger of Allah (ﷺ)\nsay:\n‘Cupping on an empty stomach is better, and in it there is\nhealing\nand blessing, and it increases one’s intellect and memory. So\nhave\nyourselves cupped for the blessing of Allah on Thursdays, and\navoid\ncupping on Wednesdays, Fridays, Saturdays and Sundays. Have\nyourselves cupped on Mondays and Tuesdays, for that is the day on\nwhich Allah relieved Ayyub of Calamity, and He inflicted calamity\nupon\nhim on a Wednesday, and leprosy and leucoderma only appear on\nWednesdays, or on the night of Wednesday.”"}},{"id":53,"idInBook":53,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى الْحِمْصِيُّ، حَدَّثَنَا عُثْمَانُ بْنُ عَبْدِ الرَّحْمَنِ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عِصْمَةَ، عَنْ سَعِيدِ بْنِ مَيْمُونٍ، عَنْ نَافِعٍ، قَالَ قَالَ ابْنُ عُمَرَ يَا نَافِعُ تَبَيَّغَ بِيَ الدَّمُ فَأْتِنِي بِحَجَّامٍ وَاجْعَلْهُ شَابًّا وَلاَ تَجْعَلْهُ شَيْخًا وَلاَ صَبِيًّا ‏.‏ قَالَ وَقَالَ ابْنُ عُمَرَ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\n\"‏ الْحِجَامَةُ عَلَى الرِّيقِ أَمْثَلُ وَهِيَ تَزِيدُ فِي الْعَقْلِ وَتَزِيدُ فِي الْحِفْظِ وَتَزِيدُ الْحَافِظَ حِفْظًا فَمَنْ كَانَ مُحْتَجِمًا فَيَوْمَ الْخَمِيسِ عَلَى اسْمِ اللَّهِ وَاجْتَنِبُوا الْحِجَامَةَ يَوْمَ الْجُمُعَةِ وَيَوْمَ السَّبْتِ وَيَوْمَ الأَحَدِ وَاحْتَجِمُوا يَوْمَ الاِثْنَيْنِ وَالثُّلاَثَاءِ وَاجْتَنِبُوا الْحِجَامَةَ يَوْمَ الأَرْبِعَاءِ فَإِنَّهُ الْيَوْمُ الَّذِي أُصِيبَ فِيهِ أَيُّوبُ بِالْبَلاَءِ وَمَا يَبْدُو جُذَامٌ وَلاَ بَرَصٌ إِلاَّ فِي يَوْمِ الأَرْبِعَاءِ أَوْ لَيْلَةِ الأَرْبِعَاءِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Nafi’ said:","text":"“Ibn ‘Umar said: ‘O Nafi’! The\nblood\nis boiling in me. Bring me a cupper and let him be a young man,\nnot an\nold man or a boy.’ Ibn ‘Umar said: ‘I heard the\nMessenger of Allah\n(ﷺ) say: “Cupping on an empty stomach is\nbetter, and it increases\none’s intellect and memory. And it\nincreases the memory of one who has\na good memory so whoever wants to\nbe cupped, (let him do it) on a\nThursday, in the Name of Allah. Avoid\ncupping on Fridays, Saturdays\nand Sundays. Have yourselves cupped on\nMondays and Tuesdays, and avoid\ncupping on Wednesdays, for that is\nthe day on which the calamity\nbefell Ayyub, and leprosy and\nleucoderma only appear on Wednesday or\nthe night of Wednesday.”"}},{"id":54,"idInBook":54,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، عَنْ لَيْثٍ، عَنْ مُجَاهِدٍ، عَنْ عَقَّارِ بْنِ الْمُغِيرَةِ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ مَنِ اكْتَوَى أَوِ اسْتَرْقَى فَقَدْ بَرِئَ مِنَ التَّوَكُّلِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from ‘Aqqar bin Al-Mughirah from his father that the\nProphet (ﷺ) said:","text":"“Whoever seeks treatment by cauterization, or\nwith\nRuqyah, then he had absolved himself of reliance upon Allah.”"}},{"id":55,"idInBook":55,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ، حَدَّثَنَا هُشَيْمٌ، عَنْ مَنْصُورٍ، وَيُونُسَ، عَنِ الْحَسَنِ، عَنْ عِمْرَانَ بْنِ الْحُصَيْنِ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنِ الْكَىِّ فَاكْتَوَيْتُ فَمَا أَفْلَحْتُ وَلاَ أَنْجَحْتُ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Imran bin Husain said:","text":"“The Messenger of Allah\n(ﷺ) forbade cauterization. I had myself cauterized and I have not\nprospered or succeeded.”"}},{"id":56,"idInBook":56,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا مَرْوَانُ بْنُ شُجَاعٍ، حَدَّثَنَا سَالِمٌ الأَفْطَسُ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ ‏\n\"‏ الشِّفَاءُ فِي ثَلاَثٍ شَرْبَةِ عَسَلٍ وَشَرْطَةِ مِحْجَمٍ وَكَيَّةٍ بِنَارٍ وَأَنْهَى أُمَّتِي عَنِ الْكَىِّ ‏\"‏ ‏.‏ رَفَعَهُ ‏.‏","english":{"narrator":"It was\nnarrated that Ibn ‘Abbas said:","text":"“Healing is in three things: A\ndrink of honey, the glass of the cupper, and cauterizing with fire,\nbut I forbid my nation to use cauterization.” And he attributed it\nto\nthe Prophet (ﷺ)."}},{"id":57,"idInBook":57,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ بَشَّارٍ، قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، غُنْدَرٌ حَدَّثَنَا شُعْبَةُ، ح وَحَدَّثَنَا أَحْمَدُ بْنُ سَعِيدٍ الدَّارِمِيُّ، حَدَّثَنَا النَّضْرُ بْنُ شُمَيْلٍ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ سَعْدِ بْنِ زُرَارَةَ الأَنْصَارِيُّ، قَالَ سَمِعْتُ عَمِّي، يَحْيَى - وَمَا أَدْرَكْتُ رَجُلاً مِنَّا بِهِ شَبِيهًا يُحَدِّثُ النَّاسَ أَنَّ سَعْدَ بْنَ زُرَارَةَ - وَهُوَ جَدُّ مُحَمَّدٍ مِنْ قِبَلِ أُمِّهِ أَنَّهُ أَخَذَهُ وَجَعٌ فِي حَلْقِهِ يُقَالُ لَهُ الذُّبْحَةُ فَقَالَ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏\"‏ لأُبْلِغَنَّ أَوْ لأُبْلِيَنَّ فِي أَبِي أُمَامَةَ عُذْرًا ‏\"‏ ‏.‏ فَكَوَاهُ بِيَدِهِ فَمَاتَ فَقَالَ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏\"‏ مِيتَةَ سُوءٍ لِلْيَهُودِ يَقُولُونَ أَفَلاَ دَفَعَ عَنْ صَاحِبِهِ ‏.‏ وَمَا أَمْلِكُ لَهُ وَلاَ لِنَفْسِي شَيْئًا ‏\"‏ ‏.‏","english":{"narrator":"Muhammad\nbin ‘Abdur-Rahman bin Sa’d bin Zurarah Al-Ansari said:","text":"“I\nheard\nmy paternal uncle Yahya – and I have not seen a man among us\nlike\nhim – tell the people that Sa'd bin Zurarah, who was the\ngrandfather of Muhammad through his mother, was suffering from pain\nin\nhis throat, known as croup. The Prophet (ﷺ) said: ‘I shall do\nmy\nbest for Abu Umamah.’ Such that I will be excused (i.e., free of\nblame\nif he is not healed). And he cauterized him with his own hand,\nbut he\ndied. The Prophet (ﷺ) said: ‘May the Jews be doomed! They\nwill say:\n“Why could he not avert death from his Companions?” But\nI have no\npower to do anything for him or for my own self.’”"}},{"id":58,"idInBook":58,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ، حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ الطَّنَافِسِيُّ، عَنِ الأَعْمَشِ، عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرٍ، قَالَ مَرِضَ أُبَىُّ بْنُ كَعْبٍ مَرَضًا فَأَرْسَلَ إِلَيْهِ النَّبِيُّ طَبِيبًا فَكَوَاهُ عَلَى أَكْحَلِهِ ‏.‏","english":{"narrator":"It was\nnarrated that Jabir said:","text":"“Ubayy bin Ka’b fell sick, and the\nProphet (ﷺ) sent a doctor to him who cauterized him on his medical\narm vein.”"}},{"id":59,"idInBook":59,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ أَبِي الْخَصِيبِ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ كَوَى سَعْدَ بْنَ مُعَاذٍ فِي أَكْحَلِهِ مَرَّتَيْنِ ‏.‏","english":{"narrator":"","text":"It was\nnarrated from Jabir bin ‘Abdullah that the Messenger of Allah\n(ﷺ)\ncauterized Sa’d bin Mu’adh on his medial arm vein, twice."}},{"id":60,"idInBook":60,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا أَبُو سَلَمَةَ، يَحْيَى بْنُ خَلَفٍ حَدَّثَنَا أَبُو عَاصِمٍ، حَدَّثَنِي عُثْمَانُ بْنُ عَبْدِ الْمَلِكِ، قَالَ سَمِعْتُ سَالِمَ بْنَ عَبْدِ اللَّهِ، يُحَدِّثُ عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ عَلَيْكُمْ بِالإِثْمِدِ فَإِنَّهُ يَجْلُو الْبَصَرَ وَيُنْبِتُ الشَّعَرَ ‏\"‏ ‏.‏","english":{"narrator":"Salim\nbin ‘Abdullah narrated that his father said:","text":"“The Messenger of\nAllah (ﷺ) said: ‘You should use antimony, for it improves the\neyesight and makes the hair (eyelashes) grow.’”"}},{"id":61,"idInBook":61,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ، عَنْ إِسْمَاعِيلَ بْنِ مُسْلِمٍ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرٍ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\n\"‏ عَلَيْكُمْ بِالإِثْمِدِ عِنْدَ النَّوْمِ فَإِنَّهُ يَجْلُو الْبَصَرَ وَيُنْبِتُ الشَّعَرَ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Jabir said:","text":"“I heard the Messenger of Allah\n(ﷺ)\nsay: ‘You should use antimony when you go to sleep, for it\nimproves\nthe eyesight and makes the hair (eyelashes) grow.’”"}},{"id":62,"idInBook":62,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، عَنْ سُفْيَانَ، عَنِ ابْنِ خُثَيْمٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ خَيْرُ أَكْحَالِكُمُ الإِثْمِدُ يَجْلُو الْبَصَرَ وَيُنْبِتُ الشَّعَرَ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Ibn ‘Abbas that the Messenger of Allah (ﷺ)\nsaid:","text":"“The best of your kohl is antimony, for it improves the eyesight\nand makes the hair (eyelashes) grow.”"}},{"id":63,"idInBook":63,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عُمَرَ، حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ الصَّبَّاحِ، عَنْ ثَوْرِ بْنِ يَزِيدَ، عَنْ حُصَيْنٍ الْحِمْيَرِيِّ، عَنْ أَبِي سَعْدِ الْخَيْرِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ مَنِ اكْتَحَلَ فَلْيُوتِرْ مَنْ فَعَلَ فَقَدْ أَحْسَنَ وَمَنْ لاَ فَلاَ حَرَجَ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Abu Hurairah that the Prophet (ﷺ) said:","text":"“Whoever\napplies kohl, let him do it an odd number of times. Whoever\ndoes that\nhas done well, and whoever does not, it does not matter.”"}},{"id":64,"idInBook":64,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، عَنْ عَبَّادِ بْنِ مَنْصُورٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَتْ لِلنَّبِيِّ ـ صلى الله عليه وسلم ـ مُكْحُلَةٌ يَكْتَحِلُ مِنْهَا ثَلاَثًا فِي كُلِّ عَيْنٍ ‏.‏","english":{"narrator":"It was\nnarrated that Ibn ‘Abbas said:","text":"“The Prophet (ﷺ) had a kohl\ncontainer from which he would apply kohl three times, to each eye.”"}},{"id":65,"idInBook":65,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، أَنْبَأَنَا سِمَاكُ بْنُ حَرْبٍ، عَنْ عَلْقَمَةَ بْنِ وَائِلٍ الْحَضْرَمِيِّ، عَنْ طَارِقِ بْنِ سُوَيْدٍ الْحَضْرَمِيِّ، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ إِنَّ بِأَرْضِنَا أَعْنَابًا نَعْتَصِرُهَا فَنَشْرَبُ مِنْهَا قَالَ ‏\"‏ لاَ ‏\"‏ ‏.‏ فَرَاجَعْتُهُ قُلْتُ إِنَّا نَسْتَشْفِي بِهِ لِلْمَرِيضِ ‏.‏ قَالَ ‏\"‏ إِنَّ ذَلِكَ لَيْسَ بِشِفَاءٍ وَلَكِنَّهُ دَاءٌ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Tariq bin Suwaid Al-Hadrami said:","text":"“I said: ‘O\nMessenger of Allah, in our land there are grapes which we squeeze (to\nmake wine). Can we drink from it?’ He said: ‘No.’ I repeated\nthe\nquestion and said: ‘We treat the sick with it.’ He said:\n‘That is not\na cure, it is a disease.’”"}},{"id":66,"idInBook":66,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدِ بْنِ عُتْبَةَ بْنِ عَبْدِ الرَّحْمَنِ الْكِنْدِيُّ، حَدَّثَنَا عَلِيُّ بْنُ ثَابِتٍ، حَدَّثَنَا سَعَّادُ بْنُ سُلَيْمَانَ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْحَارِثِ، عَنْ عَلِيٍّ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ خَيْرُ الدَّوَاءِ الْقُرْآنُ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from ‘Ali that the Messenger of Allah (ﷺ) said:","text":"“The\nbest remedy is the Qur’an.”"}},{"id":67,"idInBook":67,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ، حَدَّثَنَا فَائِدٌ، مَوْلَى عُبَيْدِ اللَّهِ بْنِ عَلِيِّ بْنِ أَبِي رَافِعٍ حَدَّثَنِي مَوْلاَىَ، عُبَيْدُ اللَّهِ حَدَّثَتْنِي جَدَّتِي، سَلْمَى أُمُّ رَافِعٍ مَوْلاَةُ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَتْ كَانَ لاَ يُصِيبُ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَرْحَةٌ وَلاَ شَوْكَةٌ إِلاَّ وَضَعَ عَلَيْهِ الْحِنَّاءَ ‏.‏","english":{"narrator":"Salma\nUmm Rafi’, the freed slave woman of the Messenger of Allah\n(ﷺ),\nsaid:","text":"“The Prophet (ﷺ) did not suffer any injury or thorn-\nprick\nbut he would apply henna to it.”"}},{"id":68,"idInBook":68,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنَا حُمَيْدٌ، عَنْ أَنَسٍ، أَنَّ نَاسًا، مِنْ عُرَيْنَةَ قَدِمُوا عَلَى رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ فَاجْتَوَوُا الْمَدِينَةَ فَقَالَ ـ صلى الله عليه وسلم ـ ‏\n\"‏ لَوْ خَرَجْتُمْ إِلَى ذَوْدٍ لَنَا فَشَرِبْتُمْ مِنْ أَلْبَانِهَا وَأَبْوَالِهَا ‏\"‏ ‏.‏ فَفَعَلُوا ‏.‏","english":{"narrator":"It was\nnarrated from Anas that some people from ‘Urainah came to the\nMessenger of Allah (ﷺ) but they were averse to the climate of\nAl-\nMadinah. He (ﷺ) said:","text":"“Why don’t you go out to a flock of\ncamels of\nours, and drink their milk and urine.” And they did that."}},{"id":69,"idInBook":69,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، عَنِ ابْنِ أَبِي ذِئْبٍ، عَنْ سَعِيدِ بْنِ خَالِدٍ، عَنْ أَبِي سَلَمَةَ، حَدَّثَنِي أَبُو سَعِيدٍ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ فِي أَحَدِ جَنَاحَىِ الذُّبَابِ سُمٌّ وَفِي الآخَرِ شِفَاءٌ فَإِذَا وَقَعَ فِي الطَّعَامِ فَامْقُلُوهُ فِيهِ فَإِنَّهُ يُقَدِّمُ السُّمَّ وَيُؤَخِّرُ الشِّفَاءَ ‏\"‏ ‏.‏","english":{"narrator":"Abu\nSa’eed narrated that the Messenger of Allah (ﷺ) said:","text":"“On one\nof the wings of a fly there is a poison and on the other is the cure.\nIf it falls into the food, then dip it into it, for it puts the\npoison\nfirst and holds back the cure.”"}},{"id":70,"idInBook":70,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا مُسْلِمُ بْنُ خَالِدٍ، عَنْ عُتْبَةَ بْنِ مُسْلِمٍ، عَنْ عُبَيْدِ بْنِ حُنَيْنٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ إِذَا وَقَعَ الذُّبَابُ فِي شَرَابِكُمْ فَلْيَغْمِسْهُ فِيهِ ثُمَّ لْيَطْرَحْهُ فَإِنَّ فِي أَحَدِ جَنَاحَيْهِ دَاءً وَفِي الآخَرِ شِفَاءً ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Abu Hurairah that the Prophet (ﷺ) said:","text":"“If a\nfly\nfalls into your drink, dip it into it then throw it away, for on\none\nof its wings is a disease and on the other is a cure.”"}},{"id":71,"idInBook":71,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ، حَدَّثَنَا عَمَّارُ بْنُ رُزَيْقٍ، عَنْ عَبْدِ اللَّهِ بْنِ عِيسَى، عَنْ أُمَيَّةَ بْنِ هِنْدٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَامِرِ بْنِ رَبِيعَةَ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ الْعَيْنُ حَقٌّ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from ‘Abdullah bin ‘Amir bin Rabi’ah, from his\nfather,\nthat the Prophet (ﷺ) said:","text":"“The evil eye is real.”"}},{"id":72,"idInBook":72,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، عَنِ الْجُرَيْرِيِّ، عَنْ مُضَارِبِ بْنِ حَزْنٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ الْعَيْنُ حَقٌّ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)\nsaid:","text":"‘The evil eye is real.”"}},{"id":73,"idInBook":73,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا أَبُو هِشَامٍ الْمَخْزُومِيُّ، حَدَّثَنَا وُهَيْبٌ، عَنْ أَبِي وَاقِدٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ اسْتَعِيذُوا بِاللَّهِ فَإِنَّ الْعَيْنَ حَقٌّ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from ‘Aishah that the Messenger of Allah (ﷺ) said:","text":"‘Seek\nrefuge with Allah, for the evil eye is real.”"}},{"id":74,"idInBook":74,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ، قَالَ مَرَّ عَامِرُ بْنُ رَبِيعَةَ بِسَهْلِ بْنِ حُنَيْفٍ وَهُوَ يَغْتَسِلُ فَقَالَ لَمْ أَرَ كَالْيَوْمِ وَلاَ جِلْدَ مُخَبَّأَةٍ ‏.‏ فَمَا لَبِثَ أَنْ لُبِطَ بِهِ فَأُتِيَ بِهِ النَّبِيَّ ـ صلى الله عليه وسلم ـ فَقِيلَ لَهُ أَدْرِكْ سَهْلاً صَرِيعًا ‏.‏ قَالَ ‏\"‏ مَنْ تَتَّهِمُونَ بِهِ ‏\"‏ ‏.‏ قَالُوا عَامِرَ بْنَ رَبِيعَةَ ‏.‏ قَالَ ‏\"‏ عَلاَمَ يَقْتُلُ أَحَدُكُمْ أَخَاهُ إِذَا رَأَى أَحَدُكُمْ مِنْ أَخِيهِ مَا يُعْجِبُهُ فَلْيَدْعُ لَهُ بِالْبَرَكَةِ ‏\"‏ ‏.‏ ثُمَّ دَعَا بِمَاءٍ فَأَمَرَ عَامِرًا أَنْ يَتَوَضَّأَ فَيَغْسِلَ وَجْهَهُ وَيَدَيْهِ إِلَى الْمِرْفَقَيْنِ وَرُكْبَتَيْهِ وَدَاخِلَةَ إِزَارِهِ وَأَمَرَهُ أَنْ يَصُبَّ عَلَيْهِ ‏.‏ قَالَ سُفْيَانُ قَالَ مَعْمَرٌ عَنِ الزُّهْرِيِّ وَأَمَرَهُ أَنْ يَكْفَأَ الإِنَاءَ مِنْ خَلْفِهِ ‏.‏","english":{"narrator":"It was\nnarrated that Abu Umamah bin Sahl bin Hunaif said:","text":"“ ‘Amir bin\nRabi’ah passed by Sahl bin Hunaif when he was having a bath, and\nsaid:\n‘I have never seen such beautiful skin.’ Straightaway, he\n(Sahl) fell\nto the ground. He was brought to the Prophet (ﷺ) and it\nwas said:\n‘Sahl has had a fit.’ He said: ‘Whom do you accuse\nwith regard to\nhim?’ They said: “ ‘Amir bin Rabi’ah.’ They\nsaid: ‘Why would anyone of\nyou kill his brother? If he sees\nsomething that he likes, then let him\npray for blessing for him.’\nThen he called for water, and he told\n‘Amir to perform ablution,\nthen he washed his face and his arms up to\nthe elbows, his knees and\ninside his lower garment, then he told him\nto pour the water over\nhim.”"}},{"id":75,"idInBook":75,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ عُرْوَةَ بْنِ عَامِرٍ، عَنْ عُبَيْدِ بْنِ رِفَاعَةَ الزُّرَقِيِّ، قَالَ قَالَتْ أَسْمَاءُ يَا رَسُولَ اللَّهِ إِنَّ بَنِي جَعْفَرٍ تُصِيبُهُمُ الْعَيْنُ فَأَسْتَرْقِي لَهُمْ قَالَ ‏\n\"‏ نَعَمْ فَلَوْ كَانَ شَىْءٌ سَابَقَ الْقَدَرَ سَبَقَتْهُ الْعَيْنُ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Ubaid bin Rifa’ah Az-Zuraqi said:","text":"“Asma’ said:\n‘O Messenger of Allah! The children of Ja’far have been afflicted\nby\nthe evil eye, shall I recite Ruqyah* for them?’ He said: ‘Yes,\nfor if\nanything were to overtake the Divine decree it would be the\nevil\neye.’”"}},{"id":76,"idInBook":76,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سَعِيدُ بْنُ سُلَيْمَانَ، عَنْ عَبَّادٍ، عَنِ الْجُرَيْرِيِّ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ، قَالَ كَانَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ يَتَعَوَّذُ مِنْ عَيْنِ الْجَانِّ وَأَعْيُنِ الإِنْسِ فَلَمَّا نَزَلَتِ الْمُعَوِّذَتَانِ أَخَذَهُمَا وَتَرَكَ مَا سِوَى ذَلِكَ ‏.‏","english":{"narrator":"It was\nnarrated that Abu Sa’eed said:","text":"“The Messenger of Allah (ﷺ)\nused\nto seek refuge from the evil eye of the jinn and of mankind. When\nthe\nMu’awwidhatain* were revealed, he started to recite them and\nstopped reciting anything else.”"}},{"id":77,"idInBook":77,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ أَبِي الْخَصِيبِ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، وَمِسْعَرٍ، عَنْ مَعْبَدِ بْنِ خَالِدٍ، عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادٍ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ أَمَرَهَا أَنْ تَسْتَرْقِيَ مِنَ الْعَيْنِ ‏.‏","english":{"narrator":"","text":"It was\nnarrated from ‘Aishah that the Prophet (ﷺ) commanded her to\nrecite Ruqyah to treat the evil eye."}},{"id":78,"idInBook":78,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا إِسْحَاقُ بْنُ سُلَيْمَانَ، عَنْ أَبِي جَعْفَرٍ الرَّازِيِّ، عَنْ حُصَيْنٍ، عَنِ الشَّعْبِيِّ، عَنْ بُرَيْدَةَ بْنِ الْحُصَيْبِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ لاَ رُقْيَةَ إِلاَّ مِنْ عَيْنٍ أَوْ حُمَةٍ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Buraidah that the Messenger of Allah (ﷺ) said:","text":"“There\nis no Ruqyah except for the evil eye or from the sting of a\nscorpion.”"}},{"id":79,"idInBook":79,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، عَنْ مُحَمَّدِ بْنِ عُمَارَةَ، عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدٍ، أَنَّ خَالِدَةَ بِنْتَ أَنَسٍ أُمَّ بَنِي حَزْمٍ السَّاعِدِيَّةَ، جَاءَتْ إِلَى النَّبِيِّ ـ صلى الله عليه وسلم ـ فَعَرَضَتْ عَلَيْهِ الرُّقَى فَأَمَرَهَا بِهَا ‏.‏","english":{"narrator":"","text":"It as\nnarrated from Abu Bakr bin Muhammad that Khalidah bint Anas,\nthe\nmother of Banu Hazm As-Sa’idiyyah, came to the Prophet (ﷺ) and\nrecited a Ruqyah to him, and he told her to use it."}},{"id":80,"idInBook":80,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ أَبِي الْخَصِيبِ، حَدَّثَنَا يَحْيَى بْنُ عِيسَى، عَنِ الأَعْمَشِ، عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرٍ، قَالَ كَانَ أَهْلُ بَيْتٍ مِنَ الأَنْصَارِ يُقَالُ لَهُمْ آلُ عَمْرِو بْنِ حَزْمٍ يَرْقُونَ مِنَ الْحُمَةِ وَكَانَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ قَدْ نَهَى عَنِ الرُّقَى فَأَتَوْهُ فَقَالُوا يَا رَسُولَ اللَّهِ إِنَّكَ قَدْ نَهَيْتَ عَنِ الرُّقَى وَإِنَّا نَرْقِي مِنَ الْحُمَةِ ‏.‏ فَقَالَ لَهُمُ ‏\"‏ اعْرِضُوا عَلَىَّ ‏\"‏ ‏.‏ فَعَرَضُوهَا عَلَيْهِ فَقَالَ ‏\"‏ لاَ بَأْسَ بِهَذِهِ هَذِهِ مَوَاثِيقُ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Jabir said:","text":"“There was a family among the Ansar,\ncalled Al ‘Amr bin Hazm, who used to recite Ruqyah for the scorpion\nsting, but the Messenger of Allah (ﷺ) forbade Ruqyah. They came to\nhim and said: ‘O Messenger of Allah! You have forbidden Ruqyah, but\nwe\nrecite Ruqyah against the scorpion’s sting.’ He said to them:\n‘Recite\nit to me.’ So they recited it to him, and he said: ‘There\nis nothing\nwrong with this, this is confirmed.’”"}},{"id":81,"idInBook":81,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا عَبْدَةُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَاصِمٍ، عَنْ يُوسُفَ بْنِ عَبْدِ اللَّهِ بْنِ الْحَارِثِ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ رَخَّصَ فِي الرُّقْيَةِ مِنَ الْحُمَةِ وَالْعَيْنِ وَالنَّمْلَةِ ‏.‏","english":{"narrator":"","text":"It was\nnarrated from Anas that the Prophet (ﷺ) allowed Ruqyah for\nthe\nscorpion’s sting, the evil eye, and Namlah (sores or small\npustules\nulcers or sores on a person’s sides)."}},{"id":82,"idInBook":82,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَهَنَّادُ بْنُ السَّرِيِّ، قَالاَ حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ مُغِيرَةَ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ رَخَّصَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ فِي الرُّقْيَةِ مِنَ الْحَيَّةِ وَالْعَقْرَبِ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Aishah said:","text":"“The Messenger of Allah (ﷺ)\nallowed\nRuqyah for snakebites and scorpion stings.”"}},{"id":83,"idInBook":83,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ بْنُ بَهْرَامَ، حَدَّثَنَا عُبَيْدُ اللَّهِ الأَشْجَعِيُّ، عَنْ سُفْيَانَ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ لَدَغَتْ عَقْرَبٌ رَجُلاً فَلَمْ يَنَمْ لَيْلَتَهُ فَقِيلَ لِلنَّبِيِّ ـ صلى الله عليه وسلم ـ إِنَّ فُلاَنًا لَدَغَتْهُ عَقْرَبٌ فَلَمْ يَنَمْ لَيْلَتَهُ ‏.‏ فَقَالَ ‏\n\"‏ أَمَا إِنَّهُ لَوْ قَالَ حِينَ أَمْسَى أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ - مَا ضَرَّهُ لَدْغُ عَقْرَبٍ حَتَّى يُصْبِحَ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Abu Hurairah said:","text":"“A scorpion stung a man and\nhe did\nnot sleep all the night. It was said to the Prophet (ﷺ): ‘So-\nand-so\nwas stung by a scorpion and he did not sleep all the night.’ He\nsaid: ‘If he had said, last night: A’udhu\nbikalimatil-lahit-tammati\nmin sharri ma khalaq (I seek refuge in the\nPerfect Words of Allah from\nthe evil of that which He has created),\nthe scorpion sting would not\nhave harmed him, until morning.’”"}},{"id":84,"idInBook":84,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، حَدَّثَنَا عُثْمَانُ بْنُ حَكِيمٍ، حَدَّثَنِي أَبُو بَكْرِ بْنُ عَمْرِو بْنِ حَزْمٍ، عَنْ عَمْرِو بْنِ حَزْمٍ، قَالَ عَرَضْتُ النَّهْشَةَ مِنَ الْحَيَّةِ عَلَى رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ فَأَمَرَ بِهَا ‏.‏","english":{"narrator":"It was\nnarrated that ‘Amr bin Hazm said:","text":"“I recited the Ruqyah for\nsnakebite to the Messenger of Allah (ﷺ), or it was recited to him,\nand he commanded that it be used.”"}},{"id":85,"idInBook":85,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ أَبِي الضُّحَى، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ إِذَا أَتَى الْمَرِيضَ فَدَعَا لَهُ قَالَ ‏\n\"‏ أَذْهِبِ الْبَاسْ رَبَّ النَّاسْ وَاشْفِ أَنْتَ الشَّافِي لاَ شِفَاءَ إِلاَّ شِفَاؤُكَ شِفَاءً لاَ يُغَادِرُ سَقَمًا ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Aishah said:","text":"“When the Messenger of Allah (ﷺ)\ncame to a sick person, he would make supplication for him, and would\nsay: Adhhibil-bas, Rabban-nas, washfi Antash-Shafi, la shifa’a illa\nshifa’uka shifa’an la yughadiru saqama (Take away the pain, O Lord of\nmankind, and grant healing, for You are the Healer, and there is no\nhealing but Your healing that leaves no trace of sickness).’”"}},{"id":86,"idInBook":86,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ رَبِّهِ، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ كَانَ مِمَّا يَقُولُ لِلْمَرِيضِ بِبُزَاقِهِ بِإِصْبَعِهِ ‏\n\"‏ بِسْمِ اللَّهِ بِتُرْبَةِ أَرْضِنَا بِرِيقَةِ بَعْضِنَا لِيُشْفَى سَقِيمُنَا بِإِذْنِ رَبِّنَا ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from ‘Aishah that one of the things that the Prophet\n(ﷺ)\nused to say for the sick person, with saliva on his finger\n(dipped in\ndust), was:","text":"“Bismillah, turbatu ardina, biriqati ba’dina,\nliyushfa\nsaqimuna. Bi’dhni Rabbina (In the Name of Allah, the dust of\nour\nland mixed with the saliva of one of us, to cure our sick one by\nthe\npermission of our Lord).”"}},{"id":87,"idInBook":87,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا يَحْيَى بْنُ أَبِي بُكَيْرٍ، حَدَّثَنَا زُهَيْرُ بْنُ مُحَمَّدٍ، عَنْ يَزِيدَ بْنِ خُصَيْفَةَ، عَنْ عَمْرِو بْنِ عَبْدِ اللَّهِ بْنِ كَعْبٍ، عَنْ نَافِعِ بْنِ جُبَيْرٍ، عَنْ عُثْمَانَ بْنِ أَبِي الْعَاصِ الثَّقَفِيِّ، أَنَّهُ قَالَ قَدِمْتُ عَلَى النَّبِيِّ ـ صلى الله عليه وسلم ـ وَبِي وَجَعٌ قَدْ كَادَ يُبْطِلُنِي فَقَالَ لِيَ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏\n\"‏ اجْعَلْ يَدَكَ الْيُمْنَى عَلَيْهِ وَقُلْ بِسْمِ اللَّهِ أَعُوذُ بِعِزَّةِ اللَّهِ وَقُدْرَتِهِ مِنْ شَرِّ مَا أَجِدُ وَأُحَاذِرُ سَبْعَ مَرَّاتٍ ‏\"‏ ‏.‏ فَقُلْتُ ذَلِكَ فَشَفَانِيَ اللَّهُ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Uthman bin Abul-‘As Thaqafi said:","text":"“I came to\nthe\nProphet (ﷺ) and I was suffering pain that was killing me. The\nProphet (ﷺ) said to me: ‘Put your right hand on it and say:\nBismillah, a’udhu bi’izzatil-lahi wa qudratihi min sharri ma\najidu wa\nuhadhiru. (In the Name of Allah, I seek refuge in the might\nand power\nof Allah from the evil of what I feel and what I fear),”\nseven times.’\nI said that, and Allah healed me.”"}},{"id":88,"idInBook":88,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا بِشْرُ بْنُ هِلاَلٍ الصَّوَّافُ، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ، أَنَّ جِبْرَائِيلَ، أَتَى النَّبِيَّ ـ صلى الله عليه وسلم ـ فَقَالَ يَا مُحَمَّدُ اشْتَكَيْتَ قَالَ ‏\n\"‏ نَعَمْ ‏\"‏ ‏.‏ قَالَ بِسْمِ اللَّهِ أَرْقِيكَ مِنْ كُلِّ شَىْءٍ يُؤْذِيكَ مِنْ شَرِّ كُلِّ نَفْسٍ أَوْ عَيْنٍ أَوْ حَاسِدٍ اللَّهُ يَشْفِيكَ بِسْمِ اللَّهِ أَرْقِيكَ ‏.‏","english":{"narrator":"It was\nnarrated from Abu Sa’eed that Jibra’il came to the Prophet\n(ﷺ)\nand said:","text":"“O Muhammad, you are ill. He said: ‘Yes.’ He said:\nBismillahi arqika, min kulli shay’in yu’dhika, min sharri kulli\nnafsin\naw ‘aynin aw hasidin. Allahu yashfika, bismillahi arqika (In\nthe Name\nof Allah I perform Ruqyah for you, from everything that is\nharming\nyou, from the evil of every soul or envious eye, may Allah\nheal you.\nIn the Name of Allah I perform Ruqyah for you)."}},{"id":89,"idInBook":89,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، وَحَفْصُ بْنُ عُمَرَ، قَالاَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، حَدَّثَنَا سُفْيَانُ، عَنْ عَاصِمِ بْنِ عُبَيْدِ اللَّهِ، عَنْ زِيَادِ بْنِ ثُوَيْبٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ جَاءَ النَّبِيُّ ـ صلى الله عليه وسلم ـ يَعُودُنِي فَقَالَ لِي ‏\"‏ أَلاَ أَرْقِيكَ بِرُقْيَةٍ جَاءَنِي بِهَا جِبْرَائِيلُ ‏\"‏ ‏.‏ قُلْتُ بِأَبِي وَأُمِّي بَلَى يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\"‏ بِسْمِ اللَّهِ أَرْقِيكَ وَاللَّهُ يَشْفِيكَ مِنْ كُلِّ دَاءٍ فِيكَ مِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ ‏\"‏ ‏.‏ ثَلاَثَ مَرَّاتٍ ‏.‏","english":{"narrator":"It was\nnarrated that Abu Hurairah said:","text":"“The Prophet (ﷺ) came to\nvisit\nme (when I was sick), and said to me: ‘Shall I not recite for\nyou a\nRuqyah that Jibra’il brought to me?’ I said: ‘May my father and\nmother be ransomed for you! Yes, O Messenger of Allah!’ He said:\nBismillah arqika, wallahu yashfika, min kulli da’in fika, min\nsharrin-\nnaffathati fil-‘uqad, wa min sharri hasidin idha hasad (In\nthe Name of\nAllah I perform Ruqyah for you, from every disease that\nis in you, and\nfrom the evil of those who (practice witchcraft when\nthey) blow in the\nknots, and from the evil of the envier when he\nenvies), three times.”"}},{"id":90,"idInBook":90,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ بْنِ هِشَامٍ الْبَغْدَادِيُّ، حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ خَلاَّدٍ الْبَاهِلِيُّ، حَدَّثَنَا أَبُو عَامِرٍ، قَالاَ حَدَّثَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، عَنْ مِنْهَالٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَ النَّبِيُّ ـ صلى الله عليه وسلم ـ يُعَوِّذُ الْحَسَنَ وَالْحُسَيْنَ يَقُولُ ‏\"‏ أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّةِ مِنْ كُلِّ شَيْطَانٍ وَهَامَّةٍ وَمِنْ كُلِّ عَيْنٍ لاَمَّةٍ ‏\"‏ ‏.‏ قَالَ ‏\"‏ وَكَانَ أَبُونَا إِبْرَاهِيمُ يَعُوِّذُ بِهَا إِسْمَاعِيلَ وَإِسْحَاقَ ‏\"‏ ‏.‏ أَوْ قَالَ ‏\"‏ إِسْمَاعِيلَ وَيَعْقُوبَ ‏\"‏ ‏.‏ وَهَذَا حَدِيثُ وَكِيعٍ ‏.‏","english":{"narrator":"It was\nnarrated that Ibn ‘Abbas said:","text":"“The Prophet (ﷺ) used to seek\nrefuge for Hasan and Husain and say: A’udhu bi\nkalimatil-lahil-\ntammati, min kulli shaitanin wa hammah, wa min kulli\n‘aynin lammah (I\nseek refuge for you both in the Perfect Words of\nAllah, from every\ndevil and every poisonous reptile, and from every\nevil eye).’ And he\nwould say: ‘Thus Ibrahim used to seek refuge\nwith Allah for Isma’il\nand Ishaq,’ or he said: ‘for Isma’il\nand Ya’qub.’”"}},{"id":91,"idInBook":91,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا أَبُو عَامِرٍ، حَدَّثَنَا إِبْرَاهِيمُ الأَشْهَلِيُّ، عَنْ دَاوُدَ بْنِ حُصَيْنٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ كَانَ يُعَلِّمُهُمْ مِنَ الْحُمَّى وَمِنَ الأَوْجَاعِ كُلِّهَا أَنْ يَقُولُوا ‏\"‏ بِسْمِ اللَّهِ الْكَبِيرِ أَعُوذُ بِاللَّهِ الْعَظِيمِ مِنْ شَرِّ عِرْقٍ نَعَّارٍ وَمِنْ شَرِّ حَرِّ النَّارِ ‏\"‏ ‏.‏ قَالَ أَبُو عَامِرٍ أَنَا أُخَالِفُ النَّاسَ فِي هَذَا أَقُولُ يَعَّارٍ ‏.‏ \n حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ، حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، أَخْبَرَنِي إِبْرَاهِيمُ بْنُ إِسْمَاعِيلَ بْنِ أَبِي حَبِيبَةَ الأَشْهَلِيُّ، عَنْ دَاوُدَ بْنِ الْحُصَيْنِ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ نَحْوَهُ وَقَالَ ‏\"‏ مِنْ شَرِّ عِرْقٍ نَعَّارٍ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Ibn ‘Abbas that, for fever and all kinds of\npain, the\nProphet (ﷺ) used to teach them to say:","text":"“Bismillahil-kabir,\na’udhu\nbillahil-‘Azim min sharri ‘irqin na’ar wa, min sharri\nharrin-\nnar (In the Name of Allah the Great, I seek refuge with Allah\nthe\nAlmighty from the evil of a vein gushing (with blood) and the\nevil of\nthe heat of the Fire.”\n\n(One of the narrators) Abu `Ammar said: “I differed with the people on this, I said: ‘Screaming.’”\n\nAnother chain from Ibn `Abbas, from the Prophet (ﷺ) with similar wording, and he said: “From the evil of a vein screaming (with blood).”"}},{"id":92,"idInBook":92,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ بْنِ سَعِيدِ بْنِ كَثِيرِ بْنِ دِينَارٍ الْحِمْصِيُّ، حَدَّثَنَا أَبِي، عَنِ ابْنِ ثَوْبَانَ، عَنْ عُمَيْرٍ، أَنَّهُ سَمِعَ جُنَادَةَ بْنَ أَبِي أُمَيَّةَ، قَالَ سَمِعْتُ عُبَادَةَ بْنَ الصَّامِتِ، يَقُولُ أَتَى جِبْرَائِيلُ عَلَيْهِ السَّلاَمُ النَّبِيَّ ـ صلى الله عليه وسلم ـ وَهُوَ يُوعَكُ فَقَالَ بِسْمِ اللَّهِ أَرْقِيكَ مِنْ كُلِّ شَىْءٍ يُؤْذِيكَ مِنْ حَسَدِ حَاسِدٍ وَمِنْ كُلِّ عَيْنٍ اللَّهُ يَشْفِيكَ ‏.‏","english":{"narrator":"It was\nnarrated from ‘Umair that he heard Junadah bin Abu Umayyah\nsay:","text":"“I\nheard ‘Ubadah bin Samit say: ‘Jibra’il (as) came to the\nProphet\n(ﷺ) when he was suffering from fever and said: ‘Bismillahi\narqika, min kulli shay’in yu’dhika, min hasadi hasidin, wa min\nkulli\n‘aynin, Allahu yashfika (In the Name of Allah I perform\nRuqyah for\nyou, from everything that is harming you; from the envy of\nthe envier\nand from every evil eye, may Allah heal you).’”"}},{"id":93,"idInBook":93,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مَيْمُونٍ الرَّقِّيُّ، وَسَهْلُ بْنُ أَبِي سَهْلٍ، قَالُوا حَدَّثَنَا وَكِيعٌ، عَنْ مَالِكِ بْنِ أَنَسٍ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ كَانَ يَنْفِثُ فِي الرُّقْيَةِ ‏.‏","english":{"narrator":"","text":"It was\nnarrated from ‘Aishah that the Prophet (ﷺ) used to blow when\nperforming Ruqyah."}},{"id":94,"idInBook":94,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا سَهْلُ بْنُ أَبِي سَهْلٍ، قَالَ حَدَّثَنَا مَعْنُ بْنُ عِيسَى، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا بِشْرُ بْنُ عُمَرَ، قَالاَ حَدَّثَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ كَانَ إِذَا اشْتَكَى يَقْرَأُ عَلَى نَفْسِهِ الْمُعَوِّذَاتِ وَيَنْفِثُ فَلَمَّا اشْتَدَّ وَجَعُهُ كُنْتُ أَقْرَأُ عَلَيْهِ وَأَمْسَحُ بِيَدِهِ رَجَاءَ بَرَكَتِهَا ‏.‏","english":{"narrator":"It was\nnarrated from ‘Aishah:","text":"“Whenever the Prophet (ﷺ) fell ill,\nhe\nwould recite the Mu’awwidhat and blow, and when his pain grew\nworse, I would recite over him and wipe his hand over him, hoping for\nits blessing.”"}},{"id":95,"idInBook":95,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا أَيُّوبُ بْنُ مُحَمَّدٍ الرَّقِّيُّ، حَدَّثَنَا مُعَمَّرُ بْنُ سُلَيْمَانَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بِشْرٍ، عَنِ الأَعْمَشِ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ يَحْيَى بْنِ الْجَزَّارِ، عَنِ ابْنِ أُخْتِ، زَيْنَبَ امْرَأَةِ عَبْدِ اللَّهِ عَنْ زَيْنَبَ، قَالَتْ كَانَتْ عَجُوزٌ تَدْخُلُ عَلَيْنَا تَرْقِي مِنَ الْحُمْرَةِ وَكَانَ لَنَا سَرِيرٌ طَوِيلُ الْقَوَائِمِ وَكَانَ عَبْدُ اللَّهِ إِذَا دَخَلَ تَنَحْنَحَ وَصَوَّتَ فَدَخَلَ يَوْمًا فَلَمَّا سَمِعَتْ صَوْتَهُ احْتَجَبَتْ مِنْهُ فَجَاءَ فَجَلَسَ إِلَى جَانِبِي فَمَسَّنِي فَوَجَدَ مَسَّ خَيْطٍ فَقَالَ مَا هَذَا فَقُلْتُ رُقًى لِي فِيهِ مِنَ الْحُمْرَةِ فَجَذَبَهُ وَقَطَعَهُ فَرَمَى بِهِ وَقَالَ لَقَدْ أَصْبَحَ آلُ عَبْدِ اللَّهِ أَغْنِيَاءَ عَنِ الشِّرْكِ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\"‏ إِنَّ الرُّقَى وَالتَّمَائِمَ وَالتِّوَلَةَ شِرْكٌ ‏\"‏ ‏.‏ قُلْتُ فَإِنِّي خَرَجْتُ يَوْمًا فَأَبْصَرَنِي فُلاَنٌ فَدَمَعَتْ عَيْنِي الَّتِي تَلِيهِ فَإِذَا رَقَيْتُهَا سَكَنَتْ دَمْعَتُهَا وَإِذَا تَرَكْتُهَا دَمَعَتْ ‏.‏ قَالَ ذَاكِ الشَّيْطَانُ إِذَا أَطَعْتِيهِ تَرَكَكِ وَإِذَا عَصَيْتِيهِ طَعَنَ بِإِصْبَعِهِ فِي عَيْنِكِ وَلَكِنْ لَوْ فَعَلْتِ كَمَا فَعَلَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ كَانَ خَيْرًا لَكِ وَأَجْدَرَ أَنْ تَشْفِينَ تَنْضَحِينَ فِي عَيْنِكِ الْمَاءَ وَتَقُولِينَ ‏\"‏ أَذْهِبِ الْبَاسْ رَبَّ النَّاسْ اشْفِ أَنْتَ الشَّافِي لاَ شِفَاءَ إِلاَّ شِفَاؤُكَ شِفَاءً لاَ يُغَادِرُ سَقَمًا ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Zainab said:","text":"“There was an old woman who used to\nenter upon us and perform Ruqyah from erysipelas: Contagious disease\nwhich causes fever and leaves a red coloration of the skin. We had a\nbed with long legs, and when ‘Abdullah entered he would clear his\nthroat and make noise. He entered one day and when she heard his\nvoice she veiled herself from him. He came and sat beside me, and\ntouched me, and he found a sting. He said: ‘What is this?’ I\nsaid: ‘An amulet against erysipelas.’ He pulled it, broke it and\nthrew it away, and said: ‘The family of ‘Abdullah has no need of\npolytheism.’ I heard the Messenger of Allah (ﷺ) say: “Ruqyah\n(i.e., which consist of the names of idols and devils etc.), amulets\nand Tiwalah (charms) are polytheism.’”\n“I said: ‘I went out one day and so-and-so looked at me, and my eye began to water on the side nearest him. When I recited Ruqyah for it, it stopped, but if I did not recite Ruqyah it watered again.’ He said: ‘That is Satan, if you obey him he leaves you alone but if you disobey him he pokes you with his finger in your eye. But if you do what the Messenger of Allah (ﷺ) used to do, that will be better for you and more effective in healing. Sprinkle water in your eye and say: Adhhibil-bas Rabban-nas, washfi Antash-Shafi, la shifa’a illa shafi’uka, shafi’an la yughadiru saqaman (Take away the pain, O Lord of mankind, and grant healing, for You are the Healer, and there is no healing but Your healing that leaves no trace of sickness).’”"}},{"id":96,"idInBook":96,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ أَبِي الْخَصِيبِ، حَدَّثَنَا وَكِيعٌ، عَنْ مُبَارَكٍ، عَنِ الْحَسَنِ، عَنْ عِمْرَانَ بْنِ الْحُصَيْنِ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ رَأَى رَجُلاً فِي يَدِهِ حَلْقَةٌ مِنْ صُفْرٍ فَقَالَ ‏\"‏ مَا هَذِهِ الْحَلْقَةُ ‏\"‏ ‏.‏ قَالَ هَذِهِ مِنَ الْوَاهِنَةِ ‏.‏ قَالَ ‏\"‏ انْزِعْهَا فَإِنَّهَا لاَ تَزِيدُكَ إِلاَّ وَهْنًا ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from ‘Imran bin Husain that the Prophet (ﷺ) saw a\nman\nwith a brass ring on his hand. He said:","text":"“What is this ring?” He\nsaid: “It is for Wahinah.”* He said: “Take it off, for it will\nonly\nincrease you in weakness.”"}},{"id":97,"idInBook":97,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ، عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ، عَنْ سُلَيْمَانَ بْنِ عَمْرِو بْنِ الأَحْوَصِ، عَنْ أُمِّ جُنْدَبٍ، قَالَتْ رَأَيْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ رَمَى جَمْرَةَ الْعَقَبَةِ مِنْ بَطْنِ الْوَادِي يَوْمَ النَّحْرِ ثُمَّ انْصَرَفَ وَتَبِعَتْهُ امْرَأَةٌ مِنْ خَثْعَمٍ وَمَعَهَا صَبِيٌّ لَهَا بِهِ بَلاَءٌ لاَ يَتَكَلَّمُ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ هَذَا ابْنِي وَبَقِيَّةُ أَهْلِي وَإِنَّ بِهِ بَلاَءً لاَ يَتَكَلَّمُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ ائْتُونِي بِشَىْءٍ مِنْ مَاءٍ ‏\"‏ ‏.‏ فَأُتِيَ بِمَاءٍ فَغَسَلَ يَدَيْهِ وَمَضْمَضَ فَاهُ ثُمَّ أَعْطَاهَا فَقَالَ ‏\"‏ اسْقِيهِ مِنْهُ وَصُبِّي عَلَيْهِ مِنْهُ وَاسْتَشْفِي اللَّهَ لَهُ ‏\"‏ ‏.‏ قَالَتْ فَلَقِيتُ الْمَرْأَةَ فَقُلْتُ لَوْ وَهَبْتِ لِي مِنْهُ ‏.‏ فَقَالَتْ إِنَّمَا هُوَ لِهَذَا الْمُبْتَلَى ‏.‏ قَالَتْ فَلَقِيتُ الْمَرْأَةَ مِنَ الْحَوْلِ فَسَأَلْتُهَا عَنِ الْغُلاَمِ فَقَالَتْ بَرَأَ وَعَقَلَ عَقْلاً لَيْسَ كَعُقُولِ النَّاسِ ‏.‏","english":{"narrator":"It was\nnarrated that Umm Jundub said:","text":"“I saw the Messenger of Allah\n(ﷺ)\nstoning the ‘Aqabah Pillar from the bottom of the valley on the\nDay\nof Sacrifice, then he went away. A woman from Khath’am followed\nhim, and with her was a son of hers who had been afflicted, he could\nnot speak. She said: ‘O Messenger of Allah! This is my son, and he\nis\nall I have left of my family. He has been afflicted and cannot\nspeak.’\nThe Messenger of Allah (ﷺ) said: ‘Bring me some water.’\nSo it was\nbrought, and he washed his hands and rinsed out his mouth.\nThen he\ngave it to her and said: ‘Give him some to drink, and pour\nsome over\nhim, and seek Allah’s healing for him.’” She (Umm\nJundub) said: “I met\nthat woman and said: ‘Why don’t you give\nme some?’ She said: ‘It is\nonly for the sick one.’ I met that\nwoman one year later and asked her\nabout the boy. She said: ‘He\nrecovered and became (very) smart, not\nlike the rest of the people.’”"}},{"id":98,"idInBook":98,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدِ بْنِ عُتْبَةَ بْنِ عَبْدِ الرَّحْمَنِ الْكِنْدِيُّ حَدَّثَنَا عَلِيُّ بْنُ ثَابِتٍ حَدَّثَنَا مُعَّادُ بْنُ سُلَيْمَانَ عَنْ أَبِي إِسْحَقَ عَنْ الْحَارِثِ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْرُ الدَّوَاءِ الْقُرْآنُ","english":{"narrator":"It was\nnarrated from ‘Ali that the Messenger of Allah (ﷺ) said:","text":"“The\nbest remedy is the Qur’an.”"}},{"id":99,"idInBook":99,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ أَمَرَ النَّبِيُّ ـ صلى الله عليه وسلم ـ بِقَتْلِ ذِي الطُّفْيَتَيْنِ فَإِنَّهُ يَلْتَمِسُ الْبَصَرَ وَيُصِيبُ الْحَبَلَ ‏.‏ يَعْنِي حَيَّةً خَبِيثَةً ‏.‏","english":{"narrator":"It was\nnarrated that ‘Aishah said:","text":"“The Prophet (ﷺ) enjoined\nkilling\nDhit-Tufytain* for it takes away the sight and causes\nmiscarriage.”\n\n*That means a wicked snake."}},{"id":100,"idInBook":100,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ اقْتُلُوا الْحَيَّاتِ وَاقْتُلُوا ذَا الطُّفْيَتَيْنِ وَالأَبْتَرَ فَإِنَّهُمَا يَلْتَمِسَانِ الْبَصَرَ وَيُسْقِطَانِ الْحَبَلَ ‏\"‏ ‏.‏","english":{"narrator":"it was\nnarrated from Salim, from his father, that the Messenger of\nAllah\n(ﷺ) said:","text":"“Kill snakes, and kill Dhit-Tufytain* and the Abtar**,\nfor they take away the sight and cause miscarriage.”\n\n*A snake that has two white stripes on its back.\n\n**A snake with a short or mutilated tail."}},{"id":101,"idInBook":101,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ كَانَ النَّبِيُّ ـ صلى الله عليه وسلم ـ يُعْجِبُهُ الْفَأْلُ الْحَسَنُ وَيَكْرَهُ الطِّيَرَةَ ‏.‏","english":{"narrator":"It was\nnarrated that Abu Hurairah said:","text":"“The Prophet (ﷺ) used to\nlike\ngood signs and hate bad omens.”"}},{"id":102,"idInBook":102,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَنْبَأَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، قَالَ قَالَ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏\n\"‏ لاَ عَدْوَى وَلاَ طِيَرَةَ وَأُحِبُّ الْفَأْلَ الصَّالِحَ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Anas said:","text":"“The Prophet (ﷺ) said: ‘There is no\n‘Adwa* and no omen, but I like Al-Fa’l As-Salih.”**"}},{"id":103,"idInBook":103,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ سَلَمَةَ، عَنْ عِيسَى بْنِ عَاصِمٍ، عَنْ زِرٍّ، عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ الطِّيَرَةُ شِرْكٌ وَمَا مِنَّا إِلاَّ وَلَكِنَّ اللَّهَ يُذْهِبُهُ بِالتَّوَكُّلِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from ‘Abdullah that the Messenger of Allah (ﷺ)\nsaid:","text":"“The omen is polytheistic deed and anyone of us may think he\nsees\nan omen but Allah will dispel it by means of relying upon Him.”"}},{"id":104,"idInBook":104,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ سِمَاكٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ لاَ عَدْوَى وَلاَ طِيَرَةَ وَلاَ هَامَةَ وَلاَ صَفَرَ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Ibn ‘Abbas that the Messenger of Allah (ﷺ) said:","text":"“There is no ‘Adwa, no omen, no Hamah and no Safar.”*"}},{"id":105,"idInBook":105,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ أَبِي جَنَابٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ لاَ عَدْوَى وَلاَ طِيَرَةَ وَلاَ هَامَةَ ‏\"‏ ‏.‏ فَقَامَ إِلَيْهِ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ الْبَعِيرُ يَكُونُ بِهِ الْجَرَبُ فَتَجْرَبُ بِهِ الإِبِلُ ‏.‏ قَالَ ‏\"‏ ذَلِكَ الْقَدَرُ فَمَنْ أَجْرَبَ الأَوَّلَ ‏\"‏ ‏.‏","english":{"narrator":"Ibn\n‘Umar said:","text":"“The Messenger of Allah (ﷺ) said: ‘There is no\n‘Adwa, no omen, and no Hamah.’ A man stood up and said: ‘O\nMessenger\nof Allah, what if a camel has mange and another camel gets\nmange from\nit?’ He said: ‘That is the Divine decree. Who causes\nthe mange in the\nfirst one?’”"}},{"id":106,"idInBook":106,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ لاَ يُورِدُ الْمُمْرِضُ عَلَى الْمُصِحِّ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)\nsaid:","text":"“A\nman with sick camels should not let them graze or drink\nalongside\nhealthy ones.”"}},{"id":107,"idInBook":107,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرٍ، وَمُجَاهِدُ بْنُ مُوسَى، وَمُحَمَّدُ بْنُ خَلَفٍ الْعَسْقَلاَنِيُّ، قَالُوا حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ، حَدَّثَنَا مُفَضَّلُ بْنُ فَضَالَةَ، عَنْ حَبِيبِ بْنِ الشَّهِيدِ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ أَخَذَ بِيَدِ رَجُلٍ مَجْذُومٍ فَأَدْخَلَهَا مَعَهُ فِي الْقَصْعَةِ ثُمَّ قَالَ ‏\n\"‏ كُلْ ثِقَةً بِاللَّهِ وَتَوَكُّلاً عَلَى اللَّهِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Jabir bin ‘Abdullah that the Messenger of Allah\n(ﷺ)\ntook the hand of a leper and made him eat with him, and said:","text":"“Eat,\nwith trust in Allah and reliance upon Allah.”"}},{"id":108,"idInBook":108,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نَافِعٍ، عَنِ ابْنِ أَبِي الزِّنَادِ، ح وَحَدَّثَنَا عَلِيُّ بْنُ أَبِي الْخَصِيبِ، حَدَّثَنَا وَكِيعٌ، عَنْ عَبْدِ اللَّهِ بْنِ سَعِيدِ بْنِ أَبِي هِنْدٍ، جَمِيعًا عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ عُثْمَانَ، عَنْ أُمِّهِ، فَاطِمَةَ بِنْتِ الْحُسَيْنِ عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ لاَ تُدِيمُوا النَّظَرَ إِلَى الْمَجْذُومِينَ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Ibn ‘Abbas that the Prophet (ﷺ) said:","text":"“Do not\nkeep looking at those who have leprosy.”"}},{"id":109,"idInBook":109,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ، حَدَّثَنَا هُشَيْمٌ، عَنْ يَعْلَى بْنِ عَطَاءٍ، عَنْ رَجُلٍ، مِنْ آلِ الشَّرِيدِ يُقَالُ لَهُ عَمْرٌو عَنْ أَبِيهِ قَالَ كَانَ فِي وَفْدِ ثَقِيفٍ رَجُلٌ مَجْذُومٌ فَأَرْسَلَ إِلَيْهِ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏\n\"‏ ارْجِعْ فَقَدْ بَايَعْنَاكَ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from a man from the family of Sharid whose name was\n‘Amr,\nthat his father said:","text":"“There was a leper among the delegation of\nThaqif. The Prophet (ﷺ) sent word to him: ‘Go back, for we have\naccepted your oath of allegiance.’”"}},{"id":110,"idInBook":110,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ سَحَرَ النَّبِيَّ ـ صلى الله عليه وسلم ـ يَهُودِيٌّ مِنْ يَهُودِ بَنِي زُرَيْقٍ يُقَالُ لَهُ لَبِيدُ بْنُ الأَعْصَمِ حَتَّى كَانَ النَّبِيُّ ـ صلى الله عليه وسلم ـ يُخَيَّلُ إِلَيْهِ أَنَّهُ يَفْعَلُ الشَّىْءَ وَلاَ يَفْعَلُهُ ‏.‏ قَالَتْ حَتَّى إِذَا كَانَ ذَاتَ يَوْمٍ أَوْ كَانَ ذَاتَ لَيْلَةٍ دَعَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ثُمَّ دَعَا ثُمَّ دَعَا ثُمَّ قَالَ ‏\"‏ يَا عَائِشَةُ أَشَعَرْتِ أَنَّ اللَّهَ قَدْ أَفْتَانِي فِيمَا اسْتَفْتَيْتُهُ فِيهِ جَاءَنِي رَجُلاَنِ فَجَلَسَ أَحَدُهُمَا عِنْدَ رَأْسِي وَالآخَرُ عِنْدَ رِجْلِي فَقَالَ الَّذِي عِنْدَ رَأْسِي لِلَّذِي عِنْدَ رِجْلِي أَوِ الَّذِي عِنْدَ رِجْلِي لِلَّذِي عِنْدَ رَأْسِي مَا وَجَعُ الرَّجُلِ قَالَ مَطْبُوبٌ ‏.‏ قَالَ مَنْ طَبَّهُ قَالَ لَبِيدُ بْنُ الأَعْصَمِ ‏.‏ قَالَ فِي أَىِّ شَىْءٍ قَالَ فِي مُشْطٍ وَمُشَاطَةٍ وَجُفِّ طَلْعَةِ ذَكَرٍ ‏.‏ قَالَ وَأَيْنَ هُوَ قَالَ فِي بِئْرِ ذِي أَرْوَانَ ‏\"‏ ‏.‏ قَالَتْ فَأَتَاهُ النَّبِيُّ ـ صلى الله عليه وسلم ـ فِي أُنَاسٍ مِنْ أَصْحَابِهِ ثُمَّ جَاءَ فَقَالَ ‏\"‏ وَاللَّهِ يَا عَائِشَةُ لَكَأَنَّ مَاءَهَا نُقَاعَةُ الْحِنَّاءِ وَلَكَأَنَّ نَخْلَهَا رُءُوسُ الشَّيَاطِينِ ‏\"‏ ‏.‏ قَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ أَفَلاَ أَحْرَقْتَهُ قَالَ ‏\"‏ لاَ أَمَّا أَنَا فَقَدْ عَافَانِيَ اللَّهُ وَكَرِهْتُ أَنْ أُثِيرَ عَلَى النَّاسِ مِنْهُ شَرًّا ‏\"‏ ‏.‏ فَأَمَرَ بِهَا فَدُفِنَتْ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Aishah said:","text":"“A Jew from among the Jews of Bani\nZuraiq, whose name was Labid bin A’sam, cast a spell on the Prophet\n(ﷺ), and the Prophet (ﷺ) began to imagine that he had done\nsomething when he had not. One day, or one night, the Messenger of\nAllah (ﷺ) supplicated, and then supplicated again. Then he said: ‘O\n‘Aishah, do you know that Allah has instructed me concerning the\nmatter I asked Him about? Two men came to me, and one of them sat at\nmy head and the other at my feet. The one at my head said to the one at my feet, or the one at my feet said to the one at my head \"what is ailing this man ?\" He\nsaid: “He has been affected by a spell.” He said: “Who cast the\nspell on him?” He said: “Labid bin A’sam.” He said: “With\nwhat?” He said: “With a comb and the hairs stuck to it, and the\nspathe of a male date palm.” He said: “Where is that?” He said:\n“In the well of Dhu Arwan.”\nShe said: “So the Prophet (ﷺ) went to it, with a group of his Companions, then he came and said: ‘By Allah. O ‘Aishah. It was as if its water was infused with henna and its date palms were like the heads of devils.’”\nShe said: “I said: ‘O Messenger of Allah, why don’t you burn them?’ He said: ‘As for me, Allah has healed me, and I do not like to let evil spread among the people.’ Then he issued orders that the well be filled up with earth.”"}},{"id":111,"idInBook":111,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا يَحْيَى بْنُ عُثْمَانَ بْنِ سَعِيدِ بْنِ كَثِيرِ بْنِ دِينَارٍ الْحِمْصِيُّ، حَدَّثَنَا بَقِيَّةُ، حَدَّثَنَا أَبُو بَكْرٍ الْعَنْسِيُّ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، وَمُحَمَّدِ بْنِ يَزِيدَ الْمِصْرِيَّيْنِ، قَالاَ حَدَّثَنَا نَافِعٌ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَتْ أُمُّ سَلَمَةَ يَا رَسُولَ اللَّهِ لاَ يَزَالُ يُصِيبُكَ كُلَّ عَامٍ وَجَعٌ مِنَ الشَّاةِ الْمَسْمُومَةِ الَّتِي أَكَلْتَ ‏.‏ قَالَ ‏\n\"‏ مَا أَصَابَنِي شَىْءٌ مِنْهَا إِلاَّ وَهُوَ مَكْتُوبٌ عَلَىَّ وَآدَمُ فِي طِينَتِهِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Ibn ‘Umar that Umm Salamah said:","text":"“O Messenger of\nAllah, every year you are still suffering pain because of the\npoisoned\nmeat that you ate.” He said: “Nothing that happens to\nme, but it was\ndecreed for me when Adam was still at the stage of\nbeing clay.’”"}},{"id":112,"idInBook":112,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا مُحَمَّدُ بْنُ عَجْلاَنَ، عَنْ يَعْقُوبَ بْنِ عَبْدِ اللَّهِ بْنِ الأَشَجِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ سَعْدِ بْنِ مَالِكٍ، عَنْ خَوْلَةَ بِنْتِ حَكِيمٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ لَوْ أَنَّ أَحَدَكُمْ إِذَا نَزَلَ مَنْزِلاً قَالَ أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّةِ مِنْ شَرِّ مَا خَلَقَ - لَمْ يَضُرَّهُ فِي ذَلِكَ الْمَنْزِلِ شَىْءٌ حَتَّى يَرْتَحِلَ مِنْهُ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Khawlah bint Hakim that the Prophet (ﷺ) said:","text":"“If\nanyone of you, when he stops to camp (while on a journey), says\nA’udhu bi kalimatil-lahit-tammati min sharri ma khalaq (I seek\nrefuge\nin the Perfect Words of Allah from the evil of that which He\nhas\ncreated), then nothing will harm him in that place until he moves\non.”"}},{"id":113,"idInBook":113,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الأَنْصَارِيُّ، حَدَّثَنِي عُيَيْنَةُ بْنُ عَبْدِ الرَّحْمَنِ، حَدَّثَنِي أَبِي، عَنْ عُثْمَانَ بْنِ أَبِي الْعَاصِ، قَالَ لَمَّا اسْتَعْمَلَنِي رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَلَى الطَّائِفِ جَعَلَ يَعْرِضُ لِي شَىْءٌ فِي صَلاَتِي حَتَّى مَا أَدْرِي مَا أُصَلِّي فَلَمَّا رَأَيْتُ ذَلِكَ رَحَلْتُ إِلَى رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ فَقَالَ ‏\"‏ ابْنُ أَبِي الْعَاصِ ‏\"‏ ‏.‏ قُلْتُ نَعَمْ يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\"‏ مَا جَاءَ بِكَ ‏\"‏ ‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ عَرَضَ لِي شَىْءٌ فِي صَلاَتِي حَتَّى مَا أَدْرِي مَا أُصَلِّي ‏.‏ قَالَ ‏\"‏ ذَاكَ الشَّيْطَانُ ادْنُهْ ‏\"‏ ‏.‏ فَدَنَوْتُ مِنْهُ فَجَلَسْتُ عَلَى صُدُورِ قَدَمَىَّ ‏.‏ قَالَ فَضَرَبَ صَدْرِي بِيَدِهِ وَتَفَلَ فِي فَمِي وَقَالَ ‏\"‏ اخْرُجْ عَدُوَّ اللَّهِ ‏\"‏ ‏.‏ فَفَعَلَ ذَلِكَ ثَلاَثَ مَرَّاتٍ ثُمَّ قَالَ ‏\"‏ الْحَقْ بِعَمَلِكَ ‏\"‏ ‏.‏ قَالَ فَقَالَ عُثْمَانُ فَلَعَمْرِي مَا أَحْسِبُهُ خَالَطَنِي بَعْدُ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Uthman bin Abul-‘As said:","text":"“When the Messenger\nof\nAllah (ﷺ) appointed me as governor of Ta’if, I began to get\nconfused during my prayer, until I no longer knew what I was doing.\nWhen I noticed that, I travelled to the Messenger of Allah (ﷺ), and\nhe said: ‘The son of Abul-‘As?’ I said: ‘Yes, O Messenger of\nAllah.’\nHe said: ‘What brings you here?’ He said: ‘O\nMessenger of Allah, I get\nconfused during my prayer, until I do not\nknow what I am doing.’ He\nsaid: ‘That is Satan. Come here.’ So\nI came close to him, and sat upon\nthe front part of my feet then he\nstruck my chest with his hand and\nput some spittle in my mouth and\nsaid: ‘Get out, O enemy of Allah!’ He\ndid that three times, then\nhe said: ‘Get on with your work.’” ‘Uthman\nsaid: “Indeed, I\nnever felt confused (during my prayer) after that.”"}},{"id":114,"idInBook":114,"chapterId":31,"bookId":6,"arabic":"حَدَّثَنَا هَارُونُ بْنُ حَيَّانَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَنْبَأَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، حَدَّثَنَا أَبُو جَنَابٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ أَبِيهِ أَبِي لَيْلَى، قَالَ كُنْتُ جَالِسًا عِنْدَ النَّبِيِّ ـ صلى الله عليه وسلم ـ إِذْ جَاءَهُ أَعْرَابِيٌّ فَقَالَ إِنَّ لِي أَخًا وَجِعًا ‏.‏ قَالَ ‏\"‏ مَا وَجَعُ أَخِيكَ ‏\"‏ ‏.‏ قَالَ بِهِ لَمَمٌ ‏.‏ قَالَ ‏\"‏ اذْهَبْ فَأْتِنِي بِهِ ‏\"‏ ‏.‏ قَالَ فَذَهَبَ فَجَاءَ بِهِ فَأَجْلَسَهُ بَيْنَ يَدَيْهِ فَسَمِعْتُهُ عَوَّذَهُ بِفَاتِحَةِ الْكِتَابِ وَأَرْبَعِ آيَاتٍ مِنْ أَوَّلِ الْبَقَرَةِ وَآيَتَيْنِ مِنْ وَسَطِهَا وَإِلَهُكُمْ إِلَهٌ وَاحِدٌ وَآيَةِ الْكُرْسِيِّ وَثَلاَثِ آيَاتٍ مِنْ خَاتِمَتِهَا وَآيَةٍ مِنْ آلِ عِمْرَانَ - أَحْسِبُهُ قَالَ ‏{شَهِدَ اللَّهُ أَنَّهُ لاَ إِلَهَ إِلاَّ هُوَ}‏ - وَآيَةٍ مِنَ الأَعْرَافِ ‏{إِنَّ رَبَّكُمُ اللَّهُ الَّذِي خَلَقَ}‏ الآيَةَ وَآيَةٍ مِنَ الْمُؤْمِنِينَ ‏{وَمَنْ يَدْعُ مَعَ اللَّهِ إِلهًا آخَرَ لاَ بُرْهَانَ لَهُ بِهِ }‏ وَآيَةٍ مِنَ الْجِنِّ ‏{وَأَنَّهُ تَعَالَى جَدُّ رِبِّنَا مَا اتَّخَذَ صَاحِبَةً وَلاَ وَلَدًا}‏ وَعَشْرِ آيَاتٍ مِنْ أَوَّلِ الصَّافَّاتِ وَثَلاَثِ آيَاتٍ مِنْ آخِرِ الْحَشْرِ وَ ‏{قُلْ هُوَ اللَّهُ أَحَدٌ }‏ وَالْمُعَوِّذَتَيْنِ ‏.‏ فَقَامَ الأَعْرَابِيُّ قَدْ بَرَأَ لَيْسَ بِهِ بَأْسٌ ‏.‏","english":{"narrator":"It was\nnarrated from ‘Abdur-Rahman bin Abi Laila that his father Abu\nLaila\nsaid:","text":"“I was sitting with the Prophet (ﷺ) when a Bedouin came\nto\nhim and said: ‘I have a brother who is sick.’ He said: ‘What is\nthe\nmatter with your brother?’ He said: ‘He suffers from a slight\nmental\nderangement.’ He said: ‘Go and bring him.’” He said:\n“(So he went) and\nhe brought him. He made him sit down in front of\nhim and I heard him\nseeking refuge for him with Fatihatil-Kitab; four\nVerses from the\nbeginning of Al-Baqarah, two Verses from its middle:\n‘And your Ilah\n(God) is One Ilah (God – Allah),’  and\nAyat Al-Kursi; and three\nVerses from its end; a Verse from Al ‘Imran,\nI think it was: ‘Allah\nbears witness that La ilaha illa Huwa (none\nhas the right to be\nworshipped but He),’  a Verse from\nAl-A’raf: ‘Indeed, your Lord\nis Allah,’  a Verse from\nAl-Mu’minun: ‘And whoever invokes (or\nworships), besides Allah,\nany other ilah (god), of whom he has no\nproof,’ a Verse\nfrom Al-Jinn: ‘And He, exalted is the Majesty\nof our Lord,’\n ten Verses from the beginning of As-Saffat; three\nVerses from\nthe end of Al-Hashr; (then) ‘Say: He is Allah, (the) One,’\n and Al-Mu’awwidhatain. Then the Bedouin stood up, healed,\nand\nthere was nothing wrong with him.”"}}],"chapter":{"id":31,"bookId":6,"arabic":"كتاب الطب","english":"Chapters on Medicine"}}