{"metadata":{"length":205,"arabic":{"title":"سنن ابن ماجه","author":"الإمام محمد بن يزيد بن ماجه القزويني","introduction":"كتاب الجنائز"},"english":{"title":"Sunan Ibn Majah","author":"Imam Muhammad ibn Yazid Ibn Majah al-Qazwini","introduction":"Chapters Regarding Funerals"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْحَارِثِ، عَنْ عَلِيٍّ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ لِلْمُسْلِمِ عَلَى الْمُسْلِمِ سِتَّةٌ بِالْمَعْرُوفِ يُسَلِّمُ عَلَيْهِ إِذَا لَقِيَهُ وَيُجِيبُهُ إِذَا دَعَاهُ وَيُشَمِّتُهُ إِذَا عَطَسَ وَيَعُودُهُ إِذَا مَرِضَ وَيَتْبَعُ جِنَازَتَهُ إِذَا مَاتَ وَيُحِبُّ لَهُ مَا يُحِبُّ لِنَفْسِهِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Ali said that the Messenger of Allah (ﷺ)\nsaid:","text":"“The Muslim has six courtesies due from the Muslim: He should\ngreet\nhim with Salam when he meets him; he should accept his\ninvitation if\nhe invites him; he should answer [by Yarhamuk-Allah (may\nAllah have\nmercy on you)] to him if he sneezes (and says Al-\nHamdulillah); he\nshould visit him if he falls sick; he should follow\nhis funeral if he\ndies; and he should love for him what he loves for\nhimself.”"}},{"id":2,"idInBook":2,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بِشْرٍ، بَكْرُ بْنُ خَلَفٍ وَمُحَمَّدُ بْنُ بَشَّارٍ قَالاَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ، عَنْ أَبِيهِ، عَنْ حَكِيمِ بْنِ أَفْلَحَ، عَنْ أَبِي مَسْعُودٍ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ لِلْمُسْلِمِ عَلَى الْمُسْلِمِ أَرْبَعُ خِلاَلٍ يُشَمِّتُهُ إِذَا عَطَسَ وَيُجِيبُهُ إِذَا دَعَاهُ وَيَشْهَدُهُ إِذَا مَاتَ وَيَعُودُهُ إِذَا مَرِضَ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Abu Mas’ud that the Prophet (ﷺ) said:","text":"“The\nMuslim\nhas four things due from the Muslim: He should answer [by\nsaying\nYarhamuk-Allah (may Allah have mercy on you)] to him if he\nsneezes\n(and says Al-Hamdulillah); he should accept his invitation if\nhe\ninvites him; he should attend his funeral if he dies; and he should\nvisit him if he falls sick.”"}},{"id":3,"idInBook":3,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ خَمْسٌ مِنْ حَقِّ الْمُسْلِمِ عَلَى الْمُسْلِمِ رَدُّ التَّحِيَّةِ وَإِجَابَةُ الدَّعْوَةِ وَشُهُودُ الْجِنَازَةِ وَعِيَادَةُ الْمَرِيضِ وَتَشْمِيتُ الْعَاطِسِ إِذَا حَمِدَ اللَّهَ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)\nsaid:","text":"“Five are the rights of the Muslim: Returning his greeting,\naccepting his invitation; attending his funeral; visiting the sick;\nand answering (saying Yarhamuk-Allah) to the one who sneezes, if he\npraises Allah (says Al-Hamdu Lillah).”"}},{"id":4,"idInBook":4,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى الصَّنْعَانِيُّ، حَدَّثَنَا سُفْيَانُ، قَالَ سَمِعْتُ مُحَمَّدَ بْنَ الْمُنْكَدِرِ، يَقُولُ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ عَادَنِي رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ مَاشِيًا وَأَبُو بَكْرٍ وَأَنَا فِي بَنِي سَلِمَةَ ‏.‏","english":{"narrator":"Jabir\nbin ‘Abdullah said:","text":"“The Messenger of Allah (ﷺ) came walking\nto\nvisit me (when I was sick), as did Abu Bakr, when I was with Banu\nSalimah."}},{"id":5,"idInBook":5,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا مَسْلَمَةُ بْنُ عُلَىٍّ، حَدَّثَنَا ابْنُ جُرَيْجٍ، عَنْ حُمَيْدٍ الطَّوِيلِ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كَانَ النَّبِيُّ ـ صلى الله عليه وسلم ـ لاَ يَعُودُ مَرِيضًا إِلاَّ بَعْدَ ثَلاَثٍ ‏.‏","english":{"narrator":"It was\nnarrated that Anas bin Malik said:","text":"“The Prophet (ﷺ) did not\nvisit\nany sick person until after three days.”"}},{"id":6,"idInBook":6,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عُقْبَةُ بْنُ خَالِدٍ السَّكُونِيُّ، عَنْ مُوسَى بْنِ مُحَمَّدِ بْنِ إِبْرَاهِيمَ التَّيْمِيِّ، عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ إِذَا دَخَلْتُمْ عَلَى الْمَرِيضِ فَنَفِّسُوا لَهُ فِي الأَجَلِ فَإِنَّ ذَلِكَ لاَ يَرُدُّ شَيْئًا وَهُوَ يَطِيبُ بِنَفْسِ الْمَرِيضِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Abu Sa’eed Al-Khudri that the Messenger of Allah\n(ﷺ) said:","text":"“When you enter upon one who is sick, cheer him up and\ngive him hope of a long life, for that does not change anything (of\nthe Divine Decree), but it will cheer the heart of the one who is\nsick.”"}},{"id":7,"idInBook":7,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلاَّلُ، حَدَّثَنَا صَفْوَانُ بْنُ هُبَيْرَةَ، حَدَّثَنَا أَبُو مَكِينٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ عَادَ رَجُلاً فَقَالَ ‏\"‏ مَا تَشْتَهِي ‏\"‏ ‏.‏ قَالَ أَشْتَهِي خُبْزَ بُرٍّ ‏.‏ قَالَ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏\"‏ مَنْ كَانَ عِنْدَهُ خُبْزُ بُرٍّ فَلْيَبْعَثْ إِلَى أَخِيهِ ‏\"‏ ثُمَّ قَالَ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏\"‏ إِذَا اشْتَهَى مَرِيضُ أَحَدِكُمْ شَيْئًا فَلْيُطْعِمْهُ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Ibn ‘Abbas that the Prophet (ﷺ) visited a man\nand\nsaid:","text":"“What do you long for?” He said: “I long for wheat\nbread.”\nThe Prophet (ﷺ) said: “Whoever has any wheat bread, let\nhim send it\nto his brother.” Then the Prophet (ﷺ) said: “If any\nsick person\namong you longs for something, then feed him.”"}},{"id":8,"idInBook":8,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ، حَدَّثَنَا أَبُو يَحْيَى الْحِمَّانِيُّ، عَنِ الأَعْمَشِ، عَنْ يَزِيدَ الرَّقَاشِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ دَخَلَ النَّبِيُّ ـ صلى الله عليه وسلم ـ عَلَى مَرِيضٍ يَعُودُهُ فَقَالَ ‏\n\"‏ أَتَشْتَهِي شَيْئًا أَتَشْتَهِي كَعْكًا ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏ فَطَلَبُوا لَهُ ‏.‏","english":{"narrator":"It was\nnarrated that Anas bin Malik said:","text":"“The Prophet (ﷺ) entered\nupon\na sick person to visit him. He said: ‘Do you long for anything?\nDo\nyou long for Ka’k (a type of bread)?’ He said: ‘Yes.’ So they\nsent\nsomeone to bring some Ka’k for him.”"}},{"id":9,"idInBook":9,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا جَعْفَرُ بْنُ مُسَافِرٍ، حَدَّثَنِي كَثِيرُ بْنُ هِشَامٍ، حَدَّثَنَا جَعْفَرُ بْنُ بُرْقَانَ، عَنْ مَيْمُونِ بْنِ مِهْرَانَ، عَنْ عُمَرَ بْنِ الْخَطَّابِ، قَالَ قَالَ لِي النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏\n\"‏ إِذَا دَخَلْتَ عَلَى مَرِيضٍ فَمُرْهُ أَنْ يَدْعُوَ لَكَ فَإِنَّ دُعَاءَهُ كَدُعَاءِ الْمَلاَئِكَةِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Umar bin Al-Khattab said:","text":"“The Prophet (ﷺ)\nsaid\nto me: ‘When you enter upon one who is sick, tell him to pray for\nyou, for his supplication is like the supplication of the angels.’”"}},{"id":10,"idInBook":10,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا الأَعْمَشُ، عَنِ الْحَكَمِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ عَلِيٍّ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\n\"‏ مَنْ أَتَى أَخَاهُ الْمُسْلِمَ عَائِدًا مَشَى فِي خِرَافَةِ الْجَنَّةِ حَتَّى يَجْلِسَ فَإِذَا جَلَسَ غَمَرَتْهُ الرَّحْمَةُ فَإِنْ كَانَ غُدْوَةً صَلَّى عَلَيْهِ سَبْعُونَ أَلْفَ مَلَكٍ حَتَّى يُمْسِيَ وَإِنْ كَانَ مَسَاءً صَلَّى عَلَيْهِ سَبْعُونَ أَلْفَ مَلَكٍ حَتَّى يُصْبِحَ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Ali said:","text":"“I heard the Messenger of Allah (ﷺ)\nsay: ‘Whoever comes to his Muslim brother and visits him (when he\nis\nsick), he is walking among the harvest of Paradise until he sits\ndown,\nand when he sits down he is covered with mercy. If it is\nmorning,\nseventy thousand angels will send blessing upon him until\nevening, and\nif it is evening, seventy thousand angels will send\nblessing upon him\nuntil morning.’”"}},{"id":11,"idInBook":11,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يُوسُفُ بْنُ يَعْقُوبَ، حَدَّثَنَا أَبُو سِنَانٍ الْقَسْمَلِيُّ، عَنْ عُثْمَانَ بْنِ أَبِي سَوْدَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ مَنْ عَادَ مَرِيضًا نَادَى مُنَادٍ مِنَ السَّمَاءِ طِبْتَ وَطَابَ مَمْشَاكَ وَتَبَوَّأْتَ مِنَ الْجَنَّةِ مَنْزِلاً ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)\nsaid:","text":"‘Whoever visits a sick person, a caller calls from heaven: ‘May\nyou be happy, may your walking be blessed, and may you occupy a\ndignified position in Paradise.’”"}},{"id":12,"idInBook":12,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو خَالِدٍ الأَحْمَرُ، عَنْ يَزِيدَ بْنِ كَيْسَانَ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ لَقِّنُوا مَوْتَاكُمْ لاَ إِلَهَ إِلاَّ اللَّهُ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Abu Hurairah that the Messenger of Allah (ﷺ)\nsaid:","text":"‘Urge your dying ones to say La ilaha illallah.”"}},{"id":13,"idInBook":13,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنْ سُلَيْمَانَ بْنِ بِلاَلٍ، عَنْ عُمَارَةَ بْنِ غَزِيَّةَ، عَنْ يَحْيَى بْنِ عُمَارَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ لَقِّنُوا مَوْتَاكُمْ لاَ إِلَهَ إِلاَّ اللَّهُ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Abu Sa’eed Al-Khudri said:","text":"“The Messenger of\nAllah\n(ﷺ) said: ‘Urge your dying ones to say: “La ilaha illallah.”"}},{"id":14,"idInBook":14,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا أَبُو عَامِرٍ، حَدَّثَنَا كَثِيرُ بْنُ زَيْدٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ لَقِّنُوا مَوْتَاكُمْ لاَ إِلَهَ إِلاَّ اللَّهُ الْحَلِيمُ الْكَرِيمُ سُبْحَانَ اللَّهِ رَبِّ الْعَرْشِ الْعَظِيمِ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ كَيْفَ لِلأَحْيَاءِ قَالَ ‏\"‏ أَجْوَدُ وَأَجْوَدُ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Ishaq bin ‘Abdullah bin Ja’far that his father\nsaid:","text":"“The Messenger of Allah (ﷺ) said: ‘Urge your dying ones\nto\nsay: “La ilaha illallahul-Halimul-Karim, Subhan-Allahi\nRabbil-‘Arshil-‘Azim, Al-Hamdu Lillahi Rabbil-‘alamin (None has\nthe\nright to be worshipped but Allah, the Forbearing, the Most Kind.\nGlory\nis to Allah, Lord of the magnificent Throne; praise is to\nAllah, the\nLord of the worlds).’” They said: ‘O Messenger of\nAllah, what about\nthose who are alive?’ He said: ‘Even better,\neven better.’”"}},{"id":15,"idInBook":15,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ شَقِيقٍ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ إِذَا حَضَرْتُمُ الْمَرِيضَ أَوِ الْمَيِّتَ فَقُولُوا خَيْرًا فَإِنَّ الْمَلاَئِكَةَ يُؤَمِّنُونَ عَلَى مَا تَقُولُونَ ‏\"‏ ‏.‏ فَلَمَّا مَاتَ أَبُو سَلَمَةَ أَتَيْتُ النَّبِيَّ ـ صلى الله عليه وسلم ـ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّ أَبَا سَلَمَةَ قَدْ مَاتَ ‏.‏ قَالَ ‏\"‏ قُولِي اللَّهُمَّ اغْفِرْ لِي وَلَهُ وَأَعْقِبْنِي مِنْهُ عُقْبَى حَسَنَةً ‏\"‏ ‏.‏ قَالَتْ فَفَعَلْتُ فَأَعْقَبَنِي اللَّهُ مَنْ هُوَ خَيْرٌ مِنْهُ ‏.‏ مُحَمَّدٌ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏.‏","english":{"narrator":"It was\nnarrated that Umm Salamah said:","text":"“The Messenger of Allah (ﷺ)\nsaid:\n‘When you visit one who is sick or dying, say good things, for\nthe\nangels say: Amin to whatever you say.’ When Abu Salamah died, I\ncame to the Prophet (ﷺ) and said: ‘O Messenger of Allah! Abu\nSalamah\nhas died.’ He said: ‘Say: “Allahummaghfir li wa lahu,\nwa a’qibni minhu\n‘uqba hasanah (O Allah, forgive me and him, and\ncompensate me with\nsomeone better than him).’” She said: ‘I\nsaid that, and Allah\ncompensated me with someone better than him:\nMuhammad the Messenger of\nAllah (ﷺ).’”"}},{"id":16,"idInBook":16,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ الْحَسَنِ بْنِ شَقِيقٍ، عَنِ ابْنِ الْمُبَارَكِ، عَنْ سُلَيْمَانَ التَّيْمِيِّ، عَنْ أَبِي عُثْمَانَ، - وَلَيْسَ بِالنَّهْدِيِّ - عَنْ أَبِيهِ، عَنْ مَعْقِلِ بْنِ يَسَارٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ اقْرَءُوهَا عِنْدَ مَوْتَاكُمْ ‏\"‏ ‏.‏ يَعْنِي ‏{يس}‏ ‏.‏","english":{"narrator":"It was\nnarrated from Ma’qil bin Yasar that the Messenger of Allah\n(ﷺ)\nsaid:","text":"“Recite Qur’an near your dying ones,” meaning Ya-Sin."}},{"id":17,"idInBook":17,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا الْمُحَارِبِيُّ، جَمِيعًا عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنِ الْحَارِثِ بْنِ فُضَيْلٍ، عَنِ الزُّهْرِيِّ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَعْبِ بْنِ مَالِكٍ، عَنْ أَبِيهِ، قَالَ لَمَّا حَضَرَتْ كَعْبًا الْوَفَاةُ أَتَتْهُ أُمُّ بِشْرٍ بِنْتُ الْبَرَاءِ بْنِ مَعْرُورٍ فَقَالَتْ يَا أَبَا عَبْدِ الرَّحْمَنِ إِنْ لَقِيتَ فُلاَنًا فَاقْرَأْ عَلَيْهِ مِنِّي السَّلاَمَ ‏.‏ قَالَ غَفَرَ اللَّهُ لَكِ يَا أُمَّ بِشْرٍ نَحْنُ أَشْغَلُ مِنْ ذَلِكِ ‏.‏ قَالَتْ يَا أَبَا عَبْدِ الرَّحْمَنِ أَمَا سَمِعْتَ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\n\"‏ إِنَّ أَرْوَاحَ الْمُؤْمِنِينَ فِي طَيْرٍ خُضْرٍ تَعْلُقُ فِي شَجَرِ الْجَنَّةِ ‏\"‏ ‏.‏ قَالَ بَلَى ‏.‏ قَالَتْ فَهُوَ ذَاكَ ‏.‏","english":{"narrator":"It was\nnarrated from ‘Abdur-Rahman bin Ka’b bin Malik, about Ka’b:","text":"“When Ka’b was dying, Umm Bishr bint Bara’ bin Ma’rur came to\nhim and\nsaid: ‘O Abu ‘Abdur-Rahman! If you meet so-and-so, convey\nSalam to him\nfrom me.’ He said: ‘May Allah forgive you, O Umm\nBishr! We are too\nbusy to think of that.’ She said: ‘O Abu\n‘Abdur-Rahman! Did you not\nhear the Messenger of Allah (ﷺ) say:\n“The souls of the believers are\nin green birds, eating from the\ntrees of Paradise”?’ He said: ‘Yes.’\nShe said: ‘That is\nwhat I mean.’”"}},{"id":18,"idInBook":18,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ الأَزْهَرِ، حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى، حَدَّثَنَا يُوسُفُ بْنُ الْمَاجِشُونِ، حَدَّثَنَا مُحَمَّدُ بْنُ الْمُنْكَدِرِ، قَالَ دَخَلْتُ عَلَى جَابِرِ بْنِ عَبْدِ اللَّهِ وَهُوَ يَمُوتُ فَقُلْتُ اقْرَأْ عَلَى رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ السَّلاَمَ ‏.‏","english":{"narrator":"Muhammad\nbin Munkadir said:","text":"“I entered upon Jabir bin ‘Abdullah when\nhe\nwas dying, and I said: ‘Convey my Salam to the Messenger of Allah\n(ﷺ).’”"}},{"id":19,"idInBook":19,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا الأَوْزَاعِيُّ، عَنْ عَطَاءٍ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ دَخَلَ عَلَيْهَا وَعِنْدَهَا حَمِيمٌ لَهَا يَخْنُقُهُ الْمَوْتُ فَلَمَّا رَأَى النَّبِيُّ ـ صلى الله عليه وسلم ـ مَا بِهَا قَالَ لَهَا ‏\n\"‏ لاَ تَبْتَئِسِي عَلَى حَمِيمِكِ فَإِنَّ ذَلِكَ مِنْ حَسَنَاتِهِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from ‘Aishah that the Messenger of Allah (ﷺ)\nentered\nupon her and there was a close relative of hers who was in the\nthroes\nof death. When the Prophet (ﷺ) saw how upset she was, he\nsaid:","text":"“Do\nnot grieve for your relative, for that is part of his\nHasanat\n(merits).”"}},{"id":20,"idInBook":20,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا بَكْرُ بْنُ خَلَفٍ أَبُو بِشْرٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنِ الْمُثَنَّى بْنِ سَعِيدٍ، عَنْ قَتَادَةَ، عَنِ ابْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ الْمُؤْمِنُ يَمُوتُ بِعَرَقِ الْجَبِينِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Abu Buraidah from his father that the Prophet\n(ﷺ)\nsaid:","text":"“The believer dies with sweat on his brow.”"}},{"id":21,"idInBook":21,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا رَوْحُ بْنُ الْفَرَجِ، حَدَّثَنَا نَصْرُ بْنُ حَمَّادٍ، حَدَّثَنَا مُوسَى بْنُ كَرْدَمٍ، عَنْ مُحَمَّدِ بْنِ قَيْسٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ سَأَلْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ مَتَى تَنْقَطِعُ مَعْرِفَةُ الْعَبْدِ مِنَ النَّاسِ قَالَ ‏\n\"‏ إِذَا عَايَنَ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Abu Musa said:","text":"“I asked the Messenger of Allah\n(ﷺ):\n‘When does a person stop recognizing people?’ he said: ‘When he\nsees.”"}},{"id":22,"idInBook":22,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَسَدٍ، حَدَّثَنَا مُعَاوِيَةُ بْنُ عَمْرٍو، حَدَّثَنَا أَبُو إِسْحَاقَ الْفَزَارِيُّ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ أَبِي قِلاَبَةَ، عَنْ قَبِيصَةَ بْنِ ذُؤَيْبٍ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ دَخَلَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَلَى أَبِي سَلَمَةَ وَقَدْ شَقَّ بَصَرُهُ فَأَغْمَضَهُ ثُمَّ قَالَ ‏\n\"‏ إِنَّ الرُّوحَ إِذَا قُبِضَ تَبِعَهُ الْبَصَرُ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Umm Salamah said:","text":"“The Messenger of Allah (ﷺ)\nentered upon Abu Salamah (after he had died), and his eyes were wide\nopen. He closed his eyes, then he said: ‘When the soul is taken,\nthe\nsight follows it.’”"}},{"id":23,"idInBook":23,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَبُو دَاوُدَ، سُلَيْمَانُ بْنُ تَوْبَةَ حَدَّثَنَا عَاصِمُ بْنُ عَلِيٍّ، حَدَّثَنَا قَزَعَةُ بْنُ سُوَيْدٍ، عَنْ حُمَيْدٍ الأَعْرَجِ، عَنِ الزُّهْرِيِّ، عَنْ مَحْمُودِ بْنِ لَبِيدٍ، عَنْ شَدَّادِ بْنِ أَوْسٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ إِذَا حَضَرْتُمْ مَوْتَاكُمْ فَأَغْمِضُوا الْبَصَرَ فَإِنَّ الْبَصَرَ يَتْبَعُ الرُّوحَ وَقُولُوا خَيْرًا فَإِنَّ الْمَلاَئِكَةَ تُؤَمِّنُ عَلَى مَا قَالَ أَهْلُ الْبَيْتِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Shaddad bin Aws that the Messenger of Allah\n(ﷺ) said:","text":"“When you come to your dead ones, close their eyes, for\nthe sight\nfollows the soul. And say good things, for the Angels say\nAmin to\nwhat the members of the household say.”"}},{"id":24,"idInBook":24,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ عَاصِمِ بْنِ عُبَيْدِ اللَّهِ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ، قَالَتْ قَبَّلَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عُثْمَانَ بْنَ مَظْعُونٍ وَهُوَ مَيِّتٌ فَكَأَنِّي أَنْظُرُ إِلَى دُمُوعِهِ تَسِيلُ عَلَى خَدَّيْهِ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Aishah said:","text":"“The Messenger of Allah (ﷺ)\nkissed\n‘Uthman bin Maz’un when he had died, and it is as if I can see\nhim with his tears flowing down his cheeks.”"}},{"id":25,"idInBook":25,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ سِنَانٍ، وَالْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ، وَسَهْلُ بْنُ أَبِي سَهْلٍ، قَالُوا حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ سُفْيَانَ، عَنْ مُوسَى بْنِ أَبِي عَائِشَةَ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، وَعَائِشَةَ، أَنَّ أَبَا بَكْرٍ، قَبَّلَ النَّبِيَّ ـ صلى الله عليه وسلم ـ وَهُوَ مَيِّتٌ ‏.‏","english":{"narrator":"","text":"It was\nnarrated from Ibn ‘Abbas and ‘Aishah that Abu Bakr kissed the\nProphet (ﷺ) when he died."}},{"id":26,"idInBook":26,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أُمِّ عَطِيَّةَ، قَالَتْ دَخَلَ عَلَيْنَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ وَنَحْنُ نُغَسِّلُ ابْنَتَهُ أُمَّ كُلْثُومٍ فَقَالَ ‏\"‏ اغْسِلْنَهَا ثَلاَثًا أَوْ خَمْسًا أَوْ أَكْثَرَ مِنْ ذَلِكِ إِنْ رَأَيْتُنَّ ذَلِكِ بِمَاءٍ وَسِدْرٍ وَاجْعَلْنَ فِي الآخِرَةِ كَافُورًا أَوْ شَيْئًا مِنْ كَافُورٍ فَإِذَا فَرَغْتُنَّ فَآذِنَّنِي ‏\"‏ ‏.‏ فَلَمَّا فَرَغْنَا آذَنَّاهُ فَأَلْقَى إِلَيْنَا حَقْوَهُ ‏.‏ وَقَالَ ‏\"‏ أَشْعِرْنَهَا إِيَّاهُ ‏\"‏ ‏.‏","english":{"narrator":"Muhammad\nbin Sirin narrated that Umm ‘Atiyyah said:","text":"“The Messenger of\nAllah (ﷺ) entered upon us when we were washing his daughter Umm\nKulthum. He said: ‘Wash her three or five times, or more than that\nif\nyou think you need to, with water and lote leaves, and put camphor\nor\na little camphor in (the water) for the last washing. When you\nhave\nfinished, call for me.’ When we finished, we called him, and\nhe gave\nhis waist-wrapper to us and said: ‘Shroud her with it.’”"}},{"id":27,"idInBook":27,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ، عَنْ أَيُّوبَ، حَدَّثَتْنِي حَفْصَةُ، عَنْ أُمِّ عَطِيَّةَ، بِمِثْلِ حَدِيثِ مُحَمَّدٍ وَكَانَ فِي حَدِيثِ حَفْصَةَ ‏\"‏ اغْسِلْنَهَا وِتْرًا ‏\"‏ ‏.‏ وَكَانَ فِيهِ ‏\"‏ اغْسِلْنَهَا ثَلاَثًا أَوْ خَمْسًا ‏\"‏ ‏.‏ وَكَانَ فِيهِ ‏\"‏ ابْدَءُوا بِمَيَامِنِهَا وَمَوَاضِعِ الْوُضُوءِ مِنْهَا ‏\"‏ ‏.‏ وَكَانَ فِيهِ أَنَّ أُمَّ عَطِيَّةَ قَالَتْ وَامْشِطْنَهَا ثَلاَثَةَ قُرُونٍ ‏.‏","english":{"narrator":"It was\nnarrated from Ayyub who said:","text":"“Hafsah narrated to me, from Umm\n‘Atiyyah” and it is similar to the Hadith of Muhammad. And in the\nnarration of Hafsah it says: “Wash her an odd number of times.”\nAnd:\n“Wash her face three or five times.” And “Start on her\nright, with the\nplaces washed in ablution.” And it says that Umm\n‘Atiyyah said: “And\nwe combed her hair into three braids.”"}},{"id":28,"idInBook":28,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا بِشْرُ بْنُ آدَمَ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، عَنِ ابْنِ جُرَيْجٍ، عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، عَنْ عَاصِمِ بْنِ ضَمْرَةَ، عَنْ عَلِيٍّ، قَالَ قَالَ لِي النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏\n\"‏ لاَ تُبْرِزْ فَخِذَكَ وَلاَ تَنْظُرْ إِلَى فَخِذِ حَىٍّ وَلاَ مَيِّتٍ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Ali said:","text":"“The Prophet (ﷺ) said to me: ‘Do\nnot\nshow your thigh, and do not look at the thigh of anyone, living or\ndead.’”"}},{"id":29,"idInBook":29,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى الْحِمْصِيُّ، حَدَّثَنَا بَقِيَّةُ بْنُ الْوَلِيدِ، عَنْ مُبَشِّرِ بْنِ عُبَيْدٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ لِيُغَسِّلْ مَوْتَاكُمُ الْمَأْمُونُونَ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from ‘Abdullah bin ‘Umar that the Messenger of Allah\n(ﷺ) said:","text":"‘Let the honest wash your dead.”"}},{"id":30,"idInBook":30,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ الْمُحَارِبِيُّ، حَدَّثَنَا عَبَّادُ بْنُ كَثِيرٍ، عَنْ عَمْرِو بْنِ خَالِدٍ، عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، عَنْ عَاصِمِ بْنِ ضَمْرَةَ، عَنْ عَلِيٍّ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ مَنْ غَسَّلَ مَيِّتًا وَكَفَّنَهُ وَحَنَّطَهُ وَحَمَلَهُ وَصَلَّى عَلَيْهِ وَلَمْ يُفْشِ عَلَيْهِ مَا رَأَى خَرَجَ مِنْ خَطِيئَتِهِ مِثْلَ يَوْمِ وَلَدَتْهُ أُمُّهُ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from ‘Ali that the Messenger of Allah (ﷺ) said:","text":"“Whoever\nwashes a deceased person, shrouds him, embalms him, carries\nhim and\noffers the funeral prayer for him, and does not disclose what\nhe has\nseen, he will emerge from his sins as on the day his mother\nbore\nhim.”"}},{"id":31,"idInBook":31,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي الشَّوَارِبِ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ الْمُخْتَارِ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ مَنْ غَسَّلَ مَيِّتًا فَلْيَغْتَسِلْ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)\nsaid:","text":"“Whoever washes a dead person, let him take a bath.”"}},{"id":32,"idInBook":32,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا أَحْمَدُ بْنُ خَالِدٍ الْوَهْبِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاقَ، عَنْ يَحْيَى بْنِ عَبَّادِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ لَوْ كُنْتُ اسْتَقْبَلْتُ مِنَ الأَمْرِ مَا اسْتَدْبَرْتُ مَا غَسَّلَ النَّبِيَّ ـ صلى الله عليه وسلم ـ غَيْرُ نِسَائِهِ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Aishah said:","text":"“If I had known then what I know\nnow,\nno one would have washed the Prophet (ﷺ) but his wives.”"}},{"id":33,"idInBook":33,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنْ يَعْقُوبَ بْنِ عُتْبَةَ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنْ عَائِشَةَ، قَالَتْ رَجَعَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ مِنَ الْبَقِيعِ فَوَجَدَنِي وَأَنَا أَجِدُ صُدَاعًا فِي رَأْسِي وَأَنَا أَقُولُ وَارَأْسَاهُ فَقَالَ ‏\"‏ بَلْ أَنَا يَا عَائِشَةُ وَارَأْسَاهُ ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ مَا ضَرَّكِ لَوْ مِتِّ قَبْلِي فَقُمْتُ عَلَيْكِ فَغَسَّلْتُكِ وَكَفَّنْتُكِ وَصَلَّيْتُ عَلَيْكِ وَدَفَنْتُكِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Aishah said:","text":"“The Messenger of Allah (ﷺ) came\nback from Al-Baqi’ and I had a headache and was saying: ‘O my\nhead!’\nHe said: ‘Rather, I should say, O my head, O ‘Aishah!’\nThen he said:\n‘It will not matter if you were to die before me, for\nI will take care\nof you, wash you, shroud you, offer the funeral\nprayer for you and\nbury you.’”"}},{"id":34,"idInBook":34,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا سَعِيدُ بْنُ يَحْيَى بْنِ الأَزْهَرِ الْوَاسِطِيُّ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا أَبُو بُرْدَةَ، عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ، عَنِ ابْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، قَالَ لَمَّا أَخَذُوا فِي غُسْلِ النَّبِيِّ ـ صلى الله عليه وسلم ـ نَادَاهُمْ مُنَادٍ مِنَ الدَّاخِلِ لاَ تَنْزِعُوا عَنْ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ قَمِيصَهُ ‏.‏","english":{"narrator":"It was\nnarrated from Abu Buraidah that his father said:","text":"“When they\nstarted\nto wash the Prophet (ﷺ), a voice called out from inside (the\nhouse)\nsaying: ‘Do not remove the shirt of the Messenger of Allah.’”"}},{"id":35,"idInBook":35,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا يَحْيَى بْنُ خِذَامٍ، حَدَّثَنَا صَفْوَانُ بْنُ عِيسَى، أَنْبَأَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ، قَالَ لَمَّا غَسَّلَ النَّبِيَّ ـ صلى الله عليه وسلم ـ ذَهَبَ يَلْتَمِسُ مِنْهُ مَا يَلْتَمِسُ مِنَ الْمَيِّتِ فَلَمْ يَجِدْهُ ‏.‏ فَقَالَ بِأَبِي الطَّيِّبُ طِبْتَ حَيًّا وَطِبْتَ مَيِّتًا ‏.‏","english":{"narrator":"It was\nnarrated that ‘Ali bin Abu Talib said that when he washed the\nMessenger of Allah (ﷺ) he looked for what which is usually looked\nfor on the deceased (i.e., dirt), and he found none. He said:","text":"“May\nmy\nfather be sacrificed for you, you are pure; you were pure in life\nand\nyou are pure in death.”"}},{"id":36,"idInBook":36,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا عَبَّادُ بْنُ يَعْقُوبَ، حَدَّثَنَا الْحُسَيْنُ بْنُ زَيْدِ بْنِ عَلِيِّ بْنِ الْحُسَيْنِ بْنِ عَلِيٍّ، عَنْ إِسْمَاعِيلَ بْنِ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ، عَنْ أَبِيهِ، عَنْ عَلِيٍّ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ إِذَا أَنَا مُتُّ فَاغْسِلْنِي بِسَبْعِ قِرَبٍ مِنْ بِئْرِي بِئْرِ غَرْسٍ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from ‘Ali that the Messenger of Allah (ﷺ) said:","text":"“When\nI die, then wash me with seven buckets from me well, the well of\nGhars.”"}},{"id":37,"idInBook":37,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ كُفِّنَ فِي ثَلاَثَةِ أَثْوَابٍ بِيضٍ يَمَانِيَةٍ لَيْسَ فِيهَا قَمِيصٌ وَلاَ عِمَامَةٌ فَقِيلَ لِعَائِشَةَ إِنَّهُمْ كَانُوا يَزْعُمُونَ أَنَّهُ قَدْ كَانَ كُفِّنَ فِي حِبَرَةٍ ‏.‏ فَقَالَتْ عَائِشَةُ قَدْ جَاءُوا بِبُرْدِ حِبَرَةٍ فَلَمْ يُكَفِّنُوهُ ‏.‏","english":{"narrator":"It was\nnarrated from ‘Aishah that the Prophet (ﷺ) was shrouded in\nthree\nwhite Yemeni cloths, among which there was no shirt and no\nturban. It\nwas said to ‘Aishah:","text":"“They used to claim that he was\nshrouded in\nHibarah.” ‘Aishah said: “They brought a Hibarah Burd, but\nthey\ndid not shroud him in it.”"}},{"id":38,"idInBook":38,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ خَلَفٍ الْعَسْقَلاَنِيُّ، حَدَّثَنَا عَمْرُو بْنُ أَبِي سَلَمَةَ، قَالَ هَذَا مَا سَمِعْتُ مِنْ أَبِي مُعَيْدٍ، حَفْصِ بْنِ غَيْلاَنَ عَنْ سُلَيْمَانَ بْنِ مُوسَى، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، قَالَ كُفِّنَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ فِي ثَلاَثِ رِيَاطٍ بِيضٍ سَحُولِيَّةٍ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Abdullah bin ‘Umar said:","text":"“The Messenger of\nAllah\n(ﷺ) was shrouded in three thin white Suhuli cloths.”"}},{"id":39,"idInBook":39,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ، عَنِ الْحَكَمِ، عَنْ مِقْسَمٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كُفِّنَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ فِي ثَلاَثَةِ أَثْوَابٍ قَمِيصُهُ الَّذِي قُبِضَ فِيهِ وَحُلَّةٌ نَجْرَانِيَّةٌ ‏.‏","english":{"narrator":"It was\nnarrated that Ibn ‘Abbas said:","text":"“The Messenger of Allah (ﷺ)\nwas\nshrouded in three garments: The shirt in which he died, and a\nNajrani\nHullah."}},{"id":40,"idInBook":40,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ رَجَاءٍ الْمَكِّيُّ، عَنْ عَبْدِ اللَّهِ بْنِ عُثْمَانَ بْنِ خُثَيْمٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ خَيْرُ ثِيَابِكُمُ الْبَيَاضُ فَكَفِّنُوا فِيهَا مَوْتَاكُمْ وَالْبَسُوهَا ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Ibn ‘Abbas that the Messenger of Allah (ﷺ)\nsaid:","text":"“The best of your garments are those which are white, so shroud\nyour dead in them, and wear them.”"}},{"id":41,"idInBook":41,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا يُونُسُ بْنُ عَبْدِ الأَعْلَى، حَدَّثَنَا ابْنُ وَهْبٍ، أَنْبَأَنَا هِشَامُ بْنُ سَعْدٍ، عَنْ حَاتِمِ بْنِ أَبِي نَصْرٍ، عَنْ عُبَادَةَ بْنِ نُسَىٍّ، عَنْ أَبِيهِ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ خَيْرُ الْكَفَنِ الْحُلَّةُ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from ‘Ubadah bin Samit that the Messenger of Allah\n(ﷺ)\nsaid:","text":"“The best of shrouds is the Hullah (two-piecer).”"}},{"id":42,"idInBook":42,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عُمَرُ بْنُ يُونُسَ، حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ، عَنْ هِشَامِ بْنِ حَسَّانٍ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي قَتَادَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ إِذَا وَلِيَ أَحَدُكُمْ أَخَاهُ فَلْيُحْسِنْ كَفَنَهُ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Abu Qatadah that the Messenger of Allah (ﷺ)\nsaid:","text":"“If\nanyone of you is charged with taking care of his brother\n(after\ndeath), let him shroud him well.”"}},{"id":43,"idInBook":43,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ بْنِ سَمُرَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ الْحَسَنِ، حَدَّثَنَا أَبُو شَيْبَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ لَمَّا قُبِضَ إِبْرَاهِيمُ ابْنُ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ لَهُمُ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏\n\"‏ لاَ تُدْرِجُوهُ فِي أَكْفَانِهِ حَتَّى أَنْظُرَ إِلَيْهِ ‏\"‏ ‏.‏ فَأَتَاهُ فَانْكَبَّ عَلَيْهِ وَبَكَى ‏.‏","english":{"narrator":"It was\nnarrated that Anas bin Malik said:","text":"“When Ibrahim the son of\nthe\nProphet (ﷺ) died, the Prophet (ﷺ) said to them: ‘Do not wrap\nhim in his shroud until I look at him.’ He came to him, bent over\nand\nwept.”"}},{"id":44,"idInBook":44,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، عَنْ حَبِيبِ بْنِ سُلَيْمٍ، عَنْ بِلاَلِ بْنِ يَحْيَى، قَالَ كَانَ حُذَيْفَةُ إِذَا مَاتَ لَهُ الْمَيِّتُ قَالَ لاَ تُؤْذِنُوا بِهِ أَحَدًا إِنِّي أَخَافُ أَنْ يَكُونَ نَعْيًا إِنِّي سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ بِأُذُنَىَّ هَاتَيْنِ يَنْهَى عَنِ النَّعْىِ ‏.‏","english":{"narrator":"It was\nnarrated that Bilal bin Yahya said:","text":"“If one of the members of\nhis\nfamily died, Hudhaifah would say: ‘Do not inform anyone of it, for\nI am afraid that that would be a public death announcement. I heard\nthe Messenger of Allah (ﷺ) with these two ears of mine forbidding\nmaking public death announcements.’”"}},{"id":45,"idInBook":45,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَهِشَامُ بْنُ عَمَّارٍ، قَالاَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ أَسْرِعُوا بِالْجِنَازَةِ فَإِنْ تَكُنْ صَالِحَةً فَخَيْرٌ تُقَدِّمُونَهَا إِلَيْهِ وَإِنْ تَكُنْ غَيْرَ ذَلِكَ فَشَرٌّ تَضَعُونَهُ عَنْ رِقَابِكُمْ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)\nsaid:","text":"‘Hasten with the funeral (procession), for if the person was\nrighteous then you are advancing him towards good, and if he was\notherwise then it is evil which you are taking off of your necks.”"}},{"id":46,"idInBook":46,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ مَنْصُورٍ، عَنْ عُبَيْدِ بْنِ نِسْطَاسٍ، عَنْ أَبِي عُبَيْدَةَ، قَالَ قَالَ عَبْدُ اللَّهِ بْنُ مَسْعُودٍ مَنِ اتَّبَعَ جِنَازَةً فَلْيَحْمِلْ بِجِوَانِبِ السَّرِيرِ كُلِّهَا فَإِنَّهُ مِنَ السُّنَّةِ ثُمَّ إِنْ شَاءَ فَلْيَتَطَوَّعْ وَإِنْ شَاءَ فَلْيَدَعْ ‏.‏","english":{"narrator":"It was\nnarrated that Abu ‘Ubaidah said:","text":"“ ‘Abdullah bin Mas’ud said:\n‘Whoever follows a funeral (procession), let him carry all (four)\ncorners of it (in turn), for that is Sunnah. Then if he wishes let\nhim\nvoluntarily carry it, and if he wishes let him not do so.’”"}},{"id":47,"idInBook":47,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدِ بْنِ عَقِيلٍ، حَدَّثَنَا بِشْرُ بْنُ ثَابِتٍ، حَدَّثَنَا شُعْبَةُ، عَنْ لَيْثٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ أَنَّهُ رَأَى جِنَازَةً يُسْرِعُونَ بِهَا قَالَ ‏\n\"‏ لِتَكُنْ عَلَيْكُمُ السَّكِينَةُ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Abu Musa that the Prophet (ﷺ) saw a funeral\n(procession) with which the people were rushing. He said:","text":"“You\nshould\nmove with tranquility.”"}},{"id":48,"idInBook":48,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا كَثِيرُ بْنُ عُبَيْدٍ الْحِمْصِيُّ، حَدَّثَنَا بَقِيَّةُ بْنُ الْوَلِيدِ، عَنْ أَبِي بَكْرِ بْنِ أَبِي مَرْيَمَ، عَنْ رَاشِدِ بْنِ سَعْدٍ، عَنْ ثَوْبَانَ، مَوْلَى رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ رَأَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ نَاسًا رُكْبَانًا عَلَى دَوَابِّهِمْ فِي جِنَازَةٍ فَقَالَ ‏\n\"‏ أَلاَ تَسْتَحْيُونَ أَنَّ مَلاَئِكَةَ اللَّهِ يَمْشُونَ عَلَى أَقْدَامِهِمْ وَأَنْتُمْ رُكْبَانٌ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Thawban, the freed slave of the Messenger of\nAllah\n(ﷺ), said:","text":"“The Messenger of Allah (ﷺ) saw some people\nriding\non their animals in a funeral (procession). He said: ‘Do you\nnot\nfeel ashamed that the angels of Allah are walking on foot and you\nare\nriding?’”"}},{"id":49,"idInBook":49,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا سَعِيدُ بْنُ عُبَيْدِ اللَّهِ بْنِ جُبَيْرِ بْنِ حَيَّةَ، حَدَّثَنِي زِيَادُ بْنُ جُبَيْرِ بْنِ حَيَّةَ، سَمِعَ الْمُغِيرَةَ بْنَ شُعْبَةَ، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\n\"‏ الرَّاكِبُ خَلْفَ الْجِنَازَةِ وَالْمَاشِي مِنْهَا حَيْثُ شَاءَ ‏\"‏ ‏.‏","english":{"narrator":"Al-Mughirah bin Shu’bah said:","text":"“I heard the Messenger of Allah\n(ﷺ)\nsay: ‘The rider should travel behind the funeral (procession)\nbut the\none who is walking may walk wherever he wants.”"}},{"id":50,"idInBook":50,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، وَهِشَامُ بْنُ عَمَّارٍ، وَسَهْلُ بْنُ أَبِي سَهْلٍ، قَالُوا حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، قَالَ رَأَيْتُ النَّبِيَّ ـ صلى الله عليه وسلم ـ وَأَبَا بَكْرٍ وَعُمَرَ يَمْشُونَ أَمَامَ الْجِنَازَةِ ‏.‏","english":{"narrator":"It was\nnarrated from Salim that his father said:","text":"“I saw the Prophet\n(ﷺ),\nAbu Bakr and ‘Umar walking ahead of the funeral (procession).”"}},{"id":51,"idInBook":51,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، وَهَارُونُ بْنُ عَبْدِ اللَّهِ الْحَمَّالُ، قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ الْبُرْسَانِيُّ، أَنْبَأَنَا يُونُسُ بْنُ يَزِيدَ الأَيْلِيُّ، عَنِ الزُّهْرِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كَانَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ وَأَبُو بَكْرٍ وَ عُمَرُ وَعُثْمَانُ يَمْشُونَ أَمَامَ الْجِنَازَةِ ‏.‏","english":{"narrator":"It was\nnarrated that Anas bin Malik said:","text":"“The Messenger of Allah\n(ﷺ),\nAbu Bakr, ‘Umar and ‘Uthman used to walk ahead of the funeral\n(procession).”"}},{"id":52,"idInBook":52,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ، أَنْبَأَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، عَنْ يَحْيَى بْنِ عَبْدِ اللَّهِ التَّيْمِيِّ، عَنْ أَبِي مَاجِدَةَ الْحَنَفِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ الْجِنَازَةُ مَتْبُوعَةٌ وَلَيْسَتْ بِتَابِعَةٍ لَيْسَ مِنْهَا مَنْ تَقَدَّمَهَا ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from ‘Abdullah bin Mas’ud that the Messenger of Allah\n(ﷺ) said:","text":"‘The funeral should be followed and should not follow.\nThere should be no one with it who walks ahead of it.”"}},{"id":53,"idInBook":53,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ، أَخْبَرَنِي عَمْرُو بْنُ النُّعْمَانِ، حَدَّثَنَا عَلِيُّ بْنُ الْحَزَوَّرِ، عَنْ نُفَيْعٍ، عَنْ عِمْرَانَ بْنِ الْحُصَيْنِ، وَأَبِي، بَرْزَةَ قَالاَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ فِي جِنَازَةٍ فَرَأَى قَوْمًا قَدْ طَرَحُوا أَرْدِيَتَهُمْ يَمْشُونَ فِي قُمُصٍ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ أَبِفِعْلِ الْجَاهِلِيَّةِ تَأْخُذُونَ - أَوْ بِصُنْعِ الْجَاهِلِيَّةِ تَشَبَّهُونَ - لَقَدْ هَمَمْتُ أَنْ أَدْعُوَ عَلَيْكُمْ دَعْوَةً تَرْجِعُونَ فِي غَيْرِ صُوَرِكُمْ ‏\"‏ ‏.‏ قَالَ فَأَخَذُوا أَرْدِيَتَهُمْ وَلَمْ يَعُودُوا لِذَلِكَ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Imran bin Husain and Abu Barzah said:","text":"“We went\nout\nwith the Messenger of Allah (ﷺ) to attend a funeral, and he saw\nsome people who had cast aside their upper sheets and were walking in\ntheir shirts only. The Messenger of Allah (ﷺ) said: ‘Are you\nadopting the practice of the days of ignorance?’ or; ‘Are you\nimitating the behavior of the days of ignorance? I was about to\nsupplicate against you that you would return in a different form.’\nSo\nthey put their sheets back on and never did that again.”"}},{"id":54,"idInBook":54,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي سَعِيدُ بْنُ عَبْدِ اللَّهِ الْجُهَنِيُّ، أَنَّ مُحَمَّدَ بْنَ عُمَرَ بْنِ عَلِيِّ بْنِ أَبِي طَالِبٍ، حَدَّثَهُ عَنْ أَبِيهِ، عَنْ جَدِّهِ، عَلِيِّ بْنِ أَبِي طَالِبٍ أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ لاَ تُؤَخِّرُوا الْجِنَازَةَ إِذَا حَضَرَتْ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from ‘Ali bin Abu Talib that the Messenger of Allah\n(ﷺ)\nsaid:","text":"“Do not delay the funeral once it is ready.”"}},{"id":55,"idInBook":55,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى الصَّنْعَانِيُّ، أَنْبَأَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ، قَالَ قَرَأْتُ عَلَى الْفُضَيْلِ بْنِ مَيْسَرَةَ عَنْ أَبِي حَرِيزٍ، أَنَّ أَبَا بُرْدَةَ، حَدَّثَهُ قَالَ أَوْصَى أَبُو مُوسَى الأَشْعَرِيُّ حِينَ حَضَرَهُ الْمَوْتُ فَقَالَ لاَ تُتْبِعُونِي بِمِجْمَرٍ ‏.‏ قَالُوا لَهُ أَوَ سَمِعْتَ فِيهِ شَيْئًا قَالَ نَعَمْ مِنْ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ ‏.‏","english":{"narrator":"It was\nnarrated from Abu Hariz that Abu Burdah said:","text":"“Abu Musa\nAsh’ari\nleft instructions, when he was dying, saying: ‘Do not follow\nme\nwith a censer.’* They said to him: ‘Did you hear something\nconcerning that?’ He said: ‘Yes, from the Messenger of Allah\n(ﷺ).’”"}},{"id":56,"idInBook":56,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عُبَيْدُ اللَّهِ، أَنْبَأَنَا شَيْبَانُ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ مَنْ صَلَّى عَلَيْهِ مِائَةٌ مِنَ الْمُسْلِمِينَ غُفِرَ لَهُ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Abu Hurairah that the Prophet (ﷺ) said:","text":"“Whoever\nhas the funeral prayer offered for him by one hundred\nMuslims, he\nwill be forgiven.”"}},{"id":57,"idInBook":57,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ الْحِزَامِيُّ، حَدَّثَنَا بَكْرُ بْنُ سُلَيْمٍ، حَدَّثَنِي حُمَيْدُ بْنُ زِيَادٍ الْخَرَّاطُ، عَنْ كُرَيْبٍ، مَوْلَى عَبْدِ اللَّهِ بْنِ عَبَّاسٍ قَالَ هَلَكَ ابْنٌ لِعَبْدِ اللَّهِ بْنِ عَبَّاسٍ فَقَالَ لِي يَا كُرَيْبُ قُمْ فَانْظُرْ هَلِ اجْتَمَعَ لاِبْنِي أَحَدٌ فَقُلْتُ نَعَمْ ‏.‏ فَقَالَ وَيْحَكَ كَمْ تَرَاهُمْ؟ أَرْبَعِينَ؟ قُلْتُ: لاَ. بَلْ هُمْ أَكْثَرُ ‏.‏ قَالَ: فَاخْرُجُوا بِابْنِي فَأَشْهَدُ لَسَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\n\"‏ مَا مِنْ أَرْبَعِينَ مِنْ مُؤْمِنٍ يَشْفَعُونَ لِمُؤْمِنٍ إِلاَّ شَفَّعَهُمُ اللَّهُ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Kuraib the freed slave of ‘Abdullah bin ‘Abbas\nsaid:","text":"“A son of ‘Abdullah bin ‘Abbas died, and he said to me:\n‘O\nKuraib! Get up and see if anyone has assembled (to pray) for my\nson.’\nI said: ‘Yes.’ He said: ‘Woe to you, how many do you\nsee? Forty?’ I\nsaid: ‘No, rather there are more.’ He said:\n‘Take my son out, for I\nbear witness that I hear the Messenger of\nAllah (ﷺ) say: “No (group\nof) forty believers intercede for a\nbeliever, but Allah will accept\ntheir intercession.”"}},{"id":58,"idInBook":58,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ مَرْثَدِ بْنِ عَبْدِ اللَّهِ الْيَزَنِيِّ، عَنْ مَالِكِ بْنِ هُبَيْرَةَ الشَّامِيِّ، - وَكَانَتْ لَهُ صُحْبَةٌ - قَالَ كَانَ إِذَا أُتِيَ بِجِنَازَةٍ فَتَقَالَّ مَنْ تَبِعَهَا جَزَّأَهُمْ ثَلاَثَةَ صُفُوفٍ ثُمَّ صَلَّى عَلَيْهَا وَقَالَ إِنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ مَا صَفَّ صُفُوفٌ ثَلاَثَةٌ مِنَ الْمُسْلِمِينَ عَلَى مَيِّتٍ إِلاَّ أَوْجَبَ ‏\"‏ ‏.‏","english":{"narrator":"Malik\nbin Hubairah Ash-Shami, who was a Companion of the Prophet\n(ﷺ),\nsaid:","text":"“If a funeral procession was brought and the number of\npeople\nwho followed it was considered to be small, they would be\norganized\ninto three rows, then the funeral prayer would be offered.”\nHe\nsaid: “The Messenger of Allah (ﷺ) said: ‘No three rows of\nMuslims\noffer the funeral prayer for one who has died, but he will be\nguaranteed (Paradise).’”"}},{"id":59,"idInBook":59,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ ثَابِتٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ مُرَّ عَلَى النَّبِيِّ ـ صلى الله عليه وسلم ـ بِجِنَازَةٍ فَأُثْنِيَ عَلَيْهَا خَيْرًا فَقَالَ ‏\"‏ وَجَبَتْ ‏\"‏ ‏.‏ ثُمَّ مُرَّ عَلَيْهِ بِجِنَازَةٍ فَأُثْنِيَ عَلَيْهَا شَرًّا فَقَالَ ‏\"‏ وَجَبَتْ ‏\"‏ ‏.‏ فَقِيلَ يَا رَسُولَ اللَّهِ قُلْتَ لِهَذِهِ وَجَبَتْ وَلِهَذِهِ وَجَبَتْ فَقَالَ ‏\"‏ شَهَادَةُ الْقَوْمِ وَالْمُؤْمِنُونَ شُهُودُ اللَّهِ فِي الأَرْضِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Anas bin Malik said:","text":"“A funeral (procession)\npassed\nby the Prophet (ﷺ) and they praised (the deceased) and spoke\nwell\nof him. He said: ‘(Paradise is) guaranteed for him.’ Then another\nfuneral passed by and they spoke badly of him, and he (the Prophet\n(ﷺ)) said: ‘(Hell is) guaranteed for him.’ It was said: ‘O\nMessenger\nof Allah, you said that (Paradise was) guaranteed for this\none and\nthat (Hell was) guaranteed for the other one.’ He said: ‘It\nis the\ntestimony of the people, and the believers are the witnesses\nof Allah\non earth.’”"}},{"id":60,"idInBook":60,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ مُرَّ عَلَى النَّبِيِّ ـ صلى الله عليه وسلم ـ بِجِنَازَةٍ - فَأُثْنِيَ عَلَيْهَا خَيْرًا فِي مَنَاقِبِ الْخَيْرِ فَقَالَ ‏\"‏ وَجَبَتْ ‏\"‏ ‏.‏ ثُمَّ مَرُّوا عَلَيْهِ بِأُخْرَى فَأُثْنِيَ عَلَيْهَا شَرًّا فِي مَنَاقِبِ الشَّرِّ فَقَالَ ‏\"‏ وَجَبَتْ إِنَّكُمْ شُهَدَاءُ اللَّهِ فِي الأَرْضِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Abu Hurairah said:","text":"“A funeral passed by the\nProphet\n(ﷺ) and they praised (the deceased) and spoke well of him\nand\nmentioned his good characteristics. He said: ‘(Paradise is)\nguaranteed for him.’ Then another funeral passed by and they spoke\nbadly of him and mentioned his bad characteristics, and he the\nProphet (ﷺ) said: ‘(Hell is) guaranteed for him. You are the\nwitnesses of Allah on earth.’”"}},{"id":61,"idInBook":61,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا أَبُو أُسَامَةَ، قَالَ الْحُسَيْنُ بْنُ ذَكْوَانَ أَخْبَرَنِي عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ الأَسْلَمِيِّ، عَنْ سَمُرَةَ بْنِ جُنْدُبٍ الْفَزَارِيِّ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ صَلَّى عَلَى امْرَأَةٍ مَاتَتْ فِي نِفَاسِهَا فَقَامَ وَسَطَهَا ‏.‏","english":{"narrator":"","text":"It was\nnarrated from Samurah bin Jundab Al-Fazari that the Messenger\nof\nAllah (ﷺ) offered the funeral prayer for a woman who had died in\nnifas* and he stood level with her middle (i.e. her waist).” \n \n\n*The postnatal bleeding period."}},{"id":62,"idInBook":62,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، حَدَّثَنَا سَعِيدُ بْنُ عَامِرٍ، عَنْ هَمَّامٍ، عَنْ أَبِي غَالِبٍ، قَالَ رَأَيْتُ أَنَسَ بْنَ مَالِكٍ صَلَّى عَلَى جِنَازَةِ رَجُلٍ فَقَامَ حِيَالَ رَأْسِهِ فَجِيءَ بِجِنَازَةٍ أُخْرَى بِامْرَأَةٍ فَقَالُوا يَا أَبَا حَمْزَةَ صَلِّ عَلَيْهَا ‏.‏ فَقَامَ حِيَالَ وَسَطِ السَّرِيرِ فَقَالَ لَهُ الْعَلاَءُ بْنُ زِيَادٍ يَا أَبَا حَمْزَةَ هَكَذَا رَأَيْتَ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَامَ مِنَ الْجِنَازَةِ مُقَامَكَ مِنَ الرَّجُلِ وَقَامَ مِنَ الْمَرْأَةِ مُقَامَكَ مِنَ الْمَرْأَةِ قَالَ نَعَمْ ‏.‏ فَأَقْبَلَ عَلَيْنَا فَقَالَ احْفَظُوا ‏.‏","english":{"narrator":"It was\nnarrated that Abu Ghalib said:","text":"“I saw Anas bin Malik offering\nthe\nfuneral prayer for a man, and he stood level with his head. Then\nanother funeral was brought, that of a woman, and they said: ‘O Abu\nHamzah! Offer the funeral prayer for her.’ So he stood level with\nthe\nmiddle of the bed (the body was upon). ‘Ala’ bin Ziyad said\nto him: ‘O\nAbu Hamzah! Is this how you saw the Messenger of Allah\n(ﷺ) standing\nin relation to the body of a man and a woman as you\nhave stood?’ He\nsaid: ‘Yes.’ Then he turned to us and said:\n‘Remember this.’”"}},{"id":63,"idInBook":63,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ عُثْمَانَ، عَنِ الْحَكَمِ، عَنْ مِقْسَمٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَرَأَ عَلَى الْجِنَازَةِ بِفَاتِحَةِ الْكِتَابِ ‏.‏","english":{"narrator":"","text":"It was\nnarrated from Ibn ‘Abbas that the Prophet (ﷺ) recited the\nOpening\nof the Book (Al-Fatihah) in the funeral prayer."}},{"id":64,"idInBook":64,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا عَمْرُو بْنُ أَبِي عَاصِمٍ النَّبِيلُ، وَإِبْرَاهِيمُ بْنُ الْمُسْتَمِرِّ، قَالاَ حَدَّثَنَا أَبُو عَاصِمٍ، حَدَّثَنَا حَمَّادُ بْنُ جَعْفَرٍ الْعَبْدِيُّ، حَدَّثَنِي شَهْرُ بْنُ حَوْشَبٍ، حَدَّثَتْنِي أُمُّ شَرِيكٍ الأَنْصَارِيَّةُ، قَالَتْ أَمَرَنَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ أَنْ نَقْرَأَ عَلَى الْجِنَازَةِ بِفَاتِحَةِ الْكِتَابِ ‏.‏","english":{"narrator":"Umm\nSharik Al-Ansari said:","text":"“The Messenger of Allah (ﷺ) commanded us\nto recite the Opening of the Book (Al-Fatihah) in the funeral\nprayer.”"}},{"id":65,"idInBook":65,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَبُو عُبَيْدٍ، مُحَمَّدُ بْنُ عُبَيْدِ بْنِ مَيْمُونٍ الْمَدِينِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ الْحَرَّانِيُّ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ الْحَارِثِ التَّيْمِيِّ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\n\"‏ إِذَا صَلَّيْتُمْ عَلَى الْمَيِّتِ فَأَخْلِصُوا لَهُ الدُّعَاءَ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Abu Hurairah said:","text":"“I heard the Messenger of\nAllah\n(ﷺ) say: ‘When you offer the prayer for the deceased,\nsupplicate\nsincerely for him.’”"}},{"id":66,"idInBook":66,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ كَانَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ إِذَا صَلَّى عَلَى جِنَازَةٍ يَقُولُ ‏\n\"‏ اللَّهُمَّ اغْفِرْ لِحَيِّنَا وَمَيِّتِنَا وَشَاهِدِنَا وَغَائِبِنَا وَصَغِيرِنَا وَكَبِيرِنَا وَذَكَرِنَا وَأُنْثَانَا اللَّهُمَّ مَنْ أَحْيَيْتَهُ مِنَّا فَأَحْيِهِ عَلَى الإِسْلاَمِ وَمَنْ تَوَفَّيْتَهُ مِنَّا فَتَوَفَّهُ عَلَى الإِيمَانِ اللَّهُمَّ لاَ تَحْرِمْنَا أَجْرَهُ وَلاَ تُضِلَّنَا بَعْدَهُ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Abu Hurairah said:","text":"“When the Messenger of Allah\n(ﷺ)\noffered the funeral prayer he would say: ‘Allahummaghfir\nlihayyina\nwa mayyitina, wa shahidina wa gha’ibina, wa saghirina wa\nkabirina,\nwa dhakarina wa unthana. Allahumma man ahyaitahu minna\nfa'ahyihi\n‘alal-Islam, wa man tawaffaytahu minna fa tawaffahu ‘alal-\niman.\nAllahumma la tahrimna ajrahu wa la tudillana ba’dah. [O Allah,\nforgive our living and our dead, those who are present and those who\nare absent, our young and our old, our males and our females. O\nAllah,\nwhomever of us You cause to live, let him live in Islam, and\nwhomever\nof us You cause to die, let him die in (a state of) faith. O\nAllah, do\nnot deprive us of his reward, and do not let us go astray\nafter\nhim].’”"}},{"id":67,"idInBook":67,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا مَرْوَانُ بْنُ جَنَاحٍ، حَدَّثَنِي يُونُسُ بْنُ مَيْسَرَةَ بْنِ حَلْبَسٍ، عَنْ وَاثِلَةَ بْنِ الأَسْقَعِ، قَالَ: صَلَّى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَلَى رَجُلٍ مِنَ الْمُسْلِمِينَ فَأَسْمَعُهُ يَقُولُ ‏\n\"‏ اللَّهُمَّ إِنَّ فُلاَنَ بْنَ فُلاَنٍ فِي ذِمَّتِكَ وَحَبْلِ جِوَارِكَ فَقِهِ مِنْ فِتْنَةِ الْقَبْرِ وَعَذَابِ النَّارِ وَأَنْتَ أَهْلُ الْوَفَاءِ وَالْحَقِّ فَاغْفِرْ لَهُ وَارْحَمْهُ إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Wathilah bin Asqa’ said:","text":"“The Messenger of Allah\n(ﷺ) offered the funeral prayer for a man among the Muslims and I\nheard him say: ‘O Allah, so-and-so the son of so-and-so is in Your\ncase and under Your protection. Protect him from the trial of the\ngrave and the torment of the Fire, for You are the One Who keeps the\npromise and You are the Truth. Forgive him and have mercy on him, for\nYou are the Oft-Forgiving, Most Merciful.”"}},{"id":68,"idInBook":68,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ، حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ، حَدَّثَنَا فَرَجُ بْنُ الْفَضَالَةِ، حَدَّثَنِي عِصْمَةُ بْنُ رَاشِدٍ، عَنْ حَبِيبِ بْنِ عُبَيْدٍ، عَنْ عَوْفِ بْنِ مَالِكٍ، قَالَ شَهِدْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ صَلَّى عَلَى رَجُلٍ مِنَ الأَنْصَارِ فَسَمِعْتُهُ يَقُولُ ‏\n\"‏ اللَّهُمَّ صَلِّ عَلَيْهِ وَاغْفِرْ لَهُ وَارْحَمْهُ وَعَافِهِ وَاعْفُ عَنْهُ وَاغْسِلْهُ بِمَاءٍ وَثَلْجٍ وَبَرَدٍ وَنَقِّهِ مِنَ الذُّنُوبِ وَالْخَطَايَا كَمَا يُنَقَّى الثَّوْبُ الأَبْيَضُ مِنَ الدَّنَسِ وَأَبْدِلْهُ بِدَارِهِ دَارًا خَيْرًا مِنْ دَارِهِ وَأَهْلاً خَيْرًا مِنْ أَهْلِهِ وَقِهِ فِتْنَةَ الْقَبْرِ وَعَذَابَ النَّارِ ‏\"‏ ‏.‏ قَالَ عَوْفٌ فَلَقَدْ رَأَيْتُنِي فِي مُقَامِي ذَلِكَ أَتَمَنَّى أَنْ أَكُونَ مَكَانَ ذَلِكَ الرَّجُلِ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Awf bin Malik said:","text":"“I saw the Messenger of\nAllah\n(ﷺ) offering the funeral prayer for a man among the Ansar, and\nI\nheard him say: ‘Allahumma salli ‘alayhi waghfirlahu warhamhu, wa\n‘afihi wa’fu ‘anhu, waghsilhu bi ma’in wa thaljin wa baradin,\nwa\nnaqqihi min adh-dhunubi wal-khataya kama yunaqqath-thawbul-abyadu\nminad-danas, wa abdilhu bi darihi daran khayran min darihi, wa ahlan\nkhayran min ahlili, wa qihi fitnatal-qabri wa ‘adhaban-nar. (O\nAllah,\nsend blessing upon him, forgive him, have mercy on him, keep\nhim safe\nand sound, and pardon him; wash him with water and snow and\nhail, and\ncleanse him of sins just as a white garment is cleansed of\ndirt. Give\nhim in exchange for his house that is better than his\nhouse, and  a\nfamily that is better than his family. Protect him from\nthe trial of\nthe grave and the torment of the Fire).’”"}},{"id":69,"idInBook":69,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، عَنْ حَجَّاجٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ مَا أَبَاحَ لَنَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ وَلاَ أَبُو بَكْرٍ وَلاَ عُمَرُ فِي شَىْءٍ مَا أَبَاحُوا فِي الصَّلاَةِ عَلَى الْمَيِّتِ ‏.‏ يَعْنِي لَمْ يُوَقِّتْ ‏.‏","english":{"narrator":"It was\nnarrated that Jabir said:","text":"“The Messenger of Allah (ﷺ), Abu\nBakr\nand ‘Umar did not give us so much leeway in anything as they did\nwith regard to the prayer for the deceased,” meaning that there was\nnothing affixed."}},{"id":70,"idInBook":70,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ، حَدَّثَنَا الْمُغِيرَةُ بْنُ عَبْدِ الرَّحْمَنِ، حَدَّثَنَا خَالِدُ بْنُ إِلْيَاسَ، عَنْ إِسْمَاعِيلَ بْنِ عَمْرِو بْنِ سَعِيدِ بْنِ الْعَاصِ، عَنْ عُثْمَانَ بْنِ عَبْدِ اللَّهِ بْنِ الْحَكَمِ بْنِ الْحَارِثِ، عَنْ عُثْمَانَ بْنِ عَفَّانَ، ‏.‏ أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ صَلَّى عَلَى عُثْمَانَ بْنِ مَظْعُونٍ وَكَبَّرَ عَلَيْهِ أَرْبَعًا ‏.‏","english":{"narrator":"","text":"It was\nnarrated from ‘Uthman bin ‘Affan that the Prophet (ﷺ)\noffered\nthe funeral prayer for ‘Uthman bin Maz’un, and he said four\nTakbir over him."}},{"id":71,"idInBook":71,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ الْمُحَارِبِيُّ، حَدَّثَنَا الْهَجَرِيُّ، قَالَ صَلَيْتُ مَعَ عَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى الأَسْلَمِيِّ صَاحِبِ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ عَلَى جِنَازَةِ ابْنَةٍ لَهُ فَكَبَّرَ عَلَيْهَا أَرْبَعًا فَمَكَثَ بَعْدَ الرَّابِعَةِ شَيْئًا ‏.‏ قَالَ فَسَمِعْتُ الْقَوْمَ يُسَبِّحُونَ بِهِ مِنْ نَوَاحِي الصُّفُوفِ فَسَلَّمَ ثُمَّ قَالَ أَكُنْتُمْ تُرَوْنَ أَنِّي مُكَبِّرٌ خَمْسًا قَالُوا تَخَوَّفْنَا ذَلِكَ ‏.‏ قَالَ لَمْ أَكُنْ لأَفْعَلَ ‏.‏ وَلَكِنْ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ كَانَ يُكَبِّرُ أَرْبَعًا ثُمَّ يَمْكُثُ سَاعَةً فَيَقُولُ مَا شَاءَ اللَّهُ أَنْ يَقُولَ ثُمَّ يُسَلِّمُ ‏.‏","english":{"narrator":"Al-Hajari said:","text":"“I prayed with ‘Abdullah bin Abi Awfa Al-Aslami,\nthe\nCompanion of the Messenger of Allah (ﷺ), offering the funeral\nprayer\nfor a daughter of his. He said Takbir over her four times, and\nhe\npaused for a while after the fourth. I heard the people saying\nSubhan-\nAllah to him throughout the rows. Then he said the Salam and\nsaid:\n‘Did you think that I was going to say a fifth Takbir?’\nThey said: ‘We\nwere afraid of that.’ He said: ‘I was not going\nto do that, but the\nMessenger of Allah (ﷺ) used to say four Takbir,\nthen pause for a\nwhile, and he would say whatever Allah willed he\nshould say, then he\nwould say the Salam.’”"}},{"id":72,"idInBook":72,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَبُو هِشَامٍ الرِّفَاعِيُّ، وَمُحَمَّدُ بْنُ الصَّبَّاحِ، وَأَبُو بَكْرِ بْنُ خَلاَّدٍ قَالُوا حَدَّثَنَا يَحْيَى بْنُ الْيَمَانِ، عَنِ الْمِنْهَالِ بْنِ خَلِيفَةَ، عَنْ حَجَّاجٍ، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ كَبَّرَ أَرْبَعًا ‏.‏","english":{"narrator":"","text":"It was\nnarrated from Ibn ‘Abbas that the Prophet (ﷺ) said Takbir\nfour\ntimes."}},{"id":73,"idInBook":73,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، ح وَحَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، وَأَبُو دَاوُدَ عَنْ شُعْبَةَ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، قَالَ كَانَ زَيْدُ بْنُ أَرْقَمَ يُكَبِّرُ عَلَى جَنَائِزِنَا أَرْبَعًا وَأَنَّهُ كَبَّرَ عَلَى جِنَازَةٍ خَمْسًا فَسَأَلْتُهُ فَقَالَ كَانَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ يُكَبِّرُهَا ‏.‏","english":{"narrator":"It was\nnarrated that ‘Abdur-Rahman bin Abi Laila said:","text":"“Zaid bin\nArqan\nused to say the Takbir four times in the funeral prayer, and he\nsaid\nthe Takbir five times for one funeral. I asked him (about that)\nand\nhe said: ‘The Messenger of Allah (ﷺ) used to do that.’”"}},{"id":74,"idInBook":74,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ الْحِزَامِيُّ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ عَلِيٍّ الرَّافِعِيُّ، عَنْ كَثِيرِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ كَبَّرَ خَمْسًا ‏.‏","english":{"narrator":"","text":"It was\nnarrated from Kathir bin ‘Abdullah, from his father, from his\ngrandfather, that the Messenger of Allah (ﷺ) said the Takbir five\ntimes."}},{"id":75,"idInBook":75,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، قَالَ حَدَّثَنَا سَعِيدُ بْنُ عُبَيْدِ اللَّهِ بْنِ جُبَيْرِ بْنِ حَيَّةَ، حَدَّثَنِي عَمِّي، زِيَادُ بْنُ جُبَيْرٍ حَدَّثَنِي أَبِي جُبَيْرُ بْنُ حَيَّةَ، أَنَّهُ سَمِعَ الْمُغِيرَةَ بْنَ شُعْبَةَ، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\n\"‏ الطِّفْلُ يُصَلَّى عَلَيْهِ ‏\"‏ ‏.‏","english":{"narrator":"Abu\nJubair bin Hayyah narrated that he heard Mughirah bin Shu’bah\nsay:","text":"“I heard the Messenger of Allah (ﷺ) say: ‘The (funeral) prayer\nshould be offered for a child.’”"}},{"id":76,"idInBook":76,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا الرَّبِيعُ بْنُ بَدْرٍ، حَدَّثَنَا أَبُو الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ إِذَا اسْتَهَلَّ الصَّبِيُّ صُلِّيَ عَلَيْهِ وَوُرِثَ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Jabir bin ‘Abdullah that the Messenger of Allah\n(ﷺ)\nsaid:","text":"“If a child utters a sound (after being born), the funeral\nprayer should be offered for him and (his relatives) may inherit from\nhim.”"}},{"id":77,"idInBook":77,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا الْبَخْتَرِيُّ بْنُ عُبَيْدٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏\n\"‏ صَلُّوا عَلَى أَطْفَالِكُمْ فَإِنَّهُمْ مِنْ أَفْرَاطِكُمْ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Abu Hurairah said:","text":"“The Prophet (ﷺ) said:\n‘Offer\nthe (funeral) prayer for your children, for they have gone\nahead of\nyou (i.e. to prepare your place in Paradise for you).”"}},{"id":78,"idInBook":78,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي خَالِدٍ، قَالَ قُلْتُ لِعَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى رَأَيْتَ إِبْرَاهِيمَ ابْنَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ مَاتَ وَهُوَ صَغِيرٌ وَلَوْ قُضِيَ أَنْ يَكُونَ بَعْدَ مُحَمَّدٍ ـ صلى الله عليه وسلم ـ نَبِيٌّ لَعَاشَ ابْنُهُ وَلَكِنْ لاَ نَبِيَّ بَعْدَهُ ‏.‏","english":{"narrator":"Isma’il\nbin Abu Khalid said:","text":"“I said to ‘Abdullah bin Abi Awfa: ‘Did\nyou see Ibrahim, the son of the Messenger of Allah (ﷺ)?’ He said:\n‘He died when he was small, and if it had been decreed that there\nshould be any Prophet after Muhammad (ﷺ), his son would have lived.\nBut there is no Prophet after him.’”"}},{"id":79,"idInBook":79,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا عَبْدُ الْقُدُّوسِ بْنُ مُحَمَّدٍ، حَدَّثَنَا دَاوُدُ بْنُ شَبِيبٍ الْبَاهِلِيُّ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ عُثْمَانَ، حَدَّثَنَا الْحَكَمُ بْنُ عُتَيْبَةَ، عَنْ مِقْسَمٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ لَمَّا مَاتَ إِبْرَاهِيمُ ابْنُ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ صَلَّى عَلَيْهِ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ وَقَالَ ‏\n\"‏ إِنَّ لَهُ مُرْضِعًا فِي الْجَنَّةِ وَلَوْ عَاشَ لَكَانَ صِدِّيقًا نَبِيًّا ‏.‏ وَلَوْ عَاشَ لَعَتَقَتْ أَخْوَالُهُ الْقِبْطُ وَمَا اسْتُرِقَّ قِبْطِيٌّ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Ibn ‘Abbas said:","text":"“Then Ibrahim the son of the\nMessenger of Allah (ﷺ) died, the Messenger of Allah (ﷺ) prayed\nand\nsaid: ‘He has a wet-nurse in Paradise, and if he had lived he\nwould\nhave been a Siddiq and a Prophet. If he had lived his maternal\nuncles,\nthe Egyptians, would have been set free and no Egyptian would\never\nhave been enslaved.’”"}},{"id":80,"idInBook":80,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عِمْرَانَ، حَدَّثَنَا أَبُو دَاوُدَ، حَدَّثَنَا هِشَامُ بْنُ أَبِي الْوَلِيدِ، عَنْ أُمِّهِ، عَنْ فَاطِمَةَ بِنْتِ الْحُسَيْنِ، عَنْ أَبِيهَا الْحُسَيْنِ بْنِ عَلِيٍّ، قَالَ لَمَّا تُوُفِّيَ الْقَاسِمُ ابْنُ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَتْ خَدِيجَةُ يَا رَسُولَ اللَّهِ دَرَّتْ لُبَيْنَةُ الْقَاسِمِ فَلَوْ كَانَ اللَّهُ أَبْقَاهُ حَتَّى يَسْتَكْمِلَ رَضَاعَهُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ إِنَّ تَمَامَ رَضَاعِهِ فِي الْجَنَّةِ ‏\"‏ ‏.‏ قَالَتْ لَوْ أَعْلَمُ ذَلِكَ يَا رَسُولَ اللَّهِ لَهَوَّنَ عَلَىَّ أَمْرَهُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ إِنْ شِئْتِ دَعَوْتُ اللَّهَ تَعَالَى فَأَسْمَعَكِ صَوْتَهُ ‏\"‏ ‏.‏ قَالَتْ يَا رَسُولَ اللَّهِ بَلْ أُصَدِّقُ اللَّهَ وَرَسُولَهُ ‏.‏","english":{"narrator":"Husain\nbin ‘Ali said:","text":"“When Qasim the son of the Messenger of Allah\n(ﷺ) died, Khadijah said: ‘O Messenger of Allah, the milk of\nQasim’s\nmother is overflowing. Would that Allah had let him live\nuntil he had\nfinished breastfeeding.’ The Messenger of Allah (ﷺ)\nsaid: ‘He will\ncomplete his breastfeeding in Paradise.’ She said:\n‘If I know that, O\nMessenger of Allah, it makes it easier for me to\nbear.’ The Messenger\nof Allah (ﷺ) said: ‘If you wish, I will\npray to Allah to let you\nhear his voice.’ She said: ‘O Messenger\nof Allah, rather I believe\nAllah and His Messenger.’”"}},{"id":81,"idInBook":81,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ، عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ، عَنْ مِقْسَمٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ أُتِيَ بِهِمْ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ يَوْمَ أُحُدٍ فَجَعَلَ يُصَلِّي عَلَى عَشَرَةٍ عَشَرَةٍ وَحَمْزَةُ هُوَ كَمَا هُوَ يُرْفَعُونَ وَهُوَ كَمَا هُوَ مَوْضُوعٌ ‏.‏","english":{"narrator":"It was\nnarrated that Ibn ‘Abbas said:","text":"“They (the martyrs) were\nbrought\nto the Messenger of Allah (ﷺ) on the Day of Uhud, and he\nstarted to\noffer the funeral prayer for them, ten by ten. Hamzah lay\nwhere he\nlay, and they were taken away but he was left where he was.”"}},{"id":82,"idInBook":82,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَعْبِ بْنِ مَالِكٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ كَانَ يَجْمَعُ بَيْنَ الرَّجُلَيْنِ وَالثَّلاَثَةِ مِنْ قَتْلَى أُحُدٍ فِي ثَوْبٍ وَاحِدٍ ثُمَّ يَقُولُ ‏\"‏ أَيُّهُمْ أَكْثَرُ أَخْذًا لِلْقُرْآنِ ‏\"‏ ‏.‏ فَإِذَا أُشِيرَ لَهُ إِلَى أَحَدِهِمْ قَدَّمَهُ فِي اللَّحْدِ وَقَالَ ‏\"‏ أَنَا شَهِيدٌ عَلَى هَؤُلاَءِ ‏\"‏ ‏.‏ وَأَمَرَ بِدَفْنِهِمْ فِي دِمَائِهِمْ وَلَمْ يُصَلِّ عَلَيْهِمْ وَلَمْ يُغَسَّلُوا ‏.‏","english":{"narrator":"It was\nnarrated from Jabir bin ‘Abdullah that the Messenger of Allah\n(ﷺ)\nused to put two or three of the slain of Uhud in one shroud. He\nwould\nask:","text":"“Which of them had memorized more Qur’an?” And if one of\nthem was pointed out to him, he would put him in the niche-grave\nfirst. And he said: “I am a witness over them.” He commanded that\nthey\nshould be buried with their blood, and that the funeral prayer\nshould\nnot be offered for them and they should not be washed."}},{"id":83,"idInBook":83,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ زِيَادٍ، حَدَّثَنَا عَلِيُّ بْنُ عَاصِمٍ، عَنْ عَطَاءِ بْنِ السَّائِبِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ أَمَرَ بِقَتْلَى أُحُدٍ أَنْ يُنْزَعَ عَنْهُمُ الْحَدِيدُ وَالْجُلُودُ وَأَنْ يُدْفَنُوا فِي ثِيَابِهِمْ بِدِمَائِهِمْ ‏.‏","english":{"narrator":"","text":"It was\nnarrated from Ibn ‘Abbas that the Messenger of Allah (ﷺ)\ncommanded that the weapons and armor should be removed from the slain\nof Uhud, and they should be buried in their clothes stained with\nblood."}},{"id":84,"idInBook":84,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، وَسَهْلُ بْنُ أَبِي سَهْلٍ، قَالاَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الأَسْوَدِ بْنِ قَيْسٍ، سَمِعَ نُبَيْحًا الْعَنَزِيَّ، يَقُولُ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ إِنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ أَمَرَ بِقَتْلَى أُحُدٍ أَنْ يُرَدُّوا إِلَى مَصَارِعِهِمْ وَكَانُوا نُقِلُوا إِلَى الْمَدِينَةِ ‏.‏","english":{"narrator":"It was\nnarrated from Aswad bin Qais that he heard Nubaih Al-‘Anazi\nsay:","text":"“I\nheard Jabir bin ‘Abdullah say: ‘The Messenger of Allah (ﷺ)\ncommanded that the slain of the battle of Uhud should be returned to\nthe battlefield; they had been moved to Al-Madinah.’”"}},{"id":85,"idInBook":85,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنِ ابْنِ أَبِي ذِئْبٍ، عَنْ صَالِحٍ، مَوْلَى التَّوْأَمَةِ عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ مَنْ صَلَّى عَلَى جِنَازَةٍ فِي الْمَسْجِدِ فَلَيْسَ لَهُ شَىْءٌ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Abu Hurairah said:","text":"“The Messenger of Allah (ﷺ)\nsaid: ‘Whoever offers the funeral prayer in the mosque will have\nnothing (i.e., no reward).’”"}},{"id":86,"idInBook":86,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ، حَدَّثَنَا فُلَيْحُ بْنُ سُلَيْمَانَ، عَنْ صَالِحِ بْنِ عَجْلاَنَ، عَنْ عَبَّادِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، قَالَتْ وَاللَّهِ مَا صَلَّى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَلَى سُهَيْلِ ابْنِ بَيْضَاءَ إِلاَّ فِي الْمَسْجِدِ ‏.‏ قَالَ ابْنُ مَاجَهْ حَدِيثُ عَائِشَةَ أَقْوَى ‏.‏","english":{"narrator":"It was\nnarrated that ‘Aishah said:","text":"“By Allah! The Messenger of Allah\n(ﷺ) did not offer the funeral prayer for Suhail bin Baida’\nanywhere\nbut in the mosque.”"}},{"id":87,"idInBook":87,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنَا عَمْرُو بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، جَمِيعًا عَنْ مُوسَى بْنِ عُلَىِّ بْنِ رَبَاحٍ، قَالَ سَمِعْتُ أَبِي يَقُولُ، سَمِعْتُ عُقْبَةَ بْنَ عَامِرٍ الْجُهَنِيَّ، يَقُولُ: ثَلاَثُ سَاعَاتٍ كَانَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ يَنْهَانَا أَنْ نُصَلِّيَ فِيهِنَّ أَوْ نَقْبِرَ فِيهِنَّ مَوْتَانَا حِينَ تَطْلُعُ الشَّمْسُ بَازِغَةً، وَحِينَ يَقُومُ قَائِمُ الظَّهِيرَةِ حَتَّى تَمِيلَ الشَّمْسُ، وَحِينَ تَضَيَّفُ لِلْغُرُوبِ حَتَّى تَغْرُبَ ‏.‏","english":{"narrator":"‘Uqbah\nbin ‘Amir Al-Juhani said:","text":"“There are three times during the\nday\nwhen the Messenger of Allah (ﷺ) forbade us to offer the funeral\nprayer or bury our dead: When the sun has fully risen (until it is\nhigher up in the sky), when it is overhead at noon until it has\npassed the meridian, and when it is starting to set until it has\nset.”"}},{"id":88,"idInBook":88,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، أَنْبَأَنَا يَحْيَى بْنُ الْيَمَانِ، عَنْ مِنْهَالِ بْنِ خَلِيفَةَ، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ أَدْخَلَ رَجُلاً قَبْرَهُ لَيْلاً وَأَسْرَجَ فِي قَبْرِهِ ‏.‏","english":{"narrator":"","text":"It was\nnarrated from Ibn ‘Abbas that the Messenger of Allah (ﷺ)\nplaced a\nman in his grave at night, and he lit a lamp in his grave."}},{"id":89,"idInBook":89,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا عَمْرُو بْنُ عَبْدِ اللَّهِ الأَوْدِيُّ، حَدَّثَنَا وَكِيعٌ، عَنْ إِبْرَاهِيمَ بْنِ يَزِيدَ الْمَكِّيِّ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ لاَ تَدْفِنُوا مَوْتَاكُمْ بِاللَّيْلِ إِلاَّ أَنْ تُضْطَرُّوا ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Jabir bin ‘Abdullah that the Messenger of Allah\n(ﷺ)\nsaid:","text":"“Do not bury your dead at night unless you are forced to.”"}},{"id":90,"idInBook":90,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا الْعَبَّاسُ بْنُ عُثْمَانَ الدِّمَشْقِيُّ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، عَنِ ابْنِ لَهِيعَةَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ صَلُّوا عَلَى مَوْتَاكُمْ بِاللَّيْلِ وَالنَّهَارِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Jabir bin ‘Abdullah that the Prophet (ﷺ) said:","text":"“Offer the funeral prayer for your dead by night or by day.”"}},{"id":91,"idInBook":91,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بِشْرٍ، بَكْرُ بْنُ خَلَفٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ لَمَّا تُوُفِّيَ عَبْدُ اللَّهِ بْنُ أُبَىٍّ جَاءَ ابْنُهُ إِلَى النَّبِيِّ ـ صلى الله عليه وسلم ـ فَقَالَ يَا رَسُولَ اللَّهِ أَعْطِنِي قَمِيصَكَ أُكَفِّنْهُ فِيهِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ آذِنُونِي بِهِ ‏\"‏ ‏.‏ فَلَمَّا أَرَادَ النَّبِيُّ ـ صلى الله عليه وسلم ـ أَنْ يُصَلِّيَ عَلَيْهِ قَالَ لَهُ عُمَرُ بْنُ الْخَطَّابِ مَا ذَاكَ لَكَ ‏.‏ فَصَلَّى عَلَيْهِ النَّبِيُّ ـ صلى الله عليه وسلم ـ فَقَالَ لَهُ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏\"‏ أَنَا بَيْنَ خِيرَتَيْنِ ‏{اسْتَغْفِرْ لَهُمْ أَوْ لاَ تَسْتَغْفِرْ لَهُمْ }‏ ‏\"‏ ‏.‏ فَأَنْزَلَ اللَّهُ سُبْحَانَهُ ‏{وَلاَ تُصَلِّ عَلَى أَحَدٍ مِنْهُمْ مَاتَ أَبَدًا وَلاَ تَقُمْ عَلَى قَبْرِهِ}‏ ‏.‏","english":{"narrator":"It was\nnarrated that Ibn ‘Umar said:","text":"“When ‘Abdullah bin Ubayy died,\nhis son came to the Prophet (ﷺ) and said: ‘O Messenger of Allah,\ngive me your shirt so that I may shroud him in it.’ The Messenger\nof\nAllah (ﷺ) said: ‘Notify me when he is ready (i.e., when he has\nbeen\nwashed and shrouded).’ When the Prophet (ﷺ) wanted to offer\nthe\nfuneral prayer for him: ‘You should not do that.’ The Prophet\n(ﷺ)\noffered the funeral prayer for him, and the Prophet (ﷺ) said\nto him:\n‘I have been given two choices: “...ask forgiveness for\nthem\n(hypocrites) or ask not forgiveness for them...’” \nThen Allah\nrevealed: ‘And never pray (the funeral prayer) for any\nof them\n(hypocrites) who dies, nor stand at his grave.’” "}},{"id":92,"idInBook":92,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا عَمَّارُ بْنُ خَالِدٍ الْوَاسِطِيُّ، وَسَهْلُ بْنُ أَبِي سَهْلٍ، قَالاَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ مُجَالِدٍ، عَنْ عَامِرٍ، عَنْ جَابِرٍ، قَالَ مَاتَ رَأْسُ الْمُنَافِقِينَ بِالْمَدِينَةِ وَأَوْصَى أَنْ يُصَلِّيَ عَلَيْهِ النَّبِيُّ ـ صلى الله عليه وسلم ـ وَأَنْ يُكَفِّنَهُ فِي قَمِيصِهِ فَصَلَّى عَلَيْهِ وَكَفَّنَهُ فِي قَمِيصِهِ وَقَامَ عَلَى قَبْرِهِ فَأَنْزَلَ اللَّهُ ‏{وَلاَ تُصَلِّ عَلَى أَحَدٍ مِنْهُمْ مَاتَ أَبَدًا وَلاَ تَقُمْ عَلَى قَبْرِهِ}‏ ‏.‏","english":{"narrator":"It was\nnarrated that Jabir said:","text":"“The leader of the hypocrites in\nAl-\nMadinah died, and left instructions that the Prophet (ﷺ) should\noffer the funeral prayer for him and shroud him in his shirt. He\noffered the funeral prayer for him and shrouded him in his shirt, and\nstood by his grave. Then Allah revealed the words: ‘And never pray\n(the funeral prayer) for any of them (hypocrites) who dies, nor stand\nat his grave.” "}},{"id":93,"idInBook":93,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ يُوسُفَ السُّلَمِيُّ، حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا الْحَارِثُ بْنُ نَبْهَانَ، حَدَّثَنَا عُتْبَةُ بْنُ يَقْظَانَ، عَنْ أَبِي سَعِيدٍ، عَنْ مَكْحُولٍ، عَنْ وَاثِلَةَ بْنِ الأَسْقَعِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ صَلُّوا عَلَى كُلِّ مَيِّتٍ وَجَاهِدُوا مَعَ كُلِّ أَمِيرٍ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Wathilah bin Asqa’ that the Messenger of Allah\n(ﷺ)\nsaid:","text":"‘Offer prayer for everyone who dies, and strive in Jihad\nunder every chief.”"}},{"id":94,"idInBook":94,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَامِرِ بْنِ زُرَارَةَ، حَدَّثَنَا شَرِيكُ بْنُ عَبْدِ اللَّهِ، عَنْ سِمَاكِ بْنِ حَرْبٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، أَنَّ رَجُلاً، مِنْ أَصْحَابِ النَّبِيِّ ـ صلى الله عليه وسلم ـ جُرِحَ فَآذَتْهُ الْجِرَاحَةُ فَدَبَّ إِلَى مَشَاقِصِهِ فَذَبَحَ بِهِ نَفْسَهُ فَلَمْ يُصَلِّ عَلَيْهِ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏.‏ قَالَ وَكَانَ ذَلِكَ أَدَبًا مِنْهُ ‏.‏","english":{"narrator":"","text":"It was\nnarrated from Jabir bin Samurah that a man from among the\nCompanions\nof the Prophet (ﷺ) was wounded, and the wound caused him\na great\ndeal of pain. He went and took a spearhead, and slaughtered\nhimself\nwith it. The Prophet (ﷺ) did not offer the funeral prayer\nfor him,\nand that was as an admonition for others."}},{"id":95,"idInBook":95,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ، أَنْبَأَنَا حَمَّادُ بْنُ زَيْدٍ، حَدَّثَنَا ثَابِتٌ، عَنْ أَبِي رَافِعٍ، عَنْ أَبِي هُرَيْرَةَ، ‏.‏ أَنَّ امْرَأَةً، سَوْدَاءَ كَانَتْ تَقُمُّ الْمَسْجِدَ فَفَقَدَهَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ فَسَأَلَ عَنْهَا بَعْدَ أَيَّامٍ فَقِيلَ لَهُ إِنَّهَا مَاتَتْ ‏.‏ قَالَ ‏\n\"‏ فَهَلاَّ آذَنْتُمُونِي ‏\"‏ ‏.‏ فَأَتَى قَبْرَهَا فَصَلَّى عَلَيْهَا ‏.‏","english":{"narrator":"It was\nnarrated from Abu Hurairah that a black woman used to sweep\nthe\nmosque. The Messenger of Allah (ﷺ) noticed she was missing and\nhe\nasked about her after a few days. He was told that she had died. He\nsaid:","text":"“Why did you not tell me?” Then he went to her grave and\noffered\nthe funeral prayer for her."}},{"id":96,"idInBook":96,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا هُشَيْمٌ، حَدَّثَنَا عُثْمَانُ بْنُ حَكِيمٍ، حَدَّثَنَا خَارِجَةُ بْنُ زَيْدِ بْنِ ثَابِتٍ، عَنْ يَزِيدَ بْنِ ثَابِتٍ، وَكَانَ، أَكْبَرَ مِنْ زَيْدٍ قَالَ خَرَجْنَا مَعَ النَّبِيِّ ـ صلى الله عليه وسلم ـ فَلَمَّا وَرَدَ الْبَقِيعَ فَإِذَا هُوَ بِقَبْرٍ جَدِيدٍ فَسَأَلَ عَنْهُ فَقَالُوا فُلاَنَةُ ‏.‏ قَالَ فَعَرَفَهَا وَقَالَ ‏\"‏ أَلاَ آذَنْتُمُونِي بِهَا ‏\"‏ ‏.‏ قَالُوا كُنْتَ قَائِلاً صَائِمًا فَكَرِهْنَا أَنْ نُؤْذِيَكَ ‏.‏ قَالَ ‏\"‏ فَلاَ تَفْعَلُوا لاَ أَعْرِفَنَّ مَا مَاتَ فِيكُمْ مَيِّتٌ مَا كُنْتُ بَيْنَ أَظْهُرِكُمْ إِلاَّ آذَنْتُمُونِي بِهِ فَإِنَّ صَلاَتِي عَلَيْهِ لَهُ رَحْمَةٌ ‏\"‏ ‏.‏ ثُمَّ أَتَى الْقَبْرَ فَصَفَّنَا خَلْفَهُ فَكَبَّرَ عَلَيْهِ أَرْبَعًا ‏.‏","english":{"narrator":"Kharijah\nbin Zaid bin Thabit narrated that Yazid bin Thabit, who was\nolder\nthan Zaid, said:","text":"“We went out with the Prophet (ﷺ) and when we\nreached Al-Baqi’, we saw a new grave. He asked about it and they\nsaid:\n‘(It is) so-and-so (a woman).’ He recognized the name and\nsaid: ‘Why\ndid you not tell me about her?’ They said: ‘You were\ntaking a nap and\nyou were fasting, and we did not like to disturb\nyou.’ He said: ‘Do\nnot do that; I do not want to see it happen\nagain that one of you\ndies, while I am still among you, and you do\nnot tell me, for my\nprayer for him is a mercy.’ Then he went to the\ngrave and we lined up\nin rows behind him, and he said four Takbir\n(i.e. for the funeral\nprayer).”"}},{"id":97,"idInBook":97,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ الدَّرَاوَرْدِيُّ، عَنْ مُحَمَّدِ بْنِ زَيْدِ بْنِ الْمُهَاجِرِ بْنِ قُنْفُذٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَامِرِ بْنِ رَبِيعَةَ، عَنْ أَبِيهِ، أَنَّ امْرَأَةً، سَوْدَاءَ مَاتَتْ و لَمْ يُؤْذَنْ بِهَا النَّبِيُّ ـ صلى الله عليه وسلم ـ فَأُخْبِرَ بِذَلِكَ فَقَالَ ‏\"‏ هَلاَّ آذَنْتُمُونِي بِهَا ‏\"‏ ‏.‏ ثُمَّ قَالَ لأَصْحَابِهِ ‏\"‏ صُفُّوا عَلَيْهَا ‏\"‏ ‏.‏ فَصَلَّى عَلَيْهَا ‏.‏","english":{"narrator":"It was\nnarrated from ‘Abdullah bin ‘Amir bin Rabi’ah, from his\nfather,\nthat a black woman died and the Prophet (ﷺ) was not told\nabout\nthat. Then he was informed of it, and he said:","text":"“Why did you not\ntell me?” Then he said to his Companions: “Line up in rows to\npray for\nher,” and he offered the funeral prayer for her."}},{"id":98,"idInBook":98,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنْ أَبِي إِسْحَاقَ الشَّيْبَانِيِّ، عَنِ الشَّعْبِيِّ، عَنِ ابْنِ عَبَّاسٍ، قَالَ مَاتَ رَجُلٌ وَكَانَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ يَعُودُهُ. فَدَفَنُوهُ بِاللَّيْلِ. فَلَمَّا أَصْبَحَ أَعْلَمُوهُ. فَقَالَ ‏\n\"‏ مَا مَنَعَكُمْ أَنْ تُعْلِمُونِي ‏\"‏ ‏.‏ قَالُوا كَانَ اللَّيْلُ وَكَانَتِ الظُّلْمَةُ فَكَرِهْنَا أَنْ نَشُقَّ عَلَيْكَ ‏.‏ فَأَتَى قَبْرَهُ، فَصَلَّى عَلَيْهِ ‏.‏","english":{"narrator":"It was\nnarrated that Ibn ‘Abbas said:","text":"“A man died whom the Messenger\nof\nAllah (ﷺ) used to visit, and they buried him at night. When\nmorning\ncame, they told him. He said: ‘What kept you from telling me?’\nThey said: ‘It was night and it was dark, and we did not like to\ncause\nyou any inconvenience.’ Then he went to the grave and offered\nthe\nfuneral prayer for him.”"}},{"id":99,"idInBook":99,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا الْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ الْعَنْبَرِيُّ، وَمُحَمَّدُ بْنُ يَحْيَى، قَالاَ حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا غُنْدَرٌ، عَنْ شُعْبَةَ، عَنْ حَبِيبِ بْنِ الشَّهِيدِ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ صَلَّى عَلَى قَبْرٍ بَعْدَ مَا قُبِرَ ‏.‏","english":{"narrator":"","text":"It was\nnarrated from Anas that the Prophet (ﷺ) offered the funeral\nprayer\nat a grave after the burial."}},{"id":100,"idInBook":100,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ حُمَيْدٍ، حَدَّثَنَا مِهْرَانُ بْنُ أَبِي عُمَرَ، عَنْ أَبِي سِنَانٍ، عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ، عَنِ ابْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ صَلَّى عَلَى مَيِّتٍ بَعْدَ مَا دُفِنَ ‏.‏","english":{"narrator":"","text":"It was\nnarrated from Ibn Buraidah from his father that the Prophet\n(ﷺ)\noffered the funeral prayer for a deceased person after he had\nbeen\nburied."}},{"id":101,"idInBook":101,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا سَعِيدُ بْنُ شُرَحْبِيلَ، عَنِ ابْنِ لَهِيعَةَ، عَنْ عُبَيْدِ اللَّهِ بْنِ الْمُغِيرَةِ، عَنْ أَبِي الْهَيْثَمِ، عَنْ أَبِي سَعِيدٍ، قَالَ كَانَتْ سَوْدَاءُ تَقُمُّ الْمَسْجِدَ فَتُوُفِّيَتْ لَيْلاً فَلَمَّا أَصْبَحَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ أُخْبِرَ بِمَوْتِهَا فَقَالَ ‏\n\"‏ أَلاَ آذَنْتُمُونِي بِهَا ‏\"‏ ‏.‏ فَخَرَجَ بِأَصْحَابِهِ فَوَقَفَ عَلَى قَبْرِهَا فَكَبَّرَ عَلَيْهَا وَالنَّاسُ مِنْ خَلْفِهِ وَدَعَا لَهَا ثُمَّ انْصَرَفَ ‏.‏","english":{"narrator":"It was\nnarrated that Abu Sa’eed said:","text":"“There was a black woman who\nused\nto sweep the mosque, and she passed away at night. The following\nmorning the Messenger of Allah (ﷺ) was told of her death. He said:\n‘Why did you not call me?’ Then he went out with his Companions\nand\nstood at her grave, and said Takbir over her, with the people\nbehind\nhim, and he supplicated for her, then he went away.’”"}},{"id":102,"idInBook":102,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ الأَعْلَى، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ إِنَّ النَّجَاشِيَّ قَدْ مَاتَ ‏\"‏ ‏.‏ فَخَرَجَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ وَأَصْحَابُهُ إِلَى الْبَقِيعِ ‏.‏ فَصَفَّنَا خَلْفَهُ وَتَقَدَّمَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ فَكَبَّرَ أَرْبَعَ تَكْبِيرَاتٍ ‏.‏","english":{"narrator":"It was\nnarrated from Abu Hurairah:","text":"“The Messenger of Allah (ﷺ)\nsaid:\n‘Najashi has died.’ The Messenger of Allah (ﷺ) and his\nCompanions went out to Al-Baqi’, and we lined up in rows behind\nhim,\nand the Messenger of Allah (ﷺ) went forward, then he said four\nTakbir.”"}},{"id":103,"idInBook":103,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا يَحْيَى بْنُ خَلَفٍ، وَمُحَمَّدُ بْنُ زِيَادٍ، قَالاَ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، ح وَحَدَّثَنَا عَمْرُو بْنُ رَافِعٍ، حَدَّثَنَا هُشَيْمٌ، جَمِيعًا عَنْ يُونُسَ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَبِي الْمُهَلَّبِ، عَنْ عِمْرَانَ بْنِ الْحُصَيْنِ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ إِنَّ أَخَاكُمُ النَّجَاشِيَّ قَدْ مَاتَ فَصَلُّوا عَلَيْهِ ‏\"‏ ‏.‏ قَالَ فَقَامَ فَصَلَّيْنَا خَلْفَهُ وَإِنِّي لَفِي الصَّفِّ الثَّانِي فَصَلَّى عَلَيْهِ صفَّين‏.‏","english":{"narrator":"It was\nnarrated from ‘Imran bin Husain:","text":"“The Messenger of Allah (ﷺ)\nsaid: ‘Your brother Najashi has died, so offer the funeral prayer\nfor\nhim.” Then he stood and we prayed behind him. I was in the\nsecond row\nand two rows prayed for him.”"}},{"id":104,"idInBook":104,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ، حَدَّثَنَا سُفْيَانُ، عَنْ حُمْرَانَ بْنِ أَعْيَنَ، عَنْ أَبِي الطُّفَيْلِ، عَنْ مُجَمِّعِ بْنِ جَارِيَةَ الأَنْصَارِيِّ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ إِنَّ أَخَاكُمُ النَّجَاشِيَّ قَدْ مَاتَ فَقُومُوا فَصَلُّوا عَلَيْهِ ‏\"‏ ‏.‏ فَصَففنَا خَلْفَهُ صَفَّيْنِ ‏.‏","english":{"narrator":"It was\nnarrated from Mujammi’ bin Jariyah Al-Ansari that the\nMessenger of\nAllah (ﷺ) said:","text":"“Your brother Najashi has died, so\nstand and pray\nfor him.” So we formed two rows behind him."}},{"id":105,"idInBook":105,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنِ الْمُثَنَّى بْنِ سَعِيدٍ، عَنْ قَتَادَةَ، عَنْ أَبِي الطُّفَيْلِ، عَنْ حُذَيْفَةَ بْنِ أَسِيدٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ خَرَجَ بِهِمْ فَقَالَ ‏\"‏ صَلُّوا عَلَى أَخٍ لَكُمْ مَاتَ بِغَيْرِ أَرْضِكُمْ ‏\"‏ ‏.‏ قَالُوا: مَنْ هُوَ؟ قَالَ: ‏\"‏ النَّجَاشِيُّ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Hudhaifah bin Asid that the Prophet (ﷺ) led\nthem out\nand said:","text":"“Pray for a brother of yours who has died in a land\nother\nthan yours.” They said: “Who is he?” He said: “Najashi.”"}},{"id":106,"idInBook":106,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا سَهْلُ بْنُ أَبِي سَهْلٍ، حَدَّثَنَا مَكِّيُّ بْنُ إِبْرَاهِيمَ أَبُو السَّكَنِ، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ صَلَّى عَلَى النَّجَاشِيِّ فَكَبَّرَ أَرْبَعًا ‏.‏","english":{"narrator":"","text":"It was\nnarrated from Ibn ‘Umar that the Prophet (ﷺ) offered the\nfuneral\nprayer for Najashi and said four Takbir."}},{"id":107,"idInBook":107,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ الأَعْلَى، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ مَنْ صَلَّى عَلَى جِنَازَةٍ فَلَهُ قِيرَاطٌ وَمَنِ انْتَظَرَ حَتَّى يُفْرَغَ مِنْهَا فَلَهُ قِيرَاطَانِ ‏\"‏ ‏.‏ قَالُوا وَمَا الْقِيرَاطَانِ قَالَ ‏\"‏ مِثْلُ الْجَبَلَيْنِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Abu Hurairah that the Prophet (ﷺ) said:","text":"“Whoever\noffers the funeral prayer will have one Qirat and whoever\nawaits\nuntil (the burial) is finished will have two Qirat.” They said:\n‘What are these two Qirat?’ He said: ‘Like two mountains.’”"}},{"id":108,"idInBook":108,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، حَدَّثَنِي سَالِمُ بْنُ أَبِي الْجَعْدِ، عَنْ مَعْدَانَ بْنِ أَبِي طَلْحَةَ، عَنْ ثَوْبَانَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ مَنْ صَلَّى عَلَى جِنَازَةٍ فَلَهُ قِيرَاطٌ وَمَنْ شَهِدَ دَفْنَهَا فَلَهُ قِيرَاطَانِ ‏\"‏ ‏.‏ قَالَ: فَسُئِلَ نَبِيُّ اللَّهِ ـ صلى الله عليه وسلم ـ عَنِ الْقِيرَاطِ؟ فَقَالَ ‏\"‏ مِثْلُ أُحُدٍ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Thawban that the Messenger of Allah (ﷺ) said:","text":"“Whoever offers the funeral prayer will have one Qirat and whoever\nattends the burial will have two Qirat.” The Prophet (ﷺ) was\nasked\nabout the Qirat and he said: “(It is) like Uhud.”"}},{"id":109,"idInBook":109,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ الْمُحَارِبِيُّ، عَنْ حَجَّاجِ بْنِ أَرْطَاةَ، عَنْ عَدِيِّ بْنِ ثَابِتٍ، عَنْ زِرِّ بْنِ حُبَيْشٍ، عَنْ أُبَىِّ بْنِ كَعْبٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ مَنْ صَلَّى عَلَى جِنَازَةٍ فَلَهُ قِيرَاطٌ وَمَنْ شَهِدَهَا حَتَّى تُدْفَنَ فَلَهُ قِيرَاطَانِ وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ الْقِيرَاطُ أَعْظَمُ مِنْ أُحُدٍ هَذَا ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Ubayy bin Ka’b that the Messenger of Allah (ﷺ)\nsaid:","text":"‘Whoever offers the funeral prayer will have one Qirat; and\nwhoever attends until the burial is over, will have two Qirat. By the\nOne in Whose Hand is the soul of Muhammad! The Qirat is greater than\nthis (mountain of) Uhud.”"}},{"id":110,"idInBook":110,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنْ عَامِرِ بْنِ رَبِيعَةَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ ح: وَحَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، عَنْ عَامِرِ بْنِ رَبِيعَةَ، سَمِعَهُ يُحَدِّثُ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ: ‏\n\"‏ إِذَا رَأَيْتُمُ الْجِنَازَةَ فَقُومُوا لَهَا حَتَّى تُخَلِّفَكُمْ أَوْ تُوضَعَ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from ‘Amir bin Rabi’ah that the Prophet (ﷺ) said:","text":"“When you see a funeral (procession) stand up for it until it has\npassed by or it is placed on the ground.”"}},{"id":111,"idInBook":111,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَهَنَّادُ بْنُ السَّرِيِّ، قَالاَ حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ مُرَّ عَلَى النَّبِيِّ ـ صلى الله عليه وسلم ـ بِجِنَازَةٍ فَقَامَ وَقَالَ ‏\n\"‏ قُومُوا فَإِنَّ لِلْمَوْتِ فَزَعًا ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Abu Hurairah said:","text":"“A funeral has passed by the\nProphet (ﷺ) and he stood up and said: ‘Stand up out of\nrecognition\nof the enormity of death.’”"}},{"id":112,"idInBook":112,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنْ شُعْبَةَ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ مَسْعُودِ بْنِ الْحَكَمِ، عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ، قَالَ قَامَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ لِجِنَازَةٍ فَقُمْنَا حَتَّى جَلَسَ فَجَلَسْنَا ‏.‏","english":{"narrator":"It was\nnarrated that ‘Ali bin Abu Talib said:","text":"“The Messenger of Allah\n(ﷺ) stood up for a funeral, and we stood up, until he sat down,\nthen\nwe sat down.”"}},{"id":113,"idInBook":113,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، وَعُقْبَةُ بْنُ مُكْرَمٍ، قَالاَ حَدَّثَنَا صَفْوَانُ بْنُ عِيسَى، حَدَّثَنَا بِشْرُ بْنُ رَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ سُلَيْمَانَ بْنِ جُنَادَةَ بْنِ أَبِي أُمَيَّةَ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، قَالَ كَانَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ إِذَا اتَّبَعَ جِنَازَةً لَمْ يَقْعُدْ حَتَّى تُوضَعَ فِي اللَّحْدِ فَعَرَضَ لَهُ حَبْرٌ فَقَالَ هَكَذَا نَصْنَعُ يَا مُحَمَّدُ ‏.‏ فَجَلَسَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ وَقَالَ ‏\n\"‏ خَالِفُوهُمْ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Ubadah bin Samit said:","text":"“When the Messenger of\nAllah (ﷺ) followed a funeral, he would not sit down until it had\nbeen placed in the niche-grave. A rabbi came to him and said: ‘This\nis\nwhat we do, O Muhammad!’ So the Messenger of Allah (ﷺ) sat\ndown and\nsaid: ‘Be different from them.’”"}},{"id":114,"idInBook":114,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ بْنُ مُوسَى، حَدَّثَنَا شَرِيكُ بْنُ عَبْدِ اللَّهِ، عَنْ عَاصِمِ بْنِ عُبَيْدِ اللَّهِ، عَنْ عَبْدِ اللَّهِ بْنِ عَامِرِ بْنِ رَبِيعَةَ، عَنْ عَائِشَةَ، قَالَتْ فَقَدْتُهُ - تَعْنِي النَّبِيَّ ـ صلى الله عليه وسلم ـ - فَإِذَا هُوَ بِالْبَقِيعِ فَقَالَ ‏\n\"‏ السَّلاَمُ عَلَيْكُمْ دَارَ قَوْمٍ مُؤْمِنِينَ أَنْتُمْ لَنَا فَرَطٌ وَإِنَّا بِكُمْ لاَحِقُونَ اللَّهُمَّ لاَ تَحْرِمْنَا أَجْرَهُمْ وَلاَ تَفْتِنَّا بَعْدَهُمْ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Aishah said:","text":"“I could not find him, meaning the\nProphet (ﷺ), and he was in Al-Baqi’. He said: “As-salamu\n‘alaykum\ndara qawmin mu’minin. Antum lana faratun wa inna bikum\nlahiqun.\nAllahumma la tahrimna ajrahum wa la taftinna ba’dahum.\n(Peace be upon\nyou, O abode of believing people. You have gone ahead\nof us and verily\nwe will join you soon. O Allah, do not deprive us of\ntheir reward and\ndo not put us to trial after them).”"}},{"id":115,"idInBook":115,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبَّادِ بْنِ آدَمَ، حَدَّثَنَا أَبُو أَحْمَدَ، حَدَّثَنَا سُفْيَانُ، عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ، عَنْ سُلَيْمَانَ بْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، قَالَ كَانَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ يُعَلِّمُهُمْ إِذَا خَرَجُوا إِلَى الْمَقَابِرِ. كَانَ قَائِلُهُمْ يَقُولُ: السَّلاَمُ عَلَيْكُمْ أَهْلَ الدِّيَارِ مِنَ الْمُؤْمِنِينَ وَالْمُسْلِمِينَ وَإِنَّا إِنْ شَاءَ اللَّهُ بِكُمْ لاَحِقُونَ نَسْأَلُ اللَّهَ لَنَا وَلَكُمُ الْعَافِيَةَ ‏.‏","english":{"narrator":"It was\nnarrated from Sulaiman bin Buraidah that his father said:","text":"“The\nMessenger of Allah (ﷺ) used to teach them, when they went out to\nthe\ngraveyard, to say: As-salamu ‘alaykum ahlad-diyar\nminal-mu’minina wal-\nmuslimin, wa inna insha’ Allah bikum lahiqun,\nnas’alul-laha lana wa\nlakumul-‘afiyah (Peace be upon you, O\ninhabitants of the abodes,\nbelievers and Muslims, and we will join\nyou soon if Allah wills. We\nask Allah for well-being for us and for\nyou).’”"}},{"id":116,"idInBook":116,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ زِيَادٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ يُونُسَ بْنِ خَبَّابٍ، عَنِ الْمِنْهَالِ بْنِ عَمْرٍو، عَنْ زَاذَانَ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ فِي جِنَازَةٍ فَقَعَدَ حِيَالَ الْقِبْلَةِ ‏.‏","english":{"narrator":"It was\nnarrated that Bara’ bin ‘Azib said:","text":"“We went out with the\nMessenger of Allah (ﷺ) for a funeral, and he sat facing the Qiblah\n(prayer direction).”"}},{"id":117,"idInBook":117,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو خَالِدٍ الأَحْمَرُ، عَنْ عَمْرِو بْنِ قَيْسٍ، عَنِ الْمِنْهَالِ بْنِ عَمْرٍو، عَنْ زَاذَانَ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ فِي جِنَازَةٍ فَانْتَهَيْنَا إِلَى الْقَبْرِ فَجَلَسَ وَجَلَسْنَا كَأَنَّ عَلَى رُءُوسِنَا الطَّيْرَ ‏.‏","english":{"narrator":"It was\nnarrated that Bara’ bin ‘Azib said:","text":"“We went out with the\nMessenger of Allah (ﷺ) for a funeral, and we came to a grave. He\nsat\ndown and we sat down, as if there were birds on our heads.”"}},{"id":118,"idInBook":118,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ، حَدَّثَنَا لَيْثُ بْنُ أَبِي سُلَيْمٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ ح وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ، حَدَّثَنَا أَبُو خَالِدٍ الأَحْمَرُ، حَدَّثَنَا الْحَجَّاجُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ كَانَ النَّبِيُّ ـ صلى الله عليه وسلم ـ إِذَا أُدْخِلَ الْمَيِّتُ الْقَبْرَ قَالَ ‏\"‏ بِسْمِ اللَّهِ وَعَلَى مِلَّةِ رَسُولِ اللَّهِ ‏\"‏ ‏.‏ وَقَالَ أَبُو خَالِدٍ مَرَّةً إِذَا وُضِعَ الْمَيِّتُ فِي لَحْدِهِ قَالَ ‏\"‏ بِسْمِ اللَّهِ وَعَلَى سُنَّةِ رَسُولِ اللَّهِ ‏\"‏ ‏.‏ وَقَالَ هِشَامٌ فِي حَدِيثِهِ ‏\"‏ بِسْمِ اللَّهِ وَفِي سَبِيلِ اللَّهِ وَعَلَى مِلَّةِ رَسُولِ اللَّهِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Ibn ‘Umar said:","text":"“When the deceased was placed in\nthe grave, the Prophet (ﷺ) would say: ‘Bismillah, wa ‘ala\nmillati\nrasul-illah (In the Name of Allah and according to the\nreligion of the\nMessenger of Allah).’” Abu Khalid said on one\noccasion, when the\ndeceased was placed in the grave: “Bismillah wa\n‘ala sunnati rasul-\nillah (In the Name of Allah and according to the\nSunnah of the\nMessenger of Allah).” Hisham said in his narration:\n“Bismillah, wa fi\nsabil-illah, wa ‘ala millati rasul-illah (In\nthe Name of Allah, for\nthe sake of Allah and according to the\nreligion of the Messenger of\nAllah).”"}},{"id":119,"idInBook":119,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ مُحَمَّدٍ الرَّقَاشِيُّ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ الْخَطَّابِ، حَدَّثَنَا مِنْدَلُ بْنُ عَلِيٍّ، أَخْبَرَنِي مُحَمَّدُ بْنُ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ، عَنْ دَاوُدَ بْنِ الْحُصَيْنِ، عَنْ أَبِيهِ، عَنْ أَبِي رَافِعٍ، قَالَ سَلَّ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ سَعْدًا وَرَشَّ عَلَى قَبْرِهِ مَاءً ‏.‏","english":{"narrator":"It was\nnarrated that Abu Rafi’ said:","text":"“The Messenger of Allah (ﷺ)\nplaced Sa’d gently in his grave and sprinkled water on it.”"}},{"id":120,"idInBook":120,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا هَارُونُ بْنُ إِسْحَاقَ، حَدَّثَنَا الْمُحَارِبِيُّ، عَنْ عَمْرِو بْنِ قَيْسٍ، عَنْ عَطِيَّةَ، عَنْ أَبِي سَعِيدٍ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ أُخِذَ مِنْ قِبَلِ الْقِبْلَةِ وَاسْتُقْبِلَ اسْتِقْبَالاً وَاسْتُلَّ اسْتِلاَلاً ‏.‏","english":{"narrator":"","text":"It was\nnarrated from Abu Sa’eed that the Messenger of Allah (ﷺ) was\nbrought into his grave from the direction of the Qiblah, and he was\nplaced in his grave gently."}},{"id":121,"idInBook":121,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا حَمَّادُ بْنُ عَبْدِ الرَّحْمَنِ الْكَلْبِيُّ، حَدَّثَنَا إِدْرِيسُ الأَوْدِيُّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، قَالَ حَضَرْتُ ابْنَ عُمَرَ فِي جِنَازَةٍ فَلَمَّا وَضَعَهَا فِي اللَّحْدِ قَالَ بِسْمِ اللَّهِ وَفِي سَبِيلِ اللَّهِ وَعَلَى مِلَّةِ رَسُولِ اللَّهِ ‏.‏ فَلَمَّا أُخِذَ فِي تَسْوِيَةِ اللَّبِنِ عَلَى اللَّحْدِ قَالَ اللَّهُمَّ أَجِرْهَا مِنَ الشَّيْطَانِ وَمِنْ عَذَابِ الْقَبْرِ اللَّهُمَّ جَافِ الأَرْضَ عَنْ جَنْبَيْهَا وَصَعِّدْ رُوحَهَا وَلَقِّهَا مِنْكَ رِضْوَانًا ‏.‏ قُلْتُ يَا ابْنَ عُمَرَ أَشَىْءٌ سَمِعْتَهُ مِنْ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ أَمْ قُلْتَهُ بِرَأْيِكَ قَالَ إِنِّي إِذًا لَقَادِرٌ عَلَى الْقَوْلِ بَلْ شَىْءٌ سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ ‏.‏","english":{"narrator":"It was\nnarrated that Sa’eed bin Musayyab said:","text":"“I was present with\nIbn\n‘Umar at a funeral. When the body was placed in the niche-grave)\nhe\nsaid, ‘Bismillah wa fi sabil-illah wa ‘ala millati rasul-illah’\n(In\nthe Name of Allah, for the sake of Allah and according to the\nreligion\nof the Messenger of Allah). When he started to place bricks\nin the\nniche-grave he said: ‘Allahumma ajirha min ash-shaitani wa\nmin\n‘adhabil-qabr. Allahumma Jafil-arda ‘an janbaiha, wa sa’id\nruhaha, wa\nlaqqiha minka ridwana (O Allah, protect him from Satan and\nfrom the\ntorment of the grave; O Allah, keep the earth away from his\ntwo sides\nand take his soul up and grant him pleasure from\nYourself).’ I said:\n‘O Ibn ‘Umar, is this something that you\nheard from the Messenger of\nAllah (ﷺ) or is it your own words?’\nHe said: ‘I could have said\nsomething like that, but this is\nsomething that I heard from the\nMessenger of Allah (ﷺ).’”"}},{"id":122,"idInBook":122,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا حَكَّامُ بْنُ سَلْمٍ الرَّازِيُّ، قَالَ سَمِعْتُ عَلِيَّ بْنَ عَبْدِ الأَعْلَى، يَذْكُرُ عَنْ أَبِيهِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ: قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ اللَّحْدُ لَنَا وَالشَّقُّ لِغَيْرِنَا ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Ibn ‘Abbas said:","text":"“The Messenger of Allah (ﷺ)\nsaid: ‘The niche-grave is for us and the ditch-grave is for\nothers.”"}},{"id":123,"idInBook":123,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ بْنُ مُوسَى السُّدِّيُّ، حَدَّثَنَا شَرِيكٌ، عَنْ أَبِي الْيَقْظَانِ، عَنْ زَاذَانَ، عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ الْبَجَلِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ اللَّحْدُ لَنَا وَالشَّقُّ لِغَيْرِنَا ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Jarir bin ‘Abdullah Al-Bajali said:","text":"“The\nMessenger\nof Allah (ﷺ) said: ‘The niche-grave is for us and the\nditch-grave\nis for others.’”"}},{"id":124,"idInBook":124,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا أَبُو عَامِرٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ الزُّهْرِيُّ، عَنْ إِسْمَاعِيلَ بْنِ مُحَمَّدِ بْنِ سَعْدٍ، عَنْ عَامِرِ بْنِ سَعْدٍ، عَنْ سَعْدٍ، أَنَّهُ قَالَ: أَلْحِدُوا لِي لَحْدًا وَانْصِبُوا عَلَىَّ اللَّبِنَ نَصْبًا كَمَا فُعِلَ بِرَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ ‏.‏","english":{"narrator":"It was\nnarrated that Sa’d said:","text":"“Make a niche-grave for me, and block\nit\nup with bricks as was done for the Messenger of Allah (ﷺ).”"}},{"id":125,"idInBook":125,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ، حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ، حَدَّثَنَا مُبَارَكُ بْنُ فَضَالَةَ، حَدَّثَنِي حُمَيْدٌ الطَّوِيلُ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ: لَمَّا تُوُفِّيَ النَّبِيُّ ـ صلى الله عليه وسلم ـ كَانَ بِالْمَدِينَةِ رَجُلٌ يَلْحَدُ وَآخَرُ يَضْرَحُ. فَقَالُوا: نَسْتَخِيرُ رَبَّنَا وَنَبْعَثُ إِلَيْهِمَا فَأَيُّهُمَا سَبَقَ تَرَكْنَاهُ ‏.‏ فَأُرْسِلَ إِلَيْهِمَا فَسَبَقَ صَاحِبُ اللَّحْدِ. فَلَحَدُوا لِلنَّبِيِّ ـ صلى الله عليه وسلم ـ ‏.‏","english":{"narrator":"It was\nnarrated that Anas bin Malik said:","text":"“When the Prophet (ﷺ)\ndied,\nthere was a man in Al-Madinah who used to make a niche in the\ngrave\nand another who used to dig graves without a niche. They said:\n‘Let\nus pray Istikharah to our Lord and call for them both, and\nwhichever\nof them comes first, we will let him do it.’ So they were\nboth sent\nfor, and the one who used to make the niche-grave came\nfirst, so they\nmade a niche-grave for the Prophet (ﷺ).”"}},{"id":126,"idInBook":126,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا عُمَرُ بْنُ شَبَّةَ بْنِ عُبَيْدَةَ بْنِ زَيْدٍ، حَدَّثَنَا عُبَيْدُ بْنُ طُفَيْلٍ الْمُقْرِئُ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي مُلَيْكَةَ الْقُرَشِيُّ، حَدَّثَنَا ابْنُ أَبِي مُلَيْكَةَ، عَنْ عَائِشَةَ، قَالَتْ لَمَّا مَاتَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ اخْتَلَفُوا فِي اللَّحْدِ وَالشَّقِّ حَتَّى تَكَلَّمُوا فِي ذَلِكَ وَارْتَفَعَتْ أَصْوَاتُهُمْ ‏.‏ فَقَالَ: عُمَرُ لاَ تَصْخَبُوا عِنْدَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ حَيًّا وَلاَ مَيِّتًا أَوْ كَلِمَةً نَحْوَهَا ‏.‏ فَأَرْسَلُوا إِلَى الشَّقَّاقِ وَاللاَّحِدِ جَمِيعًا فَجَاءَ اللاَّحِدُ فَلَحَدَ لِرَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ ثُمَّ دُفِنَ ـ صلى الله عليه وسلم ـ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Aishah said:","text":"“When the Messenger of Allah (ﷺ)\ndied, they differed as to whether his grave should have a niche or a\nditch in the ground, until they spoke and raised their voices\nconcerning that. Then ‘Umar said: ‘Do not shout in the presence\nof the\nMessenger of Allah (ﷺ), living or dead,’ or words to that\neffect. So\nthey sent for both the one who made a niche and the one\nwho dug graves\nwithout a niche, and the one who used to make a niche\ncame and dug a\ngrave with a niche for the Messenger of Allah (ﷺ),\nthen he (ﷺ) was\nburied.”"}},{"id":127,"idInBook":127,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ، حَدَّثَنَا مُوسَى بْنُ عُبَيْدَةَ، حَدَّثَنِي سَعِيدُ بْنُ أَبِي سَعِيدٍ، عَنِ الأَدْرَعِ السُّلَمِيِّ، قَالَ جِئْتُ لَيْلَةً أَحْرُسُ النَّبِيَّ ـ صلى الله عليه وسلم ـ فَإِذَا رَجُلٌ قِرَاءَتُهُ عَالِيَةٌ فَخَرَجَ النَّبِيُّ ـ صلى الله عليه وسلم ـ فَقُلْتُ يَا رَسُولَ اللَّهِ هَذَا مُرَاءٍ ‏.‏ قَالَ فَمَاتَ بِالْمَدِينَةِ فَفَرَغُوا مِنْ جِهَازِهِ فَحَمَلُوا نَعْشَهُ فَقَالَ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏\"‏ ارْفُقُوا بِهِ رَفَقَ اللَّهُ بِهِ إِنَّهُ كَانَ يُحِبُّ اللَّهَ وَرَسُولَهُ ‏\"‏ ‏.‏ قَالَ وَحَفَرَ حُفْرَتَهُ فَقَالَ ‏\"‏ أَوْسِعُوا لَهُ وَسَّعَ اللَّهُ عَلَيْهِ ‏\"‏ ‏.‏ فَقَالَ بَعْضُ أَصْحَابِهِ يَا رَسُولَ اللَّهِ لَقَدْ حَزِنْتَ عَلَيْهِ ‏.‏ فَقَالَ ‏\"‏ أَجَلْ إِنَّهُ كَانَ يُحِبُّ اللَّهَ وَرَسُولَهُ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Adra’ As-Sulami said:","text":"“I came one night to guard\nthe Prophet (ﷺ), and there was a man reciting loudly. The Prophet\n(ﷺ) came out and I said: ‘O Messenger of Allah, this man is\nshowing\noff.’ Then he died in Al-Madinah, and they finished\npreparing him,\nthen they carried his dead body. The Prophet (ﷺ)\nsaid: ‘Be gentle\nwith him, may Allah be gentle with him, for he\nloved Allah and His\nMessenger.’ Then his grave was dug and he (the\nProphet (ﷺ)) said:\n‘Make it spacious for him, and may Allah make\nit spacious for him.’\nSome of his Companions said: ‘O Messenger\nof Allah, you are grieving\nfor him.’ He said: ‘Yes indeed, for he\nloved Allah and His\nMessenger.’”"}},{"id":128,"idInBook":128,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَزْهَرُ بْنُ مَرْوَانَ، حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ سَعِيدٍ، حَدَّثَنَا أَيُّوبُ، عَنْ حُمَيْدِ بْنِ هِلاَلٍ، عَنْ أَبِي الدَّهْمَاءِ، عَنْ هِشَامِ بْنِ عَامِرٍ، قَالَ: قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ احْفِرُوا وَأَوْسِعُوا وَأَحْسِنُوا ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Hisham bin ‘Amir that the Messenger of Allah\n(ﷺ)\nsaid:","text":"“Dig the grave deep, make it spacious and prepare it\nwell.”"}},{"id":129,"idInBook":129,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا الْعَبَّاسُ بْنُ جَعْفَرٍ، حَدَّثَنَا مُحَمَّدُ بْنُ أَيُّوبَ أَبُو هُرَيْرَةَ الْوَاسِطِيُّ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، عَنْ كَثِيرِ بْنِ زَيْدٍ، عَنْ زَيْنَبَ بِنْتِ نُبَيْطٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ أَعْلَمَ قَبْرَ عُثْمَانَ بْنِ مَظْعُونٍ بِصَخْرَةٍ ‏.‏","english":{"narrator":"","text":"It was\nnarrated from Anas bin Malik that the Messenger of Allah (ﷺ)\nmarked\nthe grave of ‘Uthman bin Maz’un with a rock."}},{"id":130,"idInBook":130,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَزْهَرُ بْنُ مَرْوَانَ، وَمُحَمَّدُ بْنُ زِيَادٍ، قَالاَ حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ أَيُّوبَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنْ تَقْصِيصِ الْقُبُورِ ‏.‏","english":{"narrator":"It was\nnarrated that Jabir said:","text":"“The Messenger of Allah (ﷺ)\nforbade\nplastering over graves.”"}},{"id":131,"idInBook":131,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، عَنِ ابْنِ جُرَيْجٍ، عَنْ سُلَيْمَانَ بْنِ مُوسَى، عَنْ جَابِرٍ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ أَنْ يُكْتَبَ عَلَى الْقَبْرِ شَىْءٌ ‏.‏","english":{"narrator":"It was\nnarrated that Jabir said:","text":"“The Messenger of Allah (ﷺ)\nforbade\nwriting anything on graves.”"}},{"id":132,"idInBook":132,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الرَّقَاشِيُّ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ يَزِيدَ بْنِ جَابِرٍ، عَنِ الْقَاسِمِ بْنِ مُخَيْمِرَةَ، عَنْ أَبِي سَعِيدٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ نَهَى أَنْ يُبْنَى عَلَى الْقَبْرِ ‏.‏","english":{"narrator":"","text":"It was\nnarrated from Abu Sa’eed that the Prophet (ﷺ) forbade\nbuilding\nstructures over graves."}},{"id":133,"idInBook":133,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا الْعَبَّاسُ بْنُ الْوَلِيدِ الدِّمَشْقِيُّ، حَدَّثَنَا يَحْيَى بْنُ صَالِحٍ، حَدَّثَنَا سَلَمَةُ بْنُ كُلْثُومٍ، حَدَّثَنَا الأَوْزَاعِيُّ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ صَلَّى عَلَى جِنَازَةٍ ثُمَّ أَتَى قَبْرَ الْمَيِّتِ فَحَثَى عَلَيْهِ مِنْ قِبَلِ رَأْسِهِ ثَلاَثًا ‏.‏","english":{"narrator":"","text":"It was\nnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)\noffered\nthe funeral prayer, then he came to the grave of the deceased\nand\nscattered three handfuls of earth from the side of (the\ndeceased’s)\nhead."}},{"id":134,"idInBook":134,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ لأَنْ يَجْلِسَ أَحَدُكُمْ عَلَى جَمْرَةٍ تُحْرِقُهُ خَيْرٌ لَهُ مِنْ أَنْ يَجْلِسَ عَلَى قَبْرٍ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Abu Hurairah said:","text":"The Messenger of Allah (ﷺ)\nsaid:\n“If one of you were to sit on a live coal that burns him, that\nwould be better for him than if he were to sit on a grave.”"}},{"id":135,"idInBook":135,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ بْنِ سَمُرَةَ، حَدَّثَنَا الْمُحَارِبِيُّ، عَنِ اللَّيْثِ بْنِ سَعْدٍ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ أَبِي الْخَيْرِ، مَرْثَدِ بْنِ عَبْدِ اللَّهِ الْيَزَنِيِّ عَنْ عُقْبَةَ بْنِ عَامِرٍ، قَالَ: قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ لأَنْ أَمْشِيَ عَلَى جَمْرَةٍ أَوْ سَيْفٍ أَوْ أَخْصِفَ نَعْلِي بِرِجْلِي أَحَبُّ إِلَىَّ مِنْ أَنْ أَمْشِيَ عَلَى قَبْرِ مُسْلِمٍ وَمَا أُبَالِي أَوَسَطَ الْقُبُورِ قَضَيْتُ حَاجَتِي أَوْ وَسَطَ السُّوقِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from ‘Uqbah bin ‘Amir that the Messenger of Allah\n(ﷺ)\nsaid:","text":"‘If I were to walk on a live coal or a sword, or if I were\nto\nsew shows to my feet, that would be better for me than walking on\nthe\ngrave of a Muslim. And I see no difference between relieving\nmyself\nin the midst of graves or in the middle of the marketplace.”"}},{"id":136,"idInBook":136,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا الأَسْوَدُ بْنُ شَيْبَانَ، عَنْ خَالِدِ بْنِ سُمَيْرٍ، عَنْ بَشِيرِ بْنِ نَهِيكٍ، عَنْ بَشِيرِ بْنِ الْخَصَاصِيَةِ، قَالَ بَيْنَمَا أَنَا أَمْشِي، مَعَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ فَقَالَ ‏\"‏ يَا ابْنَ الْخَصَاصِيَةِ مَا تَنْقِمُ عَلَى اللَّهِ أَصْبَحْتَ تُمَاشِي رَسُولَ اللَّهِ ‏\"‏ ‏.‏ فَقُلْتُ يَا رَسُولَ اللَّهِ مَا أَنْقِمُ عَلَى اللَّهِ شَيْئًا كُلُّ خَيْرٍ قَدْ أَتَانِيهِ اللَّهُ ‏.‏ فَمَرَّ عَلَى مَقَابِرِ الْمُسْلِمِينَ فَقَالَ ‏\"‏ أَدْرَكَ هَؤُلاَءِ خَيْرًا كَثِيرًا ‏\"‏ ‏.‏ ثُمَّ مَرَّ عَلَى مَقَابِرِ الْمُشْرِكِينَ فَقَالَ ‏\"‏ سَبَقَ هَؤُلاَءِ خَيْرٌ كَثِيرٌ ‏\"‏ ‏.‏ قَالَ فَالْتَفَتَ فَرَأَى رَجُلاً يَمْشِي بَيْنَ الْمَقَابِرِ فِي نَعْلَيْهِ فَقَالَ ‏\"‏ يَا صَاحِبَ السِّبْتِيَّتَيْنِ أَلْقِهِمَا ‏\"‏ ‏.‏ حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ قَالَ كَانَ عَبْدُ اللَّهِ بْنُ عُثْمَانَ يَقُولُ حَدِيثٌ جَيِّدٌ وَرَجُلٌ ثِقَةٌ ‏.‏","english":{"narrator":"It was\nnarrated that Bashir bin Khasasiyyah said:","text":"“While I was\nwalking\nwith the Messenger of Allah (ﷺ) he said: ‘O son of\nKhasasiyyah,\nwhy are you angry with Allah when you are walking with\nthe Messenger\nof Allah?’ I said: ‘O Messenger of Allah! I am not angry\nwith\nAllah at all. Allah has bestowed all good on me.’ Then he passed\nby\nthe graves of the Muslims and said: ‘They have caught up with a\ngreat deal of good.’ Then he passed by the graves of the idolaters\nand\nsaid: ‘They died before a great deal of good came to them.’\nThen he\nturned and saw a man walking between the graves in his shoes\nand he\nsaid: ‘O you with the shoes, take them off.’”   Muhammad bin Bashar narrated from Abdur-Rahman bin Mahdi that he said: Abdullah bin Uthman used to say (about this hadith): \"A good hadith and a reliable narrator.\""}},{"id":137,"idInBook":137,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ، عَنْ يَزِيدَ بْنِ كَيْسَانَ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ زُورُوا الْقُبُورَ فَإِنَّهَا تُذَكِّرُكُمُ الآخِرَةَ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)\nsaid:","text":"“Visit the graves, for they will remind you of the Hereafter.”"}},{"id":138,"idInBook":138,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعِيدٍ الْجَوْهَرِيُّ، حَدَّثَنَا رَوْحٌ، حَدَّثَنَا بِسْطَامُ بْنُ مُسْلِمٍ، قَالَ سَمِعْتُ أَبَا التَّيَّاحِ، قَالَ سَمِعْتُ ابْنَ أَبِي مُلَيْكَةَ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ رَخَّصَ فِي زِيَارَةِ الْقُبُورِ ‏.‏","english":{"narrator":"","text":"It was\nnarrated from ‘Aishah that the Messenger of Allah (ﷺ) gave\npermission for visiting the graves."}},{"id":139,"idInBook":139,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا يُونُسُ بْنُ عَبْدِ الأَعْلَى، حَدَّثَنَا ابْنُ وَهْبٍ، أَنْبَأَنَا ابْنُ جُرَيْجٍ، عَنْ أَيُّوبَ بْنِ هَانِئٍ، عَنْ مَسْرُوقِ بْنِ الأَجْدَعِ، عَنِ ابْنِ مَسْعُودٍ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ كُنْتُ نَهَيْتُكُمْ عَنْ زِيَارَةِ الْقُبُورِ فَزُورُوا الْقُبُورَ فَإِنَّهَا تُزَهِّدُ فِي الدُّنْيَا وَتُذَكِّرُ الآخِرَةَ ‏\"‏ ‏.‏","english":{"narrator":"","text":"It was\nnarrated from Ibn Mas’ud that the Messenger of Allah (ﷺ)\nsaid, “I\nused to forbid you to visit the graves, but now visit them,\nfor they\nwill draw your attention away from this world and remind you\nof the\nHereafter.”"}},{"id":140,"idInBook":140,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ، حَدَّثَنَا يَزِيدُ بْنُ كَيْسَانَ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ زَارَ النَّبِيُّ ـ صلى الله عليه وسلم ـ قَبْرَ أُمِّهِ فَبَكَى وَأَبْكَى مَنْ حَوْلَهُ فَقَالَ: ‏\n\"‏ اسْتَأْذَنْتُ رَبِّي فِي أَنْ أَسْتَغْفِرَ لَهَا فَلَمْ يَأْذَنْ لِي وَاسْتَأْذَنْتُ رَبِّي فِي أَنْ أَزُورَ قَبْرَهَا فَأَذِنَ لِي فَزُورُوا الْقُبُورَ فَإِنَّهَا تُذَكِّرُكُمُ الْمَوْتَ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Abu Hurairah said:","text":"“The Prophet (ﷺ) visited\nthe\ngrave of his mother and wept, causing the people around him to\nweep.\nThen he said: ‘I asked my Lord for permission to seek\nforgiveness\nfor her, but He did not give me permission. Then I asked\nmy Lord for\npermission to visit her grave and He gave me permission.\nSo visit the\ngraves, for they will remind you of death.’”"}},{"id":141,"idInBook":141,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ بْنِ الْبَخْتَرِيِّ الْوَاسِطِيُّ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، عَنْ إِبْرَاهِيمَ بْنِ سَعْدٍ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، قَالَ جَاءَ أَعْرَابِيٌّ إِلَى النَّبِيِّ ـ صلى الله عليه وسلم ـ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ أَبِي كَانَ يَصِلُ الرَّحِمَ وَكَانَ وَكَانَ. فَأَيْنَ هُوَ قَالَ ‏\"‏ فِي النَّارِ ‏\"‏ ‏.‏ قَالَ فَكَأَنَّهُ وَجَدَ مِنْ ذَلِكَ فَقَالَ يَا رَسُولَ اللَّهِ فَأَيْنَ أَبُوكَ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ حَيْثُمَا مَرَرْتَ بِقَبْرِ كَافِرٍ فَبَشِّرْهُ بِالنَّارِ ‏\"‏ ‏.‏ قَالَ فَأَسْلَمَ الأَعْرَابِيُّ بَعْدُ وَقَالَ لَقَدْ كَلَّفَنِي رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ تَعَبًا مَا مَرَرْتُ بِقَبْرِ كَافِرٍ إِلاَّ بَشَّرْتُهُ بِالنَّارِ ‏.‏","english":{"narrator":"It was\nnarrated from Salim that his father said:","text":"“A Bedouin came to\nthe\nProphet (ﷺ) and said: ‘O Messenger of Allah, my father used to\nuphold the ties of kinship, and so and so forth, where is he?’ He\nsaid: ‘In the Fire.’ It was as if he found that difficult to\nbear.\nThen he said: ‘O Messenger of Allah. Where is your father?’\nThe\nMessenger of Allah (ﷺ) said: ‘Whenever you pass by the grave\nof an\nidolater, give him the tidings of Hell-fire.’ The Bedouin\nlater became\nMuslim, and he said: ‘The Messenger of Allah (ﷺ)\ngave me a difficult\ntask. I never passed the grave of an idolater but\nI gave him the\ntidings of Hell-fire.’”"}},{"id":142,"idInBook":142,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو بِشْرٍ قَالاَ حَدَّثَنَا قَبِيصَةُ، ح: وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا عُبَيْدُ بْنُ سَعِيدٍ، ح: وَحَدَّثَنَا مُحَمَّدُ بْنُ خَلَفٍ الْعَسْقَلاَنِيُّ، حَدَّثَنَا الْفِرْيَابِيُّ، وَقَبِيصَةُ، كُلُّهُمْ عَنْ سُفْيَانَ، عَنْ عَبْدِ اللَّهِ بْنِ عُثْمَانَ بْنِ خُثَيْمٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ بَهْمَانَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ حَسَّانَ بْنِ ثَابِتٍ، عَنْ أَبِيهِ، قَالَ: لَعَنَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ زُوَّارَاتِ الْقُبُورِ ‏.‏","english":{"narrator":"It was\nnarrated from ‘Abdur-Rahman bin Hassan bin Thabit that his\nfather\nsaid:","text":"“The Messenger of Allah (ﷺ) cursed women who visit\ngraves.”"}},{"id":143,"idInBook":143,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَزْهَرُ بْنُ مَرْوَانَ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا مُحَمَّدُ بْنُ جُحَادَةَ، عَنْ أَبِي صَالِحٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ: لَعَنَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ زُوَّارَاتِ الْقُبُورِ ‏.‏","english":{"narrator":"It was\nnarrated that Ibn ‘Abbas said:","text":"“The Messenger of Allah (ﷺ)\ncursed women who visit graves.”"}},{"id":144,"idInBook":144,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ خَلَفٍ الْعَسْقَلاَنِيُّ أَبُو نَصْرٍ، حَدَّثَنَا مُحَمَّدُ بْنُ طَالِبٍ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عُمَرَ بْنِ أَبِي سَلَمَةَ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: لَعَنَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ زُوَّارَاتِ الْقُبُورِ ‏.‏","english":{"narrator":"It was\nnarrated that Abu Hurairah said:","text":"“The Messenger of Allah (ﷺ)\ncursed women who visit graves.”"}},{"id":145,"idInBook":145,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ حَفْصَةَ، عَنْ أُمِّ عَطِيَّةَ، قَالَتْ: نُهِينَا عَنِ اتِّبَاعِ الْجَنَائِزِ، وَلَمْ يُعْزَمْ عَلَيْنَا ‏.‏","english":{"narrator":"It was\nnarrated that Umm ‘Atiyyah said:","text":"“We were prevented from\nfollowing the funeral, but that was not made binding on us.”"}},{"id":146,"idInBook":146,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى الْحِمْصِيُّ، حَدَّثَنَا أَحْمَدُ بْنُ خَالِدٍ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ إِسْمَاعِيلَ بْنِ سَلْمَانَ، عَنْ دِينَارٍ أَبِي عُمَرَ، عَنِ ابْنِ الْحَنَفِيَّةِ، عَنْ عَلِيٍّ، قَالَ خَرَجَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ فَإِذَا نِسْوَةٌ جُلُوسٌ فَقَالَ ‏\"‏ مَا يُجْلِسُكُنَّ ‏\"‏ ‏.‏ قُلْنَ نَنْتَظِرُ الْجِنَازَةَ ‏.‏ قَالَ ‏\"‏ هَلْ تَغْسِلْنَ ‏\"‏ ‏.‏ قُلْنَ لاَ ‏.‏ قَالَ ‏\"‏ هَلْ تَحْمِلْنَ ‏\"‏ ‏.‏ قُلْنَ لاَ ‏.‏ قَالَ ‏\"‏ هَلْ تُدْلِينَ فِيمَنْ يُدْلِي ‏\"‏ ‏.‏ قُلْنَ لاَ ‏.‏ قَالَ ‏\"‏ فَارْجِعْنَ مَأْزُورَاتٍ غَيْرَ مَأْجُورَاتٍ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Ali said:","text":"“The Messenger of Allah (ﷺ) went\nout\nand saw some women sitting, and he said: ‘What are you sitting\nhere\nfor?’ They said: ‘We are waiting for the funeral.’ He said:\n‘Are\nyou going to wash the deceased?’ They said: ‘No.’ He\nsaid: ‘Are you\ngoing to lower him into the grave?’ They said:\n‘No.’ He said: ‘Then go\nback with a burden of sin and not\nrewarded.’”"}},{"id":147,"idInBook":147,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ، مَوْلَى الصَّهْبَاءِ عَنْ شَهْرِ بْنِ حَوْشَبٍ، عَنْ أُمِّ سَلَمَةَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ ‏{وَلاَ يَعْصِينَكَ فِي مَعْرُوفٍ}‏ قَالَ: ‏\"‏ النَّوْحُ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Umm Salamah from the Prophet (ﷺ) regarding:","text":"“And\nthat they will not disobey you in Ma’ruf (all that is good in\nIslam);” he said: “(It is about) wailing.”"}},{"id":148,"idInBook":148,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دِينَارٍ، حَدَّثَنَا حَرِيزٌ، مَوْلَى مُعَاوِيَةَ قَالَ خَطَبَ مُعَاوِيَةُ بِحِمْصَ فَذَكَرَ فِي خُطْبَتِهِ أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ نَهَى عَنِ النَّوْحِ ‏.‏","english":{"narrator":"Jarir,\nthe freed slave of Mu’awiyah, said:","text":"“Mu’awiyah delivered a\nsermon in Hims, and in his sermon he mentioned that the Messenger of\nAllah (ﷺ) forbade wailing.”"}},{"id":149,"idInBook":149,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا الْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ الْعَنْبَرِيُّ، وَمُحَمَّدُ بْنُ يَحْيَى، قَالاَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَنْبَأَنَا مَعْمَرٌ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنِ ابْنِ مُعَانِقٍ، عَنْ أَبِي مَالِكٍ الأَشْعَرِيِّ، قَالَ: قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ النِّيَاحَةُ مِنْ أَمْرِ الْجَاهِلِيَّةِ وَإِنَّ النَّائِحَةَ إِذَا مَاتَتْ وَلَمْ تَتُبْ قَطَعَ اللَّهُ لَهَا ثِيَابًا مِنْ قَطِرَانٍ وَدِرْعًا مِنْ لَهَبِ النَّارِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Abu Malik Ash’ari that the Messenger of Allah\n(ﷺ)\nsaid:","text":"‘Wailing is one of the affairs of the Days of Ignorance,\nand\nif the woman who wails dies without having repented, Allah will\ncut a\ngarment of pitch (tar) for her and a shirt of flaming fire.’”"}},{"id":150,"idInBook":150,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا عُمَرُ بْنُ رَاشِدٍ الْيَمَامِيُّ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ: قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ النِّيَاحَةُ عَلَى الْمَيِّتِ مِنْ أَمْرِ الْجَاهِلِيَّةِ فَإِنَّ النَّائِحَةَ إِنْ لَمْ تَتُبْ قَبْلَ أَنْ تَمُوتَ فَإِنَّهَا تُبْعَثُ يَوْمَ الْقِيَامَةِ عَلَيْهَا سَرَابِيلُ مِنْ قَطِرَانٍ ثُمَّ يُعْلَى عَلَيْهَا بِدُرُوعٍ مِنْ لَهَبِ النَّارِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Ibn ‘Abbas that the Messenger of Allah (ﷺ)\nsaid:","text":"“Wailing over the dead is one of the affairs of the Days of\nIgnorance and if the woman who wails does not repent before she dies,\nshe will be resurrected on the Day of Resurrection wearing a shirt of\npitch (tar), over which she will wear a shirt of flaming fire.”"}},{"id":151,"idInBook":151,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ يُوسُفَ، حَدَّثَنَا عُبَيْدُ اللَّهِ، أَنْبَأَنَا إِسْرَائِيلُ، عَنْ أَبِي يَحْيَى، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عُمَرَ، قَالَ: نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ أَنْ تُتْبَعَ جِنَازَةٌ مَعَهَا رَانَّةٌ ‏.‏","english":{"narrator":"It was\nnarrated that Ibn ‘Umar said:","text":"“The Messenger of Allah (ﷺ)\nforbade following a funeral that was accompanied by a wailing woman.”"}},{"id":152,"idInBook":152,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، وَعَبْدُ الرَّحْمَنِ، جَمِيعًا عَنْ سُفْيَانَ، عَنْ زُبَيْدٍ، عَنْ إِبْرَاهِيمَ، عَنْ مَسْرُوقٍ، ح وَحَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، وَأَبُو بَكْرِ بْنُ خَلاَّدٍ قَالاَ: حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا الأَعْمَشُ، عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ، عَنْ مَسْرُوقٍ، عَنْ عَبْدِ اللَّهِ، قَالَ: قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ لَيْسَ مِنَّا مَنْ شَقَّ الْجُيُوبَ وَضَرَبَ الْخُدُودَ وَدَعَا بِدَعْوَى الْجَاهِلِيَّةِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from ‘Abdullah that the Messenger of Allah (ﷺ)\nsaid:","text":"“He\nis not one of us who tears his garments, strikes his cheeks,\nand\ncries with the cry of the Days of Ignorance.’”"}},{"id":153,"idInBook":153,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ جَابِرٍ الْمُحَارِبِيُّ، وَمُحَمَّدُ بْنُ كَرَامَةَ، قَالاَ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ بْنِ جَابِرٍ، عَنْ مَكْحُولٍ، وَالْقَاسِمِ، عَنْ أَبِي أُمَامَةَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ لَعَنَ الْخَامِشَةَ وَجْهَهَا وَالشَّاقَّةَ جَيْبَهَا وَالدَّاعِيَةَ بِالْوَيْلِ وَالثُّبُورِ ‏.‏","english":{"narrator":"","text":"It was\nnarrated from Abu Umamah that the Messenger of Allah (ﷺ)\ncursed the\nwoman who scratches her face and rends her garment and\ncries that she\nis doomed (i.e. because of the death of this person)."}},{"id":154,"idInBook":154,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ عُثْمَانَ بْنِ حَكِيمٍ الأَوْدِيُّ، حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ، عَنْ أَبِي الْعُمَيْسِ، قَالَ سَمِعْتُ أَبَا صَخْرَةَ، يَذْكُرُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ، وَأَبِي، بُرْدَةَ قَالاَ: لَمَّا ثَقُلَ أَبُو مُوسَى أَقْبَلَتِ امْرَأَتُهُ أُمُّ عَبْدِ اللَّهِ تَصِيحُ بِرَنَّةٍ فَأَفَاقَ فَقَالَ لَهَا: أَوَ مَا عَلِمْتِ أَنِّي بَرِيءٌ مِمَّنْ بَرِئَ مِنْهُ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ وَكَانَ يُحَدِّثُهَا أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ: ‏\n\"‏ أَنَا بَرِيءٌ مِمَّنْ حَلَقَ وَسَلَقَ وَخَرَقَ ‏\"‏ ‏.‏","english":{"narrator":"‘Abdur-Rahman bin Yazid and Abu Burdah said:","text":"“When Abu Musa fell\nsick, his wife Umm ‘Abdullah started to wail loudly. He woke up and\nsaid to her: ‘Do you not know that I am innocent of those whom the\nMessenger of Allah (ﷺ) declared innocence of?’ And he told her\nthat\nthe Messenger of Allah (ﷺ) said: ‘I am innocent of those who\nshave\ntheir heads, raise their voices and tear their garments (at\ntimes of\ncalamity).’”"}},{"id":155,"idInBook":155,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا وَكِيعٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ وَهْبِ بْنِ كَيْسَانَ، عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَطَاءٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ كَانَ فِي جِنَازَةٍ فَرَأَى عُمَرُ امْرَأَةً فَصَاحَ بِهَا فَقَالَ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏\n\"‏ دَعْهَا يَا عُمَرُ فَإِنَّ الْعَيْنَ دَامِعَةٌ وَالنَّفْسَ مُصَابَةٌ وَالْعَهْدَ قَرِيبٌ ‏\"‏ ‏.‏ \nحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَفَّانُ، عَنْ حَمَّادِ بْنِ سَلَمَةَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ وَهْبِ بْنِ كَيْسَانَ، عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَطَاءٍ، عَنْ سَلَمَةَ بْنِ الأَزْرَقِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ بِنَحْوِهِ ‏.‏","english":{"narrator":"","text":"It was\nnarrated from Abu Hurairah that the Prophet (ﷺ) was\nattending a\nfuneral. ‘Umar saw a woman and shouted at her, but the\nProphet\n(ﷺ) said, “Leave her alone, O ‘Umar, for the eye weeps and\nthe\nheart is afflicted, and the bereavement is recent.”"}},{"id":156,"idInBook":156,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي الشَّوَارِبِ، حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، حَدَّثَنَا عَاصِمٌ الأَحْوَلُ، عَنْ أَبِي عُثْمَانَ، عَنْ أُسَامَةَ بْنِ زَيْدٍ، قَالَ كَانَ ابْنٌ لِبَعْضِ بَنَاتِ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ يَقْضِي فَأَرْسَلَتْ إِلَيْهِ أَنْ يَأْتِيَهَا فَأَرْسَلَ إِلَيْهَا أَنَّ ‏\"‏ لِلَّهِ مَا أَخَذَ وَلَهُ مَا أَعْطَى وَكُلُّ شَىْءٍ عِنْدَهُ إِلَى أَجَلٍ مُسَمًّى فَلْتَصْبِرْ وَلْتَحْتَسِبْ ‏\"‏ ‏.‏ فَأَرْسَلَتْ إِلَيْهِ فَأَقْسَمَتْ عَلَيْهِ فَقَامَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ وَقُمْتُ مَعَهُ وَمَعَهُ مُعَاذُ بْنُ جَبَلٍ وَأُبَىُّ بْنُ كَعْبٍ وَعُبَادَةُ بْنُ الصَّامِتِ فَلَمَّا دَخَلْنَا نَاوَلُوا الصَّبِيَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ وَرُوحُهُ تَقَلْقَلُ فِي صَدْرِهِ ‏.‏ قَالَ حَسِبْتُهُ قَالَ كَأَنَّهُ شَنَّةٌ ‏.‏ قَالَ فَبَكَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ فَقَالَ لَهُ عُبَادَةُ بْنُ الصَّامِتِ: مَا هَذَا يَا رَسُولَ اللَّهِ؟ قَالَ: ‏\"‏ الرَّحْمَةُ الَّتِي جَعَلَهَا اللَّهُ فِي بَنِي آدَمَ وَإِنَّمَا يَرْحَمُ اللَّهُ مِنْ عِبَادِهِ الرُّحَمَاءَ ‏\"‏ ‏.‏","english":{"narrator":"Usamah\nbin Zaid said:","text":"“The son of one of the daughters of the\nMessenger of\nAllah (ﷺ) was dying. She sent for him, asking him to\ncome to her,\nand he sent word to her, saying: ‘To Allah belongs what\nHe has\ntaken and to Him belongs what He has given. Everything has an\nappointed time with Him, so be patient and seek reward.’ But she\nsent\nfor him again, adjuring him to come. So the Messenger of Allah\n(ﷺ)\ngot up, and I got up with him, as did Mu’adh bin Jabal, Ubayy\nbin Ka’b\nand ‘Ubadah bin Samit. When we entered they handed the\nchild to the\nMessenger of Allah (ﷺ), and his soul was rattling in\nhis chest.” I\nthink he was that it was like a water skin. “The\nMessenger of Allah\n(ﷺ) wept, and ‘Ubadah bin Samit said to him:\n‘What is this, O\nMessenger of Allah?’ He said: ‘It is\ncompassion which Allah has\ncreated in the son of Adam. Allah only\nshows mercy to those of His\nslaves who are compassionate.’”"}},{"id":157,"idInBook":157,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا يَحْيَى بْنُ سُلَيْمٍ، عَنِ ابْنِ خُثَيْمٍ، عَنْ شَهْرِ بْنِ حَوْشَبٍ، عَنْ أَسْمَاءَ بِنْتِ يَزِيدَ، قَالَتْ لَمَّا تُوُفِّيَ ابْنُ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ إِبْرَاهِيمُ بَكَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ فَقَالَ لَهُ الْمُعَزِّي - إِمَّا أَبُو بَكْرٍ وَإِمَّا عُمَرُ - أَنْتَ أَحَقُّ مَنْ عَظَّمَ اللَّهَ حَقَّهُ ‏.‏ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ تَدْمَعُ الْعَيْنُ وَيَحْزَنُ الْقَلْبُ وَلاَ نَقُولُ مَا يُسْخِطُ الرَّبَّ لَوْلاَ أَنَّهُ وَعْدٌ صَادِقٌ وَمَوْعُودٌ جَامِعٌ وَأَنَّ الآخِرَ تَابِعٌ لِلأَوَّلِ لَوَجَدْنَا عَلَيْكَ يَا إِبْرَاهِيمُ أَفْضَلَ مِمَّا وَجَدْنَا وَإِنَّا بِكَ لَمَحْزُونُونَ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Asma’ bint Yazid said:","text":"“When Ibrahim, the son of\nthe Messenger of Allah (ﷺ), died, the Messenger of Allah (ﷺ)\nwept.\nThe one who was consoling him, either Abu Bakr or ‘Umar, said\nto him:\n‘You are indeed the best of those who glorify Allah with\nwhat is due\nto him.’ The Messenger of Allah (ﷺ) said: ‘The eye\nweeps and the\nheart grieves, but we do not say anything that angers\nthe Lord. Were\nit not that death is something that inevitably comes\nto all, and that\nthe latter will surely join the former, then we\nwould have been more\nthan we are, verily we grieve for you.’”"}},{"id":158,"idInBook":158,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا إِسْحَاقُ بْنُ مُحَمَّدٍ الْفَرْوِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ، عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ جَحْشٍ، عَنْ أَبِيهِ، عَنْ حَمْنَةَ بِنْتِ جَحْشٍ، أَنَّهُ قِيلَ لَهَا قُتِلَ أَخُوكِ ‏.‏ فَقَالَتْ رَحِمَهُ اللَّهُ وَإِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ ‏.‏ قَالُوا قُتِلَ زَوْجُكِ ‏.‏ قَالَتْ وَاحُزْنَاهُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ إِنَّ لِلزَّوْجِ مِنَ الْمَرْأَةِ لَشُعْبَةً مَا هِيَ لِشَىْءٍ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Hamnah bint Jahsh that it was said to her:","text":"“Your\nbrother has been killed.” She said: “May Allah have mercy on him.\nInna\nlillahi wa inna ilayhi raji’un (Truly, to Allah we belong and\ntruly,\nto Him we shall return).” They said: “Your husband has\nbeen killed.”\nShe said: “O grief!” The Messenger of Allah (ﷺ)\nsaid: “The woman has\na strong love for her husband, which she does\nnot have for anything\nelse.”"}},{"id":159,"idInBook":159,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الْمِصْرِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَنْبَأَنَا أُسَامَةُ بْنُ زَيْدٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ مَرَّ بِنِسَاءِ عَبْدِ الأَشْهَلِ يَبْكِينَ هَلْكَاهُنَّ يَوْمَ أُحُدٍ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ لَكِنَّ حَمْزَةَ لاَ بَوَاكِيَ لَهُ ‏\"‏ ‏.‏ فَجَاءَ نِسَاءُ الأَنْصَارِ يَبْكِينَ حَمْزَةَ فَاسْتَيْقَظَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ فَقَالَ ‏\"‏ وَيْحَهُنَّ مَا انْقَلَبْنَ بَعْدُ؟ مُرُوهُنَّ فَلْيَنْقَلِبْنَ وَلاَ يَبْكِينَ عَلَى هَالِكٍ بَعْدَ الْيَوْمِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Ibn ‘Umar that the Messenger of Allah (ﷺ)\npassed by\nsome women of ‘Abdul-Ashhal who were weeping for their slain\non the\nDay of Uhud. The Messenger of Allah (ﷺ) said:","text":"“But there is\nno\none to weep for Hamzah.” So the women of Ansar started to weep for\nHamzah. The Messenger of Allah (ﷺ) woke up and said, ‘Woe to\nthem,\nhave they not gone home yet? Tell them to go home and not to\nweep for\nanyone who dies after this day.’”"}},{"id":160,"idInBook":160,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا سُفْيَانُ، عَنْ إِبْرَاهِيمَ الْهَجَرِيِّ، عَنِ ابْنِ أَبِي أَوْفَى، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنِ الْمَرَاثِي ‏.‏","english":{"narrator":"It was\nnarrated that Ibn Abi Awfa said:","text":"“The Messenger of Allah (ﷺ)\nforbade eulogies.”"}},{"id":161,"idInBook":161,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا شَاذَانُ، ح: وَحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، وَمُحَمَّدُ بْنُ الْوَلِيدِ، قَالاَ: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، ح: وَحَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ، حَدَّثَنَا عَبْدُ الصَّمَدِ، وَوَهْبُ بْنُ جَرِيرٍ، قَالُوا: حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنِ ابْنِ عُمَرَ، عَنْ عُمَرَ بْنِ الْخَطَّابِ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ: ‏\n\"‏ الْمَيِّتُ يُعَذَّبُ بِمَا نِيحَ عَلَيْهِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from ‘Umar bin Khattab that the Prophet (ﷺ) said:","text":"“The\ndeceased is punished for the wailing over him.”"}},{"id":162,"idInBook":162,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ الدَّرَاوَرْدِيُّ، حَدَّثَنَا أَسِيدُ بْنُ أَبِي أَسِيدٍ، عَنْ مُوسَى بْنِ أَبِي مُوسَى الأَشْعَرِيِّ، عَنْ أَبِيهِ، ‏.‏ أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ الْمَيِّتُ يُعَذَّبُ بِبُكَاءِ الْحَىِّ إِذَا قَالُوا وَاعَضُدَاهْ وَاكَاسِيَاهْ ‏.‏ وَانَاصِرَاهْ وَاجَبَلاَهْ وَنَحْوَ هَذَا - يُتَعْتَعُ وَيُقَالُ أَنْتَ كَذَلِكَ أَنْتَ كَذَلِكَ ‏\"‏ ‏.‏ قَالَ أَسِيدٌ فَقُلْتُ سُبْحَانَ اللَّهِ إِنَّ اللَّهَ يَقُولُ ‏{وَلاَ تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَى }‏ ‏.‏ قَالَ وَيْحَكَ أُحَدِّثُكَ أَنَّ أَبَا مُوسَى حَدَّثَنِي عَنْ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ فَتَرَى أَنَّ أَبَا مُوسَى كَذَبَ عَلَى النَّبِيِّ ـ صلى الله عليه وسلم ـ أَوْ تَرَى أَنِّي كَذَبْتُ عَلَى أَبِي مُوسَى؟","english":{"narrator":"It was\nnarrated from Asid bin Abu Asid, from Musa bin Abu Musa Ash’ari,\nfrom his father that the Prophet (ﷺ) said:","text":"“The deceased is\npunished for the weeping of the living. If they say: ‘O my\nstrength, O he who clothed us, O my help, O my rock,’ and so on, he\nis rebuked and it is said: ‘Were you really like that? Were you\nreally like that?’” Asid said: \"I said: 'Subhan-Allah! Allah says: \"And no bearer of burdens shall another's burden (35:18).\" He said: \"Woe to you, I tell you that Abu Musa narrated to me from the Messenger of Allah (ﷺ), and you think that Abu Musa was telling lies about the Prophet (ﷺ)? Or do you think that I am telling lies about Abu Musa?\""}},{"id":163,"idInBook":163,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرٍو، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنْ عَائِشَةَ، قَالَتْ إِنَّمَا كَانَتْ يَهُودِيَّةٌ مَاتَتْ. فَسَمِعَهُمُ النَّبِيُّ ـ صلى الله عليه وسلم ـ يَبْكُونَ عَلَيْهَا قَالَ: ‏\n\"‏ فَإِنَّ أَهْلَهَا يَبْكُونَ عَلَيْهَا وَإِنَّهَا تُعَذَّبُ فِي قَبْرِهَا ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Aishah said:","text":"“A Jewish woman had died, and the\nProphet (ﷺ) heard the weeping for her. He said: ‘Her family is\nweeping for her, and she is being punished in her grave.’”"}},{"id":164,"idInBook":164,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ سَعْدِ بْنِ سِنَانٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ: قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ إِنَّمَا الصَّبْرُ عِنْدَ الصَّدْمَةِ الأُولَى ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Anas bin Malik that the Messenger of Allah (ﷺ)\nsaid:","text":"\"Patience should come with the first shock.\""}},{"id":165,"idInBook":165,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ، حَدَّثَنَا ثَابِتُ بْنُ عَجْلاَنَ، عَنِ الْقَاسِمِ، عَنْ أَبِي أُمَامَةَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ: ‏\n\"‏ يَقُولُ اللَّهُ سُبْحَانَهُ: ابْنَ آدَمَ إِنْ صَبَرْتَ وَاحْتَسَبْتَ عِنْدَ الصَّدْمَةِ الأُولَى لَمْ أَرْضَ لَكَ ثَوَابًا دُونَ الْجَنَّةِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Abu Umamah that the Prophet (ﷺ) said:","text":"“Allah\nsays:\n‘O son of Adam! If you are patient and seek reward at the moment\nof\nfirst shock, I will not approve of any reward for you less than\nParadise.’”"}},{"id":166,"idInBook":166,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَنْبَأَنَا عَبْدُ الْمَلِكِ بْنُ قُدَامَةَ الْجُمَحِيُّ، عَنْ أَبِيهِ، عَنْ عُمَرَ بْنِ أَبِي سَلَمَةَ، عَنْ أُمِّ سَلَمَةَ، أَنَّ أَبَا سَلَمَةَ، حَدَّثَهَا أَنَّهُ، سَمِعَ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ: ‏\n\"‏ مَا مِنْ مُسْلِمٍ يُصَابُ بِمُصِيبَةٍ فَيَفْزَعُ إِلَى مَا أَمَرَ اللَّهُ بِهِ مِنْ قَوْلِهِ: إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ اللَّهُمَّ عِنْدَكَ احْتَسَبْتُ مُصِيبَتِي فَأْجُرْنِي فِيهَا وَعُضْنِي مِنْهَا - إِلاَّ آجَرَهُ اللَّهُ عَلَيْهَا وَعَاضَهُ خَيْرًا مِنْهَا ‏\"‏ ‏.‏ قَالَتْ: فَلَمَّا تُوُفِّيَ أَبُو سَلَمَةَ ذَكَرْتُ الَّذِي حَدَّثَنِي عَنْ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ فَقُلْتُ: إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ اللَّهُمَّ عِنْدَكَ احْتَسَبْتُ مُصِيبَتِي هَذِهِ فَأْجُرْنِي عَلَيْهَا ‏.‏ فَإِذَا أَرَدْتُ أَنْ أَقُولَ وَعُضْنِي خَيْرًا مِنْهَا قُلْتُ فِي نَفْسِي: أُعَاضُ خَيْرًا مِنْ أَبِي سَلَمَةَ ؟ ثُمَّ قُلْتُهَا فَعَاضَنِي اللَّهُ مُحَمَّدًا ـ صلى الله عليه وسلم ـ ‏.‏ وَآجَرَنِي فِي مُصِيبَتِي ‏.‏","english":{"narrator":"It was\nnarrated from Umm Salamah that Abu Salamah told her that he\nheard the\nMessenger of Allah (ﷺ) say:","text":"“There is no Muslim who is\nstricken\nwith a calamity and reacts by saying as Allah has commanded:\n‘Inna\nlillahi, wa inna ilayhi raji’un. Allahumma indaka ahtasabtu\nmusibati, fajurni fiha, wa ‘awwidni minha (Truly, to Allah we belong\nand truly, to Him we shall return. O Allah, with You I seek reward\nfor\nmy calamity, so reward me for it and compensate me),’ but Allah\nwill\nreward him for that and compensate him with something better\nthan it.”\nShe said: “When Abu Salamah died, I remembered what he\nhad told me\nfrom the Messenger of Allah (ﷺ) and I said: ‘Inna\nlillahi, wa inna\nilayhi raji’un. Allahumma indaka ahtasabtu\nmusibati, fajurni alaiha\n(Truly, to Allah we belong and truly, to Him\nwe shall return. O Allah,\nwith You I seek reward for my calamity, so\nreward me for it).’ But\nwhen I wanted to say wa ‘awwidni minha\n(and compensate me with\nbetter), I said to myself: ‘How can I be\ncompensated with something\nbetter than Abu Salamah?’ Then I said\nit, and Allah compensated me\nwith Muhammad (ﷺ) and rewarded me for\nmy calamity.”"}},{"id":167,"idInBook":167,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا الْوَلِيدُ بْنُ عَمْرِو بْنِ السُّكَيْنِ، حَدَّثَنَا أَبُو هَمَّامٍ، حَدَّثَنَا مُوسَى بْنُ عُبَيْدَةَ، حَدَّثَنَا مُصْعَبُ بْنُ مُحَمَّدٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ، قَالَتْ فَتَحَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ بَابًا بَيْنَهُ وَبَيْنَ النَّاسِ أَوْ كَشَفَ سِتْرًا فَإِذَا النَّاسُ يُصَلُّونَ وَرَاءَ أَبِي بَكْرٍ فَحَمِدَ اللَّهَ عَلَى مَا رَأَى مِنْ حُسْنِ حَالِهِمْ رَجَاءَ أَنْ يَخْلُفَهُ اللَّهُ فِيهِمْ بِالَّذِي رَآهُمْ فَقَالَ ‏\n\"‏ يَا أَيُّهَا النَّاسُ أَيُّمَا أَحَدٍ مِنَ النَّاسِ أَوْ مِنَ الْمُؤْمِنِينَ أُصِيبَ بِمُصِيبَةٍ فَلْيَتَعَزَّ بِمُصِيبَتِهِ بِي عَنِ الْمُصِيبَةِ الَّتِي تُصِيبُهُ بِغَيْرِي فَإِنَّ أَحَدًا مِنْ أُمَّتِي لَنْ يُصَابَ بِمُصِيبَةٍ بَعْدِي أَشَدَّ عَلَيْهِ مِنْ مُصِيبَتِي ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Aishah said:","text":"“The Messenger of Allah (ﷺ)\nopened\na door that was between him and the people or drew back a\ncurtain and\nhe saw the people praying behind Abu Bakr. He praised\nAllah for what\nhe saw of their good situation and hoped that Allah\nsucceed him by\nwhat he saw in them.* He said: ‘O people, whoever among\nthe people\nor among the believers is stricken with a calamity, then\nlet him\nconsole himself with the loss of me, for no one among my\nnation will\nbe stricken with any calamity worse than my loss.’”"}},{"id":168,"idInBook":168,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعُ بْنُ الْجَرَّاحِ، عَنْ هِشَامِ بْنِ زِيَادٍ، عَنْ أُمِّهِ، عَنْ فَاطِمَةَ بِنْتِ الْحُسَيْنِ، عَنْ أَبِيهَا، قَالَ قَالَ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏\n\"‏ مَنْ أُصِيبَ بِمُصِيبَةٍ فَذَكَرَ مُصِيبَتَهُ فَأَحْدَثَ اسْتِرْجَاعًا - وَإِنْ تَقَادَمَ عَهْدُهَا - كَتَبَ اللَّهُ لَهُ مِنَ الأَجْرِ مِثْلَهُ يَوْمَ أُصِيبَ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Fatimah bint Husain that her father said:","text":"The\nProphet\n(ﷺ) said: “Whoever was stricken with a calamity and when he\nremembers it he says ‘Inna lillahi, wa inna ilayhi raji’un\n(Truly, to\nAllah we belong and truly, to Him we shall return),’\neven though it\nhappened a long time ago, Allah will record for him a\nreward like that\nof the day it befell him.”"}},{"id":169,"idInBook":169,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، حَدَّثَنِي قَيْسٌ أَبُو عُمَارَةَ، مَوْلَى الأَنْصَارِ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، يُحَدِّثُ عَنْ أَبِيهِ، عَنْ جَدِّهِ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ أَنَّهُ قَالَ ‏\n\"‏ مَا مِنْ مُؤْمِنٍ يُعَزِّي أَخَاهُ بِمُصِيبَةٍ إِلاَّ كَسَاهُ اللَّهُ سُبْحَانَهُ مِنْ حُلَلِ الْكَرَامَةِ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏","english":{"narrator":"Qais,\nAbu ‘Umarah, the freed slave of the Ansar, said:","text":"“I heard\n‘Abdullah bin Abu Bakr bin Muhammad bin ‘Amr bin Hazm narrating\nfrom\nhis father, from his grandfather, that the Prophet (ﷺ) said:\n‘There\nis no believer who consoles for his brother for a calamity,\nbut Allah\nwill clothe him with garments of honor on the Day of\nResurrection.’”"}},{"id":170,"idInBook":170,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ، قَالَ حَدَّثَنَا عَلِيُّ بْنُ عَاصِمٍ، عَنْ مُحَمَّدِ بْنِ سُوقَةَ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ مَنْ عَزَّى مُصَابًا فَلَهُ مِثْلُ أَجْرِهِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Abdullah said:","text":"“The Messenger of Allah (ﷺ)\nsaid:\n‘Whoever consoles a person stricken by calamity will have a\nreward\nequal to his.’”"}},{"id":171,"idInBook":171,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ لاَ يَمُوتُ لِرَجُلٍ ثَلاَثَةٌ مِنَ الْوَلَدِ فَيَلِجَ النَّارَ إِلاَّ تَحِلَّةَ الْقَسَمِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Abu Hurairah that the Prophet (ﷺ) said:","text":"“No\nman who\nloses three of his children will ever enter the Fire, except\nin\nfulfillment of the oath (of Allah).”*"}},{"id":172,"idInBook":172,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، قَالَ حَدَّثَنَا إِسْحَاقُ بْنُ سُلَيْمَانَ، حَدَّثَنَا حَرِيزُ بْنُ عُثْمَانَ، عَنْ شُرَحْبِيلَ بْنِ شُفْعَةَ، قَالَ لَقِيَنِي عُتْبَةُ بْنُ عَبْدٍ السُّلَمِيُّ فَقَالَ: سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ: ‏\n\"‏ مَا مِنْ مُسْلِمٍ يَمُوتُ لَهُ ثَلاَثَةٌ مِنَ الْوَلَدِ لَمْ يَبْلُغُوا الْحِنْثَ إِلاَّ تَلَقَّوْهُ مِنْ أَبْوَابِ الْجَنَّةِ الثَّمَانِيَةِ مِنْ أَيِّهَا شَاءَ دَخَلَ ‏\"‏ ‏.‏","english":{"narrator":"‘Utbah\nbin ‘Abd Sulami said:","text":"“I heard the Messenger of Allah (ﷺ)\nsay:\n‘There is no Muslim, three of whose children die before reaching\nthe age of puberty, but they will meet him at the eight gates of\nParadise and whichever one he wants he will enter through it.’”"}},{"id":173,"idInBook":173,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا يُوسُفُ بْنُ حَمَّادٍ الْمَعْنِيُّ، حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ سَعِيدٍ، عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ مَا مِنْ مُسْلِمَيْنِ يُتَوَفَّى لَهُمَا ثَلاَثَةٌ مِنَ الْوَلَدِ لَمْ يَبْلُغُوا الْحِنْثَ إِلاَّ أَدْخَلَهُمُ اللَّهُ الْجَنَّةَ بِفَضْلِ رَحْمَةِ اللَّهِ إِيَّاهُمْ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Anas bin Malik that the Prophet (ﷺ) said:","text":"“There\nare no two Muslims (mother and father), three of whose children\ndie\nbefore reaching the age of puberty, but Allah will admit them to\nParadise by virtue of His mercy towards them.”"}},{"id":174,"idInBook":174,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، حَدَّثَنَا إِسْحَاقُ بْنُ يُوسُفَ، عَنِ الْعَوَّامِ بْنِ حَوْشَبٍ، عَنْ أَبِي مُحَمَّدٍ، مَوْلَى عُمَرَ بْنِ الْخَطَّابِ عَنْ أَبِي عُبَيْدَةَ، عَنْ عَبْدِ اللَّهِ، قَالَ: قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ مَنْ قَدَّمَ ثَلاَثَةً مِنَ الْوَلَدِ لَمْ يَبْلُغُوا الْحِنْثَ كَانُوا لَهُ حِصْنًا حَصِينًا مِنَ النَّارِ ‏\"‏ ‏.‏ فَقَالَ أَبُو ذَرٍّ: قَدَّمْتُ اثْنَيْنِ ‏.‏ قَالَ: ‏\"‏ وَاثْنَيْنِ ‏\"‏ ‏.‏ فَقَالَ أُبَىُّ بْنُ كَعْبٍ أَبُو الْمُنْذِرِ سَيِّدُ الْقُرَّاءِ: قَدَّمْتُ وَاحِدًا ‏.‏ قَالَ\" ‏\"‏ وَوَاحِدًا ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from ‘Abdullah that the Messenger of Allah (ﷺ)\nsaid:","text":"“Whoever sends fourth three of his children who had not reached\nthe\nage of puberty, they will be a strong fortification for him\nagainst\nthe Fire.” Abu Dharr said: “I sent forth two.” He said: “And\ntwo” Ubayy bin Ka’b, the chief of the reciters, said: “I sent\nforth\none.” He said: “Even one.”"}},{"id":175,"idInBook":175,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، قَالَ حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، حَدَّثَنَا يَزِيدُ بْنُ عَبْدِ الْمَلِكِ النَّوْفَلِيُّ، عَنْ يَزِيدَ بْنِ رُومَانَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ لَسِقْطٌ أُقَدِّمُهُ بَيْنَ يَدَىَّ أَحَبُّ إِلَىَّ مِنْ فَارِسٍ أُخَلِّفُهُ خَلْفِي ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)\nsaid:","text":"‘A\nmiscarried fetus sent before me is dearer to me than a\nhorseman whom\nI leave behind.”"}},{"id":176,"idInBook":176,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، وَمُحَمَّدُ بْنُ إِسْحَاقَ أَبُو بَكْرٍ الْبَكَّائِيُّ، قَالاَ حَدَّثَنَا أَبُو غَسَّانَ، قَالَ حَدَّثَنَا مِنْدَلٌ، عَنِ الْحَسَنِ بْنِ الْحَكَمِ النَّخَعِيِّ، عَنْ أَسْمَاءَ بِنْتِ عَابِسِ بْنِ رَبِيعَةَ، عَنْ أَبِيهَا، عَنْ عَلِيٍّ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ إِنَّ السِّقْطَ لَيُرَاغِمُ رَبَّهُ إِذَا أَدْخَلَ أَبَوَيْهِ النَّارَ ‏.‏ فَيُقَالُ أَيُّهَا السِّقْطُ الْمُرَاغِمُ رَبَّهُ أَدْخِلْ أَبَوَيْكَ الْجَنَّةَ ‏.‏ فَيَجُرُّهُمَا بِسَرَرِهِ حَتَّى يُدْخِلَهُمَا الْجَنَّةَ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Ali said:","text":"“The Messenger of Allah (ﷺ) said:\n‘The\nmiscarried fetus will plead with his Lord if his parents are\nadmitted\nto Hell. It will be said: “O fetus who pleads with your Lord!\nAdmit\nyour parents to Paradise.” So he will drag them out with his\numbilical cord until he admits them to Paradise.’”"}},{"id":177,"idInBook":177,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ هَاشِمِ بْنِ مَرْزُوقٍ، حَدَّثَنَا عَبِيدَةُ بْنُ حُمَيْدٍ، حَدَّثَنَا يَحْيَى بْنُ عُبَيْدِ اللَّهِ، عَنْ عُبَيْدِ اللَّهِ بْنِ مُسْلِمٍ الْحَضْرَمِيِّ، عَنْ مُعَاذِ بْنِ جَبَلٍ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ وَالَّذِي نَفْسِي بِيَدِهِ إِنَّ السِّقْطَ لَيَجُرُّ أُمَّهُ بِسَرَرِهِ إِلَى الْجَنَّةِ إِذَا احْتَسَبَتْهُ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Mu’adh bin Jabal that the Prophet (ﷺ) said:","text":"“By\nthe One in Whose Hand is my soul! The miscarried fetus will drag\nhis\nmother by his umbilical cord to Paradise, if she (was patient and)\nsought reward (for her loss).”"}},{"id":178,"idInBook":178,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، وَمُحَمَّدُ بْنُ الصَّبَّاحِ، قَالاَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ جَعْفَرِ بْنِ خَالِدٍ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ، قَالَ لَمَّا جَاءَ نَعْىُ جَعْفَرٍ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ اصْنَعُوا لآلِ جَعْفَرٍ طَعَامًا. فَقَدْ أَتَاهُمْ مَا يَشْغَلُهُمْ أَوْ أَمْرٌ يَشْغَلُهُمْ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Abdullah bin Ja’far said:","text":"“When news of the\ndeath of Ja’far was brought, the Messenger of Allah (ﷺ) said:\n‘Prepare food for the family of Ja’far, for there has come to\nthem\nthat which is keeping them busy or something which is keeping\nthem\nbusy.”"}},{"id":179,"idInBook":179,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا يَحْيَى بْنُ خَلَفٍ أَبُو سَلَمَةَ، قَالَ حَدَّثَنَا عَبْدُ الأَعْلَى، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، حَدَّثَنِي عَبْدُ اللَّهِ بْنُ أَبِي بَكْرٍ، عَنْ أُمِّ عِيسَى الْجَزَّارِ، قَالَتْ حَدَّثَتْنِي أُمُّ عَوْنٍ ابْنَةُ مُحَمَّدِ بْنِ جَعْفَرٍ، عَنْ جَدَّتِهَا، أَسْمَاءَ بِنْتِ عُمَيْسٍ قَالَتْ لَمَّا أُصِيبَ جَعْفَرٌ رَجَعَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ إِلَى أَهْلِهِ فَقَالَ ‏\n\"‏ إِنَّ آلَ جَعْفَرٍ قَدْ شُغِلُوا بِشَأْنِ مَيِّتِهِمْ فَاصْنَعُوا لَهُمْ طَعَامًا ‏\"‏ ‏.‏ قَالَ عَبْدُ اللَّهِ فَمَا زَالَتْ سُنَّةً حَتَّى كَانَ حَدِيثًا فَتُرِكَ ‏.‏","english":{"narrator":"Asma’\nbint ‘Umais said:","text":"“When Ja’far was killed, the Messenger of\nAllah (ﷺ) went to his family and said: ‘The family of Ja’far\nare\nbusy with the matter of their deceased, so prepare food for\nthem.’”  (One of the narrators) Abdullah said: \"That continued to be the Sunnah, until innovations were introduced, then it was abandoned.\""}},{"id":180,"idInBook":180,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، قَالَ حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، حَدَّثَنَا هُشَيْمٌ، ح وَحَدَّثَنَا شُجَاعُ بْنُ مَخْلَدٍ أَبُو الْفَضْلِ، قَالَ حَدَّثَنَا هُشَيْمٌ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ، عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ الْبَجَلِيِّ، قَالَ كُنَّا نَرَى الاِجْتِمَاعَ إِلَى أَهْلِ الْمَيِّتِ وَصَنْعَةَ الطَّعَامِ مِنَ النِّيَاحَةِ ‏.‏","english":{"narrator":"It was\nnarrated that Jarir bin ‘Abdullah Al-Bajali said:","text":"“We used to\nthink that gathering with the family of the deceased and preparing\nfood was a form of wailing.”"}},{"id":181,"idInBook":181,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا جَمِيلُ بْنُ الْحَسَنِ، قَالَ حَدَّثَنَا أَبُو الْمُنْذِرِ الْهُذَيْلُ بْنُ الْحَكَمِ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي رَوَّادٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ مَوْتُ غُرْبَةٍ شَهَادَةٌ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Ibn ‘Abbas that the Messenger of Allah (ﷺ)\nsaid:","text":"Dying in a strange land is martyrdom.”"}},{"id":182,"idInBook":182,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، حَدَّثَنِي حُيَىُّ بْنُ عَبْدِ اللَّهِ الْمَعَافِرِيُّ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ الْحُبُلِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ تُوُفِّيَ رَجُلٌ بِالْمَدِينَةِ مِمَّنْ وُلِدَ بِالْمَدِينَةِ فَصَلَّى عَلَيْهِ النَّبِيُّ ـ صلى الله عليه وسلم ـ فَقَالَ: ‏\"‏ يَا لَيْتَهُ مَاتَ فِي غَيْرِ مَوْلِدِهِ ‏\"‏ ‏.‏ فَقَالَ رَجُلٌ مِنَ النَّاسِ وَلِمَ يَا رَسُولَ اللَّهِ؟ قَالَ: ‏\"‏ إِنَّ الرَّجُلَ إِذَا مَاتَ فِي غَيْرِ مَوْلِدِهِ قِيسَ لَهُ مِنْ مَوْلِدِهِ إِلَى مُنْقَطَعِ أَثَرِهِ فِي الْجَنَّةِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Abdullah bin ‘Amr said:","text":"“A man died in\nAl-\nMadinah, and he was one of those who were born in Al-Madinah. The\nProphet (ﷺ) offered the funeral prayer for him and said: “Would\nthat\nhe had died somewhere other than his birthplace.” A man among\nthe\npeople said: “Why, O Messenger of Allah?” He said: “If a\nman dies\nsomewhere other than his birthplace, a space will be\nmeasured for him\nin Paradise (as big as the distance) from the place\nwhere he was born\nto the place where he died.”"}},{"id":183,"idInBook":183,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ يُوسُفَ، قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَ أَنْبَأَنَا ابْنُ جُرَيْجٍ، ح وَحَدَّثَنَا أَبُو عُبَيْدَةَ بْنُ أَبِي السَّفَرِ، قَالَ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي إِبْرَاهِيمُ بْنُ مُحَمَّدِ بْنِ أَبِي عَطَاءٍ، عَنْ مُوسَى بْنِ وَرْدَانَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ مَنْ مَاتَ مَرِيضًا مَاتَ شَهِيدًا وَوُقِيَ فِتْنَةَ الْقَبْرِ وَغُدِيَ وَرِيحَ عَلَيْهِ بِرِزْقِهِ مِنَ الْجَنَّةِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)\nsaid:","text":"“Whoever dies from a sickness dies as a martyr. He is protected\nfrom the torment of the grave and he is granted provision from\nParadise morning and evening.”"}},{"id":184,"idInBook":184,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ الدَّرَاوَرْدِيُّ، قَالَ حَدَّثَنَا سَعْدُ بْنُ سَعِيدٍ، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ، قَالَتْ: قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ كَسْرُ عَظْمِ الْمَيِّتِ كَكَسْرِهِ حَيًّا ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from ‘Aishah that the Messenger of Allah (ﷺ) said:","text":"“Breaking the bones of the deceased is like breaking his bones when\nhe\nis alive.”"}},{"id":185,"idInBook":185,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ مَعْمَرٍ، حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ زِيَادٍ، أَخْبَرَنِي أَبُو عُبَيْدَةَ بْنُ عَبْدِ اللَّهِ بْنِ زَمْعَةَ، عَنْ أُمِّهِ، عَنْ أُمِّ سَلَمَةَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\n\"‏ كَسْرُ عَظْمِ الْمَيِّتِ كَكَسْرِ عَظْمِ الْحَىِّ فِي الإِثْمِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Umm Salamah that the Prophet (ﷺ) said:","text":"“Breaking\nthe bones of the deceased is, in sin, like breaking his\nbones when he\nis alive.”"}},{"id":186,"idInBook":186,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا سَهْلُ بْنُ أَبِي سَهْلٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، قَالَ: سَأَلْتُ عَائِشَةَ فَقُلْتُ: أَىْ أُمَّهْ أَخْبِرِينِي عَنْ مَرَضِ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ ‏.‏ قَالَتِ: اشْتَكَى فَعَلَقَ يَنْفُثُ فَجَعَلْنَا نُشَبِّهُ نَفْثَهُ بِنَفْثَةِ آكِلِ الزَّبِيبِ وَكَانَ يَدُورُ عَلَى نِسَائِهِ فَلَمَّا ثَقُلَ اسْتَأْذَنَهُنَّ أَنْ يَكُونَ فِي بَيْتِ عَائِشَةَ وَأَنْ يَدُرْنَ عَلَيْهِ ‏.‏ قَالَتْ: فَدَخَلَ عَلَىَّ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ وَهُوَ بَيْنَ رَجُلَيْنِ وَرِجْلاَهُ تَخُطَّانِ بِالأَرْضِ أَحَدُهُمَا الْعَبَّاسُ فَحَدَّثْتُ بِهِ ابْنَ عَبَّاسٍ فَقَالَ: أَتَدْرِي مَنِ الرَّجُلُ الَّذِي لَمْ تُسَمِّهِ عَائِشَةُ؟ هُوَ عَلِيُّ بْنُ أَبِي طَالِبٍ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Ubaidullah bin ‘Abdullah said:","text":"“I asked\n‘Aishah:\n‘O mother! Tell me about the sickness of the Messenger of\nAllah\n(ﷺ).’ She said: ‘He felt pain and started to spit (over his\nbody), and we began to compare his spittle to the spittle of a person\neating raisins. Like a person eating raisins and spitting out the\nseeds. He used to go around among his wives, but when he became ill,\nhe asked them permission to stay in the house of ‘Aishah and that\nthey\nshould come to him in turns.’ She said: ‘The Messenger of\nAllah (ﷺ)\nentered upon me, (supported) between two men, with his\nfeet making\nlines along the ground. One of them was ‘Abbas.’ I\ntold Ibn ‘Abbas\nthis Hadith and he said: ‘Do you know who the\nother man was whom\n‘Aishah did not name? He was ‘Ali bin Abu\nTalib.’”"}},{"id":187,"idInBook":187,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ مُسْلِمٍ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، قَالَتْ: كَانَ النَّبِيُّ ـ صلى الله عليه وسلم ـ يَتَعَوَّذُ بِهَؤُلاَءِ الْكَلِمَاتِ ‏\"‏ أَذْهِبِ الْبَاسَ رَبَّ النَّاسِ ‏.‏ وَاشْفِ أَنْتَ الشَّافِي لاَ شِفَاءَ إِلاَّ شِفَاؤُكَ شِفَاءً لاَ يُغَادِرُ سَقَمًا ‏\"‏ ‏.‏ فَلَمَّا ثَقُلَ النَّبِيُّ ـ صلى الله عليه وسلم ـ فِي مَرَضِهِ الَّذِي مَاتَ فِيهِ أَخَذْتُ بِيَدِهِ فَجَعَلْتُ أَمْسَحُهُ وَأَقُولُهَا ‏.‏ فَنَزَعَ يَدَهُ مِنْ يَدِي ثُمَّ قَالَ: ‏\"‏ اللَّهُمَّ اغْفِرْ لِي وَأَلْحِقْنِي بِالرَّفِيقِ الأَعْلَى ‏\"‏ ‏.‏ قَالَتْ: فَكَانَ هَذَا آخِرَ مَا سَمِعْتُ مِنْ كَلاَمِهِ ـ صلى الله عليه وسلم ـ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Aishah said:","text":"“The Prophet (ﷺ) used to seek\nrefuge using the following words: ‘Adhhibil-ba’s, Rabbin-nas,\nwashfi\nAntash-shafi, la shifa’a illa shifa’uka, shifa’an la\nyughadiru saqaman\n(Take away the affliction, O Lord of mankind, and\ngrant healing, for\nYou are the Healer and there is no healing that\nleaves no sickness).’\nWhen the Prophet (ﷺ) fell sick with the\nsickness that would be his\nlast, I took his hand and wiped it over\nhis body and recited these\nwords. He withdrew his hand from mine and\nsaid: ‘O Allah, forgive me\nand let me meet the exalted companions\n(i.e., those who occupy high\npositions in Paradise).’ Those were\nthe last words of his that I\nheard.”"}},{"id":188,"idInBook":188,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَبُو مَرْوَانَ الْعُثْمَانِيُّ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ أَبِيهِ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\"‏ مَا مِنْ نَبِيٍّ يَمْرَضُ إِلاَّ خُيِّرَ بَيْنَ الدُّنْيَا وَالآخِرَةِ ‏\"‏ ‏.‏ قَالَتْ فَلَمَّا كَانَ مَرَضُهُ الَّذِي قُبِضَ فِيهِ أَخَذَتْهُ بُحَّةٌ فَسَمِعْتُهُ يَقُولُ ‏\"‏ مَعَ الَّذِينَ أَنْعَمَ اللَّهُ عَلَيْهِمْ مِنَ النَّبِيِّينَ وَالصِّدِّيقِينَ وَالشُّهَدَاءِ وَالصَّالِحِينَ ‏\"‏ ‏.‏ فَعَلِمْتُ أَنَّهُ خُيِّرَ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Aishah said:","text":"“I heard the Messenger of Allah\n(ﷺ)\nsay: ‘There is no Prophet who fell sick but he was given the\nchoice\nbetween this world and the Hereafter.’ She said: ‘When he\nbecame\nsick with the illness that would be his last, (his voice)\nbecame\nhoarse and I heard him say, “In the company of those on whom\nAllah\nhas bestowed His grace, of the Prophets, the true believers, the\nmartyrs, and the righteous.’”  Then I knew that he had been\ngiven the choice.”"}},{"id":189,"idInBook":189,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، عَنْ زَكَرِيَّا، عَنْ فِرَاسٍ، عَنْ عَامِرٍ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، قَالَتِ اجْتَمَعْنَ نِسَاءُ النَّبِيِّ ـ صلى الله عليه وسلم ـ فَلَمْ تُغَادِرْ مِنْهُنَّ امْرَأَةٌ فَجَاءَتْ فَاطِمَةُ كَأَنَّ مِشْيَتَهَا مِشْيَةُ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ فَقَالَ: ‏\"‏ مَرْحَبًا بِابْنَتِي ‏\"‏ ‏.‏ ثُمَّ أَجْلَسَهَا عَنْ شِمَالِهِ ثُمَّ إِنَّهُ أَسَرَّ إِلَيْهَا حَدِيثًا فَبَكَتْ فَاطِمَةُ. ثُمَّ إِنَّهُ سَارَّهَا. فَضَحِكَتْ أَيْضًا فَقُلْتُ لَهَا: مَا يُبْكِيكِ؟ قَالَتْ: مَا كُنْتُ لأُفْشِيَ سِرَّ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ ‏.‏ فَقُلْتُ: مَا رَأَيْتُ كَالْيَوْمِ فَرَحًا أَقْرَبَ مِنْ حُزْنٍ ‏.‏ فَقُلْتُ لَهَا حِينَ بَكَتْ: أَخَصَّكِ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ بِحَدِيثٍ دُونَنَا ثُمَّ تَبْكِينَ؟ وَسَأَلْتُهَا عَمَّا قَالَ ‏.‏ فَقَالَتْ: مَا كُنْتُ لأُفْشِيَ سِرَّ رَسُولِ اللَّهِ -صلى الله عليه وسلم - ‏.‏ حَتَّى إِذَا قُبِضَ سَأَلْتُهَا عَمَّا قَالَ. فَقَالَتْ: إِنَّهُ كَانَ يُحَدِّثُنِي أَنَّ جِبْرَائِيلَ كَانَ يُعَارِضُهُ بِالْقُرْآنِ فِي كُلِّ عَامٍ مَرَّةً وَأَنَّهُ عَارَضَهُ بِهِ الْعَامَ مَرَّتَيْنِ ‏\"‏ وَلاَ أُرَانِي إِلاَّ قَدْ حَضَرَ أَجَلِي وَأَنَّكِ أَوَّلُ أَهْلِي لُحُوقًا بِي وَنِعْمَ السَّلَفُ أَنَا لَكِ ‏\"‏ ‏.‏ فَبَكَيْتُ ثُمَّ إِنَّهُ سَارَّنِي فَقَالَ: ‏\"‏ أَلاَ تَرْضَيْنَ أَنْ تَكُونِي سَيِّدَةَ نِسَاءِ الْمُؤْمِنِينَ - أَوْ نِسَاءِ هَذِهِ الأُمَّةِ - ‏\"‏ ‏.‏ فَضَحِكْتُ لِذَلِكَ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Aishah said:","text":"“The wives of the Prophet (ﷺ)\ngathered together and not one of them lagged behind. Fatimah came,\nand\nher gait was like that of the Messenger of Allah (ﷺ). He said,\n‘Welcome to my daughter.’ Then he made her sit to his left, and\nhe\nwhispered something to her, and she smiled. I said to her: ‘What\nmade\nyou weep?’ She said: ‘I will not disclose the secret of the\nMessenger\nof Allah (ﷺ).’ I said: ‘I never saw joy so close to\ngrief as I saw\ntoday.’ When she wept I said: ‘Did the Messenger\nof Allah (ﷺ) tell\nyou some special words that were not for us, then\nyou wept?’ And I\nasked her about what he had said. She said: ‘I\nwill not disclose the\nsecret of the Messenger of Allah (ﷺ).’\nAfter he died I asked her\nwhat he had said, and she said: ‘He told\nme that Jibra’il used to\nreview the Qur’an with him once each\nyear, but he had reviewed it with\nhim twice that year, (and he said:)\n“I do not think but that my time\nis near. You will be the first of\nmy family to join me, and what a\ngood predecessor I am for you.” So\nI wept. Then he whispered to me and\nsaid: “Will you not be pleased\nto be the leader of the women of this\nUmmah?” So I smiled.’”"}},{"id":190,"idInBook":190,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا مُصْعَبُ بْنُ الْمِقْدَامِ، حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ شَقِيقٍ، عَنْ مَسْرُوقٍ، قَالَ: قَالَتْ عَائِشَةُ: مَا رَأَيْتُ أَحَدًا أَشَدَّ عَلَيْهِ الْوَجَعُ مِنْ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ ‏.‏","english":{"narrator":"‘Aishah\nsaid:","text":"“I never saw anyone suffer more pain than the Messenger\nof\nAllah (ﷺ).”"}},{"id":191,"idInBook":191,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ، حَدَّثَنَا لَيْثُ بْنُ سَعْدٍ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ مُوسَى بْنِ سَرْجِسَ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ، قَالَتْ رَأَيْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ وَهُوَ يَمُوتُ وَعِنْدَهُ قَدَحٌ فِيهِ مَاءٌ فَيُدْخِلُ يَدَهُ فِي الْقَدَحِ ثُمَّ يَمْسَحُ وَجْهَهُ بِالْمَاءِ ثُمَّ يَقُولُ: ‏\n\"‏ اللَّهُمَّ أَعِنِّي عَلَى سَكَرَاتِ الْمَوْتِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Aishah said:","text":"“I saw the Messenger of Allah\n(ﷺ)\nwhen he was dying, and there was a bowl of water next to him. He\nput\nhis hand in the vessel and wiped his face with the water, and\nsaid:\n‘O Allah, help me to bear the agonies of death.’”"}},{"id":192,"idInBook":192,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَقُولُ آخِرُ نَظْرَةٍ نَظَرْتُهَا إِلَى رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ كَشْفُ السِّتَارَةِ يَوْمَ الاِثْنَيْنِ فَنَظَرْتُ إِلَى وَجْهِهِ كَأَنَّهُ وَرَقَةُ مُصْحَفٍ وَالنَّاسُ خَلْفَ أَبِي بَكْرٍ فِي الصَّلاَةِ فَأَرَادَ أَنْ يَتَحَرَّكَ فَأَشَارَ إِلَيْهِ أَنِ اثْبُتْ وَأَلْقَى السِّجْفَ وَمَاتَ مِنْ آخِرِ ذَلِكَ الْيَوْمِ ‏.‏","english":{"narrator":"It was\nnarrated that Zuhri heard Anas bin Malik say:","text":"“The last glance\nthat\nI had of the Messenger of Allah (ﷺ) was when he drew back the\ncurtain on Monday, and I saw his face as if it was a page of the\nMushaf (Qur’an), and the people were praying behind Abu Bakr. He\n(Abu\nBakr) wanted to move, but he (the Prophet (ﷺ)) gestured to him\nto\nstand firm. Then he let the curtain fall, and he died at the end\nof\nthat day.”"}},{"id":193,"idInBook":193,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، عَنْ صَالِحٍ أَبِي الْخَلِيلِ، عَنْ سَفِينَةَ، عَنْ أُمِّ سَلَمَةَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ كَانَ يَقُولُ فِي مَرَضِهِ الَّذِي تُوُفِّيَ فِيهِ ‏\n\"‏ الصَّلاَةَ وَمَا مَلَكَتْ أَيْمَانُكُمْ ‏\"‏ ‏.‏ فَمَا زَالَ يَقُولُهَا حَتَّى مَا يَفِيضَ بِهَا لِسَانُهُ ‏.‏","english":{"narrator":"It was\nnarrated from Umm Salamah that the Messenger of Allah (ﷺ)\nused to\nsay, during the illness that would be his last:","text":"“The prayer,\nand\nthose whom your hands possess.”* And he kept on saying it until\nhis\ntongue could no longer utter any words."}},{"id":194,"idInBook":194,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، عَنِ ابْنِ عَوْنٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، قَالَ: ذَكَرُوا عِنْدَ عَائِشَةَ أَنَّ عَلِيًّا كَانَ وَصِيًّا ‏.‏ فَقَالَتْ: مَتَى أَوْصَى إِلَيْهِ؟ فَلَقَدْ كُنْتُ مُسْنِدَتَهُ إِلَى صَدْرِي - أَوْ إِلَى حِجْرِي فَدَعَا بِطَسْتٍ فَلَقَدِ انْخَنَثَ فِي حِجْرِي فَمَاتَ وَمَا شَعَرْتُ بِهِ. فَمَتَى أَوْصَى ـ صلى الله عليه وسلم ـ؟ ‏","english":{"narrator":"It was\nnarrated that Aswad said:","text":"“They said in ‘Aishah’s presence\nthat\n‘Ali was appointed (by the Prophet (ﷺ) before he died), and she\nsaid: ‘When was he appointed? He (the Prophet (ﷺ)) was resting\nagainst my bosom, or in my lap, and he called for a basin, then he\nbecame limp in my lap and died, and I did not realize it. So when did\nhe (ﷺ) appoint him?’”"}},{"id":195,"idInBook":195,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنْ عَائِشَةَ، قَالَتْ لَمَّا قُبِضَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ وَأَبُو بَكْرٍ عِنْدَ امْرَأَتِهِ ابْنَةِ خَارِجَةَ بِالْعَوَالِي فَجَعَلُوا يَقُولُونَ لَمْ يَمُتِ النَّبِيُّ ـ صلى الله عليه وسلم ـ إِنَّمَا هُوَ بَعْضُ مَا كَانَ يَأْخُذُهُ عِنْدَ الْوَحْىِ ‏.‏ فَجَاءَ أَبُو بَكْرٍ فَكَشَفَ عَنْ وَجْهِهِ وَقَبَّلَ بَيْنَ عَيْنَيْهِ وَقَالَ أَنْتَ أَكْرَمُ عَلَى اللَّهِ مِنْ أَنْ يُمِيتَكَ مَرَّتَيْنِ قَدْ وَاللَّهِ مَاتَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏.‏ وَعُمَرُ فِي نَاحِيَةِ الْمَسْجِدِ يَقُولُ وَاللَّهِ مَا مَاتَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ وَلاَ يَمُوتُ حَتَّى يَقْطَعَ أَيْدِيَ أُنَاسٍ مِنَ الْمُنَافِقِينَ كَثِيرٍ وَأَرْجُلَهُمْ ‏.‏ فَقَامَ أَبُو بَكْرٍ فَصَعِدَ الْمِنْبَرَ فَقَالَ مَنْ كَانَ يَعْبُدُ اللَّهَ فَإِنَّ اللَّهَ حَىٌّ لَمْ يَمُتْ وَمَنْ كَانَ يَعْبُدُ مُحَمَّدًا فَإِنَّ مُحَمَّدًا قَدْ مَاتَ ‏{وَمَا مُحَمَّدٌ إِلاَّ رَسُولٌ قَدْ خَلَتْ مِنْ قَبْلِهِ الرُّسُلُ أَفَإِنْ مَاتَ أَوْ قُتِلَ انْقَلَبْتُمْ عَلَى أَعْقَابِكُمْ وَمَنْ يَنْقَلِبْ عَلَى عَقِبَيْهِ فَلَنْ يَضُرَّ اللَّهَ شَيْئًا وَسَيَجْزِي اللَّهُ الشَّاكِرِينَ}‏ ‏.‏ قَالَ عُمَرُ فَلَكَأَنِّي لَمْ أَقْرَأْهَا إِلاَّ يَوْمَئِذٍ ‏.‏","english":{"narrator":"It was\nnarrated that ‘Aishah said:","text":"“When the Messenger of Allah (ﷺ)\npassed away, Abu Bakr was with his wife, the daughter of Kharijah, in\nvillages surrounding Al-Madinah. They started to say: ‘The Prophet\n(ﷺ) has not died, rather he has been overcome with what used to\novercome him at the time of Revelation.’ Then Abu Bakr came and\nuncovered his (the Prophet’s (ﷺ)) face, kissed him between the\neyes\nand said: ‘You are too noble before Allah for Him to cause you\nto die\ntwice. By Allah, the Messenger of Allah (ﷺ) has indeed\ndied.’ ‘Umar\nwas in a corner of the mosque saying: ‘By Allah,\nthe Messenger of\nAllah (ﷺ) has not died and he will never die until\nthe hands and\nfeet of most of the hypocrites are cut off.’ Then Abu\nBakr stood up,\nascended the pulpit and said: ‘Whoever used to\nworship Allah, Allah is\nalive and will never die. Whoever used to\nworship Muhammad, Muhammad\nis dead. “Muhammad is no more than a\nMessenger, and indeed (many)\nMessengers have passed away before him.\nIf he dies or is killed, will\nyou then turn back on your heels (as\ndisbelievers)? And he who turns\nback on his heels, not the least harm\nwill he do to Allah; and Allah\nwill give reward to those who are\ngrateful.’”  ‘Umar said: ‘It\nwas as if I had never\nread (that Verse) before that day.’”"}},{"id":196,"idInBook":196,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، أَنْبَأَنَا وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا أَبِي، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، حَدَّثَنِي حُسَيْنُ بْنُ عَبْدِ اللَّهِ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ لَمَّا أَرَادُوا أَنْ يَحْفِرُوا، لِرَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ بَعَثُوا إِلَى أَبِي عُبَيْدَةَ بْنِ الْجَرَّاحِ وَكَانَ يَضْرَحُ كَضَرِيحِ أَهْلِ مَكَّةَ وَبَعَثُوا إِلَى أَبِي طَلْحَةَ وَكَانَ هُوَ الَّذِي يَحْفِرُ لأَهْلِ الْمَدِينَةِ وَكَانَ يَلْحَدُ فَبَعَثُوا إِلَيْهِمَا رَسُولَيْنِ وَقَالُوا اللَّهُمَّ خِرْ لِرَسُولِكَ ‏.‏ فَوَجَدُوا أَبَا طَلْحَةَ فَجِيءَ بِهِ وَلَمْ يُوجَدْ أَبُو عُبَيْدَةَ فَلَحَدَ لِرَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ ‏.‏ قَالَ فَلَمَّا فَرَغُوا مِنْ جِهَازِهِ يَوْمَ الثُّلاَثَاءِ وُضِعَ عَلَى سَرِيرِهِ فِي بَيْتِهِ ‏.‏ ثُمَّ دَخَلَ النَّاسُ عَلَى رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ أَرْسَالاً ‏.‏ يُصَلُّونَ عَلَيْهِ حَتَّى إِذَا فَرَغُوا أَدْخَلُوا النِّسَاءَ حَتَّى إِذَا فَرَغُوا أَدْخَلُوا الصِّبْيَانَ وَلَمْ يَؤُمَّ النَّاسَ عَلَى رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ أَحَدٌ ‏.‏ لَقَدِ اخْتَلَفَ الْمُسْلِمُونَ فِي الْمَكَانِ الَّذِي يُحْفَرُ لَهُ فَقَالَ قَائِلُونَ يُدْفَنُ فِي مَسْجِدِهِ ‏.‏ وَقَالَ قَائِلُونَ يُدْفَنُ مَعَ أَصْحَابِهِ ‏.‏ فَقَالَ أَبُو بَكْرٍ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\n\"‏ مَا قُبِضَ نَبِيٌّ إِلاَّ دُفِنَ حَيْثُ يُقْبَضُ ‏\"‏ ‏.‏ قَالَ فَرَفَعُوا فِرَاشَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ الَّذِي تُوُفِّيَ عَلَيْهِ فَحَفَرُوا لَهُ ثُمَّ دُفِنَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ وَسْطَ اللَّيْلِ مِنْ لَيْلَةِ الأَرْبِعَاءِ ‏.‏ وَنَزَلَ فِي حُفْرَتِهِ عَلِيُّ بْنُ أَبِي طَالِبٍ وَالْفَضْلُ وَقُثَمُ ابْنَا الْعَبَّاسِ وَشُقْرَانُ مَوْلَى رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ ‏.‏ وَقَالَ أَوْسُ بْنُ خَوْلِيٍّ وَهُوَ أَبُو لَيْلَى لِعَلِيِّ بْنِ أَبِي طَالِبٍ أَنْشُدُكَ اللَّهَ وَحَظَّنَا مِنْ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ ‏.‏ قَالَ لَهُ عَلِيٌّ انْزِلْ ‏.‏ وَكَانَ شُقْرَانُ مَوْلاَهُ أَخَذَ قَطِيفَةً كَانَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ يَلْبَسُهَا فَدَفَنَهَا فِي الْقَبْرِ وَقَالَ وَاللَّهِ لاَ يَلْبَسُهَا أَحَدٌ بَعْدَكَ أَبَدًا ‏.‏ فَدُفِنَتْ مَعَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ ‏.‏","english":{"narrator":"It was\nnarrated that Ibn ‘Abbas said:","text":"“When they wanted to dig a\ngrave\nfor the Messenger of Allah (ﷺ), they sent for Abu ‘Ubaidah bin\nJarrah, who used to dig graves in the manner of the people of Makkah,\nand they sent for Abu Talhah, who used to dig graves for the people\nof\nAl-Madinah, and he used to make a niche in the grave. They sent\ntwo\nmessengers to both of them, and they said: ‘O Allah, choose\nwhat is\nbest for Your Messenger.’ They found Abu Talhah and brought\nhim, but\nthey did not find Abu ‘Ubaidah. So he dug a grave with a\nniche for the\nMessenger of Allah (ﷺ). When they had finished\npreparing him, on\nTuesday, he was placed on his bed in his house.\nThen the people\nentered upon the Messenger of Allah (ﷺ) in groups\nand offered the\nfuneral prayer for him, and when they finished the\nwomen entered, and\nwhen they finished the children entered, and no\none led the people in\noffering the funeral prayer for the Messenger\nof Allah (ﷺ). The\nMuslims differed concerning the place where he\nshould be buried. Some\nsaid that he should be buried in his mosque.\nOthers said that he\nshould be buried with his Companions. Then Abu\nBakr said: ‘I heard the\nMessenger of Allah (ﷺ) say: “No Prophet\never passed away but he was\nburied where he died.” So they lifted\nup the bed of the Messenger of\nAllah (ﷺ) on which he had died, and\ndug the grave for him, then he\n(ﷺ) was buried in the middle of\nTuesday night. ‘Ali bin Abu Talib,\nFadl bin ‘Abbas and his\nbrother Qutham, and Shuqran the freed slave of\nthe Messenger of Allah\n(ﷺ) went down in his grave. Aws bin Khawli,\nwho was Abu Laila, said\nto ‘Ali bin Abi Talib: ‘I adjure you by Allah!\nGive us our share\nof the Messenger of Allah (ﷺ).’ So ‘Ali said to\nhim: ‘Come\ndown.’ Shuqran, his freed slave, had taken a Qatifah which\nthe\nMessenger of Allah (ﷺ) used to wear. He buried it in his grave\nand\nsaid, ‘By Allah, no one will ever wear it after you.’ So it was\nburied with the Messenger of Allah (ﷺ).”"}},{"id":197,"idInBook":197,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الزُّبَيْرِ أَبُو الزُّبَيْرِ، حَدَّثَنَا ثَابِتٌ الْبُنَانِيُّ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ لَمَّا وَجَدَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ مِنْ كَرْبِ الْمَوْتِ مَا وَجَدَ قَالَتْ فَاطِمَةُ وَاكَرْبَ أَبَتَاهْ ‏.‏ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\n\"‏ لاَ كَرْبَ عَلَى أَبِيكِ بَعْدَ الْيَوْمِ إِنَّهُ قَدْ حَضَرَ مِنْ أَبِيكِ مَا لَيْسَ بِتَارِكٍ مِنْهُ أَحَدًا الْمُوَافَاةُ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated that Anas bin Malik said:","text":"“When the Messenger of\nAllah\n(ﷺ) suffered the agonies of death that he suffered, Fatimah\nsaid:\n‘O my father, what a severe agony!’ The Messenger of Allah (ﷺ)\nsaid: ‘Your father will suffer no more agony after this day. There\nhas\ncome to your father that which no one can avoid, the death that\neveryone will encounter until the Day of Resurrection.’”"}},{"id":198,"idInBook":198,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنِي حَمَّادُ بْنُ زَيْدٍ، حَدَّثَنِي ثَابِتٌ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَالَتْ لِي فَاطِمَةُ يَا أَنَسُ كَيْفَ سَخَتْ أَنْفُسُكُمْ أَنْ تَحْثُوا التُّرَابَ عَلَى رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ ‏.‏ \n وَحَدَّثَنَا ثَابِتٌ، عَنْ أَنَسٍ، أَنَّ فَاطِمَةَ، قَالَتْ حِينَ قُبِضَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ وَا أَبَتَاهْ إِلَى جِبْرَائِيلَ أَنْعَاهْ وَا أَبَتَاهْ مِنْ رَبِّهِ مَا أَدْنَاهْ وَا أَبَتَاهْ جَنَّةُ الْفِرْدَوْسِ مَأْوَاهْ وَا أَبَتَاهْ أَجَابَ رَبًّا دَعَاهْ ‏.‏ قَالَ حَمَّادٌ فَرَأَيْتُ ثَابِتًا حِينَ حَدَّثَ بِهَذَا الْحَدِيثِ بَكَى حَتَّى رَأَيْتُ أَضْلاَعَهُ تَخْتَلِفُ ‏.‏","english":{"narrator":"It was\nnarrated that Anas bin Malik said:","text":"“Fatimah said to me: ‘O\nAnas,\nhow did you manage to scatter dust on the Messenger of Allah\n(ﷺ)?’”\nAnd Thabit narrated to us from Anas that Fatimah said: “When\nthe\nMessenger of Allah (ﷺ) passed away: ‘O my father! To Jibra’il\nwe\nannounce his death; O my father, how much closer he is now to his\nLord; O my father, the Paradise of Firdaws is his abode; O my father,\nhe has answered the call of his Lord.”  (One of the narrators) Hammad\nsaid: \"I saw Thabit, when he narrated this Hadith, weeping until I could see his ribs moving up and down.\""}},{"id":199,"idInBook":199,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا بِشْرُ بْنُ هِلاَلٍ الصَّوَّافُ، حَدَّثَنَا جَعْفَرُ بْنُ سُلَيْمَانَ الضُّبَعِيُّ، حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسٍ، قَالَ لَمَّا كَانَ الْيَوْمُ الَّذِي دَخَلَ فِيهِ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ الْمَدِينَةَ أَضَاءَ مِنْهَا كُلُّ شَىْءٍ فَلَمَّا كَانَ الْيَوْمُ الَّذِي مَاتَ فِيهِ أَظْلَمَ مِنْهَا كُلُّ شَىْءٍ ‏.‏ وَمَا نَفَضْنَا عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ الأَيْدِيَ حَتَّى أَنْكَرْنَا قُلُوبَنَا ‏.‏","english":{"narrator":"It was\nnarrated that Anas said:","text":"“On the day when the Messenger of\nAllah\n(ﷺ) entered Al-Madinah, everything was lit up, and on the day\nwhen\nhe died, everything went dark, and no sooner had we dusted off\nour\nhands (after burying him) but we felt that our hearts had\nchanged.”*"}},{"id":200,"idInBook":200,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، قَالَ كُنَّا نَتَّقِي الْكَلاَمَ وَالاِنْبِسَاطَ إِلَى نِسَائِنَا عَلَى عَهْدِ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ مَخَافَةَ أَنْ يُنْزَلَ فِينَا الْقُرْآنُ فَلَمَّا مَاتَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ تَكَلَّمْنَا ‏.‏","english":{"narrator":"It was\nnarrated that Ibn ‘Umar said:","text":"“We used to be guarded in our\nspeech even with our wives at the time of the Messenger of Allah\n(ﷺ), fearing that Qur’an may be revealed amongst us, but when the\nMessenger of Allah (ﷺ) died, we began to speak freely.”"}},{"id":201,"idInBook":201,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، أَنْبَأَنَا عَبْدُ الْوَهَّابِ بْنُ عَطَاءٍ الْعِجْلِيُّ، عَنِ ابْنِ عَوْنٍ، عَنِ الْحَسَنِ، عَنْ أُبَىِّ بْنِ كَعْبٍ، قَالَ كُنَّا مَعَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ وَإِنَّمَا وَجْهُنَا وَاحِدٌ فَلَمَّا قُبِضَ نَظَرْنَا هَكَذَا وَهَكَذَا ‏.‏","english":{"narrator":"It was\nnarrated that Ubayy bin Ka’b said:","text":"“We were with the Messenger\nof\nAllah (ﷺ) and we all had a single focus, but when he passed away\nwe\nstarted to look here and there (i.e., have different interests).”"}},{"id":202,"idInBook":202,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ الْحِزَامِيُّ، حَدَّثَنَا خَالِي، مُحَمَّدُ بْنُ إِبْرَاهِيمَ بْنِ الْمُطَّلِبِ بْنِ السَّائِبِ بْنِ أَبِي وَدَاعَةَ السَّهْمِيُّ حَدَّثَنِي مُوسَى بْنُ عَبْدِ اللَّهِ بْنِ أَبِي أُمَيَّةَ الْمَخْزُومِيُّ، حَدَّثَنِي مُصْعَبُ بْنُ عَبْدِ اللَّهِ، عَنْ أُمِّ سَلَمَةَ بِنْتِ أَبِي أُمَيَّةَ، زَوْجِ النَّبِيِّ ـ صلى الله عليه وسلم ـ أَنَّهَا قَالَتْ كَانَ النَّاسُ فِي عَهْدِ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ إِذَا قَامَ الْمُصَلِّي يُصَلِّي لَمْ يَعْدُ بَصَرُ أَحَدِهِمْ مَوْضِعَ قَدَمَيْهِ فَتُوُفِّيَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ فَكَانَ النَّاسُ إِذَا قَامَ أَحَدُهُمْ يُصَلِّي لَمْ يَعْدُ بَصَرُ أَحَدِهِمْ مَوْضِعَ جَبِينِهِ فَتُوُفِّيَ أَبُو بَكْرٍ وَكَانَ عُمَرُ فَكَانَ النَّاسُ إِذَا قَامَ أَحَدُهُمْ يُصَلِّي لَمْ يَعْدُ بَصَرُ أَحَدِهِمْ مَوْضِعَ الْقِبْلَةِ وَكَانَ عُثْمَانُ بْنُ عَفَّانَ فَكَانَتِ الْفِتْنَةُ فَتَلَفَّتَ النَّاسُ يَمِينًا وَشِمَالاً ‏.‏","english":{"narrator":"It was\nnarrated that Umm Salamah bint Abi Umayyah, the wife of the\nProphet\n(ﷺ), said:","text":"“At the time of the Messenger of Allah (ﷺ), if\na\nperson stood to pray, his gaze would not go beyond his feet. When\nthe\nMessenger of Allah (ﷺ) died, if a person stood to pray, his gaze\nwould not go beyond the place where he put his forehead when\nprostrating. Then Abu Bakr died and it was ‘Umar (the caliph). So,\nwhen any person stood to pray his gaze would not go beyond the\nQiblah.\nThen came the time of ‘Uthman bin ‘Affan, and there was\nFitnah\n(tribulation, turmoil), and the people started to look right\nand\nleft.”"}},{"id":203,"idInBook":203,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلاَّلُ، حَدَّثَنَا عَمْرُو بْنُ عَاصِمٍ، حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، قَالَ قَالَ أَبُو بَكْرٍ بَعْدَ وَفَاةِ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ لِعُمَرَ انْطَلِقْ بِنَا إِلَى أُمِّ أَيْمَنَ نَزُورُهَا كَمَا كَانَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ يَزُورُهَا ‏.‏ قَالَ: فَلَمَّا انْتَهَيْنَا إِلَيْهَا بَكَتْ فَقَالاَ لَهَا: مَا يُبْكِيكِ؟ فَمَا عِنْدَ اللَّهِ خَيْرٌ لِرَسُولِهِ ‏.‏ قَالَتْ: إِنِّي لأَعْلَمُ أَنَّ مَا عِنْدَ اللَّهِ خَيْرٌ لِرَسُولِهِ وَلَكِنْ أَبْكِي أَنَّ الْوَحْىَ قَدِ انْقَطَعَ مِنَ السَّمَاءِ ‏.‏ قَالَ: فَهَيَّجَتْهُمَا عَلَى الْبُكَاءِ فَجَعَلاَ يَبْكِيَانِ مَعَهَا ‏.‏","english":{"narrator":"It was\nnarrated that Anas said:","text":"“After the Messenger of Allah (ﷺ)\nhad\ndied, Abu Bakr said to ‘Umar: ‘Let us go and visit Umm Ayman as\nthe Messenger of Allah (ﷺ) used to visit her.’ He said: ‘When\nwe\nreached her she wept.’ They said: ‘Why are you weeping? What\nis with\nAllah is better for His Messenger.’ She said: ‘I know\nthat what is\nwith Allah is better for His Messenger, but I am weeping\nbecause the\nRevelation from heaven has ceased.’ She moved them to\ntears and they\nstarted to weep with her.”"}},{"id":204,"idInBook":204,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا الْحُسَيْنُ بْنُ عَلِيٍّ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ بْنِ جَابِرٍ، عَنْ أَبِي الأَشْعَثِ الصَّنْعَانِيِّ، عَنْ أَوْسِ بْنِ أَوْسٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ إِنَّ مِنْ أَفْضَلِ أَيَّامِكُمْ يَوْمَ الْجُمُعَةِ فِيهِ خُلِقَ آدَمُ وَفِيهِ النَّفْخَةُ وَفِيهِ الصَّعْقَةُ فَأَكْثِرُوا عَلَىَّ مِنَ الصَّلاَةِ فِيهِ فَإِنَّ صَلاَتَكُمْ مَعْرُوضَةٌ عَلَىَّ ‏.‏ فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ كَيْفَ تُعْرَضُ صَلاَتُنَا عَلَيْكَ وَقَدْ أَرَمْتَ - يَعْنِي بَلِيتَ - قَالَ ‏\"‏ إِنَّ اللَّهَ حَرَّمَ عَلَى الأَرْضِ أَنْ تَأْكُلَ أَجْسَادَ الأَنْبِيَاءِ ‏\"‏ ‏.‏","english":{"narrator":"It was\nnarrated from Aws bin Aws that the Messenger of Allah (ﷺ)\nsaid:","text":"‘The best of your days is Friday. On it Adam was created; on it\nshall be the Nafakhah,* on it all creation will swoon. So send a\ngreat\ndeal of blessing upon me on this day, for your blessing will be\npresented to me.’ A man said: “O Messenger of Allah! How will our\nblessing be presented to you when you have disintegrated?” He said:\n“Allah has forbidden the earth to consume the bodies of the\nProphets.”"}},{"id":205,"idInBook":205,"chapterId":6,"bookId":6,"arabic":"حَدَّثَنَا عَمْرُو بْنُ سَوَّادٍ الْمِصْرِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، عَنْ عَمْرِو بْنِ الْحَارِثِ، عَنْ سَعِيدِ بْنِ أَبِي هِلاَلٍ، عَنْ زَيْدِ بْنِ أَيْمَنَ، عَنْ عُبَادَةَ بْنِ نُسَىٍّ، عَنْ أَبِي الدَّرْدَاءِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ أَكْثِرُوا الصَّلاَةَ عَلَىَّ يَوْمَ الْجُمُعَةِ فَإِنَّهُ مَشْهُودٌ تَشْهَدُهُ الْمَلاَئِكَةُ وَإِنَّ أَحَدًا لَنْ يُصَلِّيَ عَلَىَّ إِلاَّ عُرِضَتْ عَلَىَّ صَلاَتُهُ حَتَّى يَفْرُغَ مِنْهَا ‏\"‏ ‏.‏ قَالَ قُلْتُ وَبَعْدَ الْمَوْتِ قَالَ ‏\"‏ وَبَعْدَ الْمَوْتِ إِنَّ اللَّهَ حَرَّمَ عَلَى الأَرْضِ أَنْ تَأْكُلَ أَجْسَادَ الأَنْبِيَاءِ ‏\"‏ ‏.‏ فَنَبِيُّ اللَّهِ حَىٌّ يُرْزَقُ ‏.‏","english":{"narrator":"It was\nnarrated from Abu Darda’ that the Messenger of Allah (ﷺ)\nsaid:","text":"“Send a great deal of blessing upon me on Fridays, for it is\nwitnessed by the angels. No one sends blessing upon me but his\nblessing will be presented to me, until he finishes them.” A man\nsaid:\n“Even after death?” He said: “Even after death, for Allah\nhas\nforbidden the earth to consume the bodies of the Prophets, so the\nProphet of Allah is alive and receives provision.’”"}}],"chapter":{"id":6,"bookId":6,"arabic":"كتاب الجنائز","english":"Chapters Regarding Funerals"}}