{"metadata":{"length":57,"arabic":{"title":"بلوغ المرام","author":"الإمام ابن حجر العسقلاني","introduction":"كتاب الحدود"},"english":{"title":"Bulugh al-Maram","author":"Ibn Hajar al-Asqalani","introduction":"Hudud"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":10,"bookId":17,"arabic":"عَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- وَزَيْدِ بْنِ خَالِدٍ اَلْجُهَنِيِّ رَضِيَ اَللَّهُ عنهما { أَنَّ رَجُلًا مِنَ اَلْأَعْرَابِ أَتَى رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-.‏  1‏ فَقَالَ: يَا رَسُولَ اَللَّهِ! أَنْشُدُكَ بِاَللَّهِ إِلَّا قَضَيْتَ لِي بِكِتَابِ اَللَّهِ, فَقَالَ اَلْآخَرُ ‏- وَهُوَ أَفْقَهُ مِنْهُ ‏- نَعَمْ.‏ فَاقَضِ بَيْنَنَا بِكِتَابِ اَللَّهِ, وَأْذَنْ لِي, فَقَالَ: \"قُلْ\".‏ قَالَ: إنَّ اِبْنِي كَانَ عَسِيفًا عَلَى هَذَا فَزَنَى بِاِمْرَأَتِهِ, وَإِنِّي أُخْبِرْتُ أَنْ عَلَى اِبْنِي اَلرَّجْمَ, فَافْتَدَيْتُ مِنْهُ بِمَائَةِ شَاةٍ وَوَلِيدَةٍ, فَسَأَلَتُ أَهْلَ اَلْعِلْمِ, فَأَخْبَرُونِي: أَنَّمَا عَلَى اِبْنِيْ جَلْدُ مَائَةٍ وَتَغْرِيبُ عَامٍ, وَأَنَّ عَلَى اِمْرَأَةِ هَذَا اَلرَّجْمَ, فَقَالَ رَسُولُ ا للَّهِ ‏- صلى الله عليه وسلم ‏-\"وَالَّذِي نَفْسِي بِيَدِهِ, لَأَقْضِيَنَّ بَيْنَكُمَا بِكِتَابِ اَللَّهِ, اَلْوَلِيدَةُ وَالْغَنَمُ رَدٌّ عَلَيْكَ, وَعَلَى اِبْنِكَ جَلْدُ مِائَةٍ وَتَغْرِيبُ عَامٍ, وَاغْدُ يَا أُنَيْسُ إِلَى اِمْرَأَةِ هَذَا, فَإِنْ اِعْتَرَفَتْ فَارْجُمْهَا\" }  مُتَّفَقٌ عَلَيْهِ, هَذَا وَاللَّفْظُ لِمُسْلِمٍ  2‏ .‏‏1 ‏- كذا في \" الأصلين \" لكن أشار ناسخ \" أ \" في الهامش إلى أن في نسخة \" النبي \".‏‏2 ‏- صحيح.‏ رواه البخاري (5 /301/فتح)‏، ومسلم (3324 ‏- 1325)‏.‏ وتمامه: فغدا عليها.‏ فاعترفت.‏ فأمر بها رسول الله صلى الله عليه وسلم، فرجمت.‏","english":{"narrator":"Abu Hurairah and Zaid bin Khalid al-Juhani (RAA) narrated that a Bedouin came to the Prophet (ﷺ) and said, 'O Messenger of Allah! I beseech you by Allah, that you judge between us according to Allah's laws' The man's opponent who was wiser than him got up and said, 'Yes, judge between us according to Allah's Law and kindly allow me (to speak).' The Prophet (ﷺ) said:","text":"\"Speak.\" He said, 'My son was a laborer working for that man (the Bedouin) and he committed illegal sexual intercourse with his wife, and I was informed that my son deserved to be stoned to death (as punishment for this offence). I ransomed him with one hundred sheep and a slave girl. But when I asked the knowledgeable people they told me that my son should receive a hundred lashes and be exiled for a year, and the man's wife should be stoned to death. The Messenger of Allah (ﷺ) replied, \"By Him in Whose Hands my soul is, I shall judge between you according to the Law of Allah (i.e. His Book). The slave girl and the sheep are to be returned to you. As for your son, he has to receive one hundred lashes and be exiled for a year. O Unais! Go to this man's wife, and if she confesses, then stone her to death.\" Agreed upon, and this is Muslim's version."}},{"id":2,"idInBook":2,"chapterId":10,"bookId":17,"arabic":"وَعَنْ عُبَادَةَ بْنِ اَلصَّامِتِ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ خُذُوا عَنِّي, خُذُوا عَنِّي, فَقَدْ جَعَلَ اَللَّهُ لَهُنَّ سَبِيلاً, اَلْبِكْرُ بِالْبِكْرِ جَلْدُ مِائَةٍ, وَنَفْيُ سَنَةٍ, وَالثَّيِّبُ بِالثَّيِّبِ جَلْدُ مِائَةٍ, وَالرَّجْمُ }  رَوَاهُ مُسْلِمٌ.‏  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم (1690)‏.‏","english":{"narrator":"'Ubadah bin As-Samit (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"\"Receive from me (this revelation), receive from me (this revelation). Allah has ordained a way for those women (unmarried females who committed adultery). When an unmarried man, commits adultery with an unmarried woman, they should receive one hundred lashes and be exiled for a year. If they (fornicate while they) were married, they shall receive hundred lashes and be stoned to death. Reported by Muslim."}},{"id":3,"idInBook":3,"chapterId":10,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: { أَتَى رَجُلٌ مِنْ اَلْمُسْلِمِينَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-‏-وَهُوَ فِي اَلْمَسْجِدِ‏- فَنَادَاهُ فَقَالَ: يَا رَسُولَ اَللَّهِ! إِنِّي زَنَيْتُ, فَأَعْرَضَ عَنْهُ, فَتَنَحَّى تِلْقَاءَ وَجْهِهِ, فَقَالَ: يَا رَسُولَ اَللَّهِ! إِنِّي زَنَيْتُ, فَأَعْرَضَ عَنْهُ, حَتَّى ثَنَّى ذَلِكَ عَلَيْهِ أَرْبَعَ مَرَّاتٍ, فَلَمَّا شَهِدَ عَلَى.‏  1‏ نَفْسِهِ أَرْبَعَ شَهَادَاتٍ.‏ دَعَاهُ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-فَقَالَ \"أَبِكَ جُنُونٌ?\" قَالَ.‏ لَا.‏ قَالَ: \"فَهَلْ  2‏ أَحْصَنْتَ?\".‏ قَالَ: نَعَمْ.‏ فَقَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-\"اِذْهَبُوا بِهِ فَارْجُمُوهُ\" }  مُتَّفَقٌ عَلَيْهِ  3‏ .‏‏1 ‏- تحرف في \"أ\" إلى \"عليه\".‏‏2 ‏- تحرف في \"أ\" إلى: \"فها\".‏‏3 ‏- صحيح رواه البخاري (5271)‏، ومسلم (1691)‏ (16)‏.‏","english":{"narrator":"Abu Hurairah (RAA) narrated, 'A Muslim man came to the Prophet (ﷺ) while he was in the mosque, and called him saying, 'O Messenger of Allah! I have committed adultery.' The Messenger of Allah (ﷺ) turned his face away from him, so the man came round (from the other side) towards his face and said, 'O Messenger of Allah! I have committed adultery.' The Messenger of Allah (ﷺ) again turned his face away from him, but the man repeated his statement four times. When he testified four times that he did it, the Messenger of Allah (ﷺ) called him saying, \"Are you insane?\" The man said, 'No.' The Messenger of Allah (ﷺ) then asked him, \"Are you married?\" The man answered, 'Yes.' The Messenger of Allah (ﷺ) said:","text":"\"Take him away and stone him (to death).\" Agreed upon."}},{"id":4,"idInBook":4,"chapterId":10,"bookId":17,"arabic":"وَعَنْ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { لَمَّا أَتَى مَاعِزُ بْنُ مَالِكٍ إِلَى اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ لَهُ: \n\"لَعَلَّكَ قَبَّلْتَ, أَوْ غَمَزْتَ, أَوْ نَظَرْتَ?\" قَالَ: لَا يَا رَسُولَ اَللَّهِ.‏ }  رَوَاهُ اَلْبُخَارِيُّ  1‏‏1 ‏- صحيح.‏ رواه البخاري (6824)‏ وتمامه: \"قال: أنكتها ‏-لا يكني‏- قال: فعند ذلك أمر برجمه \".‏","english":{"narrator":"","text":"Ibn 'Abbas (RAA) narrated, 'When Ma'iz came to the Prophet (ﷺ) (admitting that he had committed adultery), he said to him, \"Perhaps you have just kissed, or touched or looked (at the woman).\" Ma'iz said,'No, O Messenger of Allah.' Related by Al-Bukhari."}},{"id":5,"idInBook":5,"chapterId":10,"bookId":17,"arabic":"وَعَنْ عُمَرَ بْنِ اَلْخَطَّابِ ‏- رضى الله عنه ‏- { أَنَّهُ خَطَبَ فَقَالَ: إِنَّ اَللَّهَ بَعَثَ مُحَمَّدًا بِالْحَقِّ, وَأَنْزَلَ عَلَيْهِ اَلْكِتَابَ, فَكَانَ فِيمَا أَنْزَلَ اَللَّهُ عَلَيْهِ آيَةُ اَلرَّجْمِ.‏ قَرَأْنَاهَا وَوَعَيْنَاهَا وَعَقَلْنَاهَا, فَرَجَمَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-وَرَجَمْنَا بَعْدَهُ, فَأَخْشَى إِنْ طَالَ بِالنَّاسِ زَمَانٌ أَنْ يَقُولَ قَائِلٌ: مَا نَجِدُ اَلرَّجْمَ فِي كِتَابِ اَللَّهِ, فَيَضِلُّوا  1‏ بِتَرْكِ فَرِيضَةٍ أَنْزَلَهَا اَللَّهُ, وَإِنَّ اَلرَّجْمَ حَقٌّ فِي كِتَابِ اَللَّهِ عَلَى مَنْ زَنَى, إِذَا أُحْصِنَ مِنْ اَلرِّجَالِ وَالنِّسَاءِ, إِذَا قَامَتْ اَلْبَيِّنَةُ, أَوْ كَانَ اَلْحَبَلُ, أَوْ اَلِاعْتِرَافُ }  مُتَّفَقٌ عَلَيْهِ  2‏ .‏‏1 ‏- تحرف في \"أ\" إلى \"فيضل\".‏‏2 ‏- صحيح.‏ رواه البخاري (6829)‏ و (6830)‏ في حديث طويل، ومسلم (1691)‏ واللفظ لمسلم.‏","english":{"narrator":"","text":"'Umar bin al-Khattab (RAA) narrated that he addressed the people and said, 'Verily Allah has sent Muhammad with the Truth and sent down the Book to him, and the verse of stoning was included in what Allah sent down. We recited, memorized and comprehended it. The Messenger of Allah (ﷺ) accordingly (to what was in the verse) stoned to death (whoever committed adultery while being married), and we stoned after his death. But I am afraid that after a long time passes, someone may say, 'We do not find the Verses of stoning in Allah's Book, and thus they may go astray by abandoning an obligation that Allah has sent down. Verily, stoning is an obligation in the Book of Allah to be inflicted on married men and women who commit adultery, when their crime is proven, evident by pregnancy, or through the confession (of the adulterer).' Agreed upon."}},{"id":6,"idInBook":6,"chapterId":10,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- سَمِعْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ: { \"إِذَا زَنَتْ أَمَةُ أَحَدِكُمْ, فَتَبَيَّنَ زِنَاهَا, فَلْيَجْلِدْهَا اَلْحَدَّ, وَلَا يُثَرِّبْ عَلَيْهَا, ثُمَّ إِنْ زَنَتْ فَلْيَجْلِدْهَا اَلْحَدَّ, وَلَا يُثَرِّبْ عَلَيْهَا, ثُمَّ إِنْ زَنَتِ اَلثَّالِثَةَ, فَتَبَيَّنَ زِنَاهَا, فَلْيَبِعْهَا وَلَوْ بِحَبْلٍ مِنْ شَعَرٍ }  مُتَّفَقٌ عَلَيْهِ وَهَذَا لَفْظُ مُسْلِمٍ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (2152)‏، ومسلم (1703)‏.‏","english":{"narrator":"","text":"Abu Hurairah (RAA) narrated, 'I heard the Messenger of Allah (ﷺ) say, \"When the slave-woman of one of you commits adultery and she is proven guilty (through witnesses or confession), he should flog her as prescribed (for the slave woman), but he should not admonish her. If she does this again, then she should be flogged again but he should not admonish her. If she commits it for the third time, and she is proven guilty, then he must sell her even if it was for a rope of hair.\" Agreed upon, and the wording is from Muslim."}},{"id":7,"idInBook":7,"chapterId":10,"bookId":17,"arabic":"وَعَنْ عَلِيٍّ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ أَقِيمُوا اَلْحُدُودَ عَلَى مَا مَلَكَتْ أَيْمَانُكُمْ }  رَوَاهُ أَبُو دَاوُدَ  1‏ .‏ \n\nوَهُوَ فِي \n\"مُسْلِمٍ\" مَوْقُوفٌ  2‏ .‏‏1 ‏- ضعيف مرفوعا.‏ رواه أبو داود (4473)‏، مرفوعا وفي سنده ضعيف.‏\n\n‏2 ‏- حسن.‏ رواه مسلم (1705)‏، عن أبي عبد الرحمن قال: خطب علي فقال: يا أيها الناس! أقيموا على أرقائكم الحد.‏ من أحصن منهم ومن لم يحصن.‏ فإن أمة لرسول الله صلى الله عليه وسلم زنت، فأمرني أن أجلدها، فإذا هي حديث عهد بنفاس.‏ فخشيت إن أنا جلدتها أن أقتلها، فذكرت ذلك للنبي صلى الله عليه وسلم.‏ فقال: \"أحسنت\".‏","english":{"narrator":"'Ali (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"\"Inflict the prescribed punishment to those whom you possess (i.e. your slaves).\" Related by Abu Dawud. And it is related by Muslim (but only traced to the Companion)."}},{"id":8,"idInBook":8,"chapterId":10,"bookId":17,"arabic":"وَعَنْ عِمْرَانَ بْنِ حَصِينٍ ‏- رضى الله عنه ‏- { أَنَّ اِمْرَأَةً مِنْ جُهَيْنَةَ أَتَتْ نَبِيَّ اَللَّهِ ‏- صلى الله عليه وسلم ‏-‏-وَهِيَ حُبْلَى مِنْ اَلزِّنَا‏-فَقَالَتْ: يَا نَبِيَّ اَللَّهِ! أَصَبْتُ حَدًّا, فَأَقِمْهُ عَلَيَّ, فَدَعَا نَبِيُّ اَللَّهِ ‏- صلى الله عليه وسلم ‏-وَلِيَّهَا.‏ فَقَالَ: \"أَحْسِنْ إِلَيْهَا فَإِذَا وَضَعَتْ فَائْتِنِي بِهَا\" فَفَعَلَ.‏ فَأَمَرَ بِهَا فَشُكَّتْ عَلَيْهَا ثِيَابُهَا, ثُمَّ أَمَرَ بِهَا فَرُجِمَتْ, ثُمَّ صَلَّى عَلَيْهَا, فَقَالَ عُمَرُ: أَتُصَلِّي عَلَيْهَا يَا نَبِيَّ اَللَّهِ وَقَدْ زَنَتْ? فَقَالَ: \"لَقَدْ تَابَتْ تَوْبَةً لَوْ قُسِّمَتْ بَيْنَ سَبْعِينَ مِنْ أَهْلِ اَلْمَدِينَةِ لَوَسِعَتْهُمْ, وَهَلْ وَجَدَتْ أَفَضَلَ مِنْ أَنْ جَادَتْ بِنَفْسِهَا لِلَّهِ? }  \".‏ رَوَاهُ مُسْلِمٌ  1‏ .‏‏1 ‏- صحيح رواه مسلم (1696)‏.‏","english":{"narrator":"","text":"'Imran bin Husain (RAA) narrated, 'A woman from Juhainah came to the Prophet (ﷺ) while she was pregnant due to committing adultery and said, 'O Messenger of Allah! I have done something for which a prescribed punishment is to be inflicted, so please inflict it on me. The Messenger of Allah (ﷺ) called her guardian and said, \"Be good to her, and when she delivers bring her back to me.\" Her guardian brought her back when she had delivered and the Messenger of Allah (ﷺ) gave his commands and her clothes were tied around her and then the Prophet (ﷺ) gave his commands and she was stoned to death. The Messenger of Allah (ﷺ) offered funeral prayer for her and thereupon 'Umar said, 'O Messenger of Allah! You offer funeral prayer for her even though she committed adultery?' The Messenger of Allah (ﷺ) replied, \"She has offered such a repentance (for her sin) that if it was divided between seventy of the inhabitants of Madinah, it would be sufficient for them. Have you found such repentance better than sacrificing her life for the sake of Allah, the Almighty?\" Related by Muslim."}},{"id":9,"idInBook":9,"chapterId":10,"bookId":17,"arabic":"وَعَنْ جَابِرِ بْنِ عَبْدِ اَللَّهِ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { رَجَمَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-رَجُلًا مَنْ أَسْلَمَ, وَرَجُلًا مِنْ اَلْيَهُودِ, وَاِمْرَأَةً }  رَوَاهُ مُسْلِمٌ  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم (1701)‏ وفي رواية عنده: \"وامرأته\" والمراد بذلك: المرأة التي زنا بها، وليست زوجته.‏","english":{"narrator":"","text":"Jabir bin 'Abdullah (RAA) narrated, \"The Messenger of Allah (ﷺ) stoned a man from Aslam to death, a Jewish man and a woman. Related by Muslim."}},{"id":10,"idInBook":10,"chapterId":10,"bookId":17,"arabic":"وَقِصَّةُ رَجْمِ اَلْيَهُودِيَّيْنِ فِي \n\"اَلصَّحِيحَيْنِ\" مِنْ حَدِيثِ اِبْنِ عُمَرَ  1‏ .‏‏1 ‏- انظر البخاري (6841)‏، ومسلم (1699)‏ .‏","english":{"narrator":"","text":"The story of stoning the two Jews is mentioned in Al-Bukhari and Muslim on the authority of Ibn 'Umar."}},{"id":11,"idInBook":11,"chapterId":10,"bookId":17,"arabic":"وَعَنْ سَعِيدِ بْنِ سَعْدِ بْنِ عِبَادَةَ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { كَانَ بَيْنَ أَبْيَاتِنَا رُوَيْجِلٌ ضَعِيفٌ, فَخَبَثَ بِأَمَةٍ مِنْ إِمَائِهِمْ, فَذَكَرَ ذَلِكَ سَعْدٌ لِرَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-فَقَالَ: \"اِضْرِبُوهُ حَدَّهُ\".‏ فَقَالُوا: يَا رَسُولَ اَللَّهِ! إِنَّهُ أَضْعَفُ مِنْ ذَلِكَ, فَقَالَ: \"خُذُوا عِثْكَالًا فِيهِ مِائَةُ شِمْرَاخٍ, ثُمَّ اِضْرِبُوهُ بِهِ ضَرْبَةً وَاحِدَةً\".‏ فَفَعَلُوا }  رَوَاهُ أَحْمَدُ, وَالنَّسَائِيُّ, وَابْنُ مَاجَهْ, وَإِسْنَادُهُ حَسَنٌ .‏ لَكِنْ اخْتُلِفَ فِي وَصْلِهِ وَإِرْسَالِهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه أحمد (522)‏، والنسائي في \"الكبرى\" (4 /313)‏، وابن ماجه (2754)‏.‏","english":{"narrator":"","text":"Sa'id bin Sa'd bin 'Ubadah (RAA) narrated, 'A small weak man was staying in our tribe, and he committed adultery with one of their slave-women. Sa'd mentioned this to the Messenger of Allah (ﷺ), and thereupon he said, \"Flog him (according to) the prescribed penalty.\" The people then said, 'O Messenger of Allah! He is too weak to bear it.' The Messenger of Allah (ﷺ) then said, \"Get a stalk of the raceme of a palm tree with a hundred twigs and strike him just once.\" So, they did. Related by Ahmad, An-Nasa'i and Ibn Majah with a good chain of narrators."}},{"id":12,"idInBook":12,"chapterId":10,"bookId":17,"arabic":"وَعَنْ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا; أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَالَ: { مَنْ وَجَدْتُمُوهُ يَعْمَلُ عَمَلَ قَوْمِ لُوطٍ, فَاقْتُلُوا اَلْفَاعِلَ وَالْمَفْعُولَ بِهِ, وَمَنْ وَجَدْتُمُوهُ وَقَعَ عَلَى بَهِيمَةٍ, فَاقْتُلُوهُ وَاقْتُلُوا اَلْبَهِيمَةَ }  \".‏ رَوَاهُ أَحْمَدُ وَالْأَرْبَعَةُ,  1‏ وَرِجَالُهُ مُوَثَّقُونَ, إِلَّا أَنَّ فِيهِ اِخْتِلَافًا  2‏ .‏‏1 ‏- في \"أ\" رواه \"الخمسة\" وأشار ناسخها في الهامش إلى نسخة \"أحمد والأربعة\".‏‏2 ‏- حسن.‏ رواه أحمد (1 /300)‏، وأبو داود (4462)‏، والنسائي (4 /322)‏، الترمذي (1456)‏، وابن ماجه (1561)‏ وهذا الحديث في الحقيقة حديثان جمعهما الحافظ هنا الأول حديث عمل قوم لوط، وهو المخرج هنا، والثاني حديث الوقوع على البهيمة وهو عندهم أيضا.‏ وسند الأول هو سند الثاني، وفيه عمرو بن أبي عمرو، وهو حسن الحديث.‏","english":{"narrator":"Ibn 'Abbas (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"\"Whoever you find doing as the people of Lot did (i.e. homosexuality), kill the one who does it and the one to whom it is done, and if you find anyone having sexual intercourse with animal, kill him and kill the animal.\" Related by Ahmad and the four Imams with a trustworthy chain of narrators."}},{"id":13,"idInBook":13,"chapterId":10,"bookId":17,"arabic":"وَعَنْ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا: { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-ضَرَبَ وَغَرَّبَ وَأَنَّ أَبَا بَكْرٍ ضَرَبَ وَغَرَّبَ.‏ }  رَوَاهُ اَلتِّرْمِذِيُّ, وَرِجَالُهُ ثِقَاتٌ, إِلَّا أَنَّهُ اخْتُلِفَ فِي رَفْعِهِ, وَوَقْفِهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه الترمذي (1438)‏، وزاد: \"وأن عمر ضرب وغرب\".‏ وسنده صحيح،، ولا يضر من رفعه ‏-وهو ثقات‏- وقف من وقفه.‏ والله أعلم.‏","english":{"narrator":"","text":"Ibn 'Umar (RAA) narrated, \"The Messenger of Allah (ﷺ) applied the punishment of flogging and also that of exile, Abu Bakr (RAA) applied the punishments of flogging and exile and also 'Umar applied them.\" Related by At-Tirmidhi with a trustworthy chain of narrators, but scholars differed over its being traced back to the Prophet (ﷺ) or only to the companion."}},{"id":14,"idInBook":14,"chapterId":10,"bookId":17,"arabic":"وَعَنْ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: لَعَنَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-اَلْمُخَنَّثِينَ مِنْ اَلرِّجَالِ, وَالْمُتَرَجِّلَاتِ مِنْ اَلنِّسَاءِ, وَقَالَ: { أَخْرِجُوهُمْ مِنْ بُيُوتِكُمْ }  رَوَاهُ اَلْبُخَارِيُّ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (6834)‏.‏","english":{"narrator":"","text":"Ibn 'Abbas (RAA) narrated, \"The Messenger of Allah (ﷺ) cursed men who are effeminate and women who take the similitude of men, and said, \"Get them out of your homes.\" Related by Al-Bukhari."}},{"id":15,"idInBook":15,"chapterId":10,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ اِدْفَعُوا اَلْحُدُودَ, مَا وَجَدْتُمْ لَهَا مَدْفَعًا }  أَخْرَجَهُ اِبْنُ مَاجَهْ, وَإِسْنَادُهُ ضَعِيفٌ  1‏‏1 ‏- ضعيف.‏ رواه ابن ماجه (2545)‏.‏","english":{"narrator":"Abu Hurairah (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"\"Avert the infliction of the prescribed punishment as long as you find a way out (i.e. to avoid their infliction). Related by Ibn Majah with a weak chain of narrators."}},{"id":16,"idInBook":16,"chapterId":10,"bookId":17,"arabic":"وَأَخْرَجَهُ اَلتِّرْمِذِيُّ, وَالْحَاكِمُ: مِنْ حَدِيثِ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا بِلَفْظِ { ادْرَأُوا اَلْحُدُودَ عَنْ اَلْمُسْلِمِينَ مَا اِسْتَطَعْتُمْ }  \" وَهُوَ ضَعِيفٌ أَيْضًا  1‏ .‏‏1 ‏- ضعيف جدا.‏ رواه الترمذي (1424)‏، والحاكم (4 /384)‏، وتمامه: \"فإن كان له مخرج فخلوا سبيله، فإن الإمام إن يخطئ في العفو خير من أن يخطئ في العقوبة\".‏ قلت: وفي سنده يزيد بن زياد الدمشقي وهو \"متروك\".‏","english":{"narrator":"At-Tirmidhi and Al-Hakim transmitted on the authority of 'Aishah (RAA) with the wording, 'Allah's Messenger (ﷺ) said:","text":"\"Avert infliction of the prescribed punishment on the Muslims as much as you can.\" It is also a weak hadith."}},{"id":17,"idInBook":17,"chapterId":10,"bookId":17,"arabic":"وَرَوَاهُ اَلْبَيْهَقِيُّ: عَنْ عَلِيٍّ ‏- رضى الله عنه ‏- (مِنْ)‏ قَوْلِهِ بِلَفْظِ: { ادْرَأُوا اَلْحُدُودَ بِالشُّبُهَاتِ }   1‏‏1 ‏- ضعيف جدا أيضا.‏ رواه البيهقي (838)‏.‏","english":{"narrator":"","text":"Al-Baihaqi transmitted on the authority of 'Ali (RAA) that he said, 'Avert the prescribed punishment by rejecting doubtful evidence.'"}},{"id":18,"idInBook":18,"chapterId":10,"bookId":17,"arabic":"وَعَنْ اِبْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ اِجْتَنِبُوا هَذِهِ اَلْقَاذُورَاتِ اَلَّتِي نَهَى اَللَّهُ تَعَالَى عَنْهَا, فَمَنْ أَلَمَّ بِهَا فَلْيَسْتَتِرْ بِسِتْرِ اَللَّهِ تَعَالَى, وَلِيَتُبْ إِلَى اَللَّهِ تَعَالَى, فَإِنَّهُ مَنْ يَبْدِ لَنَا صَفْحَتَهُ نُقِمْ عَلَيْهِ كِتَابَ اَللَّهِ عَزَّ وَجَلَّ }  رَوَاهُ اَلْحَاكِمُ, وَهُوَ فِي \n\"اَلْمُوْطَّإِ\" مِنْ مَرَاسِيلِ زَيْدِ بْنِ أَسْلَمَ  1‏ .‏‏1 ‏- صحيح.‏ وهو مخرج في \"مشكل الآثار \" للطحاوي برقم (91)‏.‏","english":{"narrator":"Ibn 'Umar (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"\"Avoid these filthy practices which Allah, the Almighty has prohibited. He who commits any of these, should conceal with Allah's Most High Veil (i.e. should not speak about it), and should turn to Allah, the Most High in repentance, for if anyone uncovers his hidden sins (to us), we shall inflict on him the punishment prescribed by Allah, the Al-Mighty.\" Related by Al-Hakim and in Al-Muwatta' but traced to its narrator Zaid bin Aslam as hadith Mursal."}},{"id":19,"idInBook":19,"chapterId":10,"bookId":17,"arabic":"عَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: { لَمَّا نَزَلَ عُذْرِي, قَامَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-عَلَى اَلْمِنْبَرِ, فَذَكَرَ ذَلِكَ وَتَلَا اَلْقُرْآنَ, فَلَمَّا نَزَلَ أَمَرَ بِرَجُلَيْنِ وَاِمْرَأَةٍ فَضُرِبُوا اَلْحَدَّ }  أَخْرَجَهُ أَحْمَدُ وَالْأَرْبَعَةُ  1‏ .‏‏1 ‏- ضعيف.‏ رواه احمد (6 /35)‏، وأبو داود (4474)‏، والنسائي في \"الكبرى\" (4 /325)‏، والترمذي (3181)‏، وابن ماجه (2567)‏ من طريق ابن إسحاق، عن عبد الله بن أبي بكر، عن عمرة، عن عائشة.‏","english":{"narrator":"","text":"'Aishah (RAA) narrated, 'When my vindication was revealed, the Prophet (ﷺ) mounted the pulpit and mentioned what happened and recited the verses of the Quran (which had been revealed). When he came down from the pulpit he ordered that two men and a women should be given the prescribed flogging (for this false accusation of 'Aishah (RAA) which is eighty lashes).' Related by Ahmad and the four Imams. Al-Bukhari refereed to it."}},{"id":20,"idInBook":20,"chapterId":10,"bookId":17,"arabic":"وَعَنْ أَنَسِ بْنِ مَالِكٍ ‏- رضى الله عنه ‏- قَالَ: { أَوَّلَ لِعَانٍ كَانَ فِي اَلْإِسْلَامِ أَنَّ شَرِيكَ بْنُ سَمْحَاءَ قَذَفَهُ هِلَالُ بْنُ أُمَيَّةَ بِاِمْرَأَتِهِ, فَقَالَ لَهُ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-\n\"اَلْبَيِّنَةَ وَإِلَّا فَحَدٌّ فِي ظَهْرِكَ \" }  اَلْحَدِيثَ أَخْرَجَهُ أَبُو يَعْلَي, وَرِجَالُهُ ثِقَاتٌ  1‏ .‏‏1 ‏- صحيح.‏ رواه أبو يعلي في \"المسند\" (2824)‏ ولكن لفظه عنده: \"يا هلال! أربعة شهود، وإلا.‏.‏.‏.‏.‏\" وهو مطول عنده.‏","english":{"narrator":"","text":"Anas bin Malik (RAA) narrated, \"The first Li'an that took place in Islam was when Hilal bin Umaiyah accused his wife of having committed adultery with Shuraik bin Sahma.' Thereupon the Messenger of Allah (ﷺ) said to him, \"Either you produce evidence (for your claim) or you will receive punishment on your back (i.e. flogged for your accusation of it is false.\" (refer to hadith no.1138). Related by Abu Ya'la with a trustworthy chain of narrators."}},{"id":21,"idInBook":21,"chapterId":10,"bookId":17,"arabic":"وَهُوَ فِي اَلْبُخَارِيِّ نَحْوُهُ مِنْ حَدِيثِ اِبْنِ عَبَّاسٍ  1‏ .‏‏1 ‏- روى البخاري (2671)‏ عن ابن عباس؛ أن هلال بن أمية قذف امرأته عند النبي صلى الله عليه وسلم بشريك بن سمحاء، فقال النبي صلى الله عليه وسلم \"البينة أو حد في ظهرك\" فقال: يا رسول الله إذا رأى أحدنا على امرأته رجلا ينطلق يلتمس البينة؟ فجعل يقول \"البينة و إلا حد في ظهرك\".‏","english":{"narrator":"","text":"Al-Bukhari related a similar hadith on the authority of Ibn 'Abbas (RAA)."}},{"id":22,"idInBook":22,"chapterId":10,"bookId":17,"arabic":"وَعَنْ عَبْدِ اَللَّهِ بْنِ عَامِرٍ بْنِ رَبِيعَةَ قَالَ: { لَقَدْ أَدْرَكَتُ أَبَا بَكْرٍ, وَعُمَرَ, وَعُثْمَانَ رَضِيَ اَللَّهُ عَنْهُمْ, وَمِنْ بَعْدَهُمْ, فَلَمْ أَرَهُمْ يَضْرِبُونَ اَلْمَمْلُوكَ فِي اَلْقَذْفِ إِلَّا أَرْبَعِينَ }  رَوَاهُ مَالِكٌ, وَالثَّوْرِيُّ فِي \n\"جَامِعِهِ\"  1‏ .‏‏1 ‏- صحيح.‏ وهو في \"الموطأ\" (2 /8287)‏ بنحوه ولم يذكر أبا بكر.‏","english":{"narrator":"","text":"'Abdullah bin 'Amir bin Rabi'ah narrated, 'I witnessed the time of Abu Bakr, 'Umar and 'Uthman (RAA), and those who came after them. I never saw them flogging a slave for Qadhf (false accusation of adultery) except forty lashes.' Related by Malik, and Ath-Thawri in his book al-Jami.'"}},{"id":23,"idInBook":23,"chapterId":10,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مِنْ قَذْفَ مَمْلُوكَهُ يُقَامُ عَلَيْهِ اَلْحَدُّ يَوْمَ اَلْقِيَامَةِ, إِلَّا أَنْ يَكُونَ كَمَا قَالَ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (6858)‏ ومسلم (1660)‏، واللفظ لمسلم وزاد: \"بالزنا\" بعد \"مملوكه\".‏ واما البخاري فعنده: \"وهو برئ مما قال جلد يوم القيامة\".‏ والباقي مثله.‏","english":{"narrator":"Abu Hurairah (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"\"He who accuses his slave of committing adultery (without proof) will be punished with the prescribed penalty on the Day of Resurrection unless it is (true) as he said.\" Agreed upon."}},{"id":24,"idInBook":24,"chapterId":10,"bookId":17,"arabic":"عَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-: { لَا تُقْطَعُ يَدُ سَارِقٍ إِلَّا فِي رُبُعِ دِينَارٍ فَصَاعِدًا }  مُتَّفَقٌ عَلَيْهِ.‏ وَاللَّفْظُ لِمُسْلِم ٍ  1‏ .‏ وَلَفْظُ اَلْبُخَارِيِّ: \n\"تُقْطَعُ اَلْيَدُ فِي رُبُعِ دِينَارٍ فَصَاعِدًا \"  2‏‏1 ‏- صحيح.‏ وهذا لفظ مسلم (1684)‏.‏‏2 ‏- البخاري (6789)‏.‏","english":{"narrator":"'Aishah (RAA) narrated that Allah's Messenger (ﷺ) said:","text":"\"A thief's hand should not be cut off except for a quarter of a Dinar or more.\" Agreed upon and the wording is from Muslim.\nThe version of Al-Bukhari reads, 'The hand of a thief is to be cut off for a quarter of a Dinar or more.\""}},{"id":25,"idInBook":25,"chapterId":10,"bookId":17,"arabic":"وَفِي رِوَايَةٍ لِأَحْمَدَ \n\"اِقْطَعُوا فِي رُبُعِ دِينَارٍ, وَلَا تَقْطَعُوا فِيمَا هُوَ أَدْنَى مِنْ ذَلِكَ\"  1‏‏1 ‏- المسند (6.‏","english":{"narrator":"","text":"In a version by Ahmad, \"Cut off a thief's hand for a quarter of Dinar, and do not cut it off for what is less than that.\""}},{"id":26,"idInBook":26,"chapterId":10,"bookId":17,"arabic":"وَعَنِ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا : { أَنَّ النَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَطَعَ فِي مِجَنٍ، ثَمَنُهُ ثَلَاثَةُ دَرَاهِمَ }  مُتَّفَقٌ عَلَيْهِ .‏  1‏‏1 ‏- .‏ 1229‏-وعن ابن عمر رضي الله عنهما؛ أن النبي صلى الله عليه وسلم قطع في مجن ثمنه ثلاثة دراهم.‏ متفق عليه.‏","english":{"narrator":"","text":"Ibn 'Umar (RAA) narrated that the Messenger of Allah (ﷺ) cut off the hand of a thief for stealing a shield that was worth three Dirhams. Agreed upon."}},{"id":27,"idInBook":27,"chapterId":10,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَعَنَ اَللَّهُ السَّارِقَ ؛ يَسْرِقُ الْبَيْضَةَ ، فَتُقْطَعُ يَدُهُ ، وَيَسْرِقُ الْحَبْلَ ، فَتُقْطَعُ يَدُهُ }  مُتَّفَقٌ عَلَيْهِ أَيْضًا.‏  1‏‏1 ‏- .‏ 1230‏- وعن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم لعن الله السارق، يسرق البيضة، فتقطع يده، ويسرق الحبل، فتقطع يده متفق عليه أيضا.‏","english":{"narrator":"Abu Hurairah (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"\"May Allah curse the thief who steals an egg for which his hand is cut off, or steals a rope for which his hand is to be cut off.' Agreed upon."}},{"id":28,"idInBook":28,"chapterId":10,"bookId":17,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا ؛ أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { أَتَشْفَعُ فِي حَدٍ مِنْ حُدُودِ الْلَّهِ ؟ \n\" .‏  1‏ ثُمَّ قَامَ فَاخْتَطَبَ ، فَقَالَ : \" أَيُّهَا  2‏ النَّاسُ ! إِنَّمَا هَلَكَ  3‏ الَّذِينَ مِنْ قَبْلِكُمْ أَنَّهُمْ كَانُوا إِذَا سَرَقَ فِيهِمُ الشَّرِيفُ تَرَكُوهُ ، وَإِذَا سَرَقَ فِيهِمُ الضَّعِيفُ أَقَامُوا عَلَيْهِ الْحَدَّ .‏ .‏ .‏ }  الْحَدِيثَ .‏ مُتَّفَقٌ عَلَيْهِ ، وَاللَّفْظُ لِمُسْلِمٍ .‏  4‏ ‍‍‍‍‍‍‍‍‍‍‍‍‍وَلَهُ مِنْ وَجْهٍ آخَرَ : عَنْ عَائِشَةَ : كَانَتِ امْرَأَةٌ تَسْتَعِيرُ الْمَتَاعَ ، وَتَجْحَدُهُ ، فَأَمَرَ الْنَّبِيُّ ‏- صلى الله عليه وسلم ‏-بِقَطْعِ يَدِهَا .‏  5‏‏1 ‏- .‏ 1231 ‏- وعن عائشة رضي الله عنها؛ أن رسول الله صلى الله عليه وسلم قال: أتشفع في حد من حدود الله؟.‏‏2 ‏- .‏ ثم قام فاختطب، فقال: \"أيها.‏‏3 ‏- الناس! إنما هلك.‏‏4 ‏- الذين من قبلكم أنهم كانوا إذا سرق فيهم الشريف تركوه، وإذا سرق فيهم الضعيف أقاموا عليه الحد….‏\" الحديث.‏ متفق عليه، واللفظ لمسلم.‏‏5 ‏- .‏ وله من وجه آخر: عن عائشة: كانت امرأة تستعير المتاع، وتجحده، فأمر النبي صلى الله عليه وسلم بقطع يدها.‏","english":{"narrator":"","text":"'Aishah (RAA) narrated, 'Allah's Messenger (ﷺ) said (to Usamah bin Zaid), \"Are you interceding with regards to one of Allah's prescribed penalties?\" Then he got up and addressed the people saying, \"O People! What destroyed the nations before you, was that when a noble person committed theft, they used to leave him (without punishment), but if a weak person among then committed theft, they would inflict the legal punishment on him\" Agreed upon and the wording is from Muslim.\nMuslim has another version on the authority of 'Aishah (RAA) who said, 'A woman used to borrow (people's) belongings and deny having taken them, so the Prophet (ﷺ) ordered that her hand be cut off.'"}},{"id":29,"idInBook":29,"chapterId":10,"bookId":17,"arabic":"وَعَنْ جَابِرٍ ‏- رضى الله عنه ‏- ، عَنِ النَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ : { لَيْسَ عَلَى خَائِنٍ وَلَا مُنْتَهِبٍ ، وِلَا مُخْتَلِسٍ ، قَطْعٌ }  رَوَاهُ أَحْمَدُ ، وَالْأَرْبَعَةُ  ، 1‏ وَصَحَّحَهُ التِّرْمِذِيُّ ، وَابْنُ حِبَّانَ .‏  2‏‏1 ‏- .‏ 146 1232‏- وعن جابر رضي الله عنه، عن النبي صلى الله عليه وسلم قال: ليس على خائن ولا منتهب، ولا مختلس، قطع رواه أحمد والأربعة.‏‏2 ‏- .‏ وصححه الترمذي، وابن حبان.‏","english":{"narrator":"Jabir (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"\"There is no cutting of the hand for the treacherous, for snatching (like the one who snatches and runs away), or for forcibly seizure (looting or robbery).\" Related by Ahmad and the four Imams. At-Tirmidhi and Ibn-Hibban graded it as Sahih."}},{"id":30,"idInBook":30,"chapterId":10,"bookId":17,"arabic":"وَعَنْ رَافِعِ بْنِ خَدِيجٍ ‏- رضى الله عنه ‏- ، قَالَ سَمِعْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ :  : 1‏ { لَا قَطْعَ فِي ثَمَرٍ وَلَا كَثَرٍ }  رَوَاهُ اَلْمَذْكُورُونَ, وَصَحَّحَهُ أَيْضًا اَلتِّرْمِذِيُّ, وَابْنُ حِبَّان َ  2‏ .‏‏1 ‏- كذا \"بالأصلين\"، وأشار ناسخ \"أ\" في الهامش إلى نسخة أخرى: \"النبي\".‏‏2 ‏- صحيح.‏ رواه أحمد (3 /463 و464، 540 و141)‏، وأبو داود (4388)‏، والنسائي (8.‏","english":{"narrator":"","text":"Rafi' bin Khudiaj (RAA) narrated, 'I heard the Messenger of Allah (ﷺ) say, \"There is no cutting off of a hand for taking fruit or the pith of a palm tree.\" Related by Ahmad and four Imams. At-Tirmidhi and Ibn Hibban graded it as Sahih."}},{"id":31,"idInBook":31,"chapterId":10,"bookId":17,"arabic":"وَعَنْ أَبِي أُمَيَّةَ الْمَخْزُومِيِّ ‏- رضى الله عنه ‏- قَالَ: { أُتِِيَ النَّبِيُّ ‏- صلى الله عليه وسلم ‏-بِلِصٍّ قَدِ اعْتَرَفَ اعْتِرَافًا، وَلَمْ يُوجَدْ مَعَهُ مَتَاعٌ، فَقَالَ رَسُولُ اللَّهِ ‏- صلى الله عليه وسلم ‏-\"مَا إِخَالَكَ سَرَقْتَ\".‏ قَالَ: بَلَى، فَأَعَادَ عَلَيْهِ مَرَّتَيْنِ أَوْ ثَلَاثًا، فَأَمَرَ بِهِ فَقُطِعَ.‏ وَجِيءَ بِهِ، فَقَالَ: \"اسْتَغْفِرِ اللَّهَ وَتُبْ إِلَيْهِ\"، فَقَالَ: أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ، فَقَالَ: \"اللَّهُمَّ تُبْ عَلَيْهِ\" ثَلَاثًا }  أَخْرَجَهُ أَبُو دَاوُدَ وَاللَّفْظُ لَهُ، وَأَحْمَدُ، وَالنَّسَائِيُّ، وَرِجَالُهُ ثِقَاتٌ  1‏ .‏‏1 ‏- .‏ 147 1234‏- وعن أبي أمية المخزومي رضي الله عنه قال: أتى النبي صلى الله عليه وسلم بلص قد اعترف اعترافا، ولم يوجد معه متاع، فقال رسول الله صلى الله عليه وسلم: \"ما إخالك سرقت\".‏ قال: بلى.‏ فأعاد عليه مرتين أو ثلاثا، فأمر به فقطع.‏ وجئ به، فقال: \"استغفر الله وتب إليه\".‏ فقال: أستغفر الله وأتوب إليه.‏ فقال: \"اللهم تب عليه\" ثلاثا أخرجه أبو داود واللفظ له، وأحمد، والنسائي، ورجاله ثقات.‏","english":{"narrator":"","text":"Abu Umaiyah al-Makhzumi (RAA) narrated, 'A thief who has made a confession was brought to the Messenger of Allah (ﷺ) but no goods were found with him. Allah's Messenger (ﷺ) said to him, \"I do not think you have stolen!\" The man replied, 'Yes I have.' The Prophet (ﷺ) repeated it to him twice or thrice, so he gave his commands concerning him, and his hand was cut off. He was then brought to the Messenger of Allah (ﷺ) who said to him, \"Ask forgiveness of Allah and turn to Him in repentance.\" The man said, 'I ask Allah's forgiveness and turn to Him in repentance.' The Messenger of Allah (ﷺ) then said three times, \"O Allah! forgive him.\" Related by Abu Dawud, Ahmad and An-Nasa'i with a trustworthy chain or narrators, and it is Abu Dawud's version."}},{"id":32,"idInBook":32,"chapterId":10,"bookId":17,"arabic":"وَأَخْرَجَهُ الْحَاكِمُ مِنْ حَدِيثِ أَبِي هُرَيْرَةَ، فَسَاقَهُ بِمَعْنَاهُ، وَقَالَ فِيهِ: { اذْهَبُوا بِهِ، فَاقْطَعُوهُ، ثُمَّ احْسِمُوهُ }  .‏ وَأَخْرَجَهُ الْبَزَّارُ أَيْضًا، وَقَالَ: لَا بَأْسَ بِإِسْنَادِهِ  1‏ .‏‏1 ‏- .‏ 1235‏- وأخرجه الحاكم من حديث أبي هريرة، فساقه بمعناه، وقال فيه: \"اذهبوا به، فاقطعوه، ثم احسموه\".‏ وأخرجه البزار أيضا، وقال: لا بأس بإسناده.‏","english":{"narrator":"Al-Hakim transmitted the same hadith on the authority of Abu Hurairah (RAA) giving similar meaning. The Messenger of Allah (ﷺ) said:","text":"\"Take him away and cut off his hand and cauterize him.\" Al-Bazzar transmitted the same hadith but commented that its chain of narrators is not sound."}},{"id":33,"idInBook":33,"chapterId":10,"bookId":17,"arabic":"وَعَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ رَضِيَ اللَّهُ عَنْهُ؛ أَنَّ رَسُولَ اللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { لَا يَغْرَمُ السَّارِقُ إِذَا أُقِيمَ عَلَيْهِ الْحَدُّ }  رَوَاهُ النَّسَائِيُّ، وَبَيَّنَ أَنَّهُ مُنْقَطِعٌ.‏ وَقَالَ أَبُو حَاتِمٍ: هُوَ مُنْكَرٌ  1‏  .‏‏1 ‏- .‏ 1236‏- وعن عبد الرحمن بن عوف رضي الله عنه؛ أن رسول الله صلى الله عليه وسلم قال: لا يغرم السارق إذا أقيم عليه الحد رواه النسائي، وبين أنه منقطع.‏ وقال أبو حاتم: هو منكر.‏","english":{"narrator":"'Abdur Rahman bin 'Auf (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"\"A thief is not to be fined if the prescribed punishment has been inflicted on him.\" Related by An-Nasa'i who said that its chain of narrators is disconnected."}},{"id":34,"idInBook":34,"chapterId":10,"bookId":17,"arabic":"وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ رَضِيَ اللَّهُ عَنْهُمَا، عَنْ رَسُولِ اللَّهِ  ‏- صلى الله عليه وسلم ‏-؛ { أَنَّهُ سُئِلَ عَنِ التَّمْرِ الْمُعَلَّقِ؟ فَقَالَ: \"مَنْ أَصَابَ بِفِيهِ مِنْ ذِي حَاجَةٍ، غَيْرَ مُتَّخِذٍ خُبْنَةً، فَلَا شَيْءَ عَلَيْهِ، وَمَنْ خَرَجَ بِشَيْءٍ مِنْهُ، فَعَلَيْهِ الْغَرَامَةُ وَالْعُقُوبَةُ، وَمَنْ خَرَجَ بِشَيْءٍ مِنْهُ بَعْدَ أَنْ يُؤْوِيَهُ الْجَرِينُ، فَبَلَغَ ثَمَنَ الْمِجَنِّ فَعَلَيْهِ الْقَطْعُ }  أَخْرَجَهُ أَبُو دَاوُدَ، وَالنَّسَائِيُّ، وَصَحَّحَهُ الْحَاكِمُ  1‏‏1 ‏- .‏ 148 1237‏- وعن عبد الله بن عمرو بن العاص رضي الله عنهما، عن رسول الله صلى الله عليه وسلم؛ أنه سئل عن التمر المعلق؟ فقال: \"من أصاب بفيه من ذي حاجة، غير متخذ خبنة، فلا شيء عليه، ومن خرج بشيء منه، فعليه الغرامة والعقوبة، ومن خرج بشيء منه بعد أن يؤويه الجرين، فبلغ ثمن المجن فعليه القطع أخرجه أبو داود، والنسائي، وصححه الحاكم.‏","english":{"narrator":"","text":"'Abdullah bin 'Amro bin al-'As (RAA) narrated, 'The Messenger of Allah (ﷺ) was asked about dated which are still hanging on the palm tree, he then said, \"If a needy person eats some dates, but without taking a supply away in his garment, he is not to be blamed, but if anyone takes away any of it, he is to be fined and punished. And if anyone takes away any of it (the dates) after it has been put in the place where it is going to be dried, and it amounts to the price of a shield, he must have his hand cut off.\" Related by Abu Dawud and An-Nasa'i. Al-Hakim graded it as Sahih."}},{"id":35,"idInBook":35,"chapterId":10,"bookId":17,"arabic":"وَعَنْ صَفْوَانَ بْنِ أُمِّيَّةٍ ‏- رضى الله عنه ‏- أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَالَ لَهُ لَمَّا أَمَرَ بِقَطْعِ اَلَّذِي سَرَقَ رِدَاءَهُ, فَشَفَعَ فِيهِ: { هَلَّا كَانَ ذَلِكَ قَبْلِ أَنْ تَأْتِيَنِي بِهِ? }  أَخْرَجَهُ أَحْمَدُ, وَالْأَرْبَعَةَ  1‏ .‏ وَصَحَّحَهُ اِبْنُ اَلْجَارُودِ, وَالْحَاكِم ُ  2‏ .‏‏1 ‏- كذا \"بالأصلين\" وأشار ناسخ \"أ\" في الهامش إلى نسخة أخرى: \"الخمسة\".‏‏2 ‏- صحيح.‏ رواه أحمد (6 /466)‏ وأبو داود (4394)‏، والنسائي (8 /69)‏، وابن ماجه (2595)‏، وابن الجارود (828)‏، والحاكم (4 /380)‏ ‏- وطرقهم مختلفة ‏- عن صفوان بن أمية قال: كنت نائما في المسجد على خميصة لي ثمن ثلاثين درهما، فجاء رجل فاختلسها مني، فأخذ الرجل، فأتي به رسول الله صلى الله عليه وسلم، فأمر به ليقطع.‏ قال: فأتيته، فقلت: أتقطعه من أجل ثلاثين درهما! أنا أبيعه وأنسئه ثمنها.‏ قال: فذكره.‏ والسياق لأبي داود.‏ \"تنبيه\" عزو الحديث للأربعة وهم من الحافظ ‏-رحمه الله‏- إذ لم يروه الترمذي.‏","english":{"narrator":"","text":"Safwan bin Umaiyah (RAA) narrated, 'When the Messenger of Allah (ﷺ) commanded that the thief who had stolen his cloak (i.e. Safwan's) should have his hand cut off. Safwan wanted to intercede, for the thief's hand not to be removed. Thereupon the Messenger of Allah (ﷺ) said to him, \"Why didn't you do so before bringing him to me?\" Related by Ahmad, the four Imams, and Al-Hakim graded it as Sahih."}},{"id":36,"idInBook":36,"chapterId":10,"bookId":17,"arabic":"وَعَنْ جَابِرٍ قَالَ: جِيءَ بِسَارِقٍ إِلَى اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-فَقَالَ: { \"اُقْتُلُوهُ\".‏ فَقَالُوا يَا رَسُولَ اَللَّهِ! إِنَّمَا سَرَقَ.‏ قَالَ: \"اِقْطَعُوهُ\" فَقَطَعَ, ثُمَّ جِيءَ بِهِ اَلثَّانِيَةِ, فَقَالَ \"اُقْتُلُوهُ\" فَذَكَرَ مِثْلَهُ, ثُمَّ جِيءَ بِهِ اَلرَّابِعَةِ كَذَلِكَ, ثُمَّ جِيءَ بِهِ اَلْخَامِسَةِ فَقَالَ: \"اُقْتُلُوهُ\" }  أَخْرَجَهُ أَبُو دَاوُدَ, وَالنِّسَائِيُّ, وَاسْتَنْكَرَه ُ  1‏ .‏‏1 ‏- ضعيف.‏ رواه أبو داود (4410)‏، والنسائي (8/90 ‏-91)‏ من طريق مصعب بن ثابت، عن محمد بن المنكدر، عن جابر.‏ به.‏ قال النسائي: \"هذا حديث منكر، ومصعب بن ثابت ليس بالقوي في الحديث\".‏","english":{"narrator":"Jabir (RAA) narrated, 'A thief was brought to the Prophet (ﷺ) and he said to them, \"Kill him.\" The people said, 'He has just stolen O Messenger of Allah!' He then said, \"Cut off his hand.\" He was brought to him the second time and the Messenger of Allah (ﷺ) also said, \"Kill him.\" They said the same and the Messenger of Allah (ﷺ) said to them, 'Cut off his hand.\" The same man was brought a third time and a fourth time and same was said. When they brought him the fifth time, the Messenger of Allah (ﷺ) said:","text":"\"Kill him.\" Related by Abu Dawud and An-Nasa'i who regarded it as Munkar (a type of weak hadith)."}},{"id":37,"idInBook":37,"chapterId":10,"bookId":17,"arabic":"وَأَخْرُجَ مِنْ حَدِيثِ اَلْحَارِثِ بْنِ حَاطِبٍ نَحْوَه ُ  1‏ .‏ وَذَكَرَ اَلشَّافِعِيُّ أَنَّ اَلْقَتْلَ فِي اَلْخَامِسَةِ مَنْسُوخٌ.‏‏1 ‏- رواه النسائي (8.‏","english":{"narrator":"","text":"Ab-Nasa'i also reported a similar hadith on the authenticity of Al-Harith bin Hatib. Ash-Shafi'i mentioned that the killing in the fifth time (of stealing) is abrogated."}},{"id":38,"idInBook":38,"chapterId":10,"bookId":17,"arabic":"عَنْ أَنَسِ بْنِ مَالِكٍ ‏- رضى الله عنه ‏- { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-أَتَى بِرَجُلٍ قَدْ شَرِبَ اَلْخَمْرَ, فَجَلَدَهُ بِجَرِيدَتَيْنِ نَحْوَ أَرْبَعِينَ.‏ قَالَ: وَفَعَلَهُ أَبُو بَكْرٍ, فَلَمَّا كَانَ عُمَرُ اِسْتَشَارَ اَلنَّاسَ, فَقَالَ عَبْدُ اَلرَّحْمَنِ بْنُ عَوْفٍ: أَخَفَّ اَلْحُدُودِ ثَمَانُونَ, فَأَمَرَ بِهِ عُمَرُ }  مُتَّفَقٌ عَلَيْهِ .‏  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (6773)‏، ومسلم (1706)‏ واللفظ لمسلم.‏ \"تنبيه\": الرواية: \"أخف الحدود ثمانون\" وليس كما ذكرها الحافظ، ولتوجيه ذلك انظر \"الفتح\".‏","english":{"narrator":"","text":"Anas bin Malik (RAA) narrated, 'A man who had drunk wine was brought to the Prophet (ﷺ) and he commanded that the man should be beaten (lashed). The man was given about forty lashes with two palm branches. Anas added, Abu Bakr (RAA) did the same, but when 'Umar (RAA) became the Caliph, he consulted the people and 'Abdur Rahman bin 'Auf said, \"The mildest punishment for drinking is eighty (lashes).' So, 'Umar (RAA) gave his commands accordingly. Agreed upon."}},{"id":39,"idInBook":39,"chapterId":10,"bookId":17,"arabic":"وَلِمُسْلِمٍ: عَنْ عَلِيٍّ ‏- رضى الله عنه ‏- ‏-فِي قِصَّةِ اَلْوَلِيدِ بْنِ عَقَبَةَ‏- { جَلَدَ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-أَرْبَعِينَ, وَأَبُو بَكْرٍ أَرْبَعِينَ, وَعُمَرُ ثَمَانِينَ, وَكُلٌّ سُنَّةٌ, وَهَذَا أَحَبُّ }","english":{"narrator":"","text":"Muslim transmitted on the authority of 'Ali (RAA) concerning the story of al-Walid bin 'Uqbah that the Messenger of Allah inflicted forty lashes, Abu Bakr (RAA) forty lashes and 'Umar (RAA) eighty. All of them are in accordance with the Sunnah of the Prophet (ﷺ) but this one (the eighty lashes) is preferable to me."}},{"id":40,"idInBook":40,"chapterId":10,"bookId":17,"arabic":"إِلَيَّ.‏ وَفِي هَذَا اَلْحَدِيثِ: { أَنَّ رَجُلًا شَهِدَ عَلَيْهِ أَنَّهُ رَآهُ يَتَقَيَّأْ اَلْخَمْرَ, فَقَالَ عُثْمَانُ: إِنَّهُ لَمْ يَتَقَيَّأْهَا حَتَّى شَرِبَهَا }   1‏ .‏‏1 ‏- صحيح رواه مسلم (1707)‏.‏","english":{"narrator":"In this hadith also a man witnessed that he had seen him vomiting wine, 'Uthman (RAA) said:","text":"'He would not have vomited it, unless that he had drunk it.'"}},{"id":41,"idInBook":41,"chapterId":10,"bookId":17,"arabic":"وَعَنْ مُعَاوِيَةَ ‏- رضى الله عنه ‏- عَنْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-أَنَّهُ قَالَ فِي شَارِبِ اَلْخَمْرِ: { إِذَا شَرِبَ فَاجْلِدُوهُ, ثُمَّ إِذَا شَرِبَ  فَاجْلِدُوهُ, ثُمَّ إِذَا شَرِبَ اَلثَّالِثَةِ فَاجْلِدُوهُ, ثُمَّ إِذَا شَرِبَ اَلرَّابِعَةِ فَاضْرِبُوا عُنُقَهُ }  أَخْرَجَهُ أَحْمَدُ وَهَذَا لَفْظُهُ, وَالْأَرْبَعَة ُ  1‏ .‏‏1 ‏- صحيح رواه أحمد ( 4 / 96 و 101 )‏ والنسائي في \" الكبرى\"، وأبو داود ( 4482 )‏، والترمذي ( 1444 )‏، وابن ماجه ( 2573 )‏.‏","english":{"narrator":"","text":"Mu'awiyah (RAA) narrated that the Messenger of Allah (ﷺ) said regarding the one who drinks alcohol, 'If he drinks (for the first time) flog him, then if he drinks for the second time flog him, then if he drinks for the third time flog him then if he drinks for the fourth time you should kill him.\" Related by Ahmad and the wording is his. It is also transmitted by the four Imams."}},{"id":42,"idInBook":42,"chapterId":10,"bookId":17,"arabic":"وَذَكَرَ اَلتِّرْمِذِيُّ مَا يَدُلُّ عَلَى أَنَّهُ مَنْسُوخٌ, وَأَخْرَجَ ذَلِكَ أَبُو دَاوُدَ صَرِيحًا عَنْ اَلزُّهْرِيّ ِ  1‏ .‏‏1 ‏- الاحتجاج بنسخ الحديث مجرد دعوى كما بين ذلك العلامة الشيخ أحمد شاكر رحمه الله في بحثه النفيس على مسند الإمام أحمد عند الحديث رقم ( 6197 )‏ والذي طبع مفردا بعد ذلك.‏","english":{"narrator":"","text":"At-Tirmidhi mentioned what indicates that it is abrogated, but Abu Dawud reported it clearly on the authority of Az-Zuhari."}},{"id":43,"idInBook":43,"chapterId":10,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ \n\" إِذَا ضَرَبَ أَحَدُكُمْ فَلْيَتَّقِ اَلْوَجْهَ\" }  مُتَّفَقٌ عَلَيْه ِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 5 / 182 / فتح )‏، ومسلم ( 2612 )‏، واللفظ الذي ذكره الحافظ هو لمسلم، لكنه ملفق من روايتين كل شطر من رواية.‏ وعنده زيادة لفظ: \" أخاه\" .‏ ولم يقع هذا اللفظ في رواية البخاري.‏ ولكن لفظه:\" إذا قاتل أحدكم فليجتنب الوجه\" وهو رواية لمسلم مع زيادة اللفظ المذكور آنفا، ومع زيادة أخرى، وهي قوله: \" فإن الله خلق آدم على صورته\" .‏ وانظر لهذا الحديث\" كتاب التوحيد\" لإمام الأئمة بتحقيقنا.‏","english":{"narrator":"Abu Hurairah (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"\"When one of you is flogging (while inflicting a prescribed punishment) he should avoid the face.\" Agreed upon."}},{"id":44,"idInBook":44,"chapterId":10,"bookId":17,"arabic":"وَعَنْ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ \n\" لَا تُقَامُ اَلْحُدُودُ فِي اَلْمَسَاجِدِ\" }  رَوَاهُ اَلتِّرْمِذِيُّ, وَالْحَاكِم ُ  1‏ .‏‏1 ‏- حسن.‏ رواه الترمذي ( 1401 )‏، والحاكم ( 4 / 369 )‏ وهو وإن كان ضعيف السند عندهما إلا أن له شواهد يتقوى بها، كما ذهب إلى ذلك الحافظ نفسه في\" التلخيص\".‏","english":{"narrator":"Ibn 'Abbas (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"\"Prescribed punishments are not to be inflicted in mosques.\" Related by At-Tirmidhi and Al-Hakim."}},{"id":45,"idInBook":45,"chapterId":10,"bookId":17,"arabic":"وَعَنْ أَنَسٍ ‏- رضى الله عنه ‏- قَالَ: { لَقَدْ أَنْزَلَ اَللَّهُ تَحْرِيمَ اَلْخَمْرِ, وَمَا بِالْمَدِينَةِ شَرَابٌ يَشْرَبُ إِلَّا مِنْ تَمْرٍ }  أَخْرَجَهُ مُسْلِم ٌ  1‏ .‏‏1 ‏- حسن رواه مسلم ( 1982 )‏.‏","english":{"narrator":"","text":"Anas (RAA) narrated, 'Allah sent down the verses stating the prohibition of alcohol when there was no other beverage to drink in Madinah except that prepared from dates (wine of dates).' Related by Muslim."}},{"id":46,"idInBook":46,"chapterId":10,"bookId":17,"arabic":"وَعَنْ عُمَرَ ‏- رضى الله عنه ‏- قَالَ: { نَزَلَ تَحْرِيمُ اَلْخَمْرِ, وَهِيَ مِنْ خَمْسَةِ: مِنْ اَلْعِنَبِ, وَالتَّمْرِ, وَالْعَسَلِ, وَالْحِنْطَةِ, وَالشَّعِيرِ.‏ وَالْخَمْرُ: مَا خَامَرَ اَلْعَقْلَ }  مُتَّفَقٌ عَلَيْه ِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 5581 )‏، ومسلم ( 3032 )‏.‏","english":{"narrator":"","text":"'Umar (RAA) narrated, 'When the prohibition of Khamr (alcoholic drinks) was revealed, it used to be made from grapes, dates, honey, wheat and barley. Khamr is what shields one's mind' Agreed upon."}},{"id":47,"idInBook":47,"chapterId":10,"bookId":17,"arabic":"وَعَنْ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا; عَنْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { \n\" كُلُّ مُسْكِرٍ خَمْرٌ, وَكُلُّ مُسْكِرٍ حَرَامٌ\" }  أَخْرَجَهُ مُسْلِم ُ  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم ( 2003 )‏، وفي رواية ( ….‏.‏.‏.‏ وكل خمر حرام )‏.‏ وزاد في أخرى: \" من شرب الخمر في الدنيا فمات وهو يدمنها، ولم يتب، لم يشربها في الآخرة\".‏","english":{"narrator":"Ibn 'Umar (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"\"Every intoxicant is Khamr, and every intoxicant is prohibited.\" Related by Muslim."}},{"id":48,"idInBook":48,"chapterId":10,"bookId":17,"arabic":"وَعَنْ جَابِرٍ ‏- رضى الله عنه ‏- أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { \n\" مَا أَسْكَرَ كَثِيرُهُ, فَقَلِيلُهُ حَرَامٌ\" }  أَخْرَجَهُ أَحْمَدُ, وَالْأَرْبَعَة ُ  1‏ .‏ وَصَحَّحَهُ اِبْنُ حِبَّان َ  2‏ .‏‏1 ‏- كذا\" بالأصلين\" وأشار ناسخ\" أ\" في الهامش إلى نسخة\" الخمسة\" .‏‏2 ‏- صحيح رواه أحمد ( 3 / 343 )‏، وأبو داود ( 3681 )‏، والترمذي ( 1865 )‏، وابن ماجه ( 3393 )‏، وابن حبان ( 5358 )‏، وسنده حسن إلا أن له شواهد يصح بها.‏ \"تنبيه\" عزوه للأربعة وهم من الحافظ ‏- رحمه الله ‏- إذ لم يروه النسائي.‏","english":{"narrator":"Jabir (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"\"If a large quantity of any beverage intoxicates, then a small amount of it is prohibited.\" Related by Ahmad and the four Imams. Ibn Hibban graded it as Sahih."}},{"id":49,"idInBook":49,"chapterId":10,"bookId":17,"arabic":"وَعَنْ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { كَانَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يُنْبَذُ لَهُ اَلزَّبِيبُ فِي اَلسِّقَاءِ, فَيَشْرَبُهُ يَوْمَهُ, وَالْغَدَ, وَبَعْدَ اَلْغَدِ, فَإِذَا كَانَ مَسَاءُ اَلثَّالِثَةِ شَرِبَهُ وَسَقَاهُ, فَإِنْ فَضَلَ شَيْءٌ أَهْرَاقَهُ }  أَخْرَجَهُ مُسْلِم ٌ  1‏ .‏‏1 ‏- صحيح رواه مسلم ( 2004 )‏ ( 82 )‏.‏","english":{"narrator":"","text":"Ibn 'Abbas (RAA) narrated, 'Raisins used to be soaked for the Messenger of Allah (ﷺ) in a water skin, and he would drink it that day, the next day and the following day. When it was the evening of the third day, he would drink it and give some to others. If anything was left from it, he would spill it.' Related by Muslim."}},{"id":50,"idInBook":50,"chapterId":10,"bookId":17,"arabic":"وَعَنْ أُمِّ سَلَمَةَ رَضِيَ اَللَّهُ عَنْهَا, عَنْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { \n\" إِنَّ اَللَّهَ لَمْ يَجْعَلْ شِفَاءَكُمْ فِيمَا حَرَّمَ عَلَيْكُمْ\" }  أَخْرَجَهُ اَلْبَيْهَقِيُّ, وَصَحَّحَهُ اِبْنُ حِبَّان َ  1‏ .‏‏1 ‏- حسن.‏ رواه البيهقي ( 10 / 5 )‏، وابن حبان ( 1391 )‏، عن أم سلمة قالت: نبذت نبيذا في كوز فدخل رسول الله صلى الله عليه وسلم ‏- وهو يغلي ‏- فقال: \" ما هذا ؟\" قلت: اشتكت انبة لي فنبذت لها هذا، فقال رسول الله صلى الله عليه وسلم: ….‏.‏.‏.‏.‏.‏.‏ فذكره.‏ واللفظ للبيهقي.‏ وفي رواية ابن حبان:\" ….‏.‏.‏.‏.‏.‏.‏.‏ في حرام\".‏ قلت: وله شاهد صحيح، عن ابن مسعود.‏","english":{"narrator":"Umm Salamah (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"\"Allah did not make your cure in what He made Haram (unlawful) to you.\" Related by Al-Baihaqi and graded as Sahih by Ibn Hibban."}},{"id":51,"idInBook":51,"chapterId":10,"bookId":17,"arabic":"وَعَنْ وَائِلٍ اَلْحَضْرَمِيِّ; أَنَّ طَارِقَ بْنَ سُوَيْدٍ رَضِيَ اَللَّهُ عَنْهُمَا { سَأَلَ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-عَنْ اَلْخَمْرِ يَصْنَعُهَا لِلدَّوَاءِ? فَقَالَ:\n\" إِنَّهَا لَيْسَتْ بِدَوَاءٍ, وَلَكِنَّهَا دَاءٌ\" }  أَخْرَجَهُ مُسْلِمٌ.‏ وَأَبُو دَاوُدَ وَغَيْرُهُمَ ا  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم ( 1984 )‏، وأبو داود ( 3873 )‏ واللفظ لمسلم؛ إلا أنه عنده عنه بتذكير الضمير\" إنه.‏ .‏.‏.‏.‏ ولكنه\".‏","english":{"narrator":"","text":"Wa'il Al-Hadrami narrated that Tariq bin Suwaid asked the Messenger of Allah (ﷺ) about Khamr which he made only to be used as a medicine. The Prophet (ﷺ) replied, \"It is not a medicine, it is a disease.\" Related by Muslim and Abu Dawud."}},{"id":52,"idInBook":52,"chapterId":10,"bookId":17,"arabic":"عَنْ أَبِي بُرْدَةَ اَلْأَ نْصَارِيِّ ‏- رضى الله عنه ‏- أَنَّهُ سَمِعَ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ: { \n\" لَا يُجْلَدُ فَوْقَ عَشَرَةِ أَسْوَاطٍ, إِلَّا فِي حَدِّ مِنْ حُدُودِ اَللَّهِ\" }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 175 ‏- 176 / فتح )‏، ومسلم ( 1708 )‏.‏","english":{"narrator":"","text":"Abu Burdah Al-Ansari (RAA) narrated that he heard the Messenger of Allah (ﷺ) say, \"No more than ten lashes are to be given except when inflicting one of the Hudud (prescribed punishments) of Allah.\" Agreed upon."}},{"id":53,"idInBook":53,"chapterId":10,"bookId":17,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَالَ: { \n\" أَقِيلُوا ذَوِي اَلْهَيْئَاتِ عَثَرَاتِهِمْ إِلَّا اَلْحُدُودَ\" }  رَوَاهُ أَبُو دَاوُدَ, وَالنَّسَائِيُّ  1‏ .‏‏1 ‏- حسن.‏ رواه أبو داود ( 4375 )‏، والنسائي في\" الكبرى\" .‏ وله شواهد تقويه.‏","english":{"narrator":"'Aishah (RAA) narrated that Allah's Messenger (ﷺ) said:","text":"\"Forgive the people with high moral values when they slip but not what calls for the infliction of Hudud.\" Related by Ahmad, Abu Dawud, An-Nasa'i and Al-Baihaqi."}},{"id":54,"idInBook":54,"chapterId":10,"bookId":17,"arabic":"وَعَنْ عَلِيٍّ ‏- رضى الله عنه ‏- قَالَ: { مَا كُنْتُ لِأُقِيمَ عَلَى أَحَدٍ حَدًّا, فَيَمُوتُ, فَأَجِدُ فِي نَفْسِي, إِلَّا شَارِبَ الْخَمْرِ; فَإِنَّهُ لَوْ مَاتَ وَدَيْتُهُ }  أَخْرَجَهُ اَلْبُخَارِيُّ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 6778 )‏ وعنده: \" صاحب خمر\" بدل: \" شارب خمر\" وزاد: \" وذلك أن رسول الله صلى الله عليه وسلم لم يسنه\".‏","english":{"narrator":"","text":"'Ali (RAA) narrated, 'I would not blame myself for the death of a man when I inflicted prescribed punishment on him, with the exception of one who drunk Khamr, for if he were to die, I would pay Diyah for him.'"}},{"id":55,"idInBook":55,"chapterId":10,"bookId":17,"arabic":"وَعَنْ سَعِيدِ بْنِ زَيْدٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ \n\" مِنْ قُتِلَ دُونَ مَالِهِ فَهُوَ شَهِيدٌ\" }  رَوَاهُ اَلْأَرْبَعَةُ, وَصَحَّحَهُ اَلتِّرْمِذِيُّ  1‏‏1 ‏- صحيح.‏ رواه أبو داود ( 4772 )‏، والنسائي ( 7 / 116 )‏، والترمذي ( 1421 )‏، وابن ماجه ( 2580 )‏ واقتصر على هذه الجملة فقط.‏ وزاد الباقون: \" ومن قتل دون دينه فهو شهيد، ومن قتل دون دمه فهو شهيد، ومن قتل دون أهله فهو شهيد\" والسياق للترمذي ‏-وليست الجملة الأولى عند النسائي‏- وقال: \"هذا حديث حسن صحيح\".‏ قلت: وانظر رقم (1198)‏.‏","english":{"narrator":"Sa'id bin Zaid (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"\"Whoever is killed while protecting his property, he is a martyr.\" Related by the four Imams and At-Tirmidhi graded it as Sahih."}},{"id":56,"idInBook":56,"chapterId":10,"bookId":17,"arabic":"وَعَنْ عَبْدِ اَللَّهِ بْنِ خَبَّابٍ : سَمِعْتَ أَبِي ‏- رضى الله عنه ‏- يَقُولُ: سَمِعْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ: { \" تَكُونُ فِتَنٌ, فَكُنْ فِيهَا عَبْدَ اَللَّهِ اَلْمَقْتُولَ, وَلَا تَكُنْ اَلْقَاتِلَ\" }  أَخْرَجَهُ ابْنُ أَبِي خَيْثَمَةَ.‏ وَاَلدَّارَقُطْنِيُّ  1‏ .‏‏1 ‏- حسن بشواهده.‏ وهذا الحديث مداره على رجل من عبد القيس، وهو\" مجهول\".‏","english":{"narrator":"'Abdullah bin Khabbab (RAA) narrated, 'I heard my father say:","text":"'I heard the Messenger of Allah (ﷺ) say, \"There will be times of Fitan, so O slave of Allah be in it the one who is killed and do not be the killer.\" Related by Abu Khaithamah and Ad-Daraqutni."}},{"id":57,"idInBook":57,"chapterId":10,"bookId":17,"arabic":"وَأَخْرَجَ أَحْمَدُ نَحْوَهُ: عَنْ خَالِدِ بْنِ عُرْفُطَةَ ‏- رضى الله عنه ‏-  1‏ .‏‏1 ‏- حسن كسابقه.‏ ولكنه ضعيف السند في\" المسند\".‏","english":{"narrator":"","text":"Ahmad transmitted a similar hadith on the authority of Khalid bin 'Urfutah."}}],"chapter":{"id":10,"bookId":17,"arabic":"كتاب الحدود","english":"Hudud"}}