{"metadata":{"length":63,"arabic":{"title":"بلوغ المرام","author":"الإمام ابن حجر العسقلاني","introduction":"كتاب الجهاد"},"english":{"title":"Bulugh al-Maram","author":"Ibn Hajar al-Asqalani","introduction":"Jihad"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":11,"bookId":17,"arabic":"عَنْ أَبِي هُرَيْرَةَ رَ ضِيَ اَللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ \n\" مَنْ مَاتَ وَلَمْ يَغْزُ, وَلَمْ يُحَدِّثْ نَفْسَهُ بِهِ, مَاتَ عَلَى شُعْبَةٍ مِنْ نِفَاقٍ\" }  رَوَاهُ مُسْلِمٌ  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم ( 1910 )‏.‏","english":{"narrator":"Abu Hurairah (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"“He who dies without having gone or thought of going out for Jihad in the Cause of Allah, will die while being guilty of having one of the qualities of hypocrisy.” Related by Muslim."}},{"id":2,"idInBook":2,"chapterId":11,"bookId":17,"arabic":"وَعَنْ أَنَسٍ ‏- رضى الله عنه ‏- أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَالَ: { \n\" جَاهِدُوا اَلْمُشْرِكِينَ بِأَمْوَالِكُمْ, وَأَنْفُسِكُمْ, وَأَلْسِنَتِكُمْ\" }  رَوَاهُ أَحْمَدُ, وَالنَّسَائِيُّ, وَصَحَّحَهُ اَلْحَاكِمُ  1‏ .‏‏1 ‏- صحيح.‏ رواه أحمد ( 3 / 124 و 153 و 251 )‏، والنسائي ( 6 / 7 )‏، والحاكم ( 2 / 81 )‏، وهو عند أبي داود أيضا ( 2504 )‏.‏","english":{"narrator":"Anas (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"“Fight the disbelievers (polytheists) with your property, yourselves and your tongues.” Related by Ahmad, An-Nasa‘i and Al-Hakim graded it as Sahih."}},{"id":3,"idInBook":3,"chapterId":11,"bookId":17,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: { قُلْتُ: يَا رَسُولَ اَللَّهِ ! عَلَى اَلنِّسَاءِ جِهَادٌ? قَالَ: \n\"نَعَمْ.‏ جِهَادٌ لَا قِتَالَ فِيهِ, اَلْحَجُّ وَالْعُمْرَةُ\" }.‏ رَوَاهُ اِبْنُ مَاجَه  1‏ .‏ وَأَصْلُهُ فِي اَلْبُخَارِيِّ  2‏ .‏‏1 ‏- صحيح.‏ رواه ابن ماجه ( 2901 )‏.‏‏2 ‏- وبألفاظ مختلفة، ففي رواية عن أم المؤمنين عائشة رضي الله عنها قالت: استأذنت النبي صلى الله عليه وسلم في الجهاد.‏ فقال: \" جهادكن الحج\".‏ .‏ وفي أخرى عنها، عن النبي صلى الله عليه وسلم سأله نساؤه عن الجهاد؟.‏ فقال: \"نعم الجهاد الحج\" .‏ انظر البخاري حديث رقم ( 1520 )‏، وأطرافه.‏","english":{"narrator":"'A’ishah (RAA) narrated, ‘I said:","text":"‘O Messenger of Allah (ﷺ)!  Is Jihad prescribed (also) for women?’ Allah’s Messenger said, “Yes, a Jihad which is without fighting, it is Hajj and 'Umrah.” Related by Ibn Majah."}},{"id":4,"idInBook":4,"chapterId":11,"bookId":17,"arabic":"وَعَنْ عَبْدِ اَللَّهِ بْنِ عَمْرِوٍ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { جَاءَ رَجُلٌ إِلَى اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-يَسْتَأْذِنُهُ فِي اَلْجِهَادِ.‏ فَقَالَ: \"  حَيٌّ وَالِدَاكَ?\" , قَالَ: نَعَمْ: قَالَ: \" فَفِيهِمَا فَجَاهِدْ\" }  .‏ مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح رواه البخاري ( 3004 )‏، ومسلم ( 2549 )‏.‏","english":{"narrator":"","text":"'Abdullah bin 'Umar (RAA) narrated ‘A man came to the Messenger of Allah (ﷺ) asking his permission to go out for Jihad. The Messenger of Allah (ﷺ) asked him, “Are your parents alive?” He replied, ‘Yes.' The Messenger of Allah (ﷺ) then said to him, “Then your Jihad would be with them (i.e. in looking after them and being at their service.).” Agreed upon."}},{"id":5,"idInBook":5,"chapterId":11,"bookId":17,"arabic":"وَلِأَحْمَدَ, وَأَبِي دَاوُدَ: مِنْ حَدِيثِ أَبِي سَعِيدٍ نَحْوُهُ, وَزَادَ: { \n\"اِرْجِعْ فَاسْتَأْذِنْهُمَا, فَإِنْ أَذِنَا لَكَ; وَإِلَّا فَبِرَّهُمَا\" }   1‏ .‏‏1 ‏- صحيح كسابقه.‏ رواه أحمد ( 3 / 75 ‏- 76 )‏، وأبو داود ( 2530 )‏، وأوله: عن أبي سعيد؛ أن رجلا هاجر إلى رسول الله صلى الله عليه وسلم من اليمن.‏ فقال: \" هل لك أحد باليمن؟\" قال: أبواي.‏ قال: \"أذنا لك\" قال: لا.‏ قال: فذكره.‏","english":{"narrator":"","text":"Ahmad and Abu Dawud transmitted a similar hadith on the authority of Abu Sa’id, and they added the extra statement, “Go back and ask for their permission. If they permit you to go, then go for Jihad otherwise, be good to them (look after them)."}},{"id":6,"idInBook":6,"chapterId":11,"bookId":17,"arabic":"وَعَنْ جَرِيرٍ الْبَجَلِيِّ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ \"أَنَا بَرِئٌ مِنْ كُلِّ مُسْلِمٍ يُقِيمُ بَيْنَ اَلْمُشْرِكِينَ\" }  رَوَاهُ اَلثَّلَاثَةُ وَإِسْنَادُهُ , وَرَجَّحَ اَلْبُخَارِيُّ إِرْسَالَهُ  1‏ .‏‏1 ‏- صحيح.‏ رواه أبو داود ( 2645 )‏، والترمذي ( 1604 )‏ من طريق أبي معاوية، عن إسماعيل بن أبي خالد، عن قيس بن أبي حازم، عن جرير قال: بعث رسول الله صلى الله عليه وسلم سرية إلى خثعم، فاعتصم ناس منهم بالسجود، فأسرع فيهم القتل.‏ قال: فبلغ ذلك النبي صلى الله عليه وسلم فأمر لهم بنصف العقل وقال: فذكره.‏ وزاد: \"قالوا: يا رسول الله! لم؟ قال: \" لا تراءى ناراهما\".‏ وهذا سند صحيح كما قال الحافظ، لكنه معلول بالإرسال ‏-ومن هذا الوجه رواه النسائي ( 8 / 36 )‏ ‏- كما نقل ذلك عن البخاري، وأيضا قاله أبو داود.‏ وأبو حاتم.‏ والترمذي والدارقطني.‏ قلت: لكن له شواهد يصح بها، وتفصيل ذلك بالأصل.‏","english":{"narrator":"Jarir (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"“Any Muslim who stays among the polytheists, does not belong to me.” Related by the three Imams with a sound chain of narrators. Imam Al-Bukhari considered it as Mursal (i.e. the companion is absent from the chain of narrators."}},{"id":7,"idInBook":7,"chapterId":11,"bookId":17,"arabic":"وَعَنْ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ \n\" لَا هِجْرَةَ بَعْدَ اَلْفَتْحِ, وَلَكِنْ جِهَادٌ وَنِيَّةٌ\" }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 2825 )‏، ومسلم ( 1353 )‏، وزادا: \"وإذا استنفرتم فانفروا\".‏","english":{"narrator":"Ibn 'Abbas (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"“There is no emigration (from Makkah to al·Madinah) after the conquest of Makkah, but only Jihad (in the Cause of Allah) and a good intention."}},{"id":8,"idInBook":8,"chapterId":11,"bookId":17,"arabic":"وَعَنْ أَبِي مُوسَى اَلْأَشْعَرِيِّ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ \n\"مَنْ قَاتَلَ لِتَكُونَ كَلِمَةُ اَللَّهِ هِيَ اَلْعُلْيَا, فَهُوَ فِي سَبِيلِ اَللَّهِ\" }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 2810 )‏، ومسلم ( 1904 )‏ عن أبي موسى؛ أن رجلا أعرابيا أتى النبي صلى الله عليه وسلم فقال: يا رسول الله! الرجل يقاتل للمغنم.‏ والرجل يقاتل ليذكر.‏ والرجل يقاتل ليرى مكانه، فمن في سبيل الله؟ فقال رسول الله صلى الله عليه وسلم: فذكره.‏","english":{"narrator":"Abu Musa Al-Ash'ari (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"“The one who fights for Allah’s word to become Superior, is striving in Allah’s Cause.” Agreed upon."}},{"id":9,"idInBook":9,"chapterId":11,"bookId":17,"arabic":"وَعَنْ عَبْدِ اَللَّهِ بْنِ اَلسَّعْدِيِّ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ \n\" لَا تَنْقَطِعُ اَلْهِجْرَةُ مَا قُوتِلَ اَلْعَدُوُّ\" }  رَوَاهُ النَّسَائِيُّ, وَصَحَّحَهُ اِبْنُ حِبَّانَ  1‏ .‏‏1 ‏- صحيح.‏ رواه النسائي ( 6 / 146 و 147 )‏، وابن حبان ( 1579 )‏ عن عبد الله بن السعدي قال: وفدت إلى رسول الله صلى الله عليه وسلم في وفد كلنا يطلب حاجة، وكنت آخرهم دخولا على رسول الله صلى الله عليه وسلم.‏ فقال: \"حاجتك\" فقلت: يا رسول الله إني تركت من خلفي وهم يزعمون أن الهجرة قد انقطعت، فذكر الحديث.‏","english":{"narrator":"’Abdullah bin As-Sa'di narrated that The Messenger of Allah (ﷺ) said:","text":"“Emigration (to fight the enemy) will continue as long as an enemy is fought.” Related by An-Nasa’i, and Ibn Hibban graded it as Sahih."}},{"id":10,"idInBook":10,"chapterId":11,"bookId":17,"arabic":"وَعَنْ نَافِعٍ قَالَ:  1‏ { أَغَارُ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-عَلَى بَنِيَّ اَلْمُصْطَلِقِ, وَهُمْ غَارُّونَ, فَقَتَلَ مُقَاتِلَتَهُمْ, وَسَبَى ذَرَارِيَّهُمْ.‏ حَدَّثَنِي بِذَلِكَ عَبْدُ اَللَّهِ بْنُ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا }  مُتَّفَقٌ عَلَيْهِ  2‏ .‏‏1 ‏- هو الإمام الثقة الثبت النبيل مولى ابن عمر.‏‏2 ‏- صحيح.‏ رواه البخاري ( 2541 )‏، ومسلم ( 12 / 35 ‏- 36 نووي )‏ وانظر \"ناسخ الحديث ومنسوخه\" لابن شاهين رقم (467 بتحقيقي)‏.‏ \"غارون\": بالغين المعجمة وتشديد الراء، أي: غافلون.‏","english":{"narrator":"","text":"Nafi' (RAA) narrated, ‘The Messenger of Allah (ﷺ) made an attack on Bani al-Mustaliq when they were unaware. He killed the men who were lighting and took the women and children as captives.’ 'Abdullah bin Umar told me about it. Agreed upon."}},{"id":11,"idInBook":11,"chapterId":11,"bookId":17,"arabic":"وَعَنْ سُلَيْمَانَ بْنِ بُرَيْدَةَ, عَنْ أَبِيهِ قَالَ: { كَانَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-إِذَا أَمَّرَ أَمِيرًا عَلَى جَيْشٍ أَوْصَاهُ بِتَقْوَى اَللَّهِ, وَبِمَنْ مَعَهُ مِنْ اَلْمُسْلِمِينَ خَيْراً, ثُمَّ قَالَ: \n\"اُغْزُوا بِسْمِ اَللَّهِ, فِي سَبِيلِ اَللَّهِ, قَاتِلُوا مِنْ كَفَرَ بِاَللَّهِ, اُغْزُوا, وَلَا تَغُلُّوا, وَلَا تَغْدُرُوا, وَلَا تُمَثِّلُوا, وَلَا تَقْتُلُوا وَلِيداً, وَإِذَا لَقِيتَ عَدُوَّكَ مِنْ اَلْمُشْرِكِينَ فَادْعُهُمْ إِلَى ثَلَاثِ خِصَالٍ, فَأَيَّتُهُنَّ أَجَابُوكَ إِلَيْهَا, فَاقْبَلْ مِنْهُمْ, وَكُفَّ عَنْهُمْ: اُدْعُهُمْ إِلَى اَلْإِسْلَامِ فَإِنْ أَجَابُوكَ فَاقْبَلْ مِنْهُمْ.‏\nثُمَّ اُدْعُهُمْ إِلَى اَلتَّحَوُّلِ مِنْ دَارِهِمْ إِلَى دَارِ اَلْمُهَاجِرِينَ, فَإِنْ أَبَوْا فَأَخْبَرْهُمْ أَنَّهُمْ يَكُونُونَ كَأَعْرَابِ اَلْمُسْلِمِينَ, وَلَا يَكُونُ لَهُمْ  1‏ .‏ فِي اَلْغَنِيمَةِ وَالْفَيْءِ شَيْءٌ إِلَّا أَنْ يُجَاهِدُوا مَعَ اَلْمُسْلِمِينَ.‏ فَإِنْ هُمْ أَبَوْا فَاسْأَلْهُمْ اَلْجِزْيَةَ, فَإِنْ هُمْ أَجَابُوكَ فَاقْبَلْ مِنْهُمْ, فَإِنْ أَبَوْا فَاسْتَعِنْ بِاَللَّهِ وَقَاتِلْهُمْ.‏ وَإِذَا حَاصَرْتَ أَهْلَ حِصْنٍ فَأَرَادُوكَ أَنْ تَجْعَلَ لَهُمْ ذِمَّةَ اَللَّهِ وَذِمَّةَ نَبِيِّهِ, فَلَا تَفْعَلْ, وَلَكِنْ اِجْعَلْ لَهُمْ ذِمَّتَكَ; فَإِنَّكُمْ إِنْ تُخْفِرُوا ذِمَمَكُمْ  2‏ .‏ أَهْوَنُ مِنْ أَنَّ تُخْفِرُوا ذِمَّةَ اَللَّهِ, وَإِذَا أَرَادُوكَ أَنْ تُنْزِلَهُمْ عَلَى حُكْمِ اَللَّهِ, فَلَا تَفْعَلْ, بَلْ عَلَى حُكْمِكَ; فَإِنَّكَ لَا تَدْرِي أَتُصِيبُ فِيهِمْ حُكْمَ اَللَّهِ أَمْ لَا\" }  أَخْرَجَهُ مُسْلِمٌ  3‏ .‏‏1 ‏- سقط من\" أ\".‏‏2 ‏- وفي\" أ\": \"ذمتكم\" والذي في مسلم: \" ذممكم وذمم أصحابكم\" ومعنى \" تخفروا\": تنقضوا.‏‏3 ‏- صحيح.‏ رواه مسلم ( 1731 )‏ ( 3 )‏ وقد اختصر الحافظ بعض عباراته.‏","english":{"narrator":"Sulaiman bin Buraidah narrated on the authority of his father on the authority of 'A’ishah (RAA), “Whenever Allah’s Messenger appointed a commander over an army or a Sariyah, he would instruct him to fear Allah in his own behavior and consider the welfare of the Muslims who were with him. He then used to say “Go out for Jihad in Allah’s name, in the Cause of Allah, and fight those who disbelieve in Allah. Go out for Jihad and do not indulge in Ghulul, or be treacherous or mutilate (dead bodies) or kill a child. When you meet your enemy, or the polytheists, invite them to three courses of action, and accept whichever of them they are willing to agree to, and withhold from doing anything else:","text":"Call them to Islam, and if they agree accept it from them. Then invite them to migrate from their land to the land of the Emigrants (i.e. al-Madinah), if they refuse, then tell them they will be like the Muslim desert Arabs, thus they will have no right in the Ghanimah or Fai’ unless they participate in Jihad with the Muslims. If they refuse (to accept Islam) order them to pay the Jizyah and if they agree, accept it from them. If they refuse, seek Allah, the Most High’s help against them and fight them. When you besiege a fortress, and its people wish you to grant them the protection of Allah and His Prophet, grant them neither but grant them your protection, for it is less serious (a lesser guilt) to break your guarantee of protection than to break that of Allah’s. And if they offer to capitulate under the condition that they are subjected to the judgment of Allah, do not grant them this, but judge according to your own command, for you do not know whether or not you will be able to carry out Allah, the Most High’s Judgment regarding them.” Related by Muslim."}},{"id":12,"idInBook":12,"chapterId":11,"bookId":17,"arabic":"وَعَنْ كَعْبِ بْنِ مَالِكٍ ‏- رضى الله عنه ‏- { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-كَانَ إِذَا أَرَادَ غَزْوَةً وَرَّى بِغَيْرِهَا }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 2947 )‏، ومسلم ( 2769 )‏ ( 54 )‏.‏ ورى: أي سترها وأوهم غيرها.‏","english":{"narrator":"","text":"Ka’b bin Malik (RAA) narrated that Whenever the Messenger of Allah (ﷺ) intended to go out on a battle, he would pretend to head in a different destination. Agreed upon."}},{"id":13,"idInBook":13,"chapterId":11,"bookId":17,"arabic":"وَعَنْ مَعْقِلٍ; أَنَّ اَلنُّعْمَانَ بْنَ مُقَرِّنٍ قَالَ: { شَهِدْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-إِذَا لَمْ يُقَاتِلْ أَوَّلَ اَلنَّهَارِ أَخَّرَ اَلْقِتَالِ حَتَّى تَزُولَ اَلشَّمْسُ, وَتَهُبَّ اَلرِّيَاحُ, وَيَنْزِلَ اَلنَّصْرُ }  رَوَاهُ أَحْمَدُ وَالثَّلَاثَةُ, وَصَحَّحَهُ اَلْحَاكِمُ  1‏ .‏ \nوَأَصْلُهُ فِي اَلْبُخَارِيِّ  2‏ .‏‏1 ‏- صحيح.‏ رواه أحمد ( 5 / 444 ‏- 445 )‏، وأبو داود ( 2655 )‏، والنسائي في \"الكبرى\" ( 5 / 191 )‏، والحاكم ( 2 / 116 )‏.‏\n‏2 ‏- رواه البخاري ( 3160 )‏ عنه قال: \"ولكني شهدت القتال مع رسول الله صلى الله عليه وسلم، كان إذا لم يقاتل في أول النهار انتظر حتى تهب الأرواح، وتحضر الصلوات\".‏","english":{"narrator":"","text":"Ma'qil bin An-Nu‘man bin Muqarrin (RAA) narrated, ‘I witnessed (battles with) Allah’s Messenger and if he did not start fighting at the beginning of the day, he delayed the fighting till the sun had passed the meridian, and the wind blew and victory descended from Allah.” Related by Ahmad and the three Imams. Al-Hakim graded it as Sahih."}},{"id":14,"idInBook":14,"chapterId":11,"bookId":17,"arabic":"وَعَنْ اَلصَّعْبِ بْنِ جَثَّامَةَ ‏- رضى الله عنه ‏- قَالَ: { سُئِلَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-عَنْ اَلدَّارِ مِنْ اَلْمُشْرِكِينَ.‏  1‏ .‏ يُبَيِّتُونَ, فَيُصِيبُونَ مِنْ نِسَائِهِمْ وَذَرَارِيهِمْ, فَقَالَ: \n\"هُمْ مِنْهُمْ\" }  مُتَّفَقٌ عَلَيْهِ  2‏ .‏‏1 ‏- كذا في \"الأصل\" ، وفي البخاري: \" عن أهل الدار من المشركين\" .‏ وفي النسخة \" أ\" : \" عن الذراري من المشركين\" وهي رواية مسلم.‏‏2 ‏- صحيح رواه البخاري ( 6 / 146 / فتح )‏، مسلم ( 1745 )‏.‏ يبيتون: أي يغار عليهم بالليل.‏","english":{"narrator":"","text":"As-Sa'b bin Jath-thamah (RAA) narrated, ‘The Messenger of Allah (ﷺ) was asked about the polytheists whose land was attacked at night with the probability that some of their women and offspring were killed or hurt.’ He said “They are from among them.” Agreed upon."}},{"id":15,"idInBook":15,"chapterId":11,"bookId":17,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا; { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَالَ لِرَجُلٍ تَبِعَهُ يَوْمَ بَدْرٍ: \n\" اِرْجِعْ.‏ فَلَنْ أَسْتَعِينَ بِمُشْرِكٍ\" }  رَوَاهُ مُسْلِمٌ  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم ( 1817 )‏ وهو بتمامه: عن عائشة زوج النبي صلى الله عليه وسلم؛ أنها قالت: خرج رسول الله صلى الله عليه وسلم قبل بدر، فلما كان بحرة الوبرة أدركه رجل قد كان يذكر منه جرأة ونجدة، ففرح أصحاب رسول الله صلى الله عليه وسلم حين رأوه، فلما أدركه قال لرسول الله صلى الله عليه وسلم: جئت لأتبعك، وأصيب معك.‏ قال له رسول الله صلى الله عليه وسلم: \"تؤمن بالله ورسوله ؟\" قال: لا.‏ قال: .‏.‏.‏.‏.‏ فذكر الحديث.‏ وزاد: قالت: ثم مضى، حتى إذا كنا بالشجرة أدركه الرجل.‏ فقال له كما قال أول مرة.‏ فقال له النبي صلى الله عليه وسلم كما قال أول مرة.‏ قال: \" فارجع.‏ فلن أستعين بمشرك\" ثم رجع فأدركه بالبيداء.‏ فقال له كما قال أول مرة: \" تؤمن بالله ورسوله ؟\" قال: نعم.‏ فقال له رسول الله صلى الله عليه وسلم : \" فانطلق\".‏","english":{"narrator":"","text":"'A’ishah (RAA) narrated that The Messenger of Allah (ﷺ) said to a man who followed him on the day of the Battle of Badr, “Go back I will not seek help from a Mushrik (polytheist).” Reported by Muslim."}},{"id":16,"idInBook":16,"chapterId":11,"bookId":17,"arabic":"وَعَنْ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا; { أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-رَأَى اِمْرَأَةً مَقْتُولَةً فِي بَعْضِ مَغَازِيهِ, فَأَنْكَرَ قَتْلَ اَلنِّسَاءِ وَالصِّبْيَانِ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 3014 )‏، ومسلم ( 1774 )‏، وفي رواية لهما أيضا: \" فنهى عن قتل النساء والصبيان\".‏","english":{"narrator":"","text":"Ibn 'Umar (RAA) narrated that The Messenger of Allah (ﷺ) saw a woman who was killed in one of his expeditions, so he disapproved the killing of women and children. Agreed upon."}},{"id":17,"idInBook":17,"chapterId":11,"bookId":17,"arabic":"وَعَنْ سَمُرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ \n\" اُقْتُلُوا شُيُوخَ اَلْمُشْرِكِينَ, وَاسْتَبْقُوا شَرْخَهُمْ\" }  رَوَاهُ أَبُو دَاوُدَ, وَصَحَّحَهُ اَلتِّرْمِذِيُّ  1‏ .‏‏1 ‏- ضعيف.‏ رواه أبو داود ( 2670 )‏ واللفظ له، والترمذي ( 1583 )‏ من طريق قتادة، عن الحسن، عن سمرة، به قلت: وهذا سند ضعيف؛ إذ الحسن مدلس، وقد عنعنه.‏","english":{"narrator":"Samurah (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"“Kill the mature men of the polytheists but spare their children.” Related by Abu Dawud and At-Tirmidhi graded it as Sahih."}},{"id":18,"idInBook":18,"chapterId":11,"bookId":17,"arabic":"وَعَنْ عَلِيٍّ ‏- رضى الله عنه ‏- { أَنَّهُمْ تَبَارَزُوا يَوْمَ بَدْرٍ }  رَوَاهُ اَلْبُخَارِيُّ  1‏ .‏ \nوَأَخْرَجَهُ أَبُو دَاوُدَ مُطَوَّلاً  2‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 3965 )‏.‏\n‏2 ‏- صحيح.‏ رواه أبو داود ( 2665)‏.‏","english":{"narrator":"","text":"’Ali (RAA) narrated that They (the Muslims and the polytheists) engaged in duel combat on the Day of Badr. Related by Al-Bukhari and Abu Dawud reported it as part of a long hadith."}},{"id":19,"idInBook":19,"chapterId":11,"bookId":17,"arabic":"وَعَنْ أَبِي أَيُّوبَ ‏- رضى الله عنه ‏- قَالَ: إِنَّمَا أُنْزِلَتْ هَذِهِ اَلْآيَةُ فِينَا مَعْشَرَ اَلْأَنْصَارِ, يَعْنِي: ﴿ وَلَا تُلْقُوا بِأَيْدِيكُمْ إِلَى اَلتَّهْلُكَةِ  ﴾ 1‏ قَالَهُ رَدًّا عَلَى مَنْ أَنْكَرَ عَلَى مَنْ حَمَلَ عَلَى صَفِ اَلرُّومِ حَتَّى دَخَلَ فِيهِمْ .‏ رَوَاهُ اَلثَّلَاثَةُ, وَصَحَّحَهُ اَلتِّرْمِذِيُّ, وَابْنُ حِبَّانَ, وَالْحَاكِمُ  2‏ .‏‏1 ‏- صحيح.‏ رواه أبو داود ( 2665)‏.‏‏2 ‏- صحيح.‏ رواه أبو داود ( 2512 )‏، والنسائي في \"التفسير\" ( 49 )‏ والترمذي ( 2972 )‏، وابن حبان ( 1667 )‏، والحاكم ( 2 / 275 )‏.‏ وقال الترمذي: \"حديث حسن صحيح غريب\".‏","english":{"narrator":"Abu Aiyub (RAA) narrated that:","text":"'This verse was revealed concerning us (al-Ansar).' He was referring to the verse, “And do not throw yourselves into destruction (2:195). Abu Aiyub said that to answer those who disapproved of the action of those who attacked the Romans till they were amidst their army.’ Related by the three Imams, and At-Tirmidhi, Ibn Hibban and Al-Hakim graded it as Sahih."}},{"id":20,"idInBook":20,"chapterId":11,"bookId":17,"arabic":"وَعَنْ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { حَرَقَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-نَخْلَ بَنِي اَلنَّضِيرِ, وَقَطَعَ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 4031 )‏، ومسلم ( 1746 )‏.‏ وزادا: \"وهي البويرة.‏ فأنزل الله عز وجل: ما قطعتم من لينة أو تركتموها قائمة على أصولها فبإذن الله\".‏","english":{"narrator":"","text":"Ibn 'Umar narrated that The Messenger of Allah (ﷺ) burnt the palm trees of Banu an-Nadir and cut them down. Agreed upon,"}},{"id":21,"idInBook":21,"chapterId":11,"bookId":17,"arabic":"وَعَنْ عُبَادَةَ بْنِ اَلصَّامِتِ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ \n\"لَا تَغُلُّوا; فَإِنَّ اَلْغُلُولَ نَارٌ وَعَارٌ عَلَى أَصْحَابِهِ فِي اَلدُّنْيَا وَالْآخِرَةِ\" }  رَوَاهُ أَحْمَدُ, وَالنَّسَائِيُّ, وَصَحَّحَهُ ابْنُ حِبَّانَ  1‏ .‏‏1 ‏- حسن.‏ انظر \"الأصل\".‏","english":{"narrator":"'Ubadah bin as-Samit (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"“Do not be dishonest (and treacherous) about the war booty (i.e. steal from it before it is divided legally), as Ghulul will be like fire (for the ones who got involved in it) and a cause of disgrace to those who are guilty of it in this world and in the Hereafter.” Related by Ahmad, and An-Nasa‘i, and Ibn Hibban graded it as Sahih."}},{"id":22,"idInBook":22,"chapterId":11,"bookId":17,"arabic":"وَعَنْ عَوْفِ بْنِ مَالِكٍ ‏- رضى الله عنه ‏- { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَضَى بِالسَّلَبِ لِلْقَاتِلِ }  رَوَاهُ أَبُو دَاوُدَ  1‏ .‏\nوَأَصْلُهُ عِنْدَ مُسْلِمٍ  2‏ .‏‏1 ‏- صحيح.‏ رواه أبو داود ( 2719 )‏ في حديث طويل.‏\n‏2 ‏- صحيح.‏ رواه مسلم ( 1753 )‏ ( 44 )‏.‏","english":{"narrator":"","text":"'Auf bin Malik (RAA) narrated, “The Messenger of Allah (ﷺ) judged that the belongings taken from the (non-Muslim enemy) killed soldier in a war, are to be given to the one who killed him.' Related by Abu Dawud. Muslim reported it as part of a long hadith."}},{"id":23,"idInBook":23,"chapterId":11,"bookId":17,"arabic":"وَعَنْ عَبْدِ اَلرَّحْمَنِ بْنِ عَوْفٍ ‏- رضى الله عنه ‏- فِي ‏- قِصَّةِ قَتْلِ أَبِي جَهْلٍ ‏- قَالَ: { فَابْتَدَرَاهُ بِسَيْفَيْهِمَا حَتَّى قَتَلَاهُ, ثُمَّ انْصَرَفَا إِلَى رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-فَأَخْبَرَاهُ, فَقَالَ: \"أَيُّكُمَا قَتَلَهُ? هَلْ مَسَحْتُمَا سَيْفَيْكُمَا ?\" قَالَا: لَا.‏ قَالَ: فَنَظَرَ فِيهِمَا, فَقَالَ: \"كِلَاكُمَا قَتَلَهُ, سَلْبُهُ لِمُعَاذِ بْنِ عَمْرِوِ بْنِ اَلْجَمُوحِ\" }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 3141 )‏، ومسلم ( 1752 )‏، وقد ساقه الحافظ هنا مختصرا.‏","english":{"narrator":"’Abdur Rahman bin ’Auf (RAA) narrated regarding the story of the killing of Abu Jahl,‘..they both hastened to him with their swords till they killed him. Afterwards, they went to the Prophet and informed him (of what they had done). The Messenger of Allah (ﷺ) asked them, “Which of you killed him? Have you wiped your swords?” They said:","text":"‘No.’ The Prophet then looked at the swords and said, “Both of you killed him.” He then ordained that the belongings (weapons, shields etc..) of Abu Jahl should go to Mu 'adh bin 'Amro bin al-Jamuh.’ Agreed upon."}},{"id":24,"idInBook":24,"chapterId":11,"bookId":17,"arabic":"وَعَنْ مَكْحُولٍ; { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-نَصَبَ اَلْمَنْجَنِيقَ عَلَى أَهْلِ اَلطَّائِفِ }  أَخْرَجَهُ أَبُو دَاوُدَ فِي \n\"اَلْمَرَاسِيلِ\" وَرِجَالُهُ ثِقَاتٌ.‏  1‏ .‏‏1 ‏- ضعيف.‏ رواه أبو داود في \"المراسيل\" ( 335 )‏ من طريق سفيان، عن ثور، عن مكحول، به.‏ وهو وإن كان صحيح السند، فهو ضعيف؛ لأنه مرسل.‏ وروي أيضا بسند صحيح، عن الأوزاعي قال: قلت ليحيى بن أبي كثير: أبلغك أن النبي صلى الله عليه وسلم رماهم بالمنجنيق؟ فأنكر ذلك.‏ وقال: ما يعرف هذا.‏","english":{"narrator":"","text":"Makhul (RAA) narrated, ‘The Messenger of Allah (ﷺ) set up the ballista while attacking the people of at-Ta’if`.’ Related by Abu Dawud with a trustworthy chain of narrators, but it is hadith Mursal."}},{"id":25,"idInBook":25,"chapterId":11,"bookId":17,"arabic":"وَوَصَلَهُ الْعُقَيْلِيُّ بِإِسْنَادٍ ضَعِيفٍ عَنْ عَلِيٍّ ‏- رضى الله عنه ‏-  1‏ .‏‏1 ‏- منكر.‏ رواه العقيلي في\" الضعفاء الكبير\" ( 2 / 244 )‏ وفي سنده عبد الله بن خراش قال عنه أبو حاتم ( 2 / 2 / 46 )‏: \"منكر الحديث، ذاهب الحديث، ضعيف الحديث\".‏","english":{"narrator":"","text":"Al-'Uqayli connected it (to the Prophet (ﷺ)) with a weak chain narrated by Ali (ra)."}},{"id":26,"idInBook":26,"chapterId":11,"bookId":17,"arabic":"وَعَنْ أَنَسٍ ‏- رضى الله عنه ‏- { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-دَخَلَ مَكَّةَ وَعَلَى رَأْسِهِ اَلْمِغْفَرُ, فَلَمَّا نَزَعَهُ جَاءَهُ رَجُلٌ, فَقَالَ: ابْنُ خَطَلٍ مُتَعَلِّقٌ بِأَسْتَارِ اَلْكَعْبَةِ, فَقَالَ: \n\"اُقْتُلُوهُ\" }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 3044 )‏، ومسلم ( 1357 )‏.‏","english":{"narrator":"","text":"Anas (RAA) narrated that The Messenger of Allah (ﷺ) entered Makkah with a helmet on his head, and when he took it off, a man came to him and said, ‘lbn Khattal is hanging on to the curtains of the Ka'bah.’ The Prophet thereupon said, “Kill him.” Agreed upon."}},{"id":27,"idInBook":27,"chapterId":11,"bookId":17,"arabic":"وَعَنْ سَعِيدِ بْنِ جُبَيْرٍ; { أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَتَلَ يَوْمَ بَدْرٍ ثَلَاثَةً صَبْراً }  أَخْرَجَهُ أَبُو دَاوُدَ فِي \n\"اَلْمَرَاسِيلِ\" وَرِجَالُهُ ثِقَاتٌ  1‏ .‏‏1 ‏- ضعيف؛ لإرساله.‏ وهو في \"المراسيل\" برقم ( 337 )‏.‏","english":{"narrator":"","text":"Sa'id bin Jubair (RAA) narrated, ‘The Messenger of Allah (ﷺ) killed three men on the day of Badr while they were in bonds (by throwing arrows at them until they died).’ Related by Abu Dawud."}},{"id":28,"idInBook":28,"chapterId":11,"bookId":17,"arabic":"وَعَنْ عِمْرَانَ بْنِ حُصَيْنٍ ‏- رضى الله عنه ‏- { أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-فَدَى رَجُلَيْنِ مِنْ اَلْمُسْلِمِينَ بِرَجُلٍ مِنْ اَلْمُشْرِكِينَ }  أَخْرَجَهُ اَلتِّرْمِذِيُّ وَصَحَّحَهُ  1‏ .‏ \nوَأَصْلُهُ عِنْدَ مُسْلِمٍ  2‏ .‏‏1 ‏- صحيح.‏ رواه الترمذي ( 1568 )‏ وقال: \"هذا حديث حسن صحيح\".‏\n‏2 ‏- صحيح.‏ رواه مسلم ( 1641 )‏ في حديث طويل من رواية عمران رضي الله عنه، وفيه: أسرت ثقيف رجلين من أصحاب رسول الله صلى الله عليه وسلم، وأسر أصحاب رسول الله صلى الله عليه وسلم رجلا.‏ ففدي بالرجلين.‏","english":{"narrator":"","text":"‘Imran bin Husain (RAA) narrated that The Prophet exchanged two Muslim men from captivity for one polytheist.” Related by At-Tirmidhi."}},{"id":29,"idInBook":29,"chapterId":11,"bookId":17,"arabic":"وَعَنْ صَخْرِ بْنِ اَلْعَيْلَةِ ‏- رضى الله عنه ‏- أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَالَ: { \n\"إِنَّ اَلْقَوْمَ إِذَا أَسْلَمُوا ؛ أَحْرَزُوا دِمَاءَهُمْ وَأَمْوَالَهُمْ\" }  أَخْرَجَهُ أَبُو دَاوُدَ, وَرِجَالُهُ مُوَثَّقُونَ  1‏ .‏‏1 ‏- حسن.‏ رواه أبو داود ( 3067 )‏ وهو وإن كان ضعيف السند؛ إلا أن في الباب ما يشهد له.‏","english":{"narrator":"Sakhr bin Al-'Ailah (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"“If the people (polytheists) accept Islam they will protect their blood and property? Related by Abu Dawud."}},{"id":30,"idInBook":30,"chapterId":11,"bookId":17,"arabic":"وَعَنْ جُبَيْرِ بْنِ مُطْعَمٍ ‏- رضى الله عنه ‏- أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَالَ فِي أُسَارَى بَدْرٍ: { \n\" لَوْ كَانَ اَلْمُطْعَمُ بْنُ عَدِيٍّ حَيًّا, ثُمَّ كَلَّمَنِي فِي هَؤُلَاءِ اَلنَّتْنَى لَتَرَكْتُهُمْ لَهُ\" }  رَوَاهُ اَلْبُخَارِيُّ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 3139 )‏.‏","english":{"narrator":"","text":"Jubair bin Mut'im (RAA) narrated, ‘The Messenger of Allah (ﷺ) said concerning the prisoners of war taken at Badr, “If al-Mut’am bin ’Adi had been alive and spoken to me about those filthy ones(as they were polytheists), I would have freed them for him. Related by Al-Bukhari."}},{"id":31,"idInBook":31,"chapterId":11,"bookId":17,"arabic":"وَعَنْ أَبِي سَعِيدٍ اَلْخُدْرِيِّ ‏- رضى الله عنه ‏- قَالَ: { أَصَبْنَا سَبَايَا يَوْمَ أَوْطَاسٍ لَهُنَّ أَزْوَاجٌ, فَتَحَرَّجُوا, فَأَنْزَلَ اَللَّهُ تَعَالَى: ﴿ وَالْمُحْصَنَاتُ مِنَ اَلنِّسَاءِ إِلَّا مَا مَلَكَتْ أَيْمَانُكُمْ  ﴾ 1‏ }  أَخْرَجَهُ مُسْلِمٌ  2‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 3139 )‏.‏‏2 ‏- صحيح.‏ رواه مسلم ( 1456 )‏.‏","english":{"narrator":"","text":"Abu Sa'id al-Khudri (RAA) narrated, ‘On the Day (the battle) of Autas, we took women captives who had husbands. The Companions felt uneasy to have any sexual relation with them. Then Allah, the Most High revealed the verse, “And women already married (are prohibited for you) except for those whom you possess. (4:24).sent a Sariyah to Najd, and I was among them. They got many camels as spoils and each one’s share was twelve camels, and they were given an additional camel each.” Agreed upon."}},{"id":32,"idInBook":32,"chapterId":11,"bookId":17,"arabic":"وَعَنْ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { بَعَثَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-سَرِيَّةٍ وَأَنَا فِيهِمْ, قِبَلَ نَجْدٍ, فَغَنِمُوا إِبِلاً كَثِيرَةً, فَكَانَتْ سُهْمَانُهُمْ اِثْنَيْ عَشَرَ بَعِيراً, وَنُفِّلُوا بَعِيراً بَعِيراً }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 3134 )‏، ومسلم ( 1749 )‏.‏","english":{"narrator":"","text":"Ibn 'Umar (RAA) narrated, 'The Messenger of Allah (ﷺ) sent a Sariyah (a small army for Jihad) to Najd, and I was among them. They got many camels as spoils and each one's share was twelve camels, and they were given an additional camel each.'. Agreed upon."}},{"id":33,"idInBook":33,"chapterId":11,"bookId":17,"arabic":"وَعَنْهُ قَالَ: { قَسَمَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏- 1‏ يَوْمَ خَيْبَرَ لِلْفَرَسِ سَهْمَيْنِ, وَلِلرَّاجِلِ سَهْمًا }  مُتَّفَقٌ عَلَيْهِ.‏ وَاللَّفْظُ لِلْبُخَارِيِّ  2‏ .‏‏1 ‏- كذا \"بالأصلين\" ، وأشار ناسخ \"أ\" في الهامش إلى نسخة: \"النبي\".‏‏2 ‏- صحيح.‏ رواه البخاري ( 4228 )‏، ومسلم ( 1762 )‏ من طريق نافع، عن ابن عمر ‏- واللفظ للبخاري ‏- وزاد: \"قال: فسره نافع فقال: إذا كان مع الرجل فرس فله ثلاثة أسهم، فإن لم يكن له فرس فله سهم\".‏","english":{"narrator":"","text":"Ibn 'Umar (RAA) narrated, ‘On the Day of Khaibar, the Messenger of Allah (ﷺ) allotted two shares for a horse, and one share (from the war booty) for the fighter. Agreed upon and the wording is from Al-Bukhari."}},{"id":34,"idInBook":34,"chapterId":11,"bookId":17,"arabic":"وَلِأَبِي دَاوُدَ: { أَسْهَمَ لِرَجُلٍ وَلِفَرَسِهِ ثَلَاثَةَ أَسْهُمٍ: سَهْمَيْنِ لِفَرَسِهِ, وَسَهْماً لَهُ }   1‏ .‏‏1 ‏- صحيح.‏ رواه أبو داود ( 2733 )‏.‏","english":{"narrator":"","text":"Abu Dawud also reported, ‘He allotted three shares for a man and his horse, two for his horse and one for him.’"}},{"id":35,"idInBook":35,"chapterId":11,"bookId":17,"arabic":"وَعَنْ مَعْنِ بْنِ يَزِيدَ رَضِيَ اَللَّهُ عَنْهُمَا  1‏ قَالَ: { سَمِعْتَ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ: \n\"لَا نَفْلَ إِلَّا بَعْدَ اَلْخُمُسِ\" }  رَوَاهُ أَحْمَدُ , وَأَبُو دَاوُدَ, وَصَحَّحَهُ اَلطَّحَاوِيُّ  2‏ .‏‏1 ‏- في الأصل: \"رضي الله عنه\" والمثبت من \"أ\" وهو له ولأبيه ولجده صحبة رضي الله عنهم.‏‏2 ‏- صحيح.‏ رواه أحمد ( 3 / 470 )‏، وأبو داود ( 2753 و 2754 )‏، والطحاوي في \"المعاني\" ( 3 / 242 )‏ من طريق أبي الجويرية قال: أصبت جرة حمراء فيها دنانير في إمارة معاوية في أرض الروم.‏ قال: وعلينا رجل من أصحاب رسول الله صلى الله عليه وسلم من بني سليم يقال له: معن بن يزيد.‏ قال: فأتيته بها يقسمها بين المسلمين فأعطاني مثل ما أعطى رجلا منهم، ثم قال: لولا أني سمعت رسول الله صلى الله عليه وسلم ورأيته يفعله.‏ سمعت رسول الله صلى الله عليه وسلم يقول: .‏ .‏.‏.‏.‏ فذكره.‏ وزاد: قال: ثم أخذ فعرض علي من نصيبه، فأبيت عليه.‏ قلت: ما أنا بأحق به منك.‏ والسياق لأحمد.‏","english":{"narrator":"","text":"Ma’n bin Yazid narrated, ‘I heard the Messenger of Allah (ﷺ) say, “Additional booties (extra to the allotted share) are to be distributed only after the fifth has been kept aside.” Related by Ahmad and Abu Dawud .At Tahawi graded it as Sahih."}},{"id":36,"idInBook":36,"chapterId":11,"bookId":17,"arabic":"وَعَنْ حَبِيبِ بْنِ مَسْلَمَةٍ ‏- رضى الله عنه ‏- قَالَ: { شَهِدْتُ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-نَفَّلَ اَلرُّبْعَ فِي اَلْبَدْأَةِ, وَالثُّلُثَ فِي اَلرَّجْعَةِ }  رَوَاهُ أَبُو دَاوُدَ, وَصَحَّحَهُ ابْنُ اَلْجَارُودِ, وَابْنُ حِبَّانَ, وَالْحَاكِمُ  1‏ .‏‏1 ‏- صحيح.‏ رواه أبو داود (2750)‏ وابن الجارود ( 1079 )‏، وابن حبان ( 4815 )‏، والحاكم (2/ 133)‏ من طريق مكحول قال: كنت عبدا بمصر لامرأة من بني هذيل فأعتقتني، فما خرجت من مصر وبها علم إلا حويت عليه فيما أرى، ثم أتيت الحجاز فما خرجت منها وبها علم إلا حويت عليه فيما أرى، ثم أتيت العراق فما خرجت منها وبها علم إلا حويت عليه فيما أرى، ثم أتيت الشام فغربلتها، كل ذلك أسأل عن النفل، فلم أجد أحدا يخبرني فيه بشيء، حتى أتيت شيخا يقال له: زياد بن جارية التميمي.‏ فقلت له: هل سمعت في النفل شيئا ؟ قال: نعم.‏ سمعت حبيب بن مسلمة الفهري، به.‏ والسياق لأبي داود.‏","english":{"narrator":"","text":"Habib bin Maslamah (RAA) narrated, ‘I witnessed the Messenger of Allah (ﷺ) give a quarter (of the war spoils) as an additional booty (to a Sariyah) when they gained booty on their way out to the fight, He also gave a third (of the war spoils) as an additional booty when they gained it on their way back. ‘Related by Abu Dawud, Ibn al-Garud, Ibn Hibban and Al-Hakim graded it as Sahih."}},{"id":37,"idInBook":37,"chapterId":11,"bookId":17,"arabic":"وَعَنْ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { كَانَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يُنَفِّلُ بَعْضَ مَنْ يَبْعَثُ مِنْ اَلسَّرَايَا لِأَنْفُسِهِمْ خَاصَّةً, سِوَى قَسْمِ عَامَّةِ اَلْجَيْشِ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 3135 )‏، ومسلم ( 1750 )‏ ( 40 )‏.‏","english":{"narrator":"","text":"Ibn ’Umar (RAA) narrated, ‘The Messenger of Allah (ﷺ) used to give some (members) of the Sariyah he sent out (i.e. some of the soldiers), additional booties especially for them, apart from the shares which are given to the whole army.’ Agreed upon."}},{"id":38,"idInBook":38,"chapterId":11,"bookId":17,"arabic":"وَعَنْهُ : { كُنَّا نُصِيبُ فِي مَغَازِينَا اَلْعَسَلَ وَالْعِنَبَ , فَنَأْكُلُهُ وَلَا نَرْفَعُهُ }  رَوَاهُ اَلْبُخَارِيُّ  1‏ .‏ وَلِأَبِي دَاوُدَ:  { فَلَمْ يُؤْخَذْ مِنْهُمْ اَلْخُمُسُ }  .‏ وَصَحَّحَهُ ابْنُ حِبَّانَ  2‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 3154 )‏.‏‏2 ‏- صحيح.‏ رواه أبو داود ( 2701 )‏، وابن حبان ( 4805 )‏ ولفظ ابن حبان: \"فلم يخمسه النبي صلى الله عليه وسلم\".‏","english":{"narrator":"","text":"Ibn 'Umar (RAA) narrated, ‘On our expeditions, we used to get honey and grapes (as spoi1s) and eat them while on our military expeditions, without bringing them to the Prophet (or whoever is in charge of distributing the spoils).’ Related by Al-Bukhari. Abu Dawud narrated, ‘The fifth was not taken from them.’ Ibn Hibban graded it as Sahih."}},{"id":39,"idInBook":39,"chapterId":11,"bookId":17,"arabic":"وَعَنْ عَبْدِ اَللَّهِ بْنِ أَبِي أَوْفَى رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { أَصَبْنَا طَعَاماً يَوْمَ خَيْبَرَ, فَكَانَ اَلرَّجُلُ يَجِيءُ, فَيَأْخُذُ مِنْهُ مِقْدَارَ مَا يَكْفِيهِ, ثُمَّ يَنْصَرِفُ }  أَخْرَجَهُ أَبُو دَاوُدَ, وَصَحَّحَهُ ابْنُ اَلْجَارُودِ, وَالْحَاكِمُ  1‏ .‏‏1 ‏- صحيح.‏ رواه أبو داود ( 2704 )‏، وابن الجارود ( ( 1072 )‏، والحاكم ( 2 / 126 )‏.‏","english":{"narrator":"","text":"’Abdullah bin Abi Aufa (RAA) narrated, ‘On the Day of Khaibar, we got some food (as spoils). The man would come and take as much as he needed and then go away.’ Related by Abu Dawud.Ibn al-Garud and Al-Hakim graded it as Sahih."}},{"id":40,"idInBook":40,"chapterId":11,"bookId":17,"arabic":"وَعَنْ رُوَيْفِعِ بْنِ ثَابِتٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ \n\"مَنْ كَانَ يُؤْمِنُ بِاَللَّهِ وَالْيَوْمِ اَلْآخِرِ فَلَا يَرْكَبُ دَابَّةً مِنْ فَيْءِ اَلْمُسْلِمِينَ, حَتَّى إِذَا أَعْجَفَهَا رَدَّهَا فِيهِ, وَلَا يَلْبَسُ ثَوْباً مِنْ فَيْءِ اَلْمُسْلِمِينَ حَتَّى إِذَا أَخْلَقَهُ رَدَّهُ فِيهِ\" }  أَخْرَجَهُ أَبُو دَاوُدَ, وَالدَّارِمِيُّ, وَرِجَالُهُ لَا بَأْسَ بِهِمْ  1‏ .‏‏1 ‏- حسن.‏ رواه أبو داود ( 2159 و 2708 )‏، ، والدارمي ( 2 / 230 )‏.‏","english":{"narrator":"Ruaifi’ bin Thabit (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"“He who believes in Allah and the Hereafter must not ride on an animal belonging to the booty of the Muslims and put it back when he has emaciated it, or wear a garment belonging to the booty of the Muslims and put it back when it is worn.” Related by Abu Dawud and Ad- Darimi."}},{"id":41,"idInBook":41,"chapterId":11,"bookId":17,"arabic":"وَعَنْ أَبِي عُبَيْدَةَ بْنِ اَلْجَرَّاحِ ‏- رضى الله عنه ‏- قَالَ: سَمِعْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ: { \n\" يُجِيرُ عَلَى اَلْمُسْلِمِينَ بَعْضُهُمْ\" }  أَخْرَجَهُ ابْنُ أَبِي شَيْبَةَ, وَأَحْمَدُ, وَفِي إِسْنَادِهِ ضَعْفٌ  1‏ .‏‏1 ‏- صحيح بشواهده.‏ رواه أحمد ( 1 / 195 )‏، وأبو يعلى ( 876 و 877 )‏.‏","english":{"narrator":"","text":"Abu ’Ubaidah al-Jarrah (RAA) narrated, ‘I heard the Messenger of Allah (ﷺ) say, “Muslims must respect the protection granted (to a non-Muslim) by other Muslims.” Related by Ibn Abi Shaibah and Ahmad with a weakness in its chain of narrators."}},{"id":42,"idInBook":42,"chapterId":11,"bookId":17,"arabic":"وَلِلْطَيَالِسِيِّ: مِنْ حَدِيثِ عَمْرِوِ بْنِ الْعَاصِ: { \n\" يُجِيرُ عَلَى اَلْمُسْلِمِينَ أَدْنَاهُمْ\" }   1‏ .‏‏1 ‏- صحيح بشواهده.‏ رواه أحمد ( 4 / 197 )‏.‏","english":{"narrator":"","text":"At-Taialisi transmitted on the authority of 'Amro bin al-'As (RAA), ‘The right of giving protection to non-Muslims is extended to the most humble of the believers (and all Muslims must respect it and give him support).’"}},{"id":43,"idInBook":43,"chapterId":11,"bookId":17,"arabic":"وَفِي \"اَلصَّحِيحَيْنِ\" : عَنْ عَلِيٍّ : { \"ذِمَّةُ اَلْمُسْلِمِينَ وَاحِدَةٌ يَسْعَى ِبهَا أَدْنَاهُمْ\" }   1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 6755 )‏، ومسلم ( 1370 )‏ وهو مرفوع في حديث طويل.‏","english":{"narrator":"","text":"Al-Bukhari and Muslim transmitted on the authority of 'Ali (RAA), ‘The protection granted by one Muslim is like one given by them all, and this right is extended to the most humble of them.’"}},{"id":44,"idInBook":44,"chapterId":11,"bookId":17,"arabic":"زَادَ اِبْنُ مَاجَه مِنْ وَجْهٍ آخَرَ: { \n\" يُجِيرُ عَلَيْهِمْ أَقْصَاهُمْ\" }   1‏ .‏‏1 ‏- .‏ حسن.‏ رواه ابن ماجه ( 2685 )‏ من طريق عمرو بن شعيب، عن أبيه، عن جده، ولكن لفظه ليس كما ذكره الحافظ، وإنما: \".‏.‏ ويجير على المسلمين أدناهم، ويرد على المسلمين أقصاهم\".‏ ونحو الجملة الأخيرة عن ابن عباس عند ابن ماجه أيضا ( 2683 )‏.‏ولكن رواه أبو داود ( 2751 )‏ باللفظ الذي ذكره الحافظ وأيضا من طريق عمرو بن شعيب، به.‏","english":{"narrator":"","text":"Ibn Majah narrated with a different chain of narrators, 'And the most eminent gives protection on their behalf.’"}},{"id":45,"idInBook":45,"chapterId":11,"bookId":17,"arabic":"وَفِي \"اَلصَّحِيحَيْنِ\" مِنْ حَدِيثٍ أَمِ هَانِئٍ: { قَدْ أَجَرْنَا مَنْ أَجَرْتِ\" }   1‏ .‏‏1 ‏- صحيح.‏ وهو جزء من حديث رواه البخاري ( 3171 )‏، ومسلم ( ( 1 / 498 / رقم 82 )‏.‏","english":{"narrator":"","text":"Al-Bukhari and Muslim transmitted in the hadith of Umm Hani’, “We have given protection to whom you have granted (protection).”"}},{"id":46,"idInBook":46,"chapterId":11,"bookId":17,"arabic":"وَعَنْ عُمَرَ ‏- رضى الله عنه ‏- أَنَّهُ سَمِعَ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ: { \n\" لَأَخْرِجَنَّ اَلْيَهُودَ وَالنَّصَارَى مِنْ جَزِيرَةِ اَلْعَرَبِ, حَتَّى لَا أَدَعَ إِلَّا مُسْلِماً\" }  رَوَاهُ مُسْلِمٌ.‏  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم ( 1767 )‏.‏","english":{"narrator":"","text":"’Umar (RAA) narrated, ‘I heard the Messenger of Allah (ﷺ) say, “I will certainly expel the Jews and the Christians from the Arabian Peninsula so as to leave only Muslims in it.” Reported by Muslim."}},{"id":47,"idInBook":47,"chapterId":11,"bookId":17,"arabic":"وَعَنْهُ قَالَ: { كَانَتْ أَمْوَالُ بَنِي اَلنَّضِيرِ مِمَّا أَفَاءَ اَللَّهُ عَلَى رَسُولِهِ, مِمَّا لَمْ يُوجِفْ عَلَيْهِ اَلْمُسْلِمُونَ بِخَيْلٍ وَلَا رِكَابٍ, فَكَانَتْ لِلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-خَاصَّةً, فَكَانَ يُنْفِقُ عَلَى أَهْلِهِ نَفَقَةَ سَنَةٍ, وَمَا بَقِيَ يَجْعَلُهُ فِي اَلْكُرَاعِ وَالسِّلَاحِ, عُدَّةً فِي سَبِيلِ اَللَّهِ\" }  مُتَّفَقٌ عَلَيْهِ.‏  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 2904 )‏، ومسلم ( 1757 )‏ ( 48 )‏.‏ \"يوجف\": الإيجاف هو الإسراع، والمراد أنه حصل بلا قتال.‏ \"الكراع\" الدواب التي تصلح للحرب.‏","english":{"narrator":"","text":"’Umar (RAA) narrated, ‘The wealth of Banu an-Nadir (one of the Jewish tribes) was part of what Allah bestowed on His Messenger , and which the Muslims had not ridden on horses or camels to get (i.e. they did not have to fight); so they belonged specially to the Prophet who would give his family their sustenance for a year, then applied what remained for horses and weapons and equipment in the Path of Allah, Who is Great and Glorious.” Agreed upon."}},{"id":48,"idInBook":48,"chapterId":11,"bookId":17,"arabic":"وَعَنْ مُعَاذٍ ‏- رضى الله عنه ‏- قَالَ: { غَزَوْنَا مَعَ رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-خَيْبَرَ, فَأَصَبْنَا فِيهَا غَنَمًا , فَقَسَمَ فِينَا رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-طَائِفَةً, وَجَعَلَ بَقِيَّتَهَا فِي اَلْمَغْنَمِ\" }  رَوَاهُ أَبُو دَاوُدَ, وَرِجَالُهُ لَا بَأْسَ بِهِمْ  1‏ .‏‏1 ‏- لا بأس به.‏ رواه أبو داود ( 2707 )‏ من طريق عبد الرحمن بن غنم قال: رابطنا مدينة قنسرين مع شرحبيل بن السمط، فلما فتحها أصاب فيها غنما وبقرا، فقسم فينا طائفة منها وجعل بقيتها في المغنم، فلقيت معاذ بن جبل، فحدثته، فقال معاذ: فذكره.‏ قلت: وفي سنده أبو عبد العزيز الأردني.‏ قال أبو حاتم ( 4 / 2 / 170 )‏: \"ما بحديثه بأس\".‏","english":{"narrator":"","text":"Mu'adh bin Jabal (RAA) narrated, ‘We went on an expedition to Khaibar along with the Prophet and we got some sheep (as spoils). Then Allah's Messenger divided some of them among us and divided the rest with the other war booty,” Related by Abu Dawud on the authority of reasonably reliable men."}},{"id":49,"idInBook":49,"chapterId":11,"bookId":17,"arabic":"وَعَنْ أَبِي رَافِعٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ \n\"إِنِّي لَا أَخِيسُ بِالْعَهْدِ, وَلَا أَحْبِسُ اَلرُّسُلَ \" }  رَوَاهُ أَبُو دَاوُدَ, وَالنَّسَائِيُّ, وَصَحَّحَهُ ابْنُ حِبَّانَ  1‏ .‏‏1 ‏- صحيح رواه أبو داود ( 2758 )‏، والنسائي في \"الكبرى\" ( 5 / 205 )‏، وابن حبان ( 1630 )‏ عن أبي رافع قال: بعثتني قريش إلى رسول الله صلى الله عليه وسلم، فلما رأيت رسول الله صلى الله عليه وسلم ألقي في قلبي الإسلام.‏ فقلت: يا رسول الله! إني والله لا أرجع إليهم أبدا.‏ فقال رسول الله صلى الله عليه وسلم: فذكر الحديث وعندهم \"البرد\" بدل \"الرسل\" وزادوا: \"ولكن ارجع فإن كان في نفسك الذي في نفسك الآن، فارجع\" قال: فذهبت، ثم أتيت النبي صلى الله عليه وسلم، فأسلمت.‏","english":{"narrator":"Abu Rafi’(RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"“I do not break a covenant or imprison messengers.” Related by Abu Dawud and An-Nasa’i. Ibn Hibban graded it as Sahih."}},{"id":50,"idInBook":50,"chapterId":11,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { \n\"أَيُّمَا قَرْيَةٍ أَتَيْتُمُوهَا, فَأَقَمْتُمْ فِيهَا, فَسَهْمُكُمْ فِيهَا, وَأَيُّمَا قَرْيَةٍ عَصَتْ اَللَّهَ وَرَسُولَهُ, فَإِنْ خُمُسَهَا لِلَّهِ وَرَسُولِهِ , ثُمَّ هِيَ لَكُمْ\" }  رَوَاهُ مُسْلِمٌ.‏  1‏ .‏‏1 ‏- صحيح رواه مسلم ( 1756 )‏.‏","english":{"narrator":"Abu Hurairah (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"“Whichever town you take peacefully (they surrendered without, fighting), and stay therein, you have a share in it (in whatever is obtained from it); and whichever town disobeys Allah and His Messenger, a fifth of (its booty) goes to Allah and His Messenger and what remains is yours. Related by Muslim."}},{"id":51,"idInBook":51,"chapterId":11,"bookId":17,"arabic":"عَنْ عَبْدِ اَلرَّحْمَنِ بْنِ عَوْفٍ ‏- رضى الله عنه ‏- { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-أَخَذَهَا ‏- يَعْنِي: اَلْجِزْيَةُ ‏- مِنْ مَجُوسِ هَجَرَ }  رَوَاهُ اَلْبُخَارِيّ ُ  1‏ .‏\nوَلَهُ طَرِيقٌ فِي \n\"اَلْمَوْطَأِ\" فِيهَا اِنْقِطَاع ٍ  2‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 3157 )‏.\n2 ‏- روى مالك في \"الموطأ\" ( 1 / 278 / 42 )‏ عن جعفر بن محمد بن علي، عن أبيه؛ أن عمر بن الخطاب ذكر المجوس فقال: ما أدري كيف أصنع في أمرهم.‏ فقال عبد الرحمن بن عوف: أشهد لسمعت رسول الله صلى الله عليه وسلم يقول: \"سنوا بهم سنة أهل الكتاب\".‏ قلت: وهذا كما قال الحافظ هنا وفي \"الفتح\" ( 6 / 261 )‏: \" هذا منقطع مع ثقة رجاله\".‏","english":{"narrator":"","text":"’Abdur Rahman bin 'Auf (RAA) narrated, ‘The Messenger of Allah (ﷺ) took the Jizyah from the Magians of Hajar.’ Related by Al-Bukhari."}},{"id":52,"idInBook":52,"chapterId":11,"bookId":17,"arabic":"وَعَنْ عَاصِمِ بْنِ عُمَرَ, عَنْ أَنَسٍ, وَعَن ْ  1‏ عُثْمَانَ بْنِ أَبِي سُلَيْمَانَ; { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-بَعْثٍ خَالِدُ بْنُ اَلْوَلِيدِ إِلَى أُكَيْدِرِ دُومَةَ, فَأَخَذُوهُ ,  2‏ فَحَقَنَ دَمِهِ, وَصَالَحَهُ عَلَى اَلْجِزْيَةِ }  رَوَاهُ أَبُو دَاوُد َ  3‏ .‏‏1 ‏- سقط \"عن\" من \"أ\".‏‏2 ‏- وفي \"أ\": \"فأخذه\"، والذي في \"السنن\": \"فأخذه، فأتوه به\".‏‏3 ‏- حسن.‏ رواه أبو داود ( 3037 )‏، والبيهقي ( 9 / 187 )‏ مطولا.‏","english":{"narrator":"","text":"’Asim bin ’Umar narrated On the authority of Anas and Uthman bin Abu Sulaiman (RAA),‘The Messenger of Allah (ﷺ) sent Khalid bin al-Walid to Ukaidir of Dawmat al-Jandal and they seized him and brought him to the Prophet (ﷺ). The Messenger of Allah (ﷺ) spared his life and made peace with him on the condition that he should pay Jizyah.’ Related by Abu Dawud."}},{"id":53,"idInBook":53,"chapterId":11,"bookId":17,"arabic":"وَعَنْ مُعَاذِ بْنِ جَبَلٍ ‏- رضى الله عنه ‏- قَالَ: { بَعَثَنِي اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-إِلَى اَلْيَمَنِ, وَأَمَرَنِي أَنْ آخُذَ مِنْ كُلِّ حَالِمٍ دِينَاراً, أَوْ عَدْلَهُ معافرياً }  أَخْرَجَهُ اَلثَّلَاثَةِ, وَصَحَّحَهُ اِبْنُ حِبَّانَ, وَالْحَاكِم ُ  1‏ .‏‏1 ‏- صحيح.‏ رواه أبو داود ( 3038 )‏، والنسائي ( 5 / 25 ‏- 26 )‏، والترمذي ( 623 )‏، وابن حبان ( 794 )‏، والحاكم ( 1 / 398 )‏.‏ المعافري: ثياب تكون باليمن، نسبة إلى بلد هناك.‏","english":{"narrator":"","text":"Mu'adh bin Jabal (RAA) narrated, ‘The Messenger of Allah (ﷺ) sent me to Yemen and he commanded me to take the Jizyah from everyone who has reached the age of puberty-one Dinar- or its equivalent in Ma’afiri (garments of Yemeni origin).’ Related by the three Imams. Ibn Hibban and Al-Hakim graded it as Sahih."}},{"id":54,"idInBook":54,"chapterId":11,"bookId":17,"arabic":"وَعَنْ عَائِذٍ بْنُ عَمْرِوِ الْمُزَنِيِّ ‏- رضى الله عنه ‏- عَنْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { \n\"اَلْإِسْلَامِ يَعْلُو, وَلَا يُعْلَى\" }  أَخْرَجَهُ اَلدَّارَقُطْنِيّ ُ  1‏ .‏‏1 ‏- حسن.‏ رواه الدارقطني ( 3 / 252 / 31 )‏ بسند ضعيف، فيه مجهولان.‏ وقد حسن الحافظ في\" الفتح\" ( 3 / 220 )‏ ‏- سنده بعد أن عزاه للروياني والدارقطني، فلعله عند الروياني من طريق آخر غير طريق الدارقطني، وإلا فيكون ضعيفا أيضا.‏ قلت: ولكن له شواهد تقويه مرفوعا.‏ وأيضا يصبح موقوفا على ابن عباس كما علقه البخاري، ووصله غيره.‏","english":{"narrator":"’A’idh bin 'Amro al-Muzani (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"“Islam is always superior and should never be surpassed.” Related by Ad-Daraqutni."}},{"id":55,"idInBook":55,"chapterId":11,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { \n\" لَا تَبْدَؤُوا اَلْيَهُودَ وَالنَّصَارَى بِالسَّلَامِ, وَإِذَا لَقِيتُمْ أَحَدَهُمْ فِي طَرِيقٍ, فَاضْطَرُّوهُ إِلَى أَضْيَقِهِ\" }  رَوَاهُ مُسْلِم ٌ  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم ( 2167 )‏.‏","english":{"narrator":"Abu Hurairah (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"“Do not start by saluting the Jews and the Christians (when you meet them), and if you meet any of them on the road, force him to go to the narrowest part of the road (i.e. do not give them positions of authority among you.)” Related by Muslim."}},{"id":56,"idInBook":56,"chapterId":11,"bookId":17,"arabic":"وَعَنْ اَلْمِسْوَرِ بْنُ مَخْرَمَةَ.‏ وَمَرْوَانُ; { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-خَرَجَ عَامَ اَلْحُدَيْبِيَةِ.‏ ….‏.‏ فَذَكِّرْ اَلْحَدِيثَ بِطُولِهِ, وَفِيهِ: \n\" هَذَا مَا صَالَحَ عَلَيْهِ مُحَمَّدُ بْنُ عَبْدِ اَللَّهِ سُهَيْلِ بْنِ عَمْرِوٍ: عَلَى وَضْعِ اَلْحَرْبِ عَشْرِ سِنِينَ, يَأْمَنُ فِيهَا اَلنَّاسُ, وَيَكُفُّ بَعْضُهُمْ عَنْ بَعْضِ\" }  أَخْرَجَهُ أَبُو دَاوُد َ  1‏ .‏\nوَأَصْلِهِ فِي اَلْبُخَارِيّ ِ  2‏ .‏‏1 ‏- حسن.‏ رواه أبو داود ( 2766 )‏ من طريق المسور ومروان بن الحكم؛ أنهم اصطلحوا على وضع الحرب عشر سنين يأمن فيها الناس، وعلى أن بيننا عيبة مكفوفة، وأنه لا إسلال ولا إغلال.‏ قلت: وهذا الحديث هو الذي قصده الحافظ ‏- رحمه الله ‏- وإن كان قد ساقه بلفظه هو، وأيضا صرح بأن الحديث طويل، وليس الأمر كذلك، إذ ليس عند أبي داود سوى ما ذكرت.‏ نعم ساق أبو داود الحديث في الصلح بطوله، لكنه من طريق المسور وحده ( 2765 )‏ ليس فيه محل الشاهد الذي ذكره الحافظ.‏\n‏2 ‏- انظر ( 5 / 329 ‏- 333 )‏.‏","english":{"narrator":"","text":"Al·Miswar bin Makhramah and Marwan narrated, ‘The Messenger of Allah (ﷺ) went out in the year of al-Hudaibiyah (reconciliation)- the narrator narrated a long hadith which contained, ‘this is what Muhammad bin 'Abdullah has reconciled with Suhail bin ’Amro, to stop fighting for 10 years during which time people will live safely, and refrain from lighting one another...’ Related by Abu Dawud. It is part of a long hadith narrated by Al-Bukhari."}},{"id":57,"idInBook":57,"chapterId":11,"bookId":17,"arabic":"وَأَخْرُجَ مُسْلِمٍ بَعْضِهِ مِنْ حَدِيثِ أَنَسٍ, وَفِيهِ: { أَنَّ مَنْ جَاءَ مِنْكُمْ لَمْ نَرُدْهُ عَلَيْكُمْ, وَمَنْ جَاءَكُمْ مِنَّا رَدَدْتُمُوهُ عَلَيْنَا.‏ فَقَالُوا: أَنَكْتُبُ هَذَا يَا رَسُولُ اَللَّهُ? قَالَ: \n\"نَعَمْ.‏ إِنَّهُ مِنْ ذَهَبٍ مِنَّا إِلَيْهِمْ فَأَبْعَدَهُ اَللَّهُ, وَمَنْ جَاءَنَا مِنْهُمْ, فَسَيَجْعَلُ اَللَّهُ لَهُ فَرَجاً وَمُخْرِجاً\" }   1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم ( 1784 )‏.‏","english":{"narrator":"","text":"Muslim transmitted part of this hadith on the authority of Anas bin Malik (RAA) which says, ‘ln case any of you comes to us we shall not send him back to you (i.e. one of the Muslims who goes back to Quraysh), and in case any of us came to you, you should send him back to us (any of the people of Quraysh who goes to the Prophet they will send him back to Makkah).’ The Companions asked the Prophet (ﷺ),’O Messenger of Allah (ﷺ)! Will you write this down?’ He replied, “Yes. May Allah send out of His Mercy any of the Muslims who goes back to them. But Allah will grant a way out for anyone who comes to us from them.”"}},{"id":58,"idInBook":58,"chapterId":11,"bookId":17,"arabic":"وَعَنْ عَبْدِ اَللَّهِ بْنِ عَمْرِو ٍ  ; 1‏ عَنْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { \n\"مِنْ قَتْلِ مُعَاهِداً لَمْ يَرَحْ رَائِحَةَ اَلْجَنَّةِ, وَإِنَّ رِيحَهَا لِيُوجَدَ مِنْ مَسِيرَةِ أَرْبَعِينَ عَامّاً\" }  أَخْرَجَهُ اَلْبُخَارِيّ ُ  2‏ .‏‏1 ‏- تحرف في \"أ\" إلى \"عمر\".‏‏2 ‏- صحيح.‏ رواه البخاري ( 3166 )‏.‏","english":{"narrator":"'Abdullah Ibn 'Umar (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"“Whoever kills a Mu'ahid will not smell the fragrance of Paradise, even though its fragrance could be smelt at a distance of forty years.” Related by Al-Bukhari."}},{"id":59,"idInBook":59,"chapterId":11,"bookId":17,"arabic":"عَنْ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { سَابَقَ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-بِالْخَيْلِ اَلَّتِي قَدْ أُضْمِرَتْ, مِنْ الْحَفْيَاءِ, وَكَانَ أَمَدُهَا ثَنِيَّةِ اَلْوَدَاعِ.‏ وَسَابَقَ بَيْنَ اَلْخَيْلِ اَلَّتِي لَمْ تُضَمَّرْ مِنْ اَلثَّنِيَّةِ إِلَى مَسْجِد ٍ  1‏ بَنِي زُرَيْقٍ, وَكَانَ اِبْنُ عُمَرَ فِيمَنْ سَابَقَ }  مُتَّفَقٌ عَلَيْه ِ  2‏ زَادَ اَلْبُخَارِيُّ, قَالَ سُفْيَانُ: مِنْ الْحَفْيَاءِ إِلَى ثَنِيَّةِ اَلْوَدَاعُ خَمْسَةِ أَمْيَالٍ, أَوْ سِتَّةَ, وَمِنْ اَلثَّنِيَّةِ إِلَى مَسْجِدِ بَنِي زُرَيْقٍ مِيل ٍ  3‏ .‏‏1 ‏- سقط من \"أ\".‏‏2 ‏- صحيح.‏ رواه البخاري ( 420 )‏، ومسلم ( 1870 )‏.‏‏3 ‏- البخاري برقم ( 2868 )‏.‏","english":{"narrator":"Ibn ’Umar (RAA) narrated, ‘The Messenger of Allah (ﷺ) held a horse race, with horses that had been made lean by training, from al-Hafiya to Thanyat al-Wada' (names of two places) and he held a race from Thanyat- alWada' to the mosque of Banu Zuraiq between the horses which had not undergone such training.’ Ibn ’Umar was among those who took part in that race. Agreed upon. Al-Bukhari added:","text":"Sufian said, ‘From al·Hafiya’ to Thanyat al-Wada' is a distance of live or six miles and from Thanyat- al-Wada‘ to the mosque of Banu Zuraiq is a distance of one mile.’"}},{"id":60,"idInBook":60,"chapterId":11,"bookId":17,"arabic":"وَعَنْهُ; { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-سَبْقَ بَيْنَ اَلْخَيْلِ, وَفَضْلِ اَلْقَرْحُ فِي اَلْغَايَةِ }  رَوَاهُ أَحْمَدُ, وَأَبُو دَاوُدَ, وَصَحَّحَهُ اِبْنُ حِبَّان َ  1‏ .‏‏1 ‏- صحيح.‏ رواه أحمد ( 2 / 157 )‏، وأبو داود ( 2577 )‏، وابن حبان ( 4669 )‏.‏ القرح: جمع قارح، والقارح من الخيل هو الذي دخل في السنة الخامسة.‏","english":{"narrator":"","text":"Ibn ’Umar (RAA) narrated, ‘ Messenger of Allah (ﷺ) held a horse race and made the destination from the fully grown ones at a longer distance Related by Ahmad and Abu Dawud. Ibn Hibban graded it as Sahih."}},{"id":61,"idInBook":61,"chapterId":11,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ \n\"لَا سَبْقَ إِلَّا فِي خُفٍّ, أَوْ نَصْلٍ, أَوْ حَافِرٍ\" }  رَوَاهُ أَحْمَدُ, وَالثَّلَاثَةَ, وَصَحَّحَهُ اِبْنُ حِبَّان َ  1‏ .‏‏1 ‏- صحيح.‏ رواه أحمد ( 2 / 474 )‏، وأبو داود ( 2574 )‏، والنسائي ( 6 / 226 )‏، والترمذي ( 1700 )‏، وابن حبان ( 4671 )‏.‏ وقال الترمذي: \"حديث حسن\".‏","english":{"narrator":"","text":"Abu Hurairah (RAA) narrated that The Messenger of Allah (ﷺ) said ,”Prize money is allowed only for racing camels, shooting arrows or racing horses.” Related by Ahmad and the three lmams. Ibn Hibban graded it as Sahih."}},{"id":62,"idInBook":62,"chapterId":11,"bookId":17,"arabic":"وَعَنْهُ, عَنْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { \n\" مَنْ أَدْخُلُ فَرَساً بَيْنَ فَرَسَيْنِ ‏- وَهُوَ لَا يَأْمَنُ أَنْ يَسْبِقَ ‏- فَلَا بَأْسَ بِهِ, وَإِنْ أَمِنَ فَهُوَ قِمَارٌ\" }  رَوَاهُ أَحْمَدُ, وَأَبُو دَاوُدَ, وَإِسْنَادُهُ ضَعِيف ٌ  1‏ .‏‏1 ‏- ضعيف.‏ رواه أحمد ( 2 / 505 )‏، وأبو داود ( 2579 )‏، وابن ماجه ( 2876 )‏ من طريق سفيان بن حسين، عن الزهري، عن سعيد بن المسيب، عن أبي هريرة، به.‏ وسفيان بن حسين ضعيف في الزهري كما هو معروف، وأغلب ظني أن هذا من كلام ابن المسيب، فقد رواه مالك في \"الموطأ\" ( 2 / 468 / 46 )‏ عن يحيى بن سعيد؛ أنه سمع سعيد بن المسيب يقول: ليس برهان الخيل بأس إذا دخل فيها محلل، فإن سبق أخذ السبق، وإن سبق لم يكن عليه شيء.‏ فلعل هذا هو أصل الحديث.‏ والله أعلم.‏ ثم رأيت أبا حاتم قال في \"العلل\" ( 2 / 252 / رقم 2249 )‏: \" هذا خطأ.‏ لم يعمل سفيان بن حسين بشيء، لا يشبه أن يكون عن النبي صلى الله عليه وسلم، وأحسن أحواله أن يكون عن سعيد بن المسيب قوله.‏ وقد رواه يحيى بن سعيد، عن سعيد قوله\" .‏","english":{"narrator":"Abu Hurairah (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"“If anyone introduces a horse in a race with two other horses, when he is not certain that it cannot be beaten, there is no harm in it, but when he is certain (it cannot be beaten) it is then considered as gambling.” Related by Ahmad and Abu Dawud with a weak chain of narrators."}},{"id":63,"idInBook":63,"chapterId":11,"bookId":17,"arabic":"وَعَنْ عَقَبَةِ بْنُ عَامِرٍ ‏- رضى الله عنه ‏- { : سَمِعْتَ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-وَهُوَ عَلَى اَلْمِنْبَرِ يَقْرَأُ: ﴿ وَأَعِدُّوا لَهُمْ مَا اِسْتَطَعْتُمْ مِنْ قُوَّةٍ  ﴾ 1‏ \"أَلَا إِنَّ اَلْقُوَّةَ اَلرَّمْيُ, أَلَا إِنَّ اَلْقُوَّةَ اَلرَّمْيُ, أَلَا إِنَّ اَلْقُوَّةَ اَلرَّمْيُ }   2‏ .‏ رَوَاهُ مُسْلِمٌ .‏  3‏ .‏‏1 ‏- ضعيف.‏ رواه أحمد ( 2 / 505 )‏، وأبو داود ( 2579 )‏، وابن ماجه ( 2876 )‏ من طريق سفيان بن حسين، عن الزهري، عن سعيد بن المسيب، عن أبي هريرة، به.‏ وسفيان بن حسين ضعيف في الزهري كما هو معروف، وأغلب ظني أن هذا من كلام ابن المسيب، فقد رواه مالك في \"الموطأ\" ( 2 / 468 / 46 )‏ عن يحيى بن سعيد؛ أنه سمع سعيد بن المسيب يقول: ليس برهان الخيل بأس إذا دخل فيها محلل، فإن سبق أخذ السبق، وإن سبق لم يكن عليه شيء.‏ فلعل هذا هو أصل الحديث.‏ والله أعلم.‏ ثم رأيت أبا حاتم قال في \"العلل\" ( 2 / 252 / رقم 2249 )‏: \" هذا خطأ.‏ لم يعمل سفيان بن حسين بشيء، لا يشبه أن يكون عن النبي صلى الله عليه وسلم، وأحسن أحواله أن يكون عن سعيد بن المسيب قوله.‏ وقد رواه يحيى بن سعيد، عن سعيد قوله\" .‏‏2 ‏- سقطت الجملة الثالثة من \"أ\" .‏ وهي في \"الصحيح\".‏‏3 ‏- صحيح.‏ رواه مسلم ( 1917 )‏.‏","english":{"narrator":"","text":"'Uqbah bin 'Amir (RAA) narrated, ‘I heard the Messenger of Allah (ﷺ) recite when he was on the pulpit, “And make ready against them all you can of power, including steeds of war( tanks, planes etc.)”(8:60), surely strength is in shooting (arrows); surely strength is in shooting, surely strength is in shooting.” Related by Muslim."}}],"chapter":{"id":11,"bookId":17,"arabic":"كتاب الجهاد","english":"Jihad"}}