{"metadata":{"length":23,"arabic":{"title":"بلوغ المرام","author":"الإمام ابن حجر العسقلاني","introduction":"كتاب الأيمان والنذور"},"english":{"title":"Bulugh al-Maram","author":"Ibn Hajar al-Asqalani","introduction":"Oaths and Vows"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":13,"bookId":17,"arabic":"عَنْ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا, { عَنْ رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-أَنَّهُ أَدْرَكَ عُمَرَ بْنَ اَلْخَطَّابِ فِي رَكْبٍ, وَعُمَرَ يَحْلِفُ بِأَبِيهِ, فَنَادَاهُمْ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-\n\"أَلَا إِنَّ اَللَّهَ يَنْهَاكُمْ أَنْ تَحْلِفُوا بِآبَائِكُمْ, فَمَنْ كَانَ حَالِفاً فَلْيَحْلِفْ بِاَللَّهِ, أَوْ لِيَصْمُتْ\" }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 6646 )‏، ومسلم ( 1646 )‏ ( 3 )‏.‏","english":{"narrator":"Narrated Ibn 'Umar (RA):","text":"Allah's Messenger (ﷺ) overtook 'Umar bin al-Khattab when he was with a party of riders of about ten and 'Umar was swearing by his father. Allah's Messenger (ﷺ) called them and said, \"Verily! Allah forbids you from swearing by your fathers. Therefore, if anyone swears, he must swear by Allah or keep silent.\" "}},{"id":2,"idInBook":2,"chapterId":13,"bookId":17,"arabic":"وَفِي رِوَايَةٍ لِأَبِي دَاوُدَ, وَالنَّسَائِيِّ: عَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- { لَا تَحْلِفُوا بِآبَائِكُمْ, وَلَا بِأُمَّهَاتِكُمْ, وَلَا بِالْأَنْدَادِ, وَلَا تَحْلِفُوا إِلَّا بِاَللَّهِ, وَلَا تَحْلِفُوا بِاَللَّهِ إِلَّا وَأَنْتُمْ صَادِقُونَ\" }   1‏ .‏‏1 ‏- صحيح.‏ رواه أبو داود ( 3248 )‏، والنسائي ( 7 / 5 )‏.‏","english":{"narrator":"In a narration which is Marfu' (attributed to the Prophet) reported by Abu Dawud and an-Nasa'i from Abu Hurairah (RA) it has:","text":"\"Do not swear by your fathers, nor by your mothers, nor by the rivals (set up as equals with Allah); and do not swear by Allah except when you are speaking the truth.\""}},{"id":3,"idInBook":3,"chapterId":13,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ \" يَمِينُكَ عَلَى مَا يُصَدِّقُكَ بِهِ صَاحِبُكَ\" }  وَفِي رِوَايَةٍ: { \"اَلْيَمِينُ عَلَى نِيَّةِ اَلْمُسْتَحْلِفِ\" }  أَخْرَجَهُمَا مُسْلِمٌ  1‏ .‏‏1 ‏- صحيح رواه مسلم ( 1653 )‏.‏","english":{"narrator":"Narrated Abu Hurairah (RA):","text":"Allah's Messenger (ﷺ) said: \"Your oath will be about that matter which your adversary has required you to swear about so that he will believe you.\"\n\nIn another narration: \"An oath is to be interpreted according to the intention of the one who requested it (Al-Mustahlif).\"\n\n."}},{"id":4,"idInBook":4,"chapterId":13,"bookId":17,"arabic":"وَعَنْ عَبْدِ اَلرَّحْمَنِ بْنِ سَمُرَةٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ وَإِذَا حَلَفْتَ عَلَى يَمِينٍ, فَرَأَيْتُ غَيْرَهَا خَيْراً مِنْهَا, فَكَفِّرْ عَنْ يَمِينِكَ, وَائْتِ اَلَّذِي هُوَ خَيْرٌ\" }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏ وَفِي لَفْظٍ لِلْبُخَارِيِّ: { \" فَائِت اَلَّذِي هُوَ خَيْرٌ, وَكَفِّرْ عَنْ يَمِينِكَ\" }   2‏ .‏ \nوَفِي رِوَايَةٍ لِأَبِي دَاوُدَ: { \" فَكَفِّرْ عَنْ يَمِينِكَ, ثُمَّ اِئْتِ اَلَّذِي هُوَ خَيْرٌ\" }  وَإِسْنَادُهَا صَحِيحٌ  3‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 6622 )‏، ومسلم ( 1652 )‏.‏‏2 ‏- البخاري ( 6722 )‏.‏\n‏3 ‏- صحيح.‏ أبو داود ( 3278 )‏.‏","english":{"narrator":"Narrated 'Abdur-Rahman bin Samura (RA):","text":"Allah's Messenger (ﷺ) said: \"When you swear an oath and then consider something else to be better than it, make atonement for your oath and do the thing that is better.\" . A wording of al-Bukhari has: \"Do the thing that is better and make atonement for your oath.\"\nIn a narration by Abu Dawud: \"Make atonement for your oath, then do the thing that is better.\" ."}},{"id":5,"idInBook":5,"chapterId":13,"bookId":17,"arabic":"وَعَنْ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا; أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { \n\"مَنْ حَلِفِ عَلَى يَمِينٍ فَقَالَ: إِنْ شَاءَ اَللَّهُ, فَلَا حِنْثَ عَلَيْهِ\" }  رَوَاهُ اَلْخَمْسَةُ  1‏ .‏ وَصَحَّحَهُ اِبْنُ حِبَّانَ  2‏ .‏‏1 ‏- كذا \"بالأصلين\" وأشار ناسخ \"أ\" في الهامش إلى نسخة: \"أحمد والأربعة\".‏‏2 ‏- صحيح.‏ رواه أحمد ( 2 / 10 )‏، وأبو داود ( 3261 )‏، والنسائي ( 7 / 25 )‏، والترمذي ( 1531 )‏، وابن ماجه ( 2105 )‏، وابن حبان ( 1184 )‏.‏ قلت: اللفظ للترمذي؛ إلا أنه زاد: \"فقد استثنى\" بعد قوله: \"إن شاء الله\" ، وإلى هذه الزيادة دون الجملة الأخيرة رواه أبو داود.‏ والنسائي وأحمد.‏ وأما لفظ ابن حبان فهو: \"من حلف فقال: إن شاء الله، لم يحنث\" .‏ ولفظ ابن ماجه: \" من حلف واستثنى، إن شاء رجع، وإن شاء ترك، غير حانث\" .‏ وهو أيضا لبعضهم، وله ألفاظ أخرى، ذكرتها مفصلة مع طرقها في \"الأصل\".‏","english":{"narrator":"Narrated Ibn 'Umar (RA):","text":"\"Allah's Messenger (ﷺ) said: \"Whoever swears an oath, and then says: \"If Allah Wills\", he is not held accountable if he breaks it.\"\n\n."}},{"id":6,"idInBook":6,"chapterId":13,"bookId":17,"arabic":"وَعَنْ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { كَانَتْ يَمِينُ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-\n\"لَا, وَمُقَلِّبِ اَلْقُلُوبِ\" }  رَوَاهُ اَلْبُخَارِيُّ  1‏ .‏‏1 ‏- صحيح رواه البخاري (6628)‏.‏","english":{"narrator":"Narrated Ibn Umar (RA):","text":"The Prophet's oath (ﷺ) used to be: \"No, by Him Who turns (changes) the hearts.\"\n\n."}},{"id":7,"idInBook":7,"chapterId":13,"bookId":17,"arabic":"وَعَنْ عَبْدِ اَللَّهِ بْنِ عَمْرِوٍ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { جَاءَ أَعْرَابِيٌّ إِلَى اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-فَقَالَ: يَا رَسُولَ اَللَّهِ! مَا اَلْكَبَائِرُ?.‏ … فَذَكَرَ اَلْحَدِيثَ, وَفِيهِ قُلْتُ: وَمَا اَلْيَمِينُ اَلْغَمُوسُ? قَالَ: \n\" اَلَّذِي يَقْتَطِعُ مَالَ امْرِئٍ مُسْلِمٍ, هُوَ فِيهَا كَاذِبٌ\" }  أَخْرَجَهُ اَلْبُخَارِيُّ.‏  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 6920 )‏.‏","english":{"narrator":"Narrated 'Abdullah bin 'Amr (RA):","text":"A desert Arab came to the Prophet (ﷺ) and said, \"O Allah's Messenger, what are the major sins?\" The narrator reported the Hadith and it contains: \"The false oath.\" It contains also: I asked, \"What is the false oath?\" The Prophet (ﷺ) replied, \"It is that (oath) by which one takes possession of the property of a Muslim person, while he is lying.\" ."}},{"id":8,"idInBook":8,"chapterId":13,"bookId":17,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا { فِي قَوْلِهِ تَعَالَى: ﴿ لَا يُؤَاخِذُكُمُ اَللَّهُ بِاللَّغْوِ فِي أَيْمَانِكُمْ  ﴾ 1‏ \nقَالَتْ: هُوَ قَوْلُ اَلرَّجُلِ: لَا وَاَللَّهِ.‏ بَلَى وَاَللَّهِ }  أَخْرَجَهُ اَلْبُخَارِيُّ  2‏ .‏ وَأَوْرَدَهُ أَبُو دَاوُدَ مَرْفُوعاً  3‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 6920 )‏.‏\n‏2 ‏- صحيح.‏ رواه البخاري ( 6663 )‏.‏‏3 ‏- رواه أبو داود ( 3254 )‏ وأشار أبو داود إلى وقفه، وهو الذي صححه الدارقطني.‏","english":{"narrator":"Narrated 'Aishah (RA) regarding the saying of Allah the Most High:","text":"\"Allah will not punish you for what is unintentional in your oaths (5:89).\" She said: It (was sent down about such phrases as) a person's sayying: 'No, by Allah' and 'Yes, by Allah.'\n\n"}},{"id":9,"idInBook":9,"chapterId":13,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ \n\"إِنَّ لِلَّهِ تِسْعًا وَتِسْعِينَ اِسْماً, مَنْ أَحْصَاهَا دَخَلَ اَلْجَنَّةَ\" }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏ وَسَاقَ اَلتِّرْمِذِيُّ وَابْنُ حِبَّانَ اَلْأَسْمَاءِ, وَالتَّحْقِيقُ أَنَّ سَرْدَهَا إِدْرَاجٌ مِنْ بَعْضِ اَلرُّوَاةِ  2‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 2736 )‏ و ( 7392 )‏، ومسلم ( 2677 )‏ ( 6 )‏ وزادا: \"مائة إلا واحدا\" بعد: \"اسما\".‏ وعندهما زيادة أخرى: \"وهو وتر يحب الوتر\" .‏ وفي رواية للبخاري ( 6410 )‏ ومسلم: \"من حفظها\".‏‏2 ‏- هو كما قال الحافظ، وهو الذي رجحه غير واحد من الحفاظ، وهذه الرواية عند الترمذي ( 3507 )‏، وابن حبان ( 808 )‏.‏","english":{"narrator":"Narrated Abu Hurairah (RA):","text":"Allah's Messenger (ﷺ) said: \"Verily! Allah has ninety-nine Names concerning which he who retains them in his memory will enter Paradise.\" ."}},{"id":10,"idInBook":10,"chapterId":13,"bookId":17,"arabic":"وَعَنْ أُسَامَةَ بْنِ زَيْدٍ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ \n\"مَنْ صُنِعَ إِلَيْهِ مَعْرُوفٌ, فَقَالَ لِفَاعِلِهِ: جَزَاكِ اَللَّهُ خَيْراً.‏ فَقَدْ أَبْلَغَ فِي اَلثَّنَاءِ\" }  أَخْرَجَهُ اَلتِّرْمِذِيُّ, وَصَحَّحَهُ اِبْنُ حِبَّانَ  1‏ .‏‏1 ‏- صحيح.‏ رواه الترمذي ( 2035 )‏، وابن حبان ( 3404 )‏ وقال الترمذي: \" هذا حديث حسن جيد غريب\".‏","english":{"narrator":"Narrated Usama bin Zaid (RA):","text":"Allah's Messenger (ﷺ) said. \"If one is done a kindness and ."}},{"id":11,"idInBook":11,"chapterId":13,"bookId":17,"arabic":"وَعَنْ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا, { عَنْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-أَنَّهُ نَهَى عَنْ اَلنَّذْرِ وَقَالَ: \n\" إِنَّهُ لَا يَأْتِي بِخَيْرٍ وَإِنَّمَا يُسْتَخْرَجُ بِهِ مِنْ اَلْبَخِيلِ\" }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- .‏ صحيح.‏ رواه البخاري ( 6608 )‏، ومسلم ( 1639 )‏ واللفظ لمسلم.‏ وفي لفظ لهما: \"إنه لا يرد شيئا\" وآخره مثله.‏ إلا أنه وقع عند مسلم في رواية: \"وإنما يستخرج به من الشحيح\".‏ وفي أخرى لهما أيضا : \" إن النذر لا يقدم شيئا، ولا يؤخر\" والباقي مثله.‏","english":{"narrator":"Narrated Ibn 'Umar (RA):","text":"The Prophet (ﷺ) forbade making vows, and said, \"It does not bring good. Indeed, it is only a means by which something is extracted from the miserly.\"\n\n."}},{"id":12,"idInBook":12,"chapterId":13,"bookId":17,"arabic":"وَعَنْ عُقْبَةَ بْنِ عَامِرٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ \n\"كَفَّارَةُ اَلنَّذْرِ كَفَّارَةُ يَمِينٍ\" }  رَوَاهُ مُسْلِمٌ.‏  1‏ .‏ وَزَادَ اَلتِّرْمِذِيُّ فِيهِ: { إِذَا لَمْ يُسَمِّ }  , وَصَحَّحَهُ.‏  2‏ .‏‏1 ‏- صحيح.‏ رواه مسلم ( 1645 )‏.‏‏2 ‏- ضعيف.‏ رواه الترمذي ( 1528 )‏ وفيه محمد بن يزيد الفلسطيني وهو \"مجهول\" وهذا الزيادة أيضا عند ابن ماجه ( 2127 )‏ بسند ضعيف.‏","english":{"narrator":"Narrated 'Uqba bin 'Aamir (RA):","text":"Allah's Mssenger (ﷺ) said: \"The atonement for a vow (Nadhr) is (the same as) the atonement an oath (Yamin).\" ."}},{"id":13,"idInBook":13,"chapterId":13,"bookId":17,"arabic":"وَلِأَبِي دَاوُدَ: مِنْ حَدِيثِ اِبْنِ عَبَّاسٍ مَرْفُوعاً: { \n\"مِنْ نَذَرَ نَذْراً لَمْ يُسَمِّهِ, فَكَفَّارَتُهُ كَفَّارَةُ يَمِينٍ, وَمَنْ نَذَرَ نَذْراً فِي مَعْصِيَةٍ, فَكَفَّارَتُهُ كَفَّارَةُ يَمِينٍ, وَمَنْ نَذَرَ نَذْراً لَا يُطِيقُهُ, فَكَفَّارَتُهُ كَفَّارَةُ يَمِينٍ\" }  وَإِسْنَادُهُ صَحِيحٌ; إِلَّا أَنَّ اَلْحُفَّاظَ رَجَّحُوا وَقْفَهُ.‏  1‏ .‏‏1 ‏- ضعيف مرفوعا.‏ رواه أبو داود ( 3322 )‏ من طريق طلحة بن يحيى الأنصاري عن عبد الله بن سعيد بن أي هند، عن بكير بن عبد الله الأشج، عن كريب، عن ابن عباس مرفوعا، به.‏ وزاد: \" ومن نذر نذرا أطاقه، فليف به\" قلت: هكذا رواه طلحة، وخالفه وكيع، فرواه موقوفا.‏ رواه عن ابن أبي شيبة ( 4 / 173 )‏.‏ ولا شك أن رواية وكيع هي الصواب خاصة إذا قابلت بين ترجمة الرجلين ولذا قال أبو داود: \" روي هذا الحديث وكيع وغيره عن عبد الله بن سعيد أوقفوه علي بن عباس\" .‏ وكذلك قال أبو زرعة وأبو حاتم ( 1 / 441 / 1326 )‏: \" الموقوف الصحيح\" .‏","english":{"narrator":"Abu Dawud has from the narration of Ibn Abbas (RA) (who reported Allah's Messenger (ﷺ) as saying):","text":"\"If anyone takes a vow but does not name it, its atonement is the same as that for an oath. If anyone takes a vow to do an act of disobedience, its atonement is the same as that for an oath. If anyone takes a vow which he is unable to fulfill , its atonement is the same as that for an oath.\" ."}},{"id":14,"idInBook":14,"chapterId":13,"bookId":17,"arabic":"وَلِلْبُخَارِيِّ: مِنْ حَدِيثِ عَائِشَةَ: { \n\" وَمَنْ نَذَرَ أَنْ يَعْصِيَ اَللَّهَ فَلَا يَعْصِهِ\" }   1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 6700 )‏ وأوله: \" من نذر أن يطيع الله، فليطعه\" .‏","english":{"narrator":"al-Bukhari has reported from the Hadith of 'Aishah (RA):","text":"(Allah's Messenger (ﷺ) said) \"If anyone vows to disobey Allah, then he must not disobey Him.\""}},{"id":15,"idInBook":15,"chapterId":13,"bookId":17,"arabic":"وَلِمُسْلِمٍ: مِنْ حَدِيثِ عِمْرَانَ: { \n\" لَا وَفَاءَ لِنَذْرٍ فِي مَعْصِيَةٍ\" }   1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم ( 1641 )‏ في حديث طويل، وهو حديث عظيم، فيه أحكام عظيمة، منها جواز سفر المرأة بدون محرم في حالة مخصوصة، كما كنت بينت ذلك في كتابي \"أوضح البيان في حكم سفر النسوان\" .‏","english":{"narrator":"Muslim has reported from the Hadith of 'Imran (RA):","text":"(Allah's Messenger (ﷺ) said) \"There is no fulfillment of a vow involving an act of disobedience.\" ."}},{"id":16,"idInBook":16,"chapterId":13,"bookId":17,"arabic":"وَعَنْ عُقْبَةَ بْنِ عَامِرٍ ‏- رضى الله عنه ‏- قَالَ: { نَذَرَتْ أُخْتِي أَنْ تَمْشِيَ إِلَى بَيْتِ اَللَّهِ حَافِيَةً, فَقَالَ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-\n\"لِتَمْشِ وَلْتَرْكَبْ\" }  مُتَّفَقٌ عَلَيْهِ, وَاللَّفْظُ لِمُسْلِمٍ.‏  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 1866 )‏، ومسلم ( 1644 )‏، وهو نفس لفظ البخاري سوى قوله: \"حافية\" .‏ وعندهما قول عقبة: فأمرتني أن أستفتي لها النبي صلى الله عليه وسلم، فاستفتيته.‏","english":{"narrator":"Narrated 'Uqba bin 'Aamir (RA):","text":"His sister took a vow to walk to Allah's House (for pilgrimage) barefooted. Then, she ordered him to consult Allah's Messenger (ﷺ), so he consulted him for a religious verdict and the Prophet (ﷺ) replied, \"Let her walk and ride.\" ."}},{"id":17,"idInBook":17,"chapterId":13,"bookId":17,"arabic":"وَلِلْخَمْسَةِ.‏  1‏ فَقَالَ: { \" إِنَّ اَللَّهَ لَا يَصْنَعُ بِشَقَاءِ أُخْتِكَ شَيْئاً, مُرْهَا: , وَلْتَرْكَبْ, وَلْتَصُمْ ثَلَاثَةَ أَيَّامٍ\" }   2‏ .‏‏1 ‏- كذا \"بالأصلين\" وأشار ناسخ \"أ\" في الهامش إلى نسخة: \"أحمد والأربعة\" .‏‏2 ‏- منكر.‏ رواه أحمد ( 4 / 143 و 145 و 149 )‏ وأبو داود ( 3293 )‏، والنسائي ( 7 / 20 )‏، والترمذي ( 1544 )‏، وابن ماجه ( 2134 )‏.‏ قال الترمذي: \" هذا حديث حسن\" .‏ قلت: بل ضعيف؛ فإن في سنده عبيد الله بن زحر، وهو \"ضعيف.‏ منكر الحديث\" ، وذكر الذهبي في \"الميزان\" هذا الحديث من منكراته.‏","english":{"narrator":"Ahmad and al-Arba'a have:","text":"He said, \"Verily! Allah, the Most High, will not do anything with the affliction your sister imposes on herself. Command her to cover her head and to ride, and to fast three days.\""}},{"id":18,"idInBook":18,"chapterId":13,"bookId":17,"arabic":"وَعَنْ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { اِسْتَفْتَى سَعْدُ بْنُ عُبَادَةَ ‏- رضى الله عنه ‏- رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-فِي نَذْرٍ كَانَ عَلَى أُمِّهِ, تُوُفِّيَتْ قَبْلِ أَنْ تَقْضِيَهُ ? فَقَالَ: \n\"اِقْضِهِ عَنْهَا\" }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- .‏ صحيح.‏ رواه البخاري ( 2761 )‏، ومسلم ( 1638 )‏.‏","english":{"narrator":"Narrated Ibn Abbas (RA):","text":"Sa'd bin Ubada asked Allah's Messenger (ﷺ) for a ruling regarding a vow taken by his mother who had died before fulfilling it, and he said, \"Fulfill it on her behalf.\" ."}},{"id":19,"idInBook":19,"chapterId":13,"bookId":17,"arabic":"وَعَنْ ثَابِتِ بْنِ اَلضَّحَّاكِ ‏- رضى الله عنه ‏- قَالَ: { نَذَرَ رَجُلٌ عَلَى عَهْدِ رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-أَنْ يَنْحَرَ إِبِلاً بِبُوَانَةَ, فَأَتَى رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-فَسَأَلَهُ: فَقَالَ: \"هَلْ كَانَ فِيهَا وَثَنٌ يُعْبَدُ ?\" .‏ قَالَ: لَا.‏ قَالَ: \"فَهَلْ كَانَ فِيهَا عِيدٌ مِنْ أَعْيَادِهِمْ ?\" فَقَالَ: لَا.‏  1‏ فَقَالَ: \"أَوْفِ بِنَذْرِكَ; فَإِنَّهُ لَا وَفَاءَ لِنَذْرٍ فِي مَعْصِيَةِ اَللَّهِ, وَلَا فِي قَطِيعَةِ رَحِمٍ, وَلَا فِيمَا لَا يَمْلِكُ اِبْنُ آدَمَ\" }  رَوَاهُ أَبُو دَاوُدَ, وَالطَّبَرَانِيُّ وَاللَّفْظُ لَهُ, وَهُوَ صَحِيحُ اَلْإِسْنَادِ.‏  2‏‏1 ‏- سقط من \"أ\" : \"فقال: لا\" .‏‏2 ‏- صحيح.‏ رواه أبو داود ( 3313 )‏، والطبراني في \"الكبير\" ( 2 / 57 ‏- 76 / 1341 )‏.‏","english":{"narrator":"Narrated Thabit bin ad-Dahhak (RA):","text":"that in the time of Allah's Messenger (ﷺ) a man took a vow to slaughter camels at Bawana. So, he came to Allah's Messenger (ﷺ) and asked him (about that). Allah's Messenger (ﷺ) asked, \"Did the place contain any idol which was worshiped (during Jahiliyya era)?\" He said, \"No.\" He asked \"Were any of their (Jahiliyya) festivals observed there?\" He said, \"No.\" He then said (to the man), \"Fulfill your vow, for there is no fulfillment of a vow to do an act of disobedience to Allah, now to break the ties of relationship, nor to do something over which a human being has no control.\"\n\n."}},{"id":20,"idInBook":20,"chapterId":13,"bookId":17,"arabic":"وَلَهُ شَاهِدٌ: مِنْ حَدِيثِ كَرْدَمٍ.‏ عِنْدَ أَحْمَدَ  1‏ .‏‏1 ‏- .‏ وهو صحيح أيضا.‏ مسند أحمد ( 3 / 419 )‏.‏","english":{"narrator":"","text":"It has a Shahid (supporting narration) from the Hadith of Kardam reported by Ahmad."}},{"id":21,"idInBook":21,"chapterId":13,"bookId":17,"arabic":"وَعَنْ جَابِرٍ ‏- رضى الله عنه ‏- { أَنَّ رَجُلاً قَالَ يَوْمَ اَلْفَتْحِ: يَا رَسُولَ اَللَّهِ! إِنِّي نَذَرْتُ إِنْ فَتَحَ اَللَّهُ عَلَيْكَ مَكَّةَ أَنْ أُصَلِّيَ فِي بَيْتِ اَلْمَقْدِسِ, فَقَالَ: \"صَلِّ هَا هُنَا\" .‏ فَسَأَلَهُ, فَقَالَ: \"صَلِّ هَا هُنَا\".‏ فَسَأَلَهُ, فَقَالَ: \"شَأْنُكَ إِذًا\" }  رَوَاهُ أَحْمَدُ, أَبُو دَاوُدَ, وَصَحَّحَهُ اَلْحَاكِمُ  1‏ .‏‏1 ‏- صحيح.‏ رواه أحمد ( 3 / 363 )‏، وأبو داود ( 3305 )‏، والحاكم ( 4 / 304 ‏- 305 )‏ بسند على شرط مسلم كما قال الحاكم.‏","english":{"narrator":"Narrated Jabir (bin 'Abdullah) (RA):","text":"A man said on the day of the Fath, \"O Messenger of Allah, I have vowed that if Allah opens the conquest of Makkah at your hands I shall pray in Jerusalem.\" He replied, \"Pray here.\" He asked him again and he replied, \"Pray here.\" He asked him again and he replied, \"It's up to you, then.\"\n\n."}},{"id":22,"idInBook":22,"chapterId":13,"bookId":17,"arabic":"وَعَنْ أَبِي سَعِيدٍ اَلْخُدْرِيِّ ‏- رضى الله عنه ‏- عَنْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { \n\"لَا تُشَدُّ اَلرِّحَالُ إِلَّا إِلَى ثَلَاثَةِ مَسَاجِدَ: مَسْجِد اَلْحَرَامِ, وَمَسْجِدِ اَلْأَقْصَى, وَمَسْجِدِي\" }  مُتَّفَقٌ عَلَيْهِ, وَاللَّفْظُ لِلْبُخَارِيِّ  1‏ .‏‏1 ‏- انظر رقم ( 707 )‏.‏ وفي الأصل كذا: \"الثلاثة\" وفي \"أ\" \"ثلاثة\" وهو الموافق لما في \"الصحيحين\".‏","english":{"narrator":"Narrated Abu Sa'id al-Khudri (RA):","text":"The Prophet (ﷺ) said: \"No (religious) journey is to be undertaken except to (pray in) the three mosques: The Sacred Mosque (Makkah), the Aqsa Mosque (Jerusalem), and this Mosque of mine (al-Madinah).\"\n\n."}},{"id":23,"idInBook":23,"chapterId":13,"bookId":17,"arabic":"وَعَنْ عُمَرَ ‏- رضى الله عنه ‏- قَالَ: { قُلْتُ: يَا رَسُولَ اَللَّهِ! إِنِّي نَذَرْتُ فِي اَلْجَاهِلِيَّةِ; أَنْ أَعْتَكِفَ لَيْلَةً فِي اَلْمَسْجِدِ اَلْحَرَامِ.‏ قَالَ: \n\"فَأَوْفِ بِنَذْرِكَ\" }  مُتَّفَقٌ عَلَيْهِ  1‏ وَزَادَ اَلْبُخَارِيُّ فِي رِوَايَةٍ  2‏ { فَاعْتَكَفَ لَيْلَةً }   3‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 2032 )‏، ومسلم ( 1656 )‏.‏‏2 ‏- ووقع في \"أ\" : \"روايته\".‏‏3 ‏- البخاري ( 2042 )‏.‏","english":{"narrator":"Narrated 'Umar (RA):","text":" He said: I said: O Allah's Messenger (ﷺ), I made a vow in the Jahiliyya times to spend a night in devotion (I'tikaf) in the Sacred Mosque. He (the Prophet) said: \"Fulfill your vow.\"\n\n. al-Bukhari added in another narration: \"Then, spend a night in devotion (in the Sacred Mosque).\""}}],"chapter":{"id":13,"bookId":17,"arabic":"كتاب الأيمان والنذور","english":"Oaths and Vows"}}