{"metadata":{"length":36,"arabic":{"title":"بلوغ المرام","author":"الإمام ابن حجر العسقلاني","introduction":"كتاب القضاء"},"english":{"title":"Bulugh al-Maram","author":"Ibn Hajar al-Asqalani","introduction":"Judgments"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":14,"bookId":17,"arabic":"عَنْ بُرَيْدَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ \n\"اَلْقُضَاةُ ثَلَاثَةٌ: اِثْنَانِ فِي اَلنَّارِ, وَوَاحِدٌ فِي اَلْجَنَّةِ.‏ رَجُلٌ عَرَفَ اَلْحَقَّ, فَقَضَى بِهِ, فَهُوَ فِي اَلْجَنَّةِ.‏ وَرَجُلٌ عَرَفَ اَلْحَقَّ, فَلَمْ يَقْضِ بِهِ, وَجَارَ فِي اَلْحُكْمِ, فَهُوَ فِي اَلنَّارِ.‏ وَرَجُلٌ لَمْ يَعْرِفِ اَلْحَقَّ, فَقَضَى لِلنَّاسِ عَلَى جَهْلٍ, فَهُوَ فِي اَلنَّارِ\" }  رَوَاهُ اَلْأَرْبَعَةُ, وَصَحَّحَهُ اَلْحَاكِمُ  1‏ .‏‏1 ‏- صحيح.‏ رواه أبو داود ( 3573 )‏، والنسائي في \"الكبرى\" ( 3 / 461 ‏- 462 )‏، والترمذي ( 1322 )‏، والحاكم ( 4 / 90 )‏ من طريق عبد الله بن بريدة، عن أبيه، به.‏","english":{"narrator":"Narrated Buraida (RA) Allah's Messenger (ﷺ) said:","text":"\"al-Qudat (judges) are of three types, two of whom will go to Hell and one to Paradise. The one who will go to Paradise is a man who knows what is right and gives judgement accordingly. However, a man who knows what is right, and does not give judgement accordingly and acts unjustly in his judgement, will be in the Hell-fire. Likewise, a man who does not know what is right and judges people with ignorance, will be in the Hell-fire.\"\n\n."}},{"id":2,"idInBook":2,"chapterId":14,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-: { \n\"مَنْ وَلِيَ اَلْقَضَاءَ فَقَدْ ذُبِحَ بِغَيْرِ سِكِّينٍ\" }  رَوَاهُ اَلْخَمْسَةُ  1‏ وَصَحَّحَهُ اِبْنُ خُزَيْمَةَ, وَابْنُ حِبَّانَ  2‏ .‏‏1 ‏- كذا بالأصلين، وأشار ناسخ \"أ\" في الهامش إلى نسخة: \"أحمد والأربعة\" .‏‏2 ‏- صحيح.‏ رواه أبو داود ( 3571 )‏، (3572)‏، والنسائي في \"الكبرى\" (3/462)‏، والترمذي (1325)‏، وابن ماجه ( 2308 )‏، وأحمد ( 2 / 230 و 365 )‏، وانظر \"أخلاق العلماء\" للآجري، فقد فصلت فيه القول هناك.‏","english":{"narrator":"Narrated Abu Hurairah (RA):","text":"Allah's Messenger (ﷺ) said: \"He who has been appointed a Qadi (judge) has been slaughtered without a knife.\"\n\n."}},{"id":3,"idInBook":3,"chapterId":14,"bookId":17,"arabic":"وَعَنْهُ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ \n\"إِنَّكُمْ سَتَحْرِصُونَ عَلَى اَلْإِمَارَةِ, وَسَتَكُونُ نَدَامَةً يَوْمَ اَلْقِيَامَةِ, فَنِعْمَ اَلْمُرْضِعَةُ, وَبِئْسَتِ اَلْفَاطِمَةُ\" }  رَوَاهُ اَلْبُخَارِيُّ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 7148 )‏.‏","english":{"narrator":"Narrated :","text":"Allah's Messenger (ﷺ) said: \"You will eagerly seek out the office of governorship, but it will become a cause of regret on the Day of Resurrection. How excellent it is as a Murdi'ah (wet nurse)! And how evil it is as a Fatimah (one who weans)!\n\n."}},{"id":4,"idInBook":4,"chapterId":14,"bookId":17,"arabic":"وَعَنْ عَمْرِو بْنِ الْعَاصِ ‏- رضى الله عنه ‏- أَنَّهُ سَمِعَ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ: { \n\"إِذَا حَكَمَ اَلْحَاكِمُ, فَاجْتَهَدَ, ثُمَّ أَصَابَ, فَلَهُ أَجْرَانِ.‏ وَإِذَا حَكَمَ, فَاجْتَهَدَ, ثُمَّ أَخْطَأَ, فَلَهُ أَجْرٌ\" }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 7352 )‏، ومسلم ( 1716 )‏.‏","english":{"narrator":"Narrated 'Amr bin al-'Aas (RA):","text":"He heard Allah's Messenger (ﷺ) say, \"When a judge gives a ruling, having tried his best to decide correctly, and is right (in his decision), he will have a double reward; and when he gives a ruling having tried his best to decide correctly, and is wrong (in his decision), he will have a single reward.\"\n\n."}},{"id":5,"idInBook":5,"chapterId":14,"bookId":17,"arabic":"وَعَنْ أَبِي بَكْرَةَ ‏- رضى الله عنه ‏- قَالَ: سَمِعْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ: { \n\" لَا يَحْكُمُ أَحَدٌ بَيْنَ اِثْنَيْنِ, وَهُوَ غَضْبَانُ\" }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 7158 )‏، ومسلم ( 1717 )‏ عن عبد الرحمن بن أبي بكرة قال: كتب أبي ‏- وكتبت له ‏- إلى عبيد الله بن أبي بكرة، وهو قاض بسجستان: أن لا تحكم ( بخاري: لا تقضي )‏ بين اثنين وأنت غضبان، فإني سمعت رسول الله صلى الله عليه وسلم يقول: فذكره.‏ والسياق لمسلم، وللبخاري: \" لا يقضين حكم\" والباقي مثله سواء.‏","english":{"narrator":"Narrated Abu Bakrah (RA):","text":"I heard Allah's Messenger (ﷺ) say, \"No judge should give judgement between two people while he is angry.\"\n\n."}},{"id":6,"idInBook":6,"chapterId":14,"bookId":17,"arabic":"وَعَنْ عَلِيٍّ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ \n\" إِذَا تَقَاضَى إِلَيْكَ رَجُلَانِ, فَلَا تَقْضِ لِلْأَوَّلِ, حَتَّى تَسْمَعَ كَلَامَ اَلْآخَرِ, فَسَوْفَ تَدْرِي كَيْفَ تَقْضِي\" .‏ قَالَ  1‏ .‏ عَلِيٌّ: فَمَا زِلْتُ قَاضِيًا بَعْدُ }  رَوَاهُ أَحْمَدُ, وَأَبُو دَاوُدَ, وَاَلتِّرْمِذِيُّ وَحَسَّنَهُ, وَقَوَّاهُ اِبْنُ اَلْمَدِينِيُّ, وَصَحَّحَهُ اِبْنُ حِبَّانَ  2‏ .‏‏1 ‏- في \"أ\" : \"فقال\".‏‏2 ‏- حسن.‏ رواه أحمد ( 1 / 90 )‏، وأبو داود ( 3582 )‏، و الترمذي ( 1331 )‏ من طريق سماك بن حرب، عن حنش، عن علي، به.‏ واللفظ للترمذي، وقال: \"حديث حسن\" .‏ وعند أحمد: \"ترى\" مكان \"تدري\" .‏ ولأبي داود: \"فإنه أحرى أن يتبين لك القضاء\" وزاد في أوله: \"إن الله سيهدي قلبك، ويثبت لسانك\" .‏ قلت: وللحديث طرق كثيرة، وهي مفصلة بالأصل.‏","english":{"narrator":"Narrated 'Ali (RA):","text":"Allah's Messenger (ﷺ) said: \"When two men bring a case before you, do not decide in favor of the first till you hear what the other has to say, then you  will know how to judge.\" 'Ali (RA) said: \"Since then, I have continued to judge (in accordance with that).\"\n\n"}},{"id":7,"idInBook":7,"chapterId":14,"bookId":17,"arabic":"وَلَهُ شَاهِدٌ عِنْدَ اَلْحَاكِمِ: مِنْ حَدِيثِ اِبْنِ عَبَّاسٍ  1‏ .‏‏1 ‏- وهو ضعيف جدا على أحسن أحواله.‏ رواه الحاكم ( 4 / 89 ‏- 99 )‏.‏ وضعفه الحافظ نفسه، انظر رقم ( 1405 )‏.‏","english":{"narrator":"","text":"It has a Shahid (supporting narration) reported by al-Hakim from the Hadith of Ibn 'Abbas."}},{"id":8,"idInBook":8,"chapterId":14,"bookId":17,"arabic":"وَعَنْ أُمِّ سَلَمَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-: { \n\" إِنَّكُمْ تَخْتَصِمُونَ إِلَيَّ, وَلَعَلَّ بَعْضَكُمْ أَنْ يَكُونَ أَلْحَنَ بِحُجَّتِهِ مِنْ بَعْضٍ, فَأَقْضِيَ لَهُ عَلَى نَحْوٍ مِمَّا أَسْمَعُ, مِنْهُ فَمَنْ قَطَعْتُ لَهُ مِنْ حَقِّ أَخِيهِ شَيْئًا, فَإِنَّمَا أَقْطَعُ لَهُ قِطْعَةً مِنَ اَلنَّارِ\" }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 7169 )‏، ومسلم ( 1713 )‏، وزاد البخاري في أوله: \"إنما أنا بشر\" وهي رواية لمسلم وعنده سبب الحديث، وزاد في رواية أخرى: \"فليحملها، أو يزرها\".‏","english":{"narrator":"Narrated Umm Salamah (RA):","text":"Allah's Messenger (ﷺ) said: \"Indeed, you bring your disputers to me, and perhaps some of you are more eloquent in their plea than others, so that I give judgement on their behalf according to what I hear from them. Therefore, whatever I rule for anyone which by right belongs to his brother, I am only granting him a portion of Hell-fire.\"\n\n."}},{"id":9,"idInBook":9,"chapterId":14,"bookId":17,"arabic":"وَعَنْ جَابِرٍ ‏- رضى الله عنه ‏- : سَمِعْتُ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏- 1‏ يَقُولُ: { \" كَيْفَ تُقَدَّسُ أُمَّةٌ, لَا يُؤْخَذُ مِنْ شَدِيدِهِمْ لِضَعِيفِهِمْ ?\" }  رَوَاهُ اِبْنُ حِبَّانَ  2‏ .‏‏1 ‏- وفي \"أ\" : \"رسول الله\" وأشار الناسخ في الهامش إلى نسخة: \"النبي\" .‏‏2 ‏- صحيح.‏ رواه ابن حبان ( 1554 )‏.‏ تنبيه: هذا الحديث وما بعده من شواهد تصححه، وإن كانت أسانيدها لا تخلو من ضعف، وتفصيل ذلك في \"الأصل\" .‏","english":{"narrator":"Narrated Jabir (RA):","text":"I heard Allah's Messenger (SAW0 saying, \"How could an Ummah (people) be purified (of its sins) where the right of its weak is not taken from its strong.\"\n\n."}},{"id":10,"idInBook":10,"chapterId":14,"bookId":17,"arabic":"وَلَهُ شَاهِدٌ: مِنْ حَدِيثِ بُرَيْدَةَ, عِنْدَ اَلْبَزَّارِ  1‏ .‏‏1 ‏- كشف الأستار ( 1596 )‏ وانظر ما قبله.‏","english":{"narrator":"","text":"It has a Shahid (supporting narration) from the Hadith of Buraida, reported by al-Bazzar."}},{"id":11,"idInBook":11,"chapterId":14,"bookId":17,"arabic":"وَآخَرُ: مِنْ حَدِيثِ أَبِي سَعِيدٍ عِنْدَ اِبْنِ مَاجَه  1‏ .‏‏1 ‏- سنن ابن ماجه ( 4010 )‏ وانظر ما قبله.‏","english":{"narrator":"","text":"And another  from the Hadith of Abu Sa'id, reported by Ibn Majah."}},{"id":12,"idInBook":12,"chapterId":14,"bookId":17,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: سَمِعْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ: { \n\" يُدْعَى بِالْقَاضِي اَلْعَادِلِ يَوْمَ اَلْقِيَامَةِ, فَيَلْقَى مِنْ شِدَّةِ اَلْحِسَابِ مَا يَتَمَنَّى أَنَّهُ لَمْ يَقْضِ بَيْنَ اِثْنَيْنِ فِي عُمْرِهِ\" }  رَوَاهُ اِبْنُ حِبَّانَ  1‏ وَأَخْرَجَهُ اَلْبَيْهَقِيُّ, وَلَفْظُهُ:  { فِي تَمْرَةٍ }   2‏ .‏‏1 ‏- ضعيف.‏ رواه ابن حبان ( 1563 )‏.‏‏2 ‏- وهو كذلك عند أحمد في \"المسند\" ( 6 / 75 )‏.‏","english":{"narrator":"Narrated 'Aishah (RA):","text":"I heard Allah's Messenger (ﷺ) saying, \"the just Qadi (judge) will be called (forth) on the Day of Resurrection and he will wish he had never given judgement even between two men throughout his life, due to the severity of the account he will face.\"\n\n[Reported by Ibn Hibban. al-Baihaqi reported it with the wording: \"...concerning a single tamrah (date fruit)."}},{"id":13,"idInBook":13,"chapterId":14,"bookId":17,"arabic":"وَعَنْ أَبِي بَكْرَةَ ‏- رضى الله عنه ‏- عَنِ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { \n\"لَنْ يُفْلِحَ قَوْمٌ وَلَّوْا أَمْرَهُمْ اِمْرَأَةً\" }  رَوَاهُ اَلْبُخَارِيُّ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 4425 )‏ عن أبي بكرة قال: لقد نفعني الله بكلمة سمعتها من رسول الله صلى الله عليه وسلم أيام الجمل بعدما كدت أن ألحق بأصحاب الجمل، فأقاتل معهم.‏ قال: لما بلغ رسول الله صلى الله عليه وسلم أن أهل فارس قد ملكوا عليهم بنت كسرى.‏ قال: فذكره.‏","english":{"narrator":"Narrated Abu Bakrah (RA):","text":"The Prophet (ﷺ) said: \"A people who make a woman their ruler will never be successful.\"\n\n."}},{"id":14,"idInBook":14,"chapterId":14,"bookId":17,"arabic":"وَعَنْ أَبِي مَرْيَمَ اَلْأَزْدِيِّ ‏- رضى الله عنه ‏- عَنِ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏- { قَالَ: \"مَنْ وَلَّاهُ اَللَّهُ شَيْئًا مِنْ أَمْرِ اَلْمُسْلِمِينَ, فَاحْتَجَبَ عَنْ حَاجَتِهِمْ وَفَقِيرِهِم, اِحْتَجَبَ اَللَّهُ دُونَ حَاجَتِهِ\" }  أَخْرَجَهُ أَبُو دَاوُدَ, وَاَلتِّرْمِذِيُّ  1‏ .‏‏1 ‏- صحيح.‏ رواه أبو داود ( 2948 )‏ بنحوه، والترمذي ( 1333 )‏ ولم يسق لفظه، وإنما أحال على معنى لفظ آخر لنفس الحديث.‏","english":{"narrator":"Narrated Abu Maryam al-Azdi (RA):","text":"The Prophet (ﷺ) said: \"Whoever is placed by Allah over any matter of the affairs of the Muslims, and then conceals himself (i.e. holds back) from dealing with their needs and their poor (people), Allah will conceal Himself (i.e. hold back) from fulfilling his needs.\"\n\n."}},{"id":15,"idInBook":15,"chapterId":14,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: { لَعَنَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-اَلرَّاشِيَ وَالْمُرْتَشِيَ فِي اَلْحُكْمِ }  رَوَاهُ اَلْخَمْسَةُ, وَحَسَّنَهُ اَلتِّرْمِذِيُّ, وَصَحَّحَهُ اِبْنُ حِبَّانَ  1‏ .‏‏1 ‏- ضعيف بهذا اللفظ.‏ رواه الترمذي ( 1336 )‏، وأحمد ( 2 / 387 ‏- 388 )‏، وابن حبان ( 1196 )‏ من طريق عمر بن أبي سلمة، عن أبيه، عن أبي هريرة، به.‏ وقال الترمذي: \"حديث أبي هريرة حديث حسن صحيح، وقد روى هذا الحديث عن أبي سلمة بن عبد الرحمن، عن عبد الله بن عمرو، عن النبي صلى الله عليه وسلم.‏ وروي.‏ عن أبي سلمة، عن أبيه، عن النبي صلى الله عليه وسلم، ولا يصح.‏ وقال: وسمعت عبد الله بن عبد الرحمن ‏- أي: الدارمي ‏- يقول: حديث أبي سلمة، عن عبد الله بن عمرو، عن النبي صلى الله عليه وسلم أحسن شيء في هذا الباب وأصح\" .‏ قلت: وسبب ضعفه عمر بن أبي سلمة فهو متكلم فيه من قبل حفظه هذا أولا.‏ وثانيا: وهم الحافظ رحمه الله في العزو إذ لم يروه من أصحاب السنن إلا الترمذي.‏ وأما حديث ابن عمرو فهو التالي.‏","english":{"narrator":"Narrated Abu Hurairah (RA):","text":"Allah's Messenger (ﷺ) cursed the one who bribes and the one who takes bribes to influence the judgement.\n\n[Reported by Ahmad and al-Arba'a. at-Tirmidhi graded it Hasan (good), and Ibn Hibban graded it Sahih (authentic)."}},{"id":16,"idInBook":16,"chapterId":14,"bookId":17,"arabic":"وَلَهُ شَاهِدٌ: مِنْ حَدِيثِ عَبْدِ اَللَّهِ بنِ عَمْرٍو.‏ عِنْدَ اَلْأَرْبَعَةِ إِلَّا النَّسَائِيَّ  1‏ .‏‏1 ‏- صحيح.‏ رواه أبو داود ( 3580 )‏، والترمذي ( 1337 )‏، وابن ماجه ( 2313 )‏ بلفظ: \" لعن رسول الله صلى الله عليه وسلم الراشي والمرتشي\" .‏ وفي رواية ابن ماجه: \" لعنة الله على.‏ .‏.‏\" والباقي مثله.‏ وقال الترمذي: \"حديث حسن صحيح\".‏","english":{"narrator":"","text":"It has a Shahid (supporting narration) from 'Abdullah bin 'Amr's Hadith, reported by al-Arba'a except an-Nasa'i]."}},{"id":17,"idInBook":17,"chapterId":14,"bookId":17,"arabic":"وَعَنْ عَبْدِ اَللَّهِ بنِ اَلزُّبَيْرِ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { قَضَى رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-أَنَّ اَلْخَصْمَيْنِ يَقْعُدَانِ بَيْنَ يَدَيِ اَلْحَاكِمِ }  رَوَاهُ أَبُو دَاوُدَ, وَصَحَّحَهُ اَلْحَاكِمُ  1‏ .‏‏1 ‏- ضعيف.‏ رواه أبو داود ( 3588 )‏، والحاكم ( 4 / 94 )‏، وفي سنده مصعب بن ثابت كان كثير الغلط، وقال الحافظ في \"التقريب\" : \"لين الحديث\".‏","english":{"narrator":"Narrated 'Abdullah bin az-Zubair (RA):","text":"Allah's Messenger (ﷺ) ruled that the two opposing parties in a dispute should sit in front of the judge.\n\n."}},{"id":18,"idInBook":18,"chapterId":14,"bookId":17,"arabic":"عَنْ زَيْدِ بْنِ خَالِدٍ اَلْجُهَنِيِّ ‏- رضى الله عنه ‏- أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَالَ: { \n\"أَلَا أُخْبِرُكُمْ بِخَيْرِ اَلشُّهَدَاءِ? اَلَّذِي يَأْتِي بِشَهَادَتِهِ قَبْلَ أَنْ يُسْأَلَهَا\" }  رَوَاهُ مُسْلِم ٌ  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم ( 1719 )‏.‏","english":{"narrator":"Narrated Zaid bin Khaled al-Juhani (RA):","text":"The Prophet (ﷺ) said: \"Shall I not inform you who is the best witness? He is the one who produces his testimony before he is asked for it.\"\n\n."}},{"id":19,"idInBook":19,"chapterId":14,"bookId":17,"arabic":"وَعَنْ عِمْرَانَ بْنِ حُصَيْنٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ \n\"إِنَّ خَيْرَكُمْ قَرْنِي, ثُمَّ اَلَّذِينَ يَلُونَهُمْ, ثُمَّ اَلَّذِينَ يَلُونَهُمْ, ثُمَّ يَكُونُ قَوْمٌ يَشْهَدُونَ وَلَا يُسْتَشْهَدُونَ, وَيَخُونُونَ وَلَا يُؤْتَمَنُونَ, وَيَنْذُرُونَ وَلَا يُوفُونَ, وَيَظْهَرُ فِيهِمْ اَلسِّمَنُ\" }  مُتَّفَقٌ عَلَيْه ِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 2651 )‏، ومسلم ( 2535 )‏.‏","english":{"narrator":"Narrated 'Imran bin Husain (RA):","text":"Allah's Messenger (ﷺ) said: \"Verily! The best of you (i.e. Muslims) are my generation, then their immediate followers, then their immediate followers. After them there will be people who will give (false) testimony without being asked (to testify), who will be treacherous and are not to be trusted, who will make vows and will not fulfill them, among whom obesity will appear.\"\n\n."}},{"id":20,"idInBook":20,"chapterId":14,"bookId":17,"arabic":"وَعَنْ عَبْدِ اَللَّهِ بْنِ عَمْرٍو رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ \n\"لَا تَجُوزُ شَهَادَةُ خَائِنٍ, وَلَا خَائِنَةٍ, وَلَا ذِي غِمْرٍ عَلَى أَخِيهِ, وَلَا تَجُوزُ شَهَادَةُ اَلْقَانِعِ لِأَهْلِ اَلْبَيْتِ\" }  رَوَاهُ أَحْمَدُ, وَأَبُو دَاوُدَ .‏  1‏ .‏‏1 ‏- حسن.‏ رواه أحمد ( 2 / 204 و 225 ‏- 226 )‏، وأبو داود ( 3600 )‏ من طريق عمرو بن شعيب، عن أبيه، عن جده.‏ واللفظ لأحمد، وزاد: \"وتجوز شهادته لغيرهم\" والقانع: الذي ينفع عليه أهل البيت.‏ وفي رواية أبي داود، وأحمد الثانية: \"رد شهادة الخائن والخائنة، وذي الغمر على أخيه، ورد شهادة القانع لأهل البيت، وأجازها على غيرهم\" .‏ وقال أبو داود: الغمر: الحنة والشحناء ( وفي نسخة: الحق والبغضاء )‏.‏ والقانع: الأجير التابع مثل الأجير الخاص.‏","english":{"narrator":"Narrated 'Abdullah bin 'Amr (RA):","text":"Allah's Messenger (ﷺ) said: \"It is not permissible to accept the testimony of a man or a woman who does not  fulfill their trusts, or of one who harbors a grudge against his brother, or the testimony of one who is dependent on a family (to testify) for members of the family.\"\n\n."}},{"id":21,"idInBook":21,"chapterId":14,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- أَنَّهُ سَمِعَ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { \n\"لَا تَجُوزُ شَهَادَةُ بَدَوِيٍّ عَلَى صَاحِبِ قَرْيَةٍ\" }  رَوَاهُ أَبُو دَاوُدَ, وَابْنُ مَاجَه ْ  1‏ .‏‏1 ‏- صحيح.‏ رواه أبو داود ( 3602 )‏، وابن ماجه ( 2367 )‏.‏","english":{"narrator":"Narrated Abu Hurairah (RA):","text":"He heard Allah's Messenger (ﷺ) say. \"The testimony of a bedouin against a city dweller is not permissible.\"\n\n."}},{"id":22,"idInBook":22,"chapterId":14,"bookId":17,"arabic":"وَعَنْ عُمَرَ بْنِ اَلْخَطَّابِ ‏- رضى الله عنه ‏- { أَنَّهُ خَطَبَ فَقَالَ: إِنَّ أُنَاسً ا  1‏ كَانُوا يُؤْخَذُونَ بِالْوَحْيِ فِي عَهْدِ رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-وَإِنَّ اَلْوَحْيَ قَدْ اِنْقَطَعَ, وَإِنَّمَا نَأْخُذُكُم ْ  2‏ اَلْآنَ بِمَا ظَهَرَ لَنَا مِنْ أَعْمَالِكُمْ }  رَوَاهُ اَلْبُخَارِيّ ُ  3‏ .‏‏1 ‏- ووقع في \"أ\" : \"ناسا\" وما في \"الأصل\" هو الموافق لما في \"الصحيح\".‏‏2 ‏- ووقع في \"أ\" : \"نؤاخذكم\" وما في \"الأصل\" هو الموافق لما في \"الصحيح\" .‏‏3 ‏- صحيح.‏ رواه البخاري ( 2641 )‏، وزاد: \"فمن أظهر لنا خيرا أمناه وقربناه، وليس إلينا من سريرته شيء؛ الله يحاسب سريرته.‏ ومن أظهر لنا سوءا لم نأمنه ولم نصدقه، وإن قال: إن سريرته حسنة\" .‏","english":{"narrator":"Narrated 'Umar bin al-Khattab (RA):","text":"He addressed the people and said, \"People were sometimes judged by the revealing of a Divine Revelation during the lifetime of Allah's Messenger (ﷺ), but now the Divine Revelation has been discontinued . Now we judge you by the deeds you practice publicly.\"\n\n."}},{"id":23,"idInBook":23,"chapterId":14,"bookId":17,"arabic":"وَعَنْ أَبِي بَكْرَةَ ‏- رضى الله عنه ‏- { عَنِ النَّبِيِّ ‏- صلى الله عليه وسلم ‏-أَنَّهُ عَدَّ شَهَادَةَ اَلزُّورِ فِ ي  1‏ أَكْبَرِ اَلْكَبَائِرِ }  مُتَّفَقٌ عَلَيْهِ فِي حَدِيث ٍ  2‏ .‏‏1 ‏- ووقع في \"أ\" : \"من\" .‏‏2 ‏- صحيح.‏ رواه البخاري ( 2654 )‏، ومسلم ( 87 )‏ ولفظه: قال صلى الله عليه وسلم: \"ألا أنبئكم بأكبر الكبائر؟ ( ثلاثا )‏ الإشراك بالله.‏ وعقوق الوالدين.‏ وشهادة الزور ( أو قول الزور )‏\" وكان رسول الله صلى الله عليه وسلم متكئا فجلس.‏ فما زال يكررها حتى قلنا: ليته سكت.‏ والسياق لمسلم.‏","english":{"narrator":"Narrated Abu Bakra (RA):","text":"The Prophet (ﷺ) considered Shahadah az-Zur (giving false testimony) among the most serious of major sins.\n\n."}},{"id":24,"idInBook":24,"chapterId":14,"bookId":17,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا; { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَالَ لِرَجُلٍ: \"تَرَى اَلشَّمْسَ ?\" قَالَ: نَعَمْ.‏ قَالَ: \"عَلَى مِثْلِهَا فَاشْهَدْ, أَوْ دَعْ\" }  أَخْرَجَهُ اِبْنُ عَدِيٍّ بِإِسْنَادٍ ضَعِيفٍ, وَصَحَّحَهُ اَلْحَاكِمُ فَأَخْطَأ َ  1‏ .‏‏1 ‏- الكامل لابن عدى ( 6 / 2213 )‏ وهو على أحسن أحواله ضعيف جدا كما تقدم ( 1389 )‏.‏","english":{"narrator":"Narrated Ibn 'Abbas (RA):","text":"The Prophet (ﷺ) said to a man, \"Do you see the sun?\" He replied, \"Yes.\" He said, \"Give witness in a similar case , or leave it.\"\n\n."}},{"id":25,"idInBook":25,"chapterId":14,"bookId":17,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا; { أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَضَى بِيَمِينٍ وَشَاهِدٍ }  أَخْرَجَهُ مُسْلِمٌ.‏ وَأَبُو دَاوُدَ.‏ وَالنَّسَائِيُّ وَقَالَ: إِسْنَادُ  جَيِّد ٌ  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم ( 1712 )‏، وأبو داود ( 3608 )‏، والنسائي في \"الكبرى\" ( 3 / 490 )‏ من طريق قيس بن سعد، عن عمرو بن دينار، عن ابن عباس؛ به.‏ وقد أعل الحديث بما لا يقدح كما هو مبين في \"الأصل\" .‏","english":{"narrator":"Narrated Ibn 'Abbas (RA):","text":"Allah's Messenger (ﷺ) ruled on the basis of an oath and a single witness.\n\n."}},{"id":26,"idInBook":26,"chapterId":14,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- مِثْلَهُ.‏ أَخْرَجَهُ أَبُو دَاوُدَ, وَاَلتِّرْمِذِيُّ, وَصَحَّحَهُ اِبْنُ حِبَّان َ  1‏ .‏‏1 ‏- صحيح.‏ رواه أبو داود ( 3610 و 3611 )‏، والترمذي ( 1343 )‏، وأيضا رواه ابن ماجه ( 2368 )‏، وصححه ابن الجارود ( 1007 )‏ كلهم من طريق سهيل بن أبي صالح، عن أبيه، عن أبي هريرة؛ أن رسول الله صلى الله عليه وسلم قضى باليمين مع الشاهد الواحد.‏","english":{"narrator":"Narrated Aby Hurairah (RA):","text":"Something similar to the aforesaid Hadith.\n\n."}},{"id":27,"idInBook":27,"chapterId":14,"bookId":17,"arabic":"عَنِ ابْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا; أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَالَ: { \"لَوْ يُعْطَى اَلنَّاسُ بِدَعْوَاهُمْ, لَادَّعَى نَاسٌ دِمَاءَ رِجَالٍ, وَأَمْوَالَهُمْ, وَلَكِنِ اَلْيَمِينُ عَلَى اَلْمُدَّعَى عَلَيْهِ\" }  مُتَّفَقٌ عَلَيْه ِ  1‏ وَلِلْبَيْهَقِيِّ بِإِسْنَادٍ صَحِيحٍ: { \"اَلْبَيِّنَةُ عَلَى اَلْمُدَّعِي, وَالْيَمِينُ عَلَى مَنْ أَنْكَرَ }   2‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 4552 )‏، ومسلم ( 1711 )‏ والسياق لمسلم، وفيه عند البخاري قصة.‏‏2 ‏- صحيح.‏ رواه البيهقي ( 10 / 252 )‏ وهو قطعة من الحديث السابق، وله شواهد عن غير ابن عباس.‏","english":{"narrator":"Narrated Ibn 'Abbas (RA):","text":"The Prophet (ﷺ) said: \"If people were given whatever they claimed (in disputes), some people would claim the lives and wealth of others; but the oath (of denial) must be taken by the defendant.\"\n\n. al-Baihaqi has reported with a Sahih (authentic) chain of narrators: \"But the proof (Bayyinah) lies on the one who is making the claim, and the other (Yamin) must be taken by the one who rejects the claim.\""}},{"id":28,"idInBook":28,"chapterId":14,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-عَرَضَ عَلَى قَوْمٍ اَلْيَمِينَ, فَأَسْرَعُوا, فَأَمَرَ أَنْ يُسْهَمَ بَيْنَهُمْ فِي اَلْيَمِينِ, أَيُّهُمْ يَحْلِفُ }  رَوَاهُ اَلْبُخَارِيّ ُ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 2674 )‏.‏","english":{"narrator":"Narrated Abu Hurairah (RA):","text":"The Prophet (ﷺ) suggested to some people that they should take an oath (Yamin) and when they hastened to do so he ordered that lots should be cast among them concerning the oath, as to which of them should take it.\n\n."}},{"id":29,"idInBook":29,"chapterId":14,"bookId":17,"arabic":"وَعَنْ أَبِي أُمَامَةَ اَلْحَارِثِيُّ ‏- رضى الله عنه ‏- أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { \" مَنْ اِقْتَطَعَ حَقَّ امْرِئٍ مُسْلِمٍ بِيَمِينِهِ, فَقَدْ أَوْجَبَ اَللَّهُ لَهُ اَلنَّارَ, وَحَرَّمَ عَلَيْهِ اَلْجَنَّةَ\" .‏ فَقَالَ لَهُ رَجُلٌ: وَإِنْ كَانَ شَيْئًا يَسِيرًا يَا رَسُولَ اَللَّهِ? قَالَ: \"وَإِنْ قَضِيبٌ مِنْ أَرَاكٍ\" }  رَوَاهُ مُسْلِم ٌ  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم ( 137 )‏، وعنده: \"وإن قضيبا\" .‏","english":{"narrator":"Narrated Abu Umamah al-Harithi (RA):","text":"Allah's Messenger (ﷺ) said. \"If anyone seized - by his oath - what rightly belongs to a Muslim, Allah has made the Hell-fire compulsory for him and forbidden for him the Paradise.\" A man asked, \"O Allah's Messenger, even if it were something insignificant?\" He replied, \"Even if it were a stick from an Arak tree.\"\n\n."}},{"id":30,"idInBook":30,"chapterId":14,"bookId":17,"arabic":"وَعَنِ الْأَشْعَثِ بْنِ قَيْسٍ ‏- رضى الله عنه ‏- أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { \"مَنْ حَلَفَ عَلَى يَمِينٍ, يَقْتَطِعُ بِهَا مَالَ امْرِئٍ مُسْلِمٍ, هُوَ فِيهَا فَاجِرٌ, لَقِيَ اَللَّهَ وَهُوَ عَلَيْهِ غَضْبَانُ }  مُتَّفَقٌ عَلَيْه ِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 5 / 33 / فتح )‏، ومسلم ( 138 )‏.‏","english":{"narrator":"Narrated al-Ash'ath bin Qais (RA):","text":"Allah's Messenger (ﷺ) said: \"If anyone swears a firm oath - knowingly, intentionally, taking by it property belonging to a Muslim, Allah will be angry with him when he meets Him (on the Day of Resurrection).\"\n\n."}},{"id":31,"idInBook":31,"chapterId":14,"bookId":17,"arabic":"وَعَنْ أَبَى مُوسَى  ‏- رضى الله عنه ‏- { أَنَّ رَجُلَيْنِ اِخْتَصَمَا إِلَى رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-فِي دَابَّةٍ, لَيْسَ لِوَاحِدٍ مِنْهُمَا بَيِّنَةٌ, فَقَضَى بِهَا رَسُولُ اَللَّهِ > 1‏  2‏ .‏ بَيْنَهُمَا نِصْفَيْنِ }  رَوَاهُ أَحْمَدُ, وَأَبُو دَاوُدَ, وَالنَّسَائِيُّ وَهَذَا لَفْظُهُ, وَقَالَ: إِسْنَادُهُ جَيِّد ٌ  3‏ .‏‏1 ‏- سقط قوله: \"رسول الله صلى الله عليه وسلم\" من \"أ\" .‏‏2 ‏- سقط قوله: \"رسول الله صلى الله عليه وسلم\" من \"أ\" .‏‏3 ‏- ضعيف.‏ رواه أحمد ( 4 / 402 )‏، وأبو داود ( 3613 ‏- 3615 )‏، والنسائي في \"الكبرى\" ( 3 / 487 )‏، وقد بين الحافظ نفسه علله في \"التلخيص\" ( 4 / 209 ‏- 210 )‏.‏","english":{"narrator":"Narrated Abu Musa (RA):","text":"Two men had a disputer over an animal, and neither of them had a proof. So Allah's Messenger (ﷺ) gave a ruling that it be divided in halves between them.\n\n."}},{"id":32,"idInBook":32,"chapterId":14,"bookId":17,"arabic":"وَعَنْ جَابِرٍ ‏- رضى الله عنه ‏- أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَالَ: { \n\"مَنْ حَلَفَ عَلَى مِنْبَرِي هَذَا بِيَمِينٍ آثِمَةٍ, تَبَوَّأَ مَقْعَدَهُ مِنْ اَلنَّارِ\" }  رَوَاهُ أَحْمَدُ, وَأَبُو دَاوُدَ, وَالنَّسَائِيُّ, وَصَحَّحَهُ اِبْنُ حِبَّان َ  1‏ .‏‏1 ‏- صحيح.‏ رواه أحمد ( 3 / 344 )‏، وأبو داود ( 3246 )‏، والنسائي في \"الكبرى\" ( 3 / 491 )‏، وابن حبان ( 1192 )‏ من طريق هاشم بن هاشم، عن عبد الله بن نسطاس، عن جابر، به.‏ واللفظ للنسائي، وابن حبان، وزاد أبو داود: \"ولو على سواك أخضر\" بعد قوله: \"آثمة\" وفي آخره على الشك: \"أو وجبت له النار\" .‏ قلت: وهذا إسناد فيه ضعف، فابن نسطاس، وإن وثقه النسائي، فقد قال الذهبي في \"الميزان\" ( 2 / 515 )‏: \" لا يعرف.‏ تفرد عنه هاشم بن هاشم\".‏ ولكن للحديث شاهد صحيح عن أبي هريرة.‏","english":{"narrator":"Narrated Jabir (RA):","text":"The Prophet (ﷺ) said: \"If anyone swears a false oath on this Minbar of mine, he will have prepared his seat in the Hell-Fire.\"\n\n."}},{"id":33,"idInBook":33,"chapterId":14,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ \n\"ثَلَاثَةٌ لَا يُكَلِّمُهُمْ اَللَّهُ يَوْمَ اَلْقِيَامَةِ, وَلَا يَنْظُرُ إِلَيْهِمْ, وَلَا يُزَكِّيهِمْ, وَلَهُمْ عَذَابٌ أَلِيمٌ: رَجُلٌ عَلَى فَضْلِ مَاءٍ بِالْفَلَاةِ, يَمْنَعُهُ مِنْ اِبْنِ اَلسَّبِيلِ; وَرَجُلٌ بَايَعَ رَجُلاً بِسِلْعَةٍ بَعْدَ اَلْعَصْرِ, فَحَلَفَ لَهُ بِاَللَّهِ: لَأَخَذَهَا بِكَذَا وَكَذَا, فَصَدَّقَهُ, وَهُوَ عَلَى غَيْرِ ذَلِكَ; وَرَجُلٌ بَايَعَ إِمَامًا لَا يُبَايِعُهُ إِلَّا لِلدُّنْيَا, فَإِنْ أَعْطَاهُ مِنْهَا, وَفَى, وَإِنْ لَمْ يُعْطِهِ مِنْهَا, لَمْ يَفِ\" }  مُتَّفَقٌ عَلَيْه ِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 7212 )‏، ومسلم ( 108 )‏ والسياق لمسلم.‏","english":{"narrator":"Narrated Abu Hurairah (RA):","text":"Allah's Messenger (ﷺ) said: \"There are three to whom Allah will not speak to on the Day of Resurrection, not will He look at them, nor will He purify them, and they will have a painful punishment. (1) A man at a place with excess water in the desert and who withholds it from the travelers. (2) A man who sold a commodity to another person in the afternoon (or after the 'Asr prayer) and swore to him by Allah that he had bought it at such and such price and he (the buyer) believed him yet that was not the case. (3) And a man who pledged allegiance to an Imam only for the sake of the world (material gains). Hence, if the Imam bestowed on him something out of that (i.e. worldly riches) he stood by his pledge of allegiance, and if he did not give him, he did not fulfill the pledge of allegiance.\"\n\n."}},{"id":34,"idInBook":34,"chapterId":14,"bookId":17,"arabic":"وَعَنْ جَابِرٍ ‏- رضى الله عنه ‏- { أَنَّ رَجُلَيْنِ اِخْتَصَمَا فِي نَاقَةٍ, فَقَالَ كُلُّ وَاحِدٍ مِنْهُمَ ا  1‏ نُتِجَتْ عِنْدِي, وَأَقَامَا بَيِّنَةً, فَقَضَى بِهَا رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-لِمَنْ هِيَ فِي يَدِهِ }   2‏ .‏‏1 ‏- وقع في \"أ\": فقال كل منهما.‏‏2 ‏- ضعيف.‏ رواه الدارقطني ( 4 / 209 )‏ وقال الحافظ في \"التلخيص\" ( 4 / 210 )‏: \"إسناده ضعيف\".‏","english":{"narrator":"Narrated Jabir (RA):","text":"Two men disputed about a she-camel. Then, each of them said: this she-camel was born at my place, and each of them brought a proof (that it was his animal). Allah's Messenger (ﷺ) then ruled that it be taken by the one who had it in his possession."}},{"id":35,"idInBook":35,"chapterId":14,"bookId":17,"arabic":"وَعَنِ ابْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا; { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-رَدَّ اَلْيَمِينَ عَلَى طَالِبِ اَلْحَقِّ }  رَوَاهُمَا اَلدَّارَقُطْنِيُّ, وَفِي إِسْنَادِهِمَا ضَعْف ٌ  1‏ .‏‏1 ‏- ضعيف.‏ رواه الدارقطني ( 4 / 213 )‏.‏ وقال الذهبي في \"التلخيص\" متعقبا الحاكم ( 4 / 100 )‏: \"أخشى أن يكون الحديث باطلا\" .‏","english":{"narrator":"Narrated Ibn 'Umar (RA):","text":"The Prophet (ﷺ) re-directed al-Yamin (the oath to be sword by the defendant) to the one making the claim to some right.\n\n."}},{"id":36,"idInBook":36,"chapterId":14,"bookId":17,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا { قَالَتْ: دَخَلَ عَلَِيَّ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-ذَاتَ يَوْمٍ مَسْرُورًا, تَبْرُقُ أَسَارِيرُ وَجْهِهِ.‏ فَقَالَ: \"أَلَمْ تَرَيْ إِلَى مُجَزِّزٍ اَلْمُدْلِجِيِّ ? نَظَرَ آنِفًا إِلَى زَيْدِ بْنِ حَارِثَةَ, وَأُسَامَةَ بْنِ زَيْدٍ, فَقَالَ: \" هَذِهِ أَقْدَامٌ بَعْضُهَا مِنْ بَعْضٍ\" }  مُتَّفَقٌ عَلَيْه ِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 6770 )‏، ومسلم ( 1459 )‏.‏","english":{"narrator":"Narrated 'Aishah (RA):","text":"One day the Prophet (ﷺ) came to me overjoyed, his face shining (from happiness) and said, \"Did you not see that Mujazziz al-Mudliji (a physiognomist) looked at Zaid bin Harithah and Usama bin Zaid, and then said, 'These feet (of Zaid and Usama) are related to one another.'\"\n\n."}}],"chapter":{"id":14,"bookId":17,"arabic":"كتاب القضاء","english":"Judgments"}}