{"metadata":{"length":20,"arabic":{"title":"بلوغ المرام","author":"الإمام ابن حجر العسقلاني","introduction":"كتاب العتق"},"english":{"title":"Bulugh al-Maram","author":"Ibn Hajar al-Asqalani","introduction":"Emancipation"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":15,"bookId":17,"arabic":"عَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ \n\"أَيُّمَا امْرِئٍ مُسْلِمٍ أَعْتَقَ اِمْرَأً مُسْلِماً, اِسْتَنْقَذ َ  1‏ اَللَّهُ بِكُلِّ عُضْوٍ مِنْهُ عُضْوًا مِنْهُ مِنَ النَّارِ\" }  مُتَّفَقٌ عَلَيْهِ .‏  2‏ .‏‏1 ‏- تحرف في \"أ\" إلى: \"استنقذه\" .‏‏2 ‏- صحيح.‏ رواه البخاري ( 2517 )‏، ومسلم ( 1509 )‏ ( 24 )‏ وفيه قصة.‏","english":{"narrator":"Abu Hurairah (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"“Any Muslim, who emancipates another Muslim man, Allah will set free from Hell Fire an organ of his body, for every organ of the other’s (i.e. from the body of the emancipated person ).” Agreed upon."}},{"id":2,"idInBook":2,"chapterId":15,"bookId":17,"arabic":"وَلِلتِّرْمِذِيِّ وَصَحَّحَهُ; عَنْ أَبِي أُمَامَةَ: { \n\"وَأَيُّمَا امْرِئٍ مُسْلِمٍ أَعْتَقَ اِمْرَأَتَيْنِ مُسْلِمَتَيْنِ, كَانَتَا فِكَاكَهُ مِنَ النَّارِ\" }   1‏ .‏‏1 ‏- صحيح.‏ رواه الترمذي ( 1547 )‏ وفيه: \"وأيما امرأة مسلمة أعتقت امرأة مسلمة، كانت فكاكها من النار.‏ يجزيء كل عضو منها عضوا منها\" وقال: \"حسن صحيح\" .‏ ثم قال: \"وفي الحديث ما يدل على أن عتق الذكور للرجال أفضل من عتق الإناث\" وانظر ما بعده.‏","english":{"narrator":"At-Tirmidhi transmitted on the authority of Abu Umamah (RAA), “The Messenger of Allah (ﷺ) said:","text":"“Any Muslim man, who emancipates two Muslim women, they will be his release from Hell Fire.” At-Tirmidhi graded it as Sahih."}},{"id":3,"idInBook":3,"chapterId":15,"bookId":17,"arabic":"وَلِأَبِي دَاوُدَ: مِنْ حَدِيثِ كَعْبِ بْنِ مُرَّةَ: { \"وَأَيُّمَا اِمْرَأَةٍ أَعْتَقَتْ اِمْرَأَةً مُسْلِمَةً, كَانَتْ فِكَاكَهَا مِنْ اَلنَّارِ }   1‏ .‏‏1 ‏- صحيح.‏ رواه أبو داود ( 3967 )‏، وله شواهد، أحدها الحديث السابق.‏","english":{"narrator":"Abu Dawud transmitted on the authority of Ka’b bin Murrah (RAA), “The Messenger of Allah (ﷺ) said:","text":"“Any Muslim woman, who emancipates another Muslim woman, she will be her release from Hell Fire.”"}},{"id":4,"idInBook":4,"chapterId":15,"bookId":17,"arabic":"وَعَنْ أَبِي ذَرٍّ ‏- رضى الله عنه ‏- { قَالَ: سَأَلْتُ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-أَيُّ اَلْعَمَلِ أَفْضَلُ? قَالَ: \"إِيمَانٌ بِاَللَّهِ, وَجِهَادٌ فِي سَبِيلِهِ\" .‏ قُلْتُ: فَأَيُّ اَلرِّقَابِ أَفْضَلُ? قَالَ: \" أَعْلَاهَ ا  1‏ ثَمَنًا, وَأَنْفَسُهَا عِنْدَ أَهْلِهَا\" }  مُتَّفَقٌ عَلَيْهِ\" .‏  2‏ .‏‏1 ‏- تحرف في \"أ\" إلى \"أغلاها\" بالغين المعجمة، والصواب أنه بالمهملة كما في \"الأصل\" و \"صحيح \"البخاري ، وأما مسلم فوقع عنده: \"أكثرها ثمنا\" .‏‏2 ‏- صحيح.‏ رواه البخاري ( 2518 )‏، ومسلم ( 84 )‏.‏ واللفظ للبخاري، وزادا، والسياق للبخاري أيضا: \"قلت: فإن لم أفعل؟ قال: تعين ضائعا، أو تصنع لأخرق.‏ قال: فإن لم أفعل؟ قال: تدع الناس من الشر؛ فإنها صدقة تصدق بها على نفسك.‏","english":{"narrator":"","text":"Abu Dharr (RAA) narrated, I asked the Messenger of Allah (ﷺ) ‘Which action is the most excellent?’ He replied, “Faith in Allah and Jihad in His Cause.” I then asked, ‘Which slaves are the most excellent (for the purpose of emancipating them)’ and he replied, “Those whose prices are the highest and are the most valuable to their owners.” Agreed upon."}},{"id":5,"idInBook":5,"chapterId":15,"bookId":17,"arabic":"وَعَنِ ابْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ \n\"مَنْ أَعْتَقَ شِرْكًا لَهُ فِي عَبْدٍ, فَكَانَ لَهُ مَالٌ يَبْلُغُ ثَمَنَ اَلْعَبْدِ, قُوِّمَ قِيمَةَ عَدْلٍ, فَأَعْطَى شُرَكَاءَهُ حِصَصَهُمْ, وَعَتَقَ عَلَيْهِ اَلْعَبْدُ, وَإِلَّا فَقَدْ عَتَقَ مِنْهُ مَا عَتَقَ\" }  مُتَّفَقٌ عَلَيْه ِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 2522 )‏، ومسلم ( 1501 )‏.‏ و\" شركا\" : نصيبا.‏","english":{"narrator":"Ibn 'Umar (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"“Anyone who emancipates his share in a slave and has enough money to pay the full price for him, a fair price for the slave should be fixed. His partners should be given their shares, and the slave should thus be emancipated. Otherwise he is emancipated only to the extent of the first man’s share.” Agreed upon,"}},{"id":6,"idInBook":6,"chapterId":15,"bookId":17,"arabic":"وَلَهُمَا: عَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- { \n\"وَإِلَّا قُوِّمَ عَلَيْهِ, وَاسْتُسْعِيَ غَيْرَ مَشْقُوقٍ عَلَيْهِ\" }   1‏ .‏ وَقِيلَ: إِنَّ اَلسِّعَايَةَ مُدْرَجَةٌ فِي اَلْخَبَر ِ  2‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 2527 )‏، ومسلم ( 1503 )‏ وأوله: \"من أعتق نصيبا ‏- أو شقيصا ‏- في مملوك، فخلاصه عليه في ماله إن كان له مال، وإلا.‏ .‏.‏.‏\" .‏‏2 ‏- بل هي ثابتة في الحديث، وقد أجاد الحافظ نفسه ‏- رحمه الله ‏- في إثبات ذلك، انظر \"الفتح\" ( 5 / 157 )‏ وما بعدها.‏","english":{"narrator":"Abu Hurairah (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"“Otherwise his value will be estimated and he will be required to work to pay for his freedom, but he must not be overburdened.” Agreed upon.\n\nAnd it has been said that the requirement to work was Mudraj (words of the narrator lumped into the narration)."}},{"id":7,"idInBook":7,"chapterId":15,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ \n\" لَا يَجْزِي وَلَدٌ وَالِدَهُ, إِلَّا أَنْ يَجِدَهُ مَمْلُوكًا فَيُعْتِقَهُ\" }  رَوَاهُ مُسْلِم ٌ  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم ( 1510 )‏ وزاد: \"فيشتريه\" بعد قوله: \"مملوكا\" .‏","english":{"narrator":"","text":"Abu Hurairah (RAA), narrated that The Messenger of Allah said, “A son cannot ever repay his parents what he owes them, unless he finds them in slavery, then buys them and emancipates them.” Related by Muslim."}},{"id":8,"idInBook":8,"chapterId":15,"bookId":17,"arabic":"وَعَنْ سَمُرَةَ ‏- رضى الله عنه ‏- أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَالَ: { \n\"مَنْ مَلَكَ ذَا رَحِمٍ مَحْرَمٍ, فَهُوَ حُرٌّ\" }  رَوَاهُ أَحْمَدُ, وَالْأَرْبَعَة ُ  1‏ .‏ وَرَجَّحَ جَمْعٌ مِنَ الْحُفَّاظِ أَنَّهُ مَوْقُوف ٌ  2‏ .‏‏1 ‏- صحيح.‏ رواه أحمد ( 5 / 15 و 20 )‏، وأبو داود ( 3949 )‏، والترمذي ( 1365 )‏، والنسائي في \"الكبرى\" كما في \"التحفة\" ، وابن ماجه ( 2524 )‏ من طريق الحسن، عن سمرة.‏ وله شاهد من حديث ابن عمر بإسناد صحيح.‏ رواه ابن ماجه ( 2525 )‏، وابن الجارود ( 972 )‏.‏‏2 ‏- وأيضا رجح جمع من الحفاظ أنه مرفوع، منهم: ابن الجارود، والحاكم، وابن حزم، وعبد الحق، وابن القطان.‏ وقال عبد الحق في \"الأحكام\" كما في نصب الراية ( 3 / 279 )‏: \"الحديث صحيح.‏ .‏.‏ ولا يضره إرسال من أرسله، ولا وقف من وقفه\" .‏","english":{"narrator":"Samurah bin Jundub (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"“Whoever obtains possession of a relative, who is next of kin, that person becomes free.” Related by Ahmad and the four Imams. Some scholars are of the opinion that it is Mawquf (not connected to the Prophet.)"}},{"id":9,"idInBook":9,"chapterId":15,"bookId":17,"arabic":"وَعَنْ عِمْرَانَ بْنِ حُصَيْنٍ رَضِيَ اَللَّهُ عَنْهُمَا; { أَنَّ رَجُلاً أَعْتَقَ سِتَّةً مَمْلُوكِينَ لَهُ, عِنْدَ مَوْتِهِ, لَمْ يَكُنْ لَهُ مَالٌ غَيْرَهُمْ, فَدَعَا بِهِمْ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-فَجَزَّأَهُمْ أَثْلَاثًا, ثُمَّ أَقْرَعَ بَيْنَهُمْ, فَأَعْتَقَ اِثْنَيْنِ, وَأَرَقَّ أَرْبَعَةً, وَقَالَ لَهُ قَوْلاً شَدِيدًا }  رَوَاهُ مُسْلِم ٌ  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم ( 1668 )‏.‏","english":{"narrator":"","text":"’Imran bin Husain (RAA) narrated, ‘A man who had no other property emancipated six of his slaves at the time of his death. Allah’s Messenger (ﷺ)sent for them, and after dividing them into three groups, he cast lots among them, set two of them free and kept four in slavery, and spoke very harshly to the man (who emancipated them).’ Related by Muslim."}},{"id":10,"idInBook":10,"chapterId":15,"bookId":17,"arabic":"وَعَنْ سَفِينَةَ ‏- رضى الله عنه ‏- { قَالَ: كُنْتُ مَمْلُوكًا لِأُمِّ سَلَمَةَ فَقَالَتْ: أُعْتِقُكَ, وَأَشْتَرِطُ عَلَيْكَ أَنْ تَخْدِمَ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-مَا عِشْتَ }  رَوَاهُ أَحْمَدُ, وَأَبُو دَاوُدَ, وَالنَّسَائِيُّ, وَالْحَاكِم ُ  1‏ .‏‏1 ‏- حسن.‏ رواه أحمد ( 5 / 221 )‏، وأبو داود ( 3932 )‏، والنسائي في \"الكبرى\" ( 3 / 190 ‏- 191 )‏، والحاكم ( 2 / 213 ‏- 214 )‏ من طريق سعيد بن جمهان ‏- وهو حسن الحديث ‏- عن سفينة، به.‏ وزادوا إلا أحمد: \"قال: قلت: لو أنك لم تشترطي علي ما فارقت رسول الله صلى الله عليه وسلم ما عشت.‏ قال: فأعتقتني، واشترطت علي أن أخدم رسول الله صلى الله عليه وسلم ما عشت\" .‏","english":{"narrator":"","text":"Safinah (RAA) narrated, ‘I was a slave of Umm Salamah and she said, ‘I shall emancipate you, but on the condition that you serve Allah’s Messenger (ﷺ) as long as you live.’ Related by Ahmad, Abu Dawud, An-Nasa’i and Al-Hakim."}},{"id":11,"idInBook":11,"chapterId":15,"bookId":17,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا; أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { \n\"إِنَّمَا اَلْوَلَاءُ لِمَنْ أَعْتَقَ\" }  مُتَّفَقٌ عَلَيْهِ فِي حَدِيث ٍ  1‏ .‏‏1 ‏- تقدم برقم ( 790 )‏.‏","english":{"narrator":"'A’ishah (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"“Wala’ is (legally) for the manumitter.” Agreed upon. It is part of a long Hadith (refer to hadith no. 811)."}},{"id":12,"idInBook":12,"chapterId":15,"bookId":17,"arabic":"وَعَنِ ابْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ \" اَلْوَلَاءُ لُحْمَةٌ كَلُحْمَةِ اَلنَّسَبِ, لَا يُبَاعُ وَلَا يُوهَبُ\" }  رَوَاهُ اَلشَّافِعِيُّ, وَصَحَّحَهُ اِبْنُ حِبَّانَ, وَالْحَاكِم ُ  1‏ وَأَصْلُهُ فِي \"اَلصَّحِيحَيْنِ\" بِغَيْرِ هَذَا اَللَّفْظ ِ  2‏ .‏‏1 ‏- تقدم تخريجه رقم ( 956 )‏.‏‏2 ‏- تقدم برقم ( 796 )‏.‏","english":{"narrator":"Ibn 'Umar (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"“The Wala’ (of a manumitted slave) is considered as one’s lineage, not to be sold or donated (refer to hadith no. 984).” Related by Ash-Shafi’i. Ibn Hibban and Al-Hakim graded it as Sahih. It is also related by Al-Bukhari and Muslim with different wording"}},{"id":13,"idInBook":13,"chapterId":15,"bookId":17,"arabic":"عَنْ جَابِرٍ ‏- رضى الله عنه ‏- { أَنَّ رَجُلًا مِنْ اَلْأَنْصَارِ أَعْتَقَ غُلَامًا لَهُ عَنْ دُبُرٍ, لَمْ يَكُنْ لَهُ مَالٌ غَيْرُهُ, فَبَلَغَ ذَلِكَ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-.‏ فَقَالَ: \"مَنْ يَشْتَرِيهِ مِنِّي?\" فَاشْتَرَاهُ نُعَيْمُ بْنُ عَبْدِ اَللَّهِ بِثَمَانِمَائَةِ دِرْهَمٍ }  مُتَّفَقٌ عَلَيْه ِ  1‏ .‏ وَفِي لَفْظٍ لِلْبُخَارِيِّ: فَاحْتَاج َ  2‏ وَفِي رِوَايَةٍ لِلنَّسَائِيِّ: { وَكَانَ عَلَيْهِ دَيْنٌ, فَبَاعَهُ بِثَمَانِمَائَةِ دِرْهَمٍ, فَأَعْطَاهُ وَقَالَ: \" اِقْضِ دَيْنَكَ\" }   3‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 6716 )‏، ومسلم ( 997 )‏ وزاد مسلم: \"فجاء بها رسول الله صلى الله عليه وسلم، فدفعها إليه.‏ ثم قال: ابدأ بنفسك فتصدق عليها، فإن فضل شيء فلأهلك، فإن فضل عن أهلك شيء فلذي قرابتك، فإن فضل عن ذي قرابتك شيء فهكذا وهكذا.‏ يقول: فبين يديك وعن يمينك وعن شمالك\".‏‏2 ‏- البخاري ( 2141 )‏ والمراد بالذي احتاج، هو الأنصاري.‏ ووقع عند النسائي: \"وكان محتاجا\" .‏‏3 ‏- صحيح.‏ رواه النسائي ( 8 / 246 )‏، وزاد: وأنفق على عيالك\".‏","english":{"narrator":"Jabir bin ·Abdullah (RAA) narrated that A man from the Ansar declared that his slave lad would be free after his death (would be Mudabbar), yet he had no other property. When the Prophet heard of that he said, “Who will buy him from me?” And Nu'aim bin 'Abdullah bought him for eight hundred Dirhams. Agreed upon. In a narration by Al-Bukhari:","text":"“The man became needy,’ (so the Prophet took the slave and said...).’ A version by An-Nasa’i says, “The man had a debt, so the Prophet sold the slave for eight hundred Dirhams and gave him the money and said, “Pay off your debt.”"}},{"id":14,"idInBook":14,"chapterId":15,"bookId":17,"arabic":"وَعَنْ عَمْرِو بْنِ شُعَيْبٍ, عَنْ أَبِيهِ, عَنْ جَدِّهِ, عَنْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-{ قَالَ: \n\" اَلْمُكَاتَبُ عَبْدٌ مَا بَقِيَ عَلَيْهِ مِنْ مُكَاتَبَتِهِ دِرْهَمٌ\" }  أَخْرَجَهُ أَبُو دَاوُدَ بِإِسْنَادٍ حَسَن ٍ  1‏ وَأَصْلُهُ عِنْدَ أَحْمَدَ, وَالثَّلَاثَةِ, وَصَحَّحَهُ اَلْحَاكِم ُ  2‏ .‏‏1 ‏- حسن.‏ رواه أبو داود ( 3926 )‏.‏‏2 ‏- حسن.‏ رواه أحمد ( 2 / 178 و 206 و 209 )‏، وأبو داود ( 3927 )‏، والنسائي في \"الكبرى\" ( 3 / 197 )‏، والترمذي ( 1260 )‏، وابن ماجه ( 2519 )‏، والحاكم ( 2 / 218 )‏ من طريق عمرو بن شعيب أيضا، به.‏ ولفظه كما عند أبي داود: \"أيما عبد كاتب على مئة أوقية فأداها إلا عشرة أواق فهو عبد.‏ وأيما عبد كاتب على مئة دينار فأداها إلا عشرة دنانير فهو عبد\" .‏","english":{"narrator":"'Amro bin Shu’aib narrated on the authority of his father, on the authority of his grandfather (RAA), That the Messenger of Allah (ﷺ) said:","text":"“A slave who entered into an agreement to buy his freedom is still a slave as long as a Dirham of the agreed price remains to be paid.” Related by Abu Dawud with a good chain of narrators. The full hadith is related by Ahmad and the three Imams. Al-Hakim graded it to be Sahih."}},{"id":15,"idInBook":15,"chapterId":15,"bookId":17,"arabic":"وَعَنْ أَُمِّ سَلَمَةَ ‏-رَضِيَ اَللَّهُ عَنْهَا‏- قَالَتْ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِذَا كَانَ لِإِحْدَاكُنَّ مُكَاتَبٌ, وَكَانَ عِنْدَهُ مَا يُؤَدِّي, فَلْتَحْتَجِبْ مِنْهُ }  رَوَاهُ اَلْخَمْسَة ُ  1‏ وَصَحَّحَهُ اَلتِّرْمِذِيّ ُ  2‏ .‏‏1 ‏- وقع في\" أ\":\"رواه أحمد والأربعة\".‏‏2 ‏- ضعيف.‏ رواه أحمد (6 / 289 و 308 و 311)‏، وأبو داود (3928)‏، والنسائي في\" الكبرى\" (3 / 198)‏، والترمذي (1261)‏، وابن ماجه (2520)‏ من طريق نبهان مولى أم سلمة، عنها به، ونبهان مجهول كما قال غير واحد، وقال الشافعي:\" لم أرى من رضيت من أهل العلم يثبت حديث نبهان هذا\".‏","english":{"narrator":"Umm Salamah (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"“When a slave of one of your women has made an agreement to pay for his freedom (i.e. he is a Mukatib) and can pay the full price, she must veil herself from him.” Related by Ahmad and the four Imams. At-Tirmidhi graded it as Sahih."}},{"id":16,"idInBook":16,"chapterId":15,"bookId":17,"arabic":"وَعَنْ اِبْنِ عَبَّاسٍ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَالَ: { يُودَى اَلْمُكَاتَبُ بِقَدْرِ مَا عَتَقَ مِنْهُ دِيَةَ اَلْحُرِّ, وَبِقَدْرِ مَا رَقَّ مِنْهُ دِيَةَ اَلْعَبْدِ }  رَوَاهُ أَحْمَدُ, وَأَبُو دَاوُدَ, وَالنَّسَائِيّ ُ  1‏ .‏‏1 ‏- صحيح.‏ رواه أحمد (1 / 222‏- 223 و 226 و 260)‏، وأبو داود (4581)‏، والنسائي (8 / 46)‏ واللفظ لأحمد.‏","english":{"narrator":"Ibn ’Abbas (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"“The Diyah (Blood money) of a slave who had made an agreement to buy his freedom (Mukatib) and had been killed, is paid at the rate paid for a free man (as a Diyah) as much as he has paid of the amount agreed upon, and at the rate paid for a slave as the remainder is concerned.” Related by Ahmad, Abu Dawud and Au-Nasa’i."}},{"id":17,"idInBook":17,"chapterId":15,"bookId":17,"arabic":"وَعَنْ عَمْرِو بْنِ اَلْحَارِثِ‏- أَخِي جُوَيْرِيَةَ أُمِّ اَلْمُؤْمِنِينَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: { مَا تَرَكَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-عِنْدَ مَوْتِهِ دِرْهَمًا, وَلَا دِينَارًا, وَلَا عَبْدًا, وَلَا أَمَةً, وَلَا شَيْئًا, إِلَّا بَغْلَتَهُ اَلْبَيْضَاءَ, وَسِلَاحَهُ, وَأَرْضًا جَعَلَهَا صَدَقَةً }  رَوَاهُ اَلْبُخَارِيّ ُ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (2739)‏.‏","english":{"narrator":"","text":"’Amro bin al-Harith, the brother of Juwairiyah the mother of Believers (the wife of the Prophet (ﷺ)) narrated, ‘When Allah’s Messenger (ﷺ) died, he did not leave a Dinar or a Dirham, a slave or a slave-woman, or anything but his white she-mule, his weapons and a piece of land which he appointed as Sadaqah.’ Related by Al-Bukhari."}},{"id":18,"idInBook":18,"chapterId":15,"bookId":17,"arabic":"وَعَنْ اِبْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ أَيُّمَا أَمَةٍ وَلَدَتْ مِنْ سَيِّدِهَا, فَهِيَ حُرَّةٌ بَعْدَ مَوْتِهِ }  أَخْرَجَهُ اِبْنُ مَاجَهْ, وَالْحَاكِمُ بِإِسْنَادٍ ضَعِيف ٍ  1‏ .‏‏1 ‏- ضعيف .‏ رواه ابن ماجه (2515)‏، والحاكم (2 / 19)‏.‏","english":{"narrator":"Ibn ’Abbas (RAA) narrated that Allah’s Messenger (ﷺ) said:","text":"“When a man’s slave-woman bears him a child she becomes free at his death.” Related by Ibn Majah and Al-Hakim with a weak chain of narrators."}},{"id":19,"idInBook":19,"chapterId":15,"bookId":17,"arabic":"وَرَجَّحَ جَمَاعَةٌ وَقْفَهُ عَلَى عُمَرَ > 1‏  2‏ .‏‏1 ‏- وهو الصواب، فقد رواه البيهقي في\" الكبرى\" (10 / 346)‏ بسند صحيح عن عمر ‏-رضي الله عنه‏- قال:\" إذا ولدت أم الولد من سيدها، فقد عتقت وإن كان سقطا\".‏ وقد ضعف الحافظ في\" التلخيص\" (4 / 217)‏ المرفوع، وصحح الموقوف.‏‏2 ‏- وهو الصواب، فقد رواه البيهقي في\" الكبرى\" (10 / 346)‏ بسند صحيح عن عمر ‏-رضي الله عنه‏- قال:\" إذا ولدت أم الولد من سيدها، فقد عتقت وإن كان سقطا\".‏ وقد ضعف الحافظ في\" التلخيص\" (4 / 217)‏ المرفوع، وصحح الموقوف.‏","english":{"narrator":"","text":"A group of Hadith scholars held that the stronger view is that it is Mawquf (a saying of a Companion) i.e. 'Umar (ra)."}},{"id":20,"idInBook":20,"chapterId":15,"bookId":17,"arabic":"وَعَنْ سَهْلِ بْنِ حُنَيْفٍ ‏- رضى الله عنه ‏- أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { مَنْ أَعَانَ مُجَاهِدًا فِي سَبِيلِ اَللَّهِ, أَوْ غَارِمًا فِي عُسْرَتِهِ, أَوْ مُكَاتَبًا فِي رَقَبَتِهِ, أَظَلَّهُ اَللَّهُ يَوْمَ لَا ظِلَّ إِلَّا ظِلُّهُ }  رَوَاهُ أَحْمَدُ, وَصَحَّحَهُ اَلْحَاكِم ُ  1‏ .‏‏1 ‏- ضعيف.‏ رواه أحمد (3 / 487)‏، والحاكم (2 / 89‏- 90 و 217)‏ وفي سنده عبد الله بن سهل بن حنيف، وهو مجهول.‏","english":{"narrator":"Sahl bin Hunaif (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“He who assists a Mujahid for Allah’s sake, a debtor who is in distress (being unable to pay his debt) or a slave who had made an agreement to buy his freedom, Allah will shade him, with His Shade, on the Day when there will be no shade but His.” Related by Ahmad and Al- Hakim graded it as Sahih."}}],"chapter":{"id":15,"bookId":17,"arabic":"كتاب العتق","english":"Emancipation"}}