{"metadata":{"length":133,"arabic":{"title":"بلوغ المرام","author":"الإمام ابن حجر العسقلاني","introduction":"كتاب الجامع"},"english":{"title":"Bulugh al-Maram","author":"Ibn Hajar al-Asqalani","introduction":"The Comprehensive Book"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":16,"bookId":17,"arabic":"عَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ حَقُّ اَلْمُسْلِمِ عَلَى اَلْمُسْلِمِ سِتٌّ: إِذَا لَقِيتَهُ فَسَلِّمْ عَلَيْهِ, وَإِذَا دَعَاكَ فَأَجِبْهُ, وَإِذَا اِسْتَنْصَحَكَ فَانْصَحْهُ, وَإِذَا عَطَسَ فَحَمِدَ اَللَّهَ فَسَمِّتْهُ  1‏ وَإِذَا مَرِضَ فَعُدْهُ, وَإِذَا مَاتَ فَاتْبَعْهُ }  رَوَاهُ مُسْلِمٌ  2‏ .‏‏1 ‏- كذا في\" الأصل\" بالسين المهملة، وهي كذلك في\" الصحيح\"، ووقع في\" أ\":\" فشمته\" بالشين المعجمة.‏‏2 ‏- صحيح.‏ رواه مسلم (2162)‏ (5)‏، و\"التسميت\" بالسين المهملة، وأيضا بالمعجمة لغتان مشهورتان، وهو أن يقول للعاطس: يرحمك الله.‏ يعني: بعد قول العاطس: الحمد لله.‏","english":{"narrator":"Abu Hurairah (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“A Muslim has six duties towards other Muslims: When you meet him, you should salute him; when he invites you, accept his invitation; when he asks for your advice, give it to him; when he sneezes and praises Allah, say May Allah have mercy on you; when he is ill, visit him; and when he dies follow his funeral.” Related by Muslim."}},{"id":2,"idInBook":2,"chapterId":16,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ انْظُرُوا إِلَى مَنْ هُوَ أَسْفَلَ مِنْكُمْ, وَلَا تَنْظُرُوا إِلَى مَنْ هُوَ فَوْقَكُمْ, فَهُوَ أَجْدَرُ أَنْ لَا تَزْدَرُوا نِعْمَةَ اَللَّهِ عَلَيْكُمْ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ وهذا اللفظ رواية لمسلم (2963)‏ (9)‏، وأما اللفظ المتفق عليه، فهو قوله ‏-صلى الله عليه وسلم‏-:\" إذا نظر أحدكم إلى من فضل عليه في المال والخلق، فلينظر إلى من هو أسفل منه ممن فضل عليه\".‏ رواه البخاري (6490)‏، ومسلم (2963)‏ (8)‏ ولشرح الحديث انظر كتابي\" ذم الدنيا\" ص (17‏- 18)‏.‏","english":{"narrator":"Abu Hurairah (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“Look at those who are lower than you (financially) but do not look at those who are higher than you, lest you belittle the favors Allah conferred upon you.” Agreed upon."}},{"id":3,"idInBook":3,"chapterId":16,"bookId":17,"arabic":"وَعَنْ اَلنَوَّاسِ بْنِ سَمْعَانَ ‏- رضى الله عنه ‏- قَالَ: سَأَلْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-عَنْ اَلْبِرِّ وَالْإِثْمِ? فَقَالَ: { اَلْبِرُّ: حُسْنُ اَلْخُلُقِِ, وَالْإِثْمُ: مَا حَاكَ فِي صَدْرِكَ, وَكَرِهْتَ أَنْ يَطَّلِعَ عَلَيْهِ اَلنَّاسُ }  أَخْرَجَهُ مُسْلِمٌ  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم (2553)‏.‏","english":{"narrator":"","text":"An-Nawwas bin Sam'an (RAA) narrated, ‘I asked the Messenger of Allah (ﷺ) about virtue and sin and he replied, “The essence of virtue is (manifested in) good morals (Akhlaq) whereas sinful conduct is that which turns in your heart (making you feel uncomfortable) and you dislike that it would be disclosed to other people.” Related by Muslim."}},{"id":4,"idInBook":4,"chapterId":16,"bookId":17,"arabic":"وَعَنْ اِبْنِ مَسْعُودٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِذَا كُنْتُمْ ثَلَاثَةً, فَلَا يَتَنَاجَى اِثْنَانِ دُونَ اَلْآخَرِ, حَتَّى تَخْتَلِطُوا بِالنَّاسِ; مِنْ أَجْلِ أَنَّ ذَلِكَ يُحْزِنُهُ }  مُتَّفَقٌ عَلَيْهِ, وَاللَّفْظُ لِمُسْلِمٍ.‏  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (6290)‏، ومسلم (2184)‏، وليس عند مسلم لفظ\" ذلك\".‏","english":{"narrator":"Ibn Mas’ud (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“When three of you get together in company, two of you must not talk privately while isolating the third, so as not to make him feel sad (that he is left out) till you mingle with other people (i.e. you are joined by others).” Agreed upon and the wording is from Muslim."}},{"id":5,"idInBook":5,"chapterId":16,"bookId":17,"arabic":"وَعَنْ اِبْنِ عُمَرَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا يُقِيمُ اَلرَّجُلُ اَلرَّجُلَ مِنْ مَجْلِسِهِ, ثُمَّ يَجْلِسُ فِيهِ, وَلَكِنْ تَفَسَّحُوا, وَتَوَسَّعُوا }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (6270)‏، ومسلم (2177)‏ (28)‏ واللفظ لمسلم.‏","english":{"narrator":"Ibn Umar (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“A man should not ask another man to get up from his place in order to take his seat. But you should make room for each other and spread out.” Agreed upon."}},{"id":6,"idInBook":6,"chapterId":16,"bookId":17,"arabic":"وَعَنْ اِبْنِ عَبَّاسٍ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِذَا أَكَلَ أَحَدُكُمْ طَعَامًا, فَلَا يَمْسَحْ يَدَهُ, حَتَّى يَلْعَقَهَا, أَوْ يُلْعِقَهَا }  مُتَّفَقٌ عَلَيْهِ.‏  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (5456)‏، ومسلم (2031)‏، وهو عند البخاري بدون لفظ: \"طعاما\" وفي رواية أخرى لمسلم\" من الطعام\".‏","english":{"narrator":"Ibn Abbas (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“When one of you eats, he must not wipe his hand till he licks it, or gives it to someone else to lick (such as a wife, husband, etc.).” Agreed upon."}},{"id":7,"idInBook":7,"chapterId":16,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ:  رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لِيُسَلِّمْ اَلصَّغِيرُ عَلَى اَلْكَبِيرِ, وَالْمَارُّ عَلَى اَلْقَاعِدِ, وَالْقَلِيلُ عَلَى اَلْكَثِيرِ }  مُتَّفَقٌ عَلَيْهِ.‏  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (6231 و 6234)‏، واللفظ الذي عزاه الحافظ للمتفق عليه إنما هو للبخاري، إذ ليس عند مسلم تسليم الصغير على الكبير، وانظر التعليق التالي.‏","english":{"narrator":"Abu Hurairah (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“The young should salute the old, the one who is passing by should salute the one who is sitting, and the small group of people should salute the larger one.” Agreed upon."}},{"id":8,"idInBook":8,"chapterId":16,"bookId":17,"arabic":"وَفِي رِوَايَةٍ لِمُسْلِمٍ: { وَالرَّاكِبُ عَلَى اَلْمَاشِي }   1‏ .‏‏1 ‏- هذا الرواية التي عزاها الحافظ لمسلم (2160)‏ هي ‏-أيضا‏- للبخاري (6232 و 6233)‏، تمامه عنهما:\"والماشي على القاعد، والقليل على الكثير\"، فكان الأجدر بالحافظ ‏-رحمه الله‏- عزو الرواية الأولى للبخاري، والثانية للمتفق عليه.‏","english":{"narrator":"","text":"In a version by Muslim, “And the one who is riding should salute the one who is walking.”"}},{"id":9,"idInBook":9,"chapterId":16,"bookId":17,"arabic":"وَعَنْ عَلِيٍّ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ يُجْزِئُ عَنْ اَلْجَمَاعَةِ إِذَا مَرُّوا أَنْ يُسَلِّمَ أَحَدُهُمْ, وَيُجْزِئُ عَنْ اَلْجَمَاعَةِ أَنْ يَرُدَّ أَحَدُهُمْ }  رَوَاهُ أَحْمَدُ, وَالْبَيْهَقِيُّ  1‏ .‏‏1 ‏- حسن بشواهده رواه أبو داود (5210)‏، والبيهقي (9 / 49)‏.‏","english":{"narrator":"Ali (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“When a group of people passes by, it is sufficient if one of them gives a salutation, and it is sufficient for those who are sitting that one of them replies.” Related by Ahmad and Al-Baihaqi."}},{"id":10,"idInBook":10,"chapterId":16,"bookId":17,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا تَبْدَؤُوا اَلْيَهُودَ وَالنَّصَارَى بِالسَّلَامِ, وَإِذَا لَقَيْتُمُوهُمْ فِي طَرِيقٍ, فَاضْطَرُّوهُمْ إِلَى أَضْيَقِهِ }  أَخْرَجَهُ مُسْلِمٌ.‏  1‏ .‏‏1 ‏- تقدم برقم (1310)‏، وقوله:\" عنه\" لا شك أن المراد به\" علي بن أبي طالب\" وذلك حسب ما يقتضيه السياق، وهو خطأ؛ لأن الحديث حديث أبي هريرة، وليس حديث علي، كما أن الأحاديث التالية تدل على صحة ذلك؛ إذا هي من رواية أبي هريرة ‏-رضي الله عنه‏-.‏","english":{"narrator":"Abu Hurairah (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“Do not initiate the saluting of Jews and Christians (when you meet them), and if you meet any of them on the road, force him to go to the narrowest part of the road (i.e. do not give way for them to pass, but keep going). Related by Muslim."}},{"id":11,"idInBook":11,"chapterId":16,"bookId":17,"arabic":"وَعَنْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { إِذَا عَطَسَ أَحَدُكُمْ فَلْيَقُلْ: اَلْحَمْدُ لِلَّهِ, وَلْيَقُلْ لَهُ أَخُوهُ يَرْحَمُكَ اَللَّهُ, فَإِذَا قَالَ لَهُ: يَرْحَمُكَ اَللَّهُ, فَلْيَقُلْ: يَهْدِيكُمُ اَللَّهُ, وَيُصْلِحُ بَالَكُمْ }  أَخْرَجَهُ اَلْبُخَارِيُّ.‏  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (6224)‏.‏","english":{"narrator":"Abu Hurairah (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“When one of you sneezes, he should say, ‘Alhamdulillah (Praise is to Allah) and his (Muslim) brother should say to him, ‘Yarhamuka Allah (May Allah have mercy on you). When he says this to him (the last phrase), he should reply, ‘Yahdikum Allah (May Allah guide you) and grant you well being.” Related by Al-Bukhari."}},{"id":12,"idInBook":12,"chapterId":16,"bookId":17,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا يَشْرَبَنَّ أَحَدٌ مِنْكُمْ قَائِمًا }  أَخْرَجَهُ مُسْلِمٌ.‏  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم (2026)‏ وتمامه ‏-وهي زيادة منكرة ‏-:\" فمن نسي فليستقىء\" وانظر\" الضعيفة\" (926)‏.‏","english":{"narrator":"Abu Hurairah (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“None of you should drink while standing.” Related by Muslim."}},{"id":13,"idInBook":13,"chapterId":16,"bookId":17,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِذَا اِنْتَعَلَ أَحَدُكُمْ فَلْيَبْدَأْ بِالْيَمِينِ, وَإِذَا نَزَعَ فَلْيَبْدَأْ بِالشِّمَالِ, وَلْتَكُنْ اَلْيُمْنَى أَوَّلَهُمَا تُنْعَلُ, وَآخِرَهُمَا تُنْزَعُ }   1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (5856)‏، ومسلم (2097)‏ واللفظ للبخاري.‏","english":{"narrator":"Abu Hurairah (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“When one of you puts on his shoes, he should put on the right one first and when he takes them off, he should take off the left one first, so that the right one should be the first to be put on and the last to be taken off.” Agreed upon."}},{"id":14,"idInBook":14,"chapterId":16,"bookId":17,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا يَمْشِ أَحَدُكُمْ فِي نَعْلٍ وَاحِدَةٍ, وَلْيُنْعِلْهُمَا جَمِيعًا, أَوْ لِيَخْلَعْهُمَا جَمِيعًا }  مُتَّفَقٌ عَلَيْهِمَا.‏  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (5855)‏، ومسلم (2097)‏ (68)‏.‏","english":{"narrator":"Abu Hurairah (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“None of you should walk with one shoe, but should either wear them both or take them both off” Agreed upon."}},{"id":15,"idInBook":15,"chapterId":16,"bookId":17,"arabic":"وَعَنْ اِبْنِ عُمَرَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا يَنْظُرُ اَللَّهُ إِلَى مَنْ جَرَّ ثَوْبَهُ خُيَلَاءَ }  مُتَّفَقٌ عَلَيْهِ.‏  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (5783)‏، ومسلم (2085)‏ (42)‏.‏","english":{"narrator":"Ibn Umar (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“Allah will not look on the Day of Judgment at him who lets his garment drag on the ground out of pride and arrogance.” Agreed upon."}},{"id":16,"idInBook":16,"chapterId":16,"bookId":17,"arabic":"وَعَنْهُ أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { إِذَا أَكَلَ أَحَدُكُمْ فَلْيَأْكُلْ بِيَمِينِهِ, وَإِذَا شَرِبَ فَلْيَشْرَبْ بِيَمِينِهِ, فَإِنَّ اَلشَّيْطَانَ يَأْكُلُ بِشِمَالِهِ, وَيَشْرَبُ بِشِمَالِهِ }  أَخْرَجَهُ مُسْلِمٌ.‏  1‏‏1 ‏- صحيح.‏ رواه مسلم (2020)‏.‏","english":{"narrator":"Ibn Umar narrated that the Messenger of Allah (ﷺ) said:","text":"“When one of you eats he should eat with his right hand, and when he drinks he should drink with his right hand, for the devil eats and drinks with his left hand.” Related by Muslim."}},{"id":17,"idInBook":17,"chapterId":16,"bookId":17,"arabic":"وَعَنْ عَمْرِو بْنِ شُعَيْبٍ, عَنْ أَبِيهِ, عَنْ جَدِّهِ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ كُلْ, وَاشْرَبْ, وَالْبَسْ, وَتَصَدَّقْ فِي غَيْرِ سَرَفٍ, وَلَا مَخِيلَةٍ }  أَخْرَجَهُ أَبُو دَاوُدَ, وَأَحْمَدُ, وَعَلَّقَهُ اَلْبُخَارِيُّ.‏  1‏ .‏‏1 ‏- حسن.‏ رواه الطيالسي (2261)‏، وأحمد (6695 و 6708)‏، وعلقه البخاري (10 / 252 / فتح)‏، ولكنه عندهما بلفظ الجمع.‏ وعند أحمد زيادة:\" إن الله يحب أن ترى نعمته على عبده\"، وهي ‏-أيضا‏- للطيالسي إلا أن عنده:\" يرى أثر\"، والباقي مثله، ولكن الحديث عنده دون الاستثناء، وروى الترمذي الزيادة فقط (2819)‏، وقال:\" حديث حسن\"، ورواه النسائي (5 / 79)‏، وابن ماجه (3605)‏ بدون الزيادة، وأخيرا: من هذا التخريج يعلم أن عزوه لأبي داود وهم من الحافظ ‏-رحمه الله‏- ، إلا أن يكون الحافظ أراد أبا داود الطيالسي، فإني رأيته في\" الفتح\" عزاه للطيالسي دون السجستاني، وأيضا الحديث عندهم جميعا بصيغة الجمع لا المفرد كما قال الحافظ.‏","english":{"narrator":"Amro bin Shu’aib narrated on the authority of his father, on the authority of his grandfather (RAA), that the Messenger of Allah (ﷺ) said:","text":"“Eat, drink, wear clothes and give sadaqah but with neither extravagance nor pride.” Related by Abu Dawud and Ahmad."}},{"id":18,"idInBook":18,"chapterId":16,"bookId":17,"arabic":"عَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ أََحَبَّ أَنْ يُبْسَطَ عَلَيْهِ فِي رِزْقِهِ, وَأَنْ يُنْسَأَ لَهُ فِي أَثَرِهِ, فَلْيَصِلْ رَحِمَهُ }  أَخْرَجَهُ اَلْبُخَارِيُّ.‏  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (5985)‏ وعنده:\" من سره أن يبسط له\" بدلا\" من أحب أن يبسط عليه\".‏","english":{"narrator":"Abu Hurairah (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“He who wishes to have his earnings grow (and be blessed) and his term of life prolonged, he should keep ties with his kin” Related by Al-Bukhari."}},{"id":19,"idInBook":19,"chapterId":16,"bookId":17,"arabic":"وَعَنْ جُبَيْرِ بْنِ مُطْعِمٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا يَدْخُلُ اَلْجَنَّةَ قَاطِعٌ }  يَعْنِي: قَاطِعَ رَحِمٍ.‏ مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (5984)‏، ومسلم (2556)‏ والتفسير من سفيان بن عيينة، وهو لمسلم دون البخاري.‏","english":{"narrator":"Jubair bin Mut'am (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“The one who severs the ties of kinship will not enter Paradise.” Agreed upon."}},{"id":20,"idInBook":20,"chapterId":16,"bookId":17,"arabic":"وَعَنْ اَلْمُغِيرَةِ بْنِ سَعِيدٍ ‏- رضى الله عنه ‏- عَنْ رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { إِنَّ اَللَّهَ حَرَّمَ عَلَيْكُمْ عُقُوقَ اَلْأُمَّهَاتِ, وَوَأْدَ اَلْبَنَاتِ, وَمَنْعًا وَهَاتِ, وَكَرِهَ لَكُمْ قِيلَ وَقَالَ, وَكَثْرَةَ اَلسُّؤَالِ وَإِضَاعَةَ اَلْمَالِ }  مُتَّفَقٌ عَلَيْهِ.‏  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (5975)‏، ومسلم (ج 3 / ص 1341 / رقم 593)‏.‏","english":{"narrator":"Al-Mughirah bin Shu'bah (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“Allah has made it prohibited for you to be disrespectful (showing undutiful behavior) to your mothers, to bury your daughters alive, to refuse others (their dues), and to demand things from others (which are not worth demanding), and He hates that you engage in gossip, asking many questions about people’s affairs and wasting wealth.” Agreed upon."}},{"id":21,"idInBook":21,"chapterId":16,"bookId":17,"arabic":"وَعَنْ عَبْدِ اَللَّهِ بْنِ عُمَرَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏-, عَنْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { رِضَا اَللَّهِ فِي رِضَا اَلْوَالِدَيْنِ, وَسَخَطُ اَللَّهِ فِي سَخَطِ اَلْوَالِدَيْنِ }  أَخْرَجَهُ اَلتِّرْمِذِيُّ, وَصَحَّحَهُ اِبْنُ حِبَّانَ وَالْحَاكِمُ.‏  1‏ .‏‏1 ‏- حسن.‏ رواه الترمذي (1900)‏، وابن حبان (2026 وموارد)‏ والحاكم (4 / 151‏- 152)‏ وأعله الترمذي بما لا يقدح.‏","english":{"narrator":"'Abdullah bin 'Amro bin al-As (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“Allah’s pleasure results from the parent’s pleasure, and Allah’s displeasure results from the parent’s displeasure.” Related by At-Tirmidhi. Ibn Hibban and al-Hakim graded it as Sahih."}},{"id":22,"idInBook":22,"chapterId":16,"bookId":17,"arabic":"وَعَنْ أَنَسٍ ‏- رضى الله عنه ‏- عَنْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { وَاَلَّذِي نَفْسِي بِيَدِهِ لَا يُؤْمِنُ عَبْدٌ حَتَّى يُحِبَّ لِجَارِهِ ‏- أَوْ لِأَخِيهِ‏- مَا يُحِبُّ لِنَفْسِهِ }  مُتَّفَقٌ عَلَيْهِ.‏  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (13)‏، ومسلم (45)‏ (72)‏ واللفظ لمسلم.‏","english":{"narrator":"Anas (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“By Him in Whose Hand my soul is, a slave of Allah does not truly believe till he wishes for his neighbor what he wishes for himself.” Agreed upon."}},{"id":23,"idInBook":23,"chapterId":16,"bookId":17,"arabic":"وَعَنْ اِبْنِ مَسْعُودٍ ‏- رضى الله عنه ‏- قَالَ سَأَلْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-أَيُّ اَلذَّنْبِ أَعْظَمُ? قَالَ: { أَنْ تَجْعَلَ لِلَّهِ نِدًّا, وَهُوَ خَلَقَكَ.‏ قُلْتُ ثُمَّ أَيُّ? قَالَ: ثُمَّ أَنْ تَقْتُلَ وَلَدَكَ خَشْيَةَ أَنْ يَأْكُلَ مَعَكَ.‏ قُلْتُ: ثُمَّ أَيُّ? قَالَ: ثُمَّ أَنْ تُزَانِيَ حَلِيلَةَ جَارِكَ }  مُتَّفَقٌ عَلَيْهِ .‏  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (4477)‏، ومسلم (86)‏ وزاد: فأنزل الله ‏-عز وجل‏- تصديقه: \"والذين لا يدعون مع الله إلها آخر ولا يقتلون النفس التي حرم الله إلا بالحق ولا يزنون ومن يفعل ذلك يلق أثاما\" الفرقان: 68 .‏","english":{"narrator":"","text":"Ibn Mas'ud (RAA) narrated, ‘l asked the Messenger of Allah (ﷺ) “Which sin is the most serious?” He replied, attribute a partner to Allah, though He Alone has created you. “I asked, “What next?” He said, kill your child, fearing that he will share your food with you.” I asked again, “What next?” He said, “To commit adultery with your neighbor’s wife.” Agreed upon."}},{"id":24,"idInBook":24,"chapterId":16,"bookId":17,"arabic":"وَعَنْ عَبْدِ اَللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { مِنْ اَلْكَبَائِرِ شَتْمُ اَلرَّجُلِ وَالِدَيْهِ.‏ قِيلَ: وَهَلْ يَسُبُّ اَلرَّجُلُ وَالِدَيْهِ? قَالَ: نَعَمْ.‏ يَسُبُّ أَبَا اَلرَّجُلِ, فَيَسُبُّ أَبَاهُ, وَيَسُبُّ أُمَّهُ, فَيَسُبُّ أُمَّهُ }  مُتَّفَقٌ عَلَيْهِ .‏  1‏ .‏‏1 ‏- صحيح رواه البخاري (5973)‏، ومسلم (90)‏ واللفظ لمسلم.‏","english":{"narrator":"'Abdullah bin 'Amro bin al-As (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“For a man to insult his parents, is one of the major sins.” It was asked, ‘Does a man insult his parents?’ He replied “Yes, he insults the father of a man who in return insults his father, and he insults a man’s mother who in return insult his.” Agreed upon."}},{"id":25,"idInBook":25,"chapterId":16,"bookId":17,"arabic":"وَعَنْ أَبِي أَيُّوبَ ‏- رضى الله عنه ‏- أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { لَا يَحِلُّ لِمُسْلِمٍ أَنْ يَهْجُرَ أَخَاهُ فَوْقَ ثَلَاثِ لَيَالٍ يَلْتَقِيَانِ, فَيُعْرِضُ هَذَا, وَيُعْرِضُ هَذَا, وَخَيْرُهُمَا اَلَّذِي يَبْدَأُ بِالسَّلَامِ }  مُتَّفَقٌ عَلَيْهِ .‏  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (6077)‏، ومسلم (2560)‏ وفي روايه لهما:\" فيصد هذا، ويصد هذا\".‏","english":{"narrator":"Abu Aiyub (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“It is not permissible for a Muslim to shun his brother for more than three nights. When they meet, this one turns away (from that one) and that one turns away (from this one) and the best of them is the one who greets his brother first.” Agreed upon"}},{"id":26,"idInBook":26,"chapterId":16,"bookId":17,"arabic":"عَنْ جَابِرٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ كُلُّ مَعْرُوفٍ صَدَقَةٌ }  أَخْرَجَهُ اَلْبُخَارِيُّ .‏  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (6021)‏، ورواه ‏-أيضا‏- في\" الأدب المفرد\" (304)‏ بسند لا بأس به، وزاد:\" وأن من المعروف أن تلقى أخاك بوجه طلق، وأن تفرغ من دلوك في إناء أخيك\".‏","english":{"narrator":"Jabir bin ’Abdullah (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“Every act of goodness is (considered as) Sadaqah.” Related by Al-Bukhari."}},{"id":27,"idInBook":27,"chapterId":16,"bookId":17,"arabic":"وَعَنْ أَبِي ذَرٍّ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا تَحْقِرَنَّ مِنْ اَلْمَعْرُوفِ شَيْئًا, وَلَوْ أَنْ تَلْقَى أَخَاكَ بِوَجْهٍ طَلْقٍ }   1‏‏1 ‏- صحيح.‏ رواه مسلم (2626)‏.‏","english":{"narrator":"Abu Dharr (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“Do not consider any act of goodness as being insignificant even if it is meeting your brother with a cheerful face.” Related by Muslim."}},{"id":28,"idInBook":28,"chapterId":16,"bookId":17,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِذَا طَبَخْتَ مَرَقَةً, فَأَكْثِرْ مَاءَهَا, وَتَعَاهَدْ جِيرَانَكَ }  أَخْرَجَهُمَا مُسْلِمٌ .‏  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم (2625)‏ (142)‏ أوله:\" يا أبا ذر\".‏","english":{"narrator":"Abu Dharr (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“When you make some soup, make a good amount by adding plenty of liquid, and give some to your neighbors.” Related by Muslim."}},{"id":29,"idInBook":29,"chapterId":16,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ نَفَّسَ عَنْ مُؤْمِنٍ كُرْبَةً مِنْ كُرَبِ اَلدُّنْيَا, نَفَّسَ اَللَّهُ عَنْهُ كُرْبَةً مِنْ كُرَبِ يَوْمِ اَلْقِيَامَةِ , وَمَنْ يَسَّرَ عَلَى مُعْسِرٍ, يَسَّرَ اَللَّهُ عَلَيْهِ فِي اَلدُّنْيَا وَالْآخِرَةِ, وَمَنْ سَتَرَ مُسْلِمًا, سَتَرَهُ اَللَّهُ فِي اَلدُّنْيَا وَالْآخِرَةِ, وَاَللَّهُ فِي عَوْنِ اَلْعَبْدِ مَا كَانَ اَلْعَبْدُ فِي عَوْنِ أَخِيهِ }  أَخْرَجَهُ مُسْلِمٌ.‏  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم (2699)‏، وتمامه:\" ومن سلك طريقا يلتمس فيه علما، سهل الله به طريقا إلى الجنة، وما اجتمع قوم في بيت من بيوت الله، يتلون كتاب الله، ويتدارسونه بينهم، إلا نزلت عليهم السكينة، وغشيتهم الرحمة، وحفتهم الملائكة، وذكرهم الله فيمن عنده.‏.‏.‏ ومن بطأ به عمله، لم يسرع به نسبه\".‏","english":{"narrator":"Abu Hurairah (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“If anyone relieves a Muslim believer from one of the hardships of this worldly life, Allah will relieve him of one of the hardships of the Day of Resurrection. If anyone makes it easy for the one who is indebted to him (while finding it difficult to repay), Allah will make it easy for him in this worldly life and in the Hereafter, and if anyone conceals the faults of a Muslim, Allah will conceal his faults in this world and in the Hereafter. Allah helps His slave as long as he helps his brother.” Related by Muslim."}},{"id":30,"idInBook":30,"chapterId":16,"bookId":17,"arabic":"وَعَنْ أَبِي مَسْعُودٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ دَلَّ عَلَى خَيْرٍ, فَلَهُ مِثْلُ أَجْرِ فَاعِلِهِ }  أَخْرَجَهُ مُسْلِمٌ.‏  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم (1893)‏ عن أبي مسعود قال: جاء رجل إلى النبي ‏-صلى الله عليه وسلم‏- فقال: إني أبدع بي فاحملني، فقال:\" ما عندي\".‏ فقال رجل: يا رسول الله! أنا أدله على من يحمله.‏ فقال رسول الله ‏-صلى الله عليه وسلم‏-.‏.‏.‏.‏.‏ الحديث.‏","english":{"narrator":"Ibn Mas'ud (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“He who guides (others) to an act of goodness, will have a reward similar to that of its doer.” Related by Muslim."}},{"id":31,"idInBook":31,"chapterId":16,"bookId":17,"arabic":"وَعَنْ اِبْنِ عُمَرَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: عَنِ النَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { مِنْ اسْتَعَاذَكُمْ بِاَللَّهِ فَأَعِيذُوهُ, وَمَنْ سَأَلَكُمْ بِاَللَّهِ فَأَعْطُوهُ, وَمَنْ أَتَى إِلَيْكُمْ مَعْرُوفًا فَكَافِئُوهُ, فَإِنْ لَمْ تَجِدُوا, فَادْعُوا لَهُ }  أَخْرَجَهُ اَلْبَيْهَقِيُّ.‏  1‏ .‏‏1 ‏- صحيح.‏ رواه البيهقي (4 / 199)‏، ولا أدري لماذا عدل الحافظ عن عزو الحديث لأبي داود (1672 و 5109)‏.‏ والنسائي (5 / 82)‏، وأحمد (2 / 68 و 99 و 127)‏.‏","english":{"narrator":"Ibn Umar (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“If anyone seeks refuge in Allah’s name, grant him protection; if anyone asks you for something in Allah’s name give him something; and if anyone does you a favor recompense him, but if you do not have the means to do so, make Dua (supplication) for him.” Related by Al-Baihaqi."}},{"id":32,"idInBook":32,"chapterId":16,"bookId":17,"arabic":"عَنْ اَلنُّعْمَانِ بْنِ بَشِيرٍ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: سَمِعْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ‏- وَأَهْوَى اَلنُّعْمَانُ بِإِصْبَعَيْهِ إِلَى أُذُنَيْهِ: { إِنَّ اَلْحَلَالَ بَيِّنٌ, وَإِنَّ اَلْحَرَامَ بَيِّنٌ, وَبَيْنَهُمَا مُشْتَبِهَاتٌ, لَا يَعْلَمُهُنَّ كَثِيرٌ مِنْ اَلنَّاسِ, فَمَنِ اتَّقَى اَلشُّبُهَاتِ, فَقَدِ اِسْتَبْرَأَ لِدِينِهِ وَعِرْضِهِ, وَمَنْ وَقَعَ فِي اَلشُّبُهَاتِ وَقَعَ فِي اَلْحَرَامِِ, كَالرَّاعِي يَرْعَى حَوْلَ اَلْحِمَى, يُوشِكُ أَنْ يَقَعَ فِيهِ, أَلَا وَإِنَّ لِكُلِّ مَلِكٍ حِمًى, أَلَا وَإِنَّ حِمَى اَللَّهِ مَحَارِمُهُ, أَلَا وَإِنَّ فِي اَلْجَسَدِ مُضْغَةً, إِذَا صَلَحَتْ, صَلَحَ اَلْجَسَدُ كُلُّهُ, وَإِذَا فَسَدَتْ فَسَدَ اَلْجَسَدُ كُلُّهُ, أَلَا وَهِيَ اَلْقَلْبُ }  مُتَّفَقٌ عَلَيْهِ .‏  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (52)‏، ومسلم (1599)‏.‏","english":{"narrator":"","text":"An-Nu’man bin Bashir (RAA) narrated, I heard Allah‘s Messenger (ﷺ) saying, (Nu'man pointed with his two fingers to his ears) ‘Both lawful (Halal) and unlawful things (Haram) are evident but in between them there are doubtful things·and most people have no knowledge about them. So he, who saves himself from these doubtful things, saves his religion and his honor (i.e. keeps them blameless). And he who indulges in these doubtful things is like a shepherd who pastures (his animals) near the Hima (private pasture) of someone else and at any moment he is liable to get in it. (O people!) Beware! Every king has a Hima and the Hima of Allah on the earth is what He declared unlawful (Haram). Beware In the body there is a piece of flesh if it becomes sound and healthy, the whole body becomes sound and healthy but if it gets spoilt, the whole body gets spoilt and that is the heart.” Agreed upon."}},{"id":33,"idInBook":33,"chapterId":16,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ تَعِسَ عَبْدُ اَلدِّينَارِ, وَالدِّرْهَمِ, وَالْقَطِيفَةِ, إِنْ أُعْطِيَ رَضِيَ, وَإِنْ لَمْ يُعْطَ لَمْ يَرْضَ }   1‏ أَخْرَجَهُ الْبُخَارِيُّ.‏‏1 ‏- صحيح.‏ رواه البخاري (6335)‏.‏ وزاد\" والخميصة\".‏","english":{"narrator":"Abu Hurairah (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“Cursed is he, who is the slave of the Dinar, the slave of the Dirham, and the slave of the cloak bordered with silk. If he is given anything he would be satisfied, but if he is not given anything he is displeased.” Related by Al-Bukhari."}},{"id":34,"idInBook":34,"chapterId":16,"bookId":17,"arabic":"وَعَنِ اِبْنِ عُمَرَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: أَخَذَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-بِمَنْكِبِي, فَقَالَ: { كُنْ فِي اَلدُّنْيَا كَأَنَّكَ غَرِيبٌ, أَوْ عَابِرُ سَبِيلٍ }  وَكَانَ اِبْنُ عُمَرَ يَقُولُ: إِذَا أَمْسَيْتَ فَلَا تَنْتَظِرِ اَلصَّبَاحَ, وَإِذَا أَصْبَحْتَ فَلَا تَنْتَظِرِ اَلْمَسَاءَ, وَخُذْ مِنْ صِحَّتِكَ لِسَقَمِك, وَمِنْ حَيَاتِكَ لِمَوْتِكَ.‏ أَخْرَجَهُ اَلْبُخَارِيُّ.‏  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (6416)‏.‏","english":{"narrator":"","text":"Ibn 'Umar (RAA) narrated, ‘Allah’s Messenger (ﷺ) took hold of my shoulders and said, “Be in this world as though you were a stranger or a passerby.” Ibn ’Umar used to say, “If you are alive in the evening, do not expect to be alive till the morning and if you are alive in the morning do not expect to be alive till the evening, and take from your health for your sickness, and from your life for your death.” Related by Al-Bukhari."}},{"id":35,"idInBook":35,"chapterId":16,"bookId":17,"arabic":"وَعَنِ اِبْنِ عُمَرَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ تَشَبَّهَ بِقَوْمٍ, فَهُوَ مِنْهُمْ }  أَخْرَجَهُ أَبُو دَاوُدَ, وَصَحَّحَهُ اِبْنُ حِبَّانَ.‏  1‏ .‏‏1 ‏- صحيح.‏ رواه أبو داود (4031)‏.‏","english":{"narrator":"Ibn ’Umar (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“He who imitates any people (in their actions) is considered to be one of them.” Related by Abu Dawud and Ibn Hibban graded it as Sahih."}},{"id":36,"idInBook":36,"chapterId":16,"bookId":17,"arabic":"وَعَنِ اِبْنِ عَبَّاسٍ قَالَ: كُنْتُ خَلْفَ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-يَوْمًا, فَقَالَ: { يَا غُلَامُ! اِحْفَظِ اَللَّهَ يَحْفَظْكَ, اِحْفَظِ اَللَّهَ تَجِدْهُ تُجَاهَكَ, وَإِذَا سَأَلْتَ فَاسْأَلْ اَللَّهَ, وَإِذَا اِسْتَعَنْتَ فَاسْتَعِنْ بِاَللَّهِ }  رَوَاهُ اَلتِّرْمِذِيُّ, وَقَالَ: حَسَنٌ صَحِيحٌ.‏  1‏ .‏‏1 ‏- صحيح.‏ رواه الترمذي (2516)‏، وتمامه:\" واعلم أن الأمة لو اجتمعت على أن ينفعوك بشيء لم ينفعوك إلا بشيء قد كتبه الله لك، ولو اجتمعوا على أن يضروك بشيء لم يضروك إلا بشيء قد كتبه الله عليك، رفعت الأقلام، وجفت الصحف\".‏","english":{"narrator":"","text":"Ibn 'Abbas (RAA) narrated, ‘One day I was riding behind the Prophet when he said, “O lad, be mindful of Allah and He will protect you. Be mindful of Allah and you shall find Him with you. When you ask (for anything), ask it from Allah, and if you seek help, seek help from Allah.” Related by At-Tirmidhi who verified it as Hasan and Sahih."}},{"id":37,"idInBook":37,"chapterId":16,"bookId":17,"arabic":"1473: وَعَنْ سَهْلِ بْنِ سَعْدٍ قَالَ: { جَاءَ رَجُلٌ إِلَى اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-فَقَالَ: يَا رَسُولَ اَللَّهِ! دُلَّنِي عَلَى عَمَلٍ إِذَا عَمِلْتُهُ أَحَبَّنِي اَللَّهُ, وَأَحَبَّنِي اَلنَّاسُ.‏  قَالَ: اِزْهَدْ فِي اَلدُّنْيَا يُحِبُّكَ اَللَّهُ, وَازْهَدْ فِيمَا عِنْدَ اَلنَّاسِ يُحِبُّكَ اَلنَّاسُ }  رَوَاهُ اِبْنُ مَاجَه, وَسَنَدُهُ حَسَنٌ  1‏ .‏‏1 ‏- رواه ابن ماجه (4102)‏ ولو قال الحافظ\" وهو حسن\" لكان أدق من قوله:\" وسنده حسن\" إذ الحديث له شواهد؛ ولذلك حسنه غير واحد كالنووي، والعراقي والهيثمي، والألباني، أما سند ابن ماجه، ففيه خالد بن عمرو، وهو وضاع.‏","english":{"narrator":"","text":"Sahl bin Sa'd (RAA) narrated, A man came to the Prophet and said, “O Allah`s Messenger (ﷺ), direct me to a deed which if I do it, I shall be loved by Allah and by people.” He replied, “If you practice abstinence in this world, Allah will love you, and if you abstain from (desiring) what people have, they will love you.” Related by Ibn Majah and others with a good chain of narrators."}},{"id":38,"idInBook":38,"chapterId":16,"bookId":17,"arabic":"وَعَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ ‏- رضى الله عنه ‏- قَالَ: سَمِعْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ: { إِنَّ اَللَّهَ يُحِبُّ اَلْعَبْدَ اَلتَّقِيَّ, اَلْغَنِيَّ, اَلْخَفِيَّ }  أَخْرَجَهُ مُسْلِمٌ.‏  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم من طريق عامر بن سعد قال: كان سعد بن أبي وقاص في إبله، فجاءه ابن عمر، فلما رآه سعد قال: أعوذ بالله من شر هذا الراكب.‏ فنزل، فقال له: أنزلت في إبلك وغنمك وتركت الناس يتنازعون الملك بينهم؟ فضرب سعد في صدره، فقال: اسكت! سمعت رسول الله ‏-صلى الله عليه وسلم‏- يقول: الحديث.‏","english":{"narrator":"","text":"Sa'd bin Abi Waqqas (RAA) narrated, ‘l heard Allah's Messenger (ﷺ) saying, “Allah loves the pious rich maxim who is inconspicuous (free from showing off or hypocrisy).” Related by Muslim."}},{"id":39,"idInBook":39,"chapterId":16,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مِنْ حُسْنِ إِسْلَامِ اَلْمَرْءِ, تَرْكُهُ مَا لَا يَعْنِيهِ }  رَوَاهُ اَلتِّرْمِذِيُّ, وَقَالَ حَسَنٌ.‏  1‏ .‏‏1 ‏- حسن رواه الترمذي (2318)‏ وأظن أن الحافظ‏- رحمه الله‏- وهم في نقل التحسين عن الترمذي، فلم أجده في أكثر من مطبوعة من\" السنن\"، وإنما الذي فيها قوله:\" غريب\" وهو الصواب، كما نقله عنه ابن رجب في\" الجامع\" (1 / 287)‏ والمزي في\" التحفة\" (11 / 41)‏ وغيرهما.‏","english":{"narrator":"Abu Hurairah (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“A sign of man's good observance of Islam (his piety) is to keep away from that which does not concern him.” Related by At-Tirmidhi who graded it as Hadith Hasan."}},{"id":40,"idInBook":40,"chapterId":16,"bookId":17,"arabic":"وَعَنْ اَلْمِقْدَامِ بْنِ مَعْدِيكَرِبَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَا مَلَأَ ابْنُ آدَمَ وِعَاءً شَرًّا مِنْ بَطْنٍ }  أَخْرَجَهُ اَلتِّرْمِذِيُّ وَحَسَّنَهُ.‏  1‏ .‏‏1 ‏- صحيح.‏ رواه الترمذي (2380)‏ وتمامه:\" بحسب ابن آدم أكلات يقمن صلبه، فإن كان لا محالة فثلث لطعامه، وثلث لشرابه، وثلث لنفسه\".‏ والذي في نسخة\" شاكر\" ونسخة\" تركيا\":\" حسن صحيح\" ، ولعل هذا من اختلاف النسخ، والله أعلم، ثم رأيت المزي قال في\" التحفة\" (8 / 521)‏:\" وقال: حسن، وفي بعض النسخ: حسن صحيح\".‏","english":{"narrator":"Al-Miqdam bin Ma’diakrib (RAA), narrated that Allah's Messenger (ﷺ) said:","text":"“A human being has never filled any vessel which is worse than his own belly.” Related by At-Tirmidhi, who graded it to be Hasan."}},{"id":41,"idInBook":41,"chapterId":16,"bookId":17,"arabic":"وَعَنْ أَنَسٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ كُلُّ بَنِي آدَمَ خَطَّاءٌ, وَخَيْرُ اَلْخَطَّائِينَ اَلتَّوَّابُونَ }  أَخْرَجَهُ اَلتِّرْمِذِيُّ, وَابْنُ مَاجَهْ, وَسَنَدُهُ قَوِيٌّ.‏  1‏ .‏‏1 ‏- حسن.‏ رواه الترمذي (2499)‏، وابن ماجه (2451)‏.‏","english":{"narrator":"Anas (RAA) narrated that Allah's Messenger (ﷺ) said:","text":"“All the sons of Adam are sinners, but the best of sinners are those who repent often.” Related by At·Tirmidhi and Ibn Majah with a strong chain of narrators."}},{"id":42,"idInBook":42,"chapterId":16,"bookId":17,"arabic":"وَعَنْ أَنَسٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ اَلصَّمْتُ حِكْمَةٌ, وَقَلِيلٌ فَاعِلُهُ }  أَخْرَجَهُ اَلْبَيْهَقِيُّ فِي\n\" اَلشُّعَبِ\" بِسَنَدٍ ضَعِيفٍ.‏  1‏ \n\nوَصَحَّحَ أَنَّهُ مَوْقُوفٌ مِنْ قَوْلِ لُقْمَانَ اَلْحَكِيمِ.‏  2‏ .‏‏1 ‏- ضعيف رواه ابن عدي في\" الكامل\" (5 / 1816)‏، والبيهقي في\" الشعب\" (5027)‏، وتحرف في\" الأصل\" إلى\" حلم\" والتصحيح من\" أ\"، وهو الموافق لما عند ابن عدي والبيهقي.‏\n\n‏2 ‏- رواه ابن حبان في\" روضة العقلاء\" ص (41)‏، والحاكم في\" المستدرك\" (2 / 422 / 423)‏، والبيهقي في\" الشعب\" بسند صحيح عن أنس: أن لقمان كان عند داود وهو يسرد الدرع، فجعل يفتله هكذا بيده، فجعل لقمان يتعجب، ويريد أن يسأله، فتمنعه حكمته أن يسأله، فلما فرغ منها صبها على نفسه وقال: نعم درع الحرب هذه.‏ فقال لقمان: إن الصمت من الحكم، وقليل فاعله.‏ كنت أريد أن أسألك، فسكت حتى كفيتني.‏ وقال البيهقي:\" هذا هو الصحيح عن أنس أن لقمان قال:\" الصمت حكم، وقليل فاعله\".‏","english":{"narrator":"Anas (RAA) narrated that Allah's Messenger (ﷺ) said:","text":"“Keeping silent is considered as (an act of`) wisdom, but very few practice it.” Related by Al-Baihaqi in his book Shu'ab al-Iman with a weak chain of narrators a he deemed the sound view is that it is traced back to one of the companions who quoted it from Luqman Al-Hakim."}},{"id":43,"idInBook":43,"chapterId":16,"bookId":17,"arabic":"عَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِيَّاكُمْ وَالْحَسَدَ, فَإِنَّ اَلْحَسَدَ يَأْكُلُ اَلْحَسَنَاتِ, كَمَا تَأْكُلُ اَلنَّارُ اَلْحَطَبَ }  أَخْرَجَهُ أَبُو دَاوُدَ  1‏ .‏‏1 ‏- ضعيف رواه أبو داود (4903)‏، وفي سنده راو مجهول.‏","english":{"narrator":"Abu Hurairah (RAA) narrated that Allah’s Messenger (ﷺ) said:","text":"“Avoid envy, for envy devours good deeds just as fire devours firewood.” Related by Abu Dawud."}},{"id":44,"idInBook":44,"chapterId":16,"bookId":17,"arabic":"وَلِابْنِ مَاجَهْ: مِنْ حَدِيثِ أَنَسٍ نَحْوُهُ.‏  1‏ .‏‏1 ‏- برقم (4210)‏ وفي سنده\" متروك\".‏","english":{"narrator":"","text":"Ibn Majah related a similar hadith on the authority of Anas."}},{"id":45,"idInBook":45,"chapterId":16,"bookId":17,"arabic":"وَعَنْهُ  1‏ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَيْسَ اَلشَّدِيدُ بِالصُّرَعَةِ, إِنَّمَا اَلشَّدِيدُ اَلَّذِي يَمْلِكُ نَفْسَهُ عِنْدَ اَلْغَضَبِ }  مُتَّفَقٌ عَلَيْهِ.‏  2‏ .‏‏1 ‏- أي: عن أبي هريرة ‏-رضي الله عنه‏-.‏‏2 ‏- صحيح.‏ رواه البخاري (6114)‏، ومسلم (2609)‏.‏","english":{"narrator":"Abu Hurairah (RAA) narrated that Allah's Messenger (ﷺ) said:","text":"“The strong man is not the good wrestler; but the strong man is he who controls himself when he is angry.” Agreed upon."}},{"id":46,"idInBook":46,"chapterId":16,"bookId":17,"arabic":"وَعَنْ اِبْنِ عُمَرَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ اَلظُّلْمُ ظُلُمَاتٌ يَوْمَ اَلْقِيَامَةِ }  مُتَّفَقٌ عَلَيْهِ.‏  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (2447)‏، ومسلم (2579)‏ وزاد مسلم في أوله:\" إن\".‏","english":{"narrator":"Ibn 'Umar (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“Oppression will turn into darkness on the Day of Resurrection.” Agreed upon."}},{"id":47,"idInBook":47,"chapterId":16,"bookId":17,"arabic":"وَعَنْ جَابِرٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ : { اِتَّقُوا اَلظُّلْمَ, فَإِنَّ اَلظُّلْمَ ظُلُمَاتٌ يَوْمَ اَلْقِيَامَةِ, وَاتَّقُوا اَلشُّحَّ , فَإِنَّهُ أَهْلَكَ مَنْ كَانَ قَبْلَكُمْ }  أَخْرَجَهُ مُسْلِمٌ.‏  1‏ .‏‏1 ‏- .‏ صحيح.‏ رواه مسلم (2578)‏ وزاد:\" حملهم على أن سفكوا دماءهم، واستحلوا محارمهم\".‏","english":{"narrator":"Jabir bin 'Abdullah (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“Beware of oppression, for oppression will turn into excessive darkness on the Day of Resurrection and beware of niggardliness, for niggardliness destroyed your predecessors.” Related by Muslim."}},{"id":48,"idInBook":48,"chapterId":16,"bookId":17,"arabic":"وَعَنْ مَحْمُودِ بْنِ لَبِيدٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِنَّ أَخْوَفَ مَا أَخَافُ عَلَيْكُمْ اَلشِّرْكُ اَلْأَصْغَرُ: اَلرِّيَاءُ }  أَخْرَجَهُ أَحْمَدُ بِسَنَدٍ حَسَنٍ.‏  1‏ .‏‏1 ‏- حسن.‏ رواه أحمد (5 / 428 و 429)‏ وزاد:\" يقول الله ‏-عز وجل‏- لهم يوم القيامة ‏-إذا جزى الناس بأعمالهم‏-: اذهبوا إلى الذين كنتم تراءون في الدنيا فانظروا هل تجدون عندهم جزاء\".‏","english":{"narrator":"Mahmud bin Labid (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“The thing I fear most for you is the lesser shirk (polytheism), showing-off (of good deeds).” Related by Ahmad with a good chain of narrators,"}},{"id":49,"idInBook":49,"chapterId":16,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ آيَةُ اَلْمُنَافِقِ ثَلَاثٌ: إِذَا حَدَّثَ كَذَبَ, وَإِذَا وَعَدَ أَخْلَفَ, وَإِذَا ائْتُمِنَ خَانَ }  مُتَّفَقٌ عَلَيْهِ.‏  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (33)‏، ومسلم (59)‏ (107)‏.‏","english":{"narrator":"Abu Hurairah (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“There are three signs of a hypocrite: when he speaks, he tells lies; when he makes a promise, he breaks it; and when he is entrusted, he betrays his trust.” Agreed upon."}},{"id":50,"idInBook":50,"chapterId":16,"bookId":17,"arabic":"وَلَهُمَا: مِنْ حَدِيثِ عَبْدِ اَللَّهِ بْنِ عَمْرِوٍ: { وَإِذَا خَاصَمَ فَجَرَ }   1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (34)‏، ومسلم (58)‏ ولفظه ‏- كما عند البخاري ‏-:\" أربع من كن فيه كان منافقا خالصا، ومن كانت فيه خصلة منهن كانت فيه خصلة من النفاق حتى يدعها: إذا ائتمن خان، وإذا حدث كذب، وإذا عاهد غدر، وإذا خاصم فجر\".‏","english":{"narrator":"","text":"Al·Bukhari and Muslim reported another hadith on the authority of ’Abdullah bin ’Umar (RAA) with the addition, “and when he quarrels, he is abusive (behaves in a very impudent and insulting manner).”"}},{"id":51,"idInBook":51,"chapterId":16,"bookId":17,"arabic":"وَعَنْ اِبْنِ مَسْعُودٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ سِبَابُ اَلْمُسْلِمِ فُسُوقٌ, وَقِتَالُهُ كُفْرٌ }  مُتَّفَقٌ عَلَيْهِ.‏  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (6044)‏ ومسلم (64)‏.‏","english":{"narrator":"Ibn Mas'ud (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"insulting a Muslim is disobedience to Allah, and fighting with him is Kufr (disbelief).” Agreed upon."}},{"id":52,"idInBook":52,"chapterId":16,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِيَّاكُمْ وَالظَّنَّ, فَإِنَّ اَلظَّنَّ أَكْذَبُ اَلْحَدِيثِ }  مُتَّفَقٌ عَلَيْهِ .‏  1‏ .‏‏1 ‏- صحيح.‏ وهو طرف من حديث رواه البخاري (5143)‏، ومسلم (2563)‏ وسيأتي ‏-أيضا‏- برقم (1520)‏.‏","english":{"narrator":"Abu Hurairah (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“Avoid suspicion, for suspicion is the most false form of talk.” Agreed upon."}},{"id":53,"idInBook":53,"chapterId":16,"bookId":17,"arabic":"وَعَنْ مَعْقِلِ بْنِ يَسَارٍ ‏- رضى الله عنه ‏-  سَمِعْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ: { مَا مِنْ عَبْدِ يَسْتَرْعِيهِ اَللَّهُ رَعِيَّةً, يَمُوتُ يَوْمَ يَمُوتُ, وَهُوَ غَاشٌّ لِرَعِيَّتِهِ, إِلَّا حَرَّمَ اَللَّهُ عَلَيْهِ اَلْجَنَّةَ }  مُتَّفَقٌ عَلَيْهِ.‏  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (13 / 126‏- 127 / فتح)‏، ومسلم (142)‏ واللفظ لمسلم.‏","english":{"narrator":"","text":"Ma'qil bin Yasar (RAA) narrated, ‘I heard the Messenger of Allah (ﷺ) saying, “Any governor in charge of Muslim subjects who dies while acting dishonestly towards them will be excluded by Allah from Paradise.” Agreed upon."}},{"id":54,"idInBook":54,"chapterId":16,"bookId":17,"arabic":"وَعَنْ عَائِشَةَ ‏-رَضِيَ اَللَّهُ عَنْهَا‏- قَالَتْ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ اَللَّهُمَّ مَنْ وَلِيَ مِنْ أَمْرِ أُمَّتِي شَيْئًا, فَشَقَّ عَلَيْهِ, فَاشْقُقْ عَلَيْهِ }  أَخْرَجَهُ مُسْلِمٌ.‏  1‏ .‏‏1 ‏- .‏ صحيح.‏ رواه مسلم (1828)‏ من طريق عبد الرحمن بن شماسة قال: أتيت عائشة أسألها عن شئ.‏ فقالت: ممن أنت؟ فقلت: رجل من أهل مصر.‏ فقالت: كيف كان صاحبكم لكم في غزاتكم هذه؟ فقال: ما نقمنا منه شيئا إن كان ليموت للرجل منا البعير، فيعطيه البعير، والعبد فيعطيه العبد، ويحتاج إلى النفقة، فيعطيه النفقة.‏ فقالت: أما إنه لا يمنعني الذي فعل في محمد بن أبي بكر أخي، أن أخبرك ما سمعت من رسول ‏-صلى الله عليه وسلم‏- يقول في بيتي هذا.‏.‏.‏.‏ الحديث، وزاد:\" ومن ولي من أمر أمتي شيئا فرفق بهم، فارفق به\".‏","english":{"narrator":"‘A’ishah (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“O Allah, cause distress to him who has any charge over my people and causes them distress.” Related by Muslim."}},{"id":55,"idInBook":55,"chapterId":16,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِذَا قَاتَلَ أَحَدُكُمْ, فَلْيَتَجَنَّبِ اَلْوَجْهَ }  مُتَّفَقٌ عَلَيْهِ.‏  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (2559)‏، ومسلم (2612)‏ واللفظ لمسلم، ولتمام تخريج الحديث انظر\" التوحيد\" لابن خزيمة (35 بتحقيقي)‏ وما بعده.‏","english":{"narrator":"Abu Hurairah (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“When any of you fights, he must avoid (striking) the face.” Agreed upon."}},{"id":56,"idInBook":56,"chapterId":16,"bookId":17,"arabic":"وَعَنْهُ أَنَّ رَجُلاً قَالَ: { يَا رَسُولَ اَللَّهِ! أَوْصِنِي.‏ فَقَالَ: لَا تَغْضَبْ, فَرَدَّدَ مِرَارًا.‏ قَالَ: لَا تَغْضَبْ }  أَخْرَجَهُ اَلْبُخَارِيُّ.‏  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (6116)‏.‏","english":{"narrator":"Abu Hurairah (RAA) narrated, ‘A man said, “O Messenger of Allah, advise me.” The Messenger of Allah (ﷺ) said:","text":"“Do not get angry.” The man repeated that several times and he replied, “Do not get angry.” Related by Al-Bukhari."}},{"id":57,"idInBook":57,"chapterId":16,"bookId":17,"arabic":"وَعَنْ خَوْلَةَ اَلْأَنْصَارِيَّةَ ‏-رَضِيَ اَللَّهُ عَنْهَا‏- قَالَتْ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِنَّ رِجَالاً يتخوَّضون فِي مَالِ اَللَّهِ بِغَيْرِ حَقٍّ, فَلَهُمْ اَلنَّارُ يَوْمَ اَلْقِيَامَةِ }  أَخْرَجَهُ اَلْبُخَارِيُّ.‏  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (3118)‏ , ويتخوضون في مال الله بغير حق.‏ أي: يتصرفون في مال المسلمين بالباطل، وفي الحديث ردع الولاة أن يأخذوا من المال شيئا بغير حقه، أو يمنعوه من أهله.‏ انظر\" الفتح\".‏","english":{"narrator":"Khawlah al-Ansariyah (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“Some men acquire Allah’s Property (such as the funds of the Muslim state treasury, Zakah etc.) and they will go to Hell on the Day of Resurrection.” Related Al-Bukhari."}},{"id":58,"idInBook":58,"chapterId":16,"bookId":17,"arabic":"وَعَنْ أَبِي ذَرٍّ ‏- رضى الله عنه ‏- عَنْ اَلنَّبِيِّ ‏-صَلَّى اَللَّهُ عَلَيْهِ وَسَلَّمَ‏-‏- فِيمَا يَرْوِي  1‏ عَنْ رَبِّهِ‏- قَالَ: { يَا عِبَادِي! إِنِّي حَرَّمْتُ اَلظُّلْمَ عَلَى نَفْسِي, وَجَعَلْتُهُ بَيْنَكُمْ مُحَرَّمًا, فَلَا تَظَّالَمُوا }  أَخْرَجَهُ مُسْلِمٌ.‏  2‏ .‏‏1 ‏- في\" أ\" يرويه.‏‏2 ‏- صحيح.‏ رواه مسلم (2577)‏، وهو طرف من حديث طويل، وقد شرحه شيخ الإسلام ابن تيمية شرحا نفيسا في\" مجموع الفتاوى\"، وأيضا طبع مفردا.‏","english":{"narrator":"","text":"Abu Dharr (RAA) quoted the Prophet (ﷺ) saying among what he narrated from Allah, the Most High that He has said, “O MY slaves, I have made oppression unlawful for myself and I have made it unlawful among you, so do not oppress one another.” Related by Muslim."}},{"id":59,"idInBook":59,"chapterId":16,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { أَتَدْرُونَ مَا اَلْغِيبَةُ? \n\nقَالُوا: اَللَّهُ وَرَسُولُهُ أَعْلَمُ.‏ \n\nقَالَ: ذِكْرُكَ أَخَاكَ بِمَا يَكْرَهُ.‏ \n\nقِيلَ: أَرَأَيْتَ إِنْ كَانَ فِي أَخِي مَا أَقُولُ? \n\nقَالَ: إِنْ كَانَ فِيهِ مَا تَقُولُ فَقَدْ اِغْتَبْتَهُ, وَإِنْ لَمْ يَكُنْ فَقَدْ بَهَتَّهُ }  أَخْرَجَهُ مُسْلِمٌ.‏  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم (2589)‏.‏","english":{"narrator":"Abu Hurairah (RAA) narrated, ‘The Messenger of Allah (ﷺ) asked, “Do you know what backbiting is?” They replied, `Allah and His Messenger (ﷺ) know best.’ He said, “It is saying something about your brother which he dislikes.” Someone asked, ‘Supposing that what I said about my brother was true?’ and the Messenger of Allah (ﷺ) said:","text":"“If what you say about him is true you have backbitten him and if it is not true you have slandered him.” Related by Muslim."}},{"id":60,"idInBook":60,"chapterId":16,"bookId":17,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا تَحَاسَدُوا وَلَا تَنَاجَشُوا, وَلَا تَبَاغَضُوا, وَلَا تَدَابَرُوا, وَلَا يَبِعْ بَعْضُكُمْ عَلَى بَيْعِ بَعْضٍ, وَكُونُوا عِبَادَ اَللَّهِ إِخْوَانًا, اَلْمُسْلِمُ أَخُو اَلْمُسْلِمِ, لَا يَظْلِمُهُ, وَلَا يَخْذُلُهُ, وَلَا يَحْقِرُهُ, اَلتَّقْوَى هَا هُنَا, وَيُشِيرُ إِلَى صَدْرِهِ ثَلَاثَ مِرَارٍ, بِحَسْبِ اِمْرِئٍ مِنْ اَلشَّرِّ أَنْ يَحْقِرَ أَخَاهُ اَلْمُسْلِمَ, كُلُّ اَلْمُسْلِمِ عَلَى اَلْمُسْلِمِ حَرَامٌ, دَمُهُ, وَمَالُهُ, وَعِرْضُهُ }  أَخْرَجَهُ مُسْلِمٌ.‏  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم (2564)‏.‏","english":{"narrator":"Abu Hurairah [RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“Avoid jealousy between yourselves, do not outbid one another (with a view to raising the price), do not harbor hatred against one another, do not bear enmity against one another, one of you should not enter into a transaction when the other has already entered into it; and be fellow brothers and slaves of Allah. A Muslim is a Muslim’s brother. He does not wrong, desert or despise him. Piety is found here (pointing three times to his chest), despising his Muslim brother is enough evil for any man to do. Every Muslim’s blood, property and honor are unlawful to be violated by another Muslim.” Related by Muslim."}},{"id":61,"idInBook":61,"chapterId":16,"bookId":17,"arabic":"وَعَنْ قُطْبَةَ بْنِ مَالِكٍ ‏- رضى الله عنه ‏- قَالَ: كَانَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ: { اَللَّهُمَّ جَنِّبْنِي مُنْكَرَاتِ اَلْأَخْلَاقِ, وَالْأَعْمَالِ, وَالْأَهْوَاءِ, وَالْأَدْوَاءِ }  أَخْرَجَهُ اَلتِّرْمِذِيُّ , وَصَحَّحَهُ اَلْحَاكِمُ وَاللَّفْظِ لَهُ.‏  1‏ .‏‏1 ‏- صحيح.‏ رواه الترمذي (3591)‏، والحاكم (1 / 532)‏.‏ و\" الدواء\": جمع داء، وهي الأسقام.‏","english":{"narrator":"","text":"Qutbah bin Malik (RAA) narrated, ‘The Messenger of Allah (ﷺ) used to say, “O Allah, I seek refuge in you from evil morals, deeds, passions and diseases.” Related by At-Tirmidhi. Al-Hakim graded it as Sahih and it is his version."}},{"id":62,"idInBook":62,"chapterId":16,"bookId":17,"arabic":"وَعَنْ اِبْنِ عَبَّاسٍ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا تُمَارِ أَخَاكَ, وَلَا تُمَازِحْهُ, وَلَا تَعِدْهُ مَوْعِدًا فَتُخْلِفَهُ }  أَخْرَجَهُ اَلتِّرْمِذِيُّ بِسَنَدٍ فِيهِ ضَعْفٌ.‏  1‏ .‏‏1 ‏- ضعيف.‏ رواه الترمذي (1995)‏ وفي سنده ليث بن أبي سليم.‏","english":{"narrator":"Ibn ’Abbas (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“Don’t dispute with your brother; don’t make jokes with him; and don’t make him a promise which you would break.” Related by At-Tirmidhi with a weak chain of narrators."}},{"id":63,"idInBook":63,"chapterId":16,"bookId":17,"arabic":"وَعَنْ أَبِي سَعِيدٍ اَلْخُدْرِيِّ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ خَصْلَتَانِ لَا يَجْتَمِعَانِ فِي مُؤْمِنٍ: اَلْبُخْلُ, وَسُوءُ اَلْخُلُقِ }  أَخْرَجَهُ اَلتِّرْمِذِيُّ, وَفِي سَنَدِهِ ضَعْفٌ.‏  1‏ .‏‏1 ‏- ضعيف.‏ رواه الترمذي (1962)‏ وقال:\" غريب لا نعرفه إلا من حديث صدقة بن موسى\".‏ قلت: وهو ضعيف، سيئ الحفظ.‏","english":{"narrator":"Abu Sa'id al-Khudri (RAA), narrated that the Messenger of Allah (ﷺ) said:","text":"“There are two characteristics which are not combined in a believer; miserliness and bad morals.” Related by At-Tirmidhi with a weakness in its chain of narrators."}},{"id":64,"idInBook":64,"chapterId":16,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ : { اَلْمُسْتَبَّانِ مَا قَالَا, فَعَلَى اَلْبَادِئِ, مَا لَمْ يَعْتَدِ اَلْمَظْلُومُ }  أَخْرَجَهُ مُسْلِمٌ.‏  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم (2487)‏.‏","english":{"narrator":"Abu Hurairah (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“When two men insult one another, what they say is mainly the fault of the one who began it, so long as the one who is oppressed does not transgress.” Related by Muslim."}},{"id":65,"idInBook":65,"chapterId":16,"bookId":17,"arabic":"وَعَنْ أَبِي صِرْمَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ ضَارَّ مُسْلِمًا ضَارَّهُ اَللَّهُ, وَمَنْ شَاقَّ مُسَلِّمًا شَقَّ اَللَّهُ عَلَيْهِ }  أَخْرَجَهُ أَبُو دَاوُدَ وَاَلتِّرْمِذِيُّ وَحَسَّنَهُ.‏  1‏ .‏‏1 ‏- حسن.‏ رواه أبو داود (3635)‏، والترمذي (1940)‏، وليس عندهما لفظ\" مسلما\".‏","english":{"narrator":"Abu Sirmah (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“He who causes harm to a Muslim will be harmed by Allah, and he who acts in a hostile manner against a Muslim, will be punished in the same way by Allah.” Related by Abu Dawud and At-Tirmidhi who graded it to be Hasan (good)."}},{"id":66,"idInBook":66,"chapterId":16,"bookId":17,"arabic":"وَعَنْ أَبِي اَلدَّرْدَاءِ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِنَّ اَللَّهَ يُبْغِضُ اَلْفَاحِشَ اَلْبَذِيءَ }  أَخْرَجَهُ اَلتِّرْمِذِيُّ, وَصَحَّحَهُ.‏  1‏ .‏‏1 ‏- .‏ صحيح.‏ رواه الترمذي (2002)‏، وله شواهد، وأوله:\" ما شيء أثقل في ميزان المؤمن من خلق حسن، فإن الله.‏.‏.‏.‏.‏.‏\" الحديث.‏ وسيأتي برقم (1623)‏.‏ وقال:\" هذا حديث حسن صحيح\".‏","english":{"narrator":"Abu ad-Darda (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“Allah hates the profligate and the obscene.” Related by At-Tirmidhi who graded it to be Sahih."}},{"id":67,"idInBook":67,"chapterId":16,"bookId":17,"arabic":"وَلَهُ مِنْ حَدِيثِ اِبْنِ مَسْعُودٍ ‏-رَفَعَهُ‏-: { لَيْسَ اَلْمُؤْمِنُ بِالطَّعَّانِ, وَلَا اَللَّعَّانُ, وَلَا اَلْفَاحِشَ, وَلَا اَلْبَذِيءَ }  وَحَسَّنَهُ, وَصَحَّحَهُ اَلْحَاكِمُ, وَرَجَّحَ اَلدَّارَقُطْنِيُّ وَقْفَهُ.‏ .‏","english":{"narrator":"At-Tirmidhi also related on the authority of Ibn Mas'ud (RAA) that the Messenger of Allah (ﷺ) said:","text":"“The believer is not a slanderer, nor does he curse others, and nor is he immoral or shameless.” Related by At-Tirmidhi who graded it to be Hasan. Al-Hakim graded it as Sahih and Ad-Daraqutni said that it is most probably Mawquf (traced only to a Companion)."}},{"id":68,"idInBook":68,"chapterId":16,"bookId":17,"arabic":"وَعَنْ عَائِشَةَ ‏-رَضِيَ اَللَّهُ عَنْهَا‏- قَالَتْ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا تَسُبُّوا اَلْأَمْوَاتَ ; فَإِنَّهُمْ قَدْ أَفْضَوْا إِلَى مَا قَدَّمُوا }  أَخْرَجَهُ اَلْبُخَارِيُّ.‏  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (1393)‏.‏","english":{"narrator":"A’ishah (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“Avoid reviling the dead, they have already seen the result of (the deeds) that they forwarded before them.” Related by Al-Bukhari."}},{"id":69,"idInBook":69,"chapterId":16,"bookId":17,"arabic":"وَعَنْ حُذَيْفَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا يَدْخُلُ اَلْجَنَّةَ قَتَّاتٌ }  مُتَّفَقٌ عَلَيْهِ.‏  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (6056)‏، ومسلم (105)‏ والقتات:\" النمام\" كما وقع ذلك في رواية مسلم.‏","english":{"narrator":"Hudhaifah (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“A backbiter will not enter Paradise.” Agreed upon."}},{"id":70,"idInBook":70,"chapterId":16,"bookId":17,"arabic":"وَعَنْ أَنَسٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ كَفَّ غَضَبَهُ, كَفَّ اَللَّهُ عَنْهُ عَذَابَهُ }  أَخْرَجَهُ اَلطَّبَرَانِيُّ فِي\n\" اَلْأَوْسَطِ\".‏  1‏ .‏‏1 ‏- صحيح بشواهده، وحديث أنس عند أبي يعلى، والدولابي أيضا.‏","english":{"narrator":"Anas (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“If one restrained his anger, Allah will keep His punishment from him (on the Day of Resurrection).” Related by At-Tabarani in al-Awsat."}},{"id":71,"idInBook":71,"chapterId":16,"bookId":17,"arabic":"وَلَهُ شَاهِدٌ: مِنْ حَدِيثِ اِبْنِ عُمَرَ عِنْدَ اِبْنِ أَبِي اَلدُّنْيَا.‏  1‏ .‏‏1 ‏- صحيح كسابقه، وهو أحد شواهد الحديث السابق، إلا أن لفظه:\" من كف غضبه ستر الله عورته\"، وهو عند الطبراني في\" الكبير\" ‏-أيضا‏-.‏","english":{"narrator":"","text":"The aforementioned hadith is supported by a narration on the authority of Ibn ’Umar related by Ibn Abi Ad-Dunia."}},{"id":72,"idInBook":72,"chapterId":16,"bookId":17,"arabic":"وَعَنْ أَبِي بَكْرٍ اَلصِّدِّيقِ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا يَدْخُلُ اَلْجَنَّةَ خِبٌّ, وَلَا بَخِيلٌ, وَلَا سَيِّئُ اَلْمَلَكَةِ }  أَخْرَجَهُ اَلتِّرْمِذِيُّ, وَفَرَّقَهُ حَدِيثَيْنِ, وَفِي إِسْنَادِهِ ضَعْفٌ.‏  1‏ .‏‏1 ‏- ضعيف.‏ رواه الترمذي (1947و 1964)‏ وقال في الموطن الأول:\" حديث غريب\"، وفي الموطن الثاني:\" حسن غريب\".‏ قلت: وفيه فرقد بن يعقوب السبخي، وهو\" ضعيف\".‏","english":{"narrator":"Abu Bakr as-Siddiq (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“A crafty person, a miser and one who badly treats those under his authority will not enter Paradise.” Related by At-Tirmidhi in two separate traditions and there is a weakness in its chain of narrators."}},{"id":73,"idInBook":73,"chapterId":16,"bookId":17,"arabic":"وَعَنْ اِبْنِ عَبَّاسٍ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ تَسَمَّعَ حَدِيثَ قَوْمٍ, وَهُمْ لَهُ كَارِهُونَ, صُبَّ فِي أُذُنَيْهِ اَلْآنُكُ يَوْمَ اَلْقِيَامَةِ }  يَعْنِي: اَلرَّصَاصَ.‏ أَخْرَجَهُ اَلْبُخَارِيُّ.‏  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (7042)‏ وأوله:\" من تحلم بحلم لم يره كلف أن يعقد بين شعيرتين، ولن يفعل.‏.‏.‏.‏.‏\" فذكر الحديث.‏ وزاد:\" ومن صور صورة، عذب، وكلف أن ينفخ فيها، وليس بنافخ\".‏","english":{"narrator":"Ibn ’Abbas (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“If anyone listened to the talk of some people, when they do not like him to do that, then molten led will be poured into his ears on the Day of Resurrection.” Related by Al-Bukhari."}},{"id":74,"idInBook":74,"chapterId":16,"bookId":17,"arabic":"وَعَنْ أَنَسٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ طُوبَى لِمَنْ شَغَلَهُ عَيْبَهُ عَنْ عُيُوبِ اَلنَّاسِ }  أَخْرَجَهُ اَلْبَزَّارُ بِإِسْنَادٍ حَسَنٍ.‏  1‏ .‏‏1 ‏- ضعيف جدا وله شواهد، ولكنها كلها ضعيفة ‏-أيضا‏- كما قال الحافظ العراقي.‏","english":{"narrator":"Anas (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“Blessed is he who is preoccupied with his defects rather than those of other people.” Related by Al-Bazzar with a good chain of narrators."}},{"id":75,"idInBook":75,"chapterId":16,"bookId":17,"arabic":"وَعَنْ اِبْنِ عُمَرَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ تَعَاظَمَ فِي نَفْسِهِ, وَاخْتَالَ فِي مِشْيَتِهِ, لَقِيَ اَللَّهَ وَهُوَ عَلَيْهِ غَضْبَانُ }  أَخْرَجَهُ اَلْحَاكِمُ وَرِجَالُهُ ثِقَاتٌ.‏  1‏ .‏‏1 ‏- صحيح.‏ رواه الحاكم (1 / 60)‏، والبخاري في\" الأدب المفرد\" (549)‏.‏","english":{"narrator":"Ibn 'Umar (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“Whoever exalts himself and walks proudly; Allah will be angry with him when he meets Him (on the Day of Resurrection).” Related Al-Hakim with a reliable chain of narrators."}},{"id":76,"idInBook":76,"chapterId":16,"bookId":17,"arabic":"وَعَنْ سَهْلِ بْنِ سَعْدٍ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ اَلْعَجَلَةُ مِنَ اَلشَّيْطَانِ }  أَخْرَجَهُ اَلتِّرْمِذِيُّ, وَقَالَ: حَسَنٌ.‏  1‏ .‏‏1 ‏- ضعيف.‏ رواه الترمذي (2012)‏ من طريق عبد المهيمن بن عباس بن سهل بن سعد الساعدي، عن أبيه، عن جده، به.‏ وزاد في أوله:\" الأناة من الله.‏.‏.‏.‏\".‏ وكذا نقل الحافظ هنا التحسين عن الترمذي، ونقل عنه صاحب\" التحفة\" (4 / 129)‏:\" حسن غريب\".‏ والذي في المطبوع قوله:\" هذا حديث غريب، وقد تكلم بعض أهل الحديث في عبد المهيمن بن عباس بن سهل، وضعفه من قبل حفظه.‏","english":{"narrator":"Sahl bin Sa’d (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“Haste comes from Satan.” Related by At-Tirmidhi who graded is as Hasan."}},{"id":77,"idInBook":77,"chapterId":16,"bookId":17,"arabic":"وَعَنْ عَائِشَةَ ‏-رَضِيَ اَللَّهُ عَنْهَا‏- قَالَتْ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { اَلشُّؤْمُ: سُوءُ اَلْخُلُقِ }  أَخْرَجَهُ أَحْمَدُ وَفِي إِسْنَادِهِ ضَعْفٌ.‏  1‏ .‏‏1 ‏- ضعيف.‏ رواه أحمد (6 / 85)‏ وسنده ضعيف، وقد روي الحديث من طرق أخرى لكنها ضعيفة كلها؛ ولهذا قال العراقي:\" حديث لا يصح\".‏","english":{"narrator":"'A'ishah (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“Pessimism is part of bad character.” Related by Ahmad with a weak chain of narrators."}},{"id":78,"idInBook":78,"chapterId":16,"bookId":17,"arabic":"وَعَنْ أَبِي اَلدَّرْدَاءِ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِنَّ اَللَّعَّانِينَ لَا يَكُونُونَ شُفَعَاءَ, وَلَا شُهَدَاءَ يَوْمَ اَلْقِيَامَةِ }  أَخْرَجَهُ مُسْلِمٌ.‏  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم (2589)‏ (86)‏.‏","english":{"narrator":"Abu ad-Darda’ (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“Men accustomed to cursing will not be intercessors or witnesses on the Day of Resurrection.” Related by Muslim."}},{"id":79,"idInBook":79,"chapterId":16,"bookId":17,"arabic":"وَعَنْ مُعَاذِ بْنِ جَبَلٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ عَيَّرَ أَخَاهُ بِذَنْبٍ, لَمْ يَمُتْ حَتَّى يَعْمَلَهُ }  أَخْرَجَهُ اَلتِّرْمِذِيُّ وَحَسَّنَهُ, وَسَنَدُهُ مُنْقَطِعٌ.‏  1‏ .‏‏1 ‏- موضوع.‏ رواه الترمذي (2505)‏ من طريق خال بن معدان عن معاذ.‏ وقال:\" حديث حسن غريب، وليس إسناده بمتصل، وخالد بن معدان لم يدرك معاذ بن جبل\".‏ قلت: وفي سند محمد بن الحسن الهمداني وهو\" كذاب\".‏","english":{"narrator":"Mu'adh bin Jabal (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“If anyone disgraces his brother for a sin, he will not die before committing it himself.” Related At-Tirmidhi who graded it to be Hasan."}},{"id":80,"idInBook":80,"chapterId":16,"bookId":17,"arabic":"وَعَنْ بَهْزِ بْنِ حَكِيمٍ, عَنْ أَبِيهِ, عَنْ جَدِّهِ: قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ وَيْلٌ لِلَّذِي يُحَدِّثُ, فَيَكْذِبُ ; لِيَضْحَكَ بِهِ اَلْقَوْمُ, وَيْلٌ لَهُ, ثُمَّ وَيْلٌ لَهُ }  أَخْرَجَهُ اَلثَّلَاثَةُ, وَإِسْنَادُهُ قَوِيٌّ.‏  1‏ .‏‏1 ‏- حسن.‏ رواه أبو داود (4990)‏ والنسائي في\" التفسير\" (146 و 675)‏.‏ والترمذي (2315)‏، وقال الترمذي:\" هذا حديث حسن.‏","english":{"narrator":"Bahz bin Hakim narrated on the authority of his father, on the authority of his grandfather (RAA) that the Messenger of Allah (ﷺ) said:","text":"“Woe to him who lies in his talk to make the people laugh, Woe to him! Woe to him!” Related by the three Imams with a strong chain of narrators."}},{"id":81,"idInBook":81,"chapterId":16,"bookId":17,"arabic":"وَعَنْ أَنَسٍ ‏- رضى الله عنه ‏- عَنْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { كَفَّارَةٌ مَنْ اِغْتَبْتَهُ أَنْ تَسْتَغْفِرَ لَهُ }  رَوَاهُ اَلْحَارِثُ بْنُ أَبِي أُسَامَةَ بِسَنَدٍ ضَعِيفٍ.‏  1‏ .‏‏1 ‏- موضوع ففي سند عنبسة بن عبد الرحمن القرشي، وكان يضع الحديث.‏","english":{"narrator":"Anas (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“The atonement of backbiting a man is to ask Allah to forgive him.” Related by Al-Harith bin Abu Usamah with a weak chain of narrators."}},{"id":82,"idInBook":82,"chapterId":16,"bookId":17,"arabic":"وَعَنْ عَائِشَةَ ‏-رَضِيَ اَللَّهُ عَنْهَا‏- قَالَتْ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ أَبْغَضُ اَلرِّجَالِ إِلَى اَللَّهِ اَلْأَلَدُّ اَلْخَصِمُ }  أَخْرَجَهُ مُسْلِمٌ.‏  1‏‏1 ‏- صحيح رواه مسلم (2668)‏ ، وزاد في أوله \"إن\" .‏ والحديث رواه البخاري (7188)‏ فكان الأولى بالحافظ رحمه الله أن يقول : : متفق عليه \" .‏","english":{"narrator":"'A’ishah (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“The most despicable amongst people in the sight of Allah is the ruthless argumentative (person).” Related by Muslim."}},{"id":83,"idInBook":83,"chapterId":16,"bookId":17,"arabic":"عَنِ اِبْنِ مَسْعُودٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ عَلَيْكُمْ بِالصِّدْقِ, فَإِنَّ اَلصِّدْقَ يَهْدِي إِلَى اَلْبِرِّ, وَإِنَّ اَلْبِرَّ يَهْدِي إِلَى اَلْجَنَّةِ, وَمَا يَزَالُ اَلرَّجُلُ يَصْدُقُ, وَيَتَحَرَّى اَلصِّدْقَ, حَتَّى يُكْتَبَ عِنْدَ اَللَّهِ صِدِّيقًا, وَإِيَّاكُمْ وَالْكَذِبَ, فَإِنَّ اَلْكَذِبَ يَهْدِي إِلَى اَلْفُجُورِ, وَإِنَّ اَلْفُجُورَ يَهْدِي إِلَى اَلنَّارِ, وَمَا يَزَالُ اَلرَّجُلُ يَكْذِبُ, وَيَتَحَرَّى اَلْكَذِبَ, حَتَّى يُكْتَبَ عِنْدَ اَللَّهِ كَذَّابًا }  مُتَّفَقٌ عَلَيْهِ .‏  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم (2668)‏، وزاد في أوله:\" إن\" والحديث رواه البخاري (7188)‏ فكان الأولى بالحافظ ‏-رحمه الله‏- أن يقول:\" متفق عليه\".‏","english":{"narrator":"Ibn Mas'ud (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“Adhere (you people) to truth, for truth leads to good deeds and good deeds lead to Paradise, and if a man continues to speak the truth and makes truth his object he will be recorded as truthful before Allah. Avoid (you people) falsehood, for falsehood leads to wickedness and wickedness leads to Hell, and if a man continues to speak falsehood and makes falsehood his object he will be recorded as a liar before Allah.” Agreed upon."}},{"id":84,"idInBook":84,"chapterId":16,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { إِيَّاكُمْ وَالظَّنَّ, فَإِنَّ اَلظَّنَّ أَكْذَبُ اَلْحَدِيثِ }  مُتَّفَقٌ عَلَيْهِ .‏  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (6094)‏، ومسلم (2607)‏ (105)‏ والسياق لمسلم.‏","english":{"narrator":"Abu Hurairah (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“Beware of suspicion, for suspicion amounts to the worst form of lying.” Agreed upon."}},{"id":85,"idInBook":85,"chapterId":16,"bookId":17,"arabic":"وَعَنْ أَبِي سَعِيدٍ اَلْخُدْرِيِّ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِيَّاكُمْ وَالْجُلُوسَ بِالطُّرُقَاتِ.‏ \nقَالُوا: يَا رَسُولَ اَللَّهِ! مَا لَنَا بُدٌّ مِنْ مَجَالِسِنَا; نَتَحَدَّثُ فِيهَا.‏ \nقَالَ\n\" فَأَمَّا إِذَا أَبَيْتُمْ, فَأَعْطُوا اَلطَّرِيقَ حَقَّهُ.‏ \nقَالُوا: وَمَا حَقُّهُ? \nقَالَ:\" غَضُّ اَلْبَصَرِ, وَكَفُّ اَلْأَذَى, وَرَدُّ اَلسَّلَامِ, وَالْأَمْرُ بِالْمَعْرُوفِ, وَالنَّهْيُ عَنْ اَلْمُنْكَرِ.‏ } مُتَّفَقٌ عَلَيْهِ .‏ 1‏ .‏‏1 ‏- صحيح رواه البخاري (6229)‏، ومسلم (2121)‏.‏","english":{"narrator":"Abu Said al-Khudri (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“Avoid sitting by the road side.” The people then said, ‘O Allah‘s Messenger (ﷺ), we cannot do without those meeting places in which we converse” So he said, “Well, if you insist (on that) give the road its due rights.” They asked, ‘What are the road’s due rights?’ He replied, “Lowering your gaze, abstaining from anything offensive, returning salutations, enjoining the right (Ma'ruf) and forbidding from evil deeds (Munkar).” Agreed upon."}},{"id":86,"idInBook":86,"chapterId":16,"bookId":17,"arabic":"وَعَنْ مُعَاوِيَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ يُرِدِ اَللَّهُ بِهِ خَيْرًا, يُفَقِّهْهُ فِي اَلدِّينِ }  مُتَّفَقٌ عَلَيْهِ .‏  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (71)‏، ومسلم (1037)‏.‏","english":{"narrator":"Mu’awiyah (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“When Allah wishes good for anyone, He bestows upon him the Fiqh (comprehension) of the religion.” Agreed upon."}},{"id":87,"idInBook":87,"chapterId":16,"bookId":17,"arabic":"وَعَنْ أَبِي اَلدَّرْدَاءِ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَا مِنْ شَيْءٍ فِي اَلْمِيزَانِ أَثْقَلُ مِنْ حُسْنِ اَلْخُلُقِ }  أَخْرَجَهُ أَبُو دَاوُدَ, وَاَلتِّرْمِذِيُّ وَصَحَّحَهُ .‏  1‏ .‏‏1 ‏- صحيح.‏ رواه أبو داود (4799)‏، وهو طرف من الحديث السابق (1502)‏.‏","english":{"narrator":"Abu ad-Darda’ (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“The heaviest thing which will be put on the believer’s scale (on the Day of Resurrection) will be good morals.” Related by Abu Dawud and At-Tirmidhi who graded it as Sahih."}},{"id":88,"idInBook":88,"chapterId":16,"bookId":17,"arabic":"وَعَنِ اِبْنِ عُمَرَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ اَلْحَيَاءُ مِنْ اَلْإِيمَانِ }  مُتَّفَقٌ عَلَيْهِ .‏  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (24)‏، ومسلم (36)‏.‏","english":{"narrator":"Ibn 'Umar (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“Haya (modesty, bashfulness etc.) is a part of Faith.” Agreed upon."}},{"id":89,"idInBook":89,"chapterId":16,"bookId":17,"arabic":"وَعَنْ أَبِي مَسْعُودٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِنَّ مِمَّا أَدْرَكَ اَلنَّاسُ مِنْ كَلَامِ اَلنُّبُوَّةِ اَلْأُولَى: إِذَا لَمْ تَسْتَحِ, فَاصْنَعْ مَا شِئْتَ }  أَخْرَجَهُ اَلْبُخَارِيُّ .‏  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (6120)‏ وأما قول صاحب\" السبل\" بأن لفظ\" الأولى\" ليس في البخاري، فهو من أوهامه.‏","english":{"narrator":"Ibn Mas’ud (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“One of the things people have learned from the words of the earliest prophecies is, “If you don’t feel any shame, do whatever you like.” Related by Al-Bukhari."}},{"id":90,"idInBook":90,"chapterId":16,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ اَلْمُؤْمِنُ اَلْقَوِيُّ خَيْرٌ وَأَحَبُّ إِلَى اَللَّهِ مِنْ اَلْمُؤْمِنِ اَلضَّعِيفِ, وَفِي كُلٍّ خَيْرٌ, اِحْرِصْ عَلَى مَا يَنْفَعُكَ, وَاسْتَعِنْ بِاَللَّهِ, وَلَا تَعْجَزْ, وَإِنْ أَصَابَكَ شَيْءٌ فَلَا تَقُلْ: لَوْ أَنِّي فَعَلْتُ كَانَ كَذَا وَكَذَا, وَلَكِنْ قُلْ: قَدَّرَ اَللَّهُ وَمَا شَاءَ فَعَلَ; فَإِنَّ لَوْ تَفْتَحُ عَمَلَ اَلشَّيْطَانِ }  أَخْرَجَهُ مُسْلِمٌ .‏  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم (2664)‏.‏","english":{"narrator":"Abu Hurairah (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“A believer who is strong (and healthy) is better and dearer to Allah than the weak believer, but there is goodness in both of them. Be keen on what benefits you and seek help from Allah, and do not give up. If anything afflicts you do not say, ‘If I had done such and such things, such and such would have happened.’ But say, ‘Allah decrees and what He wills He does,’ for (the utterance) ‘If I had’ provides an opening for the deeds of the devil.” Related by Muslim."}},{"id":91,"idInBook":91,"chapterId":16,"bookId":17,"arabic":"وَعَنْ عِيَاضِ بْنِ حِمَارٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِنَّ اَللَّهَ أَوْحَى إِلَيَّ أَنْ تَوَاضَعُوا, حَتَّى لَا يَبْغِيَ أَحَدٌ عَلَى أَحَدٍ, وَلَا يَفْخَرَ أَحَدٌ عَلَى أَحَدٍ }  أَخْرَجَهُ مُسْلِمٌ .‏  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم (2865)‏ (64)‏.‏","english":{"narrator":"’Iyad bin Himar (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“Allah, the Most High has revealed to me that you (people) should be humble, so that no one transgresses another, or boasts to the other.” Related by Muslim."}},{"id":92,"idInBook":92,"chapterId":16,"bookId":17,"arabic":"وَعَنْ أَبِي اَلدَّرْدَاءِ ‏- رضى الله عنه ‏- عَنْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { مَنْ رَدَّ عَنْ عِرْضِ أَخِيهِ بِالْغَيْبِ, رَدَّ اَللَّهُ عَنْ وَجْهِهِ اَلنَّارَ يَوْمَ اَلْقِيَامَةِ }  أَخْرَجَهُ اَلتِّرْمِذِيُّ, وَحَسَّنَهُ .‏  1‏ .‏‏1 ‏- حسن.‏ رواه الترمذي (1931)‏، وقال:\" هذا حديث حسن\".‏ قلت: ويشهد له ما بعده.‏","english":{"narrator":"Abu ad-Darda’ (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“If a Muslim defends his brother’s honor in his absence, Allah will protect his face from the fire of Hell on the Day of Resurrection.” Related by At-Tirmidhi who graded it to be Hasan."}},{"id":93,"idInBook":93,"chapterId":16,"bookId":17,"arabic":"وَلِأَحْمَدَ, مِنْ حَدِيثِ أَسْمَاءَ بِنْتِ يَزِيدَ نَحْوُهُ .‏  1‏ .‏‏1 ‏- حسن.‏ رواه أحمد (6 / 461)‏‏- بسند ضعيف، لكنه حسن بما قبله‏- ولفظه:\" من ذب عن لحم أخيه في الغيبة، كان حقا على الله أن يعتقه من النار\".‏","english":{"narrator":"","text":"Ahmad related a similar hadith on the authority of Asma the daughter of Yazid."}},{"id":94,"idInBook":94,"chapterId":16,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَا نَقَصَتْ صَدَقَةٌ مِنْ مَالٍ, وَمَا زَادَ اَللَّهُ عَبْدًا بِعَفْوٍ إِلَّا عِزًّا, وَمَا تَوَاضَعَ أَحَدٌ لِلَّهِ إِلَّا رَفَعَهُ }  أَخْرَجَهُ مُسْلِمٌ .‏  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم (2588)‏ وزاد:\" الله\".‏","english":{"narrator":"Abu Hurairah (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“Sadaqah does not decrease property and Allah increases the honor of him who forgives and no one will humble himself for Allah’s sake except that Allah raises his status.” Related by Muslim."}},{"id":95,"idInBook":95,"chapterId":16,"bookId":17,"arabic":"وَعَنْ عَبْدِ اَللَّهِ بْنِ سَلَّامٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ يَا أَيُّهَا اَلنَّاسُ! أَفْشُوا اَلسَّلَام, وَصِلُوا اَلْأَرْحَامَ, وَأَطْعِمُوا اَلطَّعَامَ, وَصَلُّوا بِاللَّيْلِ وَالنَّاسُ نِيَامٌ, تَدْخُلُوا اَلْجَنَّةَ بِسَلَامٍ }  أَخْرَجَهُ اَلتِّرْمِذِيُّ وَصَحَّحَهُ .‏  1‏ .‏‏1 ‏- صحيح.‏ رواه الترمذي (2485)‏ عن عبد الله بن سلام قال:\" لما قدم رسول الله ‏-صلى الله عليه وسلم‏- المدينة انجفل الناس إليه، وقيل: قدم رسول الله ‏-صلى الله عليه وسلم‏-.‏ قدم رسول الله ‏-صلى الله عليه وسلم‏-، فجئت في الطريق لأنظر إليه، فلما استثبت وجه رسول الله ‏-صلى الله عليه وسلم‏- عرفت أن وجهه ليس بوجه كذاب، وكان أول شيء تكلم به، أن قال فذكره، وقال:\" هذا حديث صحيح\".‏","english":{"narrator":"'Abdullah bin Salam (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“O people, extend greetings (saying Salam to each other), keep relations with your kin, provide food (to people) and pray at night when people are asleep and you will enter Paradise in peace.” Related by At-Tirmidhi who graded it as Sahih."}},{"id":96,"idInBook":96,"chapterId":16,"bookId":17,"arabic":"وَعَنْ تَمِيمٍ الدَّارِيِّ ‏- رضى الله عنه ‏- قَالَ: قَالَ ‏- صلى الله عليه وسلم ‏-{ اَلدِّينُ اَلنَّصِيحَةُ\n\" ثَلَاثًا.‏ قُلْنَا: لِمَنْ يَا رَسُولَ اَللَّهِ? قَالَ:\" لِلَّهِ وَلِكِتَابِهِ وَلِرَسُولِهِ وَلِأَئِمَّةِ اَلْمُسْلِمِينَ وَعَامَّتِهِمْ }  أَخْرَجَهُ مُسْلِمٌ .‏  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم (55)‏ وليس عنده لفظ:\" ثلاثا\" ولا كررت جملة:\" الدين النصيحة\"، وإن جاء ذلك عند غيره إما إشارة أو تكرارا، كما وقع ذلك ‏-أيضا‏- في غير حديث تميم.‏","english":{"narrator":"Tamim ad-Dari (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“The religion is Nasihah.” the people said, ‘To whom should it be directed?’ He replied, “To Allah, His Book, His Messenger (ﷺ), to the leaders of the Muslims and to the common folk of the Muslims.” Related by Muslim."}},{"id":97,"idInBook":97,"chapterId":16,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ أَكْثَرُ مَا يُدْخِلُ اَلْجَنَّةَ تَقْوى اَللَّهِ وَحُسْنُ اَلْخُلُقِ }  أَخْرَجَهُ اَلتِّرْمِذِيُّ, وَصَحَّحَهُ اَلْحَاكِمُ .‏  1‏ .‏‏1 ‏- حسن.‏ رواه الترمذي (2004)‏ وابن ماجه (4246)‏، والحاكم (4 / 324)‏ وعندهم أن النبي ‏-صلى الله عليه وسلم‏- سئل عن أكثر ما يدخل الجنة؟ فقال:\" تقوى الله.‏.‏.‏.‏.‏\" الحديث.‏ وزادوا:\" وسئل عن أكثر ما يدخل الناس النار؟ فقال الفم والفرج\" ، وقال الترمذي:\" هذا حديث صحيح غريب\"، وقال الحاكم\" صحيح الإسناد\"، قلت: حسبه الحسن، ففيه يزيد بن عبد الرحمن الأودي لم يوثقه إلا العجلي وابن حبان؛ ولذلك قال الذهبي في\" الكاشف\":\" وثق\".‏","english":{"narrator":"Abu Hurairah (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“The fear of Allah and good morals (Akhlaq) are the two major characteristics which lead to Paradise.” Related by At-Tirmidhi and Al-Hakim graded it as Sahih."}},{"id":98,"idInBook":98,"chapterId":16,"bookId":17,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِنَّكُمْ لَا تَسَعُونَ اَلنَّاسَ بِأَمْوَالِكُمْ, وَلَكِنْ لِيَسَعْهُمْ بَسْطُ اَلْوَجْهِ, وَحُسْنُ اَلْخُلُقِ }  أَخْرَجَهُ أَبُو يَعْلَى, وَصَحَّحَهُ اَلْحَاكِمُ .‏  1‏ .‏‏1 ‏- ضعيف جدا.‏ رواه الحاكم (1 / 124)‏ وفي سنده عبد الله بن سعيد المقبري، وهو\" متروك\".‏","english":{"narrator":"Abu Hurairah (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“You (people) cannot satisfy people with your wealth, but satisfy them with your cheerful faces and good morals.” Related by Abu Ya’la and Al-Hakim graded it as Sahih."}},{"id":99,"idInBook":99,"chapterId":16,"bookId":17,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ اَلْمُؤْمِنُ مِرْآةُ اَلْمُؤْمِنِ }  أَخْرَجَهُ أَبُو دَاوُدَ بِإِسْنَادٍ حَسَنٍ .‏  1‏ .‏‏1 ‏- .‏ حسن.‏ رواه أبو داود (4918)‏ وزاد:\" والمؤمن أخو المؤمن: يكف عليه ضيعته، ويحوطه من ورائه\".‏","english":{"narrator":"Abu Hurairah (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“Every believer is the mirror of his brother.” Related by Abu Dawud with a good chain of narrators."}},{"id":100,"idInBook":100,"chapterId":16,"bookId":17,"arabic":"وَعَنِ اِبْنِ عُمَرَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ اَلْمُؤْمِنُ اَلَّذِي يُخَالِطُ اَلنَّاسَ, وَيَصْبِرُ عَلَى أَذَاهُمْ خَيْرٌ مِنْ اَلَّذِي لَا يُخَالِطُ اَلنَّاسَ وَلَا يَصْبِرُ عَلَى أَذَاهُمْ }  أَخْرَجَهُ اِبْنُ مَاجَهْ بِإِسْنَادٍ حَسَنٍ, وَهُوَ عِنْدَ اَلتِّرْمِذِيِّ: إِلَّا أَنَّهُ لَمْ يُسَمِّ اَلصِّحَابِيَّ .‏  1‏ .‏‏1 ‏- صحيح.‏ وإن كان على صنيع الحافظ هنا ‏-رحمه الله‏- مؤاخذات، فالحديث بهذا اللفظ رواه البخاري في\" الأدب المفرد\" (388)‏ بسند صحيح، وأما ابن ماجه (4032)‏ فسنده ضعيف ‏-وليس حسنا كما قال الحافظ‏- إذ فيه عبد الواحد بن صالح، وهو\"مجهول\" باعتراف الحافظ نفسه في\" التقريب\" وعنده لفظ:\" أعظم أجرا\" بدل لفظ\"خير\"، والباقي مثله، وأما الترمذي (2507)‏ فقال: عن شيخ من أصحاب النبي ‏-صلى الله عليه وسلم‏-، عن النبي ‏-صلى الله عليه وسلم‏- قال:\" المسلم إذا كان مخالطا للناس.‏.‏.‏.‏.‏.‏ المسلم.‏.‏.‏.‏.‏\"، ثم قال أبو موسى محمد بن المثنى: قال ابن أبي عدي: كان شعبة يرى أنه ابن عمر.‏","english":{"narrator":"Ibn ’Umar (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“A believer who mixes with people and endures their annoyance is better than the one who does not mix with them and does not endure their annoyance.” Related by Ibn Majah with a good chain of narrators. At-Tirmidhi reported the hadith without mentioning the Companion."}},{"id":101,"idInBook":101,"chapterId":16,"bookId":17,"arabic":"وَعَنِ اِبْنِ مَسْعُودٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ اَللَّهُمَّ كَمَا أَحْسَنْتَ خَلْقِي, فَحَسِّنْ خُلُقِي }  رَوَاهُ أَحْمَدُ وَصَحَّحَهُ اِبْنُ حِبَّان َ  1‏ .‏‏1 ‏- صحيح.‏ رواه أحمد (1 / 403)‏، وابن حبان (959)‏، وله شاهد رواه أحمد (6 / 68 و 155)‏ عن عائشة ‏-رضي الله عنها‏- بسند صحيح.‏\" تنبيه\": هذا دعاء مطلق يدعو به المسلم في أي وقت شاء، وأما ما ورد في بعض طرق هذا الحديث من تخصيص هذا الدعاء عند النظر في المرآة، فهذا مما لم يصح، وانظر الإرواء رقم (74)‏ لشيخنا علامة العصر ‏-حفظه المولى عز وجل، وأعلى درجته، وكبت شانئيه‏-.‏","english":{"narrator":"","text":"Ibn Mas’ud (RAA) narrated that the Messenger of Allah (ﷺ) Said, “O Allah You have made my creation perfect, so make my moral characteristics also be the best.”"}},{"id":102,"idInBook":102,"chapterId":16,"bookId":17,"arabic":"عَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ يَقُولُ اَللَّهُ ‏-تَعَالَى‏-: أَنَا مَعَ عَبْدِي مَا ذَكَرَنِي, وَتَحَرَّكَتْ بِي شَفَتَاهُ }  أَخْرَجَهُ ابْنُ مَاجَهْ, وَصَحَّحَهُ ابْنُ حِبَّانَ, وَذَكَرَهُ اَلْبُخَارِيُّ تَعْلِيقًا .‏  1‏ .‏‏1 ‏- صحيح.‏ رواه ابن ماجه (3792)‏، وابن حبان (815)‏ موصولا بسند صحيح، وعلقه البخاري (13 / 499 / فتح)‏ بصيغة الجزم.‏","english":{"narrator":"Abu Hurairah (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“Allah, the Most High says: ‘l am with my slave when he remembers me and his lips move with my mention.” Related by Ibn Majah and Ibn Hibban graded it as Sahih."}},{"id":103,"idInBook":103,"chapterId":16,"bookId":17,"arabic":"وَعَنْ مُعَاذِ بْنِ جَبَلٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَا عَمِلَ ابْنُ آدَمَ عَمَلاً أَنْجَى لَهُ مِنْ عَذَابِ اَللَّهِ مِنْ ذِكْرِ اَللَّهِ }  أَخْرَجَهُ ابْنُ أَبِي شَيْبَةَ, وَالطَّبَرَانِيُّ بِإِسْنَادٍ حَسَنٍ .‏  1‏ .‏‏1 ‏- ضعيف.‏ رواه ابن أبي شيبة في\" المصنف\" (10 / 300)‏، والطبراني في\" الكبير\" (20 / 166 / 167)‏ حدثنا أبو خالد الأحمر، عن يحيي بن سعيد، عن أبي الزبير، عن طاووس، عن معاذ، به.‏ وزاد:\" قالوا ولا الجهاد في سبيل الله؟ قال: ولا الجهاد في سبيل الله.‏ إلا أن تضرب بسفك حتى ينقطع\".‏ قلت: وأبو الزبير مدلس، وقد عنعنه، وطاووس لم يسمع من معاذ كما في\" المراسيل\" لابن أبي حاتم، وإنما حسن الحافظ إسناده من أجل سليمان بن حيان أبي خالد الأحمر، فقد قال عنه في\" التقريب\":\" صدوق يخطئ\" وإنما علة الحديث ما سبق من الانقطاع، ولا ينفي ذلك أن يكون قد أخطأ فيه أبو خالد الأحمر، فقد رواه الطبراني في\" الصغير\" (209)‏ من طريقه، عن يحيي بن سعيد الأنصاري، عن جابر، به!.‏","english":{"narrator":"Mu’adh Ibn Jabal (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“A man does nothing to rescue himself from Allah’s punishment better than remembering Allah.” Related by Ibn Abi Shaibah and At-Tabarani with a good chain of narrators."}},{"id":104,"idInBook":104,"chapterId":16,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَا جَلَسَ قَوْمٌ مَجْلِسًا, يَذْكُرُونَ اَللَّهَ إِلَّا حَفَّتْ بِهِمُ الْمَلَائِكَةُ, وَغَشِيَتْهُمُ الرَّحْمَةُ, وَذَكَرَهُمُ اللَّهُ فِيمَنْ عِنْدَهُ }  أَخْرَجَهُ مُسْلِم ٌ  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم (2700)‏ عن أبي هريرة وأبي سعيد، بلفظ:\" لا يقعد قوم يذكرون الله ‏-عز وجل‏-، إلا حفتهم.‏.‏.‏.‏.‏.‏.‏.‏\".‏ والباقي مثله.‏","english":{"narrator":"Abu Hurairah (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“People will not sit in an assembly in which they remember Allah without the angels surrounding them, mercy covering them, and Allah mentioning them among those who are with Him.” Related by Muslim."}},{"id":105,"idInBook":105,"chapterId":16,"bookId":17,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَا قَعَدَ قَوْمٌ مَقْعَدًا لَمْ يَذْكُرُوا اَللَّهَ, وَلَمْ يُصَلُّوا عَلَى اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-إِلَّا كَانَ عَلَيْهِمْ حَسْرَةً يَوْمَ اَلْقِيَامَةِ }  أَخْرَجَهُ اَلتِّرْمِذِيُّ, وَقَالَ:\n\"حَسَنٌ\" .‏  1‏ .‏‏1 ‏- صحيح.‏ رواه الترمذي (3380)‏، لكن بلفظ:\" ما جلس قوم مجلسا لم يذكروا الله فيه، ولم يصلوا على نبيهم، إلا كان عليهم ترة، فإن شاء عذبهم وإن شاء غفر لهم\"، وقال:\" هذا حديث حسن صحيح\"، واللفظ الذي ذكره الحافظ هنا هو لأحمد في\" المسند\" (2 / 463)‏ حرفا حرفا، وزاد:\" وإن دخلوا الجنة للثواب\".‏","english":{"narrator":"Abu Hurairah (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“If people sit in an assembly in which they do not remember Allah or invoke blessings on the Prophet it will be a cause of grief to them on the Day of Resurrection.” Related by At-Tirmidhi who graded it as Hasan."}},{"id":106,"idInBook":106,"chapterId":16,"bookId":17,"arabic":"وَعَنْ أَبِي أَيُّوبَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ قَالَ: لَا إِلَهَ إِلَّا اَللَّهُ, وَحْدَهُ لَا شَرِيكَ لَهُ عَشْرَ مَرَّاتٍ, كَانَ كَمَنْ أَعْتَقَ أَرْبَعَةَ أَنْفُسٍ مِنْ وَلَدِ إِسْمَاعِيلَ }  مُتَّفَقٌ عَلَيْهِ .‏  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (6404)‏، ومسلم (2693)‏، وفي قول الحافظ:\" متفق عليه\" نظر، فهذا اللفظ لمسلم، وعنده زيادة:\" له الملك، وله الحمد، وهو على كل شيء قدير\"، وأما البخاري فقد ساقه مختصرا تحت باب فضل التهليل.‏ بلفظ:\" من قال عشرا كما كان أعتق رقبة من ولد إسماعيل\".‏","english":{"narrator":"Abu Aiyub al-Ansari (RAA) narrated, ‘The Messenger of Allah (ﷺ) said:","text":"“Whoever says ten times: ‘None has the right to be worshipped except Allah alone, without partner, to Him belongs all sovereignty and praise. He gives life and causes death. He is over all things, Omnipotent will have a reward equivalent to that of emancipating four of the descendants of lsma'il from slavery.” Agreed upon."}},{"id":107,"idInBook":107,"chapterId":16,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ قَالَ: سُبْحَانَ اَللَّهِ وَبِحَمْدِهِ مِائَةَ مَرَّةٍ حُطَّتْ خَطَايَاهُ, وَإِنْ كَانَتْ مِثْلَ زَبَدِ اَلْبَحْرِ }  مُتَّفَقٌ عَلَيْهِ .‏  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (6405)‏، وهو قطعة من حديث عند مسلم (2691)‏، وعندهما تقييد ذلك بقوله ‏-صلى الله عليه وسلم‏-:\" في يوم\".‏","english":{"narrator":"Abu Hurairah (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“Whoever says a hundred times, ‘How perfect Allah is and I praise Him,’ his sins will be forgiven though they may be as much as the foam of the sea.” Agreed upon."}},{"id":108,"idInBook":108,"chapterId":16,"bookId":17,"arabic":"وَعَنْ جُوَيْرِيَةَ بِنْتِ اَلْحَارِثِ قَالَتْ: قَالَ لِي رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَقَدْ قُلْتُ بَعْدَكِ أَرْبَعَ كَلِمَاتٍ, لَوْ وُزِنَتْ بِمَا قُلْتِ مُنْذُ اَلْيَوْمِ لَوَزَنَتْهُنَّ: سُبْحَانَ اَللَّهِ وَبِحَمْدِهِ, عَدَدَ خَلْقِهِ, وَرِضَا نَفْسِهِ, وَزِنَةَ عَرْشِهِ, وَمِدَادَ كَلِمَاتِهِ }  أَخْرَجَهُ مُسْلِمٌ .‏  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم (2726)‏ عن جويرية أن النبي ‏-صلى الله عليه وسلم‏- خرج من عندها بكرة حين صلى الصبح، وهي في مسجدها، ثم رجع بعد أن أضحى، وهي جالسة، فقال:\" ما زلت على الحال التي فارقتك عليها؟ قالت: نعم.‏ قال النبي ‏-صلى الله عليه وسلم‏-:\" لقد قلت.‏.‏.‏.‏.‏.‏.‏.‏.‏\".‏ الحديث.‏","english":{"narrator":"Juairiyah bint al-Harith (RAA) narrated, ‘The Messenger of Allah (ﷺ) said to me, “Since leaving you have said four phrases which if weighed against all you have said today, would prove to be heavier:","text":"‘How perfect Allah is and I praise Him by the amount of His creation and His pleasure, and by the weight of His throne, and the ink of His words.” Related by Muslim."}},{"id":109,"idInBook":109,"chapterId":16,"bookId":17,"arabic":"وَعَنْ أَبِي سَعِيدٍ اَلْخُدْرِيِّ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ اَلْبَاقِيَاتُ اَلصَّالِحَاتُ: لَا إِلَهَ إِلَّا اَللَّهُ, وَسُبْحَانَ اَللَّهِ, وَاَللَّهُ أَكْبَرُ, وَالْحَمْدُ لِلَّهِ, وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاَللَّهِ }  أَخْرَجَهُ النَّسَائِيُّ, وَصَحَّحَهُ اِبْنُ حِبَّانَ, وَالْحَاكِمُ .‏  1‏ .‏‏1 ‏- ضعيف.‏ رواه النسائي في\"عمل اليوم والليلة\" كما في\"التحفة\" (3/ 362)‏، وابن حبان (840)‏، والحاكم (1 / 512)‏، وهو ضعيف؛ لأنه من رواية دارج، عن أبي الهيثم.‏","english":{"narrator":"Abu Sa'id al-Khudri (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“The lasting good deeds are: (the saying of) ‘None has the right to be worshipped except Allah alone, How perfect Allah is and Allah is great and all praise is for Allah, There is no might nor power except with Allah.” Related by An-Nasa’i. Ibn Hibban and Al-Hakim graded it as Sahih."}},{"id":110,"idInBook":110,"chapterId":16,"bookId":17,"arabic":"وَعَنْ سَمُرَةَ بْنِ جُنْدُبٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ أَحَبُّ اَلْكَلَامِ إِلَى اَللَّهِ أَرْبَعٌ, لَا يَضُرُّكَ بِأَيِّهِنَّ بَدَأْتَ: سُبْحَانَ اَللَّهِ, وَالْحَمْدُ لِلَّهِ, وَلَا إِلَهَ إِلَّا اَللَّهُ, وَاَللَّهُ أَكْبَرُ }  أَخْرَجَهُ مُسْلِمٌ .‏  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم (2137)‏ وزاد:\" ولا تسمين غلامك: يسارا ولا رباحا ولا نجيحا ولا أفلح، فإنك تقول، أثم هو؟ فلا يكون، فيقول: لا\".‏","english":{"narrator":"Samurah bin Jundub (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“The words dearer to Allah are four: ‘How perfect Allah is and all praise is for Allah. None has the right to be worshipped except Allah alone and Allah is great It does not matter which you say first.” Related by Muslim."}},{"id":111,"idInBook":111,"chapterId":16,"bookId":17,"arabic":"وَعَنْ أَبِي مُوسَى اَلْأَشْعَرِيِّ ‏- رضى الله عنه ‏- قَالَ: قَالَ لِي رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ يَا عَبْدَ اَللَّهِ بْنَ قَيْسٍ! أَلَّا أَدُلُّكَ عَلَى كَنْزٍ مِنْ كُنُوزِ اَلْجَنَّةِ? لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاَللَّهِ }  مُتَّفَقٌ عَلَيْه ِ  1‏‏1 ‏- صحيح.‏ رواه البخاري (6384)‏، ومسلم (2704)‏، والنسائي في\"عمل اليوم والليلة\" (356)‏ والسياق للنسائي.‏","english":{"narrator":"","text":"Abu Musa al-Ash'ari (RAA) narrated that the Messenger of Allah (ﷺ) said to me, “O 'Abdullah bin Qais, would you like to be guided to one of the treasures of Paradise.” l here is no might nor power except with Allah.’ Agreed upon."}},{"id":112,"idInBook":112,"chapterId":16,"bookId":17,"arabic":"زَادَ النَّسَائِيُّ: { وَلَا مَلْجَأَ مِنَ اللَّهِ إِلَّا إِلَيْهِ }   1‏‏1 ‏- كذا قال الحافظ، والمراد أن هذه الزيادة عند النسائي من حديث أبو موسى، ولكن لم أجدها من حديث أبي موسى مع العلم بأن النسائي روى حديث أبي موسى في أكثر من موضع، لكني وجدتها عنده في\" عمل اليوم والليلة\" من حديث أبي هريرة، برقم (358)‏، والله أعلم.‏","english":{"narrator":"","text":"An-Nasa’i added in his version, “there is no refuge from Allah except by turning to Him.’"}},{"id":113,"idInBook":113,"chapterId":16,"bookId":17,"arabic":"وَعَنِ النُّعْمَانِ بْنِ بَشِيرٍ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- عَنِ النَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { إِنَّ اَلدُّعَاءَ هُوَ اَلْعِبَادَةُ }  رَوَاهُ اَلْأَرْبَعَةُ, وَصَحَّحَهُ اَلتِّرْمِذِيُّ .‏  1‏‏1 ‏- صحيح.‏ رواه أبو داود (1479)‏، والنسائي في\" الكبرى\" (6 / 450)‏.‏ والترمذي (3247)‏، وابن ماجه (3828)‏، وزادوا ثم قرأ:\" وقال ربكم ادعوني استجب لكم إن الذين يستكبرون عن عبادتي سيدخلون جهنم داخرين\" غافر: 60 ، وقال الترمذي:\" هذا حديث حسن صحيح\".‏","english":{"narrator":"An-Nu’man bin al-Bashir (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“Verily supplication is worship.” Related by the four Imams and At-Tirmidhi graded it as Sahih,"}},{"id":114,"idInBook":114,"chapterId":16,"bookId":17,"arabic":"وَلَهُ مِنْ حَدِيثِ أَنَسٍ بِلَفْظِ: { اَلدُّعَاءُ مُخُّ اَلْعِبَادَةِ }   1‏ .‏‏1 ‏- ضعيف رواه الترمذي (3271)‏ وقال:\" هذا حديث غريب من هذا الوجه، لا نعرفه إلا من حديث ابن لهيعة\".‏ قلت: وهو صحيح بلفظ الحديث السابق، وأما بهذا اللفظ:\" مخ\" فهو ضعيف.‏","english":{"narrator":"Anas (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“Supplication is the pith of worship.” Related by At-Tirmidhi with a full chain of narrators."}},{"id":115,"idInBook":115,"chapterId":16,"bookId":17,"arabic":"وَلَهُ مِنْ حَدِيثِ أَبِي هُرَيْرَةَ رَفَعَهُ: { لَيْسَ شَيْءٌ أَكْرَمَ عَلَى اَللَّهِ مِنَ الدُّعَاءِ }  وَصَحَّحَهُ اِبْنُ حِبَّانَ, وَالْحَاكِمُ .‏  1‏ .‏‏1 ‏- حسن.‏ رواه الترمذي (3370)‏، وابن حبان (870)‏ والحاكم (1 / 490)‏.‏","english":{"narrator":"Abu Hurairah (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“Nothing is more honorable before Allah than supplication.” Related by At-Tirmidhi with a full chain of narrators. Ibn Hibban and Al-Hakim graded it as Sahih;."}},{"id":116,"idInBook":116,"chapterId":16,"bookId":17,"arabic":"وَعَنْ أَنَسٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ اَلدُّعَاءُ بَيْنَ اَلْأَذَانِ وَالْإِقَامَةِ لَا يُرَدُّ }  أَخْرَجَهُ النَّسَائِيُّ, وَغَيْرُهُ, وَصَحَّحَهُ اِبْنُ حِبَّانَ, وَغَيْرُهُ .‏  1‏ .‏‏1 ‏- صحيح.‏ رواه النسائي في\" عمل اليوم والليلة\"، ص (168)‏، وابن حبان (1696)‏، وفي الأصل زيادة تخريجه مع الكلام على ألفاظه.‏","english":{"narrator":"Anas (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“A supplication made between the Adhan and Iqamah is never rejected.” Related by An-Nasa’i and others, Ibn Hibban and others graded it as Sahih."}},{"id":117,"idInBook":117,"chapterId":16,"bookId":17,"arabic":"وَعَنْ سَلْمَانَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِنَّ رَبَّكُمْ حَيِيٌّ كَرِيمٌ, يَسْتَحِي مِنْ عَبْدِهِ إِذَا رَفَعَ إِلَيْهِ يَدَيْهِ أَنْ يَرُدَّهُمَا صِفَرًا }  أَخْرَجَهُ اَلْأَرْبَعَةُ إِلَّا النَّسَائِيَّ, وَصَحَّحَهُ اَلْحَاكِمُ .‏  1‏ .‏‏1 ‏- صحيح.‏ رواه أبو داود (1488)‏، والترمذي (3556)‏، وابن ماجه (3865)‏، والحاكم (1 / 497)‏.‏","english":{"narrator":"Salman (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“Your Rabb (Lord of the Universe) is Modest and Generous, and would never turn the hands of a slave without gain when he raises them to Him (in supplication).” Related by the four lmams except An-Nasa’i. Al-Hakim graded it as Sahih."}},{"id":118,"idInBook":118,"chapterId":16,"bookId":17,"arabic":"وَعَنْ عُمَرَ ‏- رضى الله عنه ‏- قَالَ: { كَانَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-إِذَا مَدَّ يَدَيْهِ فِي اَلدُّعَاءِ, لَمْ يَرُدَّهُمَا, حَتَّى يَمْسَحَ بِهِمَا وَجْهَهُ }  أَخْرَجَهُ اَلتِّرْمِذِيُّ .‏  1‏ .‏‏1 ‏- منكر.‏ رواه الترمذي (3386)‏ وقال:\" هذا حديث صحيح غريب، لا نعرفه إلا من حديث حماد بن عيسى، وقد تفرد به، وهو قليل الحديث، وقد حدث عنه الناس\".‏ قلت: وهو ضعيف، كما ذهب إلى ذلك الحافظ نفسه في\" التقريب\"، وقال أبو داود:\" ضعيف، روى أحاديث مناكير\".‏ قلت: وهذا الحديث لا شك أنه من تلك المناكير، إذ رفع اليدين في الدعاء ثابتة برواية الثقات، ولم يرد في شيء من ذلك مسح الوجه.‏","english":{"narrator":"","text":"'Umar (RAA) narrated, ‘When the Messenger of Allah (ﷺ) raised his hands in supplication, he did not lower them till he wiped his face with them.’ Related by At-Tirmidhi."}},{"id":119,"idInBook":119,"chapterId":16,"bookId":17,"arabic":"وَلَهُ شَوَاهِدُ مِنْهَا: \nحَدِيثُ اِبْنِ عَبَّاسٍ: عَنْ أَبِي دَاوُدَ .‏  1‏ وَمَجْمُوعُهَا يَقْتَضِي أَنَّهُ حَدِيثٌ حَسَنٌ .‏  2‏ .‏‏1 ‏- منكر كسابقه.‏ رواه أبو داود، ولفظه:\" لا تستروا الجدر، من نظر في كتاب أخيه بغير إذنه فإنما ينظر في النار، سلوا الله ببطون أكفكم، ولا تسألوه بظهورها، فإذا فرغتم فامسحوا بها وجوهكم\".‏ وقال أبو داود:\" روى هذا الحديث من غير وجه عن محمد بن كعب، كلها واهية، وهذا الطريق أمثلها، وهو ضعيف ‏-أيضا‏-\"، وقال أبو حاتم في: العلل\" (2 / 351)‏: \" هذا حديث منكر\" .‏‏2 ‏- قلت: كيف، وقد تقدم تضعيف أبي داود للحديث، وإنكار أبي حاتم؟! بل قال البيهقي في\" الكبرى\" (2 / 212)‏:\" فأما مسح اليدين بالوجه عند الفراغ من الدعاء، فلست أحفظه عن أحد من السلف في دعاء القنوت، وإن كان يروى عن بعضهم في الدعاء خارج الصلاة، وقد روي فيه عن النبي ‏-صلى الله عليه وسلم‏- حديث فيه ضعف\"، وقد أنكره الإمام مالك‏- أي: مسح الوجه‏- وكرهه سفيان، ولم يسمع أحمد فيه بشيء\".‏","english":{"narrator":"There are other traditions, which support this narration, of which is:","text":"The Hadith narrated by Ibn ’Abbas (RAA) related by Abu Dawud and others. Put together, they confirm that it is Hasan."}},{"id":120,"idInBook":120,"chapterId":16,"bookId":17,"arabic":"وَعَنِ ابْنِ مَسْعُودٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِنَّ أَوْلَى اَلنَّاسِ بِي يَوْمَ اَلْقِيَامَةِ, أَكْثَرُهُمْ عَلَيَّ صَلَاةً }  أَخْرَجَهُ اَلتِّرْمِذِيُّ وَصَحَّحَهُ اِبْنُ حِبَّانَ .‏  1‏ .‏‏1 ‏- ضعيف.‏ رواه الترمذي (484)‏، وابن حبان (911)‏ وقال الترمذي:\" هذا حديث حسن غريب\".‏ قلت: في سنده مجهول، وآخر سيئ الحفظ.‏","english":{"narrator":"Ibn Mas'ud (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“Those who are nearest to me on the Day of Resurrection are those who invoke many blessings on me.” Related by At-Tirmidhi and Ibn Hibban graded it as Sahih."}},{"id":121,"idInBook":121,"chapterId":16,"bookId":17,"arabic":"وَعَنْ شَدَّادِ بْنِ أَوْسٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ سَيِّدُ اَلِاسْتِغْفَارِ, أَنْ يَقُولَ اَلْعَبْدُ: اَللَّهُمَّ أَنْتَ رَبِّي, لَا إِلَهَ إِلَّا أَنْتَ, خَلَقْتَنِي, وَأَنَا عَبْدُكَ, وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اِسْتَطَعْتُ, أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ, أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ, وَأَبُوءُ لَكَ بِذَنْبِي, فَاغْفِرْ لِي; فَإِنَّهُ لَا يَغْفِرُ اَلذُّنُوبَ إِلَّا أَنْتَ }  أَخْرَجَهُ اَلْبُخَارِيُّ .‏  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (6306)‏ وليس عنده لفظ:\" العبد\" وإن كان عند غير، وزاد:\" من قالها من النهار، موقنا بها، فمات من يومه قبل أن يمسي، فهو من أهل الجنة، ومن قالها من الليل، وهو موقن بها، فمات قبل أن يصبح، فهو من أهل الجنة\"، و\" أبوء\": أعترف.‏","english":{"narrator":"Shaddad bin Aus (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“The best manner of asking for forgiveness is to say: “O Allah! You are my Lord. None has the right to be worshipped except You. You created me and I am your servant and I abide by your covenant and promise as best I can. I seek refuge in you from the evil, which I have committed. I acknowledge your favor upon me and I knowledge my sins, so forgive me, for verily none can forgive sin except you.” Related by Al-Bukhari."}},{"id":122,"idInBook":122,"chapterId":16,"bookId":17,"arabic":"وَعَنِ ابْنِ عُمَرَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: { لَمْ يَكُنْ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَدَعُ هَؤُلَاءِ اَلْكَلِمَاتِ حِينَ يُمْسِي وَحِينَ يُصْبِحُ: اَللَّهُمَّ إِنِّي أَسْأَلُكَ اَلْعَافِيَةَ فِي دِينِي, وَدُنْيَايَ, وَأَهْلِي, وَمَالِي, اَللَّهُمَّ اسْتُرْ عَوْرَاتِي, وَآمِنْ رَوْعَاتِي, وَاحْفَظْنِي مِنْ بَيْنِ يَدَيَّ, وَمِنْ خَلْفِي, وَعَنْ يَمِينِي, وَعَنْ شِمَالِي, وَمِنْ فَوْقِي, وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي }  أَخْرَجَهُ النَّسَائِيُّ, وَابْنُ مَاجَهْ, وَصَحَّحَهُ اَلْحَاكِمُ .‏  1‏ .‏‏1 ‏- صحيح.‏ رواه النسائي في\" عمل اليوم والليلة\" (566)‏، وابن ماجه (3871)‏، والحاكم (1 / 517‏- 518)‏.‏","english":{"narrator":"Ibn ’Umar (RAA) narrated, ‘The Messenger of Allah (ﷺ) never failed to say these words in the morning and the evening:","text":"“O Allah! I ask you for pardon and well-being in my religious and worldly affairs, and my family and my wealth. O Allah! Cover my weaknesses and set at ease my dismay. O Allah! Preserve me from the front and from behind and on my right and on my left and from above, and I seek refuge with you lest I be swallowed up by the earth.” Related by An-Nasa’i and Ibn Majah. Al-Hakim graded it as Sahih."}},{"id":123,"idInBook":123,"chapterId":16,"bookId":17,"arabic":"وَعَنِ ابْنِ عُمَرَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: كَانَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ: { اَللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ زَوَالِ نِعْمَتِكَ, وَتَحَوُّلِ عَافِيَتِكَ, وَفَجْأَةِ نِقْمَتِكَ, وَجَمِيعِ سَخَطِكَ }  أَخْرَجَهُ مُسْلِمٌ .‏  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم (2739)‏ وكذا وقع في\" الأصلين\":\" فجأة\"، ووقع في مسلم:\" فجاءة\"، وهما لغتان، والمراد: بغتة.‏","english":{"narrator":"","text":"Ibn 'Umar (RAA) narrated, ‘The Messenger of Allah (ﷺ) used to supplicate saying, “O Allah! I seek refuge in you from the withholding of your favor, the decline of the good health you have given, the suddenness of your vengeance and from all forms of your wrath.” Related by Muslim."}},{"id":124,"idInBook":124,"chapterId":16,"bookId":17,"arabic":"وَعَنْ عَبْدِ اَللَّهِ بْنِ عُمَرَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: { كَانَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ: اَللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ غَلَبَةِ اَلدَّيْنِ, وَغَلَبَةِ اَلْعَدُوِّ, وَشَمَاتَةِ اَلْأَعْدَاءِ }  رَوَاهُ النَّسَائِيُّ, وَصَحَّحَهُ اَلْحَاكِمُ .‏  1‏ .‏‏1 ‏- صحيح.‏ رواه النسائي (8 / 265)‏، والحاكم (1 / 104)‏.‏","english":{"narrator":"","text":"Ibn Umar (RAA) narrated, “The Messenger of Allah (ﷺ) used to say, “O Allah! I seek refuge in you from the burden of debts and from being over-powered by men and from the gloating of enemies (at an evil I am afflicted with).” Related by"}},{"id":125,"idInBook":125,"chapterId":16,"bookId":17,"arabic":"وَعَنْ بُرَيْدَةَ ‏- رضى الله عنه ‏- قَالَ: { سَمِعَ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-رَجُلاً يَقُولُ: اَللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنِّي أَشْهَدُ أَنَّكَ أَنْتَ اَللَّهُ لَا إِلَهَ إِلَّا أَنْتَ, اَلْأَحَدُ اَلصَّمَدُ, اَلَّذِي لَمْ يَلِدْ, وَلَمْ يُولَدْ, وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ.‏ فَقَالَ\" لَقَدْ سَأَلَ اَللَّهُ بِاسْمِهِ اَلَّذِي إِذَا سُئِلَ بِهِ أَعْطَى, وَإِذَا دُعِيَ بِهِ أَجَابَ }  أَخْرَجَهُ اَلْأَرْبَعَةُ, وَصَحَّحَهُ اِبْنُ حِبَّانَ .‏  1‏ .‏‏1 ‏- صحيح.‏ رواه أبو داود (1493)‏، والنسائي في\" الكبرى\" (4 / 394‏- 395)‏.‏ والترمذي (3475)‏، وابن ماجه (3857)‏، وابن حبان (2383)‏.‏","english":{"narrator":"Buraidah (RAA) narrated, ‘The Messenger of Allah (ﷺ) heard a man saying:","text":"‘O Allah! I ask you by virtue that I testify that you are Allah; there is no God but You, the one —· the Self Sufficient Master, Who did not beget, and was not begotten, and to whom no one is equal.’ Allah’s Messenger (ﷺ) then said, “He has asked Allah by His Name by which when asked, He gives, and by which when supplicated, He answers.” Related by the four Imams and Ibn Hibban graded it as Sahih."}},{"id":126,"idInBook":126,"chapterId":16,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: { كَانَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-إِذَا أَصْبَحَ, يَقُولُ: اَللَّهُمَّ بِكَ أَصْبَحْنَا, وَبِكَ أَمْسَيْنَا, وَبِكَ نَحْيَا, وَبِكَ نَمُوتُ, وَإِلَيْكَ اَلنُّشُورُ }  وَإِذَا أَمْسَى قَالَ مِثْلَ ذَلِكَ ; إِلَّا أَنَّهُ قَالَ: { وَإِلَيْكَ اَلْمَصِيرُ }  أَخْرَجَهُ اَلْأَرْبَعَةُ .‏  1‏ .‏‏1 ‏- حسن.‏ رواه أبو داود (5068)‏، والنسائي في\" عمل اليوم والليلة\" (564)‏.‏ والترمذي (3391)‏، وابن ماجه (3868)‏.‏ وعند أبي داود:\" وإليك النشور\" في دعاء الصباح والمساء، وأما النسائي فعنده في دعاء المساء\" وإليك النشور\".‏ قال ومرة أخرى: \"وإليك المصير\"، وأما ابن ماجه والترمذي فروايتهما للحديث من أمره ‏-صلى الله عليه وسلم‏-:\" إذا أصبحتم فقولوا.‏.‏.‏.‏.‏\" أو:\" إذا اصبح أحدكم فليقل:.‏.‏.‏.‏\"، وعند الترمذي في دعاء الصباح\" وإليك المصير\" وفي دعاء المساء:\" وإليك النشور\"! وأما ابن ماجه ففي دعاء المساء كما قال الحافظ، إلا أنه في دعاء الصباح ليس عنده:\" وإليك النشور\"، وقال الترمذي:\" هذا حديث حسن\".‏","english":{"narrator":"Abu Hurairah (RAA) narrated, ‘Allah’s Messenger (ﷺ) would say in the morning, “O Allah! By Your leave we have reached the morning and by your leave we have reached the evening. By Your leave we live and die. Unto you is our resurrection.” In the evening, he would say the same except the last phrase:","text":"“and to you do we return.” Related by the four Imams."}},{"id":127,"idInBook":127,"chapterId":16,"bookId":17,"arabic":"وَعَنْ أَنَسٍ ‏- رضى الله عنه ‏- قَالَ: { كَانَ أَكْثَرُ دُعَاءِ رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-رَبَّنَا آتِنَا فِي اَلدُّنْيَا حَسَنَةً, وَفِي اَلْآخِرَةِ حَسَنَةً, وَقِنَا عَذَابَ اَلنَّارِ }  مُتَّفَقٌ عَلَيْهِ .‏  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (6389)‏، ومسلم (2690)‏ وفي رواية لمسلم\" اللهم\" بدل:\"ربنا\" والباقي مثله.‏","english":{"narrator":"Anas (RAA) narrated, “The Messenger of Allah (ﷺ) used to supplicate frequently:","text":"“O our Lord, grants us the best in this life and the best in the next life, and protects us from the punishment of the Fire.” Agreed upon."}},{"id":128,"idInBook":128,"chapterId":16,"bookId":17,"arabic":"وَعَنْ أَبِي مُوسَى اَلْأَشْعَرِيِّ ‏- رضى الله عنه ‏- قَالَ: { كَانَ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-يَدْعُو: اَللَّهُمَّ اغْفِرْ لِي خَطِيئَتِي, وَجَهْلِي, وَإِسْرَافِي فِي أَمْرِي, وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي, اَللَّهُمَّ اِغْفِرْ لِي جِدِّي, وَهَزْلِي, وَخَطَئِي, وَعَمْدِي, وَكُلُّ ذَلِكَ عِنْدِي, اَللَّهُمَّ اِغْفِرْ لِي مَا قَدَّمْتُ, وَمَا أَخَّرْتُ, وَمَا أَسْرَرْتُ, وَمَا أَعْلَنْتُ, وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي, أَنْتَ اَلْمُقَدِّمُ وَالْمُؤَخِّرُ, وَأَنْتَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ }  مُتَّفَقٌ عَلَيْهِ .‏  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (6398)‏، ومسلم (2819)‏.‏","english":{"narrator":"","text":"Abu Musa al-Ash’ari (RAA) narrated, “The Messenger of Allah (ﷺ) used to supplicate, “O Allah, forgive me my faults, my ignorance, my immoderation in my concern. And you are better aware (of my affairs) than myself. O Allah, grant me forgiveness (of the faults which I committed) seriously or otherwise (and which I committed) inadvertently and deliberately. All these (failings) are in me. O Allah, grant me forgiveness from the faults, which I did in haste or deferred, which I committed in privacy or in public and you are better aware (of them) than myself. You are the First and the Last and over all things you are Omnipotent.” Agreed Upon."}},{"id":129,"idInBook":129,"chapterId":16,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: { كَانَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ: اَللَّهُمَّ أَصْلِحْ لِي دِينِي اَلَّذِي هُوَ عِصْمَةُ أَمْرِي, وَأَصْلِحْ لِي دُنْيَايَ اَلَّتِي فِيهَا مَعَاشِي, وَأَصْلِحْ لِي آخِرَتِي اَلَّتِي إِلَيْهَا مَعَادِي, وَاجْعَلْ اَلْحَيَاةَ زِيَادَةً لِي فِي كُلِّ خَيْرٍ, وَاجْعَلْ اَلْمَوْتَ رَاحَةً لِي مِنْ كُلِّ شَرٍّ }  أَخْرَجَهُ مُسْلِمٌ .‏  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم (2820)‏.‏","english":{"narrator":"","text":"Abu Hurairah (RAA) narrated that the Messenger of Allah (ﷺ) used to say, “O Allah! Set right for me my religion, which is the safeguard of my affairs. And set right for me the affairs of the world wherein is my living. Decree the Hereafter to be good for me. And make this life, for me, (a source) of abundance for every good and make my death (a source) of comfort to me and protection against every evil.” Related by Muslim."}},{"id":130,"idInBook":130,"chapterId":16,"bookId":17,"arabic":"وَعَنْ أَنَسٍ ‏- رضى الله عنه ‏- قَالَ: { كَانَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ:\" اَللَّهُمَّ اِنْفَعْنِي بِمَا عَلَّمْتَنِي, وَعَلِّمْنِي مَا يَنْفَعُنِي, وَارْزُقْنِي عِلْمًا يَنْفَعُنِي }  رَوَاهُ النَّسَائِيُّ, وَالْحَاكِمُ .‏  1‏ .‏‏1 ‏- حسن رواه الحاكم (1 / 510)‏ ويشهد له ما بعده، وأما عزوه للنسائي فلا أظنه إلا من أوهام الحافظ ‏-رحمه الله‏- إذ لم أجده لا في\" المجتبى\" ولا في\" الكبرى\" ولم أر أحدا عزاه للنسائي غير الحافظ، والله أعلم.‏","english":{"narrator":"","text":"Anas (RAA) narrated that the Messenger of Allah (ﷺ) used to say, “O Allah! Grant me benefit in what you have taught me, and teach me useful knowledge and provide me with knowledge that will benefit me.” Related by An-Nasa’i and Al-Hakim."}},{"id":131,"idInBook":131,"chapterId":16,"bookId":17,"arabic":"وَلِلتِّرْمِذِيِّ: مِنْ حَدِيثِ أَبِي هُرَيْرَةَ نَحْوُهُ, وَقَالَ فِي آخِرِهِ: { وَزِدْنِي عِلْمًا, وَالْحَمْدُ لِلَّهِ عَلَى كُلِّ حَالٍ, وَأَعُوذُ بِاَللَّهِ مِنْ حَالِ أَهْلِ اَلنَّارِ }  وَإِسْنَادُهُ حَسَنٌ .‏  1‏ .‏‏1 ‏- حسن دون هذه الزيادة ؛ إذ في سندها ضعيف، ومجهول.‏ ورواه الترمذي (3599)‏ وغيره.‏ وقال:\" هذا حديث حسن غريب\".‏","english":{"narrator":"","text":"At-Tirmidhi reported a similar tradition on the authority of `Abu Hurairah (RAA), he said at its end, “And increase my knowledge. Praise be to Allah in all circumstances. I seek refuge in Allah from the state of those who will go to Hell.” Its chain of narrators is good."}},{"id":132,"idInBook":132,"chapterId":16,"bookId":17,"arabic":"وَعَنْ عَائِشَةَ ‏-رَضِيَ اَللَّهُ عَنْهَا‏- أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-عَلَّمَهَا هَذَا اَلدُّعَاءَ: { اَللَّهُمَّ إِنِّي أَسْأَلُكَ مِنَ الْخَيْرِ كُلِّهِ, عَاجِلِهِ وَآجِلِهِ, مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ, وَأَعُوذُ بِكَ مِنَ الشَّرِّ كُلِّهِ, عَاجِلِهِ وَآجِلِهِ, مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ, اَللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِ مَا سَأَلَكَ عَبْدُكَ وَنَبِيُّكَ, وَأَعُوذُ بِكَ مِنْ شَرِّ مَا عَاذَ بِهِ عَبْدُكَ وَنَبِيُّكَ, اَللَّهُمَّ إِنِّي أَسْأَلُكَ اَلْجَنَّةَ, وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ, وَأَعُوذُ بِكَ مِنَ النَّارِ, وَمَا قَرَّبَ مِنْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ, وَأَسْأَلُكَ أَنْ تَجْعَلَ كُلَّ قَضَاءٍ قَضَيْتَهُ لِي خَيْرًا }  أَخْرَجَهُ اِبْنُ مَاجَهْ, وَصَحَّحَهُ اِبْنُ حِبَّانَ, وَالْحَاكِمُ .‏  1‏ .‏‏1 ‏- صحيح.‏ رواه ابن ماجه (3846)‏، وابن حبان (869)‏، والحاكم (1 / 512‏- 522)‏ وفي سند ابن حبان سقط.‏","english":{"narrator":"","text":"’A’ishah (RAA) narrated, ‘Allah’s Messenger (ﷺ) taught her this supplication, “O Allah! I ask you of all good of what I have done and what I have not done in this world and in the Hereafter. I seek refuge in you from the evil of what I have done and what I have not done in this world and in the Hereafter. O Allah! I ask of you all good that your servant and Prophet Muhammad (ﷺ) used to ask of you. I seek refuge in you from all evil that your servant and Prophet Muhammad used to seek refuge in you from. O Allah! I ask you for Paradise and what brings me nearer to it of deeds and sayings. I seek refuge in You from Hell-Fire and what brings me near to it of deeds and sayings. I ask you for the good consequences of Your Decree.” Related by Ibn Majah Ibn Hibban and Al-Hakim graded it as Sahih"}},{"id":133,"idInBook":133,"chapterId":16,"bookId":17,"arabic":"وَأَخْرَجَ اَلشَّيْخَانِ عَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ كَلِمَتَانِ حَبِيبَتَانِ إِلَى اَلرَّحْمَنِ, خَفِيفَتَانِ عَلَى اَللِّسَانِ, ثَقِيلَتَانِ فِي اَلْمِيزَانِ, سُبْحَانَ اَللَّهِ وَبِحَمْدِهِ , سُبْحَانَ اَللَّهِ اَلْعَظِيمِ }   1‏‏1 ‏- صحيح.‏ رواه البخاري (6406)‏، ومسلم (2694)‏.‏","english":{"narrator":"Abu Hurairah (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“Two phrases which are dear to the Compassionate One and are light on the tongue but heavy in the scale are: “How perfect Allah is and I praise Him; and How perfect Allah is the Most Great.” Agreed upon."}}],"chapter":{"id":16,"bookId":17,"arabic":"كتاب الجامع","english":"The Comprehensive Book"}}