{"metadata":{"length":66,"arabic":{"title":"بلوغ المرام","author":"الإمام ابن حجر العسقلاني","introduction":"كتاب الجنائز"},"english":{"title":"Bulugh al-Maram","author":"Ibn Hajar al-Asqalani","introduction":"Funerals"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":3,"bookId":17,"arabic":"عَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ أَكْثِرُوا ذِكْرَ هَاذِمِ  1‏ اَللَّذَّاتِ: اَلْمَوْتِ }  رَوَاهُ اَلتِّرْمِذِيُّ, وَالنَّسَائِيُّ, وَصَحَّحَهُ ابْنُ حِبَّانَ  2‏ .‏‏1 ‏- هذا اللفظ وقع في بعض الروايات كما هو هنا، وجاء في بعضها \"هادم\" وفي بعض آخر \"هازم\".‏ أي: جاء بالذال المعجمة، وبالدال المهملة، وبالزاي، وكل ذلك له وجه فالأول بمعنى القطع.‏ والثاني بمعنى: الهدم.‏ والثالث بمعنى: القهر والغلبة.‏ المراد بذلك كله: الموت.‏‏2 ‏- صحيح.‏ رواه الترمذي (2307)‏، والنسائي (4/4)‏، وابن حبان (2992)‏ وقال الترمذي: \"هذا حديث حسن غريب\".‏ قلت: ولو اقتصر رحمه الله على التحسين لكان أولى إذ لا وجه للغرابة.‏ والله أعلم.‏ وقد زاد ابن حبان في \"صحيحه\": \"فما ذكره عبد قط وهو في ضيق إلا وسعه عليه، ولا ذكره وهو في سعة إلا ضيقه عليه\" وسندها حسن كإسناد أصل الحديث.‏ وإنما صححت الحديث لشواهده الكثيرة.‏ وهي مخرجة في \"الأصل\".‏","english":{"narrator":"Abu Hurairah (RAA) narrated that the Messenger of Allah said:","text":"“Remember, as much as you can, the one thing (fact or reality) which (always) brings an end to all worldly joys and pleasures, (meaning death)”Related by At-Tirmidhi, An-Nasa’i and Ibn Hibban."}},{"id":2,"idInBook":2,"chapterId":3,"bookId":17,"arabic":"وَعَنْ أَنَسٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا يَتَمَنَّيَنَّ أَحَدُكُمُ اَلْمَوْتَ لِضُرٍّ يَنْزِلُ بِهِ, فَإِنْ كَانَ لَا بُدَّ مُتَمَنِّيًا فَلْيَقُلْ: اَللَّهُمَّ أَحْيِنِي مَا كَانَتِ اَلْحَيَاةُ خَيْرًا لِي, وَتَوَفَّنِي إِذَا كَانَتِ اَلْوَفَاةُ خَيْرًا لِي }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (5671)‏، ومسلم (2680)‏.‏","english":{"narrator":"Anas (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"\"None of you should wish for death due to any affliction, which might have affected him. But if he feels compelled to wish for it (due to extreme distress that he feels he cannot bear), he should say: “O Allah! Grant me life as long as life is better for me, and let me die when death is better for me.” Agreed upon."}},{"id":3,"idInBook":3,"chapterId":3,"bookId":17,"arabic":"وَعَنْ بُرَيْدَةَ ‏- رضى الله عنه ‏- عَنِ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { اَلْمُؤْمِنُ يَمُوتُ بِعَرَقِ الْجَبِينِ }  رَوَاهُ اَلثَّلَاثَةُ  1‏ وَصَحَّحَهُ ابْنُ حِبَّانَ  2‏ .‏‏1 ‏- ووقع في\"أ\" : \"الترمذي\" وهو خطأ.‏‏2 ‏- صحيح.‏ رواه الترمذي (982)‏، والنسائي (4/5‏-6)‏، وابن ماجه (1452)‏، وللحديث إسناد عند النسائي على شرط الشيخين، وله شاهد صحيح عن ابن مسعود.‏","english":{"narrator":"Buraidah (RAA) narrated that the messenger of Allah (ﷺ) said:","text":"“The believer dies while his forehead is sweating.\" Related by the three Imams."}},{"id":4,"idInBook":4,"chapterId":3,"bookId":17,"arabic":"وَعَنْ أَبِي سَعِيدٍ وَأَبِي هُرَيْرَةَ رَضِيَ اَللَّهُ عَنْهُمَا قَالَا: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَقِّنُوا مَوْتَاكُمْ  1‏ لَا إِلَهَ إِلَّا اَللَّهُ }  رَوَاهُ مُسْلِمٌ, وَالْأَرْبَعَةُ  2‏ .‏‏1 ‏- أي: اذكروا وقولوا لمن حضره الموت؛ ليكون آخر كلامه: لا إله إلا الله.‏‏2 ‏- صحيح.‏ أما حديث أبي سعيد: فرواه مسلم (916)‏، وأبو داود (3117)‏، والنسائي (4/5)‏، والترمذي (976)‏، وابن ماجه (1445)‏.‏ وقال الترمذي: \"حسن غريب صحيح\".‏ وأما حديث أبي هريرة: فرواه مسلم (917)‏، وابن ماجه (1444)‏، وزاد البزار بسند صحيح على شرط مسلم: \"فإنه من كان آخر كلمته: لا إله إلا الله.‏ عند الموت، دخل الجنة يوما من الدهر، وإن أصابه قبل ذلك ما أصابه\".‏","english":{"narrator":"Abu Sa’id and Abu Hurairah (RAA) narrated that the messenger of Allah (ﷺ) said:","text":"“Remind those who are on their death bed of the Shahadah “La'Ilaha illall-ah.” (for them to say it, hoping it will be their last words)”"}},{"id":5,"idInBook":5,"chapterId":3,"bookId":17,"arabic":"وَعَنْ مَعْقِلِ بْنِ يَسَارٍ ‏- رضى الله عنه ‏- أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَالَ: { اقْرَؤُوا عَلَى مَوْتَاكُمْ يس }  رَوَاهُ أَبُو دَاوُدَ, وَالنَّسَائِيُّ, وَصَحَّحَهُ ابْنُ حِبَّانَ  1‏ .‏‏1 ‏- ضعيف.‏ رواه أبو داود (321)‏، والنسائي في: \"عمل اليوم والليلة\" (1074)‏، وابن حبان (3002)‏، وله عدة علل فصلت فيها القول بالأصل، وتجد هناك أيضا الرد على تأويل ابن حبان للحديث.‏","english":{"narrator":"Ma'qil bin Yasar (RAA) narrated that the messenger of Allah (ﷺ) said:","text":"“Recite Yasin (Surah no. 36), over those who are dying.” Related by Abu Dawud, An-Nasa'i and Ibn Hibban graded it as Sahih"}},{"id":6,"idInBook":6,"chapterId":3,"bookId":17,"arabic":"وَعَنْ أُمِّ سَلَمَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: { دَخَلَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-عَلَى أَبِي سَلَمَةَ ‏- رضى الله عنه ‏- وَقَدْ شُقَّ بَصَرُهُ  1‏ فَأَغْمَضَهُ, ثُمَّ قَالَ: \"إِنَّ اَلرُّوحَ إِذَا قُبِضَ, اتَّبَعَهُ الْبَصَرُ\" فَضَجَّ نَاسٌ مِنْ أَهْلِهِ, فَقَالَ: \"لَا تَدْعُوا عَلَى أَنْفُسِكُمْ إِلَّا بِخَيْرٍ.‏ فَإِنَّ اَلْمَلَائِكَةَ تُؤَمِّنُ عَلَى مَا تَقُولُونَ\".‏ ثُمَّ قَالَ: \"اَللَّهُمَّ اغْفِرْ لِأَبِي سَلَمَةَ, وَارْفَعْ دَرَجَتَهُ فِي اَلْمَهْدِيِّينَ, وَافْسِحْ لَهُ فِي قَبْرِهِ, وَنَوِّرْ لَهُ فِيهِ, وَاخْلُفْهُ فِي عَقِبِهِ }  رَوَاهُ مُسْلِمٌ  2‏ .‏‏1 ‏- قال النووي (5/476‏-477)‏: \"بفتح الشين، ورفع بصره، وهو فاعل شق، هكذا ضبطناه وهو المشهور، وضبط بعضهم بصره بالنصب وهو صحيح أيضا، والشين مفتوحة بلا خلاف.‏.‏ وهو الذي حضره الموت، وصار ينظر إلى الشيء لا يرتد إليه طرفه\".‏‏2 ‏- صحيح.‏ رواه مسلم (920)‏.‏","english":{"narrator":"","text":"Umm Salamah (RAA) narrated, ‘The Messenger of Allah (ﷺ) came to see Abu Salamah when his sight had become fixed (with his eyes open, as he had already passed away). So the Prophet (ﷺ), closed his eyes and said, “When the soul is seized and leaves the body, the sight follows it.’ Some of Abu Salamah's family wept and wailed, whereupon the Messenger of Allah said to them, ‘Do not supplicate to Allah anything except that which is good for you (i.e. do not say anything which goes against you at that moment), because the angels (who are present at the time of death), say “Amin\" (asking Allah to accept your invocation) to whatever you say.” Then he said, \"O Allah! Forgive Abu Salamah, raise his status among (Your) rightly guided servants, make his grave spacious, and fill it with light for him, and be his successor in taking good care of his descendants whom he has left behind, (and make them pious).” Related by Muslim."}},{"id":7,"idInBook":7,"chapterId":3,"bookId":17,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا: { أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-حِينَ تُوُفِّيَ سُجِّيَ بِبُرْدٍ حِبَرَةٍ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (5814)‏، ومسلم (942)‏.‏","english":{"narrator":"","text":"A’ishah (RAA) narrated ‘When the Messenger of Allah (ﷺ) died, he was covered with a Yemeni mantle that had some designs on it.' Agreed upon."}},{"id":8,"idInBook":8,"chapterId":3,"bookId":17,"arabic":"وَعَنْهَا { أَنَّ أَبَا بَكْرٍ اَلصِّدِّيقَ ‏- رضى الله عنه ‏- قَبَّلَ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-بَعْدَ مَوْتِهِ }  رَوَاهُ اَلْبُخَارِيُّ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (8/146‏-147 و 10/166/فتح)‏.‏","english":{"narrator":"","text":"A’ishah (RAA) reported That Abu Bakr kissed the Prophet (ﷺ) after he had died.’ Related by Al-Bukhari."}},{"id":9,"idInBook":9,"chapterId":3,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- عَنِ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { نَفْسُ اَلْمُؤْمِنِ مُعَلَّقَةٌ بِدَيْنِهِ, حَتَّى يُقْضَى عَنْهُ }  رَوَاهُ أَحْمَدُ, وَاَلتِّرْمِذِيُّ وَحَسَّنَهُ  1‏ .‏‏1 ‏- صحيح.‏ رواه أحمد (2/440 و 475 و 508)‏، والترمذي (1078)‏ و (1079)‏، وقال الترمذي: \"هذا حديث حسن\".‏ قلت: هو صحيح؛ إذ له شواهد عن أربعة من الصحابة ذكرتها \"بالأصل\".‏","english":{"narrator":"","text":"Abu Hurairah (RAA) narrated that the Messenger of Allah said, \"A believer‘s soul remains suspended according to his debt until it is settled or paid off on his behalf\". Related by Ahmad and At-Tirmidhi."}},{"id":10,"idInBook":10,"chapterId":3,"bookId":17,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا: أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَالَ فِي اَلَّذِي سَقَطَ عَنْ رَاحِلَتِهِ فَمَاتَ: { اغْسِلُوهُ بِمَاءٍ وَسِدْرٍ, وَكَفِّنُوهُ فِي ثَوْبَيْنِ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (1265)‏، ومسلم (1206)‏، وتمامه: \"ولا تحنطوه، ولا تخمروا رأسه، فإن الله يبعثه يوم القيامة ملبيا.‏ (وفي رواية: فإن الله يبعثه يوم القيامة يلبي)‏.‏","english":{"narrator":"","text":"Ibn ‘Abbas (RAA) narrated that the Messenger of Allah (ﷺ) said concerning the man who fell off his mount and died during Hajj, “Wash him with water and Sidr (lotus leaves) and shroud him in his two garments (that he was wearing for Ihram).” Agreed upon."}},{"id":11,"idInBook":11,"chapterId":3,"bookId":17,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: { لَمَّا أَرَادُوا غَسْلَ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالُوا: وَاَللَّهُ مَا نَدْرِي, نُجَرِّدُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-كَمَا نُجَرِّدُ مَوْتَانَا, أَمْ لَا?….‏.‏ }  اَلْحَدِيثَ، رَوَاهُ أَحْمَدُ, وَأَبُو دَاوُدَ  1‏ .‏‏1 ‏- حسن.‏ رواه أحمد (6/267)‏، وأبو داود (3141)‏، ولفظه: عن عائشة رضي الله عنها قالت: لما أرادوا غسل النبي صلى الله عليه وسلم قالوا: والله ما ندري أنجرد رسول الله صلى الله عليه وسلم من ثيابه كما نجرد موتانا أم نغسله وعليه ثيابه؟ فلما اختلفوا ألقى الله عليهم النوم حتى ما منهم من رجل إلا وذقنه في صدره، ثم كلمهم مكلم من ناحية البيت لا يدرون من هو: أن اغسلوا النبي صلى الله عليه وسلم وعليه ثيابه، فقاموا إلى رسول الله صلى الله عليه وسلم، فغسلوه وعليه قميصه، يصبون الماء فوق القميص، ويدلكونه بالقميص دون أيديهم.‏ وكانت عائشة تقول: لو استقبلت من أمري ما استدبرت ما غسله إلا نساؤه.‏","english":{"narrator":"","text":"A’ishah (RAA) narrated, ‘When the Messenger of Allah (ﷺ) died and they wanted to make Ghusl (full ritual washing of the body), they said, ‘By Allah we do not know whether we should take off the clothes of Allah’s Messenger as we do for our dead or not?’ Related by Ahmad and Abu Dawud."}},{"id":12,"idInBook":12,"chapterId":3,"bookId":17,"arabic":"وَعَنْ أُمِّ عَطِيَّةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: { دَخَلَ عَلَيْنَا اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-وَنَحْنُ نُغَسِّلُ ابْنَتَهُ، فَقَالَ: \"اغْسِلْنَهَا ثَلَاثًا, أَوْ خَمْسًا, أَوْ أَكْثَرَ مِنْ ذَلِكَ، إِنْ رَأَيْتُنَّ ذَلِكَ, بِمَاءٍ وَسِدْرٍ, وَاجْعَلْنَ فِي الْآخِرَةِ كَافُورًا, أَوْ شَيْئًا مِنْ كَافُورٍ\"، فَلَمَّا فَرَغْنَا آذَنَّاهُ, فَأَلْقَى إِلَيْنَا حِقْوَهُ.‏فَقَالَ: \"أَشْعِرْنَهَا إِيَّاهُ\" }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏ \nوَفِي رِوَايَةٍ: { ابْدَأْنَ بِمَيَامِنِهَا وَمَوَاضِعِ اَلْوُضُوءِ مِنْهَا } 2‏ .‏ \nوَفِي لَفْظٍ ِللْبُخَارِيِّ: { فَضَفَّرْنَا شَعْرَهَا ثَلَاثَةَ قُرُونٍ, فَأَلْقَيْنَاهُ خَلْفَهَا } 3‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (1253)‏، ومسلم (939)‏ (36)‏.‏\n‏2 ‏- صحيح.‏ رواه البخاري (167)‏، ومسلم (939)‏ (42 و 43)‏.‏\n‏3 ‏- صحيح.‏ وهذا اللفظ عند البخاري برقم (1263)‏.‏","english":{"narrator":"","text":"Umm ‘Atiyah (RAA) narrated, ‘The Messenger of Allah (ﷺ) came to us when we were washing his daughter (Zainab) after she had died and said, “Wash her three times, five times or more if necessary, with water and lotus leaves (Sidr) and apply some camphor to the last washing.” When we finished making Ghusl for her, we informed the Messenger of Allah (ﷺ) and he threw his Izar (a cloth, which he wore round his waist) to us and told us to wrap her in it as the first sheet of the shroud (next to her body).’ Agreed upon. In another narration, “Start by washing the organs on the right and those parts that are washed in ablution.” In the narration of Al-Bukhari, “We braided her hair in three braids and made them fall at her back.”"}},{"id":13,"idInBook":13,"chapterId":3,"bookId":17,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: { كُفِّنَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-فِي ثَلَاثَةِ أَثْوَابٍ بِيضٍ سَحُولِيَّةٍ مِنْ كُرْسُفٍ, لَيْسَ فِيهَا قَمِيصٌ وَلَا عِمَامَةٌ.‏ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (1264)‏، ومسلم (841)‏.‏ سحولية: بضم السين المهملة ويروى بالفتح، نسبة إلى سحول؛ قرية باليمن، وقال الأزهري: بالفتح: المدينة.‏ وبالضم: الثياب.‏ وقيل: النسب إلى القرية بالضم، وأما بالفتح فنسبة إلى القصار؛ لأنه يسحل الثياب؛ أي: ينقيها.‏ الكرسف: بضم الكاف والسين المهملة بينهما راء ساكنة هو: القطن .‏","english":{"narrator":"","text":"A’ishah (RAA) narrated, ‘The Messenger of Allah (ﷺ) was shrouded in three pieces of white Yemenite cotton sheets. They did not include either a shirt or a turban.’ Agreed upon."}},{"id":14,"idInBook":14,"chapterId":3,"bookId":17,"arabic":"وَعَنِ ابْنِ عُمَرَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: { لَمَّا تُوُفِّيَ عَبْدُ اَللَّهِ بْنِ أُبَيٍّ جَاءٍ اِبْنُهُ إِلَى رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-.‏ فَقَالَ: أَعْطِنِي قَمِيصَكَ أُكَفِّنْهُ فِيهِ, فَأَعْطَاه ُ]إِيَّاهُ] }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (1269)‏، ومسلم (2400)‏.‏ هذا وقد جاءت أحاديث أخرى يتعارض ظاهرها مع حديث ابن عمر، وجواب ذلك مبسوط في \"سبل السلام\" وغيره \"كالفتح\".‏ \"تنبيه\": أخذ بعضهم كالإسماعيلي وابن حجر وغيرهما من هذا الحديث جواز طلب آثار أهل الخير منهم للتبرك بها!! وأقول: كلا.‏ فهذا يجوز فقط ‏-أي: التبرك‏- بآثار النبي صلى الله عليه وسلم دون غيره من أهل الخير والصلاح، ودليلنا على هذا، هو ذلك الأصل الأصيل، الذي نجهر به ليل نهار، ونعلمه كل الناس، ألا وهو: \"على فهم السلف الصالح\" وتلك هي التي تميز أصحاب الدعوة السلفية عن غيرهم من أصحاب الدعوات الأخرى، سواء كانت مذهبية فقهية، أو دعوية فكرية، أو منهجية حزبية.‏ وهذا المثال من الأمثلة الواضحة على أنه بدون هذا القيد يلج الإنسان إلى الابتداع من أوسع أبوابه، والعياذ بالله، ففي السنة نجد أن الصحابة رضي الله عنهم تبركوا بوضوئه صلى الله عليه وسلم، وبعرقه، وبغير ذلك من آثاره صلى الله عليه وسلم كما في \"الصحيحين\" وغيرهما.‏ ولكن هل نجد الصحابة أو السلف الصالح في القرون الثلاثة المفضلة قد فعلوا ذلك بآثار أحد غير النبي صلى الله عليه وسلم؟ لا شك أن كل منصف سيقول: لا لم نجد؟ فنقول: لو كان ذلك خيرا لسبقونا إليه، ولكن لما لم يفعلوا ذلك وجعلوه خصوصية للنبي صلى الله عليه وسلم، وجب علينا أن لا نتعدى فهمهم، وإلا وقعنا في مثل ما يقع فيه كثير من الناس في البدع والضلالة بسبب طرحهم لهذا القيد \"على فهم السلف الصالح\" وإلا فكثير من هؤلاء ‏-إن لم يكن كلهم‏- مع ضلالهم يقولون بوجوب الأخذ بالكتاب والسنة.‏ وأخيرا أذكر بعض من تصدر المجالس والندوات في أيامنا هذه أن هذا الأصل له أدلته من كتاب الله عز وجل ومن حديث النبي صلى الله عليه وسلم، لا كما ذكر أحدهم في بعض دروسه! من أنه طوال حياته العلمية! لا يعرف إلا الكتاب والسنة وهكذا تلقى من مشائخه! إلى أن ابتدع السلفيون هذا القول.‏ وعلى أية حال كل ذلك مفصل في رسالتي \"السلفيون المفترى عليهم\" والحمد لله أولا وآخرا.‏","english":{"narrator":"","text":"‘Abdullah bin ’Umar (RAA) narrated, ‘When ‘Abdullah bin Ubay (the head of the hypocrites) died, his son came to the Prophet (ﷺ) and said, ‘O Messenger of Allah! Please give me your shirt to shroud him (his father) in it.’ So, Allah’s Messenger gave it to him, Agreed upon."}},{"id":15,"idInBook":15,"chapterId":3,"bookId":17,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَالَ: { الْبَسُوا مِنْ ثِيَابِكُمُ الْبَيَاضَ, فَإِنَّهَا مِنْ خَيْرِ ثِيَابِكُمْ, وَكَفِّنُوا فِيهَا مَوْتَاكُمْ }  رَوَاهُ اَلْخَمْسَةُ إِلَّا النَّسَائِيَّ, وَصَحَّحَهُ اَلتِّرْمِذِيُّ  1‏ .‏‏1 ‏- صحيح.‏ رواه أحمد (3426)‏، وأبو داود (4061)‏، والترمذي (994)‏، وابن ماجه (3566)‏.‏ وقال الترمذي: \"حسن صحيح\".‏","english":{"narrator":"Ibn ‘Abbas (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“Wear white clothes, for they are (considered as) your best clothes, and enshroud your dead in them.” Related by the five Imams, except for An-Nasa’i, and At-Tirmidhi reported it to be sound."}},{"id":16,"idInBook":16,"chapterId":3,"bookId":17,"arabic":"وَعَنْ جَابِرٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِذَا كَفَّنَ أَحَدُكُمْ أَخَاهُ فَلْيُحْسِنْ كَفَنَهُ }  رَوَاهُ مُسْلِمٌ  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم (943)‏، وأوله: أن النبي صلى الله عليه وسلم خطب يوما.‏ فذكر رجلا من أصحابه قبض فكفن في كفن غير طائل، وقبر ليلا، فزجر النبي صلى الله عليه وسلم أن يقبر الرجل بالليل حتى يصلي عليه.‏ إلا أن يضطر إنسان إلى ذلك، وقال النبي صلى الله عليه وسلم: الحديث.‏ وانظر رقم (593)‏ الآتي.‏","english":{"narrator":"Jabir (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“When one of you is in charge of shrouding his brother, he should give him the best shroud he can (i.e. clean, covering the whole body, but not necessarily expensive as this is disliked.)” Related by Muslim."}},{"id":17,"idInBook":17,"chapterId":3,"bookId":17,"arabic":"وَعَنْهُ قَالَ: { كَانَ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-يَجْمَعُ بَيْنَ اَلرَّجُلَيْنِ مِنْ قَتْلَى أُحَدٍ فِي ثَوْبٍ وَاحِدٍ, ثُمَّ يَقُولُ: \n\"أَيُّهُمْ أَكْثَرُ أَخْذًا لِلْقُرْآنِ?\", فَيُقَدِّمُهُ فِي اَللَّحْدِ, وَلَمْ يُغَسَّلُوا, وَلَمْ يُصَلِّ عَلَيْهِمْ }  رَوَاهُ اَلْبُخَارِيُّ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (1343)‏.‏","english":{"narrator":"","text":"Jabir (RAA) narrated that the Messenger of Allah (ﷺ) had each two martyrs of the battle of Uhud wrapped in one shroud, and then would ask, “Which one of them knew more of the Qur’An?” He would put that one (that was pointed out) first in the grave. They were not washed and the Messenger of Allah (ﷺ) did not offer a funeral prayer for them.’ Related by Al-Bukhari."}},{"id":18,"idInBook":18,"chapterId":3,"bookId":17,"arabic":"وَعَنْ عَلِيٍّ ‏- رضى الله عنه ‏- قَالَ: { سَمِعْتُ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-يَقُولُ: \n\"لَا تُغَالُوا فِي اَلْكَفَنِ, فَإِنَّهُ يُسْلُبُ سَرِيعًا\" }  رَوَاهُ أَبُو دَاوُدَ  1‏ .‏‏1 ‏- ضعيف.‏ رواه أبو داود (3154)‏.‏","english":{"narrator":"","text":"‘AIi (RAA) narrated, ‘l heard the Messenger of Allah (ﷺ) say, “Do not be extravagant in shrouding (i.e. do not spend too much money on them) for it will decay quickly.” Related by Abu Dawud."}},{"id":19,"idInBook":19,"chapterId":3,"bookId":17,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا ; أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَالَ لَهَا: { لَوْ مُتِّ قَبْلِي فَغَسَّلْتُكِ }  اَلْحَدِيثَ.‏ رَوَاهُ أَحْمَدُ, وَابْنُ مَاجَهْ, وَصَحَّحَهُ ابْنُ حِبَّانَ  1‏ .‏‏1 ‏- صحيح.‏ رواه أحمد (6/228)‏، وابن ماجه (1465)‏، وفي\"أ\" : \"لغسلتك\".‏","english":{"narrator":"","text":"A’ishah (RAA) narrated that the Messenger of Allah (ﷺ) said to her, “If you die before me, I will wash you myself.” Related by Ahmad, Ibn Majah and Ibn Hibban graded it as Sahih."}},{"id":20,"idInBook":20,"chapterId":3,"bookId":17,"arabic":"وَعَنْ أَسْمَاءَ بِنْتِ عُمَيْسٍ رَضِيَ اَللَّهُ عَنْهَا: { أَنَّ فَاطِمَةَ عَلَيْهَا اَلسَّلَامُ أَوْصَتْ أَنْ يُغَسِّلَهَا عَلِيٌّ رَضِيَ اَللَّهُ تَعَالَى عَنْهُ }  رَوَاهُ اَلدَّارَقُطْنِيُّ  1‏ .‏‏1 ‏- حسن.‏ رواه الدارقطني (2/79/12)‏.‏","english":{"narrator":"","text":"Asma’ bint ’Umais (RAA) narrated that Fatimah (RAA) (the daughter of the prophet (ﷺ) made a will that ‘Ali (RAA) was to wash her when she dies.’ Related by Ad-Daraqutni."}},{"id":21,"idInBook":21,"chapterId":3,"bookId":17,"arabic":"وَعَنْ بُرَيْدَةَ ‏- رضى الله عنه ‏- ‏-فِي قِصَّةِ الْغَامِدِيَّةِ اَلَّتِي أَمَرَ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-بِرَجْمِهَا فِي اَلزِّنَا‏- قَالَ: { ثُمَّ أَمَرَ بِهَا فَصُلِّيَ عَلَيْهَا وَدُفِنَتْ }  رَوَاهُ مُسْلِمٌ  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم (1695)‏.‏","english":{"narrator":"","text":"Buraidah (RAA) reported Concerning the story of the Ghamidi woman, who was to be stoned by the order of the Prophet (ﷺ) (due to committing adultery), ‘Then the Messenger of Allah (ﷺ) gave his command concerning her (after her death), so he offered the funeral prayer for her, and she was then buried.’ Related by Muslim."}},{"id":22,"idInBook":22,"chapterId":3,"bookId":17,"arabic":"وَعَنْ جَابِرِ بْنِ سَمُرَةَ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { أُتِيَ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-بِرَجُلٍ قَتَلَ نَفْسَهُ بِمَشَاقِصَ, فَلَمْ يُصَلِّ عَلَيْهِ }  رَوَاهُ مُسْلِمٌ  1‏ .‏‏1 ‏- حسن.‏ رواه مسلم (978)‏.‏ مشاقص: جمع مشقص، وهو نصل عريض.‏","english":{"narrator":"","text":"Jabir bin Samurah (RAA) narrated, ‘A man who killed himself with a broad-headed arrow, was brought to the Prophet (ﷺ) but he did not offer the funeral prayer for him.’ Related by Muslim."}},{"id":23,"idInBook":23,"chapterId":3,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- ‏-فِي قِصَّةِ اَلْمَرْأَةِ اَلَّتِي كَانَتْ تَقُمُّ اَلْمَسْجِدَ‏- قَالَ: { فَسَأَلَ عَنْهَا اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏- ] فَقَالُوا: مَاتَتْ, فَقَالَ: \"أَفَلَا كُنْتُمْ آذَنْتُمُونِي\"? فَكَأَنَّهُمْ صَغَّرُوا أَمْرَهَا]  1‏ فَقَالَ: \"دُلُّونِي عَلَى قَبْرِهَا\", فَدَلُّوهُ, فَصَلَّى عَلَيْهَا }  مُتَّفَقٌ عَلَيْهِ  2‏ .‏ \nوَزَادَ مُسْلِمٌ, ثُمَّ قَالَ: { إِنَّ هَذِهِ اَلْقُبُورَ مَمْلُوءَةٌ ظُلْمَةً عَلَى أَهْلِهَا, وَإِنَّ اَللَّهَ يُنَوِّرُهَا لَهُمْ بِصَلَاتِي عَلَيْهِمْ }‏1 ‏- هذه الزيادة غير موجودة بالأصلين، ولكنها في النسخ المطبوعة وأيضا في \"الشرح\"، وهي أيضا من الحديث ولذلك أبقيتها.‏‏2 ‏- صحيح.‏ رواه البخاري (458)‏، ومسلم (956)‏.‏","english":{"narrator":"Abu Hurairah (RAA) narrated regarding the story of the black woman who used to clean the mosque. The Messenger of Allah asked about her, and he was told that she had died. He said to them, “Why didn’t you inform me of her death?\" It seems that they regarded her as an insignificant person. The Messenger of Allah (ﷺ) said:","text":"“Show me her grave.\" They showed him her grave and he offered the funeral prayer for her.’ Agreed upon. Muslim added in his narration, ‘Verily, those graves are full of darkness for those buried in them. Allah, the Almighty, will illuminate them for their dwellers by my prayer over them\""}},{"id":24,"idInBook":24,"chapterId":3,"bookId":17,"arabic":"وَعَنْ حُذَيْفَةَ ‏- رضى الله عنه ‏- { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-كَانَ يَنْهَى عَنِ اَلنَّعْيِ }  رَوَاهُ أَحْمَدُ, وَاَلتِّرْمِذِيُّ وَحَسَّنَهُ  1‏ .‏‏1 ‏- حسن.‏ رواه أحمد (5/385 و 406)‏، والترمذي (986)‏، وقال الترمذي: \"هذا حديث حسن صحيح\".‏ وما في هذا الحديث من النهي عن النعي مطلقا مقيد بأحاديث أخر كالحديث التالي مثلا، فليس المراد بالنهي كل نعي.‏","english":{"narrator":"","text":"Hudhaifah (RAA) narrated that the Messenger of Allah (ﷺ) used to prohibit the announcement of anyone’s death. Related by Ahmad and At-Tirmidhi, who rendered it Hasan."}},{"id":25,"idInBook":25,"chapterId":3,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-نَعَى اَلنَّجَاشِيَّ فِي اَلْيَوْمِ اَلَّذِي مَاتَ فِيهِ, وَخَرَجَ بِهِمْ مِنَ الْمُصَلَّى، فَصَفَّ بِهِمْ, وَكَبَّرَ عَلَيْهِ أَرْبَعًا }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (1245)‏، ومسلم (951)‏ (62)‏.‏","english":{"narrator":"","text":"Abu Hurairah (RAA) narrated that the Messenger of Allah (ﷺ) informed the people about the death of Negus the day he died. He took them out to the place of prayer, to offer the funeral prayer for him. He arranged them in rows, and made Takbir four times.’ Agreed upon."}},{"id":26,"idInBook":26,"chapterId":3,"bookId":17,"arabic":"وَعَنِ ابْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا: سَمِعْتُ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-يَقُولُ: { مَا مِنْ رَجُلٍ مُسْلِمٍ يَمُوتُ, فَيَقُومُ عَلَى جَنَازَتِهِ أَرْبَعُونَ رَجُلًا, لَا يُشْرِكُونَ بِاَللَّهِ شَيْئًا, إِلَّا شَفَّعَهُمْ اَللَّهُ فِيهِ }  رَوَاهُ مُسْلِمٌ  1‏ .‏‏1 ‏- حسن.‏ رواه مسلم (948)‏.‏","english":{"narrator":"","text":"Ibn ‘Abbas (RAA) narrated, ‘I heard the Messenger of Allah (ﷺ) say, \"If a Muslim man dies and a group of forty people, who do not associate any one with Allah, pray for him, Allah will accept their intercession for him (by way of their Du’A for him.” Related by Muslim."}},{"id":27,"idInBook":27,"chapterId":3,"bookId":17,"arabic":"وَعَنْ سَمُرَةَ بْنِ جُنْدُبٍ ‏- رضى الله عنه ‏- قَالَ: { صَلَّيْتُ وَرَاءَ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-عَلَى امْرَأَةٍ مَاتَتْ فِي نِفَاسِهَا, فَقَامَ وَسْطَهَا }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (3/201/فتح)‏، ومسلم (964)‏.‏","english":{"narrator":"","text":"Samurah bin Jundub (RAA) narrated, ‘I offered the funeral prayer behind the Prophet (ﷺ) for a woman who had died during child-birth and he (prayed) standing opposite the middle of her body.' Agreed upon."}},{"id":28,"idInBook":28,"chapterId":3,"bookId":17,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: { وَاَللَّهِ لَقَدْ صَلَّى رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-عَلَى اِبْنَيْ بَيْضَاءَ فِي اَلْمَسْجِدِ }  رَوَاهُ مُسْلِمٌ  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم (973)‏.‏","english":{"narrator":"","text":"A’ishah (RAA) narrated, ‘By Allah the Messenger of Allah (ﷺ) offered funeral prayer in the mosque for the sons of Baida (Sahl and Suhail).’ Related by Muslim"}},{"id":29,"idInBook":29,"chapterId":3,"bookId":17,"arabic":"وَعَنْ عَبْدِ اَلرَّحْمَنِ بْنِ أَبِي لَيْلَى قَالَ: { كَانَ زَيْدُ بْنُ أَرْقَمَ يُكَبِّرُ عَلَى جَنَائِزِنَا أَرْبَعًا, وَإِنَّهُ كَبَّرَ عَلَى جَنَازَةٍ خَمْسًا, فَسَأَلْتُهُ فَقَالَ: كَانَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يُكَبِّرُهَا }  رَوَاهُ مُسْلِمٌ وَالْأَرْبَعَةُ  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم (957)‏، وأبو داود (3197)‏، والنسائي (4/72)‏، والترمذي (1023)‏، وابن ماجه (1505)‏.‏","english":{"narrator":"","text":"‘Abdur Rahman bin Abi Laila (RAA) and ‘Zaid bin Arqam (RAA) used to recite four Takbirat when praying over the dead, but once he said it five times, so I asked him about it. He said to me, ‘The Messenger of Allah (ﷺ) used to do so.’ Related by Muslim and the four Imams."}},{"id":30,"idInBook":30,"chapterId":3,"bookId":17,"arabic":"وَعَنْ عَلِيٍّ ‏- رضى الله عنه ‏- { أَنَّهُ كَبَّرَ عَلَى سَهْلِ بْنِ حُنَيْفٍ سِتًّا, وَقَالَ: إِنَّهُ بَدْرِيٌّ }  رَوَاهُ سَعِيدُ بْنُ مَنْصُورٍ  1‏ .‏ \nوَأَصْلُهُ فِي \n\"اَلْبُخَارِيِّ\" 2‏ .‏‏1 ‏- صحيح.‏ رواه غير سعيد بن منصور جماعة، وصححه ابن حزم في \"المحلى\" (5/126)‏.‏\n‏2 ‏- رواه البخاري (4004)‏ بلفظ: أن عليا رضي الله عنه كبر على سهل بن حنيف، فقال: إنه شهد بدرا.‏","english":{"narrator":"","text":"‘Ali bin Abi Talib (RAA) narrated that he said six Takbirat when he prayed over Sahl bin Hunaif, and he said (explaining his action), ‘He is one of the Companions, who fought in the Battle of Badr.’ Related by Sa’id bin Mansur."}},{"id":31,"idInBook":31,"chapterId":3,"bookId":17,"arabic":"وَعَنْ جَابِرٍ ‏- رضى الله عنه ‏- قَالَ: { كَانَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يُكَبِّرُ عَلَى جَنَائِزِنَا أَرْبَعًا وَيَقْرَأُ بِفَاتِحَةِ اَلْكِتَابِ فِي اَلتَّكْبِيرَةِ اَلْأُولَى }  رَوَاهُ اَلشَّافِعِيُّ بِإِسْنَادٍ ضَعِيفٍ  1‏ .‏‏1 ‏- رواه الشافعي في \"المسند\" (1/209/578)‏ وسنده ضعيف جدا من أجل شيخ الشافعي ابن أبي يحيى فهو \"متروك\" وأعله الصنعاني في \"السبل\" بعلة ليست بعلة.‏","english":{"narrator":"","text":"Jabir (RAA) narrated that the Messenger of Allah (ﷺ) used to say four Takbirat over the dead, and would recite al-Fatihah in (after saying) the first (opening) Takbirat.’ Related by Ash-Shafi’i with a weak chain of narrators."}},{"id":32,"idInBook":32,"chapterId":3,"bookId":17,"arabic":"وَعَنْ طَلْحَةَ بْنِ عَبْدِ اَللَّهِ بْنِ عَوْفٍ قَالَ: { صَلَّيْتُ خَلَفَ ابْنِ عَبَّاسٍ عَلَى جَنَازَةٍ, فَقَرَأَ فَاتِحَةَ الكْتِابِ فَقَالَ: \n\"لِتَعْلَمُوا أَنَّهَا سُنَّةٌ\" }  رَوَاهُ اَلْبُخَارِيُّ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (1335)‏.‏","english":{"narrator":"","text":"Talhah bin ‘AbduIlah bin ‘Auf (RAA) narrated, ‘I offered a funeral prayer led by Ibn ‘Abbas. He recited al-Fatihah and said, ‘You should know that it (reciting al-Fatihah) is a Sunnah of the Prophet (ﷺ).’ Related by Al-Bukhari."}},{"id":33,"idInBook":33,"chapterId":3,"bookId":17,"arabic":"وَعَنْ عَوْفِ بْنِ مَالِكٍ ‏- رضى الله عنه ‏- قَالَ: { صَلَّى رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-عَلَى جَنَازَةٍ، فَحَفِظْتُ مِنْ دُعَائِهِ: \"اَللَّهُمَّ اغْفِرْ لَهُ, وَارْحَمْهُ وَعَافِهِ, وَاعْفُ عَنْهُ, وَأَكْرِمْ نُزُلَهُ, وَوَسِّعْ مُدْخَلَهُ, وَاغْسِلْهُ بِالْمَاءِ وَالثَّلْجِ وَالْبَرَدِ, وَنَقِّهِ مِنْ اَلْخَطَايَا كَمَا نَقَّيْتَ  1‏ اَلثَّوْبَ اَلْأَبْيَضَ مِنَ الدَّنَسِ, وَأَبْدِلْهُ دَارًا خَيْرًا مِنْ دَارِهِ, وَأَهْلًا خَيْرًا مِنْ أَهْلِهِ, وَأَدْخِلْهُ اَلْجَنَّةَ, وَقِهِ فِتْنَةَ اَلْقَبْرِ وَعَذَابَ اَلنَّارِ }  رَوَاهُ مُسْلِمٌ  2‏ .‏‏1 ‏- كذا بالأصلين، وهي رواية لمسلم، وهو كذلك \"بالشرح\".‏‏2 ‏- صحيح.‏ رواه مسلم (963)‏، وزاد: قال عوف: فتمنيت أن لو كنت أنا الميت؛ لدعاء رسول الله صلى الله عليه وسلم على ذلك الميت.‏","english":{"narrator":"","text":"‘Auf bin Malik (RAA) narrated that the Messenger of Allah (ﷺ) offered the funeral prayer, and I memorized this supplication (that he said for the deceased), “'O Allah! Forgive him and have mercy on him (on her). Grant him ease and respite. Make his resting place a noble one, and facilitate his entry. Wash him with the most pure and clean water, snow and hail. Purify him from sins as a white garment is cleansed of dirt. Give him in exchange a home better than his home (on earth) and a family better than his family. Grant him entrance to Paradise and protect him from the trials of the grave and the torture of Hell Fire.\" Related by Muslim."}},{"id":34,"idInBook":34,"chapterId":3,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: { كَانَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-إِذَا صَلَّى عَلَى جَنَازَةٍ يَقُولُ: \"اَللَّهُمَّ اغْفِرْ لِحَيِّنَا, وَمَيِّتِنَا, وَشَاهِدِنَا, وَغَائِبِنَا, وَصَغِيرِنَا, وَكَبِيرِنَا, وَذَكَرِنَا, وَأُنْثَانَا, اَللَّهُمَّ مَنْ أَحْيَيْتَهُ مِنَّا فَأَحْيِهِ عَلَى اَلْإِسْلَامِ, وَمَنْ تَوَفَّيْتَهُ مِنَّا فَتَوَفَّهُ عَلَى اَلْإِيمَانِ, اَللَّهُمَّ لَا تَحْرِمْنَا أَجْرَهُ, وَلَا تُضِلَّنَا بَعْدَهُ }  رَوَاهُ مُسْلِمٌ, وَالْأَرْبَعَةُ  1‏ .‏‏1 ‏- صحيح.‏ رواه أبو داود (3201)‏، والترمذي (1024)‏، وابن ماجه (1498)‏، وقد أعل هذا الحديث بما لا يقدح، وبيان ذلك في \"الأصل\".‏ \"تنبيه\": وهو الحافظ في عزوه الحديث لمسلم.‏","english":{"narrator":"","text":"Abu Hurairah (RAA) narrated, ‘When the Messenger of Allah (ﷺ) prayed a funeral prayer, he would say, \"O Allah! Forgive those of us who are alive, and those who are dead, those present and those absent, those who are young and those who are male and those who are female. O Allah! Let those of us to whom You have given life, live in Islam, and let those of us You take back die in a state of faith. O Allah! Do not deprive us of our reward for (supplicating for) him, and cause us not to go astray after him.\" Related by Muslim and the four Imams."}},{"id":35,"idInBook":35,"chapterId":3,"bookId":17,"arabic":"وَعَنْهُ أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَالَ: { إِذَا صَلَّيْتُمْ عَلَى اَلْمَيِّتِ فَأَخْلِصُوا لَهُ اَلدُّعَاءَ }  رَوَاهُ أَبُو دَاوُدَ, وَصَحَّحَهُ ابْنُ حِبَّانَ  1‏ .‏‏1 ‏- حسن.‏ رواه أبو داود (3199)‏، وابن حبان (3076)‏.‏","english":{"narrator":"Abu Hurairah (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“If you offer the funeral prayer for a deceased person, supplicate Allah sincerely for him.\" Related by Abu Dawud."}},{"id":36,"idInBook":36,"chapterId":3,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- عَنِ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { أَسْرِعُوا بِالْجَنَازَةِ, فَإِنْ تَكُ صَالِحَةً فَخَيْرٌ تُقَدِّمُونَهَا إِلَيْهِ, وَإِنْ تَكُ سِوَى ذَلِكَ فَشَرٌّ تَضَعُونَهُ عَنْ رِقَابِكُمْ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (1315)‏، ومسلم (944)‏ (50)‏.‏","english":{"narrator":"","text":"Abu Hurairah (RAA) narrated that the Messenger of Allah said, \"Hurry up when you carry the dead body (the janazah), for if the deceased is righteous, you would be taking it to something better, and if he or she is an evil person, then you will be getting him or her off your necks.’ Agreed upon."}},{"id":37,"idInBook":37,"chapterId":3,"bookId":17,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ \"مَنْ شَهِدَ اَلْجِنَازَةَ حَتَّى يُصَلَّى عَلَيْهَا فَلَهُ قِيرَاطٌ, وَمَنْ شَهِدَهَا حَتَّى تُدْفَنَ فَلَهُ قِيرَاطَانِ\".‏ قِيلَ: وَمَا اَلْقِيرَاطَانِ? قَالَ: \"مِثْلُ اَلْجَبَلَيْنِ اَلْعَظِيمَيْنِ\" }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏ \nوَلِمُسْلِمٍ: { حَتَّى تُوضَعَ فِي اَللَّحْدِ } 2‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (3/196/فتح)‏، ومسلم (945)‏ (52)‏.‏\n‏2 ‏- صحيح.‏ وهذه الرواية في مسلم (2/653)‏.‏","english":{"narrator":"Abu Hurairah (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"\"Whoever accompanies the funeral (the dead body) until he performs the funeral prayer will have a reward equal to (one Qirat), and whoever accompanies the burial procession, will be doubly awarded (two Qirat).” They then asked, ‘What is meant by the two Qirat?’ He replied (ﷺ) “Like two huge mountains.” Agreed upon. Muslim added the statement, ‘until it is buried.’"}},{"id":38,"idInBook":38,"chapterId":3,"bookId":17,"arabic":"وَلِلْبُخَارِيِّ: { مَنْ تَبِعَ جَنَازَةَ مُسْلِمٍ إِيمَانًا وَاحْتِسَابًا, وَكَانَ مَعَهُ حَتَّى يُصَلَّى عَلَيْهَا وَيُفْرَغَ مِنْ دَفْنِهَا فَإِنَّهُ يَرْجِعُ بِقِيرَاطَيْنِ, كُلُّ قِيرَاطٍ مِثْلُ أُحُدٍ }   1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (47)‏ وتمامه: \"ومن صلى عليها، ثم رجع قبل أن تدفن، فإنه يرجع بقيراط\".‏","english":{"narrator":"","text":"Al-Bukhari related on the authority of Abu Hurairah, “Whoever accompanies the funeral of a Muslim, seeking the reward only from Allah, the Almighty, and he stays with it until he offers the funeral prayer and the burial is completed, will return back with two Qirat, each Qirat is equal to the mount of Uhud.”"}},{"id":39,"idInBook":39,"chapterId":3,"bookId":17,"arabic":"وَعَنْ سَالِمٍ, عَنْ أَبِيهِ ‏- رضى الله عنه ‏- { أَنَّهُ رَأَى اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-وَأَبَا بَكْرٍ وَعُمَرَ, يَمْشُونَ أَمَامَ الْجَنَازَةِ }  رَوَاهُ اَلْخَمْسَةُ، وَصَحَّحَهُ ابْنُ حِبَّانَ, وَأَعَلَّهُ النَّسَائِيُّ وَطَائِفَةٌ بِالْإِرْسَالِ  1‏ .‏‏1 ‏- صحيح.‏ رواه أحمد (4539)‏، وأبو داود (3179)‏، والنسائي (4/56)‏، والترمذي (1007 و 1008)‏، وابن ماجه (1482)‏، وابن حبان (766 و 767 و 768 موارد)‏.‏ وما أعل به الحديث، فليس بقادح، وقد أجبت عنه في \"ناسخ الحديث\" (327)‏ لابن شاهين، وأيضا في الأصل.‏","english":{"narrator":"","text":"Salim narrated on the authority of his father (RAA) that he saw the Messenger of Allah (ﷺ), Abu Bakr and ’Umar walking in front of a Funeral.’ Related by the five Imams, and Ibn Hibban rendered it Sahih."}},{"id":40,"idInBook":40,"chapterId":3,"bookId":17,"arabic":"وَعَنْ أُمِّ عَطِيَّةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: { نُهِينَا عَنِ اتِّبَاعِ الْجَنَائِزِ, وَلَمْ يُعْزَمْ عَلَيْنَا }  مُتَّفَقٌ عَلَيْه ِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (1287)‏، ومسلم (938)‏، وانظر \"ناسخ الحديث\" (314)‏.‏","english":{"narrator":"","text":"Umm ‘Atiyah (RAA) narrated, ‘We were forbidden to accompany funeral processions, but this prohibition was not mandatory for us.’ Agreed upon."}},{"id":41,"idInBook":41,"chapterId":3,"bookId":17,"arabic":"وَعَنْ أَبِي سَعِيدٍ ‏- رضى الله عنه ‏- أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { إِذَا رَأَيْتُمُ الْجَنَازَةَ فَقُومُوا, فَمَنْ تَبِعَهَا فَلَا يَجْلِسْ حَتَّى تُوضَعَ }  مُتَّفَقٌ عَلَيْه ِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (1310)‏، ومسلم (959)‏ (77)‏، واللفظ لمسلم، ولفظ البخاري مثله إلا أن عنده: \"فلا يقعد\".‏","english":{"narrator":"Abu Sa’id (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"\"Stand up when you see a funeral procession, and he who accompanies it should not sit down until the coffin is placed on the ground.\" Agreed upon."}},{"id":42,"idInBook":42,"chapterId":3,"bookId":17,"arabic":"وَعَنْ أَبِي إِسْحَاقَ, أَنَّ عَبْدَ اللَّهِ بْنَ يَزِيدَ ‏- رضى الله عنه ‏- { أَدْخَلَ الْمَيِّتَ مِنْ قِبَلِ رِجْلَيِ الْقَبْرَ، وَقَالَ: هَذَا مِنَ السُّنَّةِ }  أَخْرَجَهُ أَبُو دَاوُد َ  1‏ .‏‏1 ‏- صحيح.‏ رواه أبو داود (3211)‏.‏","english":{"narrator":"","text":"Abu Ishaq narrated that ‘Abdullah bin Yazid placed a dead body in the grave from the side near the foot of the grave (i.e. the end which will accommodate the feet when the body is placed in it). He then said, ‘This is the Sunnah of the Prophet (ﷺ).’ Related by Abu Dawud."}},{"id":43,"idInBook":43,"chapterId":3,"bookId":17,"arabic":"وَعَنِ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا, عَنِ النَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { إِذَا وَضَعْتُمْ مَوْتَاكُمْ فِي الْقُبُورِ, فَقُولُوا: بِسْمِ اللَّهِ, وَعَلَى مِلَّةِ رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-.‏ }  أَخْرَجَهُ أَحْمَدُ, وَأَبُو دَاوُدَ, وَالنَّسَائِيُّ, وَصَحَّحَهُ ابْنُ حِبَّانَ, وَأَعَلَّهُ الدَّارَقُطْنِيُّ بِالْوَقْف ِ  1‏ .‏‏1 ‏- صحيح.‏ رواه أحمد (2/27 و 40 و 59 و 69 و 127‏-128)‏، وأبو داود (3213)‏، وابن حبان (3110)‏، وفي رواية: \"وعلى سنة رسول الله\".‏ وأما إعلال الدارقطني رحمه الله للحديث بالوقف فمجاب عليه \"بالأصل\".‏ \"تنبيه\": إطلاق العزو هكذا للنسائي غير جيد، فإن الحديث عند النسائي في \"عمل اليوم والليلة\".‏","english":{"narrator":"Ibn 'Umar (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“When you place your deceased in the grave, say, ‘In the Name of Allah, and in accordance with the tradition of Allah’s Messenger (ﷺ).” Related by Ahmad, Abu Dawud and An-Nasa’i."}},{"id":44,"idInBook":44,"chapterId":3,"bookId":17,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا; أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { كَسْرُ عَظْمِ الْمَيِّتِ كَكَسْرِهِ حَيًّا }  رَوَاهُ أَبُو دَاوُدَ بِإِسْنَادٍ عَلَى شَرْطِ مُسْلِم ٍ  1‏ .‏‏1 ‏- صحيح.‏ رواه أبو داود (3207)‏.‏","english":{"narrator":"A’ishah (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“Breaking a deceased body’s bones is exactly like breaking them when he is alive.” Related by Abu Dawud in accordance with the conditions of Muslim."}},{"id":45,"idInBook":45,"chapterId":3,"bookId":17,"arabic":"وَزَادَ ابْنُ مَاجَهْ مِنْ حَدِيثِ أُمِّ سَلَمَةَ: { فِي الْإِثْمِ }   1‏ .‏‏1 ‏- ضعيف.‏ رواه ابن ماجه (1617)‏، وهذه اللفظ ليست من الحديث، وإنما هي تفسير من بعض الرواة.‏","english":{"narrator":"","text":"Ibn Majah added, on the authority of Umm Salamah (RAA), “with regards to it being a sin.”"}},{"id":46,"idInBook":46,"chapterId":3,"bookId":17,"arabic":"وَعَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ ‏- رضى الله عنه ‏- قَالَ: { أَلْحَدُو ا  1‏ لِي لَحْدًا, وَانْصِبُوا عَلَى اللَّبِنِ نُصْبًا, كَمَا صُنِعَ بِرَسُولِ اللَّهِ ‏- صلى الله عليه وسلم ‏-.‏ }  رَوَاهُ مُسْلِم ٌ  2‏ .‏‏1 ‏- بوصل الهمزة وفتح الحاء، ويجوز بقطع الهمزة وكسر الحاء.‏ واللحد: هو الشق تحت الجانب القبلي من القبر.‏‏2 ‏- صحيح.‏ رواه مسلم (966)‏.‏","english":{"narrator":"","text":"Sa'd bin Abi Wqqas (RAA) said (during his death illness) ‘Make a lahd for me and cover it with un-burnt bricks, as you did with the grave of the Prophet (ﷺ).’ Related by Muslim."}},{"id":47,"idInBook":47,"chapterId":3,"bookId":17,"arabic":"وَلِلْبَيْهَقِيِّ عَنْ جَابِرٍ نَحْوُهُ, وَزَادَ: { وَرُفِعَ قَبْرُهُ عَنِ الْأَرْضِ قَدْرَ شِبْرٍ }  وَصَحَّحَهُ ابْنُ حِبَّان َ  1‏ .‏‏1 ‏- رواه البيهقي (3/407)‏، وابن حبان (8/218/6601)‏ وهو معلول.‏","english":{"narrator":"","text":"Al-Baihaqi transmitted on the authority of Jabir (RAA) a similar narration and added, ‘And his grave was raised one span from the ground.’ Ibn Hibban graded it as Sahih."}},{"id":48,"idInBook":48,"chapterId":3,"bookId":17,"arabic":"وَلِمُسْلِمٍ عَنْهُ: { نَهَى رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-أَنْ يُجَصَّصَ الْقَبْرُ, وَأَنْ يُقْعَدَ عَلَيْهِ, وَأَنْ يُبْنَى عَلَيْهِ }   1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم (970)‏.‏","english":{"narrator":"","text":"Jabir (RAA) narrated that the Messenger of Allah (ﷺ) prohibited whitening a grave with plaster, to sit on it or to build over it (such as a dome).’ Related by Muslim."}},{"id":49,"idInBook":49,"chapterId":3,"bookId":17,"arabic":"وَعَنْ عَامِرِ بْنِ رَبِيعَةَ ‏- رضى الله عنه ‏- { أَنَّ النَّبِيَّ ‏- صلى الله عليه وسلم ‏-صَلَّى عَلَى عُثْمَانَ بْنِ مَظْعُونٍ, وَأَتَى الْقَبْرَ, فَحَثَى عَلَيْهِ ثَلَاثَ حَثَيَاتٍ, وَهُوَ قَائِمٌ }  رَوَاهُ اَلدَّارَقُطْنِيّ ُ  1‏ .‏‏1 ‏- ضعيف جدا.‏ رواه الدارقطني (2/76/1)‏.‏","english":{"narrator":"","text":"‘Amir bin Rabi’Ah (RAA) narrated that the Messenger of Allah (ﷺ) prayed over ‘Uthman bin Madh’un, then went to the grave and sprinkled three handfuls of soil while he was standing.’ Related by Ad-Darqutni."}},{"id":50,"idInBook":50,"chapterId":3,"bookId":17,"arabic":"وَعَنْ عُثْمَانَ ‏- رضى الله عنه ‏- قَالَ: { كَانَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-إِذَا فَرَغَ مِنْ دَفْنِ الْمَيِّتِ وَقَفَ عَلَيْهِ وَقَالَ: \n\"اِسْتَغْفِرُوا لِأَخِيكُمْ وَسَلُوا لَهُ التَّثْبِيتَ, فَإِنَّهُ الْآنَ يُسْأَلُ\" }  رَوَاهُ أَبُو دَاوُدَ, وَصَحَّحَهُ الْحَاكِم ُ  1‏ .‏‏1 ‏- صحيح.‏ رواه أبو داود (3221)‏، والحاكم (1/370)‏ وفي \"أ\": \"واسألوا\".‏","english":{"narrator":"","text":"‘Uthman Ibn ‘Affan (RAA) narrated, ‘Whenever the Messenger of Allah (ﷺ) finished the burial of the dead, he would stand by the grave and say, “Seek forgiveness for your brother and pray for him to be steadfast, because he is now being questioned.” Related by Abu Dawud. Al-Hakim graded it as Sahih."}},{"id":51,"idInBook":51,"chapterId":3,"bookId":17,"arabic":"وَعَنْ ضَمْرَةَ بْنِ حَبِيبٍ أَحَدِ التَّابِعِينَ قَالَ: { كَانُوا يَسْتَحِبُّونَ إِذَا سُوِّيَ عَلَى الْمَيِّتِ قَبْرُهُ, وَانْصَرَفَ اَلنَّاسُ عَنْهُ, أَنْ يُقَالَ عِنْدَ قَبْرِهِ: يَا فُلَانُ! قُلْ: لَا إِلَهَ إِلَّا اَللَّهُ.‏ ثَلَاثُ مَرَّاتٍ, يَا فُلَانُ! قُلْ: رَبِّيَ اللَّهُ, وَدِينِيَ الْإِسْلَامُ, وَنَبِيِّ مُحَمَّدٌ ‏- صلى الله عليه وسلم ‏-}  رَوَاهُ سَعِيدُ بْنُ مَنْصُورٍ مَوْقُوفًا .‏  1‏ .‏‏1 ‏- ضعيف.‏","english":{"narrator":"Damrah bin Habib (one of the Tabi'in or the followers of the Companions) narrated, ‘They (the Companions that he met) recommended that after the grave is leveled and the people leave, that one should stand by the grave and say three times to the deceased, 'O so-and-so, say:","text":"\"There is no god but Allah”, 'O so-and-so, say: \"Allah is my Lord, Islam is my din (religion), and Muhammad is my prophet.” Related by Sa'id bin Mansur."}},{"id":52,"idInBook":52,"chapterId":3,"bookId":17,"arabic":"وَلِلطَّبَرَانِيِّ نَحْوُهُ مِنْ حَدِيثِ أَبِي أُمَامَةَ مَرْفُوعًا مُطَوَّلً ا  1‏ .‏‏1 ‏- ضعيف.‏ وتفصيل الكلام على هذا الحديث والأثر السابق تجده \"بالأصل\"، وفيه رد على كلام الحافظ في \"التلخيص\".‏","english":{"narrator":"","text":"At-Tabarani Related A similar Hadith on the authority of Abu Umamah on the authority of the Prophet (ﷺ)."}},{"id":53,"idInBook":53,"chapterId":3,"bookId":17,"arabic":"وَعَنْ بُرَيْدَةَ بْنِ الْحَصِيبِ الْأَسْلَمِيِّ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ نَهَيْتُكُمْ عَنْ زِيَارَةِ الْقُبُورِ فَزُورُوهَا }  رَوَاهُ مُسْلِم ٌ  1‏ .‏ \nزَادَ اَلتِّرْمِذِيُّ: { فَإِنَّهَا تُذَكِّرُ الْآخِرَةَ } 2‏ .‏‏1 ‏- صحيح.‏ رواه مسلم ( 977 )‏، وتمامه: \"ونهيتكم عن لحوم الأضاحي فوق ثلاث، فأمسكوا ما بدا لكم، ونهيتكم عن النبيذ إلا في سقاء فاشربوا فيه الأسقية كلها.‏ ولا تشربوا مسكرا \".‏\n‏2 ‏- صحيح.‏ رواه الترمذي ( 1054 )‏، وقال: \"حديث حسن صحيح\".‏","english":{"narrator":"Buraidah bin Al-Husaib al-Aslami (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“I had forbidden you to visit graves, but now you may visit them.” Related by Muslim. At-Tirmidhi added the following, “It will remind you of the Here-after.\""}},{"id":54,"idInBook":54,"chapterId":3,"bookId":17,"arabic":"زَادَ ابْنُ مَاجَهْ مِنْ حَدِيثِ ابْنِ مَسْعُودٍ: { وَتُزَهِّدُ فِي الدُّنْيَا }   1‏ .‏‏1 ‏- ضعيف.‏ رواه ابن ماجه ( 1571 )‏.‏","english":{"narrator":"","text":"Ibn Majah added on the authority of Bin Mas’ud, “And they make you (i.e. the graves) renounce this worldly life.”"}},{"id":55,"idInBook":55,"chapterId":3,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- { أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-لَعَنَ زَائِرَاتِ الْقُبُورِ }  أَخْرَجَهُ اَلتِّرْمِذِيُّ, وَصَحَّحَهُ ابْنُ حِبَّانَ .‏  1‏ .‏‏1 ‏- صحيح.‏ رواه الترمذي ( 1056 )‏، وابن حبان ( 3178 )‏، وله شواهد.‏ وقد ذكرتها وذكرت ألفاظها، وتكلمت على أسانيدها في رسالة \"القول المأثور بما ورد في زيارة المرأة للقبور\" وعسى أن يطيع قريبا.‏","english":{"narrator":"","text":"Abu Hurairah (RAA) narrated that the Messenger of Allah (ﷺ) cursed the women who frequently visit the graves. Related At-Tirmidhi and Ibn Hibban graded it as Sahih."}},{"id":56,"idInBook":56,"chapterId":3,"bookId":17,"arabic":"وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ‏- رضى الله عنه ‏- قَالَ : { لَعَنَ رَسُولُ اللَّهِ ‏- صلى الله عليه وسلم ‏-اَلنَّائِحَةَ , وَالْمُسْتَمِعَةَ }  أَخْرَجَهُ أَبُو دَاوُدَ .‏  1‏‏1 ‏- ضعيف .‏ رواه أبو داود (3128)‏ .‏","english":{"narrator":"","text":"Abu Sa'id Al-Khudri (RAA) narrated that the Messenger of Allah (ﷺ) cursed the wailing women and those who listen to them. Related by Abu Dawud."}},{"id":57,"idInBook":57,"chapterId":3,"bookId":17,"arabic":"وَعَنْ أُمِّ عَطِيَّةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: { أَخَذَ عَلَيْنَا رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-أَنْ لَا نَنُوحَ }  مُتَّفَقٌ عَلَيْه ِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 1306 )‏، ومسلم ( 936 )‏.‏","english":{"narrator":"","text":"Umm ‘Atiyah (RAA) narrated that the Messenger of Allah (ﷺ) made us pledge that we will not wail. Agreed upon."}},{"id":58,"idInBook":58,"chapterId":3,"bookId":17,"arabic":"وَعَنْ ابْن عُمَرَ ‏- رضى الله عنه ‏- عَنِ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { اَلْمَيِّتُ يُعَذَّبُ فِي قَبْرِهِ بِمَا نِيحَ عَلَيْهِ }  مُتَّفَقٌ عَلَيْه ِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 1292 )‏، ومسلم ( 927 )‏ ( 17 )‏.‏","english":{"narrator":"","text":"Ibn ’Umar (RAA) narrated that the Messenger of Allah said, “A dead person is tormented in his grave by the wailing for him.” Agreed upon."}},{"id":59,"idInBook":59,"chapterId":3,"bookId":17,"arabic":"وَلَهُمَا: نَحْوُهُ عَنِ الْمُغِيرَةِ بْنِ شُعْبَة َ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 1291 )‏، ومسلم ( 933 )‏، ولفظه: \"من نيح عليه فإنه يعذب بما نيح عليه\" زاد مسلم: \"يوم القيامة\".‏","english":{"narrator":"","text":"Al-Bukhari and Muslim transmitted a similar narration on the authority of Al·Mughirah bin Shu'bah."}},{"id":60,"idInBook":60,"chapterId":3,"bookId":17,"arabic":"وَعَنْ أَنَسٍ ‏- رضى الله عنه ‏- قَالَ: { شَهِدْتُ بِنْتًا لِلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-تُدْفَنُ , 151 وَرَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-جَالِسٌ عِنْدَ اَلْقَبْرِ، فَرَأَيْتُ عَيْنَيْهِ تَدْمَعَانِ }  رَوَاهُ اَلْبُخَارِيّ ُ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 1285 )‏.‏","english":{"narrator":"","text":"Anas (RAA) narrated Attended the burial of one of the daughters of the Prophet (ﷺ) He was sitting by the side of the grave and his eyes were shedding tears.’ Related by Al-Bukhari."}},{"id":61,"idInBook":61,"chapterId":3,"bookId":17,"arabic":"وَعَنْ جَابِرٍ ‏- رضى الله عنه ‏- أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَالَ: { لَا تَدْفِنُوا مَوْتَاكُمْ بِاللَّيْلِ إِلَّا أَنْ تُضْطَرُّوا }  أَخْرَجَهُ ابْنُ مَاجَه ْ  1‏ .‏ وَأَصْلُهُ فِي \n\"مُسْلِمٍ\", لَكِنْ قَالَ: زَجَرَ أَنْ يُقْبَرَ اَلرَّجُلُ بِاللَّيْلِ, حَتَّى يُصَلَّى عَلَيْهِ.‏‏1 ‏- صحيح.‏ رواه ابن ماجه ( 1521 )‏.‏","english":{"narrator":"Jabir bin ‘Abdullah (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"\"Do not bury your dead during the night unless you have to do so.\" Related by Ibn Majah. Muslim reported a similar narration, but Jabir said in his narration, ‘The Prophet (ﷺ) disapproved that someone is buried at night, unless the funeral prayer has been offered for him.’"}},{"id":62,"idInBook":62,"chapterId":3,"bookId":17,"arabic":"وَعَنْ عَبْدِ اَللَّهِ بْنِ جَعْفَرٍ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { لَمَّا جَاءَ نَعْيُ جَعْفَرٍ ‏-حِينَ قُتِلَ‏- قَالَ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-\n\"اصْنَعُوا لِآلِ جَعْفَرٍ طَعَامًا, فَقَدْ أَتَاهُمْ مَا يَشْغَلُهُمْ\" }  أَخْرَجَهُ الْخَمْسَةُ, إِلَّا النَّسَائِيّ َ  1‏ .‏‏1 ‏- حسن.‏ رواه أحمد ( 1 / 205 )‏، وأبو داود ( 3132 )‏، والترمذي ( 998 )‏، وابن ماجه ( 1610 )‏، وقال الترمذي: \"هذا حديث حسن صحيح\".‏","english":{"narrator":"‘Abdullah Ibn Ja’far (RAA) narrated, ‘When we received the news of Ja’far’s death; when he was killed (in the Battle of Mu’tah), the Prophet(ﷺ) said:","text":"“Prepare some food for the family of Ja’far, for what has befallen them is keeping them preoccupied.” Related by the five lmams except for An-Nasa’i."}},{"id":63,"idInBook":63,"chapterId":3,"bookId":17,"arabic":"وَعَنْ سُلَيْمَانَ بْنِ بُرَيْدَةَ عَنْ أَبِيهِ قَالَ: كَانَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يُعَلِّمُهُمْ إِذَا خَرَجُوا إِلَى اَلمَقَابِرِ: { اَلسَّلَامُ عَلَى أَهْلِ اَلدِّيَارِ مِنَ اَلْمُؤْمِنِينَ وَالْمُسْلِمِينَ, وَإِنَّا إِنْ شَاءَ اَللَّهُ بِكُمْ لَلَاحِقُونَ, أَسْأَلُ اَللَّهَ لَنَا وَلَكُمُ الْعَافِيَةَ }  رَوَاهُ مُسْلِم ٌ  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم ( 975 )‏.‏","english":{"narrator":"","text":"Sulaiman bin Buraidah narrated on the authority of his father (RAA) that the Prophet (ﷺ) taught us that when we visit graves we should say, “Peace be upon you, O believing men and women, O dwellers of this place. Certainly, Allah willing, we will join you. We supplicate to Allah to grant us and you well being.” Related by Muslim."}},{"id":64,"idInBook":64,"chapterId":3,"bookId":17,"arabic":"وَعَنْ ابْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { مَرَّ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-بِقُبُورِ اَلْمَدِينَةِ, فَأَقْبَلَ عَلَيْهِمْ بِوَجْهِهِ فَقَالَ: \n\"اَلسَّلَامُ عَلَيْكُمْ يَا أَهْلَ اَلْقُبُورِ, يَغْفِرُ اَللَّهُ لَنَا وَلَكُمْ, أَنْتُمْ سَلَفُنَا وَنَحْنُ بِالْأَثَرِ\" }  رَوَاهُ اَلتِّرْمِذِيُّ, وَقَالَ: حَسَن ٌ  1‏ .‏‏1 ‏- ضعيف.‏ رواه الترمذي ( 1053 )‏ وقال: حديث حسن غريب.‏ قلت: وهذا الحديث ضعيف؛ لضعف سنده ‏-وإن كان هناك ما يشهد له‏- خاصة وإن هذا الحديث فيه جملة منكرة.‏","english":{"narrator":"","text":"Ibn ‘Abbas (RAA) narrated, ‘Once the Messenger of Allah (ﷺ) passed by some graves in Madinah. He turned his face toward them saying, “Peace be upon you, O dwellers of these graves. May Allah forgive you and us. You have preceded us, and we are following your trail.\" Related by At-Tirmidhi, who graded it as Hasan."}},{"id":65,"idInBook":65,"chapterId":3,"bookId":17,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا تَسُبُّوا الْأَمْوَاتَ, فَإِنَّهُمْ قَدْ أَفْضَوْا إِلَى مَا قَدَّمُوا }  رَوَاهُ اَلْبُخَارِيّ ُ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 1393 )‏.‏","english":{"narrator":"A’ishah (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“Do not speak badly of the dead, they have already seen the result of (the deeds) that they sent on before them.” Related by Al·Bukhari."}},{"id":66,"idInBook":66,"chapterId":3,"bookId":17,"arabic":"وَرَوَى اَلتِّرْمِذِيُّ عَنِ اَلمُغِيرَةِ نَحْوَهُ, لَكِنْ قَالَ: { فَتُؤْذُوا الْأَحْيَاءَ }   1‏ .‏‏1 ‏- صحيح.‏ رواه الترمذي ( 1982 )‏.‏","english":{"narrator":"","text":"At-Tirmidhi Related a similar narration on the authority of Al-Mughirah bin Shu’bah, and he added, \"Thus you will be offending the living (i.e. if you curse their dead).\""}}],"chapter":{"id":3,"bookId":17,"arabic":"كتاب الجنائز","english":"Funerals"}}