{"metadata":{"length":51,"arabic":{"title":"بلوغ المرام","author":"الإمام ابن حجر العسقلاني","introduction":"كتاب الزكاة"},"english":{"title":"Bulugh al-Maram","author":"Ibn Hajar al-Asqalani","introduction":"The Book of Zakah"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":4,"bookId":17,"arabic":"عَنِ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا: { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-بَعَثَ مُعَاذًا ‏- رضى الله عنه ‏- إِلَى اَلْيَمَنِ.‏.‏.‏ }  فَذَكَرَ اَلْحَدِيثَ, وَفِيهِ: { أَنَّ اَللَّهَ قَدِ اِفْتَرَضَ عَلَيْهِمْ صَدَقَةً فِي أَمْوَالِهِمْ, تُؤْخَذُ مِنْ أَغْنِيَائِهِمْ, فَتُرَدُّ فِ ي  1‏ فُقَرَائِهِمْ }  مُتَّفَقٌ عَلَيْهِ, وَاللَّفْظُ لِلْبُخَارِيّ ِ  2‏ .‏‏1 ‏- كذا في الأصلين، وهي رواية مسلم، وأشار في هامش \"أ\" أن في نسخة \"على\" وهي رواية البخاري ومسلم.‏‏2 ‏- صحيح.‏ رواه البخاري ( 1395 )‏، ومسلم ( 19 )‏، ولفظه: أن رسول الله صلى الله عليه وسلم بعث معاذا إلى اليمن، فقال له: \"إنك تأتي قوما أهل كتاب، فادعهم إلى شهادة أن لا إله إلا الله وأني رسول الله، فإن هم أطاعوا لذلك، فأعلمهم أن الله افترض عليهم صدقة في أموالهم، تؤخذ من أغنيائهم وترد على فقرائهم، فإن هم أطاعوا لذلك، فإياك وكرائن أمولهم، واتق دعوة المظلوم؛ فإنها ليس بينها وبين الله حجاب\".‏","english":{"narrator":"Ibn 'Abbas (RAA) narrated that when the Prophet (ﷺ) sent Mu'adh Ibn Jabal to Yemen (as governor), he said to him:","text":"“You are going to a people who are People of the Scripture. Invite them to testify that none has the right to be worshipped but Allah and that l am His Messenger. If they obey you in this, then teach them that Allah, the Glorious One, has enjoined five prayers upon them in every day and night (in twenty-four hours), and if they obey you in this, then tell them that Allah has made it obligatory for them to pay Zakah upon their assets and it is to be taken from the wealthy among them and given to the poor among them.” Related by Al-Bukhari"}},{"id":2,"idInBook":2,"chapterId":4,"bookId":17,"arabic":"وَعَنْ أَنَسٍ ‏- رضى الله عنه ‏- أَنَّ أَبَا بَكْرٍ اَلصِّدِّيقَ ‏- رضى الله عنه ‏- كَتَبَ لَه ُ  1‏ { هَذِهِ فَرِيضَةُ اَلصَّدَقَةِ اَلَّتِي فَرَضَهَا رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-عَلَى اَلْمُسْلِمِينَ, وَاَلَّتِي أَمَرَ اَللَّهُ بِهَا رَسُولَه ُ  2‏ فِي أَرْبَعٍ وَعِشْرِينَ مِنَ اَلْإِبِلِ فَمَا دُونَهَا اَلْغَنَم ُ  3‏ فِي كُلِّ خَمْسٍ شَاةٌ, فَإِذَا بَلَغَتْ خَمْسًا وَعِشْرِينَ إِلَى خَمْسٍ وَثَلَاثِينَ فَفِيهَا بِنْتُ مَخَاضٍ أُنْثَ ى  4‏ فَإِنْ لَمْ تَكُنْ فَابْنُ لَبُونٍ ذَكَر ٍ  5‏ فَإِذَا بَلَغَتْ سِتًّا وَثَلَاثِينَ إِلَى خَمْسٍ وَأَرْبَعِينَ فَفِيهَا بِنْتُ لَبُون ٍ  6‏ أُنْثَى, فَإِذَا بَلَغَتْ سِتًّا وَأَرْبَعِينَ إِلَى سِتِّينَ فَفِيهَا حِقَّةٌ طَرُوقَةُ اَلْجَمَل ِ  7‏ فَإِذَا بَلَغَتْ وَاحِدَةً وَسِتِّينَ إِلَى خَمْسٍ وَسَبْعِينَ فَفِيهَا جَذَعَة ٌ  8‏ فَإِذَا بَلَغَتْ سِتًّا وَسَبْعِينَ إِلَى تِسْعِينَ فَفِيهَا بِنْتَا لَبُونٍ, فَإِذَا بَلَغَتْ إِحْدَى وَتِسْعِينَ إِلَى عِشْرِينَ وَمِائَةٍ فَفِيهَا حِقَّتَانِ طَرُوقَتَا اَلْجَمَلِ, فَإِذَا زَادَتْ عَلَى عِشْرِينَ وَمِائَةٍ فَفِي كُلِّ أَرْبَعِينَ بِنْتُ لَبُونٍ, وَفِي كُلِّ خَمْسِينَ حِقَّةٌ, وَمَنْ لَمْ يَكُنْ مَعَهُ إِلَّا أَرْبَعٌ مِنَ اَلْإِبِلِ فَلَيْسَ فِيهَا صَدَقَةٌ إِلَّا أَنْ يَشَاءَ رَبُّهَا  9‏ .‏ \nوَفِي صَدَقَةِ اَلْغَنَمِ سَائِمَتِهَا إِذَا كَانَتْ أَرْبَعِينَ إِلَى عِشْرِينَ وَمِائَةِ شَاة ٍ  10‏ شَاةٌ, فَإِذَا زَادَتْ عَلَى عِشْرِينَ وَمِائَةٍ إِلَى مِائَتَيْنِ فَفِيهَا شَاتَانِ, فَإِذَا زَادَتْ عَلَى مِائَتَيْنِ إِلَى ثَلَاثمِائَةٍ فَفِيهَا ثَلَاثُ شِيَاه ٍ  11‏ فَإِذَا زَادَتْ عَلَى ثَلَاثِمِائَةٍ فَفِي كُلِّ مِائَةٍ شَاةٌ، فَإِذَا كَانَتْ سَائِمَةُ اَلرَّجُلِ نَاقِصَةً مِنْ أَرْبَعِينَ شَاة ٍ  12‏ شَاةً وَاحِدَةً فَلَيْسَ فِيهَا صَدَقَةٌ, إِلَّا أَنْ يَشَاءَ رَبُّهَا.‏ \nوَلَا يُجْمَعُ بَيْنَ مُتَفَرِّقٍ وَلَا يُفَرَّقُ بَيْنَ مُجْتَمِعٍ خَشْيَةَ اَلصَّدَقَةِ, وَمَا كَانَ مِنْ خَلِيطَيْنِ فَإِنَّهُمَا يَتَرَاجَعَانِ بَيْنَهُمَا بِالسَّوِيَّةِ, وَلَا يُخْرَجُ فِي اَلصَّدَقَةِ هَرِمَة ٌ  13‏ وَلَا ذَاتُ عَوَارٍ, إِلَّا أَنْ يَشَاءَ اَلْمُصَّدِّقُ، وَفِي اَلرِّقَة ِ  14‏ رُبُعُ اَلْعُشْرِ, فَإِنْ لَمْ تَكُن ْ  15‏ إِلَّا تِسْعِينَ وَمِائَةً فَلَيْسَ فِيهَا صَدَقَةٌ إِلَّا أَنْ يَشَاءَ رَبُّهَا, وَمَنْ بَلَغَتْ عِنْدَهُ مِنَ اَلْإِبِلِ صَدَقَةُ اَلْجَذَعَةِ وَلَيْسَتْ عِنْدَهُ جَذَعَةٌ وَعِنْدَهُ حِقَّةٌ, فَإِنَّهَا تُقْبَلُ مِنْهُ اَلْحِقَّةُ, وَيَجْعَلُ مَعَهَا شَاتَيْنِ إِنِ اِسْتَيْسَرَتَا لَهُ, أَوْ عِشْرِينَ دِرْهَمًا, وَمَنْ بَلَغَتْ عِنْدَهُ صَدَقَةُ اَلْحِقَّةِ وَلَيْسَتْ عِنْدَهُ اَلْحِقَّةُ, وَعِنْدَهُ اَلْجَذَعَةُ, فَإِنَّهَا تُقْبَلُ مِنْهُ اَلْجَذَعَةُ, وَيُعْطِيهِ اَلْمُصَّدِّقُ عِشْرِينَ دِرْهَمًا أَوْ شَاتَيْنِ }  رَوَاهُ اَلْبُخَارِيّ ُ  16‏ .‏‏1 ‏- جاء في البخاري بعد ذلك قوله: \"هذا الكتاب، لما وجهه إلى البحرين.‏ بسم الله الرحمن الرحيم\".‏‏2 ‏- في البخاري زيادة: \"فمن سئلها من المسلمين على وجهها فليعطها، ومن سئل فوقها فلا يعط\".‏‏3 ‏- في البخاري \"من الغنم\"، أي: تؤخذ الغنم في زكاتها.‏‏4 ‏- ما استكمل من الإبل السنة الأولى ودخل في الثانية.‏‏5 ‏- هذه الجملة ليست في البخاري.‏‏6 ‏- من الإبل، ما استكمل السنة الثانية، ودخل في الثالثة.‏‏7 ‏- هي التي أتت عليها ثلاث سنين ودخلت في الرابعة، والمراد: أنها بلغت أن يطرقها الفحل.‏‏8 ‏- هي التي أتى عليها أربع سنين، ودخلت في الخامسة.‏\n‏9 ‏- أي: صاحبها.‏\n‏10 ‏- هذه اللفظة ليست في البخاري.‏‏11 ‏- هذه اللفظة ليست في البخاري.‏‏12 ‏- هذه اللفظة ليست في البخاري.‏\n‏13 ‏- التي سقطت أسنانها.‏‏14 ‏- هي الفضة الخالصة سواء كانت مضروبة أو غير مضروبة.‏‏15 ‏- في الأصلين: \"يكن\".‏‏16 ‏- صحيح.‏ رواه البخاري ( 1454 )‏ ومما تجدر الإشارة إليه أنه لا توجد رواية واحدة في البخاري بهذا السياق، ولكن الحافظ جمع بين روايات الحديث، وانظر البخاري رقم ( 1448 )‏، لتقف على أطراف الحديث.‏","english":{"narrator":"","text":"Anas (RAA) narrated that Abu Bakr As-Siddiq (RAA) wrote him this letter, “This is the obligatory Zakah, which the Messenger of Allah (ﷺ) made obligatory for every Muslim, and which Allah, the Almighty had commanded him to observe. ‘For each twenty-four camels, or less, their Zakah is to be paid as sheep; for every live camels, their Zakah is one sheep. When the amount of camels is between twenty -five to thirty- five, the due Zakah is one she-camel ‘bint makhad’ (a camel which is one year old and just starting the second year) or a male camel ‘ibn labun’(a young male camel which is two years old and already starting the third year). However, when the amount of camels reaches thirty-six, the due Zakah is a young she-camel 'bint labun’ (a young female camel, which is two years old and already starting the third year). When they reach forty six to sixty camels, their due Zakah is a she camel ‘hiqqah’ (which is three years old and starting the fourth). When they reach sixty-one to seventy-five, one ‘Jaz'ah’ (a four year old camel already starting its fifth year). When their number is between seventy-six to ninety camels, their due Zakah is two young she camels ‘bint labun’. When they are in the range between ninety-one to one hundred and twenty camels, the Zakah is two young she camels 'hiqqah’. If they are over a hundred and twenty camels, on every forty camels, one 'bint labun’ is due. And for every fifty camels (over one hundred and twenty) a young she-camel ‘hiqqah’ is due, And anyone, who has got only four camels, does not have to pay Zakah unless he (the owner of the camels) wants to give something voluntarily. Regarding the Zakah of grazing sheep, if they are between forty and one hundred and twenty, one sheep is due as Zakah. lf they are between 120 and 200, two sheep are due. If they are between 200 and 300, three sheep are due. If they exceed three hundred sheep, then one sheep is due for every extra hundred grazing heads. If the grazing sheep are less than forty, (even if they are 39) then no Zakah is due on them, unless he (the owner of the camels) wants to give something voluntarily. \nOne should not combine (i.e. gather young animals together) or separate them for fear of paying Zakah. When there is a mixture of cattle shared between two partners, and Zakah is paid jointly between them, then they have to calculate it equally among them (depending on the share of each). Neither an old or a defective animal nor a male goat (a ram used for breeding) may be taken as Zakah, unless the Zakah collector wishes to do so. Concerning silver, the Zakah paid is a quarter of a tenth for each 200 Dirhams. If the amount of silver is less than two hundred Dirhams (even if it is 190) then no Zakah is to be paid for it, unless the owner wishes to do so. If the number of camels reaches the number on which a jaz'ah (a four year old camel already starting its fifth year) is due as Zakah, but he only has a ‘hiqqah’ (a she camel which is three years old and starting the fourth), it should be accepted from him along with two sheep if they were available (to compensate for the difference) or twenty Dirhams. If on the other hand he has to offer a ‘hiqqah’ as Zakah, but he only has a jaz'ah, it is accepted from him, and the Zakah collector will then pay him the difference, which is twenty Dirhams or two female sheep.’ Related by AI-Bukhari."}},{"id":3,"idInBook":3,"chapterId":4,"bookId":17,"arabic":"وَعَنْ مُعَاذِ بْنِ جَبَلٍ ‏- رضى الله عنه ‏- { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-بَعَثَهُ إِلَى اَلْيَمَنِ, فَأَمَرَهُ أَنْ يَأْخُذَ مِنْ كُلِّ ثَلَاثِينَ بَقَرَةً تَبِيعًا أَوْ تَبِيعَةً, وَمِنْ كُلِّ أَرْبَعِينَ مُسِنَّةً, وَمِنْ كُلِّ حَالِمٍ دِينَارًا أَوْ عَدْلَهُ مُعَافِرَ }  رَوَاهُ اَلْخَمْسَةُ, وَاللَّفْظُ لِأَحْمَدَ, وَحَسَّنَهُ اَلتِّرْمِذِيُّ وَأَشَارَ إِلَى اِخْتِلَافٍ فِي وَصْلِهِ, وَصَحَّحَهُ اِبْنُ حِبَّانَ, وَالْحَاكِم ُ  1‏ .‏‏1 ‏- صحيح.‏ رواه أبو داود ( 1576 )‏، والترمذي ( 623 )‏، والنسائي ( 5 / 25 ‏- 26 )‏، وابن ماجه ( 1803 )‏، وأحمد ( 5 / 230 )‏، وصححه ابن حبان ( 7 / 195 )‏، والحاكم ( 1 / 398 )‏.‏ وقال الترمذي: \" هذا حديث حسن.‏ وروى بعضهم هذا الحديث عن سفيان، عن الأعمش، عن أبي وائل، عن مسروق! أن النبي صلى الله عليه وسلم: بعث معاذا إلى اليمن، فأمره أن يأخذ.‏ وهذا أصح\".‏ قلت: لا يؤثر هذا الخلاف في صحة الحديث، والترمذي نفسه أخذ بهذا، فضلا عن وجود ما يشهد للحديث.‏ و \"التبيع\": هو ذو الحول.‏ و \"المسن\": هو ذو الحولين.‏ و \"معافر\": على وزن \"مساجد\" حي في اليمن تنسب الثياب المعافرية إليهم.‏","english":{"narrator":"","text":"Mu’adh bin Jabal (RAA) narrated, ‘When the Messenger of Allah (ﷺ) sent him to Yemen, he commanded him to take a ‘tabi’(young bull) or ‘tabi'ah’ (young cow, which is one year old), as Zakah for every 30 cows. And for every forty cows, a musinnah (two year old cow) is due. Every non-Muslim who attained the age of puberty should pay one Dinar or the equivalent from the Mu'afiri clothes (made in a town in Yemen called Ma'afir).’ Related by the Five Imams and the wording is from Ahmad."}},{"id":4,"idInBook":4,"chapterId":4,"bookId":17,"arabic":"وَعَنْ عَمْرِو بْنِ شُعَيْبٍ, عَنْ أَبِيهِ, عَنْ جَدِّهِ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ تُؤْخَذُ صَدَقَاتُ اَلْمُسْلِمِينَ عَلَى مِيَاهِهِمْ }  رَوَاهُ أَحْمَد ُ  1‏ .‏‏1 ‏- حسن.‏ رواه أحمد ( 6730 )‏.‏","english":{"narrator":"'Amro bin Shu'aib narrated on the authority of his father, who reported on the authority of his grandfather (RAA) that the Messenger of Allah (ﷺ) said:","text":"“The Zakah of the Muslims should be collected by their water trough.” Related by Ahmad."}},{"id":5,"idInBook":5,"chapterId":4,"bookId":17,"arabic":"وَلِأَبِي دَاوُدَ: { وَلَا تُؤْخَذُ صَدَقَاتُهُمْ إِلَّا فِي دُورِهِمْ }   1‏ .‏‏1 ‏- حسن.‏ رواه أبو داود ( 1591 )‏، وأوله: \"لا جلب، ولا جنب،، ولا تؤخذ.‏.‏.‏.‏.‏.‏ \".‏","english":{"narrator":"","text":"Abu Dawud also has the narration, “Their Zakah should only be collected by their dwellings.”"}},{"id":6,"idInBook":6,"chapterId":4,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَيْسَ عَلَى اَلْمُسْلِمِ فِي عَبْدِهِ وَلَا] فِي [ فَرَسِهِ صَدَقَةٌ }  رَوَاهُ اَلْبُخَارِيّ ُ  1‏ .‏ \nوَلِمُسْلِمٍ: { لَيْسَ فِي اَلْعَبْدِ صَدَقَةٌ إِلَّا صَدَقَةُ اَلْفِطْرِ }   2‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 1464 )‏، وله في لفظ: \"غلامه\" بدل \"عبده\" ( 1463 )‏.‏ \"تنبيه\": كان من الأولى عزو الحديث إلى البخاري ومسلم، إذ في صنيع الحافظ ما يشعر أن هذا اللفظ للبخاري دون مسلم، بينما الحديث متفق عليه، بل اللفظ الذي ذكره الحافظ هو لمسلم ( 982 )‏ دون البخاري.‏\n‏2 ‏- صحيح.‏ وهو عند مسلم ( 982 )‏ )‏ 10 )‏.‏","english":{"narrator":"Abu Hurairah (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“No Zakah is to be paid on one’s horse (that he rides) or one’s slave.” Related by Al-Bukhari. Muslim also has the narration, “There is no Zakah to be paid on one’s slave, except for Zakat-ul-Fitr (which is paid at the end of Ramadan, and a Muslim must pay it on behalf of all of those he is responsible for).”"}},{"id":7,"idInBook":7,"chapterId":4,"bookId":17,"arabic":"وَعَنْ بَهْزِ بْنِ حَكِيمٍ, عَنْ أَبِيهِ, عَنْ جَدِّهِ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ فِي كُلِّ سَائِمَةِ إِبِلٍ: فِي أَرْبَعِينَ بِنْتُ لَبُونٍ, لَا تُفَرَّقُ إِبِلٌ عَنْ حِسَابِهَا, مَنْ أَعْطَاهَا مُؤْتَجِرًا بِهَا فَلَهُ أَجْرُهُ, وَمَنْ مَنَعَهَا فَإِنَّا آخِذُوهَا وَشَطْرَ مَالِهِ, عَزْمَةً مِنْ عَزَمَاتِ رَبِّنَا, لَا يَحِلُّ لِآلِ مُحَمَّدٍ مِنْهَا شَيْءٌ }  رَوَاهُ أَحْمَدُ, وَأَبُو دَاوُدَ, وَالنَّسَائِيُّ, وَصَحَّحَهُ اَلْحَاكِمُ, وَعَلَّقَ اَلشَّافِعِيُّ اَلْقَوْلَ بِهِ عَلَى ثُبُوتِه ِ  1‏ .‏‏1 ‏- حسن.‏ رواه أبو داود ( 1575 )‏، والنسائي ( 5 / 15 ‏- 17 و 25 )‏، وأحمد ( 5 / 2 و4 )‏، وصححه الحاكم ( 1 / 398 )‏.‏ قلت: وأما تعليق الشافعي القول به على صحته، فقد رواه البيهقي في \"السنن الكبرى\" وذلك لرأيه في بهز، ولكن لا عبرة بذلك مع توثيق ابن معين، وابن المديني، والنسائي لبهز، وهم أئمة هذا الشأن.‏ وأما ابن حبان فقد هول في كلامه عنه فقال في \"المجروحين\" ( 1 / 194 )‏: \"كان يخطئ كثيرا، فأما أحمد بن حنبل وإسحاق بن إبراهيم رحمهما الله فهما يحتجان به، ويرويان عنه، وتركه جماعة من أئمتنا، ولولا حديث: \"إنا آخذوه وشطر إبله عزمة من عزمات ربنا\" لأدخلناه في \"الثقات\" وهو ممن استخير الله عز وجل فيه\".‏ وقد تعقب الذهبي ‏-كعادته‏- ابن حبان، فقال في: \"التاريخ\" ( 9 / 80 ‏- 81 )‏: \"قلت: على أبي حاتم البستي في قوله هذا مؤاخذات، إحداها: قوله: كان يخطئ كثيرا.‏ وإنما يعرف خطأ الرجل بمخالفة رفاقه له، وهذا فانفرد بالنسخة المذكورة، وما شاركه فيها ولا له في عامتها رفيق، فمن أين لك أنه أخطأ؟! الثاني: قولك: تركه جماعة، فما علمت أحدا تركه أبدا، بل قد يتركون الاحتجاج بخبره، فهلا أفصحت بالحق؟! الثالث: ولولا حديث: \"إنا آخذوها.‏.‏.‏.‏\" فهو حديث انفرد به أصلا ورأسا، وقال بعض المجتهدين.‏.‏.‏.‏ وحديثه قريب من الصحة \".‏","english":{"narrator":"Bahz bin Hakam narrated on the authority of his father, who reported on the authority of his grandfather (RAA) that the Messenger of Allah (ﷺ) said:","text":"“For every forty camels, one ‘bint labun’ (a young female camel which is two years old and already starting the third year), is due as Zakah. No camel is to be separated from the rest of the camels (i.e. the jointly owned live stock as mentioned above). Whoever gives it willingly, seeking his reward from Allah, will be rewarded. (However) if someone refrains from paying it, it will be taken from him (by force) along with part of his property (as punishment), for it is a right of Allah. None of it is lawful for the family of Muhammad (ﷺ).\" Related by Ahmad, An-Nasa’i, Abu Dawud and Al-Hakim rendered it Sahih. And Ash-Shafi'ee conditioned ruling by it depending on its authenticity."}},{"id":8,"idInBook":8,"chapterId":4,"bookId":17,"arabic":"وَعَنْ عَلِيٍّ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِذَا كَانَتْ لَكَ مِائَتَا دِرْهَمٍ ‏-وَحَالَ عَلَيْهَا اَلْحَوْلُ‏- فَفِيهَا خَمْسَةُ دَرَاهِمَ, وَلَيْسَ عَلَيْكَ شَيْءٌ حَتَّى يَكُونَ لَكَ عِشْرُونَ دِينَارًا, وَحَالَ عَلَيْهَا اَلْحَوْلُ, فَفِيهَا نِصْفُ دِينَارٍ, فَمَا زَادَ فَبِحِسَابِ ذَلِكَ, وَلَيْسَ فِي مَالٍ زَكَاةٌ حَتَّى يَحُولَ عَلَيْهِ اَلْحَوْلُ }  رَوَاهُ أَبُو دَاوُدَ, وَهُوَ حَسَنٌ, وَقَدِ اِخْتُلِفَ فِي رَفْعِه ِ  1‏ .‏‏1 ‏- صحيح.‏ رواه أبو داود ( 1573 )‏، وإن كان الدارقطني أعله بالوقف، فلقد صححه البخاري.‏","english":{"narrator":"Ali (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“When you possess two hundred Dirhams at the end of the year (if you still have all of them), five Dirhams are levied on them as Zakah. There is nothing upon you (to be paid) in gold, until it reaches (the value of) twenty Dinars. When you possess twenty Dinars, at the end of the year, then there is half a Dinar levied on it (as Zakah). Any additional amount will be calculated in the same manner. No Zakah is to be paid on monetary holdings, until they have been owned for one year.” Related by Abu Dawud, who rendered it Hasan."}},{"id":9,"idInBook":9,"chapterId":4,"bookId":17,"arabic":"وَلِلتِّرْمِذِيِّ; عَنِ اِبْنِ عُمَرَ: { مَنِ اِسْتَفَادَ مَالًا, فَلَا زَكَاةَ عَلَيْهِ حَتَّى يَحُولَ اَلْحَوْلُ }  وَالرَّاجِحُ وَقْفُه ُ  1‏ .‏‏1 ‏- رواه الترمذي ( 3 / 25 ‏- 26 )‏ مرفوعا وموقوفا، وصحح الموقوف.‏ قلت: المرفوع صحيح بما له من شواهد، حديث علي رضي الله عنه الماضي ( 606 )‏ أحدها.‏ والموقوف في حكم المرفوع.‏ والله أعلم.‏","english":{"narrator":"","text":"Ibn Umar (RAA) narrated, ‘Whoever earns any money, he is not liable to pay Zakah, until the period of a year has passed (while still possessing the same amount of money).’ Related by At-Tirmidhi."}},{"id":10,"idInBook":10,"chapterId":4,"bookId":17,"arabic":"وَعَنْ عَلِيٍّ ‏- رضى الله عنه ‏- قَالَ: { لَيْسَ فِي اَلْبَقَرِ اَلْعَوَامِلِ صَدَقَةٌ }  رَوَاهُ أَبُو دَاوُدَ, وَاَلدَّارَقُطْنِيُّ, وَالرَّاجِحُ وَقْفُهُ أَيْضً ا  1‏ .‏‏1 ‏- صحيح.‏ رواه أبو داود ( 1573 )‏، والدارقطني ( 2 / 103 )‏ بلفظ: \"شيء\" بدل \"صدقة\" وصححه ابن حبان وابن القطان مرفوعا.‏ وأما اللفظ الذي نسبه الحافظ هنا لعلي، فهو لابن عباس، ولم يخرجه أبو داود، وهذا من أوهامه رحمه الله، ولم يقع له في \"التلخيص\" ( 2 / 157 )‏ ما وقع له هنا.‏","english":{"narrator":"","text":"Ali (RAA) narrated that, ‘There is no Zakah to be paid on working cattle.’ Related by Abu Dawud and Ad-Daraqutni."}},{"id":11,"idInBook":11,"chapterId":4,"bookId":17,"arabic":"وَعَنْ عَمْرِو بْنِ شُعَيْبٍ, عَنْ أَبِيهِ, عَنْ جَدِّهِ; عَبْدِ اَللَّهِ بْنِ عَمْرِوٍ; أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { مِنْ وَلِيَ يَتِيمًا لَهُ مَالٌ, فَلْيَتَّجِرْ لَهُ, وَلَا يَتْرُكْهُ حَتَّى تَأْكُلَهُ اَلصَّدَقَةُ }  رَوَاهُ اَلتِّرْمِذِيُّ, وَاَلدَّارَقُطْنِيُّ, وَإِسْنَادُهُ ضَعِيف ٌ  1‏ .‏‏1 ‏- ضعيف.‏ رواه الترمذي ( 641 )‏، وضعفه، والدارقطني ( 2 / 109 ‏- 110 )‏.‏","english":{"narrator":"Amro bin Shu’aib narrated on the authority of his father who reported on the authority of his grandfather, on the authority of Abdullah bin 'Amro(RAA) that the Messenger of Allah (ﷺ) said:","text":"“One who becomes the guardian of an orphan, who owns property, must trade on his behalf and not leave it (saved and unused) until it is all eaten up by Zakah (which is paid yearly).” Related by At-Tirmidhi and Ad-Daraqutni with a weak chain of narrators."}},{"id":12,"idInBook":12,"chapterId":4,"bookId":17,"arabic":"وَلَهُ شَاهِدٌ مُرْسَلٌ عِنْدَ اَلشَّافِعِيّ ِ  1‏ .‏‏1 ‏- ضعيف.‏ رواه الشافعي في \"المسند\" ( 1 / 224 / 614 )‏ من طريق ابن جريج ‏-وهو مدلس‏- عن يوسف بن ماهك؛ أن رسول الله صلى الله عليه وسلم، قال: \"ابتغوا في مال اليتيم، أو في مال اليتامى، لا تذهبها ولا تستأصلها الزكاة\".‏ أقول: وللحديث شاهد آخر، لكن في سنده كذاب، فيبقى الحديث على الضعف.‏","english":{"narrator":"","text":"And it has a Shahid (supporting narration) that is Mursal narrated by Ash-Shafi'ee."}},{"id":13,"idInBook":13,"chapterId":4,"bookId":17,"arabic":"وَعَنْ عَبْدِ اَللَّهِ بْنِ أَبِي أَوْفَى ‏- رضى الله عنه ‏- قَالَ: { كَانَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-إِذَا أَتَاهُ قَوْمٌ بِصَدَقَتِهِمْ قَالَ: \n\"اَللَّهُمَّ صَلِّ عَلَيْهِمْ\" }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 1497 )‏، ومسلم ( 1078 )‏، عن ابن أبي أوفى، قال: كان النبي صلى الله عليه وسلم إذا أتاه قوم بصدقتهم قال: \"اللهم صل على آل فلان\" فأتاه أبي بصدقته، فقال: \"اللهم صلى على آل أبي أوفى\".‏ والمراد بقوله: \"اللهم صل على آل أبي أوفى\".‏ هو: اللهم صل على أبي أوفى نفسه؛ لأن الأمر كما قال الطحاوي في \"المشكل\": \"العرب تجعل آل الرجل نفسه\" ثم احتج بهذا الحديث.‏","english":{"narrator":"","text":"Abdullah bin Abi Aufa (RAA) narrated, ‘Whenever a person came to the Messenger of Allah (ﷺ) with their Zakah, he would say, “O Allah! Send your blessings upon them” Agreed upon."}},{"id":14,"idInBook":14,"chapterId":4,"bookId":17,"arabic":"وَعَنْ عَلِيٍّ ‏- رضى الله عنه ‏- أَنَّ اَلْعَبَّاسَ ‏- رضى الله عنه ‏- { سَأَلَ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-فِي تَعْجِيلِ صَدَقَتِهِ قَبْلَ أَنْ تَحِلَّ, فَرَخَّصَ لَهُ فِي ذَلِكَ }  رَوَاهُ اَلتِّرْمِذِيُّ, وَالْحَاكِم ُ  1‏ .‏‏1 ‏- حسن.‏ رواه الترمذي ( 678 )‏، والحاكم ( 3 / 332 )‏، والحديث وإن كان اختلف في سنده إلا أن له شواهد تقويه، وتفصيل ذلك بالأصل.‏ \"تنبيه\": الحديث رواه أيضا أبو داود ( 1624 )‏، وابن ماجه ( 1795 )‏، وأحمد ( 1 / 104 )‏، ولا أدري لماذا اقتصر الحافظ في عزوه على الترمذي.‏","english":{"narrator":"","text":"Ali (RAA) narrated that al-Abbas (RAA) asked the Messenger of Allah (ﷺ) to allow him to pay his Zakah before its due date, and he gave him permission to do so.’ Related by At-Tirmidhi and Al-Hakim."}},{"id":15,"idInBook":15,"chapterId":4,"bookId":17,"arabic":"وَعَنْ جَابِرِ] بْنِ عَبْدِ اَللَّهِ ] ‏- رضى الله عنه ‏- عَنْ رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { لَيْسَ فِيمَا دُونَ خَمْسِ أَوَاقٍ مِنَ اَلْوَرِقِ صَدَقَةٌ, وَلَيْسَ فِيمَا دُونَ خَمْسٍ ذَوْدٍ مِنَ اَلْإِبِلِ صَدَقَةٌ, وَلَيْسَ فِيمَا دُونَ خَمْسَةِ أَوْسُقٍ مِنَ اَلتَّمْرِ صَدَقَةٌ }  رَوَاهُ مُسْلِم ٌ  1‏ .‏‏1 ‏- .‏ صحيح.‏ رواه مسلم ( 980 )‏.‏","english":{"narrator":"Jabir (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"“There is no Zakah to be paid on less than five ounces of silver, less than five camels or less than five Awsuq of dates.” Related by Muslim."}},{"id":16,"idInBook":16,"chapterId":4,"bookId":17,"arabic":"وَلَهُ مِنْ حَدِيثِ أَبِي سَعِيدٍ: { لَيْسَ فِيمَا دُونَ خَمْسَةِ أَوْسَاقٍ مِنْ تَمْرٍ وَلَا حَبٍّ صَدَقَةٌ }   1‏ .‏ \nوَأَصْلُ حَدِيثِ أَبِي سَعِيدٍ مُتَّفَقٌ عَلَيْه ِ  2‏ .‏‏1 ‏- صحيح.‏ رواه مسلم ( 979 )‏ ( 4 )‏.‏ وفي لفظ له: \"ليس في حب ولا تمر صدقة، حتى يبلغ خمسة أوسق\".‏\n‏2 ‏- البخاري ( 1447 )‏، ومسلم ( 979 )‏ بلفظ: \"ليس فيما دون خمسة أوسق صدقة، ولا فيما دون خمسة ذود صدقة، ولا فيما دون خمس أواقي صدقة \".‏","english":{"narrator":"Abu Said Al-Khudri (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"“There is no Zakah to be paid on any amount of dates or grain less than five Awsuq.” Agreed upon."}},{"id":17,"idInBook":17,"chapterId":4,"bookId":17,"arabic":"وَعَنْ سَالِمِ بْنِ عَبْدِ اَللَّهِ, عَنْ أَبِيهِ, عَنْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { فِيمَا سَقَتِ اَلسَّمَاءُ وَالْعُيُونُ, أَوْ كَانَ عَثَرِيًّا: اَلْعُشْرُ, وَفِيمَا سُقِيَ بِالنَّضْحِ: نِصْفُ اَلْعُشْرِ.‏ }  رَوَاهُ اَلْبُخَارِيّ ُ  1‏ .‏ \nوَلِأَبِي دَاوُدَ: { أَوْ كَانَ بَعْلًا: اَلْعُشْرُ, وَفِيمَا سُقِيَ بِالسَّوَانِ ي  2‏ أَوِ اَلنَّضْحِ: نِصْفُ اَلْعُشْرِ }   3‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 1483 )‏.‏ والعثري: هو الذي يشرب بعروقه من غير سقي.‏\n‏2 ‏- تحرف في \"أ\" إلى \"السواقي\".‏ والمراد بالسواني: الدواب.‏ وبالنضح: ما كان بغير الدواب كنضح الرجال بالآلة، والمراد من الكل: ما كان سقيه بتعب وعناء.‏ قاله الصنعاني.‏‏3 ‏- صحيح.‏ رواه أبو داود ( 1596 )‏.‏","english":{"narrator":"Salim bin ’Abdullah narrated on the authority of his father (RAA) that the Messenger of Allah (ﷺ) said:","text":"“A tithe is due as Zakah, on every plant watered by heaven (rain water), springs, or underground water (i.e. watered without effort).While half a tithe is paid on what is watered by irrigation (i.e. machines are used).” Related by Al-Bukhari. Abu Dawud added in his narration, “When it is watered by underground water (close to the surface and keeping the land wet), a tithe is paid, but half a tithe is paid when the land is watered by wheels or animals.”"}},{"id":18,"idInBook":18,"chapterId":4,"bookId":17,"arabic":"وَعَنْ أَبِي مُوسَى اَلْأَشْعَرِيِّ; وَمُعَاذٍ رَضِيَ اَللَّهُ عَنْهُمَا; أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَالَ لَهُمَا: { لَا تَأْخُذَا فِي اَلصَّدَقَةِ إِلَّا مِنْ هَذِهِ اَلْأَصْنَافِ اَلْأَرْبَعَةِ: اَلشَّعِيرِ, وَالْحِنْطَةِ, وَالزَّبِيبِ, وَالتَّمْرِ }  رَوَاهُ اَلطَّبَرَانِيُّ, وَالْحَاكِم ُ  1‏ .‏‏1 ‏- صحيح.‏ رواه الدارقطني ( 2 / 98 / 15 )‏، والحاكم في \"المستدرك\" ( 4 / 401 )‏.‏ وقال الحاكم: \"إسناده صحيح\" ووافقه الذهبي، وهو كما قالا.‏ وقد أعله ابن دقيق العيد بما لا يقدح، وقد أجبت عليه في \"الأصل\".‏","english":{"narrator":"Abu Musa Al-Ash’ari and Mu'adh (RAA) narrated that The Messenger of Allah (ﷺ) said to them, “Do not take any Zakah except on these four crops:","text":"barley, wheat, raisins and dates.”Related by At-Tabarani and Al-Hakim."}},{"id":19,"idInBook":19,"chapterId":4,"bookId":17,"arabic":"وَلِلدَّارَقُطْنِيِّ, عَنْ مُعَاذٍ: { فَأَمَّا اَلْقِثَّاءُ, وَالْبِطِّيخُ, وَالرُّمَّانُ, وَالْقَصَبُ, فَقَدْ عَفَا عَنْهُ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-}  وَإِسْنَادُهُ ضَعِيف ٌ  1‏ .‏‏1 ‏- ضعيف جدا.‏ رواه الدارقطني ( 2 / 97 / 9 )‏ في سنده انقطاع وأحد المتروكين.‏ وضعفه الحافظ في \"التلخيص\" ( 2 / 165 )‏.‏","english":{"narrator":"","text":"Imam Ad-Daraqutni related on the authority of Mu’adh (RAA), ‘As for cucumbers, watermelons, pomegranates, and sugar-cane, the Messenger of Allah (ﷺ) has exempted them from Zakah.’ It is transmitted with a weak chain of narrators."}},{"id":20,"idInBook":20,"chapterId":4,"bookId":17,"arabic":"وَعَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: أَمَرَنَا رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِذَا خَرَصْتُمْ, فَخُذُوا, وَدَعُوا اَلثُّلُثَ, فَإِنْ لَمْ تَدَعُوا اَلثُّلُثَ, فَدَعُوا اَلرُّبُعَ }  رَوَاهُ اَلْخَمْسَةُ إِلَّا اِبْنَ مَاجَهْ, وَصَحَّحَهُ اِبْنُ حِبَّانَ, وَالْحَاكِم ُ  1‏ .‏‏1 ‏- ضعيف.‏ رواه أبو داود ( 1605 )‏، والنسائي ( 5 / 42 )‏، والترمذي ( 643 )‏، وأحمد ( 3 / 448 و 4/ 2 ‏- 3 و 3 )‏، وابن حبان ( 798 موارد )‏، والحاكم ( 1 / 402 )‏ من طريق عبد الرحمن بن نيار، عن سهل به.‏ قلت: وابن نيار \"لا يعرف\" كما قال ابن القطان، والذهبي.‏","english":{"narrator":"","text":"Sahl bin Abi Hathmah (RAA) narrated, “We were commanded by the Messenger of Allah (ﷺ), ‘Whenever you assess the amount of something, estimate the  and ignore one-third. If you do not, then leave (at least) one fourth.” Related by the five Imams, except for Ibn Majah."}},{"id":21,"idInBook":21,"chapterId":4,"bookId":17,"arabic":"وَعَنْ عَتَّابِ بنِ أُسَيْدٍ ‏- رضى الله عنه ‏- قَالَ: أَمَرَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ أَنْ يُخْرَصَ اَلْعِنَبُ كَمَا يُخْرَصُ اَلنَّخْلُ, وَتُؤْخَذَ زَكَاتُهُ زَبِيبًا }  رَوَاهُ اَلْخَمْسَةُ, وَفِيهِ اِنْقِطَاع ٌ  1‏ .‏‏1 ‏- ضعيف.‏ رواه أبو داود ( 1603 )‏، ( 1604 )‏، والنسائي ( 5 / 109 )‏، والترمذي ( 644 )‏، وابن ماجه ( 1819 )‏ وعلته الانقطاع كما أشار إلى ذلك الحافظ.‏ \"تنبيه\": وهم الحافظ ‏-رحمه الله‏- في عزو الحديث للخمسة ‏-وهم أصحاب السنن وأحمد‏- إذ الحديث ليس في \"المسند\"، فضلا عن عدم وجود مسند لعتاب ضمن مسند الإمام أحمد المطبوع، بل لم يذكره ابن عساكر في كتابه: \"أسماء الصحابة الذين أخرج حديثهم أحمد بن حنبل في المسند\".‏ وأيضا الحافظ نفسه لم يذكره في \"أطراف المسند\"، فقد راجعت المخطوط فلم أجده فيه.‏","english":{"narrator":"","text":"Attab bin Usaid (RAA) narrated that The Messenger of Allah (ﷺ) commanded us, “Grapevines are to be estimated exactly as palm trees, and its Zakah is taken in raisins.” Related by the five lmams and it has a break in the chain."}},{"id":22,"idInBook":22,"chapterId":4,"bookId":17,"arabic":"وَعَنْ عَمْرِو بْنِ شُعَيْبٍ, عَنْ أَبِيهِ, عَنْ جَدِّهِ; { أَنَّ اِمْرَأَةً أَتَتِ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-وَمَعَهَا اِبْنَةٌ لَهَا, وَفِي يَدِ اِبْنَتِهَا مِسْكَتَانِ مِنْ ذَهَبٍ, فَقَالَ لَهَا: \"أَتُعْطِينَ زَكَاةَ هَذَا?\" قَالَتْ: لَا.‏ قَالَ: \"أَيَسُرُّكِ أَنْ يُسَوِّرَكِ اَللَّهُ بِهِمَا يَوْمَ اَلْقِيَامَةِ سِوَارَيْنِ مِنْ نَارٍ?\".‏ فَأَلْقَتْهُمَا.‏ }  رَوَاهُ اَلثَّلَاثَةُ, وَإِسْنَادُهُ قَوِيّ ٌ  1‏ .‏‏1 ‏- حسن.‏ رواه أبو داود ( 1563 )‏، والنسائي ( 5 / 38 )‏، والترمذي ( 637 )‏، وقد اختلف في هذا الحديث، والحق أنه من ضعفه لا حجة له في ذلك، فمثلا ضعفه الترمذي براويين من رواته ولكن لم يتفردا بذلك، وأعله بعضهم بالإرسال، ولكنها علة غير قادحة كما قال الحافظ في \"الدراية\"، وفي \"الأصل\" زيادة تفصيل.‏","english":{"narrator":"","text":"Amro bin Shu’aib narrated on the authority of his father, who reported on the authority of his grandfather (RAA) that a woman came to the Messenger of Allah (ﷺ) accompanied by her daughter, who wore two heavy gold bangles. He said to her, “Do you pay Zakah on them?” She said, ‘No.’ He then said, “Are you pleased that Allah may put two bangles of fire on your wrist on the Day of Judgment?” She then threw them away. Related by the three Imams with a strong chain of narrators."}},{"id":23,"idInBook":23,"chapterId":4,"bookId":17,"arabic":"وَصَحَّحَهُ اَلْحَاكِمُ: مِنْ حَدِيثِ عَائِشَة َ  1‏ .‏‏1 ‏- صحيح.‏ رواه الحاكم ( 1 / 389 ‏- 390 )‏ من طريق عبد الله بن شداد بن الهاد قال: دخلنا على عائشة زوج النبي صلى الله عليه وسلم، فقالت: دخل علي رسول الله صلى الله عليه وسلم فرأى في سخابا من ورق، فقال: \"ما هذا يا عائشة؟\" فقلت: صنعتهن أتزين لك فيهن يا رسول الله.‏ فقال: \"أتؤدين زكاتهن؟\" فقلت: لا.‏ أو ما شاء الله من ذلك.‏ قال: \"هي حسبك من النار\".‏ وقال الحاكم: صحيح على شرط الشيخين.‏ قلت: والحديث أيضا رواه أبو داود ( 1565 )‏ فكان عزوه لأبي داود أولى من عزوه للحاكم.‏","english":{"narrator":"","text":"And Al-Hakim graded it Sahih based on the narration of Aisha."}},{"id":24,"idInBook":24,"chapterId":4,"bookId":17,"arabic":"وَعَنْ أُمِّ سَلَمَةَ رَضِيَ اَللَّهُ عَنْهَا; { أَنَّهَا كَانَتْ تَلْبَسُ أَوْضَاحً ا  1‏ مِنْ ذَهَبٍ فَقَالَتْ: يَا رَسُولَ اَللَّهِ! أَكَنْزٌ هُوَ? ] فَـ [ قَالَ: \"إِذَا أَدَّيْتِ زَكَاتَهُ, فَلَيْسَ بِكَنْزٍ\".‏ }  رَوَاهُ أَبُو دَاوُدَ, وَاَلدَّارَقُطْنِيُّ, وَصَحَّحَهُ اَلْحَاكِمُ .‏  2‏ .‏‏1 ‏- جمع \"وضح\" وهي نوع من الحلي يعمل من الفضة، سميت بذلك لبياضها.‏‏2 ‏- حديث صحيح، وإسناده ضعيف.‏ رواه أبو داود ( 1564 )‏، والدارقطني ( 2 / 105 / 1 )‏، والحاكم ( 1 / 390 )‏، وقد أعل هذا الحديث ابن الجوزي في \"التحقيق\"، والبيهقي في \"الكبرى\" كل واحد منهما بعلة ليست هي العلة الأصلية في الحديث، وإنما علته الانقطاع، إلا أنه صحيح بما له من شواهد، وتفصيل كل ذلك بالأصل.‏ \"تنبيه\": اللفظ الذي ساقه الحافظ هنا هو للدارقطني، والحاكم، وأما لفظ أبي داود، فهو: \"ما بلغ أن تؤدي زكاته، فزكي، فليس بكنز \".‏","english":{"narrator":"","text":"Umm Salamah (RAA) narrated that she was wearing golden ornaments and asked the Messenger of Allah (ﷺ), ‘Is it considered as a treasure?’ He said, “If you pay the due Zakah, then it is not considered as a treasure.” Related by Abu Dawud and Ad-Daraqutni."}},{"id":25,"idInBook":25,"chapterId":4,"bookId":17,"arabic":"وَعَنْ سَمُرَةَ بْنِ جُنْدُبٍ ‏- رضى الله عنه ‏- قَالَ: { كَانَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَأْمُرُنَا; أَنْ نُخْرِجَ اَلصَّدَقَةَ مِنَ اَلَّذِي نَعُدُّهُ لِلْبَيْعِ.‏ }  رَوَاهُ أَبُو دَاوُدَ, وَإِسْنَادُهُ لَيِّن ٌ  1‏ .‏‏1 ‏- ضعيف.‏ رواه أبو داود ( 1562 )‏ بسند فيه ثلاثة مجاهيل، ولذلك كان قول الحافظ في \"التلخيص\" ( 2 / 179 )‏: \"في إسناده جهالة \" أدق من قوله هنا.‏ وقال الذهبي: \"هذا إسناد مظلم لا ينهض بحكم\".‏","english":{"narrator":"","text":"Samurah bin Jundub (RAA) narrated that The Messenger of Allah (ﷺ) used to command us to pay Zakah from (the goods) we had prepared for sale. Related by Abu Dawud with a weak chain of narrators."}},{"id":26,"idInBook":26,"chapterId":4,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- { أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: \n\"وَفِي اَلرِّكَازِ: اَلْخُمُسُ\".‏ }  مُتَّفَقٌ عَلَيْه ِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 1499 )‏، ومسلم ( 1710 )‏، وهو بتمامه: \"العجماء جرحها جبار، والبئر جبار، والمعدن جبار، وفي الركاز الخمس\".‏ قال ابن الأثير في \"النهاية\" ( 2 / 258 )‏: \"الركاز؛ عند أهل الحجاز: كنوز الجاهلية المدفونة في الأرض.‏ وعند أهل العراق: المعادن، والقولان تحتملهما اللغة؛ لأن كلا منهما مركوز في الأرض.‏ أي: ثابت.‏ يقال: ركزه يركزه ركزا إذا دفنه، وأركز الرجل إذا وجد الركاز.‏ والحديث إنما جاء في التفسير الأول، وهو الكنز الجاهلي، وإنما كان فيه الخمس لكثرة نفعه وسهولة أخذه.‏ وقد جاء في \"مسند أحمد\" في بعض طرق هذا الحديث: \"وفي الركائز الخمس\" كأنها جمع ركيزة أو ركازة، والركيزة والركوزة: القطعة من جواهر الأرض المركوزة فيها.‏ وجمع الركزة ركاز\".‏","english":{"narrator":"Abu Hurairah (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"“One fifth is compulsory to be paid (as Zakah) on buried Treasure.” Agreed upon."}},{"id":27,"idInBook":27,"chapterId":4,"bookId":17,"arabic":"وَعَنْ عَمْرِو بْنِ شُعَيْبٍ, عَنْ أَبِيهِ, عَنْ جَدِّهِ; { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَالَ ‏-فِي كَنْزٍ وَجَدَهُ رَجُلٌ فِي خَرِبَةٍ‏-: \n\"إِنْ وَجَدْتَهُ فِي قَرْيَةٍ مَسْكُونَةٍ, فَعَرِّفْهُ, وَإِنْ وَجَدْتَهُ فِي قَرْيَةٍ غَيْرِ مَسْكُونَةٍ, فَفِيهِ وَفِي اَلرِّكَازِ: اَلْخُمُسُ \".‏ }  أَخْرَجَهُ اِبْنُ مَاجَهْ بِإِسْنَادٍ حَسَن ٍ  1‏ .‏‏1 ‏- حسن.‏ رواه الشافعي ( 1 / 248 ‏- 249 / 673 )‏، ووهم الحافظ ‏-رحمه الله‏- في عزوه الحديث لابن ماجه، وقلده غير واحد منهم صاحب \"توضيح الأحكام\" فقال: أخرجه ابن ماجه بإسناد حسن ولا أدري أين رآه في ابن ماجه! ولقد وجدت وهما آخر للحافظ في نفس الحديث في \"التلخيص\" وبيان ذلك \"بالأصل\".‏","english":{"narrator":"","text":"'Amro bin Shu'aib narrated on the authority of his father, who reported on the authority of his grandfather (RAA) that the Messenger of Allah (ﷺ) was asked about a treasure that was found by a man in some ruined land, and he said to him, “If you found it in an inhabited village, then you must advertise its having been found. However, if he found it in an uninhabited village, then on it and the rest of the discovered treasure one fifth is payable as Zakah.” Related by Ibn Majah with a reliable chain of narrators."}},{"id":28,"idInBook":28,"chapterId":4,"bookId":17,"arabic":"وَعَنْ بِلَالِ بْنِ اَلْحَارِثِ ‏- رضى الله عنه ‏- { أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-أَخَذَ مِنَ اَلْمَعَادِنِ اَلْقَبَلِيَّةِ اَلصَّدَقَةَ.‏ }  رَوَاهُ أَبُو دَاوُد َ  1‏ .‏‏1 ‏- ضعيف.‏ رواه أبو داود ( 3061 )‏ مرسلا وبلفظ: أن رسول الله صلى الله عليه وسلم أقطع بلال بن الحارث المزني.‏ معادن القبلية، وهي من ناحية الفرع، فتلك المعادن لا يؤخذ منها إلا الزكاة إلى اليوم.‏","english":{"narrator":"","text":"Bilal bin Al-Harith (RAA) narrated that The Messenger of Allah (ﷺ) took Zakah from the mines of Qabaliyah."}},{"id":29,"idInBook":29,"chapterId":4,"bookId":17,"arabic":"عَنِ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { فَرَضَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-زَكَاةَ اَلْفِطْرِ, صَاعًا مِنْ تَمْرٍ, أَوْ صَاعًا مِنْ شَعِيرٍ: عَلَى اَلْعَبْدِ وَالْحُرِّ, وَالذَّكَرِ, وَالْأُنْثَى, وَالصَّغِيرِ, وَالْكَبِيرِ, مِنَ اَلْمُسْلِمِينَ, وَأَمَرَ بِهَا أَنْ تُؤَدَّى قَبْلَ خُرُوجِ اَلنَّاسِ إِلَى اَلصَّلَاةِ }  مُتَّفَقٌ عَلَيْه ِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 1503 )‏، ومسلم ( 984 )‏.‏ \"تنبيه\": اللفظ المذكور إنما هو للبخاري، وأما مسلم فقد رواه إلى قوله: \"من المسلمين\" مع اختلاف يسير، وأما قوله: \"وأمر بها أن تؤدى.‏.‏.‏.‏.‏\" فقد رواها برقم ( 986 )‏ وأيضا فصلها البخاري في بعض المواطن من \"صحيحه\".‏","english":{"narrator":"","text":"Ibn ’Umar (RAA) narrated, The Messenger of Allah (ﷺ) enjoined the payment of one sa” of dates or one sa' of barley as Zakat-ul-fitr on every Muslim, slave or free, male or female, young or old, and he ordered that it be paid before the people went out to offer the 'Id prayer.’ Agreed upon."}},{"id":30,"idInBook":30,"chapterId":4,"bookId":17,"arabic":"وَلِابْنِ عَدِيٍّ ] مِنْ وَجْهٍ آخَرَ [, وَاَلدَّارَقُطْنِيِّ بِإِسْنَادٍ ضَعِيفٍ: { اغْنُوهُمْ عَنِ اَلطَّوَافِ فِي هَذَا اَلْيَوْمِ }   1‏ .‏‏1 ‏- ضعيف.‏ رواه الدارقطني في \"السنن\" ( 2 / 152 ‏- 153 / 67 )‏، والبيهقي ( 4 / 175 )‏، والحاكم في \"معرفة علوم الحديث\" ص ( 131 )‏، وابن عدي في \"الكامل\" ( 7 / 2519 )‏، وحميد بن زنجويه في \"الأموال\" ( 2397 )‏، وابن حزم في \"المحلى\" ( 6 / 121 )‏ ‏-ضمن أخبار فاسدة لا تصح‏- كلهم من طريق أبي معشر، عن نافع، عن ابن عمر قال: أمرنا رسول الله صلى الله عليه وسلم أن نخرج صدقة الفطر عن كل صغير وكبير، حر أو عبد صاعا من تمر، أو صاعا من زبيب، أو صاعا من شعير، أو صاعا من قمح، وكان يأمرنا أن نخرجها قبل الصلاة، وكان رسول صلى الله عليه وسلم يقسمها قبل أن ينصرف من المصلى، ويقول: فذكره.‏ والسياق للحاكم.‏ قلت: وهذا سند ضعيف، أبو معشر هو: نجيح السندي المدني ضعفه غير واحد، وأما ابن حزم فقد بالغ؛ إذ قال: \"أبو معشر هذا نجيح مطرح يحدث بالموضوعات، عن نافع وغيره\".‏ وله شاهد وطريق آخر.‏ رواه ابن سعد في \"الطبقات\" قال: أخبرنا محمد بن عمر الواقدي، حدثنا عبد الله بن عبد الرحمن الجمحي، عن الزهري، عن عروة، عن عائشة، رضي الله عنها، قال: وأخبرنا عبيد الله بن عمر، عن نافع، عن ابن عمر، قال: وأخبرنا عبد العزيز بن محمد، عن ربيح بن عبد الرحمن بن أبي سعيد الخدري، عن أبيه، عن جده، قالوا: فرض صوم رمضان بعدما حولت القبلة إلى الكعبة بشهر في شعبان على رأس ثمانية عشر شهرا من مهاجر رسول صلى الله عليه وسلم، وأمر في هذه السنة بزكاة الفطر، وذلك قبل أن يفرض الزكاة في الأموال، وأن تخرج عن الصغير والكبير، والذكر والأنثى، والحر والعبد: صاعا من تمر، أو صاعا من شعير، أو صاعا من زبيب، أو مدين من بر، وأمر بإخروجها قبل الغدو إلى الصلاة، وقال: \"اغنوهم ‏-يعني المساكين‏- عن طواف هذا اليوم\".‏ قلت: والواقدي كذاب متهم، فلا يفرح بما أتى به، ويبقى الحديث على ما هو عليه من الضعف.‏ \"تنبيه\": قال المعلق على \"البلوغ\" ص ( 132 )‏، معللا تضعيف الحافظ بقوله: \"لأنه من رواية محمد بن عمر الواقدي\" ولم يتنبه إلى أن الواقدي لا يوجد في رواية ابن عدي والدارقطني، وعزو الحافظ لهما، وإنما هو في رواية ابن سعد في \"الطبقات\" فقط، ولكنها آفة التقليد إذ هو مسبوق بهذا التعليل من الصنعاني في \"السبل\" ( 2 / 279 )‏.‏","english":{"narrator":"","text":"Ibn ’Adi and Ad-Daraqutni also related on the authority of Ibn'Umar but with a weak chain of narrators, “Save them (i.e. the poor) wondering around (in the markets and the streets asking for food) on that day.”"}},{"id":31,"idInBook":31,"chapterId":4,"bookId":17,"arabic":"وَعَنْ أَبِي سَعِيدٍ اَلْخُدْرِيِّ ‏- رضى الله عنه ‏- قَالَ: { كُنَّا نُعْطِيهَا فِي زَمَانِ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-صَاعًا مِنْ طَعَامٍ, أَوْ صَاعًا مِنْ تَمْرٍ, أَوْ صَاعًا مِنْ شَعِيرٍ, أَوْ صَاعًا مِنْ زَبِيبٍ.‏ }  مُتَّفَقٌ عَلَيْه ِ  1‏ \nوَفِي رِوَايَةٍ: { أَوْ صَاعًا مِنْ أَقِطٍ }   2‏ .‏\nقَالَ أَبُو سَعِيدٍ: أَمَّا أَنَا فَلَا أَزَالُ أُخْرِجُهُ كَمَا كُنْتُ أُخْرِجُهُ فِي زَمَنِ رَسُولِ اَللَّهِ  3‏  4‏ .‏ \nوَلِأَبِي دَاوُدَ: { لَا أُخْرِجُ أَبَدًا إِلَّا صَاعًا }   5‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 1508 )‏، ومسلم ( 985 )‏.‏\n‏2 ‏- وهي عند البخاري ( 1506 )‏، وأيضا مسلم.‏\n‏3 ‏- قول أبي سعيد عند مسلم.‏ وفي لفظ له: كما كنت أخرجه أبدا، ما عشت.‏‏4 ‏- قول أبي سعيد عند مسلم.‏ وفي لفظ له: كما كنت أخرجه أبدا، ما عشت.‏\n‏5 ‏- سنن أبي داود ( 1618 )‏.‏","english":{"narrator":"","text":"Abu Sa'id Al-Khudri (RAA) narrated, “We used to offer it (Zakat-ul-fitr) during the lifetime of the Prophet as one sa’ of food or one sa' of dates, or one sa' of barley or one sa' of raisins’’ Agreed upon. In another narration, “or one sa' of dried cottage cheese.” Abu Sa'id then added, “As for myself, I would continue to give it as I used to give during the time of the Prophet. Abu Dawud also transmitted on the authority of Abu Sa'id, “I would never give but a sa'.”"}},{"id":32,"idInBook":32,"chapterId":4,"bookId":17,"arabic":"وَعَنِ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { فَرَضَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-زَكَاةَ اَلْفِطْرِ; طُهْرَةً لِلصَّائِمِ مِنَ اَللَّغْوِ, وَالرَّفَثِ, وَطُعْمَةً لِلْمَسَاكِينِ, فَمَنْ أَدَّاهَا قَبْلَ اَلصَّلَاةِ فَهِيَ زَكَاةٌ مَقْبُولَةٌ, وَمَنْ أَدَّاهَا بَعْدَ اَلصَّلَاةِ فَهِيَ صَدَقَةٌ مِنَ اَلصَّدَقَاتِ.‏ }  رَوَاهُ أَبُو دَاوُدَ, وَابْنُ مَاجَهْ, وَصَحَّحَهُ اَلْحَاكِم ُ  1‏ .‏‏1 ‏- حسن.‏ رواه أبو داود ( 1609 )‏، وابن ماجه ( 1827 )‏، والحاكم ( 1 / 409 )‏.‏ وقال الحاكم: صحيح على شرط البخاري.‏ قلت: وله في ذلك أوهام، كما وهم أيضا في بعض رجال هذا الحديث المعلق على \"التهذيب\".‏","english":{"narrator":"","text":"Ibn ’Abbas (RAA) narrated, ‘The Messenger of Allah (ﷺ) enjoined Zakat-ul-fitr on the one who fasts (i.e. fasted during the month of Ramadan) to purify him from any indecent act or speech and for the purpose of providing food for the needy. It is accepted as Zakah for the person who pays it before the Eid prayer and it is Sadaqah (i.e. voluntary charity) for the person who pays it after the Eid prayer.’ Related by Abu Dawud and Ibn Majah and Al-Hakim graded it as Sahih."}},{"id":33,"idInBook":33,"chapterId":4,"bookId":17,"arabic":"عَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- عَنِ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { سَبْعَةٌ يُظِلُّهُمُ اَللَّهُ فِي ظِلِّهِ يَوْمَ لَا ظِلَّ إِلَّا ظِلُّهُ.‏.‏.‏.‏ }  فَذَكَرَ اَلْحَدِيثَ وَفِيهِ: { وَرَجُلٌ تَصَدَّقَ بِصَدَقَةٍ فَأَخْفَاهَا حَتَّى لَا تَعْلَمَ شِمَالُهُ مَا تُنْفِقُ يَمِينُهُ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 660 )‏، ومسلم ( 1031 )‏، وهو بتمامه: \"سبعة يظلهم الله في ظله يوم لا ظل إلا ظله: الإمام العادل، وشاب نشأ في عبادة ربه، ورجل قلبه معلق في المساجد، ورجلان تحابا في الله اجتمعا عليه وتفرقا عليه، ورجل طلبته امرأة ذات منصب وجمال، فقال: إني أخاف الله، ورجل تصدق أخفى حتى لا تعلم شماله ما تنفق يمينه، ورجل ذكر الله خاليا ففاضت عيناه\".‏ والسياق للبخاري.‏ وانقلبت جملة \"حتى لا تعلم.‏.‏\" عند مسلم، فوقعت هكذا: \"حتى لا تعلم يمينه ما تنفق شماله\".‏","english":{"narrator":"Abu Hurairah (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"“Seven people will be shaded by Allah under His shade on the day when there will be no shade except His ....” He mentioned the rest of the hadith, which says, “and a man who gives charity so secretly that his left hand does not know what his right hand has given.” (i.e. nobody knows how much he has given in charity). Agreed upon."}},{"id":34,"idInBook":34,"chapterId":4,"bookId":17,"arabic":"وَعَنْ عُقْبَةَ بْنِ عَامِرٍ ‏- رضى الله عنه ‏- قَالَ: سَمِعْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ: { كُلُّ اِمْرِئٍ فِي ظِلِّ صَدَقَتِهِ حَتَّى يُفْصَلَ بَيْنَ اَلنَّاسِ }  رَوَاهُ اِبْنُ حِبَّانَ وَالْحَاكِمُ  1‏ .‏‏1 ‏- صحيح.‏ رواه ابن حبان ( 5 / 131 ‏- 132 )‏، والحاكم ( 1 / 416 )‏، وعند ابن حبان: \"يقضي\" بدل \"يفصل\" وزادا معا: \"أو قال: حتى يحكم بين الناس قال يزيد: فكان أبو الخير لا يخطئه يوم لا يتصدق فيه بشيء ولو كعكة، ولو بصلة\".‏ وقال الحاكم: صحيح على شرط مسلم.‏","english":{"narrator":"","text":"’Uqbah Ibn ‘Amir (RAA) narrated, ‘I heard the Messenger of Allah (ﷺ) say, “Everybody will be shaded by his Sadaqah (on the Day of Judgment) until it has been judged between the people.” Related by Ibn Hibban and Al-Hakim."}},{"id":35,"idInBook":35,"chapterId":4,"bookId":17,"arabic":"وَعَنْ أَبِي سَعِيدٍ اَلْخُدْرِيِّ, عَنِ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { أَيُّمَا مُسْلِمٍ كَسَا  ] مُسْلِمًا [  1‏ ثَوْبًا عَلَى عُرْيٍ كَسَاهُ اَللَّهُ مِنْ خُضْرِ اَلْجَنَّةِ, وَأَيُّمَا مُسْلِمٍ أَطْعَمَ مُسْلِمًا عَلَى جُوعٍ أَطْعَمَهُ اَللَّهُ مِنْ ثِمَارِ اَلْجَنَّةِ, وَأَيُّمَا مُسْلِمٍ سَقَى مُسْلِمًا عَلَى ظَمَإٍ سَقَاهُ اَللَّهُ مِنْ اَلرَّحِيقِ اَلْمَخْتُومِ }  رَوَاهُ أَبُو دَاوُدَ وَفِي إِسْنَادِهِ لِينٌ  2‏ .‏‏1 ‏- سقطت من الأصلين، واستدركتها من \"السنن\"، وهي موجودة أيضا في المطبوع والشرح.‏‏2 ‏- ضعيف.‏ رواه أبو داود ( 1682 )‏، وللحديث طريق آخر ولكنه أضعف من طريق أبي داود.‏","english":{"narrator":"","text":"Abu Sa'id AI-Khudri (RAA) narrated that The Prophet said, “Any Muslim who clothes another Muslim who is naked, Allah will clothe him from the green garments of Paradise. Any Muslim who feeds a Muslim who is hungry, Allah will feed him from the fruit of Paradise, and any Muslim who gives drink to a Muslim who is thirsty, Allah will give him a drink from the Sealed Nectar.” Related by Abu Dawud with a weak chain of narrators."}},{"id":36,"idInBook":36,"chapterId":4,"bookId":17,"arabic":"وَعَنْ حَكِيمِ بْنِ حِزَامٍ ‏- رضى الله عنه ‏- عَنِ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { اَلْيَدُ اَلْعُلْيَا خَيْرٌ مِنَ اَلْيَدِ اَلسُّفْلَى, وَابْدَأْ بِمَنْ تَعُولُ, وَخَيْرُ اَلصَّدَقَةِ عَنْ ظَهْرِ غِنًى, وَمَنْ يَسْتَعْفِفْ يُعِفَّهُ اَللَّهُ, وَمَنْ يَسْتَغْنِ يُغْنِهِ اَللَّهُ.‏ }  مُتَّفَقٌ عَلَيْهِ, وَاللَّفْظُ لِلْبُخَارِيِّ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 1427 )‏، ومسلم ( 1034 )‏.‏","english":{"narrator":"Hakim bin Hizam (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"”The upper hand is better than the lower hand (i.e. he who gives in charity is better than he who takes it). One should begin by giving to his dependents. And the best Sadaqah (charity) is that, which is given by a wealthy person (from the money which is left over after his expenses). And whoever abstains from asking others for some financial help, Allah will provide for him and save him from asking others; Allah will make him self-sufficient.” Agreed upon and this version is of al-Bukhari."}},{"id":37,"idInBook":37,"chapterId":4,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: { قِيلَ يَا رَسُولَ اَللَّهِ: أَيُّ اَلصَّدَقَةِ أَفْضَلُ? قَالَ: \n\"جُهْدُ اَلْمُقِلِّ, وَابْدَأْ بِمَنْ تَعُولُ\" }  أَخْرَجَهُ أَحْمَدُ, وَأَبُو دَاوُدَ, وَصَحَّحَهُ اِبْنُ خُزَيْمَةَ, وَابْنُ حِبَّانَ, وَالْحَاكِمُ  1‏ .‏‏1 ‏- صحيح.‏ رواه أحمد ( 2 / 358 )‏، وأبو داود ( 1677 )‏، وابن خزيمة ( 2444 )‏، وابن حبان ( 3335 )‏، والحاكم ( 1 / 414 )‏.‏","english":{"narrator":"","text":"Abu Hurairah (RAA) narrated that The Messenger of Allah (ﷺ) was asked, ‘Which kind of Sadaqah is better? He replied, “That which is given by one who does not have much property. And begin by giving to your dependents.” Related by Ahmad, and Abu Dawud. Ibn Khuzaimah, Ibn Hibban and AI-Hakim graded it as Sahih."}},{"id":38,"idInBook":38,"chapterId":4,"bookId":17,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ \" تَصَدَّقُوا \" فَقَالَ رَجُلٌ: يَا رَسُولَ اَللَّهِ, عِنْدِي دِينَارٌ? قَالَ: \" تَصَدَّقْ بِهِ عَلَى نَفْسِكَ \" قَالَ: عِنْدِي آخَرُ, قَالَ: \" تَصَدَّقْ بِهِ عَلَى وَلَدِكَ \"  1‏ قَالَ: عِنْدِي آخَرُ, قَالَ: \" تَصَدَّقْ بِهِ عَلَى خَادِمِكَ \" قَالَ: عِنْدِي آخَرُ, قَالَ: \" أَنْتَ أَبْصَرُ \".‏ }  رَوَاهُ أَبُو دَاوُدَ وَالنَّسَائِيُّ, وَصَحَّحَهُ اِبْنُ حِبَّانَ وَالْحَاكِمُ  2‏ .‏‏1 ‏- جاء في جميع المصادر زيادة وهي: \"قال: عندي آخر.‏ قال: \"تصدق به على زوجتك\".‏‏2 ‏- حسن.‏ رواه أبو داود ( 1691 )‏، والنسائي ( 5 / 62 )‏، وابن حبان ( 3326 )‏، والحاكم ( 1 / 415 )‏.‏","english":{"narrator":"Abu Hurairah (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"“Give Sadaqah.” A man then said, ‘Allah’s Messenger (ﷺ), I have a Dinar.’ He then said to him, “Give it to yourself as Sadaqah.” The man again said, ‘I have another one.’ The Messenger of Allah (ﷺ) said: “Give it to your children as Sadaqah.” He said, ‘I have another one.’ He said, “Give it to your wife as Sadaqah.” The man again said, ‘I have another one.’ The Messenger of Allah (ﷺ) said: “Give it to your servant as Sadaqah.” He said, ‘I have another one.’ The Messenger of Allah (ﷺ) said: “You know better to whom you should give it.” Related by Abu Dawud and An-Nasa’i. Ibn Hibban and Al-Hakim regarded it as Sahih."}},{"id":39,"idInBook":39,"chapterId":4,"bookId":17,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: قَالَ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-{ إِذَا أَنْفَقَتِ اَلْمَرْأَةُ مِنْ طَعَامِ بَيْتِهَا, غَيْرَ مُفْسِدَةٍ, كَانَ لَهَا أَجْرُهَا بِمَا أَنْفَقَتْ وَلِزَوْجِهَا أَجْرُهُ بِمَا اِكْتَسَبَ  1‏ وَلِلْخَازِنِ مِثْلُ ذَلِكَ, وَلَا يَنْقُصُ بَعْضُهُمْ أَجْرَ بَعْضٍ شَيْئًا }  مُتَّفَقٌ عَلَيْهِ.‏  2‏ .‏‏1 ‏- في \" الصحيحين \": كسب.‏‏2 ‏- صحيح.‏ رواه البخاري ( 1425 )‏، ومسلم ( 1024 )‏.‏","english":{"narrator":"A’ishah (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"“When a woman gives some of the foodstuff (which she has in her house) in charity without being extravagant (without being wasteful), she will receive the reward for what she has spent, and her husband will receive the reward because of his earning, and the keeper (if any) will be similarly rewarded. The reward of one will not decrease the reward of the others.” Agreed upon."}},{"id":40,"idInBook":40,"chapterId":4,"bookId":17,"arabic":"وَعَنْ أَبِي سَعِيدٍ اَلْخُدْرِيِّ ‏- رضى الله عنه ‏- قَالَ: { جَاءَتْ زَيْنَبُ اِمْرَأَةُ اِبْنِ مَسْعُودٍ, فَقَالَتْ: يَا رَسُولَ اَللَّهِ, إِنَّكَ أَمَرْتَ اَلْيَوْمَ بِالصَّدَقَةِ, وَكَانَ عِنْدِي حُلِيٌّ لِي, فَأَرَدْتُ أَنْ أَتَصَدَّقَ بِهِ, فَزَعَمَ اِبْنُ مَسْعُودٍ أَنَّهُ وَوَلَدُهُ أَحَقُّ مَنْ تَصَدَّقْتُ بِهِ عَلَيْهِمْ, فَقَالَ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-\n\"صَدَقَ اِبْنُ مَسْعُودٍ, زَوْجُكِ وَوَلَدُكِ أَحَقُّ مَنْ تَصَدَّقْتِ بِهِ عَلَيْهِمْ\".‏ }  رَوَاهُ اَلْبُخَارِيُّ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 1462 )‏، وأوله: خرج رسول الله صلى الله عليه وسلم في أضحى أو فطر إلى المصلى، ثم انصرف فوعظ الناس وأمرهم بالصدقة، فقال: \" أيها الناس تصدقوا \" فمر على النساء، فقال: \" يا معشر النساء تصدقن، فإني رأيتكن أكثر أهل النار \" فقلن: وبم ذلك يا رسول الله؟ قال: \" تكثرن اللعن وتكفرن العشير.‏ ما رأيت من ناقصات عقل ودين أذهب للب الرجل الحازم من إحداكن يا معشر النساء \".‏ ثم انصرف، فلما صار إلى منزله جاءت زينب امرأة ابن مسعود تستأذن عليه.‏ فقيل: يا رسول الله! هذه زينب.‏ فقال: \" أي: الزيانب \" فقيل: امرأة ابن مسعود.‏ قال: \" نعم.‏ ائذنوا لها \" فأذن لها.‏ قالت: يا بني الله ! إنك أمرت … الحديث.‏","english":{"narrator":"Abu Sa'id (RAA) narrated, ‘Zainab the wife of Ibn Mas’ud came along and said to the Prophet “O Messenger of Allah (ﷺ)! You have commanded us today to give Sadaqah (charity). I have some jewelry of mine and I wanted to give it as Sadaqah, but Ibn Mas'ud claims that he and his children are the most entitled to my Sadaqah. (deserve it more than anyone else.)' The Messenger of Allah (ﷺ) said:","text":"“Ibn Mas'ud is right. Your husband and your children are more deserving.’’ Related by Al-Bukhari."}},{"id":41,"idInBook":41,"chapterId":4,"bookId":17,"arabic":"وَعَنِ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: قَالَ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-{ مَا يَزَالُ اَلرَّجُلُ يَسْأَلُ اَلنَّاسَ حَتَّى يَأْتِيَ يَوْمَ اَلْقِيَامَةِ لَيْسَ فِي وَجْهِهِ مُزْعَةُ لَحْمٍ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 1474 )‏، ومسلم ( 1040 )‏ ( 104 )‏ والمزعة: القطعة.‏","english":{"narrator":"Ibn ’Umar (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"“A man who persists in begging people to give him charity, will come on the Day of Judgment and there will not be a piece of flesh on his face.” Agreed upon."}},{"id":42,"idInBook":42,"chapterId":4,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ سَأَلَ اَلنَّاسَ أَمْوَالَهُمْ تَكَثُّرًا, فَإِنَّمَا يَسْأَلُ جَمْرًا, فَلْيَسْتَقِلَّ أَوْ لِيَسْتَكْثِرْ }  رَوَاهُ مُسْلِمٌ  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم ( 1041 )‏.‏","english":{"narrator":"Abu Hurairah (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"“He who asks others to give to him in order to increase his own wealth, is akin to one who asks for live coals. He who wishes to have more, let him have it and he who wishes to have less, let him have it.” Related by Muslim."}},{"id":43,"idInBook":43,"chapterId":4,"bookId":17,"arabic":"وَعَنِ اَلزُّبَيْرِ بْنِ اَلْعَوَّامِ ‏- رضى الله عنه ‏- عَنِ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { لَأَنْ يَأْخُذَ أَحَدُكُمْ حَبْلَهُ, فَيَأْتِي بِحُزْمَةِ اَلْحَطَبِ عَلَى ظَهْرِهِ, فَيَبِيعَهَا, فَيَكُفَّ اَللَّهُ بِهَا وَجْهَهُ, خَيْرٌ لَهُ مِنْ أَنْ يَسْأَلَ اَلنَّاسَ أَعْطَوهُ أَوْ مَنَعُوهُ }  رَوَاهُ اَلْبُخَارِيُّ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 1471 )‏.‏","english":{"narrator":"Az-Zubair bin Al-Awwam (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"“It is better for any of you to take a rope and cut some wood (from the forest) and carry it over his back and sell it, to preserve his dignity (as he is earning his own living), rather than ask a person for something and that person may give him or not.” Related by Al-Bukhari."}},{"id":44,"idInBook":44,"chapterId":4,"bookId":17,"arabic":"وَعَنْ سَمُرَةَ بْنِ جُنْدُبٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ اَلْمَسْأَلَةُ كَدٌّ يَكُدُّ بِهَا اَلرَّجُلُ وَجْهَهُ, إِلَّا أَنْ يَسْأَلَ اَلرَّجُلُ سُلْطَانًا, أَوْ فِي أَمْرٍ لَا بُدَّ مِنْهُ }  رَوَاهُ اَلتِّرْمِذِيُّ وَصَحَّحَهُ  1‏ .‏‏1 ‏- صحيح.‏ رواه الترمذي ( 681 )‏، وقال: حسن صحيح.‏","english":{"narrator":"Samurah bin Jundub (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"“begging is like a scratch with which a man scratches his face; unless one is asking the ruler or in the case of dire necessity.” Related by At-Tirmidhi, who regarded it as Sahih."}},{"id":45,"idInBook":45,"chapterId":4,"bookId":17,"arabic":"عَنْ أَبِي سَعِيدٍ اَلْخُدْرِيِّ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا تَحِلُّ اَلصَّدَقَةُ لِغَنِيٍّ إِلَّا لِخَمْسَةٍ: لِعَامِلٍ عَلَيْهَا, أَوْ رَجُلٍ اِشْتَرَاهَا بِمَالِهِ, أَوْ غَارِمٍ, أَوْ غَازٍ فِي سَبِيلِ اَللَّهِ, أَوْ مِسْكِينٍ تُصُدِّقَ عَلَيْهِ مِنْهَا, فَأَهْدَى مِنْهَا لِغَنِيٍّ }  رَوَاهُ أَحْمَدُ, وَأَبُو دَاوُدَ, وَابْنُ مَاجَهْ, وَصَحَّحَهُ اَلْحَاكِمُ, وَأُعِلَّ بِالْإِرْسَالِ  1‏ .‏‏1 ‏- صحيح.‏ رواه أحمد ( 3 / 56 )‏، وأبو داود ( 1636 )‏، وابن ماجه ( 1841 )‏، والحاكم ( 1 / 407 )‏ موصولا.‏ ورواه مرسلا مالك في \"الموطأ\" ( 1 / 256 ‏- 257 )‏، وأبو داود ( 1635 )‏، وغيرهما، ولذلك أعله بعضهم ‏-كأبي داود‏- بالإرسال، وخالفهم في ذلك الحاكم وغيره، بل قال الحافظ في \"التلخيص\": \"صححه جماعة\".‏","english":{"narrator":"Abu Sa'id Al-Khudri narrated that The Messenger of Allah (ﷺ) said:","text":"“Zakah is not allowed for the well-off person except for one of the following five: an administrator of Zakah, a man who buys Zakah holdings with his money, a person who is in debt, a fighter in the cause of Allah, or a rich person who is given a present by a needy (miskin) person which the latter had been given as Zakah.” Related by Ahmad, Abu Dawud, Ibn Majah, and Al-Hakim regarded it as Sahih."}},{"id":46,"idInBook":46,"chapterId":4,"bookId":17,"arabic":"وَعَنْ عُبَيْدِ اَللَّهِ بْنِ عَدِيِّ بْنِ اَلْخِيَارِ; { أَنَّ رَجُلَيْنِ حَدَّثَاهُ أَنَّهُمَا أَتَيَا رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَسْأَلَانِهِ مِنَ اَلصَّدَقَةِ، فَقَلَّبَ فِيهِمَا اَلْبَصَرَ, فَرَآهُمَا جَلْدَيْنِ, فَقَالَ: \n\"إِنْ شِئْتُمَا, وَلَا حَظَّ فِيهَا لِغَنِيٍّ, وَلَا لِقَوِيٍّ مُكْتَسِبٍ\".‏ }  رَوَاهُ أَحْمَدُ وَقَوَّاهُ,  1‏ وَأَبُو دَاوُدَ, وَالنَّسَائِيُّ  2‏ .‏‏1 ‏- سقطت \"الواو\" من الطبعات التي وقفت عليها من البلوغ بما فيها طبعة دار ابن كثير، وأيضا من الشرح، وهي موجودة في الأصلين، ولا يستقيم الكلام بدونها.‏‏2 ‏- صحيح.‏ رواه أحمد ( 4 / 224 )‏، وأبو داود ( 1633 )‏، والنسائي ( 5 / 99 ‏- 100 )‏، ونقل الحافظ في \" التلخيص \" ( 3 / 108 )‏ عن الإمام أحمد قوله: \" ما أجوده من حديث \".‏","english":{"narrator":"","text":"'Ubaidullah bin ’Adi bin Al-Khiyar (RAA) narrated that Two men told him that they had gone to the Messenger of Allah (ﷺ) asking him to give them something from the Zakah money (as he was distributing it at that time). The Messenger of Allah (ﷺ) then looked them up and down and found them to be sturdy and strong. He then said to them, “If you desire, I shall give it to you, but this Zakah is not for one who is rich, neither for the one who is strong and able to earn.” Related by Ahmad, Abu Dawud and An-Nasa'i."}},{"id":47,"idInBook":47,"chapterId":4,"bookId":17,"arabic":"وَعَنْ قَبِيصَةَ بْنِ مُخَارِقٍ اَلْهِلَالِيِّ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِنَّ اَلْمَسْأَلَةَ لَا تَحِلُّ إِلَّا لِأَحَدِ ثَلَاثَةٍ: رَجُلٌ تَحَمَّلَ حَمَالَةً, فَحَلَّتْ لَهُ اَلْمَسْأَلَةُ حَتَّى يُصِيبَهَا, ثُمَّ يُمْسِكَ، وَرَجُلٌ أَصَابَتْهُ جَائِحَةٌ, اِجْتَاحَتْ مَالَهُ, فَحَلَّتْ لَهُ اَلْمَسْأَلَةُ حَتَّى يُصِيبَ قِوَامًا مِنْ عَيْشٍ, وَرَجُلٌ أَصَابَتْهُ فَاقَةٌ حَتَّى يَقُومَ ثَلَاثَةٌ مِنْ ذَوِي الْحِجَى مِنْ قَومِهِ: لَقَدْ أَصَابَتْ فُلَانًا فَاقَةٌ; فَحَلَّتْ لَهُ اَلْمَسْأَلَةُ حَتَّى يُصِيبَ قِوَامًا مِنْ عَيْشٍ, فَمَا سِوَاهُنَّ مِنَ اَلْمَسْأَلَةِ يَا قَبِيصَةُ سُحْتٌ يَأْكُلُهَا   1‏ سُحْتًا }  رَوَاهُ مُسْلِمٌ, وَأَبُو دَاوُدَ, وَابْنُ خُزَيْمَةَ, وَابْنُ حِبَّانَ  2‏ .‏‏1 ‏- سقطت من الأصلين، واستدركتها من مصادر التخريج.‏‏2 ‏- صحيح.‏ رواه مسلم ( 1044 )‏، وأبو داود ( 1640 )‏، وابن خزيمة ( 2361 )‏، وابن حبان ( 5 / 168 )‏، من طريق كنانة بن نعيم العدوي، عن قبيصة بن مخارق الهلالي، قال: تحملت حمالة، فأتيت النبي صلى الله عليه وسلم أسأله فيها.‏ فقال: \"أقم حتى تأتينا الصدقة.‏ فنأمر لك بها \" قال: ثم قال: \" يا قبيصة! إن المسألة … فذكره.‏ وتحمل حمالة: أي: المال الذي يتحمله الإنسان عن غيره.‏","english":{"narrator":"Qabisah bin Mukhariq Al-Hilali (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"“Asking for (the money of) Zakah, is justified only for the following three: first, a man who is in debt: it is then permissible for him to receive  until he is in a position to earn his own living; and third, a man who has been reduced to poverty and three persons of caliber from among his people testify to his desperate circumstances. Such will receive until he finds a means of support for himself. Other than these cases, O Qabisah, it is considered as taking suht (unlawful or haram earnings), and the person receiving it (this Zakah) will be consuming forbidden (unlawful) holdings.” Related by Muslim, Abu Dawud, Ibn Khuzaimah and Ibn Hibban."}},{"id":48,"idInBook":48,"chapterId":4,"bookId":17,"arabic":"وَعَنْ عَبْدِ اَلْمُطَّلِبِ بْنِ رَبِيعَةَ بْنِ اَلْحَارِثِ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِنَّ اَلصَّدَقَةَ لَا تَنْبَغِي لِآلِ مُحَمَّدٍ, إِنَّمَا هِيَ أَوْسَاخُ اَلنَّاسِ }   1‏ .‏ \nوَفِي رِوَايَةٍ: { وَإِنَّهَا لَا تَحِلُّ لِمُحَمَّدٍ وَلَا آلِ مُحَمَّدٍ }  رَوَاهُ مُسْلِمٌ  2‏ .‏‏1 ‏- صحيح.‏ رواه مسلم ( 1072 )‏ ( 167 )‏، في حديث طويل.‏\n‏2 ‏- مسلم ( 2 / 754 / 168 )‏.‏","english":{"narrator":"’Abdul Muttalib bin Rabi’ah bin Al-Harith narrated that The Messenger of Allah (ﷺ) said:","text":"“Indeed, Zakah ought not to be given to the family of Muhammad, it will be like giving them from the impurities of people.” In another narration, “It is not lawful for Muhammad or the family of Muhammad(ﷺ). Related by Muslim."}},{"id":49,"idInBook":49,"chapterId":4,"bookId":17,"arabic":"وَعَنْ جُبَيْرِ بْنِ مُطْعِمٍ ‏- رضى الله عنه ‏- قَالَ: { مَشَيْتُ أَنَا وَعُثْمَانُ بْنُ عَفَّانَ ‏- رضى الله عنه ‏- إِلَى اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-فَقُلْنَا: يَا رَسُولَ اَللَّهِ, أَعْطَيْتَ بَنِي اَلْمُطَّلِبِ مِنْ خُمُسِ خَيْبَرَ وَتَرَكْتَنَا, وَنَحْنُ وَهُمْ بِمَنْزِلَةٍ وَاحِدَةٍ, فَقَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-\n\"إِنَّمَا بَنُو اَلْمُطَّلِبِ وَبَنُو هَاشِمٍ شَيْءٌ وَاحِدٌ\".‏ }  رَوَاهُ اَلْبُخَارِيُّ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 3140 )‏.‏","english":{"narrator":"","text":"Jubair bin Mut’am (RAA) narrated, “Uthman Ibn 'Affan and I went to the Messenger of Allah (ﷺ) &, and said to him, ‘O Messenger of Allah (ﷺ)! You have given the family of Banu Al-Muttalib from the fifth of the war booty of Khaibar and left us out, while we and they are of the same status.’ The Messenger of Allah (ﷺ) replied, “Banu Al-Muttalib and Banu Hashim are one.” Related by al-Bukhari."}},{"id":50,"idInBook":50,"chapterId":4,"bookId":17,"arabic":"وَعَنْ أَبِي رَافِعٍ ‏- رضى الله عنه ‏- { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-بَعَثَ رَجُلًا عَلَى اَلصَّدَقَةِ مِنْ بَنِي مَخْزُومٍ, فَقَالَ لِأَبِي رَافِعٍ: اِصْحَبْنِي, فَإِنَّكَ تُصِيبُ مِنْهَا, قَالَ: حَتَّى آتِيَ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-فَأَسْأَلَهُ.‏ فَأَتَاهُ فَسَأَلَهُ, فَقَالَ: \n\" مَوْلَى اَلْقَوْمِ مِنْ أَنْفُسِهِمْ, وَإِنَّا لَا تَحِلُّ لَنَا اَلصَّدَقَةُ \".‏ }  رَوَاهُ أَحْمَدُ, وَالثَّلَاثَةُ, وَابْنُ خُزَيْمَةَ, وَابْنُ حِبَّانَ  1‏ .‏‏1 ‏- صحيح.‏ رواه أحمد ( 6 / 10 )‏، وأبو داود ( 1650 )‏، والنسائي ( 5 / 107 )‏، والترمذي ( 657 )‏، وابن خزيمة ( 2344 )‏، وابن حبان ( 5 / 124 )‏.‏ وقال الترمذي: \" حسن صحيح \".‏","english":{"narrator":"","text":"Abu Rafi (RAA) narrated that The Messenger of Allah (ﷺ) appointed a man from Bani Makhzum to collect the Zakah. The man said to Abu Rafi', ‘Accompany me so that you may get a share of it.' Abu Rafi, replied, ‘No! Not until I go to the Prophet and ask him’ He went to the Messenger of Allah (ﷺ) and asked him, and the Prophet replied, “The client (slave) of a certain tribe are like (the members of the tribe) themselves and Zakah is not lawful for us.” Related by Ahmad, the three Imams, Ibn Khuzaimah and Ibn Hibban."}},{"id":51,"idInBook":51,"chapterId":4,"bookId":17,"arabic":"وَعَنْ سَالِمِ بْنِ عَبْدِ اَللَّهِ بْنِ عُمَرَ, عَنْ أَبِيهِ; { أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-كَانَ يُعْطِي عُمَرَ اَلْعَطَاءَ, فَيَقُولُ: أَعْطِهِ أَفْقَرَ مِنِّي, فَيَقُولُ: \n\"خُذْهُ فَتَمَوَّلْهُ, أَوْ تَصَدَّقْ بِهِ, وَمَا جَاءَكَ مِنْ هَذَا اَلْمَالِ, وَأَنْتَ غَيْرُ مُشْرِفٍ وَلَا سَائِلٍ فَخُذْهُ, وَمَا لَا فَلَا تُتْبِعْهُ نَفْسَكَ\".‏ }  رَوَاهُ مُسْلِمٌ  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم ( 1045 )‏.‏ وغير مشرف: أي: غير متطلع إليه ولا طامع فيه، وهو من الإشراف.‏","english":{"narrator":"","text":"Salim bin ’Abdullah bin ’Umar narrated on the authority of his father (RAA) that the Messenger of Allah (ﷺ) used to give 'Umar bin Al-Khattab something (some money), but he would say to him, ‘Would you give it to a person, who is more needy than me'? The Messenger of Allah (ﷺ) would then say to him, 'Take it. If you are given something from this property, without your having asked for it or being eager to receive it, and if you are not given, do not go and ask for it.” Related by Muslim."}}],"chapter":{"id":4,"bookId":17,"arabic":"كتاب الزكاة","english":"The Book of Zakah"}}