{"metadata":{"length":58,"arabic":{"title":"بلوغ المرام","author":"الإمام ابن حجر العسقلاني","introduction":"كتاب الصيام"},"english":{"title":"Bulugh al-Maram","author":"Ibn Hajar al-Asqalani","introduction":"Fasting"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":5,"bookId":17,"arabic":"عَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا تَقَدَّمُوا رَمَضَانَ بِصَوْمِ يَوْمٍ وَلَا يَوْمَيْنِ, إِلَّا رَجُلٌ كَانَ يَصُومُ صَوْمًا, فَلْيَصُمْهُ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 1914 )‏، ومسلم ( 1082 )‏ واللفظ لمسلم.‏","english":{"narrator":"Abu Hurairah (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"\"None of you should fast a day or two before the (beginning of the) mouth of Ramadan, unless it is a day on which one is in the habit of fasting (i.e. voluntary fasting that coincides with that day).” Agreed upon."}},{"id":2,"idInBook":2,"chapterId":5,"bookId":17,"arabic":"وَعَنْ عَمَّارِ بْنِ يَاسِرٍ ‏- رضى الله عنه ‏- قَالَ: { مَنْ صَامَ اَلْيَوْمَ اَلَّذِي يُشَكُّ فِيهِ فَقَدْ عَصَى أَبَا اَلْقَاسِمِ ‏- صلى الله عليه وسلم ‏-}  وَذَكَرَهُ اَلْبُخَارِيُّ تَعْلِيقًا, وَوَصَلَهُ اَلْخَمْسَةُ, وَصَحَّحَهُ اِبْنُ خُزَيْمَةَ, وَابْنُ حِبَّانَ  1‏ .‏‏1 ‏- صحيح.‏ علقه البخاري ( 4 / 119 / فتح )‏، ووصله أبو داود ( 2334 )‏، والنسائي ( 4 / 153 )‏، والترمذي ( 686 )‏، وابن ماجه ( 1645 )‏، وابن خزيمة ( 1914 )‏، وابن حبان ( 3577 )‏ من طريق صلة بن زفر قال: كنا عند عمار فأتي بشاة مصلية، فقال: كلوا، فتنحى بعض القوم؛ فقال: إني صائم.‏ فقال عمار: فذكره.‏ وقال الترمذي: \" حسن صحيح \".‏ قلت: والحديث لم أجده في \" المسند \".‏","english":{"narrator":"","text":"’Ammar bin Yasir (RAA) narrated, ‘Whoever fasts the day of doubt he has then disobeyed Abu al-Qasim (the Prophet).’ Related by the five Imams, and Ibn Khuzaimah and Ibn Hibban graded it as Sahih"}},{"id":3,"idInBook":3,"chapterId":5,"bookId":17,"arabic":"وَعَنِ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا : سَمِعْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ: { إِذَا رَأَيْتُمُوهُ فَصُومُوا, وَإِذَا رَأَيْتُمُوهُ فَأَفْطِرُوا, فَإِنْ غُمَّ عَلَيْكُمْ فَاقْدُرُوا لَهُ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏ \nوَلِمُسْلِمٍ: { فَإِنْ أُغْمِيَ عَلَيْكُمْ فَاقْدُرُوا   2‏ .‏ ثَلَاثِينَ }   3‏ .‏ \nوَلِلْبُخَارِيِّ: { فَأَكْمِلُوا اَلْعِدَّةَ ثَلَاثِينَ }   4‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 1900 )‏، ومسلم ( 1080 )‏ ( 8 )‏.‏\n‏2 ‏- ساقطة من الأصلين، واستدركها من الصحيح، وهي كذلك موجودة في المطبوع، وفي الشرح.‏‏3 ‏- صحيح.‏ رواه مسلم ( 1080 )‏ ( 4 )‏.‏\n‏4 ‏- صحيح.‏ رواه البخاري ( 1907 )‏.‏","english":{"narrator":"","text":"Ibn 'Umar (RAA) narrated, ‘I heard the Messenger of Allah (ﷺ) say, \"Start fasting after you have seen it (i.e. the new crescent) and end the fast (at the end of the month) when you see it. If it is overcast and cannot be seen, then estimate its sighting (i.e. presume that Sha‘ban lasted for thirty days).\" Agreed upon. Muslim narrated, \"If it is too overcast to be seen then presume that it (Sha'ban) lasted for thirty days.\"In another narration by al-Bukhari, \"wait, until thirty days of it (Sha’ban) have passed.\""}},{"id":4,"idInBook":4,"chapterId":5,"bookId":17,"arabic":"وَلَهُ فِي حَدِيثِ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- { فَأَكْمِلُوا عِدَّةَ شَعْبَانَ ثَلَاثِينَ }   1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 1909 )‏.‏","english":{"narrator":"","text":"Al-Bukhari reported on the authority of Abu Hurairah, “Complete the days of Sha’ban as thirty days.”"}},{"id":5,"idInBook":5,"chapterId":5,"bookId":17,"arabic":"وَعَنِ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { تَرَاءَى اَلنَّاسُ اَلْهِلَالَ, فَأَخْبَرْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-أَنِّي رَأَيْتُهُ, فَصَامَ, وَأَمَرَ اَلنَّاسَ بِصِيَامِهِ }  رَوَاهُ أَبُو دَاوُدَ, وَصَحَّحَهُ اِبْنُ حِبَّانَ, وَالْحَاكِمُ  1‏ .‏‏1 ‏- صحيح.‏ رواه أبو داود ( 2342 )‏، وابن حبان ( 3438 )‏، والحاكم ( 1 / 423 )‏.‏","english":{"narrator":"","text":"Ibn ’Umar (RAA) narrated, ‘The people were trying to sight the new moon (of Ramadan.) and when I reported to the Messenger of Allah (ﷺ) that I had seen it, he fasted and commanded people to fast.’ Related by Abu Dawud, and Al-Hakim and Ibn Hibban graded it as Sahih."}},{"id":6,"idInBook":6,"chapterId":5,"bookId":17,"arabic":"وَعَنِ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا أَنَّ أَعْرَابِيًّا جَاءَ إِلَى اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-فَقَالَ: { إِنِّي رَأَيْتُ اَلْهِلَالَ, فَقَالَ: \" أَتَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اَللَّهُ? \" قَالَ: نَعَمْ.‏ قَالَ: \" أَتَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اَللَّهِ? \" قَالَ: نَعَمْ.‏ قَالَ: \" فَأَذِّنْ فِي اَلنَّاسِ يَا بِلَالُ أَنْ يَصُومُوا غَدًا\" }  رَوَاهُ اَلْخَمْسَةُ, وَصَحَّحَهُ اِبْنُ خُزَيْمَةَ, وَابْنُ حِبَّانَ  1‏ وَرَجَّحَ النَّسَائِيُّ إِرْسَالَهُ  2‏ .‏‏1 ‏- ضعيف.‏ رواه أبو داود ( 2340 )‏، والنسائي ( 4 / 132 )‏، والترمذي ( 691 )‏، وابن ماجه ( 1652 )‏، وابن خزيمة ( 1923 )‏، وابن حبان ( 870 / موارد )‏ من طريق سماك بن حرب، عن عكرمة، عن ابن عباس.‏ وسماك مضطرب في روايته عن عكرمة، وقد اختلف عليه فيه، فمرة موصولا، ومرة مرسلا.‏ قلت: والحديث لم أجده في \" المسند \".‏ \" تنبيه \": هذا الحديث والذي قبله حجة لبعض المذاهب ‏-كالمذهب الحنبلي مثلا‏- في إثبات دخول الشهر بشاهد واحد، وليس لهم حجة في ذلك، ولقد بينت ذلك في كتاب \" الإلمام بآداب وأحكام الصيام \" ص ( 15 ‏- 16 )‏ الطبعة الأولى.‏‏2 ‏- نقله الزيلعي في \" نصب الراية \" ( 2 / 443 )‏، وهو قول الترمذي أيضا في \" سننه \".‏","english":{"narrator":"","text":"Ibn ‘Abbas (RAA) narrated, ‘A Bedouin came to the Prophet and said, ‘I have sighted the crescent (of Ramadan). He then said to him, \"Do you testify that there is none worthy of worship but Allah?” The Bedouin said, ‘Yes.’ He asked him again, \"Do you testify that Muhammad is the Messenger of Allah (ﷺ)?\" The man replied, ‘Yes.’ The Messenger of Allah (ﷺ) there upon said, \"O Bilal! Announce to the people to (start) fasting tomorrow.\" Related by the five Imams. Ibn Khuzaimah and Ibn Hibban graded it as Sahih. An-Nasa'i said that it is most probably Mursal (a Hadith in which the link between the Successor (Tabi’i) and the Prophet (ﷺ) is missing."}},{"id":7,"idInBook":7,"chapterId":5,"bookId":17,"arabic":"وَعَنْ حَفْصَةَ أُمِّ اَلْمُؤْمِنِينَ رَضِيَ اَللَّهُ عَنْهَا, عَنِ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { مَنْ لَمْ يُبَيِّتِ اَلصِّيَامَ قَبْلَ اَلْفَجْرِ فَلَا صِيَامَ لَهُ }  رَوَاهُ اَلْخَمْسَةُ, وَمَالَ النَّسَائِيُّ وَاَلتِّرْمِذِيُّ إِلَى تَرْجِيحِ وَقْفِهِ, وَصَحَّحَهُ مَرْفُوعًا اِبْنُ خُزَيْمَةَ وَابْنُ حِبَّانَ  1‏ .‏ \nوَلِلدَّارَقُطْنِيِّ: { لَا صِيَامَ لِمَنْ لَمْ يَفْرِضْهُ مِنَ اَللَّيْلِ }   2‏ .‏‏1 ‏- صحيح.‏ رواه أبو داود ( 2454 )‏، والنسائي ( 4 / 196 )‏، والترمذي ( 730 )‏، وابن ماجه ( 1700 )‏، وأحمد ( 6 / 287 )‏، وابن خزيمة ( 1933 )‏، واللفظ للنسائي، وعن الباقين ‏-عدا ابن ماجه‏- \" يجمع \" بدل \" يبيت \" وهي أيضا رواية للنسائي.‏ وأما ابن ماجه فلفظه كلفظ الدارقطني الآتي، وفي \" الأصل \" ذكر ما يقوي رفعه، وأيضا ذكر ما صححه مرفوعا.‏\n‏2 ‏- صحيح.‏ رواه الدارقطني ( 2 / 172 )‏، وهو لفظ ابن ماجه أيضا كما سبق.‏","english":{"narrator":"The mother of the believers, Hafsah (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"“Whoever does not form his intention to fast before to fajr, his fasting will not be accepted.” Related by the five Imams, but At-Tirmidhi and An-Nasa’i consider it to be related by Hafsah and not connected to the Prophet (ﷺ). Imam Ad-Daraqutni transmitted, \"No fasting is accepted for one who does not form the intention (to fast) the night before.”"}},{"id":8,"idInBook":8,"chapterId":5,"bookId":17,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: { دَخَلَ عَلَيَّ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-ذَاتَ يَوْمٍ.‏ فَقَالَ: \" هَلْ عِنْدَكُمْ شَيْءٌ? \" قُلْنَا: لَا.‏ قَالَ: \" فَإِنِّي إِذًا صَائِمٌ \" ثُمَّ أَتَانَا يَوْمًا آخَرَ, فَقُلْنَا: أُهْدِيَ لَنَا حَيْسٌ, فَقَالَ: \" أَرِينِيهِ, فَلَقَدْ أَصْبَحْتُ صَائِمًا \" فَأَكَلَ }  رَوَاهُ مُسْلِمٌ  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم ( 1154 )‏ ( 170 )‏.‏","english":{"narrator":"","text":"'A’isha (RAA) narrated, ‘One day the Messenger of Allah (ﷺ) entered my house and said, “ls there anything here (to eat)?\" I said, ‘NO,’ He said, “I shall then be fasting (today).\" Then he came to us another day and we said to him, 'Someone has offered us some hais as a gift.’ He then said, \"Show it to me. I had been fasting since this morning, “and he ate from it ( as it was a voluntary fast and not during the obligatory fasting of Ramadan). Related by Muslim."}},{"id":9,"idInBook":9,"chapterId":5,"bookId":17,"arabic":"وَعَنْ سَهْلِ بْنِ سَعْدٍ رَضِيَ اَللَّهُ عَنْهُمَا, أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { لَا يَزَالُ اَلنَّاسُ بِخَيْرٍ مَا عَجَّلُوا اَلْفِطْرَ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 1757 )‏، ومسلم ( 1098 )‏.‏ وانظر ‏-رعاك الله‏- إلى قول النبي صلى الله عليه وسلم هذا، وإلى فعل الناس الآن، فإنهم قد ساروا على الحساب الفلكي وزادوا فيه احتياطا، حتى إن إفطار الناس اليوم لا يكون إلا بعد دخول الوقت الشرعي بحوالي عشر دقائق، وعندما تناقش بعضهم ‏-وإن كان ينتسب إلى العلم‏- تسمع منه ما هو بعيد تماما عن الأدلة، بل وترى التنطع، إذ قد يكون بعضهم في الصحراء ويبصر بعينيه غروب الشمس لكنه لا يفطر إلا على المذياع، فيخالف الشرع مرتين.‏ الأولى: بعصيانه في تأخير الفطر، والثانية: في إفطاره على أذان في غير المكان الذي هو فيه، وأنا أعجب والله من هؤلاء الذين يلزمون ‏-من جملة من يلزمون‏- ذلك البدوي في الصحراء بالإفطار على الحساب الفلكي الذي ربما لم يسمع عنه ذلك البدوي أصلا، ولا يلزمونه بما جاءت به الشريعة وبما يعرفه البدوي وغيره، ألا وهو قوله صلى الله عليه وسلم: \" إذا أقبل الليل من هاهنا، وأدبر النهار من هاهنا، وغربت الشمس فقد أفطر الصائم\".‏ متفق عليه.‏ وعلى هذا كان فعل النبي صلى الله عليه وسلم وأصحابه والسلف الصالح، ولذلك كانوا في خير عظيم، وأما نحن فيكفي أن تنظر إلى حالنا لتعلم أين نحن.‏ والله المستعان.‏ وانظر \" الإلمام بآداب وأحكام الصيام \" ص ( 21 و 30 )‏.‏","english":{"narrator":"Sahl bin Sa'd (RAA) narrated That the Messenger of Allah (ﷺ) said:","text":"\"People will always be fine (on the right path, or following the Sunnah) as long as they hasten to break their fast (in Ramadan).\" Agreed upon."}},{"id":10,"idInBook":10,"chapterId":5,"bookId":17,"arabic":"وَلِلتِّرْمِذِيِّ: مِنْ حَدِيثِ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- عَنِ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { قَالَ اَللَّهُ عَزَّ وَجَلَّ أَحَبُّ عِبَادِي إِلَيَّ أَعْجَلُهُمْ فِطْرًا }   1‏ .‏‏1 ‏- ضعيف: رواه الترمذي ( 700 )‏ وقد بينت علته في \" الأصل \" وفي \" الصيام \" للفريابي رقم ( 33 )‏ وبينت هناك ما في كلام الشيخ أحمد شاكر ‏-رحمه الله‏- في تعليقه على \" المسند \" ( 12 / 232 )‏ من وهم وتساهل.‏","english":{"narrator":"Abu Hurairah (RAA) narrated, ‘The Messenger of Allah (ﷺ) said:","text":"\"Allah, the Most Exalted said: “Those among My servants, who hasten to break their fast, are the most beloved (or dearest)to Me.” Related by At-Tirmidhi."}},{"id":11,"idInBook":11,"chapterId":5,"bookId":17,"arabic":"وَعَنْ أَنَسِ بْنِ مَالِكٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ تَسَحَّرُوا فَإِنَّ فِي اَلسَّحُورِ بَرَكَةً }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 1923 )‏، ومسلم ( 1095 )‏.‏","english":{"narrator":"Anas (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"“Eat the suhur (pre-dawn meal), for there are blessings in this meal.” Agreed upon."}},{"id":12,"idInBook":12,"chapterId":5,"bookId":17,"arabic":"وَعَنْ سَلْمَانَ بْنِ عَامِرٍ اَلضَّبِّيِّ ‏- رضى الله عنه ‏- عَنِ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { إِذَا أَفْطَرَ أَحَدُكُمْ فَلْيُفْطِرْ عَلَى تَمْرٍ, فَإِنْ لَمْ يَجِدْ فَلْيُفْطِرْ عَلَى مَاءٍ, فَإِنَّهُ طَهُورٌ }  رَوَاهُ اَلْخَمْسَةُ, وَصَحَّحَهُ اِبْنُ خُزَيْمَةَ وَابْنُ حِبَّانَ وَالْحَاكِمُ  1‏ .‏‏1 ‏- ضعيف.‏ وهو مخرج في \" الصيام \" للفريابي ( 62 )‏، ولكن صح عن أنس رضي الله عنه، أنه قال: ما رأيت النبي صلى الله عليه وسلم قط يصلي حتى يفطر، ولو على شربة ماء.‏ وهو مخرج في نفس المصدر برقم ( 67 )‏.‏","english":{"narrator":"Sulaiman bin ’Amir Ad-Dabbi (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"“When one of you is breaking his fast, he should eat some dates. If dates are not available, then break it with some water, for water is purifying.’’ Related by the five lmams. Ibn Khuzaimah, Ibn Hibban and al-Hakim graded it as Sahih."}},{"id":13,"idInBook":13,"chapterId":5,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: { نَهَى رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-عَنِ اَلْوِصَالِ, فَقَالَ رَجُلٌ مِنَ اَلْمُسْلِمِينَ: فَإِنَّكَ يَا رَسُولَ اَللَّهِ تُوَاصِلُ? قَالَ: \" وَأَيُّكُمْ مِثْلِي? إِنِّي أَبِيتُ يُطْعِمُنِي رَبِّي وَيَسْقِينِي \".‏ فَلَمَّا أَبَوْا أَنْ يَنْتَهُوا عَنِ اَلْوِصَالِ وَاصَلَ بِهِمْ يَوْمًا, ثُمَّ يَوْمًا, ثُمَّ رَأَوُا اَلْهِلَالَ, فَقَالَ: \" لَوْ تَأَخَّرَ اَلْهِلَالُ لَزِدْتُكُمْ \" كَالْمُنَكِّلِ لَهُمْ حِينَ أَبَوْا أَنْ يَنْتَهُوا }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ روه البخاري ( 1965 )‏، ومسلم ( 1103 )‏.‏","english":{"narrator":"","text":"Abu Hurairah (RAA) narrated, The Messenger of Allah (ﷺ) forbade us from practicing wisal in fasting (i.e. fasting continuously without breaking one’s fast in the evening or eating before the following dawn). So a man said to him, ‘But you practice wisal O Messenger of Allah!’ The Prophet Allah (ﷺ) replied, “Which one of you is like me? I am given food and drink during my sleep by Allah.\" So when people refused to stop wisal, the Prophet fasted day and night continuously along with them for a day and then another day and then they saw the crescent (of the new month of Shawwal). The Prophet said to them, \"If the crescent had not appeared, I would have made you fast for a longer period.\" That was a punishment for them because they refused to stop (practicing Wisal). Agreed upon."}},{"id":14,"idInBook":14,"chapterId":5,"bookId":17,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ لَمْ يَدَعْ قَوْلَ اَلزُّورِ وَالْعَمَلَ بِهِ, وَالْجَهْلَ, فَلَيْسَ لِلَّهِ حَاجَةٌ فِي أَنْ يَدَعَ طَعَامَهُ وَشَرَابَهُ }  رَوَاهُ اَلْبُخَارِيُّ, وَأَبُو دَاوُدَ وَاللَّفْظُ لَهُ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 6057 )‏، وأبو داود ( 2362 )‏، ووهم الحافظ رحمه الله في نسبة هذا اللفظ لأبي داود دون البخاري؛ إذ هو لفظ البخاري حرفا حرفا سوى أنه قال: \" حاجة أن يدع \" بدون \" في \" ولا أثر لذلك.‏ وأما أبو داود فليس عنده: \" والجهل \" وما أظن الحافظ ذكر أبا داود ولا عزه إليه إلا من أجل هذا اللفظ.‏ والله أعلم.‏","english":{"narrator":"Abu Hurairah (BAA) narrated that The Messenger of Allah (ﷺ) said:","text":"“Whoever does not give up forged speech and evil actions and does not abandon foolishness, Allah is not in need of his leaving food and drink (i.e. Allah will not accept his FASTING).” Related by Al-Bukhari and Abu Dawud, and the wording is from the latter."}},{"id":15,"idInBook":15,"chapterId":5,"bookId":17,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: { كَانَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يُقَبِّلُ وَهُوَ صَائِمٌ, وَيُبَاشِرُ وَهُوَ صَائِمٌ, وَلَكِنَّهُ أَمْلَكُكُمْ لِإِرْبِهِ }  مُتَّفَقٌ عَلَيْهِ, وَاللَّفْظُ لِمُسْلِمٍ  1‏ .‏ \nوَزَادَ فِي رِوَايَةٍ: { فِي رَمَضَانَ }   2‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 1927 )‏، ومسلم ( 1106 )‏، ( 65 )‏.‏\n‏2 ‏- مسلم ( 1106 )‏ ( 71 )‏.‏","english":{"narrator":"","text":"'A’isha (RAA) narrated that The Messenger of Allah (ﷺ) would kiss and embrace (his wives) while fasting, for he had the most control of all of you over his desires.’ Agreed upon and the wording is from Muslim, who added in a narration, ‘In Ramadan."}},{"id":16,"idInBook":16,"chapterId":5,"bookId":17,"arabic":"وَعَنِ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا; { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-اِحْتَجَمَ وَهُوَ مُحْرِمٌ, وَاحْتَجَمَ وَهُوَ صَائِمٌ }  رَوَاهُ اَلْبُخَارِيُّ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 1938 )‏ وتكلم بعضهم في الحديث، لكن كما قال الحافظ في \" الفتح \" ( 4 / 178 )‏: \" الحديث صحيح لا مرية فيه \".‏ وانظر رقم ( 737 )‏.‏","english":{"narrator":"","text":"Ibn 'Abbas (RAA) narrated that The Messenger of Allah (ﷺ) had himself cupped while he was in a state of Ihram, and had himself cupped while he was fasting.’’ Related by Al-Bukhari."}},{"id":17,"idInBook":17,"chapterId":5,"bookId":17,"arabic":"وَعَنْ شَدَّادِ بْنِ أَوْسٍ ‏- رضى الله عنه ‏- { أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-أَتَى عَلَى رَجُلٍ بِالْبَقِيعِ وَهُوَ يَحْتَجِمُ فِي رَمَضَانَ.‏ فَقَالَ: \" أَفْطَرَ اَلْحَاجِمُ  \" }  رَوَاهُ اَلْخَمْسَةُ إِلَّا اَلتِّرْمِذِيَّ, وَصَحَّحَهُ أَحْمَدُ, وَابْنُ خُزَيْمَةَ, وَابْنُ حِبَّانَ  1‏ .‏‏1 ‏- صحيح.‏ رواه أبو داود ( 2369 )‏، والنسائي في \" الكبرى \" ( 3144 )‏، وابن ماجه ( 1681 )‏، وأحمد ( 5 / 283 )‏، وابن حبان ( 5 / 218 ‏- 219 )‏ وما بين الحاصرتين سقط من \" أ \"، وهذا من سهو الناسخ.‏ والله أعلم.‏ وتصحيح أحمد نقله الحاكم في \" المستدرك \" ( 1 / 430 )‏.‏ وأما عزوه لابن خزيمة فلا أظنه إلا وهما.‏ والله أعلم.‏ \" تنبيه \": قال الذهبي في \" التنقيح \" ( ق / 89 / أ )‏: \" قوله: بالبقيع.‏ خطأ فاحش، فإن النبي صلى الله عليه وسلم كان يوم التاريخ المذكور في مكة، اللهم إلا أن يريد بالبقيع السوق \".‏","english":{"narrator":"","text":"Shaddad bin Aus (RAA) narrated that The Messenger of Allah (ﷺ) came across a man in Al-Baqi' (in Madinah) who was having himself cupped in Ramadan., and said to him, “The one who cups and the one who is being cupped have both broken their fast.\" Related by the five Imams except for At-Tirmidhi. Ahmad, Ibn Khuzaimah and Ibn Hibban regarded it as authentic."}},{"id":18,"idInBook":18,"chapterId":5,"bookId":17,"arabic":"وَعَنْ أَنَسِ بْنِ مَالِكٍ ‏- رضى الله عنه ‏- قَالَ: { أَوَّلُ مَا كُرِهَتِ اَلْحِجَامَةُ لِلصَّائِمِ; أَنَّ جَعْفَرَ بْنَ أَبِي طَالِبٍ اِحْتَجَمَ وَهُوَ صَائِمٌ, فَمَرَّ بِهِ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-فَقَالَ: \n\" أَفْطَرَ هَذَانِ \", ثُمَّ رَخَّصَ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-بَعْدُ فِي اَلْحِجَامَةِ لِلصَّائِمِ, وَكَانَ أَنَسٌ يَحْتَجِمُ وَهُوَ صَائِمٌ }  رَوَاهُ اَلدَّارَقُطْنِيُّ وَقَوَّاهُ  1‏ .‏‏1 ‏- منكر.‏ رواه الدارقطني ( 2 / 182 / 7 )‏ وقال: \" كلهم ثقات، ولا أعلم له علة \".‏ قلت: وفي الأصل ذكرت جماعة ممن أنكروا الحديث أحدهم الحافظ نفسه.‏","english":{"narrator":"","text":"Anas (RAA) narrated, ‘The first time cupping was dis-liked for the one who is fasting was when Ja’far bin Abi Talib had himself cupped while fasting and the Messenger of Allah (ﷺ) came across him and said, \"Those two have broken their fast (meaning Ja'far and the man who was cupping him.)\" But later on the Prophet allowed cupping for the one who is fasting. Anas used to have himself cupped while he was fasting. Related by Ad-Daraqutni, who regarded it as a strong hadith."}},{"id":19,"idInBook":19,"chapterId":5,"bookId":17,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا, { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-اِكْتَحَلَ فِي رَمَضَانَ, وَهُوَ صَائِمٌ }  رَوَاهُ اِبْنُ مَاجَهْ بِإِسْنَادٍ ضَعِيفٍ  1‏ .‏ \nقَالَ اَلتِّرْمِذِيُّ: لَا يَصِحُّ فِيهِ شَيْءٌ  2‏ .‏‏1 ‏- ضعيف.‏ رواه ابن ماجه ( 1678 )‏.‏\n‏2 ‏- هكذا في الأصلين، وفي المطبوع من \" البلوغ \" والشرح: \" لا يصح في هذا الباب شيء \".‏ وفي \" السنن \" ( 3 / 105 )‏ \" لا يصح عن النبي صلى الله عليه وسلم شيء \".‏","english":{"narrator":"","text":"'A’isha (RAA) narrated, The Messenger of Allah (ﷺ) applied kohl to his eyes while he was fasting.’ Related by Ibn Majah with a weak chain of narrators. According to At-Tirmidhi, nothing authentic has been related from the Prophet concerning this issue, i.e. applying kohl, eye drops etc. to the eye while fasting."}},{"id":20,"idInBook":20,"chapterId":5,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ نَسِيَ وَهُوَ صَائِمٌ, فَأَكَلَ أَوْ شَرِبَ, فَلْيُتِمَّ صَوْمَهُ, فَإِنَّمَا أَطْعَمَهُ اَللَّهُ وَسَقَاهُ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 1933 )‏، ومسلم ( 1155 )‏، واللفظ لمسلم.‏","english":{"narrator":"Abu Hurairah (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"‘Whoever forgets that he is fasting, and eats or drinks is to complete his fast, as it was Allah who fed him and gave him something to drink.\" Agreed upon."}},{"id":21,"idInBook":21,"chapterId":5,"bookId":17,"arabic":"وَلِلْحَاكِمِ: { مَنْ أَفْطَرَ فِي رَمَضَانَ نَاسِيًا فَلَا قَضَاءَ عَلَيْهِ وَلَا كَفَّارَةَ }  وَهُوَ صَحِيحٌ  1‏ .‏‏1 ‏- حسن.‏ رواه الحاكم ( 1 / 430 )‏ إذ في سنده محمد بن عمرو بن علقمة، وهو حسن الحديث.‏ وقد فات الحافظ أن ينسب الحديث لمن هو أعلى من الحاكم كابن خزيمة مثلا ( 1990 )‏ وغيره.‏","english":{"narrator":"","text":"Al-Hakim transmitted on the authority of Abu Hurairah, “Whoever breaks his fast during Ramadan due to forgetfulness is not to make up for the day later or perform an expiation.” It is a sound hadith."}},{"id":22,"idInBook":22,"chapterId":5,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ ذَرَعَهُ اَلْقَيْءُ فَلَا قَضَاءَ عَلَيْهِ, وَمَنْ اسْتَقَاءَ فَعَلَيْهِ اَلْقَضَاءُ }  رَوَاهُ اَلْخَمْسَةُ  1‏ .‏\nوَأَعَلَّهُ أَحْمَدُ  2‏ .‏ \nوَقَوَّاهُ اَلدَّارَقُطْنِيُّ  3‏ .‏‏1 ‏- صحيح.‏ رواه أبو داود ( 2380 )‏، والنسائي في \" الكبرى \" ( 2 / 215 )‏، والترمذي ( 720 )‏، وابن ماجه ( 1676 )‏، وأحمد ( 2 / 498 )‏.‏\n‏2 ‏- قال البيهقي في \" السنن الكبرى \" ( 4 / 219 )‏: \" قال أبو داود: سمعت أحمد بن حنبل يقول: ليس من ذا شيء \".‏ فقال الخطابي: \" قلت: يريد أن الحديث غير محفوظ \".‏ قلت: وأعله أيضا غير الإمام أحمد وما ذلك إلا لظنهم تفرد أحد رواته وليس كذلك كما هو مبين بالأصل.‏\n‏3 ‏- إذا قال في \" السنن \" ( 2 / 184 )‏: \" رواته كلهم ثقات \".‏","english":{"narrator":"Abu Hurairah (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"“Whoever is overcome and vomits is not to make up for the day, but whoever vomits intentionally must make up the day.” Related by the five Imams."}},{"id":23,"idInBook":23,"chapterId":5,"bookId":17,"arabic":"وَعَنْ جَابِرِ بْنِ عَبْدِ اَللَّهِ رَضِيَ اَللَّهُ عَنْهُمَا; { أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-خَرَجَ عَامَ اَلْفَتْحِ إِلَى مَكَّةَ فِي رَمَضَانَ, فَصَامَ حَتَّى بَلَغَ كُرَاعَ الْغَمِيمِ, فَصَامَ اَلنَّاسُ, ثُمَّ دَعَا بِقَدَحٍ مِنْ مَاءٍ فَرَفَعَهُ, حَتَّى نَظَرَ اَلنَّاسُ إِلَيْهِ, ثُمَّ شَرِبَ, فَقِيلَ لَهُ بَعْدَ ذَلِكَ: إِنَّ بَعْضَ اَلنَّاسِ قَدْ صَامَ.‏ قَالَ: \n\"أُولَئِكَ اَلْعُصَاةُ, أُولَئِكَ اَلْعُصَاةُ\" }   1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم ( 1114 )‏ ( 90 )‏.‏","english":{"narrator":"","text":"Jabir (RAA) narrated, ‘The Messenger of Allah (ﷺ) left for Makkah during the year of the conquest (of Makkah) in Ramadan and he and the people with him fasted until he reached the valley of Kura Al-Ghamim. He then called for a cup of water, which he elevated so that the people could see it, and then he drank. After-wards, he was told that some people had continued to fast, and he then said, \"Those are the disobedient ones! Those are the disobedient ones!”"}},{"id":24,"idInBook":24,"chapterId":5,"bookId":17,"arabic":"وَفِي لَفْظٍ: { فَقِيلَ لَهُ: إِنَّ اَلنَّاسَ قَدْ شَقَّ عَلَيْهِمُ اَلصِّيَامُ, وَإِنَّمَا يَنْظُرُونَ فِيمَا فَعَلْتَ، فَدَعَا بِقَدَحٍ مِنْ مَاءٍ بَعْدَ اَلْعَصْرِ، فَشَرِبَ }  رَوَاهُ مُسْلِمٌ  1‏ .‏‏1 ‏- حسن.‏ وهذه الرواية في \" مسلم \" ( 1114 )‏ ( 91 )‏، ولكن لفظ: \" فشرب\" ليس في \"الصحيح \"، وإنما هو من أوهام الحافظ رحمه الله.‏","english":{"narrator":"","text":"In another narration, ‘He was told that people are finding it difficult to fast (during the journey) and they are waiting to see what the Prophet (ﷺ) will do. So he called for a cup of water after the Asr (afternoon) prayer and drank it.’ Related by Muslim."}},{"id":25,"idInBook":25,"chapterId":5,"bookId":17,"arabic":"وَعَنْ حَمْزَةَ بْنِ عَمْرٍو الْأَسْلَمِيِّ رِضَى اَللَّهُ عَنْهُ; أَنَّهُ قَالَ: { يَا رَسُولَ اَللَّهِ! أَجِدُ بِي قُوَّةً عَلَى اَلصِّيَامِ فِي اَلسَّفَرِ, فَهَلْ عَلَيَّ جُنَاحٌ? فَقَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-\n\" هِيَ رُخْصَةٌ مِنَ اَللَّهِ, فَمَنْ أَخَذَ بِهَا فَحَسَنٌ, وَمَنْ أَحَبَّ أَنْ يَصُومَ فَلَا جُنَاحَ عَلَيْهِ \" }  رَوَاهُ مُسْلِمٌ  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم ( 1121 )‏ ( 107 )‏.‏","english":{"narrator":"","text":"Hamzah bin ’Amro Al-Aslami (RAA) narrated, ‘I said to the Messenger of Allah (ﷺ) ‘O Messenger of Allah (ﷺ)! I find within me the strength to fast while traveling. Would there be any blame upon me if I were to do so?’ The Messenger of Allah (ﷺ) said to him, \"It is a concession from Allah. Whoever takes it has done well. Whoever likes to fast, there is no blame upon him.\"Related by Muslim."}},{"id":26,"idInBook":26,"chapterId":5,"bookId":17,"arabic":"وَأَصْلُهُ فِي \n\" اَلْمُتَّفَقِِ \" مِنْ حَدِيثِ عَائِشَةَ; { أَنَّ حَمْزَةَ بْنَ عَمْرٍو سَأَلَ }   1‏‏1 ‏- صحيح.‏ رواه البخاري ( 4 / 179 / فتح )‏، ومسلم ( 2 / 789 )‏ وتمامه: رسول الله صلى الله عليه وسلم عن الصيام في السفر، فقال: \" إن شئت فصم، وإن شئت فافطر \".‏","english":{"narrator":"","text":"And it's basic meaning is in Al-Bukhari and Muslim from the narration of Aisha (with the wording) \"that Hamza bin 'Amro asked\"."}},{"id":27,"idInBook":27,"chapterId":5,"bookId":17,"arabic":"وَعَنِ اِبْنِ عَبَّاسٍ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: { رُخِّصَ لِلشَّيْخِ اَلْكَبِيرِ أَنْ يُفْطِرَ, وَيُطْعِمَ عَنْ كُلِّ يَوْمٍ مِسْكِينًا, وَلَا قَضَاءَ عَلَيْهِ }  رَوَاهُ اَلدَّارَقُطْنِيُّ, وَالْحَاكِمُ, وَصَحَّحَاهُ  1‏ .‏‏1 ‏- صحيح.‏ رواه الدارقطني ( 2 / 205 / 6 )‏، والحاكم ( 1 / 440 )‏، وقال الدارقطني: وهذا الإسناد صحيح.‏ وقال الحاكم: حديث صحيح على شرط البخاري.‏","english":{"narrator":"","text":"Ibn ’Abbas (RAA) narrated, ‘An elderly man is permitted to break his fast, but he must feed a poor person daily, and he does not have to make up for it.’ Related by Ad-Daraqutni and Al- hakim, who rendered it to be Sahih"}},{"id":28,"idInBook":28,"chapterId":5,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: { جَاءَ رَجُلٌ إِلَى اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-فَقَالَ: هَلَكْتُ يَا رَسُولَ اَللَّهِ.‏ قَالَ: \" وَمَا أَهْلَكَكَ ? \" قَالَ: وَقَعْتُ عَلَى اِمْرَأَتِي فِي رَمَضَانَ، فَقَالَ: \" هَلْ تَجِدُ مَا تَعْتِقُ رَقَبَةً? \" قَالَ: لَا.‏ قَالَ: \" فَهَلْ تَسْتَطِيعُ أَنْ تَصُومَ شَهْرَيْنِ مُتَتَابِعَيْنِ? \" قَالَ: لَا.‏ قَالَ: \" فَهَلْ تَجِدُ مَا تُطْعِمُ سِتِّينَ مِسْكِينًا? \" قَالَ: لَا, ثُمَّ جَلَسَ, فَأُتِي اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-بِعَرَقٍ فِيهِ تَمْرٌ.‏ فَقَالَ: \" تَصَدَّقْ بِهَذَا \", فَقَالَ: أَعَلَى أَفْقَرَ مِنَّا? فَمَا بَيْنَ لَابَتَيْهَا أَهْلُ بَيْتٍ أَحْوَجُ إِلَيْهِ مِنَّا, فَضَحِكَ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-حَتَّى بَدَتْ أَنْيَابُهُ، ثُمَّ قَالَ: \"اذْهَبْ فَأَطْعِمْهُ أَهْلَكَ \" }  رَوَاهُ اَلسَّبْعَةُ, وَاللَّفْظُ لِمُسْلِمٍ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 1936 )‏، ومسلم ( 1111 )‏، وأبو داود ( 2390 )‏، والنسائي في \" الكبرى \" ( 2 / 212 ‏- 213 )‏، والترمذي ( 724 )‏، وابن ماجه ( 1671 )‏، وأحمد ( 2 / 208 و 241 و 281 و 516 )‏.‏","english":{"narrator":"","text":"Abu Hurairah (RAA) narrated that A man came to the Messenger of Allah (ﷺ) and said, “l am ruined O Messenger of Allah (ﷺ)!\" The Messenger of Allah (ﷺ) asked him, “What has ruined you?\" The man replied, ‘I had intercourse with my wife during the day in Ramadan while fasting)’ The Prophet said to him, \"Are you able to free a slave?\" The man said, ‘No.’ The Prophet said, \"Can you fast for two consecutive months?\" He said, ‘NO.' The Prophet then asked him, \"Can you provide food for sixty poor people?\" He said, ‘No.’ Then the man sat down. A basket of dates was brought to the Prophet and he said to the man, “Give this as Sadaqah (voluntary charity)” The man said, ‘To someone who is poorer than us!’ There is no one in this city (Al-Madinah) who is in need of these dates more than us!’ The Prophet laughed until his molar teeth could be seen and said to the man, “Go and feed your family with these dates.” Related by the seven Imams and the wording is from Muslim."}},{"id":29,"idInBook":29,"chapterId":5,"bookId":17,"arabic":"677 678‏- وَعَنْ عَائِشَةَ وَأُمِّ سَلَمَةَ رَضِيَ اَللَّهُ عَنْهُمَا { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-كَانَ يُصْبِحُ جُنُبًا مِنْ جِمَاعٍ, ثُمَّ يَغْتَسِلُ وَيَصُومُ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏ \nزَادَ مُسْلِمٌ فِي حَدِيثِ أُمِّ سَلَمَةَ:  لَا يَقْضِي  2‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 4 / 143 / فتح )‏، ومسلم ( 1109 )‏، ولقد ساق الحافظ الحديث بالمعنى، وإلا: فلفظ البخاري؛ أن رسول الله صلى الله عليه وسلم كان يدركه الفجر وهو جنب من أهله، ثم يغتسل ويصوم.‏ وأما لفظ مسلم: كان النبي صلى الله عليه وسلم يصبح جنبا من غير حلم، ثم يصوم.‏\n‏2 ‏- مسلم ( 2 / 780 / 77 )‏.‏ والزيادة سقطت من \" أ \".‏","english":{"narrator":"","text":"'A’isha and Umm Salamah (RAA) narrated, The Messenger of Allah (ﷺ) would rise in the morning (when it is already Fajr time) while he was Junub (in a state of major ritual impurity due to intercourse) on a day in Ramadan. He would then perform Ghusl and fast. Agreed upon. In the narration of Muslim on the authority of Umm Salamah, ‘And he would not make up for it (that day).’"}},{"id":30,"idInBook":30,"chapterId":5,"bookId":17,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا; أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { مَنْ مَاتَ وَعَلَيْهِ صِيَامٌ صَامَ عَنْهُ وَلِيُّهُ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 1952 )‏ ومسلم ( 1147 )‏.‏ \" تنبيه \": الصوم الذي في هذا الحديث هو صوم النذر فقط، كما كنت بينت ذلك في كتابي \" الإلمام بآداب وأحكام الصيام \" الطبعة الأولى ص ( 65 ‏- 66 )‏.‏","english":{"narrator":"'A’isha (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"\"Whoever dies while he still has some fasts to make up (of the days of Ramadan), then his heir (any of them) should fast on his behalf.” Agreed upon."}},{"id":31,"idInBook":31,"chapterId":5,"bookId":17,"arabic":"عَنْ أَبِي قَتَادَةَ اَلْأَنْصَارِيِّ ‏- رضى الله عنه ‏- { أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-سُئِلَ عَنْ صَوْمِ يَوْمِ عَرَفَةَ.‏ قَالَ: \" يُكَفِّرُ اَلسَّنَةَ اَلْمَاضِيَةَ وَالْبَاقِيَةَ \", وَسُئِلَ عَنْ صِيَامِ يَوْمِ عَاشُورَاءَ.‏ قَالَ: \" يُكَفِّرُ اَلسَّنَةَ اَلْمَاضِيَةَ \" وَسُئِلَ عَنْ صَوْمِ يَوْمِ اَلِاثْنَيْنِ, قَالَ: \" ذَاكَ يَوْمٌ وُلِدْتُ فِيهِ, وَبُعِثْتُ فِيهِ, أَوْ أُنْزِلَ عَلَيَّ فِيهِ \" }  رَوَاهُ مُسْلِمٌ  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم ( 1162 )‏ ( 197 )‏، وساقه الحافظ بتقديم وتأخير.‏","english":{"narrator":"","text":"Abu Qatadah Al-Ansari (RAA) narrated, ‘The Messenger of Allah (ﷺ) was asked about fasting on the day of Arafah (the 9th of the month of Dhul Hijjah). He replied, \"Fasting on the day of Arafah is an expiation for the preceding year and the following year.” He was also asked about fasting on the day of Ashura (the 10th of the month of Muharram). He replied, “Fasting on the day of Ashura is an expiation for the preceding year.” The Messenger of Allah (ﷺ) was also asked about fasting on Monday, and he replied, \"This is the day on which I was born and the day on which I was sent (with the Message of Islam) and the day on which I received revelation.\" Related by Muslim."}},{"id":32,"idInBook":32,"chapterId":5,"bookId":17,"arabic":"وَعَنْ أَبِي أَيُّوبَ اَلْأَنْصَارِيِّ ‏- رضى الله عنه ‏- أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { مَنْ صَامَ رَمَضَانَ, ثُمَّ أَتْبَعَهُ سِتًّا مِنْ شَوَّالٍ كَانَ كَصِيَامِ اَلدَّهْرِ }  رَوَاهُ مُسْلِمٌ  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم ( 1164 )‏.‏","english":{"narrator":"Abu Aiyub Al-Ansari (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"\"Whoever fasts during the month of Ramadan and then follows it with six days of Shawwal will be (rewarded) as if he had fasted the entire year.\" Related by Muslim."}},{"id":33,"idInBook":33,"chapterId":5,"bookId":17,"arabic":"وَعَنْ أَبِي سَعِيدٍ اَلْخُدْرِيِّ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَا مِنْ عَبْدٍ يَصُومُ يَوْمًا فِي سَبِيلِ اَللَّهِ إِلَّا بَاعَدَ اَللَّهُ بِذَلِكَ اَلْيَوْمِ عَنْ وَجْهِهِ  1‏ اَلنَّارَ سَبْعِينَ خَرِيفًا }  مُتَّفَقٌ عَلَيْهِ, وَاللَّفْظُ لِمُسْلِمٍ  2‏ .‏‏1 ‏- في مسلم وأيضا البخاري: \" وجهه عنه \".‏‏2 ‏- صحيح.‏ رواه البخاري ( 2840 )‏، ومسلم ( 1153 )‏.‏","english":{"narrator":"Abu Sa'id Al-Khudri (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"“No servant (of Allah) fasts on a day (merely) for the sake of Allah except that Allah pushes the Hellfire seventy years further away from his face, due to fasting on this day.” Agreed upon and the wording is from Muslim."}},{"id":34,"idInBook":34,"chapterId":5,"bookId":17,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: { كَانَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَصُومُ حَتَّى نَقُولَ لَا يُفْطِرُ, وَيُفْطِرُ حَتَّى نَقُولَ لَا يَصُومُ, وَمَا رَأَيْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-اِسْتَكْمَلَ صِيَامَ شَهْرٍ قَطُّ إِلَّا رَمَضَانَ, وَمَا رَأَيْتُهُ فِي شَهْرٍ أَكْثَرَ مِنْهُ صِيَامًا فِي شَعْبَانَ }  مُتَّفَقٌ عَلَيْهِ، وَاللَّفْظُ لِمُسْلِمٍ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 1969 )‏، ومسلم ( 1156 )‏ ( 175 )‏.‏","english":{"narrator":"","text":"'A’isha (RAA) narrated, ‘The Messenger of Allah (ﷺ) used to fast until one would say, he never breaks his fast (i.e. he never stops fasting), and he would abandon fasting (at other times) until one would say that he never fasts. And I never saw the Messenger of Allah (ﷺ) fast for a complete month except for the month of Ramadan, and I never saw him fast in a month more than he did in the month of Sha’ban.” Agreed upon and the wording is from Muslim."}},{"id":35,"idInBook":35,"chapterId":5,"bookId":17,"arabic":"وَعَنْ أَبِي ذَرٍّ ‏- رضى الله عنه ‏- قَالَ: { أَمَرَنَا رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-أَنْ نَصُومَ مِنْ اَلشَّهْرِ ثَلَاثَةَ أَيَّامٍ: ثَلَاثَ عَشْرَةَ, وَأَرْبَعَ عَشْرَةَ وَخَمْسَ عَشْرَةَ }  رَوَاهُ النَّسَائِيُّ, وَاَلتِّرْمِذِيُّ, وَصَحَّحَهُ اِبْنُ حِبَّانَ  1‏ .‏‏1 ‏- حسن.‏ رواه النسائي ( 4 / 222 )‏، والترمذي ( 761 )‏، وابن حبان ( 3647 و 3648 )‏، وقال الترمذي: \" هذا حديث حسن \".‏","english":{"narrator":"","text":"Abu Dharr (RAA) narrated that The Messenger of Allah (ﷺ) commanded us to fast for three days of every month; that is on the days of the full moon; the 13th , 14th , and 15th (of the lunar month).’ Related by An-Nasa’i and At-Tirmidhi and rendered authentic by Ibn Hibban."}},{"id":36,"idInBook":36,"chapterId":5,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { لَا يَحِلُّ لِلْمَرْأَةِ أَنْ تَصُومَ وَزَوْجُهَا شَاهِدٌ إِلَّا بِإِذْنِهِ }  مُتَّفَقٌ عَلَيْهِ, وَاللَّفْظُ لِلْبُخَارِيِّ  1‏ .‏\nوَزَادَ أَبُو دَاوُدَ: { غَيْرَ رَمَضَانَ }   2‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 5195 )‏، ومسلم ( 1026 )‏، وزاد البخاري: \" ولا تأذن في بيته إلا بإذنه، وما أنفقت من نفقة عن غير أمره، فإنه يؤدى إليه شطره \".‏ ومثله لمسلم إلا أنه قال: \" … من كسبه من غير أمره فإن نصف أجره له \".‏\n‏2 ‏- السنن ( 2458 )‏ وإسنادها صحيح.‏","english":{"narrator":"","text":"Abu Hurairah (RAA) narrated that The Messenger of Allah said, \"A woman is not to fast (even) for one day while her husband is present except with his permission\" Agreed upon and the wording is from Al-Bukhari. Abu Dawud’s version states, “unless it is during Ramadan (then she does not need his permission as it is obligatory fasting).’’"}},{"id":37,"idInBook":37,"chapterId":5,"bookId":17,"arabic":"وَعَنْ أَبِي سَعِيدٍ اَلْخُدْرِيِّ ‏- رضى الله عنه ‏- { أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-نَهَى عَنْ صِيَامِ يَوْمَيْنِ: يَوْمِ اَلْفِطْرِ وَيَوْمِ اَلنَّحْرِ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 1991 )‏، ومسلم ( 2 / 800 / 141 )‏ واللفظ لمسلم.‏","english":{"narrator":"","text":"Abu Sa'id Al-Khudri (RAA) narrated. ‘The Messenger of Allah (ﷺ) has prohibited fasting on two days; the day of Fitr (breaking the fast of Ramadan) and on the day of sacrifice ('Idul Adha).’ Agreed upon."}},{"id":38,"idInBook":38,"chapterId":5,"bookId":17,"arabic":"وَعَنْ نُبَيْشَةَ اَلْهُذَلِيِّ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ أَيَّامُ اَلتَّشْرِيقِ أَيَّامُ أَكْلٍ وَشُرْبٍ, وَذِكْرٍ لِلَّهِ عَزَّ وَجَلَّ }  رَوَاهُ مُسْلِمٌ  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم ( 1141 )‏، وليس فيه لفظ: \" عز وجل \".‏","english":{"narrator":"Nubaishah Al-Hudhali (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"“The days of Tashriq (the three days following 'Idul Ad-ha, i.e. 11th , 12th and 13th of Dhul Hijjah) are days of eating, drinking and remembering (dhikr) of Allah, the Most Great and Glorious.\" Related by Muslim."}},{"id":39,"idInBook":39,"chapterId":5,"bookId":17,"arabic":"وَعَنْ عَائِشَةَ وَابْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمْ قَالَا: { لَمْ يُرَخَّصْ فِي أَيَّامِ اَلتَّشْرِيقِ أَنْ يُصَمْنَ إِلَّا لِمَنْ لَمْ يَجِدِ اَلْهَدْيَ }  رَوَاهُ اَلْبُخَارِيُّ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 4 / 242 / فتح )‏.‏","english":{"narrator":"","text":"'A’isha and lbn 'Umar (RAA) narrated, ‘Nobody was allowed to fast on the days of Tashriq except for those, who could not afford the Hadi (sacrifice).' Related by Al-Bukhari."}},{"id":40,"idInBook":40,"chapterId":5,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- عَنِ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { لَا تَخْتَصُّوا لَيْلَةَ اَلْجُمُعَةِ بِقِيَامٍ مِنْ بَيْنِ اَللَّيَالِي, وَلَا تَخْتَصُّوا يَوْمَ اَلْجُمُعَةِ بِصِيَامٍ مِنْ بَيْنِ اَلْأَيَّامِ, إِلَّا أَنْ يَكُونَ فِي صَوْمٍ يَصُومُهُ أَحَدُكُمْ }  رَوَاهُ مُسْلِمٌ  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم ( 1144 )‏ ووقع هكذا بالأصل في الموضعين \" تختصوا \".‏ وفي \" أ \": \" تختصوا \" في الموضعين بدون التاء، والذي في \" مسلم \" بإثبات التاء في الأول، وحذفها في الثاني.‏","english":{"narrator":"Abu Hurairah (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"\"Do not single out Friday night (i.e. the night preceding Friday) among all the other nights for performing the night prayer. Also, do not single out Friday among other days for fasting, unless it coincides with the days one regularly fasts.\" Related by Muslim."}},{"id":41,"idInBook":41,"chapterId":5,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا يَصُومَنَّ أَحَدُكُمْ يَوْمَ اَلْجُمُعَةِ, إِلَّا أَنْ يَصُومَ يَوْمًا قَبْلَهُ, أَوْ يَوْمًا بَعْدَهُ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 1985 )‏، ومسلم ( 1144 )‏ ( 147 )‏، وتصرف الحافظ في بعض ألفاظه.‏","english":{"narrator":"Abu Hurairah, narrated that The Messenger of Allah (ﷺ) said:","text":"“None of you should fast on Friday, unless he fasts together with the day before or the day after.” Agreed upon."}},{"id":42,"idInBook":42,"chapterId":5,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { إِذَا اِنْتَصَفَ شَعْبَانَ فَلَا تَصُومُوا }  رَوَاهُ اَلْخَمْسَةُ, وَاسْتَنْكَرَهُ أَحْمَدُ  1‏ .‏‏1 ‏- حسن.‏ رواه أبو داود ( 2337 )‏، والنسائي في \" الكبرى \" ( 2 / 172 )‏، والترمذي ( 738 )‏، وابن ماجه ( 1651 )‏، وأحمد ( 2 / 442 )‏، واللفظ لأبي داود.‏ وقال الترمذي: حسن صحيح \".‏","english":{"narrator":"Abu Hurairah (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"\"When it is the middle of Sha'ban do not fast (until it is Ramadan).” Related by the five Imams, but Imam Ahmad declared it to be a weak narration."}},{"id":43,"idInBook":43,"chapterId":5,"bookId":17,"arabic":"وَعَنِ اَلصَّمَّاءِ بِنْتِ بُسْرٍ رَضِيَ اَللَّهُ عَنْهَا أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { لَا تَصُومُوا يَوْمَ اَلسَّبْتِ, إِلَّا فِيمَا اِفْتُرِضَ عَلَيْكُمْ, فَإِنْ لَمْ يَجِدْ أَحَدُكُمْ إِلَّا لِحَاءَ عِنَبٍ, أَوْ عُودَ شَجَرَةٍ فَلْيَمْضُغْهَا }  رَوَاهُ اَلْخَمْسَةُ, وَرِجَالُهُ ثِقَاتٌ, إِلَّا أَنَّهُ مُضْطَرِبٌ  1‏ .‏ \nوَقَدْ أَنْكَرَهُ مَالِكٌ  2‏ .‏ \nوَقَالَ أَبُو دَاوُدَ: هُوَ مَنْسُوخٌ  3‏ .‏‏1 ‏- صحيح.‏ رواه أبو داود ( 2421 )‏، والنسائي في \" الكبرى \" ( 2 / 143 )‏، والترمذي ( 744 )‏، وابن ماجه ( 1726 )‏، وأحمد ( 6 / 368 )‏.‏ وقال الترمذي: \" حديث حسن \".‏ قلت: وأما إعلاله بالاضطراب فلا يسلم به؛ لأنه: \" الاضطراب عند أهل العلم على نوعين.‏ أحدهما: الذي يأتي على وجوه مختلفة متساوية القوة، لا يمكن بسبب التساوي ترجيح وجه على وجه.‏ والآخر: وهو ما كانت وجوه الاضطراب فيه متباينة بحيث يمكن الترجيح بينها، فالنوع الأول هو الذي يعل به الحديث.‏ وأما الآخر فينظر للراجح من تلك الوجوه، ثم يحكم عليه بما يستحقه من نقد، وحديثنا من هذا النوع \".‏ قاله شيخي ‏-حفظه الله‏- في \" الإرواء \" ( 4 / 119 )‏ وهو كلام إمام راسخ القدم.‏ وانظر تمام البحث هناك.‏\n‏2 ‏- قال أبو داود في \" السنن \" ( 2 / 321 )‏: قال مالك: \" هذا كذب \".‏\n‏3 ‏- قوله في \" السنن \" عقب الحديث.‏ وقال الحافظ في \" التلخيص \" ( 2 / 216 ‏- 217 )‏: \" وادعى أبو داود أن هذا منسوخ، ولا يتبين وجه النسخ فيه، ويمكن أن يكون أخذه من كونه صلى الله عليه وسلم كان يحب موافقة أهل الكتاب في أول الأمر، ثم في آخر أمره قال: \" خالفوهم \" فالنهي عن صوم يوم السبت يوافق الحالة الأولى، وصيامه إياه يوافق الحالة الثانية، وهذه صورة النسخ.‏ والله أعلم \".‏","english":{"narrator":"As-Samma’ bint Busr (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"\"Do not fast on Saturday unless it is an obligatory fast. (Do not fast) even if you do not find anything (to eat) except for some grape peelings or the branch of a tree, in that case he should chew on it.\" Related by the five Imams and its narrators are reliable. Imam Malik disapproved this narration, and Abu Dawud said that this narration is abrogated."}},{"id":44,"idInBook":44,"chapterId":5,"bookId":17,"arabic":"وَعَنْ أُمِّ سَلَمَةَ رَضِيَ اَللَّهُ عَنْهَا; { أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-كَانَ أَكْثَرَ مَا يَصُومُ مِنَ اَلْأَيَّامِ يَوْمُ اَلسَّبْتِ, وَيَوْمُ اَلْأَحَدِ, وَكَانَ يَقُولُ: \n\" إِنَّهُمَا يَوْمَا عِيدٍ لِلْمُشْرِكِينَ, وَأَنَا أُرِيدُ أَنْ أُخَالِفَهُمْ \" }  أَخْرَجَهُ النَّسَائِيُّ, وَصَحَّحَهُ اِبْنُ خُزَيْمَةَ, وَهَذَا لَفْظُهُ  1‏ .‏‏1 ‏- ضعيف.‏ رواه النسائي في \" الكبرى \" ( 2 / 146 )‏، وابن خزيمة ( 2167 )‏ وفي سنده مجهولان.‏","english":{"narrator":"","text":"Umm Salamah (RAA) narrated, The Messenger of Allah (ﷺ) used to fast more often on Saturdays and Sundays than on the other days. He would say, \"They are the 'ids of the polytheists, and I love to act contrary to what they do.\" Related by An-Nasal and was rendered authentic by Ibn Khuzaimah, and the wording is his."}},{"id":45,"idInBook":45,"chapterId":5,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-{ نَهَى عَنْ صَوْمِ يَوْمِ عَرَفَةَ بِعَرَفَةَ }  رَوَاهُ اَلْخَمْسَةُ غَيْرَ اَلتِّرْمِذِيِّ, وَصَحَّحَهُ اِبْنُ خُزَيْمَةَ, وَالْحَاكِمُ, وَاسْتَنْكَرَهُ الْعُقَيْلِيُّ  1‏ .‏‏1 ‏- ضعيف.‏ رواه أبو داود ( 2440 )‏، والنسائي ( 3 / 252 )‏، وابن ماجه ( 1732 )‏، وأحمد ( 2 / 304 و 446 )‏، وابن خزيمة ( 2101 )‏، والحاكم ( 1 / 434 )‏.‏ وقال العقيلي في \" الضعفاء الكبير \" ( 1 / 298 )‏ في ترجمة حوشب بن عقيل أحد رواه الحديث: \" لا يتابع عليه، وقد روي عن النبي صلى الله عليه وسلم بأسانيد جياد أنه لم يصم يوم عرفة، ولا يصح عنه أنه نهى عن صومه \".‏","english":{"narrator":"","text":"Abu Hurairah (RAA) narrated that The Messenger of Allah (ﷺ) forbade fasting on the day of Arafah for the one who is actually at Arafah (i.e. performing Hajj). Related by the five Imams except for At-Tirmidhi. Ibn Khuzaimah and al-Hakim graded it as Sahih."}},{"id":46,"idInBook":46,"chapterId":5,"bookId":17,"arabic":"وَعَنْ عَبْدِ اَللَّهِ بْنِ عَمْرِوٍ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا صَامَ مَنْ صَامَ اَلْأَبَدَ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 1977 )‏، ومسلم ( 1159 )‏ ( 186 و 187 )‏.‏","english":{"narrator":"’Abdullah Ibn 'Umar (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"“May he, who perpetually fasts (without a break) never fast.\" Agreed upon."}},{"id":47,"idInBook":47,"chapterId":5,"bookId":17,"arabic":"وَلِمُسْلِمٍ عَنْ أَبِي قَتَادَةَ بِلَفْظِ: { لَا صَامَ وَلَا أَفْطَرَ }   1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم ( 1162 )‏ وهو إحدى روايات الحديث السابق.‏","english":{"narrator":"","text":"Muslim narrated on the authority of Abu Qatadah, “May he not fast or break his fast.\""}},{"id":48,"idInBook":48,"chapterId":5,"bookId":17,"arabic":"عَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { مَنْ قَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا, غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 2009 )‏، ومسلم ( 759 )‏.‏","english":{"narrator":"Abu Hurairah narrated that The Messenger of Allah (ﷺ) said:","text":"“Whoever prays during the night in Ramadan out of sincere faith and seeking its reward from Allah, will have all of his previous sins forgiven.\" Agreed upon."}},{"id":49,"idInBook":49,"chapterId":5,"bookId":17,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: { كَانَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-إِذَا دَخَلَ اَلْعَشْرُ ‏-أَيْ: اَلْعَشْرُ اَلْأَخِيرُ مِنْ رَمَضَانَ‏- شَدَّ مِئْزَرَهُ, وَأَحْيَا لَيْلَهُ, وَأَيْقَظَ أَهْلَهُ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 2024 )‏، ومسلم ( 1174 )‏، وزاد مسلم: \" وجد \".‏ قلت: أي: في العبادة.‏ وقوله: \" أي: العشر الأخيرة من رمضان \".‏ فهي من قول الحافظ رحمه الله.‏","english":{"narrator":"","text":"'A’isha (RAA) narrated, ‘With the start of the last ten days of Ramadan, the Messenger of Allah (ﷺ) used to tighten his waist belt (i.e. keep away from his wives) and used to stay up praying all night, and he would also wake his wives (to pray and recite Qur’an etc..).” Agreed upon."}},{"id":50,"idInBook":50,"chapterId":5,"bookId":17,"arabic":"وَعَنْهَا: { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-كَانَ يَعْتَكِفُ اَلْعَشْرَ اَلْأَوَاخِرَ مِنْ رَمَضَانَ, حَتَّى تَوَفَّاهُ اَللَّهُ, ثُمَّ اعْتَكَفَ أَزْوَاجُهُ مِنْ بَعْدِهِ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 2025 )‏، ومسلم ( 1172 )‏ ( 5 )‏.‏","english":{"narrator":"","text":"'A’isha (RAA) narrated, ’The Messenger of Allah (ﷺ) used to perform I'tikaf during the last ten days of Ramadan until he died. Then his wives used to perform I'tikaf after his death.’ Agreed upon."}},{"id":51,"idInBook":51,"chapterId":5,"bookId":17,"arabic":"وَعَنْهَا قَالَتْ: { كَانَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-إِذَا أَرَادَ أَنْ يَعْتَكِفَ صَلَّى اَلْفَجْرَ, ثُمَّ دَخَلَ مُعْتَكَفَهُ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 2033 )‏، ومسلم ( 1173 )‏ واللفظ لمسلم، وأما لفظ البخاري فهو: \" كان النبي صلى الله عليه وسلم يعتكف في العشر الأواخر من رمضان، فكنت أضرب له خباء، فيصلي الصبح، ثم يدخله \".‏","english":{"narrator":"","text":"’A’isha (RAA) narrated, \"Whenever the Messenger of Allah (ﷺ) intended to make I'tikaf he would pray the morning prayer and then he would enter the place of his I’tikaf (i.e. the place, which he had prepared for his I'tikaf inside the mosque).\" Agreed upon."}},{"id":52,"idInBook":52,"chapterId":5,"bookId":17,"arabic":"وَعَنْهَا قَالَتْ: { إِنْ كَانَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-لَيُدْخِلُ عَلَيَّ رَأْسَهُ ‏-وَهُوَ فِي اَلْمَسْجِدِ‏- فَأُرَجِّلُهُ, وَكَانَ لَا يَدْخُلُ اَلْبَيْتَ إِلَّا لِحَاجَةٍ, إِذَا كَانَ مُعْتَكِفًا }  مُتَّفَقٌ عَلَيْهِ, وَاللَّفْظُ لِلْبُخَارِيِّ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 2029 )‏، ومسلم ( 297 )‏ ( 7 )‏ مع مراعاة أن قول الحافظ: \" واللفظ للبخاري \" لا قيمة له، وإن كان لا بد منه فصوابه أن يقول: \" واللفظ لمسلم \" إذ اللفظ المذكور هو لفظ مسلم حرفا حرفا.‏ وهو لفظ البخاري أيضا عدا قولها: \" علي \" ولا أظن أن مثل هذا الخلاف مدعاة للتفريق بين اللفظين!.‏","english":{"narrator":"","text":"’A’isha (RAA) narrated, The Messenger of Allah (ﷺ) used to put his head into (the window of my house) while he was in the mosque (performing I'tikaf) and I would comb his hair. When he was in I'tikaf he would not enter the house except for some need.”Agreed upon and the wording is from Al-Bukhari."}},{"id":53,"idInBook":53,"chapterId":5,"bookId":17,"arabic":"وَعَنْهَا قَالَتْ: { اَلسُّنَّةُ عَلَى اَلْمُعْتَكِفِ أَنْ لَا يَعُودَ مَرِيضًا, وَلَا يَشْهَدَ جِنَازَةً, وَلَا يَمَسَّ امْرَأَةً, وَلَا يُبَاشِرَهَا, وَلَا يَخْرُجَ لِحَاجَةٍ, إِلَّا لِمَا لَا بُدَّ لَهُ مِنْهُ, وَلَا اعْتِكَافَ إِلَّا بِصَوْمٍ وَلَا اعْتِكَافَ إِلَّا فِي مَسْجِدٍ جَامِعٍ }  رَوَاهُ أَبُو دَاوُدَ, وَلَا بَأْسَ بِرِجَالِهِ, إِلَّا أَنَّ اَلرَّاجِحَ وَقْفُ آخِرِهِ  1‏ .‏‏1 ‏- حسن.‏ رواه أبو داود ( 2473 )‏ وأعل بما لا يقدح كما تجده في \" الأصل \".‏","english":{"narrator":"’A’isha (RAA) narrated, ‘It is Sunnah for the one performing I'tikaf not to visit the sick, attend a funeral, or touch his wife (with sexual desire), nor have sexual intercourse with her. He should also not go out (of the mosque) except for an extreme necessity, and no I’tikaf is accepted without fasting, or without being in a congregational mosque (where Friday prayer is performed).’ Related by Abu Dawud with an acceptable chain of narrators, but scholars say that the last part (starting:","text":"‘no I'tikaf is accepted….) is most probably the saying of ’A’isha (RAA), i.e. Hadith Mauquf (i.e. that which the companion does not connect to the Prophet and it is not the Prophet (ﷺ) himself."}},{"id":54,"idInBook":54,"chapterId":5,"bookId":17,"arabic":"وَعَنْ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا; أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَالَ: { لَيْسَ عَلَى اَلْمُعْتَكِفِ صِيَامٌ إِلَّا أَنْ يَجْعَلَهُ عَلَى نَفْسِهِ }  رَوَاهُ اَلدَّارَقُطْنِيُّ وَالْحَاكِمُ, وَالرَّاجِحُ وَقْفُهُ أَيْضًا  1‏ .‏‏1 ‏- ضعيف.‏ رواه الدارقطني ( 2 / 199 / 3 )‏، والحاكم ( 1 / 439 )‏.‏","english":{"narrator":"Ibn ’Abbas (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"The one who is performing I'tikaf does not have to fast unless he obliges himself to do so.” Related by Ad-Daraqutni and al-Hakim, and most probably it is also the saying of Ibn 'Abbas, i.e. Mawquf and not of the sayings of the Prophet (ﷺ)."}},{"id":55,"idInBook":55,"chapterId":5,"bookId":17,"arabic":"وَعَنْ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا: { أَنَّ رِجَالاً مِنْ أَصْحَابِ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-أُرُوا لَيْلَةَ اَلْقَدْرِ فِي اَلْمَنَامِ, فِي اَلسَّبْعِ اَلْأَوَاخِرِ, فَقَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-\"أَرَى  1‏ رُؤْيَاكُمْ قَدْ تَوَاطَأَتْ فِي اَلسَّبْعِ اَلْأَوَاخِرِ, فَمَنْ كَانَ مُتَحَرِّيَهَا فَلْيَتَحَرَّهَا فِي اَلسَّبْعِ اَلْأَوَاخِرِ }  مُتَّفَقٌ عَلَيْهِ  2‏ .‏‏1 ‏- ضبطها بعضهم بضم الهمزة، والمعنى: أظن.‏ وضبطها آخرون بالفتح، والمعنى: أعلم.‏‏2 ‏- صحيح.‏ رواه البخاري ( 2015 )‏، ومسلم ( 1165 )‏.‏","english":{"narrator":"","text":"Ibn ’Umar (RAA) narrated, ‘Some of the companions of the Prophet were shown in their dreams that the night of Qadr was in the last seven nights of Ramadan. The Messenger of Allah (ﷺ) said to them, “It seems that all of your dreams agree that (the Night of Qadr) is in the last seven nights, and whoever wants to seek that night should do so in the last seven nights (of Ramadan).\" Agreed upon."}},{"id":56,"idInBook":56,"chapterId":5,"bookId":17,"arabic":"وَعَنْ مُعَاوِيَةَ بْنَ أَبِي سُفْيَانَ رَضِيَ اَللَّهُ عَنْهُمَا, عَنْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ فِي لَيْلَةِ الْقَدْرِ: { لَيْلَةُ سَبْعٍ وَعِشْرِينَ }  رَوَاهُ أَبُو دَاوُدَ, وَالرَّاجِحُ وَقْفُهُ  1‏ .‏ \nوَقَدْ اِخْتُلِفَ فِي تَعْيِينِهَا عَلَى أَرْبَعِينَ قَوْلًا أَوْرَدْتُهَا فِي \n\" فَتْحِ اَلْبَارِي \"  2‏ .‏‏1 ‏- صحيح.‏ رواه أبو داود ( 1386 )‏ مرفوعا، وله ما يشهد له كما هو مذكور \" بالأصل \".‏\n‏2 ‏- انظر \" فتح الباري \" ( 4 / 263 ‏- 266 )‏ فقد ذكر ستا وأربعين قولا.‏ ثم قال: \" وأرجحها كلها أنها في وتر من العشر الأخير، وأنها تنتقل، وأرجاها عند الجمهور ليلة سبع وعشرين \".‏","english":{"narrator":"","text":"Mu'awiyah bin Abi Sufian (RAA) narrated, ’The Messenger of Allah (ﷺ) said regarding the night of al-Qadr, \"It is the 27th night (of Ramadan).’’ Related by Abu Dawud. But it is most probably the saying of Mu’awiyah and not the Prophet (ﷺ)."}},{"id":57,"idInBook":57,"chapterId":5,"bookId":17,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: { قُلْتُ يَا رَسُولَ اَللَّهِ : أَرَأَيْتَ إِنْ عَلِمْتُ أَيَّ لَيْلَةٍ لَيْلَةُ اَلْقَدْرِ, مَا أَقُولُ فِيهَا? قَالَ: \n\" قُولِي: اَللَّهُمَّ إِنَّكَ عَفُوٌّ تُحِبُّ اَلْعَفْوَ فَاعْفُ عَنِّي \" }  رَوَاهُ اَلْخَمْسَةُ, غَيْرَ أَبِي دَاوُدَ, وَصَحَّحَهُ اَلتِّرْمِذِيُّ, وَالْحَاكِمُ  1‏ .‏‏1 ‏- صحيح.‏ رواه النسائي في \" عمل اليوم والليلة \" ( 872 )‏، والترمذي ( 3513 )‏، وابن ماجه ( 3850 )‏، وأحمد ( 6 / 171 )‏، والحاكم ( 1 / 530 )‏.‏ وقال الترمذي: حسن صحيح.‏","english":{"narrator":"'A’isha (RAA) narrated, ‘I asked the Messenger of Allah (ﷺ) ‘O Messenger of Allah (ﷺ), if I know what night the night of Qadr is, what should I say during it?’ He said, “Say:","text":"O Allah, You are the Pardoner and You love to pardon, so pardon me.\" Related by the five Imams except for Abu Dawud. At-Tirmidhi and Al-Hakim reported it as Sahih."}},{"id":58,"idInBook":58,"chapterId":5,"bookId":17,"arabic":"وَعَنْ أَبِي سَعِيدٍ اَلْخُدْرِيِّ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-: { لَا تُشَدُّ اَلرِّحَالُ إِلَّا إِلَى ثَلَاثَةِ مَسَاجِدَ: اَلْمَسْجِدِ اَلْحَرَامِ, وَمَسْجِدِي هَذَا, وَالْمَسْجِدِ اَلْأَقْصَى }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 1197 )‏، ومسلم ( 2 / 975 ‏- 976 / 415 )‏.‏","english":{"narrator":"Abu Sa 'id AI-Khudri (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"“One should not undertake journeys except to three mosques: al-Masque al-Haram (in Makkah ), the Aqsa mosque, or this mosque (in Madinah).\" Agreed upon."}}],"chapter":{"id":5,"bookId":17,"arabic":"كتاب الصيام","english":"Fasting"}}