{"metadata":{"length":74,"arabic":{"title":"بلوغ المرام","author":"الإمام ابن حجر العسقلاني","introduction":"كتاب الحج"},"english":{"title":"Bulugh al-Maram","author":"Ibn Hajar al-Asqalani","introduction":"Hajj"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":6,"bookId":17,"arabic":"عَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { اَلْعُمْرَةُ إِلَى اَلْعُمْرَةِ كَفَّارَةٌ لِمَا بَيْنَهُمَا, وَالْحَجُّ اَلْمَبْرُورُ لَيْسَ لَهُ جَزَاءٌ إِلَّا اَلْجَنَّةَ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 1773 )‏، ومسلم ( 1349 )‏، وأصح ما قيل في معنى \" المبرور \" هو: الذي لا يخالطه إثم.‏ قلت: وفي الحديث دلالة على استحباب تكرار العمرة خلافا لمن قال بكراهية ذلك.‏ والله أعلم.‏","english":{"narrator":"","text":"Abu Hurairah (RAA) narrated that the Messenger of Allah said, “The performance of 'Umrah is an expiation for all the sins committed (between this 'Umrah and the previous one), and the reward for Hajj Mabrur (the one accepted by Allah or the one which was performed without doing any wrong) is nothing save Paradise.” Agreed upon."}},{"id":2,"idInBook":2,"chapterId":6,"bookId":17,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: { قُلْتُ: يَا رَسُولَ اَللَّهِ! عَلَى اَلنِّسَاءِ جِهَادٌ ? قَالَ: \n\" نَعَمْ, عَلَيْهِنَّ جِهَادٌ لَا قِتَالَ فِيهِ: اَلْحَجُّ, وَالْعُمْرَةُ \" }  رَوَاهُ أَحْمَدُ, وَابْنُ مَاجَهْ وَاللَّفْظُ لَهُ, وَإِسْنَادُهُ صَحِيحٌ  1‏ وَأَصْلُهُ فِي اَلصَّحِيحِ 2‏ .‏‏1 ‏- صحيح.‏ رواه أحمد ( 6 / 165 )‏، وابن ماجه ( 2901 )‏، وقول الحافظ أن اللفظ لابن ماجه لا فائدة فيه إذ هو عند أحمد بنفس اللفظ، نعم.‏ هو عند أحمد في مواطن آخر بألفاظ أخر.‏\n‏2 ‏- البخاري رقم ( 1520 )‏، عن عائشة أم المؤمنين رضي الله عنها؛ أنها قالت: يا رسول الله! نرى الجهاد أفضل العمل، أفلا نجاهد؟ قال: \" لا.‏ ولكن أفضل الجهاد حج مبرور \".‏ وفي رواية أخرى ( 1761 )‏: \" لكن أحسن الجهاد وأجمله: الحج، حج مبرور \".‏ وله ألفاظ أخر عنده وعند أحمد وغيرهما، وقد فصلت ذلك في \" الأصل \".‏","english":{"narrator":"A’ishah (RAA) narrated, ‘I once asked the Messenger of Allah (ﷺ) ‘O Messenger of Allah! Is Jihad incumbent upon women? He replied, “Yes. They have to take part in Jihad in which no fighting takes place, which is:","text":"Hajj and 'Umrah.\" Related by Ahmad and Ibn Majah and the wording is his. It is reported with a sound chain of narrators."}},{"id":3,"idInBook":3,"chapterId":6,"bookId":17,"arabic":"وَعَنْ جَابِرِ بْنِ عَبْدِ اَللَّهِ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { أَتَى اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-أَعْرَابِيٌّ.‏ فَقَالَ: يَا رَسُولَ اَللَّهِ! أَخْبِرْنِي عَنْ اَلْعُمْرَةِ, أَوَاجِبَةٌ هِيَ? فَقَالَ: \n\" لَا.‏ وَأَنْ تَعْتَمِرَ خَيْرٌ لَكَ \" }  رَوَاهُ أَحْمَدُ, وَاَلتِّرْمِذِيُّ, وَالرَّاجِحُ وَقْفُهُ  1‏ .‏‏1 ‏- ضعيف مرفوعا وموقوفا.‏ رواه أحمد ( 3 / 316 )‏، والترمذي ( 931 )‏.‏","english":{"narrator":"","text":"Jabir bin 'Abdullah (RAA) narrated, A Bedouin came to the Prophet (ﷺ) and said, ‘O Messenger of Allah! Tell me about 'Umrah! Is it compulsory? He replied (ﷺ), “No (it is not compulsory), but it is better for you to perform it.” Related by Ahmad and at-Tirmidhi. Scholars are of the opinion that it is Mawquf."}},{"id":4,"idInBook":4,"chapterId":6,"bookId":17,"arabic":"وَأَخْرَجَهُ اِبْنُ عَدِيٍّ مِنْ وَجْهٍ آخَرَ ضَعِيفٍ  1‏ عَنْ جَابِرٍ مَرْفُوعًا: { اَلْحَجُّ وَالْعُمْرَةُ فَرِيضَتَانِ }   2‏.‏‏1 ‏- ضعيف جدا.‏ رواه ابن عدي ( 7 / 2507 )‏ وفي سنده متروك.‏\n‏2 ‏- ضعيف.‏ رواه ابن عدي في \" الكامل \" ( 4 / 1468 )‏ وضعفه.‏","english":{"narrator":"","text":"Ibn 'Adi narrated with a weak chain of narrators on the authority of Jabir (RAA) in a Hadith Marfu’ (connected to the Prophet (ﷺ), “Hajj and 'Umrah are compulsory.\""}},{"id":5,"idInBook":5,"chapterId":6,"bookId":17,"arabic":"وَعَنْ أَنَسٍ ‏- رضى الله عنه ‏- قَالَ: { قِيلَ يَا رَسُولَ اَللَّهِ, مَا اَلسَّبِيلُ? قَالَ: \n\" اَلزَّادُ وَالرَّاحِلَةُ \" }  رَوَاهُ اَلدَّارَقُطْنِيُّ وَصَحَّحَهُ اَلْحَاكِمُ, وَالرَّاجِحُ إِرْسَالُهُ  1‏ .‏‏1 ‏- ضعيف.‏ رواه الدارقطني ( 2 / 216 )‏، والحاكم ( 1 / 442 )‏ من طريق قتادة، عن أنس مرفوعا، وهذا وهم، إذا الصواب كما قال ابن عبد الهادي في \" التنقيح \" نقلا عن \" الإرواء \" ( 4 / 161 )‏: \" الصواب عن قتادة، عن الحسن، عن النبي صلى الله عليه وسلم مرسلا، وأما رفعه عن أنس فهو وهم \".‏","english":{"narrator":"","text":"Anas (RAA) narrated that the Messenger of Allah (ﷺ) was asked, ‘What is as-Sabil?’ The Messenger of Allah (ﷺ) replied, \"Provision of food and means to make the journey.\" Related by Ad-Daraqutni and rendered authentic by Al-Hakim."}},{"id":6,"idInBook":6,"chapterId":6,"bookId":17,"arabic":"وَأَخْرَجَهُ اَلتِّرْمِذِيُّ مِنْ حَدِيثِ اِبْنِ عُمَرَ أَيْضًا, وَفِي إِسْنَادِهِ ضَعْفٌ  1‏ .‏‏1 ‏- ضعيف جدا.‏ رواه الترمذي ( 813 )‏ في سنده متروك، وقد روي الحديث عن جماعة آخرين من الصحابة رضي الله عنهم، وكلها واهية لا تصلح للاعتبار، وبيان ذلك في \" الأصل \".‏","english":{"narrator":"","text":"At-Tirmidhi reported the same hadith on the authority of Ibn ’Umar but with a weak chain of narrators."}},{"id":7,"idInBook":7,"chapterId":6,"bookId":17,"arabic":"وَعَنْ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا; { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-لَقِيَ رَكْبًا بِالرَّوْحَاءِ فَقَالَ: \" مَنِ اَلْقَوْمُ? \" قَالُوا: اَلْمُسْلِمُونَ.‏ فَقَالُوا: مَنْ أَنْتَ? قَالَ: \" رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-\" فَرَفَعَتْ إِلَيْهِ اِمْرَأَةٌ صَبِيًّا.‏ فَقَالَتْ: أَلِهَذَا حَجٌّ? قَالَ: \" نَعَمْ: وَلَكِ أَجْرٌ \" }  رَوَاهُ مُسْلِمٌ  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم ( 1336 )‏، والروحاء: مكان على ستة وثلاثين ميلا من المدينة.‏","english":{"narrator":"","text":"Ibn ’Abbas (RAA) narrated, The Messenger of Allah (ﷺ) came across some riders at ar-Rauha’ (a place near Madinah). He asked them, “Who are you?\" They replied, ‘Who are you?’ He replied, \"I am the Messenger of Allah.\" A woman then lifted up a boy, and asked the Prophet, Will this boy be rewarded for Hajj? The Messenger of Allah (ﷺ) replied, “Yes, and you too will be Rewarded.” Related by Muslim."}},{"id":8,"idInBook":8,"chapterId":6,"bookId":17,"arabic":"وَعَنْهُ قَالَ: { كَانَ اَلْفَضْلُ بْنُ عَبَّاسٍ رَدِيفَ رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-.‏ فَجَاءَتِ اِمْرَأَةٌ مَنْ خَثْعَمَ، فَجَعَلَ اَلْفَضْلُ يَنْظُرُ إِلَيْهَا وَتَنْظُرُ إِلَيْهِ، وَجَعَلَ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-يَصْرِفُ وَجْهَ اَلْفَضْلِ إِلَى اَلشِّقِّ اَلْآخَرِ.‏ فَقَالَتْ: يَا رَسُولَ اَللَّهِ, إِنَّ فَرِيضَةَ اَللَّهِ عَلَى عِبَادِهِ فِي اَلْحَجِّ أَدْرَكَتْ أَبِي شَيْخًا كَبِيرًا, لَا يَثْبُتُ عَلَى اَلرَّاحِلَةِ, أَفَأَحُجُّ عَنْهُ? قَالَ: \n\" نَعَمْ \" وَذَلِكَ فِي حَجَّةِ اَلْوَدَاعِ }  مُتَّفَقٌ عَلَيْهِ, وَاللَفْظُ لِلْبُخَارِيِّ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 1513 )‏، ومسلم ( 1334 )‏.‏","english":{"narrator":"","text":"lbn ’Abbas (RAA) narrated that ‘Al-Fadl Ibn ’Abbas was riding behind the Messenger of Allah (ﷺ) when a woman from the tribe of Khath‘am came along, and al-Fadl started looking at her and she also started looking at him. The Messenger of Allah (ﷺ) kept on turning al-Fadl’s face to the other side. She said, ‘O Messenger of Allah! Allah has prescribed Hajj for His servants, and it has become due on my father who is an old man, who cannot sit stable on his mount. Shall I perform Hajj on his behalf?’ The Prophet (ﷺ) replied, “Yes, you may.\" This incident took place during the Farewell Pilgrimage of the Prophet (ﷺ). Agreed upon, and the wording is from Al·Bukhari’."}},{"id":9,"idInBook":9,"chapterId":6,"bookId":17,"arabic":"وَعَنْهُ: { أَنَّ اِمْرَأَةً مِنْ جُهَيْنَةَ جَاءَتْ إِلَى اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-فَقَالَتْ: إِنَّ أُمِّي نَذَرَتْ أَنْ تَحُجَّ, فَلَمْ تَحُجَّ حَتَّى مَاتَتْ, أَفَأَحُجُّ عَنْهَا? قَالَ: \n\" نَعَمْ \", حُجِّي عَنْهَا, أَرَأَيْتِ لَوْ  1‏ كَانَ عَلَى أُمِّكِ دَيْنٌ, أَكُنْتِ قَاضِيَتَهُ? اِقْضُوا اَللَّهَ, فَاَللَّهُ أَحَقُّ بِالْوَفَاءِ }  رَوَاهُ اَلْبُخَارِيُّ  2‏ .‏‏1 ‏- كذا هو في الأصل، وفي \" الصحيح \" والمطبوع، والشرح.‏ وتحرف في \" أ \" إلى: \" إن \".‏‏2 ‏- صحيح.‏ رواه البخاري ( 1852 )‏.‏","english":{"narrator":"Ibn ’Abbas (RAA) narrated, ‘A woman from the tribe of Juhainah came to the Prophet (ﷺ) and said, ‘My mother had vowed to perform Hajj, but she died before fulfilling her vow. Should I perform Hajj on her behalf? The Prophet (ﷺ) said:","text":"\"Yes perform Hajj on her behalf. Had there been a debt on your mother, would you have paid it or not? So, pay off her debt to Allah, for He is most deserving of settlement of His debt.\" Related by Al-Bukhari."}},{"id":10,"idInBook":10,"chapterId":6,"bookId":17,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ أَيُّمَا صَبِيٍّ حَجَّ, ثُمَّ بَلَغَ اَلْحِنْثَ, فَعَلَيْهِ  حَجَّةً أُخْرَى }  رَوَاهُ اِبْنُ أَبِي شَيْبَةَ, وَالْبَيْهَقِيُّ وَرِجَالُهُ ثِقَاتٌ, إِلَّا أَنَّهُ اِخْتُلِفَ فِي رَفْعِهِ, وَالْمَحْفُوظُ أَنَّهُ مَوْقُوفٌ  1‏ .‏‏1 ‏- صحيح مرفوعا ‏-كما ذهب إلى ذلك الحافظ نفسه في \" التلخيص \" ( 2 / 220 )‏ ‏- وموقوفا.‏ رواه البيهقي ( 4 / 325 )‏ وزاد: \" وأيما أعرابي حج ثم هاجر فعليه حجة أخرى \".‏ ولم أجد الحديث في \" المطبوع \" من المصنف.‏","english":{"narrator":"lbn 'Abbas (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“Any minor (child) who performs Hajj must perform it again after coming of age; any slave who performs Hajj and is then freed, must perform his Hajj again.\" Reported by lbn Shaibah and Al-Baihaqi. lts narrators are authoritative but scholars say that it is Mawquf."}},{"id":11,"idInBook":11,"chapterId":6,"bookId":17,"arabic":"وَعَنْهُ: سَمِعْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَخْطُبُ يَقُولُ: { \" لَا يَخْلُوَنَّ رَجُلٌ بِاِمْرَأَةٍ إِلَّا وَمَعَهَا ذُو مَحْرَمٍ, وَلَا تُسَافِرُ اَلْمَرْأَةُ إِلَّا مَعَ ذِي مَحْرَمٍ \" فَقَامَ رَجُلٌ, فَقَالَ: يَا رَسُولَ اَللَّهِ, إِنَّ اِمْرَأَتِي خَرَجَتْ حَاجَّةً, وَإِنِّي اِكْتُتِبْتُ فِي غَزْوَةِ كَذَا وَكَذَا, قَالَ: \" اِنْطَلِقْ, فَحُجَّ مَعَ اِمْرَأَتِكَ \" }  مُتَّفَقٌ عَلَيْهِ, وَاللَّفْظُ لِمُسْلِمٍ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 1862 )‏، ومسلم ( 1341 )‏، وانظر الدليل الأول من رسالتي: \" أوضح البيان في حكم سفر النسوان \".‏","english":{"narrator":"","text":"Ibn 'Abbas (RAA) narrated, ‘I heard the Messenger of Allah (ﷺ) saying, “A man must never be alone with a woman unless there is a Mahram with her. A woman also may not travel with anyone except with a Mahram (relative).” A man stood up and asked, ‘O Messenger of Allah! My wife has gone for Hajj while I am enlisted for such and such a battle, what should I do?’ The Messenger of Allah (ﷺ) replied, “Go and join your wife in Hajj.\" Agreed upon, and the wording is from Muslim."}},{"id":12,"idInBook":12,"chapterId":6,"bookId":17,"arabic":"وَعَنْهُ: { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-سَمِعَ رَجُلًا يَقُولُ: لَبَّيْكَ عَنْ شُبْرُمَةَ, قَالَ: \" مَنْ شُبْرُمَةُ? \" قَالَ: أَخٌ , أَوْ قَرِيبٌ لِي, قَالَ: \" حَجَجْتَ عَنْ نَفْسِكَ? \" قَالَ: لَا.‏ قَالَ: \"حُجَّ عَنْ نَفْسِكَ, ثُمَّ حُجَّ عَنْ شُبْرُمَةَ \" }  رَوَاهُ أَبُو دَاوُدَ, وَابْنُ مَاجَهْ, وَصَحَّحَهُ اِبْنُ حِبَّانَ, وَالرَّاجِحُ عِنْدَ أَحْمَدَ وَقْفُهُ  1‏ .‏‏1 ‏- ضعيف.‏ رواه أبو داود ( 1811 )‏، وابن ماجه ( 2903 )‏، وابن حبان ( 962 )‏، وهذا الحديث اختلف فيه كثيرا، لكن أعله أئمة كبار كأحمد، والطحاوي، والدارقطني، وابن دقيق العيد، وغيرهم، فالقول إن شاء الله قولهم.‏","english":{"narrator":"","text":"Ibn 'Abbas (RAA) narrated, The Messenger of Allah (ﷺ) heard a man saying, ‘O Allah! Here I am in response to Your call (saying Labbayk on behalf.. ) on behalf of Shubrumah.’ The Messenger of Allah (ﷺ) asked him. \"Have you performed your own Hajj?” He replied, ‘No,’ whereupon the Prophet told him, “You must perform Hajj on your own behalf first, and then perform it on behalf of Shubrumah.\" Related by Abu Dawud and Ibn Majah. Ibn Hibban graded it as Sahih."}},{"id":13,"idInBook":13,"chapterId":6,"bookId":17,"arabic":"وَعَنْهُ قَالَ: خَطَبَنَا رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-فَقَالَ: { \" إِنَّ اَللَّهَ كَتَبَ عَلَيْكُمُ اَلْحَجَّ \" فَقَامَ اَلْأَقْرَعُ بْنُ حَابِسٍ فَقَالَ: أَفِي كَلِّ عَامٍ يَا رَسُولَ اَللَّهِ? قَالَ: \" لَوْ قُلْتُهَا لَوَجَبَتْ, اَلْحَجُّ مَرَّةٌ, فَمَا زَادَ فَهُوَ تَطَوُّعٌ \" }  رَوَاهُ اَلْخَمْسَةُ, غَيْرَ اَلتِّرْمِذِيِّ  1‏ .‏‏1 ‏- صحيح.‏ رواه أبو داود (1721 )‏، والنسائي ( 5 / 111 )‏، وابن ماجه ( 2886 )‏، وأحمد ( 3303 )‏ و ( 3510 )‏ والحديث ساقه الحافظ بمعناه.‏ وزاد أحمد فر رواية: \" ولو وجبت لم تسمعوا، ولم تطيعوا \".‏ وهي عند النسائي بلفظ: \" ثم إذا لا تسمعوني ولا تطيعون \".‏","english":{"narrator":"Ibn 'Abbas (RAA) narratedThat the Messenger of Allah (ﷺ) once addressed us and said, “O People! Hajj has been prescribed for you.\" Al-Aqra’ bin Habis stood up and asked, ‘O Prophet of Allah! Are we to perform Hajj every year?” The Messenger of Allah (ﷺ) said:","text":"“Had I said ‘yes’, it would have become a (yearly) obligation. Hajj is obligatory only once in one’s lifetime. Whatever one does over and above this is supererogatory (a voluntary act) for him.\" Related by the five Imams except for at-Tirmidhi."}},{"id":14,"idInBook":14,"chapterId":6,"bookId":17,"arabic":"وَأَصْلُهُ فِي مُسْلِمٍ مِنْ حَدِيثِ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏-  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم ( 1337 )‏، عن أبي هريرة، قال: خطبنا رسول الله صلى الله عليه وسلم، فقال: \" أيها الناس! قد فرض الله عليكم الحج فحجوا \" فقال رجل: أكل عام يا رسول الله؟ فسكت حتى قالها ثلاثا.‏ فقال رسول الله صلى الله عليه وسلم: \" لو قلت: نعم.‏ لوجبت.‏ ولما استطعتم \" ثم قال: \" ذروني ما تركتكم.‏ فإنما هلك من كان قبلكم بكثرة سؤالهم واختلافهم على أنبيائهم.‏ فإذا أمرتكم بشيء فأتوا منه ما استطعتم.‏ وإذا نهيتكم عن شيء فدعوه \".‏","english":{"narrator":"","text":"A similar narration was also related by Muslim on the authority of Abu Hurairah."}},{"id":15,"idInBook":15,"chapterId":6,"bookId":17,"arabic":"عَنِ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا; { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-وَقَّتَ لِأَهْلِ اَلْمَدِينَةِ: ذَا الْحُلَيْفَةِ, وَلِأَهْلِ اَلشَّامِ: اَلْجُحْفَةَ, وَلِأَهْلِ نَجْدٍ: قَرْنَ اَلْمَنَازِلِ, وَلِأَهْلِ اَلْيَمَنِ: يَلَمْلَمَ, هُنَّ لَهُنَّ وَلِمَنْ أَتَى عَلَيْهِنَّ مِنْ غَيْرِهِنَّ مِمَّنْ أَرَادَ اَلْحَجَّ وَالْعُمْرَةَ, وَمَنْ كَانَ دُونَ ذَلِكَ فَمِنْ حَيْثُ أَنْشَأَ, حَتَّى أَهْلُ مَكَّةَ مِنْ مَكَّةَ }  مُتَّفَقٌ عَلَيْه ِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 1524 )‏، ومسلم ( 1181 )‏.‏","english":{"narrator":"","text":"Ibn 'Abbas (RAA) narrated that the Messenger of Allah (ﷺ) specified for the people of Madinah, DhulHulaifah (a place 540 km to the north of Makkah) as miqat. For those coming from ash-Sham (including Syria, Jordan and Palestine), he specified al-Juhfah (a place 187 km to the north-west of Makkah and close to Rabigh, where they now perform their Ihram). For those coming from Najd, he specified Qran al-Manazil, (a mountain, 94 km to the east of Makkah, overlooking 'Arafah. For those coming from Yemen, he specified Yalamlam (a mountain 54 km to the south of Makkah. These places are for the people (coming from the above specified countries) as well as for others, who pass by them on their way to perform Hajj or ’Umrah. Those living within those boundaries can assume Ihram from where they set out (for the journey), and even the residents of Makkah, their Miqat would be the place where they are staying in Makkah.’ Agreed upon."}},{"id":16,"idInBook":16,"chapterId":6,"bookId":17,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا: { أَنَّ أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-وَقَّتَ لِأَهْلِ اَلْعِرَاقِ ذَاتَ عِرْقٍ }  رَوَاهُ أَبُو دَاوُدَ, وَالنَّسَائِيّ ُ  1‏ .‏‏1 ‏- صحيح.‏ رواه أبو داود ( 1739 )‏، والنسائي ( 5 / 125 )‏، واللفظ لأبي داود، وأما لفظ النسائي فهو: \" وقت رسول الله صلى الله عليه وسلم لأهل المدينة ذا الحليفة، ولأهل الشام ومصر: الجحفة، ولأهل العراق: ذات عرق، ولأهل نجد: قرنا، ولأهل اليمن: يلملم \".‏ قلت: والحديث وإن أعل إلا أن له شواهد يصح بها كالحديث التالي.‏","english":{"narrator":"","text":"A’ishah (RAA) narrated’ ‘The Messenger of Allah (ﷺ)specified for those coming from Iraq, Dhat ‘Irq (a place 94 km to the north-east of Makkah) as their Miqat.’ Related by Abu Dawud and An-Nasa’i`."}},{"id":17,"idInBook":17,"chapterId":6,"bookId":17,"arabic":"وَأَصْلُهُ عِنْدَ مُسْلِمٍ مِنْ حَدِيثِ جَابِرٍ إِلَّا أَنَّ رَاوِيَهُ شَكَّ فِي رَفْعِه ِ  1‏ .‏‏1 ‏- صحيح.‏ وهو في مسلم ( 1183 )‏، وهو من طريق أبي الزبير؛ أنه سمع جابر بن عبد الله يسأل عن المهل؟ فقال: سمعت ( أحسبه رفع إلى النبي صلى الله عليه وسلم )‏ فقال: مهل أهل المدينة من ذي الحليفة، والطريق الآخر: الجحفة، ومهل أهل العراق من ذات عرق، ومهل أهل نجد من قرن، ومهل أهل اليمن من يلملم \".‏ قلت: لكن للحديث طرق جديدة بغير هذا الشك الواقع في رواية مسلم، كما عند البيهقي ( 5 / 27 )‏ بسند صحيح، ولذلك قال الحافظ في \" الفتح \" ( 3 / 390 )‏: \" الحديث بمجموع الطرق يقوى \".‏","english":{"narrator":"","text":"Muslim related a similar narration on the authority of Jabir, but it is most probably Mawquf."}},{"id":18,"idInBook":18,"chapterId":6,"bookId":17,"arabic":"وَفِي اَلْبُخَارِيِّ: { أَنَّ عُمَرَ هُوَ اَلَّذِي وَقَّتَ ذَاتَ عِرْقٍ }   1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 1531 )‏، عن ابن عمر رضي الله عنهما، قال: لما فتح هذان المصران أتوا عمر، فقالوا: يا أمير المؤمنين إن رسول الله صلى الله عليه وسلم حد لأهل نجد قرنا وهو جور عن طريقنا، وإنا إن أردنا قرنا شق علينا.‏ قال: فانظروا حذوها من طريقكم.‏ فحد لهم ذات عرق.‏ قلت: المراد بالمصرين: الكوفة والبصرة، و \" ذات عرق \" سميت بذلك لأن فيه عرقا، وهو الجبل الصغير.‏","english":{"narrator":"","text":"Al-Bukhari reported that it was Umar, who specified Dhat 'Irq as the miqat (of those coming from Iraq)."}},{"id":19,"idInBook":19,"chapterId":6,"bookId":17,"arabic":"وَعِنْدَ أَحْمَدَ, وَأَبِي دَاوُدَ, وَاَلتِّرْمِذِيِّ: عَنِ اِبْنِ عَبَّاسٍ: { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-وَقَّتَ لِأَهْلِ اَلْمَشْرِقِ: اَلْعَقِيقَ }   1‏ .‏‏1 ‏- ضعيف.‏ رواه أحمد ( 3205 )‏، وأبو داود ( 1740 )‏، والترمذي ( 832 )‏ من طريق يزيد بن أبي زياد، عن محمد بن علي بن عبد الله بن عباس، عن جده به.‏ وقال الترمذي: \" هذا حديث حسن \".‏ قلت: كلا.‏ فيزيد ضعيف، وفي الحديث انقطاع إذ لم يسمع محمد بن علي من جده كما قال مسلم وابن القطان.‏ هذا ولقد صحح الحديث الشيخ شاكر رحمه الله وأجاب عن هاتتين العلتين بما لا يقنع.‏","english":{"narrator":"","text":"Ibn ’Abbas narrated that the Messenger of Allah (ﷺ) specified al-Aqiq (a part of `Dhat Irq) for those coming from the east.’ Related by Ahmad, Abu Dawud and An-Nasa’i."}},{"id":20,"idInBook":20,"chapterId":6,"bookId":17,"arabic":"عَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: { خَرَجْنَا مَعَ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-عَامَ حَجَّةِ اَلْوَدَاعِ, فَمِنَّا مَنْ أَهَلَّ بِعُمْرَةٍ, وَمِنَّا مَنْ أَهَلَّ بِحَجٍّ وَعُمْرَةٍ, وَمِنَّا مَنْ أَهَلَّ بِحَجٍّ, وَأَهَلَّ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-بِالْحَجِّ, فَأَمَّا مَنْ أَهَلَّ بِعُمْرَةٍ فَحَلَّ, وَأَمَّا مَنْ أَهَلَّ بِحَجٍّ, أَوْ جَمَعَ اَلْحَجَّ وَالْعُمْرَةَ فَلَمْ يَحِلُّوا حَتَّى كَانَ يَوْمَ اَلنَّحْرِ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 1562 )‏، ومسلم ( 1211 )‏ ( 118 )‏ واللفظ لمسلم.‏","english":{"narrator":"","text":"A’isha (RAA) narrated, ‘We left Madinah with the Messenger of Allah (ﷺ) to perform the Farewell Hajj. Some of us declared Ihram to perform 'Umrah, while others declared their intentions to perform both Hajj and 'Umrah. Yet others declared their lhram to perform Hajj only. The Prophet (ﷺ) declared Ihram for Hajj only. Those who intended 'Umrah terminated their Ihram as soon as they finished the rituals of 'Umrah. Those who intended to perform Hajj only or to combine Hajj with 'Umrah, did not terminate their Ihram until the Day of Slaughtering (i.e. the day of sacrifice or ’Idul Ad-ha).’ Agreed upon."}},{"id":21,"idInBook":21,"chapterId":6,"bookId":17,"arabic":"عَنْ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { مَا أَهَلَّ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-إِلَّا مِنْ عِنْدِ اَلْمَسْجِدِ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 1541 )‏، ومسلم ( 1186 )‏، وزادا: \" يعني: مسجد ذي الحليفة \".‏","english":{"narrator":"","text":"Ibn 'Umar (RAA) narrated, ‘The Messenger of Allah (ﷺ) used to start saying the Talbiyah. (after entering the state of Ihram) from the mosque of Dhul Hulaifa (i.e. from the Miqat of Madinah). Agreed upon."}},{"id":22,"idInBook":22,"chapterId":6,"bookId":17,"arabic":"وَعَنْ خَلَّادِ بْنِ اَلسَّائِبِ عَنْ أَبِيهِ ‏- رضى الله عنه ‏- أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { أَتَانِي جِبْرِيلُ, فَأَمَرَنِي أَنْ آمُرَ أَصْحَابِي أَنْ يَرْفَعُوا أَصْوَاتَهُمْ بِالْإِهْلَالِ }  رَوَاهُ اَلْخَمْسَةُ، وَصَحَّحَهُ اَلتِّرْمِذِيُّ, وَابْنُ حِبَّانَ  1‏ .‏‏1 ‏- صحيح.‏ رواه أبو داود ( 1814 )‏، والنسائي ( 5 / 162 )‏، والترمذي ( 829 )‏، وابن ماجه ( 2922 )‏، وأحمد ( 4 / 55 )‏، وابن حبان ( 3791 )‏ وقال الترمذي: \" حسن صحيح \".‏","english":{"narrator":"Khallad bin as-Sa’ib narrated on the authority of his father, ‘The Messenger of Allah (ﷺ) said:","text":"“Jibril (peace be upon him) came to me and told me: ‘Command your Companions to raise their voices when saying Talbiyah.” Related by the five Imams and rendered authentic by At-Tirmidhi and Ibn Hibban."}},{"id":23,"idInBook":23,"chapterId":6,"bookId":17,"arabic":"وَعَنْ زَيْدِ بْنِ ثَابِتٍ ‏- رضى الله عنه ‏- { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-تَجَرَّدَ لِإِهْلَالِهِ وَاغْتَسَلَ }  رَوَاهُ اَلتِّرْمِذِيُّ وَحَسَّنَهُ  1‏ .‏‏1 ‏- حسن.‏ رواه الترمذي ( 830 )‏، وقال: حسن غريب.‏ قلت: وله شاهدان عن عائشة، وابن عباس خرجتهما في \" الأصل \".‏","english":{"narrator":"","text":"Zaid bin Thabit (RAA) narrated, ‘When the Messenger of Allah (ﷺ) intended to make Ihram for Hajj, he would wash, and take off his ordinary clothes (and put on his white Ihram).\" Related by At-Tirmidhi who declared it to be Hadith-Hasan."}},{"id":24,"idInBook":24,"chapterId":6,"bookId":17,"arabic":"وَعَنْ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا: { أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-سُئِلَ: مَا يَلْبَسُ اَلْمُحْرِمُ مِنْ اَلثِّيَابِ? فَقَالَ: \n\" لَا تَلْبَسُوا الْقُمُصَ, وَلَا اَلْعَمَائِمَ, وَلَا السَّرَاوِيلَاتِ, وَلَا اَلْبَرَانِسَ, وَلَا اَلْخِفَافَ, إِلَّا أَحَدٌ لَا يَجِدُ اَلنَّعْلَيْنِ فَلْيَلْبَسْ اَلْخُفَّيْنِ وَلْيَقْطَعْهُمَا أَسْفَلَ مِنَ اَلْكَعْبَيْنِ, وَلَا تَلْبَسُوا شَيْئًا مِنْ اَلثِّيَابِ مَسَّهُ اَلزَّعْفَرَانُ وَلَا اَلْوَرْسُ\" }  مُتَّفَقٌ عَلَيْهِ وَاللَّفْظُ لِمُسْلِمٍ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 1542 )‏، ومسلم ( 1177 )‏.‏","english":{"narrator":"","text":"Ibn 'Umar (RAA) narrated, ‘The Messenger of Allah (ﷺ) was asked about what the person who is in a state of Ihram (Muhrim) should wear. He answered, \"A person in the state of Ihram. is not allowed to wear a sewn shirt, a turban, trousers, a hooded robe, shoes or sewn slippers (Khuff), unless one is unable to find unsown slippers, then he may wear his Khuff or shoes provided one cuts them below the ankles, and you must not wear clothing that has been dyed with sweet smelling fragrance (such as saffron).” Agreed upon, and the wording is from Muslim."}},{"id":25,"idInBook":25,"chapterId":6,"bookId":17,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: { كُنْتُ أُطَيِّبُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-لِإِحْرَامِهِ قَبْلَ أَنْ يُحْرِمَ, وَلِحِلِّهِ قَبْلَ أَنْ يَطُوفَ بِالْبَيْتِ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 1539 )‏، ومسلم ( 1189 )‏ ( 33 )‏.‏","english":{"narrator":"","text":"A’ishah (RAA) narrated, ‘I used to apply perfume to the Prophet (ﷺ) when he intended to enter the state of Ihram, before he put on his Ihram (garments). And again when he ended his state of Ihram, but before he had made Tawaf around the Ka’bah.' Agreed upon."}},{"id":26,"idInBook":26,"chapterId":6,"bookId":17,"arabic":"وَعَنْ عُثْمَانَ بْنِ عَفَّانَ ‏- رضى الله عنه ‏- أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { لَا يَنْكِحُ اَلْمُحْرِمُ, وَلَا يُنْكِحُ, وَلَا يَخْطُبُ }  رَوَاهُ مُسْلِمٌ  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم ( 1409 )‏.‏","english":{"narrator":"'Uthman bin ’Affan (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“A Muhrim (one in the state of Ihram) must not contract marriage, nor help others contract marriage, nor get engaged to marry.\" Related by Muslim."}},{"id":27,"idInBook":27,"chapterId":6,"bookId":17,"arabic":"وَعَنْ أَبِي قَتَادَةَ اَلْأَنْصَارِيِّ ‏- رضى الله عنه ‏- { فِي قِصَّةِ صَيْدِهِ اَلْحِمَارَ اَلْوَحْشِيَّ, وَهُوَ غَيْرُ مُحْرِمٍ, قَالَ: فَقَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-لِأَصْحَابِهِ, وَكَانُوا مُحْرِمِينَ: \" هَلْ مِنْكُمْ أَحَدٌ أَمَرَهُ أَوْ أَشَارَ إِلَيْهِ بِشَيْءٍ ? \" قَالُوا: لَا.‏ قَالَ: \" فَكُلُوا مَا بَقِيَ مِنْ لَحْمِهِ \" }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 1824 )‏، ومسلم ( 1196 )‏.‏","english":{"narrator":"","text":"Abu Qatadah Al-Ansari (RAA) narrated concerning his hunting a zebra while he is not in a state of Ihram, that ‘Allah’s Messenger (ﷺ) said to Abu Qatada’s companions -who were in a state of Ihram, \"Did any one of you ask Abu Qatadah to attack the herd, or point it out to him?\" They said, ‘No.’ The Prophet then said, \"Then, you may eat what is left of the quarry.\" Agreed upon."}},{"id":28,"idInBook":28,"chapterId":6,"bookId":17,"arabic":"وَعَنْ اَلصَّعْبِ بْنِ جَثَّامَةَ اَللَّيْثِيِّ ‏- رضى الله عنه ‏- { أَنَّهُ أَهْدَى لِرَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-حِمَارًا وَحْشِيًّا, وَهُوَ بِالْأَبْوَاءِ, أَوْ بِوَدَّانَ، فَرَدَّهُ عَلَيْهِ, وَقَالَ: \n\" إِنَّا لَمْ نَرُدَّهُ عَلَيْكَ إِلَّا أَنَّا حُرُمٌ \" }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 1825 )‏، ومسلم ( 1193 )‏.‏ والصعب: بفتح الصاد وسكون العين المهملتين وتحرف في \" أ \" إلى: \" الثعب \".‏ وجثامة: بفتح الجيم، وتشديد المثلثة.‏ والأبواء، وبودان هما مكانان بين مكة والمدينة.‏","english":{"narrator":"","text":"As-Sa'b bin Jath-thamah al-Laithi (RAA) narrated, ‘He presented to the Prophet (ﷺ) the meat of a zebra while he was in the area known as al-Abwa’ or Waddan. The Prophet (ﷺ) declined it, and said to him, “We declined your present only because we are in the state of Ihram.\" Agreed upon."}},{"id":29,"idInBook":29,"chapterId":6,"bookId":17,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ خَمْسٌ مِنَ اَلدَّوَابِّ كُلُّهُنَّ فَاسِقٌ, يُقْتَلْنَ فِي  اَلْحَرَمِ: اَلْغُرَابُ, وَالْحِدَأَةُ, وَالْعَقْرَبُ, وَالْفَأْرَةُ، وَالْكَلْبُ اَلْعَقُورُ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 1829 )‏، ومسلم ( 1198 )‏، واللفظ للبخاري إلا أنه ليس عنده لفظ \" الحل \".‏","english":{"narrator":"A’ishah (RAA) narrated ‘The Messenger of Allah (ﷺ) said:","text":"\"Five kinds of animals are vicious and harmful, and they may be killed outside or inside the sacred area of Ihram (Sanctuary). These are: the scorpion, the kite, the crow, the mouse, and the rabid dog.” Agreed upon."}},{"id":30,"idInBook":30,"chapterId":6,"bookId":17,"arabic":"وَعَنِ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا; أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-{ اِحْتَجَمَ وَهُوَ مُحْرِمٌ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 1835 )‏، ومسلم ( 1202 )‏.‏","english":{"narrator":"","text":"Ibn 'Abbas (RAA) narrated, ‘The Messenger of Allah (ﷺ) had himself cupped while he was in the state of Ihram Agreed upon."}},{"id":31,"idInBook":31,"chapterId":6,"bookId":17,"arabic":"وَعَنْ كَعْبِ بْنِ عُجْرَةَ ‏- رضى الله عنه ‏- قَالَ: { حُمِلْتُ إِلَى رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-وَالْقَمْلُ يَتَنَاثَرُ عَلَى وَجْهِي, فَقَالَ: \" مَا كُنْتُ أَرَى اَلْوَجَعَ بَلَغَ بِكَ مَا أَرَى, تَجِدُ شَاةً ? قُلْتُ: لَا.‏ قَالَ: \" فَصُمْ ثَلَاثَةَ أَيَّامٍ, أَوْ أَطْعِمْ سِتَّةَ مَسَاكِينَ, لِكُلِّ مِسْكِينٍ نِصْفُ صَاعٍ \" }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- رواه البخاري ( 1816 )‏، ومسلم ( 1201 )‏، من طريق عبد الله بن معقل قال: جلست إلى كعب بن عجرة رضي الله عنه، فسألته عن الفدية، فقال: نزلت في خاصة، وهي لكم عامة… الحديث.‏ قلت: واللفظ للبخاري.‏","english":{"narrator":"","text":"Ka'b bin 'Ujrah (RAA) narrated, ‘I was carried to the Prophet (ﷺ) and the lice were falling over my face. He said, “I did not know that your disease is hurting you as much as what I see. Can you sacrifice a sheep?” I said, ‘No.’ He then said. “Fast for three days or feed six poor people, half a Sa’ each.” Agreed upon."}},{"id":32,"idInBook":32,"chapterId":6,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: { لَمَّا فَتَحَ اَللَّهُ عَلَى رَسُولِهِ ‏- صلى الله عليه وسلم ‏-مَكَّةَ, قَامَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-فِي اَلنَّاسِ، فَحَمِدَ اَللَّهَ وَأَثْنَى عَلَيْهِ, ثُمَّ قَالَ: \" إِنَّ اَللَّهَ حَبَسَ عَنْ مَكَّةَ اَلْفِيلَ, وَسَلَّطَ عَلَيْهَا رَسُولَهُ وَالْمُؤْمِنِينَ, وَإِنَّهَا لَمْ تَحِلَّ لِأَحَدٍ كَانَ قَبْلِي, وَإِنَّمَا أُحِلَّتْ لِي سَاعَةٌ مِنْ نَهَارٍ, وَإِنَّهَا لَنْ تَحِلَّ لِأَحَدٍ بَعْدِي, فَلَا يُنَفَّرُ صَيْدُهَا, وَلَا يُخْتَلَى شَوْكُهَا, وَلَا تَحِلُّ سَاقِطَتُهَا إِلَّا لِمُنْشِدٍ, وَمَنْ قُتِلَ لَهُ قَتِيلٌ فَهُوَ بِخَيْرِ اَلنَّظَرَيْنِ \" فَقَالَ اَلْعَبَّاسُ: إِلَّا اَلْإِذْخِرَ, يَا رَسُولَ اَللَّهِ, فَإِنَّا نَجْعَلُهُ فِي قُبُورِنَا وَبُيُوتِنَا, فَقَالَ: \" إِلَّا اَلْإِذْخِرَ \" }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 3433 )‏، ومسلم ( 1355 )‏، وزادا: \" فقام أبو شاة ‏-رجل من أهل اليمن‏- فقال: اكتبوا لي يا رسول الله.‏ فقال رسول الله صلى الله عليه وسلم: \" اكتبوا لأبي شاة \" قال الوليد بن مسلم: فقلت للأوزاعي: ما قوله: اكتبوا لي يا رسول الله؟ قال: هذه الخطبة التي سمعها من رسول الله صلى الله عليه وسلم.‏","english":{"narrator":"","text":"Abu Hurairah (RAA) narrated, ‘When Allah, the Most High granted His Messenger (ﷺ) victory on the conquest of Makkah, the Prophet (ﷺ) addressed the people, so he glorified Allah and praised Him, and said, \"Allah withheld the elephant from Makkah and empowered His Messenger and the believers over it. It has not been made lawful (i.e. fighting in it) for anyone before me, but it has been lawful for me only for a few hours on that day (of the conquest), and it will not be made lawful to anyone after me (to enter it lighting). Its wild game must not be frightened, its thorns are not to be cut. No one is allowed to pick up lost articles (Luqatah) unless he announces it (what he has found) publicly (in order to return it to the owner). If anyone has someone murdered inside its boundaries, then he has the choice of the best of two options (i.e. either to accept compensation, i.e. blood money or to retaliate). Al-'Abbas then said, ‘Except for the Idhkhar (a kind of nice smelling grass, which is used by goldsmiths and burnt in households.)"}},{"id":33,"idInBook":33,"chapterId":6,"bookId":17,"arabic":"وَعَنْ عَبْدِ اَللَّهِ بْنِ زَيْدِ بْنِ عَاصِمٍ ‏- رضى الله عنه ‏- أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { إِنَّ إِبْرَاهِيمَ حَرَّمَ مَكَّةَ وَدَعَا لِأَهْلِهَا, وَإِنِّي حَرَّمْتُ اَلْمَدِينَةَ كَمَا حَرَّمَ إِبْرَاهِيمُ مَكَّةَ، وَإِنِّي دَعَوْتُ فِي صَاعِهَا وَمُدِّهَا بِمِثْلَيْ  1‏ مَا دَعَا  2‏ إِبْرَاهِيمُ لِأَهْلِ مَكَّةَ }  مُتَّفَقٌ عَلَيْهِ  3‏ .‏‏1 ‏- هذه رواية مسلم، وفي رواية البخاري وأخرى لمسلم \" مثل \".‏‏2 ‏- زاد مسلم: \" به \".‏‏3 ‏- صحيح.‏ رواه البخاري ( 2129 )‏، ومسلم ( 1360 )‏ واللفظ لمسلم.‏","english":{"narrator":"","text":"'Abdullah bin Zaid bin ’Asim (RAA) narrated that the Messenger of Allah said, \"Ibrahim declared Makkah as a Haram (Sanctuary) and made supplication for its people, and I declare Madinah to be a Haram just as Ibrahim declared Makkah as a Haram, and I made supplication for its Mudd and Sa’ (refer to hadith no. 650), just as Ibrahim made supplication for the people of Makkah.\" Agreed upon."}},{"id":34,"idInBook":34,"chapterId":6,"bookId":17,"arabic":"وَعَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ اَلْمَدِينَةُ حَرَمٌ مَا بَيْنَ عَيْرٍ إِلَى ثَوْرٍ }  رَوَاهُ مُسْلِمٌ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 6755 )‏، ومسلم ( 1370 )‏، ولا أدري سبب اقتصار الحافظ في عزوه للحديث على صحيح مسلم إلا أن يكون من باب السهو.‏ وقد أثير حول هذا الحديث بعض الإشكالات، فأحسن الحافظ ‏-رحمه الله‏- في الجواب عنها، انظر \" الفتح \" ( 4 / 82 ‏- 83 )‏.‏","english":{"narrator":"’Ali bin Abi Talib (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"\"Madinah is a Haram (Sanctuary) and its Sacred Precincts extend from ’Air to Thawr (the names of two mountains).” Related by Muslim."}},{"id":35,"idInBook":35,"chapterId":6,"bookId":17,"arabic":"وَعَنْ جَابِرِ بْنِ عَبْدِ اَللَّهِ رَضِيَ اَللَّهُ عَنْهُمَا: { أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-حَجَّ, فَخَرَجْنَا مَعَهُ, حَتَّى أَتَيْنَا ذَا الْحُلَيْفَةِ, فَوَلَدَتْ أَسْمَاءُ بِنْتُ عُمَيْسٍ, فَقَالَ: \" اِغْتَسِلِي وَاسْتَثْفِرِي بِثَوْبٍ, وَأَحْرِمِي \" وَصَلَّى رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-فِي اَلْمَسْجِدِ, ثُمَّ رَكِبَ اَلْقَصْوَاءَ  1‏ حَتَّى إِذَا اِسْتَوَتْ بِهِ عَلَى اَلْبَيْدَاءِ أَهَلَّ بِالتَّوْحِيدِ: \" لَبَّيْكَ اَللَّهُمَّ لَبَّيْكَ, لَبَّيْكَ لَا شَرِيكَ لَكَ لَبَّيْكَ, إِنَّ اَلْحَمْدَ وَالنِّعْمَةَ لَكَ وَالْمُلْكَ, لَا شَرِيكَ لَكَ \".‏ \nحَتَّى إِذَا أَتَيْنَا اَلْبَيْتَ اِسْتَلَمَ اَلرُّكْنَ, فَرَمَلَ ثَلَاثًا وَمَشَى أَرْبَعًا, ثُمَّ أَتَى مَقَامَ إِبْرَاهِيمَ فَصَلَّى, ثُمَّ رَجَعَ إِلَى اَلرُّكْنِ فَاسْتَلَمَهُ.‏ \nثُمَّ خَرَجَ مِنَ اَلْبَابِ إِلَى اَلصَّفَا, فَلَمَّا دَنَا مِنَ اَلصَّفَا قَرَأَ: \" إِنَّ اَلصَّفَا وَاَلْمَرْوَةَ مِنْ شَعَائِرِ اَللَّهِ \" \" أَبْدَأُ بِمَا بَدَأَ اَللَّهُ بِهِ \" فَرَقِيَ اَلصَّفَا, حَتَّى رَأَى اَلْبَيْتَ, فَاسْتَقْبَلَ اَلْقِبْلَةَ  2‏ فَوَحَّدَ اَللَّهَ وَكَبَّرَهُ وَقَالَ: \" لَا إِلَهَ إِلَّا اَللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ, لَهُ اَلْمُلْكُ, وَلَهُ اَلْحَمْدُ, وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ, لَا إِلَهَ إِلَّا اَللَّهُ   6‏ حَتَّى إِذَا صَعَدَتَا  7‏ مَشَى إِلَى اَلْمَرْوَةِ  8‏ فَفَعَلَ عَلَى اَلْمَرْوَةِ, كَمَا فَعَلَ عَلَى اَلصَّفَا … ‏- فَذَكَرَ اَلْحَدِيثَ.‏ وَفِيهِ: \nفَلَمَّا كَانَ يَوْمَ اَلتَّرْوِيَةِ تَوَجَّهُوا إِلَى مِنَى, وَرَكِبَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-فَصَلَّى بِهَا اَلظُّهْرَ, وَالْعَصْرَ, وَالْمَغْرِبَ, وَالْعِشَاءَ, وَالْفَجْرَ, ثُمَّ مَكَثَ قَلِيلاً حَتَّى طَلَعَتْ اَلشَّمْسُ، فَأَجَازَ حَتَّى أَتَى عَرَفَةَ, فَوَجَدَ اَلْقُبَّةَ قَدْ ضُرِبَتْ لَهُ بِنَمِرَةَ  9‏ فَنَزَلَ بِهَا.‏ \nحَتَّى إِذَا زَاغَتْ اَلشَّمْسُ أَمَرَ بِالْقَصْوَاءِ, فَرُحِلَتْ لَهُ, فَأَتَى بَطْنَ اَلْوَادِي, فَخَطَبَ اَلنَّاسَ.‏ \nثُمَّ أَذَّنَ ثُمَّ أَقَامَ, فَصَلَّى اَلظُّهْرَ, ثُمَّ أَقَامَ فَصَلَّى اَلْعَصْرَ, وَلَمْ يُصَلِّ بَيْنَهُمَا شَيْئًا.‏ \nثُمَّ رَكِبَ حَتَّى أَتَى اَلْمَوْقِفَ فَجَعَلَ بَطْنَ نَاقَتِهِ اَلْقَصْوَاءِ إِلَى الصَّخَرَاتِ, وَجَعَلَ حَبْلَ اَلْمُشَاةِ  10‏ بَيْنَ يَدَيْهِ وَاسْتَقْبَلَ اَلْقِبْلَةَ, فَلَمْ يَزَلْ وَاقِفاً حَتَّى غَرَبَتِ اَلشَّمْسُ, وَذَهَبَتْ اَلصُّفْرَةُ قَلِيلاً, حَتَّى غَابَ اَلْقُرْصُ, وَدَفَعَ, وَقَدْ شَنَقَ لِلْقَصْوَاءِ اَلزِّمَامَ حَتَّى إِنَّ رَأْسَهَا لَيُصِيبُ مَوْرِكَ رَحْلِهِ, وَيَقُولُ بِيَدِهِ اَلْيُمْنَى: \" أَيُّهَا اَلنَّاسُ, اَلسَّكِينَةَ, اَلسَّكِينَةَ \", كُلَّمَا أَتَى حَبْلاً  11‏ أَرْخَى لَهَا قَلِيلاً حَتَّى تَصْعَدَ.‏ \nحَتَّى أَتَى اَلْمُزْدَلِفَةَ, فَصَلَّى بِهَا اَلْمَغْرِبَ وَالْعِشَاءَ, بِأَذَانٍ وَاحِدٍ وَإِقَامَتَيْنِ, وَلَمْ يُسَبِّحْ  12‏ بَيْنَهُمَا شَيْئًا, ثُمَّ اِضْطَجَعَ حَتَّى طَلَعَ اَلْفَجْرُ, فَصَلَّى  13‏ اَلْفَجْرَ, حِينَ  14‏ تَبَيَّنَ لَهُ اَلصُّبْحُ بِأَذَانٍ وَإِقَامَةٍ ثُمَّ رَكِبَ حَتَّى أَتَى اَلْمَشْعَرَ اَلْحَرَامَ, فَاسْتَقْبَلَ اَلْقِبْلَةَ, فَدَعَاهُ, وَكَبَّرَهُ, وَهَلَّلَهُ  15‏ فَلَمْ يَزَلْ وَاقِفًا حَتَّى أَسْفَرَ جِدًّا.‏ \nفَدَفَعَ قَبْلَ أَنْ تَطْلُعَ اَلشَّمْسُ, حَتَّى أَتَى بَطْنَ مُحَسِّرَ فَحَرَّكَ قَلِيلاً، ثُمَّ سَلَكَ اَلطَّرِيقَ اَلْوُسْطَى اَلَّتِي تَخْرُجُ عَلَى اَلْجَمْرَةِ اَلْكُبْرَى, حَتَّى أَتَى اَلْجَمْرَةَ اَلَّتِي عِنْدَ اَلشَّجَرَةِ, فَرَمَاهَا بِسَبْعِ حَصَيَاتٍ, يُكَبِّرُ مَعَ كُلِّ حَصَاةٍ مِنْهَا, مِثْلَ حَصَى اَلْخَذْفِ, رَمَى مِنْ بَطْنِ اَلْوَادِي، ثُمَّ اِنْصَرَفَ إِلَى اَلْمَنْحَرِ, فَنَحَرَ، ثُمَّ رَكِبَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-فَأَفَاضَ إِلَى اَلْبَيْتِ, فَصَلَّى بِمَكَّةَ اَلظُّهْرَ }  رَوَاهُ مُسْلِمٌ مُطَوَّلاً  16‏ .‏‏1 ‏- وهي ناقته صلى الله عليه وسلم.‏\n‏2 ‏- تحرف في \" أ \" إلى: \" فاستقبله واستقبل القبلة \".‏‏3 ‏- سقطت من الأصلين، واستدركتها من مسلم.‏‏4 ‏- زاد مسلم: \" قال مثل هذا \".‏\n\n5 ‏- زاد مسلم: \" إذا \".\n‏\n‏6 ‏- سقطت من الأصلين، واستدركتها من مسلم.‏‏7 ‏- في الأصلين: \" صعد \"، والتصويب من مسلم.‏‏8 ‏- كذا بالأصلين، وفي مسلم: \" مشى حتى أتى المروة \".‏\n‏9 ‏- موضع بجنب عرفات، وليس من عرفات.‏\n‏10 ‏- أي: طريقهم الذي يسلكونه.‏‏11 ‏- زاد مسلم: \" من الحبال \".‏\n‏12 ‏- أي: لم يصل نافلة.‏‏13 ‏- كذا في الأصلين، وفي مسلم: \" وصلى \".‏‏14 ‏- تحرف في \" أ \" إلى: \" حتى \".‏‏15 ‏- كذا هو في مسلم، وفي الأصلين: \" فدعا، وكبر، وهلل \".‏\n‏16 ‏- صحيح.‏ رواه مسلم ( 1218 )‏ ولشيخنا العلامة محمد ناصر الدين الألباني ‏-حفظه الله‏- كتاب: \" حجة النبي صلى الله عليه وسلم \" ساق فيها حديث جابر هذا وزياداته من كتب السنة ونسقها أحسن تنسيق، والكتاب مطبوع عدة طبعات.‏","english":{"narrator":"Jabir bin 'Abdullah (RAA) narrated, ‘The Messenger of Allah (ﷺ) performed Hajj (on the 10th year of Hijrah), and we set out with him (to perform Hajj). When we reached Dhul-Hulaifah, Asma` bint 'Umais gave birth to Muhammad Ibn Abi Bakr. She sent a message to the Prophet (ﷺ) (asking him what she should do). He said, \"Take a bath, bandage your private parts and make the intention for Ahram.\" The Prophet (ﷺ) then prayed in the mosque and then mounted al-Qaswa (his she-camel) and it stood erect with him on its back at al-Baida’ (the place where he started his Ihram). He then started pronouncing the Talbiyuh, saying:","text":"\"Labbaika Allahumma labbaik labbaika la sharika laka labbaik, innal hamda wan-ni’mata laka wal mulk, la sharika lak (O Allah! I hasten to You. You have no partner. I hasten to You. All praise and grace is Yours and all Sovereignty too; You have no partner). When we came with him to the House (of Allah), he placed his hands on the Black Stone (Hajar al Aswad) and kis+sed it. He then started to make seven circuits (round the Ka’bah), doing ramal (trotting) in three of them and walking (at his normal pace) four other circuits. Then going to the place of Ibrahim (Maqam Ibrahim), there he prayed two rak'at. He then returned to the Black Stone (Hajar al Aswad) placed his hands on it and kissed it. Then he went out of the gate to Safa, and as he approached it, he recited: “Verily as-Safa and Marwah are among the signs appointed by Allah,\"(2:158), adding, “I begin with what Allah began.\" He first mounted as-Safa until he saw the House, and facing the Qiblah he declared the Oneness of Allah and glorified Him and said: ‘La ilaha illa-llah wahdahu la sharika lahu, lahul mulk wa lahul hamd, wa huwa 'ala kulli shai’in qadeer, la ilaha illa-llahu wahdahu anjaza wa'dahu, wa nas ara 'abdahu, wa hazamal ahzaba wahdah’ (There is no God but Allah, He is One, and has no partner. His is the dominion, and His is the praise and He has Power over all things. There is no God but Allah alone, Who fulfilled His promise, helped His servant and defeated the confederates alone.\") He said these words three times making supplications in between. He then descended and walked towards Marwah, and when his feet touched the bottom of the valley, he ran; and when he began to ascend, he walked (at his normal pace) until he reached Marwah. There he did as he had done at Safa…. \nWhen it was the day of Tarwiyah (8th of Dhul-Hijjah) they went to Mina and put on the Ihram for Hajj and the Messenger of Allah (ﷺ) rode his mount, and there he led the Dhur (noon), ‘Asr (afternoon), Maghrib (sunset), ‘Isha and Fajr (dawn) prayers. He then waited a little until the sun had risen, and commanded that a tent be pitched at Namirah (close to Arafat). The Messenger of Allah (ﷺ), continued on until he came to Arafah and he found that the tent had been pitched for him at Namirah. There he got down until the sun had passed its meridian; he commanded that al-Qaswa’ be brought and saddled for him, then he came to the bottom of the valley, and addressed the people with the well-known sermon Khutbat al-Wada (the Farewell Sermon). Then the Adhan was pronounced and later on the Iqamah and the Prophet led the Dhuhr (noon) prayer. Then another Iqamah was pronounced and the Prophet led the Asr (afternoon) prayer and he observed no other prayer in between the two. The Messenger of Allah then mounted his camel and came to the place where he was to stay. He made his she-camel, al-Qaswa turn towards the rocky side, with the pedestrian path lying in front of him. He faced the Qiblah, and stood there until the sun set, and the yellow light diminished somewhat, and the disc of the sun totally disappeared. He pulled the nose string of al-Qaswa’ so forcefully that its head touched the saddle (in order to keep her under perfect control), and pointing with his right hand, advised the people to be moderate (in speed) saying: “O people! Calmness! Calmness!\" Whenever he passed over an elevated tract of land, he slightly loosened the nose-string of his camel until she climbed up. This is how he reached al-Muzdalifah. There he led the Maghrib (sunset) and Isha prayers with one Adhan, and two lqamas, and did not pray any optional prayers in between them. The Messenger of Allah then lay down until dawn and then offered the Fajr (dawn) prayer with an Adhan and an Iqamah when the morning light was clear. He again mounted al-Qaswa’, and when he came to Al-Mash‘ar Al-Haram (The Sanctuary Landmark, which is a small mountain at al-Muzdalifah) he faced the Qiblah, and supplicated to Allah, Glorified Him, and pronounced His Uniqueness and Oneness, and kept standing until the daylight was very clear. Then he set off quickly before the sun rose, until he came to the bottom of the valley of Muhassir where he urged her (al·Qaswa’) a little. He followed the middle road, which comes out at the greatest Jamarah (one of the three stoning sites called Jamrat-ul ‘Aqabah), he came to Jamarah which is near the tree. At this he threw seven small pebbles, saying, Allahu Akbar` while throwing each of them in a manner in which small pebbles are thrown (holding them with his fingers) and this he did while at the bottom of the valley. He then went to the Place of sacrifice, and sacrificed sixty-three (camels) with his own hand (he brought 100 camels with him and he asked ’Ali to sacrifice the rest). The Messenger of Allah again rode and came to the House (of Allah), where he performed Tawaf al-Ifada and offered the Dhuhr prayer at Makkah….’ Muslim transmitted this hadith through a very long narration describing the full details of the Hajj of the Prophet"}},{"id":36,"idInBook":36,"chapterId":6,"bookId":17,"arabic":"وَعَنْ خُزَيْمَةَ بْنِ ثَابِتٍ ‏- رضى الله عنه ‏- { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-كَانَ إِذَا فَرَغَ مِنْ تَلْبِيَتِهِ فِي حَجٍّ أَوْ عُمْرَةٍ سَأَلَ اَللَّهَ رِضْوَانَهُ وَالْجَنَّةَ وَاسْتَعَاذَ  1‏ بِرَحْمَتِهِ مِنَ اَلنَّارِ }  رَوَاهُ اَلشَّافِعِيُّ بِإِسْنَادٍ ضَعِيفٍ  2‏ .‏‏1 ‏- كذا بالأصلين، وفي \" مسند الشافعي \": واستعفاه.‏‏2 ‏- ضعيف.‏ رواه الشافعي في \" المسند \" ( 1 / 307 / 797 )‏ في سنده صالح بن محمد بن أبي زائدة وهو ضعيف، وأما شيخ الشافعي إبراهيم بن محمد فهو وإن كان كذابا، إلا أنه توبع عليه، فبقيت علة الحديث في صالح.‏","english":{"narrator":"","text":"Khuzaimah bin Thabit (RAA) narrated, ‘When the Messenger of Allah (ﷺ) finished his Talbiyah whether in Hajj or 'Umrah, he would ask Allah for His good pleasure and acceptance and ask Him for Paradise, and would seek refuge in Him from Hell.’ Related by Ash-Shafi'i with a weak chain of narrators."}},{"id":37,"idInBook":37,"chapterId":6,"bookId":17,"arabic":"وَعَنْ جَابِرٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ نَحَرْتُ هَاهُنَا, وَمِنًى كُلُّهَا مَنْحَرٌ, فَانْحَرُوا فِي رِحَالِكُمْ, وَوَقَفْتُ هَاهُنَا وَعَرَفَةُ كُلُّهَا مَوْقِفٌ, وَوَقَفْتُ هَاهُنَا وَجَمْعٌ كُلُّهَا مَوْقِفٌ }  رَوَاهُ مُسْلِمٌ  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم ( 2 / 893 / 145 )‏.‏","english":{"narrator":"Jabir (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"\"I have offered my sacrifice here (at Mina) and all of Mina is a place for slaughtering, so sacrifice where you are staying (at Mina). And I have stopped here (at Arafat) and all of Arafat is a stopping place (for the Day of Arafat on the 9th of Dhul-Hijjah). And I have stood here, and all of Jam' (meaning al·Muzdalifah) is a place for standing.” Related by Muslim."}},{"id":38,"idInBook":38,"chapterId":6,"bookId":17,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا: { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-لَمَّا جَاءَ إِلَى مَكَّةَ دَخَلَهَا مِنْ أَعْلَاهَا, وَخَرَجَ مِنْ أَسْفَلِهَا }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 1577 )‏، ومسلم ( 1258 )‏.‏ وأعلاها: طريق الحجون، وأسفلها: طريق باب الشبيكة مرورا بجرول.‏","english":{"narrator":"","text":"A’ishah (RAA) narrated, ‘When the Messenger of Allah (ﷺ) came to Makkah, he entered from its higher side (a place now called al-Mu'alla gate) and went out from its lower side (now called Kuda).’ Agreed upon."}},{"id":39,"idInBook":39,"chapterId":6,"bookId":17,"arabic":"وَعَنْ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا: { أَنَّهُ كَانَ لَا يَقْدُمُ مَكَّةَ إِلَّا بَاتَ بِذِي طُوَى حَتَّى يُصْبِحَ وَيَغْتَسِلَ, وَيَذْكُرُ ذَلِكَ عِنْدَ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-}  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- رواه البخاري ( 1553 )‏، ومسلم ( 1259 )‏، واللفظ لمسلم.‏ و \" ذو طوى \": موضع معروف بقرب مكة، وهو المعروف بآبار الزاهر.‏","english":{"narrator":"","text":"Whenever Ibn 'Umar (RAA) came to Makkah he would spend the night at Dhi Tuwa valley (near Makkah), and in the morning he would bathe. ‘Ibn 'Umar used to say that this is what the Messenger of Allah (ﷺ), used to do.’ Agreed upon."}},{"id":40,"idInBook":40,"chapterId":6,"bookId":17,"arabic":"وَعَنْ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا: { أَنَّهُ كَانَ يُقَبِّلُ اَلْحَجَرَ اَلْأَسْوَدَ وَيَسْجُدُ عَلَيْهِ }  رَوَاهُ اَلْحَاكِمُ مَرْفُوعًا, وَالْبَيْهَقِيُّ مَوْقُوفًا  1‏ .‏‏1 ‏- صحيح مرفوعا وموقوفا.‏","english":{"narrator":"","text":"Ibn 'Abbas (RAA) narrated that he used to kiss the Black Stone and prostrate himself on it. Related by Al-Hakim and Al-Baihaqi."}},{"id":41,"idInBook":41,"chapterId":6,"bookId":17,"arabic":"وَعَنْهُ قَالَ: أَمَرَهُمْ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-{ أَنْ يَرْمُلُوا ثَلَاثَةَ أَشْوَاطٍ وَيَمْشُوا أَرْبَعًا, مَا بَيْنَ اَلرُّكْنَيْنِ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 1602 )‏، ومسلم ( 1264 )‏ ضمن حديث ولفظ البخاري: أمرهم أن يرملوا الأشواط الثلاثة، وأن يمشوا بين الركنين.‏ ولفظ مسلم: أمرهم أن يرملوا ثلاثا، ويمشوا أربعا.‏","english":{"narrator":"","text":"Ibn 'Abbas (RAA) narrated that the Messenger of Allah (ﷺ) commanded them to trot for three circuits and walk (with a normal pace) for four circuits, between the two corners (The Black Stone and the Yemeni corner). Agreed upon."}},{"id":42,"idInBook":42,"chapterId":6,"bookId":17,"arabic":"وَعَنْهُ قَالَ: { لَمْ أَرَ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَسْتَلِمُ مِنْ اَلْبَيْتِ غَيْرَ اَلرُّكْنَيْنِ اَلْيَمَانِيَيْنِ }  رَوَاهُ مُسْلِمٌ  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم ( 1269 )‏ إلا أنه ليس فيه لفظ: \" من البيت \".‏","english":{"narrator":"Ibn ’Abbas (RAA) narrated, ‘l never saw the Prophet (ﷺ) touch (place his hands on) any other part of the Ka'bah except the two corners:","text":"The Black Stone and the Yemeni corner) Related by Muslim."}},{"id":43,"idInBook":43,"chapterId":6,"bookId":17,"arabic":"وَعَنْ عُمَرَ ‏- رضى الله عنه ‏- { أَنَّهُ قَبَّلَ اَلْحَجَرَ  فَقَالَ: إِنِّي أَعْلَمُ أَنَّكَ حَجَرٌ لَا تَضُرُّ وَلَا تَنْفَعُ, وَلَوْلَا أَنِّي رَأَيْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يُقَبِّلُكَ مَا قَبَّلْتُكَ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 1597 )‏، ومسلم ( 1270 )‏، واللفظ للبخاري.‏","english":{"narrator":"","text":"'Umar (RAA) narrated that he kissed the Black Stone and said, ‘I know that you are a stone and can neither benefit anyone nor harm anyone. Had I not seen Allah’s Messenger(ﷺ) kissing you, I would not have kissed you.’ Agreed upon."}},{"id":44,"idInBook":44,"chapterId":6,"bookId":17,"arabic":"وَعَنْ أَبِي اَلطُّفَيْلِ ‏- رضى الله عنه ‏- قَالَ: { رَأَيْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَطُوفُ بِالْبَيْتِ وَيَسْتَلِمُ اَلرُّكْنَ بِمِحْجَنٍ مَعَهُ, وَيُقْبِّلُ اَلْمِحْجَنَ }  رَوَاهُ مُسْلِمٌ  1‏ .‏‏1 ‏- حسن.‏ رواه مسلم ( 1275 )‏، والمحجن: عصا محنية الرأس.‏","english":{"narrator":"","text":"Abu At-Tufail (RAA) narrated, ‘l saw Allah’s Messenger (ﷺ) making Tawaf round the Ka'bah and he was touching the corner (of the Black Stone) with a stick that he had with him and then kissing the stick.’ Related by Muslim."}},{"id":45,"idInBook":45,"chapterId":6,"bookId":17,"arabic":"وَعَنْ يَعْلَى بْنَ أُمَيَّةَ ‏- رضى الله عنه ‏- قَالَ: { طَافَ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-مُضْطَبِعًا بِبُرْدٍ أَخْضَرَ }  رَوَاهُ اَلْخَمْسَةُ إِلَّا النَّسَائِيَّ, وَصَحَّحَهُ اَلتِّرْمِذِيُّ  1‏ .‏‏1 ‏- صحيح.‏ رواه أبو داود ( 1883 )‏، والترمذي ( 859 )‏، وابن ماجه ( 2954 )‏، وأحمد ( 4 / 223 و 224 )‏.‏ وقال الترمذي: حسن صحيح.‏ قلت: وله شاهد، وقد خرجته في \" الأصل \" مع بيان لطرق وألفاظ حديث الباب.‏","english":{"narrator":"","text":"Ya'li bin Umaiyah (RAA) narrated, The Messenger of Allah (ﷺ) made the Tawaf while wearing a green Yemeni mantle, bringing it up from under his right armpit while covering the left shoulder.’ Related by the five Imams except for An-Nasa’i. At-Tirmidhi graded it as Sahih"}},{"id":46,"idInBook":46,"chapterId":6,"bookId":17,"arabic":"وَعَنْ أَنَسٍ ‏- رضى الله عنه ‏- قَالَ: { كَانَ يُهِلُّ مِنَّا اَلْمُهِلُّ فَلَا يُنْكِرُ عَلَيْهِ, وَيُكَبِّرُ   1‏ اَلْمُكَبِّرُ فَلَا يُنْكِرُ عَلَيْهِ }  مُتَّفَقٌ عَلَيْهِ  2‏ .‏‏1 ‏- غير موجودة \" بالأصلين \"، وهي في \" الصحيحين \".‏‏2 ‏- صحيح.‏ رواه البخاري ( 1659 )‏، ومسلم ( 1285 )‏، من طريق محمد بن أبي بكر الثقفي؛ أنه سأل أنس بن مالك، وهما غاديان من منى إلى عرفة: كيف كنتم تصنعون في هذا اليوم مع رسول الله صلى الله عليه وسلم؟ فقال: كان يهل.‏.‏.‏ الحديث.‏","english":{"narrator":"","text":"Anas (RAA) narrated, ‘When we assumed Ihram (for Hajj or 'Umrah) some of us raised their voices with Talbiyah and nobody objected to that, and others raised their voices with Takbir and no one objected to that (which means that saying Allahu Akbar ‘Allah is the Greatest’, or reciting the Talbiyah are both acceptable during Ihram).’ Agreed upon."}},{"id":47,"idInBook":47,"chapterId":6,"bookId":17,"arabic":"وَعَنْ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { بَعَثَنِي رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-فِي اَلثَّقَلِ, أَوْ قَالَ فِي اَلضَّعَفَةِ مِنْ جَمْعٍ  1‏ بِلَيْلٍ }   2‏ .‏‏1 ‏- أي: من مزدلفة.‏‏2 ‏- صحيح.‏ رواه البخاري ( 1856 )‏، ومسلم ( 1293 )‏ واللفظ لمسلم.‏","english":{"narrator":"","text":"Ibn ‘Abbas (RAA) narrated, ‘The Messenger of Allah (ﷺ) sent me at night from al-Muzdalifah (to Mina) with the weak members of his family (women and children).’ Agreed upon."}},{"id":48,"idInBook":48,"chapterId":6,"bookId":17,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: { اِسْتَأْذَنَتْ سَوْدَةُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-لَيْلَةَ اَلْمُزْدَلِفَةِ: أَنْ تَدْفَعَ قَبْلَهُ, وَكَانَتْ ثَبِطَةً ‏-تَعْنِي: ثَقِيلَةً‏- فَأَذِنَ لَهَا }  مُتَّفَقٌ عَلَيْهِمَا  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 1680 )‏، ومسلم ( 1290 )‏.‏","english":{"narrator":"","text":"A’ishah (RAA) narrated, ‘Saudah(the wife of the Prophet (ﷺ) asked his permission, on the night of al-Muzdalifah, to leave earlier (to Mina as she was a heavy and slow woman.’ The Prophet (ﷺ) gave her permission.’ Agreed upon."}},{"id":49,"idInBook":49,"chapterId":6,"bookId":17,"arabic":"وَعَنْ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: قَالَ لَنَا رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا تَرْمُوا اَلْجَمْرَةَ حَتَّى تَطْلُعَ اَلشَّمْسُ }  رَوَاهُ اَلْخَمْسَةُ إِلَّا النَّسَائِيَّ, وَفِيهِ اِنْقِطَاعٌ  1‏ .‏‏1 ‏- صحيح.‏ رواه أبو داود ( 1940 )‏، والنسائي ( 5 / 270 ‏- 272 )‏، وابن ماجه ( 3025 )‏، وأحمد ( 1 / 234 و 311 و 343 )‏، من طريق الحسن العرني، عن ابن عباس، به، إلا أن الحسن لم يسمع من ابن عباس، ومن أجل ذلك قال الحافظ هنا: \" فيه انقطاع \".‏ قلت: وبهذا التخريج تعلم وهم الحافظ في عزوه لهم إلا النسائي فإنه عنده.‏ ورواه الترمذي ( 893 )‏ بسند صحيح متصل من طريق مقسم عن ابن عباس.‏ وقال: \" حديث حسن صحيح \".‏ وبهذا يتبين لك أن قول الحافظ: \" وفيه انقطاع \" لا ينطبق على طريق الترمذي.‏ قلت: وللحديث طرق أخرى، وهي مخرجة \" بالأصل \" مما يجعل الواقف على الحديث لا يشك في صحته.‏ فائدة: سلم كلام الحافظ في \" الفتح \" ( 3 / 528 )‏ من المؤاخذات التي أوردتها هنا فقد أشار إلى طرقه وأيضا عزاه للنسائي، وقال: \" هو حديث حسن.‏.‏.‏ وهذه الطرق يقوى بعضها بعضا، ومن ثم صححه الترمذي وابن حبان \".‏","english":{"narrator":"","text":"Ibn 'Abbas (RAA) narrated, ‘The Messenger of Allah said to us, \"Do not throw the pebbles at Jamrah al-‘Aqabah until sunrise.” Related by the five Imams except An-Nasa’i, but with a disconnected chain of narrators."}},{"id":50,"idInBook":50,"chapterId":6,"bookId":17,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: { أَرْسَلَ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-بِأُمِّ سَلَمَةَ لَيْلَةَ اَلنَّحْرِ, فَرَمَتِ اَلْجَمْرَةَ قَبْلَ اَلْفَجْرِ, ثُمَّ مَضَتْ فَأَفَاضَتْ }  رَوَاهُ أَبُو دَاوُدَ, وَإِسْنَادُهُ عَلَى شَرْطِ مُسْلِمٍ  1‏ .‏‏1 ‏- منكر.‏ رواه أبو داود ( 1942 )‏ أنكره الإمام أحمد وغيره، وهو مقتضى القواعد العلمية الحديثة كما تجد مفصلا \" بالأصل \".‏","english":{"narrator":"","text":"A’ishah (RAA) narrated, ‘The Prophet sent Umm Salamah on the night of the 10th (before the day of the Sacrifice) and she threw her pebbles before dawn, after which she returned to Makkah to perform Tawaf.’’ Related by Abu Dawud."}},{"id":51,"idInBook":51,"chapterId":6,"bookId":17,"arabic":"وَعَنْ عُرْوَةَ بْنِ مُضَرِّسٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ شَهِدَ صَلَاتَنَا هَذِهِ ‏-يَعْنِي: بِالْمُزْدَلِفَةِ‏- فَوَقَفَ مَعَنَا حَتَّى نَدْفَعَ, وَقَدْ وَقَفَ بِعَرَفَةَ قَبْلَ ذَلِكَ لَيْلاً أَوْ نَهَارًا, فَقَدْ تَمَّ حَجُّهُ وَقَضَى تَفَثَهُ }  رَوَاهُ اَلْخَمْسَةُ, وَصَحَّحَهُ اَلتِّرْمِذِيُّ, وَابْنُ خُزَيْمَةَ  1‏ .‏‏1 ‏- صحيح.‏ رواه أبو داود ( 1950 )‏، والنسائي ( 5 / 263 )‏، والترمذي ( 891 )‏، وابن ماجه ( 3016 )‏، وأحمد ( 4 / 15 و 261 و 262 )‏، وابن خزيمة ( 2820 و 2821 )‏.‏ وقال الترمذي: \" هذا حديث حسن صحيح \".‏","english":{"narrator":"’Urwah bin Mudarras (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“Anyone who offered this prayer -at al-Muzdalifah- along with us, and waited with us until we returned to Mina, and he stayed at 'Arafat (on the 9th ) before that by night or day, he would have completed the prescribed duties of Hajj.\" Related by the five Imams. At-Tirmidhi and Ibn Khuzaimah graded it as Sahih."}},{"id":52,"idInBook":52,"chapterId":6,"bookId":17,"arabic":"وَعَنْ عُمَرَ ‏- رضى الله عنه ‏- قَالَ: { إِنَّ اَلْمُشْرِكِينَ كَانُوا لَا يُفِيضُونَ حَتَّى تَطْلُعَ اَلشَّمْسُ، وَيَقُولُونَ: أَشْرِقْ ثَبِيرُ  1‏ وَأَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-خَالَفَهُمْ, ثُمَّ أَفَاضَ قَبْلَ أَنْ تَطْلُعَ اَلشَّمْسُ }  رَوَاهُ اَلْبُخَارِيُّ  2‏ .‏‏1 ‏- ثبير: بفتح أوله وخفض ثانيه جبل معروف على يسار الذاهب إلى منى وهو أعظم جبال مكة.‏‏2 ‏- صحيح.‏ رواه البخاري ( 1684 )‏، عن عمرو بن ميمون، يقول: شهدت عمر رضي الله عنه صلى بجمع الصبح، ثم وقف، فقال: فذكره.‏","english":{"narrator":"","text":"'Umar (RAA) narrated, ‘The pagans did not use to depart from Muzdalifah until the sun had risen, and they would say, ‘Let the sun shine on Thabir (the highest mountain in Makkah). The Messenger of Allah (ﷺ) contradicted them and departed from Muzdalifah before sunrise.' Related by Al-Bukhari."}},{"id":53,"idInBook":53,"chapterId":6,"bookId":17,"arabic":"وَعَنْ اِبْنِ عَبَّاسٍ وَأُسَامَةَ بْنِ زَيْدٍ رَضِيَ اَللَّهُ عَنْهُمْ قَالَا: { لَمْ يَزَلِ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-يُلَبِّي حَتَّى رَمَى جَمْرَةَ اَلْعَقَبَةِ }  رَوَاهُ اَلْبُخَارِيُّ.‏  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 3 / 532 / فتح )‏.‏","english":{"narrator":"","text":"Ibn 'Abbas and Usamah bin Zaid (RAA) narrated, The Messenger of Allah (ﷺ) kept on reciting Talbiyah until he threw the pebbles at Jamrat-ul ‘Aqabah..’ Related by Al-Bukhari."}},{"id":54,"idInBook":54,"chapterId":6,"bookId":17,"arabic":"وَعَنْ عَبْدِ اَللَّهِ بْنِ مَسْعُودٍ ‏- رضى الله عنه ‏- { أَنَّهُ جَعَلَ اَلْبَيْتَ عَنْ يَسَارِهِ, وَمِنًى عَنْ يَمِينِهِ, وَرَمَى اَلْجَمْرَةَ بِسَبْعِ حَصَيَاتٍ  1‏ وَقَالَ: هَذَا مَقَامُ اَلَّذِي أُنْزِلَتْ عَلَيْهِ سُورَةُ اَلْبَقَرَةِ }  مُتَّفَقٌ عَلَيْهِ.‏  2‏ .‏‏1 ‏- تحرف في \" أ \" إلى: \" حصاة \".‏‏2 ‏- صحيح.‏ رواه البخاري ( 1749 )‏، ومسلم ( 1296 )‏ ( 307 )‏.‏","english":{"narrator":"","text":"'Abdullah bin Masud (RAA) narrated that he kept the Ka'bah on his left and Mina on his right and threw the seven pebbles of Jamrat-ul ‘Aqabah. He then said, ‘This is the location where the one on whom surah al-Baqarah. (surah no. 2) was revealed (i e. the Messenger of Allah (ﷺ)).’ Agreed upon."}},{"id":55,"idInBook":55,"chapterId":6,"bookId":17,"arabic":"وَعَنْ جَابِرٍ ‏- رضى الله عنه ‏- قَالَ: { رَمَى رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-اَلْجَمْرَةَ يَوْمَ اَلنَّحْرِ ضُحًى, وَأَمَّا بَعْدَ ذَلِكَ فَإِذَا زَادَتْ اَلشَّمْسُ }  رَوَاهُ مُسْلِمٌ  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم ( 1299 )‏ ( 314 )‏.‏ وفيه: \" وأما بعد، فإذا زالت الشمس \" برفع \" بعد \" ودون لفظ: \" ذلك \".‏","english":{"narrator":"","text":"Jabir bin 'Abdullah (RAA) narrated, ‘The Messenger of Allah (ﷺ) threw Jamrat—ul 'Aqabah on the Day of Sacrifice (the 9th of Dhul Hijjah) in the forenoon. On the following days he threw them when the sun had passed its meridian.’ Related by Muslim."}},{"id":56,"idInBook":56,"chapterId":6,"bookId":17,"arabic":"وَعَنْ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا { أَنَّهُ كَانَ يَرْمِي اَلْجَمْرَةَ اَلدُّنْيَا, بِسَبْعِ حَصَيَاتٍ, يُكَبِّرُ عَلَى أَثَرِ كُلِّ حَصَاةٍ, ثُمَّ يَتَقَدَّمُ, ثُمَّ يُسْهِلُ, فَيَقُومُ فَيَسْتَقْبِلُ اَلْقِبْلَةَ, فَيَقُومُ طَوِيلاً, وَيَدْعُو وَيَرْفَعُ يَدَيْهِ, ثُمَّ يَرْمِي اَلْوُسْطَى, ثُمَّ يَأْخُذُ ذَاتَ اَلشِّمَالِ فَيُسْهِلُ, وَيَقُومُ مُسْتَقْبِلَ اَلْقِبْلَةِ, ثُمَّ يَدْعُو فَيَرْفَعُ يَدَيْهِ وَيَقُومُ طَوِيلاً, ثُمَّ يَرْمِي جَمْرَةَ ذَاتِ اَلْعَقَبَةِ مِنْ بَطْنِ اَلْوَادِي وَلَا يَقِفُ عِنْدَهَا, ثُمَّ يَنْصَرِفُ, فَيَقُولُ: هَكَذَا رَأَيْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَفْعَلُهُ }  رَوَاهُ اَلْبُخَارِيُّ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 1751 )‏.‏","english":{"narrator":"","text":"Ibn 'Umar (RAA) narrated that he used to throw the pebbles of al-Jamrat ud-Duniya (the Jamrah near to the Khaif mosque) with seven small pebbles, and would recite Takbir when throwing each pebble. Then he would go ahead until he reached the bottom of the valley, where he would stand for quite a long time facing the direction of the Qiblah, and raising his hands, while supplicating Allah. Then he went and threw seven pebbles at the second Jamrah(al-Jamarah al·Wosta) while saying Allahu Akbar with each throw. He would then turn to the left of the bottom of the valley, stand there facing the Qiblah and supplicating to Allah with his hands raised. Then he went to Jamrat-ul Aqabah, threw seven pebbles at it, uttering the Takbir with each throw. After that he left and did not pause. He would then say, ‘I saw the Prophet (ﷺ) doing like this.’ Related by Al-Bukhari."}},{"id":57,"idInBook":57,"chapterId":6,"bookId":17,"arabic":"وَعَنْـ   ; 1‏ { أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: \" اَللَّهُمَّ ارْحَمِ اَلْمُحَلِّقِينَ \" قَالُوا: وَالْمُقَصِّرِينَ يَا رَسُولَ اَللَّهِ.‏ قَالَ فِي اَلثَّالِثَةِ: \" وَالْمُقَصِّرِينَ \" }  مُتَّفَقٌ عَلَيْهِ  2‏ .‏‏1 ‏- والزيادة سقطت من \" أ \".‏‏2 ‏- صحيح.‏ رواه البخاري ( 1727 )‏، ومسلم ( 1301 )‏.‏","english":{"narrator":"Ibn ’Umar (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"“May Allah bless those who shaved.\" The Companions asked him, ‘O Allah’s Messenger, what about those who cut their hair short?’ They repeated their question twice (and each time he repeated his saying, ‘May Allah bless those who shaved.’) On the third time, the Messenger of Allah (ﷺ) then said, “And (may Allah bless) those who cut their hair short.\" Agreed upon."}},{"id":58,"idInBook":58,"chapterId":6,"bookId":17,"arabic":"وَعَنْ عَبْدِ اَللَّهِ بْنِ عَمْرِوِ بْنِ اَلْعَاصِ رَضِيَ اَللَّهُ عَنْهُمَا { أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-وَقَفَ فِي حَجَّةِ اَلْوَدَاعِ, فَجَعَلُوا يَسْأَلُونَهُ, فَقَالَ رَجُلٌ: لَمْ أَشْعُرْ, فَحَلَقْتُ قَبْلَ أَنْ أَذْبَحَ.‏ قَالَ: \" اِذْبَحْ وَلَا حَرَجَ \" فَجَاءَ آخَرُ, فَقَالَ: لَمْ أَشْعُرْ, فَنَحَرْتُ قَبْلَ أَنْ أَرْمِيَ, قَالَ: \" اِرْمِ وَلَا حَرَجَ \" فَمَا سُئِلَ يَوْمَئِذٍ عَنْ شَيْءٍ قُدِّمَ وَلَا أُخِّرَ إِلَّا قَالَ: \" اِفْعَلْ وَلَا حَرَجَ \" }  مُتَّفَقٌ عَلَيْهِ.‏  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 83 )‏، ومسلم ( 1306 )‏.‏","english":{"narrator":"'Abdullah Ibn ‘Amro bin al-’As (RAA) narrated that the Messenger of Allah (ﷺ) stood in Mina during the Farewell Hajj, while the people asked him questions and he answered them. A man asked, ‘O Prophet of Allah! I was not alert and I shaved my head before slaughtering my animal?’ The Prophet (ﷺ) said:","text":"“There is no harm, go and slaughter your animal.\" Another man asked, ‘l slaughtered the animal before I threw the pebbles? Prophet (ﷺ) said: “There is no harm, go and throw your pebbles.\" The narrator said: \"Whoever asked the Prophet (ﷺ) about anything done before or after the other he told him \"No harm done. Go and do (whatever you missed).\" Agreed upon."}},{"id":59,"idInBook":59,"chapterId":6,"bookId":17,"arabic":"وَعَنْ اَلْمِسْوَرِ بْنِ مَخْرَمَةَ رَضِيَ اَللَّهُ عَنْهُمَا { أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-نَحَرَ قَبْلَ أَنْ يَحْلِقَ, وَأَمَرَ أَصْحَابَهُ بِذَلِكَ }  رَوَاهُ اَلْبُخَارِيُّ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 1811 )‏.‏","english":{"narrator":"","text":"Al-Maisur bin Makhramah (RAA) narrated, ‘The Messenger of Allah (ﷺ) sacrificed his animal before he shaved and commanded his companions to do so.’ Related by Al-Bukhari."}},{"id":60,"idInBook":60,"chapterId":6,"bookId":17,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِذَا رَمَيْتُمْ وَحَلَقْتُمْ فَقَدَ حَلَّ لَكُمْ اَلطِّيبُ وَكُلُّ شَيْءٍ إِلَّا اَلنِّسَاءَ }  رَوَاهُ أَحْمَدُ, وَأَبُو دَاوُدَ, وَفِي إِسْنَادِهِ ضَعْفٌ  1‏ .‏‏1 ‏- منكر بهذا اللفظ.‏ وهذا لفظ أحمد ( 6 / 143 )‏ وزاد: \" والثياب \".‏ ورواه من نفس الطريق الدارقطني ( 2 / 276 )‏، والبيهقي في \" السنن الكبرى \" ( 5 / 136 )‏، وعندهما زيادة: \" وذبحتم \".‏ قلت: وآفة الحديث الحجاج بن أرطاة، فهو كثير الخطأ مدلس، ولذلك قال البيهقي: \" وهذا من تخليطات الحجاج بن أرطأة \".‏ قلت: ورواه أبو داود ( 1978 )‏ ‏-وفي سنده الحجاج أيضا‏- بلفظ: \" إذا رمى أحدكم جمرة العقبة فقد حل له كل شيء إلا النساء \".‏ وهو بهذا اللفظ صحيح، إذ له شاهد عن عائشة بسند صحيح عن أحمد ( 6 / 244 )‏، ولفظه: \" طيبت رسول الله صلى الله عليه وسلم بيدي بذريرة لحجة الوداع للحل والإحرام: حين أحرم، وحين رمى جمرة العقبة يوم النحر قبل أن يطوف بالبيت \".‏ وله شاهد آخر عند أحمد ( 2090 )‏، وغيره من حديث ابن عباس ‏-ولفظه كلفظ أبي داود‏- ورجاله ثقات إلا أن فيه انقطاعا، واختلف في رفعه ووقفه.‏ وخلاصة الأمر أن الحديث صحيح بدون ذكر الحلق والذبح، وبهذا يكون الحل من كل شيء إلا النساء بعد رمي جمرة العقبة فقط عملا بهذا الدليل الصحيح، وهو أيضا قول جماعة من السلف كعائشة وابن الزبير، وعلقمة وغيرهم.‏ \" تنبيه \": وأما ما يفتي به بعض الناس، ويملئون به آذان الناس أيام الحج من أن التحلل لا يكون إلا بعد فعل اثنين من ثلاثة ‏-رمي جمرة العقبة، والحلق أو التقصير، وطواف الإفاضة‏- فيلزمهم أن يتركوا مذهبهم إلى الدليل الصحيح.‏ فإن قالوا: إنما نتبع الدليل، ويريدون بذلك حديث الباب بزيادته المنكرة.‏ قلنا: ولم أخرجتم الذبح، وقد جاء في الحديث؟! خاصة وقد قال به الإمام أحمد رحمه الله كما في \" مسائل صالح \".‏ ( 3 / 103 / 1431 )‏ إذ قال: \" قلت: المحرم إذا رمى وحلق وذبح قبل أن يطوف البيت أله أن يصيد في غير المحرم؟ قال: نعم.‏ أليس قال النبي صلى الله عليه وسلم: \" إذا حلقتم وذبحتم فقد حل لكم كل شيء \" فهل هم قائلون بذلك؟ لا أظن.‏","english":{"narrator":"A’ishah (RAA) narrated, The Messenger of Allah (ﷺ) said:","text":"\"When one of you threw the pebbles and shaved his hair, everything including perfume becomes lawful for him except women (i.e. sexual intercourse).” Related by Ahmad and Abu Dawud with a weak chain of narrators."}},{"id":61,"idInBook":61,"chapterId":6,"bookId":17,"arabic":"وَعَنِ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا, عَنِ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { لَيْسَ عَلَى اَلنِّسَاءِ حَلْقٌ, وَإِنَّمَا يُقَصِّرْنَ }  رَوَاهُ أَبُو دَاوُدَ بِإِسْنَادٍ حَسَنٍ  1‏ .‏‏1 ‏- حسن.‏ رواه أبو داود ( 1985 )‏، وقواه أبو حاتم في \" العلل \" ( 1 / 281 / 1431 )‏.‏","english":{"narrator":"Ibn Abbas (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"\"Women (pilgrims) do not have to shave (their heads); they may only shorten their hair.\" Related by Abu Dawud with a good chain of narrators."}},{"id":62,"idInBook":62,"chapterId":6,"bookId":17,"arabic":"وَعَنِ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا: { أَنَّ اَلْعَبَّاسَ بْنَ عَبْدِ اَلْمُطَّلِبِ ‏- رضى الله عنه ‏- اِسْتَأْذَنَ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-أَنْ يَبِيتَ بِمَكَّةَ لَيَالِيَ مِنًى, مِنْ أَجْلِ سِقَايَتِهِ, فَأَذِنَ لَهُ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 1634 )‏، ومسلم ( 1315 )‏.‏","english":{"narrator":"","text":"Ibn ‘Umar (RAA) narrated that ‘Al-’Abbas bin 'Abdul Muttalib asked permission from the Prophet (ﷺ) to stay at Makkah during the nights of Mina in order to provide drinking water (from Zamzam) to the pilgrims, and the Prophet (ﷺ) allowed him.’ Agreed Upon."}},{"id":63,"idInBook":63,"chapterId":6,"bookId":17,"arabic":"وَعَنْ عَاصِمِ بْنِ عَدِيٍّ ‏- رضى الله عنه ‏- { أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-أَرْخَصَ لِرُعَاة اَلْإِبِلِ فِي اَلْبَيْتُوتَةِ عَنْ مِنًى, يَرْمُونَ يَوْمَ اَلنَّحْرِ, ثُمَّ يَرْمُونَ اَلْغَدِ لِيَوْمَيْنِ, ثُمَّ يَرْمُونَ يَوْمَ اَلنَّفْرِ }  رَوَاهُ اَلْخَمْسَةُ, وَصَحَّحَهُ اَلتِّرْمِذِيُّ, وَابْنُ حِبَّانَ  1‏ .‏‏1 ‏- صحيح.‏ رواه أبو داود ( 1975 )‏، والنسائي ( 5 / 273 )‏، والترمذي ( 955 )‏، وابن ماجه ( 3037 )‏، وأحمد ( 4 / 450 )‏، وابن حبان ( 1015 موارد )‏.‏ وقال الترمذي: حسن صحيح.‏","english":{"narrator":"","text":"‘Asim bin ‘Adi (RAA) narrated that the Messenger of Allah (ﷺ) excused the herdsmen of camels from sleeping at Mina and asked them to throw pebbles on the day of sacrifice (i.e. throw Jamrat-ul ‘Aqabah and they do not have to spend the night at Mina), and then to throw the pebbles of the next day and the day after (i.e. of the 11th and the 12th combined (on the 12th ), and then throw pebbles again on the 13th Related by the five Imams. At-Tirmidhi and Ibn Hibban graded it as Sahih."}},{"id":64,"idInBook":64,"chapterId":6,"bookId":17,"arabic":"وَعَنْ أَبِي بِكْرَةَ ‏- رضى الله عنه ‏- قَالَ: { خَطَبَنَا رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَوْمَ اَلنَّحْرِ.‏.‏.‏ }  اَلْحَدِيثَ.‏ مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 1741 )‏، ومسلم ( 1679 )‏، وتمامه قال: \" أتدرون أي يوم هذا؟ قلنا: الله ورسوله أعلم.‏ فسكت حتى ظننا أنه سيسميه بغير اسمه، قال: أليس يوم النحر؟ قلنا: بلى.‏ قال: أي شهر هذا؟ قلنا: الله ورسوله أعلم.‏ فسكت حتى ظننا أنه سيسميه بغير اسمه، فقال: أليس ذو الحجة ؟ قلنا بلى.‏ قال: أي بلد هذا؟ قلنا: الله ورسوله أعلم، فسكت حتى ظننا أنه سيسميه بغير اسمه.‏ قال: أليست بالبلدة الحرام؟ قلنا: بلى.‏ قال: فإن دماءكم وأموالكم عليكم حرام كحرمة يومكم هذا في شهركم هذا في بلدكم هذا إلى يوم تلقون ربكم، ألا هل بلغت؟ قالوا: نعم.‏ قال: اللهم اشهد، فليبلغ الشاهد الغائب فرب مبلغ أوعى من سامع، فلا ترجعوا بعدي كفارا يضرب بعضكم رقاب بعض \".‏ والسياق للبخاري.‏","english":{"narrator":"","text":"Abu Bakrah (RAA) narrated that the Messenger of Allah (ﷺ) delivered a sermon to us on the Day of Nahr (sacrifice) (and the narrator mentioned the sermon.).’ Agreed upon."}},{"id":65,"idInBook":65,"chapterId":6,"bookId":17,"arabic":"وَعَنْ سَرَّاءَ بِنْتِ نَبْهَانَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: { خَطَبَنَا رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَوْمَ اَلرُّءُوسِ فَقَالَ: \n\" أَلَيْسَ هَذَا أَوْسَطَ أَيَّامِ اَلتَّشْرِيقِ ? \" }  اَلْحَدِيثَ رَوَاهُ أَبُو دَاوُدَ بِإِسْنَادٍ حَسَنٍ  1‏ .‏‏1 ‏- ضعيف .‏ رواه أبو داود ( 1953 )‏، وفي سنده ربيعة بن عبد الرحمن قال عنه الحافظ نفسه \" مقبول \".‏ قلت: أي حيث يتابع، وإلا فلين الحديث.‏ كما نص عليه في مقدمة: \" التقريب \".‏","english":{"narrator":"","text":"Sarra’ bint Nabhan (RAA) narrated ‘The Messenger of Allah (ﷺ) delivered a sermon to us on the second day of sacrifice, ‘Yaum ar-Ru’us’ (11th of Dhul -Hijjah) and said, \"Is this not the middle of the days of Tashriq?” Related by Abu Dawud."}},{"id":66,"idInBook":66,"chapterId":6,"bookId":17,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَالَ لَهَا: { طَوَافُكِ بِالْبَيْتِ وَبَيْنَ اَلصَّفَا وَاَلْمَرْوَةِ يَكْفِيكَ لِحَجِّكِ وَعُمْرَتِكِ }  رَوَاهُ مُسْلِمٌ  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم ( 2 / 879 / 132 )‏، ولكن بلفظ: \" يسعك طوافك لحجك وعمرتك \".‏ وعنده رواية أخرى تالية لهذه، بلفظ: \" يجزئ عنك طوافك بالصفا والمروة عن حجك وعمرتك \" وأما اللفظ الذي ذكره الحافظ، فهو لأبي داود ( 1897 )‏ وأعله أبو حاتم في \" العلل \" ( 1 / 294 / 880 )‏.‏ \" فائدة \": قال شيخنا في \" الصحيحة \" ( 4 / 638 ‏- 639 )‏: \" العمرة بعد الحج إنما هي للحائض التي لم تتمكن من الإتيان بعمرة الحج بين يدي الحج، لأنها حاضت، كما علمت من قصة عائشة هذه، فمثلها من النساء إذا أهلت بعمرة الحج كما فعلت هي رضي الله عنها، ثم حال بينها وبين إتمامها الحيض، فهذه يشرع لها العمرة بعد الحج، فما يفعله اليوم جماهير الحجاج من تهافتهم على العمرة بعد الحج، مما لا نراه مشروعا؛ لأن أحدا من الصحابة الذين حجوا معه صلى الله عليه وسلم لم يفعلها، بل إنني أرى أن هذا من تشبه الرجال بالنساء، بل الحيض منهن! ولذلك جريت على تسمية العمرة بـ ( عمرة الحائض )‏ بيانا للحقيقة \".‏","english":{"narrator":"","text":"A’ishah (RAA) narrated, ‘The Messenger of Allah (ﷺ) said to her, “Your Tawaf by the Ka'bah and your Sa'i between Safa and Marwah is sufficient for both your Hajj and 'Umrah (i.e. one Tawaf and one Sa’i are sufficient as she combined Hajj and 'Umrah.)’ Related by Muslim."}},{"id":67,"idInBook":67,"chapterId":6,"bookId":17,"arabic":"وَعَنِ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا; أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-{ لَمْ يَرْمُلْ فِي اَلسَّبْعِ اَلَّذِي أَفَاضَ فِيهِ }  رَوَاهُ اَلْخَمْسَةُ إِلَّا اَلتِّرْمِذِيَّ, وَصَحَّحَهُ اَلْحَاكِمُ.‏  1‏ .‏‏1 ‏- ضعيف.‏ رواه أبو داود ( 2001 )‏، والنسائي في \" الكبرى \" ( 2 / 460 ‏- 461 )‏، وابن ماجه ( 3060 )‏، والحاكم ( 1 / 475 )‏، وفي سنده ابن جريج، وهو مدلس، وقد عنعنه، وأما عزوه \" للمسند \" فما أظنه إلا وهما، إذ لم أجده فيه، ولا ذكره الحافظ نفسه في \" الأطراف \" وفي تخريجه للحديث في \" التلخيص \" نسبة لمن نسبه لهم هنا إلا أحمد.‏ فالله أعلم.‏","english":{"narrator":"","text":"Ibn 'Abbas (RAA) narrated that the Messenger of Allah (ﷺ) did not trot during the seven circuits made in the final Tawaf when he returned to Makkah.’ Related by the five Imams except at-Tirmidhi. Al-Hakim graded it as Sahih."}},{"id":68,"idInBook":68,"chapterId":6,"bookId":17,"arabic":"وَعَنْ أَنَسٍ ‏- رضى الله عنه ‏- { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-صَلَّى اَلظُّهْرَ وَالْعَصْرَ وَالْمَغْرِبَ وَالْعِشَاءَ, ثُمَّ رَقَدَ رَقْدَةً بِالْمُحَصَّبِ, ثُمَّ رَكِبَ إِلَى اَلْبَيْتِ فَطَافَ بِهِ }  رَوَاهُ اَلْبُخَارِيُّ.‏  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 1764 )‏.‏","english":{"narrator":"","text":"Anas (RAA), narrated, 'The Messenger of Allah rested for a while at al-Muhassab (a valley opening at al-Abtah between Makkah and Mina) prayed Dhuhr, Asr, Maghrib and 'Isha prayers after which he rode to the Ka’bah and made Tawaf.’ Related by Al·Bukhari."}},{"id":69,"idInBook":69,"chapterId":6,"bookId":17,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا: { أَنَّهَا لَمْ تَكُنْ تَفْعَلُ ذَلِكَ ‏-أَيْ: اَلنُّزُولَ بِالْأَبْطَحِ‏- وَتَقُولُ : إِنَّمَا نَزَلَهُ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-لِأَنَّهُ كَانَ مَنْزِلاً أَسْمَحَ لِخُرُوجِهِ }  رَوَاهُ مُسْلِمٌ  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم ( 1311 )‏، وأقول: رواه البخاري أيضا ( 1765 )‏، عن عائشة، قالت : \" إنما كان منزله ينزله النبي صلى الله عليه وسلم ليكون أسمح لخروجه.‏ يعني: الأبطح\".‏ وفي مثل هذا يقول الحافظ: \" متفق عليه، واللفظ لمسلم \".‏","english":{"narrator":"","text":"A’ishah (RAA) narrated that she did not use to do that i.e. rest at al-Muhassab and said, ‘The Messenger of Allah (ﷺ) rested at al-Muhassab, because it was easier to stop there and depart from (i.e. it is not a Sunnah to rest there`). Related by Muslim."}},{"id":70,"idInBook":70,"chapterId":6,"bookId":17,"arabic":"وَعَنْ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { أُمِرَ اَلنَّاسُ أَنْ يَكُونَ آخِرَ عَهْدِهِمْ بِالْبَيْتِ, إِلَّا أَنَّهُ خَفَّفَ عَنِ الْحَائِضِ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 1755 )‏، ومسلم ( 1328 )‏ ( 380 )‏.‏","english":{"narrator":"","text":"Ibn 'Abbas (RAA) narrated, ‘People were commanded to make the Tawaf round the Ka’bah their last rite;(Farewell Tawaf but the menstruating women were excused from it.’ Agreed upon."}},{"id":71,"idInBook":71,"chapterId":6,"bookId":17,"arabic":"وَعَنِ اِبْنِ اَلزُّبَيْرِ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ صَلَاةٌ فِي مَسْجِدِي هَذَا أَفْضَلُ مِنْ أَلْفِ صَلَاةٍ فِيمَا سِوَاهُ إِلَّا اَلْمَسْجِدَ اَلْحَرَامَ , وَصَلَاةٌ فِي اَلْمَسْجِدِ اَلْحَرَامِ أَفْضَلُ مِنْ صَلَاةٍ فِي مَسْجِدِي بِمِائَةِ صَلَاةٍ }  رَوَاهُ أَحْمَدُ, وَصَحَّحَهُ اِبْنُ حِبَّانَ  1‏ .‏‏1 ‏- صحيح.‏ رواه أحمد ( 4 / 5 )‏، وابن حبان ( 1620 )‏.‏","english":{"narrator":"Ibn Az-Zubair (RAA) narrated that the Messenger of Allah (ﷺ) said:","text":"\"Offering prayer in my mosque (in Madinah) is better than one thousand prayers elsewhere, save for those offered prayer in al-Masjid al-Haram (in Makkah). And prayer offered in al-Masjid al-Haram is better than prayer offered in my mosque by one hundred prayers.\" Related by Ahmad and Ibn Hibban graded it as Sahih."}},{"id":72,"idInBook":72,"chapterId":6,"bookId":17,"arabic":"عَنِ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { قَدْ أُحْصِرَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-فَحَلَقَ  1‏ وَجَامَعَ نِسَاءَهُ, وَنَحَرَ هَدْيَهُ, حَتَّى اِعْتَمَرَ عَامًا قَابِلًا }  رَوَاهُ اَلْبُخَارِيُّ  2‏ .‏‏1 ‏- زاد البخاري: \" رأسه \".‏‏2 ‏- صحيح.‏ رواه البخاري ( 1809 )‏، وقال الحافظ في \" الفتح \" ( 4 / 7 )‏: قرأت في: \" كتاب الصحابة \" لابن السكن قال: حدثني هارون بن عيسى، حدثنا محمد بن إسحاق، حدثنا يحيى بن صالح، حدثنا معاوية بن سلام، عن يحيى بن أبي كثير، قال: سألت عكرمة، فقال: قال عبد الله بن رافع مولى أم سلمة أنها سألت الحجاج بن عمرو الأنصاري عمن حبس وهو محرم، فقال: قال رسول الله صلى الله عليه وسلم: \" من عرج أو كسر أو حبس فليجزئ مثلها وهو في حل قال: فحدثت به أبا هريرة فقال: صدق.‏ وحدثته ابن عباس، فقال: قد أحصر رسول الله صلى الله عليه وسلم فحلق، ونحر هديه، وجامع نساءه حتى اعتمر عاما قابلا .‏ نعرف بهذا السياق القدر الذي حذفه البخاري من هذا الحديث، والسبب في حذفه أن الزائد ليس على شرطه .‏ .‏ .‏ مع أن الذي حذفه ليس بعيدا من الصحة \".‏","english":{"narrator":"","text":"Ibn ‘Abbas (RAA) narrated, ‘When the Prophet (ﷺ) was prevented from performing ‘Umrah (by Quraish) he shaved his head, had intercourse with his wives and slaughtered his animal. The next year he performed ‘Umrah to make up for the year that he had missed.’ Related by Al-Bukhari."}},{"id":73,"idInBook":73,"chapterId":6,"bookId":17,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: { دَخَلَ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-عَلَى ضُبَاعَةَ بِنْتِ اَلزُّبَيْرِ بْنِ عَبْدِ اَلْمُطَّلِبِ رَضِيَ اَللَّهُ عَنْهَا, فَقَالَتْ: يَا رَسُولَ اَللَّهِ! إِنِّي أُرِيدُ اَلْحَجَّ, وَأَنَا شَاكِيَةٌ، فَقَالَ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-\n\" حُجِّي وَاشْتَرِطِي: أَنَّ مَحَلِّي  1‏ حَيْثُ حَبَسْتَنِي \" }  مُتَّفَقٌ عَلَيْهِ.‏  2‏ .‏‏1 ‏- أي : تحللي من الإحرام.‏‏2 ‏- صحيح.‏ رواه البخاري ( 5089 )‏، ومسلم ( 1207 )‏.‏","english":{"narrator":"","text":"A’ishah (RAA) narrated, 'The Messenger of Allah (ﷺ) went to visit. Duba’ah bint Az-Zubair bin 'Abdul Muttalib. She said to him, ‘O Messenger of Allah I have made the intention to perform Hajj but I am suffering from an illness.’ He said to her, “Perform Hajj but set a condition that you shall be relieved of the Ihram whenever you are prevented (due to illness, etc.).” Agreed upon."}},{"id":74,"idInBook":74,"chapterId":6,"bookId":17,"arabic":"وَعَنْ عِكْرِمَةَ, عَنْ اَلْحَجَّاجِ بْنِ عَمْرٍو اَلْأَنْصَارِيِّ ‏- رضى الله عنه ‏- قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ كُسِرَ, أَوْ عُرِجَ, فَقَدَ حَلَّ وَعَلَيْهِ اَلْحَجُّ مِنْ قَابِلٍ قَالَ عِكْرِمَةُ.‏ فَسَأَلْتُ اِبْنَ عَبَّاسٍ وَأَبَا هُرَيْرَةَ عَنْ ذَلِكَ? فَقَالَا: صَدَقَ }  رَوَاهُ اَلْخَمْسَةُ, وَحَسَّنَهُ اَلتِّرْمِذِيُّ  1‏ .‏‏1 ‏- صحيح.‏ رواه أبو داود ( 1862 )‏، والنسائي ( 5 / 198 ‏- 199 )‏، والترمذي ( 940 )‏، وابن ماجه ( 3077 )‏، وأحمد ( 3 / 450 )‏ ، وعند بعضهم: \" وعليه حجة أخرى \" وزاد أبو داود في رواية: \" أو مرض \".‏ وقال الترمذي: \" حديث حسن صحيح \".‏ قلت: وأعل هذا الحديث بما لا يقدح، كما هو مذكور \" بالأصل \".‏ قال البغوي في \" شرح السنة \" ( 7 / 288 )‏: \" وتأوله بعضهم على أنه إنما يحل بالكسر والعرج إذا كان قد شرط ذلك في عقد الإحرام على معنى حديث ضباعة بنت الزبير \".‏","english":{"narrator":"'Ikrimah narrated on the authority of Al-Hajjaj bin ’Amro al-Ansari (RAA), that the Messenger of Allah (ﷺ) said:","text":"\"If anyone breaks (a leg) or becomes lame (while he was performing Hajj or 'Umrah) he is released from him Ihram and must perform Hajj the next year.’ ’lkrimah said, ‘l asked Ibn 'Abbas and Abu Hurairah about this statement of Al-Hajjaj and they said that he had spoken the truth. Related by the five Imams. At-Tirmidhi graded it as Hasan."}}],"chapter":{"id":6,"bookId":17,"arabic":"كتاب الحج","english":"Hajj"}}