{"metadata":{"length":233,"arabic":{"title":"بلوغ المرام","author":"الإمام ابن حجر العسقلاني","introduction":"كتاب البيوع"},"english":{"title":"Bulugh al-Maram","author":"Ibn Hajar al-Asqalani","introduction":"Business Transactions"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":7,"bookId":17,"arabic":"عَنْ رِفَاعَةَ بْنِ رَافِعٍ ‏- رضى الله عنه ‏- أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-سُئِلَ: أَيُّ اَلْكَسْبِ أَطْيَبُ? قَالَ: { عَمَلُ اَلرَّجُلِ بِيَدِهِ, وَكُلُّ بَيْعٍ مَبْرُورٍ }  رَوَاهُ اَلْبَزَّارُ، وَصَحَّحَهُ اَلْحَاكِمُ.‏  1‏ .‏‏1 ‏- صحيح.‏ رواه البزار ( 2 / 83 / كشف الأستار )‏، الحاكم ( 2 / 10 )‏.‏ قلت: وقد اختلف في إسناده، وأيضا اختلف في وصله وإرساله، فرجح بعضهم الإرسال.‏ قلت: ولكن للحديث شواهد منها ما رواه الطبراني في \" الأوسط \" ( 1944 / مجمع )‏ من حديث ابن عمر بسند لا بأس به.‏","english":{"narrator":"Narrated Rifa'a bin Rafi' (RA):","text":"The Prophet (ﷺ) was asked, 'What type of earning is best?' He replied, \"A man's work with his hand and every transaction which is free from cheating or deception.\"\n\n."}},{"id":2,"idInBook":2,"chapterId":7,"bookId":17,"arabic":"وَعَنْ جَابِرِ بْنِ عَبْدِ اَللَّهِ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏-; أَنَّهُ سَمِعَ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ عَامَ اَلْفَتْحِ, وَهُوَ بِمَكَّةَ: { إِنَّ اَللَّهَ وَرَسُولَهُ حَرَّمَ بَيْعَ اَلْخَمْرِ, وَالْمَيْتَةِ, وَالْخِنْزِيرِ, وَالْأَصْنَامِ.‏\nفَقِيلَ: يَا رَسُولَ اَللَّهِ ! أَرَأَيْتَ شُحُومَ اَلْمَيْتَةِ, فَإِنَّهُ تُطْلَى  1‏ بِهَا اَلسُّفُنُ, وَتُدْهَنُ بِهَا اَلْجُلُودُ, وَيَسْتَصْبِحُ بِهَا اَلنَّاسُ? \nفَقَالَ: \" لَا.‏ هُوَ حَرَامٌ \", ثُمَّ قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-عِنْدَ ذَلِكَ: \" قَاتَلَ اَللَّهُ اَلْيَهُودَ, إِنَّ اَللَّهَ لَمَّا حَرَّمَ عَلَيْهِمْ شُحُومَهَا جَمَلُوهُ, ثُمَّ بَاعُوهُ, فَأَكَلُوا ثَمَنَهُ }  مُتَّفَقٌ عَلَيْهِ  2‏ .‏‏1 ‏- كذا \" بالأصلين \"، بالمثناة الفوقية، وفي \" الصحيحين \": يطلى.‏ بالياء المثناة من تحت.‏\n\n‏2 ‏- صحيح.‏ رواه البخاري ( 2236 )‏، ومسلم ( 1581 )‏، وجملوه، أذابوه.‏","english":{"narrator":"Narrated Jabir bin 'Abdullah (RA):","text":"I heard Allah's Messenger (ﷺ) saying in the year of the Conquest, while he was in Makkah, \"Allah and His Messenger have forbidden the sale of intoxicants, dead animals, swine and idols.\" He was asked, \"O Allah's Messenger, what about the fat of a dead animal, for it is used for greasing ships, greasing the hides (of animals), and making oils for lamps?\" He replied, \"No, it is unlawful.\" Allah's Messenger (ﷺ) then added: \"May Allah curse the Jews, when Allah the Most High declared the fat of such animals unlawful they melted it, then sold it and devoured its price (profit).\"\n\n."}},{"id":3,"idInBook":3,"chapterId":7,"bookId":17,"arabic":"وَعَنْ اِبْنِ مَسْعُودٍ ‏- رضى الله عنه ‏- قَالَ: سَمِعْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ: { إِذَا اِخْتَلَفَ اَلْمُتَبَايِعَانِ لَيْسَ  1‏ بَيْنَهُمَا بَيِّنَةٌ, فَالْقَوْلُ مَا يَقُولُ رَبُّ اَلسِّلْعَةِ أَوْ يَتَتَارَكَانِ }  رَوَاهُ اَلْخَمْسَةُ, وَصَحَّحَهُ اَلْحَاكِمُ  2‏ .‏‏1 ‏- سقط حرف الواو من الأصل.‏‏2 ‏- صحيح.‏ رواه أبو داود ( 3511 )‏، والنسائي ( 7 / 302 ‏- 303 )‏، والترمذي ( 1270 )‏، وابن ماجه ( 2186 )‏، وأحمد ( 1 / 466 )‏، والحاكم ( 2 / 45 )‏.‏ واللفظ الذي ذكره الحافظ لأبي داود والنسائي والحاكم، وللحديث ألفاظ أخرى، وطرق كثيرة عن ابن مسعود، وهذه الطرق، وإن كان بعضها قد أعل، إلا أن الأمر كمل قال البيهقي في \" الكبرى \" ( 5 / 332 )‏: \" إذا جمع بينها صار الحديث بذلك قويا \".‏ وتفضيل كل ذلك \" بالأصل \".‏","english":{"narrator":"Narrated Ibn Mas'ud (RA):","text":"I heard Allah's Messenger (ﷺ) saying, \"When two people who are arranging a business transaction disagree and there is no proof to arbitrate between them, the seller's word is final, or they may break the deal.\"\n\n."}},{"id":4,"idInBook":4,"chapterId":7,"bookId":17,"arabic":"وَعَنْ أَبِي مَسْعُودٍ ‏- رضى الله عنه ‏- { أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-نَهَى عَنْ ثَمَنِ اَلْكَلْبِ, وَمَهْرِ الْبَغِيِّ, وَحُلْوَانِ اَلْكَاهِنِ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 2237 )‏، ومسلم ( 1567 )‏.‏ قلت: وفي الحديث تحريم ثلاثة أشياء: الأول: تحريم ثمن الكلب، وهو عام يشمل كل كلب، كما هو قول مالك، والشافعي.‏ الثاني: تحريم مهر البغي، وهو ما تأخذه الزانية على الزنا.‏ الثالث: تحريم حلوان الكاهن، وهو ما يأخذه الكاهن على كهانته، وهو حرام بالإجماع لما فيه من أخذ العوض على أمر باطل، وفي معناه التنجيم، والضرب بالحصى، وغير ذلك مما يتعاطاه العرافون من استطلاع الغيب.‏","english":{"narrator":"Narrated Abu Mas'ud al-Ansari (RA):","text":"Allah's Messenger (ﷺ) prohibited the money paid for a dog, the payment of a prostitute, and the payment given to a soothsayer.\"\n\n."}},{"id":5,"idInBook":5,"chapterId":7,"bookId":17,"arabic":"وَعَنْ جَابِرِ بْنِ عَبْدِ اَللَّهِ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏-; { أَنَّهُ كَانَ  عَلَى جَمَلٍ لَهُ أَعْيَا.‏ فَأَرَادَ أَنْ يُسَيِّبَهُ.‏ قَالَ: فَلَحِقَنِي اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-فَدَعَا لِي, وَضَرَبَهُ، فَسَارَ سَيْراً لَمْ يَسِرْ مِثْلَهُ, قَالَ: \" بِعْنِيهِ بِوُقِيَّةٍ \" قُلْتُ: لَا.‏ ثُمَّ قَالَ: \" بِعْنِيهِ \" فَبِعْتُهُ بِوُقِيَّةٍ, وَاشْتَرَطْتُ حُمْلَانَهُ إِلَى أَهْلِي, فَلَمَّا بَلَغْتُ أَتَيْتُهُ بِالْجَمَلِ, فَنَقَدَنِي ثَمَنَهُ, ثُمَّ رَجَعْتُ فَأَرْسَلَ فِي أَثَرِي.‏ فَقَالَ: \" أَتُرَانِي مَاكَسْتُكَ لِآخُذَ جَمَلَكَ? خُذْ جَمَلَكَ وَدَرَاهِمَكَ.‏ فَهُوَ لَكْ }  مُتَّفَقٌ عَلَيْهِ , وَهَذَا اَلسِّيَاقُ لِمُسْلِمٍ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 2861 )‏ مطولا، وفي غير هذا الموطن مختصرا.‏ ورواه مسلم ( 3 / 1221 / رقم 109 )‏.‏","english":{"narrator":"Narrated Jabir bin 'Abdullah (RA):","text":"I was traveling on a camel of mine which had become exhausted, so I intended to let it go free. The Prophet (ﷺ) followed me and made supplication for me and struck it. Then, it went as it had never done before. He then said, \"Sell it to me for on Uqiya.\" I replied, \"No.\" He again said, \"Sell it to me.\" So I sold it to him for one Uqiya. However I stipulated that I should be allowed to ride it home. Then when I reached (home), I took the camel to him and he paid me its price in cash. I then went back and he sent someone after me. (When I came), he said, \"Do you think that I asked you to reduce the value of your camel's price to take it? Take your camel and your money, for it is yours.\"\n\n."}},{"id":6,"idInBook":6,"chapterId":7,"bookId":17,"arabic":"وَعَنْهُ قَالَ: { أَعْتَقَ رَجُلٌ مِنَّا عَبْداً لَهُ عَنْ دُبُرٍ لَمْ يَكُنْ لَهُ مَالٌ غَيْرُهُ.‏ فَدَعَا بِهِ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-فَبَاعَهُ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 2141 )‏، وأقرب ألفاظ البخاري للفظ الذي ذكره الحافظ فهو برقم ( 2534 )‏ و ( 7186 )‏ وأما لفظ مسلم ( 997 )‏ عن جابر قال: أعتق رجل من بني عذرة عبدا له عن دبر.‏ فبلغ ذلك رسول الله ‏-صلى الله عليه وسلم‏-، فقال: \" ألك مال غيره؟\" فقال: لا.‏ فقال: \" من يشتريه مني \"؟ فاشتراه نعيم بن عبد الله العدوي بثمانمائة درهم، فجاء بها رسول الله ‏-صلى الله عليه وسلم‏-، فدفعها إليه.‏ ثم قال: \" ابدأ بنفسك، فتصدق عليها.‏ فإن فضل شيء فلأهلك.‏ فإن فضل عن أهلك شيء فلذي قرابتك.‏ فإن فضل عن ذي قرابتك شيء، فهكذا.‏ وهكذا \" يقول: فبين يديك، وعن يمينك، وعن شمالك قلت: وقوله: \" عن دبر \": أي: علق عتقه بموته، كأن يقول: أنت حر بعد وفاتي.‏","english":{"narrator":"Narrated :","text":"A man among us declared that a slave belonging to him would be free after his death. However, he had no other property. So, the Prophet (ﷺ) sent for him (the slave) and sold him.\n\n."}},{"id":7,"idInBook":7,"chapterId":7,"bookId":17,"arabic":"وَعَنْ مَيْمُونَةَ زَوْجِ اَلنَّبِيِّ ‏-صَلَّى اَللَّهُ عَلَيْهِ وَسَلَّمَ, وَرَضِيَ عَنْهَا‏-; { أَنَّ فَأْرَةً وَقَعَتْ فِي سَمْنٍ, فَمَاتَتْ فِيهِ, فَسُئِلَ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-عَنْهَا.‏ فَقَالَ: \n\" أَلْقُوهَا وَمَا حَوْلَهَا, وَكُلُوهُ \" }  رَوَاهُ اَلْبُخَارِيُّ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 5540 )‏.‏","english":{"narrator":"Narrated Maimuna (RA), the wife of the Prophet (ﷺ):","text":"A mouse fell into some ghee and died. The Prophet (ﷺ) was asked about it and he replied, \"Throw it - and what is surrounding (touching) it - away and eat it (that which remained untouched).\"\n\n."}},{"id":8,"idInBook":8,"chapterId":7,"bookId":17,"arabic":"وَزَادَ أَحْمَدُ.‏ وَالنَّسَائِيُّ: فِي سَمْنٍ جَامِدٍ  1‏ .‏‏1 ‏- صحيح.‏ رواه النسائي ( 7 / 178 )‏، وأحمد ( 6 / 330 )‏.‏","english":{"narrator":"Ahmad and an-Nasa'i added:","text":"\"into a solid ghee.\""}},{"id":9,"idInBook":9,"chapterId":7,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِذَا وَقَعَتْ اَلْفَأْرَةُ فِي اَلسَّمْنِ, فَإِنْ كَانَ جَامِداً فَأَلْقُوهَا وَمَا حَوْلَهَا, وَإِنْ كَانَ مَايِعًا فَلَا تَقْرَبُوهُ }  رَوَاهُ أَحْمَدُ, وَأَبُو دَاوُدَ, وَقَدْ حَكَمَ عَلَيْهِ اَلْبُخَارِيُّ وَأَبُو حَاتِمٍ بِالْوَهْمِ  1‏ .‏‏1 ‏- رواه أحمد ( 2 / 232 و 233 و 265 و 490 )‏، وأبو داود ( 3842 )‏ من طريق معمر، عن الزهري، عن ابن المسيب، عن أبي هريرة به.‏ والقول في الحديث ما قاله البخاري وأبو حاتم، فأما قول البخاري، فقد قال الترمذي في \" السنن \" ( 4 / 226 )‏: \" هذا خطأ.‏ أخطأ فيه معمر \".‏ وقال أبو حاتم فيما نقله عنه ابنه في \" العلل \" ( 2 / 12 / 1507 )‏: \" وهم \".‏","english":{"narrator":"Narrated Abu Hurairah (RA):","text":"Allah's Messenger (ﷺ) said: \"If a mouse falls into ghee which is solid, throw the mouse and what is surrounding it away; but if it is in a liquid state do not go near it.\"\n\n."}},{"id":10,"idInBook":10,"chapterId":7,"bookId":17,"arabic":"وَعَنْ أَبِي اَلزُّبَيْرِ قَالَ: سَأَلْتُ جَابِرًا عَنْ ثَمَنِ اَلسِّنَّوْرِ وَالْكَلْبِ? فَقَالَ: { زَجَرَ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-عَنْ ذَلِكَ }  رَوَاهُ مُسْلِمٌ  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم ( 1569 )‏.‏","english":{"narrator":"Narrated Abu Zubair (RA):","text":"I asked Jabir (RA) about the payment for cats and dogs and he replied, \"The Prophet (ﷺ) warned sternly against that.\"\n\n."}},{"id":11,"idInBook":11,"chapterId":7,"bookId":17,"arabic":"وَالنَّسَائِيُّ وَزَادَ: { إِلَّا كَلْبَ صَيْدٍ }   1‏ .‏‏1 ‏- رواه النسائي ( 7 / 190 و 309 )‏ وقال في الموطن الأول: \" ليس بصحيح \" وقال في الثاني: \" منكر \".‏","english":{"narrator":"And an-Nasa'i added:","text":"\"except a hunting dog.\""}},{"id":12,"idInBook":12,"chapterId":7,"bookId":17,"arabic":"وَعَنْ عَائِشَةَ ‏-رَضِيَ اَللَّهُ عَنْهَا‏- قَالَتْ: { جَاءَتْنِي بَرِيرَةُ, فَقَالَتْ: كَاتَبْتُ أَهْلِي عَلَى تِسْعٍ أُوَاقٍ, فِي كُلِّ عَامٍ أُوقِيَّةٌ, فَأَعِينِينِي.‏ فَقُلْتُ: إِنْ أَحَبَّ أَهْلُكِ أَنْ أَعُدَّهَا لَهُمْ وَيَكُونَ وَلَاؤُكِ لِي فَعَلْتُ, فَذَهَبَتْ بَرِيرَةُ إِلَى أَهْلِهَا.‏ فَقَالَتْ لَهُمْ; فَأَبَوْا عَلَيْهَا, فَجَاءَتْ مِنْ عِنْدِهِمْ, وَرَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-جَالِسٌ.‏ فَقَالَتْ: إِنِّي قَدْ عَرَضْتُ ذَلِكَ عَلَيْهِمْ فَأَبَوْا إِلَّا أَنْ يَكُونَ اَلْوَلَاءُ لَهُمْ, فَسَمِعَ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-فَأَخْبَرَتْ عَائِشَةُ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-.‏ فَقَالَ: خُذِيهَا وَاشْتَرِطِي لَهُمُ اَلْوَلَاءَ, فَإِنَّمَا اَلْوَلَاءُ لِمَنْ أَعْتَقَ فَفَعَلَتْ عَائِشَةُ, ثُمَّ قَامَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-فِي اَلنَّاسِ , فَحَمِدَ اَللَّهَ وَأَثْنَى عَلَيْهِ.‏ ثُمَّ قَالَ: \n\" أَمَّا بَعْدُ, مَا بَالُ رِجَالٍ يَشْتَرِطُونَ شُرُوطاً لَيْسَتْ فِي كِتَابِ اَللَّهِ عَزَّ وَجَلَّ مَا كَانَ مِنْ شَرْطٍ لَيْسَ فِي كِتَابِ اَللَّهِ فَهُوَ بَاطِلٌ, وَإِنْ كَانَ مِائَةَ شَرْطٍ, قَضَاءُ اَللَّهِ أَحَقُّ, وَشَرْطُ اَللَّهِ أَوْثَقُ, وَإِنَّمَا اَلْوَلَاءُ لِمَنْ أَعْتَقَ \" }  مُتَّفَقٌ عَلَيْهِ, وَاللَّفْظُ لِلْبُخَارِيِّ  1‏ .‏ \nوَعِنْدَ مُسْلِمٍ فَقَالَ: { اِشْتَرِيهَا وَأَعْتِقِيهَا وَاشْتَرِطِي لَهُمُ اَلْوَلَاءَ }‏1 ‏- صحيح.‏ رواه البخاري ( 2168 )‏، ومسلم ( 1504 )‏.‏","english":{"narrator":"Narrated 'Aishah (RA):","text":"Barirah came to her and said, \"I had arranged to buy my freedom for nine Uqiya; one Uqiyah to be paid annually, so help me.\" 'Aishah (RA) replied, \"If your people are pleased that I should pay (the amount) to them, and I shall have the right to inherit from you, I shall do so.\" Barira went to her people and told them about it, but they refused the offer. When she came back Allah's Messenger (ﷺ) was sitting (in the house). She said, \"I offered that to them, but they insisted that the right to inherit from me should be theirs.\" The Prophet (ﷺ) heard that and 'Aishah (RA) told him about it. So, he said to 'Aishah (RA), \"Take her and stipulate that the right to inherit from her will be yours, for the right of inheritance from her will be yours, for the right of inheritance belongs only to the one who has set a slave free.\" 'Aishah (RA) did so. Allah's Messenger (ﷺ) then stood up among the people to address them. So, after praising and extolling Allah, he said, \"To proceed; what is the matter with some men who make conditions which are not in the Book of Allah, the Might, the Majestic? Any condition which is not in Allah's Book is invalid. Even if there are a hundred conditions, Allah's Decision is more valid and Allah's Condition is more binding. The right of inheritance belongs only to the one who has set a slave free.\"\n\n. Muslim has: \"Buy her, set her free and make the stipulation that the right to inherit from her will be yours.\""}},{"id":13,"idInBook":13,"chapterId":7,"bookId":17,"arabic":"وَعَنِ اِبْنِ عُمَرَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: { نَهَى عُمَرُ عَنْ بَيْعِ أُمَّهَاتِ اَلْأَوْلَادِ فَقَالَ: لَا تُبَاعُ, وَلَا تُوهَبُ, وَلَا تُورَثُ, لِيَسْتَمْتِعْ بِهَا مَا بَدَا لَهُ، فَإِذَا مَاتَ فَهِيَ حُرَّةٌ }  رَوَاهُ مَالِكٌ, وَالْبَيْهَقِيُّ, وَقَالَ: رَفَعَهُ بَعْضُ اَلرُّوَاةِ, فَوَهِمَ  1‏ .‏‏1 ‏- صحيح موقوفا.‏ رواه مالك في \" الموطأ \" ( 2 / 776 / 6 )‏، والبيهقي في \" الكبرى \" ( 10 / 342 ‏- 343 )‏.‏ وقال البيهقي: \" وغلط فيه بعض الرواة … فرفعه إلى النبي ‏-صلى الله عليه وسلم‏-، وهو وهم لا يحل ذكره \".‏","english":{"narrator":"Narrated Ibn 'Umar (RA):","text":"'Umar (RA) forbade the sale of the slave-women who have given birth to children (of their owners). He said, \"She is not to be sold, bestowed as a gift or inherited. He (the owner) enjoys her as long as he lives and when he dies, she becomes free.\"\n\n."}},{"id":14,"idInBook":14,"chapterId":7,"bookId":17,"arabic":"وَعَنْ جَابِرٍ ‏- رضى الله عنه ‏- قَالَ: { كُنَّا نَبِيعُ سَرَارِيَنَا, أُمَّهَاتِ اَلْأَوْلَادِ, وَالنَّبِيُّ ‏- صلى الله عليه وسلم ‏-حَيٌّ, لَا نَرَى  1‏ بِذَلِكَ بَأْسًا }  رَوَاهُ النَّسَائِيُّ, وَابْنُ مَاجَهْ وَاَلدَّارَقُطْنِيُّ, وَصَحَّحَهُ اِبْنُ حِبَّانَ  2‏ .‏‏1 ‏- في \" أ \": \" يرى \" بالمثناة التحتانية، وهو تحريف صوابه \" نرى \" بالنون كما في \" الأصل \" وفي المصادر المذكورة، وأما ما وقع في بعضها بالياء، فهو تحريف، ومما يؤكد ذلك قول البيهقي ( 10 / 347 )‏: \" ليس في شيء من هذه الأحاديث أن النبي ‏-صلى الله عليه وسلم‏- علم بذلك، فأقرهم عليه \".‏‏2 ‏- صحيح.‏ رواه النسائي في \" الكبرى \" ( 3 / 199 )‏، وابن ماجه ( 2517 )‏، والدارقطني ( 4 / 135 / 37 )‏ وابن حبان ( 1215 )‏.‏ قلت: وفي رواية أخرى لحديث جابر قال: بعنا أمهات الأولاد على عهد رسول الله ‏-صلى الله عليه وسلم‏-، وأبي بكر، فلما كان عمر نهانا، فانتهينا.‏","english":{"narrator":"Narrated Jabir (RA):","text":"We used to sell our slave-women who had borne (our) children while the Prophet (ﷺ) was still living, and he saw no harm in that.\n\n."}},{"id":15,"idInBook":15,"chapterId":7,"bookId":17,"arabic":"وَعَنْ جَابِرِ بْنِ عَبْدِ اَللَّهِ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: { نَهَى اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-عَنْ بَيْعِ فَضْلِ اَلْمَاءِ }  رَوَاهُ مُسْلِمٌ  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم ( 1565 )‏.‏","english":{"narrator":"Narrated Jabir bin 'Abdullah (RA):","text":"Allah's Messenger (ﷺ) prohibited the sale of excess water.\n\n."}},{"id":16,"idInBook":16,"chapterId":7,"bookId":17,"arabic":"وَزَادَ فِي رِوَايَةٍ: { وَعَنْ بَيْعِ ضِرَابِ اَلْجَمَلِ }   1‏ .‏‏1 ‏- صحيح مسلم ( 1565 )‏ ( 35 )‏ وتمامها: \" وعن بيع الماء.‏ والأرض لتحرث، فعن ذلك نهى النبي ‏-صلى الله عليه وسلم‏- \".‏","english":{"narrator":"In another narration, he added:","text":"\"And hiring a camel to impregnate a she-camel.\""}},{"id":17,"idInBook":17,"chapterId":7,"bookId":17,"arabic":"وَعَنِ اِبْنِ عُمَرَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: { نَهَى رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-عَنْ عَسْبِ اَلْفَحْلِ }  رَوَاهُ اَلْبُخَارِيُّ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 2284 )‏.‏ وعسب: بفتح فسكون.‏ وهو ثمن ماء الفحل، وقيل: أجرة الجماع.‏ قاله الحافظ.‏","english":{"narrator":"Narrated Ibn 'Umar (RA):","text":"Allah's Messenger (ﷺ) forbade the sale of a stallion's semen (to use for impregnation).\n\n."}},{"id":18,"idInBook":18,"chapterId":7,"bookId":17,"arabic":"وَعَنْهُ; { أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-نَهَى عَنْ بَيْعِ حَبَلِ اَلْحَبَلَةِ, وَكَانَ بَيْعاً يَتَبَايَعُهُ أَهْلُ الْجَاهِلِيَّةِ: كَانَ اَلرَّجُلُ يَبْتَاعُ اَلْجَزُورَ إِلَى أَنْ تُنْتَجَ اَلنَّاقَةُ, ثُمَّ تُنْتَجُ اَلَّتِي فِي بَطْنِهَا }  مُتَّفَقٌ عَلَيْهِ , وَاللَّفْظُ لِلْبُخَارِيِّ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 2143 )‏، ومسلم ( 1514 )‏.‏ قلت: ولمسلم صدر الحديث مثل لفظ البخاري، وأما باقيه فلفظه عنده: كان أهل الجاهلية يتبايعون لحم الجزور إلى حبل الحبلة.‏ وحبل الحبلة أن تنتج الناقة، ثم تحمل التي نتجت.‏ فنهاهم رسول الله ‏-صلى الله عليه وسلم‏- عن ذلك.‏","english":{"narrator":"Narrated :","text":"Allah's Messenger (ﷺ) forbade the transaction called 'Habalal-Habalah\" which was one entered into in the Jahiliya era, whereby a man bought a she-camel which was to be the offspring of a she-camel which was still in its mother's womb.\n\n."}},{"id":19,"idInBook":19,"chapterId":7,"bookId":17,"arabic":"وَعَنْهُ; { أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-نَهَى عَنْ بَيْعِ اَلْوَلَاءِ, وَعَنْ هِبَتِهِ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 6756 )‏، ومسلم ( 1506 )‏.‏","english":{"narrator":"Narrated :","text":"Allah's Messenger (ﷺ) forbade selling or giving away the right of inheritance from a freed slave.\n\n."}},{"id":20,"idInBook":20,"chapterId":7,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: { نَهَى رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-عَنْ بَيْعِ اَلْحَصَاةِ, وَعَنْ بَيْعِ اَلْغَرَرِ }  رَوَاهُ مُسْلِمٌ  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم ( 1513 )‏.‏","english":{"narrator":"Narrated Abu Hurairah (RA):","text":"Allah's Messenger (ﷺ) forbade a transaction determined by throwing stones, and the transaction which involves some uncertainty (or cheating).\n\n."}},{"id":21,"idInBook":21,"chapterId":7,"bookId":17,"arabic":"وَعَنْهُ: أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { مَنِ اِشْتَرَى طَعَاماً فَلَا يَبِعْهُ حَتَّى يَكْتَالَهُ }  رَوَاهُ مُسْلِمٌ  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم ( 1528 )‏.‏","english":{"narrator":"Narrated :","text":"Allah's Messenger (ﷺ) said: \"If anyone buys a grain he must not sell it till he weighs it.\"\n\n."}},{"id":22,"idInBook":22,"chapterId":7,"bookId":17,"arabic":"وَعَنْهُ قَالَ: { نَهَى رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-عَنْ بَيْعَتَيْنِ فِي بَيْعَةٍ }  رَوَاهُ أَحْمَدُ, وَالنَّسَائِيُّ, وَصَحَّحَهُ اَلتِّرْمِذِيُّ, وَابْنُ حِبَّانَ  1‏ .‏‏1 ‏- حسن.‏ رواه أحمد ( 2 / 432 و 475 و 503 )‏، والنسائي ( 7 / 295 ‏- 296 )‏، والترمذي ( 1231 )‏، وابن حبان ( 1109 موارد )‏ عن طريق محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، به.‏ وقال الترمذي: \" حديث حسن صحيح \".‏","english":{"narrator":"Narrated :","text":"Allah's Messenger (ﷺ) forbade two transactions combined in one.\n\n."}},{"id":23,"idInBook":23,"chapterId":7,"bookId":17,"arabic":"وَلِأَبِي دَاوُدَ: { مَنْ بَاعَ بَيْعَتَيْنِ فِي بَيْعَةٍ فَلَهُ أَوَكَسُهُمَا, أَوْ اَلرِّبَا }   1‏ .‏‏1 ‏- حسن.‏ رواه أبو داود ( 3460 )‏.‏","english":{"narrator":"Abu Dawud has:","text":"\"If anyone makes to transactions combined in one he is entitled to take the lower price, or (it is considered) usury.\""}},{"id":24,"idInBook":24,"chapterId":7,"bookId":17,"arabic":"وَعَنْ عَمْرِوِ بْنِ شُعَيْبٍ, عَنْ أَبِيهِ, عَنْ جَدِّهِ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا يَحِلُّ سَلَفٌ وَبَيْعٌ وَلَا شَرْطَانِ فِي بَيْعٍ, وَلَا رِبْحُ مَا لَمْ يُضْمَنْ, وَلَا بَيْعُ مَا لَيْسَ عِنْدَكَ }  رَوَاهُ اَلْخَمْسَةُ, وَصَحَّحَهُ اَلتِّرْمِذِيُّ, وَابْنُ خُزَيْمَةَ, وَالْحَاكِمُ  1‏ .‏‏1 ‏- حسن.‏ رواه أبو داود ( 3504 )‏، والنسائي ( 7 / 288 )‏، والترمذي ( 1234 )‏، وابن ماجه ( 2188 )‏، وأحمد ( 2 / 174 و 179 و 205 )‏ والحاكم ( 2 / 17 )‏.‏ قوله: \" سلف وبيع \" قال ابن الأثير في \" النهاية \" ( 2 / 390 )‏: \" هو مثل أن يقول: بعتك هذا العبد بألف على أن تسلفني ألفا في متاع، أو على أن تقرضني ألفا؛ لأنه إنما يقرضه ليحابيه في الثمن، فيدخل في حد الجهالة؛ ولأن كل قرض جر منفعة فهو ربا؛ ولأن في العقد شرطا لا يصح \".‏ قوله: \" ولا شرطان في بيع \" قال ابن الأثير ( 2 / 459 )‏: \" هو كقولك: بعتك هذا الثوب نقدا بدينار، ونسيئة بدينارين، وهو كالبيعتين في بيعة \".‏ قوله: \" ولا ربح ما لم يضمن \": قال ابن الأثير ( 2 / 182 )‏: \" هو أن يبيعه سلعة قد اشتراها ولم يكن قبضها بربح، فلا يصح البيع، ولا يحل الربح؛ لأنها في ضمان البائع الأول، وليست من ضمان الثاني، فربحها وخسارتها للأول \".‏ قوله: \" وبيع ما ليس عندك \": قال الخطابي في \" المعالم \": \" يريد بيع العين دون بيع الصفة، ألا ترى أنه أجاز السلم إلى الآجال، وهو بيع ما ليس عند البائع في الحال؟، وإنما نهى عن بيع ما ليس عند البائع من قبل الغرر، وذلك مثل أن يبيع عبد الآبق، أو جمله الشارد \".‏","english":{"narrator":"Narrated 'Amr bin Shu'aib on his father's authority from his grandfather (RA):","text":"\"Allah's Messenger (ﷺ) said: \"The condition of a loan combined with a sale is not lawful, now two conditions relating to one transaction, nor the profit arising from something which is not in one's charge, nor selling what is not in your possession.\"\n\n."}},{"id":25,"idInBook":25,"chapterId":7,"bookId":17,"arabic":"وَأَخْرَجَهُ فِي \" عُلُومِ اَلْحَدِيثِ \" مِنْ رِوَايَةِ أَبِي حَنِيفَةَ, عَنْ عَمْرٍو اَلْمَذْكُورِ بِلَفْظِ: \n\n\" نَهَى عَنْ بَيْعٍ وَشَرْطٍ \" وَمِنْ هَذَا اَلْوَجْهِ أَخْرَجَهُ اَلطَّبَرَانِيُّ فِي \" اَلْأَوْسَطِ \" وَهُوَ غَرِيبٌ  1‏ .‏‏1 ‏- رواه الحاكم في \" علوم الحديث \" ص ( 128 )‏، والطبراني في \" الوسط \" كما في \" مجمع البحرين \" ( 1973 )‏ من طريق عبد الله بن أيوب الضرير قال: حدثنا محمد بن سليمان الذهلي قال: حدثنا عبد الوارث بن سعيد قال: قدمت مكة، فوجدت بها أبا حنيفة، وابن أبي ليلى، وابن شبرمة، فسألت أبا حنيفة.‏ فقلت: ما تقول في رجل باع بيعا وشرط شرطا؟ قال: البيع باطل، والشرط باطل، ثم أتيت ابن أبي ليلى فسألته؟ فقال: البيع جائز والشرط باطل، ثم أتيت ابن شبرمة، فسألته.‏ فقال: البيع جائز، والشرط جائز؛ فقلت: يا سبحان الله ! ثلاثة من فقهاء العراق اختلفتم علي في مسألة واحدة ! فأتيت أبا حنيفة، فأخبرته، فقال: ما أدري ما قالا.‏ حدثني عمرو بن شعيب، عن أبيه، عن جده؛ أن النبي ‏-صلى الله عليه وسلم‏- نهى عن بيع وشرط … الخ .‏ قلت: وهذا سند ضعيف جدا، عبد الله بن أيوب متروك، ومحل الشاهد الذي ساقه الحافظ فيه أبو حنيفة، وهو ضعيف في الحديث.‏","english":{"narrator":"al-Hakim reported it in 'Uloom al-Hadith, from the narration of Abu Hanifah, from 'Amr bin Shu'aib, with the wording:","text":"He  forbade a transaction (combined with) a condition. at-Tabarani reported it through this chain of narrators in al-Awsat, and it is Gharib (reported by a single narrator)."}},{"id":26,"idInBook":26,"chapterId":7,"bookId":17,"arabic":"وَعَنْهُ قَالَ: { نَهَى رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-عَنْ بَيْعِ اَلْعُرْبَانِ }  رَوَاهُ مَالِكٌ, قَالَ: بَلَغَنِي عَنْ عَمْرِو بْنِ شُعَيْبٍ, بِهِ  1‏ .‏‏1 ‏- ضعيف.‏ رواه مالك في \" الموطأ \" ( 2 / 609 / 1 )‏ عن الثقة عنده، عن عمرو به.‏ ورواه أبو داود وابن ماجه من طريق مالك قال: بلغني عن عمرو بن شعيب، به.‏ قلت: وسبب ضعفه جهالة الواسطة بين مالك وعمرو بن شعيب.‏ والعربان ويقال: عربون وعربون قال ابن الأثير في \" النهاية \": قيل: \" سمي بذلك؛ لأن فيه إعرابا لعقد البيع، أي: إصلاحا وإزالة فساد، لئلا يملكه غيره باشترائه \".‏ وقد فسر الإمام مالك في \" الموطأ \" فقال: \" وذلك فيما نرى ‏-والله أعلم‏- أن يشتري الرجل العبد أو الوليدة، أو يتكارى الدابة، ثم يقول للذي اشترى منه أو تكارى منه: أعطيك دينارا أو درهما أو أكثر من ذلك أو أقل على أني إن أخذت السلعة أو ركبت ما تكاريت منك فالذي أعطيتك هو من ثمن السلعة أو من كراء الدابة، وإن تركت ابتياع السلعة أو كراء الدابة فما أعطيتك، فهو لك باطل بغير شيء \".‏","english":{"narrator":"Narrated :","text":"Allah's Messenger (ﷺ) forbade the type of transaction in which a security deposit was paid.\n\n."}},{"id":27,"idInBook":27,"chapterId":7,"bookId":17,"arabic":"وَعَنِ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { اِبْتَعْتُ زَيْتاً فِي اَلسُّوقِ, فَلَمَّا اِسْتَوْجَبْتُهُ لَقِيَنِي رَجُلٌ فَأَعْطَانِي بِهِ رِبْحاً حَسَناً، فَأَرَدْتُ أَنْ أَضْرِبَ عَلَى يَدِ اَلرَّجُلِ، فَأَخَذَ رَجُلٌ مِنْ خَلْفِي بِذِرَاعِي، فَالْتَفَتُّ, فَإِذَا هُوَ زَيْدُ بْنُ ثَابِتٍ, فَقَالَ: لَا تَبِعْهُ حَيْثُ اِبْتَعْتَهُ حَتَّى تَحُوزَهُ إِلَى رَحْلِكَ; فَإِنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-نَهَى أَنْ تُبَاعَ اَلسِّلَعُ حَيْثُ تُبْتَاعُ, حَتَّى يَحُوزَهَا اَلتُّجَّارُ إِلَى رِحَالِهِمْ }  رَوَاهُ أَحْمَدُ, وَأَبُو دَاوُدَ وَاللَّفْظُ لَهُ, وَصَحَّحَهُ اِبْنُ حِبَّانَ وَالْحَاكِمُ  1‏ .‏‏1 ‏- حسن.‏ رواه أحمد ( 5 / 191 )‏، وأبو داود ( 3499 )‏، وابن حبان ( 1120 موارد )‏، والحاكم ( 2 / 40 )‏.‏","english":{"narrator":"Narrated Ibn 'Umar (RA):","text":"I bought some oil in the market and when I had taken it (from the seller), a man met me and offered to give me a good profit for it. Then, when I was about to finalize the deal with him, a man caught hold of my forearm from behind. So I turned and found that he was Zaib bin Thabit (RA). He said, \"Do not sell it in the place where you have bought it, till you take it to your dwelling. This is because Allah's Messenger (ﷺ) forbade that commodities to be sold in the place where they were bought, till the traders take them to their dwellings.\"\n\n."}},{"id":28,"idInBook":28,"chapterId":7,"bookId":17,"arabic":"وَعَنْهُ قَالَ: { قُلْتُ: يَا رَسُولَ اَللَّهِ! إِنِّي أَبِيعُ بِالْبَقِيعِ, فَأَبِيعُ بِالدَّنَانِيرِ وَآخُذُ اَلدَّرَاهِمَ, وَأَبِيعُ بِالدَّرَاهِمِ وَآخُذُ اَلدَّنَانِيرَ, آخُذُ هَذَا مِنْ هَذِهِ وَأُعْطِي هَذَهِ مِنْ هَذِا? فَقَالَ رَسُولُ اَللَّهِ‏-صَلَّى اَللَّهُ عَلَيْهِ وَسَلَّمَ‏-: لَا بَأْسَ أَنْ تَأْخُذَهَا بِسِعْرِ يَوْمِهَا مَا لَمْ تَتَفَرَّقَا وَبَيْنَكُمَا شَيْءٌ }  رَوَاهُ اَلْخَمْسَةُ, وَصَحَّحَهُ اَلْحَاكِمُ  1‏ .‏‏1 ‏- ضعيف مرفوعا.‏ رواه أحمد ( 2 / 33 و 83 ‏- 84 و 139 )‏، وأبو داود ( 3354 و 3355 )‏، والنسائي ( 7 / 81 ‏- 83 )‏، والترمذي ( 1242 )‏، وابن ماجه ( 2262 )‏، والحاكم ( 2 / 44 )‏، من طريق سماك بن حرب، عن سعيد بن جبير، عن ابن عمر، به.‏ قلت: وعلته سماك بن حرب، فهو كما قال الحافظ في \" التقريب \": صدوق، وروايته عن عكرمة خاصة مضطربة، وقد تغير بأخرة، فكان ربما يلقن \".‏ ولذلك قال الترمذي: \" هذا حديث لا نعرفه مرفوعا، إلا من حديث سماك بن حرب، عن سعيد بن جبير، عن ابن عمر.‏ وروى داود بن أبي هند هذا الحديث عن سعيد بن جبير، عن ابن عمر موقوفا \".‏ وقال الحافظ في \" التلخيص \" ( 3 / 26 )‏: \" روى البيهقي من طريق أبي داود الطيالسي قال: سئل شعبة عن حديث سماك هذا؟ فقال شعبة: سمعت أيوب، عن نافع، عن ابن عمر، ولم يرفعه، وحدثنا قتادة، عن سعيد بن المسيب، عن ابن عمر، ولم يرفعه.‏ وحدثنا يحيى بن أبي إسحاق، عن سالم، عن ابن عمر، ولم يرفعه.‏ ورفعه لنا سماك، وأنا أفرقه \".‏","english":{"narrator":"Narrated :","text":"I said, \"O Allah's Messenger, I sell camels at al-Baqi'. I sell for Dinars and take Dirhams (for them), and sell for Dirhams, and take Dinars (for them), I take this for that and give that for this (i.e. Dinars and Dirhams).\" Allah's Messenger (ﷺ) replied, \"There is no harm in taking them at the current rate so long as you do not separate leaving something still to be settled (from the exchange).\"\n\n."}},{"id":29,"idInBook":29,"chapterId":7,"bookId":17,"arabic":"وَعَنْهُ قَالَ: { نَهَى ‏- صلى الله عليه وسلم ‏-عَنِ النَّجْشِ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 2142 )‏، ومسلم ( 1516 )‏.‏ والنجش: الزيادة في ثمن السلعة ممن لا يريد شرائها؛ ليقع فيها غيره.‏","english":{"narrator":"Narrated :","text":"Allah's Messenger (ﷺ) forbade bidding against one another (to raise the price).\n\n."}},{"id":30,"idInBook":30,"chapterId":7,"bookId":17,"arabic":"وَعَنْ جَابِرِ بْنِ عَبْدِ اَللَّهِ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏-; { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-نَهَى عَنْ اَلْمُحَاقَلَةِ, وَالْمُزَابَنَةِ, وَالْمُخَابَرَةِ, وَعَنْ اَلثُّنْيَا, إِلَّا أَنْ تُعْلَمَ }  رَوَاهُ اَلْخَمْسَةُ إِلَّا اِبْنَ مَاجَهْ, وَصَحَّحَهُ اَلتِّرْمِذِيُّ  1‏ .‏‏1 ‏- صحيح.‏ رواه أبو داود ( 3405 )‏، والنسائي ( 7 / 37 ‏- 38 )‏، والترمذي ( 1290 )‏، وقال الترمذي: \" حديث حسن صحيح \".‏","english":{"narrator":"Narrated Jabir bin 'Abdullah (RA):","text":"The Prophet (ﷺ) forbade Muhaqalah, Muzabanah, and Mukhabarah. He also forbade Thunya unless it was explicit (a known amount).\n\n."}},{"id":31,"idInBook":31,"chapterId":7,"bookId":17,"arabic":"وَعَنْ أَنَسٍ ‏- رضى الله عنه ‏- قَالَ: { نَهَى رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-عَنِ اَلْمُحَاقَلَةِ, وَالْمُخَاضَرَةِ, وَالْمُلَامَسَةِ, وَالْمُنَابَذَةِ, وَالْمُزَابَنَةِ }  رَوَاهُ اَلْبُخَارِيُّ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 2207 )‏.‏ المخاضرة: أي بيع الثمار والحبوب قبل أن يبدو صلاحها.‏","english":{"narrator":"Narrated Anas (RA):","text":"Allah's Messenger (ﷺ) forbade Muhaqalah, Mukhadarah, Mulamasah, Munabadhah and Muzabamah.\n\n."}},{"id":32,"idInBook":32,"chapterId":7,"bookId":17,"arabic":"وَعَنْ طَاوُسٍ, عَنِ اِبْنِ عَبَّاسٍ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا تَلَقَّوْا اَلرُّكْبَانَ, وَلَا يَبِيعُ حَاضِرٌ لِبَادٍ \".‏ قُلْتُ لِابْنِ عَبَّاسٍ: مَا قَوْلُهُ: \" وَلَا يَبِيعُ حَاضِرٌ لِبَادٍ? \" قَالَ: لَا يَكُونُ لَهُ سِمْسَارًا }  مُتَّفَقٌ عَلَيْهِ وَاللَّفْظُ لِلْبُخَارِيِّ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 2158 )‏، ومسلم ( 1521 )‏.‏","english":{"narrator":"Narrated Tawus from Ibn 'Abbas (RA), Allah's Messenger (ﷺ) said:","text":"\"Do not go out to meet riders (to conduct business with them), and a city-dweller must not sell for a man from the desert.\" I asked Ibn 'Abbas (RA), \"What did he mean by 'A city-dweller must not sell for a man from the desert.'\" He replied, \"He should not act as a broker for him.\"\n\n."}},{"id":33,"idInBook":33,"chapterId":7,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا تَلَقَّوا اَلْجَلَبَ، فَمَنْ تُلُقِّيَ فَاشْتُرِيَ مِنْهُ, فَإِذَا أَتَى سَيِّدُهُ اَلسُّوقَ فَهُوَ بِالْخِيَارِ }  .‏ رَوَاهُ مُسْلِمٌ  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم ( 1519 )‏.‏ والجلب: هو ما يجلب للبيع و \" سيده \" هو مالك المجلوب، ومعناه إذا جاء صاحب المتاع إلى السوق، وعرف السعر، فله الخيار في الاسترداد.‏","english":{"narrator":"Narrated Abu Hurairah (RA):","text":"Allah's Messenger (ﷺ) said: \"Do not go out to meet what is being brought (to market for sale). Whoever has done so and bought some of it, when its owner comes to the market he has the choice (of canceling the deal).\"\n\n."}},{"id":34,"idInBook":34,"chapterId":7,"bookId":17,"arabic":"وَعَنْهُ قَالَ: { نَهَى رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-أَنْ يَبِيعَ حَاضِرٌ لِبَادٍ, وَلَا تَنَاجَشُوا, وَلَا يَبِيعُ اَلرَّجُلُ عَلَى بَيْعِ أَخِيهِ, وَلَا يَخْطُبُ عَلَى خِطْبَةِ أَخِيهِ, وَلَا تُسْأَلُ اَلْمَرْأَةُ طَلَاقَ أُخْتِهَا لِتَكْفَأَ مَا فِي إِنَائِهَا }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 2140 )‏، ومسلم ( 1515 )‏، واللفظ للبخاري.‏","english":{"narrator":"Narrated :","text":"Allah's Messenger (ﷺ) forbade, a city-dweller to sell for a man from the desert; one to bid against another (to raise the price); that someone sell (his product) by canceling the sale of his brother; to propose (marriage) to a woman after his brother has done so; or a woman to ask to have her sister divorced in order to deprive her of what belongs to her.\n\n."}},{"id":35,"idInBook":35,"chapterId":7,"bookId":17,"arabic":"وَلِمُسْلِمٍ: { لَا يَسُمِ اَلْمُسْلِمُ عَلَى سَوْمِ اَلْمُسْلِمِ }   1‏ .‏‏1 ‏- مسلم ( 1515 )‏ ( 9 )‏ إلا أن الذي فيه: \" على سوم أخيه \" بدل: \" على سوم المسلم \".‏","english":{"narrator":"Muslim has:","text":"\"A Muslim must not offer a price above that offered by another Muslim.\""}},{"id":36,"idInBook":36,"chapterId":7,"bookId":17,"arabic":"وَعَنْ أَبِي أَيُّوبَ اَلْأَنْصَارِيِّ ‏- رضى الله عنه ‏- : سَمِعْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ: { مَنْ فَرَّقَ بَيْنَ وَالِدَةٍ وَوَلَدِهَا, فَرَّقَ اَللَّهُ بَيْنَهُ وَبَيْنَ أَحِبَّتِهِ يَوْمَ اَلْقِيَامَةِ }  رَوَاهُ أَحْمَدُ, وَصَحَّحَهُ اَلتِّرْمِذِيُّ, وَالْحَاكِمُ, وَلَكِنْ فِي إِسْنَادِهِ مَقَالٌ.‏  1‏ .‏ \nوَلَهُ شَاهِدٌ  2‏ .‏‏1 ‏- حسن.‏ رواه أحمد ( 5 / 412 )‏ 413 )‏، والترمذي ( 1283 )‏، والحاكم ( 2 /55 )‏، من طريق حيي بن عبد الله المعافري، عن أبي عبد الرحمن الحبلي قال: كنا في البحر، وعلينا عبد الله بن قيس الفزاري، ومعنا أبو أيوب الأنصاري، فمر بصاحب المقاسم، وقد أقام السبي، فإذا امرأة تبكي.‏ فقال: ما شأن هذه؟ قالوا: فرقوا بينها وبين ولدها.‏ قال: فأخذ بيد ولدها حتى وضعه في يدها، فانطلق صاحب المقاسم إلى عبد الله بن قيس فأخبره، فأرسل إلى أبي أيوب، فقال: ما حملك على ما صنعت؟ قال: سمعت رسول الله ‏-صلى الله عليه وسلم‏-: ……فذكر الحديث، وهذه القصة لأحمد دونهم.‏ قلت: والمقال الذي في سنده من أجل حيي بن عبد الله، ولكنه ليس به بأس ‏-إن شاء الله‏- كما قال ابن معين وغيره.‏\n\n‏2 ‏- من حديث عبادة بن الصامت عند الدارقطني والحاكم، ولا يصح سنده.‏","english":{"narrator":"Narrated Abu Ayub al-Ansari (RA):","text":"I heard Allah's Messenger (ﷺ) saying, \"Whoever separates a mother from her child, May Allah separate him from his beloved ones on the Day of Resurrection.\"\n\n."}},{"id":37,"idInBook":37,"chapterId":7,"bookId":17,"arabic":"وَعَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ ‏- رضى الله عنه ‏- قَالَ: { أَمَرَنِي رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-أَنْ أَبِيعَ غُلَامَيْنِ أَخَوَيْنِ, فَبِعْتُهُمَا, فَفَرَّقْتُ بَيْنَهُمَا، فَذَكَرْتُ ذَلِكَ لِلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-فَقَالَ: أَدْرِكْهُمَا, فَارْتَجِعْهُمَا, وَلَا تَبِعْهُمَا إِلَّا جَمِيعًا }  رَوَاهُ أَحْمَدُ, وَرِجَالُهُ ثِقَاتٌ, وَقَدْ صَحَّحَهُ اِبْنُ خُزَيْمَةَ, وَابْنُ اَلْجَارُودِ, وَابْنُ حِبَّانَ, وَالْحَاكِمُ, وَالطَّبَرَانِيُّ, وَابْنُ اَلْقَطَّانِ  1‏ .‏‏1 ‏- صحيح.‏ رواه أحمد ( 760 )‏، وابن الجارود ( 575 )‏، والحاكم ( 2 / 125 )‏.‏","english":{"narrator":"Narrated 'Ali bin Abu Talib (RA):","text":"Allah's Messenger (ﷺ) commanded me to sell two youths who were brothers. I sold them and separated them (by selling them to different people). When I made mention of that to the Prophet (ﷺ), he said, \"Find them and get them back, and do not sell them except that they are together.\"\n\n."}},{"id":38,"idInBook":38,"chapterId":7,"bookId":17,"arabic":"وَعَنْ أَنَسِ بْنِ مَالِكٍ ‏- رضى الله عنه ‏- قَالَ: { غَلَا اَلسِّعْرُ بِالْمَدِينَةِ عَلَى عَهْدِ رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-فَقَالَ اَلنَّاسُ: يَا رَسُولَ اَللَّهِ ! غَلَا اَلسِّعْرُ, فَسَعِّرْ لَنَا, فَقَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-إِنَّ اَللَّهَ هُوَ اَلْمُسَعِّرُ, اَلْقَابِضُ, اَلْبَاسِطُ, الرَّازِقُ, وَإِنِّي لَأَرْجُو أَنْ أَلْقَى اَللَّهَ ‏-تَعَالَى‏-, وَلَيْسَ أَحَدٌ مِنْكُمْ يَطْلُبُنِي بِمَظْلِمَةٍ فِي  1‏ دَمٍ وَلَا مَالٍ \" }  رَوَاهُ اَلْخَمْسَةُ إِلَّا النَّسَائِيَّ, وَصَحَّحَهُ اِبْنُ حِبَّانَ  2‏ .‏‏1 ‏- في هامش \" أ \" أشار إلى أن في نسخة: \" من \".‏‏2 ‏- صحيح.‏ رواه أحمد ( 3 / 156 )‏، وأبو داود ( 3451 )‏، والترمذي ( 1314 )‏، وابن ماجه ( 2200 )‏، وابن حبان ( 4914 )‏.‏ وقال الترمذي: \" حسن صحيح \".‏ وقال الحافظ في \" التلخيص \" ( 3 / 14 )‏: \" إسناده على شرط مسلم \".‏ وهو كما قال.‏","english":{"narrator":"Narrated Anas bin Malik (RA):","text":"When prices were high in al-Madinah in the time of Allah's Messenger (ﷺ), the people said, \"O Allah's Messenger, prices have become high, so fix them for us.\" Allah's Messenger (ﷺ) replied, Allah is the One Who fixes prices, Who withholds, gives lavishly and provides. And I hope that when I meet Allah, the Most High, none of you will have any claim on me for an injustice regarding blood or property.\"\n\n."}},{"id":39,"idInBook":39,"chapterId":7,"bookId":17,"arabic":"وَعَنْ مَعْمَرِ بْنِ عَبْدِ اَللَّهِ ‏- رضى الله عنه ‏- عَنْ رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { لَا يَحْتَكِرُ إِلَّا خَاطِئٌ }  رَوَاهُ مُسْلِمٌ  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم ( 1605 )‏ ( 130 )‏، وفي لفظ آخر له: ومن احتكر فهو خاطئ.‏","english":{"narrator":"Narrated Ma'mar bin 'Abdullah (RA):","text":"Allah's Messenger (ﷺ) said: \"None withholds goods till the price rises but a sinner.\"\n\n."}},{"id":40,"idInBook":40,"chapterId":7,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- عَنِ النَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { لَا تَصُرُّوا اَلْإِبِلَ وَالْغَنَمَ, فَمَنِ اِبْتَاعَهَا بَعْدُ فَإِنَّهُ بِخَيْرِ اَلنَّظَرَيْنِ بَعْدَ أَنْ يَحْلُبَهَا, إِنْ شَاءَ أَمْسَكَهَا, وَإِنْ شَاءَ رَدَّهَا وَصَاعًا مِنْ تَمْرٍ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 2148 )‏، ومسلم ( 1524 )‏، واللفظ للبخاري.‏","english":{"narrator":"Narrated Abu Hurairah (RA):","text":"The Prophet (ﷺ) said: \"Do not tie up the udders of camels and goats. He who buys them after that (has been done) has two choices open to him after milking them: he may keep them if he wishes, or may return them along with one Sa' of dates.\"\n\n."}},{"id":41,"idInBook":41,"chapterId":7,"bookId":17,"arabic":"وَلِمُسْلِمٍ: { فَهُوَ بِالْخِيَارِ ثَلَاثَةَ أَيَّامٍ }   1‏ .‏‏1 ‏- مسلم ( 1524 )‏ ( 24 )‏.‏","english":{"narrator":"Muslim has:","text":"\"He has three days in which to decide to keep them or not.\""}},{"id":42,"idInBook":42,"chapterId":7,"bookId":17,"arabic":"وَفِي رِوَايَةٍ: { لَهُ, عَلَّقَهَا }  اَلْبُخَارِيُّ: { رَدَّ مَعَهَا صَاعاً مِنْ طَعَامٍ, لَا سَمْرَاءَ }  قَالَ اَلْبُخَارِيُّ: وَالتَّمْرُ أَكْثَرُ  1‏ .‏‏1 ‏- هذه الرواية لمسلم ( 1524 )‏ ( 25 )‏ وهي في البخاري ( 4 / 361 / فتح )‏.‏ وقوله: \" لا تصروا \" نهي عن ترك الشاة والناقة دون حلب حتى يجتمع لبنها ويكثر، فيظن المشتري أن ذلك عادتها.‏ وقوله \" لا سمراء \".‏ أي: لا يتعين السمراء بعينها ‏-وهي: الحنطة‏- وإنما يصلح الصاع من الطعام الذي هو غالب قوت البلد.‏","english":{"narrator":"Another narration by Muslim, which al-Bukhari reported as Mu'allaq (with a broken chain), has:","text":"\"He must return with it one Sa' of any grain but wheat.\"\n\n."}},{"id":43,"idInBook":43,"chapterId":7,"bookId":17,"arabic":"وَعَنِ اِبْنِ مَسْعُودٍ ‏- رضى الله عنه ‏- قَالَ: { مَنِ اِشْتَرَى شَاةً مَحَفَّلَةً, فَرَدَّهَا, فَلْيَرُدَّ مَعَهَا صَاعًا }  رَوَاهُ اَلْبُخَارِيُّ  1‏ .‏‏1 ‏- صحيح، وهو موقوف.‏ رواه البخاري ( 2149 )‏.‏","english":{"narrator":"Narrated Ibn Mas'ud (RA):","text":"If anyone buys a goat whose udder has been tied up and he returned it, he must return it with one Sa'.\n\n."}},{"id":44,"idInBook":44,"chapterId":7,"bookId":17,"arabic":"وَزَادَ اَلْإِسْمَاعِيلِيُّ: مِنْ تَمْرٍ.‏","english":{"narrator":"al-Isma'ili added:","text":"\"of dates.\""}},{"id":45,"idInBook":45,"chapterId":7,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- { أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-مَرَّ عَلَى صُبْرَةِ طَعَامٍ, فَأَدْخَلَ يَدَهُ فِيهَا, فَنَالَتْ أَصَابِعُهُ بَلَلًا , فَقَالَ: \n\" مَا هَذَا يَا صَاحِبَ اَلطَّعَامِ? \" قَالَ: أَصَابَتْهُ اَلسَّمَاءُ يَا رَسُولَ اَللَّهِ.‏ فَقَالَ: أَفَلَا جَعَلْتَهُ فَوْقَ اَلطَّعَامِ; كَيْ يَرَاهُ اَلنَّاسُ? مَنْ غَشَّ فَلَيْسَ مِنِّي }  رَوَاهُ مُسْلِمٌ  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم ( 102 )‏.‏ والصبرة: الكومة المجتمعة من الطعام.‏","english":{"narrator":"Narrated Abu Hurairah (RA):","text":"Allah's Messenger (ﷺ) once came upon a heap of grain, and when he put his hand inside it, his fingers felt some dampness. So, he asked, \"What is this, O owner of the grain?\" He replied, \"Rain had fallen on it, O Allah's Messenger.\" He said, \"Why did you not put it (the damp part) on the top of the foodstuff so that people might see it? Whoever cheats has nothing to do with me.\"\n\n."}},{"id":46,"idInBook":46,"chapterId":7,"bookId":17,"arabic":"وَعَنْ عَبْدِ اَللَّهِ بْنِ بُرَيْدَةَ, عَنْ أَبِيهِ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ حَبَسَ اَلْعِنَبَ أَيَّامَ اَلْقِطَافِ, حَتَّى يَبِيعَهُ مِمَّنْ يَتَّخِذُهُ خَمْراً, فَقَدَ تَقَحَّمَ اَلنَّارَ عَلَى بَصِيرَةٍ }  .‏ رَوَاهُ اَلطَّبَرَانِيُّ فِي \n\" اَلْأَوْسَطِ \" بِإِسْنَادٍ حَسَنٍ  1‏ .‏‏1 ‏- موضوع.‏ رواه الطبراني في \" الأوسط \" كما في \" مجمع البحرين \" ( 1984 )‏.‏ وقال أبو حاتم في \" العلل \" ( 1 / 389 / 1165 )‏: حديث كذب باطل \".‏ وقال ابن حبان في \" المجروحين \" ( 1 / 236 )‏.‏ \" حديث منكر \".‏ وقال الذهبي في \" الميزان \": \" خبر موضوع \".‏ وقد ارتضى الحافظ هذا الكلام في \" اللسان \" ولم يعقب عليه ( 2 / 316 )‏.‏ ولذلك قال شيخنا العلامة محدث العصر ‏- حفظه الله المولى تعالى ‏- في \" الضعيفة \": \" لقد أخطأ الحافظ بن حجر في هذا الحديث خطأ فاحشا، فسكت عليه في \" التلخيص \"، وقال في \" بلوغ المرام \": رواه الطبراني في \" الأوسط \" بإسناد حسن \".‏","english":{"narrator":"Narrated 'Abdullah bin Buraidah on his father's authority (RA):","text":"Allah's Messenger (ﷺ) said: \"Whoever hoards grapes in the vintage (harvest) season till he sells them to those who make wine from them, has hastily thrown himself into Hell-fire with clear knowledge.\"\n\n."}},{"id":47,"idInBook":47,"chapterId":7,"bookId":17,"arabic":"وَعَنْ عَائِشَةَ ‏-رَضِيَ اَللَّهُ عَنْهَا‏- قَالَتْ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ اَلْخَرَاجُ بِالضَّمَانِ }  رَوَاهُ اَلْخَمْسَةُ, وَضَعَّفَهُ اَلْبُخَارِيُّ, وَأَبُو دَاوُدَ وَصَحَّحَهُ اَلتِّرْمِذِيُّ, وَابْنُ خُزَيْمَةَ, وَابْنُ اَلْجَارُودِ, وَابْنُ حِبَّانَ, وَالْحَاكِمُ, وَابْنُ اَلْقَطَّانِ  1‏ .‏‏1 ‏- حسن.‏ رواه أبو داود ( 3508 )‏، والنسائي ( 7 / 254 )‏، والترمذي ( 1285 و 1286 )‏، وابن ماجه ( 2442 )‏، وأحمد ( 6 / 49 و 161 و 208 و 237 )‏، وابن الجارود ( 627 )‏، وابن حبان ( 1125 )‏، والحاكم ( 2 / 15 )‏.‏ وقال الترمذي: \" حديث حسن صحيح غريب \".‏ قلت: وله طرق فصلت الكلام عليها في \" الأصل \".‏","english":{"narrator":"Narrated 'Aishah (RA):","text":"Allah's Messenger (ﷺ) said: \"Any profit goes to the one who bears responsibility.\"\n\n."}},{"id":48,"idInBook":48,"chapterId":7,"bookId":17,"arabic":"وَعَنْ عُرْوَةَ الْبَارِقِيِّ ‏- رضى الله عنه ‏- { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-أَعْطَاهُ دِينَارًا يَشْتَرِي بِهِ أُضْحِيَّةً, أَوْ شَاةً, فَاشْتَرَى شَاتَيْنِ, فَبَاعَ إِحْدَاهُمَا بِدِينَارٍ, فَأَتَاهُ بِشَاةٍ وَدِينَارٍ, فَدَعَا لَهُ بِالْبَرَكَةِ فِي بَيْعِهِ, فَكَانَ لَوْ اِشْتَرَى تُرَابًا لَرَبِحَ فِيهِ }  رَوَاهُ اَلْخَمْسَةُ إِلَّا النَّسَائِيَّ  1‏ .‏‏1 ‏- صحيح.‏ رواه أبو داود ( 3384 )‏، والترمذي ( 1258 )‏، وابن ماجه ( 2402 )‏، وأحمد ( 4 / 375 )‏.‏","english":{"narrator":"Narrated 'Urwa al-Bariqi (RA):","text":"The Prophet (ﷺ) gave him a Dinar to buy a sacrificial animal or a sheep. He bought two sheep with it, sold one of them for a Dinar and came back to him with a goat and a Dinar. So he invoked blessings on him in his business dealings, and he was such that if he had bought soil (of the earth) he would have made profit from it.\n\n."}},{"id":49,"idInBook":49,"chapterId":7,"bookId":17,"arabic":"وَقَدْ أَخْرَجَهُ اَلْبُخَارِيُّ ضِمْنَ حَدِيثٍ, وَلَمْ يَسُقْ لَفْظَهُ  1‏ .‏‏1 ‏- بل رواه البخاري ( 3642 )‏، وساق لفظه، وإنما هذا من أوهام الحافظ ‏-رحمه الله‏-.‏","english":{"narrator":"","text":"al-Bukhari also recorded it within another Hadith but did not report its exact wording."}},{"id":50,"idInBook":50,"chapterId":7,"bookId":17,"arabic":"وَأَوْرَدَ اَلتِّرْمِذِيُّ لَهُ شَاهِداً: مِنْ حَدِيثِ حَكِيمِ بْنِ حِزَامٍ  1‏ .‏‏1 ‏- ضعيف.‏ رواه الترمذي ( 1257 )‏، وأبو داود ( 3386 )‏ وسنده ضعيف.‏","english":{"narrator":"","text":"at-Tirmidhi reported a Shahid (supporting narration of similar meaning) for it from the Hadith of Hakim bin Hizam."}},{"id":51,"idInBook":51,"chapterId":7,"bookId":17,"arabic":"وَعَنِ أَبِي سَعِيدٍ اَلْخُدْرِيِّ ‏- رضى الله عنه ‏- { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-نَهَى عَنْ شِرَاءِ مَا فِي بُطُونِ اَلْأَنْعَامِ حَتَّى تَضَعَ, وَعَنْ بَيْعِ مَا فِي ضُرُوعِهَا, وَعَنْ شِرَاءِ اَلْعَبْدِ وَهُوَ آبِقٌ, وَعَنْ شِرَاءِ اَلْمَغَانِمِ حَتَّى تُقْسَمَ, وَعَنْ شِرَاءِ اَلصَّدَقَاتِ حَتَّى تُقْبَضَ, وَعَنْ ضَرْبَةِ اَلْغَائِصِ }  رَوَاهُ اِبْنُ مَاجَهْ, وَالْبَزَّارُ, وَاَلدَّارَقُطْنِيُّ بِإِسْنَادٍ ضَعِيفٍ  1‏ .‏‏1 ‏- ضعيف.‏ رواه ابن ماجه ( 2196 )‏، والدارقطني ( 3 / 44 / 15 )‏.‏","english":{"narrator":"Narrated Abu Sa'id al-Khudri (RA):","text":"The Prophet (ﷺ) forbade buying what is in the wombs of domestic animals till they give birth; selling what is in their udders; buying a runaway slave; buying (something from) the spoils of war until they are divided; buying Sadaqat before they are received; and the unknown catch (find) of a diver.\n\n."}},{"id":52,"idInBook":52,"chapterId":7,"bookId":17,"arabic":"وَعَنِ اِبْنِ مَسْعُودٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا تَشْتَرُوا اَلسَّمَكَ فِي اَلْمَاءِ; فَإِنَّهُ غَرَرٌ }  رَوَاهُ أَحْمَدُ, وَأَشَارَ إِلَى أَنَّ اَلصَّوَابَ وَقْفُهُ  1‏ .‏‏1 ‏- ضعيف.‏ رواه أحمد ( 3676 )‏.‏","english":{"narrator":"Narrated Ibn Mas'ud (RA):","text":"Allah's Messenger (ﷺ) said: \"Do not buy the fish that is in the water, for it involves uncertainty (risk).\"\n\n."}},{"id":53,"idInBook":53,"chapterId":7,"bookId":17,"arabic":"وَعَنِ اِبْنِ عَبَّاسٍ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: { نَهَى رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-أَنْ تُبَاعَ ثَمَرَةٌ حَتَّى تُطْعَمَ, وَلَا يُبَاعَ صُوفٌ عَلَى ظَهْرٍ, وَلَا لَبَنٌ فِي ضَرْعٍ }  رَوَاهُ اَلطَّبَرَانِيُّ فِي \n\" اَلْأَوْسَطِ \" وَاَلدَّارَقُطْنِيُّ  1‏ .‏‏1 ‏- رواه الطبراني في \" الأوسط \" كما في \" مجمع البحرين \" ( 2000 )‏، وفي \" الكبير \" ( 11935 )‏، والدارقطني ( 3 / 14 ‏- 15 )‏.‏","english":{"narrator":"Narrated Ibn 'Abbas (RA):","text":"Allah's Messenger (ﷺ) forbade the selling of a fruit till it becomes ripe, or the selling of fur which is (still) on the back (of an animal) or milk which is (still) in the udder.\n\n."}},{"id":54,"idInBook":54,"chapterId":7,"bookId":17,"arabic":"وَأَخْرَجَهُ أَبُو دَاوُدَ  1‏ فِي \n\" اَلْمَرَاسِيلِ \" لِعِكْرِمَةَ, وَهُوَ اَلرَّاجِحُ.‏‏1 ‏- مراسيل أبي داود ( 183 )‏.‏","english":{"narrator":"","text":"Abu Dawud reported in al-Marasil as a saying of 'Ikrimah, and that is the strongest opinion."}},{"id":55,"idInBook":55,"chapterId":7,"bookId":17,"arabic":"وَأَخْرَجَهُ أَيْضاً مَوْقُوفاً عَلَى اِبْنِ عَبَّاسٍ بِإِسْنَادٍ قَوِيٍّ, وَرَجَّحَهُ اَلْبَيْهَقِيُّ  1‏ .‏‏1 ‏- المراسيل ( 182 )‏، وانظر سنن البيهقي ( 5 / 340 )‏.‏","english":{"narrator":"","text":"He also reported it Mawquf (as a saying of a Companion, i.e.) Ibn 'Abbas with a strong chain of narrators, and al-Baihaqi held it to the most correct narration."}},{"id":56,"idInBook":56,"chapterId":7,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-نَهَى عَنْ بَيْعِ اَلْمَضَامِينِ, وَالْمَلَاقِيحِ }  رَوَاهُ اَلْبَزَّارُ, وَفِي إِسْنَادِ  ضَعْفٌ  1‏ .‏‏1 ‏- ضعيف.‏ رواه البزار ( 1267 زوائد )‏.‏ والزيادة من \" أ \"، وتحرف فيها: \" ضعف \" إلى \" ضعيف \".‏","english":{"narrator":"Narrated Abu Hurairah (RA):","text":"The Prophet (ﷺ) forbade the sale of what is in the womb of a she-camel, and the semen that is in the body of a male-camel.\n\n."}},{"id":57,"idInBook":57,"chapterId":7,"bookId":17,"arabic":"عَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ أَقَالَ مُسْلِماً بَيْعَتَهُ, أَقَالَهُ اَللَّهُ عَثْرَتَهُ }  رَوَاهُ أَبُو دَاوُدَ, وَابْنُ مَاجَهْ, وَصَحَّحَهُ اِبْنُ حِبَّانَ, وَالْحَاكِمُ  1‏ .‏‏1 ‏- صحيح.‏ رواه أبو داود ( 3460 )‏، وابن ماجه ( 2199 )‏، وابن حبان ( 7 / 243 )‏، والحاكم ( 2 / 45 )‏.‏","english":{"narrator":"Narrated :","text":"Allah's Messenger (ﷺ) said: \"Whoever accepts back what he sold to a Muslim, Allah will forgive his fault.\"\n\n."}},{"id":58,"idInBook":58,"chapterId":7,"bookId":17,"arabic":"وَعَنْ اِبْنِ عُمَرَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏-, عَنْ رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { إِذَا تَبَايَعَ اَلرَّجُلَانِ, فَكُلُّ وَاحِدٍ مِنْهُمَا بِالْخِيَارِ مَا لَمْ يَتَفَرَّقَا وَكَانَا جَمِيعاً, أَوْ يُخَيِّرُ أَحَدُهُمَا اَلْآخَرَ, فَإِنْ خَيَّرَ أَحَدُهُمَا اَلْآخَرَ فَتَبَايَعَا عَلَى ذَلِكَ فَقَدَ وَجَبَ اَلْبَيْعُ, وَإِنْ تَفَرَّقَا بَعْدَ أَنْ تَبَايَعَا, وَلَمْ يَتْرُكْ وَاحِدٌ مِنْهُمَا اَلْبَيْعَ فَقَدْ وَجَبَ اَلْبَيْعُ }  مُتَّفَقٌ عَلَيْهِ, وَاللَّفْظُ لِمُسْلِمٍ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 2112 )‏، ومسلم ( 1531 )‏ ( 44 )‏.‏","english":{"narrator":"Narrated Ibn 'Umar (RA):","text":"Allah's Messenger (ﷺ) said: \"Both parties in a business transaction have a right to annul the transaction, so long as they have not separated and remain together; or one of them gives the other the choice (to conclude or annul the transaction); so, if one of them gives the other the choice (to conclude or annul the transaction) and then they make the transaction accordingly, the transaction then becomes binding; or if they separate after having made the transaction and none of them has annulled it, the transaction then becomes binding.\"\n\n."}},{"id":59,"idInBook":59,"chapterId":7,"bookId":17,"arabic":"وَعَنْ عَمْرِو بْنِ شُعَيْبٍ, عَنْ أَبِيهِ, عَنْ جَدِّهِ; أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَالَ: { اَلْبَائِعُ وَالْمُبْتَاعُ بِالْخِيَارِ حَتَّى يَتَفَرَّقَا, إِلَّا أَنْ تَكُونَ صَفْقَةَ  1‏ خِيَارٍ, وَلَا يَحِلُّ لَهُ أَنْ يُفَارِقَهُ خَشْيَةَ أَنْ يَسْتَقِيلَهُ }  رَوَاهُ اَلْخَمْسَةُ إِلَّا اِبْنَ مَاجَهْ, وَاَلدَّارَقُطْنِيُّ, وَابْنُ خُزَيْمَةَ, وَابْنُ اَلْجَارُودِ  2‏ .‏‏1 ‏- تحرف في \" أ \" إلى: \" صفة \".‏‏2 ‏- حسن.‏ رواه أبو داود ( 3456 )‏، والنسائي ( 7 / 251 ‏- 252 )‏، والترمذي ( 1247 )‏، وأحمد ( 3 / 183 )‏، والدارقطني ( 3 / 50 / 207 )‏، وابن الجارود ( 620 )‏، كلهم من طريق عمرو بن شعيب، به.‏ وقال الترمذي: \" هذا حديث حسن \".‏","english":{"narrator":"Narrated 'Amr bin Shu'aib on his father's authority from his grandfather (RA):","text":"The Prophet (ﷺ) said: \"The two parties (seller and buyer) in a business transaction have a choice (to annul it) until they separated (from one another), unless it is a transaction with the right to annul it attached to it; and it is not allowed for one to separated from the other for fear that he may cancel the deal.\"\n\n."}},{"id":60,"idInBook":60,"chapterId":7,"bookId":17,"arabic":"وَفِي رِوَايَةٍ: { حَتَّى يَتَفَرَّقَا مِنْ مَكَانِهِمَا }   1‏ .‏‏1 ‏- هي رواية الدارقطني، والبيهقي ( 5 / 271 )‏.‏","english":{"narrator":"Another narration has:","text":"\"till they separated from their place (of transaction).\""}},{"id":61,"idInBook":61,"chapterId":7,"bookId":17,"arabic":"وَعَنِ اِبْنِ عُمَرَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: ذَكَرَ رَجُلٌ لِلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-أَنَّهُ يُخْدَعُ فِي اَلْبُيُوعِ فَقَالَ: { إِذَا بَايَعْتَ فَقُلْ: لَا خَلَابَةَ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 2117 )‏، ومسلم ( 1533 )‏.‏ وفي \" الأصل \": \" بعت \" والمثبت من \" أ \" وهو الموافق لما في \" الصحيحين \".‏ وزاد البخاري ( 2407 )‏: \" فكان الرجل يقوله \".‏ وفي رواية مسلم: \" فكان إذا بايع يقول: لا خيابة \".‏ قلت: والرجل هو: حبان بن منقذ الأنصاري، وكان يقول ذلك للثغة في لسانه، ففي رواية ابن الجارود ( 567 )‏: \" عن ابن عمر ‏-رضي الله عنهما‏-: أن حبان بن منقذ كان سفع في رأسه مأمومة، فثقلت لسانه، وكان يخدع … الحديث.‏","english":{"narrator":"Narrated Ibn 'Umar (RA):","text":"A man told Allah's Messenger (ﷺ) that he was being deceived (cheated) in business transactions, and he replied, \"When you make a purchase say, 'Deceiving (cheating) is not allowed (i.e. he has the choice to return the goods if he wills).'\"\n\n."}},{"id":62,"idInBook":62,"chapterId":7,"bookId":17,"arabic":"عَنْ جَابِرٍ ‏- رضى الله عنه ‏- قَالَ: { لَعَنَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-آكِلَ اَلرِّبَا, وَمُوكِلَهُ, وَكَاتِبَهُ, وَشَاهِدَيْهِ, وَقَالَ: \n\" هُمْ سَوَاءٌ \" }  رَوَاهُ مُسْلِمٌ  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم ( 1598 )‏.‏","english":{"narrator":"Narrated Jabir (RA):","text":"Allah's Messenger (ﷺ) cursed the one who accepts usury, the one who gives it, the one who records it and the two witnesses to it, saying, \"They are all the same.\"\n\n."}},{"id":63,"idInBook":63,"chapterId":7,"bookId":17,"arabic":"وَلِلْبُخَارِيِّ نَحْوُهُ مِنْ حَدِيثِ أَبِي جُحَيْفَةَ  1‏ .‏‏1 ‏- ومحل الشاهد منه قوله: ولعن آكل الربا وموكله .‏.‏ رواه البخاري ( 5962 )‏.‏","english":{"narrator":"","text":"al-Bukhari reported something similar from the Hadith of Abu Juhaifah."}},{"id":64,"idInBook":64,"chapterId":7,"bookId":17,"arabic":"وَعَنْ عَبْدِ اَللَّهِ بْنِ مَسْعُودٍ ‏- رضى الله عنه ‏- عَنْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { اَلرِّبَا ثَلَاثَةٌ وَسَبْعُونَ بَابًا أَيْسَرُهَا مِثْلُ أَنْ يَنْكِحَ اَلرَّجُلُ أُمَّهُ, وَإِنَّ أَرْبَى اَلرِّبَا عِرْضُ اَلرَّجُلِ اَلْمُسْلِمِ }  رَوَاهُ اِبْنُ مَاجَهْ مُخْتَصَراً, وَالْحَاكِمُ بِتَمَامِهِ وَصَحَّحَهُ  1‏ .‏‏1 ‏- صحيح.‏ روى ابن ماجه ( 2275 )‏، الجملة الأولى منه فقط.‏ ورواه الحاكم ( 2 / 37 )‏ وقال: \" صحيح على شرط الشيخين \".‏ قلت: وهو حديث صحيح، وإن أنكره بعضهم كالبيهقي؛ إذ شواهده كثيرة، وتفصيل ذلك في \" الأصل \".‏","english":{"narrator":"Narrated 'Abdullah bin Mas'ud (RA):","text":"The Prophet (ﷺ) said: \"Usury has seventy-three categories, the least one in sin is as that of a man who marries (has sexual relations with) his mother, and the very essence of usury is the (violation of the) honor of a Muslim man.\"\n\n."}},{"id":65,"idInBook":65,"chapterId":7,"bookId":17,"arabic":"وَعَنْ أَبِي سَعِيدٍ اَلْخُدْرِيِّ ‏- رضى الله عنه ‏- أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { لَا تَبِيعُوا اَلذَّهَبَ بِالذَّهَبِ إِلَّا مِثْلًا بِمِثْلٍ, وَلَا تُشِفُّوا  1‏ بَعْضَهَا عَلَى بَعْضٍ, وَلَا تَبِيعُوا اَلْوَرِقَ بِالْوَرِقِ إِلَّا مِثْلًا بِمِثْلٍ, وَلَا تُشِفُّوا بَعْضَهَا عَلَى بَعْضٍ, وَلَا تَبِيعُوا مِنْهَا غَائِباً بِنَاجِزٍ }  مُتَّفَقٌ عَلَيْهِ  2‏ .‏‏1 ‏- بضم المثناة الفوقية، فشين معجمة مكسورة، ففاء مشددة.‏ أي: لا تفضلوا.‏‏2 ‏- صحيح.‏ رواه البخاري ( 2177 )‏، ومسلم ( 1584 )‏.‏","english":{"narrator":"Narrated Abu Sa'id al-Khudri (RA):","text":"The Prophet (ﷺ) said: \"Do not sell gold for gold unless it is the same amount for the same amount, and do not make one amount greater than the other. Do not sell silver for silver unless it is the same amount for the same amount, and do not make one amount greater than the other. And do not sell that (cash money) which is not present (at the time of the transaction) for that (cash money) which is present.\"\n\n."}},{"id":66,"idInBook":66,"chapterId":7,"bookId":17,"arabic":"وَعَنْ عُبَادَةَ بْنِ اَلصَّامِتِ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ اَلذَّهَبُ بِالذَّهَبِ, وَالْفِضَّةُ بِالْفِضَّةِ, وَالْبُرُّ بِالْبُرِّ, وَالشَّعِيرُ بِالشَّعِيرِ, وَالتَّمْرُ بِالتَّمْرِ, وَالْمِلْحُ بِالْمِلْحِ, مِثْلًا بِمِثْلٍ, سَوَاءً بِسَوَاءٍ, يَدًا بِيَدٍ, فَإِذَا اِخْتَلَفَتْ هَذِهِ اَلْأَصْنَافُ فَبِيعُوا كَيْفَ شِئْتُمْ إِذَا كَانَ يَدًا بِيَدٍ }  رَوَاهُ مُسْلِمٌ  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم ( 1587 )‏ ( 81 )‏.‏","english":{"narrator":"Narrated 'Ubadah bin as-Samit (RA):","text":"Allah's Messenger (ﷺ) said: \"Gold is to be paid for with gold, silver with silver, wheat with wheat, barley with barley, dates with dates, and salt with salt, same quantity for same quantity and equal for equal, hand to hand (i.e. payment being made on the spot). If these classes differ, sell as you wish as long as payment is made on the spot.\"\n\n."}},{"id":67,"idInBook":67,"chapterId":7,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ اَلذَّهَبُ بِالذَّهَبِ وَزْناً بِوَزْنٍ مِثْلًا بِمِثْلٍ، وَالْفِضَّةُ بِالْفِضَّةِ وَزْناً بِوَزْنٍ مِثْلًا بِمِثْلٍ, فَمَنْ زَادَ أَوْ اِسْتَزَادَ فَهُوَ رِبًا }  رَوَاهُ مُسْلِمٌ  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم ( 1588 )‏ ( 84 )‏.‏","english":{"narrator":"Narrated Abu Hurairah (RA):","text":"Allah's Messenger (ﷺ) said: \"Gold is to be paid for with gold, both being of equal weight and of same quantities; silver is to be paid for with silver, both being of equal weight and of same quantities. If anyone gives more or asks for more of it, it is then usury.\"\n\n."}},{"id":68,"idInBook":68,"chapterId":7,"bookId":17,"arabic":"وَعَنْ أَبِي سَعِيدٍ, وَأَبِي هُرَيْرَةَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- { ;أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-اِسْتَعْمَلَ رَجُلًا عَلَى خَيْبَرٍ, فَجَاءَهُ بِتَمْرٍ جَنِيبٍ, فَقَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-أَكُلُّ تَمْرِ خَيْبَرَ هَكَذَا? \n\" فَقَالَ: لَا, وَاَللَّهِ يَا رَسُولَ اَللَّهِ, إِنَّا لَنَأْخُذُ اَلصَّاعَ مِنْ هَذَا بِالصَّاعَيْنِ وَالثَّلَاثَةِ  1‏ فَقَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-\" لَا تَفْعَلْ، بِعِ اَلْجَمْعَ بِالدَّرَاهِمِ, ثُمَّ اِبْتَعْ بِالدَّرَاهِمِ جَنِيبًا }  وَقَالَ فِي اَلْمِيزَانِ مِثْلَ ذَلِكَ.‏ مُتَّفَقٌ عَلَيْهِ  2‏ .‏‏1 ‏- في \" الأصلين \" وفي \" الصحيحين \": \" إنا لنأخذ الصاع من هذا بالصاعين، والصاعين بالثلاثة \".‏‏2 ‏- صحيح.‏ رواه البخاري ( 4 / 399 ‏- 400 و 481 )‏، ومسلم ( 1593 )‏ ( 95 )‏.‏","english":{"narrator":"Narrated Abu Sa'id al-Khudri and Abu Hurairah (RA):","text":"Allah's Messenger (ﷺ) appointed a man over Khaibar and he brought him dates of a very fine quality. Allah's Messenger (ﷺ) asked, \"Are all the dates of Khaibar like this?\" He replied, \"I swear by Allah that they are certainly not, O Allah's Messenger. We take one Sa' of this kind for two, and even for three (of lesser quality). So Allah's Messenger (ﷺ) said: \"Do not do so. Sell the mixed dates for Dirhams, then buy the very fine dates with the Dirhams.\" And he said that the same applies when things are sold by weight.\n\n."}},{"id":69,"idInBook":69,"chapterId":7,"bookId":17,"arabic":"وَلِمُسْلِمٍ: \n\" وَكَذَلِكَ اَلْمِيزَانُ \"  1‏ .‏‏1 ‏- مسلم ( 1593 )‏ ( 94 )‏.‏","english":{"narrator":"Muslim has:","text":"\"and so is (that which is sold by) weight.\""}},{"id":70,"idInBook":70,"chapterId":7,"bookId":17,"arabic":"وَعَنْ جَابِرِ بْنِ عَبْدِ اَللَّهِ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ : { نَهَى رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-عَنْ بَيْعِ اَلصُّبْرَةِ مِنَ اَلتَّمْرِ لا يُعْلَمُ مَكِيلُهَا  1‏ بِالْكَيْلِ اَلْمُسَمَّى مِنَ اَلتَّمْرِ }  رَوَاهُ مُسْلِمٌ  2‏ .‏‏1 ‏- في \" مسلم \" مكيلتها \".‏‏2 ‏- صحيح.‏ رواه مسلم ( 1530 )‏، والصبرة: الطعام المجتمع.‏ والمراد النهي عن بيع الكومة من التمر المجهولة القدر، بالكيل المعين القدر من التمر.‏","english":{"narrator":"Narrated Jabir bin 'Abdullah (RA):","text":"Allah's Messenger (ﷺ) forbade selling a quantity of dates whose measure was unknown for a specified (known) quantity of dates.\n\n."}},{"id":71,"idInBook":71,"chapterId":7,"bookId":17,"arabic":"وَعَنْ مَعْمَرِ بْنِ عَبْدِ اَللَّهِ ‏- رضى الله عنه ‏- قَالَ: إِنِّي كُنْتُ أَسْمَعُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ: { اَلطَّعَامُ بِالطَّعَامِ مِثْلاً بِمِثْلٍ \" وَكَانَ طَعَامُنَا يَوْمَئِذٍ اَلشَّعِيرَ }  رَوَاهُ مُسْلِمٌ  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم ( 1592 )‏ من طريق أبي النظر؛ أن بسر بن سعيد حدثه، عن معمر بن عبد الله؛ أنه أرسل غلامه بصاع قمح.‏ فقال: بعه.‏ ثم اشتر به شعيرا.‏ فذهب الغلام، فأخذ صاعا وزيادة بعض صاع.‏ فلما جاء معمر أخبره بذلك.‏ فقال له معمر: لم فعلت ذلك؟ انطلق فرده، ولا تأخذن إلا مثلا بمثل، فإني كنت أسمع رسول الله ‏-صلى الله عليه وسلم‏- يقول: … الحديث.‏ وزاد: قيل له: فإنه ليس بمثله.‏ قال: إني أخاف أن يضارع.‏","english":{"narrator":"Narrated Ma'mar bin 'Abdullah (RA):","text":"I used to hear Allah's Messenger (ﷺ) say, \"Food (may be sold) for food, of same quantities.\" Our food at that time consisted of barley.\n\n."}},{"id":72,"idInBook":72,"chapterId":7,"bookId":17,"arabic":"وَعَنْ فَضَالَةَ بْنِ عُبَيْدٍ ‏- رضى الله عنه ‏- قَالَ: { اِشْتَرَيْتُ يَوْمَ خَيْبَرَ قِلَادَةً بِاِثْنَيْ عَشَرَ دِينَاراً, فِيهَا ذَهَبٌ وَخَرَزٌ، فَفَصَلْتُهَا  1‏ فَوَجَدْتُ فِيهَا أَكْثَرَ مِنْ اِثْنَيْ عَشَرَ دِينَاراً, فَذَكَرْتُ ذَلِكَ لِلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-فَقَالَ: \" لَا تُبَاعُ حَتَّى تُفْصَلَ }  رَوَاهُ مُسْلِمٌ  2‏ .‏‏1 ‏- أي: جعلت الذهب وحده والخرز وحده.‏‏2 ‏- صحيح.‏ رواه مسلم ( 1591 )‏ ( 90 )‏.‏","english":{"narrator":"Narrated Fadala bin 'Ubaid (RA):","text":"I bought a necklace for twelve Dinars at the battle of Khaibar and it contained gold and gems. I considered them separately and found that it was worth more than twelve Dinars. I told the Prophet (ﷺ) about that and he said, \"It must not be sold till the contents are considered separately.\"\n\n."}},{"id":73,"idInBook":73,"chapterId":7,"bookId":17,"arabic":"وَعَنْ سَمُرَةَ بْنِ جُنْدُبٍ ‏- رضى الله عنه ‏- { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-نَهَى عَنْ بَيْعِ اَلْحَيَوَانِ بِالْحَيَوَانِ نَسِيئَةً }  رَوَاهُ اَلْخَمْسَةُ, وَصَحَّحَهُ اَلتِّرْمِذِيُّ, وَابْنُ اَلْجَارُودِ  1‏ .‏‏1 ‏- صحيح بشواهده.‏ رواه أبو داود ( 3356 )‏، والنسائي ( 7 / 292 )‏، والترمذي ( 1237 )‏، وابن ماجه ( 2270 )‏، وأحمد ( 5 / 12 و 19 و 22 )‏، وابن الجارود ( 611 )‏ من طريق الحسن، عن سمرة، به.‏ وقال الترمذي: \" حديث حسن صحيح \".‏ قلت: والحسن مدلس وقد عنعنه، إلا أن له شواهد ‏- يصح بها الحديث ‏- مذكورة \" بالأصل \".‏","english":{"narrator":"Narrated Samura bin Jundub (RA):","text":"The Prophet (ﷺ) forbade selling animals for animals when payment was to be made at a later date.\n\n."}},{"id":74,"idInBook":74,"chapterId":7,"bookId":17,"arabic":"وَعَنْ عَبْدِ اَللَّهِ بْنِ عَمْرٍو ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏-; { أَنَّ رَسُولَ ‏- صلى الله عليه وسلم ‏-أَمَرَهُ أَنْ يُجَهِّزَ جَيْشًا فَنَفِدَتْ اَلْإِبِلُ، فَأَمَرَهُ أَنْ يَأْخُذَ عَلَى قَلَائِصِ اَلصَّدَقَةِ.‏ قَالَ: فَكُنْتُ آخُذُ اَلْبَعِيرَ بِالْبَعِيرَيْنِ إِلَى إِبِلِ اَلصَّدَقَةِ }  رَوَاهُ اَلْحَاكِمُ وَالْبَيْهَقِيُّ, وَرِجَالُهُ ثِقَاتٌ  1‏ .‏‏1 ‏- حسن.‏ رواه الحاكم ( 2 / 56 ‏- 57 )‏، والبيهقي ( 5 / 287 ‏- 288 )‏.‏ قلت: والحديث أعل بما لا يقدح، وبيان ذلك \" بالأصل \"، ولكن يجدر التنبيه هنا على أن الحديث رواه أبو داود وأحمد وهما بلا شك أعلى ممن ذكر الحافظ.‏ وثانيا: الحديث عند الحاكم من طريق يختلف عن طريقه عند البيهقي.‏","english":{"narrator":"Narrated 'Abdullah bin 'Amr bin al-'Aar (RA):","text":"The Prophet (ﷺ) commanded him to equip an army. Then, when the camels were insufficient, he commanded him to keep back the young camels of Sadaqah. He said, \"I was taking a camel to be replaced by two when the camels of Sadaqah came.\"\n\n."}},{"id":75,"idInBook":75,"chapterId":7,"bookId":17,"arabic":"وَعَنِ اِبْنِ عُمَرَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- : سَمِعْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ: { إِذَا تَبَايَعْتُمْ بِالْعِينَةِ, وَأَخَذْتُمْ أَذْنَابَ اَلْبَقَرِ, وَرَضِيتُمْ بِالزَّرْعِ, وَتَرَكْتُمْ اَلْجِهَادَ, سَلَّطَ اَللَّهُ عَلَيْكُمْ ذُلًّا لَا يَنْزِعُهُ حَتَّى تَرْجِعُوا إِلَى دِينِكُمْ }  رَوَاهُ أَبُو دَاوُدَ مِنْ رِوَايَةِ نَافِعٍ عَنْهُ, وَفِي إِسْنَادِهِ مَقَالٌ.‏  1‏ .‏‏1 ‏- صحيح بطرقه رواه أبو داود ( 3462 )‏.‏","english":{"narrator":"Narrated Ibn 'Umar (RA):","text":"I heard Allah's Messenger (ﷺ) say, \"If you sell anything on credit to anyone, on the condition that you will buy it back for a lower price (al-'Einah), take hold of the tails of cattle, become pleased with agriculture and give up Jihad - Allah will make disgrace prevail over you and will not remove it from you till you return to your religion.\"\n\n."}},{"id":76,"idInBook":76,"chapterId":7,"bookId":17,"arabic":"وَلِأَحْمَدَ: نَحْوُهُ مِنْ رِوَايَةِ عَطَاءٍ, وَرِجَالُهُ ثِقَاتٌ  1‏ وَصَحَّحَهُ اِبْنُ اَلْقَطَّانِ  2‏ .‏‏1 ‏- أحمد في \" المسند \" رقم ( 4825 )‏.‏ قلت: وله طريق ثالث.‏ رواه أحمد رقم ( 5007 )‏ من طريق شهر بن حوشب، عن ابن عمر.‏ والحديث صحيح بهذه الطرق.‏‏2 ‏- بيان الوهم والإيهام ( 2 / 151 / 2 )‏ وإلى هذا أيضا ذهب غيره من أهل العلم كابن تيمية والشوكاني ‏-رحمهما الله‏-، وشيخنا ‏-حفظه الله تعالى‏-.‏","english":{"narrator":"","text":"Ahmad reported something similar from the narration of 'Ata. Its narrators are reliable and Ibn al-Qattan graded it Sahih (authentic)."}},{"id":77,"idInBook":77,"chapterId":7,"bookId":17,"arabic":"وَعَنْ أَبِي أُمَامَةَ ‏- رضى الله عنه ‏- عَنِ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { مَنْ شَفَعَ لِأَخِيهِ شَفَاعَةً, فَأَهْدَى لَهُ هَدِيَّةً, فَقَبِلَهَا, فَقَدْ أَتَى بَابًا عَظِيماً مِنْ أَبْوَابِ اَلرِّبَا }  رَوَاهُ أَحْمَدُ, وَأَبُو دَاوُدَ, وَفِي إِسْنَادِهِ مَقَالٌ  1‏ .‏‏1 ‏- ضعيف.‏ رواه أحمد ( 5 / 261 )‏، وأبو داود ( 3541 )‏.‏","english":{"narrator":"Narrated Abu Umamah (RA):","text":"The Prophet (ﷺ) said: \"Whoever intercedes for his brother and that one gives him a gift for that (intercession) which he accepts, he has engaged in one of the most terrible types of Riba (undeserving increase in something).\"\n\n."}},{"id":78,"idInBook":78,"chapterId":7,"bookId":17,"arabic":"وَعَنْ عَبْدِ اَللَّهِ بْنِ عَمْرِوٍ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: { لَعَنَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-اَلرَّاشِي وَالْمُرْتَشِيَ }  رَوَاهُ أَبُو دَاوُدَ, وَاَلتِّرْمِذِيُّ وَصَحَّحَهُ  1‏ .‏‏1 ‏- صحيح.‏ رواه أبو داود ( 3580 )‏، والترمذي ( 1337 )‏.‏ وقال الترمذي: \" حسن صحيح \".‏","english":{"narrator":"Narrated 'Abdullah bin 'Amr bin al-Aas (RA):","text":"Allah's Messenger (ﷺ) cursed the one who bribes and the one who takes bribes.\n\n."}},{"id":79,"idInBook":79,"chapterId":7,"bookId":17,"arabic":"وَعَنْ اِبْنِ عُمَرَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: { نَهَى رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-عَنِ الْمُزَابَنَةِ; أَنْ يَبِيعَ ثَمَرَ حَائِطِهِ إِنْ كَانَ نَخْلاً بِتَمْرٍ كَيْلاً, وَإِنْ كَانَ كَرْماً أَنْ يَبِيعَهُ بِزَبِيبٍ كَيْلاً, وَإِنْ كَانَ زَرْعاً أَنْ يَبِيعَهُ بِكَيْلِ طَعَامٍ, نَهَى عَنْ ذَلِكَ كُلِّهُ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏ 845 ‏- وَعَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ ‏- رضى الله عنه ‏- قَالَ: { سَمِعْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-سُئِلَ عَنِ اِشْتِرَاءِ اَلرُّطَبِ بِالتَّمْرِ.‏ فَقَالَ: أَيَنْقُصُ اَلرُّطَبُ إِذَا يَبِسَ? \" قَالُوا: نَعَمَ.‏ فَنَهَى عَنْ ذَلِكَ }  رَوَاهُ اَلْخَمْسَةُ, وَصَحَّحَهُ اِبْنُ اَلْمَدِينِيِّ, وَاَلتِّرْمِذِيُّ, وَابْنُ حِبَّانَ, وَالْحَاكِمُ  2‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 2205 )‏، ومسلم ( 1542 )‏ ( 76 )‏.‏‏2 ‏- صحيح.‏ رواه أبو داود ( 3359 )‏، والنسائي ( 7 / 268 ‏- 269 )‏، والترمذي ( 1225 )‏، وابن ماجه ( 2264 )‏، وأحمد ( 1 / 175 )‏، وابن حبان ( 4982 )‏، والحاكم ( 2 / 38 )‏، من طريق مالك، عن عبد الله بن يزيد، أن زيدا أبا عياش أخبره؛ أنه سأل سعد بن أبي وقاص، عن البيضاء بالسلت؟ فقال له سعد أيتهما أفضل قال: البيضاء، فنهاه عن ذلك، وقال سعد: سمعت رسول ‏-صلى الله عليه وسلم‏- … الحديث.‏ وقال الترمذي: \" حديث حسن صحيح \".‏ قلت: وتابع مالكا على ذلك جماعة من الثقات؛ إلا أن يحيى بن أبي كثير تابعهم في الإسناد، وخالفهم في المتن؛ إذ رواه بلفظ: نهى رسول الله ‏-صلى الله عليه وسلم‏-: عن بيع الرطب بالتمر نسيئة وهو شاذ بهذا اللفظ \" نسيئة \" كما حكم بذلك غير واحد، وبيانه \" بالأصل \".‏","english":{"narrator":"Narrated Ibn 'Umar (RA):","text":"Allah's Messenger (ﷺ) forbade al-Muzabanah, which means that a man sells the fruit of his garden, if it consists of palm-trees (fresh dates), for dried dates by measure; or if it consists of grapes (on the vines), for raisins by measure; or if it is unpicked crops, he sells it for a measured amount of picked crops. He forbade all that.\n\n.\n\nNarrated Sa'd bin Abu Waqqas (RA): I heard Allah's Messenger (ﷺ) being asked about buying fresh dates for dry ones. He replied, \"Will fresh dates diminish when they become dry?\" They answered, \"Yes.\" So he forbade that.\n\n."}},{"id":80,"idInBook":80,"chapterId":7,"bookId":17,"arabic":"وَعَنِ اِبْنِ عُمَرَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏-; { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-نَهَى عَنْ بَيْعِ اَلْكَالِئِ بِالْكَالِئِ, يَعْنِي: اَلدَّيْنِ بِالدَّيْنِ }  رَوَاهُ إِسْحَاقُ, وَالْبَزَّارُ بِإِسْنَادٍ ضَعِيفٍ  1‏ .‏‏1 ‏- ضعيف.‏ وهو في \" كشف الأستار \" ( 1280 )‏، ورواه الدارقطني، والطحاوي، والحاكم، والبيهقي، وضعفه جمع غفير من أهل العلم، وذلك لتفرد موسى بن عبيدة الزبيدي، به.‏ قال الحافظ في \" التلخيص \" ( 3 / 26 )‏: \" قال أحمد بن حنبل: لا تحل عندي عنه الرواية، ولا أعرف هذا الحديث عن غيره، وقال أيضا: ليس في هذا صحيح يصح، لكن إجماع الناس على أنه لا يجوز بيع دين بدين \".‏","english":{"narrator":"Narrated Ibn 'Umar (RA):","text":"The Prophet (ﷺ) forbade selling a debt to be paid at a future date for another i.e., a debt for a debt.\n\n."}},{"id":81,"idInBook":81,"chapterId":7,"bookId":17,"arabic":"عَنْ زَيْدِ بْنِ ثَابِتٍ ‏- رضى الله عنه ‏- { أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-رَخَّصَ فِي اَلْعَرَايَا: أَنْ تُبَاعَ بِخَرْصِهَا كَيْلاً }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 2192 )‏، ومسلم ( 1539 )‏ ( 64 )‏.‏","english":{"narrator":"Narrated Zaid bin THabit (RA):","text":"Allah's Messenger (ﷺ) gave permission regarding al-'Araya for its sale on the basis of a calculation (of what the dates would be when dry) by measure.\n\n."}},{"id":82,"idInBook":82,"chapterId":7,"bookId":17,"arabic":"وَلِمُسْلِمٍ: { رَخَّصَ فِي اَلْعَرِيَّةِ يَأْخُذُهَا أَهْلُ اَلْبَيْتِ بِخَرْصِهَا تَمْرًا، يَأْكُلُونَهَا رُطَبًا }   1‏ .‏‏1 ‏- مسلم ( 1539 )‏ ( 61 )‏.‏","english":{"narrator":"Muslim has:","text":"\"He gave permission regarding al-'Araya (for its sale) in which the household buys its fruit on the basis of a calculation (of what the dates would be when dry), yet they could eat them fresh (from the tree)."}},{"id":83,"idInBook":83,"chapterId":7,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- { أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-رَخَّصَ فِي بَيْعِ اَلْعَرَايَا بِخَرْصِهَا, فِيمَا دُونَ خَمْسَةِ أَوْسُقٍ, أَوْ فِي خَمْسَةِ أَوْسُقٍ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 2190 )‏، ومسلم ( 1541 )‏.‏","english":{"narrator":"Narrated Abu Hurairah (RA):","text":"Allah's Messenger (ﷺ) gave permission regarding the sale of al-'Araya, on the basis of calculation of their amount, for dry dates, on the condition that they be less than five Awsuq, or amounting to five Awsuq.\n\n."}},{"id":84,"idInBook":84,"chapterId":7,"bookId":17,"arabic":"وَعَنِ اِبْنِ عُمَرَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: { نَهَى رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-عَنْ بَيْعِ اَلثِّمَارِ حَتَّى يَبْدُوَ صَلَاحُهَا, نَهَى اَلْبَائِعَ وَالْمُبْتَاعَ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 2194 )‏، ومسلم ( 3 / 1165 / رقم 1534 )‏.‏","english":{"narrator":"Narrated Ibn 'Umar (RA):","text":"Allah's Messenger (ﷺ) forbade the sale of fruits till they appear to ripe, forbidding it both to the seller and to the buyer.\n\n."}},{"id":85,"idInBook":85,"chapterId":7,"bookId":17,"arabic":"وَفِي رِوَايَةٍ: وَكَانَ إِذَا سُئِلَ عَنْ صَلَاحِهَا? قَالَ: \n\" حَتَّى تَذْهَبَ عَاهَتُهُ \"  1‏ .‏‏1 ‏- الرواية للبخاري ( 1486 )‏، ولمسلم أيضا ( 3 / 1166 )‏، والمسئول هو ابن عمر ‏-رضي الله عنهما‏-.‏","english":{"narrator":"A narration has:","text":"\"When he was asked about (the words): 'appear to be ripe'?\" He (ﷺ) replied, \"Till they were safe from damage or disease.\""}},{"id":86,"idInBook":86,"chapterId":7,"bookId":17,"arabic":"وَعَنْ أَنَسِ بْنِ مَالِكٍ ‏- رضى الله عنه ‏- { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-نَهَى عَنْ بَيْعِ اَلثِّمَارِ حَتَّى تُزْهَى.‏ قِيلَ: وَمَا زَهْوُهَا? قَالَ: \" تَحْمَارُّ وَتَصْفَارُّ }  مُتَّفَقٌ عَلَيْهِ , وَاللَّفْظُ لِلْبُخَارِيِّ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 1488 )‏، ومسلم ( 1555 )‏، وفي اللفظ الذي ساقه الحافظ، وتخصيصه بالبخاري نظر.‏","english":{"narrator":"Narrated Anas bin Malik (RA):","text":"The Prophet (ﷺ) forbade the sale of fruits till they become colorful. He was asked what that meant, he replied, \"Till they become reddish and yellowish.\"\n\n."}},{"id":87,"idInBook":87,"chapterId":7,"bookId":17,"arabic":"وَعَنْ أَنَسِ بْنِ مَالِكٍ ‏- رضى الله عنه ‏- { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-نَهَى عَنْ بَيْعِ اَلْعِنَبِ حَتَّى يَسْوَدَّ, وَعَنْ بَيْعِ اَلْحَبِّ حَتَّى يَشْتَدَّ }  رَوَاهُ اَلْخَمْسَةُ, إِلَّا النَّسَائِيَّ, وَصَحَّحَهُ اِبْنُ حِبَّانَ, وَالْحَاكِمُ  1‏ .‏‏1 ‏- صحيح.‏ رواه أبو داود ( 3371 )‏، والترمذي ( 1228 )‏، وابن ماجه ( 2217 )‏، وأحمد ( 3 / 221 و 250 )‏، وابن حبان ( 4972 )‏، والحاكم ( 2 / 19 )‏.‏ وقال الحاكم: \" صحيح على شرط مسلم \" وهو كما قال.‏","english":{"narrator":"Narrated Anas bin Malik (RA):","text":"The Prophet (ﷺ) forbade the sale of grapes till they become black (i.e. ripe) and the sale of grain till it becomes hard (i.e. ripe).\n\n."}},{"id":88,"idInBook":88,"chapterId":7,"bookId":17,"arabic":"وَعَنْ جَابِرِ بْنِ عَبْدِ اَللَّهِ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَوْ بِعْتَ مِنْ أَخِيكَ ثَمَراً فَأَصَابَتْهُ جَائِحَةٌ, فَلَا يَحِلُّ لَكَ أَنْ تَأْخُذَ مِنْهُ شَيْئًا.‏ بِمَ تَأْخُذُ مَالَ أَخِيكَ بِغَيْرِ حَقٍّ? }  رَوَاهُ مُسْلِمٌ  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم ( 1554 )‏ ( 14 )‏.‏","english":{"narrator":"Narrated Jabir bin 'Abdullah (RA):","text":"Allah's Messenger (ﷺ) said: \"If you sell some fruit to your brother and it was struck by blight, it would not be lawful for you to take anything from him. How can you take your brother's money unjustly?\"\n\n."}},{"id":89,"idInBook":89,"chapterId":7,"bookId":17,"arabic":"وَفِي رِوَايَةٍ لَهُ: { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-أَمَرَ بِوَضْعِ اَلْجَوَائِحِ }   1‏ .‏‏1 ‏- مسلم ( 3 / 1191 )‏.‏ الجائحة: الآفة تصيب الثمار فتتلفها.‏","english":{"narrator":"In another narration he has:","text":"\"The Prophet (ﷺ) commanded that unforeseen loss be remitted in respect of what is affected by blight.\""}},{"id":90,"idInBook":90,"chapterId":7,"bookId":17,"arabic":"وَعَنِ اِبْنِ عُمَرَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏-, عَنِ النَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { مَنِ اِبْتَاعَ نَخْلًا بَعْدَ أَنْ تُؤَبَّرَ, فَثَمَرَتُهَا لِلْبَائِعِ اَلَّذِي بَاعَهَا, إِلَّا أَنْ يَشْتَرِطَ اَلْمُبْتَاعُ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 2379 )‏، ومسلم ( 1543 )‏ ( 80 )‏ وزادا: ومن ابتاع عبدا وله مال فماله للذي باعه إلا أن يشترط المبتاع والتأبير: هو التشقيق والتلقيح.‏","english":{"narrator":"Narrated Ibn 'Umar (RA):","text":"The Prophet (ﷺ) said: \"If anyone buys a palm tree after it has been pollinated, the fruits belong to the seller who has sold them unless the buyer makes a condition.\"\n\n."}},{"id":91,"idInBook":91,"chapterId":7,"bookId":17,"arabic":"عَنِ اِبْنِ عَبَّاسٍ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: قَدِمَ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-اَلْمَدِينَةَ, وَهُمْ يُسْلِفُونَ فِي اَلثِّمَارِ اَلسَّنَةَ وَالسَّنَتَيْنِ, فَقَالَ: { مَنْ أَسْلَفَ فِي تَمْرٍ فَلْيُسْلِفْ فِي كَيْلٍ مَعْلُومٍ, وَوَزْنٍ مَعْلُومٍ, إِلَى أَجَلٍ مَعْلُومٍ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 2239 )‏، ومسلم ( 1604 )‏، واللفظ لمسلم.‏","english":{"narrator":"Narrated Ibn 'Abbas (RA):","text":"When the Prophet (ﷺ) came to al-Madinah, they were paying one and two years in advance for fruits. So he (ﷺ) said: \"Those who paid in advance for fruits must do so for a specified measurement and weight, and for a specified time.\"\n\n."}},{"id":92,"idInBook":92,"chapterId":7,"bookId":17,"arabic":"وَلِلْبُخَارِيِّ: \n\" مَنْ أَسْلَفَ فِي شَيْءٍ \"  1‏ .‏‏1 ‏- هذه رواية البخاري برقم ( 2240 )‏.‏","english":{"narrator":"al-Bukhari has:","text":"\"Those who pay in advance for anything.\""}},{"id":93,"idInBook":93,"chapterId":7,"bookId":17,"arabic":"وَعَنْ عَبْدِ اَلرَّحْمَنِ بْنِ أَبْزَى، وَعَبْدِ اَللَّهِ بْنِ أَبِي أَوْفَى ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَا: { كُنَّا نُصِيبُ اَلْمَغَانِمَ مَعَ رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-وَكَانَ يَأْتِينَا أَنْبَاطٌ مِنْ أَنْبَاطِ اَلشَّامِ, فَنُسْلِفُهُمْ فِي اَلْحِنْطَةِ وَالشَّعِيرِ وَالزَّبِيبِ ‏- وَفِي رِوَايَةٍ: وَالزَّيْتِ  1‏ ‏- إِلَى أَجَلٍ مُسَمًّى.‏ قِيلَ: أَكَانَ لَهُمْ زَرْعٌ? قَالَا: مَا كُنَّا نَسْأَلُهُمْ عَنْ ذَلِكَ }  رَوَاهُ اَلْبُخَارِيُّ  2‏ .‏‏1 ‏- مقتضى سياق الحافظ لهذه الرواية كان يحسن أن يقول: \" والزيت ‏- وفي رواية: والزبيب \".‏‏2 ‏- صحيح.‏ رواه البخاري ( 4 / 434 / رقم 2254 و 2255 )‏.‏ وهذا السياق بلفظ الزيت، وأما رواية: \" الزبيب \" فهي: ( 4 / 431 )‏.‏","english":{"narrator":"Narrated 'Abdur-Rahman bin Abza and 'Abdullah bin Abu Aufa (RA):","text":"\"We were getting a portion of the spoils of war along with Allah's Messenger (ﷺ), and some Nabateans (Arabs who mixed with non-Arabs and corrupted their language and lineage) from those of Syria used to come to us and we would pay in advance to them for wheat, barley and raisins - A narration has: 'and olive oil' - for a specified fixed time.\" It was asked, \"Did they have standing crop?\" They replied, \"We were not asking them about that.\"\n\n."}},{"id":94,"idInBook":94,"chapterId":7,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- عَنِ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { مَنْ أَخَذَ أَمْوَالَ اَلنَّاسِ يُرِيدُ أَدَاءَهَا, أَدَّى اَللَّهُ عَنْهُ, وَمَنْ أَخَذَهَا  1‏ يُرِيدُ إِتْلَافَهَا, أَتْلَفَهُ اَللَّهُ }  رَوَاهُ اَلْبُخَارِيُّ  2‏ .‏‏1 ‏- كذا \" بالأصلين \": وفي البخاري: \" أخذ \".‏‏2 ‏- صحيح.‏ رواه البخاري ( 2387 )‏.‏","english":{"narrator":"Narrated Abu Hurairah (RA):","text":"The Prophet (ﷺ) said: \"Whoever accepts other people's wealth intending to pay it back, Allah will pay it back for him. And whoever accepts it intending to waste it, Allah, the Most High, will waste (destroy) him.\"\n\n."}},{"id":95,"idInBook":95,"chapterId":7,"bookId":17,"arabic":"وَعَنْ عَائِشَةَ ‏-رَضِيَ اَللَّهُ عَنْهَا‏- قَالَتْ: { قُلْتُ: يَا رَسُولَ اَللَّهِ ! إِنَّ فُلَاناً قَدِمَ لَهُ بَزٌّ مِنَ اَلشَّامِ, فَلَوْ بَعَثْتَ إِلَيْهِ, فَأَخَذْتَ مِنْهُ ثَوْبَيْنِ بِنَسِيئَةٍ إِلَى مَيْسَرَةٍ? فَأَرْسَلَ إِلَيْهِ, فَامْتَنَعَ }  أَخْرَجَهُ اَلْحَاكِمُ، وَالْبَيْهَقِيُّ, وَرِجَالُهُ ثِقَاتٌ  1‏ .‏‏1 ‏- صحيح.‏ رواه الحاكم ( 2 / 23 ‏- 24 )‏، ولفظه: عن عائشة، قالت: كان على رسول الله ‏-صلى الله عليه وسلم‏- بردان قطريان غليظان خشنان.‏ فقلت: يا رسول الله إن ثوبيك خشنان غليظان، وإنك ترشح فيهما يثقلان عليك، وإن فلانا قدم له بز من الشام، فلو بعثت إليه فأخذت منه ثوبين بنسيئة إلى ميسرة، فأرسل إليه رسول الله ‏-صلى الله عليه وسلم‏-.‏ فقال: قد علمت ما يريد محمد؛ يريد أن يذهب بثوبي، ويمطلني فيها، فأتى الرسول إلى النبي ‏-صلى الله عليه وسلم‏- فأخبره فقال النبي ‏-صلى الله عليه وسلم‏-: قد كذب.‏ قد علموا أني أتقاهم لله، وآداهم للأمانة قلت: والحديث عند النسائي ( 7 / 294 )‏، والترمذي ( 1213 )‏، ولا أدري سبب عزو الحافظ الحديث للحاكم والبيهقي دونهما.‏ ثم رأيته في \" التلخيص \" عزاه لهما.‏","english":{"narrator":"Narrated 'Aishah (RA):","text":"I said, \"O Messenger of Allah, so-and-so has brought you clothes from Syria. What if you sent someone to him, and you get from him two garments on credit till it is easy for you to repay?\" So he sent someone to him, but he refused.\n\n."}},{"id":96,"idInBook":96,"chapterId":7,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ اَلظَّهْرُ يُرْكَبُ بِنَفَقَتِهِ إِذَا كَانَ مَرْهُونًا, وَلَبَنُ اَلدَّرِّ يُشْرَبُ بِنَفَقَتِهِ إِذَا كَانَ مَرْهُونًا, وَعَلَى اَلَّذِي يَرْكَبُ وَيَشْرَبُ اَلنَّفَقَةُ }  رَوَاهُ اَلْبُخَارِيُّ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 2512 )‏.‏","english":{"narrator":"Narrated Abu Hurairah (RA):","text":"Allah's Messenger (ﷺ) said: \"An animal may be ridden, due to what is spent on it, when it is in pledge; and the milk of a camel may be drunk, due to what is spent on it, when it is in pledge. And the responsibility of spending on it is upon the one who rides (it) and drinks (its milk).\"\n\n."}},{"id":97,"idInBook":97,"chapterId":7,"bookId":17,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏-صَلَّى اَللَّهُ عَلَيْهِ وَسَلَّمَ: { لَا يَغْلَقُ اَلرَّهْنُ مِنْ صَاحِبِهِ اَلَّذِي رَهَنَهُ, لَهُ غُنْمُهُ, وَعَلَيْهِ غُرْمُهُ }  رَوَاهُ اَلدَّارَقُطْنِيُّ, وَالْحَاكِمُ, وَرِجَالهُ ثِقَاتٌ.‏ إِلَّا أَنَّ اَلْمَحْفُوظَ عِنْدَ أَبِي دَاوُدَ وَغَيْرِهِ إِرْسَالُهُ  1‏ .‏‏1 ‏- ضعيف مرفوعا.‏ رواه الدارقطني ( 3 / 33 )‏، والحاكم ( 2 / 51 )‏ مرفوعا.‏ ورواه مرسلا أبو داود في \" المراسيل \" ( 187 )‏ وهو الصواب، كما ذهب إلى ذلك جماعة من أهل العلم.‏","english":{"narrator":"Narrated :","text":"Allah's Messenger (ﷺ) said: \"A pledge does not become lost to its owner when he does not redeem it in time. Any increase in its value goes to him and any lost must be borne by him.\"\n\n."}},{"id":98,"idInBook":98,"chapterId":7,"bookId":17,"arabic":"وَعَنْ أَبِي رَافِعٍ { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-اسْتَسْلَفَ مِنْ رَجُلٍ بَكْرًا  1‏ فَقَدِمَتْ عَلَيْهِ إِبِلٌ مِنَ اَلصَّدَقَةِ, فَأَمَرَ أَبَا رَافِعٍ أَنْ يَقْضِيَ اَلرَّجُلَ بَكْرَهُ, فَقَالَ: لَا أَجِدُ إِلَّا خَيَارًا  2‏ .‏ \nقَالَ: \" أَعْطِهِ إِيَّاهُ, فَإِنَّ خِيَارَ اَلنَّاسِ أَحْسَنُهُمْ قَضَاءً }  رَوَاهُ مُسْلِمٌ  3‏ .‏‏1 ‏- البكر: الفتي من الإبل.‏‏2 ‏- في مسلم \" خيارا رباعيا \".‏ والرباعي من الإبل ما أتى عليه ست سنين، ودخل في السابعة حين طلعت رباعيته.‏ والخيار: أي: الناقة المختارة.‏\n‏3 ‏- صحيح.‏ رواه مسلم ( 1600 )‏، وفي رواية له: \" فإن خير عباد الله … \".‏","english":{"narrator":"Narrated Abu Rafi' (RA):","text":"The Prophet (ﷺ) borrowed a young camel from a man. So, when some Sadaqa camels came to him he ordered Abu Rafi (RA) to re-pay the man his young camel. He told him (ﷺ), \"I can only find an excellent camel in its seventh year.\" He said, \"Give it to him, for the best of people is he who discharges his debt in the best manner.\"\n\n."}},{"id":99,"idInBook":99,"chapterId":7,"bookId":17,"arabic":"وَعَنْ عَلِيٍّ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏-صَلَّى اَللَّهُ عَلَيْهِ وَسَلَّمَ { كُلُّ قَرْضٍ جَرَّ مَنْفَعَةً, فَهُوَ رِبًا }  رَوَاهُ اَلْحَارِثُ بْنُ أَبِي أُسَامَةَ, وَإِسْنَادُهُ سَاقِطٌ  1‏ .‏‏1 ‏- ضعيف جدا، وقد أفصح الحافظ في \" التلخيص \" ( 3 / 34 )‏ عن علته، فقال: \" في إسناده سوار بن مصعب، وهو متروك \".‏","english":{"narrator":"Narrated 'Ali (RA):","text":"Allah's Messenger (ﷺ) said: \"Every loan, which leads to a benefit, is usury.\"\n\n."}},{"id":100,"idInBook":100,"chapterId":7,"bookId":17,"arabic":"وَلَهُ شَاهِدٌ ضَعِيفٌ عَنْ فَضَالَةَ بْنِ عُبَيْدٍ عِنْدَ اَلْبَيْهَقِيِّ  1‏ .‏‏1 ‏- رواه البيهقي ( 5 / 350 )‏ موقوفا بلفظ: كل قرض جر منفعة، فهو وجه من وجوه الربا وهو ضعيف كما قال الحافظ.‏","english":{"narrator":"","text":"The aforesaid Hadith has a weak supporting narration, on the authority of Fadalah bin 'Ubaid (RA) reported by al-Baihaqi."}},{"id":101,"idInBook":101,"chapterId":7,"bookId":17,"arabic":"وَآخَرُ مَوْقُوفٌ عَنْ عَبْدِ اَللَّهِ بْنِ سَلَامٍ عِنْدَ اَلْبُخَارِيِّ  1‏ .‏‏1 ‏- رواه البخاري ( 3814 )‏ وهو من طريق أبي بردة قال: أتيت المدينة، فلقيت عبد الله بن سلام ‏-رضي الله عنه‏-، فقال: ألا تجيء فأطعمك سويقا وتمرا، وتدخل في بيت؟ ثم قال: إنك في أرض الربا بها فاش، إذا كان لك على رجل حق، فأهدى إليك حمل تبن، أو حمل شعير، أو حمل قت، فإنه ربا.‏ \" تنبيه \": نفى صاحب \" سبل السلام \" وجود هذا الأثر في البخاري، وتبعه على ذلك كل من أخرج \" البلوغ \" إما تصريحا وإما تلميحا.‏ مع أنه يوجد في موضعين من \" الصحيح \".‏ وانظر \" الأصل \".‏","english":{"narrator":"","text":"It also has another Mawquf (saying of a Companion) narration from 'Abdullah bin Salam (RA) reported by al-Bukhari."}},{"id":102,"idInBook":102,"chapterId":7,"bookId":17,"arabic":"عَنْ أَبِي بَكْرِ بْنِ عَبْدِ اَلرَّحْمَنِ, عَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- : سَمِعْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ: { مَنْ أَدْرَكَ مَالَهُ بِعَيْنِهِ عِنْدَ رَجُلٍ قَدْ أَفْلَسَ, فَهُوَ أَحَقُّ بِهِ مِنْ غَيْرِهِ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 2402 )‏، ومسلم ( 1559 )‏.‏","english":{"narrator":"Narrated Abu Bakr bin 'Abdur-Rahman on the authority of Abu Hurairah (RA):","text":"We heard Allah's Messenger (ﷺ) say: \"If a creditor finds his very property with a debtor who becomes bankrupt, he is more entitled to it than anyone else.\"\n\n."}},{"id":103,"idInBook":103,"chapterId":7,"bookId":17,"arabic":"وَرَوَاهُ أَبُو دَاوُدَ, وَمَالِكٌ: مِنْ رِوَايَةِ أَبِي بَكْرِ بْنِ عَبْدِ اَلرَّحْمَنِ مُرْسَلًا بِلَفْظِ: { أَيُّمَا رَجُلٌ بَاعَ مَتَاعًا فَأَفْلَسَ اَلَّذِي اِبْتَاعَهُ, وَلَمْ يَقْبِضِ اَلَّذِي بَاعَهُ مِنْ ثَمَنِهِ شَيْئًا , فَوَجَدَ مَتَاعَهُ بِعَيْنِهِ, فَهُوَ أَحَقُّ بِهِ, وَإِنْ مَاتَ اَلْمُشْتَرِي فَصَاحِبُ اَلْمَتَاعِ أُسْوَةُ اَلْغُرَمَاءِ }   1‏ .‏‏1 ‏- رواه مالك في \" الموطأ ( 2 / 678 )‏، وأبو داود ( 3520 )‏، عن ابن شهاب، عن أبي بكر بن عبد الرحمن مرسلا به.‏ وتابع مالكا يونس، عن ابن شهاب مرسلا به.‏ رواه أبو داود ( 3521 )‏ وقال: فذكر معنى حديث مالك؛ وزاد: \" وإن قضى من ثمنها شيئا، فهو أسوة الغرماء فيها \".‏ وخالفهما محمد بن الوليد الزبيدي كما في التعليق التالي.‏","english":{"narrator":"Abu Dawud and Malik reported the aforesaid Hadith from the narration of Abu Bakr bin 'Abdur-Rahman, as Mursal (broken chain after the Tabi'i), with this wording:","text":"\"If anyone sells some goods (on credit) and the one who buys them becomes bankrupt, and the seller does not recover any of the price of his goods, and he then finds his very goods (with him), he is more entitled to them (than anyone else). However, if the buyer dies, the owner of the goods finds his actual goods he has most right to them.\""}},{"id":104,"idInBook":104,"chapterId":7,"bookId":17,"arabic":"وَوَصَلَهُ اَلْبَيْهَقِيُّ, وَضَعَّفَهُ تَبَعًا لِأَبِي دَاوُدَ  1‏ .‏‏1 ‏- رواه أبو داود ( 3522 )‏، والبيهقي ( 6 / 47 )‏، من طريق محمد بن الوليد الزبيدي، عن الزهري، عن أبي بكر بن عبد الرحمن، عن أبي هريرة، عن النبي ‏-صلى الله عليه وسلم‏- نحوه.‏ وزاد: \" وأيما امرئ هلك، وعنده متاع امرئ بعينه، اقتضى منه شيئا أو لم يقتض، فهو أسوة الغرماء \".‏ وقال أبو داود: \" حديث مالك أصح \".‏ وقال البيهقي: \" لا يصح.‏ يعني: موصولا \".‏ قلت: ومال الحافظ إلى تصحيحه في \" الفتح \" وفي \" التلخيص \" وأفصح عن ذلك شيخنا في \" الإرواء \" ( 5 / 270 )‏ وذكر هناك ما يشهد له.‏","english":{"narrator":"","text":"al-Baihaqi reported it with a full chain of narrators but graded it weak, following Abu Dawud."}},{"id":105,"idInBook":105,"chapterId":7,"bookId":17,"arabic":"وَرَوَى أَبُو دَاوُدَ, وَابْنُ مَاجَهْ: مِنْ رِوَايَةِ عُمَرَ بْنِ خَلْدَةَ قَالَ: أَتَيْنَا أَبَا هُرَيْرَةَ فِي صَاحِبٍ لَنَا قَدْ أَفْلَسَ, فَقَالَ: لَأَقْضِيَنَّ فِيكُمْ بِقَضَاءِ رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ أَفْلَسَ أَوْ مَاتَ فَوَجَدَ رَجُلٌ مَتَاعَهُ بِعَيْنِهِ فَهُوَ أَحَقُّ بِهِ }  وَصَحَّحَهُ اَلْحَاكِمُ, وَضَعَّفَ أَبُو دَاوُدَ هَذِهِ اَلزِّيَادَةَ فِي ذِكْرِ اَلْمَوْتِ  1‏ .‏‏1 ‏- رواه أبو داود ( 3523 )‏، وابن ماجه ( 2360 )‏، والحاكم ( 2 / 50 )‏ وسنده ضعيف؛ إذ فيه أحد المجاهيل، إلا أنه أحد شواهد الرواية السابقة.‏","english":{"narrator":"Abu Dawud and Ibn Majah reported the aforesaid Hadith from the narration of 'Umar bin Khalda which has:","text":"\"We went to Abu Hurairah (RA) regarding a friend of ours who was bankrupt. He said, \"I shall certainly pronounce judgment about him in accordance with the judgement of Allah's Messenger (ﷺ). Whoever becomes bankrupt or dies, and a person finds his actual goods (remaining with that man), he has most right to them.'\"\n\n."}},{"id":106,"idInBook":106,"chapterId":7,"bookId":17,"arabic":"وَعَنْ عَمْرِو بْنِ اَلشَّرِيدِ, عَنْ أَبِيهِ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَيُّ اَلْوَاجِدِ يُحِلُّ عِرْضَهُ وَعُقُوبَتَهُ }  رَوَاهُ أَبُو دَاوُدَ, وَالنَّسَائِيُّ, وَعَلَّقَهُ اَلْبُخَارِيُّ, وَصَحَّحَهُ اِبْنُ حِبَّانَ  1‏ .‏‏1 ‏- حسن.‏ رواه البخاري معلقا ( 5 / 62 )‏، ووصله أبو داود ( 3628 )‏، والنسائي ( 7 / 316 )‏، وأيضا ابن ماجه ( 3627 )‏، وابن حبان ( 1164 )‏.‏ وقال الحافظ في \" الفتح \": \" إسناده حسن \".‏ و\" اللي \": المطل.‏ و \" الواجد \": الغني.‏ علق البخاري عن سفيان قوله: عرضه: يقول: مطلتني.‏ وعقوبته: الحبس.‏ قلت: ودليل الحبس في الشريعة حديث بهز بن حكيم، عن أبيه، عن جده، أن النبي ‏-صلى الله عليه وسلم‏- حبس رجلا في تهمة، ثم خلى عنه وهو حديث حسن، وقد خرجته في كتاب \" الأقضية النبوية \" لابن الطلاع ‏-يسر الله نشره‏-.‏","english":{"narrator":"Narrated 'Amr bin ash-Sharid on the authority of his father:","text":"Allah's Messenger (ﷺ) said: \"Delay in payment on the part of one who possesses the means, makes it lawful to dishonor and punish him.\"\n\n."}},{"id":107,"idInBook":107,"chapterId":7,"bookId":17,"arabic":"وَعَنْ أَبِي سَعِيدٍ اَلْخُدْرِيِّ ‏- رضى الله عنه ‏- قَالَ: { أُصِيبَ رَجُلٌ فِي عَهْدِ رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-فِي ثِمَارٍ اِبْتَاعَهَا, فَكَثُرَ دَيْنُهُ, فَقَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-\" تَصَدَّقُوا عَلَيْهِ \" فَتَصَدَّقَ اَلنَّاسُ عَلَيْهِ, وَلَمْ يَبْلُغْ ذَلِكَ وَفَاءَ دَيْنِهِ, فَقَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-لِغُرَمَائِهِ: \" خُذُوا مَا وَجَدْتُمْ, وَلَيْسَ لَكُمْ إِلَّا ذَلِكَ }  رَوَاهُ مُسْلِمٌ  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم ( 1556 )‏.‏","english":{"narrator":"Narrated Abu Sa'id al-Khudri (RA):","text":"In the time of Allah's Messenger (ﷺ) a man suffered a loss affecting fruits he had bought, owed a large debt and became bankrupt. So, Allah's Messenger (ﷺ) said to the people, \"Give him Sadaqah (charity).\" Hence, the people gave him charity. However, that was not enough to repay his debt in full. Therefore, Allah's Messenger (ﷺ) said to the creditors, \"Take whatever you find, and you will have nothing other than that.\"\n\n."}},{"id":108,"idInBook":108,"chapterId":7,"bookId":17,"arabic":"وَعَنِ اِبْنِ كَعْبِ بْنِ مَالِكٍ, عَنْ أَبِيهِ; { أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-حَجَرَ عَلَى مُعَاذٍ مَالَهُ, وَبَاعَهُ فِي دَيْنٍ كَانَ عَلَيْهِ }  رَوَاهُ اَلدَّارَقُطْنِيُّ, وَصَحَّحَهُ اَلْحَاكِمُ, وَأَخْرَجَهُ أَبُو دَاوُدَ مُرْسَلًا, وَرُجِّحَ  1‏ .‏‏1 ‏- ضعيف مرفوعا.‏ والصحيح فيه الإرسال كما رجح ذلك غير واحد، وقد تكلمت عليه مفصلا في \" الأقضية النبوية \" لابن الطلاع.‏","english":{"narrator":"Narrated Ibn Ka'b bin Malik (RA) on the authority of his father:","text":"Allah's Messenger (ﷺ) seized the wealth of Mu'adh and sold it in return for a debt he was indebted for.\n\n."}},{"id":109,"idInBook":109,"chapterId":7,"bookId":17,"arabic":"وَعَنِ اِبْنِ عُمَرَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: { عُرِضْتُ عَلَى اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-يَوْمَ أُحُدٍ, وَأَنَا اِبْنُ أَرْبَعَ عَشْرَةَ سَنَةً, فَلَمْ يُجِزْنِي, وَعُرِضْتُ عَلَيْهِ يَوْمَ اَلْخَنْدَقِ, وَأَنَا اِبْنُ خَمْسَ عَشْرَةَ سَنَةً, فَأَجَازَنِي }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 2664 )‏، ومسلم ( 1868 )‏، وزادا:\" قال نافع: فقدمت على عمر بن عبد العزيز ‏- وهو يومئذ خليفة ‏- فحدثته هذا الحديث.‏ فقال: إن هذا لحد بين الصغير والكبير.‏ فكتب لعماله أن يفرضوا لمن بلغ خمس عشرة \".‏ وزاد مسلم: \" ومن كان دون ذلك فاجعلوه في العيال \".‏","english":{"narrator":"Narrated Ibn 'Umar (RA):","text":"I was brought before the Prophet (ﷺ) on the Day of Uhud when I Was fourteen years old, but he did not give me permission (to fight). I was afterwards brought to him on the Day of al-Khandaq (the Battle of Trench) when I was fifteen years of age, and he gave me permission (to fight).\n\n."}},{"id":110,"idInBook":110,"chapterId":7,"bookId":17,"arabic":"وَفِي رِوَايَةٍ لِلْبَيْهَقِيِّ: \n\" فَلَمْ يُجِزْنِي, وَلَمْ يَرَنِي بَلَغْتُ \".‏ وَصَحَّحَهَا اِبْنُ خُزَيْمَةَ  1‏ .‏‏1 ‏- صحيح بهذه الزيادة، وإن لم أجده في \" سنن البيهقي \" بهذه الزيادة.‏ لكن رواه ابن حبان في \" صحيحه \" ( 4708 )‏ بهذه الزيادة وسنده صحيح.‏ ثم رأيت الحافظ في \" الفتح \" ( 5 / 279 )‏ قال: \" أخرجه عبد الرازق، عن ابن جريج ورواه أبو عوانة وابن حبان في \" صحيحيهما \" من وجه آخر عن ابن جريج.‏ أخبرني نافع ‏- قال سمير: كذا قال والذي في ابن حبان: أخبرني عبيد الله بن عمر، عن نافع فذكر الحديث بلفظ: … \" ولم يرني بلغت \".‏ وهي زيادة صحيحة لا مطعن فيها؛ لجلالة ابن جريج، وتقدمه على غيره في حديث نافع، وقد صرح فيها بالتحديث، فانتقى ما يخشى من تدليسه \".‏","english":{"narrator":"al-Baihaqi's narration has:","text":"\"He did not give me permission (to fight), and did not consider me has having attained puberty.\"\n\n."}},{"id":111,"idInBook":111,"chapterId":7,"bookId":17,"arabic":"وَعَنْ عَطِيَّةَ اَلْقُرَظِيِّ ‏- رضى الله عنه ‏- قَالَ: { عُرِضْنَا عَلَى اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-يَوْمَ قُرَيْظَةَ، فَكَانَ مَنْ أَنْبَتَ قُتِلَ, وَمَنْ لَمْ يُنْبِتْ خُلِّيَ سَبِيلُهُ, فَكُنْتُ فِيمَنْ لَمْ يُنْبِتْ فَخُلِّيَ سَبِيلِي }  رَوَاهُ اَلْخَمْسَةُ, وَصَحَّحَهُ اِبْنُ حِبَّانَ، وَالْحَاكِمُ  1‏ .‏‏1 ‏- صحيح.‏ رواه أبو داود ( 4404 )‏ و ( 4405 )‏، والنسائي في \" الكبرى \" ( 5 / 185 )‏، والترمذي ( 1584 )‏، وابن ماجه ( 2541 )‏، وأحمد ( 4 / 310 )‏، وابن حبان ( 4760 )‏ والحاكم ( 2 / 123 )‏، وفي غير موطن.‏ وفي رواية للنسائي، وأبي داود، وابن حبان: كنت فيمن حكم فيه سعد، فجيء بي وأنا أرى أنه سيقتلني، فكشفوا عانتي فوجدوني لم أنبت، فجعلوني في السبي وله ألفاظ أخرى، ذكرتها بطرقها في \" الأصل \".‏ وقال الترمذي \" هذا حديث حسن صحيح، والعمل على هذا عند بعض أهل العلم: أنهم يرون الإنبات بلوغا إن لم يعرف احتلامه ولا سنه، وهو قول أحمد وإسحاق \".‏ وقال الحاكم: \" صحيح على شرط الشيخين \".‏ فقال الحافظ في \" التلخيص \" ( 3 / 42 )‏: \" وهو كما قال؛ إلا أنهما لم يخرجا لعطية، وما له إلا هذا الحديث الواحد \".‏","english":{"narrator":"Narrated 'Atiyyah al-Qurazi (RA):","text":"We were brought before the Prophet (ﷺ) on the day of Quraizah. Those who had began to grow hair (on their private parts) were killed, while who had not, were set free. I was among those who had not begun to grow hair, so I was set free.\n\n."}},{"id":112,"idInBook":112,"chapterId":7,"bookId":17,"arabic":"وَعَنْ عَمْرِو بْنِ شُعَيْبٍ, عَنْ أَبِيهِ, عَنْ جَدِّهِ; أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { لَا يَجُوزُ لِاِمْرَأَةٍ عَطِيَّةٌ إِلَّا بِإِذْنِ زَوْجِهَا }","english":{"narrator":"Narrated 'Amr bin Shu'aib on his father'ss authority from his grandfather (RA):","text":"Allah's Messenger (ﷺ) said: \"It is not permissible to give a gift without her husband's permission.\""}},{"id":113,"idInBook":113,"chapterId":7,"bookId":17,"arabic":"وَفِي لَفْظٍ: { لَا يَجُوزُ لِلْمَرْأَةِ أَمْرٌ فِي مَالِهَا, إِذَا مَلَكَ زَوْجُهَا عِصْمَتَهَا }  رَوَاهُ أَحْمَدُ, وَأَصْحَابُ اَلسُّنَنِ إِلَّا اَلتِّرْمِذِيَّ, وَصَحَّحَهُ اَلْحَاكِمُ  1‏ .‏‏1 ‏- صحيح.‏ رواه أحمد ( 2 / 179 و 184 )‏، وأبو داود ( 3547 )‏، والنسائي ( 5 / 65 ‏- 66 )‏، وابن ماجه ( 2388 )‏، والحاكم ( 2 / 47 )‏.‏ وهو وإن كان حسن الإسناد؛ إلا أنه صحيح لما له من شواهد، وقد ذكرتها في \" الأصل \" كما أشرت إلى الرويات ومخرجيها.‏","english":{"narrator":"Another wording is:","text":"\"It is not permissible for a woman to dispose anything of her wealth if her husband is responsible for her.\"\n\n."}},{"id":114,"idInBook":114,"chapterId":7,"bookId":17,"arabic":"وَعَنْ قَبِيصَةَ بْنِ مُخَارِقٍ  ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِنَّ اَلْمَسْأَلَةَ لَا تَحِلُّ إِلَّا لِأَحَدِ ثَلَاثَةٍ: رَجُلٍ تَحَمَّلَ حَمَالَةً فَحَلَّتْ لَهُ اَلْمَسْأَلَةُ حَتَّى يُصِيبَهَا ثُمَّ يُمْسِكَ، وَرَجُلٍ أَصَابَتْهُ جَائِحَةٌ اِجْتَاحَتْ مَالَهُ, فَحَلَّتْ لَهُ اَلْمَسْأَلَةُ حَتَّى يُصِيبَ قِوَامًا مِنْ عَيْشٍ، وَرَجُلٍ أَصَابَتْهُ فَاقَةٌ حَتَّى يَقُولَ ثَلَاثَةٌ مِنْ ذَوِي الْحِجَى مِنْ قَوْمِهِ: لَقَدْ أَصَابَتْ فُلَانًا فَاقَةٌ, فَحَلَّتْ لَهُ اَلْمَسْأَلَةُ }  رَوَاهُ مُسْلِمٌ  1‏ .‏‏1 ‏- صحيح.‏ تقدم برقم 645.‏","english":{"narrator":"Narrated Qabisa bin Mukhariq al-Hilali (RA):","text":"Allah's Messenger (ﷺ) said: \"Begging is not lawful except to one of three (people): a man who has become a guarantor for a payment, for whom begging is lawful till he gets it, after which he must stop begging; a man whose wealth has been destroyed by a calamity which has befallen him, for whom begging is lawful till he gets what will support life; and a man who has been struck by poverty, the genuineness of which is confirmed by three intelligent members of his people, so it is lawful for him to beg.\"\n\n."}},{"id":115,"idInBook":115,"chapterId":7,"bookId":17,"arabic":"عَنْ عَمْرِو بْنِ عَوْفٍ اَلْمُزَنِيِّ ‏- رضى الله عنه ‏- أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { اَلصُّلْحُ جَائِزٌ بَيْنَ اَلْمُسْلِمِينَ, إِلَّا صُلْحاً حَرَّمَ حَلَالاً وَ  1‏ أَحَلَّ حَرَاماً، وَالْمُسْلِمُونَ عَلَى شُرُوطِهِمْ, إِلَّا شَرْطاً حَرَّمَ حَلَالاً وَ  2‏ أَحَلَّ حَرَاماً }  رَوَاهُ اَلتِّرْمِذِيُّ وَصَحَّحَهُ  3‏ .‏ وَأَنْكَرُوا عَلَيْهِ;  4‏ .‏ لِأَنَّ رَاوِيَهُ كَثِيرَ بْنَ عَبْدِ اَللَّهِ بْنِ عَمْرِوِ بْنِ عَوْفٍ ضَعِيفٌ  5‏ .‏ \nوَكَأَنَّهُ اِعْتَبَرَهُ بِكَثْرَةِ طُرُقِهِ  6‏ .‏ \nوَقَدْ صَحَّحَهُ اِبْنُ حِبَّانَ مِنْ حَدِيثِ أَبِي هُرَيْرَةَ  7‏ .‏‏1 ‏- كذا \" بالأصلين \"، وفي \" السنن \": \" أو \".‏‏2 ‏- كذا \" بالأصلين \"، وفي \" السنن \": \" أو \".‏‏3 ‏- السنن رقم ( 1352 )‏، وقال: \" هذا حديث حسن صحيح \".‏\n‏4 ‏- كقول الذهبي في \" الميزان \" ( 3 / 407 )‏: \" وأما الترمذي فروى من حديثه: الصلح جائز بين المسلمين.‏ وصححه؛ فلهذا لا يعتمد العلماء على تصحيح الترمذي.‏‏5 ‏- بل قال الشافعي وأبو داود: هو ركن من أركان الكذب.‏\n‏6 ‏- لعله يريد \" كثرة شواهده \" إذ يروى عن أبي هريرة، وأنس بن مالك، وابن عمر، وعائشة، وغيرهم، وكلها مذكورة في \" الأصل \".‏\n‏7 ‏- حسن.‏ رواه ابن حبان ( 1199 )‏، ورواه ابن الجارود، والحاكم، ومن قبلهما رواه أبو داود ( 3594 )‏.‏ وقال الحافظ في \" التغليق \" ( 3 / 281 )‏.‏ حديث: المسلمون عند شروطهم روي من حديث أبي هريرة، وعمرو بن عوف، وأنس بن مالك، ورافع بن خديج، وعبد الله بن عمر، وغيرهم، وكلها فيها مقال، لكن حديث أبي هريرة أمثلها \".‏","english":{"narrator":"Narrated 'Amr bin 'Auf al-Muzani (RA):","text":"Allah's Messenger (ﷺ) said: \"Reconciliation is permissible between Muslims, except one which makes unlawful something which is lawful, or makes lawful something which is unlawful; and Muslims must abide by their conditions (which they have made), except for a condition which makes unlawful something which is lawful, or makes lawful something which is unlawful.\"\n\n. However, the Hadith scholars criticized him (for grading this Hadith as Sahih) because the narration of Kathir bin 'Abdullah bin 'Amr bin 'Auf is weak. It is as though at-Tirmidhi considered it (reliable) due to its many chains of narration. Ibn Hibban declared the aforesaid Hadith to be Sahih (authentic) from the narration of Abu Hurairah (RA)."}},{"id":116,"idInBook":116,"chapterId":7,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-\n\" قَالَ: { لَا يَمْنَعُ جَارٌ جَارَهُ أَنْ يَغْرِزَ خَشَبَةً فِي جِدَارِهِ \".‏ ثُمَّ يَقُولُ أَبُو هُرَيْرَةَ ‏- رضى الله عنه ‏- مَا لِي أَرَاكُمْ عَنْهَا مُعْرِضِينَ? وَاَللَّهِ لَأَرْمِيَنَّ بِهَا بَيْنَ أَكْتَافِكُمْ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 2463 )‏، ومسلم ( 1609 )‏.‏","english":{"narrator":"Narrated Abu Hurairah (RA):","text":"The Prophet (ﷺ) said: \"One must not prevent his neighbor  from fixing a wooden peg in his wall.\" Abu Hurairah (RA) then said, \"Why do I see you turning away (averse to this Sunnah)? I swear by Allah that I will always narrate it to you.\"\n\n."}},{"id":117,"idInBook":117,"chapterId":7,"bookId":17,"arabic":"وَعَنْ أَبِي حُمَيْدٍ اَلسَّاعِدِيِّ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا يَحِلُّ لِامْرِئٍ أَنْ يَأْخُذَ عَصَا أَخِيهِ بِغَيْرِ طِيبِ نَفْسٍ مِنْهُ }  رَوَاهُ اِبْنُ حِبَّانَ, وَالْحَاكِمُ فِي \n\" صَحِيحَيْهِمَا \"  1‏ .‏‏1 ‏- صحيح.‏ رواه ابن حبان ( 1166 )‏، وأما عزوه للحاكم فلعله وهم من الحافظ.‏ والله أعلم.‏ وللحديث شواهد كثيرة مذكورة في \" الأصل \".‏","english":{"narrator":"Narrated Abu Humaid as-Sa'idi (RA):","text":"Allah's Messenger (ﷺ) said: \"It is not lawful for a person to take his brother's stick except if he is pleased with such.\"\n\n."}},{"id":118,"idInBook":118,"chapterId":7,"bookId":17,"arabic":"عَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَطْلُ اَلْغَنِيِّ ظُلْمٌ, وَإِذَا أُتْبِعُ أَحَدُكُمْ عَلَى مَلِيٍّ فَلْيَتْبَعْ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 2287 )‏، ومسلم ( 1564 )‏.‏","english":{"narrator":"Narrated Abu Hurairah (RA):","text":"Allah's Messenger (ﷺ) said: \"Delay in payment by a rich man is injustice. So, if one of you is referred for payment to a wealthy man he should accept the reference.\"\n\n."}},{"id":119,"idInBook":119,"chapterId":7,"bookId":17,"arabic":"وَفِي رِوَايَةِ أَحْمَدَ: { فَلْيَحْتَلْ }   1‏ .‏‏1 ‏- المسند ( 2 / 463 )‏.‏","english":{"narrator":"A narration by Ahmad has:","text":"\"And if anyone is referred to another, let him accept that.\""}},{"id":120,"idInBook":120,"chapterId":7,"bookId":17,"arabic":"وَعَنْ جَابِرٍ ‏- رضى الله عنه ‏- قَالَ: { تُوُفِّيَ رَجُلٌ مِنَّا, فَغَسَّلْنَاهُ, وَحَنَّطْنَاهُ, وَكَفَّنَّاهُ, ثُمَّ أَتَيْنَا بِهِ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-فَقُلْنَا: تُصَلِّي عَلَيْهِ? فَخَطَا خُطًى, ثُمَّ قَالَ: \" أَعَلَيْهِ دَيْنٌ? \" قُلْنَا: دِينَارَانِ، فَانْصَرَفَ, فَتَحَمَّلَهُمَا أَبُو قَتَادَةَ، فَأَتَيْنَاهُ, فَقَالَ أَبُو قَتَادَةَ: اَلدِّينَارَانِ عَلَيَّ، فَقَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-\" أُحِقَّ اَلْغَرِيمُ وَبَرِئَ مِنْهُمَا اَلْمَيِّتُ? \" قَالَ: نَعَمْ, فَصَلَّى عَلَيْهِ }  رَوَاهُ أَحْمَدُ, وَأَبُو دَاوُدَ, وَالنَّسَائِيُّ, وَصَحَّحَهُ اِبْنُ حِبَّانَ, وَالْحَاكِمُ  1‏ .‏‏1 ‏- صحيح.‏ رواه أحمد ( 3 / 330 )‏، وأبو داود ( 3343 )‏، والنسائي ( 4 / 65 ‏- 66 )‏، وابن حبان ( 3064 )‏، واللفظ لأحمد وسنده حسن، وأما الباقون فلهم لفظ آخر وسندهم على شرط الشيخين، وتفصيل ذلك \" بالأصل \".‏","english":{"narrator":"Narrated Jabir (RA):","text":"A man from among us died, so we washed, embalmed and shrouded him. We then brought him to Allah's Messenger (ﷺ) and asked him to pray over him. He went forward some steps and then asked, \"Does he have any debt against him?\" We replied, \"Two Dinars.\" He turned away, but Abu Qatada (RA) took upon himself the bearing of them. We then came to him (again) (ﷺ) and Abu Qatada (RA) said: \"I shall discharge the two Dinars.\" Allah's Messenger (ﷺ) thereupon said, \" a right to the creditor; and the dead man will then be free from them?\" He replied, \"Yes.\" So, he prayed over him.\n\n."}},{"id":121,"idInBook":121,"chapterId":7,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- { أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-كَانَ يُؤْتَى بِالرَّجُلِ اَلْمُتَوَفَّى عَلَيْهِ اَلدَّيْنُ, فَيَسْأَلُ: \" هَلْ تَرَكَ لِدَيْنِهِ مِنْ قَضَاءٍ? \" فَإِنْ حُدِّثَ أَنَّهُ تَرَكَ وَفَاءً صَلَّى عَلَيْهِ, وَإِلَّا قَالَ: \" صَلُّوا عَلَى صَاحِبِكُمْ \" فَلَمَّا فَتَحَ اَللَّهُ عَلَيْهِ اَلْفُتُوحَ قَالَ: \" أَنَا أَوْلَى بِالْمُؤْمِنِينَ مِنْ أَنْفُسِهِمْ, فَمَنْ تُوُفِّيَ, وَعَلَيْهِ دَيْنٌ فَعَلَيَّ قَضَاؤُهُ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 2398 )‏، ومسلم ( 1619 )‏، وزادا: \" ومن ترك مالا فهو لورثته \".‏","english":{"narrator":"Narrated Abu Hurairah (RA):","text":"A man who had died in debt would be brought to Allah's Messenger (ﷺ) and he would ask, \"Has he left anything to discharge his debt?\" If he was told that he left enough he would pray over him. Otherwise, he would say, \"Pray over your companion.\" Then, when Allah brought the conquests (of other lands) at his hands he said, \"I am closer to the believers than their own selves. So, whoever dies leaving a debt, the responsibility for repaying it shall be upon me.\"\n\n."}},{"id":122,"idInBook":122,"chapterId":7,"bookId":17,"arabic":"وَفِي رِوَايَةٍ لِلْبُخَارِيِّ: { فَمَنْ مَاتَ وَلَمْ يَتْرُكْ وَفَاءً }   1‏ .‏‏1 ‏- البخاري برقم ( 6731 )‏.‏","english":{"narrator":"A narration by al-Bukhari has:","text":"\"Whoever dies and leavings nothing to discharge his debt...\""}},{"id":123,"idInBook":123,"chapterId":7,"bookId":17,"arabic":"وَعَنْ عَمْرِو بْنِ شُعَيْبٍ, عَنْ أَبِيهِ, عَنْ جَدِّهِ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا كَفَالَةَ فِي حَدٍّ }  رَوَاهُ اَلْبَيْهَقِيُّ بِإِسْنَادٍ ضَعِيفٍ  1‏ .‏‏1 ‏- منكر.‏ رواه البيهقي ( 6 / 77 )‏ وقال: \" إسناده ضعيف.‏ تفرد به بقية، عن أبي محمد؛ عمر بن أبي عمر الكلاعي، وهو من مشايخ بقية المجهولين، ورواياته منكرة \".‏","english":{"narrator":"Narrated 'Amr bin Shu'aib on his father's authority from his grandfather (RA):","text":"Allah's Messenger (ﷺ) said: \"No surety is allowed regarding a prescribed punishment.\"\n\n."}},{"id":124,"idInBook":124,"chapterId":7,"bookId":17,"arabic":"عَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ قَالَ اَللَّهُ: أَنَا ثَالِثُ اَلشَّرِيكَيْنِ مَا لَمْ يَخُنْ أَحَدُهُمَا صَاحِبَهُ, فَإِذَا خَانَ خَرَجْتُ مِنْ بَيْنِهِمَا }  رَوَاهُ أَبُو دَاوُدَ, وَصَحَّحَهُ اَلْحَاكِمُ  1‏ .‏‏1 ‏- ضعيف.‏ رواه أبو داود ( 3383 )‏، والحاكم ( 2 / 52 )‏ وله علتان: جهالة أحد رواته، والاختلاف في وصله وإرساله.‏","english":{"narrator":"Narrated Abu Hurairah (RA):","text":"Allah's Messenger (ﷺ) said: \"Allah, the Most High, said, 'I am the third (partner) of two partners as long as one of them does not cheat the his companion. Then, if he cheats (his partner) I depart from them.'\"\n\n."}},{"id":125,"idInBook":125,"chapterId":7,"bookId":17,"arabic":"وَعَنْ اَلسَّائِبِ  اَلْمَخْزُومِيِّ { أَنَّهُ كَانَ شَرِيكَ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَبْلَ اَلْبَعْثَةِ, فَجَاءَ يَوْمَ اَلْفَتْحِ, فَقَالَ: \" مَرْحَباً بِأَخِي وَشَرِيكِي }  رَوَاهُ أَحْمَدُ, وَأَبُو دَاوُدَ, وَابْنُ مَاجَةَ  1‏ .‏‏1 ‏- حسن.‏ رواه أحمد ( 3 / 425 )‏، واللفظ له.‏ وأما عزوه بهذا اللفظ لأبي داود ( 4836 )‏، وابن ماجه ( 2287 )‏ فليس بدقيق، وبيان ذلك في \" الأصل \".‏","english":{"narrator":"Narrated as-Saib al-Makhzumi (RA):","text":"That he was the partner of the Prophet (ﷺ) before the Prophethood. Then, he came (to Makkah) on the day of the Conquest (of Makkah), and he (the Prophet) said: \"Welcome to my brother and partner.\"\n\n."}},{"id":126,"idInBook":126,"chapterId":7,"bookId":17,"arabic":"وَعَنْ عَبْدِ اَللَّهِ بْنِ مَسْعُودٍ ‏- رضى الله عنه ‏- قَالَ: { اِشْتَرَكْتُ أَنَا وَعَمَّارٌ وَسَعْدٌ فِيمَا نُصِيبُ يَوْمَ بَدْرٍ.‏.‏ }  اَلْحَدِيثَ.‏ رَوَاهُ النَّسَائِيُّ وَغَيْرُهُ  1‏ .‏‏1 ‏- ضعيف.‏ رواه النسائي ( 7 / 319 )‏، وأبو داود ( 3388 )‏، وابن ماجه ( 2288 )‏، من طريق أبي عبيدة، عن أبيه عبد الله بن مسعود، به، وتمامه: \" فلم أجيء أنا وعمار بشيء، وجاء سعيد بأسيرين \".‏ قلت: وسبب الضعف الانقطاع بين أبي عبيدة وأبيه.‏","english":{"narrator":"Narrated 'Abdullah bin Mas'ud (RA):","text":"\"Ammar, Sa'd and I agrred to be partners in whatever we would get (from the spoils of war) on the day of Badr.\" The narrator quoted the rest of the Hadith which concludes: \"Then Sa'd brought two captives, but neither Ammar nor I brought anything.\"\n\n."}},{"id":127,"idInBook":127,"chapterId":7,"bookId":17,"arabic":"وَعَنْ جَابِرِ بْنِ عَبْدِ اَللَّهِ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- { قَالَ: أَرَدْتُ اَلْخُرُوجَ إِلَى خَيْبَرَ, فَأَتَيْتُ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-فَقَالَ: \" إِذَا أَتَيْتَ وَكِيلِي بِخَيْبَرَ, فَخُذْ مِنْهُ خَمْسَةَ عَشَرَ وَسْقًا }  رَوَاهُ أَبُو دَاوُدَ وَصَحَّحَهُ  1‏ .‏‏1 ‏- ضعيف.‏ رواه أبو داود ( 3632 )‏، وفي سند محمد بن إسحاق وهو مدلس وقد عنعنه، ولا أجد مستندا للحافظ في تحسينه للحديث في \" التلخيص \" ( 3 / 51 )‏.‏","english":{"narrator":"Narrated Jabir bin 'Abdullah (RA):","text":"I intended to go to Khaibar, so I went to the Prophet (ﷺ) and he said, \"When you meet my agent at Khaibar take fifteen Wasq (of dates) from him.\"\n\n."}},{"id":128,"idInBook":128,"chapterId":7,"bookId":17,"arabic":"وَعَنْ عُرْوَةَ الْبَارِقِيِّ ‏- رضى الله عنه ‏- { أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-بَعَثَ مَعَهُ بِدِينَارٍ يَشْتَرِي لَهُ أُضْحِيَّةً.‏.‏ }  اَلْحَدِيثَ.‏ رَوَاهُ اَلْبُخَارِيُّ فِي أَثْنَاءِ حَدِيثٍ, وَقَدْ تَقَدَّمَ  1‏ .‏‏1 ‏- صحيح، وانظر رقم ( 819 )‏.‏","english":{"narrator":"Narrated 'Urwa al-Bariqi (RA):","text":"Allah's Messenger (ﷺ) sent him with a Dinar to buy a sacrificial animal for him.\n\n."}},{"id":129,"idInBook":129,"chapterId":7,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: { بَعَثَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-عُمَرَ عَلَى اَلصَّدَقَةِ.‏.‏ }  اَلْحَدِيثَ.‏ مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 1468 )‏، ومسلم ( 983 )‏، واللفظ المذكور لمسلم، وليس في لفظ البخاري ذكر \" عمر \"، وتمام الحديث عندهما: \" فقيل: منع ابن جميل وخالد بن الوليد، والعباس .‏ والزيادات الأولى والثالثة والرابعة والخامسة والرواية للبخاري، والثانية والسادسة لمسلم.‏","english":{"narrator":"Narrated Abu Hurairah (RA):","text":"\"Allah's Messenger (ﷺ) sent 'Umar to collect the Sadaqah.\" The reported mentioned the rest of the Hadith.\n\n."}},{"id":130,"idInBook":130,"chapterId":7,"bookId":17,"arabic":"وَعَنْ جَابِرٍ ‏- رضى الله عنه ‏- { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-نَحَرَ ثَلَاثًا وَسِتِّينَ, وَأَمَرَ عَلِيًّا أَنْ يَذْبَحَ اَلْبَاقِيَ }  اَلْحَدِيثَ.‏ رَوَاهُ مُسْلِمٌ  1‏ .‏‏1 ‏- صحيح.‏ وقد تقدم برقم ( 742 )‏.‏","english":{"narrator":"Narrated Jabir (RA):","text":"\"The Prophet (ﷺ) slaughtered sixty-three (sacrificial) camels and ordered 'Ali to slaughter the remainder .\"\n\nThe reported mentioned the rest of the Hadith.\n\n."}},{"id":131,"idInBook":131,"chapterId":7,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- فِي قِصَّةِ اَلْعَسِيفِ.‏ قَالَ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-{ وَاغْدُ يَا أُنَيْسُ عَلَى اِمْرَأَةِ هَذَا, فَإِنْ اِعْتَرَفَتْ فَارْجُمْهَا.‏.‏ }  اَلْحَدِيثَ.‏ مُتَّفَقٌ عَلَيْهِ  1‏ .‏ فِيهِ اَلَّذِي قَبْلَهُ وَمَا أَشْبَهَهُ‏1 ‏- صحيح.‏ رواه البخاري ( 5 / 323 ‏- 324 / فتح )‏، ومسلم ( 3 / 1324 ‏- 1325 )‏.‏","english":{"narrator":"Narrated Abu Hurairah (RA) regarding the story of the hired servant:","text":"The Prophet (ﷺ) said: 'Unais, go (in the morning) to this man's wife, and if she confesses, stone her to death.\"\n\nThe reported mentioned the rest of the previous Hadith.\n\n."}},{"id":132,"idInBook":132,"chapterId":7,"bookId":17,"arabic":"عَنْ أَبِي ذَرٍّ ‏- رضى الله عنه ‏- قَالَ: قَالَ لِي رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ قُلِ اَلْحَقَّ, وَلَوْ كَانَ مُرًّا }  صَحَّحَهُ اِبْنُ حِبَّانَ فِي حَدِيثٍ طَوِيلٍ  1‏ .‏‏1 ‏- صحيح.‏ رواه ابن حبان ( 361 و 449 )‏، وله طرق عن أبي ذر، وله شاهد أيضا.‏","english":{"narrator":"Narrated Abu Dhar (RA):","text":"Allah's Messenger (ﷺ) said to me, \"Say the truth even though it is bitter (i.e. difficult to admit).\"\n\n."}},{"id":133,"idInBook":133,"chapterId":7,"bookId":17,"arabic":"عَنْ سَمُرَةَ بْنِ جُنْدُبٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ عَلَى اَلْيَدِ مَا أَخَذَتْ حَتَّى تُؤَدِّيَهُ }  رَوَاهُ أَحْمَدُ, وَالْأَرْبَعَةُ, وَصَحَّحَهُ اَلْحَاكِمُ  1‏ .‏‏1 ‏- ضعيف.‏ رواه أحمد ( 5 / 8 / و12 و13 )‏، وأبو داود ( 3561 )‏، والنسائي في \" الكبرى \" ( 3 / 411 )‏، والترمذي ( 1266 )‏، وابن ماجه ( 2400 )‏، والحاكم ( 2 / 47 )‏ من طريق الحسن، عن سمرة، به.‏ وزادوا إلا النسائي وابن ماجه.‏ \" ثم نسي الحسن فقال: هو أمينك لا ضمان عليه \".‏ وقال الترمذي: \" هذا حديث حسن صحيح \".‏ وقال الحاكم: \" صحيح على شرط البخاري \".‏ قلت: ولكن الحسن مدلس، وقد عنعنه، وليس البحث هنا بحث سماع الحسن من سمرة أم لا كما فعل ذلك صاحب السبل، ولكن البحث بحث التدليس.‏ وقد قال الذهبي في \" السير \" ( 4 / 588 )‏.‏ \" قال قائل: إنما أعرض أهل الصحيح عن كثير مما يقول فيه الحسن: عن فلان.‏ وإن كان مما قد ثبت لقيه فيه لفلان المعين؛ لأن الحسن معروف بالتدليس، ويدلس عن الضعفاء، فيبقى في النفس من ذلك، فإننا وإن ثبتنا سماعه من سمرة، يجوز أن يكون لم يسمع فيه غالب النسخة التي عن سمرة.‏ والله أعلم \".‏","english":{"narrator":"Narrated Samura bin Jundub (RA):","text":"Allah's Messenger (ﷺ) said: \"The hand (which takes) is responsible for what it has taken till it returns it.\"\n\n."}},{"id":134,"idInBook":134,"chapterId":7,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ أَدِّ اَلْأَمَانَةَ إِلَى مَنْ اِئْتَمَنَكَ, وَلَا تَخُنْ مَنْ خَانَكَ }  رَوَاهُ أَبُو دَاوُدَ, وَاَلتِّرْمِذِيُّ وَحَسَّنَهُ, وَصَحَّحَهُ اَلْحَاكِمُ, وَاسْتَنْكَرَهُ أَبُو حَاتِمٍ اَلرَّازِيُّ  1‏ .‏‏1 ‏- صحيح.‏ رواه أبو داود ( 3535 )‏، والترمذي ( 1264 )‏، بسند حسن، وقال الترمذي: \" حسن غريب \".‏ قلت: وهو صحيح بشواهده ففي الباب، عن أنس، وأبي أمامة، وأبي بن كعب، وغيرهم.‏","english":{"narrator":"Narrated Abu Hurairah (RA):","text":"Allah's Messenger (ﷺ) said: \"Give back what has been entrusted (to you) to him who has entrusted you, and do not violate the trust of him who violates your trust.\"\n\n."}},{"id":135,"idInBook":135,"chapterId":7,"bookId":17,"arabic":"وَعَنْ يَعْلَى بْنِ أُمَيَّةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِذَا أَتَتْكَ رُسُلِي فَأَعْطِهِمْ ثَلَاثِينَ دِرْعاً \", قُلْتُ: يَا رَسُولَ اَللَّهِ ! أَعَارِيَةٌ مَضْمُونَةٌ أَوْ عَارِيَةٌ مُؤَدَّاةٌ? قَالَ: بَلْ عَارِيَةٌ مُؤَدَّاةٌ }  رَوَاهُ أَحْمَدُ, وَأَبُو دَاوُدَ, وَالنَّسَائِيُّ, وَصَحَّحَهُ اِبْنُ حِبَّانَ  1‏ .‏‏1 ‏- صحيح.‏ رواه أحمد ( 4 / 222 )‏، وأبو داود ( 3566 )‏، والنسائي في \" الكبرى \" ( 3 / 409 )‏، وابن حبان ( 1173 )‏.‏","english":{"narrator":"Narrated Ya'la bin Umaiya (RA):","text":"Allah's Messenger (ﷺ) said to me, \"When my messengers come to you, give them thirty coats of armor.\" I asked, \"O Allah's Messenger, is it a loan with a guarantee (of its return), or a borrowed object that must be returned?\" He replied, \"No, it is a borrowed object that must be returned.\"\n\n."}},{"id":136,"idInBook":136,"chapterId":7,"bookId":17,"arabic":"وَعَنْ صَفْوَانَ بْنِ أُمَيَّةَ; { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-اِسْتَعَارَ مِنْهُ دُرُوعاً يَوْمَ حُنَيْنٍ.‏ فَقَالَ: أَغَصْبٌ يَا مُحَمَّدُ? قَالَ: بَلْ عَارِيَةٌ مَضْمُونَةٌ }  رَوَاهُ أَبُو دَاوُدَ, وَالنَّسَائِيُّ, وَصَحَّحَهُ اَلْحَاكِمُ  1‏ .‏‏1 ‏- صحيح.‏ رواه أحمد ( 3 / 401 )‏، وأبو داود ( 3562 )‏، والنسائي في \" الكبرى \" ( 3 / 410 )‏ وهو صحيح بطرقه وشواهده.‏","english":{"narrator":"Narrated Safwan bin Umaiya (RA):","text":"At the battle of Hunain, the Prophet (ﷺ) borrowed coats of mail from him and he asked, \"Are you taking them by force, O Muhammad (ﷺ)?\" He replied, \"No, it is a loan with a guarantee of their reutrn.\"\n\n."}},{"id":137,"idInBook":137,"chapterId":7,"bookId":17,"arabic":"وَأَخْرَجَ لَهُ شَاهِدًا ضَعِيفًا عَنْ اِبْنِ عَبَّاسٍ  1‏ .‏‏1 ‏- ضعيف جدا.‏ رواه الحاكم ( 2 / 47 )‏ وفي سنده \" متروك \" كما أن في متنه مخالفة أخرى.‏","english":{"narrator":"","text":"He also reported for this Hadith a Shahid (supporting narration) which is weak, from Ibn 'Abbas."}},{"id":138,"idInBook":138,"chapterId":7,"bookId":17,"arabic":"عَنْ سَعِيدِ بْنِ زَيْدٍ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏-; أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { مَنْ اِقْتَطَعَ شِبْرًا مِنْ اَلْأَرْضِ ظُلْماً طَوَّقَهُ اَللَّهُ إِيَّاهُ يَوْمَ اَلْقِيَامَةِ مِنْ سَبْعِ أَرَضِينَ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ واه البخاري ( 3198 )‏، ومسلم ( 1610 )‏، واللفظ لمسلم.‏","english":{"narrator":"Narrated Sa'id bin Zaid (RA):","text":"Allah's Messenger (ﷺ) said: \"If anyone takes a span of land unjustly, on the Day of Resurrection Allah will strangle him with it from seven earths.\"\n\n."}},{"id":139,"idInBook":139,"chapterId":7,"bookId":17,"arabic":"وَعَنْ أَنَسٍ; { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-كَانَ عِنْدَ بَعْضِ نِسَائِهِ، فَأَرْسَلَتْ إِحْدَى أُمَّهَاتِ اَلْمُؤْمِنِينَ  1‏ مَعَ خَادِمٍ لَهَا بِقَصْعَةٍ فِيهَا طَعَامٌ، فَكَسَرَتِ اَلْقَصْعَةَ، فَضَمَّهَا, وَجَعَلَ فِيهَا اَلطَّعَامَ.‏ وَقَالَ: \n\" كُلُوا \" وَدَفَعَ اَلْقَصْعَةَ اَلصَّحِيحَةَ لِلرَّسُولِ, وَحَبَسَ اَلْمَكْسُورَةَ }  رَوَاهُ اَلْبُخَارِيُّ  2‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 2481 )‏.‏‏2 ‏- صحيح.‏ رواه البخاري ( 2481 )‏.‏","english":{"narrator":"Narrated Anas (RA):","text":"The Prophet (ﷺ) was with one of his wives when one of the Mothers of the Believers (another of his wives) sent a bowl containing food with a servant of hers. Then, she (in whose house he was) struck it with her hand and the bowl was broken. He collected the pieces of the bowl and began to collect the follow in it and said, \"You eat,\" and gave an unbroken bowl to the messenger (servant) and kept the broken one.\n\n."}},{"id":140,"idInBook":140,"chapterId":7,"bookId":17,"arabic":"وَاَلتِّرْمِذِيُّ, وَسَمَّى اَلضَّارِبَةَ عَائِشَةَ, وَزَادَ: فَقَالَ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-{ طَعَامٌ بِطَعَامٍ, وَإِنَاءٌ بِإِنَاءٍ }  وَصَحَّحَهُ  1‏ .‏‏1 ‏- صحيح.‏ رواه الترمذي ( 1359 )‏، وقال: \" حديث حسن صحيح \".‏","english":{"narrator":"at-Tirmidhi named the one who broke it as 'Aishah (RA) and added:","text":"The Prophet (ﷺ) then said, \"Food for food, and a vessel for a vessel.\"\n\n."}},{"id":141,"idInBook":141,"chapterId":7,"bookId":17,"arabic":"وَعَنْ رَافِعِ بْنِ خَدِيجٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ زَرَعَ فِي أَرْضِ قَوْمٍ بِغَيْرِ إِذْنِهِمْ, فَلَيْسَ لَهُ مِنْ اَلزَّرْعِ شَيْءٌ, وَلَهُ نَفَقَتُهُ }  رَوَاهُ أَحْمَدُ, وَالْأَرْبَعَةُ إِلَّا النَّسَائِيَّ, وَحَسَّنَهُ اَلتِّرْمِذِيُّ  1‏ .‏‏1 ‏- صحيح بطرقه.‏ رواه أحمد ( 3 / 465 و 4 / 141 )‏، وأبو داود ( 3403 )‏، والترمذي ( 1366 )‏.‏ وقال الترمذي: \" حسن غريب \".‏","english":{"narrator":"Narrated Rafi' bin Khadij (RA):","text":"Allah's Messenger (ﷺ) said: \"Whoever sows in the land of a people without their permission, he has no right to any of the crop. However, he is entitled to what he spent on it.\"\n\n[Reported by Ahmad and al-Arba'a except an-Nasa'i. at-Tirmidhi graded it Hasan (good)."}},{"id":142,"idInBook":142,"chapterId":7,"bookId":17,"arabic":"وَيُقَالُ: إِنَّ اَلْبُخَارِيَّ ضَعَّفَهُ  1‏ .‏‏1 ‏- نقل ذلك الخطابي في \" المعالم \" ( 3 / 82 )‏ فقال: \" وضعفه البخاري أيضا.‏ وقال: تفرد بذلك ش/ريك، عن أبي إسحاق \" !.‏ قلت: وكلام البخاري لا يفهم منه تضعيف الحديث، وإنما هو صريح في تضعيف طريق من طرق الحديث، ولا أظن أن هناك أصرح مما نقله عنه الترمذي في ذلك ( 3 / 648 )‏ فقال: \" سألت محمد بن إسماعيل عن هذا الحديث؟ فقال: هو حديث حسن.‏ وقال: لا أعرفه من حديث أبي إسحاق إلا من رواية شريك \".‏ وأيضا ممن قواه بطرقه أبو حاتم.‏","english":{"narrator":"","text":"It has been said that al-Bukhari graded it Da'if (weak)."}},{"id":143,"idInBook":143,"chapterId":7,"bookId":17,"arabic":"وَعَنْ عُرْوَةَ بْنِ اَلزُّبَيْرِ قَالَ: قَالَ رَجُلٌ مِنْ اَلصَّحَابَةِ; مِنْ أَصْحَابِ رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِنَّ رَجُلَيْنِ اِخْتَصَمَا إِلَى رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-فِي أَرْضٍ, غَرَسَ أَحَدُهُمَا فِيهَا نَخْلًا, وَالْأَرْضُ لِلْآخَرِ, فَقَضَى رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-بِالْأَرْضِ لِصَاحِبِهَا, وَأَمَرَ صَاحِبَ اَلنَّخْلِ أَنْ يُخْرِجَ نَخْلَهُ.‏ وَقَالَ: \" لَيْسَ لِعِرْقٍ ظَالِمٍ حَقٌّ }  رَوَاهُ أَبُو دَاوُدَ, وَإِسْنَادُهُ حَسَنٌ  1‏ .‏ وَآخِرُهُ عِنْدَ أَصْحَابِ \" اَلسُّنَنِ \" مِنْ رِوَايَةِ عُرْوَةَ, عَنْ سَعِيدِ بْنِ زَيْدٍ.‏‏1 ‏- حديث صحيح.‏ وهو في \" سنن أبي داود \" ( 3074 )‏ وفيه قوله صلى الله عليه وسلم: \" من أحيا أرضا ميتة فهي له \" وهو صحيح، وسيذكره المصنف برقم ( 916 )‏ وانظر ما بعده.‏","english":{"narrator":"Narrated 'Urwa bin az-Zubair (RA):","text":"A man among the Companions of Allah's Messenger (ﷺ) said: \"Two men brought a dispute before Allah's Messenger (ﷺ) concerning a land in which one of them had planted palm trees and the land belonged to the other. So, Allah's Messenger (ﷺ) ruled that the land belongs to its owner, and commanded the owner of the palm trees to uproot his palm trees. He said, \"The labor of an unjust person has no right.\"\n\n[Reported by Abu Dawud and its chain of narrators is Hasan (good). The last (quoted) part of the aforesaid Hadith is found in the books of the collections of as-Sunan, from 'Urwa's narration on the authority of Sa'id bin Zaid."}},{"id":144,"idInBook":144,"chapterId":7,"bookId":17,"arabic":"وَاخْتُلِفَ فِي وَصْلِهِ وَإِرْسَالِهِ, وَفِي تَعْيِين صَحَابِيِّهِ  1‏ .‏‏1 ‏- قلت: وهذا على ما فيه كما ذكر الحافظ إلا أنه أحد الشواهد الكثيرة للحديث السابق، وتفصيل القول فيها \" بالأصل \"، وقد قال في \" الفتح \" ( 5 / 19 )‏ بعد أن ساق هذه الشواهد: \" وفي أسانيدها مقال، لكن يتقوى بعضها ببعض \".‏","english":{"narrator":"","text":"However, there is disagreement regarding whether it is Mawsul (an unbroken chain) or Mursal (missing link after the Tabi'i) as well as the determination of the name of the Companion who heard it from the Prophet (ﷺ)."}},{"id":145,"idInBook":145,"chapterId":7,"bookId":17,"arabic":"وَعَنْ أَبِي بَكْرَةَ; ‏- رضى الله عنه ‏- أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَالَ: فِي خُطْبَتِهِ يَوْمَ اَلنَّحْرِ بِمِنًى  1‏ { إِنَّ دِمَاءَكُمْ وَأَمْوَالَكُمْ  عَلَيْكُمْ حَرَامٌ, كَحُرْمَةِ يَوْمِكُمْ هَذَا، فِي بَلَدِكُمْ هَذَا، فِي شَهْرِكُمْ هَذَا }  مُتَّفَقٌ عَلَيْهِ  2‏ .‏‏1 ‏- تحرف في \" أ \" إلى: \" بمعنى \".‏‏2 ‏- صحيح.‏ رواه البخاري ( 67 )‏، ومسلم ( 1679 )‏.‏","english":{"narrator":"Narrated Abu Bakra (RA):","text":"In his Khutbah (religious talk - sermon) on the Day of Sacrifice at Mina, the Prophet (ﷺ) said: \"Your blood and your property and your honor are forbidden for you to violate, like the sacredness of this day of yours, in this month of yours, in this city of yours.\"\n\n."}},{"id":146,"idInBook":146,"chapterId":7,"bookId":17,"arabic":"عَنْ جَابِرِ بْنِ عَبْدِ اَللَّهِ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: { قَضَى رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-\" بِالشُّفْعَةِ فِي كُلِّ مَا لَمْ يُقْسَمْ, فَإِذَا وَقَعَتِ اَلْحُدُودُ وَصُرِّفَتْ اَلطُّرُقُ فَلَا شُفْعَةَ }  مُتَّفَقٌ عَلَيْهِ, وَاللَّفْظُ لِلْبُخَارِيِّ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 2257 )‏.‏ وصرفت: بينت.‏","english":{"narrator":"Narrated Jabir bin 'Abdullah (RA):","text":"Allah's Messenger (ﷺ) ruled that the option to buy a partner's share in property is applicable to everything that has not been divided. However, when boundaries are fixed and separate roads are made there is no partner's option.\"\n\n."}},{"id":147,"idInBook":147,"chapterId":7,"bookId":17,"arabic":"وَفِي رِوَايَةِ مُسْلِمٍ: { اَلشُّفْعَةُ فِي كُلِّ شِرْكٍ: أَرْضٍ, أَوْ رَبْعٍ, أَوْ حَائِطٍ, لَا يَصْلُحُ أَنْ يَبِيعَ حَتَّى يَعْرِضَ عَلَى شَرِيكِهِ }   1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم ( 1608 )‏ ( 135 )‏ وزاد: \" فيأخذ أو يدع.‏ فإن أبى فشريكه أحق به حتى يؤذنه \".‏","english":{"narrator":"Muslims' narration has:","text":"\"The option to buy a partner's share in property is applicable to everything which is shared, whether land, a dwelling or a garden and it is not lawful to sell before informing one's partner.\""}},{"id":148,"idInBook":148,"chapterId":7,"bookId":17,"arabic":"وَفِي رِوَايَةِ اَلطَّحَاوِيِّ: قَضَى اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-بِالشُّفْعَةِ فِي كُلِّ شَيْءٍ, وَرِجَالُهُ ثِقَاتٌ  1‏ .‏‏1 ‏- رواه الطحاوي في \" شرح المعاني \" ( 4 / 126 )‏، وقال الحافظ في \" الفتح \" ( 4 / 436 )‏.‏ وروى البيهقي من حديث ابن عباس مرفوعا: \" الشفعة في كل شيء \".‏ ورجاله ثقات إلا أنه أعل بالإرسال، وأخرج الطحاوي له شاهدا من حديث جابر بإسناد لا بأس برواته \".‏","english":{"narrator":"at-Tahawi's narration has:","text":"\"The Prophet (ﷺ) ruled for the right of partner's option regarding everything.\"\n\n."}},{"id":149,"idInBook":149,"chapterId":7,"bookId":17,"arabic":"وَعَنْ أَبِي رَافِعٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ اَلْجَارُ أَحَقُّ بِصَقَبِهِ }  أَخْرَجَهُ اَلْبُخَارِيُّ, وَفِيهِ قِصَّةٌ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 2258 )‏ من طريق عمرو بن الشريد قال: \" وقفت على سعد بن أبي وقاص فجاء المسور بن مخرمة فوضع يده على إحدى منكبي، إذ جاء أبو رافع مولى النبي ‏-صلى الله عليه وسلم‏- فقال: يا سعد ابتع مني بيتي في دارك.‏ فقال سعد: والله ما أبتاعهما.‏ فقال المسور: والله لتبتاعهما.‏ فقال سعد: والله لا أزيدك على أربعة آلاف منجمة أو مقطعة.‏ فقال أبو رافع: لقد أعطيت بها خمسمائة دينار، ولولا أني سمعت النبي ‏-صلى الله عليه وسلم‏- يقول: الجار أحق بسقبه ما أعطيتكها بأربعة آلاف، وأنا أعطي بها خمسمائة دينار، فأعطاه إياه\" .‏ والسقب: بالسين المهلة وأيضا الصاد المهلة: القرب والملاصقة.‏ ومنجمة أو مقطعة: المراد مؤجلة على أقساط معلومة.‏","english":{"narrator":"Narrated Abu Rafi' (RA):","text":"Allah's Messenger (ﷺ) said: \"The neighbor has more right (to be given preference) to the property which is near to him.\"\n\n."}},{"id":150,"idInBook":150,"chapterId":7,"bookId":17,"arabic":"وَعَنْ أَنَسِ بْنِ مَالِكٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ جَارُ اَلدَّارِ أَحَقُّ بِالدَّارِ }  رَوَاهُ النَّسَائِيُّ, وَصَحَّحَهُ اِبْنُ حِبَّانَ, وَلَهُ عِلَّةٌ  1‏ .‏‏1 ‏- ضعيف.‏ رواه النسائي في \" الكبرى \" كما في \" التحفة \" ( 4 / 69 )‏ من طريق قتادة، عن الحسن، عن سمرة، ومن هذا الوجه رواه أبو داود ( 3517 )‏، والترمذي ( 1368 )‏.‏ وقال الترمذي: \" حديث سمرة حديث حسن صحيح، وروى عيسى بن يونس، عن سعيد بن أبي عروبة، عن قتادة، عن أنس، عن النبي ‏-صلى الله عليه وسلم‏-.‏ والصحيح عند أهل العلم حديث الحسن عن سمرة، ولا نعرف حديث قتادة، عن أنس إلا من حديث عيسى بن يونس \".‏ قلت: ومن الوجه الثاني رواه ابن حبان ( 1153 )‏ وإلى هذا الاختلاف يشير قول الحافظ: \" وله علة \".‏ وخلاصة الكلام أن الحديث عند قتادة من وجهين: الأول: عن الحسن، عن سمرة، وهو الصواب عند أهل العلم.‏ والثاني: عن أنس، به.‏ وأيا كان الأمر فهو ضعيف من الوجهين؛ لعدم تصريح قتادة والحسن بالسماع؛ وكلاهما موصوف بالتدليس.‏","english":{"narrator":"Narrated Anas bin Malik (RA):","text":"Allah's Messenger (ﷺ) said: \"The neighbor of the house has the most right to buy it.\"\n\n."}},{"id":151,"idInBook":151,"chapterId":7,"bookId":17,"arabic":"وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ اَلْجَارُ أَحَقُّ بِشُفْعَةِ جَارِهِ, يُنْتَظَرُ بِهَا ‏- وَإِنْ كَانَ غَائِبًا ‏- إِذَا كَانَ طَرِيقُهُمَا وَاحِدًا }  رَوَاهُ أَحْمَدُ, وَالْأَرْبَعَةُ, وَرِجَالُهُ ثِقَاتٌ  1‏ .‏‏1 ‏- صحيح.‏ رواه أحمد ( 3 / 303 )‏، وأبو داود ( 3518 )‏، والنسائي في \" الكبرى \" كما في \" التحفة \" ( 2 / 229 )‏، والترمذي ( 1369 )‏، وابن ماجه ( 2494 )‏ وقد أعل الحديث بما لا يقدح.‏","english":{"narrator":"Narrated Jabir (RA):","text":"Allah's Messenger (ﷺ) said: \"The neighbor is most entitled to the right of option to buy his neighbor's property, and its exercise should be waited for, even if he is absent, if the two properties have one road.\"\n\n."}},{"id":152,"idInBook":152,"chapterId":7,"bookId":17,"arabic":"وَعَنْ اِبْنِ عُمَرَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏-, عَنِ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { اَلشُّفْعَةُ كَحَلِّ اَلْعِقَالِ }  رَوَاهُ اِبْنُ مَاجَهْ وَالْبَزَّارُ, وَزَادَ: \n\" وَلَا شُفْعَةَ لِغَائِبٍ \" وَإِسْنَادُهُ ضَعِيفٌ  1‏ .‏‏1 ‏- ضعيف جدا.‏ رواه ابن ماجه ( 2500 )‏.‏ وقال الحافظ في \" التلخيص \" ( 3 / 56 )‏ \" إسناده ضعيف جدا \".‏","english":{"narrator":"Narrated Ibn 'Umar (RA):","text":"The Prophet (ﷺ) said: \"The option to buy neighboring property is like loosening the knot (which restraints the camel).\"\n\n."}},{"id":153,"idInBook":153,"chapterId":7,"bookId":17,"arabic":"عَنْ صُهَيْبٍ ‏- رضى الله عنه ‏- أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَالَ: { ثَلَاثٌ فِيهِنَّ اَلْبَرَكَةُ: اَلْبَيْعُ إِلَى أَجَلٍ، وَالْمُقَارَضَةُ، وَخَلْطُ اَلْبُرِّ بِالشَّعِيرِ لِلْبَيْتِ, لَا لِلْبَيْعِ }  رَوَاهُ اِبْنُ مَاجَهْ بِإِسْنَادٍ ضَعِيفٍ  1‏ .‏‏1 ‏- ضعيف.‏ رواه ابن ماجه ( 2289 )‏.‏","english":{"narrator":"Narrated Suhaib (RA):","text":"The Prophet (ﷺ) said: \"There are three things which contain blessings: A business transaction in which payment is agreed on a fixed later time, al-Muqaradah (speculative partnership), and mixing wheat and barley for one's household use but not for sale.\"\n\n."}},{"id":154,"idInBook":154,"chapterId":7,"bookId":17,"arabic":"وَعَنْ حَكِيمِ بْنِ حِزَامٍ ‏- رضى الله عنه ‏- { أَنَّهُ كَانَ يَشْتَرِطُ عَلَى اَلرَّجُلِ إِذَا أَعْطَاهُ مَالًا مُقَارَضَةً: أَنْ لَا تَجْعَلَ مَالِي فِي كَبِدٍ رَطْبَةٍ, وَلَا تَحْمِلَهُ فِي بَحْرٍ, وَلَا تَنْزِلَ بِهِ فِي بَطْنِ مَسِيلٍ, فَإِنْ فَعَلْتَ شَيْئًا مِنْ ذَلِكَ فَقَدَ ضَمِنْتَ مَالِي }  رَوَاهُ اَلدَّارَقُطْنِيُّ, وَرِجَالُهُ ثِقَاتٌ  1‏ .‏‏1 ‏- رواه الدار قطني ( 3 / 63 )‏، وقوى الحافظ إسناده في \" التلخيص \" ( 3 / 58 )‏.‏","english":{"narrator":"Narrated al-Hakim bin Hazim (RA):","text":"He used to make a condition on the man to whom he gave his property in al-Muqaradah (to trade with, and the profit being shared between them), that: \"You should not trade with my property in living beings, and do not transport it by sea, and do not settle with it at the bottom of a river-bed; and if you do any of the aforesaid acts you should then guarantee my property.\"\n\n."}},{"id":155,"idInBook":155,"chapterId":7,"bookId":17,"arabic":"وَقَالَ مَالِكٌ فِي \n\" اَلْمُوَطَّأِ \" عَنْ اَلْعَلَاءِ بْنِ عَبْدِ اَلرَّحْمَنِ بْنِ يَعْقُوبَ, عَنْ أَبِيهِ, عَنْ جَدِّهِ: { أَنَّهُ عَمِلَ فِي مَالٍ لِعُثْمَانَ عَلَى أَنَّ اَلرِّبْحَ بَيْنَهُمَا }  وَهُوَ مَوْقُوفٌ صَحِيحٌ  1‏ .‏‏1 ‏- الموطأ ( 2 / 688 )‏.‏","english":{"narrator":"","text":"Malik said in al-Muwatta' from al-'Ala bin 'Abdur-Rahman bin Ya'qub from his father on the authority of his grandfather that he traded with some property belonging to 'Uthman (RA) so that the profit would be divided between them.\n\n."}},{"id":156,"idInBook":156,"chapterId":7,"bookId":17,"arabic":"عَنْ اِبْنِ عُمَرَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏-; { أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-عَامَلَ أَهْلَ خَيْبَرَ بِشَطْرِ مَا يَخْرُجُ مِنْهَا مِنْ ثَمَرٍ, أَوْ زَرْعٍ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 2329 )‏، ومسلم ( 1551 )‏ ( 1 )‏.‏","english":{"narrator":"Narrated Ibn 'Umar (RA):","text":"Allah's Messenger (ﷺ) had agreed with the people of Khaibar to give (to the Muslim authority) half what it produced of fruits or crops.\n\n."}},{"id":157,"idInBook":157,"chapterId":7,"bookId":17,"arabic":"وَفِي رِوَايَةٍ لَهُمَا: فَسَأَلُوا أَنْ يُقِرَّهُمْ بِهَا عَلَى أَنْ يَكْفُوا عَمَلَهَا وَلَهُمْ نِصْفُ اَلثَّمَرِ, فَقَالَ لَهُمْ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ نُقِرُّكُمْ بِهَا عَلَى ذَلِكَ مَا شِئْنَا \", فَقَرُّوا بِهَا, حَتَّى أَجْلَاهُمْ عُمَرُ }   1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 2338 )‏، ومسلم ( 1551 )‏ ( 6 )‏ وزادا: \" إلى تيماء وأريحاء \".‏","english":{"narrator":"A narration by al-Bukhari and Muslim has:","text":"They asked him (ﷺ) to allow them to stay on the land, on condition that they should do all the cultivation and have half the dates. Allah's Messenger (ﷺ) replied to them, \"We shall allow you to stay on the land, on that condition, as long as we wish.\" So they remained on the land till 'Umar (RA) expelled them."}},{"id":158,"idInBook":158,"chapterId":7,"bookId":17,"arabic":"وَلِمُسْلِمٍ: { أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-دَفَعَ إِلَى يَهُودِ خَيْبَرَ نَخْلَ خَيْبَرَ وَأَرْضَهَا عَلَى أَنْ يَعْتَمِلُوهَا مِنْ أَمْوَالِهِمْ, وَلَهُ شَطْرُ ثَمَرِهَا }   1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم ( 1551 )‏ ( 5 )‏ ووقع في \" أ \": \" ولهم \" بدل: \" وله \".‏ وعند مسلم: \" ولرسول الله ‏-صلى الله عليه وسلم‏- شطر ثمرها \".‏ وأيضا البخاري ( 2331 )‏ بنحوه.‏","english":{"narrator":"Muslim has:","text":"Allah's Messenger (ﷺ) handed over to the Jews of Khaibar, the palm-trees and the land of Khaibar, on condition that they should employ their own resources in working on it and keep half of its produce."}},{"id":159,"idInBook":159,"chapterId":7,"bookId":17,"arabic":"وَعَنْ حَنْظَلَةَ بْنِ قَيْسٍ قَالَ: { سَأَلْتُ رَافِعَ بْنَ خَدِيجٍ ‏- رضى الله عنه ‏- عَنْ كِرَاءِ اَلْأَرْضِ بِالذَّهَبِ وَالْفِضَّةِ? فَقَالَ: لَا بَأْسَ بِهِ, إِنَّمَا كَانَ اَلنَّاسُ يُؤَاجِرُونَ عَلَى عَهْدِ رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-عَلَى الْمَاذِيَانَاتِ, وَأَقْبَالِ اَلْجَدَاوِلِ, وَأَشْيَاءَ مِنْ اَلزَّرْعِ, فَيَهْلِكُ هَذَا وَيَسْلَمُ هَذَا, وَيَسْلَمُ هَذَا وَيَهْلِكُ هَذَا, وَلَمْ يَكُنْ لِلنَّاسِ كِرَاءٌ إِلَّا هَذَا, فَلِذَلِكَ زَجَرَ عَنْهُ, فَأَمَّا شَيْءٌ مَعْلُومٌ مَضْمُونٌ فَلَا بَأْسَ بِهِ }  رَوَاهُ مُسْلِمٌ  1‏ .‏ وَفِيهِ بَيَانٌ لِمَا أُجْمِلَ فِي اَلْمُتَّفَقَ عَلَيْهِ مِنْ إِطْلَاقِ اَلنَّهْيِ عَنْ كِرَاءِ اَلْأَرْضِ.‏‏1 ‏- صحيح.‏ رواه مسلم ( 1547 )‏ ( 116 )‏ ( ج 3 ص 1183 )‏.‏ والماذيانات: مسايل المياه، وقيل: ما ينبت حول السواقي.‏ وأقبال الجداول: أوائل ورؤوس الأنهار الصغيرة.‏","english":{"narrator":"Narrated Hanzala bin Qais (RA):","text":"I asked Rafi' bin Khadij (RA) about renting land for gold and silver and he replied, \"There is no harm in that, as the people used to rent land in the time of Allah's Messenger (ﷺ) for what grew by the river-beds, and the edges of the brooks/streams, or for a portion of the crop. However, sometimes this portion of the crop would be destroyed while the other is saved, or vice-versa. Thus, there would be no wages to pay the people (the owners of the land) except for the portion which produced a crop.\" For this reason, he warned against this (practice). However, if it is (rented) for something known and guaranteed, then there is no harm in it.\n\n. This narration contains a clarification of what was mentioned in general terms in the previous narration of al-Bukhari and Muslim, regarding the general prohibition of renting out land."}},{"id":160,"idInBook":160,"chapterId":7,"bookId":17,"arabic":"وَعَنْ ثَابِتِ بْنِ اَلضَّحَّاكِ ‏- رضى الله عنه ‏- { أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-نَهَى عَنْ اَلْمُزَارَعَةِ   1‏ بِالْمُؤَاجَرَةِ }  رَوَاهُ مُسْلِمٌ أَيْضًا  2‏ .‏‏1 ‏- سقط من \" أ \" ولكنها ثابتة في \" الأصل \"، و \" صحيح مسلم \".‏‏2 ‏- صحيح.‏ رواه مسلم ( 1549 )‏ ( 119 )‏.‏","english":{"narrator":"Narrated Thabit bin Dahhak (RA):","text":"Allah's Messenger (ﷺ) forbade al-Muzara'ah (employing people on land for a share of the produce), and ordered al-Mu'ajara (renting it out for cash).\n\n."}},{"id":161,"idInBook":161,"chapterId":7,"bookId":17,"arabic":"وَعَنْ اِبْنِ عَبَّاسٍ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏-; أَنَّهُ قَالَ: { اِحْتَجَمَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-وَأَعْطَى اَلَّذِي حَجَمَهُ أَجْرَهُ }  وَلَوْ كَانَ حَرَاماً لَمْ يُعْطِهِ.‏ رَوَاهُ اَلْبُخَارِيُّ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 2103 )‏.‏","english":{"narrator":"Narrated Ibn 'Abbas (RA):","text":"Allah's Messenger (ﷺ) had himself cupped and gave the one who cupped him his pay; and if it were prohibited he would not have given him (his pay).\n\n."}},{"id":162,"idInBook":162,"chapterId":7,"bookId":17,"arabic":"وَعَنْ رَافِعِ بْنِ خَدِيجٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ كَسْبُ اَلْحَجَّامِ خَبِيثٌ }  رَوَاهُ مُسْلِمٌ  1‏ .‏‏1 ‏- صحيح.‏ رواه مسلم ( 1568 )‏ ( 41 )‏ وهو بتمامه: ثمن الكلب خبيث، ومهر البغي خبيث، وكسب الحجام خبيث.‏","english":{"narrator":"Narrated Rafi' bin Khadij (RA):","text":"Allah's Messenger (ﷺ) said: \"The earnings of a cupper (Hajjam) are impure.\"\n\n."}},{"id":163,"idInBook":163,"chapterId":7,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ قَالَ اَللَّهُ عَزَّ وَجَلَّ ثَلَاثَةٌ أَنَا خَصْمُهُمْ يَوْمَ اَلْقِيَامَةِ: رَجُلٌ أَعْطَى بِي ثُمَّ غَدَرَ, وَرَجُلٌ بَاعَ حُرًّا , فَأَكَلَ ثَمَنَهُ، وَرَجُلٌ اِسْتَأْجَرَ أَجِيرًا , فَاسْتَوْفَى مِنْهُ, وَلَمْ يُعْطِهِ أَجْرَهُ }  رَوَاهُ مُسْلِمٌ  1‏ .‏‏1 ‏- حسن.‏ رواه البخاري ( 2227 )‏، وأما قول الحافظ: رواه مسلم فهو سهو منه ‏-رحمه الله‏-.‏ تنبيه: جاء في هامش \" أ \" ما يلي تعليقا على قوله: \" رواه مسلم \".‏ \" كذا وقع في \" الأصل \"، وإنما هو في البخاري في البيوع، وفي ابن ماجه في الإجارة.‏ قال سبط مؤلفه.‏ من هامش الأصل \".‏","english":{"narrator":"Narrated Abu Hurairah (RA):","text":"Allah's Messenger (ﷺ) said: \"Allah, the Great and Glorious, has said, \"There are three whose adversary I shall be on the Day of Resurrection: A man who gave a promise in My Name and then betrayed; a man who sold a free man and consumed his price; and a man who hired a worker and, after receiving full service from him, did not give him his wages.'\"\n\n."}},{"id":164,"idInBook":164,"chapterId":7,"bookId":17,"arabic":"وَعَنْ اِبْنِ عَبَّاسٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ إِنَّ أَحَقَّ مَا أَخَذْتُمْ عَلَيْهِ حَقًّا كِتَابُ اَللَّهِ }  أَخْرَجَهُ اَلْبُخَارِيُّ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 5737 )‏ من طريق ابن أبي ملكية، عن ابن عباس النبي أن نفرا من أصحاب النبي ‏-صلى الله عليه وسلم‏- مروا بماء فيهم لديغ ‏- أو سليم ‏- فعرض لهم رجل من أهل الماء.‏ فقال: هل فيكم من راق؟ إن في الماء رجلا لديغا أو سليما.‏ فانطلق رجل منهم، فقرأ بفاتحة الكتاب على شاء، فبرأ، فجاء بالشاء إلى أصحابه، فكرهوا ذلك، وقالوا: أخذت على كتاب الله أجرا، حتى قدموا المدينة فقالوا: يا رسول الله ! أخذ على كتاب الله أجرا؟ فقال رسول الله ‏-صلى الله عليه وسلم‏-: إن أحق … الحديث.‏","english":{"narrator":"Narrated Ibn 'Abbas (RA):","text":"Allah's Messenger (ﷺ) said: \"The most worthy thing for which you receive payment is Allah's Book.\"\n\n."}},{"id":165,"idInBook":165,"chapterId":7,"bookId":17,"arabic":"وَعَنْ اِبْنِ عُمَرَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ أَعْطُوا اَلْأَجِيرَ أَجْرَهُ قَبْلَ أَنْ يَجِفَّ عَرَقُهُ }  رَوَاهُ اِبْنُ مَاجَهْ  1‏ .‏‏1 ‏- حديث صحيح بشواهده.‏ رواه ابن ماجه ( 2443 )‏ بسند ضعيف جدا.‏ قلت: وله شواهد من حديث أبي هريرة، وجابر بن عبد الله، وعطاء بن يسار.‏ فأما حديث أبي هريرة: فرواه الطحاوي في \" المشكل \" ( 4 / 142 )‏، والبيهقي ( 6 / 121 )‏ بسند حسن على أقل أحواله، وله طريق أخرى عند أبي يعلى ( 6682 )‏.‏ وأما حديث جابر: فرواه الطبراني في \" الصغير \" ( 34 )‏ وسنده ضعيف.‏ وأما مرسل عطاء: فرواه ابن زنجويه في \" الأموال ( 2091 )‏ بسند حسن.‏ تنبيه: جاء عقب هذا الحديث في \" الأصل \" قول الحافظ: \" وفي الباب: عن أبي هريرة ‏-رضي الله عنه‏- عند  يعلى والبيهقي.‏ وجابر عند الطبراني، وكلها ضعاف \".‏ ثم ضرب عليه الناسخ.‏ ولم يرد هذا الكلام في \" أ \" ولذلك حذفته.‏","english":{"narrator":"Narrated Ibn 'Umar (RA):","text":"Allah's Messenger (ﷺ) said: \"Give the hired worker his wage before his sweat dries.\"\n\n."}},{"id":166,"idInBook":166,"chapterId":7,"bookId":17,"arabic":"وَعَنْ أَبِي سَعِيدٍ اَلْخُدْرِيِّ ‏- رضى الله عنه ‏- أَنَّ اَلنَّبِيَّ ‏-صَلَّى اَللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: { مَنِ اِسْتَأْجَرَ أَجِيراً, فَلْيُسَلِّمْ لَهُ أُجْرَتَهُ }  رَوَاهُ عَبْدُ اَلرَّزَّاقِ وَفِيهِ اِنْقِطَاعٌ, وَوَصَلَهُ اَلْبَيْهَقِيُّ مِنْ طَرِيقِ أَبِي حَنِيفَةَ  1‏ .‏‏1 ‏- ضعيف.‏ رواه عبد الرازق في \" المصنف \" ( 8 / 235 / رقم 15023 )‏ قال: أخبرنا معمر والثوري، عن حماد، عن إبراهيم، عن أبي هريرة، وأبي سعيد الخدري ‏- أو أحدهما ‏- أن النبي ‏-صلى الله عليه وسلم‏-، قال: فذكره.‏ وهو منقطع كما قال الحافظ، فإبراهيم لم يسمع من أحد من الصحابة.‏ ورواه أحمد ( 3 / 59 و 68 و 71 )‏ من طريق حماد، ولكن عن أبي سعيد وحده بلفظ: \" نهى عن استئجار الأجير حتى يبين له أجره \" وهو منقطع كسابقه.‏ وأما البيهقي فرواه ( 6 / 120 )‏ من طريق ابن المبارك، عن أبي حنيفة، عن حماد، عن إبراهيم، عن الأسود، عن أبي هريرة، وأبو حنيفة ضعيف عند أئمة الجرح والتعديل، ولذلك قال البيهقي: \" كذا رواه أبو حنيفة.‏ وكذا في كتابي عن أبي هريرة \".‏ قلت: وخالف الإمام الجبل شعبة.‏ فرواه النسائي ( 7 / 31 )‏ من طريق ابن المبارك، عن شعبة، عن حماد، عن إبراهيم، عن أبي سعيد، قال: إذا استأجرت أجيرا، فأعلمه أجره وتابع شعبة على ذلك الثوري، فقال عبد الرازق في \" المصنف \" ( 15024 )‏.‏ \" قلت للثوري: أسمعت حمادا يحدث عن إبراهيم، عن أبي سعيد؛ أن النبي ‏-صلى الله عليه وسلم‏- قال: من استأجر أجيرا، فليسم له إجارته ؟ قال: نعم.‏ وحدث به مرة أخرى، فلم يبلغ به النبي ‏-صلى الله عليه وسلم‏- \".‏ وأبو حنيفة ‏-رحمه الله‏- لا يوازن بواحد منهما ‏-رحمهما الله‏-، فكيف بهما وقد اجتمعا.‏ ثم رأيت ابن أبي حاتم نقل عن أبي زرعة في \" العلل \" ( 1 / 376 / رقم 1118 )‏ قوله: \" الصحيح موقوف على أبي سعيد \" فالحمد لله على توفيقه.‏ قلت: ولا يفهم من قوله: \" الصحيح … \" أن الإسناد صحيح كما ذهب إلى ذلك الشيخ شعيب الأرناؤوط في تعليقه على \" المراسيل \" ص ( 168 )‏، إذ كيف يفهم ذلك، بينما الإنقطاع لم ينتف من السند؟، وإنما المراد أن راوية من رواه موقوفا ‏- بغض النظر عن صحة السند أو ضعفه ‏- أصح من رواية من رفعه، وفي بقية كلام أبي زرعة ما يوضح ذلك، إذ علل رأيه السابق بقوله: \" لأن الثوري أحفظ \".‏","english":{"narrator":"Narrated Abu Sa'id al-Khudri (RA):","text":"The Prophet (ﷺ) said: \"Whoever hires a worker should pay him his wages in full.\"\n\n."}},{"id":167,"idInBook":167,"chapterId":7,"bookId":17,"arabic":"عَنْ عُرْوَةَ, عَنْ عَائِشَةَ ‏-رَضِيَ اَللَّهُ عَنْهَا‏-; أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَالَ: { مَنْ عَمَّرَ أَرْضاً لَيْسَتْ لِأَحَدٍ, فَهُوَ أَحَقُّ بِهَا }  قَالَ عُرْوَةُ: وَقَضَى بِهِ عُمَرُ فِي خِلَافَتِهِ.‏ رَوَاهُ اَلْبُخَارِيُّ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 2335 )‏ وليس عند البخاري لفظ: \" بها \".‏","english":{"narrator":"Narrated 'Urwa from 'Aishah (RA):","text":"The Prophet (ﷺ) said: \"He who develops land that does not belong to anyone, has the most right to it.\"\n\n'Urwa said that 'Umar ruled according to that during his caliphate.\n\n"}},{"id":168,"idInBook":168,"chapterId":7,"bookId":17,"arabic":"وَعَنْ سَعِيدِ بْنِ زَيْدٍ ‏- رضى الله عنه ‏- عَنْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { مَنْ أَحْيَا أَرْضاً مَيْتَةً فَهِيَ لَهُ }  رَوَاهُ اَلثَّلَاثَةُ, وَحَسَّنَهُ اَلتِّرْمِذِيُّ.‏","english":{"narrator":"Narrated Sa'id bin Zaid (RA):","text":"The Prophet (ﷺ) said: \"If anyone makes a barren land productive, then it belongs to him.\"\n\n."}},{"id":169,"idInBook":169,"chapterId":7,"bookId":17,"arabic":"وَقَالَ: رُوِيَ مُرْسَلاً.‏ وَهُوَ كَمَا قَالَ, وَاخْتُلِفَ فِي صَحَابِيِّهِ, فَقِيلَ: جَابِرٌ, وَقِيلَ: عَائِشَةُ, وَقِيلَ: عَبْدُ اَللَّهِ بْنُ عَمْرٍو, وَالرَّاجِحُ اَلْأَوَّلُ  1‏ .‏‏1 ‏- حديث صحيح، وانظر ما تقدم رقم ( 897 و 898 )‏.‏","english":{"narrator":"","text":"And he (at-Tirmidhi) said that it was reported in a Mursal (missing link after the Tabi'i) form, which is the case. However, there is disagreement regarding the Companion who heard it from the Prophet (ﷺ), and it has been said that it was Jabir, 'Aishah or 'Abdullah bin 'Umar, and the strongest opinion is that it was the first one (i.e. Jabir)."}},{"id":170,"idInBook":170,"chapterId":7,"bookId":17,"arabic":"وَعَنِ اِبْنِ عَبَّاسٍ; أَنَّ اَلصَّعْبَ بْنَ جَثَّامَةَ ‏- رضى الله عنه ‏- أَخْبَرَهُ أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَالَ: { لَا حِمَى إِلَّا لِلَّهِ وَلِرَسُولِهِ }  رَوَاهُ اَلْبُخَارِيُّ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري ( 2370 )‏.‏","english":{"narrator":"","text":"Narrated Ibn 'Abbas (RA) that as-Sa'b bin Jaththamah al-Laithi (RA) informed him that the Prophet (ﷺ) had said, \"There is no preserve except what belongs to Allah and His Messenger.\"\n\n."}},{"id":171,"idInBook":171,"chapterId":7,"bookId":17,"arabic":"وَعَنْ اِبْنِ عَبَّاسٍ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا ضَرَرَ وَلَا ضِرَارَ }  رَوَاهُ أَحْمَدُ, وَابْنُ مَاجَهْ  1‏ .‏‏1 ‏- حديث صحيح بطرقه وشواهده؛ إذ قد روي عن عدد كبير من الصحابة، وبطرق عدة، كما صححه جماعة من الحفاظ.‏ وتفصيل ذلك بالأصل.‏","english":{"narrator":"Narrated :","text":"Allah's Messenger (ﷺ) said: \"There should neither be harming (of others without cause), nor reciprocating harm (between two parties).\"\n\n."}},{"id":172,"idInBook":172,"chapterId":7,"bookId":17,"arabic":"وَلَهُ مِنْ حَدِيثِ أَبِي سَعِيدٍ مِثْلُهُ, وَهُوَ فِي اَلْمُوَطَّإِ مُرْسَلٌ  1‏ .‏‏1 ‏- الموطأ ( 2 / 745 / رقم 31 )‏، وانظر ما قبله.‏","english":{"narrator":"","text":"Ibn Majah reported something similar to the aforesaid Hadith from Abu Sa'id's narration. It is found in al-Muwatta' in a Mursal form (missing link after the Tabi'i)."}},{"id":173,"idInBook":173,"chapterId":7,"bookId":17,"arabic":"وَعَنْ سَمُرَةَ بْنِ جُنْدُبٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ أَحَاطَ حَائِطًا عَلَى أَرْضٍ فَهِيَ لَهُ }  رَوَاهُ أَبُو دَاوُدَ, وَصَحَّحَهُ اِبْنُ اَلْجَارُودِ  1‏ .‏‏1 ‏- حديث صحيح.‏ بما له من شواهد كما تقد م رقم ( 897 و 898 )‏، وإن رواه أبو داود ( 3077 )‏، وابن الجارود ( 1015 )‏ بسند ضعيف.‏","english":{"narrator":"Narrated Samurah bin Jundub (RA):","text":"Allah's Messenger (ﷺ) said: \"If anyone puts a wall around a (barren) land, it belongs to him.\"\n\n."}},{"id":174,"idInBook":174,"chapterId":7,"bookId":17,"arabic":"وَعَنْ عَبْدِ اَللَّهِ بْنِ مُغَفَّلٍ ‏- رضى الله عنه ‏- أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَالَ: { مَنْ حَفَرَ بِئْرًا فَلَهُ أَرْبَعُونَ ذِرَاعًا عَطَنًا لِمَاشِيَتِهِ }  رَوَاهُ اِبْنُ مَاجَهْ بِإِسْنَادٍ ضَعِيفٍ  1‏ .‏‏1 ‏- حسن.‏ رواه ابن ماجه ( 2486 )‏ وسنده ضعيف كما قال الحافظ، لكن يشهد له حديث أبي هريرة عند أحمد ( 2 / 494 )‏، وله شاهد آخر مرسل في \" مراسيل \" أبي داود.‏","english":{"narrator":"Narrated 'Abdullah bin Mughaffal (RA):","text":"The Prophet (ﷺ), \"Whoever digs a well, shall have forty cubits (of land) as resting place for his animals near the water.\"\n\n."}},{"id":175,"idInBook":175,"chapterId":7,"bookId":17,"arabic":"وَعَنْ عَلْقَمَةَ بْنِ وَائِلٍ, عَنْ أَبِيهِ; { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-أَقْطَعَهُ أَرْضًا بِحَضْرَمَوْتَ }  رَوَاهُ أَبُو دَاوُدَ , وَاَلتِّرْمِذِيُّ , وَصَحَّحَهُ اِبْنُ حِبَّانَ  1‏ .‏‏1 ‏- صحيح .‏ رواه أبو داود ( 3058 و 3059 )‏ ، والترمذي ( 1381 )‏.‏ وقال الترمذي : \"هذا حديث حسن\" .‏ قلت : لعله قال ذلك لوجود سماك بن حرب في إسناده ، ولكنه توبع عليه كما عند أبي داود وغيره.‏","english":{"narrator":"Narrated 'Alqama bin Wa'il from his father (RA):","text":"\"The Prophet (ﷺ) assigned him land in Hadramout.\"\n\n."}},{"id":176,"idInBook":176,"chapterId":7,"bookId":17,"arabic":"وَعَنْ اِبْنِ عُمَرَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-أَقْطَعَ اَلزُّبَيْرَ حُضْرَ فَرَسِهِ , فَأَجْرَى اَلْفَرَسَ حَتَّى قَامَ , ثُمَّ رَمَى سَوْطَهُ.‏ فَقَالَ : \" أَعْطُوهُ حَيْثُ بَلَغَ اَلسَّوْطُ }  رَوَاهُ أَبُو دَاوُدَ وَفِيهِ ضَعْفٌ  1‏ .‏‏1 ‏- ضعيف .‏ رواه أبو داود ( 3072 )‏.‏","english":{"narrator":"Narrated Ibn 'Umar (RA):","text":"The Prophet (ﷺ) assigned az-Zubair the land his horse could cover at a run. He made his horse run, and when it stopped he threw his whip. He then said, \"Give to him up to the spot his has reached.\n\n."}},{"id":177,"idInBook":177,"chapterId":7,"bookId":17,"arabic":"وَعَنْ رَجُلٍ مِنْ اَلصَّحَابَةِ ‏- رضى الله عنه ‏- قَالَ: { غَزَوْتُ مَعَ رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-فَسَمِعْتُهُ يَقُولُ: اَلنَّاسُ  1‏ شُرَكَاءُ فِي ثَلَاثٍ : فِي اَلْكَلَأِ ، وَالْمَاءِ ، وَالنَّارِ }  رَوَاهُ أَحْمَدُ , وَأَبُو دَاوُدَ , وَرِجَالُهُ ثِقَاتٌ  2‏ .‏‏1 ‏- كذا في \" الأصلين \" وهو وهم من الحافظ ‏-رحمه الله‏- فهذا اللفظ ليس عند أحمد ، ولا عند أبي داود ، وإنما عندهما بلفظ : \" المسلمون \" ، ثم رأيته ‏-رحمه الله‏- ساقه في \" التلخيص \" ( 3 / 65 )‏ بلفظ : \" المسلمون \" بعد أن عزاه لأحمد وأبي داود.‏‏2 ‏- صحيح .‏ رواه أحمد ( 5 /364 )‏ ، وأبو داود ( 3477 )‏.‏","english":{"narrator":"Narrated A man of the Companions (RA):","text":"I went on an expedition with the Prophet (ﷺ) and heard him say, \"People are partners in three things: grazing, pasture, water and fire.\"\n\n."}},{"id":178,"idInBook":178,"chapterId":7,"bookId":17,"arabic":"عَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ : { إِذَا مَاتَ اَلْإِنْسَانُ اِنْقَطَعَ عَنْهُ عَمَلُهُ إِلَّا مِنْ ثَلَاثٍ : صَدَقَةٍ جَارِيَةٍ ، أَوْ عِلْمٍ يُنْتَفَعُ بِهِ، أَوْ وَلَدٍ صَالَحٍ يَدْعُو لَهُ }  رَوَاهُ مُسْلِم ٌ  1‏ .‏‏1 ‏- صحيح .‏ رواه مسلم ( 1631 )‏.‏ \" تنبيه \" : وقع في النسخ المطبوعة من البلوغ : \" إذا مات ابن آدم \" ولم أجده بهذا اللفظ في أي كتاب من كتب السنة ، وهو في \" الأصلين \" على الصواب.‏","english":{"narrator":"Narrated Abu Hurairah (RA):","text":"Allah's Messenger (ﷺ) said: \"When a son of Adam (i.e. any human being) dies his deeds are discontinued, with three exceptions: Sadaqah, whose benefit is continuous; or knowledge from which benefit continues to be reaped, or a righteous child who supplicates for him.\"\n\n."}},{"id":179,"idInBook":179,"chapterId":7,"bookId":17,"arabic":"وَعَنْ اِبْنِ عُمَرَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ : { أَصَابَ عُمَرُ أَرْضًا بِخَيْبَرَ , فَأَتَى اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-يَسْتَأْمِرُهُ فِيهَا , فَقَالَ : يَا رَسُولَ اَللَّهِ ! إِنِّي أَصَبْتُ أَرْضًا بِخَيْبَرَ لَمْ أُصِبْ مَالًا قَطُّ هُوَ أَنْفَسُ عِنْدِي مِنْه ُ  1‏ .‏ قَالَ : \" إِنْ شِئْتَ حَبَسْتَ أَصْلَهَا , وَتَصَدَّقْتَ بِهَا \" .‏ قَالَ : فَتَصَدَّقَ بِهَا عُمَرُ ,  أَنَّهُ لَا يُبَاعُ أَصْلُهَا, وَلَا يُورَثُ , وَلَا يُوهَبُ , فَتَصَدَّقَ بِهَا فِي اَلْفُقَرَاءِ , وَفِي اَلْقُرْبَى , وَفِي اَلرِّقَابِ , وَفِي سَبِيلِ اَللَّهِ , وَابْنِ اَلسَّبِيلِ , وَالضَّيْفِ , لَا جُنَاحَ عَلَى مَنْ وَلِيَهَا أَنْ يَأْكُلَ مِنْهَا بِالْمَعْرُوفِ , وَيُطْعِمَ صَدِيقاً }   2‏ غَيْرَ مُتَمَوِّلٍ مَالً ا  3‏ .‏ مُتَّفَقٌ عَلَيْهِ , وَاللَّفْظُ لِمُسْلِمٍ .‏  4‏ .‏‏1 ‏- زاد مسلم : \" فما تأمرني به \" وللبخاري : \" فما تأمر به \".‏‏2 ‏- في رواية للبخاري ( 2764 )‏ : \" أو يوكل صديقه \".‏‏3 ‏- الذي في مسلم : \" غير متمول فيه \" ، وهي للبخاري أيضا ( 2772 )‏ .‏ ولهما في رواية : \" غير متأثل مالا \".‏‏4 ‏- صحيح .‏ رواه البخاري ( 2737 )‏ ، ومسلم (1632)‏ ولا أجد كبير فائدة لقول الحافظ : \" واللفظ لمسلم \" .‏ والله أعلم.‏","english":{"narrator":"Narrated Ibn 'Umar (RA):","text":"'Umar (RA) got some land in Khaibar and went to the Prophet (ﷺ) asking his command regarding it and said, \"O Allah's Messenger, I have acquired a land in Khaibar which is the most valuable property that I have ever acquired.\" He replied, \"If you wish you may make the property an endowment and give its produce as Sadaqah.\" So 'Umar (RA) gave the land as Sadaqah (in endowment on the condition) that must not be sold, inherited, or given away. And he gave its produce as Sadaqah to be devoted to the poor, relatives, the emancipation of salves, in Allah's Cause, for travelers and guests, and there is no sin upon the one who administers it if he eats something from it in a reasonable manner or gives something to a friend to eat, provided he does not store anything as goods (for himself).\n\n."}},{"id":180,"idInBook":180,"chapterId":7,"bookId":17,"arabic":"وَفِي رِوَايَةٍ لِلْبُخَارِيِّ : { تَصَدَّقْ بِأَصْلِهِ , لَا يُبَاعُ وَلَا يُوهَبُ , وَلَكِنْ يُنْفَقُ ثَمَرُهُ }   1‏ .‏‏1 ‏- البخاري برقم (2764)‏.‏","english":{"narrator":"A narration by al-Bukhari has:","text":"\"He gave the land in Sadaqah (as an endowment) that must not be sold or gifted, but its produce must be spent (as Sadaqah).\""}},{"id":181,"idInBook":181,"chapterId":7,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ : { بَعَثَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-عُمَرَ عَلَى اَلصَّدَقَةِ .‏ .‏ }  اَلْحَدِيثَ , وَفِيهِ :","english":{"narrator":"Narrated Abu Hurairah (RA):","text":"Allah's Messenger (ﷺ) sent 'Umar (RA) to collect Sadaqah...\" The narrator reported the Hadith and it contains:"}},{"id":182,"idInBook":182,"chapterId":7,"bookId":17,"arabic":"{ وَأَمَّا خَالِدٌ فَقَدْ اِحْتَبَسَ أَدْرَاعَهُ وَأَعْتَادَهُ فِي سَبِيلِ اَللَّهِ }  مُتَّفَقٌ عَلَيْه ِ  1‏ .‏‏1 ‏- تقدم برقم (885)‏.‏","english":{"narrator":"","text":"\"As for Khalid, he has kept back his coats of mail and weapons to use them in Allah's Cause.\"\n\n."}},{"id":183,"idInBook":183,"chapterId":7,"bookId":17,"arabic":"عَنْ اَلنُّعْمَانِ بْنِ بَشِيرٍ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- أَنَّ أَبَاهُ أَتَى بِهِ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-فَقَالَ : { إِنِّي نَحَلْتُ اِبْنِي هَذَا غُلَامًا كَانَ لِي، فَقَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-\" أَكُلُّ وَلَدِكَ نَحَلْتَهُ مِثْلَ هَذَا\" ?.‏ فَقَالَ : لَا .‏ فَقَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-\" فَارْجِعْهُ\" }   1‏ .‏‏1 ‏- صحيح .‏ وهذه الرواية للبخاري ( 2586 )‏ ، ومسلم ( 1623)‏ (9)‏.‏","english":{"narrator":"Narrated an-Nu'man bin Bashir (RA):","text":"His father brought him to Allah's Messenger (ﷺ) and said, \"I have given this son of mine a slave, who was belonging to me.\" Allah's Messenger (ﷺ) asked, \"Have you given all your children the like of him?\" He replied, \"No.\" Allah's Messenger (ﷺ) then said, \"Take him back then.\""}},{"id":184,"idInBook":184,"chapterId":7,"bookId":17,"arabic":"وَفِي لَفْظٍ : { فَانْطَلَقَ أَبِي إِلَى اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-لِيُشْهِدَهُ عَلَى صَدَقَتِي.‏ فَقَالَ : \" أَفَعَلْتَ هَذَا بِوَلَدِكَ كُلِّهِمْ\"?.‏ قَالَ : لَا.‏ قَالَ: \" اِتَّقُوا اَللَّهَ , وَاعْدِلُوا بَيْنَ أَوْلَادِكُمْ \" فَرَجَعَ أَبِي, فَرَدَّ تِلْكَ اَلصَّدَقَةَ }  مُتَّفَقٌ عَلَيْه ِ  1‏ .‏‏1 ‏- هذه الرواية للبخاري ( 2587 )‏ ، ومسلم (1623)‏ (13)‏ والسياق لمسلم.‏","english":{"narrator":"A narration has:","text":"My father went then to the Prophet (ﷺ) to call him as a witness to my Sadaqah (i.e. gift) and he asked, \"Have you done the same with all your children?\" He replied, \"No.\" He said, \"Fear Allah and treat your children equally.\" My father then returned and took back that gift.\n\n."}},{"id":185,"idInBook":185,"chapterId":7,"bookId":17,"arabic":"وَفِي رِوَايَةٍ لِمُسْلِمٍ قَالَ : { فَأَشْهِدْ عَلَى هَذَا غَيْرِي\" ثُمَّ قَالَ : \" أَيَسُرُّكَ أَنْ يَكُونُوا لَكَ فِي اَلْبِرِّ سَوَاءً\"? قَالَ : بَلَى .‏ قَالَ : \" فَلَا إِذًا }   1‏ .‏‏1 ‏- مسلم برقم ( 1623 )‏ ( 17 )‏.‏","english":{"narrator":"A narration by Muslim has:","text":"He said, \"Call someone other than me as a witness to this.\" He then said, \"Would you like them to be equal in their kind treatment of you?\" He replied, \"Yes.\" He said, \"Don't do it, then.\""}},{"id":186,"idInBook":186,"chapterId":7,"bookId":17,"arabic":"وَعَنْ اِبْنِ عَبَّاسٍ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ : قَالَ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-{ اَلْعَائِدُ فِي هِبَتِهِ كَالْكَلْبِ يَقِيءُ, ثُمَّ يَعُودُ فِي قَيْئِهِ\" }  مُتَّفَقٌ عَلَيْه ِ  1‏ .‏‏1 ‏- صحيح .‏ رواه البخاري (2589)‏ ، ومسلم (1622)‏ (8)‏.‏","english":{"narrator":"Narrated Ibn 'Abbas (RA):","text":"The Prophet (ﷺ) said: \"The one who repossesses a gift is like a dog which vomits and then returns to its vomit.\"\n\n."}},{"id":187,"idInBook":187,"chapterId":7,"bookId":17,"arabic":"وَفِي رِوَايَةٍ لِلْبُخَارِيِّ : { لَيْسَ لَنَا مَثَلُ اَلسَّوْءِ, اَلَّذِي يَعُودُ فِي هِبَتِهِ كَالْكَلْبِ يَرْجِعُ فِي قَيْئِهِ }   1‏ .‏‏1 ‏- البخاري برقم ( 2622 )‏.‏","english":{"narrator":"A narration by al-Bukhari has:","text":"\"An evil example does not apply to us, one who repossesses a gift is like a dog which vomits and then returns to its vomit.\""}},{"id":188,"idInBook":188,"chapterId":7,"bookId":17,"arabic":"وَعَنْ اِبْنِ عُمَرَ ، وَابْنِ عَبَّاسٍ ‏-رَضِيَ اَللَّهُ عَنْهُمْ‏- , عَنْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ : { لَا يَحِلُّ لِرَجُلٍ مُسْلِمٍ أَنْ يُعْطِيَ اَلْعَطِيَّةَ , ثُمَّ يَرْجِعَ فِيهَا ; إِلَّا اَلْوَالِدُ فِيمَا يُعْطِي وَلَدَهُ\" }  رَوَاهُ أَحْمَدُ , وَالْأَرْبَعَةُ , وَصَحَّحَهُ اَلتِّرْمِذِيُّ , وَابْنُ حِبَّانَ , وَالْحَاكِم ُ  1‏ .‏‏1 ‏- صحيح .‏ رواه أحمد ( 2 7 و 78 )‏ ، وأبو داود ( 3539 )‏ ، والنسائي ( 6 / 267 ‏- 268 )‏ ، والترمذي ( 2132 )‏ ، وابن ماجه ( 2377 )‏ ، وابن حبان ( 5101 )‏ ، والحاكم ( 2 / 46 )‏ وزادوا جميعا إلا ابن ماجه : \"ومثل الذي يعطي العطية ، ثم يرجع فيها كمثل الكلب، حتى إذا شبع قاء ، ثم عاد في قيئه\".‏ وقال الترمذي : \" هذا حديث حسن صحيح \".‏","english":{"narrator":"Narrated Ibn 'Umar and Ibn 'Abbas (RA):","text":"The Prophet (ﷺ) said: \"It is not lawful for a Muslim man to give a gift and then take it back, except a father regarding what he gives a child.\"\n\n."}},{"id":189,"idInBook":189,"chapterId":7,"bookId":17,"arabic":"وَعَنْ عَائِشَةَ ‏-رَضِيَ اَللَّهُ عَنْهَا‏- قَالَتْ : { كَانَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقْبَلُ اَلْهَدِيَّةَ , وَيُثِيبُ عَلَيْهَا }  رَوَاهُ اَلْبُخَارِيّ ُ  1‏ .‏‏1 ‏- صحيح .‏ رواه البخاري ( 2585)‏.‏","english":{"narrator":"Narrated 'Aishah (RA):","text":"Allah's  Messenger (ﷺ) would accept a gift and give something in return for it.\n\n."}},{"id":190,"idInBook":190,"chapterId":7,"bookId":17,"arabic":"وَعَنْ اِبْنِ عَبَّاسٍ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ : { وَهَبَ رَجُلٌ لِرَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-نَاقَةً، فَأَثَابَهُ عَلَيْهَا , فَقَالَ : \" رَضِيتَ\" ? قَالَ : لَا .‏ فَزَادَهُ , فَقَالَ : \"رَضِيتَ\"? قَالَ : لَا .‏ فَزَادَهُ .‏ قَالَ : \"رَضِيتَ\" ? قَالَ : نَعَمْ.‏ }  رَوَاهُ أَحْمَدُ , وَصَحَّحَهُ اِبْنُ حِبَّان َ  1‏‏1 ‏- صحيح .‏ رواه أحمد (2 95)‏ ، وابن حبان ( 1146 موارد )‏ وزادا : \" فقال رسول الله ‏-صلى الله عليه وسلم‏- : لقد هممت أن لا أتهب هبة من قرشي ، أو أنصاري ، أو ثقفي \" .‏ قلت : وقوله : \"أتهب\" بالتاء المشددة ، أي : أقبل الهدية ، وأما سبب هم النبي ‏-صلى الله عليه وسلم‏- بعدم قبول الهدية إلا من هؤلاء فهو كما يقول ابن الأثير (5/ 231)‏ : \"لأنهم أصحاب مدن وقرى ، وهم أعرف بمكارم الأخلاق؛ ولأن في أخلاق البادية جفاء ، وذهابا عن المروءة ، وطلبا للزيادة\".‏","english":{"narrator":"Narrated Ibn 'Abbas (RA):","text":"A man gave away a she-camel to Allah's Messenger (ﷺ). So he gave him something in return for it and asked, \"Are you pleased?\" He replied, \"No.\" So he gave him more and asked, \"Are you pleased?\" He replied, \"No.\" Again he gave him more and asked, \"Are you pleased?\" He replied, \"Yes.\"\n\n."}},{"id":191,"idInBook":191,"chapterId":7,"bookId":17,"arabic":"وَعَنْ جَابِرٍ ‏- رضى الله عنه ‏- قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ اَلْعُمْرَى لِمَنْ وُهِبَتْ لَهُ }  مُتَّفَقٌ عَلَيْه ِ  1‏ .‏‏1 ‏- صحيح .‏ رواه البخاري ( 2625 )‏ ، ومسلم ( 1625 )‏ ( 25 )‏ ، والسياق لمسلم ، وأما البخاري فعن جابر قال : قضى النبي ‏-صلى الله عليه وسلم‏- بالعمرى أنها لمن وهبت له.‏","english":{"narrator":"Narrated Jabir (RA):","text":"Allah's Messenger (ﷺ) said: \"What is given in life-tenancy belongs to the one to whom it is given.\"\n\n."}},{"id":192,"idInBook":192,"chapterId":7,"bookId":17,"arabic":"وَلِمُسْلِمٍ : { أَمْسِكُوا عَلَيْكُمْ أَمْوَالَكُمْ وَلَا تُفْسِدُوهَا , فَإِنَّهُ مَنْ أَعْمَرَ عُمْرَى فَهِيَ لِلَّذِي أُعْمِرَهَا حَياً وَمَيِّتًا، وَلِعَقِبِهِ }   1‏ .‏‏1 ‏- صحيح .‏ رواه مسلم ( 1625 )‏ ( 26 )‏.‏","english":{"narrator":"Muslim has:","text":"\"Keep your properties for yourselves and do not squander them, for if anyone gives a life-tenancy it goes to the one to whom it is given, both during his life and after his death, and to his descendants.\""}},{"id":193,"idInBook":193,"chapterId":7,"bookId":17,"arabic":"وَفِي لَفْظٍ : { إِنَّمَا اَلْعُمْرَى اَلَّتِي أَجَازَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-أَنْ يَقُولَ: هِيَ لَكَ وَلِعَقِبِكَ، فَأَمَّا إِذَا قَالَ: هِيَ لَكَ مَا عِشْتَ، فَإِنَّهَا تَرْجِعُ إِلَى صَاحِبِهَا }   1‏ .‏‏1 ‏- صحيح .‏ رواه مسلم ( 1625 )‏ ( 23 )‏ وزاد : \" قال معمر : وكان الزهري يفتي به \".‏","english":{"narrator":"A narration has:","text":"\"The life-tenancy which Allah's Messenger (ﷺ) allowed was only that in which one says, 'It is for you and your descendants.' However, if he says, 'It is yours as long as you live', it returns to its owner.\""}},{"id":194,"idInBook":194,"chapterId":7,"bookId":17,"arabic":"وَلِأَبِي دَاوُدَ وَالنَّسَائِيِّ : { لَا تُرْقِبُوا , وَلَا تُعْمِرُوا، فَمَنْ أُرْقِبَ شَيْئًا أَوْ أُعْمِرَ شَيْئًا فَهُوَ لِوَرَثَتِهِ }   1‏ .‏‏1 ‏- صحيح .‏ رواه أبو داود ( 3556 )‏ ، والنسائي ( 6 / 273 )‏.‏","english":{"narrator":"Abu Dawud and an-Nasa'i have:","text":"\"Do not give property \"to go to the survivor\" and do not give \"life-tenancy\", for if anyone is given either, the property goes to his heirs.\""}},{"id":195,"idInBook":195,"chapterId":7,"bookId":17,"arabic":"وَعَنْ عُمَرَ ‏- رضى الله عنه ‏- قَالَ : { حَمَلْتُ عَلَى فَرَسٍ فِي سَبِيلِ اَللَّهِ , فَأَضَاعَهُ صَاحِبُهُ , فَظَنَنْتُ أَنَّهُ بَائِعُهُ بِرُخْصٍ، فَسَأَلْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-عَنْ ذَلِكَ .‏ فَقَالَ : \" لَا تَبْتَعْهُ , وَإِنْ أَعْطَاكَهُ بِدِرْهَمٍ … }  اَلْحَدِيثَ.‏ مُتَّفَقٌ عَلَيْه ِ  1‏ .‏‏1 ‏- صحيح .‏ رواه البخاري ( 2622 )‏ ، ومسلم (1620)‏ وزادا : \"فإن العائد في صدقته ، كالكلب يعود في قيئه \".‏","english":{"narrator":"Narrated 'Umar (RA):","text":"I provided a man with a horse to ride in Allah's Cause, but as he did not look after it well, I thought he would sell it at a cheap price. I therefore asked Allah's Messenger (ﷺ) about that and he said, \"Do not buy it even if he gives it to you for a Dirham...\" The narrator reported the rest of the Hadith.\n\n."}},{"id":196,"idInBook":196,"chapterId":7,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- عَنِ النَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ : { تَهَادُوْا تَحَابُّوا }  رَوَاهُ اَلْبُخَارِيُّ فِي \n\" اَلْأَدَبِ اَلْمُفْرَدِ \" وَأَبُو يَعْلَى بِإِسْنَادٍ حَسَن ٍ  1‏ .‏‏1 ‏- حسن .‏ رواه البخاري في \" الأدب المفرد \" ( 594 )‏ وأبو يعلى في \" المسند \" ( 6148 )‏.‏","english":{"narrator":"Narrated Abu Hurairah (RA):","text":"The Prophet (ﷺ) said: \"Give gifts to one another and you will love one another.\"\n\n."}},{"id":197,"idInBook":197,"chapterId":7,"bookId":17,"arabic":"وَعَنْ أَنَسٍ ‏- رضى الله عنه ‏- قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ تَهَادَوْا , فَإِنَّ اَلْهَدِيَّةَ تَسُلُّ اَلسَّخِيمَةَ }  رَوَاهُ اَلْبَزَّارُ بِإِسْنَادٍ ضَعِيف ٍ  1‏ .‏‏1 ‏- رواه البزار (1937 )‏ ، وهو وإن كان ضعيف المسند فهو أحد شواهد الحديث السابق.‏","english":{"narrator":"Narrated Anas (RA):","text":"Allah's Messenger (ﷺ) said: \"Give gifts to one another, for (giving) gifts gently extracts resentment and ill-will.\"\n\n."}},{"id":198,"idInBook":198,"chapterId":7,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ يَا نِسَاءَ اَلْمُسْلِمَاتِ ! لَا تَحْقِرَنَّ جَارَةٌ لِجَارَتِهَا وَلَوْ فِرْسِنَ شَاةٍ }  مُتَّفَقٌ عَلَيْه ِ  1‏ .‏‏1 ‏- صحيح رواه البخاري (2566 )‏ ، ومسلم ( 1030 )‏ .‏ و \"فرسن\" : قال الحافظ في \"الفتح\" : \"بكسر الفاء والمهملة بينهما راء ساكنة وآخره نون ، وهو: عظيم قليل اللحم ، وهو للبعير موضع الحافر للفرس، ويطلق على الشاة مجازا ، ونونه زائدة وقيل: أصلية ، وأشير بذلك إلى المبالغة في إهداء الشيء اليسير وقبوله لا إلى حقيقة الفرسن؛ لأنه لم تجر العادة بإهدائه، أي : لا تمنع جارة من الهدية لجارتها الموجود عندها لاستقلاله ، بل ينبغي أن تجود لها بما تيسر، وإن كان قليلا فهو خير من العدم، وذكر الفرسن على سبيل المبالغة.‏","english":{"narrator":"Narrated Abu Hurairah (RA):","text":"Allah's Messenger (ﷺ) said: \"O Muslim women, a woman neighbor should not consider even a goat's hoof too insignificant a gift to give to her neighbor.\"\n\n."}},{"id":199,"idInBook":199,"chapterId":7,"bookId":17,"arabic":"وَعَنْ اِبْنِ عُمَرَ ‏-رَضِيَ اَللَّهُ عَنْهُمَا‏- , عَنْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ : { مَنْ وَهَبَ هِبَةً , فَهُوَ أَحَقُّ بِهَا , مَا لَمْ يُثَبْ عَلَيْهَا }  رَوَاهُ اَلْحَاكِمُ وَصَحَّحَهُ , وَالْمَحْفُوظُ مِنْ رِوَايَةِ اِبْنِ عُمَرَ, عَنْ عُمَرَ قَوْلُه ُ  1‏‏1 ‏- لا يصح رفعه .‏ رواه الحاكم ( 2 / 52 )‏ ، مرفوعا وقال: \"هذا الحديث صحيح على شرط الشيخين، ولم يخرجاه ، إلا أن يكون الحمل فيه على شيخنا\" .‏ قلت: وشيخه هو : إسحاق بن محمد بن خالد الهاشمي ، قال الحافظ في \" اللسان \" (1 /417)‏ : \" الحمل فيه عليه بلا ريب ، وهذا الكلام معروف من قول عمر غير مرفوع \" .‏ وأما الموقوف ، فرواه مالك في \" الموطأ \" ( 2 / 754 / 42 )‏ بسند صحيح ، ولفظه : \" من وهب هبة لصلة رحم ، أو على وجه صدقة ، فإنه لا يرجع فيها.‏ ومن وهب هبة يرى أنه إنما أراد بها الثواب ، فهو على هبته ، يرجع فيها إذا لم يرض منها \".‏","english":{"narrator":"Narrated Ibn 'Umar (RA):","text":"The Prophet (ﷺ) said: \"If anyone gives away a gift, he has most right to it as long as he is given nothing in return for it.\"\n\n."}},{"id":200,"idInBook":200,"chapterId":7,"bookId":17,"arabic":"عَنْ أَنَسٍ ‏- رضى الله عنه ‏- قَالَ : { مَرَّ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-بِتَمْرَةٍ فِي اَلطَّرِيقِ، فَقَالَ : \n\" لَوْلَا أَنِّي أَخَافُ أَنْ تَكُونَ مِنَ الصَّدَقَةِ لَأَكَلْتُهَا\" }  مُتَّفَقٌ عَلَيْه ِ  1‏ .‏‏1 ‏- صحيح .‏ رواه البخاري ( 2431 )‏ ، ومسلم ( 1071 )‏ والسياق للبخاري.‏","english":{"narrator":"Narrated Anas (RA):","text":"The Prophet (ﷺ) came upon a date on the road and said, \"Were it not that I fear it may be part of the Sadaqah I would eat it.\"\n\n."}},{"id":201,"idInBook":201,"chapterId":7,"bookId":17,"arabic":"وَعَنْ زَيْدِ بْنِ خَالِدٍ اَلْجُهَنِيِّ ‏- رضى الله عنه ‏- قَالَ : { جَاءَ رَجُلٌ إِلَى اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-فَسَأَلَهُ عَنِ اللُّقَطَةِ ? فَقَالَ : \" اِعْرِفْ عِفَاصَهَا وَوِكَاءَهَا , ثُمَّ عَرِّفْهَا سَنَةً , فَإِنْ جَاءَ صَاحِبُهَا وَإِلَّا فَشَأْنُكَ بِهَا\" .‏ \nفِيهِ اَلَّذِي قَبْلَهُ وَمَا أَشْبَهَهُ \nقَالَ : \"هِيَ لَكَ , أَوْ لِأَخِيكَ , أَوْ لِلذِّئْبِ \" .‏ \nقَالَ : فَضَالَّةُ اَلْإِبِلِ ? \nقَالَ : \" مَا لَكَ وَلَهَا ? مَعَهَا سِقَاؤُهَا وَحِذَاؤُهَا , تَرِدُ اَلْمَاءَ , وَتَأْكُلُ اَلشَّجَرَ , حَتَّى يَلْقَاهَا رَبُّهَا }  مُتَّفَقٌ عَلَيْه ِ  1‏ .‏‏1 ‏- صحيح .‏ رواه البخاري ( 91 )‏ ، ومسلم ( 1722 )‏ .‏ و \" عفاصها \" بكسر المهملة ، وتخفيف الفاء ، الوعاء تكون فيه النفقة .‏ و \" وكاءها \" : الخيط يشد به العفاص .‏ و \" سقاؤها \" : جوفها .‏ و \" حذاؤها \" : خفها .‏ وفي هذا تنبيه من النبي ‏-صلى الله عليه وسلم‏- إلى أن الإبل غير محتاجة إلى الحفظ بما ركب الله في طباعها من الجلادة على العطش وتناول الماء بغير تعب لطول عنقها ، وقوتها على المشي.‏","english":{"narrator":"Narrated Zaid bin Khalid al-Juhani (RA):","text":"A man came to the Prophet (ﷺ) and asked him about an item found (in the street). He replied, \"Note what it is contained in, and what it is tied with, and make the matter known for a year. Then, if its owner comes (give it to him). Otherwise, you can do what you like with it.\" He asked, \"What about astray sheep?\" He replied, \"It is for your, your brother, or the wolf.\" He asked, \"What about astray camels?\" He replied, \"What have you to do with them? They have their stomachs and their feet. They can go down to water and eat trees till their master finds them.\"\n\n."}},{"id":202,"idInBook":202,"chapterId":7,"bookId":17,"arabic":"وَعَنْهُ قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ آوَى ضَالَّةً فَهُوَ ضَالٌّ , مَا لَمْ يُعَرِّفْهَا }  رَوَاهُ مُسْلِم ٌ  1‏ .‏‏1 ‏- صحيح .‏ رواه مسلم ( 1725 )‏.‏","english":{"narrator":"Narrated :","text":"Allah's Messenger (ﷺ) said: \"He who shelters a stray (animal) is astray himself if he does not make it known.\" ."}},{"id":203,"idInBook":203,"chapterId":7,"bookId":17,"arabic":"وَعَنْ عِيَاضِ بْنِ حِمَارٍ ‏- رضى الله عنه ‏- قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ وَجَدَ لُقَطَةً فَلْيُشْهِدْ ذَوَيْ عَدْلٍ , وَلْيَحْفَظْ عِفَاصَهَا وَوِكَاءَهَا , ثُمَّ لَا يَكْتُمْ , وَلَا يُغَيِّبْ , فَإِنْ جَاءَ رَبُّهَا فَهُوَ أَحَقُّ بِهَا , وَإِلَّا فَهُوَ مَالُ اَللَّهِ يُؤْتِيهِ مَنْ يَشَاءُ }  رَوَاهُ أَحْمَدُ, وَالْأَرْبَعَةُ إِلَّا اَلتِّرْمِذِيَّ , وَصَحَّحَهُ اِبْنُ خُزَيْمَةَ , وَابْنُ اَلْجَارُودِ , وَابْنُ حِبَّان َ  1‏ .‏‏1 ‏- صحيح .‏ رواه أحمد ( 4 / 261 ‏- 262 و 266 ‏- 267 )‏ ، وأبو داود ( 1709 )‏ ، والنسائي في \" الكبرى \" ( 3 / 418 )‏ ، وابن ماجه ( 2505 )‏ ، وابن حبان ( 1169 موارد )‏ ، وابن الجارود ( 671 )‏.‏","english":{"narrator":"Narrated Iyad bin Himar (RA):","text":"Allah's Messenger (ﷺ) said: \"He who finds something should call two trusty people as witnesses, keep in mind what it is contained in, and what it is tied with, and not conceal it or cover it up. Then, if its owner comes, he has the most right to it. Otherwise, it is Allah's property which He gives to whomever He wills.\"\n\n."}},{"id":204,"idInBook":204,"chapterId":7,"bookId":17,"arabic":"وَعَنْ عَبْدِ اَلرَّحْمَنِ بْنِ عُثْمَانَ التَّيْمِيِّ ‏- رضى الله عنه ‏- { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-نَهَى عَنْ لُقَطَةِ اَلْحَاجِّ }  رَوَاهُ مُسْلِم ٌ  1‏ .‏‏1 ‏- صحيح .‏ رواه مسلم (1724)‏.‏","english":{"narrator":"Narrated 'Abdur-Rahman bin 'Uthman at-Taimi (RA):","text":"The Prophet (ﷺ) prohibited taking what a pilgrim has dropped (lost).\n\n."}},{"id":205,"idInBook":205,"chapterId":7,"bookId":17,"arabic":"وَعَنْ اَلْمِقْدَامِ بْنِ مَعْدِي كَرِبَ ‏- رضى الله عنه ‏- قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ أَلَا لَا يَحِلُّ ذُو نَابٍ مِنَ السِّبَاعِ , وَلَا اَلْحِمَارُ اَلْأَهْلِيُّ , وَلَا اَللُّقَطَةُ مِنْ 57 مَالِ مُعَاهَدٍ , إِلَّا أَنْ يَسْتَغْنِيَ عَنْهَا }  رَوَاهُ أَبُو دَاوُدَ  1‏ .‏‏1 ‏- رواه أبو داود ( 3804 )‏.‏","english":{"narrator":"Narrated al-Miqdam bin Ma'dikarib (RA):","text":"Allah's Messenger (ﷺ) said: \"A beast of prey with a fang, a domestic donkey, and a lost item from the property of a Mu'ahid (a disbeliever who has been given a covenant) - unless it is something worthless - are not lawful.\"\n\n."}},{"id":206,"idInBook":206,"chapterId":7,"bookId":17,"arabic":"عَنِ ابْنِ عَبَّاسٍ ‏- رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ أَلْحِقُوا اَلْفَرَائِضَ بِأَهْلِهَا , فَمَا بَقِيَ فَهُوَ لِأَوْلَى رَجُلٍ ذَكَرٍ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح .‏ رواه البخاري ( 6732 )‏ ، ومسلم ( 1615 )‏.‏","english":{"narrator":"Narrated Ibn 'Abbas (RA):","text":"Allah's Messenger (ﷺ), \"Give the prescribed shares to those who are entitled to them, and what remains goes to the nearest male relative (of the deceased).\"\n\n."}},{"id":207,"idInBook":207,"chapterId":7,"bookId":17,"arabic":"وَعَنْ أُسَامَةَ بْنِ زَيْدٍ ‏- رَضِيَ اَللَّهُ عَنْهُمَا‏- أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَالَ : { لَا يَرِثُ اَلْمُسْلِمُ اَلْكَافِرَ, وَلَا يَرِثُ اَلْكَافِرُ اَلْمُسْلِمَ }  مُتَّفَقٌ عَلَيْهِ  1‏‏1 ‏- صحيح .‏ رواه البخاري (6764 )‏ ، ومسلم (1614)‏ .‏ رواه البخاري (4283)‏ بلفظ \"المؤمن\" بدل \" المسلم\" في الموضعين.‏","english":{"narrator":"Narrated Usamah bin Zaid (RA):","text":"The Prophet (ﷺ) said: \"A Muslim does not inherit from an infidel and an infidel does not inherit from a Muslim.\"\n\n."}},{"id":208,"idInBook":208,"chapterId":7,"bookId":17,"arabic":"وَعَنْ اِبْنِ مَسْعُودٍ ‏- رضى الله عنه ‏- فِي بِنْتٍ , وَبِنْتِ اِبْنٍ , وَأُخْتٍ ‏- { قَضَى اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-\" لِلِابْنَةِ اَلنِّصْفَ , وَلِابْنَةِ اَلِابْنِ اَلسُّدُسَ ‏- تَكْمِلَةَ اَلثُّلُثَيْنِ‏- وَمَا بَقِيَ فَلِلْأُخْتِ }  رَوَاهُ اَلْبُخَارِيُّ  1‏‏1 ‏- صحيح .‏ رواه البخاري (6736)‏ من طريق هزيل بن شرحبيل قال : سئل أبو موسى ؛ عن ابنة .‏ وابن ابن .‏ وأخت ؟ فقال : للابنة النصف .‏ وللأخت النصف .‏ وائت ابن مسعود فسيتابعني، فسئل ابن مسعود، وأخبر بقول أبي موسى ؟ فقال : لقد ضللت إذا وما أنا من المهتدين، أقضي فيها بما قضى النبي ‏-صلى الله عليه وسلم‏- : … فذكره .‏ وزاد : فأتينا أبا موسى ، فأخبرناه بقول ابن مسعود .‏ فقال : \"لا تسألوني ما دام هذا الحبر فيكم\".‏","english":{"narrator":"Narrated Ibn Mas'ud (RA) concerning the situation where there was a daughter, a son's daughter and a sister:","text":"The Prophet (ﷺ) ruled, \"The daughter gets half and the son's daughter gets a sixth, completing two-thirds, and what remains goes to the sister.\"\n\n."}},{"id":209,"idInBook":209,"chapterId":7,"bookId":17,"arabic":"وَعَنْ عَبْدِ اَللَّهِ بْنِ عَمْرٍو ‏- رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا يَتَوَارَثُ أَهْلُ مِلَّتَيْنِ }  رَوَاهُ أَحْمَدُ , وَالْأَرْبَعَةُ إِلَّا اَلتِّرْمِذِيَّ .‏  1‏ .‏‏1 ‏- حسن .‏ رواه أحمد ( 2 / 178 و 195 )‏ ، وأبو داود ( 2911 )‏ ، والنسائي في \" الكبرى \" ( 4 / 82 )‏ ، وابن ماجه ( 2731 )‏ وزادوا جميعا إلا ابن ماجه : \" شتى \" .‏ وزاد ابن الجارود في روايته ( 967 )‏ : \" والمرأة ترث من دية زوجها وماله ، وهو يرث من ديتها ومالها ما لم يقتل أحدهما صاحبه، فإن قتل أحدهما صاحبه لم يرث من ديته وماله شيئا، وإن قتل أحدهما صاحبه خطأ، ورث من ماله، ولم يرث من ديته\" .‏ وسندها حسن أيضا.‏","english":{"narrator":"Narrated 'Abdullah bin 'Amr (RA):","text":"Allah's Messenger (ﷺ) said: \"People of two different religions do not inherit from one another.\"\n\n."}},{"id":210,"idInBook":210,"chapterId":7,"bookId":17,"arabic":"وَأَخْرَجَهُ اَلْحَاكِمُ بِلَفْظِ أُسَامَةَ  1‏ .‏‏1 ‏- رواه الحاكم (2 / 240)‏ ولفظه : \" لا يتوارث أهل ملتين ، ولا يرث مسلم كافرا ، ولا كافر مسلما .‏ ثم قرأ : والذين كفروا بعضهم أولياء بعض إلا تفعلوه تكن فتنة في الأرض وفساد كبير قلت : ووقع في \"المستدرك\" تحريف في السند، فإذا كان كما وقع في \" التلخيص\" للذهبي\" : \"سفيان بن حسين ، عن الزهري \" فهو ضعيف ؛ لضعف سفيان في الزهري كما هو معروف عند أئمة الجرح والتعديل.‏ وقال ابن عدي : \"يروي عن الزهري أشياء خالف فيها الناس من باب المتون والأسانيد\".‏","english":{"narrator":"","text":"al-Hakim reported it with Usamah's wording."}},{"id":211,"idInBook":211,"chapterId":7,"bookId":17,"arabic":"وَرَوَى النَّسَائِيُّ حَدِيثَ أُسَامَةَ بِهَذَا اَللَّفْظِ  1‏ .‏‏1 ‏- شاذ ؛ لمخالفة هشيم بن بشير أصحاب الزهري .‏ قال الذهبي في \" الميزان \" ( 4 / 306 )‏ : \" كان مدلسا ، وهو لين في الزهري\" .‏ ورواه النسائي في \"الكبرى\" ( 4 / 82 )‏.‏","english":{"narrator":"","text":"an-Nasa'i reported Usamah's Hadith with the aforesaid wording."}},{"id":212,"idInBook":212,"chapterId":7,"bookId":17,"arabic":"وَعَنْ عِمْرَانَ بْنِ حُصَينٍ قَالَ : جَاءَ رَجُلٌ إِلَى اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-فَقَالَ : { إِنَّ اِبْنَ اِبْنِي مَاتَ , فَمَا لِي مِنْ مِيرَاثِهِ ? فَقَالَ : \" لَكَ اَلسُّدُسُ \" فَلَمَّا وَلَّى دَعَاهُ، فَقَالَ: \"لَكَ سُدُسٌ آخَرُ\" فَلَمَّا وَلَّى دَعَاهُ.‏ فَقَالَ : \" إِنَّ اَلسُّدُسَ اَلْآخَرَ طُعْمَةٌ }  رَوَاهُ أَحْمَدُ وَالْأَرْبَعَةُ , وَصَحَّحَهُ اَلتِّرْمِذِيُّ  1‏‏1 ‏- ضعيف .‏ رواه أحمد ( 4 / 428 ‏- 429 )‏ ، وأبو داود ( 2896 )‏ ، والنسائي في \" الكبرى \" ( 4 / 73 )‏ ، والترمذي ( 2099 )‏ من طريق قتادة ، عن الحسن ، عن عمران ، به .‏ وقال الترمذي : \" حديث حسن صحيح \" .‏ قلت : كيف وقتادة والحسن مدلسان ؟ ! وانظر التعليق التالي .‏ \" تنبيه \" : عزو الحافظ الحديث للأربعة وهم إذ لم يروه ابن ماجه.‏","english":{"narrator":"Narrated 'Imran bin Husain (RA):","text":"A man came to the Prophet (ﷺ) and said, \"My son's son (grandson) has died, so what do I receive from his estate (inheritance)?\" He replied, \"You receive a sixth;\" then when he turned away he called him and said, \"You receive another sixth;\" and when he turned away he called him and said, \"The other sixth is an allowance (beyond what is due).\"\n\n."}},{"id":213,"idInBook":213,"chapterId":7,"bookId":17,"arabic":"وَهُوَ مِنْ رِوَايَةِ اَلْحَسَنِ اَلْبَصْرِيِّ عَنْ عِمْرَانَ , وَقِيلَ : إِنَّهُ لَمْ يَسْمَعْ مِنْهُ  1‏ .‏‏1 ‏- ممن جزم بعدم سماعه أبو حاتم، فقال في \" الجرح والتعديل \" ( 1 / 41 )‏ : \" لم يصح له السماع من جندب ، ولا من معقل بن يسار ، ولا عن عمران بن حصين ، ولا من عقبة بن عامر ، ولا من أبي هريرة \".‏","english":{"narrator":"","text":"It is from al-Hasan al-Basri's narration on the authority of 'Imran. However, it has been said that al-Hasan did not hear (Hadith) from 'Imran]."}},{"id":214,"idInBook":214,"chapterId":7,"bookId":17,"arabic":"وَعَنِ ابْنِ بُرَيْدَةَ , عَنْ أَبِيهِ ; { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-جَعَلَ لِلْجَدَّةِ اَلسُّدُسَ , إِذَا لَمْ يَكُنْ دُونَهَا أُمٌّ }  رَوَاهُ أَبُو دَاوُدَ , وَالنَّسَائِيُّ , وَصَحَّحَهُ اِبْنُ خُزَيْمَةَ , وَابْنُ اَلْجَارُودِ , وَقَوَّاهُ اِبْنُ عَدِيٍّ  1‏ .‏‏1 ‏- حسن .‏ رواه أبو داود ( 2895 )‏ ، والنسائي في \" الكبرى \" (4 /73)‏ ، وابن الجارود ( 960 )‏ ، وابن عدي في ط\" الكامل \" (4637)‏ .‏ وفي سنده أبو المنيب ؛ عبيد الله العتكي مختلف فيه .‏ وقال ابن عدي : \" ولأبي المنيب هذا أحاديث غير ما ذكرت ، وهو عندي لا بأس به \".‏","english":{"narrator":"Narrated Ibn Buraidah (RA) on the authority of his father:","text":"The Prophet (ﷺ) appointed a sixth to a grandmother if no mother is left to inherit before her.\n\n."}},{"id":215,"idInBook":215,"chapterId":7,"bookId":17,"arabic":"وَعَنْ اَلْمِقْدَامِ بْنِ مَعْدِي كَرِبَ ‏- رضى الله عنه ‏- قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ اَلْخَالُ وَارِثُ مَنْ لَا وَارِثَ لَهُ }  أَخْرَجَهُ أَحْمَدُ , وَالْأَرْبَعَةُ سِوَى اَلتِّرْمِذِيِّ , وَحَسَّنَهُ أَبُو زُرْعَةَ اَلرَّازِيُّ , وَصَحَّحَهُ اِبْنُ حِبَّانَ , وَالْحَاكِمُ  1‏ .‏‏1 ‏- صحيح .‏ رواه أحمد ( 4 / 131 و 133 )‏ ، وأبو داود ( 2899 و 2900 )‏ ، والنسائي في \" الكبرى \" ( 4 / 76 ‏- 77 )‏ ، وابن ماجه ( 2738 )‏ ، وابن حبان ( 1225 و 1226 )‏ ، والحاكم ( 4 / 344 )‏ ولفظه : \" من ترك مالا فلأهله ، ومن ترك كلا فإلى الله ورسوله .‏ وربما قال : فإلينا.‏ وأنا وارث من لا وارث له ، أعقل له وأرثه ، والخال وارث من لا وارث له ، يعقل عنه ويرثه \".‏","english":{"narrator":"Narrated al-Miqdam bin Ma'dikarib (RA):","text":"Allah's Messenger (ﷺ) said: \"A maternal uncle is heir of him who has no inheritor.\"\n\n[Ahmad and al-Arba'a reported it excluding at-Tirmidhi. Abu Zur'a ar-Razi graded it Hasan (good), and al-Hakim and Ibn Hibban graded it Sahih (authentic)."}},{"id":216,"idInBook":216,"chapterId":7,"bookId":17,"arabic":"وَعَنْ أَبِي أُمَامَةَ بْنِ سَهْلٍ قَالَ : { كَتَبَ مَعِي عُمَرُ إِلَى أَبِي عُبَيْدَةَ ‏- رَضِيَ اَللَّهُ عَنْهُمْ‏- ; أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ : \" اَللَّهُ وَرَسُولُهُ مَوْلَى مَنْ لَا مَوْلَى لَهُ , وَالْخَالُ وَارِثُ مَنْ لَا وَارِثَ لَهُ }  رَوَاهُ أَحْمَدُ , وَالْأَرْبَعَةُ سِوَى أَبِي دَاوُدَ , وَحَسَّنَهُ اَلتِّرْمِذِيُّ , وَصَحَّحَهُ اِبْنُ حِبَّانَ  1‏ .‏‏1 ‏- صحيح .‏ رواه أحمد ( 1 / 28 و 46 )‏ ، والنسائي في \" الكبرى \" ( 4 / 76 )‏ ، والترمذي ( 2103 )‏ ، وابن ماجه ( 2737 )‏ ، وابن حبان ( 1227 )‏ .‏ وقال الترمذي : \" حسن صحيح \" .‏ قلت : حسن باعتبار سنده عندهم ، صحيح بشاهده السابق ، وله شاهد آخر عن عائشة رضي الله عنها.‏","english":{"narrator":"Narrated Abu Umamah bin Sahl (RA):","text":"'Umar (RA) wrote to Abu Ubaidah (RA) that Allah's Messenger (ﷺ) had said: \"Allah and His Messenger are the Patrons of him who has none and a maternal uncle is the heir of him who has no inheritor.\"\n\n."}},{"id":217,"idInBook":217,"chapterId":7,"bookId":17,"arabic":"وَعَنْ جَابِرٍ ‏- رضى الله عنه ‏- عَنْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ : { إِذَا اِسْتَهَلَّ اَلْمَوْلُودُ وُرِّثَ }  رَوَاهُ أَبُو دَاوُدَ , وَصَحَّحَهُ اِبْنُ حِبَّانَ  1‏ .‏‏1 ‏- صحيح بطرقه وشواهده .‏ رواه الترمذي ( 1032 )‏ ، وابن ماجه ( 2750 )‏ و ( 2751 )‏ ، وابن حبان ( 1223 )‏ ولفظه : \" إذا استهل الصبي ، صلي عليه ، وورث \" .‏ وفي لفظ آخر : \"لا يرث الصبي حتى يستهل صارخا\" .‏ قلت: وللحديث طريق وشواهد ‏- يصح بها ‏- مذكورة \" بالأصل \" لكن يجدر هنا التنبيه على أن : اللفظ الذي ذكره الحافظ ليس لفظ حديث جابر ، وإنما هو لفظ حديث أبي هريرة .‏ هذا أولا .‏ وثانيا : حديث جابر لم يروه أبو داود ، وإنما روى حديث أبي هريرة.‏","english":{"narrator":"Narrated Jabir (RA):","text":"The Prophet (ﷺ) said: \"When a new born cries (at the time of birth) (and then dies), it is treated as a hair.\"\n\n."}},{"id":218,"idInBook":218,"chapterId":7,"bookId":17,"arabic":"وَعَنْ عَمْرِو بْنِ شُعَيْبٍ , عَنْ أَبِيهِ , عَنْ جَدِّهِ قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَيْسَ لِلْقَاتِلِ مِنَ الْمِيرَاثِ شَيْءٌ }  رَوَاهُ النَّسَائِيُّ , وَاَلدَّارَقُطْنِيُّ , وَقَوَّاهُ اِبْنُ عَبْدِ اَلْبَرِّ , وَأَعَلَّهُ النَّسَائِيُّ , وَالصَّوَابُ: وَقْفُهُ عَلَى عُمَرَ  1‏ .‏‏1 ‏- صححه شيخنا ‏- حفظه الله ‏- في \" الإرواء \" رقم ( 1671 )‏.‏","english":{"narrator":"Narrated 'Amr bin Shu'aib on his father's authority from his grandfather (RA):","text":"Allah's Messenger (ﷺ) said: \"One who kills a man cannot inherit anything from him.\"\n\n."}},{"id":219,"idInBook":219,"chapterId":7,"bookId":17,"arabic":"وَعَنْ عُمَرَ بْنِ اَلْخَطَّابِ ‏- رضى الله عنه ‏- قَالَ : سَمِعْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ : { مَا أَحْرَزَ اَلْوَالِدُ أَوْ اَلْوَلَدُ فَهُوَ لِعَصَبَتِهِ مَنْ كَانَ }  رَوَاهُ أَبُو دَاوُدَ , وَالنَّسَائِيُّ , وَابْنُ مَاجَهْ , وَصَحَّحَهُ اِبْنُ اَلْمَدِينِيِّ , وَابْنُ عَبْدِ اَلْبَرِّ  1‏ .‏‏1 ‏- حسن .‏ رواه أبو داود ( 2917 )‏ ، والنسائي في \" الكبرى \" ( 4 / 75 )‏ ، وابن ماجه ( 2732 )‏ من طريق عمرو بن شعيب ، عن أبيه ، عن جده ، قال : تزوج رئاب بن حذيفة بن سعيد بن سهم ، أم وائل ؛ بنت معمر الجمحية ، فولدت له ثلاثة .‏ فتوفيت أمهم ، فورثها بنوها ، رباعا وولاء مواليها .‏ فخرج بهم عمرو بن العاص إلى الشام .‏ فماتوا في طاعون عمواس ، فورثهم عمرو ، وكان عصبتهم .‏ فلما رجع عمرو بن العاص ، جاء بنو معمر يخاصمونه في ولاء أختهم ، إلى عمر .‏ فقال عمر : أقضي بينكم بما سمعت من رسول الله ‏-صلى الله عليه وسلم‏- .‏ سمعته يقول : … فذكره .‏ وزاد : قال : فقضى لنا به ، وكتب لنا به كتابا ، فيه شهادة عبد الرحمن بن عوف ، وزيد بن ثابت ، وآخر .‏ حتى إذا استخلف عبد الملك بن مروان ، توفي مولى لها .‏ وترك ألفي دينار.‏ فبلغني أن ذلك القضاء قد غير .‏ فخاصموا إلى هشام بن إسماعيل ، فرفعنا إلى عبد الملك ، فأتيناه بكتاب عمر .‏ فقال : إن كنت لأرى أن هذا من القضاء الذي لا يشك فيه ، وما كنت أرى أن أمر أهل المدينة بلغ هذا ؛ أن يشكوا في هذا القضاء .‏ فقضى لنا فيه .‏ فلم نزل فيه بعد .‏ واقتصر النسائي على المرفوع فقط .‏ وقال ابن القيم في \" تهذيب السنن \" ( 4 / 184 )‏ : قال ابن عبد البر : \" هذا حديث حسن صحيح غريب \".‏","english":{"narrator":"Narrated 'Umar bin al-Khattab (RA):","text":"I heard Allah's Messenger (ﷺ) as saying, \"The property which a parent or a child has a right to, goes to his 'Asabah (paternal relatives) whoever it may be.\n\n."}},{"id":220,"idInBook":220,"chapterId":7,"bookId":17,"arabic":"وَعَنْ عَبْدِ اَللَّهِ بْنِ عُمَرَ ‏- رَضِيَ اَللَّهُ عَنْهُمَا‏- قَالَ : قَالَ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-{ اَلْوَلَاءُ لُحْمَةٌ كَلُحْمَةِ اَلنَّسَبِ , لَا يُبَاعُ , وَلَا يُوهَبُ }  رَوَاهُ اَلْحَاكِمُ : مِنْ طَرِيقِ اَلشَّافِعِيِّ , عَنْ مُحَمَّدِ بْنِ اَلْحَسَنِ , عَنْ أَبِي يُوسُفَ ، وَصَحَّحَهُ اِبْنُ حِبَّانَ , وَأَعَلَّهُ اَلْبَيْهَقِيُّ  1‏ .‏‏1 ‏- ضعيف .‏ رواه الشافعي ( 1232 )‏ ، وابن حبان ( 4929 )‏ ، والحاكم ( 4 / 231 )‏ ، والبيهقي ( 10 / 292 )‏ ، وقد وقع في إسناده اضطراب واختلاف ، فضلا عن مخالفة المتن الصحيح المتقدم برقم ( 1429 )‏.‏","english":{"narrator":"Narrated 'Abdullah bin 'Umar (RA):","text":"Allah's Messenger (ﷺ) said: \"The right to inheritance from a freed slave is a relationship like the relationship  of blood relatives (lineage); it cannot be sold or given away.\"\n\n."}},{"id":221,"idInBook":221,"chapterId":7,"bookId":17,"arabic":"وَعَنْ أَبِي قِلَابَةَ , عَنْ أَنَسٍ قَالَ : قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ أَفْرَضُكُمْ زَيْدُ بْنُ ثَابِتٍ }  أَخْرَجَهُ أَحْمَدُ , وَالْأَرْبَعَةُ سِوَى أَبِي دَاوُدَ , وَصَحَّحَهُ اَلتِّرْمِذِيُّ , وَابْنُ حِبَّانَ , وَالْحَاكِمُ , وَأُعِلَّ بِالْإِرْسَالِ  1‏ .‏‏1 ‏- ضعيف .‏ وتفصيل ذلك \" بالأصل \".‏","english":{"narrator":"Narrated Abu Qilabah on the authority of Anas (RA):","text":"Allah's Messenger (ﷺ) said: \"The most versed in the rules of inheritance among you is Zaid bin Thabit.\"\n\n."}},{"id":222,"idInBook":222,"chapterId":7,"bookId":17,"arabic":"عَنْ اِبْنِ عُمَرَ ‏- رَضِيَ اَللَّهُ عَنْهُمَا‏- ; أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ : { مَا حَقُّ اِمْرِئٍ مُسْلِمٍ لَهُ شَيْءٌ يُرِيدُ أَنْ يُوصِيَ فِيهِ يَبِيتُ لَيْلَتَيْنِ إِلَّا وَوَصِيَّتُهُ مَكْتُوبَةٌ عِنْدَهُ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح .‏ رواه البخاري ( 2738 )‏ ، ومسلم ( 1627 )‏.‏","english":{"narrator":"Narrated Ibn 'Umar (RA):","text":"Allah's Messenger (ﷺ) said: \"It is not permissible for a Muslim person, who has something he wants to give as a bequest, to have it for two nights without having his will regarding it written and kept ready with him.\"\n\n."}},{"id":223,"idInBook":223,"chapterId":7,"bookId":17,"arabic":"وَعَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ ‏- رضى الله عنه ‏- قَالَ : قُلْتُ : { يَا رَسُولَ اَللَّهِ ! أَنَا ذُو مَالٍ , وَلَا يَرِثُنِي إِلَّا اِبْنَةٌ لِي وَاحِدَةٌ , أَفَأَتَصَدَّقُ بِثُلُثَيْ مَالِي? قَالَ : \" لَا \" قُلْتُ : أَفَأَتَصَدَّقُ بِشَطْرِهِ ? قَالَ : \" لَا \" قُلْتُ : أَفَأَتَصَدَّقُ بِثُلُثِهِ ? قَالَ : \" اَلثُّلُثُ , وَالثُّلُثُ كَثِيرٌ , إِنَّكَ أَنْ تَذَرَ وَرَثَتَكَ أَغْنِيَاءَ خَيْرٌ مِنْ أَنْ تَذَرَهُمْ عَالَةً يَتَكَفَّفُونَ اَلنَّاسَ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح .‏ رواه البخاري ( 1295 )‏ ، ومسلم ( 1628 )‏ ، عن سعد بن أبي وقاص ، قال : عادني رسول الله ‏-صلى الله عليه وسلم‏- في حجة الوداع من وجع أشفيت منه على الموت فقلت: يا رسول الله ! بلغني ما ترى من الوجع ، وأنا ذو مال … الحديث .‏ وزادا : \" ولست تنفق نفقة تبتغي بها وجه الله إلا أجرت بها .‏ حتى اللقمة تجعلها في في امرأتك .‏ قال: قلت : يا رسول الله ! أخلف بعد أصحابي ؟ قال : إنك لن تخلف ، فتعمل عملا تبتغي به وجه الله ، إلا ازددت به درجة ورفعة.‏ ولعلك تخلف حتى ينفع بك أقوام ويضر بك آخرون .‏ اللهم أمض لأصحابي هجرتهم .‏ ولا تردهم على أعقابهم ، لكن البائس سعد بن خولة\".‏","english":{"narrator":"Narrated Sa'd bin Abi Waqqas (RA):","text":"I said, \"O Allah's Messenger, I have wealth and no one to inherit from me except my one daughter. Shall I give two-thirds of my property as Sadaqah?\" He replied, \"No.\" I said, \"Shall I give half of it as Sadaqah?\" He replied, \"No.\" I said, \"Shall I give a third of it as Sadaqah?\" He replied, \"You may give a third as Sadaqah, which is still a lot. To leave your heirs rich is better than to leave them poor and begging from people.\"\n\n."}},{"id":224,"idInBook":224,"chapterId":7,"bookId":17,"arabic":"وَعَنْ عَائِشَةَ ‏-رَضِيَ اَللَّهُ عَنْهَا‏- { أَنَّ رَجُلاً أَتَى اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَالَ: يَا رَسُولَ اَللَّهِ ! إِنَّ أُمِّي اُفْتُلِتَتْ نَفْسُهَا وَلَمْ تُوصِ , وَأَظُنُّهَا لَوْ تَكَلَّمَتْ تَصَدَّقَتْ , أَفَلَهَا أَجْرٌ إِنْ تَصَدَّقْتُ عَنْهَا ? قَالَ : \" نَعَمْ }  مُتَّفَقٌ عَلَيْهِ , وَاللَّفْظُ لِمُسْلِمٍ  1‏ .‏‏1 ‏- صحيح .‏ رواه البخاري ( 1388 )‏ ، ومسلم ( 1004 )‏ .‏ وزاد البخاري في رواية ( 2960 : \" تصدق عنها \".‏","english":{"narrator":"Narrated 'Aishah (RA):","text":"A man came to the Prophet (ﷺ) and said, \"O Allah's Messenger, my mother had died suddenly, and did not make a will. And I think she would have given out Sadaqah if she had been able to speak, so will she get a reward if I gave out Sadaqah on her behalf?\" He replied, \"Yes.\"\n\n."}},{"id":225,"idInBook":225,"chapterId":7,"bookId":17,"arabic":"وَعَنْ أَبِي أُمَامَةَ اَلْبَاهِلِيِّ ‏- رضى الله عنه ‏- سَمِعْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ : { إِنَّ اَللَّهَ قَدْ أَعْطَى كُلَّ ذِي حَقٍّ حَقَّهُ , فَلَا وَصِيَّةَ لِوَارِثٍ }  رَوَاهُ أَحْمَدُ , وَالْأَرْبَعَةُ  1‏ إِلَّا النَّسَائِيَّ , وَحَسَّنَهُ أَحْمَدُ وَاَلتِّرْمِذِيُّ , وَقَوَّاهُ اِبْنُ خُزَيْمَةَ , وَابْنُ اَلْجَارُودِ  2‏ .‏‏1 ‏- صحيح .‏ رواه أحمد (5 67)‏ ، وأبو داود ( 3565 )‏ ، والترمذي ( 2120 )‏ ، وابن ماجه (2713 )‏ ، وابن الجارود ( 949 )‏ ، واقتصر ابن الجارود وابن ماجه على ما ذكره الحافظ ، وزاد الباقون : \"  .‏ لا تنفق امرأة من بيت زوجها إلا بإذن زوجها .‏ قيل : يا رسول الله ! ولا الطعام ؟ .‏ قال : ذلك أفضل أموالنا .‏ ثم قال : العارية مؤداة .‏ والمنحة مردودة .‏ والدين مقضي .‏ والزعيم غارم \" .‏ والزيادة لأحمد والترمذي .‏ قلت : وسنده حسن ؛ إلا أن الجملة التي ذكرها الحافظ صحيحة لشواهدها الكثيرة .‏ وقال الترمذي : \" حديث حسن صحيح \".‏‏2 ‏- منكر .‏ رواه الدارقطني ( 4 /98 و 152 )‏ بسند ضعيف ، بل أعله الحافظ نفسه في \" التلخيص \" ( 3 / 62 / رقم 1370 )‏ .‏ قلت : وسبب النكارة هذه الزيادة : \" إلا أن يشاء الورثة \" فقد ورد الحديث عن جماعة من الصحابة دون هذه الزيادة فلم ترد إلا بهذا الإسناد الضعيف .‏ بل الحديث جاء عن ابن عباس نفسه بسند حسن .‏ رواه الدارقطني ( 4 / 98 )‏ بدون هذه الزيادة ، بل وحسن الحافظ نفسه إسناده من الطريق التي ليست فيها الزيادة فقال في \" التلخيص \" ( 3 / 62 / رقم 1369 )‏ أثناء تخريجه لحديث : \" لا وصية لوارث \" .‏ \" رواه الدارقطني من حديث ابن عباس بسند حسن \" .‏ ومن راجع \" التلخيص\" عرف صواب صنيع الحافظ هناك ، وأيضا عرف وهمه هنا رحمه الله \".‏","english":{"narrator":"Narrated Abu Umamah al-Bahili (RA):","text":"I heard Allah's Messeneger (ﷺ) saying, \"Allah has appointed for everyone who has a right what is due to him, and no Wasiyah (will) should be made to an heir.\"\n\n."}},{"id":226,"idInBook":226,"chapterId":7,"bookId":17,"arabic":"وَرَوَاهُ اَلدَّارَقُطْنِيُّ مِنْ حَدِيثِ اِبْنِ عَبَّاسٍ ‏- رَضِيَ اَللَّهُ عَنْهُمَا‏- , وَزَادَ فِي آخِرِهِ : { إِلَّا أَنْ يَشَاءَ اَلْوَرَثَةُ }  وَإِسْنَادُهُ حَسَنٌ  1‏ .‏‏1 ‏- منكر .‏ رواه الدارقطني ( 4 /98 و 152 )‏ بسند ضعيف ، بل أعله الحافظ نفسه في \" التلخيص \" ( 3 / 62 / رقم 1370 )‏ .‏ قلت : وسبب النكارة هذه الزيادة : \" إلا أن يشاء الورثة \" فقد ورد الحديث عن جماعة من الصحابة دون هذه الزيادة فلم ترد إلا بهذا الإسناد الضعيف .‏ بل الحديث جاء عن ابن عباس نفسه بسند حسن .‏ رواه الدارقطني ( 4 / 98 )‏ بدون هذه الزيادة ، بل وحسن الحافظ نفسه إسناده من الطريق التي ليست فيها الزيادة فقال في \" التلخيص \" ( 3 / 62 / رقم 1369 )‏ أثناء تخريجه لحديث : \" لا وصية لوارث \" .‏ \" رواه الدارقطني من حديث ابن عباس بسند حسن \" .‏ ومن راجع \" التلخيص \" عرف صواب صنيع الحافظ هناك ، وأيضا عرف وهمه هنا رحمه الله \".‏","english":{"narrator":"ad-Daraqutni reported the aforesaid Hadith from the narration of Ibn 'Abbas (RA); and he added in its end:","text":"\"unless the other heirs wish so.\"\n\n."}},{"id":227,"idInBook":227,"chapterId":7,"bookId":17,"arabic":"وَعَنْ مُعَاذِ بْنِ جَبَلٍ ‏- رضى الله عنه ‏- قَالَ : \" قَالَ اَلنَّبِيُّ  1‏ ‏- صلى الله عليه وسلم ‏-{ إِنَّ اَللَّهَ تَصَدَّقَ عَلَيْكُمْ بِثُلُثِ أَمْوَالِكُمْ عِنْدَ وَفَاتِكُمْ ; زِيَادَةً فِي حَسَنَاتِكُمْ }  رَوَاهُ اَلدَّارَقُطْنِيُّ  2‏ .‏‏1 ‏- في \" أ \" : \" رسول الله \" وأشار ناسخها في الهامش إلى نسخة : \" النبي \".‏‏2 ‏- حسن بشواهده .‏ رواه الدارقطني ( 4 / 150 )‏.‏","english":{"narrator":"Narrated Mu'adh bin Jabal (RA):","text":"The Prophet (ﷺ) said: \"Allah gave (a favor) as Sadaqah to you a third of your property, when you are about to die, as an increase in your good deeds.\"\n\n."}},{"id":228,"idInBook":228,"chapterId":7,"bookId":17,"arabic":"وَأَخْرَجَهُ أَحْمَدُ , وَالْبَزَّارُ مِنْ حَدِيثِ أَبِي اَلدَّرْدَاءِ  1‏ .‏‏1 ‏- رواه أحمد ( 6 / 440 ‏- 441 )‏ ، والبزار ( 1382 )‏.‏","english":{"narrator":"","text":"Ahmad and al-Bazzar reported the aforesaid narration from the Hadith of Abu ad-Darda."}},{"id":229,"idInBook":229,"chapterId":7,"bookId":17,"arabic":"وَابْنُ مَاجَهْ : مِنْ حَدِيثِ أَبِي هُرَيْرَةَ  1‏ .‏‏1 ‏- رواه ابن ماجه ( 27009 )‏.‏","english":{"narrator":"","text":"While Ibn Majah reported it from the Hadith of Abu Hurairah (RA)."}},{"id":230,"idInBook":230,"chapterId":7,"bookId":17,"arabic":"وَكُلُّهَا ضَعِيفَةٌ , لَكِنْ قَدْ يَقْوَى بَعْضُهَا بِبَعْضٍ .‏ وَاَللَّهُ أَعْلَمُ  1‏ .‏‏1 ‏- هي كما قال الحافظ ‏- رحمه الله ‏- لا يخلو طريق واحد منها من الضعيف ، ولكن باجتماعها يصير الحديث حسنا.‏","english":{"narrator":"","text":"All of them (i.e. these three chains of narrators) are weak. However, they may strengthen one another (becoming Hasan), and Allah Knows Best."}},{"id":231,"idInBook":231,"chapterId":7,"bookId":17,"arabic":"عَنْ عَمْرِو بْنِ شُعَيْبٍ , عَنْ أَبِيهِ , عَنْ جَدِّهِ , عَنِ النَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ : { مَنْ أُودِعَ وَدِيعَةً , فَلَيْسَ عَلَيْهِ ضَمَانٌ }  أَخْرَجَهُ اِبْنُ مَاجَهْ , وَإِسْنَادُهُ ضَعِيفٌ  1‏ .‏‏1 ‏- ضعيف .‏ رواه ابن ماجه ( 2401 )‏.‏","english":{"narrator":"Narrated 'Amr bin Shu'aib on his father's authority from his grandfather:","text":"The Prophet (ﷺ) said: \"There is no liability on him who is entrusted with something.\"\n\n."}},{"id":232,"idInBook":232,"chapterId":7,"bookId":17,"arabic":"وَبَابُ قَسْمِ اَلصَّدَقَاتِ تَقَدَّمَ فِي آخِرِ اَلزَّكَاةِ .‏","english":{"narrator":"","text":"The Chapter on the division of Sadaqah has preceded at the end of the Book of Zakat."}},{"id":233,"idInBook":233,"chapterId":7,"bookId":17,"arabic":"وَبَابُ قَسْمِ اَلْفَيْءِ وَالْغَنِيمَةِ يَأْتِي عَقِبَ اَلْجِهَادِ إِنْ شَاءَ اَللَّهُ تَعَالَى .‏","english":{"narrator":"","text":"The Chapter on the division of tributes from territories the Muslims have conquered, and spoils of war, will follow the Book of Jihad, if Allah the Most High wills."}}],"chapter":{"id":7,"bookId":17,"arabic":"كتاب البيوع","english":"Business Transactions"}}