{"metadata":{"length":47,"arabic":{"title":"بلوغ المرام","author":"الإمام ابن حجر العسقلاني","introduction":"كتاب الجنايات"},"english":{"title":"Bulugh al-Maram","author":"Ibn Hajar al-Asqalani","introduction":"Crimes (Qisas or Retaliation)"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":9,"bookId":17,"arabic":"عَنْ اِبْنِ مَسْعُودٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ لَا يَحِلُّ دَمُ اِمْرِئٍ مُسْلِمٍ; يَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اَللَّهُ, وَأَنِّي رَسُولُ اَللَّهِ, إِلَّا بِإِحْدَى ثَلَاثٍ: اَلثَّيِّبُ اَلزَّانِي, وَالنَّفْسُ بِالنَّفْسِ, وَالتَّارِكُ لِدِينِهِ; اَلْمُفَارِقُ لِلْجَمَاعَةِ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (6878)‏، ومسلم (1676)‏.‏","english":{"narrator":"lbn Mas’ud (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"“The blood of a Muslim who testifies that none has the right to be worshipped but Allah and that I am His Messenger, cannot be shed lawfully, except in three cases: a married person who committed adultery, in Qisas (retaliation) for murder (life for life) and the apostate from Islam who abandons the Muslim Jama’ah (community).” Agreed upon."}},{"id":2,"idInBook":2,"chapterId":9,"bookId":17,"arabic":"وَعَنْ عَائِشَةَ رَضِيَ اَللَّهُ عَنْهَا, عَنْ رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { لَا يَحِلُّ قَتْلُ مُسْلِمٍ إِلَّا فِي إِحْدَى ثَلَاثِ خِصَالٍ: زَانٍ مُحْصَنٌ فَيُرْجَمُ, وَرَجُلٌ يَقْتُلُ مُسْلِمًا مُتَعَمِّدًا فَيُقْتَلُ, وَرَجُلٌ يَخْرُجُ مِنْ اَلْإِسْلَامِ فَيُحَارِبُ اَللَّهَ وَرَسُولَهُ, فَيُقْتَلُ, أَوْ يُصْلَبُ, أَوْ يُنْفَى مِنْ اَلْأَرْضِ .‏ }  رَوَاهُ أَبُو دَاوُدَ, وَالنَّسَائِيُّ, وَصَحَّحَهُ اَلْحَاكِمُ  1‏ .‏‏1 ‏- صحيح.‏ رواه أبو داود (4353)‏، والنسائي (7/91)‏، والحاكم (4 /367)‏.‏","english":{"narrator":"'A’ishah (RAA) narrated that Allah’s Messenger (ﷺ) said:","text":"“The blood of a Muslim is not to be shed except for three reasons: a married man who committed adultery, a man who kills another Muslim intentionally for which he must be killed (in Qisas or retaliation), and a man who abandons Islam and fights against Allah and His Messenger, in which case he should be either killed, crucified, or exiled.” Related by Abu Dawud and An-Nasa’i. Al-Hakim graded it as Sahih."}},{"id":3,"idInBook":3,"chapterId":9,"bookId":17,"arabic":"وَعَنْ عَبْدِ اَللَّهِ بْنِ مَسْعُودٍ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ أَوَّلُ مَا يُقْضَى بَيْنَ اَلنَّاسِ يَوْمَ اَلْقِيَامَةِ فِي اَلدِّمَاءِ .‏ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (6533)‏، ومسلم (1678)‏ واللفظ لمسلم، إذ البخاري ليس عنده اللفظ: \"يوم القيامة\".‏","english":{"narrator":"'Abdullah Ibn Mas’ud (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"“The first issues to be judged among people on the Day of Resurrection, are those of unlawful blood-shed.” Agreed upon."}},{"id":4,"idInBook":4,"chapterId":9,"bookId":17,"arabic":"وَعَنْ سَمُرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ قَتَلَ عَبْدَهُ قَتَلْنَاهُ, وَمَنْ جَدَعَ عَبْدَهُ جَدَعْنَاهُ }  رَوَاهُ أَحْمَدُ, وَالْأَرْبَعَةُ, وَحَسَّنَهُ اَلتِّرْمِذِيُّ, وَهُوَ مِنْ رِوَايَةِ اَلْحَسَنِ اَلْبَصْرِيِّ عَنْ سَمُرَةَ, وَقَدْ اُخْتُلِفَ فِي سَمَاعِهِ مِنْهُ  1‏ .‏ \nوَفِي رِوَايَةٍ لِأَبِي دَاوُدَ, وَالنَّسَائِيِّ: { وَمَنْ خَصَى عَبْدُهُ خَصَيْنَاهُ }  .‏ وَصَحَّحَ اَلْحَاكِمُ هَذِهِ اَلزِّيَادَةَ  2‏ .‏‏1 ‏- ضعيف.‏ رواه أحمد (50 و 11 و 12 و 18 و 19 )‏، وأبو داود (4515)‏، والنسائي (81)‏، والترمذي (1414)‏، وابن ماجه (2663)‏ من طريق الحسن، عن سمرة، به.‏ وليس الأمر هنا إثبات أسمع الحسن من سمرة أم لا؟ فهو لا شك قد ثبت سماعه منه، ولكنه رحمه الله كان يدلس، فلا يقبل من حديثه إلا ما صرح فيه بالسماع، وهو ما لا يوجد هنا.‏ \"فائدة\": في رواية الإمام أحمد (50)‏ بالإسناد الصحيح التصريح بأن الحسن لم يسمع هذا الحديث من سمرة.‏\n‏2 ‏- ضعيف أيضا.‏ وهذه الرواية عند أبي داود (4516)‏، والنسائي (80 ‏- 21)‏، والحاكم (4 /367 ‏- 368)‏ وعلته كعلة سابقة.‏","english":{"narrator":"Samurah (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"“Whoever kills his slave we shall kill him, and whoever cuts the nose of his slave we shall cut off his nose.” Related by Ahmad and the four lmams. At-Tirmidhi graded it as Hasan. Abu Dawud and An-Nasa’i added the following, “and whoever castrates his slave we shall castrate him.” Al-Hakim graded this addition as Sahih."}},{"id":5,"idInBook":5,"chapterId":9,"bookId":17,"arabic":"وَعَنْ عُمَرَ بْنِ اَلْخَطَّابِ ‏- رضى الله عنه ‏- قَالَ: سَمِعْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ: { لَا يُقَادُ اَلْوَالِدُ بِالْوَلَدِ }  رَوَاهُ أَحْمَدُ, وَاَلتِّرْمِذِيُّ, وَابْنُ مَاجَهْ, وَصَحَّحَهُ اِبْنُ اَلْجَارُودِ وَالْبَيْهَقِيُّ, وَقَالَ اَلتِّرْمِذِيُّ: إِنَّهُ مُضْطَرِبٌ  1‏ .‏‏1 ‏- صحيح بطرقه وشواهده.‏ رواه أحمد (12 و 49)‏، والترمذي (1400)‏، وابن ماجه (2662)‏، وابن الجارود (788)‏، والبيهقي (8 /38)‏.‏","english":{"narrator":"","text":"’Umar bin al-Khattab (RAA) narrated, ‘I heard the Messenger of Allah say, “A father is not to be killed for his offspring.” Related by Ahmad, At-Tirmidhi and Ibn Majah. Ibn al-Garud and al-Baihaqi graded it as Sahih."}},{"id":6,"idInBook":6,"chapterId":9,"bookId":17,"arabic":"وَعَنْ أَبِي جُحَيْفَةَ قَالَ: { قُلْتُ لَعَلِيٍّ رَضِيَ اَللَّهُ عَنْهُمَا: هَلْ عِنْدَكُمْ شَيْءٌ مِنْ اَلْوَحْيِ غَيْرَ اَلْقُرْآنِ? قَالَ: لَا وَاَلَّذِي فَلَقَ اَلْحَبَّةَ وَبَرَأَ اَلنِّسْمَةَ, إِلَّا فَهْمٌ يُعْطِيهِ اَللَّهُ رَجُلًا فِي اَلْقُرْآنِ, وَمَا فِي هَذِهِ اَلصَّحِيفَةِ.‏ قُلْتُ: وَمَا فِي هَذِهِ اَلصَّحِيفَةِ? قَالَ: \"اَلْعَقْلُ, وَفِكَاكُ اَلْأَسِيرِ, وَلَا يُقْتَلُ مُسْـلِمٌ بِكَافِرٍ }  .‏ رَوَاهُ اَلْبُخَارِيُّ  1‏‏1 ‏- صحيح.‏ رواه البخاري (111)‏، وانظر أطرافه.‏","english":{"narrator":"Abu Juhaifah (RAA) narrated, ‘I asked 'Ali:","text":"‘Do you have any other Divine Revelation besides what is in the Qur’an? ’Ali said, ‘No. By Him Who made the grain split (germinate) and created the soul, we have nothing besides the Qur’an except the gift of understanding the Qur’an, which Allah gives a man, besides what is written in this manuscript. I said, ‘What is in this manuscript?’ ‘Ali said, ‘The regulations of Diyah (Blood money), the ransom for captives and the ruling that no Muslim should be killed in Qisas for killing a disbeliever.’ Related by Al-Bukhari."}},{"id":7,"idInBook":7,"chapterId":9,"bookId":17,"arabic":"وَأَخْرَجَهُ أَحْمَدُ, وَأَبُو دَاوُدَ, وَالنَّسَائِيُّ: مِنْ وَجْهٍ آخَرَ عَنْ عَلِيٍّ وَقَالَ فِيهِ: { اَلْمُؤْمِنُونَ تَتَكَافَأُ دِمَاؤُهُمْ, وَيَسْعَى بِذِمَّتِهِمْ أَدْنَاهُمْ, وَهُمْ يَدٌ عَلَى مَنْ سِوَاهُمْ, وَلَا يُقْتَلُ مُؤْمِنٌ بِكَافِرٍ, وَلَا ذُو عَهْدٍ فِي عَهْدِهِ }  .‏ وَصَحَّحَهُ اَلْحَاكِمُ  1‏ .‏‏1 ‏- صحيح.‏ رواه أحمد (122)‏، وأبو داود (4530)‏، والنسائي (89 ‏- 20)‏ وزادوا جميعا: \"ومن أحدث حدثا أو آوى محدثا، فعليه لعنة الله والملائكة والناس أجمعين\".‏","english":{"narrator":"","text":"The previous tradition was also transmitted by Ahmad, An-Nasa’i and Abu Dawud on the authority of 'Ali with a different chain of narrators where he said, ‘The blood of one Muslim (his life) is equivalent to the blood of another Muslim (i.e. equal in Qisas and blood money), the protection of Allah is one (and is equally) extended to the most humble of the believers (i.e. if a Muslim gives protection to a man or to a group of men, they should all help him even is he was the most humble of them). Believers are all like one hand against their enemies. No believer is to be killed for a disbeliever (i.e. in Qisas), nor should one who has a covenant with the Muslims be killed while his covenant holds.’ Al-Hakim graded it as Sahih."}},{"id":8,"idInBook":8,"chapterId":9,"bookId":17,"arabic":"وَعَنْ أَنَسِ بْنِ مَالِكٍ ‏- رضى الله عنه ‏- { أَنَّ جَارِيَةً وُجَدَ رَأْسُهَا قَدْ رُضَّ بَيْنَ حَجَرَيْنِ, فَسَأَلُوهَا: مَنْ صَنَعَ بِكِ هَذَا? فُلَانٌ.‏ فُلَانٌ.‏ حَتَّى ذَكَرُوا يَهُودِيًّا.‏ فَأَوْمَأَتْ بِرَأْسِهَا, فَأُخِذَ اَلْيَهُودِيُّ, فَأَقَرَّ, فَأَمَرَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-أَنْ يُرَضَّ رَأْسُهُ بَيْنَ حَجَرَيْنِ.‏ }  مُتَّفَقٌ عَلَيْهِ, وَاللَّفْظُ لِمُسْلِمٍ.‏  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (2413)‏، ومسلم (1672)‏ (17)‏.‏","english":{"narrator":"","text":"Anas bin Malik (RAA) narrated that A girl was found with her head crushed between two stones. They asked her, ‘Who did that to you? Is it so and so, or so and so? They mentioned some names to her until they mentioned the name of a Jew, whereupon she nodded her head. The Jew was captured and he confessed. The Messenger of Allah (ﷺ) ordered that his head be crushed between two stones.’ Agreed upon and the wording is from Muslim."}},{"id":9,"idInBook":9,"chapterId":9,"bookId":17,"arabic":"وَعَنْ عِمْرَانَ بْنِ حُصَيْنٍ ‏- رضى الله عنه ‏- { أَنَّ غُلَامًا لِأُنَاسٍ فُقَرَاءَ قَطَعَ أُذُنَ غُلَامٍ لِأُنَاسٍ أَغْنِيَاءَ, فَأَتَوا اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-فَلَمْ يَجْعَلْ لَهُمْ شَيْئًا.‏ }  رَوَاهُ أَحْمَدُ, وَالثَّلَاثَةُ, بِإِسْنَادٍ صَحِيحٍ  1‏ .‏‏1 ‏- صحيح.‏ رواه أحمد (4 /438)‏، وأبو داود (4590)‏، والنسائي (85 ‏- 26)‏.‏ \"تنبيه\": عزو الحافظ الحديث للثلاثة وهم منه رحمه الله تعالى، إذ لم يروه الترمذي، ولا نسبه له المزي في \"التحفة\" ولا النابلسي في \"الذخائر\".‏","english":{"narrator":"","text":"'Imran bin Al-Husain (RAA) narrated that A slave of some poor people cut off the ear of another slave belonging to some rich people. They came to the Messenger of Allah (ﷺ) but he appointed no compensation for them.’ Related by Ahmad and the three Imams with a sound chain of narrators."}},{"id":10,"idInBook":10,"chapterId":9,"bookId":17,"arabic":"وَعَنْ عَمْرِوِ بْنِ شُعَيْبٍ, عَنْ أَبِيهِ, عَنْ جَدِّهِ; ‏- رضى الله عنه ‏- { أَنَّ رَجُلًا طَعَنَ رَجُلًا بِقَرْنٍ فِي رُكْبَتِهِ, فَجَاءَ إِلَى اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-فَقَالَ: أَقِدْنِي.‏ فَقَالَ: \"حَتَّى تَبْرَأَ\".‏ ثُمَّ جَاءَ إِلَيْهِ.‏ فَقَالَ: أَقِدْنِي, فَأَقَادَهُ, ثُمَّ جَاءَ إِلَيْهِ.‏ فَقَالَ: يَا رَسُولَ اَللَّهِ! عَرِجْتُ, فَقَالَ: \"قَدْ نَهَيْتُكَ فَعَصَيْتَنِي, فَأَبْعَدَكَ اَللَّهُ, وَبَطَلَ عَرَجُكَ\".‏ ثُمَّ نَهَى رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-\"أَنْ يُقْتَصَّ مِنْ جُرْحٍ حَتَّى يَبْرَأَ صَاحِبُهُ\" }  رَوَاهُ أَحْمَدُ, وَاَلدَّارَقُطْنِيُّ, وَأُعِلَّ بِالْإِرْسَالِ  1‏ .‏‏1 ‏- حسن.‏ رواه أحمد (217)‏، والدارقطني (3 /88)‏، وإعلاله بالإرسال لا يضره إذ له شواهد يصح بها.‏ وقال الصنعاني: \"في معناه أحاديث تزيده قوة\".‏ وقال ابن التركماني (8 /67)‏: \"روي من عدة طرق يشد بعضها بعضا\".‏","english":{"narrator":"","text":"'Amro bin Shu’aib narrated on the authority of his father, on the authority of his grandfather (RAA), that a man stabbed another man in his knee with a horn. So he came to the Messenger of Allah (ﷺ) and said, ‘Retaliate on my behalf.’’ The Messenger of Allah (ﷺ) said to him, “Wait until your wound has healed.” The man came again and said, ‘O Messenger of Allah! Retaliate on my behalf.’ So, he allowed him to retaliate against the one who attacked him (by stabbing him the same way). Then he came again to the Messenger of Allah (ﷺ) and said, ‘O Messenger of Allah! I have become lame.’ The Messenger of Allah (ﷺ) said to him, “I forbade you (to take retaliation until your wound was healed) but you disobeyed me, may Allah keep you away from His mercy (for your disobedience), and as for your lameness you are not entitled to any compensation (as he retaliated before he discovered the lameness otherwise he would have been entitled half the Diyah).” Then Allah]s Messenger prohibited the following, ‘No retaliation is to be made for a wound before the victim is totally recovered.’ Related by Ahmad and Ad-Daraqutni."}},{"id":11,"idInBook":11,"chapterId":9,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: { اِقْتَتَلَتِ اِمْرَأَتَانِ مِنْ هُذَيْلٍ, فَرَمَتْ إِحْدَاهُمَا اَلْأُخْرَى بِحَجَرٍ, فَقَتَلَتْهَا وَمَا فِي بَطْنِهَا, فَاخْتَصَمُوا إِلَى رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-فَقَضَى رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-أَنَّ دِيَةَ جَنِينِهَا: غُرَّةٌ; عَبْدٌ أَوْ وَلِيدَةٌ, وَقَضَى بِدِيَةِ اَلْمَرْأَةِ عَلَى عَاقِلَتِهَا.‏ وَوَرَّثَهَا وَلَدَهَا وَمَنْ مَعَهُمْ.‏ فَقَالَ حَمَلُ بْنُ اَلنَّابِغَةِ اَلْهُذَلِيُّ: يَا رَسُولَ اَللَّهِ! كَيْفَ يَغْرَمُ مَنْ لَا شَرِبَ, وَلَا أَكَلَ, وَلَا نَطَقَ, وَلَا اِسْتَهَلَّ, فَمِثْلُ ذَلِكَ يُطَلُّ, فَقَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-\n\"إِنَّمَا هَذَا مِنْ إِخْوَانِ اَلْكُهَّانِ\"; مِنْ أَجْلِ سَجْعِهِ اَلَّذِي سَجَعَ.‏ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (5758)‏، ومسلم (1681)‏ (36)‏ واللفظ لمسلم.‏","english":{"narrator":"","text":"Abu Hurairah (RAA) narrated “Two woman of the tribe of Hudhail fought with each other and one of them threw a stone at the other. In this way she killed the woman and what was in her womb (as she was pregnant). Their dispute was presented to the Prophet (ﷺ) who ordained that the Diyah (blood money) of the unborn child, is a male or a female slave of the best quality. He also decided that the Diyah of the woman is to be paid by her relatives (the one who killed) on her father’s side. The Messenger of Allah (ﷺ) also ordained that her inheritance (of the woman who killed as she died later) be for her sons and husband (and not for her relatives who had to pay the Diyah). Hamal bin An-Nabighah Al-Hudhaili then said, ‘O Messenger of Allah! Why should I pay the Diyah for one who neither drank nor ate nor spoke, nor cried (i.e. the dead fetus), such a creature is not entitled to blood money.’ The Messenger of Allah (ﷺ) then said, “This man is one of the brothers of the soothsayers,” on account of the rhymed speech which he used, concerning the dead fetus."}},{"id":12,"idInBook":12,"chapterId":9,"bookId":17,"arabic":"وَأَخْرَجَهُ أَبُو دَاوُدَ, وَالنَّسَائِيُّ: مِنْ حَدِيثِ اِبْنِ عَبَّاسٍ; أَنَّ عُمَرَ ‏- رضى الله عنه ‏- سَأَلَ مَنْ شَهِدَ قَضَاءَ رَسُولِ اَللَّهِ ‏- صلى الله عليه وسلم ‏-فِي اَلْجَنِينِ? قَالَ: فَقَامَ حَمَلُ بْنُ اَلنَّابِغَةِ, فَقَالَ: كُنْتُ بَيْنَ اِمْرَأَتَيْنِ, فَضَرَبَتْ إِحْدَاهُمَا اَلْأُخْرَى.‏.‏.‏ فَذَكَرَهُ مُخْتَصَرًا.‏ وَصَحَّحَهُ اِبْنُ حِبَّانَ, وَالْحَاكِمُ.‏  1‏‏1 ‏- صحيح.‏ رواه أبو داود (4572)‏، والنسائي (81 ‏- 22)‏ وأيضا ابن ماجة (2641)‏، وابن حبان (5989)‏، والحاكم (3 /575)‏ بسند صحيح، وتمامه: \"بمسطح، فقتلتها وجنينها، فقضى النبي صلى الله عليه وسلم في جنينها بغرة، وأن تقتل بها\".‏ وزاد الحاكم: \"فقال عمر: الله أكبر.‏ لو لم نسمع بهذا ما قضينا بغيره\".‏","english":{"narrator":"","text":"Abu Dawud and An-Nasa’i narrated on the authority of Ibn ’Abbas that 'Umar (RAA) asked about the judgment of the Prophet (ﷺ) concerning the Diyah of the dead fetus. Hamal bin An-Nabighah Al-Hudhaili then got up and said, “I was between the two women. One of them struck the other with a stone, killing her and what was in her womb. So the Messenger of Allah (ﷺ) ordained....” (as above). Ibn Hibban and al-Hakim graded it as Sahih."}},{"id":13,"idInBook":13,"chapterId":9,"bookId":17,"arabic":"وَعَنْ أَنَسٍ ‏- رضى الله عنه ‏- { أَنَّ اَلرُّبَيِّعَ بِنْتَ اَلنَّضْرِ ‏-عَمَّتَهُ‏- كَسَرَتْ ثَنِيَّةَ جَارِيَةٍ, فَطَلَبُوا إِلَيْهَا اَلْعَفْوَ, فَأَبَوْا, فَعَرَضُوا اَلْأَرْشَ, فَأَبَوْا, فَأَتَوْا رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-وَأَبَوْا إِلَّا اَلْقِصَاصَ, فَأَمَرَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-بِالْقِصَاصِ, فَقَالَ أَنَسُ بْنُ اَلنَّضْرِ: يَا رَسُولَ اَللَّهِ! أَتُكْسَرُ ثَنِيَّةُ اَلرُّبَيِّعِ? لَا, وَاَلَّذِي بَعَثَكَ بِالْحَقِّ, لَا تُكْسَرُ ثَنِيَّتُهَا, فَقَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-\"يَا أَنَسُ! كِتَابُ اَللَّهِ: اَلْقِصَاصُ\".‏ فَرَضِيَ اَلْقَوْمُ, فَعَفَوْا, فَقَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-: \"إِنَّ مِنْ عِبَادِ اَللَّهِ مَنْ لَوْ أَقْسَمَ عَلَى اَللَّهِ لَأَبَرَّهُ\".‏ }  مُتَّفَقٌ عَلَيْهِ, وَاللَّفْظُ لِلْبُخَارِيِّ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (2703)‏، ومسلم (1675)‏.‏","english":{"narrator":"","text":"Anas narrated that Ar-Rubai’ bint An-Nadr (his aunt) broke the incisor teeth of a girl. The family of Ar·Rubai' asked the family of the girl to pardon her, but they refused. They then offered them Arsh, (as compensation) but they also refused. They came to the Messenger of Allah (ﷺ) asking for Qisas, and he gave orders that they should take their Qisas from Ar-Rubai'. Anas bin An-Nadr then came to the Messenger of Allah (ﷺ) and said, ‘O Messenger ofAllah! Will the incisor tooth of Ar-Rubai' be broken? No, by Him Who sent you with the truth, her incisor tooth will not be broken. The Messenger of Allah (ﷺ) then said to him, “Anas! Allah’s decree is equal retaliation.” But the family of the girl agreed to pardon Ar-Rubai'. The Messenger of Allah (ﷺ) then said, “Among Allah’s servants are those who if they swear by Allah (for something), Allah will consent to their oath.” Agreed upon, and the wording is from Al·Bukhari."}},{"id":14,"idInBook":14,"chapterId":9,"bookId":17,"arabic":"وَعَنْ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ قُتِلَ فِي عِمِّيَّا أَوْ رِمِّيَّا بِحَجَرٍ, أَوْ سَوْطٍ, أَوْ عَصًا, فَعَلَيْهِ عَقْلُ اَلْخَطَإِ, وَمِنْ قُتِلَ عَمْدًا فَهُوَ قَوَدٌ, وَمَنْ حَالَ دُونَهُ فَعَلَيْهِ لَعْنَةُ اَللَّهِ }  أَخْرَجَهُ أَبُو دَاوُدَ, وَالنَّسَائِيُّ, وَابْنُ مَاجَهْ, بِإِسْنَادٍ قَوِيٍّ  1‏ .‏‏1 ‏- حسن.‏ رواه أبو داود (4540)‏، والنسائي (8 /39 ‏- 40 و 40)‏، وابن ماجه (3635)‏، من طريق سليمان بن كثير العبدي، عن عمرو بن دينار، عن طاوس، عن ابن عباس، مرفوعا به.‏ وتمامه: \"والملائكة والناس أجمعين، لا يقبل الله منه صرفا ولا عدلا\".‏ قلت: وسليمان بن كثير فيه كلام وهو من رجال الشيخين، ويخشى من روايته عن الزهري، وهذه ليس منها، فلا أقل من أن يكون حسن الحديث.‏ والله أعلم.‏","english":{"narrator":"Ibn ’Abbas (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"“If anyone is killed and his killer is not known, or was killed with a stone, a whip or with a stick (i.e. killed by mistake but with a deliberate injury) his Diyah will be that of killing by mistake (manslaughter). As for whoever killed deliberately, retaliation is due (from the one who killed him). Anyone who tries to prevent taking Qisas (from the killer) may Allah curse him.” Related by Abu Dawud, An-Nasa’i and Ibn Majah with a strong chain of narrators."}},{"id":15,"idInBook":15,"chapterId":9,"bookId":17,"arabic":"وَعَنْ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا, عَنْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { إِذَا أَمْسَكَ اَلرَّجُلُ اَلرَّجُلَ, وَقَتَلَهُ اَلْآخَرُ, يُقْتَلُ اَلَّذِي قَتَلَ, وَيُحْبَسُ اَلَّذِي أَمْسَكَ }  رَوَاهُ اَلدَّارَقُطْنِيُّ مَوْصُولًا وَمُرْسَلًا, وَصَحَّحَهُ اِبْنُ اَلْقَطَّانِ, وَرِجَالُهُ ثِقَاتٌ, إِلَّا أَنَّ اَلْبَيْهَقِيَّ رَجَّحَ اَلْمُرْسَلَ  1‏ .‏‏1 ‏- صحيح.‏ وهو مخرج في \" الأقضية النبوية \" لابن الطلاع ص ( 8 منسوختي )‏.‏","english":{"narrator":"Ibn 'Umar (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"“If a man holds another man so that a third man can kill the seized one, then the one who killed is to be killed (in Qisas) and the one who seized the killed one is to be imprisoned.” Related by Ad-Daraqutni. Ibn al-Qattan graded it as Sahih and its narrators are trustworthy."}},{"id":16,"idInBook":16,"chapterId":9,"bookId":17,"arabic":"وَعَنْ عَبْدِ اَلرَّحْمَنِ بْنِ الْبَيْلَمَانِيِّ; { أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَتَلَ مُسْلِمًا بِمَعَاهِدٍ.‏ وَقَالَ: \"أَنَا أَوْلَى مَنْ وَفَى بِذِمَّتِهِ }  .‏ أَخْرَجَهُ عَبْدُ اَلرَّزَّاقِ هَكَذَا مُرْسَلًا.‏ وَوَصَلَهُ اَلدَّارَقُطْنِيُّ, بِذِكْرِ اِبْنِ عُمَرَ فِيهِ, وَإِسْنَادُ اَلْمَوْصُولِ وَاهٍ  1‏ .‏‏1 ‏- ضعيف جدا.‏ والمرسل رواه عبد الرزاق (1001 / رقم 18514)‏ عن الثوري، عن ربيعة، عن ابن البيلماني به.‏ وهذا فضلا عن إرساله، فمرسله ضعيف لا يحتج به، فقد قال الدارقطني: \"ابن البيلماني ضعيف لا تقوم به حجة إذا وصل الحديث، فكيف بما يرسله؟!\".‏ وأما الموصول: فرواه الدارقطني (334 ‏- 13565)‏ من طريق إبراهيم بن محمد الأسلمي، عن ربيعة، عن ابن البيلماني، عن ابن عمر، به.‏وقال الدارقطني: \"لم يسنده غير إبراهيم بن أبي يحيى، وهو متروك الحديث\".‏ قلت: بل كذبه بعضهم، وابن البيلماني ضعيف.‏ وثم علة أخرى، وهي نكارة هذا المتن إذ يعارض الحديث الصحيح المتقدم برقم (1163)‏ وهو قوله صلى الله عليه وسلم : \"لا يقتل مسلم بكافر\".‏","english":{"narrator":"","text":"’Abdur Rahman bin Al-Bailamani narrated that The Messenger of Allah (ﷺ) killed a Muslim who killed a Mu'ahid who had made a covenant with the Muslims, and said, “I am closest to the ones who keep their covenants of protection.” Related by 'Abdur Razzaq."}},{"id":17,"idInBook":17,"chapterId":9,"bookId":17,"arabic":"وَعَنْ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { قُتِلَ غُلَامٌ غِيلَةً, فَقَالَ عُمَرُ: لَوْ اِشْتَرَكَ فِيهِ أَهْلُ صَنْعَاءَ لَقَتَلْتُهُمْ بِهِ }  .‏ أَخْرَجَهُ اَلْبُخَارِيُّ  1‏‏1 ‏- صحيح.‏ رواه البخاري (6896)‏ وليس عنده لفظ: \"به\".‏","english":{"narrator":"","text":"Ibn ’Umar (RAA) narrated, ‘A young boy was murdered deceitfully. 'Umar (RAA) thereupon said, ‘If all the people of San'a’ (in Yemen) participated in killing him, I would kill them all.’ Related by al-Bukhari."}},{"id":18,"idInBook":18,"chapterId":9,"bookId":17,"arabic":"وَعَنْ أَبِي  1‏ شُرَيْحٍ اَلْخُزَاعِيِّ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ فَمَنْ قُتِلَ لَهُ قَتِيلٌ بَعْدَ مَقَالَتِي هَذِهِ, فَأَهْلُهُ بَيْنَ خِيَرَتَيْنِ: إِمَّا أَنْ يَأْخُذُوا اَلْعَقْلِ.‏ أَوْ يَقْتُلُوا }  أَخْرَجَهُ أَبُو دَاوُدَ, وَالنَّسَائِيُّ  2‏ .‏‏1 ‏- تحرف في \"أ\" إلى: \"ابن\".‏‏2 ‏- صحيح.‏ رواه أبو داود (4504)‏، والترمذي (1406)‏ بسند صحيح.‏ وقال الترمذي: \"حديث حسن صحيح\".‏ \"تنبيه\" قوله: رواه النسائي، وهم من الحافظ رحمه الله، وإنما رواه من أصحاب السنن الترمذي كما ترى، ويؤكد ذلك عدم عزو المزي (925)‏ الحديث للنسائي.‏","english":{"narrator":"Abil Shuraih Al-Khaza'i (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"“If the relative of one of you is killed after my speech, his family has one of two choices: ‘Either they take his Diyah or kill the killer.” Related by Abu Dawud and An-Nasa’i."}},{"id":19,"idInBook":19,"chapterId":9,"bookId":17,"arabic":"وَأَصْلُهُ فِي \n\"اَلصَّحِيحَيْنِ\" مِنْ حَدِيثِ أَبِي هُرَيْرَةَ بِمَعْنَاهُ  1‏‏1 ‏- رواه البخاري (6880)‏، ومسلم (1355)‏ عن أبي هريرة من حديث طويل، وفيه: \"ومن قتل له قتيل، فهو بخير النظرين؛ إما أن يودى، وإما أن يقاد\" لفظ البخاري.‏ ولفظ مسلم: \"إما أن يفدى، وإما أن يقتل\".‏","english":{"narrator":"","text":"A similar narration is transmitted by Al-Bukhari and Muslim on the authority of Abu Hurairah."}},{"id":20,"idInBook":20,"chapterId":9,"bookId":17,"arabic":"عَنْ أَبِي بَكْرٍ بْنِ مُحَمَّدٍ بْنِ عَمْرِوِ بْنِ حَزْمٍ, عَنْ أَبِيهِ, عَنْ جَدِّهِ ‏- رضى الله عنه ‏- أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-كَتَبَ إِلَى أَهْلِ اَلْيَمَنِ.‏.‏.‏ فَذَكَرَ اَلْحَدِيثَ, وَفِيهِ: { أَنَّ مَنْ اِعْتَبَطَ مُؤْمِنًا قَتْلاً عَنْ بَيِّنَةٍ, فَإِنَّهُ قَوَدٌ, إِلَّا أَنْ يَرْضَى أَوْلِيَاءُ اَلْمَقْتُولِ, وَإِنَّ فِي اَلنَّفْسِ اَلدِّيَةَ مِائَةً مِنْ اَلْإِبِلِ, وَفِي اَلْأَنْفِ إِذَا أُوعِبَ جَدْعُهُ اَلدِّيَةُ, وَفِي اَللِّسَانِ اَلدِّيَةُ, وَفِي اَلشَّفَتَيْنِ اَلدِّيَةُ, وَفِي اَلذِّكْرِ اَلدِّيَةُ, وَفِي اَلْبَيْضَتَيْنِ اَلدِّيَةُ, وَفِي اَلصُّلْبِ اَلدِّيَةُ, وَفِي اَلْعَيْنَيْنِ اَلدِّيَةُ, وَفِي اَلرِّجْلِ اَلْوَاحِدَةِ نِصْفُ اَلدِّيَةِ, وَفِي الْمَأْمُومَةِ ثُلُثُ اَلدِّيَةِ, وَفِي اَلْجَائِفَةِ ثُلُثُ اَلدِّيَةِ, وَفِي اَلْمُنَقِّلَةِ خَمْسَ عَشْرَةَ مِنْ اَلْإِبِلِ, وَفِي كُلِّ إِصْبَعٍ مِنْ أَصَابِعِ اَلْيَدِ وَالرِّجْلِ عَشْرٌ مِنْ اَلْإِبِلِ, وَفِي اَلسِّنِّ خَمْسٌ مِنْ اَلْإِبِلِ  1‏ وَفِي اَلْمُوضِحَةِ خَمْسٌ مِنْ اَلْإِبِلِ, وَإِنَّ اَلرَّجُلَ يُقْتَلُ بِالْمَرْأَةِ, وَعَلَى أَهْلِ اَلذَّهَبِ أَلْفُ دِينَارٍ }  أَخْرَجَهُ أَبُو دَاوُدَ فِي \n\"اَلْمَرَاسِيلِ\" وَالنَّسَائِيُّ, وَابْنُ خُزَيْمَةَ, وَابْنُ اَلْجَارُودِ, وَابْنُ حِبَّانَ, وَأَحْمَدُ, وَاخْتَلَفُوا فِي صِحَّتِهِ  2‏‏1 ‏- في \"أ\": \"إبل\".‏‏2 ‏- ضعيف؛ لإرساله، ولأنه من رواية سليمان بن أرقم، وهو متروك، وفي الحديث كلام كثير، وقد فصلت القول فيه في \"الأصل\".‏","english":{"narrator":"Abu Bakr bin Muhammad bin 'Amro bin Hazm narrated on the authority of his father on the authority of his grandfather (RAA) that ‘The Messenger of Allah (ﷺ) wrote to the people of Yemen (mentioning the hadith which included), ‘Whoever kills a believer deliberately for no reason or a crime that he committed, he should be killed (in retaliation), unless the family of the murdered person agrees to take Diyah (blood money). The Diyah for a life is a hundred camels. Full blood money (i.e. total Diyah of 100 camels) is paid for the total cut off of each of the following:","text":"the nose, the eyes, the tongue, the lips, the penis, the testicles and the backbone. For the cutting off of one leg; half a Diyah is paid (i.e. 50 camels). For a head injury a third of the Diyah is paid, for a stab which penetrates the body, one third of the Diyah, for a blow which breaks a bones or dislocates it, 15 camels. For each finger or toe, 10 camels are paid. For each tooth five camels are paid. For a wound which exposes a bone five camels are paid. A man is killed in Qisas for killing a woman. For those who possess gold, they should pay the equivalent of the 100 camels which is fixed as one thousand Dinars.’ Related by Abu Dawud in his book “al-Marasil”, an-Nasa'i, Ibn Khuzaimah, Ibn al-Garud, Ibn Hibban and Ahmad, but they disagreed regarding its authenticity."}},{"id":21,"idInBook":21,"chapterId":9,"bookId":17,"arabic":"وَعَنْ اِبْنِ مَسْعُودٍ ‏- رضى الله عنه ‏- عَنْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { دِيَةُ اَلْخَطَأَ أَخْمَاسًا: عِشْرُونَ حِقَّةً, وَعِشْرُونَ جَذَعَةً, وَعِشْرُونَ بَنَاتِ مَخَاضٍ, وَعِشْرُونَ بَنَاتِ لَبُونٍ, وَعِشْرُونَ بَنِي لَبُونٍ }  أَخْرَجَهُ اَلدَّارَقُطْنِيُّ.‏ \nوَأَخْرَجَهُ اَلْأَرْبَعَةُ, بِلَفْظٍ: { وَعِشْرُونَ بِنِي مَخَاضٍ }  , بَدَلَ: { بُنِيَ لَبُونٍ }  .‏ وَإِسْنَادُ اَلْأَوَّلِ أَقْوَى.‏ \nوَأَخْرَجَهُ اِبْنُ أَبِي شَيْبَةَ مِنْ وَجْهٍ آخَرَ مَوْقُوفًا, وَهُوَ أَصَحُّ مِنْ اَلْمَرْفُوعِ  1‏ .‏‏1 ‏- الموقوف رواه ابن أبي شيبة في \"المصنف\" (934)‏.‏ وأما المرفوع فهو ضعيف.‏","english":{"narrator":"Ibn Mas’ud (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"“The Diyah for accidental killing is paid in five types of camel indemnity: 20 she-camels ‘hiqqah’ (in their fourth year), 20 she-camels ‘Jaz'ah’ (in their fifth year), 20 she-camels ‘bint makhad’ (in their second year), 20 she-camels ‘bint labun’ (in their third year) and 20 he-camels 'ibn labun' (in their third year).”Related by Ad-Daraqutni with a strong chain of narrators. The four Imams reported it with this version, “twenty ‘ibn makhad’ (twenty male camels which had entered their second year),” instead of “ibn labun.”"}},{"id":22,"idInBook":22,"chapterId":9,"bookId":17,"arabic":"وَأَخْرَجَهُ أَبُو دَاوُدَ, وَاَلتِّرْمِذِيُّ: مِنْ طَرِيقِ عَمْرِوِ بْنِ شُعَيْبٍ, عَنْ أَبِيهِ, عَنْ جَدِّهِ رَفَعَهُ: { اَلدِّيَةُ ثَلَاثُونَ حِقَّةً, وَثَلَاثُونَ جَذَعَةً, وَأَرْبَعُونَ خَلِفَةً.‏ فِي بُطُونِهَا أَوْلَادُهَا }   1‏ .‏‏1 ‏- حسن.‏ رواه أبو داود (4541)‏، والترمذي (1387)‏.‏ وليس عندهما الجملة الأخيرة.‏","english":{"narrator":"Abu Dawud and At-Tirmidhi transmitted on the authority of 'Amro bin Shu'aib on his father’s authority, who reported from his grandfather (RAA), who reported that the Messenger of Allah (ﷺ) said:","text":"“The Diyah (of intentional homicide) is paid in three different types of camels: 30 she-camels ‘hiqqah’ (in their fourth year), 30 she-camels ‘Jaz'ah’ (in their fifth year), and 40 pregnant she-camels.”"}},{"id":23,"idInBook":23,"chapterId":9,"bookId":17,"arabic":"وَعَنْ اِبْنِ عَمْرٍو  1‏ رَضِيَ اَللَّهُ عَنْهُمَا, عَنْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { إِنَّ أَعْتَى اَلنَّاسِ عَلَى اَللَّهِ ثَلَاثَةٌ: مَنْ قَتَلَ فِي حَرَمَ اَللَّهِ, أَوْ قَتَلَ غَيْرَ قَاتِلِهِ, أَوْ قَتَلَ لِذَحْلِ اَلْجَاهِلِيَّةِ }  \nأَخْرَجَهُ اِبْنُ حِبَّانَ فِي حَدِيثٍ  2‏ صَحَّحَهُ  3‏ .‏‏1 ‏- بالأصلين: \"ابن عمر\" وهو تحريف صوابه \"ابن عمرو\" إذ الحديث حديث عبد الله بن عمرو.‏ ولقد نسب الحافظ نفسه الحديث في \"التلخيص\" إلى \"ابن عمرو\" لا إلى \"ابن عمر\".‏\n‏2 ‏- حسن رواه أحمد (279)‏ مطولا من طريق عمرو بن شعيب، عن أبيه، عن جده.‏ ورواه أحمد (287)‏ من نفس الطريق لكن مقتصرا على الجملة المذكورة هنا فقط.‏ قلت وهذا سند حسن كما هو معروف.‏ إلا أن الحديث له شاهد آخر يصح به \"والذحل\" ثأر الجاهلية وعدوانها.‏‏3 ‏- كذا الأصل، وفي \"أ\" بزيادة \"واو\": و \"صححه\".‏","english":{"narrator":"Ibn 'Umar (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"“Three types of people are most hated by Allah, the Almighty: whoever kills another in the Sacred area of Haram (Sanctuary), whoever kills anyone other than the one who killed him or whoever kills anyone in revenge as in times of Jahiliyah (pre-Islamic times).” Related by Ibn Hibban."}},{"id":24,"idInBook":24,"chapterId":9,"bookId":17,"arabic":"وَأَصْلُهُ فِي اَلْبُخَارِيِّ: مِنْ حَدِيثِ اِبْنِ عَبَّاسٍ  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (6882)‏ عن ابن عباس؛ أن النبي صلى الله عليه وسلم قال: \"أبغض الناس إلى الله ثلاثة: ملحد في الحرم، ومبتغ في الإسلام سنة الجاهلية، ومطلب دم امرئ بغير حق ليهريق دمه\".‏","english":{"narrator":"","text":"And it's basic meaning is in Al-Bukhari from the narration of Ibn 'Abbas."}},{"id":25,"idInBook":25,"chapterId":9,"bookId":17,"arabic":"وَعَنْ عَبْدِ اَللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ رَضِيَ اَللَّهُ عَنْهُمَا; أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-قَالَ: { أَلَا إِنَّ دِيَةَ اَلْخَطَأِ شِبْهِ اَلْعَمْدِ ‏-مَا كَانَ بِالسَّوْطِ وَالْعَصَا‏- مَائَةٌ مِنَ اَلْإِبِلِ, مِنْهَا أَرْبَعُونَ فِي بُطُونِهَا أَوْلَادُهَا }  أَخْرَجَهُ أَبُو دَاوُدَ, وَالنَّسَائِيُّ, وَابْنُ مَاجَهْ, وَصَحَّحَهُ اِبْنُ حِبَّانَ  1‏‏1 ‏- صحيح رواه أبو داود (4547)‏.‏ والنسائي (8 /41)‏، وابن ماجه (2627)‏ وابن حبان (1526)‏ بسند صحيح، عن عبد الله بن عمر؛ أن رسول الله صلى الله عليه وسلم خطب يوم الفتح بمكة، فكبر ثلاثا، ثم قال: \"لا إله إلا الله وحده، صدق وعده، ونصر عبده، وهزم الأحزاب وحده، ألا إن كل مأثرة كانت في الجاهلية تذكر وتدعى من دم أو مال تحت قدمي، إلا ما كان من سقاية الحاج وسدانة البيت ألا إن دية الخطأ .‏.‏.‏\" الحديث والسياق لأبي داود.‏","english":{"narrator":"‘Abdullah Ibn 'Amro ibn al-'As (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"“The Diyah for accidental and quasi-deliberate homicide -such as that inflicted with a whip or a stick- is a hundred camels, forty of which are pregnant she-camels.” Related by Abu-Dawud, An-Nasa’i and Ibn Majah. Ibn Hibban graded it as Sahih."}},{"id":26,"idInBook":26,"chapterId":9,"bookId":17,"arabic":"وَعَنْ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا, عَنْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { هَذِهِ وَهَذِهِ سَوَاءٌ ‏-يَعْنِي: اَلْخُنْصَرَ وَالْإِبْهَامَ }  رَوَاهُ اَلْبُخَارِيُّ  1‏\nوَلِأَبِي دَاوُدَ وَاَلتِّرْمِذِيَّ: { دِيَةُ اَلْأَصَابِعِ سَوَاءٌ, وَالْأَسْنَانُ سَوَاءٌ: اَلثَّنِيَّةُ وَالضِّرْسُ سَوَاءٌ }   2‏ .‏ \nوَلِابْنِ حِبَّانَ: { دِيَةُ أَصَابِعِ اَلْيَدَيْنِ وَالرِّجْلَيْنِ سَوَاءٌ, عَشَرَةٌ مِنْ اَلْإِبِلِ لِكُلِّ إصْبَعٍ } 3‏ .‏‏1 ‏- صحيح رواه البخاري (6895)‏.‏\n‏2 ‏- صحيح رواه أبو داود (4559)‏ ولم أجده في الترمذي بهذا اللفظ.‏\n‏3 ‏- صحيح رواه ابن حبان (5980)‏ قلت: وصنيع المصنف هنا ‏-رحمه الله‏- يشعر أن الحديث لم يروه من هو أعلى من ابن حبان، وليس الأمر كذلك، فقد رواه الترمذي (1391)‏، بنفس سند ابن حبان ومتنه، وقال: \"حديث حسن صحيح غريب\".‏","english":{"narrator":"Ibn 'Abbas (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"‘This and that are equal -meaning the little finger and the thumb.’’ Related by Al-Bukhari Abu Dawud and At-Tirmidhi transmitted, “The Diyah for the fingers and toes is the same, and that for the teeth is the same; the incisor and the molar tooth are the same.” Ibn Hibban narrated, “The Diyah for the fingers and toes is the same; 10 camels for each.”"}},{"id":27,"idInBook":27,"chapterId":9,"bookId":17,"arabic":"وَعَنْ عَمْرِو بْنِ شُعَيْبٍ, عَنْ أَبِيهِ, عَنْ جَدِّهِ رَفَعَهُ قَالَ: { مَنْ تَطَبَّبَ ‏-وَلَمْ يَكُنْ بِالطِّبِّ مَعْرُوفًا‏- فَأَصَابَ نَفْسًا فَمَا دُونَهَا, فَهُوَ ضَامِنٌ }  أَخْرَجَهُ اَلدَّارَقُطْنِيُّ, وَصَحَّحَهُ اَلْحَاكِمُ, وَهُوَ عِنْدَ أَبِي دَاوُدَ, وَالنَّسَائِيِّ وَغَيْرِهِمَا; إِلَّا أَنَّ مَنْ أَرْسَلَهُ أَقْوَى مِمَّنْ وَصَلَهُ.‏  1‏‏1 ‏- .‏ضعيف رواه أبو داود (4586)‏، والنسائي (8 /52 ‏- 53)‏، وابن ماجه (3466)‏، والدارقطني (396)‏، والحاكم (412)‏، وهو ضعيف للعلة التي ذكرها الحافظ، ولغيرها أيضا، وكذلك ضعفه الدارقطني، والبهيقي.‏","english":{"narrator":"’Amro bin Shu’aib narrated on the authority of his father, on the authority of his grandfather (RAA) that the Messenger of Allah (ﷺ) said:","text":"“Anyone who practices medicine but is not known as a practitioner, and kills a human being or inflicts harm on him, will be held responsible.” Related by Ad-Daraqutni. Al-Hakim graded it as Sahih. Abu Dawud, an-Nasa'i and others also narrated it, but its Mursal form is stronger than the connected one."}},{"id":28,"idInBook":28,"chapterId":9,"bookId":17,"arabic":"وَعَنْهُ; أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-قَالَ: { فِي الْمَوَاضِحِ خَمْسٌ, خَمْسٌ مِنْ اَلْإِبِلِ }  رَوَاهُ أَحْمَدُ.‏ وَالْأَرْبَعَةُ.‏ وَزَادَ أَحْمَدُ: { وَالْأَصَابِعُ سَوَاءٌ, كُلُّهُنَّ عَشْرٌ, عَشْرٌ مِنَ اَلْإِبِلِ }  وَصَحَّحَهُ اِبْنُ خُزَيْمَةَ, وَابْنُ اَلْجَارُودِ.‏  1‏ .‏‏1 ‏- حسن رواه أبو داود (4566)‏، والنسائي (8 /57)‏، والترمذي (1390)‏، وابن ماجه (2655)‏، وابن الجارود (785)‏ واللفظ لابن ماجه، وقال الترمذي: \"حديث حسن\" ورواية أحمد وزيادته في \"المسند\" (215)‏.‏","english":{"narrator":"'Amro bin Shu’aib narrated on the authority of his father, on the authority of his grandfather (RAA) that the Messenger of Allah (ﷺ) said:","text":"“For a wound which exposes a bone five camels are paid (in compensation).’’ Related by Ahmad and the four Imams. Ahmad added the following statement, “And the fingers and toes are all equal- in Diyah· ten camels.” Ibn Khuzaimah and Ibn al-Garud graded it as Sahih."}},{"id":29,"idInBook":29,"chapterId":9,"bookId":17,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ عَقْلُ أَهْلِ اَلذِّمَّةِ نِصْفُ عَقْلِ اَلْمُسْلِمِينَ }  رَوَاهُ أَحْمَدُ وَالْأَرْبَعَةُ  1‏ .‏ \nوَلَفْظُ أَبِي دَاوُدَ: { دِيَةُ اَلْمُعَاهِدِ نِصْفُ دِيَةِ اَلْحُرِّ }   2‏ \nوَلِلنِّسَائِيِّ: { عَقْلُ اَلْمَرْأَةِ مِثْلُ عَقْلِ اَلرَّجُلِ, حَتَّى يَبْلُغَ اَلثُّلُثَ مِنْ دِيَتِهَا }  وَصَحَّحَهُ اِبْنُ خُزَيْمَةَ.‏  3‏‏1 ‏- حسن وهذا لفظ النسائي (8 /45)‏ وزاد: \"وهم اليهود والنصارى\".‏ وفي رواية للترمذي (1413)‏، والنسائي (8 /45)‏: \"عقل الكافر نصف عقل المؤمن\".‏ وقال الترمذي: \"حديث حسن\".‏ وفي رواية لأحمد (280)‏: \"دية الكافر نصف دية المسلم\"، وفي أخرى لابن ماجه (2644)‏ وأحمد (283)‏: أن رسول الله صلى الله عليه وسلم قضى أن عقل أهل الكتابين نصف عقل المسلمين.‏ وهم اليهود والنصارى.‏ وفي أخرى لأحمد \"أهل الكتاب\" والباقي مثله سواء.‏\n‏2 ‏- حسن وهذا اللفظ لأبي داود ( 4583 )‏.‏\n‏3 ‏- ضعيف، وهذا لفظ النسائي (8 /44 ‏- 45)‏، وفي الطريق إلى عمرو بن شعيب.‏ ابن جريح وهو مدلس ولم يصرح بالتحديث، ورواه عنه إسماعيل بن عياش وهي رواية ضعيفة.‏ \"فائدة\": قال الحافظ في \"التلخيص\" (45)‏: \"قال الشافعي: \"وكان مالك يذكر أنه السنة، وكنت أتابعه عليه، وفي نفسي منه شيء، ثم علمت أنه يريد سنة أهل المدينة، فرجعت عنه\".‏","english":{"narrator":"'Amro bin Shu'aib narrated on the authority of his father, on the authority of his grandfather (RAA) that the Messenger of Allah (ﷺ) said:","text":"“The Diyah of the Dhimmi is half that of a Muslim.” Related by Ahmad and the four Imams. The narration of Abu Dawud, “The Diyah of the Mu'ahid (non Muslim with a covenant of protection) is half the Diyah of an free Muslim.” In the narration of An-Nasa’i, “The Diyah of a woman is the same as the Diyah of a man up to the third of the value (if the due value exceeds the third then her Diyah is half that of the man).” Ibn Khuzaimah graded it as Sahih."}},{"id":30,"idInBook":30,"chapterId":9,"bookId":17,"arabic":"وَعَنْهُ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ عَقْلُ شِبْهِ اَلْعَمْدِ مُغَلَّظٌ مِثْلُ عَقْلِ اَلْعَمْدِ, وَلَا يَقْتَلُ صَاحِبُهُ, وَذَلِكَ أَنْ يَنْزُوَ اَلشَّيْطَانُ, فَتَكُونُ دِمَاءٌ بَيْنَ اَلنَّاسِ فِي غَيْرِ ضَغِينَةٍ, وَلَا حَمْلِ سِلَاحٍ }  أَخْرَجَهُ اَلدَّارَقُطْنِيُّ وَضَعَّفَهُ  1‏‏1 ‏- حسن.‏ رواه الدارقطني (3/95)‏، وهو أيضا عند أبي داود (4565)‏، ولم أجد تضعيف الدارقطني في \"السنن\" وعلى أية حال الحديث سنده حسن، ولا توجد حجة لتضعيفه.‏","english":{"narrator":"'Amro bin Shu'aib narrated on the authority of his father, on the authority of his grandfather (RAA) that the Messenger of Allah (ﷺ) said:","text":"“The Diyah of the quasi-deliberate homicide is as severe as deliberate murder (in its being given in three types of camels), and the offender is not to be killed. This happens when the devil excites enmity between people causing them to shed blood but not due to hatred or carrying weapons in fighting.” Related by Ad-Daraqutni and graded it as weak Hadith."}},{"id":31,"idInBook":31,"chapterId":9,"bookId":17,"arabic":"عَنْ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { قَتَلَ رَجُلٌ رَجُلًا عَلَى عَهْدِ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏- 1‏ فَجَعَلَ اَلنَّبِيُّ ‏- صلى الله عليه وسلم ‏-دِيَتَهُ اِثْنَيْ عَشَرَ أَلْفًا }  رَوَاهُ اَلْأَرْبَعَةُ, وَرَجَّحَ النَّسَائِيُّ وَأَبُو حَاتِمٍ إِرْسَالَهُ.‏  2‏ .‏‏1 ‏- كذا الأصل وفي \"أ\")‏: \"رسول الله\" وأشار ناسخها في الهامش إلى نسخة أخرى \"النبي\".‏\n‏2 ‏- ضعيف.‏ رواه أبو داود (4546)‏، والنسائي (8 /44)‏، والترمذي (1388)‏، وابن ماجه (2629)‏ من طريق محمد بن مسلم، عن عمرو بن دينار، عن عكرمة، عن ابن عباس.‏ قلت: وإعلان الحديث بالإرسال هو الصواب، وبذلك أيضا أعله أبو داود والترمذي، وابن حزم، وعبد الحق.‏","english":{"narrator":"","text":"Ibn ’Abbas (RAA) narrated that, 'A man killed another man during the lifetime of the Prophet (ﷺ), so the Prophet (ﷺ) decided that his Diyah would be 12 thousand (Dirhams).' Related by the four Imams."}},{"id":32,"idInBook":32,"chapterId":9,"bookId":17,"arabic":"وَعَنْ أَبِي رِمْثَةَ قَالَ: { أَتَيْتُ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-وَمَعِي اِبْنِي  1‏ .‏ فَقَالَ: \"مَنْ هَذَا?\" قُلْتُ: اِبْنِي.‏ أَشْهَدُ بِهِ.‏ قَالَ: \"أَمَّا إِنَّهُ لَا يَجْنِي عَلَيْكَ, وَلَا تَجْنِي عَلَيْهِ }  رَوَاهُ النَّسَائِيُّ, وَأَبُو دَاوُدَ, وَصَحَّحَهُ اِبْنُ خُزَيْمَةَ, وَابْنُ اَلْجَارُودِ  2‏ .‏‏1 ‏- كذا بالأصلين، وهو موافق لرواية ابن الجارود، ولكن عند أبي داود والنسائي: انطلقت مع أبي نحو النبي صلى الله عليه وسلم، ثم إن رسول الله صلى الله عليه وسلم قال لأبي: \"ابنك هذا؟\" قال: إي ورب الكعبة.‏ قال: \"حقا\"؟ قال: أشهد به، قال: فتبسم رسول الله صلى الله عليه وسلم ضاحكا من ثبت شبهي في أبي، ومن حلف أبي علي، ثم قال: فذكره.‏ والسياق لأبي داود.‏‏2 ‏- صحيح.‏ رواه أبو داود (4495)‏، والنسائي (8 /53)‏، وابن الجارود (770)‏.‏ وزاد أبو داود: \"وقرأ رسول الله صلى الله عليه وسلم: ولا تزر وازرة وزر أخرى\".‏","english":{"narrator":"Abu Rimthah narrated, ‘I came to the Prophet (ﷺ) with my son and he asked me, “Who is this?” I answered, ‘This is my son, and I swear on it.’ The Messenger of Allah (ﷺ) said:","text":"“He will not carry your burdens (sins) and you will not carry his burdens.” Related by An-Nasa’i and Abu Dawud. Ibn Khuzaimah and Ibn al-Garud graded it as Sahih."}},{"id":33,"idInBook":33,"chapterId":9,"bookId":17,"arabic":"عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ, عَنْ رِجَالٍ مِنْ كُبَرَاءِ قَوْمِهِ, أَنَّ عَبْدَ اَللَّهِ بْنَ سَهْلٍ ومُحَيِّصَةَ بْنَ مَسْعُودٍ خَرَجَا إِلَى خَيْبَرَ مِنْ جَهْدٍ أَصَابَهُمْ, فَأُتِيَ مَحَيِّصَةُ فَأُخْبِرَ أَنَّ عَبْدَ اَللَّهِ بْنِ سَهْلِ قَدْ قُتِلَ, وَطُرِحَ فِي عَيْنٍ, فَأَتَى يَهُودَ, فَقَالَ: أَنْتُمْ وَاَللَّهِ قَتَلْتُمُوهُ.‏ قَالُوا: وَاَللَّهِ مَا قَتَلْنَاهُ, فَأَقْبَلَ هُوَ وَأَخُوهُ حُوَيِّصَةُ وَعَبْدُ اَلرَّحْمَنِ بْنُ سَهْلٍ, فَذَهَبَ مُحَيِّصَةُ لَيَتَكَلَّمَ, فَقَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ \"كَبِّرْ كَبِّرْ\" يُرِيدُ: اَلسِّنَّ, فَتَكَلَّمَ حُوَيِّصَةُ, ثُمَّ تَكَلَّمَ مُحَيِّصَةُ, فَقَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-\"إِمَّا أَنْ يَدُوا صَاحِبَكُمْ, وَإِمَّا أَنْ يَأْذَنُوا بِحَرْبٍ\".‏ فَكَتَبَ إِلَيْهِمْ فِي ذَلِكَ .‏ فَكَتَبُوا: إِنَّا وَاَللَّهِ مَا قَتَلْنَاهُ, فَقَالَ لِحُوَيِّصَةَ, وَمُحَيِّصَةُ, وَعَبْدِ اَلرَّحْمَنِ بْنَ سَهْلٍ: \"أَتَحْلِفُونَ, وَتَسْتَحِقُّونَ دَمَ صَاحِبَكُمْ?\" قَالُوا: لَا.‏ قَالَ: \"فَتَحْلِفُ لَكُمْ يَهُودُ?\" قَالُوا: لَيْسُوا مُسْلِمِينَ فَوَدَاهُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-مِنْ عِنْدِهِ, فَبَعَثَ إِلَيْهِمْ مَائَةَ نَاقَةٍ.‏ قَالَ سَهْلٌ: فَلَقَدْ رَكَضَتْنِي مِنْهَا نَاقَةٌ حَمْرَاءُ }  مُتَّفَقٌ عَلَيْهِ.‏  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (7192)‏، ومسلم (1669)‏ (6)‏.‏","english":{"narrator":"Sahl bin Abi Khaithamah (RAA) narrated on the authority of some honored men from his people that 'Abdullah bin Sahl and Muhaiysah bin Mas'ud, went out to Khaibar because of a hardship they were undergoing. Muhaiysah came and told them that 'Abdullah bin Sahl had been killed and thrown into a well. He came to the Jews and said to them, ‘I swear by Allah that you have killed him.’ They replied, ‘We swear by Allah that we have not killed him.' Then Muhaiysah came along with his brother Huwaiysah and 'Abdur Rahman bin Sahl to the Prophet (ﷺ) and Muhaiysah started to talk. The Messenger of Allah (ﷺ) said to him, “Let an older one speak (take charge of this matter).” So Huwaiysah narrated what happened and then Muhaiysah spoke. The Messenger of Allah (ﷺ) said:","text":"“Either they pay the Diyah of your companion or be ready for war.” The Messenger of Allah (ﷺ) wrote to them about this and they wrote back saying, ‘By Allah, we have not killed him.’ The Messenger of Allah (ﷺ) then said to Huwaiysah, Muhaiysah and 'Abdur Rahman bin Sahl, “Would you take an oath (that they killed him) and then you will be entitled to the Diyah of your companion” 'They answered, ‘No (as they did not witness the crime).’The Messenger of Allah then said, “Then the Jews should take an oath (that they are innocent).” They said, ‘They are not Muslims.’ The Messenger of Allah (ﷺ) thereupon paid the Diyah of the victim himself and sent them 100 camels. Sahl commented, ‘A red she-camel (of these 100 camels) kicked me.’ Agreed upon."}},{"id":34,"idInBook":34,"chapterId":9,"bookId":17,"arabic":"وَعَنْ رَجُلٍ مِنْ اَلْأَنْصَارِ; { أَنَّ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-أَقَرَّ اَلْقَسَامَةَ عَلَى مَا كَانَتْ عَلَيْهِ فِي اَلْجَاهِلِيَّةِ, وَقَضَى بِهَا رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-بَيْنَ نَاسٍ مِنَ اَلْأَنْصَارِ فِي قَتِيلٍ اِدَّعَوْهُ عَلَى اَلْيَهُودِ }  رَوَاهُ مُسْلِمٌ.‏  1‏‏1 ‏- صحيح.‏ رواه مسلم (1670)‏، وهما عنده روايتان جمعهما الحافظ هنا.‏","english":{"narrator":"","text":"A man from the Ansar narrated that The Messenger of Allah (ﷺ) consented to the Qasamah (taking an oath that they did not kill the victim), which was practiced during the time of Jahiliyah (pre-Islam) and the Messenger of Allah (ﷺ) made a judgment between some men from the Ansar concerning a man who was killed and they claimed that the Jews had killed him.’ Related by Muslim."}},{"id":35,"idInBook":35,"chapterId":9,"bookId":17,"arabic":"عَنْ اِبْنِ عُمَرَ رِضَيَ اَللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ حَمَلَ عَلَيْنَا اَلسِّلَاحَ, فَلَيْسَ مِنَّا }  مُتَّفَقٌ عَلَيْهِ .‏  1‏‏1 ‏- صحيح رواه البخاري (6874)‏، ومسلم (98)‏.‏","english":{"narrator":"Ibn 'Umar (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"“Whoever carries arms against us, is not one of us.” Agreed upon."}},{"id":36,"idInBook":36,"chapterId":9,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- عَنْ اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-قَالَ: { مَنْ خَرَجَ عَنْ اَلطَّاعَةِ, وَفَارَقَ اَلْجَمَاعَةَ, وَمَاتَ, فَمِيتَتُهُ مِيتَةٌ جَاهِلِيَّةٌ }  أَخْرَجَهُ مُسْلِمٌ.‏  1‏‏1 ‏- صحيح رواه مسلم (1848)‏ وعنده: \"من الطاعة\" وأيضا: \"فمات، مات ميتة جاهلية\" وزاد: \"ومن مات تحت راية عمية، يغضب لعصبة، أو يدعو إلى عصبة، فقتل، فقتلة جاهلية، ومن خرج على أمتي يضرب برها وفاجرها، ولا يتحاشى من مؤمنها، ولا يفي لذي عهد عهده، فليس مني ولست منه \".‏","english":{"narrator":"","text":"Abd Hurairah (RAA) narrated, “He who rebels against obedience to the ruler, abandons the Muslim community and then dies, his death will be as if he died at the time of Jahiliyah.” Related by Muslim."}},{"id":37,"idInBook":37,"chapterId":9,"bookId":17,"arabic":"وَعَنْ أَمِّ سَلَمَةَ رَضِيَ اَللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ تَقْتُلُ عَمَّارًا اَلْفِئَةُ اَلْبَاغِيَةُ }  رَوَاهُ مُسْلِمٌ  1‏ .‏‏1 ‏- صحيح رواه مسلم (2916)‏ (73)‏.‏","english":{"narrator":"Umm Salamah (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"“The transgressing party will kill 'Ammar ('Ammar bin Yasir).” Related by Muslim."}},{"id":38,"idInBook":38,"chapterId":9,"bookId":17,"arabic":"وَعَنْ اِبْنِ عُمَرَ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ هَلْ تَدْرِي يَا اِبْنَ أُمِّ عَبْدٍ, كَيْفَ حُكْمُ اَللَّهِ فِيمَنْ بَغَى مِنْ هَذِهِ اَلْأُمَّةِ? \n\", قَالَ: اَللَّهُ وَرَسُولُهُ أَعْلَمُ.‏ قَالَ: \"لَا يُجْهَزُ عَلَى جَرِيحِهَا, وَلَا يُقْتَلُ أَسِيرُهَا, وَلَا يُطْلَبُ هَارِبُهَا, وَلَا يُقْسَمُ فَيْؤُهَا }  رَوَاهُ اَلْبَزَّارُ و اَلْحَاكِمُ وَصَحَّحَهُ فَوَهِمَ; فَإِنَّ فِي إِسْنَادِهِ كَوْثَرَ بْنَ حَكِيمٍ, وَهُوَ مَتْرُوكٌ  1‏ .‏‏1 ‏- ضعيف جدا.‏ رواه البزار (1849 زوائد)‏، والحاكم (255)‏، واللفظ للبزار، وآفته كما ذكر الحافظ رحمه الله.‏","english":{"narrator":"","text":"Ibn 'Umar (RAA) narrated that The Messenger of Allah (ﷺ) said “Do you realize Ibn Umm ’Abd what the ruling of Allah is concerning those who rebel against the ruler in this Ummah?’ I said, ‘Allah and His Messenger know best. ‘He said, “A wounded man among them is not to be given the last stroke (that kills him), their captive is not killed, the one who runs away is not followed and their booties are not divided (among other Muslims).” Related by Al-Bazzar and al-Hakim. The latter graded it as Sahih but he was mistaken as Kawthar bin Hakim (one of the narrators) is a rejected narrator."}},{"id":39,"idInBook":39,"chapterId":9,"bookId":17,"arabic":"وَصَحَّ عَنْ عَلِيٍّ مِنْ طُرُقٍ نَحْوُهُ مَوْقُوفًا.‏ أَخْرَجَهُ اِبْنُ أَبِي شَيْبَةَ, وَالْحَاكِمُ  1‏ .‏‏1 ‏- انظر \"المصنف\" (1563)‏، \"والمستدرك\" (255)‏، و \"السنن الكبرى\" للبهيقي (881)‏.‏","english":{"narrator":"","text":"And it is authentic from similar chains as Mawquf (saying of a Companion) related by Ibn Abi Shaybah and Al-Hakim."}},{"id":40,"idInBook":40,"chapterId":9,"bookId":17,"arabic":"وَعَنْ عَرْفَجَةَ بْنِ شُرَيْحٍ: سَمِعْتُ رَسُولَ اَللَّهِ ‏- صلى الله عليه وسلم ‏-يَقُولُ: { مَنْ أَتَاكُمْ وَأَمَرَكُمْ جَمِيعٌ, يُرِيدُ أَنْ يُفَرِّقَ جَمَاعَتَكُمْ, فَاقْتُلُوهُ }  أَخْرَجَهُ مُسْلِمٌ .‏  1‏ .‏‏1 ‏- صحيح رواه مسلم (1852)‏ (60)‏ وزاد: \"على رجل واحد، يريد أن يشق عصاكم، أو\" بعد قوله: \"جميع\".‏","english":{"narrator":"","text":"Arfajah bin Shuraih (RAA) narrated, ‘I heard the Messenger of Allah (ﷺ) say, “He who comes to you when you are united and wants to disunite your community, kill him.” Related by Muslim."}},{"id":41,"idInBook":41,"chapterId":9,"bookId":17,"arabic":"عَنْ عَبْدِ اَللَّهِ بْنِ عَمْرٍو رَضِيَ اَللَّهُ عَنْهُمَا  1‏ قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مِنْ قُتِلَ دُونَ مَالِهِ فَهُوَ شَهِيدٌ }  رَوَاهُ أَبُو دَاوُدَ, وَالنَّسَائِيُّ, وَاَلتِّرْمِذِيُّ وَصَحَّحَهُ  2‏ .‏‏1 ‏- كذا بالأصل، وفي \"أ\": \"عبد الله بن عمر\" وانظر للترجيح التعليق التالي.‏‏2 ‏- صحيح.‏ ولكن فيه إشكال، فاسم الصحابي اختلف فيه بين النسختين كما تقدم، والذي يترجح لدي أنه: \"عبد الله بن عمرو\" وذلك لصحة الأصل؛ إذ هو منقول مباشرة من خط الحافظ، وأيضا لرواية من ذكرهم الحافظ الحديث عن ابن عمرو وبناء على هذا الرأي، فهذا التخريج.‏ رواه أبو داود (4771)‏، والنسائي (715)‏، والترمذي (1419)‏ واللفظ للنسائي والترمذي.‏ وقال الترمذي: \"حديث حسن \".‏ ولفظ أبي داود: \"من أريد ماله بغير حق، فقاتل فقتل، فهو شهيد\".‏ وهو أيضا رواية للنسائي، والترمذي وقال: \"حديث حسن صحيح\".‏ وأخيرا لابد من التنبيه إلى أن الحديث باللفظ الذي ذكره الحافظ.‏ رواه البخاري (2480)‏، ومسلم (141)‏، ومن حديث عبد الله بن عمرو.‏ وأما إن كان الصحابي \"عبد الله بن عمر\" كما في النسخة (أ)‏ ‏- وهذا هو الذي اعتمده شارح \"البلوغ\" فقال: وأخرجه البخاري من حديث عبد الله بن عمرو بن العاص ‏- فلم يروه أحد ممن ذكرهم الحافظ.‏ وإنما حديث ابن عمر عند ابن ماجه فقط (2581)‏، ولفظه: \"من أتي عند ماله فقوتل فقاتل، فقتل، فهو شهيد\" وهو صحيح، وإن كان عند ابن ماجه بإسناد ضعيف.‏ وانظر الحديث الآتي برقم (1256)‏.‏","english":{"narrator":"'Abdullah bin 'Umar narrated that The Messenger of Allah (ﷺ) said:","text":"“He who is killed while defending his property is considered a martyr.” Related by Abu Dawud An-Nasa’i and At-Tirmidhi who graded it as Sahih."}},{"id":42,"idInBook":42,"chapterId":9,"bookId":17,"arabic":"وَعَنْ عِمْرَانَ بْنِ حُصَيْنٍ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { قَاتَلَ يُعْلَى بْنُ أُمِّيَّةَ رَجُلًا, فَعَضَّ أَحَدُهُمَا صَاحِبَهُ, فَنَزَعَ ثَنِيَّتَهُ, فَاخْتَصَمَا إِلَى اَلنَّبِيِّ ‏- صلى الله عليه وسلم ‏-فَقَالَ: \n\"أَيَعَضُّ أَحَدُكُمْ أَخَاهُ كَمَا يَعَضُّ اَلْفَحْلُ? لَا دِيَةَ لَهُ\" }  مُتَّفَقٌ عَلَيْهِ, وَاللَّفْظُ لِمُسْلِمٍ.‏  1‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (6892)‏، وزاد مسلم (1673)‏، وزاد مسلم: \"فانتزع يده من فمه\" بعد قوله: \"صاحبه\"، وليس عنده لفظ: \"أخاه\" وهو عند البخاري.‏","english":{"narrator":"","text":"'Imran bin Husain (RAA) narrated, ’Ya’la bin Umaiyah fought with another man. One of them bit the other man’s finger and the latter (whose finger was bit) pulled his hand out of the first man’s mouth (who was biting) by force, causing his incisors teeth to be pulled out. They presented their dispute to the Prophet who said, “One of you bit his brother as a male camel bites? Go and there is not Diyah for him (as a punishment for their foolishness).’Agreed upon and the wording is from Muslim."}},{"id":43,"idInBook":43,"chapterId":9,"bookId":17,"arabic":"وَعَنْ أَبِي هُرَيْرَةَ ‏- رضى الله عنه ‏- قَالَ: قَالَ أَبُو اَلْقَاسِمِ ‏- صلى الله عليه وسلم ‏-{ لَوْ أَنَّ اِمْرَأً اِطَّلَعَ عَلَيْكَ بِغَيْرِ إِذْنٍ, فَحَذَفْتَهُ بِحَصَاةٍ, فَفَقَأْتَ عَيْنَهُ, لَمْ يَكُنْ عَلَيْكَ جُنَاحٌ }  مُتَّفَقٌ عَلَيْهِ  1‏ .‏ وَفِي لَفْظٍ لِأَحْمَدَ, وَالنَّسَائِيِّ, وَصَحَّحَهُ اِبْنُ حِبَّانَ: { فَلَا دِيَةَ لَهُ وَلَا قِصَاصَ }  .‏  2‏ .‏‏1 ‏- صحيح رواه البخاري (6902)‏، ومسلم (2158)‏.‏‏2 ‏- صحيح رواه أحمد (243)‏، والنسائي (8 /61)‏.‏ وابن حبان (5972)‏.‏","english":{"narrator":"Abu Hurairah (RAA) narrated that The Messenger of Allah (ﷺ) said:","text":"“If anyone spies on you (tries to look at you) without your permission, and you thereupon throw a stone at him and because of it he lost his eye, you are not to be bIamed.” Agreed upon. In another version by Ahmad and an-Nasa'i and graded as Sahih by Ibn Hibban, “He has no right for Diyah or Qisas.”"}},{"id":44,"idInBook":44,"chapterId":9,"bookId":17,"arabic":"وَعَنْ اَلْبَرَاءِ بْنِ عَازِبٍ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: { قَضَى رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-أَنَّ حِفْظَ اَلْحَوَائِطِ بِالنَّهَارِ عَلَى أَهْلِهَا, وَأَنْ حِفْظَ اَلْمَاشِيَةِ بِاللَّيْلِ عَلَى أَهْلِهَا, وَأَنَّ عَلَى أَهْلِ اَلْمَاشِيَةِ مَا أَصَابَتْ مَاشِيَتُهُمْ بِاللَّيْلِ }  رَوَاهُ أَحْمَدُ, وَالْأَرْبَعَةُ إِلَّا اَلتِّرْمِذِيُّ,  1‏ .‏ وَصَحَّحَهُ اِبْنُ حِبَّانَ وَفِي إِسْنَادِهِ اِخْتِلَافٌ.‏  2‏ .‏‏1 ‏- كذا بالأصل، وفي \"أ\": \"رواه الخمسة إلا الترمذي\".‏‏2 ‏- صحيح.‏ والخلاف المشار إليه هو في وصله وإرساله، ولكنه جاء بسند صحيح موصول كما عند أبي داود وابن ماجه وغيرهما، وفي الأصل تفصيل لطرق الحديث.‏","english":{"narrator":"","text":"Al-Bara bin 'Azib (RAA) narrated, ‘The Messenger of Allah (ﷺ) ordained that the guarding of a garden is the responsibility of its owners during the day and the guarding of animals is the responsibility of their owners at night. However, the owners of the animals are responsible for any damage caused by their animals during the night (i.e. pay compensation for what they damaged of other’s property).’ Related by Ahmad and the four Imams except At-Tirmidhi. Ibn Hibban graded it as Sahih."}},{"id":45,"idInBook":45,"chapterId":9,"bookId":17,"arabic":"وَعَنْ مُعَاذِ بْنِ جَبَلٍ ‏- رضى الله عنه ‏- ‏-فِي رَجُلٍ أَسْلَمَ ثُمَّ تَهَوَّدَ‏-: { لَا أَجْلِسُ حَتَّى يُقْتَلَ, قَضَاءُ اَللَّهِ وَرَسُولِهِ, فَأُمِرَ بِهِ, فَقُتِلَ.‏ مُتَّفَقٌ عَلَيْهِ }  .‏  1‏ .‏\nوَفِي رِوَايَةٍ لِأَبِي دَاوُدَ: { وَكَانَ قَدْ اُسْتُتِيبَ قَبْلَ ذَلِكَ }  .‏  2‏ .‏‏1 ‏- صحيح.‏ رواه البخاري (6923)‏، ومسلم (3456 ‏- 1457/رقم 15)‏، وهو بتمامه من طريق أبي بردة قال: قال أبو موسى: أقبلت إلى النبي صلى الله عليه وسلم ومعي رجلان من الأشعريين، أحدهما عن يميني، والآخر عن يساري، فكلاهما سأل العمل.‏ والنبي صلى الله عليه وسلم يستاك.‏ فقال: \"ما تقول يا أبا موسى! أو يا عبد الله بن قيس\"؟ قال: فقلت: والذي بعثك بالحق! ما أطلعاني على ما في أنفسهما.‏ وما شعرت أنهما يطلبان العمل.‏ قال: وكأني أنظر إلى سواكه تحت شفته، وقد قلصت.‏ فقال: \"لن.‏ أو لا نستعمل على عملنا من أراده.‏ ولكن اذهب أنت يا أبا موسى.‏ أو يا عبد الله بن قيس\" فبعثه على اليمن.‏ ثم أتبعه معاذ بن جبل، فلما قدم عليه قال: انزل.‏ وألقى له وسادة.‏ وإذا رجل عنده موثق.‏ قال: ما هذا؟ قال: هذا كان يهوديا فأسلم، ثم راجع دينه؛ دين السوء.‏ فتهود.‏ قال: لا أجلس حتى يقتل.‏ قضاء الله ورسوله.‏ فقال: اجلس.‏ نعم.‏ قال: لا أجلس حتى يقتل.‏ قضاء الله ورسوله (ثلاث مرات)‏ فأمر به.‏ فقتل.‏ ثم تذاكرا القيام من الليل.‏ قال أحدهما؛ معاذ: أما أنا فأنام وأقوم، وأرجو في نومتي ما أرجو في قومتي.‏\n‏2 ‏- صحيح.‏ رواه أبو داود (4355)‏.‏","english":{"narrator":"","text":"Mu’adh bin Jabal (RAA) narrated - concerning a man who embraced Islam and then turned to Judaism (i.e. apostated), ‘I shall not sit down until he is killed. That is the Command of Allah and His Messenger, and he gave an order that he must be killed and so he was.’ Agreed upon. In a version by Abu Dawud, ‘He was given a chance to repent and return to Islam but he refused.’"}},{"id":46,"idInBook":46,"chapterId":9,"bookId":17,"arabic":"وَعَنْ اِبْنِ عَبَّاسٍ رَضِيَ اَللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-{ مَنْ بَدَّلَ دِينَهُ فَاقْتُلُوهُ }  رَوَاهُ اَلْبُخَارِيُّ","english":{"narrator":"","text":"Ibn 'Abbas (RAA) narrated that The Messenger of Allah said, “He who changes his religion (i.e. apostates) kill him.” Related by Al-Bukhari."}},{"id":47,"idInBook":47,"chapterId":9,"bookId":17,"arabic":"وَعَنْ اِبْنِ عَبَّاسٍ; { أَنَّ أَعْمَى كَانَتْ لَهُ أُمُّ وَلَدَ تَشْتُمُ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-وَتَقَعُ فِيهِ, فَيَنْهَاهَا, فَلَا تَنْتَهِي, فَلَمَّا كَانَ ذَاتَ لَيْلَةٍ أَخْذَ اَلْمِعْوَلَ, فَجَعَلَهُ فِي بَطْنِهَا, وَاتَّكَأَ عَلَيْهَا.‏  1‏ فَقَتَلَهَا فَبَلَغَ ذَلِكَ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-فَقَالَ:\"أَلَّا اِشْهَدُوا أَنَّ دَمَهَا هَدَرٌ }  .‏ رَوَاهُ أَبُو دَاوُدَ وَرُوَاتُهُ ثِقَاتٌ.‏  2‏‏1 ‏- .‏ صحيح رواه البخاري (6922)‏ من طريق عكرمة قال: أتى علي رضي الله عنه بزنادقة فأحرقهم، فبلغ ذلك ابن عباس، فقال: لو كنت أنا لم أحرقهم؛ لنهي رسول الله صلى الله عليه وسلم: \"لا تعذبوا بعذاب الله\"، ولقتلتهم لقول رسول الله صلى الله عليه وسلم: فذكره .‏‏2 ‏- صحيح رواه أبو داود (4361)‏ .‏","english":{"narrator":"","text":"Ibn 'Abbas (RAA) narrated, ‘A blind man had a pregnant slave, who used to abuse the Messenger of Allah (ﷺ) and defame him. The blind man forbade her but she did not stop. One night she began to slander the Prophet (ﷺ) so he took an axe, placed it on her belly, pressed it and killed her. The Messenger of Allah (ﷺ) was told about it, and thereupon he said, “Oh people! Be witnesses that no Diyah is to be paid for her blood.” Related by Abu Dawud with a trustworthy chain of narrators."}}],"chapter":{"id":9,"bookId":17,"arabic":"كتاب الجنايات","english":"Crimes (Qisas or Retaliation)"}}