{"metadata":{"length":27,"arabic":{"title":"سنن الدارمي","author":"الإمام أبو محمد عبد الرحمن بن عبد الله بن الدارمي","introduction":"وَمِنْ كِتَابِ الرُّؤْيَا"},"english":{"title":"Sunan al-Darimi","author":"Imam Abu Muhammad Abd al-Rahman ibn Abd Allah ibn al-Darimi","introduction":""}},"hadiths":[{"id":1,"idInBook":1,"chapterId":10,"bookId":9,"arabic":"أَخْبَرَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ  ، حَدَّثَنَا أَبَانُ  ، حَدَّثَنَا يَحْيَى  ، عَنْ أَبِي سَلَمَةَ  ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ  ، قَالَ : قُلْتُ : يَا نَبِيَّ اللَّهِ، قَوْلُ اللَّهِ : # لَهُمُ الْبُشْرَى فِي الْحَيَاةِ الدُّنْيَا سورة يونس آية 64 #، فَقَالَ : \" سَأَلْتَنِي عَنْ شَيْءٍ مَا سَأَلَنِي عَنْهُ أَحَدٌ قَبْلَكَ أَوْ أَحَدٌ مِنْ أُمَّتِي، قَالَ :هِيَ الرُّؤْيَا الصَّالِحَةُ، يَرَاهَا الْمُسْلِمُ أَوْ تُرَى لَهُ \"","english":{"narrator":"","text":""}},{"id":2,"idInBook":2,"chapterId":10,"bookId":9,"arabic":"أَخْبَرَنَا الْأَسْوَدُ بْنُ عَامِرٍ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ قَتَادَةَ  ، عَنْ أَنَسٍ  ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ  ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" رُؤْيَا الْمُؤْمِنِ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنْ النُّبُوَّةِ \"","english":{"narrator":"","text":""}},{"id":3,"idInBook":3,"chapterId":10,"bookId":9,"arabic":"حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ  ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ  ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي يَزِيدَ  ، عَنْ أَبِيهِ  ، عَنْ سِبَاعِ بْنِ ثَابِتٍ  ، عَنْ أُمِّ كُرْزٍ الْكَعْبِيَّةِ  ، قَالَتْ : سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ :\" ذَهَبَتْ النُّبُوَّةُ وَبَقِيَتْ الْمُبَشِّرَاتُ \"","english":{"narrator":"","text":""}},{"id":4,"idInBook":4,"chapterId":10,"bookId":9,"arabic":"أَخْبَرَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا سُفْيَانُ  ، عَنْ أَبِي إِسْحَاق  ، عَنْ أَبِي الْأَحْوَصِ  ، عَنْ عَبْدِ اللَّهِ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" مَنْ رَآنِي فِي الْمَنَامِ، فَقَدْ رَآنِي، فَإِنَّ الشَّيْطَانَ لَا يَتَمَثَّلُ مِثْلِي \"","english":{"narrator":"","text":""}},{"id":5,"idInBook":5,"chapterId":10,"bookId":9,"arabic":"أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُصَفَّى  ، حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ  ، عَنْ الزُّبَيْدِيِّ  ، عَنْ الزُّهْرِيِّ  ، عَنْ أَبِي سَلَمَةَ  ، عَنْ أَبِي قَتَادَةَ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" مَنْ رَآنِي فِي الْمَنَامِ، فَقَدْ رَأَى الْحَقَّ \"","english":{"narrator":"","text":""}},{"id":6,"idInBook":6,"chapterId":10,"bookId":9,"arabic":"أَخْبَرَنَا أَبُو الْمُغِيرَةِ  ، حَدَّثَنَا الْأَوْزَاعِيُّ  ، عَنْ يَحْيَى  ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ  ، عَنْ أَبِيهِ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" الرُّؤْيَا الصَّالِحَةُ مِنْ اللَّهِ، وَالْحُلْمُ مِنْ الشَّيْطَانِ، فَإِذَا حَلَمَ أَحَدُكُمْ حُلْمًا يَخَافُهُ، فَلْيَبْصُقْ عَنْ شِمَالِهِ ثَلَاثَ مَرَّاتٍ، وَلْيَتَعَوَّذْ بِاللَّهِ مِنْ الشَّيْطَانِ، فَإِنَّهَا لَا تَضُرُّهُ \"","english":{"narrator":"","text":""}},{"id":7,"idInBook":7,"chapterId":10,"bookId":9,"arabic":"أَخْبَرَنَا أَبُو الْوَلِيدِ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ عَبْدِ رَبِّهِ بْنِ سَعِيدٍ  ، قَالَ : سَمِعْتُ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ  يَقُولُ : إِنْ كُنْتُ لَأَرَى الرُّؤْيَا تُمْرِضُنِي، فَذَكَرْتُ ذَلِكَ لِأَبِي قَتَادَةَ  ، قَالَ : وَأَنَا إِنْ كُنْتُ لَأَرَى الرُّؤْيَا تُمْرِضُنِي حَتَّى سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ :\" الرُّؤْيَا الصَّالِحَةُ مِنْ اللَّهِ، فَإِذَا رَأَى أَحَدُكُمْ مَا يُحِبُّ، فَلْيَحْمَدْ اللَّهَ، وَلَا يُحَدِّثْ بِهَا إِلَّا مَنْ يُحِبُّ، وَإِذَا رَأَى مَا يَكْرَهُه، فَلْيَتْفُلْ عَنْ يَسَارِهِ ثَلَاثًا، وَلْيَتَعَوَّذْ بِاللَّهِ مِنْ شَرِّهَا، وَلَا يُحَدِّثْ بِهَا أَحَدًا، فَإِنَّهَا لَنْ تَضُرَّهُ \"","english":{"narrator":"","text":""}},{"id":8,"idInBook":8,"chapterId":10,"bookId":9,"arabic":"أَخْبَرَنَا مُحَمَّدُ بْنُ كَثِيرٍ  ، عَنْ مَخْلَدِ بْنِ حُسَيْنٍ  ، عَنْ هِشَامٍ  ، عَنْ ابْنِ سِيرِينَ  ، عَنْ أَبِي هُرَيْرَةَ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" الرُّؤْيَا ثَلَاثٌ : فَالرُّؤْيَا الْحَسَنَةُ بُشْرَى مِنْ اللَّهِ، وَالرُّؤْيَا تَحْزِينٌ مِنْ الشَّيْطَانِ، وَالرُّؤْيَا مِمَّا يُحَدِّثُ بِهِ الْإِنْسَانُ نَفْسَهُ، فَإِذَا رَأَى أَحَدُكُمْ مَا يَكْرَهُهُ، فَلَا يُحَدِّثْ بِهِ، وَلْيَقُمْ، وَلْيُصَلِّ \"","english":{"narrator":"","text":""}},{"id":9,"idInBook":9,"chapterId":10,"bookId":9,"arabic":"أَخْبَرَنَا مُحَمَّدُ بْنُ كَثِيرٍ  ، عَنْ مَخْلَدِ بْنِ حُسَيْنٍ  ، عَنْ هِشَامٍ  ، عَنْ ابْنِ سِيرِينَ  ، عَنْ أَبِي هُرَيْرَةَ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" إِذَا اقْتَرَبَ الزَّمَانُ، لَمْ تَكَدْ رُؤْيَا الْمُؤْمِنِ تَكْذِبُ، وَأَصْدَقُهُمْ رُؤْيَا أَصْدَقُهُمْ حَدِيثًا \"","english":{"narrator":"","text":""}},{"id":10,"idInBook":10,"chapterId":10,"bookId":9,"arabic":"أَخْبَرَنَا أَبُو نُعَيْمٍ  ، حَدَّثَنَا إِسْرَائِيلُ  ، عَنْ عَبْدِ الْأَعْلَى  ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ  ،  عَنْ عَلِيٍّ  ، يَرْفَعُ الْحَدِيثَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" مَنْ كَذَبَ فِي حُلْمِهِ، كُلِّفَ عَقْدَ شَعِيرة يَوْمَ الْقِيَامَةِ \"","english":{"narrator":"","text":""}},{"id":11,"idInBook":11,"chapterId":10,"bookId":9,"arabic":"أَخْبَرَنَا مَرْوَانُ بْنُ مُحَمَّدٍ  ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ  ، عَنْ عَمْرِو بْنِ الْحَارِثِ  ، عَنْ دَرَّاجٍ أَبِي السَّمْحِ  ، عَنْ أَبِي الْهَيْثَمِ  ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ  ، قَالَ : قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ :\" أَصْدَقُ الرُّؤْيَا بِالْأَسْحَارِ \"","english":{"narrator":"","text":""}},{"id":12,"idInBook":12,"chapterId":10,"bookId":9,"arabic":"أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ  ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ  ، حَدَّثَنَا سَعِيدٌ  ، عَنْ قَتَادَةَ  ، عَنْ ابْنِ سِيرِينَ  ، عَنْ أَبِي هُرَيْرَةَ  ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، أَنَّهُ كَانَ يَقُولُ :\" لَا تَقُصُّوا الرُّؤْيَا إِلَّا عَلَى عَالِمٍ، أَوْ نَاصِحٍ \"","english":{"narrator":"","text":""}},{"id":13,"idInBook":13,"chapterId":10,"bookId":9,"arabic":"أَخْبَرَنَا هَاشِمُ بْنُ الْقَاسِمِ  ، حَدَّثَنَا شُعْبَةُ  ، عَنْ يَعْلَى بْنِ عَطَاءٍ  ، قَالَ : سَمِعْتُ وَكِيعَ بْنَ عُدُسٍ  يُحَدِّثُ، عَنْ عَمِّهِ أَبِي رَزِينٍ الْعُقَيْلِيِّ  ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ :\" الرُّؤْيَا هِيَ عَلَى رِجْلِ طَائِرٍ مَا لَمْ يُحَدَّثْ بِهَا، فَإِذَا حُدِّثَ بِهَا، وَقَعَتْ \"","english":{"narrator":"","text":""}},{"id":14,"idInBook":14,"chapterId":10,"bookId":9,"arabic":"أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُبَارَكِ  ، حَدَّثَنِي الْوَلِيدُ بْنُ مُسَلْمِ  ، حَدَّثَنِي ابْنُ جَابِرٍ  ، عَنْ خَالِدِ بْنِ اللَّجْلَاجِ  ، وَسَأَلَهُ مَكْحُولٌ أَنْ يُحَدِّثَهُ قَالَ : سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ عَائِشٍ   يَقُولُ : سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ :\" رَأَيْتُ رَبِّي فِي أَحْسَنِ صُورَةٍ، قَالَ : فِيمَ يَخْتَصِمُ الْمَلَأُ الْأَعْلَى؟ فَقُلْتُ : أَنْتَ أَعْلَمُ يَا رَبِّ، قَالَ : فَوَضَعَ كَفَّهُ بَيْنَ كَتِفَيَّ، فَوَجَدْتُ بَرْدَهَا بَيْنَ ثَدْيَيَّ ، فَعَلِمْتُ مَا فِي السَّمَوَاتِ وَالْأَرْضِ، وَتَلَا : # وَكَذَلِكَ نُرِي إِبْرَاهِيمَ مَلَكُوتَ السَّمَوَاتِ وَالأَرْضِ وَلِيَكُونَ مِنَ الْمُوقِنِينَ سورة الأنعام آية 75 # \"","english":{"narrator":"","text":""}},{"id":15,"idInBook":15,"chapterId":10,"bookId":9,"arabic":"أَخْبَرَنَا نُعَيْمُ بْنُ حَمَّادٍ، عَنْ عَبْدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ قُطْبَةَ، عَنْ يُوسُفَ، عَنْ ابْنِ سِيرِينَ ، قَالَ : \"مَنْ رَأَى رَبَّهُ فِي الْمَنَامِ، دَخَلَ الْجَنَّةَ \"","english":{"narrator":"","text":""}},{"id":16,"idInBook":16,"chapterId":10,"bookId":9,"arabic":"أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ  ، حَدَّثَنَا إِبْرَاهِيمُ هُوَ ابْنُ سَعْدٍ  ، عَنْ صَالِحِ بْنِ كَيْسَانَ  ، عَنْ ابْنِ شِهَابٍ  ، عَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ  ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ  ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ :\" بَيْنَا أَنَا نَائِمٌ، رَأَيْتُ النَّاسَ يُعْرَضُونَ عَلَيَّ وَعَلَيْهِمْ قُمُصٌ، مِنْهَا مَا يَبْلُغُ الثُّدِيَّ، وَمِنْهَا مَا يَبْلُغُ دُونَ ذَلِكَ، وَعُرِضَ عَلَيَّ عُمَرُ بْنُ الْخَطَّابِ وَعَلَيْهِ قَمِيصٌ يَجُرُّهُ \"، فَقَالَ مَنْ حَوْلَهُ : فَمَاذَا تَأَوَّلْتَ ذَلِكَ يَا رَسُولَ اللَّهِ؟ قَالَ : \" الدِّينَ \"","english":{"narrator":"","text":""}},{"id":17,"idInBook":17,"chapterId":10,"bookId":9,"arabic":"أَخْبَرَنَا أَبُو عَلِيٍّ الْحَنَفِيُّ  ، حَدَّثَنَا عَبْدُ اللَّهِ هُوَ ابْنُ عُمَرَ  ، عَنْ نَافِعٍ  : أَنَّ ابْنَ عُمَرَ  ، قَالَ : كُنْتُ فِي عَهْدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَا لِي مَبِيتٌ إِلَّا فِي مَسْجِدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، وَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَصْبَحَ يَأْتُونَهُ فَيَقُصُّونَ عَلَيْهِ الرُّؤْيَا، قَالَ : فَقُلْتُ : مَا لِي لَا أَرَى شَيْئًا؟ فَرَأَيْتُ كَأَنَّ النَّاسَ يُحْشَرُونَ فَيُرْمَى بِهِمْ عَلَى أَرْجُلِهِمْ فِي رَكِيٍّ فَأُخِذْتُ، فَلَمَّا دَنَى إِلَى الْبِئْرِ، قَالَ رَجُلٌ : خُذُوا بِهِ ذَاتَ الْيَمِينِ، فَلَمَّا اسْتَيْقَظْتُ، هَمَّتْنِي رُؤْيَايَ وَأَشْفَقْتُ مِنْهَا، فَسَأَلْتُ حَفْصَةَ عَنْهَا، فَقَالَتْ : نِعْمَ مَا رَأَيْتَ.\nفَقُلْتُ لَهَا : سَلِي النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَسَأَلَتْهُ، فَقَالَ :\" نِعْمَ الرَّجُلُ عَبْدُ اللَّهِ، لَوْ كَانَ يُصَلِّي مِنْ اللَّيْلِ \".\nحَدَّثَنَا مُوسَى بْنُ خَالِدٍ  ، عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدٍ الْفَزَارِيِّ  ، عَنْ عُبَيْدِ اللَّهِ  ، عَنْ نَافِعٍ  ، عَنْ ابْنِ عُمَرَ  ، بِهَذَا الْحَدِيثِ.\n قَالَ ابْنُ عُمَرَ : وَكُنْتُ إِذَا نِمْتُ، لَمْ أَقُمْ حَتَّى أُصْبِحَ.\nقَالَ نَافِعٌ : وَكَانَ ابْنُ عُمَرَ يُصَلِّي اللَّيْلَ","english":{"narrator":"","text":""}},{"id":18,"idInBook":18,"chapterId":10,"bookId":9,"arabic":"أَخْبَرَنَا مُحَمَّدُ بْنُ الصَّلْتِ  ، حَدَّثَنَا ابْنُ الْمُبَارَكِ  ، عَنْ يُونُسَ  ، عَنْ الزُّهْرِيِّ  ، عَنْ حَمْزَةَ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ  ، عَنْ ابْنِ عُمَرَ  ، قَالَ : سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ :\" بَيْنَا أَنَا نَائِمٌ، إِذْ أُتِيتُ بِقَدَحٍ مِنْ لَبَنٍ فَشَرِبْتُ مِنْهُ، حَتَّى إِنِّي لَأَرَى الرِّيَّ فِي ظُفْرِي أَوْ قَالَ : فِي أَظْفَارِي ، ثُمَّ نَاوَلْتُ فَضْلَهُ عُمَرَ \"، فَقَالُوا : يَا رَسُولَ اللَّهِ، مَا أَوَّلْتَهُ؟ قَالَ : \" الْعِلْمَ \"","english":{"narrator":"","text":""}},{"id":19,"idInBook":19,"chapterId":10,"bookId":9,"arabic":"أَخْبَرَنَا الْحَكَمُ بْنُ الْمُبَارَكِ  ، أَخْبَرَنَا الْوَلِيدُ  ، حَدَّثَنَا ابْنُ جَابِرٍ  ، حَدَّثَنِي مُحَمَّدُ بْنُ قَيْسٍ  ، حَدَّثَنِي بَعْضُ   أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ :\" اللَّبَنُ الْفِطْرَةُ، وَالسَّفِينَةُ نَجَاةٌ، وَالْجَمَلُ حُزْنٌ، وَالْخُضْرَةُ الْجَنَّةُ، وَالْمَرْأَةُ خَيْرٌ \"","english":{"narrator":"","text":""}},{"id":20,"idInBook":20,"chapterId":10,"bookId":9,"arabic":"أَخْبَرَنَا مُحَمَّدُ بْنُ كَثِيرٍ  ، حَدَّثَنَا سُلَيْمَانُ هُوَ ابْنُ كَثِيرٍ  ، عَنْ الزُّهْرِيِّ  ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ  ، عَنْ ابْنِ عَبَّاسٍ  ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ مِمَّا يَقُولُ لِأَصْحَابِهِ :\" مَنْ رَأَى مِنْكُمْ رُؤْيَا، فَلْيَقُصَّهَا عَلَيَّ فَأَعْبُرَهَا لَهُ \".\nقَالَ : فَجَاءَ رَجُلٌ فَقَالَ : يَا رَسُولَ اللَّهِ، رَأَيْتُ ظُلَّةً بَيْنَ السَّمَاءِ وَالْأَرْضِ تَنْطِفُ عَسَلًا وَسَمْنًا، وَرَأَيْتُ سَبَبًا وَاصِلًا مِنْ السَّمَاءِ إِلَى الْأَرْضِ، وَرَأَيْتُ أُنَاسًا يَتَكَفَّفُونَ مِنْهَا، فَمُسْتَكْثِرٌ وَمُسْتَقِلٌّ، فَأَخَذْتَ بِهِ فَعَلَوْتَ، فَأَعْلَاكَ اللَّهُ، ثُمَّ أَخَذَ بِهِ الَّذِي بَعْدَكَ فَعَلَا، فَأَعْلَاهُ اللَّهُ، ثُمَّ أَخَذَهُ الَّذِي بَعْدَهُ فَعَلَا، فَأَعْلَاهُ اللَّهُ، ثُمَّ أَخَذَهُ الَّذِي بَعْدَهُ فَقُطِعَ بِهِ، ثُمَّ وُصِلَ فَاتَّصَلَ.\nفَقَالَ أَبُو بَكْرٍ : يَا رَسُولَ اللَّهِ، ائْذَنْ لِي فَأَعْبُرَهَا، فَقَالَ : اعْبُرْهَا.\nوَكَانَ أَعْبَرَ النَّاسِ لِلرُّؤْيَا بَعْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَقَالَ : أَمَّا الظُّلَّةُ فَالْإِسْلَامُ، وَأَمَّا الْعَسَلُ وَالسَّمْنُ فَالْقُرْآنُ : حَلَاوَةُ الْعَسَلِ وَلِينُ السَّمْنِ، وَأَمَّا الَّذِينَ يَتَكَفَّفُونَ مِنْهُ، فَمُسْتَكْثِرٌ وَمُسْتَقِلٌّ فَهُمْ حَمَلَةُ الْقُرْآنِ، وَأَمَّا السَّبَبُ الْوَاصِلُ مِنَ السَّمَاءِ إِلَى الأَرْضِ فَالْحَقُّ الَّذِي أَنْتَ عَلَيْهِ، تَأْخُذُ بِهِ فَيُعْليكَ اللهُ بِهِ، ثُمَّ يَأْخُذُ بِهِ رَجُلٌ مِنْ بَعْدِكَ فَيَعْلُو بِهِ، ثُمَّ يَأَخُذُ بِهِ رَجُلٌ آخَرُ فَيَعْلُو بِهِ، ثُمَّ يَأْخُذُ بِهِ رَجُلٌ آخَرُ فَيَنْقَطِعُ بِهِ، ثُمَّ يُوصَلُ لَهُ فَيَعْلُو بِهِ، فَأَخْبِرْني يَا رَسُولَ اللَّهِ بِأَبِي أَنْتَ أَصَبْتُ أَمْ أَخْطَأْتُ، فَقَالَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" أَصَبْتَ وَأَخْطَأْتَ \".\nفَقَالَ : فَمَا الَّذِي أَصَبْتُ وَمَا الَّذِي أَخْطَأْتُ؟ فَأَبَى أَنْ يُخْبِرَهُ","english":{"narrator":"","text":""}},{"id":21,"idInBook":21,"chapterId":10,"bookId":9,"arabic":"أَخْبَرَنَا مُحَمَّدُ بْنُ مِهْرَانَ  ، حَدَّثَنَا مِسْكِينٌ الْحَرَّانِيُّ  ، عَنْ جَعْفَرِ بْنِ بُرْقَانَ  ، عَنْ يَزِيدَ بْنِ الْأَصَمِّ  ، عَنْ الْعَبَّاسِ بْنِ عَبْدِ الْمُطَّلِبِ  ، فَقَالَ : رَأَيْتُ فِي الْمَنَامِ كَأَنَّ شَمْسًا أَوْ قَمَرًا شَكَّ أَبُو جَعْفَرٍ فِي الْأَرْضِ تُرْفَعُ إِلَى السَّمَاءِ بِأَشْطَانٍ شِدَادٍ، فَذَكَرَ ذَلِكَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ :\" ذَاكَ وَفَاةُ ابْنُ أَخِيكَ يَعْنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَفْسَهُ \"","english":{"narrator":"","text":""}},{"id":22,"idInBook":22,"chapterId":10,"bookId":9,"arabic":"أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ  ، حَدَّثَنَا أَبُو أُسَامَةَ  ، عَنْ بَرِيدَ  ، عَنْ أَبِي بُرْدَةَ  ، عَنْ أَبِي مُوسَى  ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" رَأَيْتُ فِي رُؤْيَايَ هَذِهِ أَنِّي هَزَزْتُ سَيْفًا فَانْقَطَعَ صَدْرُهُ، فَإِذَا هُوَ مَا أُصِيبَ مِنْ الْمُؤْمِنِينَ يَوْمَ أُحُدٍ، ثُمَّ هَزَزْتُهُ أُخْرَى فَعَادَ كَأَحْسَنِ مَا كَانَ، فَإِذَا هُوَ مَا جَاءَ اللَّهُ بِهِ مِنْ الْفَتْحِ وَاجْتِمَاعِ الْمُؤْمِنِينَ، وَرَأَيْتُ فِيهَا أَيْضًا بَقَرًا وَاللَّهِ خَيْرٌ، فَإِذَا هُوَ النَّفَرُ مِنْ الْمُؤْمِنِينَ يَوْمَ أُحُدٍ، وَإِذَا الْخَيْرُ مَا جَاءَ اللَّهُ بِهِ مِنْ الْخَيْرِ، وَثَوَابِ الصِّدْقِ الَّذِي آتَانَا بَعْدَ يَوْمِ بَدْرٍ \"","english":{"narrator":"","text":""}},{"id":23,"idInBook":23,"chapterId":10,"bookId":9,"arabic":"أَخْبَرَنَا الْحَجَّاجُ بْنُ مِنْهَالٍ  ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ  ، حَدَّثَنَا أَبُو الزُّبَيْرِ  ، عَنْ جَابِرٍ   أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ :\" رَأَيْتُ كَأَنِّي فِي دِرْعٍ حَصِينَةٍ، وَرَأَيْتُ بَقَرًا يُنْحَرُ، فَأَوَّلْتُ أَنَّ الدِّرْعَ الْمَدِينَةُ ، وَأَنَّ الْبَقَرَ نَفَرٌ، وَاللَّهِ خَيْرٌ، وَلَوْ أَقَمْنَا بِالْمَدِينَةِ ، فَإِنْ دَخَلُوا عَلَيْنَا، قَاتَلْنَاهُمْ \".\nفَقَالُوا : وَاللَّهِ مَا دُخِلَتْ عَلَيْنَا فِي الْجَاهِلِيَّةِ أَفَتُدْخَلُ عَلَيْنَا فِي الْإِسْلَامِ؟ قَالَ : \" فَشَأْنَكُمْ إِذًا \".\nوَقَالَتْ الْأَنْصَارُ بَعْضُهَا لِبَعْضٍ : رَدَدْنَا عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأْيَهُ، فَجَاؤُوا، فَقَالُوا : يَا رَسُولَ اللَّهِ شَأْنُكَ، فَقَالَ : \" الْآنَ؟ إِنَّهُ لَيْسَ لِنَبِيٍّ إِذَا لَبِسَ لَأْمَتَهُ أَنْ يَضَعَهَا حَتَّى يُقَاتِلَ \"","english":{"narrator":"","text":""}},{"id":24,"idInBook":24,"chapterId":10,"bookId":9,"arabic":"أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الرَّقَاشِيُّ  ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ  ، حَدَّثَنَا سَعِيدٌ  ، عَنْ قَتَادَةَ  ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ  ، عَنْ أَبِي هُرَيْرَةَ  ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ، أَنَّهُ كَانَ يَقُولُ :\" أَكْرَهُ الْغُلَّ، وَأُحِبُّ الْقَيْدَ، الْقَيْدُ ثَبَاتٌ فِي الدِّينِ \"","english":{"narrator":"","text":""}},{"id":25,"idInBook":25,"chapterId":10,"bookId":9,"arabic":"أَخْبَرَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْهَاشِمِيُّ  ، حَدَّثَنَا ابْنُ أَبِي الزِّنَادِ  ، عَنْ مُوسَى بْنِ عُقْبَةَ  ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ  ، عَنْ أَبِيهِ  ، قَالَ : سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ :\" رَأَيْتُ فِي الْمَنَامِ امْرَأَةً سَوْدَاءَ ثَائِرَةَ الشَّعْرِ تَفِلَةً، أُخْرِجَتْ مِنْ الْمَدِينَةِ فَأُسْكِنَتْ مَهْيَعَةَ ، فَأَوَّلْتُهَا وَبَاءَ الْمَدِينَةِ يَنْقُلُهَا اللَّهُ إِلَى مَهْيَعَةَ \"","english":{"narrator":"","text":""}},{"id":26,"idInBook":26,"chapterId":10,"bookId":9,"arabic":"أَخْبَرَنَا مُحَمَّدُ بْنُ الْعَلَاءِ  ، حَدَّثَنَا يَحْيَى بْنُ عَبْدِ الرَّحْمَنِ  ، حَدَّثَنَا عَبِيدَةُ بْنُ الْأَسْوَدِ  ، عَنْ مُجَالِدٍ  ، عَنْ عَامِرٍ  ، عَنْ جَابِرٍ  ، عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، أَنَّهُ قَالَ يَوْمًا مِنْ الْأَيَّامِ :\" رَأَيْتُ فِي الْمَنَامِ أَنَّ رَجُلًا أَتَانِي بِكُتْلَةٍ مِنْ تَمْرٍ فَأَكَلْتُهَا، فَوَجَدْتُ فِيهَا نَوَاةً، فَآذَتْنِي حِينَ مَضَغْتُهَا، ثُمَّ أَعْطَانِي كُتْلَةً أُخْرَى، فَقُلْتُ : إِنَّ الَّذِي أَعْطَيْتَنِي وَجَدْتُ فِيهَا نَوَاةً آذَتْنِي فَأَكَلْتُهَا \".\nفَقَالَ أَبُو بَكْرٍ : نَامَتْ عَيْنُكَ يَا رَسُولَ اللَّهِ، هَذِهِ السَّرِيَّةُ الَّتِي بَعَثْتَ بِهَا، غَنِمُوا مَرَّتَيْنِ كِلْتَاهُمَا وَجَدُوا رَجُلًا يَنْشُدُ ذِمَّتَكَ.\nفَقُلْتُ لِمُجَالِدٍ : مَا يَنْشُدُ ذِمَّتَكَ؟ قَالَ : يَقُولُ : لَا إِلَهَ إِلَّا اللَّهُ","english":{"narrator":"","text":""}},{"id":27,"idInBook":27,"chapterId":10,"bookId":9,"arabic":"أَخْبَرَنَا عُبَيْدُ بْنُ يَعِيشَ  ، حَدَّثَنَا يُونُسُ هُوَ ابْنُ بُكَيْرٍ  ، أَخْبَرَنَا ابْنُ إِسْحَاق  ، عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَطَاءٍ  ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ  ، عَنْ عَائِشَةَ   زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَتْ : كَانَتْ امْرَأَةٌ مِنْ أَهْلِ الْمَدِينَةِ لَهَا زَوْجٌ تَاجِرٌ يَخْتَلِفُ، فَكَانَتْ تَرَى رُؤْيَا كُلَّمَا غَابَ عَنْهَا زَوْجُهَا، وَقَلَّمَا يَغِيبُ إِلَّا تَرَكَهَا حَامِلًا، فَتَأْتِي رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَتَقُولُ : إِنَّ زَوْجِي خَرَجَ تَاجِرًا فَتَرَكَنِي حَامِلًا، فَرَأَيْتُ فِيمَا يَرَى النَّائِمُ : أَنَّ سَارِيَةَ بَيْتِي انْكَسَرَتْ، وَأَنِّي وَلَدْتُ غُلَامًا أَعْوَرَ.\nفَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" خَيْرٌ، يَرْجِعُ زَوْجُكِ عَلَيْكِ إِنْ شَاءَ اللَّهُ تَعَالَى صَالِحًا، وَتَلِدِينَ غُلَامًا بَرًّا \".\nفَكَانَتْ تَرَاهَا مَرَّتَيْنِ أَوْ ثَلَاثًا، كُلُّ ذَلِكَ تَأْتِي رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَيَقُولُ ذَلِكَ لَهَا فَيَرْجِعُ زَوْجُهَا، وَتَلِدُ غُلَامًا، فَجَاءَتْ يَوْمًا كَمَا كَانَتْ تَأْتِيهِ، وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَائِبٌ، وَقَدْ رَأَتْ تِلْكَ الرُّؤْيَا، فَقُلْتُ لَهَا : عَمَّ تَسْأَلِينَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا أَمَةَ اللَّهِ؟ فَقَالَتْ : رُؤْيَا كُنْتُ أُرَاهَا، فَآتِي رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَأَسْأَلُهُ عَنْهَا فَيَقُولُ خَيْرًا، فَيَكُونُ كَمَا قَالَ.\nفَقُلْتُ : فَأَخْبِرِينِي مَا هِيَ.\nقَالَتْ : حَتَّى يَأْتِيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَأَعْرِضَهَا عَلَيْهِ كَمَا كُنْتُ أَعْرِضُ.\nفَوَاللَّهِ مَا تَرَكْتُهَا حَتَّى أَخْبَرَتْنِي، فَقُلْتُ : وَاللَّهِ لَئِنْ صَدَقَتْ رُؤْيَاكِ، لَيَمُوتَنَّ زَوْجُكِ وَتَلِدِينَ غُلَامًا فَاجِرًا، فَقَعَدَتْ تَبْكِي، وَقَالَتْ مَا لِي حِينَ عَرَضْتُ عَلَيْكِ رُؤْيَايَ؟ فَدَخَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهِيَ تَبْكِي، فَقَالَ لَهَا : مَا لَهَا يَا عَائِشَةُ ؟ فَأَخْبَرْتُهُ الْخَبَرَ وَمَا تَأَوَّلْتُ لَهَا.\n فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : \" مَهْ يَا عَائِشَةُ ،إِذَا عَبَرْتُمْ لِلْمُسْلِمِ الرُّؤْيَا، فَاعْبُرُوهَا عَلَى الْخَيْرِ، فَإِنَّ الرُّؤْيَا تَكُونُ عَلَى مَا يَعْبُرُهَا صَاحِبُهَا \".\nفَمَاتَ وَاللَّهِ زَوْجُهَا، وَلَا أُرَاهَا إِلَّا وَلَدَتْ غُلَامًا فَاجِرًا","english":{"narrator":"","text":""}}],"chapter":{"id":10,"bookId":9,"arabic":"وَمِنْ كِتَابِ الرُّؤْيَا","english":""}}