{"metadata":{"length":31,"arabic":{"title":"موطأ مالك","author":"الإمام مالك بن أنس","introduction":"كتاب وقوت الصلاة"},"english":{"title":"Muwatta Malik","author":"Imam Malik ibn Anas","introduction":"The Times of Prayer"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":1,"bookId":7,"arabic":"قَالَ حَدَّثَنِي يَحْيَى بْنُ يَحْيَى اللَّيْثِيُّ، عَنْ مَالِكِ بْنِ أَنَسٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ، أَخَّرَ الصَّلاَةَ يَوْمًا فَدَخَلَ عَلَيْهِ عُرْوَةُ بْنُ الزُّبَيْرِ فَأَخْبَرَهُ أَنَّ الْمُغِيرَةَ بْنَ شُعْبَةَ أَخَّرَ الصَّلاَةَ يَوْمًا وَهُوَ بِالْكُوفَةِ فَدَخَلَ عَلَيْهِ أَبُو مَسْعُودٍ الأَنْصَارِيُّ فَقَالَ مَا هَذَا يَا مُغِيرَةُ أَلَيْسَ قَدْ عَلِمْتَ أَنَّ جِبْرِيلَ نَزَلَ فَصَلَّى فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ صَلَّى فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ صَلَّى فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ صَلَّى فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ صَلَّى فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ قَالَ ‏\n\"‏ بِهَذَا أُمِرْتُ ‏\"‏ ‏.‏ فَقَالَ عُمَرُ بْنُ عَبْدِ الْعَزِيزِ اعْلَمْ مَا تُحَدِّثُ بِهِ يَا عُرْوَةُ أَوَ إِنَّ جِبْرِيلَ هُوَ الَّذِي أَقَامَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم وَقْتَ الصَّلاَةِ قَالَ عُرْوَةُ كَذَلِكَ كَانَ بَشِيرُ بْنُ أَبِي مَسْعُودٍ الأَنْصَارِيُّ يُحَدِّثُ عَنْ أَبِيهِ ‏.‏","english":{"narrator":"","text":"He said, \"Yahya ibn Yahya al-Laythi related to me from Malik ibn\nAnas from Ibn Shihab that one day Umar ibn Abdal-Aziz delayed the\nprayer. Urwa ibn az-Zubayr came and told him that al-Mughira ibn Shuba\nhad delayed the prayer one day while he was in Kufa and Abu Masud al-\nAnsari had come to him and said, 'What's this, Mughira? Don't you know\nthat the angel Jibril came down and prayed and the Messenger of Allah,\nmay Allah bless him and grant him peace, prayed.' Then he prayed\nagain, and the Messenger of Allah, may Allah bless him and grant him\npeace, prayed. Then he prayed again, and the Messenger of Allah, may\nAllah bless him and grant him peace, prayed. Then he prayed again, and\nthe Messenger of Allah, may Allah bless him and grant him peace,\nprayed. Then he prayed again, and the Messenger of Allah, may Allah\nbless him and grant him peace, prayed. Then Jibril said, 'This is what\nyou have been ordered to do.'  Umar ibn Abd al-Aziz said, 'Be sure of\nwhat you relate, Urwa. Was it definitely Jibril who established the\ntime of the prayer for the Messenger of Allah?' \" Urwa said, \"That's\nhow it was related to Bashir ibn Abi Masud al-Ansari by his father.\""}},{"id":2,"idInBook":2,"chapterId":1,"bookId":7,"arabic":"قَالَ عُرْوَةُ وَلَقَدْ حَدَّثَتْنِي عَائِشَةُ زَوْجُ النَّبِيِّ صلى الله عليه وسلم أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُصَلِّي الْعَصْرَ وَالشَّمْسُ فِي حُجْرَتِهَا قَبْلَ أَنْ تَظْهَرَ ‏.‏","english":{"narrator":"","text":"Urwa said that A'isha, the wife of the Prophet, may Allah bless\nhim and grant him peace used to pray asr while the sunlight was\npouring into her room, before the sun itself had become visible (i.e.\nbecause it was still high in the sky)."}},{"id":3,"idInBook":3,"chapterId":1,"bookId":7,"arabic":"وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، أَنَّهُ قَالَ جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَسَأَلَهُ عَنْ وَقْتِ صَلاَةِ الصُّبْحِ قَالَ فَسَكَتَ عَنْهُ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى إِذَا كَانَ مِنَ الْغَدِ صَلَّى الصُّبْحَ حِينَ طَلَعَ الْفَجْرُ ثُمَّ صَلَّى الصُّبْحَ مِنَ الْغَدِ بَعْدَ أَنْ أَسْفَرَ ثُمَّ قَالَ ‏\"‏ أَيْنَ السَّائِلُ عَنْ وَقْتِ الصَّلاَةِ ‏\"‏ ‏.‏ قَالَ هَا أَنَا ذَا يَا رَسُولَ اللَّهِ ‏.‏ فَقَالَ ‏\"‏ مَا بَيْنَ هَذَيْنِ وَقْتٌ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Zayd ibn Aslam that Ata ibn\nYasar said, \"A man came to the Messenger of Allah, may Allah bless him\nand grant him peace, and asked him about the time of the subh prayer.\nThe Messenger of Allah, may Allah bless him and grant him peace, did\nnot answer him, but in the morning he prayed subh at first light. The\nfollowing morning he prayed subh when it was much lighter, and then\nsaid, 'Where is the man who was asking about the time of the prayer?'\nThe man replied, 'Here I am, Messenger of Allah.' He said,'The time is\nbetween these two.' \""}},{"id":4,"idInBook":4,"chapterId":1,"bookId":7,"arabic":"وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ إِنْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم لَيُصَلِّي الصُّبْحَ فَيَنْصَرِفُ النِّسَاءُ مُتَلَفِّعَاتٍ بِمُرُوطِهِنَّ مَا يُعْرَفْنَ مِنَ الْغَلَسِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said from Amra bint\nAbd ar-Rahman that A'isha, the wife of the Prophet, may Allah bless\nhim and grant him peace, said, \"The Messenger of Allah, may Allah\nbless him and grant him peace, used to pray subh and the women would\nleave wrapped in their garments and they could not yet be recognised\nin the darkness.\""}},{"id":5,"idInBook":5,"chapterId":1,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، وَعَنْ بُسْرِ بْنِ سَعِيدٍ، وَعَنِ الأَعْرَجِ، كُلُّهُمْ يُحَدِّثُونَهُ عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ أَدْرَكَ رَكْعَةً مِنَ الصُّبْحِ قَبْلَ أَنْ تَطْلُعَ الشَّمْسُ فَقَدْ أَدْرَكَ الصُّبْحَ وَمَنْ أَدْرَكَ رَكْعَةً مِنَ الْعَصْرِ قَبْلَ أَنْ تَغْرُبَ الشَّمْسُ فَقَدْ أَدْرَكَ الْعَصْرَ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Zayd ibn Aslam from Ata ibn\nYasar and from Busr ibn Said and from al-Araj-all of whom related it\nfrom Abu Hurayra - that the Messenger of Allah, may Allah bless him\nand grant him peace, said, \"Whoever manages to do a raka of subh\nbefore the sun has risen has done subh in time, and whoever manages to\ndo a raka of asr before the sun has set has done asr in time.\""}},{"id":6,"idInBook":6,"chapterId":1,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، مَوْلَى عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّ عُمَرَ بْنَ الْخَطَّابِ، كَتَبَ إِلَى عُمَّالِهِ إِنَّ أَهَمَّ أَمْرِكُمْ عِنْدِي الصَّلاَةُ فَمَنْ حَفِظَهَا وَحَافَظَ عَلَيْهَا حَفِظَ دِينَهُ وَمَنْ ضَيَّعَهَا فَهُوَ لِمَا سِوَاهَا أَضْيَعُ ‏.‏ ثُمَّ كَتَبَ أَنْ صَلُّوا الظُّهْرَ إِذَا كَانَ الْفَىْءُ ذِرَاعًا إِلَى أَنْ يَكُونَ ظِلُّ أَحَدِكُمْ مِثْلَهُ وَالْعَصْرَ وَالشَّمْسُ مُرْتَفِعَةٌ بَيْضَاءُ نَقِيَّةٌ قَدْرَ مَا يَسِيرُ الرَّاكِبُ فَرْسَخَيْنِ أَوْ ثَلاَثَةً قَبْلَ غُرُوبِ الشَّمْسِ وَالْمَغْرِبَ إِذَا غَرَبَتِ الشَّمْسُ وَالْعِشَاءَ إِذَا غَابَ الشَّفَقُ إِلَى ثُلُثِ اللَّيْلِ فَمَنْ نَامَ فَلاَ نَامَتْ عَيْنُهُ فَمَنْ نَامَ فَلاَ نَامَتْ عَيْنُهُ فَمَنْ نَامَ فَلاَ نَامَتْ عَيْنُهُ وَالصَّبْحَ وَالنُّجُومُ بَادِيَةٌ مُشْتَبِكَةٌ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi', the mawla of Abdullah ibn Umar, that Umar ibn al-Khattab wrote to his governors\nsaying, \"The most important of your affairs in my view is the prayer.\nWhoever protects it and observes it carefully is protecting his deen,\nwhile whoever is negligent about it will be even more negligent about\nother things.\" Then he added, \"Pray dhuhr any time from when the\nafternoon shade is the length of your forearm until the length of your\nshadow matches your height. Pray asr when the sun is still pure white,\nso that a rider can travel two or three farsakhs before the sun sets.\nPray maghrib when the sun has set. Pray isha any time from when the\nredness in the western sky has disappeared until a third of the night\nhas passed - and a person who sleeps, may he have no rest, a person\nwho sleeps, may he have no rest. And pray subh when all the stars are\nvisible and like a haze in the sky.\""}},{"id":7,"idInBook":7,"chapterId":1,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَمِّهِ أَبِي سُهَيْلٍ، عَنْ أَبِيهِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، كَتَبَ إِلَى أَبِي مُوسَى أَنْ صَلِّ الظُّهْرَ، إِذَا زَاغَتِ الشَّمْسُ وَالْعَصْرَ وَالشَّمْسُ بَيْضَاءُ نَقِيَّةٌ قَبْلَ أَنْ يَدْخُلَهَا صُفْرَةٌ وَالْمَغْرِبَ إِذَا غَرَبَتِ الشَّمْسُ وَأَخِّرِ الْعِشَاءَ مَا لَمْ تَنَمْ وَصَلِّ الصُّبْحَ وَالنُّجُومُ بَادِيَةٌ مُشْتَبِكَةٌ وَاقْرَأْ فِيهَا بِسُورَتَيْنِ طَوِيلَتَيْنِ مِنَ الْمُفَصَّلِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik, from his uncle Abu Suhayl from\nhis father that Umar ibn al-Khattab wrote to Abu Musa saying that he\nshould pray dhuhr when the sun had started to decline, asr when the\nsun was still pure white before any yellowness had entered it maghrib\nwhen the sun had set, and to delay isha as long as he did not sleep,\nand to pray subh when the stars were all visible and like a haze in\nthe sky and to read in it two long suras from the mufassal."}},{"id":8,"idInBook":8,"chapterId":1,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، كَتَبَ إِلَى أَبِي مُوسَى الأَشْعَرِيِّ أَنْ صَلِّ الْعَصْرَ، وَالشَّمْسُ، بَيْضَاءُ نَقِيَّةٌ قَدْرَ مَا يَسِيرُ الرَّاكِبُ ثَلاَثَةَ فَرَاسِخَ وَأَنْ صَلِّ الْعِشَاءَ مَا بَيْنَكَ وَبَيْنَ ثُلُثِ اللَّيْلِ فَإِنْ أَخَّرْتَ فَإِلَى شَطْرِ اللَّيْلِ وَلاَ تَكُنْ مِنَ الْغَافِلِينَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa from his\nfather that Umar ibn al-Khattab wrote to Abu Musa al-Ashari that he\nshould pray asr when the sun was still pure white so that a man could\nride three farsakhs (before maghrib) and that he should pray Isha\nduring the first third of the night, or, if he delayed it, then up\nuntil the middle of the night, and he warned him not to be forgetful."}},{"id":9,"idInBook":9,"chapterId":1,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَزِيدَ بْنِ زِيَادٍ، عَنْ عَبْدِ اللَّهِ بْنِ رَافِعٍ، مَوْلَى أُمِّ سَلَمَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ سَأَلَ أَبَا هُرَيْرَةَ عَنْ وَقْتِ الصَّلاَةِ فَقَالَ أَبُو هُرَيْرَةَ أَنَا أُخْبِرُكَ صَلِّ الظُّهْرَ إِذَا كَانَ ظِلُّكَ مِثْلَكَ وَالْعَصْرَ إِذَا كَانَ ظِلُّكَ مِثْلَيْكَ وَالْمَغْرِبَ إِذَا غَرَبَتِ الشَّمْسُ وَالْعِشَاءَ مَا بَيْنَكَ وَبَيْنَ ثُلُثِ اللَّيْلِ وَصَلِّ الصُّبْحَ بِغَبَشٍ ‏.‏ يَعْنِي الْغَلَسَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yazid ibn Ziyad that Abdullah\nibn Rafi, the mawla of Umm Salama, the wife of the Prophet, may Allah\nbless him and grant him peace, asked Abu Hurayra about the time of the\nprayer. Abu Hurayra said, \"Let me tell you. Pray dhuhr when the length\nof your shadow matches your height, asr when your shadow is twice your\nheight, maghrib when the sun has set, isha in the first third of the\nnight, and subh in the very first light of dawn,\" i.e. when the dawn\nhas definitely come."}},{"id":10,"idInBook":10,"chapterId":1,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّهُ قَالَ كُنَّا نُصَلِّي الْعَصْرَ ثُمَّ يَخْرُجُ الإِنْسَانُ إِلَى بَنِي عَمْرِو بْنِ عَوْفٍ فَيَجِدُهُمْ يُصَلُّونَ الْعَصْرَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ishaq ibn Abdullah ibn Abi\nTalha that Anas ibn Malik said, \"We would pray asr and anyone who then\nwent to the Bani Amr ibn Awf would find them praying asr.\""}},{"id":11,"idInBook":11,"chapterId":1,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّهُ قَالَ كُنَّا نُصَلِّي الْعَصْرَ ثُمَّ يَذْهَبُ الذَّاهِبُ إِلَى قُبَاءٍ فَيَأْتِيهِمْ وَالشَّمْسُ مُرْتَفِعَةٌ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab that Anas ibn\nMalik said, \"We would pray asr and anyone who then went to Quba would\narrive there while the sun was still high.\""}},{"id":12,"idInBook":12,"chapterId":1,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، أَنَّهُ قَالَ مَا أَدْرَكْتُ النَّاسَ إِلاَّ وَهُمْ يُصَلُّونَ الظُّهْرَ بِعَشِيٍّ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Rabia ibn Abi Abd ar-Rahman\nthat al Qasim ibn Muhammad said, \"None of the companions that I met\nprayed dhuhr until well after noon,\"(i.e.until when the sun had lost\nits fierceness)."}},{"id":13,"idInBook":13,"chapterId":1,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَمِّهِ أَبِي سُهَيْلِ بْنِ مَالِكٍ، عَنْ أَبِيهِ، أَنَّهُ قَالَ كُنْتُ أَرَى طِنْفِسَةً لِعَقِيلِ بْنِ أَبِي طَالِبٍ يَوْمَ الْجُمُعَةِ تُطْرَحُ إِلَى جِدَارِ الْمَسْجِدِ الْغَرْبِيِّ فَإِذَا غَشِيَ الطِّنْفِسَةَ كُلَّهَا ظِلُّ الْجِدَارِ خَرَجَ عُمَرُ بْنُ الْخَطَّابِ وَصَلَّى الْجُمُعَةَ - قَالَ مَالِكٌ وَالِدُ أَبِي سُهَيْلٍ - ثُمَّ نَرْجِعُ بَعْدَ صَلاَةِ الْجُمُعَةِ فَنَقِيلُ قَائِلَةَ الضَّحَاءِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from his uncle Abu Suhayl ibn\nMalik that his father said, \"I used to see a carpet belonging to Aqil\nibn Abi Talib spread out on the day of jumua up to the west wall of\nthe mosque. When the shadow of the wall covered the whole carpet, Umar\nibn al-Khattab would come out and pray the jumua prayer.\"\n\n\nMalik, Abu Suhayl's father, added, \"We would then return after the\njumua prayer and take our midday sleep.\""}},{"id":14,"idInBook":14,"chapterId":1,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَمْرِو بْنِ يَحْيَى الْمَازِنِيِّ، عَنِ ابْنِ أَبِي سَلِيطٍ، أَنَّ عُثْمَانَ بْنَ عَفَّانَ، صَلَّى الْجُمُعَةَ بِالْمَدِينَةِ وَصَلَّى الْعَصْرَ بِمَلَلٍ ‏.‏ قَالَ مَالِكٌ وَذَلِكَ لِلتَّهْجِيرِ وَسُرْعَةِ السَّيْرِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Amr ibn Yahya ibn Yahya al-\nMazini from Ibn Abi Salit that Uthman ibn Affan prayed jumua in Madina\nand asr in Malal (a place seventeen miles from Madina).\n\n\nMalik\ncommented, \"That was by praying jumua just past midday and then\ntravelling fast.\""}},{"id":15,"idInBook":15,"chapterId":1,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ أَدْرَكَ رَكْعَةً مِنَ الصَّلاَةِ فَقَدْ أَدْرَكَ الصَّلاَةَ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Abu Salama\nibn Abdar-Rahman from Abu Hurayra that the Messenger of Allah, may\nAllah bless him and grant him peace, said \"Whoever catches a raka of\nthe prayer has caught the prayer.\""}},{"id":16,"idInBook":16,"chapterId":1,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ بْنِ الْخَطَّابِ، كَانَ يَقُولُ إِذَا فَاتَتْكَ الرَّكْعَةُ فَقَدْ فَاتَتْكَ السَّجْدَةُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nibn al-Khattab used to say, \"If the ruku has passed you by, so has the\nsajda.\""}},{"id":17,"idInBook":17,"chapterId":1,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، وَزَيْدَ بْنَ ثَابِتٍ، كَانَا يَقُولاَنِ مَنْ أَدْرَكَ الرَّكْعَةَ فَقَدْ أَدْرَكَ السَّجْدَةَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Abdullah\nibn Umar and Zayd ibn Thabit used to say, \"Whoever catches the raka`ah\nhas caught the sajda.\""}},{"id":18,"idInBook":18,"chapterId":1,"bookId":7,"arabic":"وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ أَبَا هُرَيْرَةَ، كَانَ يَقُولُ مَنْ أَدْرَكَ الرَّكْعَةَ فَقَدْ أَدْرَكَ السَّجْدَةَ وَمَنْ فَاتَهُ قِرَاءَةُ أُمِّ الْقُرْآنِ فَقَدْ فَاتَهُ خَيْرٌ كَثِيرٌ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Abu Hurayra\nused to say, \"Whoever catches the ruku has caught the sajda and\nwhoever misses the recitation of the umm al-Qur'an has missed much\ngood.\""}},{"id":19,"idInBook":19,"chapterId":1,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقُولُ دُلُوكُ الشَّمْسِ مَيْلُهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nused to say, \"Duluk ash-shams begins from when the sun passes the\nmeridian.\""}},{"id":20,"idInBook":20,"chapterId":1,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ دَاوُدَ بْنِ الْحُصَيْنِ، قَالَ أَخْبَرَنِي مُخْبِرٌ، أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، كَانَ يَقُولُ دُلُوكُ الشَّمْسِ إِذَا فَاءَ الْفَىْءُ وَغَسَقُ اللَّيْلِ اجْتِمَاعُ اللَّيْلِ وَظُلْمَتُهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Da'ud ibn al-Husayn said that\nsomeone had told him Abdullah ibn Abbas used to say, \"Duluk ash-shams\nbegins from when the sun passes the meridian. Ghasaq al-layl is the\ngathering of the night and its darkness.\""}},{"id":21,"idInBook":21,"chapterId":1,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ الَّذِي تَفُوتُهُ صَلاَةُ الْعَصْرِ كَأَنَّمَا وُتِرَ أَهْلَهُ وَمَالَهُ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat the Messenger of Allah, may Allah bless him and grant him peace,\nsaid, \"If someone misses the asr prayer it is as if he has suffered a\ngreat misfortune in his family and wealth .\""}},{"id":22,"idInBook":22,"chapterId":1,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، انْصَرَفَ مِنْ صَلاَةِ الْعَصْرِ فَلَقِيَ رَجُلاً لَمْ يَشْهَدِ الْعَصْرَ فَقَالَ عُمَرُ مَا حَبَسَكَ عَنْ صَلاَةِ الْعَصْرِ فَذَكَرَ لَهُ الرَّجُلُ عُذْرًا فَقَالَ عُمَرُ طَفَّفْتَ ‏.‏ قَالَ يَحْيَى قَالَ مَالِكٌ وَيُقَالُ لِكُلِّ شَىْءٍ وَفَاءٌ وَتَطْفِيفٌ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said that once Umar\nibn al-Khattab left after doing the asr prayer and met a man who had\nnot been there. Umar asked him what had kept him from the prayer and\neventhough the man gave a good reason, Umar said, \"You have given\nyourself short measure.\"\n\n\nYahya added that Malik commented,\n\"It is said that everything has a short measure and a full measure.\""}},{"id":23,"idInBook":23,"chapterId":1,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ كَانَ يَقُولُ إِنَّ الْمُصَلِّيَ لَيُصَلِّي الصَّلاَةَ وَمَا فَاتَهُ وَقْتُهَا وَلَمَا فَاتَهُ مِنْ وَقْتِهَا أَعْظَمُ - أَوْ أَفْضَلُ - مِنْ أَهْلِهِ وَمَالِهِ ‏.‏ قَالَ يَحْيَى قَالَ مَالِكٌ مَنْ أَدْرَكَ الْوَقْتَ وَهُوَ فِي سَفَرٍ فَأَخَّرَ الصَّلاَةَ سَاهِيًا أَوْ نَاسِيًا حَتَّى قَدِمَ عَلَى أَهْلِهِ أَنَّهُ إِنْ كَانَ قَدِمَ عَلَى أَهْلِهِ وَهُوَ فِي الْوَقْتِ فَلْيُصَلِّ صَلاَةَ الْمُقِيمِ وَإِنْ كَانَ قَدْ قَدِمَ وَقَدْ ذَهَبَ الْوَقْتُ فَلْيُصَلِّ صَلاَةَ الْمُسَافِرِ لأَنَّهُ إِنَّمَا يَقْضِي مِثْلَ الَّذِي كَانَ عَلَيْهِ ‏.‏ قَالَ مَالِكٌ وَهَذَا الأَمْرُ هُوَ الَّذِي أَدْرَكْتُ عَلَيْهِ النَّاسَ وَأَهْلَ الْعِلْمِ بِبَلَدِنَا ‏.‏ وَقَالَ مَالِكٌ الشَّفَقُ الْحُمْرَةُ الَّتِي فِي الْمَغْرِبِ فَإِذَا ذَهَبَتِ الْحُمْرَةُ فَقَدْ وَجَبَتْ صَلاَةُ الْعِشَاءِ وَخَرَجْتَ مِنْ وَقْتِ الْمَغْرِبِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik thatYahya ibn Said used to say,\n\"Even if someone manages to pray before the time of the prayer has\npassed, the time that has passed him by is more important, or better,\nthan his family and wealth.\"\n\n\nYahya said that Malik said, \"If\nthe time for a prayer comes and a traveller delays a prayer through\nneglect or forgetfulness until he reaches his family, he should do\nthat prayer in full if he arrives within the time. But if he arrives\nwhen the time has past, he should do the travelling prayer. That way\nhe only repays what he owes.\"\n\n\nMalik said, \"This is what I\nhave found the people and men of knowledge doing in our community.\"\nMalik explained that shafaq was the redness in the sky after the sun\nhad set, and said, \"When the redness has gone then the isha prayer is\ndue and you have left the time of maghrib.\""}},{"id":24,"idInBook":24,"chapterId":1,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، أُغْمِيَ عَلَيْهِ فَذَهَبَ عَقْلُهُ فَلَمْ يَقْضِ الصَّلاَةَ ‏.‏ قَالَ مَالِكٌ وَذَلِكَ فِيمَا نَرَى - وَاللَّهُ أَعْلَمُ - أَنَّ الْوَقْتَ قَدْ ذَهَبَ فَأَمَّا مَنْ أَفَاقَ فِي الْوَقْتِ فَإِنَّهُ يُصَلِّي ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that one time Abdullah\nibn Umar fainted and lost his senses and he did not make up the\nprayer.\n\n\nMalik commented, \"We consider that that was because,\nand Allah knows best, the time had passed. Someone who recovers within\nthe time has to pray.\""}},{"id":25,"idInBook":25,"chapterId":1,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم حِينَ قَفَلَ مِنْ خَيْبَرَ أَسْرَى حَتَّى إِذَا كَانَ مِنْ آخِرِ اللَّيْلِ عَرَّسَ وَقَالَ لِبِلاَلٍ ‏\"‏ اكْلأْلَنَا الصُّبْحَ ‏\"‏ ‏.‏ وَنَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَصْحَابُهُ وَكَلأَ بِلاَلٌ مَا قُدِّرَ لَهُ ثُمَّ اسْتَنَدَ إِلَى رَاحِلَتِهِ وَهُوَ مُقَابِلُ الْفَجْرِ فَغَلَبَتْهُ عَيْنَاهُ فَلَمْ يَسْتَيْقِظْ رَسُولُ اللَّهِ صلى الله عليه وسلم وَلاَ بِلاَلٌ وَلاَ أَحَدٌ مِنَ الرَّكْبِ حَتَّى ضَرَبَتْهُمُ الشَّمْسُ فَفَزِعَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ بِلاَلٌ يَا رَسُولَ اللَّهِ أَخَذَ بِنَفْسِي الَّذِي أَخَذَ بِنَفْسِكَ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اقْتَادُوا ‏\"‏ ‏.‏ فَبَعَثُوا رَوَاحِلَهُمْ وَاقْتَادُوا شَيْئًا ثُمَّ أَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِلاَلاً فَأَقَامَ الصَّلاَةَ فَصَلَّى بِهِمْ رَسُولُ اللَّهِ صلى الله عليه وسلم الصُّبْحَ ثُمَّ قَالَ حِينَ قَضَى الصَّلاَةَ ‏\"‏ مَنْ نَسِيَ الصَّلاَةَ فَلْيُصَلِّهَا إِذَا ذَكَرَهَا فَإِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى يَقُولُ فِي كِتَابِهِ ‏{‏أَقِمِ الصَّلاَةَ لِذِكْرِي ‏}‏ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Said ibn al-\nMusayyab that the Messenger of Allah, may Allah bless him and grant\nhim peace, travelled by night on the way back from Khaybar.Towards the\nend of the night he stopped for a rest and told Bilal to stay awake to\nkeep watch for the subh prayer. The Messenger of Allah, may Allah\nbless him and grant him peace, and his companions slept. Bilal stayed\non guard as long as was decreed for him and then he leant against his\nriding camel facing the direction of the dawn and sleep overcame him\nand neither he nor the Messenger of Allah nor any of the party woke up\nuntil the sun's rays had struck them. The Messenger of Allah, may\nAllah bless him and grant him peace, was alarmed. Bilal excused\nhimself, saying, \"Messenger of Allah! The One who took your self was\nthe One who took myself. \"The Messenger of Allah, may Allah bless him\nand grant him peace, ordered the party to move on and so they roused\nthei r mounts and rode on a short distance. The Messenger of Allah,\nmay Allah bless him and grant him peace, ordered Bilal to give the\niqama and then led them in the subh prayer. When he had finished he\nsaid, \"Anyone who forgets a prayer should pray it when he remembers.\nAllah theBlessed and Exalted says in His book, 'Establish the prayer\nto remember Me.'\""}},{"id":26,"idInBook":26,"chapterId":1,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، أَنَّهُ قَالَ عَرَّسَ رَسُولُ اللَّهِ صلى الله عليه وسلم لَيْلَةً بِطَرِيقِ مَكَّةَ وَوَكَّلَ بِلاَلاً أَنْ يُوقِظَهُمْ لِلصَّلاَةِ فَرَقَدَ بِلاَلٌ وَرَقَدُوا حَتَّى اسْتَيْقَظُوا وَقَدْ طَلَعَتْ عَلَيْهِمُ الشَّمْسُ فَاسْتَيْقَظَ الْقَوْمُ وَقَدْ فَزِعُوا فَأَمَرَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يَرْكَبُوا حَتَّى يَخْرُجُوا مِنْ ذَلِكَ الْوَادِي وَقَالَ ‏\"‏ إِنَّ هَذَا وَادٍ بِهِ شَيْطَانٌ ‏\"‏ ‏.‏ فَرَكِبُوا حَتَّى خَرَجُوا مِنْ ذَلِكَ الْوَادِي ثُمَّ أَمَرَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يَنْزِلُوا وَأَنْ يَتَوَضَّئُوا وَأَمَرَ بِلاَلاً أَنْ يُنَادِيَ بِالصَّلاَةِ أَوْ يُقِيمَ فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم بِالنَّاسِ ثُمَّ انْصَرَفَ إِلَيْهِمْ وَقَدْ رَأَى مِنْ فَزَعِهِمْ فَقَالَ ‏\"‏ يَا أَيُّهَا النَّاسُ إِنَّ اللَّهَ قَبَضَ أَرْوَاحَنَا وَلَوْ شَاءَ لَرَدَّهَا إِلَيْنَا فِي حِينٍ غَيْرِ هَذَا فَإِذَا رَقَدَ أَحَدُكُمْ عَنِ الصَّلاَةِ أَوْ نَسِيَهَا ثُمَّ فَزِعَ إِلَيْهَا فَلْيُصَلِّهَا كَمَا كَانَ يُصَلِّيهَا فِي وَقْتِهَا ‏\"‏ ‏.‏ ثُمَّ الْتَفَتَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى أَبِي بَكْرٍ فَقَالَ ‏\"‏ إِنَّ الشَّيْطَانَ أَتَى بِلاَلاً وَهُوَ قَائِمٌ يُصَلِّي فَأَضْجَعَهُ فَلَمْ يَزَلْ يُهَدِّئُهُ كَمَا يُهَدَّأُ الصَّبِيُّ حَتَّى نَامَ ‏\"‏ ‏.‏ ثُمَّ دَعَا رَسُولُ اللَّهِ صلى الله عليه وسلم بِلاَلاً فَأَخْبَرَ بِلاَلٌ رَسُولَ اللَّهِ صلى الله عليه وسلم مِثْلَ الَّذِي أَخْبَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَبَا بَكْرٍ فَقَالَ أَبُو بَكْرٍ أَشْهَدُ أَنَّكَ رَسُولُ اللَّهِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Zayd ibn Aslam said, \"The\nMessenger of Allah, may Allah bless him and grant him peace, stopped\nfor a rest one night on the way to Makka and appointed Bilal to wake\nthem up for the prayer. Bilal slept and everyone else slept and none\nof them woke up until the sun had risen. When they did wake up they\nwere all alarmed. The Messenger of Allah, may Allah bless him and\ngrant him peace, ordered them to ride out of the valley, saying that\nthere was a shaytan in it. So they rode out of the valley and the\nMessenger of Allah, may Allah bless him and grant him peace, ordered\nthem to dismount and do wudu and he told Bilal either to call the\nprayer or to give the iqama. The Messenger of Allah, may Allah bless\nhim and grant him peace, then led them in the prayer. Noticing their\nuneasiness, he went to them and said, 'O people! Allah seized our\nspirits (arwah) and if He had wished He would have returned them to us\nat a time other than this. So if you sleep through the time for a\nprayer or forget it and then are anxious about it, pray it as if you\nwere praying it in its time.' The Messenger of Allah, may Allah bless\nhim and grant him peace, turned to Abu Bakr and said, 'Shaytan came to\nBilal when he was standing in prayer and made him lie down and lulled\nhim to sleep like a small boy.' The Messenger of Allah, may Allah\nbless him and grant him peace, then called Bilal and told him the same\nas he had told Abu Bakr. Abu Bakr declared, 'I bear witness that you\nare the Messenger of Allah.' \""}},{"id":27,"idInBook":27,"chapterId":1,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ شِدَّةَ الْحَرِّ مِنْ فَيْحِ جَهَنَّمَ فَإِذَا اشْتَدَّ الْحَرُّ فَأَبْرِدُوا عَنِ الصَّلاَةِ ‏\"‏ ‏.‏ \n وَقَالَ ‏\"‏ اشْتَكَتِ النَّارُ إِلَى رَبِّهَا فَقَالَتْ يَا رَبِّ أَكَلَ بَعْضِي بَعْضًا ‏.‏ فَأَذِنَ لَهَا بِنَفَسَيْنِ فِي كُلِّ عَامٍ نَفَسٍ فِي الشِّتَاءِ وَنَفَسٍ فِي الصَّيْفِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Zayd ibn Aslam from Ata ibn\nYasar that the Messenger of Allah, may Allah bless him and grant him\npeace, said, \"Scorching heat is a part of the blast of Jahannam. So,\nwhen the heat is fierce, delay the prayer until it gets cooler.\"\n\n\nHe added in explanation, \"The Fire complained to its Lord and\nsaid, 'My Lord, part of me has eaten another part,' so He allowed it\ntwo breaths in every year, a breath in winter and a breath in summer.\""}},{"id":28,"idInBook":28,"chapterId":1,"bookId":7,"arabic":"وَحَدَّثَنَا مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ، مَوْلَى الأَسْوَدِ بْنِ سُفْيَانَ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، وَعَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ ثَوْبَانَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا اشْتَدَّ الْحَرُّ فَأَبْرِدُوا عَنِ الصَّلاَةِ فَإِنَّ شِدَّةَ الْحَرِّ مِنْ فَيْحِ جَهَنَّمَ ‏\"‏ ‏.‏ وَذَكَرَ ‏\"‏ أَنَّ النَّارَ اشْتَكَتْ إِلَى رَبِّهَا فَأَذِنَ لَهَا فِي كُلِّ عَامٍ بِنَفَسَيْنِ نَفَسٍ فِي الشِّتَاءِ وَنَفَسٍ فِي الصَّيْفِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to us from Abdullah ibn Yazid the mawla of al-Aswad\nibn Sufyan, from Abu Salama ibn Abd ar-Rahman from Muhammad ibn Abd\nar-Rahman ibn Thawban from Abu Hurayra that the Messenger of Allah,\nmay Allah bless him and grant him peace, said, \"When the heat is\nfierce delay the prayer until it gets cooler, for scorching heat is a\npart of the blast of Jahannam.\"\n\n\nHe added, \"The Fire\ncomplained to its Lord, so He allowed it two breaths in each year, a\nbreath in winter and a breath in summer.\""}},{"id":29,"idInBook":29,"chapterId":1,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا اشْتَدَّ الْحَرُّ فَأَبْرِدُوا عَنِ الصَّلاَةِ فَإِنَّ شِدَّةَ الْحَرِّ مِنْ فَيْحِ جَهَنَّمَ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'z Zinad from al-Araj from\nAbu Hurayra that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"When the heat is fierce, wait until it gets cooler\nbefore you do the prayer, for scorching heat is from the blast of\nJahannam.\""}},{"id":30,"idInBook":30,"chapterId":1,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ أَكَلَ مِنْ هَذِهِ الشَّجَرَةِ فَلاَ يَقْرُبْ مَسَاجِدَنَا يُؤْذِينَا بِرِيحِ الثُّومِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Said ibn al-\nMusayyab that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"Anyone who eats this plant should not come near our\nmosques. The smell of the garlic will offend us.\""}},{"id":31,"idInBook":31,"chapterId":1,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْمُجَبَّرِ، أَنَّهُ كَانَ يَرَى سَالِمَ بْنَ عَبْدِ اللَّهِ إِذَا رَأَى الإِنْسَانَ يُغَطِّي فَاهُ وَهُوَ يُصَلِّي جَبَذَ الثَّوْبَ عَنْ فِيهِ جَبْذًا شَدِيدًا حَتَّى يَنْزِعَهُ عَنْ فِيهِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abd ar-Rahman ibn al-Mujabbar\nthat he used to see Salim ibn Abdullah pull the cloth away fiercely\nfrom the mouth of any man he saw covering his mouth while praying."}}],"chapter":{"id":1,"bookId":7,"arabic":"كتاب وقوت الصلاة","english":"The Times of Prayer"}}