{"metadata":{"length":14,"arabic":{"title":"موطأ مالك","author":"الإمام مالك بن أنس","introduction":"كتاب العيدين"},"english":{"title":"Muwatta Malik","author":"Imam Malik ibn Anas","introduction":"The Two 'Ids"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":10,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ سَمِعَ غَيْرَ، وَاحِدٍ، مِنْ عُلَمَائِهِمْ يَقُولُ لَمْ يَكُنْ فِي عِيدِ الْفِطْرِ وَلاَ فِي الأَضْحَى نِدَاءٌ وَلاَ إِقَامَةٌ مُنْذُ زَمَانِ رَسُولِ اللَّهِ صلى الله عليه وسلم إِلَى الْيَوْمِ ‏.‏ قَالَ مَالِكٌ وَتِلْكَ السُّنَّةُ الَّتِي لاَ اخْتِلاَفَ فِيهَا عِنْدَنَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard more than one of\ntheir men of knowledge say, \"There has been no call to prayer or iqama\nfor the id al-Fitr or the id al-Adha since the time of the Messenger\nof Allah, may Allah bless him and grant him peace.\"\n\n\nMalik\nsaid, \"That is the sunna about which there is no disagreement among\nus.\""}},{"id":2,"idInBook":2,"chapterId":10,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَغْتَسِلُ يَوْمَ الْفِطْرِ قَبْلَ أَنْ يَغْدُوَ إِلَى الْمُصَلَّى ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nused to do ghusl on the day of Fitr before going to the place of\nprayer."}},{"id":3,"idInBook":3,"chapterId":10,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُصَلِّي يَوْمَ الْفِطْرِ وَيَوْمَ الأَضْحَى قَبْلَ الْخُطْبَةِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab that the Messenger\nof Allah, may Allah bless him and grant him peace, used to pray on the\nday of Fitr and the day of Adha before the khutba."}},{"id":4,"idInBook":4,"chapterId":10,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ أَبَا بَكْرٍ، وَعُمَرَ، كَانَا يَفْعَلاَنِ ذَلِكَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Abu Bakr\nand Umar used to do that."}},{"id":5,"idInBook":5,"chapterId":10,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي عُبَيْدٍ، مَوْلَى ابْنِ أَزْهَرَ قَالَ شَهِدْتُ الْعِيدَ مَعَ عُمَرَ بْنِ الْخَطَّابِ فَصَلَّى ثُمَّ انْصَرَفَ فَخَطَبَ النَّاسَ فَقَالَ إِنَّ هَذَيْنِ يَوْمَانِ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ صِيَامِهِمَا يَوْمُ فِطْرِكُمْ مِنْ صِيَامِكُمْ وَالآخَرُ يَوْمٌ تَأْكُلُونَ فِيهِ مِنْ نُسُكِكُمْ ‏.‏ قَالَ أَبُو عُبَيْدٍ ثُمَّ شَهِدْتُ الْعِيدَ مَعَ عُثْمَانَ بْنِ عَفَّانَ فَجَاءَ فَصَلَّى ثُمَّ انْصَرَفَ فَخَطَبَ وَقَالَ إِنَّهُ قَدِ اجْتَمَعَ لَكُمْ فِي يَوْمِكُمْ هَذَا عِيدَانِ فَمَنْ أَحَبَّ مِنْ أَهْلِ الْعَالِيَةِ أَنْ يَنْتَظِرَ الْجُمُعَةَ فَلْيَنْتَظِرْهَا وَمَنْ أَحَبَّ أَنْ يَرْجِعَ فَقَدْ أَذِنْتُ لَهُ ‏.‏ قَالَ أَبُو عُبَيْدٍ ثُمَّ شَهِدْتُ الْعِيدَ مَعَ عَلِيِّ بْنِ أَبِي طَالِبٍ - وَعُثْمَانُ مَحْصُورٌ - فَجَاءَ فَصَلَّى ثُمَّ انْصَرَفَ فَخَطَبَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab that Abu Ubayd,\nthe mawla of Ibn Azhar said, \"I was present at an id with Umar ibn al-\nKhattab. He prayed, and then after he had prayed he gave a khutba to\nthe people and said, 'The Messenger of Allah, may Allah bless him and\ngrant him peace, forbade fasting on these two days - the day you break\nyour fast (after Ramadan), and the day you eat from your sacrifice\n(after Hajj) .' \"\n\n\nAbu Ubaydcontinued,\"Then I was present at\nan id with Uthman ibn Affan. He came and prayed, and when he had\nfinished he gave a khutba and said, 'Two ids have been joined together\nfor you on this day of yours. If any of the people of al-Aliyya (the\nhills outlying Madina) want to wait for the jumua they can do so, and\nif any of them want to return, I have given them permission.' Abu\nUbayd continued, \"Then I was present at an id with AIi ibn Abi Talib\n(at the time when Uthman was being detained). He came and prayed, and\nthen after he had prayed he gave a khutba.\""}},{"id":6,"idInBook":6,"chapterId":10,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّهُ كَانَ يَأْكُلُ يَوْمَ عِيدِ الْفِطْرِ قَبْلَ أَنْ يَغْدُوَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa from his\nfather that he used to eat on the day of the id al-Fitr before going\nout."}},{"id":7,"idInBook":7,"chapterId":10,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ أَخْبَرَهُ أَنَّ النَّاسَ كَانُوا يُؤْمَرُونَ بِالأَكْلِ يَوْمَ الْفِطْرِ قَبْلَ الْغُدُوِّ ‏.‏ قَالَ مَالِكٌ وَلاَ أَرَى ذَلِكَ عَلَى النَّاسِ فِي الأَضْحَى ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab that Said al-\nMusayyab told him that people used to be told to eat on the day of\nFitr before setting out. Malik said that he did not consider that\npeople had to do that for Adha."}},{"id":8,"idInBook":8,"chapterId":10,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ ضَمْرَةَ بْنِ سَعِيدٍ الْمَازِنِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، سَأَلَ أَبَا وَاقِدٍ اللَّيْثِيَّ مَا كَانَ يَقْرَأُ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي الأَضْحَى وَالْفِطْرِ فَقَالَ كَانَ يَقْرَأُ بِـ ‏{‏ق وَالْقُرْآنِ الْمَجِيدِ‏}‏ وَ ‏{‏اقْتَرَبَتِ السَّاعَةُ وَانْشَقَّ الْقَمَرُ‏}‏‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Damra ibn Said al-Mazini from\nUbaydullah ibn Abdullah ibn Utba ibn Masud that Umar ibn al-Khattab\nasked Abu Waqid al-Laythi what the Messenger of Allah, may Allah bless\nhim and grant him peace, used to recite in the prayers of Adha and\nFitr. He said, \"He used to recite Qaf (Sura 50) and al-lnshiqaq\n(Sura84).\""}},{"id":9,"idInBook":9,"chapterId":10,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، مَوْلَى عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّهُ قَالَ شَهِدْتُ الأَضْحَى وَالْفِطْرَ مَعَ أَبِي هُرَيْرَةَ فَكَبَّرَ فِي الرَّكْعَةِ الأُولَى سَبْعَ تَكْبِيرَاتٍ قَبْلَ الْقِرَاءَةِ وَفِي الآخِرَةِ خَمْسَ تَكْبِيرَاتٍ قَبْلَ الْقِرَاءَةِ ‏.‏ قَالَ مَالِكٌ وَهُوَ الأَمْرُ عِنْدَنَا ‏.‏ قَالَ مَالِكٌ فِي رَجُلٍ وَجَدَ النَّاسَ قَدِ انْصَرَفُوا مِنَ الصَّلاَةِ يَوْمَ الْعِيدِ إِنَّهُ لاَ يَرَى عَلَيْهِ صَلاَةً فِي الْمُصَلَّى وَلاَ فِي بَيْتِهِ وَإِنَّهُ إِنْ صَلَّى فِي الْمُصَلَّى أَوْ فِي بَيْتِهِ لَمْ أَرَ بِذَلِكَ بَأْسًا وَيُكَبِّرُ سَبْعًا فِي الأُولَى قَبْلَ الْقِرَاءَةِ وَخَمْسًا فِي الثَّانِيَةِ قَبْلَ الْقِرَاءَةِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Nafi, the mawla of Abdullah\nibn Umar said, \"I was at Adha and Fitr with Abu Hurayra and he said\n'Allah is greater' seven times in the first raka, before the\nrecitation, and five times in the second, before the recitation.\""}},{"id":10,"idInBook":10,"chapterId":10,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، لَمْ يَكُنْ يُصَلِّي يَوْمَ الْفِطْرِ قَبْلَ الصَّلاَةِ وَلاَ بَعْدَهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\ndid not pray either before the prayer or after it on the day of Fitr."}},{"id":11,"idInBook":11,"chapterId":10,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ سَعِيدَ بْنَ الْمُسَيَّبِ، كَانَ يَغْدُو إِلَى الْمُصَلَّى بَعْدَ أَنْ يُصَلِّيَ الصُّبْحَ قَبْلَ طُلُوعِ الشَّمْسِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Said ibn\nal-Musayyab used to go to the place of prayer after praying subh, and\nbefore the sun rose."}},{"id":12,"idInBook":12,"chapterId":10,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، أَنَّ أَبَاهُ الْقَاسِمَ، كَانَ يُصَلِّي قَبْلَ أَنْ يَغْدُوَ، إِلَى الْمُصَلَّى أَرْبَعَ رَكَعَاتٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abd ar-Rahman ibn al-Qasim\nthat his father used to pray four rakas before he went to the place of\nprayer."}},{"id":13,"idInBook":13,"chapterId":10,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّهُ كَانَ يُصَلِّي يَوْمَ الْفِطْرِ قَبْلَ الصَّلاَةِ فِي الْمَسْجِدِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Hisham ibn Urwa that his father used to\npray on the day of Fitr before the prayer in the mosque."}},{"id":14,"idInBook":14,"chapterId":10,"bookId":7,"arabic":"","english":{"narrator":"","text":"Yahya related to me that Malik said, \"The sunna concerning the\ntime of prayer on the ids of Fitr and Adha - and there is no\ndisagreement amongst us about it - is that the imam leaves his house\nand as soon as he has reached the place of prayer the prayer falls\ndue.\"\n\n\nYahya said that Malik was asked whether a man who\nprayed with the imam could leave before the khutba, and he said, \"He\nshould not leave until the imam leaves.\""}}],"chapter":{"id":10,"bookId":7,"arabic":"كتاب العيدين","english":"The Two 'Ids"}}