{"metadata":{"length":5,"arabic":{"title":"موطأ مالك","author":"الإمام مالك بن أنس","introduction":"كتاب صلاة الخوف"},"english":{"title":"Muwatta Malik","author":"Imam Malik ibn Anas","introduction":"The Fear Prayer"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":11,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَزِيدَ بْنِ رُومَانَ، عَنْ صَالِحِ بْنِ خَوَّاتٍ، عَمَّنْ صَلَّى مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم يَوْمَ ذَاتِ الرِّقَاعِ صَلاَةَ الْخَوْفِ أَنَّ طَائِفَةً صَفَّتْ مَعَهُ وَصَفَّتْ طَائِفَةٌ وِجَاهَ الْعَدُوِّ فَصَلَّى بِالَّتِي مَعَهُ رَكْعَةً ثُمَّ ثَبَتَ قَائِمًا وَأَتَمُّوا لأَنْفُسِهِمْ ثُمَّ انْصَرَفُوا فَصَفُّوا وِجَاهَ الْعَدُوِّ وَجَاءَتِ الطَّائِفَةُ الأُخْرَى فَصَلَّى بِهِمُ الرَّكْعَةَ الَّتِي بَقِيَتْ مِنْ صَلاَتِهِ ثُمَّ ثَبَتَ جَالِسًا وَأَتَمُّوا لأَنْفُسِهِمْ ثُمَّ سَلَّمَ بِهِمْ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yazid ibn Ruman from Salih\nibn Khawwat from someone who had prayed (the prayer of fear) with the\nMessenger of Allah, may Allah bless him and grant him peace, on the\nday of Dhat ar-Riqa that one group had formed a row with him and one\ngroup had formed a row opposite the enemy. He then prayed one raka\nwith the group he was with, and then remained standing while they\nfinished by themselves. They then left and formed a row opposite the\nenemy, and then the other group came and he prayed the remaining raka\nof his prayer with them, and then remained sitting while they finished\nby themselves. Then he said the taslim with them."}},{"id":2,"idInBook":2,"chapterId":11,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ صَالِحِ بْنِ خَوَّاتٍ، أَنَّ سَهْلَ بْنَ أَبِي حَثْمَةَ، حَدَّثَهُ أَنَّ صَلاَةَ الْخَوْفِ أَنْ يَقُومَ الإِمَامُ وَمَعَهُ طَائِفَةٌ مِنْ أَصْحَابِهِ وَطَائِفَةٌ مُوَاجِهَةٌ الْعَدُوَّ فَيَرْكَعُ الإِمَامُ رَكْعَةً وَيَسْجُدُ بِالَّذِينَ مَعَهُ ثُمَّ يَقُومُ فَإِذَا اسْتَوَى قَائِمًا ثَبَتَ وَأَتَمُّوا لأَنْفُسِهِمُ الرَّكْعَةَ الْبَاقِيَةَ ثُمَّ يُسَلِّمُونَ وَيَنْصَرِفُونَ وَالإِمَامُ قَائِمٌ فَيَكُونُونَ وِجَاهَ الْعَدُوِّ ثُمَّ يُقْبِلُ الآخَرُونَ الَّذِينَ لَمْ يُصَلُّوا فَيُكَبِّرُونَ وَرَاءَ الإِمَامِ فَيَرْكَعُ بِهِمُ الرَّكْعَةَ وَيَسْجُدُ ثُمَّ يُسَلِّمُ فَيَقُومُونَ فَيَرْكَعُونَ لأَنْفُسِهِمُ الرَّكْعَةَ الْبَاقِيَةَ ثُمَّ يُسَلِّمُونَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said from al-Qasim\nibn Muhammad from Salih ibn Khawwat that Sahl ibn Abi Hathma related\nto him that the form of the prayer of fear was that the imam stood\nwith a group of his companions, while another group faced the enemy.\nThe imam prayed one raka with them, including the prostration, and\nthen stood. He remained standing while they completed the remaining\nraka by themselves. They then said the taslim, left, and formed up\nopposite the enemy while the imam remained standing. Then the others\nwho had not prayed came forward and said the takbir behind the imam\nand he prayed one raka with them, including the prostration. He then\nsaid the taslim, while they stood up and prayed the remaining raka by\nthemselves. Then they said the taslim."}},{"id":3,"idInBook":3,"chapterId":11,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ إِذَا سُئِلَ عَنْ صَلاَةِ الْخَوْفِ، قَالَ يَتَقَدَّمُ الإِمَامُ وَطَائِفَةٌ مِنَ النَّاسِ فَيُصَلِّي بِهِمُ الإِمَامُ رَكْعَةً وَتَكُونُ طَائِفَةٌ مِنْهُمْ بَيْنَهُ وَبَيْنَ الْعَدُوِّ لَمْ يُصَلُّوا فَإِذَا صَلَّى الَّذِينَ مَعَهُ رَكْعَةً اسْتَأْخَرُوا مَكَانَ الَّذِينَ لَمْ يُصَلُّوا وَلاَ يُسَلِّمُونَ وَيَتَقَدَّمُ الَّذِينَ لَمْ يُصَلُّوا فَيُصَلُّونَ مَعَهُ رَكْعَةً ثُمَّ يَنْصَرِفُ الإِمَامُ وَقَدْ صَلَّى رَكْعَتَيْنِ فَتَقُومُ كُلُّ وَاحِدَةٍ مِنَ الطَّائِفَتَيْنِ فَيُصَلُّونَ لأَنْفُسِهِمْ رَكْعَةً رَكْعَةً بَعْدَ أَنْ يَنْصَرِفَ الإِمَامُ فَيَكُونُ كُلُّ وَاحِدَةٍ مِنَ الطَّائِفَتَيْنِ قَدْ صَلَّوْا رَكْعَتَيْنِ فَإِنْ كَانَ خَوْفًا هُوَ أَشَدَّ مِنْ ذَلِكَ صَلَّوْا رِجَالاً قِيَامًا عَلَى أَقْدَامِهِمْ أَوْ رُكْبَانًا مُسْتَقْبِلِي الْقِبْلَةِ أَوْ غَيْرَ مُسْتَقْبِلِيهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar, when asked about the fear prayer said, \"The imam and a group of people go forward and the imam prays a raka with them, while another group, who have not yet prayed, position themselves between him and the enemy. When those who are with him have prayed a raka they draw back to where those who have not prayed are, and do not say the taslim. Then those who have not prayed come forward and pray a raka with him. Then the imam leaves, as he has now prayed two rakas. Everyone else in the two groups stands and prays a raka by himself after the imam has left. In this way each of the two groups will have prayed two rakas. If the fear is greater than that, then the men pray standing on their feet or mounted, either facing the qibla or otherwise.\""}},{"id":4,"idInBook":4,"chapterId":11,"bookId":7,"arabic":"","english":{"narrator":"","text":"Malik said that Nafi said, \"I do not believe that Abdullah ibn Umar related it from anyone other than the Messenger of Allah, may Allah bless him and grant him peace.\""}},{"id":5,"idInBook":5,"chapterId":11,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ قَالَ مَا صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم الظُّهْرَ وَالْعَصْرَ يَوْمَ الْخَنْدَقِ حَتَّى غَابَتِ الشَّمْسُ ‏.‏ قَالَ مَالِكٌ وَحَدِيثُ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ صَالِحِ بْنِ خَوَّاتٍ أَحَبُّ مَا سَمِعْتُ إِلَىَّ فِي صَلاَةِ الْخَوْفِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said that Said ibn\nal-Musayyab said, \"The Messenger of Allah, may Allah bless him and\ngrant him peace, did not pray dhuhr and asr on the day of the Trench\nuntil after the sun had set.\"\n\n\nMalik said, \"The hadith of al-\nQasim ibn Muhammad from Salih ibn Khawwat is the one I like most out\nof what I have heard about the fear prayer.\""}}],"chapter":{"id":11,"bookId":7,"arabic":"كتاب صلاة الخوف","english":"The Fear Prayer"}}