{"metadata":{"length":6,"arabic":{"title":"موطأ مالك","author":"الإمام مالك بن أنس","introduction":"كتاب الاستسقاء"},"english":{"title":"Muwatta Malik","author":"Imam Malik ibn Anas","introduction":"Asking for Rain"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":13,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ عَمْرِو بْنِ حَزْمٍ، أَنَّهُ سَمِعَ عَبَّادَ بْنَ تَمِيمٍ، يَقُولُ سَمِعْتُ عَبْدَ اللَّهِ بْنَ زَيْدٍ الْمَازِنِيَّ، يَقُولُ خَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى الْمُصَلَّى فَاسْتَسْقَى وَحَوَّلَ رِدَاءَهُ حِينَ اسْتَقْبَلَ الْقِبْلَةَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abdullah ibn Abi Bakr ibn Amr\nibn Hazm that he had heard Abbad ibn Tamim say that he had heard\nAbdullah ibn Zayd al-Mazini say, \"The Messenger of Allah, may Allah\nbless him and grant him peace, came out to the place of prayer and\nasked for rain, and when he faced the qibla he turned his cloak inside\nout.\"\n\n\nMalik was asked how many rakas there were in the prayer\nof asking for rain and he said, \"Two rakas, and the imam does the\nprayer before he gives the khutba. He prays two rakas, and then he\ngives a khutba and makes dua, facing the qibla and turning his cloak\ninside out. He recites out loud in both rakas, and when he turns his\ncloak inside out he puts what is on his right on his left, and what is\non his left on his right, and all the people turn their cloaks inside\nout when the imam does so, and face the qibla, sitting.\""}},{"id":2,"idInBook":2,"chapterId":13,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا اسْتَسْقَى قَالَ ‏\n\"‏ اللَّهُمَّ اسْقِ عِبَادَكَ وَبَهِيمَتَكَ وَانْشُرْ رَحْمَتَكَ وَأَحْىِ بَلَدَكَ الْمَيِّتَ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said from Amr ibn\nShuayb that the Messenger of Allah, may Allah bless him and grant him\npeace, said, when he asked for rain, \"O Allah, give water to Your\nslaves and Your animals, and spread Your mercy, and give life to Your\ndead land.\""}},{"id":3,"idInBook":3,"chapterId":13,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ شَرِيكِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي نَمِرٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّهُ قَالَ جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ هَلَكَتِ الْمَوَاشِي وَتَقَطَّعَتِ السُّبُلُ فَادْعُ اللَّهَ ‏.‏ فَدَعَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَمُطِرْنَا مِنَ الْجُمُعَةِ إِلَى الْجُمُعَةِ ‏.‏ قَالَ فَجَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ تَهَدَّمَتِ الْبُيُوتُ وَانْقَطَعَتِ السُّبُلُ وَهَلَكَتِ الْمَوَاشِي ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ اللَّهُمَّ ظُهُورَ الْجِبَالِ وَالآكَامِ وَبُطُونَ الأَوْدِيَةِ وَمَنَابِتَ الشَّجَرِ ‏\"‏ ‏.‏ قَالَ فَانْجَابَتْ عَنِ الْمَدِينَةِ انْجِيَابَ الثَّوْبِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Sharik ibn Abdullah ibn Abi\nNamir that Anas ibn Malik said, \"A man came to the Messenger of Allah,\nmay Allah bless him and grant him peace, and said, 'Messenger of\nAllah, our animals are dying and our camels are too weak to travel, so\nmake dua to Allah.' The Messenger of Allah, may Allah bless him and\ngrant him peace, made dua, and it rained on us from one jumua to the\nnext.\"\n\n\nAnas continued, \"Then a man came to the Messenger of\nAllah, may Allah bless him and grant him peace, and said, 'Messenger\nof Allah, our houses have fallen down, the paths are blocked, and our\nflocks are dying.' The Messenger of Allah, may Allah bless him and\ngrant him peace, said, 'O Allah, (only) the mountain and hill-tops,\nthe valley bottoms, and the places where trees grow.' \"\n\n\nAnas\nadded, \"It cleared away from Madina like a garment being removed.\"\n\n\nMalik said, about a man who missed the prayer of asking for\nrain but caught the khutba, and wished to pray in the mosque, or in\nhis house when he returned, \"He is free to do so, or not, as he\nwishes.\""}},{"id":4,"idInBook":4,"chapterId":13,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ صَالِحِ بْنِ كَيْسَانَ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ، أَنَّهُ قَالَ صَلَّى لَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم صَلاَةَ الصُّبْحِ بِالْحُدَيْبِيَةِ عَلَى إِثْرِ سَمَاءٍ كَانَتْ مِنَ اللَّيْلِ فَلَمَّا انْصَرَفَ أَقْبَلَ عَلَى النَّاسِ فَقَالَ ‏\"‏ أَتَدْرُونَ مَاذَا قَالَ رَبُّكُمْ ‏\"‏ ‏.‏ قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ ‏.‏ قَالَ ‏\"‏ قَالَ أَصْبَحَ مِنْ عِبَادِي مُؤْمِنٌ بِي وَكَافِرٌ بِي فَأَمَّا مَنْ قَالَ مُطِرْنَا بِفَضْلِ اللَّهِ وَرَحْمَتِهِ فَذَلِكَ مُؤْمِنٌ بِي كَافِرٌ بِالْكَوْكَبِ وَأَمَّا مَنْ قَالَ مُطِرْنَا بِنَوْءِ كَذَا وَكَذَا فَذَلِكَ كَافِرٌ بِي مُؤْمِنٌ بِالْكَوْكَبِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Salih ibn Kaysan from\nUbaydullah ibn Abdullah ibn Utba ibn Masud that Zayd ibn Khalid al-\nJuhani said, \"The Messenger of Allah, may Allah bless him and grant\nhim peace, took the subh prayer with us at Hudaybiyya after it had\nrained in the night. When he had finished he went up to the people and\nsaid, 'Do you know what your Lord has said?' They said, 'Allah and His\nMessenger know best.' He said, 'Some of my slaves have begun the\nmorning believing in Me, and others have begun it rejecting Me. As for\nthose who say, 'We were rained on by the overflowing favour of Allah\nand His mercy,' they believe in Me and reject the stars. But as for\nthose who say, 'We were rained on by such and such a star, they reject\nMe and believe in the stars.' \""}},{"id":5,"idInBook":5,"chapterId":13,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَقُولُ ‏\n\"‏ إِذَا أَنْشَأَتْ بَحْرِيَّةً ثُمَّ تَشَاءَمَتْ فَتِلْكَ عَيْنٌ غُدَيْقَةٌ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that the\nMessenger of Allah, may Allah bless him and grant him peace, used to\nsay, \"When a cloud appears from the direction of the sea and then goes\ntowards ash-Sham, it will be an abundant source of rain.\""}},{"id":6,"idInBook":6,"chapterId":13,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ أَبَا هُرَيْرَةَ، كَانَ يَقُولُ إِذَا أَصْبَحَ وَقَدْ مُطِرَ النَّاسُ مُطِرْنَا بِنَوْءِ الْفَتْحِ ثُمَّ يَتْلُو هَذِهِ الآيَةَ ‏{‏مَا يَفْتَحِ اللَّهُ لِلنَّاسِ مِنْ رَحْمَةٍ فَلاَ مُمْسِكَ لَهَا وَمَا يُمْسِكْ فَلاَ مُرْسِلَ لَهُ مِنْ بَعْدِهِ ‏}‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Abu Hurayra\nused to say, when morning came after it had rained on the people, \"We\nhave been rained upon by the rain of Allah's opening,\" and would then\nrecite the ayat, \"Whatever Allah opens to man of His mercy no-one can\nwithhold, and whatever He withholds no-one can send forward after Him.\n\" (Sura 35 ayat 2)."}}],"chapter":{"id":13,"bookId":7,"arabic":"كتاب الاستسقاء","english":"Asking for Rain"}}