{"metadata":{"length":16,"arabic":{"title":"موطأ مالك","author":"الإمام مالك بن أنس","introduction":"كتاب القبلة"},"english":{"title":"Muwatta Malik","author":"Imam Malik ibn Anas","introduction":"The Qibla"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":14,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ رَافِعِ بْنِ إِسْحَاقَ، مَوْلًى لآلِ الشِّفَاءِ - وَكَانَ يُقَالُ لَهُ مَوْلَى أَبِي طَلْحَةَ - أَنَّهُ سَمِعَ أَبَا أَيُّوبَ الأَنْصَارِيَّ صَاحِبَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَهُوَ بِمِصْرَ يَقُولُ وَاللَّهِ مَا أَدْرِي كَيْفَ أَصْنَعُ بِهَذِهِ الْكَرَايِيسِ وَقَدْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا ذَهَبَ أَحَدُكُمُ الْغَائِطَ أَوِ الْبَوْلَ فَلاَ يَسْتَقْبِلِ الْقِبْلَةَ وَلاَ يَسْتَدْبِرْهَا بِفَرْجِهِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ishaq ibn Abdullah ibn Abi\nTalha that Rafiibn Ishaq, a mawla of the family of ash-Shifa who was\nknown as the mawla of Abu Talha, heard Abu Ayyub al-Ansari, one of the\ncompanions of the Messenger of Allah, may Allah bless him and grant\nhim peace, say, while he was in Egypt, \"By Allah! I don't know how to\ndeal with these lavatories.\" The Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"When you go to defecate or urinate, do\nnot expose your genitals towards the qibla, and do not put your back\nto it.\""}},{"id":2,"idInBook":2,"chapterId":14,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ رَجُلٍ، مِنَ الأَنْصَارِ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى أَنْ تُسْتَقْبَلَ الْقِبْلَةُ لِغَائِطٍ أَوْ بَوْلٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from one of the Ansar that the\nMessenger of Allah, may Allah bless him and grant him peace, forbade\ndefecating or urinating while facing the qibla."}},{"id":3,"idInBook":3,"chapterId":14,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، عَنْ عَمِّهِ، وَاسِعِ بْنِ حَبَّانَ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ كَانَ يَقُولُ إِنَّ أُنَاسًا يَقُولُونَ إِذَا قَعَدْتَ عَلَى حَاجَتِكَ فَلاَ تَسْتَقْبِلِ الْقِبْلَةَ وَلاَ بَيْتَ الْمَقْدِسِ - قَالَ عَبْدُ اللَّهِ - لَقَدِ ارْتَقَيْتُ عَلَى ظَهْرِ بَيْتٍ لَنَا فَرَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَلَى لَبِنَتَيْنِ مُسْتَقْبِلَ بَيْتِ الْمَقْدِسِ لِحَاجَتِهِ ثُمَّ قَالَ لَعَلَّكَ مِنَ الَّذِينَ يُصَلُّونَ عَلَى أَوْرَاكِهِمْ ‏.‏ قَالَ قُلْتُ لاَ أَدْرِي وَاللَّهِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said from Muhammad ibn Yahya ibn Habban from his paternal uncle, Wasi ibn Habban, that Abdullah ibn Umar said, \"People say, 'When you sit to relieve yourself, do not face the qibla or the Bayt al-Maqdis.' \"   Abdullah continued, \"I went upon top of a house of ours and saw the Messenger of Allah, may Allah bless him and grant him peace, (squatting) on two unfired bricks facing the Bayt al-Maqdis, relieving himself.\"   Ibn Umar added, \"Perhaps you are one of those who pray folded on their haunches.\"   Wasi replied, \"I don't know, by Allah!\""}},{"id":4,"idInBook":4,"chapterId":14,"bookId":7,"arabic":"","english":{"narrator":"","text":"Malik said that he meant someone who, when he prostrated, kept his body close to the ground."}},{"id":5,"idInBook":5,"chapterId":14,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَأَى بُصَاقًا فِي جِدَارِ الْقِبْلَةِ فَحَكَّهُ ثُمَّ أَقْبَلَ عَلَى النَّاسِ فَقَالَ ‏\n\"‏ إِذَا كَانَ أَحَدُكُمْ يُصَلِّي فَلاَ يَبْصُقْ قِبَلَ وَجْهِهِ فَإِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى قِبَلَ وَجْهِهِ إِذَا صَلَّى ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat the Messenger of Allah, may Allah bless him and grant him peace,\nsaw spittle on the wall of the qibla and scraped it off. Then he went\nup to the people and said, \"Do not spit in front of you when you are\npraying, because Allah, the Blessed and Exalted, is in front of you\nwhen you pray.\""}},{"id":6,"idInBook":6,"chapterId":14,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa from his\nfather from A'isha, the wife of the Prophet, mayAllah bless him and\ngrant him peace, that the Prophet, may Allah bless him and grant him\npeace, saw spittle, or mucus or phlegm, on the wall of the qibla and\nscraped it off."}},{"id":7,"idInBook":7,"chapterId":14,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ قَالَ بَيْنَمَا النَّاسُ بِقُبَاءٍ فِي صَلاَةِ الصُّبْحِ إِذْ جَاءَهُمْ آتٍ فَقَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَدْ أُنْزِلَ عَلَيْهِ اللَّيْلَةَ قُرْآنٌ وَقَدْ أُمِرَ أَنْ يَسْتَقْبِلَ الْكَعْبَةَ فَاسْتَقْبِلُوهَا وَكَانَتْ وُجُوهُهُمْ إِلَى الشَّامِ فَاسْتَدَارُوا إِلَى الْكَعْبَةِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abdullah ibn Dinar that\nAbdullah ibn Umar said, \"On one occasion when the people were praying\nsubhat Quba a man came to them and said, 'A piece of Qur'an was sent\ndown to the Messenger of Allah, may Allah bless him and grant him\npeace, last night, and he was ordered to face the Kaba, so face it.'\nThey had been facing ash-Sham, so they turned round and faced the\nKaba.''"}},{"id":8,"idInBook":8,"chapterId":14,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ قَالَ صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم بَعْدَ أَنْ قَدِمَ الْمَدِينَةَ سِتَّةَ عَشَرَ شَهْرًا نَحْوَ بَيْتِ الْمَقْدِسِ ثُمَّ حُوِّلَتِ الْقِبْلَةُ قَبْلَ بَدْرٍ بِشَهْرَيْنِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said that Said ibn\nal-Musayyab said, \"The Messenger of Allah, may Allah bless him and\ngrant him peace, prayed towards the Baytal-Maqdis for sixteen months\nafter arriving in Madina. Then the qibla was moved, two months before\nthe battle of Badr. \""}},{"id":9,"idInBook":9,"chapterId":14,"bookId":7,"arabic":"حَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ مَا بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ قِبْلَةٌ إِذَا تُوُجِّهَ قِبَلَ الْبَيْتِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Umar ibn al-Khattab\nsaid, \"Any direction that is between east and west can be taken as a\nqibla if the person praying is face-on to the House.\""}},{"id":10,"idInBook":10,"chapterId":14,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ رَبَاحٍ، وَعُبَيْدِ اللَّهِ بْنِ أَبِي عَبْدِ اللَّهِ، عَنْ أَبِي عَبْدِ اللَّهِ، سَلْمَانَ الأَغَرِّ عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ صَلاَةٌ فِي مَسْجِدِي هَذَا خَيْرٌ مِنْ أَلْفِ صَلاَةٍ فِيمَا سِوَاهُ إِلاَّ الْمَسْجِدَ الْحَرَامَ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Zayd ibn Rabah and Ubaydullah\nibn Abi Abdullah Salman al-Agharr from Abu Hurayra that the Messenger\nof Allah, may Allah bless him and grant him peace, said, \"A prayer in\nthis mosque of mine is better than a thousand prayers in any other\nmosque, except the Masjid al-Haram (in Makka).\""}},{"id":11,"idInBook":11,"chapterId":14,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ حَفْصِ بْنِ عَاصِمٍ، عَنْ أَبِي هُرَيْرَةَ، أَوْ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَا بَيْنَ بَيْتِي وَمِنْبَرِي رَوْضَةٌ مِنْ رِيَاضِ الْجَنَّةِ وَمِنْبَرِي عَلَى حَوْضِي ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Khubayb ibn Abd ar-Rahman\nfrom Hafs ibn Asim from Abu Hurayra or from Abu Said al-Khudri that\nthe Messenger of Allah, may Allah bless him and grant him peace, said,\n\"What is between my house and my mimbar is one of the meadows of the\nGarden, and my mimbar is on my watering-place (al-Hawd).\""}},{"id":12,"idInBook":12,"chapterId":14,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، عَنْ عَبَّادِ بْنِ تَمِيمٍ، عَنْ عَبْدِ اللَّهِ بْنِ زَيْدٍ الْمَازِنِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَا بَيْنَ بَيْتِي وَمِنْبَرِي رَوْضَةٌ مِنْ رِيَاضِ الْجَنَّةِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abdullah ibn Abi Bakr from\nAbbad ibn Tamim from Abdullah ibn Zayd al-Mazini that the Messenger of\nAllah, may Allah bless him and grant him peace, said, \"What is between\nmy house and my mimbar is one of the meadows of the Garden.\""}},{"id":13,"idInBook":13,"chapterId":14,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ تَمْنَعُوا إِمَاءَ اللَّهِ مَسَاجِدَ اللَّهِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Abdullah\nibn Umar said, \"The Messenger of Allah, may Allah bless him and grant\nhim peace, said, 'Do not forbid the female slaves of Allah from (going\ninto) the mosques of Allah.' \""}},{"id":14,"idInBook":14,"chapterId":14,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ عَنْ بُسْرِ بْنِ سَعِيدٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا شَهِدَتْ إِحْدَاكُنَّ صَلاَةَ الْعِشَاءِ فَلاَ تَمَسَّنَّ طِيبًا ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard from Busr ibn\nSaid that the Messenger of Allah, may Allah bless him and grant him\npeace, said, \"None of you women should use perfume when you are\npresent at the isha prayer.\""}},{"id":15,"idInBook":15,"chapterId":14,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَاتِكَةَ بِنْتِ زَيْدِ بْنِ عَمْرِو بْنِ نُفَيْلٍ، امْرَأَةِ عُمَرَ بْنِ الْخَطَّابِ أَنَّهَا كَانَتْ تَسْتَأْذِنُ عُمَرَ بْنَ الْخَطَّابِ إِلَى الْمَسْجِدِ فَيَسْكُتُ فَتَقُولُ وَاللَّهِ لأَخْرُجَنَّ إِلاَّ أَنْ تَمْنَعَنِي ‏.‏ فَلاَ يَمْنَعُهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said that Atika\nbint Zayd ibn Amr ibn Nufayl, the wife of Umar ibn al-Khattab, used to\nask Umar ibn al-Khattab for permission to go to the mosque. He would\nkeep silent, so she would say, \"By Allah, I will go out, unless you\nforbid me,\" and he would not forbid her."}},{"id":16,"idInBook":16,"chapterId":14,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ لَوْ أَدْرَكَ رَسُولُ اللَّهِ صلى الله عليه وسلم مَا أَحْدَثَ النِّسَاءُ لَمَنَعَهُنَّ الْمَسَاجِدَ كَمَا مُنِعَهُ نِسَاءُ بَنِي إِسْرَائِيلَ ‏.‏ قَالَ يَحْيَى بْنُ سَعِيدٍ فَقُلْتُ لِعَمْرَةَ أَوَمُنِعَ نِسَاءُ بَنِي إِسْرَائِيلَ الْمَسَاجِدَ قَالَتْ نَعَمْ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said from Amra bint\nAbd ar-Rahman that A'isha, the wife of the Prophet, may Allah bless\nhim and grant him peace, said, \"If the Messenger of Allah, may Allah\nbless him and grant him peace, had seen what women do now, he would\nhave forbidden them to go into the mosques,  just as the women of the\nBani Israil were forbidden.\"\n\n\nYahya ibn Said said that he\nasked Amra, \"Were the women of the Bani Israil forbidden to go into\nthe mosques?\" and she said, \"Yes.\""}}],"chapter":{"id":14,"bookId":7,"arabic":"كتاب القبلة","english":"The Qibla"}}