{"metadata":{"length":52,"arabic":{"title":"موطأ مالك","author":"الإمام مالك بن أنس","introduction":"كتاب القرآن"},"english":{"title":"Muwatta Malik","author":"Imam Malik ibn Anas","introduction":"The Qur'an"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":15,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ حَزْمٍ، ‏.‏ أَنَّ فِي الْكِتَابِ الَّذِي، كَتَبَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم لِعَمْرِو بْنِ حَزْمٍ ‏\"‏ أَنْ لاَ يَمَسَّ الْقُرْآنَ إِلاَّ طَاهِرٌ.","english":{"narrator":"","text":"Yahya related to me from Malik from Abdullah ibn Abi Bakr ibn Hazm that in a letter that the Messenger of Allah, may Allah bless him and grant him peace, sent to Amr ibn Hazm it said that no-one should touch the Qur'an unless he was pure."}},{"id":2,"idInBook":2,"chapterId":15,"bookId":7,"arabic":"قَالَ مَالِكٌ: «وَلَا يَحْمِلُ أَحَدٌ الْمُصْحَفَ بِعِلَاقَتِهِ وَلَا عَلَى وِسَادَةٍ إِلَّا وَهُوَ طَاهِرٌ، وَلَوْ جَازَ ذَلِكَ لَحُمِلَ فِي خَبِيئَتِهِ وَلَمْ يُكْرَهْ ذَلِكَ، لِأَنْ يَكُونَ فِي يَدَيِ الَّذِي يَحْمِلُهُ شَيْءٌ يُدَنِّسُ بِهِ الْمُصْحَفَ. وَلَكِنْ إِنَّمَا كُرِهَ ذَلِكَ لِمَنْ يَحْمِلُهُ وَهُوَ غَيْرُ طَاهِرٍ، إِكْرَامًا لِلْقُرْآنِ وَتَعْظِيمًا لَهُ» قَالَ مَالِكٌ: \" أَحْسَنُ مَا سَمِعْتُ فِي هَذِهِ الْآيَةِ {لَا يَمَسُّهُ إِلَّا الْمُطَهَّرُونَ} [الواقعة: [79 إِنَّمَا هِيَ بِمَنْزِلَةِ هَذِهِ الْآيَةِ، الَّتِي فِي {عَبَسَ وَتَوَلَّى}، قَوْلُ اللَّهِ تَبَارَكَ وَتَعَالَى: {كَلَّا إِنَّهَا تَذْكِرَةٌ. فَمَنْ شَاءَ ذَكَرَهُ. فِي صُحُفٍ مُكَرَّمَةٍ. مَرْفُوعَةٍ مُطَهَّرَةٍ. بِأَيْدِي سَفَرَةٍ. كِرَامٍ بَرَرَةٍ}.","english":{"narrator":"","text":"Malik said, \"No-one should carry the Qur'an by its strap, or on a cushion, unless he is pure. If it were permissible to do so, it would also have been permissible to carry it in its cover. This is not because there is something on the hands of the one who carries it by which the Qur'an will be soiled, but because it is disapproved of for someone to carry the Qur'an without being pure out of respect for the Qur'an, and in order to honour it.\"  \n Malik said, \"The best thing that I have heard about this is the ayat 'None touch it except the purified.' (Sura 56 ayat 79) It ranks with the ayat in Surat Abasa (Sura 80), where Allah, the Blessed and Exalted, says, 'No, it is a reminder, and whoever wishes will remember it. Upon honoured pages, exalted and purified, by the hands of scribes, noble and obedient.' \""}},{"id":3,"idInBook":3,"chapterId":15,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَيُّوبَ بْنِ أَبِي تَمِيمَةَ السَّخْتِيَانِيِّ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، كَانَ فِي قَوْمٍ وَهُمْ يَقْرَءُونَ الْقُرْآنَ فَذَهَبَ لِحَاجَتِهِ ثُمَّ رَجَعَ وَهُوَ يَقْرَأُ الْقُرْآنَ فَقَالَ لَهُ رَجُلٌ يَا أَمِيرَ الْمُؤْمِنِينَ أَتَقْرَأُ الْقُرْآنَ وَلَسْتَ عَلَى وُضُوءٍ فَقَالَ لَهُ عُمَرُ مَنْ أَفْتَاكَ بِهَذَا أَمُسَيْلِمَةُ","english":{"narrator":"","text":"Yahya related to me from Malik from Ayyub ibn Abi Tamima as-\nSakhtayani from Muhammad ibn Sirin that Umar ibn al-Khattab was with\nsome people who were reciting Qur'an. He went to relieve himself and\nthen came back and recited Qur'an. One of the men said to him, \"Amir\nal muminin, are you reciting the Qur'an without being in wudu?\" Umar\nreplied, \"Who gave you a verdict on this? Was it Musaylima?\"'"}},{"id":4,"idInBook":4,"chapterId":15,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ دَاوُدَ بْنِ الْحُصَيْنِ، عَنِ الأَعْرَجِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدٍ الْقَارِيِّ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ مَنْ فَاتَهُ حِزْبُهُ مِنَ اللَّيْلِ فَقَرَأَهُ حِينَ تَزُولُ الشَّمْسُ إِلَى صَلاَةِ الظُّهْرِ فَإِنَّهُ لَمْ يَفُتْهُ أَوْ كَأَنَّهُ أَدْرَكَهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Dawud ibn al-Husayn from al-\nAraj from Abd ar-Rahman ibn Abd al-Qari that Umar ibn al Khattab said,\n\"Whoever misses reading his hizb at night and reads it from when the\nsun has passed the meridian until the dhuhr prayer has not missed it,\nor it is as if he has caught it.\""}},{"id":5,"idInBook":5,"chapterId":15,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ قَالَ كُنْتُ أَنَا وَمُحَمَّدُ بْنُ يَحْيَى بْنِ حَبَّانَ، جَالِسَيْنِ فَدَعَا مُحَمَّدٌ رَجُلاً فَقَالَ أَخْبِرْنِي بِالَّذِي، سَمِعْتَ مِنْ، أَبِيكَ ‏.‏ فَقَالَ الرَّجُلُ أَخْبَرَنِي أَبِي أَنَّهُ، أَتَى زَيْدَ بْنَ ثَابِتٍ فَقَالَ لَهُ كَيْفَ تَرَى فِي قِرَاءَةِ الْقُرْآنِ فِي سَبْعٍ فَقَالَ زَيْدٌ حَسَنٌ وَلأَنْ أَقْرَأَهُ فِي نِصْفٍ أَوْ عَشْرٍ أَحَبُّ إِلَىَّ وَسَلْنِي لِمَ ذَاكَ قَالَ فَإِنِّي أَسْأَلُكَ ‏.‏ قَالَ زَيْدٌ لِكَىْ أَتَدَبَّرَهُ وَأَقِفَ عَلَيْهِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Yahya ibn Said said, \"Once\nMuhammad ibn Yahya ibn Habban and I were sitting down, and Muhammad\ncalled a man over to him and said to him, 'Tell me what you have heard\nfrom your father.'  The man replied that his father had told him that\nhe went to Zayd ibn Thabit and asked him, 'What do you think of\nreciting the whole Qur'an in seven days?'  Zayd said, 'That's good,\nbut I prefer to recite it in two weeks, or ten days. Ask me why that\nis.' He said, 'I ask you then.' Zayd said, 'So that I can reflect on\nit and pause in it.' \""}},{"id":6,"idInBook":6,"chapterId":15,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدٍ الْقَارِيِّ، أَنَّهُ قَالَ سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ، يَقُولُ سَمِعْتُ هِشَامَ بْنَ حَكِيمِ بْنِ حِزَامٍ، يَقْرَأُ سُورَةَ الْفُرْقَانِ عَلَى غَيْرِ مَا أَقْرَؤُهَا وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَقْرَأَنِيهَا فَكِدْتُ أَنْ أَعْجَلَ عَلَيْهِ ثُمَّ أَمْهَلْتُهُ حَتَّى انْصَرَفَ ثُمَّ لَبَّبْتُهُ بِرِدَائِهِ فَجِئْتُ بِهِ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي سَمِعْتُ هَذَا يَقْرَأُ سُورَةَ الْفُرْقَانِ عَلَى غَيْرِ مَا أَقْرَأْتَنِيهَا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَرْسِلْهُ - ثُمَّ قَالَ - اقْرَأْ يَا هِشَامُ ‏\"‏ ‏.‏ فَقَرَأَ الْقِرَاءَةَ الَّتِي سَمِعْتُهُ يَقْرَأُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَكَذَا أُنْزِلَتْ ‏\"‏ ‏.‏ ثُمَّ قَالَ لِي ‏\"‏ اقْرَأْ ‏\"‏ ‏.‏ فَقَرَأْتُهَا فَقَالَ ‏\"‏ هَكَذَا أُنْزِلَتْ إِنَّ هَذَا الْقُرْآنَ أُنْزِلَ عَلَى سَبْعَةِ أَحْرُفٍ فَاقْرَءُوا مَا تَيَسَّرَ مِنْهُ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Urwa ibn az-\nZubayr that Abd ar-Rahman ibn Abd al-Qari said that he had heard Umar\nibn al-Khattab say, \"I heard Hisham ibn Hakim ibn Hizam reciting Surat\nal-Furqan (Sura 25) differently from me, and it was the Messenger of\nAllah, may Allah bless him and grant him peace, who had recited it to\nme. I was about to rush up to him but I granted him a respite until he\nhad finished his prayer. Then I grabbed him by his cloak and took him\nto the Messenger of Allah, may Allah bless him and grant him peace,\nand said, 'Messenger of Allah, I heard this man reciting Surat al-\nFurqan differently from the way you recited it to me.'  The Messenger\nof Allah, may Allah bless him and grant him peace, said, 'Let him go.'\nThen he said, 'Recite, Hisham,' and Hisham recited as I had heard him\nrecite. The Messenger of Allah, may Allah bless him and grant him\npeace, said, 'It was sent down like that.'  Then he said to me,\n'Recite' and I recited the sura, and he said, 'It was sent down like\nthat. This Qur'an was sent down in seven (different) ways, so recite\nfrom it whatever is easy for you .' \""}},{"id":7,"idInBook":7,"chapterId":15,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّمَا مَثَلُ صَاحِبِ الْقُرْآنِ كَمَثَلِ صَاحِبِ الإِبِلِ الْمُعَقَّلَةِ إِنْ عَاهَدَ عَلَيْهَا أَمْسَكَهَا وَإِنْ أَطْلَقَهَا ذَهَبَتْ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat the Messenger of Allah, may Allah bless him and grant him peace,\nsaid, \"A man who knows the Qur'an well is like a man who has a hobbled\ncamel. If he takes care of it, he keeps it, and if he lets it go, it\ngets away.\""}},{"id":8,"idInBook":8,"chapterId":15,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ الْحَارِثَ بْنَ هِشَامٍ سَأَلَ رَسُولَ اللَّهِ كَيْفَ يَأْتِيكَ الْوَحْىُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَحْيَانًا يَأْتِينِي فِي مِثْلِ صَلْصَلَةِ الْجَرَسِ وَهُوَ أَشَدُّهُ عَلَىَّ فَيَفْصِمُ عَنِّي وَقَدْ وَعَيْتُ مَا قَالَ وَأَحْيَانًا يَتَمَثَّلُ لِيَ الْمَلَكُ رَجُلاً فَيُكَلِّمُنِي فَأَعِي مَا يَقُولُ ‏\"‏ ‏.‏ قَالَتْ عَائِشَةُ وَلَقَدْ رَأَيْتُهُ يَنْزِلُ عَلَيْهِ فِي الْيَوْمِ الشَّدِيدِ الْبَرْدِ فَيُفْصِمُ عَنْهُ وَإِنَّ جَبِينَهُ لَيَتَفَصَّدُ عَرَقًا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa from his\nfather from A'isha, the wife of the Prophet, may Allah bless him and\ngrant him peace, that al-Harith ibn Hisham asked the Messenger of\nAllah, may Allah bless him and grant him peace, \"How does the\nrevelation come to you?\" and the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"Sometimes it comes to me like the\nringing of a bell, and that is the hardest for me, and when it leaves\nme I remember what it has said. And sometimes the angel appears to me\nin the likeness of a man and talks to me and I remember what he says.\"\n\n\nA'isha added, \"I saw it coming down on him on an intensely\ncold day, and when it had left him his forehead was dripping with\nsweat.\""}},{"id":9,"idInBook":9,"chapterId":15,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّهُ قَالَ أُنْزِلَتْ ‏{‏عَبَسَ وَتَوَلَّى‏}‏ فِي عَبْدِ اللَّهِ بْنِ أُمِّ مَكْتُومٍ جَاءَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَجَعَلَ يَقُولُ يَا مُحَمَّدُ اسْتَدْنِينِي وَعِنْدَ النَّبِيِّ صلى الله عليه وسلم رَجُلٌ مِنْ عُظَمَاءِ الْمُشْرِكِينَ فَجَعَلَ النَّبِيُّ صلى الله عليه وسلم يُعْرِضُ عَنْهُ وَيُقْبِلُ عَلَى الآخَرِ وَيَقُولُ ‏\"‏ يَا أَبَا فُلاَنٍ هَلْ تَرَى بِمَا أَقُولُ بَأْسًا ‏\"‏ ‏.‏ فَيَقُولُ لاَ وَالدِّمَاءِ مَا أَرَى بِمَا تَقُولُ بَأْسًا ‏.‏ فَأُنْزِلَتْ ‏{‏عَبَسَ وَتَوَلَّى أَنْ جَاءَهُ الأَعْمَى‏}‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa that his\nfather said that Abasa (Sura 80) was sent down about Abdullah ibn Umm\nMaktum. He came to the Prophet, may Allah bless him and grant him\npeace, and began to say, \"O Muhammad, show me a place near you (where\nI can sit),\" whilst one of the leading men of the idol worshippers was\nin audience with the Prophet, may Allah bless him and grant him peace.\nThe Prophet, may Allah bless him and grant him peace, began to turn\naway from him and give his attention to the other man, and he said to\nhim, \"Father of so-and-so, do you see any harm in what I am saying?\"\nand he said, \"No, by the blood (of our sacrifices) I see no harm in\nwhat you are saying.\"  And Abasa - \"He frowned and turned away when\nthe blind man came\" - was sent down."}},{"id":10,"idInBook":10,"chapterId":15,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَسِيرُ فِي بَعْضِ أَسْفَارِهِ وَعُمَرُ بْنُ الْخَطَّابِ يَسِيرُ مَعَهُ لَيْلاً فَسَأَلَهُ عُمَرُ عَنْ شَىْءٍ فَلَمْ يُجِبْهُ ثُمَّ سَأَلَهُ فَلَمْ يُجِبْهُ ثُمَّ سَأَلَهُ فَلَمْ يُجِبْهُ ‏.‏ فَقَالَ عُمَرُ ثَكِلَتْكَ أُمُّكَ عُمَرُ نَزَرْتَ رَسُولَ اللَّهِ صلى الله عليه وسلم ثَلاَثَ مَرَّاتٍ كُلُّ ذَلِكَ لاَ يُجِيبُكَ - قَالَ عُمَرُ - فَحَرَّكْتُ بَعِيرِي حَتَّى إِذَا كُنْتُ أَمَامَ النَّاسِ وَخَشِيتُ أَنْ يُنْزَلَ فِيَّ قُرْآنٌ فَمَا نَشِبْتُ أَنْ سَمِعْتُ صَارِخًا يَصْرُخُ بِي - قَالَ - فَقُلْتُ لَقَدْ خَشِيتُ أَنْ يَكُونَ نَزَلَ فِيَّ قُرْآنٌ - قَالَ - فَجِئْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَسَلَّمْتُ عَلَيْهِ فَقَالَ ‏\"‏ لَقَدْ أُنْزِلَتْ عَلَىَّ هَذِهِ اللَّيْلَةَ سُورَةٌ لَهِيَ أَحَبُّ إِلَىَّ مِمَّا طَلَعَتْ عَلَيْهِ الشَّمْسُ ‏\"‏ ‏.‏ ثُمَّ قَرَأَ ‏{‏ إِنَّا فَتَحْنَا لَكَ فَتْحًا مُبِينًا ‏}‏","english":{"narrator":"","text":"Yahya related to me from Malik from Zayd ibn Aslam from his\nfather that the Messenger of Allah, may Allah bless him and grant him\npeace, was on one of his journeys, and one night Umar ibn al-Khattab,\nwho was travelling with him, asked him about something, but he did not\nanswer him. He asked him again, but he did not answer him. Then he\nasked him again, and again he did not answer him. Umar said, \"May your\nmother be bereaved of you, Umar. Three times you have importuned the\nMessenger of Allah, may Allah bless him and grant him peace, with a\nquestion and he has not answered you at all.\"\n\n\nUmar continued,\n\"I got my camel moving until, when I was in front of the people, I\nfeared that a piece of Qur'an was being sent down about me. It was not\nlong before I heard a crier calling for me, and I said that I feared\nthat a piece of Qur'an had been sent down about me.\" He continued, \"I\ncame to the Messenger of Allah, may Allah bless him and grant him\npeace, and said, 'Peace be upon you' to him, and he said, 'A sura has\nbeen sent down to me this night that is more beloved to me than\nanything on which the sun rises.'  Then he recited al-Fath (Sura 48)."}},{"id":11,"idInBook":11,"chapterId":15,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ الْحَارِثِ التَّيْمِيِّ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي سَعِيدٍ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ يَخْرُجُ فِيكُمْ قَوْمٌ تَحْقِرُونَ صَلاَتَكُمْ مَعَ صَلاَتِهِمْ وَصِيَامَكُمْ مَعَ صِيَامِهِمْ وَأَعْمَالَكُمْ مَعَ أَعْمَالِهِمْ يَقْرَءُونَ الْقُرْآنَ وَلاَ يُجَاوِزُ حَنَاجِرَهُمْ يَمْرُقُونَ مِنَ الدِّينِ مُرُوقَ السَّهْمِ مِنَ الرَّمِيَّةِ تَنْظُرُ فِي النَّصْلِ فَلاَ تَرَى شَيْئًا وَتَنْظُرُ فِي الْقِدْحِ فَلاَ تَرَى شَيْئًا وَتَنْظُرُ فِي الرِّيشِ فَلاَ تَرَى شَيْئًا وَتَتَمَارَى فِي الْفُوقِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said from Muhammad\nibn Ibrahim ibn al-Harith at-Taymi from Abu Salama ibn Abd ar Rahman\nthat Abu Said said that he had heard the Messenger of Allah, may Allah\nbless him and grant him peace, say, \"A group of people will appear\namong you whose prayer, fasting and deeds will make you think little\nof your own prayer, fasting and deeds. They will recite the Qur'an,\nbut it wil not get past their throats, and they will pass through the\ndeen like an arrow passes through game. You look at the arrowhead, and\nyou see nothing, and you look at the shaft, and you see nothing, and\nyou look at the flights, and you see nothing. And you are in doubt\nabout the notch.\""}},{"id":12,"idInBook":12,"chapterId":15,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، مَكَثَ عَلَى سُورَةِ الْبَقَرَةِ ثَمَانِيَ سِنِينَ يَتَعَلَّمُهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that it took\nAbdullah ibn Umar eight years to learn Surat al-Baqara. (Sura 2)"}},{"id":13,"idInBook":13,"chapterId":15,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ، مَوْلَى الأَسْوَدِ بْنِ سُفْيَانَ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّ أَبَا هُرَيْرَةَ، قَرَأَ لَهُمْ ‏{‏إِذَا السَّمَاءُ انْشَقَّتْ‏}‏ فَسَجَدَ فِيهَا فَلَمَّا انْصَرَفَ أَخْبَرَهُمْ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم سَجَدَ فِيهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abdullah ibn Yazid, the mawla\nof al Aswad ibn Sufyan, from Abu Salama ibn Abd ar Rahman that Abu\nHurayra recited al-Inshiqaq (Sura 84) to them and prostrated in it.\nWhen he had finished he told them that the Messenger of Allah, may\nAllah bless him and grant him peace, had prostrated in it."}},{"id":14,"idInBook":14,"chapterId":15,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، مَوْلَى ابْنِ عُمَرَ أَنَّ رَجُلاً، مِنْ أَهْلِ مِصْرَ أَخْبَرَهُ أَنَّ عُمَرَ بْنَ الْخَطَّابِ قَرَأَ سُورَةَ الْحَجِّ فَسَجَدَ فِيهَا سَجْدَتَيْنِ ثُمَّ قَالَ إِنَّ هَذِهِ السُّورَةَ فُضِّلَتْ بِسَجْدَتَيْنِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi, the mawla of Ibn Umar\nthat a man from Egypt told him that Umar ibn al-Khattab recited Surat\nal-Hajj (Sura 22) and prostrated twice in it, and then said, \"This\nsura has been given special preference by having two prostrations in\nit.\""}},{"id":15,"idInBook":15,"chapterId":15,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، أَنَّهُ قَالَ رَأَيْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ يَسْجُدُ فِي سُورَةِ الْحَجِّ سَجْدَتَيْنِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Abdullah ibn Dinar said, \"I\nsaw Abdullah ibn Umar prostrate twice in Surat al-Hajj (Sura 22).\""}},{"id":16,"idInBook":16,"chapterId":15,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنِ الأَعْرَجِ، ‏.‏ أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَرَأَ بِالنَّجْمِ إِذَا هَوَى فَسَجَدَ فِيهَا ثُمَّ قَامَ فَقَرَأَ بِسُورَةٍ أُخْرَى ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from al-Araj that\nUmar ibn al Khattab recited Surat an-Najm (Sura 53) and prostrated in\nit, and then got up and recited another sura."}},{"id":17,"idInBook":17,"chapterId":15,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَرَأَ سَجْدَةً وَهُوَ عَلَى الْمِنْبَرِ يَوْمَ الْجُمُعَةِ فَنَزَلَ فَسَجَدَ وَسَجَدَ النَّاسُ مَعَهُ ثُمَّ قَرَأَهَا يَوْمَ الْجُمُعَةِ الأُخْرَى فَتَهَيَّأَ النَّاسُ لِلسُّجُودِ فَقَالَ عَلَى رِسْلِكُمْ إِنَّ اللَّهَ لَمْ يَكْتُبْهَا عَلَيْنَا إِلاَّ أَنْ نَشَاءَ ‏.‏ فَلَمْ يَسْجُدْ وَمَنَعَهُمْ أَنْ يَسْجُدُوا.","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa from his father that Umar ibn al-Khattab once recited a piece of Qur'an requiring a prostration while he was on the mimbar on the day of jumua, and he came down and prostrated, and everyone prostrated with him. Then he recited it again the next jumua and everybody prepared to prostrate but he said, \"At your ease. Allah has not prescribed it for us, unless we wish.\" He did not prostrate, and he stopped them from prostrating."}},{"id":18,"idInBook":18,"chapterId":15,"bookId":7,"arabic":"قَالَ مَالِكٌ: «الْأَمْرُ عِنْدَنَا أَنَّ عَزَائِمَ سُجُودِ الْقُرْآنِ إِحْدَى عَشْرَةَ سَجْدَةً. لَيْسَ فِي الْمُفَصَّلِ مِنْهَا شَيْءٌ» قَالَ مَالِكٌ: «لَا يَنْبَغِي لِأَحَدٍ يَقْرَأُ مِنْ سُجُودِ الْقُرْآنِ شَيْئًا، بَعْدَ صَلَاةِ الصُّبْحِ. وَلَا بَعْدَ صَلَاةِ الْعَصْرِ. وَذَلِكَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، نَهَى عَنِ الصَّلَاةِ بَعْدَ الصُّبْحِ، حَتَّى تَطْلُعَ الشَّمْسُ. وَعَنِ الصَّلَاةِ بَعْدَ الْعَصْرِ، حَتَّى تَغْرُبَ الشَّمْسُ. وَالسَّجْدَةُ مِنَ الصَّلَاةِ. فَلَا يَنْبَغِي لِأَحَدٍ أَنْ يَقْرَأَ سَجْدَةً فِي تَيْنِكَ السَّاعَتَيْنِ» سُئِلَ مَالِكٌ: عَمَّنْ قَرَأَ سَجْدَةً. وَامْرَأَةٌ حَائِضٌ تَسْمَعُ، هَلْ لَهَا أَنْ تَسْجُدَ؟ قَالَ مَالِكٌ: «لَا يَسْجُدُ الرَّجُلُ، وَلَا الْمَرْأَةُ، إِلَّا وَهُمَا طَاهِرَانِ» وسُئِلَ عَنِ امْرَأَةٍ قَرَأَتْ سَجْدَةً. وَرَجُلٌ مَعَهَا يَسْمَعُ. أَعَلَيْهِ أَنْ يَسْجُدَ مَعَهَا؟ قَالَ مَالِكٌ: (لَيْسَ عَلَيْهِ أَنْ يَسْجُدَ مَعَهَا. إِنَّمَا تَجِبُ السَّجْدَةُ عَلَى الْقَوْمِ يَكُونُونَ مَعَ الرَّجُلِ. فَيَأْتَمُّونَ بِهِ فَيَقْرَأُ السَّجْدَةَ، فَيَسْجُدُونَ مَعَهُ. وَلَيْسَ عَلَى مَنْ سَمِعَ سَجْدَةً مِنْ إِنْسَانٍ يَقْرَؤُهَا، لَيْسَ لَهُ بِإِمَامٍ، أَنْ يَسْجُدَ تِلْكَ السَّجْدَةَ)","english":{"narrator":"","text":"Malik said, \"The imam does not come down and prostrate when he recites a piece of Qur'an requiring a prostration while he is on the mimbar.\"   Malik said, \"The position with us is that there are eleven prescribed prostrations in the Qur'an, none of which are in the mufassal.\"   Malik said, \"No-one should recite any of the pieces of Qur'an that require a prostration after the prayers of subh and asr. This is because the Messenger of Allah, may Allah bless him and grant him peace, forbade prayer after subh until after the sun had risen, and after asr until the sun had set, and prostration is part of the prayer. So no-one should recite any piece of Qur'an requiring a prostration during these two periods of time.\"   Malik was asked whether a menstruating woman could prostrate if she heard some-one reciting a passage of Qur'an requiring a prostration, and he said, \"Neither a man nor a woman should prostrate unless they are ritually pure.\"   Malik was asked whether a man in the company of a woman who was reciting a passage of Qur'an requiring a prostration should prostrate with her, and he said, \"He does not have to prostrate with her. The prostration is only obligatory for people who are with a man who is leading them. He recites the piece and they prostrate with him. Some one who hears a piece of Qur'an that requires a prostration being recited by a man who is not leading him in prayer does not have to do the prostration.\""}},{"id":19,"idInBook":19,"chapterId":15,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي صَعْصَعَةَ، عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّهُ سَمِعَ رَجُلاً، يَقْرَأُ ‏{‏قُلْ هُوَ اللَّهُ أَحَدٌ‏}‏ يُرَدِّدُهَا فَلَمَّا أَصْبَحَ غَدَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرَ ذَلِكَ لَهُ وَكَأَنَّ الرَّجُلَ يَتَقَالُّهَا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَالَّذِي نَفْسِي بِيَدِهِ إِنَّهَا لَتَعْدِلُ ثُلُثَ الْقُرْآنِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abd ar-Rahman ibn Abdullah\nibn Sasaca from his father that Abu Said al-Khudri heard a man\nreciting Surat al-Ikhlas (Sura 112), repeating it over and over again.\nIn the morning he went to the Messenger of Allah, may Allah bless him\nand grant him peace, and mentioned it to him, as if he thought little\nof it. The Messenger of Allah, may Allah bless him and grant him\npeace, said, \"Bythe One in whose hand my self is, it is equal to one\nthird of the Qur'an.\""}},{"id":20,"idInBook":20,"chapterId":15,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عُبَيْدِ بْنِ حُنَيْنٍ، مَوْلَى آلِ زَيْدِ بْنِ الْخَطَّابِ أَنَّهُ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ أَقْبَلْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَسَمِعَ رَجُلاً يَقْرَأُ ‏{‏قُلْ هُوَ اللَّهُ أَحَدٌ‏}‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَجَبَتْ ‏\"‏ ‏.‏ فَسَأَلْتُهُ مَاذَا يَا رَسُولَ اللَّهِ فَقَالَ ‏\"‏ الْجَنَّةُ ‏\"‏ ‏.‏ فَقَالَ أَبُو هُرَيْرَةَ فَأَرَدْتُ أَنْ أَذْهَبَ إِلَيْهِ فَأُبَشِّرَهُ ثُمَّ فَرِقْتُ أَنْ يَفُوتَنِي الْغَدَاءُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَآثَرْتُ الْغَدَاءَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم ثُمَّ ذَهَبْتُ إِلَى الرَّجُلِ فَوَجَدْتُهُ قَدْ ذَهَبَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ubaydullah ibn Abd ar-Rahman\nthat Ubayd ibn Hunayn, the mawla of the family of Zayd ibn al Khattab,\nsaid that he had heard Abu Hurayra say, \"I was going along with the\nMessenger of Allah, may Allah bless him and grant him peace, when he\nheard a man reciting Surat al-Ikhlas (Sura 112). The Messenger of\nAllah, may Allah bless him and grant him peace, said, 'It is\nobligatory,' and I asked him, 'What is, Messenger of Allah?' and he\nsaid, 'The Garden.' I wanted to tell the man the good news but I was\nafraid that I would miss the midday meal with the Messenger of Allah,\nmay Allah bless him and grant him peace, and I preferred to eat with\nthe Messenger of Allah, may Allah bless him and grant him peace. When\nI went to the man afterwards I found that he had gone.\""}},{"id":21,"idInBook":21,"chapterId":15,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، أَنَّهُ أَخْبَرَهُ أَنَّ ‏{‏قُلْ هُوَ اللَّهُ أَحَدٌ‏}‏ تَعْدِلُ ثُلُثَ الْقُرْآنِ وَأَنَّ ‏{‏تَبَارَكَ الَّذِي بِيَدِهِ الْمُلْكُ‏}‏ تُجَادِلُ عَنْ صَاحِبِهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab that Humayd ibn\nAbd ar-Rahman ibn Awf had told him that Surat al-Ikhlas (Sura 112) was\nequal to a third of the Qur'an, and that Surat al-Mulk (Sura 67)\npleaded for its owner."}},{"id":22,"idInBook":22,"chapterId":15,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ سُمَىٍّ، مَوْلَى أَبِي بَكْرٍ عَنْ أَبِي صَالِحٍ السَّمَّانِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ فِي يَوْمٍ مِائَةَ مَرَّةٍ كَانَتْ لَهُ عَدْلَ عَشْرِ رِقَابٍ وَكُتِبَتْ لَهُ مِائَةُ حَسَنَةٍ وَمُحِيَتْ عَنْهُ مِائَةُ سَيِّئَةٍ وَكَانَتْ لَهُ حِرْزًا مِنَ الشَّيْطَانِ يَوْمَهُ ذَلِكَ حَتَّى يُمْسِيَ وَلَمْ يَأْتِ أَحَدٌ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلاَّ أَحَدٌ عَمِلَ أَكْثَرَ مِنْ ذَلِكَ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Sumayy, the mawla of Abu\nBakr, from Abu Salih as-Samman from Abu Hurayra that the Messenger of\nAllah, may Allah bless him and grant him peace, said, \"Whoever says\n'There is no god but Allah, alone, without any partner. The Kingdom\nand praise belong to Him and He has power over everything' (La ilaha\nilla'llah, wahdahu la sharika lah, lahu'l mulku wa lahu'l hamd, wa\nhuwa ala kulli shay'in qadir) one hundred times a day, it is the same\nfor him as freeing ten slaves. One hundred good actions are written\nfor him and one hundred wrong actions are erased from him, and it is a\nprotection from Shaytan for that day until the night. No-one does\nanything more excellent than what he does except someone who does more\nthan that.\""}},{"id":23,"idInBook":23,"chapterId":15,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ سُمَىٍّ، مَوْلَى أَبِي بَكْرٍ عَنْ أَبِي صَالِحٍ السَّمَّانِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ قَالَ سُبْحَانَ اللَّهِ وَبِحَمْدِهِ فِي يَوْمٍ مِائَةَ مَرَّةٍ حُطَّتْ عَنْهُ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Sumayy, the mawla of Abu\nBakr, from Abu Salih as-Samman from Abu Hurayra that the Messenger of\nAllah, may Allah bless him and grant him peace, said, \"Whoever says,\n'Glory be to Allah and with His praise' (Subhana'llah wa bi-hamdihi)\none hundred times in a day will have his wrong actions taken away from\nhim, even if they are as abundant as the foam on the sea.\""}},{"id":24,"idInBook":24,"chapterId":15,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي عُبَيْدٍ، مَوْلَى سُلَيْمَانَ بْنِ عَبْدِ الْمَلِكِ عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ قَالَ مَنْ سَبَّحَ دُبُرَ كُلِّ صَلاَةٍ ثَلاَثًا وَثَلاَثِينَ وَكَبَّرَ ثَلاَثًا وَثَلاَثِينَ وَحَمِدَ ثَلاَثًا وَثَلاَثِينَ وَخَتَمَ الْمِائَةَ بِلاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ غُفِرَتْ ذُنُوبُهُ وَلَوْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu Ubayd, the mawla of\nSulayman ibn Abd al-Malik, from Ata ibn Yazid al-Laythi that Abu\nHurayra said, \"Whoever says 'Glory be to Allah' (Subhana'llah) thirty-\nthree times and 'Allah is Greater' (Allahu akbar) thirty-three times\nand 'Praise be to Allah' (al-hamdu lillah) thirty-three times, and\nseals the hundred with 'There is no god but Allah, alone without any\npartner. The Kingdom and praise belong to Him and He has power over\neverything' (La ilaha illa'llah, wahdahu la sharika lah, lahu'l mulku\nwa lahu'l hamd, wa huwa ala kulli shay'in qadir) after every prayer\nwill have his wrong actions forgiven him even if they are abundant as\nthe foam on the sea.\""}},{"id":25,"idInBook":25,"chapterId":15,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عُمَارَةَ بْنِ صَيَّادٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ سَمِعَهُ يَقُولُ فِي الْبَاقِيَاتِ الصَّالِحَاتِ إِنَّهَا قَوْلُ الْعَبْدِ اللَّهُ أَكْبَرُ وَسُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَلاَ إِلَهَ إِلاَّ اللَّهُ وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Umara ibn Sayyad had heard\nSaid ibn al Musayyab say about abiding good deeds that they were a\nslave's saying 'Allah is greater' (Allahu akbar) and 'Glory be to\nAllah' (Subahana'llah) and 'Praise be to Allah' (al-hamdu lillah) and\n'There is no god but Allah and there is no power and no strength\nexcept by Allah.' (La ilaha illa'llah wa la hawla wa la\nquwwata illa bi'llah.)"}},{"id":26,"idInBook":26,"chapterId":15,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زِيَادِ بْنِ أَبِي زِيَادٍ، أَنَّهُ قَالَ قَالَ أَبُو الدَّرْدَاءِ أَلاَ أُخْبِرُكُمْ بِخَيْرِ، أَعْمَالِكُمْ وَأَرْفَعِهَا فِي دَرَجَاتِكُمْ وَأَزْكَاهَا عِنْدَ مَلِيكِكُمْ وَخَيْرٍ لَكُمْ مِنْ إِعْطَاءِ الذَّهَبِ وَالْوَرِقِ وَخَيْرٍ لَكُمْ مِنْ أَنْ تَلْقَوْا عَدُوَّكُمْ فَتَضْرِبُوا أَعْنَاقَهُمْ وَيَضْرِبُوا أَعْنَاقَكُمْ قَالُوا بَلَى ‏.‏ قَالَ ذِكْرُ اللَّهِ تَعَالَى ‏.‏ قَالَ زِيَادُ بْنُ أَبِي زِيَادٍ وَقَالَ أَبُو عَبْدِ الرَّحْمَنِ مُعَاذُ بْنُ جَبَلٍ مَا عَمِلَ ابْنُ آدَمَ مِنْ عَمَلٍ أَنْجَى لَهُ مِنْ عَذَابِ اللَّهِ مِنْ ذِكْرِ اللَّهِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Ziyad ibn Abi Ziyad said that\nAbu'd-Darda had said, \"Shall I not tell you the best of your deeds,\nand those that give you the highest rank, and those that are the\npurest with your King, and are better for you than giving gold and\nsilver, and better for you than meeting your enemy and striking their\nnecks?\" They said, \"Of course.\" He said, \"Remembrance (dhikr) of Allah\nta ala.\""}},{"id":27,"idInBook":27,"chapterId":15,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ نُعَيْمِ بْنِ عَبْدِ اللَّهِ الْمُجْمِرِ، عَنْ عَلِيِّ بْنِ يَحْيَى الزُّرَقِيِّ، عَنْ أَبِيهِ، عَنْ رِفَاعَةَ بْنِ رَافِعٍ، أَنَّهُ قَالَ كُنَّا يَوْمًا نُصَلِّي وَرَاءَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَلَمَّا رَفَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم رَأْسَهُ مِنَ الرَّكْعَةِ وَقَالَ ‏\"‏ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ ‏\"‏ ‏.‏ قَالَ رَجُلٌ وَرَاءَهُ رَبَّنَا وَلَكَ الْحَمْدُ حَمْدًا كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ ‏.‏ فَلَمَّا انْصَرَفَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنِ الْمُتَكَلِّمُ آنِفًا ‏\"‏ ‏.‏ فَقَالَ الرَّجُلُ أَنَا يَا رَسُولَ اللَّهِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَقَدْ رَأَيْتُ بِضْعَةً وَثَلاَثِينَ مَلَكًا يَبْتَدِرُونَهَا أَيُّهُمْ يَكْتُبُهُنَّ أَوَّلاً ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me from Nuaym ibn Abdullah ibn al-Mujmir from\nAIi ibn Yahya az-Zuraqi from his father that Rifaa ibn Rafi said, \"One\nday we were praying behind the Messenger of Allah, may Allah bless him\nand grant him peace, when the Messenger of Allah, may Allah bless him\nand grant him peace, raised his head from ruku and said, 'Allah hears\nthe one who praises Him' (Sami Allahu liman hamidah). A man behind him\nsaid, 'Our Lord, praise belongs to you - blessed, pure and abundant\npraise' (Rabbana wa laka'l hamd, hamdan kathiran tayiban mubarakan fihi). When\nthe Messenger of Allah, may Allah bless him and grant him peace, had\nfinished, he said, 'Who was it who spoke just now?' The man said, 'I\ndid, Messenger of Allah,' and the Messenger of Allah, may Allah bless\nhim and grant him peace, said, 'I saw more than thirty angels rushing\nto it to see which one of them would record it first.' \""}},{"id":28,"idInBook":28,"chapterId":15,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لِكُلِّ نَبِيٍّ دَعْوَةٌ يَدْعُو بِهَا فَأُرِيدُ أَنْ أَخْتَبِئَ دَعْوَتِي شَفَاعَةً لأُمَّتِي فِي الآخِرَةِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'z-Zinad from al-Araj from\nAbu Hurayra that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"Every prophet is given a supplication (dua), and I\nwish to preserve my dua as intercession for my community in the next\nworld."}},{"id":29,"idInBook":29,"chapterId":15,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ بَلَغَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَدْعُو فَيَقُولُ ‏\n\"‏ اللَّهُمَّ فَالِقَ الإِصْبَاحِ وَجَاعِلَ اللَّيْلِ سَكَنًا وَالشَّمْسِ وَالْقَمَرِ حُسْبَانًا اقْضِ عَنِّي الدَّيْنَ وَأَغْنِنِي مِنَ الْفَقْرِ وَأَمْتِعْنِي بِسَمْعِي وَبَصَرِي وَقُوَّتِي فِي سَبِيلِكَ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said that he had\nheard that the Messenger of Allah, may Allah bless him and grant him\npeace, used to say the following dua, \"O Allah, it is You who makes\nthe dawn break and makes the night a time for rest and appoints the\nsun and moon to reckon by. Relieve me of debt and enrich me from\npoverty and let me enjoy my hearing, my sight and my strength in Your\nway.\"\n\n\nAllahumma faliqa'l isbah, wa ja ila'l-layli sakana, wa\n'sh-shamsi wa'l-qamari husbana. Iqda anniy addayna, wa'ghnaniy mina'l\nfaqr. Na'mti aniy bi samiy wa basariy, wa quwwatiy fi sabilik."}},{"id":30,"idInBook":30,"chapterId":15,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَقُلْ أَحَدُكُمْ إِذَا دَعَا اللَّهُمَّ اغْفِرْ لِي إِنْ شِئْتَ اللَّهُمَّ ارْحَمْنِي إِنْ شِئْتَ لِيَعْزِمِ الْمَسْأَلَةَ فَإِنَّهُ لاَ مُكْرِهَ لَهُ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'z  Zinad from al-Araj\nfrom Abu Hurayra that the Messenger of Allah, may Allah bless him and\ngrant him peace, said, ''When you are making dua do not say; 'O Allah,\nforgive me if You wish. O Allah, forgive me if you wish.' You should\nbe firm in your asking, for there is no compelling Him.\""}},{"id":31,"idInBook":31,"chapterId":15,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي عُبَيْدٍ، مَوْلَى ابْنِ أَزْهَرَ عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ يُسْتَجَابُ لأَحَدِكُمْ مَا لَمْ يَعْجَلْ فَيَقُولُ قَدْ دَعَوْتُ فَلَمْ يُسْتَجَبْ لِي ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Abu Ubayd,\nthe mawla of Ibn Azhar, from Abu Hurayra that the Messenger of Allah,\nmay Allah bless him and grant him peace, said, \"You will be answered\nas long as you are not impatient and say, 'I have made a dua and I\nhave not been answered .' \""}},{"id":32,"idInBook":32,"chapterId":15,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي عَبْدِ اللَّهِ الأَغَرِّ، وَعَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ يَنْزِلُ رَبُّنَا تَبَارَكَ وَتَعَالَى كُلَّ لَيْلَةٍ إِلَى السَّمَاءِ الدُّنْيَا حِينَ يَبْقَى ثُلُثُ اللَّيْلِ الآخِرُ فَيَقُولُ مَنْ يَدْعُونِي فَأَسْتَجِيبَ لَهُ مَنْ يَسْأَلُنِي فَأُعْطِيَهُ مَنْ يَسْتَغْفِرُنِي فَأَغْفِرَ لَهُ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Abu Abdullah\nal-Agharr and from Abu Salama from Abu Hurayra that the Messenger of\nAllah, may Allah bless him and grant him peace, said, \"Our Lord, the\nBlessed and Exalted, descends every night to the heaven of this world\nwhen the last third of the night is still to come and says, 'Who will\ncall on Me so that I may answer him? Who will ask Me so that I may\ngive him? Who will ask forgiveness of Me so that I may forgive him?' \""}},{"id":33,"idInBook":33,"chapterId":15,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ الْحَارِثِ التَّيْمِيِّ، أَنَّ عَائِشَةَ أُمَّ الْمُؤْمِنِينَ، قَالَتْ كُنْتُ نَائِمَةً إِلَى جَنْبِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَفَقَدْتُهُ مِنَ اللَّيْلِ فَلَمَسْتُهُ بِيَدِي فَوَضَعْتُ يَدِي عَلَى قَدَمَيْهِ وَهُوَ سَاجِدٌ يَقُولُ ‏\n\"‏ أَعُوذُ بِرِضَاكَ مِنْ سَخَطِكَ وَبِمُعَافَاتِكَ مِنْ عُقُوبَتِكَ وَبِكَ مِنْكَ لاَ أُحْصِي ثَنَاءً عَلَيْكَ أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said from Muhammad\nibn Ibrahim ibn al-Harith at-Taymi that A'isha, umm al-muminin said,\n\"I was sleeping by the side of the Messenger of Allah, mayAllah bless\nhim and grant him peace, and I missed him in the night, so I felt for\nhim with my hand and I put my hand on his feet and he was in sajda\nsaying, 'I seek refuge in Your pleasure from Your wrath, and in Your\npardon from Your punishment, and in You from You. I cannot enumerate\nYour praises as You praise Yourself.' \"\n\n\nAudhu bi ridaka min\nsakhatika, wa bi muafatika min uqubatika wa bika minka, la uhsiy\nthana'an alayka, anta kama athnayta ala nafsika."}},{"id":34,"idInBook":34,"chapterId":15,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زِيَادِ بْنِ أَبِي زِيَادٍ، عَنْ طَلْحَةَ بْنِ عُبَيْدِ اللَّهِ بْنِ كَرِيزٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَفْضَلُ الدُّعَاءِ دُعَاءُ يَوْمِ عَرَفَةَ وَأَفْضَلُ مَا قُلْتُ أَنَا وَالنَّبِيُّونَ مِنْ قَبْلِي لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ziyad ibn Abi Ziyad from\nTalha ibn Ubaydullah ibn Kariz that the Messenger of  Allah, may Allah\nbless him and grant him peace, said, \"The best dua is dua on the day\nof Arafa, and the best thing that I or the Prophets before me have\nsaid is 'There is no god but Allah, alone, without any partner' (La\nilaha illa'llah, wahdahu la sharika lah.)\""}},{"id":35,"idInBook":35,"chapterId":15,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزُّبَيْرِ الْمَكِّيِّ، عَنْ طَاوُسٍ الْيَمَانِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُعَلِّمُهُمْ هَذَا الدُّعَاءَ كَمَا يُعَلِّمُهُمُ السُّورَةَ مِنَ الْقُرْآنِ يَقُولُ ‏\n\"‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ جَهَنَّمَ وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'zZubayr al-Makki from\nTawus al-Yamani from Abdullah ibn Abbas that the Messenger of Allah,\nmay Allah bless him and grant him peace, used to teach this dua in the\nsame way that he would teach them a sura of the Qur'an, \"O Allah, I\nseek refuge in You from the torment of Jahannam, and I seek refuge in\nYou from the trial of the Dajjal, and I seek refuge in You from the\ntrial of life and death.\"\n\n\nAllahumma inniy audhu bika min\nadhabi jahannama, wa audhu bika min adhabi'l-qabri, wa audhu bika min\nfitnati'l-mahya wa mamati."}},{"id":36,"idInBook":36,"chapterId":15,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزُّبَيْرِ الْمَكِّيِّ، عَنْ طَاوُسٍ الْيَمَانِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا قَامَ إِلَى الصَّلاَةِ مِنْ جَوْفِ اللَّيْلِ يَقُولُ ‏\n\"‏ اللَّهُمَّ لَكَ الْحَمْدُ أَنْتَ نُورُ السَّمَوَاتِ وَالأَرْضِ وَلَكَ الْحَمْدُ أَنْتَ قَيَّامُ السَّمَوَاتِ وَالأَرْضِ وَلَكَ الْحَمْدُ أَنْتَ رَبُّ السَّمَوَاتِ وَالأَرْضِ وَمَنْ فِيهِنَّ أَنْتَ الْحَقُّ وَقَوْلُكَ الْحَقُّ وَوَعْدُكَ الْحَقُّ وَلِقَاؤُكَ حَقٌّ وَالْجَنَّةُ حَقٌّ وَالنَّارُ حَقٌّ وَالسَّاعَةُ حَقٌّ اللَّهُمَّ لَكَ أَسْلَمْتُ وَبِكَ آمَنْتُ وَعَلَيْكَ تَوَكَّلْتُ وَإِلَيْكَ أَنَبْتُ وَبِكَ خَاصَمْتُ وَإِلَيْكَ حَاكَمْتُ فَاغْفِرْ لِي مَا قَدَّمْتُ وَأَخَّرْتُ وَأَسْرَرْتُ وَأَعْلَنْتُ أَنْتَ إِلَهِي لاَ إِلَهَ إِلاَّ أَنْتَ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'z Zubayr al-Makki from\nTawus al-Yamani from Abdullah ibn Abbas that the Messenger of Allah,\nmay Allah bless him and grant him peace, used to say, when he rose for\nprayer in the middle of the night, \"O Allah, praise belongs to You.\nYou are the light of the heavens and the earth and praise belongs\ntoYou.You are the Sustainer of the heavens and the earth and praise\nbelongs to You. You are the Lord of the heavens and the earth and\nwhoever is in them. You are the Truth, and Your words are true. Your\npromise is true, and the meeting with You is true. The Garden is true\nand the Fire is true and the Hour is true. O Allah, I submit toYou and\nI accept You and I trust in You and I turn to You and I argue by You\nand I summon toYou for judgement. Forgive me what I have sent before\nme and what I have left behind, what I have kept secret and what I\nhave proclaimed, You are my god - there is no god but You.\"\n\n\nAllahumma laka'l-hamdu anta nuru's-samawati wa'l-ardi, wa laka'l-hamdu\nanta qayamu's-Samawati wa'l-ardi, wa laka'l-hamdu anta\nrabbu's-Samawati wa'l-ardi,wamanfihina.Anta'l-haqqu,waqawluka'lhaqqu,\nwa waduka'l-haqqu, wa liqa'uka haqqun, wa jannatu haqqun, wa naru\nhaqqun, wa sactu haqqun. Allahumma laka aslamtu, wa bikaamantu,\nwaalayka tawakaltu, wa ilayka anabtu, wa bika khasamtu, wa ilayka\nhakamtu, fa'ghfirliy ma qadamtu wa akhartu wa asrartu, wa alantu. Anta\nilahiy, la ilaha illa ant."}},{"id":37,"idInBook":37,"chapterId":15,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ جَابِرِ بْنِ عَتِيكٍ، أَنَّهُ قَالَ جَاءَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ فِي بَنِي مُعَاوِيَةَ - وَهِيَ قَرْيَةٌ مِنْ قُرَى الأَنْصَارِ - فَقَالَ هَلْ تَدْرُونَ أَيْنَ صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ مَسْجِدِكُمْ هَذَا فَقُلْتُ لَهُ نَعَمْ وَأَشَرْتُ لَهُ إِلَى نَاحِيَةٍ مِنْهُ فَقَالَ هَلْ تَدْرِي مَا الثَّلاَثُ الَّتِي دَعَا بِهِنَّ فِيهِ فَقُلْتُ نَعَمْ ‏.‏ قَالَ فَأَخْبِرْنِي بِهِنَّ ‏.‏ فَقُلْتُ دَعَا بِأَنْ لاَ يُظْهِرَ عَلَيْهِمْ عَدُوًّا مِنْ غَيْرِهِمْ وَلاَ يُهْلِكَهُمْ بِالسِّنِينَ فَأُعْطِيَهُمَا وَدَعَا بِأَنْ لاَ يَجْعَلَ بَأْسَهُمْ بَيْنَهُمْ فَمُنِعَهَا ‏.‏ قَالَ صَدَقْتَ ‏.‏ قَالَ ابْنُ عُمَرَ فَلَنْ يَزَالَ الْهَرْجُ إِلَى يَوْمِ الْقِيَامَةِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Abdullah ibn Abdullah ibn\nJabir ibn Atik said that Abdullah ibn Umar had come to them in Bani\nMuawiya, one of the villages of the Ansar, and said, \"Do you know\nwhere the Messenger of Allah, may Allah bless him and grant him peace,\nprayed in this mosque of yours? \"I told him, \"Yes,\" and I pointed out\na place near where he was. He said, \"Do you know the three things for\nwhich he made dua here?\" I said \"Yes.\" He said, \"Tell me them then.\" I\nsaid, \"He asked that He would not make an enemy from among the non-\nbelievers triumph over the believers and that He would not destroy the\nbelievers by bad harvests, and he was given both these things. And he\nasked that He would not make the believers fight among themselves, and\nthat was refused.\" Ibn Umar said, \"You have told the truth,\" and he\nadded, \"Turmoil will not cease until the day of rising.\""}},{"id":38,"idInBook":38,"chapterId":15,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، أَنَّهُ كَانَ يَقُولُ مَا مِنْ دَاعٍ يَدْعُو إِلاَّ كَانَ بَيْنَ إِحْدَى ثَلاَثٍ إِمَّا أَنْ يُسْتَجَابَ لَهُ وَإِمَّا أَنْ يُدَّخَرَ لَهُ وَإِمَّا أَنْ يُكَفَّرَ عَنْهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Zayd ibn Aslam used to say,\n\"No-one makes a dua without one of three things happening. Either it\nis answered, or it is stored up for him, or wrong actions are atoned\nfor by it.\""}},{"id":39,"idInBook":39,"chapterId":15,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، قَالَ رَآنِي عَبْدُ اللَّهِ بْنُ عُمَرَ وَأَنَا أَدْعُو، وَأُشِيرُ، بِأَصْبُعَيْنِ أَصْبُعٍ مِنْ كُلِّ يَدٍ فَنَهَانِي ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Abdullah ibn Dinar said,\n\"Abdullah ibn Umar saw me when I was making dua and I was pointing\nwith two fingers, one from each hand, and he forbade me.\""}},{"id":40,"idInBook":40,"chapterId":15,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ سَعِيدَ بْنَ الْمُسَيَّبِ، كَانَ يَقُولُ إِنَّ الرَّجُلَ لَيُرْفَعُ بِدُعَاءِ وَلَدِهِ مِنْ بَعْدِهِ وَقَالَ بِيَدَيْهِ نَحْوَ السَّمَاءِ فَرَفَعَهُمَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said that Said ibn\nal-Musayyab used to say, \"A man is raised by the dua of  his son after\nhis death.\" He spoke with his hands turned upwards, and then lifted\nthem up."}},{"id":41,"idInBook":41,"chapterId":15,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّهُ قَالَ إِنَّمَا أُنْزِلَتْ هَذِهِ الآيَةُ ‏{‏وَلاَ تَجْهَرْ بِصَلاَتِكَ وَلاَ تُخَافِتْ بِهَا وَابْتَغِ بَيْنَ ذَلِكَ سَبِيلاً‏}‏ فِي الدُّعَاءِ ‏.‏ قَالَ يَحْيَى وَسُئِلَ مَالِكٌ عَنِ الدُّعَاءِ فِي الصَّلاَةِ الْمَكْتُوبَةِ فَقَالَ لاَ بَأْسَ بِالدُّعَاءِ فِيهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa that his\nfather said, \"The following ayat was sent down about dua - 'And do not\nbe loud in your prayer and do not be silent in it, but seek a way\nbetween these.' \" (Sura 17 ayat 110)\n\n\nYahya said that Malik\nwas asked about making dua in obligatory prayers and he said, \"There\nis no harm in making dua in them.\""}},{"id":42,"idInBook":42,"chapterId":15,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَدْعُو فَيَقُولُ ‏\n\"‏ اللَّهُمَّ إِنِّي أَسْأَلُكَ فِعْلَ الْخَيْرَاتِ وَتَرْكَ الْمُنْكَرَاتِ وَحُبَّ الْمَسَاكِينِ وَإِذَا أَرَدْتَ فِي النَّاسِ فِتْنَةً فَاقْبِضْنِي إِلَيْكَ غَيْرَ مَفْتُونٍ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that the\nMessenger of Allah, may Allah bless him and grant him peace, used to\nmake dua saying, \"O Allah, I askYou for good actions and for leaving\nwhat is disapproved of and for love of the poor. And if You wish to\ntry people, then bring me to You without being tried.\"\n\n\nAllahumma inniy asa'luka fala'l-khayrati, wa tarqa'l-munqarati, wa\nhubba'l-masakin, wa idha aradta fi'n-nasi fitnatan fa'qbithni ilayka\nghayra maftun."}},{"id":43,"idInBook":43,"chapterId":15,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَا مِنْ دَاعٍ يَدْعُو إِلَى هُدًى إِلاَّ كَانَ لَهُ مِثْلُ أَجْرِ مَنِ اتَّبَعَهُ لاَ يَنْقُصُ ذَلِكَ مِنْ أُجُورِهِمْ شَيْئًا وَمَا مِنْ دَاعٍ يَدْعُو إِلَى ضَلاَلَةٍ إِلاَّ كَانَ عَلَيْهِ مِثْلُ أَوْزَارِهِمْ لاَ يَنْقُصُ ذَلِكَ مِنْ أَوْزَارِهِمْ شَيْئًا ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that the\nMessenger of Allah, may Allah bless him and grant him peace, said, \"No\none calls to guidance without having the same reward as those who\nfollow him without diminishing their rewards at all. And no one calls\nto error without having the same burdens as they do without\ndiminishing their burdens at all.\""}},{"id":44,"idInBook":44,"chapterId":15,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، قَالَ اللَّهُمَّ اجْعَلْنِي مِنْ أَئِمَّةِ الْمُتَّقِينَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Abdullah\nibn Umar said, \"O Allah, make me one of the leaders of the people of\ntaqwa .\"\n\n\nAllahumma jalniy min a'imati'l-mutaqin."}},{"id":45,"idInBook":45,"chapterId":15,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ أَبَا الدَّرْدَاءِ، كَانَ يَقُومُ مِنْ جَوْفِ اللَّيْلِ فَيَقُولُ نَامَتِ الْعُيُونُ وَغَارَتِ النُّجُومُ وَأَنْتَ الْحَىُّ الْقَيُّومُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Abu'd-Darda\nused to rise in the middle of the night and say, \"Eyes have slept, and\nstars have set, and You are the Living and Self Subsistent.\"\n\n\nNamat'l uyun wa ghariti'n-nujum wa anta'lhayyu-l-qayyum."}},{"id":46,"idInBook":46,"chapterId":15,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ عَبْدِ اللَّهِ الصُّنَابِحِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ الشَّمْسَ تَطْلُعُ وَمَعَهَا قَرْنُ الشَّيْطَانِ فَإِذَا ارْتَفَعَتْ فَارَقَهَا ثُمَّ إِذَا اسْتَوَتْ قَارَنَهَا فَإِذَا زَالَتْ فَارَقَهَا فَإِذَا دَنَتْ لِلْغُرُوبِ قَارَنَهَا فَإِذَا غَرَبَتْ فَارَقَهَا ‏\"‏ ‏.‏ وَنَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الصَّلاَةِ فِي تِلْكَ السَّاعَاتِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Zayd ibn Aslam from Ata ibn\nYasar from Abdullah as-Sunabihi that the Messenger of Allah, may Allah\nbless him and grant him peace, said, \"The sun rises and with it is a\nhorn of Shaytan and when the sun gets higher the horn leaves it. Then\nwhen the sun reaches the meridian the horn joins it and when the sun\ndeclines the horn leaves it, and when the sun has nearly set it joins\nit again.\"  The Messenger of Allah,  may Allah bless him and grant him\npeace, forbade prayer at these times."}},{"id":47,"idInBook":47,"chapterId":15,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّهُ قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِذَا بَدَا حَاجِبُ الشَّمْسِ فَأَخِّرُوا الصَّلاَةَ حَتَّى تَبْرُزَ وَإِذَا غَابَ حَاجِبُ الشَّمْسِ فَأَخِّرُوا الصَّلاَةَ حَتَّى تَغِيبَ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa that his\nfather said that the Messenger of Allah, may Allah bless him and grant\nhim peace, used to say, \"Delay the prayer when the edge of the sun\nappears until it is completely in view, and delay the prayer when the\nedge of the sun is disappearing until it has completely disappeared.\""}},{"id":48,"idInBook":48,"chapterId":15,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ الْعَلاَءِ بْنِ عَبْدِ الرَّحْمَنِ، قَالَ دَخَلْنَا عَلَى أَنَسِ بْنِ مَالِكٍ بَعْدَ الظُّهْرِ فَقَامَ يُصَلِّي الْعَصْرَ فَلَمَّا فَرَغَ مِنْ صَلاَتِهِ ذَكَرْنَا تَعْجِيلَ الصَّلاَةِ أَوْ ذَكَرَهَا فَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ تِلْكَ صَلاَةُ الْمُنَافِقِينَ تِلْكَ صَلاَةُ الْمُنَافِقِينَ تِلْكَ صَلاَةُ الْمُنَافِقِينَ يَجْلِسُ أَحَدُهُمْ حَتَّى إِذَا اصْفَرَّتِ الشَّمْسُ وَكَانَتْ بَيْنَ قَرْنَىِ الشَّيْطَانِ - أَوْ عَلَى قَرْنِ الشَّيْطَانِ - قَامَ فَنَقَرَ أَرْبَعًا لاَ يَذْكُرُ اللَّهَ فِيهَا إِلاَّ قَلِيلاً ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that al-Ala ibn Abd ar-Rahman\nsaid, \"We visited Anas ibn Malik after dhuhr and he stood up and\nprayed asr. When he had finished his prayer, we mentioned doing\nprayers early in their time, or he mentioned it, and he said that he\nhad heard the Messenger of Allah, may Allah bless him and grant him\npeace, say, the prayer of the hypocrites, the prayer of the\nhypocrites, the prayer of the hypocrites is that one of them sits\nuntil the sun becomes yellow and is between the horns of Shaytan, or\non the horn of Shaytan, and then gets up and rattles off four rakas,\nhardly remembering Allah in them at all.' \""}},{"id":49,"idInBook":49,"chapterId":15,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَتَحَرَّ أَحَدُكُمْ فَيُصَلِّيَ عِنْدَ طُلُوعِ الشَّمْسِ وَلاَ عِنْدَ غُرُوبِهَا ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat the Messenger of Allah, may Allah bless him and grant him peace,\nsaid, \"You should not intend to pray either at sunrise or sunset.\""}},{"id":50,"idInBook":50,"chapterId":15,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الصَّلاَةِ بَعْدَ الْعَصْرِ حَتَّى تَغْرُبَ الشَّمْسُ وَعَنِ الصَّلاَةِ بَعْدَ الصُّبْحِ حَتَّى تَطْلُعَ الشَّمْسُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Muhammad ibn Yahya ibn Habban\nfrom al Araj from Abu Hurayra that the Messenger of Allah, may Allah\nbless him and grant him peace, forbade prayer after asr until the sun\nhad set, and prayer after subh until the sun had risen."}},{"id":51,"idInBook":51,"chapterId":15,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، كَانَ يَقُولُ لاَ تَحَرَّوْا بِصَلاَتِكُمْ طُلُوعَ الشَّمْسِ وَلاَ غُرُوبَهَا فَإِنَّ الشَّيْطَانَ يَطْلُعُ قَرْنَاهُ مَعَ طُلُوعِ الشَّمْسِ وَيَغْرُبَانِ مَعَ غُرُوبِهَا وَكَانَ يَضْرِبُ النَّاسَ عَلَى تِلْكَ الصَّلاَةِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abdullah ibn Dinar from\nAbdullah ibn Umar that Umar ibn al-Khattab used to say, \"Do not intend\nto do your prayer at either sunrise or sunset, for the horns of\nShaytan rise with the rising of the sun and set with its setting.\"\n\n\nUmar used to beat people for that kind of prayer."}},{"id":52,"idInBook":52,"chapterId":15,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنِ السَّائِبِ بْنِ يَزِيدَ، أَنَّهُ رَأَى عُمَرَ بْنَ الْخَطَّابِ يَضْرِبُ الْمُنْكَدِرَ فِي الصَّلاَةِ بَعْدَ الْعَصْرِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from as-Sa'ib ibn\nYazid that he saw Umar ibn al-Khattab beating al-Munkadir for praying\nafter asr."}}],"chapter":{"id":15,"bookId":7,"arabic":"كتاب القرآن","english":"The Qur'an"}}