{"metadata":{"length":59,"arabic":{"title":"موطأ مالك","author":"الإمام مالك بن أنس","introduction":"كتاب الجنائز"},"english":{"title":"Muwatta Malik","author":"Imam Malik ibn Anas","introduction":"Burials"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":16,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم غُسِّلَ فِي قَمِيصٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Jafar ibn Muhammad from his\nfather that the Messenger of Allah, may Allah bless him and grant him\npeace, was washed in a long shirt."}},{"id":2,"idInBook":2,"chapterId":16,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَيُّوبَ بْنِ أَبِي تَمِيمَةَ السَّخْتِيَانِيِّ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أُمِّ عَطِيَّةَ الأَنْصَارِيَّةِ، قَالَتْ دَخَلَ عَلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ تُوُفِّيَتِ ابْنَتُهُ فَقَالَ ‏\"‏ اغْسِلْنَهَا ثَلاَثًا أَوْ خَمْسًا أَوْ أَكْثَرَ مِنْ ذَلِكَ إِنْ رَأَيْتُنَّ ذَلِكَ بِمَاءٍ وَسِدْرٍ وَاجْعَلْنَ فِي الآخِرَةِ كَافُورًا أَوْ شَيْئًا مِنْ كَافُورٍ فَإِذَا فَرَغْتُنَّ فَآذِنَّنِي ‏\"‏ ‏.‏ قَالَتْ فَلَمَّا فَرَغْنَا آذَنَّاهُ فَأَعْطَانَا حِقْوَهُ فَقَالَ ‏\"‏ أَشْعِرْنَهَا إِيَّاهُ ‏\"‏ ‏.‏ تَعْنِي بِحِقْوِهِ إِزَارَهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ayyub ibn Abi Tamima as-\nSakhtayani from Muhammad ibn Sirin that Umm Atiyya al-Ansariyya said,\n\"The Messenger of Allah, may Allah bless him and grant him peace, came\nto us when his daughter died and said, 'Wash her three times, or five,\nor more than that if you think it necessary, with water and lotus\nleaves, and at the end put on some camphor, or a little camphor, and\nwhen you have finished let me know.' When we finished we told him, and\nhe gave us his waist-wrapper and said, 'Shroud her with this.' \""}},{"id":3,"idInBook":3,"chapterId":16,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، أَنَّ أَسْمَاءَ بِنْتَ عُمَيْسٍ، غَسَّلَتْ أَبَا بَكْرٍ الصِّدِّيقَ حِينَ تُوُفِّيَ ثُمَّ خَرَجَتْ فَسَأَلَتْ مَنْ حَضَرَهَا مِنَ الْمُهَاجِرِينَ فَقَالَتْ إِنِّي صَائِمَةٌ وَإِنَّ هَذَا يَوْمٌ شَدِيدُ الْبَرْدِ فَهَلْ عَلَىَّ مِنْ غُسْلٍ فَقَالُوا لاَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abdullah ibn Abi Bakr that\nAsma bint Umays washed Abu Bakr as-Siddiq when he died. Then she went\nout and asked some of the muhajirun who were there, \"I am fasting and\nthis is an extremely cold day. Do I have to do ghusl?\" They said,\n\"No.\""}},{"id":4,"idInBook":4,"chapterId":16,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ أَنَّهُ سَمِعَ أَهْلَ الْعِلْمِ يَقُولُونَ إِذَا مَاتَتِ الْمَرْأَةُ وَلَيْسَ مَعَهَا نِسَاءٌ يُغَسِّلْنَهَا وَلاَ مِنْ ذَوِي الْمَحْرَمِ أَحَدٌ يَلِي ذَلِكَ مِنْهَا وَلاَ زَوْجٌ يَلِي ذَلِكَ مِنْهَا يُمِّمَتْ فَمُسِحَ بِوَجْهِهَا وَكَفَّيْهَا مِنَ الصَّعِيدِ ‏.‏ قَالَ مَالِكٌ وَإِذَا هَلَكَ الرَّجُلُ وَلَيْسَ مَعَهُ أَحَدٌ إِلاَّ نِسَاءٌ يَمَّمْنَهُ أَيْضًا ‏.‏ قَالَ مَالِكٌ وَلَيْسَ لِغُسْلِ الْمَيِّتِ عِنْدَنَا شَىْءٌ مَوْصُوفٌ وَلَيْسَ لِذَلِكَ صِفَةٌ مَعْلُومَةٌ وَلَكِنْ يُغَسَّلُ فَيُطَهَّرُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard people of\nknowledge say, \"When a woman dies and there are no women with her to\nwash her and no man who has the right by blood ties to take charge of\nthat for her and no husband to take charge of it for her, she should\nbe purified by tayammum ,that is, by wiping her face and hands with\nearth.\"\n\n\nMalik said, \"When a man dies and there are only women\nwith him, they also should purify him with earth .\"\n\n\nMalik\nsaid, \"There is no particular way with us for washing the dead nor any\nrecognised way to do it. They are just washed and purified.\""}},{"id":5,"idInBook":5,"chapterId":16,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كُفِّنَ فِي ثَلاَثَةِ أَثْوَابٍ بِيضٍ سَحُولِيَّةٍ لَيْسَ فِيهَا قَمِيصٌ وَلاَ عِمَامَةٌ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa from his\nfather from A'isha, the wife of the Prophet, may Allah bless him and\ngrant him peace, that the Messenger of Allah, may Allah bless him and\ngrant him peace, was shrouded in three pure white cotton garments,\nnone of which was a long shirt or a turban."}},{"id":6,"idInBook":6,"chapterId":16,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كُفِّنَ فِي ثَلاَثَةِ أَثْوَابٍ بِيضٍ سَحُولِيَّةٍ ‏.‏","english":{"narrator":"","text":""}},{"id":7,"idInBook":7,"chapterId":16,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ قَالَ بَلَغَنِي أَنَّ أَبَا بَكْرٍ الصِّدِّيقَ، قَالَ لِعَائِشَةَ وَهُوَ مَرِيضٌ فِي كَمْ كُفِّنَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَتْ فِي ثَلاَثَةِ أَثْوَابٍ بِيضٍ سَحُولِيَّةٍ ‏.‏ فَقَالَ أَبُو بَكْرٍ خُذُوا هَذَا الثَّوْبَ - لِثَوْبٍ عَلَيْهِ قَدْ أَصَابَهُ مِشْقٌ أَوْ زَعْفَرَانٌ - فَاغْسِلُوهُ ثُمَّ كَفِّنُونِي فِيهِ مَعَ ثَوْبَيْنِ آخَرَيْنِ ‏.‏ فَقَالَتْ عَائِشَةُ وَمَا هَذَا فَقَالَ أَبُو بَكْرٍ الْحَىُّ أَحْوَجُ إِلَى الْجَدِيدِ مِنَ الْمَيِّتِ وَإِنَّمَا هَذَا لِلْمُهْلَةِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Yahya ibn Said said that he\nhad heard that when Abu Bakr as-Siddiq was ill he asked A'isha, \"How\nmany shrouds did the Messenger of Allah, may Allah bless him and grant\nhim peace, have?\" and she replied, \"Three pure white cotton garments.\"\nAbu Bakr said, \"Take this garment (a garment he was wearing on which\nred clay or saffron had fallen) and wash it. Then shroud me in it with\ntwo other garments.\" A'isha said, \"Why's that?\", and Abu Bakr replied,\n\"The living have greater need of the new than the dead. This is only\nfor the body fluids that come out as the body decays.\""}},{"id":8,"idInBook":8,"chapterId":16,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ، أَنَّهُ قَالَ الْمَيِّتُ يُقَمَّصُ وَيُؤَزَّرُ وَيُلَفُّ فِي الثَّوْبِ الثَّالِثِ فَإِنْ لَمْ يَكُنْ إِلاَّ ثَوْبٌ وَاحِدٌ كُفِّنَ فِيهِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Humayd ibn\nAbdar-Rahman ibn Awf that Abdullah ibn Amr ibn al-As said, \"A dead man\nis clothed in a shirt and a waist-wrapper and then wrapped in a third,\nand if he only has one garment he is shrouded in that.\""}},{"id":9,"idInBook":9,"chapterId":16,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم وَأَبَا بَكْرٍ وَعُمَرَ كَانُوا يَمْشُونَ أَمَامَ الْجَنَازَةِ وَالْخُلَفَاءُ هَلُمَّ جَرًّا وَعَبْدُ اللَّهِ بْنُ عُمَرَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab that the Messenger\nof Allah, may Allah bless him and grant him peace, and Abu Bakr and\nUmar as well as the khalifas up until this time and Abdullah ibn Umar,\nwould walk in front of the bier."}},{"id":10,"idInBook":10,"chapterId":16,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ رِبِيعَةَ بْنِ عَبْدِ اللَّهِ بْنِ الْهَدِيرِ، أَنَّهُ أَخْبَرَهُ أَنَّهُ، رَأَى عُمَرَ بْنَ الْخَطَّابِ يَقْدُمُ النَّاسَ أَمَامَ الْجَنَازَةِ فِي جَنَازَةِ زَيْنَبَ بِنْتِ جَحْشٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Muhammad ibn alMunkadir that Rabia ibn\nAbdullah ibn alHadir told him that he had seen Umar ibn al-Khattab\nleading people in front of the bier at the funeral of Zaynab bint\nJahsh."}},{"id":11,"idInBook":11,"chapterId":16,"bookId":7,"arabic":"وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، قَالَ مَا رَأَيْتُ أَبِي قَطُّ فِي جَنَازَةٍ إِلاَّ أَمَامَهَا - قَالَ - ثُمَّ يَأْتِي الْبَقِيعَ فَيَجْلِسُ حَتَّى يَمُرُّوا عَلَيْهِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Hisham ibn Urwa said, \"I only\never saw my father in front of a funeral procession.\" He added, \"Then\nhe would come to al-Baqi and sit down until the procession passed\nhim.\""}},{"id":12,"idInBook":12,"chapterId":16,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، أَنَّهُ قَالَ الْمَشْىُ خَلْفَ الْجَنَازَةِ مِنْ خَطَإِ السُّنَّةِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Ibn Shihab said, \"Walking\nbehind the bier is in contradiction to the sunna.\""}},{"id":13,"idInBook":13,"chapterId":16,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ، أَنَّهَا قَالَتْ لأَهْلِهَا أَجْمِرُوا ثِيَابِي إِذَا مِتُّ ثُمَّ حَنِّطُونِي وَلاَ تَذُرُّوا عَلَى كَفَنِي حِنَاطًا وَلاَ تَتْبَعُونِي بِنَارٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa that Asma\nbint Abi Bakr said to her family, \"Perfume my clothes with incense\nwhen I die and then embalm me. Do not put any of the embalming\nsubstance on my shroud, and do not follow me with a burning torch.\""}},{"id":14,"idInBook":14,"chapterId":16,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ نَهَى أَنْ يُتْبَعَ، بَعْدَ مَوْتِهِ بِنَارٍ ‏.‏ قَالَ يَحْيَى سَمِعْتُ مَالِكًا يَكْرَهُ ذَلِكَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Said ibn Abi Said al-Maqburi\nthat Abu Hurayra forbade anyone to follow him with a burning torch\nafter his death.\n\n\nYahya said, \"I heard Malik disapprove of\nthat.\""}},{"id":15,"idInBook":15,"chapterId":16,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَعَى النَّجَاشِيَّ لِلنَّاسِ فِي الْيَوْمِ الَّذِي مَاتَ فِيهِ وَخَرَجَ بِهِمْ إِلَى الْمُصَلَّى فَصَفَّ بِهِمْ وَكَبَّرَ أَرْبَعَ تَكْبِيرَاتٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Said ibn al-\nMusayyab from Abu Hurayra that the Messenger of Allah, may Allah bless\nhim and grant him peace, announced the death of an Najashi to everyone\non the day that he died, and went out with them to the place of\nprayer, and then formed them into rows and said \"Allah is greater\"\nfour times."}},{"id":16,"idInBook":16,"chapterId":16,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ، أَنَّهُ أَخْبَرَهُ أَنَّ مِسْكِينَةً مَرِضَتْ فَأُخْبِرَ رَسُولُ اللَّهِ صلى الله عليه وسلم - بِمَرَضِهَا وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَعُودُ الْمَسَاكِينَ وَيَسْأَلُ عَنْهُمْ - فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا مَاتَتْ فَآذِنُونِي بِهَا ‏\"‏ ‏.‏ فَخُرِجَ بِجَنَازَتِهَا لَيْلاً فَكَرِهُوا أَنْ يُوقِظُوا رَسُولَ اللَّهِ صلى الله عليه وسلم فَلَمَّا أَصْبَحَ رَسُولُ اللَّهِ صلى الله عليه وسلم أُخْبِرَ بِالَّذِي كَانَ مِنْ شَأْنِهَا فَقَالَ ‏\"‏ أَلَمْ آمُرْكُمْ أَنْ تُؤْذِنُونِي بِهَا ‏\"‏ ‏.‏ فَقَالُوا يَا رَسُولَ اللَّهِ كَرِهْنَا أَنْ نُخْرِجَكَ لَيْلاً وَنُوقِظَكَ ‏.‏ فَخَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى صَفَّ بِالنَّاسِ عَلَى قَبْرِهَا وَكَبَّرَ أَرْبَعَ تَكْبِيرَاتٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab that Abu Umama ibn\nSahl ibn Hunayf told him that once a poor woman fell ill and the\nMessenger of Allah, may Allah bless him and grant him peace, was told\nof her illness, and the Messenger of Allah, may Allah bless him and\ngrant him peace, used to visit poor people frequently and ask after\nthem. The Messenger of Allah, may Allah bless him and grant him peace,\nsaid, \"Let me know if she dies.\" Her bier was brought out at night-\ntime and they did not want to wake up the Messenger of Allah, may\nAllah bless him and grant him peace. In the morning the Messenger of\nAllah, may Allah bless him and grant him peace, was told what had\nhappened to her and he said, \"Didn't I tell you to let me know if she\ndied?\" They replied, \"Messenger of Allah, we did not want to wake you\nup and make you come out in the night.\" Then the Messenger of Allah,\nmay Allah bless him and grant him peace, went out and formed everyone\ninto rows by her grave and said \"Allah is greater\" four times."}},{"id":17,"idInBook":17,"chapterId":16,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ سَأَلَ ابْنَ شِهَابٍ عَنِ الرَّجُلِ، يُدْرِكُ بَعْضَ التَّكْبِيرِ عَلَى الْجَنَازَةِ وَيَفُوتُهُ بَعْضُهُ فَقَالَ يَقْضِي مَا فَاتَهُ مِنْ ذَلِكَ ‏.‏","english":{"narrator":"","text":"Yahya related to me that Malik asked Ibn Shihab about a man who\ncaught some of the takbirs said over the corpse and missed the rest,\nand Ibn Shihab said, \"He completes what he has missed.\""}},{"id":18,"idInBook":18,"chapterId":16,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِيهِ، أَنَّهُ سَأَلَ أَبَا هُرَيْرَةَ كَيْفَ تُصَلِّي عَلَى الْجَنَازَةِ فَقَالَ أَبُو هُرَيْرَةَ أَنَا لَعَمْرُ اللَّهِ، أُخْبِرُكَ أَتَّبِعُهَا، مِنْ أَهْلِهَا فَإِذَا وُضِعَتْ كَبَّرْتُ وَحَمِدْتُ اللَّهَ وَصَلَّيْتُ عَلَى نَبِيِّهِ ثُمَّ أَقُولُ اللَّهُمَّ إِنَّهُ عَبْدُكَ وَابْنُ عَبْدِكَ وَابْنُ أَمَتِكَ كَانَ يَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ أَنْتَ وَأَنَّ مُحَمَّدًا عَبْدُكَ وَرَسُولُكَ وَأَنْتَ أَعْلَمُ بِهِ اللَّهُمَّ إِنْ كَانَ مُحْسِنًا فَزِدْ فِي إِحْسَانِهِ وَإِنْ كَانَ مُسِيئًا فَتَجَاوَزْ عَنْ سَيِّئَاتِهِ اللَّهُمَّ لاَ تَحْرِمْنَا أَجْرَهُ وَلاَ تَفْتِنَّا بَعْدَهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Said ibn Abi Said al-Maqburi\nfrom his father that he had asked Abu Hurayra, \"How do you pray over\nthe dead?\" and Abu Hurayra replied, \"By the Life of Allah, I will tell\nyou! I follow with the family and when the corpse is put down I say\n'Allah is greater' and praise Allah and ask for blessings on His\nProphet. Then I say, 'O Allah, he is Your slave and the son of Your\nmale slave and Your female slave. He used to testify that there is no\ngod but You and that Muhammad is Your slave and Your Messenger, and\nYou know that best. O Allah, if he acted well, then increase for him\nhis good action, and if he acted wrongly, then overlook his wrong\nactions. O Allah, do not deprive us of his reward, and do not try us\nafter him.'\"\n\n\nAllahumma inna huwa abduka wa'bnu abdika wa'bnu\namatika. Kana yash-hadu an la ilaha illa ant wa anna Muhammadan abduka\nwa rasooluka, wa anta alamu bihi. Allahumma in kana muhsinan zid fi\nihsanihi, wa in kana musiyan fa tajawaz an sayatihi. Allahumma la\ntahrimna ajrahu wa lataftina badahu."}},{"id":19,"idInBook":19,"chapterId":16,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ قَالَ سَمِعْتُ سَعِيدَ بْنَ الْمُسَيَّبِ، يَقُولُ صَلَّيْتُ وَرَاءَ أَبِي هُرَيْرَةَ عَلَى صَبِيٍّ لَمْ يَعْمَلْ خَطِيئَةً قَطُّ فَسَمِعْتُهُ يَقُولُ اللَّهُمَّ أَعِذْهُ مِنْ عَذَابِ الْقَبْرِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Yahya ibn Said said that he\nheard Said ibn al-Musayyab say, \"I once prayed behind Abu Hurayra over\na child who had never done a wrong action and I heard him say, 'O\nAllah, give him protection from the torment of the grave.' \""}},{"id":20,"idInBook":20,"chapterId":16,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ لاَ يَقْرَأُ فِي الصَّلاَةِ عَلَى الْجَنَازَةِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nused not to recite when praying over a dead person."}},{"id":21,"idInBook":21,"chapterId":16,"bookId":7,"arabic":"وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ أَبِي حَرْمَلَةَ، مَوْلَى عَبْدِ الرَّحْمَنِ بْنِ أَبِي سُفْيَانَ بْنِ حُوَيْطِبٍ أَنَّ زَيْنَبَ بِنْتَ أَبِي سَلَمَةَ، تُوُفِّيَتْ - وَطَارِقٌ أَمِيرُ الْمَدِينَةِ - فَأُتِيَ بِجَنَازَتِهَا بَعْدَ صَلاَةِ الصُّبْحِ فَوُضِعَتْ بِالْبَقِيعِ ‏.‏ قَالَ وَكَانَ طَارِقٌ يُغَلِّسُ بِالصُّبْحِ ‏.‏ قَالَ ابْنُ أَبِي حَرْمَلَةَ فَسَمِعْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ يَقُولُ لأَهْلِهَا إِمَّا أَنْ تُصَلُّوا عَلَى جَنَازَتِكُمُ الآنَ وَإِمَّا أَنْ تَتْرُكُوهَا حَتَّى تَرْتَفِعَ الشَّمْسُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Muhammad ibn Abi Harmala, the\nmawla of Abd ar-Rahman ibn Abi Sufyan ibn Huwaytib, that Zaynab bint\nAbi Salama died during the time that Tariq was amir of Madina and her\nbier was brought out after subh and put in al-Baqi. He said that Tariq\nused to pray subh right at the beginning of its time. He added, \"I\nheard Abdullah ibn Umar say to the family, 'You can either pray over\nyour dead now or you can wait until the sun comes up.' \""}},{"id":22,"idInBook":22,"chapterId":16,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، قَالَ يُصَلَّى عَلَى الْجَنَازَةِ بَعْدَ الْعَصْرِ وَبَعْدَ الصُّبْحِ إِذَا صُلِّيَتَا لِوَقْتِهِمَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nsaid, \"The prayer for a dead person can be done after asr and subh if\nthese have been prayed at their times.\""}},{"id":23,"idInBook":23,"chapterId":16,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي النَّضْرِ، مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا أَمَرَتْ أَنْ يُمَرَّ عَلَيْهَا بِسَعْدِ بْنِ أَبِي وَقَّاصٍ فِي الْمَسْجِدِ حِينَ مَاتَ لِتَدْعُوَ لَهُ فَأَنْكَرَ ذَلِكَ النَّاسُ عَلَيْهَا فَقَالَتْ عَائِشَةُ مَا أَسْرَعَ النَّاسَ مَا صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى سُهَيْلِ ابْنِ بَيْضَاءَ إِلاَّ فِي الْمَسْجِدِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'n Nadr, the mawla of Umar\nibn Ubaydullah that A'isha, the wife of the Prophet, may Allah bless\nhim and grant him peace, ordered that the body of Sad ibn Abi Waqqas\nbe brought past her in the mosque so that she could make dua for him.\nSome people disapproved of her doing that, and she said, \"How hasty\npeople are! The Messenger of Allah, may Allah bless him and grant him\npeace, only prayed over Suhayl ibn Bayda in the mosque.\""}},{"id":24,"idInBook":24,"chapterId":16,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ قَالَ صُلِّيَ عَلَى عُمَرَ بْنِ الْخَطَّابِ فِي الْمَسْجِدِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nsaid, \"The prayer over Umar ibn al-Khattab was done in the mosque.\""}},{"id":25,"idInBook":25,"chapterId":16,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عُثْمَانَ بْنَ عَفَّانَ، وَعَبْدَ اللَّهِ بْنَ عُمَرَ، وَأَبَا، هُرَيْرَةَ كَانُوا يُصَلُّونَ عَلَى الْجَنَائِزِ بِالْمَدِينَةِ الرِّجَالِ وَالنِّسَاءِ فَيَجْعَلُونَ الرِّجَالَ مِمَّا يَلِي الإِمَامَ وَالنِّسَاءَ مِمَّا يَلِي الْقِبْلَةَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Uthman ibn\nAffan and Abdullah ibn Umar and Abu Hurayra used to pray over the\ndead, both men and women, in Madina. They would put the men nearer to\nthe imam and the women nearer to the qibla."}},{"id":26,"idInBook":26,"chapterId":16,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ إِذَا صَلَّى عَلَى الْجَنَائِزِ يُسَلِّمُ حَتَّى يُسْمِعَ مَنْ يَلِيهِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar,\nwhen he prayed over the dead, would say, \"Peace be upon you\" loud\nenough for whoever was near to him to hear."}},{"id":27,"idInBook":27,"chapterId":16,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقُولُ لاَ يُصَلِّي الرَّجُلُ عَلَى الْجَنَازَةِ إِلاَّ وَهُوَ طَاهِرٌ ‏.‏ قَالَ يَحْيَى سَمِعْتُ مَالِكًا يَقُولُ لَمْ أَرَ أَحَدًا مِنْ أَهْلِ الْعِلْمِ يَكْرَهُ أَنْ يُصَلَّى عَلَى وَلَدِ الزِّنَا وَأُمِّهِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nused to say, \"No-one should pray over a dead person unless he is in\nwudu.\"\n\n\nYahya said that he heard Malik say, \"I have not seen\nany person of knowledge disapproving of praying over either a child\nborn of adultery or its mother.\""}},{"id":28,"idInBook":28,"chapterId":16,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم تُوُفِّيَ يَوْمَ الاِثْنَيْنِ وَدُفِنَ يَوْمَ الثُّلاَثَاءِ وَصَلَّى النَّاسُ عَلَيْهِ أَفْذَاذًا لاَ يَؤُمُّهُمْ أَحَدٌ ‏.‏ فَقَالَ نَاسٌ يُدْفَنُ عِنْدَ الْمِنْبَرِ ‏.‏ وَقَالَ آخَرُونَ يُدْفَنُ بِالْبَقِيعِ ‏.‏ فَجَاءَ أَبُو بَكْرٍ الصِّدِّيقُ فَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ مَا دُفِنَ نَبِيٌّ قَطُّ إِلاَّ فِي مَكَانِهِ الَّذِي تُوُفِّيَ فِيهِ ‏\"‏ ‏.‏ فَحُفِرَ لَهُ فِيهِ فَلَمَّا كَانَ عِنْدَ غُسْلِهِ أَرَادُوا نَزْعَ قَمِيصِهِ فَسَمِعُوا صَوْتًا يَقُولُ لاَ تَنْزِعُوا الْقَمِيصَ فَلَمْ يُنْزَعِ الْقَمِيصُ وَغُسِّلَ وَهُوَ عَلَيْهِ صلى الله عليه وسلم ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that the\nMessenger of Allah, may Allah bless him and grant him peace, died on\nMonday and was buried on Tuesday and people prayed over him\nindividually with no one leading them. Some people said that he would\nbe buried near the mimbar, and others said that he would be buried in\nal-Baqi. Abu Bakr as-Siddiq came and said, \"I heard the Messenger of\nAllah, may Allah bless him and grant him peace, say, 'No prophet was\never buried except in the place where he died.'  \"So a grave was dug\nfor him there. When he was about to be washed they wished to take off\nhis shirt but they heard a voice saying \"Don't take off his shirt,\" so\nthey did not take off his shirt and he was washed with it on, may\nAllah bless him and grant him peace."}},{"id":29,"idInBook":29,"chapterId":16,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّهُ قَالَ كَانَ بِالْمَدِينَةِ رَجُلاَنِ أَحَدُهُمَا يَلْحَدُ وَالآخَرُ لاَ يَلْحَدُ فَقَالُوا أَيُّهُمَا جَاءَ أَوَّلُ عَمِلَ عَمَلَهُ ‏.‏ فَجَاءَ الَّذِي يَلْحَدُ فَلَحَدَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa that his\nfather said, \"There were two men in Madina, one of whom dug graves\nwith a niche in the side wall for the body, and the other who did not,\nand they said, 'Whichever one comes first can do the job,' and the one\nwho dug graves with a niche came first and dug the Messenger of\nAllah's grave, may Allah bless him and grant him peace.\""}},{"id":30,"idInBook":30,"chapterId":16,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ أُمَّ سَلَمَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم كَانَتْ تَقُولُ مَا صَدَّقْتُ بِمَوْتِ النَّبِيِّ صلى الله عليه وسلم حَتَّى سَمِعْتُ وَقْعَ الْكَرَازِينِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Umm Salama,\nthe wife of the Prophet, may Allah bless him and grant him peace, used\nto say, \"I did not believe that the Messenger of Allah, may Allah\nbless him and grant him peace, had died until I heard the pickaxes\nfall.\""}},{"id":31,"idInBook":31,"chapterId":16,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَالَتْ رَأَيْتُ ثَلاَثَةَ أَقْمَارٍ سَقَطْنَ فِي حُجْرَتِي فَقَصَصْتُ رُؤْيَاىَ عَلَى أَبِي بَكْرٍ الصِّدِّيقِ قَالَتْ فَلَمَّا تُوُفِّيَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَدُفِنَ فِي بَيْتِهَا قَالَ لَهَا أَبُو بَكْرٍ هَذَا أَحَدُ أَقْمَارِكِ وَهُوَ خَيْرُهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said that A'isha,\nthe wife of the Prophet, may Allah bless him and grant him peace,\nsaid, \"I saw three moons fall into my room, and I related my vision to\nAbu Bakr as-Siddiq. Then, when the Messenger of Allah died, may Allah\nbless him and grant him peace, and was buried in my house, Abu Bakr\nsaid to me, 'This is one of your moons, and he is the best of them.' \""}},{"id":32,"idInBook":32,"chapterId":16,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ غَيْرِ، وَاحِدٍ، مِمَّنْ يَثِقُ بِهِ أَنَّ سَعْدَ بْنَ أَبِي وَقَّاصٍ وَسَعِيدَ بْنَ زَيْدِ بْنِ عَمْرِو بْنِ نُفَيْلٍ تُوُفِّيَا بِالْعَقِيقِ وَحُمِلاَ إِلَى الْمَدِينَةِ وَدُفِنَا بِهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from more than one reliable source\nthat Sad ibn Abi Waqqas and Said ibn Zayd ibn Amr ibn Nufayl died at\nal-Aqiq and were carried to Madina and buried there."}},{"id":33,"idInBook":33,"chapterId":16,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّهُ قَالَ مَا أُحِبُّ أَنْ أُدْفَنَ، بِالْبَقِيعِ لأَنْ أُدْفَنَ بِغَيْرِهِ أَحَبُّ إِلَىَّ مِنْ أَنْ أُدْفَنَ بِهِ إِنَّمَا هُوَ أَحَدُ رَجُلَيْنِ إِمَّا ظَالِمٌ فَلاَ أُحِبُّ أَنْ أُدْفَنَ مَعَهُ وَإِمَّا صَالِحٌ فَلاَ أُحِبُّ أَنْ تُنْبَشَ لِي عِظَامُهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa that his\nfather said, \"I would not want to be buried in al-Baqi. I would prefer\nto be buried elsewhere. The one who is buried in al-Baqi is one of two\npeople. Either he is unjust (dhalim), and I would not like to be\nburied with him, or he is salih, and I would not like his bones to be\ndisturbed for me.\""}},{"id":34,"idInBook":34,"chapterId":16,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ وَاقِدِ بْنِ عَمْرِو بْنِ سَعْدِ بْنِ مُعَاذٍ، عَنْ نَافِعِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ، عَنْ مَسْعُودِ بْنِ الْحَكَمِ، عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَقُومُ فِي الْجَنَائِزِ ثُمَّ جَلَسَ بَعْدُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said from Wafid ibn\nAmr ibn Said ibn Muadh from Nafi ibn Jubayr ibn Mutim from Masud ibn\nal-Hakam from AIi ibn Abi Talib that the Messenger of Allah, may Allah\nbless him and grant him peace, used to stand up when a funeral\nprocession passed by, and then sit down again afterwards."}},{"id":35,"idInBook":35,"chapterId":16,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَلِيَّ بْنَ أَبِي طَالِبٍ، كَانَ يَتَوَسَّدُ الْقُبُورَ وَيَضْطَجِعُ عَلَيْهَا ‏.‏ قَالَ مَالِكٌ وَإِنَّمَا نُهِيَ عَنِ الْقُعُودِ عَلَى الْقُبُورِ فِيمَا نُرَى لِلْمَذَاهِبِ ‏.‏","english":{"narrator":"","text":"ahya related to me from Malik that he had heard that AIi ibn Abi\nTalib used to rest his head on graves and lie on them.\n\n\nMalik\nsaid, \"As far as we can see ,it is only forbidden to sit on graves to\nrelieve oneself.\""}},{"id":36,"idInBook":36,"chapterId":16,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي بَكْرِ بْنِ عُثْمَانَ بْنِ سَهْلِ بْنِ حُنَيْفٍ، أَنَّهُ سَمِعَ أَبَا أُمَامَةَ بْنَ سَهْلِ بْنِ حُنَيْفٍ، يَقُولُ كُنَّا نَشْهَدُ الْجَنَائِزَ فَمَا يَجْلِسُ آخِرُ النَّاسِ حَتَّى يُؤْذَنُوا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu Bakr ibn Uthman ibn Sahl\nibn Hunayf that he had heard Abu Umama ibn Sahl ibn Hunayf say, \"We\nused to attend funeral processions, and the last of the people would\nnot sit until they had been given permission .\""}},{"id":37,"idInBook":37,"chapterId":16,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ جَابِرِ بْنِ عَتِيكٍ، عَنْ عَتِيكِ بْنِ الْحَارِثِ، - وَهُوَ جَدُّ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ جَابِرٍ أَبُو أُمِّهِ - أَنَّهُ أَخْبَرَهُ أَنَّ جَابِرَ بْنَ عَتِيكٍ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم جَاءَ يَعُودُ عَبْدَ اللَّهِ بْنَ ثَابِتٍ فَوَجَدَهُ قَدْ غُلِبَ عَلَيْهِ فَصَاحَ بِهِ فَلَمْ يُجِبْهُ فَاسْتَرْجَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَالَ ‏\"‏ غُلِبْنَا عَلَيْكَ يَا أَبَا الرَّبِيعِ ‏\"‏ ‏.‏ فَصَاحَ النِّسْوَةُ وَبَكَيْنَ فَجَعَلَ جَابِرٌ يُسَكِّتُهُنَّ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ دَعْهُنَّ فَإِذَا وَجَبَ فَلاَ تَبْكِيَنَّ بَاكِيَةٌ ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ وَمَا الْوُجُوبُ قَالَ ‏\"‏ إِذَا مَاتَ ‏\"‏ ‏.‏ فَقَالَتِ ابْنَتُهُ وَاللَّهِ إِنْ كُنْتُ لأَرْجُو أَنْ تَكُونَ شَهِيدًا فَإِنَّكَ كُنْتَ قَدْ قَضَيْتَ جِهَازَكَ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ اللَّهَ قَدْ أَوْقَعَ أَجْرَهُ عَلَى قَدْرِ نِيَّتِهِ وَمَا تَعُدُّونَ الشَّهَادَةَ ‏\"‏ ‏.‏ قَالُوا الْقَتْلُ فِي سَبِيلِ اللَّهِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الشُّهَدَاءُ سَبْعَةٌ سِوَى الْقَتْلِ فِي سَبِيلِ اللَّهِ الْمَطْعُونُ شَهِيدٌ وَالْغَرِقُ شَهِيدٌ وَصَاحِبُ ذَاتِ الْجَنْبِ شَهِيدٌ وَالْمَبْطُونُ شَهِيدٌ وَالْحَرِقُ شَهِيدٌ وَالَّذِي يَمُوتُ تَحْتَ الْهَدْمِ شَهِيدٌ وَالْمَرْأَةُ تَمُوتُ بِجُمْعٍ شَهِيدٌ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abdullah ibn Abdullah ibn\nJabir ibn Atik that Atik ibn al-Harith, the grandfather of Abdullah\nibn Abdullah ibn Jabir on his mother's side, told him that Jabir ibn\nAtik had told him that the Messenger of Allah, may Allah bless him and\ngrant him peace, came to visit Abdullah ibn Thabit and found him in\nhis death-throes. He called to him but he did not reply. The Messenger\nof Allah, may Allah bless him and grant him peace, said, \"We belong to\nAllah, and to Him we are returning,\" and added, \"You are being taken\nfrom us, Abur-Rabi`.\"  The women cried out and wept, and Jabir began\nto silence them. The Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"Leave them, and when the necessary time comes, none\nof the women should cry.\"  They said, \"Messenger of Allah, what is the\nnecessary time?\" and he replied, \"When he dies.\"  The dying  man's\ndaughter said, \"By Allah, I hope that you will be a martyr, for you\nhave completed your preparations for battle,\" and the Messenger of\nAllah, may Allah bless him and grant him peace, said, \"Allah has made\nhis reward fall according to his intention. What do you consider dying\na martyr to be?\" They said, \"Death in the way of Allah.\" The Messenger\nof Allah, may Allah bless him and grant him peace, said, \"There are\nseven kinds of martyr other than those killed in the way of Allah.\nSomeone who is killed by the plague is a martyr, someone who drowns is\na martyr, someone who dies of pleurisy is a martyr, someone who dies\nof a disease of the belly is a martyr, someone who dies by fire is a\nmartyr, someone who dies under a falling building is a martyr and a\nwoman who dies in childbirth is a martyr.\""}},{"id":38,"idInBook":38,"chapterId":16,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، عَنْ أَبِيهِ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، أَنَّهَا أَخْبَرَتْهُ أَنَّهَا، سَمِعَتْ عَائِشَةَ أُمَّ الْمُؤْمِنِينَ، تَقُولُ وَذُكِرَ لَهَا أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ يَقُولُ إِنَّ الْمَيِّتَ لَيُعَذَّبُ بِبُكَاءِ الْحَىِّ ‏.‏ فَقَالَتْ عَائِشَةُ يَغْفِرُ اللَّهُ لأَبِي عَبْدِ الرَّحْمَنِ أَمَا إِنَّهُ لَمْ يَكْذِبْ وَلَكِنَّهُ نَسِيَ أَوْ أَخْطَأَ إِنَّمَا مَرَّ رَسُولُ اللَّهِ صلى الله عليه وسلم بِيَهُودِيَّةٍ يَبْكِي عَلَيْهَا أَهْلُهَا فَقَالَ ‏\n\"‏ إِنَّكُمْ لَتَبْكُونَ عَلَيْهَا وَإِنَّهَا لَتُعَذَّبُ فِي قَبْرِهَا ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abdullah ibn Abi Bakr from\nhis father that Amra bint Abd ar-Rahman told him that she had heard\nA'isha, the umm al-muminin, say (when it was mentioned to her that\nAbdullah ibn Umar used to say, \"The dead are tormented by the weeping\nof the living\"), \"May Allah forgive Abu Abd ar-Rahman. Of course he\nhas not lied, but he has forgotten, or made a mistake. The Messenger\nof Allah, may Allah bless him and grant him peace, passed by a  jewish\nwoman whose family were crying over her and he said, 'You are crying\nover her, and she is being tormented in her grave. ' \""}},{"id":39,"idInBook":39,"chapterId":16,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَمُوتُ لأَحَدٍ مِنَ الْمُسْلِمِينَ ثَلاَثَةٌ مِنَ الْوَلَدِ فَتَمَسَّهُ النَّارُ إِلاَّ تَحِلَّةَ الْقَسَمِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Said ibn al-\nMusayyab from Abu Hurayra that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"No muslim who has three children die\nwill be touched by the Fire except to fulfil Allah's oath.\""}},{"id":40,"idInBook":40,"chapterId":16,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ أَبِي بَكْرِ بْنِ عَمْرِو بْنِ حَزْمٍ، عَنْ أَبِيهِ، عَنْ أَبِي النَّضْرِ السَّلَمِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ يَمُوتُ لأَحَدٍ مِنَ الْمُسْلِمِينَ ثَلاَثَةٌ مِنَ الْوَلَدِ فَيَحْتَسِبُهُمْ إِلاَّ كَانُوا جُنَّةً مِنَ النَّارِ ‏\"‏ ‏.‏ فَقَالَتِ امْرَأَةٌ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم يَا رَسُولَ اللَّهِ أَوِ اثْنَانِ قَالَ ‏\"‏ أَوِ اثْنَانِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Muhammad ibn Abi Bakr ibn Amr\nibn Hazm from his father from Abu'n-Nadr as-Salami that the Messenger\nof Allah, may Allah bless him and grant him peace, said, \"If three of\na muslim's children die, and he remains content with that, they will\nbe a protection for him from the Fire.\" A woman who was with the\nMessenger of Allah, may Allah bless him and grant him peace, said, \"Or\ntwo, Messengerof Allah?\", and he said, \"Or two.\""}},{"id":41,"idInBook":41,"chapterId":16,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ عَنْ أَبِي الْحُبَابِ، سَعِيدِ بْنِ يَسَارٍ عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَا يَزَالُ الْمُؤْمِنُ يُصَابُ فِي وَلَدِهِ وَحَامَّتِهِ حَتَّى يَلْقَى اللَّهَ وَلَيْسَتْ لَهُ خَطِيئَةٌ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard from Abu'l-Hubab\nSaid ibn Yasar from Abu Hurayra that the Messenger of Allah, may Allah\nbless him and grant him peace, said, \"The mumin continues to be struck\nby misfortune in his children and close friends until he meets Allah\nwith no wrong actions.\""}},{"id":42,"idInBook":42,"chapterId":16,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ بْنِ مُحَمَّدِ بْنِ أَبِي بَكْرٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لِيُعَزِّ الْمُسْلِمِينَ فِي مَصَائِبِهِمُ الْمُصِيبَةُ بِي ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abd ar-Rahman ibn al-Qasim\nibn Muhammad ibn Abi Bakr that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"Let the misfortune that befalls me be\na comfort to the Muslims in their misfortunes.\""}},{"id":43,"idInBook":43,"chapterId":16,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ أُمِّ سَلَمَةَ، زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَصَابَتْهُ مُصِيبَةٌ فَقَالَ كَمَا أَمَرَ اللَّهُ (إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ) اللَّهُمَّ أْجُرْنِي فِي مُصِيبَتِي وَأَعْقِبْنِي خَيْرًا مِنْهَا إِلَّا فَعَلَ اللَّهُ ذَلِكَ بِهِ قَالَتْ أُمُّ سَلَمَةَ فَلَمَّا تُوُفِّيَ أَبُو سَلَمَةَ قُلْتُ ذَلِكَ ثُمَّ قُلْتُ وَمَنْ خَيْرٌ مِنْ أَبِي سَلَمَةَ فَأَعْقَبَهَا اللَّهُ رَسُولَهُ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَتَزَوَّجَهَا","english":{"narrator":"","text":"Yahya related to me from Malik from Rabia ibn Abi Abd ar-Rahman\nfrom Umm Salama, the wife of the Prophet may Allah bless him and grant\nhim peace, that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"If a misfortune befalls some one and he says, as\nAllah has ordered, 'We belong to Allah and to Him we are returning. O\nAllah, reward me in my misfortune and give me better than it\nafterwards,' Allah will do that for him\" (Inna lillahi wa inna ilayhi\nrajiun. Allahumma' jurniy fi musiybatiy, wa a qibhiy khayran minha,\nilla faala 'llahu dhalika bihi.).\n\n\nUmm Salama said, \"When Abu\nSalama died I said that, and then I said, 'Who is better than Abu\nSalama?' \" And then Allah left her the Messenger of Allah, may Allah\nbless him and grant him peace, and he married her."}},{"id":44,"idInBook":44,"chapterId":16,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، أَنَّهُ قَالَ هَلَكَتِ امْرَأَةٌ لِي فَأَتَانِي مُحَمَّدُ بْنُ كَعْبٍ الْقُرَظِيُّ يُعَزِّينِي بِهَا فَقَالَ إِنَّهُ كَانَ فِي بَنِي إِسْرَائِيلَ رَجُلٌ فَقِيهٌ عَالِمٌ عَابِدٌ مُجْتَهِدٌ وَكَانَتْ لَهُ امْرَأَةٌ - وَكَانَ بِهَا مُعْجَبًا وَلَهَا مُحِبًّا - فَمَاتَتْ فَوَجَدَ عَلَيْهَا وَجْدًا شَدِيدًا وَلَقِيَ عَلَيْهَا أَسَفًا حَتَّى خَلاَ فِي بَيْتٍ وَغَلَّقَ عَلَى نَفْسِهِ وَاحْتَجَبَ مِنَ النَّاسِ فَلَمْ يَكُنْ يَدْخُلُ عَلَيْهِ أَحَدٌ وَإِنَّ امْرَأَةً سَمِعَتْ بِهِ فَجَاءَتْهُ فَقَالَتْ إِنَّ لِي إِلَيْهِ حَاجَةً أَسْتَفْتِيهِ فِيهَا لَيْسَ يُجْزِينِي فِيهَا إِلاَّ مُشَافَهَتُهُ فَذَهَبَ النَّاسُ وَلَزِمَتْ بَابَهُ وَقَالَتْ مَا لِي مِنْهُ بُدٌّ ‏.‏ فَقَالَ لَهُ قَائِلٌ إِنَّ هَا هُنَا امْرَأَةً أَرَادَتْ أَنْ تَسْتَفْتِيَكَ وَقَالَتْ إِنْ أَرَدْتُ إِلاَّ مُشَافَهَتَهُ وَقَدْ ذَهَبَ النَّاسُ وَهِيَ لاَ تُفَارِقُ الْبَابَ ‏.‏ فَقَالَ ائْذَنُوا لَهَا ‏.‏ فَدَخَلَتْ عَلَيْهِ فَقَالَتْ إِنِّي جِئْتُكَ أَسْتَفْتِيكَ فِي أَمْرٍ ‏.‏ قَالَ وَمَا هُوَ قَالَتْ إِنِّي اسْتَعَرْتُ مِنْ جَارَةٍ لِي حَلْيًا فَكُنْتُ أَلْبَسُهُ وَأُعِيرُهُ زَمَانًا ثُمَّ إِنَّهُمْ أَرْسَلُوا إِلَىَّ فِيهِ أَفَأُؤَدِّيهِ إِلَيْهِمْ فَقَالَ نَعَمْ وَاللَّهِ ‏.‏ فَقَالَتْ إِنَّهُ قَدْ مَكَثَ عِنْدِي زَمَانًا ‏.‏ فَقَالَ ذَلِكَ أَحَقُّ لِرَدِّكِ إِيَّاهُ إِلَيْهِمْ حِينَ أَعَارُوكِيهِ زَمَانًا ‏.‏ فَقَالَتْ أَىْ يَرْحَمُكَ اللَّهُ أَفَتَأْسَفُ عَلَى مَا أَعَارَكَ اللَّهُ ثُمَّ أَخَذَهُ مِنْكَ وَهُوَ أَحَقُّ بِهِ مِنْكَ فَأَبْصَرَ مَا كَانَ فِيهِ وَنَفَعَهُ اللَّهُ بِقَوْلِهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said that al-Qasim\nibn Muhammad said, \"One of my wives died and Muhammad ibn Kab al\nQuradhi came to console me about her. He told me of one among the Bani\nIsrail who was a diligent, worshipping, knowing and understanding man\nwho had a wife that he admired and loved, and she died. He grieved\nover her intensely and lamented her until he withdrew into a house and\nlocked himself in, hidden from everyone, and no-one visited him. A\nwoman heard about him and went to him, saying, 'I need him to give me\nan opinion. Nothing will satisfy me except what he says about it.'\nEveryone went away, but she stuck to his door and said, 'I must see\nhim.' Someone said to him, 'There is a woman who wishes to ask your\nopinion about something,' and she insisted, 'I will only talk to him\nabout it.'  When everyone had gone away, and she still had not left\nhis door, he said, 'Let her in.' So she went in and saw him and said,\n'I have come to ask your opinion about something.'  He said, 'What is\nit?' She said, 'I borrowed a piece of jewellery from a neighbour of\nmine, and I have worn it and used it for a long time. Then they sent\nto me for it. Should I let them have it back?'  He said, 'Yes, by\nAllah.' She said, 'I have had it for a long time.'  He said, 'It is\nmore correct for you to return it to them, since they have lent it to\nyou for such a long time.'  She said, 'Yes. May Allah have mercy on\nyou. Do you then grieve over what Allah has lent you and then taken\nfrom you, when He has a greater right to it than you?'  Then he saw\nthe situation he was in, and Allah helped him by her words.\""}},{"id":45,"idInBook":45,"chapterId":16,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي الرِّجَالِ، مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أُمِّهِ، عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ أَنَّهُ سَمِعَهَا تَقُولُ، لَعَنَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمُخْتَفِيَ وَالْمُخْتَفِيَةَ يَعْنِي نَبَّاشَ الْقُبُورِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Abu'r-Rijal Muhammad ibn Abd\nar-Rahman heard his mother Amra bint Abd ar-Rahman say, \"The Messenger\nof Allah, may Allah bless him and grant him peace, cursed both men and\nwomen who dug up,\" meaning those who dug up graves."}},{"id":46,"idInBook":46,"chapterId":16,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم كَانَتْ تَقُولُ كَسْرُ عَظْمِ الْمُسْلِمِ مَيْتًا كَكَسْرِهِ وَهُوَ حَىٌّ ‏.‏ تَعْنِي فِي الإِثْمِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that A'isha, the\nwife of the Prophet, may Allah bless him and grant him peace, used to\nsay, \"Breaking the bone of a muslim when he is dead is like breaking\nit when he is alive.\"  She meant if done in wrong action."}},{"id":47,"idInBook":47,"chapterId":16,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ عَبَّادِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، أَنَّ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم أَخْبَرَتْهُ أَنَّهَا سَمِعَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم قَبْلَ أَنْ يَمُوتَ وَهُوَ مُسْتَنِدٌ إِلَى صَدْرِهَا وَأَصْغَتْ إِلَيْهِ يَقُولُ ‏\n\"‏ اللَّهُمَّ اغْفِرْ لِي وَارْحَمْنِي وَأَلْحِقْنِي بِالرَّفِيقِ الأَعْلَى ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa from Abbad\nibn Abdullah ibn az-Zubayr that A'isha, the wife of the Prophet, may\nAllah bless him and grant him peace, told him that she had heard the\nMessenger of Allah, may Allah bless him and grant him peace, say\nbefore he died, while he was leaning on her breast and she was\nlistening to him, \"O Allah, forgive me and have mercy on me and join\nme with the highest company.\""}},{"id":48,"idInBook":48,"chapterId":16,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا مِنْ نَبِيٍّ يَمُوتُ حَتَّى يُخَيَّرَ ‏\"‏ ‏.‏ قَالَتْ فَسَمِعْتُهُ يَقُولُ ‏\"‏ اللَّهُمَّ الرَّفِيقَ الأَعْلَى ‏\"‏ ‏.‏ فَعَرَفْتُ أَنَّهُ ذَاهِبٌ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he heard that A'isha said,\n\"The Messenger of Allah, may Allah bless him and grant him peace,\nsaid, 'No prophet dies until he is given the choice.' \" She continued,\n\"I heard him say ,'O Allah, the highest company,' and I knew that he\nwas going.\""}},{"id":49,"idInBook":49,"chapterId":16,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، قَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ أَحَدَكُمْ إِذَا مَاتَ عُرِضَ عَلَيْهِ مَقْعَدُهُ بِالْغَدَاةِ وَالْعَشِيِّ إِنْ كَانَ مِنْ أَهْلِ الْجَنَّةِ فَمِنْ أَهْلِ الْجَنَّةِ وَإِنْ كَانَ مِنْ أَهْلِ النَّارِ فَمِنْ أَهْلِ النَّارِ يُقَالُ لَهُ هَذَا مَقْعَدُكَ حَتَّى يَبْعَثَكَ اللَّهُ إِلَى يَوْمِ الْقِيَامَةِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nsaid that the Messenger of Allah, may Allah bless him and grant him\npeace, said, \"When you die, your place will be shown to you in the\nmorning and the evening. If you are one of the people of the Garden,\nthen you will be with the people of the Garden, and if you are one of\nthe people of the Fire, then you will be with the people of the Fire.\nYou will be told, 'This is your place of waiting until Allah raises\nyou on the day of rising.' \""}},{"id":50,"idInBook":50,"chapterId":16,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ كُلُّ ابْنِ آدَمَ تَأْكُلُهُ الأَرْضُ إِلاَّ عَجْبَ الذَّنَبِ مِنْهُ خُلِقَ وَفِيهِ يُرَكَّبُ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'z Zinad from al-Araj from\nAbu Hurayra that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"The earth eats all of the son of Adam except the\ncoccyx. He was created from it, and on it he is built.\""}},{"id":51,"idInBook":51,"chapterId":16,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَعْبِ بْنِ مَالِكٍ الْأَنْصَارِيِّ أَنَّهُ أَخْبَرَهُ أَنَّ أَبَاهُ كَعْبَ بْنَ مَالِكٍ كَانَ يُحَدِّثُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّمَا نَسَمَةُ الْمُؤْمِنِ طَيْرٌ يَعْلَقُ فِي شَجَرِ الْجَنَّةِ حَتَّى يَرْجِعَهُ اللَّهُ إِلَى جَسَدِهِ يَوْمَ يَبْعَثُهُ","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab that Abd ar-Rahman\nibn Kab ibn Malik al-Ansari told him that his father, Kab ibn Malik,\nused to relate that the Messenger of Allah, may Allah bless him and\ngrant him peace, said, \"The ruh of the mumin is a bird that sits in\nthe trees of the Garden until Allah returns it to his body on the day\nHe raises him .\""}},{"id":52,"idInBook":52,"chapterId":16,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ قَالَ اللَّهُ تَبَارَكَ وَتَعَالَى إِذَا أَحَبَّ عَبْدِي لِقَائِي أَحْبَبْتُ لِقَاءَهُ وَإِذَا كَرِهَ لِقَائِي كَرِهْتُ لِقَاءَهُ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'z Zinad from al-Araj from\nAbu Hurayra that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"Allah, the Blessed and Exalted, said, 'If My slave\nlongs to meet Me, I long to meet him, and if he is averse to meeting\nMe, I am averse to meeting him.' \""}},{"id":53,"idInBook":53,"chapterId":16,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ قَالَ رَجُلٌ لَمْ يَعْمَلْ حَسَنَةً قَطُّ لأَهْلِهِ إِذَا مَاتَ فَحَرِّقُوهُ ثُمَّ اذْرُوا نِصْفَهُ فِي الْبَرِّ وَنِصْفَهُ فِي الْبَحْرِ فَوَاللَّهِ لَئِنْ قَدَرَ اللَّهُ عَلَيْهِ لَيُعَذِّبَنَّهُ عَذَابًا لاَ يُعَذِّبُهُ أَحَدًا مِنَ الْعَالَمِينَ ‏.‏ فَلَمَّا مَاتَ الرَّجُلُ فَعَلُوا مَا أَمَرَهُمْ بِهِ فَأَمَرَ اللَّهُ الْبَرَّ فَجَمَعَ مَا فِيهِ وَأَمَرَ الْبَحْرَ فَجَمَعَ مَا فِيهِ ثُمَّ قَالَ لِمَ فَعَلْتَ هَذَا قَالَ مِنْ خَشْيَتِكَ يَا رَبِّ وَأَنْتَ أَعْلَمُ ‏.‏ قَالَ فَغَفَرَ لَهُ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'z Zinad from al-Araj from\nAbu Hurayra that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"A man said to his family that he had never done a\ngood action, and that when he died they were to burn him and then\nscatter half of him on the land and half of him on the sea, and by\nAllah, if Allah destined it for him He would punish him with a\npunishment which He had not punished anyone else with in all the\nworlds. When the man died, they did as he had told them. Then Allah\ntold the land to collect everything that was in it, and told the sea\nto collect everything that was in it, and then He said to the man,\n'Why did you do this?' and he said, 'From fear of  You, Lord, and You\nknow best.' \"\n\n\nAbu Hurayra added, \"And He forgave him.\""}},{"id":54,"idInBook":54,"chapterId":16,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنِ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏:‏ ‏\"‏ كُلُّ مَوْلُودٍ يُولَدُ عَلَى الْفِطْرَةِ فَأَبَوَاهُ يُهَوِّدَانِهِ أَوْ يُنَصِّرَانِهِ، كَمَا تُنَاتَجُ الإِبِلُ مِنْ بَهِيمَةٍ جَمْعَاءَ هَلْ تُحِسُّ فِيهَا مِنْ جَدْعَاءَ ‏\"‏ ‏.‏ قَالُوا ‏:‏ يَا رَسُولَ اللَّهِ أَرَأَيْتَ الَّذِي يَمُوتُ وَهُوَ صَغِيرٌ قَالَ ‏:‏ ‏\"‏ اللَّهُ أَعْلَمُ بِمَا كَانُوا عَامِلِينَ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'z Zinad from al-Araj from\nAbu Hurayra that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"Every child is born on the fitra and it is his\nparents who make him a jew or a christian.  Just as a camel is born\nwhole - do you perceive any defect?\" They said, \"Messenger of Allah,\nwhat happens to people who die when they are (very) young?\"  He said,\n\"Allah knows best what they used to do.\""}},{"id":55,"idInBook":55,"chapterId":16,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏:‏ ‏\n\"‏ لاَ تَقُومُ السَّاعَةُ حَتَّى يَمُرَّ الرَّجُلُ بِقَبْرِ الرَّجُلِ فَيَقُولُ يَا لَيْتَنِي مَكَانَهُ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'z Zinad from al-Araj from\nAbu Hurayra that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"The Hour will not come until a man passes by the\ngrave of another and says, 'If only I were in his place.' \""}},{"id":56,"idInBook":56,"chapterId":16,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَلْحَلَةَ الدِّيلِيِّ، عَنْ مَعْبَدِ بْنِ كَعْبِ بْنِ مَالِكٍ، عَنْ أَبِي قَتَادَةَ بْنِ رِبْعِيٍّ، أَنَّهُ كَانَ يُحَدِّثُ ‏:‏ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم مُرَّ عَلَيْهِ بِجَنَازَةٍ فَقَالَ ‏:‏ ‏\"‏ مُسْتَرِيحٌ وَمُسْتَرَاحٌ مِنْهُ ‏\"‏ ‏.‏ قَالُوا ‏:‏ يَا رَسُولَ اللَّهِ مَا الْمُسْتَرِيحُ وَالْمُسْتَرَاحُ مِنْهُ قَالَ ‏:‏ ‏\"‏ الْعَبْدُ الْمُؤْمِنُ يَسْتَرِيحُ مِنْ نَصَبِ الدُّنْيَا وَأَذَاهَا إِلَى رَحْمَةِ اللَّهِ، وَالْعَبْدُ الْفَاجِرُ يَسْتَرِيحُ مِنْهُ الْعِبَادُ وَالْبِلاَدُ وَالشَّجَرُ وَالدَّوَابُّ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Muhammad ibn Amr ibn\nHalhalaad-Dili from Mabad ibn Kab ibn Malik that Abu Qatada ibn Ribi\nused to relate that a funeral procession passed by the Messenger of\nAllah, may Allah bless him and grant him peace, and he said, \"One is\nrelieved and another others are relieved from.\" They said, \"Who is the\none relieved and the one from whom others are relieved?\" He said, \"A\nslave who is mumin is the one who is relieved from the exhaustion and\nsuffering of this world to the mercy of Allah, and a wrong-acting\nslave is the one from whom people, towns, trees and animals are\nrelieved.\""}},{"id":57,"idInBook":57,"chapterId":16,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي النَّضْرِ، مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ أَنَّهُ قَالَ ‏:‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لَمَّا مَاتَ عُثْمَانُ بْنُ مَظْعُونٍ وَمُرَّ بِجَنَازَتِهِ ‏:‏ ‏\n\"‏ ذَهَبْتَ وَلَمْ تَلَبَّسْ مِنْهَا بِشَىْءٍ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Abu'n Nadr, the mawla of Umar\nibn Ubaydullah, said that the Messenger of Allah, may Allah bless him\nand grant him peace, said, when Uthman ibn Madhun's funeral procession\npassed by him, \"You have gone and you were not involved in any of it.\""}},{"id":58,"idInBook":58,"chapterId":16,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ عَلْقَمَةَ بْنِ أَبِي عَلْقَمَةَ، عَنْ أُمِّهِ، أَنَّهَا قَالَتْ سَمِعْتُ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم تَقُولُ ‏:‏ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم ذَاتَ لَيْلَةٍ فَلَبِسَ ثِيَابَهُ ثُمَّ خَرَجَ - قَالَتْ - فَأَمَرْتُ جَارِيَتِي بَرِيرَةَ تَتْبَعُهُ، فَتَبِعَتْهُ حَتَّى جَاءَ الْبَقِيعَ، فَوَقَفَ فِي أَدْنَاهُ مَا شَاءَ اللَّهُ أَنْ يَقِفَ، ثُمَّ انْصَرَفَ فَسَبَقَتْهُ بَرِيرَةُ فَأَخْبَرَتْنِي، فَلَمْ أَذْكُرْ لَهُ شَيْئًا حَتَّى أَصْبَحَ ثُمَّ ذَكَرْتُ ذَلِكَ لَهُ فَقَالَ ‏:‏ ‏\n\"‏ إِنِّي بُعِثْتُ إِلَى أَهْلِ الْبَقِيعِ لأُصَلِّيَ عَلَيْهِمْ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me from AIqama ibn Abi Alqama that his mother\nsaid that she had heard A'isha, the wife of the Prophet, may Allah\nbless him and grant him peace, say, \"The Messenger of Allah, may Allah\nbless him and grant him peace, rose one night and put on his clothes\nand then went out. I ordered my slave-girl, Barira, to follow him, and\nshe followed him until he got to al-Baqi. He stood near it as long as\nAllah willed and then he left. Barira arrived back before him and told\nme and I did not say anything to him until morning, and then I\nmentioned it to him and he explained, 'I was sent out to the people of\nal-Baqi to pray for them.' \""}},{"id":59,"idInBook":59,"chapterId":16,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ ‏:‏ أَسْرِعُوا بِجَنَائِزِكُمْ، فَإِنَّمَا هُوَ خَيْرٌ تُقَدِّمُونَهُ إِلَيْهِ أَوْ شَرٌّ تَضَعُونَهُ عَنْ رِقَابِكُمْ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abu Hurayra said,\n\"Make your funerals speedy, for it is only good that you are advancing\nhim towards, or evil that you are taking off your necks.\""}}],"chapter":{"id":16,"bookId":7,"arabic":"كتاب الجنائز","english":"Burials"}}