{"metadata":{"length":63,"arabic":{"title":"موطأ مالك","author":"الإمام مالك بن أنس","introduction":"كتاب الزكاة"},"english":{"title":"Muwatta Malik","author":"Imam Malik ibn Anas","introduction":"Zakat"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":17,"bookId":7,"arabic":"حَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَمْرِو بْنِ يَحْيَى الْمَازِنِيِّ، عَنْ أَبِيهِ، أَنَّهُ قَالَ سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏:‏ ‏\n\"‏ لَيْسَ فِيمَا دُونَ خَمْسِ ذَوْدٍ صَدَقَةٌ، وَلَيْسَ فِيمَا دُونَ خَمْسِ أَوَاقٍ صَدَقَةٌ، وَلَيْسَ فِيمَا دُونَ خَمْسَةِ أَوْسُقٍ صَدَقَةٌ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Amr ibn Yahya al-Mazini that\nhis father said that he had heard Abu Said al-Khudri say that the\nMessenger of Allah, may Allah bless him and grant him peace, said,\n\"There is no zakat on less than five camels, there is no zakat on less\nthan five awaq (two hundred dirhams of pure silver) and there is no\nzakat on less than five awsuq (three hundred sa).\""}},{"id":2,"idInBook":2,"chapterId":17,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي صَعْصَعَةَ الأَنْصَارِيِّ، ثُمَّ الْمَازِنِيِّ عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏:‏ ‏\n\"‏ لَيْسَ فِيمَا دُونَ خَمْسَةِ أَوْسُقٍ مِنَ التَّمْرِ صَدَقَةٌ، وَلَيْسَ فِيمَا دُونَ خَمْسِ أَوَاقِيَّ مِنَ الْوَرِقِ صَدَقَةٌ، وَلَيْسَ فِيمَا دُونَ خَمْسِ ذَوْدٍ مِنَ الإِبِلِ صَدَقَةٌ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Muhammad ibn Abdullah ibn Abd\narRahman ibn Abi Sasaca al-Ansari from al-Mazini from his father from\nAbu Said al-Khudri that the Messenger of Allah, may Allah bless him\nand grant him peace, said, \"There is no zakat on less than five awsuq\nof dates, there is no zakat on less than five awaq of silver and there\nis no zakat on less than five camels.\""}},{"id":3,"idInBook":3,"chapterId":17,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ ‏:‏ أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ، كَتَبَ إِلَى عَامِلِهِ عَلَى دِمَشْقَ فِي الصَّدَقَةِ ‏:‏ إِنَّمَا الصَّدَقَةُ فِي الْحَرْثِ وَالْعَيْنِ وَالْمَاشِيَةِ ‏.‏ قَالَ مَالِكٌ ‏:‏ وَلاَ تَكُونُ الصَّدَقَةُ إِلاَّ فِي ثَلاَثَةِ أَشْيَاءَ ‏:‏ فِي الْحَرْثِ وَالْعَيْنِ وَالْمَاشِيَةِ ‏.‏","english":{"narrator":"Yahya related to me from Malik that he had heard that Umar ibn\nAbd al-Aziz wrote to his governor in Damascus about zakat saying,\n\"Zakat is paid on the produce of ploughed land, on gold and silver,\nand on livestock.\"\n\n\nMalik said, \"Zakat is only paid on three\nthings:","text":"the produce of ploughed land, gold and silver, and livestock.\""}},{"id":4,"idInBook":4,"chapterId":17,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ عُقْبَةَ، مَوْلَى الزُّبَيْرِ ‏:‏ أَنَّهُ سَأَلَ الْقَاسِمَ بْنَ مُحَمَّدٍ عَنْ مُكَاتَبٍ، لَهُ قَاطَعَهُ بِمَالٍ عَظِيمٍ هَلْ عَلَيْهِ فِيهِ زَكَاةٌ فَقَالَ الْقَاسِمُ ‏:‏ إِنَّ أَبَا بَكْرٍ الصِّدِّيقَ لَمْ يَكُنْ يَأْخُذُ مِنْ مَالٍ زَكَاةً حَتَّى يَحُولَ عَلَيْهِ الْحَوْلُ ‏.‏ قَالَ الْقَاسِمُ بْنُ مُحَمَّدٍ ‏:‏ وَكَانَ أَبُو بَكْرٍ إِذَا أَعْطَى النَّاسَ أَعْطِيَاتِهِمْ يَسْأَلُ الرَّجُلَ هَلْ عِنْدَكَ مِنْ مَالٍ وَجَبَتْ عَلَيْكَ فِيهِ الزَّكَاةُ فَإِذَا قَالَ ‏:‏ نَعَمْ، أَخَذَ مِنْ عَطَائِهِ زَكَاةَ ذَلِكَ الْمَالِ، وَإِنْ قَالَ ‏:‏ لاَ، أَسْلَمَ إِلَيْهِ عَطَاءَهُ وَلَمْ يَأْخُذْ مِنْهُ شَيْئًا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Muhammad ibn Uqba, the mawla\nof az Zubayr, asked al-Qasim ibn Muhammad whether he had to pay any\nzakat on a large sum given to him by his slave to buy his freedom. Al-\nQasim said, \"Abu Bakr as-Siddiq did not take zakat from anyone's\nproperty until it had been in his possession for a year.\"\n\n\nAl-\nQasim ibn Muhammad continued, \"When Abu Bakr gave men their allowances\nhe would ask them, 'Do you have any property on which zakat is due?'\nIf they said, 'Yes,' he would take the zakat on that property out of\ntheir allowances. If they said, 'No,' he would hand over their\nallowances to them without deducting anything from them.\""}},{"id":5,"idInBook":5,"chapterId":17,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عُمَرَ بْنِ حُسَيْنٍ، عَنْ عَائِشَةَ بِنْتِ قُدَامَةَ، عَنْ أَبِيهَا، أَنَّهُ قَالَ ‏:‏ كُنْتُ إِذَا جِئْتُ عُثْمَانَ بْنَ عَفَّانَ أَقْبِضُ عَطَائِي سَأَلَنِي ‏:‏ هَلْ عِنْدَكَ مِنْ مَالٍ وَجَبَتْ عَلَيْكَ فِيهِ الزَّكَاةُ قَالَ فَإِنْ قُلْتُ ‏:‏ نَعَمْ أَخَذَ مِنْ عَطَائِي زَكَاةَ ذَلِكَ الْمَالِ، وَإِنْ قُلْتُ ‏:‏ لاَ، دَفَعَ إِلَىَّ عَطَائِي ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Urwa ibn Husayn from A'isha\nbint Qudama that her father said, \"When I used to come to Uthman ibn\nAffan to collect my allowance he would ask me, 'Do you have any\nproperty on which zakat is due? 'If  I said, 'Yes,' he would deduct\nthe zakat on that property from my allowance, and if I said, 'No,' he\nwould pay me my allowance (in full).\""}},{"id":6,"idInBook":6,"chapterId":17,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقُولُ ‏:‏ لاَ تَجِبُ فِي مَالٍ زَكَاةٌ حَتَّى يَحُولَ عَلَيْهِ الْحَوْلُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nused to say, \"Zakat does not have to be paid on property until a year\nhas elapsed over it.\""}},{"id":7,"idInBook":7,"chapterId":17,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، أَنَّهُ قَالَ ‏:‏ أَوَّلُ مَنْ أَخَذَ مِنَ الأَعْطِيَةِ الزَّكَاةَ مُعَاوِيَةُ بْنُ أَبِي سُفْيَانَ ‏.‏ قَالَ مَالِكٌ ‏:‏ السُّنَّةُ الَّتِي لاَ اخْتِلاَفَ فِيهَا عِنْدَنَا أَنَّ الزَّكَاةَ تَجِبُ فِي عِشْرِينَ دِينَارًا عَيْنًا كَمَا تَجِبُ فِي مِائَتَىْ دِرْهَمٍ ‏.‏ قَالَ مَالِكٌ ‏:‏ لَيْسَ فِي عِشْرِينَ دِينَارًا نَاقِصَةً بَيِّنَةَ النُّقْصَانِ زَكَاةٌ، فَإِنْ زَادَتْ حَتَّى تَبْلُغَ بِزِيَادَتِهَا عِشْرِينَ دِينَارًا وَازِنَةً فَفِيهَا الزَّكَاةُ، وَلَيْسَ فِيمَا دُونَ عِشْرِينَ دِينَارًا عَيْنًا الزَّكَاةُ، وَلَيْسَ فِي مِائَتَىْ دِرْهَمٍ نَاقِصَةً بَيِّنَةَ النُّقْصَانِ زَكَاةٌ، فَإِنْ زَادَتْ حَتَّى تَبْلُغَ بِزِيَادَتِهَا مِائَتَىْ دِرْهَمٍ وَافِيةً فَفِيهَا الزَّكَاةُ، فَإِنْ كَانَتْ تَجُوزُ بِجَوَازِ الْوَازِنَةِ رَأَيْتُ فِيهَا الزَّكَاةَ دَنَانِيرَ كَانَتْ أَوْ دَرَاهِمَ ‏.‏ قَالَ مَالِكٌ فِي رَجُلٍ كَانَتْ عِنْدَهُ سِتُّونَ وَمِائَةُ دِرْهَمٍ وَازِنَةً وَصَرْفُ الدَّرَاهِمِ بِبَلَدِهِ ثَمَانِيَةُ دَرَاهِمَ بِدِينَارٍ ‏:‏ أَنَّهَا لاَ تَجِبُ فِيهَا الزَّكَاةُ، وَإِنَّمَا تَجِبُ الزَّكَاةُ فِي عِشْرِينَ دِينَارًا عَيْنًا أَوْ مِائَتَىْ دِرْهَمٍ ‏.‏ قَالَ مَالِكٌ فِي رَجُلٍ كَانَتْ لَهُ خَمْسَةُ دَنَانِيرَ مِنْ فَائِدَةٍ أَوْ غَيْرِهَا، فَتَجَرَ فِيهَا فَلَمْ يَأْتِ الْحَوْلُ حَتَّى بَلَغَتْ مَا تَجِبُ فِيهِ الزَّكَاةُ ‏:‏ أَنَّهُ يُزَكِّيهَا وَإِنْ لَمْ تَتِمَّ إِلاَّ قَبْلَ أَنْ يَحُولَ عَلَيْهَا الْحَوْلُ بِيَوْمٍ وَاحِدٍ، أَوْ بَعْدَ مَا يَحُولُ عَلَيْهَا الْحَوْلُ بِيَوْمٍ وَاحِدٍ، ثُمَّ لاَ زَكَاةَ فِيهَا حَتَّى يَحُولَ عَلَيْهَا الْحَوْلُ مِنْ يَوْمَ زُكِّيَتْ ‏.‏ وَقَالَ مَالِكٌ فِي رَجُلٍ كَانَتْ لَهُ عَشَرَةُ دَنَانِيرَ فَتَجَرَ فِيهَا فَحَالَ عَلَيْهَا الْحَوْلُ وَقَدْ بَلَغَتْ عِشْرِينَ دِينَارًا ‏:‏ أَنَّهُ يُزَكِّيهَا مَكَانَهَا وَلاَ يَنْتَظِرُ بِهَا أَنْ يَحُولَ عَلَيْهَا الْحَوْلُ مِنْ يَوْمَ بَلَغَتْ مَا تَجِبُ فِيهِ الزَّكَاةُ لِأَنَّ الْحَوْلَ قَدْ حَالَ عَلَيْهَا وَهِيَ عِنْدَهُ عِشْرُونَ ثُمَّ لَا زَكَاةَ فِيهَا حَتَّى يَحُولَ عَلَيْهَا الْحَوْلُ مِنْ يَوْمَ زُكِّيَتْ قَالَ مَالِك الْأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا فِي إِجَارَةِ الْعَبِيدِ وَخَرَاجِهِمْ وَكِرَاءِ الْمَسَاكِينِ وَكِتَابَةِ الْمُكَاتَبِ أَنَّهُ لَا تَجِبُ فِي شَيْءٍ مِنْ ذَلِكَ الزَّكَاةُ قَلَّ ذَلِكَ أَوْ كَثُرَ حَتَّى يَحُولَ عَلَيْهِ الْحَوْلُ مِنْ يَوْمِ يَقْبِضُهُ صَاحِبُهُ. وَقَالَ مَالِك فِي الذَّهَبِ وَالْوَرِقِ يَكُونُ بَيْنَ الشُّرَكَاءِ إِنَّ مَنْ بَلَغَتْ حِصَّتُهُ مِنْهُمْ عِشْرِينَ دِينَارًا عَيْنًا أَوْ مِائَتَيْ دِرْهَمٍ فَعَلَيْهِ فِيهَا الزَّكَاةُ وَمَنْ نَقَصَتْ حِصَّتُهُ عَمَّا تَجِبُ فِيهِ الزَّكَاةُ فَلَا زَكَاةَ عَلَيْهِ وَإِنْ بَلَغَتْ حِصَصُهُمْ جَمِيعًا مَا تَجِبُ فِيهِ الزَّكَاةُ وَكَانَ بَعْضُهُمْ فِي ذَلِكَ أَفْضَلَ نَصِيبًا مِنْ بَعْضٍ أُخِذَ مِنْ كُلِّ إِنْسَانٍ مِنْهُمْ بِقَدْرِ حِصَّتِهِ إِذَا كَانَ فِي حِصَّةِ كُلِّ إِنْسَانٍ مِنْهُمْ مَا تَجِبُ فِيهِ الزَّكَاةُ وَذَلِكَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيْسَ فِيمَا دُونَ خَمْسِ أَوَاقٍ مِنْ الْوَرِقِ صَدَقَةٌ قَالَ مَالِك وَهَذَا أَحَبُّ مَا سَمِعْتُ إِلَيَّ فِي ذَلِكَ قَالَ مَالِك وَإِذَا كَانَتْ لِرَجُلٍ ذَهَبٌ أَوْ وَرِقٌ مُتَفَرِّقَةٌ بِأَيْدِي أُنَاسٍ شَتَّى فَإِنَّهُ يَنْبَغِي لَهُ أَنْ يُحْصِيَهَا جَمِيعًا ثُمَّ يُخْرِجَ مَا وَجَبَ عَلَيْهِ مِنْ زَكَاتِهَا كُلِّهَا قَالَ مَالِك وَمَنْ أَفَادَ ذَهَبًا أَوْ وَرِقًا إِنَّهُ لَا زَكَاةَ عَلَيْهِ فِيهَا حَتَّى يَحُولَ عَلَيْهَا الْحَوْلُ مِنْ يَوْمَ أَفَادَهَا","english":{"narrator":"","text":"Yahya related to me from Malik that Ibn Shihab said, \"The first\nperson to deduct zakat from allowances was Muawiya ibn Abi Sufyan.\"\n(i.e. the deduction being made automatically) .\n\n\nMalik said,\n\"The agreed sunna with us is that zakat has to be paid on twenty\ndinars (of gold coin), in the same way as it has to be paid on two\nhundred dirhams (of silver).\"\n\n\nMalik said, \"There is no zakat\nto pay on (gold) that is clearly less than twenty dinars (in weight)\nbut if it increases so that by the increase the amount reaches a full\ntwenty dinars in weight then zakat has to be paid. Similarly, there is\nno zakat to pay on (silver) that is clearly less than two hundred\ndirhams (in weight), but if it increases so that by the increase the\namount reaches a full two hundred dirhams in weight then zakat has to\nbe paid. If it passes the full weight then I think there is zakat to\npay, whether it be dinars or dirhams.\" (i.e. the zakat is assessed by\nthe weight and not the number of the coins.)\n\n\nMalik said,\nabout a man who had one hundred and sixty dirhams by weight, and the\nexchange rate in his town was eight dirhams to a dinar, that he did\nnot have to pay any zakat. Zakat had only to be paid on twenty dinars\nof gold or two hundred dirhams.\n\n\nMalik said, in the case of a\nman who acquired five dinars from a transaction or in some other way\nwhich he then invested in trade, that, as soon as it increased to a\nzakatable amount and then a year elapsed, he had to pay zakat on it,\neven if the zakatable amount was reached one day before or one day\nafter the passing of a year. There was then no zakat to pay on it from\nthe day the zakat was taken until a year had elapsed over it.\n\n\nMalik said, in the similar case of a man who had in his possession ten\ndinars which he invested in trade and which reached twenty dinars by\nthe time one year had elapsed over them, that he paid zakat on them\nright then and did not wait until a year had elapsed over them,\n(counting) from the day when they actually reached the zakatable\namount. This was because a year had elapsed over the original dinars\nand there were now twenty of them in his possession. After that there\nwas no zakat to pay on them from the day the zakat was paid until\nanother year had elapsed over them.\n\n\nMalik said, \"What we are\nagreed upon (here in Madina) regarding income from hiring out slaves,\nrent from property, and the sums received when a slave buys his\nfreedom, is that no zakat is due on any of it, whether great or small,\nfrom the day the owner takes possession of it until a year has elapsed\nover it from the day when the owner takes possession of it.\"\n\n\nMalik said, in the case of gold and silver which was shared between\ntwo co-owners, that zakat was due from any one whose share reached\ntwenty dinars of gold, or two hundred dirhams of silver, and that no\nzakat was due from anyone whose share fell short of this zakatable\namount. If all the shares reached the zakatable amount and the shares\nwere not equally divided, zakat was taken from each man according to\nthe measure of his share. This applied only when the share of each man\namong them reached the zakatable amount, because the Messenger of\nAllah, may Allah bless him and grant him peace, had said, \"There is no\nzakat to pay on less than five awaq of silver.\"\n\n\nMalik\ncommented, \"This is what I prefer most out of what I have heard about\nthe matter.\"\n\n\nMalik said, \"When a man has gold and silver\ndispersed among various people he must add it all up together and then\ntake out the zakat due on the total sum .\"\n\n\nMalik said, \"No\nzakat is due from some one who acquires gold or silver until a year\nhas elapsed over his acquisition from the day it became his.\""}},{"id":8,"idInBook":8,"chapterId":17,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ غَيْرِ، وَاحِدٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَطَعَ لِبِلاَلِ بْنِ الْحَارِثِ الْمُزَنِيِّ مَعَادِنَ الْقَبَلِيَّةِ - وَهِيَ مِنْ نَاحِيَةِ الْفُرْعِ - فَتِلْكَ الْمَعَادِنُ لاَ يُؤْخَذُ مِنْهَا إِلَى الْيَوْمِ إِلاَّ الزَّكَاةُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Rabia ibn Abi Abd ar-Rahman from more than one source that the Messenger of Allah, may Allah bless him and grant him peace, assigned the mines of al Qabaliyya, which is in the direction of al-Fur, to Bilal ibn Harith al-Mazini, and nothing has been taken from them up to this day except zakat."}},{"id":9,"idInBook":9,"chapterId":17,"bookId":7,"arabic":"","english":{"narrator":"","text":"Malik said, \"In my opinion, and Allah knows best, nothing is taken from what comes out of mines until what comes out of them reaches a value of twenty gold dinars or two hundred silver dirhams. When it reaches that amount there is zakat to pay on it where it is on the spot. Zakat is levied on anything over that, according to how much of it there is as long as there continues to be a supply from the mine. If the vein runs out, and then after a while more becomes obtainable, the new supply is dealt with in the same way as the first, and payment of zakat on it is begun on it as it was begun on the first.   Malik said, \"Mines are dealt with like crops, and the same procedure is applied to both. Zakat is deducted from what comes out of a mine on the day it comes out, without waiting for a year, just as a tenth is taken from a crop at the time it is harvested, without waiting for a year to elapse over it.\""}},{"id":10,"idInBook":10,"chapterId":17,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، وَعَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ فِي الرِّكَازِ الْخُمُسُ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Said ibn al- Musayyab and from Abu Salama ibn Abd ar-Rahman from Abu Hurayra that the Messenger of Allah, may Allah bless him and grant him peace ,said, \"There is a tax of a fifth on buried treasure.\""}},{"id":11,"idInBook":11,"chapterId":17,"bookId":7,"arabic":"","english":{"narrator":"","text":"Malik said, \"The position which we are agreed upon, and which I have heard the people of knowledge mentioning, is that rikaz refers to treasure which has been found which was buried during the jahiliyya, as long as neither capital is required, nor expense, great labour or inconvenience incurred in recovering it. If capital is required or great labour is incurred, or on one occasion the mark is hit and on another it is missed, then it is not rikaz.\""}},{"id":12,"idInBook":12,"chapterId":17,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، أَنَّ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم كَانَتْ تَلِي بَنَاتِ أَخِيهَا يَتَامَى فِي حَجْرِهَا لَهُنَّ الْحَلْىُ فَلاَ تُخْرِجُ مِنْ حُلِيِّهِنَّ الزَّكَاةَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abd ar-Rahman ibn al-Qasim\nfrom his father that A'isha, the wife of the Prophet, may Allah bless\nhim and grant him peace, used to look after the orphaned daughters of\nher brother in her house. They had jewellery (which they wore) and she\ndid not take zakat from this jewellery of theirs."}},{"id":13,"idInBook":13,"chapterId":17,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يُحَلِّي بَنَاتِهُ وَجَوَارِيَهُ الذَّهَبَ ثُمَّ لاَ يُخْرِجُ مِنْ حُلِيِّهِنَّ الزَّكَاةَ ‏.‏ قَالَ مَالِكٌ مَنْ كَانَ عِنْدَهُ تِبْرٌ أَوْ حَلْىٌ مِنْ ذَهَبٍ أَوْ فِضَّةٍ لاَ يُنْتَفَعُ بِهِ لِلُبْسٍ فَإِنَّ عَلَيْهِ فِيهِ الزَّكَاةَ فِي كُلِّ عَامٍ يُوزَنُ فَيُؤْخَذُ رُبُعُ عُشْرِهِ إِلاَّ أَنْ يَنْقُصَ مِنْ وَزْنِ عِشْرِينَ دِينَارًا عَيْنًا أَوْ مِائَتَىْ دِرْهَمٍ فَإِنْ نَقَصَ مِنْ ذَلِكَ فَلَيْسَ فِيهِ زَكَاةٌ وَإِنَّمَا تَكُونُ فِيهِ الزَّكَاةُ إِذَا كَانَ إِنَّمَا يُمْسِكُهُ لِغَيْرِ اللُّبْسِ فَأَمَّا التِّبْرُ وَالْحُلِيُّ الْمَكْسُورُ الَّذِي يُرِيدُ أَهْلُهُ إِصْلاَحَهُ وَلُبْسَهُ فَإِنَّمَا هُوَ بِمَنْزِلَةِ الْمَتَاعِ الَّذِي يَكُونُ عِنْدَ أَهْلِهِ فَلَيْسَ عَلَى أَهْلِهِ فِيهِ زَكَاةٌ ‏.‏ قَالَ مَالِكٌ لَيْسَ فِي اللُّؤْلُؤِ وَلاَ فِي الْمِسْكِ وَلاَ الْعَنْبَرِ زَكَاةٌ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nused to adorn his daughters and slave-girls with gold jewellery and he\ndid not take any zakat from their jewellery.\n\n\nMalik said,\n\"Anyone who has unminted gold or silver, or gold and silver jewellery\nwhich is not used for wearing, must pay zakat on it every year. It is\nweighed and one-fortieth is taken, unless it falls short of twenty\ndinars of gold or two hundred dirhams of silver, in which case there\nis no zakat to pay. Zakat is paid only when jewellery is kept for\npurposes other than wearing. Bits of gold and silver or broken\njewellery which the owner intends to mend to wear are in the same\nposition as goods which are worn by their owner - no zakat has to be\npaid on them by the owner.\"\n\n\nMalik said, \"There is no zakat\n(to pay) on pearls, musk or amber.\""}},{"id":14,"idInBook":14,"chapterId":17,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ اتَّجِرُوا فِي أَمْوَالِ الْيَتَامَى لاَ تَأْكُلُهَا الزَّكَاةُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Umar ibn\nal-Khattab said, \"Trade with the property of orphans and then it will\nnot be eaten away by zakat.\""}},{"id":15,"idInBook":15,"chapterId":17,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، أَنَّهُ قَالَ كَانَتْ عَائِشَةُ تَلِينِي وَأَخًا لِي يَتِيمَيْنِ فِي حَجْرِهَا فَكَانَتْ تُخْرِجُ مِنْ أَمْوَالِنَا الزَّكَاةَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abd ar-Rahman ibn al-Qasim\nthat his father said, ''A'isha used to look after me and one of my\nbrothers - we were orphans - in her house, and she would take the\nzakat from our property.\""}},{"id":16,"idInBook":16,"chapterId":17,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم كَانَتْ تُعْطِي أَمْوَالَ الْيَتَامَى الَّذِينَ فِي حَجْرِهَا مَنْ يَتَّجِرُ لَهُمْ فِيهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that A'isha, the\nwife of the Prophet, may Allah bless him and grant him peace, used to\ngive the property of the orphans that were in her house to whoever\nwould use it to trade with on their behalf."}},{"id":17,"idInBook":17,"chapterId":17,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ اشْتَرَى لِبَنِي أَخِيهِ - يَتَامَى فِي حَجْرِهِ - مَالاً فَبِيعَ ذَلِكَ الْمَالُ بَعْدُ بِمَالٍ كَثِيرٍ ‏.‏ قَالَ مَالِكٌ لاَ بَأْسَ بِالتِّجَارَةِ فِي أَمْوَالِ الْيَتَامَى لَهُمْ إِذَا كَانَ الْوَلِيُّ مَأْذُونًا فَلاَ أَرَى عَلَيْهِ ضَمَانًا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Yahya ibn Said bought some\nproperty on behalf of his brother's sons who were orphans in his\nhouse, and that that property was sold afterwards for a great deal of\nprofit.\n\n\nMalik said, \"There is no harm in using the property\nof orphans to trade with on their behalf if the one in charge of them\nhas permission. Furthermore, I do not think that he is under any\nliability.\""}},{"id":18,"idInBook":18,"chapterId":17,"bookId":7,"arabic":"","english":{"narrator":"","text":"Yahya related to me that Malik said, \"I consider that if a man\ndies and he has not paid zakat on his property, then zakat is taken\nfrom the third of his property (from which he can make bequests), and\nthe third is not exceeded and the zakat is given priority over\nbequests. In my opinion it is the same as if he had a debt, which is\nwhy I think it should be given priority over bequests.\"\n\n\nMalik\ncontinued, \"This applies if the deceased has asked for the zakat to be\ndeducted. If the deceased has not asked for it to be deducted but his\nfamily do so then that is good, but it is not binding upon them if\nthey do not do it.\"\n\n\nMalik continued, \"The sunna which we are\nall agreed upon is that zakat is not due from someone who inherits a\ndebt (i.e. wealth that was owed to the deceased), or goods, or a\nhouse, or a male or female slave, until a year has elapsed over the\nprice realised from whatever he sells (i.e. slaves or a house, which\nare not zakatable) or over the wealth he inherits, from the day he\nsold the things, or took possession of them.\"\n\n\nMalik said,\n\"The sunna with us is that zakat does not have to be paid on wealth\nthat is inherited until a year has elapsed over it.\""}},{"id":19,"idInBook":19,"chapterId":17,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنِ السَّائِبِ بْنِ يَزِيدَ، أَنَّ عُثْمَانَ بْنَ عَفَّانَ، كَانَ يَقُولُ هَذَا شَهْرُ زَكَاتِكُمْ فَمَنْ كَانَ عَلَيْهِ دَيْنٌ فَلْيُؤَدِّ دَيْنَهُ حَتَّى تَحْصُلَ أَمْوَالُكُمْ فَتُؤَدُّونَ مِنْهُ الزَّكَاةَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from as-Sa'ib ibn\nYazid that Uthman ibn Affan used to say, \"This is the month for you to\npay your zakat. If you have any debts then pay them off so that you\ncan sort out your wealth and take the zakat from it.\""}},{"id":20,"idInBook":20,"chapterId":17,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَيُّوبَ بْنِ أَبِي تَمِيمَةَ السَّخْتِيَانِيِّ، أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ، كَتَبَ فِي مَالٍ قَبَضَهُ بَعْضُ الْوُلاَةِ ظُلْمًا يَأْمُرُ بِرَدِّهِ إِلَى أَهْلِهِ وَيُؤْخَذُ زَكَاتُهُ لِمَا مَضَى مِنَ السِّنِينَ ثُمَّ عَقَّبَ بَعْدَ ذَلِكَ بِكِتَابٍ أَنْ لاَ يُؤْخَذُ مِنْهُ إِلاَّ زَكَاةٌ وَاحِدَةٌ فَإِنَّهُ كَانَ ضِمَارًا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ayyub ibn Abi Tamima as-\nSakhtayani that Umar ibn Abd al-Aziz, when writing about wealth that\none of his governors had collected unjustly, ordered it to be returned\nto its owner and zakat to be taken from it for the years that had\npassed. Then shortly afterwards he revised his order with a message\nthat zakat should only be taken from it once, since it was not wealth\nin hand."}},{"id":21,"idInBook":21,"chapterId":17,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَزِيدَ بْنِ خُصَيْفَةَ، أَنَّهُ سَأَلَ سُلَيْمَانَ بْنَ يَسَارٍ عَنْ رَجُلٍ، لَهُ مَالٌ وَعَلَيْهِ دَيْنٌ مِثْلُهُ أَعَلَيْهِ زَكَاةٌ فَقَالَ لاَ ‏.‏ قَالَ مَالِكٌ الأَمْرُ الَّذِي لاَ اخْتِلاَفَ فِيهِ عِنْدَنَا فِي الدَّيْنِ أَنَّ صَاحِبَهُ لاَ يُزَكِّيهِ حَتَّى يَقْبِضَهُ وَإِنْ أَقَامَ عِنْدَ الَّذِي هُوَ عَلَيْهِ سِنِينَ ذَوَاتِ عَدَدٍ ثُمَّ قَبَضَهُ صَاحِبُهُ لَمْ تَجِبْ عَلَيْهِ إِلاَّ زَكَاةٌ وَاحِدَةٌ فَإِنْ قَبَضَ مِنْهُ شَيْئًا لاَ تَجِبُ فِيهِ الزَّكَاةُ فَإِنَّهُ إِنْ كَانَ لَهُ مَالٌ سِوَى الَّذِي قُبِضَ تَجِبُ فِيهِ الزَّكَاةُ فَإِنَّهُ يُزَكَّى مَعَ مَا قَبَضَ مِنْ دَيْنِهِ ذَلِكَ ‏.‏ قَالَ وَإِنْ لَمْ يَكُنْ لَهُ نَاضٌّ غَيْرُ الَّذِي اقْتَضَى مِنْ دَيْنِهِ وَكَانَ الَّذِي اقْتَضَى مِنْ دَيْنِهِ لاَ تَجِبُ فِيهِ الزَّكَاةُ فَلاَ زَكَاةَ عَلَيْهِ فِيهِ وَلَكِنْ لِيَحْفَظْ عَدَدَ مَا اقْتَضَى فَإِنِ اقْتَضَى بَعْدَ ذَلِكَ عَدَدَ مَا تَتِمُّ بِهِ الزَّكَاةُ مَعَ مَا قَبَضَ قَبْلَ ذَلِكَ فَعَلَيْهِ فِيهِ الزَّكَاةُ ‏.‏ قَالَ فَإِنْ كَانَ قَدِ اسْتَهْلَكَ مَا اقْتَضَى أَوَّلاً أَوْ لَمْ يَسْتَهْلِكْهُ فَالزَّكَاةُ وَاجِبَةٌ عَلَيْهِ مَعَ مَا اقْتَضَى مِنْ دَيْنِهِ فَإِذَا بَلَغَ مَا اقْتَضَى عِشْرِينَ دِينَارًا عَيْنًا أَوْ مِائَتَىْ دِرْهَمٍ فَعَلَيْهِ فِيهِ الزَّكَاةُ ثُمَّ مَا اقْتَضَى بَعْدَ ذَلِكَ مِنْ قَلِيلٍ أَوْ كَثِيرٍ فَعَلَيْهِ الزَّكَاةُ بِحَسَبِ ذَلِكَ ‏.‏ قَالَ مَالِكٌ وَالدَّلِيلُ عَلَى الدَّيْنِ يَغِيبُ أَعْوَامًا ثُمَّ يُقْتَضَى فَلاَ يَكُونُ فِيهِ إِلاَّ زَكَاةٌ وَاحِدَةٌ أَنَّ الْعُرُوضَ تَكُونُ عِنْدَ الرَّجُلِ لِلتِّجَارَةِ أَعْوَامًا ثُمَّ يَبِيعُهَا فَلَيْسَ عَلَيْهِ فِي أَثْمَانِهَا إِلاَّ زَكَاةٌ وَاحِدَةٌ وَذَلِكَ أَنَّهُ لَيْسَ عَلَى صَاحِبِ الدَّيْنِ أَوِ الْعُرُوضِ أَنْ يُخْرِجَ زَكَاةَ ذَلِكَ الدَّيْنِ أَوِ الْعُرُوضِ مِنْ مَالٍ سِوَاهُ وَإِنَّمَا يُخْرِجُ زَكَاةَ كُلِّ شَىْءٍ مِنْهُ وَلاَ يُخْرِجُ الزَّكَاةَ مِنْ شَىْءٍ عَنْ شَىْءٍ غَيْرِهِ ‏.‏ قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا فِي الرَّجُلِ يَكُونُ عَلَيْهِ دَيْنٌ وَعِنْدَهُ مِنَ الْعُرُوضِ مَا فِيهِ وَفَاءٌ لِمَا عَلَيْهِ مِنَ الدَّيْنِ وَيَكُونُ عِنْدَهُ مِنَ النَّاضِّ سِوَى ذَلِكَ مَا تَجِبُ فِيهِ الزَّكَاةُ فَإِنَّهُ يُزَكِّي مَا بِيَدِهِ مِنْ نَاضٍّ تَجِبُ فِيهِ الزَّكَاةُ وَإِنْ لَمْ يَكُنْ عِنْدَهُ مِنَ الْعُرُوضِ وَالنَّقْدِ إِلاَّ وَفَاءُ دَيْنِهِ فَلاَ زَكَاةَ عَلَيْهِ حَتَّى يَكُونَ عِنْدَهُ مِنَ النَّاضِّ فَضْلٌ عَنْ دَيْنِهِ مَا تَجِبُ فِيهِ الزَّكَاةُ فَعَلَيْهِ أَنْ يُزَكِّيَهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yazid ibn Khusayfa that he\nhad asked Sulayman ibn Yasar whether zakat was due from a man who had\nwealth in hand but also owed a debt for the same amount, and he\nreplied, \"No.\"\n\n\nMalik said, \"The position that we are agreed\nupon concerning a debt is that the lender of it does not pay zakat on\nit until he gets it back. Even if it stays with the borrower for a\nnumber of years before the lender collects it, the lender only has to\npay zakat on it once. If he collects an amount of the debt which is\nnot zakatable, and has other wealth which is zakatable, then what he\nhas collected of the debt is added to the rest of his wealth and he\npays zakat on the total sum.\"\n\n\nMalik continued, \"If he has no\nready money other than that which he has collected from his debt, and\nthat does not reach a zakatable amount, then he does not have to pay\nany zakat. He must, however, keep a record of the amount that he has\ncollected and if, later, he collects another amount which, when added\nto what he has already collected, brings zakat into effect, then he\nhas to pay zakat on it.\"\n\n\nMalik continued, \"Zakat is due on\nthis first amount, together with what he has further collected of the\ndebt owed to him, regardless of whether or not he has used up what he\nfirst collected. If what he takes back reaches twenty dinars of gold,\nor two hundred dirhams of silver he pays zakat on it. He pays zakat on\nanything else he takes back afte rthat, whether it be a large or small\namount, according to the amount.\"\n\n\nMalik said, \"What shows\nthat zakat is only taken once from a debt which is out of hand for\nsome years before it is recovered is that if goods remain with a man\nfor trading purposes for some years before he sells them, he only has\nto pay zakat on their prices once. This is because the one who is owed\nthe debt, or owns the goods, should not have to take the zakat on the\ndebt, or the goods, from anything else, since the zakat on anything is\nonly taken from the thing itself, and not from anything else.\"\n\n\nMalik said, \"Our position regarding some onewho owes a debt, and\nhas goods which are worth enough to pay off the debt, and also has an\namount of ready money which is zakatable, is that he pays the zakat on\nthe ready money which he has to hand.  If, however, he only has enough\ngoods and ready money to pay off the debt, then he does not have to\npay any zakat. But if the ready money that he has reaches a zakatable\namount over and above the amount of the debt that he owes, then he\nmust pay zakat on it.\""}},{"id":22,"idInBook":22,"chapterId":17,"bookId":7,"arabic":"حَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ زُرَيْقِ بْنِ حَيَّانَ، - وَكَانَ زُرَيْقٌ عَلَى جَوَازِ مِصْرَ فِي زَمَانِ الْوَلِيدِ وَسُلَيْمَانَ وَعُمَرَ بْنِ عَبْدِ الْعَزِيزِ - فَذَكَرَ أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ كَتَبَ إِلَيْهِ أَنِ انْظُرْ مَنْ مَرَّ بِكَ مِنَ الْمُسْلِمِينَ فَخُذْ مِمَّا ظَهَرَ مِنْ أَمْوَالِهِمْ مِمَّا يُدِيرُونَ مِنَ التِّجَارَاتِ مِنْ كُلِّ أَرْبَعِينَ دِينَارًا دِينَارًا فَمَا نَقَصَ فَبِحِسَابِ ذَلِكَ حَتَّى يَبْلُغَ عِشْرِينَ دِينَارًا فَإِنْ نَقَصَتْ ثُلُثَ دِينَارٍ فَدَعْهَا وَلاَ تَأْخُذْ مِنْهَا شَيْئًا وَمَنْ مَرَّ بِكَ مِنْ أَهْلِ الذِّمَّةِ فَخُذْ مِمَّا يُدِيرُونَ مِنَ التِّجَارَاتِ مِنْ كُلِّ عِشْرِينَ دِينَارًا دِينَارًا فَمَا نَقَصَ فَبِحِسَابِ ذَلِكَ حَتَّى يَبْلُغَ عَشَرَةَ دَنَانِيرَ فَإِنْ نَقَصَتْ ثُلُثَ دِينَارٍ فَدَعْهَا وَلاَ تَأْخُذْ مِنْهَا شَيْئًا وَاكْتُبْ لَهُمْ بِمَا تَأْخُذُ مِنْهُمْ كِتَابًا إِلَى مِثْلِهِ مِنَ الْحَوْلِ ‏.‏ قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا فِيمَا يُدَارُ مِنَ الْعُرُوضِ لِلتِّجَارَاتِ أَنَّ الرَّجُلَ إِذَا صَدَّقَ مَالَهُ ثُمَّ اشْتَرَى بِهِ عَرْضًا بَزًّا أَوْ رَقِيقًا أَوْ مَا أَشْبَهَ ذَلِكَ ثُمَّ بَاعَهُ قَبْلَ أَنْ يَحُولَ عَلَيْهِ الْحَوْلُ فَإِنَّهُ لاَ يُؤَدِّي مِنْ ذَلِكَ الْمَالِ زَكَاةً حَتَّى يَحُولَ عَلَيْهِ الْحَوْلُ مِنْ يَوْمَ صَدَّقَهُ وَأَنَّهُ إِنْ لَمْ يَبِعْ ذَلِكَ الْعَرْضَ سِنِينَ لَمْ يَجِبْ عَلَيْهِ فِي شَىْءٍ مِنْ ذَلِكَ الْعَرْضِ زَكَاةٌ وَإِنْ طَالَ زَمَانُهُ فَإِذَا بَاعَهُ فَلَيْسَ فِيهِ إِلاَّ زَكَاةٌ وَاحِدَةٌ ‏.‏ قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا فِي الرَّجُلِ يَشْتَرِي بِالذَّهَبِ أَوِ الْوَرِقِ حِنْطَةً أَوْ تَمْرًا أَوْ غَيْرَهُمَا لِلتِّجَارَةِ ثُمَّ يُمْسِكُهَا حَتَّى يَحُولَ عَلَيْهَا الْحَوْلُ ثُمَّ يَبِيعُهَا أَنَّ عَلَيْهِ فِيهَا الزَّكَاةَ حِينَ يَبِيعُهَا إِذَا بَلَغَ ثَمَنُهَا مَا تَجِبُ فِيهِ الزَّكَاةُ وَلَيْسَ ذَلِكَ مِثْلَ الْحَصَادِ يَحْصُدُهُ الرَّجُلُ مِنْ أَرْضِهِ وَلاَ مِثْلَ الْجِدَادِ ‏.‏ قَالَ مَالِكٌ وَمَا كَانَ مِنْ مَالٍ عِنْدَ رَجُلٍ يُدِيرُهُ لِلتِّجَارَةِ وَلاَ يَنِضُّ لِصَاحِبِهِ مِنْهُ شَىْءٌ تَجِبُ عَلَيْهِ فِيهِ الزَّكَاةُ فَإِنَّهُ يَجْعَلُ لَهُ شَهْرًا مِنَ السَّنَةِ يُقَوِّمُ فِيهِ مَا كَانَ عِنْدَهُ مِنْ عَرْضٍ لِلتِّجَارَةِ وَيُحْصِي فِيهِ مَا كَانَ عِنْدَهُ مِنْ نَقْدٍ أَوْ عَيْنٍ فَإِذَا بَلَغَ ذَلِكَ كُلُّهُ مَا تَجِبُ فِيهِ الزَّكَاةُ فَإِنَّهُ يُزَكِّيهِ ‏.‏ وَقَالَ مَالِكٌ وَمَنْ تَجَرَ مِنَ الْمُسْلِمِينَ وَمَنْ لَمْ يَتْجُرْ سَوَاءٌ لَيْسَ عَلَيْهِمْ إِلاَّ صَدَقَةٌ وَاحِدَةٌ فِي كُلِّ عَامٍ تَجَرُوا فِيهِ أَوْ لَمْ يَتْجُرُوا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said that Zurayq\nibn Hayyan, who was in charge of Egypt in the time of al-Walid,\nSulayman, and Umar ibn Abd al-'Aziz, mentioned that Umar ibn Abd al-\nAziz had written to him saying, \"Assess the muslims that you come\nacross and take from what is apparent of their wealth and whatever\nmerchandise is in their charge, one dinar for every forty dinars, and\nthe same proportion from what is less than that down to twenty dinars,\nand if the amount falls short of that by one third of a dinar then\nleave it and do not take anything from it.  As for the people of the\nBook that you come across, take from the merchandise in their charge\none dinar for every twenty dinars, and the same proportion from what\nis less than that down to ten dinars, and if the amount falls short by\none third of a dinar leave it and do not take anything from it. Give\nthem a receipt for what you have taken f rom them until the same time\nnext year.\"\n\n\nMalik said, \"The position among us (in Madina)\nconcerning goods which are being managed for trading purposes is that\nif a man pays zakat on his wealth, and then buys goods with it,\nwhether cloth, slaves or something similar, and then sells them before\na year has elapsed over them, he does not pay zakat on that wealth\nuntil a year elapses over it from the day he paid zakat on it. He does\nnot have to pay zakat on any of the goods if he does not sell them for\nsome years, and even if he keeps them for a very long time he still\nonly has to pay zakat on them once when he sells them.\"\n\n\nMalik\nsaid, \"The position among us concerning a man who uses gold or silver\nto buy wheat, dates, or whatever, for trading purposes and keeps it\nuntil a year has elapsed over it and then sells it, is that he only\nhas to pay zakat on it if and when he sells it, if the price reaches a\nzakatable amount. This is therefore not the same as the harvest crops\nthat a man reaps from his land, or the dates that he harvests from his\npalms.\"\n\n\nMalik said, \"A man who has wealth which he invests in\ntrade, but which does not realise a zakatable profit for him, fixes a\nmonth in the year when he takes stock of what goods he has for\ntrading, and counts the gold and silver that he has in ready money,\nand if all of it comes to a zakatable amount he pays zakat on it.\"\n\n\nMalik said, \"The position is the same for muslims who trade\nand muslims who do not. They only have to pay zakat once in any one\nyear, whether they trade in that year or not.\""}},{"id":23,"idInBook":23,"chapterId":17,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، أَنَّهُ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ، وَهُوَ يُسْأَلُ عَنِ الْكَنْزِ، مَا هُوَ فَقَالَ هُوَ الْمَالُ الَّذِي لاَ تُؤَدَّى مِنْهُ الزَّكَاةُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Abdullah ibn Dinar said, \"I\nheard Abdullah ibn Umar being asked what kanz was and he said, 'It is\nwealth on which zakat has not been paid.' \""}},{"id":24,"idInBook":24,"chapterId":17,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ أَبِي صَالِحٍ السَّمَّانِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ كَانَ يَقُولُ مَنْ كَانَ عِنْدَهُ مَالٌ لَمْ يُؤَدِّ زَكَاتَهُ مُثِّلَ لَهُ يَوْمَ الْقِيَامَةِ شُجَاعًا أَقْرَعَ لَهُ زَبِيبَتَانِ يَطْلُبُهُ حَتَّى يُمْكِنَهُ يَقُولُ أَنَا كَنْزُكَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abdullah ibn Dinar from\nAbu's-Salih as-Samman that Abu Hurayra used to say, \"Anyone who has\nwealth on which he has not paid zakat will, on the day of rising, find\nhis wealth made to resemble a whiteheaded serpent with a sac of venom\nin each cheek which will seek him out until it has him in its power,\nsaying, 'I am the wealth that you had hidden away.' \""}},{"id":25,"idInBook":25,"chapterId":17,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ قَرَأَ كِتَابَ عُمَرَ بْنِ الْخَطَّابِ فِي الصَّدَقَةِ قَالَ فَوَجَدْتُ فِيهِ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ كِتَابُ الصَّدَقَةِ فِي أَرْبَعٍ وَعِشْرِينَ مِنَ الإِبِلِ فَدُونَهَا الْغَنَمُ فِي كُلِّ خَمْسٍ شَاةٌ وَفِيمَا فَوْقَ ذَلِكَ إِلَى خَمْسٍ وَثَلاَثِينَ ابْنَةُ مَخَاضٍ فَإِنْ لَمْ تَكُنِ ابْنَةُ مَخَاضٍ فَابْنُ لَبُونٍ ذَكَرٌ وَفِيمَا فَوْقَ ذَلِكَ إِلَى خَمْسٍ وَأَرْبَعِينَ بِنْتُ لَبُونٍ وَفِيمَا فَوْقَ ذَلِكَ إِلَى سِتِّينَ حِقَّةٌ طَرُوقَةُ الْفَحْلِ وَفِيمَا فَوْقَ ذَلِكَ إِلَى خَمْسٍ وَسَبْعِينَ جَذَعَةٌ وَفِيمَا فَوْقَ ذَلِكَ إِلَى تِسْعِينَ ابْنَتَا لَبُونٍ وَفِيمَا فَوْقَ ذَلِكَ إِلَى عِشْرِينَ وَمِائَةٍ حِقَّتَانِ طَرُوقَتَا الْفَحْلِ فَمَا زَادَ عَلَى ذَلِكَ مِنَ الإِبِلِ فَفِي كُلِّ أَرْبَعِينَ بِنْتُ لَبُونٍ وَفِي كُلِّ خَمْسِينَ حِقَّةٌ وَفِي سَائِمَةِ الْغَنَمِ إِذَا بَلَغَتْ أَرْبَعِينَ إِلَى عِشْرِينَ وَمِائَةٍ شَاةٌ وَفِيمَا فَوْقَ ذَلِكَ إِلَى مِائَتَيْنِ شَاتَانِ وَفِيمَا فَوْقَ ذَلِكَ إِلَى ثَلاَثِمِائَةٍ ثَلاَثُ شِيَاهٍ فَمَا زَادَ عَلَى ذَلِكَ فَفِي كُلِّ مِائَةٍ شَاةٌ وَلاَ يُخْرَجُ فِي الصَّدَقَةِ تَيْسٌ وَلاَ هَرِمَةٌ وَلاَ ذَاتُ عَوَارٍ إِلاَّ مَا شَاءَ الْمُصَّدِّقُ وَلاَ يُجْمَعُ بَيْنَ مُفْتَرِقٍ وَلاَ يُفَرَّقُ بَيْنَ مُجْتَمِعٍ خَشْيَةَ الصَّدَقَةِ وَمَا كَانَ مِنْ خَلِيطَيْنِ فَإِنَّهُمَا يَتَرَاجَعَانِ بَيْنَهُمَا بِالسَّوِيَّةِ وَفِي الرِّقَةِ إِذَا بَلَغَتْ خَمْسَ أَوَاقٍ رُبُعُ الْعُشْرِ ‏.‏","english":{"narrator":"Yahya related to me from Malik that he had read what Umar ibn al-\nKhattab had written about zakat, and in it he found:","text":"\"In the\nname of Allah, the Merciful, the ompassionate.\"\n\n\nThe Book of\nZakat.\n\n\nOn twenty-four camels or less zakat is paid with\nsheep, one ewe for every five camels.\n\n\nOn anything above that,\nup to thirty-five camels, a she-camel in its second year, and, if\nthere is no she camel in its second year, a male camel in its third\nyear.\n\n\nOn anything above that, up to forty-five camels, a she-\ncamel in its third year.\n\n\nOn anything above that, up to sixty\ncamels, a she camel in its fourth year that is ready to be sired.\n\n\nOn anything above that, up to seventy-five camels, a she-camel in\nits fifth year.\n\n\nOn anything above that, up to ninety camels,\ntwo she-camels in their third year.\n\n\nOn anything above that,\nup to one hundred and twenty camels, two she-camels in their fourth\nyear that are ready to be sired.\n\n\nOn any number of camels\nabove that, for every forty camels, a she-camel in its third year, and\nfor every fifty, a she-camel in its fourth year.\n\n\nOn grazing\nsheep and goats, if they come to forty or more, up to one hundred and\ntwenty head, one ewe.\n\n\nOn anything above that, up to two\nhundred head, two ewes.\n\n\nOn anything above that, up to three\nhundred, three ewes.\n\n\nOn anything above that, for every\nhundred, one ewe.\n\n\nA ram should not be taken for zakat. nor an\nold or an injured ewe, except as the zakat-collector thinks fit.\n\n\nThose separated should not be gathered together nor should those\ngathered together be separated in order to avoid paying zakat.\n\n\nWhatever belongs to two associates is settled between them\nproportionately.\n\n\nOn silver, if it reaches five awaq (two\nhundred dirhams), one fortieth is paid.\""}},{"id":26,"idInBook":26,"chapterId":17,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ حُمَيْدِ بْنِ قَيْسٍ الْمَكِّيِّ، عَنْ طَاوُسٍ الْيَمَانِيِّ، أَنَّ مُعَاذَ بْنَ جَبَلٍ الأَنْصَارِيَّ، أَخَذَ مِنْ ثَلاَثِينَ بَقَرَةً تَبِيعًا وَمِنْ أَرْبَعِينَ بَقَرَةً مُسِنَّةً وَأُتِيَ بِمَا دُونَ ذَلِكَ فَأَبَى أَنْ يَأْخُذَ مِنْهُ شَيْئًا وَقَالَ لَمْ أَسْمَعْ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فِيهِ شَيْئًا حَتَّى أَلْقَاهُ فَأَسْأَلَهُ ‏.‏ فَتُوُفِّيَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَبْلَ أَنْ يَقْدُمَ مُعَاذُ بْنُ جَبَلٍ ‏.‏ قَالَ يَحْيَى قَالَ مَالِكٌ أَحْسَنُ مَا سَمِعْتُ فِيمَنْ كَانَتْ لَهُ غَنَمٌ عَلَى رَاعِيَيْنِ مُفْتَرِقَيْنِ أَوْ عَلَى رِعَاءٍ مُفْتَرِقِينَ فِي بُلْدَانٍ شَتَّى أَنَّ ذَلِكَ يُجْمَعُ كُلُّهُ عَلَى صَاحِبِهِ فَيُؤَدِّي مِنْهُ صَدَقَتَهُ وَمِثْلُ ذَلِكَ الرَّجُلُ يَكُونُ لَهُ الذَّهَبُ أَوِ الْوَرِقُ مُتَفَرِّقَةً فِي أَيْدِي نَاسٍ شَتَّى أَنَّهُ يَنْبَغِي لَهُ أَنْ يَجْمَعَهَا فَيُخْرِجَ مِنْهَا مَا وَجَبَ عَلَيْهِ فِي ذَلِكَ مِنْ زَكَاتِهَا ‏.‏ وَقَالَ يَحْيَى قَالَ مَالِكٌ فِي الرَّجُلِ يَكُونُ لَهُ الضَّأْنُ وَالْمَعْزُ أَنَّهَا تُجْمَعُ عَلَيْهِ فِي الصَّدَقَةِ فَإِنْ كَانَ فِيهَا مَا تَجِبُ فِيهِ الصَّدَقَةُ صُدِّقَتْ وَقَالَ إِنَّمَا هِيَ غَنَمٌ كُلُّهَا وَفِي كِتَابِ عُمَرَ بْنِ الْخَطَّابِ وَفِي سَائِمَةِ الْغَنَمِ إِذَا بَلَغَتْ أَرْبَعِينَ شَاةً شَاةٌ ‏.‏ قَالَ مَالِكٌ فَإِنْ كَانَتِ الضَّأْنُ هِيَ أَكْثَرَ مِنَ الْمَعْزِ وَلَمْ يَجِبْ عَلَى رَبِّهَا إِلاَّ شَاةٌ وَاحِدَةٌ أَخَذَ الْمُصَدِّقُ تِلْكَ الشَّاةَ الَّتِي وَجَبَتْ عَلَى رَبِّ الْمَالِ مِنَ الضَّأْنِ وَإِنْ كَانَتِ الْمَعْزُ أَكْثَرَ مِنَ الضَّأْنِ أُخِذَ مِنْهَا فَإِنِ اسْتَوَى الضَّأْنُ وَالْمَعْزُ أَخَذَ الشَّاةَ مِنْ أَيَّتِهِمَا شَاءَ ‏.‏ قَالَ يَحْيَى قَالَ مَالِكٌ وَكَذَلِكَ الإِبِلُ الْعِرَابُ وَالْبُخْتُ يُجْمَعَانِ عَلَى رَبِّهِمَا فِي الصَّدَقَةِ ‏.‏ وَقَالَ إِنَّمَا هِيَ إِبِلٌ كُلُّهَا فَإِنْ كَانَتِ الْعِرَابُ هِيَ أَكْثَرَ مِنَ الْبُخْتِ وَلَمْ يَجِبْ عَلَى رَبِّهَا إِلاَّ بَعِيرٌ وَاحِدٌ فَلْيَأْخُذْ مِنَ الْعِرَابِ صَدَقَتَهَا فَإِنْ كَانَتِ الْبُخْتُ أَكْثَرَ فَلْيَأْخُذْ مِنْهَا فَإِنِ اسْتَوَتْ فَلْيَأْخُذْ مِنْ أَيَّتِهِمَا شَاءَ ‏.‏ قَالَ مَالِكٌ وَكَذَلِكَ الْبَقَرُ وَالْجَوَامِيسُ تُجْمَعُ فِي الصَّدَقَةِ عَلَى رَبِّهَا ‏.‏ وَقَالَ إِنَّمَا هِيَ بَقَرٌ كُلُّهَا فَإِنْ كَانَتِ الْبَقَرُ هِيَ أَكْثَرَ مِنَ الْجَوَامِيسِ وَلاَ تَجِبُ عَلَى رَبِّهَا إِلاَّ بَقَرَةٌ وَاحِدَةٌ فَلْيَأْخُذْ مِنَ الْبَقَرِ صَدَقَتَهُمَا وَإِنْ كَانَتِ الْجَوَامِيسُ أَكْثَرَ فَلْيَأْخُذْ مِنْهَا فَإِنِ اسْتَوَتْ فَلْيَأْخُذْ مِنْ أَيَّتِهِمَا شَاءَ فَإِذَا وَجَبَتْ فِي ذَلِكَ الصَّدَقَةُ صُدِّقَ الصِّنْفَانِ جَمِيعًا ‏.‏ قَالَ يَحْيَى قَالَ مَالِكٌ مَنْ أَفَادَ مَاشِيَةً مِنْ إِبِلٍ أَوْ بَقَرٍ أَوْ غَنَمٍ فَلاَ صَدَقَةَ عَلَيْهِ فِيهَا حَتَّى يَحُولَ عَلَيْهَا الْحَوْلُ مِنْ يَوْمَ أَفَادَهَا إِلاَّ أَنْ يَكُونَ لَهُ قَبْلَهَا نِصَابُ مَاشِيَةٍ وَالنِّصَابُ مَا تَجِبُ فِيهِ الصَّدَقَةُ إِمَّا خَمْسُ ذَوْدٍ مِنَ الإِبِلِ وَإِمَّا ثَلاَثُونَ بَقَرَةً وَإِمَّا أَرْبَعُونَ شَاةً فَإِذَا كَانَ لِلرَّجُلِ خَمْسُ ذَوْدٍ مِنَ الإِبِلِ أَوْ ثَلاَثُونَ بَقَرَةً أَوْ أَرْبَعُونَ شَاةً ثُمَّ أَفَادَ إِلَيْهَا إِبِلاً أَوْ بَقَرًا أَوْ غَنَمًا بِاشْتِرَاءٍ أَوْ هِبَةٍ أَوْ مِيرَاثٍ فَإِنَّهُ يُصَدِّقُهَا مَعَ مَاشِيَتِهِ حِينَ يُصَدِّقُهَا وَإِنْ لَمْ يَحُلْ عَلَى الْفَائِدَةِ الْحَوْلُ وَإِنْ كَانَ مَا أَفَادَ مِنَ الْمَاشِيَةِ إِلَى مَاشِيَتِهِ قَدْ صُدِّقَتْ قَبْلَ أَنْ يَشْتَرِيَهَا بِيَوْمٍ وَاحِدٍ أَوْ قَبْلَ أَنْ يَرِثَهَا بِيَوْمٍ وَاحِدٍ فَإِنَّهُ يُصَدِّقُهَا مَعَ مَاشِيَتِهِ حِينَ يُصَدِّقُ مَاشِيَتَهُ ‏.‏ قَالَ يَحْيَى قَالَ مَالِكٌ وَإِنَّمَا مَثَلُ ذَلِكَ مَثَلُ الْوَرِقِ يُزَكِّيهَا الرَّجُلُ ثُمَّ يَشْتَرِي بِهَا مِنْ رَجُلٍ آخَرَ عَرْضًا وَقَدْ وَجَبَتْ عَلَيْهِ فِي عَرْضِهِ ذَلِكَ إِذَا بَاعَهُ الصَّدَقَةُ فَيُخْرِجُ الرَّجُلُ الآخَرُ صَدَقَتَهَا هَذَا الْيَوْمَ وَيَكُونُ الآخَرُ قَدْ صَدَّقَهَا مِنَ الْغَدِ ‏.‏ قَالَ مَالِكٌ فِي رَجُلٍ كَانَتْ لَهُ غَنَمٌ لاَ تَجِبُ فِيهَا الصَّدَقَةُ فَاشْتَرَى إِلَيْهَا غَنَمًا كَثِيرَةً تَجِبُ فِي دُونِهَا الصَّدَقَةُ أَوْ وَرِثَهَا أَنَّهُ لاَ تَجِبُ عَلَيْهِ فِي الْغَنَمِ كُلِّهَا الصَّدَقَةُ حَتَّى يَحُولَ عَلَيْهَا الْحَوْلُ مِنْ يَوْمَ أَفَادَهَا بِاشْتِرَاءٍ أَوْ مِيرَاثٍ وَذَلِكَ أَنَّ كُلَّ مَا كَانَ عِنْدَ الرَّجُلِ مِنْ مَاشِيَةٍ لاَ تَجِبُ فِيهَا الصَّدَقَةُ مِنْ إِبِلٍ أَوْ بَقَرٍ أَوْ غَنَمٍ فَلَيْسَ يُعَدُّ ذَلِكَ نِصَابَ مَالٍ حَتَّى يَكُونَ فِي كُلِّ صِنْفٍ مِنْهَا مَا تَجِبُ فِيهِ الصَّدَقَةُ فَذَلِكَ النِّصَابُ الَّذِي يُصَدِّقُ مَعَهُ مَا أَفَادَ إِلَيْهِ صَاحِبُهُ مِنْ قَلِيلٍ أَوْ كَثِيرٍ مِنَ الْمَاشِيَةِ ‏.‏ قَالَ مَالِكٌ وَلَوْ كَانَتْ لِرَجُلٍ إِبِلٌ أَوْ بَقَرٌ أَوْ غَنَمٌ تَجِبُ فِي كُلِّ صِنْفٍ مِنْهَا الصَّدَقَةُ ثُمَّ أَفَادَ إِلَيْهَا بَعِيرًا أَوْ بَقَرَةً أَوْ شَاةً صَدَّقَهَا مَعَ مَاشِيَتِهِ حِينَ يُصَدِّقُهَا ‏.‏ قَالَ يَحْيَى قَالَ مَالِكٌ وَهَذَا أَحَبُّ مَا سَمِعْتُ إِلَىَّ فِي هَذَا ‏.‏ قَالَ مَالِكٌ فِي الْفَرِيضَةِ تَجِبُ عَلَى الرَّجُلِ فَلاَ تُوجَدُ عِنْدَهُ أَنَّهَا إِنْ كَانَتِ ابْنَةَ مَخَاضٍ فَلَمْ تُوجَدْ أُخِذَ مَكَانَهَا ابْنُ لَبُونٍ ذَكَرٌ وَإِنْ كَانَتْ بِنْتَ لَبُونٍ أَوْ حِقَّةً أَوْ جَذَعَةً وَلَمْ يَكُنْ عِنْدَهُ كَانَ عَلَى رَبِّ الإِبِلِ أَنْ يَبْتَاعَهَا لَهُ حَتَّى يَأْتِيَهُ بِهَا وَلاَ أُحِبُّ أَنْ يُعْطِيَهُ قِيمَتَهَا ‏.‏ وَقَالَ مَالِكٌ فِي الإِبِلِ النَّوَاضِحِ وَالْبَقَرِ السَّوَانِي وَبَقَرِ الْحَرْثِ إِنِّي أَرَى أَنْ يُؤْخَذَ مِنْ ذَلِكَ كُلِّهِ إِذَا وَجَبَتْ فِيهِ الصَّدَقَةُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Humayd ibn Qays al-Makki from\nTawus al Yamani that from thirty cows, Muadh ibn Jabal took one cow in\nits second year, and from forty cows, one cow in its third or fourth\nyear, and when less than that (i.e. thirty cows) was brought to him he\nrefused to take anything from it. He said, \"I have not heard anything\nabout it from the Messenger of Allah, may Allah bless him and grant\nhim peace. When I meet him, I will ask him.\" But the Messenger of\nAllah, may Allah bless him and grant him peace, died before Muadh ibn\nJabal returned.\n\n\nYahya said that Malik said, \"The best that I\nhave heard about some one who has sheep or goats with two or more\nshepherds in different places is that they are added together and the\nowner then pays the zakat on them. This is the same situation as a man\nwho has gold and silver scattered in the hands of various people. He\nmust add it all u p and pay whatever zakat there is to pay on the sum\ntotal.\"\n\n\nYahya said that Malik said, about a man who had both\nsheep and goats, that they were added up together for the zakat to be\nassessed, and if between them they came to a number on which zakat was\ndue, he paid zakat on them. Malik added, \"They are all considered as\nsheep, and in Umar ibn al-Khattab's book it says, 'On grazing sheep\nand goats, if they come to forty or more, one ewe.' \"\n\n\nMalik\nsaid, \"If there are more sheep than goats and their owner only has to\npay one ewe, the zakat collector takes the ewe from the sheep. If\nthere are more goats than sheep, he takes it from the goats. If there\nis an equal number of sheep and goats, he takes the ewe from whichever\nkind he wishes.\"\n\n\nYahya said that Malik said, \"Similarly,\nArabian camels and Bactrian camels are added up together in order to\nassess the zakat that the owner has to pay. They are all considered as\ncamels. If there are more Arabian camels than Bactrians and the owner\nonly has to pay one camel, the zakat collector takes it from the\nArabian ones. If, however, there are more Bactrian camels he takes it\nfrom those. If there is an equal number of both, he takes the camel\nfrom whichever kind he wishes.\"\n\n\nMalik said, \"Similarly, cows\nand water buffaloes are added up together and are all considered as\ncattle. If there are more cows than water buffalo and the owner only\nhas to pay one cow, the zakat collector takes it from the cows. If\nthere are more water buffalo, he takes it from them. If there is an\nequal number of both, he takes the cow from whichever kind he wishes.\nSo if zakat is necessary, it is assessed taking both kinds as one\ngroup.\"\n\n\nYahya said that Malik said, \"No zakat is due from\nanyone who comes into possession of livestock, whether camels or\ncattle or sheep and goats, until a year has elapsed over them from the\nday he acquired them, unless he already had in his possession a nisab\nof livestock. (The nisab is the minimum amount on which zakat has to\nbe paid, either five head of camels, or thirty cattle, or forty sheep\nand goats). If he already had five head of camels, or thirty cattle,\nor forty sheep and goats, and he then acquired additional camels, or\ncattle, or sheep and goats, either by trade, or gift, or inheritance,\nhe must pay zakat on them when he pays the zakat on the livestock he\nalready has, even if a year has not elapsed over the acquisition. And\neven if the additional livestock that he acquired has had zakat taken\nfrom it the day before he bought it, or the day before he inherited\nit, he must still pay the zakat on it when he pays the zakat on the\nlivestock he already has \"\n\n\nYahya said that Malik said, \"This\nis the same situation as some one who has some silver on which he pays\nthe zakat and then uses to buy some goods with from somebody else. He\nthen has to pay zakat on those goods when he sells them. It could be\nthat one man will have to pay zakat on them one day, and by the\nfollowing day the other man will also have to pay.\"\n\n\nMalik\nsaid, in the case of a man who had sheep and goats which did not reach\nthe zakatable amount, and who then bought or inherited an additional\nnumber of sheep and goats well above the zakatable amount, that he did\nnot have to pay zakat on all his sheep and goats until a year had\nelapsed over them from the day he acquired the new animals, whether he\nbought them or inherited them.This was because none of the livestock\nthat a man had, whether it be camels, or cattle, or sheep and goats,\nwas counted as a nisab until there was enough of any one kind for him\nto have to pay zakat on it. This was the nisab which is used for\nassessing the zakat on what the owner had additionally acquired,\nwhether it were a large or small amount of livestock.\n\n\nMalik\nsaid, \"If a man has enough camels, or cattle, or sheep and goats, for\nhim to have to pay zakat on each kind, and then he acquires another\ncamel, or cow, or sheep, or goat, it must be included with the rest of\nhis animals when he pays zakat on them \"\n\n\nYahya said that\nMalik said, \"This is what I like most out of what I heard about the\nmatter.\"\n\n\nMalik said, in the case of a man who does not have\nthe animal required of him for the zakat, \"If it is a two-year-old\nshe-camel that he does not have, a three-year-old male camel is taken\ninstead. If it is a three- or four- or five-year-old she-camel that he\ndoes not have, then he must buy the required animal so that he gives\nthe collector what is due. I do not like it if the owner gives the\ncollector the equivalent value.\"\n\n\nMalik said, about camels\nused for carrying water, and cattle used for working water-wheels or\nploughing, \"In my opinion such animals are included when assessing\nzakat.\""}},{"id":27,"idInBook":27,"chapterId":17,"bookId":7,"arabic":"","english":{"narrator":"","text":"Yahya said that Malik said, concerning two associates, \"If they\nshare one herdsman, one male animal, one pasture and one watering\nplace then the two men are associates, as long as each one of them\nknows his own property from that of his companion If someone cannot\ntell his property apart from that of his fellow, he is not an\nassociate, but rather, a co-owner \"\n\n\nMalik said, \"It is not\nobligatory for both associates to pay zakat unless both of them have a\nzakatable amount (of livestock). If, for instance, one of the\nassociates has forty or more sheep and goats and the other has less\nthan forty sheep and goats, then the one who has forty has to pay\nzakat and the one who has less does not. If both of them have a\nzakatable amount (of livestock) then both of them are assessed\ntogether (i.e the flock is assessed as one) and both of them have to\npay zakat. If one of them has a thousand sheep, or less, that he has\nto pay zakat on, and the other has forty, or more, then they are\nassociates, and each one pays his contribution according to the number\nof animals he has - so much from the one with a thousand, and so much\nfrom the one with forty.\n\n\nMalik said, \"Two associates in\ncamels are the same as two associates in sheep and goats, and, for the\npurposes of zakat, are assessed together if each one of them has a\nzakatable amount (of camels). That is because the Messenger of Allah,\nmay Allah bless him and grant him peace, said, 'There is no zakat on\nless than five head of camels,' and Umar ibn al-Khattab said, 'On\ngrazing sheep and goats, if they come to forty or more - one ewe.' \"\n\n\nYahya said that Malik said, \"This is what I like most out of\nwhat I have heard about the matter.\"\n\n\nMalik said that when\nUmar ibn al-Khattab said, \"Those separated should not be gathered\ntogether nor should those gathered together be separated in order to\navoid paying zakat,\" what he meant was the owners of livestock.\n\n\nMalik said, \"What he meant when he said, 'Those separated should\nnot be gathered together' is, for instance, that there is a group of\nthree men, each of whom has forty sheep and goats, and each of whom\nthus has to pay zakat. Then, when the zakat collector is on his way\n,they gather their flocks together so that they only owe one ewe\nbetween them. This they are forbidden to do. What he meant when he\nsaid, 'nor should those gathered together be separated,' is, for\ninstance, that there are two associates, each one of whom has a\nhundred and one sheep and goats, and each of whom must therefore pay\nthree ewes. Then, when the zakat collector is on his way, they split\nup their flocks so that they only have to pay one ewe each. This they\nare forbidden to do. And so it is said, 'Those separated should not be\ngathered together nor should those gathered together be separated in\norder to avoid paying zakat.' \"\n\n\nMalik said, \"This is what I\nhave heard about the matter.\""}},{"id":28,"idInBook":28,"chapterId":17,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ ثَوْرِ بْنِ زَيْدٍ الدِّيلِيِّ، عَنِ ابْنٍ لِعَبْدِ اللَّهِ بْنِ سُفْيَانَ الثَّقَفِيِّ، عَنْ جَدِّهِ، سُفْيَانَ بْنِ عَبْدِ اللَّهِ أَنَّ عُمَرَ بْنَ الْخَطَّابِ، بَعَثَهُ مُصَدِّقًا فَكَانَ يَعُدُّ عَلَى النَّاسِ بِالسَّخْلِ فَقَالُوا أَتَعُدُّ عَلَيْنَا بِالسَّخْلِ وَلاَ تَأْخُذُ مِنْهُ شَيْئًا ‏.‏ فَلَمَّا قَدِمَ عَلَى عُمَرَ بْنِ الْخَطَّابِ ذَكَرَ لَهُ ذَلِكَ فَقَالَ عُمَرُ نَعَمْ تَعُدُّ عَلَيْهِمْ بِالسَّخْلَةِ يَحْمِلُهَا الرَّاعِي وَلاَ تَأْخُذُهَا وَلاَ تَأْخُذُ الأَكُولَةَ وَلاَ الرُّبَّى وَلاَ الْمَاخِضَ وَلاَ فَحْلَ الْغَنَمِ وَتَأْخُذُ الْجَذَعَةَ وَالثَّنِيَّةَ وَذَلِكَ عَدْلٌ بَيْنَ غِذَاءِ الْغَنَمِ وَخِيَارِهِ ‏.‏ قَالَ مَالِكٌ وَالسَّخْلَةُ الصَّغِيرَةُ حِينَ تُنْتَجُ ‏.‏ وَالرُّبَّى الَّتِي قَدْ وَضَعَتْ فَهِيَ تُرَبِّي وَلَدَهَا ‏.‏ وَالْمَاخِضُ هِيَ الْحَامِلُ ‏.‏ وَالأَكُولَةُ هِيَ شَاةُ اللَّحْمِ الَّتِي تُسَمَّنُ لِتُؤْكَلَ ‏.‏ وَقَالَ مَالِكٌ فِي الرَّجُلِ تَكُونُ لَهُ الْغَنَمُ لاَ تَجِبُ فِيهَا الصَّدَقَةُ فَتَوَالَدُ قَبْلَ أَنْ يَأْتِيَهَا الْمُصَدِّقُ بِيَوْمٍ وَاحِدٍ فَتَبْلُغُ مَا تَجِبُ فِيهِ الصَّدَقَةُ بِوِلاَدَتِهَا قَالَ مَالِكٌ إِذَا بَلَغَتِ الْغَنَمُ بِأَوْلاَدِهَا مَا تَجِبُ فِيهِ الصَّدَقَةُ فَعَلَيْهِ فِيهَا الصَّدَقَةُ وَذَلِكَ أَنَّ وِلاَدَةَ الْغَنَمِ مِنْهَا وَذَلِكَ مُخَالِفٌ لِمَا أُفِيدَ مِنْهَا بِاشْتِرَاءٍ أَوْ هِبَةٍ أَوْ مِيرَاثٍ وَمِثْلُ ذَلِكَ الْعَرْضُ لاَ يَبْلُغُ ثَمَنُهُ مَا تَجِبُ فِيهِ الصَّدَقَةُ ثُمَّ يَبِيعُهُ صَاحِبُهُ فَيَبْلُغُ بِرِبْحِهِ مَا تَجِبُ فِيهِ الصَّدَقَةُ فَيُصَدِّقُ رِبْحَهُ مَعَ رَأْسِ الْمَالِ وَلَوْ كَانَ رِبْحُهُ فَائِدَةً أَوْ مِيرَاثًا لَمْ تَجِبْ فِيهِ الصَّدَقَةُ حَتَّى يَحُولَ عَلَيْهِ الْحَوْلُ مِنْ يَوْمَ أَفَادَهُ أَوْ وَرِثَهُ ‏.‏ قَالَ مَالِكٌ فَغِذَاءُ الْغَنَمِ مِنْهَا كَمَا رِبْحُ الْمَالِ مِنْهُ غَيْرَ أَنَّ ذَلِكَ يَخْتَلِفُ فِي وَجْهٍ آخَرَ أَنَّهُ إِذَا كَانَ لِلرَّجُلِ مِنَ الذَّهَبِ أَوِ الْوَرِقِ مَا تَجِبُ فِيهِ الزَّكَاةُ ثُمَّ أَفَادَ إِلَيْهِ مَالاً تَرَكَ مَالَهُ الَّذِي أَفَادَ فَلَمْ يُزَكِّهِ مَعَ مَالِهِ الأَوَّلِ حِينَ يُزَكِّيهِ حَتَّى يَحُولَ عَلَى الْفَائِدَةِ الْحَوْلُ مِنْ يَوْمَ أَفَادَهَا وَلَوْ كَانَتْ لِرَجُلٍ غَنَمٌ أَوْ بَقَرٌ أَوْ إِبِلٌ تَجِبُ فِي كُلِّ صِنْفٍ مِنْهَا الصَّدَقَةُ ثُمَّ أَفَادَ إِلَيْهَا بَعِيرًا أَوْ بَقَرَةً أَوْ شَاةً صَدَّقَهَا مَعَ صِنْفِ مَا أَفَادَ مِنْ ذَلِكَ حِينَ يُصَدِّقُهُ إِذَا كَانَ عِنْدَهُ مِنْ ذَلِكَ الصِّنْفِ الَّذِي أَفَادَ نِصَابُ مَاشِيَةٍ ‏.‏ قَالَ مَالِكٌ وَهَذَا أَحْسَنُ مَا سَمِعْتُ فِي ذَلِكَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Thawr ibn Zayd ad-Dili from a\nson of Abdullah ibn Sufyan ath-Thaqafi from his grandfather Sufyan ibn\nAbdullah that Umar ibn al-Khattab once sent him to collect zakat. He\nused to include sakhlas (when assessing zakat), and they said, \"Do you\ninclude sakhlas even though you do not take them (as payment)?\"  He\nreturned to Umar ibn al-Khattab and mentioned that to him and Umar\nsaid, \"Yes, you include a sakhla which the shepherd is carrying, but\nyou do not take it. Neither do you take an akula, or a rubba, or a\nmakhid, or male sheep and goats in their second and third years, and\nthis is a just compromise between the young of sheep and goats and the\nbest of them.\"\n\n\nMalik said, \"A sakhla is a newborn lamb or\nkid. A rubba is a mother that is looking after her offspring, a makhid\nis a pregnant ewe or goat, and an akula is a sheep or goat that is\nbeing fattened for meat.\"\n\n\nMalik said, about a man who had\nsheep and goats on which he did not have to pay any zakat, but which\nincreased by birth to a zakatable amount on the day before the zakat\ncollector came to them, \"If the number of sheep and goats along with\ntheir (newborn) offspring reaches a zakatable amount then the man has\nto pay zakat on them. That is because the offspring of the sheep are\npart of the flock itself. It is not the same situation as when some\none acquires sheep by buying them, or is given them, or inherits them.\nRather, it is like when merchandise whose value does not come to a\nzakatable amount is sold, and with the profit that accrues it then\ncomes to a zakatable amount. The owner must then pay zakat on both his\nprofit and his original capital, taken together. If his profit had\nbeen a chance acquisition or an inheritance he would not have had to\npay zakat on it until one year had elapsed over it from the day he had\nacquired it or inherited it.\"\n\n\nMalik said, \"The young of sheep\nand goats are part of the flock, in the same way that profit from\nwealth is part of that wealth. There is, however, one difference, in\nthat when a man has a zakatable amount of gold and silver, and then\nacquires an additional amount of wealth, he leaves aside the wealth he\nhas acquired and does not pay zakat on it when he pays the zakat on\nhis original wealth but waits until a year has elapsed over what he\nhas acquired from the day he acquired it. Whereas a man who has a\nzakatable amount of sheep and goats, or cattle, or camels, and then\nacquires another camel, cow, sheep or goat, pays zakat on it at the\nsame time that he pays the zakat on the others of its kind, if he\nalready has a zakatable amount of livestock of that particular kind.\"\n\n\nMalik said, \"This is the best of what I have heard about\nthis. \""}},{"id":29,"idInBook":29,"chapterId":17,"bookId":7,"arabic":"","english":{"narrator":"","text":"Yahya said that Malik said, \"The position with us concerning a\nman who has zakat to pay on one hundred camels but then the zakat\ncollector does not come to him until zakat is due for a second timeand\nby that time all his camels have died except five, is that the zakat\ncollector assesses from the five camels the two amounts of zakat that\nare due from the owner of the animals, which in this case is only two\nsheep, one for each year. This is because the only zakat which an\nowner of livestock has to pay is what is due from him on the day that\nthe zakat is (actually) assessed. His livestock may have died or it\nmay have increased, and the zakat collector only assesses the zakat on\nwhat he (actually) finds on the day he makes the assessment. If more\nthan one payment of zakat is due from the owner of the livestock, he\nstill only has to pay zakat according to what the zakat collector\n(actually) finds in his possession, and if his livestock has died, or\nseveral payments of zakat are due from him and nothing is taken until\nall his livestock has died, or has been reduced to an amount below\nthat on which he has to pay zakat, then he does not have to pay any\nzakat, and there is no liability (on him) for what has died or for the\nyears that have passed."}},{"id":30,"idInBook":30,"chapterId":17,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ مُرَّ عَلَى عُمَرَ بْنِ الْخَطَّابِ بِغَنَمٍ مِنَ الصَّدَقَةِ فَرَأَى فِيهَا شَاةً حَافِلاً ذَاتَ ضَرْعٍ عَظِيمٍ فَقَالَ عُمَرُ مَا هَذِهِ الشَّاةُ فَقَالُوا شَاةٌ مِنَ الصَّدَقَةِ ‏.‏ فَقَالَ عُمَرُ مَا أَعْطَى هَذِهِ أَهْلُهَا وَهُمْ طَائِعُونَ لاَ تَفْتِنُوا النَّاسَ لاَ تَأْخُذُوا حَزَرَاتِ الْمُسْلِمِينَ نَكِّبُوا عَنِ الطَّعَامِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said from Muhammad\nibn Yahya ibn Habban from al-Qasim ibn Muhammad that A'isha, the wife\nof the Prophet, may Allah bless him and grant him peace, said, \"Sheep\nfrom the zakat were brought past Umar ibn al-Khattab and he saw\namongst them a sheep with a large udder, ready to give milk, and he\nsaid, 'What is this sheep doing here?' and they replied, 'It is one of\nthe sheep from the zakat.'  Umar said, 'The owners did not give this\nsheep willingly. Do not subject people to trials. Do not take from the\nmuslims those of their animals which are the best food-producers.' \""}},{"id":31,"idInBook":31,"chapterId":17,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، أَنَّهُ قَالَ أَخْبَرَنِي رَجُلاَنِ، مِنْ أَشْجَعَ أَنَّ مُحَمَّدَ بْنَ مَسْلَمَةَ الأَنْصَارِيَّ، كَانَ يَأْتِيهِمْ مُصَدِّقًا فَيَقُولُ لِرَبِّ الْمَالِ أَخْرِجْ إِلَىَّ صَدَقَةَ مَالِكَ ‏.‏ فَلاَ يَقُودُ إِلَيْهِ شَاةً فِيهَا وَفَاءٌ مِنْ حَقِّهِ إِلاَّ قَبِلَهَا ‏.‏ قَالَ مَالِكٌ السُّنَّةُ عِنْدَنَا - وَالَّذِي أَدْرَكْتُ عَلَيْهِ أَهْلَ الْعِلْمِ بِبَلَدِنَا - أَنَّهُ لاَ يُضَيَّقُ عَلَى الْمُسْلِمِينَ فِي زَكَاتِهِمْ وَأَنْ يُقْبَلَ مِنْهُمْ مَا دَفَعُوا مِنْ أَمْوَالِهِمْ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said that Muhammad\nibn Yahya ibn Habban said, \"Two men from the Ashja tribe told me that\nMuhammad ibn Maslama al-Ansari used tocome to them to collect their\nzakat, and he would say to anyone who owned livestock, 'Select (the\nanimal for) the zakat on your livestock and bring it to me,' and he\nwould accept any sheep that was brought to him provided it met the\nrequirements of what the man owed.\"\n\n\nMalik said, \"The sunna\nwith us, and what I have seen the people of knowledge doing in our\ncity, is that things are not made difficult for the muslims in their\npaying zakat, and whatever they offer of their livestock is accepted\nfrom them.\""}},{"id":32,"idInBook":32,"chapterId":17,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تَحِلُّ الصَّدَقَةُ لِغَنِيٍّ إِلاَّ لِخَمْسَةٍ لِغَازٍ فِي سَبِيلِ اللَّهِ أَوْ لِعَامِلٍ عَلَيْهَا أَوْ لِغَارِمٍ أَوْ لِرَجُلٍ اشْتَرَاهَا بِمَالِهِ أَوْ لِرَجُلٍ لَهُ جَارٌ مِسْكِينٌ فَتُصُدِّقَ عَلَى الْمِسْكِينِ فَأَهْدَى الْمِسْكِينُ لِلْغَنِيِّ ‏\"‏ ‏.‏ قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا فِي قَسْمِ الصَّدَقَاتِ أَنَّ ذَلِكَ لاَ يَكُونُ إِلاَّ عَلَى وَجْهِ الاِجْتِهَادِ مِنَ الْوَالِي فَأَىُّ الأَصْنَافِ كَانَتْ فِيهِ الْحَاجَةُ وَالْعَدَدُ أُوثِرَ ذَلِكَ الصِّنْفُ بِقَدْرِ مَا يَرَى الْوَالِي وَعَسَى أَنْ يَنْتَقِلَ ذَلِكَ إِلَى الصِّنْفِ الآخَرِ بَعْدَ عَامٍ أَوْ عَامَيْنِ أَوْ أَعْوَامٍ فَيُؤْثَرُ أَهْلُ الْحَاجَةِ وَالْعَدَدِ حَيْثُمَا كَانَ ذَلِكَ وَعَلَى هَذَا أَدْرَكْتُ مَنْ أَرْضَى مِنْ أَهْلِ الْعِلْمِ ‏.‏ قَالَ مَالِكٌ وَلَيْسَ لِلْعَامِلِ عَلَى الصَّدَقَاتِ فَرِيضَةٌ مُسَمَّاةٌ إِلاَّ عَلَى قَدْرِ مَا يَرَى الإِمَامُ ‏.‏","english":{"narrator":"Yahya related to me from Zayd ibn Aslam from Ata ibn Yasar that\nthe Messenger of Allah, may Allah bless him and grant him peace, said,\n\"Zakat is not permissible for someone who is not in need except for\nfive:","text":"someone fighting in the way of Allah, someone who collects\nzakat, someone who has suffered (financial) loss (at the hands of\ndebtors), someone who buys it with his own money, and some one who has\na poor neighbour who receives some zakat and gives some as a present\nto the one who is not in need.\"\n\n\nMalik said, \"The position\nwith us concerning the dividing up of zakat is that it is up to the\nindividual judgement of the man in charge (wali). Whichever categories\nof people are in most need and are most numerous are given preference,\naccording to how the man in charge sees fit. It is possible that that\nmay change after one year, or two, or more, but it is always those who\nare in need and are most numerous that are given preference, whatever\ncategory they may belong to. This is what I have seen done by people\nof knowledge with which I am satisifed.\"\n\n\nMalik said, \"There\nis no fixed share for the collector of the zakat, except according to\nwhat the imam sees fit.\""}},{"id":33,"idInBook":33,"chapterId":17,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ أَبَا بَكْرٍ الصِّدِّيقَ، قَالَ لَوْ مَنَعُونِي عِقَالاً لَجَاهَدْتُهُمْ عَلَيْهِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Abu Bakr\nas-Siddiq said, \"If they withhold even a hobbling cord I will fight\nthem over it.\""}},{"id":34,"idInBook":34,"chapterId":17,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، أَنَّهُ قَالَ شَرِبَ عُمَرُ بْنُ الْخَطَّابِ لَبَنًا فَأَعْجَبَهُ فَسَأَلَ الَّذِي سَقَاهُ مِنْ أَيْنَ هَذَا اللَّبَنُ فَأَخْبَرَهُ أَنَّهُ وَرَدَ عَلَى مَاءٍ - قَدْ سَمَّاهُ - فَإِذَا نَعَمٌ مِنْ نَعَمِ الصَّدَقَةِ وَهُمْ يَسْقُونَ فَحَلَبُوا لِي مِنْ أَلْبَانِهَا فَجَعَلْتُهُ فِي سِقَائِي فَهُوَ هَذَا ‏.‏ فَأَدْخَلَ عُمَرُ بْنُ الْخَطَّابِ يَدَهُ فَاسْتَقَاءَهُ ‏.‏ قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا أَنَّ كُلَّ مَنْ مَنَعَ فَرِيضَةً مِنْ فَرَائِضِ اللَّهِ عَزَّ وَجَلَّ فَلَمْ يَسْتَطِعِ الْمُسْلِمُونَ أَخْذَهَا كَانَ حَقًّا عَلَيْهِمْ جِهَادُهُ حَتَّى يَأْخُذُوهَا مِنْهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Zayd ibn Aslam said, ''Umar\nibn al Khattab drank some milk which he liked (very much) and he asked\nthe man who had given it to him, 'Where did this milk come from?'  The\nman told him that he had come to a watering-place, which he named, and\nhad found grazing livestock from the zakat watering there. He was\ngiven some of their milk, which he then put into his water-skin, and\nthat was the milk in question. Umar ibn al-Khattab then put his hand\ninto his mouth to make himself vomit.\"\n\n\nMalik said, \"The\nposition with us is that if anyone refuses to honour one of the\nobligatory demands of Allah, and the muslims are unable to get it,\nthen they have the right to fight him until they get itfrom him.\""}},{"id":35,"idInBook":35,"chapterId":17,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَامِلاً، لِعُمَرَ بْنِ عَبْدِ الْعَزِيزِ كَتَبَ إِلَيْهِ يَذْكُرُ أَنَّ رَجُلاً مَنَعَ زَكَاةَ مَالِهِ فَكَتَبَ إِلَيْهِ عُمَرُ أَنْ دَعْهُ وَلاَ تَأْخُذْ مِنْهُ زَكَاةً مَعَ الْمُسْلِمِينَ قَالَ فَبَلَغَ ذَلِكَ الرَّجُلَ فَاشْتَدَّ عَلَيْهِ وَأَدَّى بَعْدَ ذَلِكَ زَكَاةَ مَالِهِ فَكَتَبَ عَامِلُ عُمَرَ إِلَيْهِ يَذْكُرُ لَهُ ذَلِكَ فَكَتَبَ إِلَيْهِ عُمَرُ أَنْ خُذْهَا مِنْهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that one of the\nadministrators of Umar ibn Abd al-'Aziz wrote to him mentioning that a\nman had refused to pay zakat on his property. Umar wrote to the\nadministrator and told him to leave the man alone and not to take any\nzakat from him when he took it from the other muslims. The man heard\nabout this and the situation became unbearable for him, and after that\nhe paid the zakat on his property. The administrator wrote to Umar and\nmentioned that to him, and Umar wrote back telling him to take the\nzakat from him."}},{"id":36,"idInBook":36,"chapterId":17,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ الثِّقَةِ، عِنْدَهُ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، وَعَنْ بُسْرِ بْنِ سَعِيدٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ فِيمَا سَقَتِ السَّمَاءُ وَالْعُيُونُ وَالْبَعْلِ الْعُشْرُ وَفِيمَا سُقِيَ بِالنَّضْحِ نِصْفُ الْعُشْرِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from a reliable source from\nSulayman ibn Yasar and from Busr ibn Said that the Messenger of Allah,\nmay Allah bless him and grant him peace, said, \"On land that is\nwatered by rain or springs or any natural means there is (zakat to pay\nof) a tenth. On irrigated land there is (zakat of) a twentieth (to\npay).\""}},{"id":37,"idInBook":37,"chapterId":17,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زِيَادِ بْنِ سَعْدٍ، عَنِ ابْنِ شِهَابٍ، أَنَّهُ قَالَ لاَ يُؤْخَذُ فِي صَدَقَةِ النَّخْلِ الْجُعْرُورُ وَلاَ مُصْرَانُ الْفَارَةِ وَلاَ عَذْقُ ابْنِ حُبَيْقٍ ‏.‏ قَالَ وَهُوَ يُعَدُّ عَلَى صَاحِبِ الْمَالِ وَلاَ يُؤْخَذُ مِنْهُ فِي الصَّدَقَةِ ‏.‏ قَالَ مَالِكٌ وَإِنَّمَا مِثْلُ ذَلِكَ الْغَنَمُ تُعَدُّ عَلَى صَاحِبِهَا بِسِخَالِهَا وَالسَّخْلُ لاَ يُؤْخَذُ مِنْهُ فِي الصَّدَقَةِ وَقَدْ يَكُونُ فِي الأَمْوَالِ ثِمَارٌ لاَ تُؤْخَذُ الصَّدَقَةُ مِنْهَا مِنْ ذَلِكَ الْبُرْدِيُّ وَمَا أَشْبَهَهُ لاَ يُؤْخَذُ مِنْ أَدْنَاهُ كَمَا لاَ يُؤْخَذُ مِنْ خِيَارِهِ ‏.‏ قَالَ وَإِنَّمَا تُؤْخَذُ الصَّدَقَةُ مِنْ أَوْسَاطِ الْمَالِ ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا أَنَّهُ لاَ يُخْرَصُ مِنَ الثِّمَارِ إِلاَّ النَّخِيلُ وَالأَعْنَابُ فَإِنَّ ذَلِكَ يُخْرَصُ حِينَ يَبْدُو صَلاَحُهُ وَيَحِلُّ بَيْعُهُ وَذَلِكَ أَنَّ ثَمَرَ النَّخِيلِ وَالأَعْنَابِ يُؤْكَلُ رُطَبًا وَعِنَبًا فَيُخْرَصُ عَلَى أَهْلِهِ لِلتَّوْسِعَةِ عَلَى النَّاسِ وَلِئَلاَّ يَكُونَ عَلَى أَحَدٍ فِي ذَلِكَ ضِيقٌ فَيُخْرَصُ ذَلِكَ عَلَيْهِمْ ثُمَّ يُخَلَّى بَيْنَهُمْ وَبَيْنَهُ يَأْكُلُونَهُ كَيْفَ شَاءُوا ثُمَّ يُؤَدُّونَ مِنْهُ الزَّكَاةَ عَلَى مَا خُرِصَ عَلَيْهِمْ ‏.‏ قَالَ مَالِكٌ فَأَمَّا مَا لاَ يُؤْكَلُ رَطْبًا وَإِنَّمَا يُؤْكَلُ بَعْدَ حَصَادِهِ مِنَ الْحُبُوبِ كُلِّهَا فَإِنَّهُ لاَ يُخْرَصُ وَإِنَّمَا عَلَى أَهْلِهَا فِيهَا إِذَا حَصَدُوهَا وَدَقُّوهَا وَطَيَّبُوهَا وَخَلُصَتْ حَبًّا فَإِنَّمَا عَلَى أَهْلِهَا فِيهَا الأَمَانَةُ يُؤَدُّونَ زَكَاتَهَا إِذَا بَلَغَ ذَلِكَ مَا تَجِبُ فِيهِ الزَّكَاةُ وَهَذَا الأَمْرُ الَّذِي لاَ اخْتِلاَفَ فِيهِ عِنْدَنَا ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا أَنَّ النَّخْلَ يُخْرَصُ عَلَى أَهْلِهَا وَثَمَرُهَا فِي رُءُوسِهَا إِذَا طَابَ وَحَلَّ بَيْعُهُ وَيُؤْخَذُ مِنْهُ صَدَقَتُهُ تَمْرًا عِنْدَ الْجِدَادِ فَإِنْ أَصَابَتِ الثَّمَرَةَ جَائِحَةٌ بَعْدَ أَنْ تُخْرَصَ عَلَى أَهْلِهَا وَقَبْلَ أَنْ تُجَذَّ فَأَحَاطَتِ الْجَائِحَةُ بِالثَّمَرِ كُلِّهِ فَلَيْسَ عَلَيْهِمْ صَدَقَةٌ فَإِنْ بَقِيَ مِنَ الثَّمَرِ شَىْءٌ يَبْلُغُ خَمْسَةَ أَوْسُقٍ فَصَاعِدًا بِصَاعِ النَّبِيِّ صلى الله عليه وسلم أُخِذَ مِنْهُمْ زَكَاتُهُ وَلَيْسَ عَلَيْهِمْ فِيمَا أَصَابَتِ الْجَائِحَةُ زَكَاةٌ وَكَذَلِكَ الْعَمَلُ فِي الْكَرْمِ أَيْضًا وَإِذَا كَانَ لِرَجُلٍ قِطَعُ أَمْوَالٍ مُتَفَرِّقَةٌ أَوِ اشْتِرَاكٌ فِي أَمْوَالٍ مُتَفَرِّقَةٍ لاَ يَبْلُغُ مَالُ كُلِّ شَرِيكٍ أَوْ قِطَعُهُ مَا تَجِبُ فِيهِ الزَّكَاةُ وَكَانَتْ إِذَا جُمِعَ بَعْضُ ذَلِكَ إِلَى بَعْضٍ يَبْلُغَ مَا تَجِبُ فِيهِ الزَّكَاةُ فَإِنَّهُ يَجْمَعُهَا وَيُؤَدِّي زَكَاتَهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ziyad ibn Sad that Ibn Shihab\nsaid, \"Neither jurur, nor musran al-fara, nor adhq ibn hubayq should\nbe taken as zakat from dates. They should be included in the\nassessment but not taken as zakat. \"\n\n\nMalik said, \"This is the\nsame as with sheep and goats, whose young are included in the\nassessment but are not (actually) taken as zakat. There are also\ncertain kinds of fruit which are not taken as zakat, such as burdi\ndates (one of the finest kinds of dates), and similar varieties.\n\n\nNeither the lowest quality (of any property) nor the highest\nshould be taken. Rather, zakat should be taken from average quality\nproperty.\"\n\n\nMalik said, \"The position that we are agreed upon\nconcerning fruit is that only dates and grapes are estimated while on\nthe tree. They are estimated when their usability is clear and they\nare halal to sell. This is because the fruit of date-palms and vines\nis eaten straightaway in the form of fresh dates and grapes, and so\nthe assessment is done by estimation to make things easier for people\nand to avoid causing them trouble. Their produce is estimated and then\nthey are given a free hand in using their produce as they wish, and\nlater they pay the zakat on it according to the estimation that was\nmade.\"\n\n\nMalik said, \"crops which are not eaten fresh, such as\ngrains and seeds, which are only eaten after they have been harvested,\nare not estimated. The owner, after he has harvested, threshed and\nsifted the crop, so that it is then in the form of grain or seed, has\nto fulfil his trust himself and deduct the zakat he owes if the amount\nis large enough for him to have to pay zakat. This is the position\nthat we are all agreed upon here (in Madina).\"\n\n\nMalik said,\n\"The position that we are all agreed upon here (in Madina) is that the\nproduce of date palms is estimated while it is still on the tree,\nafter it has ripened and become halal to sell, and the zakat on it is\ndeducted in the form of dried dates at the time of harvest. If the\nfruit is damaged after it has been estimated and the damage affects\nall the fruit then no zakat has to be paid. If some of the fruit\nremains unaffected, and this fruit amounts to five awsuq or more using\nthe sa of the Prophet, may Allah bless him and grant him peace, then\nzakat is deducted from it. Zakat does not have to be paid, however, on\nthe fruit that was damaged . Grapevines are dealt with in the same\nway.\n\n\nIf a man owns various pieces of property in various\nplaces, or is a co-owner of various pieces of property in various\nplaces, none of which individually comes to a zakatable amount, but\nwhich, when added together, do come to a zakatable amount, then he\nadds them together and pays the zakat that is due on them .\""}},{"id":38,"idInBook":38,"chapterId":17,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ سَأَلَ ابْنَ شِهَابٍ عَنِ الزَّيْتُونِ، فَقَالَ فِيهِ الْعُشْرُ ‏.‏ قَالَ مَالِكٌ وَإِنَّمَا يُؤْخَذُ مِنَ الزَّيْتُونِ الْعُشْرُ بَعْدَ أَنْ يُعْصَرَ وَيَبْلُغَ زَيْتُونُهُ خَمْسَةَ أَوْسُقٍ فَمَا لَمْ يَبْلُغْ زَيْتُونُهُ خَمْسَةَ أَوْسُقٍ فَلاَ زَكَاةَ فِيهِ وَالزَّيْتُونُ بِمَنْزِلَةِ النَّخِيلِ مَا كَانَ مِنْهُ سَقَتْهُ السَّمَاءُ وَالْعُيُونُ أَوْ كَانَ بَعْلاً فَفِيهِ الْعُشْرُ وَمَا كَانَ يُسْقَى بِالنَّضْحِ فَفِيهِ نِصْفُ الْعُشْرِ وَلاَ يُخْرَصُ شَىْءٌ مِنَ الزَّيْتُونِ فِي شَجَرِهِ ‏.‏ وَالسُّنَّةُ عِنْدَنَا فِي الْحُبُوبِ الَّتِي يَدَّخِرُهَا النَّاسُ وَيَأْكُلُونَهَا أَنَّهُ يُؤْخَذُ مِمَّا سَقَتْهُ السَّمَاءُ مِنْ ذَلِكَ وَمَا سَقَتْهُ الْعُيُونُ وَمَا كَانَ بَعْلاً الْعُشْرُ وَمَا سُقِيَ بِالنَّضْحِ نِصْفُ الْعُشْرِ إِذَا بَلَغَ ذَلِكَ خَمْسَةَ أَوْسُقٍ بِالصَّاعِ الأَوَّلِ صَاعِ النَّبِيِّ صلى الله عليه وسلم وَمَا زَادَ عَلَى خَمْسَةِ أَوْسُقٍ فَفِيهِ الزَّكَاةُ بِحِسَابِ ذَلِكَ ‏.‏ قَالَ مَالِكٌ وَالْحُبُوبُ الَّتِي فِيهَا الزَّكَاةُ الْحِنْطَةُ وَالشَّعِيرُ وَالسُّلْتُ وَالذُّرَةُ وَالدُّخْنُ وَالأُرْزُ وَالْعَدَسُ وَالْجُلْبَانُ وَاللُّوبِيَا وَالْجُلْجُلاَنُ وَمَا أَشْبَهَ ذَلِكَ مِنَ الْحُبُوبِ الَّتِي تَصِيرُ طَعَامًا فَالزَّكَاةُ تُؤْخَذُ مِنْهَا بَعْدَ أَنْ تُحْصَدَ وَتَصِيرَ حَبًّا ‏.‏ قَالَ وَالنَّاسُ مُصَدَّقُونَ فِي ذَلِكَ وَيُقْبَلُ مِنْهُمْ فِي ذَلِكَ مَا دَفَعُوا ‏.‏ وَسُئِلَ مَالِكٌ مَتَى يُخْرَجُ مِنَ الزَّيْتُونِ الْعُشْرُ أَوْ نِصْفُهُ أَقَبْلَ النَّفَقَةِ أَمْ بَعْدَهَا فَقَالَ لاَ يُنْظَرُ إِلَى النَّفَقَةِ وَلَكِنْ يُسْأَلُ عَنْهُ أَهْلُهُ كَمَا يُسْأَلُ أَهْلُ الطَّعَامِ عَنِ الطَّعَامِ وَيُصَدَّقُونَ بِمَا قَالُوا فَمَنْ رُفِعَ مِنْ زَيْتُونِهِ خَمْسَةُ أَوْسُقٍ فَصَاعِدًا أُخِذَ مِنْ زَيْتِهِ الْعُشْرُ بَعْدَ أَنْ يُعْصَرَ وَمَنْ لَمْ يُرْفَعْ مِنْ زَيْتُونِهِ خَمْسَةُ أَوْسُقٍ لَمْ تَجِبْ عَلَيْهِ فِي زَيْتِهِ الزَّكَاةُ ‏.‏ قَالَ مَالِكٌ وَمَنْ بَاعَ زَرْعَهُ وَقَدْ صَلَحَ وَيَبِسَ فِي أَكْمَامِهِ فَعَلَيْهِ زَكَاتُهُ وَلَيْسَ عَلَى الَّذِي اشْتَرَاهُ زَكَاةٌ وَلاَ يَصْلُحُ بَيْعُ الزَّرْعِ حَتَّى يَيْبَسَ فِي أَكْمَامِهِ وَيَسْتَغْنِيَ عَنِ الْمَاءِ ‏.‏ قَالَ مَالِكٌ فِي قَوْلِ اللَّهِ تَعَالَى ‏{‏وَآتُوا حَقَّهُ يَوْمَ حَصَادِهِ ‏}‏ أَنَّ ذَلِكَ الزَّكَاةُ وَقَدْ سَمِعْتُ مَنْ يَقُولُ ذَلِكَ ‏.‏ قَالَ مَالِكٌ وَمَنْ بَاعَ أَصْلَ حَائِطِهِ أَوْ أَرْضَهُ وَفِي ذَلِكَ زَرْعٌ أَوْ ثَمَرٌ لَمْ يَبْدُ صَلاَحُهُ فَزَكَاةُ ذَلِكَ عَلَى الْمُبْتَاعِ وَإِنْ كَانَ قَدْ طَابَ وَحَلَّ بَيْعُهُ فَزَكَاةُ ذَلِكَ عَلَى الْبَائِعِ إِلاَّ أَنْ يَشْتَرِطَهَا عَلَى الْمُبْتَاعِ ‏.‏","english":{"narrator":"Yahya related to me from Malik that he asked Ibn Shihab about\nolives and he said, \"There is a tenth on them.\"\n\n\nMalik said,\n\"The tenth that is taken from olives is taken after they have been\npressed, and the olives must come to a minimum amount of five awsuq\nand there must be at least five awsuq of olives. If there are less\nthan five awsuq of olives, no zakat has to be paid.\n\n\nOlive\ntrees are like date palms insofar as there is a tenth on whatever is\nwatered by rain or springs or any natural means, and a twentieth on\nwhatever is irrigated. However, olives are not estimated while on the\ntree. The sunna with us as far as grain and seeds which people store\nand eat is concerned is that a tenth is taken from whatever has been\nwatered by rain or springs or any natural means, and a twentieth from\nwhatever has been irrigated, that is, as long as the amount comes to\nfive awsuq or more using the aforementioned sa, that is, the sa of the\nProphet, may Allah bless him and grant him peace. Zakat must be paid\non anything above five awsuq according to the amount involved.\"\n\n\nMalik said, \"The kinds of grain and seeds on which there is zakat\nare:","text":"wheat, barley, sult (a kind of barley), sorghum, pearl millet,\nrice, lentils, peas, beans, sesame seeds and other such grains and\nseeds which are used for food.  Zakat is taken from them after they\nhave been harvested and are in the form of grai n or seed.\" He said,\n\"People are entrusted with the assessment and whatever they hand over\nis accepted .\"\n\n\nMalik was asked whether the tenth or the\ntwentieth was taken out of olives before they were sold or after and\nhe said, \"The sale is not taken into consideration. It is the people\nwho produce the olives that are asked about the olives, just as it is\nthe people who produce foodstuffs that are asked about it, and zakat\nis taken from them by what they say. Someone who gets five awsuq or\nmore of olives from his olive trees has a tenth taken from the oil\nafter pressing. Whereas someone who does not get five awsuq from his\ntrees does not have to pay any zakat on the oil.\"\n\n\nMalik said,\n\"Someone who sells his crops when they are ripe and are ready in the\nhusk has to pay zakat on them but the one who buys them does not. The\nsale of crops is not valid until they are ready in the husk and no\nlonger need water.\"\n\n\nMalik said, concerning the word of Allah\nthe Exalted, \"And give its due on the day of its harvesting,\" that it\nreferred to zakat, and that he had heard people saying that.\n\n\nMalik said, \"If someone sells his garden or his land, on which are\ncrops or fruit which have not yet ripened, then it is the buyer who\nhas to pay the zakat. If, however, they have ripened, it is the seller\nwho has to pay the zakat, unless paying the zakat is one of the\nconditions of the sale.\""}},{"id":39,"idInBook":39,"chapterId":17,"bookId":7,"arabic":"","english":{"narrator":"","text":"Malik said, \"If a man has four awsuq of dates he has harvested,\nfour awsuq of grapes he has picked, or four awsuq of wheat he has\nreaped or four awsuq of pulses he has harvested, the different\ncategories are not added together, and he does not have to pay zakat\non any of the categ ries - the dates, the grapes, the wheat or the\npulses - until any one of them comes to five awsuq using the sa of the\nProphet, may Allah bless him and grant him peace, as the Messenger of\nAllah, may Allah bless him and grant him peace, said, 'There is no\nzakat (to pay) on anything less than five awsuq of dates. 'lf any of\nthe categories comes to five awsuq, then zakat must be paid. If none\nof the categories comes to five awsuq, then there is no zakat to pay.\nThe explanation of this is that when a man harvests five awsuq of\ndates (from his palms), he adds them all together and deducts the\nzakat from them even if they are all of different kinds and varieties.\nIt is the same with different kinds of cereal, such as brown wheat,\nwhite wheat, barley and sult, which are all considered as one\ncategory. If a man reaps five awsuq of any of these, he adds it all\ntogether and pays zakat on it. If it does not come to that amount he\ndoes not have to pay any zakat. It is the same (also) with grapes,\nwhether they be black or red. If a man picks five awsuq of them he has\nto pay zakat on them, but if they do not come to that amount he does\nnot have to pay any zakat. Pulses also are considered as one category,\nlike cereals, dates and grapes, even if they are of different\nvarieties and are called by different names. Pulses include chick-\npeas, lentils, beans, peas, and anything which is agreed by everybody\nto be a pulse. If a man harvests five awsuq of pulses, measuring by\nthe aforementioned sa, the sa of the Prophet, may Allah bless him and\ngrant him peace, he collects them all together and must pay zakat on\nthem, even if they are of every kind of pulse and not just one kind.\"\n\n\nMalik said, ''Umar ibn al-Khattab drew a distinction between\npulses and wheat when he took zakat from the Nabatean christians. He\nconsidered all pulses to be one category and took a tenth from them,\nand from cereals and raisins he took a twentieth.\"\n\n\nMalik\nsaid, \"If some one asks, 'How can pulses be added up all together when\nassessing the zakat so that there is just one payment, when a man can\nbarter two of one kind for one of another, while cereals can not be\nbartered at a rate of two to one?', then tell him, 'Gold and silver\nare collected together when assessing the zakat, even though an amount\nof gold dinars can be exchanged for many times tha tamount of silver\ndirhams.' \"\n\n\nMalik said, regarding date palms which are shared\nequally between two men, and from which eight awsuq of dates are\nharvested, \"They do not have to pay any zakat on them. If one man owns\nfive awsuq of what is harvested from one piece of land, and the other\nowns four awsuq or less, the one who owns the five awsuq has to pay\nzakat, and the other one, who harvested four awsuq or less, does not\nhave to pay zakat. This is how things are done whenever there are\nassociates in any crop, whether the crop is grain or seeds that are\nreaped, or dates that are harvested, or grapes that are picked . Any\none of them that harvests five awsuq of dates, or picks five awsuq of\ngrapes, or reaps five awsuq of wheat, has to pay zakat, and whoever's\nportion is less than five awsuq does not have to pay zakat. Zakat only\nhas to be paid by someone whose harvesting or picking or reaping comes\nto five awsuq.\"\n\n\nMalik said, \"The sunna with us regarding\nanything from any of these categories, i.e. wheat, dates, grapes and\nany kind of grain o rseed, which has had the zakat deducted from it\nand is then stored by its owner for a number of years after he has\npaid the zakat on it until he sell sit, is that he does not have to\npay any zakat on the price he sells it for until a year has elapsed\nover it from the day he made the sale, as long as he got it through\n(chance) acquisition or some other means and it was not intended for\ntrading. Cereals, seeds and trade-goods are the same, in that if a man\nacquires some and keeps them for a number of years and then sells them\nfor gold or silver, he does not have to pay zakat on their price until\na year has elapsed over it from the day of sale. If, however, the\ngoods were intended for trade then the owner must pay zakat on them\nwhen he sells them, as long as he has had them for a year from the day\nwhen he paid zakat on the property with which he bought them.\""}},{"id":40,"idInBook":40,"chapterId":17,"bookId":7,"arabic":"","english":{"narrator":"","text":"Malik said, \"The sunna that we are all agreed upon here (in\nMadina) and which I have heard from the people of knowledge, is that\nthere is no zakat on any kind of fresh (soft) fruit, whether it be\npomegranates, peaches, figs or anything that is like them or not like\nthem as long as it is fruit.\"\n\n\nHe continued, \"No zakat has to\nbe paid on animal fodder or herbs and vegetables of any kind, and\nthere is no zakat to pay on the price realised on their sale until a\nyear has elapsed over it from the day of sale which counts as the time\nthe owner receives the sum.\""}},{"id":41,"idInBook":41,"chapterId":17,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنْ عِرَاكِ بْنِ مَالِكٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لَيْسَ عَلَى الْمُسْلِمِ فِي عَبْدِهِ وَلاَ فِي فَرَسِهِ صَدَقَةٌ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abdullah ibn Umar from\nSulayman ibn Yasar from Irak ibn Malik from Abu Hurayra that the\nMessenger of Allah, may Allah bless him and grant him peace, said, \"A\nmuslim does not have to pay any zakat on his slave or his horse.\""}},{"id":42,"idInBook":42,"chapterId":17,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، أَنَّ أَهْلَ الشَّامِ، قَالُوا لأَبِي عُبَيْدَةَ بْنِ الْجَرَّاحِ خُذْ مِنْ خَيْلِنَا وَرَقِيقِنَا صَدَقَةً ‏.‏ فَأَبَى ثُمَّ كَتَبَ إِلَى عُمَرَ بْنِ الْخَطَّابِ فَأَبَى عُمَرُ ثُمَّ كَلَّمُوهُ أَيْضًا فَكَتَبَ إِلَى عُمَرَ فَكَتَبَ إِلَيْهِ عُمَرُ إِنْ أَحَبُّوا فَخُذْهَا مِنْهُمْ وَارْدُدْهَا عَلَيْهِمْ وَارْزُقْ رَقِيقَهُمْ ‏.‏ قَالَ مَالِكٌ مَعْنَى قَوْلِهِ رَحِمَهُ اللَّهُ وَارْدُدْهَا عَلَيْهِمْ يَقُولُ عَلَى فُقَرَائِهِمْ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Sulayman ibn\nYasar that the people of Syria said to Abu Ubayda ibn al-Jarrah, \"Take\nzakat from our horses and slaves,\" and he refused. Then he wrote to\nUmar ibn al-Khattab and he (also) refused. Again they talked to him\nand again he wrote to Umar, and Umar wrote back to him saying, \"If\nthey want, take it from them and (then) give it back to them and give\ntheir slaves provision.\"\n\n\nMalik said, \"What he means, may\nAllah have mercy upon him, by the words 'and give it back to them' is,\n'to their poor.' \""}},{"id":43,"idInBook":43,"chapterId":17,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ عَمْرِو بْنِ حَزْمٍ، أَنَّهُ قَالَ جَاءَ كِتَابٌ مِنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ إِلَى أَبِي وَهُوَ بِمِنًى أَنْ لاَ يَأْخُذَ مِنَ الْعَسَلِ وَلاَ مِنَ الْخَيْلِ صَدَقَةً ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Abdullah ibn Abi Bakr ibn Amr\nibn Hazim said, \"A message came from Umar ibn Abd al-Aziz to my father\nwhen he was in Mina telling him not to take zakat from either honey or\nhorses.\""}},{"id":44,"idInBook":44,"chapterId":17,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، أَنَّهُ قَالَ سَأَلْتُ سَعِيدَ بْنَ الْمُسَيَّبِ عَنْ صَدَقَةِ الْبَرَاذِينِ، فَقَالَ وَهَلْ فِي الْخَيْلِ مِنْ صَدَقَةٍ","english":{"narrator":"","text":"Yahya related to me from Malik that Abdullah ibn Dinar said, \"I\nasked Said ibn al-Musayyab about zakat on work-horses, and he said,\n'Is there any zakat on horses ?' \""}},{"id":45,"idInBook":45,"chapterId":17,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، قَالَ بَلَغَنِي أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَخَذَ الْجِزْيَةَ مِنْ مَجُوسِ الْبَحْرَيْنِ وَأَنَّ عُمَرَ بْنَ الْخَطَّابِ أَخَذَهَا مِنْ مَجُوسِ فَارِسَ وَأَنَّ عُثْمَانَ بْنَ عَفَّانَ أَخَذَهَا مِنَ الْبَرْبَرِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Ibn Shihab said, \"I have\nheard that the Messenger of Allah, may Allah bless him and grant him\npeace, took jizya from the magians of Bahrain, that Umar ibn al-\nKhattab took it from the magians of Persia and that Uthman ibn Affan\ntook it from the Berbers.\""}},{"id":46,"idInBook":46,"chapterId":17,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ جَعْفَرِ بْنِ مُحَمَّدِ بْنِ عَلِيٍّ، عَنْ أَبِيهِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، ذَكَرَ الْمَجُوسَ فَقَالَ مَا أَدْرِي كَيْفَ أَصْنَعُ فِي أَمْرِهِمْ فَقَالَ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ أَشْهَدُ لَسَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ سُنُّوا بِهِمْ سُنَّةَ أَهْلِ الْكِتَابِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Jafar ibn Muhammad ibn Ali\nfrom his father that Umar ibn al-Khattab mentioned the magians and\nsaid, \"I do not know what to do about them.\" Abd ar-Rahman ibn Awf\nsaid, \"I bear witness that I heard the Messenger of Allah, may Allah\nbless him and grant him peace, say, 'Follow the same sunna with them\nthat you follow with the people of the Book . ' \""}},{"id":47,"idInBook":47,"chapterId":17,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ أَسْلَمَ، مَوْلَى عُمَرَ بْنِ الْخَطَّابِ أَنَّ عُمَرَ بْنَ الْخَطَّابِ، ضَرَبَ الْجِزْيَةَ عَلَى أَهْلِ الذَّهَبِ أَرْبَعَةَ دَنَانِيرَ وَعَلَى أَهْلِ الْوَرِقِ أَرْبَعِينَ دِرْهَمًا مَعَ ذَلِكَ أَرْزَاقُ الْمُسْلِمِينَ وَضِيَافَةُ ثَلاَثَةِ أَيَّامٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi from Aslam, the mawla of\nUmar ibn al-Khattab, that Umar ibn al-Khattab imposed a jizya tax of\nfour dinars on those living where gold was the currency, and forty\ndirhams on those living where silver was the currency. In addition,\nthey had to provide for the muslims and receive them as guests for\nthree days."}},{"id":48,"idInBook":48,"chapterId":17,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَبِيهِ، أَنَّهُ قَالَ لِعُمَرَ بْنِ الْخَطَّابِ إِنَّ فِي الظَّهْرِ نَاقَةً عَمْيَاءَ ‏.‏ فَقَالَ عُمَرُ ادْفَعْهَا إِلَى أَهْلِ بَيْتٍ يَنْتَفِعُونَ بِهَا ‏.‏ قَالَ فَقُلْتُ وَهِيَ عَمْيَاءُ فَقَالَ عُمَرُ يَقْطُرُونَهَا بِالإِبِلِ ‏.‏ قَالَ فَقُلْتُ كَيْفَ تَأْكُلُ مِنَ الأَرْضِ قَالَ فَقَالَ عُمَرُ أَمِنْ نَعَمِ الْجِزْيَةِ هِيَ أَمْ مِنْ نَعَمِ الصَّدَقَةِ فَقُلْتُ بَلْ مِنْ نَعَمِ الْجِزْيَةِ ‏.‏ فَقَالَ عُمَرُ أَرَدْتُمْ - وَاللَّهِ - أَكْلَهَا ‏.‏ فَقُلْتُ إِنَّ عَلَيْهَا وَسْمَ الْجِزْيَةِ ‏.‏ فَأَمَرَ بِهَا عُمَرُ فَنُحِرَتْ وَكَانَ عِنْدَهُ صِحَافٌ تِسْعٌ فَلاَ تَكُونُ فَاكِهَةٌ وَلاَ طُرَيْفَةٌ إِلاَّ جَعَلَ مِنْهَا فِي تِلْكَ الصِّحَافِ فَبَعَثَ بِهَا إِلَى أَزْوَاجِ النَّبِيِّ صلى الله عليه وسلم وَيَكُونُ الَّذِي يَبْعَثُ بِهِ إِلَى حَفْصَةَ ابْنَتِهِ مِنْ آخِرِ ذَلِكَ فَإِنْ كَانَ فِيهِ نُقْصَانٌ كَانَ فِي حَظِّ حَفْصَةَ - قَالَ - فَجَعَلَ فِي تِلْكَ الصِّحَافِ مِنْ لَحْمِ تِلْكَ الْجَزُورِ فَبَعَثَ بِهِ إِلَى أَزْوَاجِ النَّبِيِّ صلى الله عليه وسلم وَأَمَرَ بِمَا بَقِيَ مِنْ لَحْمِ تِلْكَ الْجَزُورِ فَصُنِعَ فَدَعَا عَلَيْهِ الْمُهَاجِرِينَ وَالأَنْصَارَ ‏.‏ قَالَ مَالِكٌ لاَ أَرَى أَنْ تُؤْخَذَ النَّعَمُ مِنْ أَهْلِ الْجِزْيَةِ إِلاَّ فِي جِزْيَتِهِمْ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Zayd ibn Aslam from his\nfather that he said to Umar ibn al-Khattab, \"There is a blind she-\ncamel behind the house,'' soUmar said, \"Hand it over to a household so\nthat they can make (some) use of it.\" He said, \"But she is blind.\"\nUmar replied, \"Then put it in a line with other camels.\" He said, \"How\nwill it be able to eat from the ground?\" Umar asked, \"Is it from the\nlivestock of the jizya or the zakat?\" and Aslam replied, \"From the\nlivestock of the jizya.\" Umar said, \"By AIIah, you wish to eat it.\"\nAslam said, \"It has the brand of the jizya on it.\" So Umar ordered it\nto be slaughtered. He had nine platters, and on each of the platters\nhe put some of every fruit and delicacy that there was and then sent\nthem to the wives of the Prophet, may Allah bless him and grant him\npeace, and the one he sent to his daughter Hafsa was the last of them\nall, and if there was any deficiency in any of them it was in Hafsa's\nportion.\n\n\n\"He put meat from the slaughtered animal on the\nplatters and sent them to the wives of the Prophet, may Allah bless\nhim and grant him peace, and he ordered what was left of the meat of\nthe slaughtered animal to be prepared. Then he invited the Muhajirun\nand the Ansar to eat it.\"\n\n\nMalik said, \"I do not think that\nlivestock should be taken from people who pay the jizya except as\njizya.\""}},{"id":49,"idInBook":49,"chapterId":17,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ، كَتَبَ إِلَى عُمَّالِهِ أَنْ يَضَعُوا الْجِزْيَةَ عَمَّنْ أَسْلَمَ مِنْ أَهْلِ الْجِزْيَةِ حِينَ يُسْلِمُونَ ‏.‏ قَالَ مَالِكٌ مَضَتِ السُّنَّةُ أَنْ لاَ جِزْيَةَ عَلَى نِسَاءِ أَهْلِ الْكِتَابِ وَلاَ عَلَى صِبْيَانِهِمْ وَأَنَّ الْجِزْيَةَ لاَ تُؤْخَذُ إِلاَّ مِنَ الرِّجَالِ الَّذِينَ قَدْ بَلَغُوا الْحُلُمَ وَلَيْسَ عَلَى أَهْلِ الذِّمَّةِ وَلاَ عَلَى الْمَجُوسِ فِي نَخِيلِهِمْ وَلاَ كُرُومِهِمْ وَلاَ زُرُوعِهِمْ وَلاَ مَوَاشِيهِمْ صَدَقَةٌ لأَنَّ الصَّدَقَةَ إِنَّمَا وُضِعَتْ عَلَى الْمُسْلِمِينَ تَطْهِيرًا لَهُمْ وَرَدًّا عَلَى فُقَرَائِهِمْ وَوُضِعَتِ الْجِزْيَةُ عَلَى أَهْلِ الْكِتَابِ صَغَارًا لَهُمْ فَهُمْ مَا كَانُوا بِبَلَدِهِمُ الَّذِينَ صَالَحُوا عَلَيْهِ لَيْسَ عَلَيْهِمْ شَىْءٌ سِوَى الْجِزْيَةِ فِي شَىْءٍ مِنْ أَمْوَالِهِمْ إِلاَّ أَنْ يَتَّجِرُوا فِي بِلاَدِ الْمُسْلِمِينَ وَيَخْتَلِفُوا فِيهَا فَيُؤْخَذُ مِنْهُمُ الْعُشْرُ فِيمَا يُدِيرُونَ مِنَ التِّجَارَاتِ وَذَلِكَ أَنَّهُمْ إِنَّمَا وُضِعَتْ عَلَيْهِمُ الْجِزْيَةُ وَصَالَحُوا عَلَيْهَا عَلَى أَنْ يُقَرُّوا بِبِلاَدِهِمْ وَيُقَاتَلَ عَنْهُمْ عَدُوُّهُمْ فَمَنْ خَرَجَ مِنْهُمْ مِنْ بِلاَدِهِ إِلَى غَيْرِهَا يَتْجُرُ إِلَيْهَا فَعَلَيْهِ الْعُشْرُ مَنْ تَجَرَ مِنْهُمْ مِنْ أَهْلِ مِصْرَ إِلَى الشَّامِ وَمِنْ أَهْلِ الشَّامِ إِلَى الْعِرَاقِ وَمِنْ أَهْلِ الْعِرَاقِ إِلَى الْمَدِينَةِ أَوِ الْيَمَنِ أَوْ مَا أَشْبَهَ هَذَا مِنَ الْبِلاَدِ فَعَلَيْهِ الْعُشْرُ وَلاَ صَدَقَةَ عَلَى أَهْلِ الْكِتَابِ وَلاَ الْمَجُوسِ فِي شَىْءٍ مِنْ أَمْوَالِهِمْ وَلاَ مِنْ مَوَاشِيهِمْ وَلاَ ثِمَارِهِمْ وَلاَ زُرُوعِهِمْ مَضَتْ بِذَلِكَ السُّنَّةُ وَيُقَرُّونَ عَلَى دِينِهِمْ وَيَكُونُونَ عَلَى مَا كَانُوا عَلَيْهِ وَإِنِ اخْتَلَفُوا فِي الْعَامِ الْوَاحِدِ مِرَارًا فِي بِلاَدِ الْمُسْلِمِينَ فَعَلَيْهِمْ كُلَّمَا اخْتَلَفُوا الْعُشْرُ لأَنَّ ذَلِكَ لَيْسَ مِمَّا صَالَحُوا عَلَيْهِ وَلاَ مِمَّا شُرِطَ لَهُمْ وَهَذَا الَّذِي أَدْرَكْتُ عَلَيْهِ أَهْلَ الْعِلْمِ بِبَلَدِنَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Umar ibn\nAbd al-Aziz wrote to his governors telling them to relieve any people\nwho payed the jizya from paying the jizya if they became muslims.\n\n\nMalik said, \"The sunna is that there is no jizya due from women or\nchildren of people of the Book, and that jizya is only taken from men\nwho have reached puberty. The people of dhimma and the magians do not\nhave to pay any zakat on their palms or their vines or their crops or\ntheir livestock. This is because zakat is imposed on the muslims to\npurify them and to be given back to their poor, whereas jizya is\nimposed on the people of the Book to humble them. As long as they are\nin the country they have agreed to live in, they do not have to pay\nanything on their property except the jizya. If, however, they trade\nin muslim countries, coming and going in them, a tenth is taken from\nwhat they invest in such trade. This is because jizya is only imposed\non them on conditions, which they have agreed on, namely that they\nwill remain in their own countries, and that war will be waged for\nthem on any enemy of theirs, and that if they then leave that land to\ngo anywhere else to do business they will haveto pay a tenth. Whoever\namong them does business with the people of Egypt, and then goes to\nSyria, and then does business with the people of Syria and then goes\nto Iraq and does business with them and then goes on to Madina, or\nYemen, or other similar places, has to pay a tenth.\n\n\nPeople of\nthe Book and magians do not have to pay any zakat on any of their\nproperty, livestock, produce or crops. The sunna still continues like\nthat. They remain in the deen they were in, and they continue to do\nwhat they used to do. If in any one year they frequently come and go\nin muslim countries then they have to pay a tenth every time they do\nso, since that is outside what they have agreed upon, and not one of\nthe conditions stipulated for them. This is what I have seen the\npeople of knowledge of our city doing.\""}},{"id":50,"idInBook":50,"chapterId":17,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِيهِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، كَانَ يَأْخُذُ مِنَ النَّبَطِ مِنَ الْحِنْطَةِ وَالزَّيْتِ نِصْفَ الْعُشْرِ يُرِيدُ بِذَلِكَ أَنْ يَكْثُرَ الْحَمْلُ إِلَى الْمَدِينَةِ وَيَأْخُذُ مِنَ الْقُطْنِيَّةِ الْعُشْرَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Ibn Shihab from Salim ibn Abdullah from\nhis father that Umar ibn al-Khattab used to take a twentieth from the\ncereals and olive oil of the Nabatean christians, intending by that to\nincrease the cargo to Madina. He would take a tenth from pulses."}},{"id":51,"idInBook":51,"chapterId":17,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنِ السَّائِبِ بْنِ يَزِيدَ، أَنَّهُ قَالَ كُنْتُ غُلاَمًا عَامِلاً مَعَ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ عَلَى سُوقِ الْمَدِينَةِ فِي زَمَانِ عُمَرَ بْنِ الْخَطَّابِ فَكُنَّا نَأْخُذُ مِنَ النَّبَطِ الْعُشْرَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab that as-Sa'ib ibn\nYazid said, \"As a young man I used to work with Abdullah ibn Utba ibn\nMasud in the market of Madina in the time of Umar ibn al-Khattab and\nwe used to take a tenth from the Nabateans.\""}},{"id":52,"idInBook":52,"chapterId":17,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ سَأَلَ ابْنَ شِهَابٍ عَلَى أَىِّ وَجْهٍ كَانَ يَأْخُذُ عُمَرُ بْنُ الْخَطَّابِ مِنَ النَّبَطِ الْعُشْرَ فَقَالَ ابْنُ شِهَابٍ كَانَ ذَلِكَ يُؤْخَذُ مِنْهُمْ فِي الْجَاهِلِيَّةِ فَأَلْزَمَهُمْ ذَلِكَ عُمَرُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had asked Ibn Shihab why\nUmar ibn al Khattab used to take a tenth from the Nabateans, and Ibn\nShihab replied, \"It used to be taken from them in the jahiliyya, and\nUmar imposed it on them.\""}},{"id":53,"idInBook":53,"chapterId":17,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَبِيهِ، أَنَّهُ قَالَ سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ، وَهُوَ يَقُولُ حَمَلْتُ عَلَى فَرَسٍ عَتِيقٍ فِي سَبِيلِ اللَّهِ - وَكَانَ الرَّجُلُ الَّذِي هُوَ عِنْدَهُ قَدْ أَضَاعَهُ - فَأَرَدْتُ أَنْ أَشْتَرِيَهُ مِنْهُ وَظَنَنْتُ أَنَّهُ بَائِعُهُ بِرُخْصٍ فَسَأَلْتُ عَنْ ذَلِكَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ لاَ تَشْتَرِهِ وَإِنْ أَعْطَاكَهُ بِدِرْهَمٍ وَاحِدٍ فَإِنَّ الْعَائِدَ فِي صَدَقَتِهِ كَالْكَلْبِ يَعُودُ فِي قَيْئِهِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Zayd ibn Aslam that his father said that\nhe had heard Umar ibn al-Khattab say, \"I once gave a noble horse to\ncarry somebody in the way of Allah, and the man neglected it. I wished\nto buy it back from him and I thought that he would sell it cheaply. I\nasked the Messenger of Allah, may Allah bless him and grant him peace,\nabout it and he said, 'Do not buy it, even if he gives it to you for\none dirham, for someone who takes back his sadaqa is like a dog\nswallowing its own vomit.' \""}},{"id":54,"idInBook":54,"chapterId":17,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، حَمَلَ عَلَى فَرَسٍ فِي سَبِيلِ اللَّهِ فَأَرَادَ أَنْ يَبْتَاعَهُ فَسَأَلَ عَنْ ذَلِكَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ لاَ تَبْتَعْهُ وَلاَ تَعُدْ فِي صَدَقَتِكَ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi from Abdullah ibn Umar that Umar ibn al-Khattab gave a horse to carry some one in the way of Allah, and then he wished to buy it back. So he asked the Messenger of Allah, may Allah bless him and grant him peace, about it, and he said, \"Do not buy or take back your sadaqa.\""}},{"id":55,"idInBook":55,"chapterId":17,"bookId":7,"arabic":"","english":{"narrator":"","text":"Yahya said that Malik was asked about whether a man who gave some sadaqa, and then found it being offered back to him for sale by some one other than the man to whom he had given it, could buy it or not, and he said, \"I prefer that he leaves it.\""}},{"id":56,"idInBook":56,"chapterId":17,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يُخْرِجُ زَكَاةَ الْفِطْرِ عَنْ غِلْمَانِهِ الَّذِينَ، بِوَادِي الْقُرَى وَبِخَيْبَرَ ‏.‏ وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّ أَحْسَنَ، مَا سَمِعْتُ فِيمَا، يَجِبُ عَلَى الرَّجُلِ مِنْ زَكَاةِ الْفِطْرِ أَنَّ الرَّجُلَ يُؤَدِّي ذَلِكَ عَنْ كُلِّ مَنْ يَضْمَنُ نَفَقَتَهُ وَلاَ بُدَّ لَهُ مِنْ أَنْ يُنْفِقَ عَلَيْهِ وَالرَّجُلُ يُؤَدِّي عَنْ مُكَاتَبِهِ وَمُدَبَّرِهِ وَرَقِيقِهِ كُلِّهِمْ غَائِبِهِمْ وَشَاهِدِهِمْ مَنْ كَانَ مِنْهُمْ مُسْلِمًا وَمَنْ كَانَ مِنْهُمْ لِتِجَارَةٍ أَوْ لِغَيْرِ تِجَارَةٍ وَمَنْ لَمْ يَكُنْ مِنْهُمْ مُسْلِمًا فَلاَ زَكَاةَ عَلَيْهِ فِيهِ ‏.‏ قَالَ مَالِكٌ فِي الْعَبْدِ الآبِقِ إِنَّ سَيِّدَهُ إِنْ عَلِمَ مَكَانَهُ أَوْ لَمْ يَعْلَمْ وَكَانَتْ غَيْبَتُهُ قَرِيبَةً فَهُوَ يَرْجُو حَيَاتَهُ وَرَجْعَتَهُ فَإِنِّي أَرَى أَنْ يُزَكِّيَ عَنْهُ وَإِنْ كَانَ إِبَاقُهُ قَدْ طَالَ وَيَئِسَ مِنْهُ فَلاَ أَرَى أَنْ يُزَكِّيَ عَنْهُ ‏.‏ قَالَ مَالِكٌ تَجِبُ زَكَاةُ الْفِطْرِ عَلَى أَهْلِ الْبَادِيَةِ كَمَا تَجِبُ عَلَى أَهْلِ الْقُرَى وَذَلِكَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم فَرَضَ زَكَاةَ الْفِطْرِ مِنْ رَمَضَانَ عَلَى النَّاسِ عَلَى كُلِّ حُرٍّ أَوْ عَبْدٍ ذَكَرٍ أَوْ أُنْثَى مِنَ الْمُسْلِمِينَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nused to pay the zakat al-fitr for those slaves of  his that were at\nWadi'l-Qura and Khaybar.\n\n\nYahya related to me that Malik said,\n\"The best that I have heard about the zakat al-fitr is that a man has\nto pay for every person that he is responsible for supporting and whom\nhe must support. He has to pay forall his mukatabs, his mudabbars, and\nhis ordinary slaves, whether they are present or absent, as long as\nthey are muslim, and whether or not they are fortrade. However, he\ndoes not have to pay zakat on any of them that are not muslim.\"\n\n\nMalik said, concerning a runaway slave, \"I think that his master\nshould pay the zakat fo rhim whether or not he knows where he is, if\nit has not been long since the slave ran away and his master hopes\nthat he is still alive and will return. If it has been a long time\nsince he ran away and his master has despaired of him returning then I\ndo not think that he should pay zakat for him.'\n\n\nMalik said,\n\"The zakat al-fitr has to be paid by people living in the desert (i.e.\nnomadic people) just as it has to be paid by people living in villages\n(i.e. settled people), because the Messenger of Allah, may Allah bless\nhim and grant him peace, made the zakat al-fitr at the end of Ramadan\nobligatory on every muslim, whether freeman or slave, male or female.\""}},{"id":57,"idInBook":57,"chapterId":17,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم فَرَضَ زَكَاةَ الْفِطْرِ مِنْ رَمَضَانَ عَلَى النَّاسِ صَاعًا مِنْ تَمْرٍ أَوْ صَاعًا مِنْ شَعِيرٍ عَلَى كُلِّ حُرٍّ أَوْ عَبْدٍ ذَكَرٍ أَوْ أُنْثَى مِنَ الْمُسْلِمِينَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat the Messenger of Allah, may Allah bless him and grant him peace,\nmade the zakat of breaking the fast at the end of Ramadan obligatory\non every muslim, whether freeman or slave, male or female, and\nstipulated it as a sa' of dates or a sa' of barley."}},{"id":58,"idInBook":58,"chapterId":17,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ بْنِ سَعْدِ بْنِ أَبِي سَرْحٍ الْعَامِرِيِّ، أَنَّهُ سَمِعَ أَبَا سَعِيدٍ الْخُدْرِيَّ، يَقُولُ كُنَّا نُخْرِجُ زَكَاةَ الْفِطْرِ صَاعًا مِنْ طَعَامٍ أَوْ صَاعًا مِنْ شَعِيرٍ أَوْ صَاعًا مِنْ تَمْرٍ أَوْ صَاعًا مِنْ أَقِطٍ أَوْ صَاعًا مِنْ زَبِيبٍ وَذَلِكَ بِصَاعِ النَّبِيِّ صلى الله عليه وسلم ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Zayd ibn Aslam from lyad ibn\nAbdullah ibn Sad ibn Abi Sarh al-Amiri that he had heard Abu Said al-\nKhudri say, \"We used to pay the zakat al-fitr with a sa of wheat, or a\nsa of barley, or a sa of dates, or a sa of dried sour milk, or a sa of\nraisins, using the sa of the Prophet, may Allah bless him and grant\nhim peace . \""}},{"id":59,"idInBook":59,"chapterId":17,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ لاَ يُخْرِجُ فِي زَكَاةِ الْفِطْرِ إِلاَّ التَّمْرَ إِلاَّ مَرَّةً وَاحِدَةً فَإِنَّهُ أَخْرَجَ شَعِيرًا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar would always pay the zakat al-fitr in dates, except once, when he paid it in barley."}},{"id":60,"idInBook":60,"chapterId":17,"bookId":7,"arabic":"","english":{"narrator":"","text":"Maliksaid, \"Payment of all types of kaffara, of zakat al-fitr and of the zakat on grains for which a tenth or a twentieth is due, is made using the smaller mudd, which is the mudd of the Prophet, may Allah bless him and grant him peace, except in the case of dhihar divorce, when the kaffara is paid using the mudd of Hisham, which is the larger mudd.\""}},{"id":61,"idInBook":61,"chapterId":17,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَبْعَثُ بِزَكَاةِ الْفِطْرِ إِلَى الَّذِي تُجْمَعُ عِنْدَهُ قَبْلَ الْفِطْرِ بِيَوْمَيْنِ أَوْ ثَلاَثَةٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nused to send the zakat al-fitr to the one with whom it was collected\ntogether two or three days before the day of breaking the fast."}},{"id":62,"idInBook":62,"chapterId":17,"bookId":7,"arabic":"","english":{"narrator":"","text":"Yahya related to me that Malik had seen that the people of\nknowledge used to like to pay the zakat al-fitr after dawn had broken\non the day of the Fitr before they went to the place of prayer.\n\n\nMalik said, \"There is leeway in this, if Allah wills, in that it\ncan be paid either before setting out (for the prayer) on the day of\nFitr or afterwards.\""}},{"id":63,"idInBook":63,"chapterId":17,"bookId":7,"arabic":"","english":{"narrator":"","text":"Yahya related to me that Malik said, \"A man does not have to pay\nzakat for the slaves of his slaves, or for some one employed by him,\nor for his wife's slaves, except for anyone who serves him and whose\nservices are indispensable to him, in which case he must pay zakat. He\ndoes not have to pay zakat for any of his slaves that are kafir and\nhave not become muslim, whether they be for trade or otherwise.\""}}],"chapter":{"id":17,"bookId":7,"arabic":"كتاب الزكاة","english":"Zakat"}}