{"metadata":{"length":267,"arabic":{"title":"موطأ مالك","author":"الإمام مالك بن أنس","introduction":"كتاب الحج"},"english":{"title":"Muwatta Malik","author":"Imam Malik ibn Anas","introduction":"Hajj"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ أَسْمَاءَ بِنْتِ عُمَيْسٍ، أَنَّهَا وَلَدَتْ مُحَمَّدَ بْنَ أَبِي بَكْرٍ بِالْبَيْدَاءِ فَذَكَرَ ذَلِكَ أَبُو بَكْرٍ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ مُرْهَا فَلْتَغْتَسِلْ ثُمَّ لِتُهِلَّ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abd ar-Rahman ibn al-Qasim\nfrom his father from Asma bint Umays that she gave birth to Muhammad\nibn Abi Bakr at al-Bayda. Abu Bakr mentioned this to the Messenger of\nAllah, may Allah bless him and grant him peace, and he said, \"Tell her\nto do ghusl and then enter ihram.\""}},{"id":2,"idInBook":2,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ أَسْمَاءَ بِنْتَ عُمَيْسٍ، وَلَدَتْ، مُحَمَّدَ بْنَ أَبِي بَكْرٍ بِذِي الْحُلَيْفَةِ فَأَمَرَهَا أَبُو بَكْرٍ أَنْ تَغْتَسِلَ، ثُمَّ تُهِلَّ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said from Said ibn\nal-Musayyab that Asma bint Umays gave birth to Muhammad ibn Abi Bakr\nat Dhu'l-Hulayfa and Abu Bakr told her to do ghusl and then enter\nihram."}},{"id":3,"idInBook":3,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَغْتَسِلُ لإِحْرَامِهِ قَبْلَ أَنْ يُحْرِمَ وَلِدُخُولِهِ مَكَّةَ وَلِوُقُوفِهِ عَشِيَّةَ عَرَفَةَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi' that 'Abdullah ibn Umar\nused to do ghusl for ihram before he entered ihram, and for entering\nMakka, and for standing on the afternoon of 'Arafa."}},{"id":4,"idInBook":4,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ بْنِ حُنَيْنٍ، عَنْ أَبِيهِ، أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، وَالْمِسْوَرَ بْنَ مَخْرَمَةَ، اخْتَلَفَا بِالأَبْوَاءِ فَقَالَ عَبْدُ اللَّهِ يَغْسِلُ الْمُحْرِمُ رَأْسَهُ ‏.‏ وَقَالَ الْمِسْوَرُ بْنُ مَخْرَمَةَ لاَ يَغْسِلُ الْمُحْرِمُ رَأْسَهُ ‏.‏ قَالَ فَأَرْسَلَنِي عَبْدُ اللَّهِ بْنُ عَبَّاسٍ إِلَى أَبِي أَيُّوبَ الأَنْصَارِيِّ فَوَجَدْتُهُ يَغْتَسِلُ بَيْنَ الْقَرْنَيْنِ وَهُوَ يُسْتَرُ بِثَوْبٍ فَسَلَّمْتُ عَلَيْهِ فَقَالَ مَنْ هَذَا فَقُلْتُ أَنَا عَبْدُ اللَّهِ بْنُ حُنَيْنٍ أَرْسَلَنِي إِلَيْكَ عَبْدُ اللَّهِ بْنُ عَبَّاسٍ أَسْأَلُكَ كَيْفَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَغْسِلُ رَأْسَهُ وَهُوَ مُحْرِمٌ قَالَ فَوَضَعَ أَبُو أَيُّوبَ يَدَهُ عَلَى الثَّوْبِ فَطَأْطَأَهُ حَتَّى بَدَا لِي رَأْسُهُ ثُمَّ قَالَ لإِنْسَانٍ يَصُبُّ عَلَيْهِ اصْبُبْ ‏.‏ فَصَبَّ عَلَى رَأْسِهِ ثُمَّ حَرَّكَ رَأْسَهُ بِيَدَيْهِ فَأَقْبَلَ بِهِمَا وَأَدْبَرَ ثُمَّ قَالَ هَكَذَا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَفْعَلُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Zayd ibn Aslam from Ibrahim\nibn Abdullah ibn Hunayn from his father Abdullah ibn Hunayn that\nAbdullah ibn Abbas and al-Miswar ibn Makhrama once had a disagreement\nat al-Abwa. Abdullah said that some one in ihram could wash his head,\nand al Miswar ibn Makhrama maintained that some one in ihram could not\nwash his head.\n\n\nAbdullah ibn Hunayn continued, \"Abdullah ibn\nAbbas sent me to Abu Ayyub al-Ansari, and I found him doing ghusl\nbetween the posts of a well, screened by a garment. I greeted him and\nhesaid, 'Who is that?' I replied, 'I am 'Abdullah ibn Hunayn.\n'Abdullah ibn Abbas sent me to you to ask how the Messenger of Allah,\nmay Allah bless him and grant him peace, used to wash his head when he\nwas in ihram.' \"\n\n\nHe continued, \"Abu Ayyub put his hand on the\ngarment and pulled it down until I could see his head. He said to the\nman who was pouring out the water for him, 'Pour,' and he poured some\nover his head. Then he passed his hands over his head from the front\nto the back and then to the front again, and then said, 'I saw the\nMessenger of Allah, may Allah bless him and grant him peace, doing it\nlike this.' \""}},{"id":5,"idInBook":5,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ حُمَيْدِ بْنِ قَيْسٍ، عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ لِيَعْلَى ابْنِ مُنْيَةَ وَهُوَ يَصُبُّ عَلَى عُمَرَ بْنِ الْخَطَّابِ مَاءً وَهُوَ يَغْتَسِلُ اصْبُبْ عَلَى رَأْسِي ‏.‏ فَقَالَ يَعْلَى أَتُرِيدُ أَنْ تَجْعَلَهَا بِي إِنْ أَمَرْتَنِي صَبَبْتُ ‏.‏ فَقَالَ لَهُ عُمَرُ بْنُ الْخَطَّابِ اصْبُبْ فَلَنْ يَزِيدَهُ الْمَاءُ إِلاَّ شَعَثًا ‏.‏","english":{"narrator":"","text":"Malik related to me from Humayd ibn Qays from Ata ibn Abi Rabah\nthat 'Umar ibn alKhattab once asked Yala ibn Munya, who was pouring\nout water for him while he was having a ghusl, to pour some on his\nhead. Ya'la said, \"Are you trying to make me responsible? I will only\npour it out if you tell me to do so.\" Umar ibn al-Khattab said, \"Pour.\nIt will only make (my head) more unkempt.\""}},{"id":6,"idInBook":6,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ إِذَا دَنَا مِنْ مَكَّةَ بَاتَ بِذِي طُوًى بَيْنَ الثَّنِيَّتَيْنِ حَتَّى يُصْبِحَ ثُمَّ يُصَلِّي الصُّبْحَ ثُمَّ يَدْخُلُ مِنَ الثَّنِيَّةِ الَّتِي بِأَعْلَى مَكَّةَ وَلاَ يَدْخُلُ إِذَا خَرَجَ حَاجًّا أَوْ مُعْتَمِرًا حَتَّى يَغْتَسِلَ قَبْلَ أَنْ يَدْخُلَ مَكَّةَ إِذَا دَنَا مِنْ مَكَّةَ بِذِي طُوًى وَيَأْمُرُ مَنْ مَعَهُ فَيَغْتَسِلُونَ قَبْلَ أَنْ يَدْخُلُوا ‏.‏","english":{"narrator":"","text":"Malik related to me from Nafi that Abdullah ibn Umar would spend\nthe night between the two trails in the valley of Dhu Tuwa when he was\napproaching Makka. Then he would pray subh, and after that he would\nenter Makka by the trail which is at the highest part of Makka. He\nwould never enter Makka, if he was coming for hajj or umra, without\ndoing ghusl beforehand when he was near Makka at Dhu Tuwa, and he\nwould tell whoever was with him to do likewise."}},{"id":7,"idInBook":7,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ لاَ يَغْسِلُ رَأْسَهُ وَهُوَ مُحْرِمٌ إِلاَّ مِنَ الاِحْتِلاَمِ ‏.‏ قَالَ مَالِكٌ سَمِعْتُ أَهْلَ الْعِلْمِ يَقُولُونَ لاَ بَأْسَ أَنْ يَغْسِلَ الرَّجُلُ الْمُحْرِمُ رَأْسَهُ بِالْغَسُولِ بَعْدَ أَنْ يَرْمِيَ جَمْرَةَ الْعَقَبَةِ وَقَبْلَ أَنْ يَحْلِقَ رَأْسَهُ وَذَلِكَ أَنَّهُ إِذَا رَمَى جَمْرَةَ الْعَقَبَةِ فَقَدْ حَلَّ لَهُ قَتْلُ الْقَمْلِ وَحَلْقُ الشَّعْرِ وَإِلْقَاءُ التَّفَثِ وَلُبْسُ الثِّيَابِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nwould never wash his head while he was in ihram except if he had to do\nghusl because of a wet dream.\n\n\nMalik said, \"I have heard the\npeople of knowledge say that there is no harm in someone who is in\nihram rubbing his head with certain kinds of plants after he has\nstoned the Jamrat al-Aqaba but before he has shaved his head, because\nonce he has finished stoning the Jamrat al-Aqaba it is halal for him\nto kill lice, to shave his head, to clean himself of body hair, and to\nwear normal clothes.\""}},{"id":8,"idInBook":8,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَجُلاً، سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم مَا يَلْبَسُ الْمُحْرِمُ مِنَ الثِّيَابِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ تَلْبَسُوا الْقُمُصَ وَلاَ الْعَمَائِمَ وَلاَ السَّرَاوِيلاَتِ وَلاَ الْبَرَانِسَ وَلاَ الْخِفَافَ إِلاَّ أَحَدٌ لاَ يَجِدُ نَعْلَيْنِ فَلْيَلْبَسْ خُفَّيْنِ وَلْيَقْطَعْهُمَا أَسْفَلَ مِنَ الْكَعْبَيْنِ وَلاَ تَلْبَسُوا مِنَ الثِّيَابِ شَيْئًا مَسَّهُ الزَّعْفَرَانُ وَلاَ الْوَرْسُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat a man once asked the Messenger of Allah, may Allah bless him and\ngrant him peace, what clothes someone in ihram could wear, and the\nMessenger of Allah, may Allah bless him and grant him peace, said, \"Do\nnot wear shirts, turbans, trousers, burnouses, or leather socks,\nexcept if you cannot find sandals. In that case you can wear leather\nsocks, but cut them off below the ankles. Do not wear any clothes that\nhave been touched by saffron or yellow dye.\"\n\n\nYahya said that\nMalik was asked about the hadith attributed to the Prophet, may Allah\nbless him and grant him peace, \"Whoever cannot find a waist wrapper\nshould wear trousers,\" and he said, \"I have never heard this, and I do\nnot think that some one who is in ihram can wear trousers, because\namong the things which the Prophet, may Allah bless him and grant him\npeace, forbade some one in ihram to wear were trousers, and he did not\nmake any exception for them although he did make an exception for\nleather socks.\"\n\n\n20.4 Wearing Clothes when in Ihram"}},{"id":9,"idInBook":9,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يَلْبَسَ الْمُحْرِمُ ثَوْبًا مَصْبُوغًا بِزَعْفَرَانٍ أَوْ وَرْسٍ وَقَالَ ‏\n\"‏ مَنْ لَمْ يَجِدْ نَعْلَيْنِ فَلْيَلْبَسْ خُفَّيْنِ وَلْيَقْطَعْهُمَا أَسْفَلَ مِنَ الْكَعْبَيْنِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from 'Abdullah ibn Dinar that\nAbdullah ibn Umar said, \"The Messenger of Allah, may Allah bless him\nand grant him peace, forbade anyone in ihram to wear a garment which\nhad been dyed with saffron or yellow dye, and said, 'Anyone that\ncannot find sandals can wear leather socks, but he should cut them off\nbelow the ankles.' \""}},{"id":10,"idInBook":10,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّهُ سَمِعَ أَسْلَمَ، مَوْلَى عُمَرَ بْنِ الْخَطَّابِ يُحَدِّثُ عَبْدَ اللَّهِ بْنَ عُمَرَ أَنَّ عُمَرَ بْنَ الْخَطَّابِ، رَأَى عَلَى طَلْحَةَ بْنِ عُبَيْدِ اللَّهِ ثَوْبًا مَصْبُوغًا وَهُوَ مُحْرِمٌ فَقَالَ عُمَرُ مَا هَذَا الثَّوْبُ الْمَصْبُوغُ يَا طَلْحَةُ فَقَالَ طَلْحَةُ يَا أَمِيرَ الْمُؤْمِنِينَ إِنَّمَا هُوَ مَدَرٌ ‏.‏ فَقَالَ عُمَرُ إِنَّكُمْ أَيُّهَا الرَّهْطُ أَئِمَّةٌ يَقْتَدِي بِكُمُ النَّاسُ فَلَوْ أَنَّ رَجُلاً جَاهِلاً رَأَى هَذَا الثَّوْبَ لَقَالَ إِنَّ طَلْحَةَ بْنَ عُبَيْدِ اللَّهِ كَانَ يَلْبَسُ الثِّيَابَ الْمُصَبَّغَةَ فِي الإِحْرَامِ فَلاَ تَلْبَسُوا أَيُّهَا الرَّهْطُ شَيْئًا مِنْ هَذِهِ الثِّيَابِ الْمُصَبَّغَةِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that he had heard Aslam,\nthe mawla of Umar ibn al-Khattab, telling 'Abdullah ibn Umar that Umar\nibn al-Khattab once saw a dyed garment on Talha ibn Ubaydullah while\nhe was in ihram and Umar said, \"What is this dyed garment, Talha?\",\nand Talha said, \"Amir al-muminin, it is only mud.''  Umar said, \"You\nand your like are taken by people as imams, and if an ignorant man\nwere to see this garment he would say that Talha ibn Ubaydullah used\nto wear a dyed  robe while he was in ihram. So do not wear any form of\ndyed clothes.\""}},{"id":11,"idInBook":11,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ، أَنَّهَا كَانَتْ تَلْبَسُ الثِّيَابَ الْمُعَصْفَرَاتِ الْمُشَبَّعَاتِ وَهِيَ مُحْرِمَةٌ لَيْسَ فِيهَا زَعْفَرَانٌ ‏.‏ قَالَ يَحْيَى سُئِلَ مَالِكٌ عَنْ ثَوْبٍ مَسَّهُ طِيبٌ ثُمَّ ذَهَبَ مِنْهُ رِيحُ الطِّيبِ هَلْ يُحْرِمُ فِيهِ فَقَالَ نَعَمْ مَا لَمْ يَكُنْ فِيهِ صِبَاغٌ زَعْفَرَانٌ أَوْ وَرْسٌ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa from his\nfather that Asma bint Abi Bakr had worn clothes that were completely\ndyed with safflower while she was in ihram, though there was not any\nsaffron in them.\n\n\nYahya said that Malik was asked if a garment\nwhich had been perfumed could be used for ihram if the smell of the\nperfume had gone, and he said, \"Yes, as long as there is no saffron or\nyellow dye in it.\""}},{"id":12,"idInBook":12,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَكْرَهُ لُبْسَ الْمِنْطَقَةِ لِلْمُحْرِمِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that 'Abdullah ibn 'Umar\nused to disapprove of anybody wearing a belt or girdle while in ihram."}},{"id":13,"idInBook":13,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ سَمِعَ سَعِيدَ بْنَ الْمُسَيَّبِ، يَقُولُ فِي الْمِنْطَقَةِ يَلْبَسُهَا الْمُحْرِمُ تَحْتَ ثِيَابِهِ أَنَّهُ لاَ بَأْسَ بِذَلِكَ إِذَا جَعَلَ طَرَفَيْهَا جَمِيعًا سُيُورًا يَعْقِدُ بَعْضَهَا إِلَى بَعْضٍ ‏.‏ قَالَ مَالِكٌ وَهَذَا أَحَبُّ مَا سَمِعْتُ إِلَىَّ فِي ذَلِكَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Sa'id that he heard\nSaid ibn al Musayyab say, about the girdle worn by some one in ihram\nunder his clothes, \"There is no harm in it if he ties the ends\ntogether as a belt.\"\n\n\nMalik said, \"This is what I like most\nout of what I have heard about the matter.\""}},{"id":14,"idInBook":14,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، أَنَّهُ قَالَ أَخْبَرَنِي الْفُرَافِصَةُ بْنُ عُمَيْرٍ الْحَنَفِيُّ، أَنَّهُ رَأَى عُثْمَانَ بْنَ عَفَّانَ بِالْعَرْجِ يُغَطِّي وَجْهَهُ وَهُوَ مُحْرِمٌ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said that al-Qasim\nibn Muhammad said that al-Furafisa ibn Umayr al-Hanafi saw Uthman ibn\nAffan at al-Arj, and he was covering his face while in ihram."}},{"id":15,"idInBook":15,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقُولُ مَا فَوْقَ الذَّقَنِ مِنَ الرَّأْسِ فَلاَ يُخَمِّرْهُ الْمُحْرِمُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nused to say that a man in ihram should not veil anything above his\nchin ."}},{"id":16,"idInBook":16,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَفَّنَ ابْنَهُ وَاقِدَ بْنَ عَبْدِ اللَّهِ وَمَاتَ بِالْجُحْفَةِ مُحْرِمًا وَخَمَّرَ رَأْسَهُ وَوَجْهَهُ وَقَالَ لَوْلاَ أَنَّا حُرُمٌ لَطَيَّبْنَاهُ ‏.‏ قَالَ مَالِكٌ وَإِنَّمَا يَعْمَلُ الرَّجُلُ مَا دَامَ حَيًّا فَإِذَا مَاتَ فَقَدِ انْقَضَى الْعَمَلُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nshrouded his son Waqid ibn Abdullah, who had died at al-Juhfa while in\nihram, and he veiled his head and face and said, \"If we had not been\nin ihram we would have perfumed him. \"\n\n\nMalik said, \"A man can\nonly do things while he is alive. When he is dead, his actions stop.\""}},{"id":17,"idInBook":17,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقُولُ لاَ تَنْتَقِبُ الْمَرْأَةُ الْمُحْرِمَةُ وَلاَ تَلْبَسُ الْقُفَّازَيْنِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nused to say that a woman in ihram should wear neither a veil nor\ngloves."}},{"id":18,"idInBook":18,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ فَاطِمَةَ بِنْتِ الْمُنْذِرِ، أَنَّهَا قَالَتْ كُنَّا نُخَمِّرُ وُجُوهَنَا وَنَحْنُ مُحْرِمَاتٌ وَنَحْنُ مَعَ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ الصِّدِّيقِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa that Fatima\nbint al-Mundhir said, \"We used to veil our faces when we were in ihram\nin the company of Asma bint Abi Bakr as-Siddiq.\"\n\n\n20.7 Wearing\nPerfume during Hajj."}},{"id":19,"idInBook":19,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ كُنْتُ أُطَيِّبُ رَسُولَ اللَّهِ صلى الله عليه وسلم لإِحْرَامِهِ قَبْلَ أَنْ يُحْرِمَ وَلِحِلِّهِ قَبْلَ أَنْ يَطُوفَ بِالْبَيْتِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abd ar-Rahman ibn al-Qasim\nfrom his father that A'isha, the wife of the Prophet, may Allah bless\nhim and grant him peace, said, \"I perfumed the Messenger of Allah, may\nAllah bless him and grant him peace, for his ihram before he entered\nihram, and when he came out of ihram before he did tawaf of the\nHouse.\""}},{"id":20,"idInBook":20,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ حُمَيْدِ بْنِ قَيْسٍ، عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ، أَنَّ أَعْرَابِيًّا، جَاءَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَهُوَ بِحُنَيْنٍ وَعَلَى الأَعْرَابِيِّ قَمِيصٌ وَبِهِ أَثَرُ صُفْرَةٍ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي أَهْلَلْتُ بِعُمْرَةٍ فَكَيْفَ تَأْمُرُنِي أَنْ أَصْنَعَ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ انْزِعْ قَمِيصَكَ وَاغْسِلْ هَذِهِ الصُّفْرَةَ عَنْكَ وَافْعَلْ فِي عُمْرَتِكَ مَا تَفْعَلُ فِي حَجِّكَ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Humayd ibn Qays from Ata ibn\nRabah that a bedouin came to the Messenger of Allah, may Allah bless\nhim and grant him peace, when he was at Hunayn, and he was wearing a\nshirt with traces of yellow on it. He said, \"Messenger of Allah, I\nhave entered ihram for umra. What should I do?\"  The Messenger of\nAllah, may Allah bless him and grant him peace, said to him, \"Take off\nyour shirt and wash off this yellowness and do in umra as you would do\non hajj.\""}},{"id":21,"idInBook":21,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ أَسْلَمَ، مَوْلَى عُمَرَ بْنِ الْخَطَّابِ أَنَّ عُمَرَ بْنَ الْخَطَّابِ، وَجَدَ رِيحَ طِيبٍ وَهُوَ بِالشَّجَرَةِ فَقَالَ مِمَّنْ رِيحُ هَذَا الطِّيبِ فَقَالَ مُعَاوِيَةُ بْنُ أَبِي سُفْيَانَ مِنِّي يَا أَمِيرَ الْمُؤْمِنِينَ ‏.‏ فَقَالَ مِنْكَ لَعَمْرُ اللَّهِ فَقَالَ مُعَاوِيَةُ إِنَّ أُمَّ حَبِيبَةَ طَيَّبَتْنِي يَا أَمِيرَ الْمُؤْمِنِينَ ‏.‏ فَقَالَ عُمَرُ عَزَمْتُ عَلَيْكَ لَتَرْجِعَنَّ فَلْتَغْسِلَنَّهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi from Aslam, the mawla of\nUmar ibn al Khattab, that Umar ibn al-Khattab discovered the smell of\nperfume while he was at ash-Shajara, and he asked, \"Who is this smell\nof perfume coming from?\" Muawiya ibn Abi Sufyan answered, \"From me,\namir al-muminin.\" Umar said, \"From you? By the life of Allah!\" Muawiya\nexplained, \"Umm Habiba perfumed me, amir al-muminin. \"'Umar then said,\n\"You must go back and wash it off.\""}},{"id":22,"idInBook":22,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ الصَّلْتِ بْنِ زُيَيْدٍ، عَنْ غَيْرِ، وَاحِدٍ، مِنْ أَهْلِهِ أَنَّ عُمَرَ بْنَ الْخَطَّابِ، وَجَدَ رِيحَ طِيبٍ وَهُوَ بِالشَّجَرَةِ وَإِلَى جَنْبِهِ كَثِيرُ بْنُ الصَّلْتِ فَقَالَ عُمَرُ مِمَّنْ رِيحُ هَذَا الطِّيبِ فَقَالَ كَثِيرٌ مِنِّي يَا أَمِيرَ الْمُؤْمِنِينَ لَبَّدْتُ رَأْسِي وَأَرَدْتُ أَنْ لاَ أَحْلِقَ ‏.‏ فَقَالَ عُمَرُ فَاذْهَبْ إِلَى شَرَبَةٍ فَادْلُكْ رَأْسَكَ حَتَّى تُنَقِّيَهُ ‏.‏ فَفَعَلَ كَثِيرُ بْنُ الصَّلْتِ ‏.‏ قَالَ مَالِكٌ الشَّرَبَةُ حَفِيرٌ تَكُونُ عِنْدَ أَصْلِ النَّخْلَةِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from as-Salt ibn Zubayd from more\nthan one of his family that Umar ibn al-Khattab discovered the smell\nof perfume while he was at ash-Shajara. Kathir ibn as-Salt was at his\nside, and Umar asked, \"Who is this smell of perfume coming from?\", and\nKathir said, \"From me, amir al-muminin. I matted my hair with perfume\nand I intended not to shave it.'' Umar said, \"Go to a sharaba and rub\nyour head until it is clean,\" and Kathir did so.\n\n\nMalik\nexplained, \"A sharaba is the ditch at the base of a date-palm.\""}},{"id":23,"idInBook":23,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، وَعَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، وَرَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، أَنَّ الْوَلِيدَ بْنَ عَبْدِ الْمَلِكِ، سَأَلَ سَالِمَ بْنَ عَبْدِ اللَّهِ وَخَارِجَةَ بْنَ زَيْدِ بْنِ ثَابِتٍ بَعْدَ أَنْ رَمَى الْجَمْرَةَ، وَحَلَقَ، رَأْسَهُ وَقَبْلَ أَنْ يُفِيضَ عَنِ الطِّيبِ فَنَهَاهُ سَالِمٌ وَأَرْخَصَ لَهُ خَارِجَةُ بْنُ زَيْدِ بْنِ ثَابِتٍ ‏.‏ قَالَ مَالِكٌ لاَ بَأْسَ أَنْ يَدَّهِنَ الرَّجُلُ بِدُهْنٍ لَيْسَ فِيهِ طِيبٌ قَبْلَ أَنْ يُحْرِمَ وَقَبْلَ أَنْ يُفِيضَ مِنْ مِنًى بَعْدَ رَمْىِ الْجَمْرَةِ ‏.‏ قَالَ يَحْيَى سُئِلَ مَالِكٌ عَنْ طَعَامٍ فِيهِ زَعْفَرَانٌ هَلْ يَأْكُلُهُ الْمُحْرِمُ فَقَالَ أَمَّا مَا تَمَسُّهُ النَّارُ مِنْ ذَلِكَ فَلاَ بَأْسَ بِهِ أَنْ يَأْكُلَهُ الْمُحْرِمُ وَأَمَّا مَا لَمْ تَمَسَّهُ النَّارُ مِنْ ذَلِكَ فَلاَ يَأْكُلُهُ الْمُحْرِمُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said and 'Abdullah\nibn Abi Bakr and Rabia ibn Abi Abd ar-Rahman that al-Walid ibn Abd al-\nMalik asked Salim ibn Abdullah and Kharija ibn Zayd ibn Thabit if he\ncould use perfume after he had stoned the jamra and shaved his head,\nbut before he had left for the tawafal-ifada. Salim forbade him to do\nso, but Kharija ibn Zayd ibn Thabit said that he could.\n\n\nMalik\nsaid, \"There is no harm in a man oiling himself with an oil which does\nnot have any perfume in it, either before he enters ihram, or before\nhe leaves Mina for the tawaf al-ifada, if he has stoned the jamra.\"\n\n\nYahya said that Malik was asked whether someone in ihram\ncould eat food with saffron in it, and he said, \"There is no harm in\nsome one in ihram eating it if it has been cooked. If, however, it has\nnot been cooked he should not eat it.\""}},{"id":24,"idInBook":24,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ يُهِلُّ أَهْلُ الْمَدِينَةِ مِنْ ذِي الْحُلَيْفَةِ وَيُهِلُّ أَهْلُ الشَّامِ مِنَ الْجُحْفَةِ وَيُهِلُّ أَهْلُ نَجْدٍ مِنْ قَرْنٍ ‏\"‏ ‏.‏ قَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ وَبَلَغَنِي أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ وَيُهِلُّ أَهْلُ الْيَمَنِ مِنْ يَلَمْلَمَ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat the Messenger of Allah, may Allah bless him and grant him peace,\nsaid, \"The people of Madina should enter ihram at Dhu'l-Hulayfa, the\npeople of Syria should do so at al-Juhfa, and the people of Najd\nshould do so at Qarn.\"\n\n\nAbdullah ibn Umar added, \"I have heard\nthat the Messenger of Allah, may Allah bless him and grant him peace,\nsaid, 'The people of Yemen should enter ihram at Yalamlam.' \""}},{"id":25,"idInBook":25,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ قَالَ أَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَهْلَ الْمَدِينَةِ أَنْ يُهِلُّوا مِنْ ذِي الْحُلَيْفَةِ وَأَهْلَ الشَّامِ مِنَ الْجُحْفَةِ وَأَهْلَ نَجْدٍ مِنْ قَرْنٍ ‏.‏ قَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ أَمَّا هَؤُلاَءِ الثَّلاَثُ فَسَمِعْتُهُنَّ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأُخْبِرْتُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ وَيُهِلُّ أَهْلُ الْيَمَنِ مِنْ يَلَمْلَمَ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abdullah ibn Dinar that\nAbdullah ibn Umar said, \"The Messenger of Allah, may Allah bless him\nand grant him peace, told the people of Madina to enter ihram at\nDhu'l-Hulayfa, the people of Syria to do so at al-Juhfa, and the\npeople of Najd to do so at Qarn.'\n\n\nAbdullah ibn Umar said, \"I heard these three from the Messenger\nof Allah, may Allah bless him and grant him peace. I was also told\nthat the Messenger of Allah, may Allah bless him and grant him peace,\nsaid, 'The people of Yemen should enter ihram at Yalamlam.' \""}},{"id":26,"idInBook":26,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، أَهَلَّ مِنَ الْفُرْعِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nonce entered ihram at al-Fur."}},{"id":27,"idInBook":27,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ الثِّقَةِ، عِنْدَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، أَهَلَّ مِنْ إِيلْيَاءَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from a reliable source that\nAbdullah ibn Umar once entered ihram at Ilya (Jerusalem)."}},{"id":28,"idInBook":28,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَهَلَّ مِنَ الْجِعِرَّانَةِ بِعُمْرَةٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that the\nMessenger of Allah, may Allah bless him and grant him peace, once\nentered ihram at al-Jiirrana (near Makka) for an umra."}},{"id":29,"idInBook":29,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ تَلْبِيَةَ، رَسُولِ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ لَبَّيْكَ لاَ شَرِيكَ لَكَ لَبَّيْكَ إِنَّ الْحَمْدَ وَالنِّعْمَةَ لَكَ وَالْمُلْكَ لاَ شَرِيكَ لَكَ ‏\"‏ ‏.‏ قَالَ وَكَانَ عَبْدُ اللَّهِ بْنُ عُمَرَ يَزِيدُ فِيهَا لَبَّيْكَ لَبَّيْكَ لَبَّيْكَ وَسَعْدَيْكَ وَالْخَيْرُ بِيَدَيْكَ لَبَّيْكَ وَالرَّغْبَاءُ إِلَيْكَ وَالْعَمَلُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abdullah ibn Umar that the\ntalbiya of the Messenger of Allah, may Allah bless him and grant him\npeace, was, \"I am at Your service, O Allah, I am at Your service. You\nhave no partner. I am at Your service. Praise and blessing belong to\nYou, and the Kingdom. You have no partner.\"\n\n\nLabayk, Allahumma\nlabayk, la sharika laka labayk. Inna'l-hamda wa'n-nimata laka\nwa'l-mulk, la sharika lak.\n\n\nMalik said that Abdullah ibn Umar\nused to add, \"I am at Your service, I am at Your service. I am at Your\nservice and at Your call. Good is in Your hands, and I am at Your\nservice. Our desire is for You, and our action .\"\n\n\nLabayk,\nlabayk, labayk wa sadayka wa'l-khayr biyadayka labayk wa'r-raghba'u\nilayka wa'l-amalu."}},{"id":30,"idInBook":30,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُصَلِّي فِي مَسْجِدِ ذِي الْحُلَيْفَةِ رَكْعَتَيْنِ فَإِذَا اسْتَوَتْ بِهِ رَاحِلَتُهُ أَهَلَّ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa from his\nfather that the Messenger of Allah, may Allah bless him and grant him\npeace, used to pray two rakas in the mosque at Dhu'l-Hulayfa, and\nthen, when he had got on to his camel and it had stood up, he would\nbegin doing talbiya."}},{"id":31,"idInBook":31,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، أَنَّهُ سَمِعَ أَبَاهُ، يَقُولُ بَيْدَاؤُكُمْ هَذِهِ الَّتِي تَكْذِبُونَ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فِيهَا مَا أَهَلَّ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلاَّ مِنْ عِنْدِ الْمَسْجِدِ يَعْنِي مَسْجِدَ ذِي الْحُلَيْفَةِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Musa ibn Uqba that Salim ibn\nAbdullah heard his father say, \"Your claim that the Messenger of\nAllah, may Allah bless him and grant him peace, entered ihram from\nthis desert of yours is not true, because he only entered ihram from\nthe mosque, i.e. the mosque of Dhu'l-Hulayfa.\""}},{"id":32,"idInBook":32,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ عُبَيْدِ بْنِ جُرَيْجٍ، أَنَّهُ قَالَ لِعَبْدِ اللَّهِ بْنِ عُمَرَ يَا أَبَا عَبْدِ الرَّحْمَنِ رَأَيْتُكَ تَصْنَعُ أَرْبَعًا لَمْ أَرَ أَحَدًا مِنْ أَصْحَابِكَ يَصْنَعُهَا ‏.‏ قَالَ وَمَا هُنَّ يَا ابْنَ جُرَيْجٍ قَالَ رَأَيْتُكَ لاَ تَمَسُّ مِنَ الأَرْكَانِ إِلاَّ الْيَمَانِيَيْنِ وَرَأَيْتُكَ تَلْبَسُ النِّعَالَ السِّبْتِيَّةَ وَرَأَيْتُكَ تَصْبُغُ بِالصُّفْرَةِ وَرَأَيْتُكَ إِذَا كُنْتَ بِمَكَّةَ أَهَلَّ النَّاسُ إِذَا رَأَوُا الْهِلاَلَ وَلَمْ تُهْلِلْ أَنْتَ حَتَّى يَكُونَ يَوْمُ التَّرْوِيَةِ ‏.‏ فَقَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ أَمَّا الأَرْكَانُ فَإِنِّي لَمْ أَرَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَمَسُّ إِلاَّ الْيَمَانِيَّيْنِ وَأَمَّا النِّعَالُ السِّبْتِيَّةُ فَإِنِّي رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَلْبَسُ النِّعَالَ الَّتِي لَيْسَ فِيهَا شَعَرٌ وَيَتَوَضَّأُ فِيهَا فَأَنَا أُحِبُّ أَنْ أَلْبَسَهَا وَأَمَّا الصُّفْرَةُ فَإِنِّي رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَصْبُغُ بِهَا فَأَنَا أُحِبُّ أَنْ أَصْبُغَ بِهَا وَأَمَّا الإِهْلاَلُ فَإِنِّي لَمْ أَرَ رَسُولَ اللَّهِ صلى الله عليه وسلم يُهِلُّ حَتَّى تَنْبَعِثَ بِهِ رَاحِلَتُهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Said ibn Abi Said al-Maqburi\nthat Ubayd ibn Jurayj once said to Abdullah ibn Umar, \"Abu Abd ar-\nRahman, I have seen you doing four things which I have never seen any\nof your companions doing.\" He said, \"What are they, Ibn Jurayj?\" and\nhe replied, \"I have seen you touching only the twoYamani corners, I\nhave seen you wearing hairless sandals, I have seen you using yellow\ndye, and, when you were at Makka and everybody had started doing\ntalbiya after seeing the new moon, I saw that you did not do so until\nthe eighth of Dhu'l-Hijja.\"\n\n\nAbdullah ibn Umar replied, \"As\nfor the corners, I only ever saw the Messenger of Allah, may Allah\nbless him and grant him peace, touching the two Yamani corners. As for\nthe sandals, I saw the Messenger of Allah, may Allah bless him and\ngrant him peace, wearing hairless sandals and doing wudu in them, and\nI like wearing them. As for using yellow dye, I saw the Messenger of\nAllah, may Allah bless him and grant him peace, using it, and I also\nlike to use it for dyeing things with. As for doing talbiya, I never\nsaw the Messenger of Allah, may Allah bless him and grant him peace,\nbegin doing so until he had set out on the animal he was riding on\n(i.e. for Mina and Arafa).\""}},{"id":33,"idInBook":33,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يُصَلِّي فِي مَسْجِدِ ذِي الْحُلَيْفَةِ","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nused to pray in the mosque of Dhu'l-Hulayfa, and then go outside and\nget on his camel and when his camel had stood up he would begin to do\ntalbiya."}},{"id":34,"idInBook":34,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَبْدَ الْمَلِكِ بْنَ مَرْوَانَ، أَهَلَّ مِنْ عِنْدِ مَسْجِدِ ذِي الْحُلَيْفَةِ حِينَ اسْتَوَتْ بِهِ رَاحِلَتُهُ وَأَنَّ أَبَانَ بْنَ عُثْمَانَ أَشَارَ عَلَيْهِ بِذَلِكَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Abd al-\nMalik ibn Marwan had started to do talbiya at the mosque of\nDhu'l-Hulayfa, after the animal he was riding on had stood up, and\nthat Aban ibn Uthman had told him to do this."}},{"id":35,"idInBook":35,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي بَكْرِ بْنِ الْحَارِثِ بْنِ هِشَامٍ، عَنْ خَلاَّدِ بْنِ السَّائِبِ الأَنْصَارِيِّ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَتَانِي جِبْرِيلُ فَأَمَرَنِي أَنْ آمُرَ أَصْحَابِي أَوْ مَنْ مَعِي أَنْ يَرْفَعُوا أَصْوَاتَهُمْ بِالتَّلْبِيَةِ أَوْ بِالإِهْلاَلِ ‏\"‏ ‏.‏ يُرِيدُ أَحَدَهُمَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from 'Abdullah ibn Abi Bakr ibn\nMuhammad ibn Amr ibn Hazm from Abd al-Malik ibn Abi Bakr ibn al-Harith\nibn Hisham from Khallad ibn as-Sa'ib al-Ansari from his father that\nthe Messenger of Allah, may Allah bless him and grant him peace, said,\n\"Jibril came to me and told me to tell my companions, or whoever was\nwith me, to raise their voices when doing talbiya.\""}},{"id":36,"idInBook":36,"chapterId":20,"bookId":7,"arabic":"","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard the people of\nknowledge say, \"Women do not have to raise their voices when they are\ndoing talbiya, and a woman should only speak loudly enough to hear\nherself.\"\n\n\nMalik said, \"Some one who is in ihram should not\nraise his voice when doing talbiya if he is in a mosque where there\nare groups of people. He should only speak loudly enough for himself\nand those who are near him to be able to hear, except in the Masjid\nalHaram and the mosque at Mina, where he should raise his voice.\"\n\n\nMalik said, \"I have heard some of the people of knowledge\nrecommending (people to do) talbiya at the end of every prayer and at\nevery rise on the route.\""}},{"id":37,"idInBook":37,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي الأَسْوَدِ، مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم عَامَ حَجَّةِ الْوَدَاعِ فَمِنَّا مَنْ أَهَلَّ بِعُمْرَةٍ وَمِنَّا مَنْ أَهَلَّ بِحَجَّةٍ وَعُمْرَةٍ وَمِنَّا مَنْ أَهَلَّ بِالْحَجِّ وَأَهَلَّ رَسُولُ اللَّهِ صلى الله عليه وسلم بِالْحَجِّ فَأَمَّا مَنْ أَهَلَّ بِعُمْرَةٍ فَحَلَّ وَأَمَّا مَنْ أَهَلَّ بِحَجٍّ أَوْ جَمَعَ الْحَجَّ وَالْعُمْرَةَ فَلَمْ يُحِلُّوا حَتَّى كَانَ يَوْمُ النَّحْرِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik, from Abu'l-Aswad Muhammad ibn Abd\nar-Rahman, fromUrwa ibn az-Zubayr, that A'isha, the wife of the\nProphet, may Allah bless him and grant him peace, said, \"We set out\nwith the Messenger of Allah, may Allah bless him and grant him peace,\nin the year of the farewell hajj, and some of us went into ihram to do\numra, some of us went into ihram to do hajj and umra, and some of us\nwent into ihram to do hajj on its own. The Messenger of Allah, may\nAllah bless him and grant him peace, went into ihram to do hajj on its\nown. Those who had gone into ihram to do umra came out of ihram (after\ndoing umra). Those who had gone into ihram to do hajj (on its own), or\nto do both hajj and umra, did not come out of ihram until the day of\nthe sacrifice.\""}},{"id":38,"idInBook":38,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَفْرَدَ الْحَجَّ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik, from Abd ar-Rahman ibn al-Qasim,\nfrom his father, from A'isha, umm al-muminin, that the Messenger of\nAllah, may Allah bless him and grant him peace, did hajj on its own."}},{"id":39,"idInBook":39,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الأَسْوَدِ، مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ قَالَ وَكَانَ يَتِيمًا فِي حَجْرِ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَفْرَدَ الْحَجَّ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik, from Abu'l-Aswad Muhammad ibn\n'Abd ar-Rahman, from Urwa ibn az-Zubayr, from A'isha, umm al-muminin,\nthat the Messenger of Allah, may Allah bless him and grant him peace,\ndid hajj on its own."}},{"id":40,"idInBook":40,"chapterId":20,"bookId":7,"arabic":"","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard the people of\nknowledge say, \"If someone goes into ihram to do hajj on its own, he\ncannot then go into ihram to do umra.''\n\n\nMalik said, \"This is\nwhat I have found the people of knowledge in our city doing.\""}},{"id":41,"idInBook":41,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ، عَنْ أَبِيهِ، أَنَّ الْمِقْدَادَ بْنَ الأَسْوَدِ، دَخَلَ عَلَى عَلِيِّ بْنِ أَبِي طَالِبٍ بِالسُّقْيَا وَهُوَ يَنْجَعُ بَكَرَاتٍ لَهُ دَقِيقًا وَخَبَطًا فَقَالَ هَذَا عُثْمَانُ بْنُ عَفَّانَ يَنْهَى عَنْ أَنْ يُقْرَنَ بَيْنَ الْحَجِّ وَالْعُمْرَةِ ‏.‏ فَخَرَجَ عَلِيُّ بْنُ أَبِي طَالِبٍ وَعَلَى يَدَيْهِ أَثَرُ الدَّقِيقِ وَالْخَبَطِ - فَمَا أَنْسَى أَثَرَ الدَّقِيقِ وَالْخَبَطِ عَلَى ذِرَاعَيْهِ - حَتَّى دَخَلَ عَلَى عُثْمَانَ بْنِ عَفَّانَ فَقَالَ أَنْتَ تَنْهَى عَنْ أَنْ يُقْرَنَ بَيْنَ الْحَجِّ وَالْعُمْرَةِ فَقَالَ عُثْمَانُ ذَلِكَ رَأْيِي ‏.‏ فَخَرَجَ عَلِيٌّ مُغْضَبًا وَهُوَ يَقُولُ لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ بِحَجَّةٍ وَعُمْرَةٍ مَعًا ‏.‏ قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا أَنَّ مَنْ قَرَنَ الْحَجَّ وَالْعُمْرَةَ لَمْ يَأْخُذْ مِنْ شَعَرِهِ شَيْئًا وَلَمْ يَحْلِلْ مِنْ شَىْءٍ حَتَّى يَنْحَرَ هَدْيًا إِنْ كَانَ مَعَهُ وَيَحِلُّ بِمِنًى يَوْمَ النَّحْرِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik, from Jafar ibn Muhammad, from his\nfather, that al-Miqdad ibn al-Aswad once went to see AIi ibn Abi\nTalibat as-Suqya, where he was feeding some young camels of his with a\nmash of meal and leaves, and he said to him, \"This man Uthman ibn\nAffan is telling people that they cannot do hajj and umra together.\"\n\n\nAl-Miqdad said, \"Ali ibn Abi Talib went off with bits of meal\nand leaves on his forearms - and I shall never forget the sight of the\nmeal and the leaves on his arms - and went to see Uthman ibn Affan and\nasked him, 'Are you saying then that people cannot do hajj and umra\ntogether?' Uthman replied, 'That is my opinion.' Whereupon AIi got\nangry and went out saying, 'I am at your service, O Allah, I am at\nyour service for a hajj and an umra together.' \"\n\n\nMalik said,\n\"Our position (here in Madina) is that someone who does hajj and umra\ntogether should not remove any of his hair, nor should he come out of\nihram in any way until he has sacrificed an animal, if he has one. He\nshould come out of ihram at Mina, on the day of the sacrifice.\""}},{"id":42,"idInBook":42,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم عَامَ حَجَّةِ الْوَدَاعِ خَرَجَ إِلَى الْحَجِّ فَمِنْ أَصْحَابِهِ مَنْ أَهَلَّ بِحَجٍّ وَمِنْهُمْ مَنْ جَمَعَ الْحَجَّ وَالْعُمْرَةَ وَمِنْهُمْ مَنْ أَهَلَّ بِعُمْرَةٍ فَأَمَّا مَنْ أَهَلَّ بِحَجٍّ أَوْ جَمَعَ الْحَجَّ وَالْعُمْرَةَ فَلَمْ يَحْلِلْ وَأَمَّا مَنْ كَانَ أَهَلَّ بِعُمْرَةٍ فَحَلُّوا ‏.‏ وَحَدَّثَنِي عَنْ مَالِكٍ أَنَّهُ سَمِعَ بَعْضَ أَهْلِ الْعِلْمِ يَقُولُونَ مَنْ أَهَلَّ بِعُمْرَةٍ ثُمَّ بَدَا لَهُ أَنْ يُهِلَّ بِحَجٍّ مَعَهَا فَذَلِكَ لَهُ مَا لَمْ يَطُفْ بِالْبَيْتِ وَبَيْنَ الصَّفَا وَالْمَرْوَةِ وَقَدْ صَنَعَ ذَلِكَ ابْنُ عُمَرَ حِينَ قَالَ إِنْ صُدِدْتُ عَنِ الْبَيْتِ صَنَعْنَا كَمَا صَنَعْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم ثُمَّ الْتَفَتَ إِلَى أَصْحَابِهِ فَقَالَ مَا أَمْرُهُمَا إِلاَّ وَاحِدٌ أُشْهِدُكُمْ أَنِّي أَوْجَبْتُ الْحَجَّ مَعَ الْعُمْرَةِ ‏.‏ قَالَ مَالِكٌ وَقَدْ أَهَلَّ أَصْحَابُ رَسُولِ اللَّهِ صلى الله عليه وسلم عَامَ حَجَّةِ الْوَدَاعِ بِالْعُمْرَةِ ثُمَّ قَالَ لَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ كَانَ مَعَهُ هَدْىٌ فَلْيُهْلِلْ بِالْحَجِّ مَعَ الْعُمْرَةِ ثُمَّ لاَ يَحِلُّ حَتَّى يَحِلَّ مِنْهُمَا جَمِيعًا ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik, from Muhammad ibn Abd ar-Rahman,\nfrom Sulayman ibn Yasar, that when the Messenger of Allah, may Allah\nbless him and grant him peace, set out for hajj in the year of the\nfarewell hajj, some of his companions went into ihram to do hajj on\nits own, some of them combined hajj and umra, and some went into ihram\nto do umra on its own. Those who had gone into ihram to do hajj, or\nhajj and umra together, did not come out of ihram, whils tthose who\nhad gone into ihram to doumra (on its own) came out of ihram."}},{"id":43,"idInBook":43,"chapterId":20,"bookId":7,"arabic":"","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard some of the\npeople of knowledge say, \"If someone goes into ihram to do umra and\nthen wants to go into ihram to do hajj as well, he can do so, as long\nas he has not done tawaf of the House and s'ay between Safa and Marwa.\nThis is what Abdullah ibn 'Umar did when he said, 'If I am blocked\nfrom the House we shall do what we did when we were with the Messenger\nof Allah, may Allah bless him and grant him peace.' He then turned to\nhis companions and said, 'It is the same either way. I call you to\nwitness that I have decided in favour of hajj and umra together. ' \"\n\n\nMalik said, \"The companions of the Messenger of Allah, may\nAllah bless him and grant him peace, went into ihram to do umra in the\nyear of the farewell hajj, and the Messenger of Allah, may Allah bless\nhim and grant him peace, said to them, 'Anyone that has a sacrificial\nanimal with him should go into ihram to do hajj and umra together, and\nhe should not come out of ihram until he has finished both.' \""}},{"id":44,"idInBook":44,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ أَبِي بَكْرٍ الثَّقَفِيِّ، أَنَّهُ سَأَلَ أَنَسَ بْنَ مَالِكٍ - وَهُمَا غَادِيَانِ مِنْ مِنًى إِلَى عَرَفَةَ - كَيْفَ كُنْتُمْ تَصْنَعُونَ فِي هَذَا الْيَوْمِ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ كَانَ يُهِلُّ الْمُهِلُّ مِنَّا فَلاَ يُنْكَرُ عَلَيْهِ وَيُكَبِّرُ الْمُكَبِّرُ فَلاَ يُنْكَرُ عَلَيْهِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Muhammad ibn Abi Bakr ath-\nThaqafi once asked Anas ibn Malik, while the two of them were going\nfrom Mina to Arafa, \"What did you use to do on this day when you were\nwith the Messenger of Allah, may Allah bless him and grant him peace?\"\nHe said, \"Those of us who were saying the talbiya would continue doing\nso, and no-one disapproved of it, and those of us who were saying\n'Allahu akbar' would continue doing so, and no-one disapproved of that\neither.\""}},{"id":45,"idInBook":45,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ، عَنْ أَبِيهِ، أَنَّ عَلِيَّ بْنَ أَبِي طَالِبٍ، كَانَ يُلَبِّي فِي الْحَجِّ حَتَّى إِذَا زَاغَتِ الشَّمْسُ مِنْ يَوْمِ عَرَفَةَ قَطَعَ التَّلْبِيَةَ ‏.‏ قَالَ يَحْيَى قَالَ مَالِكٌ وَذَلِكَ الأَمْرُ الَّذِي لَمْ يَزَلْ عَلَيْهِ أَهْلُ الْعِلْمِ بِبَلَدِنَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik, from Jafar ibn Muhammad, from his\nfather, that AIi ibn Abi Talib used to say the talbiya while on hajj\nuntil after noon on the day of Arafa, when he would stop doing so.\n\n\nYahya said that Malik said, \"This is what the people of\nknowledge in our city are still doing.\""}},{"id":46,"idInBook":46,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا كَانَتْ تَتْرُكُ التَّلْبِيَةَ إِذَا رَجَعَتْ إِلَى الْمَوْقِفِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik, from Abd ar-Rahman ibn al-Qasim,\nfrom his father, that A'isha, the wife of the Prophet, may Allah bless\nhim and grant him peace, would stop saying the talbiya when she\narrived at the place of standing (i.e. Arafa) ."}},{"id":47,"idInBook":47,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقْطَعُ التَّلْبِيَةَ فِي الْحَجِّ إِذَا انْتَهَى إِلَى الْحَرَمِ حَتَّى يَطُوفَ بِالْبَيْتِ وَبَيْنَ الصَّفَا وَالْمَرْوَةِ ثُمَّ يُلَبِّي حَتَّى يَغْدُوَ مِنْ مِنًى إِلَى عَرَفَةَ فَإِذَا غَدَا تَرَكَ التَّلْبِيَةَ وَكَانَ يَتْرُكُ التَّلْبِيَةَ فِي الْعُمْرَةِ إِذَا دَخَلَ الْحَرَمَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik, from Nafi, that when 'Abdullah\nibn Umar was doing hajj he would keep saying the talbiya until he\nreached the Haram and did tawaf of the House and say between Safa and\nMarwa. He would then say the talbiya until he left Mina to go to\nArafa, at which point he would stop doing so. If he was doing umra he\nwould stop saying the talbiya on entering the Haram."}},{"id":48,"idInBook":48,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، أَنَّهُ كَانَ يَقُولُ كَانَ عَبْدُ اللَّهِ بْنُ عُمَرَ لاَ يُلَبِّي وَهُوَ يَطُوفُ بِالْبَيْتِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Ibn Shihab used to say,\n\"Abdullah ibn Umar would never say the talbiya while he was doing\ntawaf of the House.\""}},{"id":49,"idInBook":49,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَلْقَمَةَ بْنِ أَبِي عَلْقَمَةَ، عَنْ أُمِّهِ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ، أَنَّهَا كَانَتْ تَنْزِلُ مِنْ عَرَفَةَ بِنَمِرَةَ ثُمَّ تَحَوَّلَتْ إِلَى الأَرَاكِ ‏.‏ قَالَتْ وَكَانَتْ عَائِشَةُ تُهِلُّ مَا كَانَتْ فِي مَنْزِلِهَا وَمَنْ كَانَ مَعَهَا فَإِذَا رَكِبَتْ فَتَوَجَّهَتْ إِلَى الْمَوْقِفِ تَرَكَتِ الإِهْلاَلَ ‏.‏ قَالَتْ وَكَانَتْ عَائِشَةُ تَعْتَمِرُ بَعْدَ الْحَجِّ مِنْ مَكَّةَ فِي ذِي الْحِجَّةِ ثُمَّ تَرَكَتْ ذَلِكَ فَكَانَتْ تَخْرُجُ قَبْلَ هِلاَلِ الْمُحَرَّمِ حَتَّى تَأْتِيَ الْجُحْفَةَ فَتُقِيمَ بِهَا حَتَّى تَرَى الْهِلاَلَ فَإِذَا رَأَتِ الْهِلاَلَ أَهَلَّتْ بِعُمْرَةٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik, from AIqama ibn Abi AIqama, from\nhis mother, that A'isha, umm al-muminin, used to camp on the plain of\nArafa at a place called Namira, and then later she changed to another\nplace called al-Arak.\n\n\nShe said, ''A'isha, and those who were\nwith her, would say the talbiya while she was at the place where they\nwere camping, and then, when she had mounted and set out towards the\nplace of standing, she would stop doing so.\"\n\n\nShe continued,\n''A'isha used to do umra when she was in Makka after the hajj was\nover, in the month of Dhu'l-Hijja.Then she stopped doing that, and\ninstead would set out before the new moon of Muharram for al-J uhfa,\nwhere she would stay until she saw the new moon, and then, when she\nhad seen the new moon, she would go into ihram to do umra.\""}},{"id":50,"idInBook":50,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ، غَدَا يَوْمَ عَرَفَةَ مِنْ مِنًى فَسَمِعَ التَّكْبِيرَ عَالِيًا فَبَعَثَ الْحَرَسَ يَصِيحُونَ فِي النَّاسِ أَيُّهَا النَّاسُ إِنَّهَا التَّلْبِيَةُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik, from Yahya ibn Said, that Umar\nibn Abd alAziz was once going from Mina (to Arafa) on the day of Arafa\nand heard the takbir being said loudly, so he sent the guard to shout\nout to the people, \"O people, you should be saying the talbiya.\""}},{"id":51,"idInBook":51,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ يَا أَهْلَ مَكَّةَ مَا شَأْنُ النَّاسِ يَأْتُونَ شُعْثًا وَأَنْتُمْ مُدَّهِنُونَ أَهِلُّوا إِذَا رَأَيْتُمُ الْهِلاَلَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik, from Abd ar-Rahman ibn al-Qasim,\nfrom his father, that Umar ibn al-Khattab said, \"People of Makka, why\nis it that people arrive dishevelled while you still have oil on your\nhair? Go into ihram when you see the new moon.\""}},{"id":52,"idInBook":52,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، أَنَّ عَبْدَ اللَّهِ بْنَ الزُّبَيْرِ، أَقَامَ بِمَكَّةَ تِسْعَ سِنِينَ يُهِلُّ بِالْحَجِّ لِهِلاَلِ ذِي الْحِجَّةِ وَعُرْوَةُ بْنُ الزُّبَيْرِ مَعَهُ يَفْعَلُ ذَلِكَ ‏.‏ قَالَ يَحْيَى قَالَ مَالِكٌ وَإِنَّمَا يُهِلُّ أَهْلُ مَكَّةَ وَغَيْرُهُمْ بِالْحَجِّ إِذَا كَانُوا بِهَا وَمَنْ كَانَ مُقِيمًا بِمَكَّةَ مِنْ غَيْرِ أَهْلِهَا مِنْ جَوْفِ مَكَّةَ لاَ يَخْرُجُ مِنَ الْحَرَمِ ‏.‏ قَالَ يَحْيَى قَالَ مَالِكٌ وَمَنْ أَهَلَّ مِنْ مَكَّةَ بِالْحَجِّ فَلْيُؤَخِّرِ الطَّوَافَ بِالْبَيْتِ وَالسَّعْىَ بَيْنَ الصَّفَا وَالْمَرْوَةِ حَتَّى يَرْجِعَ مِنْ مِنًى وَكَذَلِكَ صَنَعَ عَبْدُ اللَّهِ بْنُ عُمَرَ ‏.‏ وَسُئِلَ مَالِكٌ عَمَّنْ أَهَلَّ بِالْحَجِّ مِنْ أَهْلِ الْمَدِينَةِ أَوْ غَيْرِهِمْ مِنْ مَكَّةَ لِهِلاَلِ ذِي الْحِجَّةِ كَيْفَ يَصْنَعُ بِالطَّوَافِ قَالَ أَمَّا الطَّوَافُ الْوَاجِبُ فَلْيُؤَخِّرْهُ وَهُوَ الَّذِي يَصِلُ بَيْنَهُ وَبَيْنَ السَّعْىِ بَيْنَ الصَّفَا وَالْمَرْوَةِ وَلْيَطُفْ مَا بَدَا لَهُ وَلْيُصَلِّ رَكْعَتَيْنِ كُلَّمَا طَافَ سُبْعًا وَقَدْ فَعَلَ ذَلِكَ أَصْحَابُ رَسُولِ اللَّهِ صلى الله عليه وسلم الَّذِينَ أَهَلُّوا بِالْحَجِّ فَأَخَّرُوا الطَّوَافَ بِالْبَيْتِ وَالسَّعْىَ بَيْنَ الصَّفَا وَالْمَرْوَةِ حَتَّى رَجَعُوا مِنْ مِنًى وَفَعَلَ ذَلِكَ عَبْدُ اللَّهِ بْنُ عُمَرَ فَكَانَ يُهِلُّ لِهِلاَلِ ذِي الْحِجَّةِ بِالْحَجِّ مِنْ مَكَّةَ وَيُؤَخِّرُ الطَّوَافَ بِالْبَيْتِ وَالسَّعْىَ بَيْنَ الصَّفَا وَالْمَرْوَةِ حَتَّى يَرْجِعَ مِنْ مِنًى ‏.‏ وَسُئِلَ مَالِكٌ عَنْ رَجُلٍ مِنْ أَهْلِ مَكَّةَ هَلْ يُهِلُّ مِنْ جَوْفِ مَكَّةَ بِعُمْرَةٍ قَالَ بَلْ يَخْرُجُ إِلَى الْحِلِّ فَيُحْرِمُ مِنْهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik, from Hisham ibn Urwa, that\nAbdullah ibn az-Zubayr stayed in Makka for nine years. He would go\ninto ihram for hajj at the beginning of Dhu'l-Hijja, and Urwa ibn az-\nZubayr, who was with him, would do likewise.\n\n\nYahya said that\nMalik said, \"The people of Makka and whoever else is living there\nbesides them should go into ihram for hajj if they are in Makka, and\nanyone that is living in the centre of Makka and is not one of the\npeople of Makka should not leave the Haram.\"\n\n\nYahya said that\nMalik said, \"Someone who goes into ihram for hajj in Makka should\ndelay tawaf of the House and the sa'y between Safa and Marwa until he\nhas come back from Mina, which is what Abdullah ibn Umar used to do.\"\n\n\nMalik was asked what the people of Madina, or anybody else,\nshould do about tawaf if they went into ihram in Makka at the\nbeginning of Dhu'l-Hijja, and he said, \"They should delay the\nobligatory tawaf, which is the one they combine with the say between\nSafa and Marwa, but they can do whatever other tawaf they want to, and\nthey should pray two rakas every time they complete seven tawafs,\nwhich is what the companions of the Messenger of Allah, may Allah\nbless him and grant him peace, did when they had gone into ihram to do\nhajj. They delayed the tawaf of the House and the sa'y between Safa\nand Marwa until they had come back from Mina. Abdullah ibn Umar also\ndid this, going into ihram for hajj in Makka at the beginning of\nDhu'l-Hijja, and then delaying tawaf of theHouse and the say between\nSafa and Marwa until he had come back from Mina.\"\n\n\nMalik was\nasked whether one of the people of Makka could go into ihram to do\numra in the centre of Makka, and he said, \"No. He should go outside\nthe Haram and go into ihram there.\""}},{"id":53,"idInBook":53,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ مُحَمَّدٍ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، أَنَّهَا أَخْبَرَتْهُ أَنَّ زِيَادَ بْنَ أَبِي سُفْيَانَ كَتَبَ إِلَى عَائِشَةَ زَوْجِ النِّبِيِّ صلى الله عليه وسلم أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ قَالَ مَنْ أَهْدَى هَدْيًا حَرُمَ عَلَيْهِ مَا يَحْرُمُ عَلَى الْحَاجِّ حَتَّى  يُنْحَرَ الْهَدْىُ وَقَدْ بَعَثْتُ بِهَدْىٍ فَاكْتُبِي إِلَىَّ بِأَمْرِكِ أَوْ مُرِي صَاحِبَ الْهَدْىِ ‏.‏ قَالَتْ عَمْرَةُ قَالَتْ عَائِشَةُ لَيْسَ كَمَا قَالَ ابْنُ عَبَّاسٍ أَنَا فَتَلْتُ قَلاَئِدَ هَدْىِ رَسُولِ اللَّهِ صلى الله عليه وسلم بِيَدَىَّ ثُمَّ قَلَّدَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم بِيَدِهِ ثُمَّ بَعَثَ بِهَا رَسُولُ اللَّهِ صلى الله عليه وسلم مَعَ أَبِي فَلَمْ يَحْرُمْ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم شَىْءٌ أَحَلَّهُ اللَّهُ لَهُ حَتَّى نُحِرَ الْهَدْىُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik, from 'Abdullah ibn Abi Bakr ibn\nMuhammad, that Amra bint 'Abd ar-Rahman told him that Ziyad ibn Abi\nSufyan once wrote to A'isha, the wife of the Prophet, may Allah bless\nhim and grant him peace, saying, \"'Abdullah ibn Abbas said that\nwhatever was haram for some one doing hajj was also haram for some one\nwho sent a sacrificial animal until the animal was sacrificed. I have\nsent one, so write and tell me what you say about this, or tell the\nman in charge of the animal what to do.\n\n\nAmra said that A'isha\nsaid, \"It is notas Ibn Abbas has said. I once plaited the garlands for\nthe sacrificial animal of the Messenger of Allah, may Allah bless him\nand grant him peace, with my own two hands. Then after that the\nMessenger of Allah, may Allah bless him and grant him peace, himself\nput the garlands on the animal and then sent it with my father. And\nthere was nothing that Allah had made halal forthe Messenger of Allah,\nmay Allah bless him and grant him peace, that was haram for him until\nsuch time as the animal had been sacrificed.\""}},{"id":54,"idInBook":54,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ قَالَ سَأَلْتُ عَمْرَةَ بِنْتَ عَبْدِ الرَّحْمَنِ عَنِ الَّذِي، يَبْعَثُ بِهَدْيِهِ وَيُقِيمُ هَلْ يَحْرُمُ عَلَيْهِ شَىْءٌ فَأَخْبَرَتْنِي أَنَّهَا سَمِعَتْ عَائِشَةَ تَقُولُ لاَ يَحْرُمُ إِلاَّ مَنْ أَهَلَّ وَلَبَّى ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Yahya ibn Said said, \"I asked\nAmra bint Abd ar-Rahman if there was anything that was haram for\nsomeone who sent a sacrificial animal (to Makka) but did not go there\nhimself, and she told me that she had heard A'isha say, 'It is only\nsome one who goes into ihram for hajj and begins saying the talbiya\nfor whom things are haram.' \""}},{"id":55,"idInBook":55,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ الْحَارِثِ التَّيْمِيِّ، عَنْ رَبِيعَةَ بْنِ عَبْدِ اللَّهِ بْنِ الْهُدَيْرِ، أَنَّهُ رَأَى رَجُلاً مُتَجَرِّدًا بِالْعِرَاقِ فَسَأَلَ النَّاسَ عَنْهُ فَقَالُوا إِنَّهُ أَمَرَ بِهَدْيِهِ أَنْ يُقَلَّدَ فَلِذَلِكَ تَجَرَّدَ ‏.‏ قَالَ رَبِيعَةُ فَلَقِيتُ عَبْدَ اللَّهِ بْنَ الزُّبَيْرِ فَذَكَرْتُ لَهُ ذَلِكَ فَقَالَ بِدْعَةٌ وَرَبِّ الْكَعْبَةِ ‏.‏ وَسُئِلَ مَالِكٌ عَمَّنْ خَرَجَ بِهَدْىٍ لِنَفْسِهِ فَأَشْعَرَهُ وَقَلَّدَهُ بِذِي الْحُلَيْفَةِ وَلَمْ يُحْرِمْ هُوَ حَتَّى جَاءَ الْجُحْفَةَ قَالَ لاَ أُحِبُّ ذَلِكَ وَلَمْ يُصِبْ مَنْ فَعَلَهُ وَلاَ يَنْبَغِي لَهُ أَنْ يُقَلِّدَ الْهَدْىَ وَلاَ يُشْعِرَهُ إِلاَّ عِنْدَ الإِهْلاَلِ إِلاَّ رَجُلٌ لاَ يُرِيدُ الْحَجَّ فَيَبْعَثُ بِهِ وَيُقِيمُ فِي أَهْلِهِ ‏.‏ وَسُئِلَ مَالِكٌ هَلْ يَخْرُجُ بِالْهَدْىِ غَيْرُ مُحْرِمٍ فَقَالَ نَعَمْ لاَ بَأْسَ بِذَلِكَ ‏.‏ وَسُئِلَ أَيْضًا عَمَّا اخْتَلَفَ فِيهِ النَّاسُ مِنَ الإِحْرَامِ لِتَقْلِيدِ الْهَدْىِ مِمَّنْ لاَ يُرِيدُ الْحَجَّ وَلاَ الْعُمْرَةَ فَقَالَ الأَمْرُ عِنْدَنَا الَّذِي نَأْخُذُ بِهِ فِي ذَلِكَ قَوْلُ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعَثَ بِهَدْيِهِ ثُمَّ أَقَامَ فَلَمْ يَحْرُمْ عَلَيْهِ شَىْءٌ مِمَّا أَحَلَّهُ اللَّهُ لَهُ حَتَّى نُحِرَ هَدْيُهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik, from Yahya ibn Said, from\nMuhammad ibn Ibrahim ibn al-Harith at-Taymi, that Rabia ibn Abdullah\nibn al-Hudayr once saw a man in a state of ihram in Iraq. So he asked\npeople about him and they said, \"He has given directions for his\nsacrificial animal to be garlanded, and it is for that reason that he\nhas put on ihram .\"\n\n\nRabia said, \"I then met Abdullah ibn az-\nZubayr and so I mentioned this to him and he said, 'By the Lord of the\nKaba, an innovation.' \"\n\n\nMalik was asked about some one who\nset out with his own sacrificial animal and marked it and garlanded it\nat Dhu'l-Hulayfa, but did not go into ihram until he had reached al-\nJuhfa,and hesaid, \"I do not like that, and whoever does so has not\nacted properly. He should only garland his sacrificial animal, or mark\nit, when he goes into ihram, unless it is someone who does not intend\nto do hajj, in which case he sends it off and stays with his family.\"\n\n\nMalik was asked if somone who was not in ihram could set out\nwith a sacrificial animal, and he said, \"Yes. There is no harm in\nthat.\"\n\n\nHe was also asked to comment on the different views\npeople had about what became haram for some one who garlanded a\nsacrificial animal but did not intend to do either hajj or umra, and\nhe said, \"What we go by as far as this is concerned is what A'isha,\numm al-muminin said, 'The Messenger of Allah, may Allah bless him and\ngrant him peace, sent his sacrificial animal off and did not go there\nhimself, and there was nothing that Allah had made halal for him that\nwas haram for him until the animal had been sacrificed.' \""}},{"id":56,"idInBook":56,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقُولُ الْمَرْأَةُ الْحَائِضُ الَّتِي تُهِلُّ بِالْحَجِّ أَوِ الْعُمْرَةِ إِنَّهَا تُهِلُّ بِحَجِّهَا أَوْ عُمْرَتِهَا إِذَا أَرَادَتْ وَلَكِنْ لاَ تَطُوفُ بِالْبَيْتِ وَلاَ بَيْنَ الصَّفَا وَالْمَرْوَةِ وَهِيَ تَشْهَدُ الْمَنَاسِكَ كُلَّهَا مَعَ النَّاسِ غَيْرَ أَنَّهَا لاَ تَطُوفُ بِالْبَيْتِ وَلاَ بَيْنَ الصَّفَا وَالْمَرْوَةِ وَلاَ تَقْرَبُ الْمَسْجِدَ حَتَّى تَطْهُرَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik, from Nafi, that Abdullah ibn Umar\nused to say, \"A menstruating woman who wants to go into ihram to do\neither hajj or umra can do so if she so wishes, but she cannot do\ntawaf of the House, nor the say between Safa and Marwa. She can\nparticipate in all the rituals along with everybody else, except that\nshe cannot do tawaf of the House, nor the say between Safa and Marwa,\nnor can she come near the mosque until she is pure.\""}},{"id":57,"idInBook":57,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم اعْتَمَرَ ثَلاَثًا عَامَ الْحُدَيْبِيَةِ وَعَامَ الْقَضِيَّةِ وَعَامَ الْجِعِرَّانَةِ ‏.‏","english":{"narrator":"Yahya related to me from Malik that he had heard that the\nMessenger of Allah, may Allah bless him and grant him peace, did umra\nthree times:","text":"in the year of Hudaybiya, in the year of al-Qadiyya, and\nin the year of al-Jiirrana."}},{"id":58,"idInBook":58,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَمْ يَعْتَمِرْ إِلاَّ ثَلاَثًا إِحْدَاهُنَّ فِي شَوَّالٍ وَاثْنَتَيْنِ فِي ذِي الْقَعْدَةِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa, from his\nfather, that the Messenger of Allah, may Allah bless him and grant him\npeace, only did three umras, one of them in Shawwal, and two in\nDhu'l-Qada."}},{"id":59,"idInBook":59,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ حَرْمَلَةَ الأَسْلَمِيِّ، أَنَّ رَجُلاً، سَأَلَ سَعِيدَ بْنَ الْمُسَيَّبِ فَقَالَ أَعْتَمِرُ قَبْلَ أَنْ أَحُجَّ، فَقَالَ سَعِيدٌ نَعَمْ قَدِ اعْتَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَبْلَ أَنْ يَحُجَّ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik, from Abd ar-Rahman ibn Harmala\nal-Aslami, that somebody asked Said ibn al-Musayyab, \"Can I do umra\nbefore I do hajj?\", and Said said, \"Yes, the Messenger of Allah, may\nAllah bless him and grant him peace, did umra before doing hajj.\""}},{"id":60,"idInBook":60,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ عُمَرَ بْنَ أَبِي سَلَمَةَ، اسْتَأْذَنَ عُمَرَ بْنَ الْخَطَّابِ أَنْ يَعْتَمِرَ، فِي شَوَّالٍ فَأَذِنَ لَهُ فَاعْتَمَرَ ثُمَّ قَفَلَ إِلَى أَهْلِهِ وَلَمْ يَحُجَّ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik, from Ibn Shihab, from Said ibn\nal-Musayyab, that Umar ibn Abi Salama once asked Umar ibn alKhattab\nfor permission to do umra in Shawwal. He gave him permission, so he\ndid umra and then went back to his family, and he did not do hajj."}},{"id":61,"idInBook":61,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّهُ كَانَ يَقْطَعُ التَّلْبِيَةَ فِي الْعُمْرَةِ إِذَا دَخَلَ الْحَرَمَ ‏.‏ قَالَ مَالِكٌ فِيمَنْ أَحْرَمَ مِنَ التَّنْعِيمِ إِنَّهُ يَقْطَعُ التَّلْبِيَةَ حِينَ يَرَى الْبَيْتَ ‏.‏ قَالَ يَحْيَى سُئِلَ مَالِكٌ عَنِ الرَّجُلِ يَعْتَمِرُ مِنْ بَعْضِ الْمَوَاقِيتِ وَهُوَ مِنْ أَهْلِ الْمَدِينَةِ أَوْ غَيْرِهِمْ مَتَى يَقْطَعُ التَّلْبِيَةَ قَالَ أَمَّا الْمُهِلُّ مِنَ الْمَوَاقِيتِ فَإِنَّهُ يَقْطَعُ التَّلْبِيَةَ إِذَا انْتَهَى إِلَى الْحَرَمِ ‏.‏ قَالَ وَبَلَغَنِي أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ كَانَ يَصْنَعُ ذَلِكَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik, from Hisham ibn 'Urwa, that his\nfather would stop saying the talbiya when he entered the Haram, if he\nwas doing 'umra.\n\n\nMalik said that someone who went into ihram\nat at-Tanim should stop saying the talbiya when he saw the House.\n\n\nYahya said that Malik was asked where a man from the people of\nMadina, or elsewhere, who had begun doing umra at one of the mawaqit,\nshould stop saying the talbiya, and he said, \"Someone who goes into\nihram at one of the mawaqit should stop saying the talbiya when he\narrives at the Haram.\"\n\n\nMalik added, \"I have heard that\nAbdullah ibn Umar used to do that.\""}},{"id":62,"idInBook":62,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ الْحَارِثِ بْنِ نَوْفَلِ بْنِ عَبْدِ الْمُطَّلِبِ، أَنَّهُ حَدَّثَهُ أَنَّهُ، سَمِعَ سَعْدَ بْنَ أَبِي وَقَّاصٍ، وَالضَّحَّاكَ بْنَ قَيْسٍ، عَامَ حَجَّ مُعَاوِيَةُ بْنُ أَبِي سُفْيَانَ - وَهُمَا يَذْكُرَانِ التَّمَتُّعَ بِالْعُمْرَةِ إِلَى الْحَجِّ - فَقَالَ الضَّحَّاكُ بْنُ قَيْسٍ لاَ يَفْعَلُ ذَلِكَ إِلاَّ مَنْ جَهِلَ أَمْرَ اللَّهِ عَزَّ وَجَلَّ ‏.‏ فَقَالَ سَعْدٌ بِئْسَ مَا قُلْتَ يَا ابْنَ أَخِي ‏.‏ فَقَالَ الضَّحَّاكُ فَإِنَّ عُمَرَ بْنَ الْخَطَّابِ قَدْ نَهَى عَنْ ذَلِكَ ‏.‏ فَقَالَ سَعْدٌ قَدْ صَنَعَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَصَنَعْنَاهَا مَعَهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik, from Ibn Shihab, that Muhammad\nibn Abdullah ibn al-Harith ibn Nawfal ibn Abd al-Muttalib told him\nthat he had heard Sad ibn Abi Waqqas and ad-Dahhak ibn Qays discussing\ntamattu in between umra and hajj. Ad-Dahhak ibn Qays said, \"Only\nsomeone who is ignorant of what Allah, the Exalted and Glorified, says\nwould do that.\"  Whereupon Sad said, \"How wrong is what you have just\nsaid, son of my brother!\"  Ad-Dahhak said, ''Umar ibn al-Khattab\nforbade that,\" and Sad said, \"The Messenger of Allah, may Allah bless\nhim and grant him peace, did it, and we did it with him.\""}},{"id":63,"idInBook":63,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ صَدَقَةَ بْنِ يَسَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ قَالَ وَاللَّهِ لأَنْ أَعْتَمِرَ قَبْلَ الْحَجِّ وَأُهْدِيَ أَحَبُّ إِلَىَّ مِنْ أَنْ أَعْتَمِرَ بَعْدَ الْحَجِّ فِي ذِي الْحِجَّةِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik, from Sadaqa ibn Yasar, that\nAbdullah ibn Umar said, \"By Allah, I would rather do umra before hajj\nand sacrifice an animal than do umra after hajj in the month of\nDhu'l-Hijja.\""}},{"id":64,"idInBook":64,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ كَانَ يَقُولُ مَنِ اعْتَمَرَ فِي أَشْهُرِ الْحَجِّ فِي شَوَّالٍ أَوْ ذِي الْقَعْدَةِ أَوْ فِي ذِي الْحِجَّةِ قَبْلَ الْحَجِّ ثُمَّ أَقَامَ بِمَكَّةَ حَتَّى يُدْرِكَهُ الْحَجُّ فَهُوَ مُتَمَتِّعٌ إِنْ حَجَّ وَعَلَيْهِ مَا اسْتَيْسَرَ مِنَ الْهَدْىِ فَإِنْ لَمْ يَجِدْ فَصِيَامُ ثَلاَثَةِ أَيَّامٍ فِي الْحَجِّ وَسَبْعَةٍ إِذَا رَجَعَ ‏.‏ قَالَ مَالِكٌ وَذَلِكَ إِذَا أَقَامَ حَتَّى الْحَجِّ ثُمَّ حَجَّ مِنْ عَامِهِ ‏.‏ قَالَ مَالِكٌ فِي رَجُلٍ مِنْ أَهْلِ مَكَّةَ انْقَطَعَ إِلَى غَيْرِهَا وَسَكَنَ سِوَاهَا ثُمَّ قَدِمَ مُعْتَمِرًا فِي أَشْهُرِ الْحَجِّ ثُمَّ أَقَامَ بِمَكَّةَ حَتَّى أَنْشَأَ الْحَجَّ مِنْهَا إِنَّهُ مُتَمَتِّعٌ يَجِبُ عَلَيْهِ الْهَدْىُ أَوِ الصِّيَامُ إِنْ لَمْ يَجِدْ هَدْيًا وَأَنَّهُ لاَ يَكُونُ مِثْلَ أَهْلِ مَكَّةَ ‏.‏ وَسُئِلَ مَالِكٌ عَنْ رَجُلٍ مِنْ غَيْرِ أَهْلِ مَكَّةَ دَخَلَ مَكَّةَ بِعُمْرَةٍ فِي أَشْهُرِ الْحَجِّ وَهُوَ يُرِيدُ الإِقَامَةَ بِمَكَّةَ حَتَّى يُنْشِئَ الْحَجَّ أَمُتَمَتِّعٌ هُوَ فَقَالَ نَعَمْ هُوَ مُتَمَتِّعٌ وَلَيْسَ هُوَ مِثْلَ أَهْلِ مَكَّةَ وَإِنْ أَرَادَ الإِقَامَةَ وَذَلِكَ أَنَّهُ دَخَلَ مَكَّةَ وَلَيْسَ هُوَ مِنْ أَهْلِهَا وَإِنَّمَا الْهَدْىُ أَوِ الصِّيَامُ عَلَى مَنْ لَمْ يَكُنْ مِنْ أَهْلِ مَكَّةَ وَأَنَّ هَذَا الرَّجُلَ يُرِيدُ الإِقَامَةَ وَلاَ يَدْرِي مَا يَبْدُو لَهُ بَعْدَ ذَلِكَ وَلَيْسَ هُوَ مِنْ أَهْلِ مَكَّةَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik, from Abdullah ibn Dinar, that\nAbdullah ibn Umar used to say, \"Anyone that does umra in the months of\nhajj, that is, in Shawwal, Dhu'l-Qada, or in Dhu'l-Hijja before the\nhajj, and then stays in Makka until the time for hajj, is doing\ntamattu if he then does hajj. He must sacrifice whatever animal it is\neasy for him to obtain, and if he cannot find one then he must fast\nthree days during hajj and seven days when he returns.\"\n\n\nMalik\nsaid, \"This is only the case if he stays until the hajj and does hajj\nin that same year.\"\n\n\nMalik said that if someone who was from\nMakka but had stopped living there and gone to live elsewhere, came\nback to do umra in the months of the hajj and then stayed in Makka to\nbegin hajj there, he was doing tamattu, and had to offer up a\nsacrificial animal, or fast if he could not find one. He was not the\nsame as the people of Makka.\n\n\nMalik was asked whether someone\nwho was not from Makka and entered Makka to do umra in the months of\nhajj with the intention of staying on to begin his hajj there was\ndoing tamattu or not, and he said,  \"Yes, he is doing tamattu, and he\nis not the same as the people of Makka, even if he has the intention\nof staying there. This is because he has entered Makka, and is not one\nof its people, and making a sacrifice or fasting is incumbent on\nanyone who is not from Makka, and, although he intends to stay, he\ndoes not know what possibilities might arise later. He is not one of\nthe people of Makka.\""}},{"id":65,"idInBook":65,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ سَمِعَ سَعِيدَ بْنَ الْمُسَيَّبِ، يَقُولُ مَنِ اعْتَمَرَ فِي شَوَّالٍ أَوْ ذِي الْقَعْدَةِ أَوْ فِي ذِي الْحِجَّةِ ثُمَّ أَقَامَ بِمَكَّةَ حَتَّى يُدْرِكَهُ الْحَجُّ فَهُوَ مُتَمَتِّعٌ إِنْ حَجَّ وَمَا اسْتَيْسَرَ مِنَ الْهَدْىِ فَمَنْ لَمْ يَجِدْ فَصِيَامُ ثَلاَثَةِ أَيَّامٍ فِي الْحَجِّ وَسَبْعَةٍ إِذَا رَجَعَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Yahya ibn Said used to hear\nSaid ibn al-Musayyab say, \"Anyone that does umra in Shawwal,\nDhu'l-Qada or Dhu l-Hijja, and then stays in Makka until it is time\nfor the hajj, is doing tamattu if he then does hajj. He must sacrifice\nwhatever animal it is easy for him to obtain, and if he cannot find\none then he must fast three days during hajj and seven days when he\nreturns.\""}},{"id":66,"idInBook":66,"chapterId":20,"bookId":7,"arabic":"","english":{"narrator":"","text":"Malik said, \"Someone who does umra in Shawwal, Dhu'l-Qada or\nDhu'l-Hijja and then goes back to his people, and then returns and\ndoes hajj in that same year does not have to sacrifice an animal.\nSacrificing an animal is only incumbent on some one who does umra in\nthe months of hajj, and then stays in Makka and then does hajj. A\nperson not from Makka who moves to Makka and establishes his home\nthere and does umra in the months of the hajj and then begins his hajj\nthere is not doing tamattu. He does not have to sacrifice an animal\nnor does he have to fast. He is in the same position as the people of\nMakka if he is one of those who are living there.\"\n\n\nMalik was\nasked whether a man from Makka who had gone to live in another town or\nhad been on a journey and then returned to Makka with the intention of\nstaying there, regardless of whether he had a family there or not, and\nentered it to do umra in the months of the hajj, and then began his\nhajj there, beginning his umra at the miqat of the Prophet, may Allah\nbless him and grant him peace, or at a place nearer than that, was\ndoing tamattu or not?\n\n\nMalik answered, \"He does not have to\nsacrifice an animal or fast as someone who is doing tamattu has to do.\nThis is because Allah, the Blessed and Exalted, says in His Book,\n'That is for someone whose family are not present at Masjid al-Haram.\n'"}},{"id":67,"idInBook":67,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ سُمَىٍّ، مَوْلَى أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي صَالِحٍ السَّمَّانِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْعُمْرَةُ إِلَى الْعُمْرَةِ كَفَّارَةٌ لِمَا بَيْنَهُمَا وَالْحَجُّ الْمَبْرُورُ لَيْسَ لَهُ جَزَاءٌ إِلاَّ الْجَنَّةُ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik, from Sumayy, the mawla of Abu\nBakr ibn Abd ar-Rahman, from Abu Salih as-Samman, from Abu Hurayra,\nthat the Messenger of Allah, may Allah bless him and grant him peace\n,said, \"Umra is an expiation for what is between it and the next umra,\nand the only reward for an accepted hajj is the Garden.\""}},{"id":68,"idInBook":68,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ سُمَىٍّ، مَوْلَى أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ أَنَّهُ سَمِعَ أَبَا بَكْرِ بْنَ عَبْدِ الرَّحْمَنِ، يَقُولُ جَاءَتِ امْرَأَةٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ إِنِّي قَدْ كُنْتُ تَجَهَّزْتُ لِلْحَجِّ فَاعْتَرَضَ لِي ‏.‏ فَقَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ اعْتَمِرِي فِي رَمَضَانَ فَإِنَّ عُمْرَةً فِيهِ كَحِجَّةٍ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Sumayy, the mawla of Abu Bakr\nibn Abd ar-Rahman, heard Abu Bakribn Abd ar-Rahman say, \"A woman came\nto the Messenger of Allah, may Allah bless him and grant him peace,\nand said, 'I had arranged to do hajj, but I was prevented,' and the\nMessenger of Allah, may Allah bless him and grant him peace, said, 'Do\numra in Ramadan, for doing umra in it is like doing hajj.' \""}},{"id":69,"idInBook":69,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ افْصِلُوا بَيْنَ حَجِّكُمْ وَعُمْرَتِكُمْ فَإِنَّ ذَلِكَ أَتَمُّ لِحَجِّ أَحَدِكُمْ وَأَتَمُّ لِعُمْرَتِهِ أَنْ يَعْتَمِرَ فِي غَيْرِ أَشْهُرِ الْحَجِّ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik, from Nafi, from Abdullah ibn\nUmar, that Umar ibn al-Khattab said, \"Keep your hajj separate from\nyour umra. That way your hajj will be more complete. And your umra\nwill be more complete if you do it outside of the months of the hajj.\""}},{"id":70,"idInBook":70,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عُثْمَانَ بْنَ عَفَّانَ، كَانَ إِذَا اعْتَمَرَ رُبَّمَا لَمْ يَحْطُطْ عَنْ رَاحِلَتِهِ حَتَّى يَرْجِعَ ‏.‏ قَالَ مَالِكٌ الْعُمْرَةُ سُنَّةٌ وَلاَ نَعْلَمُ أَحَدًا مِنَ الْمُسْلِمِينَ أَرْخَصَ فِي تَرْكِهَا ‏.‏ قَالَ مَالِكٌ وَلاَ أَرَى لأَحَدٍ أَنْ يَعْتَمِرَ فِي السَّنَةِ مِرَارًا ‏.‏ قَالَ مَالِكٌ فِي الْمُعْتَمِرِ يَقَعُ بِأَهْلِهِ إِنَّ عَلَيْهِ فِي ذَلِكَ الْهَدْىَ وَعُمْرَةً أُخْرَى يَبْتَدِئُ بِهَا بَعْدَ إِتْمَامِهِ الَّتِي أَفْسَدَ وَيُحْرِمُ مِنْ حَيْثُ أَحْرَمَ بِعُمْرَتِهِ الَّتِي أَفْسَدَ إِلاَّ أَنْ يَكُونَ أَحْرَمَ مِنْ مَكَانٍ أَبْعَدَ مِنْ مِيقَاتِهِ فَلَيْسَ عَلَيْهِ أَنْ يُحْرِمَ إِلاَّ مِنْ مِيقَاتِهِ ‏.‏ قَالَ مَالِكٌ وَمَنْ دَخَلَ مَكَّةَ بِعُمْرَةٍ فَطَافَ بِالْبَيْتِ وَسَعَى بَيْنَ الصَّفَا وَالْمَرْوَةِ وَهُوَ جُنُبٌ أَوْ عَلَى غَيْرِ وُضُوءٍ ثُمَّ وَقَعَ بِأَهْلِهِ ثُمَّ ذَكَرَ - قَالَ - يَغْتَسِلُ أَوْ يَتَوَضَّأُ ثُمَّ يَعُودُ فَيَطُوفُ بِالْبَيْتِ وَيَسْعَى بَيْنَ الصَّفَا وَالْمَرْوَةِ وَيَعْتَمِرُ عُمْرَةً أُخْرَى وَيُهْدِي وَعَلَى الْمَرْأَةِ إِذَا أَصَابَهَا زَوْجُهَا وَهِيَ مُحْرِمَةٌ مِثْلُ ذَلِكَ ‏.‏ قَالَ مَالِكٌ فَأَمَّا الْعُمْرَةُ مِنَ التَّنْعِيمِ فَإِنَّهُ مَنْ شَاءَ أَنْ يَخْرُجَ مِنَ الْحَرَمِ ثُمَّ يُحْرِمَ فَإِنَّ ذَلِكَ مُجْزِئٌ عَنْهُ إِنْ شَاءَ اللَّهُ وَلَكِنِ الْفَضْلُ أَنْ يُهِلَّ مِنَ الْمِيقَاتِ الَّذِي وَقَّتَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَوْ مَا هُوَ أَبْعَدُ مِنَ التَّنْعِيمِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Uthman ibn\nAffan would sometimes never get down from the animal he was riding on\nwhen he was doing umra, until he had returned .\n\n\nMalik said,\n''Umra is a sunna, and we do not know of any muslim who has ever said\nthat it is permissible not to do it.\"\n\n\nMalik said, \"I do not\nthink that anyone can do more than one umra in any one year.\"\n\n\nMalik said that someone doing umra who had sexual intercourse with his\nwife had to sacrifice an animal and do a second umra, which he had to\nbegin when he had finished the one that he had spoiled. He should go\ninto ihram at the same place where he went into ihram for the umra\nwhich he had spoiled, except if he had entered into ihram at a place\nfurther away than his miqat. This was because he only had to go into\nihram from his miqat.\n\n\nMalik said, \"Someone who entered Makka\nto do umra, and does tawaf of the House and say between Safa and Marwa\nwhile he is junub, or not in wudu, and afterwards has intercourse with\nhis wife,  and then remembers, should do ghusl, or wudu, and then go\nback and do tawaf around the House and say between Safa and Marwa and\ndo another umra and sacrifice an animal. A woman should do the same if\nher husband has intercourse with her while she is in ihram. \"\n\n\nMalik said, \"As for beginning umra at at-Tanim, (it is not the only\nalternative). It is permissible if Allah wills for some one to leave\nthe Haram and go into ihram if he wishes, but the best way is for him\nto go into ihram at the miqat which the Messenger of Allah, may Allah\nbless him and grant him peace, used (i.e. at-Tanim), or one which is\nfurther away.\""}},{"id":71,"idInBook":71,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعَثَ أَبَا رَافِعٍ وَرَجُلاً مِنَ الأَنْصَارِ فَزَوَّجَاهُ مَيْمُونَةَ بِنْتَ الْحَارِثِ وَرَسُولُ اللَّهِ صلى الله عليه وسلم بِالْمَدِينَةِ قَبْلَ أَنْ يَخْرُجَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik, from Rabia ibn Abi Abd ar-Rahman,\nfrom Sulayman ibn Yasar, that the Messenger of Allah, may Allah bless\nhim and grant him peace, sent Abu Rafi and a man of the Ansar to\narrange his marriage to Maymuna bint al-Harith, and the Messenger of\nAllah, may Allah bless him and grant him peace, was in Madina before\nhe had left for umra."}},{"id":72,"idInBook":72,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ نُبَيْهِ بْنِ وَهْبٍ، أَخِي بَنِي عَبْدِ الدَّارِ أَنَّ عُمَرَ بْنَ عُبَيْدِ اللَّهِ، أَرْسَلَ إِلَى أَبَانَ بْنِ عُثْمَانَ - وَأَبَانُ يَوْمَئِذٍ أَمِيرُ الْحَاجِّ وَهُمَا مُحْرِمَانِ - إِنِّي قَدْ أَرَدْتُ أَنْ أُنْكِحَ طَلْحَةَ بْنَ عُمَرَ بِنْتَ شَيْبَةَ بْنِ جُبَيْرٍ وَأَرَدْتُ أَنْ تَحْضُرَ ‏.‏ فَأَنْكَرَ ذَلِكَ عَلَيْهِ أَبَانُ وَقَالَ سَمِعْتُ عُثْمَانَ بْنَ عَفَّانَ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ يَنْكِحِ الْمُحْرِمُ وَلاَ يُنْكِحْ وَلاَ يَخْطُبْ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik, from Nafi, from Nubayh ibn Wahb,\nwho was from the tribe of Bani Abd ad-Dar, that Umar ibn Ubaydullah\nsent a message to Aban ibn Uthman (who was amir of the hajj at the\ntime), while both of them were in ihram, saying, \"I want to marry Bint\nShayba ibn Jubayr to Talha ibn Umar and I want you to be present.\"\nAban told him that he should not do that and said, \"I heard Uthman ibn\nAffan say that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, 'A man in ihram should not marry, or give in\nmarriage, or get betrothed.' \""}},{"id":73,"idInBook":73,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ دَاوُدَ بْنِ الْحُصَيْنِ، أَنَّ أَبَا غَطَفَانَ بْنَ طَرِيفٍ الْمُرِّيَّ، أَخْبَرَهُ أَنَّ أَبَاهُ طَرِيفًا تَزَوَّجَ امْرَأَةً وَهُوَ مُحْرِمٌ فَرَدَّ عُمَرُ بْنُ الْخَطَّابِ نِكَاحَهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik, from Da'ud ibn al-Husayn, that\nAbu Ghatafan ibn Tarif al-Murri told him that his father Tarif had\nmarried a woman while he was in ihram, and Umar ibn al-Khattab had\nrescinded the marriage."}},{"id":74,"idInBook":74,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقُولُ لاَ يَنْكِحِ الْمُحْرِمُ وَلاَ","english":{"narrator":"","text":"Yahya related to me from Malik, from Nafi, that Abdullah ibn Umar\nused to say, \"Someone in ihram may neither get married, nor arrange a\nmarriage for himself or others.\""}},{"id":75,"idInBook":75,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ سَعِيدَ بْنَ الْمُسَيَّبِ، وَسَالِمَ بْنَ عَبْدِ اللَّهِ، وَسُلَيْمَانَ بْنَ يَسَارٍ، سُئِلُوا عَنْ نِكَاحِ الْمُحْرِمِ، فَقَالُوا لاَ يَنْكِحِ الْمُحْرِمُ وَلاَ يُنْكِحْ ‏.‏ قَالَ مَالِكٌ فِي الرَّجُلِ الْمُحْرِمِ إِنَّهُ يُرَاجِعُ امْرَأَتَهُ إِنْ شَاءَ إِذَا كَانَتْ فِي عِدَّةٍ مِنْهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Said ibn\nal-Musayyab, Salim ibn Abdullah and Sulayman ibn Yasar were asked\nabout whether someone in ihram could get married, and they said, \"Some\none in ihram may neither get married nor give some one in marriage.\"\n\n\nMalik said that a man who was in ihram could return to his\nwife if he wanted to, if she was still in her idda after she had been\ndivorced from him."}},{"id":76,"idInBook":76,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم احْتَجَمَ وَهُوَ مُحْرِمٌ فَوْقَ رَأْسِهِ وَهُوَ يَوْمَئِذٍ بِلَحْيَىْ جَمَلٍ مَكَانٌ بِطَرِيقِ مَكَّةَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik, from Yahya ibn Sa'id, from\nSulayman ibn Yasar, that the Messenger of Allah, may Allah bless him\nand grant him peace, was once cupped on the top of his head while he\nwas in ihram, at Lahyay Jamal, which is a place on the road to Makka."}},{"id":77,"idInBook":77,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ كَانَ يَقُولُ لاَ يَحْتَجِمُ الْمُحْرِمُ إِلاَّ مِمَّا لاَ بُدَّ لَهُ مِنْهُ ‏.‏ قَالَ مَالِكٌ لاَ يَحْتَجِمُ الْمُحْرِمُ إِلاَّ مِنْ ضَرُورَةٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik, from Nafi, that Abdullah ibn Umar\nused to say, \"Someone in ihram should not be cupped, except when there\nis no other alternative.\"\n\n\nMalik said, \"Someone who is in\nihram should not be cupped except when it is necessary.\""}},{"id":78,"idInBook":78,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي النَّضْرِ، مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ التَّيْمِيِّ عَنْ نَافِعٍ، مَوْلَى أَبِي قَتَادَةَ الأَنْصَارِيِّ عَنْ أَبِي قَتَادَةَ، أَنَّهُ كَانَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم حَتَّى إِذَا كَانُوا بِبَعْضِ طَرِيقِ مَكَّةَ تَخَلَّفَ مَعَ أَصْحَابٍ لَهُ مُحْرِمِينَ وَهُوَ غَيْرُ مُحْرِمٍ فَرَأَى حِمَارًا وَحْشِيًّا فَاسْتَوَى عَلَى فَرَسِهِ فَسَأَلَ أَصْحَابَهُ أَنْ يُنَاوِلُوهُ سَوْطَهُ فَأَبَوْا عَلَيْهِ فَسَأَلَهُمْ رُمْحَهُ فَأَبَوْا فَأَخَذَهُ ثُمَّ شَدَّ عَلَى الْحِمَارِ فَقَتَلَهُ فَأَكَلَ مِنْهُ بَعْضُ أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأَبَى بَعْضُهُمْ فَلَمَّا أَدْرَكُوا رَسُولَ اللَّهِ صلى الله عليه وسلم سَأَلُوهُ عَنْ ذَلِكَ فَقَالَ ‏\n\"‏ إِنَّمَا هِيَ طُعْمَةٌ أَطْعَمَكُمُوهَا اللَّهُ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik, from Abu'n-Nadr, the mawla of\n'Umar ibn 'Ubaydullah at-Taymi, from Nafi, the mawla of Abu Qatada al-\nAnsari, that Abu Qatada was once with the Messenger of Allah, may\nAllah bless him and grant him peace. When they got to one of the roads\nto Makka he fell behind with some companions of his who were muhrim,\nwhile he was not. Then he saw a wild ass, so he got on his mount and\nasked his companions to give him his whip but they refused. Then he\nasked them for his spear and they refused to give it to him. So he\ntook hold of it and attacked the ass and killed it. Some of the\ncompanions of the Messenger of Allah, may Allah bless him and grant\nhim peace, ate from it, and others refused. When they had caught up\nwith the Messenger of Allah, may Allah bless him and grant him peace,\nthey asked him about it and he said, \"It is food that Allah has fed\nyou with.\""}},{"id":79,"idInBook":79,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّ الزُّبَيْرَ بْنَ الْعَوَّامِ، كَانَ يَتَزَوَّدُ صَفِيفَ الظِّبَاءِ وَهُوَ مُحْرِمٌ ‏.‏ قَالَ مَالِكٌ وَالصَّفِيفُ الْقَدِيدُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik, from Hisham ibn Urwa, from his\nfather, that az-Zubayr ibn al-Awwam used to take dried gazelle meat\n(safif adh-dhiba) as provisions while he was in ihram.\n\n\nMalik\nsaid, \"Safif are dried strips of meat.\""}},{"id":80,"idInBook":80,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، أَنَّ عَطَاءَ بْنَ يَسَارٍ، أَخْبَرَهُ عَنْ أَبِي قَتَادَةَ، فِي الْحِمَارِ الْوَحْشِيِّ مِثْلَ حَدِيثِ أَبِي النَّضْرِ إِلاَّ أَنَّ فِي، حَدِيثِ زَيْدِ بْنِ أَسْلَمَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ هَلْ مَعَكُمْ مِنْ لَحْمِهِ شَىْءٌ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik, from Zayd ibn Aslam, that Ata ibn\nYasar had told him, from Abu Qatada, the same hadith about the wild\nass as that of Abu'n-Nadr, except that in the hadith of Zayd ibn Aslam\nthe Messenger of Allah, may Allah bless him and grant him peace, said,\n\"Do you still have any of its meat?\""}},{"id":81,"idInBook":81,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ الأَنْصَارِيِّ، أَنَّهُ قَالَ أَخْبَرَنِي مُحَمَّدُ بْنُ إِبْرَاهِيمَ بْنِ الْحَارِثِ التَّيْمِيُّ، عَنْ عِيسَى بْنِ طَلْحَةَ بْنِ عُبَيْدِ اللَّهِ، عَنْ عُمَيْرِ بْنِ سَلَمَةَ الضَّمْرِيِّ، عَنِ الْبَهْزِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَرَجَ يُرِيدُ مَكَّةَ وَهُوَ مُحْرِمٌ حَتَّى إِذَا كَانَ بِالرَّوْحَاءِ إِذَا حِمَارٌ وَحْشِيٌّ عَقِيرٌ فَذُكِرَ ذَلِكَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ دَعُوهُ فَإِنَّهُ يُوشِكُ أَنْ يَأْتِيَ صَاحِبُهُ ‏\"‏ ‏.‏ فَجَاءَ الْبَهْزِيُّ وَهُوَ صَاحِبُهُ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ شَأْنَكُمْ بِهَذَا الْحِمَارِ ‏.‏ فَأَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَبَا بَكْرٍ فَقَسَمَهُ بَيْنَ الرِّفَاقِ ثُمَّ مَضَى حَتَّى إِذَا كَانَ بِالأَثَايَةِ - بَيْنَ الرُّوَيْثَةِ وَالْعَرْجِ - إِذَا ظَبْىٌ حَاقِفٌ فِي ظِلٍّ فِيهِ سَهْمٌ فَزَعَمَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَمَرَ رَجُلاً أَنْ يَقِفَ عِنْدَهُ لاَ يَرِيبُهُ أَحَدٌ مِنَ النَّاسِ حَتَّى يُجَاوِزَهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Yahya ibn Said al-Ansari said\nthat Muhammad ibn Ibrahim ibn al-Harith at-Taymi told him from Isa ibn\nTalha ibn Ubaydullah, fromUmayr ibn Salama ad-Damri, from al-Bahzi,\nthat the Messenger of Allah, may Allah bless him and grant him peace,\nset out once for Makka while in ihram. When they had reached ar-Rawha,\nthey unexpectedly came upon a wounded wild ass. Someone mentioned it\nto the Messenger of Allah, may Allah bless him and grant him peace,\nand hesaid, \"Leave it. The man to whom it belongs is about to come.\"\nThen al-Bahzi, who was the man, came to the Prophet, may Allah bless\nhim and grant him peace, and said, \"Messenger of Allah, do whatever\nyou want with this ass,' and the Messenger of Allah, may Allah bless\nhim and grant him peace, told Abu Bakr to divide it up among the\ncompany. Then they went on until they came to the well of al-Uthaba,\nwhich was between ar-Ruwaytha and al-Arj (between Makka and Madina),\nwhere they unexpectedly came upon a gazelle with an arrow in it, Iying\non its side in some shade. He claimed that the Messenger of Allah, may\nAllah bless him and grant him peace, told someone to stand by it to\nmake sure no one disturbed it until everyone had passed by."}},{"id":82,"idInBook":82,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ سَمِعَ سَعِيدَ بْنَ الْمُسَيَّبِ، يُحَدِّثُ عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ أَقْبَلَ مِنَ الْبَحْرَيْنِ حَتَّى إِذَا كَانَ بِالرَّبَذَةِ وَجَدَ رَكْبًا مِنْ أَهْلِ الْعِرَاقِ مُحْرِمِينَ فَسَأَلُوهُ عَنْ لَحْمِ صَيْدٍ وَجَدُوهُ عِنْدَ أَهْلِ الرَّبَذَةِ فَأَمَرَهُمْ بِأَكْلِهِ قَالَ ثُمَّ إِنِّي شَكَكْتُ فِيمَا أَمَرْتُهُمْ بِهِ فَلَمَّا قَدِمْتُ الْمَدِينَةَ ذَكَرْتُ ذَلِكَ لِعُمَرَ بْنِ الْخَطَّابِ فَقَالَ عُمَرُ مَاذَا أَمَرْتَهُمْ بِهِ فَقَالَ أَمَرْتُهُمْ بِأَكْلِهِ ‏.‏ فَقَالَ عُمَرُ بْنُ الْخَطَّابِ لَوْ أَمَرْتَهُمْ بِغَيْرِ ذَلِكَ لَفَعَلْتُ بِكَ يَتَوَاعَدُهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik, from Yahya ibn Said, that he\nheard Said ibn al-Musayyab relating from Abu Hurayra that he was once\ncoming back from Bahrayn, and, when he reached ar-Rabadha, he found a\ncaravan of people from Iraq in ihram, who asked him whether they could\neat the meat of some game which they had found with the people of ar-\nRabadha, and he told them they could eat it. He said, \"Afterwards I\nhad doubts about what I had told them to do, so when I got back to\nMadina I mentioned the matter to Umar ibn al-Khattab and he said,\n'What did you tell them to do?' I said, ' I told them to eat it.' Umar\nibn al-Khattab said, threatening me, 'If you had told them to do\nanything else I would have done something to you.' \""}},{"id":83,"idInBook":83,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يُحَدِّثُ عَبْدَ اللَّهِ بْنَ عُمَرَ أَنَّهُ مَرَّ بِهِ قَوْمٌ مُحْرِمُونَ بِالرَّبَذَةِ فَاسْتَفْتَوْهُ فِي لَحْمِ صَيْدٍ وَجَدُوا نَاسًا أَحِلَّةً يَأْكُلُونَهُ فَأَفْتَاهُمْ بِأَكْلِهِ قَالَ ثُمَّ قَدِمْتُ الْمَدِينَةَ عَلَى عُمَرَ بْنِ الْخَطَّابِ فَسَأَلْتُهُ عَنْ ذَلِكَ فَقَالَ بِمَ أَفْتَيْتَهُمْ قَالَ فَقُلْتُ أَفْتَيْتُهُمْ بِأَكْلِهِ ‏.‏ قَالَ فَقَالَ عُمَرُ لَوْ أَفْتَيْتَهُمْ بِغَيْرِ ذَلِكَ لأَوْجَعْتُكَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik, from Ibn Shihab, that Salim ibn\nAbdullah heard Abu Hurayra relating to Abdullah ibn Umar how a group\nof three people in ihram had passed him at ar-Rabadha and had asked\nhim for a fatwa about eating game which people who were not in ihram\nwere eating, and he told them that they could eat it. He said, \"Then I\nwent to Umar ibn al-Khattab in Madina and asked him about it, and he\nsaid, 'What did you say to them?' and I said, 'I told them that they\ncould eat it.' Umar said, 'If you had told them anything else I would\nhave done you an injury.' \""}},{"id":84,"idInBook":84,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، أَنَّ كَعْبَ الأَحْبَارِ، أَقْبَلَ مِنَ الشَّامِ فِي رَكْبٍ حَتَّى إِذَا كَانُوا بِبَعْضِ الطَّرِيقِ وَجَدُوا لَحْمَ صَيْدٍ فَأَفْتَاهُمْ كَعْبٌ بِأَكْلِهِ قَالَ فَلَمَّا قَدِمُوا عَلَى عُمَرَ بْنِ الْخَطَّابِ بِالْمَدِينَةِ ذَكَرُوا ذَلِكَ لَهُ فَقَالَ مَنْ أَفْتَاكُمْ بِهَذَا قَالُوا كَعْبٌ ‏.‏ قَالَ فَإِنِّي قَدْ أَمَّرْتُهُ عَلَيْكُمْ حَتَّى تَرْجِعُوا ثُمَّ لَمَّا كَانُوا بِبَعْضِ طَرِيقِ مَكَّةَ مَرَّتْ بِهِمْ رِجْلٌ مِنْ جَرَادٍ فَأَفْتَاهُمْ كَعْبٌ أَنْ يَأْخُذُوهُ فَيَأْكُلُوهُ فَلَمَّا قَدِمُوا عَلَى عُمَرَ بْنِ الْخَطَّابِ ذَكَرُوا لَهُ ذَلِكَ فَقَالَ مَا حَمَلَكَ عَلَى أَنْ تُفْتِيَهُمْ بِهَذَا قَالَ هُوَ مِنْ صَيْدِ الْبَحْرِ ‏.‏ قَالَ وَمَا يُدْرِيكَ قَالَ يَا أَمِيرَ الْمُؤْمِنِينَ - وَالَّذِي نَفْسِي بِيَدِهِ - إِنْ هِيَ إِلاَّ نَثْرَةُ حُوتٍ يَنْثُرُهُ فِي كُلِّ عَامٍ مَرَّتَيْنِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik, from Zayd ibn Aslam, from Ata ibn\nYasar, that Kab al-Ahbar was once coming back from Syria with a group\nof riders, and at a certain point along the road they found some game-\nmeat and Kab said they could eat it. When they got back to Madina they\nwent to Umar ibn al-Khattab and told him about that, and he said, \"Who\ntold you you could do that?\", and they said, ''Kab.'' He said, \"He was\nindeed the one I made amir over you until you should return.\"\n\n\nLater, when they were on the road to Makka, a swarm of locusts passed\nthem by and Kab told them to catch them and eat them. When they got\nback to Umar ibn al-Khattab they told him about this, and he said (to\nKab), \"What made you tell them they could do that?\" Kab said, \"It is\ngame of the sea.\" He said, \"How do you know?\", and Kab said, \"Amir al-\nmuminin, by the One in whose hand my self is, it is only the sneeze of\na fish which it sneezes twice every year.\"\n\n\nMalik was asked\nwhether a muhrim could buy game that he had found on the way. He\nreplied, \"Game that is only hunted to be offered to people performing\nHajj I disapprove of and forbid, but there is no harm in game that a\nman has which he does not intend for those in ihram, but which a\nmuhrim finds and buys.\"\n\n\nMalik said, about someone who had\nsome game with him that he had hunted or bought at the time when he\nhad entered into ihram, that he did not have to get rid of it, and\nthat there was no harm in him giving it to his family.\n\n\nMalik\nsaid that it was halal for some one in ihram to fish in the sea or in\nrivers and lakes, etc."}},{"id":85,"idInBook":85,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، عَنِ الصَّعْبِ بْنِ جَثَّامَةَ اللَّيْثِيِّ، أَنَّهُ أَهْدَى لِرَسُولِ اللَّهِ صلى الله عليه وسلم حِمَارًا وَحْشِيًّا وَهُوَ بِالأَبْوَاءِ أَوْ بِوَدَّانَ فَرَدَّهُ عَلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم فَلَمَّا رَأَى رَسُولُ اللَّهِ صلى الله عليه وسلم مَا فِي وَجْهِي قَالَ ‏\n\"‏ إِنَّا لَمْ نَرُدَّهُ عَلَيْكَ إِلاَّ أَنَّا حُرُمٌ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik, from Ibn Shihab, from Ubaydullah\nibn Abdullah ibn Utba ibn Masud, from Abdullah ibn Abbas, that as-Sab\nibn Jaththama al-Laythi once gave a wild ass to the Messenger of\nAllah, may Allah bless him and grant him peace, while he was at al-\nAbwa, or Waddan, and the Messenger of Allah, may Allah bless him and\ngrant him peace, gave it back to him. However, when the Messenger of\nAllah, may Allah bless him and grant him peace, saw the expression on\nthe man's face he said, \"We only gave it back to you because we are in\nihram.\""}},{"id":86,"idInBook":86,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَامِرِ بْنِ رَبِيعَةَ، قَالَ رَأَيْتُ عُثْمَانَ بْنَ عَفَّانَ بِالْعَرْجِ وَهُوَ مُحْرِمٌ فِي يَوْمٍ صَائِفٍ قَدْ غَطَّى وَجْهَهُ بِقَطِيفَةِ أُرْجُوَانٍ ثُمَّ أُتِيَ بِلَحْمِ صَيْدٍ فَقَالَ لأَصْحَابِهِ كُلُوا ‏.‏ فَقَالُوا أَوَلاَ تَأْكُلُ أَنْتَ فَقَالَ إِنِّي لَسْتُ كَهَيْئَتِكُمْ إِنَّمَا صِيدَ مِنْ أَجْلِي ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik, from Abdullah ibn Abi Bakr, that\nAbd ar-Rahman ibn Amir ibn Rabia said, \"I once saw Uthman ibn Affan in\nihram on a hot summer's day at al-Arj,and he had covered his face with\na red woollen cloth. Some game-meat was brought to him and he told his\ncompanions to eat. They said, 'Will you not eat then?', and he said,\n'I am not in the same position as you. It was hunted for my sake.' \""}},{"id":87,"idInBook":87,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ، أَنَّهَا قَالَتْ لَهُ يَا ابْنَ أُخْتِي إِنَّمَا هِيَ عَشْرُ لَيَالٍ فَإِنْ تَخَلَّجَ فِي نَفْسِكَ شَىْءٌ فَدَعْهُ تَعْنِي أَكْلَ لَحْمِ الصَّيْدِ ‏.‏ قَالَ مَالِكٌ فِي الرَّجُلِ الْمُحْرِمِ يُصَادُ مِنْ أَجْلِهِ صَيْدٌ فَيُصْنَعُ لَهُ ذَلِكَ الصَّيْدُ فَيَأْكُلُ مِنْهُ وَهُوَ يَعْلَمُ أَنَّهُ مِنْ أَجْلِهِ صِيدَ فَإِنَّ عَلَيْهِ جَزَاءَ ذَلِكَ الصَّيْدِ كُلِّهِ ‏.‏ وَسُئِلَ مَالِكٌ عَنِ الرَّجُلِ يُضْطَرُّ إِلَى أَكْلِ الْمَيْتَةِ وَهُوَ مُحْرِمٌ أَيَصِيدُ الصَّيْدَ فَيَأْكُلُهُ أَمْ يَأْكُلُ الْمَيْتَةَ فَقَالَ بَلْ يَأْكُلُ الْمَيْتَةَ وَذَلِكَ أَنَّ اللَّهَ تَبَارَكَ وَتَعَالَى لَمْ يُرَخِّصْ لِلْمُحْرِمِ فِي أَكْلِ الصَّيْدِ وَلاَ فِي أَخْذِهِ فِي حَالٍ مِنَ الأَحْوَالِ وَقَدْ أَرْخَصَ فِي الْمَيْتَةِ عَلَى حَالِ الضَّرُورَةِ ‏.‏ قَالَ مَالِكٌ وَأَمَّا مَا قَتَلَ الْمُحْرِمُ أَوْ ذَبَحَ مِنَ الصَّيْدِ فَلاَ يَحِلُّ أَكْلُهُ لِحَلاَلٍ وَلاَ لِمُحْرِمٍ لأَنَّهُ لَيْسَ بِذَكِيٍّ كَانَ خَطَأً أَوْ عَمْدًا فَأَكْلُهُ لاَ يَحِلُّ وَقَدْ سَمِعْتُ ذَلِكَ مِنْ غَيْرِ وَاحِدٍ وَالَّذِي يَقْتُلُ الصَّيْدَ ثُمَّ يَأْكُلُهُ إِنَّمَا عَلَيْهِ كَفَّارَةٌ وَاحِدَةٌ مِثْلُ مَنْ قَتَلَهُ وَلَمْ يَأْكُلْ مِنْهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik, from Hisham ibn Urwa, from his\nfather, that A'isha, umm al-muminin, said to him, \"Son of my sister,\nit is only for ten nights, so if you get an urge to do something,\nleave it,\" by which she meant eating game-meat.\n\n\nMalik said\nthat if game was hunted forthe sake of a man who is in ihram and it\nwas prepared for him and he ate some of it knowing that it had been\nhunted for his sake, then he had to pay a forfeit for all of the game\nthat had been hunted on his behalf.\n\n\nMalik was asked about\nwhether someone who was forced to eat carrion while he was in ihram\nshould hunt game and then eat that rather than the carrion, and he\nsaid, \"It is better for him to eat the carrion, because Allah, the\nBlessed and Exalted, has not given permission for someone in ihram to\neither eat game or take it in any situation, but He has made\nallowances for eating carrion when absolutely necessary.\"\n\n\nMalik said, \"It is not halal for anyone, whether in ihram or not, to\neat game which has been killed or sacrificed by some one in ihram,\nbecause, whether it was killed deliberately or by mistake, it was not\ndone in a halal manner, and so eating it is not halal. I have heard\nthis from more than one person. Somebody who kills game and then eats\nit only has to make a single kaffara, which is the same as for\nsomebody who kills game but does not eat any of it.\""}},{"id":88,"idInBook":88,"chapterId":20,"bookId":7,"arabic":"","english":{"narrator":"","text":"Malik said, \"It is not halal to eat any game that has been hunted\nin the Haram, or has had a dog set after it in the Haram and then been\nkilled outside the Haram. Anyone that does that has to pay a forfeit\nfor what has been hunted. However, some one that sets his dog after\ngame outside the Haram and then follows it until it is hunted down in\nthe Haram does not have to pay any forfeit, unless he set the dog\nafter the game near to the Haram. The game should not be eaten,\nhowever. If he set the dog loose near the Haram then he has to pay a\nforfeit for the game.\""}},{"id":89,"idInBook":89,"chapterId":20,"bookId":7,"arabic":"","english":{"narrator":"","text":"Malik said, \"Allah, the Blessed and Exalted, says, 'O you who\ntrust, do not kill game while you are in ihram. Whoever of you kills\ngame intentionally has to pay a forfeit commensurate with what he has\nkilled in cattle which two men from among you shall judge, a\nsacrificial animal which reaches the Kaba, or else he makes a kaffara\nof either feeding poor people or the equivalent of that in fasting, so\nthat he may taste the consequences of what he has done.' \" (Sura 5\nayat 95).\n\n\nMalik said, \"Someone who hunts game when he is not\nin ihram and then kills it while he is in ihram is in the same\nposition as someone who buys game while he is in ihram and then kills\nit. Allah has forbidden killing it, and so a man who does so has to\npay a forfeit for it. The position that we go by in this matter is\nthat a forfeit is assessed for anyone who kills game while he is in\nihram.\"\n\n\nYahya said that Malik said, \"The best that I have\nheard about someone who kills game and is assessed for it is that the\ngame which he has killed is assessed and its value in food is\nestimated and with that food he feeds each poor man a mudd, or fasts a\nday in place of each mudd. The number of poor men is considered, and\nif it is ten then he fasts ten days, and if it is twenty he fasts\ntwenty days, according to how many people there are to be fed, even if\nthere are more than sixty.\"\n\n\nMalik said, \"I have heard that a\nforfeit is assessed for someone who kills game in the Haram while he\nis not in ihram in the same way that it is assessed for some one who\nkills game in the Haram while he is in ihram .\""}},{"id":90,"idInBook":90,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ خَمْسٌ مِنَ الدَّوَابِّ لَيْسَ عَلَى الْمُحْرِمِ فِي قَتْلِهِنَّ جُنَاحٌ الْغُرَابُ وَالْحِدَأَةُ وَالْعَقْرَبُ وَالْفَأْرَةُ وَالْكَلْبُ الْعَقُورُ ‏\"‏ ‏.‏","english":{"narrator":"Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat the Messenger of Allah, may Allah bless him and grant him peace,\nsaid, \"There are five kinds of animal which it is not wrong for some\none in ihram to kill:","text":"crows, kites, scorpions, rats and mice, and wild\ndogs.\""}},{"id":91,"idInBook":91,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ خَمْسٌ مِنَ الدَّوَابِّ مَنْ قَتَلَهُنَّ وَهُوَ مُحْرِمٌ فَلاَ جُنَاحَ عَلَيْهِ الْعَقْرَبُ وَالْفَأْرَةُ وَالْغُرَابُ وَالْحِدَأَةُ وَالْكَلْبُ الْعَقُورُ ‏\"‏ ‏.‏","english":{"narrator":"Yahya related to me from Malik from Abdullah ibn Dinar from\nAbdullah ibn Umar that the Messenger of Allah, may Allah bless him and\ngrant him peace,said,\"There are five (kinds of) animal which it is not\nwrong for some one in ihram to kill:","text":"scorpions, rats and mice, crows,\nkites and wild dogs. \""}},{"id":92,"idInBook":92,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ خَمْسٌ فَوَاسِقُ يُقْتَلْنَ فِي الْحَرَمِ الْفَأْرَةُ وَالْعَقْرَبُ وَالْغُرَابُ وَالْحِدَأَةُ وَالْكَلْبُ الْعَقُورُ ‏\"‏ ‏.‏","english":{"narrator":"Yahya related to me from Malik from Hisham ibn Urwa from his\nfather that the Messenger of Allah, may Allah bless him and grant him\npeace, said, \"There are five trespassers that can be killed in the\nHaram:","text":"rats and mice, scorpions, crows, kites and wild dogs.\""}},{"id":93,"idInBook":93,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، أَمَرَ بِقَتْلِ الْحَيَّاتِ فِي الْحَرَمِ ‏.‏ قَالَ مَالِكٌ فِي الْكَلْبِ الْعَقُورِ الَّذِي أُمِرَ بِقَتْلِهِ فِي الْحَرَمِ إِنَّ كُلَّ مَا عَقَرَ النَّاسَ وَعَدَا عَلَيْهِمْ وَأَخَافَهُمْ مِثْلُ الأَسَدِ وَالنَّمِرِ وَالْفَهْدِ وَالذِّئْبِ فَهُوَ الْكَلْبُ الْعَقُورُ وَأَمَّا مَا كَانَ مِنَ السِّبَاعِ لاَ يَعْدُو مِثْلُ الضَّبُعِ وَالثَّعْلَبِ وَالْهِرِّ وَمَا أَشْبَهَهُنَّ مِنَ السِّبَاعِ فَلاَ يَقْتُلُهُنَّ الْمُحْرِمُ فَإِنْ قَتَلَهُ فَدَاهُ وَأَمَّا مَا ضَرَّ مِنَ الطَّيْرِ فَإِنَّ الْمُحْرِمَ لاَ يَقْتُلُهُ إِلاَّ مَا سَمَّى النَّبِيُّ صلى الله عليه وسلم الْغُرَابُ وَالْحِدَأَةُ وَإِنْ قَتَلَ الْمُحْرِمُ شَيْئًا مِنَ الطَّيْرِ سِوَاهُمَا فَدَاهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab that Umar ibn al-\nKhattab told people to kill snakes in the Haram.\n\n\nMalik said,\nabout the \"wild dogs\" which people were told to kill in the Haram,\nthat any animals that wounded, attacked, or terrorised men, such as\nlions, leopards, Iynxes and wolves, were counted as\"wild dogs.\"\nHowever, someone who was in ihram should not kill beasts of prey that\ndid not attack (people), such as hyenas, foxes, cats and anything else\nlike them, and if he did then he had to pay a forfeit for it.\nSimilarly, someone in ihram should not kill any predatory birds except\nthe kinds that the Prophet, may Allah bless him and grant him peace,\nspecified, namely crows and kites. If someone in ihram killed any\nother kind of bird he had to pay a forfeit for it."}},{"id":94,"idInBook":94,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ الْحَارِثِ التَّيْمِيِّ، عَنْ رَبِيعَةَ بْنِ عَبْدِ اللَّهِ بْنِ الْهُدَيْرِ، أَنَّهُ رَأَى عُمَرَ بْنَ الْخَطَّابِ يُقَرِّدُ بَعِيرًا لَهُ فِي طِينٍ بِالسُّقْيَا وَهُوَ مُحْرِمٌ ‏.‏ قَالَ مَالِكٌ وَأَنَا أَكْرَهُهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Yahya ibn Said from Muhammad ibn Ibrahim\nibn alHarith at-Taymi from Rabia ibn Abi Abdullah ibn alHudayr that he\nsaw Umar ibn al-Khattab taking the ticks off a camel of his at as-\nSuqya while he was in ihram .\n\n\nMalik said that he disapproved\nof that."}},{"id":95,"idInBook":95,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَلْقَمَةَ بْنِ أَبِي عَلْقَمَةَ، عَنْ أُمِّهِ، أَنَّهَا قَالَتْ سَمِعْتُ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم تُسْأَلُ عَنِ الْمُحْرِمِ أَيَحُكُّ جَسَدَهُ فَقَالَتْ نَعَمْ فَلْيَحْكُكْهُ وَلْيَشْدُدْ وَلَوْ رُبِطَتْ يَدَاىَ وَلَمْ أَجِدْ إِلاَّ رِجْلَىَّ لَحَكَكْتُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Alqama ibn Abi Alqama that\nhis mother said, \"I heard A'isha, the wife of the Prophet, may Allah\nbless him and grant him peace, being asked whether some one in ihram\ncould scratch their body or not, and she said, 'Yes, he can scratch it\nand do so as hard as he pleases. I would scratch even if my hands were\ntied and I could only use my feet.' \""}},{"id":96,"idInBook":96,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَيُّوبَ بْنِ مُوسَى، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، نَظَرَ فِي الْمِرْآةِ لِشَكْوٍ كَانَ بِعَيْنَيْهِ وَهُوَ مُحْرِمٌ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ayyub ibn Musa that Abdullah\nibn Umar once looked in the mirror for something that was irritating\nhim while he was in ihram."}},{"id":97,"idInBook":97,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَكْرَهُ أَنْ يَنْزِعَ الْمُحْرِمُ، حَلَمَةً أَوْ قُرَادًا عَنْ بَعِيرِهِ ‏.‏ قَالَ مَالِكٌ وَذَلِكَ أَحَبُّ مَا سَمِعْتُ إِلَىَّ فِي ذَلِكَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\ndid not like people who were in ihram removing mites or ticks from\ntheir camels.\n\n\nMalik said, \"This is what I like most out of\nwhat I have heard about the matter.\""}},{"id":98,"idInBook":98,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي مَرْيَمَ، ‏.‏ أَنَّهُ سَأَلَ سَعِيدَ بْنَ الْمُسَيَّبِ عَنْ ظُفْرٍ، لَهُ انْكَسَرَ وَهُوَ مُحْرِمٌ فَقَالَ سَعِيدٌ اقْطَعْهُ ‏.‏ وَسُئِلَ مَالِكٌ عَنِ الرَّجُلِ يَشْتَكِي أُذُنَهُ أَيَقْطُرُ فِي أُذُنِهِ مِنَ الْبَانِ الَّذِي لَمْ يُطَيَّبْ وَهُوَ مُحْرِمٌ فَقَالَ لاَ أَرَى بِذَلِكَ بَأْسًا وَلَوْ جَعَلَهُ فِي فِيهِ لَمْ أَرَ بِذَلِكَ بَأْسًا ‏.‏ قَالَ مَالِكٌ وَلاَ بَأْسَ أَنْ يَبُطَّ الْمُحْرِمُ خُرَاجَهُ وَيَفْقَأَ دُمَّلَهُ وَيَقْطَعَ عِرْقَهُ إِذَا احْتَاجَ إِلَى ذَلِكَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Muhammad ibn Abdullah ibn Abi\nMaryam once asked Said ibn al-Musayyab about (what to do with) a nail\nof his that had broken while he was in ihram and Said said, \"cut it\noff.\"\n\n\nMalik was asked whether some one in ihram who had an\near-complaint could use medicinal oil which was not perfumed for\ndropping into his ears, and he said, \"I do not see any harm in that,\nand even if he were to put it into his mouth I still would not see any\nharm in it.\"\n\n\nMalik said that there was no harm in some one in\nihram lancing an abscess that he had, or a boil, or cutting a vein, if\nhe needed to do so."}},{"id":99,"idInBook":99,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، قَالَ كَانَ الْفَضْلُ بْنُ عَبَّاسٍ رَدِيفَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَجَاءَتْهُ امْرَأَةٌ مِنْ خَثْعَمَ تَسْتَفْتِيهِ فَجَعَلَ الْفَضْلُ يَنْظُرُ إِلَيْهَا وَتَنْظُرُ إِلَيْهِ فَجَعَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَصْرِفُ وَجْهَ الْفَضْلِ إِلَى الشِّقِّ الآخَرِ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ فَرِيضَةَ اللَّهِ فِي الْحَجِّ أَدْرَكَتْ أَبِي شَيْخًا كَبِيرًا لاَ يَسْتَطِيعُ أَنْ يَثْبُتَ عَلَى الرَّاحِلَةِ أَفَأَحُجُّ عَنْهُ قَالَ ‏\n\"‏ نَعَمْ ‏\"‏ ‏.‏ وَذَلِكَ فِي حَجَّةِ الْوَدَاعِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Sulayman ibn\nYasar that Abdullah ibn Abbas said, \"Al-Fadl ibn Abbas was riding\nbehind the Messenger of Allah, may Allah bless him and grant him\npeace, when a woman from the Khathama tribe came to him to ask him for\na fatwa. Al-Fadl began to look at her, and she at him, and the\nMessenger of Allah, may Allah bless him and grant him peace, turned\nFadl's face away to the other side. The woman said, 'Messenger of\nAllah, Allah's making the hajj obligatory finds my father a very old\nman, unable to stay firm on his riding-beast. Can I do hajj for him?',\nand he said, 'Yes.' This was during the farewell hajj.\""}},{"id":100,"idInBook":100,"chapterId":20,"bookId":7,"arabic":"","english":{"narrator":"","text":"Yahya related to me that Malik said, \"Someone whose passage to\nthe House is blocked by an enemy is freed from every restriction of\nihram, and should sacrifice his animal and shave his head wherever he\nhas been detained, and there is nothing for him to make up\nafterwards.\"\n\n\nYahya related to me from Malik that he had heard\nthat when the Messenger of Allah, may Allah bless him and grant him\npeace, and his companions came out of ihram at al-Hudaybiya they\nsacrificed their sacrificial animals and shaved their heads, and were\nfreed from all the restrictions of ihram without having done tawaf of\nthe House and without their sacrificial animals reaching the Kaba.\n\n\nThere is nothing known about the Messenger of Allah, may\nAllah bless him and grant him peace, ever telling any of his\ncompanions, or anybody else that was with him, to make up for anything\nthey had missed or to go back to doing anything they had not finished\ndoing."}},{"id":101,"idInBook":101,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم حَلَّ هُوَ وَأَصْحَابُهُ بِالْحُدَيْبِيَةِ فَنَحَرُوا الْهَدْىَ وَحَلَقُوا رُءُوسَهُمْ وَحَلُّوا مِنْ كُلِّ شَىْءٍ قَبْلَ أَنْ يَطُوفُوا بِالْبَيْتِ وَقَبْلَ أَنْ يَصِلَ إِلَيْهِ الْهَدْىُ ثُمَّ لَمْ يُعْلَمْ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَمَرَ أَحَدًا مِنْ أَصْحَابِهِ وَلاَ مِمَّنْ كَانَ مَعَهُ أَنْ يَقْضُوا شَيْئًا وَلاَ يَعُودُوا لِشَىْءٍ ‏.‏","english":{"narrator":"","text":""}},{"id":102,"idInBook":102,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ قَالَ حِينَ خَرَجَ إِلَى مَكَّةَ مُعْتِمَرًا فِي الْفِتْنَةِ إِنْ صُدِدْتُ عَنِ الْبَيْتِ صَنَعْنَا كَمَا صَنَعْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَهَلَّ بِعُمْرَةٍ مِنْ أَجْلِ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَهَلَّ بِعُمْرَةٍ عَامَ الْحُدَيْبِيَةِ ثُمَّ إِنَّ عَبْدَ اللَّهِ نَظَرَ فِي أَمْرِهِ فَقَالَ مَا أَمْرُهُمَا إِلاَّ وَاحِدٌ ثُمَّ الْتَفَتَ إِلَى أَصْحَابِهِ فَقَالَ مَا أَمْرُهُمَا إِلاَّ وَاحِدٌ أُشْهِدُكُمْ أَنِّي قَدْ أَوْجَبْتُ الْحَجَّ مَعَ الْعُمْرَةِ ‏.‏ ثُمَّ نَفَذَ حَتَّى جَاءَ الْبَيْتَ فَطَافَ طَوَافًا وَاحِدًا وَرَأَى ذَلِكَ مُجْزِيًا عَنْهُ وَأَهْدَى ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that when Abdullah ibn\nUmar set out for Makka during the troubles (between al-Hajjaj ibn\nYusuf and Zubair ibn al-Awwam) he said, \"If I am blocked from going to\nthe House we shall do what we did when we were with the Messenger of\nAllah, may Allah bless him and grant him peace,\" and he went into\nihram for umra, because that was what the Messenger of Allah, may\nAllah bless him and grant him peace, did in the year of al-Hudaybiya.\n\n\nBut afterwards, he reconsidered his position and said, \"It is\nthe same either way.\" After that he turned to his companions and said,\n\"It is the same either way. I call you to witness that I have decided\nin favour of hajj and umra together.\"\n\n\nHe then got through to\nthe House (without being stopped) and did one set of tawaf, which he\nconsidered to be enough for himself, and sacrificed an animal.\n\n\nMalik said, \"This is what we go by if someone is hindered by an\nenemy, as the Prophet, may Allah bless him and grant him peace, and\nhis companions were. If some one is hindered by anything other than an\nenemy, he is only freed from ihram by tawaf of the House. \""}},{"id":103,"idInBook":103,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ قَالَ الْمُحْصَرُ بِمَرَضٍ لاَ يَحِلُّ حَتَّى يَطُوفَ بِالْبَيْتِ وَيَسْعَى بَيْنَ الصَّفَا وَالْمَرْوَةِ فَإِذَا اضْطُرَّ إِلَى لُبْسِ شَىْءٍ مِنَ الثِّيَابِ الَّتِي لاَ بُدَّ لَهُ مِنْهَا أَوِ الدَّوَاءِ صَنَعَ ذَلِكَ وَافْتَدَى ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Salim ibn\nAbdullah that Abdullah ibn Umar said, \"Someone who is held back from\ngoing to the House by illness can only come out of ihram after he has\ndone tawaf of the House and say between Safa and Marwa. If it is\nabsolutely necessary for him to wear any ordinary clothes, or undergo\nmedical treatment, he should do that and pay compensation for it.\""}},{"id":104,"idInBook":104,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ بَلَغَهُ عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا كَانَتْ تَقُولُ الْمُحْرِمُ لاَ يُحِلُّهُ إِلاَّ الْبَيْتُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said that he had\nheard that A'isha, the wife of the Prophet, may Allah bless him and\ngrant him peace, used to say, \"Only the House frees a person in ihram\nfrom ihram.\""}},{"id":105,"idInBook":105,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَيُّوبَ بْنِ أَبِي تَمِيمَةَ السَّخْتِيَانِيِّ، عَنْ رَجُلٍ، مِنْ أَهْلِ الْبَصْرَةِ كَانَ قَدِيمًا أَنَّهُ قَالَ خَرَجْتُ إِلَى مَكَّةَ حَتَّى إِذَا كُنْتُ بِبَعْضِ الطَّرِيقِ كُسِرَتْ فَخِذِي فَأَرْسَلْتُ إِلَى مَكَّةَ وَبِهَا عَبْدُ اللَّهِ بْنُ عَبَّاسٍ وَعَبْدُ اللَّهِ بْنُ عُمَرَ وَالنَّاسُ فَلَمْ يُرَخِّصْ لِي أَحَدٌ أَنْ أَحِلَّ فَأَقَمْتُ عَلَى ذَلِكَ الْمَاءِ سَبْعَةَ أَشْهُرٍ حَتَّى أَحْلَلْتُ بِعُمْرَةٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ayyub ibn Abi Tamima as-\nSakhtayani that a very old man from Basra once said to him, \"I set out\nfor Makka but on the way there I broke my thigh, so I sent a message\non to Makka Abdullah ibn Abbas and Abdullah ibn Umar and the people\nwere there, but no-one allowed me to leave ihram, and I stayed there\nfor seven months until I left ihram by doing an umra.''"}},{"id":106,"idInBook":106,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ قَالَ مَنْ حُبِسَ دُونَ الْبَيْتِ بِمَرَضٍ فَإِنَّهُ لاَ يَحِلُّ حَتَّى يَطُوفَ بِالْبَيْتِ وَبَيْنَ الصَّفَا وَالْمَرْوَةِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Salim ibn\nAbdullah that Abdullah ibn Umar said, \"Some one who is detained by\nsickness before he has got to the House cannot leave ihram until he\nhas done tawaf of the House and say between Safa and Marwa.\""}},{"id":107,"idInBook":107,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، أَنَّ مَعْبَدَ بْنَ حُزَابَةَ الْمَخْزُومِيَّ، صُرِعَ بِبَعْضِ طَرِيقِ مَكَّةَ وَهُوَ مُحْرِمٌ فَسَأَلَ مَنْ يَلِي عَلَى الْمَاءِ الَّذِي كَانَ عَلَيْهِ فَوَجَدَ عَبْدَ اللَّهِ بْنَ عُمَرَ وَعَبْدَ اللَّهِ بْنَ الزُّبَيْرِ وَمَرْوَانَ بْنَ الْحَكَمِ فَذَكَرَ لَهُمُ الَّذِي عَرَضَ لَهُ فَكُلُّهُمْ أَمَرَهُ أَنْ يَتَدَاوَى بِمَا لاَ بُدَّ لَهُ مِنْهُ وَيَفْتَدِيَ فَإِذَا صَحَّ اعْتَمَرَ فَحَلَّ مِنْ إِحْرَامِهِ ثُمَّ عَلَيْهِ حَجُّ قَابِلٍ وَيُهْدِي مَا اسْتَيْسَرَ مِنَ الْهَدْىِ ‏.‏ قَالَ مَالِكٌ وَعَلَى هَذَا الأَمْرُ عِنْدَنَا فِيمَنْ أُحْصِرَ بِغَيْرِ عَدُوٍّ وَقَدْ أَمَرَ عُمَرُ بْنُ الْخَطَّابِ أَبَا أَيُّوبَ الأَنْصَارِيَّ وَهَبَّارَ بْنَ الأَسْوَدِ حِينَ فَاتَهُمَا الْحَجُّ وَأَتَيَا يَوْمَ النَّحْرِ أَنْ يَحِلاَّ بِعُمْرَةٍ ثُمَّ يَرْجِعَا حَلاَلاً ثُمَّ يَحُجَّانِ عَامًا قَابِلاً وَيُهْدِيَانِ فَمَنْ لَمْ يَجِدْ فَصِيَامُ ثَلاَثَةِ أَيَّامٍ فِي الْحَجِّ وَسَبْعَةٍ إِذَا رَجَعَ إِلَى أَهْلِهِ ‏.‏ قَالَ مَالِكٌ وَكُلُّ مَنْ حُبِسَ عَنِ الْحَجِّ بَعْدَ مَا يُحْرِمُ إِمَّا بِمَرَضٍ أَوْ بِغَيْرِهِ أَوْ بِخَطَإٍ مِنَ الْعَدَدِ أَوْ خَفِيَ عَلَيْهِ الْهِلاَلُ فَهُوَ مُحْصَرٌ عَلَيْهِ مَا عَلَى الْمُحْصَرِ ‏.‏ قَالَ يَحْيَى سُئِلَ مَالِكٌ عَمَّنْ أَهَلَّ مِنْ أَهْلِ مَكَّةَ بِالْحَجِّ ثُمَّ أَصَابَهُ كَسْرٌ أَوْ بَطْنٌ مُتَحَرِّقٌ أَوِ امْرَأَةٌ تَطْلُقُ ‏.‏ قَالَ مَنْ أَصَابَهُ هَذَا مِنْهُمْ فَهُوَ مُحْصَرٌ يَكُونُ عَلَيْهِ مِثْلُ مَا عَلَى أَهْلِ الآفَاقِ إِذَا هُمْ أُحْصِرُوا ‏.‏ قَالَ مَالِكٌ فِي رَجُلٍ قَدِمَ مُعْتَمِرًا فِي أَشْهُرِ الْحَجِّ حَتَّى إِذَا قَضَى عُمْرَتَهُ أَهَلَّ بِالْحَجِّ مِنْ مَكَّةَ ثُمَّ كُسِرَ أَوْ أَصَابَهُ أَمْرٌ لاَ يَقْدِرُ عَلَى أَنْ يَحْضُرَ مَعَ النَّاسِ الْمَوْقِفَ ‏.‏ قَالَ مَالِكٌ أَرَى أَنْ يُقِيمَ حَتَّى إِذَا بَرَأَ خَرَجَ إِلَى الْحِلِّ ثُمَّ يَرْجِعُ إِلَى مَكَّةَ فَيَطُوفُ بِالْبَيْتِ وَيَسْعَى بَيْنَ الصَّفَا وَالْمَرْوَةِ ثُمَّ يَحِلُّ ثُمَّ عَلَيْهِ حَجُّ قَابِلٍ وَالْهَدْىُ ‏.‏ قَالَ مَالِكٌ فِيمَنْ أَهَلَّ بِالْحَجِّ مِنْ مَكَّةَ ثُمَّ طَافَ بِالْبَيْتِ وَسَعَى بَيْنَ الصَّفَا وَالْمَرْوَةِ ثُمَّ مَرِضَ فَلَمْ يَسْتَطِعْ أَنْ يَحْضُرَ مَعَ النَّاسِ الْمَوْقِفَ ‏.‏ قَالَ مَالِكٌ إِذَا فَاتَهُ الْحَجُّ فَإِنِ اسْتَطَاعَ خَرَجَ إِلَى الْحِلِّ فَدَخَلَ بِعُمْرَةٍ فَطَافَ بِالْبَيْتِ وَسَعَى بَيْنَ الصَّفَا وَالْمَرْوَةِ لأَنَّ الطَّوَافَ الأَوَّلَ لَمْ يَكُنْ نَوَاهُ لِلْعُمْرَةِ فَلِذَلِكَ يَعْمَلُ بِهَذَا وَعَلَيْهِ حَجُّ قَابِلٍ وَالْهَدْىُ ‏.‏ فَإِنْ كَانَ مِنْ غَيْرِ أَهْلِ مَكَّةَ فَأَصَابَهُ مَرَضٌ حَالَ بَيْنَهُ وَبَيْنَ الْحَجِّ فَطَافَ بِالْبَيْتِ وَسَعَى بَيْنَ الصَّفَا وَالْمَرْوَةِ حَلَّ بِعُمْرَةٍ وَطَافَ بِالْبَيْتِ طَوَافًا آخَرَ وَسَعَى بَيْنَ الصَّفَا وَالْمَرْوَةِ لأَنَّ طَوَافَهُ الأَوَّلَ وَسَعْيَهُ إِنَّمَا كَانَ نَوَاهُ لِلْحَجِّ وَعَلَيْهِ حَجُّ قَابِلٍ وَالْهَدْىُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said from Sulayman ibn\nYasar that Said ibn Huzaba al-Makhzumi was thrown off his mount while\nhe was in ihram on the road to Makka. He asked after the person in\ncharge of the relay station where he was injured and he found Abdullah\nibn Umar, Abdullah ibn az-Zubayr and Marwan ibn al-Hakam there. He\ntold them what had happened to him and all of them said that he should\ntake whatever medicine he had to take and pay compensation for it.\nThen, when he got better again, he should do umra and come out of his\nihram, after which he had to do hajj another year and to offer\nwhatever sacrificial animal he was able to in the future.\n\n\nMalik said, \"This is what we do here (in Madina) if someone is\ndetained by something other than an enemy. And when Abu Ayyub al-\nAnsari and Habbar ibn al-Aswad came to the day of the sacrifice and\nhad missed the hajj, Umar ibn al-Khattab told them to come out of\nihram by doing umra and then to go home free of ihram and do hajj some\ntime in the future and to sacrifice an animal, or, if they could not\nfind one, to fast three days during the hajj and seven days after they\nhad returned to their families.\"\n\n\nMalik said, \"Anyone who is\ndetained from doing hajj after he has gone into ihram, whether by\nillness or otherwise, or by an error in calculating the month or\nbecause the new moon is concealed from him is in the same position as\nsome one who is hindered from doing the hajj and must do the same as\nhe does.\"\n\n\nYahya said that Malik was asked about the situation\nof someone from Makka who went into ihram for hajj and then broke a\nbone or had severe stomach pain, or of a woman who was in labour, and\nhe said, \"Someone to whom this happens is in the same situation as one\nwho is hindered from doing the hajj, and he must do the same as people\nfrom outlying regions do when they are hindered from doing the hajj.\"\n\n\nMalik said, about someone who arrived in the months of the\nhajj with the intention of doing umra, and completed his umra and went\ninto ihram in Makka to do hajj, and then broke a bone or something\nelse happened to him which stopped him from being present at Arafa\nwith everybody else, \"I think that he should stay where he is until he\nis better and then go outside the area of the Haram, and then return\nto Makka and do tawaf of the House and say between Safa and Marwa, and\nthen leave ihram. He must then do hajj again another year and offer a\nsacrificial animal .\"\n\n\nMalik said, about someone who left\nihram in Makka, and then did tawaf of the House and say between Safa\nand Marwa, and then fell ill and was unable to be present with\neverybody at Arafa, \"If the hajj passes someone by he should, if he\ncan, go out of the area of the Haram and then come back in again to do\numra and do tawaf of the House and say between Safa and Marwa, because\nhe had not intended his initial tawaf to be for an umra, and so for\nthis reason he does it again. He must do the next hajj and offer a\nsacrificial animal.\n\n\nIf he is not one of the people of Makka,\nand something happens to him which stops him from doing the hajj, but\nhe does tawaf of the House and say between Safa and Marwa, he should\ncome out of ihram by doing an umra and then do tawaf of the House a\nsecond time, and say between Safa and Marwa, because his initial tawaf\nand say were intended for the hajj. He must do the next hajj and offer\na sacrificial animal.\""}},{"id":108,"idInBook":108,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ مُحَمَّدِ بْنِ أَبِي بَكْرٍ الصِّدِّيقِ، أَخْبَرَ عَبْدَ اللَّهِ بْنَ عُمَرَ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ أَلَمْ تَرَىْ أَنَّ قَوْمَكِ حِينَ بَنَوُا الْكَعْبَةَ اقْتَصَرُوا عَنْ قَوَاعِدِ إِبْرَاهِيمَ ‏\"‏ ‏.‏ قَالَتْ فَقُلْتُ يَا رَسُولَ اللَّهِ أَفَلاَ تَرُدُّهَا عَلَى قَوَاعِدِ إِبْرَاهِيمَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَوْلاَ حِدْثَانُ قَوْمِكِ بِالْكُفْرِ لَفَعَلْتُ ‏\"‏ ‏.‏ قَالَ فَقَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ لَئِنْ كَانَتْ عَائِشَةُ سَمِعَتْ هَذَا مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم مَا أُرَى رَسُولَ اللَّهِ صلى الله عليه وسلم تَرَكَ اسْتِلاَمَ الرُّكْنَيْنِ اللَّذَيْنِ يَلِيَانِ الْحِجْرَ إِلاَّ أَنَّ الْبَيْتَ لَمْ يُتَمَّمْ عَلَى قَوَاعِدِ إِبْرَاهِيمَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Salim ibn\nAbdullah that Abdullah ibn Muhammad ibn Abi Bakras-Siddiq told\nAbdullah ibn Umar from A'isha, that the Prophet, may Allah bless him\nand grant him peace, said, \"Don't you see that when your people built\nthe Kaba they fell short of the foundations of Ibrahim?\" A'isha said,\n\"Messenger of Allah, won't you return it to the foundations of\nIbrahim?\" and the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"If it were not that your people have only recently\nleft kufr, I would have done so.\"\n\n\nSalim ibn Abdullah said\nthat Abdullah ibn Umar said, \"If A'isha heard this from the Messenger\nof Allah, may Allah bless him and grant him peace, then I consider\nthat the Messenger of Allah, may Allah bless him and grant him peace,\nonly refrained from greeting the two corners which are adjacent to the\nHijr because the House had not been completed on the foundations of\nIbrahim.\" (i.e. the corners he did not touch were not the original\ncorners of the Kaba) ."}},{"id":109,"idInBook":109,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّ عَائِشَةَ أُمَّ الْمُؤْمِنِينَ، قَالَتْ مَا أُبَالِي أَصَلَّيْتُ فِي الْحِجْرِ أَمْ فِي الْبَيْتِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa from his\nfather that A'isha, umm al-muminin, said, \"I do not mind whether I\npray in the Hijr or in the House.\" (i.e. praying in the Hijr is the\nsame as praying in the House)."}},{"id":110,"idInBook":110,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ سَمِعَ ابْنَ شِهَابٍ، يَقُولُ سَمِعْتُ بَعْضَ، عُلَمَائِنَا يَقُولُ مَا حُجِرَ الْحِجْرُ فَطَافَ النَّاسُ مِنْ وَرَائِهِ إِلاَّ إِرَادَةَ أَنْ يَسْتَوْعِبَ النَّاسُ الطَّوَافَ بِالْبَيْتِ كُلِّهِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he heard Ibn Shihab say that\nhe had heard one of the people of knowledge say that the Hijr was only\nenclosed so that people would go beyond it as they were making tawaf,\nand their tawaf would therefore encompass the original House."}},{"id":111,"idInBook":111,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ، عَنْ أَبِيهِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّهُ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم رَمَلَ مِنَ الْحَجَرِ الأَسْوَدِ حَتَّى انْتَهَى إِلَيْهِ ثَلاَثَةَ أَطْوَافٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Jafar ibn Muhammad from his\nfather that Jabir ibn Abdullah said, \"I saw the Messenger of Allah,\nmay Allah bless him and grant him peace, hastening from the Black\nStone until he reached it again, three times.\"\n\n\nMalik said,\n\"This is what is still done by the people of knowledge in our city.\""}},{"id":112,"idInBook":112,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَرْمُلُ مِنَ الْحَجَرِ الأَسْوَدِ إِلَى الْحَجَرِ الأَسْوَدِ ثَلاَثَةَ أَطْوَافٍ وَيَمْشِي أَرْبَعَةَ أَطْوَافٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nused to hasten from the Black Stone round to the Black Stone three\ntimes and then would walk four circuits normally."}},{"id":113,"idInBook":113,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، أَنَّ أَبَاهُ، كَانَ إِذَا طَافَ بِالْبَيْتِ يَسْعَى الأَشْوَاطَ الثَّلاَثَةَ يَقُولُ اللَّهُمَّ لاَ إِلَهَ إِلاَّ أَنْتَا وَأَنْتَ تُحْيِي بَعْدَ مَا أَمَتَّا يَخْفِضُ صَوْتَهُ بِذَلِكَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa that when his\nfather did tawaf of the House he would hasten in the first three\ncircuits and say in a low voice, \"O Allah, there is no god but You,\nand You bring to life after You have made to die.\"\n\n\nAllahumma\nla ilaha illa anta, wa anta tuhyi badama amatta."}},{"id":114,"idInBook":114,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّهُ رَأَى عَبْدَ اللَّهِ بْنَ الزُّبَيْرِ أَحْرَمَ بِعُمْرَةٍ مِنَ التَّنْعِيمِ - قَالَ - ثُمَّ رَأَيْتُهُ يَسْعَى حَوْلَ الْبَيْتِ الأَشْوَاطَ الثَّلاَثَةَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa from his\nfather that he saw Abdullah ibn az-Zubayr go into ihram for umra at\nat-Tanim.\n\n\nHe said, \"Then I saw him hasten around the House\nfor three circuits.\""}},{"id":115,"idInBook":115,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ إِذَا أَحْرَمَ مِنْ مَكَّةَ لَمْ يَطُفْ بِالْبَيْتِ وَلاَ بَيْنَ الصَّفَا وَالْمَرْوَةِ حَتَّى يَرْجِعَ مِنْ مِنًى وَكَانَ لاَ يَرْمُلُ إِذَا طَافَ حَوْلَ الْبَيْتِ إِذَا أَحْرَمَ مِنْ مَكَّةَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nnever used to do tawaf of the House or say between Safa and Marwa if\nhe went into ihram in Makka until he had returned from Mina, nor would\nhe hasten when doing tawaf of the House if he went into ihram in\nMakka."}},{"id":116,"idInBook":116,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا قَضَى طَوَافَهُ بِالْبَيْتِ وَرَكَعَ الرَّكْعَتَيْنِ وَأَرَادَ أَنْ يَخْرُجَ إِلَى الصَّفَا وَالْمَرْوَةِ اسْتَلَمَ الرُّكْنَ الأَسْوَدَ قَبْلَ أَنْ يَخْرُجَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that when the\nMessenger of Allah, may Allah bless him and grant him peace, had\nfinished his tawaf of the House, prayed two rakas, and wanted to go to\nSafa and Marwa, he would salute the corner of the Black Stone before\nhe left."}},{"id":117,"idInBook":117,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّهُ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِعَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ ‏\"‏ كَيْفَ صَنَعْتَ يَا أَبَا مُحَمَّدٍ فِي اسْتِلاَمِ الرُّكْنِ ‏\"‏ ‏.‏ فَقَالَ عَبْدُ الرَّحْمَنِ اسْتَلَمْتُ وَتَرَكْتُ ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَصَبْتَ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa that his\nfather said that the Messenger of Allah, may Allah bless him and grant\nhim peace, once said to Abd ar-Rahman ibn Awf, \"What do you do, Abu\nMuhammad, when saluting the corner?\" and Abd ar-Rahman said,\n\"Sometimes I salute it, and sometimes I don't.\" The Messenger of\nAllah, may Allah bless him and grant him peace, said, \"You are right.\""}},{"id":118,"idInBook":118,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، أَنَّ أَبَاهُ، كَانَ إِذَا طَافَ بِالْبَيْتِ يَسْتَلِمُ الأَرْكَانَ كُلَّهَا وَكَانَ لاَ يَدَعُ الْيَمَانِيَ إِلاَّ أَنْ يُغْلَبَ عَلَيْهِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa that his\nfather used to salute all the corners when he did tawaf of the House\nand did not omit the Yamani corner unless he was prevented from it."}},{"id":119,"idInBook":119,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ وَهُوَ يَطُوفُ بِالْبَيْتِ لِلرُّكْنِ الأَسْوَدِ إِنَّمَا أَنْتَ حَجَرٌ وَلَوْلاَ أَنِّي رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم قَبَّلَكَ مَا قَبَّلْتُكَ ثُمَّ قَبَّلَهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa from his\nfather that Umar ibn al-Khattab said to the corner of the Black Stone\nwhile he was doing tawaf of the House, \"You are only a stone, and if I\nhad not seen the Messenger of Allah, may Allah bless him and grant him\npeace, kiss you, I would not do so.\"  Then he kissed it.\n\n\nMalik said, \"I have heard some of the people of knowledge recommending\nsomeone doing tawaf of the House to put his hand to his mouth when he\ntakes it from the Yamani corner.\""}},{"id":120,"idInBook":120,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّهُ كَانَ لاَ يَجْمَعُ بَيْنَ السُّبْعَيْنِ لاَ يُصَلِّي بَيْنَهُمَا وَلَكِنَّهُ كَانَ يُصَلِّي بَعْدَ كُلِّ سُبْعٍ رَكْعَتَيْنِ فَرُبَّمَا صَلَّى عِنْدَ الْمَقَامِ أَوْ عِنْدَ غَيْرِهِ ‏.‏ وَسُئِلَ مَالِكٌ عَنِ الطَّوَافِ إِنْ كَانَ أَخَفَّ عَلَى الرَّجُلِ أَنْ يَتَطَوَّعَ بِهِ فَيَقْرُنَ بَيْنَ الأُسْبُوعَيْنِ أَوْ أَكْثَرَ ثُمَّ يَرْكَعُ مَا عَلَيْهِ مِنْ رُكُوعِ تِلْكَ السُّبُوعِ قَالَ لاَ يَنْبَغِي ذَلِكَ وَإِنَّمَا السُّنَّةُ أَنْ يُتْبِعَ كُلَّ سُبْعٍ رَكْعَتَيْنِ ‏.‏ قَالَ مَالِكٌ فِي الرَّجُلِ يَدْخُلُ فِي الطَّوَافِ فَيَسْهُو حَتَّى يَطُوفَ ثَمَانِيَةَ أَوْ تِسْعَةَ أَطْوَافٍ قَالَ يَقْطَعُ إِذَا عَلِمَ أَنَّهُ قَدْ زَادَ ثُمَّ يُصَلِّي رَكْعَتَيْنِ وَلاَ يَعْتَدُّ بِالَّذِي كَانَ زَادَ وَلاَ يَنْبَغِي لَهُ أَنْ يَبْنِيَ عَلَى التِّسْعَةِ حَتَّى يُصَلِّيَ سُبْعَيْنِ جَمِيعًا لأَنَّ السُّنَّةَ فِي الطَّوَافِ أَنْ يُتْبِعَ كُلَّ سُبْعٍ رَكْعَتَيْنِ ‏.‏ قَالَ مَالِكٌ وَمَنْ شَكَّ فِي طَوَافِهِ بَعْدَ مَا يَرْكَعُ رَكْعَتَىِ الطَّوَافِ فَلْيَعُدْ فَلْيُتَمِّمْ طَوَافَهُ عَلَى الْيَقِينِ ثُمَّ لِيُعِدِ الرَّكْعَتَيْنِ لأَنَّهُ لاَ صَلاَةَ لِطَوَافٍ إِلاَّ بَعْدَ إِكْمَالِ السُّبْعِ ‏.‏ وَمَنْ أَصَابَهُ شَىْءٌ بِنَقْضِ وُضُوئِهِ وَهُوَ يَطُوفُ بِالْبَيْتِ أَوْ يَسْعَى بَيْنَ الصَّفَا وَالْمَرْوَةِ أَوْ بَيْنَ ذَلِكَ فَإِنَّهُ مَنْ أَصَابَهُ ذَلِكَ وَقَدْ طَافَ بَعْضَ الطَّوَافِ أَوْ كُلَّهُ وَلَمْ يَرْكَعْ رَكْعَتَىِ الطَّوَافِ فَإِنَّهُ يَتَوَضَّأُ وَيَسْتَأْنِفُ الطَّوَافَ وَالرَّكْعَتَيْنِ وَأَمَّا السَّعْىُ بَيْنَ الصَّفَا وَالْمَرْوَةِ فَإِنَّهُ لاَ يَقْطَعُ ذَلِكَ عَلَيْهِ مَا أَصَابَهُ مِنِ انْتِقَاضِ وُضُوئِهِ وَلاَ يَدْخُلُ السَّعْىَ إِلاَّ وَهُوَ طَاهِرٌ بِوُضُوءٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa that his\nfather would never do two sets of seven tawafs together without\npraying between them. After every seven tawafs he would pray two\nrakas, sometimes at the maqam of Ibrahim, and sometimes elsewhere.\n\n\nMalik was asked whether a man doing voluntary tawaf could, to\nmake it easier on himself, join two or more sets of seven circuits and\nthen pray whatever he owed for those sets of seven, and he said, \"He\nshould not do that. The sunna is that he does two rakasafter every\nseven circuits.\"\n\n\nMalik said, about someone who began doing\ntawaf and then forgot how many he had done and did eightor nine\ncircuits, \"He should stop when he knows that he has done more than the\nright number and then pray two rakas,and he should not count the ones\nthat he has done in excess. Neither should he build on the nine that\nhe has done and then pray the rakas for the two sets of seven circuits\ntogether, because the sunna is that you pray two rakas after every\nseven circuits.\"\n\n\nMalik said that someone who was in doubt\nabout his tawaf after he had prayed the two rakas of tawaf should go\nback and complete his tawaf until he was certain of how much he had\ndone. He should then repeat the two rakas, because prayer when doing\ntawaf was only valid after completing seven circuits.\n\n\n\"If\nsome one breaks his wudu either while he is doing tawaf, or when he\nhas finished tawaf but before he has prayed the two rakas of tawaf, he\nshould do wudu and begin the tawaf and the two rakas afresh. Breaking\nwudu does not interrupt say between Safa and Marwa, but a person\nshould not begin say unless he is pure by being in wudu.\""}},{"id":121,"idInBook":121,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ عَبْدٍ الْقَارِيَّ، أَخْبَرَهُ أَنَّهُ، طَافَ بِالْبَيْتِ مَعَ عُمَرَ بْنِ الْخَطَّابِ بَعْدَ صَلاَةِ الصُّبْحِ فَلَمَّا قَضَى عُمَرُ طَوَافَهُ نَظَرَ فَلَمْ يَرَ الشَّمْسَ طَلَعَتْ فَرَكِبَ حَتَّى أَنَاخَ بِذِي طُوًى فَصَلَّى رَكْعَتَيْنِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Humayd ibn\nAbd ar-Rahman ibn Awf that Abd ar-Rahman ibn Abd al-Qari mentioned to\nhim that he once did tawaf of the House with Umar ibn al-Khattab after\nsubh and when Umar had finished his tawaf he looked and saw that the\nsun had not yet risen, so he rode on until he made his camel kneel at\nDhu Tuwa, and he prayed two rakas."}},{"id":122,"idInBook":122,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزُّبَيْرِ الْمَكِّيِّ، أَنَّهُ قَالَ رَأَيْتُ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ يَطُوفُ بَعْدَ صَلاَةِ الْعَصْرِ ثُمَّ يَدْخُلُ حُجْرَتَهُ فَلاَ أَدْرِي مَا يَصْنَعُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Abu'z Zubayr al-Makki said,\n\"I saw Abdullah ibn Abbas doing tawaf after asr. Then he went into his\nroom and I do not know what he did.\""}},{"id":123,"idInBook":123,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزُّبَيْرِ الْمَكِّيِّ، أَنَّهُ قَالَ لَقَدْ رَأَيْتُ الْبَيْتَ يَخْلُو بَعْدَ صَلاَةِ الصُّبْحِ وَبَعْدَ صَلاَةِ الْعَصْرِ مَا يَطُوفُ بِهِ أَحَدٌ ‏.‏ قَالَ مَالِكٌ وَمَنْ طَافَ بِالْبَيْتِ بَعْضَ أُسْبُوعِهِ ثُمَّ أُقِيمَتْ صَلاَةُ الصُّبْحِ أَوْ صَلاَةُ الْعَصْرِ فَإِنَّهُ يُصَلِّي مَعَ الإِمَامِ ثُمَّ يَبْنِي عَلَى مَا طَافَ حَتَّى يُكْمِلَ سُبْعًا ثُمَّ لاَ يُصَلِّي حَتَّى تَطْلُعَ الشَّمْسُ أَوْ تَغْرُبَ ‏.‏ قَالَ وَإِنْ أَخَّرَهُمَا حَتَّى يُصَلِّيَ الْمَغْرِبَ فَلاَ بَأْسَ بِذَلِكَ ‏.‏ قَالَ مَالِكٌ وَلاَ بَأْسَ أَنْ يَطُوفَ الرَّجُلُ طَوَافًا وَاحِدًا بَعْدَ الصُّبْحِ وَبَعْدَ الْعَصْرِ لاَ يَزِيدُ عَلَى سُبْعٍ وَاحِدٍ وَيُؤَخِّرُ الرَّكْعَتَيْنِ حَتَّى تَطْلُعَ الشَّمْسُ كَمَا صَنَعَ عُمَرُ بْنُ الْخَطَّابِ وَيُؤَخِّرُهُمَا بَعْدَ الْعَصْرِ حَتَّى تَغْرُبَ الشَّمْسُ فَإِذَا غَرَبَتِ الشَّمْسُ صَلاَّهُمَا إِنْ شَاءَ وَإِنْ شَاءَ أَخَّرَهُمَا حَتَّى يُصَلِّيَ الْمَغْرِبَ لاَ بَأْسَ بِذَلِكَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Abu'z-Zubayr al-Makki said,\n\"I saw the House deserted both after subh and asr, with no-one doing\ntawaf.\"\n\n\nMalik said, \"If someone does some of his circuits and\nthen the subh or asr prayer is begun, he should pray with the imam and\nthen complete the rest of his circuits but should not pray at all\nuntil the sun has either risen or set \"\n\n\nHe added, \"There is\nno harm in delaying the two rakas until after he has prayed maghrib.\"\n\n\nMalik said, \"There is no harm in someone doing a single tawaf\nafter subh or after asr, not to do more than one group of seven\ncircuits, and then as long as he delays the two rakas until after the\nsun has risen, as Umar ibn al-Khattab did, or he delays them until\nafter the sun has set if it is after asr. Then when the sun has set he\ncan pray them if he wants, or, if he wants, he can delay them until\nafter he has prayed maghrib. There is no harm in that.\""}},{"id":124,"idInBook":124,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ لاَ يَصْدُرَنَّ أَحَدٌ مِنَ الْحَاجِّ حَتَّى يَطُوفَ بِالْبَيْتِ فَإِنَّ آخِرَ النُّسُكِ الطَّوَافُ بِالْبَيْتِ ‏.‏ قَالَ مَالِكٌ فِي قَوْلِ عُمَرَ بْنِ الْخَطَّابِ فَإِنَّ آخِرَ النُّسُكِ الطَّوَافُ بِالْبَيْتِ إِنَّ ذَلِكَ - فِيمَا نُرَى وَاللَّهُ أَعْلَمُ - لِقَوْلِ اللَّهِ تَبَارَكَ وَتَعَالَى ‏{‏وَمَنْ يُعَظِّمْ شَعَائِرَ اللَّهِ فَإِنَّهَا مِنْ تَقْوَى الْقُلُوبِ‏}‏ وَقَالَ ‏{‏ثُمَّ مَحِلُّهَا إِلَى الْبَيْتِ الْعَتِيقِ‏}‏ فَمَحِلُّ الشَّعَائِرِ كُلِّهَا وَانْقِضَاؤُهَا إِلَى الْبَيْتِ الْعَتِيقِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat Umar ibn al-Khattab said, \"No-one should leave the hajj until he\nhas done tawaf of the House, and tawaf of the House is the final\nrite.\"\n\n\nMalik said, commenting about Umar ibn al-Khattab's\nsaying 'tawaf of the House is the final rite,' \"In our opinion, and\nAllah knows best, that is because Allah, the Blessed and Exalted,\nsays, 'Whoever exalts the rituals of Allah - that is from the taqwa of\nthe hearts' (Sura 22 ayat 32), and He says, 'Then their halal place\n(of sacrifice) is at the Ancient House,' and the place of all the\nrituals and where they end is therefore at the Ancient House.\""}},{"id":125,"idInBook":125,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، ‏.‏ أَنَّ عُمَرَ بْنَ الْخَطَّابِ، رَدَّ رَجُلاً مِنْ مَرِّ الظَّهْرَانِ لَمْ يَكُنْ وَدَّعَ الْبَيْتَ حَتَّى وَدَّعَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said that Umar ibn\nal-Khattab refused to let one man who had not taken leave of the House\npass adh-Dhahran, (a valley eighteen miles from Makka) until he had\ntaken leave of it."}},{"id":126,"idInBook":126,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّهُ قَالَ مَنْ أَفَاضَ فَقَدْ قَضَى اللَّهُ حَجَّهُ فَإِنَّهُ إِنْ لَمْ يَكُنْ حَبَسَهُ شَىْءٌ فَهُوَ حَقِيقٌ أَنْ يَكُونَ آخِرُ عَهْدِهِ الطَّوَافَ بِالْبَيْتِ وَإِنْ حَبَسَهُ شَىْءٌ أَوْ عَرَضَ لَهُ فَقَدْ قَضَى اللَّهُ حَجَّهُ ‏.‏ قَالَ مَالِكٌ وَلَوْ أَنَّ رَجُلاً جَهِلَ أَنْ يَكُونَ آخِرُ عَهْدِهِ الطَّوَافَ بِالْبَيْتِ حَتَّى صَدَرَ لَمْ أَرَ عَلَيْهِ شَيْئًا إِلاَّ أَنْ يَكُونَ قَرِيبًا فَيَرْجِعَ فَيَطُوفَ بِالْبَيْتِ ثُمَّ يَنْصَرِفَ إِذَا كَانَ قَدْ أَفَاضَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa that his\nfather said, \"Allah has completed the hajj of anyone who does the\ntawaf al-ifada. It is fitting that tawaf of the House be the last of\nhis contract, as long as nothing prevents him, and if something\nprevents him, or an obstacle arises, then Allah has completed his\nhajj.\"\n\n\nMalik said, \"I do not think that a man who does not\nknow that the last of his contract is tawaf of the House until he has\nleft owes anything, unless he is nearby and can return, do tawaf, and\nthen leave having done the tawaf al-ifada.\""}},{"id":127,"idInBook":127,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي الأَسْوَدِ، مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ نَوْفَلٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ زَيْنَبَ بِنْتِ أَبِي سَلَمَةَ، عَنْ أُمِّ سَلَمَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ شَكَوْتُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم أَنِّي أَشْتَكِي فَقَالَ ‏\"‏ طُوفِي مِنْ وَرَاءِ النَّاسِ وَأَنْتِ رَاكِبَةٌ ‏\"‏ ‏.‏ قَالَتْ فَطُفْتُ رَاكِبَةً بَعِيرِي وَرَسُولُ اللَّهِ صلى الله عليه وسلم حِينَئِذٍ يُصَلِّي إِلَى جَانِبِ الْبَيْتِ وَهُوَ يَقْرَأُ بِـ ‏{‏الطُّورِ  وَكِتَابٍ مَسْطُورٍ ‏}‏‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'l-Aswad Muhammad ibn Abd\nar-Rahman ibn Nawfal from Urwa ibn az-Zubayr from Zaynab bint Abi\nSalama that Umm Salama, the wife of the Prophet, may Allah bless him\nand grant him peace, said, \"I once complained to the Messenger of\nAllah, may Allah bless him and grant him peace, that I was ill and he\nsaid, 'Do tawaf riding behind the people.' So I did tawaf riding my\ncamel, while the Messenger of Allah, may Allah bless him and grant him\npeace, was praying by the side of the House, reciting Surat at-Tur.\""}},{"id":128,"idInBook":128,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزُّبَيْرِ الْمَكِّيِّ، أَنَّ أَبَا مَاعِزٍ الأَسْلَمِيَّ عَبْدَ اللَّهِ بْنَ سُفْيَانَ، أَخْبَرَهُ أَنَّهُ، كَانَ جَالِسًا مَعَ عَبْدِ اللَّهِ بْنِ عُمَرَ فَجَاءَتْهُ امْرَأَةٌ تَسْتَفْتِيهِ فَقَالَتْ إِنِّي أَقْبَلْتُ أُرِيدُ أَنْ أَطُوفَ بِالْبَيْتِ حَتَّى إِذَا كُنْتُ بِبَابِ الْمَسْجِدِ هَرَقْتُ الدِّمَاءَ فَرَجَعْتُ حَتَّى ذَهَبَ ذَلِكَ عَنِّي ثُمَّ أَقْبَلْتُ حَتَّى إِذَا كُنْتُ عِنْدَ بَابِ الْمَسْجِدِ هَرَقْتُ الدِّمَاءَ فَرَجَعْتُ حَتَّى ذَهَبَ ذَلِكَ عَنِّي ثُمَّ أَقْبَلْتُ حَتَّى إِذَا كُنْتُ عِنْدَ بَابِ الْمَسْجِدِ هَرَقْتُ الدِّمَاءَ ‏.‏ فَقَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ إِنَّمَا ذَلِكَ رَكْضَةٌ مِنَ الشَّيْطَانِ فَاغْتَسِلِي ثُمَّ اسْتَثْفِرِي بِثَوْبٍ ثُمَّ طُوفِي ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'z Zubayr al-Makki that\nAbu Maiz al-Aslami Abdullah ibn Sufyan told him that once, when he was\nsitting with Abdullah ibn Umar, a woman came to ask him for an\nopinion. She said, \"I set out intending to do tawaf of the House, but\nthen, when I got to the gate of the Mosque, I started bleeding, so I\nwent back until it had left me. Then I set out again, and then, when I\ngot to the gate of the mosque, I started bleeding, so I went back\nuntil it had left me. Then I set off again, and then, when I got to\nthe gate of the mosque, I started bleeding.\" Abdullah ibn Umar said,\n\"That is only an impulse from Shaytan. Do ghusl, then bind your\nprivate parts with a cloth and do tawaf.\""}},{"id":129,"idInBook":129,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ سَعْدَ بْنَ أَبِي وَقَّاصٍ، كَانَ إِذَا دَخَلَ مَكَّةَ مُرَاهِقًا خَرَجَ إِلَى عَرَفَةَ قَبْلَ أَنْ يَطُوفَ بِالْبَيْتِ وَبَيْنَ الصَّفَا وَالْمَرْوَةِ ثُمَّ يَطُوفُ بَعْدَ أَنْ يَرْجِعَ ‏.‏ قَالَ مَالِكٌ وَذَلِكَ وَاسِعٌ إِنْ شَاءَ اللَّهُ ‏.‏ وَسُئِلَ مَالِكٌ هَلْ يَقِفُ الرَّجُلُ فِي الطَّوَافِ بِالْبَيْتِ الْوَاجِبِ عَلَيْهِ يَتَحَدَّثُ مَعَ الرَّجُلِ فَقَالَ لاَ أُحِبُّ ذَلِكَ لَهُ ‏.‏ قَالَ مَالِكٌ لاَ يَطُوفُ أَحَدٌ بِالْبَيْتِ وَلاَ بَيْنَ الصَّفَا وَالْمَرْوَةِ إِلاَّ وَهُوَ طَاهِرٌ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that if Sad ibn\nAbi Waqqas entered Makka late, he would go to Arafa before doing tawaf\nof the House and say between Safa and Marwa, and then do tawaf when he\ngot back.\n\n\nMalik said, \"The leeway is broad, if Allah wills.\"\n\n\nMalik was asked whether somebody that was doing obligatory\ntawaf could stop and talk with another man, and he said, \"I do not\nlike him to do that.\"\n\n\nMalik said, \"Only someone who is pure\n(by being in wudu) should do tawaf of the House or say between Safa\nand Marwa.\""}},{"id":130,"idInBook":130,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ جَعْفَرِ بْنِ مُحَمَّدِ بْنِ عَلِيٍّ، عَنْ أَبِيهِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّهُ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ حِينَ خَرَجَ مِنَ الْمَسْجِدِ وَهُوَ يُرِيدُ الصَّفَا وَهُوَ يَقُولُ ‏\n\"‏ نَبْدَأُ بِمَا بَدَأَ اللَّهُ بِهِ ‏\"‏ ‏.‏ فَبَدَأَ بِالصَّفَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Jafar ibn Muhammad ibn AIi\nfrom his father that Jabir ibn Abdullah said, \"I heard the Messenger\nof Allah, may Allah bless him and grant him peace, say as he left the\nmosque, intending to go to Safa, 'We begin with that with which Allah\nbegan,' and he began with Safa.\""}},{"id":131,"idInBook":131,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ جَعْفَرِ بْنِ مُحَمَّدِ بْنِ عَلِيٍّ، عَنْ أَبِيهِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا وَقَفَ عَلَى الصَّفَا يُكَبِّرُ ثَلاَثًا وَيَقُولُ ‏\n\"‏ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ ‏\"‏ ‏.‏ يَصْنَعُ ذَلِكَ ثَلاَثَ مَرَّاتٍ وَيَدْعُو وَيَصْنَعُ عَلَى الْمَرْوَةِ مِثْلَ ذَلِكَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Jafar ibn Muhammed ibn AIi\nfrom his father from Jabir ibn Abdullah that the Messenger of Allah,\nmay Allah bless him and grant him peace, used to say, \"Allah is\ngreater\" three times when he stopped on Safa, and \"There is no god but\nAllah, alone, without any partner. To Him belong the Kingdom and\npraise, and He has power over everything\" three times, and make dua.\nHe would then do the same on Marwa."}},{"id":132,"idInBook":132,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عُمَرَ، وَهُوَ عَلَى الصَّفَا يَدْعُو يَقُولُ اللَّهُمَّ إِنَّكَ قُلْتَ ادْعُونِي أَسْتَجِبْ لَكُمْ وَإِنَّكَ لاَ تُخْلِفُ الْمِيعَادَ وَإِنِّي أَسْأَلُكَ كَمَا هَدَيْتَنِي لِلإِسْلاَمِ أَنْ لاَ تَنْزِعَهُ مِنِّي حَتَّى تَتَوَفَّانِي وَأَنَا مُسْلِمٌ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that he heard Abdullah\nibn Umar making dua on Safa saying, \"O Allah, You have said, 'call on\nMe - I will answer you' and You do not break Your promise. So I am\naskingYou, in the same way that You have guided me to Islam, not to\ntake it away from me, and that You make me die while I am muslim.\""}},{"id":133,"idInBook":133,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّهُ قَالَ قُلْتُ لِعَائِشَةَ أُمِّ الْمُؤْمِنِينَ وَأَنَا يَوْمَئِذٍ، حَدِيثُ السِّنِّ أَرَأَيْتِ قَوْلَ اللَّهِ تَبَارَكَ وَتَعَالَى ‏{‏إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ فَمَنْ حَجَّ الْبَيْتَ أَوِ اعْتَمَرَ فَلاَ جُنَاحَ عَلَيْهِ أَنْ يَطَّوَّفَ بِهِمَا‏}‏ فَمَا عَلَى الرَّجُلِ شَىْءٌ أَنْ لاَ يَطَّوَّفَ بِهِمَا ‏.‏ فَقَالَتْ عَائِشَةُ كَلاَّ لَوْ كَانَ كَمَا تَقُولُ لَكَانَتْ فَلاَ جُنَاحَ عَلَيْهِ أَنْ لاَ يَطَّوَّفَ بِهِمَا إِنَّمَا أُنْزِلَتْ هَذِهِ الآيَةُ فِي الأَنْصَارِ كَانُوا يُهِلُّونَ لِمَنَاةَ وَكَانَتْ مَنَاةُ حَذْوَ قُدَيْدٍ وَكَانُوا يَتَحَرَّجُونَ أَنْ يَطُوفُوا بَيْنَ الصَّفَا وَالْمَرْوَةِ فَلَمَّا جَاءَ الإِسْلاَمُ سَأَلُوا رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ ذَلِكَ فَأَنْزَلَ اللَّهُ تَبَارَكَ وَتَعَالَى ‏{‏إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ فَمَنْ حَجَّ الْبَيْتَ أَوِ اعْتَمَرَ فَلاَ جُنَاحَ عَلَيْهِ أَنْ يَطَّوَّفَ بِهِمَا ‏}‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa that his\nfather said, \"Once when I was young I said to A'isha, umm al-muminin,\n'Have you seen the saying of Allah, the Blessed and Exalted, \"Safa and\nMarwa are among the waymarks of Allah, so whoever does hajj or umra to\nthe House, there is no harm in his going between them,\" so it follows\nthat there should be no harm for some one who does not go between\nthem.'\n\n\nA'isha said, 'No. If it were as you say, there would\nbe no harm in his not going between them. This ayat was only revealed\nabout the Ansar. They used to make pilgrimage to Manat, and Manat was\nan idol near Qudayd, and they used to avoid going between Safa and\nMarwa, and when Islam came they asked the Messenger of Allah, may\nAllah bless him and grant him peace, about this and Allah, the Blessed\nand Exalted, revealed, \"Safa and Marwa are among the waymarks of\nAllah, so whoever does hajj or umra to the House, there is no harm in\nhis going between them. \" ' \""}},{"id":134,"idInBook":134,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، أَنَّ سَوْدَةَ بِنْتَ عَبْدِ اللَّهِ بْنِ عُمَرَ، كَانَتْ عِنْدَ عُرْوَةَ بْنِ الزُّبَيْرِ فَخَرَجَتْ تَطُوفُ بَيْنَ الصَّفَا وَالْمَرْوَةِ فِي حَجٍّ أَوْ عُمْرَةٍ مَاشِيَةً وَكَانَتِ امْرَأَةً ثَقِيلَةً فَجَاءَتْ حِينَ انْصَرَفَ النَّاسُ مِنَ الْعِشَاءِ فَلَمْ تَقْضِ طَوَافَهَا حَتَّى نُودِيَ بِالأُولَى مِنَ الصُّبْحِ فَقَضَتْ طَوَافَهَا فِيمَا بَيْنَهَا وَبَيْنَهُ ‏.‏ وَكَانَ عُرْوَةُ إِذَا رَآهُمْ يَطُوفُونَ عَلَى الدَّوَابِّ يَنْهَاهُمْ أَشَدَّ النَّهْىِ فَيَعْتَلُّونَ بِالْمَرَضِ حَيَاءً مِنْهُ فَيَقُولُ لَنَا فِيمَا بَيْنَنَا وَبَيْنَهُ لَقَدْ خَابَ هَؤُلاَءِ وَخَسِرُوا ‏.‏ قَالَ مَالِكٌ مَنْ نَسِيَ السَّعْىَ بَيْنَ الصَّفَا وَالْمَرْوَةِ فِي عُمْرَةٍ فَلَمْ يَذْكُرْ حَتَّى يَسْتَبْعِدَ مِنْ مَكَّةَ أَنَّهُ يَرْجِعُ فَيَسْعَى وَإِنْ كَانَ قَدْ أَصَابَ النِّسَاءَ فَلْيَرْجِعْ فَلْيَسْعَ بَيْنَ الصَّفَا وَالْمَرْوَةِ حَتَّى يُتِمَّ مَا بَقِيَ عَلَيْهِ مِنْ تِلْكَ الْعُمْرَةِ ثُمَّ عَلَيْهِ عُمْرَةٌ أُخْرَى وَالْهَدْىُ ‏.‏ وَسُئِلَ مَالِكٌ عَنِ الرَّجُلِ يَلْقَاهُ الرَّجُلُ بَيْنَ الصَّفَا وَالْمَرْوَةِ فَيَقِفُ مَعَهُ يُحَدِّثُهُ فَقَالَ لاَ أُحِبُّ لَهُ ذَلِكَ ‏.‏ قَالَ مَالِكٌ وَمَنْ نَسِيَ مِنْ طَوَافِهِ شَيْئًا أَوْ شَكَّ فِيهِ فَلَمْ يَذْكُرْ إِلاَّ وَهُوَ يَسْعَى بَيْنَ الصَّفَا وَالْمَرْوَةِ فَإِنَّهُ يَقْطَعُ سَعْيَهُ ثُمَّ يُتِمُّ طَوَافَهُ بِالْبَيْتِ عَلَى مَا يَسْتَيْقِنُ وَيَرْكَعُ رَكْعَتَىِ الطَّوَافِ ثُمَّ يَبْتَدِئُ سَعْيَهُ بَيْنَ الصَّفَا وَالْمَرْوَةِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa that Sawda\nbint Abdullah ibn Umar, who was in the household of Urwa ibn az-\nZubayr, set off walking between Safa and Marwa when doing either hajj\nor an umra. She was a heavy woman and she began when everybody was\nleaving after the isha prayer, and she still had not completed her\ncircuits when the first call was given for subh, but finished them\nbetween the two calls to prayer.\n\n\nIf Urwa saw people doing\ncircuits on riding beasts he would tell them in very strong terms not\nto do so, and they would pretend to be ill, out of awe of him.\n\n\nHisham added, \"He used to say to us about them 'These are\nunsuccessful and have lost.' \"\n\n\nMalik said, \"Someone who\nforgets say between Safa and Marwa in an umra, and does not remember\nuntil he is far from Makka, should return and do say. If, in the\nmeantime, he has had intercourse with a woman, he should return and do\nsay between Safa and Marwa so as to complete what remains of that\numra, and then after that he has to do another umra and offer a\nsacrificial animal.\"\n\n\nMalik was asked about someone who met\nanother man when doing say between Safa and Marwa and stopped to talk\nwith him, and he said, \"I do not like anyone to do that.\"\n\n\nMalik said, \"If anyone forgets some of his tawaf or is uncertain about\nit and remembers only when he is doing say between Safa and Marwa, he\nshould stop the say and complete his tawaf of the House apart from\nthat about which he is certain. After that he prays the two rakas of\nthe tawaf, and then begins his say between Safa and Marwa.\""}},{"id":135,"idInBook":135,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ، عَنْ أَبِيهِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا نَزَلَ مِنَ الصَّفَا وَالْمَرْوَةِ مَشَى حَتَّى إِذَا انْصَبَّتْ قَدَمَاهُ فِي بَطْنِ الْوَادِي سَعَى حَتَّى يَخْرُجَ مِنْهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Jafar ibn Muhammad from his\nfather from Jabir ibn Abdullah that the Messenger of Allah, may Allah\nbless him and grant him peace, walked when he came down from Safa and\nMarwa and then, when he reached the middle of the valley, he broke\ninto a light run until he had left it.\n\n\nMalik said, about a\nman who, out of ignorance, did the say between Safa and Marwa before\nhe had done tawaf of the House, \"He should go back and do tawaf of the\nHouse and then do say between Safa and Marwa. If he does not learn\nabout this until he has left Makka and is far away, he should return\nto Makka and do tawaf of the House and say between Safa and Marwa. If\nin the meantime he has had intercourse with a woman he should return,\nand do tawaf of the House and say between Safa and Marwa so that he\ncompletes what he owes of that umra. Then, after that, he has to do\nanother umra and offer a sacrificial animal .\""}},{"id":136,"idInBook":136,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي النَّضْرِ، مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ عَنْ عُمَيْرٍ، مَوْلَى عَبْدِ اللَّهِ بْنِ عَبَّاسٍ عَنْ أُمِّ الْفَضْلِ بِنْتِ الْحَارِثِ، أَنَّ نَاسًا، تَمَارَوْا عِنْدَهَا يَوْمَ عَرَفَةَ فِي صِيَامِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ بَعْضُهُمْ هُوَ صَائِمٌ وَقَالَ بَعْضُهُمْ لَيْسَ بِصَائِمٍ فَأَرْسَلْتُ إِلَيْهِ بِقَدَحِ لَبَنٍ وَهُوَ وَاقِفٌ عَلَى بَعِيرِهِ فَشَرِبَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'n Nadr, the mawla of Umar\nibn Ubaydullah, from Umayr, the mawla of Abdullah ibn Abbas, from Umm\nal-Fadl bint al-Harith, that she was present when some people were\narguing on the day of Arafa about whether the Messenger of Allah, may\nAllah bless him and grant him peace, was fasting or not. Some of them\nsaid he was fasting, and some of them said he was not. So she sent a\nbowl of milk to him while his camel was standing still and he drank."}},{"id":137,"idInBook":137,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، أَنَّ عَائِشَةَ أُمَّ الْمُؤْمِنِينَ، كَانَتْ تَصُومُ يَوْمَ عَرَفَةَ ‏.‏ قَالَ الْقَاسِمُ وَلَقَدْ رَأَيْتُهَا عَشِيَّةَ عَرَفَةَ يَدْفَعُ الإِمَامُ ثُمَّ تَقِفُ حَتَّى يَبْيَضَّ مَا بَيْنَهَا وَبَيْنَ النَّاسِ مِنَ الأَرْضِ ثُمَّ تَدْعُو بِشَرَابٍ فَتُفْطِرُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said from al-Qasim\nibn Muhammad that A'isha, umm al-muminin, used to fast on the day of\nArafa .\n\n\nAl-Qasim said, \"I saw her, when the imam began moving\naway (after sunset) on the afternoon of Arafa, stay where she was\nuntil the ground between her and the people became clear. Then she\nasked for something to drink and broke her fast.\""}},{"id":138,"idInBook":138,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي النَّضْرِ، مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، ‏.‏ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ صِيَامِ أَيَّامِ مِنًى ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'n-Nadr, the mawla of Umar\nibn Ubaydullah, from Sulayman ibn Yasar that the Messenger of Allah,\nmay Allah bless him and grant him peace, forbade fasting on the days\nof Mina."}},{"id":139,"idInBook":139,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعَثَ عَبْدَ اللَّهِ بْنَ حُذَافَةَ أَيَّامَ مِنًى يَطُوفُ يَقُولُ إِنَّمَا هِيَ أَيَّامُ أَكْلٍ وَشُرْبٍ وَذِكْرِ اللَّهِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab that the Messenger\nof Allah, may Allah bless him and grant him peace, sent Abdullah ibn\nHudhayfa out on the days of Mina to circulate among the people to tell\nthem those days were for eating and drinking and remembrance of Allah."}},{"id":140,"idInBook":140,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ صِيَامِ يَوْمَيْنِ يَوْمِ الْفِطْرِ وَيَوْمِ الأَضْحَى ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Muhammad ibn Yahya ibn Habban\nfrom al-Araj from Abu Hurayra that the Messenger of Allah, may Allah\nbless him and grant him peace, forbade fasting on two days - the day\nof the Id al-Fitr and the day of the Id al-Adha."}},{"id":141,"idInBook":141,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ الْهَادِي، عَنْ أَبِي مُرَّةَ، مَوْلَى أُمِّ هَانِئٍ أُخْتِ عَقِيلِ بْنِ أَبِي طَالِبٍ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ، أَنَّهُ أَخْبَرَهُ أَنَّهُ، دَخَلَ عَلَى أَبِيهِ عَمْرِو بْنِ الْعَاصِ فَوَجَدَهُ يَأْكُلُ قَالَ فَدَعَانِي قَالَ فَقُلْتُ لَهُ إِنِّي صَائِمٌ ‏.‏ فَقَالَ هَذِهِ الأَيَّامُ الَّتِي نَهَانَا رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ صِيَامِهِنَّ وَأَمَرَنَا بِفِطْرِهِنَّ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yazid ibn Abdullah ibn al-\nHadi from Abu Murra, the mawla of Umm Hani, the sister of Aqil ibn Abi\nTalib, that Abdullah ibn Amr ibn al-As told him that he had visited\nhis father Amr ibn al-As and found him eating. His father had invited\nhim to eat, and when he replied that he was fasting, his father said,\n\"These are the days on which the Messenger of Allah, may Allah bless\nhim and grant him peace, forbade us to fast, and told us to break the\nfast on them.\"\n\n\nMalik said, \"These days are the days of\ntashriq.\""}},{"id":142,"idInBook":142,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَهْدَى جَمَلاً كَانَ لأَبِي جَهْلِ بْنِ هِشَامٍ فِي حَجٍّ أَوْ عُمْرَةٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi from Abdullah ibn Abi\nBakr ibn Muhammad ibn Amr ibn Hazm that the Messenger of Allah, may\nAllah bless him and grant him peace, sacrificed a camel, which had\nbelonged to Abu Jahl ibn Hisham, in either a hajj or an umra."}},{"id":143,"idInBook":143,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَأَى رَجُلاً يَسُوقُ بَدَنَةً فَقَالَ ‏\"‏ ارْكَبْهَا ‏\"‏ ‏.‏ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّهَا بَدَنَةٌ ‏.‏ فَقَالَ ‏\"‏ ارْكَبْهَا وَيْلَكَ ‏\"‏ ‏.‏ فِي الثَّانِيَةِ أَوِ الثَّالِثَةِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'z Zinad from al-Araj from\nAbu Hurayra that the Messenger of Allah, may Allah bless him and grant\nhim peace, saw a man driving forward a camel which he was going to\nsacrifice, and he told him to ride it. The man said, \"Messenger of\nAllah, it is an animal that I am going to sacrifice,\" and he replied,\n\"Ride it, woe on you,\" either the second or the third time."}},{"id":144,"idInBook":144,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، أَنَّهُ كَانَ يَرَى عَبْدَ اللَّهِ بْنَ عُمَرَ يُهْدِي فِي الْحَجِّ بَدَنَتَيْنِ بَدَنَتَيْنِ وَفِي الْعُمْرَةِ بَدَنَةً بَدَنَةً ‏.‏ قَالَ وَرَأَيْتُهُ فِي الْعُمْرَةِ يَنْحَرُ بَدَنَةً وَهِيَ قَائِمَةٌ فِي دَارِ خَالِدِ بْنِ أَسِيدٍ وَكَانَ فِيهَا مَنْزِلُهُ ‏.‏ قَالَ وَلَقَدْ رَأَيْتُهُ طَعَنَ فِي لَبَّةِ بَدَنَتِهِ حَتَّى خَرَجَتِ الْحَرْبَةُ مِنْ تَحْتِ كَتِفِهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abdullah ibn Dinar that he\nused to see Abdullah ibn Umar sacrificing animals two at a time during\nhajj and one at a time during umra. He said, \"I saw him sacrifice an\nanimal during an umra outside the house of Khalid ibn Usayd, where he\nwas staying. I saw him stick his spear in the throat of the animal he\nwas going to sacrifice until the spear came out under its shoulder.\"'"}},{"id":145,"idInBook":145,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ، أَهْدَى جَمَلاً فِي حَجٍّ أَوْ عُمْرَةٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said that Umar ibn\nAbd al-Aziz once sacrificed a camel during a hajj or an umra."}},{"id":146,"idInBook":146,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي جَعْفَرٍ الْقَارِئِ، ‏.‏ أَنَّ عَبْدَ اللَّهِ بْنَ عَيَّاشِ بْنِ أَبِي رَبِيعَةَ الْمَخْزُومِيَّ، أَهْدَى بَدَنَتَيْنِ إِحْدَاهُمَا بُخْتِيَّةٌ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu Jafar al-Qari that\nAbdullah ibn Ayyash ibn Abi Rabia al-Makhzumi sacrificed two camels,\none of them a Bactrian."}},{"id":147,"idInBook":147,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقُولُ إِذَا نُتِجَتِ النَّاقَةُ فَلْيُحْمَلْ وَلَدُهَا حَتَّى يُنْحَرَ مَعَهَا فَإِنْ لَمْ يُوجَدْ لَهُ مَحْمَلٌ حُمِلَ عَلَى أُمِّهِ حَتَّى يُنْحَرَ مَعَهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nused to say, \"If a she-camel that is being driven as a sacrificial\nanimal gives birth, the offspring should be carried along as well and\nthey are sacrificed together with her, and if there is no place where\nthey can be carried, they should be carried on the mother until they\nare all sacrificed.\""}},{"id":148,"idInBook":148,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، أَنَّ أَبَاهُ، قَالَ إِذَا اضْطُرِرْتَ إِلَى بَدَنَتِكَ فَارْكَبْهَا رُكُوبًا غَيْرَ فَادِحٍ وَإِذَا اضْطُرِرْتَ إِلَى لَبَنِهَا فَاشْرَبْ بَعْدَ مَا يَرْوَى فَصِيلُهَا فَإِذَا نَحَرْتَهَا فَانْحَرْ فَصِيلَهَا مَعَهَا ‏.‏","english":{"narrator":"","text":"ahya related to me from Malik from Hisham ibn Urwa that his\nfather said, \"If necessary, ride on your sacrificial animal, without\nburdening it, and if necessary, drink its milk after its young one has\ndrunk its fill, and when you sacrifice it, sacrifice the young one\nwith it.\""}},{"id":149,"idInBook":149,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ كَانَ إِذَا أَهْدَى هَدْيًا مِنَ الْمَدِينَةِ قَلَّدَهُ وَأَشْعَرَهُ بِذِي الْحُلَيْفَةِ يُقَلِّدُهُ قَبْلَ أَنْ يُشْعِرَهُ وَذَلِكَ فِي مَكَانٍ وَاحِدٍ وَهُوَ مُوَجَّهٌ لِلْقِبْلَةِ يُقَلِّدُهُ بِنَعْلَيْنِ وَيُشْعِرُهُ مِنَ الشِّقِّ الأَيْسَرِ ثُمَّ يُسَاقُ مَعَهُ حَتَّى يُوقَفَ بِهِ مَعَ النَّاسِ بِعَرَفَةَ ثُمَّ يَدْفَعُ بِهِ مَعَهُمْ إِذَا دَفَعُوا فَإِذَا قَدِمَ مِنًى غَدَاةَ النَّحْرِ نَحَرَهُ قَبْلَ أَنْ يَحْلِقَ أَوْ يُقَصِّرَ وَكَانَ هُوَ يَنْحَرُ هَدْيَهُ بِيَدِهِ يَصُفُّهُنَّ قِيَامًا وَيُوَجِّهُهُنَّ إِلَى الْقِبْلَةِ ثُمَّ يَأْكُلُ وَيُطْعِمُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat when he brought an animal to be sacrificed from Madina he would\ngarland it and brand it at Dhu'l-Hulayfa, doing the garlanding before\nthe branding, but doing both in the same place, while facing the\nqibla. He would garland the animal with two sandals and brand it on\nits left side. It would then be driven with him until he observed the\nstanding together with everybody at Arafa. Then he would drive it on\nwith him when everybody else moved on, and then when he arrived at\nMina on the morning of the sacrifice, he would sacrifice the animal,\nbefore he shaved his head. He would sacrifice the animals with his own\nhands ,lining them up standing and facing the qibla. He would then eat\nsome of the meat, and give some of it away."}},{"id":150,"idInBook":150,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ إِذَا طَعَنَ فِي سَنَامِ هَدْيِهِ وَهُوَ يُشْعِرُهُ قَالَ بِسْمِ اللَّهِ وَاللَّهُ أَكْبَرُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nsaid, when nicking the hump of his sacrificial animal to brand it, \"In\nthe name of Allah, and Allah is greater.\""}},{"id":151,"idInBook":151,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقُولُ الْهَدْىُ مَا قُلِّدَ وَأُشْعِرَ وَوُقِفَ بِهِ بِعَرَفَةَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nused to say, \"A sacrificial animal is what has been garlanded,\nbranded, and stood with on Arafa.\""}},{"id":152,"idInBook":152,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يُجَلِّلُ بُدْنَهُ الْقُبَاطِيَّ وَالأَنْمَاطَ وَالْحُلَلَ ثُمَّ يَبْعَثُ بِهَا إِلَى الْكَعْبَةِ فَيَكْسُوهَا إِيَّاهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nused to drape his sacrificial animals in fine Egyptian linen,\nsaddlecloths and sets of clothing, which he would afterwards send to\nthe Kaba and have the Kaba draped with them."}},{"id":153,"idInBook":153,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ سَأَلَ عَبْدَ اللَّهِ بْنَ دِينَارٍ مَا كَانَ عَبْدُ اللَّهِ بْنُ عُمَرَ يَصْنَعُ بِجِلاَلِ بُدْنِهِ حِينَ كُسِيَتِ الْكَعْبَةُ هَذِهِ الْكِسْوَةَ قَالَ كَانَ يَتَصَدَّقُ بِهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he asked Abdullah ibn Dinar\nwhat Abdullah ibn Umar used to do with the drapings of his animals\nwhen the Kaba began to be draped with the kiswa, and he said, \"He gave\nthem away as sadaqa.\""}},{"id":154,"idInBook":154,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقُولُ فِي الضَّحَايَا وَالْبُدْنِ الثَّنِيُّ فَمَا فَوْقَهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nused to say, about sacrificial animals, \"Six-year-old camels, three-\nyear-old cows and sheep, or older than these.\""}},{"id":155,"idInBook":155,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ لاَ يَشُقُّ جِلاَلَ بُدْنِهِ وَلاَ يُجَلِّلُهَا حَتَّى يَغْدُوَ مِنْ مِنًى إِلَى عَرَفَةَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nnever used to tear the drapes of his sacrificial animals, and he would\nnot drape them until he went from Mina to Arafa."}},{"id":156,"idInBook":156,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّهُ كَانَ يَقُولُ لِبَنِيهِ يَا بَنِيَّ لاَ يُهْدِيَنَّ أَحَدُكُمْ مِنَ الْبُدْنِ شَيْئًا يَسْتَحْيِي أَنْ يُهْدِيَهُ لِكَرِيمِهِ فَإِنَّ اللَّهَ أَكْرَمُ الْكُرَمَاءِ وَأَحَقُّ مَنِ اخْتِيرَ لَهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa that his\nfather used to say to his sons, \"My sons, let none of you sacrifice\nany animal which he would be ashamed to sacrifice for a noble woman,\nfor surely Allah is the noblest of noble ones, and the most deserving\nof those for whom things are chosen.\""}},{"id":157,"idInBook":157,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّ صَاحِبَ، هَدْىِ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ يَا رَسُولَ اللَّهِ كَيْفَ أَصْنَعُ بِمَا عَطِبَ مِنَ الْهَدْىِ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ كُلُّ بَدَنَةٍ عَطِبَتْ مِنَ الْهَدْىِ فَانْحَرْهَا ثُمَّ أَلْقِ قِلاَدَتَهَا فِي دَمِهَا ثُمَّ خَلِّ بَيْنَهَا وَبَيْنَ النَّاسِ يَأْكُلُونَهَا ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa from his\nfather that the man who was in charge of the sacrificial animal of the\nMessenger of Allah, may Allah bless him and grant him peace, said,\n\"Messenger of Allah, what should I do with a sacrificial animal that\ngets injured?\" The Messenger of Allah, may Allah bless him and grant\nhim peace, said to him, \"Slaughter any sacrificial animal that is\ninjured. Then throw the garlands in its blood, and then give the\npeople a free hand in eating it."}},{"id":158,"idInBook":158,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ قَالَ مَنْ سَاقَ بَدَنَةً تَطَوُّعًا فَعَطِبَتْ فَنَحَرَهَا ثُمَّ خَلَّى بَيْنَهَا وَبَيْنَ النَّاسِ يَأْكُلُونَهَا فَلَيْسَ عَلَيْهِ شَىْءٌ وَإِنْ أَكَلَ مِنْهَا أَوْ أَمَرَ مَنْ يَأْكُلُ مِنْهَا غَرِمَهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab that Said ibn al-\nMusayyab said, \"If someone dedicates an animal voluntarily and then it\nis injured and he kills it and gives everyone a free hand in eating\nit, he owes nothing. If, however, he eats some of it himself, or tells\ncertain other people to eat it, then he owes compensation.\""}},{"id":159,"idInBook":159,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ ثَوْرِ بْنِ زَيْدٍ الدِّيلِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، مِثْلَ ذَلِكَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Thawr ibn Zayd ad-Dili from\nAbdullah ibn Abbas the same as that."}},{"id":160,"idInBook":160,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، أَنَّهُ قَالَ مَنْ أَهْدَى بَدَنَةً جَزَاءً أَوْ نَذْرًا أَوْ هَدْىَ تَمَتُّعٍ فَأُصِيبَتْ فِي الطَّرِيقِ فَعَلَيْهِ الْبَدَلُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Ibn Shihab said, \"If someone\ndedicates an animal as compensation, or for a vow, or as the sacrifice\nfor tamattu, and misfortune befalls it on the road, he must provide a\nsubstitute.\""}},{"id":161,"idInBook":161,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ قَالَ مَنْ أَهْدَى بَدَنَةً ثُمَّ ضَلَّتْ أَوْ مَاتَتْ فَإِنَّهَا إِنْ كَانَتْ نَذْرًا أَبْدَلَهَا وَإِنْ كَانَتْ تَطَوُّعًا فَإِنْ شَاءَ أَبْدَلَهَا وَإِنْ شَاءَ تَرَكَهَا ‏.‏ وَحَدَّثَنِي عَنْ مَالِكٍ أَنَّهُ سَمِعَ أَهْلَ الْعِلْمِ يَقُولُونَ لاَ يَأْكُلُ صَاحِبُ الْهَدْىِ مِنَ الْجَزَاءِ وَالنُّسُكِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nsaid, \"If someone dedicates an animal and then it goes astray or dies,\nhe should provide a substitute, if it was for a vow. If, however, it\nwas voluntary, then he can either provide a substitute for it or not,\nas he wishes.\""}},{"id":162,"idInBook":162,"chapterId":20,"bookId":7,"arabic":"","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard the people of\nknowledge say, \"Someone who dedicates a sacrificial animal for\ncompensation or as part of the hajj should not eat from it.\""}},{"id":163,"idInBook":163,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عُمَرَ بْنَ الْخَطَّابِ، وَعَلِيَّ بْنَ أَبِي طَالِبٍ، وَأَبَا، هُرَيْرَةَ سُئِلُوا عَنْ رَجُلٍ، أَصَابَ أَهْلَهُ وَهُوَ مُحْرِمٌ بِالْحَجِّ فَقَالُوا يَنْفُذَانِ يَمْضِيَانِ لِوَجْهِهِمَا حَتَّى يَقْضِيَا حَجَّهُمَا ثُمَّ عَلَيْهِمَا حَجُّ قَابِلٍ وَالْهَدْىُ ‏.‏ قَالَ وَقَالَ عَلِيُّ بْنُ أَبِي طَالِبٍ وَإِذَا أَهَلاَّ بِالْحَجِّ مِنْ عَامٍ قَابِلٍ تَفَرَّقَا حَتَّى يَقْضِيَا حَجَّهُمَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Umar ibn\nal-Khattab and AIi ibn Abi Talib and Abu Hurayra were asked about a\nman who had intercourse with his wife while he was in ihram on hajj.\nThey said, \"The two of them should carry on and complete their hajj.\nThen they must do hajj again in another year, and sacrifice an\nanimal.\"\n\n\nMalik added that AIi ibn Abi Talib said, \"When they\nthen go into ihram for hajj in a future year they should keep apart\nuntil they have completed their hajj.\""}},{"id":164,"idInBook":164,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ سَمِعَ سَعِيدَ بْنَ الْمُسَيَّبِ، يَقُولُ مَا تَرَوْنَ فِي رَجُلٍ وَقَعَ بِامْرَأَتِهِ وَهُوَ مُحْرِمٌ فَلَمْ يَقُلْ لَهُ الْقَوْمُ شَيْئًا فَقَالَ سَعِيدٌ إِنَّ رَجُلاً وَقَعَ بِامْرَأَتِهِ وَهُوَ مُحْرِمٌ فَبَعَثَ إِلَى الْمَدِينَةِ يَسْأَلُ عَنْ ذَلِكَ فَقَالَ بَعْضُ النَّاسِ يُفَرَّقُ بَيْنَهُمَا إِلَى عَامٍ قَابِلٍ ‏.‏ فَقَالَ سَعِيدُ بْنُ الْمُسَيَّبِ لِيَنْفُذَا لِوَجْهِهِمَا فَلْيُتِمَّا حَجَّهُمَا الَّذِي أَفْسَدَاهُ فَإِذَا فَرَغَا رَجَعَا فَإِنْ أَدْرَكَهُمَا حَجٌّ قَابِلٌ فَعَلَيْهِمَا الْحَجُّ وَالْهَدْىُ وَيُهِلاَّنِ مِنْ حَيْثُ أَهَلاَّ بِحَجِّهِمَا الَّذِي أَفْسَدَاهُ ‏.‏ وَيَتَفَرَّقَانِ حَتَّى يَقْضِيَا حَجَّهُمَا ‏.‏ قَالَ مَالِكٌ يُهْدِيَانِ جَمِيعًا بَدَنَةً بَدَنَةً ‏.‏ قَالَ مَالِكٌ فِي رَجُلٍ وَقَعَ بِامْرَأَتِهِ فِي الْحَجِّ مَا بَيْنَهُ وَبَيْنَ أَنْ يَدْفَعَ مِنْ عَرَفَةَ وَيَرْمِيَ الْجَمْرَةَ إِنَّهُ يَجِبُ عَلَيْهِ الْهَدْىُ وَحَجُّ قَابِلٍ قَالَ فَإِنْ كَانَتْ إِصَابَتُهُ أَهْلَهُ بَعْدَ رَمْىِ الْجَمْرَةِ فَإِنَّمَا عَلَيْهِ أَنْ يَعْتَمِرَ وَيُهْدِيَ وَلَيْسَ عَلَيْهِ حَجُّ قَابِلٍ ‏.‏ قَالَ مَالِكٌ وَالَّذِي يُفْسِدُ الْحَجَّ أَوِ الْعُمْرَةَ حَتَّى يَجِبَ عَلَيْهِ فِي ذَلِكَ الْهَدْىُ فِي الْحَجِّ أَوِ الْعُمْرَةِ الْتِقَاءُ الْخِتَانَيْنِ وَإِنْ لَمْ يَكُنْ مَاءٌ دَافِقٌ ‏.‏ قَالَ وَيُوجِبُ ذَلِكَ أَيْضًا الْمَاءُ الدَّافِقُ إِذَا كَانَ مِنْ مُبَاشَرَةٍ فَأَمَّا رَجُلٌ ذَكَرَ شَيْئًا حَتَّى خَرَجَ مِنْهُ مَاءٌ دَافِقٌ فَلاَ أَرَى عَلَيْهِ شَيْئًا وَلَوْ أَنَّ رَجُلاً قَبَّلَ امْرَأَتَهُ وَلَمْ يَكُنْ مِنْ ذَلِكَ مَاءٌ دَافِقٌ لَمْ يَكُنْ عَلَيْهِ فِي الْقُبْلَةِ إِلاَّ الْهَدْىُ وَلَيْسَ عَلَى الْمَرْأَةِ الَّتِي يُصِيبُهَا زَوْجُهَا وَهِيَ مُحْرِمَةٌ مِرَارًا فِي الْحَجِّ أَوِ الْعُمْرَةِ وَهِيَ لَهُ فِي ذَلِكَ مُطَاوِعَةٌ إِلاَّ الْهَدْىُ وَحَجُّ قَابِلٍ إِنْ أَصَابَهَا فِي الْحَجِّ وَإِنْ كَانَ أَصَابَهَا فِي الْعُمْرَةِ فَإِنَّمَا عَلَيْهَا قَضَاءُ الْعُمْرَةِ الَّتِي أَفْسَدَتْ وَالْهَدْىُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said that he heard\nSaid ibn al-Musayyab asking a group of people, \"What do you think\nabout someone who has intercourse with his wife while he is in ihram?\"\nand none of them answered him. Said said, \"There is a man who has had\nintercourse with his wife while in ihram who has sent a message to\nMadina asking about it.\" Some of them said, \"They should be kept apart\nuntil a future year,\" and Said ibn al-Musayyab said, \"They should\ncarry on and complete the hajj which they have spoiled, and then\nreturn home when they have finished. If another hajj comes upon them,\nthey must do hajj and sacrifice an animal. They should go into ihram\nat the same place where they went into ihram for the hajj that they\nspoiled, and they should keep apart until they have finished their\nhajj.\"\n\n\nMalik said, \"They should both sacrifice an animal.\"\n\n\nMalik said, about a man who had intercourse with his wife\nduring hajj after he had come down from Arafa but before he had stoned\nthe Jamra, \"He must sacrifice an animal and do hajj again in another\nyear. If, however, he had intercourse with his wife after he stoned\nthe Jamra, he only has to do an umra and sacrifice an animal and he\ndoes not have to do another hajj.\"\n\n\nMalik said, \"What spoils a\nhajj or an umra and makes sacrificing an animal and repeating the hajj\nnecessary is the meeting of the two circumcised parts, even if there\nis no emission. It is also made necessary by an emission if it is the\nresult of bodily contact. I do not think that a man who remembers\nsomething and has an emission owes anything, and if a man were to kiss\nhis wife and no emission were to occur from that, he would only have\nto sacrifice an animal. A woman in ihram who has intercourse with her\nhusband several times during hajj or umra out of obedience to him only\nhas to do another hajj and sacrifice an animal. That is if her husband\nhas intercourse with her while she is doing hajj. If he has\nintercourse with her while she is doing umra, she must repeat the umra\nshe has spoiled and sacrifice an animal.\""}},{"id":165,"idInBook":165,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ قَالَ أَخْبَرَنِي سُلَيْمَانُ بْنُ يَسَارٍ، أَنَّ أَبَا أَيُّوبَ الأَنْصَارِيَّ، خَرَجَ حَاجًّا حَتَّى إِذَا كَانَ بِالنَّازِيَةِ مِنْ طَرِيقِ مَكَّةَ أَضَلَّ رَوَاحِلَهُ وَإِنَّهُ قَدِمَ عَلَى عُمَرَ بْنِ الْخَطَّابِ يَوْمَ النَّحْرِ فَذَكَرَ ذَلِكَ لَهُ فَقَالَ عُمَرُ اصْنَعْ كَمَا يَصْنَعُ الْمُعْتَمِرُ ثُمَّ قَدْ حَلَلْتَ فَإِذَا أَدْرَكَكَ الْحَجُّ قَابِلاً فَاحْجُجْ وَأَهْدِ مَا اسْتَيْسَرَ مِنَ الْهَدْىِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Yahya ibn Said said that\nSulayman ibn Yasar told him that Abu Ayyub al-Ansari once set off to\ndo hajj and then, when he reached an-Naziya, on the road to Makka, his\nriding beasts strayed. He reached Umar ibn al-Khattab on the day of\nsacrifice and told him what had happened and Umar said, \"Do what\nsomeone doing umra would do, and then you can leave ihram, and then\nwhen the hajj next comes upon you, do it and sacrifice whatever animal\nis easy for you .\""}},{"id":166,"idInBook":166,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، أَنَّ هَبَّارَ بْنَ الأَسْوَدِ، جَاءَ يَوْمَ النَّحْرِ وَعُمَرُ بْنُ الْخَطَّابِ يَنْحَرُ هَدْيَهُ فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ أَخْطَأْنَا الْعِدَّةَ كُنَّا نُرَى أَنَّ هَذَا الْيَوْمَ يَوْمُ عَرَفَةَ ‏.‏ فَقَالَ عُمَرُ اذْهَبْ إِلَى مَكَّةَ فَطُفْ أَنْتَ وَمَنْ مَعَكَ وَانْحَرُوا هَدْيًا إِنْ كَانَ مَعَكُمْ ثُمَّ احْلِقُوا أَوْ قَصِّرُوا وَارْجِعُوا فَإِذَا كَانَ عَامٌ قَابِلٌ فَحُجُّوا وَأَهْدُوا فَمَنْ لَمْ يَجِدْ فَصِيَامُ ثَلاَثَةِ أَيَّامٍ فِي الْحَجِّ وَسَبْعَةٍ إِذَا رَجَعَ ‏.‏ قَالَ مَالِكٌ وَمَنْ قَرَنَ الْحَجَّ وَالْعُمْرَةَ ثُمَّ فَاتَهُ الْحَجُّ فَعَلَيْهِ أَنْ يَحُجَّ قَابِلاً وَيَقْرِنُ بَيْنَ الْحَجِّ وَالْعُمْرَةِ وَيُهْدِي هَدْيَيْنِ هَدْيًا لِقِرَانِهِ الْحَجَّ مَعَ الْعُمْرَةِ وَهَدْيًا لِمَا فَاتَهُ مِنَ الْحَجِّ ‏.‏","english":{"narrator":"","text":"Malik related to me from Nafi from Sulayman ibn Yasar that Habbar\nibn al-Aswad arrived on the day of sacrifice while Umar ibn al-Khattab\nwas sacrificing his animal and said, \"Amir al-muminin, we made a\nmistake in our reckoning and we thought that today was the day of\nArafa.\" Umar said, \"Go to Makka, you and whoever else is with you, and\ndo tawaf and sacrifice your animal if you have one with you. Then\nshave or cut your hair and return home. Then, in another year, do hajj\nand sacrifice an animal, and if you cannot find one, fast three days\non hajj and seven when you return home.\"\n\n\nMalik said, \"Someone\nwho intends to do hajj and umra together and then misses the hajj must\ndo hajj again in another year, doing hajj with umra, and offer two\nsacrificial animals, one for doing the hajj with umra, and one for the\nhajj that he has missed.\""}},{"id":167,"idInBook":167,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي الزُّبَيْرِ الْمَكِّيِّ، عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، أَنَّهُ سُئِلَ عَنْ رَجُلٍ، وَقَعَ بِأَهْلِهِ وَهُوَ بِمِنًى قَبْلَ أَنْ يُفِيضَ فَأَمَرَهُ أَنْ يَنْحَرَ بَدَنَةً ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'z-Zubayr al-Makki from\nAta ibn Abi Rabah that Abdullah ibn Abbas was asked about a man who\nhad had intercourse with his wife while at Mina before he had done the\ntawaf al-ifada, and he told him to sacrifice an animal."}},{"id":168,"idInBook":168,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ ثَوْرِ بْنِ زَيْدٍ الدِّيلِيِّ، عَنْ عِكْرِمَةَ، مَوْلَى ابْنِ عَبَّاسٍ قَالَ لاَ أَظُنُّهُ إِلاَّ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، أَنَّهُ قَالَ الَّذِي يُصِيبُ أَهْلَهُ قَبْلَ أَنْ يُفِيضَ يَعْتَمِرُ وَيُهْدِي ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Thawr ibn Zayd ad-Dili that\nlkrama, the mawla of Ibn Abbas, said, (and Thawr believed it to be\nfrom Abdullah ibn Abbas), \"Someone who has intercourse with his wife\nbefore he has done the tawaf al-ifada should do an umra and sacrifice\nan animal.\""}},{"id":169,"idInBook":169,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ سَمِعَ رَبِيعَةَ بْنَ أَبِي عَبْدِ الرَّحْمَنِ، يَقُولُ فِي ذَلِكَ مِثْلَ قَوْلِ عِكْرِمَةَ عَنِ ابْنِ عَبَّاسٍ ‏.‏ قَالَ مَالِكٌ وَذَلِكَ أَحَبُّ مَا سَمِعْتُ إِلَىَّ فِي ذَلِكَ ‏.‏ وَسُئِلَ مَالِكٌ عَنْ رَجُلٍ نَسِيَ الإِفَاضَةَ حَتَّى خَرَجَ مِنْ مَكَّةَ وَرَجَعَ إِلَى بِلاَدِهِ فَقَالَ أَرَى إِنْ لَمْ يَكُنْ أَصَابَ النِّسَاءَ فَلْيَرْجِعْ فَلْيُفِضْ وَإِنْ كَانَ أَصَابَ النِّسَاءَ فَلْيَرْجِعْ فَلْيُفِضْ ثُمَّ لِيَعْتَمِرْ وَلْيُهْدِ وَلاَ يَنْبَغِي لَهُ أَنْ يَشْتَرِيَ هَدْيَهُ مِنْ مَكَّةَ وَيَنْحَرَهُ بِهَا وَلَكِنْ إِنْ لَمْ يَكُنْ سَاقَهُ مَعَهُ مِنْ حَيْثُ اعْتَمَرَ فَلْيَشْتَرِهِ بِمَكَّةَ ثُمَّ لِيُخْرِجْهُ إِلَى الْحِلِّ فَلْيَسُقْهُ مِنْهُ إِلَى مَكَّةَ ثُمَّ يَنْحَرُهُ بِهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard Rabia ibn Abi\nAbd ar-Rahman saying the same about that as what Ikrama related from\nIbn Abbas.\n\n\nMalik said, \"That is what I like most out of what\nI have heard about the matter.\"\n\n\nMalik was asked about a man\nwho forgot the tawaf al-ifada until he had left Makka and returned to\nhis community and he said, \"I think that he should go back and do the\ntawaf al-ifada, as long as he has not had sexual relations with women.\nIf, however, he has had sexual relations with women, then he should\nnot only return and do the tawaf al-ifada, but he should also do an\numra and sacrifice an animal. He should not buy theanimal in Makka and\nsacrifice it there, but if he has not brought one with him from\nwherever it was he set out to do umra, he should buy one in Makka and\nthen take it outside the limits of the Haram and drive it from there\nto Makka and sacrifice it there.\""}},{"id":170,"idInBook":170,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ، عَنْ أَبِيهِ، عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ، كَانَ يَقُولُ ‏{‏مَا اسْتَيْسَرَ مِنَ الْهَدْىِ‏}‏ شَاةٌ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Jafar ibn Muhammad from his\nfather that Ali ibn Abi Talib used to say, \"The least difficult thing\nacceptable as a sacrificial animal is a sheep.\""}},{"id":171,"idInBook":171,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، كَانَ يَقُولُ ‏{‏مَا اسْتَيْسَرَ مِنَ الْهَدْىِ‏}‏ شَاةٌ ‏.‏ قَالَ مَالِكٌ وَذَلِكَ أَحَبُّ مَا سَمِعْتُ إِلَىَّ فِي ذَلِكَ لأَنَّ اللَّهَ تَبَارَكَ وَتَعَالَى يَقُولُ فِي كِتَابِهِ ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا لاَ تَقْتُلُوا الصَّيْدَ وَأَنْتُمْ حُرُمٌ وَمَنْ قَتَلَهُ مِنْكُمْ مُتَعَمِّدًا فَجَزَاءٌ مِثْلُ مَا قَتَلَ مِنَ النَّعَمِ يَحْكُمُ بِهِ ذَوَا عَدْلٍ مِنْكُمْ هَدْيًا بَالِغَ الْكَعْبَةِ أَوْ كَفَّارَةٌ طَعَامُ مَسَاكِينَ أَوْ عَدْلُ ذَلِكَ صِيَامًا‏}‏ فَمِمَّا يُحْكَمُ بِهِ فِي الْهَدْىِ شَاةٌ وَقَدْ سَمَّاهَا اللَّهُ هَدْيًا وَذَلِكَ الَّذِي لاَ اخْتِلاَفَ فِيهِ عِنْدَنَا وَكَيْفَ يَشُكُّ أَحَدٌ فِي ذَلِكَ وَكُلُّ شَىْءٍ لاَ يَبْلُغُ أَنْ يُحْكَمَ فِيهِ بِبَعِيرٍ أَوْ بَقَرَةٍ فَالْحُكْمُ فِيهِ شَاةٌ وَمَا لاَ يَبْلُغُ أَنْ يُحْكَمَ فِيهِ بِشَاةٍ فَهُوَ كَفَّارَةٌ مِنْ صِيَامٍ أَوْ إِطْعَامِ مَسَاكِينَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Abdullah\nibn Abbas used to say, \"The least difficult thing acceptable as a\nsacrificial animal is a sheep.\"\n\n\nMalik said, \"That is what I\nlike most out of what I have heard about the matter, because Allah,\nthe Blessed and Exalted, says in His Book, 'O you who trust, do not\nkill game while you are in ihram. Whoever of you kills it\nintentionally, there shall be repayment the like of what he has slain,\nfrom livestock, as shall be judged by two men of justice among you, a\nsacrificial animal which will reach the Kaba, or food for poor people,\nor the equivalent of that in fasting,' (Sura 5 ayat 95) and a sheep is\none of the animals which is judged to be acceptable as a sacrifice.\nAllah has called it a sacrificial animal, and there is no dispute\namong us about the matter. How, indeed, could anyone be in doubt about\nthe matter? A sheep is the kaffara for anything which does not reach\nthe extent of something for which a camel or a cow would be the\nkaffara, and the kaffara for something which does not reach the extent\nof something for which a sheep would be the kaffara is fasting, or\nfeeding poor people.\""}},{"id":172,"idInBook":172,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقُولُ ‏{‏مَا اسْتَيْسَرَ مِنَ الْهَدْى‏}‏ بَدَنَةٌ أَوْ بَقَرَةٌ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Urnar\nused to say, \"The least thing that is acceptable as a sacrificial\nanimal is a camel or a cow.\""}},{"id":173,"idInBook":173,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، أَنَّ مَوْلاَةً، لِعَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ يُقَالُ لَهَا رُقَيَّةُ أَخْبَرَتْهُ أَنَّهَا، خَرَجَتْ مَعَ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ إِلَى مَكَّةَ - قَالَتْ - فَدَخَلَتْ عَمْرَةُ مَكَّةَ يَوْمَ التَّرْوِيَةِ وَأَنَا مَعَهَا فَطَافَتْ بِالْبَيْتِ وَبَيْنَ الصَّفَا وَالْمَرْوَةِ ثُمَّ دَخَلَتْ صُفَّةَ الْمَسْجِدِ فَقَالَتْ أَمَعَكِ مِقَصَّانِ فَقُلْتُ لاَ ‏.‏ فَقَالَتْ فَالْتَمِسِيهِ لِي ‏.‏ فَالْتَمَسْتُهُ حَتَّى جِئْتُ بِهِ فَأَخَذَتْ مِنْ قُرُونِ رَأْسِهَا فَلَمَّا كَانَ يَوْمُ النَّحْرِ ذَبَحَتْ شَاةً ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik fromAbdullah ibn Abi Bakr that a\nmawla of Amir bint Abd ar-Rahman called Ruqayya told him that she once\nset out with Amra bint Abd ar-Rahman to go to Makka. She said, ''Amra\nentered Makka on the eighth of Dhu'l-Hijja, and I was with her. She\ndid tawaf of the House, and say between Safa and Marwa, and then\nentered the back of the mosque. She asked me, 'Do you have a pair of\nscissors with you?' and I said, 'No.' She said, 'Then try and find\nsome for me.' I went and looked for some and brought them back and she\ncut some hair from the tresses of her head.Then, on the day of\nsacrifice, she slaughtered a sheep.\""}},{"id":174,"idInBook":174,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ صَدَقَةَ بْنِ يَسَارٍ الْمَكِّيِّ، أَنَّ رَجُلاً، مِنْ أَهْلِ الْيَمَنِ جَاءَ إِلَى عَبْدِ اللَّهِ بْنِ عُمَرَ وَقَدْ ضَفَرَ رَأْسَهُ فَقَالَ يَا أَبَا عَبْدِ الرَّحْمَنِ إِنِّي قَدِمْتُ بِعُمْرَةٍ مُفْرَدَةٍ ‏.‏ فَقَالَ لَهُ عَبْدُ اللَّهِ بْنُ عُمَرَ لَوْ كُنْتُ مَعَكَ أَوْ سَأَلْتَنِي لأَمَرْتُكَ أَنْ تَقْرِنَ ‏.‏ فَقَالَ الْيَمَانِيُّ قَدْ كَانَ ذَلِكَ ‏.‏ فَقَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ خُذْ مَا تَطَايَرَ مِنْ رَأْسِكَ وَأَهْدِ ‏.‏ فَقَالَتِ امْرَأَةٌ مِنْ أَهْلِ الْعِرَاقِ مَا هَدْيُهُ يَا أَبَا عَبْدِ الرَّحْمَنِ فَقَالَ هَدْيُهُ ‏.‏ فَقَالَتْ لَهُ مَا هَدْيُهُ فَقَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ لَوْ لَمْ أَجِدْ إِلاَّ أَنْ أَذْبَحَ شَاةً لَكَانَ أَحَبَّ إِلَىَّ مِنْ أَنْ أَصُومَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Sadaqa ibn Yasar al-Makki\nthat a man from the people of Yemen, who had his hair braided, came to\nAbdullah ibn Umar and said, \"Abu Abd arRahman, I have come to do just\numra. ''Abdullah ibn Umar said to him, \"If I had been with you or you\nhad asked me I would have told you to do hajj and umra together.\"  The\nYemeni answered, \"I am doing what I am doing,\" and Abdullah ibn Umar\nsaid to him, \"Cut off the locks that are hanging from your head and\noffer a sacrificial animal.\" A woman from Iraq said, \"What should his\nsacrificial animal be, Abu Abd ar-Rahman?\" and he said, \"His\nsacrificial animal?\" and she said to him, \"What should his sacrificial\nanimal be?\" Abdullah ibn Umar said, \"If I could only find a sheep to\nsacrifice, I would prefer to do that than to fast.\""}},{"id":175,"idInBook":175,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقُولُ الْمَرْأَةُ الْمُحْرِمَةُ إِذَا حَلَّتْ لَمْ تَمْتَشِطْ حَتَّى تَأْخُذَ مِنْ قُرُونِ رَأْسِهَا وَإِنْ كَانَ لَهَا هَدْىٌ لَمْ تَأْخُذْ مِنْ شَعْرِهَا شَيْئًا حَتَّى تَنْحَرَ هَدْيَهَا ‏.‏ وَحَدَّثَنِي عَنْ مَالِكٍ أَنَّهُ سَمِعَ بَعْضَ أَهْلِ الْعِلْمِ يَقُولُ لاَ يَشْتَرِكُ الرَّجُلُ وَامْرَأَتُهُ فِي بَدَنَةٍ وَاحِدَةٍ لِيُهْدِ كُلُّ وَاحِدٍ بَدَنَةً بَدَنَةً ‏.‏ وَسُئِلَ مَالِكٌ عَمَّنْ بُعِثَ مَعَهُ بِهَدْىٍ يَنْحَرُهُ فِي حَجٍّ وَهُوَ مُهِلٌّ بِعُمْرَةٍ هَلْ يَنْحَرُهُ إِذَا حَلَّ أَمْ يُؤَخِّرُهُ حَتَّى يَنْحَرَهُ فِي الْحَجِّ وَيُحِلُّ هُوَ مِنْ عُمْرَتِهِ فَقَالَ بَلْ يُؤَخِّرُهُ حَتَّى يَنْحَرَهُ فِي الْحَجِّ وَيُحِلُّ هُوَ مِنْ عُمْرَتِهِ ‏.‏ قَالَ مَالِكٌ وَالَّذِي يُحْكَمُ عَلَيْهِ بِالْهَدْىِ فِي قَتْلِ الصَّيْدِ أَوْ يَجِبُ عَلَيْهِ هَدْىٌ فِي غَيْرِ ذَلِكَ فَإِنَّ هَدْيَهُ لاَ يَكُونُ إِلاَّ بِمَكَّةَ كَمَا قَالَ اللَّهُ تَبَارَكَ وَتَعَالَى ‏{‏هَدْيًا بَالِغَ الْكَعْبَة‏}‏ وَأَمَّا مَا عُدِلَ بِهِ الْهَدْىُ مِنَ الصِّيَامِ أَوِ الصَّدَقَةِ فَإِنَّ ذَلِكَ يَكُونُ بِغَيْرِ مَكَّةَ حَيْثُ أَحَبَّ صَاحِبُهُ أَنْ يَفْعَلَهُ فَعَلَهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nused to say, \"A woman in ihram should not comb her hair when she\nleaves ihram until she has cut some of the tresses of her hair, and if\nshe has an animal for sacrifice with her she should not cut off any of\nher hair until the animal has been killed.\""}},{"id":176,"idInBook":176,"chapterId":20,"bookId":7,"arabic":"","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard one of the\npeople of knowledge say, \"A man and wife should not share in one\nsacrificial animal. Each should sacrifice an animal separately.\"\n\n\nMalik was asked about whether someone who had been entrusted with\nan animal for him to sacrifice on hajj, who went into ihram for umra,\nshould sacrifice it when he came out of ihram or postpone it so that\nhe sacrificed it at the time of the hajj while in the meantime he came\nout of ihram from his umra. He said, \"He should postpone it so that he\nmay sacrifice it at the time of the hajj, and meanwhile come out of\nihram from his umra.\"\n\n\nMalik said, \"If it is judged that some-\none must offer an animal for having killed game, or for any other\nreason, this animal can only be sacrificed at Makka, since Allah, the\nBlessed and Exalted, says, 'a sacrificial animal which will reach the\nKaba.'  The fasting or sadaqa that is considered equivalent to\noffering a sacrifice can be done outside Makka, and the person who is\ndoing it can do it wherever he likes.\""}},{"id":177,"idInBook":177,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ يَعْقُوبَ بْنِ خَالِدٍ الْمَخْزُومِيِّ، عَنْ أَبِي أَسْمَاءَ، مَوْلَى عَبْدِ اللَّهِ بْنِ جَعْفَرٍ أَنَّهُ أَخْبَرَهُ أَنَّهُ، كَانَ مَعَ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ فَخَرَجَ مَعَهُ مِنَ الْمَدِينَةِ فَمَرُّوا عَلَى حُسَيْنِ بْنِ عَلِيٍّ وَهُوَ مَرِيضٌ بِالسُّقْيَا فَأَقَامَ عَلَيْهِ عَبْدُ اللَّهِ بْنُ جَعْفَرٍ حَتَّى إِذَا خَافَ الْفَوَاتَ خَرَجَ وَبَعَثَ إِلَى عَلِيِّ بْنِ أَبِي طَالِبٍ وَأَسْمَاءَ بِنْتِ عُمَيْسٍ وَهُمَا بِالْمَدِينَةِ فَقَدِمَا عَلَيْهِ ثُمَّ إِنَّ حُسَيْنًا أَشَارَ إِلَى رَأْسِهِ فَأَمَرَ عَلِيٌّ بِرَأْسِهِ فَحُلِّقَ ثُمَّ نَسَكَ عَنْهُ بِالسُّقْيَا فَنَحَرَ عَنْهُ بَعِيرًا ‏.‏ قَالَ يَحْيَى بْنُ سَعِيدٍ وَكَانَ حُسَيْنٌ خَرَجَ مَعَ عُثْمَانَ بْنِ عَفَّانَ فِي سَفَرِهِ ذَلِكَ إِلَى مَكَّةَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said from Yaqub ibn\nKhalid al-Makhzumi that Abu Asma, the mawla of Abdullah ibn Jafar,\ntold him that he was with Abdullah ibn Jafar when they set out once\nfrom Madina. At as-Suqya they passed by Husayn ibn Ali, who was ill at\nthe time. Abdullah ibn Jafar stayed with him and then, when he feared\nthat he was late (for the hajj) he left, and sent for Ali ibn Abi\nTalib and Asma bint Umays in Madina, and they came to Husayn. Then\nHusayn pointed to his head, and AIi told someone to shave his head.\nThen he sacrificed an animal for him at as-Suqya, killing a camel for\nhim.\n\n\nYahya ibn Said added, \"Husayn had set out with Uthman\nibn Affan on that particular journey to Makka. \""}},{"id":178,"idInBook":178,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ عَرَفَةُ كُلُّهَا مَوْقِفٌ وَارْتَفِعُوا عَنْ بَطْنِ عُرَنَةَ وَالْمُزْدَلِفَةُ كُلُّهَا مَوْقِفٌ وَارْتَفِعُوا عَنْ بَطْنِ مُحَسِّرٍ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that the\nMessenger of Allah, may Allah bless him and grant him peace, said,\n\"The whole of Arafa is a mawqif, except the middle of Urana, and the\nwhole of Muzdalifa is a standing-place, except for the middle of\nMuhassir.\""}},{"id":179,"idInBook":179,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، أَنَّهُ كَانَ يَقُولُ اعْلَمُوا أَنَّ عَرَفَةَ كُلَّهَا مَوْقِفٌ إِلاَّ بَطْنَ عُرَنَةَ وَأَنَّ الْمُزْدَلِفَةَ كُلَّهَا مَوْقِفٌ إِلاَّ بَطْنَ مُحَسِّرٍ ‏.‏ قَالَ مَالِكٌ قَالَ اللَّهُ تَبَارَكَ وَتَعَالَى ‏{‏فَلاَ رَفَثَ وَلاَ فُسُوقَ وَلاَ جِدَالَ فِي الْحَجِّ ‏}‏ قَالَ فَالرَّفَثُ إِصَابَةُ النِّسَاءِ وَاللَّهُ أَعْلَمُ قَالَ اللَّهُ تَبَارَكَ وَتَعَالَى ‏{‏أُحِلَّ لَكُمْ لَيْلَةَ الصِّيَامِ الرَّفَثُ إِلَى نِسَائِكُمْ ‏}‏ قَالَ وَالْفُسُوقُ الذَّبْحُ لِلأَنْصَابِ وَاللَّهُ أَعْلَمُ قَالَ اللَّهُ تَبَارَكَ وَتَعَالَى ‏{‏أَوْ فِسْقًا أُهِلَّ لِغَيْرِ اللَّهِ بِهِ‏}‏ ‏.‏ قَالَ وَالْجِدَالُ فِي الْحَجِّ أَنَّ قُرَيْشًا كَانَتْ تَقِفُ عِنْدَ الْمَشْعَرِ الْحَرَامِ بِالْمُزْدَلِفَةِ بِقُزَحَ وَكَانَتِ الْعَرَبُ وَغَيْرُهُمْ يَقِفُونَ بِعَرَفَةَ فَكَانُوا يَتَجَادَلُونَ يَقُولُ هَؤُلاَءِ نَحْنُ أَصْوَبُ وَيَقُولُ هَؤُلاَءِ نَحْنُ أَصْوَبُ فَقَالَ اللَّهُ تَعَالَى وَ ‏{‏لِكُلِّ أُمَّةٍ جَعَلْنَا مَنْسَكًا هُمْ نَاسِكُوهُ فَلاَ يُنَازِعُنَّكَ فِي الأَمْرِ وَادْعُ إِلَى رَبِّكَ إِنَّكَ لَعَلَى هُدًى مُسْتَقِيمٍ‏}‏ فَهَذَا الْجِدَالُ فِيمَا نُرَى وَاللَّهُ أَعْلَمُ وَقَدْ سَمِعْتُ ذَلِكَ مِنْ أَهْلِ الْعِلْمِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa that Abdullah\nibn az-Zubayr used to say, \"Know that the whole of Arafa is a\nstanding-place except for the middle of Urana, and that the wholeof\nMuzdalifa is a standing-place except for the middle of Muhassir.\"\n\n\nMalik said, \"Allah, the Blessed and Exalted says, 'There is to be\nno rafath, no fusuq and no jidal during the hajj.' \" (Sura 2 ayat\n197).\n\n\nHe added, \"Rafath is sexual relations with women, and\nAllah knows best. Allah, the Blessed and Exalted says, 'Rafath with\nyour women is permitted to you on the night of the fast.' (Sura 2 ayat\n197). Fusuq are sacrifices made to idols, and Allah knows best. Allah,\nthe Blessed and Exalted, says, 'Or a fisq offered up to other than\nAllah.' (Sura 2 ayat 197) Jidal (arguing) during the hajj refers to\nwhen the Quraysh used to stand near the mashar al-haram at Quzah in\nMuzdalifa, while the Arabs and others would stand at Arafa, and they\nwould argue about who was the more correct. Allah, the Blessed and\nExalted, says, 'And we appointed a method of sacrifice for every\nnation, which they followed, so let them not dispute with you about\nthe matter, and call to your Lord. Surely you are on a straight\nguidance.' (Sura 22 ayat 67) This is what jidal refers to in our\nopinion, and Allah knows best. This I have heard from the people of\nknowledge.\""}},{"id":180,"idInBook":180,"chapterId":20,"bookId":7,"arabic":"","english":{"narrator":"","text":"Malik was asked about whether a man could stand at Arafa, or at\nMuzdalifa, or stone the Jamras, or do say between Safa and Marwa if he\nwas not in wudu, and he said, \"Every practice in the hajj that a\nmenstruating woman can take part in can be taken part in by a man who\nis not in wudu and there is nothing due from him for that. However, it\nis better for him to be in wudu for all those things, and he should\nnot make a general practice of it.\"\n\n\nMalik was asked whether a\nman who was riding should get down to do the standing at Arafa or if\nhe could stand while mounted, and he said, \"He can stand while\nmounted, unless he or his riding beast have an illness, in which case\nAllah is the one who most often accepts an excuse.\""}},{"id":181,"idInBook":181,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقُولُ مَنْ لَمْ يَقِفْ بِعَرَفَةَ مِنْ لَيْلَةِ الْمُزْدَلِفَةِ قَبْلَ أَنْ يَطْلُعَ الْفَجْرُ فَقَدْ فَاتَهُ الْحَجُّ وَمَنْ وَقَفَ بِعَرَفَةَ مِنْ لَيْلَةِ الْمُزْدَلِفَةِ مِنْ قَبْلِ أَنْ يَطْلُعَ الْفَجْرُ فَقَدْ أَدْرَكَ الْحَجَّ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nused to say, \"Someone who does not stand at Arafa on the night of\nMuzdalifa before the dawn breaks has missed the hajj, and someone who\nstands at Arafa on the night of Muzdalifa before the dawn breaks has\ncaught the hajj.\""}},{"id":182,"idInBook":182,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّهُ قَالَ مَنْ أَدْرَكَهُ الْفَجْرُ مِنْ لَيْلَةِ الْمُزْدَلِفَةِ وَلَمْ يَقِفْ بِعَرَفَةَ فَقَدْ فَاتَهُ الْحَجُّ وَمَنْ وَقَفَ بِعَرَفَةَ مِنْ لَيْلَةِ الْمُزْدَلِفَةِ قَبْلَ أَنْ يَطْلُعَ الْفَجْرُ فَقَدْ أَدْرَكَ الْحَجَّ ‏.‏ قَالَ مَالِكٌ فِي الْعَبْدِ يُعْتَقُ فِي الْمَوْقِفِ بِعَرَفَةَ فَإِنَّ ذَلِكَ لاَ يَجْزِي عَنْهُ مِنْ حَجَّةِ الإِسْلاَمِ إِلاَّ أَنْ يَكُونَ لَمْ يُحْرِمْ فَيُحْرِمُ بَعْدَ أَنْ يُعْتَقَ ثُمَّ يَقِفُ بِعَرَفَةَ مِنْ تِلْكَ اللَّيْلَةِ قَبْلَ أَنْ يَطْلُعَ الْفَجْرُ فَإِنْ فَعَلَ ذَلِكَ أَجْزَأَ عَنْهُ وَإِنْ لَمْ يُحْرِمْ حَتَّى طَلَعَ الْفَجْرُ كَانَ بِمَنْزِلَةِ مَنْ فَاتَهُ الْحَجُّ إِذَا لَمْ يُدْرِكِ الْوُقُوفَ بِعَرَفَةَ قَبْلَ طُلُوعِ الْفَجْرِ مِنْ لَيْلَةِ الْمُزْدَلِفَةِ وَيَكُونُ عَلَى الْعَبْدِ حَجَّةُ الإِسْلاَمِ يَقْضِيهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa that his\nfather said, \"Someone who does not stand at Arafa on the night of\nMuzdalifa\n\n\nbefore the dawn breaks has missed the hajj, and\nsome one who stands at Arafa on the night of Muzdalifa before the dawn\nbreaks has caught the hajj.\n\n\nMalik said, about a slave freed\nduring the wuquf at Arafa, \"His standing does not fulfil for him the\nhajj of Islam, except if he was not in ihram and then he went into\nihram after he was freed and he stood at Arafa that same night before\nthe dawn broke in which case that is enough for him. If, however, he\ndid not go into ihram until after the dawn had broken, he is in the\nsame position as someone who misses the hajj by not catching the\nstanding at Arafa before the breaking of the dawn on the night of\nMuzdalifa, and he will have to do the hajj of Islam later.\""}},{"id":183,"idInBook":183,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ سَالِمٍ، وَعُبَيْدِ اللَّهِ، ابْنَىْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّ أَبَاهُمَا عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يُقَدِّمُ أَهْلَهُ وَصِبْيَانَهُ مِنَ الْمُزْدَلِفَةِ إِلَى مِنًى حَتَّى يُصَلُّوا الصُّبْحَ بِمِنًى وَيَرْمُوا قَبْلَ أَنْ يَأْتِيَ النَّاسُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafj from Salim and\nUbaydullah, two sons of Abdullah ibn Umar, that their father Abdullah\nibn Umar used to send his family and children from Muzdalifa to Mina\nahead of him so that they could pray subh at Mina and throw the stones\nbefore everyone (else) arrived."}},{"id":184,"idInBook":184,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ، أَنَّ مَوْلاَةً، لأَسْمَاءَ بِنْتِ أَبِي بَكْرٍ أَخْبَرَتْهُ قَالَتْ، جِئْنَا مَعَ أَسْمَاءَ ابْنَةِ أَبِي بَكْرٍ مِنًى بِغَلَسٍ - قَالَتْ - فَقُلْتُ لَهَا لَقَدْ جِئْنَا مِنًى بِغَلَسٍ ‏.‏ فَقَالَتْ قَدْ كُنَّا نَصْنَعُ ذَلِكَ مَعَ مَنْ هُوَ خَيْرٌ مِنْكِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said from Ata ibn\nAbi Rabah that a mawla of Asma bint Abi Bakr told him, \"We arrived at\nMina with Asma bint Abi Bakr at the end of the night, and I said to\nher, 'We have arrived at Mina at the end of the night,' and she said,\n'We used to do that with one who was better than you.' \""}},{"id":185,"idInBook":185,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ طَلْحَةَ بْنَ عُبَيْدِ اللَّهِ، كَانَ يُقَدِّمُ نِسَاءَهُ وَصِبْيَانَهُ مِنَ الْمُزْدَلِفَةِ إِلَى مِنًى ‏.‏ وَحَدَّثَنِي عَنْ مَالِكٍ أَنَّهُ سَمِعَ بَعْضَ أَهْلِ الْعِلْمِ يَكْرَهُ رَمْىَ الْجَمْرَةِ حَتَّى يَطْلُعَ الْفَجْرُ مِنْ يَوْمِ النَّحْرِ وَمَنْ رَمَى فَقَدْ حَلَّ لَهُ النَّحْرُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Talha ibn\nUbaydullah used to send his family and children from Muzdalifa to Mina\nahead of him."}},{"id":186,"idInBook":186,"chapterId":20,"bookId":7,"arabic":"","english":{"narrator":"","text":"Yahya related to.me from Malik that he had heard one of the\npeople of knowledge disapproving of stoning the jamra until after dawn\non the day of sacrifice, as it was halal for whoever had thrown the\nstones to sacrifice."}},{"id":187,"idInBook":187,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ فَاطِمَةَ بِنْتِ الْمُنْذِرِ، أَخْبَرَتْهُ أَنَّهَا، كَانَتْ تَرَى أَسْمَاءَ بِنْتَ أَبِي بَكْرٍ بِالْمُزْدَلِفَةِ تَأْمُرُ الَّذِي يُصَلِّي لَهَا وَلأَصْحَابِهَا الصُّبْحَ يُصَلِّي لَهُمُ الصُّبْحَ حِينَ يَطْلُعُ الْفَجْرُ ثُمَّ تَرْكَبُ فَتَسِيرُ إِلَى مِنًى وَلاَ تَقِفُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa that Fatima\nbint al-Mundhir told him that she used to see Asma bint Abi Bakrat\nMuzdalifa telling whoever led the subh prayer for her and her\ncompanions to pray it as soon as the dawn broke, after which she would\nmount and go to Mina without stopping at all."}},{"id":188,"idInBook":188,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّهُ قَالَ سُئِلَ أُسَامَةُ بْنُ زَيْدٍ - وَأَنَا جَالِسٌ، مَعَهُ - كَيْفَ كَانَ يَسِيرُ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي حَجَّةِ الْوَدَاعِ حِينَ دَفَعَ قَالَ كَانَ يَسِيرُ الْعَنَقَ فَإِذَا وَجَدَ فَجْوَةً نَصَّ ‏.‏ قَالَ مَالِكٌ قَالَ هِشَامٌ وَالنَّصُّ فَوْقَ الْعَنَقِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa that his\nfather said, \"I was sitting with Usama ibn Zayd when some one asked\nhim, 'How did the Messenger of Allah, may Allah bless him and grant\nhim peace, travel when he went from Arafa to Muzdalifa during the\nfarewell hajj?' and he replied, 'He went at a medium pace, but when he\nfound a gap (in the crowds) he speeded up.' \""}},{"id":189,"idInBook":189,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يُحَرِّكُ رَاحِلَتَهُ فِي بَطْنِ مُحَسِّرٍ قَدْرَ رَمْيَةٍ بِحَجَرٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nused to spur on his mount in the middle of Muhassir over the distance\nof a stone's throw."}},{"id":190,"idInBook":190,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ بِمِنًى ‏\"‏ هَذَا الْمَنْحَرُ وَكُلُّ مِنًى مَنْحَرٌ ‏\"‏ ‏.‏ وَقَالَ فِي الْعُمْرَةِ ‏\"‏ هَذَا الْمَنْحَرُ - يَعْنِي الْمَرْوَةَ - وَكُلُّ فِجَاجِ مَكَّةَ وَطُرُقِهَا مَنْحَرٌ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that the\nMessenger of Allah, may Allah bless him and grant him peace, said once\nat Mina, \"This place (where I have just sacrificed), and the whole of\nMina, is a place of sacrifice,\" and he said once during umra, \"This\nplace of sacrifice\" meaning Marwa, \"and all the pathways of Makka and\nits roads are a place of sacrifice.\""}},{"id":191,"idInBook":191,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، قَالَ أَخْبَرَتْنِي عَمْرَةُ بِنْتُ عَبْدِ الرَّحْمَنِ، أَنَّهَا سَمِعَتْ عَائِشَةَ أُمَّ الْمُؤْمِنِينَ، تَقُولُ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم لِخَمْسِ لَيَالٍ بَقِينَ مِنْ ذِي الْقَعْدَةِ وَلاَ نُرَى إِلاَّ أَنَّهُ الْحَجُّ فَلَمَّا دَنَوْنَا مِنْ مَكَّةَ أَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم مَنْ لَمْ يَكُنْ مَعَهُ هَدْىٌ إِذَا طَافَ بِالْبَيْتِ وَسَعَى بَيْنَ الصَّفَا وَالْمَرْوَةِ أَنْ يَحِلَّ ‏.‏ قَالَتْ عَائِشَةُ فَدُخِلَ عَلَيْنَا يَوْمَ النَّحْرِ بِلَحْمِ بَقَرٍ فَقُلْتُ مَا هَذَا فَقَالُوا نَحَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ أَزْوَاجِهِ ‏.‏ قَالَ يَحْيَى بْنُ سَعِيدٍ فَذَكَرْتُ هَذَا الْحَدِيثَ لِلْقَاسِمِ بْنِ مُحَمَّدٍ فَقَالَ أَتَتْكَ وَاللَّهِ بِالْحَدِيثِ عَلَى وَجْهِهِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Yahya ibn Said said that Amra\nbint Abd ar-Rahman told him that she had heard A'isha, umm al-muminin,\nsaying, \"We set out with the Messenger of Allah, may Allah bless him\nand grant him peace, when there were five nights left in Dhu'l-Qada\nand we assumed that we must be setting out for hajj. When we got near\nto Makka, the Messenger of Allah, may Allah bless him and grant him\npeace, told everyone that did not have a sacrificial animal with them\nto leave ihram after they had done tawaf of the House and say between\nSafa and Marwa.\"\n\n\nA'isha added, \"We were sent some beef on the\nday of sacrifice. I asked what it was and they said that the Messenger\nof Allah, may Allah bless him and grant him peace, had sacrificed for\nhis wives.\"\n\n\nYahya ibn Said said, \"I mentioned this hadith to\nQasim ibn Muhammad and he said, 'She has given you the complete\nhadith, by Allah.' \""}},{"id":192,"idInBook":192,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ حَفْصَةَ أُمِّ الْمُؤْمِنِينَ، أَنَّهَا قَالَتْ لِرَسُولِ اللَّهِ صلى الله عليه وسلم مَا شَأْنُ النَّاسِ حَلُّوا وَلَمْ تَحْلِلْ أَنْتَ مِنْ عُمْرَتِكَ فَقَالَ ‏\n\"‏ إِنِّي لَبَّدْتُ رَأْسِي وَقَلَّدْتُ هَدْيِي فَلاَ أَحِلُّ حَتَّى أَنْحَرَ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat Hafsa, umm al-muminin, once said to the Messenger of Allah, may\nAllah bless him and grant him peace, \"Why is it that everyone has left\nihram and you still have not left ihram from your umra?\" and he\nreplied, \"I have matted my hair and garlanded my sacrificial animal\nand will not leave ihram until I have sacrificed the animal.\""}},{"id":193,"idInBook":193,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ، عَنْ أَبِيهِ، عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَحَرَ بَعْضَ هَدْيِهِ وَنَحَرَ غَيْرُهُ بَعْضَهُ ‏.‏","english":{"narrator":"","text":"190 Yahya related to me from Malik from Jafar ibn Muhammad from\nhis father from Ali ibn Abi Talib that the Messenger of Allah, may\nAllah bless him and grant him peace, killed some of his sacrificial\nanimals himself, and someone else killed the rest."}},{"id":194,"idInBook":194,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، قَالَ مَنْ نَذَرَ بَدَنَةً فَإِنَّهُ يُقَلِّدُهَا نَعْلَيْنِ وَيُشْعِرُهَا ثُمَّ يَنْحَرُهَا عِنْدَ الْبَيْتِ أَوْ بِمِنًى يَوْمَ النَّحْرِ لَيْسَ لَهَا مَحِلٌّ دُونَ ذَلِكَ وَمَنْ نَذَرَ جَزُورًا مِنَ الإِبِلِ أَوِ الْبَقَرِ فَلْيَنْحَرْهَا حَيْثُ شَاءَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nsaid, \"Someone who vows to sacrifice a camel or a cow to Allah should\ngarland it with two sandals about its neck, and brand it by causing\nblood to flow from its side. He should then sacrifice it either at the\nHouse or at Mina on the day of sacrifice. There are no other correct\nplaces apart from those. However, someone who vows to slaughter a\ncamel or a cow simply as a sacrifice can sacrifice it wherever he\nwishes.\""}},{"id":195,"idInBook":195,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، أَنَّ أَبَاهُ، كَانَ يَنْحَرُ بُدْنَهُ قِيَامًا ‏.‏ قَالَ مَالِكٌ لاَ يَجُوزُ لأَحَدٍ أَنْ يَحْلِقَ رَأْسَهُ حَتَّى يَنْحَرَ هَدْيَهُ وَلاَ يَنْبَغِي لأَحَدٍ أَنْ يَنْحَرَ قَبْلَ الْفَجْرِ يَوْمَ النَّحْرِ وَإِنَّمَا الْعَمَلُ كُلُّهُ يَوْمَ النَّحْرِ الذَّبْحُ وَلُبْسُ الثِّيَابِ وَإِلْقَاءُ التَّفَثِ وَالْحِلاَقُ لاَ يَكُونُ شَىْءٌ مِنْ ذَلِكَ يُفْعَلُ قَبْلَ يَوْمِ النَّحْرِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa that his\nfather used to kill his sacrificial animals while they were standing.\n\n\nMalik said, \"No-one is permitted to shave his head until he\nhas killed his sacrificial animal, and no-one must sacrifice before\ndawn on the day of sacrifice. The things that should be done on the\nday of sacrifice are slaughtering, donning clothes, grooming the body\ngenerally (at-tafath) and shaving the head, and none of this may be\ndone before the day of sacrifice.\""}},{"id":196,"idInBook":196,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ اللَّهُمَّ ارْحَمِ الْمُحَلِّقِينَ ‏\"‏ ‏.‏ قَالُوا وَالْمُقَصِّرِينَ يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\"‏ اللَّهُمَّ ارْحَمِ الْمُحَلِّقِينَ ‏\"‏ ‏.‏ قَالُوا وَالْمُقَصِّرِينَ يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\"‏ وَالْمُقَصِّرِينَ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat the Messenger of Allah, may Allah bless him and grant him peace,\nsaid, \"O Allah, have mercy on those who shave their hair.\"  They said,\n\"And those who shorten (their hair), Messenger of Allah.\"   He said,\n\"O Allah, have mercy on those who shave.\" They said, \"And those who\nshorten, Messenger of Allah.\" He said, \"And those who shorten.\""}},{"id":197,"idInBook":197,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، أَنَّهُ كَانَ يَدْخُلُ مَكَّةَ لَيْلاً وَهُوَ مُعْتَمِرٌ فَيَطُوفُ بِالْبَيْتِ وَبَيْنَ الصَّفَا وَالْمَرْوَةِ وَيُؤَخِّرُ الْحِلاَقَ حَتَّى يُصْبِحَ ‏.‏ قَالَ وَلَكِنَّهُ لاَ يَعُودُ إِلَى الْبَيْتِ فَيَطُوفُ بِهِ حَتَّى يَحْلِقَ رَأْسَهُ ‏.‏ قَالَ وَرُبَّمَا دَخَلَ الْمَسْجِدَ فَأَوْتَرَ فِيهِ وَلاَ يَقْرَبُ الْبَيْتَ ‏.‏ قَالَ مَالِكٌ التَّفَثُ حِلاَقُ الشَّعَرِ وَلُبْسُ الثِّيَابِ وَمَا يَتْبَعُ ذَلِكَ ‏.‏ قَالَ يَحْيَى سُئِلَ مَالِكٌ عَنْ رَجُلٍ نَسِيَ الْحِلاَقَ بِمِنًى فِي الْحَجِّ هَلْ لَهُ رُخْصَةٌ فِي أَنْ يَحْلِقَ بِمَكَّةَ قَالَ ذَلِكَ وَاسِعٌ وَالْحِلاَقُ بِمِنًى أَحَبُّ إِلَىَّ ‏.‏ قَالَ مَالِكٌ الأَمْرُ الَّذِي لاَ اخْتِلاَفَ فِيهِ عِنْدَنَا أَنَّ أَحَدًا لاَ يَحْلِقُ رَأْسَهُ وَلاَ يَأْخُذُ مِنْ شَعَرِهِ حَتَّى يَنْحَرَ هَدْيًا إِنْ كَانَ مَعَهُ وَلاَ يَحِلُّ مِنْ شَىْءٍ حَرُمَ عَلَيْهِ حَتَّى يَحِلَّ بِمِنًى يَوْمَ النَّحْرِ وَذَلِكَ أَنَّ اللَّهَ تَبَارَكَ وَتَعَالَى قَالَ ‏{‏وَلاَ تَحْلِقُوا رُءُوسَكُمْ حَتَّى يَبْلُغَ الْهَدْىُ مَحِلَّهُ ‏}‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abd ar-Rahman ibn al-Qasim\nthat his father used to go into Makka by night when he was doing umra\nand do tawaf of the House and say between Safa and Marwa and delay the\nshaving until the morning, but he would not go back to the House and\ndo tawaf again until he had shaved his head.\n\n\nAbd ar-Rahman\nadded, \"Sometimes he would enter the mosque and do the witr prayer\nthere without actually going near the House.\"\n\n\nMalik said,\n\"At-tafath is shaving the head, putting on normal clothes and things\nof that nature.\"\n\n\nYahya said that Malik was asked whether a\nman who forgot to shave (his head) at Mina during the hajj could shave\nin Makka, and he said, \"That is permissible, but I prefer the shaving\nto be done at Mina.\"\n\n\nMalik said, \"What we are all agreed upon\nhere (in Madina) is that no-one should shave his head or cut his hair\nuntil he has killed his sacrificial animal, if he has one, and things\nthat are haram for him do not become halal for him until he leaves\nihram at Mina on the day of sacrifice. This is because Allah, the\nBlessed and Exalted, says, 'Do not shave yourheads until the\nsacrificial animal has reached its destination. ' \""}},{"id":198,"idInBook":198,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ إِذَا أَفْطَرَ مِنْ رَمَضَانَ وَهُوَ يُرِيدُ الْحَجَّ لَمْ يَأْخُذْ مِنْ رَأْسِهِ وَلاَ مِنْ لِحْيَتِهِ شَيْئًا حَتَّى يَحُجَّ ‏.‏ قَالَ مَالِكٌ لَيْسَ ذَلِكَ عَلَى النَّاسِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that if Abdullah ibn\nUmar had finished the fast of Ramadan and intended to do hajj, he\nwould not cut his hair or beard at all until he had done hajj.\n\n\nMalik said, \"It is not necessary for people to do the same.\""}},{"id":199,"idInBook":199,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ إِذَا حَلَقَ فِي حَجٍّ أَوْ عُمْرَةٍ أَخَذَ مِنْ لِحْيَتِهِ وَشَارِبِهِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nused to trim his beard and moustache when he shaved at the end of a\nhajj or umra."}},{"id":200,"idInBook":200,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، أَنَّ رَجُلاً، أَتَى الْقَاسِمَ بْنَ مُحَمَّدٍ فَقَالَ إِنِّي أَفَضْتُ وَأَفَضْتُ مَعِي بِأَهْلِي ثُمَّ عَدَلْتُ إِلَى شِعْبٍ فَذَهَبْتُ لأَدْنُوَ مِنْ أَهْلِي فَقَالَتْ إِنِّي لَمْ أُقَصِّرْ مِنْ شَعَرِي بَعْدُ فَأَخَذْتُ مِنْ شَعَرِهَا بِأَسْنَانِي ثُمَّ وَقَعْتُ بِهَا فَضَحِكَ الْقَاسِمُ وَقَالَ مُرْهَا فَلْتَأْخُذْ مِنْ شَعَرِهَا بِالْجَلَمَيْنِ ‏.‏ قَالَ مَالِكٌ أَسْتَحِبُّ فِي مِثْلِ هَذَا أَنْ يُهْرِقَ دَمًا وَذَلِكَ أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ قَالَ مَنْ نَسِيَ مِنْ نُسُكِهِ شَيْئًا فَلْيُهْرِقْ دَمًا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Rabia ibn Abi Abd ar-Rahman\nthat a man came to Qasim ibn Muhammad and said, \"I did the tawaf al-\nifada along with my wife, and then I went off onto a mountain path and\napproached my wife to make love to her, and she said, 'I have not cut\nmy hair yet.' So I bit some of her hair off with my teeth and then had\nintercourse with her.\"  Qasim laughed and said, \"Tell her to cut her\nhair with some scissors.\"\n\n\nMalik said, \"To my liking an animal\nshould be sacrificed in an instance such as this, because Abdullah ibn\nAbbas said, 'Whoever forgets any of his rites on hajj should sacrifice\nan animal.' \""}},{"id":201,"idInBook":201,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ لَقِيَ رَجُلاً مِنْ أَهْلِهِ يُقَالُ لَهُ الْمُجَبَّرُ قَدْ أَفَاضَ وَلَمْ يَحْلِقْ وَلَمْ يُقَصِّرْ جَهِلَ ذَلِكَ فَأَمَرَهُ عَبْدُ اللَّهِ أَنْ يَرْجِعَ فَيَحْلِقَ أَوْ يُقَصِّرَ ثُمَّ يَرْجِعَ إِلَى الْبَيْتِ فَيُفِيضَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nonce met a relative of his called al-Mujabbar who had done the tawaf\nal-ifada but, out of ignorance, had not shaved his head or cut his\nhair. Abdullah told him to go back and shave his head or cut his hair,\nand then go back and do the tawaf al-ifada."}},{"id":202,"idInBook":202,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ سَالِمَ بْنَ عَبْدِ اللَّهِ، كَانَ إِذَا أَرَادَ أَنْ يُحْرِمَ دَعَا بِالْجَلَمَيْنِ فَقَصَّ شَارِبَهُ وَأَخَذَ مِنْ لِحْيَتِهِ قَبْلَ أَنْ يَرْكَبَ وَقَبْلَ أَنْ يُهِلَّ مُحْرِمًا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that when Salim\nibn Abdullah intended to go into ihram he would call for some scissors\nand trim his moustache and beard before setting off and before going\ninto ihram."}},{"id":203,"idInBook":203,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ مَنْ ضَفَرَ رَأْسَهُ فَلْيَحْلِقْ وَلاَ تَشَبَّهُوا بِالتَّلْبِيدِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi from 'Abdullah ibn 'Umar\nthat Umar ibn al-Khattab said, \"Someone who puts plaits in his hair\nshould shave his head, and do not plait your hair in such a way that\nit seems you have matted it.\""}},{"id":204,"idInBook":204,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ مَنْ عَقَصَ رَأْسَهُ أَوْ ضَفَرَ أَوْ لَبَّدَ فَقَدْ وَجَبَ عَلَيْهِ الْحِلاَقُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said from Said ibn\nal-Musayyab that Umar ibn al-Khattab said, \"Anyone who has braided his\nhair, or plaited it or matted it must shave his head.\""}},{"id":205,"idInBook":205,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم دَخَلَ الْكَعْبَةَ هُوَ وَأُسَامَةُ بْنُ زَيْدٍ وَبِلاَلُ بْنُ رَبَاحٍ وَعُثْمَانُ بْنُ طَلْحَةَ الْحَجَبِيُّ فَأَغْلَقَهَا عَلَيْهِ وَمَكَثَ فِيهَا ‏.‏ قَالَ عَبْدُ اللَّهِ فَسَأَلْتُ بِلاَلاً حِينَ خَرَجَ مَا صَنَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ جَعَلَ عَمُودًا عَنْ يَمِينِهِ وَعَمُودَيْنِ عَنْ يَسَارِهِ وَثَلاَثَةَ أَعْمِدَةٍ وَرَاءَهُ - وَكَانَ الْبَيْتُ يَوْمَئِذٍ عَلَى سِتَّةِ أَعْمِدَةٍ - ثُمَّ صَلَّى ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat the Messenger of Allah, may Allah bless him and grant him peace,\nentered the Kaba with Usama ibn Zayd, Bilal ibn Rabah and Uthman ibn\nTalha al-Hajabi and locked it behind him and stayed there for some\ntime.\n\n\nAbdullah said that he asked Bilal when he came out what\nthe Messenger of Allah had done there and he said, \"He positioned\nhimself with one support to his left, two supports to his right, and\nthree behind him (the house had six supports at that time) and then he\nprayed.\""}},{"id":206,"idInBook":206,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، أَنَّهُ قَالَ كَتَبَ عَبْدُ الْمَلِكِ بْنُ مَرْوَانَ إِلَى الْحَجَّاجِ بْنِ يُوسُفَ أَنْ لاَ تُخَالِفَ عَبْدَ اللَّهِ بْنَ عُمَرَ فِي شَىْءٍ مِنْ أَمْرِ الْحَجِّ ‏.‏ قَالَ فَلَمَّا كَانَ يَوْمُ عَرَفَةَ جَاءَهُ عَبْدُ اللَّهِ بْنُ عُمَرَ حِينَ زَالَتِ الشَّمْسُ وَأَنَا مَعَهُ فَصَاحَ بِهِ عِنْدَ سُرَادِقِهِ أَيْنَ هَذَا فَخَرَجَ عَلَيْهِ الْحَجَّاجُ وَعَلَيْهِ مِلْحَفَةٌ مُعَصْفَرَةٌ فَقَالَ مَا لَكَ يَا أَبَا عَبْدِ الرَّحْمَنِ فَقَالَ الرَّوَاحَ إِنْ كُنْتَ تُرِيدُ السُّنَّةَ ‏.‏ فَقَالَ أَهَذِهِ السَّاعَةَ قَالَ نَعَمْ ‏.‏ قَالَ فَأَنْظِرْنِي حَتَّى أُفِيضَ عَلَىَّ مَاءً ثُمَّ أَخْرُجَ ‏.‏ فَنَزَلَ عَبْدُ اللَّهِ حَتَّى خَرَجَ الْحَجَّاجُ فَسَارَ بَيْنِي وَبَيْنَ أَبِي فَقُلْتُ لَهُ إِنْ كُنْتَ تُرِيدُ أَنْ تُصِيبَ السُّنَّةَ الْيَوْمَ فَاقْصُرِ الْخُطْبَةَ وَعَجِّلِ الصَّلاَةَ - قَالَ - فَجَعَلَ يَنْظُرُ إِلَى عَبْدِ اللَّهِ بْنِ عُمَرَ كَيْمَا يَسْمَعَ ذَلِكَ مِنْهُ فَلَمَّا رَأَى ذَلِكَ عَبْدُ اللَّهِ قَالَ صَدَقَ سَالِمٌ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab that Salim ibn\nAbdullah said, ''Abd al-Malik ibn Marwan wrote to al-Hajjaj ibn Yusuf\ntelling him not to disagree with Abdullah ibn Umar about anything to\ndo with the hajj. Then, when the day of Arafa came Abdullah ibn Umar\nwent to him just after noon, and I went with him. He called out to him\noutside his tent, 'Where is this man?' and a-lHajjaj came out to him,\nwearing a blanket dyed with safflower, and said to him, 'What's up\nwith you, Abu Abd ar-Rahman?' He said, 'Hurry up, if you want to\nfollow the sunna.' Al-Hajjaj said, 'At this hour?' and he said, 'Yes.'\nAl-Hajjaj said, 'Wait until I have poured some water over myself, and\nthen I will come out.' So Abdullah dismounted and waited until al-\nHajjaj came out. He passed between me and my father and I said to him,\n'If you want to accord with the sunna today, then make the khutba\nshort, do not delay the prayer and do the prayer quickly.' Then he\nbegan looking at Abdullah ibn Umar to see if he would say the same\nthing, and when Abdullah saw that, he said, 'What Salim is saying is\ntrue.' \"\n\n\n20.64 Doing the Prayer at Mina on the Eighth Day of\nDhu-l-Hijja, and the Jumua at Mina and Arafa"}},{"id":207,"idInBook":207,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يُصَلِّي الظُّهْرَ وَالْعَصْرَ وَالْمَغْرِبَ وَالْعِشَاءَ وَالصُّبْحَ بِمِنًى ثُمَّ يَغْدُو إِذَا طَلَعَتِ الشَّمْسُ إِلَى عَرَفَةَ ‏.‏ قَالَ مَالِكٌ وَالأَمْرُ الَّذِي لاَ اخْتِلاَفَ فِيهِ عِنْدَنَا أَنَّ الإِمَامَ لاَ يَجْهَرُ بِالْقُرْآنِ فِي الظُّهْرِ يَوْمَ عَرَفَةَ وَأَنَّهُ يَخْطُبُ النَّاسَ يَوْمَ عَرَفَةَ وَأَنَّ الصَّلاَةَ يَوْمَ عَرَفَةَ إِنَّمَا هِيَ ظُهْرٌ وَإِنْ وَافَقَتِ الْجُمُعَةَ فَإِنَّمَا هِيَ ظُهْرٌ وَلَكِنَّهَا قُصِرَتْ مِنْ أَجْلِ السَّفَرِ ‏.‏ قَالَ مَالِكٌ فِي إِمَامِ الْحَاجِّ إِذَا وَافَقَ يَوْمُ الْجُمُعَةِ يَوْمَ عَرَفَةَ أَوْ يَوْمَ النَّحْرِ أَوْ بَعْضَ أَيَّامِ التَّشْرِيقِ إِنَّهُ لاَ يُجَمِّعُ فِي شَىْءٍ مِنْ تِلْكَ الأَيَّامِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nused to pray dhuhr, asr, maghrib, isha and subh at Mina. Then in the\nmorning, after the sun had risen, he would go to Arafa .\n\n\nMalik said, \"What we are all agreed upon here (in Madina) is that the\nimam does not recite the Qur'an out loud in dhuhr on the day of Arafa,\nand that he gives a khutba to the people on that day, and that the\nprayer on the day of Arafa is really a dhuhr prayer, and even if it\ncoincides with a jumua it is still a dhuhr prayer, but one which has\nbeen shortened because of travelling.\"\n\n\nMalik said that the\nimam of the pilgrims should not pray the jumua prayer if the day of\nArafa, the day of sacrifice or one of the three days after the day of\nsacrifice, was a Friday."}},{"id":208,"idInBook":208,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم صَلَّى الْمَغْرِبَ وَالْعِشَاءَ بِالْمُزْدَلِفَةِ جَمِيعًا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Salim ibn\nAbdullah from Abdullah ibn Umar that the Messenger of Allah, may Allah\nbless him and grant him peace, prayed maghrib and isha together at\nMuzdalifa."}},{"id":209,"idInBook":209,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ كُرَيْبٍ، مَوْلَى ابْنِ عَبَّاسٍ عَنْ أُسَامَةَ بْنِ زَيْدٍ، أَنَّهُ سَمِعَهُ يَقُولُ دَفَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ عَرَفَةَ حَتَّى إِذَا كَانَ بِالشِّعْبِ نَزَلَ فَبَالَ فَتَوَضَّأَ فَلَمْ يُسْبِغِ الْوُضُوءَ فَقُلْتُ لَهُ الصَّلاَةَ يَا رَسُولَ اللَّهِ ‏.‏ فَقَالَ ‏\n\"‏ الصَّلاَةُ أَمَامَكَ ‏\"‏ ‏.‏ فَرَكِبَ فَلَمَّا جَاءَ الْمُزْدَلِفَةَ نَزَلَ فَتَوَضَّأَ فَأَسْبَغَ الْوُضُوءَ ثُمَّ أُقِيمَتِ الصَّلاَةُ فَصَلَّى الْمَغْرِبَ ثُمَّ أَنَاخَ كُلُّ إِنْسَانٍ بَعِيرَهُ فِي مَنْزِلِهِ ثُمَّ أُقِيمَتِ الْعِشَاءُ فَصَلاَّهَا وَلَمْ يُصَلِّ بَيْنَهُمَا شَيْئًا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Musa ibn Uqba that Kurayb,\nthe mawla of Ibn 'Abbas, heard Usama ibn Zayd say, \"The Messenger\nofAllah, may Allah bless him and grant him peace, left Arafa and then,\nwhen he reached ash-Shib, he dismounted and urinated and then did\nwudu, though not thoroughly. I said to him, 'It is time for the\nprayer, Messenger of Allah,' and he said 'The prayer is ahead of you,'\nand then mounted. When we arrived at Muzdalifa he dismounted and did\nwudu thoroughly. Then the iqama was said for the prayer and he prayed\nmaghrib. After that everyone settled his camel in its resting-place,\nand then the iqama for isha was said and he prayed it, without having\nprayed anything between the two.\""}},{"id":210,"idInBook":210,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَدِيِّ بْنِ ثَابِتٍ الأَنْصَارِيِّ، أَنَّ عَبْدَ اللَّهِ بْنَ يَزِيدَ الْخَطْمِيَّ، أَخْبَرَهُ أَنَّ أَبَا أَيُّوبَ الأَنْصَارِيَّ أَخْبَرَهُ أَنَّهُ، صَلَّى مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي حَجَّةِ الْوَدَاعِ الْمَغْرِبَ وَالْعِشَاءَ بِالْمُزْدَلِفَةِ جَمِيعًا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said from Adi ibn\nThabit al-Ansari that Abdullah ibn Yazid al-Khatmi told him that Abu\nAyyub al-Ansari told him that he prayed maghrib and isha together at\nMuzdalifa during the farewell hajj, with the Messenger of Allah, may\nAllah bless him and grant him peace."}},{"id":211,"idInBook":211,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يُصَلِّي الْمَغْرِبَ وَالْعِشَاءَ بِالْمُزْدَلِفَةِ جَمِيعًا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nused to pray maghrib and isha together at Muzdalifa."}},{"id":212,"idInBook":212,"chapterId":20,"bookId":7,"arabic":"","english":{"narrator":"","text":"Malik said that the people of Makka who are doing hajj should\nshorten the prayer to two rakas when at Mina until they go back to Ma\nka."}},{"id":213,"idInBook":213,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم صَلَّى الصَّلاَةَ الرُّبَاعِيَّةَ بِمِنًى رَكْعَتَيْنِ وَأَنَّ أَبَا بَكْرٍ صَلاَّهَا بِمِنًى رَكْعَتَيْنِ وَأَنَّ عُمَرَ بْنَ الْخَطَّابِ صَلاَّهَا بِمِنًى رَكْعَتَيْنِ وَأَنَّ عُثْمَانَ صَلاَّهَا بِمِنًى رَكْعَتَيْنِ شَطْرَ إِمَارَتِهِ ثُمَّ أَتَمَّهَا بَعْدُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa from his\nfather that the Messenger of Allah, may Allah bless him and grant him\npeace, prayed four raka prayers with only two rakas when at Mina, and\nthat Abu Bakr prayed them at Mina with only two rakas, and that Umar\nibn al-Khattab prayed them at Mina with only two rakas, and that\nUthman prayed them at Mina with only two rakas for half of his\nkhalifate, and then later completed them."}},{"id":214,"idInBook":214,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، ‏.‏ أَنَّ عُمَرَ بْنَ الْخَطَّابِ، لَمَّا قَدِمَ مَكَّةَ صَلَّى بِهِمْ رَكْعَتَيْنِ ثُمَّ انْصَرَفَ فَقَالَ يَا أَهْلَ مَكَّةَ أَتِمُّوا صَلاَتَكُمْ فَإِنَّا قَوْمٌ سَفْرٌ ‏.‏ ثُمَّ صَلَّى عُمَرُ بْنُ الْخَطَّابِ رَكْعَتَيْنِ بِمِنًى وَلَمْ يَبْلُغْنَا أَنَّهُ قَالَ لَهُمْ شَيْئًا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Said ibn al-\nMusayyab that Umar ibn al-Khattab prayed two rakas with everybody when\nhe arrived in Makka. Then, when he had finished, he said, \"People of\nMakka, complete your prayer, because we are a group of travellers.\"\nLater, Umar ibn al-Khattab prayed two rakas with them at Mina, but we\nhave not heard that he said anything to them on that occasion."}},{"id":215,"idInBook":215,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَبِيهِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، صَلَّى لِلنَّاسِ بِمَكَّةَ رَكْعَتَيْنِ فَلَمَّا انْصَرَفَ قَالَ يَا أَهْلَ مَكَّةَ أَتِمُّوا صَلاَتَكُمْ فَإِنَّا قَوْمٌ سَفْرٌ ‏.‏ ثُمَّ صَلَّى عُمَرُ رَكْعَتَيْنِ بِمِنًى وَلَمْ يَبْلُغْنَا أَنَّهُ قَالَ لَهُمْ شَيْئًا ‏.‏ سُئِلَ مَالِكٌ عَنْ أَهْلِ مَكَّةَ كَيْفَ صَلاَتُهُمْ بِعَرَفَةَ أَرَكْعَتَانِ أَمْ أَرْبَعٌ وَكَيْفَ بِأَمِيرِ الْحَاجِّ إِنْ كَانَ مِنْ أَهْلِ مَكَّةَ أَيُصَلِّي الظُّهْرَ وَالْعَصْرَ بِعَرَفَةَ أَرْبَعَ رَكَعَاتٍ أَوْ رَكْعَتَيْنِ وَكَيْفَ صَلاَةُ أَهْلِ مَكَّةَ فِي إِقَامَتِهِمْ فَقَالَ مَالِكٌ يُصَلِّي أَهْلُ مَكَّةَ بِعَرَفَةَ وَمِنًى مَا أَقَامُوا بِهِمَا رَكْعَتَيْنِ رَكْعَتَيْنِ يَقْصُرُونَ الصَّلاَةَ حَتَّى يَرْجِعُوا إِلَى مَكَّةَ ‏.‏ قَالَ وَأَمِيرُ الْحَاجِّ أَيْضًا إِذَا كَانَ مِنْ أَهْلِ مَكَّةَ قَصَرَ الصَّلاَةَ بِعَرَفَةَ وَأَيَّامَ مِنًى وَإِنْ كَانَ أَحَدٌ سَاكِنًا بِمِنًى مُقِيمًا بِهَا فَإِنَّ ذَلِكَ يُتِمُّ الصَّلاَةَ بِمِنًى وَإِنْ كَانَ أَحَدٌ سَاكِنًا بِعَرَفَةَ مُقِيمًا بِهَا فَإِنَّ ذَلِكَ يُتِمُّ الصَّلاَةَ بِهَا أَيْضًا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Zayd ibn Aslam from his\nfather that Umar ibn al-Khattab prayed two rakas with the people of\nMakka, and then, when he had finished, he said, \"People of Makka,\ncomplete your prayer, becausewe are a group of travellers.\" Later,\nUmar prayed two rakas with them at Mina, but we have not heard that he\nsaid anything to them on that occasion.\n\n\nMalik was asked\nwhether the people of Makka should pray two rakas at Arafa or four,\nand whether the amir of the hajj, if he was a Makkan, should pray\ndhuhr and asr with four rakas or two, and also how the people of Makka\nwho were living (at Mina) should pray, and he said, \"The people of\nMakka should pray only two rakas at Arafa and Mina for as long as they\nstay there, and should shorten the prayer until they return to Makka.\nThe amir of the hajj, if he is a Makkan, should also shorten the\nprayer at Arafa and during the days of Mina. Anyone who is living at\nMina as a resident should do the full prayer at Mina, and similarly\nanyone who lives at Arafa and is a resident there should do the full\nprayer at Arafa.\""}},{"id":216,"idInBook":216,"chapterId":20,"bookId":7,"arabic":"","english":{"narrator":"","text":"Yahya related to me that Malik said, \"Someone who comes to Makka\nat or before the new moon of Dhu'l-Hij ja and goes into ihram for the\nhajj should do the full prayer until he leaves Makka for Mina, and\nthen he should shorten the prayer. This is because he has decided to\nstay there for more than four nights.\""}},{"id":217,"idInBook":217,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ بَلَغَهُ أَنَّ عُمَرَ بْنَ الْخَطَّابِ، خَرَجَ الْغَدَ مِنْ يَوْمِ النَّحْرِ حِينَ ارْتَفَعَ النَّهَارُ شَيْئًا فَكَبَّرَ فَكَبَّرَ النَّاسُ بِتَكْبِيرِهِ ثُمَّ خَرَجَ الثَّانِيَةَ مِنْ يَوْمِهِ ذَلِكَ بَعْدَ ارْتِفَاعِ النَّهَارِ فَكَبَّرَ فَكَبَّرَ النَّاسُ بِتَكْبِيرِهِ ثُمَّ خَرَجَ الثَّالِثَةَ حِينَ زَاغَتِ الشَّمْسُ فَكَبَّرَ فَكَبَّرَ النَّاسُ بِتَكْبِيرِهِ حَتَّى يَتَّصِلَ التَّكْبِيرُ وَيَبْلُغَ الْبَيْتَ فَيُعْلَمَ أَنَّ عُمَرَ قَدْ خَرَجَ يَرْمِي ‏.‏ قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا أَنَّ التَّكْبِيرَ فِي أَيَّامِ التَّشْرِيقِ دُبُرَ الصَّلَوَاتِ وَأَوَّلُ ذَلِكَ تَكْبِيرُ الإِمَامِ وَالنَّاسُ مَعَهُ دُبُرَ صَلاَةِ الظُّهْرِ مِنْ يَوْمِ النَّحْرِ وَآخِرُ ذَلِكَ تَكْبِيرُ الإِمَامِ وَالنَّاسُ مَعَهُ دُبُرَ صَلاَةِ الصُّبْحِ مِنْ آخِرِ أَيَّامِ التَّشْرِيقِ ثُمَّ يَقْطَعُ التَّكْبِيرَ ‏.‏ قَالَ مَالِكٌ وَالتَّكْبِيرُ فِي أَيَّامِ التَّشْرِيقِ عَلَى الرِّجَالِ وَالنِّسَاءِ مَنْ كَانَ فِي جَمَاعَةٍ أَوْ وَحْدَهُ بِمِنًى أَوْ بِالآفَاقِ كُلِّهَا وَاجِبٌ وَإِنَّمَا يَأْتَمُّ النَّاسُ فِي ذَلِكَ بِإِمَامِ الْحَاجِّ وَبِالنَّاسِ بِمِنًى لأَنَّهُمْ إِذَا رَجَعُوا وَانْقَضَى الإِحْرَامُ ائْتَمُّوا بِهِمْ حَتَّى يَكُونُوا مِثْلَهُمْ فِي الْحِلِّ فَأَمَّا مَنْ لَمْ يَكُنْ حَاجًّا فَإِنَّهُ لاَ يَأْتَمُّ بِهِمْ إِلاَّ فِي تَكْبِيرِ أَيَّامِ التَّشْرِيقِ ‏.‏ قَالَ مَالِكٌ الأَيَّامُ الْمَعْدُودَاتُ أَيَّامُ التَّشْرِيقِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said that he had\nheard that on the day after the day of sacrifice Umar ibn al-Khattab\nwent out a little after the sun had risen and said the takbir, and\neveryone repeated it after him. Then he went out a second time the\nsame day when the sun was well up and said the takbir, and everyone\nrepeated it after him. Then he went out a third time after mid-day and\nsaid the takbir, and everyone repeated it after him until it resounded\nfrom group to group until it reached the House and people knew that\nUmar had left to throw the stones.\n\n\nMalik said, \"What we do\nhere (in Madina) is to say the takbir during the days of tashriq after\neach prayer. The first time is when the imam and everyone with him\nsays the takbir after the dhuhr prayer on the day of sacrifice, and\nthe last is when the imam and everyone with him says the takbir after\nsubh on the last of the days of tashriq, after which he stops saying\nthe takbir.\"\n\n\nMalik said, \"The takbirs during the days of\ntashriq should be done by both men and women, whether they are in a\ngroup or by themselves, at Mina or elsewhere, and all of the takbirs\nshould be done. In this everyone follows the imam of the hajj and the\npeople at Mina, because when everyone returns (to Makka) and comes out\nof ihram they keep the same people as imams while out of ihram (as\nthey did when they were in ihram). Some one who is not doing hajj does\nnot follow them except for the takbirs during the days of tashriq.\"\n\n\nMalik said, \"The 'limited number of days' are the days of\ntashriq.\""}},{"id":218,"idInBook":218,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَنَاخَ بِالْبَطْحَاءِ الَّتِي بِذِي الْحُلَيْفَةِ فَصَلَّى بِهَا ‏.‏ قَالَ نَافِعٌ وَكَانَ عَبْدُ اللَّهِ بْنُ عُمَرَ يَفْعَلُ ذَلِكَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat the Messenger of Allah, may Allah bless him and grant him peace,\nmade his camel kneel down at al-Batha, which is at Dhu'l-Hulayfa, and\nprayed there. Nafi said, \"Abdullah ibn Umar used to do that.\"\n\n\nMalik said, \"No-one should go past al-Muarras when he is returning\nfrom hajj without praying there. If he passes it at a time when prayer\nis not permissible he should stay there until prayer is permissible\nand then pray whatever he feels is appropriate. (This is) because I\nhave heard that the Messenger of Allah, may Allah bless him and grant\nhim peace, stopped there to rest, and that Abdullah ibn Umar stopped\nhis camel there also.\""}},{"id":219,"idInBook":219,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يُصَلِّي الظُّهْرَ وَالْعَصْرَ وَالْمَغْرِبَ وَالْعِشَاءَ بِالْمُحَصَّبِ ثُمَّ يَدْخُلُ مَكَّةَ مِنَ اللَّيْلِ فَيَطُوفُ بِالْبَيْتِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nused to pray dhuhr, asr, maghrib and isha at al-Muhassab, and then\nenter Makka at night and do tawaf of the House."}},{"id":220,"idInBook":220,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّهُ قَالَ زَعَمُوا أَنَّ عُمَرَ بْنَ الْخَطَّابِ، كَانَ يَبْعَثُ رِجَالاً يُدْخِلُونَ النَّاسَ مِنْ وَرَاءِ الْعَقَبَةِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Nafi said, \"They say that\nUmar ibn al-Khattab used to send men out to bring people in from\nbeyond al-Aqaba.\""}},{"id":221,"idInBook":221,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ لاَ يَبِيتَنَّ أَحَدٌ مِنَ الْحَاجِّ لَيَالِيَ مِنًى مِنْ وَرَاءِ الْعَقَبَةِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat Umar ibn al-Khattab said, \"No-one doing hajj should spend the\nnights of Mina beyond al-Aqaba.\""}},{"id":222,"idInBook":222,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّهُ قَالَ فِي الْبَيْتُوتَةِ بِمَكَّةَ لَيَالِيَ مِنًى لاَ يَبِيتَنَّ أَحَدٌ إِلاَّ بِمِنًى ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa that his\nfather said, talking about spending the nights of Mina at Makka, \"No-\none must spend the night anywhere except Mina.\""}},{"id":223,"idInBook":223,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عُمَرَ بْنَ الْخَطَّابِ، كَانَ يَقِفُ عِنْدَ الْجَمْرَتَيْنِ الأُولَيَيْنِ وُقُوفًا طَوِيلاً حَتَّى يَمَلَّ الْقَائِمُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Umar ibn\nal-Khattab used to stop at the first two jamras for such a long time\nthat someone standing up would get tired."}},{"id":224,"idInBook":224,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقِفُ عِنْدَ الْجَمْرَتَيْنِ الأُولَيَيْنِ وُقُوفًا طَوِيلاً يُكَبِّرُ اللَّهَ وَيُسَبِّحُهُ وَيَحْمَدُهُ وَيَدْعُو اللَّهَ وَلاَ يَقِفُ عِنْدَ جَمْرَةِ الْعَقَبَةِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nused to stop for a long time at the first two jamras saying, \"Allah is\ngreater\", \"Glory be to Allah\", \"Praise be to Allah\", and making duas\nto Allah, but he did not stop at the jamrat al-Aqaba."}},{"id":225,"idInBook":225,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يُكَبِّرُ عِنْدَ رَمْىِ الْجَمْرَةِ كُلَّمَا رَمَى بِحَصَاةٍ ‏.‏ وَحَدَّثَنِي عَنْ مَالِكٍ أَنَّهُ سَمِعَ بَعْضَ أَهْلِ الْعِلْمِ يَقُولُ الْحَصَى الَّتِي يُرْمَى بِهَا الْجِمَارُ مِثْلُ حَصَى الْخَذْفِ ‏.‏ قَالَ مَالِكٌ وَأَكْبَرُ مِنْ ذَلِكَ قَلِيلاً أَعْجَبُ إِلَىَّ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nused to say \"Allah is greater\" whenever he threw a pebble while\nstoning the jamra."}},{"id":226,"idInBook":226,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقُولُ مَنْ غَرَبَتْ لَهُ الشَّمْسُ مِنْ أَوْسَطِ أَيَّامِ التَّشْرِيقِ وَهُوَ بِمِنًى فَلاَ يَنْفِرَنَّ حَتَّى يَرْمِيَ الْجِمَارَ مِنَ الْغَدِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard some of the\npeople of knowledge saying, \"The pebbles used for stoning the jamras\nshould be like the stones used as slingshot.\"\n\n\nMalik said, \"I\nlike it better if they are a little larger than that.\"\n\n\nYahya\nrelated to me from Malik from Nafi that Abdullah ibn Umar used to say,\n\"Someone who is at Mina when the sun sets in the middle of the days of\ntashriq must not leave until he has stoned the jamras on the following\nday.\""}},{"id":227,"idInBook":227,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، أَنَّ النَّاسَ، كَانُوا إِذَا رَمَوُا الْجِمَارَ مَشَوْا ذَاهِبِينَ وَرَاجِعِينَ وَأَوَّلُ مَنْ رَكِبَ مُعَاوِيَةُ بْنُ أَبِي سُفْيَانَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abd ar-Rahman ibn Qasim from\nhis father that when people went to stone the jamras they would walk\nboth going there and coming back. The first one to ride was Muawiya\nibn Abi Sufyan."}},{"id":228,"idInBook":228,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ سَأَلَ عَبْدَ الرَّحْمَنِ بْنَ الْقَاسِمِ مِنْ أَيْنَ كَانَ الْقَاسِمُ يَرْمِي جَمْرَةَ الْعَقَبَةِ فَقَالَ مِنْ حَيْثُ تَيَسَّرَ ‏.‏ قَالَ يَحْيَى سُئِلَ مَالِكٌ هَلْ يُرْمَى عَنِ الصَّبِيِّ وَالْمَرِيضِ فَقَالَ نَعَمْ وَيَتَحَرَّى الْمَرِيضُ حِينَ يُرْمَى عَنْهُ فَيُكَبِّرُ وَهُوَ فِي مَنْزِلِهِ وَيُهَرِيقُ دَمًا فَإِنْ صَحَّ الْمَرِيضُ فِي أَيَّامِ التَّشْرِيقِ رَمَى الَّذِي رُمِيَ عَنْهُ وَأَهْدَى وُجُوبًا ‏.‏ قَالَ مَالِكٌ لاَ أَرَى عَلَى الَّذِي يَرْمِي الْجِمَارَ أَوْ يَسْعَى بَيْنَ الصَّفَا وَالْمَرْوَةِ وَهُوَ غَيْرُ مُتَوَضِّئٍ إِعَادَةً وَلَكِنْ لاَ يَتَعَمَّدُ ذَلِكَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he asked Abd ar-Rahman ibn\nQasim, \"From where did Qasim stonethe jamrat al-Aqaba?\"and he replied,\n\"From wherever it was possible.\"\n\n\nYahya said that Malik was\nasked whether some one else could throw the stones for a child or a\nsick man and he said, \"Yes, and a sick man should inquire as to when\nthe stones will be thrown for him and then say the takbir while he is\nin the place where he is staying, bleeding. If a sick man regains his\nhealth during the days of tashriq, he should stone whatever stoning\nhas been done for him and he must offer a sacrificial animal.\"\n\n\nMalik said, \"I do not consider that someone who stones the jamras\nor does say between Safa and Marwa without being in wudu has to repeat\nanything, but he should not make a general practice of it.\""}},{"id":229,"idInBook":229,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقُولُ لاَ تُرْمَى الْجِمَارُ فِي الأَيَّامِ الثَّلاَثَةِ حَتَّى تَزُولَ الشَّمْسُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nused to say, \"The jamras should not be stoned during the three days\nuntil after the sun has passed the meridian.\""}},{"id":230,"idInBook":230,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ حَزْمٍ، عَنْ أَبِيهِ، أَنَّ أَبَا الْبَدَّاحِ بْنَ عَاصِمِ بْنِ عَدِيٍّ، أَخْبَرَهُ عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَرْخَصَ لِرِعَاءِ الإِبِلِ فِي الْبَيْتُوتَةِ خَارِجِينَ عَنْ مِنًى يَرْمُونَ يَوْمَ النَّحْرِ ثُمَّ يَرْمُونَ الْغَدَ وَمِنْ بَعْدِ الْغَدِ لِيَوْمَيْنِ ثُمَّ يَرْمُونَ يَوْمَ النَّفْرِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abdullah ibn Abi Bakr ibn\nHazm from his father that Abu'l-Baddah ibn Asim ibn Adi told him from\nhis father that the Messenger of Allah, may Allah bless him and grant\nhim peace, allowed the camel-herders to spend the night outside of\nMina, and they threw the stones (once) on the day of sacrifice, and\n(once) for the following day and the day after that, and (once) on the\nday when they left Mina."}},{"id":231,"idInBook":231,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ، أَنَّهُ سَمِعَهُ يَذْكُرُ، أَنَّهُ أُرْخِصَ لِلرِّعَاءِ أَنْ يَرْمُوا، بِاللَّيْلِ يَقُولُ فِي الزَّمَانِ الأَوَّلِ ‏.‏ قَالَ مَالِكٌ تَفْسِيرُ الْحَدِيثِ الَّذِي أَرْخَصَ فِيهِ رَسُولُ اللَّهِ صلى الله عليه وسلم لِرِعَاءِ الإِبِلِ فِي تَأْخِيرِ رَمْىِ الْجِمَارِ فِيمَا نُرَى - وَاللَّهُ أَعْلَمُ - أَنَّهُمْ يَرْمُونَ يَوْمَ النَّحْرِ فَإِذَا مَضَى الْيَوْمُ الَّذِي يَلِي يَوْمَ النَّحْرِ رَمَوْا مِنَ الْغَدِ وَذَلِكَ يَوْمُ النَّفْرِ الأَوَّلِ فَيَرْمُونَ لِلْيَوْمِ الَّذِي مَضَى ثُمَّ يَرْمُونَ لِيَوْمِهِمْ ذَلِكَ لأَنَّهُ لاَ يَقْضِي أَحَدٌ شَيْئًا حَتَّى يَجِبَ عَلَيْهِ فَإِذَا وَجَبَ عَلَيْهِ وَمَضَى كَانَ الْقَضَاءُ بَعْدَ ذَلِكَ فَإِنْ بَدَا لَهُمُ النَّفْرُ فَقَدْ فَرَغُوا وَإِنْ أَقَامُوا إِلَى الْغَدِ رَمَوْا مَعَ النَّاسِ يَوْمَ النَّفْرِ الآخِرِ وَنَفَرُوا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that\n\n\nYahya ibn Said heard\nAta ibn Abi Rabah mentioning that the camel-herders were allowed to\nthrow the stones at night, and saying that this was in the early\nperiod (of Islam).\n\n\nMalik said, \"The explanation of the hadith\nwhere the Messenger of Allah, may Allah bless him and grant him peace,\nallowed the camel-herders to delay the stoning of the jamras is, in\nour view, and Allah knows best, that they threw stones on the day of\nsacrifice, and then threw again two days later, which was the first\npossible day for leaving, and this throwing was for the day which had\npassed. They then threw again for the day itself, because it is only\npossible for someone to make up for something which is obligatory for\nhim, and when something obligatory passes someone by (without him\ndoing it) he must necessarily make it up afterwards (and not\nbeforehand). So (in the case of the camel-herders), if it seemed\nappropriate for them to leave that day, they would have done all that\nthey were supposed to do, and if they were to stay until the following\nday, they would throw stones with everybody else on the second and\nlast day for leaving, and then leave.\""}},{"id":232,"idInBook":232,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي بَكْرِ بْنِ نَافِعٍ، عَنْ أَبِيهِ، أَنَّ ابْنَةَ أَخٍ، لِصَفِيَّةَ بِنْتِ أَبِي عُبَيْدٍ نُفِسَتْ بِالْمُزْدَلِفَةِ فَتَخَلَّفَتْ هِيَ وَصَفِيَّةُ حَتَّى أَتَتَا مِنًى بَعْدَ أَنْ غَرَبَتِ الشَّمْسُ مِنْ يَوْمِ النَّحْرِ فَأَمَرَهُمَا عَبْدُ اللَّهِ بْنُ عُمَرَ أَنْ تَرْمِيَا الْجَمْرَةَ حِينَ أَتَتَا وَلَمْ يَرَ عَلَيْهِمَا شَيْئًا ‏.‏ قَالَ يَحْيَى سُئِلَ مَالِكٌ عَمَّنْ نَسِيَ جَمْرَةً مِنَ الْجِمَارِ فِي بَعْضِ أَيَّامِ مِنًى حَتَّى يُمْسِيَ قَالَ لِيَرْمِ أَىَّ سَاعَةٍ ذَكَرَ مِنْ لَيْلٍ أَوْ نَهَارٍ كَمَا يُصَلِّي الصَّلاَةَ إِذَا نَسِيَهَا ثُمَّ ذَكَرَهَا لَيْلاً أَوْ نَهَارًا فَإِنْ كَانَ ذَلِكَ بَعْدَ مَا صَدَرَ وَهُوَ بِمَكَّةَ أَوْ بَعْدَ مَا يَخْرُجُ مِنْهَا فَعَلَيْهِ الْهَدْىُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu Bakr ibn Nafi from his\nfather that the daughter of one of Safiyya bint Abi Ubayd's brothers\nwas bleeding after she had given birth to a child at Muzdalifa. She\nand Safiyya were delayed and did not arrive at Mina until after the\nsun had set on the day of sacrifice. Abdullah ibn Umar told them both\nto stone the jamra at the time they arrived and he did not think that\nthey owed anything.\n\n\nYahya said that Malik was asked about\nsome one who forgot to stone one of the jamras on one of the days of\nMina until it was evening and he said, \"He should throw the stones at\nwhatever time of day or night he remembers, just as he would pray the\nprayer if he forgot it and then remembered it at any time of day or\nnight. If he remembers (that he has not done the stoning) after he has\nreturned to Makka, or after he has left, he must sacrifice an animal.\""}},{"id":233,"idInBook":233,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، وَعَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، خَطَبَ النَّاسَ بِعَرَفَةَ وَعَلَّمَهُمْ أَمْرَ الْحَجِّ وَقَالَ لَهُمْ فِيمَا قَالَ إِذَا جِئْتُمْ مِنًى فَمَنْ رَمَى الْجَمْرَةَ فَقَدْ حَلَّ لَهُ مَا حَرُمَ عَلَى الْحَاجِّ إِلاَّ النِّسَاءَ وَالطِّيبَ لاَ يَمَسَّ أَحَدٌ نِسَاءً وَلاَ طِيبًا حَتَّى يَطُوفَ بِالْبَيْتِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi and Abdullah ibn Dinar\nfrom Abdullah ibn Umar that Umar ibn al-Khattab gave a khutba to the\npeople at Arafa and taught them the conduct of the hajj, and one of\nthe things he said to them in his speech was, \"When you get to Mina\nand have stoned the jamra then whatever is haram for someone doing the\nhajj becomes halal, except women and scent. No-one should touch women\nor scent until he has done tawaf of the House.\""}},{"id":234,"idInBook":234,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، وَعَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ مَنْ رَمَى الْجَمْرَةَ ثُمَّ حَلَقَ أَوْ قَصَّرَ وَنَحَرَ هَدْيًا - إِنْ كَانَ مَعَهُ - فَقَدْ حَلَّ لَهُ مَا حَرُمَ عَلَيْهِ إِلاَّ النِّسَاءَ وَالطِّيبَ حَتَّى يَطُوفَ بِالْبَيْتِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi and Abdullah ibn Dinar\nfrom Abdullah ibn Umar that Umar ibn al-Khattab said, \"When someone\nhas stoned the jamra and shaved his head or cut off some of his hair\nand sacrificed an animal, whatever was haram for him becomes halal,\nexcept women and scent, (which remain haram for him) until he has done\ntawaf of the House.\""}},{"id":235,"idInBook":235,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ، أَنَّهَا قَالَتْ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم عَامَ حَجَّةِ الْوَدَاعِ فَأَهْلَلْنَا بِعُمْرَةٍ ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ كَانَ مَعَهُ هَدْىٌ فَلْيُهْلِلْ بِالْحَجِّ مَعَ الْعُمْرَةِ ثُمَّ لاَ يَحِلُّ حَتَّى يَحِلَّ مِنْهُمَا جَمِيعًا ‏\"‏ ‏.‏ قَالَتْ فَقَدِمْتُ مَكَّةَ وَأَنَا حَائِضٌ فَلَمْ أَطُفْ بِالْبَيْتِ وَلاَ بَيْنَ الصَّفَا وَالْمَرْوَةِ فَشَكَوْتُ ذَلِكَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ انْقُضِي رَأْسَكِ وَامْتَشِطِي وَأَهِلِّي بِالْحَجِّ وَدَعِي الْعُمْرَةَ ‏\"‏ ‏.‏ قَالَتْ فَفَعَلْتُ فَلَمَّا قَضَيْنَا الْحَجَّ أَرْسَلَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم مَعَ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ الصِّدِّيقِ إِلَى التَّنْعِيمِ فَاعْتَمَرْتُ فَقَالَ ‏\"‏ هَذَا مَكَانُ عُمْرَتِكِ ‏\"‏ ‏.‏ فَطَافَ الَّذِينَ أَهَلُّوا بِالْعُمْرَةِ بِالْبَيْتِ وَبَيْنَ الصَّفَا وَالْمَرْوَةِ ثُمَّ حَلُّوا مِنْهَا ثُمَّ طَافُوا طَوَافًا آخَرَ بَعْدَ أَنْ رَجَعُوا مِنْ مِنًى لِحَجِّهِمْ وَأَمَّا الَّذِينَ كَانُوا أَهَلُّوا بِالْحَجِّ أَوْ جَمَعُوا الْحَجَّ وَالْعُمْرَةَ فَإِنَّمَا طَافُوا طَوَافًا وَاحِدًا ‏.‏ \n وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، بِمِثْلِ ذَلِكَ ‏.","english":{"narrator":"","text":"Yahya related to me from Abd ar-Rahman ibn al-Qasim, from his\nfather that A'isha, umm al-muminin, said, \"We set out with the\nMessenger of Allah, may Allah bless him and grant him peace, in the\nyear of the farewell hajj and we went into ihram for umra. Afterwards,\nthe Messenger of Allah, may Allah bless him and grant him peace, said,\n'Whoever has a sacrificial animal with him should go into ihram for\nhajj and umra together, and he should not leave ihram without leaving\nihram for both of them at the same time.' \"\n\n\nShe continued \"I\nwas menstruating when I got to Makka, so I did not do tawaf of the\nHouse or say between Safa and Marwa. I complained to the Messenger of\nAllah, may Allah bless him and grant him peace, and he said, 'Undo\nyour hair and comb it and leave the umra and go back into ihram for\nthe hajj.' \"\n\n\nShe said, \"I did so, and when we had completed\nthe hajj, the Messenger of Allah, may Allah bless him and grant him\npeace, sent me with Abd ar-Rahman ibn Abi Bakr as-Siddiq to at-Tanim\nand I performed an umra and he said, 'This is in place of your umra.'\n\"\n\n\n\"Those who had entered ihram for the umra did tawaf of the\nHouse and say between Safa and Marwa, then left ihram. Then they did\nanother tawaf after returning from Mina for their hajj, whereas those\nwho entered ihram for the hajj or combined the hajj and the umra, only\ndid one tawaf.\"\n\n\nYahya related the same as that to me from\nMalik from Ibn Shihab from Urwa ibn az-Zubayr from A'isha."}},{"id":236,"idInBook":236,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّهَا قَالَتْ قَدِمْتُ مَكَّةَ وَأَنَا حَائِضٌ، فَلَمْ أَطُفْ بِالْبَيْتِ وَلاَ بَيْنَ الصَّفَا وَالْمَرْوَةِ فَشَكَوْتُ ذَلِكَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ افْعَلِي مَا يَفْعَلُ الْحَاجُّ غَيْرَ أَنْ لاَ تَطُوفِي بِالْبَيْتِ وَلاَ بَيْنَ الصَّفَا وَالْمَرْوَةِ حَتَّى تَطْهُرِي ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abd ar-Rahman ibn al-Qasim\nfrom his father that A'isha said, \"I came to Makka at the time of my\nperiod so I did not do tawaf of the House or go between Safa and\nMarwa. I complained to the Messenger of Allah, may Allah bless him and\ngrant him peace, and he said, 'Do what the people doing hajj do except\ndo not do tawaf of the House and go between Safa and Marwa until you\nare pure.' \"\n\n\nMalik said, concerning a woman who entered ihram\nfor umra at the time of hajj, and she arrived in Makka during her\nperiod and so could not do tawaf of the House, \"When she fears that\nthe time (for hajj) is getting close, she gets into ihram for the hajj\nand sacrifices an animal. She is like someone who combines the hajj\nand the umra. One tawaf is enough for her. If a women starts her\nperiod after she has already done tawaf of the House and prayed, she\ndoes say between Safa and Marwa and stops at Arafa and Muzdalifa and\nstones the jamras but she does not do the tawaf al-ifada until she is\npure and has finished her menses.\""}},{"id":237,"idInBook":237,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ، أَنَّ صَفِيَّةَ بِنْتَ حُيَىٍّ، حَاضَتْ فَذَكَرْتُ ذَلِكَ لِلنَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\"‏ أَحَابِسَتُنَا هِيَ ‏\"‏ ‏.‏ فَقِيلَ إِنَّهَا قَدْ أَفَاضَتْ ‏.‏ فَقَالَ ‏\"‏ فَلاَ إِذًا ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abd ar-Rahman ibn al-Qasim\nfrom his father from A'isha umm al-muminin that Safiyya bint Huyy\nbegan menstruating and so she mentioned it to the Messenger of Allah,\nmay Allah bless him and grant him peace, and he asked, \"Will she delay\nus?\" and he was told, \"She has already done the tawaf al-ifada,\" and\nhe said, \"Then she will not delay us. \""}},{"id":238,"idInBook":238,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ حَزْمٍ، عَنْ أَبِيهِ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ، أَنَّهَا قَالَتْ لِرَسُولِ اللَّهِ صلى الله عليه وسلم يَا رَسُولَ اللَّهِ إِنَّ صَفِيَّةَ بِنْتَ حُيَىٍّ قَدْ حَاضَتْ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَعَلَّهَا تَحْبِسُنَا أَلَمْ تَكُنْ طَافَتْ مَعَكُنَّ بِالْبَيْتِ ‏\"‏ ‏.‏ قُلْنَ بَلَى ‏.‏ قَالَ ‏\"‏ فَاخْرُجْنَ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abdullah ibn Abi Bakr ibn\nHazm from his father from Amra bint Abd ar-Rahman that A'isha umm al-\nmuminin said to the Messenger of Allah, may Allah bless him and grant\nhim peace, \"Messenger of Allah, Safiyya bint Huyy has begun her\nperiod,\" and the Messenger of Allah, may Allah bless him and grant him\npeace, said, \"Perhaps she will delay us. Has she done tawaf of the\nHouse with you?\" They said, \"Of course.\" He said, \"So you are free to\nleave.\""}},{"id":239,"idInBook":239,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الرِّجَالِ، مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، ‏.‏ أَنَّ عَائِشَةَ أُمَّ الْمُؤْمِنِينَ، كَانَتْ إِذَا حَجَّتْ وَمَعَهَا نِسَاءٌ تَخَافُ أَنْ يَحِضْنَ قَدَّمَتْهُنَّ يَوْمَ النَّحْرِ فَأَفَضْنَ فَإِنْ حِضْنَ بَعْدَ ذَلِكَ لَمْ تَنْتَظِرْهُنَّ فَتَنْفِرُ بِهِنَّ - وَهُنَّ حُيَّضٌ - إِذَا كُنَّ قَدْ أَفَضْنَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from AbuRijal Muhammad ibn Abd ar-\nRahman from Amra bint Abd ar-Rahman that when A'isha umm al-muminin\nwas doing hajj with women who were expecting their periods, she would\nhurry them to do the tawaf al-ifada on the Day of Sacrifice. If they\nstarted to menstruate after the tawaf al-ifada she did not stop for\nthem but left with them while they were menstruating."}},{"id":240,"idInBook":240,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم ذَكَرَ صَفِيَّةَ بِنْتَ حُيَىٍّ فَقِيلَ لَهُ قَدْ حَاضَتْ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَعَلَّهَا حَابِسَتُنَا ‏\"‏ ‏.‏ فَقَالُوا يَا رَسُولَ اللَّهِ إِنَّهَا قَدْ طَافَتْ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَلاَ إِذًا ‏\"‏ ‏.‏ قَالَ مَالِكٌ قَالَ هِشَامٌ قَالَ عُرْوَةُ قَالَتْ عَائِشَةُ ‏.‏ وَنَحْنُ نَذْكُرُ ذَلِكَ فَلِمَ يُقَدِّمُ النَّاسُ نِسَاءَهُمْ إِنْ كَانَ ذَلِكَ لاَ يَنْفَعُهُنَّ وَلَوْ كَانَ الَّذِي يَقُولُونَ لأَصْبَحَ بِمِنًى أَكْثَرُ مِنْ سِتَّةِ آلاَفِ امْرَأَةٍ حَائِضٍ كُلُّهُنَّ قَدْ أَفَاضَتْ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa from his\nfather from A'isha umm al-muminin that the Messenger of Allah, may\nAllah bless him and grant him peace, mentioned Safiyya bint Huyy and\nhe was told that she had started her period. The Messenger of Allah,\nmay Allah bless him and grant him peace, said, \"Perhaps she will delay\nus.\" They said, \"Messenger of Allah, she has done tawaf,\" and the\nMessenger of Allah, may Allah bless him and grant him peace, said,\n\"Then she will not delay us.\"\n\n\nMalik said that Hisham said\nthat Urwa said that A'isha said, \"We have publicized that, so why do\npeople make their women stay on to their inconvenience? If it were as\nthey say, more than six thousand menstruating women would still be in\nMina in the morning, all of them having already done the tawaf al-\nifada.' \""}},{"id":241,"idInBook":241,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، عَنْ أَبِيهِ، أَنَّ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ، أَخْبَرَهُ أَنَّ أُمَّ سُلَيْمٍ بِنْتَ مِلْحَانَ اسْتَفْتَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم وَحَاضَتْ - أَوْ وَلَدَتْ - بَعْدَ مَا أَفَاضَتْ يَوْمَ النَّحْرِ فَأَذِنَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَخَرَجَتْ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abdullah ibn Abi Bakr from\nhis father that Abu Salama ibn Abd ar-Rahman told him that Umm Sulaym\nbint Milhan asked the Messenger of Allah, may Allah bless him and\ngrant him peace, for advice one time when she had begun menstruating,\nor had given birth to a child after she had done tawaf al-ifada on the\nDay of Sacrifice. The Messenger of Allah, may Allah bless him and\ngrant him peace, gave her permission to leave.\n\n\nMalik said, \"A\nwoman menstruating at Mina stays until she has done tawaf of the\nHouse. There is no escape from that for her. If she has already done\nthe tawaf al-ifada and she starts to menstruate afterwards, she may\nleave for her country, since permission for the menstruating women to\nleave has been transmitted to us from the Messenger of Allah, may\nAllah bless him and grant him peace.\"\n\n\nHe added, \"If a woman\nstarts her period at Mina before she does the tawaf al-ifada, and the\nperiod lasts longer than usual, she has to stay longer than the time\nthat bleeding would usually detain women.\""}},{"id":242,"idInBook":242,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي الزُّبَيْرِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَضَى فِي الضَّبُعِ بِكَبْشٍ وَفِي الْغَزَالِ بِعَنْزٍ وَفِي الأَرْنَبِ بِعَنَاقٍ وَفِي الْيَرْبُوعِ بِجَفْرَةٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'z-Zubayr that Umar ibn\nal-Khattab gave the judgement of a ram for a hyena, a female goat for\na gazelle, a she-goat less than one year old for a rabbit, and a four\nmonth old kid for a jerboa."}},{"id":243,"idInBook":243,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ الْمَلِكِ بْنِ قُرَيْرٍ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، أَنَّ رَجُلاً، جَاءَ إِلَى عُمَرَ بْنِ الْخَطَّابِ فَقَالَ إِنِّي أَجْرَيْتُ أَنَا وَصَاحِبٌ، لِي فَرَسَيْنِ نَسْتَبِقُ إِلَى ثُغْرَةِ ثَنِيَّةٍ فَأَصَبْنَا ظَبْيًا وَنَحْنُ مُحْرِمَانِ فَمَاذَا تَرَى فَقَالَ عُمَرُ لِرَجُلٍ إِلَى جَنْبِهِ تَعَالَ حَتَّى أَحْكُمَ أَنَا وَأَنْتَ ‏.‏ قَالَ فَحَكَمَا عَلَيْهِ بِعَنْزٍ فَوَلَّى الرَّجُلُ وَهُوَ يَقُولُ هَذَا أَمِيرُ الْمُؤْمِنِينَ لاَ يَسْتَطِيعُ أَنْ يَحْكُمَ فِي ظَبْىٍ حَتَّى دَعَا رَجُلاً يَحْكُمُ مَعَهُ ‏.‏ فَسَمِعَ عُمَرُ قَوْلَ الرَّجُلِ فَدَعَاهُ فَسَأَلَهُ هَلْ تَقْرَأُ سُورَةَ الْمَائِدَةِ قَالَ لاَ ‏.‏ قَالَ فَهَلْ تَعْرِفُ هَذَا الرَّجُلَ الَّذِي حَكَمَ مَعِي فَقَالَ لاَ ‏.‏ فَقَالَ لَوْ أَخْبَرْتَنِي أَنَّكَ تَقْرَأُ سُورَةَ الْمَائِدَةِ لأَوْجَعْتُكَ ضَرْبًا ثُمَّ قَالَ إِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى يَقُولُ فِي كِتَابِهِ ‏{‏يَحْكُمُ بِهِ ذَوَا عَدْلٍ مِنْكُمْ هَدْيًا بَالِغَ الْكَعْبَةِ‏}‏ وَهَذَا عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abd al-Malik ibn Qurayr from\nMuhammad ibn Sirin that a man came to Umar ibn al-Khattab and said, \"I\nwas racing a friend on horseback towards a narrow mountain trail and\nwe killed a gazelle accidently and we were in ihram. What is your\nopinion?\" Umar said to a man by his side, \"Come, so that you and I may\nmake an assessment.\" They decided on a female goat for him, and the\nman turned away saying, \"This amir al-muminin cannot even make an\nassessment in the case of a gazelle until he calls a man to decide\nwith him.\" Umar overheard the man's words and called him and asked\nhim, \"Do you recite surat al-Ma'ida?\" and he said, \"No.\" He said,\n\"Then do you recognize this man who has taken the decision with me?\"\nand he said, \"No.\" He said, \"If you had told me that you did recite\nsurat al-Ma'ida, I would have dealt you a blow.\" Then he said, \"Allah\nthe Blessed, the Exalted says in His Book, 'as shall be judged by two\nmen of justice among you, a sacrificial animal to reach the Kaba'\n(Sura 5 ayat 95), and this is Abd ar-Rahman ibn Awf.\""}},{"id":244,"idInBook":244,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، أَنَّ أَبَاهُ، كَانَ يَقُولُ فِي الْبَقَرَةِ مِنَ الْوَحْشِ بَقَرَةٌ وَفِي الشَّاةِ مِنَ الظِّبَاءِ شَاةٌ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa that his\nfather used to say, \"For the female of wild animals a cow is given and\nfor the female of gazelles a sheep.\""}},{"id":245,"idInBook":245,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ كَانَ يَقُولُ فِي حَمَامِ مَكَّةَ إِذَا قُتِلَ شَاةٌ ‏.‏ وَقَالَ مَالِكٌ فِي الرَّجُلِ مِنْ أَهْلِ مَكَّةَ يُحْرِمُ بِالْحَجِّ أَوِ الْعُمْرَةِ وَفِي بَيْتِهِ فِرَاخٌ مِنْ حَمَامِ مَكَّةَ فَيُغْلَقُ عَلَيْهَا فَتَمُوتُ فَقَالَ أَرَى بِأَنْ يَفْدِيَ ذَلِكَ عَنْ كُلِّ فَرْخٍ بِشَاةٍ ‏.‏ قَالَ مَالِكٌ لَمْ أَزَلْ أَسْمَعُ أَنَّ فِي النَّعَامَةِ إِذَا قَتَلَهَا الْمُحْرِمُ بَدَنَةً ‏.‏ قَالَ مَالِكٌ أَرَى أَنَّ فِي بَيْضَةِ النَّعَامَةِ عُشْرَ ثَمَنِ الْبَدَنَةِ كَمَا يَكُونُ فِي جَنِينِ الْحُرَّةِ غُرَّةٌ عَبْدٌ أَوْ وَلِيدَةٌ وَقِيمَةُ الْغُرَّةِ خَمْسُونَ دِينَارًا وَذَلِكَ عُشْرُ دِيَةِ أُمِّهِ وَكُلُّ شَىْءٍ مِنَ النُّسُورِ أَوِ الْعِقْبَانِ أَوِ الْبُزَاةِ أَوِ الرَّخَمِ فَإِنَّهُ صَيْدٌ يُودَى كَمَا يُودَى الصَّيْدُ إِذَا قَتَلَهُ الْمُحْرِمُ وَكُلُّ شَىْءٍ فُدِيَ فَفِي صِغَارِهِ مِثْلُ مَا يَكُونُ فِي كِبَارِهِ وَإِنَّمَا مَثَلُ ذَلِكَ مَثَلُ دِيَةِ الْحُرِّ الصَّغِيرِ وَالْكَبِيرِ فَهُمَا بِمَنْزِلَةٍ وَاحِدَةٍ سَوَاءٌ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said that Said ibn\nal-Musayyab used to say, \"For the pigeon of Makka, when it is killed,\na sheep is due.\"\n\n\nMalik said, that if a man of the people of\nMakka were to enter ihram for hajj or umra and there was a flock of\nMakkan pigeons in his house and they were shut in and died, \"I think\nthat he should pay for that with a sheep for each bird.\""}},{"id":246,"idInBook":246,"chapterId":20,"bookId":7,"arabic":"","english":{"narrator":"","text":"Malik said, I still hear that when a person in ihram kills an\nostrich, a camel is due.\"\n\n\nMalik said, \"I think that for an\nostrich egg, one tenth of the price of a camel is due in the same way\nthat there is a newly-born male or female slave for the unborn child\nof a free woman. The value of the newly-born slave is fifty dinars,\nand that is one-tenth of what the blood-money for the mother would be.\n\n\n\"Birds from the eagle family, eagles or falcons or vultures\ncount as game for which a price is paid just as a price is paid for\nany game which a person in ihram kills. For everything for which a\npenalty is paid, the assessment is the same, whether the animal is old\nor young. The analogy of that is that the blood-money for the young\nand the old freeman, are considered to be the same.\""}},{"id":247,"idInBook":247,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، أَنَّ رَجُلاً، جَاءَ إِلَى عُمَرَ بْنِ الْخَطَّابِ فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ إِنِّي أَصَبْتُ جَرَادَاتٍ بِسَوْطِي وَأَنَا مُحْرِمٌ ‏.‏ فَقَالَ لَهُ عُمَرُ أَطْعِمْ قَبْضَةً مِنْ طَعَامٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Zayd ibn Aslam that a man\ncame to Umar ibn al-Khattab and said, \"Amir al-muminin, I killed some\nlocusts with my whip when I was in ihram,\" and Umar said to him, \"Give\na handful of food.\""}},{"id":248,"idInBook":248,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ رَجُلاً، جَاءَ إِلَى عُمَرَ بْنِ الْخَطَّابِ فَسَأَلَهُ عَنْ جَرَادَاتٍ، قَتَلَهَا وَهُوَ مُحْرِمٌ فَقَالَ عُمَرُ لِكَعْبٍ تَعَالَ حَتَّى نَحْكُمَ ‏.‏ فَقَالَ كَعْبٌ دِرْهَمٌ ‏.‏ فَقَالَ عُمَرُ لِكَعْبٍ إِنَّكَ لَتَجِدُ الدَّرَاهِمَ لَتَمْرَةٌ خَيْرٌ مِنْ جَرَادَةٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said that a man\ncame to Umar ibn al-Khattab and asked him about some locusts he had\nkilled while he was in ihram. Umar said to Kab, \"Come, let's decide.\"\nKab said, \"A dirham,\" and Umar said to Kab, \"You can find dirhams. A\ndate is better than a locust.\""}},{"id":249,"idInBook":249,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ الْكَرِيمِ بْنِ مَالِكٍ الْجَزَرِيِّ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ كَعْبِ بْنِ عُجْرَةَ، أَنَّهُ كَانَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم مُحْرِمًا فَآذَاهُ الْقَمْلُ فِي رَأْسِهِ فَأَمَرَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يَحْلِقَ رَأْسَهُ وَقَالَ ‏\n\"‏ صُمْ ثَلاَثَةَ أَيَّامٍ أَوْ أَطْعِمْ سِتَّةَ مَسَاكِينَ مُدَّيْنِ مُدَّيْنِ لِكُلِّ إِنْسَانٍ أَوِ انْسُكْ بِشَاةٍ أَىَّ ذَلِكَ فَعَلْتَ أَجْزَأَ عَنْكَ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abd al-Karim ibn Malik al-\nJazari from Abd ar-Rahman ibn Abi Layla from Kab ibn Ujra that one\ntime he was with the Messenger of Allah, may Allah bless him and grant\nhim peace, in ihram, and he was suffering from lice on his head. The\nMessenger of Allah, may Allah bless him and grant him peace, told him\nto shave his head, saying, \"Fast three days, or feed six poor people,\ntwo mudds for each person, or sacrifice a sheep. If you do any of\nthose it will be enough for you.\""}},{"id":250,"idInBook":250,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي عَنْ مَالِكٍ، عَنْ حُمَيْدِ بْنِ قَيْسٍ، عَنْ مُجَاهِدٍ أَبِي الْحَجَّاجِ، عَنِ ابْنِ أَبِي لَيْلَى، عَنْ كَعْبِ بْنِ عُجْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ لَهُ ‏\"‏ لَعَلَّكَ آذَاكَ هَوَامُّكَ ‏\"‏ ‏.‏ فَقُلْتُ نَعَمْ يَا رَسُولَ اللَّهِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ احْلِقْ رَأْسَكَ وَصُمْ ثَلاَثَةَ أَيَّامٍ أَوْ أَطْعِمْ سِتَّةَ مَسَاكِينَ أَوِ انْسُكْ بِشَاةٍ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Humayd bin Qays from Mujahid\nAbu'l Hajjaj from Ibn Abi Layla from Kab ibn Ujra that the Messenger\nof Allah, may Allah bless him and grant him peace, said to him,\n\"Perhaps your pests are troubling you?\" He replied that indeed they\nwere, and the Messenger of Allah, may Allah bless him and grant him\npeace, said, \"Shave your head and fast three days or feed six poor men\nor sacrifice a sheep.\""}},{"id":251,"idInBook":251,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَطَاءِ بْنِ عَبْدِ اللَّهِ الْخُرَاسَانِيِّ، أَنَّهُ قَالَ حَدَّثَنِي شَيْخٌ، بِسُوقِ الْبُرَمِ بِالْكُوفَةِ عَنْ كَعْبِ بْنِ عُجْرَةَ، أَنَّهُ قَالَ جَاءَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَنَا أَنْفُخُ تَحْتَ قِدْرٍ لأَصْحَابِي وَقَدِ امْتَلأَ رَأْسِي وَلِحْيَتِي قَمْلاً فَأَخَذَ بِجَبْهَتِي ثُمَّ قَالَ ‏\n\"‏ احْلِقْ هَذَا الشَّعَرَ وَصُمْ ثَلاَثَةَ أَيَّامٍ أَوْ أَطْعِمْ سِتَّةَ مَسَاكِينَ ‏\"‏ ‏.‏ وَقَدْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلِمَ أَنَّهُ لَيْسَ عِنْدِي مَا أَنْسُكُ بِهِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Ata ibn Abdullah al-Khurasani\nsaid that an old man from Suq al-Buram in Kufa had related to him that\nKab ibn Ujra said, \"The Messenger of Allah, may Allah bless him and\ngrant him peace, came to me while I was blowing under a cooking pot\nbelonging to my companions and my head and beard were full of lice. He\ntook my forehead and said, 'Shave your hair and fast three days or\nfeed six poor people.'  The Messenger of Allah, may Allah bless him\nand grant him peace, was aware that I did not have anything with me to\nsacrifice.'\"\n\n\nMalik said, concerning paying compensation\n(fidya) for the relief of physical discomfort, \"The custom concerning\nit is that no one pays compensation until he has done something which\nmakes it obligatory to pay compensation just as making amends\n(kaffara) is only done when it has become obligatory for the one who\nowes it. The person can pay the compensation wherever he wishes,\nregardless of whether he has to sacrifice an animal or fast or give\nsadaqa -- in Makka or in any other town.\"\n\n\nMalik said, \"It is\nnot correct for a person in ihram to pluck out any of his hair or to\nshave it or cut it until he has left ihram, unless he is suffering\nfrom an ailment of the head, in which case he owes the compensation\nAllah the Exalted has ordered. It is not correct for a person in ihram\nto cut his nails, or to kill his lice, or to remove them from his head\nor from his skin or his garment to the ground. If a person in ihram\nremoves lice from his skin or his garment, he must give away the\nquantity of food that he can scoop up with both hands. \"\n\n\nMalik said,\"Anyone who, while in ihram, plucks out hairs from his nose\nor armpit or rubs his body with a depilatory agent or shaves the hair\nfrom around a head wound out of necessity or shaves his neck for the\nplace of the cupping glasses, regardless of whether it is in\nforgetfulness or in ignorance, owes compensation in all these\ninstances, and he must not shave the place of the cupping glasses.\nSomeone, who, out of ignorance, shaves his head before he stones the\njamra. must also pay compensation.\""}},{"id":252,"idInBook":252,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَيُّوبَ بْنِ أَبِي تَمِيمَةَ السَّخْتِيَانِيِّ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، قَالَ مَنْ نَسِيَ مِنْ نُسُكِهِ شَيْئًا أَوْ تَرَكَهُ فَلْيُهْرِقْ دَمًا ‏.‏ قَالَ أَيُّوبُ لاَ أَدْرِي قَالَ تَرَكَ أَوْ نَسِيَ ‏.‏ قَالَ مَالِكٌ مَا كَانَ مِنْ ذَلِكَ هَدْيًا فَلاَ يَكُونُ إِلاَّ بِمَكَّةَ وَمَا كَانَ مِنْ ذَلِكَ نُسُكًا فَهُوَ يَكُونُ حَيْثُ أَحَبَّ صَاحِبُ النُّسُكِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ayyub ibn Abi Tamima as-\nSakhtayani from Said ibn Jubayr that Abdullah ibn Abbas said, \"If\nsomeone forgets anything of the rituals or omits them intentionally,\nhe must slaughter an animal.\" Ayyub added \"I do not know if he said\n'Omits' or 'forgets'.\"\n\n\nMalik said, \"If it is a hady that has\nto be slaughtered it may only be done in Makka, but if it is a\nsacrifice, it may be slaughtered wherever the one who owes the\nsacrifice prefers.\""}},{"id":253,"idInBook":253,"chapterId":20,"bookId":7,"arabic":"","english":{"narrator":"","text":"Malik said, concerning someone who wishes to wear clothes that a\nperson in ihram must not wear, or cut his hair, or touch perfume\nwithout necessity, because he finds it easy to pay the compensation,\n\"No-one must do such things. They are only allowed in cases of\nnecessity, and compensation is owed by whoever does them.\"\n\n\nMalik was asked whether the culprit could choose for himself the\nmethod of compensation he makes, and he was asked what kind of animal\nwas to be sacrificed, and how much food was to be given, and how many\ndays were to be fasted, and whether the person could delay any of\nthese, or if they had to be done immediately. He answered, 'Whenever\nthere are alternatives in the Book of Allah for the kaffara, the\nculprit can choose to do whichever of the alternatives he prefers. As\nfor the sacrifice - a sheep, and as for the fasting - three days. As\nfor the food - feeding six poor men, for every poor man two mudds, by\nthe first mudd, the mudd of the Prophet, may Allah bless him and grant\nhim peace.\"\n\n\nMalik said, \"I have heard one of the people of\nknowledge saying, 'When a person in ihram throws something and hits\ngame unintentionally and kills it, he must pay compensation. In the\nsame way, someone outside the Haram who throws anything into the Haram\nand hits game he did not intend to, killing it, has to pay\ncompensation, because the intentional and the mistaken are in the same\nposition in this matter.' \"\n\n\nMalik said, concerning people who\nkill game together while they are muhrim or in the Haram, \"I think\nthat each one of them owes a full share. If a sacrificial animal is\ndecided for them, each one of them owes one, and if fasting is decided\nfor them, the full fasting is owed by each one of them. The analogy of\nthat is a group of people who kill a man by mistake and the kaffara\nfor that is that each person among them must free a slave or fast two\nconsecutive months.\"\n\n\nMalik said, \"Anyone who stones or hunts\ngame after stoning the jamra and shaving his head but before he has\nperformed the tawaf al-ifada, owes compensation for that game, because\nAllah the Blessed, the Exalted said, 'And when you leave ihram, then\nhunt,' and restrictions still remain for someone who has not done the\ntawaf al-ifada about touching perfume and women.\"\n\n\nMalik said,\n\"The person in ihram does not owe anything for plants he cuts down in\nthe Haram and it has not reached us that anyone has given a decision\nof anything for it, but O how wrong is what he has done! \"\n\n\nMalik said, concerning some one who was ignorant of, or who forgot the\nfast of three days in the hajj, or who was ill during them and so did\nnot fast them until he had returned to his community, \"He must offer a\nsacrificial animal (hady) if he can find one and if not he must fast\nthe three days among his people and the remaining seven after that.\""}},{"id":254,"idInBook":254,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عِيسَى بْنِ طَلْحَةَ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ، أَنَّهُ قَالَ وَقَفَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِلنَّاسِ بِمِنًى وَالنَّاسُ يَسْأَلُونَهُ فَجَاءَهُ رَجُلٌ فَقَالَ لَهُ يَا رَسُولَ اللَّهِ لَمْ أَشْعُرْ فَحَلَقْتُ قَبْلَ أَنْ أَنْحَرَ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ انْحَرْ وَلاَ حَرَجَ ‏\"‏ ‏.‏ ثُمَّ جَاءَهُ آخَرُ فَقَالَ يَا رَسُولَ اللَّهِ لَمْ أَشْعُرْ فَنَحَرْتُ قَبْلَ أَنْ أَرْمِيَ قَالَ ‏\"‏ ارْمِ وَلاَ حَرَجَ ‏\"‏ ‏.‏ قَالَ فَمَا سُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ شَىْءٍ قُدِّمَ وَلاَ أُخِّرَ إِلاَّ قَالَ ‏\"‏ افْعَلْ وَلاَ حَرَجَ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from clsa ibn\nTalha that Abdullah ibn Amr ibn al-As said, \"The Messenger of Allah,\nmay Allah bless him and grant him peace, stopped for the people at\nMina, and they questioned him and a man came and said to him,\n'Messenger of Allah, I was unclear about what to do and I shaved\nbefore sacrificing,' and the Messenger of Allah, may Allah bless him\nand grant him peace, said, 'Sacrifice, and don't worry.' Then another\ncame to him and said 'Messenger of Allah, I was unclear about what to\ndo and I sacrificed before throwing the stones.' He advised, 'Throw,\nand don't worry.' \"\n\n\nAmr continued, saying that the Messenger\nof Allah, may Allah bless him and grant him peace, was not asked about\nanything done before or after without his saying, \"Do it, and don't\nworry.\""}},{"id":255,"idInBook":255,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا قَفَلَ مِنْ غَزْوٍ أَوْ حَجٍّ أَوْ عُمْرَةٍ يُكَبِّرُ عَلَى كُلِّ شَرَفٍ مِنَ الأَرْضِ ثَلاَثَ تَكْبِيرَاتٍ ثُمَّ يَقُولُ ‏\n\"‏ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ آيِبُونَ تَائِبُونَ عَابِدُونَ سَاجِدُونَ لِرَبِّنَا حَامِدُونَ صَدَقَ اللَّهُ وَعْدَهُ وَنَصَرَ عَبْدَهُ وَهَزَمَ الأَحْزَابَ وَحْدَهُ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat when the Messenger of Allah, may Allah bless him and grant him\npeace, returned from a military expedition or a hajj or an umra, he\nused to say three takbirs on every elevated part of the land, and then\nhe used to say, \"There is no god but Allah, alone, without partner. To\nHim belongs the Kingdom and to Him belongs the praise and He has power\nover everything. Returning, making tawba, serving, prostrating,\npraising our Lord. Allah has promised truly and given His slave\nvictory and defeated the tribes alone.\""}},{"id":256,"idInBook":256,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ إِبْرَاهِيمَ بْنِ عُقْبَةَ، عَنْ كُرَيْبٍ، مَوْلَى عَبْدِ اللَّهِ بْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم مَرَّ بِامْرَأَةٍ وَهِيَ فِي مِحَفَّتِهَا فَقِيلَ لَهَا هَذَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَخَذَتْ بِضَبْعَىْ صَبِيٍّ كَانَ مَعَهَا فَقَالَتْ أَلِهَذَا حَجٌّ يَا رَسُولَ اللَّهِ قَالَ ‏\n\"‏ نَعَمْ وَلَكِ أَجْرٌ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibrahim ibn Uqba from Kurayb\nthe mawla of Abdullah ibn Abbas from Ibn Abbas that the Messenger of\nAllah, may Allah bless him and grant him peace, passed a woman in a\nlitter and it was said to her, \"This is the Messenger of Allah, may\nAllah bless him and grant him peace,\" and she took the forearms of a\nyoung boy who was with her and said, \"Does this one have a hajj,\nMessenger of Allah?\" and he said, \"Yes, and you have a reward.\""}},{"id":257,"idInBook":257,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ إِبْرَاهِيمَ بْنِ أَبِي عَبْلَةَ، عَنْ طَلْحَةَ بْنِ عُبَيْدِ اللَّهِ بْنِ كَرِيزٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَا رُئِيَ الشَّيْطَانُ يَوْمًا هُوَ فِيهِ أَصْغَرُ وَلاَ أَدْحَرُ وَلاَ أَحْقَرُ وَلاَ أَغْيَظُ مِنْهُ فِي يَوْمِ عَرَفَةَ وَمَا ذَاكَ إِلاَّ لِمَا رَأَى مِنْ تَنَزُّلِ الرَّحْمَةِ وَتَجَاوُزِ اللَّهِ عَنِ الذُّنُوبِ الْعِظَامِ إِلاَّ مَا أُرِيَ يَوْمَ بَدْرٍ ‏\"‏ ‏.‏ قِيلَ وَمَا رَأَى يَوْمَ بَدْرٍ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ أَمَا إِنَّهُ قَدْ رَأَى جِبْرِيلَ يَزَعُ الْمَلاَئِكَةَ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibrahim ibn Abi Abla from\nTalha ibn Ubaydullah ibn Kariyz that the Messenger of Allah, may Allah\nbless him and grant him peace, said, \"Shaytan is not considered more\nabased or more cast out or more contemptible or more angry on any day\nthan on the Day of Arafa. That is only because he sees the descent of\nthe Mercy and Allah's disregard for great wrong actions. That is\nexcept from what he was shown on the Day of Badr.\" Someone said, \"What\nwas he shown on the Day of Badr, Messenger of Allah?\" He said, \"Didn't\nhe see Jibril arranging the ranks of the angels?\""}},{"id":258,"idInBook":258,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زِيَادِ بْنِ أَبِي زِيَادٍ، مَوْلَى عَبْدِ اللَّهِ بْنِ عَيَّاشِ بْنِ أَبِي رَبِيعَةَ عَنْ طَلْحَةَ بْنِ عُبَيْدِ اللَّهِ بْنِ كَرِيزٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَفْضَلُ الدُّعَاءِ دُعَاءُ يَوْمِ عَرَفَةَ وَأَفْضَلُ مَا قُلْتُ أَنَا وَالنَّبِيُّونَ مِنْ قَبْلِي لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Zihad ibn Abi Ziyad the mawla\nof Abdullah ibn Ayyash ibn Abi Rabia from Talha ibn Ubaydullah ibn\nKariyz that the Messenger of Allah, may Allah bless him and grant him\npeace, said, \"The most excellent dua is the dua on the Day of Arafa,\nand the best of what I and the prophets before me have said, is 'There\nis no god but Allah, alone, without partner.'\""}},{"id":259,"idInBook":259,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم دَخَلَ مَكَّةَ عَامَ الْفَتْحِ وَعَلَى رَأْسِهِ الْمِغْفَرُ فَلَمَّا نَزَعَهُ جَاءَهُ رَجُلٌ فَقَالَ لَهُ يَا رَسُولَ اللَّهِ ابْنُ خَطَلٍ مُتَعَلِّقٌ بِأَسْتَارِ الْكَعْبَةِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ اقْتُلُوهُ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Anas ibn\nMalik that the Messenger of Allah, may Allah bless him and grant him\npeace, entered Makka, in the Year of Victory, wearing a helmet, and\nwhen he took it off a man came to him and said, \"Messenger of Allah,\nIbn Khatal is clinging to the covers of the Kaba,'' and the Messenger\nof Allah, may Allah bless him and grant him peace, said, \"Kill him.\"\n\n\nMalik commented, \"The Messenger of Allah, may Allah bless him\nand grant him peace, was not in ihram at the time, and Allah knows\nbest.\""}},{"id":260,"idInBook":260,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، أَقْبَلَ مِنْ مَكَّةَ حَتَّى إِذَا كَانَ بِقُدَيْدٍ جَاءَهُ خَبَرٌ مِنَ الْمَدِينَةِ فَرَجَعَ فَدَخَلَ مَكَّةَ بِغَيْرِ إِحْرَامٍ ‏.‏ \n وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، بِمِثْلِ ذَلِكَ ‏.","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nwas coming from Makka and when he was at Qudayd, news came to him from\nMadina and he returned and entered Makka without ihram.\n\n\nYahya\nrelated the same as that to me from Malik from Ibn Shihab."}},{"id":261,"idInBook":261,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَلْحَلَةَ الدِّيلِيِّ، عَنْ مُحَمَّدِ بْنِ عِمْرَانَ الأَنْصَارِيِّ، عَنْ أَبِيهِ، أَنَّهُ قَالَ عَدَلَ إِلَىَّ عَبْدُ اللَّهِ بْنُ عُمَرَ وَأَنَا نَازِلٌ، تَحْتَ سَرْحَةٍ بِطَرِيقِ مَكَّةَ فَقَالَ مَا أَنْزَلَكَ تَحْتَ هَذِهِ السَّرْحَةِ فَقُلْتُ أَرَدْتُ ظِلَّهَا ‏.‏ فَقَالَ هَلْ غَيْرُ ذَلِكَ فَقُلْتُ لاَ مَا أَنْزَلَنِي إِلاَّ ذَلِكَ ‏.‏ فَقَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا كُنْتَ بَيْنَ الأَخْشَبَيْنِ مِنْ مِنًى - وَنَفَخَ بِيَدِهِ نَحْوَ الْمَشْرِقِ - فَإِنَّ هُنَاكَ وَادِيًا يُقَالُ لَهُ السُّرَرُ بِهِ شَجَرَةٌ سُرَّ تَحْتَهَا سَبْعُونَ نَبِيًّا ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Muhammad ibn Amr ibn Halhala\nad-Dili from Muhammad ibn lmran al-Ansari that his father said that\nAbdullah ibn Umar came upon him while he stopped for a rest under a\ntall tree on the road to Makka, and he said, \"What has made you stop\nunder this tall tree?\" He replied that he sought it's shade. Abdullah\nibn Umar said, \"Anything besides that?\" and he said, \"No, that was the\nonly. reason he stopped for a rest,\" and Abdullah ibn Umar said, \"The\nMessenger of Allah, may Allah bless him and grant him peace, said, 'If\nyou are between al-Akhshabayn (which are two mountains) near Mina,'\nindicating the east with his outspread hand, 'you will find a valley\ncalled as-Surar with a tree in it beneath which the umbilical cords of\nseventy prophets have been cut.' \""}},{"id":262,"idInBook":262,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ حَزْمٍ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، مَرَّ بِامْرَأَةٍ مَجْذُومَةٍ وَهِيَ تَطُوفُ بِالْبَيْتِ فَقَالَ لَهَا يَا أَمَةَ اللَّهِ لاَ تُؤْذِي النَّاسَ لَوْ جَلَسْتِ فِي بَيْتِكِ ‏.‏ فَجَلَسَتْ فَمَرَّ بِهَا رَجُلٌ بَعْدَ ذَلِكَ فَقَالَ لَهَا إِنَّ الَّذِي كَانَ قَدْ نَهَاكِ قَدْ مَاتَ فَاخْرُجِي ‏.‏ فَقَالَتْ مَا كُنْتُ لأُطِيعَهُ حَيًّا وَأَعْصِيَهُ مَيِّتًا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abdullah ibn Abi Bakr ibn\nHazm from Ibn\n\n\nAbi Mulayka that Umar ibn al-Khattab passed a\nleprous woman doing tawaf of the House, and he said to her, \"Slave of\nAllah, do not make people uneasy. Better that you stay in your house,\"\nso she did so. A man passed by her after that and said to her, \"The\none who forbade you has died, so come out,\" and she replied, \"I am not\ngoing to obey him when he is alive and disobey him when he is dead.\""}},{"id":263,"idInBook":263,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، كَانَ يَقُولُ مَا بَيْنَ الرُّكْنِ وَالْبَابِ الْمُلْتَزَمُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Abdullah\nibn Abbas used to say that the area between the corner of the Black\nStone and the door of the Kaba was called al-Multazam."}},{"id":264,"idInBook":264,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، أَنَّهُ سَمِعَهُ يَذْكُرُ، أَنَّ رَجُلاً، مَرَّ عَلَى أَبِي ذَرٍّ بِالرَّبَذَةِ وَأَنَّ أَبَا ذَرٍّ سَأَلَهُ أَيْنَ تُرِيدُ فَقَالَ أَرَدْتُ الْحَجَّ ‏.‏ فَقَالَ هَلْ نَزَعَكَ غَيْرُهُ فَقَالَ لاَ ‏.‏ قَالَ فَأْتَنِفِ الْعَمَلَ ‏.‏ قَالَ الرَّجُلُ فَخَرَجْتُ حَتَّى قَدِمْتُ مَكَّةَ فَمَكَثْتُ مَا شَاءَ اللَّهُ ثُمَّ إِذَا أَنَا بِالنَّاسِ مُنْقَصِفِينَ عَلَى رَجُلٍ فَضَاغَطْتُ عَلَيْهِ النَّاسَ فَإِذَا أَنَا بِالشَّيْخِ الَّذِي وَجَدْتُ بِالرَّبَذَةِ يَعْنِي أَبَا ذَرٍّ قَالَ فَلَمَّا رَآنِي عَرَفَنِي فَقَالَ هُوَ الَّذِي حَدَّثْتُكَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Yahya ibn Said heard Muhammad\nibn Yahya ibn Habban mentioning that a certain man passed Abu Dharr at\nar-Rabadha (which was about 30 miles from Madina) and Abu Dharr asked\nhim, \"Where are you heading to?\" and he replied, \"I am intending to do\nhajj.\" Abu Dharr questioned, \"Has anything else brought you out?\" and\nhe said, \"No,\" so Abu Dharr said \"Resume what you are doing\nwholeheartedly.\"\n\n\nThe man related, \"I went on till I came to\nMakka and I stayed as long as Allah willed. Suddenly, one time, I was\nwith a crowd of people thronging about a man and I pushed through the\npeople to him and it was the old man that I had come across at ar-\nRabadha. When he saw me, he recognized me and said, 'Ah, you have done\nwhat I told you.' \""}},{"id":265,"idInBook":265,"chapterId":20,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ سَأَلَ ابْنَ شِهَابٍ عَنْ الاِسْتِثْنَاءِ، فِي الْحَجِّ فَقَالَ أَوَيَصْنَعُ ذَلِكَ أَحَدٌ وَأَنْكَرَ ذَلِكَ ‏.‏ سُئِلَ مَالِكٌ هَلْ يَحْتَشُّ الرَّجُلُ لِدَابَّتِهِ مِنَ الْحَرَمِ فَقَالَ لاَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he asked Ibn Shihab about\nmaking a condition in the hajj that one could leave ihram at any place\nwhere an obstacle befell one and he said, \"Does anyone do that?' and\ndisapproved of it.\n\n\nMalik was asked whether a man could cut\nplants from the Haram for his mount, and he said, \"No.\""}},{"id":266,"idInBook":266,"chapterId":20,"bookId":7,"arabic":"","english":{"narrator":"","text":"Malik said, concerning a woman who had never been on hajj, \"If\nshe doesn't have a mahram, or if she has, but he cannot come with her,\nshe does not abandon Allah's making of the hajj obligatory for her.\nLet her go in a group of women.\""}},{"id":267,"idInBook":267,"chapterId":20,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ، أَنَّهَا كَانَتْ تَقُولُ الصِّيَامُ لِمَنْ تَمَتَّعَ بِالْعُمْرَةِ إِلَى الْحَجِّ لِمَنْ لَمْ يَجِدْ هَدْيًا مَا بَيْنَ أَنْ يُهِلَّ بِالْحَجِّ إِلَى يَوْمِ عَرَفَةَ فَإِنْ لَمْ يَصُمْ صَامَ أَيَّامَ مِنًى ‏.‏ \n وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ كَانَ يَقُولُ فِي ذَلِكَ مِثْلَ قَوْلِ عَائِشَةَ رضى الله تعالى عنها ‏.","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Urwa ibn az-\nZubayr that A'isha umm al-muminin used to say, \"Someone performing\nhajj at-tamattu who does not have a sacrificial animal fasts (three\ndays) from the time he enters ihram for the hajj till the Day of\nArafa, and if  he does not fast then, he fasts the days of Mina.\"\n\n\nYahya related to me from Malik from Ibn Shihab from Salim ibn\nAbdullah that Abdullah ibn Umar used to say the same concerning that,\nas the words of A'isha, may Allah the Exalted be pleased with her."}}],"chapter":{"id":20,"bookId":7,"arabic":"كتاب الحج","english":"Hajj"}}