{"metadata":{"length":54,"arabic":{"title":"موطأ مالك","author":"الإمام مالك بن أنس","introduction":"كتاب الجهاد"},"english":{"title":"Muwatta Malik","author":"Imam Malik ibn Anas","introduction":"Jihad"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":21,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَثَلُ الْمُجَاهِدِ فِي سَبِيلِ اللَّهِ كَمَثَلِ الصَّائِمِ الْقَائِمِ الدَّائِمِ الَّذِي لا يَفْتُرُ مِنْ صَلاَةٍ وَلاَ صِيَامٍ حَتَّى يَرْجِعَ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'z-Zinad from al-Araj from\nAbu Hurayra that the Messenger of Allah, may Allah bless him and grant\nhim peace, said \"Someone who does jihad in the way of Allah is like\nsomeone who fasts and prays constantly and who does not slacken from\nhis prayer and fasting until he returns.\""}},{"id":2,"idInBook":2,"chapterId":21,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ تَكَفَّلَ اللَّهُ لِمَنْ جَاهَدَ فِي سَبِيلِهِ - لاَ يُخْرِجُهُ مِنْ بَيْتِهِ إِلاَّ الْجِهَادُ فِي سَبِيلِهِ وَتَصْدِيقُ كَلِمَاتِهِ - أَنْ يُدْخِلَهُ الْجَنَّةَ أَوْ يَرُدَّهُ إِلَى مَسْكَنِهِ الَّذِي خَرَجَ مِنْهُ مَعَ مَا نَالَ مِنْ أَجْرٍ أَوْ غَنِيمَةٍ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'z Zinad from al-Araj from\nAbu Hurayra that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"Allah guarantees either the Garden or a safe return\nto his home with whatever he has obtained of reward or booty, for the\none who does jihad in His way, if it is solely jihad and trust in his\npromise that brings him out of his house.\""}},{"id":3,"idInBook":3,"chapterId":21,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَبِي صَالِحٍ السَّمَّانِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ الْخَيْلُ لِرَجُلٍ أَجْرٌ وَلِرَجُلٍ سِتْرٌ وَعَلَى رَجُلٍ وِزْرٌ فَأَمَّا الَّذِي هِيَ لَهُ أَجْرٌ فَرَجُلٌ رَبَطَهَا فِي سَبِيلِ اللَّهِ فَأَطَالَ لَهَا فِي مَرْجٍ أَوْ رَوْضَةٍ فَمَا أَصَابَتْ فِي طِيَلِهَا ذَلِكَ مِنَ الْمَرْجِ أَوِ الرَّوْضَةِ كَانَ لَهُ حَسَنَاتٌ وَلَوْ أَنَّهَا قَطَعَتْ طِيَلَهَا ذَلِكَ فَاسْتَنَّتْ شَرَفًا أَوْ شَرَفَيْنِ كَانَتْ آثَارُهَا وَأَرْوَاثُهَا حَسَنَاتٍ لَهُ وَلَوْ أَنَّهَا مَرَّتْ بِنَهَرٍ فَشَرِبَتْ مِنْهُ وَلَمْ يُرِدْ أَنْ يَسْقِيَ بِهِ كَانَ ذَلِكَ لَهُ حَسَنَاتٍ فَهِيَ لَهُ أَجْرٌ وَرَجُلٌ رَبَطَهَا تَغَنِّيًا وَتَعَفُّفًا وَلَمْ يَنْسَ حَقَّ اللَّهِ فِي رِقَابِهَا وَلاَ فِي ظُهُورِهَا فَهِيَ لِذَلِكَ سِتْرٌ وَرَجُلٌ رَبَطَهَا فَخْرًا وَرِيَاءً وَنِوَاءً لأَهْلِ الإِسْلاَمِ فَهِيَ عَلَى ذَلِكَ وِزْرٌ ‏\"‏ ‏.‏ وَسُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْحُمُرِ فَقَالَ ‏\"‏ لَمْ يَنْزِلْ عَلَىَّ فِيهَا شَىْءٌ إِلاَّ هَذِهِ الآيَةُ الْجَامِعَةُ الْفَاذَّةُ ‏{‏فَمَنْ يَعْمَلْ مِثْقَالَ ذَرَّةٍ خَيْرًا يَرَهُ  وَمَنْ يَعْمَلْ مِثْقَالَ ذَرَّةٍ شَرًّا يَرَهُ ‏}‏‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Zayd ibn Aslam from Abu Salih\nas-Samman from Abu Hurayra that the Messenger of Allah, may Allah\nbless him and grant him peace, said, \"Horses are a reward for one man,\na protection for another, a burden for another. The one who has them\nas a reward is the one who dedicates them for use in the way of Allah,\nand tethers them in a meadow or grassland. Whatever the horse enjoys\nof the grassland or meadow in the length of its tether are good deeds\nfor him. If it breaks its tether and goes over a hillock or two, its\ntracks and droppings are good deeds for him. If it crosses a river and\ndrinks from it while he did not mean to allow it to drink it, that\ncounts as good deeds for him, and the horse is a reward for him.\n\n\nAnother man uses his horse to gain self reliance and up-\nstandingness and does not forget Allah's right on their necks and\nbacks (i.e. he does not ill treat or over-work them). Horses are a\nprotection for him .\n\n\nAnother man uses them out of pride to\nshow them off and in hostility to the people of Islam. They are a\nburden on that man.\"\n\n\nThe Messenger of Allah, may Allah bless\nhim and grant him peace, was asked about donkeys, and he said,\n\"Nothing has been revealed to me about them except this single all-\ninclusive ayat, 'Whoever does an atom of good will see it, and whoever\ndoes an atom of evil, will see it.' \" (Sura 99 Ayats 7,8) ."}},{"id":4,"idInBook":4,"chapterId":21,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ مَعْمَرٍ الأَنْصَارِيِّ، عَنْ عَطَاءِ بْنِ يَسَارٍ، أَنَّهُ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَلاَ أُخْبِرُكُمْ بِخَيْرِ النَّاسِ مَنْزِلاً رَجُلٌ آخِذٌ بِعِنَانِ فَرَسِهِ يُجَاهِدُ فِي سَبِيلِ اللَّهِ أَلاَ أُخْبِرُكُمْ بِخَيْرِ النَّاسِ مَنْزِلاً بَعْدَهُ رَجُلٌ مُعْتَزِلٌ فِي غُنَيْمَتِهِ يُقِيمُ الصَّلاَةَ وَيُؤْتِي الزَّكَاةَ وَيَعْبُدُ اللَّهَ لاَ يُشْرِكُ بِهِ شَيْئًا ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Abdullah ibn Abd ar-Rahman ibn Mamar al-\nAnsari that Ata ibn Yasar said that the Messenger of Allah, may Allah\nbless him and grant him peace, said, \"Shall I tell you who has the\nbest degree among people? A man who takes the rein of his horse to do\njihad in the way of Allah. Shall I tell you who has the best degree\namong people after him? A man who lives alone with a few sheep,\nperforms the prayer, pays the zakat, and worships Allah without\nassociating anything with him.\""}},{"id":5,"idInBook":5,"chapterId":21,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، قَالَ أَخْبَرَنِي عُبَادَةُ بْنُ الْوَلِيدِ بْنِ عُبَادَةَ بْنِ الصَّامِتِ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ بَايَعْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم عَلَى السَّمْعِ وَالطَّاعَةِ فِي الْيُسْرِ وَالْعُسْرِ وَالْمَنْشَطِ وَالْمَكْرَهِ وَأَنْ لاَ نُنَازِعَ الأَمْرَ أَهْلَهُ وَأَنْ نَقُولَ أَوْ نَقُومَ بِالْحَقِّ حَيْثُمَا كُنَّا لاَ نَخَافُ فِي اللَّهِ لَوْمَةَ لاَئِمٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Yahya ibn Said said, ''Ubada\nibn al-Walid ibn Ubada ibn as-Samit informed me from his father that\nhis grandfather (Ubada) said, 'We made a contract with the Messenger\nof Allah, may Allah bless him and grant him peace, to hear and obey in\nease and hardship, enthusiasm and reluctance, and not to dispute with\npeople in authority and to speak or establish the truth wherever we\nwere without worrying about criticism.'\""}},{"id":6,"idInBook":6,"chapterId":21,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، قَالَ كَتَبَ أَبُو عُبَيْدَةَ بْنُ الْجَرَّاحِ إِلَى عُمَرَ بْنِ الْخَطَّابِ يَذْكُرُ لَهُ جُمُوعًا مِنَ الرُّومِ وَمَا يَتَخَوَّفُ مِنْهُمْ فَكَتَبَ إِلَيْهِ عُمَرُ بْنُ الْخَطَّابِ أَمَّا بَعْدُ فَإِنَّهُ مَهْمَا يَنْزِلْ بِعَبْدٍ مُؤْمِنٍ مِنْ مُنْزَلِ شِدَّةٍ يَجْعَلِ اللَّهُ بَعْدَهُ فَرَجًا وَإِنَّهُ لَنْ يَغْلِبَ عُسْرٌ يُسْرَيْنِ وَأَنَّ اللَّهَ تَعَالَى يَقُولُ فِي كِتَابِهِ ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا اصْبِرُوا وَصَابِرُوا وَرَابِطُوا وَاتَّقُوا اللَّهَ لَعَلَّكُمْ تُفْلِحُونَ ‏}‏","english":{"narrator":"","text":"Yahya related to me from Malik that Zayd ibn Aslam had said that\nUbayda ibn al-Jarrah had written to Umar ibn al-Khattab mentioning to\nhim a great array of Byzantine troops and the anxiety they were\ncausing him. Umar ibn al-Khattab wrote in reply to him, \"Whatever\nhardship befalls a believing slave, Allah will make an opening for him\nafter it, and a hardship will not overcome two eases. Allah the\nExalted says in His Book, 'O you who trust, be patient, and vie in\npatience; be steadfast and fear Allah, perhaps you will profit.' \"\n(Sura 3 ayat 200)."}},{"id":7,"idInBook":7,"chapterId":21,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يُسَافَرَ بِالْقُرْآنِ إِلَى أَرْضِ الْعَدُوِّ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nsaid that the Messenger of Allah, may Allah bless him and grant him\npeace, forbade travelling with a Qur'an in the land of the enemy.\nMalik commented, \"That is out of fear that the enemy will get hold of\nit.\""}},{"id":8,"idInBook":8,"chapterId":21,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنِ ابْنٍ لِكَعْبِ بْنِ مَالِكٍ، - قَالَ حَسِبْتُ أَنَّهُ قَالَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَعْبٍ، أَنَّهُ - قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم الَّذِينَ قَتَلُوا ابْنَ أَبِي الْحُقَيْقِ عَنْ قَتْلِ النِّسَاءِ وَالْوِلْدَانِ - قَالَ - فَكَانَ رَجُلٌ مِنْهُمْ يَقُولُ بَرَّحَتْ بِنَا امْرَأَةُ ابْنِ أَبِي الْحُقَيْقِ بِالصِّيَاحِ فَأَرْفَعُ السَّيْفَ عَلَيْهَا ثُمَّ أَذْكُرُ نَهْىَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَكُفُّ وَلَوْلاَ ذَلِكَ اسْتَرَحْنَا مِنْهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab that a son of Kab\nibn Malik (Malik believed that ibn Shihab said it was Abd ar-Rahman\nibn Kab) said, \"The Messenger of Allah, may Allah bless him and grant\nhim peace, forbade those who fought ibn Abi Huqayq (a treacherous jew\nfrom Madina) to kill women and children. He said that one of the men\nfighting had said, 'The wife of ibn Abi Huqayq began screaming and I\nrepeatedly raised my sword against her. Then I would remember the\nprohibition of the Messenger of Allah, may Allah bless him and grant\nhim peace, so I would stop. Had it not been for that, we would have\nbeen rid of her.' \""}},{"id":9,"idInBook":9,"chapterId":21,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَأَى فِي بَعْضِ مَغَازِيهِ امْرَأَةً مَقْتُولَةً فَأَنْكَرَ ذَلِكَ وَنَهَى عَنْ قَتْلِ النِّسَاءِ وَالصِّبْيَانِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi from Ibn Umar that the\nMessenger of Allah, may Allah bless him and grant him peace, saw the\ncorpse of a woman who had been slain in one of the raids, and he\ndisapproved of it and forbade the killing of women and children."}},{"id":10,"idInBook":10,"chapterId":21,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ أَبَا بَكْرٍ الصِّدِّيقَ، بَعَثَ جُيُوشًا إِلَى الشَّامِ فَخَرَجَ يَمْشِي مَعَ يَزِيدَ بْنِ أَبِي سُفْيَانَ - وَكَانَ أَمِيرَ رُبْعٍ مِنْ تِلْكَ الأَرْبَاعِ - فَزَعَمُوا أَنَّ يَزِيدَ قَالَ لأَبِي بَكْرٍ إِمَّا أَنْ تَرْكَبَ وَإِمَّا أَنْ أَنْزِلَ ‏.‏ فَقَالَ أَبُو بَكْرٍ مَا أَنْتَ بِنَازِلٍ وَمَا أَنَا بِرَاكِبٍ إِنِّي أَحْتَسِبُ خُطَاىَ هَذِهِ فِي سَبِيلِ اللَّهِ ثُمَّ قَالَ لَهُ إِنَّكَ سَتَجِدُ قَوْمًا زَعَمُوا أَنَّهُمْ حَبَّسُوا أَنْفُسَهُمْ لِلَّهِ فَذَرْهُمْ وَمَا زَعَمُوا أَنَّهُمْ حَبَّسُوا أَنْفُسَهُمْ لَهُ وَسَتَجِدُ قَوْمًا فَحَصُوا عَنْ أَوْسَاطِ رُءُوسِهِمْ مِنَ الشَّعَرِ فَاضْرِبْ مَا فَحَصُوا عَنْهُ بِالسَّيْفِ وَإِنِّي مُوصِيكَ بِعَشْرٍ لاَ تَقْتُلَنَّ امْرَأَةً وَلاَ صَبِيًّا وَلاَ كَبِيرًا هَرِمًا وَلاَ تَقْطَعَنَّ شَجَرًا مُثْمِرًا وَلاَ تُخَرِّبَنَّ عَامِرًا وَلاَ تَعْقِرَنَّ شَاةً وَلاَ بَعِيرًا إِلاَّ لِمَأْكُلَةٍ وَلاَ تَحْرِقَنَّ نَحْلاً وَلاَ تُفَرِّقَنَّهُ وَلاَ تَغْلُلْ وَلاَ تَجْبُنْ ‏.‏","english":{"narrator":"Yahya related to me from Malik from Yahya ibn Said that Abu Bakr\nas-Siddiq was sending armies to ash-Sham. He went for a walk with\nYazid ibn Abi Sufyan who was the commander of one of the battalions.\nIt is claimed that Yazid said to Abu Bakr, \"Will you ride or shall I\nget down?\" Abu Bakrsaid, \"I will not ride and you will not get down. I\nintend these steps of mine to be in the way of Allah.\"\n\n\nThen\nAbu Bakr advised Yazid, \"You will find a people who claim to have\ntotally given themselves to Allah. Leave them to what they claim to\nhave given themselves. You will find a people who have shaved the\nmiddle of their heads, strike what they have shaved with the sword.\n\n\n\"I advise you ten things:","text":"Do not kill women or children or an\naged, infirm person. Do not cut down fruit-bearing trees. Do not\ndestroy an inhabited place. Do not slaughter sheep or camels except\nfor food. Do not burn bees and do not scatter them. Do not steal from\nthe booty, and do not be cowardly.\""}},{"id":11,"idInBook":11,"chapterId":21,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ، كَتَبَ إِلَى عَامِلٍ مِنْ عُمَّالِهِ أَنَّهُ بَلَغَنَا أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا بَعَثَ سَرِيَّةً يَقُولُ لَهُمُ ‏\n\"‏ اغْزُوا بِاسْمِ اللَّهِ فِي سَبِيلِ اللَّهِ تُقَاتِلُونَ مَنْ كَفَرَ بِاللَّهِ لاَ تَغُلُّوا وَلاَ تَغْدِرُوا وَلاَ تُمَثِّلُوا وَلاَ تَقْتُلُوا وَلِيدًا وَقُلْ ذَلِكَ لِجِيُوشِكَ وَسَرَايَاكَ إِنْ شَاءَ اللَّهُ وَالسَّلاَمُ عَلَيْكَ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Umar ibn\nAbd al-Aziz wrote to one of his governors, \"It has been passed down to\nus that when the Messenger of Allah, may Allah bless him and grant him\npeace, sent out a raiding party, he would say to them, 'Make your\nraids in the name of Allah in the way of Allah. Fight whoever denies\nAllah. Do not steal from the booty, and do not act treacherously. Do\nnot mutilate and do not kill children.'  Say the same to your armies\nand raiding parties, Allah willing. Peace be upon you.\""}},{"id":12,"idInBook":12,"chapterId":21,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ رَجُلٍ، مِنْ أَهْلِ الْكُوفَةِ أَنَّ عُمَرَ بْنَ الْخَطَّابِ، كَتَبَ إِلَى عَامِلِ جَيْشٍ كَانَ بَعَثَهُ إِنَّهُ بَلَغَنِي أَنَّ رِجَالاً مِنْكُمْ يَطْلُبُونَ الْعِلْجَ حَتَّى إِذَا أَسْنَدَ فِي الْجَبَلِ وَامْتَنَعَ قَالَ رَجُلٌ مَطْرَسْ - يَقُولَ لاَ تَخَفْ - فَإِذَا أَدْرَكَهُ قَتَلَهُ وَإِنِّي وَالَّذِي نَفْسِي بِيَدِهِ لاَ أَعْلَمُ مَكَانَ وَاحِدٍ فَعَلَ ذَلِكَ إِلاَّ ضَرَبْتُ عُنُقَهُ ‏.‏ قَالَ يَحْيَى سَمِعْتُ مَالِكًا يَقُولُ لَيْسَ هَذَا الْحَدِيثُ بِالْمُجْتَمَعِ عَلَيْهِ وَلَيْسَ عَلَيْهِ الْعَمَلُ ‏.‏ وَسُئِلَ مَالِكٌ عَنِ الإِشَارَةِ بِالأَمَانِ أَهِيَ بِمَنْزِلَةِ الْكَلاَمِ فَقَالَ نَعَمْ وَإِنِّي أَرَى أَنْ يُتَقَدَّمَ إِلَى الْجُيُوشِ أَنْ لاَ تَقْتُلُوا أَحَدًا أَشَارُوا إِلَيْهِ بِالأَمَانِ لأَنَّ الإِشَارَةَ عِنْدِي بِمَنْزِلَةِ الْكَلاَمِ وَإِنَّهُ بَلَغَنِي أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ قَالَ مَا خَتَرَ قَوْمٌ بِالْعَهْدِ إِلاَّ سَلَّطَ اللَّهُ عَلَيْهِمُ الْعَدُوَّ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from a man of Kufa that Umar ibn\nal-Khattab wrote to a lieutenant of an army which he had sent out, \"I\nhave heard that it is the habit of some of your men to chase an\nunbeliever till he takes refuge in a high place. Then one man tells\nhim in Persian not to be afraid, and when he comes up to him, he kills\nhim. By He in whose hand my self is, if I knew someone who had done\nthat, I would strike off his head.\"\n\n\nYahya said, I heard Malik\nsay, \"This tradition is not unanimously agreed upon, so one does not\nact on it.\"\n\n\nMalik when asked whether safe conduct promised by\ngesture had the same status as that promised by speech, said, \"Yes. I\nthink that one can request an army not to kill someone by gesturing\nfor safe conduct, because as far as I am concerned, gesture has the\nsame status as speech. I have heard that Abdullah ibn Abbas said,\n'There is no people who betray a pledge, but that Allah gives their\nenemies power over them.' \""}},{"id":13,"idInBook":13,"chapterId":21,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ كَانَ إِذَا أَعْطَى شَيْئًا فِي سَبِيلِ اللَّهِ يَقُولُ لِصَاحِبِهِ إِذَا بَلَغْتَ وَادِيَ الْقُرَى فَشَأْنَكَ بِهِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that when Abdullah ibn\nUmar gave something in the way of Allah, he would say to its owner,\n\"When you reach Wadi'l-Qura, (on the outskirts of Madina) then it is\nyour affair.\""}},{"id":14,"idInBook":14,"chapterId":21,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ سَعِيدَ بْنَ الْمُسَيَّبِ، كَانَ يَقُولُ إِذَا أُعْطِيَ الرَّجُلُ الشَّىْءَ فِي الْغَزْوِ فَيَبْلُغُ بِهِ رَأْسَ مَغْزَاتِهِ فَهُوَ لَهُ ‏.‏ وَسُئِلَ مَالِكٌ عَنْ رَجُلٍ أَوْجَبَ عَلَى نَفْسِهِ الْغَزْوَ فَتَجَهَّزَ حَتَّى إِذَا أَرَادَ أَنْ يَخْرُجَ مَنَعَهُ أَبَوَاهُ أَوْ أَحَدُهُمَا فَقَالَ لاَ يُكَابِرْهُمَا وَلَكِنْ يُؤَخِّرُ ذَلِكَ إِلَى عَامٍ آخَرَ فَأَمَّا الْجِهَازُ فَإِنِّي أَرَى أَنْ يَرْفَعَهُ حَتَّى يَخْرُجَ بِهِ فَإِنْ خَشِيَ أَنْ يَفْسُدَ بَاعَهُ وَأَمْسَكَ ثَمَنَهُ حَتَّى يَشْتَرِيَ بِهِ مَا يُصْلِحُهُ لِلْغَزْوِ فَإِنْ كَانَ مُوسِرًا يَجِدُ مِثْلَ جِهَازِهِ إِذَا خَرَجَ فَلْيَصْنَعْ بِجِهَازِهِ مَا شَاءَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said that Said ibn\nal-Musayyab used to say, \"When a man is given something to use in a\nmilitary expedition, and he brings it to the battlefield, it is his.\"\n\n\nMalik was asked about a man who pledged himself to go on a\nmilitary campaign, equipped himself,and when he wanted to go out, one\nor both of his parents prevented him. He said, \"He should not\ncontradict them. Let him put it off for another year. As for the\nequipment, I think that he should store it until he needs it. If he\nfears that it will spoil, let him sell it and keep its price so that\nhe can readily buy what is needed fora military expedition. If he is\nwell-to-do, he will find the like of his equipment when he goes out,\nso let him do what he likes with his equipment.\""}},{"id":15,"idInBook":15,"chapterId":21,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعَثَ سَرِيَّةً فِيهَا عَبْدُ اللَّهِ بْنُ عُمَرَ قِبَلَ نَجْدٍ فَغَنِمُوا إِبِلاً كَثِيرَةً فَكَانَ سُهْمَانُهُمُ اثْنَىْ عَشَرَ بَعِيرًا أَوْ أَحَدَ عَشَرَ بَعِيرًا وَنُفِّلُوا بَعِيرًا بَعِيرًا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat the Messenger of Allah, may Allah bless him and grant him peace,\nsent a raiding party which included Abdullah ibn Umar near Najd. They\nplundered many camels and their portions were twelve or eleven camels\neach. They divided it up camel by camel."}},{"id":16,"idInBook":16,"chapterId":21,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ سَمِعَ سَعِيدَ بْنَ الْمُسَيَّبِ، يَقُولُ كَانَ النَّاسُ فِي الْغَزْوِ إِذَا اقْتَسَمُوا غَنَائِمَهُمْ يَعْدِلُونَ الْبَعِيرَ بِعَشْرِ شِيَاهٍ ‏.‏ قَالَ مَالِكٌ فِي الأَجِيرِ فِي الْغَزْوِ إِنَّهُ إِنْ كَانَ شَهِدَ الْقِتَالَ وَكَانَ مَعَ النَّاسِ عِنْدَ الْقِتَالِ وَكَانَ حُرًّا فَلَهُ سَهْمُهُ وَإِنْ لَمْ يَفْعَلْ ذَلِكَ فَلاَ سَهْمَ لَهُ وَأَرَى أَنْ لاَ يُقْسَمَ إِلاَّ لِمَنْ شَهِدَ الْقِتَالَ مِنَ الأَحْرَارِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said that he heard\nSaid ibn al-Musayyab say, \"When people in military expeditions divided\nthe spoils, they made a camel equal to ten sheep.\"\n\n\nMalik said\nabout the paid labourer in military expeditions, \"If he is present at\nthe battle and is with the people in the battle and he is a free man,\nhe has his share. If he is not present, he has no share.\"\n\n\nMalik summed up, \"I think that the booty is only divided among free\nmen who have been present at the battle. \""}},{"id":17,"idInBook":17,"chapterId":21,"bookId":7,"arabic":"","english":{"narrator":"","text":"Malik said about enemy soldiers who were found on the seashore of\na Muslim land, and they claimed that they were merchants and that the\nsea had driven them ashore, while the Muslims were not able to verify\nany of that except that their ships were damaged, or they were thirsty\nand had disembarked without the permission of the Muslims, \"I think\nthat it is up to the imam to give his opinion about them, and I do not\nthink that the tax of one fifth is taken from them.\""}},{"id":18,"idInBook":18,"chapterId":21,"bookId":7,"arabic":"","english":{"narrator":"","text":"Malik said, \"I do not see that there is any harm in the Muslims\neating whatever food they come across in enemy territory before the\nspoils are divided.\"\n\n\nMalik said, \"I think that any camels,\ncattle and sheep (taken as booty) are considered as food which the\nMuslims can eat in enemy territory. If they could not be eaten until\nthe people had gathered for the division and the spoils had been\ndistributed among them, that would be harmful for the army. I do not\nsee any objection to eating such things within acceptable limits. I do\nnot think, however, that anyone should store up any of it to take back\nto his family.\"\n\n\nMalik was asked whether it was proper for a\nman who obtained food in enemy territory and ate some of it and made\nprovision so that there was some of it left over to keep and eat with\nhis family, or to sell before he had come to his country and make use\nof its price. He said, \"If he sells it while he is on a military\nexpedition, I think that he should put its price into the booty of the\nMuslims. If he takes it back to his country, I see no objection to his\neating it and using it if it is a small insignificant thing.\""}},{"id":19,"idInBook":19,"chapterId":21,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَبْدًا، لِعَبْدِ اللَّهِ بْنِ عُمَرَ أَبَقَ وَأَنَّ فَرَسًا لَهُ عَارَ فَأَصَابَهُمَا الْمُشْرِكُونَ ثُمَّ غَنِمَهُمَا الْمُسْلِمُونَ فَرُدَّا عَلَى عَبْدِ اللَّهِ بْنِ عُمَرَ وَذَلِكَ قَبْلَ أَنْ تُصِيبَهُمَا الْمَقَاسِمُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that it reached him that a slave\nof Abdullah ibn Umar escaped and one of his horses wandered off, and\nthe idol worshippers seized them. Then the Muslims recaptured them,\nand they were returned to Abdullah ibn Umar, before the division of\nthe spoils took place.\n\n\nI heard Malik say about muslim\nproperty that had been seized by the enemy, \"If it is noticed before\nthe distribution, then it is returned to itsowner. Whatever has\nalready been distributed is not returned to anyone.\"\n\n\nMalik,\nwhen asked about a man whose young male slave was taken by the idol\nworshippers and then the Muslims re-captured him, said, \"The owner is\nmore entitled to him without having to pay his price or value or\nhaving to incur any loss before the distribution takes place. If the\ndistribution has already taken place then I think that the slave\nbelongs to his master for his price if the master wants him back.\"\n\n\nRegarding an umm walad of a Muslim man who has been taken by\nthe idol worshippers and then recaptured by the Muslims and allotted\nin the distribution of spoils and then recognised by her master after\nthe distribution, Malik said, \"She is not to be enslaved. I think that\nthe Imam should pay a  ransom for her for her master. If  he does not\ndo it, then her master must pay a ransom for her and not leave her. I\ndo not think that she should be made a slave by whoever takes her and\nintercourse with her is not halal. She is in the position of a free\nwoman because her master would be required to pay compensation if she\ninjured somebody and so she is in the same position (as a wife). He\nmust not leave the mother of his son to be enslaved nor may\nintercourse with her be made halal.\"\n\n\nMalik was asked about a\nman who went to enemy territory to pay ransom or to trade, and he\nbought a free man or a slave, or they were given to him. He said, \"As\nfor the free man, the price he buys him for is a debt against the man\nand he is not made a slave. If the captive is given to him freely, he\nis free and owes nothing unless the man gave something in recompense\nfor him. That is a debt against the free man, the same as if a ransom\nhad been paid for him. As for a slave, his former master can choose to\ntake him back and pay his price to the man who bought him or he can\nchoose to leave him, as he wishes. If he was given to the man, the\nformer master is more entitled to him, and he owes nothing for him\nunless the man gave something for him in recompense. Whatever he gave\nfor him is a loss against the master if he wants him back.\""}},{"id":20,"idInBook":20,"chapterId":21,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عُمَرَ بْنِ كَثِيرِ بْنِ أَفْلَحَ، عَنْ أَبِي مُحَمَّدٍ، مَوْلَى أَبِي قَتَادَةَ عَنْ أَبِي قَتَادَةَ بْنِ رِبْعِيٍّ، أَنَّهُ قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم عَامَ حُنَيْنٍ فَلَمَّا الْتَقَيْنَا كَانَتْ لِلْمُسْلِمِينَ جَوْلَةٌ - قَالَ - فَرَأَيْتُ رَجُلاً مِنَ الْمُشْرِكِينَ قَدْ عَلاَ رَجُلاً مِنَ الْمُسْلِمِينَ - قَالَ - فَاسْتَدَرْتُ لَهُ حَتَّى أَتَيْتُهُ مِنْ وَرَائِهِ فَضَرَبْتُهُ بِالسَّيْفِ عَلَى حَبْلِ عَاتِقِهِ فَأَقْبَلَ عَلَىَّ فَضَمَّنِي ضَمَّةً وَجَدْتُ مِنْهَا رِيحَ الْمَوْتِ ثُمَّ أَدْرَكَهُ الْمَوْتُ فَأَرْسَلَنِي - قَالَ - فَلَقِيتُ عُمَرَ بْنَ الْخَطَّابِ فَقُلْتُ مَا بَالُ النَّاسِ فَقَالَ أَمْرُ اللَّهِ ‏.‏ ثُمَّ إِنَّ النَّاسَ رَجَعُوا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ قَتَلَ قَتِيلاً لَهُ عَلَيْهِ بَيِّنَةٌ فَلَهُ سَلَبُهُ ‏\"‏ ‏.‏ قَالَ فَقُمْتُ ثُمَّ قُلْتُ مَنْ يَشْهَدُ لِي ثُمَّ جَلَسْتُ ‏.‏ ثُمَّ قَالَ ‏\"‏ مَنْ قَتَلَ قَتِيلاً لَهُ عَلَيْهِ بَيِّنَةٌ فَلَهُ سَلَبُهُ ‏\"‏ ‏.‏ قَالَ فَقُمْتُ ثُمَّ قُلْتُ مَنْ يَشْهَدُ لِي ثُمَّ جَلَسْتُ ثُمَّ قَالَ ذَلِكَ الثَّالِثَةَ فَقُمْتُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا لَكَ يَا أَبَا قَتَادَةَ ‏\"‏ ‏.‏ قَالَ فَاقْتَصَصْتُ عَلَيْهِ الْقِصَّةَ ‏.‏ فَقَالَ رَجُلٌ مِنَ الْقَوْمِ صَدَقَ يَا رَسُولَ اللَّهِ وَسَلَبُ ذَلِكَ الْقَتِيلِ عِنْدِي فَأَرْضِهِ عَنْهُ يَا رَسُولَ اللَّهِ ‏.‏ فَقَالَ أَبُو بَكْرٍ لاَ هَاءَ اللَّهِ إِذًا لاَ يَعْمِدُ إِلَى أَسَدٍ مِنْ أُسْدِ اللَّهِ يُقَاتِلُ عَنِ اللَّهِ وَرَسُولِهِ فَيُعْطِيكَ سَلَبَهُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ صَدَقَ فَأَعْطِهِ إِيَّاهُ ‏\"‏ ‏.‏ فَأَعْطَانِيهِ فَبِعْتُ الدِّرْعَ فَاشْتَرَيْتُ بِهِ مَخْرَفًا فِي بَنِي سَلِمَةَ فَإِنَّهُ لأَوَّلُ مَالٍ تَأَثَّلْتُهُ فِي الإِسْلاَمِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said from Amr ibn\nKathir ibn Aflah from Abu Muhammad, the mawla of Abu Qatada that Abu\nQatada ibn Ribi said, \"We went out with the Messenger of Allah, may\nAllah bless him and grant him peace, in the year of Hunayn. When the\narmies met, the Muslims were put in disarray. I saw a man from the\nidol worshippers who had got the better of one of the Muslims, so I\ncircled round and came up behind him, and struck him with a sword on\nhis shoulder-blade. He turned to me and grabbed me so hard that I felt\nthe smell of death in it. Then death overcame him, and he let go of\nme.\"\n\n\nHe continued, \"I met Umar ibn al-Khattab and said to\nhim, 'What's going on with the people?' He replied, 'The Command of\nAllah.' Then the people took hold of the battle and the Messenger of\nAllah, may Allah bless him and grant him peace, said, 'Whoever has\nkilled one of the dead and can prove it, can strip him of his personal\neffects.' I stood up and said, 'Who will testify for me?' and then I\nsat down. The Messenger of Allah repeated, 'Whoever has killed one of\nthe dead and can prove it, can strip him of his personal effects.' I\nstood up and said, 'Who will testify for me?' then I sat down. Then he\nrepeated his statement a third time, so I stood up, and the Messenger\nof Allah, may Allah bless him and grant him peace, said, 'What's the\nmatter with you, Abu Qatada?' So I related my story to him. A man\nsaid, 'He has spoken the truth, Messenger of Allah. I have the effects\nof that slain person with me, so give him compensation for it,\nMessenger of Allah.'\n\n\nAbu Bakr said, 'No, by Allah! He did not\nintend that one of the lions of Allah should fight for Allah and His\nMessenger and then give you his spoils.' The Messenger of Allah, may\nAllah bless him and grant him peace, said, 'He has spoken the truth,\nhand it over to him.' He gave it to me, and I sold the breast-plate\nand I bought a garden in the area of the Banu Salima with the money.\nIt was my first property, and I acquired it in Islam.\""}},{"id":21,"idInBook":21,"chapterId":21,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، أَنَّهُ قَالَ سَمِعْتُ رَجُلاً، يَسْأَلُ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ عَنِ الأَنْفَالِ، فَقَالَ ابْنُ عَبَّاسٍ الْفَرَسُ مِنَ النَّفَلِ وَالسَّلَبُ مِنَ النَّفَلِ ‏.‏ قَالَ ثُمَّ عَادَ الرَّجُلُ لِمَسْأَلَتِهِ فَقَالَ ابْنُ عَبَّاسٍ ذَلِكَ أَيْضًا ثُمَّ قَالَ الرَّجُلُ الأَنْفَالُ الَّتِي قَالَ اللَّهُ فِي كِتَابِهِ مَا هِيَ قَالَ الْقَاسِمُ فَلَمْ يَزَلْ يَسْأَلُهُ حَتَّى كَادَ أَنْ يُحْرِجَهُ ثُمَّ قَالَ ابْنُ عَبَّاسٍ أَتَدْرُونَ مَا مَثَلُ هَذَا مَثَلُ صَبِيغٍ الَّذِي ضَرَبَهُ عُمَرُ بْنُ الْخَطَّابِ ‏.‏ قَالَ وَسُئِلَ مَالِكٌ عَمَّنْ قَتَلَ قَتِيلاً مِنَ الْعَدُوِّ أَيَكُونُ لَهُ سَلَبُهُ بِغَيْرِ إِذْنِ الإِمَامِ قَالَ لاَ يَكُونُ ذَلِكَ لأَحَدٍ بِغَيْرِ إِذْنِ الإِمَامِ وَلاَ يَكُونُ ذَلِكَ مِنَ الإِمَامِ إِلاَّ عَلَى وَجْهِ الاِجْتِهَادِ وَلَمْ يَبْلُغْنِي أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ قَتَلَ قَتِيلاً فَلَهُ سَلَبُهُ ‏\"‏ ‏.‏ إِلاَّ يَوْمَ حُنَيْنٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab that al-Qasim ibn\nMuhammad said that he had heard a man asking ibn Abbas about booty.\nIbn Abbas said, \"Horses are part of the booty and personal effects are\nas well.\"\n\n\nThen the man repeated his question, and Ibn Abbas\nrepeated his answer. Then the man said, \"What are the spoils which He,\nthe Blessed, the Exalted, mentioned in His Book?\" He kept on asking\nuntil Ibn Abbas was on the verge of being annoyed, then Ibn Abbas\nsaid, \"Do you know who this man is like? Ibn Sabigh, who was beaten by\nUmar ibn al-Khattab because he was notorious for asking foolish\nquestions.\"\n\n\nYahya said that Malik was asked whether someone\nwho killed one of the enemy could keep the man's effects without the\npermission of the Imam. He said, \"No one can do that without the\npermission of the Imam. Only the Imam can make ijtihad. I have not\nheard that the Messenger of Allah, may Allah bless him and grant him\npeace, ever said, 'Whoever kills someone can have his effects,' on any\nother day than the day of Hunayn.\"\n\n\n3"}},{"id":22,"idInBook":22,"chapterId":21,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ قَالَ كَانَ النَّاسُ يُعْطَوْنَ النَّفَلَ مِنَ الْخُمُسِ ‏.‏ قَالَ مَالِكٌ وَذَلِكَ أَحْسَنُ مَا سَمِعْتُ إِلَىَّ فِي ذَلِكَ ‏.‏ وَسُئِلَ مَالِكٌ عَنِ النَّفَلِ هَلْ يَكُونُ فِي أَوَّلِ مَغْنَمٍ قَالَ ذَلِكَ عَلَى وَجْهِ الاِجْتِهَادِ مِنَ الإِمَامِ وَلَيْسَ عِنْدَنَا فِي ذَلِكَ أَمْرٌ مَعْرُوفٌ مَوْثُوقٌ إِلاَّ اجْتِهَادُ السُّلْطَانِ وَلَمْ يَبْلُغْنِي أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَفَّلَ فِي مَغَازِيهِ كُلِّهَا وَقَدْ بَلَغَنِي أَنَّهُ نَفَّلَ فِي بَعْضِهَا يَوْمَ حُنَيْنٍ وَإِنَّمَا ذَلِكَ عَلَى وَجْهِ الاِجْتِهَادِ مِنَ الإِمَامِ فِي أَوَّلِ مَغْنَمٍ وَفِيمَا بَعْدَهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'z-Zinad that Said ibn al-\nMusayyab said, \"People used to be given bonuses from the Khumus.\"\n\n\nMalik said, \"That is the best of what I have heard on the matter.\"\n\n\nMalik was asked about bonuses and whether they were taken\nfrom the first of the spoils, and he said, \"That is only decided\naccording to the ijtihad of the Imam. We do not have a known reliable\ncommand about that other than it is up to the ijtihad of the Sultan. I\nhave not heard that the Messenger of Allah, may Allah bless him and\ngrant him peace, gave bonuses in all his raids. I have only heard that\nhe gave bonuses in one of them, namely the day of Hunayn. It depends\non the ijtihad of the Imam whether they are taken from the first of\nthe spoils or what is after it.\""}},{"id":23,"idInBook":23,"chapterId":21,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ قَالَ بَلَغَنِي أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ، كَانَ يَقُولُ لِلْفَرَسِ سَهْمَانِ وَلِلرَّجُلِ سَهْمٌ ‏.‏ قَالَ مَالِكٌ وَلَمْ أَزَلْ أَسْمَعُ ذَلِكَ ‏.‏ وَسُئِلَ مَالِكٌ عَنْ رَجُلٍ يَحْضُرُ  بِأَفْرَاسٍ كَثِيرَةٍ فَهَلْ يُقْسَمُ لَهَا كُلِّهَا فَقَالَ لَمْ أَسْمَعْ بِذَلِكَ وَلاَ أَرَى أَنْ يُقْسَمَ إِلاَّ لِفَرَسٍ وَاحِدٍ الَّذِي يُقَاتِلُ عَلَيْهِ ‏.‏ قَالَ مَالِكٌ لاَ أَرَى الْبَرَاذِينَ وَالْهُجُنَ إِلاَّ مِنَ الْخَيْلِ لأَنَّ اللَّهَ تَبَارَكَ وَتَعَالَى قَالَ فِي كِتَابِهِ ‏{‏وَالْخَيْلَ وَالْبِغَالَ وَالْحَمِيرَ لِتَرْكَبُوهَا وَزِينَةً‏}‏ وَقَالَ عَزَّ وَجَلَّ ‏{‏وَأَعِدُّوا لَهُمْ مَا اسْتَطَعْتُمْ مِنْ قُوَّةٍ وَمِنْ رِبَاطِ الْخَيْلِ تُرْهِبُونَ بِهِ عَدُوَّ اللَّهِ وَعَدُوَّكُمْ‏}‏ فَأَنَا أَرَى الْبَرَاذِينَ وَالْهُجُنَ مِنَ الْخَيْلِ إِذَا أَجَازَهَا الْوَالِي وَقَدْ قَالَ سَعِيدُ بْنُ الْمُسَيَّبِ وَسُئِلَ عَنِ الْبَرَاذِينَ هَلْ فِيهَا مِنْ صَدَقَةٍ فَقَالَ وَهَلْ فِي الْخَيْلِ مِنْ صَدَقَةٍ","english":{"narrator":"","text":"Yahya related to me that Malik said that he had heard that Umar\nibn Abd al-Aziz used to say, \"The man on horse-back has two shares,\nand the man on foot has one.\"\n\n\nMalik added, \"I continue to\nhear the same.\"\n\n\nMalik, when asked whether a man who was\npresent with several horses took a share for all of them, said, \"I\nhave never heard that. I think that there is only a share for the\nhorse on which he fought.\"\n\n\nMalik said, \"I think that foreign\nhorses and half-breeds are considered as horses because Allah, the\nBlessed, the Exalted, said in His Book, 'All horses, and mules, and\nasses, for you to ride, and as an adornment.' (Sura16 ayat 8). He\nsaid, the Mighty, the Majestic, 'Make ready for them whatever force\nand strings of horses you can, to terrify thereby the enemy of Allah\nand your enemy.' (Sura 8 ayat 60). I think that foreign breeds and\nhalf-breeds are considered as horses if the governor accepts them.\"\n\n\nSaid ibn al-Musayyab was asked about working horses, and\nwhether there was zakat on them. He said, \"Is there any zakat on\nhorses.?\""}},{"id":24,"idInBook":24,"chapterId":21,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ رَبِّهِ بْنِ سَعِيدٍ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم حِينَ صَدَرَ مِنْ حُنَيْنٍ وَهُوَ يُرِيدُ الْجِعِرَّانَةَ سَأَلَهُ النَّاسُ حَتَّى دَنَتْ بِهِ نَاقَتُهُ مِنْ شَجَرَةٍ فَتَشَبَّكَتْ بِرِدَائِهِ حَتَّى نَزَعَتْهُ عَنْ ظَهْرِهِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ رُدُّوا عَلَىَّ رِدَائِي أَتَخَافُونَ أَنْ لاَ أَقْسِمَ بَيْنَكُمْ مَا أَفَاءَ اللَّهُ عَلَيْكُمْ وَالَّذِي نَفْسِي بِيَدِهِ لَوْ أَفَاءَ اللَّهُ عَلَيْكُمْ مِثْلَ سَمُرِ تِهَامَةَ نَعَمًا لَقَسَمْتُهُ بَيْنَكُمْ ثُمَّ لاَ تَجِدُونِي بَخِيلاً وَلاَ جَبَانًا وَلاَ كَذَّابًا ‏\"‏ ‏.‏ فَلَمَّا نَزَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَامَ فِي النَّاسِ فَقَالَ ‏\"‏ أَدُّوا الْخِيَاطَ وَالْمِخْيَطَ فَإِنَّ الْغُلُولَ عَارٌ وَنَارٌ وَشَنَارٌ عَلَى أَهْلِهِ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏ قَالَ ثُمَّ تَنَاوَلَ مِنَ الأَرْضِ وَبَرَةً مِنْ بَعِيرٍ أَوْ شَيْئًا ثُمَّ قَالَ ‏\"‏ وَالَّذِي نَفْسِي بِيَدِهِ مَا لِي مِمَّا أَفَاءَ اللَّهُ عَلَيْكُمْ وَلاَ مِثْلَ هَذِهِ إِلاَّ الْخُمُسُ وَالْخُمُسُ مَرْدُودٌ عَلَيْكُمْ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abd ar-Rahman ibn Said from\nAmr ibn Shuayb that when the Messenger of Allah, may Allah bless him\nand grant him peace, came back from Hunayn heading for al-Jiirrana,\nthe people crowded around so much to question him that his she-camel\nbacked into a tree, which became entangled in his cloak and pulled it\noff his back. The Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"Return my cloak to me. Are you afraid that I will\nnot distribute among you what Allah has given you as spoils. By He in\nwhose hand my self is! Had Allah given you spoils equal to the number\nof acacia trees on the plain of Tihama, I would have distributed it\namong you. You will not find me to be miserly, cowardly, or a liar.\"\nThen the Messenger of Allah, may Allah bless him and grant him peace,\ngot down and stood among the people, and said, \"Hand over even the\nneedle and thread, for stealing from the spoils is disgrace, fire,\nignominy on the Day of Rising for people who do it.\" Then he took a\nbit of camel fluff or something from the ground and said, \"By He in\nwhose hand my self is! What Allah has made spoils for you is not mine\n- even the like of this! - except for the tax of one fifth, and the\ntax of one fifth is returned to you.\""}},{"id":25,"idInBook":25,"chapterId":21,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، أَنَّ زَيْدَ بْنَ خَالِدٍ الْجُهَنِيَّ، قَالَ تُوُفِّيَ رَجُلٌ يَوْمَ حُنَيْنٍ وَإِنَّهُمْ ذَكَرُوهُ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَزَعَمَ زَيْدٌ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ صَلُّوا عَلَى صَاحِبِكُمْ ‏\"‏ ‏.‏ فَتَغَيَّرَتْ وُجُوهُ النَّاسِ لِذَلِكَ فَزَعَمَ زَيْدٌ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ صَاحِبَكُمْ قَدْ غَلَّ فِي سَبِيلِ اللَّهِ ‏\"‏ ‏.‏ قَالَ فَفَتَحْنَا مَتَاعَهُ فَوَجَدْنَا خَرَزَاتٍ مِنْ خَرَزِ يَهُودَ مَا تُسَاوِينَ دِرْهَمَيْنِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said from Muhammad\nibn Yahya ibn Habban from Ibn Abi Amra that Zayd ibn Khalid al-Juhani\nsaid, \"A man died on the day of Hunayn, and they mentioned him to the\nMessenger of Allah, may Allah bless him and grant him peace.\" Zayd\nclaimed that the Messenger of Allah, may Allah bless him and grant him\npeace, said, \"You pray over your companion.\" (i.e. he would not pray\nhimself). The people's faces dropped at that. Zayd claimed that the\nMessenger of Allah, may Allah bless him and grant him peace, said,\n\"Your companion stole from the spoils taken in the way of Allah.\" Zayd\nsaid, \"So we opened up his baggage and found some Jews' beads worth\nabout two dirhams.\""}},{"id":26,"idInBook":26,"chapterId":21,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ بْنِ أَبِي بُرْدَةَ الْكِنَانِيِّ، أَنَّهُ بَلَغَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَتَى النَّاسَ فِي قَبَائِلِهِمْ يَدْعُو لَهُمْ وَأَنَّهُ تَرَكَ قَبِيلَةً مِنَ الْقَبَائِلِ - قَالَ - وَإِنَّ الْقَبِيلَةَ وَجَدُوا فِي بَرْدَعَةِ رَجُلٍ مِنْهُمْ عِقْدَ جَزْعٍ غُلُولاً فَأَتَاهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم فَكَبَّرَ عَلَيْهِمْ كَمَا يُكَبِّرُ عَلَى الْمَيِّتِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said from Abdullah\nibn al-Mughira ibn Abi Burda al-Kinani that he had heard that the\nMessenger of Allah, may Allah bless him and grant him peace, came to\nthe people in their tribes and made dua for them, but left out one of\nthe tribes. Abdullah related, \"The tribe found an onyx necklace in the\nsaddle-bags of one of their men. The Messenger of Allah, may Allah\nbless him and grant him peace, came to them, and then did the takbir\nover them as one does the takbir over the dead.\""}},{"id":27,"idInBook":27,"chapterId":21,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ ثَوْرِ بْنِ زَيْدٍ الدِّيلِيِّ، عَنْ أَبِي الْغَيْثِ، سَالِمٍ مَوْلَى ابْنِ مُطِيعٍ عَنْ أَبِي هُرَيْرَةَ، قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم عَامَ حُنَيْنٍ فَلَمْ نَغْنَمْ ذَهَبًا وَلاَ وَرِقًا إِلاَّ الأَمْوَالَ الثِّيَابَ وَالْمَتَاعَ - قَالَ - فَأَهْدَى رِفَاعَةُ بْنُ زَيْدٍ لِرَسُولِ اللَّهِ صلى الله عليه وسلم غُلاَمًا أَسْوَدَ يُقَالُ لَهُ مِدْعَمٌ فَوَجَّهَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى وَادِي الْقُرَى حَتَّى إِذَا كُنَّا بِوَادِي الْقُرَى بَيْنَمَا مِدْعَمٌ يَحُطُّ رَحْلَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِذْ جَاءَهُ سَهْمٌ عَائِرٌ فَأَصَابَهُ فَقَتَلَهُ فَقَالَ النَّاسُ هَنِيئًا لَهُ الْجَنَّةُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ كَلاَّ وَالَّذِي نَفْسِي بِيَدِهِ إِنَّ الشَّمْلَةَ الَّتِي أَخَذَ يَوْمَ حُنَيْنٍ مِنَ الْمَغَانِمِ لَمْ تُصِبْهَا الْمَقَاسِمُ لَتَشْتَعِلُ عَلَيْهِ نَارًا ‏\"‏ ‏.‏ قَالَ فَلَمَّا سَمِعَ النَّاسُ ذَلِكَ جَاءَ رَجُلٌ بِشِرَاكٍ أَوْ شِرَاكَيْنِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ شِرَاكٌ أَوْ شِرَاكَانِ مِنْ نَارٍ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Thawr ibn Zayd ad-Dili from\nAbu'l-Ghayth Salim, the mawla of ibn Muti that Abu Hurayra said, \"We\nwent out with the Messenger of Allah, may Allah bless him and grant\nhim peace, in the yearof Khaybar. We did not capture any gold or\nsilver except for personal effects, clothes, and baggage. Rifaa ibn\nZayd presented a black slave boy to the Messenger of Allah, may Allah\nbless him and grant him peace, whose name was Midam. The Messenger of\nAllah, may Allah bless him and grant him peace, made for Wadi'l-Qura,\nand when he arrived there, Midam was unsaddling the camel of the\nMessenger of Allah, may Allah bless him and grant him peace, when a\nstray arrow struck and killed him. The people said, 'Good luck to him!\nThe Garden!' The Messenger of Allah said, 'No! By He in whose hand my\nself is! The cloak which he took from the spoils on the Day of Khaybar\nbefore they were distributed will blaze with fire on him.' When the\npeople heard that, a man brought a sandal-strap or two sandal-straps\nto the Messenger of Allah, may Allah bless him and grant him peace.\nThe Messenger of Allah, may Allah bless him and grant him peace, said,\n'A sandal-strap or two sandal-straps of fire!' \""}},{"id":28,"idInBook":28,"chapterId":21,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ بَلَغَهُ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، أَنَّهُ قَالَ مَا ظَهَرَ الْغُلُولُ فِي قَوْمٍ قَطُّ إِلاَّ أُلْقِيَ فِي قُلُوبِهِمُ الرُّعْبُ وَلاَ فَشَا الزِّنَا فِي قَوْمٍ قَطُّ إِلاَّ كَثُرَ فِيهِمُ الْمَوْتُ وَلاَ نَقَصَ قَوْمٌ الْمِكْيَالَ وَالْمِيزَانَ إِلاَّ قُطِعَ عَنْهُمُ الرِّزْقُ وَلاَ حَكَمَ قَوْمٌ بِغَيْرِ الْحَقِّ إِلاَّ فَشَا فِيهِمُ الدَّمُ وَلاَ خَتَرَ قَوْمٌ بِالْعَهْدِ إِلاَّ سَلَّطَ اللَّهُ عَلَيْهِمُ الْعَدُوَّ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said that he had\nheard that Abdullah ibn Abbas said, \"Stealing from the spoils does not\nappear in a people but that terror is cast into their hearts.\nFornication does not spread in a people but that there is much death\namong them. A people do not lessen the measure and weight but that\nprovision is cut off from them. A people do not judge without right\nbut that blood spreads among them. A people do not betray the pledge\nbut that Allah gives their enemies power over them.\""}},{"id":29,"idInBook":29,"chapterId":21,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ وَالَّذِي نَفْسِي بِيَدِهِ لَوَدِدْتُ أَنِّي أُقَاتِلُ فِي سَبِيلِ اللَّهِ فَأُقْتَلُ ثُمَّ أُحْيَا فَأُقْتَلُ ثُمَّ أُحْيَا فَأُقْتَلُ ‏\"‏ ‏.‏ فَكَانَ أَبُو هُرَيْرَةَ يَقُولُ ثَلاَثًا أَشْهَدُ بِاللَّهِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'z-Zinad from al-Araj from\nAbu Hurayra that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"By He in whose hand my self is! I would like to\nfight in the way of Allah and be killed, then be brought to life again\nso I could be killed, and then be brought to life again so I could be\nkilled.\" Abu Hurayra said three times, \"I testify to it by Allah!\""}},{"id":30,"idInBook":30,"chapterId":21,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ يَضْحَكُ اللَّهُ إِلَى رَجُلَيْنِ يَقْتُلُ أَحَدُهُمَا الآخَرَ كِلاَهُمَا يَدْخُلُ الْجَنَّةَ يُقَاتِلُ هَذَا فِي سَبِيلِ اللَّهِ فَيُقْتَلُ ثُمَّ يَتُوبُ اللَّهُ عَلَى الْقَاتِلِ فَيُقَاتِلُ فَيُسْتَشْهَدُ ‏\"‏ ‏.‏","english":{"narrator":"Yahya related to me from Malik from Abu'z-Zinad from al-Araj from\nAbu Hurayra that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"Allah laughs at two men. One of them kills the\nother, but each of them will enter the Garden:","text":"one fights in the way\nof Allah and is killed, then Allah turns to the killer, so he fights\n(in the way of Allah) and also becomes a martyr.\""}},{"id":31,"idInBook":31,"chapterId":21,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ وَالَّذِي نَفْسِي بِيَدِهِ لاَ يُكْلَمُ أَحَدٌ فِي سَبِيلِ اللَّهِ - وَاللَّهُ أَعْلَمُ بِمَنْ يُكْلَمُ فِي سَبِيلِهِ - إِلاَّ جَاءَ يَوْمَ الْقِيَامَةِ وَجُرْحُهُ يَثْعَبُ دَمًا اللَّوْنُ لَوْنُ دَمٍ وَالرِّيحُ رِيحُ الْمِسْكِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'z-Zinad from al-Araj from\nAbu Hurayra that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"By He in whose hand my self is! None of you is\nwounded in the way of Allah - and Allah knows best who is wounded in\nHisWay, but that when the Day of Rising comes, blood will gush forth\nfrom his wound. It will be the colour of blood, but its scent will be\nthat of musk.\""}},{"id":32,"idInBook":32,"chapterId":21,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، كَانَ يَقُولُ اللَّهُمَّ لاَ تَجْعَلْ قَتْلِي بِيَدِ رَجُلٍ صَلَّى لَكَ سَجْدَةً وَاحِدَةً يُحَاجُّنِي بِهَا عِنْدَكَ يَوْمَ الْقِيَامَةِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Zayd ibn Aslam that Umar ibn\nal-Khattab used to say, \"O Allah! Do not let me be slain by the hand\nof a man who has prayed a single prostration to You with which he will\ndispute with me before You on the Day of Rising!\""}},{"id":33,"idInBook":33,"chapterId":21,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ، عَنْ أَبِيهِ، أَنَّهُ قَالَ جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ إِنْ قُتِلْتُ فِي سَبِيلِ اللَّهِ صَابِرًا مُحْتَسِبًا مُقْبِلاً غَيْرَ مُدْبِرٍ أَيُكَفِّرُ اللَّهُ عَنِّي خَطَايَاىَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ نَعَمْ ‏\"‏ ‏.‏ فَلَمَّا أَدْبَرَ الرَّجُلُ نَادَاهُ رَسُولُ اللَّهِ صلى الله عليه وسلم أَوْ أَمَرَ بِهِ فَنُودِيَ لَهُ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ كَيْفَ قُلْتَ ‏\"‏ ‏.‏ فَأَعَادَ عَلَيْهِ قَوْلَهُ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ نَعَمْ إِلاَّ الدَّيْنَ كَذَلِكَ قَالَ لِي جِبْرِيلُ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said from Said al-\nMaqburi from Abdullah ibn Abi Qatada that his father had said that a\nman came to the Messenger of Allah, may Allah bless him and grant him\npeace, and said, \"O Messenger of Allah! If I am killed in the way of\nAllah, expectant for reward, sincere, advancing, and not retreating,\nwill Allah pardon my faults?\" The Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"Yes.\" When the man turned away, the\nMessenger of Allah, may Allah bless him and grant him peace, called\nhim - or commanded him and he was called to him. The Messenger of\nAllah, may Allah bless him and grant him peace, said to him, \"What did\nyou say?\" He repeated his words to him, and the Prophet, may Allah\nbless him and grant him peace, said to him, \"Yes, except for the debt.\nJibril said that to me.\""}},{"id":34,"idInBook":34,"chapterId":21,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي النَّضْرِ، مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ أَنَّهُ بَلَغَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ لِشُهَدَاءِ أُحُدٍ ‏\"‏ هَؤُلاَءِ أَشْهَدُ عَلَيْهِمْ ‏\"‏ ‏.‏ فَقَالَ أَبُو بَكْرٍ الصِّدِّيقُ أَلَسْنَا يَا رَسُولَ اللَّهِ بِإِخْوَانِهِمْ أَسْلَمْنَا كَمَا أَسْلَمُوا وَجَاهَدْنَا كَمَا جَاهَدُوا ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ بَلَى وَلَكِنْ لاَ أَدْرِي مَا تُحْدِثُونَ بَعْدِي ‏\"‏ ‏.‏ فَبَكَى أَبُو بَكْرٍ ثُمَّ بَكَى ثُمَّ قَالَ أَئِنَّا لَكَائِنُونَ بَعْدَكَ","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'n-Nadr, the mawla of Umar\nibn Ubaydullah that he had heard that the Messenger of Allah, may\nAllah bless him and grant him peace, said over the martyrs of Uhud, \"I\ntestify for them.\" Abu Bakr as-Siddiq said, \"Messenger of Allah! Are\nwe not their brothers? We entered Islam as they entered Islam and we\ndid jihad as they did jihad.\" The Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"Yes, but I do not know what you will\ndo after me.\" Abu Bakr wept profusely and said, \"Are we really going\nto out-live you!\""}},{"id":35,"idInBook":35,"chapterId":21,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم جَالِسًا وَقَبْرٌ يُحْفَرُ بِالْمَدِينَةِ فَاطَّلَعَ رَجُلٌ فِي الْقَبْرِ فَقَالَ بِئْسَ مَضْجَعُ الْمُؤْمِنِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ بِئْسَ مَا قُلْتَ ‏\"‏ ‏.‏ فَقَالَ الرَّجُلُ إِنِّي لَمْ أُرِدْ هَذَا يَا رَسُولَ اللَّهِ إِنَّمَا أَرَدْتُ الْقَتْلَ فِي سَبِيلِ اللَّهِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ مِثْلَ لِلْقَتْلِ فِي سَبِيلِ اللَّهِ مَا عَلَى الأَرْضِ بُقْعَةٌ هِيَ أَحَبُّ إِلَىَّ أَنْ يَكُونَ قَبْرِي بِهَا مِنْهَا ‏\"‏ ‏.‏ ثَلاَثَ مَرَّاتٍ يَعْنِي الْمَدِينَةَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Yahya ibn Said said, \"The\nMessenger of Allah, may Allah bless him and grant him peace, was\nsitting by a grave which was being dug at Madina. A man looked into\nthe grave and said, 'An awful bed for the mumin. 'The Messenger of\nAllah, may Allah blesshim and grant him peace, said, 'Evil? What you\nhave said is absolutely wrong.'\n\n\nThe man said, 'I didn't mean\nthat, Messenger of Allah. I meant being killed in the way of Allah.'\nThe Messenger of Allah, may Allah bless him and grant him peace, said,\n'Being killed in the way of Allah has no like! There is no place on\nthe earth which I would prefer my grave to be than here (meaning\nMadina). He repeated it three times.' \""}},{"id":36,"idInBook":36,"chapterId":21,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، كَانَ يَقُولُ اللَّهُمَّ إِنِّي أَسْأَلُكَ شَهَادَةً فِي سَبِيلِكَ وَوَفَاةً بِبَلَدِ رَسُولِكَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Zayd ibn Aslam that Umar ibn\nal-Khattab used to say, \"O Allah! I ask you for martyrdom in Your way\nand death in the city of Your Messenger!\""}},{"id":37,"idInBook":37,"chapterId":21,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ كَرَمُ الْمُؤْمِنِ تَقْوَاهُ وَدِينُهُ حَسَبُهُ وَمُرُوءَتُهُ خُلُقُهُ وَالْجُرْأَةُ وَالْجُبْنُ غَرَائِزُ يَضَعُهَا اللَّهُ حَيْثُ شَاءَ فَالْجَبَانُ يَفِرُّ عَنْ أَبِيهِ وَأُمِّهِ وَالْجَرِيءُ يُقَاتِلُ عَمَّا لاَ يَؤُوبُ بِهِ إِلَى رَحْلِهِ وَالْقَتْلُ حَتْفٌ مِنَ الْحُتُوفِ وَالشَّهِيدُ مَنِ احْتَسَبَ نَفْسَهُ عَلَى اللَّهِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said that Umar ibn\nal-Khattab said, \"The nobility of the mumin is his taqwa. His deen is\nhis noble descent. His manliness is his good character. Boldness and\ncowardice are but instincts which Allah places wherever He wills. The\ncoward shrinks from defending even his father and mother, and the bold\none fights for the sake of the combat not for the spoils. Being slain\nis but one way of meeting death, and the martyr is the one who gives\nhimself, expectant of reward from Allah.\""}},{"id":38,"idInBook":38,"chapterId":21,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، غُسِّلَ وَكُفِّنَ وَصُلِّيَ عَلَيْهِ وَكَانَ شَهِيدًا يَرْحَمُهُ اللَّهُ ‏.","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat Umar ibn al-Khattab was washed and shrouded and prayed over, yet\nhe was a martyr, may Allah have mercy on him ."}},{"id":39,"idInBook":39,"chapterId":21,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ أَنَّهُ بَلَغَهُ عَنْ أَهْلِ الْعِلْمِ أَنَّهُمْ كَانُوا يَقُولُونَ الشُّهَدَاءُ فِي سَبِيلِ اللَّهِ لاَ يُغَسَّلُونَ وَلاَ يُصَلَّى عَلَى أَحَدٍ مِنْهُمْ وَإِنَّهُمْ يُدْفَنُونَ فِي الثِّيَابِ الَّتِي قُتِلُوا فِيهَا ‏.‏ قَالَ مَالِكٌ وَتِلْكَ السُّنَّةُ فِيمَنْ قُتِلَ فِي الْمُعْتَرَكِ فَلَمْ يُدْرَكْ حَتَّى مَاتَ ‏.‏ قَالَ وَأَمَّا مَنْ حُمِلَ مِنْهُمْ فَعَاشَ مَا شَاءَ اللَّهُ بَعْدَ ذَلِكَ فَإِنَّهُ يُغَسَّلُ وَيُصَلَّى عَلَيْهِ كَمَا عُمِلَ بِعُمَرَ بْنِ الْخَطَّابِ ‏.","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard the people of\nknowledge say that martyrs in the way of Allah were not washed, nor\nwere any of them prayed over. They were buried in the garments in\nwhich they were slain.\n\n\nMalik said, \"That is the sunna for\nsomeone who is killed on the battleground and is not reached until he\nis already dead. Someone who is carried off and lives for as long as\nAllah wills after it, is washed and prayed over as was Umar ibn al-\nKhattab.\""}},{"id":40,"idInBook":40,"chapterId":21,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، كَانَ يَحْمِلُ فِي الْعَامِ الْوَاحِدِ عَلَى أَرْبَعِينَ أَلْفِ بَعِيرٍ يَحْمِلُ الرَّجُلَ إِلَى الشَّامِ عَلَى بَعِيرٍ وَيَحْمِلُ الرَّجُلَيْنِ إِلَى الْعِرَاقِ عَلَى بَعِيرٍ فَجَاءَهُ رَجُلٌ مِنْ أَهْلِ الْعِرَاقِ فَقَالَ احْمِلْنِي وَسُحَيْمًا ‏.‏ فَقَالَ لَهُ عُمَرُ بْنُ الْخَطَّابِ نَشَدْتُكَ اللَّهَ أَسُحَيْمٌ زِقٌّ قَالَ لَهُ نَعَمْ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said that Umar ibn\nal-Khattab in one year gave 40,000 camels as mounts. Sometimes he\nwould give one man a camel to himself. Sometimes he would give one\ncamel between two men to take them to Iraq. A man from Iraq came to\nhim and said, \"Give Suhaym and I a mount.''Umar ibn al-Khattab said to\nhim,\"l demand from you, by Allah!, is Suhaym a water skin?\" He said,\n\"Yes.\""}},{"id":41,"idInBook":41,"chapterId":21,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا ذَهَبَ إِلَى قُبَاءٍ يَدْخُلُ عَلَى أُمِّ حَرَامٍ بِنْتِ مِلْحَانَ فَتُطْعِمُهُ وَكَانَتْ أُمُّ حَرَامٍ تَحْتَ عُبَادَةَ بْنِ الصَّامِتِ فَدَخَلَ عَلَيْهَا رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمًا فَأَطْعَمَتْهُ وَجَلَسَتْ تَفْلِي فِي رَأْسِهِ فَنَامَ رَسُولُ اللَّهِ صلى الله عليه","english":{"narrator":"","text":"Yahya related to me from Malik from Ishaq ibn Abdullah ibn Abi\nTalha that Anas ibn Malik had said that when the Messenger of Allah,\nmay Allah bless him and grant him peace, went to Quba, he visited Umm\nHaram bint Milhan and she fed him. Umm Haram was the wife of Ubada ibn\nas-Samit. One day the Messenger of Allah, may Allah bless him and\ngrant him peace, had called on her and she had fed him, and sat down\nto delouse his hair. The Messenger of Allah, may Allah bless him and\ngrant him peace, had dozed and woke up smiling. Umm Haram said, \"What\nis making you smile, Messenger of Allah?\" He said, \"Some of my\ncommunity were presented to me, raiding in the way of Allah. They were\nriding in the middle of the sea, kings on thrones, or like kings on\nthrones.\" (Ishaq wasn't sure). She said, \"O Messenger of Allah! Ask\nAllah to put me among them!\" So he had made a dua for her, and put his\nhead down and slept. Then he had woken up smiling, and she said to\nhim, \"Messenger of Allah, why are you smiling?\" He said, \"Some of my\ncommunity were presented to me, raiding in the way of Allah. They were\nkings on thrones or like kings on thrones,\" as he had said in the\nfirst one. She said, \"O Messenger of Allah! Ask Allah to put me among\nthem!\" He said, \"You are among the first.\"\n\n\nIshaq added, \"She\ntravelled on the sea in the time of Muawiya, and when she landed, she\nwas thrown from her mount and killed.\""}},{"id":42,"idInBook":42,"chapterId":21,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ أَبِي صَالِحٍ السَّمَّانِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لَوْلاَ أَنْ أَشُقَّ عَلَى أُمَّتِي لأَحْبَبْتُ أَنْ لاَ أَتَخَلَّفَ عَنْ سَرِيَّةٍ تَخْرُجُ فِي سَبِيلِ اللَّهِ وَلَكِنِّي لاَ أَجِدُ مَا أَحْمِلُهُمْ عَلَيْهِ وَلاَ يَجِدُونَ مَا يَتَحَمَّلُونَ عَلَيْهِ فَيَخْرُجُونَ وَيَشُقُّ عَلَيْهِمْ أَنْ يَتَخَلَّفُوا بَعْدِي فَوَدِدْتُ أَنِّي أُقَاتِلُ فِي سَبِيلِ اللَّهِ فَأُقْتَلُ ثُمَّ أُحْيَا فَأُقْتَلُ ثُمَّ أُحْيَا فَأُقْتَلُ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said from Abu Salih\nas-Samman from Abu Hurayra that the Messenger of Allah, may Allah\nbless him and grant him peace, said, \"Had I not been concerned for my\ncommunity, I would have liked never to stay behind a raiding party\ngoing out in the way of Allah. However, I do not find the means to\ncarry them to it, nor do they find anything on which to ride out and\nit is grievous for them that they should stay behind me. I would like\nto fight in the way of Allah and be killed, then brought to life so I\ncould be killed and then brought to life so I could be killed.\""}},{"id":43,"idInBook":43,"chapterId":21,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، قَالَ لَمَّا كَانَ يَوْمُ أُحُدٍ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ يَأْتِينِي بِخَبَرِ سَعْدِ بْنِ الرَّبِيعِ الأَنْصَارِيِّ ‏\"‏ ‏.‏ فَقَالَ رَجُلٌ أَنَا يَا رَسُولَ اللَّهِ ‏.‏ فَذَهَبَ الرَّجُلُ يَطُوفُ بَيْنَ الْقَتْلَى فَقَالَ لَهُ سَعْدُ بْنُ الرَّبِيعِ مَا شَأْنُكَ فَقَالَ لَهُ الرَّجُلُ بَعَثَنِي إِلَيْكَ رَسُولُ اللَّهِ صلى الله عليه وسلم لآتِيَهُ بِخَبَرِكَ ‏.‏ قَالَ فَاذْهَبْ إِلَيْهِ فَأَقْرِئْهُ مِنِّي السَّلاَمَ وَأَخْبِرْهُ أَنِّي قَدْ طُعِنْتُ اثْنَتَىْ عَشْرَةَ طَعْنَةً وَأَنِّي قَدْ أُنْفِذَتْ مَقَاتِلِي وَأَخْبِرْ قَوْمَكَ أَنَّهُ لاَ عُذْرَ لَهُمْ عِنْدَ اللَّهِ إِنْ قُتِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَوَاحِدٌ مِنْهُمْ حَىٌّ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Yahya ibn Said said, \"On the\nDay of Uhud, The Messenger of Allah, may Allah bless him and grant him\npeace, said, 'Who will bring me news of Sad ibn al-Rabi al-Ansari?' a\nman said, 'Me, Messenger of Allah!' So the man went around among the\nslain, and Sad ibn al-Rabi said to him, 'What are you doing?' The man\nsaid to him, 'The Messenger of Allah, may Allah bless him and grant\nhim peace, sent me to bring him news of you.' He said, 'Go to him, and\ngive him my greetings, and tell him that I have been stabbed twelve\ntimes, and am mortally wounded. Tell your people that they will have\nno excuse with Allah if the Messenger of Allah, may Allah bless him\nand grant him peace, is slain while one of them is still alive.' \""}},{"id":44,"idInBook":44,"chapterId":21,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَغَّبَ فِي الْجِهَادِ وَذَكَرَ الْجَنَّةَ وَرَجُلٌ مِنَ الأَنْصَارِ يَأْكُلُ تَمَرَاتٍ فِي يَدِهِ فَقَالَ إِنِّي لَحَرِيصُ عَلَى الدُّنْيَا إِنْ جَلَسْتُ حَتَّى أَفْرُغَ مِنْهُنَّ ‏.‏ فَرَمَى مَا فِي يَدِهِ فَحَمَلَ بِسَيْفِهِ فَقَاتَلَ حَتَّى قُتِلَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said that the\nMessenger of Allah, may Allah bless him and grant him peace,\nstimulated people for jihad and mentioned the Garden. One of the Ansar\nwas eating some dates in his hand, and said, \"Am I so desirous of this\nworld that I should sit until I finish them?\" He threw aside what was\nin his hand and took his sword, and fought until he was slain ."}},{"id":45,"idInBook":45,"chapterId":21,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ مُعَاذِ بْنِ جَبَلٍ، أَنَّهُ قَالَ الْغَزْوُ غَزْوَانِ فَغَزْوٌ تُنْفَقُ فِيهِ الْكَرِيمَةُ وَيُيَاسَرُ فِيهِ الشَّرِيكُ وَيُطَاعُ فِيهِ ذُو الأَمْرِ وَيُجْتَنَبُ فِيهِ الْفَسَادُ فَذَلِكَ الْغَزْوُ خَيْرٌ كُلُّهُ وَغَزْوٌ لاَ تُنْفَقُ فِيهِ الْكَرِيمَةُ وَلاَ يُيَاسَرُ فِيهِ الشَّرِيكُ وَلاَ يُطَاعُ فِيهِ ذُو الأَمْرِ وَلاَ يُجْتَنَبُ فِيهِ الْفَسَادُ فَذَلِكَ الْغَزْوُ لاَ يَرْجِعُ صَاحِبُهُ كَفَافًا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said that Muadh ibn\nJabal said, \"There are two military expeditions. There is one military\nexpedition in which valuables are spent, the contributor is willing,\nthe authorities are obeyed, and corruption is avoided. That military\nexpedition is all good. There is a military expedition in which\nvaluables are not spent, the contributor is not willing, the\nauthorities are not obeyed, and corruption is not avoided. The one who\nfights in that military expedition does not return with reward.\""}},{"id":46,"idInBook":46,"chapterId":21,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْخَيْلُ فِي نَوَاصِيهَا الْخَيْرُ إِلَى يَوْمِ الْقِيَامَةِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat the Messenger of Allah, may Allah bless him and grant him peace,\nsaid, \"Blessing is in the forelocks of horses until the Day of\nRising.\""}},{"id":47,"idInBook":47,"chapterId":21,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم سَابَقَ بَيْنَ الْخَيْلِ الَّتِي قَدْ أُضْمِرَتْ مِنَ الْحَفْيَاءِ وَكَانَ أَمَدُهَا ثَنِيَّةَ الْوَدَاعِ وَسَابَقَ بَيْنَ الْخَيْلِ الَّتِي لَمْ تُضَمَّرْ مِنَ الثَّنِيَّةِ إِلَى مَسْجِدِ بَنِي زُرَيْقٍ وَأَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ كَانَ مِمَّنْ سَابَقَ بِهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat the Messenger of Allah, may Allah bless him and grant him peace,\nheld a race between horses which had been made lean by training, from\nal-Hafya to Thaniyatu-lWada. He held a race between horses which had\nnot been made lean from the Thaniya (a mountain pass near Madina) to\nthe mosque of the Banu Zurayq. Abdullah ibn Umar was among those who\nraced them ."}},{"id":48,"idInBook":48,"chapterId":21,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ سَمِعَ سَعِيدَ بْنَ الْمُسَيَّبِ، يَقُولُ لَيْسَ بِرِهَانِ الْخَيْلِ بَأْسٌ إِذَا دَخَلَ فِيهَا مُحَلِّلٌ فَإِنْ سَبَقَ أَخَذَ السَّبَقَ وَإِنْ سُبِقَ لَمْ يَكُنْ عَلَيْهِ شَىْءٌ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Yahya ibn Said heard Said ibn\nal-Musayyab say, \"There is  no harm in placing stakes on horses if a\nthird horse enters it. The winner takes the stake, and there is no\nfine against the loser.\""}},{"id":49,"idInBook":49,"chapterId":21,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رُئِيَ وَهُوَ يَمْسَحُ وَجْهَ فَرَسِهِ بِرِدَائِهِ فَسُئِلَ عَنْ ذَلِكَ فَقَالَ ‏\n\"‏ إِنِّي عُوتِبْتُ اللَّيْلَةَ فِي الْخَيْلِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said that the\nMessenger of Allah, may Allah bless him and grant him peace, was seen\nwiping the face of his horse with his cloak. He was questioned about\nit and said, \"I was reproached in the night about horses.\" i.e. not\ntaking care of them."}},{"id":50,"idInBook":50,"chapterId":21,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ حُمَيْدٍ الطَّوِيلِ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم حِينَ خَرَجَ إِلَى خَيْبَرَ أَتَاهَا لَيْلاً وَكَانَ إِذَا أَتَى قَوْمًا بِلَيْلٍ لَمْ يُغِرْ حَتَّى يُصْبِحَ فَخَرَجَتْ يَهُودُ بِمَسَاحِيهِمْ وَمَكَاتِلِهِمْ فَلَمَّا رَأَوْهُ قَالُوا مُحَمَّدٌ وَاللَّهِ مُحَمَّدٌ وَالْخَمِيسُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ اللَّهُ أَكْبَرُ خَرِبَتْ خَيْبَرُ إِنَّا إِذَا نَزَلْنَا بِسَاحَةِ قَوْمٍ فَسَاءَ صَبَاحُ الْمُنْذَرِينَ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Humayd at-Tawil from Anas ibn\nMalik that when the Messenger of Allah, may Allah bless him and grant\nhim peace, went out to Khaybar, he arrived there at night, and when he\ncame upon a people by night, he did not attack until morning. In the\nmorning, the jews came out with their spades and baskets. When they\nsaw him, they said, \"Muhammad! By Allah, Muhammad and his army!\" The\nMessenger of Allah, may Allah bless him and grant him peace, said\n\"Allah is greater! Khaybar is destroyed. When we come to a people, it\nis an evil morning for those who have been warned . \""}},{"id":51,"idInBook":51,"chapterId":21,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ أَنْفَقَ زَوْجَيْنِ فِي سَبِيلِ اللَّهِ نُودِيَ فِي الْجَنَّةِ يَا عَبْدَ اللَّهِ هَذَا خَيْرٌ فَمَنْ كَانَ مِنْ أَهْلِ الصَّلاَةِ دُعِيَ مِنْ بَابِ الصَّلاَةِ وَمَنْ كَانَ مِنْ أَهْلِ الْجِهَادِ دُعِيَ مِنْ بَابِ الْجِهَادِ وَمَنْ كَانَ مِنْ أَهْلِ الصَّدَقَةِ دُعِيَ مِنْ بَابِ الصَّدَقَةِ وَمَنْ كَانَ مِنْ أَهْلِ الصِّيَامِ دُعِيَ مِنْ بَابِ الرَّيَّانِ ‏\"‏ ‏.‏ فَقَالَ أَبُو بَكْرٍ الصِّدِّيقُ يَا رَسُولَ اللَّهِ مَا عَلَى مَنْ يُدْعَى مِنْ هَذِهِ الأَبْوَابِ مِنْ ضَرُورَةٍ فَهَلْ يُدْعَى أَحَدٌ مِنْ هَذِهِ الأَبْوَابِ كُلِّهَا قَالَ ‏\"‏ نَعَمْ وَأَرْجُو أَنْ تَكُونَ مِنْهُمْ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Humayd ibn\nAbd ar-Rahman ibn Awf from Abu Hurayra that the Messenger of Allah,\nmay Allah bless him and grant him peace, said, \"Whoever hands over two\nof any type of property in the way of Allah is called to the Garden,\nwith the words 'O slave of Allah! This is good!' Whoever is among the\npeople of prayer, is called from the gate of prayer. Whoever is among\nthe people of jihad is called from the gate of jihad. Whoever is among\nthe people of sadaqa, is called from the gate of sadaqa. Whoever is\namong the people of fasting, is called from the gate of the well-\nwatered. (Bab ar-Rayyan).\"\n\n\nAbu Bakr as-Siddiq said,\n\"Messenger of Allah! Is it absolutely necessary that one be called\nfrom one of these gates? Can someone be called from all of these\ngates?\" He said, \"Yes, and I hope you are among them .\"\n\n\n21.20\nAcquisition of the Land of Those who Surrender from the People of\nDhimma"}},{"id":52,"idInBook":52,"chapterId":21,"bookId":7,"arabic":"","english":{"narrator":"","text":"Malik was asked whether, when an imam had accepted jizya from a\npeople and they gave it, he thought that the land of one of them who\nsurrendered belonged to him or whether his land and property belonged\nto the Muslims. Malik said, \"That varies. As for the people of peace,\nif one of them surrenders, then he is entitled to his land and\nproperty. As for the people of force who use force, if one of them\nsurrenders, his land and property belong to the Muslims because the\npeople of force are overcome in their towns, and it becomes booty for\nthe Muslims. As for the people of peace, their property and selves are\nprotected so that they make peace for them. Only what they have made\npeace for is obliged of them.\""}},{"id":53,"idInBook":53,"chapterId":21,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي صَعْصَعَةَ، أَنَّهُ بَلَغَهُ أَنَّ عَمْرَو بْنَ الْجَمُوحِ، وَعَبْدَ اللَّهِ بْنَ عَمْرٍو الأَنْصَارِيَّيْنِ، ثُمَّ السَّلَمِيَّيْنِ كَانَا قَدْ حَفَرَ السَّيْلُ قَبْرَهُمَا وَكَانَ قَبْرُهُمَا مِمَّا يَلِي السَّيْلَ وَكَانَا فِي قَبْرٍ وَاحِدٍ وَهُمَا مِمَّنِ اسْتُشْهِدَ يَوْمَ أُحُدٍ فَحُفِرَ عَنْهُمَا لِيُغَيَّرَا مِنْ مَكَانِهِمَا فَوُجِدَا لَمْ يَتَغَيَّرَا كَأَنَّهُمَا مَاتَا بِالأَمْسِ وَكَانَ أَحَدُهُمَا قَدْ جُرِحَ فَوَضَعَ يَدَهُ عَلَى جُرْحِهِ فَدُفِنَ وَهُوَ كَذَلِكَ فَأُمِيطَتْ يَدُهُ عَنْ جُرْحِهِ ثُمَّ أُرْسِلَتْ فَرَجَعَتْ كَمَا كَانَتْ وَكَانَ بَيْنَ أُحُدٍ وَبَيْنَ يَوْمَ حُفِرَ عَنْهُمَا سِتٌّ وَأَرْبَعُونَ سَنَةً ‏.‏ قَالَ مَالِكٌ لاَ بَأْسَ أَنْ يُدْفَنَ الرَّجُلاَنِ وَالثَّلاَثَةُ فِي قَبْرٍ وَاحِدٍ مِنْ ضَرُورَةٍ وَيُجْعَلَ الأَكْبَرُ مِمَّا يَلِي الْقِبْلَةَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abd ar-Rahman ibn Abi Sasaca\nthat he had heard that Amr ibn al-Jamuh al-Ansari and Abdullah ibn\nUmar al-Ansari, both of the tribe of Banu Salami, had their grave\nuncovered by a flood. Their grave was part of what was left after the\nflood. They were in the same grave, and they were among those martyred\nat Uhud. They were dug up so that they might be moved. They were found\nunchanged. It was as if they had died only the day before. One of them\nhad been wounded, and he had put his hand over his wound and had been\nburied like that. His hand was pulled away from his wound and\nreleased, and it returned to where it had been. It was forty-six years\nbetween Uhud and the day they were dug up.\n\n\nMalik said, \"There\nis no harm in burying two or three men in the same grave due to\nnecessity. The oldest one is put next to the qibla.\""}},{"id":54,"idInBook":54,"chapterId":21,"bookId":7,"arabic":"حَدَّثَنِي عَنْ مَالِكٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، أَنَّهُ قَالَ قَدِمَ عَلَى أَبِي بَكْرٍ الصِّدِّيقِ مَالٌ مِنَ الْبَحْرَيْنِ فَقَالَ مَنْ كَانَ لَهُ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأْىٌ أَوْ عِدَةٌ فَلْيَأْتِنِي فَجَاءَهُ جَابِرُ بْنُ عَبْدِ اللَّهِ فَحَفَنَ لَهُ ثَلاَثَ حَفَنَاتٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Rabia ibn Abi Abd ar-Rahman\nsaid, \"Property was sent to Abu Bakr as-Siddiq from Bahrayn. He said,\n'If someone had a promise or a pledge with the Messenger of Allah, may\nAllah bless him and grant him peace, let him come to me.' So Jabir ibn\nAbdullah came to him, and he gave him three times as much of it as\nwould fill both hands.''"}}],"chapter":{"id":21,"bookId":7,"arabic":"كتاب الجهاد","english":"Jihad"}}