{"metadata":{"length":10,"arabic":{"title":"موطأ مالك","author":"الإمام مالك بن أنس","introduction":"كتاب الذبائح"},"english":{"title":"Muwatta Malik","author":"Imam Malik ibn Anas","introduction":"Slaughtering Animals"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":24,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّهُ قَالَ سُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقِيلَ لَهُ يَا رَسُولَ اللَّهِ إِنَّ نَاسًا مِنْ أَهْلِ الْبَادِيَةِ يَأْتُونَنَا بِلُحْمَانٍ وَلاَ نَدْرِي هَلْ سَمَّوُا اللَّهَ عَلَيْهَا أَمْ لاَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ سَمُّوا اللَّهَ عَلَيْهَا ثُمَّ كُلُوهَا ‏\"‏ ‏.‏ قَالَ مَالِكٌ وَذَلِكَ فِي أَوَّلِ الإِسْلاَمِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa that his\nfather said, \"The Messenger of Allah, may Allah bless him and grant\nhim peace, was asked, 'Messenger of Allah! Some people from the desert\nbring us meat, and we do not know whether the name of Allah has been\nmentioned over it or not.' The Messenger of Allah, may Allah bless him\nand grant him peace, said, 'Mention the name of Allah over it and\neat.' \"\n\n\nMalik said, \"That was in the beginning of Islam.\""}},{"id":2,"idInBook":2,"chapterId":24,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عَيَّاشِ بْنِ أَبِي رَبِيعَةَ الْمَخْزُومِيَّ، أَمَرَ غُلاَمًا لَهُ أَنْ يَذْبَحَ ذَبِيحَةً فَلَمَّا أَرَادَ أَنْ يَذْبَحَهَا قَالَ لَهُ سَمِّ اللَّهَ ‏.‏ فَقَالَ لَهُ الْغُلاَمُ قَدْ سَمَّيْتُ ‏.‏ فَقَالَ لَهُ سَمِّ اللَّهَ وَيْحَكَ ‏.‏ قَالَ لَهُ قَدْ سَمَّيْتُ اللَّهَ ‏.‏ فَقَالَ لَهُ عَبْدُ اللَّهِ بْنُ عَيَّاشٍ وَاللَّهِ لاَ أَطْعَمُهَا أَبَدًا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said that Abdullah\nibn Ayyash ibn Abi Rabia al-Makhzumi ordered one of his slaves to\nslaughter an animal. When he wanted to slaughter it, he said to him,\n\"Mention Allah's name.\" The slave said to him, \"I have mentioned the\nname!\" He said to him, \"Mention the name of Allah, bother you!\" He\nsaid to him, \"I have mentioned the name of Allah \" Abdullah ibn Ayyash\nsaid, \"By Allah, I shall never eat it!\""}},{"id":3,"idInBook":3,"chapterId":24,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، أَنَّ رَجُلاً، مِنَ الأَنْصَارِ مِنْ بَنِي حَارِثَةَ كَانَ يَرْعَى لِقْحَةً لَهُ بِأُحُدٍ فَأَصَابَهَا الْمَوْتُ فَذَكَّاهَا بِشِظَاظٍ فَسُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ ذَلِكَ فَقَالَ ‏\n\"‏ لَيْسَ بِهَا بَأْسٌ فَكُلُوهَا ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Zayd ibn Aslam from Ata ibn\nYasar that a man from the Ansar of the tribe of Banu Haritha was\nherding a pregnant she-camel at Uhud. It was about to die, so he\nslaughtered it with a sharp stake. The Messenger of Allah was asked\nabout that, and he said, \"There is no harm in it, eat it.\""}},{"id":4,"idInBook":4,"chapterId":24,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ رَجُلٍ، مِنَ الأَنْصَارِ عَنْ مُعَاذِ بْنِ سَعْدٍ، أَوْ سَعْدِ بْنِ مُعَاذٍ أَنَّ جَارِيَةً، لِكَعْبِ بْنِ مَالِكٍ كَانَتْ تَرْعَى غَنَمًا لَهَا بِسَلْعٍ فَأُصِيبَتْ شَاةٌ مِنْهَا فَأَدْرَكَتْهَا فَذَكَّتْهَا بِحَجَرٍ فَسُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ ذَلِكَ فَقَالَ ‏\n\"‏ لاَ بَأْسَ بِهَا فَكُلُوهَا ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi from a man of the Ansar\nfrom Muadh ibn Sad or Sad ibn Muadh that a slave-girl of Kab ibn Malik\nwas herding some sheep at Sal (a mountain near Madina). One of the\nsheep was about to die, so she went over to it and slaughtered it with\na stone. The Messenger of Allah, may Allah bless him and grant him\npeace, was asked about that, and he said, \"There is no harm in it, so\neat it.\""}},{"id":5,"idInBook":5,"chapterId":24,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ ثَوْرِ بْنِ زَيْدٍ الدِّيلِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، أَنَّهُ سُئِلَ عَنْ ذَبَائِحِ، نَصَارَى الْعَرَبِ فَقَالَ لاَ بَأْسَ بِهَا وَتَلاَ هَذِهِ الآيَةَ ‏{‏وَمَنْ يَتَوَلَّهُمْ مِنْكُمْ فَإِنَّهُ مِنْهُمْ ‏}‏‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Thawr ibn Zayd ad-Dili that\nAbdullah ibn Abbas was asked about animals slaughtered by the\n\n\nChristian Arabs. He said, \"There is no harm in them,\" but he recited\nthis ayat, \"Whoever takes them as friends is from them.\" (Sura 5 ayat\n54)."}},{"id":6,"idInBook":6,"chapterId":24,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، كَانَ يَقُولُ مَا فَرَى الأَوْدَاجَ فَكُلُوهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Abdullah ibn Abbas used to\nsay, \"You can eat anything that has had its jugular vein cut.\""}},{"id":7,"idInBook":7,"chapterId":24,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ كَانَ يَقُولُ مَا ذُبِحَ بِهِ إِذَا بَضَعَ فَلاَ بَأْسَ بِهِ إِذَا اضْطُرِرْتَ إِلَيْهِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said that Said ibn\nal-Musayyab said, \"There is no harm in whatever you slaughter with a\ncutting edge, as long as you are forced to do it by necessity.\""}},{"id":8,"idInBook":8,"chapterId":24,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ أَبِي مُرَّةَ، مَوْلَى عَقِيلِ بْنِ أَبِي طَالِبٍ أَنَّهُ سَأَلَ أَبَا هُرَيْرَةَ عَنْ شَاةٍ، ذُبِحَتْ فَتَحَرَّكَ بَعْضُهَا فَأَمَرَهُ أَنْ يَأْكُلَهَا ثُمَّ سَأَلَ عَنْ ذَلِكَ زَيْدَ بْنَ ثَابِتٍ فَقَالَ إِنَّ الْمَيْتَةَ لَتَتَحَرَّكُ وَنَهَاهُ عَنْ ذَلِكَ ‏.‏ وَسُئِلَ مَالِكٌ عَنْ شَاةٍ  تَرَدَّتْ فَتَكَسَّرَتْ فَأَدْرَكَهَا صَاحِبُهَا فَذَبَحَهَا فَسَالَ الدَّمُ مِنْهَا وَلَمْ تَتَحَرَّكْ فَقَالَ مَالِكٌ إِذَا كَانَ ذَبَحَهَا وَنَفَسُهَا يَجْرِي وَهِيَ تَطْرِفُ فَلْيَأْكُلْهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said that Abu\nMurra, the mawla of Aqil ibn Abi Talib asked Abu Hurayra about a sheep\nwhich was slaughtered and then part of it moved. He ordered him to eat\nit. Then he asked Zayd ibn Thabit about it, and he said, \"Does a\ncorpse move?\" and he forbade eating its meat.\n\n\nMalik was asked\nabout a sheep which fell down and injured itself badly and then its\nmaster reached it and slaughtered it. Blood flowed from it but it did\nnot move. Malik said, \"If he kills it and blood flows from it and its\neyes blink, he should eat it.\""}},{"id":9,"idInBook":9,"chapterId":24,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ كَانَ يَقُولُ إِذَا نُحِرَتِ النَّاقَةُ فَذَكَاةُ مَا فِي بَطْنِهَا فِي ذَكَاتِهَا إِذَا كَانَ قَدْ تَمَّ خَلْقُهُ وَنَبَتَ شَعَرُهُ فَإِذَا خَرَجَ مِنْ بَطْنِ أُمِّهِ ذُبِحَ حَتَّى يَخْرُجَ الدَّمُ مِنْ جَوْفِهِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nsaid, \"When a she-camel is slaughtered, what is in its womb is\nincluded in the slaughter if it is perfectly formed and its hair has\nbegun to grow. If it comes out of its mother's womb, it is slaughtered\nso that blood flows from its heart.\""}},{"id":10,"idInBook":10,"chapterId":24,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ قُسَيْطٍ اللَّيْثِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ كَانَ يَقُولُ ذَكَاةُ مَا فِي بَطْنِ الذَّبِيحَةِ فِي ذَكَاةِ أُمِّهِ إِذَا كَانَ قَدْ تَمَّ خَلْقُهُ وَنَبَتَ شَعَرُهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yazid ibn Abdullah ibn Qusayt\nal-Laythi that Said ibn al- Musayyab said, \"The slaughter of what is\nin the womb is included in the slaughter of the mother if it is\nperfectly formed and its hair has begun to grow.\""}}],"chapter":{"id":24,"bookId":7,"arabic":"كتاب الذبائح","english":"Slaughtering Animals"}}