{"metadata":{"length":19,"arabic":{"title":"موطأ مالك","author":"الإمام مالك بن أنس","introduction":"كتاب الصيد"},"english":{"title":"Muwatta Malik","author":"Imam Malik ibn Anas","introduction":"Game"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":25,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّهُ قَالَ رَمَيْتُ طَائِرَيْنِ بِحَجَرٍ وَأَنَا بِالْجُرْفِ، فَأَصَبْتُهُمَا فَأَمَّا أَحَدُهُمَا فَمَاتَ فَطَرَحَهُ عَبْدُ اللَّهِ بْنُ عُمَرَ وَأَمَّا الآخَرُ فَذَهَبَ عَبْدُ اللَّهِ بْنُ عُمَرَ يُذَكِّيهِ بِقَدُومٍ فَمَاتَ قَبْلَ أَنْ يُذَكِّيَهُ فَطَرَحَهُ عَبْدُ اللَّهِ أَيْضًا ‏.‏","english":{"narrator":"","text":"ahya related to me from Malik that Nafi said, \"I was at al-Juruf\n(near Madina) and threw a stone at two birds, and hit them. One of\nthem died, and Abdullah ibn Umar threw it away, and then went to\nslaughter the other one with an adze. It died before he could\nslaughter it, so Abdullah threw that one away as well.\""}},{"id":2,"idInBook":2,"chapterId":25,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ الْقَاسِمَ بْنَ مُحَمَّدٍ، كَانَ يَكْرَهُ مَا قَتَلَ الْمِعْرَاضُ وَالْبُنْدُقَةُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that al-Qasim\nibn Muhammad disapproved of eating game that had been killed with\nthrowing sticks and by clay pellets."}},{"id":3,"idInBook":3,"chapterId":25,"bookId":7,"arabic":"سَعِيدَ بْنَ الْمُسَيَّبِ، كَانَ يَكْرَهُ أَنْ تُقْتَلَ الإِنْسِيَّةُ، بِمَا يُقْتَلُ بِهِ الصَّيْدُ مِنَ الرَّمْىِ وَأَشْبَاهِهِ ‏.‏ قَالَ مَالِكٌ وَلاَ أَرَى بَأْسًا بِمَا أَصَابَ الْمِعْرَاضُ إِذَا خَسَقَ وَبَلَغَ الْمَقَاتِلَ أَنْ يُؤْكَلَ قَالَ اللَّهُ تَبَارَكَ وَتَعَالَى ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا لَيَبْلُوَنَّكُمُ اللَّهُ بِشَىْءٍ مِنَ الصَّيْدِ تَنَالُهُ أَيْدِيكُمْ وَرِمَاحُكُمْ ‏}‏ قَالَ فَكُلُّ شَىْءٍ نَالَهُ الإِنْسَانُ بِيَدِهِ أَوْ رُمْحِهِ أَوْ بِشَىْءٍ مِنْ سِلاَحِهِ فَأَنْفَذَهُ وَبَلَغَ مَقَاتِلَهُ فَهُوَ صَيْدٌ كَمَا قَالَ اللَّهُ تَعَالَى","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Said ibn\nal-Musayyab disapproved of killing domestic animals that had become\nwild by any means that game was slain such as arrows and the like.\n\n\nMalik said, \"I do not see any harm in eating game which is\npierced by a throwing stick in a vital organ.\n\n\nAllah, the\nBlessed, the Exalted! said, 'Oh you who believe! Allah will surely try\nyou with something of the game that your hands and spears attain.' \"\n(Sura 5 ayat 97).\n\n\nYahya said, \"Any game that man obtains by\nhis hand or by his spear or by any weapon which pierces it and reaches\na vital organ, is acceptable as Allah, the Exalted, has said.\""}},{"id":4,"idInBook":4,"chapterId":25,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ أَنَّهُ سَمِعَ أَهْلَ الْعِلْمِ يَقُولُونَ إِذَا أَصَابَ الرَّجُلُ الصَّيْدَ فَأَعَانَهُ عَلَيْهِ غَيْرُهُ مِنْ مَاءٍ أَوْ كَلْبٍ غَيْرِ مُعَلَّمٍ لَمْ يُؤْكَلْ ذَلِكَ الصَّيْدُ إِلاَّ أَنْ يَكُونَ سَهْمُ الرَّامِي قَدْ قَتَلَهُ أَوْ بَلَغَ مَقَاتِلَ الصَّيْدِ حَتَّى لاَ يَشُكَّ أَحَدٌ فِي أَنَّهُ هُوَ قَتَلَهُ وَأَنَّهُ لاَ يَكُونُ لِلصَّيْدِ حَيَاةٌ بَعْدَهُ ‏.‏ قَالَ وَسَمِعْتُ مَالِكًا يَقُولُ لاَ بَأْسَ بِأَكْلِ الصَّيْدِ - وَإِنْ غَابَ عَنْكَ مَصْرَعُهُ - إِذَا وَجَدْتَ بِهِ أَثَرًا مِنْ كَلْبِكَ أَوْ كَانَ بِهِ سَهْمُكَ مَا لَمْ يَبِتْ فَإِذَا بَاتَ فَإِنَّهُ يُكْرَهُ أَكْلُهُ ‏.","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard the people of\nknowledge say that when a man hit game and something else might have\ncontributed to death, like water or an untrained dog, that game was\nnot to be eaten unless it was beyond doubt that it was the arrow of\nthe hunter that had killed it by reaching a vital organ, so that it\ndid not have any life after that.\n\n\nYahya said that he heard Malik say that there was no harm in\neating game when you did not see it die if you found the mark of your\ndog on it or your arrow in it as long as it had not remained\novernight. If it had remained overnight, then it was disapproved of to\neat it."}},{"id":5,"idInBook":5,"chapterId":25,"bookId":7,"arabic":"وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ كَانَ يَقُولُ فِي الْكَلْبِ الْمُعَلَّمِ كُلْ مَا أَمْسَكَ عَلَيْكَ إِنْ قَتَلَ وَإِنْ لَمْ يَقْتُلْ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nsaid about a trained dog, \"Eat whatever it catches for you whether it\neats from it or not.\""}},{"id":6,"idInBook":6,"chapterId":25,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَمَّنْ سَمِعَ نَافِعًا، يَقُولُ قَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ وَإِنْ أَكَلَ وَإِنْ لَمْ يَأْكُلْ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he heard Nafi say that\nAbdullah ibn Umar said, \"Whether it eats from it or not.\""}},{"id":7,"idInBook":7,"chapterId":25,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ، أَنَّهُ سُئِلَ عَنِ الْكَلْبِ الْمُعَلَّمِ، إِذَا قَتَلَ الصَّيْدَ فَقَالَ سَعْدٌ كُلْ وَإِنْ لَمْ تَبْقَ إِلاَّ بِضْعَةٌ وَاحِدَةٌ ‏.‏ وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ، أَنَّهُ سُئِلَ عَنِ الْكَلْبِ الْمُعَلَّمِ، إِذَا قَتَلَ الصَّيْدَ فَقَالَ سَعْدٌ كُلْ وَإِنْ لَمْ تَبْقَ إِلاَّ بِضْعَةٌ وَاحِدَةٌ ‏.","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Sad ibn Abi\nWaqqas had said, when asked about a trained dog killing game, \"Eat,\neven if only one piece of it remains.\""}},{"id":8,"idInBook":8,"chapterId":25,"bookId":7,"arabic":".‏ وَحَدَّثَنِي عَنْ مَالِكٍ أَنَّهُ سَمِعَ بَعْضَ أَهْلِ الْعِلْمِ يَقُولُونَ فِي الْبَازِي وَالْعُقَابِ وَالصَّقْرِ وَمَا أَشْبَهَ ذَلِكَ أَنَّهُ إِذَا كَانَ يَفْقَهُ كَمَا تَفْقَهُ الْكِلاَبُ الْمُعَلَّمَةُ فَلاَ بَأْسَ بِأَكْلِ مَا قَتَلَتْ مِمَّا صَادَتْ إِذَا ذُكِرَ اسْمُ اللَّهِ عَلَى إِرْسَالِهَا ‏.‏ قَالَ مَالِكٌ وَأَحْسَنُ مَا سَمِعْتُ فِي الَّذِي يَتَخَلَّصُ الصَّيْدَ مِنْ مَخَالِبِ الْبَازِي أَوْ مِنَ الْكَلْبِ ثُمَّ يَتَرَبَّصُ بِهِ فَيَمُوتُ أَنَّهُ لاَ يَحِلُّ أَكْلُهُ ‏.‏ قَالَ مَالِكٌ وَكَذَلِكَ كُلُّ مَا قُدِرَ عَلَى ذَبْحِهِ وَهُوَ فِي مَخَالِبِ الْبَازِي أَوْ فِي الْكَلْبِ فَيَتْرُكُهُ صَاحِبُهُ وَهُوَ قَادِرٌ عَلَى ذَبْحِهِ حَتَّى يَقْتُلَهُ الْبَازِي أَوِ الْكَلْبُ فَإِنَّهُ لاَ يَحِلُّ أَكْلُهُ ‏.‏ قَالَ مَالِكٌ وَكَذَلِكَ الَّذِي يَرْمِي الصَّيْدَ فَيَنَالُهُ وَهُوَ حَىٌّ فَيُفَرِّطُ فِي ذَبْحِهِ حَتَّى يَمُوتَ فَإِنَّهُ لاَ يَحِلُّ أَكْلُهُ ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا أَنَّ الْمُسْلِمَ إِذَا أَرْسَلَ كَلْبَ الْمَجُوسِيِّ الضَّارِيَ فَصَادَ أَوْ قَتَلَ إِنَّهُ إِذَا كَانَ مُعَلَّمًا فَأَكْلُ ذَلِكَ الصَّيْدِ حَلاَلٌ لاَ بَأْسَ بِهِ وَإِنْ لَمْ يُذَكِّهِ الْمُسْلِمُ وَإِنَّمَا مَثَلُ ذَلِكَ مَثَلُ الْمُسْلِمِ يَذْبَحُ بِشَفْرَةِ الْمَجُوسِيِّ أَوْ يَرْمِي بِقَوْسِهِ أَوْ بِنَبْلِهِ فَيَقْتُلُ بِهَا فَصَيْدُهُ ذَلِكَ وَذَبِيحَتُهُ حَلاَلٌ لاَ بَأْسَ بِأَكْلِهِ وَإِذَا أَرْسَلَ الْمَجُوسِيُّ كَلْبَ الْمُسْلِمِ الضَّارِيَ عَلَى صَيْدٍ فَأَخَذَهُ فَإِنَّهُ لاَ يُؤْكَلُ ذَلِكَ الصَّيْدُ إِلاَّ أَنْ يُذَكَّى  وَإِنَّمَا مَثَلُ ذَلِكَ مَثَلُ قَوْسِ الْمُسْلِمِ وَنَبْلِهِ يَأْخُذُهَا الْمَجُوسِيُّ فَيَرْمِي بِهَا الصَّيْدَ فَيَقْتُلُهُ وَبِمَنْزِلَةِ شَفْرَةِ الْمُسْلِمِ يَذْبَحُ بِهَا الْمَجُوسِيُّ فَلاَ يَحِلُّ أَكْلُ شَىْءٍ مِنْ ذَلِكَ ‏.","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard some of the\npeople of knowledge say that when falcons, eagles, and hawks and their\nlike, understood as trained dogs understood, there was no harm in\neating what they had killed in the course of hunting, if the name of\nAllah had been mentioned when they were sent out.\n\n\nMalik said,\n\"The best of what I have heard about retrieving game from the falcon's\ntalons or from the dog's fangs and then waiting until it dies, is that\nit is not halal to eat it.\"\n\n\nMalik said, \"The same applies to\nanything which could have been slaughtered by the hunter when it was\nin the talons of the falcon or the fangs of the dog. If the hunter\nleaves it until the falcon or dog has killed it, it is not halal to\neat it either\". He continued, \"The same thing applies to any game hit\nby a hunter and caught while still alive, which he neglects to\nslaughter before it dies.\"\n\n\nMalik said, \"It is generally\nagreed among us that it is halal to eat the game that a hunting-dog\nbelonging to magians hunts or kills, if it is sent out by a muslim and\nthe animal is trained. There is no harm in it even if the muslim does\nnot actually slaughter it.\n\n\nIt is the same as a muslim using a\nmagian's knife to slaughter with or using his bow and arrows to shoot\nand kill with. The game he shot and the animal he slaughters are\nhalal. There is no harm in eating them. If a magian sends out a\nmuslim's hunting dog for game, and it catches it, the game is not to\nbe eaten unless it is slaughtered by a muslim. That is like a magian\nusing a muslim's bow and arrow to hunt game with, or like his using a\nmuslim's knife to slaughter with. It is not halal to eat anything\nkilled like that."}},{"id":9,"idInBook":9,"chapterId":25,"bookId":7,"arabic":"وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ أَبِي هُرَيْرَةَ، سَأَلَ عَبْدَ اللَّهِ بْنَ عُمَرَ عَمَّا لَفَظَ الْبَحْرُ فَنَهَاهُ عَنْ أَكْلِهِ، ‏.‏ قَالَ نَافِعٌ ثُمَّ انْقَلَبَ عَبْدُ اللَّهِ فَدَعَا بِالْمُصْحَفِ فَقَرَأَ ‏{‏أُحِلَّ لَكُمْ صَيْدُ الْبَحْرِ وَطَعَامُهُ‏}‏ قَالَ نَافِعٌ فَأَرْسَلَنِي عَبْدُ اللَّهِ بْنُ عُمَرَ إِلَى عَبْدِ الرَّحْمَنِ بْنِ أَبِي هُرَيْرَةَ إِنَّهُ لاَ بَأْسَ بِأَكْلِهِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abd ar-Rahman ibn\nAbi Hurayra asked Abdullah ibn Umar about eating what was cast up by\nthe sea and he forbade him to eat it. Then Abdullah turned and asked\nfor a Qur'an, and read, \"The game of the sea and its flesh are halal\nfor you.\" Nafi added, \"Abdullah ibn Umar sent me to Abdar-Rahman Ibn\nAbi Hurayra to say that there was no harm in eating it.\""}},{"id":10,"idInBook":10,"chapterId":25,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ سَعْدٍ الْجَارِيِّ، مَوْلَى عُمَرَ بْنِ الْخَطَّابِ أَنَّهُ قَالَ سَأَلْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ عَنِ الْحِيتَانِ، يَقْتُلُ بَعْضُهَا بَعْضًا أَوْ تَمُوتُ صَرَدًا فَقَالَ لَيْسَ بِهَا بَأْسٌ ‏.‏ قَالَ سَعْدٌ ثُمَّ سَأَلْتُ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ الْعَاصِ فَقَالَ مِثْلَ ذَلِكَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Zayd ibn Aslam that Sad al-\nJari, the mawla of Umar ibn al-Khattab asked Abdullah ibn Umar about\nfish which had killed each other or which had died from severe cold .\nHe said, \"There is no harm in eating them.'' Sad said,' 'I then asked\nAbdullah ibn Amr ibn al As and he said the same.\""}},{"id":11,"idInBook":11,"chapterId":25,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، وَزَيْدِ بْنِ ثَابِتٍ، أَنَّهُمَا كَانَا لاَ يَرَيَانِ بِمَا لَفَظَ الْبَحْرُ بَأْسًا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'z-Zinad from Abu Salama\nibn Abd ar-Rahman from Abu Hurayra and Zayd ibn Thabit that they saw\nno harm in eating what was cast up by the sea."}},{"id":12,"idInBook":12,"chapterId":25,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّ نَاسًا، مِنْ أَهْلِ الْجَارِ قَدِمُوا فَسَأَلُوا مَرْوَانَ بْنَ الْحَكَمِ عَمَّا لَفَظَ الْبَحْرُ فَقَالَ لَيْسَ بِهِ بَأْسٌ وَقَالَ اذْهَبُوا إِلَى زَيْدِ بْنِ ثَابِتٍ وَأَبِي هُرَيْرَةَ فَاسْأَلُوهُمَا عَنْ ذَلِكَ ثُمَّ ائْتُونِي فَأَخْبِرُونِي مَاذَا يَقُولاَنِ فَأَتَوْهُمَا فَسَأَلُوهُمَا فَقَالاَ لاَ بَأْسَ بِهِ ‏.‏ فَأَتَوْا مَرْوَانَ فَأَخْبَرُوهُ ‏.‏ فَقَالَ مَرْوَانُ قَدْ قُلْتُ لَكُمْ ‏.‏ قَالَ مَالِكٌ لاَ بَأْسَ بِأَكْلِ الْحِيتَانِ يَصِيدُهَا الْمَجُوسِيُّ لأَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ فِي الْبَحْرِ ‏\n\"‏ هُوَ الطَّهُورُ مَاؤُهُ الْحِلُّ مَيْتَتُهُ ‏\"‏ ‏.‏ قَالَ مَالِكٌ وَإِذَا أُكِلَ ذَلِكَ مَيْتًا فَلاَ يَضُرُّهُ مَنْ صَادَهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'z-Zinad from Abu Salama\nibn Abd ar-Rahman that some people from al-Jar came to Marwan ibn al-\nHakam and asked him about eating what was cast up by the sea. He said,\n\"There is no harm in eating it.\" Marwan said, \"Go to Zayd ibn Thabit\nand Abu Hurayra and ask them about it, then come to me and tell me\nwhat they say.\" They went to them and asked them, and they both said,\n\"There is no harm in eating it \" They returned to Marwan and told him.\nMarwan said, \"I told you.\" \n\n\nMalik said that there was no harm\nin eating fish caught by magians, because the Messenger of Allah, may\nAllah bless him and grant him peace, said, \"In the sea's water is\npurity, and that which is dead in it is halal. \"\n\n\nMalik said,\n\"If it is eaten when it is dead, there is no harm in who catches it.\""}},{"id":13,"idInBook":13,"chapterId":25,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنِ أَبِي إِدْرِيسَ الْخَوْلاَنِيِّ، عَنْ أَبِي ثَعْلَبَةَ الْخُشَنِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَكْلُ كُلِّ ذِي نَابٍ مِنَ السِّبَاعِ حَرَامٌ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shibab from Abu Idris al-\nKhawlani from Abu Tha~laba al-Khushani that the Messenger of Allah,\nmay Allah bless him and grant him peace, said, \"It is haram to eat\nanimals with fangs \""}},{"id":14,"idInBook":14,"chapterId":25,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي حَكِيمٍ، عَنْ عَبِيدَةَ بْنِ سُفْيَانَ الْحَضْرَمِيِّ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَكْلُ كُلِّ ذِي نَابٍ مِنَ السِّبَاعِ حَرَامٌ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ismail ibn Abi Hakim from\nAbiyda ibn Sufyan al-Hadrami from Abu Hurayra that the Messenger of\nAllah, may Allah bless him and grant him peace, said, \"Eating animals\nwith fangs is haram. \"\n\n\nMalik said, \"This is the custom among\nus.\""}},{"id":15,"idInBook":15,"chapterId":25,"bookId":7,"arabic":"","english":{"narrator":"","text":"Yahya related to me from Malik that the best of what he had heard\nabout horses, mules, and donkeys was that they were not eaten because\nAllah, the Blessed, the Exalted,said, \"And horses, and mules and\nasses, for you to ride, and as an adornment. \" (Sura 16 ayat 8) . He\nsaid, may He be Blessed and Exalted, \"In cattle, some of them you\nride, and some of them you eat.\" (Sura 6 ayat 79). He said, the\nBlessed, the Exalted, \"Mention Allah's name over what He has provided\nyou of cattle, and eat of them and feed the beggar (al-qani) and the\nsuppliant (al-mutarr). (Sura 22 ayat 34).\n\n\nMalik said \"Allah\nmentioned horses, mules, and donkeys for riding and adornment, and He\nmentioned cattle for riding and eating.\"\n\n\nMalik said, \"Al-qani\nalso means the poor.\""}},{"id":16,"idInBook":16,"chapterId":25,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، أَنَّهُ قَالَ مَرَّ رَسُولُ اللَّهِ صلى الله عليه وسلم بِشَاةٍ مَيِّتَةٍ كَانَ أَعْطَاهَا مَوْلاَةً لِمَيْمُونَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\"‏ أَفَلاَ انْتَفَعْتُمْ بِجِلْدِهَا ‏\"‏ ‏.‏ فَقَالُوا يَا رَسُولَ اللَّهِ إِنَّهَا مَيْتَةٌ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّمَا حُرِّمَ أَكْلُهَا ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Ubaydullah\nibn Abdullah ibn Utba ibn Masud that Abdullah ibn Abbas said, \"The\nMessenger of Allah, may Allah bless him and grant him peace, passed by\na dead sheep which had been given to a mawla of his wife, Maimuna. He\nsaid, ' Aren't you going to use its skin?' They said, 'Messenger of\nAllah, but it is carrion. 'The Messenger of Allah, may Allah bless him\nand grant him peace, said, 'Only eating it is haram.' \""}},{"id":17,"idInBook":17,"chapterId":25,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنِ ابْنِ وَعْلَةَ الْمِصْرِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا دُبِغَ الإِهَابُ فَقَدْ طَهُرَ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me from Zayd ibn Aslam from Ibn Wala al-Misri\nfrom Abdullah ibn Abbas that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"A skin when it is tanned is pure.\""}},{"id":18,"idInBook":18,"chapterId":25,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ قُسَيْطٍ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ ثَوْبَانَ، عَنْ أُمِّهِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَمَرَ أَنْ يُسْتَمْتَعَ بِجُلُودِ الْمَيْتَةِ إِذَا دُبِغَتْ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yazid ibn Abdullah ibn Qusayt\nfrom Muhammad ibn Abd ar-Rahman ibn Thawban from his mother that\nA'isha, the wife of the Prophet, may Allah bless him and grant him\npeace, said that the Messenger of Allah, may Allah bless him and grant\nhim peace, ordered that the skins of carrion be used after they had\nbeen tanned."}},{"id":19,"idInBook":19,"chapterId":25,"bookId":7,"arabic":"","english":{"narrator":"","text":"Yahya related to me from Malik that the best of what he had heard\nabout a man who is forced by necessity to eat carrion is that he ate\nit until he was full and then he took provision from it. If he found\nsomething which would enable him to dispense with it, he threw it\naway.\n\n\nMalik when asked whether or not a man who had been\nforced by necessity to eat carrion, should eat it when he also found\nthe fruit, crops or sheep of a people in that place, answered, \"If he\nthinks that the owners of the fruit, crops, or sheep will believe his\nnecessity so that he will not be deemed a thief and have his hand cut\noff, then I think that he should eat from whatever he finds that which\nwill remove his hunger but he should not carry any of it away. I\nprefer that he does that than that he eat carrion. If he fears that he\nwill not be believed, and will be deemed a thief for what he has\ntaken, then I think that it is better for him to eat the carrion, and\nhe has leeway to eat carrion in this respect. Even so, I fear that\nsomeone who is not forced by necessity to eat carrion might exceed the\nlimits out of a desire to consume other peoples' property, crops or\nfruit.\"\n\n\nMalik said, \"That is the best of what I have heard.\""}}],"chapter":{"id":25,"bookId":7,"arabic":"كتاب الصيد","english":"Game"}}