{"metadata":{"length":7,"arabic":{"title":"موطأ مالك","author":"الإمام مالك بن أنس","introduction":"كتاب العقيقة"},"english":{"title":"Muwatta Malik","author":"Imam Malik ibn Anas","introduction":"The 'Aqiqa"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":26,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ رَجُلٍ، مِنْ بَنِي ضَمْرَةَ عَنْ أَبِيهِ، أَنَّهُ قَالَ سُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْعَقِيقَةِ فَقَالَ ‏\"‏ لاَ أُحِبُّ الْعُقُوقَ ‏\"‏ ‏.‏ وَكَأَنَّهُ إِنَّمَا كَرِهَ الاِسْمَ وَقَالَ ‏\"‏ مَنْ وُلِدَ لَهُ وَلَدٌ فَأَحَبَّ أَنْ يَنْسُكَ عَنْ وَلَدِهِ فَلْيَفْعَلْ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Zayd ibn Aslam from a man of the Banu\nDamra that his father said, \"The Messenger of Allah, may Allah bless\nhim and grant him peace, was asked about the Aqiqa. He said, 'I do not\nlike disobedience (uquq),' as if he disliked the name. He said, 'If\nanyone has a child born to him, and wants to sacrifice for his child,\nthen let him do it.' \""}},{"id":2,"idInBook":2,"chapterId":26,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ، عَنْ أَبِيهِ، أَنَّهُ قَالَ وَزَنَتْ فَاطِمَةُ بِنْتُ رَسُولِ اللَّهِ صلى الله عليه وسلم شَعَرَ حَسَنٍ وَحُسَيْنٍ وَزَيْنَبَ وَأُمِّ كُلْثُومٍ فَتَصَدَّقَتْ بِزِنَةِ ذَلِكَ فِضَّةً ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Jafar ibn Muhammad that his\nfather said, \"Fatima, the daughter of the Messenger of Allah, may\nAllah bless him and grant him peace, weighed the hair of Hasan,\nHusayn, Zaynab and Umm Kulthum, and gave away in sadaqa an equivalent\nweight of silver.\""}},{"id":3,"idInBook":3,"chapterId":26,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ مُحَمَّدِ بْنِ عَلِيِّ بْنِ الْحُسَيْنِ، أَنَّهُ قَالَ وَزَنَتْ فَاطِمَةُ بِنْتُ رَسُولِ اللَّهِ صلى الله عليه وسلم شَعَرَ حَسَنٍ وَحُسَيْنٍ فَتَصَدَّقَتْ بِزِنَتِهِ فِضَّةً ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Rabia ibn Abi Abd ar-Rahman\nthat Muhammad ibn Ali ibn al-Husayn said, \"Fatima, the daughter of the\nMessenger of Allah, may Allah bless him and grant him peace, weighed\nthe hair of Hasan and Husayn, and gave away in sadaqa the equivalent\nweight in silver.\""}},{"id":4,"idInBook":4,"chapterId":26,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، لَمْ يَكُنْ يَسْأَلُهُ أَحَدٌ مِنْ أَهْلِهِ عَقِيقَةً إِلاَّ أَعْطَاهُ إِيَّاهَا وَكَانَ يَعُقُّ عَنْ وَلَدِهِ بِشَاةٍ شَاةٍ عَنِ الذُّكُورِ وَالإِنَاثِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that if any of Abdullah\nibn Umar's family asked him for an aqiqa, he would give it to them. He\ngave a sheep as aqiqa for both his male and female children."}},{"id":5,"idInBook":5,"chapterId":26,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ الْحَارِثِ التَّيْمِيِّ، أَنَّهُ قَالَ سَمِعْتُ أَبِي يَسْتَحِبُّ الْعَقِيقَةَ، وَلَوْ بِعُصْفُورٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Rabia ibn Abi Abd ar-Rahman\nthat Muhammad ibn Ibrahim ibn al-Harith at-Taymi said, \"I heard my\nfather say that the aqiqa was desirable, even if it was only a\nsparrow.\""}},{"id":6,"idInBook":6,"chapterId":26,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّهُ عُقَّ عَنْ حَسَنٍ، وَحُسَيْنٍ، ابْنَىْ عَلِيِّ بْنِ أَبِي طَالِبٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he heard that there had been\nan aqiqa for Hasan and Husayn, the sons of Ali ibn Abi Talib."}},{"id":7,"idInBook":7,"chapterId":26,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، أَنَّ أَبَاهُ، عُرْوَةَ بْنَ الزُّبَيْرِ كَانَ يَعُقُّ عَنْ بَنِيهِ الذُّكُورِ، وَالإِنَاثِ، بِشَاةٍ شَاةٍ ‏.‏ قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا فِي الْعَقِيقَةِ أَنَّ مَنْ عَقَّ فَإِنَّمَا يَعُقُّ عَنْ وَلَدِهِ بِشَاةٍ شَاةٍ الذُّكُورِ وَالإِنَاثِ وَلَيْسَتِ الْعَقِيقَةُ بِوَاجِبَةٍ وَلَكِنَّهَا يُسْتَحَبُّ الْعَمَلُ بِهَا وَهِيَ مِنَ الأَمْرِ الَّذِي لَمْ يَزَلْ عَلَيْهِ النَّاسُ عِنْدَنَا فَمَنْ عَقَّ عَنْ وَلَدِهِ فَإِنَّمَا هِيَ بِمَنْزِلَةِ النُّسُكِ وَالضَّحَايَا لاَ يَجُوزُ فِيهَا عَوْرَاءُ وَلاَ عَجْفَاءُ وَلاَ مَكْسُورَةٌ وَلاَ مَرِيضَةٌ وَلاَ يُبَاعُ مِنْ لَحْمِهَا شَىْءٌ وَلاَ جِلْدُهَا وَيُكْسَرُ عِظَامُهَا وَيَأْكُلُ أَهْلُهَا مِنْ لَحْمِهَا وَيَتَصَدَّقُونَ مِنْهَا وَلاَ يُمَسُّ الصَّبِيُّ بِشَىْءٍ مِنْ دَمِهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa that his\nfather, Urwa ibn az-Zubayr made an aqiqa for his male and female\nchildren of a sheep each.\n\n\nMalik said, \"What we do about the\naqiqa is that if someone makes an aqiqa for his children, he gives a\nsheep for both male and female. The aqiqa is not obligatory but it is\ndesirable to do it, and people continue to come to us about it. If\nsomeone makes an aqiqa for his children, the same rules apply as with\nall sacrificial animals - one-eyed, emaciated, injured, or sick\nanimals must not be used, and neither the meat or the skin is to be\nsold. The bones are broken and the family eat the meat and give some\nof it away as sadaqa. The child is not smeared with any of the blood\n.''"}}],"chapter":{"id":26,"bookId":7,"arabic":"كتاب العقيقة","english":"The 'Aqiqa"}}