{"metadata":{"length":24,"arabic":{"title":"موطأ مالك","author":"الإمام مالك بن أنس","introduction":"كتاب الفرائض"},"english":{"title":"Muwatta Malik","author":"Imam Malik ibn Anas","introduction":"Fara'id"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":27,"bookId":7,"arabic":"","english":{"narrator":"","text":"Yahya related to me from Malik, \"The generally agreed upon way of\ndoing things among us and what I have seen the people of knowledge\ndoing in our city about the fixed shares of inheritance of children\nfrom the mother or father when one or other of them dies is that if\nthey leave male and female children, the male takes the portion of two\nfemales. If there are only females, and there are more than two, they\nget two thirds of what is left between them. If there is only one, she\ngets a half. If someone shares with the children, who has a fixed\nshare and there are males among them, the reckoner begins with the\nones with fixed shares. What remains after that is divided among the\nchildren according to their inheritance.\n\n\n\"When there are no\nchildren, grandchildren through sons have the same position as\nchildren, so that grandsons are like sons and grand-daughters are like\ndaughters. They inherit as they inherit and they overshadow as they\novershadow. If there are both children and grandchildren through sons,\nand there is a male among the children, then the grandchildren through\nsons do not share in the inheritance with him.\n\n\n\"If there is\nno surviving male among the children, and there are two or more\ndaughters, the granddaughters through a son do not share in the\ninheritance with them unless there is a male who is in the same\nposition as them in relation to the deceased, or further than them.\nHis presence gives access to whatever is left over, if any, to whoever\nis in his position and whoever is above him of the granddaughters\nthrough sons. If something is left over, they divide it among them,\nand the male takes the portion of two females. If nothing is left\nover, they have nothing.\n\n\n\"If the only descendant is a\ndaughter, she takes half, and if there are one or more grand-daughters\nthrough a son who are in the same position to the deceased, they share\na sixth. If there is a male in the same position as the granddaughters\nthrough a son in relation to the deceased, they have no share and no\nsixth .\n\n\n\"If there is a surplus after the allotting of shares\nto the people with fixed shares, the surplus goes to the male and\nwhoever is in his position and whoever is above him of the female\ndescendants through sons. The male has the share of two females. The\none who is more distant in relationship than grandchildren through\nsons has nothing. If there is no surplus, they have nothing. That is\nbecause Allah, the Blessed, the Exalted, said in His Book, 'Allah\ncharges you about your children that the male has the like of the\nportion of two females. If there are more than two women they have two\nthirds of what is left. If there is one, she has a half.' (Sura 4 ayat\n10)"}},{"id":2,"idInBook":2,"chapterId":27,"bookId":7,"arabic":"","english":{"narrator":"","text":"Malik said, \"The inheritance of a husband from a wife when she\nleaves no children or grandchildren through sons is a half. If she\nleaves children or grandchildren through sons, male or female, by her\npresent or previous husbands, the husband has a quarter after bequests\nor debts. The inheritance of a wife from a husband who does not leave\nchildren or grandchildren through sons is a quarter. If he leaves\nchildren or grandchildren through sons, male or female, the wife has\nan eighth after bequests and debts. That is because Allah, the\nBlessed, the Exalted! said in His Book, 'You have a half of what your\nwives leave if they have no children. If they have children, you have\na fourth of what they leave after bequests and debts. They have a\nfourth of what you leave if you have no children. If you have\nchildren, they have an eighth after bequests or debts.' \" (Sura4ayat\n11)."}},{"id":3,"idInBook":3,"chapterId":27,"bookId":7,"arabic":"","english":{"narrator":"","text":"Malik said, \"The generally agreed on way of doing things among us\nabout which there is no dispute and what I have seen the people of\nknowledge in our city doing is that when a father inherits from a son\nor a daughter and the deceased leaves children, or grandchildren\nthrough a son, the father has a fixed share of one sixth. If the\ndeceased does leave any children or male grandchildren through a son,\nthe apportioning begins with those with whom the father shares in the\nfixed shares. They are given their fixed shares. If a sixth or more is\nleft over, the sixth and what is above it is given to the father, and\nif there is less than a sixth left, the father is given his sixth as a\nfixed share, (i.e. the other shares are adjusted.)\n\n\n\"The\ninheritance of a mother from her child, if her son or daughter dies\nand leaves children or male or female grandchildren through a son, or\nleaves two or more full or half siblings is a sixth. If the deceased\ndoes not leave any children or grandchildren through a son, or two or\nmore siblings, the mother has a whole third except in two cases. One\nof them is if a man dies and leaves a wife and both parents. The wife\nhas a fourth, the mother a third of what remains, (which is a fourth\nof the capital). The other is if a wife dies and leaves a husband and\nboth parents. The husband gets half, and the mother a third of what\nremains, (which is a sixth of the capital). That is because Allah, the\nBlessed, the Exalted, says in His Book, 'His two parents each have a\nsixth of what he leaves if he has children. If he does not have\nchildren, and his parents inherit from him, his mother has a third. If\nhe has siblings, the mother has a sixth.' (Sura 4 ayat 11). The sunna\nis that the siblings be two or more.\""}},{"id":4,"idInBook":4,"chapterId":27,"bookId":7,"arabic":"","english":{"narrator":"","text":"Malik said, \"The generally agreed upon way of doing things among\nus is that maternal half-siblings do not inherit anything when there\nare children or grandchildren through sons, male or female. They do\nnot inherit anything when there is a father or the father's father.\nThey inherit in what is outside of that. If there is only one male or\nfemale, they are given a sixth. If there are two, each of them has a\nsixth. If there are more than that, they share in a third which is\ndivided among them. The male does not have portion of two females.\nThat is because Allah, the Blessed, the Exalted, says in His Book, 'If\na man or woman has no direct heir, and he has a brother or sister, by\nthe mother, each of them has a sixth. If there are more than two, they\nshare equally in a third.' \" (Sura 4 ayat 12)."}},{"id":5,"idInBook":5,"chapterId":27,"bookId":7,"arabic":"","english":{"narrator":"","text":"Malik said, \"The generally agreed on way of doing things among us\nis that full siblings do not inherit anything with sons nor anything\nwith grandsons through a son, nor anything with the father. They do\ninherit with the daughters and the granddaughters through a son when\nthe deceased does not leave a paternal grandfather. Any property that\nis left over, they are in it as paternal relations. One begins with\nthe people who are allotted fixed shares. They are given their shares.\nIf there is anything left over after that, it belongs to the full\nsiblings. They divide it between themselves according to the Book of\nAllah, whether they are male or female. The male has a portion of two\nfemales. If there is nothing left over, they have nothing.\n\n\n\"If the deceased does not leave a father or a paternal grandfather or\nchildren or male or female grandchildren through a son, a single full\nsister gets a half. If there are two or more full sisters, they get\ntwo thirds. If there is a brother with them, sisters, whether one or\nmore, do not have a fixed share. One begins with whoever shares in the\nfixed shares. They are given their shares. Whatever remains after that\ngoes to the full siblings. The male has the portion of two females\nexcept in one case, in which the full siblings have nothing. They\nshare in this case the third of the half-siblings by the mother. That\ncase is when a woman dies and leaves a husband, a mother, half-\nsiblings by her mother, and full siblings. The husband has a half. The\nmother has one sixth. The half-siblings by the mother have a third.\nNothing is left after that, so the full siblings share in this case\nwith the half-siblings by the mother in their third. The male has the\nportion of two females in as much as all of them are siblings of the\ndeceased by the mother. They inherit by the mother. That is because\nAllah, the Blessed, the Exalted, said in His Book, 'If a man or a\nwoman has no direct heir and he has a brother or a sister, each one of\nthe two gets a sixth. If there are more than that, they share equally\nin the third. ' (Sura 4 ayat 12) . They therefore share in this case\nbecause all of them are siblings of the deceased by the mother.\""}},{"id":6,"idInBook":6,"chapterId":27,"bookId":7,"arabic":"","english":{"narrator":"","text":"Malik said, \"The generally agreed on wayof doing things among us\nis that when there are no full siblings with them, half-siblings by\nthe father take the position of full siblings. Their males are like\nthe males of the full siblings, and their females are like their\nfemales except in the case where the half-siblings by the mother and\nthe full siblings share, because they are not offspring of the mother\nwho joins these.\"\n\n\nMalik said, \"If there are both full\nsiblings and half-siblings by the father and there is a male among the\nfull siblings none of the half-siblings by the father have any\ninheritance. If there is one or more females in the full siblings and\nthere is no male with them, the one full sister gets a half, and the\nhalf sister by the father gets a sixth, completing the two-thirds. If\nthere is a male with the half-sisters by the father, they have no\nshare. The people of fixed shares are given their shares and if there\nis something left after that it is divided between the half-siblings\nby the father. The male has the portion of two females. If there is\nnothing left over, they get nothing. If the full siblings consist of\ntwo or more females, they get two-thirds, and the half-sisters by the\nfather get nothing with them unless there is a half-brother by the\nfather with them. If there is a half-brother by the father with them,\nthe people of fixed shares are given their shares and if there is\nsomething left over after that, it is divided between the half-\nsiblings by the father. The male gets the portion of two females. If\nthere is nothing left over, they get nothing. Half-siblings by the\nmother, full-siblings, and half-siblings by the father, each have a\nsixth (when they are onlyone). Two and more share a third. The male\nhas the same portion as the female. They are in the same position in\nit.\""}},{"id":7,"idInBook":7,"chapterId":27,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ بَلَغَهُ أَنَّ مُعَاوِيَةَ بْنَ أَبِي سُفْيَانَ، كَتَبَ إِلَى زَيْدِ بْنِ ثَابِتٍ يَسْأَلُهُ عَنِ الْجَدِّ، فَكَتَبَ إِلَيْهِ زَيْدُ بْنُ ثَابِتٍ إِنَّكَ كَتَبْتَ إِلَىَّ تَسْأَلُنِي عَنِ الْجَدِّ، وَاللَّهُ، أَعْلَمُ وَذَلِكَ مِمَّا لَمْ يَكُنْ يَقْضِي فِيهِ إِلاَّ الأُمَرَاءُ - يَعْنِي الْخُلَفَاءَ - وَقَدْ حَضَرْتُ الْخَلِيفَتَيْنِ قَبْلَكَ يُعْطِيَانِهِ النِّصْفَ مَعَ الأَخِ الْوَاحِدِ وَالثُّلُثَ مَعَ الاِثْنَيْنِ فَإِنْ كَثُرَتِ الإِخْوَةُ لَمْ يُنَقِّصُوهُ مِنَ الثُّلُثِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said that he had\nheard that Muawiya ibn Abi Sufyan wrote to Zayd ibn Thabit asking him\nabout the grandfather. Zayd ibn Thabit wrote to him, \"You have written\nto me asking me about the grandfather. Allah knows best. That is part\nof what is only determined by the amirs, i.e. the khalifs. I was\npresent with two khalifs before you who gave the grandfather a half\nwith one sibling, and a third with two. If there were more siblings,\nthey did not decrease his third.\""}},{"id":8,"idInBook":8,"chapterId":27,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ قَبِيصَةَ بْنِ ذُؤَيْبٍ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، فَرَضَ لِلْجَدِّ الَّذِي يَفْرِضُ النَّاسُ لَهُ الْيَوْمَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Qabisa ibn\nDhu'ayba that Umar ibn al-Khattab gave the grandfather \"what people\ngive him today.\""}},{"id":9,"idInBook":9,"chapterId":27,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، أَنَّهُ قَالَ فَرَضَ عُمَرُ بْنُ الْخَطَّابِ وَعُثْمَانُ بْنُ عَفَّانَ وَزَيْدُ بْنُ ثَابِتٍ لِلْجَدِّ مَعَ الإِخْوَةِ الثُّلُثَ ‏.‏ قَالَ مَالِكٌ وَالأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا وَالَّذِي أَدْرَكْتُ عَلَيْهِ أَهْلَ الْعِلْمِ بِبَلَدِنَا أَنَّ الْجَدَّ أَبَا الأَبِ لاَ يَرِثُ مَعَ الأَبِ دِنْيَا شَيْئًا وَهُوَ يُفْرَضُ لَهُ مَعَ الْوَلَدِ الذَّكَرِ وَمَعَ ابْنِ الاِبْنِ الذَّكَرِ السُّدُسُ فَرِيضَةً وَهُوَ فِيمَا سِوَى ذَلِكَ مَا لَمْ يَتْرُكِ الْمُتَوَفَّى أَخًا أَوْ أُخْتًا لأَبِيهِ يُبَدَّأُ بِأَحَدٍ إِنْ شَرَّكَهُ بِفَرِيضَةٍ مُسَمَّاةٍ فَيُعْطَوْنَ فَرَائِضَهُمْ فَإِنْ فَضَلَ مِنَ الْمَالِ السُّدُسُ فَمَا فَوْقَهُ فُرِضَ لِلْجَدِّ السُّدُسُ فَرِيضَةً ‏.‏ قَالَ مَالِكٌ وَالْجَدُّ وَالإِخْوَةُ لِلأَبِ وَالأُمِّ إِذَا شَرَّكَهُمْ أَحَدٌ بِفَرِيضَةٍ مُسَمَّاةٍ يُبَدَّأُ بِمَنْ شَرَّكَهُمْ مِنْ أَهْلِ الْفَرَائِضِ فَيُعْطَوْنَ فَرَائِضَهُمْ فَمَا بَقِيَ بَعْدَ ذَلِكَ لِلْجَدِّ وَالإِخْوَةِ مِنْ شَىْءٍ فَإِنَّهُ يُنْظَرُ أَىُّ ذَلِكَ أَفْضَلُ لِحَظِّ الْجَدِّ أُعْطِيَهُ الثُّلُثُ مِمَّا بَقِيَ لَهُ وَلِلإِخْوَةِ أَوْ يَكُونُ بِمَنْزِلَةِ رَجُلٍ مِنَ الإِخْوَةِ فِيمَا يَحْصُلُ لَهُ وَلَهُمْ يُقَاسِمُهُمْ بِمِثْلِ حِصَّةِ أَحَدِهِمْ أَوِ السُّدُسُ مِنْ رَأْسِ الْمَالِ كُلِّهِ أَىُّ ذَلِكَ كَانَ أَفْضَلَ لِحَظِّ الْجَدِّ أُعْطِيَهُ الْجَدُّ وَكَانَ مَا بَقِيَ بَعْدَ ذَلِكَ لِلإِخْوَةِ لِلأَبِ وَالأُمِّ لِلذَّكَرِ مِثْلُ حَظِّ الأُنْثَيَيْنِ إِلاَّ فِي فَرِيضَةٍ وَاحِدَةٍ تَكُونُ قِسْمَتُهُمْ فِيهَا عَلَى غَيْرِ ذَلِكَ وَتِلْكَ الْفَرِيضَةُ امْرَأَةٌ تُوُفِّيَتْ وَتَرَكَتْ زَوْجَهَا وَأُمَّهَا وَأُخْتَهَا لأُمِّهَا وَأَبِيهَا وَجَدَّهَا فَلِلزَّوْجِ النِّصْفُ وَلِلأُمِّ الثُّلُثُ وَلِلْجَدِّ السُّدُسُ وَلِلأُخْتِ لِلأُمِّ وَالأَبِ النِّصْفُ ثُمَّ يُجْمَعُ سُدُسُ الْجَدِّ وَنِصْفُ الأُخْتِ فَيُقْسَمُ أَثْلاَثًا لِلذَّكَرِ مِثْلُ حَظِّ الأُنْثَيَيْنِ فَيَكُونُ لِلْجَدِّ ثُلُثَاهُ وَلِلأُخْتِ ثُلُثُهُ ‏.‏ قَالَ مَالِكٌ وَمِيرَاثُ الإِخْوَةِ لِلأَبِ مَعَ الْجَدِّ إِذَا لَمْ يَكُنْ مَعَهُمْ إِخْوَةٌ لأَبٍ وَأُمٍّ كَمِيرَاثِ الإِخْوَةِ لِلأَبِ وَالأُمِّ سَوَاءٌ ذَكَرُهُمْ كَذَكَرِهِمْ وَأُنْثَاهُمْ كَأُنْثَاهُمْ فَإِذَا اجْتَمَعَ الإِخْوَةُ لِلأَبِ وَالأُمِّ وَالإِخْوَةُ لِلأَبِ فَإِنَّ الإِخْوَةَ لِلأَبِ وَالأُمِّ يُعَادُّونَ الْجَدَّ بِإِخْوَتِهِمْ لأَبِيهِمْ فَيَمْنَعُونَهُ بِهِمْ كَثْرَةَ الْمِيرَاثِ بِعَدَدِهِمْ وَلاَ يُعَادُّونَهُ بِالإِخْوَةِ لِلأُمِّ لأَنَّهُ لَوْ لَمْ يَكُنْ مَعَ الْجَدِّ غَيْرُهُمْ لَمْ يَرِثُوا مَعَهُ شَيْئًا وَكَانَ الْمَالُ كُلُّهُ لِلْجَدِّ فَمَا حَصَلَ لِلإِخْوَةِ مِنْ بَعْدِ حَظِّ الْجَدِّ فَإِنَّهُ يَكُونُ لِلإِخْوَةِ مِنَ الأَبِ وَالأُمِّ دُونَ الإِخْوَةِ لِلأَبِ وَلاَ يَكُونُ لِلإِخْوَةِ لِلأَبِ مَعَهُمْ شَىْءٌ إِلاَّ أَنْ يَكُونَ الإِخْوَةُ لِلأَبِ وَالأُمِّ امْرَأَةً وَاحِدَةً فَإِنْ كَانَتِ امْرَأَةً وَاحِدَةً فَإِنَّهَا تُعَادُّ الْجَدَّ بِإِخْوَتِهَا لأَبِيهَا مَا كَانُوا فَمَا حَصَلَ لَهُمْ وَلَهَا مِنْ شَىْءٍ كَانَ لَهَا دُونَهُمْ مَا بَيْنَهَا وَبَيْنَ أَنْ تَسْتَكْمِلَ فَرِيضَتَهَا وَفَرِيضَتُهَا النِّصْفُ مِنْ رَأْسِ الْمَالِ كُلِّهِ فَإِنْ كَانَ فِيمَا يُحَازُ لَهَا وَلإِخْوَتِهَا لأَبِيهَا فَضْلٌ عَنْ نِصْفِ رَأْسِ الْمَالِ كُلِّهِ فَهُوَ لإِخْوَتِهَا لأَبِيهَا لِلذَّكَرِ مِثْلُ حَظِّ الأُنْثَيَيْنِ فَإِنْ لَمْ يَفْضُلْ شَىْءٌ فَلاَ شَىْءَ لَهُمْ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Sulayman\nibn Yasar said, ''Umar ibn al-Khattab, Uthman ibn Affan, andZayd ibn\nThabit gave the grandfather a third with full siblings\". Malik said,\n\"The generally agreed on way of doing things among us and what I have\nseen the people of knowledge in our city doing is that the paternal\ngrandfather does not inherit anything at all with the father. He is\ngiven a sixth as a fixed share with the son and the grandson through a\nson. Other than that, when the deceased does not leave a mother or a\npaternal aunt, one begins with whoever has a fixed share, and they are\ngiven their shares. If there is a sixth of the property left over, the\ngrandfather is given a sixth as a fixed share.\"\n\n\nMalik said,\n\"When someone shares with the grandfather and the full siblings in a\nspecified share, one begins with whoever shares with them of the\npeople of fixed shares. They are given their shares. What is left over\nafter that belongs to the grandfather and the full siblings. Then one\nsees which is the more favourable of two alternatives for the portion\nof the grandfather. Either a third is allotted to him and the siblings\nto divide between them, and he gets a share as if he were one of the\nsiblings, or else he takes a sixth from all the capital. Whichever is\nthe best portion for the grandfather is given to him. What is left\nafter that, goes to the full siblings. The male gets the portion of\ntwo females except in one particular case. The division in this case\nis different from the preceding one. This case is when a woman dies\nand leaves a husband, mother, full sister and grandfather. The husband\ngets a half, the mother gets a third, the grandfather gets a sixth,\nand the full sister gets a half. The sixth of the grandfather and the\nhalf of the sister are joined and divided into thirds. The male gets\nthe share of two females. Therefore, the grandfather has two thirds,\nand the sister has one third.\"\n\n\nMalik said, \"The inheritance\nof the half-siblings by the father with the grandfather when there are\nno full siblings with them, is like the inheritance of the full\nsiblings (in the same situation). The males are the same as their\nmales and the females are the same as their females. When there are\nboth full siblings and half-siblings by the father, the full siblings\ninclude in their number the number of half-siblings by the father, to\nlimit the inheritance of the grandfather, i.e., if there was only one\nfull sibling with the grandfather. They would share, after the\nallotting of the fixed shares, the remainder of the inheritance\nbetween them equally. If there were also two half-siblings by the\nfather, their number is added to the division of the sum, which would\nthen be divided four ways. A quarter going to the grandfather and\nthree-quarters going to the full siblings who annex the shares\ntechnically allotted to the half-siblings by the father. They do not\ninclude the number of half-siblings by the mother, because if there\nwere only half-siblings by the father they would not inherit anything\nwith the grandfather and all the capital would belong to the\ngrandfather, and so the siblings would not get anything after the\nportion of the grandfather.\n\n\n\"It belongs to the full siblings\nmore than the half-siblings by the father, and the half-siblings by\nthe father do not get anything with them unless the full siblings\nconsist of one sister. If there is one full sister, she includes the\ngrandfather with the half-siblings by her father in the division,\nhowever many. Whatever remains for her and these half-siblings by the\nfather goes to her rather than them until she has had her complete\nshare, which is half of the total capital. If there is surplus beyond\nhalf of all the capital in what she and the half-siblings by the\nfather acquire it goes to them. The male has the portion of two\nfemales. If there is nothing left over, they get nothing.\""}},{"id":10,"idInBook":10,"chapterId":27,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُثْمَانَ بْنِ إِسْحَاقَ بْنِ خَرَشَةَ، عَنْ قَبِيصَةَ بْنِ ذُؤَيْبٍ، أَنَّهُ قَالَ جَاءَتِ الْجَدَّةُ إِلَى أَبِي بَكْرٍ الصِّدِّيقِ تَسْأَلُهُ مِيرَاثَهَا فَقَالَ لَهَا أَبُو بَكْرٍ مَا لَكِ فِي كِتَابِ اللَّهِ شَىْءٌ وَمَا عَلِمْتُ لَكِ فِي سُنَّةِ رَسُولِ اللَّهِ صلى الله عليه وسلم شَيْئًا فَارْجِعِي حَتَّى أَسْأَلَ النَّاسَ فَسَأَلَ النَّاسَ ‏.‏ فَقَالَ الْمُغِيرَةُ بْنُ شُعْبَةَ حَضَرْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم أَعْطَاهَا السُّدُسَ ‏.‏ فَقَالَ أَبُو بَكْرٍ هَلْ مَعَكَ غَيْرُكَ فَقَامَ مُحَمَّدُ بْنُ مَسْلَمَةَ الأَنْصَارِيُّ فَقَالَ مِثْلَ مَا قَالَ الْمُغِيرَةُ فَأَنْفَذَهُ لَهَا أَبُو بَكْرٍ الصِّدِّيقُ ثُمَّ جَاءَتِ الْجَدَّةُ الأُخْرَى إِلَى عُمَرَ بْنِ الْخَطَّابِ تَسْأَلُهُ مِيرَاثَهَا فَقَالَ لَهَا مَا لَكِ فِي كِتَابِ اللَّهِ شَىْءٌ وَمَا كَانَ الْقَضَاءُ الَّذِي قُضِيَ بِهِ إِلاَّ لِغَيْرِكِ وَمَا أَنَا بِزَائِدٍ فِي الْفَرَائِضِ شَيْئًا وَلَكِنَّهُ ذَلِكَ السُّدُسُ فَإِنِ اجْتَمَعْتُمَا فَهُوَ بَيْنَكُمَا وَأَيَّتُكُمَا خَلَتْ بِهِ فَهُوَ لَهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Uthman ibn\nIshaq ibn Kharasha that Qabisa ibn Dhu'ayb said, \"A grandmother came\nto Abu Bakr as-Siddiq and asked him for her inheritance. Abu Bakr said\nto her, 'You have nothing in the Book of Allah, and I do not know that\nyou have anything in the sunna of the Messenger of Allah, may Allah\nbless him and grant him peace. Go away therefore, until I have\nquestioned the people.' (i.e.the Companions). He questioned the\npeople, and al-Mughira ibn Shuba said, 'I was present with the\nMessenger of Allah, may Allah bless him and grant him peace, when he\ngave the grandmother a sixth.' Abu Bakr said, 'Was there anybody else\nwith you?' Muhammad ibn Maslama al-Ansari stood up and said the like\nof what al-Mughira said. Abu Bakr as-Siddiq gave it to her. Then the\nother grandmother came to Umar ibn al-Khattab and asked him for her\ninheritance. He said to her, \"You have nothing in the Book of Allah,\nand what has been decided is only for other than you, and I am not one\nto add to the fixed shares, other than that sixth. If there are two of\nyou together, it is between you. If eitherof you is left alone with\nit, it is hers.\""}},{"id":11,"idInBook":11,"chapterId":27,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، أَنَّهُ قَالَ أَتَتِ الْجَدَّتَانِ إِلَى أَبِي بَكْرٍ الصِّدِّيقِ فَأَرَادَ أَنْ يَجْعَلَ السُّدُسَ، لِلَّتِي مِنْ قِبَلِ الأُمِّ فَقَالَ لَهُ رَجُلٌ مِنَ الأَنْصَارِ أَمَا إِنَّكَ تَتْرُكُ الَّتِي لَوْ مَاتَتْ وَهُوَ حَىٌّ كَانَ إِيَّاهَا يَرِثُ فَجَعَلَ أَبُو بَكْرٍ السُّدُسَ بَيْنَهُمَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said that al-Qasim\nibn Muhammad said, \"Two grandmothers came to Abu Bakr asSiddiq, and he\nwanted to give the sixth to the one who was from the mother's side,\nand a man of the Ansar said, 'What? Are you omitting the one from whom\nhe would inherit if she died while he was alive?' Abu Bakr divided the\nsixth between them.~"}},{"id":12,"idInBook":12,"chapterId":27,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ رَبِّهِ بْنِ سَعِيدٍ، أَنَّ أَبَا بَكْرِ بْنَ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ، كَانَ لاَ يَفْرِضُ إِلاَّ لِلْجَدَّتَيْنِ ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا الَّذِي لاَ اخْتِلاَفَ فِيهِ وَالَّذِي أَدْرَكْتُ عَلَيْهِ أَهْلَ الْعِلْمِ بِبَلَدِنَا أَنَّ الْجَدَّةَ أُمَّ الأُمِّ لاَ تَرِثُ مَعَ الأُمِّ دِنْيَا شَيْئًا وَهِيَ فِيمَا سِوَى ذَلِكَ يُفْرَضُ لَهَا السُّدُسُ فَرِيضَةً وَأَنَّ الْجَدَّةَ أُمَّ الأَبِ لاَ تَرِثُ مَعَ الأُمِّ وَلاَ مَعَ الأَبِ شَيْئًا وَهِيَ فِيمَا سِوَى ذَلِكَ يُفْرَضُ لَهَا السُّدُسُ فَرِيضَةً فَإِذَا اجْتَمَعَتِ الْجَدَّتَانِ أُمُّ الأَبِ وَأُمُّ الأُمِّ وَلَيْسَ لِلْمُتَوَفَّى دُونَهُمَا أَبٌ وَلاَ أُمٌّ ‏.‏ قَالَ مَالِكٌ فَإِنِّي سَمِعْتُ أَنَّ أُمَّ الأُمِّ إِنْ كَانَتْ أَقْعَدَهُمَا كَانَ لَهَا السَّدُسُ دُونَ أُمِّ الأَبِ وَإِنْ كَانَتْ أُمُّ الأَبِ أَقْعَدَهُمَا أَوْ كَانَتَا فِي الْقُعْدَدِ مِنَ الْمُتَوَفَّى بِمَنْزِلَةٍ سَوَاءً فَإِنَّ السُّدُسَ بَيْنَهُمَا نِصْفَانِ ‏.‏ قَالَ مَالِكٌ وَلاَ مِيرَاثَ لأَحَدٍ مِنَ الْجَدَّاتِ إِلاَّ لِلْجَدَّتَيْنِ لأَنَّهُ بَلَغَنِي أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم وَرَّثَ الْجَدَّةَ ثُمَّ سَأَلَ أَبُو بَكْرٍ عَنْ ذَلِكَ حَتَّى أَتَاهُ الثَّبَتُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ وَرَّثَ الْجَدَّةَ فَأَنْفَذَهُ لَهَا ثُمَّ أَتَتِ الْجَدَّةُ الأُخْرَى إِلَى عُمَرَ بْنِ الْخَطَّابِ فَقَالَ لَهَا مَا أَنَا بِزَائِدٍ فِي الْفَرَائِضِ شَيْئًا فَإِنِ اجْتَمَعْتُمَا فَهُوَ بَيْنَكُمَا وَأَيَّتُكُمَا خَلَتْ بِهِ فَهُوَ لَهَا ‏.‏ قَالَ مَالِكٌ ثُمَّ لَمْ نَعْلَمْ أَحَدًا وَرَّثَ غَيْرَ جَدَّتَيْنِ مُنْذُ كَانَ الإِسْلاَمُ إِلَى الْيَوْمِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abdu Rabbih ibn Said that Abu\nBakr ibn Abd ar-Rahman ibn al-Harith ibn Hisham only gave a fixed\nshare to two grandmothers (together).\n\n\nMalik said, \"The\ngenerally agreed on way of doing things among us in which there is no\ndispute and which I saw the people of knowledge in our city doing, is\nthat the maternal grandmother does not inherit anything at all with\nthe mother. Outside of that, she is given a sixth as a fixed share.\nThe paternal grandmotherdoes not inherit anything along with the\nmother or the father. Outside of that she is given a sixth as a fixed\nshare.\" If both the paternal grandmother and maternal grandmother are\nalive, and the deceased does not have a father or mother outside of\nthem, Malik said,.\"I have heard that if the maternal grandmother is\nthe nearest of the two of them, then she has a sixth instead of the\npaternal grandmother. If the paternal grandmother is nearer, or they\nare in the same position in relation to the deceased, the sixth is\ndivided equally between them.\"\n\n\nMalik said, \"None of the\nfemale grand-relations except for these two has any inheritance\nbecause I have heard that the Messenger of Allah, may Allah bless him\nand grant him peace, gave the grandmother inheritance, and then Abu\nBakr asked about that until someone reliable related from the\nMessenger of Allah, may Allah bless him and grant him peace, that he\nhad made the grandmother an heir and given a share to her. Another\ngrandmother came to Umar ibn al-Khattab, and he said, 'I am not one to\nadd to fixed shares. If there are two of you together, it is between\nyou. If either of you is left alone with it, it is hers.' \" Malik\nsaid, \"We do not know of anyone who made other than the two\ngrandmothers heirs from the beginning of Islam to this day.\""}},{"id":13,"idInBook":13,"chapterId":27,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الْكَلاَلَةِ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ يَكْفِيكَ مِنْ ذَلِكَ الآيَةُ الَّتِي أُنْزِلَتْ فِي الصَّيْفِ آخِرَ سُورَةِ النِّسَاءِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Zayd ibn Aslam that Umar ibn\nal-Khattab asked the Messenger of Allah, may Allah bless him and grant\nhim peace, about someone who died without parents or offspring, and\nthe Messenger of Allah, may Allah bless him and grant him peace, said\nto him, \"The ayat which was sent down in the summer at the end of the\nSurat an-Nisa (Sura 4) is enoughfor you.\"\n\n\nMalik said, \"The\ngenerally agreed on way of doing things among us, in which there is no\ndispute, and which I saw the people of knowledge in our city doing, is\nthat the person who leaves neither parent or offspring can be of two\ntypes. As for the kind described in the ayat which was sent down at\nthe beginning of the Surat an-Nisa in which Allah, the Blessed, the\nExalted! said, 'If a man or a woman has no direct heir, but has a\nbrother or a sister by the mother, each of the two has a sixth. If\nthere are more than that, they share equally in a third.' (Sura 4 ayat\n12) This heirless one does not have heirs among his mother's siblings\nsince there are no children or parents. As for the other kind\ndescribed in the ayat which comes at the end of the Surat an-Nisa,\nAllah, the Blessed, the Exalted, said in it, 'They will ask you for a\ndecision. Say, \"Allah gives you a decision about the indirect heirs.\nIf a man perishes having no children, but he has a sister, she shall\nreceive a half of what he leaves, and he is her heir if she has no\nchildren. If there are two sisters, they shall receive two-thirds of\nwhat he leaves. If there are brothers and sisters, the male shall\nreceive the portion of two females. Allah makes clear to you that you\nmight not go astray. Allah has knowledge of everything\" ' \" (Sura 4\nayat 176).\n\n\nMalik said, \"If this person without direct heirs\n(parents) or children has siblings by the father, they inherit with\nthe grandfather from the person without direct heirs. The grandfather\ninherits with the siblings because he is more entitled to the\ninheritance than them. That is because he inherits a sixth with the\nmale children of the deceased when the siblings do not inherit\nanything with the male children of the deceased. How can he not be\nlike one of them when he takes a sixth with the children of the\ndeceased? How can he not take a third with the siblings while the\nbrother's sons take a third with them? The grandfather is the one who\novershadows the half-siblings by the mother and keeps them from\ninheriting. He is more entitled to what they have because they are\nomitted for his sake. If the grandfather did not take that third, the\nhalf-siblings by the mother would take it and would take what does not\nreturn to the half-siblings by the father. The half-siblings by the\nmother are more entitled to that third than the half-siblings by the\nfather while the grandfather is more entitled to that than the half-\nsiblings by the mother.\""}},{"id":14,"idInBook":14,"chapterId":27,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ حَنْظَلَةَ الزُّرَقِيِّ، أَنَّهُ أَخْبَرَهُ عَنْ مَوْلًى، لِقُرَيْشٍ كَانَ قَدِيمًا يُقَالُ لَهُ ابْنُ مِرْسَى أَنَّهُ قَالَ كُنْتُ جَالِسًا عِنْدَ عُمَرَ بْنِ الْخَطَّابِ فَلَمَّا صَلَّى الظُّهْرَ قَالَ يَا يَرْفَا هَلُمَّ ذَلِكَ الْكِتَابَ - لِكِتَابٍ كَتَبَهُ فِي شَأْنِ الْعَمَّةِ - فَنَسْأَلَ عَنْهَا وَنَسْتَخْبِرَ فِيهَا ‏.‏ فَأَتَاهُ بِهِ يَرْفَا فَدَعَا بِتَوْرٍ أَوْ قَدَحٍ فِيهِ مَاءٌ فَمَحَا ذَلِكَ الْكِتَابَ فِيهِ ثُمَّ قَالَ لَوْ رَضِيَكِ اللَّهُ وَارِثَةً أَقَرَّكِ لَوْ رَضِيَكِ اللَّهُ أَقَرَّكِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Muhammad ibn Abi Bakr ibn\nMuhammad ibn Amribn Hazm that Abdar-Rahman ibn Hanthala az-Zurqi was\ninformed by a mawla of Quraysh,who used to be known as Ibn Mursi, that\nhe was sitting with Umar ibn al-Khattab, and when they had prayed\ndhuhr, he said, \"Yarfa! Bring that letter! (a letter which he had\nwritten about the paternal aunt.) We asked about her and asked for\ninformation about her.\" Yarfa brought it to him. He called for a small\nvessel or a drinking-bowl in which there was water. He erased the\nletter in it. Then he said, \"Had Allah approved of you as an heir, we\nwould have confirmed you. Had Allah approved of you, we would have\nconfirmed you.\""}},{"id":15,"idInBook":15,"chapterId":27,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ أَبِي بَكْرِ بْنِ حَزْمٍ، أَنَّهُ سَمِعَ أَبَاهُ، كَثِيرًا يَقُولُ كَانَ عُمَرُ بْنُ الْخَطَّابِ يَقُولُ عَجَبًا لِلْعَمَّةِ تُورَثُ وَلاَ تَرِثُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Muhammad ibn Abi Bakr ibn\nHazm heard his father say many times, ''Umar ibn al-Khattab used to\nsay, 'It is a wonder that the paternal aunt is inherited from and does\nnot inherit.' \""}},{"id":16,"idInBook":16,"chapterId":27,"bookId":7,"arabic":"","english":{"narrator":"","text":"Malik said, \"The generally agreed on way of doing things among\nus, in which there is no dispute, and which I saw the people of\nknowledge in our city doing, about paternal relations is that full\nbrothers are more entitled to inherit than half-brothers by the father\nand half-brothers by the father are more entitled to inherit than the\nchildren of the full brothers. The sons of the full brothers are more\nentitled to inherit than the sons of the half-brothers by the father.\nThe sons of the half-brothers by the father are more entitled to\ninherit than the sons of the sons of the full brothers. The sons of\nthe sons of the half-brothers by the father's side are more entitled\nto inherit than the paternal uncle, the full brother of the father.\nThe paternal uncle, the full brother of the father, is more entitled\nto inherit than the paternal uncle, the half-brotherof the father on\nthe father's side. The paternal uncle, the half-brother of the father\non the father's side is more entitled to inherit than the sons of the\npaternal uncle, the full brother of the father. The son of the\npaternal uncle on the father's side is more entitled to inherit than\nthe paternal great uncle, the full brother of the paternal\ngrandfather.\"\n\n\nMalik said, \"Everything about which you are\nquestioned concerning the inheritance of the paternal relations is\nlike this. Trace the genealogy of the deceased and whoever among the\npaternal relations contends for inheritance. If you find that one of\nthem reaches the deceased by a father and none of them except him\nreaches him by a father, then make his inheritance to the one who\nreaches him by the nearest father, rather than the one who reaches him\nby what is above that. If you find that they all reach him by the same\nfather who joins them, then see who is the nearest of kin. If there is\nonly one half-brother by the father, give him the inheritance rather\nthan more distant paternal relations. If there is a full brother and\nyou find them equally related from a number of fathers or to one\nparticular father so that they all reach the genealogy of the deceased\nand they are all half-brothers by the father or full brothers, then\ndivide the inheritance equally among them. If the parent of one of\nthem is an uncle (the full-brother of the father of the deceased) and\nwhoever is with him is an uncle (the paternal half brother of the\nfather of the deceased), the inheritance goes to the sons of the full\nbrother of the father rather than the sons of the paternal half-\nbrother of the father. That is because Allah, the Blessed, the\nExalted, said, 'Those related by blood are nearer to one another in\nthe Book of Allah, surely Allah has knowledge of everything.' \"\n\n\nMalik said, \"The paternal grandfather, is more entitled to inherit\nthan sons of the full-brother, and more entitled than the uncle, the\nfull brother of the father. The son of the father's brother is more\nentitled to inherit from mawali retainers (freed slaves) than the\ngrandfathers.\""}},{"id":17,"idInBook":17,"chapterId":27,"bookId":7,"arabic":"","english":{"narrator":"","text":"Malik said, \"The generally agreed on way of doing things among us\nin which there is no dispute and which I saw the people of knowledge\nin our citydoing, is that the child of the half-sibling by the mother,\nthe paternal grandfather, the paternal uncle who is the maternal half-\nbrother of the father, the maternal uncle, the great-grandmother who\nis the mother of the mother's father, the daughter of the full-\nbrother, the paternal aunt, and the maternal aunt do not inherit\nanything by their kinship.\"\n\n\nMalik said, \"The woman who is the\nfurthest relation of the deceased of those who were named in this\nbook, does not inherit anything by her kinship, and women do not\ninherit anything apart from those that are named in the Qur'an. Allah,\nthe Blessed, the Exalted, mentioned in His Book the inheritance ofthe\nmother from her children, the inheritance of the daughters from their\nfather, the inheritance of the wife from her husband, the inheritance\nof the full sisters, the inheritance of the half-sisters by the father\nand the inheritance of the half-sisters by the mother. The grandmother\nis made an heir by the example of the Prophet, may Allah bless him and\ngrant him peace, made about her. A woman inherits from a slave she\nfrees herself because Allah, the Blessed, the Exalted, said in His\nBook, 'They are your brothers in the deen and your mawali.' \""}},{"id":18,"idInBook":18,"chapterId":27,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَلِيِّ بْنِ حُسَيْنِ بْنِ عَلِيٍّ، عَنْ عُمَرَ بْنِ عُثْمَانَ بْنِ عَفَّانَ، عَنْ أُسَامَةَ بْنِ زَيْدٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَرِثُ الْمُسْلِمُ الْكَافِرَ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Ali ibn\nHusayn ibn Ali from Umar ibn Uthman ibn Affan from Usama ibn Zayd that\nthe Messenger of Allah, may Allah bless him and grant him peace, said,\n\"A muslim does not inherit from a kafir.\""}},{"id":19,"idInBook":19,"chapterId":27,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَلِيِّ بْنِ حُسَيْنِ بْنِ عَلِيِّ بْنِ أَبِي طَالِبٍ، أَنَّهُ أَخْبَرَهُ إِنَّمَا، وَرِثَ أَبَا طَالِبٍ عَقِيلٌ وَطَالِبٌ وَلَمْ يَرِثْهُ عَلِيٌّ - قَالَ - فَلِذَلِكَ تَرَكْنَا نَصِيبَنَا مِنَ الشِّعْبِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab that Ali ibn\nHusayn ibn Ali ibn Abi Talib told him that Aqil and Talib inherited\nfrom Abu Talib, and Ali did not inheritfrom him. Ali said, \"Because of\nthat, we have given up our portion of ash Shab.\" (A house belonging to\nBanu Hashim)."}},{"id":20,"idInBook":20,"chapterId":27,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، أَنَّ مُحَمَّدَ بْنَ الأَشْعَثِ، أَخْبَرَهُ أَنَّ عَمَّةً لَهُ يَهُودِيَّةً أَوْ نَصْرَانِيَّةً تُوُفِّيَتْ وَأَنَّ مُحَمَّدَ بْنَ الأَشْعَثِ ذَكَرَ ذَلِكَ لِعُمَرَ بْنِ الْخَطَّابِ وَقَالَ لَهُ مَنْ يَرِثُهَا فَقَالَ لَهُ عُمَرُ بْنُ الْخَطَّابِ يَرِثُهَا أَهْلُ دِينِهَا ‏.‏ ثُمَّ أَتَى عُثْمَانَ بْنَ عَفَّانَ فَسَأَلَهُ عَنْ ذَلِكَ فَقَالَ لَهُ عُثْمَانُ أَتَرَانِي نَسِيتُ مَا قَالَ لَكَ عُمَرُ بْنُ الْخَطَّابِ يَرِثُهَا أَهْلُ دِينِهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said from Sulayman\nibn Yasar that Muhammad ibn al-Ashath told him that he had a christian\nor jewish paternal aunt who died. Muhammad ibn al-Ashath mentioned\nthat to Umar ibn al-Khattab and said to him, \"Who inherits from her?\"\nUmar ibn al-Khattab said to him, \"The people of her deen inherit from\nher.\" Then he went to Uthman ibn Affan, and asked him about that.\nUthman said to him, \"Do you think that I have forgotten what Umar ibn\nal-Khattab said to you? The people.of her deen inherit from her.\""}},{"id":21,"idInBook":21,"chapterId":27,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي حَكِيمٍ، أَنَّ نَصْرَانِيًّا، أَعْتَقَهُ عُمَرُ بْنُ عَبْدِ الْعَزِيزِ هَلَكَ - قَالَ إِسْمَاعِيلُ - فَأَمَرَنِي عُمَرُ بْنُ عَبْدِ الْعَزِيزِ أَنْ أَجْعَلَ مَالَهُ فِي بَيْتِ الْمَالِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said from Ismail\nibn Abi Hakim that Umar ibn Abd al-Aziz freed a christian who then\ndied. Ismail said, ''Umar ibn Abd al-Aziz ordered me to put his\nproperty in the bayt al-mal.\""}},{"id":22,"idInBook":22,"chapterId":27,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ الثِّقَةِ، عِنْدَهُ أَنَّهُ سَمِعَ سَعِيدَ بْنَ الْمُسَيَّبِ، يَقُولُ أَبَى عُمَرُ بْنُ الْخَطَّابِ أَنْ يُوَرِّثَ، أَحَدًا مِنَ الأَعَاجِمِ إِلاَّ أَحَدًا وُلِدَ فِي الْعَرَبِ ‏.‏ قَالَ مَالِكٌ وَإِنْ جَاءَتِ امْرَأَةٌ حَامِلٌ مِنْ أَرْضِ الْعَدُوِّ فَوَضَعَتْهُ فِي أَرْضِ الْعَرَبِ فَهُوَ وَلَدُهَا يَرِثُهَا إِنْ مَاتَتْ وَتَرِثُهُ إِنْ مَاتَ مِيرَاثَهَا فِي كِتَابِ اللَّهِ ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا وَالسُّنَّةُ الَّتِي لاَ اخْتِلاَفَ فِيهَا وَالَّذِي أَدْرَكْتُ عَلَيْهِ أَهْلَ الْعِلْمِ بِبَلَدِنَا أَنَّهُ لاَ يَرِثُ الْمُسْلِمُ الْكَافِرَ بِقَرَابَةٍ وَلاَ وَلاَءٍ وَلاَ رَحِمٍ وَلاَ يَحْجُبُ أَحَدًا عَنْ مِيرَاثِهِ ‏.‏ قَالَ مَالِكٌ وَكَذَلِكَ كُلُّ مَنْ لاَ يَرِثُ إِذَا لَمْ يَكُنْ دُونَهُ وَارِثٌ فَإِنَّهُ لاَ يَحْجُبُ أَحَدًا عَنْ مِيرَاثِهِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from a reliable source of his who\nhad heard Said ibn al-Musayyab say, ''Umar ibn al-Khattab refused to\nlet anyone inherit from the non-arabs except for one who was born\namong the arabs.\"\n\n\nMalik said, \"If a pregnant woman comes from\nthe land of the enemy and gives birth in arab land so that he is her\n(an arab) child, he inherits from her if she dies, and she inherits\nfrom him if he dies, by the Book of Allah.\"\n\n\nMalik said, \"The\ngenerally agreed on way of doing things among us and the sunna in\nwhich there is no dispute, and what I saw the people of knowledge in\nour city doing, is that a Muslim does not inherit from a kafir by\nkinship, clientage (wala'), or maternal relationship, nor does he (the\nMuslim) overshadow any (of the kafirs) from his inheritance.\n\n\nMalik said, \"Similarly, someone who forgoes his inheritance when he is\nthe chief heir does not overshadow anyone from his inheritance.\""}},{"id":23,"idInBook":23,"chapterId":27,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ غَيْرِ، وَاحِدٍ، مِنْ عُلَمَائِهِمْ ‏.‏ أَنَّهُ لَمْ يَتَوَارَثْ مَنْ قُتِلَ يَوْمَ الْجَمَلِ وَيَوْمَ صِفِّينَ وَيَوْمَ الْحَرَّةِ ثُمَّ كَانَ يَوْمَ قُدَيْدٍ فَلَمْ يُوَرَّثْ أَحَدٌ مِنْهُمْ مِنْ صَاحِبِهِ شَيْئًا إِلاَّ مَنْ عُلِمَ أَنَّهُ قُتِلَ قَبْلَ صَاحِبِهِ ‏.‏ قَالَ مَالِكٌ وَذَلِكَ الأَمْرُ الَّذِي لاَ اخْتِلاَفَ فِيهِ وَلاَ شَكَّ عِنْدَ أَحَدٍ مِنْ أَهْلِ الْعِلْمِ بِبَلَدِنَا وَكَذَلِكَ الْعَمَلُ فِي كُلِّ مُتَوَارِثَيْنِ هَلَكَا بِغَرَقٍ أَوْ قَتْلٍ أَوْ غَيْرِ ذَلِكَ مِنَ الْمَوْتِ إِذَا لَمْ يُعْلَمْ أَيُّهُمَا مَاتَ قَبْلَ صَاحِبِهِ لَمْ يَرِثْ أَحَدٌ مِنْهُمَا مِنْ صَاحِبِهِ شَيْئًا وَكَانَ مِيرَاثُهُمَا لِمَنْ بَقِيَ مِنْ وَرَثَتِهِمَا يَرِثُ كُلَّ وَاحِدٍ مِنْهُمَا وَرَثَتُهُ مِنَ الأَحْيَاءِ ‏.‏ وَقَالَ مَالِكٌ لاَ يَنْبَغِي أَنْ يَرِثَ أَحَدٌ أَحَدًا بِالشَّكِّ وَلاَ يَرِثُ أَحَدٌ أَحَدًا إِلاَّ بِالْيَقِينِ مِنَ الْعِلْمِ وَالشُّهَدَاءِ وَذَلِكَ أَنَّ الرَّجُلَ يَهْلِكُ هُوَ وَمَوْلاَهُ الَّذِي أَعْتَقَهُ أَبُوهُ فَيَقُولُ بَنُو الرَّجُلِ الْعَرَبِيِّ قَدْ وَرِثَهُ أَبُونَا فَلَيْسَ ذَلِكَ لَهُمْ أَنْ يَرِثُوهُ بِغَيْرِ عِلْمٍ وَلاَ شَهَادَةٍ إِنَّهُ مَاتَ قَبْلَهُ وَإِنَّمَا يَرِثُهُ أَوْلَى النَّاسِ بِهِ مِنَ الأَحْيَاءِ ‏.‏ قَالَ مَالِكٌ وَمِنْ ذَلِكَ أَيْضًا الأَخَوَانِ لِلأَبِ وَالأُمِّ يَمُوتَانِ وَلأَحَدِهِمَا وَلَدٌ وَالآخَرُ لاَ وَلَدَ لَهُ وَلَهُمَا أَخٌ لأَبِيهِمَا فَلاَ يُعْلَمُ أَيُّهُمَا مَاتَ قَبْلَ صَاحِبِهِ فَمِيرَاثُ الَّذِي لاَ وَلَدَ لَهُ لأَخِيهِ لأَبِيهِ وَلَيْسَ لِبَنِي أَخِيهِ لأَبِيهِ وَأُمِّهِ شَىْءٌ ‏.‏ قَالَ مَالِكٌ وَمِنْ ذَلِكَ أَيْضًا أَنْ تَهْلَكَ الْعَمَّةُ وَابْنُ أَخِيهَا أَوِ ابْنَةُ الأَخِ وَعَمُّهَا فَلاَ يُعْلَمُ أَيُّهُمَا مَاتَ قَبْلُ فَإِنْ لَمْ يُعْلَمْ أَيُّهُمَا مَاتَ قَبْلُ لَمْ يَرِثِ الْعَمُّ مِنِ ابْنَةِ أَخِيهِ شَيْئًا وَلاَ يَرِثُ ابْنُ الأَخِ مِنْ عَمَّتِهِ شَيْئًا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Rabia ibn Abi Abd ar-Rahman\nfrom more than one of the people of knowledge of that time, that those\nwho were killed on the Day of the Camel, the Day of Siffin, the Day of\nal-Harra, and the Day of Qudayd did not inherit from each other. None\nof them inherited anything from his companion unless it was known that\nhe had been killed before his companion.\n\n\nMalik said, \"That is\nthe way of doing things about which there is no dispute, and which\nnone of the people of knowledge in our city doubt. The procedure with\ntwo mutual heirs who are drowned, or killed in another way, when it is\nnot known which of them died first is the same - neither of them\ninherits anything from his companion. Their inheritance goes to\nwhoever remains of their heirs. They are inherited from by the\nliving.\"\n\n\nMalik said, \"No one should inherit from anyone else\nwhen there is doubt, and one should only inherit from the other when\nthere is certainty of knowledge and witnesses. That is because a man\nand his mawla whom his father has freed might die at the same time.\nThe sons of the free man could say, 'Our father inherited from the\nmawla.' They should not inherit from the mawla without knowledge or\ntestimony that he died first. The living people most entitled to his\nwala' inherit from him.\"\n\n\nMalik said, \"Another example is two\nfull brothers who die. One of them has children and the other does\nnot. They have a half-brother by their father. It is not known which\nof them died first, so the inheritance of the childless one goes to\nhis half-brother by the father. The children of the full-brother get\nnothing.\"\n\n\nMalik said, \"Another example is when a paternal\naunt and the son of her brother die, or else the daughter of the\nbrother and her paternal uncle. It is not known which of them died\nfirst. The paternal uncle does not inherit anything from the daughter\nof his brother, and the son of the brother does not inherit anything\nfrom his paternal aunt.\""}},{"id":24,"idInBook":24,"chapterId":27,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عُرْوَةَ بْنَ الزُّبَيْرِ، كَانَ يَقُولُ فِي وَلَدِ الْمُلاَعَنَةِ وَوَلَدِ الزِّنَا إِنَّهُ إِذَا مَاتَ وَرِثَتْهُ أُمُّهُ حَقَّهَا فِي كِتَابِ اللَّهِ عَزَّ وَجَلَّ وَإِخْوَتُهُ لأُمِّهِ حُقُوقَهُمْ وَيَرِثُ الْبَقِيَّةَ مَوَالِي أُمِّهِ إِنْ كَانَتْ مَوْلاَةً وَإِنْ كَانَتْ عَرَبِيَّةً وَرِثَتْ حَقَّهَا وَوَرِثَ إِخْوَتُهُ لأُمِّهِ حُقُوقَهُمْ وَكَانَ مَا بَقِيَ لِلْمُسْلِمِينَ ‏.‏ \n قَالَ مَالِكٌ وَبَلَغَنِي عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، مِثْلُ ذَلِكَ ‏.‏ قَالَ مَالِكٌ وَعَلَى ذَلِكَ أَدْرَكْتُ أَهْلَ الْعِلْمِ بِبَلَدِنَا ‏.","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Urwa ibn\naz-Zubayr said about the child of lian and the child of fornication,\nthat if they died, the mother inherited her right from them according\nto the Book of Allah, the Mighty, the Majestic! The siblings by the\nmother had their rights. The rest was inherited by the former masters\nof the mother if she was a freed slave. If she was a free woman by\norigin, she inherited her due and the siblings by the mother inherited\ntheir due, and the rest went to the Muslims.\n\n\nMalik said, \"I\nheard the same as that from Sulayman ibn Yasar.\"\n\n\nMalik said,\n\"That is what I saw the people of knowledge in our city doing.\""}}],"chapter":{"id":27,"bookId":7,"arabic":"كتاب الفرائض","english":"Fara'id"}}