{"metadata":{"length":61,"arabic":{"title":"موطأ مالك","author":"الإمام مالك بن أنس","introduction":"كتاب النكاح"},"english":{"title":"Muwatta Malik","author":"Imam Malik ibn Anas","introduction":"Marriage"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":28,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَخْطُبُ أَحَدُكُمْ عَلَى خِطْبَةِ أَخِيهِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Muhammad ibn Yahya ibn Habban\nfrom al-Araj from Abu Hurayra that the Messenger of Allah, may Allah\nbless him and grant him peace, said, \"Do not ask for a woman in\nmarriage when another muslim has already done so.\""}},{"id":2,"idInBook":2,"chapterId":28,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَخْطُبُ أَحَدُكُمْ عَلَى خِطْبَةِ أَخِيهِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat the Messenger of Allah, may Allah bless him and grant him peace,\nsaid, \"Do not ask for a woman in marriage when another muslim has\nalready done so.\"\n\n\nMalik said, \"The explanation of the\nstatement of the Messenger of Allah, may Allah bless him and grant him\npeace, according to what we think - and Allah knows best - is that 'Do\nnot ask for a woman in marriage when another muslim has already done\nso' means that when a man has asked for a woman in marriage, and she\nhas inclined to him and they have agreed on a bride-price, which she\nhas suggested and with which they are mutually satisfied, it is\nforbidden for another man to ask for that woman in marriage. It does\nnot mean that when a man has asked for a woman in marriage, and his\nsuit does not agree with her and she does not incline to him that no\none else can ask for her in marriage. That is a door to misery for\npeople.\""}},{"id":3,"idInBook":3,"chapterId":28,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، أَنَّهُ كَانَ يَقُولُ فِي قَوْلِ اللَّهِ تَبَارَكَ وَتَعَالَى ‏{‏وَلاَ جُنَاحَ عَلَيْكُمْ فِيمَا عَرَّضْتُمْ بِهِ مِنْ خِطْبَةِ النِّسَاءِ أَوْ أَكْنَنْتُمْ فِي أَنْفُسِكُمْ عَلِمَ اللَّهُ أَنَّكُمْ سَتَذْكُرُونَهُنَّ وَلَكِنْ لاَ تُوَاعِدُوهُنَّ سِرًّا إِلاَّ أَنْ تَقُولُوا قَوْلاً مَعْرُوفًا‏}‏ أَنْ يَقُولَ الرَّجُلُ لِلْمَرْأَةِ وَهِيَ فِي عِدَّتِهَا مِنْ وَفَاةِ زَوْجِهَا إِنَّكِ عَلَىَّ لَكَرِيمَةٌ وَإِنِّي فِيكِ لَرَاغِبٌ وَإِنَّ اللَّهَ لَسَائِقٌ إِلَيْكِ خَيْرًا وَرِزْقًا وَنَحْوَ هَذَا مِنَ الْقَوْلِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abd ar-Rahman ibn al-Qasim\nthat his father said about the word of Allah, the Blessed, the\nExalted, \"There is no fault in you about the proposal you offer to\nwomen, or hide in yourselves. Allah knows that you will be mindful of\nthem; but do not make troth with them secretly without honourable\nwords,\" (Sura 2 ayat 235) that it referred to a man saying to a woman\nwhile she was still in her idda after the death of her husband, \"You\nare dear to me, and I desire you, and Allah brings provision and\nblessing to you,\" and words such as these."}},{"id":4,"idInBook":4,"chapterId":28,"bookId":7,"arabic":"حَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ الْفَضْلِ، عَنْ نَافِعِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ الأَيِّمُ أَحَقُّ بِنَفْسِهَا مِنْ وَلِيِّهَا وَالْبِكْرُ تُسْتَأْذَنُ فِي نَفْسِهَا وَإِذْنُهَا صُمَاتُهَا ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me from Abdullah ibn al-Fadl from Nafi ibn\nJubayr ibn Mutim from Abdullah ibn Abbas that the Messenger of Allah,\nmay Allah bless him and grant him peace, said, \"A woman who has been\npreviously married is more entitled to her person than her guardian,\nand a virgin must be asked for her consent for herself, and her\nconsent is her silence \""}},{"id":5,"idInBook":5,"chapterId":28,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ قَالَ قَالَ عُمَرُ بْنُ الْخَطَّابِ لاَ تُنْكَحُ الْمَرْأَةُ إِلاَّ بِإِذْنِ وَلِيِّهَا أَوْ ذِي الرَّأْىِ مِنْ أَهْلِهَا أَوِ السُّلْطَانِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Said ibn\nal-Musayyab had said that Umar ibn al-Khattab said, \"A woman is only\nmarried with the consent of her guardian, someone of her family with\nsound judgement or the Sultan."}},{"id":6,"idInBook":6,"chapterId":28,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ الْقَاسِمَ بْنَ مُحَمَّدٍ، وَسَالِمَ بْنَ عَبْدِ اللَّهِ، كَانَا يُنْكِحَانِ بَنَاتِهِمَا الأَبْكَارَ وَلاَ يَسْتَأْمِرَانِهِنَّ ‏.‏ قَالَ مَالِكٌ وَذَلِكَ الأَمْرُ عِنْدَنَا فِي نِكَاحِ الأَبْكَارِ ‏.‏ قَالَ مَالِكٌ وَلَيْسَ لِلْبِكْرِ جَوَازٌ فِي مَالِهَا حَتَّى تَدْخُلَ بَيْتَهَا وَيُعْرَفَ مِنْ حَالِهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that al-Qasim\nibn Muhammad and Salim ibn Abdullah were marrying off their daughters\nand they did not consult them.\n\n\nMalik said, \"That is what is\ndone among us about the marriage of virgins.\"\n\n\nMalik said, \"A\nvirgin has no right to her property until she enters her house and her\nstate (competence, maturity etc.) is known for sure.\""}},{"id":7,"idInBook":7,"chapterId":28,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ الْقَاسِمَ بْنَ مُحَمَّدٍ، وَسَالِمَ بْنَ عَبْدِ اللَّهِ، وَسُلَيْمَانَ بْنَ يَسَارٍ، كَانُوا يَقُولُونَ فِي الْبِكْرِ يُزَوِّجُهَا أَبُوهَا بِغَيْرِ إِذْنِهَا إِنَّ ذَلِكَ لاَزِمٌ لَهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that al-Qasim\nibn Muhammad and Salim ibn Abdullah and Sulayman ibn Yasar said about\nthe virgin given by her father in marriage without her permission,\n\"That is binding on her.\""}},{"id":8,"idInBook":8,"chapterId":28,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي حَازِمِ بْنِ دِينَارٍ، عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ، ‏.‏ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم جَاءَتْهُ امْرَأَةٌ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّي قَدْ وَهَبْتُ نَفْسِي لَكَ فَقَامَتْ قِيَامًا طَوِيلاً فَقَامَ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ زَوِّجْنِيهَا إِنْ لَمْ تَكُنْ لَكَ بِهَا حَاجَةٌ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَلْ عِنْدَكَ مِنْ شَىْءٍ تُصْدِقُهَا إِيَّاهُ ‏\"‏ ‏.‏ فَقَالَ مَا عِنْدِي إِلاَّ إِزَارِي هَذَا ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنْ أَعْطَيْتَهَا إِيَّاهُ جَلَسْتَ لاَ إِزَارَ لَكَ فَالْتَمِسْ شَيْئًا ‏\"‏ ‏.‏ فَقَالَ مَا أَجِدُ شَيْئًا ‏.‏ قَالَ ‏\"‏ الْتَمِسْ وَلَوْ خَاتَمًا مِنْ حَدِيدٍ ‏\"‏ ‏.‏ فَالْتَمَسَ فَلَمْ يَجِدْ شَيْئًا ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَلْ مَعَكَ مِنَ الْقُرْآنِ شَىْءٌ ‏\"‏ ‏.‏ فَقَالَ نَعَمْ مَعِي سُورَةُ كَذَا وَسُورَةُ كَذَا ‏.‏ لِسُوَرٍ سَمَّاهَا ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ قَدْ أَنْكَحْتُكَهَا بِمَا مَعَكَ مِنَ الْقُرْآنِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Malik from Abu Hazim ibn\nDinar from Sahl ibn Sad as-Saidi that a woman came to the Messenger of\nAllah, may Allah bless him and grant him peace, and said, \"Messenger\nof Allah! I have given myself to you.\" She stood for a long time, and\nthen a man got up and said, \"Messenger of Allah, marry her to me if\nyou have no need of her.\" The Messenger of Allah, may Allah bless him\nand grant him peace, said, \"Do you have anything to give her as a\nbride-price?\" He said, \"I possess only this lower garment of mine.\"\nThe Messenger of Allah, may Allah bless him and grant him peace, said,\n\"If you give it to her you will not have a garment to wear so look for\nsomething else.\" He said, \"I have nothing else.\" He said, \"Look for\nsomething else, even if it is only an iron ring.\" He looked, and found\nthat he had nothing. The Messenger of Allah, may Allah bless him and\ngrant him peace, said, \"Do you know any of the Qur'an?\" He said, \"Yes.\nI know such-and-such a sura and such-and-such a sura,\" which he named.\nThe Messengerof Allah, may Allah bless him and grant him peace, said\nto him, \"I have married her to you for what you know of the Qur'an.\""}},{"id":9,"idInBook":9,"chapterId":28,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ قَالَ قَالَ عُمَرُ بْنُ الْخَطَّابِ أَيُّمَا رَجُلٍ تَزَوَّجَ امْرَأَةً وَبِهَا جُنُونٌ أَوْ جُذَامٌ أَوْ بَرَصٌ فَمَسَّهَا فَلَهَا صَدَاقُهَا كَامِلاً وَذَلِكَ لِزَوْجِهَا غُرْمٌ عَلَى وَلِيِّهَا ‏.‏ قَالَ مَالِكٌ وَإِنَّمَا يَكُونُ ذَلِكَ غُرْمًا عَلَى وَلِيِّهَا لِزَوْجِهَا إِذَا كَانَ وَلِيُّهَا الَّذِي أَنْكَحَهَا هُوَ أَبُوهَا أَوْ أَخُوهَا أَوْ مَنْ يُرَى أَنَّهُ يَعْلَمُ ذَلِكَ مِنْهَا فَأَمَّا إِذَا كَانَ وَلِيُّهَا الَّذِي أَنْكَحَهَا ابْنَ عَمٍّ أَوْ مَوْلًى أَوْ مِنَ الْعَشِيرَةِ مِمَّنْ يُرَى أَنَّهُ لاَ يَعْلَمُ ذَلِكَ مِنْهَا فَلَيْسَ عَلَيْهِ غُرْمٌ وَتَرُدُّ تِلْكَ الْمَرْأَةُ مَا أَخَذَتْهُ مِنْ صَدَاقِهَا وَيَتْرُكُ لَهَا قَدْرَ مَا تُسْتَحَلُّ بِهِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said that Said ibn\nal-Musayyab had said that Umar ibn al-Khattab said, \"If a man marries\na woman who is insane, or has leprosy or white leprosy, without being\ntold of her condition by her guardian, and he has sexual relations\nwith her, she keeps her bride-price in its entirety. Her husband has\ndamages against her guardian.\"\n\n\nMalik said, \"The husband has\ndamages against her guardian when the guardian is her father, brother,\nor one who is deemed to have knowledge of her condition. If the\nguardian who gives her in marriage is a nephew, a mawla or a member of\nher tribe who is not deemed to have knowledge of her condition, there\nare no damages against him, and the woman returns what she has taken\nof her bride-price, and the husband leaves her whatever amount is\nthought to be fair.\""}},{"id":10,"idInBook":10,"chapterId":28,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ ابْنَةَ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، - وَأُمُّهَا بِنْتُ زَيْدِ بْنِ الْخَطَّابِ - كَانَتْ تَحْتَ ابْنٍ لِعَبْدِ اللَّهِ بْنِ عُمَرَ فَمَاتَ وَلَمْ يَدْخُلْ بِهَا وَلَمْ يُسَمِّ لَهَا صَدَاقًا فَابْتَغَتْ أُمُّهَا صَدَاقَهَا فَقَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ لَيْسَ لَهَا صَدَاقٌ وَلَوْ كَانَ لَهَا صَدَاقٌ لَمْ نُمْسِكْهُ وَلَمْ نَظْلِمْهَا ‏.‏ فَأَبَتْ أُمُّهَا أَنْ تَقْبَلَ ذَلِكَ فَجَعَلُوا بَيْنَهُمْ زَيْدَ بْنَ ثَابِتٍ فَقَضَى أَنْ لاَ صَدَاقَ لَهَا وَلَهَا الْمِيرَاثُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that the daughter of\nUbaydullah ibn Umar whose mother was the daughter of Zayd ibn al-\nKhattab, married the son of Abdullah ibn Umar. He died and had not yet\nconsummated the marriage or specified her bride-price. Her mother\nwanted the bride-price, and Abdullah ibn Umar said, \"She is not\nentitled to a bride-price. Had she been entitled to a bride-price, we\nwould not have kept it and we would not do her an injustice. \"The\nmother refused to accept that. Zayd ibn Thabit was brought to\nadjudicate between them and he decided that she had no bride-price,\nbut that she did inherit."}},{"id":11,"idInBook":11,"chapterId":28,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ، كَتَبَ فِي خِلاَفَتِهِ إِلَى بَعْضِ عُمَّالِهِ أَنَّ كُلَّ مَا اشْتَرَطَ الْمُنْكِحُ - مَنْ كَانَ أَبًا أَوْ غَيْرَهُ - مِنْ حِبَاءٍ أَوْ كَرَامَةٍ فَهُوَ لِلْمَرْأَةِ إِنِ ابْتَغَتْهُ ‏.‏ قَالَ مَالِكٌ فِي الْمَرْأَةِ يُنْكِحُهَا أَبُوهَا وَيَشْتَرِطُ فِي صَدَاقِهَا الْحِبَاءَ يُحْبَى بِهِ إِنَّ مَا كَانَ مِنْ شَرْطٍ يَقَعُ بِهِ النِّكَاحُ فَهُوَ لاِبْنَتِهِ إِنِ ابْتَغَتْهُ وَإِنْ فَارَقَهَا زَوْجُهَا قَبْلَ أَنْ يَدْخُلَ بِهَا فَلِزَوْجِهَا شَطْرُ الْحِبَاءِ الَّذِي وَقَعَ بِهِ النِّكَاحُ ‏.‏ قَالَ مَالِكٌ فِي الرَّجُلِ يُزَوِّجُ ابْنَهُ صَغِيرًا لاَ مَالَ لَهُ إِنَّ الصَّدَاقَ عَلَى أَبِيهِ إِذَا كَانَ الْغُلاَمُ يَوْمَ تَزَوَّجَ لاَ مَالَ لَهُ وَإِنْ كَانَ لِلْغُلاَمِ مَالٌ فَالصَّدَاقُ فِي مَالِ الْغُلاَمِ إِلاَّ أَنْ يُسَمِّيَ الأَبُ أَنَّ الصَّدَاقَ عَلَيْهِ وَذَلِكَ النِّكَاحُ ثَابِتٌ عَلَى الاِبْنِ إِذَا كَانَ صَغِيرًا وَكَانَ فِي وِلاَيَةِ أَبِيهِ ‏.‏ قَالَ مَالِكٌ فِي طَلاَقِ الرَّجُلِ امْرَأَتَهُ قَبْلَ أَنْ يَدْخُلَ بِهَا وَهِيَ بِكْرٌ فَيَعْفُوَ أَبُوهَا عَنْ نِصْفِ الصَّدَاقِ إِنَّ ذَلِكَ جَائِزٌ لِزَوْجِهَا مِنْ أَبِيهَا فِيمَا وَضَعَ عَنْهُ ‏.‏ قَالَ مَالِكٌ وَذَلِكَ أَنَّ اللَّهَ تَبَارَكَ وَتَعَالَى قَالَ فِي كِتَابِهِ ‏{‏إِلاَّ أَنْ يَعْفُونَ‏}‏ فَهُنَّ النِّسَاءُ اللاَّتِي قَدْ دُخِلَ بِهِنَّ ‏{‏أَوْ يَعْفُوَ الَّذِي بِيَدِهِ عُقْدَةُ النِّكَاحِ‏}‏ فَهُوَ الأَبُ فِي ابْنَتِهِ الْبِكْرِ وَالسَّيِّدُ فِي أَمَتِهِ ‏.‏ قَالَ مَالِكٌ وَهَذَا الَّذِي سَمِعْتُ فِي ذَلِكَ وَالَّذِي عَلَيْهِ الأَمْرُ عِنْدَنَا ‏.‏ قَالَ مَالِكٌ فِي الْيَهُودِيَّةِ أَوِ النَّصْرَانِيَّةِ تَحْتَ الْيَهُودِيِّ أَوِ النَّصْرَانِيِّ فَتُسْلِمُ قَبْلَ أَنْ يَدْخُلَ بِهَا أَنَّهُ لاَ صَدَاقَ لَهَا ‏.‏ قَالَ مَالِكٌ لاَ أَرَى أَنْ تُنْكَحَ الْمَرْأَةُ بِأَقَلَّ مِنْ رُبْعِ دِينَارٍ وَذَلِكَ أَدْنَى مَا يَجِبُ فِيهِ الْقَطْعُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Umar ibn\nAbd al-Aziz during his khalifate, wrote to one of his governors,\n\"Whatever a father, or guardian, who gives someone in marriage, makes\na condition in the way of unreturnable gift or of favour, belongs to\nthe woman if she wants it.\"\n\n\nMalik spoke about a woman whose\nfather gave her in marriage and made an unreturnable gift a condition\nof the bride-price which was to be given. He said, \"Whatever is given\nas a condition by which marriage occurs belongs to the woman if she\nwants it. If the husband parts from her before the marriage is\nconsummated, the husband has half of the unreturnable gift by which\nthe marriage occurred.\"\n\n\nMalik said about a man who married\noff his young son and the son had no wealth at all, that the bride-\nprice was obliged of the father if the young man had no property on\nthe day of marriage. If the young man did have property the bride-\nprice was taken from his property unless the father stipulated that he\nwould pay the bride-price. The marriage was affirmed for the son if he\nwas a minor only if he was under the guardianship of his father.\n\n\nMalik said that if a man divorced his wife before he had\nconsummated the marriage and she was a virgin, her father returned\nhalf of the bride-price to him. That half was permitted to the husband\nfrom the father to compensate him for his expenses.\n\n\nMalik\nsaid that that was because Allah, the Blessed, the Exalted, said in\nHis Book, \"Unless they (women with whom he had not consummated\nmarriage) make remission or he makes remission to him in whose hand is\nthe knot of marriage.\" (Sura 2 ayat 237). (He being the father of a\nvirgin daughter or the master of a female slave.)\n\n\nMalik said,\n\"That is what I have heard about the matter, and that is how things\nare done among us.\"\n\n\nMalik said that a jewish or christian\nwoman who was married to a jew or christian and then became muslim\nbefore the marriage had been consummated, did not keep anything from\nthe bride-price.\n\n\nMalik said, \"I do not think that women\nshould be married for less than a quarter of a dinar. That is the\nlowest amount for which cutting off the hand is obliged .\""}},{"id":12,"idInBook":12,"chapterId":28,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَضَى فِي الْمَرْأَةِ إِذَا تَزَوَّجَهَا الرَّجُلُ أَنَّهُ إِذَا أُرْخِيَتِ السُّتُورُ فَقَدْ وَجَبَ الصَّدَاقُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said from Said ibn\nal-Musayyab that 'Umar ibn al-Khattab decided about the woman who was\nmarried by a man and the marriage had been consummated, that the\nbride-price was obligatory."}},{"id":13,"idInBook":13,"chapterId":28,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ زَيْدَ بْنَ ثَابِتٍ، كَانَ يَقُولُ إِذَا دَخَلَ الرَّجُلُ بِامْرَأَتِهِ فَأُرْخِيَتْ عَلَيْهِمَا السُّتُورُ فَقَدْ وَجَبَ الصَّدَاقُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab that Zayd ibn\nThabit said, \"When a man takes his wife to his house and co-habits\nwith her then the bride-price is obliged.\""}},{"id":14,"idInBook":14,"chapterId":28,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ سَعِيدَ بْنَ الْمُسَيَّبِ، كَانَ يَقُولُ إِذَا دَخَلَ الرَّجُلُ بِالْمَرْأَةِ فِي بَيْتِهَا صُدِّقَ الرَّجُلُ عَلَيْهَا وَإِذَا دَخَلَتْ عَلَيْهِ فِي بَيْتِهِ صُدِّقَتْ عَلَيْهِ ‏.‏ قَالَ مَالِكٌ أَرَى ذَلِكَ فِي الْمَسِيسِ إِذَا دَخَلَ عَلَيْهَا فِي بَيْتِهَا فَقَالَتْ قَدْ مَسَّنِي وَقَالَ لَمْ أَمَسَّهَا صُدِّقَ عَلَيْهَا فَإِنْ دَخَلَتْ عَلَيْهِ فِي بَيْتِهِ فَقَالَ لَمْ أَمَسَّهَا وَقَالَتْ قَدْ مَسَّنِي صُدِّقَتْ عَلَيْهِ ‏.‏","english":{"narrator":"","text":"Yahya related to\nme from Malik that he had heard that Said ibn al-Musayyab said, \"When\na man comes to his wife in her room, he is believed. When she comes to\nhim in his room, she is believed.\"\n\n\nMalik commented, \"I think\nthat this refers to sexual intercourse. When he comes in to her in her\nroom and she says, 'He has had intercourse with me' and he says, 'I\nhave not touched her', he is believed. When she comes in to him in his\nroom and he says, 'I have not had intercourse with her' and she says,\n'He had intercourse with me', she is believed.\""}},{"id":15,"idInBook":15,"chapterId":28,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ الْمَخْزُومِيِّ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم حِينَ تَزَوَّجَ أُمَّ سَلَمَةَ وَأَصْبَحَتْ عِنْدَهُ قَالَ لَهَا ‏\n\"‏ لَيْسَ بِكِ عَلَى أَهْلِكِ هَوَانٌ إِنْ شِئْتِ سَبَّعْتُ عِنْدَكِ وَسَبَّعْتُ عِنْدَهُنَّ وَإِنْ شِئْتِ ثَلَّثْتُ عِنْدَكِ وَدُرْتُ ‏\"‏ ‏.‏ فَقَالَتْ ثَلِّثْ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abdullah ibn Abi Bakr ibn\nMuhammad ibn Amr ibn Hazm from Abd al-Malik ibn Abi Bakr ibn Abd ar-\nRahman ibn al-Harith ibn Hisham al-Makhzumi from his father that when\nthe Messenger of Allah, may Allah bless him and grant him peace,\nmarried Umm Salama and then spent the night with her, he said to her,\n\"You are not being humbled in your right. If you wish, I will stay\nwith you for seven nights as I stayed seven nights with the others. If\nyou wish, I will stay with you for three nights, and then visit the\nothers in turn.\" She said, \"Stay three nights.\""}},{"id":16,"idInBook":16,"chapterId":28,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ حُمَيْدٍ الطَّوِيلِ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّهُ كَانَ يَقُولُ لِلْبِكْرِ سَبْعٌ وَلِلثَّيِّبِ ثَلاَثٌ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Humayd at-Tawil that Anas ibn\nMalik said, \"A virgin has seven nights, and a woman who has been\npreviously married has three nights.\"\n\n\nMalik affirmed, \"That\nis what is done among us.\"\n\n\nMalik added, \"If the man has\nanother wife, he divides his time equally between them after the\nwedding nights. He does not count the wedding nights against the one\nhe has just married.\""}},{"id":17,"idInBook":17,"chapterId":28,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ سَعِيدَ بْنَ الْمُسَيَّبِ، سُئِلَ عَنِ الْمَرْأَةِ، تَشْتَرِطُ عَلَى زَوْجِهَا أَنَّهُ لاَ يَخْرُجُ بِهَا مِنْ بَلَدِهَا فَقَالَ سَعِيدُ بْنُ الْمُسَيَّبِ يَخْرُجُ بِهَا إِنْ شَاءَ ‏.‏ قَالَ مَالِكٌ فَالأَمْرُ عِنْدَنَا ذَلِكَ أَنَّهُ إِذَا شَرَطَ الرَّجُلُ لِلْمَرْأَةِ وَإِنْ كَانَ ذَلِكَ عِنْدَ عُقْدَةِ النِّكَاحِ أَنْ لاَ أَنْكِحَ عَلَيْكِ وَلاَ أَتَسَرَّرَ إِنَّ ذَلِكَ لَيْسَ بِشَىْءٍ إِلاَّ أَنْ يَكُونَ فِي ذَلِكَ يَمِينٌ بِطَلاَقٍ أَوْ عِتَاقَةٍ فَيَجِبُ ذَلِكَ عَلَيْهِ وَيَلْزَمُهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Said ibn\nal-Musayyab was asked about a woman who made a stipulation on her\nhusband not to take her away from her town. Said ibn al-Musayyab said,\n\"He takes her away if he wishes.\"\n\n\nMalik said, \"The custom\namong us is that when a man marries a woman, and he makes a condition\nin the marriage contract that he will not marry after her or take a\nconcubine, it means nothing unless there is an oath of divorce or\nsetting-free attached to it. Then it is obliged and required of him.\""}},{"id":18,"idInBook":18,"chapterId":28,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ الْمِسْوَرِ بْنِ رِفَاعَةَ الْقُرَظِيِّ، عَنِ الزُّبَيْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الزَّبِيرِ، أَنَّ رِفَاعَةَ بْنَ سِمْوَالٍ، طَلَّقَ امْرَأَتَهُ تَمِيمَةَ بِنْتَ وَهْبٍ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم ثَلاَثًا فَنَكَحَتْ عَبْدَ الرَّحْمَنِ بْنَ الزَّبِيرِ فَاعْتَرَضَ عَنْهَا فَلَمْ يَسْتَطِعْ أَنْ يَمَسَّهَا فَفَارَقَهَا فَأَرَادَ رِفَاعَةُ أَنْ يَنْكِحَهَا - وَهُوَ زَوْجُهَا الأَوَّلُ الَّذِي كَانَ طَلَّقَهَا - فَذَكَرَ ذَلِكَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَنَهَاهُ عَنْ تَزْوِيجِهَا وَقَالَ ‏\n\"‏ لاَ تَحِلُّ لَكَ حَتَّى تَذُوقَ الْعُسَيْلَةَ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from al-Miswar ibn Rifaa al-\nQuradhi from az-Zubayr ibn Abd ar-Rahman ibn az-Zubayr that Rifaa ibn\nSimwal divorced his wife, Tamima bint Wahb, in the time of the\nMessenger of Allah, may Allah bless him and grant him peace, three\ntimes. Then she married Abd ar-Rahman ibn az-Zubayr and he turned from\nher and could not consummate the marriage and so he parted from her.\nRifaa wanted to marry her again and it was mentioned to the Messenger\nof Allah, may Allah bless him and grant him peace, and he forbade him\nto marry her. He said, \"She is not halal for you until she has tasted\nthe sweetness of intercourse.\""}},{"id":19,"idInBook":19,"chapterId":28,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا سُئِلَتْ عَنْ رَجُلٍ طَلَّقَ امْرَأَتَهُ الْبَتَّةَ فَتَزَوَّجَهَا بَعْدَهُ رَجُلٌ آخَرُ فَطَلَّقَهَا قَبْلَ أَنْ يَمَسَّهَا هَلْ يَصْلُحُ لِزَوْجِهَا الأَوَّلِ أَنْ يَتَزَوَّجَهَا فَقَالَتْ عَائِشَةُ لاَ حَتَّى يَذُوقَ عُسَيْلَتَهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said from al-Qasim\nibn Muhammad that A'isha, the wife of the Prophet, may Allah bless him\nand grant him peace, said when asked whether it was permissible for a\nman to marry again a wife he had divorced irrevocably if she had\nmarried another man who divorced her before consummating the marriage,\n\"Not until she has tasted the sweetness of intercourse.\""}},{"id":20,"idInBook":20,"chapterId":28,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ الْقَاسِمَ بْنَ مُحَمَّدٍ، سُئِلَ عَنْ رَجُلٍ، طَلَّقَ امْرَأَتَهُ الْبَتَّةَ ثُمَّ تَزَوَّجَهَا بَعْدَهُ رَجُلٌ آخَرُ فَمَاتَ عَنْهَا قَبْلَ أَنْ يَمَسَّهَا هَلْ يَحِلُّ لِزَوْجِهَا الأَوَّلِ أَنْ يُرَاجِعَهَا فَقَالَ الْقَاسِمُ بْنُ مُحَمَّدٍ لاَ يَحِلُّ لِزَوْجِهَا الأَوَّلِ أَنْ يُرَاجِعَهَا ‏.‏ قَالَ مَالِكٌ فِي الْمُحَلِّلِ إِنَّهُ لاَ يُقِيمُ عَلَى نِكَاحِهِ ذَلِكَ حَتَّى يَسْتَقْبِلَ نِكَاحًا جَدِيدًا فَإِنْ أَصَابَهَا فِي ذَلِكَ فَلَهَا مَهْرُهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that when asked\nwhether it was permissible for a man to return to his wife if he had\ndivorced her irrevocably and then another man had married her after\nhim and died before consummating the marriage, al-Qasim ibn Muhammad\nsaid, \"It is not halal for the first husband to return to her.\"\n\n\nMalik said, about the muhallil, that he could not remain in the\nmarriage until he undertook a new marriage. If he had intercourse with\nher in that marriage, she had her dowry."}},{"id":21,"idInBook":21,"chapterId":28,"bookId":7,"arabic":"وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يُجْمَعُ بَيْنَ الْمَرْأَةِ وَعَمَّتِهَا وَلاَ بَيْنَ الْمَرْأَةِ وَخَالَتِهَا ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'z-Zinad from al-Araj from\nAbu Hurayra that the Messenger of Allah, may Allah bless him and grant\nhim peace, said \"One cannot be married to a woman and her paternal\naunt, or a woman and her maternal aunt at the same time.\""}},{"id":22,"idInBook":22,"chapterId":28,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ كَانَ يَقُولُ يُنْهَى أَنْ تُنْكَحَ الْمَرْأَةُ عَلَى عَمَّتِهَا أَوْ عَلَى خَالَتِهَا وَأَنْ يَطَأَ الرَّجُلُ وَلِيدَةً وَفِي بَطْنِهَا جَنِينٌ لِغَيْرِهِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said that Said ibn\nal-Musayyab said, \"It is forbidden to be married to a woman and her\npaternal or maternal aunt at the same time, and for a man to have\nintercourse with a female slave who is carrying another man's child.\""}},{"id":23,"idInBook":23,"chapterId":28,"bookId":7,"arabic":"وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ قَالَ سُئِلَ زَيْدُ بْنُ ثَابِتٍ عَنْ رَجُلٍ، تَزَوَّجَ امْرَأَةً ثُمَّ فَارَقَهَا قَبْلَ أَنْ يُصِيبَهَا هَلْ تَحِلُّ لَهُ أُمُّهَا فَقَالَ زَيْدُ بْنُ ثَابِتٍ لاَ الأُمُّ مُبْهَمَةٌ لَيْسَ فِيهَا شَرْطٌ وَإِنَّمَا الشَّرْطُ فِي الرَّبَائِبِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said that Zayd ibn\nThabit asked whether it was halal for a man who married a woman and\nthen separated from her before he had cohabited with her, to marry her\nmother. Zayd ibn Thabit said, \"No. The mother is prohibited\nunconditionally. There are conditions, however about foster-mothers.\""}},{"id":24,"idInBook":24,"chapterId":28,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ غَيْرِ، وَاحِدٍ، أَنَّ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ، اسْتُفْتِيَ وَهُوَ بِالْكُوفَةِ عَنْ نِكَاحِ الأُمِّ، بَعْدَ الاِبْنَةِ إِذَا لَمْ تَكُنْ الاِبْنَةُ مُسَّتْ فَأَرْخَصَ فِي ذَلِكَ ثُمَّ إِنَّ ابْنَ مَسْعُودٍ قَدِمَ الْمَدِينَةَ فَسَأَلَ عَنْ ذَلِكَ فَأُخْبِرَ أَنَّهُ لَيْسَ كَمَا قَالَ وَإِنَّمَا الشَّرْطُ فِي الرَّبَائِبِ فَرَجَعَ ابْنُ مَسْعُودٍ إِلَى الْكُوفَةِ فَلَمْ يَصِلْ إِلَى مَنْزِلِهِ حَتَّى أَتَى الرَّجُلَ الَّذِي أَفْتَاهُ بِذَلِكَ فَأَمَرَهُ أَنْ يُفَارِقَ امْرَأَتَهُ ‏.‏ قَالَ مَالِكٌ فِي الرَّجُلِ تَكُونُ تَحْتَهُ الْمَرْأَةُ ثُمَّ يَنْكِحُ أُمَّهَا فَيُصِيبُهَا إِنَّهَا تَحْرُمُ عَلَيْهِ امْرَأَتُهُ وَيُفَارِقُهُمَا جَمِيعًا وَيَحْرُمَانِ عَلَيْهِ أَبَدًا إِذَا كَانَ قَدْ أَصَابَ الأُمَّ فَإِنْ لَمْ يُصِبِ الأُمَّ لَمْ تَحْرُمْ عَلَيْهِ امْرَأَتُهُ وَفَارَقَ الأُمَّ ‏.‏ وَقَالَ مَالِكٌ فِي الرَّجُلِ يَتَزَوَّجُ الْمَرْأَةَ ثُمَّ يَنْكِحُ أُمَّهَا فَيُصِيبُهَا إِنَّهُ لاَ تَحِلُّ لَهُ أُمُّهَا أَبَدًا وَلاَ تَحِلُّ لأَبِيهِ وَلاَ لاِبْنِهِ وَلاَ تَحِلُّ لَهُ ابْنَتُهَا وَتَحْرُمُ عَلَيْهِ امْرَأَتُهُ ‏.‏ قَالَ مَالِكٌ فَأَمَّا الزِّنَا فَإِنَّهُ لاَ يُحَرِّمُ شَيْئًا مِنْ ذَلِكَ لأَنَّ اللَّهَ تَبَارَكَ وَتَعَالَى قَالَ ‏{‏وَأُمَّهَاتُ نِسَائِكُمْ‏}‏ فَإِنَّمَا حَرَّمَ مَا كَانَ تَزْوِيجًا وَلَمْ يَذْكُرْ تَحْرِيمَ الزِّنَا فَكُلُّ تَزْوِيجٍ كَانَ عَلَى وَجْهِ الْحَلاَلِ يُصِيبُ صَاحِبُهُ امْرَأَتَهُ فَهُوَ بِمَنْزِلَةِ التَّزْوِيجِ الْحَلاَلِ فَهَذَا الَّذِي سَمِعْتُ وَالَّذِي عَلَيْهِ أَمْرُ النَّاسِ عِنْدَنَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from more than one source that\nwhen Abdullah ibn Masud was in Kufa, he was asked for an opinion about\nmarrying the mother after marrying the daughter when the marriage with\nthe daughter had not been consummated. He permitted it. When Ibn Masud\ncame to Madina, he asked about it and was told that it was not as he\nhad said, and that this condition referred to foster-mothers. Ibn\nMasud returnedto Kufa,and he had just reached his dwelling when the\nman who had asked him for the opinion came to visit and he ordered him\nto separate from his wife.\n\n\nMalik said that if a man married\nthe mother of a woman who was his wife and he had sexual relations\nwith the mother then his wife was haram for him, and he had to\nseparate from both of them. They were both haram to him forever, if he\nhad had sexual relations with the mother. If he had not had relations\nwith the mcther, his wife was not haram for him, and he separated from\nthe mother.\n\n\nMalik explained further about the man who married\na woman, and then married her mother and cohabited with her, \"The\nmother will never be halal for him, and she is not halal for his\nfather or his son, and any daughters of hers are not halal for him and\nso his wife is haram for him.\"\n\n\nMalik said, \"Fornication\nhowever, does not make any of that haram because Allah, the Blessed,\nthe Exalted, mentioned 'the mothers of your wives,' as one whom\nmarriage made haram, and he didn't mention the making haram by\nfornication. Every marriage in a halal manner in which a man cohabits\nwith his wife, is a halal marriage. This is what I have heard, and\nthis is how things are done among us.\""}},{"id":25,"idInBook":25,"chapterId":28,"bookId":7,"arabic":"","english":{"narrator":"","text":"Malik said that a man who had committed fornication with a woman\nand the hadd-punishment had been applied to him for it, could marry\nthat woman's daughter and his son could marry the woman herself if he\nwished. That was because he had haram relations with her, and the\nrelations Allah had made haram were from the relations made in a halal\nmanner or in a manner resembling marriage. Allah, the Blessed, the\nExalted, said, \"Do not marry the women your fathers have married. \"\n(Sura 4 ayat 21)\n\n\nMalik said, \"If a man were to marry a woman\nin her idda-period in a halal marriage and have relations with her, it\nwould be haram for his son to marry the woman. That is because the\nfather married her in a halal manner, and the hadd-punishment would\nnot have been applied to him. Any child who was born to him would be\nattached to him as the father. Just as it would be haram for the son\nto marry a woman whom his father had married in her idda-period and\nhad relations with, so the woman's daughter would be haram for the\nfather if he had had sexual relations with her.\""}},{"id":26,"idInBook":26,"chapterId":28,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الشِّغَارِ وَالشِّغَارُ أَنْ يُزَوِّجَ الرَّجُلُ ابْنَتَهُ عَلَى أَنْ يُزَوِّجَهُ الآخَرُ ابْنَتَهُ لَيْسَ بَيْنَهُمَا صَدَاقٌ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat the Messenger of Allah, may Allah bless him and grant him peace,\nforbade shighar, which meant one man giving his daughter in marriage\nto another man on the condition that the other gave his daughter to\nhim in marriage without either of them paying the bride-price."}},{"id":27,"idInBook":27,"chapterId":28,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَبْدِ الرَّحْمَنِ، وَمُجَمِّعٍ، ابْنَىْ يَزِيدَ بْنِ جَارِيَةَ الأَنْصَارِيِّ عَنْ خَنْسَاءَ بِنْتِ خِدَامٍ الأَنْصَارِيَّةِ، أَنَّ أَبَاهَا، زَوَّجَهَا وَهِيَ ثَيِّبٌ فَكَرِهَتْ ذَلِكَ فَأَتَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم فَرَدَّ نِكَاحَهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abd ar-Rahman ibn al-Qasim\nfrom his father from Abd ar-Rahman and Mujamma the sons of Yazid ibn\nJariya al-Ansari from Khansa bint Khidam al-Ansariya that her father\ngave her in marriage and she had been previously married. She\ndisapproved of that, and went to the Messenger of Allah, may Allah\nbless him and grant him peace, and he revoked the marriage."}},{"id":28,"idInBook":28,"chapterId":28,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزُّبَيْرِ الْمَكِّيِّ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، أُتِيَ بِنِكَاحٍ لَمْ يَشْهَدْ عَلَيْهِ إِلاَّ رَجُلٌ وَامْرَأَةٌ فَقَالَ هَذَا نِكَاحُ السِّرِّ وَلاَ أُجِيزُهُ وَلَوْ كُنْتُ تَقَدَّمْتُ فِيهِ لَرَجَمْتُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'z-Zubayr al-Makki that a\ncase was brought to Umar about a marriage which had only been\nwitnessed by one man and one woman . He said, \"This is a secret\nmarriage and I do not permit it. Had I been the first to come upon it,\nI would have ordered them to be stoned.\""}},{"id":29,"idInBook":29,"chapterId":28,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، وَعَنْ سُلَيْمَانَ بْنِ يَسَارٍ، أَنَّ طُلَيْحَةَ الأَسَدِيَّةَ، كَانَتْ تَحْتَ رُشَيْدٍ الثَّقَفِيِّ فَطَلَّقَهَا فَنَكَحَتْ فِي عِدَّتِهَا فَضَرَبَهَا عُمَرُ بْنُ الْخَطَّابِ وَضَرَبَ زَوْجَهَا بِالْمِخْفَقَةِ ضَرَبَاتٍ وَفَرَّقَ بَيْنَهُمَا ثُمَّ قَالَ عُمَرُ بْنُ الْخَطَّابِ أَيُّمَا امْرَأَةٍ نَكَحَتْ فِي عِدَّتِهَا فَإِنْ كَانَ زَوْجُهَا الَّذِي تَزَوَّجَهَا لَمْ يَدْخُلْ بِهَا فُرِّقَ بَيْنَهُمَا ثُمَّ اعْتَدَّتْ بَقِيَّةَ عِدَّتِهَا مِنْ زَوْجِهَا الأَوَّلِ ثُمَّ كَانَ الآخَرُ خَاطِبًا مِنَ الْخُطَّابِ وَإِنْ كَانَ دَخَلَ بِهَا فُرِّقَ بَيْنَهُمَا ثُمَّ اعْتَدَّتْ بَقِيَّةَ عِدَّتِهَا مِنَ الأَوَّلِ ثُمَّ اعْتَدَّتْ مِنَ الآخَرِ ثُمَّ لاَ يَجْتَمِعَانِ أَبَدًا ‏.‏ قَالَ","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Said ibn al-\nMusayyab and from Sulayman ibn Yasar that Tulayha al-Asadiya was the\nwife of Rushayd ath-Thaqafi. He divorced her, and she got married in\nher idda-period. Umar ibn al-Khattab beat her and her husband with a\nstick several times, and separated them. Then Umar ibn al-Khattab\nsaid, \"If a woman marries in her idda-period, and the new husband has\nnot consummated the marriage, then separate them, and when she has\ncompleted the idda of her first husband, the other becomes a suitor.\nIf he has consummated the marriage then separate them. Then she must\ncomplete her idda from her first husband, and then the idda from the\nother one, and they are never to be reunited.\"\n\n\nMalik added,\n''Said ibn al-Musayyab said that she had her dowry because he had\nconsummated the marriage.\"\n\n\nMalik said,\"The practice with us\nconcerning a free woman whose husband dies, is that she does an idda\nof four months and ten days and she does not marry if she doubts her\nperiod until she is free of any doubt or if she fears that she is\npregnant.\""}},{"id":30,"idInBook":30,"chapterId":28,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، وَعَبْدَ اللَّهِ بْنَ عُمَرُ، سُئِلاَ عَنْ رَجُلٍ، كَانَتْ تَحْتَهُ امْرَأَةٌ حُرَّةٌ فَأَرَادَ أَنْ يَنْكِحَ عَلَيْهَا أَمَةً فَكَرِهَا أَنْ يَجْمَعَ بَيْنَهُمَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Abdullah\nibn Abbas and Abdullah ibn Umar were asked about a man who had a free\nwoman as a wife and then wanted to marry a slave-girl. They\ndisapproved that he should combine the two of them."}},{"id":31,"idInBook":31,"chapterId":28,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ كَانَ يَقُولُ لاَ تُنْكَحُ الأَمَةُ عَلَى الْحُرَّةِ إِلاَّ أَنْ تَشَاءَ الْحُرَّةُ فَإِنْ طَاعَتِ الْحُرَّةُ فَلَهَا الثُّلُثَانِ مِنَ الْقَسْمِ ‏.‏ قَالَ مَالِكٌ وَلاَ يَنْبَغِي لِحُرٍّ أَنْ يَتَزَوَّجَ أَمَةً وَهُوَ يَجِدُ طَوْلاً لِحُرَّةٍ وَلاَ يَتَزَوَّجَ أَمَةً إِذَا لَمْ يَجِدْ طَوْلاً لِحُرَّةٍ إِلاَّ أَنْ يَخْشَى الْعَنَتَ وَذَلِكَ أَنَّ اللَّهَ تَبَارَكَ وَتَعَالَى قَالَ فِي كِتَابِهِ ‏{‏وَمَنْ لَمْ يَسْتَطِعْ مِنْكُمْ طَوْلاً أَنْ يَنْكِحَ الْمُحْصَنَاتِ الْمُؤْمِنَاتِ فَمِمَّا مَلَكَتْ أَيْمَانُكُمْ مِنْ فَتَيَاتِكُمُ الْمُؤْمِنَاتِ‏}‏ وَقَالَ ‏{‏ذَلِكَ لِمَنْ خَشِيَ الْعَنَتَ مِنْكُمْ‏}‏ قَالَ مَالِكٌ وَالْعَنَتُ هُوَ الزِّنَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said that Said ibn\nal-Musayyab said, \"The slave girl is not married when there is a free\nwoman who is a wife unless the free woman wishes it. If the free woman\ncomplies, she has two-thirds of the division of time.\"\n\n\nMalik\nsaid, \"A free man must not marry a slave-girl when he can afford to\nmarry a free-woman, and he should not marry a slave-girl when he\ncannot afford a free woman unless he fears fornication. That is\nbecause Allah, may he be Blessed and Exalted, says in His Book, 'If\nyou are not affluent enough to marry believing women, who are\nmuhsanat, take slave-girls who are believing women that your right\nhands own.' (Sura 4 ayat 24) He says, 'That is for those of you who\nfear al-anat.' \"\n\n\nMalik said, \"Al-anat is fornication.\""}},{"id":32,"idInBook":32,"chapterId":28,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ زَيْدِ بْنِ ثَابِتٍ، أَنَّهُ كَانَ يَقُولُ فِي الرَّجُلِ يُطَلِّقُ الأَمَةَ ثَلاَثًا ثُمَّ يَشْتَرِيهَا إِنَّهَا لاَ تَحِلُّ لَهُ حَتَّى تَنْكِحَ زَوْجًا غَيْرَهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Abu Abd ar-\nRahman that Zayd ibn Thabit said that if a man divorced his slave-girl\nthree times and then bought her, she was not halal for him until she\nhad married another husband."}},{"id":33,"idInBook":33,"chapterId":28,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ سَعِيدَ بْنَ الْمُسَيَّبِ، وَسُلَيْمَانَ بْنَ يَسَارٍ، سُئِلاَ عَنْ رَجُلٍ، زَوَّجَ عَبْدًا لَهُ جَارِيَةً فَطَلَّقَهَا الْعَبْدُ الْبَتَّةَ ثُمَّ وَهَبَهَا سَيِّدُهَا لَهُ هَلْ تَحِلُّ لَهُ بِمِلْكِ الْيَمِينِ فَقَالاَ لاَ تَحِلُّ لَهُ حَتَّى تَنْكِحَ زَوْجًا غَيْرَهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Said ibn\nal-Musayyab and Sulayman ibn Yasar were asked whether, when a man\nmarried a slave of his to a slave-girl and the slave divorced her\nirrevocably, and then her master gave her to the slave, she was then\nhalal for the slave by the possession of the right hand. They said,\n\"No. She is not halal until she has married another husband.\""}},{"id":34,"idInBook":34,"chapterId":28,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ سَأَلَ ابْنَ شِهَابٍ عَنْ رَجُلٍ، كَانَتْ تَحْتَهُ أَمَةٌ مَمْلُوكَةٌ فَاشْتَرَاهَا وَقَدْ كَانَ طَلَّقَهَا وَاحِدَةً فَقَالَ تَحِلُّ لَهُ بِمِلْكِ يَمِينِهِ مَا لَمْ يَبُتَّ طَلاَقَهَا فَإِنْ بَتَّ طَلاَقَهَا فَلاَ تَحِلُّ لَهُ بِمِلْكِ يَمِينِهِ حَتَّى تَنْكِحَ زَوْجًا غَيْرَهُ ‏.‏ قَالَ مَالِكٌ فِي الرَّجُلِ يَنْكِحُ الأَمَةَ فَتَلِدُ مِنْهُ ثُمَّ يَبْتَاعُهَا إِنَّهَا لاَ تَكُونُ أُمَّ وَلَدٍ لَهُ بِذَلِكَ الْوَلَدِ الَّذِي وَلَدَتْ مِنْهُ وَهِيَ لِغَيْرِهِ حَتَّى تَلِدَ مِنْهُ وَهِيَ فِي مِلْكِهِ بَعْدَ ابْتِيَاعِهِ إِيَّاهَا ‏.‏ قَالَ مَالِكٌ وَإِنِ اشْتَرَاهَا وَهِيَ حَامِلٌ مِنْهُ ثُمَّ وَضَعَتْ عِنْدَهُ كَانَتْ أُمَّ وَلَدِهِ بِذَلِكَ الْحَمْلِ فِيمَا نُرَى وَاللَّهُ أَعْلَمُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had asked Ibn Shihab about\na man who had a slave-girl as a wife, and then he bought her, and\ndivorced her once. He said, \"She is halal for him by the possession of\nthe right hand as long as he does not make his divorce irrevocable. If\nhe irrevocably divorces her, she is not halal for him by the\npossession of the right hand until she has married another husband.\"\n\n\nMalik said that if a man rnarried a female slave and then she\nhad a child by him, and then he bought her, she was not an umm walad\nfor him because of the child born to him while she belonged to\nanother, until she had had a child by him while she was in his\npossession after he had purchased her.\n\n\nMalik said, \"If he\nbuys her and she is pregnant by him and she then gives birth while she\nbelongs to him, she is his umm walad by that pregnancy, according to\nwhat we think, and Allah knows best.\""}},{"id":35,"idInBook":35,"chapterId":28,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، عَنْ أَبِيهِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، سُئِلَ عَنِ الْمَرْأَةِ، وَابْنَتِهَا، مِنْ مِلْكِ الْيَمِينِ تُوطَأُ إِحْدَاهُمَا بَعْدَ الأُخْرَى فَقَالَ عُمَرُ مَا أُحِبُّ أَنْ أَخْبُرَهُمَا جَمِيعًا ‏.‏ وَنَهَى عَنْ ذَلِكَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Ubaydullah\nibn Abdullah ibn Utba ibn Masud from his father that Umar ibn al-\nKhattab was asked about a woman and her daughter who were in the\npossession of the right hand, and whether one could have intercourse\nwith one of them after the other Umar said, \"I dislike both being\npermitted together.\" He then forbade that."}},{"id":36,"idInBook":36,"chapterId":28,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ قَبِيصَةَ بْنِ ذُؤَيْبٍ، أَنَّ رَجُلاً، سَأَلَ عُثْمَانَ بْنَ عَفَّانَ عَنِ الأُخْتَيْنِ، مِنْ مِلْكِ الْيَمِينِ هَلْ يُجْمَعُ بَيْنَهُمَا فَقَالَ عُثْمَانُ أَحَلَّتْهُمَا آيَةٌ وَحَرَّمَتْهُمَا آيَةٌ فَأَمَّا أَنَا فَلاَ أُحِبُّ أَنْ أَصْنَعَ ذَلِكَ ‏.‏ قَالَ فَخَرَجَ مِنْ عِنْدِهِ فَلَقِيَ رَجُلاً مِنْ أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَسَأَلَهُ عَنْ ذَلِكَ فَقَالَ لَوْ كَانَ لِي مِنَ الأَمْرِ شَىْءٌ ثُمَّ وَجَدْتُ أَحَدًا فَعَلَ ذَلِكَ لَجَعَلْتُهُ نَكَالاً ‏.‏ قَالَ ابْنُ شِهَابٍ أُرَاهُ عَلِيَّ بْنَ أَبِي طَالِبٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Qabisa ibn\nDhu'ayb that a man asked Uthman ibn Affan whether one could have\nintercourse with two sisters who one owned. Uthman said, \"One ayat\nmakes them halal, and one ayat makes them haram. As for me, I wouldn't\nlike to do it.\" The man left him and met one of the companions of the\nMessenger of Allah, may Allah bless him and grant him peace, and asked\nhim about it, and he said, \"Had I any authority and I found someone\nwho had done it, I would punish him as an example.\"\n\n\nIbn\nShihab added, \"I think that it was Ali ibn Abi Talib. \""}},{"id":37,"idInBook":37,"chapterId":28,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ عَنِ الزُّبَيْرِ بْنِ الْعَوَّامِ، مِثْلُ ذَلِكَ ‏.‏ قَالَ مَالِكٌ فِي الأَمَةِ تَكُونُ عِنْدَ الرَّجُلِ فَيُصِيبُهَا ثُمَّ يُرِيدُ أَنْ يُصِيبَ أُخْتَهَا إِنَّهَا لاَ تَحِلُّ لَهُ حَتَّى يُحَرِّمَ عَلَيْهِ فَرْجَ أُخْتِهَا بِنِكَاحٍ أَوْ عِتَاقَةٍ أَوْ كِتَابَةٍ أَوْ مَا أَشْبَهَ ذَلِكَ يُزَوِّجُهَا عَبْدَهُ أَوْ غَيْرَ عَبْدِهِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that az-Zubayr\nibn al-Awwam said the like of that.\n\n\nMalik said that if a man\nhad sexual relations with a female slave that he owned, and then he\nwanted to also have relations with her sister, the sister was not\nhalal for a man until intercourse with the slave-girl had been made\nharam for him by marriage, setting free, kitaba, or the like of that -\nfor instance, if he had married her to his slave or someone other than\nhis slave."}},{"id":38,"idInBook":38,"chapterId":28,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عُمَرَ بْنَ الْخَطَّابِ، وَهَبَ لاِبْنِهِ جَارِيَةً فَقَالَ لاَ تَمَسَّهَا فَإِنِّي قَدْ كَشَفْتُهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Umar ibn\nal-Khattab gave his son a slave-girl and said, \"Do not touch her, for\nI have uncovered her.\""}},{"id":39,"idInBook":39,"chapterId":28,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْمُجَبَّرِ، أَنَّهُ قَالَ وَهَبَ سَالِمُ بْنُ عَبْدِ اللَّهِ لاِبْنِهِ جَارِيَةً قَالَ لاَ تَقْرَبْهَا فَإِنِّي قَدْ أَرَدْتُهَا فَلَمْ أَنْشَطْ إِلَيْهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that\nAbd arRahman ibn al-Mujabbir said that Salim ibn Abdullah gave his son\na slave-girl and said, \"Do not go near her, for I wanted her, and did\nnot act towards her.\""}},{"id":40,"idInBook":40,"chapterId":28,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ أَبَا نَهْشَلِ بْنَ الأَسْوَدِ، قَالَ لِلْقَاسِمِ بْنِ مُحَمَّدٍ إِنِّي رَأَيْتُ جَارِيَةً لِي مُنْكَشِفًا عَنْهَا وَهِيَ فِي الْقَمَرِ فَجَلَسْتُ مِنْهَا مَجْلِسَ الرَّجُلِ مِنِ امْرَأَتِهِ فَقَالَتْ إِنِّي حَائِضٌ فَقُمْتُ فَلَمْ أَقْرَبْهَا بَعْدُ أَفَأَهَبُهَا لاِبْنِي يَطَؤُهَا فَنَهَاهُ الْقَاسِمُ عَنْ ذَلِكَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said that Abu\nNahshal ibn al-Aswad said to al-Qasim ibn Muhammad,\"I saw a slave-girl\nof mine uncovered in the moonlight, and so I sat on her as a man sits\non a woman. She said that she was menstruating, so I stood up and have\nnot gone near her after that. Can I give her to my son to have\nintercourse with?\" Al-Qasim forbade that."}},{"id":41,"idInBook":41,"chapterId":28,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ إِبْرَاهِيمَ بْنِ أَبِي عَبْلَةَ، عَنْ عَبْدِ الْمَلِكِ بْنِ مَرْوَانَ، أَنَّهُ وَهَبَ لِصَاحِبٍ لَهُ جَارِيَةً ثُمَّ سَأَلَهُ عَنْهَا فَقَالَ قَدْ هَمَمْتُ أَنْ أَهَبَهَا لاِبْنِي فَيَفْعَلَ بِهَا كَذَا وَكَذَا ‏.‏ فَقَالَ عَبْدُ الْمَلِكِ لَمَرْوَانُ كَانَ أَوْرَعَ مِنْكَ وَهَبَ لاِبْنِهِ جَارِيَةً ثُمَّ قَالَ لاَ تَقْرَبْهَا فَإِنِّي قَدْ رَأَيْتُ سَاقَهَا مُنْكَشِفَةً ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibrahim ibn Abi Abla from Abd\nal-Malik ibn Marwan that he gave a slave-girl to a friend of his, and\nlater asked him about her. He said, \"I intended to give her to my son\nto do such-and-such with her.\" Abd al-Malik said, \"Marwan was more\nscrupulous than you. He gave a slave-girl to his son, and then he\nsaid, 'Do not go near her, for I have seen her leg uncovered .' \""}},{"id":42,"idInBook":42,"chapterId":28,"bookId":7,"arabic":"","english":{"narrator":"","text":"Malik said, \"It is not halal to marry a christian or jewish\nslave-girl because Allah the Blessed, the Exalted, said in His Book,\n'Believing women who are muhsanat and women of those who were given\nthe Book before you who are muhsanat', (sura 5 ayat 6) and they are\nfree women from the Christians and Jews. Allah, the Blessed, the\nExalted, said in His Book, 'If you are not affluent enough to marry\nbelieving women who are muhsanat, take believing slave-girls whom your\nright hands own.' \" (Sura 4 ayat 24)\n\n\nMalik said, \"In our\nopinion, Allah made marriage to believing slave-girls halal, and He\ndid not make halal marriage to christian and jewish slave-girls from\nthe People of the Book.\"\n\n\nMalik said, \"The christian and\njewish slave-girl are halal for their master by right of possession,\nbut intercourse with a magian slave-girl is not halal by the right of\npossession.\""}},{"id":43,"idInBook":43,"chapterId":28,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ قَالَ الْمُحْصَنَاتُ مِنَ النِّسَاءِ هُنَّ أُولاَتُ الأَزْوَاجِ وَيَرْجِعُ ذَلِكَ إِلَى أَنَّ اللَّهَ حَرَّمَ الزِّنَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab that Said ibn al-\nMusayyab said, \"The muhsanat among women are those who have husbands.\"\nThat referred to the fact that Allah has made fornication haram."}},{"id":44,"idInBook":44,"chapterId":28,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، وَبَلَغَهُ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، أَنَّهُمَا كَانَا يَقُولاَنِ إِذَا نَكَحَ الْحُرُّ الأَمَةَ فَمَسَّهَا فَقَدْ أَحْصَنَتْهُ ‏.‏ قَالَ مَالِكٌ وَكُلُّ مَنْ أَدْرَكْتُ كَانَ يَقُولُ ذَلِكَ تُحْصِنُ الأَمَةُ الْحُرَّ إِذَا نَكَحَهَا فَمَسَّهَا فَقَدْ أَحْصَنَتْهُ ‏.‏ قَالَ مَالِكٌ يُحْصِنُ الْعَبْدُ الْحُرَّةَ إِذَا مَسَّهَا بِنِكَاحٍ وَلاَ تُحْصِنُ الْحُرَّةُ الْعَبْدَ إِلاَّ أَنْ يَعْتِقَ وَهُوَ زَوْجُهَا فَيَمَسَّهَا بَعْدَ عِتْقِهِ فَإِنْ فَارَقَهَا قَبْلَ أَنْ يَعْتِقَ فَلَيْسَ بِمُحْصَنٍ حَتَّى يَتَزَوَّجَ بَعْدَ عِتْقِهِ وَيَمَسَّ امْرَأَتَهُ ‏.‏ قَالَ مَالِكٌ وَالأَمَةُ إِذَا كَانَتْ تَحْتَ الْحُرِّ ثُمَّ فَارَقَهَا قَبْلَ أَنْ تَعْتِقَ فَإِنَّهُ لاَ يُحْصِنُهَا نِكَاحُهُ إِيَّاهَا وَهِيَ أَمَةٌ حَتَّى تُنْكَحَ بَعْدَ عِتْقِهَا وَيُصِيبَهَا زَوْجُهَا فَذَلِكَ إِحْصَانُهَا وَالأَمَةُ إِذَا كَانَتْ تَحْتَ الْحُرِّ فَتَعْتِقُ وَهِيَ تَحْتَهُ قَبْلَ أَنْ يُفَارِقَهَا فَإِنَّهُ يُحْصِنُهَا إِذَا عَتَقَتْ وَهِيَ عِنْدَهُ إِذَا هُوَ أَصَابَهَا بَعْدَ أَنْ تَعْتِقَ ‏.‏ وَقَالَ مَالِكٌ وَالْحُرَّةُ النَّصْرَانِيَّةُ وَالْيَهُودِيَّةُ وَالأَمَةُ الْمُسْلِمَةُ يُحْصِنَّ الْحُرَّ الْمُسْلِمَ إِذَا نَكَحَ إِحْدَاهُنَّ فَأَصَابَهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab, and he had heard\nfrom al-Qasim ibn Muhammad that they said, \"When a free man marries a\nslave-girl and consummates the marriage, she makes him muhsan.\"\n\n\nMalik said, \"All (of the people of knowledge) I have seen said\nthat a slave-girl makes a free man muhsan when he marries her and\nconsummates the marriage.\"\n\n\nMalik said, \"A slave makes a free\nwoman muhsana when he consummates a marriage with her and a free woman\nonly makes a slave muhsan when he is freed and he is her husband and\nhas had sexual relations with her after he has been set free. If he\nparts from her before he is free, he is not a muhsan unless he marries\nher after having been set free and he consummates the marriage.\"\n\n\nMalik said, \"When a slave-girl is married to a free man and then\nhe separates from her before she is set free, his marriage to her does\nnot make her muhsana. She is not muhsana until she has married after\nshe has been set free and she has had intercourse with her husband.\nThat gives her ihsan. If she is the wife of a freeman and then she is\nset free while she is his wife before he separates from her, the man\nmakes her muhsana if he has intercourse with her after she has been\nset free.\"\n\n\nMalik said, \"The christian and jewish free women\nand the muslim slave-girl all make a muslim free man muhsan when he\nmarries one of them and has intercourse with her.\""}},{"id":45,"idInBook":45,"chapterId":28,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَبْدِ اللَّهِ، وَالْحَسَنِ، ابْنَىْ مُحَمَّدِ بْنِ عَلِيِّ بْنِ أَبِي طَالِبٍ عَنْ أَبِيهِمَا، عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ، رضى الله عنه أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ مُتْعَةِ النِّسَاءِ يَوْمَ خَيْبَرَ وَعَنْ أَكْلِ لُحُومِ الْحُمُرِ الإِنْسِيَّةِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Abdullah and\nHasan, the sons of Muhammad ibn Ali ibn Abi Talib from their ather,\nmayAllah be pleased with him, that the Messenger of Allah, may Allah\nbless him and grant him peace, forbade temporary marriage with women\nand the flesh of domestic donkeys on the Day of Khaybar."}},{"id":46,"idInBook":46,"chapterId":28,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، أَنَّ خَوْلَةَ بِنْتَ حَكِيمٍ، دَخَلَتْ عَلَى عُمَرَ بْنِ الْخَطَّابِ فَقَالَتْ إِنَّ رَبِيعَةَ بْنَ أُمَيَّةَ اسْتَمْتَعَ بِامْرَأَةٍ فَحَمَلَتْ مِنْهُ ‏.‏ فَخَرَجَ عُمَرُ بْنُ الْخَطَّابِ فَزِعًا يَجُرُّ رِدَاءَهُ فَقَالَ هَذِهِ الْمُتْعَةُ وَلَوْ كُنْتُ تَقَدَّمْتُ فِيهَا لَرَجَمْتُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Urwa ibn az-\nZubayr that Khawla ibn Hakim came to Umar ibn al-Khattab and said,\n''Rabia ibn Umayya made a temporary marriage with a woman and she is\npregnant by him.'' Umar ibn al-Khattab went out in dismay dragging his\ncloak, saying, \"This temporary marriage, had I come across it, I would\nhave ordered stoning and done away with it! \""}},{"id":47,"idInBook":47,"chapterId":28,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ سَمِعَ رَبِيعَةَ بْنَ أَبِي عَبْدِ الرَّحْمَنِ، يَقُولُ يَنْكِحُ الْعَبْدُ أَرْبَعَ نِسْوَةٍ ‏.‏ قَالَ مَالِكٌ وَهَذَا أَحْسَنُ مَا سَمِعْتُ فِي ذَلِكَ ‏.‏ قَالَ مَالِكٌ وَالْعَبْدُ مُخَالِفٌ لِلْمُحَلِّلِ إِنْ أَذِنَ لَهُ سَيِّدُهُ ثَبَتَ نِكَاحُهُ وَإِنْ لَمْ يَأْذَنْ لَهُ سَيِّدُهُ فُرِّقَ بَيْنَهُمَا وَالْمُحَلِّلُ يُفَرَّقُ بَيْنَهُمَا عَلَى كُلِّ حَالٍ إِذَا أُرِيدَ بِالنِّكَاحِ التَّحْلِيلُ ‏.‏ قَالَ مَالِكٌ فِي الْعَبْدِ إِذَا مَلَكَتْهُ امْرَأَتُهُ أَوِ الزَّوْجُ يَمْلِكُ امْرَأَتَهُ إِنَّ مِلْكَ كُلِّ وَاحِدٍ مِنْهُمَا صَاحِبَهُ يَكُونُ فَسْخًا بِغَيْرِ طَلاَقٍ وَإِنْ تَرَاجَعَا بِنِكَاحٍ بَعْدُ لَمْ تَكُنْ تِلْكَ الْفُرْقَةُ طَلاَقًا ‏.‏ قَالَ مَالِكٌ وَالْعَبْدُ إِذَا أَعْتَقَتْهُ امْرَأَتُهُ إِذَا مَلَكَتْهُ وَهِيَ فِي عِدَّةٍ مِنْهُ لَمْ يَتَرَاجَعَا إِلاَّ بِنِكَاحٍ جَدِيدٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he heard Rabia ibn Abd ar-\nRahman say that a slave could marry four women.\n\n\nMalik said,\n\"This is the best of what I have heard about the matter.\"\n\n\nMalik said, \"The slave differs with the muhallil if the slave is given\npermission by his master for his ex-wife. If his master does not give\nhim permission, he separates them. The muhallil is separated in any\ncase if he intends to make the woman halal by marriage.\"\n\n\nMalik said, \"When a slave is owned by his wife or a husband owns his\nwife, the possession of each of them is rendered void without divorce.\nIf a man, for instance, is married to a slave-girl, and then he buys\nher, he must divorce her as a matter of course. They can then re-\nmarry. If they re-marry afterwards, that separation was not divorce.\"\n\n\nMalik said, \"When a slave is freed by his wife who owns him\nand she is in the idda-period from him, they can only return to each\nother after she has made another marriage.\""}},{"id":48,"idInBook":48,"chapterId":28,"bookId":7,"arabic":"حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، أَنَّهُ بَلَغَهُ أَنَّ نِسَاءً، كُنَّ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم يُسْلِمْنَ بِأَرْضِهِنَّ وَهُنَّ غَيْرُ مُهَاجِرَاتٍ وَأَزْوَاجُهُنَّ حِينَ أَسْلَمْنَ كُفَّارٌ مِنْهُنَّ بِنْتُ الْوَلِيدِ بْنِ الْمُغِيرَةِ ‏.‏ وَكَانَتْ تَحْتَ صَفْوَانَ بْنِ أُمَيَّةَ فَأَسْلَمَتْ يَوْمَ الْفَتْحِ وَهَرَبَ زَوْجُهَا صَفْوَانُ بْنُ أُمَيَّةَ مِنَ الإِسْلاَمِ فَبَعَثَ إِلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم ابْنَ عَمِّهِ وَهْبَ بْنَ عُمَيْرٍ بِرِدَاءِ رَسُولِ اللَّهِ صلى الله عليه وسلم أَمَانًا لِصَفْوَانَ بْنِ أُمَيَّةَ وَدَعَاهُ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى الإِسْلاَمِ وَأَنْ يَقْدَمَ عَلَيْهِ فَإِنْ رَضِيَ أَمْرًا قَبِلَهُ وَإِلاَّ سَيَّرَهُ شَهْرَيْنِ فَلَمَّا قَدِمَ صَفْوَانُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم بِرِدَائِهِ نَادَاهُ عَلَى رُءُوسِ النَّاسِ فَقَالَ يَا مُحَمَّدُ إِنَّ هَذَا وَهْبَ بْنَ عُمَيْرٍ جَاءَنِي بِرِدَائِكَ وَزَعَمَ أَنَّكَ دَعَوْتَنِي إِلَى الْقُدُومِ عَلَيْكَ فَإِنْ رَضِيتُ أَمْرًا قَبِلْتُهُ وَإِلاَّ سَيَّرْتَنِي شَهْرَيْنِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ انْزِلْ أَبَا وَهْبٍ ‏\"‏ ‏.‏ فَقَالَ لاَ وَاللَّهِ لاَ أَنْزِلُ حَتَّى تُبَيِّنَ لِي ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ بَلْ لَكَ تَسِيرُ أَرْبَعَةَ أَشْهُرٍ ‏\"‏ ‏.‏ فَخَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم قِبَلَ هَوَازِنَ بِحُنَيْنٍ ‏.‏ فَأَرْسَلَ إِلَى صَفْوَانَ بْنِ أُمَيَّةَ يَسْتَعِيرُهُ أَدَاةً وَسِلاَحًا عِنْدَهُ فَقَالَ صَفْوَانُ أَطَوْعًا أَمْ كَرْهًا فَقَالَ ‏\"‏ بَلْ طَوْعًا ‏\"‏ ‏.‏ فَأَعَارَهُ الأَدَاةَ وَالسِّلاَحَ الَّتِي عِنْدَهُ ثُمَّ خَرَجَ صَفْوَانُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَهُوَ كَافِرٌ فَشَهِدَ حُنَيْنًا وَالطَّائِفَ وَهُوَ كَافِرٌ وَامْرَأَتُهُ مُسْلِمَةٌ وَلَمْ يُفَرِّقْ رَسُولُ اللَّهِ صلى الله عليه وسلم بَيْنَهُ وَبَيْنَ امْرَأَتِهِ حَتَّى أَسْلَمَ صَفْوَانُ وَاسْتَقَرَّتْ عِنْدَهُ امْرَأَتُهُ بِذَلِكَ النِّكَاحِ ‏.‏","english":{"narrator":"","text":"Malik related to me from Ibn Shihab that he had heard that in the\ntime of the Messenger of Allah, may Allah bless him and grant him\npeace, women were becoming muslim in their own lands and they did not\ndo hijra while their husbands were still kafirun although they\nthemselves had become muslim. Among them was the daughter of al-Walid\nibn al-Mughira and she was the wife of Safwan ibn Umayya. She became\nmuslim on the day of the conquest (of Makka), and her husband, Safwan\nibn Umayya fled from Islam. The Messenger of Allah, may Allah bless\nhim and grant him peace, sent Safwan's paternal cousin, Wahb ibn Umayr\nwith the cloak of the Messenger of Allah, may Allah bless him and\ngrant him peace, as a safe-conduct for Safwan ibn Umayya, and the\nMessenger of Allah, may Allah bless him and grant him peace, called\nhim to Islam and asked for him to come to him and if he was pleased\nwith the matter to accept it. If not he would have a respite for two\nmonths.\n\n\nWhen Safwan came to the Messenger of Allah, may Allah\nbless him and grant him peace, with his cloak, he called out to him\nover the heads of the people, \"Muhammad! Wahb ibn Umayr brought me\nyour cloak and claimed that you had summoned me to come to you and if\nI was pleased with the matter, I should accept it and if not, you\nwould give me a respite for two months. \"The Messenger of Allah, may\nAllah bless him and grant him peace, said, \"Come down, Abu Wahb.\" He\nsaid, \"No, by Allah! I will not come down until you make it clear to\nme.\" The Messenger of Allah, may Allah bless him and grant him peace,\nsaid, \"You have a respite of four months.\" The Messenger of Allah, may\nAllah bless him and grant him peace, went out toward Hawazin at\nHunayn. He sent to Safwan ibn Umayya to borrow some equipment and arms\nthat he had. Safwan said, \"Willingly or unwillingly?\" He said,\n\"Willingly.\" Therefore he lent him the equipment and arms which he\nhad. Then Safwan went out with the Messenger of Allah, may Allah bless\nhim and grant him peace, while he was still a kafir. He was present at\nthe battles of Hunayn and at-Ta'if while he was still a kafir and his\nwife was a muslim. The Messenger of Allah, may Allah bless him and\ngrant him peace, did not separate Safwan and his wife until he had\nbecome muslim, and his wife was settled with him by that marriage."}},{"id":49,"idInBook":49,"chapterId":28,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، أَنَّهُ قَالَ كَانَ بَيْنَ إِسْلاَمِ صَفْوَانَ وَبَيْنَ إِسْلاَمِ امْرَأَتِهِ نَحْوٌ مِنْ شَهْرٍ ‏.‏ قَالَ ابْنُ شِهَابٍ وَلَمْ يَبْلُغْنَا أَنَّ امْرَأَةً هَاجَرَتْ إِلَى اللَّهِ وَرَسُولِهِ وَزَوْجُهَا كَافِرٌ مُقِيمٌ بِدَارِ الْكُفْرِ إِلاَّ فَرَّقَتْ هِجْرَتُهَا بَيْنَهَا وَبَيْنَ زَوْجِهَا إِلاَّ أَنْ يَقْدَمَ زَوْجُهَا مُهَاجِرًا قَبْلَ أَنْ تَنْقَضِيَ عِدَّتُهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Ibn Shihab said, \"Between the\nIslam of Safwan and the Islam of his wife there was about one month.\"\n\n\nIbn Shihab said, \"We have not heard about any woman doing\nhijra for Allah and His Messenger while her husband was a kafir\nabiding in the land of kufr, but that her hijra separated her and her\nhusband unless her husband came in hijra before her period of idda had\nbeen completed.\""}},{"id":50,"idInBook":50,"chapterId":28,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ أُمَّ حَكِيمٍ بِنْتَ الْحَارِثِ بْنِ هِشَامٍ، وَكَانَتْ، تَحْتَ عِكْرِمَةَ بْنِ أَبِي جَهْلٍ فَأَسْلَمَتْ يَوْمَ الْفَتْحِ وَهَرَبَ زَوْجُهَا عِكْرِمَةُ بْنُ أَبِي جَهْلٍ مِنَ الإِسْلاَمِ حَتَّى قَدِمَ الْيَمَنَ فَارْتَحَلَتْ أُمُّ حَكِيمٍ حَتَّى قَدِمَتْ عَلَيْهِ بِالْيَمَنِ فَدَعَتْهُ إِلَى الإِسْلاَمِ فَأَسْلَمَ وَقَدِمَ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم عَامَ الْفَتْحِ فَلَمَّا رَآهُ رَسُولُ اللَّهِ صلى الله عليه وسلم وَثَبَ إِلَيْهِ فَرِحًا وَمَا عَلَيْهِ رِدَاءٌ حَتَّى بَايَعَهُ فَثَبَتَا عَلَى نِكَاحِهِمَا ذَلِكَ ‏.‏ قَالَ مَالِكٌ وَإِذَا أَسْلَمَ الرَّجُلُ قَبْلَ امْرَأَتِهِ وَقَعَتِ الْفُرْقَةُ بَيْنَهُمَا إِذَا عُرِضَ عَلَيْهَا الإِسْلاَمُ فَلَمْ تُسْلِمْ لأَنَّ اللَّهَ تَبَارَكَ وَتَعَالَى يَقُولُ فِي كِتَابِهِ ‏{‏وَلاَ تُمْسِكُوا بِعِصَمِ الْكَوَافِرِ‏}‏‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab that Umm Hakim\nbint al-Harith ibn Hisham who was the wife of Ikrima ibn Abi Jahl\nbecame muslim on the day of the conquest of Makka, and her husband\nIkrima fled from Islam as far as the Yemen. Umm Hakim set out after\nhim until she came to him in the Yemen and she called him to Islam,\nand he became muslim. He went to the Messenger of Allah, may Allah\nbless him and grant him peace, in the year of the conquest. When the\nMessenger of Allah, may Allah bless him and grant him peace, saw him,\nhe rushed to him in joy and did not bother to put on his cloak until\nhe had made the pledge with him. They were confirmed in their\nmarriage.\n\n\nMalik said, \"If a man becomes muslim before his\nwife, a separation occurs between them when he presents Islam to her\nand she does not become muslim, because Allah, the Blessed, the\nExalted, said in His Book, 'Do not hold fast to the ties of women who\nare kafirun.' \""}},{"id":51,"idInBook":51,"chapterId":28,"bookId":7,"arabic":"وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ حُمَيْدٍ الطَّوِيلِ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ عَوْفٍ، جَاءَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَبِهِ أَثَرُ صُفْرَةٍ فَسَأَلَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَخْبَرَهُ أَنَّهُ تَزَوَّجَ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ كَمْ سُقْتَ إِلَيْهَا ‏\"‏ ‏.‏ فَقَالَ زِنَةَ نَوَاةٍ مِنْ ذَهَبٍ ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَوْلِمْ وَلَوْ بِشَاةٍ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Humayd at-Tawil from Anas ibn\nMalik that Abd ar-Rahman ibn Awf came to the Messenger of Allah, may\nAllah bless him and grant him peace, and he had a traceof yellow on\nhim. The Messenger of Allah, may Allah bless him and grant him peace,\nasked about it. He told him that he had just been married. The\nMessenger of Allah, may Allah bless him and grant him peace, said,\n\"How much did you hand over to her?\" He said, \"The weight of a date\npit in gold.\" The Messenger of Allah, may Allah bless him and grant\nhim peace, said to him, \"Hold a feast, even if it is only with a\nsheep."}},{"id":52,"idInBook":52,"chapterId":28,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ قَالَ لَقَدْ بَلَغَنِي أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُولِمُ بِالْوَلِيمَةِ مَا فِيهَا خُبْزٌ وَلاَ لَحْمٌ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Yahya ibn Said said, \"I have\nheard that the Messenger of Allah, may Allah bless him and grant him\npeace, held a wedding feast in which there was neither meat nor\nbread.\""}},{"id":53,"idInBook":53,"chapterId":28,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا دُعِيَ أَحَدُكُمْ إِلَى وَلِيمَةٍ فَلْيَأْتِهَا ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat the Messenger of Allah, may Allah bless him and grant him peace,\nsaid, \"When you are invited to a wedding feast, you must go to it.\""}},{"id":54,"idInBook":54,"chapterId":28,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ كَانَ يَقُولُ شَرُّ الطَّعَامِ طَعَامُ الْوَلِيمَةِ يُدْعَى لَهَا الأَغْنِيَاءُ وَيُتْرَكُ الْمَسَاكِينُ وَمَنْ لَمْ يَأْتِ الدَّعْوَةَ فَقَدْ عَصَى اللَّهَ وَرَسُولَهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibr. Shihab from al-Araj that\nAbu Hurayra said, \"The worst food is the food of a wedding feast to\nwhich the rich are invited and the poor are left out. If anyone\nrejects an invitation, he has rebelled against Allah and His\nMessenger.\""}},{"id":55,"idInBook":55,"chapterId":28,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَقُولُ إِنَّ خَيَّاطًا دَعَا رَسُولَ اللَّهِ صلى الله عليه وسلم لِطَعَامٍ صَنَعَهُ ‏.‏ قَالَ أَنَسٌ فَذَهَبْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِلَى ذَلِكَ الطَّعَامِ فَقَرَّبَ إِلَيْهِ خُبْزًا مِنْ شَعِيرٍ وَمَرَقًا فِيهِ دُبَّاءُ ‏.‏ قَالَ أَنَسٌ فَرَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَتَتَبَّعُ الدُّبَّاءَ مِنْ حَوْلِ الْقَصْعَةِ فَلَمْ أَزَلْ أُحِبُّ الدُّبَّاءَ بَعْدَ ذَلِكَ الْيَوْمِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Ishaq ibn Abdullah ibn Abi\nTalha heard Anas ibn Malik say that a certain tailor invited the\nMessenger of Allah, may Allah bless him and grant him peace, to eat\nsome food which he had prepared.\n\n\nAnas said, \"I went with the\nMessenger of Allah, may Allah bless him and grant him peace, to eat\nthe food. He served barley bread and a soup with pumpkin in it. I saw\nthe Messenger of Allah, may Allah bless him and grant him peace, going\nafter the pumpkin around the dish, so I have always liked pumpkin\nsince that day.\""}},{"id":56,"idInBook":56,"chapterId":28,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا تَزَوَّجَ أَحَدُكُمُ الْمَرْأَةَ أَوِ اشْتَرَى الْجَارِيَةَ فَلْيَأْخُذْ بِنَاصِيَتِهَا وَلْيَدْعُ بِالْبَرَكَةِ وَإِذَا اشْتَرَى الْبَعِيرَ فَلْيَأْخُذْ بِذِرْوَةِ سَنَامِهِ وَلْيَسْتَعِذْ بِاللَّهِ مِنَ الشَّيْطَانِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Zayd ibn Aslam that the\nMessenger of Allah, may Allah bless him and grant him peace, said,\n\"When you marry a woman or buy a slave-girl, take her by the forelock\nand ask for baraka. When you buy a camel, take the top of its hump,\nand seek refuge with Allah from Shaytan.\""}},{"id":57,"idInBook":57,"chapterId":28,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزُّبَيْرِ الْمَكِّيِّ، أَنَّ رَجُلاً، خَطَبَ إِلَى رَجُلٍ أُخْتَهُ فَذَكَرَ أَنَّهَا قَدْ كَانَتْ أَحْدَثَتْ فَبَلَغَ ذَلِكَ عُمَرَ بْنَ الْخَطَّابِ فَضَرَبَهُ - أَوْ كَادَ يَضْرِبُهُ - ثُمَّ قَالَ مَا لَكَ وَلِلْخَبَرِ","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'z-Zubayr al-Makki that\nsomebody asked a man for his sister in marriage and the man mentioned\nthat she had committed fornication. Umar ibn al-Khattab heard about it\nand he beat the man or almost beat him, and said, \"What did you mean\nby giving him such information?\""}},{"id":58,"idInBook":58,"chapterId":28,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، أَنَّ الْقَاسِمَ بْنَ مُحَمَّدٍ، وَعُرْوَةَ بْنَ الزُّبَيْرِ، كَانَا يَقُولاَنِ فِي الرَّجُلِ يَكُونُ عِنْدَهُ أَرْبَعُ نِسْوَةٍ فَيُطَلِّقُ إِحْدَاهُنَّ الْبَتَّةَ أَنَّهُ يَتَزَوَّجُ إِنْ شَاءَ وَلاَ يَنْتَظِرُ أَنْ تَنْقَضِيَ عِدَّتُهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Rabia ibn Abi Abd ar-Rahman\nthat al-Qasim ibn Muhammad and Urwa ibn az-Zubayr said that a man who\nhad four wives and then divorced one of them irrevocably, could marry\nstraightaway if he wished, and he did not have to wait for the\ncompletion of her idda."}},{"id":59,"idInBook":59,"chapterId":28,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، أَنَّ الْقَاسِمَ بْنَ مُحَمَّدٍ، وَعُرْوَةَ بْنَ الزُّبَيْرِ، أَفْتَيَا الْوَلِيدَ بْنَ عَبْدِ الْمَلِكِ عَامَ قَدِمَ الْمَدِينَةَ بِذَلِكَ غَيْرَ أَنَّ الْقَاسِمَ بْنَ مُحَمَّدٍ قَالَ طَلَّقَهَا فِي مَجَالِسَ شَتَّى ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Rabia ibn Abd ar-Rahman that\nal-Qasim ibn Muhammad and Urwa ibn az-Zubayr gave the same judgement\nto al-Walid ibn Abd al-Malik in the year of his arrival in Madina\nexcept that al-Qasim ibn Muhammad said that he divorced his wife on\nvarious occasions. (i.e. not at one time)."}},{"id":60,"idInBook":60,"chapterId":28,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ قَالَ ثَلاَثٌ لَيْسَ فِيهِنَّ لَعِبٌ النِّكَاحُ وَالطَّلاَقُ وَالْعِتْقُ ‏.‏","english":{"narrator":"Yahya related to me from Malik from Yahya ibn Said that Said ibn\nal-Musayyab said, \"There are three things in which there is no jest:","text":"marriage, divorce, and setting free.\""}},{"id":61,"idInBook":61,"chapterId":28,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ رَافِعِ بْنِ خَدِيجٍ، أَنَّهُ تَزَوَّجَ بِنْتَ مُحَمَّدِ بْنِ مَسْلَمَةَ الأَنْصَارِيِّ فَكَانَتْ عِنْدَهُ حَتَّى كَبِرَتْ فَتَزَوَّجَ عَلَيْهَا فَتَاةً شَابَّةً فَآثَرَ الشَّابَّةَ عَلَيْهَا فَنَاشَدَتْهُ الطَّلاَقَ فَطَلَّقَهَا وَاحِدَةً ثُمَّ أَمْهَلَهَا حَتَّى إِذَا كَادَتْ تَحِلُّ رَاجَعَهَا ثُمَّ عَادَ فَآثَرَ الشَّابَّةَ فَنَاشَدَتْهُ الطَّلاَقَ فَطَلَّقَهَا وَاحِدَةً ثُمَّ رَاجَعَهَا ثُمَّ عَادَ فَآثَرَ الشَّابَّةَ فَنَاشَدَتْهُ الطَّلاَقَ فَقَالَ مَا شِئْتِ إِنَّمَا بَقِيَتْ وَاحِدَةٌ فَإِنْ شِئْتِ اسْتَقْرَرْتِ عَلَى مَا تَرَيْنَ مِنَ الأُثْرَةِ وَإِنْ شِئْتِ فَارَقْتُكِ ‏.‏ قَالَتْ بَلْ أَسْتَقِرُّ عَلَى الأُثْرَةِ ‏.‏ فَأَمْسَكَهَا عَلَى ذَلِكَ وَلَمْ يَرَ رَافِعٌ عَلَيْهِ إِثْمًا حِينَ قَرَّتْ عِنْدَهُ عَلَى الأُثْرَةِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab that Rafi ibn\nKhadij married the daughter of Muhammad ibn Maslama al-Ansari. She was\nwith him until she grew older, and then he married a young girl and\npreferred the young girl to her. She begged him to divorce her, so he\ndivorced her and then he gave her time until she had almost finished\nher idda period and then he returned and still preferred the young\ngirl. She therefore asked him to divorce her. He divorced her once,\nand then returned to her, and still preferred the young girl, and she\nasked him to divorce her. He said, \"What do you want? There is only\none divorce left. If you like, continue and put up with what you see\nof preference, and if you like, I will separate from you.\" She said,\n\"I will continue in spite of the preference.\" He kept her in spite of\nthat. Rafi did not see that he had done any wrong action when she\nremained with him in spite of preference."}}],"chapter":{"id":28,"bookId":7,"arabic":"كتاب النكاح","english":"Marriage"}}