{"metadata":{"length":120,"arabic":{"title":"موطأ مالك","author":"الإمام مالك بن أنس","introduction":"كتاب الطلاق"},"english":{"title":"Muwatta Malik","author":"Imam Malik ibn Anas","introduction":"Divorce"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":29,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ رَجُلاً، قَالَ لِعَبْدِ اللَّهِ بْنِ عَبَّاسٍ إِنِّي طَلَّقْتُ امْرَأَتِي مِائَةَ تَطْلِيقَةٍ فَمَاذَا تَرَى عَلَىَّ فَقَالَ لَهُ ابْنُ عَبَّاسٍ طَلُقَتْ مِنْكَ لِثَلاَثٍ وَسَبْعٌ وَتِسْعُونَ اتَّخَذْتَ بِهَا آيَاتِ اللَّهِ هُزُوًا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that a man said\nto Abdullah ibn Abbas, \"I have divorced my wife by saying I divorce\nyou a hundred times. What do you think my situation is?\" Ibn Abbas\nsaid to him, \"She was divorced from you by three pronouncements, and\nby the ninety-seven, you have mocked the ayat of Allah.\""}},{"id":2,"idInBook":2,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ رَجُلاً، جَاءَ إِلَى عَبْدِ اللَّهِ بْنِ مَسْعُودٍ فَقَالَ إِنِّي طَلَّقْتُ امْرَأَتِي ثَمَانِيَ تَطْلِيقَاتٍ ‏.‏ فَقَالَ ابْنُ مَسْعُودٍ فَمَاذَا قِيلَ لَكَ قَالَ قِيلَ لِي إِنَّهَا قَدْ بَانَتْ مِنِّي ‏.‏ فَقَالَ ابْنُ مَسْعُودٍ صَدَقُوا مَنْ طَلَّقَ كَمَا أَمَرَهُ اللَّهُ فَقَدْ بَيَّنَ اللَّهُ لَهُ وَمَنْ لَبَسَ عَلَى نَفْسِهِ لَبْسًا جَعَلْنَا لَبْسَهُ مُلْصَقًا بِهِ لاَ تَلْبِسُوا عَلَى أَنْفُسِكُمْ وَنَتَحَمَّلَهُ عَنْكُمْ هُوَ كَمَا يَقُولُونَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that a man came\nto Abdullah ibn Masud and said, \"I have divorced my wife by saying I\ndivorce you eight times.\" Ibn Masud said to him, \"What have people\ntold you?\" He replied, \"I have been told that I have to part\nabsolutely from her.\" Ibn Masud said, \"They have spoken the truth. A\nperson who divorces as Allah has commanded, Allah makes it clear for\nhim, and a person who obscures himself in error, we make stay by his\nerror. So do not confuse yourselves and pull us into your confusion.\nIt is as they have said.\""}},{"id":3,"idInBook":3,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ أَبِي بَكْرِ بْنِ حَزْمٍ، أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ، قَالَ لَهُ الْبَتَّةُ مَا يَقُولُ النَّاسُ فِيهَا قَالَ أَبُو بَكْرٍ فَقُلْتُ لَهُ كَانَ أَبَانُ بْنُ عُثْمَانَ يَجْعَلُهَا وَاحِدَةً ‏.‏ فَقَالَ عُمَرُ بْنُ عَبْدِ الْعَزِيزِ لَوْ كَانَ الطَّلاَقُ أَلْفًا مَا أَبْقَتِ الْبَتَّةُ مِنْهَا شَيْئًا مَنْ قَالَ الْبَتَّةَ فَقَدْ رَمَى الْغَايَةَ الْقُصْوَى ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said from Abu Bakr\nibn Hazm thatUmar ibn Abd al-Aziz had asked him what people said about\nthe 'irrevocable' divorce, and Abu Bakr had replied that Aban ibn\nUthman had clarified that it was declared only once. Umar ibn Abd al-\nAziz said, \"Even if divorce had to be declared a thousand times,\nthe'irrevocable' would use them all up. A person who says,\n'irrevocably' has cast the furthest limit.\""}},{"id":4,"idInBook":4,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ مَرْوَانَ بْنَ الْحَكَمِ، كَانَ يَقْضِي فِي الَّذِي يُطَلِّقُ امْرَأَتَهُ الْبَتَّةَ أَنَّهَا ثَلاَثُ تَطْلِيقَاتٍ ‏.‏ قَالَ مَالِكٌ وَهَذَا أَحَبُّ مَا سَمِعْتُ إِلَىَّ فِي ذَلِكَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab that Marwan ibn\nal-Hakam decided that if someone made three pronouncements of divorce,\nhe had divorced his wife irrevocably.\n\n\nMalik said, \"That is\nwhat I like best of what I have heard on the subject.\"\n\n\n29.2\nDivorce by Euphemistic Statements"}},{"id":5,"idInBook":5,"chapterId":29,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّهُ كُتِبَ إِلَى عُمَرَ بْنِ الْخَطَّابِ مِنَ الْعِرَاقَ أَنَّ رَجُلاً قَالَ لاِمْرَأَتِهِ حَبْلُكِ عَلَى غَارِبِكِ فَكَتَبَ عُمَرُ بْنُ الْخَطَّابِ إِلَى عَامِلِهِ أَنْ مُرْهُ يُوَافِينِي بِمَكَّةَ فِي الْمَوْسِمِ فَبَيْنَمَا عُمَرُ يَطُوفُ بِالْبَيْتِ إِذْ لَقِيَهُ الرَّجُلُ فَسَلَّمَ عَلَيْهِ فَقَالَ عُمَرُ مَنْ أَنْتَ فَقَالَ أَنَا الَّذِي أَمَرْتَ أَنْ أُجْلَبَ عَلَيْكَ ‏.‏ فَقَالَ لَهُ عُمَرُ أَسْأَلُكَ بِرَبِّ هَذِهِ الْبَنِيَّةِ مَا أَرَدْتَ بِقَوْلِكَ حَبْلُكِ عَلَى غَارِبِكِ فَقَالَ لَهُ الرَّجُلُ لَوِ اسْتَحْلَفْتَنِي فِي غَيْرِ هَذَا الْمَكَانِ مَا صَدَقْتُكَ أَرَدْتُ بِذَلِكَ الْفِرَاقَ ‏.‏ فَقَالَ عُمَرُ بْنُ الْخَطَّابِ هُوَ مَا أَرَدْتَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Umar ibn\nal-Khattab had heard in a letter from Iraq that a man said to his\nwife, \"Your rein is on your withers (i.e. you have free rein).\" Umar\nibn al-Khattab wrote to his governor to order the man to come to him\nat Makka at the time of hajj. While Umar was doing tawaf around the\nHouse, a man met him and greeted him. Umar asked him who he was, and\nhe replied that he was the man that he had ordered to be brought to\nhim. Umar said to him, \"I ask you by the Lord of this building, what\ndid you mean by your statement, 'Your rein is on your withers.'?\" The\nman replied, \"Had you made me swear by other than this place, I would\nnot have told you the truth. I intended separation by that.\" Umar ibn\nal- Khattab said, \"It is what you intended.\""}},{"id":6,"idInBook":6,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَلِيَّ بْنَ أَبِي طَالِبٍ، كَانَ يَقُولُ فِي الرَّجُلِ يَقُولُ لاِمْرَأَتِهِ أَنْتِ عَلَىَّ حَرَامٌ إِنَّهَا ثَلاَثُ تَطْلِيقَاتٍ ‏.‏ قَالَ مَالِكُ وَذَلِكَ أَحْسَنُ مَا سَمِعْتُ فِي ذَلِكَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Ali ibn Abi\nTalib used to say that if a man said to his wife, \"You are haram for\nme,\" it counted as three pronouncements of divorce.\n\n\nMalik\nsaid, \"That is the best of what I have heard on the subject.\""}},{"id":7,"idInBook":7,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقُولُ فِي الْخَلِيَّةِ وَالْبَرِيَّةِ إِنَّهَا ثَلاَثُ تَطْلِيقَاتٍ كُلُّ وَاحِدَةٍ مِنْهُمَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nsaid that statements like \"I cut myself off from you\",or\"You are\nabandoned\", were considered as three pronouncements of divorce.\n\n\nMalik said that any strong statements such as these or others were\nconsidered as three pronouncements of divorce for a woman whose\nmarriage had been consummated. In the case of a woman whose marriage\nhad not been consummated, the man was asked to make an oath on his\ndeen, as to whether he had intended one or three pronouncements of\ndivorce. If he had intended one pronouncement, he was asked to make an\noath by Allah to confirm it, and he became a suitor among other\nsuitors, because a woman whose marriage had been consummated, required\nthree pronouncements of divorce to make her inaccessible for the\nhusband, whilst only one pronouncement was needed to make a woman\nwhose marriage had not been consummated inaccessible.\n\n\nMalik\nadded, \"That is the best of what I have heard about the matter.\""}},{"id":8,"idInBook":8,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، ‏.‏ أَنَّ رَجُلاً، كَانَتْ تَحْتَهُ وَلِيدَةٌ لِقَوْمٍ فَقَالَ لأَهْلِهَا شَأْنَكُمْ بِهَا ‏.‏ فَرَأَى النَّاسُ أَنَّهَا تَطْلِيقَةٌ وَاحِدَةٌ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said from al-Qasim\nibn Muhammad that a certain man had taken a slave-girl belonging to\nsomebody else as a wife. He said to her people, \"She is your concern,\"\nand people considered that to be one pronouncement of divorce."}},{"id":9,"idInBook":9,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ سَمِعَ ابْنَ شِهَابٍ، يَقُولُ فِي الرَّجُلِ يَقُولُ لاِمْرَأَتِهِ بَرِئْتِ مِنِّي وَبَرِئْتُ مِنْكِ إِنَّهَا ثَلاَثُ تَطْلِيقَاتٍ بِمَنْزِلَةِ الْبَتَّةِ ‏.‏ قَالَ مَالِكٌ فِي الرَّجُلِ يَقُولُ لاِمْرَأَتِهِ أَنْتِ خَلِيَّةٌ أَوْ بَرِيَّةٌ أَوْ بَائِنَةٌ إِنَّهَا ثَلاَثُ تَطْلِيقَاتٍ لِلْمَرْأَةِ الَّتِي قَدْ دَخَلَ بِهَا وَيُدَيَّنُ فِي الَّتِي لَمْ يَدْخُلْ بِهَا أَوَاحِدَةً أَرَادَ أَمْ ثَلاَثًا فَإِنْ قَالَ وَاحِدَةً أُحْلِفَ عَلَى ذَلِكَ وَكَانَ خَاطِبًا مِنَ الْخُطَّابِ لأَنَّهُ لاَ يُخْلِي الْمَرْأَةَ الَّتِي قَدْ دَخَلَ بِهَا زَوْجُهَا وَلاَ يُبِينُهَا وَلاَ يُبْرِيهَا إِلاَّ ثَلاَثُ تَطْلِيقَاتٍ وَالَّتِي لَمْ يَدْخُلْ بِهَا تُخْلِيهَا وَتُبْرِيهَا وَتُبِينُهَا الْوَاحِدَةُ ‏.‏ قَالَ مَالِكٌ وَهَذَا أَحْسَنُ مَا سَمِعْتُ فِي ذَلِكَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he heard Ibn Shihab say that\nif a man said to his wife, \"You are free of me, and I am free of you,\n\" it counted as three pronouncements of divorce as if it were an\n'irrevocable' divorce.\n\n\nMalik said that if a man made any\nstrong statement such as these to his wife, it counted as three\npronouncements of divorce for a woman whose marriage had been\nconsummated, or it was written as one of three for a woman whose\nmarriage had not been consummated, whichever the man wished. If he\nsaid he intended only one divorce he swore to it and he became one of\nthe suitors because, whereas a woman whose marriage had been\nconsummated was made inaccessible by three pronouncements of divorce,\nthe woman whose marriage had not been consummated was made\ninaccessible by only one pronouncement.\n\n\nMalik said, \"That is\nthe best of what I have heard.\""}},{"id":10,"idInBook":10,"chapterId":29,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ رَجُلاً، جَاءَ إِلَى عَبْدِ اللَّهِ بْنِ عُمَرَ فَقَالَ يَا أَبَا عَبْدِ الرَّحْمَنِ إِنِّي جَعَلْتُ أَمْرَ امْرَأَتِي فِي يَدِهَا فَطَلَّقَتْ نَفْسَهَا فَمَاذَا تَرَى فَقَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ أُرَاهُ كَمَا قَالَتْ ‏.‏ فَقَالَ الرَّجُلُ لاَ تَفْعَلْ يَا أَبَا عَبْدِ الرَّحْمَنِ ‏.‏ فَقَالَ ابْنُ عُمَرَ أَنَا أَفْعَلُ أَنْتَ فَعَلْتَهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that a man came\nto Abdullah ibn Umar, and said, \"Abu Abd ar-Rahman! I placed the\ncommand of my wife in her hand, and she divorced herself, what do you\nthink?\" Abdullah ibn Umar said, \"I think that it is as she said.\" The\nman said, \"Don't do it, Abu Abd ar-Rahman!\" Ibn Umar said, \"You did\nit, it has nothing to do with me.\""}},{"id":11,"idInBook":11,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقُولُ إِذَا مَلَّكَ الرَّجُلُ امْرَأَتَهُ أَمْرَهَا فَالْقَضَاءُ مَا قَضَتْ بِهِ إِلاَّ أَنْ يُنْكِرَ عَلَيْهَا وَيَقُولَ لَمْ أُرِدْ إِلاَّ وَاحِدَةً فَيَحْلِفُ عَلَى ذَلِكَ وَيَكُونُ أَمْلَكَ بِهَا مَا كَانَتْ فِي عِدَّتِهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nsaid, \"When a man gives a woman command over herself, then the result\nis as she decides unless he denies it and says that he only meant to\ngive her one divorce and he swears to it - then he has access to her\nwhile she is in her idda.\""}},{"id":12,"idInBook":12,"chapterId":29,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ سَعِيدِ بْنِ سُلَيْمَانَ بْنِ زَيْدِ بْنِ ثَابِتٍ، عَنْ خَارِجَةَ بْنِ زَيْدِ بْنِ ثَابِتٍ، أَنَّهُ أَخْبَرَهُ أَنَّهُ، كَانَ جَالِسًا عِنْدَ زَيْدِ بْنِ ثَابِتٍ فَأَتَاهُ مُحَمَّدُ بْنُ أَبِي عَتِيقٍ وَعَيْنَاهُ تَدْمَعَانِ فَقَالَ لَهُ زَيْدٌ مَا شَأْنُكَ فَقَالَ مَلَّكْتُ امْرَأَتِي أَمْرَهَا فَفَارَقَتْنِي ‏.‏ فَقَالَ لَهُ زَيْدٌ مَا حَمَلَكَ عَلَى ذَلِكَ قَالَ الْقَدَرُ ‏.‏ فَقَالَ زَيْدٌ ارْتَجِعْهَا إِنْ شِئْتَ فَإِنَّمَا هِيَ وَاحِدَةٌ وَأَنْتَ أَمْلَكُ بِهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Said ibn Sulayman ibn Zayd\nibn Thabit that Kharija ibn Zayd ibn Thabit told him that he was\nsitting with Zayd ibn Thabit when Muhammad ibn Abi Atiq came to him\nwith his eyes brimming with tears. Zayd asked him what the matter was.\nHe said, \"I gave my wife command of herself, and she separated from\nme.\" Zayd said to him, \"What made you do that?\" He said, \"The Decree.\"\nZayd said, \"Return to her if you wish for it is only one\npronouncement, and you have access to her.\""}},{"id":13,"idInBook":13,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، أَنَّ رَجُلاً، مِنْ ثَقِيفٍ مَلَّكَ امْرَأَتَهُ أَمْرَهَا فَقَالَتْ أَنْتَ الطَّلاَقُ فَسَكَتَ ثُمَّ قَالَتْ أَنْتَ الطَّلاَقُ فَقَالَ بِفِيكِ الْحَجَرُ ‏.‏ ثُمَّ قَالَتْ أَنْتَ الطَّلاَقُ فَقَالَ بِفِيكِ الْحَجَرُ ‏.‏ فَاخْتَصَمَا إِلَى مَرْوَانَ بْنِ الْحَكَمِ فَاسْتَحْلَفَهُ مَا مَلَّكَهَا إِلاَّ وَاحِدَةً وَرَدَّهَا إِلَيْهِ ‏.‏ قَالَ مَالِكٌ قَالَ عَبْدُ الرَّحْمَنِ فَكَانَ الْقَاسِمُ يُعْجِبُهُ هَذَا الْقَضَاءُ وَيَرَاهُ أَحْسَنَ مَا سَمِعَ فِي ذَلِكَ ‏.‏ قَالَ مَالِكٌ وَهَذَا أَحْسَنُ مَا سَمِعْتُ فِي ذَلِكَ وَأَحَبُّهُ إِلَىَّ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abd ar-Rahman ibn al-Qasim\nfrom his father that a man of Thaqif gave his wife command over\nherself, and she said, \"You are divorced.\" He was silent. She said,\n\"You are divorced.\" He said, \"May a stone be in your mouth.\" She said,\n\"You are divorced.\" He said, \"May a stone be in your mouth.\" They\nargued and went to Marwan ibn al-Hakam. He took an oath that he had\nonly given her control over one pronouncement, and then she returned\nto him.\n\n\nMalik said that Abd ar-Rahman declared that this\ndecision had amazed al-Qasim, who thought it the best that he had\nheard on the subject.\n\n\nMalik added, \"That is also the best of\nwhat I have heard on the subject.\""}},{"id":14,"idInBook":14,"chapterId":29,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ، أَنَّهَا خَطَبَتْ عَلَى عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ قُرَيْبَةَ بِنْتَ أَبِي أُمَيَّةَ فَزَوَّجُوهُ ثُمَّ إِنَّهُمْ عَتَبُوا عَلَى عَبْدِ الرَّحْمَنِ وَقَالُوا مَا زَوَّجْنَا إِلاَّ عَائِشَةَ فَأَرْسَلَتْ عَائِشَةُ إِلَى عَبْدِ الرَّحْمَنِ فَذَكَرَتْ ذَلِكَ لَهُ فَجَعَلَ أَمْرَ قُرَيْبَةَ بِيَدِهَا فَاخْتَارَتْ زَوْجَهَا فَلَمْ يَكُنْ ذَلِكَ طَلاَقًا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abd ar-Rahman ibn al-Qasim\nfrom his father that A'isha, umm al-muminin, proposed to Qurayba bint\nAbi Umayya on behalf of Abd ar-Rahman ibn Abi Bakr. They married her\nto him and her people found fault with Abd ar-Rahman and said, \"We\nonly gave in marriage because of A'isha.\" A'isha therefore sent for\nAbd ar-Rahman and told him about it. He gave Qurayba authority over\nherself and she chose her husband and so there was no divorce."}},{"id":15,"idInBook":15,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، أَنَّ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم زَوَّجَتْ حَفْصَةَ بِنْتَ عَبْدِ الرَّحْمَنِ الْمُنْذِرَ بْنَ الزُّبَيْرِ - وَعَبْدُ الرَّحْمَنِ غَائِبٌ بِالشَّامِ - فَلَمَّا قَدِمَ عَبْدُ الرَّحْمَنِ قَالَ وَمِثْلِي يُصْنَعُ هَذَا بِهِ وَمِثْلِي يُفْتَاتُ عَلَيْهِ فَكَلَّمَتْ عَائِشَةُ الْمُنْذِرَ بْنَ الزُّبَيْرِ فَقَالَ الْمُنْذِرُ فَإِنَّ ذَلِكَ بِيَدِ عَبْدِ الرَّحْمَنِ ‏.‏ فَقَالَ عَبْدُ الرَّحْمَنِ مَا كُنْتُ لأَرُدَّ أَمْرًا قَضَيْتِيهِ فَقَرَّتْ حَفْصَةُ عِنْدَ الْمُنْذِرِ وَلَمْ يَكُنْ ذَلِكَ طَلاَقًا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abd ar-Rahman ibn al-Qasim\nfrom his father that A'isha, the wife of the Prophet, may Allah bless\nhim and grant him peace, gave Hafsa bint Abd arRahman in marriage to\nal-Mundhir ibn az-Zubayr while Abd ar-Rahman was away in Syria. When\nAbd ar-Rahman arrived, he said, \"Shall someone like me have this done\nto him? Am I the kind of man to have something done to him without his\nconsent?\" A'isha spoke to al-Mundhir ibn az-Zubayr, and al-Mundhir\nsaid, \"It is in the hands of Abd ar-Rahman.\" Abd ar-Rahman said, \"I\nwon't oppose something that you have already completed.\" Hafsa was\nconfirmed with al-Mundhir, and there was no divorce."}},{"id":16,"idInBook":16,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، وَأَبَا، هُرَيْرَةَ سُئِلاَ عَنِ الرَّجُلِ، يُمَلِّكُ امْرَأَتَهُ أَمْرَهَا فَتَرُدُّ ذَلِكَ إِلَيْهِ وَلاَ تَقْضِي فِيهِ شَيْئًا فَقَالاَ لَيْسَ ذَلِكَ بِطَلاَقٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Abdullah\nibn Umar and Abu Hurayra were asked about a man who gave his wife\npower over herself, and she returned it to him without doing anything\nwith it. They said that there was no divorce. (i.e. The man's giving\nhis wife power over herself was not interpreted as a desire for\ndivorce on his part.)"}},{"id":17,"idInBook":17,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ قَالَ إِذَا مَلَّكَ الرَّجُلُ امْرَأَتَهُ أَمْرَهَا فَلَمْ تُفَارِقْهُ وَقَرَّتْ عِنْدَهُ فَلَيْسَ ذَلِكَ بِطَلاَقٍ ‏.‏ قَالَ مَالِكٌ فِي الْمُمَلَّكَةِ إِذَا مَلَّكَهَا زَوْجُهَا أَمْرَهَا ثُمَّ افْتَرَقَا وَلَمْ تَقْبَلْ مِنْ ذَلِكَ شَيْئًا فَلَيْسَ بِيَدِهَا مِنْ ذَلِكَ شَىْءٌ وَهُوَ لَهَا مَا دَامَا فِي مَجْلِسِهِمَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from\nYahya ibn Said that Said ibn al-Musayyab said, \"If a man gives his\nwife authority over herself, and she does not separate from him and\nremains with him, there is no divorce.\"\n\n\nMalik said that a\nwoman whose husband gave her power over herself and they separated\nwhile she was unwilling, had no power to revoke the divorce. She only\nhad power over herself as long as they remained together."}},{"id":18,"idInBook":18,"chapterId":29,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ، عَنْ أَبِيهِ، عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ، أَنَّهُ كَانَ يَقُولُ إِذَا آلَى الرَّجُلُ مِنِ امْرَأَتِهِ لَمْ يَقَعْ عَلَيْهِ طَلاَقٌ وَإِنْ مَضَتِ الأَرْبَعَةُ الأَشْهُرِ حَتَّى يُوقَفَ فَإِمَّا أَنْ يُطَلِّقَ وَإِمَّا أَنْ يَفِيءَ ‏.‏ قَالَ مَالِكٌ وَذَلِكَ الأَمْرُ عِنْدَنَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Jafar ibn Muhammad from his\nfather that Ali ibn Abi Talib said, \"When a man takes a vow to abstain\nfrom intercourse, divorce does not occur immediately. If four months\npass, he must declare his intent and either he is divorced or he\nrevokes his vow . \"\n\n\nMalik said, \"That is what is done among\nus.\""}},{"id":19,"idInBook":19,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ كَانَ يَقُولُ أَيُّمَا رَجُلٍ آلَى مِنِ امْرَأَتِهِ فَإِنَّهُ إِذَا مَضَتِ الأَرْبَعَةُ الأَشْهُرِ وُقِفَ حَتَّى يُطَلِّقَ أَوْ يَفِيءَ وَلاَ يَقَعُ عَلَيْهِ طَلاَقٌ إِذَا مَضَتِ الأَرْبَعَةُ الأَشْهُرِ حَتَّى يُوقَفَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nsaid, \"When a man makes a vow to abstain from intercourse with his\nwife and four months have passed he must declare his intent and either\nhe is divorced or he revokes his vow. Divorce does not occur until\nfour months have passed and he continues to abstain.\""}},{"id":20,"idInBook":20,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ سَعِيدَ بْنَ الْمُسَيَّبِ، وَأَبَا، بَكْرِ بْنَ عَبْدِ الرَّحْمَنِ كَانَا يَقُولاَنِ فِي الرَّجُلِ يُولِي مِنِ امْرَأَتِهِ إِنَّهَا إِذَا مَضَتِ الأَرْبَعَةُ الأَشْهُرِ فَهِيَ تَطْلِيقَةٌ وَلِزَوْجِهَا عَلَيْهَا الرَّجْعَةُ مَا كَانَتْ فِي الْعِدَّةِ ‏.‏","english":{"narrator":"","text":"Yahya\nrelated to me from Malik from Ibn Shihab that Said al-Musayyab and Abu\nBakr ibn Abd ar-Rahman said about a man who made a vow to abstain from\nintercourse with his wife, \"If four months pass it is a divorce. The\nhusband can go back to his wife as long as she is in her idda.\""}},{"id":21,"idInBook":21,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ مَرْوَانَ بْنَ الْحَكَمِ، كَانَ يَقْضِي فِي الرَّجُلِ إِذَا آلَى مِنِ امْرَأَتِهِ أَنَّهَا إِذَا مَضَتِ الأَرْبَعَةُ الأَشْهُرِ فَهِيَ تَطْلِيقَةٌ وَلَهُ عَلَيْهَا الرَّجْعَةُ مَا دَامَتْ فِي عِدَّتِهَا ‏.‏ قَالَ مَالِكٌ وَعَلَى ذَلِكَ كَانَ رَأْىُ ابْنِ شِهَابٍ ‏.‏ قَالَ مَالِكٌ فِي الرَّجُلِ يُولِي مِنِ امْرَأَتِهِ فَيُوقَفُ فَيُطَلِّقُ عِنْدَ انْقِضَاءِ الأَرْبَعَةِ الأَشْهُرِ ثُمَّ يُرَاجِعُ امْرَأَتَهُ أَنَّهُ إِنْ لَمْ يُصِبْهَا حَتَّى تَنْقَضِيَ عِدَّتُهَا فَلاَ سَبِيلَ لَهُ إِلَيْهَا وَلاَ رَجْعَةَ لَهُ عَلَيْهَا إِلاَّ أَنْ يَكُونَ لَهُ عُذْرٌ مِنْ مَرَضٍ أَوْ سِجْنٍ أَوْ مَا أَشْبَهَ ذَلِكَ مِنَ الْعُذْرِ فَإِنَّ ارْتِجَاعَهُ إِيَّاهَا ثَابِتٌ عَلَيْهَا فَإِنْ مَضَتْ عِدَّتُهَا ثُمَّ تَزَوَّجَهَا بَعْدَ ذَلِكَ فَإِنَّهُ إِنْ لَمْ يُصِبْهَا حَتَّى تَنْقَضِيَ الأَرْبَعَةُ الأَشْهُرِ وَقَفَ أَيْضًا فَإِنْ لَمْ يَفِئْ دَخَلَ عَلَيْهِ الطَّلاَقُ بِالإِيلاَءِ الأَوَّلِ إِذَا مَضَتِ الأَرْبَعَةُ الأَشْهُرِ وَلَمْ يَكُنْ لَهُ عَلَيْهَا رَجْعَةٌ لأَنَّهُ نَكَحَهَا ثُمَّ طَلَّقَهَا قَبْلَ أَنْ يَمَسَّهَا فَلاَ عِدَّةَ لَهُ عَلَيْهَا وَلاَ رَجْعَةَ ‏.‏ قَالَ مَالِكٌ فِي الرَّجُلِ يُولِي مِنِ امْرَأَتِهِ فَيُوقَفُ بَعْدَ الأَرْبَعَةِ الأَشْهُرِ فَيُطَلِّقُ ثُمَّ يَرْتَجِعُ وَلاَ يَمَسُّهَا فَتَنْقَضِي أَرْبَعَةُ أَشْهُرٍ قَبْلَ أَنْ تَنْقَضِيَ عِدَّتُهَا إِنَّهُ لاَ يُوقَفُ وَلاَ يَقَعُ عَلَيْهِ طَلاَقٌ وَإِنَّهُ إِنْ أَصَابَهَا قَبْلَ أَنْ تَنْقَضِيَ عِدَّتُهَا كَانَ أَحَقَّ بِهَا وَإِنْ مَضَتْ عِدَّتُهَا قَبْلَ أَنْ يُصِيبَهَا فَلاَ سَبِيلَ لَهُ إِلَيْهَا وَهَذَا أَحْسَنُ مَا سَمِعْتُ فِي ذَلِكَ ‏.‏ قَالَ مَالِكٌ فِي الرَّجُلِ يُولِي مِنِ امْرَأَتِهِ ثُمَّ يُطَلِّقُهَا فَتَنْقَضِي الأَرْبَعَةُ الأَشْهُرِ قَبْلَ انْقِضَاءِ عِدَّةِ الطَّلاَقِ قَالَ هُمَا تَطْلِيقَتَانِ إِنْ هُوَ وُقِفَ وَلَمْ يَفِئْ وَإِنْ مَضَتْ عِدَّةُ الطَّلاَقِ قَبْلَ الأَرْبَعَةِ الأَشْهُرِ فَلَيْسَ الإِيلاَءُ بِطَلاَقٍ وَذَلِكَ أَنَّ الأَرْبَعَةَ الأَشْهُرِ الَّتِي كَانَتْ تُوقَفُ بَعْدَهَا مَضَتْ وَلَيْسَتْ لَهُ يَوْمَئِذٍ بِامْرَأَةٍ ‏.‏ قَالَ مَالِكٌ وَمَنْ حَلَفَ أَنْ لاَ يَطَأَ امْرَأَتَهُ يَوْمًا أَوْ شَهْرًا ثُمَّ مَكَثَ حَتَّى يَنْقَضِيَ أَكْثَرُ مِنَ الأَرْبَعَةِ الأَشْهُرِ فَلاَ يَكُونُ ذَلِكَ إِيلاَءً وَإِنَّمَا يُوقَفُ فِي الإِيلاَءِ مَنْ حَلَفَ عَلَى أَكْثَرَ مِنَ الأَرْبَعَةِ الأَشْهُرِ فَأَمَّا مَنْ حَلَفَ أَنْ لاَ يَطَأَ امْرَأَتَهُ أَرْبَعَةَ أَشْهُرٍ أَوْ أَدْنَى مِنْ ذَلِكَ فَلاَ أَرَى عَلَيْهِ إِيلاَءً لأَنَّهُ إِذَا دَخَلَ الأَجَلُ الَّذِي يُوقَفُ عِنْدَهُ خَرَجَ مِنْ يَمِينِهِ وَلَمْ يَكُنْ عَلَيْهِ وَقْفٌ ‏.‏ قَالَ مَالِكٌ مَنْ حَلَفَ لاِمْرَأَتِهِ أَنْ لاَ يَطَأَهَا حَتَّى تَفْطِمَ وَلَدَهَا فَإِنَّ ذَلِكَ لاَ يَكُونُ إِيلاَءً ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Marwan ibn\nal-Hakam decided about a man who had made a vow to abstain from\nintercourse with his wife, that when four months had passed, it was a\ndivorce and he could return to her as long as she was in her idda.\n\n\nMalik added, \"That was also the opinion of Ibn Shihab.\"\n\n\nMalik said that if a man made a vow to abstain from intercourse\nwith his wife and at the end of four months he declared his intent to\ncontinue to abstain, he was divorced. He could go back to his wife,\nbut if he did not have intercourse with her before the end of her\nidda, he had no access to her and he could not go back to her unless\nhe had an excuse - illness, imprisonment, or a similar excuse. His\nreturn to her maintained her as his wife. If her idda passed and then\nhe married her after that and did not have intercourse with her until\nfour months had passed and he declared his intent to continue to\nabstain, divorce was applied to him by the first vow. If four months\npassed, and he had not returned to her, he had no idda against her nor\naccess because he had married her and then divorced her before\ntouching her.\n\n\nMalik said that a man who made a vow to abstain\nfrom intercourse with his wife and continued to abstain after four\nmonths and so divorced her, but then returned and did not touch her\nand four months were completed before her idda was completed, did not\nhave to declare his intent and divorce did not befall him. If he had\nintercourse with her before the end of her idda, he was entitled to\nher. If her idda passed before he had intercourse with her, he had no\naccess to her. This is what Malik preferred of what he had heard on\nthe subject.\n\n\nMalik said that if a man made a vow to abstain\nfrom intercourse with his wife and then divorced her, and the four\nmonths of the vow were completed before completion of the idda of the\ndivorce, it counted as two pronouncements of divorce. If he declared\nhis intention to continue to abstain and the idda of the divorce\nfinished before the four months the vow of abstention was not a\ndivorce. That was because the four months had passed and she was not\nhis on that day.\n\n\nMalik said, \"If someone makes a vow not to\nhave intercourse with his wife for a day or a month and then waits\nuntil more than four months have passed, it is not ila. Ila only\napplies to someone who vows more than four months. As for the one who\nvows not to have intercourse with his wife for four months or less\nthan that, I do not think that it is ila because when the term enters\ninto it at which it stops, he comes out of his oath and he does not\nhave to declare his intention.\"\n\n\nMalik said, \"If someone vows\nto his wife not to have intercourse with her until her child has been\nweaned, that is not ila. I have heard that Ali ibn Abi Talib was asked\nabout that and he did not think that it was ila.\""}},{"id":22,"idInBook":22,"chapterId":29,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ سَأَلَ ابْنَ شِهَابٍ عَنْ إِيلاَءِ الْعَبْدِ، فَقَالَ هُوَ نَحْوُ إِيلاَءِ الْحُرِّ وَهُوَ عَلَيْهِ وَاجِبٌ وَإِيلاَءُ الْعَبْدِ شَهْرَانِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had asked Ibn Shihab about\nthe ila of the slave. He said that it was like the ila of the free\nman, and it put an obligation on him. The ila of the slave was two\nmonths."}},{"id":23,"idInBook":23,"chapterId":29,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ سَعِيدِ بْنِ عَمْرِو بْنِ سُلَيْمٍ الزُّرَقِيِّ، أَنَّهُ سَأَلَ الْقَاسِمَ بْنَ مُحَمَّدٍ عَنْ رَجُلٍ، طَلَّقَ امْرَأَةً إِنْ هُوَ تَزَوَّجَهَا فَقَالَ الْقَاسِمُ بْنُ مُحَمَّدٍ إِنَّ رَجُلاً جَعَلَ امْرَأَةً عَلَيْهِ كَظَهْرِ أُمِّهِ إِنْ هُوَ تَزَوَّجَهَا فَأَمَرَهُ عُمَرُ بْنُ الْخَطَّابِ إِنْ هُوَ تَزَوَّجَهَا أَنْ لاَ يَقْرَبَهَا حَتَّى يُكَفِّرَ كَفَّارَةَ الْمُتَظَاهِرِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Said ibn Amr ibn Sulaym az-\nZuraqi that he asked al-Qasim ibn Muhammad about a man who made\ndivorce conditional on his marrying a woman i.e. if he married her he\nwould automatically divorce her. Al-Qasim ibn Muhammad said, \"If a man\nmarries a woman whom he has made as his mother's back, i.e. has made\nharam for him, Umar ibn al-Khattab ordered him not to go near her if\nhe married her until he had done the kaffara for pronouncing dhihar.\""}},{"id":24,"idInBook":24,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ رَجُلاً، سَأَلَ الْقَاسِمَ بْنَ مُحَمَّدٍ وَسُلَيْمَانَ بْنَ يَسَارٍ عَنْ رَجُلٍ تَظَاهَرَ مِنِ امْرَأَتِهِ قَبْلَ أَنْ يَنْكِحَهَا فَقَالاَ إِنْ نَكَحَهَا فَلاَ يَمَسَّهَا حَتَّى يُكَفِّرَ كَفَّارَةَ الْمُتَظَاهِرِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that a man asked\nal-Qasim ibn Muhammad and Sulayman ibn Yasar about a man who\npronounced dhihar from his wife before he had married her. They said,\n\"If he marries her, he must not touch her until he has done the\nkaffara for pronouncing dhihar.\""}},{"id":25,"idInBook":25,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّهُ قَالَ فِي رَجُلٍ تَظَاهَرَ مِنْ أَرْبَعَةِ نِسْوَةٍ لَهُ بِكَلِمَةٍ وَاحِدَةٍ إِنَّهُ لَيْسَ عَلَيْهِ إِلاَّ كَفَّارَةٌ وَاحِدَةٌ ‏.‏ \n وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، مِثْلَ ذَلِكَ ‏.‏ قَالَ مَالِكٌ وَعَلَى ذَلِكَ الأَمْرُ عِنْدَنَا قَالَ اللَّهُ تَعَالَى فِي كَفَّارَةِ الْمُتَظَاهِرِ ‏{‏فَتَحْرِيرُ رَقَبَةٍ مِنْ قَبْلِ أَنْ يَتَمَاسَّا ‏}‏‏.‏ ‏{‏فَمَنْ لَمْ يَجِدْ فَصِيَامُ شَهْرَيْنِ مُتَتَابِعَيْنِ مِنْ قَبْلِ أَنْ يَتَمَاسَّا فَمَنْ لَمْ يَسْتَطِعْ فَإِطْعَامُ سِتِّينَ مِسْكِينًا‏}‏ ‏.‏ قَالَ مَالِكٌ فِي الرَّجُلِ يَتَظَاهَرُ مِنِ امْرَأَتِهِ فِي مَجَالِسَ مُتَفَرِّقَةٍ قَالَ لَيْسَ عَلَيْهِ إِلاَّ كَفَّارَةٌ وَاحِدَةٌ فَإِنْ تَظَاهَرَ ثُمَّ كَفَّرَ ثُمَّ تَظَاهَرَ بَعْدَ أَنْ يُكَفِّرَ فَعَلَيْهِ الْكَفَّارَةُ أَيْضًا ‏.‏ قَالَ مَالِكٌ وَمَنْ تَظَاهَرَ مِنِ امْرَأَتِهِ ثُمَّ مَسَّهَا قَبْلَ أَنْ يُكَفِّرَ لَيْسَ عَلَيْهِ إِلاَّ كَفَّارَةٌ وَاحِدَةٌ وَيَكُفُّ عَنْهَا حَتَّى يُكَفِّرَ وَلْيَسْتَغْفِرِ اللَّهَ وَذَلِكَ أَحْسَنُ مَا سَمِعْتُ ‏.‏ قَالَ مَالِكٌ وَالظِّهَارُ مِنْ ذَوَاتِ الْمَحَارِمِ مِنَ الرَّضَاعَةِ وَالنَّسَبِ سَوَاءٌ ‏.‏ قَالَ مَالِكٌ وَلَيْسَ عَلَى النِّسَاءِ ظِهَارٌ ‏.‏ قَالَ مَالِكٌ فِي قَوْلِ اللَّهِ تَبَارَكَ وَتَعَالَى ‏{‏وَالَّذِينَ يُظَاهِرُونَ مِنْ نِسَائِهِمْ ثُمَّ يَعُودُونَ لِمَا قَالُوا‏}‏‏.‏ قَالَ سَمِعْتُ أَنَّ تَفْسِيرَ ذَلِكَ أَنْ يَتَظَاهَرَ الرَّجُلُ مِنِ امْرَأَتِهِ ثُمَّ يُجْمِعَ عَلَى إِمْسَاكِهَا وَإِصَابَتِهَا فَإِنْ أَجْمَعَ عَلَى ذَلِكَ فَقَدْ وَجَبَتْ عَلَيْهِ الْكَفَّارَةُ وَإِنْ طَلَّقَهَا وَلَمْ يُجْمِعْ بَعْدَ تَظَاهُرِهِ مِنْهَا عَلَى إِمْسَاكِهَا وَإِصَابَتِهَا فَلاَ كَفَّارَةَ عَلَيْهِ ‏.‏ قَالَ مَالِكٌ فَإِنْ تَزَوَّجَهَا بَعْدَ ذَلِكَ لَمْ يَمَسَّهَا حَتَّى يُكَفِّرَ كَفَّارَةَ الْمُتَظَاهِرِ ‏.‏ قَالَ مَالِكٌ فِي الرَّجُلِ يَتَظَاهَرُ مِنْ أَمَتِهِ إِنَّهُ إِنْ أَرَادَ أَنْ يُصِيبَهَا فَعَلَيْهِ كَفَّارَةُ الظِّهَارِ قَبْلَ أَنْ يَطَأَهَا ‏.‏ قَالَ مَالِكٌ لاَ يَدْخُلُ عَلَى الرَّجُلِ إِيلاَءٌ فِي تَظَاهُرِهِ إِلاَّ أَنْ يَكُونَ مُضَارًّا لاَ يُرِيدُ أَنْ يَفِيءَ مِنْ تَظَاهُرِهِ ‏.","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa that his\nfather said that a man who pronounced a dhihar from his four wives in\none statement, had only to do one kaffara. Yahya related the same as\nthat to me from Malik from Rabia ibn Abi Abd ar-Rahman.\n\n\nMalik\nsaid, \"That is what is done among us. Allah, the Exalted said about\nthe kaffara for pronouncing dhihar, 'It is to free a slave before they\ntouch one another. If he does not find the means to do that, then\nfasting for two consecutive months before they touch one another. If\nhe cannot do that, it is to feed sixty poor people. ' \" (Sura 58 ayats\n4,5).\n\n\nMalik said that a man who pronounced dhihar from his\nwife on various occasions had only to do one kaffara. If he pronounced\ndhihar, and then did kaffara, and then pronounced dhihar after he had\ndone the kaffara, he had to do kaffara again.\n\n\nMalik said,\n\"Some one who pronounces dhihar from his wife and then has intercourse\nwith her before he has done kaffara, only has to do one kaffara. He\nmust abstain from her until he does kaffara and ask forgiveness of\nAllah. That is the best of what I have heard. \"\n\n\nMalik said,\n\"It is the same with dhihar using any prohibited relations of\nfosterage and ancestry.\"\n\n\nMalik said, \"Women have no dhihar.\"\n\n\nMalik said that he had heard that the commentary on the word\nof Allah, the Blessed, the Exalted, \"Those of you who pronounce the\ndhihar about their wives, and then retract what they have said,\" (Sura\n56 ayat 3), was that a man pronounced dhihar on his wife and then\ndecided to keep her and have intercourse with her. If he decided on\nthat, he must do kaffara. If he divorced her and did not decide to\nretract his dhihar of her and to keep her and have intercourse with\nher, there would be no kaffara incumbent on him.\n\n\nMaliksaid,\n\"If he marries her after that, he does not touch her until he has\ncompleted the kaffara of pronouncing dhihar.\"\n\n\nMalik said that\nif a man who pronounced dhihar from his slave-girl wanted to have\nintercourse with her, he had to do the kaffara of the dhihar before he\ncould sleep with her.\n\n\nMalik said, \"There is no ila in a man's\ndhihar unless it is evident that he does not intend to retract his\ndhihar.\""}},{"id":26,"idInBook":26,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، أَنَّهُ سَمِعَ رَجُلاً، يَسْأَلُ عُرْوَةَ بْنَ الزُّبَيْرِ عَنْ رَجُلٍ، قَالَ لاِمْرَأَتِهِ كُلُّ امْرَأَةٍ أَنْكِحُهَا عَلَيْكِ مَا عِشْتِ فَهِيَ عَلَىَّ كَظَهْرِ أُمِّي ‏.‏ فَقَالَ عُرْوَةُ بْنُ الزُّبَيْرِ يُجْزِئُهُ عَنْ ذَلِكَ عِتْقُ رَقَبَةٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa that he heard\na man ask Urwa ibn az-Zubayr about a man who said to his wife, \"Any\nwoman I marry along with you as long as you live will be like my\nmother's back to me.\" Urwa ibn az-Zubayr said, \"The freeing of slaves\nis enough to release him from that.\""}},{"id":27,"idInBook":27,"chapterId":29,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ سَأَلَ ابْنَ شِهَابٍ عَنْ ظِهَارِ الْعَبْدِ، فَقَالَ نَحْوُ ظِهَارِ الْحُرِّ ‏.‏ قَالَ مَالِكٌ يُرِيدُ أَنَّهُ يَقَعُ عَلَيْهِ كَمَا يَقَعُ عَلَى الْحُرِّ ‏.‏ قَالَ مَالِكٌ وَظِهَارُ الْعَبْدِ عَلَيْهِ وَاجِبٌ وَصِيَامُ الْعَبْدِ فِي الظِّهَارِ شَهْرَانِ ‏.‏ قَالَ مَالِكٌ فِي الْعَبْدِ يَتَظَاهَرُ مِنِ امْرَأَتِهِ إِنَّهُ لاَ يَدْخُلُ عَلَيْهِ إِيلاَءٌ وَذَلِكَ أَنَّهُ لَوْ ذَهَبَ يَصُومُ صِيَامَ كَفَّارَةِ الْمُتَظَاهِرِ دَخَلَ عَلَيْهِ طَلاَقُ الإِيلاَءِ قَبْلَ أَنْ يَفْرُغَ مِنْ صِيَامِهِ ‏.‏","english":{"narrator":"","text":"ahya related to me from Malik that he asked Ibn Shihab about the\ndhihar of a slave.  He said, \"It is like the dhihar of a free man.\"\n\n\nMalik said, \"He meant that the same conditions were applied\nin both cases.\"\n\n\nMalik said, \"The dhihar of the slave is\nincumbent on him, and the fasting of the slave in the dhihar is two\nmonths. \"\n\n\nMalik said that there was no ila for a slave who\npronounced a dhihar from his wife. That was because if he were to fast\nthe kaffara for pronouncing a dhihar, the divorce of the ila would\ncome to him before he had finished the fast."}},{"id":28,"idInBook":28,"chapterId":29,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ، أَنَّهَا قَالَتْ كَانَ فِي بَرِيرَةَ ثَلاَثُ سُنَنٍ فَكَانَتْ إِحْدَى السُّنَنِ الثَّلاَثِ أَنَّهَا أُعْتِقَتْ فَخُيِّرَتْ فِي زَوْجِهَا وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏ ‏.‏ وَدَخَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَالْبُرْمَةُ تَفُورُ بِلَحْمٍ فَقُرِّبَ إِلَيْهِ خُبْزٌ وَأُدْمٌ مِنْ أُدْمِ الْبَيْتِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَلَمْ أَرَ بُرْمَةً فِيهَا لَحْمٌ ‏\"‏ ‏.‏ فَقَالُوا بَلَى يَا رَسُولَ اللَّهِ وَلَكِنْ ذَلِكَ لَحْمٌ تُصُدِّقَ بِهِ عَلَى بَرِيرَةَ وَأَنْتَ لاَ تَأْكُلُ الصَّدَقَةَ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هُوَ عَلَيْهَا صَدَقَةٌ وَهُوَ لَنَا هَدِيَّةٌ ‏\"‏ ‏.‏","english":{"narrator":"Yahya related to me from Malik from Rabia ibn Abi Abd ar-Rahman\nfrom al-Qasim ibn Muhammad that A'isha umm al-muminin, said, \"There\nwere three sunnas established in connection with Barira:","text":"firstly was\nthat when she was set free she was given her choice about her husband,\nsecondly, the Messenger of Allah, may Allah bless him and grant him\npeace, said about her, 'The right of inheritance belongs to the person\nwho has set a person free,' thirdly, the Messenger of Allah, may Allah\nbless him and grant him peace, came in and there was a pot with meat\non the boil. Bread and condiments were brought to him from the stock\nof the house. The Messenger of Allah, may Allah bless him and grant\nhim peace, said, 'Didn't I see a pot with meat in it?' They said,\n'Yes, Messenger of Allah. That is meat which was given as sadaqa for\nBarira, and you do not eat sadaqa.' The Messenger of Allah, may Allah\nbless him and grant him peace, said, 'It is sadaqa for her, and it is\na gift for us.' \""}},{"id":29,"idInBook":29,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ كَانَ يَقُولُ فِي الأَمَةِ تَكُونُ تَحْتَ الْعَبْدِ فَتَعْتِقُ إِنَّ الأَمَةَ لَهَا الْخِيَارُ مَا لَمْ يَمَسَّهَا ‏.‏ قَالَ مَالِكٌ وَإِنْ مَسَّهَا زَوْجُهَا فَزَعَمَتْ أَنَّهَا جَهِلَتْ أَنَّ لَهَا الْخِيَارَ فَإِنَّهَا تُتَّهَمُ وَلاَ تُصَدَّقُ بِمَا ادَّعَتْ مِنَ الْجَهَالَةِ وَلاَ خِيَارَ لَهَا بَعْدَ أَنْ يَمَسَّهَا ‏.‏","english":{"narrator":"","text":"ahya related to me from Malik from Nafi that Abdullah ibn Umar\nsaid that a female slave who was the wife of a slave and then was set\nfree, had the right of choice as long as he did not have intercourse\nwith her.\n\n\nMalik said, \"If her husband has intercourse with\nher and she claims that she did not know, she still has the right of\nchoice. If she is suspect and one does not believe her claim of\nignorance, then she has no choice after he has had intercourse with\nher.\""}},{"id":30,"idInBook":30,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، أَنَّ مَوْلاَةً، لِبَنِي عَدِيٍّ يُقَالُ لَهَا زَبْرَاءُ أَخْبَرَتْهُ أَنَّهَا كَانَتْ تَحْتَ عَبْدٍ وَهِيَ أَمَةٌ يَوْمَئِذٍ فَعَتَقَتْ قَالَتْ فَأَرْسَلَتْ إِلَىَّ حَفْصَةُ زَوْجُ النَّبِيِّ صلى الله عليه وسلم فَدَعَتْنِي فَقَالَتْ إِنِّي مُخْبِرَتُكِ خَبَرًا وَلاَ أُحِبُّ أَنْ تَصْنَعِي شَيْئًا إِنَّ أَمْرَكِ بِيَدِكِ مَا لَمْ يَمْسَسْكِ زَوْجُكِ فَإِنْ مَسَّكِ فَلَيْسَ لَكِ مِنَ الأَمْرِ شَىْءٌ ‏.‏ قَالَتْ فَقُلْتُ هُوَ الطَّلاَقُ ثُمَّ الطَّلاَقُ ثُمَّ الطَّلاَقُ ‏.‏ فَفَارَقَتْهُ ثَلاَثًا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Urwa ibn az-\nZubayr that a mawla of the tribe of Banu Adi called Zabra told him\nthat she had been the wife of a slave when she was a slave-girl. Then\nshe was set free and she sent a message to Hafsa, the wife of the\nProphet, may Allah bless him and grant him peace. Hafsa called her and\nsaid, \"I will tell you something., but I would prefer that you did not\nact upon it. You have authority over yourself as long as your husband\ndoes not have intercourse with you. If he has intercourse with you,\nyou have no authority at all.\" Therefore she pronounced her divorce\nfrom him three times."}},{"id":31,"idInBook":31,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ قَالَ أَيُّمَا رَجُلٍ تَزَوَّجَ امْرَأَةً وَبِهِ جُنُونٌ أَوْ ضَرَرٌ فَإِنَّهَا تُخَيَّرُ فَإِنْ شَاءَتْ قَرَّتْ وَإِنْ شَاءَتْ فَارَقَتْ ‏.‏ قَالَ مَالِكٌ فِي الأَمَةِ تَكُونُ تَحْتَ الْعَبْدِ ثُمَّ تَعْتِقُ قَبْلَ أَنْ يَدْخُلَ بِهَا أَوْ يَمَسَّهَا إِنَّهَا إِنِ اخْتَارَتْ نَفْسَهَا فَلاَ صَدَاقَ لَهَا وَهِيَ تَطْلِيقَةٌ وَذَلِكَ الأَمْرُ عِنْدَنَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Said ibn\nal-Musayyab said that if a man married a woman, and he was insane or\nhad a physical defect, she had the right of choice. If she wished she\ncould stay, and if she wished she could separate from him."}},{"id":32,"idInBook":32,"chapterId":29,"bookId":7,"arabic":"","english":{"narrator":"","text":"Malik said that if a slave-girl, who was the wife of a slave, was\nset free before he had consummated the marriage, and she chose\nherself, then she had no bride-price and it was a pronouncement of\ndivorce. That was what was done among them."}},{"id":33,"idInBook":33,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، أَنَّهُ سَمِعَهُ يَقُولُ إِذَا خَيَّرَ الرَّجُلُ امْرَأَتَهُ فَاخْتَارَتْهُ فَلَيْسَ ذَلِكَ بِطَلاَقٍ ‏.‏ قَالَ مَالِكٌ وَذَلِكَ أَحْسَنُ مَا سَمِعْتُ ‏.‏ قَالَ مَالِكٌ فِي الْمُخَيَّرَةِ إِذَا خَيَّرَهَا زَوْجُهَا فَاخْتَارَتْ نَفْسَهَا فَقَدْ طَلُقَتْ ثَلاَثًا وَإِنْ قَالَ زَوْجُهَا لَمْ أُخَيِّرْكِ إِلاَّ وَاحِدَةً فَلَيْسَ لَهُ ذَلِكَ ‏.‏ وَذَلِكَ أَحْسَنُ مَا سَمِعْتُهُ ‏.‏ قَالَ مَالِكٌ وَإِنْ خَيَّرَهَا فَقَالَتْ قَدْ قَبِلْتُ وَاحِدَةً وَقَالَ لَمْ أُرِدْ هَذَا وَإِنَّمَا خَيَّرْتُكِ فِي الثَّلاَثِ جَمِيعًا أَنَّهَا إِنْ لَمْ تَقْبَلْ إِلاَّ وَاحِدَةً أَقَامَتْ عِنْدَهُ عَلَى نِكَاحِهَا وَلَمْ يَكُنْ ذَلِكَ فِرَاقًا إِنْ شَاءَ اللَّهُ تَعَالَى ‏.‏","english":{"narrator":"","text":"Yahya related to me that Malik heard Ibn Shihab say, \"When a man\ngives his wife the right of choice, and she chooses him, that is not\ndivorce.\"\n\n\nMalik added, \"That is the best of what I have\nheard.\"\n\n\nMalik said that if a woman who had been given the\nright of choice by her husband chose herself, she was divorced trebly.\nIf her husband said, \"But I only gave her the right of choice in one,\"\nhe had none of that. That was the best of what he had heard.\n\n\nMalik said, \"If the man gives his wife the right of choice and she\nsays, 'I accept one', and he says, 'I did not mean that, I have given\nthe right of choice in all three together,' then if she only accepts\none, she remains with him in her marriage, and that is not separation\nif Allah, the Exalted wills.\""}},{"id":34,"idInBook":34,"chapterId":29,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، أَنَّهَا أَخْبَرَتْهُ عَنْ حَبِيبَةَ بِنْتِ سَهْلٍ الأَنْصَارِيِّ، أَنَّهَا كَانَتْ تَحْتَ ثَابِتِ بْنِ قَيْسِ بْنِ شَمَّاسٍ وَأَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَرَجَ إِلَى الصُّبْحِ فَوَجَدَ حَبِيبَةَ بِنْتَ سَهْلٍ عِنْدَ بَابِهِ فِي الْغَلَسِ فَقَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ هَذِهِ ‏\"‏ ‏.‏ فَقَالَتْ أَنَا حَبِيبَةُ بِنْتُ سَهْلٍ يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\"‏ مَا شَأْنُكِ ‏\"‏ ‏.‏ قَالَتْ لاَ أَنَا وَلاَ ثَابِتُ بْنُ قَيْسٍ ‏.‏ لِزَوْجِهَا فَلَمَّا جَاءَ زَوْجُهَا ثَابِتُ بْنُ قَيْسٍ قَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَذِهِ حَبِيبَةُ بِنْتُ سَهْلٍ قَدْ ذَكَرَتْ مَا شَاءَ اللَّهُ أَنْ تَذْكُرَ ‏\"‏ ‏.‏ فَقَالَتْ حَبِيبَةُ يَا رَسُولَ اللَّهِ كُلُّ مَا أَعْطَانِي عِنْدِي ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِثَابِتِ بْنِ قَيْسٍ ‏\"‏ خُذْ مِنْهَا ‏\"‏ ‏.‏ فَأَخَذَ مِنْهَا وَجَلَسَتْ فِي بَيْتِ أَهْلِهَا ‏.‏","english":{"narrator":"","text":"Yahya related. to me from Malik from Yahya ibn Said that Amra\nbint Abd ar-Rahman told him from Habiba bint Sahl al-Ansari that she\nhad been the wife of Thabit ibn Qays ibn Shammas. The Messenger of\nAllah, may Allah bless him and grant him peace, went out for the dawn\nprayer, and found Habiba bint Sahl at his door in the darkness. The\nMessenger of Allah, may Allah bless him and grant him peace, said to\nher, \"Who is this?\" She said, \"I am Habiba bint Sahl, Messenger of\nAllah.\" He said, \"What do you want?\" She said, \"That Thabit ibn Qays\nand I separate.\" When her husband, Thabit ibn Qays came, the Messenger\nof Allah, may Allah bless him and grant him peace, said to him, \"This\nis Habiba bint Sahl. She mentioned what Allah willed that she\nmention.\" Habiba said, \"Messenger of Allah, all that he has given me\nis with me!\" The Messenger of Allah, may Allah bless him and grant him\npeace, said to Thabit ibn Qays, \"Take it from her,\" and he took it\nfrom her, and she stayed in the house of her family."}},{"id":35,"idInBook":35,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ مَوْلاَةٍ، لِصَفِيَّةَ بِنْتِ أَبِي عُبَيْدٍ ‏.‏ أَنَّهَا اخْتَلَعَتْ مِنْ زَوْجِهَا بِكُلِّ شَىْءٍ لَهَا فَلَمْ يُنْكِرْ ذَلِكَ عَبْدُ اللَّهِ بْنُ عُمَرَ ‏.‏ قَالَ مَالِكٌ فِي الْمُفْتَدِيَةِ الَّتِي تَفْتَدِي مِنْ زَوْجِهَا أَنَّهُ إِذَا عُلِمَ أَنَّ زَوْجَهَا أَضَرَّ بِهَا وَضَيَّقَ عَلَيْهَا وَعُلِمَ أَنَّهُ ظَالِمٌ لَهَا مَضَى الطَّلاَقُ وَرَدَّ عَلَيْهَا مَالَهَا ‏.‏ قَالَ فَهَذَا الَّذِي كُنْتُ أَسْمَعُ وَالَّذِي عَلَيْهِ أَمْرُ النَّاسِ عِنْدَنَا ‏.‏ قَالَ مَالِكٌ لاَ بَأْسَ بِأَنْ تَفْتَدِيَ الْمَرْأَةُ مِنْ زَوْجِهَا بِأَكْثَرَ مِمَّا أَعْطَاهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi from a mawla of Safiyya\nbint Abi Ubayd that she gave all that she possessed to her husband as\ncompensation for her divorce from him, and Abdullah ibn Umar did not\ndisapprove of that.\n\n\nMalik said that divorce was ratified for\na woman who ransomed herself from her husband, when it was known that\nher husband was detrimental to her and was oppressive for her, and it\nwas known that he wronged her, and he had to return her property to\nher. Malik added, \"This is what I have heard, and it is what is done\namong us.\"\n\n\nMalik said, \"There is no harm if a woman ransoms\nherself from her husband for more than he gave her.\""}},{"id":36,"idInBook":36,"chapterId":29,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ رُبَيِّعَ بِنْتَ مُعَوِّذِ بْنِ عَفْرَاءَ، جَاءَتْ هِيَ وَعَمُّهَا إِلَى عَبْدِ اللَّهِ بْنِ عُمَرَ فَأَخْبَرَتْهُ أَنَّهَا اخْتَلَعَتْ مِنْ زَوْجِهَا فِي زَمَانِ عُثْمَانَ بْنِ عَفَّانَ فَبَلَغَ ذَلِكَ عُثْمَانَ بْنَ عَفَّانَ فَلَمْ يُنْكِرْهُ ‏.‏ وَقَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ عِدَّتُهَا عِدَّةُ الْمُطَلَّقَةِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Rubayyi bint\nMuawwidh ibn Afra came with her paternal uncle to Abdullah ibn Umar\nand told him that she had divorced her husband for a compensation in\nthe time of Uthman ibn Affan, and he heard about it and did not\ndisapprove. Abdullah ibn Umar said, \"Her idda is the idda of a\ndivorced woman.\""}},{"id":37,"idInBook":37,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ سَعِيدَ بْنَ الْمُسَيَّبِ، وَسُلَيْمَانَ بْنَ يَسَارٍ، وَابْنَ، شِهَابٍ كَانُوا يَقُولُونَ عِدَّةُ الْمُخْتَلِعَةِ مِثْلُ عِدَّةِ الْمُطَلَّقَةِ ثَلاَثَةُ قُرُوءٍ ‏.‏ قَالَ مَالِكٌ فِي الْمُفْتَدِيَةِ إِنَّهَا لاَ تَرْجِعُ إِلَى زَوْجِهَا إِلاَّ بِنِكَاحٍ جَدِيدٍ فَإِنْ هُوَ نَكَحَهَا فَفَارَقَهَا قَبْلَ أَنْ يَمَسَّهَا لَمْ يَكُنْ لَهُ عَلَيْهَا عِدَّةٌ مِنَ الطَّلاَقِ الآخَرِ وَتَبْنِي عَلَى عِدَّتِهَا الأُولَى ‏.‏ قَالَ مَالِكٌ وَهَذَا أَحْسَنُ مَا سَمِعْتُ فِي ذَلِكَ ‏.‏ قَالَ مَالِكٌ إِذَا افْتَدَتِ الْمَرْأَةُ مِنْ زَوْجِهَا بِشَىْءٍ عَلَى أَنْ يُطَلِّقَهَا فَطَلَّقَهَا طَلاَقًا مُتَتَابِعًا نَسَقًا فَذَلِكَ ثَابِتٌ عَلَيْهِ فَإِنْ كَانَ بَيْنَ ذَلِكَ صُمَاتٌ فَمَا أَتْبَعَهُ بَعْدَ الصُّمَاتِ فَلَيْسَ بِشَىْءٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had\nheard that Said ibn al-Musayyab and Sulayman ibn Yasar and Ibn Shihab\nall said that a woman who divorced for a compensation had the same\nidda as a divorced woman - three periods.\n\n\nMalik said that a\nwoman who ransomed herself could not return to her husband except by a\nnew marriage. If someone married her and then separated from her\nbefore he had intercourse with her, there was no idda against her from\nthe recent marriage, and she rested on her first idda.\n\n\nMalik\nsaid, \"That is the best that I have heard on the matter.\"\n\n\nMalik said, \"If, when a woman offers to compensate her husband, he\ndivorces her straightaway, then that compensation is confirmed for\nhim. If he makes no response, and then at a later date, does divorce\nher, he is not entitled to that compensation.\""}},{"id":38,"idInBook":38,"chapterId":29,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ سَهْلَ بْنَ سَعْدٍ السَّاعِدِيَّ، أَخْبَرَهُ أَنَّ عُوَيْمِرًا الْعَجْلاَنِيَّ جَاءَ إِلَى عَاصِمِ بْنِ عَدِيٍّ الأَنْصَارِيِّ فَقَالَ لَهُ يَا عَاصِمُ أَرَأَيْتَ رَجُلاً وَجَدَ مَعَ امْرَأَتِهِ رَجُلاً أَيَقْتُلُهُ فَتَقْتُلُونَهُ أَمْ كَيْفَ يَفْعَلُ سَلْ لِي يَا عَاصِمُ عَنْ ذَلِكَ رَسُولَ اللَّهِ صلى الله عليه وسلم ‏.‏ فَسَأَلَ عَاصِمٌ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ ذَلِكَ فَكَرِهَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَسَائِلَ وَعَابَهَا حَتَّى كَبُرَ عَلَى عَاصِمٍ مَا سَمِعَ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَلَمَّا رَجَعَ عَاصِمٌ إِلَى أَهْلِهِ جَاءَهُ عُوَيْمِرٌ فَقَالَ يَا عَاصِمُ مَاذَا قَالَ لَكَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ عَاصِمٌ لِعُوَيْمِرٍ لَمْ تَأْتِنِي بِخَيْرٍ قَدْ كَرِهَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَسْأَلَةَ الَّتِي سَأَلْتُهُ عَنْهَا ‏.‏ فَقَالَ عُوَيْمِرٌ وَاللَّهِ لاَ أَنْتَهِي حَتَّى أَسْأَلَهُ عَنْهَا ‏.‏ فَأَقْبَلَ عُوَيْمِرٌ حَتَّى أَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم وَسْطَ النَّاسِ فَقَالَ يَا رَسُولَ اللَّهِ أَرَأَيْتَ رَجُلاً وَجَدَ مَعَ امْرَأَتِهِ رَجُلاً أَيَقْتُلُهُ فَتَقْتُلُونَهُ أَمْ كَيْفَ يَفْعَلُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ قَدْ أُنْزِلَ فِيكَ وَفِي صَاحِبَتِكَ فَاذْهَبْ فَأْتِ بِهَا ‏\"‏ ‏.‏ قَالَ سَهْلٌ فَتَلاَعَنَا وَأَنَا مَعَ النَّاسِ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَلَمَّا فَرَغَا مِنْ تَلاَعُنِهِمَا قَالَ عُوَيْمِرٌ كَذَبْتُ عَلَيْهَا يَا رَسُولَ اللَّهِ إِنْ أَمْسَكْتُهَا ‏.‏ فَطَلَّقَهَا ثَلاَثًا قَبْلَ أَنْ يَأْمُرَهُ رَسُولُ اللَّهِ ‏.‏ وَقَالَ مَالِكٌ قَالَ ابْنُ شِهَابٍ فَكَانَتْ تِلْكَ بَعْدُ سُنَّةَ الْمُتَلاَعِنَيْنِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab that Sahl ibn Sad\nas-Saidi told him that Uwaymir al-Ajlani came to Asim ibn Adi al-\nAnsari and said to him, \"Asim! What do you think a man who finds\nanother man with his wife should do? Should he kill him and then be\nkilled himself, or what should .he do? Asim! ask the Messenger of\nAllah, may Allah bless him and grant him peace, about that for me.\"\nAsim asked the Messenger of Allah, may Allah bless him and grant him\npeace, about it. The Messenger of Allah, may Allah bless him and grant\nhim peace, was revolted by the questions and reproved them until what\nhe heard from the Messenger of Allah, may Allah bless him and grant\nhim peace. was intolerable for Asim. When Asim returned to his people,\nUwaymir came to him and said, \" Asim! what did the Messenger of Allah,\nmay Allah bless him and grant him peace, say to you?\" Asim said to\nUwaymir, \"You didn't bring me any good. The Messenger of Allah, may\nAllah bless him and grant him peace, was revolted by the question\nwhich I asked him.\" Uwaymir said, \"By Allah! I will not stop until I\nask him about it!\" Uwaymir stood up and went to the Messenger of\nAllah, may Allah bless him and grant him peace, in the middle of the\npeople and said, \"Messenger of Allah! What do you think a man who\nfinds another man with his wife should do? Should he kill him and then\nbe killed himself, or what should he do?\" The Messenger of Allah, may\nAllah bless him and grant him peace, said, \"Something has been sent\ndown about you and your wife, so go and bring her.\"\n\n\nSahl\ncontinued, \"They mutually cursed one another in the presence of the\nMessenger, may Allah bless him and grant him peace, and I was present\nwith the people. When they finished cursing each other, Uwaymir said,\n'I shall have lied about her, Messenger of Allah, if I keep her,' and\npronounced the divorce three times before the Messenger of Allah, may\nAllah bless him and grant him peace, ordered him to do it.\"\n\n\nMalik said that Ibn Shihab said, \"That was how the sunna of a couple\nmutually cursing each other was established (lian).\""}},{"id":39,"idInBook":39,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَجُلاً، لاَعَنَ امْرَأَتَهُ فِي زَمَانِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَانْتَفَلَ مِنْ وَلَدِهَا فَفَرَّقَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَيْنَهُمَا وَأَلْحَقَ الْوَلَدَ بِالْمَرْأَةِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafic from Abdullah ibn Umar\nthat a man cursed his wife in the time of the Messenger of Allah, may\nAllah bless him and grant him peace, and disowned her child. The\nMessenger of Allah, may Allah bless him and grant him peace, separated\nthem and gave the child to the woman.\n\n\nMalik said, \"Allah the\nBlessed, the Exalted, said, 'The testimony of men who accuse their\nwives but do not have any witnesses except themselves is to testify by\nAllah four times that he is being truthful, and a fifth time, that the\ncurse of Allah will be upon him, if he should be a liar. She will\navoid punishment if she testifies by Allah four times that he is a\nliar, and a fifth time, that the wrath of Allah shall be upon her, if\nhe should be telling the truth. ' \"(Sura 24 ayat 6).\n\n\nMalik\nsaid, \"The sunna with us is that those who curse each other are never\nto be remarried. If the man calls himself a liar, (i.e. takes back his\naccusation), he is flogged with the hadd-punishment, and the child is\ngiven to him, and his wife can never return to him. There is no doubt\nor dispute about this sunna among us. \"\n\n\nMalik said, \"If a man\nseparates from his wife by an irrevocable divorce by which he cannot\nreturn to her, and then he denies the paternity of the child she is\ncarrying, whilst she claims that he is the father, and it is possible\nby the timing, that he be so, he must curse her, and the child is not\nrecognised as his.\"\n\n\nMalik said, \"That is what is done among\nus, and it is what I have heard from the people of knowledge.\"\n\n\nMalik said that a man who accused his wife after he had divorced\nher trebly while she was pregnant, and he had at first accepted being\nthe father but then claimed that he had seen her committing adultery\nbefore he separated from her, was flogged with the hadd-punishment,\nand did not curse her.\n\n\nIf he denied the paternity of her\nchild after he had divorced her trebly, and he had not previously\naccepted it, then he cursed her.\n\n\nMalik said, \"This is what I\nhave heard.\"\n\n\nMalik said, \"The slave is in the same position\nas the free man as regards making accusations and invoking mutual\ncurses (lian). He acts in the lian as the free man acts although there\nis no hadd applied for slandering a female-slave.\"\n\n\nMalik\nsaid, \"The muslim slave-girl and the christian and jewish free woman\nalso do lian when a free muslim marries one of them and has\nintercourse with her. That is because Allah - may He be blessed and\nExalted, said in His Book, 'As for those who accuse their wives,' and\nthey are their wives. This is what is done among us.\n\n\nMalik\nsaid that a man who did the lian with his wife, and then stopped and\ncalled himself a liar after one or two oaths and he had not cursed\nhimself in the fifth one, had to be flogged with the hadd-punishment,\nbut they did not have to be separated.\n\n\nMalik said that if a\nman divorced his wife and then after three months the woman said, \"I\nam pregnant,\" and he denied paternity, then he had to do lian.\n\n\nMalik said that the husband of a female slave who pronounced the\nlian on her and then bought her, was not to have intercourse with her,\neven if he owned her. The sunna which had been handed down about a\ncouple who mutually cursed each other in the lian was that they were\nnever to return to each other.\n\n\nMalik said that when a man\npronounced the lian against his wife before he had consummated the\nmarriage, she only had half of the bride price."}},{"id":40,"idInBook":40,"chapterId":29,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عُرْوَةَ بْنَ الزُّبَيْرِ، كَانَ يَقُولُ فِي وَلَدِ الْمُلاَعَنَةِ وَوَلَدِ الزِّنَا أَنَّهُ إِذَا مَاتَ وَرِثَتْهُ أُمُّهُ حَقَّهَا فِي كِتَابِ اللَّهِ تَعَالَى وَإِخْوَتُهُ لأُمِّهِ حُقُوقَهُمْ وَيَرِثُ الْبَقِيَّةَ مَوَالِي أُمِّهِ إِنْ كَانَتْ مَوْلاَةً وَإِنْ كَانَتْ عَرَبِيَّةً وَرِثَتْ حَقَّهَا وَوَرِثَ إِخْوَتُهُ لأُمِّهِ حُقُوقَهُمْ وَكَانَ مَا بَقِيَ لِلْمُسْلِمِينَ ‏.‏ \n قَالَ مَالِكٌ وَبَلَغَنِي عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، مِثْلُ ذَلِكَ ‏.‏ وَعَلَى ذَلِكَ أَدْرَكْتُ أَهْلَ الْعِلْمِ بِبَلَدِنَا ‏.","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that `Urwa ibn az-Zubayr said that if the child of the woman against whom li`an had been\npronounced or the child of fornication, died, his mother inherited\nfrom him her right in the Book of Allah the Exalted, and his maternal\nhalf-brothers had their rights. The rest was inherited by the owners\nof his mother's wala' if she was a freed slave. If she was an ordinary\nfree woman, she inherited her right, his maternal brothers inherited\ntheir rights, and the rest went to the Muslims.\n\n\nMalik said,\"I\nheard the same as  that from Sulayman ibn Yasar, and it is what I saw\nthe people of knowledge in our city doing.\""}},{"id":41,"idInBook":41,"chapterId":29,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ ثَوْبَانَ، عَنْ مُحَمَّدِ بْنِ إِيَاسِ بْنِ الْبُكَيْرِ، أَنَّهُ قَالَ طَلَّقَ رَجُلٌ امْرَأَتَهُ ثَلاَثًا قَبْلَ أَنْ يَدْخُلَ بِهَا ثُمَّ بَدَا لَهُ أَنْ يَنْكِحَهَا فَجَاءَ يَسْتَفْتِي فَذَهَبْتُ مَعَهُ أَسْأَلُ لَهُ فَسَأَلَ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ وَأَبَا هُرَيْرَةَ عَنْ ذَلِكَ فَقَالاَ لاَ نَرَى أَنْ تَنْكِحَهَا حَتَّى تَنْكِحَ زَوْجًا غَيْرَكَ ‏.‏ قَالَ فَإِنَّمَا طَلاَقِي إِيَّاهَا وَاحِدَةٌ ‏.‏ قَالَ ابْنُ عَبَّاسٍ إِنَّكَ أَرْسَلْتَ مِنْ يَدِكَ مَا كَانَ لَكَ مِنْ فَضْلٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Muhammad ibn\nAbd ar-Rahman ibn Thawban that Muhammad ibn Iyas ibn al-Bukayr said,\n\"A man divorced his wife three times before he had consummated the\nmarriage, and then it seemed good to him to marry her. Therefore, he\nwanted an opinion, and I went with him to ask Abdullah ibn Abbas and\nAbu Hurayra on his behalf about it, and they said, 'We do not think\nthat you should marry her until she has married another husband.' He\nprotested that his divorcing her had been only once. Ibn Abbas said,\n'You threw away what you had of blessing.' \""}},{"id":42,"idInBook":42,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ بْنِ الأَشَجِّ، عَنِ النُّعْمَانِ بْنِ أَبِي عَيَّاشٍ الأَنْصَارِيِّ، عَنْ عَطَاءِ بْنِ يَسَارٍ، أَنَّهُ قَالَ جَاءَ رَجُلٌ يَسْأَلُ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ الْعَاصِ عَنْ رَجُلٍ طَلَّقَ امْرَأَتَهُ ثَلاَثًا قَبْلَ أَنْ يَمَسَّهَا قَالَ عَطَاءٌ فَقُلْتُ إِنَّمَا طَلاَقُ الْبِكْرِ وَاحِدَةٌ ‏.‏ فَقَالَ لِي عَبْدُ اللَّهِ بْنُ عَمْرِو بْنِ الْعَاصِ إِنَّمَا أَنْتَ قَاصٌّ الْوَاحِدَةُ تُبِينُهَا وَالثَّلاَثَةُ تُحَرِّمُهَا حَتَّى تَنْكِحَ زَوْجًا غَيْرَهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said from Bukayr\nibn Abdullah al-Ashajj from an-Numan ibn Abi Ayyash al Ansari from Ata\nibn Yasar that a man came and asked Abdullah ibn Amr ibn al-As about a\nman who divorced his wife three times before he had had intercourse\nwith her Ata said, \"The divorce of the virgin is one. Abdullah ibn Amr\nibn al-As said to me, 'You say one pronouncement separates her and\nthree makes her haram until she has married another husband.' \""}},{"id":43,"idInBook":43,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ بْنِ الأَشَجِّ، أَنَّهُ أَخْبَرَهُ عَنْ مُعَاوِيَةَ بْنِ أَبِي عَيَّاشٍ الأَنْصَارِيِّ، أَنَّهُ كَانَ جَالِسًا مَعَ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ وَعَاصِمِ بْنِ عُمَرَ بْنِ الْخَطَّابِ قَالَ فَجَاءَهُمَا مُحَمَّدُ بْنُ إِيَاسِ بْنِ الْبُكَيْرِ فَقَالَ إِنَّ رَجُلاً مِنْ أَهْلِ الْبَادِيَةِ طَلَّقَ امْرَأَتَهُ ثَلاَثًا قَبْلَ أَنْ يَدْخُلَ بِهَا فَمَاذَا تَرَيَانِ فَقَالَ عَبْدُ اللَّهِ بْنُ الزُّبَيْرِ إِنَّ هَذَا الأَمْرَ مَا لَنَا فِيهِ قَوْلٌ فَاذْهَبْ إِلَى عَبْدِ اللَّهِ بْنِ عَبَّاسٍ وَأَبِي هُرَيْرَةَ فَإِنِّي تَرَكْتُهُمَا عِنْدَ عَائِشَةَ فَسَلْهُمَا ثُمَّ ائْتِنَا فَأَخْبِرْنَا ‏.‏ فَذَهَبَ فَسَأَلَهُمَا فَقَالَ ابْنُ عَبَّاسٍ لأَبِي هُرَيْرَةَ أَفْتِهِ يَا أَبَا هُرَيْرَةَ فَقَدْ جَاءَتْكَ مُعْضِلَةٌ ‏.‏ فَقَالَ أَبُو هُرَيْرَةَ الْوَاحِدَةُ تُبِينُهَا وَالثَّلاَثَةُ تُحَرِّمُهَا حَتَّى تَنْكِحَ زَوْجًا غَيْرَهُ ‏.‏ وَقَالَ ابْنُ عَبَّاسٍ مِثْلَ ذَلِكَ ‏.‏ قَالَ مَالِكٌ وَعَلَى ذَلِكَ الأَمْرُ عِنْدَنَا وَالثَّيِّبُ إِذَا مَلَكَهَا الرَّجُلُ فَلَمْ يَدْخُلْ بِهَا إِنَّهَا تَجْرِي مَجْرَى الْبِكْرِ الْوَاحِدَةُ تُبِينُهَا وَالثَّلاَثُ تُحَرِّمُهَا حَتَّى تَنْكِحَ زَوْجًا غَيْرَهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said that Bukayr\nibn Abdullah al-Ashajj informed him that Muawiya ibn Abi Ayyash al-\nAnsari told him that he was sitting with Abdullah ibn az-Zubayr and\nAsim ibn Umar ibn al-Khattab when Muhammad ibn Iyas ibn al-Bukayr came\nup to them and said, \"A man from the desert has divorced his wife\nthree times before consummating the marriage, what do you think?\"\nAbdullah ibn az-Zubayr said \"This is something about which we have no\nstatement. Go to Abdullah ibn Abbas and Abu Hurayra. I left them with\nA'isha. Ask them and then come and tell us.\" He went and asked them.\nIbn Abbas said to Abu Hurayra, \"Give an opinion, Abu Hurayra! A\ndifficult one has come to you.\" Abu Hurayra said, \"One pronouncement\nseparates her and three makes her haram until she has married another\nhusband.\" Ibn Abbas said the like of that.\n\n\nMalik said, \"That\nis what is done among us, and when a man marries a woman who has been\nmarried before, and he has not had intercourse with her, she is\ntreated as a virgin - one pronouncement separates her and three make\nher haram until she has married another husband.\""}},{"id":44,"idInBook":44,"chapterId":29,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ طَلْحَةَ بْنِ عَبْدِ اللَّهِ بْنِ عَوْفٍ، - قَالَ وَكَانَ أَعْلَمَهُمْ بِذَلِكَ - وَعَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ عَوْفٍ، طَلَّقَ امْرَأَتَهُ الْبَتَّةَ وَهُوَ مَرِيضٌ فَوَرَّثَهَا عُثْمَانُ بْنُ عَفَّانَ مِنْهُ بَعْدَ انْقِضَاءِ عِدَّتِهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab that Talha ibn\nAbdullah ibn Awf said, and he knew that better than them, from Abu\nSalama ibn Abd ar-Rahman ibn Awf that Abd ar-Rahman ibn Awf divorced\nhis wife irrevocably while he was terminally ill, and Uthman ibn Affan\nmade her an heir after the end of her idda."}},{"id":45,"idInBook":45,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ الْفَضْلِ، عَنِ الأَعْرَجِ، أَنَّ عُثْمَانَ بْنَ عَفَّانَ، وَرَّثَ نِسَاءَ ابْنِ مُكْمِلٍ مِنْهُ وَكَانَ طَلَّقَهُنَّ وَهُوَ مَرِيضٌ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abdullah ibn al-Fadl from al-\nAraj that Uthman ibn Affan made the wives of ibn Mukmil inherit from\nhim, and he had divorced them while he was terminally ill."}},{"id":46,"idInBook":46,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ سَمِعَ رَبِيعَةَ بْنَ أَبِي عَبْدِ الرَّحْمَنِ، يَقُولُ بَلَغَنِي أَنَّ امْرَأَةَ، عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ سَأَلَتْهُ أَنْ يُطَلِّقَهَا فَقَالَ إِذَا حِضْتِ ثُمَّ طَهُرْتِ فَآذِنِينِي فَلَمْ تَحِضْ حَتَّى مَرِضَ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ فَلَمَّا طَهُرَتْ آذَنَتْهُ فَطَلَّقَهَا الْبَتَّةَ أَوْ تَطْلِيقَةً لَمْ يَكُنْ بَقِيَ لَهُ عَلَيْهَا مِنَ الطَّلاَقِ غَيْرُهَا وَعَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ يَوْمَئِذٍ مَرِيضٌ فَوَرَّثَهَا عُثْمَانُ بْنُ عَفَّانَ مِنْهُ بَعْدَ انْقِضَاءِ عِدَّتِهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he heard Rabia ibn Abi Abd\nar-Rahman say, ''I heard that the wife of Abd ar-Rahman ibn Awf asked\nhim to divorce her. He said, 'When you have menstruated and are pure,\nthen come to me.' She did not menstruate until Abd ar-Rahman ibn Awf\nwas ill. When she was purified, she told him and he divorced her\nirrevocably or made a pronouncement of divorce which was all that he\nhad left over her Abd arRahman ibn Awf was terminally ill at the time,\nso Uthman ibn Affan made her one of the heirs after the end of her\nidda.\""}},{"id":47,"idInBook":47,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، قَالَ كَانَتْ عِنْدَ جَدِّي حَبَّانَ امْرَأَتَانِ هَاشِمِيَّةٌ وَأَنْصَارِيَّةٌ فَطَلَّقَ الأَنْصَارِيَّةَ وَهِيَ تُرْضِعُ فَمَرَّتْ بِهَا سَنَةٌ ثُمَّ هَلَكَ عَنْهَا وَلَمْ تَحِضْ فَقَالَتْ أَنَا أَرِثُهُ لَمْ أَحِضْ فَاخْتَصَمَتَا إِلَى عُثْمَانَ بْنِ عَفَّانَ فَقَضَى لَهَا بِالْمِيرَاثِ فَلاَمَتِ الْهَاشِمِيَّةُ عُثْمَانَ فَقَالَ هَذَا عَمَلُ ابْنِ عَمِّكِ هُوَ أَشَارَ عَلَيْنَا بِهَذَا يَعْنِي عَلِيَّ بْنَ أَبِي طَالِبٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said that Muhammad\nibn Yahya ibn Habban said, \"My grandfather Habban had two wives, one\nfrom the Hashimites and one from the Ansars. He divorced the Ansariyya\nwhile she was nursing, and a year passed and he died and she had still\nnot yet menstruated. She said, 'I inherit from him. I have not\nmenstruated yet.' The wives quarrelled and went to Uthman ibn Affan.\nHe decided that she did inherit, and the Hashimiyya rebuked Uthman. He\nsaid, 'This is the practice of the son of your paternal uncle. He\npointed this out to us.' He meant Ali ibn Abi Talib.\""}},{"id":48,"idInBook":48,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ سَمِعَ ابْنَ شِهَابٍ، يَقُولُ إِذَا طَلَّقَ الرَّجُلُ امْرَأَتَهُ ثَلاَثًا وَهُوَ مَرِيضٌ فَإِنَّهَا تَرِثُهُ ‏.‏ قَالَ مَالِكٌ وَإِنْ طَلَّقَهَا وَهُوَ مَرِيضٌ قَبْلَ أَنْ يَدْخُلَ بِهَا فَلَهَا نِصْفُ الصَّدَاقِ وَلَهَا الْمِيرَاثُ وَلاَ عِدَّةَ عَلَيْهَا وَإِنْ دَخَلَ بِهَا ثُمَّ طَلَّقَهَا فَلَهَا الْمَهْرُ كُلُّهُ وَالْمِيرَاثُ الْبِكْرُ وَالثَّيِّبُ فِي هَذَا عِنْدَنَا سَوَاءٌ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard Ibn Shihab say,\n\"When a man who is terminally ill divorces his wife three times, she\ninherits from him.\"\n\n\nMalik said, \"If he divorces her while he\nis terminally ill before he has consummated the marriage, she has half\nof the bride-price and inherits, and she does not have to do an idda.\nIf he consummated the marriage, she has all the dowry and inherits.\nThe virgin and the previously married woman are the same in this\nsituation according to us.\""}},{"id":49,"idInBook":49,"chapterId":29,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ عَوْفٍ، طَلَّقَ امْرَأَةً لَهُ فَمَتَّعَ بِوَلِيدَةٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Abd ar-\nRahman ibn Awf divorced his wife, and gave her compensation in the\nform of a slave-girl."}},{"id":50,"idInBook":50,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ كَانَ يَقُولُ لِكُلِّ مُطَلَّقَةٍ مُتْعَةٌ إِلاَّ الَّتِي تُطَلَّقُ وَقَدْ فُرِضَ لَهَا صَدَاقٌ وَلَمْ تُمَسَّ فَحَسْبُهَا نِصْفُ مَا فُرِضَ لَهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from\nNafi that Abdullah ibn Umar said, \"Every divorced woman has\ncompensation except for the one who is divorced and is allocated a\nbride-price and has not been touched. She has half of what was\nallocated to her.\""}},{"id":51,"idInBook":51,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، أَنَّهُ قَالَ لِكُلِّ مُطَلَّقَةٍ مُتْعَةٌ ‏.‏ \n قَالَ مَالِكٌ وَبَلَغَنِي عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، مِثْلُ ذَلِكَ ‏.‏ قَالَ مَالِكٌ لَيْسَ لِلْمُتْعَةِ عِنْدَنَا حَدٌّ مَعْرُوفٌ فِي قَلِيلِهَا وَلاَ كَثِيرِهَا ‏.","english":{"narrator":"","text":"Yahya related to me from Malik that Ibn Shihab said, \"Every\ndivorced woman has compensation.\" \n\n\nMalik said, \"I have also\nheard the same as that from al-Qasim ibn Muhammad.\"\n\n\nMalik\nsaid, \"There is no fixed limit among us as to how small or large the\ncompensation is.\""}},{"id":52,"idInBook":52,"chapterId":29,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، أَنَّ نُفَيْعًا، مُكَاتَبًا كَانَ لأُمِّ سَلَمَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَوْ عَبْدًا لَهَا كَانَتْ تَحْتَهُ امْرَأَةٌ حُرَّةٌ فَطَلَّقَهَا اثْنَتَيْنِ ثُمَّ أَرَادَ أَنْ يُرَاجِعَهَا فَأَمَرَهُ أَزْوَاجُ النَّبِيِّ صلى الله عليه وسلم أَنْ يَأْتِيَ عُثْمَانَ بْنَ عَفَّانَ فَيَسْأَلَهُ عَنْ ذَلِكَ فَلَقِيَهُ عِنْدَ الدَّرَجِ آخِذًا بِيَدِ زَيْدِ بْنِ ثَابِتٍ فَسَأَلَهُمَا فَابْتَدَرَاهُ جَمِيعًا فَقَالاَ حَرُمَتْ عَلَيْكَ حَرُمَتْ عَلَيْكَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'z-Zinad from Sulayman ibn\nYasar that Nufay, a mukatab of Umm Salama the wife of the Prophet, may\nAllah bless him and grant him peace, or her slave, had a free woman as\na wife. He divorced her twice, and then he wanted to return to her.\nThe wives of the Prophet, may Allah bless him and grant him peace,\nordered him to go to Uthman ibn Affan to ask him about it. He found\nhim at ad-Daraj with Zayd ibn Thabit. He asked them, and they both\nanticipated him and said, \"She is haram for you. She is haram for\nyou.\""}},{"id":53,"idInBook":53,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ نُفَيْعًا، مُكَاتَبًا كَانَ لأُمِّ سَلَمَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم طَلَّقَ امْرَأَةً حُرَّةً تَطْلِيقَتَيْنِ فَاسْتَفْتَى عُثْمَانَ بْنَ عَفَّانَ فَقَالَ حَرُمَتْ عَلَيْكَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Said ibn al-\nMusayyab that Nufay, a mukatab of Umm Salama, the wife of the Prophet,\nmay Allah bless him and grant him peace, divorced his free wife twice,\nso he asked Uthman ibn Affan for an opinion, and he said, \"She is\nharam for you.\""}},{"id":54,"idInBook":54,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ رَبِّهِ بْنِ سَعِيدٍ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ الْحَارِثِ التَّيْمِيِّ، أَنَّ نُفَيْعًا، مُكَاتَبًا كَانَ لأُمِّ سَلَمَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم اسْتَفْتَى زَيْدَ بْنَ ثَابِتٍ فَقَالَ إِنِّي طَلَّقْتُ امْرَأَةً حُرَّةً تَطْلِيقَتَيْنِ ‏.‏ فَقَالَ زَيْدُ بْنُ ثَابِتٍ حَرُمَتْ عَلَيْكَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abdu Rabbih ibn Said from\nMuhammad ibn Ibrahim ibn al-Harith at-Taymi that Nufay, a mukatab of\nUmm Salama, the wife of the Prophet, may Allah bless him and grant him\npeace, asked Zayd ibn Thabit for an opinion. He said, \"I have divorced\nmy free wife twice.\" Zayd ibn Thabit said, \"She is haram for you.\""}},{"id":55,"idInBook":55,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقُولُ إِذَا طَلَّقَ الْعَبْدُ امْرَأَتَهُ تَطْلِيقَتَيْنِ فَقَدْ حَرُمَتْ عَلَيْهِ حَتَّى تَنْكِحَ زَوْجًا غَيْرَهُ حُرَّةً كَانَتْ أَوْ أَمَةً وَعِدَّةُ الْحُرَّةِ ثَلاَثُ حِيَضٍ وَعِدَّةُ الأَمَةِ حَيْضَتَانِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nsaid, \"When the slave divorces his wife twice, she is haram for him\nuntil she has married another husband, whether she is free or a slave.\nThe idda of a free woman is three menstrual periods, and the idda of a\nslave-girl is two periods."}},{"id":56,"idInBook":56,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقُولُ مَنْ أَذِنَ لِعَبْدِهِ أَنْ يَنْكِحَ فَالطَّلاَقُ بِيَدِ الْعَبْدِ لَيْسَ بِيَدِ غَيْرِهِ مِنْ طَلاَقِهِ شَىْءٌ فَأَمَّا أَنْ يَأْخُذَ الرَّجُلُ أَمَةَ غُلاَمِهِ أَوْ أَمَةَ وَلِيدَتِهِ فَلاَ جُنَاحَ عَلَيْهِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nsaid, \"If a man gives his slave permission to marry, the divorce is in\nthe hand of the slave, and nobody else has any power over his divorce.\nNothing is held against a man who takes the slave-girl of his male\nslave or the slave-girl of his female-slave.\""}},{"id":57,"idInBook":57,"chapterId":29,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ أَيُّمَا امْرَأَةٍ فَقَدَتْ زَوْجَهَا فَلَمْ تَدْرِ أَيْنَ هُوَ فَإِنَّهَا تَنْتَظِرُ أَرْبَعَ سِنِينَ ثُمَّ تَعْتَدُّ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا ثُمَّ تَحِلُّ ‏.‏ قَالَ مَالِكٌ وَإِنْ تَزَوَّجَتْ بَعْدَ انْقِضَاءِ عِدَّتِهَا فَدَخَلَ بِهَا زَوْجُهَا أَوْ لَمْ يَدْخُلْ بِهَا فَلاَ سَبِيلَ لِزَوْجِهَا الأَوَّلِ إِلَيْهَا ‏.‏ قَالَ مَالِكٌ وَذَلِكَ الأَمْرُ عِنْدَنَا وَإِنْ أَدْرَكَهَا زَوْجُهَا قَبْلَ أَنْ تَتَزَوَّجَ فَهُوَ أَحَقُّ بِهَا ‏.‏ قَالَ مَالِكٌ وَأَدْرَكْتُ النَّاسَ يُنْكِرُونَ الَّذِي قَالَ بَعْضُ النَّاسِ عَلَى عُمَرَ بْنِ الْخَطَّابِ أَنَّهُ قَالَ يُخَيَّرُ زَوْجُهَا الأَوَّلُ إِذَا جَاءَ فِي صَدَاقِهَا أَوْ فِي امْرَأَتِهِ ‏.‏","english":{"narrator":"","text":"Malik said, \"Neither a free man nor a slave who divorces a slave-\ngirl nor a slave who divorces a free woman, in an irrevocable divorce,\nis obliged to pay maintenance even if she is pregnant, and he cannot\nreturn to her.\"\n\n\nMalik said, \"A free man is not obliged to pay\nfor the suckling of his son when he is a slave of other people, nor is\na slave obliged to spend his money for what his master owns except\nwith the permission of his master.\""}},{"id":58,"idInBook":58,"chapterId":29,"bookId":7,"arabic":"قَالَ مَالِكٌ وَبَلَغَنِي أَنَّ عُمَرَ بْنَ الْخَطَّابِ قَالَ فِي الْمَرْأَةِ يُطَلِّقُهَا زَوْجُهَا وَهُوَ غَائِبٌ عَنْهَا ثُمَّ يُرَاجِعُهَا فَلاَ يَبْلُغُهَا رَجْعَتُهُ وَقَدْ بَلَغَهَا طَلاَقُهُ إِيَّاهَا فَتَزَوَّجَتْ أَنَّهُ إِنْ دَخَلَ بِهَا زَوْجُهَا الآخَرُ أَوْ لَمْ يَدْخُلْ بِهَا فَلاَ سَبِيلَ لِزَوْجِهَا الأَوَّلِ الَّذِي كَانَ طَلَّقَهَا إِلَيْهَا ‏.‏ قَالَ مَالِكٌ وَهَذَا أَحَبُّ مَا سَمِعْتُ إِلَىَّ فِي هَذَا وَفِي الْمَفْقُودِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said from Said ibn\nal-Musayyab that Umar ibn al-Khattab said, \"The woman who loses her\nhusband and does not know where he is, waits for four years, then she\ndoes idda for four months, and then she is free to marry.\"\n\n\nMalik said, \"If she marries after her idda is over, regardless of\nwhether the new husband has consummated the marriage or not, her first\nhusband has no means of access to her.\"\n\n\nMalik said, \"That is\nwhat is done among us and if her husband reaches her before she has\nremarried, he is more entitled to her.\"\n\n\nMalik said that he\nhad seen people disapproving of someone who said that one of the\npeople (of knowledge) attributed to Umar ibn al-Khattab that he said,\n\"Her first husband chooses when he comes either her bride-price or his\nwife.\"\n\n\nMalik said, \"I have heard that Umar ibn al-Khattab,\nspeaking about a woman whose husband divorced her while he was absent\nfrom her, and then he took her back and the news of his taking her\nback had not reached her, while the news of his divorcing her had, and\nso she had married again, said, 'Her first husband who divorced her\nhas no means of access to her whether or not the new husband has\nconsummated the marriage.' \"\n\n\nMalik said, \"This is what I like\nthe best of what I heard about the missing man.\""}},{"id":59,"idInBook":59,"chapterId":29,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، طَلَّقَ امْرَأَتَهُ وَهِيَ حَائِضٌ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَسَأَلَ عُمَرُ بْنُ الْخَطَّابِ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ ذَلِكَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مُرْهُ فَلْيُرَاجِعْهَا ثُمَّ يُمْسِكْهَا حَتَّى تَطْهُرَ ثُمَّ تَحِيضَ ثُمَّ تَطْهُرَ ثُمَّ إِنْ شَاءَ أَمْسَكَ بَعْدُ وَإِنْ شَاءَ طَلَّقَ قَبْلَ أَنْ يَمَسَّ فَتِلْكَ الْعِدَّةُ الَّتِي أَمَرَ اللَّهُ أَنْ يُطَلَّقَ لَهَا النِّسَاءُ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\ndivorced his wife while she was menstruating in the time of the\nMessenger of Allah, may Allah bless him and grant him peace, Umar ibn\nal-Khattab asked the Messenger of Allah, may Allah bless him and grant\nhim peace, about it. The Messenger of Allah, may Allah bless him and\ngrant him peace, said, \"Go and tell him to take her back and keep her\nuntil she is purified and then has a period and then is purified. Then\nif he wishes, he an keep her, and if he wishes he should divorce her\nbefore he has intercourse with her. That is the idda which Allah has\ncommanded for women who are divorced.\""}},{"id":60,"idInBook":60,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ، أَنَّهَا انْتَقَلَتْ حَفْصَةَ بِنْتَ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ الصِّدِّيقِ حِينَ دَخَلَتْ فِي الدَّمِ مِنَ الْحَيْضَةِ الثَّالِثَةِ ‏.‏ قَالَ ابْنُ شِهَابٍ فَذُكِرَ ذَلِكَ لِعَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ فَقَالَتْ صَدَقَ عُرْوَةُ وَقَدْ جَادَلَهَا فِي ذَلِكَ نَاسٌ فَقَالُوا إِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى يَقُولُ فِي كِتَابِهِ ‏{‏ثَلاَثَةَ قُرُوءٍ‏}‏ فَقَالَتْ عَائِشَةُ صَدَقْتُمْ تَدْرُونَ مَا الأَقْرَاءُ إِنَّمَا الأَقْرَاءُ الأَطْهَارُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Urwa ibn az-\nZubayr from A'isha, umm al-muminin, that she took Hafsa ibn Abd ar-\nRahman ibn Abi Bakr as-Siddiq into her house when she had entered the\nthird period of her idda. Ibn Shihab said, \"That was mentioned to Amra\nbint Abd ar-Rahman, and she said that Urwa had spoken the truth and\npeople had argued with A'isha about it. They said that Allah, the\nBlessed, the Exalted, said in His Book, 'Three quru.' A'isha said,\n'You spoke the truth. Do you know what quru are? Quru are times of\nbecoming pure after menstruation .' \""}},{"id":61,"idInBook":61,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، أَنَّهُ قَالَ سَمِعْتُ أَبَا بَكْرِ بْنَ عَبْدِ الرَّحْمَنِ، يَقُولُ مَا أَدْرَكْتُ أَحَدًا مِنْ فُقَهَائِنَا إِلاَّ وَهُوَ يَقُولُ هَذَا ‏.‏ يُرِيدُ قَوْلَ عَائِشَةَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Ibn Shihab said that he heard\nAbu Bakr ibn Abd ar-Rahman say, \"I have never seen any of our fuqaha\nwho did not say that this was what the statement of A'isha meant.\""}},{"id":62,"idInBook":62,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، وَزَيْدِ بْنِ أَسْلَمَ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، أَنَّ الأَحْوَصَ، هَلَكَ بِالشَّامِ حِينَ دَخَلَتِ امْرَأَتُهُ فِي الدَّمِ مِنَ الْحَيْضَةِ الثَّالِثَةِ وَقَدْ كَانَ طَلَّقَهَا فَكَتَبَ مُعَاوِيَةُ بْنُ أَبِي سُفْيَانَ إِلَى زَيْدِ بْنِ ثَابِتٍ يَسْأَلُهُ عَنْ ذَلِكَ فَكَتَبَ إِلَيْهِ زَيْدٌ إِنَّهَا إِذَا دَخَلَتْ فِي الدَّمِ مِنَ الْحَيْضَةِ الثَّالِثَةِ فَقَدْ بَرِئَتْ مِنْهُ وَبَرِئَ مِنْهَا وَلاَ تَرِثُهُ وَلاَ يَرِثُهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi and Zayd ibn Aslam from\nSulayman ibn Yasar that al-Ahwas died in Syria when his wife had begun\nher third menstrual period after he had divorced her. Muawiya ibn Abi\nSufyan wrote and asked Zayd ibn Thabit about that. Zayd wrote to him,\n\"When she began her third period, she was free from him and he was\nfree from her, and he does not inherit from her nor she from him.\""}},{"id":63,"idInBook":63,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، وَسَالِمِ بْنِ عَبْدِ اللَّهِ، وَأَبِي، بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ وَسُلَيْمَانَ بْنِ يَسَارٍ وَابْنِ شِهَابٍ أَنَّهُمْ كَانُوا يَقُولُونَ إِذَا دَخَلَتِ الْمُطَلَّقَةُ فِي الدَّمِ مِنَ الْحَيْضَةِ الثَّالِثَةِ فَقَدْ بَانَتْ مِنْ زَوْجِهَا وَلاَ مِيرَاثَ بَيْنَهُمَا وَلاَ رَجْعَةَ لَهُ عَلَيْهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Abu Bakr\nibn Abd ar-Rahman and Sulayman ibn Yasar and Ibn Shihab used to say,\n\"When the divorced woman enters the beginning of her third period, she\nis clearly separated from her husband and there is no inheritance\nbetween them and he has no access to her.\""}},{"id":64,"idInBook":64,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ كَانَ يَقُولُ إِذَا طَلَّقَ الرَّجُلُ امْرَأَتَهُ فَدَخَلَتْ فِي الدَّمِ مِنَ الْحَيْضَةِ الثَّالِثَةِ فَقَدْ بَرِئَتْ مِنْهُ وَبَرِئَ مِنْهَا ‏.‏ قَالَ مَالِكٌ وَهُوَ الأَمْرُ عِنْدَنَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nsaid, \"When a man divorces his wife and she begins her third period,\nshe is free from him and he is free from her.\"\n\n\nMalik said,\n\"This is how things are done among us.\""}},{"id":65,"idInBook":65,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ الْفُضَيْلِ بْنِ أَبِي عَبْدِ اللَّهِ، مَوْلَى الْمَهْرِيِّ أَنَّ الْقَاسِمَ بْنَ مُحَمَّدٍ، وَسَالِمَ بْنَ عَبْدِ اللَّهِ، كَانَا يَقُولاَنِ إِذَا طُلِّقَتِ الْمَرْأَةُ فَدَخَلَتْ فِي الدَّمِ مِنَ الْحَيْضَةِ الثَّالِثَةِ فَقَدْ بَانَتْ مِنْهُ وَحَلَّتْ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from al-Fudayl ibn Abi Abdullah,\nthe mawla of al-Mahri that al-Qasim ibn Muhammad and Salim ibn\nAbdullah said, \"When a woman is divorced and begins her third period,\nshe is clearly separated from him and is free to marry again.\""}},{"id":66,"idInBook":66,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، وَابْنِ، شِهَابٍ وَسُلَيْمَانَ بْنِ يَسَارٍ أَنَّهُمْ كَانُوا يَقُولُونَ عِدَّةُ الْمُخْتَلِعَةِ ثَلاَثَةُ قُرُوءٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Said ibn\nal-Musayyab and Ibn Shihab and Sulayman ibn Yasar all said, \"The idda\nof the woman with a khul divorce is three periods.\""}},{"id":67,"idInBook":67,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ سَمِعَ ابْنَ شِهَابٍ، يَقُولُ عِدَّةُ الْمُطَلَّقَةِ الأَقْرَاءُ وَإِنْ تَبَاعَدَتْ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he heard Ibn Shihab say, \"The\nidda of the divorced woman is reckoned by the menstrual cycles even if\nshe is estranged .\" (The reason the idda is normally reckoned by the\nmenstrual cycle is to see whether the woman is pregnant or not.)"}},{"id":68,"idInBook":68,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ رَجُلٍ، مِنَ الأَنْصَارِ أَنَّ امْرَأَتَهُ، سَأَلَتْهُ الطَّلاَقَ فَقَالَ لَهَا إِذَا حِضْتِ فَآذِنِينِي ‏.‏ فَلَمَّا حَاضَتْ آذَنَتْهُ فَقَالَ إِذَا طَهُرْتِ فَآذِنِينِي فَلَمَّا","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said from a man of\nthe Ansar that his wife asked him for a divorce, and he said to her,\n\"When you have had your period, then tell me.\" When she had her\nperiod, she told him. He said, \"When you are purified then tell me.\"\nWhen she was purified, she told him and he divorced her.\n\n\nMalik said, \"This is the best of what I have heard about it.\""}},{"id":69,"idInBook":69,"chapterId":29,"bookId":7,"arabic":"حَدَّثَنَا يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، وَسُلَيْمَانَ بْنِ يَسَارٍ، أَنَّهُ سَمِعَهُمَا يَذْكُرَانِ، أَنَّ يَحْيَى بْنَ سَعِيدِ بْنِ الْعَاصِ، طَلَّقَ ابْنَةَ عَبْدِ الرَّحْمَنِ بْنِ الْحَكَمِ الْبَتَّةَ فَانْتَقَلَهَا عَبْدُ الرَّحْمَنِ بْنُ الْحَكَمِ فَأَرْسَلَتْ عَائِشَةُ أُمُّ الْمُؤْمِنِينَ إِلَى مَرْوَانَ بْنِ الْحَكَمِ وَهُوَ يَوْمَئِذٍ أَمِيرُ الْمَدِينَةِ فَقَالَتِ اتَّقِ اللَّهَ وَارْدُدِ الْمَرْأَةَ إِلَى بَيْتِهَا ‏.‏ فَقَالَ مَرْوَانُ فِي حَدِيثِ سُلَيْمَانَ إِنَّ عَبْدَ الرَّحْمَنِ غَلَبَنِي وَقَالَ مَرْوَانُ فِي حَدِيثِ الْقَاسِمِ أَوَمَا بَلَغَكَ شَأْنُ فَاطِمَةَ بِنْتِ قَيْسٍ فَقَالَتْ عَائِشَةُ لاَ يَضُرُّكَ أَنْ لاَ تَذْكُرَ حَدِيثَ فَاطِمَةَ ‏.‏ فَقَالَ مَرْوَانُ إِنْ كَانَ بِكِ الشَّرُّ فَحَسْبُكِ مَا بَيْنَ هَذَيْنِ مِنَ الشَّرِّ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik thal Yahya ibn Said heard al-Qasim\nibn Muhammad and Sulayman ibn Yasar both mention that Yahya ibn Said\nibn al-As divorced the daughter of Abd ar-Rahman ibn al-Hakam\nirrevocably, so Abd ar-Rahman ibn al-Hakam took her away A'isha umm\nal-muminin sent to Marwan ibn al-Hakam who was the Amir of al-Madina\nat that time. She said, \"Fear Allah and make him return the woman to\nher house.\" Marwan said in what Sulayman related, ''Abd ar-Rahman has\nthe upper hand over me.\" Marwan said in what al-Qasim related, \"Hasn't\nthe affair of Fatima bint Qays reached you?\" A'isha said, \"You are\nforced to mention the story of Fatima \" Marwan said, \"If you know that\nevil, whatever evil there was between those two is enough for you.\"\n(See hadith 67.)"}},{"id":70,"idInBook":70,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ بِنْتَ سَعِيدِ بْنِ زَيْدِ بْنِ عَمْرِو بْنِ نُفَيْلٍ، كَانَتْ تَحْتَ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ عُثْمَانَ بْنِ عَفَّانَ فَطَلَّقَهَا الْبَتَّةَ فَانْتَقَلَتْ فَأَنْكَرَ ذَلِكَ عَلَيْهَا عَبْدُ اللَّهِ بْنُ عُمَرَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that the daughter of\nSaid ibn Zayd ibn Amr ibn Nufayl was the wife of Abdullah ibn Umar ibn\nUthman ibn Affan, and he divorced her irrevocably and she moved out.\nAbdullah ibn Umar rebuked her for that."}},{"id":71,"idInBook":71,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، طَلَّقَ امْرَأَةً لَهُ فِي مَسْكَنِ حَفْصَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم وَكَانَ طَرِيقَهُ إِلَى الْمَسْجِدِ فَكَانَ يَسْلُكُ الطَّرِيقَ الأُخْرَى مِنْ أَدْبَارِ الْبُيُوتِ كَرَاهِيَةَ أَنْ يَسْتَأْذِنَ عَلَيْهَا حَتَّى رَاجَعَهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\ndivorced one of his wives in the house of Hafsa, the wife of the\nProphet, may Allah bless him and grant him peace, while he was on the\nway to the mosque. He went another route from behind the houses being\naverse to ask permission to enter until he returned to her."}},{"id":72,"idInBook":72,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ سَعِيدَ بْنَ الْمُسَيَّبِ، سُئِلَ عَنِ الْمَرْأَةِ، يُطَلِّقُهَا زَوْجُهَا وَهِيَ فِي بَيْتٍ بِكِرَاءٍ عَلَى مَنِ الْكِرَاءُ فَقَالَ سَعِيدُ بْنُ الْمُسَيَّبِ عَلَى زَوْجِهَا ‏.‏ قَالَ فَإِنْ لَمْ يَكُنْ عِنْدَ زَوْجِهَا قَالَ فَعَلَيْهَا ‏.‏ قَالَ فَإِنْ لَمْ يَكُنْ عِنْدَهَا قَالَ فَعَلَى الأَمِيرِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said that Said ibn\nal-Musayyab was asked who was obliged to pay the rent for a woman\nwhose husband divorced her while she was in a leased house. Said ibn\nal-Musayyab said, \"Her husband is obliged to pay it.\" Someone asked,\n\"what if her husband does not have it?\" He said, \"Then she must pay\nit.\" Someone asked, \"And if she does not have it?\" He said, \"Then the\nAmir must pay it.\""}},{"id":73,"idInBook":73,"chapterId":29,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ، مَوْلَى الأَسْوَدِ بْنِ سُفْيَانَ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، عَنْ فَاطِمَةَ بِنْتِ قَيْسٍ، أَنَّ أَبَا عَمْرِو بْنَ حَفْصٍ، طَلَّقَهَا الْبَتَّةَ وَهُوَ غَائِبٌ بِالشَّامِ فَأَرْسَلَ إِلَيْهَا وَكِيلُهُ بِشَعِيرٍ فَسَخِطَتْهُ فَقَالَ وَاللَّهِ مَا لَكِ عَلَيْنَا مِنْ شَىْءٍ ‏.‏ فَجَاءَتْ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرَتْ ذَلِكَ لَهُ فَقَالَ ‏\"‏ لَيْسَ لَكِ عَلَيْهِ نَفَقَةٌ ‏\"‏ ‏.‏ وَأَمَرَهَا أَنْ تَعْتَدَّ فِي بَيْتِ أُمِّ شَرِيكٍ ثُمَّ قَالَ ‏\"‏ تِلْكَ امْرَأَةٌ يَغْشَاهَا أَصْحَابِي اعْتَدِّي عِنْدَ عَبْدِ اللَّهِ ابْنِ أُمِّ مَكْتُومٍ فَإِنَّهُ رَجُلٌ أَعْمَى تَضَعِينَ ثِيَابَكِ عِنْدَهُ فَإِذَا حَلَلْتِ فَآذِنِينِي ‏\"‏ ‏.‏ قَالَتْ فَلَمَّا حَلَلْتُ ذَكَرْتُ لَهُ أَنَّ مُعَاوِيَةَ بْنَ أَبِي سُفْيَانَ وَأَبَا جَهْمِ بْنَ هِشَامٍ خَطَبَانِي ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَمَّا أَبُو جَهْمٍ فَلاَ يَضَعُ عَصَاهُ عَنْ عَاتِقِهِ وَأَمَّا مُعَاوِيَةُ فَصُعْلُوكٌ لاَ مَالَ لَهُ انْكِحِي أُسَامَةَ بْنَ زَيْدٍ ‏\"‏ ‏.‏ قَالَتْ فَكَرِهْتُهُ ثُمَّ قَالَ ‏\"‏ انْكِحِي أُسَامَةَ بْنَ زَيْدٍ ‏\"‏ ‏.‏ فَنَكَحْتُهُ فَجَعَلَ اللَّهُ فِي ذَلِكَ خَيْرًا وَاغْتَبَطْتُ بِهِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abdullah ibn Yazid, the mawla\nof al-Aswad ibn Sufyan from Abu Salama ibn Abd ar-Rahman ibn Awf from\nFatima bint Qays that Abu Amr ibn Hafs divorced her absolutely while\nhe was away in Syria. His agent sent her some barley and she was\ndispleased with it, saying, \"By Allah, I don't expect anything from\nyou.\" She went to the Messenger of Allah, may Allah bless him and\ngrant him peace, and mentioned it to him. He said, \"You have no\nmaintenance.\" He then ordered her to spend her idda in the house of\nUmm Sharik. Then he said, \"This is a woman whom my companions visit.\nSpend the idda in the house of Ibn Umm Maktum. He is a blind man and\nyou can undress at his home. When you are free to remarry, tell me.\"\n\n\nShe continued, \"When I was free to remarry, I mentioned to\nhim that Muawiya ibn Abi Sufyan and Abu Jahm ibn Hisham had asked for\nme in marriage. The Messenger of Allah, may Allah bless him and grant\nhim peace, said, 'As for Abu Jahm, he never puts down his stick from\nhis shoulder (i.e. he is always travelling), and as for Muawiya he is\na poor man with no property. Marry Usama ibn Zayd.' I objected to him\nand he said, 'Marry Usama ibn Zayd,' so I married him, and Allah put\ngood in it and I was content with him.\""}},{"id":74,"idInBook":74,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ سَمِعَ ابْنَ شِهَابٍ، يَقُولُ الْمَبْتُوتَةُ لاَ تَخْرُجُ مِنْ بَيْتِهَا حَتَّى تَحِلَّ وَلَيْسَتْ لَهَا نَفَقَةٌ إِلاَّ أَنْ تَكُونَ حَامِلاً فَيُنْفَقُ عَلَيْهَا حَتَّى تَضَعَ حَمْلَهَا ‏.‏ قَالَ مَالِكٌ وَهَذَا الأَمْرُ عِنْدَنَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he heard Ibn Shihab say, \"The\nwoman who is absolutely divorced does not leave her house until she is\nfree to remarry. She has no maintenance unless she is pregnant. In\nthat circumstance the husband spends on her until she gives birth.\"\n\n\nMalik said, \"This is what is done among us.\""}},{"id":75,"idInBook":75,"chapterId":29,"bookId":7,"arabic":"","english":{"narrator":"","text":"Malik said, \"What is done among us when a slave divorces a slave-\ngirl when she is a slave and then she is set free, is that her idda is\nthe idda of a slave-girl, and her being set free does not change her\nidda whether or not he can still return to her. Her idda is not\naltered.\"\n\n\nMalik added, \"The hadd-punishment which a slave\nincurs is the same as this. When he is freed after he has incurred but\nbefore the punishment has been executed, his hadd is the hadd of the\nslave.\"\n\n\nMalik said, \"When a free man divorces a slave-girl\nthree times, her idda is two periods. When a slave divorces a free\nwoman twice, her idda is three periods.\"\n\n\nMalik said about a\nman who had a slave-girl as a wife, and he bought her and set her\nfree, ''Her idda is the idda of a slave-girl, i.e. two periods, as\nlong as he has not had intercourse with her. If he has had intercourse\nwith her after buying her and before he set her free, she only has to\nwait until one period has passed . \""}},{"id":76,"idInBook":76,"chapterId":29,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، وَعَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ قُسَيْطٍ اللَّيْثِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ قَالَ قَالَ عُمَرُ بْنُ الْخَطَّابِ أَيُّمَا امْرَأَةٍ طُلِّقَتْ فَحَاضَتْ حَيْضَةً أَوْ حَيْضَتَيْنِ ثُمَّ رَفَعَتْهَا حَيْضَتُهَا فَإِنَّهَا تَنْتَظِرُ تِسْعَةَ أَشْهُرٍ فَإِنْ بَانَ بِهَا حَمْلٌ فَذَلِكَ وَإِلاَّ اعْتَدَّتْ بَعْدَ التِّسْعَةِ الأَشْهُرِ ثَلاَثَةَ أَشْهُرٍ ثُمَّ حَلَّتْ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said and from Yazid\nibn Abdullah ibn Qusayt al-Laythi that Said ibn al-Musayyab said,\n''Umar ibn al-Khattab said, 'If a woman is divorced and has one or two\nperiods and then stops menstruating, she must wait nine months. If it\nis clear that she is pregnant, that is that. If not, she must do an\nidda of three months after the nine, and then she is free to marry.' \""}},{"id":77,"idInBook":77,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ كَانَ يَقُولُ الطَّلاَقُ لِلرِّجَالِ وَالْعِدَّةُ لِلنِّسَاءِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said that Said\nibn al-Musayyab said, \"Divorce belongs to men, and women have the\nidda.\""}},{"id":78,"idInBook":78,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ قَالَ عِدَّةُ الْمُسْتَحَاضَةِ سَنَةٌ ‏.‏ قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا فِي الْمُطَلَّقَةِ الَّتِي تَرْفَعُهَا حَيْضَتُهَا حِينَ يُطَلِّقُهَا زَوْجُهَا أَنَّهَا تَنْتَظِرُ تِسْعَةَ أَشْهُرٍ فَإِنْ لَمْ تَحِضْ فِيهِنَّ اعْتَدَّتْ ثَلاَثَةَ أَشْهُرٍ فَإِنْ حَاضَتْ قَبْلَ أَنْ تَسْتَكْمِلَ الأَشْهُرَ الثَّلاَثَةَ اسْتَقْبَلَتِ الْحَيْضَ فَإِنْ مَرَّتْ بِهَا تِسْعَةُ أَشْهُرٍ قَبْلَ أَنْ تَحِيضَ اعْتَدَّتْ ثَلاَثَةَ أَشْهُرٍ فَإِنْ حَاضَتِ الثَّانِيَةَ قَبْلَ أَنْ تَسْتَكْمِلَ الأَشْهُرَ الثَّلاَثَةَ اسْتَقْبَلَتِ الْحَيْضَ فَإِنْ مَرَّتْ بِهَا تِسْعَةُ أَشْهُرٍ قَبْلَ أَنْ تَحِيضَ اعْتَدَّتْ ثَلاَثَةَ أَشْهُرٍ فَإِنْ حَاضَتِ الثَّالِثَةَ كَانَتْ قَدِ اسْتَكْمَلَتْ عِدَّةَ الْحَيْضِ فَإِنْ لَمْ تَحِضِ اسْتَقْبَلَتْ ثَلاَثَةَ أَشْهُرٍ ثُمَّ حَلَّتْ وَلِزَوْجِهَا عَلَيْهَا فِي ذَلِكَ الرَّجْعَةُ قَبْلَ أَنْ تَحِلَّ إِلاَّ أَنْ يَكُونَ قَدْ بَتَّ طَلاَقَهَا ‏.‏ قَالَ مَالِكٌ السُّنَّةُ عِنْدَنَا أَنَّ الرَّجُلَ إِذَا طَلَّقَ امْرَأَتَهُ وَلَهُ عَلَيْهَا رَجْعَةٌ فَاعْتَدَّتْ بَعْضَ عِدَّتِهَا ثُمَّ ارْتَجَعَهَا ثُمَّ فَارَقَهَا قَبْلَ أَنْ يَمَسَّهَا أَنَّهَا لاَ تَبْنِي عَلَى مَا مَضَى مِنْ عِدَّتِهَا وَأَنَّهَا تَسْتَأْنِفُ مِنْ يَوْمَ طَلَّقَهَا عِدَّةً مُسْتَقْبَلَةً وَقَدْ ظَلَمَ زَوْجُهَا نَفْسَهُ وَأَخْطَأَ إِنْ كَانَ ارْتَجَعَهَا وَلاَ حَاجَةَ لَهُ بِهَا ‏.‏ قَالَ مَالِكٌ وَالأَمْرُ عِنْدَنَا أَنَّ الْمَرْأَةَ إِذَا أَسْلَمَتْ وَزَوْجُهَا كَافِرٌ ثُمَّ أَسْلَمَ فَهُوَ أَحَقُّ بِهَا مَا دَامَتْ فِي عِدَّتِهَا فَإِنِ انْقَضَتْ عِدَّتُهَا فَلاَ سَبِيلَ لَهُ عَلَيْهَا وَإِنْ تَزَوَّجَهَا بَعْدَ انْقِضَاءِ عِدَّتِهَا لَمْ يُعَدَّ ذَلِكَ طَلاَقًا وَإِنَّمَا فَسَخَهَا مِنْهُ الإِسْلاَمُ بِغَيْرِ طَلاَقٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab that Said ibn al-\nMusayyab said, \"The idda of the woman who bleeds constantly is a\nyear.\"\n\n\nMalik said, \"What is done among us about a divorced\nwoman whose periods stop when her husband divorces her is that she\nwaits nine months. If she has not had a period in them, she has an\nidda of three months. If she has a period before the end of the three\nmonths, she accepts the period. If another nine months pass without\nher having a period, she does an idda of three months. If she has a\nsecond period before the end of those three months, she accepts the\nperiod. If nine months then pass without a period, she does an idda of\nthree months. If she has a third period, the idda of the period is\ncomplete. If she does not have a period, she waits three months, and\nthen she is free to marry. Her husband can return to her before she\nbecomes free to marry unless he made her divorce irrevocable.\"\n\n\nMalik said, \"The sunna with us is that when a man divorces his\nwife and has the option to return to her, and she does part of her\nidda and then he returns to her and then parts from her before he has\nhad intercourse with her, she does not add to what has passed of her\nidda. Her husband has wronged himself and erred if he returned to her\nand had no need of her.\"\n\n\nMalik said, \"What is done among us\nis that if a woman becomes a muslim while her husband is a kafir and\nthen he becomes muslim, he is entitled to her as long as she is in her\nidda. If her idda is finished, he has no access to her. If he\nremarries her after the end of her idda, however, that is not counted\nas divorce. Islam removed her from him without divorce.\""}},{"id":79,"idInBook":79,"chapterId":29,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَلِيَّ بْنَ أَبِي طَالِبٍ، قَالَ فِي الْحَكَمَيْنِ اللَّذَيْنِ قَالَ اللَّهُ تَعَالَى ‏{‏وَإِنْ خِفْتُمْ شِقَاقَ بَيْنِهِمَا فَابْعَثُوا حَكَمًا مِنْ أَهْلِهِ وَحَكَمًا مِنْ أَهْلِهَا إِنْ يُرِيدَا إِصْلاَحًا يُوَفِّقِ اللَّهُ بَيْنَهُمَا إِنَّ اللَّهَ كَانَ عَلِيمًا خَبِيرًا‏}‏ إِنَّ إِلَيْهِمَا الْفُرْقَةَ بَيْنَهُمَا وَالاِجْتِمَاعَ ‏.‏ قَالَ مَالِكٌ وَذَلِكَ أَحْسَنُ مَا سَمِعْتُ مِنْ أَهْلِ الْعِلْمِ أَنَّ الْحَكَمَيْنِ يَجُوزُ قَوْلُهُمَا بَيْنَ الرَّجُلِ وَامْرَأَتِهِ فِي الْفُرْقَةِ وَالاِجْتِمَاعِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Ali ibn Abi\nTalib said about the two arbiters about whom Allah, the Exalted,\nsaid,\"If you fear a breach between the two, appoint an arbiter from\nhis people, and an arbiter from her people. If they desire to set\nthings aright, Allah will make peace between them, surely Allah is\nKnowing, Aware,\" (Sura 4 ayat 35), that the separation and the joining\nwere overseen by the two of them.\n\n\nMalik said, \"That is the\nbest of what I have heard from the people of knowledge. Whatever the\ntwo arbiters say concerning separation or joining is taken into\nconsideration \""}},{"id":80,"idInBook":80,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عُمَرَ بْنَ الْخَطَّابِ، وَعَبْدَ اللَّهِ بْنَ عُمَرَ، وَعَبْدَ اللَّهِ بْنَ مَسْعُودٍ، وَسَالِمَ بْنَ عَبْدِ اللَّهِ، وَالْقَاسِمَ بْنَ مُحَمَّدٍ، وَابْنَ، شِهَابٍ وَسُلَيْمَانَ بْنَ يَسَارٍ كَانُوا يَقُولُونَ إِذَا حَلَفَ الرَّجُلُ بِطَلاَقِ الْمَرْأَةِ قَبْلَ أَنْ يَنْكِحَهَا ثُمَّ أَثِمَ إِنَّ ذَلِكَ لاَزِمٌ لَهُ إِذَا نَكَحَهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Umar ibn\nal-Khattab, Abdullah ibn Umar, Abdullah ibn Masud, Salim ibn Abdullah,\nal-Qasim ibn Muhammad, Ibn Shihab,and Sulayman ibn Yasar all said, \"If\na man has vowed to divorce his wife before marrying her and then he\nbreaks his vow, divorce is obligatory for him when he marries her.\""}},{"id":81,"idInBook":81,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ، كَانَ يَقُولُ فِيمَنْ قَالَ كُلُّ امْرَأَةٍ أَنْكِحُهَا فَهِيَ طَالِقٌ إِنَّهُ إِذَا لَمْ يُسَمِّ قَبِيلَةً أَوِ امْرَأَةً بِعَيْنِهَا فَلاَ شَىْءَ عَلَيْهِ ‏.‏ قَالَ مَالِكٌ وَهَذَا أَحْسَنُ مَا سَمِعْتُ ‏.‏ قَالَ مَالِكٌ فِي الرَّجُلِ يَقُولُ لاِمْرَأَتِهِ أَنْتِ الطَّلاَقُ وَكُلُّ امْرَأَةٍ أَنْكِحُهَا فَهِيَ طَالِقٌ وَمَالُهُ صَدَقَةٌ إِنْ لَمْ يَفْعَلْ كَذَا وَكَذَا فَحَنِثَ قَالَ أَمَّا نِسَاؤُهُ فَطَلاَقٌ كَمَا قَالَ وَأَمَّا قَوْلُهُ كُلُّ امْرَأَةٍ أَنْكِحُهَا فَهِيَ طَالِقٌ فَإِنَّهُ إِذَا لَمْ يُسَمِّ امْرَأَةً بِعَيْنِهَا أَوْ قَبِيلَةً أَوْ أَرْضًا أَوْ نَحْوَ هَذَا فَلَيْسَ يَلْزَمُهُ ذَلِكَ وَلْيَتَزَوَّجْ مَا شَاءَ وَأَمَّا مَالُهُ فَلْيَتَصَدَّقْ بِثُلُثِهِ ‏.‏","english":{"narrator":"Yahya related to me from Malik that he had heard that\nAbdullah ibn Masud said that there was nothing binding on someone who\nsaid, \"Every woman I marry is divorced,\" if he did not name a specific\ntribe or woman.\n\n\nMalik said, \"That is the best of what I have\nheard.\"\n\n\nMalik said about a man saying to his wife, \"You are\ndivorced, and every woman I marry is divorced,\" or that all his\nproperty would be sadaqa if he did not do such-and-such, and he broke\nhis oath:","text":"\"As for his wives, it is divorce as he said, and as for his\nstatement, 'Every woman I marry is divorced', if he did not name a\nspecific woman, tribe, or land, or such, it is not binding on him and\nhe can marry as he wishes. As for his property, he gives a third of it\naway as sadaqa.\""}},{"id":82,"idInBook":82,"chapterId":29,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ كَانَ يَقُولُ مَنْ تَزَوَّجَ امْرَأَةً فَلَمْ يَسْتَطِعْ أَنْ يَمَسَّهَا فَإِنَّهُ يُضْرَبُ لَهُ أَجَلٌ سَنَةً فَإِنْ مَسَّهَا وَإِلاَّ فُرِّقَ بَيْنَهُمَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab that Said ibn al-\nMusayyab said, \"If someone marries a woman and cannot have intercourse\nwith her, there is a deadline of a year set for him to have\nintercourse with her. If he does not, they are separated.\""}},{"id":83,"idInBook":83,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ سَأَلَ ابْنَ شِهَابٍ مَتَى يُضْرَبُ لَهُ الأَجَلُ أَمِنْ يَوْمِ يَبْنِي بِهَا أَمْ مِنْ يَوْمِ تُرَافِعُهُ إِلَى السُّلْطَانِ فَقَالَ بَلْ مِنْ يَوْمِ تُرَافِعُهُ إِلَى السُّلْطَانِ ‏.‏ قَالَ مَالِكٌ فَأَمَّا الَّذِي قَدْ مَسَّ امْرَأَتَهُ ثُمَّ اعْتَرَضَ عَنْهَا فَإِنِّي لَمْ أَسْمَعْ أَنَّهُ يُضْرَبُ لَهُ أَجَلٌ وَلاَ يُفَرَّقُ بَيْنَهُمَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had asked Ibn Shihab about\nwhether the deadline was set from the day he had married her, or from\nthe day she raised the question before the Sultan. He said. 'It is\nfrom the day she presents it before the Sultan.'\n\n\nMalik said,\n\"As for someone who has intercourse with his wife and then is\nprevented from intercourse with her, I have not heard that there is a\ndeadline set for him or that they are separated.\""}},{"id":84,"idInBook":84,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، أَنَّهُ قَالَ بَلَغَنِي أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ لِرَجُلٍ مِنْ ثَقِيفٍ أَسْلَمَ وَعِنْدَهُ عَشْرُ نِسْوَةٍ حِينَ أَسْلَمَ الثَّقَفِيُّ ‏\n\"‏ أَمْسِكْ مِنْهُنَّ أَرْبَعًا وَفَارِقْ سَائِرَهُنَّ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Ibn Shihab said, \"I have\nheard that the Messenger of Allah, may Allah bless him and grant him\npeace, said to a man from Thaqif who had ten wives when he became\nmuslim, 'Take four and separate from the rest.' \""}},{"id":85,"idInBook":85,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، أَنَّهُ قَالَ سَمِعْتُ سَعِيدَ بْنَ الْمُسَيَّبِ، وَحُمَيْدَ بْنَ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، وَعُبَيْدَ اللَّهِ بْنَ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، وَسُلَيْمَانَ بْنَ يَسَارٍ، كُلُّهُمْ يَقُولُ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ، يَقُولُ أَيُّمَا امْرَأَةٍ طَلَّقَهَا زَوْجُهَا تَطْلِيقَةً أَوْ تَطْلِيقَتَيْنِ ثُمَّ تَرَكَهَا حَتَّى تَحِلَّ وَتَنْكِحَ زَوْجًا غَيْرَهُ فَيَمُوتَ عَنْهَا أَوْ يُطَلِّقَهَا ثُمَّ يَنْكِحُهَا زَوْجُهَا الأَوَّلُ فَإِنَّهَا تَكُونُ عِنْدَهُ عَلَى مَا بَقِيَ مِنْ طَلاَقِهَا ‏.‏ قَالَ مَالِكٌ وَعَلَى ذَلِكَ السُّنَّةُ عِنْدَنَا الَّتِي لاَ اخْتِلاَفَ فِيهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Ibn Shihab said that he had\nheard Said ibn al-Musayyab, Humayd ibn Abd ar-Rahman ibn Awf,\nUbaydullah ibn Abdullah ibn Utba ibn Masud, and Sulayman ibn Yasarall\nsay, that they had heard Abu Hurayra say that he had heard Umar ibn\nal-Khattab say, \"If a woman is divorced by her husband once or twice,\nand he leaves her until she is free to marry and she marries another\nhusband and he dies or divorces her, and then she marries her first\nhusband, she is with him according to what remains of her divorce.\"\n\n\nMalik said, \"That is what is done among us and there is no\ndispute about it.\""}},{"id":86,"idInBook":86,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ ثَابِتِ بْنِ الأَحْنَفِ، أَنَّهُ تَزَوَّجَ أُمَّ وَلَدٍ لِعَبْدِ الرَّحْمَنِ بْنِ زَيْدِ بْنِ الْخَطَّابِ - قَالَ - فَدَعَانِي عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ زَيْدِ بْنِ الْخَطَّابِ فَجِئْتُهُ فَدَخَلْتُ عَلَيْهِ فَإِذَا سِيَاطٌ مَوْضُوعَةٌ وَإِذَا قَيْدَانِ مِنْ حَدِيدٍ وَعَبْدَانِ لَهُ قَدْ أَجْلَسَهُمَا فَقَالَ طَلِّقْهَا وَإِلاَّ وَالَّذِي يُحْلَفُ بِهِ فَعَلْتُ بِكَ كَذَا وَكَذَا ‏.‏ قَالَ فَقُلْتُ هِيَ الطَّلاَقُ أَلْفًا ‏.‏ قَالَ فَخَرَجْتُ مِنْ عِنْدِهِ فَأَدْرَكْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ بِطَرِيقِ مَكَّةَ فَأَخْبَرْتُهُ بِالَّذِي كَانَ مِنْ شَأْنِي فَتَغَيَّظَ عَبْدُ اللَّهِ وَقَالَ لَيْسَ ذَلِكَ بِطَلاَقٍ وَإِنَّهَا لَمْ تَحْرُمْ عَلَيْكَ فَارْجِعْ إِلَى أَهْلِكَ ‏.‏ قَالَ فَلَمْ تُقْرِرْنِي نَفْسِي حَتَّى أَتَيْتُ عَبْدَ اللَّهِ بْنَ الزُّبَيْرِ - وَهُوَ يَوْمَئِذٍ بِمَكَّةَ أَمِيرٌ عَلَيْهَا - فَأَخْبَرْتُهُ بِالَّذِي كَانَ مِنْ شَأْنِي وَبِالَّذِي قَالَ لِي عَبْدُ اللَّهِ بْنُ عُمَرَ قَالَ فَقَالَ لِي عَبْدُ اللَّهِ بْنُ الزُّبَيْرِ لَمْ تَحْرُمْ عَلَيْكَ فَارْجِعْ إِلَى أَهْلِكَ ‏.‏ وَكَتَبَ إِلَى جَابِرِ بْنِ الأَسْوَدِ الزُّهْرِيِّ - وَهُوَ أَمِيرُ الْمَدِينَةِ - يَأْمُرُهُ أَنْ يُعَاقِبَ عَبْدَ اللَّهِ بْنَ عَبْدِ الرَّحْمَنِ وَأَنْ يُخَلِّيَ بَيْنِي وَبَيْنَ أَهْلِي - قَالَ - فَقَدِمْتُ الْمَدِينَةَ فَجَهَّزَتْ صَفِيَّةُ امْرَأَةُ عَبْدِ اللَّهِ بْنِ عُمَرَ امْرَأَتِي حَتَّى أَدْخَلَتْهَا عَلَىَّ بِعِلْمِ عَبْدِ اللَّهِ بْنِ عُمَرَ ثُمَّ دَعَوْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ يَوْمَ عُرْسِي لِوَلِيمَتِي فَجَاءَنِي ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Thabit ibn al-Ahnaf that he\nmarried an umm walad of Abd ar-Rahman ibn Zayd ibn al-Khattab. He\nsaid, \"Abdullah ibn Abd ar-Rahman ibn Zayd ibn al-Khattab summoned me\nand I went to him. I came in upon him and there were whips and two\niron fetters placed there, and two of his slaves whom he had made to\nsit there. He said, 'Divorce her, or by He by whom one swears, I will\ndo such-and-such to you!' I said, 'It is divorce a thousand times.'\nThen I left him and I saw Abdullah ibn Umar on the road to Makka and I\ntold him about my situation. Abdullah ibn Umar was furious, and said,\n'That is not divorce, and she is not haram for you, so return to your\nhome.' I was still not at ease so I went to Abdullah ibn az-Zubayr who\nwas the Amir of Makka at that time. I told him about my situation and\nwhat Abdullah ibn Umar had said to me. Abdullah ibn az-Zubayr said to\nme, 'She is not haram for you, so return to your home,' and he wrote\nto Jabir ibn al-Aswad az-Zuhra who was the Amir of Madina and ordered\nhim to punish Abdullah ibn Abdar-Rahman and to have him leave me and\nmy family alone. I went to Madina, and Safiyya, the wife of Abdullah\nibn Umar fitted out my wife so that she could bring her to my house\nwith the knowledge of Abdullah ibn Umar. Then I invited Abdullah ibn\nUmar on the day of my wedding to the wedding feast and he came.\""}},{"id":87,"idInBook":87,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، أَنَّهُ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ، قَرَأَ ‏{‏يَا أَيُّهَا النَّبِيُّ إِذَا طَلَّقْتُمُ النِّسَاءَ فَطَلِّقُوهُنَّ‏}‏ لِقُبُلِ عِدَّتِهِنَّ ‏.‏ قَالَ مَالِكٌ يَعْنِي بِذَلِكَ أَنْ يُطَلِّقَ فِي كُلِّ طُهْرٍ مَرَّةً ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Abdullah ibn Dinar said, \"I\nheard Abdullah ibn Umar recite from the Qur'an, 'Prophet! When you\ndivorce women, divorce them at the beginning of their idda.'\"\n\n\nMalik said, \"He meant by that, to make one pronouncement of divorce at\nthe beginning of each period of purity.\""}},{"id":88,"idInBook":88,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّهُ قَالَ كَانَ الرَّجُلُ إِذَا طَلَّقَ امْرَأَتَهُ ثُمَّ ارْتَجَعَهَا قَبْلَ أَنْ تَنْقَضِيَ عِدَّتُهَا كَانَ ذَلِكَ لَهُ وَإِنْ طَلَّقَهَا أَلْفَ مَرَّةٍ فَعَمَدَ رَجُلٌ إِلَى امْرَأَتِهِ فَطَلَّقَهَا حَتَّى إِذَا شَارَفَتِ انْقِضَاءَ عِدَّتِهَا رَاجَعَهَا ثُمَّ طَلَّقَهَا ثُمَّ قَالَ لاَ وَاللَّهِ لاَ آوِيكِ إِلَىَّ وَلاَ تَحِلِّينَ أَبَدًا ‏.‏ فَأَنْزَلَ اللَّهُ تَبَارَكَ وَتَعَالَى ‏{‏الطَّلاَقُ مَرَّتَانِ فَإِمْسَاكٌ بِمَعْرُوفٍ أَوْ تَسْرِيحٌ بِإِحْسَانٍ‏}‏ فَاسْتَقْبَلَ النَّاسُ الطَّلاَقَ جَدِيدًا مِنْ يَوْمِئِذٍ مَنْ كَانَ طَلَّقَ مِنْهُمْ أَوْ لَمْ يُطَلِّقْ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa that his\nfather said, \"It used to be that a man would divorce his wife and then\nreturn to her before her idda was over, and that was alright, even if\nhe divorced her a thousand times. The man went to his wife and then\ndivorced her and when the end of her idda was in sight, he took her\nback and then divorced her and said, 'No! By Allah, I will not go to\nyou and you will never be able to marry again.' Allah, the Blessed,\nthe Exalted, sent down, 'Divorce is twice, then honourable retention\nor setting free kindly.' People then turned towards divorce in a new\nlight from that day whether or not they were divorced or not\ndivorced.\""}},{"id":89,"idInBook":89,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ ثَوْرِ بْنِ زَيْدٍ الدِّيلِيِّ، أَنَّ الرَّجُلَ، كَانَ يُطَلِّقُ امْرَأَتَهُ ثُمَّ يُرَاجِعُهَا وَلاَ حَاجَةَ لَهُ بِهَا وَلاَ يُرِيدُ إِمْسَاكَهَا كَيْمَا يُطَوِّلَ بِذَلِكَ عَلَيْهَا الْعِدَّةَ لِيُضَارَّهَا فَأَنْزَلَ اللَّهُ تَبَارَكَ وَتَعَالَى ‏{‏وَلاَ تُمْسِكُوهُنَّ ضِرَارًا لِتَعْتَدُوا وَمَنْ يَفْعَلْ ذَلِكَ فَقَدْ ظَلَمَ نَفْسَهُ‏}‏ يَعِظُهُمُ اللَّهُ بِذَلِكَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Thawr ibn Zayd ad-Dili that\nAllah, the Blessed, the Exalted, sent down about a man who divorced\nhis wife and then returned to her while he had no need of her and did\nnot mean to keep her so as to make the idda period long for her by\nthat in order to do her harm, \"Do not retain them by force, to\ntransgress. Whoever does that has wronged himself.\" (Sura 2 ayat 231).\nAllah warns them by that ayat."}},{"id":90,"idInBook":90,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ سَعِيدَ بْنَ الْمُسَيَّبِ، وَسُلَيْمَانَ بْنَ يَسَارٍ، سُئِلاَ عَنْ طَلاَقِ السَّكْرَانِ، فَقَالاَ إِذَا طَلَّقَ السَّكْرَانُ جَازَ طَلاَقُهُ وَإِنْ قَتَلَ قُتِلَ بِهِ ‏.‏ قَالَ مَالِكٌ وَعَلَى ذَلِكَ الأَمْرُ عِنْدَنَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Said ibn\nal-Musayyab and Sulayman ibn Yasar were asked about a man who divorced\nwhen he was drunk. They said, \"When a drunk man divorces, his divorce\nis allowed. If he kills, he is killed for it.\"\n\n\nMalik said,\n\"That is what is done among us.\""}},{"id":91,"idInBook":91,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ سَعِيدَ بْنَ الْمُسَيَّبِ، كَانَ يَقُولُ إِذَا لَمْ يَجِدِ الرَّجُلُ مَا يُنْفِقُ عَلَى امْرَأَتِهِ فُرِّقَ بَيْنَهُمَا ‏.‏ قَالَ مَالِكٌ وَعَلَى ذَلِكَ أَدْرَكْتُ أَهْلَ الْعِلْمِ بِبَلَدِنَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from\nMalik that he had heard that Said ibn al-Musayyab said, \"If a man does\nnot find the means to spend on his wife, they are to be separated . \"\n\n\nMalik said, \"That is what I saw the people of knowledge in\nour city doing.\"\n\n\n29.30 Idda of Widows when Pregnant"}},{"id":92,"idInBook":92,"chapterId":29,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ رَبِّهِ بْنِ سَعِيدِ بْنِ قَيْسٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّهُ قَالَ سُئِلَ عَبْدُ اللَّهِ بْنُ عَبَّاسٍ وَأَبُو هُرَيْرَةَ عَنِ الْمَرْأَةِ الْحَامِلِ يُتَوَفَّى عَنْهَا زَوْجُهَا فَقَالَ ابْنُ عَبَّاسٍ آخِرَ الأَجَلَيْنِ ‏.‏ وَقَالَ أَبُو هُرَيْرَةَ إِذَا وَلَدَتْ فَقَدْ حَلَّتْ ‏.‏ فَدَخَلَ أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ عَلَى أُمِّ سَلَمَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم فَسَأَلَهَا عَنْ ذَلِكَ فَقَالَتْ أُمُّ سَلَمَةَ وَلَدَتْ سُبَيْعَةُ الأَسْلَمِيَّةُ بَعْدَ وَفَاةِ زَوْجِهَا بِنِصْفِ شَهْرٍ فَخَطَبَهَا رَجُلاَنِ أَحَدُهُمَا شَابٌّ وَالآخَرُ كَهْلٌ فَحَطَّتْ إِلَى الشَّابِّ فَقَالَ الشَّيْخُ لَمْ تَحِلِّي بَعْدُ ‏.‏ وَكَانَ أَهْلُهَا غَيَبًا وَرَجَا إِذَا جَاءَ أَهْلُهَا أَنْ يُؤْثِرُوهُ بِهَا فَجَاءَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ قَدْ حَلَلْتِ فَانْكِحِي مَنْ شِئْتِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abdu Rabbih ibn Said ibn Qays\nthat Abu Salama ibn Abd ar-Rahman said that Abdullah ibn Abbas and Abu\nHurayra were asked when a pregnant woman whose husband had died could\nremarry. Ibn Abbas said, \"At the end of two periods.\" Abu Hurayra\nsaid, \"When she gives birth, she is free to marry.\" Abu Salama ibn Abd\nar-Rahman visited Umm Salama, the wife of the Prophet, may Allah bless\nhim and grant him peace, and asked her about it Umm Salama said,\n''Subaya al-Aslamiya gave birth half a month after the death of her\nhusband, and two men asked to marry her. One was young and the other\nwas old. She preferred the young man and so the older man said, 'You\nare not free to marry yet.' Her family were away and he hoped that\nwhen her family came, they would give her to him. She went to the\nMessenger of Allah, may Allah bless him and grant him peace, and he\nsaid, 'You are free to marry, so marry whomever you wish.' \""}},{"id":93,"idInBook":93,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ سُئِلَ عَنِ الْمَرْأَةِ، يُتَوَفَّى عَنْهَا زَوْجُهَا وَهِيَ حَامِلٌ فَقَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ إِذَا وَضَعَتْ حَمْلَهَا فَقَدْ حَلَّتْ ‏.‏ فَأَخْبَرَهُ رَجُلٌ مِنَ الأَنْصَارِ كَانَ عِنْدَهُ أَنَّ عُمَرَ بْنَ الْخَطَّابِ قَالَ لَوْ وَضَعَتْ وَزَوْجُهَا عَلَى سَرِيرِهِ لَمْ يُدْفَنْ بَعْدُ لَحَلَّتْ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nwas asked about a woman whose husband died while she was pregnant, and\nhe said, \"When she gives birth, she is free to marry.\" A man of the\nAnsar who was with him told him that Umar ibn al-Khattab had said,\n\"Had she given birth while her husband was still on his bed, unburied,\nshe would be free to marry.\""}},{"id":94,"idInBook":94,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنِ الْمِسْوَرِ بْنِ مَخْرَمَةَ، أَنَّهُ أَخْبَرَهُ أَنَّ سُبَيْعَةَ الأَسْلَمِيَّةَ نُفِسَتْ بَعْدَ وَفَاةِ زَوْجِهَا بِلَيَالٍ فَقَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ قَدْ حَلَلْتِ فَانْكِحِي مَنْ شِئْتِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn 'Urwa from his\nfather that al-Miswar ibn Makhrama told him that Subaya al-Aslamiya\ngave birth a few nights after the death of her husband. The Messenger\nof Allah, may Allah bless him and grant him peace, said to her, \"You\nare free to marry, so marry whomever you wish.\""}},{"id":95,"idInBook":95,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، وَأَبَا، سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ اخْتَلَفَا فِي الْمَرْأَةِ تُنْفَسُ بَعْدَ وَفَاةِ زَوْجِهَا بِلَيَالٍ فَقَالَ أَبُو سَلَمَةَ إِذَا وَضَعَتْ مَا فِي بَطْنِهَا فَقَدْ حَلَّتْ ‏.‏ وَقَالَ ابْنُ عَبَّاسٍ آخِرَ الأَجَلَيْنِ ‏.‏ فَجَاءَ أَبُو هُرَيْرَةَ فَقَالَ أَنَا مَعَ ابْنِ أَخِي ‏.‏ يَعْنِي أَبَا سَلَمَةَ فَبَعَثُوا كُرَيْبًا مَوْلَى عَبْدِ اللَّهِ بْنِ عَبَّاسٍ إِلَى أُمِّ سَلَمَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم يَسْأَلُهَا عَنْ ذَلِكَ فَجَاءَهُمْ فَأَخْبَرَهُمْ أَنَّهَا قَالَتْ وَلَدَتْ سُبَيْعَةُ الأَسْلَمِيَّةُ بَعْدَ وَفَاةِ زَوْجِهَا بِلَيَالٍ فَذَكَرَتْ ذَلِكَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ قَدْ حَلَلْتِ فَانْكِحِي مَنْ شِئْتِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said from Sulayman\nibn Yasar that Abdullah ibn Abbas and Abu Salama ibn Abd ar-Rahman ibn\nAwf differed on the question of a wornan who gave birth a few nights\nafter the death of her husband. Abu Salama said, \"When she gives birth\nto the child she is carrying, she is free to marry.\" Ibn Abbas said,\n\"At the end of two periods.\" Abu Hurayra came and said, \"I am with my\nnephew\", meaning Abu Salama. They sent Kurayb, a mawla of Abdullah ibn\nAbbas to Umm Salama, the wife of the Prophet, may Allah bless him and\ngrant him peace, to ask her about it. He came back and told them that\nshe had said that Subaya al-Aslamiya had given birth a few nights\nafter the death of her husband, and she had brought the matter to the\nMessenger of Allah, may Allah bless him and grant him peace, and he\nhad said, \"You are free to marry, so marry whomever you wish.\"\n\n\nMalik said, \"This is how the people of knowledge here continue to\nact.\"\n\n\n29.31 Widows Remaining in Their Houses until Free to\nMarry"}},{"id":96,"idInBook":96,"chapterId":29,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ سَعِيدِ بْنِ إِسْحَاقَ بْنِ كَعْبِ بْنِ عُجْرَةَ، عَنْ عَمَّتِهِ، زَيْنَبَ بِنْتِ كَعْبِ بْنِ عُجْرَةَ أَنَّ الْفُرَيْعَةَ بِنْتَ مَالِكِ بْنِ سِنَانٍ، - وَهِيَ أُخْتُ أَبِي سَعِيدٍ الْخُدْرِيِّ - أَخْبَرَتْهَا أَنَّهَا، جَاءَتْ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم تَسْأَلُهُ أَنْ تَرْجِعَ إِلَى أَهْلِهَا فِي بَنِي خُدْرَةَ فَإِنَّ زَوْجَهَا خَرَجَ فِي طَلَبِ أَعْبُدٍ لَهُ أَبَقُوا حَتَّى إِذَا كَانُوا بِطَرَفِ الْقَدُومِ لَحِقَهُمْ فَقَتَلُوهُ ‏.‏ قَالَتْ فَسَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم أَنْ أَرْجِعَ إِلَى أَهْلِي فِي بَنِي خُدْرَةَ فَإِنَّ زَوْجِي لَمْ يَتْرُكْنِي فِي مَسْكَنٍ يَمْلِكُهُ وَلاَ نَفَقَةَ ‏.‏ قَالَتْ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ نَعَمْ ‏\"‏ ‏.‏ قَالَتْ فَانْصَرَفْتُ حَتَّى إِذَا كُنْتُ فِي الْحُجْرَةِ نَادَانِي رَسُولُ اللَّهِ صلى الله عليه وسلم أَوْ أَمَرَ بِي فَنُودِيتُ لَهُ فَقَالَ ‏\"‏ كَيْفَ قُلْتِ ‏\"‏ ‏.‏ فَرَدَّدْتُ عَلَيْهِ الْقِصَّةَ الَّتِي ذَكَرْتُ لَهُ مِنْ شَأْنِ زَوْجِي فَقَالَ ‏\"‏ امْكُثِي فِي بَيْتِكِ حَتَّى يَبْلُغَ الْكِتَابُ أَجَلَهُ ‏\"‏ ‏.‏ قَالَتْ فَاعْتَدَدْتُ فِيهِ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا - قَالَتْ - فَلَمَّا كَانَ عُثْمَانُ بْنُ عَفَّانَ أَرْسَلَ إِلَىَّ فَسَأَلَنِي عَنْ ذَلِكَ فَأَخْبَرْتُهُ فَاتَّبَعَهُ وَقَضَى بِهِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Said ibn Ishaq ibn Kab ibn\nUjra from his paternal aunt, Zaynab bint Kab ibn Ujra that al-Furaya\nbint Malik ibn Sinan, the sister of Abu Said al-Khudri, informed her\nthat she went to the Messenger of Allah, may Allah bless him and grant\nhim peace, and asked to be able to return to her people among the Banu\nKhudra since her husband had gone out in search of some of his slaves\nwho had run away and he had caught up with them near al-Qudum, (which\nis 6 miles from Madina), and they had killed him.\n\n\nShe said,\n\"I asked the Messenger of Allah, may Allah bless him and grant him\npeace, if I could return to my people in the Banu Khudra, as my\nhusband had not left me in a dwelling which belonged to him, and had\nleft me no maintenance. The Messenger of Allah, may Allah bless him\nand grant him peace, said,'Yes.' So I left. When I was in the\ncourtyard, the Messenger of Allah, may Allah bless him and grant him\npeace, called me or summoned me, and I answered him. He said, 'What\ndid you say?' I repeated the story about my husband. He said, 'Stay in\nyour house until what is written reaches its term.' I did the idda in\nthe house for four months and ten days.\"\n\n\nShe added, \"When\nUthman ibn Affan sent for me, I told him that, and he followed it and\nmade decisions by it.\""}},{"id":97,"idInBook":97,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ حُمَيْدِ بْنِ قَيْسٍ الْمَكِّيِّ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، ‏.‏ أَنَّ عُمَرَ بْنَ الْخَطَّابِ، كَانَ يَرُدُّ الْمُتَوَفَّى عَنْهُنَّ أَزْوَاجُهُنَّ مِنَ الْبَيْدَاءِ يَمْنَعُهُنَّ الْحَجَّ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Humayd ibn Qays al-Makki from\nAmr ibn Shuayb from Said ibn al-Musayyab that Umar ibn al-Khattab sent\nback widows from the desert and prevented them from doing the hajj."}},{"id":98,"idInBook":98,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ بَلَغَهُ أَنَّ السَّائِبَ بْنَ خَبَّابٍ، تُوُفِّيَ وَإِنَّ امْرَأَتَهُ جَاءَتْ إِلَى عَبْدِ اللَّهِ بْنِ عُمَرَ فَذَكَرَتْ لَهُ وَفَاةَ زَوْجِهَا وَذَكَرَتْ لَهُ حَرْثًا لَهُمْ بِقَنَاةَ وَسَأَلَتْهُ هَلْ يَصْلُحُ لَهَا أَنْ تَبِيتَ فِيهِ فَنَهَاهَا عَنْ ذَلِكَ فَكَانَتْ تَخْرُجُ مِنَ الْمَدِينَةِ سَحَرًا فَتُصْبِحُ فِي حَرْثِهِمْ فَتَظَلُّ فِيهِ يَوْمَهَا ثُمَّ تَدْخُلُ الْمَدِينَةَ إِذَا أَمْسَتْ فَتَبِيتُ فِي بَيْتِهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Saqd that he\nhad heard that as-Sa'ib ibn Khabbab died, and his wife went to\nAbdullah ibn Umar and mentioned to him that her husband had died and\nmentioned some land which they had at Qanah, (a district on the\noutskirts of Madina), and asked him if it would be alright for her to\nstay overnight there. He forbade her to do so. So, she went out before\ndawn from Madina and spent the whole day on their land, but when\nevening came, she spent the night in her house."}},{"id":99,"idInBook":99,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّهُ كَانَ يَقُولُ فِي الْمَرْأَةِ الْبَدَوِيَّةِ يُتَوَفَّى عَنْهَا زَوْجُهَا إِنَّهَا تَنْتَوِي حَيْثُ انْتَوَى أَهْلُهَا ‏.‏ قَالَ مَالِكٌ وَهَذَا الأَمْرُ عِنْدَنَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Hisham ibn Urwa said about a\nBedouin woman whose husband died, that she was to stay where her\npeople stayed.\n\n\nMalik said, \"This is what is done among us.\""}},{"id":100,"idInBook":100,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ كَانَ يَقُولُ لاَ تَبِيتُ الْمُتَوَفَّى عَنْهَا زَوْجُهَا وَلاَ الْمَبْتُوتَةُ إِلاَّ فِي بَيْتِهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullan ibn Umar\nsaid, \"The only place a woman whose husband has died and a woman who\nis absolutely divorced can spend the night is in their houses.\""}},{"id":101,"idInBook":101,"chapterId":29,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ قَالَ سَمِعْتُ الْقَاسِمَ بْنَ مُحَمَّدٍ، يَقُولُ إِنَّ يَزِيدَ بْنَ عَبْدِ الْمَلِكِ فَرَّقَ بَيْنَ رِجَالٍ وَبَيْنَ نِسَائِهِمْ وَكُنَّ أُمَّهَاتِ أَوْلاَدِ رِجَالٍ هَلَكُوا فَتَزَوَّجُوهُنَّ بَعْدَ حَيْضَةٍ أَوْ حَيْضَتَيْنِ فَفَرَّقَ بَيْنَهُمْ حَتَّى يَعْتَدُّونَ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا ‏.‏ فَقَالَ الْقَاسِمُ بْنُ مُحَمَّدٍ سُبْحَانَ اللَّهِ يَقُولُ اللَّهُ فِي كِتَابِهِ ‏{‏وَالَّذِينَ يُتَوَفَّوْنَ مِنْكُمْ وَيَذَرُونَ أَزْوَاجًا‏}‏ مَا هُنَّ مِنَ الأَزْوَاجِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Yahya ibn Said said that he\nhad heard al-Qasim ibn Muhammad say that Zayd ibn Abd al-Malik\nseparated some men and their wives who were slave-girls who had borne\nchildren to men who had died, because they had married them after one\nor two menstrual periods. He separated them until they had done an\nidda of four months and ten days. Al-Qasim ibn Muhammad said, \"Glory\nbe to Allah! Allah says in His Book, 'Those of you who die, leaving\nwives, they are not wives.' \""}},{"id":102,"idInBook":102,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ قَالَ عِدَّةُ أُمِّ الْوَلَدِ إِذَا تُوُفِّيَ عَنْهَا سَيِّدُهَا حَيْضَةٌ ‏.‏","english":{"narrator":"","text":"Malik related to me from Nafi that Abdullah ibn Umar said, \"The\nidda of an umm walad when her master dies is one menstrual period.\""}},{"id":103,"idInBook":103,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، أَنَّهُ كَانَ يَقُولُ عِدَّةُ أُمِّ الْوَلَدِ إِذَا تُوُفِّيَ عَنْهَا سَيِّدُهَا حَيْضَةٌ ‏.‏ قَالَ مَالِكٌ وَهُوَ الأَمْرُ عِنْدَنَا ‏.‏ قَالَ مَالِكٌ وَإِنْ لَمْ تَكُنْ مِمَّنْ تَحِيضُ فَعِدَّتُهَا ثَلاَثَةُ أَشْهُرٍ ‏.‏","english":{"narrator":"","text":"Malik said, \"This is what is\ndone among us.\"\n\n\nMalik added, \"If she does not have a\nmenstrual period, her idda is three months.\""}},{"id":104,"idInBook":104,"chapterId":29,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ سَعِيدَ بْنَ الْمُسَيَّبِ، وَسُلَيْمَانَ بْنَ يَسَارٍ، كَانَا يَقُولاَنِ عِدَّةُ الأَمَةِ إِذَا هَلَكَ عَنْهَا زَوْجُهَا شَهْرَانِ وَخَمْسُ لَيَالٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Said ibn\nal-Musayyab and Sulayman ibn Yasar said, \"The idda of a slave-girl\nwhen her husband dies is two months and five days.\""}},{"id":105,"idInBook":105,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، مِثْلَ ذَلِكَ ‏.‏ قَالَ مَالِكٌ فِي الْعَبْدِ يُطَلِّقُ الأَمَةَ طَلاَقًا لَمْ يَبُتَّهَا فِيهِ لَهُ عَلَيْهَا فِيهِ الرَّجْعَةُ ثُمَّ يَمُوتُ وَهِيَ فِي عِدَّتِهَا مِنْ طَلاَقِهِ إِنَّهَا تَعْتَدُّ عِدَّةَ الأَمَةِ الْمُتَوَفَّى عَنْهَا زَوْجُهَا شَهْرَيْنِ وَخَمْسَ لَيَالٍ وَإِنَّهَا إِنْ عَتَقَتْ وَلَهُ عَلَيْهَا رَجْعَةٌ ثُمَّ لَمْ تَخْتَرْ فِرَاقَهُ بَعْدَ الْعِتْقِ حَتَّى يَمُوتَ وَهِيَ فِي عِدَّتِهَا مِنْ طَلاَقِهِ اعْتَدَّتْ عِدَّةَ الْحُرَّةِ الْمُتَوَفَّى عَنْهَا زَوْجُهَا أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا وَذَلِكَ أَنَّهَا إِنَّمَا وَقَعَتْ عَلَيْهَا عِدَّةُ الْوَفَاةِ بَعْدَ مَا عَتَقَتْ فَعِدَّتُهَا عِدَّةُ الْحُرَّةِ ‏.‏ قَالَ مَالِكٌ وَهَذَا الأَمْرُ عِنْدَنَا ‏.‏","english":{"narrator":"","text":"Yahya related to me the like of that from Malik from Ibn Shihab.\n\n\nMalik said, about a slave who divorced a slave-girl but did\nnot make it absolute, \"He can return to her. If he then dies while she\nis still in the idda from her divorce, she does the idda of a slave-\ngirl whose husband dies, and it is two months and five days. If she\nhas been set free and he can return to her, and she does not choose to\nseparate after she has been set free, and he dies while she is in the\nidda from the divorce, she does the idda of a free woman whose husband\nhas died, four months and ten days. That is because the idda of\nwidowhood befell her while she was free, so her idda is the idda of a\nfree woman.\"\n\n\nMalik said, \"That is what is done among us.\""}},{"id":106,"idInBook":106,"chapterId":29,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، عَنِ ابْنِ مُحَيْرِيزٍ، أَنَّهُ قَالَ دَخَلْتُ الْمَسْجِدَ فَرَأَيْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ فَجَلَسْتُ إِلَيْهِ فَسَأَلْتُهُ عَنِ الْعَزْلِ، فَقَالَ أَبُو سَعِيدٍ الْخُدْرِيُّ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي غَزْوَةِ بَنِي الْمُصْطَلِقِ فَأَصَبْنَا سَبْيًا مِنْ سَبْىِ الْعَرَبِ فَاشْتَهَيْنَا النِّسَاءَ وَاشْتَدَّتْ عَلَيْنَا الْعُزْبَةُ وَأَحْبَبْنَا الْفِدَاءَ فَأَرَدْنَا أَنْ نَعْزِلَ فَقُلْنَا نَعْزِلُ وَرَسُولُ اللَّهِ صلى الله عليه وسلم بَيْنَ أَظْهُرِنَا قَبْلَ أَنْ نَسْأَلَهُ ‏.‏ فَسَأَلْنَاهُ عَنْ ذَلِكَ فَقَالَ ‏\n\"‏ مَا عَلَيْكُمْ أَنْ لاَ تَفْعَلُوا مَا مِنْ نَسَمَةٍ كَائِنَةٍ إِلَى يَوْمِ الْقِيَامَةِ إِلاَّ وَهِيَ كَائِنَةٌ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Rabia ibn Abi Abd ar-Rahman\nfrom Muhammad ibn Yahya ibn Habban that Ibn Muhayriz said, \"I went\ninto the mosque and saw Abu Said al-Khudri and so I sat by him and\nasked him about coitus interruptus. Abu Said al-Khudri said, 'We went\nout with the Messenger of Allah, may Allah bless him and grant him\npeace, on the expedition to the Banu al-Mustaliq. We took some Arabs\nprisoner, and we desired the women as celibacy was hard for us. We\nwanted the ransom, so we wanted to practise coitus interruptus. We\nsaid, 'Shall we practise coitus interruptus while the Messenger of\nAllah, may Allah bless him and grant him peace, is among us before we\nask him?' We asked him about that and he said, 'You don't have to not\ndo it. There is no self which is to come into existence up to the Day\nof Rising but that it will come into existence.' \""}},{"id":107,"idInBook":107,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي النَّضْرِ، مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ عَنْ عَامِرِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ، عَنْ أَبِيهِ، أَنَّهُ كَانَ يَعْزِلُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'n-Nadr, the mawla of Umar\nibn Ubaydullah from Amir ibn Sad ibn Abi Waqqas from his father that\nhe used to practise coitus interruptus."}},{"id":108,"idInBook":108,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي النَّضْرِ، مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ عَنِ ابْنِ أَفْلَحَ، مَوْلَى أَبِي أَيُّوبَ الأَنْصَارِيِّ عَنْ أُمِّ وَلَدٍ، لأَبِي أَيُّوبَ الأَنْصَارِيِّ أَنَّهُ كَانَ يَعْزِلُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'n-Nadr, the mawla of Umar\nibn Ubaydullah from Ibn Aflah, the mawla of Abu Ayyub al-Ansari from\nan umm walad of Abu Ayyubal-Ansari that he practised coitus\ninterruptus."}},{"id":109,"idInBook":109,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ كَانَ لاَ يَعْزِلُ وَكَانَ يَكْرَهُ الْعَزْلَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\ndid not practise coitus interruptus and thought that it was\ndisapproved."}},{"id":110,"idInBook":110,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ ضَمْرَةَ بْنِ سَعِيدٍ الْمَازِنِيِّ، عَنِ الْحَجَّاجِ بْنِ عَمْرِو بْنِ غَزِيَّةَ، أَنَّهُ كَانَ جَالِسًا عِنْدَ زَيْدِ بْنِ ثَابِتٍ فَجَاءَهُ ابْنُ قَهْدٍ - رَجُلٌ مِنْ أَهْلِ الْيَمَنِ - فَقَالَ يَا أَبَا سَعِيدٍ إِنَّ عِنْدِي جَوَارِيَ لِي لَيْسَ نِسَائِي اللاَّتِي أُكِنُّ بِأَعْجَبَ إِلَىَّ مِنْهُنَّ وَلَيْسَ كُلُّهُنَّ يُعْجِبُنِي أَنْ تَحْمِلَ مِنِّي أَفَأَعْزِلُ فَقَالَ زَيْدُ بْنُ ثَابِتٍ أَفْتِهِ يَا حَجَّاجُ ‏.‏ قَالَ فَقُلْتُ يَغْفِرُ اللَّهُ لَكَ إِنَّمَا نَجْلِسُ عِنْدَكَ لِنَتَعَلَّمَ مِنْكَ ‏.‏ قَالَ أَفْتِهِ ‏.‏ قَالَ فَقُلْتُ هُوَ حَرْثُكَ إِنْ شِئْتَ سَقَيْتَهُ وَإِنْ شِئْتَ أَعْطَشْتَهُ ‏.‏ قَالَ وَكُنْتُ أَسْمَعُ ذَلِكَ مِنْ زَيْدٍ فَقَالَ زَيْدٌ صَدَقَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Damra ibn Said al-Mazini from\nal-Hajjaj ibn Amr ibn Ghaziya that he was sitting with Zayd ibn Thabit\nwhen Ibn Fahd came to him. He was from the Yemen. He said, \"Abu Said!\nI have slave-girls. None of the wives in my keep are more pleasing to\nme than them, and not all of them please me so much that I want a\nchild by them, shall I then practise coitus interruptus?\" Zayd ibn\nThabit said, \"Give an opinion, Hajjaj!\" \"I said, 'May Allah forgive\nyou! We sit with you in order to learn from you!' He said, 'Give an\nopinion! 'I said, 'She is your field, if you wish, water it, and if\nyou wish, leave it thirsty. I heard that from Zayd.' Zayd said, 'He\nhas spoken the truth.' \""}},{"id":111,"idInBook":111,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ حُمَيْدِ بْنِ قَيْسٍ الْمَكِّيِّ، عَنْ رَجُلٍ، يُقَالُ لَهُ ذَفِيفٌ أَنَّهُ قَالَ سُئِلَ ابْنُ عَبَّاسٍ عَنِ الْعَزْلِ فَدَعَا جَارِيَةً لَهُ فَقَالَ أَخْبِرِيهِمْ ‏.‏ فَكَأَنَّهَا اسْتَحْيَتْ ‏.‏ فَقَالَ هُوَ ذَلِكَ أَمَّا أَنَا فَأَفْعَلُهُ ‏.‏ يَعْنِي أَنَّهُ يَعْزِلُ ‏.‏ قَالَ مَالِكٌ لاَ يَعْزِلُ الرَّجُلُ عَنِ الْمَرْأَةِ الْحُرَّةِ إِلاَّ بِإِذْنِهَا وَلاَ بَأْسَ أَنْ يَعْزِلَ عَنْ أَمَتِهِ بِغَيْرِ إِذْنِهَا وَمَنْ كَانَتْ تَحْتَهُ أَمَةُ قَوْمٍ فَلاَ يَعْزِلُ إِلاَّ بِإِذْنِهِمْ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Humayd ibn Qays al-Makki that\na man called Dhafif said that Ibn Abbas was asked about coitus\ninterruptus. He called a slave-girl of his and said, \"Tell them.\" She\nwas embarrassed. He said, \"It is alright, and I do it myself.\"\n\n\nMalik said, \"A man does not practise coitus interruptus with a\nfree woman unless she gives her permission. There is no harm in\npractising coitus interruptus with a slave-girl without her\npermission. Someone who has someone else's slave-girl as a wife, does\nnot practise coitus interruptus with her unless her people give him\npermission.\""}},{"id":112,"idInBook":112,"chapterId":29,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، عَنْ حُمَيْدِ بْنِ نَافِعٍ، عَنْ زَيْنَبَ بِنْتِ أَبِي سَلَمَةَ، أَنَّهَا أَخْبَرَتْهُ هَذِهِ الأَحَادِيثَ الثَّلاَثَةَ، قَالَتْ زَيْنَبُ دَخَلْتُ عَلَى أُمِّ حَبِيبَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم حِينَ تُوُفِّيَ أَبُوهَا أَبُو سُفْيَانَ بْنُ حَرْبٍ فَدَعَتْ أُمُّ حَبِيبَةَ بِطِيبٍ فِيهِ صُفْرَةٌ خَلُوقٌ أَوْ غَيْرُهُ فَدَهَنَتْ بِهِ جَارِيَةً ثُمَّ مَسَحَتْ بِعَارِضَيْهَا ثُمَّ قَالَتْ وَاللَّهِ مَا لِي بِالطِّيبِ مِنْ حَاجَةٍ غَيْرَ أَنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ لاَ يَحِلُّ لاِمْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ أَنْ تُحِدَّ عَلَى مَيْتٍ فَوْقَ ثَلاَثِ لَيَالٍ إِلاَّ عَلَى زَوْجٍ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abdullah ibn Abi Bakr ibn\nMuhammad ibn Amr ibn Hazm from Humayd ibn Nafi that Zaynab bint Abi\nSalama related these three traditions to him. Zaynab said, \"I visited\nUmm Habiba, the wife of the Prophet, may Allah bless him and grant him\npeace, when her father Abu Sufyan ibn Harb had died. Umm Habiba called\nfor a yellowy perfume perhaps khaluq or something else. She rubbed the\nperfume first on a slave-girl and she then wiped it on the sides of\nher face and said, 'By Allah! I have no need of perfume but I heard\nthe Messenger of Allah, may Allah bless him and grant him peace, say,\n'It is not halal for a woman who trusts in Allah and the Last Day to\nabstain from adornment in mourning for someone who has died, for more\nthan three nights, except for four months and ten days for a husband.'\n\""}},{"id":113,"idInBook":113,"chapterId":29,"bookId":7,"arabic":"قَالَتْ زَيْنَبُ ثُمَّ دَخَلْتُ عَلَى زَيْنَبَ بِنْتِ جَحْشٍ زَوْجِ النَّبِيِّ صلى الله عليه وسلم حِينَ تُوُفِّيَ أَخُوهَا فَدَعَتْ بِطِيبٍ فَمَسَّتْ مِنْهُ ثُمَّ قَالَتْ وَاللَّهِ مَا لِي بِالطِّيبِ حَاجَةٌ غَيْرَ أَنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ لاَ يَحِلُّ لاِمْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ تُحِدُّ عَلَى مَيْتٍ فَوْقَ ثَلاَثِ لَيَالٍ إِلاَّ عَلَى زَوْجٍ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا ‏\"‏ ‏.‏","english":{"narrator":"","text":"Zaynab said, \"I went to the house of Zaynab bint Jahsh, the wife\nof the Prophet, may Allah bless him and grant him peace, when her\nbrother had died. She called for perfume and put some on and said, 'By\nAllah! I have no need of perfume, but I heard the Messenger of Allah,\nmay Allah bless him and grant him peace, say, 'It is not halal for a\nwoman who trusts in Allah and the Last Day to abstain from adornment\nin mourning for someone who has died for more than three nights,\nexcept for four months and ten days for a husband.' \""}},{"id":114,"idInBook":114,"chapterId":29,"bookId":7,"arabic":"قَالَتْ زَيْنَبُ وَسَمِعْتُ أُمِّي أُمَّ سَلَمَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم تَقُولُ جَاءَتِ امْرَأَةٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ ابْنَتِي تُوُفِّيَ عَنْهَا زَوْجُهَا وَقَدِ اشْتَكَتْ عَيْنَيْهَا أَفَتَكْحُلُهُمَا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ ‏\"‏ ‏.‏ مَرَّتَيْنِ أَوْ ثَلاَثًا كُلُّ ذَلِكَ يَقُولُ ‏\"‏ لاَ ‏\"‏ ثُمَّ قَالَ ‏\"‏ إِنَّمَا هِيَ أَرْبَعَةُ أَشْهُرٍ وَعَشْرًا وَقَدْ كَانَتْ إِحْدَاكُنَّ فِي الْجَاهِلِيَّةِ تَرْمِي بِالْبَعْرَةِ عَلَى رَأْسِ الْحَوْلِ ‏\"‏ ‏.‏ قَالَ حُمَيْدُ بْنُ نَافِعٍ فَقُلْتُ لِزَيْنَبَ وَمَا تَرْمِي بِالْبَعْرَةِ عَلَى رَأْسِ الْحَوْلِ فَقَالَتْ زَيْنَبُ كَانَتِ الْمَرْأَةُ إِذَا تُوُفِّيَ عَنْهَا زَوْجُهَا دَخَلَتْ حِفْشًا وَلَبِسَتْ شَرَّ ثِيَابِهَا وَلَمْ تَمَسَّ طِيبًا وَلاَ شَيْئًا حَتَّى تَمُرَّ بِهَا سَنَةٌ ثُمَّ تُؤْتَى بِدَابَّةٍ حِمَارٍ أَوْ شَاةٍ أَوْ طَيْرٍ فَتَفْتَضُّ بِهِ فَقَلَّمَا تَفْتَضُّ بِشَىْءٍ إِلاَّ مَاتَ ثُمَّ تَخْرُجُ فَتُعْطَى بَعْرَةً فَتَرْمِي بِهَا ثُمَّ تُرَاجِعُ بَعْدُ مَا شَاءَتْ مِنْ طِيبٍ أَوْ غَيْرِهِ ‏.‏","english":{"narrator":"","text":"Zaynab said, \"I heard my mother, Umm Salama, the wife of the\nProphet, may Allah bless him and grant him peace, say that a woman\ncame to the Messenger of Allah, may Allah bless him and grant him\npeace, and said, 'Messenger of Allah! My daughter's husband died, and\nher eyes are troubling her, can she put kohl on them?' The Messenger\nof Allah, may Allah bless him and grant him peace, said, 'No' two or\nthree times. Then he said, 'It is only four months and ten days. In\nthe Jahiliyya, none of you threw away the piece of dung until a year\nhad passed.' \"\n\n\nHumayd ibn Nafi said, \"I asked Zaynab to\nexplain what 'throwing away the piece of dung at the end of a year'\nmeant. Zaynab said, 'In the Jahiliyya when a woman's husband died, she\nwent into a small tent and dressed in the worst of clothes. She did\nnot touch perfume or anything until a year had passed. Then she was\nbrought an animal - a donkey, a sheep, or a bird, and she would break\nher idda with it, by rubbing her body against it (taftaddu). Rarely\ndid she break her idda with anything (by rubbing herself against it)\nbut that it died. Then she would come out and would be given a piece\nof dung. She would throw it away and then return to whatever she\nwished of perfumes or whatever.' \"\n\n\nMalik explained,\n'Taftaddu' means to wipe her skin with it in the same way as with a\nhealing charm.\""}},{"id":115,"idInBook":115,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ صَفِيَّةَ بِنْتِ أَبِي عُبَيْدٍ، عَنْ عَائِشَةَ، وَحَفْصَةَ، زَوْجَىِ النَّبِيِّ صلى الله عليه وسلم أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ يَحِلُّ لاِمْرَأَةٍ تُؤْمِنُ","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi from Safiyya bint Abi\nUbayd from A'isha and Hafsa, the wives of the Prophet, may Allah bless\nhim and grant him peace, that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"It is not halal for a woman in\nmourning for someone who has died, if she trusts in Allah and the Last\nDay, to abstain from adornment for more than three nights, except for\na husband.\""}},{"id":116,"idInBook":116,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ أُمَّ سَلَمَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَالَتْ لاِمْرَأَةٍ حَادٍّ عَلَى زَوْجِهَا اشْتَكَتْ عَيْنَيْهَا فَبَلَغَ ذَلِكَ مِنْهَا اكْتَحِلِي بِكُحْلِ الْجِلاَءِ بِاللَّيْلِ وَامْسَحِيهِ بِالنَّهَارِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Umm Salama,\nthe wife of the Prophet, may Allah bless him and grant him peace, said\nto a woman in mourning for her husband whose eyes were troubling her\nand the pain had become very strong, \"Apply jala kohl at night and\nwipe it off in the day.\""}},{"id":117,"idInBook":117,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، وَسُلَيْمَانَ بْنِ يَسَارٍ، أَنَّهُمَا كَانَا يَقُولاَنِ فِي الْمَرْأَةِ يُتَوَفَّى عَنْهَا زَوْجُهَا إِنَّهَا إِذَا خَشِيَتْ عَلَى بَصَرِهَا مِنْ رَمَدٍ أَوْ شَكْوٍ أَصَابَهَا إِنَّهَا تَكْتَحِلُ وَتَتَدَاوَى بِدَوَاءٍ أَوْ كُحْلٍ وَإِنْ كَانَ فِيهِ طِيبٌ ‏.‏ قَالَ مَالِكٌ وَإِذَا كَانَتِ الضَّرُورَةُ فَإِنَّ دِينَ اللَّهِ يُسْرٌ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Salim ibn\nAbdullah and Sulayman ibn Yasar said that if a woman whose husband had\ndied feared that an inflammation of her eyes might affect her sight or\nthat some complaint might befall her, she should put kohl on and seek\na remedy with kohl or some other cure even if it had perfume in it.\n\n\nMalik said, \"If there is a necessity, the deen of Allah is\nease.\""}},{"id":118,"idInBook":118,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ صَفِيَّةَ بِنْتَ أَبِي عُبَيْدٍ، اشْتَكَتْ عَيْنَيْهَا وَهِيَ حَادٌّ عَلَى زَوْجِهَا عَبْدِ اللَّهِ بْنِ عُمَرَ فَلَمْ تَكْتَحِلْ حَتَّى كَادَتْ عَيْنَاهَا تَرْمَصَانِ ‏.‏ قَالَ مَالِكٌ تَدَّهِنُ الْمُتَوَفَّى عَنْهَا زَوْجُهَا بِالزَّيْتِ وَالشَّبْرَقِ وَمَا أَشْبَهَ ذَلِكَ إِذَا لَمْ يَكُنْ فِيهِ طِيبٌ ‏.‏ قَالَ مَالِكٌ وَلاَ تَلْبَسُ الْمَرْأَةُ الْحَادُّ عَلَى زَوْجِهَا شَيْئًا مِنَ الْحَلْىِ خَاتَمًا وَلاَ خَلْخَالاً وَلاَ غَيْرَ ذَلِكَ مِنَ الْحَلْىِ وَلاَ تَلْبَسُ شَيْئًا مِنَ الْعَصْبِ إِلاَّ أَنْ يَكُونَ عَصْبًا غَلِيظًا وَلاَ تَلْبَسُ ثَوْبًا مَصْبُوغًا بِشَىْءٍ مِنَ الصِّبْغِ إِلاَّ بِالسَّوَادِ وَلاَ تَمْتَشِطُ إِلاَّ بِالسِّدْرِ وَمَا أَشْبَهَهُ مِمَّا لاَ يَخْتَمِرُ فِي رَأْسِهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafic that Saffiyya bint Abi\nUbayd suffered from an eye-complaint while she was in mourning for her\nhusband, Abdullah ibn Umar. She did not apply kohl until her eyes\nalmost had ramas (a dry white secretion in the corners of the eye).\n\n\nMalik said, \"A woman whose husband has died should anoint her\neyes with olive oil and sesame oil and the like of that since there is\nno perfume in it.\"\n\n\nMalik said, \"A woman in mourning for her\nhusband should not put on any jewellery - rings, anklets, or such-\nlike, neither should she dress in any sort of colourful, striped\ngarment unless it is coarse. She should not wear any cloth dyed with\nanything except black, and she should only dress her hair with things\nlike lotus-tree leaves which do not dye the hair.\""}},{"id":119,"idInBook":119,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم دَخَلَ عَلَى أُمِّ سَلَمَةَ وَهِيَ حَادٌّ عَلَى أَبِي سَلَمَةَ وَقَدْ جَعَلَتْ عَلَى عَيْنَيْهَا صَبِرًا فَقَالَ ‏\"‏ مَا هَذَا يَا أُمَّ سَلَمَةَ ‏\"‏ ‏.‏ فَقَالَتْ إِنَّمَا هُوَ صَبِرٌ يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\"‏ اجْعَلِيهِ فِي اللَّيْلِ وَامْسَحِيهِ بِالنَّهَارِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"108 Yahya related to me from Malik that he had heard that the\nMessenger of Allah, may Allah bless him and grant him peace, visited\nUmm Salama while she was in mourning for Abu Salama and she had put\naloes on her eyes. He said, \"What is this, Umm Salama?\" She said, \"It\nis only aloes, Messenger of Allah.\" He said, \"Put it on at night and\nwipe it off in the daytime.\"\n\n\nMalik said, \"The mourning of a\nyoung girl who has not yet had a menstrual period takes the same form\nas the mourning of one who has had a period. She avoids what a mature\nwoman avoids if her husband dies.\"\n\n\nMalik said, \"A slave-girl\nmourns her husband when he dies for two months and five nights like\nher idda.''\n\n\nMalik said, \"An umm walad does not have to mourn\nwhen her master dies, and a slave-girl does not have to mourn when her\nmaster dies. Mourning is for those with husbands.\""}},{"id":120,"idInBook":120,"chapterId":29,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ أُمَّ سَلَمَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم كَانَتْ تَقُولُ تَجْمَعُ الْحَادُّ رَأْسَهَا بِالسِّدْرِ وَالزَّيْتِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Umm Salama,\nthe wife of the Prophet, may Allah bless him and grant him peace,\nsaid, \"A mourning woman can rub her head with lotus leaves and olive\noil.''"}}],"chapter":{"id":29,"bookId":7,"arabic":"كتاب الطلاق","english":"Divorce"}}