{"metadata":{"length":103,"arabic":{"title":"موطأ مالك","author":"الإمام مالك بن أنس","introduction":"كتاب البيوع"},"english":{"title":"Muwatta Malik","author":"Imam Malik ibn Anas","introduction":"Business Transactions"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":31,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ الثِّقَةِ، عِنْدَهُ عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ الْعُرْبَانِ ‏.‏ \n\nقَالَ مَالِكٌ: وَذلِكَ فِيمَا نُرَى - وَاللهُ أَعْلَمُ - أَنْ يَشْتَرِيَ الرَّجُلُ الْعَبْدَ، أَوِ الْوَلِيدَةَ. أَوْ يَتَكَارَى الدَّابَّةَ. ثُمَّ يَقُولُ لِلَّذِي اشْتَرَى مِنْهُ، أَوْ تَكَارَى مِنْهُ: أُعْطِيكَ دِينَاراً، أَوْ دِرْهَماً، أَوْ أَكْثَرَ مِنْ ذلِكَ، أَوْ أَقَلَّ. عَلَى أَنِّي إِنْ أَخَذْتُ السِّلْعَةَ، أَوْ رَكِبْتُ مَا تَكَارَيْتُ مِنْكَ، فَالَّذِي أَعْطَيْتُكَ هُوَ مِنْ ثَمَنِ السِّلْعَةِ. أَوْ مِنْ كِرَاءِ الدَّابَّةِ، وَإِنْ تَرَكْتُ ابْتِيَاعَ السِّلْعَةِ، أَوْ كِرَاءَ الدَّابَّةِ، فَمَا أَعْطَيْتُكَ لَكَ بَاطِلٌ بِغَيْرِ شَيْءٍ.\n\nقَالَ مَالِكٌ: وَالْأَمْرُ عِنْدَنَا، أَنَّهُ لاَ بَأْسَ بِأَنْ يَبْتَاعَ الْعَبْدَ التَّاجِرَ الْفَصِيحَ، بِالْأَعْبُدِ مِنَ الْحَبَشَةِ، أَوْ مِنْ جِنْسٍ مِنَ الْأَجْنَاسِ، لَيْسُوا مِثْلَهُ فِي الْفَصَاحَةِ، وَلاَ فِي التِّجَارَةِ، وَالنَّفَاذِ، وَالْمَعْرِفَةِ. لاَ بَأْسَ بِهذَا، أَنْ يَشْتَرِيَ مِنْهُ الْعَبْدَ بِالْعَبْدَيْنِ، أَوْ بِالْأَعْبُدِ إِلَى أَجَلٍ مَعْلُومٍ. إِذَا اخْتَلَفَ، فَبَانَ اخْتِلاَفُهُ .فَإِنْ أَشْبَهَ بَعْضُ ذلِكَ بَعْضاً، حَتَّى يَتَقَارَبَ، فَلاَ تَأْخُذَنْ مِنْهُ اثْنَيْنِ بِوَاحِدٍ، إِلَى أَجَلٍ. وَإِنِ اخْتَلَفَتْ أَجْنَاسُهُمْ.\n\nقَالَ مَالِكٌ: وَلاَ بَأْسَ بِأَنْ تَبِيعَ مَا اشْتَرَيْتَ مِنْ ذلِكَ، قَبْلَ أَنْ تَسْتَوْفِيَهُ. إِذَا انْتَقَدْتَ ثَمَنَهُ مِنْ غَيْرِ صَاحِبِهِ الَّذِي اشْتَرَيْتَهُ مِنْهُ.\n\nقَالَ مَالِكٌ: لاَ يَنْبَغِي أَنْ يُسْتَثْنَى جَنِينٌ فِي بَطْنِ أُمِّهِ، إِذَا بِيعَتْ. لِأَنَّ ذلِكَ غَرَرٌ. لاَ يُدْرَى أَذَكَرٌ هُوَ أَمْ (1) أُنْثَى أو حَسَنٌ (2) أَوْ قَبِيحٌ، أَوْ نَاقِصٌ، أَوْ تَامٌّ، أَوْ حَيٌّ أَوْ مَيِّتٌ؟. وَذلِكَ يَضَعُ مِنْ ثَمَنِهَا.\n\nقَالَ مَالِكٌ، فِي الرَّجُلِ يَبْتَاعُ الْعَبْدَ، أَوِ الْوَلِيدَةَ، بِمِائَةِ دِينَارٍ إِلَى أَجَلٍ. ثُمَّ يَنْدَمُ الْبَائِعُ. فَيَسْأَلُ الْمُبْتَاعَ أَنْ يُقِيلَهُ بِعَشَرَةِ دَنَانِيرَ، يَدْفَعُهَا إِلَيْهِ نَقْداً. أَوْ إِلَى أَجَلٍ. وَيَمْحُو عَنْهُ الْمِائَةَ دِينَارٍ الَّتِي لَهُ.\nقَالَ مَالِكٌ: لاَ بَأْسَ بِذلِكَ. وَإِنْ نَدِمَ الْمُبْتَاعُ، فَسَأَلَ الْبَائِعَ أَنْ يُقِيلَهُ فِي الْجَارِيَةِ، أَوِ الْعَبْدِ، وَيَزِيدَهُ عَشَرَةَ دَنَانِيرَ نَقْداً، أَوْ إِلَى أَجَلٍ أَبْعَدَ مِنَ الْأَجَلِ الَّذِي اشْتَرَى إِلَيْهِ الْعَبْدَ، أَوِ الْوَلِيدَةَ. فَإِنَّ ذلِكَ لاَ يَنْبَغِي.\nوَإِنَّمَا كَرِهَ ذلِكَ؛ لِأَنَّ الْبَائِعَ كَأَنَّهُ بَاعَ مِنْهُ مِائَةَ دِينَارٍ لَهُ، إِلَى سَنَةٍ قَبْلَ أَنْ تَحِلَّ، بِجَارِيَةٍ، وَبِعَشَرَةِ دَنَانِيرَ نَقْداً. أَوْ إِلَى أَجَلٍ أَبْعَدَ مِنَ السَّنَةِ. فَدَخَلَ فِي ذلِكَ بَيْعُ الذَّهَبِ بِالذَّهَبِ إِلَى أَجَلٍ.\n\nقَالَ مَالِكٌ، فِي الرَّجُلِ يَبِيعُ مِنَ الرَّجُلِ الْجَارِيَةَ بِمِائَةِ دِينَارٍ إِلَى أَجَلٍ، ثُمَّ يَشْتَرِيهَا بِأَكْثَرَ مِنْ ذلِكَ الثَّمَنِ الَّذِي بَاعَهَا بِهِ إِلَى أَبْعَدَ مِنْ ذلِكَ الْأَجَلِ، الَّذِي بَاعَهَا إِلَيْهِ: إِنَّ ذلِكَ لاَ يَصْلُحُ. وَتَفْسِيرُ مَا كَرِهَ مِنْ ذلِكَ، أَنْ يَبِيعَ الرَّجُلُ الْجَارِيَةَ إِلَى أَجَلٍ. ثُمَّ يَبْتَاعُهَا إِلَى أَجَلٍ أَبْعَدَ مِنْهُ. يَبِيعُهَا بِثَلاَثِينَ دِينَاراً إِلَى شَهْرٍ، ثُمَّ يَبْتَاعُهَا بِسِتِّينَ دِينَاراً، إِلَى سَنَةٍ، أَوْ إِلَى نِصْفِ  سَنَةٍ. فَصَارَ، إِنْ رَجَعَتْ إِلَيْهِ سِلْعَتُهُ بِعَيْنِهَا، وَأَعْطَاهُ صَاحِبُهُ ثَلاَثِينَ دِينَاراً، إِلَى شَهْرٍ؛ بِسِتِّينَ دِينَاراً، إِلَى سَنَةٍ، أَوْ إِلَى نِصْفِ سَنَةٍ. فَهذَا لاَ يَنْبَغِي.","english":{"narrator":"","text":"Yahya related to me from Malik from a reliable source from Amr\nibn Shuayb from his father from his father's father that the Messenger\nof Allah, may Allah bless him and grant him peace, forbade\ntransactions in which nonrefundable deposits were paid.\n\n\nMalik\nsaid, \"That is, in our opinion, but Allah knows best, that for\ninstance, a man buys a slave or slave-girl or rents an animal and then\nsays to the person from whom he bought the slave or leased the animal,\n'I will give you a dinar or a dirham or whatever on the condition that\nif I actually take the goods or ride what I have rented from you, then\nwhat I have given you already goes towards payment of the goods or\nhire of the animal. If I do not purchase the goods or hire the animal,\nthen what I have given you is yours without liability on your part.' \"\n\n\nMalik said, \"According to the way of doing things with us\nthere is nothing wrong in bartering an arabic speaking merchant slave\nfor abyssinian slaves or any other type that are not his equal in\neloquence, trading, shrewdness, and know-how. There is nothing wrong\nin bartering one slave like this for two or more other slaves with a\nstated delay in the terms if he is clearly different. If there is no\nappreciable difference between the slaves, two should not be bartered\nfor one with a stated delay in the terms even if their racial type is\ndifferent.\"\n\n\nMalik said, \"There is nothing wrong in selling\nwhat has been bought in such a transaction before taking possession of\nall of it as long as you receive the price for it from some one other\nthan the original owner.\"\n\n\nMalik said, \"An addition to the\nprice must not be made for a foetus in the womb of its mother when she\nis sold because that is gharar (an uncertain transaction). It is not\nknown whether the child will be male or female, good-looking or ugly,\nnormal or handicapped, alive or dead. All these things will affect the\nprice.\"\n\n\nMalik said that in a transaction where a slave or\nslave-girl was bought for one hundred dinars with a stated credit\nperiod that if the seller regretted the sale there was nothing wrong\nin him asking the buyer to revoke it for ten dinars which he would pay\nhim immediately or after a period and he would forgo his right to the\nhundred dinars which he was owed.\n\n\nMalik said, \"However, if\nthe buyer regrets and asks the seller to revoke the sale of a slave or\nslave-girl in consideration of which he will pay an extra ten dinars\nimmediately or on credit terms, extended beyond the original term,\nthat should not be done. It is disapproved of because it is as if, for\ninstance, the seller is buying the one hundred dinars which is not yet\ndue on a year's credit term before the year expires for a slave-girl\nand ten dinars to be paid immediately or on credit term longer than\nthe year. This falls into the category of selling gold for gold when\ndelayed terms enter into it.\"\n\n\nMalik said that it was not\nproper for a man to sell a slave-girl to another man for one hundred\ndinars on credit and then to buy her back for more than the original\nprice or on a credit term longer than the original term for which he\nsold her. To understand why that was disapproved of in that case, the\nexample of a man who sold a slave-girl on credit and then bought her\nback on a credit term longer than the original term was looked at. He\nmight have sold her for thirty dinars with a month to pay and then buy\nher back for sixty dinars with a year or half a year to pay. The\noutcome would only be that his goods would have returned to him just\nlike they were and the other party would have given him thirty dinars\non a month's credit against sixty dinars on a year or half a year's\ncredit. That was not to be done."}},{"id":2,"idInBook":2,"chapterId":31,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ مَنْ بَاعَ عَبْدًا وَلَهُ مَالٌ فَمَالُهُ لِلْبَائِعِ إِلاَّ أَنْ يَشْتَرِطَهُ الْمُبْتَاعُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat Umar ibn al-Khattab said, \"If a slave who has wealth is sold,\nthat wealth belongs to the seller unless the buyer stipulates its\ninclusion.\"\n\n\nMalik said, \"The generally agreed upon way of\ndoing things among us is that if the buyer stipulates the inclusion of\nthe slave's property whether it be cash, debts, or goods of known or\nunknown value, then they belong to the buyer, even if the slave\npossesses more than that for which he was purchased, whether he was\nbought for cash, as payment for a debt, or in exchange for goods. This\nis possible because a master is not asked to pay zakat on his slave's\nproperty. If a slave has a slave-girl, it is halal for him to have\nintercourse with her by his right of possession. If a slave is freed\nor put under contract (kitaba) to purchase his freedom, then his\nproperty goes with him. If he becomes bankrupt, his creditors take his\nproperty and his master is not liable for any of his debts.\""}},{"id":3,"idInBook":3,"chapterId":31,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، أَنَّ أَبَانَ بْنَ عُثْمَانَ، وَهِشَامَ بْنَ إِسْمَاعِيلَ، كَانَا يَذْكُرَانِ فِي خُطْبَتِهِمَا عُهْدَةَ الرَّقِيقِ فِي الأَيَّامِ الثَّلاَثَةِ مِنْ حِينِ يُشْتَرَى الْعَبْدُ أَوِ الْوَلِيدَةُ وَعُهْدَةَ السَّنَةِ ‏.‏ قَالَ مَالِكٌ مَا أَصَابَ الْعَبْدُ أَوِ الْوَلِيدَةُ فِي الأَيَّامِ الثَّلاَثَةِ مِنْ حِينِ يُشْتَرَيَانِ حَتَّى تَنْقَضِيَ الأَيَّامُ الثَّلاَثَةُ فَهُوَ مِنَ الْبَائِعِ وَإِنَّ عُهْدَةَ السَّنَةِ مِنَ الْجُنُونِ وَالْجُذَامِ وَالْبَرَصِ فَإِذَا مَضَتِ السَّنَةُ فَقَدْ بَرِئَ الْبَائِعُ مِنَ الْعُهْدَةِ كُلِّهَا ‏.‏ قَالَ مَالِكٌ وَمَنْ بَاعَ عَبْدًا أَوْ وَلِيدَةً مِنْ أَهْلِ الْمِيرَاثِ أَوْ غَيْرِهِمْ بِالْبَرَاءَةِ فَقَدْ بَرِئَ مِنْ كُلِّ عَيْبٍ وَلاَ عُهْدَةَ عَلَيْهِ إِلاَّ أَنْ يَكُونَ عَلِمَ عَيْبًا فَكَتَمَهُ فَإِنْ كَانَ عَلِمَ عَيْبًا فَكَتَمَهُ لَمْ تَنْفَعْهُ الْبَرَاءَةُ وَكَانَ ذَلِكَ الْبَيْعُ مَرْدُودًا وَلاَ عُهْدَةَ عِنْدَنَا إِلاَّ فِي الرَّقِيقِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abdullah ibn Abi Bakr ibn\nMuhammad ibn Amr ibn Hazm that Aban ibn Uthman and Hisham ibn Ismail\nused to mention in their khutbas built-in liability agreements in the\nsale of slaves, to cover both a three day period and a similar clause\ncovering a year. Malik explained, \"The defects a lave or slave-girl\nare found to have from the time they are bought until the end of the\nthree days are the responsibility of the seller. The year agreement is\nto cover insanity, leprosy, and loss of limbs due to disease. After a\nyear, the seller is free from any liability.\"\n\n\nMalik said,\"An\ninheritor or someone else who sells a slave or slave-girl without any\nsuch built-in guarantee is not responsible for any fault in the slave\nand there is no liability agreement held against him unless he was\naware of a fault and concealed it. If he was aware of a fault, the\nlack of guarantee does not protect him. The purchase is returned. In\nour view, built-in liability agreements only apply to the purchase of\nslaves.\""}},{"id":4,"idInBook":4,"chapterId":31,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، بَاعَ غُلاَمًا لَهُ بِثَمَانِمِائَةِ دِرْهَمٍ وَبَاعَهُ بِالْبَرَاءَةِ فَقَالَ الَّذِي ابْتَاعَهُ لِعَبْدِ اللَّهِ بْنِ عُمَرَ بِالْغُلاَمِ دَاءٌ لَمْ تُسَمِّهِ لِي ‏.‏ فَاخْتَصَمَا إِلَى عُثْمَانَ بْنِ عَفَّانَ ‏.‏ فَقَالَ الرَّجُلُ بَاعَنِي عَبْدًا وَبِهِ دَاءٌ لَمْ يُسَمِّهِ ‏.‏ وَقَالَ عَبْدُ اللَّهِ بِعْتُهُ بِالْبَرَاءَةِ ‏.‏ فَقَضَى عُثْمَانُ بْنُ عَفَّانَ عَلَى عَبْدِ اللَّهِ بْنِ عُمَرَ أَنْ يَحْلِفَ لَهُ لَقَدْ بَاعَهُ الْعَبْدَ وَمَا بِهِ دَاءٌ يَعْلَمُهُ فَأَبَى عَبْدُ اللَّهِ أَنْ يَحْلِفَ وَارْتَجَعَ الْعَبْدَ فَصَحَّ عِنْدَهُ فَبَاعَهُ عَبْدُ اللَّهِ بَعْدَ ذَلِكَ بِأَلْفٍ وَخَمْسِمِائَةِ دِرْهَمٍ ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا أَنَّ كُلَّ مَنِ ابْتَاعَ وَلِيدَةً فَحَمَلَتْ أَوْ عَبْدًا فَأَعْتَقَهُ وَكُلَّ أَمْرٍ دَخَلَهُ الْفَوْتُ حَتَّى لاَ يُسْتَطَاعَ رَدُّهُ فَقَامَتِ الْبَيِّنَةُ إِنَّهُ قَدْ كَانَ بِهِ عَيْبٌ عِنْدَ الَّذِي بَاعَهُ أَوْ عُلِمَ ذَلِكَ بِاعْتِرَافٍ مِنَ الْبَائِعِ أَوْ غَيْرِهِ فَإِنَّ الْعَبْدَ أَوِ الْوَلِيدَةَ يُقَوَّمُ وَبِهِ الْعَيْبُ الَّذِي كَانَ بِهِ يَوْمَ اشْتَرَاهُ فَيُرَدُّ مِنَ الثَّمَنِ قَدْرُ مَا بَيْنَ قِيمَتِهِ صَحِيحًا وَقِيمَتِهِ وَبِهِ ذَلِكَ الْعَيْبُ ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا فِي الرَّجُلِ يَشْتَرِي الْعَبْدَ ثُمَّ يَظْهَرُ مِنْهُ عَلَى عَيْبٍ يَرُدُّهُ مِنْهُ وَقَدْ حَدَثَ بِهِ عِنْدَ الْمُشْتَرِي عَيْبٌ آخَرُ إِنَّهُ إِذَا كَانَ الْعَيْبُ الَّذِي حَدَثَ بِهِ مُفْسِدًا مِثْلُ الْقَطْعِ أَوِ الْعَوَرِ أَوْ مَا أَشْبَهَ ذَلِكَ مِنَ الْعُيُوبِ الْمُفْسِدَةِ فَإِنَّ الَّذِي اشْتَرَى الْعَبْدَ بِخَيْرِ النَّظَرَيْنِ إِنْ أَحَبَّ أَنْ يُوضَعَ عَنْهُ مِنْ ثَمَنِ الْعَبْدِ بِقَدْرِ الْعَيْبِ الَّذِي كَانَ بِالْعَبْدِ يَوْمَ اشْتَرَاهُ وُضِعَ عَنْهُ وَإِنْ أَحَبَّ أَنْ يَغْرَمَ قَدْرَ مَا أَصَابَ الْعَبْدَ مِنَ الْعَيْبِ عِنْدَهُ ثُمَّ يَرُدُّ الْعَبْدَ فَذَلِكَ لَهُ وَإِنْ مَاتَ الْعَبْدُ عِنْدَ الَّذِي اشْتَرَاهُ أُقِيمَ الْعَبْدُ وَبِهِ الْعَيْبُ الَّذِي كَانَ بِهِ يَوْمَ اشْتَرَاهُ فَيُنْظَرُ كَمْ ثَمَنُهُ فَإِنْ كَانَتْ قِيمَةُ الْعَبْدِ يَوْمَ اشْتَرَاهُ بِغَيْرِ عَيْبٍ مِائَةَ دِينَارٍ وَقِيمَتُهُ يَوْمَ اشْتَرَاهُ وَبِهِ الْعَيْبُ ثَمَانُونَ دِينَارًا وُضِعَ عَنِ الْمُشْتَرِي مَا بَيْنَ الْقِيمَتَيْنِ وَإِنَّمَا تَكُونُ الْقِيمَةُ يَوْمَ اشْتُرِيَ الْعَبْدُ ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا أَنَّ مَنْ رَدَّ وَلِيدَةً مِنْ عَيْبٍ وَجَدَهُ بِهَا وَكَانَ قَدْ أَصَابَهَا أَنَّهَا إِنْ كَانَتْ بِكْرًا فَعَلَيْهِ مَا نَقَصَ مِنْ ثَمَنِهَا وَإِنْ كَانَتْ ثَيِّبًا فَلَيْسَ عَلَيْهِ فِي إِصَابَتِهِ إِيَّاهَا شَىْءٌ لأَنَّهُ كَانَ ضَامِنًا لَهَا ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا فِيمَنْ بَاعَ عَبْدًا أَوْ وَلِيدَةً أَوْ حَيَوَانًا بِالْبَرَاءَةِ مِنْ أَهْلِ الْمِيرَاثِ أَوْ غَيْرِهِمْ فَقَدْ بَرِئَ مِنْ كُلِّ عَيْبٍ فِيمَا بَاعَ إِلاَّ أَنْ يَكُونَ عَلِمَ فِي ذَلِكَ عَيْبًا فَكَتَمَهُ فَإِنْ كَانَ عَلِمَ عَيْبًا فَكَتَمَهُ لَمْ تَنْفَعْهُ تَبْرِئَتُهُ وَكَانَ مَا بَاعَ مَرْدُودًا عَلَيْهِ ‏.‏ قَالَ مَالِكٌ فِي الْجَارِيَةِ تُبَاعُ بِالْجَارِيَتَيْنِ ثُمَّ يُوجَدُ بِإِحْدَى الْجَارِيَتَيْنِ عَيْبٌ تُرَدُّ مِنْهُ قَالَ تُقَامُ الْجَارِيَةُ الَّتِي كَانَتْ قِيمَةَ الْجَارِيَتَيْنِ فَيُنْظَرُ كَمْ ثَمَنُهَا ثُمَّ تُقَامُ الْجَارِيَتَانِ بِغَيْرِ الْعَيْبِ الَّذِي وُجِدَ بِإِحْدَاهُمَا تُقَامَانِ صَحِيحَتَيْنِ سَالِمَتَيْنِ ثُمَّ يُقْسَمُ ثَمَنُ الْجَارِيَةِ الَّتِي بِيعَتْ بِالْجَارِيَتَيْنِ عَلَيْهِمَا بِقَدْرِ ثَمَنِهِمَا حَتَّى يَقَعَ عَلَى كُلِّ وَاحِدَةٍ مِنْهُمَا حِصَّتُهَا مِنْ ذَلِكَ عَلَى الْمُرْتَفِعَةِ بِقَدْرِ ارْتِفَاعِهَا وَعَلَى الأُخْرَى بِقَدْرِهَا ثُمَّ يُنْظَرُ إِلَى الَّتِي بِهَا الْعَيْبُ فَيُرَدُّ بِقَدْرِ الَّذِي وَقَعَ عَلَيْهَا مِنْ تِلْكَ الْحِصَّةِ إِنْ كَانَتْ كَثِيرَةً أَوْ قَلِيلَةً وَإِنَّمَا تَكُونُ قِيمَةُ الْجَارِيَتَيْنِ عَلَيْهِ يَوْمَ قَبْضِهِمَا ‏.‏ قَالَ مَالِكٌ فِي الرَّجُلِ يَشْتَرِي الْعَبْدَ فَيُؤَاجِرُهُ بِالإِجَارَةِ الْعَظِيمَةِ أَوِ الْغَلَّةِ الْقَلِيلَةِ ثُمَّ يَجِدُ بِهِ عَيْبًا يُرَدُّ مِنْهُ إِنَّهُ يَرُدُّهُ بِذَلِكَ الْعَيْبِ وَتَكُونُ لَهُ إِجَارَتُهُ وَغَلَّتُهُ وَهَذَا الأَمْرُ الَّذِي كَانَتْ عَلَيْهِ الْجَمَاعَةُ بِبَلَدِنَا وَذَلِكَ لَوْ أَنَّ رَجُلاً ابْتَاعَ عَبْدًا فَبَنَى لَهُ دَارًا قِيمَةُ بِنَائِهَا ثَمَنُ الْعَبْدِ أَضْعَافًا ثُمَّ وَجَدَ بِهِ عَيْبًا يُرَدُّ مِنْهُ رَدَّهُ وَلاَ يُحْسَبُ لِلْعَبْدِ عَلَيْهِ إِجَارَةٌ فِيمَا عَمِلَ لَهُ فَكَذَلِكَ تَكُونُ لَهُ إِجَارَتُهُ إِذَا آجَرَهُ مِنْ غَيْرِهِ لأَنَّهُ ضَامِنٌ لَهُ وَهَذَا الأَمْرُ عِنْدَنَا ‏.‏ قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا فِيمَنِ ابْتَاعَ رَقِيقًا فِي صَفْقَةٍ وَاحِدَةٍ فَوَجَدَ فِي ذَلِكَ الرَّقِيقِ عَبْدًا مَسْرُوقًا أَوْ وَجَدَ بِعَبْدٍ مِنْهُمْ عَيْبًا أَنَّهُ يُنْظَرُ فِيمَا وُجِدَ مَسْرُوقًا أَوْ وَجَدَ بِهِ عَيْبًا فَإِنْ كَانَ هُوَ وَجْهَ ذَلِكَ الرَّقِيقِ أَوْ أَكْثَرَهُ ثَمَنًا أَوْ مِنْ أَجْلِهِ اشْتَرَى وَهُوَ الَّذِي فِيهِ الْفَضْلُ فِيمَا يَرَى النَّاسُ كَانَ ذَلِكَ الْبَيْعُ مَرْدُودًا كُلُّهُ وَإِنْ كَانَ الَّذِي وُجِدَ مَسْرُوقًا أَوْ وُجِدَ بِهِ الْعَيْبُ مِنْ ذَلِكَ الرَّقِيقِ فِي الشَّىْءِ الْيَسِيرِ مِنْهُ لَيْسَ هُوَ وَجْهَ ذَلِكَ الرَّقِيقِ وَلاَ مِنْ أَجْلِهِ اشْتُرِيَ وَلاَ فِيهِ الْفَضْلُ فِيمَا يَرَى النَّاسُ رُدَّ ذَلِكَ الَّذِي وُجِدَ بِهِ الْعَيْبُ أَوْ وُجِدَ مَسْرُوقًا بِعَيْنِهِ بِقَدْرِ قِيمَتِهِ مِنَ الثَّمَنِ الَّذِي اشْتَرَى بِهِ أُولَئِكَ الرَّقِيقَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said from Salim ibn\nAbdullah that Abdullah ibn Umar sold one of his slaves for eight\nhundred dirhams with the stipulation that he was not responsible for\ndefects. The person who bought the slave complained to Abdullah ibn\nUmar that the slave had a disease which he had not told him about.\nThey argued and went to Uthman ibn Affan for a decision . The man\nsaid, \"He sold me a slave with a disease which he did not tell me\nabout.\" Abdullah said, \"I sold to him with the stipulation that I was\nnot responsible.\" Uthman ibn Affan decided that Abdullah ibn Umar\nshould take an oath that he had sold the slave without knowing that he\nhad any disease. Abdullah ibn Umar refused to take the oath, so the\nslave was returned to him and recovered his health in his possession.\nAbdullah sold him afterwards for 1500 dirhams.\n\n\nMalik said,\n\"The generally agreed upon way of doing things among us about a man\nwho buys a female slave and she becomes pregnant, or who buys a slave\nand then frees him, or if there is any other such matter which has\nalready happened so that he cannot return his purchase, and a clear\nproof is established that there was a fault in that purchase when it\nwas in the hands of the seller or the fault is admitted by the seller\nor someone else, is that the slave or slave-girl is assessed for its\nvalue with the fault it is found to have had on the day of purchase\nand the buyer is refunded,from what he paid,the difference between the\nprice of a slave who is sound and a slave with such a defect.\n\n\nMalik said, \"The generally agreed upon way of doing things among us\nregarding a man who buys a slave and then finds out that the slave has\na defect for which he can be returned and meanwhile another defect has\nhappened to the slave whilst in his possession, is that if the defect\nwhich occurred to the slave in his possession has harmed him, like\nloss of a limb, loss of an eye, or something similar, then he has a\nchoice. If he wants, he can have the price of the slave reduced\ncommensurate with the defect (he bought him with ) according to the\nprices on the day he bought him, or if he likes, he can pay\ncompensation for the defect which the slave has suffered in his\npossession and return him. The choice is up to him. If the slave dies\nin his possession, the slave is valued with the defect which he had on\nthe day of his purchase. It is seen what his price would really have\nbeen. If the price of the slave on the day of purchase without fault\nwas 100 dinars, and his price on the day of purchase with fault would\nhave been 80 dinars, the price is reduced by the difference. These\nprices are assessed according to the market value on the day the slave\nwas purchased . \"\n\n\nMalik said, \"The generally agreed upon way\nof doing things among us is that if a man returns a slave girl in whom\nhe has found a defect and he has already had intercourse with her, he\nmust pay what he has reduced of her price if she was a virgin. If she\nwas not a virgin, there is nothing against his having had intercourse\nwith her because he had charge of her.\"\n\n\nMalik said, \"The\ngenerally agreed upon way of doing things among us regarding a person,\nwhether he is an inheritor or not, who sells a slave, slave-girl, or\nanimal without a liability agreement is that he is not responsible for\nany defect in what he sold unless he knew about the fault and\nconcealed it. If he knew that there was a fault and concealed it, his\ndeclaration that he was free of responsibility does not absolve him,\nand what he sold is returned to him.\"\n\n\nMalik spoke about a\nsituation where a slave-girl was bartered for two other slave-girls\nand then one of the slave-girls was found to have a defect for which\nshe could be returned. He said, \"The slave-girl worth two other slave-\ngirls is valued for her price. Then the other two slave-girls are\nvalued, ignoring the defect which the one of them has. Then the price\nof the slave-girl sold for two slave-girls is divided between them\naccording to their prices so that the proportion of each of them in\nher price is arrived at - to the higher priced one according to her\nhigher price, and to the other according to her value. Then one looks\nat the one with the defect, and the buyer is refunded according to the\namount her share is affected by the defect, be it little or great. The\nprice of the two slave-girls is based on their market value on the day\nthat they were bought.\"\n\n\nMalik spoke about a man who bought a\nslave and hired him out on a long-term or short-term basis and then\nfound out that the slave had a defect which necessitated his return.\nHe said that if the man returned the slave because of the defect, he\nkept the hire and revenue. \"This is the way in which things are done\nin our city. That is because, had the man bought a slave who then\nbuilt a house for him, and the value of the house was many times the\nprice of the slave, and he then found that the slave had a defect for\nwhich he could be returned, and he  was returned, he would not have to\nmake payment for the work the slave had done for him. Similarly, he\nwould keep any revenue from hiring him out, because he had charge of\nhim. This is the way of doing things among us.\"\n\n\nMalik said,\n\"The way of doing things among us when someone buys several slaves in\none lot and then finds that one of them has been stolen, or has a\ndefect, is that he looks at the one he finds has been stolen or the\none in which he finds a defect. If he is the pick of those slaves, or\nthe most expensive, or it was for his sake that he bought them, or he\nis the one in whom people see the most excellence, then the whole sale\nis returned. If the one who is found to be stolen or to have a defect\nis not the pick of the slaves, and he did not buy them for his sake,\nand there is no special virtue which people see in him, the one who is\nfound to have a defect or to have been stolen is returned as he is,\nand the buyer is refunded his portion of the total price.\""}},{"id":5,"idInBook":5,"chapterId":31,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ عُبَيْدَ اللَّهِ بْنَ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، أَخْبَرَهُ أَنَّ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ ابْتَاعَ جَارِيَةً مِنِ امْرَأَتِهِ زَيْنَبَ الثَّقَفِيَّةِ وَاشْتَرَطَتْ عَلَيْهِ أَنَّكَ إِنْ بِعْتَهَا فَهِيَ لِي بِالثَّمَنِ الَّذِي تَبِيعُهَا بِهِ فَسَأَلَ عَبْدُ اللَّهِ بْنُ مَسْعُودٍ عَنْ ذَلِكَ عُمَرَ بْنَ الْخَطَّابِ فَقَالَ عُمَرُ بْنُ الْخَطَّابِ لاَ تَقْرَبْهَا وَفِيهَا شَرْطٌ لأَحَدٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab that Ubaydullah\nibn Abdullah ibn Utba ibn Masud told him that Abdullah ibn Masud\nbought a slave-girl from his wife, Zaynab Ath Thaqafiyya. She made a\ncondition to him, that if he bought her, she could always buy her back\nfor the price that he paid. Abdullah ibn Masud asked Umar ibn al-\nKhattab about that and Umar ibn al-Khattab said, \"Do not go near her\nwhile anyone has a condition concerning her over you.\""}},{"id":6,"idInBook":6,"chapterId":31,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ كَانَ يَقُولُ لاَ يَطَأُ الرَّجُلُ وَلِيدَةً إِلاَّ وَلِيدَةً إِنْ شَاءَ بَاعَهَا وَإِنْ شَاءَ وَهَبَهَا وَإِنْ شَاءَ أَمْسَكَهَا وَإِنْ شَاءَ صَنَعَ بِهَا مَا شَاءَ ‏.‏ قَالَ مَالِكٌ فِيمَنِ اشْتَرَى جَارِيَةً عَلَى شَرْطِ أَنْ لاَ يَبِيعَهَا أَوْ لاَ يَهَبَهَا أَوْ مَا أَشْبَهَ ذَلِكَ مِنَ الشُّرُوطِ فَإِنَّهُ لاَ يَنْبَغِي لِلْمُشْتَرِي أَنْ يَطَأَهَا وَذَلِكَ أَنَّهُ لاَ يَجُوزُ لَهُ أَنْ يَبِيعَهَا وَلاَ يَهَبَهَا فَإِذَا كَانَ لاَ يَمْلِكُ ذَلِكَ مِنْهَا فَلَمْ يَمْلِكْهَا مِلْكًا تَامًّا لأَنَّهُ قَدِ اسْتُثْنِيَ عَلَيْهِ فِيهَا مَا مَلَكَهُ بِيَدِ غَيْرِهِ فَإِذَا دَخَلَ هَذَا الشَّرْطُ لَمْ يَصْلُحْ وَكَانَ بَيْعًا مَكْرُوهًا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nwould say, \"A man should not have intercourse with a slave girl except\none whom, if he wished, he could sell, if he wished, he could give\naway, if he wished, he could keep, if he wished, he could do with her\nwhat he wanted .\"\n\n\nMalik said that a man who bought a slave-\ngirl on condition that he did not sell her, give her away, or do\nsomething of that nature, was not to have intercourse with her. That\nwas because he was not permitted to sell her or to give her away, so\nif he did not own that from her, he did not have complete ownership of\nher because an exception had been made concerning her by the hand of\nsomeone else. If that sort of condition entered into it, it was a\nmessy situation, and the sale was not recommended."}},{"id":7,"idInBook":7,"chapterId":31,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عَامِرٍ، أَهْدَى لِعُثْمَانَ بْنِ عَفَّانَ جَارِيَةً وَلَهَا زَوْجٌ ابْتَاعَهَا بِالْبَصْرَةِ فَقَالَ عُثْمَانُ لاَ أَقْرَبُهَا حَتَّى يُفَارِقَهَا زَوْجُهَا ‏.‏ فَأَرْضَى ابْنُ عَامِرٍ زَوْجَهَا فَفَارَقَهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab that Abdullah ibn\nAmir gave Uthman ibn Affan a slave-girl who had a husband whom he had\npurchased at Basra. Uthman said, \"I will not go near her until her\nhusband separates from her.\" Ibn Amir compensated the husband and he\nseparated from her."}},{"id":8,"idInBook":8,"chapterId":31,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ عَوْفٍ، ابْتَاعَ وَلِيدَةً فَوَجَدَهَا ذَاتَ زَوْجٍ فَرَدَّهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Abu Salama\nibn Abd ar-Rahman ibn Awf that Abd ar-Rahman ibn Awf bought a slave-\ngirl and found that she had a husband, so he returned her."}},{"id":9,"idInBook":9,"chapterId":31,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ بَاعَ نَخْلاً قَدْ أُبِّرَتْ فَثَمَرُهَا لِلْبَائِعِ إِلاَّ أَنْ يَشْتَرِطَ الْمُبْتَاعُ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat the Messenger of Allah, may Allah bless him and grant him peace,\nsaid, \"If palm trees are sold after they have been pollinated, the\nfruit belongs to the seller unless the buyer makes a stipulation about\nits inclusion.\""}},{"id":10,"idInBook":10,"chapterId":31,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ الثِّمَارِ حَتَّى يَبْدُوَ صَلاَحُهَا نَهَى الْبَائِعَ وَالْمُشْتَرِيَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi from Ibn Umar that the\nMessenger of Allah, may Allah bless him and grant him peace, forbade\nselling fruit until it had started to ripen. He forbade the\ntransaction to both buyer and seller."}},{"id":11,"idInBook":11,"chapterId":31,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ حُمَيْدٍ الطَّوِيلِ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ الثِّمَارِ حَتَّى تُزْهِيَ ‏.‏ فَقِيلَ لَهُ يَا رَسُولَ اللَّهِ وَمَا تُزْهِي فَقَالَ ‏\"‏ حِينَ تَحْمَرُّ ‏\"‏ ‏.‏ وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَرَأَيْتَ إِذَا مَنَعَ اللَّهُ الثَّمَرَةَ فَبِمَ يَأْخُذُ أَحَدُكُمْ مَالَ أَخِيهِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Humayd at-Tawil from Anas ibn\nMalik that the Messenger of Allah, may Allah bless him and grant him\npeace, forbade selling fruit until it had become mellow. He was asked,\n\"Messenger ofAllah! What do you mean by become mellow?\" He said, \"When\nit becomes rosy.\"\n\n\nThe Messenger of Allah, may Allah bless him\nand grant him peace, added, \"Allah may prevent the fruit from\nmaturing, so how can you take payment from your brother for it.\""}},{"id":12,"idInBook":12,"chapterId":31,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الرِّجَالِ، مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ حَارِثَةَ عَنْ أُمِّهِ، عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ الثِّمَارِ حَتَّى تَنْجُوَ مِنَ الْعَاهَةِ ‏.‏ قَالَ مَالِكٌ وَبَيْعُ الثِّمَارِ قَبْلَ أَنْ يَبْدُوَ صَلاَحُهَا مِنْ بَيْعِ الْغَرَرِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'r-Rijal Muhammad ibn Abd\nar-Rahman ibn Haritha from his mother, Amra bint Abd ar-Rahman that\nthe Messenger of Allah, may Allah bless him and grant him peace,\nforbade selling fruit until it was clear of blight. Malik said,\n\"Selling fruit before it has begun to ripen is an uncertain\ntransaction (gharar) .\""}},{"id":13,"idInBook":13,"chapterId":31,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنْ خَارِجَةَ بْنِ زَيْدِ بْنِ ثَابِتٍ، عَنْ زَيْدِ بْنِ ثَابِتٍ، أَنَّهُ كَانَ لاَ يَبِيعُ ثِمَارَهُ حَتَّى تَطْلُعَ الثُّرَيَّا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'z-Zinad from Kharija ibn\nZayd ibn Thabit that Zayd ibn Thabit did not sell fruit until the\nPleiades were visible, at the end of May.\n\n\nMalik said, \"The\nway of doing things among us about selling melons, cucumbers, water-\nmelons, and carrots is that it is halal to sell them when it is clear\nthat they have begun to ripen. Then the buyer has what grows until the\nseason is over. There is no specific timing laid down for that because\nthe time is well known with people, and it may happen that the crop\nwill be affected by blight and put a premature end to the season. If\nblight strikes and a third or more of the crop is damaged, an\nallowance for that is deducted from the price of purchase.\""}},{"id":14,"idInBook":14,"chapterId":31,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ زَيْدِ بْنِ ثَابِتٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَرْخَصَ لِصَاحِبِ الْعَرِيَّةِ أَنْ يَبِيعَهَا بِخَرْصِهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nfrom Zayd ibn Thabit that the Messenger of Allah, may Allah bless him\nand grant him peace, allowed the holder of an ariya to barter the\ndates on the palm for the amount of dried dates it was estimated that\nthe palms would produce."}},{"id":15,"idInBook":15,"chapterId":31,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ دَاوُدَ بْنِ الْحُصَيْنِ، عَنْ أَبِي سُفْيَانَ، مَوْلَى ابْنِ أَبِي أَحْمَدَ عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَرْخَصَ فِي بَيْعِ الْعَرَايَا بِخَرْصِهَا فِيمَا دُونَ خَمْسَةِ أَوْسُقٍ أَوْ فِي خَمْسَةِ أَوْسُقٍ ‏.‏ يَشُكُّ دَاوُدُ قَالَ خَمْسَةِ أَوْسُقٍ أَوْ دُونَ خَمْسَةِ أَوْسُقٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from\nDa'ud ibn al-Husayn from Abu Sufyan, the mawla of Ibn Abi Ahmad, from\nAbu Hurayra that the Messenger of Allah, may Allah bless him and grant\nhim peace, allowed the produce of an ariya to be bartered for an\nestimation of what the produce would be when the crop was less than\nfive awsuq or equal to five awsuq. Da'ud wasn't sure whether he said\nfive awsuq or less than five.\n\n\nMalik said, ''Ariyas can be\nsold for an estimation of what amount of dried dates will be produced.\nThe crop is examined and estimated while still on the palm. This is\nallowed because it comes into the category of delegation of\nresponsibility, handing over rights, and involving a partner. Had it\nbeen like a form of sale, no one would have made someone else a\npartner in the produce until it was ready nor would he have renounced\nhis right to any of it or put someone in charge of it until the buyer\nhad taken possession.\""}},{"id":16,"idInBook":16,"chapterId":31,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي الرِّجَالِ، مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أُمِّهِ، عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ أَنَّهُ سَمِعَهَا تَقُولُ، ابْتَاعَ رَجُلٌ ثَمَرَ حَائِطٍ فِي زَمَانِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَعَالَجَهُ وَقَامَ فِيهِ حَتَّى تَبَيَّنَ لَهُ النُّقْصَانُ فَسَأَلَ رَبَّ الْحَائِطِ أَنْ يَضَعَ لَهُ أَوْ أَنْ يُقِيلَهُ فَحَلَفَ أَنْ لاَ يَفْعَلَ فَذَهَبَتْ أُمُّ الْمُشْتَرِي إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرَتْ ذَلِكَ لَهُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ تَأَلَّى أَنْ لاَ يَفْعَلَ خَيْرًا ‏\"‏ ‏.‏ فَسَمِعَ بِذَلِكَ رَبُّ الْحَائِطِ فَأَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ هُوَ لَهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Abu'r-Rijal Muhammad ibn Abd\nar-Rahman heard his mother, Amra bint Abd ar-Rahman say, \"A man bought\nthe fruit of an enclosed orchard in the time of the Messenger of\nAllah, may Allah bless him and grant him peace, and he tended it while\nstaying on the land. It became clear to him that there was going to be\nsome loss. He asked the owner of the orchard to reduce the price for\nhim or to revoke the sale, but the owner made an oath not to do so.\nThe mother of the buyer went to the Messenger of Allah, may Allah\nbless him and grant him peace, and told him about it. The Messengerof\nAllah, may Allah bless him and grant him peace, said, 'By this oath,\nhe has sworn not to do good.' The owner of the orchard heard about it\nand went to the Messenger of Allah, may Allah bless him and grant him\npeace, and said, 'Messenger of Allah, the choice is his.' \""}},{"id":17,"idInBook":17,"chapterId":31,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ، قَضَى بِوَضْعِ الْجَائِحَةِ ‏.‏ قَالَ مَالِكٌ وَعَلَى ذَلِكَ الأَمْرُ عِنْدَنَا ‏.‏ قَالَ مَالِكٌ وَالْجَائِحَةُ الَّتِي تُوضَعُ عَنِ الْمُشْتَرِي الثُّلُثُ فَصَاعِدًا وَلاَ يَكُونُ مَا دُونَ ذَلِكَ جَائِحَةً ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Umar ibn\nAbd al-Aziz decided in a case to make a reduction for crop damage.\n\n\nMalik said, \"That is what we do in the situation.\"\n\n\nMalik added, \"Crop damage is whatever causes loss of a third or more\nfor the purchaser. Anything less is not counted as crop damage.\""}},{"id":18,"idInBook":18,"chapterId":31,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، أَنَّ الْقَاسِمَ بْنَ مُحَمَّدٍ، كَانَ يَبِيعُ ثَمَرَ حَائِطِهِ وَيَسْتَثْنِي مِنْهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Rabia ibn Abd ar-Rahman that\nal-Qasim ibn Muhammad would sell produce from his orchard and keep\nsome of it aside."}},{"id":19,"idInBook":19,"chapterId":31,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، أَنَّ جَدَّهُ، مُحَمَّدَ بْنَ عَمْرِو بْنِ حَزْمٍ بَاعَ ثَمَرَ حَائِطٍ لَهُ يُقَالُ لَهُ الأَفْرَاقُ بِأَرْبَعَةِ آلاَفِ دِرْهَمٍ وَاسْتَثْنَى مِنْهُ بِثَمَانِمِائَةِ دِرْهَمٍ تَمْرًا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abdullah ibn Abi Bakr that\nhis grandfather, Muhammad ibn Amr ibn Hazm sold the fruit of an\norchard of his called al-Afraq, for 4,000 dirhams, and he kept aside\n800 dirhams' worth of dry dates."}},{"id":20,"idInBook":20,"chapterId":31,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الرِّجَالِ، مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ حَارِثَةَ أَنَّ أُمَّهُ، عَمْرَةَ بِنْتَ عَبْدِ الرَّحْمَنِ كَانَتْ تَبِيعُ ثِمَارَهَا وَتَسْتَثْنِي مِنْهَا ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا أَنَّ الرَّجُلَ إِذَا بَاعَ ثَمَرَ حَائِطِهِ أَنَّ لَهُ أَنْ يَسْتَثْنِيَ مِنْ ثَمَرِ حَائِطِهِ مَا بَيْنَهُ وَبَيْنَ ثُلُثِ الثَّمَرِ لاَ يُجَاوِزُ ذَلِكَ وَمَا كَانَ دُونَ الثُّلُثِ فَلاَ بَأْسَ بِذَلِكَ ‏.‏ قَالَ مَالِكٌ فَأَمَّا الرَّجُلُ يَبِيعُ ثَمَرَ حَائِطِهِ وَيَسْتَثْنِي مِنْ ثَمَرِ حَائِطِهِ ثَمَرَ نَخْلَةٍ أَوْ نَخَلاَتٍ يَخْتَارُهَا وَيُسَمِّي عَدَدَهَا فَلاَ أَرَى بِذَلِكَ بَأْسًا لأَنَّ رَبَّ الْحَائِطِ إِنَّمَا اسْتَثْنَى شَيْئًا مِنْ ثَمَرِ حَائِطِ نَفْسِهِ وَإِنَّمَا ذَلِكَ شَىْءٌ احْتَبَسَهُ مِنْ حَائِطِهِ وَأَمْسَكَهُ لَمْ يَبِعْهُ وَبَاعَ مِنْ حَائِطِهِ مَا سِوَى ذَلِكَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'r-Rijal, Muhammad ibn\nAbdar-Rahman ibn Haritha that his mother, Amra bint Abd ar-Rahman used\nto sell her fruit and keep some of it aside.\n\n\nMalik said, \"The\ngenerally agreed upon way of doing things among us is that when a man\nsells the fruit of his orchard, he can keep aside up to a third of the\nfruit, but that is not to be exceeded. There is no harm in what is\nless than a third.\"\n\n\nMalik added that he thought there was no\nharm for a man to sell the fruit of his orchard and keep aside only\nthe fruit of a certain palm-tree or palm-trees which he had chosen and\nwhose number he had specified, because the owner was only keeping\naside certain fruit of his own orchard and everything else he sold."}},{"id":21,"idInBook":21,"chapterId":31,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، أَنَّهُ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ التَّمْرُ بِالتَّمْرِ مِثْلاً بِمِثْلٍ ‏\"‏ ‏.‏ فَقِيلَ لَهُ إِنَّ عَامِلَكَ عَلَى خَيْبَرَ يَأْخُذُ الصَّاعَ بِالصَّاعَيْنِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ ادْعُوهُ لِي ‏\"‏ ‏.‏ فَدُعِيَ لَهُ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَتَأْخُذُ الصَّاعَ بِالصَّاعَيْنِ ‏\"‏ ‏.‏ فَقَالَ يَا رَسُولَ اللَّهِ لاَ يَبِيعُونَنِي الْجَنِيبَ بِالْجَمْعِ صَاعًا بِصَاعٍ ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ بِعِ الْجَمْعَ بِالدَّرَاهِمِ ثُمَّ ابْتَعْ بِالدَّرَاهِمِ جَنِيبًا ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Zayd ibn Aslam that Ata ibn\nYasar said, \"The Messenger of Allah, may Allah bless him and grant him\npeace, said, 'Dried dates for dried dates is like for like.' It was\nsaid to him, 'Your agent in Khaybar takes one sa for two.' The\nMessenger of Allah, may Allah bless him and grant him peace, said,\n'all him to me.' So he was called for. The Messenger of Allah, may\nAllah bless him and grant him peace, asked, 'Do you take one sa for\ntwo?' He replied, 'Messengerof Allah! Why should they sell me good\ndates for assorted low quality dates, sa for sa!' The Messenger of\nAllah, may Allah bless him and grant him peace, said, 'Sell the\nassorted ones for dirhams, and then buy the good ones with those\ndirhams.' \""}},{"id":22,"idInBook":22,"chapterId":31,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ الْحَمِيدِ بْنِ سُهَيْلِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، وَعَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم اسْتَعْمَلَ رَجُلاً عَلَى خَيْبَرَ فَجَاءَهُ بِتَمْرٍ جَنِيبٍ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَكُلُّ تَمْرِ خَيْبَرَ هَكَذَا ‏\"‏ ‏.‏ فَقَالَ لاَ وَاللَّهِ يَا رَسُولَ اللَّهِ إِنَّا لَنَأْخُذُ الصَّاعَ مِنْ هَذَا بِالصَّاعَيْنِ وَالصَّاعَيْنِ بِالثَّلاَثَةِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ تَفْعَلْ بِعِ الْجَمْعَ بِالدَّرَاهِمِ ثُمَّ ابْتَعْ بِالدَّرَاهِمِ جَنِيبًا ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abd al-Hamid ibn Suhayl ibn\nAbd ar-Rahman ibn Awf from Said ibn al-Musayyab from Abu Said al-\nKhudri and from Abu Hurayra that the Messenger of Allah, may Allah\nbless him and grant him peace, appointed a man as an agent in Khaybar,\nand he brought him some excellent dates. The Messenger of Allah, may\nAllah bless him and grant him peace, said to him, \"Are all the dates\nof Khaybar like this?\" He said,\"No. By Allah, Messenger of Allah! We\ntake a sa of this kind for two sa or two sa for three.\" The Messenger\nof Allah, may Allah bless him and grant him peace, said, \"Do not do\nthat. Sell the assorted ones for dirhams and then buy the good ones\nwith the dirhams.\""}},{"id":23,"idInBook":23,"chapterId":31,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ، أَنَّ زَيْدًا أَبَا عَيَّاشٍ، أَخْبَرَهُ أَنَّهُ، سَأَلَ سَعْدَ بْنَ أَبِي وَقَّاصٍ عَنِ الْبَيْضَاءِ، بِالسُّلْتِ فَقَالَ لَهُ سَعْدٌ أَيَّتُهُمَا أَفْضَلُ قَالَ الْبَيْضَاءُ ‏.‏ فَنَهَاهُ عَنْ ذَلِكَ ‏.‏ وَقَالَ سَعْدٌ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يُسْأَلُ عَنِ اشْتِرَاءِ التَّمْرِ بِالرُّطَبِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَيَنْقُصُ الرُّطَبُ إِذَا يَبِسَ ‏\"‏ ‏.‏ فَقَالُوا نَعَمْ ‏.‏ فَنَهَى عَنْ ذَلِكَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abdullah ibn Yazid that Zayd\nibn Ayyash told him that he had once asked Sad ibn Abi Waqqas about\nselling white wheat for a type of good barley. Sad asked him which was\nthe better and when he told him the white wheat, he forbade the\ntransaction. Sad said, \"I heard the Messenger of Allah, may Allah\nbless him and grant him peace, being asked about selling dried dates\nfor fresh dates, and the Messenger of Allah, may Allah bless him and\ngrant him peace, said, 'Do the dates diminish in size when they become\ndry?' When he was told that they did, he forbade that.\""}},{"id":24,"idInBook":24,"chapterId":31,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الْمُزَابَنَةِ وَالْمُزَابَنَةُ بَيْعُ الثَّمَرِ بِالتَّمْرِ كَيْلاً وَبَيْعُ الْكَرْمِ بِالزَّبِيبِ كَيْلاً ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat the Messenger of Allah, may Allah bless him and grant him peace,\nforbade muzabana. Muzabana was selling fresh dates for dried dates by\nmeasure, and selling grapes for raisins by measure."}},{"id":25,"idInBook":25,"chapterId":31,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ دَاوُدَ بْنِ الْحُصَيْنِ، عَنْ أَبِي سُفْيَانَ، مَوْلَى ابْنِ أَبِي أَحْمَدَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الْمُزَابَنَةِ وَالْمُحَاقَلَةِ وَالْمُزَابَنَةُ اشْتِرَاءُ الثَّمَرِ بِالتَّمْرِ فِي رُءُوسِ النَّخْلِ وَالْمُحَاقَلَةُ كِرَاءُ الأَرْضِ بِالْحِنْطَةِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Da'ud ibn al-Husayn from Abu\nSufyan, the mawla of Ibn Abi Ahmad, from Abu Said al-Khudri that the\nMessenger of Allah, may Allah bless him and grant him peace, forbade\nmuzabana and muhaqala. Muzabana was selling fresh dates for dried\ndates while they were still on the trees. Muhaqala was renting land in\nexchange for wheat."}},{"id":26,"idInBook":26,"chapterId":31,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الْمُزَابَنَةِ وَالْمُحَاقَلَةِ وَالْمُزَابَنَةُ اشْتِرَاءُ الثَّمَرِ بِالتَّمْرِ وَالْمُحَاقَلَةُ اشْتِرَاءُ الزَّرْعِ بِالْحِنْطَةِ وَاسْتِكْرَاءُ الأَرْضِ بِالْحِنْطَةِ ‏.‏ قَالَ ابْنُ شِهَابٍ فَسَأَلْتُ سَعِيدَ بْنَ الْمُسَيَّبِ عَنِ اسْتِكْرَاءِ الأَرْضِ بِالذَّهَبِ وَالْوَرِقِ فَقَالَ لاَ بَأْسَ بِذَلِكَ ‏.‏ قَالَ مَالِكٌ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْمُزَابَنَةِ وَتَفْسِيرُ الْمُزَابَنَةِ أَنَّ كُلَّ شَىْءٍ مِنَ الْجِزَافِ الَّذِي لاَ يُعْلَمُ كَيْلُهُ وَلاَ وَزْنُهُ وَلاَ عَدَدُهُ ابْتِيعَ بِشَىْءٍ مُسَمًّى مِنَ الْكَيْلِ أَوِ الْوَزْنِ أَوِ الْعَدَدِ وَذَلِكَ أَنْ يَقُولَ الرَّجُلُ لِلرَّجُلِ يَكُونُ لَهُ الطَّعَامُ الْمُصَبَّرُ الَّذِي لاَ يُعْلَمُ كَيْلُهُ مِنَ الْحِنْطَةِ أَوِ التَّمْرِ أَوْ مَا أَشْبَهَ ذَلِكَ مِنَ الأَطْعِمَةِ أَوْ يَكُونُ لِلرَّجُلِ السِّلْعَةُ مِنَ الْحِنْطَةِ أَوِ النَّوَى أَوِ الْقَضْبِ أَوِ الْعُصْفُرِ أَوِ الْكُرْسُفِ أَوِ الْكَتَّانِ أَوِ الْقَزِّ أَوْ مَا أَشْبَهَ ذَلِكَ مِنَ السِّلَعِ لاَ يُعْلَمُ كَيْلُ شَىْءٍ مِنْ ذَلِكَ وَلاَ وَزْنُهُ وَلاَ عَدَدُهُ فَيَقُولُ الرَّجُلُ لِرَبِّ تِلْكَ السِّلْعَةِ كِلْ سِلْعَتَكَ هَذِهِ أَوْ مُرْ مَنْ يَكِيلُهَا أَوْ زِنْ مِنْ ذَلِكَ مَا يُوزَنُ أَوْ عُدَّ مِنْ ذَلِكَ مَا كَانَ يُعَدُّ فَمَا نَقَصَ عَنْ كَيْلِ كَذَا وَكَذَا صَاعًا - لِتَسْمِيَةٍ يُسَمِّيهَا - أَوْ وَزْنِ كَذَا وَكَذَا رِطْلاً أَوْ عَدَدِ كَذَا وَكَذَا فَمَا نَقَصَ مِنْ ذَلِكَ فَعَلَىَّ غُرْمُهُ لَكَ حَتَّى أُوفِيَكَ تِلْكَ التَّسْمِيَةَ فَمَا زَادَ عَلَى تِلْكَ التَّسْمِيَةِ فَهُوَ لِي أَضْمَنُ مَا نَقَصَ مِنْ ذَلِكَ عَلَى أَنْ يَكُونَ لِي مَا زَادَ ‏.‏ فَلَيْسَ ذَلِكَ بَيْعًا وَلَكِنَّهُ الْمُخَاطَرَةُ وَالْغَرَرُ وَالْقِمَارُ يَدْخُلُ هَذَا لأَنَّهُ لَمْ يَشْتَرِ مِنْهُ شَيْئًا بِشَىْءٍ أَخْرَجَهُ وَلَكِنَّهُ ضَمِنَ لَهُ مَا سُمِّيَ مِنْ ذَلِكَ الْكَيْلِ أَوِ الْوَزْنِ أَوِ الْعَدَدِ عَلَى أَنْ يَكُونَ لَهُ مَا زَادَ عَلَى ذَلِكَ فَإِنْ نَقَصَتْ تِلْكَ السِّلْعَةُ عَنْ تِلْكَ التَّسْمِيَةِ أَخَذَ مِنْ مَالِ صَاحِبِهِ مَا نَقَصَ بِغَيْرِ ثَمَنٍ وَلاَ هِبَةٍ طَيِّبَةٍ بِهَا نَفْسُهُ فَهَذَا يُشْبِهُ الْقِمَارَ وَمَا كَانَ مِثْلَ هَذَا مِنَ الأَشْيَاءِ فَذَلِكَ يَدْخُلُهُ ‏.‏ قَالَ مَالِكٌ وَمِنْ ذَلِكَ أَيْضًا أَنْ يَقُولَ الرَّجُلُ لِلرَّجُلِ لَهُ الثَّوْبُ أَضْمَنُ لَكَ مِنْ ثَوْبِكَ هَذَا كَذَا وَكَذَا ظِهَارَةَ قَلَنْسُوَةٍ قَدْرُ كُلِّ ظِهَارَةٍ كَذَا وَكَذَا - لِشَىْءٍ يُسَمِّيهِ - فَمَا نَقَصَ مِنْ ذَلِكَ فَعَلَىَّ غُرْمُهُ حَتَّى أُوفِيَكَ وَمَا زَادَ فَلِي ‏.‏ أَوْ أَنْ يَقُولَ الرَّجُلُ لِلرَّجُلِ أَضْمَنُ لَكَ مِنْ ثِيَابِكَ هَذِي كَذَا وَكَذَا قَمِيصًا ذَرْعُ كُلِّ قَمِيصٍ كَذَا وَكَذَا فَمَا نَقَصَ مِنْ ذَلِكَ فَعَلَىَّ غُرْمُهُ وَمَا زَادَ عَلَى ذَلِكَ فَلِي ‏.‏ أَوْ أَنْ يَقُولُ الرَّجُلُ لِلرَّجُلِ لَهُ الْجُلُودُ مِنْ جُلُودِ الْبَقَرِ أَوِ الإِبِلِ أُقَطِّعُ جُلُودَكَ هَذِهِ نِعَالاً عَلَى إِمَامٍ يُرِيهِ إِيَّاهُ ‏.‏ فَمَا نَقَصَ مِنْ مِائَةِ زَوْجٍ فَعَلَىَّ غُرْمُهُ وَمَا زَادَ فَهُوَ لِي بِمَا ضَمِنْتُ لَكَ ‏.‏ وَمِمَّا يُشْبِهُ ذَلِكَ أَنْ يَقُولَ الرَّجُلُ لِلرَّجُلِ عِنْدَهُ حَبُّ الْبَانِ اعْصُرْ حَبَّكَ هَذَا فَمَا نَقَصَ مِنْ كَذَا وَكَذَا رِطْلاً فَعَلَىَّ أَنْ أُعْطِيَكَهُ وَمَا زَادَ فَهُوَ لِي ‏.‏ فَهَذَا كُلُّهُ وَمَا أَشْبَهَهُ مِنَ الأَشْيَاءِ أَوْ ضَارَعَهُ مِنَ الْمُزَابَنَةِ الَّتِي لاَ تَصْلُحُ وَلاَ تَجُوزُ ‏.‏ وَكَذَلِكَ - أَيْضًا - إِذَا قَالَ الرَّجُلُ لِلرَّجُلِ لَهُ الْخَبَطُ أَوِ النَّوَى أَوِ الْكُرْسُفُ أَوِ الْكَتَّانُ أَوِ الْقَضْبُ أَوِ الْعُصْفُرُ أَبْتَاعُ مِنْكَ هَذَا الْخَبَطَ بِكَذَا وَكَذَا صَاعًا مِنْ خَبَطٍ يُخْبَطُ مِثْلَ خَبَطِهِ أَوْ هَذَا النَّوَى بِكَذَا وَكَذَا صَاعًا مِنْ نَوًى مِثْلِهِ وَفِي الْعُصْفُرِ وَالْكُرْسُفِ وَالْكَتَّانِ وَالْقَضْبِ مِثْلَ ذَلِكَ ‏.‏ فَهَذَا كُلُّهُ يَرْجِعُ إِلَى مَا وَصَفْنَا مِنَ الْمُزَابَنَةِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Said ibn al-\nMusayyab that the Messenger of Allah, may Allah bless him and grant\nhim peace, forbade muzabana and muhaqala. Muzabana was selling fresh\ndates for dried dates. Muhaqala was buying unharvested wheat in\nexchange for threshed wheat and renting land in exchange for wheat.\n\n\nIbn Shihab added that he had asked Said ibn al-Musayyab about\nrenting land for gold and silver. He said, \"There is no harm in it.\"\n\n\nMalik said, \"The Messenger of Allah, may Allah bless him and\ngrant him peace, forbade muzabana. The explanation of muzabana is that\nit is buying something whose number, weight and measure is not known\nwith something whose number, weight or measure is known, for instance,\nif a man has a stack of food whose measure is not known, either of\nwheat, dates, or whatever food, or the man has goods of wheat, date\nkernels, herbs, safflower, cotton, flax, silk, and does not know its\nmeasure or weight or number and then a buyer approaches him and\nproposes that he weigh or measure or count the goods, but, before he\ndoes, he specifies a certain weight, or measure, or number and\nguarantees to pay the price for that amount, agreeing that whatever\nfalls short of that amount is a loss against him and whatever is in\nexcess of that amount is a gain for him. That is not a sale. It is\ntaking risks and it is an uncertain transaction. It falls into the\ncategory of gambling because he is not buying something from him for\nsomething definite which he pays. Everything which resembles this is\nalso forbidden.\"\n\n\nMalik said that another example of that was,\nfor instance, a man proposing to another man, \"You have cloth. I will\nguarantee you from this cloth of yours so many hooded cloaks, the\nmeasureof each cloak to be such-and-such, (naming a measurement).\nWhatever loss there is, is against me and I will fulfill you the\nspecified amount and whatever excess there is, is mine.\" Or perhaps\nthe man proposed, \"I will guarantee you from this cloth of yours so\nmany shirts, the measurement of each shirt to be such-and-such, and\nwhatever loss there is, is against me and I will fulfill the specified\namount and whatever excess there is, is mine.\" Or perhaps a man\nproposed to a man who had cattle or camel hides, \"I will cut up these\nhides of yours into sandals on a pattern I will show you. Whatever\nfalls short of a hundred pairs, I will make up its loss and whatever\nis over is mine because I guaranteed you.\" Another example was that a\nman say to a man who had ben-nuts, \"I will press these nuts of yours.\nWhatever falls short of such-and-such a weight by the pound, I will\nmake it up, and whatever is more than that is mine.\"\n\n\nMalik\nsaid that all this and whatever else was like it or resembled it was\nin the category of muzabana, which was neither good nor permitted. It\nwas also the same case for a man to say to a man, who had fodder\nleaves, date kernels, cotton, flax, herbs or safflower, \"I will buy\nthese leaves from you in exchange for such-and-such a sa, (indicating\nleaves which are pounded like his leaves) . . or these date kernels\nfor such-and-such a sa of kernels like them, and the like of that in\nthe case of safflower, cotton, flax and herbs.\"\n\n\nMalik said,\n\"All this is what we have described of muzabana.\""}},{"id":27,"idInBook":27,"chapterId":31,"bookId":7,"arabic":"","english":{"narrator":"","text":"Malik said, \"There is no harm in buying dates from specified\ntrees or a specified orchard or buying milk from specified sheep when\nthe buyer starts to take them as soon as he has payed the price. That\nis like buying oil from a container. A man buys some of it for a dinar\nor two and gives his gold and stipulates that it be measured out for\nhim. There is no harm in that. If the container breaks and the oil is\nwasted, the buyer has his gold back and there is no transaction\nbetween them.\"\n\n\nMalik said, \"There is no harm in everything\nwhich is taken right away as it is, like fresh milk and fresh picked\ndates which the buyer can take on a day-to-day basis. If the supply\nruns out before the buyer has what he has paid for in full, the seller\ngives him back the portion of the gold that is owed to him, or else\nthe buyer takes other goods from him to the value of what he is owed\nand which they mutually agree about. The buyer should stay with the\nseller until he has taken it. It is disapproved of for the seller to\nleave because the transaction would then come into the forbidden\ncategory of a debt for a debt. If a stated time period for payment or\ndelivery enters into the transaction, it is also disapproved. Delay\nand deferment are not permitted in it, and are only acceptable when it\nis standard practice on definite terms by which the seller guarantees\nit to the buyer, but this is not to be from one specific orchard or\nfrom any specific ewes.\"\n\n\nMalik was asked about a man who\nbought an orchard from another man in which there were various types\nof palm-trees - excellent ajwa palms, good kabis palms, adhq palms and\nothertypes. The seller kept aside from the sale the produce of a\ncertain palm of his choice. Malik said, \"That is not good because if\nhe does that, and keeps aside, for instance, dates of the ajwa variety\nwhose yield would be 15 sa, and he picks the dates of the kabis in\ntheir place, and the yield of their dates is 10 sa or he picks the\najwa which yield 15 sa and leaves the kabis which yield 10 sa, it is\nas if he bought the ajwa for the kabis making allowances for their\ndifference of quality. This is the same as if a man dealing with a man\nwho has heaps of dates before him - a heap of 15 sa of ajwa, a heap of\n10 sa of kabis, and a heap of 12 sa of cadhq, gives the owner of the\ndates a dinar to let him choose and take whichever of the heaps he\nlikes.\" Malik said, \"That is not good.\"\n\n\nMalik was asked what\na man who bought fresh dates from the owner of an orchard and advanced\nhim a dinar was entitled to if the crop was spoilt. Malik said, \"The\nbuyer makes a reckoning with the owner of the orchard and takes what\nis due to him of the dinar. If the buyer has taken two-thirds of a\ndinar's worth of dates, he gets back the third of a dinar which is\nowed him. If the buyer has taken three-quarters of a dinar's worth of\ndates, then he gets back the quarter which is owed to him, or they\ncome to a mutual agreement, and the buyer takes what is owed him from\nhis dinar from the owner of the orchard in something else of his\nchoosing. If, for instance, he prefers to take dry dates or some other\ngoods, he takes them according to what is due. If he takes dry dates\nor some other goods, he should stay with him until he has been paid in\nfull.\"\n\n\nMalik said, \"This is the same situation as hiring out\na specified riding-camel or hiring out a slave tailor, carpenter or\nsome other kind of worker or letting a house and taking payment in\nadvance for the hire of the slave or the rent of the house or camel.\nThen an accident happens to what has been hired resulting in death or\nsomething else. The owner of the camel, slave or house returns what\nremains of the rent of the camel, the hire of the slave or the rent of\nthe house to the one who advanced him the money, and the owner reckons\nwhat will settle that up in full. If, for instance, he has provided\nhalf of what the man paid for, he returns the remaining half of what\nhe advanced, or according to whatever amount is due.\" Malik said,\n\"Paying in advance for something which is on hand is only good when\nthe buyer takes possession of what he has paid for as soon as he hands\nover the gold, whether it be slave, camel, or house, or in the case of\ndates, he starts to pick them as soon as he has paid the money.\"\n\n\nIt is not good that there be any deferment or credit in such a\ntransaction.\n\n\nMalik said, \"An example illustrating what is\ndisapproved of in this situation is that, for instance, a man may say\nthat he will pay someone in advance for the use of his camel to ride\nin the hajj, and the hajj is still some time off, or he may say\nsomething similar to that about a slave or a house. When he does that,\nhe only pays the money in advance on the understanding that if he\nfinds the camel to be sound at the time the hire is due to begin, he\nwill take it by virtue of what he has already paid. If an accident, or\ndeath, or something happens to the camel, then he will get his money\nback and the money he paid in advance will be considered as a loan.\"\n\n\nMalik said, \"This is distinct from someone who takes\nimmediate possession of what he rents or hires, so that it does not\nfall into the category of 'uncertainty,' or disapproved payment in\nadvance. That is following a common practice. An example of that is\nthat a man buys a slave, or slave-girl, and takes possession of them\nand pays their price. If something happens to them within the period\nof the year indemnification contract, he takes his gold back from the\none from whom he bought it. There is no harm in that. This is the\nprecedent of the sunna in the matter of selling slaves.\"\n\n\nMalik said, \"Someone who rents a specified slave, or hires a specified\ncamel, for a future date, at which time he will take possession of the\ncamel or slave, has not acted properly because he did not take\npossession of what he rented or hired, nor is he advancing a loan\nwhich the person is responsible to pay back.\""}},{"id":28,"idInBook":28,"chapterId":31,"bookId":7,"arabic":"","english":{"narrator":"","text":"Malik said, \"The generally agreed on way of doing things among us\nis that some one who buys some fruit, fresh or dry, should not resell\nit until he gets full possession of it. He should not barter things of\nthe same type, except hand to hand. Whatever can be made into dry\nfruit to be stored and eaten, should not be bartered for its own kind,\nexcept hand to hand, like for like, when it is the same kind of fruit.\nIn the case of two different kinds of fruit, there is no harm in\nbartering two of one kind for one of another, hand to hand on the\nspot. It is not good to set delayed terms. As for produce which is not\ndried and stored but is eaten fresh like water melon, cucumber, melon,\ncarrots, citron, medlars, pomegranates, and soon, which when dried no\nlonger counts as fruit, and is not a thing which is stored up as is\nfruit, I think that it is quite proper to barter such things two for\none of the same variety hand to hand. If no term enters into it, there\nis no harm in it.\""}},{"id":29,"idInBook":29,"chapterId":31,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ قَالَ أَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم السَّعْدَيْنِ أَنْ يَبِيعَا آنِيَةً مِنَ الْمَغَانِمِ مِنْ ذَهَبٍ أَوْ فِضَّةٍ فَبَاعَا كُلَّ ثَلاَثَةٍ بِأَرْبَعَةٍ عَيْنًا أَوْ كُلَّ أَرْبَعَةٍ بِثَلاَثَةٍ عَيْنًا فَقَالَ لَهُمَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَرْبَيْتُمَا فَرُدَّا","english":{"narrator":"","text":"Yahya related to me from Malik that Yahya ibn Said said, \"The\nMessenger of Allah, mayAllah bless him and grant him peace, ordered\nthe two Sads to sell a vessel made of either gold or silver from the\nbooty. They either sold each three units of weight for four units of\nweight of coins or each four units of weight for three units of weight\nor coins. The Messenger of Allah, may Allah bless him and grant him\npeace, said to them, 'You have taken usury, so return it.' \""}},{"id":30,"idInBook":30,"chapterId":31,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ مُوسَى بْنِ أَبِي تَمِيمٍ، عَنْ أَبِي الْحُبَابِ، سَعِيدِ بْنِ يَسَارٍ عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ الدِّينَارُ بِالدِّينَارِ وَالدِّرْهَمُ بِالدِّرْهَمِ لاَ فَضْلَ بَيْنَهُمَا ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Musa ibn Abi Tamim from Abu'l\nHubab Said ibn Yasar from Abu Hurayra that the Messenger of Allah, may\nAllah bless him and grant him peace, said, \"A dinar for a dinar, a\ndirham for a dirham, no excess between the two.\""}},{"id":31,"idInBook":31,"chapterId":31,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تَبِيعُوا الذَّهَبَ بِالذَّهَبِ إِلاَّ مِثْلاً بِمِثْلٍ وَلاَ تُشِفُّوا بَعْضَهَا عَلَى بَعْضٍ وَلاَ تَبِيعُوا الْوَرِقَ بِالْوَرِقِ إِلاَّ مِثْلاً بِمِثْلٍ وَلاَ تُشِفُّوا بَعْضَهَا عَلَى بَعْضٍ وَلاَ تَبِيعُوا مِنْهَا شَيْئًا غَائِبًا بِنَاجِزٍ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi from Abu Said al-Khudri\nthat the Messenger of Allah, may Allah bless him and grant him peace,\nsaid, \"Do not sell gold for gold except like for like and do not\nincrease one part over another part. Do not sell silver for silver,\nexcept like for like and do not increase one part over another part.\nDo not sell some of it which is not there for some of it which is.\""}},{"id":32,"idInBook":32,"chapterId":31,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ حُمَيْدِ بْنِ قَيْسٍ الْمَكِّيِّ، عَنْ مُجَاهِدٍ، أَنَّهُ قَالَ كُنْتُ مَعَ عَبْدِ اللَّهِ بْنِ عُمَرَ فَجَاءَهُ صَائِغٌ فَقَالَ لَهُ يَا أَبَا عَبْدِ الرَّحْمَنِ إِنِّي أَصُوغُ الذَّهَبَ ثُمَّ أَبِيعُ الشَّىْءَ مِنْ ذَلِكَ بِأَكْثَرَ مِنْ وَزْنِهِ فَأَسْتَفْضِلُ مِنْ ذَلِكَ قَدْرَ عَمَلِ يَدِي ‏.‏ فَنَهَاهُ عَبْدُ اللَّهِ عَنْ ذَلِكَ فَجَعَلَ الصَّائِغُ يُرَدِّدُ عَلَيْهِ الْمَسْأَلَةَ وَعَبْدُ اللَّهِ يَنْهَاهُ حَتَّى انْتَهَى إِلَى بَابِ الْمَسْجِدِ أَوْ إِلَى دَابَّةٍ يُرِيدُ أَنْ يَرْكَبَهَا ثُمَّ قَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ الدِّينَارُ بِالدِّينَارِ وَالدِّرْهَمُ بِالدِّرْهَمِ لاَ فَضْلَ بَيْنَهُمَا هَذَا عَهْدُ نَبِيِّنَا إِلَيْنَا وَعَهْدُنَا إِلَيْكُمْ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Humayd ibn Qays al-Makki that\nMujahid said, \"I was with Abdullah ibn Umar and an artisan came to him\nand said, 'Abu Abd ar-Rahman - I fashion gold and then sell what I\nhave made for more than its weight. I take an amount equivalent to the\nwork of my hand.' Abdullah forbade him to do that, so the artisan\nrepeated the question to him, and Abdullah continued to forbid him\nuntil he came to the door of the mosque or to an animal that he\nintended to mount. Then Abdullah ibn Umar said, 'A dinar for a dinar,\nand a dirham for a dirham. There is no increase between them. This is\nthe command of ourProphet to us and our advice to you.' \""}},{"id":33,"idInBook":33,"chapterId":31,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ عَنْ جَدِّهِ، مَالِكِ بْنِ أَبِي عَامِرٍ أَنَّ عُثْمَانَ بْنَ عَفَّانَ، \nقَالَ قَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ تَبِيعُوا الدِّينَارَ بِالدِّينَارَيْنِ وَلاَ الدِّرْهَمَ بِالدِّرْهَمَيْنِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard from his\ngrandfather, Malik ibn Abi Amir that Uthman ibn Affan said, \"The\nMessenger of Allah, may Allah bless him and grant him peace, said to\nme, 'Do not sell a dinar for two dinars nor a dirham for two dirhams.'\n\""}},{"id":34,"idInBook":34,"chapterId":31,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، أَنَّ مُعَاوِيَةَ بْنَ أَبِي سُفْيَانَ، بَاعَ سِقَايَةً مِنْ ذَهَبٍ أَوْ وَرِقٍ بِأَكْثَرَ مِنْ وَزْنِهَا فَقَالَ أَبُو الدَّرْدَاءِ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَنْهَى عَنْ مِثْلِ هَذَا إِلاَّ مِثْلاً بِمِثْلٍ ‏.‏ فَقَالَ لَهُ مُعَاوِيَةُ مَا أَرَى بِمِثْلِ هَذَا بَأْسًا ‏.‏ فَقَالَ أَبُو الدَّرْدَاءِ مَنْ يَعْذِرُنِي مِنْ مُعَاوِيَةَ أَنَا أُخْبِرُهُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَيُخْبِرُنِي عَنْ رَأْيِهِ لاَ أُسَاكِنُكَ بِأَرْضٍ أَنْتَ بِهَا ‏.‏ ثُمَّ قَدِمَ أَبُو الدَّرْدَاءِ عَلَى عُمَرَ بْنِ الْخَطَّابِ فَذَكَرَ ذَلِكَ لَهُ فَكَتَبَ عُمَرُ بْنُ الْخَطَّابِ إِلَى مُعَاوِيَةَ أَنْ لاَ تَبِيعَ ذَلِكَ إِلاَّ مِثْلاً بِمِثْلٍ وَزْنًا بِوَزْنٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Zayd ibn Aslam from Ata ibn\nYasar that Muawiya ibn Abi Sufyan sold a gold or silver drinking-\nvessel for more than its weight. Abu'dDarda said, \"I heard the\nMessenger of Allah, may Allah bless him and grant him peace,\nforbidding such sales except like for like.\" Muawiya said to him, \"I\ndon't see any harm in it.\" Abu'd-Darda said to him, \"Who will excuse\nme from Muawiya? I tell him something from the Messenger of Allah, may\nAllah bless him and grant him peace, and he gives me his own opinion!\nI will not live in the same land as you!\" Then Abu'd-Darda went to\nUmar ibn al-Khattab and mentioned that to him. Umar ibn al-Khattab\ntherefore wrote to Muawiya, \"Do not sell it except like for like,\nweight for weight.\""}},{"id":35,"idInBook":35,"chapterId":31,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ لاَ تَبِيعُوا الذَّهَبَ بِالذَّهَبِ إِلاَّ مِثْلاً بِمِثْلٍ وَلاَ تُشِفُّوا بَعْضَهَا عَلَى بَعْضٍ وَلاَ تَبِيعُوا الْوَرِقَ بِالْوَرِقِ إِلاَّ مِثْلاً بِمِثْلٍ وَلاَ تُشِفُّوا بَعْضَهَا عَلَى بَعْضٍ وَلاَ تَبِيعُوا الْوَرِقَ بِالذَّهَبِ أَحَدُهُمَا غَائِبٌ وَالآخَرُ نَاجِزٌ وَإِنِ اسْتَنْظَرَكَ إِلَى أَنْ يَلِجَ بَيْتَهُ فَلاَ تُنْظِرْهُ إِنِّي أَخَافُ عَلَيْكُمُ الرَّمَاءَ وَالرَّمَاءُ هُوَ الرِّبَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat Umar ibn al-Khattab said, \"Do not sell gold for gold except like\nfor like, and do not increase one part over another part. Do not sell\nsilver for silver except like for like, and do not increase one part\nover another part. Do not sell silver for gold, one of them at hand\nand the other to be given later. If someone seeks to delay paying you\nuntil he has been to his house, do not leave him. I fear rama for\nyou.\" Rama is usury."}},{"id":36,"idInBook":36,"chapterId":31,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ لاَ تَبِيعُوا الذَّهَبَ بِالذَّهَبِ إِلاَّ مِثْلاً بِمِثْلٍ وَلاَ تُشِفُّوا بَعْضَهَا عَلَى بَعْضٍ وَلاَ تَبِيعُوا الْوَرِقَ بِالْوَرِقِ إِلاَّ مِثْلاً بِمِثْلٍ وَلاَ تُشِفُّوا بَعْضَهَا عَلَى بَعْضٍ وَلاَ تَبِيعُوا شَيْئًا مِنْهَا غَائِبًا بِنَاجِزٍ ‏.‏ وَإِنِ اسْتَنْظَرَكَ إِلَى أَنْ يَلِجَ بَيْتَهُ فَلاَ تُنْظِرْهُ إِنِّي أَخَافُ عَلَيْكُمُ الرَّمَاءَ وَالرَّمَاءُ هُوَ الرِّبَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abdullah ibn Dinar from\nAbdullah ibn Umar that Umar ibn al-Khattab said, \"Do not sell gold for\ngold except like for like. Do not increase part of it over another\npart. Do not sell silver for silver except like for like, and do not\nincrease part of it over another part. Do not sell some of it which is\nthere for some of it which is not. If someone asks you to wait for\npayment until he has been to his house, do not leave him. I fear rama\nfor you.\" Rama is usury."}},{"id":37,"idInBook":37,"chapterId":31,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، أَنَّهُ قَالَ قَالَ عُمَرُ بْنُ الْخَطَّابِ الدِّينَارُ بِالدِّينَارِ وَالدِّرْهَمُ بِالدِّرْهَمِ وَالصَّاعُ بِالصَّاعِ وَلاَ يُبَاعُ كَالِئٌ بِنَاجِزٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that al-Oasim\nibn Muhammad said, ''Umar ibn al-Khattab said, 'A dinar for a dinar,\nand a dirham for adirham, and a sa for a sa. Something to be collected\nlater is not to be sold for something at hand. ' \""}},{"id":38,"idInBook":38,"chapterId":31,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، أَنَّهُ سَمِعَ سَعِيدَ بْنَ الْمُسَيَّبِ، يَقُولُ لاَ رِبًا إِلاَّ فِي ذَهَبٍ أَوْ فِضَّةٍ أَوْ مَا يُكَالُ أَوْ يُوزَنُ بِمَا يُؤْكَلُ أَوْ يُشْرَبُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Abu'z-Zinad heard Said ibn\nal-Musayyab say, \"There is usury only in gold or silver or what is\nweighed or measured of what is eaten or drunk.\""}},{"id":39,"idInBook":39,"chapterId":31,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ سَمِعَ سَعِيدَ بْنَ الْمُسَيَّبِ، يَقُولُ قَطْعُ الذَّهَبِ وَالْوَرِقِ مِنَ الْفَسَادِ فِي الأَرْضِ ‏.‏ قَالَ مَالِكٌ وَلاَ بَأْسَ أَنْ يَشْتَرِيَ الرَّجُلُ الذَّهَبَ بِالْفِضَّةِ وَالْفِضَّةَ بِالذَّهَبِ جِزَافًا إِذَا كَانَ تِبْرًا أَوْ حَلْيًا قَدْ صِيغَ فَأَمَّا الدَّرَاهِمُ الْمَعْدُودَةُ وَالدَّنَانِيرُ الْمَعْدُودَةُ فَلاَ يَنْبَغِي لأَحَدٍ أَنْ يَشْتَرِيَ ذَلِكَ جِزَافًا حَتَّى يُعْلَمَ وَيُعَدَّ فَإِنِ اشْتُرِيَ ذَلِكَ جِزَافًا فَإِنَّمَا يُرَادُ بِهِ الْغَرَرُ حِينَ يُتْرَكُ عَدُّهُ وَيُشْتَرَى جِزَافًا وَلَيْسَ هَذَا مِنْ بُيُوعِ الْمُسْلِمِينَ فَأَمَّا مَا كَانَ يُوزَنُ مِنَ التِّبْرِ وَالْحَلْىِ فَلاَ بَأْسَ أَنْ يُبَاعَ ذَلِكَ جِزَافًا وَإِنَّمَا ابْتِيَاعُ ذَلِكَ جِزَافًا كَهَيْئَةِ الْحِنْطَةِ وَالتَّمْرِ وَنَحْوِهِمَا مِنَ الأَطْعِمَةِ الَّتِي تُبَاعُ جِزَافًا وَمِثْلُهَا يُكَالُ فَلَيْسَ بِابْتِيَاعِ ذَلِكَ جِزَافًا بَأْسٌ ‏.‏ قَالَ مَالِكٌ مَنِ اشْتَرَى مُصْحَفًا أَوْ سَيْفًا أَوْ خَاتَمًا وَفِي شَىْءٍ مِنْ ذَلِكَ ذَهَبٌ أَوْ فِضَّةٌ بِدَنَانِيرَ أَوْ دَرَاهِمَ فَإِنَّ مَا اشْتُرِيَ مِنْ ذَلِكَ وَفِيهِ الذَّهَبُ بِدَنَانِيرَ فَإِنَّهُ يُنْظَرُ إِلَى قِيمَتِهِ فَإِنْ كَانَتْ قِيمَةُ ذَلِكَ الثُّلُثَيْنِ وَقِيمَةُ مَا فِيهِ مِنَ الذَّهَبِ الثُّلُثَ فَذَلِكَ جَائِزٌ لاَ بَأْسَ بِهِ إِذَا كَانَ ذَلِكَ يَدًا بِيَدٍ وَلاَ يَكُونُ فِيهِ تَأْخِيرٌ وَمَا اشْتُرِيَ مِنْ ذَلِكَ بِالْوَرِقِ مِمَّا فِيهِ الْوَرِقُ نُظِرَ إِلَى قِيمَتِهِ فَإِنْ كَانَ قِيمَةُ ذَلِكَ الثُّلُثَيْنِ وَقِيمَةُ مَا فِيهِ مِنَ الْوَرِقِ الثُّلُثَ فَذَلِكَ جَائِزٌ لاَ بَأْسَ بِهِ إِذَا كَانَ ذَلِكَ يَدًا بِيَدٍ وَلَمْ يَزَلْ ذَلِكَ مِنْ أَمْرِ النَّاسِ عِنْدَنَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Yahya ibn Said heard Said ibn\nal-Musayyab say, \"Keeping gold and silver out of circulation is part\nof working corruption in the land.\"\n\n\nMalik said, \"There is no\nharm in buying gold with silver or silver with gold without measuring\nif it is unminted or a piece of jewellery which has been made. Counted\ndirhams and counted dinars should not be bought without reckoning\nuntil they are known and counted. To abandon number and buy them at\nrandom would only be to speculate. That is not part of the business\ntransactions of Muslims. As for what is weighed of unminted objects\nand jewellery, there is no harm in buying such things without\nmeasuring. To buy them without measuring is like buying wheat, dried\ndates, and such food-stuffs, which are sold without measuring, even\nthough things like them are measured \"\n\n\nMalik spoke about\nbuying a Qur'an, a sword or a signet ring which had some gold or\nsilver work on it with dinars or dirhams. He said, \"The value of the\nobject bought with dinars, which has gold in it is looked at. If the\nvalue of the gold is up to one-third of the price, it is permitted and\nthere is no harm in it if the sale is hand to hand and there is no\ndeferment in it. When something is bought with silver which has silver\nin it, the value is looked at. If the value of the silver is one-\nthird, it is permitted and there is no harm in it if the sale is hand\nto hand. That is still the way of doing things among us.\""}},{"id":40,"idInBook":40,"chapterId":31,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ مَالِكِ بْنِ أَوْسِ بْنِ الْحَدَثَانِ النَّصْرِيِّ، أَنَّهُ الْتَمَسَ صَرْفًا بِمِائَةِ دِينَارٍ قَالَ فَدَعَانِي طَلْحَةُ بْنُ عُبَيْدِ اللَّهِ فَتَرَاوَضْنَا حَتَّى اصْطَرَفَ مِنِّي وَأَخَذَ الذَّهَبَ يُقَلِّبُهَا فِي يَدِهِ ثُمَّ قَالَ حَتَّى يَأْتِيَنِي خَازِنِي مِنَ الْغَابَةِ ‏.‏ وَعُمَرُ بْنُ الْخَطَّابِ يَسْمَعُ ‏.‏ فَقَالَ عُمَرُ وَاللَّهِ لاَ تُفَارِقْهُ حَتَّى تَأْخُذَ مِنْهُ - ثُمَّ قَالَ - قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ الذَّهَبُ بِالْوَرِقِ رِبًا إِلاَّ هَاءَ وَهَاءَ وَالْبُرُّ بِالْبُرِّ رِبًا إِلاَّ هَاءَ وَهَاءَ وَالتَّمْرُ بِالتَّمْرِ رِبًا إِلاَّ هَاءَ وَهَاءَ وَالشَّعِيرُ بِالشَّعِيرِ رِبًا إِلاَّ هَاءَ وَهَاءَ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Malik ibn Aus\nibn al-Hadathan an-Nasri that one time he asked to exchange 100\ndinars. He said, \"Talha ibn Ubaydullah called me over and we made a\nmutual agreement that he would make an exchange for me. He took the\ngold and turned it about in his hand, and then said, 'I can't do it\nuntil my treasurer brings the money to me from al-Ghaba.' Umar ibn al-\nKhattab was listening and Umar said, 'By Allah! Do not leave him until\nyou have taken it from him!' Then he said, 'The Messenger of Allah,\nmay Allah bless him and grant him peace, said, \"Gold for silver is\nusury except hand to hand. Wheat for wheat is usury except hand to\nhand. Dates for dates is usury except hand to hand. Barley for barley\nis usury except hand to hand.\" \"'\n\n\nMalik said, \"When a man\nbuys dirhams with dinars and then finds a bad dirham among them and\nwants to return it, the exchange of the dinars breaks down, and he\nreturns the silver and takes back his dinars. The explanation of what\nis disapproved of in that is that the Messenger of Allah, may Allah\nbless him and grant him peace, said, 'Gold for silver is usury except\nhand to hand.' and Umar ibn al-Khattab said, 'If someone asks you to\nwait to be paid until he has gone back to his house, do not leave\nhim.' When he returns a dirham to him from the exchange after he has\nleft him, it is like a debt or something deferred. For that reason, it\nis disapproved of, and the exchange collapses. Umar ibn al-Khattab\nwanted that all gold, silver and food should not be sold for goods to\nbe paid later. He did not want there to be any delay or deferment in\nany such sale, whether it involved one commodity or different sorts of\ncommodities.\""}},{"id":41,"idInBook":41,"chapterId":31,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ قُسَيْطٍ، أَنَّهُ رَأَى سَعِيدَ بْنَ الْمُسَيَّبِ يُرَاطِلُ الذَّهَبَ بِالذَّهَبِ فَيُفْرِغُ ذَهَبَهُ فِي كِفَّةِ الْمِيزَانِ وَيُفْرِغُ صَاحِبُهُ الَّذِي يُرَاطِلُهُ ذَهَبَهُ فِي كِفَّةِ الْمِيزَانِ الأُخْرَى فَإِذَا اعْتَدَلَ لِسَانُ الْمِيزَانِ أَخَذَ وَأَعْطَى ‏.‏ قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا فِي بَيْعِ الذَّهَبِ بِالذَّهَبِ وَالْوَرِقِ بِالْوَرِقِ مُرَاطَلَةً أَنَّهُ لاَ بَأْسَ بِذَلِكَ أَنْ يَأْخُذَ أَحَدَ عَشَرَ دِينَارًا بِعَشَرَةِ دَنَانِيرَ يَدًا بِيَدٍ إِذَا كَانَ وَزْنُ الذَّهَبَيْنِ سَوَاءً عَيْنًا بِعَيْنٍ وَإِنْ تَفَاضَلَ الْعَدَدُ وَالدَّرَاهِمُ أَيْضًا فِي ذَلِكَ بِمَنْزِلَةِ الدَّنَانِيرِ ‏.‏ قَالَ مَالِكٌ مَنْ رَاطَلَ ذَهَبًا بِذَهَبٍ أَوْ وَرِقًا بِوَرِقٍ فَكَانَ بَيْنَ الذَّهَبَيْنِ فَضْلُ مِثْقَالٍ فَأَعْطَى صَاحِبَهُ قِيمَتَهُ مِنَ الْوَرِقِ أَوْ مِنْ غَيْرِهَا فَلاَ يَأْخُذُهُ فَإِنَّ ذَلِكَ قَبِيحٌ وَذَرِيعَةٌ إِلَى الرِّبَا لأَنَّهُ إِذَا جَازَ لَهُ أَنْ يَأْخُذَ الْمِثْقَالَ بِقِيمَتِهِ حَتَّى كَأَنَّهُ اشْتَرَاهُ عَلَى حِدَتِهِ جَازَ لَهُ أَنْ يَأْخُذَ الْمِثْقَالَ بِقِيمَتِهِ مِرَارًا لأَنْ يُجِيزَ ذَلِكَ الْبَيْعَ بَيْنَهُ وَبَيْنَ صَاحِبِهِ ‏.‏ قَالَ مَالِكٌ وَلَوْ أَنَّهُ بَاعَهُ ذَلِكَ الْمِثْقَالَ مُفْرَدًا لَيْسَ مَعَهُ غَيْرُهُ لَمْ يَأْخُذْهُ بِعُشْرِ الثَّمَنِ الَّذِي أَخَذَهُ بِهِ لأَنْ يُجَوِّزَ لَهُ الْبَيْعَ فَذَلِكَ الذَّرِيعَةُ إِلَى إِحْلاَلِ الْحَرَامِ وَالأَمْرُ الْمَنْهِيُّ عَنْهُ ‏.‏ قَالَ مَالِكٌ فِي الرَّجُلِ يُرَاطِلُ الرَّجُلَ وَيُعْطِيهِ الذَّهَبَ الْعُتُقَ الْجِيَادَ وَيَجْعَلُ مَعَهَا تِبْرًا ذَهَبًا غَيْرَ جَيِّدَةٍ وَيَأْخُذُ مِنْ صَاحِبِهِ ذَهَبًا كُوفِيَّةً مُقَطَّعَةً وَتِلْكَ الْكُوفِيَّةُ مَكْرُوهَةٌ عِنْدَ النَّاسِ فَيَتَبَايَعَانِ ذَلِكَ مِثْلاً بِمِثْلٍ إِنَّ ذَلِكَ لاَ يَصْلُحُ ‏.‏ قَالَ مَالِكٌ وَتَفْسِيرُ مَا كُرِهَ مِنْ ذَلِكَ أَنَّ صَاحِبَ الذَّهَبِ الْجِيَادِ أَخَذَ فَضْلَ عُيُونِ ذَهَبِهِ فِي التِّبْرِ الَّذِي طَرَحَ مَعَ ذَهَبِهِ وَلَوْلاَ فَضْلُ ذَهَبِهِ عَلَى ذَهَبِ صَاحِبِهِ لَمْ يُرَاطِلْهُ صَاحِبُهُ بِتِبْرِهِ ذَلِكَ إِلَى ذَهَبِهِ الْكُوفِيَّةِ فَامْتَنَعَ وَإِنَّمَا مَثَلُ ذَلِكَ كَمَثَلِ رَجُلٍ أَرَادَ أَنْ يَبْتَاعَ ثَلاَثَةَ أَصْوُعٍ مِنْ تَمْرٍ عَجْوَةٍ بِصَاعَيْنِ وَمُدٍّ مِنْ تَمْرٍ كَبِيسٍ فَقِيلَ لَهُ هَذَا لاَ يَصْلُحُ ‏.‏ فَجَعَلَ صَاعَيْنِ مِنْ كَبِيسٍ وَصَاعًا مِنْ حَشَفٍ يُرِيدُ أَنْ يُجِيزَ بِذَلِكَ بَيْعَهُ فَذَلِكَ لاَ يَصْلُحُ لأَنَّهُ لَمْ يَكُنْ صَاحِبُ الْعَجْوَةِ لِيُعْطِيَهُ صَاعًا مِنَ الْعَجْوَةِ بِصَاعٍ مِنْ حَشَفٍ وَلَكِنَّهُ إِنَّمَا أَعْطَاهُ ذَلِكَ لِفَضْلِ الْكَبِيسِ أَوْ أَنْ يَقُولَ الرَّجُلُ لِلرَّجُلِ بِعْنِي ثَلاَثَةَ أَصْوُعٍ مِنَ الْبَيْضَاءِ بِصَاعَيْنِ وَنِصْفٍ مِنْ حِنْطَةٍ شَامِيَّةٍ فَيَقُولُ هَذَا لاَ يَصْلُحُ إِلاَّ مِثْلاً بِمِثْلٍ ‏.‏ فَيَجْعَلُ صَاعَيْنِ مِنْ حِنْطَةٍ شَامِيَّةٍ وَصَاعًا مِنْ شَعِيرٍ يُرِيدُ أَنْ يُجِيزَ بِذَلِكَ الْبَيْعَ فِيمَا بَيْنَهُمَا فَهَذَا لاَ يَصْلُحُ لأَنَّهُ لَمْ يَكُنْ لِيُعْطِيَهُ بِصَاعٍ مِنْ شَعِيرٍ صَاعًا مِنْ حِنْطَةٍ بَيْضَاءَ لَوْ كَانَ ذَلِكَ الصَّاعُ مُفْرَدًا وَإِنَّمَا أَعْطَاهُ إِيَّاهُ لِفَضْلِ الشَّامِيَّةِ عَلَى الْبَيْضَاءِ فَهَذَا لاَ يَصْلُحُ وَهُوَ مِثْلُ مَا وَصَفْنَا مِنَ التِّبْرِ ‏.‏ قَالَ مَالِكٌ فَكُلُّ شَىْءٍ مِنَ الذَّهَبِ وَالْوَرِقِ وَالطَّعَامِ كُلِّهِ الَّذِي لاَ يَنْبَغِي أَنْ يُبَاعَ إِلاَّ مِثْلاً بِمِثْلٍ فَلاَ يَنْبَغِي أَنْ يُجْعَلَ مَعَ الصِّنْفِ الْجَيِّدِ مِنَ الْمَرْغُوبِ فِيهِ الشَّىْءُ الرَّدِيءُ الْمَسْخُوطُ لِيُجَازَ الْبَيْعُ وَلِيُسْتَحَلَّ بِذَلِكَ مَا نُهِيَ عَنْهُ مِنَ الأَمْرِ الَّذِي لاَ يَصْلُحُ إِذَا جُعِلَ ذَلِكَ مَعَ الصِّنْفِ الْمَرْغُوبِ فِيهِ وَإِنَّمَا يُرِيدُ صَاحِبُ ذَلِكَ أَنْ يُدْرِكَ بِذَلِكَ فَضْلَ جَوْدَةِ مَا يَبِيعُ فَيُعْطِيَ الشَّىْءَ الَّذِي لَوْ أَعْطَاهُ وَحْدَهُ لَمْ يَقْبَلْهُ صَاحِبُهُ وَلَمْ يَهْمُمْ بِذَلِكَ وَإِنَّمَا يَقْبَلُهُ مِنْ أَجْلِ الَّذِي يَأْخُذُ مَعَهُ لِفَضْلِ سِلْعَةِ صَاحِبِهِ عَلَى سِلْعَتِهِ فَلاَ يَنْبَغِي لِشَىْءٍ مِنَ الذَّهَبِ وَالْوَرِقِ وَالطَّعَامِ أَنْ يَدْخُلَهُ شَىْءٌ مِنْ هَذِهِ الصِّفَةِ فَإِنْ أَرَادَ صَاحِبُ الطَّعَامِ الرَّدِيءِ أَنْ يَبِيعَهُ بِغَيْرِهِ فَلْيَبِعْهُ عَلَى حِدَتِهِ وَلاَ يَجْعَلْ مَعَ ذَلِكَ شَيْئًا فَلاَ بَأْسَ بِهِ إِذَا كَانَ كَذَلِكَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Yazid ibn Abdullah ibn Qusayt\nsaw Said ibn al-Musayyab sell gold counterpoising for gold. He poured\nhis gold into one pan of the scales, and the man with whom he was\ncounterpoising put his gold in the other pan of the scale and when the\ntongue of the scales was balanced, they took and gave.\n\n\nMalik\nsaid, \"According to the way things are done among us there is no harm\nin selling gold for gold, and silver for silver by counterpoising\nweight, even if 11 dinars are taken for 10 dinars hand to hand, when\nthe weight of gold is equal, coin for coin, even if the number is\ndifferent. Dirhams in such a situation are treated the same way as\ndinars.\"\n\n\nMalik said, \"If, when counterpoising gold for gold\nor silver for silver, there is a difference of weight, one party\nshould not give the other the value of the difference in silver or\nsomething else. Such a transaction is ugly and a means to usury\nbecause if one of the parties were permitted to take the difference\nfor a separate price, it could be as if he had bought it separately,\nso he would be permitted. Then it would be possible for him to ask for\nmany times the value of the difference in order to permit the\ncompletion of the transaction between the two parties.\n\n\nMalik\nsaid, \"If he had really been sold the difference without anything else\nwith it, he would not have taken it for a tenth of the price for which\nhe took it in order to put a 'legal front' on the transaction. This\nleads to allowing what is forbidden . The matter is forbidden.\"\n\n\nMalik said that it was not good when counterpoising to give good\nold gold coins and put along with them unminted gold in exchange for\nworn kufic gold, which was unpopular and to then treat the exchange as\nlike for like.\n\n\nMalik said, \"The commentary on why that is\ndisapproved is that the owner of the good gold uses the excellence of\nhis old gold coins as an excuse to throw in the unminted gold with it.\nHad it not been for the superiority of his (good) gold over the gold\nof the other party, the other party would not have counterpoised the\nunminted gold for his kufic gold, and the deal would have been\nrefused.\n\n\n\"It is like a man wanting to buy three sa of ajwa\ndried dates for two sa and a mudd of kabis dates, and on being told\nthat it was not good, then offering two sa of kabis and a sa of poor\ndates desiring to make the sale possible. That is not good because the\nowner of the ajwa should not give him a sa of ajwa for a sa of poor\ndates. He would only give him that because of the excellence of kabis\ndates.\n\n\n\"Or it is like a man asking some one to sell him three\nsa of white wheat for two and a half sa of Syrian wheat, and being\ntold that it was not good except like for like, and so offering two sa\nof wheat and one sa of barley intending to make the sale possible\nbetween them. That is not good because no one would have given a sa of\nbarley for a sa of white wheat had that sa been by itself. It was only\ngiven because of the excellence of Syrian wheat over the white wheat.\nThis is not good. It is the same as the case of the unminted gold.\"\n\n\nMalik said, \"Where gold, silver and food, things which should\nonly be sold like for like, are concerned, something disliked and of\npoor quality should not be put with something good and desirable in\norder to make the sale possible and to make a bad situation halal.\nWhen something of desirable quality is put with something of poor\nquality and it is only included so that its excellence in quality is\nnoticed, something is being sold which if it had been sold on its own,\nwould not have been accepted and to which the buyer would not have\npaid any attention. It is only accepted by the buyer because of the\nsuperiority of what comes with it over his own goods. Transactions\ninvolving gold, silver, or food, must not have anything of this\ndescription enter into them. If the owner of the poor quality goods\nwants to sell them, he sells them on their own, and does not put\nanything with them. There is no harm if it is like that.\""}},{"id":42,"idInBook":42,"chapterId":31,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنِ ابْتَاعَ طَعَامًا فَلاَ يَبِعْهُ حَتَّى يَسْتَوْفِيَهُ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat the Messenger of Allah, may Allah bless him and grant him peace,\nsaid, \"Someone who buys food, must not resell it until he takes\ndelivery of it all.\""}},{"id":43,"idInBook":43,"chapterId":31,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنِ ابْتَاعَ طَعَامًا فَلاَ يَبِعْهُ حَتَّى يَقْبِضَهُ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abdullah ibn Dinar from\nAbdullah ibn Umar that the Messenger of Allah, may Allah bless him and\ngrant him peace, said, \"Someone who buys food, must not sell it until\nhe takes possession of it.\""}},{"id":44,"idInBook":44,"chapterId":31,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ قَالَ كُنَّا فِي زَمَانِ رَسُولِ اللَّهِ صلى الله عليه وسلم نَبْتَاعُ الطَّعَامَ فَيَبْعَثُ عَلَيْنَا مَنْ يَأْمُرُنَا بِانْتِقَالِهِ مِنَ الْمَكَانِ الَّذِي ابْتَعْنَاهُ فِيهِ إِلَى مَكَانٍ سِوَاهُ قَبْلَ أَنْ نَبِيعَهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nsaid, \"In the time of the Messenger of Allah, may Allah bless him and\ngrant him peace, we used to buy food. He sent orders for us to move\nour purchases from the place in which we purchased them to another\nplace before we re-sold them.\""}},{"id":45,"idInBook":45,"chapterId":31,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، ‏.‏ أَنَّ حَكِيمَ بْنَ حِزَامٍ، ابْتَاعَ طَعَامًا أَمَرَ بِهِ عُمَرُ بْنُ الْخَطَّابِ لِلنَّاسِ فَبَاعَ حَكِيمٌ الطَّعَامَ قَبْلَ أَنْ يَسْتَوْفِيَهُ فَبَلَغَ ذَلِكَ عُمَرَ بْنَ الْخَطَّابِ فَرَدَّهُ عَلَيْهِ وَقَالَ لاَ تَبِعْ طَعَامًا ابْتَعْتَهُ حَتَّى تَسْتَوْفِيَهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Hakim ibn Hizam\ntraded in food for people as Umar ibn al-Khattab had ordered him to\ndo. Hakim re-sold the food before he had taken delivery of it. That\nreached Umar ibn al-Khattab and he revoked the sale and said, \"Do not\nsell food which you have purchased until you take delivery of it.\""}},{"id":46,"idInBook":46,"chapterId":31,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ ‏.‏ أَنَّ صُكُوكًا، خَرَجَتْ لِلنَّاسِ فِي زَمَانِ مَرْوَانَ بْنِ الْحَكَمِ مِنْ طَعَامِ الْجَارِ فَتَبَايَعَ النَّاسُ تِلْكَ الصُّكُوكَ بَيْنَهُمْ قَبْلَ أَنْ يَسْتَوْفُوهَا فَدَخَلَ زَيْدُ بْنُ ثَابِتٍ وَرَجُلٌ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم عَلَى مَرْوَانَ بْنِ الْحَكَمِ فَقَالاَ أَتُحِلُّ بَيْعَ الرِّبَا يَا مَرْوَانُ ‏.‏ فَقَالَ أَعُوذُ بِاللَّهِ وَمَا ذَاكَ فَقَالاَ هَذِهِ الصُّكُوكُ تَبَايَعَهَا النَّاسُ ثُمَّ بَاعُوهَا قَبْلَ أَنْ يَسْتَوْفُوهَا فَبَعَثَ مَرْوَانُ الْحَرَسَ يَتْبَعُونَهَا يَنْزِعُونَهَا مِنْ أَيْدِي النَّاسِ وَيَرُدُّونَهَا إِلَى أَهْلِهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that receipts\nwere given to people in the time of Marwan ibn al-Hakam for the\nproduce of the market at al-Jar. People bought and sold the receipts\namong themselves before they took delivery of the goods. Zayd Thabit\nand one of the Companions of the Messenger of Allah, may Allah bless\nhim and grant him peace, went to Marwan ibn al-Hakam and said,\n\"Marwan! Do you make usury halal?\" He said, \"I seek refuge with Allah!\nWhat is that?\" He said, \"These receipts which people buy and sell\nbefore they take delivery of the goods.\" Marwan therefore sent a guard\nto follow them and to take them from people's hands and return them to\ntheir owners."}},{"id":47,"idInBook":47,"chapterId":31,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ رَجُلاً، أَرَادَ أَنْ يَبْتَاعَ طَعَامًا مِنْ رَجُلٍ إِلَى أَجَلٍ فَذَهَبَ بِهِ الرَّجُلُ الَّذِي يُرِيدُ أَنْ يَبِيعَهُ الطَّعَامَ إِلَى السُّوقِ فَجَعَلَ يُرِيهِ الصُّبَرَ وَيَقُولُ لَهُ مِنْ أَيِّهَا تُحِبُّ أَنْ أَبْتَاعَ لَكَ فَقَالَ الْمُبْتَاعُ أَتَبِيعُنِي مَا لَيْسَ عِنْدَكَ فَأَتَيَا عَبْدَ اللَّهِ بْنَ عُمَرَ فَذَكَرَا ذَلِكَ لَهُ فَقَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ لِلْمُبْتَاعِ لاَ تَبْتَعْ مِنْهُ مَا لَيْسَ عِنْدَهُ ‏.‏ وَقَالَ لِلْبَائِعِ لاَ تَبِعْ مَا لَيْسَ عِنْدَكَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that a man\nwanted to buy food from a man in advance. The man who wanted to sell\nthe food to him went with him to the market, and he began to show him\nheaps, saying, \"Which one would you like me to buy for you.\" The buyer\nsaid to him, \"Are you selling me what you do not have?\" So they came\nto Abdullah ibn Umarand mentioned that to him. Abdallah ibn Umar said\nto the buyer, \"Do not buy from him what he does not have.\" He said to\nthe seller, \"Do not sell what you do not have.\""}},{"id":48,"idInBook":48,"chapterId":31,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ سَمِعَ جَمِيلَ بْنَ عَبْدِ الرَّحْمَنِ الْمُؤَذِّنَ، يَقُولُ لِسَعِيدِ بْنِ الْمُسَيَّبِ إِنِّي رَجُلٌ أَبْتَاعُ مِنَ الأَرْزَاقِ الَّتِي تُعْطَى النَّاسُ بِالْجَارِ مَا شَاءَ اللَّهُ ثُمَّ أُرِيدُ أَنْ أَبِيعَ الطَّعَامَ الْمَضْمُونَ عَلَىَّ إِلَى أَجَلٍ ‏.‏ فَقَالَ لَهُ سَعِيدٌ أَتُرِيدُ أَنْ تُوَفِّيَهُمْ مِنْ تِلْكَ الأَرْزَاقِ الَّتِي ابْتَعْتَ فَقَالَ نَعَمْ ‏.‏ فَنَهَاهُ عَنْ ذَلِكَ ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا الَّذِي لاَ اخْتِلاَفَ فِيهِ أَنَّهُ مَنِ اشْتَرَى طَعَامًا بُرًّا أَوْ شَعِيرًا أَوْ سُلْتًا أَوْ ذُرَةً أَوْ دُخْنًا أَوْ شَيْئًا مِنَ الْحُبُوبِ الْقِطْنِيَّةِ أَوْ شَيْئًا مِمَّا يُشْبِهُ الْقِطْنِيَّةَ مِمَّا تَجِبُ فِيهِ الزَّكَاةُ أَوْ شَيْئًا مِنَ الأُدْمِ كُلِّهَا الزَّيْتِ وَالسَّمْنِ وَالْعَسَلِ وَالْخَلِّ وَالْجُبْنِ وَالشَّبْرَقِ وَاللَّبَنِ وَمَا أَشْبَهَ ذَلِكَ مِنَ الأُدْمِ فَإِنَّ الْمُبْتَاعَ لاَ يَبِيعُ شَيْئًا مِنْ ذَلِكَ حَتَّى يَقْبِضَهُ وَيَسْتَوْفِيَهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Yahya ibn Said heard Jamil\nibn Abd ar-Rahman the Muadhdhin say to Said ibn al-Musayyab, \"I am a\nman who buys whatever Allah wills of the receipts for the provisions\nwhich people are offered at al-Jar. I want to take payment for goods\nthat I guarantee to deliver at a future date.\" Said said to him, \"Do\nyou intend to settle these things with receipts for provisions you\nhave bought?\" He said, \"Yes.\" So he forbade that.\n\n\nMalik said,\n\"The generally agreed on way of doing things among us in which there\nis no dispute, about buying food - wheat, barley, durra-sorghum, pearl\nmillet, or any pulse or anything resembling pulses on which zakat is\nobliged, or condiments of any sort - oil, ghee, honey, vinegar,\ncheese, sesame oil, milk and so on, is that the buyer should not re-\nsell any of that until he has taken possession and complete delivery\nof it."}},{"id":49,"idInBook":49,"chapterId":31,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، أَنَّهُ سَمِعَ سَعِيدَ بْنَ الْمُسَيَّبِ، وَسُلَيْمَانَ بْنَ يَسَارٍ، يَنْهَيَانِ أَنْ يَبِيعَ الرَّجُلُ، حِنْطَةً بِذَهَبٍ إِلَى أَجَلٍ ثُمَّ يَشْتَرِيَ بِالذَّهَبِ تَمْرًا قَبْلَ أَنْ يَقْبِضَ الذَّهَبَ","english":{"narrator":"","text":"Yahya related to me from Malik that Abu'z-Zinad heard Sa'id ibn\nal-Musayyab andSulayman ibn Yasar forbid a man to sell wheat for gold\non delayed terms and then to buy dried dates with the gold before he\nhad taken delivery of the gold."}},{"id":50,"idInBook":50,"chapterId":31,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ كَثِيرِ بْنِ فَرْقَدٍ، ‏.‏ أَنَّهُ سَأَلَ أَبَا بَكْرِ بْنَ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ عَنِ الرَّجُلِ، يَبِيعُ الطَّعَامَ مِنَ الرَّجُلِ بِذَهَبٍ إِلَى أَجَلٍ ثُمَّ يَشْتَرِي بِالذَّهَبِ تَمْرًا قَبْلَ أَنْ يَقْبِضَ الذَّهَبَ فَكَرِهَ ذَلِكَ وَنَهَى عَنْهُ ‏.‏ \n وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، بِمِثْلِ ذَلِكَ ‏.‏ قَالَ مَالِكٌ وَإِنَّمَا نَهَى سَعِيدُ بْنُ الْمُسَيَّبِ وَسُلَيْمَانُ بْنُ يَسَارٍ وَأَبُو بَكْرِ بْنُ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ وَابْنُ شِهَابٍ عَنْ أَنْ لاَ يَبِيعَ الرَّجُلُ حِنْطَةً بِذَهَبٍ ثُمَّ يَشْتَرِيَ الرَّجُلُ بِالذَّهَبِ تَمْرًا قَبْلَ أَنْ يَقْبِضَ الذَّهَبَ مِنْ بَيْعِهِ الَّذِي اشْتَرَى مِنْهُ الْحِنْطَةَ فَأَمَّا أَنْ يَشْتَرِيَ بِالذَّهَبِ الَّتِي بَاعَ بِهَا الْحِنْطَةَ إِلَى أَجَلٍ تَمْرًا مِنْ غَيْرِ بَائِعِهِ الَّذِي بَاعَ مِنْهُ الْحِنْطَةَ قَبْلَ أَنْ يَقْبِضَ الذَّهَبَ وَيُحِيلَ الَّذِي اشْتَرَى مِنْهُ التَّمْرَ عَلَى غَرِيمِهِ الَّذِي بَاعَ مِنْهُ الْحِنْطَةَ بِالذَّهَبِ الَّتِي لَهُ عَلَيْهِ فِي ثَمَنِ التَّمْرِ فَلاَ بَأْسَ بِذَلِكَ ‏.‏ قَالَ مَالِكٌ وَقَدْ سَأَلْتُ عَنْ ذَلِكَ غَيْرَ وَاحِدٍ مِنْ أَهْلِ الْعِلْمِ فَلَمْ يَرَوْا بِهِ بَأْسًا ‏.","english":{"narrator":"","text":"Yahya related to me from Malik that Kathir ibn Farqad asked Abu\nBakr ibn Muhammad ibn Amr ibn Hazm about a man who sold food to be\ndelivered at a future date to a man for gold and then with the gold,\nhe bought dates before he had taken delivery of the gold. He\ndisapproved of that and forbade it.\n\n\nYahya related to me from\nMalik from Ibn Shihab the like of that.\n\n\nMalik said, ''Said\nibn al-Musayyab, Sulayman ibn Yasar, Abu Bakr ibn Muhammad ibn Amr ibn\nHazm, and Ibn Shihab forbade that a man sell wheat for gold and then\nbuy dates with that gold before he had received the gold from the\ntransaction in which he sold the wheat. There is no harm for someone\nto buy dates on delayed terms, on the strength of the gold for which\nhe sold the wheat, from someone other than the person to whom he sold\nthe wheat before taking possession of the gold, and to refer the one\nfrom whom he bought the dates to his debtor who bought the wheat, for\nthe gold he is owed for the dates.\"\n\n\nMalik said, \"I asked more\nthan one of the people of knowledge about that and they did not see\nany harm in it.\""}},{"id":51,"idInBook":51,"chapterId":31,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ قَالَ لاَ بَأْسَ بِأَنْ يُسَلِّفَ الرَّجُلُ الرَّجُلَ فِي الطَّعَامِ الْمَوْصُوفِ بِسِعْرٍ مَعْلُومٍ إِلَى أَجَلٍ مُسَمًّى مَا لَمْ يَكُنْ فِي زَرْعٍ لَمْ يَبْدُ صَلاَحُهُ أَوْ تَمْرٍ لَمْ يَبْدُ صَلاَحُهُ ‏.‏ قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا فِيمَنْ سَلَّفَ فِي طَعَامٍ بِسِعْرٍ مَعْلُومٍ إِلَى أَجَلٍ مُسَمًّى فَحَلَّ الأَجَلُ فَلَمْ يَجِدِ الْمُبْتَاعُ عِنْدَ الْبَائِعِ وَفَاءً مِمَّا ابْتَاعَ مِنْهُ فَأَقَالَهُ فَإِنَّهُ لاَ يَنْبَغِي لَهُ أَنْ يَأْخُذَ مِنْهُ إِلاَّ وَرِقَهُ أَوْ ذَهَبَهُ أَوِ الثَّمَنَ الَّذِي دَفَعَ إِلَيْهِ بِعَيْنِهِ وَإِنَّهُ لاَ يَشْتَرِي مِنْهُ بِذَلِكَ الثَّمَنِ شَيْئًا حَتَّى يَقْبِضَهُ مِنْهُ وَذَلِكَ أَنَّهُ إِذَا أَخَذَ غَيْرَ الثَّمَنِ الَّذِي دَفَعَ إِلَيْهِ أَوْ صَرَفَهُ فِي سِلْعَةٍ غَيْرِ الطَّعَامِ الَّذِي ابْتَاعَ مِنْهُ فَهُوَ بَيْعُ الطَّعَامِ قَبْلَ أَنْ يُسْتَوْفَى ‏.‏ قَالَ مَالِكٌ وَقَدْ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ بَيْعِ الطَّعَامِ قَبْلَ أَنْ يُسْتَوْفَى ‏.‏ قَالَ مَالِكٌ فَإِنْ نَدِمَ الْمُشْتَرِي فَقَالَ لِلْبَائِعِ أَقِلْنِي وَأُنْظِرُكَ بِالثَّمَنِ الَّذِي دَفَعْتُ إِلَيْكَ ‏.‏ فَإِنَّ ذَلِكَ لاَ يَصْلُحُ وَأَهْلُ الْعِلْمِ يَنْهَوْنَ عَنْهُ وَذَلِكَ أَنَّهُ لَمَّا حَلَّ الطَّعَامُ لِلْمُشْتَرِي عَلَى الْبَائِعِ أَخَّرَ عَنْهُ حَقَّهُ عَلَى أَنْ يُقِيلَهُ فَكَانَ ذَلِكَ بَيْعَ الطَّعَامِ إِلَى أَجَلٍ قَبْلَ أَنْ يُسْتَوْفَى ‏.‏ قَالَ مَالِكٌ وَتَفْسِيرُ ذَلِكَ أَنَّ الْمُشْتَرِيَ حِينَ حَلَّ الأَجَلُ وَكَرِهَ الطَّعَامَ أَخَذَ بِهِ دِينَارًا إِلَى أَجَلٍ وَلَيْسَ ذَلِكَ بِالإِقَالَةِ وَإِنَّمَا الإِقَالَةُ مَا لَمْ يَزْدَدْ فِيهِ الْبَائِعُ وَلاَ الْمُشْتَرِي فَإِذَا وَقَعَتْ فِيهِ الزِّيَادَةُ بِنَسِيئَةٍ إِلَى أَجَلٍ أَوْ بِشَىْءٍ يَزْدَادُهُ أَحَدُهُمَا عَلَى صَاحِبِهِ أَوْ بِشَىْءٍ يَنْتَفِعُ بِهِ أَحَدُهُمَا فَإِنَّ ذَلِكَ لَيْسَ بِالإِقَالَةِ وَإِنَّمَا تَصِيرُ الإِقَالَةُ إِذَا فَعَلاَ ذَلِكَ بَيْعًا وَإِنَّمَا أُرْخِصَ فِي الإِقَالَةِ وَالشِّرْكِ وَالتَّوْلِيَةِ مَا لَمْ يَدْخُلْ شَيْئًا مِنْ ذَلِكَ زِيَادَةٌ أَوْ نُقْصَانٌ أَوْ نَظِرَةٌ فَإِنْ دَخَلَ ذَلِكَ زِيَادَةٌ أَوْ نُقْصَانٌ أَوْ نَظِرَةٌ صَارَ بَيْعًا يُحِلُّهُ مَا يُحِلُّ الْبَيْعَ وَيُحَرِّمُهُ مَا يُحَرِّمُ الْبَيْعَ ‏.‏ قَالَ مَالِكٌ مَنْ سَلَّفَ فِي حِنْطَةٍ شَامِيَّةٍ فَلاَ بَأْسَ أَنْ يَأْخُذَ مَحْمُولَةً بَعْدَ مَحِلِّ الأَجَلِ ‏.‏ قَالَ مَالِكٌ وَكَذَلِكَ مَنْ سَلَّفَ فِي صِنْفٍ مِنَ الأَصْنَافِ فَلاَ بَأْسَ أَنْ يَأْخُذَ خَيْرًا مِمَّا سَلَّفَ فِيهِ أَوْ أَدْنَى بَعْدَ مَحِلِّ الأَجَلِ وَتَفْسِيرُ ذَلِكَ أَنْ يُسَلِّفَ الرَّجُلُ فِي حِنْطَةٍ مَحْمُولَةٍ فَلاَ بَأْسَ أَنْ يَأْخُذَ شَعِيرًا أَوْ شَامِيَّةً وَإِنْ سَلَّفَ فِي تَمْرٍ عَجْوَةٍ فَلاَ بَأْسَ أَنْ يَأْخُذَ صَيْحَانِيًّا أَوْ جَمْعًا وَإِنْ سَلَّفَ فِي زَبِيبٍ أَحْمَرَ فَلاَ بَأْسَ أَنْ يَأْخُذَ أَسْوَدَ إِذَا كَانَ ذَلِكَ كُلُّهُ بَعْدَ مَحِلِّ الأَجَلِ إِذَا كَانَتْ مَكِيلَةُ ذَلِكَ سَوَاءً بِمِثْلِ كَيْلِ مَا سَلَّفَ فِيهِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nsaid that there was no harm in a man making an advance to another man\nfor food, with a set description and price until a set date, as long\nas it was not in crops, or dates which had not begun to ripen.\n\n\nMalik said, \"The way of doing things among us concerning someone\nwho makes an advance for foodstuffs at a known rate until a stated\ndate, and the date arrives and he finds that there is not enough of\nwhat he was sold with the seller to fulfill his order, and so he\nrevokes the sale, is that he must only take back the silver, gold, or\nprice which he paid exactly. He does not buy anything else from the\nman for the same price until he has got back what he paid. That is\nbecause if he took something else besides the price which he paid him\nor exchanged it for goods other than the goods which he bought from\nhim, it would be selling food before getting delivery of it.\"\n\n\nMalik said, \"The Messenger of Allah, may Allah bless him and grant him\npeace, forbade selling food before getting delivery of it.\"\n\n\nMalik said that it was not good if the buyer regretted his purchase\nand asked the seller to revoke the sale for him and he would not press\nhim immediately for what he had paid. The people of knowledge forbade\nthat. That was because when the food was made ready for the buyer by\nthe seller, the buyer deferred his due from the seller in order that\nhe might revoke the sale for him. That was the sale of food with\ndelayed terms before taking delivery of the food.\n\n\nMalik said,\n\"The explanation of that is that when the date of delivery comes and\nthe buyer dislikes the food, the seller takes by it money to be paid\nlater and so it is not revocation. Revocation is that in which neither\nthe buyer nor the seller is increased. When increase occurs by\ndeferment of payment for a time period, or by anything which increases\none of them over the other or anything which gives one of them profit,\nit is not revocation. When either of them do that, revocation becomes\na sale. There is an indulgence for revocation, partnership, and\ntransfer, as long as i ncrease, decrease, or deferment does not come\ninto them. If increase, decrease, or deferment comes into it, it\nbecomes a sale. Whatever makes a sale halal makes it halal and\nwhatever makes a sale haram makes it haram.\"\n\n\nMalik said, \"If\nsomeone pays in advance for Syrian wheat, there is no harm if he takes\na load after the term falls due.\"\n\n\nMalik said, \"It is the same\nwith whoever advances for any kind of thing. There is no harm in him\ntaking better than whatever he has made an advance for or worse than\nit after the agreed delivery date. The explanation of that is that if,\nfor instance, a man advances for a certain weight of wheat. There is\nno harm if he decides to take some barley or Syrian wheat. If he has\nmade an advance for good dates, there is no harm if he decides to take\npoor quality dates. If he paid in advance for red raisins, there is no\nharm if he takes black ones, when it happens after the agreed delivery\ndate, and when the measure of what he takes is like the measure of\nwhat he paid for in advance.\""}},{"id":52,"idInBook":52,"chapterId":31,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ سُلَيْمَانَ بْنَ يَسَارٍ، قَالَ فَنِيَ عَلَفُ حِمَارِ سَعْدِ بْنِ أَبِي وَقَّاصٍ فَقَالَ لِغُلاَمِهِ خُذْ مِنْ حِنْطَةِ أَهْلِكَ فَابْتَعْ بِهَا شَعِيرًا وَلاَ تَأْخُذْ إِلاَّ مِثْلَهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Sulayman\nibn Yasar said, \"The fodder of the donkeys of Saad ibn Abi Waqqas ran\nout and so he told his slave to take some of the family's wheat and\nbuy barley with it, and to only take a like quantity.\""}},{"id":53,"idInBook":53,"chapterId":31,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، أَنَّهُ أَخْبَرَهُ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ الأَسْوَدِ بْنِ عَبْدِ يَغُوثَ فَنِيَ عَلَفُ دَابَّتِهِ فَقَالَ لِغُلاَمِهِ خُذْ مِنْ حِنْطَةِ أَهْلِكَ طَعَامًا فَابْتَعْ بِهَا شَعِيرًا وَلاَ تَأْخُذْ إِلاَّ مِثْلَهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Sulayman ibn Yasar\ntold him that one time the fodder of the animals of Abd ar-Rahman ibn\nal-Aswad ibn Abd Yaghuth was finished so he said  to his slave, \"Take\nsome of your family's wheat as food and buy with it barley, and take\nonly a like quantity.' \""}},{"id":54,"idInBook":54,"chapterId":31,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنِ ابْنِ مُعَيْقِيبٍ الدَّوْسِيِّ، مِثْلُ ذَلِكَ ‏.‏ قَالَ مَالِكٌ وَهُوَ الأَمْرُ عِنْدَنَا ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا أَنْ لاَ تُبَاعَ الْحِنْطَةُ بِالْحِنْطَةِ وَلاَ التَّمْرُ بِالتَّمْرِ وَلاَ الْحِنْطَةُ بِالتَّمْرِ وَلاَ التَّمْرُ بِالزَّبِيبِ وَلاَ الْحِنْطَةُ بِالزَّبِيبِ وَلاَ شَىْءٌ مِنَ الطَّعَامِ كُلِّهِ إِلاَّ يَدًا بِيَدٍ فَإِنْ دَخَلَ شَيْئًا مِنْ ذَلِكَ الأَجَلُ لَمْ يَصْلُحْ وَكَانَ حَرَامًا وَلاَ شَىْءَ مِنَ الأُدْمِ كُلِّهَا إِلاَّ يَدًا بِيَدٍ ‏.‏ قَالَ مَالِكٌ وَلاَ يُبَاعُ شَىْءٌ مِنَ الطَّعَامِ وَالأُدْمِ إِذَا كَانَ مِنْ صِنْفٍ وَاحِدٍ اثْنَانِ بِوَاحِدٍ فَلاَ يُبَاعُ مُدُّ حِنْطَةٍ بِمُدَّىْ حِنْطَةٍ وَلاَ مُدُّ تَمْرٍ بِمُدَّىْ تَمْرٍ وَلاَ مُدُّ زَبِيبٍ بِمُدَّىْ زَبِيبٍ وَلاَ مَا أَشْبَهَ ذَلِكَ مِنَ الْحُبُوبِ وَالأُدْمِ كُلِّهَا إِذَا كَانَ مِنْ صِنْفٍ وَاحِدٍ وَإِنْ كَانَ يَدًا بِيَدٍ إِنَّمَا ذَلِكَ بِمَنْزِلَةِ الْوَرِقِ بِالْوَرِقِ وَالذَّهَبِ بِالذَّهَبِ لاَ يَحِلُّ فِي شَىْءٍ مِنْ ذَلِكَ الْفَضْلُ وَلاَ يَحِلُّ إِلاَّ مِثْلاً بِمِثْلٍ يَدًا بِيَدٍ ‏.‏ قَالَ مَالِكٌ وَإِذَا اخْتَلَفَ مَا يُكَالُ أَوْ يُوزَنُ مِمَّا يُؤْكَلُ أَوْ يُشْرَبُ فَبَانَ اخْتِلاَفُهُ فَلاَ بَأْسَ أَنْ يُؤْخَذَ مِنْهُ اثْنَانِ بِوَاحِدٍ يَدًا بِيَدٍ وَلاَ بَأْسَ أَنْ يُؤْخَذَ صَاعٌ مِنْ تَمْرٍ بِصَاعَيْنِ مِنْ حِنْطَةٍ وَصَاعٌ مِنْ تَمْرٍ بِصَاعَيْنِ مِنْ زَبِيبٍ وَصَاعٌ مِنْ حِنْطَةٍ بِصَاعَيْنِ مِنْ سَمْنٍ فَإِذَا كَانَ الصِّنْفَانِ مِنْ هَذَا مُخْتَلِفَيْنِ فَلاَ بَأْسَ بِاثْنَيْنِ مِنْهُ بِوَاحِدٍ أَوْ أَكْثَرَ مِنْ ذَلِكَ يَدًا بِيَدٍ فَإِنْ دَخَلَ ذَلِكَ الأَجَلُ فَلاَ يَحِلُّ ‏.‏ قَالَ مَالِكٌ وَلاَ تَحِلُّ صُبْرَةُ الْحِنْطَةِ بِصُبْرَةِ الْحِنْطَةِ وَلاَ بَأْسَ بِصُبْرَةِ الْحِنْطَةِ بِصُبْرَةِ التَّمْرِ يَدًا بِيَدٍ وَذَلِكَ أَنَّهُ لاَ بَأْسَ أَنْ يُشْتَرَى الْحِنْطَةُ بِالتَّمْرِ جِزَافًا ‏.‏ قَالَ مَالِكٌ وَكُلُّ مَا اخْتَلَفَ مِنَ الطَّعَامِ وَالأُدْمِ فَبَانَ اخْتِلاَفُهُ فَلاَ بَأْسَ أَنْ يُشْتَرَى بَعْضُهُ بِبَعْضٍ جِزَافًا يَدًا بِيَدٍ فَإِنْ دَخَلَهُ الأَجَلُ فَلاَ خَيْرَ فِيهِ وَإِنَّمَا اشْتِرَاءُ ذَلِكَ جِزَافًا كَاشْتِرَاءِ بَعْضِ ذَلِكَ بِالذَّهَبِ وَالْوَرِقِ جِزَافًا ‏.‏ قَالَ مَالِكٌ وَذَلِكَ أَنَّكَ تَشْتَرِي الْحِنْطَةَ بِالْوَرِقِ جِزَافًا وَالتَّمْرَ بِالذَّهَبِ جِزَافًا فَهَذَا حَلاَلٌ لاَ بَأْسَ بِهِ ‏.‏ قَالَ مَالِكٌ وَمَنْ صَبَّرَ صُبْرَةَ طَعَامٍ وَقَدْ عَلِمَ كَيْلَهَا ثُمَّ بَاعَهَا جِزَافًا وَكَتَمَ الْمُشْتَرِي كَيْلَهَا فَإِنَّ ذَلِكَ لاَ يَصْلُحُ فَإِنْ أَحَبَّ الْمُشْتَرِي أَنْ يَرُدَّ ذَلِكَ الطَّعَامَ عَلَى الْبَائِعِ رَدَّهُ بِمَا كَتَمَهُ كَيْلَهُ وَغَرَّهُ وَكَذَلِكَ كُلُّ مَا عَلِمَ الْبَائِعُ كَيْلَهُ وَعَدَدَهُ مِنَ الطَّعَامِ وَغَيْرِهِ ثُمَّ بَاعَهُ جِزَافًا وَلَمْ يَعْلَمِ الْمُشْتَرِي ذَلِكَ فَإِنَّ الْمُشْتَرِيَ إِنْ أَحَبَّ أَنْ يَرُدَّ ذَلِكَ عَلَى الْبَائِعِ رَدَّهُ وَلَمْ يَزَلْ أَهْلُ الْعِلْمِ يَنْهَوْنَ عَنْ ذَلِكَ ‏.‏ قَالَ مَالِكٌ وَلاَ خَيْرَ فِي الْخُبْزِ قُرْصٍ بِقُرْصَيْنِ وَلاَ عَظِيمٍ بِصَغِيرٍ إِذَا كَانَ بَعْضُ ذَلِكَ أَكْبَرَ مِنْ بَعْضٍ فَأَمَّا إِذَا كَانَ يَتَحَرَّى أَنْ يَكُونَ مِثْلاً بِمِثْلٍ فَلاَ بَأْسَ بِهِ وَإِنْ لَمْ يُوزَنْ ‏.‏ قَالَ مَالِكٌ لاَ يَصْلُحُ مُدُّ زُبْدٍ وَمُدُّ لَبَنٍ بِمُدَّىْ زُبْدٍ وَهُوَ مِثْلُ الَّذِي وَصَفْنَا مِنَ التَّمْرِ الَّذِي يُبَاعُ صَاعَيْنِ مِنْ كَبِيسٍ وَصَاعًا مِنْ حَشَفٍ بِثَلاَثَةِ أَصْوُعٍ مِنْ عَجْوَةٍ حِينَ قَالَ لِصَاحِبِهِ إِنَّ صَاعَيْنِ مِنْ كَبِيسٍ بِثَلاَثَةِ أَصْوُعٍ مِنَ الْعَجْوَةِ لاَ يَصْلُحُ ‏.‏ فَفَعَلَ ذَلِكَ لِيُجِيزَ بَيْعَهُ وَإِنَّمَا جَعَلَ صَاحِبُ اللَّبَنِ اللَّبَنَ مَعَ زُبْدِهِ لِيَأْخُذَ فَضْلَ زُبْدِهِ عَلَى زُبْدِ صَاحِبِهِ حِينَ أَدْخَلَ مَعَهُ اللَّبَنَ ‏.‏ قَالَ مَالِكٌ وَالدَّقِيقُ بِالْحِنْطَةِ مِثْلاً بِمِثْلٍ لاَ بَأْسَ بِهِ وَذَلِكَ لأَنَّهُ أَخْلَصَ الدَّقِيقَ فَبَاعَهُ بِالْحِنْطَةِ مِثْلاً بِمِثْلٍ وَلَوْ جَعَلَ نِصْفَ الْمُدِّ مِنْ دَقِيقٍ وَنِصْفَهُ مِنْ حِنْطَةٍ فَبَاعَ ذَلِكَ بِمُدٍّ مِنْ حِنْطَةٍ كَانَ ذَلِكَ مِثْلَ الَّذِي وَصَفْنَا لاَ يَصْلُحُ لأَنَّهُ إِنَّمَا أَرَادَ أَنْ يَأْخُذَ فَضْلَ حِنْطَتِهِ الْجَيِّدَةِ حَتَّى جَعَلَ مَعَهَا الدَّقِيقَ فَهَذَا لاَ يَصْلُحُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard the same as that\nfrom al-Qasim ibn Muhammad from Ibn Muayqib ad-Dawsi.\n\n\nMalik\nsaid, \"This is the way of doing things among us . \"\n\n\nMalik\nsaid, \"The generally agreed on way of doing things among us is that\nwheat is not sold for wheat, dates for dates, wheat for dates, dates\nfor raisins, wheat for raisins, nor any kind of food sold for food at\nall, except from hand to hand. If there is any sort of delayed terms\nin the transaction, it is not good. It is haram. Condiments are not\nbartered except from hand to hand.\"\n\n\nMalik said, \"Food and\ncondiments are not bartered when they are the same type, two of one\nkind for one of the other. A mudd of wheat is not sold for two mudds\nof wheat, nor a mudd of dates for two mudds of dates, nor a mudd of\nraisins for two mudds of raisins, nor is anything of that sort done\nwith grains and condiments when they are of one kind, even if it is\nhand to hand.\n\n\n\"This is the same position as silver for silver\nand gold for gold. No increase is halal in the transaction, and only\nlike for like, from hand to hand is halal.\"\n\n\nMalik said, \"If\nthere is a clear difference in foodstuffs which are measured and\nweighed, there is no harm in taking two of one kind for one of\nanother, hand to hand. There is no harm in taking a sa of dates for\ntwo sa of wheat, and a sa of dates for two sa of raisins, and a sa of\nwheat for two sa of ghee. If the two sorts in the transaction are\ndifferent, there is no harm in two for one or more than that from hand\nto hand. If delayed terms enter into the sale, it is not halal .\"\n\n\nMalik said, \"It is not halal to trade a heap of wheat for a heap\nof wheat. There is no harm in a heap of wheat for a heap of dates,\nfrom hand to hand. That is because there is no harm in buying wheat\nwith dates without precise measurement.\"\n\n\nMalik said, \"With\nkinds of foods and condiments that differ from each other, and the\ndifference is clear, there is no harm in bartering one kind for\nanother, without precise measurement from hand to hand. If delayed\nterms enter into the sale, there is no good in it. Bartering such\nthings without precise measurement is like buying it with gold and\nsilver without measuring precisely.\"\n\n\nMalik said, \"That is\nbecause you buy wheat with silver without measuring precisely, and\ndates with gold without measuring precisely, and it is halal. There is\nno harm in it.\"\n\n\nMalik said, \"It is not good for someone to\nmake a heap of food, knowing its measure and then to sell it as if it\nhad not been measured precisely, concealing its measure from the\nbuyer. If the buyer wants to return that food to the seller, he can,\nbecause he concealed its measure and so it is an uncertain\ntransaction. This is done with any kind of food or other goods whose\nmeasure and number the seller knows, and which he then sells without\nmeasurement and the buyer does not know that. If the buyer wants to\nreturn that to the seller, he can return t. The people of knowledge\nstill forbid such a transaction.\"\n\n\nMalik said, \"There is no\ngood in selling one round loaf of bread for two round loaves, nor\nlarge for small when some of them are bigger than others. When care is\ntaken that they are like for like, there is no harm in the sale, even\nif they are not weighed.\"\n\n\nMalik said, \"It is not good to sell\na mudd of butter and a mudd of milk for two mudds of butter. This is\nlike what we described of selling dates when two sa of kabis and a sa\nof poor quality dates were sold for three sa of ajwa dates after the\nbuyer had said to the seller, 'Two sa of kabis dates for three sa of\najwa dates is not good,' and then he did that to make the transaction\npossible. The owner of the milk puts the milk with his butter so that\nhe can use the superiority of his butter over the butter of the other\nparty to put his milk in with it.\"\n\n\nMalik said, \"Flour for\nwheat is like for like, and there is no harm in that. That is if he\ndoes not mix up anything with the flour and sell it for wheat, like\nfor like. Had he put half a mudd of flour and half of wheat, and then\nsold that for a mudd of wheat, it would be like what we described, and\nit would not be good because he would want to use the superiority of\nhis good wheat to put flour along with it. Such a transaction is not\ngood.\""}},{"id":55,"idInBook":55,"chapterId":31,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي مَرْيَمَ، أَنَّهُ سَأَلَ سَعِيدَ بْنَ الْمُسَيَّبِ فَقَالَ إِنِّي رَجُلٌ أَبْتَاعُ الطَّعَامَ يَكُونُ مِنَ الصُّكُوكِ بِالْجَارِ فَرُبَّمَا ابْتَعْتُ مِنْهُ بِدِينَارٍ وَنِصْفِ دِرْهَمٍ فَأُعْطَى بِالنِّصْفِ طَعَامًا ‏.‏ فَقَالَ سَعِيدٌ لاَ وَلَكِنْ أَعْطِ أَنْتَ دِرْهَمًا وَخُذْ بَقِيَّتَهُ طَعَامًا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Muhammad ibn Abdullah ibn Abi\nMaryam asked Said ibn al-Musayyab's advice. \"I am a man who buys food\nwith receipts from al-Jar. Perhaps I will buy something for a dinar\nand half a dirham, and will be given food for a half.\" Said said, \"No.\nYou give a dirham, and take the rest in food.\" (A half dirham did not\nexist as a coin.)"}},{"id":56,"idInBook":56,"chapterId":31,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ مُحَمَّدَ بْنَ سِيرِينَ، كَانَ يَقُولُ لاَ تَبِيعُوا الْحَبَّ فِي سُنْبُلِهِ حَتَّى يَبْيَضَّ ‏.‏ قَالَ مَالِكٌ مَنِ اشْتَرَى طَعَامًا بِسِعْرٍ مَعْلُومٍ إِلَى أَجَلٍ مُسَمًّى فَلَمَّا حَلَّ الأَجَلُ قَالَ الَّذِي عَلَيْهِ الطَّعَامُ لِصَاحِبِهِ لَيْسَ عِنْدِي طَعَامٌ فَبِعْنِي الطَّعَامَ الَّذِي لَكَ عَلَىَّ إِلَى أَجَلٍ ‏.‏ فَيَقُولُ صَاحِبُ الطَّعَامِ هَذَا لاَ يَصْلُحُ لأَنَّهُ قَدْ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ بَيْعِ الطَّعَامِ حَتَّى يُسْتَوْفَى ‏.‏ فَيَقُولُ الَّذِي عَلَيْهِ الطَّعَامُ لِغَرِيمِهِ فَبِعْنِي طَعَامًا إِلَى أَجَلٍ حَتَّى أَقْضِيَكَهُ ‏.‏ فَهَذَا لاَ يَصْلُحُ لأَنَّهُ إِنَّمَا يُعْطِيهِ طَعَامًا ثُمَّ يَرُدُّهُ إِلَيْهِ ‏.‏ فَيَصِيرُ الذَّهَبُ الَّذِي أَعْطَاهُ ثَمَنَ الَّذِي كَانَ لَهُ عَلَيْهِ وَيَصِيرُ الطَّعَامُ الَّذِي أَعْطَاهُ مُحَلَّلاً فِيمَا بَيْنَهُمَا وَيَكُونُ ذَلِكَ إِذَا فَعَلاَهُ بَيْعَ الطَّعَامِ قَبْلَ أَنْ يُسْتَوْفَى ‏.‏ قَالَ مَالِكٌ فِي رَجُلٍ لَهُ عَلَى رَجُلٍ طَعَامٌ ابْتَاعَهُ مِنْهُ وَلِغَرِيمِهِ عَلَى رَجُلٍ طَعَامٌ مِثْلُ ذَلِكَ الطَّعَامِ فَقَالَ الَّذِي عَلَيْهِ الطَّعَامُ لِغَرِيمِهِ أُحِيلُكَ عَلَى غَرِيمٍ لِي عَلَيْهِ مِثْلُ الطَّعَامِ الَّذِي لَكَ عَلَىَّ بِطَعَامِكَ الَّذِي لَكَ عَلَىَّ ‏.‏ قَالَ مَالِكٌ إِنْ كَانَ الَّذِي عَلَيْهِ الطَّعَامُ إِنَّمَا هُوَ طَعَامٌ ابْتَاعَهُ فَأَرَادَ أَنْ يُحِيلَ غَرِيمَهُ بِطَعَامٍ ابْتَاعَهُ فَإِنَّ ذَلِكَ لاَ يَصْلُحُ وَذَلِكَ بَيْعُ الطَّعَامِ قَبْلَ أَنْ يُسْتَوْفَى فَإِنْ كَانَ الطَّعَامُ سَلَفًا حَالاًّ فَلاَ بَأْسَ أَنْ يُحِيلَ بِهِ غَرِيمَهُ لأَنَّ ذَلِكَ لَيْسَ بِبَيْعٍ وَلاَ يَحِلُّ بَيْعُ الطَّعَامِ قَبْلَ أَنْ يُسْتَوْفَى لِنَهْىِ رَسُولِ اللَّهِ صلى الله عليه وسلم عَنْ ذَلِكَ غَيْرَ أَنَّ أَهْلَ الْعِلْمِ قَدِ اجْتَمَعُوا عَلَى أَنَّهُ لاَ بَأْسَ بِالشِّرْكِ وَالتَّوْلِيَةِ وَالإِقَالَةِ فِي الطَّعَامِ وَغَيْرِهِ ‏.‏ قَالَ مَالِكٌ وَذَلِكَ أَنَّ أَهْلَ الْعِلْمِ أَنْزَلُوهُ عَلَى وَجْهِ الْمَعْرُوفِ وَلَمْ يُنْزِلُوهُ عَلَى وَجْهِ الْبَيْعِ وَذَلِكَ مِثْلُ الرَّجُلِ يُسَلِّفُ الدَّرَاهِمَ النُّقَّصَ فَيُقْضَى دَرَاهِمَ وَازِنَةً فِيهَا فَضْلٌ فَيَحِلُّ لَهُ ذَلِكَ وَيَجُوزُ وَلَوِ اشْتَرَى مِنْهُ دَرَاهِمَ نُقَّصًا بِوَازِنَةٍ لَمْ يَحِلَّ ذَلِكَ وَلَوِ اشْتَرَطَ عَلَيْهِ حِينَ أَسْلَفَهُ وَازِنَةً وَإِنَّمَا أَعْطَاهُ نُقَّصًا لَمْ يَحِلَّ لَهُ ذَلِكَ ‏.‏ قَالَ مَالِكٌ وَمِمَّا يُشْبِهُ ذَلِكَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ الْمُزَابَنَةِ وَأَرْخَصَ فِي بَيْعِ الْعَرَايَا بِخَرْصِهَا مِنَ التَّمْرِ وَإِنَّمَا فُرِقَ بَيْنَ ذَلِكَ أَنَّ بَيْعَ الْمُزَابَنَةِ بَيْعٌ عَلَى وَجْهِ الْمُكَايَسَةِ وَالتِّجَارَةِ وَأَنَّ بَيْعَ الْعَرَايَا عَلَى وَجْهِ الْمَعْرُوفِ لاَ مُكَايَسَةَ فِيهِ ‏.‏ قَالَ مَالِكٌ وَلاَ يَنْبَغِي أَنْ يَشْتَرِيَ رَجُلٌ طَعَامًا بِرُبُعٍ أَوْ ثُلُثٍ أَوْ كِسْرٍ مِنْ دِرْهَمٍ عَلَى أَنْ يُعْطَى بِذَلِكَ طَعَامًا إِلَى أَجَلٍ وَلاَ بَأْسَ أَنْ يَبْتَاعَ الرَّجُلُ طَعَامًا بِكِسْرٍ مِنْ دِرْهَمٍ إِلَى أَجَلٍ ثُمَّ يُعْطَى دِرْهَمًا وَيَأْخُذُ بِمَا بَقِيَ لَهُ مِنْ دِرْهَمِهِ سِلْعَةً مِنَ السِّلَعِ لأَنَّهُ أَعْطَى الْكِسْرَ الَّذِي عَلَيْهِ فِضَّةً وَأَخَذَ بِبَقِيَّةِ دِرْهَمِهِ سِلْعَةً فَهَذَا لاَ بَأْسَ بِهِ ‏.‏ قَالَ مَالِكٌ وَلاَ بَأْسَ أَنْ يَضَعَ الرَّجُلُ عِنْدَ الرَّجُلِ دِرْهَمًا ثُمَّ يَأْخُذُ مِنْهُ بِرُبُعٍ أَوْ بِثُلُثٍ أَوْ بِكِسْرٍ مَعْلُومٍ سِلْعَةً مَعْلُومَةً فَإِذَا لَمْ يَكُنْ فِي ذَلِكَ سِعْرٌ مَعْلُومٌ وَقَالَ الرَّجُلُ آخُذُ مِنْكَ بِسِعْرِ كُلِّ يَوْمٍ فَهَذَا لاَ يَحِلُّ لأَنَّهُ غَرَرٌ يَقِلُّ مَرَّةً وَيَكْثُرُ مَرَّةً وَلَمْ يَفْتَرِقَا عَلَى بَيْعٍ مَعْلُومٍ ‏.‏ قَالَ مَالِكٌ وَمَنْ بَاعَ طَعَامًا جِزَافًا وَلَمْ يَسْتَثْنِ مِنْهُ شَيْئًا ثُمَّ بَدَا لَهُ أَنْ يَشْتَرِيَ مِنْهُ شَيْئًا فَإِنَّهُ لاَ يَصْلُحُ لَهُ أَنْ يَشْتَرِيَ مِنْهُ شَيْئًا إِلاَّ مَا كَانَ يَجُوزُ لَهُ أَنْ يَسْتَثْنِيَ مِنْهُ وَذَلِكَ الثُّلُثُ فَمَا دُونَهُ فَإِنْ زَادَ عَلَى الثُّلُثِ صَارَ ذَلِكَ إِلَى الْمُزَابَنَةِ وَإِلَى مَا يُكْرَهُ فَلاَ يَنْبَغِي لَهُ أَنْ يَشْتَرِيَ مِنْهُ شَيْئًا إِلاَّ مَا كَانَ يَجُوزُ لَهُ أَنْ يَسْتَثْنِيَ مِنْهُ وَلاَ يَجُوزُ لَهُ أَنْ يَسْتَثْنِيَ مِنْهُ إِلاَّ الثُّلُثَ فَمَا دُونَهُ وَهَذَا الأَمْرُ الَّذِي لاَ اخْتِلاَفَ فِيهِ عِنْدَنَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Muhammad\nSirin used to say, \"Do not sell grain on the ears until it is white.\"\n\n\nMalik said, \"If someone buys food for a known price to be\ndelivered at a stated date, and when the date comes, the one who owes\nthe food says, 'I do not have any food, sell me the food which I owe\nyou with delayed terms.' The owner of the food says, 'This is not\ngood, because the Messenger of Allah, may Allah bless him and grant\nhim peace, forbade selling food until the deal was completed.' The one\nwho owes the food says to his creditor, 'Sell me any kind of food on\ndelayed terms until I discharge the debt to you.' This is not good\nbecause he gives him food and then he returns it to him. The gold\nwhich he gave him becomes the price of that which is his right against\nhim and the food which he gave him becomes what clears what is between\nthem. If they do that, it becomes the sale of food before the deal is\ncomplete.\"\n\n\nMalik spoke about a man who was owed food which he\nhad purchased from a man and this man was owed the like of that food\nby another man. The one who owed the food said to his creditor, \"I\nwill refer you to my debtor who owes me the same amount of food as I\nowe you, so that you may obtain the food which I owe you .\"\n\n\nMalik said, \"If the man who had to deliver the food, had gone out, and\nbought the food to pay off his creditor, that is not good. That is\nselling food before taking possession of it. If the food is an advance\nwhich falls due at that particular time, there is no harm in paying\noff his creditor with it because that is nota sale. It is not halal to\nsell food before receiving it in full since the Messenger of Allah,\nmay Allah bless him and grant him peace, forbade that. However, the\npeople of knowledge agree that there is no harm in partnership,\ntransfer of responsibility and revocation in sales of food and other\ngoods.\"\n\n\nMalik said, \"That is because the people of knowledge\nconsider it as a favour rendered. They do not consider it as a sale.\nIt is like a man lending light dirhams. He is then paid back in\ndirhams of full weight, and so gets back more than he lent. That is\nhalal for him and permitted. Had a man bought defective dirhams from\nhim as being the full weight, that would not be halal. Had it been\nstipulated to him that he lend full weight in dirhams, and then he\ngave faulty ones, that would not be halal for him.\""}},{"id":57,"idInBook":57,"chapterId":31,"bookId":7,"arabic":"","english":{"narrator":"","text":"Malik said, \"Another example of that is that the Messenger of\nAllah, may Allah bless him and grant him peace, forbade the sale\ncalled muzabana and granted an indulgence in the ariya for computing\nthe equivalent in dates. It was distinguished between them that the\nmuzabana-sale was based on shrewdness and trade, and the ariya sale\nwas based on a favour rendered, and there was no shrewdness in it.\"\n\n\nMalik said, \"A man must not buy food for a fourth, a third,\nor a fraction of a dirham on the basis that he be given that food on\ncredit. There is no harm in a man buying food for a fraction of a\ndirham on credit and then he gives a dirham and takes goods with what\nremains of his dirham because he gave the fraction he owed as silver,\nand took goods to make up the rest of his dirham. There is no harm in\nthat transaction.\"\n\n\nMalik said, \"There is no harm in a man\nplacing a dirham with another man and then taking from him known goods\nfor a fourth, third, or a known fraction. If there was not a known\nprice on the goods and the man said, 'I will take them from you for\nthe price of each day,' this is not halal because there is\nuncertainty. It might be less one time, and more another time, and\nthey would not part with a known sale.\"\n\n\nMalik said, \"If\nsomeone sells some food without measuring precisely and does not\nexclude any of it from the sale and then it occurs to him to buy some\nof it, it is not good for him to buy any of it except what it would be\npermitted for him to exclude from it. That is a third or less. If it\nis more than a third, it becomes muzabana and is disapproved. He must\nonly purchase from what he would be permitted to exclude, and he is\nonly permitted to exclude a third or less than that. This is the way\nof doing things in which there is no dispute with us.\""}},{"id":58,"idInBook":58,"chapterId":31,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ لاَ حُكْرَةَ فِي سُوقِنَا لاَ يَعْمِدُ رِجَالٌ بِأَيْدِيهِمْ فُضُولٌ مِنْ أَذْهَابٍ إِلَى رِزْقٍ مِنْ رِزْقِ اللَّهِ نَزَلَ بِسَاحَتِنَا فَيَحْتَكِرُونَهُ عَلَيْنَا وَلَكِنْ أَيُّمَا جَالِبٍ جَلَبَ عَلَى عَمُودِ كَبِدِهِ فِي الشِّتَاءِ وَالصَّيْفِ فَذَلِكَ ضَيْفُ عُمَرَ فَلْيَبِعْ كَيْفَ شَاءَ اللَّهُ وَلْيُمْسِكْ كَيْفَ شَاءَ اللَّهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Umar ibn\nal-Khattab said, \"There is no hoarding in our market, and men who have\nexcess gold in their hands should not buy up one of Allah's provisions\nwhich he has sent to our courtyard and then hoard it up against us.\nSomeone who brings imported goods through great fatigue to himself in\nthe summer and winter, that person is the guest of Umar. Let him sell\nwhat Allah wills and keep what Allah wills.\""}},{"id":59,"idInBook":59,"chapterId":31,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يُونُسَ بْنِ يُوسُفَ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، مَرَّ بِحَاطِبِ بْنِ أَبِي بَلْتَعَةَ وَهُوَ يَبِيعُ زَبِيبًا لَهُ بِالسُّوقِ فَقَالَ لَهُ عُمَرُ بْنُ الْخَطَّابِ إِمَّا أَنْ تَزِيدَ فِي السِّعْرِ وَإِمَّا أَنْ تُرْفَعَ مِنْ سُوقِنَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yunus ibn Yusuf from Said ibn\nal-Musayyab that Umar ibn al-Khattab passed by Hatab ibn Abi Baltaa\nwho was underselling some of his raisins in the market. Umar ibn al-\nKhattab said to him, \"Either increase the price or leave our market.\""}},{"id":60,"idInBook":60,"chapterId":31,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عُثْمَانَ بْنَ عَفَّانَ، كَانَ يَنْهَى عَنِ الْحُكْرَةِ، ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Uthman ibn\nAffan forbade hoarding ."}},{"id":61,"idInBook":61,"chapterId":31,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ صَالِحِ بْنِ كَيْسَانَ، عَنْ حَسَنِ بْنِ مُحَمَّدِ بْنِ عَلِيِّ بْنِ أَبِي طَالِبٍ، أَنَّ عَلِيَّ بْنَ أَبِي طَالِبٍ، بَاعَ جَمَلاً لَهُ يُدْعَى عُصَيْفِيرًا بِعِشْرِينَ بَعِيرًا إِلَى أَجَلٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Salih ibn Kaysan from Hasan\nibn Muhammad ibn Ali ibn Abi Talib that Ali ibn Abi Talib sold one of\nhis camels called Usayfir for 20 camels to be delivered later."}},{"id":62,"idInBook":62,"chapterId":31,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، اشْتَرَى رَاحِلَةً بِأَرْبَعَةِ أَبْعِرَةٍ مَضْمُونَةٍ عَلَيْهِ يُوفِيهَا صَاحِبَهَا بِالرَّبَذَةِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nbought a female riding-camel for four camels and he guaranteed to give\nthem in full to the buyer at ar-Rabadha."}},{"id":63,"idInBook":63,"chapterId":31,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ سَأَلَ ابْنَ شِهَابٍ عَنْ بَيْعٍ الْحَيَوَانِ، اثْنَيْنِ بِوَاحِدٍ إِلَى أَجَلٍ فَقَالَ لاَ بَأْسَ بِذَلِكَ ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا أَنَّهُ لاَ بَأْسَ بِالْجَمَلِ بِالْجَمَلِ مِثْلِهِ وَزِيَادَةِ دَرَاهِمَ يَدًا بِيَدٍ وَلاَ بَأْسَ بِالْجَمَلِ بِالْجَمَلِ مِثْلِهِ وَزِيَادَةِ دَرَاهِمَ الْجَمَلُ بِالْجَمَلِ يَدًا بِيَدٍ وَالدَّرَاهِمُ إِلَى أَجَلٍ ‏.‏ قَالَ وَلاَ خَيْرَ فِي الْجَمَلِ بِالْجَمَلِ مِثْلِهِ وَزِيَادَةِ دَرَاهِمَ الدَّرَاهِمُ نَقْدًا وَالْجَمَلُ إِلَى أَجَلٍ وَإِنْ أَخَّرْتَ الْجَمَلَ وَالدَّرَاهِمَ لاَ خَيْرَ فِي ذَلِكَ أَيْضًا ‏.‏ قَالَ مَالِكٌ وَلاَ بَأْسَ أَنْ يَبْتَاعَ الْبَعِيرَ النَّجِيبَ بِالْبَعِيرَيْنِ أَوْ بِالأَبْعِرَةِ مِنَ الْحَمُولَةِ مِنْ مَاشِيَةِ الإِبِلِ وَإِنْ كَانَتْ مِنْ نَعَمٍ وَاحِدَةٍ فَلاَ بَأْسَ أَنْ يُشْتَرَى مِنْهَا اثْنَانِ بِوَاحِدٍ إِلَى أَجَلٍ إِذَا اخْتَلَفَتْ فَبَانَ اخْتِلاَفُهَا وَإِنْ أَشْبَهَ بَعْضُهَا بَعْضًا وَاخْتَلَفَتْ أَجْنَاسُهَا أَوْ لَمْ تَخْتَلِفْ فَلاَ يُؤْخَذُ مِنْهَا اثْنَانِ بِوَاحِدٍ إِلَى أَجَلٍ ‏.‏ قَالَ مَالِكٌ وَتَفْسِيرُ مَا كُرِهَ مِنْ ذَلِكَ أَنْ يُؤْخَذَ الْبَعِيرُ بِالْبَعِيرَيْنِ لَيْسَ بَيْنَهُمَا تَفَاضُلٌ فِي نَجَابَةٍ وَلاَ رِحْلَةٍ فَإِذَا كَانَ هَذَا عَلَى مَا وَصَفْتُ لَكَ فَلاَ يُشْتَرَى مِنْهُ اثْنَانِ بِوَاحِدٍ إِلَى أَجَلٍ وَلاَ بَأْسَ أَنْ تَبِيعَ مَا اشْتَرَيْتَ مِنْهَا قَبْلَ أَنْ تَسْتَوْفِيَهُ مِنْ غَيْرِ الَّذِي اشْتَرَيْتَهُ مِنْهُ إِذَا انْتَقَدْتَ ثَمَنَهُ ‏.‏ قَالَ مَالِكٌ وَمَنْ سَلَّفَ فِي شَىْءٍ مِنَ الْحَيَوَانِ إِلَى أَجَلٍ مُسَمًّى فَوَصَفَهُ وَحَلاَّهُ وَنَقَدَ ثَمَنَهُ فَذَلِكَ جَائِزٌ وَهُوَ لاَزِمٌ لِلْبَائِعِ وَالْمُبْتَاعِ عَلَى مَا وَصَفَا وَحَلَّيَا وَلَمْ يَزَلْ ذَلِكَ مِنْ عَمَلِ النَّاسِ الْجَائِزِ بَيْنَهُمْ وَالَّذِي لَمْ يَزَلْ عَلَيْهِ أَهْلُ الْعِلْمِ بِبَلَدِنَا ‏.‏","english":{"narrator":"","text":"Yahya related to me that Malik asked Ibn Shihab about selling\nanimals, two for one with delayed terms. He said, \"There is no harm in\nit.\"\n\n\nMalik said, \"The generally agreed on way of doing things\namong us is that there is no harm in bartering a camel for a camel\nlike it and adding some dirhams to the exchange, from hand to hand.\nThere is no harm in bartering a camel for a camel like it with some\ndirhams on top of the exchange, the camels to be exchanged from hand\nto hand, and the dirhams to be paid within a period.\" He said, \"There\nis no good however in bartering a camel for a camel like it with some\ndirhams on top of it, with the dirhams paid in cash and the camel to\nbe delivered later. If both the camel and the dirhams are deferred\nthere is no good in that either.\"\n\n\nMalik said, \"There is no\nharm in buying a riding camel with two or more pack-camels, if they\nare from inferior stock. There is no harm in bartering two of them for\none with delayed terms, if they are different and their difference is\nclear. If they resemble each other whether their species are different\nor not, two are not to be taken for one with delayed terms.\"\n\n\nMalik said, \"The explanation of what is disapproved of in that, is\nthat a camel should not be bought with two camels when there is no\ndistinction between them in speed or hardiness. If this is according\nto what I have described to you, then one does not buy two of them for\none with delayed terms. There is no harm in selling those of them you\nbuy before you complete the deal to somebody other than the one from\nwhom you bought them if you get the price in cash.\"\n\n\nMalik\nsaid, \"It is permitted for someone to advance something on animals for\na fixed term and describe the amount and pay its price in cash.\nWhatever the buyer and seller have described is obliged for them. That\nis still permitted behaviour between people and what the people of\nknowledge in our land do.\""}},{"id":64,"idInBook":64,"chapterId":31,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ حَبَلِ الْحَبَلَةِ ‏.‏ وَكَانَ بَيْعًا يَتَبَايَعُهُ أَهْلُ الْجَاهِلِيَّةِ كَانَ الرَّجُلُ يَبْتَاعُ الْجَزُورَ إِلَى أَنْ تُنْتَجَ النَّاقَةُ ‏.‏ ثُمَّ تُنْتَجَ الَّتِي فِي بَطْنِهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malih from Nafi from Abdullah ibn Umar\nthat the Messenger of Allah, may Allah bless him and grant him peace,\nforbade the transaction called habal alhabala. It was a transaction\nwhich the people of Jahiliya practised. A man would buy the unborn\noffspring of the unborn offspring of a she-camel."}},{"id":65,"idInBook":65,"chapterId":31,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ قَالَ لاَ رِبًا فِي الْحَيَوَانِ وَإِنَّمَا نُهِيَ مِنَ الْحَيَوَانِ عَنْ ثَلاَثَةٍ عَنِ الْمَضَامِينِ وَالْمَلاَقِيحِ وَحَبَلِ الْحَبَلَةِ ‏.‏ وَالْمَضَامِينُ بَيْعُ مَا فِي بُطُونِ إِنَاثِ الإِبِلِ وَالْمَلاَقِيحُ بَيْعُ مَا فِي ظُهُورِ الْجِمَالِ ‏.‏ قَالَ مَالِكٌ لاَ يَنْبَغِي أَنْ يَشْتَرِيَ أَحَدٌ شَيْئًا مِنَ الْحَيَوَانِ بِعَيْنِهِ إِذَا كَانَ غَائِبًا عَنْهُ وَإِنْ كَانَ قَدْ رَآهُ وَرَضِيَهُ عَلَى أَنْ يَنْقُدَ ثَمَنَهُ لاَ قَرِيبًا وَلاَ بَعِيدًا ‏.‏ قَالَ مَالِكٌ وَإِنَّمَا كُرِهَ ذَلِكَ لأَنَّ الْبَائِعَ يَنْتَفِعُ بِالثَّمَنِ وَلاَ يُدْرَى هَلْ تُوجَدُ تِلْكَ السِّلْعَةُ عَلَى مَا رَآهَا الْمُبْتَاعُ أَمْ لاَ فَلِذَلِكَ كُرِهَ ذَلِكَ وَلاَ بَأْسَ بِهِ إِذَا كَانَ مَضْمُونًا مَوْصُوفًا ‏.‏","english":{"narrator":"Yahya related to me from Malik from Ibn Shihab that Said ibn al-\nMusayyab said, \"There is no usury in animals. There are three things\nforbidden in animals:","text":"al-madamin, al-malaqih and habal al-habala. Al-\nmadamin is the sale of what is in the wombs of female camels. Al-\nmalaqih is the sale of the breeding qualities of camels\" (i.e. for\nstud).\n\n\nMalik said, \"No one should buy a specified animal when\nit is concealed from him or in another place, even if he has already\nseen it, very recently or not so recently, and was pleased enough with\nit to pay its price in cash.\"\n\n\nMalik said, \"That is\ndisapproved of because the seller makes use of the price and it is not\nknown whether or not those goods are found to be as the buyer saw them\nor not. For that reason, it is disapproved of. There is no harm in it\nif it is described and guaranteed.\""}},{"id":66,"idInBook":66,"chapterId":31,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ رَسُولَ اللَّهِ","english":{"narrator":"","text":"Yahya related to me from Malik from Zayd ibn Aslam from Said ibn\nal-Musayyab that the Messenger of Allah, may Allah bless him and grant\nhim peace, forbade bartering live animals for meat."}},{"id":67,"idInBook":67,"chapterId":31,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ دَاوُدَ بْنِ الْحُصَيْنِ، أَنَّهُ سَمِعَ سَعِيدَ بْنَ الْمُسَيَّبِ، يَقُولُ مِنْ مَيْسِرِ أَهْلِ الْجَاهِلِيَّةِ بَيْعُ الْحَيَوَانِ بِاللَّحْمِ بِالشَّاةِ وَالشَّاتَيْنِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Da'ud ibn al-Husayn that he\nheard Said ibn alMusayyab say, \"Part of the gambling of the people of\nJahiliya was bartering live animals for slaughtered meat, for instance\none live sheep for two slaughtered sheep.\""}},{"id":68,"idInBook":68,"chapterId":31,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ كَانَ يَقُولُ نُهِيَ عَنْ بَيْعِ الْحَيَوَانِ، بِاللَّحْمِ ‏.‏ قَالَ أَبُو الزِّنَادِ فَقُلْتُ لِسَعِيدِ بْنِ الْمُسَيَّبِ أَرَأَيْتَ رَجُلاً اشْتَرَى شَارِفًا بِعَشَرَةِ شِيَاهٍ فَقَالَ سَعِيدٌ إِنْ كَانَ اشْتَرَاهَا لِيَنْحَرَهَا فَلاَ خَيْرَ فِي ذَلِكَ ‏.‏ قَالَ أَبُو الزِّنَادِ وَكُلُّ مَنْ أَدْرَكْتُ مِنَ النَّاسِ يَنْهَوْنَ عَنْ بَيْعِ الْحَيَوَانِ بِاللَّحْمِ ‏.‏ قَالَ أَبُو الزِّنَادِ وَكَانَ ذَلِكَ يُكْتَبُ فِي عُهُودِ الْعُمَّالِ فِي زَمَانِ أَبَانَ بْنِ عُثْمَانَ وَهِشَامِ بْنِ إِسْمَاعِيلَ يَنْهَوْنَ عَنْ ذَلِكَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'z-Zinad that Said ibn al-\nMusayyab said, \"Bartering live animals for dead meat is forbidden.\"\nAbu'z-Zinad said, \"I said to Said ibn Musayyab, 'What do you think of\na man buying an old camel for 10 sheep?' \" Said said, \"If he buys it\nto slaughter it, there is no good in it.\" Abu'z-Zinad added, \"All the\npeople (i.e. companions) that I have seen forbade bartering live\nanimals for meat.\"\n\n\nAbu'z-Zinad said, \"This used to be written\nin the appointment letters of governors in the time of Aban ibn Uthman\nand Hisham ibn Ismail.\""}},{"id":69,"idInBook":69,"chapterId":31,"bookId":7,"arabic":"","english":{"narrator":"","text":"Malik said, \"It is the generally agreed on way of doing things\namong us that the meat of camels, cattle, sheep and so on is not to be\nbartered one for one, except like for like, weight for weight, from\nhand to hand. There is no harm in that. If it is not weighed, then it\nis estimated to be like for like from hand to hand.\"\n\n\nMalik\nsaid, \"There is no harm in bartering the meat of fish for the meat of\ncamels, cattle, and sheep and so on two or more for one, from hand to\nhand. If delayed terms enter the transaction however, there is no good\nin it.\"\n\n\nMalik said, \"I think that poultry is different from\nthe meat of cattle and fish. I see no harm in selling some of it for\nsomething different, more of one than another, from hand to hand. None\nof that is to be sold on delayed terms.\""}},{"id":70,"idInBook":70,"chapterId":31,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ، عَنْ أَبِي مَسْعُودٍ الأَنْصَارِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ ثَمَنِ الْكَلْبِ وَمَهْرِ الْبَغِيِّ وَحُلْوَانِ الْكَاهِنِ ‏.‏ يَعْنِي بِمَهْرِ الْبَغِيِّ مَا تُعْطَاهُ الْمَرْأَةُ عَلَى الزِّنَا وَحُلْوَانُ الْكَاهِنِ رَشْوَتُهُ وَمَا يُعْطَى عَلَى أَنْ يَتَكَهَّنَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Abu Bakr ibn\nAbd ar-Rahman ibn al-Harith ibn Hisham from Abu Masud al-Ansari that\nthe Messenger of Allah, may Allah bless him and grant him peace,\nforbade the sale price of a dog, the earnings of a prostitute and the\nearnings of a fortune teller.\n\n\nBy the earnings of a prostitute\nhe meant what a woman was given for fornication. The earnings of a\nfortune teller were what he was given to tell a fortune.\n\n\nMalik said, \"I disapprove of the price of a dog, whether it is a\nhunting dog or otherwise because the Messenger of Allah, may Allah\nbless him and grant him peace, forbade the price of a dog.\""}},{"id":71,"idInBook":71,"chapterId":31,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ بَيْعٍ وَسَلَفٍ ‏.‏ قَالَ مَالِكٌ وَتَفْسِيرُ ذَلِكَ أَنْ يَقُولَ الرَّجُلُ لِلرَّجُلِ آخُذُ سِلْعَتَكَ بِكَذَا وَكَذَا عَلَى أَنْ تُسْلِفَنِي كَذَا وَكَذَا ‏.‏ فَإِنْ عَقَدَا بَيْعَهُمَا عَلَى هَذَا فَهُوَ غَيْرُ جَائِزٍ فَإِنْ تَرَكَ الَّذِي اشْتَرَطَ السَّلَفَ مَا اشْتَرَطَ مِنْهُ كَانَ ذَلِكَ الْبَيْعُ جَائِزًا ‏.‏ قَالَ مَالِكٌ وَلاَ بَأْسَ أَنْ يُشْتَرَى الثَّوْبُ مِنَ الْكَتَّانِ أَوِ الشَّطَوِيِّ أَوِ الْقَصَبِيِّ بِالأَثْوَابِ مِنَ الإِتْرِيبِيِّ أَوِ الْقَسِّيِّ أَوِ الزِّيقَةِ أَوِ الثَّوْبِ الْهَرَوِيِّ أَوِ الْمَرْوِيِّ بِالْمَلاَحِفِ الْيَمَانِيَّةِ وَالشَّقَائِقِ وَمَا أَشْبَهَ ذَلِكَ الْوَاحِدُ بِالاِثْنَيْنِ أَوِ الثَّلاَثَةِ يَدًا بِيَدٍ أَوْ إِلَى أَجَلٍ وَإِنْ كَانَ مِنْ صِنْفٍ وَاحِدٍ فَإِنْ دَخَلَ ذَلِكَ نَسِيئَةٌ فَلاَ خَيْرَ فِيهِ ‏.‏ قَالَ مَالِكٌ وَلاَ يَصْلُحُ حَتَّى يَخْتَلِفَ فَيَبِينَ اخْتِلاَفُهُ فَإِذَا أَشْبَهَ بَعْضُ ذَلِكَ بَعْضًا وَإِنِ اخْتَلَفَتْ أَسْمَاؤُهُ فَلاَ يَأْخُذْ مِنْهُ اثْنَيْنِ بِوَاحِدٍ إِلَى أَجَلٍ وَذَلِكَ أَنْ يَأْخُذَ الثَّوْبَيْنِ مِنَ الْهَرَوِيِّ بِالثَّوْبِ مِنَ الْمَرْوِيِّ أَوِ الْقُوهِيِّ إِلَى أَجَلٍ أَوْ يَأْخُذَ الثَّوْبَيْنِ مِنَ الْفُرْقُبِيِّ بِالثَّوْبِ مِنَ الشَّطَوِيِّ فَإِذَا كَانَتْ هَذِهِ الأَجْنَاسُ عَلَى هَذِهِ الصِّفَةِ فَلاَ يُشْتَرَى مِنْهَا اثْنَانِ بِوَاحِدٍ إِلَى أَجَلٍ ‏.‏ قَالَ مَالِكٌ وَلاَ بَأْسَ أَنْ تَبِيعَ مَا اشْتَرَيْتَ مِنْهَا قَبْلَ أَنْ تَسْتَوْفِيَهُ مِنْ غَيْرِ صَاحِبِهِ الَّذِي اشْتَرَيْتَهُ مِنْهُ إِذَا انْتَقَدْتَ ثَمَنَهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that the\nMessenger of Allah, may Allah bless him and grant him peace, forbade\n'selling and lending.'\n\n\nMalik said, \"The explanation of what\nthat meant is that one man says to another, 'I will take your goods\nfor such-and-such if you lend me such-and-such.' If they agree to a\ntransaction in this manner, it is not permitted. If the one who\nstipulates the loan abandons his stipulation, then the sale is\npermitted.\"\n\n\nMalik said, \"There is no harm in exchanging linen\nfrom Shata, for garments from Itribi, or Qass, or Ziqa. Or the cloth\nof Herat or Merv for Yemeni cloaks and shawls and such like as one for\ntwo or three, from hand to hand or with delayed terms. If the goods\nare of the same kind, and deferment enters into the transaction, there\nis no good in it.\"\n\n\nMalik said, \"It is not good unless they\nare different, and the difference between them is clear. When they\nresemble each other, even if the names are different, do not take two\nfor one with delayed terms, for instance two garments of Herat for one\nfrom Merv or Quhy with delayed terms, ortwo garments of Furqub for one\nfrom Shata. All these sorts are of the same description, so do not buy\ntwo for one, on delayed terms.\"\n\n\nMalik said, \"There is no harm\nin selling what you buy of things of this nature, before you complete\nthe deal, to some one other than the person from whom you purchased\nthem if the price was paid in cash.\""}},{"id":72,"idInBook":72,"chapterId":31,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، أَنَّهُ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، وَرَجُلٌ، يَسْأَلُهُ عَنْ رَجُلٍ، سَلَّفَ فِي سَبَائِبَ فَأَرَادَ بَيْعَهَا قَبْلَ أَنْ يَقْبِضَهَا فَقَالَ ابْنُ عَبَّاسٍ تِلْكَ الْوَرِقُ بِالْوَرِقِ ‏.‏ وَكَرِهَ ذَلِكَ ‏.‏ قَالَ مَالِكٌ وَذَلِكَ فِيمَا نُرَى وَاللَّهُ أَعْلَمُ أَنَّهُ أَرَادَ أَنْ يَبِيعَهَا مِنْ صَاحِبِهَا الَّذِي اشْتَرَاهَا مِنْهُ بِأَكْثَرَ مِنَ الثَّمَنِ الَّذِي ابْتَاعَهَا بِهِ وَلَوْ أَنَّهُ بَاعَهَا مِنْ غَيْرِ الَّذِي اشْتَرَاهَا مِنْهُ لَمْ يَكُنْ بِذَلِكَ بَأْسٌ ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا فِيمَنْ سَلَّفَ فِي رَقِيقٍ أَوْ مَاشِيَةٍ أَوْ عُرُوضٍ فَإِذَا كَانَ كُلُّ شَىْءٍ مِنْ ذَلِكَ مَوْصُوفًا فَسَلَّفَ فِيهِ إِلَى أَجَلٍ فَحَلَّ الأَجَلُ فَإِنَّ الْمُشْتَرِيَ لاَ يَبِيعُ شَيْئًا مِنْ ذَلِكَ مِنَ الَّذِي اشْتَرَاهُ مِنْهُ بِأَكْثَرَ مِنَ الثَّمَنِ الَّذِي سَلَّفَهُ فِيهِ قَبْلَ أَنْ يَقْبِضَ مَا سَلَّفَهُ فِيهِ وَذَلِكَ أَنَّهُ إِذَا فَعَلَهُ فَهُوَ الرِّبَا صَارَ الْمُشْتَرِي إِنْ أَعْطَى الَّذِي بَاعَهُ دَنَانِيرَ أَوْ دَرَاهِمَ فَانْتَفَعَ بِهَا فَلَمَّا حَلَّتْ عَلَيْهِ السِّلْعَةُ وَلَمْ يَقْبِضْهَا الْمُشْتَرِي بَاعَهَا مِنْ صَاحِبِهَا بِأَكْثَرَ مِمَّا سَلَّفَهُ فِيهَا فَصَارَ أَنْ رَدَّ إِلَيْهِ مَا سَلَّفَهُ وَزَادَهُ مِنْ عِنْدِهِ ‏.‏ قَالَ مَالِكٌ مَنْ سَلَّفَ ذَهَبًا أَوْ وَرِقًا فِي حَيَوَانٍ أَوْ عُرُوضٍ إِذَا كَانَ مَوْصُوفًا إِلَى أَجَلٍ مُسَمًّى ثُمَّ حَلَّ الأَجَلُ فَإِنَّهُ لاَ بَأْسَ أَنْ يَبِيعَ الْمُشْتَرِي تِلْكَ السِّلْعَةَ مِنَ الْبَائِعِ قَبْلَ أَنْ يَحِلَّ الأَجَلُ أَوْ بَعْدَ مَا يَحِلُّ بِعَرْضٍ مِنَ الْعُرُوضِ يُعَجِّلُهُ وَلاَ يُؤَخِّرُهُ بَالِغًا مَا بَلَغَ ذَلِكَ الْعَرْضُ إِلاَّ الطَّعَامَ فَإِنَّهُ لاَ يَحِلُّ أَنْ يَبِيعَهُ حَتَّى يَقْبِضَهُ وَلِلْمُشْتَرِي أَنْ يَبِيعَ تِلْكَ السِّلْعَةَ مِنْ غَيْرِ صَاحِبِهِ الَّذِي ابْتَاعَهَا مِنْهُ بِذَهَبٍ أَوْ وَرِقٍ أَوْ عَرْضٍ مِنَ الْعُرُوضِ يَقْبِضُ ذَلِكَ وَلاَ يُؤَخِّرُهُ لأَنَّهُ إِذَا أَخَّرَ ذَلِكَ قَبُحَ وَدَخَلَهُ مَا يُكْرَهُ مِنَ الْكَالِئِ بِالْكَالِئِ وَالْكَالِئُ بِالْكَالِئِ أَنْ يَبِيعَ الرَّجُلُ دَيْنًا لَهُ عَلَى رَجُلٍ بِدَيْنٍ عَلَى رَجُلٍ آخَرَ ‏.‏ قَالَ مَالِكٌ وَمَنْ سَلَّفَ فِي سِلْعَةٍ إِلَى أَجَلٍ وَتِلْكَ السِّلْعَةُ مِمَّا لاَ يُؤْكَلُ وَلاَ يُشْرَبُ فَإِنَّ الْمُشْتَرِيَ يَبِيعُهَا مِمَّنْ شَاءَ بِنَقْدٍ أَوْ عَرْضٍ قَبْلَ أَنْ يَسْتَوْفِيَهَا مِنْ غَيْرِ صَاحِبِهَا الَّذِي اشْتَرَاهَا مِنْهُ وَلاَ يَنْبَغِي لَهُ أَنْ يَبِيعَهَا مِنَ الَّذِي ابْتَاعَهَا مِنْهُ إِلاَّ بِعَرْضٍ يَقْبِضُهُ وَلاَ يُؤَخِّرُهُ ‏.‏ قَالَ مَالِكٌ وَإِنْ كَانَتِ السِّلْعَةُ لَمْ تَحِلَّ فَلاَ بَأْسَ بِأَنْ يَبِيعَهَا مِنْ صَاحِبِهَا بِعَرْضٍ مُخَالِفٍ لَهَا بَيِّنٍ خِلاَفُهُ يَقْبِضُهُ وَلاَ يُؤَخِّرُهُ ‏.‏ قَالَ مَالِكٌ فِيمَنْ سَلَّفَ دَنَانِيرَ أَوْ دَرَاهِمَ فِي أَرْبَعَةِ أَثْوَابٍ مَوْصُوفَةٍ إِلَى أَجَلٍ فَلَمَّا حَلَّ الأَجَلُ تَقَاضَى صَاحِبَهَا فَلَمْ يَجِدْهَا عِنْدَهُ وَوَجَدَ عِنْدَهُ ثِيَابًا دُونَهَا مِنْ صِنْفِهَا فَقَالَ لَهُ الَّذِي عَلَيْهِ الأَثْوَابُ أُعْطِيكَ بِهَا ثَمَانِيَةَ أَثْوَابٍ مِنْ ثِيَابِي هَذِهِ ‏.‏ إِنَّهُ لاَ بَأْسَ بِذَلِكَ إِذَا أَخَذَ تِلْكَ الأَثْوَابَ الَّتِي يُعْطِيهِ قَبْلَ أَنْ يَفْتَرِقَا فَإِنْ دَخَلَ ذَلِكَ الأَجَلُ فَإِنَّهُ لاَ يَصْلُحُ وَإِنْ كَانَ ذَلِكَ قَبْلَ مَحِلِّ الأَجَلِ فَإِنَّهُ لاَ يَصْلُحُ أَيْضًا إِلاَّ أَنْ يَبِيعَهُ ثِيَابًا لَيْسَتْ مِنْ صِنْفِ الثِّيَابِ الَّتِي سَلَّفَهُ فِيهَا ‏.‏","english":{"narrator":"Yahya related to me from Malik from Yahya ibn Said that al-Qasim\nibn Muhammad said, ''I heard Abdullah ibn Abbas say, when a man asked\nhim about a man making an advance on some garments and then wanting to\nsell them back before taking possession of them, 'That is silver for\nsilver,' and he disapproved of it.\"\n\n\nMalik said, \"Our opinion\nis - and Allah knows best that was because he wanted to sell them to\nthe person from whom he had bought them for more than the price for\nwhich he bought them. Had he sold them to some one other than the\nperson from whom he had purchased them, there would not have been any\nharm in it.\"\n\n\nMalik said, \"The generally agreed on way of\ndoing things among us concerning making an advance for slaves, cattle\nor goods is that when all of what is to be sold is described and an\nadvance is made for them for a date, and the date falls due, the buyer\ndoes not sell any of that to the person from whom he has purchased it\nfor more than the price which he advanced for it before he has taken\nfull possession of what he has advanced for. It is usury if he does.\nIf the buyer gives the seller dinars or dirhams and he profits with\nthem, then, when the goods come to the buyer and he does not take them\ninto his possession but sells them back to their owner for more than\nwhat he advanced for them, the outcome is that what he has advanced\nhas returned to him and has been increased for him.\"\n\n\nMalik\nsaid, \"If someone advances gold or silver for described animals or\ngoods which are to be delivered before a named date, and the date\narrives, or it is before or after the date, there is no harm in the\nbuyer selling those goods to the seller, for other goods, to be taken\nimmediately and not delayed, no matter how extensive the amount of\nthose goods is, except in the case of food because it is not halal to\nsell it before he has full possession of it. The buyer can sell those\ngoods to some one other than the person from whom he purchased them\nfor gold or silver or any goods. He takes possession of it and does\nnot defer it because if he defers it, that is ugly and there enters\ninto the transaction what is disapproved of:","text":"delay for delay. Delay\nfor delay is to sell a debt against one man for a debt against another\nman.\"\n\n\nMalik said, \"If someone advances for goods to be\ndelivered after a time, and those goods are neither something to be\neaten nor drunk, he can sell them to whomever he likes for cash or\ngoods, before he takes delivery of them, to some one other than the\nperson from whom he purchased them. He must not sell them to the\nperson from whom he bought them except in exchange for goods which he\ntakes possession of immediately and does not defer.\"\n\n\nMalik\nsaid, \"If the delivery date for the goods has not arrived, there is no\nharm in selling them to the original owner for goods which are clearly\ndifferent and which he takes immediate possession of and does not\ndefer.\"\n\n\nMalik spoke about the case of a man who advanced\ndinars or dirhams for four specified pieces of cloth to be delivered\nbefore a specified time and when the term fell due, he demanded\ndelivery from the seller and the seller did not have them. He found\nthat the seller had cloth but inferior quality, and the seller said\nthat he would give him eight of those cloths. Malik said, \"There is no\nharm in that if he takes the cloths which he offers him before they\nseparate. It is not good if delayed terms enter into the transaction.\nIt is also not good if that is before the end of the term, unless he\nsells him cloth which is notthetypeof cloth for which he made an\nadvance."}},{"id":73,"idInBook":73,"chapterId":31,"bookId":7,"arabic":"","english":{"narrator":"","text":"Malik said, \"The generally agreed on way of doing things among us\nabout whatever is weighed but is not gold or silver, i.e. copper,\nbrass, lead, black lead, iron, herbs, figs, cotton, and any such\nthings that are weighed, is that there is no harm in bartering all\nthose sorts of things two for one, hand to hand. There is no harm in\ntaking a ritl of iron for two ritls of iron, and a ritl of brass for\ntwo ritls of brass.\"\n\n\nMalik said, \"There is no good in two for\none of one sort with delayed terms. There is no harm in taking two of\none sort for one of another on delayed terms, if the two sorts are\nclearly different. If both sorts resemble each other but their names\nare different, like lead and black lead, brass and yellow brass, I\ndisapprove of taking two of one sort for one of the other on delayed\nterms.\"\n\n\nMalik said, \"When buying something of this nature,\nthere is no harm in selling It beforetaking possession of it to some\none other than the person from whom it was purchased, if the price is\ntaken immediately and if it was bought originally by measure or\nweight. If it was bought without measuring, it should be sold to\nsomeone other than the person from whom it was bought, for cash or\nwith delayed terms. That is because goods have to be guaranteed when\nthey are bought without measuring, and they cannot be guaranteed when\nbought by weight until they are weighed and the deal is completed.\nThis is the best of what I have heard about all these things. It is\nwhat people continue to do among us.\"\n\n\nMalik said, \"The way of\ndoing things among us with what is measured or weighed of things which\nare not eaten or drunk, like safflower, date-stones, fodder leaves,\nindigo dye and the like of that is that there is no harm in bartering\nall those sort of things two for one, hand to hand. Do not take two\nfor one from the same variety with delayed terms. If the types are\nclearly different, there is no harm in taking two of one for one of\nthe other with delayed terms. There is no harm in selling whatever is\npurchased of all these sorts, before taking delivery of them if the\nprice is taken from someone other than the person from whom they were\npurchased.\"\n\n\nMalik said, \"Anything of any variety that profits\npeople, like gravel and gypsum, one quantity of them for two of its\nlike with delayed terms is usury. One quantity of both of them for its\nequal plus any increase with delayed terms, is usury.\""}},{"id":74,"idInBook":74,"chapterId":31,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ ‏.‏ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ بَيْعَتَيْنِ فِي بَيْعَةٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that the\nMessenger of Allah, may Allah bless him and grant him peace, forbade\ntwo sales in one sale."}},{"id":75,"idInBook":75,"chapterId":31,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ رَجُلاً، قَالَ لِرَجُلٍ ابْتَعْ لِي هَذَا الْبَعِيرَ بِنَقْدٍ حَتَّى أَبْتَاعَهُ مِنْكَ إِلَى أَجَلٍ فَسُئِلَ عَنْ ذَلِكَ عَبْدُ اللَّهِ بْنُ عُمَرَ فَكَرِهَهُ وَنَهَى عَنْهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that a man said\nto another, \"Buy this camel for me immediately so that I can buy him\nfrom you on credit.\" Abdullah ibn Umar was asked about that and he\ndisapproved of it and forbade it."}},{"id":76,"idInBook":76,"chapterId":31,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ الْقَاسِمَ بْنَ مُحَمَّدٍ، سُئِلَ عَنْ رَجُلٍ، اشْتَرَى سِلْعَةً بِعَشَرَةِ دَنَانِيرَ نَقْدًا أَوْ بِخَمْسَةَ عَشَرَ دِينَارًا إِلَى أَجَلٍ فَكَرِهَ ذَلِكَ وَنَهَى عَنْهُ ‏.‏ قَالَ مَالِكٌ فِي رَجُلٍ ابْتَاعَ سِلْعَةً مِنْ رَجُلٍ بِعَشَرَةِ دَنَانِيرَ نَقْدًا أَوْ بِخَمْسَةَ عَشَرَ دِينَارًا إِلَى أَجَلٍ قَدْ وَجَبَتْ لِلْمُشْتَرِي بِأَحَدِ الثَّمَنَيْنِ إِنَّهُ لاَ يَنْبَغِي ذَلِكَ لأَنَّهُ إِنْ أَخَّرَ الْعَشَرَةَ كَانَتْ خَمْسَةَ عَشَرَ إِلَى أَجَلٍ وَإِنْ نَقَدَ الْعَشَرَةَ كَانَ إِنَّمَا اشْتَرَى بِهَا الْخَمْسَةَ عَشَرَ الَّتِي إِلَى أَجَلٍ ‏.‏ قَالَ مَالِكٌ فِي رَجُلٍ اشْتَرَى مِنْ رَجُلٍ سِلْعَةً بِدِينَارٍ نَقْدًا أَوْ بِشَاةٍ مَوْصُوفَةٍ إِلَى أَجَلٍ قَدْ وَجَبَ عَلَيْهِ بِأَحَدِ الثَّمَنَيْنِ إِنَّ ذَلِكَ مَكْرُوهٌ لاَ يَنْبَغِي لأَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَدْ نَهَى عَنْ بَيْعَتَيْنِ فِي بَيْعَةٍ وَهَذَا مِنْ بَيْعَتَيْنِ فِي بَيْعَةٍ ‏.‏ قَالَ مَالِكٌ فِي رَجُلٍ قَالَ لِرَجُلٍ أَشْتَرِي مِنْكَ هَذِهِ الْعَجْوَةَ خَمْسَةَ عَشَرَ صَاعًا أَوِ الصَّيْحَانِيَّ عَشَرَةَ أَصْوُعٍ أَوِ الْحِنْطَةَ الْمَحْمُولَةَ خَمْسَةَ عَشَرَ صَاعًا أَوِ الشَّامِيَّةَ عَشَرَةَ أَصْوُعٍ بِدِينَارٍ قَدْ وَجَبَتْ لِي إِحْدَاهُمَا إِنَّ ذَلِكَ مَكْرُوهٌ لاَ يَحِلُّ وَذَلِكَ أَنَّهُ قَدْ أَوْجَبَ لَهُ عَشَرَةَ أَصْوُعٍ صَيْحَانِيًّا فَهُوَ يَدَعُهَا وَيَأْخُذُ خَمْسَةَ عَشَرَ صَاعًا مِنَ الْعَجْوَةِ أَوْ تَجِبُ عَلَيْهِ خَمْسَةَ عَشَرَ صَاعًا مِنَ الْحِنْطَةِ الْمَحْمُولَةِ فَيَدَعُهَا وَيَأْخُذُ عَشَرَةَ أَصْوُعٍ مِنَ الشَّامِيَّةِ فَهَذَا أَيْضًا مَكْرُوهٌ لاَ يَحِلُّ وَهُوَ أَيْضًا يُشْبِهُ مَا نُهِيَ عَنْهُ مِنْ بَيْعَتَيْنِ فِي بَيْعَةٍ وَهُوَ أَيْضًا مِمَّا نُهِيَ عَنْهُ أَنْ يُبَاعَ مِنْ صِنْفٍ وَاحِدٍ مِنَ الطَّعَامِ اثْنَانِ بِوَاحِدٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that al-Qasim\nibn Muhammad was asked about a man who bought goods for 10 dinars cash\nor fifteen dinars on credit. He disapproved of that and forbade it.\n\n\nMalik said that if a man bought goods from a man for either\n10 dinars or 15 dinars on credit, that one of the two prices was\nobliged on the buyer. It was not to be done because if he postponed\npaying the ten, it would be 15 on credit, and if he paid the ten, he\nwould buy with it what was worth fifteen dinars on credit.\n\n\nMalik said that it was disapproved of for a man to buy goods from\nsomeone for either a dinar cash or for a described sheep on credit and\nthat one of the two prices was obliged on him. It was not to be done\nbecause the Messenger of Allah, may Allah bless him and grant him\npeace, forbade two sales in one sale. This was part of two sales in\nthe one sale.\n\n\nMalik spoke about a man saying to another, \"'I\nwill either buy these fifteen sa of ajwa dates from you, or these ten\nsa of sayhani dates or I will buy these fifteen sa of inferior wheat\nor these ten sa of Syrian wheat for a dinar, and one of them is\nobliged to me.' Malik said that it was disapproved of and was not\nhalal. That was because he obliged him ten sa of sayhani, and left\nthem and took fifteen sa of ajwa, or he was obliged fifteen sa of\ninferior wheat and left them and took ten sa of Syrian wheat. This was\nalso disapproved of, and was not halal. It resembled what was\nprohibited in the way of two sales in one sale. It was also included\nunder the prohibition against buying two for one of the same sort of\nfood.\""}},{"id":77,"idInBook":77,"chapterId":31,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي حَازِمِ بْنِ دِينَارٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ الْغَرَرِ ‏.‏ قَالَ مَالِكٌ وَمِنَ الْغَرَرِ وَالْمُخَاطَرَةِ أَنْ يَعْمِدَ الرَّجُلُ قَدْ ضَلَّتْ دَابَّتُهُ أَوْ أَبَقَ غُلاَمُهُ وَثَمَنُ الشَّىْءِ مِنْ ذَلِكَ خَمْسُونَ دِينَارًا فَيَقُولُ رَجُلٌ أَنَا آخُذُهُ مِنْكَ بِعِشْرِينَ دِينَارًا ‏.‏ فَإِنْ وَجَدَهُ الْمُبْتَاعُ ذَهَبَ مِنَ الْبَائِعِ ثَلاَثُونَ دِينَارًا وَإِنْ لَمْ يَجِدْهُ ذَهَبَ الْبَائِعُ مِنَ الْمُبْتَاعِ بِعِشْرِينَ دِينَارًا ‏.‏ قَالَ مَالِكٌ وَفِي ذَلِكَ عَيْبٌ آخَرُ إِنَّ تِلْكَ الضَّالَّةَ إِنْ وُجِدَتْ لَمْ يُدْرَ أَزَادَتْ أَمْ نَقَصَتْ أَمْ مَا حَدَثَ بِهَا مِنَ الْعُيُوبِ فَهَذَا أَعْظَمُ الْمُخَاطَرَةِ ‏.‏ قَالَ مَالِكٌ وَالأَمْرُ عِنْدَنَا أَنَّ مِنَ الْمُخَاطَرَةِ وَالْغَرَرِ اشْتِرَاءَ مَا فِي بُطُونِ الإِنَاثِ مِنَ النِّسَاءِ وَالدَّوَابِّ لأَنَّهُ لاَ يُدْرَى أَيَخْرُجُ أَمْ لاَ يَخْرُجُ فَإِنْ خَرَجَ لَمْ يُدْرَ أَيَكُونُ حَسَنًا أَمْ قَبِيحًا أَمْ تَامًّا أَمْ نَاقِصًا أَمْ ذَكَرًا أَمْ أُنْثَى وَذَلِكَ كُلُّهُ يَتَفَاضَلُ إِنْ كَانَ عَلَى كَذَا فَقِيمَتُهُ كَذَا وَإِنْ كَانَ عَلَى كَذَا فَقِيمَتُهُ كَذَا ‏.‏ قَالَ مَالِكٌ وَلاَ يَنْبَغِي بَيْعُ الإِنَاثِ وَاسْتِثْنَاءُ مَا فِي بُطُونِهَا وَذَلِكَ أَنْ يَقُولَ الرَّجُلُ لِلرَّجُلِ ثَمَنُ شَاتِي الْغَزِيرَةِ ثَلاَثَةُ دَنَانِيرَ فَهِيَ لَكَ بِدِينَارَيْنِ وَلِي مَا فِي بَطْنِهَا ‏.‏ فَهَذَا مَكْرُوهٌ لأَنَّهُ غَرَرٌ وَمُخَاطَرَةٌ ‏.‏ قَالَ مَالِكٌ وَلاَ يَحِلُّ بَيْعُ الزَّيْتُونِ بِالزَّيْتِ وَلاَ الْجُلْجُلاَنِ بِدُهْنِ الْجُلْجُلاَنِ وَلاَ الزُّبْدِ بِالسَّمْنِ لأَنَّ الْمُزَابَنَةَ تَدْخُلُهُ وَلأَنَّ الَّذِي يَشْتَرِي الْحَبَّ وَمَا أَشْبَهَهُ بِشَىْءٍ مُسَمًّى مِمَّا يَخْرُجُ مِنْهُ لاَ يَدْرِي أَيَخْرُجُ مِنْهُ أَقَلُّ مِنْ ذَلِكَ أَوْ أَكْثَرُ فَهَذَا غَرَرٌ وَمُخَاطَرَةٌ ‏.‏ قَالَ مَالِكٌ وَمِنْ ذَلِكَ أَيْضًا اشْتِرَاءُ حَبِّ الْبَانِ بِالسَّلِيخَةِ فَذَلِكَ غَرَرٌ لأَنَّ الَّذِي يَخْرُجُ مِنْ حَبِّ الْبَانِ هُوَ السَّلِيخَةُ وَلاَ بَأْسَ بِحَبِّ الْبَانِ بِالْبَانِ الْمُطَيَّبِ لأَنَّ الْبَانَ الْمُطَيَّبَ قَدْ طُيِّبَ وَنُشَّ وَتَحَوَّلَ عَنْ حَالِ السَّلِيخَةِ ‏.‏ قَالَ مَالِكٌ فِي رَجُلٍ بَاعَ سِلْعَةً مِنْ رَجُلٍ عَلَى أَنَّهُ لاَ نُقْصَانَ عَلَى الْمُبْتَاعِ إِنَّ ذَلِكَ بَيْعٌ غَيْرُ جَائِزٍ وَهُوَ مِنَ الْمُخَاطَرَةِ وَتَفْسِيرُ ذَلِكَ أَنَّهُ كَأَنَّهُ اسْتَأْجَرَهُ بِرِبْحٍ إِنْ كَانَ فِي تِلْكَ السِّلْعَةِ وَإِنْ بَاعَ بِرَأْسِ الْمَالِ أَوْ بِنُقْصَانٍ فَلاَ شَىْءَ لَهُ وَذَهَبَ عَنَاؤُهُ بَاطِلاً فَهَذَا لاَ يَصْلُحُ وَلِلْمُبْتَاعِ فِي هَذَا أُجْرَةٌ بِمِقْدَارِ مَا عَالَجَ مِنْ ذَلِكَ وَمَا كَانَ فِي تِلْكَ السِّلْعَةِ مِنْ نُقْصَانٍ أَوْ رِبْحٍ فَهُوَ لِلْبَائِعِ وَعَلَيْهِ وَإِنَّمَا يَكُونُ ذَلِكَ إِذَا فَاتَتِ السِّلْعَةُ وَبِيعَتْ ‏.‏ فَإِنْ لَمْ تَفُتْ فُسِخَ الْبَيْعُ بَيْنَهُمَا ‏.‏ قَالَ مَالِكٌ فَأَمَّا أَنْ يَبِيعَ رَجُلٌ مِنْ رَجُلٍ سِلْعَةً يَبُتُّ بَيْعَهَا ثُمَّ يَنْدَمُ الْمُشْتَرِي فَيَقُولُ لِلْبَائِعِ ضَعْ عَنِّي فَيَأْبَى الْبَائِعُ وَيَقُولُ بِعْ فَلاَ نُقْصَانَ عَلَيْكَ ‏.‏ فَهَذَا لاَ بَأْسَ بِهِ لأَنَّهُ لَيْسَ مِنَ الْمُخَاطَرَةِ وَإِنَّمَا هُوَ شَىْءٌ وَضَعَهُ لَهُ وَلَيْسَ عَلَى ذَلِكَ عَقَدَا بَيْعَهُمَا وَذَلِكَ الَّذِي عَلَيْهِ الأَمْرُ عِنْدَنَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu Hazim ibn Dinar from Said\nibn al-Musayyab that the Messenger of Allah, may Allah bless him and\ngrant him peace, forbade the sale with uncertainty in it.\n\n\nMalik said, \"An example of one type of uncertain transaction and risk\nis that a man intends the price of a stray animal or escaped slave to\nbe fifty dinars. A man says, 'I will take him from you for twenty\ndinars.' If the buyer finds him, thirty dinars goes from the seller,\nand if he does not find him, the seller takes twenty dinars from the\nbuyer.\"\n\n\nMalik said, \"There is another fault in that. If that\nstray is found, it is not known whether it will have increased or\ndecreased in value or what defects may have befallen it. This\ntransaction is greatly uncertain and risky.\"\n\n\nMalik said,\n\"According to our way of doing things, one kind of uncertain\ntransaction and risk is selling what is in the wombs of females -\nwomen and animals - because it is not known whether or not it will\ncome out, and if it does come out, it is not known whether it will be\nbeautiful or ugly, normal or disabled, male or female. All that is\ndisparate. If it has that, its price is such-and-such, and if it has\nthis, its price is such-and-such.\"\n\n\nMalik said, \"Females must\nnot be sold with what is in their wombs excluded. That is that, for\ninstance, a man says to another, 'The price of my sheep which has much\nmilk is three dinars. She is yours for two dinars while I will have\nher future offspring.' This is disapproved because it is an uncertain\ntransaction and a risk.\"\n\n\nMalik said, \"It is not halal to sell\nolives for olive oil or sesame for sesame oil, or butter for ghee\nbecause muzabana comes into that, because the person who buys the raw\nproduct for something specified which comes from it, does not know\nwhether more or less will come out of that, so it is an uncertain\ntransaction and a risk.\"\n\n\nMalik said, \"A similar case is the\nselling of ben-nuts for ben-nut oil. This is an uncertain transaction\nbecause what comes from the ben-nut is ben-oil. There is no harm in\nselling ben-nuts for perfumed ben because perfumed ben has been\nperfumed, mixed and changed from the state of raw ben-nut oil.\"\n\n\nMalik, speaking about a man who sold goods to a man on the\nprovision that there was to be no loss for the buyer, (i.e. if the\nbuyer could not re-sell the goods they could go back to the seller),\nsaid, \"This transaction is not permitted and it is part of risk. The\nexplanation of why it is so, is that it is as if the seller hired the\nbuyer for the profit if the goods make a profit. If he sells the stock\nat a loss, he has nothing, and his efforts are not compensated. This\nis not good. In such a transaction, the buyer should have a wage\naccording to the work that he has contributed. Whatever there is of\nloss or profit in those goods is for and against the seller. This is\nonly when the goods are gone and sold. If they do not go, the\ntransaction between them is null and void.\"\n\n\nMalik said, \"As\nfor a man who buys goods from a man and he concludes the sale and then\nthe buyer regrets and asks to have the price reduced and the seller\nrefuses and says, 'Sell it and I will compensate you for any loss.'\nThere is no harm in this because there is no risk. It is something he\nproposes to him, and their transaction was not based on that. That is\nwhat is done among us.\""}},{"id":78,"idInBook":78,"chapterId":31,"bookId":7,"arabic":"حَدَّثَنَا يَحْيَى، عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، وَعَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الْمُلاَمَسَةِ وَالْمُنَابَذَةِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Muhammad ibn Yahya ibn Habban\nand from Abu'z-Zinad from al-Araj from Abu Hurayra that the Messenger\nof Allah, may Allah bless him and grant him peace, forbade mulamasa\nand munabadha.\n\n\nMalik said, \"Mulamasa is when a man can feel a\ngarment but is not allowed to unfold it or examine what is in it, or\nhe buys by night and does not know what is in it. Munabadha is that a\nman throws his garment to another, and the other throws his garment\nwithout either of them making any inspection. Each of them says, 'this\nis for this. 'This is what is forbidden of mulamasa and munabadha.\"\n\n\nMalik said that selling bundles with a list of their contents\nwas different from the sale of the cloak concealed in a bag or the\ncloth folded up and such things. What made it different was that it\nwas a common practice and it was what people were familiar with, and\nwhat people had done in the past, and it was still among the permitted\ntransactions and trading of people in which they saw no harm because\nin the sale of bundles with a list of contents without undoing them,\nan uncertain transaction was not intended and it did not resemble\nmulamasa."}},{"id":79,"idInBook":79,"chapterId":31,"bookId":7,"arabic":"","english":{"narrator":"","text":"Yahya related to me, that Malik said, \"The generally agreed on\nway of doing things among us about a man buying cloth in one city, and\nthen taking it to another city to sell as a murabaha, is that he is\nnot reckoned to have the wage of an agent, or any allowance for\nironing, folding, straightening, expenses, or the rent of a house. As\nfor the cost of transporting the drapery, it is included in the basic\nprice, and no share of the profit is allocated to it unless the agent\ntells all of that to the investor. If they agree to share the profits\naccordingly after knowledge of it, there is no harm in that.\"\n\n\nMalik said, \"As for bleaching, tailoring, dyeing, and such things,\nthey are treated in the same way as drapery. The profit is reckoned in\nthem as it is reckoned in drapery goods. So if he sells the drapery\ngoods without clarifying the things we named as not getting profit,\nand if the drapery has already gone, the transport is to be reckoned,\nbut no profit is given. If the drapery goods have not gone the\ntransaction between them is null and void unless they make a new\nmutual agreement on what is to be permitted between them .\"\n\n\nMalik spoke about an agent who bought goods for gold or silver, and\nthe exchange rate on the day of purchase was ten dirhams to the dinar.\nHe took them to a city to sell murabaha, or sold them where he\npurchased them according to the exchange rate of the day on which he\nsold them. If he bought them for dirhams and he sold them for dinars,\nor he bought them for dinars and he sold them for dirhams, and the\ngoods had not gone then he had a choice. If he wished, he accepted to\nsell the goods and if he wished, he left them. If the goods had been\nsold, he had the price for which the salesman bought them, and the\nsalesman was reckoned to have the profit on what they were bought for,\nover what the investor gained as profit.\n\n\nMalik said, \"If a\nman sells goods worth one hundred dinars for one hundred and ten, and\nhe hears after that they are worth ninety dinars, and the goods have\ngone, the seller has a choice. If he likes, he has the price of the\ngoods on the day they were taken from him unless the price is more\nthan the price for which he was obliged to sell them in the first\nplace, and he does not have more than that - and it is one hundred and\nten dinars. If he likes, it is counted as profit against ninety unless\nthe price his goods reached was less than the value. He is given the\nchoice between what his goods fetch and the capital plus the profit,\nwhich is ninety-nine dinars.\"\n\n\nMalik said, \"If someone sells\ngoods in murabaha and he says, 'It was valued at one hundred dinars to\nme.' Then he hears later on, that it was worth one hundred and twenty\ndinars, the customer is given the choice. If he wishes, he gives the\nsalesman the value of the goods on the day he took them, and if he\nwishes, he gives the price for which he bought them according to the\nreckoning of what profit he gives him, as far as it goes, unless that\nis less than the price for which he bought them, for he should not\ngive the owner of the goods a loss from the price for which he bought\nthem because he was satisfied with that. The owner of the goods came\nto seek extra, so the buyer has no argument against the salesman in\nthat to make a reduction from the first price for which he bought it\naccording to the list of contents.\""}},{"id":80,"idInBook":80,"chapterId":31,"bookId":7,"arabic":"","english":{"narrator":"","text":"Malik spoke about what was done among them in the case of a group\nof people who bought goods, drapery or slaves, and a man heard about\nit and said to one of the group, \"I have heard the description and\nsituation of the drapery goods you bought from so-and-so. Shall I give\nyou such-and-such profit to take over your portion?\" This person\nagreed, and the man gave him the profit and became a partner in his\nplace. When he looked at the purchase, he saw that it was ugly and\nfound it too expensive.\n\n\nMalik said, \"It is obliged on him and\nthere is no choice in it for him if he bought it according to a list\nof contents and the description was well-known.\"\n\n\nMalik spoke\nabout a man who had drapery goods sent to him, and salesmen came to\nhim and he read to them his list of contents and said, \"In each bag is\nsuch-and-such a wrap from Basra and such-and-such a light wrap from\nSabir. Their size is such-and-such,\" and he named to them types of\ndrapery goods by their sort, and he said, \"Buy them from me according\nto this description.\" They bought the bags according to what he\ndescribed to them, and then they bought them and found them too\nexpensive and regretted it. Malik said, \"The sale is binding on them,\nif the goods agree with the list of contents on which he sold them.\"\n\n\nMalik said, \"This is the way of doing things which people\nstill use today. They permit the sale among them when the goods agree\nwith the list of contents and are not different from it. \""}},{"id":81,"idInBook":81,"chapterId":31,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْمُتَبَايِعَانِ كُلُّ وَاحِدٍ مِنْهُمَا بِالْخِيَارِ عَلَى صَاحِبِهِ مَا لَمْ يَتَفَرَّقَا إِلاَّ بَيْعَ الْخِيَارِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat the Messenger of Allah, may Allah bless him and grant him peace,\nsaid, \"Both parties in a business transaction have the right of\nwithdrawal as long as they have not separated, except in the\ntransaction called khiyar.\"\n\n\nMalik said, \"There is no\nspecified limit nor any matter which is applied in this case according\nto us.\""}},{"id":82,"idInBook":82,"chapterId":31,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ، كَانَ يُحَدِّثُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَيُّمَا بَيِّعَيْنِ تَبَايَعَا فَالْقَوْلُ مَا قَالَ الْبَائِعُ أَوْ يَتَرَادَّانِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me that he had heard that Abdullah ibn Masud\nused to relate that the Messenger of Allah, may Allah bless him and\ngrant him peace, said, \"When two parties dispute about a business\ntransaction, the seller's word is taken, or they make an agreement\namong themselves.\n\n\nMalik spoke about someone who sold goods to\na man, and said at the contracting of the sale, 'I will sell to you\nprovided I consult so-and-so. If he is satisfied, the sale is\npermitted. If he dislikes it, there is no sale between us.' They made\nthe transaction on that basis. Then the buyer regretted before the\nseller consulted the person.\n\n\nMalik said, \"That sale is\nbinding on them according to what they described. The buyer has no\nright of withdrawal, and it is binding on him, if the person whom the\nseller stipulated to him, permits it.\"\n\n\nMalik said, \"The way\nof doing things among us about a man who buys goods from another and\nthey differ about the price, and the seller says, 'I sold them to you\nfor ten dinars,' and the buyer says, 'I bought them from you for five\ndinars,' is that it is said to the seller, 'If you like, give them to\nthe buyer for what he said. If you like, swear by Allah that you only\nsold your goods for what you said.' If he swears it is said to the\nbuyer, 'Either you take the goods for what the seller said, or you\nswear by Allah that you bought them only for what you said.' If he\nswears, he is free to return the goods. That is when each of them\ntestifies against the other.\""}},{"id":83,"idInBook":83,"chapterId":31,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنْ بُسْرِ بْنِ سَعِيدٍ، عَنْ عُبَيْدٍ أَبِي صَالِحٍ، مَوْلَى السَّفَّاحِ أَنَّهُ قَالَ بِعْتُ بَزًّا لِي مِنْ أَهْلِ دَارِ نَخْلَةَ إِلَى أَجَلٍ ثُمَّ أَرَدْتُ الْخُرُوجَ إِلَى الْكُوفَةِ فَعَرَضُوا عَلَىَّ أَنْ أَضَعَ عَنْهُمْ بَعْضَ الثَّمَنِ وَيَنْقُدُونِي فَسَأَلْتُ عَنْ ذَلِكَ زَيْدَ بْنَ ثَابِتٍ فَقَالَ لاَ آمُرُكَ أَنْ تَأْكُلَ هَذَا وَلاَ تُوكِلَهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'z-Zinad from Busr ibn\nSaid from Ubayd, Abu Salih, the mawla of as-Saffah that he said, \"I\nsold drapery to the people of Dar Nakhla on credit. Then I wanted to\ngo to Kufa, so they proposed that I reduce the price for them and they\nwould pay me immediately . I asked Zayd ibn Thabit about that, and he\nsaid, 'I order you not to accept increase or to give to anybody.' \""}},{"id":84,"idInBook":84,"chapterId":31,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عُثْمَانَ بْنِ حَفْصِ بْنِ خَلْدَةَ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ سُئِلَ عَنِ الرَّجُلِ، يَكُونُ لَهُ الدَّيْنُ عَلَى الرَّجُلِ إِلَى أَجَلٍ فَيَضَعُ عَنْهُ صَاحِبُ الْحَقِّ وَيُعَجِّلُهُ الآخَرُ فَكَرِهَ ذَلِكَ عَبْدُ اللَّهِ بْنُ عُمَرَ وَنَهَى عَنْهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Uthman ibn Hafs ibn Khalda\nfrom Ibn Shihab from Salim ibn Abdullah that Abdullah ibn Umar was\nasked about a man who took a loan from another man for a set term. The\ncreditor reduced the debt, and the man paid it immediately Abdullah\nibn Umar disliked that, and forbade it."}},{"id":85,"idInBook":85,"chapterId":31,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ زَيْدِ بْنِ أَسْلَمَ، أَنَّهُ قَالَ كَانَ الرِّبَا فِي الْجَاهِلِيَّةِ أَنْ يَكُونَ لِلرَّجُلِ عَلَى الرَّجُلِ الْحَقُّ إِلَى أَجَلٍ فَإِذَا حَلَّ الأَجَلُ قَالَ أَتَقْضِي أَمْ تُرْبِي فَإِنْ قَضَى أَخَذَ وَإِلاَّ زَادَهُ فِي حَقِّهِ وَأَخَّرَ عَنْهُ فِي الأَجَلِ ‏.‏ قَالَ مَالِكٌ وَالأَمْرُ الْمَكْرُوهُ الَّذِي لاَ اخْتِلاَفَ فِيهِ عِنْدَنَا أَنْ يَكُونَ لِلرَّجُلِ عَلَى الرَّجُلِ الدَّيْنُ إِلَى أَجَلٍ فَيَضَعُ عَنْهُ الطَّالِبُ وَيُعَجِّلُهُ الْمَطْلُوبُ وَذَلِكَ عِنْدَنَا بِمَنْزِلَةِ الَّذِي يُؤَخِّرُ دَيْنَهُ بَعْدَ مَحِلِّهِ عَنْ غَرِيمِهِ وَيَزِيدُهُ الْغَرِيمُ فِي حَقِّهِ قَالَ فَهَذَا الرِّبَا بِعَيْنِهِ لاَ شَكَّ فِيهِ ‏.‏ قَالَ مَالِكٌ فِي الرَّجُلِ يَكُونُ لَهُ عَلَى الرَّجُلِ مِائَةُ دِينَارٍ إِلَى أَجَلٍ فَإِذَا حَلَّتْ قَالَ لَهُ الَّذِي عَلَيْهِ الدَّيْنُ بِعْنِي سِلْعَةً يَكُونُ ثَمَنُهَا مِائَةَ دِينَارٍ نَقْدًا بِمِائَةٍ وَخَمْسِينَ إِلَى أَجَلٍ هَذَا بَيْعٌ لاَ يَصْلُحُ وَلَمْ يَزَلْ أَهْلُ الْعِلْمِ يَنْهَوْنَ عَنْهُ ‏.‏ قَالَ مَالِكٌ وَإِنَّمَا كُرِهَ ذَلِكَ لأَنَّهُ إِنَّمَا يُعْطِيهِ ثَمَنَ مَا بَاعَهُ بِعَيْنِهِ وَيُؤَخِّرُ عَنْهُ الْمِائَةَ الأُولَى إِلَى الأَجَلِ الَّذِي ذَكَرَ لَهُ آخِرَ مَرَّةٍ وَيَزْدَادُ عَلَيْهِ خَمْسِينَ دِينَارًا فِي تَأْخِيرِهِ عَنْهُ فَهَذَا مَكْرُوهٌ وَلاَ يَصْلُحُ وَهُوَ أَيْضًا يُشْبِهُ حَدِيثَ زَيْدِ بْنِ أَسْلَمَ فِي بَيْعِ أَهْلِ الْجَاهِلِيَّةِ إِنَّهُمْ كَانُوا إِذَا حَلَّتْ دُيُونُهُمْ قَالُوا لِلَّذِي عَلَيْهِ الدَّيْنُ إِمَّا أَنْ تَقْضِيَ وَإِمَّا أَنْ تُرْبِيَ ‏.‏ فَإِنْ قَضَى أَخَذُوا وَإِلاَّ زَادُوهُمْ فِي حُقُوقِهِمْ وَزَادُوهُمْ فِي الأَجَلِ ‏.‏","english":{"narrator":"","text":"Malik related to me that Zayd ibn Aslam said, \"Usury in the\nJahiliyya was that a man would give a loan to a man for a set term.\nWhen the term was due, he would say, 'Will you pay it off or increase\nme?' If the man paid, he took it. If not, he increased him in his debt\nand lengthened the term for him .\"\n\n\nMalik said, \"The\ndisapproved of way of doing things about which there is no dispute\namong us, is that a man should give a loan to a man for a term, and\nthen the demander reduce it and the one from whom it is demanded pay\nit in advance. To us that is like someone who delays repaying his debt\nafter it is due to his creditor and his creditor increases his debt.\"\nMalik said, \"This is nothing else but usury. No doubt about it.\"\n\n\nMalik spoke about a man who loaned one hundred dinars to a man for\ntwo terms. When it was due, the person who owed the debt said to him,\n\"Sell me some goods, whose price is one hundred dinars in cash for one\nhundred and fifty on credit.\" Malik said, \"This transaction is not\ngood, and the people of knowledge still forbid it.\"\n\n\nMalik\nsaid, \"This is disapproved of because the creditor himself gives the\ndebtor the price of what the man sells him, and he defers repayment of\nthe hundred of the first transaction for the debtor for the term which\nis mentioned to him in the second transaction, and the debtor\nincreases him with fifty dinars for his deferring him. That is\ndisapproved of and it is not good. It also resembles the hadith of\nZayd ibn Aslam about the transactions of the people of the Jahiliyya.\nWhen their debts were due, they said to the person with the debt,\n'Either you pay in full or you increase it.' If they paid, they took\nit, and if not they increased debtors in their debts, and extended the\nterm for them.\""}},{"id":86,"idInBook":86,"chapterId":31,"bookId":7,"arabic":"حَدَّثَنَا يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَطْلُ الْغَنِيِّ ظُلْمٌ وَإِذَا أُتْبِعَ أَحَدُكُمْ عَلَى مَلِيءٍ فَلْيَتْبَعْ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'z-Zinad from al Araj from\nAbu Hurayra that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"Delay in payment by a rich man is injustice, but\nwhen one of you is referred for payment to a wealthy man, let him be\nreferred.\""}},{"id":87,"idInBook":87,"chapterId":31,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ مُوسَى بْنِ مَيْسَرَةَ، أَنَّهُ سَمِعَ رَجُلاً، يَسْأَلُ سَعِيدَ بْنَ الْمُسَيَّبِ فَقَالَ إِنِّي رَجُلٌ أَبِيعُ بِالدَّيْنِ ‏.‏ فَقَالَ سَعِيدٌ لاَ تَبِعْ إِلاَّ مَا آوَيْتَ إِلَى رَحْلِكَ ‏.‏ قَالَ مَالِكٌ فِي الَّذِي يَشْتَرِي السِّلْعَةَ مِنَ الرَّجُلِ عَلَى أَنْ يُوَفِّيَهُ تِلْكَ السِّلْعَةَ إِلَى أَجَلٍ مُسَمًّى إِمَّا لِسُوقٍ يَرْجُو نَفَاقَهَا فِيهِ وَإِمَّا لِحَاجَةٍ فِي ذَلِكَ الزَّمَانِ الَّذِي اشْتَرَطَ عَلَيْهِ ثُمَّ يُخْلِفُهُ الْبَائِعُ عَنْ ذَلِكَ الأَجَلِ فَيُرِيدُ الْمُشْتَرِي رَدَّ تِلْكَ السِّلْعَةِ عَلَى الْبَائِعِ إِنَّ ذَلِكَ لَيْسَ لِلْمُشْتَرِي وَإِنَّ الْبَيْعَ لاَزِمٌ لَهُ وَإِنَّ الْبَائِعَ لَوْ جَاءَ بِتِلْكَ السِّلْعَةِ قَبْلَ مَحِلِّ الأَجَلِ لَمْ يُكْرَهِ الْمُشْتَرِي عَلَى أَخْذِهَا ‏.‏ قَالَ مَالِكٌ فِي الَّذِي يَشْتَرِي الطَّعَامَ فَيَكْتَالُهُ ثُمَّ يَأْتِيهِ مَنْ يَشْتَرِيهِ مِنْهُ فَيُخْبِرُ الَّذِي يَأْتِيهِ أَنَّهُ قَدِ اكْتَالَهُ لِنَفْسِهِ وَاسْتَوْفَاهُ فَيُرِيدُ الْمُبْتَاعُ أَنْ يُصَدِّقَهُ وَيَأْخُذَهُ بِكَيْلِهِ إِنَّ مَا بِيعَ عَلَى هَذِهِ الصِّفَةِ بِنَقْدٍ فَلاَ بَأْسَ بِهِ وَمَا بِيعَ عَلَى هَذِهِ الصِّفَةِ إِلَى أَجَلٍ فَإِنَّهُ مَكْرُوهٌ حَتَّى يَكْتَالَهُ الْمُشْتَرِي الآخَرُ لِنَفْسِهِ وَإِنَّمَا كُرِهَ الَّذِي إِلَى أَجَلٍ لأَنَّهُ ذَرِيعَةٌ إِلَى الرِّبَا وَتَخَوُّفٌ أَنْ يُدَارَ ذَلِكَ عَلَى هَذَا الْوَجْهِ بِغَيْرِ كَيْلٍ وَلاَ وَزْنٍ فَإِنْ كَانَ إِلَى أَجَلٍ فَهُوَ مَكْرُوهٌ وَلاَ اخْتِلاَفَ فِيهِ عِنْدَنَا ‏.‏ قَالَ مَالِكٌ لاَ يَنْبَغِي أَنْ يُشْتَرَى دَيْنٌ عَلَى رَجُلٍ غَائِبٍ وَلاَ حَاضِرٍ إِلاَّ بِإِقْرَارٍ مِنَ الَّذِي عَلَيْهِ الدَّيْنُ وَلاَ عَلَى مَيِّتٍ وَإِنْ عَلِمَ الَّذِي تَرَكَ الْمَيِّتُ وَذَلِكَ أَنَّ اشْتِرَاءَ ذَلِكَ غَرَرٌ لاَ يُدْرَى أَيَتِمُّ أَمْ لاَ يَتِمُّ ‏.‏ قَالَ وَتَفْسِيرُ مَا كُرِهَ مِنْ ذَلِكَ أَنَّهُ إِذَا اشْتَرَى دَيْنًا عَلَى غَائِبٍ أَوْ مَيِّتٍ أَنَّهُ لاَ يُدْرَى مَا يَلْحَقُ الْمَيِّتَ مِنَ الدَّيْنِ الَّذِي لَمْ يُعْلَمْ بِهِ فَإِنْ لَحِقَ الْمَيِّتَ دَيْنٌ ذَهَبَ الثَّمَنُ الَّذِي أَعْطَى الْمُبْتَاعُ بَاطِلاً ‏.‏ قَالَ مَالِكٌ وَفِي ذَلِكَ أَيْضًا عَيْبٌ آخَرُ أَنَّهُ اشْتَرَى شَيْئًا لَيْسَ بِمَضْمُونٍ لَهُ وَإِنْ لَمْ يَتِمَّ ذَهَبَ ثَمَنُهُ بَاطِلاً فَهَذَا غَرَرٌ لاَ يَصْلُحُ ‏.‏ قَالَ مَالِكٌ وَإِنَّمَا فُرِقَ بَيْنَ أَنْ لاَ يَبِيعَ الرَّجُلُ إِلاَّ مَا عِنْدَهُ وَأَنْ يُسَلِّفَ الرَّجُلُ فِي شَىْءٍ لَيْسَ عِنْدَهُ أَصْلُهُ أَنَّ صَاحِبَ الْعِينَةِ إِنَّمَا يَحْمِلُ ذَهَبَهُ الَّتِي يُرِيدُ أَنْ يَبْتَاعَ بِهَا فَيَقُولُ هَذِهِ عَشَرَةُ دَنَانِيرَ فَمَا تُرِيدُ أَنْ أَشْتَرِيَ لَكَ بِهَا فَكَأَنَّهُ يَبِيعُ عَشَرَةَ دَنَانِيرَ نَقْدًا بِخَمْسَةَ عَشَرَ دِينَارًا إِلَى أَجَلٍ فَلِهَذَا كُرِهَ هَذَا وَإِنَّمَا تِلْكَ الدُّخْلَةُ وَالدُّلْسَةُ ‏.‏","english":{"narrator":"","text":"86 Malik related to me from Musa ibn Maysara that he heard a man\nask Said ibn al-Musayyab, \"I am a man who sells for a debt.\" Said\nsaid, \"Do not sell except for what you take to your camel.\"\n\n\nMalik spoke about a person who bought goods from a man provided that\nhe provide him with those goods by a specific date, either in time for\na market in which he hoped for their saleability, or to fulfil a need\nat the time he stipulated. Then the seller failed him about the date,\nand the buyer wanted to return those goods to the seller. Malik said,\n\"The buyer cannot do that, and the sale is binding on him. If the\nseller does bring the goods before the completion of the term, the\nbuyer cannot be forced to take them.\"\n\n\nMalik spoke about a\nperson who bought food and measured it. Then some one came to him to\nbuy it and he told him that he had measured it for himself and taken\nit in full. The new buyer wanted to trust him and accept his measure.\nMalik said, \"Whatever is sold in this way for cash has no harm in it\nbut whatever is sold in this way on delayed terms is disapproved of\nuntil the new buyer measures it out for himself. The sale with delayed\nterms is disapproved of because it leads to usury and it is feared\nthat it will be circulated in this way without weight or measure. If\nthe terms are delayed it is disapproved of and there is no\ndisagreement about that with us.\"\n\n\nMalik said, \"One should not\nbuy a debt owed by a man whether present or absent, without the\nconfirmation of the one who owes the debt, nor should one buy a debt\nowed to a man by a dead person even if one knows what the deceased man\nhas left. That is because to buy that is an uncertain transaction and\none does not know whether the transaction will be completed or not\ncompleted.\"\n\n\nHe said, \"The explanation of what is disapproved\nof in buying a debt owed by someone absent or dead, is that it is not\nknown what unknown debtor may be connected to the dead person. If the\ndead person is liable for another debt, the price which the buyer gave\non strength of the debt may become worthless.\"\n\n\nMalik said,\n\"There is another fault in that as well. He is buying something which\nis not guaranteed for him, and so if the deal is not completed, what\nhe paid becomes worthless. This is an uncertain transaction and it is\nnot good.\"\n\n\nMalik said, \"One distinguishes between a man who\nis only selling what he actually has and a man who is being paid in\nadvance for something which is not yet in his possession. The man\nadvancing the money brings his gold which he intends to buy with. The\nseller says, 'This is 10 dinars. What do you want me to buy for you\nwith it?' It is as if he sold 10 dinars cash for 15 dinars to be paid\nlater. Because of this, it is disapproved of. It is something leading\nto usury and fraud.\""}},{"id":88,"idInBook":88,"chapterId":31,"bookId":7,"arabic":"","english":{"narrator":"","text":"Malik said there was no harm if a man who sold some drapery and\nexcluded some garments by their markings, stipulated that he chose the\nmarked ones from that. If he did not stipulate that he would choose\nfrom them when he made the exclusion, I think that he is partner in\nthe number of drapery goods which were purchased from him. That is\nbecause two garments can be alike in marking and be greatly different\nin price.\n\n\nMalik said, \"The way of doing things among us is\nthat there is no harm in partnership, transferring responsibility to\nan agent, and revocation when dealing with food and other things,\nwhether or not possession was taken, when the transaction is with\ncash, and there is no profit, loss, or deferment of price in it. If\nprofit or loss or deferment of price from one of the two enters any of\nthese transactions, it becomes sale which is made halal by what makes\nsale halal, and made haram by what makes sale haram, and it is not\npartnership, transferring responsibility to an agent, or revocation.\"\n\n\nMalik spoke about some one who bought drapery goods or\nslaves, and the sale was concluded, then a man asked him to be his\npartner and he agreed and the new partner paid the whole price to the\nseller and then something happened to the goods which removed them\nfrom their possession. Malik said, \"The new partner takes the price\nfrom the original partner and the original partner demands from the\nseller the whole price unless the original partner stipulated on the\nnew partner during the sale and before the transaction with the seller\nwas completed that the seller was responsible to him. If the\ntransaction has ended and the seller has gone, the pre-condition of\nthe original partner is void, and he has the responsibility.\"\n\n\nMalik spoke about a man who asked another man to buy certain goods to\nshare between them, and he wanted the other man to pay for him and he\nwould sell the goods for the other man. Malik said, \"That is not good.\nWhen he says, 'Pay for me and I will sell it for you,' it becomes a\nloan which he makes to him in order that he sell it for him and if\nthose goods are destroyed, or pass, the man who paid the price will\ndemand from his partner what he put in for him. This is part of the\nadvance which brings in profit.\"\n\n\nMalik said, \"If a man buys\ngoods, and they are settled for him, and then a man says to him,\n'Share half of these goods with me, and I will sell them all for you,'\nthat is halal, there is no harm in it. The explanation of that is that\nthis is a new sale and he sells him half of the goods provided that he\nsells the whole lot.\""}},{"id":89,"idInBook":89,"chapterId":31,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَيُّمَا رَجُلٍ بَاعَ مَتَاعًا فَأَفْلَسَ الَّذِي ابْتَاعَهُ مِنْهُ وَلَمْ يَقْبِضِ الَّذِي بَاعَهُ مِنْ ثَمَنِهِ شَيْئًا فَوَجَدَهُ بِعَيْنِهِ فَهُوَ أَحَقُّ بِهِ وَإِنْ مَاتَ الَّذِي ابْتَاعَهُ فَصَاحِبُ الْمَتَاعِ فِيهِ أُسْوَةُ الْغُرَمَاءِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Abu Bakr ibn\nAbd ar-Rahman ibn al-Harith ibn Hisham that the Messenger of Allah,\nmay Allah bless him and grant him peace, said, \"Whenever a man sells\nwares and then the buyer becomes bankrupt and the seller has not taken\nany of the price and he finds some of his property intact with the\nbuyer, he is more entitled to it than anyone else. If the buyer dies,\nthen the seller is the same as other creditors with respect to it.\""}},{"id":90,"idInBook":90,"chapterId":31,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، عَنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ، عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَيُّمَا رَجُلٍ أَفْلَسَ فَأَدْرَكَ الرَّجُلُ مَالَهُ بِعَيْنِهِ فَهُوَ أَحَقُّ بِهِ مِنْ غَيْرِهِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me from Yahya ibn Said from Abu Bakr ibn\nMuhammad ibn Amr ibn Hazm from Umar ibn Abdal-Aziz from Abu Bakr ibn\nAbd ar-Rahman ibn al-Harith ibn Hisham from Abu Hurayra that the\nMessenger of Allah, may Allah bless him and grant him peace, said, \"If\nanyone goes bankrupt, and a man finds his own property intact with\nhim, he is more entitled to it than anyone else.\"\n\n\nMalik spoke\nabout a man who sold a man wares, and the buyer went bankrupt. He\nsaid, \"The seller takes whatever of his goods he finds. If the buyer\nhas sold some of them and distributed them, the seller of the wares is\nmore entitled to them than the creditors. What the buyer has\ndistributed does not prevent the seller from taking whatever of it he\nfinds. It is the seller's right if he has received any of the price\nfrom the buyer and he wants to return it to take what he finds of his\nwares, and in what he does not find, he is like the creditors.\"\n\n\nMalik spoke about some one who bought spun wool or a plot of land,\nand then did some work on it, like building a house on the plot of\nland or weaving the spun wool into cloth. Then he went bankrupt after\nhe had bought it, and the original owner of the plot said, \"I will\ntake the plot and whatever structure is on it.\" Malik said, \"That\nstructure is not his. However, the plot and what is in it that the\nbuyer has improved is appraised. Then one sees what the price of the\nplot is and how much of that value is the price of the structure. They\nare partners in that. The owner of the plot has as much as his\nportion, and the creditors have the amount of the portion of the\nstructure.\"\n\n\nMalik said, \"The explanation of that is that the\nvalue of it all is fifteen hundred dirhams. The value of the plot is\nfive hundred dirhams, and the value of the building is one thousand\ndirhams. The owner of the plot has a third, and the creditors have\ntwo-thirds.\"\n\n\nMalik said, \"It is like that with spinning and\nother things of the same nature in these circumstances and the buyer\nhas a debt which he cannot pay. This is the behaviour in such cases.\"\n\n\nMalik said, \"As for goods which have been sold and which the\nbuyer does not improve, but those goods sell well and have gone up in\nprice, so their owner wants them and the creditors also want to seize\nthem, then the creditors choose between giving the owner of the goods\nthe price for which he sold them and not giving him any loss and\nsurrendering his goods to him.\n\n\n\"If the price of the goods has\ngone down, the one who sold them has a choice. If he likes, he can\ntake his goods and he has no claim to any of his debtor's property,\nand that is his right. If he likes, he can be one of the creditors and\ntake a portion of his due and not take his goods. That is up to him.\"\n\n\nMalik said about someone who bought a slave-girl or animal\nand she gave birth in his possession and the buyer went bankrupt, \"The\nslave-girl or the animal and the offspring belong to the seller unless\nthe creditors desire it. In that case they give him his complete due\nand they take it.\""}},{"id":91,"idInBook":91,"chapterId":31,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي رَافِعٍ، مَوْلَى رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ قَالَ اسْتَسْلَفَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَكْرًا فَجَاءَتْهُ إِبِلٌ مِنَ الصَّدَقَةِ قَالَ أَبُو رَافِعٍ فَأَمَرَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ أَقْضِيَ الرَّجُلَ بَكْرَهُ فَقُلْتُ لَمْ أَجِدْ فِي الإِبِلِ إِلاَّ جَمَلاً خِيَارًا رَبَاعِيًا ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَعْطِهِ إِيَّاهُ فَإِنَّ خِيَارَ النَّاسِ أَحْسَنُهُمْ قَضَاءً ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Zayd ibn Aslam from Ata ibn\nYasar that Abu Rafi, the mawla of the Messenger of Allah,  may Allah\nbless him and grant him peace, said, \"The Messenger of Allah, may\nAllah bless him and grant him peace, borrowed a young camel and then\nthe camels of sadaqa came to him.\" Abu Rafi said, \"He ordered me to\nrepay the man his young camel. I said, 'I can only find a good camel\nin its seventh year in the camels.' The Messenger of Allah, may Allah\nbless him and grant him peace, said, 'Give it to him. The best of\npeople are those who discharge their debts in the best manner.' \""}},{"id":92,"idInBook":92,"chapterId":31,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ حُمَيْدِ بْنِ قَيْسٍ الْمَكِّيِّ، عَنْ مُجَاهِدٍ، أَنَّهُ قَالَ اسْتَسْلَفَ عَبْدُ اللَّهِ بْنُ عُمَرَ مِنْ رَجُلٍ دَرَاهِمَ ثُمَّ قَضَاهُ دَرَاهِمَ خَيْرًا مِنْهَا فَقَالَ الرَّجُلُ يَا أَبَا عَبْدِ الرَّحْمَنِ هَذِهِ خَيْرٌ مِنْ دَرَاهِمِي الَّتِي أَسْلَفْتُكَ ‏.‏ فَقَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ قَدْ عَلِمْتُ وَلَكِنْ نَفْسِي بِذَلِكَ طَيِّبَةٌ ‏.‏ قَالَ مَالِكٌ لاَ بَأْسَ بِأَنْ يُقْبِضَ مَنْ أُسْلِفَ شَيْئًا مِنَ الذَّهَبِ أَوِ الْوَرِقِ أَوِ الطَّعَامِ أَوِ الْحَيَوَانِ مِمَّنْ أَسْلَفَهُ ذَلِكَ أَفْضَلَ مِمَّا أَسْلَفَهُ إِذَا لَمْ يَكُنْ ذَلِكَ عَلَى شَرْطٍ مِنْهُمَا أَوْ عَادَةٍ فَإِنْ كَانَ ذَلِكَ عَلَى شَرْطٍ أَوْ وَأْىٍ أَوْ عَادَةٍ فَذَلِكَ مَكْرُوهٌ وَلاَ خَيْرَ فِيهِ ‏.‏ قَالَ وَذَلِكَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَضَى جَمَلاً رَبَاعِيًا خِيَارًا مَكَانَ بَكْرٍ اسْتَسْلَفَهُ وَأَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ اسْتَسْلَفَ دَرَاهِمَ فَقَضَى خَيْرًا مِنْهَا فَإِنْ كَانَ ذَلِكَ عَلَى طِيبِ نَفْسٍ مِنَ الْمُسْتَسْلِفِ وَلَمْ يَكُنْ ذَلِكَ عَلَى شَرْطٍ وَلاَ وَأْىٍ وَلاَ عَادَةٍ كَانَ ذَلِكَ حَلاَلاً لاَ بَأْسَ بِهِ ‏.‏","english":{"narrator":"","text":"Malik related to me from Humayd ibn Qays al-Makki that Mujahid\nsaid, \"Abdullah ibn Umar borrowed some dirhams from a man, then he\ndischarged his debt with dirhams better than them. The man said, 'Abu\nAbdar-Rahman. These are better than the dirhams which I lent you.'\nAbdullah ibn Umar said, 'I know that. But I am happy with myself about\nthat.' \"\n\n\nMalik said, \"There is no harm in a person who has\nborrowed gold, silver, food, or animals, taking to the person who lent\nit, something better than what he lent, when that is not a stipulation\nbetween them nor a custom. If that is by a stipulation or promise or\ncustom, then it is disapproved, and there is no good in it.\"\n\n\nHe said, \"That is because the Messenger of Allah, may Allah bless him\nand grant him peace, discharged his debt with a good camel in its\nseventh year in place of a young camel which he borrowed, and Abdullah\nibn Umar borrowed some dirhams, and repaid them with better ones. If\nthat is from the goodness of the borrower, and it is not by a\nstipulation, promise, or custom, it is halal and there is no harm in\nit.\""}},{"id":93,"idInBook":93,"chapterId":31,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ فِي رَجُلٍ أَسْلَفَ رَجُلاً طَعَامًا عَلَى أَنْ يُعْطِيَهُ إِيَّاهُ فِي بَلَدٍ آخَرَ فَكَرِهَ ذَلِكَ عُمَرُ بْنُ الْخَطَّابِ وَقَالَ فَأَيْنَ الْحَمْلُ يَعْنِي حُمْلاَنَهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Umar ibn\nal-Khattab said that he disapproved of one man lending another food on\nthe provision that he gave it back to him in another city. He said,\n\"Where is the transport?\""}},{"id":94,"idInBook":94,"chapterId":31,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ رَجُلاً، أَتَى عَبْدَ اللَّهِ بْنَ عُمَرَ فَقَالَ يَا أَبَا عَبْدِ الرَّحْمَنِ إِنِّي أَسْلَفْتُ رَجُلاً سَلَفًا وَاشْتَرَطْتُ عَلَيْهِ أَفْضَلَ مِمَّا أَسْلَفْتُهُ ‏.‏ فَقَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ فَذَلِكَ الرِّبَا ‏.‏ قَالَ فَكَيْفَ تَأْمُرُنِي يَا أَبَا عَبْدِ الرَّحْمَنِ فَقَالَ عَبْدُ اللَّهِ السَّلَفُ عَلَى ثَلاَثَةِ وُجُوهٍ سَلَفٌ تُسْلِفُهُ تُرِيدُ بِهِ وَجْهَ اللَّهِ فَلَكَ وَجْهُ اللَّهِ وَسَلَفٌ تُسْلِفُهُ تُرِيدُ بِهِ وَجْهَ صَاحِبِكَ فَلَكَ وَجْهُ صَاحِبِكَ وَسَلَفٌ تُسْلِفُهُ لِتَأْخُذَ خَبِيثًا بِطَيِّبٍ فَذَلِكَ الرِّبَا ‏.‏ قَالَ فَكَيْفَ تَأْمُرُنِي يَا أَبَا عَبْدِ الرَّحْمَنِ قَالَ أَرَى أَنْ تَشُقَّ الصَّحِيفَةَ فَإِنْ أَعْطَاكَ مِثْلَ الَّذِي أَسْلَفْتَهُ قَبِلْتَهُ وَإِنْ أَعْطَاكَ دُونَ الَّذِي أَسْلَفْتَهُ فَأَخَذْتَهُ أُجِرْتَ وَإِنْ أَعْطَاكَ أَفْضَلَ مِمَّا أَسْلَفْتَهُ طَيِّبَةً بِهِ نَفْسُهُ فَذَلِكَ شُكْرٌ شَكَرَهُ لَكَ وَلَكَ أَجْرُ مَا أَنْظَرْتَهُ ‏.‏","english":{"narrator":"And Malik related to me that he had heard that a man came to\nAbdullah ibn Umar and said, \"Abu Abd ar-Rahman, I gave a man a loan\nand stipulated that he give me better than what I lent him.\" Abdullah\nibn Umar said, \"That is usury.\" Abdullah said, \"Loans are of three\ntypes:","text":"A free loan which you lend by which you desire the pleasure of\nAllah, and so you have the pleasure of Allah. A free loan which you\nlend by which you desire the pleasure of your companion, so you have\nthe pleasure of your companion, and a free loan which you lend by\nwhich you take what is impure by what is pure, and that is usury.\" He\nsaid, \"What do you order me to do, Abu Abd ar-Rahman?\" He said, \"I\nthink that you should tear up the agreement. If he gives you the like\nof what you lent him, accept it. If he gives you less than what you\nlent him, take it and you will be rewarded. If he gives you better\nthan what you lent him, of his own good will, that is his gratitude to\nyou and you have the wage of the period you gave him the loan.\""}},{"id":95,"idInBook":95,"chapterId":31,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عُمَرَ، يَقُولُ مَنْ أَسْلَفَ سَلَفًا فَلاَ يَشْتَرِطْ إِلاَّ قَضَاءَهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that he heard Abdullah\nibn Umar say, \"If someone lends something, let the only condition be\nthat it is repaid.\""}},{"id":96,"idInBook":96,"chapterId":31,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ، كَانَ يَقُولُ مَنْ أَسْلَفَ سَلَفًا فَلاَ يَشْتَرِطْ أَفْضَلَ مِنْهُ وَإِنْ كَانَتْ قَبْضَةً مِنْ عَلَفٍ فَهُوَ رِبًا ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا أَنَّ مَنِ اسْتَسْلَفَ شَيْئًا مِنَ الْحَيَوَانِ بِصِفَةٍ وَتَحْلِيَةٍ مَعْلُومَةٍ فَإِنَّهُ لاَ بَأْسَ بِذَلِكَ وَعَلَيْهِ أَنْ يَرُدَّ مِثْلَهُ إِلاَّ مَا كَانَ مِنَ الْوَلاَئِدِ فَإِنَّهُ يُخَافُ فِي ذَلِكَ الذَّرِيعَةُ إِلَى إِحْلاَلِ مَا لاَ يَحِلُّ فَلاَ يَصْلُحُ وَتَفْسِيرُ مَا كُرِهَ مِنْ ذَلِكَ أَنْ يَسْتَسْلِفَ الرَّجُلُ الْجَارِيَةَ فَيُصِيبُهَا مَا بَدَا لَهُ ثُمَّ يَرُدُّهَا إِلَى صَاحِبِهَا بِعَيْنِهَا فَذَلِكَ لاَ يَصْلُحُ وَلاَ يَحِلُّ وَلَمْ يَزَلْ أَهْلُ الْعِلْمِ يَنْهَوْنَ عَنْهُ وَلاَ يُرَخِّصُونَ فِيهِ لأَحَدٍ ‏.‏","english":{"narrator":"","text":"Malik related to me that he had heard that Abdullah ibn Masud\nused to say, \"If someone makes a loan, they should not stipulate\nbetter than it. Even if it is a handful of grass, it is usury.\"\n\n\nMalik said, \"The generally agreed on way of doing things among us\nis that there is no harm in borrowing any animals with a set\ndescription and itemisation, and one must return the like of them.\nThis is not done in the case of female slaves. It is feared about that\nthat it will lead to making halal what is not halal, so it is not\ngood. The explanation of what is disapproved of in that, is that a man\nborrow a slave-girl and have intercourse with her as seems proper to\nhim. Then he returns her to her owner. That is not good and it is not\nhalal. The people of knowledge still forbid it and do not give an\nindulgence to any one in it.\""}},{"id":97,"idInBook":97,"chapterId":31,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَبِعْ بَعْضُكُمْ عَلَى بَيْعِ بَعْضٍ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat the Messenger of Allah, may Allah bless him and grant him peace,\nsaid, \"Do not let any of you bid against each other.\""}},{"id":98,"idInBook":98,"chapterId":31,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تَلَقَّوُا الرُّكْبَانَ لِلْبَيْعِ وَلاَ يَبِعْ بَعْضُكُمْ عَلَى بَيْعِ بَعْضٍ وَلاَ تَنَاجَشُوا وَلاَ يَبِعْ حَاضِرٌ لِبَادٍ وَلاَ تُصَرُّوا الإِبِلَ وَالْغَنَمَ فَمَنِ ابْتَاعَهَا بَعْدَ ذَلِكَ فَهُوَ بِخَيْرِ النَّظَرَيْنِ بَعْدَ أَنْ يَحْلُبَهَا إِنْ رَضِيَهَا أَمْسَكَهَا وَإِنْ سَخِطَهَا رَدَّهَا وَصَاعًا مِنْ تَمْرٍ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me from Abu'z-Zinad from al-Araj from Abu\nHurayra that the Messenger of Allah, may Allah bless him and grant him\npeace, said, \"Do not go out to meet the caravans for trade, do not bid\nagainst each other, outbidding in order to raise the price, and a\ntownsman must not buy on behalf of a man of the desert, and do not tie\nup the udders of camels and sheep so that they appear to have a lot of\nmilk, for a person who buys them after that has two recourses open to\nhim after he milks them. If he is pleased with them, he keeps them and\nif he is displeased with them, he can return them along with a sa of\ndates.\"\n\n\nMalik said, \"The explanation of the words of the\nMessenger of Allah, may Allah bless him and grant him peace, according\nto what we think - and Allah knows best - 'do not bid against each\nother,' is that it is forbidden for a man to offer a price over the\nprice of his brother when the seller has inclined to the bargainer and\nmade conditions about the weight of the gold and he has declared\nhimself not liable for faults and such things by which it is\nrecognised that the seller wants to make a transaction with the\nbargainer. This is what he forbade, and Allah knows best.\"\n\n\nMalik said, \"There is no harm, however, in more than one person\nbidding against each other over goods put up for sale.\"\n\n\nHe\nsaid, \"Were people to leave off haggling when the first person started\nhaggling, an unreal price might be taken and the disapproved would\nenter into the sale of the goods. This is still the way of doing\nthings among us.\""}},{"id":99,"idInBook":99,"chapterId":31,"bookId":7,"arabic":"قَالَ مَالِكٌ عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ النَّجْشِ ‏.‏","english":{"narrator":"","text":"Malik said, from Nafi from Abdullah ibn Umar that the Messenger\nof Allah, may Allah bless him and grant him peace, forbade najsh.\n\n\nMalik said, \"Najsh is to offer a man more than the worth of his\ngoods when you do not mean to buy them and someone else follows you in\nbidding.\""}},{"id":100,"idInBook":100,"chapterId":31,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَجُلاً، ذَكَرَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ يُخْدَعُ فِي الْبُيُوعِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا بَايَعْتَ فَقُلْ لاَ خِلاَبَةَ ‏\"‏ ‏.‏ قَالَ فَكَانَ الرَّجُلُ إِذَا بَايَعَ يَقُولُ لاَ خِلاَبَةَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abdullah ibn Dinar from\nAbdullah ibn Umar that a man mentioned to the Messenger of Allah, may\nAllah bless him and grant him peace, that he was always being cheated\nin business transactions. The Messenger of Allah, may Allah bless him\nand grant him peace, said, \"When you enter a transaction, say, 'No\ntrickery.' So whenever that man entered a transaction, he would say,\n'No trickery.' \""}},{"id":101,"idInBook":101,"chapterId":31,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ سَمِعَ سَعِيدَ بْنَ الْمُسَيَّبِ، يَقُولُ إِذَا جِئْتَ أَرْضًا يُوفُونَ الْمِكْيَالَ وَالْمِيزَانَ فَأَطِلِ الْمُقَامَ بِهَا وَإِذَا جِئْتَ أَرْضًا يُنَقِّصُونَ الْمِكْيَالَ وَالْمِيزَانَ فَأَقْلِلِ الْمُقَامَ بِهَا ‏.‏","english":{"narrator":"","text":"Malik related to me that Yahya ibn Said heard Said ibn al-\nMusayyab say, \"When you come to a land where they give full measure\nand full weight, stay there. When you come to a land where they\nshorten the measure and weight, then do not stay there very long.\""}},{"id":102,"idInBook":102,"chapterId":31,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ سَمِعَ مُحَمَّدَ بْنَ الْمُنْكَدِرِ، يَقُولُ أَحَبَّ اللَّهُ عَبْدًا سَمْحًا إِنْ بَاعَ سَمْحًا إِنِ ابْتَاعَ سَمْحًا إِنْ قَضَى سَمْحًا إِنِ اقْتَضَى ‏.‏ قَالَ  مَالِكٌ فِي الرَّجُلِ يَشْتَرِي الإِبِلَ أَوِ الْغَنَمَ أَوِ الْبَزَّ أَوِ الرَّقِيقَ أَوْ شَيْئًا مِنَ الْعُرُوضِ جِزَافًا إِنَّهُ لاَ يَكُونُ الْجِزَافُ فِي شَىْءٍ مِمَّا يُعَدُّ عَدًّا ‏.‏ قَالَ مَالِكٌ فِي الرَّجُلِ يُعْطِي الرَّجُلَ السِّلْعَةَ  يَبِيعُهَا لَهُ وَقَدْ قَوَّمَهَا صَاحِبُهَا قِيمَةً فَقَالَ إِنْ بِعْتَهَا بِهَذَا الثَّمَنِ الَّذِي أَمَرْتُكَ بِهِ فَلَكَ دِينَارٌ - أَوْ شَىْءٌ يُسَمِّيهِ لَهُ يَتَرَاضَيَانِ عَلَيْهِ - وَإِنْ لَمْ تَبِعْهَا فَلَيْسَ لَكَ شَىْءٌ إِنَّهُ لاَ بَأْسَ بِذَلِكَ إِذَا سَمَّى ثَمَنًا يَبِيعُهَا بِهِ وَسَمَّى أَجْرًا مَعْلُومًا إِذَا بَاعَ أَخَذَهُ وَإِنْ لَمْ يَبِعْ فَلاَ شَىْءَ لَهُ ‏.‏ قَالَ مَالِكٌ وَمِثْلُ ذَلِكَ أَنْ يَقُولَ الرَّجُلُ لِلرَّجُلِ إِنْ قَدَرْتَ عَلَى غُلاَمِي الآبِقِ أَوْ جِئْتَ بِجَمَلِي الشَّارِدِ فَلَكَ كَذَا ‏.‏ فَهَذَا مِنْ بَابِ الْجُعْلِ وَلَيْسَ مِنْ بَابِ الإِجَارَةِ وَلَوْ كَانَ مِنْ بَابِ الإِجَارَةِ لَمْ يَصْلُحْ ‏.‏ قَالَ مَالِكٌ فَأَمَّا الرَّجُلُ يُعْطَى السِّلْعَةَ فَيُقَالُ لَهُ بِعْهَا وَلَكَ كَذَا وَكَذَا فِي كُلِّ دِينَارٍ ‏.‏ لِشَىْءٍ يُسَمِّيهِ فَإِنَّ ذَلِكَ لاَ يَصْلُحُ لأَنَّهُ كُلَّمَا نَقَصَ دِينَارٌ مِنْ ثَمَنِ السِّلْعَةِ نَقَصَ مِنْ حَقِّهِ الَّذِي سَمَّى لَهُ فَهَذَا غَرَرٌ لاَ يَدْرِي كَمْ جَعَلَ لَهُ ‏.‏","english":{"narrator":"","text":"Malik related to me from Yahya ibn Said that he heard Muhammad\nibn al-Munkadir say, \"Allah loves his slave who is generous when he\nsells, and generous when he buys, generous when he repays, and\ngenerous when he is repaid.\"\n\n\nMalik said about a man who\nbought camels or sheep or dry goods or slaves or any goods without\nmeasuring precisely, \"There is no buying without measuring precisely\nin anything which can be counted . \"\n\n\nMalik said about a man\nwho gave a man goods to sell for him and set their price saying, \"If\nyou sell them for this price as I have ordered you to do, you will\nhave a dinar (or something which he has specified, which they are both\nsatisfied with), if you do not sell them, you will have nothing,\"\n\"There is no harm in that when he names a price to sell them at and\nnames a known fee. If he sells the goods, he takes the fee, and if he\ndoes not sell them, he has nothing.\"\n\n\nMalik said, \"This is\nlike saying to another man, 'If you capture my runaway slave or bring\nmy stray camel, you will have such-and-such.' This is from the\ncategory of reward, and not from the category of giving a wage. Had it\nbeen from the category of giving a wage, it would not be good.\"\n\n\nMalik said, \"As for a man who is given goods and told that if he\nsells them he will have a named percentage for every dinar, that is\nnot good because whenever he is a dinar less than the price of the\ngoods, he decreases the due which was named for him. This is an\nuncertain transaction. He does not know how much he will be given.\""}},{"id":103,"idInBook":103,"chapterId":31,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، أَنَّهُ سَأَلَهُ عَنِ الرَّجُلِ، يَتَكَارَى الدَّابَّةَ ثُمَّ يُكْرِيهَا بِأَكْثَرَ مِمَّا تَكَارَاهَا بِهِ فَقَالَ لاَ بَأْسَ بِذَلِكَ ‏.‏","english":{"narrator":"","text":"Malik related to me that he asked Ibn Shihab about a man who\nhired an animal, and then re-hired it out for more than what he hired\nit for. He said, \"There is no harm in that.\""}}],"chapter":{"id":31,"bookId":7,"arabic":"كتاب البيوع","english":"Business Transactions"}}