{"metadata":{"length":16,"arabic":{"title":"موطأ مالك","author":"الإمام مالك بن أنس","introduction":"كتاب القراض"},"english":{"title":"Muwatta Malik","author":"Imam Malik ibn Anas","introduction":"Qirad"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":32,"bookId":7,"arabic":"حَدَّثَنِي مَالِكٌ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَبِيهِ، أَنَّهُ قَالَ خَرَجَ عَبْدُ اللَّهِ وَعُبَيْدُ اللَّهِ ابْنَا عُمَرَ بْنِ الْخَطَّابِ فِي جَيْشٍ إِلَى الْعِرَاقِ فَلَمَّا قَفَلاَ مَرَّا عَلَى أَبِي مُوسَى الأَشْعَرِيِّ وَهُوَ أَمِيرُ الْبَصْرَةِ فَرَحَّبَ بِهِمَا وَسَهَّلَ ثُمَّ قَالَ لَوْ أَقْدِرُ لَكُمَا عَلَى أَمْرٍ أَنْفَعُكُمَا بِهِ لَفَعَلْتُ ‏.‏ ثُمَّ قَالَ بَلَى هَا هُنَا مَالٌ مِنْ مَالِ اللَّهِ أُرِيدُ أَنْ أَبْعَثَ بِهِ إِلَى أَمِيرِ الْمُؤْمِنِينَ فَأُسْلِفُكُمَاهُ فَتَبْتَاعَانِ بِهِ مَتَاعًا مِنْ مَتَاعِ الْعِرَاقِ ثُمَّ تَبِيعَانِهِ بِالْمَدِينَةِ فَتُؤَدِّيَانِ رَأْسَ الْمَالِ إِلَى أَمِيرِ الْمُؤْمِنِينَ وَيَكُونُ الرِّبْحُ لَكُمَا فَقَالاَ وَدِدْنَا ذَلِكَ ‏.‏ فَفَعَلَ وَكَتَبَ إِلَى عُمَرَ بْنِ الْخَطَّابِ أَنْ يَأْخُذَ مِنْهُمَا الْمَالَ فَلَمَّا قَدِمَا بَاعَا فَأُرْبِحَا فَلَمَّا دَفَعَا ذَلِكَ إِلَى عُمَرَ قَالَ أَكُلُّ الْجَيْشِ أَسْلَفَهُ مِثْلَ مَا أَسْلَفَكُمَا قَالاَ لاَ ‏.‏ فَقَالَ عُمَرُ بْنُ الْخَطَّابِ ابْنَا أَمِيرِ الْمُؤْمِنِينَ فَأَسْلَفَكُمَا أَدِّيَا الْمَالَ وَرِبْحَهُ ‏.‏ فَأَمَّا عَبْدُ اللَّهِ فَسَكَتَ وَأَمَّا عُبَيْدُ اللَّهِ فَقَالَ مَا يَنْبَغِي لَكَ يَا أَمِيرَ الْمُؤْمِنِينَ هَذَا لَوْ نَقَصَ هَذَا الْمَالُ أَوْ هَلَكَ لَضَمِنَّاهُ ‏.‏ فَقَالَ عُمَرُ أَدِّيَاهُ ‏.‏ فَسَكَتَ عَبْدُ اللَّهِ وَرَاجَعَهُ عُبَيْدُ اللَّهِ ‏.‏ فَقَالَ رَجُلٌ مِنْ جُلَسَاءِ عُمَرَ يَا أَمِيرَ الْمُؤْمِنِينَ لَوْ جَعَلْتَهُ قِرَاضًا ‏.‏ فَقَالَ عُمَرُ قَدْ جَعَلْتُهُ قِرَاضًا ‏.‏ فَأَخَذَ عُمَرُ رَأْسَ الْمَالِ وَنِصْفَ رِبْحِهِ وَأَخَذَ عَبْدُ اللَّهِ وَعُبَيْدُ اللَّهِ ابْنَا عُمَرَ بْنِ الْخَطَّابِ نِصْفَ رِبْحِ الْمَالِ ‏.‏","english":{"narrator":"","text":"Malik related to me from Zayd ibn Aslam that his father said,\n\"Abdullah and Ubaydullah, the sons of Umar ibn al-Khattab went out\nwith the army to Iraq. On the way home, they passed by Abu Musa al-\nAshari who was the amir of Basra. He greeted them and made them\nwelcome, and told them that if there was anything he could do to help\nthem, he would do it. Then he said, 'There is some of the property of\nAllah which I want to send to the amir al-muminin, so I will lend it\nto you, and you can buy wares from Iraq and sell them in Madina. Then\ngive the principal to the amir al-muminin, and you keep the profit.'\nThey said that they would like to do it, and so he gave them the money\nand wrote to Umar ibn al-Khattab to take the money from them. When\nthey came to sell they made a profit, and when they paid the principal\nto Umar he asked, 'Did he lend everyone in the army the like of what\nhe lent you?' They said, 'No.' Umar ibn al-Khattab said, 'He made you\nthe loan, because you are the sons of the amir al-muminin, so pay the\nprincipal and the profit.' Abdullah was silent. Ubaydullah said, 'You\ndo not need to do this, amir al-muminin. Had the principal decreased\nor been destroyed, we would have guaranteed it.' Umar said, 'Pay it.'\nAbdullah was silent, and Ubaydullah repeated it. A man who was sitting\nwith Umar said, 'Amir al-muminin, better that you make it a qirad.\n'Umar said, 'I have made it qirad.' Umar then took the principal and\nhalf of the profit, and Abdullah and Ubaydullah, the sons of Umar ibn\nal-Khattab took half of the profit.\""}},{"id":2,"idInBook":2,"chapterId":32,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنِ الْعَلاَءِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ عُثْمَانَ بْنَ عَفَّانَ، أَعْطَاهُ مَالاً قِرَاضًا يَعْمَلُ فِيهِ عَلَى أَنَّ الرِّبْحَ بَيْنَهُمَا ‏.‏","english":{"narrator":"","text":"Malik related to me from al-Ala ibn Abd ar-Rahman from his father\nfrom his father that Uthman ibn Affan gave him some money as qirad to\nuse provided the profit was shared between them."}},{"id":3,"idInBook":3,"chapterId":32,"bookId":7,"arabic":"","english":{"narrator":"","text":"Malik said, \"The recognised and permitted form of qirad is that a\nman take capital from an associate to use. He does not guarantee it\nand in travelling pays out of the capital for food and clothes and\nwhat he makes good use of, according to the amount of capital. That\nis, when he travels to do the work and the capital can support it. If\nhe remains with his people, he does not have expenses or clothing from\nthe capital.\"\n\n\nMalik said, \"There is no harm in the two\nparties in a qirad helping each other by way of a favour when it is\nacceptable to them both.\"\n\n\nMalik said, \"There is no harm in\nthe investor of the capital buying some of the goods from the agent in\nthe qirad if that is acceptable and without conditions.\"\n\n\nMalik spoke about an investor making a qirad loan to a man and his\nslave, to be used by both. He said, \"That is permitted, and there is\nno harm in it because the profit is property for his slave, and the\nprofit is not for the master until he takes it from him. It is like\nthe rest of his earnings.\""}},{"id":4,"idInBook":4,"chapterId":32,"bookId":7,"arabic":"","english":{"narrator":"","text":"Malik said, \"When a man owes money to another man and he asks him\nto let it stay with him as a quirad, that is disapproved of until the\ncreditor receives his property. Then he can make it a qirad loan or\nkeep it. That is because the debtor may be in a tight situation, and\nwant to delay it to increase it for him.\"\n\n\nMalik spoke about\nan investor who made a qirad loan to a man, and some of the principal\nwas lost before he used it, and then he used it and made a profit. The\nagent wanted to make the principal the remainder of the money after\nwhat was lost from it. Malik said, \"His statement is not accepted, and\nthe principal is made up to its original amount from his profit. Then\nthey divide what remains after the principal has been repaid according\nto the conditions of the qirad.\"\n\n\nMalik said, \"Qirad loan is\nonly good in gold or silver coin and it is never permitted in any kind\nof wares or goods or articles.\"\n\n\nMalik said, \"There are\ncertain transactions which if a long span of time passes after the\ntransaction takes place, its revocation becomes unacceptable. As for\nusury, there is never anything except its rejection whether it is a\nlittle or a lot. What is permitted in other than it is not permitted\nin it because Allah, the Blessed and the Exalted, said in His Book,\n'If you repent, you have your capital back, not wronging and not\nwronged. ' \"\n\n\n32.4 Conditions Permitted in Qirad"}},{"id":5,"idInBook":5,"chapterId":32,"bookId":7,"arabic":"","english":{"narrator":"","text":"Yahya said that Malik spoke about an investor who made a qirad\nloan and stipulated to the agent that only certain goods should be\nbought with his money or he forbade certain goods which he named to be\nbought. He said, \"There is no harm in an investor making a condition\non an agent in qirad not to buy a certain kind of animal or goods\nwhich he specifies. It is disapproved of for an investor to make as a\ncondition on an agent in qirad that he only buy certain goods unless\nthe goods which he orders him to buy are in plentiful supply and do\nnot fail either in winter or summer. There is no harm in that case.\"\n\n\nMalik spoke about an investor who loaned qirad money and\nstipulated that something of the profit should be his alone without\nthe agent sharing in it. He said, \"That is not good, even if it is\nonly one dirham unless he stipulates that half the profit is his and\nhalf the profit is the agent's or a third or a fourth or whatever.\nWhen he names a percentage, whether great or small, everything\nspecified by that is halal. This is the qirad of the muslims.\"\n\n\nHe said, \"It is also not good if the investor stipulates that one\ndirham or more of the profit is purely his, with out the agent sharing\nit and then what remains of the profit is to be divided in half\nbetween them. That is not the qirad of the Muslims.\""}},{"id":6,"idInBook":6,"chapterId":32,"bookId":7,"arabic":"","english":{"narrator":"","text":"Yahya said that Malik said, \"The person who puts up the principal\nmust not stipulate that he has something of the profit alone without\nthe agent sharing in it, nor must the agent stipulate that he has\nsomething of the profit alone without the investor sharing. In qirad,\nthere is no sale, no rent, no work, no advance, and no convenience\nwhich one party specifies to himself without the other party sharing\nunless one party allows it to the other unconditionally as a favour\nand that is alright to both. Neither of the parties should make a\ncondition over the other which increases him in gold or silver or food\nover the other party.\"\n\n\nHe said, \"If any of that enters the\nqirad, it becomes hire, and hire is only good with known and fixed\nterms. The agent should not stipulate when he takes the principal that\nhe repay or commission anyone with the goods, nor that he take any of\nthem for himself. When there is a profit, and it is time to separate\nthe capital, then they divide the profit according to the terms of the\ncontract. If the principal does not increase or there is a loss, the\nagent does not have to make up for what he spent on himself or for the\nloss. That falls to the investor from the principal. Qirad is\npermitted upon whatever terms the investor and the agent make a mutual\nagreement, of half the profit, or a third or a fourth or whatever.\"\n\n\nMalik said, \"It is not permitted for the agent to stipulate\nthat he use the qirad money for a certain number of years and that it\nnot be taken from him during that time.\"\n\n\nHe said, \"It is not\ngood for the investor to stipulate that the qirad money should not be\nreturned for a certain number of years which are specified, because\nthe qirad is not for a term. The investor loans it to an agent to use\nfor him. If it seems proper to either of them to abandon the project\nand the money is coin, and nothing has been bought with it, it can be\nabandoned, and the investor takes his money back. If it seems proper\nto the investor to take the qirad loan back after goods have been\npurchased with it, he cannot do so until the buyer has sold the goods\nand they have become money. If it seems proper to the agent to return\nthe loan, and it has been turned to goods he cannot do so until he has\nsold them. He returns the loan in cash as he took it.\"\n\n\nMalik\nsaid, \"It is not good for the investor to stipulate that the agent pay\nany zakat due from his portion of the profit in particular, because\nthe investor by stipulating that, stipulates fixed increase for\nhimself from the profit because the portion of zakat he would be\nliable for by his portion of the profit, is removed from him.\n\n\n\"It is not permitted for the investor to stipulate to the agent to\nonly buy from so-and-so, referring to a specific man. That is not\npermitted because by doing so he would become his hireling for a\nwage.\"\n\n\nMalik spoke about an investor in qirad who stipulated\na guarantee for an amount of money from the agent, \"The investor is\nnot permitted to stipulate conditions about his principal other than\nthe conditions on which qirad is based or according to the precedent\nof the sunna of the Muslims. If the principal is increased by the\ncondition of guarantee, the investor has increased his share of the\nprofit because of the position of the guarantee. But the profit is\nonly to be divided according to what it would have been had the loan\nbeen given without the guarantee. If the principal is destroyed, I do\nnot think that the agent has a guarantee held against him because the\nstipulation of guarantees in qirad is null and void.\"\n\n\nMalik\nspoke about an investor who gave qirad money to a man and the man\nstipulated that he would only buy palms or animals with it because he\nsought to eat the dates or the offspring of the animals and he kept\nthem for some time to use for himself. He said, \"That is not\npermitted. It is not the sunna of the Muslims in qirad unless he buys\nit and then sells it as other goods are sold.\"\n\n\nMalik said,\n\"There is no harm in the agent stipulating on the investor a slave to\nhelp him provided that the slave stands to gain along with him out of\nthe investment, and when the slave only helps him with the investment,\nnot with anything else.\""}},{"id":7,"idInBook":7,"chapterId":32,"bookId":7,"arabic":"","english":{"narrator":"Yahya said that Malik said, \"No one should make a qirad loan\nexcept in coin, because the loan must not be in wares, since loaning\nwares can only be worked in one of two ways:","text":"Either the owner of the\nwares says to the borrower, 'Take these wares and sell them. Buy and\nsell with the capital realized according to qirad.' The investor\nstipulates increase for himself from the sale of his goods and what\nrelieves him of expenses in selling it. Or else he says, 'Barter with\nthese goods and sell. When you are through, buy for me the like of my\ngoods which I gave you. If there is increase, it is between you and\nme. 'It may happen that the investor gives the goods to the agent at a\ntime in which they are in demand and expensive, and then the agent\nreturns them while they are cheap and he might have bought them for\nonly a third of the original price or even less than that. The agent\nthen has a profit of half the amount by which the price of the wares\nhas decreased as his portion of the profit. Or he might take the wares\nat a time when their price is low, and make use of them until he has a\nlot of money. Then those wares become expensive and their price rises\nwhen he returns them, so he buys them for all that he has so that all\nhis work and concern have been in vain. This is an uncertain\ntransaction and is not good. If, however, that is not known until it\nhas happened, then the wage an agent in qirad would be paid for\nselling that, is looked at and he is given it for his concern. Then\nthe money is qirad from the day the money became cash and collected as\ncoin and it is returned as a qirad like that.\""}},{"id":8,"idInBook":8,"chapterId":32,"bookId":7,"arabic":"","english":{"narrator":"","text":"Yahya said that Malik spoke about a man who made a qirad loan to\na man and he bought wares with it and transported them to a commercial\ncentre. It was not profitable to sell them and the agent feared a loss\nif he sold them, so he hired transport to take them to another city,\nand he sold them there and made a loss, and the cost of the hire was\ngreater than the principal.\n\n\nMalik said, \"If the agent can pay\nthe cost of the hire from what the capital realized, his way is that.\nWhatever portion of the hire is not covered by the principal, the\nagent must pay it. The investor is not answerable for any of it. That\nis because the investor only ordered him to trade with the principal.\nThe investor is not answerable for other than the principal. Had the\ninvestor been liable, it would have been an additional loss to him on\ntop of the principal which he invested. The agent cannot put that on\nto the investor.\""}},{"id":9,"idInBook":9,"chapterId":32,"bookId":7,"arabic":"","english":{"narrator":"","text":"Yahya said that Malik spoke about an investor who made a qirad\nloan to a man, who used it and made a profit. Then the man bought with\nall the profit a slave-girl and he had intercourse with her and she\nbecame pregnant by him, and so the capital decreased. Malik said, \"If\nhe has money, the price of the slave-girl is taken from his property,\nand the capital is restored by it. If there is something left over\nafter the money is paid, it is divided between them according to the\nfirst qirad. If he cannot pay it, the slave-girl is sold so that the\ncapital is restored from her price.\"\n\n\nMalik spoke about an\ninvestor who made a qirad loan to a man, and the agent spent more than\nthe amount of the qirad loan when buying goods with it and paid the\nincrease from his own money. Malik said, \"The investor has a choice if\nthe goods are sold for a profit or loss or if they are not sold. If he\nwishes to take the goods, he takes them and pays the agent back what\nhe put in for them. If the agent refuses, the investor is a partner\nfor his share of the price in increase and decrease according to what\nthe agent paid extra for them from himself.\"\n\n\nMalik spoke\nabout an agent who took qirad money from a man and then gave it to\nanother man to use as a qirad without the consent of the investor. He\nsaid, \"The agent is responsible for the property. If it is decreased,\nhe is responsible for the loss. If there is profit, the investor has\nhis stipulation of the profit, and then the agent has his stipulation\nof what remains of the money.\"\n\n\nMalik spoke about an agent who\nexceeded and borrowed some of what he had of qirad in money and he\nbought goods for himself with it. Malik said, \"If he has a profit, the\nprofit is divided according to the condition between them in the\nqirad. If he has a loss, he is responsible for the loss.\"\n\n\nMalik said about an investor who paid qirad money to a man, and the\nagent borrowed some of the cash and bought goods for himself with it,\n\"The investor of the capital has a choice. If he wishes, he shares\nwith him in the goods according to the qirad, and if he wishes, he\nfrees himself of them, and takes all of the principal back from the\nagent. That is what is done with some one who oversteps.\""}},{"id":10,"idInBook":10,"chapterId":32,"bookId":7,"arabic":"","english":{"narrator":"","text":"Yahya said that Malik spoke about an investor who made a qirad\nloan to a man.\n\n\nHe said, \"When the investment is large, the\ntravelling expenses of the agent are taken from it. He can use it to\neat and clothe himself in an acceptable fashion according to the size\nof the investment. If it saves him trouble, he can take a wage from\nsome of the capital, if it is large, and he cannot support himself.\nThere are certain jobs which an agent or his like are not responsible\nfor, amongst them are collecting debts, transporting the goods,\nloading up and so forth. He can hire from the capital someone to do\nthat for him. The agent should not spend from the capital nor clothe\nhimself from it while he resides with his family. It is only permitted\nfor him to have expenses when he travels for the investment. The\nexpenses are taken from the capital. If he is only trading with the\nproperty in the city in which he resides, he has no expenses from the\ncapital and no clothing.\"\n\n\nMalik spoke about an investor who\npaid qirad money to a man, and the agent went out with it and with his\nown capital. He said, \"The expenses come from the qirad and from his\nown capital according to their proportions.\""}},{"id":11,"idInBook":11,"chapterId":32,"bookId":7,"arabic":"","english":{"narrator":"","text":"Yahya said that Malik spoke about an agent who had qirad money\nwith him and he spent from it and clothed himself. He said, \"He cannot\ngive away any of it, and neither a beggar nor anyone else is to be\ngiven any of it and he does not pay anyone compensation from it. If he\nmeets some people, and they bring out food and he brings out food, I\nhope that that will be permitted to him if he does not intend to\nbestow something on them. If he intends that or what is like  that\nwithout the permission of the investor, he must get the sanction of\nthe investor for it. If he sanctions it, there is no harm. If he\nrefuses to sanction it, he must repay it with like if he has something\nwhich is suitable as compensation.\""}},{"id":12,"idInBook":12,"chapterId":32,"bookId":7,"arabic":"","english":{"narrator":"","text":"Yahya said that Malik said, \"The generally agreed on way of doing\nthings among us about an investor who pays qirad money to an agent to\nbuy goods, and the agent then sells the goods for a price to be paid\nlater, and has a profit in the transaction, then the agent dies before\nhe has received payment, is that if his heirs want to take that money,\nthey have their father's stipulated portion from the profit. That is\ntheirs if they are trustworthy to take the payment. If they dislike to\ncollect it from the debtor and they refer him to the investor, they\nare not obliged to collect it and there is nothing against them and\nnothing for them by their surrendering it to the investor. If they do\ncollect it, they have a share of it and expenses like their father\nhad. They are in the position of their father. If they are not\ntrustworthy to do so, they can bring someone reliable and trustworthy\nto collect the money. If he collects all the capital and all the\nprofit, they are in the position of their father.\"\n\n\nMalik\nspoke about an investor who paid qirad money to a man provided that he\nused it and was responsible for any delayed payment for which he sold\nit. He said, \"This is obligatory on the agent. If he sells it for\ndelayed payment, he is responsible for it.\""}},{"id":13,"idInBook":13,"chapterId":32,"bookId":7,"arabic":"","english":{"narrator":"","text":"Yahya said that Malik spoke about an investor who gave qirad\nmoney to a man, and then the man sought a loan from the investor or\nthe investor borrowed money from the agent, or the investor left goods\nwith the agent to sell for him, or the investor gave the agent dinars\nto buy goods with. Malik said, \"There is no harm if the investor\nleaves his goods with him knowing that if the agent did not have his\nmoney and he had asked a similar thing of him, he would have still\ndone it because of the brotherhood between them or because it would\nhave been no bother to him and that had the agent refused that, he\nwould not have removed his capital from him. Or if the agent had\nborrowed from the investor or carried his goods for him and he knew\nthat if the investor had not had his capital with him, he would have\nstill done the same for him, and had he refused that to him, he would\nnot have returned his capital to him. If that is true between both of\nthem and it is in the way of a favour between them and it is not a\ncondition in the terms of the qirad, it is permitted and there is no\nharm in it. If a condition comes into it, or it is feared that the\nagent is only doing it for the investor in order to safeguard the\ncapital in his possession, or the investor is only doing it because\nthe agent has taken his capital and will not return it to him, that is\nnot permitted in qirad and it is part of what the people of knowledge\nforbid.' \""}},{"id":14,"idInBook":14,"chapterId":32,"bookId":7,"arabic":"","english":{"narrator":"","text":"Yahya said that Malik spoke about a man who loaned another man\nmoney and then the debtor asked him to leave it with him as a qirad.\nMalik said, \"I do not like that unless he takes his money back from\nhim, and then pays it to him as a qirad if he wishes or if he wishes\nkeep it.\"\n\n\nMalik spoke about an investor who paid a man qirad\nmoney and the man told him that it was collected with him and asked\nhim to write it for him as a loan. He said, \"I do not like that unless\nhe takes his money from him and then lends it to him or keeps it as he\nwishes. That is only out of fear that he has lost some of it, and\nwants to defer it so that he can make up what has been lost of it.\nThat is disapproved of and is not permitted and it is not good.\""}},{"id":15,"idInBook":15,"chapterId":32,"bookId":7,"arabic":"","english":{"narrator":"","text":"Yahya said that Malik spoke about an investor paying qirad money\nto an agent who made a profit and then wanted to take his share of the\nprofit and the investor was away. He said, \"He should not take any of\nit unless the investor is present. If he takes something from it, he\nis responsible for it until it is accounted for in the division of the\ncapital.\"\n\n\nMalik said, \"It is not permitted for the parties\ninvolved in a qirad to account and divide property which is away from\nthem until the capital is present, and the investor is given the\nprincipal in full. Then they divide the profit into their agreed\nportions.\"\n\n\nMalik spoke about a man taking qirad money, and\nbuying goods with it while he had a debt. His creditors sought and\nfound him while he was in a city away from the investor, and he had\nprofitable merchandise whose good quality was clear. They wanted him\nto sell the merchandise for them so that they could take his share of\nthe profit. Malik said, \"None of the profit of the qirad is taken\nuntil the investor is present. He takes his principal and then the\nprofit is divided mutually between them.\"\n\n\nMalik spoke about\nan investor who put qirad money with an agent and he used it and had a\nprofit. Then the principal was set aside and the profit divided. He\ntook his share and added the share of the investor to his principal in\nthe presence of witnesses he had called. Malik said, \"It is not\npermitted to divide the profit unless the investor is present. If he\nhas taken something here turns it until the investor has  received the\nprincipal in full. Then what remains is divided into their respective\nportions.\"\n\n\nMalik spoke about an investor who put qirad money\nwith an agent. The agent used it and then came to the investor and\nsaid, \"This is your portion of the profit, and I have taken the like\nof it for myself, and I have retained your principal in full.\" Malik\nsaid, \"I do not like that, unless all the capital is present, the\nprincipal is there and he knows that it is complete and he receives\nit. Then they divide the profit between them. He returns the principal\nto him if he wishes, or he keeps it. The presence of the principal is\nnecessary out of fear that the agent might have lost some of it, and\nso may want it not to be removed from him and to keep it in his hand.\""}},{"id":16,"idInBook":16,"chapterId":32,"bookId":7,"arabic":"","english":{"narrator":"","text":"Yahya said that Malik spoke about an investor who put qirad money\nwith an agent who bought goods with it, and the investor told him to\nsell them. The agent said that he did not see any way to sell at that\ntime and they quarrelled about it. He said, \"One does not look at the\nstatement of either of them. The people of experience and insight\nconcerning such goods are asked about these goods. If they can see\nanyway of selling them they are sold for them. If they think it is\ntime to wait, they should wait.\"\n\n\nMalik spoke about a man who\ntook qirad money from an investor and used it and when the investor\nasked him for his money, he said that he had it in full. When he held\nhim to his settlement he admitted that \"Such-and-such of it was lost\nwith me,\" and he named an amount of money. \"I told you that so that\nyou would leave it with me.\" Malik said, \"He does not benefit by\ndenying it after he had confirmed that he had it all . He is\nanswerable by his confession against himself unless he produces\nevidence about the loss of that property which confirms his statement.\nIf he does not produce an acceptable reason he is answerable by his\nconfession, and his denial does not avail him.\"\n\n\nMalik said,\n\"Similarly, had he said, 'I have had such-and-such a profit from the\ncapital,' and then the owner of the capital asked him to pay him the\nprincipal and his profit, and he said that he had not had any profit\nin it and had said that only so it might be left in his possession, it\ndoes not benefit him. He is taken to account for what he affirmed\nunless he brings acceptable proof of his word, so that the first\nstatement is not binding on him.\"\n\n\nMalik spoke about an\ninvestor who put qirad money with an agent who made a profit with it.\nThe agent said, \"I took the qirad from you provided that I would have\ntwo-thirds.\" The owner of the capital says, \"I gave you a qirad\nprovided that you had a third.\" Malik said, \"The word is the word of\nthe agent, and he must take an oath on that if what he says resembles\nthe known practice of qirad or is close to it. If he brings a matter\nwhich is unacceptable and people do not make qirads like that, he is\nnot believed, and it is judged to be according to how a qirad like it\nwould normally be.\"\n\n\nMalik spoke about a man who gave a man\none hundred dinars as a qirad. He bought goods with it and then went\nto pay the one hundred dinars to the owner of the goods and found that\nthey had been stolen. The investor says, \"Sell the goods. If there is\nanything over, it is mine. If there is a loss, it is against you\nbecause you lost it.\" The agent says, \"Rather you must fulfil what the\nseller is owed. I bought them with your capital which you gave me.\"\nMalik said, \"The agent is obliged to pay the price to the seller and\nthe investor is told, 'If you wish, pay the hundred dinars to the\nagent and the goods are between you. The qirad is according to what\nthe first hundred was based on. If you wish, you are free of the\ngoods.' If the hundred dinars are paid to the agent, it is a qirad\naccording to the conditions of the first qirad. If he refuses, the\ngoods belong to the agent and he must pay their price.\"\n\n\nMalik\nspoke about two people in a qirad who settled up and the agent still\nhad some of the goods which he used - threadbare cloth or a waterskin\nor the like of that. Malik said, \"Any of that which is insignificant\nis of no importance and belongs to the agent. I have not heard anyone\ngive a decision calling for the return of that. Anything which has a\nprice is returned. If it is something which has value like an animal,\ncamel, coarse cloth or the like of that which fetches a price, I think\nthat he should return what he has remaining of such things unless the\nowner overlooks it.\""}}],"chapter":{"id":32,"bookId":7,"arabic":"كتاب القراض","english":"Qirad"}}