{"metadata":{"length":3,"arabic":{"title":"موطأ مالك","author":"الإمام مالك بن أنس","introduction":"كتاب المساقاة"},"english":{"title":"Muwatta Malik","author":"Imam Malik ibn Anas","introduction":"Sharecropping"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":33,"bookId":7,"arabic":"حَدَّثَنَا يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ لِيَهُودِ خَيْبَرَ يَوْمَ افْتَتَحَ خَيْبَرَ ‏\n\"‏ أُقِرُّكُمْ فِيهَا مَا أَقَرَّكُمُ اللَّهُ عَزَّ وَجَلَّ عَلَى أَنَّ الثَّمَرَ بَيْنَنَا وَبَيْنَكُمْ ‏\"‏ ‏.‏ قَالَ فَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَبْعَثُ عَبْدَ اللَّهِ بْنَ رَوَاحَةَ فَيَخْرُصُ بَيْنَهُ وَبَيْنَهُمْ ثُمَّ يَقُولُ إِنْ شِئْتُمْ فَلَكُمْ وَإِنْ شِئْتُمْ فَلِيَ ‏.‏ فَكَانُوا يَأْخُذُونَهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Said ibn al-\nMusayyab that the Messenger of Allah, may Allah bless him and grant\nhim peace, said to the jews of Khaybar on the day of the conquest of\nKhaybar, \"I confirm you in it as long as Allah, the Mighty, the\nMajestic, establishes you in it, provided that the fruits are divided\nbetween us and you.\" Said continued, \"The Messenger of Allah, may\nAllah bless him and grant him peace, used to send Abdullah ibn Rawaha,\nto assess the division of the fruit crop between him and them, and he\nwould say, 'If you wish, you can buy it back, and if you wish, it is\nmine.' They would take it.\""}},{"id":2,"idInBook":2,"chapterId":33,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَبْعَثُ عَبْدَ اللَّهِ بْنَ رَوَاحَةَ إِلَى خَيْبَرَ فَيَخْرُصُ بَيْنَهُ وَبَيْنَ يَهُودِ خَيْبَرَ - قَالَ - فَجَمَعُوا لَهُ حَلْيًا مِنْ حَلْىِ نِسَائِهِمْ فَقَالُوا لَهُ هَذَا لَكَ وَخَفِّفْ عَنَّا وَتَجَاوَزْ فِي الْقَسْمِ ‏.‏ فَقَالَ عَبْدُ اللَّهِ بْنُ رَوَاحَةَ يَا مَعْشَرَ الْيَهُودِ وَاللَّهِ إِنَّكُمْ لَمِنْ أَبْغَضِ خَلْقِ اللَّهِ إِلَىَّ وَمَا ذَاكَ بِحَامِلِي عَلَى أَنْ أَحِيفَ عَلَيْكُمْ فَأَمَّا مَا عَرَضْتُمْ مِنَ الرُّشْوَةِ فَإِنَّهَا سُحْتٌ وَإِنَّا لاَ نَأْكُلُهَا ‏.‏ فَقَالُوا بِهَذَا قَامَتِ السَّمَوَاتُ وَالأَرْضُ ‏.‏ قَالَ مَالِكٌ إِذَا سَاقَى الرَّجُلُ النَّخْلَ وَفِيهَا الْبَيَاضُ فَمَا ازْدَرَعَ الرَّجُلُ الدَّاخِلُ فِي الْبَيَاضِ فَهُوَ لَهُ ‏.‏ قَالَ وَإِنِ اشْتَرَطَ صَاحِبُ الأَرْضِ أَنَّهُ يَزْرَعُ فِي الْبَيَاضِ لِنَفْسِهِ فَذَلِكَ لاَ يَصْلُحُ لأَنَّ الرَّجُلَ الدَّاخِلَ فِي الْمَالِ يَسْقِي لِرَبِّ الأَرْضِ فَذَلِكَ زِيَادَةٌ ازْدَادَهَا عَلَيْهِ ‏.‏ قَالَ وَإِنِ اشْتَرَطَ الزَّرْعَ بَيْنَهُمَا فَلاَ بَأْسَ بِذَلِكَ إِذَا كَانَتِ الْمَئُونَةُ كُلُّهَا عَلَى الدَّاخِلِ فِي الْمَالِ الْبَذْرُ وَالسَّقْىُ وَالْعِلاَجُ كُلُّهُ فَإِنِ اشْتَرَطَ الدَّاخِلُ فِي الْمَالِ عَلَى رَبِّ الْمَالِ أَنَّ الْبَذْرَ عَلَيْكَ كَانَ ذَلِكَ غَيْرَ جَائِزٍ لأَنَّهُ قَدِ اشْتَرَطَ عَلَى رَبِّ الْمَالِ زِيَادَةً ازْدَادَهَا عَلَيْهِ وَإِنَّمَا تَكُونُ الْمُسَاقَاةُ عَلَى أَنَّ عَلَى الدَّاخِلِ فِي الْمَالِ الْمَئُونَةَ كُلَّهَا وَالنَّفَقَةَ وَلاَ يَكُونُ عَلَى رَبِّ الْمَالِ مِنْهَا شَىْءٌ فَهَذَا وَجْهُ الْمُسَاقَاةِ الْمَعْرُوفُ ‏.‏ قَالَ مَالِكٌ فِي الْعَيْنِ تَكُونُ بَيْنَ الرَّجُلَيْنِ فَيَنْقَطِعُ مَاؤُهَا فَيُرِيدُ أَحَدُهُمَا أَنْ يَعْمَلَ فِي الْعَيْنِ وَيَقُولُ الآخَرُ لاَ أَجِدُ مَا أَعْمَلُ بِهِ إِنَّهُ يُقَالُ لِلَّذِي يُرِيدُ أَنْ يَعْمَلَ فِي الْعَيْنِ اعْمَلْ وَأَنْفِقْ وَيَكُونُ لَكَ الْمَاءُ كُلُّهُ تَسْقِي بِهِ حَتَّى يَأْتِيَ صَاحِبُكَ بِنِصْفِ مَا أَنْفَقْتَ فَإِذَا جَاءَ بِنِصْفِ مَا أَنْفَقْتَ أَخَذَ حِصَّتَهُ مِنَ الْمَاءِ ‏.‏ وَإِنَّمَا أُعْطِيَ الأَوَّلُ الْمَاءَ كُلَّهُ لأَنَّهُ أَنْفَقَ وَلَوْ لَمْ يُدْرِكْ شَيْئًا بِعَمَلِهِ لَمْ يَعْلَقِ الآخَرَ مِنَ النَّفَقَةِ شَىْءٌ ‏.‏ قَالَ مَالِكٌ وَإِذَا كَانَتِ النَّفَقَةُ كُلُّهَا وَالْمَئُونَةُ عَلَى رَبِّ الْحَائِطِ وَلَمْ يَكُنْ عَلَى الدَّاخِلِ فِي الْمَالِ شَىْءٌ إِلاَّ أَنَّهُ يَعْمَلُ بِيَدِهِ إِنَّمَا هُوَ أَجِيرٌ بِبَعْضِ الثَّمَرِ فَإِنَّ ذَلِكَ لاَ يَصْلُحُ لأَنَّهُ لاَ يَدْرِي كَمْ إِجَارَتُهُ إِذَا لَمْ يُسَمِّ لَهُ شَيْئًا يَعْرِفُهُ وَيَعْمَلُ عَلَيْهِ لاَ يَدْرِي أَيَقِلُّ ذَلِكَ أَمْ يَكْثُرُ ‏.‏ قَالَ مَالِكٌ وَكُلُّ مُقَارِضٍ أَوْ مُسَاقٍ فَلاَ يَنْبَغِي لَهُ أَنْ يَسْتَثْنِيَ مِنَ الْمَالِ وَلاَ مِنَ النَّخْلِ شَيْئًا دُونَ صَاحِبِهِ وَذَلِكَ أَنَّهُ يَصِيرُ لَهُ أَجِيرًا بِذَلِكَ يَقُولُ أُسَاقِيكَ عَلَى أَنْ تَعْمَلَ لِي فِي كَذَا وَكَذَا نَخْلَةً تَسْقِيهَا وَتَأْبُرُهَا وَأُقَارِضُكَ فِي كَذَا وَكَذَا مِنَ الْمَالِ عَلَى أَنْ تَعْمَلَ لِي بِعَشَرَةِ دَنَانِيرَ لَيْسَتْ مِمَّا أُقَارِضُكَ عَلَيْهِ فَإِنَّ ذَلِكَ لاَ يَنْبَغِي وَلاَ يَصْلُحُ وَذَلِكَ الأَمْرُ عِنْدَنَا ‏.‏ قَالَ مَالِكٌ وَالسُّنَّةُ فِي الْمُسَاقَاةِ الَّتِي يَجُوزُ لِرَبِّ الْحَائِطِ أَنْ يَشْتَرِطَهَا عَلَى الْمُسَاقَى شَدُّ الْحِظَارِ وَخَمُّ الْعَيْنِ وَسَرْوُ الشَّرَبِ وَإِبَّارُ النَّخْلِ وَقَطْعُ الْجَرِيدِ وَجَذُّ الثَّمَرِ هَذَا وَأَشْبَاهُهُ عَلَى أَنَّ لِلْمُسَاقَى شَطْرَ الثَّمَرِ أَوْ أَقَلَّ مِنْ ذَلِكَ أَوْ أَكْثَرَ إِذَا تَرَاضَيَا عَلَيْهِ غَيْرَ أَنَّ صَاحِبَ الأَصْلِ لاَ يَشْتَرِطُ ابْتِدَاءَ عَمَلٍ جَدِيدٍ يُحْدِثُهُ الْعَامِلُ فِيهَا مِنْ بِئْرٍ يَحْتَفِرُهَا أَوْ عَيْنٍ يَرْفَعُ رَأْسَهَا أَوْ غِرَاسٍ يَغْرِسُهُ فِيهَا يَأْتِي بِأَصْلِ ذَلِكَ مِنْ عِنْدِهِ أَوْ ضَفِيرَةٍ يَبْنِيهَا تَعْظُمُ فِيهَا نَفَقَتُهُ وَإِنَّمَا ذَلِكَ بِمَنْزِلَةِ أَنْ يَقُولَ رَبُّ الْحَائِطِ لِرَجُلٍ مِنَ النَّاسِ ابْنِ لِي هَا هُنَا بَيْتًا أَوِ احْفُرْ لِي بِئْرًا أَوْ أَجْرِ لِي عَيْنًا أَوِ اعْمَلْ لِي عَمَلاً بِنِصْفِ ثَمَرِ حَائِطِي هَذَا قَبْلَ أَنْ يَطِيبَ ثَمَرُ الْحَائِطِ وَيَحِلَّ بَيْعُهُ فَهَذَا بَيْعُ الثَّمَرِ قَبْلَ أَنْ يَبْدُوَ صَلاَحُهُ وَقَدْ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ بَيْعِ الثِّمَارِ حَتَّى يَبْدُوَ صَلاَحُهَا ‏.‏ قَالَ مَالِكٌ فَأَمَّا إِذَا طَابَ الثَّمَرُ وَبَدَا صَلاَحُهُ وَحَلَّ بَيْعُهُ ثُمَّ قَالَ رَجُلٌ لِرَجُلٍ اعْمَلْ لِي بَعْضَ هَذِهِ الأَعْمَالِ - لِعَمَلٍ يُسَمِّيهِ لَهُ - بِنِصْفِ ثَمَرِ حَائِطِي هَذَا فَلاَ بَأْسَ بِذَلِكَ إِنَّمَا اسْتَأْجَرَهُ بِشَىْءٍ مَعْرُوفٍ مَعْلُومٍ قَدْ رَآهُ وَرَضِيَهُ فَأَمَّا الْمُسَاقَاةُ فَإِنَّهُ إِنْ لَمْ يَكُنْ لِلْحَائِطِ ثَمَرٌ أَوْ قَلَّ ثَمَرُهُ أَوْ فَسَدَ فَلَيْسَ لَهُ إِلاَّ ذَلِكَ وَأَنَّ الأَجِيرَ لاَ يُسْتَأْجَرُ إِلاَّ بِشَىْءٍ مُسَمًّى لاَ تَجُوزُ الإِجَارَةُ إِلاَّ بِذَلِكَ وَإِنَّمَا الإِجَارَةُ بَيْعٌ مِنَ الْبُيُوعِ إِنَّمَا يَشْتَرِي مِنْهُ عَمَلَهُ وَلاَ يَصْلُحُ ذَلِكَ إِذَا دَخَلَهُ الْغَرَرُ لأَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ الْغَرَرِ ‏.‏ قَالَ مَالِكٌ السُّنَّةُ فِي الْمُسَاقَاةِ عِنْدَنَا أَنَّهَا تَكُونُ فِي أَصْلِ كُلِّ نَخْلٍ أَوْ كَرْمٍ أَوْ زَيْتُونٍ أَوْ رُمَّانٍ أَوْ فِرْسِكٍ أَوْ مَا أَشْبَهَ ذَلِكَ مِنَ الأُصُولِ جَائِزٌ لاَ بَأْسَ بِهِ عَلَى أَنَّ لِرَبِّ الْمَالِ نِصْفَ الثَّمَرِ مِنْ ذَلِكَ أَوْ ثُلُثَهُ أَوْ رُبُعَهُ أَوْ أَكْثَرَ مِنْ ذَلِكَ أَوْ أَقَلَّ ‏.‏ قَالَ مَالِكٌ وَالْمُسَاقَاةُ أَيْضًا تَجُوزُ فِي الزَّرْعِ إِذَا خَرَجَ وَاسْتَقَلَّ فَعَجَزَ صَاحِبُهُ عَنْ سَقْيِهِ وَعَمَلِهِ وَعِلاَجِهِ فَالْمُسَاقَاةُ فِي ذَلِكَ أَيْضًا جَائِزَةٌ ‏.‏ قَالَ مَالِكٌ لاَ تَصْلُحُ الْمُسَاقَاةُ فِي شَىْءٍ مِنَ الأُصُولِ مِمَّا تَحِلُّ فِيهِ الْمُسَاقَاةُ إِذَا كَانَ فِيهِ ثَمَرٌ قَدْ طَابَ وَبَدَا صَلاَحُهُ وَحَلَّ بَيْعُهُ وَإِنَّمَا يَنْبَغِي أَنْ يُسَاقَى مِنَ الْعَامِ الْمُقْبِلِ وَإِنَّمَا مُسَاقَاةُ مَا حَلَّ بَيْعُهُ مِنَ الثِّمَارِ إِجَارَةٌ لأَنَّهُ إِنَّمَا سَاقَى صَاحِبَ الأَصْلِ ثَمَرًا قَدْ بَدَا صَلاَحُهُ عَلَى أَنْ يَكْفِيَهُ إِيَّاهُ وَيَجُذَّهُ لَهُ بِمَنْزِلَةِ الدَّنَانِيرِ وَالدَّرَاهِمِ يُعْطِيهِ إِيَّاهَا وَلَيْسَ ذَلِكَ بِالْمُسَاقَاةِ إِنَّمَا الْمُسَاقَاةُ مَا بَيْنَ أَنْ يَجُذَّ النَّخْلَ إِلَى أَنْ يَطِيبَ الثَّمَرُ وَيَحِلَّ بَيْعُهُ ‏.‏ قَالَ مَالِكٌ وَمَنْ سَاقَى ثَمَرًا فِي أَصْلٍ قَبْلَ أَنْ يَبْدُوَ صَلاَحُهُ وَيَحِلَّ بَيْعُهُ فَتِلْكَ الْمُسَاقَاةُ بِعَيْنِهَا جَائِزَةٌ ‏.‏ قَالَ مَالِكٌ وَلاَ يَنْبَغِي أَنْ تُسَاقَى الأَرْضُ الْبَيْضَاءُ وَذَلِكَ أَنَّهُ يَحِلُّ لِصَاحِبِهَا كِرَاؤُهَا بِالدَّنَانِيرِ وَالدَّرَاهِمِ وَمَا أَشْبَهَ ذَلِكَ مِنَ الأَثْمَانِ الْمَعْلُومَةِ ‏.‏ قَالَ فَأَمَّا الرَّجُلُ الَّذِي يُعْطِي أَرْضَهُ الْبَيْضَاءَ بِالثُّلُثِ أَوِ الرُّبُعِ مِمَّا يَخْرُجُ مِنْهَا فَذَلِكَ مِمَّا يَدْخُلُهُ الْغَرَرُ لأَنَّ الزَّرْعَ يَقِلُّ مَرَّةً وَيَكْثُرُ مَرَّةً وَرُبَّمَا هَلَكَ رَأْسًا فَيَكُونُ صَاحِبُ الأَرْضِ قَدْ تَرَكَ كِرَاءً مَعْلُومًا يَصْلُحُ لَهُ أَنْ يُكْرِيَ أَرْضَهُ بِهِ وَأَخَذَ أَمْرًا غَرَرًا لاَ يَدْرِي أَيَتِمُّ أَمْ لاَ فَهَذَا مَكْرُوهٌ وَإِنَّمَا ذَلِكَ مَثَلُ رَجُلٍ اسْتَأْجَرَ أَجِيرًا لِسَفَرٍ بِشَىْءٍ مَعْلُومٍ ثُمَّ قَالَ الَّذِي اسْتَأْجَرَ الأَجِيرَ هَلْ لَكَ أَنْ أَعْطِيَكَ عُشْرَ مَا أَرْبَحُ فِي سَفَرِي هَذَا إِجَارَةً لَكَ فَهَذَا لاَ يَحِلُّ وَلاَ يَنْبَغِي ‏.‏ قَالَ مَالِكٌ وَلاَ يَنْبَغِي لِرَجُلٍ أَنْ يُؤَاجِرَ نَفْسَهُ وَلاَ أَرْضَهُ وَلاَ سَفِينَتَهُ إِلاَّ بِشَىْءٍ مَعْلُومٍ لاَ يَزُولُ إِلَى غَيْرِهِ ‏.‏ قَالَ مَالِكٌ وَإِنَّمَا فَرَّقَ بَيْنَ الْمُسَاقَاةِ فِي النَّخْلِ وَالأَرْضِ الْبَيْضَاءِ أَنَّ صَاحِبَ النَّخْلِ لاَ يَقْدِرُ عَلَى أَنْ يَبِيعَ ثَمَرَهَا حَتَّى يَبْدُوَ صَلاَحُهُ وَصَاحِبُ الأَرْضِ يُكْرِيهَا وَهِيَ أَرْضٌ بَيْضَاءُ لاَ شَىْءَ فِيهَا ‏.‏ قَالَ مَالِكٌ وَالأَمْرُ عِنْدَنَا فِي النَّخْلِ أَيْضًا إِنَّهَا تُسَاقِي السِّنِينَ الثَّلاَثَ وَالأَرْبَعَ وَأَقَلَّ مِنْ ذَلِكَ وَأَكْثَرَ ‏.‏ قَالَ وَذَلِكَ الَّذِي سَمِعْتُ وَكُلُّ شَىْءٍ مِثْلُ ذَلِكَ مِنَ الأُصُولِ بِمَنْزِلَةِ النَّخْلِ يَجُوزُ فِيهِ لِمَنْ سَاقَى مِنَ السِّنِينَ مِثْلُ مَا يَجُوزُ فِي النَّخْلِ ‏.‏ قَالَ مَالِكٌ فِي الْمُسَاقِي إِنَّهُ لاَ يَأْخُذُ مِنْ صَاحِبِهِ الَّذِي سَاقَاهُ شَيْئًا مِنْ ذَهَبٍ وَلاَ وَرِقٍ يَزْدَادُهُ وَلاَ طَعَامٍ وَلاَ شَيْئًا مِنَ الأَشْيَاءِ لاَ يَصْلُحُ ذَلِكَ وَلاَ يَنْبَغِي أَنْ يَأْخُذَ الْمُسَاقَى مِنْ رَبِّ الْحَائِطِ شَيْئًا يَزِيدُهُ إِيَّاهُ مِنْ ذَهَبٍ وَلاَ وَرِقٍ وَلاَ طَعَامٍ وَلاَ شَىْءٍ مِنَ الأَشْيَاءِ وَالزِّيَادَةُ فِيمَا بَيْنَهُمَا لاَ تَصْلُحُ ‏.‏ قَالَ مَالِكٌ وَالْمُقَارِضُ أَيْضًا بِهَذِهِ الْمَنْزِلَةِ لاَ يَصْلُحُ إِذَا دَخَلَتِ الزِّيَادَةُ فِي الْمُسَاقَاةِ أَوِ الْمُقَارَضَةِ صَارَتْ إِجَارَةً وَمَا دَخَلَتْهُ الإِجَارَةُ فَإِنَّهُ لاَ يَصْلُحُ وَلاَ يَنْبَغِي أَنْ تَقَعَ الإِجَارَةُ بِأَمْرٍ غَرَرٍ لاَ يَدْرِي أَيَكُونُ أَمْ لاَ يَكُونُ أَوْ يَقِلُّ أَوْ يَكْثُرُ ‏.‏ قَالَ مَالِكٌ فِي الرَّجُلِ يُسَاقِي الرَّجُلَ الأَرْضَ فِيهَا النَّخْلُ وَالْكَرْمُ أَوْ مَا أَشْبَهَ ذَلِكَ مِنَ الأُصُولِ فَيَكُونُ فِيهَا الأَرْضُ الْبَيْضَاءُ ‏.‏ قَالَ مَالِكٌ إِذَا كَانَ الْبَيَاضُ تَبَعًا لِلأَصْلِ وَكَانَ الأَصْلُ أَعْظَمَ ذَلِكَ أَوْ أَكْثَرَهُ فَلاَ بَأْسَ بِمُسَاقَاتِهِ وَذَلِكَ أَنْ يَكُونَ النَّخْلُ الثُّلُثَيْنِ أَوْ أَكْثَرَ وَيَكُونَ الْبَيَاضُ الثُّلُثَ أَوْ أَقَلَّ مِنْ ذَلِكَ وَذَلِكَ أَنَّ الْبَيَاضَ حِينَئِذٍ تَبَعٌ لِلأَصْلِ وَإِذَا كَانَتِ الأَرْضُ الْبَيْضَاءُ فِيهَا نَخْلٌ أَوْ كَرْمٌ أَوْ مَا يُشْبِهُ ذَلِكَ مِنَ الأُصُولِ فَكَانَ الأَصْلُ الثُّلُثَ أَوْ أَقَلَّ وَالْبَيَاضُ الثُّلُثَيْنِ أَوْ أَكْثَرَ جَازَ فِي ذَلِكَ الْكِرَاءُ وَحَرُمَتْ فِيهِ الْمُسَاقَاةُ وَذَلِكَ أَنَّ مِنْ أَمْرِ النَّاسِ أَنْ يُسَاقُوا الأَصْلَ وَفِيهِ الْبَيَاضُ وَتُكْرَى الأَرْضُ وَفِيهَا الشَّىْءُ الْيَسِيرُ مِنَ الأَصْلِ أَوْ يُبَاعَ الْمُصْحَفُ أَوِ السَّيْفُ وَفِيهِمَا الْحِلْيَةُ مِنَ الْوَرِقِ بِالْوَرِقِ أَوِ الْقِلاَدَةُ أَوِ الْخَاتَمُ وَفِيهِمَا الْفُصُوصُ وَالذَّهَبُ بِالدَّنَانِيرِ وَلَمْ تَزَلْ هَذِهِ الْبُيُوعُ جَائِزَةً يَتَبَايَعُهَا النَّاسُ وَيَبْتَاعُونَهَا وَلَمْ يَأْتِ فِي ذَلِكَ شَىْءٌ مَوْصُوفٌ مَوْقُوفٌ عَلَيْهِ إِذَا هُوَ بَلَغَهُ كَانَ حَرَامًا أَوْ قَصُرَ عَنْهُ كَانَ حَلاَلاً ‏.‏ وَالأَمْرُ فِي ذَلِكَ عِنْدَنَا الَّذِي عَمِلَ بِهِ النَّاسُ وَأَجَازُوهُ بَيْنَهُمْ أَنَّهُ إِذَا كَانَ الشَّىْءُ مِنْ ذَلِكَ الْوَرِقِ أَوِ الذَّهَبِ تَبَعًا لِمَا هُوَ فِيهِ جَازَ بَيْعُهُ وَذَلِكَ أَنْ يَكُونَ النَّصْلُ أَوِ الْمُصْحَفُ أَوِ الْفُصُوصُ قِيمَتُهُ الثُّلُثَانِ أَوْ أَكْثَرُ وَالْحِلْيَةُ قِيمَتُهَا الثُّلُثُ أَوْ أَقَلُّ ‏.‏","english":{"narrator":"Malik related to me from Ibn Shihab from Sulayman ibn Yasar that\nthe Messenger of Allah, may Allah bless him and grant him peace, used\nto send Abdullah ibn Rawaha to Khaybar, to assess the division of the\nfruit crop between him and the jews of Khaybar.\n\n\nThe jews\ncollected for Abdullah pieces of their women's jewellery and said to\nhim, \"This is yours. Go light on us and don't be exact in the\ndivision!\"\n\n\nAbdullah ibn Rawaha said, \"O tribe of jews! By\nAllah! You are among the most hateful to me of Allah's creation, but\nit does not prompt me to deal unjustly with you. What you have offered\nas a bribe is forbidden. We will not touch it.\" They said, \"This is\nwhat supports the heavens and the earth.\"\n\n\nMalik said, \"If a\nshare-cropper waters the palms and between them there is some\nuncultivated land, whatever he cultivates in the uncultivated land is\nhis.\"\n\n\nMalik said, \"If the owner of the land makes a condition\nthat he will cultivate the uncultivated land for himself, that is not\ngood because the sharecropper does the watering for the owner of the\nland and so he increases the owner of the land in property (without\nany return for himself).\"\n\n\nMalik said, \"If the owner\nstipulates that the fruit crop is to be shared between them, there is\nno harm in that if all the maintenance of the property - seeding,\nwatering and case, etc. - are the concern of the sharecropper.\n\n\nIf the share-cropper stipulates that the seeds are the\nresponsibility of the owner of the property - that is not permitted\nbecause he has stipulated an outlay against the owner of the property.\nShare-cropping is conducted on the basis that all the care and expense\nis outlayed by the share-cropper, and the owner of the property is not\nobliged anything. This is the accepted method of share-cropping.\"\n\n\nMalik spoke about a spring which was shared between two men, and\nthen the water dried up and one of them wanted to work on the spring\nand the other said, \"I don't have the means to work on it.\" He said,\n\"Tell the one who wants to work on the spring, 'Work and expend. All\nthe water will be yours. You will have its water until your companion\nbrings you half of what you have spent. If he brings you half of what\nyou have spent, he can take his share of the water.' The first one is\ngiven all the water, because he has spent on it, and if he does not\nreach anything by his work, the other has not incurred any expense.\"\n\n\nMalik said, \"It is not good for a share-cropper not to expend\nanything but his labour and to be hired for a share of the fruit while\nall the expense and work is incurred by the owner of the garden,\nbecause the share-cropper does not know what the exact wage is going\nto be for his labour, whether it will be little or great.\"\n\n\nMalik said, \"No-one who lends a qirad or grants a share-cropping\ncontract, should exempt some of the wealth, or some of the trees from\nhis agent, because, by that, the agent becomes his hired man. He says,\n'I will grant you a share-crop provided that you work for me on such-\nand-such a palm - water it and tend it. I will give you a qirad for\nsuch-and-such money provided that you work for me with ten dinars.\nThey are not part of the qirad I have given you.' That must not be\ndone and it is not good. This is what is done in our community.\"\n\n\nMalik said, \"The sunna about what is permitted to an owner of a\ngarden in share-cropping is that he can stipulate to the share-cropper\nthe maintenance of walls, cleaning the spring, sweeping the irrigation\ncanals, pollinating the palms, pruning branches, harvesting the fruit\nand such things, provided that the share-cropper has a share of the\nfruit fixed by mutual agreement. However, the owner cannot stipulate\nthe beginning of new work which the agent will start digging a well,\nraising the source of a well, instigating new planting, or building a\ncistern whose cost is great. That is as if the owner of the garden\nsaid to a certain man, 'Build me a house here or dig me a well or make\na spring flow for me or do some work for me for half the fruit of this\ngarden of mine,' before the fruit of the garden is sound and it is\nhalal to sell it. This is the sale of fruit before its good condition\nis clear. The Messenger of Allah, may Allah bless him and grant him\npeace, forbade fruit to be sold before its good condition became\nclear.\"\n\n\nMalik said, \"If the fruits are good and their good\ncondition is clear and selling them is halal and then the owner asks a\nman to do one of those jobs for him, specifying the job, for half the\nfruit of his garden, for example, there is no harm in that. He has\nhired the man for something recognised and known. The man has seen it\nand is satisfied with it.\n\n\n\"As for share-cropping, if the\ngarden has no fruit or little or bad fruit, he has only that. The\nlabourer is only hired for a set amount, and hire is only permitted on\nthese terms. Hire is a type of sale. One man buys another man's work\nfrom him. It is not good if uncertainty enters into it because the\nMessenger of Allah, may Allah bless him and grant him peace, forbade\nuncertain transactions.\"\n\n\nMalik said, \"The sunna in share-\ncropping with us is that it can be practised with any kind of fruit\ntree, palm, vine, olive tree, pomegranate, peach, and soon. It is\npermitted, and there is no harm in it provided that the owner of the\nproperty has a share of the fruit:","text":"a half or a third or a quarter or\nwhatever.\"\n\n\nMalik said, \"Share-cropping is also permitted in\nany crop which emerges from the earth if it is a crop which is picked,\nand its owner cannot water, work on it and tend it.\n\n\n\"Share-\ncropping becomes reprehensible in anything in which share-cropping is\nnormally permitted if the fruit is sound and the good condition is\nclear and it is halal to sell it. He must share-crop in it the next\nyear. If a man waters fruit whose good condition is clear and it is\nhalal to sell it, and he picks it for the owner, for a share of the\ncrop, it is not sharecropping. It is similar to him being paid in\ndirhams and dinars. Share-cropping is what is between pruning the\npalms and when the fruit becomes sound and its sale is halal.\"\n\n\nMalik said, \"If some one makes a share-cropping contract for fruit\ntrees before the condition becomes clear and its sale is halal, it is\nshare-cropping and is permitted . \"\n\n\nMalik said, \"Uncultivated\nland must not be involved in a share-cropping contract. That is\nbecause it is halal for the owner to rent it for dinars and dirhams or\nthe equivalent for an accepted price.\"\n\n\nMalik said, \"As for a\nman who gives his uncultivated earth for a third or a fourth of what\ncomes out of it, that is an uncertain transaction because crops may be\nscant one time and plentiful another time. It may perish completely\nand the owner of the land will have abandoned a set rent which would\nhave been good for him to rent the land for. He takes an uncertain\nsituation, and does not know whether or not it will be satisfactory.\nThis is disapproved. It is like a man having someone travel for him\nfor a set amount, and then saying, 'Shall I give you a tenth of the\nprofit of the journey as your wage?' This is not halal and must not be\ndone.\"\n\n\nMalik summed up,\"A man must not hire out himself or\nhis land or his ship unless for a set amount.\"\n\n\nMalik said, \"A\ndistinction is made between sharecropping in palms and in cultivated\nland because the owner of the palms cannot sell the fruit until its\ngood condition is clear. The owner of the land can rent it when it is\nuncultivated with nothing on it.\"\n\n\nMalik said, \"What is done\nin our community about palms is that they can also be share-cropped\nfor three and four years, and less or more than that.\"\n\n\nMalik\nsaid, \"That is what I have heard. Any fruit trees like that are in the\nposition of palms. Contracts for several years are permissible for the\nsharecropper as they are permissible in the palms.\"\n\n\nMalik\nsaid about the owner, \"He does not take anything additional from the\nshare-cropper in the way of gold or silver or crops which increases\nhim. That is not good. The share-cropper also must not take from the\nowner of the garden anything additional which will increase him of\ngold, silver, crops or anything. Increase beyond what is stipulated in\nthe contract is not good. It is also not good for the lender of a\nqirad to be in this position. If such an increase does enter share-\ncropping or quirad, it becomes by it hire. It is not good when hire\nenters it. Hire must never occur in a situation which has uncertainty\nin it.\"\n\n\nMalik spoke about a man who gave land to another man\nin a share-cropping contract in which there were palms, vines, or the\nlike of that of fruit trees and there was also uncultivated land in\nit. He said, \"If the uncultivated land is secondary to the fruit\ntrees, either in importance or in size of land, there is no harm in\nshare-cropping. That is if the palms take up two-thirds of the land or\nmore, and the uncultivated land is a third or less. This is because\nwhen the land that the fruit trees take up is secondary to the\nuncultivated land and the cultivated land in which the palms, vines or\nthe like is a third or less, and the uncultivated land is two-thirds\nor more, it is permitted to rent the land and share-cropping in it is\nharam.\"\n\n\n\"One of the practices of people is to give out\nsharecropping contracts on property with fruit trees when there is\nuncultivated land in it, and to rent land while there are fruit trees\non it, just as a Qur'an or sword which has some embellishment on it of\nsilver is sold for silver, or a necklace or ring which have stones and\ngold in them are sold for dinars. These sales continue to be\npermitted. People buy and sell by them. Nothing described or\ninstituted has come on that which if exceeded, makes it haram, and if\nfallen below makes it halal. What is done in our community about that\nis what people practise and permit among themselves. That is, if the\ngold or silver is secondary to what it is incorporated in, it is\npermitted to sell it. That is, if the value of the blade, the Qur'an,\nor the stones is two-thirds or more, and the value of the decoration\nis one-third or less.\""}},{"id":3,"idInBook":3,"chapterId":33,"bookId":7,"arabic":"قَالَ يَحْيَى قَالَ مَالِكٌ إِنَّ أَحْسَنَ مَا سُمِعَ فِي عُمَّالِ الرَّقِيقِ فِي الْمُسَاقَاةِ يَشْتَرِطُهُمُ الْمُسَاقَى عَلَى صَاحِبِ الأَصْلِ إِنَّهُ لاَ بَأْسَ بِذَلِكَ لأَنَّهُمْ عُمَّالُ الْمَالِ فَهُمْ بِمَنْزِلَةِ الْمَالِ لاَ مَنْفَعَةَ فِيهِمْ لِلدَّاخِلِ إِلاَّ أَنَّهُ تَخِفُّ عَنْهُ بِهِمُ الْمَئُونَةُ وَإِنْ لَمَ يَكُونُوا فِي الْمَالِ اشْتَدَّتْ مَئُونَتُهُ وَإِنَّمَا ذَلِكَ بِمَنْزِلَةِ الْمُسَاقَاةِ فِي الْعَيْنِ وَالنَّضْحِ وَلَنْ تَجِدَ أَحَدًا يُسَاقَى فِي أَرْضَيْنِ سَوَاءٍ فِي الأَصْلِ وَالْمَنْفَعَةِ إِحْدَاهُمَا بِعَيْنٍ وَاثِنَةٍ غَزِيرَةٍ وَالأُخْرَى بِنَضْحٍ عَلَى شَىْءٍ وَاحِدٍ لِخِفَّةِ مُؤْنَةِ الْعَيْنِ وَشِدَّةِ مُؤْنَةِ النَّضْحِ ‏.‏ قَالَ وَعَلَى ذَلِكَ الأَمْرُ عِنْدَنَا ‏.‏ قَالَ وَالْوَاثِنَةُ الثَّابِتُ مَاؤُهَا الَّتِي لاَ تَغُورُ وَلاَ تَنْقَطِعُ ‏.‏ قَالَ مَالِكٌ وَلَيْسَ لِلْمُسَاقَى أَنْ يَعْمَلَ بِعُمَّالِ الْمَالِ فِي غَيْرِهِ وَلاَ أَنْ يَشْتَرِطَ ذَلِكَ عَلَى الَّذِي سَاقَاهُ ‏.‏ قَالَ مَالِكٌ وَلاَ يَجُوزُ لِلَّذِي سَاقَى أَنْ يَشْتَرِطَ عَلَى رَبِّ الْمَالِ رَقِيقًا يَعْمَلُ بِهِمْ فِي الْحَائِطِ لَيْسُوا فِيهِ حِينَ سَاقَاهُ إِيَّاهُ ‏.‏ قَالَ مَالِكٌ وَلاَ يَنْبَغِي لِرَبِّ الْمَالِ أَنْ يَشْتَرِطَ عَلَى الَّذِي دَخَلَ فِي مَالِهِ بِمُسَاقَاةٍ أَنْ يَأْخُذَ مِنْ رَقِيقِ الْمَالِ أَحَدًا يُخْرِجُهُ مِنَ الْمَالِ وَإِنَّمَا مُسَاقَاةُ الْمَالِ عَلَى حَالِهِ الَّذِي هُوَ عَلَيْهِ ‏.‏ قَالَ فَإِنْ كَانَ صَاحِبُ الْمَالِ يُرِيدُ أَنْ يُخْرِجَ مِنْ رَقِيقِ الْمَالِ أَحَدًا فَلْيُخْرِجْهُ قَبْلَ الْمُسَاقَاةِ أَوْ يُرِيدُ أَنْ يُدْخِلَ فِيهِ أَحَدًا فَلْيَفْعَلْ ذَلِكَ قَبْلَ الْمُسَاقَاةِ ثُمَّ لْيُسَاقِ بَعْدَ ذَلِكَ إِنْ شَاءَ ‏.‏ قَالَ وَمَنْ مَاتَ مِنَ الرَّقِيقِ أَوْ غَابَ أَوْ مَرِضَ فَعَلَى رَبِّ الْمَالِ أَنْ يُخْلِفَهُ ‏.","english":{"narrator":"","text":"Yahya said that Malik said, \"The best of what has been heard\nabout a sharecropper stipulating on the owner of the property the\ninclusion of some slave workers, is that there is no harm in that if\nthey are workers that come with the property. They are like the\nproperty. There is no profit in them for the share-cropper except to\nlighten some of his burden. If they did not come with the property,\nhis toil would be harder. It is like share-cropping land with a spring\nor land with a watering trough. You will not find anyone who receives\nthe same share for share-cropping two lands which are equal in\nproperty and yield, when one property has a constant plentiful spring\nand the other has a watering trough, because of the lightness of\nworking land with a spring, and the hardship of working land with a\nwatering trough.\"\n\n\nMalik added, \"That is what is done in our\ncommunity.\"\n\n\nMalik said, \"A share-cropper cannot employ\nworkers from the property in other work, and he cannot make that a\nstipulation with the one who gives him the share-cropping contract.\nNor is it permitted to one who share-crops to stipulate on the owner\nof the property inclusion of slaves for use in the garden who are not\nin it when he makes the share-cropping contract.\"\n\n\n\"Nor must\nthe owner of the property stipulate on the one who uses his property\nfor share-cropping that he take any of the slaves of the property and\nremove him from the property. The share-cropping of property is based\non the state which it is currently in.\"\n\n\n\"If the owner of the\nproperty wants to remove one of the slaves of the property, he removes\nhim before the share-cropping, or if he wants to put someone into the\nproperty, he does it before the share-cropping. Then he grants the\nshare-cropping contract after that if he wishes. If any of the slaves\ndie or go off or become ill, the owner of the property must replace\nthem.\""}}],"chapter":{"id":33,"bookId":7,"arabic":"كتاب المساقاة","english":"Sharecropping"}}