{"metadata":{"length":5,"arabic":{"title":"موطأ مالك","author":"الإمام مالك بن أنس","introduction":"كتاب كراء الأرض"},"english":{"title":"Muwatta Malik","author":"Imam Malik ibn Anas","introduction":"Renting Land"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":34,"bookId":7,"arabic":"حَدَّثَنَا يَحْيَى، عَنْ مَالِكٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ حَنْظَلَةَ بْنِ قَيْسٍ الزُّرَقِيِّ،  عَنْ رَافِعِ بْنِ خَدِيجٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ كِرَاءِ الْمَزَارِعِ قَالَ حَنْظَلَةُ فَسَأَلْتُ رَافِعَ بْنَ خَدِيجٍ بِالذَّهَبِ وَالْوَرِقِ فَقَالَ أَمَّا بِالذَّهَبِ وَالْوَرِقِ فَلاَ بَأْسَ بِهِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Rabia ibn Abd ar-Rahman from\nHandhala ibn Qays az-Zuraqi from Rafi ibn Khadij that the Messenger of\nAllah, may Allah bless him and grant him peace, forbade renting out\nfields.\n\n\nHandhala said, \"I asked Rafi ibn Khadij, about paying\nin gold and silver, and he said, 'There is no harm in it.' \""}},{"id":2,"idInBook":2,"chapterId":34,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، أَنَّهُ قَالَ سَأَلْتُ سَعِيدَ بْنَ الْمُسَيَّبِ عَنْ كِرَاءِ الأَرْضِ، بِالذَّهَبِ وَالْوَرِقِ فَقَالَ لاَ بَأْسَ بِهِ ‏.‏","english":{"narrator":"","text":"Malik related to me that Ibn Shihab said, \"I asked Said ibn al-\nMusayyab about renting land for gold or silver, and he said, 'There is\nno harm in it.' \""}},{"id":3,"idInBook":3,"chapterId":34,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، أَنَّهُ سَأَلَ سَالِمَ بْنَ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ كِرَاءِ الْمَزَارِعِ، فَقَالَ لاَ بَأْسَ بِهَا بِالذَّهَبِ وَالْوَرِقِ ‏.‏ قَالَ ابْنُ شِهَابٍ فَقُلْتُ لَهُ أَرَأَيْتَ الْحَدِيثَ الَّذِي يُذْكَرُ عَنْ رَافِعِ بْنِ خَدِيجٍ فَقَالَ أَكْثَرَ رَافِعٌ وَلَوْ كَانَ لِي مَزْرَعَةٌ أَكْرَيْتُهَا ‏.‏","english":{"narrator":"","text":"Malik related to me from Ibn Shihab that he asked Salim ibn\n'Abdullah ibn Umar about renting out fields. He said, \"There is no\nharm in it for gold or silver.\" Ibn Shihab said, \"I said to him, 'What\ndo you think of the hadith which is mentioned from Rafi ibn Khadij?'\"\nHe said, ''Rafi has exaggerated. If I had a field, I would rent it\nout.\""}},{"id":4,"idInBook":4,"chapterId":34,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ عَوْفٍ، تَكَارَى أَرْضًا فَلَمْ تَزَلْ فِي يَدَيْهِ بِكِرَاءٍ حَتَّى مَاتَ قَالَ ابْنُهُ فَمَا كُنْتُ أُرَاهَا إِلاَّ لَنَا مِنْ طُولِ مَا مَكَثَتْ فِي يَدَيْهِ حَتَّى ذَكَرَهَا لَنَا عِنْدَ مَوْتِهِ فَأَمَرَنَا بِقَضَاءِ شَىْءٍ كَانَ عَلَيْهِ مِنْ كِرَائِهَا ذَهَبٍ أَوْ وَرِقٍ ‏.‏","english":{"narrator":"","text":"Malik related to me that he had heard that Abd ar-Rahman ibn Awf\nrented land, and he continued to have it in his possession until he\ndied. His son said, \"I thought that it was ours because of the length\nof time which it had remained in his hands, until he mentioned it to\nus at his death. He ordered us to pay some rent which he owed in gold\nor silver.\""}},{"id":5,"idInBook":5,"chapterId":34,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّهُ كَانَ يُكْرِي أَرْضَهُ بِالذَّهَبِ وَالْوَرِقِ ‏.‏ وَسُئِلَ مَالِكٌ عَنْ رَجُلٍ أَكْرَى مَزْرَعَتَهُ بِمِائَةِ صَاعٍ مِنْ تَمْرٍ أَوْ مِمَّا يَخْرُجُ مِنْهَا مِنَ الْحِنْطَةِ أَوْ مِنْ غَيْرِ مَا يَخْرُجُ مِنْهَا فَكَرِهَ ذَلِكَ ‏.‏","english":{"narrator":"","text":"Malik related to me from Hisham ibn Urwa that his father used to\nrent out his land for gold and silver.\n\n\nMalik was asked about\na man who rented his field for 100 sa of dates or part of its produce\nof wheat or from other than its produce. He disapproved of that."}}],"chapter":{"id":34,"bookId":7,"arabic":"كتاب كراء الأرض","english":"Renting Land"}}