{"metadata":{"length":5,"arabic":{"title":"موطأ مالك","author":"الإمام مالك بن أنس","introduction":"كتاب الشفعة"},"english":{"title":"Muwatta Malik","author":"Imam Malik ibn Anas","introduction":"Pre-emption in Property"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":35,"bookId":7,"arabic":"حَدَّثَنَا يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، وَعَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَضَى بِالشُّفْعَةِ فِيمَا لَمْ يُقْسَمْ بَيْنَ الشُّرَكَاءِ فَإِذَا وَقَعَتِ الْحُدُودُ بَيْنَهُمْ فَلاَ شُفْعَةَ فِيهِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Said ibn al- Musayyab and from Abu Salama ibn Abd ar-Rahman ibn Awf that the Messenger of Allah, may Allah bless him and grant him peace, decreed for partners the right of preemption in property which had not been divided up. When boundaries had been fixed between them, then there was no right of pre-emption."}},{"id":2,"idInBook":2,"chapterId":35,"bookId":7,"arabic":"","english":{"narrator":"","text":"Malik said, \"That is the sunna about which there is no dispute among us.\""}},{"id":3,"idInBook":3,"chapterId":35,"bookId":7,"arabic":"قَالَ مَالِكٌ إِنَّهُ بَلَغَهُ أَنَّ سَعِيدَ بْنَ الْمُسَيَّبِ سُئِلَ عَنِ الشُّفْعَةِ هَلْ فِيهَا مِنْ سُنَّةٍ فَقَالَ نَعَمْ الشُّفْعَةُ فِي الدُّورِ وَالأَرَضِينَ وَلاَ تَكُونُ إِلاَّ بَيْنَ الشُّرَكَاءِ ‏.‏","english":{"narrator":"","text":"Malik said that he heard that Said ibn al-Musayyab, when asked\nabout pre-emption and whether there was a sunna in it, said, \"Yes.\nPre-emption is in houses and land, and it is only between partners.\""}},{"id":4,"idInBook":4,"chapterId":35,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، مِثْلُ ذَلِكَ ‏.‏ قَالَ مَالِكٌ فِي رَجُلٍ اشْتَرَى شِقْصًا مَعَ قَوْمٍ فِي أَرْضٍ بِحَيَوَانٍ عَبْدٍ أَوْ وَلِيدَةٍ أَوْ مَا أَشْبَهَ ذَلِكَ مِنَ الْعُرُوضِ فَجَاءَ الشَّرِيكُ يَأْخُذُ بِشُفْعَتِهِ بَعْدَ ذَلِكَ فَوَجَدَ الْعَبْدَ أَوِ الْوَلِيدَةَ قَدْ هَلَكَا وَلَمْ يَعْلَمْ أَحَدٌ قَدْرَ قِيمَتِهِمَا فَيَقُولُ الْمُشْتَرِي قِيمَةُ الْعَبْدِ أَوِ الْوَلِيدَةِ مِائَةُ دِينَارٍ وَيَقُولُ صَاحِبُ الشُّفْعَةِ الشَّرِيكُ بَلْ قِيمَتُهُمَا خَمْسُونَ دِينَارًا ‏.‏ قَالَ مَالِكٌ يَحْلِفُ الْمُشْتَرِي أَنَّ قِيمَةَ مَا اشْتَرَى بِهِ مِائَةُ دِينَارٍ ثُمَّ إِنْ شَاءَ أَنْ يَأْخُذَ صَاحِبُ الشُّفْعَةِ أَخَذَ أَوْ يَتْرُكَ إِلاَّ أَنْ يَأْتِيَ الشَّفِيعُ بِبَيِّنَةٍ أَنَّ قِيمَةَ الْعَبْدِ أَوِ الْوَلِيدَةِ دُونَ مَا قَالَ الْمُشْتَرِي ‏.‏ قَالَ مَالِكٌ مَنْ وَهَبَ شِقْصًا فِي دَارٍ أَوْ أَرْضٍ مُشْتَرَكَةٍ فَأَثَابَهُ الْمَوْهُوبُ لَهُ بِهَا نَقْدًا أَوْ عَرْضًا فَإِنَّ الشُّرَكَاءَ يَأْخُذُونَهَا بِالشُّفْعَةِ إِنْ شَاءُوا وَيَدْفَعُونَ إِلَى الْمَوْهُوبِ لَهُ قِيمَةَ مَثُوبَتِهِ دَنَانِيرَ أَوْ دَرَاهِمَ ‏.‏ قَالَ مَالِكٌ مَنْ وَهَبَ هِبَةً فِي دَارٍ أَوْ أَرْضٍ مُشْتَرَكَةٍ فَلَمْ يُثَبْ مِنْهَا وَلَمْ يَطْلُبْهَا فَأَرَادَ شَرِيكُهُ أَنْ يَأْخُذَهَا بِقِيمَتِهَا فَلَيْسَ ذَلِكَ لَهُ مَا لَمْ يُثَبْ عَلَيْهَا فَإِنْ أُثِيبَ فَهُوَ لِلشَّفِيعِ بِقِيمَةِ الثَّوَابِ ‏.‏ قَالَ مَالِكٌ فِي رَجُلٍ اشْتَرَى شِقْصًا فِي أَرْضٍ مُشْتَرَكَةٍ بِثَمَنٍ إِلَى أَجَلٍ فَأَرَادَ الشَّرِيكُ أَنْ يَأْخُذَهَا بِالشُّفْعَةِ ‏.‏ قَالَ مَالِكٌ إِنْ كَانَ مَلِيًّا فَلَهُ الشُّفْعَةُ بِذَلِكَ الثَّمَنِ إِلَى ذَلِكَ الأَجَلِ وَإِنْ كَانَ مَخُوفًا أَنْ لاَ يُؤَدِّيَ الثَّمَنَ إِلَى ذَلِكَ الأَجَلِ فَإِذَا جَاءَهُمْ بِحَمِيلٍ مَلِيٍّ ثِقَةٍ مِثْلِ الَّذِي اشْتَرَى مِنْهُ الشِّقْصَ فِي الأَرْضِ الْمُشْتَرَكَةِ فَذَلِكَ لَهُ ‏.‏ قَالَ مَالِكٌ لاَ تَقْطَعُ شُفْعَةَ الْغَائِبِ غَيْبَتُهُ وَإِنْ طَالَتْ غَيْبَتُهُ وَلَيْسَ لِذَلِكَ عِنْدَنَا حَدٌّ تُقْطَعُ إِلَيْهِ الشُّفْعَةُ ‏.‏ قَالَ مَالِكٌ فِي الرَّجُلِ يُوَرِّثُ الأَرْضَ نَفَرًا مِنْ وَلَدِهِ ثُمَّ يُولَدُ لأَحَدِ النَّفَرِ ثُمَّ يَهْلِكُ الأَبُ فَيَبِيعُ أَحَدُ وَلَدِ الْمَيِّتِ حَقَّهُ فِي تِلْكَ الأَرْضِ فَإِنَّ أَخَا الْبَائِعِ أَحَقُّ بِشُفْعَتِهِ مِنْ عُمُومَتِهِ شُرَكَاءِ أَبِيهِ ‏.‏ قَالَ مَالِكٌ وَهَذَا الأَمْرُ عِنْدَنَا ‏.‏ قَالَ مَالِكٌ الشُّفْعَةُ بَيْنَ الشُّرَكَاءِ عَلَى قَدْرِ حِصَصِهِمْ يَأْخُذُ كُلُّ إِنْسَانٍ مِنْهُمْ بِقَدْرِ نَصِيبِهِ إِنْ كَانَ قَلِيلاً فَقَلِيلاً وَإِنْ كَانَ كَثِيرًا فَبِقَدْرِهِ وَذَلِكَ إِنْ تَشَاحُّوا فِيهَا ‏.‏ قَالَ مَالِكٌ فَأَمَّا أَنْ يَشْتَرِيَ رَجُلٌ مِنْ رَجُلٍ مِنْ شُرَكَائِهِ حَقَّهُ فَيَقُولُ أَحَدُ الشُّرَكَاءِ أَنَا آخُذُ مِنَ الشُّفْعَةِ بِقَدْرِ حِصَّتِي ‏.‏ وَيَقُولُ الْمُشْتَرِي إِنْ شِئْتَ أَنْ تَأْخُذَ الشُّفْعَةَ كُلَّهَا أَسْلَمْتُهَا إِلَيْكَ وَإِنْ شِئْتَ أَنْ تَدَعَ فَدَعْ فَإِنَّ الْمُشْتَرِيَ إِذَا خَيَّرَهُ فِي هَذَا وَأَسْلَمَهُ إِلَيْهِ فَلَيْسَ لِلشَّفِيعِ إِلاَّ أَنْ يَأْخُذَ الشُّفْعَةَ كُلَّهَا أَوْ يُسْلِمَهَا إِلَيْهِ فَإِنْ أَخَذَهَا فَهُوَ أَحَقُّ بِهَا وَإِلاَّ فَلاَ شَىْءَ لَهُ ‏.‏ قَالَ مَالِكٌ فِي الرَّجُلِ يَشْتَرِي الأَرْضَ فَيَعْمُرُهَا بِالأَصْلِ يَضَعُهُ فِيهَا أَوِ الْبِئْرِ يَحْفِرُهَا ثُمَّ يَأْتِي رَجُلٌ فَيُدْرِكُ فِيهَا حَقًّا فَيُرِيدُ أَنْ يَأْخُذَهَا بِالشُّفْعَةِ إِنَّهُ لاَ شُفْعَةَ لَهُ فِيهَا إِلاَّ أَنْ يُعْطِيَهُ قِيمَةَ مَا عَمَرَ فَإِنْ أَعْطَاهُ قِيمَةَ مَا عَمَرَ كَانَ أَحَقَّ بِالشُّفْعَةِ وَإِلاَّ فَلاَ حَقَّ لَهُ فِيهَا ‏.‏ قَالَ مَالِكٌ مَنْ بَاعَ حِصَّتَهُ مِنْ أَرْضٍ أَوْ دَارٍ مُشْتَرَكَةٍ فَلَمَّا عَلِمَ أَنَّ صَاحِبَ الشُّفْعَةِ يَأْخُذُ بِالشُّفْعَةِ اسْتَقَالَ الْمُشْتَرِي فَأَقَالَهُ ‏.‏ قَالَ لَيْسَ ذَلِكَ لَهُ وَالشَّفِيعُ أَحَقُّ بِهَا بِالثَّمَنِ الَّذِي كَانَ بَاعَهَا بِهِ ‏.‏ قَالَ مَالِكٌ مَنِ اشْتَرَى شِقْصًا فِي دَارٍ أَوْ أَرْضٍ وَحَيَوَانًا وَعُرُوضًا فِي صَفْقَةٍ وَاحِدَةٍ فَطَلَبَ الشَّفِيعُ شُفْعَتَهُ فِي الدَّارِ أَوِ الأَرْضِ فَقَالَ الْمُشْتَرِي خُذْ مَا اشْتَرَيْتُ جَمِيعًا فَإِنِّي إِنَّمَا اشْتَرَيْتُهُ جَمِيعًا ‏.‏ قَالَ مَالِكٌ بَلْ يَأْخُذُ الشَّفِيعُ شُفْعَتَهُ فِي الدَّارِ أَوِ الأَرْضِ بِحِصَّتِهَا مِنْ ذَلِكَ الثَّمَنِ يُقَامُ كُلُّ شَىْءٍ اشْتَرَاهُ مِنْ ذَلِكَ عَلَى حِدَتِهِ عَلَى الثَّمَنِ الَّذِي اشْتَرَاهُ بِهِ ثُمَّ يَأْخُذُ الشَّفِيعُ شُفْعَتَهُ بِالَّذِي يُصِيبُهَا مِنَ الْقِيمَةِ مِنْ رَأْسِ الثَّمَنِ وَلاَ يَأْخُذُ مِنَ الْحَيَوَانِ وَالْعُرُوضِ شَيْئًا إِلاَّ أَنْ يَشَاءَ ذَلِكَ ‏.‏ قَالَ مَالِكٌ وَمَنْ بَاعَ شِقْصًا مِنْ أَرْضٍ مُشْتَرَكَةٍ فَسَلَّمَ بَعْضُ مَنْ لَهُ فِيهَا الشُّفْعَةُ لِلْبَائِعِ وَأَبَى بَعْضُهُمْ إِلاَّ أَنْ يَأْخُذَ بِشُفْعَتِهِ إِنَّ مَنْ أَبَى أَنْ يُسَلِّمَ يَأْخُذُ بِالشُّفْعَةِ كُلِّهَا وَلَيْسَ لَهُ أَنْ يَأْخُذَ بِقَدْرِ حَقِّهِ وَيَتْرُكَ مَا بَقِيَ ‏.‏ قَالَ مَالِكٌ فِي نَفَرٍ شُرَكَاءَ فِي دَارٍ وَاحِدَةٍ فَبَاعَ أَحَدُهُمْ حِصَّتَهُ وَشُرَكَاؤُهُ غُيَّبٌ كُلُّهُمْ إِلاَّ رَجُلاً فَعُرِضَ عَلَى الْحَاضِرِ أَنْ يَأْخُذَ بِالشُّفْعَةِ أَوْ يَتْرُكَ ‏.‏ فَقَالَ أَنَا آخُذُ بِحِصَّتِي وَأَتْرُكُ حِصَصَ شُرَكَائِي حَتَّى يَقْدَمُوا فَإِنْ أَخَذُوا فَذَلِكَ وَإِنْ تَرَكُوا أَخَذْتُ جَمِيعَ الشُّفْعَةِ ‏.‏ قَالَ مَالِكٌ لَيْسَ لَهُ إِلاَّ أَنْ يَأْخُذَ ذَلِكَ كُلَّهُ أَوْ يَتْرُكَ فَإِنْ جَاءَ شُرَكَاؤُهُ أَخَذُوا مِنْهُ أَوْ تَرَكُوا إِنْ شَاءُوا فَإِذَا عُرِضَ هَذَا عَلَيْهِ فَلَمْ يَقْبَلْهُ فَلاَ أَرَى لَهُ شُفْعَةً ‏.‏","english":{"narrator":"","text":"Malik related to me that he heard the like of that from Sulayman\nibn Yasar.\n\n\nMalik spoke about a man who bought out one of the\npartners in a shared property, by paying the man with an animal, a\nslave, a slave-girl, or the equivalent of that in goods. Then another\npartner decided to exercise his right of pre-emption after that, and\nhe found that the slave or slave-girl had died, and no one knew what\nher value had been. The buyer claimed, \"The value of the slave or\nslave-girl was 100 dinars.\" The partner with the right of pre-emption\nclaimed, \"The value was 50 dinars.\"\n\n\nMalik said, \"The buyer\ntakes an oath that the value of what he payed was 100 dinars. Then if\nthe one with the right of pre-emption wishes, he can compensate him,\nor else he can leave it, unless he can bring a clear proof that the\nslave or slave-girl's value is less than what the buyer said. If\nsomeone gives away his portion of a shared house or land and the\nrecipient repays him for it by cash or goods, the partners can take it\nby pre-emption if they wish and pay off the recipient the value of\nwhat he gave in dinars or dirhams. If someone makes a gift of his\nportion of a shared house or land, and does not take any remuneration\nand does not seek to, and a partner wants to take it for its value, he\ncannot do so as long as the original partner has not been given\nrecompense for it. If there is any recompense, the one with the right\nof pre-emption can have it for the price of the recompense.\"\n\n\nMalik spoke about a man who bought into a piece of shared land for a\nprice on credit, and one of the partners wanted to possess it by right\nof pre-emption . Malik said, \"If it seems likely that the partner can\nmeet the terms, he has right of pre-emption for the same credit terms.\nIf it is feared that he will not be able to meet the terms, but he can\nbring a wealthy and reliable guarantor of equal standing to the one\nwho bought into the land, he can also take possession.\"\n\n\nMalik\nsaid, \"A person's absence does not sever his right of pre-emption.\nEven if he is a way for a long time, there is no time limit after\nwhich the right of preemption is cut off.\"\n\n\nMalik said that if\na man left land to a number of his children, then one of them who had\na child died and the child of the deceased sold his right in that\nland, the brother of the seller was more entitled to pre-empt him than\nhis paternal uncles, the partners of his father.\n\n\nMalik said,\n\"This is what is done in our community.\"\n\n\nMalik said, \"Pre-\nemption is shared between partners according to their existing shares.\nEach of them takes according to his portion. If it is small, he has\nlittle. If it is great, it is according to that. That is if they are\ntenacious and contend with each other about it.\"\n\n\nMalik said,\n\"As for a man who buys out the share of one of his partners, and one\nof the other partners says, 'I will take a portion according to my\nshare,' and the first partner says, 'If you wish to take all the\npreemption, I will give it up to you. If you wish to leave it, then\nleave it.' If the first partner gives him the choice and hands it over\nto him, the second partner can only take all the pre-emption or give\nit back. If he takes it, he is entitled to it. If not, he has\nnothing.\"\n\n\nMalik spoke about a man who bought land, and\ndeveloped it by planting trees or digging a well etc., and then\nsomeone came, and seeing that he had a right in the land, wanted to\ntake possession of it by pre-emption. Malik said \"He has no right of\npreemption unless he compensates the other for his expenditure. If he\ngives him the price of what he has developed, he is entitled to pre-\nemption . If not, he has no right in it.\"\n\n\nMalik said that\nsomeone who sold off his portion of a shared house or land and then,\non learning that some one with a right of pre-emption was to take\npossession by that right, asked the buyer to revoke the sale, and he\ndid so, did not have the right to do that. The pre-emptor has more\nright to the property for the price for which he sold it.\n\n\nIn\nthe case of some one who bought along with a section of a shared house\nor land, an animal and goods (that were not shared), so that when any\none demanded his right of pre-emption in the house or land he said,\n\"Take what I have bought altogether, for I bought it altogether,\"\nMalik said, \"The pre-emptor need only take possession of the house or\nland. Each thing the man bought is assessed according to its share of\nthe lump sum the man paid. Then the pre-emptor takes possession of his\nright for a price which is appropriate on that basis. He does not take\nany animals or goods unless he wants to do that.\"\n\n\nMalik said,\n\"If someone sells a section of shared land, and one of those who have\nthe right of preemption surrenders it to the buyer and another refuses\nto do other than take his pre-emption, the one who refuses to\nsurrender has to take all the preemption, and he cannot take according\nto his right and leave what remains.\n\n\nIn the case where one of\na number of partners in one house sold his share when all his partners\nwere away except for one man, the one present was given the choice of\neither taking the pre-emption or leaving it, and he said, 'I will take\nmy portion and leave the portions of my partners until they are\npresent. If they take it, that is that. If they leave it, I will take\nall the pre-emption,' Malik said, 'He can only take it all or leave\nit. If his partners come, they can take from him or leave it as they\nwish. If this is offered to him and he does not accept, I think that\nhe has no pre-emption.' \""}},{"id":5,"idInBook":5,"chapterId":35,"bookId":7,"arabic":"قَالَ يَحْيَى قَالَ مَالِكٌ عَنْ مُحَمَّدِ بْنِ عُمَارَةَ، عَنْ أَبِي بَكْرِ بْنِ حَزْمٍ، أَنَّ عُثْمَانَ بْنَ عَفَّانَ، قَالَ إِذَا وَقَعَتِ الْحُدُودُ فِي الأَرْضِ فَلاَ شُفْعَةَ فِيهَا وَلاَ شُفْعَةَ فِي بِئْرٍ وَلاَ فِي فَحْلِ النَّخْلِ ‏.‏ قَالَ مَالِكٌ وَعَلَى هَذَا الأَمْرُ عِنْدَنَا ‏.‏ قَالَ مَالِكٌ وَلاَ شُفْعَةَ فِي طَرِيقٍ صَلُحَ الْقَسْمُ فِيهَا أَوْ لَمْ يَصْلُحْ ‏.‏ قَالَ مَالِكٌ وَالأَمْرُ عِنْدَنَا أَنَّهُ لاَ شُفْعَةَ فِي عَرْصَةِ دَارٍ صَلُحَ الْقَسْمُ فِيهَا أَوْ لَمْ يَصْلُحْ ‏.‏ قَالَ مَالِكٌ فِي رَجُلٍ اشْتَرَى شِقْصًا مِنْ أَرْضٍ مُشْتَرَكَةٍ عَلَى أَنَّهُ فِيهَا بِالْخِيَارِ فَأَرَادَ شُرَكَاءُ الْبَائِعِ أَنْ يَأْخُذُوا مَا بَاعَ شَرِيكُهُمْ بِالشُّفْعَةِ قَبْلَ أَنْ يَخْتَارَ الْمُشْتَرِي إِنَّ ذَلِكَ لاَ يَكُونُ لَهُمْ حَتَّى يَأْخُذَ الْمُشْتَرِي وَيَثْبُتَ لَهُ الْبَيْعُ فَإِذَا وَجَبَ لَهُ الْبَيْعُ فَلَهُمُ الشُّفْعَةُ ‏.‏ وَقَالَ مَالِكٌ فِي الرَّجُلِ يَشْتَرِي أَرْضًا فَتَمْكُثُ فِي يَدَيْهِ حِينًا ثُمَّ يَأْتِي رَجُلٌ فَيُدْرِكُ فِيهَا حَقًّا بِمِيرَاثٍ إِنَّ لَهُ الشُّفْعَةَ إِنْ ثَبَتَ حَقُّهُ وَإِنَّ مَا أَغَلَّتِ الأَرْضُ مِنْ غَلَّةٍ فَهِيَ لِلْمُشْتَرِي الأَوَّلِ إِلَى يَوْمِ يَثْبُتُ حَقُّ الآخَرِ لأَنَّهُ قَدْ كَانَ ضَمِنَهَا لَوْ هَلَكَ مَا كَانَ فِيهَا مِنْ غِرَاسٍ أَوْ ذَهَبَ بِهِ سَيْلٌ ‏.‏ قَالَ فَإِنْ طَالَ الزَّمَانُ أَوْ هَلَكَ الشُّهُودُ أَوْ مَاتَ الْبَائِعُ أَوِ الْمُشْتَرِي أَوْ هُمَا حَيَّانِ فَنُسِيَ أَصْلُ الْبَيْعِ وَالاِشْتِرَاءِ لِطُولِ الزَّمَانِ فَإِنَّ الشُّفْعَةَ تَنْقَطِعُ وَيَأْخُذُ حَقَّهُ الَّذِي ثَبَتَ لَهُ وَإِنْ كَانَ أَمْرُهُ عَلَى غَيْرِ هَذَا الْوَجْهِ فِي حَدَاثَةِ الْعَهْدِ وَقُرْبِهِ وَأَنَّهُ يَرَى أَنَّ الْبَائِعَ غَيَّبَ الثَّمَنَ وَأَخْفَاهُ لِيَقْطَعَ بِذَلِكَ حَقَّ صَاحِبِ الشُّفْعَةِ قُوِّمَتِ الأَرْضُ عَلَى قَدْرِ مَا يُرَى أَنَّهُ ثَمَنُهَا فَيَصِيرُ ثَمَنُهَا إِلَى ذَلِكَ ثُمَّ يُنْظَرُ إِلَى مَا زَادَ فِي الأَرْضِ مِنْ بِنَاءٍ أَوْ غِرَاسٍ أَوْ عِمَارَةٍ فَيَكُونُ عَلَى مَا يَكُونُ عَلَيْهِ مَنِ ابْتَاعَ الأَرْضَ بِثَمَنٍ مَعْلُومٍ ثُمَّ بَنَى فِيهَا وَغَرَسَ ثُمَّ أَخَذَهَا صَاحِبُ الشُّفْعَةِ بَعْدَ ذَلِكَ ‏.‏ قَالَ مَالِكٌ وَالشُّفْعَةُ ثَابِتَةٌ فِي مَالِ الْمَيِّتِ كَمَا هِيَ فِي مَالِ الْحَىِّ فَإِنْ خَشِيَ أَهْلُ الْمَيِّتِ أَنْ يَنْكَسِرَ مَالُ الْمَيِّتِ قَسَمُوهُ ثُمَّ بَاعُوهُ فَلَيْسَ عَلَيْهِمْ فِيهِ شُفْعَةٌ ‏.‏ قَالَ مَالِكٌ وَلاَ شُفْعَةَ عِنْدَنَا فِي عَبْدٍ وَلاَ وَلِيدَةٍ وَلاَ بَعِيرٍ وَلاَ بَقَرَةٍ وَلاَ شَاةٍ وَلاَ فِي شَىْءٍ مِنَ الْحَيَوَانِ وَلاَ فِي ثَوْبٍ وَلاَ فِي بِئْرٍ لَيْسَ لَهَا بَيَاضٌ إِنَّمَا الشُّفْعَةُ فِيمَا يَصْلُحُ أَنَّهُ يَنْقَسِمُ وَتَقَعُ فِيهِ الْحُدُودُ مِنَ الأَرْضِ فَأَمَّا مَا لاَ يَصْلُحُ فِيهِ الْقَسْمُ فَلاَ شُفْعَةَ فِيهِ ‏.‏ قَالَ مَالِكٌ وَمَنِ اشْتَرَى أَرْضًا فِيهَا شُفْعَةٌ لِنَاسٍ حُضُورٍ فَلْيَرْفَعْهُمْ إِلَى السُّلْطَانِ فَإِمَّا أَنْ يَسْتَحِقُّوا وَإِمَّا أَنْ يُسَلِّمَ لَهُ السُّلْطَانُ فَإِنْ تَرَكَهُمْ فَلَمْ يَرْفَعْ أَمْرَهُمْ إِلَى السُّلْطَانِ وَقَدْ عَلِمُوا بِاشْتِرَائِهِ فَتَرَكُوا ذَلِكَ حَتَّى طَالَ زَمَانُهُ ثُمَّ جَاءُوا يَطْلُبُونَ شُفْعَتَهُمْ فَلاَ أَرَى ذَلِكَ لَهُمْ ‏.‏","english":{"narrator":"","text":"Yahya said that Malik related from Muhammad ibn Umara from Abu\nBakr ibn Hazm that Uthman ibn Affan said, \"When boundaries are fixed\nin land, there is no pre-emption in it. There is no pre-emption in a\nwell or in male palm trees. \"\n\n\nMalik said, \"This is what is\ndone in our community.\"\n\n\nMalik said, \"There is no pre-emption\nin a road, whether or not it is practical to divide it.\"\n\n\nMalik said, \"What is done in our community is that there is no pre-\nemption in the courtyard of a house, whether or not it is practical to\ndivide it.\"\n\n\nMalik spoke about a man who bought into a shared\nproperty provided that he had the option of withdrawal and the\npartners of the seller wanted to take what their partner was selling\nby pre-emption before the buyer had exercised his option. Malik said,\n\"They cannot do that until the buyer has taken possession and the sale\nis confirmed for him. When the sale is confirmed, they have the right\nof pre-emption.\"\n\n\nMalik spoke about a man who bought land and\nit remained in his hands for some time. Then a man came and saw that\nhe had a share of the land by inheritance. Malik said, \"If the man's\nright of inheritance is established, he also has a right of\npreemption. If the land has produced a crop, the crop belongs to the\nbuyer until the day when the right of the other is established,\nbecause he has tended what was planted against being destroyed or\nbeing carried away by a flood.\"\n\n\nMalik continued, \"If the time\nhas been long, or the witnesses are dead or the seller has died, or\nthe buyer has died, or they are both alive and the basis of the sale\nand purchase has been forgotten because of the length of time, pre-\nemption is discontinued. A man only takes his right by inheritance\nwhich has been established for him. If his situation differs from\nthis, because the sale transaction is recent and he sees that the\nseller has concealed the price in order to sever his right of pre-\nemption, the value of the land is estimated, and he buys the land for\nthat price by his right of pre-emption. Then the buildings, plants, or\nstructures which are extra to the land are looked at, so he is in the\nposition of some one who bought the land for a known price, and then\nafter that built on it and planted. The owner of pre-emption takes\npossession after that is included.\"\n\n\nMalik said, \"Pre-emption\nis applied to the property of the deceased as it is applied to the\nproperty of the living. If the family of the deceased fear to break up\nthe property of the deceased, then they share it and sell it, and they\nhave no pre-emption in it.\"\n\n\nMalik said, \"There is no pre-\nemption among us in a slave or a slave-girl or a camel, a cow, sheep,\nor any animal, nor in clothes or a well which does not have any\nuncultivated land around it. Pre-emption is in what can be usefully\ndivided, and in land in which boundaries occur. As for what cannot be\nusefully divided, there is no pre-emption in it.\"\n\n\nMalik said,\n\"Some one who buys land in which people who are present have a right\nof pre-emption, refers them to the Sultan and either they claim their\nright or the Sultan surrenders it to him. If he were to leave them,\nand not refer their situation to the Sultan and they knew about his\npurchase, and then they left it until a long time had passed and then\ncame demanding their pre-emption, I do not think that they would have\nit.\""}}],"chapter":{"id":35,"bookId":7,"arabic":"كتاب الشفعة","english":"Pre-emption in Property"}}