{"metadata":{"length":13,"arabic":{"title":"موطأ مالك","author":"الإمام مالك بن أنس","introduction":"كتاب الوصية"},"english":{"title":"Muwatta Malik","author":"Imam Malik ibn Anas","introduction":"Wills and Testaments"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":37,"bookId":7,"arabic":"حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَا حَقُّ امْرِئٍ مُسْلِمٍ لَهُ شَىْءٌ يُوصَى فِيهِ يَبِيتُ لَيْلَتَيْنِ إِلاَّ وَوَصِيَّتُهُ عِنْدَهُ مَكْتُوبَةٌ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me from Nafi from Abdullah ibn Umar that the\nMessenger of Allah, may Allah bless him and grant him peace, said, \"It\nis the duty of a muslim man who has something to be given as a bequest\nnot to spend two nights without writing a will about it.\"\n\n\nMalik said, \"The generally agreed-on way of doing things in our\ncommunity is that when the testator writes something in health or\nillness as a bequest, and it has freeing slaves or things other than\nthat in it, he can alter it in any way he chooses, until he is on his\ndeathbed. If he prefers to abandon a bequest or change it, he can do\nso unless he has made a slave mudabbar (to be freed after his death).\nIf he has made him mudabbar, there is no way to change what he has\nmade mudabbar. He is allowed to change his testament because the\nMessenger of Allah, may Allah bless him and grant him peace, said, \"It\nis the duty of a muslim man who has something to be given as a bequest\nnot to spend two nights without writing a will about it.\"\n\n\nMalik explained, \"Had the testator not been able to change his will\nnor what was mentioned in it about freeing slaves, each testator might\nwithhold making bequests from his property, whether in freeing slaves\nor other than it. A man gives a bequest in his health and in his\ntravelling.\" (i.e. he does not wait till his death bed ) .\n\n\nMalik summed up, \"The way of doing things in our community about which\nthere is no dispute is that he can change whatever he likes of that\nexcept for the mudabbar.\""}},{"id":2,"idInBook":2,"chapterId":37,"bookId":7,"arabic":"حَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ حَزْمٍ، عَنْ أَبِيهِ، أَنَّ عَمْرَو بْنَ سُلَيْمٍ الزُّرَقِيَّ، أَخْبَرَهُ أَنَّهُ، قِيلَ لِعُمَرَ بْنِ الْخَطَّابِ إِنَّ هَا هُنَا غُلاَمًا يَفَاعًا لَمْ يَحْتَلِمْ مِنْ غَسَّانَ وَوَارِثُهُ بِالشَّامِ وَهُوَ ذُو مَالٍ وَلَيْسَ لَهُ هَا هُنَا إِلاَّ ابْنَةُ عَمٍّ لَهُ ‏.‏ قَالَ عُمَرُ بْنُ الْخَطَّابِ فَلْيُوصِ لَهَا ‏.‏ قَالَ فَأَوْصَى لَهَا بِمَالٍ يُقَالُ لَهُ بِئْرُ جُشَمٍ قَالَ عَمْرُو بْنُ سُلَيْمٍ فَبِيعَ ذَلِكَ الْمَالُ بِثَلاَثِينَ أَلْفَ دِرْهَمٍ وَابْنَةُ عَمِّهِ الَّتِي أَوْصَى لَهَا هِيَ أُمُّ عَمْرِو بْنِ سُلَيْمٍ الزُّرَقِيِّ ‏.‏","english":{"narrator":"","text":"Malik related to me from Abdullah ibn Abi Bakr ibn Hazm that Amr\nibn Sulaym az-Zuraqi informed his father that it had been said to Umar\nibn al-Khattab, \"There is here an adolescent boy who has not yet\nreached puberty. He is from the Ghassan tribe and his heir is in ash-\nSham. He has property. Here he only has the daughter of one of his\npaternal uncles.\" Umar ibn al-Khattab instructed, \"Let him leave her a\nbequest.\" He willed her a property called the well of Jusham.\n\n\nMalik added, \"That property was sold for 30,000 dirhams, and the\ndaughter of the paternal uncle to whom he willed it was the mother of\nAmr ibn Sulaym az-Zuraqi.\""}},{"id":3,"idInBook":3,"chapterId":37,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ أَبِي بَكْرِ بْنِ حَزْمٍ، أَنَّ غُلاَمًا، مِنْ غَسَّانَ حَضَرَتْهُ الْوَفَاةُ بِالْمَدِينَةِ وَوَارِثُهُ بِالشَّامِ فَذُكِرَ ذَلِكَ لِعُمَرَ بْنِ الْخَطَّابِ فَقِيلَ لَهُ إِنَّ فُلاَنًا يَمُوتُ أَفَيُوصِي قَالَ فَلْيُوصِ ‏.‏ قَالَ يَحْيَى بْنُ سَعِيدٍ قَالَ أَبُو بَكْرٍ وَكَانَ الْغُلاَمُ ابْنَ عَشْرِ سِنِينَ أَوِ اثْنَتَىْ عَشْرَةَ سَنَةً ‏.‏ قَالَ فَأَوْصَى بِبِئْرِ جُشَمٍ فَبَاعَهَا أَهْلُهَا بِثَلاَثِينَ أَلْفَ دِرْهَمٍ ‏.‏ قَالَ يَحْيَى سَمِعْتُ مَالِكًا يَقُولُ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا أَنَّ الضَّعِيفَ فِي عَقْلِهِ وَالسَّفِيهَ وَالْمُصَابَ الَّذِي يُفِيقُ أَحْيَانًا تَجُوزُ وَصَايَاهُمْ إِذَا كَانَ مَعَهُمْ مِنْ عُقُولِهِمْ مَا يَعْرِفُونَ مَا يُوصُونَ بِهِ فَأَمَّا مَنْ لَيْسَ مَعَهُ مِنْ عَقْلِهِ مَا يَعْرِفُ بِذَلِكَ مَا يُوصِي بِهِ وَكَانَ مَغْلُوبًا عَلَى عَقْلِهِ فَلاَ وَصِيَّةَ لَهُ ‏.‏","english":{"narrator":"","text":"Malik related to me from Yahya ibn Said from Abu Bakr ibn Hazm\nthat a boy from Ghassan was dying in Madina while his heir was in\nSyria. That was mentioned to Umar ibn al-Khattab. It was said to him,\n\"So-and-so is dying. Shall he make a bequest?\" He said, \"Let him make\na bequest.\"\n\n\nYahya ibn Said said that Abu Bakr had said, \"He\nwas a boy of ten or twelve years.\" Yahya said, \"He willed the well of\nJusham, and his people sold it for 30,000 dirhams.\"\n\n\nYahya\nsaid that he heard Malik say, \"The generally agreed-on way of doing\nthings in our community is that a simpleton, an idiot, or a lunatic\nwho recovers at times, can make wills if they have enough of their\nwits about them to recognise what they will. Someone who has not\nenough wits to recognise what he wills, and is overcome in his\nintellect, cannot make a bequest.\""}},{"id":4,"idInBook":4,"chapterId":37,"bookId":7,"arabic":"حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عَامِرِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ، عَنْ أَبِيهِ، أَنَّهُ قَالَ جَاءَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم يَعُودُنِي عَامَ حَجَّةِ الْوَدَاعِ مِنْ وَجَعٍ اشْتَدَّ بِي فَقُلْتُ يَا رَسُولَ اللَّهِ قَدْ بَلَغَ بِي مِنَ الْوَجَعِ مَا تَرَى وَأَنَا ذُو مَالٍ وَلاَ يَرِثُنِي إِلاَّ ابْنَةٌ لِي أَفَأَتَصَدَّقُ بِثُلُثَىْ مَالِي قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ ‏\"‏ ‏.‏ فَقُلْتُ فَالشَّطْرُ قَالَ ‏\"‏ لاَ ‏\"‏ ‏.‏ ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الثُّلُثُ وَالثُّلُثُ كَثِيرٌ إِنَّكَ أَنْ تَذَرَ وَرَثَتَكَ أَغْنِيَاءَ خَيْرٌ مِنْ أَنْ تَذَرَهُمْ عَالَةً يَتَكَفَّفُونَ النَّاسَ وَإِنَّكَ لَنْ تُنْفِقَ نَفَقَةً تَبْتَغِي بِهَا وَجْهَ اللَّهِ إِلاَّ أُجِرْتَ حَتَّى مَا تَجْعَلُ فِي فِي امْرَأَتِكَ ‏\"‏ ‏.‏ قَالَ فَقُلْتُ يَا رَسُولَ اللَّهِ أَأُخَلَّفُ بَعْدَ أَصْحَابِي فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّكَ لَنْ تُخَلَّفَ فَتَعْمَلَ عَمَلاً صَالِحًا إِلاَّ ازْدَدْتَ بِهِ دَرَجَةً وَرِفْعَةً وَلَعَلَّكَ أَنْ تُخَلَّفَ حَتَّى يَنْتَفِعَ بِكَ أَقْوَامٌ وَيُضَرَّ بِكَ آخَرُونَ اللَّهُمَّ أَمْضِ لأَصْحَابِي هِجْرَتَهُمْ وَلاَ تَرُدَّهُمْ عَلَى أَعْقَابِهِمْ لَكِنِ الْبَائِسُ سَعْدُ ابْنُ خَوْلَةَ يَرْثِي لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ مَاتَ بِمَكَّةَ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me from Ibn Shihab from Amir ibn Sad ibn Abi\nWaqqas that his father said, \"The Messenger of Allah, may Allah bless\nhim and grant him peace, came to me to treat me for a pain which\nbecame hard to bear in the year of the farewell hajj. I said,\n'Messenger of Allah, you can see how far the pain has reached me. I\nhave property and only my daughter inherits from me. Shall I give two\nthirds of my property as sadaqa?' The Messenger of Allah, may Allah\nbless him and grant him peace, said, 'No.' I said, 'Half?' He said,\n'No.' Then the Messenger of Allah, may Allah bless him and grant him\npeace, said, 'A third, and a third is a lot. Leaving your heirs rich\nis better than leaving them poor to beg from people. You never spend\nanything on maintenance desiring the Face of Allah by it, but that you\nare rewarded for it, even what you appoint for your wife.' Sad said,\n'Messenger of Allah, will I be left here in Makka after my companions\nhave departed for Madina?' The Messenger of Allah, may Allah bless him\nand grant him peace, said, 'If you are left behind, and do sound deeds\nyou will increase your degree and elevation by them. Perhaps you will\nbe left behind so that some people may benefit by you and others may\nbe harmed by you. O Allah! complete their hijra for my companions, and\ndo not turn them back on their heels. The unfortunate one is Said ibn\nKhawla.' The Messenger of Allah, may Allah bless him and grant him\npeace, was distressed on his account for he had died at Makka.\"\n\n\nYahya said that he heard Malik speak about a man who willed a\nthird of his property to a man and said as well, \"My slave will serve\nso-and-so (another man) for as long as he lives, then he is free,\"\nthen that was looked into, and the slave was found to be a third of\nthe property of the deceased. Malik said, \"The service of the slave is\nevaluated. Then the two of them divide it between them. The one who\nwas willed a third takes his third, as a share, and the one who was\nwilled the service of the slave takes what was evaluated for him of\nthe slave's service. Each of them takes, from the service of the slave\nor from his wage if he has a wage, according to his share. If the one\nwho was given the service of the slave for as long as he lived dies,\nthen the slave is freed.\"\n\n\nYahya said that he heard Malik\nspeak about someone who willed his third and said \"So-and-so has such-\nand-such, and so-and-so has such-and-such,\" naming some of his\nproperty, and his heirs protested that it was more than a third.\"\nMalik said, \"The heirs then have an option between giving the\nbeneficiaries their full bequests and taking the rest of the property\nof the deceased, or between dividing among the beneficiaries the third\nof the property of the deceased and surrendering to them their third.\nIf they wish, their rights in it reach as far as they reach.\""}},{"id":5,"idInBook":5,"chapterId":37,"bookId":7,"arabic":"","english":{"narrator":"","text":"Yahya said that he heard Malik say, \"The best of what I have\nheard about the testament of a pregnant woman and about what\nsettlements she is permitted in her property is that the pregnant\nwoman is like the sick person. When the illness is light, and one does\nnot fear for the sick person, he does with his property what he likes.\nIf the illness is such that his life is feared for, he can only\ndispose of a third of his estate.\"\n\n\nHe said, \"It is the same\nwith a woman who is pregnant. The beginning of pregnancy is good news\nand joy. It is not illness and no fear because Allah the Blessed, the\nExalted, said in His Book, 'We gave her good news of Ishaq and after\nIshaq, Yaqub.' (Sura ll ayat 71). And He said, 'She bore a light\nburden and passed by with it, but when she became heavy, they called\nupon Allah, their Lord, \"If you give us a good-doing son, we will be\namong the thankful.\" '(Sura 7 ayat 189).\n\n\n\"When a pregnant\nwoman becomes heavy, she is only permitted to dispose of a third of\nher estate. The beginning of this restriction is after six months.\nAllah, the Blessed, the Exalted, said in His Book, 'Mothers suckle\ntheir children for two complete years.' And He said, 'his bearing and\nweaning are thirty months.' (Sura 2 ayat 233).\n\n\n\"When six\nmonths have passed for the pregnant woman from the day she conceived,\nshe is only permitted to dispose of a third of her property.\"\n\n\nYahya said that he heard Malik say, \"A man who is advancing in the row\nfor battle, can only dispose of a third of his property. He is in the\nsame position as a pregnant woman or an ill person who is feared for,\nas long as he is in that situation.\""}},{"id":6,"idInBook":6,"chapterId":37,"bookId":7,"arabic":"","english":{"narrator":"","text":"Yahya said that he heard Malik say, \"This ayat is abrogated. It\nis the word of Allah, the Blessed, the Exalted, 'If he leaves goods,\nthe testament is for parents and kinsmen.' What came down about the\ndivision of the fixed shares of inheritance in the Book of Allah, the\nMighty, the Exalted, abrogated it.\"\n\n\nYahya said that he heard\nMalik say, \"The established sunna with us, in which there is no\ndispute, is that it is not permitted for a testator to make a bequest\n(in addition to the fixed share) in favour of an heir, unless the\nother heirs permit him. If some of them permit him and others refuse,\nhe is allowed to diminish the share of those who have given their\npermission. Those who refuse take their full share from the\ninheritance.\n\n\nYahya said that he heard Malik speak about an\ninvalid who made a bequest and asked his heirs to give him permission\nto make a bequest when he was so ill that he only had command of a\nthird of his property, and they gave him permission to leave some of\nhis heirs more than his third. Malik said, \"They cannot revoke that.\nHad they been permitted to do so, every heir would have done that, and\nthen, when the testator died, they would take that for themselves and\nprevent him from bequeathing his third and what was permitted to him\nwith respect to his property.\"\n\n\nMalik said, \"If he asks\npermission of his heirs to grant a bequest to an heir while he is well\nand they give him permission, that is not binding on them. The heirs\ncan rescind that if they wish. That is because when a man is well, he\nis entitled to all his property and can do what he wishes with it. If\nhe wishes, he can spend all of it. He can spend it and give sadaqa\nwith it or give it to whomever he likes. His asking permission of his\nheirs is permitted for the heirs, when they give him permission when\nauthority over all his property is closed off from him and nothing\noutside of the third is permitted to him, and when they are more\nentitled to the two-thirds of his property than he is himself. That is\nwhen their permission becomes relevant. If he asks one of the heirs to\ngive his inheritance to him when he is dying, and the heir agrees and\nthen the dying man does not dispose of it at all, it is returned to\nthe one who gave it unless the deceased said to him, 'So-and-so - (one\nof his heirs) - is weak, and I would like you to give him your\ninheritance.' So he gives it to him. That is permitted when the\ndeceased specified it for him.\"\n\n\nMalik said, \"When a man gives\nthe dying man free use of his share of the inheritance, and the dying\nman distributes some of it and some remains, it is returned to the\ngiver, after the man has died.\"\n\n\nYahya said that he heard\nMalik speak about someone who made a bequest and mentioned that he had\ngiven one of his heirs something which he had not taken possession of,\nso the heirs refused to permit that. Malik said, \"That gift returns to\nthe heirs as inheritance according to the Book of Allah because the\ndeceased did not mean that to be taken out of the third and the heirs\ndo not have a portion in the third (which the dying man is allowed to\nbequeath).\""}},{"id":7,"idInBook":7,"chapterId":37,"bookId":7,"arabic":"حَدَّثَنِي مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّ مُخَنَّثًا، كَانَ عِنْدَ أُمِّ سَلَمَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ فَقَالَ لِعَبْدِ اللَّهِ بْنِ أَبِي أُمَيَّةَ وَرَسُولُ اللَّهِ صلى الله عليه وسلم يَسْمَعُ يَا عَبْدَ اللَّهِ إِنْ فَتَحَ اللَّهُ عَلَيْكُمُ الطَّائِفَ غَدًا فَأَنَا أَدُلُّكَ عَلَى ابْنَةِ غَيْلاَنَ فَإِنَّهَا تُقْبِلُ بِأَرْبَعٍ وَتُدْبِرُ بِثَمَانٍ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ يَدْخُلَنَّ هَؤُلاَءِ عَلَيْكُمْ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik said from Hisham ibn Urwa from his father that an\neffeminate man was with Umm Salama, the wife of the Prophet, may Allah\nbless him and grant him peace. He said to Abdullah ibn Abi Umayya\nwhile the Messenger of Allah, may Allah bless him and grant him peace,\nwas listening. \"Abdullah! If Allah grants you victory over Ta'if\ntomorrow, I will lead you to the daughter of Ghailan. She has four\nfolds on her front and eight folds on her back.\" The Messenger of\nAllah, may Allah bless him and grant him peace, said, \"This sort of\nman should not enter freely with you.\" (It was customary to allow men\nwith no sexual inclination to enter freely where there were women)."}},{"id":8,"idInBook":8,"chapterId":37,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ قَالَ سَمِعْتُ الْقَاسِمَ بْنَ مُحَمَّدٍ، يَقُولُ كَانَتْ عِنْدَ عُمَرَ بْنِ الْخَطَّابِ امْرَأَةٌ مِنَ الأَنْصَارِ فَوَلَدَتْ لَهُ عَاصِمَ بْنَ عُمَرَ ثُمَّ إِنَّهُ فَارَقَهَا فَجَاءَ عُمَرُ قُبَاءً فَوَجَدَ ابْنَهُ عَاصِمًا يَلْعَبُ بِفِنَاءِ الْمَسْجِدِ فَأَخَذَ بِعَضُدِهِ فَوَضَعَهُ بَيْنَ يَدَيْهِ عَلَى الدَّابَّةِ فَأَدْرَكَتْهُ جَدَّةُ الْغُلاَمِ فَنَازَعَتْهُ إِيَّاهُ حَتَّى أَتَيَا أَبَا بَكْرٍ الصِّدِّيقَ فَقَالَ عُمَرُ ابْنِي ‏.‏ وَقَالَتِ الْمَرْأَةُ ابْنِي ‏.‏ فَقَالَ أَبُو بَكْرٍ خَلِّ بَيْنَهَا وَبَيْنَهُ ‏.‏ قَالَ فَمَا رَاجَعَهُ عُمَرُ الْكَلاَمَ ‏.‏ قَالَ وَسَمِعْتُ مَالِكًا يَقُولُ وَهَذَا الأَمْرُ الَّذِي آخُذُ بِهِ فِي ذَلِكَ ‏.‏","english":{"narrator":"","text":"Malik related to me that Yahya ibn Said said that he heard al-\nQasim ibn Muhammad say, \"A woman of the Ansar was married to Umar ibn\nal-Khattab. She bore Asim ibn Umar to him, and then he separated from\nher. Umar came to Quba and found his son Asim playing in the courtyard\nof the mosque. He took him by the arm and placed him before him on his\nmount. The grandmother of the child saw him and argued with Umar about\nthe child so they went to Abu Bakr as-Siddiq. Umar said, 'My son.' The\nwoman said, 'My son.' Abu Bakr said, 'Do not interfere between a child\nand its mother.' Umar did not repeat his words.\"\n\n\nYahya said\nthat he heard Malik say, \"This is what I would have done in that\nsituation.\""}},{"id":9,"idInBook":9,"chapterId":37,"bookId":7,"arabic":"","english":{"narrator":"","text":"Yahya said that he heard Malik speak about a man who bought goods\n- animals or clothes or wares, and the sale was found not to be\npermitted so it was revoked and the one who had taken the goods was\nordered to return the owner his goods. Malik said, \"The owner of the\ngoods only has their value on the day they were taken from him, and\nnot on the day they are returned to him. That is because the man is\nliable for them from the day he took them and whatever loss is in them\nafter that is against him. For that reason, their increase and growth\nare also his. A man may take the goods at a time when they are selling\nwell and are in demand, and then have to return them at a time when\nthey have fallen in price and no one wants them. For instance, the man\nmay take the goods from the other man, and sell them for ten dinars or\nkeep them while their price is that. Then he may have to return them\nwhile their price is only a dinar. He should not go off with nine\ndinars from the man's property. Or perhaps they are taken by the man,\nand he sells them for a dinar or keeps them, while their price is only\na dinar, then he has to return them, and their value on the day he\nreturns them is ten dinars. The one who took them does not have to pay\nnine dinars from his property to the owner. He is only obliged to pay\nthe value of what he took possession of on the day it was taken .\"\n\n\nHe said, \"Part of what clarifies this is that when a thief\nsteals goods, only their price on the day he stole them is looked at.\nIf cutting off the hand is necessary because of it, that is done. If\nthe cutting off is delayed, either because the thief is imprisoned\nuntil his situation is examined or he flees and then is caught, the\ndelay of the cutting off of the hand does not make the hadd, which was\nobliged for him on the day he stole, fall from him even if those goods\nbecome cheap after that. Nor does delay oblige cutting off the hand if\nit was not obliged on the day he took those goods, even if they become\nexpensive after that.\""}},{"id":10,"idInBook":10,"chapterId":37,"bookId":7,"arabic":"حَدَّثَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ أَبَا الدَّرْدَاءِ، كَتَبَ إِلَى سَلْمَانَ الْفَارِسِيِّ أَنْ هَلُمَّ إِلَى الأَرْضِ الْمُقَدَّسَةِ فَكَتَبَ إِلَيْهِ سَلْمَانُ إِنَّ الأَرْضَ لاَ تُقَدِّسُ أَحَدًا وَإِنَّمَا يُقَدِّسُ الإِنْسَانَ عَمَلُهُ وَقَدْ بَلَغَنِي أَنَّكَ جُعِلْتَ طَبِيبًا تُدَاوِي فَإِنْ كُنْتَ تُبْرِئُ فَنِعِمَّا لَكَ وَإِنْ كُنْتَ مُتَطَبِّبًا فَاحْذَرْ أَنْ تَقْتُلَ إِنْسَانًا فَتَدْخُلَ النَّارَ ‏.‏ فَكَانَ أَبُو الدَّرْدَاءِ إِذَا قَضَى بَيْنَ اثْنَيْنِ ثُمَّ أَدْبَرَا عَنْهُ نَظَرَ إِلَيْهِمَا وَقَالَ ارْجِعَا إِلَىَّ أَعِيدَا عَلَىَّ قِصَّتَكُمَا مُتَطَبِّبٌ وَاللَّهِ ‏.‏ قَالَ وَسَمِعْتُ مَالِكًا يَقُولُ مَنِ اسْتَعَانَ عَبْدًا بِغَيْرِ إِذْنِ سَيِّدِهِ فِي شَىْءٍ لَهُ بَالٌ وَلِمِثْلِهِ إِجَارَةٌ فَهُوَ ضَامِنٌ لِمَا أَصَابَ الْعَبْدَ إِنْ أُصِيبَ الْعَبْدُ بِشَىْءٍ وَإِنْ سَلِمَ الْعَبْدُ فَطَلَبَ سَيِّدُهُ إِجَارَتَهُ لِمَا عَمِلَ فَذَلِكَ لِسَيِّدِهِ وَهُوَ الأَمْرُ عِنْدَنَا ‏.‏ قَالَ وَسَمِعْتُ مَالِكًا يَقُولُ فِي الْعَبْدِ يَكُونُ بَعْضُهُ حُرًّا وَبَعْضُهُ مُسْتَرَقًّا إِنَّهُ يُوقَفُ مَالُهُ بِيَدِهِ وَلَيْسَ لَهُ أَنْ يُحْدِثَ فِيهِ شَيْئًا وَلَكِنَّهُ يَأْكُلُ فِيهِ وَيَكْتَسِي بِالْمَعْرُوفِ فَإِذَا هَلَكَ فَمَالُهُ لِلَّذِي بَقِيَ لَهُ فِيهِ الرِّقُّ ‏.‏ قَالَ وَسَمِعْتُ مَالِكًا يَقُولُ الأَمْرُ عِنْدَنَا أَنَّ الْوَالِدَ يُحَاسِبُ وَلَدَهُ بِمَا أَنْفَقَ عَلَيْهِ مِنْ يَوْمِ يَكُونُ لِلْوَلَدِ مَالٌ - نَاضًّا كَانَ أَوْ عَرْضًا - إِنْ أَرَادَ الْوَالِدُ ذَلِكَ ‏.‏","english":{"narrator":"","text":"Malik related to me from Yahya ibn Said that Abu'd-Darda wrote to\nSalman al-Farsi, \"Come immediately to the holy land.\" Salman wrote\nback to him, \"Land does not make anyone holy. Man's deeds make him\nholy. I have heard that you were put up as a doctor to treat and cure\npeople. If you are innocent, then may you have delight! If you are a\nquack, then beware lest you kill a man and enter the Fire!\" When\nAbu'd-Darda judged between two men, and they turned from him to go, he\nwould look at them and say, \"Come back to me, and tell me your story\nagain. A quack! By Allah!\"\n\n\nYahya said that he heard Malik\nsay, \"If someone makes use of a slave, without permission of its\nmaster, in anything important to him, whose like has a fee, he is\nliable for what befalls the slave if anything befalls him. If the\nslave is safe and his master asks for his wage for what he has done,\nthat is the master's right. This is what is done in our community.\"\n\n\nYahya said that he heard Malik say about a slave who is part\nfree and part enslaved, \"His property is suspended in his hand and he\ncannot begin anything with it. He eats from it and clothes himself in\nan approved fashion. If he dies, his property belongs to the one to\nwhom he is in slavery.\"\n\n\nYahya said that he heard Malik say,\n\"The way of doing things in our community is that a parent can take\nhis child to account for what he spends on him from the day the child\nhas property, cash or goods, if the parent wants that.\""}},{"id":11,"idInBook":11,"chapterId":37,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ عُمَرَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ دَلاَفٍ الْمُزَنِيِّ، عَنْ أَبِيهِ، أَنَّ رَجُلاً، مِنْ جُهَيْنَةَ كَانَ يَسْبِقُ الْحَاجَّ فَيَشْتَرِي الرَّوَاحِلَ فَيُغْلِي بِهَا ثُمَّ يُسْرِعُ السَّيْرَ فَيَسْبِقُ الْحَاجَّ فَأَفْلَسَ فَرُفِعَ أَمْرُهُ إِلَى عُمَرَ بْنِ الْخَطَّابِ فَقَالَ أَمَّا بَعْدُ أَيُّهَا النَّاسُ فَإِنَّ الأُسَيْفِعَ أُسَيْفِعَ جُهَيْنَةَ رَضِيَ مِنْ دِينِهِ وَأَمَانَتِهِ بِأَنْ يُقَالَ سَبَقَ الْحَاجَّ أَلاَ وَإِنَّهُ قَدْ دَانَ مُعْرِضًا فَأَصْبَحَ قَدْ رِينَ بِهِ فَمَنْ كَانَ لَهُ عَلَيْهِ دَيْنٌ فَلْيَأْتِنَا بِالْغَدَاةِ نَقْسِمُ مَالَهُ بَيْنَهُمْ وَإِيَّاكُمْ وَالدَّيْنَ فَإِنَّ أَوَّلَهُ هَمٌّ وَآخِرَهُ حَرْبٌ ‏.‏","english":{"narrator":"","text":"Malik related to me from Umar ibn Abd ar-Rahman ibn Dalaf al-\nMuzani from his father that a man from the Juhayna tribe used to buy\ncamels before people set out for hajj and sell them at a higher price.\nThen he travelled quickly and used to arrive in Makka before the\nothers who set out for hajj. He went bankrupt and his situation was\nput before Umar ibn al-Khattab, who said, \"O People! al-Usayfi, al-\nUsayfi of the Juhayna, was satisfied with his deen and his trust\nbecause it was said of him that he arrived before the others on hajj.\nHe used to incur debts which he was not careful to repay, so all of\nhis property has been eaten up by it. Whoever has a debt against him,\nlet him come to us tomorrow and we will divide his property between\nhis creditors. Beware of debts! Their beginning is a worry and their\nend is destitution. \""}},{"id":12,"idInBook":12,"chapterId":37,"bookId":7,"arabic":"","english":{"narrator":"","text":"Yahya said that he heard Malik say, \"The sunna with us about the\ncrime of slaves is that the hand is not cut off for any harm that a\nslave causes a man, or something he pilfers, or something guarded\nwhich he steals, or hanging dates he cuts down or ruins, or steals.\nThat is against the slave's person and does not exceed the price of\nthe slave whether it is little or much. If his master wishes to give\nthe value of what the slave took or ruined, or pay the blood-price for\nthe injury, he pays it and keeps his slave. If he wishes to surrender\nhim, he surrenders him, and none of that is against him. The master\nhas the option in that.\""}},{"id":13,"idInBook":13,"chapterId":37,"bookId":7,"arabic":"حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ عُثْمَانَ بْنَ عَفَّانَ، قَالَ مَنْ نَحَلَ وَلَدًا لَهُ صَغِيرًا لَمْ يَبْلُغْ أَنْ يَحُوزَ نُحْلَهُ فَأَعْلَنَ ذَلِكَ لَهُ وَأَشْهَدَ عَلَيْهَا فَهِيَ جَائِزَةٌ وَإِنْ وَلِيَهَا أَبُوهُ ‏.‏ قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا أَنَّ مَنْ نَحَلَ ابْنًا لَهُ صَغِيرًا ذَهَبًا أَوْ وَرِقًا ثُمَّ هَلَكَ وَهُوَ يَلِيهِ إِنَّهُ لاَ شَىْءَ لِلاِبْنِ مِنْ ذَلِكَ إِلاَّ أَنْ يَكُونَ الأَبُ عَزَلَهَا بِعَيْنِهَا أَوْ دَفَعَهَا إِلَى رَجُلٍ وَضَعَهَا لاِبْنِهِ عِنْدَ ذَلِكَ الرَّجُلِ فَإِنْ فَعَلَ ذَلِكَ فَهُوَ جَائِزٌ لِلاِبْنِ ‏.‏","english":{"narrator":"","text":"Malik related to me from Ibn Shihab from Said ibn al-Musayyab\nthat Uthman ibn Affan said, \"If someone gives something to his small\nchild who is not old enough to look after it himself, and in order\nthat his gift might be permitted he makes the gift public and has it\nwitnessed, the gift is permitted, even if the father keeps charge of\nit.\"\n\n\nMalik said, \"What is done in our community is that if a\nman gives his small child some gold or silver and then dies and he has\nit in his own keeping, the child has none of it unless the father set\nit aside in coin or placed it with a man to keep for the son. If he\ndoes that, it is permitted for the son.\""}}],"chapter":{"id":37,"bookId":7,"arabic":"كتاب الوصية","english":"Wills and Testaments"}}