{"metadata":{"length":15,"arabic":{"title":"موطأ مالك","author":"الإمام مالك بن أنس","introduction":"كتاب المكاتب"},"english":{"title":"Muwatta Malik","author":"Imam Malik ibn Anas","introduction":"The Mukatab"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":39,"bookId":7,"arabic":"حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقُولُ الْمُكَاتَبُ عَبْدٌ مَا بَقِيَ عَلَيْهِ مِنْ كِتَابَتِهِ شَىْءٌ ‏.‏","english":{"narrator":"","text":"Malik related to me from Nafi that Abdullah ibn Umar said, \"A\nmukatab is a slave as long as any of his kitaba remains to be paid.\""}},{"id":2,"idInBook":2,"chapterId":39,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ عُرْوَةَ بْنَ الزُّبَيْرِ، وَسُلَيْمَانَ بْنَ يَسَارٍ، كَانَا يَقُولاَنِ الْمُكَاتَبُ عَبْدٌ مَا بَقِيَ عَلَيْهِ مِنْ كِتَابَتِهِ شَىْءٌ ‏.‏ قَالَ مَالِكٌ وَهُو رَأْيِي ‏.‏ قَالَ مَالِكٌ فَإِنْ هَلَكَ الْمُكَاتَبُ وَتَرَكَ مَالاً أَكْثَرَ مِمَّا بَقِيَ عَلَيْهِ مِنْ كِتَابَتِهِ وَلَهُ وَلَدٌ وُلِدُوا فِي كِتَابَتِهِ أَوْ كَاتَبَ عَلَيْهِمْ وَرِثُوا مَا بَقِيَ مِنَ الْمَالِ بَعْدَ قَضَاءِ كِتَابَتِهِ ‏.‏","english":{"narrator":"","text":"Malik related to me that he had heard that Urwa ibn az-Zubayr and\nSulayman ibn Yasar said, \"The mukatab is a slave as long as any of his\nkitaba remains to be paid.\"\n\n\nMalik said, \"This is my opinion\nas well.\"\n\n\nMalik said, \"If a mukatab dies and leaves more\nproperty than what remains to be paid of his kitaba and he has\nchildren who were born during the time of his kitaba or whose kitaba\nhas been written as well, they inherit any property that remains after\nthe kitaba has been paid.\""}},{"id":3,"idInBook":3,"chapterId":39,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ حُمَيْدِ بْنِ قَيْسٍ الْمَكِّيِّ، أَنَّ مُكَاتَبًا، كَانَ لاِبْنِ الْمُتَوَكِّلِ هَلَكَ بِمَكَّةَ وَتَرَكَ عَلَيْهِ بَقِيَّةً مِنْ كِتَابَتِهِ وَدُيُونًا لِلنَّاسِ وَتَرَكَ ابْنَتَهُ فَأَشْكَلَ عَلَى عَامِلِ مَكَّةَ الْقَضَاءُ فِيهِ فَكَتَبَ إِلَى عَبْدِ الْمَلِكِ بْنِ مَرْوَانَ يَسْأَلُهُ عَنْ ذَلِكَ فَكَتَبَ إِلَيْهِ عَبْدُ الْمَلِكِ أَنِ ابْدَأْ بِدُيُونِ النَّاسِ ثُمَّ اقْضِ مَا بَقِيَ مِنْ كِتَابَتِهِ ثُمَّ اقْسِمْ مَا بَقِيَ مِنْ مَالِهِ بَيْنَ ابْنَتِهِ وَمَوْلاَهُ ‏.‏ قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا أَنَّهُ لَيْسَ عَلَى سَيِّدِ الْعَبْدِ أَنْ يُكَاتِبَهُ إِذَا سَأَلَهُ ذَلِكَ وَلَمْ أَسْمَعْ أَنَّ أَحَدًا مِنَ الأَئِمَّةِ أَكْرَهَ رَجُلاً عَلَى أَنْ يُكَاتِبَ عَبْدَهُ وَقَدْ سَمِعْتُ بَعْضَ أَهْلِ الْعِلْمِ إِذَا سُئِلَ عَنْ ذَلِكَ فَقِيلَ لَهُ إِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى يَقُولُ ‏{‏فَكَاتِبُوهُمْ إِنْ عَلِمْتُمْ فِيهِمْ خَيْرًا‏}‏ ‏.‏ يَتْلُو هَاتَيْنِ الآيَتَيْنِ ‏{‏وَإِذَا حَلَلْتُمْ فَاصْطَادُوا‏}‏ ‏.‏ ‏{‏فَإِذَا قُضِيَتِ الصَّلاَةُ فَانْتَشِرُوا فِي الأَرْضِ وَابْتَغُوا مِنْ فَضْلِ اللَّهِ‏}‏ ‏.‏ قَالَ مَالِكٌ وَإِنَّمَا ذَلِكَ أَمْرٌ أَذِنَ اللَّهُ عَزَّ وَجَلَّ فِيهِ لِلنَّاسِ وَلَيْسَ بِوَاجِبٍ عَلَيْهِمْ ‏.‏ قَالَ مَالِكٌ وَسَمِعْتُ بَعْضَ أَهْلِ الْعِلْمِ يَقُولُ فِي قَوْلِ اللَّهِ تَبَارَكَ وَتَعَالَى ‏{‏وَآتُوهُمْ مِنْ مَالِ اللَّهِ الَّذِي آتَاكُمْ‏}‏ ‏.‏ إِنَّ ذَلِكَ أَنْ يُكَاتِبَ الرَّجُلُ غُلاَمَهُ ثُمَّ يَضَعُ عَنْهُ مِنْ آخِرِ كِتَابَتِهِ شَيْئًا مُسَمًّى ‏.‏ قَالَ مَالِكٌ فَهَذَا الَّذِي سَمِعْتُ مِنْ أَهْلِ الْعِلْمِ وَأَدْرَكْتُ عَمَلَ النَّاسِ عَلَى ذَلِكَ عِنْدَنَا ‏.‏ \n قَالَ مَالِكٌ وَقَدْ بَلَغَنِي أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ كَاتَبَ غُلاَمًا لَهُ عَلَى خَمْسَةٍ وَثَلاَثِينَ أَلْفَ دِرْهَمٍ ثُمَّ وَضَعَ عَنْهُ مِنْ آخِرِ كِتَابَتِهِ خَمْسَةَ آلاَفِ دِرْهَمٍ ‏.‏ قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا أَنَّ الْمُكَاتَبَ إِذَا كَاتَبَهُ سَيِّدُهُ تَبِعَهُ مَالُهُ وَلَمْ يَتْبَعْهُ وَلَدُهُ إِلاَّ أَنْ يَشْتَرِطَهُمْ فِي كِتَابَتِهِ ‏.‏ قَالَ يَحْيَى سَمِعْتُ مَالِكًا يَقُولُ فِي الْمُكَاتَبِ يُكَاتِبُهُ سَيِّدُهُ وَلَهُ جَارِيَةٌ بِهَا حَبَلٌ مِنْهُ لَمْ يَعْلَمْ بِهِ هُوَ وَلاَ سَيِّدُهُ يَوْمَ كِتَابَتِهِ فَإِنَّهُ لاَ يَتْبَعُهُ ذَلِكَ الْوَلَدُ لأَنَّهُ لَمْ يَكُنْ دَخَلَ فِي كِتَابَتِهِ وَهُوَ لِسَيِّدِهِ فَأَمَّا الْجَارِيَةُ فَإِنَّهَا لِلْمُكَاتَبِ لأَنَّهَا مِنْ مَالِهِ ‏.‏ قَالَ مَالِكٌ فِي رَجُلٍ وَرِثَ مُكَاتَبًا مِنِ امْرَأَتِهِ هُوَ وَابْنُهَا إِنَّ الْمُكَاتَبَ إِنْ مَاتَ قَبْلَ أَنْ يَقْضِيَ كِتَابَتَهُ اقْتَسَمَا مِيرَاثَهُ عَلَى كِتَابِ اللَّهِ وَإِنْ أَدَّى كِتَابَتَهُ ثُمَّ مَاتَ فَمِيرَاثُهُ لاِبْنِ الْمَرْأَةِ وَلَيْسَ لِلزَّوْجِ مِنْ مِيرَاثِهِ شَىْءٌ ‏.‏ قَالَ مَالِكٌ فِي الْمُكَاتَبِ يُكَاتِبُ عَبْدَهُ قَالَ يُنْظَرُ فِي ذَلِكَ فَإِنْ كَانَ إِنَّمَا أَرَادَ الْمُحَابَاةَ لِعَبْدِهِ وَعُرِفَ ذَلِكَ مِنْهُ بِالتَّخْفِيفِ عَنْهُ فَلاَ يَجُوزُ ذَلِكَ وَإِنْ كَانَ إِنَّمَا كَاتَبَهُ عَلَى وَجْهِ الرَّغْبَةِ وَطَلَبِ الْمَالِ وَابْتِغَاءِ الْفَضْلِ وَالْعَوْنِ عَلَى كِتَابَتِهِ فَذَلِكَ جَائِزٌ لَهُ ‏.‏ قَالَ مَالِكٌ فِي رَجُلٍ وَطِئَ مُكَاتَبَةً لَهُ إِنَّهَا إِنْ حَمَلَتْ فَهِيَ بِالْخِيَارِ إِنْ شَاءَتْ كَانَتْ أُمَّ وَلَدٍ وَإِنْ شَاءَتْ قَرَّتْ عَلَى كِتَابَتِهَا فَإِنْ لَمْ تَحْمِلْ فَهِيَ عَلَى كِتَابَتِهَا ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا فِي الَعَبْدِ يَكُونُ بَيْنَ الرَّجُلَيْنِ إِنَّ أَحَدَهُمَا لاَ يُكَاتِبُ نَصِيبَهُ مِنْهُ أَذِنَ لَهُ بِذَلِكَ صَاحِبُهُ أَوْ لَمْ يَأْذَنْ إِلاَّ أَنْ يُكَاتِبَاهُ جَمِيعًا لأَنَّ ذَلِكَ يَعْقِدُ لَهُ عِتْقًا وَيَصِيرُ إِذَا أَدَّى الْعَبْدُ مَا كُوتِبَ عَلَيْهِ إِلَى أَنْ يَعْتِقَ نِصْفُهُ وَلاَ يَكُونُ عَلَى الَّذِي كَاتَبَ بَعْضَهُ أَنْ يَسْتَتِمَّ عِتْقَهُ فَذَلِكَ خِلاَفُ مَا قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ أَعْتَقَ شِرْكًا لَهُ فِي عَبْدٍ قُوِّمَ عَلَيْهِ قِيمَةَ الْعَدْلِ ‏\"‏ ‏.‏ قَالَ مَالِكٌ فَإِنْ جَهِلَ ذَلِكَ حَتَّى يُؤَدِّيَ الْمُكَاتَبُ أَوْ قَبْلَ أَنْ يُؤَدِّيَ رَدَّ إِلَيْهِ الَّذِي كَاتَبَهُ مَا قَبَضَ مِنَ الْمُكَاتَبِ فَاقْتَسَمَهُ هُوَ وَشَرِيكُهُ عَلَى قَدْرِ حِصَصِهِمَا وَبَطَلَتْ كِتَابَتُهُ وَكَانَ عَبْدًا لَهُمَا عَلَى حَالِهِ الأُولَى ‏.‏ قَالَ مَالِكٌ فِي مُكَاتَبٍ بَيْنَ رَجُلَيْنِ فَأَنْظَرَهُ أَحَدُهُمَا بِحَقِّهِ الَّذِي عَلَيْهِ وَأَبَى الآخَرُ أَنْ يُنْظِرَهُ فَاقْتَضَى الَّذِي أَبَى أَنْ يُنْظِرَهُ بَعْضَ حَقِّهِ ثُمَّ مَاتَ الْمُكَاتَبُ وَتَرَكَ مَالاً لَيْسَ فِيهِ وَفَاءٌ مِنْ كِتَابَتِهِ قَالَ مَالِكٌ يَتَحَاصَّانِ بِقَدْرِ مَا بَقِيَ لَهُمَا عَلَيْهِ يَأْخُذُ كُلُّ وَاحِدٍ مِنْهُمَا بِقَدْرِ حِصَّتِهِ فَإِنْ تَرَكَ الْمُكَاتَبُ فَضْلاً عَنْ كِتَابَتِهِ أَخَذَ كُلُّ وَاحِدٍ مِنْهُمَا مَا بَقِيَ مِنَ الْكِتَابَةِ وَكَانَ مَا بَقِيَ بَيْنَهُمَا بِالسَّوَاءِ فَإِنْ عَجَزَ الْمُكَاتَبُ وَقَدِ اقْتَضَى الَّذِي لَمْ يُنْظِرْهُ أَكْثَرَ مِمَّا اقْتَضَى صَاحِبُهُ كَانَ الْعَبْدُ بَيْنَهُمَا نِصْفَيْنِ وَلاَ يَرُدُّ عَلَى صَاحِبِهِ فَضْلَ مَا اقْتَضَى لأَنَّهُ إِنَّمَا اقْتَضَى الَّذِي لَهُ بِإِذْنِ صَاحِبِهِ وَإِنْ وَضَعَ عَنْهُ أَحَدُهُمَا الَّذِي لَهُ ثُمَّ اقْتَضَى صَاحِبُهُ بَعْضَ الَّذِي لَهُ عَلَيْهِ ثُمَّ عَجَزَ فَهُوَ بَيْنَهُمَا وَلاَ يَرُدُّ الَّذِي اقْتَضَى عَلَى صَاحِبِهِ شَيْئًا لأَنَّهُ إِنَّمَا اقْتَضَى الَّذِي لَهُ عَلَيْهِ وَذَلِكَ بِمَنْزِلَةِ الدَّيْنِ لِلرَّجُلَيْنِ بِكِتَابٍ وَاحِدٍ عَلَى رَجُلٍ وَاحِدٍ فَيُنْظِرُهُ أَحَدُهُمَا وَيَشِحُّ الآخَرُ فَيَقْتَضِي بَعْضَ حَقِّهِ ثُمَّ يُفْلِسُ الْغَرِيمُ فَلَيْسَ عَلَى الَّذِي اقْتَضَى أَنْ يَرُدَّ شَيْئًا مِمَّا أَخَذَ ‏.","english":{"narrator":"","text":"Malik related to me from Humayd ibn Qays al-Makki that a son of\nal-Mutawakkil had a mukatab who died at Makka and left (enough to pay)\nthe rest of his kitaba and he owed some debts to people. He also left\na daughter. The governor of Makka was not certain about how to judge\nin the case, so he wrote to Abd al-Malik ibn Marwan to ask him about\nit. Abd al-Malik wrote to him, \"Begin with the debts owed to people,\nand then pay what remains of his kitaba. Then divide what remains of\nthe property between the daughter and the master.\"\n\n\nMalik\nsaid, \"What is done among us is that the master of a slave does not\nhave to give his slave a kitaba if he asks for it. I have not heard of\nany of the Imams forcing a man to give a kitaba to his slave. I heard\nthat one of the people of knowledge, when someone asked about that and\nmentioned that Allah the Blessed, the Exalted, said, 'Give them their\nkitaba, if you know some good in them' (Sura 24 ayat 33) recited these\ntwo ayats, 'When you are free of the state of ihram, then hunt for\ngame.' (Sura 5 ayat 3) 'When the prayer is finished, scatter in the\nland and seek Allah's favour.' \" (Sura 62 ayat 10)\n\n\nMalik\ncommented, \"It is a way of doing things for which Allah, the Mighty,\nthe Majestic, has given permission to people, and it is not obligatory\nfor them.\" Malik said, \"I heard one of the people of knowledge say\nabout the word of Allah, the Blessed, the Exalted, 'Give them of the\nwealth which Allah has given you,' that it meant that a man give his\nslave a kitaba and then reduce the end of his kitaba for him by some\nspecific amount.\"\n\n\nMalik said, \"This is what I have heard from\nthe people of knowledge and what I see people doing here.\"\n\n\nMalik said, \"I have heard that Abdullah ibn Umar gave one of his\nslaves his kitaba for 35,000 dirhams, and then reduced the end of his\nkitaba by 5,000 dirhams.\"\n\n\nMalik said, \"What is done among us\nis that when a master gives a mukatab his kitaba, the mukatab's\nproperty goes with him but his children do not go with him unless he\nstipulates that in his kitaba.\"\n\n\nYahya said, \"I heard Malik\nsay that if a mukatab whose master had given him a kitaba had a slave-\ngirl who was pregnant by him, and neither he nor his master knew that\non the day he was given his kitaba, the child did not follow him\nbecause he was not included in the kitaba. He belonged to the master.\nAs for the slave-girl, she belonged to the mukatab because she was his\nproperty.\"\n\n\nMalik said that if a man and his wife's son (by\nanother husband) inherited a mukatab from the wife and the mukatab\ndied before he had completed his kitaba, they divided his inheritance\nbetween them according to the Book of Allah. If the slave paid his\nkitaba and then died, his inheritance went to the son of the woman,\nand the husband had nothing of his inheritance.\n\n\nMalik said\nthat if a mukatab gave his own slave a kitaba, the situation was\nlooked at. If he wanted to do his slave a favour and it was obvious by\nhis making it easy for him, that was not permitted. If he was giving\nhim a kitaba from desire to find money to pay off his own kitaba, that\nwas permitted for him.\n\n\nMalik said that if a man had\nintercourse with a mukataba of his and she became pregnant by him, she\nhad an option. If she liked she could be an umm walad. If she wished,\nshe could confirm her kitaba. If she did not conceive, she still had\nher kitaba.\n\n\nMalik said, \"The generally agreed on way of doing\nthings among us about a slave who is owned by two men is that one of\nthem does not give a kitaba for his share, whether or not his\ncompanion gives him permission to do so, unless they both write the\nkitaba together, because that alone would effect setting him free. If\nthe slave were to fulfil what he had agreed on to free half of\nhimself, and then the one who had given a kitaba for half of him was\nnot obliged to complete his setting free, that would be in opposition\nto the words of the Messenger of Allah, may Allah bless him and grant\nhim peace. 'If someone frees his share in a slave and has enough money\nto cover the full price of the slave, justly evaluated for him, he\nmust give his partners their shares, so the slave is completely free .\n' \"\n\n\nMalik said, \"If he is not aware of that until the mukatab\nhas met the terms or before he has met them the owner who has written\nhim the kitaba returns what he has taken from the mukatab to him, and\nthen he and his partner divide him according to their original shares\nand the kitaba is invalid. He is the slave of both of them in his\noriginal state.\"\n\n\nMalik spoke about a mukatab who was owned by\ntwo men and one of them granted him a delay in the payment of the\nright which he was owed, and the other refused to defer it, and so the\none who refused to defer the payment exacted his part of the due.\nMalik said that if the mukatab then died and left property which did\nnot complete his kitaba, \"They divide it according to what they are\nstill owed by him. Each of them takes according to his share. If the\nmukatab leaves more than his kitaba, each of them takes what remains\nto them of the kitaba, and what remains after that is divided equally\nbetween them. If the mukatab is unable to pay his kitaba fully and the\none who did not allow him to defer his payment has exacted more than\nhis associate did, the slave is still divided equally between them,\nand he does not return to his associates the excess of what he has\nexacted, because he only exacted his right with the permission of his\nassociate. If one of them remits what is owed to him and then his\nassociate exacts part of what he is owed by him and then the mukatab\nis unable to pay, he belongs to both of them. And the one who has\nexacted something does not return anything because he only demanded\nwhat he was owed. That is like the debt of two men in one writing\nagainst one man. One of them grants him time to pay and the other is\ngreedy and exacts his due. Then the debtor goes bankrupt. The one who\nexacted his due does not have to return any of what he took.\""}},{"id":4,"idInBook":4,"chapterId":39,"bookId":7,"arabic":"","english":{"narrator":"","text":"Malik said, \"The generally agreed on way of doing things among us\nis that when slaves write their kitaba together in one kitaba, and\nsome are responsible for others, and they are not reduced anything by\nthe death of one of the responsible ones, and then one of them says,\n'I can't do it,' and gives up, his companions can use him in whatever\nwork he can do and they help each other with that in their kitaba\nuntil they are freed, if they are freed, or remain slaves if they\nremain slaves.\"\n\n\nMalik said, \"The generally agreed on way of\ndoing things among us is that when a master gives a slave his kitaba,\nit is not permitted for the master to let anyone assume the\nresponsibility for the kitaba of his slave if the slave dies or is\nincapable. This is not part of the sunna of the muslims. That is\nbecause when a man assumes responsibility to the master of a mukatab\nfor what the mukatab owes of his kitaba, and then the master of the\nmukatab pursues that from the one who assumes the responsibility, he\ntakes his money falsely. It is not as if he is buying the mukatab, so\nthat what he gives is part of the price of something that is his, and\nneither is the mukatab being freed so that the price established for\nhim buys his inviolability as a free man. If the mukatab is unable to\nmeet the payments he reverts to his master and is his slave. That is\nbecause kitaba is not a fixed debt which can be assumed by the master\nof the mukatab. It is something which, when it is paid by the mukatab,\nsets him free. If the mukatab dies and has a debt, his master is not\none of the creditors for what remains unpaid of the kitaba. The\ncreditors have precedence over the master. If the mukatab cannot meet\nthe payments, and he owes debts to people, he reverts to being a slave\nowned by his master and the debts to the people are the liability of\nthe mukatab. The creditors do not enter with the master into any share\nof the price of his person.\"\n\n\nMalik said, \"When people are\nwritten together in one kitaba and there is no kinship between them by\nwhich they inherit from each other, and some of them are responsible\nfor others, then none of them are freed before the others until all\nthe kitaba has been paid. If one of them dies and leaves property and\nit is more than all of what is against them, it pays all that is\nagainst them . The excess of the property goes to the master, and none\nof those who have been written in the kitaba with the deceased have\nany of the excess. The master's claims are overshadowed by their\nclaims for the portions which remain against them of the kitaba which\ncan be fulfilled from the property of the deceased, because the\ndeceased had assumed their responsibility and they must use his\nproperty to pay for their freedom. If the deceased mukatab has a free\nchild not born in kitaba and who was not written in the kitaba, it\ndoes not inherit from him because the mukatab was not freed until he\ndied.\""}},{"id":5,"idInBook":5,"chapterId":39,"bookId":7,"arabic":"حَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ أُمَّ سَلَمَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم كَانَتْ تُقَاطِعُ مُكَاتَبِيهَا بِالذَّهَبِ وَالْوَرِقِ ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا فِي الْمَكَاتَبِ يَكُونُ بَيْنَ الشَّرِيكَيْنِ فَإِنَّهُ لاَ يَجُوزُ لأَحَدِهِمَا أَنْ يُقَاطِعَهُ عَلَى حِصَّتِهِ إِلاَّ بِإِذْنِ شَرِيكِهِ وَذَلِكَ أَنَّ الْعَبْدَ وَمَالَهُ بَيْنَهُمَا فَلاَ يَجُوزُ لأَحَدِهِمَا أَنْ يَأْخُذَ شَيْئًا مِنْ مَالِهِ إِلاَّ بِإِذْنِ شَرِيكِهِ وَلَوْ قَاطَعَهُ أَحَدُهُمَا دُونَ صَاحِبِهِ ثُمَّ حَازَ ذَلِكَ ثُمَّ مَاتَ الْمُكَاتَبُ وَلَهُ مَالٌ أَوْ عَجَزَ لَمْ يَكُنْ لِمَنْ قَاطَعَهُ شَىْءٌ مِنْ مَالِهِ وَلَمْ يَكُنْ لَهُ أَنْ يَرُدَّ مَا قَاطَعَهُ عَلَيْهِ وَيَرْجِعَ حَقُّهُ فِي رَقَبَتِهِ وَلَكِنْ مَنْ قَاطَعَ مُكَاتَبًا بِإِذْنِ شَرِيكِهِ ثُمَّ عَجَزَ الْمُكَاتَبُ فَإِنْ أَحَبَّ الَّذِي قَاطَعَهُ أَنْ يَرُدَّ الَّذِي أَخَذَ مِنْهُ مِنَ الْقَطَاعَةِ وَيَكُونُ عَلَى نَصِيبِهِ مِنْ رَقَبَةِ الْمُكَاتَبِ كَانَ ذَلِكَ لَهُ وَإِنْ مَاتَ الْمُكَاتَبُ وَتَرَكَ مَالاً اسْتَوْفَى الَّذِي بَقِيَتْ لَهُ الْكِتَابَةُ حَقَّهُ الَّذِي بَقِيَ لَهُ عَلَى الْمُكَاتَبِ مِنْ مَالِهِ ثُمَّ كَانَ مَا بَقِيَ مِنْ مَالِ الْمُكَاتَبِ بَيْنَ الَّذِي قَاطَعَهُ وَبَيْنَ شَرِيكِهِ عَلَى قَدْرِ حِصَصِهِمَا فِي الْمُكَاتَبِ وَإِنْ كَانَ أَحَدُهُمَا قَاطَعَهُ وَتَمَاسَكَ صَاحِبُهُ بِالْكِتَابَةِ ثُمَّ عَجَزَ الْمُكَاتَبُ قِيلَ لِلَّذِي قَاطَعَهُ إِنْ شِئْتَ أَنْ تَرُدَّ عَلَى صَاحِبِكَ نِصْفَ الَّذِي أَخَذْتَ وَيَكُونُ الْعَبْدُ بَيْنَكُمَا شَطْرَيْنِ وَإِنْ أَبَيْتَ فَجَمِيعُ الْعَبْدِ لِلَّذِي تَمَسَّكَ بِالرِّقِّ خَالِصًا ‏.‏ قَالَ مَالِكٌ فِي الْمُكَاتَبِ يَكُونُ بَيْنَ الرَّجُلَيْنِ فَيُقَاطِعُهُ أَحَدُهُمَا بِإِذْنِ صَاحِبِهِ ثُمَّ يَقْتَضِي الَّذِي تَمَسَّكَ بِالرِّقِّ مِثْلَ مَا قَاطَعَ عَلَيْهِ صَاحِبُهُ أَوْ أَكْثَرَ مِنْ ذَلِكَ ثُمَّ يَعْجِزُ الْمُكَاتَبُ ‏.‏ قَالَ مَالِكٌ فَهُوَ بَيْنَهُمَا لأَنَّهُ إِنَّمَا اقْتَضَى الَّذِي لَهُ عَلَيْهِ وَإِنِ اقْتَضَى أَقَلَّ مِمَّا أَخَذَ الَّذِي قَاطَعَهُ ثُمَّ عَجَزَ الْمُكَاتَبُ فَأَحَبَّ الَّذِي قَاطَعَهُ أَنَّ يَرُدَّ عَلَى صَاحِبِهِ نِصْفَ مَا تَفَضَّلَهُ بِهِ وَيَكُونُ الْعَبْدُ بَيْنَهُمَا نِصْفَيْنِ فَذَلِكَ لَهُ وَإِنْ أَبَى فَجَمِيعُ الْعَبْدِ لِلَّذِي لَمْ يُقَاطِعْهُ وَإِنْ مَاتَ الْمُكَاتَبُ وَتَرَكَ مَالاً فَأَحَبَّ الَّذِي قَاطَعَهُ أَنْ يَرُدَّ عَلَى صَاحِبِهِ نِصْفَ مَا تَفَضَّلَهُ بِهِ وَيَكُونُ الْمِيرَاثُ بَيْنَهُمَا فَذَلِكَ لَهُ وَإِنْ كَانَ الَّذِي تَمَسَّكَ بِالْكِتَابَةِ قَدْ أَخَذَ مِثْلَ مَا قَاطَعَ عَلَيْهِ شَرِيكُهُ أَوْ أَفْضَلَ فَالْمِيرَاثُ بَيْنَهُمَا بِقَدْرِ مِلْكِهِمَا لأَنَّهُ إِنَّمَا أَخَذَ حَقَّهُ ‏.‏ قَالَ مَالِكٌ فِي الْمُكَاتَبِ يَكُونُ بَيْنَ الرَّجُلَيْنِ فَيُقَاطِعُ أَحَدُهُمَا عَلَى نِصْفِ حَقِّهُ بِإِذْنِ صَاحِبِهِ ثُمَّ يَقْبِضُ الَّذِي تَمَسَّكَ بِالرِّقِّ أَقَلَّ مِمَّا قَاطَعَ عَلَيْهِ صَاحِبُهُ ثُمَّ يَعْجِزُ الْمُكَاتَبُ ‏.‏ قَالَ مَالِكٌ إِنْ أَحَبَّ الَّذِي قَاطَعَ الْعَبْدَ أَنْ يَرُدَّ عَلَى صَاحِبِهِ نِصْفَ مَا تَفَضَّلَهُ بِهِ كَانَ الْعَبْدُ بَيْنَهُمَا شَطْرَيْنِ وَإِنْ أَبَى أَنْ يَرُدَّ فَلِلَّذِي تَمَسَّكَ بِالرِّقِّ حِصَّةُ صَاحِبِهِ الَّذِي كَانَ قَاطَعَ عَلَيْهِ الْمُكَاتَبَ ‏.‏ قَالَ مَالِكٌ وَتَفْسِيرُ ذَلِكَ أَنَّ الْعَبْدَ يَكُونُ بَيْنَهُمَا شَطْرَيْنِ فَيُكَاتِبَانِهِ جَمِيعًا ثُمَّ يُقَاطِعُ أَحَدُهُمَا الْمُكَاتَبَ عَلَى نِصْفِ حَقِّهِ بِإِذْنِ صَاحِبِهِ وَذَلِكَ الرُّبُعُ مِنْ جَمِيعِ الْعَبْدِ ثُمَّ يَعْجِزُ الْمُكَاتَبُ فَيُقَالُ لِلَّذِي قَاطَعَهُ إِنْ شِئْتَ فَارْدُدْ عَلَى صَاحِبِكَ نِصْفَ مَا فَضَلْتَهُ بِهِ وَيَكُونُ الْعَبْدُ بَيْنَكُمَا شَطْرَيْنِ ‏.‏ وَإِنْ أَبَى كَانَ لِلَّذِي تَمَسَّكَ بِالْكِتَابَةِ رُبُعُ صَاحِبِهِ الَّذِي قَاطَعَ الْمُكَاتَبَ عَلَيْهِ خَالِصًا وَكَانَ لَهُ نِصْفُ الْعَبْدِ فَذَلِكَ ثَلاَثَةُ أَرْبَاعِ الْعَبْدِ وَكَانَ لِلَّذِي قَاطَعَ رُبُعُ الْعَبْدِ لأَنَّهُ أَبَى أَنْ يَرُدَّ ثَمَنَ رُبُعِهِ الَّذِي قَاطَعَ عَلَيْهِ ‏.‏ قَالَ مَالِكٌ فِي الْمُكَاتَبِ يُقَاطِعُهُ سَيِّدُهُ فَيَعْتِقُ وَيَكْتُبُ عَلَيْهِ مَا بَقِيَ مِنْ قَطَاعَتِهِ دَيْنًا عَلَيْهِ ثُمَّ يَمُوتُ الْمُكَاتَبُ وَعَلَيْهِ دَيْنٌ لِلنَّاسِ ‏.‏ قَالَ مَالِكٌ فَإِنَّ سَيِّدَهُ لاَ يُحَاصُّ غُرَمَاءَهُ بِالَّذِي عَلَيْهِ مِنْ قَطَاعَتِهِ وَلِغُرَمَائِهِ أَنْ يُبَدَّءُوا عَلَيْهِ ‏.‏ قَالَ مَالِكٌ لَيْسَ لِلْمُكَاتَبِ أَنْ يُقَاطِعَ سَيِّدَهُ إِذَا كَانَ عَلَيْهِ دَيْنٌ لِلنَّاسِ فَيَعْتِقُ وَيَصِيرُ لاَ شَىْءَ لَهُ لأَنَّ أَهْلَ الدَّيْنِ أَحَقُّ بِمَالِهِ مِنْ سَيِّدِهِ فَلَيْسَ ذَلِكَ بِجَائِزٍ لَهُ ‏.‏ قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا فِي الرَّجُلِ يُكَاتِبُ عَبْدَهُ ثُمَّ يُقَاطِعُهُ بِالذَّهَبِ فَيَضَعُ عَنْهُ مِمَّا عَلَيْهِ مِنَ الْكِتَابَةِ عَلَى أَنْ يُعَجِّلَ لَهُ مَا قَاطَعَهُ عَلَيْهِ أَنَّهُ لَيْسَ بِذَلِكَ بَأْسٌ وَإِنَّمَا كَرِهَ ذَلِكَ مَنْ كَرِهَهُ لأَنَّهُ أَنْزَلَهُ بِمَنْزِلَةِ الدَّيْنِ يَكُونُ لِلرَّجُلِ عَلَى الرَّجُلِ إِلَى أَجَلٍ فَيَضَعُ عَنْهُ وَيَنْقُدُهُ وَلَيْسَ هَذَا مِثْلَ الدَّيْنِ إِنَّمَا كَانَتْ قَطَاعَةُ الْمُكَاتَبِ سَيِّدَهُ عَلَى أَنْ يُعْطِيَهُ مَالاً فِي أَنْ يَتَعَجَّلَ الْعِتْقَ فَيَجِبُ لَهُ الْمِيرَاثُ وَالشَّهَادَةُ وَالْحُدُودُ وَتَثْبُتُ لَهُ حُرْمَةُ الْعَتَاقَةِ وَلَمْ يَشْتَرِ دَرَاهِمَ بِدَرَاهِمَ وَلاَ ذَهَبًا بِذَهَبٍ وَإِنَّمَا مَثَلُ ذَلِكَ مَثَلُ رَجُلٍ قَالَ لِغُلاَمِهِ ائْتِنِي بِكَذَا وَكَذَا دِينَارًا وَأَنْتَ حُرٌّ فَوَضَعَ عَنْهُ مِنْ ذَلِكَ فَقَالَ إِنْ جِئْتَنِي بِأَقَلَّ مِنْ ذَلِكَ فَأَنْتَ حُرٌّ ‏.‏ فَلَيْسَ هَذَا دَيْنًا ثَابِتًا وَلَوْ كَانَ دَيْنًا ثَابِتًا لَحَاصَّ بِهِ السَّيِّدُ غُرَمَاءَ الْمُكَاتَبِ إِذَا مَاتَ أَوْ أَفْلَسَ فَدَخَلَ مَعَهُمْ فِي مَالِ مُكَاتَبِهِ ‏.‏","english":{"narrator":"","text":"Malik related to me that he heard that Umm Salama, the wife of\nthe Prophet, may Allah bless him and grant him peace, made a\nsettlement with her mukatab for an agreed amount of gold and silver.\n\n\nMalik said, \"The generally agreed on way of doing things\namong us in the case of a mukatab who is shared by two partners, is\nthat one of them cannot make a settlement with him for an agreed price\naccording to his portion without the consent of his partner. That is\nbecause the slave and his property are owned by both of them, and so\none of them is not permitted to take any of the property except with\nthe consent of his partner. If one of them settled with the mukatab\nand his partner did not, and he took the agreed price, and then the\nmukatab died while he had property or was unable to pay, the one who\nsettled would not have anything of the mukatab's property and he could\nnot return that for which he made settlement so that his right to the\nslave's person would return to him. However, when someone settles with\na mukatab with the permission of his partner and then the mukatab is\nunable to pay, it is preferable that the one who broke with him return\nwhat he has taken from the mukatab for the severance and he can have\nback his portion of the mukatab. He can do that. If the mukatab dies\nand leaves property, the partner who has kept hold of the kitaba is\npaid in full the amount of the kitaba which remains to him against the\nmukatab from the mukatab's property. Then what remains of property of\nthe mukatab is between the partner who broke with him and his partner,\naccording to their shares in the mukatab. If one of the partners\nbreaks off with him and the other keeps the kitaba, and the mukatab is\nunable to pay, it is said to the partner who settled with him, 'If you\nwish to give your partner half of what you took so the slave is\ndivided between you, then do so. If you refuse, then all of the slave\nbelongs to the one who held on to possession of the slave.' \"\n\n\nMalik spoke about a mukatab who was shared between two men and one of\nthem made a settlement with him with the permission of his partner.\nThen the one who retained possession of the slave demanded the like of\nthat for which his partner had settled or more than that and the\nmukatab could not pay it. He said, \"The mukatab is shared between them\nbecause the man has only demanded what is owed to him. If he demands\nless than what the one who settled with him took and the mukatab can\nnot manage that, and the one who settled with him prefers to return to\nhis partner half of what he took so the slave is divided in halves\nbetween them, he can do that. If he refuses then all of the slave\nbelongs to the one who did not settle with him. If the mukatab dies\nand leaves property, and the one who settled with him prefers to\nreturn to his companion half of what he has taken so the inheritance\nis divided between them, he can do that. If the one who has kept the\nkitaba takes the like of what the one who has settled with him took,\nor more, the inheritance is between them according to their shares in\nthe slave because he is only taking his right.\"\n\n\nMalik spoke\nabout a mukatab who was shared between two men and one of them made a\nsettlement with him for half of what was due to him with the\npermission of his partner, and then the one who retained possession of\nthe slave took less than what his partner settled with him for and the\nmukatab was unable to pay. He said, \"If the one who made a settlement\nwith the slave prefers to return half of what he was awarded to his\npartner, the slave is divided between them. If he refuses to return\nit, the one who retained possession has the portion of the share for\nwhich his partner made a settlement with the mukatab.\"\n\n\nMalik\nsaid, \"The explanation of that is that the slave is divided in two\nhalves between them. They write him a kitaba together and then one of\nthem makes a settlement with the mukatab for half his due with the\npermission of his partner. That is a fourth of all the slave. Then the\nmukatab is unable to continue, so it is said to the one who settled\nwith him, 'If you wish, return to your partner half of what you were\nawarded and the slave is divided equally between you.' If he refuses,\nthe one who held to the kitaba takes in full the fourth of his partner\nfor which he made settlement with the mukatab. He had half the slave,\nso that now gives him three-fourths of the slave. The one who broke\noff has a fourth of the slave because he refused to return the\nequivalent of the fourth share for which he settled.\"\n\n\nMalik\nspoke about a mukatab whose master made a settlement with him and set\nhim free and what remained of his severance was written against him as\ndebt, then the mukatab died and people had debts against him. He said,\n\"His master does not share with the creditors because of what he is\nowed from the severance. The creditors begin first.\"\n\n\nMalik\nsaid, \"A mukatab cannot break with his master when he owes debts to\npeople. He would be set free and have nothing because the people who\nhold the debts are more entitled to his property than his master. That\nis not permitted for him.\"\n\n\nMalik said, \"According to the way\nthings are done among us, there is no harm if a man gives a kitaba to\nhis slave and settles with him for gold and reduces what he is owed of\nthe kitaba provided that only the gold is paid immediately. Whoever\ndisapproves of that does so because he puts it in the category of a\ndebt which a man has against another man for a set term. He gives him\na reduction and he pays it immediately. This is not like that debt.\nThe breaking of the mukatab with his master is dependent on his giving\nmoney to speed up the setting free. Inheritance, testimony and the\nhudud are obliged for him and the inviolability of being set free is\nestablished for him. He is not buying dirhams for dirhams or gold for\ngold. Rather it is like a man who having said to his slave, 'Bring me\nsuch-and-such an amount of dinars and you are free', then reduces that\nfor him, saying, 'If you bring me less than that, you are free.' That\nis not a fixed debt. Had it been a fixed debt, the master would have\nshared with the creditors of the mukatab when he died or went\nbankrupt. His claim on the property of the mukatab would join theirs.\""}},{"id":6,"idInBook":6,"chapterId":39,"bookId":7,"arabic":"","english":{"narrator":"","text":"Malik said, \"The best of what I have heard about a mukatab who\ninjures a man so that blood-money must be paid, is that if the mukatab\ncan pay the blood-money for the injury with his kitaba,  he does so,\nand it is against his kitaba. If he cannot do that, and he cannot pay\nhis kitaba because he must pay the blood-money of that injury before\nthe kitaba, and he cannot pay the blood-money of that injury, then his\nmaster has an option. If he prefers to pay the blood-money of that\ninjury, he does so and keeps his slave and he becomes an owned slave.\nIf he wishes to surrender the slave to the injured, he surrenders him.\nThe master does not have to do more than surrender his slave.\"\n\n\nMalik spoke about people who were in a general kitaba and one of\nthem caused an injury which entailed blood-money. He said, \"If any of\nthem does an injury involving blood-money, he and those who are with\nhim in the kitaba are asked to pay all the blood-money of that injury.\nIf they pay, they are confirmed in their kitaba. If they do not pay,\nand they are incapable then their master has an option. If he wishes,\nhe can pay all the blood-money of that injury and all the slaves\nrevert to him. If he wishes, he can surrender the one who did the\ninjury alone and all the others revert to being his slaves since they\ncould not pay the blood-money of the injury which their companion\ncaused.\"\n\n\nMalik said, \"The way of doing things about which\nthere is no dispute among us, is that when a mukatab is injured in\nsome way which entails blood-money or one of the mukatab's children\nwho is written with him in the kitaba is injured, their blood-money is\nthe blood-money of slaves of their value, and what is appointed to\nthem as their blood-money is paid to the master who has the kitaba and\nhe reckons that for the mukatab at the end of his kitaba and there is\na reduction for the blood-money that the master has taken for the\ninjury.\"\n\n\nMalik said, \"The explanation of that is say, for\nexample, he has written his kitaba for three thousand dirhams and the\nblood-money taken by the master for his injury is one thousand\ndirhams. When the mukatab has paid his master two thousand dirhams he\nis free. If what remains of his kitaba is one thousand dirhams and the\nblood-money for his injury is one thousand dirhams, he is free\nstraightaway. If the blood-money of the injury is more than what\nremains of the kitaba, the master of the mukatab takes what remains of\nhis kitaba and frees him. What remains after the payment of the kitaba\nbelongs to the mukatab. One must not pay the mukatab any of the blood-\nmoney of his injury in case he might consume it and use it up. If he\ncould not pay his kitaba completely he would then return to his master\none eyed, with a hand cut off, or crippled in body. His master only\nwrote his kitaba against his property and earnings, and he did not\nwrite his kitaba so that he would take the blood-money for what\nhappened to his child or to himself and use it up and consume it. One\npays the blood-money of injuries to a mukatab and his children who are\nborn in his kitaba, or their kitaba is written, to the master and he\ntakes it into account for him at the end of his kitaba.\""}},{"id":7,"idInBook":7,"chapterId":39,"bookId":7,"arabic":"","english":{"narrator":"","text":"Malik said, \"The best of what is said about a man who buys the\nmukatab of a man is that if the man wrote the slave's kitaba for\ndinars or dirhams, he does not sell him unless it is for merchandise\nwhich is paid immediately and not deferred, because if it is deferred,\nit would be a debt for a debt. A debt for a debt is forbidden.\"\n\n\nHe said, \"If the master gives a mukatab his kitaba for certain\nmerchandise of camels, cattle, sheep, or slaves, it is more correct\nthat the buyer buy him for gold, silver, or different goods than the\nones his master wrote the kitaba for, and that must be paid\nimmediately, not deferred.\"\n\n\nMalik said, \"The best of what I\nhave heard about a mukatab when he is sold is that he is more entitled\nto buy his kitaba than the one who buys him if he can pay his master\nthe price for which he was sold in cash. That is because his buying\nhimself is his freedom, and freedom has priority over what bequests\naccompany it. If one of those who have written the kitaba for the\nmukatab sells his portion of him, so that a half, a third, a fourth,\nor whatever share of the mukatab is sold, the mukatab does not have\nthe right of pre-emption in what is sold of him. That is because it is\nlike the severance of a partner, and a partner can only make a\nsettlement for a partner of the one who is mukatab with the permission\nof his partners because what is sold of him does not give him complete\nrights as a free man and his property is barred from him, and by\nbuying part of himself, it is feared that he will become incapable of\ncompleting payment because of what he had to spend. That is not like\nthe mukatab buying himself completely unless whoever has some of the\nkitaba remaining due to him gives him permission. If they give him\npermission, he is more entitled to what is sold of him.\"\n\n\nMalik said, \"Selling one of the instalments of a mukatab is not halal.\nThat is because it Is an uncertain transaction. If the mukatab cannot\npay it, what he owes is nullified. If he dies or goes bankrupt and he\nowes debts to people, then the person who bought his instalment does\nnot take any of his portion with the creditors. The person who buys\none of the instalments of the mukatab is in the position of the master\nof the mukatab. The master of the mukatab does not have a share with\nthe creditors of the mukatab for what he is owed of the kitaba of his\nslave. It is also like that with the kharaj, (a set amount deducted\ndaily from the slave against his earnings), which accumulates for a\nmaster from the earnings of his slave. The creditors of his slave do\nnot allow him a share for what has accumulated for him from those\ndeductions.\"\n\n\nMalik said, \"There is no harm in a mukatab\npaying off his kitaba with coin or merchandise other than the\nmerchandise for which he wrote his kitaba if it is identical with it,\non time (for the instalment) or delayed. \"\n\n\nMalik said that if\na mukatab died and left an umm walad and small children by her or by\nsomeone else and they could not work and it was feared that they would\nbe unable to fulfil their kitaba, the umm walad of the father was sold\nif her price would pay all the kitaba for them, whether or not she was\ntheir mother. They were paid for and set free because their father did\nnot forbid her sale if he feared that he would be unable to complete\nhis kitaba. If her price would not pay for them and neither she nor\nthey could work, they all reverted to being slaves of the master.\n\n\nMalik said, \"What is done among us in the case of a person who\nbuys the kitaba of a mukatab, and then the mukatab dies before he has\npaid his kitaba, is that the person who bought the kitaba inherits\nfrom him. If, rather than dying, the mukatab cannot pay, the buyer has\nhis person. If the mukatab pays his kitaba to the person who bought\nhim and he is freed, his wala' goes to the person who wrote the kitaba\nand the person who bought his kitaba does not have any of it.\""}},{"id":8,"idInBook":8,"chapterId":39,"bookId":7,"arabic":"حَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ عُرْوَةَ بْنَ الزُّبَيْرِ، وَسُلَيْمَانَ بْنَ يَسَارٍ، سُئِلاَ عَنْ رَجُلٍ، كَاتَبَ عَلَى نَفْسِهِ وَعَلَى بَنِيهِ ثُمَّ مَاتَ هَلْ يَسْعَى بَنُو الْمُكَاتَبِ فِي كِتَابَةِ أَبِيهِمْ أَمْ هُمْ عَبِيدٌ فَقَالاَ بَلْ يَسْعَوْنَ فِي كِتَابَةِ أَبِيهِمْ وَلاَ يُوْضَعُ عَنْهُمْ لِمَوْتِ أَبِيهِمْ شَىْءٌ ‏.‏ قَالَ مَالِكٌ وَإِنْ كَانُوا صِغَارًا لاَ يُطِيقُونَ السَّعْىَ لَمْ يُنْتَظَرْ بِهِمْ أَنْ يَكْبَرُوا وَكَانُوا رَقِيقًا لِسَيِّدِ أَبِيهِمْ إِلاَّ أَنْ يَكُونَ الْمُكَاتَبُ تَرَكَ مَا يُؤَدَّى بِهِ عَنْهُمْ نُجُومُهُمْ إِلَى أَنْ يَتَكَلَّفُوا السَّعْىَ فَإِنْ كَانَ فِيمَا تَرَكَ مَا يُؤَدَّى عَنْهُمْ أُدِّيَ ذَلِكَ عَنْهُمْ وَتُرِكُوا عَلَى حَالِهِمْ حَتَّى يَبْلُغُوا السَّعْىَ فَإِنْ أَدَّوْا عَتَقُوا وَإِنْ عَجَزُوا رَقُّوا ‏.‏ قَالَ مَالِكٌ فِي الْمُكَاتَبِ يَمُوتُ وَيَتْرُكُ مَالاً لَيْسَ فِيهِ وَفَاءُ الْكِتَابَةِ وَيَتْرُكُ وَلَدًا مَعَهُ فِي كِتَابَتِهِ وَأُمَّ وَلَدٍ فَأَرَادَتْ أُمُّ وَلَدِهِ أَنْ تَسْعَى عَلَيْهِمْ إِنَّهُ يُدْفَعُ إِلَيْهَا الْمَالُ إِذَا كَانَتْ مَأْمُونَةً عَلَى ذَلِكَ قَوِيَّةً عَلَى السَّعْىِ وَإِنْ لَمْ تَكُنْ قَوِيَّةً عَلَى السَّعْىِ وَلاَ مَأْمُونَةً عَلَى الْمَالِ لَمْ تُعْطَ شَيْئًا مِنْ ذَلِكَ وَرَجَعَتْ هِيَ وَوَلَدُ الْمُكَاتَبِ رَقِيقًا لِسَيِّدِ الْمُكَاتَبِ ‏.‏ قَالَ مَالِكٌ إِذَا كَاتَبَ الْقَوْمُ جَمِيعًا كِتَابَةً وَاحِدَةً وَلاَ رَحِمَ بَيْنَهُمْ فَعَجَزَ بَعْضُهُمْ وَسَعَى بَعْضُهُمْ حَتَّى عَتَقُوا جَمِيعًا فَإِنَّ الَّذِينَ سَعَوْا يَرْجِعُونَ عَلَى الَّذِينَ عَجَزُوا بِحِصَّةِ مَا أَدَّوْا عَنْهُمْ لأَنَّ بَعْضَهُمْ حُمَلاَءُ عَنْ بَعْضٍ ‏.‏","english":{"narrator":"","text":"Malik related to me that he heard that Urwa ibn az-Zubayr and\nSulayman ibn Yasar when asked whether the sons of a man, who had a\nkitaba written for himself and his children and then died, worked for\nthe kitaba of their father or were slaves, said, \"They work for the\nkitaba of their father and they have no reduction at all for the death\nof their father.\"\n\n\nMalik said, \"If they are small and unable\nto work, one does not wait for them to grow up and they are slaves of\ntheir father's master unless the mukatab has left what will pay their\ninstalments for them until they can work. If there is enough to pay\nfor them in what he has left, that is paid for on their behalf and\nthey are left in their condition until they can work, and then if they\npay, they are free. If they cannot do it, they are slaves.\"\n\n\nMalik spoke about a mukatab who died and left property which was not\nenough to pay his kitaba, and he also left a child with him in his\nkitaba and an umm walad, and the umm walad wanted to work for them. He\nsaid, \"The money is paid to her if she is trustworthy with it and\nstrong enough to work. If she is not strong enough to work and not\ntrustworthy with property, she is not given any of it and she and the\nchildren of the mukatab revert to being slaves of the master of the\nmukatab.\"\n\n\nMalik said, \"If people are written together in one\nkitaba and there is no kinship between them, and some of them are\nincapable and others work until they are all set free, those who\nworked can claim from those who were unable, the portion of what they\npaid for them because some of them assumed the responsibility for\nothers.\""}},{"id":9,"idInBook":9,"chapterId":39,"bookId":7,"arabic":"حَدَّثَنِي مَالِكٌ، أَنَّهُ سَمِعَ رَبِيعَةَ بْنَ أَبِي عَبْدِ الرَّحْمَنِ، وَغَيْرَهُ، يَذْكُرُونَ أَنَّ مَكَاتَبًا، كَانَ لِلْفُرَافِصَةِ بْنِ عُمَيْرٍ الْحَنَفِيِّ وَأَنَّهُ عَرَضَ عَلَيْهِ أَنْ يَدْفَعَ إِلَيْهِ جَمِيعَ مَا عَلَيْهِ مِنْ كِتَابَتِهِ فَأَبَى الْفُرَافِصَةُ فَأَتَى الْمُكَاتَبُ مَرْوَانَ بْنَ الْحَكَمِ وَهُوَ أَمِيرُ الْمَدِينَةِ فَذَكَرَ ذَلِكَ لَهُ فَدَعَا مَرْوَانُ الْفُرَافِصَةَ فَقَالَ لَهُ ذَلِكَ فَأَبَى فَأَمَرَ مَرْوَانُ بِذَلِكَ الْمَالِ أَنْ يُقْبَضَ مِنَ الْمُكَاتَبِ فَيُوضَعَ فِي بَيْتِ الْمَالِ وَقَالَ لِلْمُكَاتَبِ اذْهَبْ فَقَدْ عَتَقْتَ ‏.‏ فَلَمَّا رَأَى ذَلِكَ الْفُرَافِصَةُ قَبَضَ الْمَالَ ‏.‏ قَالَ مَالِكٌ فَالأَمْرُ عِنْدَنَا أَنَّ الْمُكَاتَبَ إِذَا أَدَّى جَمِيعَ مَا عَلَيْهِ مِنْ نُجُومِهِ قَبْلَ مَحِلِّهَا جَازَ ذَلِكَ لَهُ وَلَمْ يَكُنْ لِسَيِّدِهِ أَنْ يَأْبَى ذَلِكَ عَلَيْهِ وَذَلِكَ أَنَّهُ يَضَعُ عَنِ الْمُكَاتَبِ بِذَلِكَ كُلَّ شَرْطٍ أَوْ خِدْمَةٍ أَوْ سَفَرٍ لأَنَّهُ لاَ تَتِمُّ عَتَاقَةُ رَجُلٍ وَعَلَيْهِ بَقِيَّةٌ مِنْ رِقٍّ وَلاَ تَتِمُّ حُرْمَتُهُ وَلاَ تَجُوزُ شَهَادَتُهُ وَلاَ يَجِبُ مِيرَاثُهُ وَلاَ أَشْبَاهُ هَذَا مِنْ أَمْرِهِ وَلاَ يَنْبَغِي لِسَيِّدِهِ أَنْ يَشْتَرِطَ عَلَيْهِ خِدْمَةً بَعْدَ عَتَاقَتِهِ ‏.‏ قَالَ مَالِكٌ فِي مُكَاتَبٍ مَرِضَ مَرَضًا شَدِيدًا فَأَرَادَ أَنْ يَدْفَعَ نُجُومَهُ كُلَّهَا إِلَى سَيِّدِهِ لأَنْ يَرِثَهُ وَرَثَةٌ لَهُ أَحْرَارٌ وَلَيْسَ مَعَهُ فِي كِتَابَتِهِ وَلَدٌ لَهُ ‏.‏ قَالَ مَالِكٌ ذَلِكَ جَائِزٌ لَهُ لأَنَّهُ تَتِمُّ بِذَلِكَ حُرْمَتُهُ وَتَجُوزُ شَهَادَتُهُ وَيَجُوزُ اعْتِرَافُهُ بِمَا عَلَيْهِ مِنْ دُيُونِ النَّاسِ وَتَجُوزُ وَصِيَّتُهُ وَلَيْسَ لِسَيِّدِهِ أَنْ يَأْبَى ذَلِكَ عَلَيْهِ بِأَنْ يَقُولَ فَرَّ مِنِّي بِمَالِهِ ‏.‏","english":{"narrator":"","text":"Malik related to me that he heard Rabia ibn Abi Abd ar-Rahman and\nothers mention that al-Furafisa ibn Umar al-Hanafi had a mukatab who\noffered to pay him all of his kitaba that he owed. Al-Furafisa refused\nto accept it and the mukatab went to Marwan ibn al-Hakam who was the\namir of Madina and brought up the matter. Marwan summoned al-Furafisa\nand told him to accept. He refused. Marwan then ordered that the\npayment be taken from the mukatab and placed in the treasury. He said\nto the mukatab \"Go, you are free.\" When al-Furafisa saw that, he took\nthe money.\n\n\nMalik said, \"What is done among us when a mukatab\npays all the instalments he owes before their term, is that it is\npermitted to him. The master cannot refuse him that. That is because\npayment removes every condition from the mukatab as well as service\nand travel. The setting free of a man is not complete while he has any\nremaining slavery, and neither would his inviolability as a free man\nbe complete and his testimony permitted and inheritance obliged and\nsuch things in that situation. His master must not make any\nstipulation of service on him after he has been set free.\"\n\n\nMalik said that it was permitted for a mukatab who became extremely\nill and wanted to pay his master all his instalments because his heirs\nwho were free would then inherit from him and he had no children with\nhim in his kitaba, to do so, because by that he completed his\ninviolability as a free man, his testimony was permitted, and his\nadmission of what he owed of debts to people was permitted. His\nbequest was permitted as well. His master could not refuse him that by\nsaying, \"He is escaping from me with his property.\""}},{"id":10,"idInBook":10,"chapterId":39,"bookId":7,"arabic":"حَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ سَعِيدَ بْنَ الْمُسَيَّبِ، سُئِلَ عَنْ مُكَاتَبٍ، كَانَ بَيْنَ رَجُلَيْنِ فَأَعْتَقَ أَحَدُهُمَا نَصِيبَهُ فَمَاتَ الْمُكَاتَبُ وَتَرَكَ مَالاً كَثِيرًا فَقَالَ يُؤَدَّى إِلَى الَّذِي تَمَاسَكَ بِكِتَابَتِهِ الَّذِي بَقِيَ لَهُ ثُمَّ يَقْتَسِمَانِ مَا بَقِيَ بِالسَّوِيَّةِ ‏.‏ قَالَ مَالِكٌ إِذَا كَاتَبَ الْمُكَاتَبُ فَعَتَقَ فَإِنَّمَا يَرِثُهُ أَوْلَى النَّاسِ بِمَنْ كَاتَبَهُ مِنَ الرِّجَالِ يَوْمَ تُوُفِّيَ الْمُكَاتَبُ مِنْ وَلَدٍ أَوْ عَصَبَةٍ ‏.‏ قَالَ وَهَذَا أَيْضًا فِي كُلِّ مَنْ أُعْتِقَ فَإِنَّمَا مِيرَاثُهُ لأَقْرَبِ النَّاسِ مِمَّنْ أَعْتَقَهُ مِنْ وَلَدٍ أَوْ عَصَبَةٍ مِنَ الرِّجَالِ يَوْمَ يَمُوتُ الْمُعْتَقُ بَعْدَ أَنْ يَعْتِقَ وَيَصِيرَ مَوْرُوثًا بِالْوَلاَءِ ‏.‏ قَالَ مَالِكٌ الإِخْوَةُ فِي الْكِتَابَةِ بِمَنْزِلَةِ الْوَلَدِ إِذَا كُوتِبُوا جَمِيعًا كِتَابَةً وَاحِدَةً إِذَا لَمْ يَكُنْ لأَحَدٍ مِنْهُمْ وَلَدٌ كَاتَبَ عَلَيْهِمْ أَوْ وُلِدُوا فِي كِتَابَتِهِ أَوْ كَاتَبَ عَلَيْهِمْ ثُمَّ هَلَكَ أَحَدُهُمْ وَتَرَكَ مَالاً أُدِّيَ عَنْهُمْ جَمِيعُ مَا عَلَيْهِمْ مِنْ كِتَابَتِهِمْ وَعَتَقُوا وَكَانَ فَضْلُ الْمَالِ بَعْدَ ذَلِكَ لِوَلَدِهِ دُونَ إِخْوَتِهِ ‏.‏","english":{"narrator":"","text":"Malik related to me that he had heard that Said ibn al-Musayyab\nwas asked about a mukatab who was shared between two men. One of them\nfreed his portion and then the mukatab died and left a lot of money.\nSaid replied, \"The one who kept his kitaba is paid what remains due to\nhim, and then they divide what is left between them both equally.\"\n\n\nMalik said, \"When a mukatab who fulfils his kitaba and\nbecomes free dies, he is inherited from by the people who wrote his\nkitaba and their children and paternal relations - whoever is most\ndeserving.\"\n\n\nHe said, \"This is also for whoever is set free\nwhen he dies after being set free - his inheritance is for the nearest\npeople to him of children or paternal relations who inherit by means\nof the wala'.\"\n\n\nMalik said, \"Brothers, written together in the\nsame kitaba, are in the same position as children to each other when\nnone of them have children written in the kitaba or born in the\nkitaba. When one of them dies and leaves property, he pays for them\nall that is against them of their kitaba and sets them free. The money\nleft over after that goes to his children rather than his brothers.\""}},{"id":11,"idInBook":11,"chapterId":39,"bookId":7,"arabic":"","english":{"narrator":"","text":"Malik spoke to me about a man who wrote a kitaba for his slave\nfor gold or silver and stipulated against him in his kitaba a journey,\nservice, sacrifice or similar, which he specified by its name, and\nthen the mukatab was able to pay all his instalments before the end of\nthe term.\n\n\nHe said, \"If he pays all his instalments and he is\nset free and his inviolability as a free man is complete, but he still\nhas this condition to fulfil, the condition is examined, and whatever\ninvolves his person in it, like service or a journey etc., is removed\nfrom him and his master has nothing in it. Whatever there is of\nsacrifice, clothing, or anything that he must pay, that is in the\nposition of dinars and dirhams, and is valued and he pays it along\nwith his instalments, and he is not free until he has paid that along\nwith his instalments.\"\n\n\nMalik said, \"The generally agreed-on\nway of doing things among us about which there is no dispute, is that\na mukatab is in the same position as a slave whom his master will free\nafter a service of ten years. If the master who will free him dies\nbefore ten years, what remains of his service goes to his heirs and\nhis wala' goes to the one who contracted to free him and to his male\nchildren or paternal relations.\"\n\n\nMalik spoke about a man who\nstipulated against his mukatab that he could not travel, marry, or\nleave his land without his permission, and that if he did so without\nhis permission it was in his power to cancel the kitaba. He said, \"If\nthe mukatab does any of these things it is not in the man's power to\ncancel the kitaba. Let the master put that before the Sultan. The\nmukatab, however, should not marry, travel, or leave the land of his\nmaster without his permission, whether or not he stipulates that. That\nis because the man may write a kitaba for his slave for 100 dinars and\nthe slave may have 1000 dinars or more than that. He goes off and\nmarries a woman and pays her bride-price which sweeps away his money\nand then he cannot pay. He reverts to his master as a slave who has no\nproperty. Or else he may travel and his instalments fall due while he\nis away. He cannot do that and kitaba is not to be based on that. That\nis in the hand of his master. If he wishes, he gives him permission in\nthat. If he wishes, he refuses it.\""}},{"id":12,"idInBook":12,"chapterId":39,"bookId":7,"arabic":"","english":{"narrator":"","text":"Malik said, \"When a mukatab sets his own slaves free, it is only\npermitted for a mukatab to set his own slaves free with the consent of\nhis master. If his master gives his consent and the mukatab sets his\nslave free, his wala' goes to the mukatab . If the mukatab then dies\nbefore he has been set free himself, the wala' of the freed slave goes\nto the master of the mukatab. If the freed one dies before the mukatab\nhas been set free, the master of the mukatab inherits from him.\"\n\n\nMalik said, \"It is like that also when a mukatab gives his slave a\nkitaba and his mukatab is set free before he is himself. The wala'\ngoes to the master of the mukatab as long as he is not free. If this\none who wrote the kitaba is set free, then the wala' of his mukatab\nwho was freed before him reverts to him. If the first mukatab dies\nbefore he pays, or he cannot pay his kitaba and he has free children,\nthey do not inherit the wala' of their father's mukatab because the\nwala' has not been established for their father and he does not have\nthe wala' until he is free.\"\n\n\nMalik spoke about a mukatab who\nwas shared between two men and one of them forewent what the mukatab\nowed him and the other insisted on his due. Then the mukatab died and\nleft property.\n\n\nMalik said, \"The one who did not abandon any\nof what he was owed, is paid in full. Then the property is divided\nbetween them both just as if a slave had died because what the first\none did was not setting him free. He only abandoned a debt that was\nowed to him .\"\n\n\nMalik said, \"One clarification of that is that\nwhen a man dies and leaves a mukatab and he also leaves male and\nfemale children and one of the children frees his portion of the\nmukatab, that does not establish any of the wala' for him. Had it been\na true setting free, the wala' would have been established for\nwhichever men and women freed him.\"\n\n\nMalik said, \"Another\nclarification of that is that if one of them freed his portion and\nthen the mukatab could not pay, the value of what was left of the\nmukatab would be altered because of the one who freed his portion. Had\nit been a true setting-free, his estimated value would have been taken\nfrom the property of the one who set free until he had been set\ncompletely free as the Messenger of Allah, may Allah bless him and\ngrant him peace, said, 'Whoever frees his share in a slave and has\nmoney to cover the full price of the slave, justly evaluated for him,\ngives his partners their shares. If not, he frees of him what he\nfrees.' \" (See Book 37 hadith 1).\n\n\nHe said, \"Another\nclarification of that is that part of the sunna of the muslims in\nwhich there is no dispute, is that whoever frees his share of a\nmukatab, the mukatab is not set fully free using his property. Had he\nbeen truly set free, the wala' would have been his alone rather than\nhis partners. Part of what will clarify that also is that part of the\nsunna of the muslims is that the wala' belongs to whoever writes the\ncontract of kitaba. The women who inherit from the master of the\nmukatab do not have any of the wala' of the mukatab. If they free any\nof their share, the wala' belongs to the male children of the master\nof the mukatab or his male paternal relations.\""}},{"id":13,"idInBook":13,"chapterId":39,"bookId":7,"arabic":"","english":{"narrator":"","text":"Malik said, \"If people are together in one kitaba, their master\ncannot free one of them without consulting his companions who are with\nhim in the kitaba and obtaining their consent. If they are young,\nhowever, their consultation means nothing and it is not permitted to\nthem. That is because a man might work for all the people and he might\npay their kitaba for them to complete their freedom. Their master\napproaches the one who will pay for them and their rescue from slavery\nis through him. He frees him and so makes those who remain unable to\npay. He does it intending benefit and increase for himself. It is not\npermitted for him to do that to those of them who remain. The\nMessenger of Allah, may Allah bless him and grant him peace, said,\n'There must be no harm nor return of harm.' This is the most severe\nharm.\"\n\n\nMalik said about slaves who wrote a kitaba together\nthat it was permitted for their master to free the old and exhausted\nof them and the young when neither of them could pay anything, and\nthere was no help nor strength to be had from any of them in their\nkitaba."}},{"id":14,"idInBook":14,"chapterId":39,"bookId":7,"arabic":"","english":{"narrator":"","text":"Malik said about a man who had his slave in a kitaba and then the\nmukatab died and left his umm walad, and there remained for him some\nof his kitaba to pay and he left what would pay it, \"The umm walad is\na slave since the mukatab was not freed until he died and he did not\nleave children that were set free by his paying what remained, so that\nthe umm walad of their father was freed by their being set free.\"\n\n\nMalik said about a mukatab who set free a slave of his or gave\nsadaqa with some of his property and his master did not know that\nuntil he had set the mukatab free, \"That has been performed by him and\nthe master does not rescind it. If the master of the mukatab knows\nbefore he sets the mukatab free, he can reject that and not permit it.\nIf the mukatab is then freed and it becomes in his power to do so, he\ndoes not have to free the slave, nor give the sadaqa unless he does it\nvoluntarily from himself.\""}},{"id":15,"idInBook":15,"chapterId":39,"bookId":7,"arabic":"","english":{"narrator":"","text":"Malik said, The best of what I have heard about a mukatab whose\nmaster frees him at death, is that the mukatab is valued according to\nwhat he would fetch if he were sold. If that value is less than what\nremains against him of his kitaba, his freedom is taken from the third\nthat the deceased can bequeath. One does not look at the number of\ndirhams which remain against him in his kitaba. That is because had he\nbeen killed, his killer would not be in debt for other than his value\non the day he killed him. Had he been injured, the one who injured him\nwould not be liable for other than the blood-money of the injury on\nthe day of his injury. One does not look at how much he has paid of\ndinars and dirhams of the contract he has written because he is a\nslave as long as any of his kitaba remains. If what remains in his\nkitaba is less than his value, only whatever of his kitaba remains\nowing from him is taken into account in the third of the property of\nthe deceased. That is because the deceased left him what remains of\nhis kitaba and so it becomes a bequest which the deceased made.\"\n\n\nMalik said, \"The illustration of that is that if the price of the\nmukatab is one thousand dirhams, and only one hundred dirhams remain\nof his kitaba, his master leaves him the one hundred dirhams which\ncomplete it for him. It is taken into account in the third of his\nmaster and by it he becomes free.\"\n\n\nMalik said that if a man\nwrote his slave a kitaba at his death, the value of the slave was\nestimated. If there was enough to cover the price of the slave in one\nthird of his property, that was permitted for him.\n\n\nMalik\nsaid, \"The illustration of that is that the price of the slave is one\nthousand dinars. His master writes him a kitaba for two hundred dinars\nat his death. The third of the property of his master is one thousand\ndinars, so that is permitted for him. It is only a bequest which he\nmakes from one third of his property. If the master has left bequests\nto people, and there is no surplus in the third after the value of the\nmukatab, one begins with the mukatab because the kitaba is setting\nfree, and setting free has priority over bequests. When those bequests\nare paid from the kitaba of the mukatab, they follow it. The heirs of\nthe testator have a choice. If they want to give the people with\nbequests all their bequests and the kitaba of the mukatab is theirs,\nthey have that. If they refuse and hand over the mukatab and what he\nowes to the people with bequests they can do that, because the third\ncommences with the mukatab and because all the bequests which he makes\nare as one.\"\n\n\nIf the heirs then say, \"What our fellow\nbequeathed was more than one third of his property and he has taken\nwhat was not his,\" Malik said, \"His heirs choose. It is said to them,\n'Your companion has made the bequests you know about and if you would\nlike to give them to those who are to receive them according to the\ndeceased's bequests, then do so. If not, hand over to the people with\nbequests one third of the total property of the deceased.' \"\n\n\nMalik continued, \"If the heirs surrender the mukatab to the people\nwith bequests, the people with bequests have what he owes of his\nkitaba. If the mukatab pays what he owes of his kitaba, they take that\nin their bequests according to their shares. If the mukatab cannot\npay, he is a slave of the people with bequests and does not return to\nthe heirs because they gave him up when they made their choice, and\nbecause when he was surrendered to the people with bequests, they were\nliable. If he died, they would not have anything against the heirs. If\nthe mukatab dies before he pays his kitaba and he leaves property\nwhich is more than what he owes, his property goes to the people with\nbequests. If the mukatab pays what he owes, he is free and his wala'\nreturns to the paternal relations of the one who wrote the kitaba for\nhim.\"\n\n\nMalik spoke about a mukatab who owed his master ten\nthousand dirhams in his kitaba, and when he died he remitted one\nthousand dirhams from it. He said, \"The mukatab is valued and his\nvalue is taken into consideration. If his value is one thousand\ndirhams and the reduction is a tenth of the kitaba, that portion of\nthe slave's price is one hundred dirhams. It is a tenth of the price.\nA tenth of the kitaba is therefore reduced for him. That is converted\nto a tenth of the price in cash. That is as if he had had all of what\nhe owed reduced for him. Had he done that, only the value of the slave\n- one thousand dirhams - would have been taken into account in the\nthird of the property of the deceased. If that which he had remitted\nis half of the kitaba, half the price is taken into account in the\nthird of the property of the deceased. If it is more or less than\nthat, it is according to this reckoning.\"\n\n\nMalik said, \"When a\nman reduces the kitaba of his mukatab by one thousand dirhams at his\ndeath from a kitaba of ten thousand dirhams, and he does not stipulate\nwhether it is from the beginning or the end of his kitaba, each\ninstalment is reduced for him by one tenth.\"\n\n\nMalik said, \"If\na man remits one thousand dirhams from his mukatab at his death from\nthe beginning or end of his kitaba, and the original basis of the\nkitaba is three thousand dirhams, the mukatab's cash value is\nestimated. Then that value is divided. That thousand which is from the\nbeginning of the kitaba is converted into its portion of the price\naccording to its proximity to the term and its precedence and then the\nthousand which follows the first thousand is according to its\nprecedence also until it comes to its end, and every thousand is paid\naccording to its place in advancing and deferring the term because\nwhat is deferred of that is less in respect of its price. Then it is\nplaced in the third of the deceased according to whatever of the price\nbefalls that thousand according to the difference in preference of\nthat, whether it is more or less, then it is according to this\nreckoning.\"\n\n\nMalik spoke about a man who willed a man a fourth\nof a mukatab or freed a fourth, and then the man died and the mukatab\ndied and left a lot of property, more than he owed. He said, \"The\nheirs of the first master and the one who was willed a fourth of the\nmukatab are given what they are still owed by the mukatab. Then they\ndivide what is left over, and the one willed a fourth has a third of\nwhat is left after the kitaba is paid. The heirs of his master gets\ntwo-thirds. That is because the mukatab is a slave as long as any of\nhis kitaba remains to be paid. He is inherited from by the possession\nof his person.\"\n\n\nMalik said about a mukatab whose master freed\nhim at death, \"If the third of the deceased will not cover him, he is\nfreed from it according to what the third will cover and his kitaba is\ndecreased according to that. If the mukatab owed five thousand dirhams\nand his value is two thousand dirhams cash, and the third of the\ndeceased is one thousand dirhams, half of him is freed and half of the\nkitaba has been reduced for him.\" Malik said about a man who said in\nhis will, \"My slave so-and-so is free and write a kitaba for so-and-\nso\", that the setting free had priority over the kitaba."}}],"chapter":{"id":39,"bookId":7,"arabic":"كتاب المكاتب","english":"The Mukatab"}}