{"metadata":{"length":20,"arabic":{"title":"موطأ مالك","author":"الإمام مالك بن أنس","introduction":"كتاب الأشربة"},"english":{"title":"Muwatta Malik","author":"Imam Malik ibn Anas","introduction":"Drinks"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":42,"bookId":7,"arabic":"باب الْحَدِّ فِي الْخَمْرِ","english":{"narrator":"","text":""}},{"id":2,"idInBook":2,"chapterId":42,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنِ السَّائِبِ بْنِ يَزِيدَ، أَنَّهُ أَخْبَرَهُ أَنَّ عُمَرَ بْنَ الْخَطَّابِ خَرَجَ عَلَيْهِمْ فَقَالَ إِنِّي وَجَدْتُ مِنْ فُلاَنٍ رِيحَ شَرَابٍ فَزَعَمَ أَنَّهُ شَرَابُ الطِّلاَءِ وَأَنَا سَائِلٌ عَمَّا شَرِبَ فَإِنْ كَانَ يُسْكِرُ جَلَدْتُهُ ‏.‏ فَجَلَدَهُ عُمَرُ الْحَدَّ تَامًّا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab that as-Sa'ib ibn\nYazid informed him that Umar ibn al-Khattab came out to them. He said,\n\"I have found the smell of wine on so-and-so, and he claimed that it\nwas the drink of boiled fruit juice, and I am inquiring about what he\nhas drunk. If it intoxicates, I will flog him.\" Umar then flogged him\nwith the complete hadd."}},{"id":3,"idInBook":3,"chapterId":42,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ ثَوْرِ بْنِ زَيْدٍ الدِّيلِيِّ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، اسْتَشَارَ فِي الْخَمْرِ يَشْرَبُهَا الرَّجُلُ فَقَالَ لَهُ عَلِيُّ بْنُ أَبِي طَالِبٍ نَرَى أَنْ تَجْلِدَهُ ثَمَانِينَ فَإِنَّهُ إِذَا شَرِبَ سَكِرَ وَإِذَا سَكِرَ هَذَى وَإِذَا هَذَى افْتَرَى ‏.‏ أَوْ كَمَا قَالَ فَجَلَدَ عُمَرُ فِي الْخَمْرِ ثَمَانِينَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Thawr ibn Zayd ad-Dili that\nUmar ibn al-Khattab asked advice about a man drinking wine. Ali ibn\nAbi Talib said to him, \"We think that you flog him for it with eighty\nlashes. Because when he drinks, he becomes intoxicated, and when he\nbecomes intoxicated, he talks confusedly, and when he talks\nconfusedly, he lies.\" (80 lashes is the same amount as for slandering)\nUmar gave eighty lashes for drinking wine."}},{"id":4,"idInBook":4,"chapterId":42,"bookId":7,"arabic":"وَحَدَّثَنِي عَنِ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، أَنَّهُ سُئِلَ عَنْ حَدِّ الْعَبْدِ، فِي الْخَمْرِ فَقَالَ بَلَغَنِي أَنَّ عَلَيْهِ نِصْفَ حَدِّ الْحُرِّ فِي الْخَمْرِ وَأَنَّ عُمَرَ بْنَ الْخَطَّابِ وَعُثْمَانَ بْنَ عَفَّانَ وَعَبْدَ اللَّهِ بْنَ عُمَرَ قَدْ جَلَدُوا عَبِيدَهُمْ نِصْفَ حَدِّ الْحُرِّ فِي الْخَمْرِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab that he was asked\nabout the hadd of the slave for wine. He said, \"I heard that he has\nhalf the hadd of a freeman for drinking wine. Umar ibn al-Khattab,\nUthman ibn Affan, and Abdullah ibn Umar flogged their slaves with half\nof the hadd of a freeman when they drank wine.\""}},{"id":5,"idInBook":5,"chapterId":42,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ سَمِعَ سَعِيدَ بْنَ الْمُسَيَّبِ، يَقُولُ مَا مِنْ شَىْءٍ إِلاَّ اللَّهُ يُحِبُّ أَنْ يُعْفَى عَنْهُ مَا لَمْ يَكُنْ حَدًّا ‏.‏ قَالَ يَحْيَى قَالَ مَالِكٌ وَالسُّنَّةُ عِنْدَنَا أَنَّ كُلَّ مَنْ شَرِبَ شَرَابًا مُسْكِرًا فَسَكِرَ أَوْ لَمْ يَسْكَرْ فَقَدْ وَجَبَ عَلَيْهِ الْحَدُّ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said that he heard\nSaid ibn al-Musayyab say, \"There is nothing that Allah does not like\nto be pardoned as long as it is not a hadd.\"\n\n\nYahya said that\nMalik said, \"The sunna with us is that the hadd is obliged against\nanyone who drinks something intoxicating whether or not he becomes\ndrunk.\""}},{"id":6,"idInBook":6,"chapterId":42,"bookId":7,"arabic":"باب مَا يُنْهَى أَنْ يُنْبَذَ فِيهِ","english":{"narrator":"","text":""}},{"id":7,"idInBook":7,"chapterId":42,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَطَبَ النَّاسَ فِي بَعْضِ مَغَازِيهِ - قَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ - فَأَقْبَلْتُ نَحْوَهُ فَانْصَرَفَ قَبْلَ أَنْ أَبْلُغَهُ فَسَأَلْتُ مَاذَا قَالَ فَقِيلَ لِي نَهَى أَنْ يُنْبَذَ فِي الدُّبَّاءِ وَالْمُزَفَّتِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat the Messenger of Allah, may Allah bless him and grant him peace,\naddressed the people in one of his raids. Abdullah ibn Umar said, \"I\nwent towards him, but he finished before I reached him. I asked about\nwhat he had said. Someone said to me, 'He forbade preparing nabidh in\na gourd or in a jug smeared with pitch.'\""}},{"id":8,"idInBook":8,"chapterId":42,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ الْعَلاَءِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ يَعْقُوبَ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى أَنْ يُنْبَذَ فِي الدُّبَّاءِ وَالْمُزَفَّتِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from al-Ala ibn Abd ar-Rahman ibn\nYaqub from his father from Abu Hurayra that the Messenger of Allah,\nmay Allah bless him and grant him peace, forbade preparing nabidh in a\ngourd or in a jug smeared with pitch."}},{"id":9,"idInBook":9,"chapterId":42,"bookId":7,"arabic":"باب مَا يُكْرَهُ أَنْ يُنْبَذَ جَمِيعًا","english":{"narrator":"","text":""}},{"id":10,"idInBook":10,"chapterId":42,"bookId":7,"arabic":"وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، ‏.‏ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى أَنْ يُنْبَذَ الْبُسْرُ وَالرُّطَبُ جَمِيعًا وَالتَّمْرُ وَالزَّبِيبُ جَمِيعًا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Zayd ibn Aslam from Ata ibn\nYasar that the Messenger of Allah, may Allah bless him and grant him\npeace, forbade preparing nabidh from nearly ripe dates and fresh dates\ntogether, and from dates and raisins together."}},{"id":11,"idInBook":11,"chapterId":42,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ الثِّقَةِ، عِنْدَهُ عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ بْنِ الأَشَجِّ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحُبَابِ الأَنْصَارِيِّ، عَنْ أَبِي قَتَادَةَ الأَنْصَارِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى أَنْ يُشْرَبَ التَّمْرُ وَالزَّبِيبُ جَمِيعًا وَالزَّهْوُ وَالرُّطَبُ جَمِيعًا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from a reliable source from Bukayr\nibn Abdullah ibn al-Ashajj from Abd ar-Rahman ibn al-Hubab al-Ansari\nfrom Abu Qatada al-Ansari that the Messenger of Allah, may Allah bless\nhim and grant him peace, forbade making nabidh from dates and raisins\ntogether, and nearly ripe dates and fresh dates together.\n\n\nMalik said, \"That is the way of doing things among us in which the\npeople of knowledge in our city continue. It is disapproved of because\nthe Messenger of Allah, may Allah bless him and grant him peace,\nforbade it.\""}},{"id":12,"idInBook":12,"chapterId":42,"bookId":7,"arabic":"باب تَحْرِيمِ الْخَمْرِ","english":{"narrator":"","text":""}},{"id":13,"idInBook":13,"chapterId":42,"bookId":7,"arabic":"وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ سُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْبِتْعِ فَقَالَ ‏\n\"‏ كُلُّ شَرَابٍ أَسْكَرَ فَهُوَ حَرَامٌ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from ibn Shihab from Abu Salama\nibn Abd ar-Rahman that A'isha, the wife of the Prophet, may Allah\nbless him and grant him peace, said, \"The Messenger of Allah, may\nAllah bless him and grant him peace, was asked about mead, and he\nreplied, 'Every drink which intoxicates is haram.' \""}},{"id":14,"idInBook":14,"chapterId":42,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم سُئِلَ عَنِ الْغُبَيْرَاءِ فَقَالَ ‏\n\"‏ لاَ خَيْرَ فِيهَا ‏\"‏ ‏.‏ وَنَهَى عَنْهَا ‏.‏ قَالَ مَالِكٌ فَسَأَلْتُ زَيْدَ بْنَ أَسْلَمَ مَا الْغُبَيْرَاءُ فَقَالَ هِيَ الأُسْكَرْكَةُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Zayd ibn Aslam from Ata ibn\nYasar that the Messenger of Allah, may Allah bless him and grant him\npeace, was asked about al-Ghubayra. He said, \"There is no good in it,\"\nand forbade it. Malik said, \"I asked Zayd ibn Aslam, 'What is al-\nGhubayra?' He said, 'It is an intoxicant.' \""}},{"id":15,"idInBook":15,"chapterId":42,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ شَرِبَ الْخَمْرَ فِي الدُّنْيَا ثُمَّ لَمْ يَتُبْ مِنْهَا حُرِمَهَا فِي الآخِرَةِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat the Messenger of Allah, may Allah bless him and grant him peace,\nsaid \"Whoever drinks wine in this world and does not turn from it in\ntawba, it is haram for him in the Next World.\""}},{"id":16,"idInBook":16,"chapterId":42,"bookId":7,"arabic":"باب جَامِعِ تَحْرِيمِ الْخَمْرِ","english":{"narrator":"","text":""}},{"id":17,"idInBook":17,"chapterId":42,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنِ ابْنِ وَعْلَةَ الْمِصْرِيِّ، ‏.‏ أَنَّهُ سَأَلَ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ عَمَّا يُعْصَرُ مِنَ الْعِنَبِ فَقَالَ ابْنُ عَبَّاسٍ أَهْدَى رَجُلٌ لِرَسُولِ اللَّهِ صلى الله عليه وسلم رَاوِيَةَ خَمْرٍ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَمَا عَلِمْتَ أَنَّ اللَّهَ حَرَّمَهَا ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ فَسَارَّهُ رَجُلٌ إِلَى جَنْبِهِ ‏.‏ فَقَالَ لَهُ صلى الله عليه وسلم ‏\"‏ بِمَ سَارَرْتَهُ ‏\"‏ ‏.‏ فَقَالَ أَمَرْتُهُ أَنْ يَبِيعَهَا ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ الَّذِي حَرَّمَ شُرْبَهَا حَرَّمَ بَيْعَهَا ‏\"‏ ‏.‏ فَفَتَحَ الرَّجُلُ الْمَزَادَتَيْنِ حَتَّى ذَهَبَ مَا فِيهِمَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Zayd ibn Aslam that Ibn Wala\nal-Misri asked Abdullah ibn Abbas about what is squeezed from the\ngrapes. Ibn Abbas replied, \"A man gave the Messenger of Allah, may\nAllah bless him and grant him peace, a small water-skin of wine. The\nMessenger of Allah, may Allah bless him and grant him peace, said to\nhim, 'Don't you know that Allah has made it haram?' He said, 'No.'\nThen a man at his side whispered to him. The Messenger of Allah, may\nAllah bless him and grant him peace, asked what he had whispered, and\nthe man replied, 'I told him to sell it.' The Messenger of Allah, may\nAllah bless him and grant him peace, said, 'The One who made drinking\nit haram has made selling it haram.' The man then opened the water-\nskins and poured out what was in them .\""}},{"id":18,"idInBook":18,"chapterId":42,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّهُ قَالَ كُنْتُ أَسْقِي أَبَا عُبَيْدَةَ بْنَ الْجَرَّاحِ وَأَبَا طَلْحَةَ الأَنْصَارِيَّ وَأُبَىَّ بْنَ كَعْبٍ شَرَابًا مِنْ فَضِيخٍ وَتَمْرٍ - قَالَ - فَجَاءَهُمْ آتٍ فَقَالَ إِنَّ الْخَمْرَ قَدْ حُرِّمَتْ ‏.‏ فَقَالَ أَبُو طَلْحَةَ يَا أَنَسُ قُمْ إِلَى هَذِهِ الْجِرَارِ فَاكْسِرْهَا ‏.‏ قَالَ فَقُمْتُ إِلَى مِهْرَاسٍ لَنَا فَضَرَبْتُهَا بِأَسْفَلِهِ حَتَّى تَكَسَّرَتْ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ishaq ibn Abdullah ibn Abi\nTalha that Anas ibn Malik said, \"I was serving wine to Abu Ubayda ibn\nal-Jarrah and Abu Talha al-Ansari and Umayy ibn Kab. The wine had been\nprepared from crushed ripe dates and dried dates. Someone came to them\nand said, 'Wine has been made haram.' Abu Talha ordered me to go and\ntake the jugs and break them. I stood up and went to a mortar of ours\nand I struck them with the bottom of it until they broke.\""}},{"id":19,"idInBook":19,"chapterId":42,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ دَاوُدَ بْنِ الْحُصَيْنِ، عَنْ وَاقِدِ بْنِ عَمْرِو بْنِ سَعْدِ بْنِ مُعَاذٍ، أَنَّهُ أَخْبَرَهُ عَنْ مَحْمُودِ بْنِ لَبِيدٍ الأَنْصَارِيِّ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، حِينَ قَدِمَ الشَّامَ شَكَا إِلَيْهِ أَهْلُ الشَّامِ وَبَاءَ الأَرْضِ وَثِقَلَهَا وَقَالُوا لاَ يُصْلِحُنَا إِلاَّ هَذَا الشَّرَابُ ‏.‏ فَقَالَ عُمَرُ اشْرَبُوا هَذَا الْعَسَلَ ‏.‏ قَالُوا لاَ يُصْلِحُنَا الْعَسَلُ ‏.‏ فَقَالَ رَجُلٌ مِنْ أَهْلِ الأَرْضِ هَلْ لَكَ أَنْ نَجْعَلَ لَكَ مِنْ هَذَا الشَّرَابِ شَيْئًا لاَ يُسْكِرُ قَالَ نَعَمْ ‏.‏ فَطَبَخُوهُ حَتَّى ذَهَبَ مِنْهُ الثُّلُثَانِ وَبَقِيَ الثُّلُثُ فَأَتَوْا بِهِ عُمَرَ فَأَدْخَلَ فِيهِ عُمَرُ إِصْبَعَهُ ثُمَّ رَفَعَ يَدَهُ فَتَبِعَهَا يَتَمَطَّطُ فَقَالَ هَذَا الطِّلاَءُ هَذَا مِثْلُ طِلاَءِ الإِبِلِ ‏.‏ فَأَمَرَهُمْ عُمَرُ أَنْ يَشْرَبُوهُ فَقَالَ لَهُ عُبَادَةُ بْنُ الصَّامِتِ أَحْلَلْتَهَا وَاللَّهِ ‏.‏ فَقَالَ عُمَرُ كَلاَّ وَاللَّهِ اللَّهُمَّ إِنِّي لاَ أُحِلُّ لَهُمْ شَيْئًا حَرَّمْتَهُ عَلَيْهِمْ وَلاَ أُحَرِّمُ عَلَيْهِمْ شَيْئًا أَحْلَلْتَهُ لَهُمْ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Da'ud ibn al-Husayn that\nWaqid ibn Amr ibn Sad ibn Muadh informed him from Mahmud ibn Labid al-\nAnsari that when Umar ibn al-Khattab went to ash-Sham, the people of\nash-Sham complained to him about the bad air of their land and its\nheaviness. They said, \"Only this drink helps.\" Umar said, \"Drink this\nhoney preparation.\" They said, \"Honey does not help us.\" A man from\nthe people of that land said, \"Can we give you something of this drink\nwhich does not intoxicate?\" He said, \"Yes.\" They cooked it until two-\nthirds of it evaporated and one-third of it remained. Then they\nbrought it to Umar. Umar put his finger in it and then lifted his head\nand extended it. He said, \"This is fruit juice concentrated by\nboiling. This is like the distillation with which you smear the\ncamel's scabs.\" Umar ordered them to drink it. Ubada ibn as-Samit said\nto him, \"You have made it halal, by Allah!\" Umar said, \"No, by Allah!\nO Allah! I will not make anything halal for them which You have made\nharam for them! I will not make anything haram for them which You have\nmade halal for them.\""}},{"id":20,"idInBook":20,"chapterId":42,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رِجَالاً، مِنْ أَهْلِ الْعِرَاقِ قَالُوا لَهُ يَا أَبَا عَبْدِ الرَّحْمَنِ إِنَّا نَبْتَاعُ مِنْ ثَمَرِ النَّخْلِ وَالْعِنَبِ فَنَعْصِرُهُ خَمْرًا فَنَبِيعُهَا ‏.‏ فَقَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ إِنِّي أُشْهِدُ اللَّهَ عَلَيْكُمْ وَمَلاَئِكَتَهُ وَمَنْ سَمِعَ مِنَ الْجِنِّ وَالإِنْسِ أَنِّي لاَ آمُرُكُمْ أَنْ تَبِيعُوهَا وَلاَ تَبْتَاعُوهَا وَلاَ تَعْصِرُوهَا وَلاَ تَشْرَبُوهَا وَلاَ تَسْقُوهَا فَإِنَّهَا رِجْسٌ مِنْ عَمَلِ الشَّيْطَانِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat some men from Iraq said to him, \"Abu Abd ar-Rahman, we buy the\nfruit of the palm and grapes and we squeeze them into wine and we sell\nit.\" Abdullah ibn Umar said, \"I call on Allah and His angels and\nwhoever hears of jinn and men to testify to you that I order you not\nto buy it nor sell it nor to press it nor to drink it nor to give it\nto people to drink. It is something impure from the work of Shaytan.\""}}],"chapter":{"id":42,"bookId":7,"arabic":"كتاب الأشربة","english":"Drinks"}}