{"metadata":{"length":45,"arabic":{"title":"موطأ مالك","author":"الإمام مالك بن أنس","introduction":"كتاب العقول"},"english":{"title":"Muwatta Malik","author":"Imam Malik ibn Anas","introduction":"Blood-Money"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":43,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، عَنْ أَبِيهِ، أَنَّ فِي الْكِتَابِ الَّذِي، كَتَبَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم لِعَمْرِو بْنِ حَزْمٍ فِي الْعُقُولِ أَنَّ فِي النَّفْسِ مِائَةً مِنَ الإِبِلِ وَفِي الأَنْفِ إِذَا أُوعِيَ جَدْعًا مِائَةٌ مِنَ الإِبِلِ وَفِي الْمَأْمُومَةِ ثُلُثُ الدِّيَةِ وَفِي الْجَائِفَةِ مِثْلُهَا وَفِي الْعَيْنِ خَمْسُونَ وَفِي الْيَدِ خَمْسُونَ وَفِي الرِّجْلِ خَمْسُونَ وَفِي كُلِّ أُصْبُعٍ مِمَّا هُنَالِكَ عَشْرٌ مِنَ الإِبِلِ وَفِي السِّنِّ خَمْسٌ وَفِي الْمُوضِحَةِ خَمْسٌ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abdullah ibn Abi Bakr ibn\nMuhammad ibn Amr ibn Hazm from his father that in a letter which the\nMessenger of Allah, may Allah bless him and grant him peace, sent to\nAmr ibn Hazm about blood-money he wrote that it was one hundred camels\nfor a life, one hundred camels for a nose if completely removed, a\nthird of the blood-money for a wound in the brain, the same as that\nfor a belly wound, fifty for an eye, fifty for a hand, fifty for a\nfoot, ten camels for each finger, and five for teeth, and five for a\nhead wound which laid bare the bone."}},{"id":2,"idInBook":2,"chapterId":43,"bookId":7,"arabic":"حَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَوَّمَ الدِّيَةَ عَلَى أَهْلِ الْقُرَى فَجَعَلَهَا عَلَى أَهْلِ الذَّهَبِ أَلْفَ دِينَارٍ وَعَلَى أَهْلِ الْوَرِقِ اثْنَىْ عَشَرَ أَلْفَ دِرْهَمٍ ‏.‏ قَالَ مَالِكٌ فَأَهْلُ الذَّهَبِ أَهْلُ الشَّامِ وَأَهْلُ مِصْرَ وَأَهْلُ الْوَرِقِ أَهْلُ الْعِرَاقِ ‏.‏ وَحَدَّثَنِي يَحْيَى عَنْ مَالِكٍ أَنَّهُ سَمِعَ أَنَّ الدِّيَةَ تُقْطَعُ فِي ثَلاَثِ سِنِينَ أَوْ أَرْبَعِ سِنِينَ ‏.‏ قَالَ مَالِكٌ وَالثَّلاَثُ أَحَبُّ مَا سَمِعْتُ إِلَىَّ فِي ذَلِكَ ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا أَنَّهُ لاَ يُقْبَلُ مِنْ أَهْلِ الْقُرَى فِي الدِّيَةِ الإِبِلُ وَلاَ مِنْ أَهْلِ الْعَمُودِ الذَّهَبُ وَلاَ الْوَرِقُ وَلاَ مِنْ أَهْلِ الذَّهَبِ الْوَرِقُ وَلاَ مِنْ أَهْلِ الْوَرِقِ الذَّهَبُ ‏.‏","english":{"narrator":"","text":"Malik related to me that he had heard that Umar ibn al-Khattab\nestimated the full blood-money for the people of urban areas. For\nthose who had gold, he made it one thousand dinars. and for those who\nhad silver he made it ten thousand dirhams.\n\n\nMalik said, \"The\npeople of gold are the people of ash-Sham and the people of Egypt. The\npeople of silver are the people of Iraq \"\n\n\nYahya related to me\nfrom Malik that he heard that the blood-money was divided into\ninstalments over three or four years.\n\n\nMalik said, \"Three is\nthe most preferable to me of what I have heard on that.\"\n\n\nMalik said, \"The generally agreed on way of doing things in our\ncommunity is that camels are not accepted from the people of cities\nfor blood-money nor is gold or silver accepted from the desert people.\nSilver is not accepted from the people of gold and gold is not\naccepted from the people of silver.\""}},{"id":3,"idInBook":3,"chapterId":43,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّ ابْنَ شِهَابٍ، كَانَ يَقُولُ فِي دِيَةِ الْعَمْدِ إِذَا قُبِلَتْ خَمْسٌ وَعِشْرُونَ بِنْتَ مَخَاضٍ وَخَمْسٌ وَعِشْرُونَ بِنْتَ لَبُونٍ وَخَمْسٌ وَعِشْرُونَ حِقَّةً وَخَمْسُ وَعِشْرُونَ جَذَعَةً ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Ibn Shihab said, \"The full\nblood-money for murder when it is accepted is twenty-five yearlings,\ntwenty-five two-year-olds, twenty-five four-year-olds, and twenty-five\nfive-year-olds.\""}},{"id":4,"idInBook":4,"chapterId":43,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ مَرْوَانَ بْنَ الْحَكَمِ، كَتَبَ إِلَى مُعَاوِيَةَ بْنِ أَبِي سُفْيَانَ أَنَّهُ أُتِيَ بِمَجْنُونٍ قَتَلَ رَجُلاً ‏.‏ فَكَتَبَ إِلَيْهِ مُعَاوِيَةُ أَنِ اعْقِلْهُ وَلاَ تُقِدْ مِنْهُ فَإِنَّهُ لَيْسَ عَلَى مَجْنُونٍ قَوَدٌ ‏.‏ قَالَ مَالِكٌ فِي الْكَبِيرِ وَالصَّغِيرِ إِذَا قَتَلاَ رَجُلاً جَمِيعًا عَمْدًا أَنَّ عَلَى الْكَبِيرِ أَنْ يُقْتَلَ وَعَلَى الصَّغِيرِ نِصْفُ الدِّيَةِ ‏.‏ قَالَ مَالِكٌ وَكَذَلِكَ الْحُرُّ وَالْعَبْدُ يَقْتُلاَنِ الْعَبْدَ فَيُقْتَلُ الْعَبْدُ وَيَكُونُ عَلَى الْحُرِّ نِصْفُ قِيمَتِهِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said that Marwan\nibn al-Hakam wrote to Muawiya ibn Abi Sufyan that a madman was brought\nto him who had killed a man. Muawiya wrote to him, \"Tie him up and do\nnot inflict any retaliation on him. There is no retaliation against a\nmadman.\"\n\n\nMalik said about an adult and a child when they\nmurder a man together, \"The adult is killed and the child pays half\nthe full blood-money.\"\n\n\nMalik said, \"It is like that with a\nfreeman and a slave when they murder a slave. The slave is killed and\nthe freeman pays half of his value.\""}},{"id":5,"idInBook":5,"chapterId":43,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عِرَاكِ بْنِ مَالِكٍ، وَسُلَيْمَانَ بْنِ يَسَارٍ، أَنَّ رَجُلاً، مِنْ بَنِي سَعْدِ بْنِ لَيْثٍ أَجْرَى فَرَسًا فَوَطِئَ عَلَى إِصْبَعِ رَجُلٍ مِنْ جُهَيْنَةَ فَنُزِيَ مِنْهَا فَمَاتَ ‏.‏ فَقَالَ عُمَرُ بْنُ الْخَطَّابِ لِلَّذِي ادُّعِيَ عَلَيْهِمْ أَتَحْلِفُونَ بِاللَّهِ خَمْسِينَ يَمِينًا مَا مَاتَ مِنْهَا فَأَبَوْا وَتَحَرَّجُوا وَقَالَ لِلآخَرِينَ أَتَحْلِفُونَ أَنْتُمْ فَأَبَوْا فَقَضَى عُمَرُ بْنُ الْخَطَّابِ بِشَطْرِ الدِّيَةِ عَلَى السَّعْدِيِّينَ ‏.‏ قَالَ مَالِكٌ وَلَيْسَ الْعَمَلُ عَلَى هَذَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Irak ibn\nMalik and Sulayman ibn Yasar that a man of the Banu Sad ibn Layth was\nrunning a horse and it trod on the finger of a man from the Juhayna\ntribe. It bled profusely, and he died. Umar ibn al-Khattab said to\nthose against whom the claim was made. \"Do you swear by Allah with\nfifty oaths that he did not die of it?\" They refused and stopped\nthemselves from doing it. He said to the others, \"Will you take an\noath?\" They refused, so Umar ibn al-Khattab gave a judgement that the\nBanu Sad had to pay half the full blood-money.\n\n\nMalik said,\n\"One does not act on this.\""}},{"id":6,"idInBook":6,"chapterId":43,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّ ابْنَ شِهَابٍ، وَسُلَيْمَانَ بْنَ يَسَارٍ، وَرَبِيعَةَ بْنَ أَبِي عَبْدِ الرَّحْمَنِ، كَانُوا يَقُولُونَ دِيَةُ الْخَطَإِ عِشْرُونَ بِنْتَ مَخَاضٍ وَعِشْرُونَ بِنْتَ لَبُونٍ وَعِشْرُونَ ابْنَ لَبُونٍ ذَكَرًا وَعِشْرُونَ حِقَّةً وَعِشْرُونَ جَذَعَةً ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا أَنَّهُ لاَ قَوَدَ بَيْنَ الصِّبْيَانِ وَإِنَّ عَمْدَهُمْ خَطَأٌ مَا لَمْ تَجِبْ عَلَيْهِمُ الْحُدُودُ وَيَبْلُغُوا الْحُلُمَ وَإِنَّ قَتْلَ الصَّبِيِّ لاَ يَكُونُ إِلاَّ خَطَأً وَذَلِكَ لَوْ أَنَّ صَبِيًّا وَكَبِيرًا قَتَلاَ رَجُلاً حُرًّا خَطَأً كَانَ عَلَى عَاقِلَةِ كُلِّ وَاحِدٍ مِنْهُمَا نِصْفُ الدِّيَةِ ‏.‏ قَالَ مَالِكٌ وَمَنْ قَتَلَ خَطَأً فَإِنَّمَا عَقْلُهُ مَالٌ لاَ قَوَدَ فِيهِ وَإِنَّمَا هُوَ كَغَيْرِهِ مِنْ مَالِهِ يُقْضَى بِهِ دَيْنُهُ وَيُجَوَّزُ فِيهِ وَصِيَّتُهُ فَإِنْ كَانَ لَهُ مَالٌ تَكُونُ الدِّيَةُ قَدْرَ ثُلُثِهِ ثُمَّ عُفِيَ عَنْ دِيَتِهِ فَذَلِكَ جَائِزٌ لَهُ وَإِنْ لَمْ يَكُنْ لَهُ مَالٌ غَيْرُ دِيَتِهِ جَازَ لَهُ مِنْ ذَلِكَ الثُّلُثُ إِذَا عُفِيَ عَنْهُ وَأَوْصَى بِهِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik\nthat Ibn Shihab, Sulayman ibn Yasar, and Rabia ibn Abi Abd ar-Rahman\nsaid, \"The blood-money of manslaughter is twenty yearlings, twenty\ntwo-year-olds, twenty male two-year-olds, twenty four-year-olds, and\ntwenty five-year-olds.\"\n\n\nMalik said, \"The generally agreed on\nway with us is that there is no retaliation against children. Their\nintention is accidental. The hudud are not obliged for them if they\nhave not yet reached puberty. If a child kills someone it is only\naccidentally. Had a child and an adult killed a free man accidentally,\neach of them pays half the full blood-money.\"\n\n\nMalik said, \"A\nperson who kills someone accidentally pays blood-money with his\nproperty and there is no retaliation against him. That money is like\nanything else from the dead man's property and his debt is paid with\nit and he is allowed to make a bequest from it. If he has a total\nproperty of which the blood-money is a third and then the blood-money\nis relinquished, that is permitted to him. If all the property he has\nis his blood-money, he is permitted to relinquish a third of it and to\nmake that a bequest.\""}},{"id":7,"idInBook":7,"chapterId":43,"bookId":7,"arabic":"","english":{"narrator":"","text":"Malik related to me that the generally agreed on way of doing\nthings amongst the community about an accident is that there is no\nblood-money until the victim is better. If a man's bone, either a\nhand, or a foot, or another part of his body, is broken accidentally\nand it heals and becomes sound and returns to its form, there is no\nblood-money for it. If the limb is impaired or there is a scar on it,\nthere is blood-money for it according to the extent that it is\nimpaired.\n\n\nMalik said, \"If that part of the body has a\nspecific blood-money mentioned by the Prophet, may Allah bless him and\ngrant him peace, it is according to what the Prophet, may Allah bless\nhim and grant him peace, specified. If it is part of what does not\nhave a specific blood-money for it mentioned by the Prophet, may Allah\nbless him and grant him peace, and if there is no previous sunna about\nit or specific blood-money, one uses ijtihad about it.\"\n\n\nMalik\nsaid, \"There is no blood-money for an accidental bodily injury when\nthe wound heals and returns to its form. If there is any scar or mark\nin that, ijtihad is used about it except for the belly-wound. There is\na third of the blood-money of a life for it. \"\n\n\nMalik said,\n\"There is no blood-money for the wound which splinters a bone in the\nbody, and it is like the wound to the body which lays bare the bone.\"\n\n\nMalik said, \"The generally agreed on way of doing things in\nour community is that when the doctor performs a circumcision and cuts\noff the glans, he must pay the full blood-money. That is because it is\nan accident which the tribe is responsible for, and the full blood\nmoney is payable for all that in which a doctor errs or exceeds, when\nit is not intentional.\""}},{"id":8,"idInBook":8,"chapterId":43,"bookId":7,"arabic":"وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ كَانَ يَقُولُ تُعَاقِلُ الْمَرْأَةُ الرَّجُلَ إِلَى ثُلُثِ الدِّيَةِ إِصْبَعُهَا كَإِصْبَعِهِ وَسِنُّهَا كَسِنِّهِ وَمُوضِحَتُهَا كَمُوضِحَتِهِ وَمُنَقِّلَتُهَا كَمُنَقَّلَتِهِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said that Said ibn\nal-Musayyab said, \"The blood-money for a woman is the same as for a\nman up to one third of the blood-money. Her finger is like his finger,\nher tooth is like his tooth, her injury which lays bare the bone is\nlike his, and her head wound which splinters the bone is like his.\""}},{"id":9,"idInBook":9,"chapterId":43,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، وَبَلَغَهُ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، أَنَّهُمَا كَانَا يَقُولاَنِ مِثْلَ قَوْلِ سَعِيدِ بْنِ الْمُسَيَّبِ فِي الْمَرْأَةِ أَنَّهَا تُعَاقِلُ الرَّجُلَ إِلَى ثُلُثِ دِيَةِ الرَّجُلِ فَإِذَا بَلَغَتْ ثُلُثَ دِيَةِ الرَّجُلِ كَانَتْ إِلَى النِّصْفِ مِنْ دِيَةِ الرَّجُلِ ‏.‏ قَالَ مَالِكٌ وَتَفْسِيرُ ذَلِكَ أَنَّهَا تُعَاقِلُهُ فِي الْمُوضِحَةِ وَالْمُنَقَّلَةِ وَمَا دُونَ الْمَأْمُومَةِ وَالْجَائِفَةِ وَأَشْبَاهِهِمَا مِمَّا يَكُونُ فِيهِ ثُلُثُ الدِّيَةِ فَصَاعِدًا فَإِذَا بَلَغَتْ ذَلِكَ كَانَ عَقْلُهَا فِي ذَلِكَ النِّصْفَ مِنْ عَقْلِ الرَّجُلِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Ibn Shihab and also Urwa\nibn az-Zubayr said the same as Said ibn al-Musayyab said about a\nwoman. Her blood-money from a man is the same up to a third of the\nblood-money of a man. If what she is owed exceeds a third of the\nblood-money of the man, she is given up to half of the blood-money of\na man.\n\n\nMalik said, \"The explanation of that is that she has\nblood-money for a head wound that lays bare the bone and one that\nsplinters the bone and for what is less than the brain wound and the\nbelly wound and the like of that of those which obliges a third of the\nblood-money or more. If the amount owed her exceeds that, her blood-\nmoney in that is half of the blood-money of a man.\""}},{"id":10,"idInBook":10,"chapterId":43,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ سَمِعَ ابْنَ شِهَابٍ، يَقُولُ مَضَتِ السُّنَّةُ أَنَّ الرَّجُلَ، إِذَا أَصَابَ امْرَأَتَهُ بِجُرْحٍ أَنَّ عَلَيْهِ عَقْلَ ذَلِكَ الْجُرْحِ وَلاَ يُقَادُ مِنْهُ ‏.‏ قَالَ مَالِكٌ وَإِنَّمَا ذَلِكَ فِي الْخَطَإِ أَنْ يَضْرِبَ الرَّجُلُ امْرَأَتَهُ فَيُصِيبَهَا مِنْ ضَرْبِهِ مَا لَمْ يَتَعَمَّدْ كَمَا يَضْرِبُهَا بِسَوْطٍ فَيَفْقَأُ عَيْنَهَا وَنَحْوَ ذَلِكَ ‏.‏ قَالَ مَالِكٌ فِي الْمَرْأَةِ يَكُونُ لَهَا زَوْجٌ وَوَلَدٌ مِنْ غَيْرِ عَصَبَتِهَا وَلاَ قَوْمِهَا فَلَيْسَ عَلَى زَوْجِهَا إِذَا كَانَ مِنْ قَبِيلَةٍ أُخْرَى مِنْ عَقْلِ جِنَايَتِهَا شَىْءٌ وَلاَ عَلَى وَلَدِهَا إِذَا كَانُوا مِنْ غَيْرِ قَوْمِهَا وَلاَ عَلَى إِخْوَتِهَا مِنْ أُمِّهَا إِذَا كَانُوا مِنْ غَيْرِ عَصَبَتِهَا وَلاَ قَوْمِهَا فَهَؤُلاَءِ أَحَقُّ بِمِيرَاثِهَا وَالْعَصَبَةُ عَلَيْهِمُ الْعَقْلُ مُنْذُ زَمَانِ رَسُولِ اللَّهِ صلى الله عليه وسلم إِلَى الْيَوْمِ وَكَذَلِكَ مَوَالِي الْمَرْأَةِ مِيرَاثُهُمْ لِوَلَدِ الْمَرْأَةِ وَإِنْ كَانُوا مِنْ غَيْرِ قَبِيلَتِهَا وَعَقْلُ جِنَايَةِ الْمَوَالِي عَلَى قَبِيلَتِهَا ‏.‏","english":{"narrator":"","text":"Yahya\nrelated to me from Malik that he heard Ibn Shihab say, \"The precedent\nof the sunna when a man injures a woman is that he must pay the blood-\nmoney for that injury and there is no retaliation against him.\"\n\n\nMalik said, \"That is an accidental injury, when a man strikes a\nwoman and hits with a blow what he did not intend, for instance, if he\nstruck her with a whip and cut her eye open and the like of that.\"\n\n\nMalik said about a woman who has a husband and children who\nare not from her paternal relatives or her people, that since he is\nfrom another tribe, there is no blood-money against her husband for\nher criminal action, nor any against her children if they are not from\nher people, nor any against her maternal brothers when they are not\nfrom her paternal relations or her people. These are entitled to her\ninheritance but only the paternal relations have paid blood-money from\nsince the time of the Messenger of Allah, may Allah bless him and\ngrant him peace. Until today it is like that with the mawla of a\nwoman. The inheritance they leave goes to the children of the woman\neven if they are not from her tribe, but the blood-money of the\ncriminal act of the mawla is only against her tribe.\""}},{"id":11,"idInBook":11,"chapterId":43,"bookId":7,"arabic":"وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ امْرَأَتَيْنِ، مِنْ هُذَيْلٍ رَمَتْ إِحْدَاهُمَا الأُخْرَى فَطَرَحَتْ جَنِينَهَا فَقَضَى فِيهِ رَسُولُ اللَّهِ صلى الله عليه وسلم بِغُرَّةٍ عَبْدٍ أَوْ وَلِيدَةٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Abu Salama\nibn Abd ar-Rahman ibn Awf from Abu Hurayra that a woman from the\nHudhayl tribe threw a stone at a woman from the same tribe, and she\nhad a miscarriage. The Messenger of Allah, may Allah bless him and\ngrant him peace, gave a judgement that a slave or slave-girl of fair\ncomplexion and excellence should be given to her."}},{"id":12,"idInBook":12,"chapterId":43,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَضَى فِي الْجَنِينَ يُقْتَلُ فِي بَطْنِ أُمِّهِ بِغُرَّةٍ عَبْدٍ أَوْ وَلِيدَةٍ فَقَالَ الَّذِي قُضِيَ عَلَيْهِ كَيْفَ أَغْرَمُ مَا لاَ شَرِبَ وَلاَ أَكَلْ وَلاَ نَطَقَ وَلاَ اسْتَهَلّ وَمِثْلُ ذَلِكَ بَطَلْ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّمَا هَذَا مِنْ إِخْوَانِ الْكُهَّانِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Said ibn al-\nMusayyab that the Messenger of Allah, may Allah bless him and grant\nhim peace, gave a judgement that the compensation for a foetus killed\nin its mother's womb was a slave or slave-girl of fair complexion and\nexcellence. The one against whom the judgement was given said, \"Why\nshould I pay damages for that which did not drink or eat or speak or\nmake any cry. The like of that is nothing.\" The Messenger of Allah,\nmay Allah bless him and grant him peace, said, \"This is only one of\nthe brothers of the diviners.\" He disapproved of the rhyming speech of\nthe man's declaration."}},{"id":13,"idInBook":13,"chapterId":43,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، أَنَّهُ كَانَ يَقُولُ الْغُرَّةُ تُقَوَّمُ خَمْسِينَ دِينَارًا أَوْ سِتَّمِائَةِ دِرْهَمٍ وَدِيَةُ الْمَرْأَةِ الْحُرَّةِ الْمُسْلِمَةِ خَمْسُمِائَةِ دِينَارٍ أَوْ سِتَّةُ آلاَفِ دِرْهَمٍ ‏.‏ قَالَ مَالِكٌ فَدِيَةُ جَنِينِ الْحُرَّةِ عُشْرُ دِيَتِهَا وَالْعُشْرُ خَمْسُونَ دِينَارًا أَوْ سِتُّمِائَةِ دِرْهَمٍ ‏.‏ قَالَ مَالِكٌ وَلَمْ أَسْمَعْ أَحَدًا يُخَالِفُ فِي أَنَّ الْجَنِينَ لاَ تَكُونُ فِيهِ الْغُرَّةُ حَتَّى يُزَايِلَ بَطْنَ","english":{"narrator":"","text":"Yahya related to me from Malik that\nRabia ibn Abi Abd ar-Rahman said, \"The slave of fair complexion and\nexcellence is estimated at fifty dinars or six hundred dirhams. The\nblood-money of a free muslim woman is five hundred dinars or six\nthousand dirhams.\"\n\n\nMalik said, \"The blood-money of the foetus\nof a free woman is a tenth of her blood-money. The tenth is fifty\ndinars or six hundred dirhams.\"\n\n\nMalik said, \"I have not heard\nanyone dispute that there is no slave in compensation for the foetus\nuntil it leaves its mother's womb and falls still-born from her womb .\n\"\n\n\nMalik said, \"I heard that if the foetus comes out of its\nmother's womb alive and then dies, the full blood-money is due for\nit.\"\n\n\nMalik said, \"The foetus is not alive unless it cries at\nbirth. If it comes out of its mother's womb and cries out and then\ndies, the complete blood-money is due for it. We think that the slave-\ngirl's foetus has a tenth of the price of the slave-girl.\"\n\n\nMalik said, \"When a woman murders a man or woman, and the murderess is\npregnant, retaliation is not taken against her until she has given\nbirth. If a woman who is pregnant is killed intentionally or\nunintentionally, the one who killed her is not obliged to pay anything\nfor her foetus. If she is murdered, then the one who killed her is\nkilled and there is no blood-money for her foetus. If she is killed\naccidentally, the tribe obliged to pay on behalf of her killer pays\nher blood-money, and there is no blood-money for the foetus.\"\n\n\nYahya related to me, \"Malik was asked about the foetus of the\nchristian or jewish woman which was aborted. He said, 'I think that\nthere is a tenth of the blood-money of the mother for it.' \""}},{"id":14,"idInBook":14,"chapterId":43,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ كَانَ يَقُولُ فِي الشَّفَتَيْنِ الدِّيَةُ كَامِلَةً فَإِذَا قُطِعَتِ السُّفْلَى فَفِيهَا ثُلُثَا الدِّيَةِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab that Said ibn al-\nMusayyab used to say, \"The full blood-money is payable for cutting off\nboth lips, but when the lower one only is cut off, two-thirds of the\nblood-money is due for it.\""}},{"id":15,"idInBook":15,"chapterId":43,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ سَأَلَ ابْنَ شِهَابٍ عَنِ الرَّجُلِ الأَعْوَرِ، يَفْقَأُ عَيْنَ الصَّحِيحِ فَقَالَ ابْنُ شِهَابٍ إِنْ أَحَبَّ الصَّحِيحُ أَنْ يَسْتَقِيدَ، مِنْهُ فَلَهُ الْقَوَدُ وَإِنْ أَحَبَّ فَلَهُ الدِّيَةُ أَلْفُ دِينَارٍ أَوِ اثْنَا عَشَرَ أَلْفَ دِرْهَمٍ ‏.‏ وَحَدَّثَنِي يَحْيَى عَنْ مَالِكٍ أَنَّهُ بَلَغَهُ أَنَّ فِي كُلِّ زَوْجٍ مِنَ الإِنْسَانِ الدِّيَةَ كَامِلَةً وَأَنَّ فِي اللِّسَانِ الدِّيَةَ كَامِلَةً وَأَنَّ فِي الأُذُنَيْنِ إِذَا ذَهَبَ سَمْعُهُمَا الدِّيَةَ كَامِلَةً اصْطُلِمَتَا أَوْ لَمْ تُصْطَلَمَا وَفِي ذَكَرِ الرَّجُلِ الدِّيَةُ كَامِلَةً وَفِي الأُنْثَيَيْنِ الدِّيَةُ كَامِلَةً ‏.‏ وَحَدَّثَنِي يَحْيَى عَنْ مَالِكٍ أَنَّهُ بَلَغَهُ أَنَّ فِي ثَدْيَىِ الْمَرْأَةِ الدِّيَةَ كَامِلَةً ‏.‏ قَالَ مَالِكٌ وَأَخَفُّ ذَلِكَ عِنْدِي الْحَاجِبَانِ وَثَدْيَا الرَّجُلِ ‏.‏ قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا أَنَّ الرَّجُلَ إِذَا أُصِيبَ مِنْ أَطْرَافِهِ أَكْثَرُ مِنْ دِيَتِهِ فَذَلِكَ لَهُ إِذَا أُصِيبَتْ يَدَاهُ وَرِجْلاَهُ وَعَيْنَاهُ فَلَهُ ثَلاَثُ دِيَاتٍ ‏.‏ قَالَ مَالِكٌ فِي عَيْنِ الأَعْوَرِ الصَّحِيحَةِ إِذَا فُقِئَتْ خَطَأً إِنَّ فِيهَا الدِّيَةَ كَامِلَةً ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik\nthat he asked Ibn Shihab about the one-eyed man who gouged out the eye\nof a healthy person. Ibn Shihab said, \"If the healthy person wants to\ntake retaliation from him, he can have his retaliation. If he prefers,\nhe has blood-money of one thousand dinars, twelve thousand dirhams.\"\n\n\nYahya related to me from Malik that he heard that full blood-\nmoney was payable for both of a pair of anything in a man that\noccurred in pairs, and the tongue had full blood-money. The ears, when\ntheir hearing departed, had full blood-money, whether or not they were\ncut off, and a man's penis had full blood-money and the testicles had\nfull blood-money.\n\n\nYahya related to me from Malik that he\nheard that the breasts of a woman had full blood-money.\n\n\nMalik\nsaid, \"The least of that are the eyebrows and a man's breasts.\"\n\n\nMalik said, \"What is done in our community when a man is injured\nin his extremities to an extent that obliges payment of more than the\namount of his full blood-money, is that it is his right. If his hands,\nfeet, and eyes are all injured, he has three full blood-moneys.\"\n\n\nMalik said about the sound eye of a one-eyed man when it is\naccidentally gouged out, \"The full blood-money is payable for it.\""}},{"id":16,"idInBook":16,"chapterId":43,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، أَنَّ زَيْدَ بْنَ ثَابِتٍ، كَانَ يَقُولُ فِي الْعَيْنِ الْقَائِمَةِ إِذَا طَفِئَتْ مِائَةُ دِينَارٍ ‏.‏ قَالَ يَحْيَى وَسُئِلَ مَالِكٌ عَنْ شَتَرِ الْعَيْنِ وَحِجَاجِ الْعَيْنِ فَقَالَ لَيْسَ فِي ذَلِكَ إِلاَّ الاِجْتِهَادُ إِلاَّ أَنْ يَنْقُصَ بَصَرُ الْعَيْنِ فَيَكُونُ لَهُ بِقَدْرِ مَا نَقَصَ مِنْ بَصَرِ الْعَيْنِ ‏.‏ قَالَ يَحْيَى قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا فِي الْعَيْنِ الْقَائِمَةِ الْعَوْرَاءِ إِذَا طَفِئَتْ وَفِي الْيَدِ الشَّلاَّءِ إِذَا قُطِعَتْ إِنَّهُ لَيْسَ فِي ذَلِكَ إِلاَّ الاِجْتِهَادُ وَلَيْسَ فِي ذَلِكَ عَقْلٌ مُسَمًّى ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said from Sulayman\nibn Yasar that Zayd ibn Thabit used to say, \"When the eye remains but\nthe sight is lost, one hundred dinars are payable for it.\"\n\n\nYahya said, \"Malik was asked about cutting off the lower lid of the\neye and the bone around the eye. He said, 'There is only ijtihad in\nthat unless the vision of the eye is impaired. He is entitled to an\namount that is compatible to the extent the vision of the eye has been\nimpaired.\"\n\n\nYahya said that Malik said, \"What is done in our\ncommunity about removing the bad eye of a one-eyed man when it has\nalready been blinded and still remains there in its place and the\nparalyzed hand when it is cut off, is that there is only ijtihad in\nthat, and there is no prescribed blood-money.\""}},{"id":17,"idInBook":17,"chapterId":43,"bookId":7,"arabic":"وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ سَمِعَ سُلَيْمَانَ بْنَ يَسَارٍ، يَذْكُرُ أَنَّ الْمُوضِحَةَ، فِي الْوَجْهِ مِثْلُ الْمُوضِحَةِ فِي الرَّأْسِ إِلاَّ أَنْ تَعِيبَ الْوَجْهَ فَيُزَادُ فِي عَقْلِهَا مَا بَيْنَهَا وَبَيْنَ عَقْلِ نِصْفِ الْمُوضِحَةِ فِي الرَّأْسِ فَيَكُونُ فِيهَا خَمْسَةٌ وَسَبْعُونَ دِينَارًا ‏.‏ قَالَ مَالِكٌ وَالأَمْرُ عِنْدَنَا أَنَّ فِي الْمُنَقَّلَةِ خَمْسَ عَشْرَةَ فَرِيضَةً ‏.‏ قَالَ وَالْمُنَقَّلَةُ الَّتِي يَطِيرُ فِرَاشُهَا مِنَ الْعَظْمِ وَلاَ تَخْرِقُ إِلَى الدِّمَاغِ وَهِيَ تَكُونُ فِي الرَّأْسِ وَفِي الْوَجْهِ ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا أَنَّ الْمَأْمُومَةَ وَالْجَائِفَةَ لَيْسَ فِيهِمَا قَوَدٌ ‏.‏ وَقَدْ قَالَ ابْنُ شِهَابٍ لَيْسَ فِي الْمَأْمُومَةِ قَوَدٌ ‏.‏ قَالَ مَالِكٌ وَالْمَأْمُومَةُ مَا خَرَقَ الْعَظْمَ إِلَى الدِّمَاغِ وَلاَ تَكُونُ الْمَأْمُومَةُ إِلاَّ فِي الرَّأْسِ وَمَا يَصِلُ إِلَى الدِّمَاغِ إِذَا خَرَقَ الْعَظْمَ ‏.‏ قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا أَنَّهُ لَيْسَ فِيمَا دُونَ الْمُوضِحَةِ مِنَ الشِّجَاجِ عَقْلٌ حَتَّى تَبْلُغَ الْمُوضِحَةَ وَإِنَّمَا الْعَقْلُ فِي الْمُوضِحَةِ فَمَا فَوْقَهَا وَذَلِكَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم انْتَهَى إِلَى الْمُوضِحَةِ فِي كِتَابِهِ لِعَمْرِو بْنِ حَزْمٍ فَجَعَلَ فِيهَا خَمْسًا مِنَ الإِبِلِ وَلَمْ تَقْضِ الأَئِمَّةُ فِي الْقَدِيمِ وَلاَ فِي الْحَدِيثِ فِيمَا دُونَ الْمُوضِحَةِ بِعَقْلٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Yahya ibn Said heard Sulayman\nibn Yasar mention that a face wound in which the bone was bared was\nlike a head wound in which the bone was bared, unless the face was\nscarred by the wound. Then the blood-money is increased by one half of\nthe blood-money of the head wound in which the skin was bared so that\nseventy five dinars are payable for it.\n\n\nMalik said, \"What is\ndone in our community is that the head wound with splinters has\nfifteen camels.\" He explained, \"The head wound with splinters is that\nfrom which pieces of bone fly off and which does not reach the brain.\nIt can be in the head or the face.\"\n\n\nMalik said, \"The\ngenerally agreed on way of doing things in our community, is that\nthere is no retaliation for a wound to the brain or a belly wound, and\nIbn Shihab has said, 'There is no retaliation for a wound to the\nbrain.' \"\n\n\nMalik explained, \"The wound to the brain is what\npierces the bones to the brain. This type of wound only occurs in the\nhead. It is that which reaches the brain when the bones are pierced.\"\n\n\nMalik said, \"What is done in our community is that there is\nno blood-money paid on any head wound less than one which lays bare\nthe skull. Blood-money is payable only for the head wound that bares\nthe bone and what is worse than that. That is because the Messenger of\nAllah, may Allah bless him and grant him peace, stopped at the head\nwound which bared the bone in his letter to Amr ibn Hazm. He made it\nfive camels. The imams, past and present, have not made any blood-\nmoney payable for injuries less than the head wound which bares the\nbone.\""}},{"id":18,"idInBook":18,"chapterId":43,"bookId":7,"arabic":"وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ قَالَ كُلُّ نَافِذَةٍ فِي عُضْوٍ مِنَ الأَعْضَاءِ فَفِيهَا ثُلُثُ عَقْلِ ذَلِكَ الْعُضْوِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said,\nthat Said ibn al-Musayyab said, \"For every piercing wound in any of\nthe organs or limbs of the body, one third of the blood-money of that\nlimb is payable.\""}},{"id":19,"idInBook":19,"chapterId":43,"bookId":7,"arabic":"حَدَّثَنِي مَالِكٌ، كَانَ ابْنُ شِهَابٍ لاَ يَرَى ذَلِكَ وَأَنَا لاَ، أَرَى فِي نَافِذَةٍ فِي عُضْوٍ مِنَ الأَعْضَاءِ فِي الْجَسَدِ أَمْرًا مُجْتَمَعًا عَلَيْهِ وَلَكِنِّي أَرَى فِيهَا الاِجْتِهَادَ يَجْتَهِدُ الإِمَامُ فِي ذَلِكَ وَلَيْسَ فِي ذَلِكَ أَمْرٌ مُجْتَمَعٌ عَلَيْهِ عِنْدَنَا ‏.‏ قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا أَنَّ الْمَأْمُومَةَ وَالْمُنَقَّلَةَ وَالْمُوضِحَةَ لاَ تَكُونُ إِلاَّ فِي الْوَجْهِ وَالرَّأْسِ فَمَا كَانَ فِي الْجَسَدِ مِنْ ذَلِكَ فَلَيْسَ فِيهِ إِلاَّ الاِجْتِهَادُ ‏.‏ قَالَ مَالِكٌ فَلاَ أَرَى اللَّحْىَ الأَسْفَلَ وَالأَنْفَ مِنَ الرَّأْسِ فِي جِرَاحِهِمَا لأَنَّهُمَا عَظْمَانِ مُنْفَرِدَانِ وَالرَّأْسُ بَعْدَهُمَا عَظْمٌ وَاحِدٌ ‏.‏","english":{"narrator":"","text":"Malik related to me, \"Ibn Shihab did not\nthink and nor do I, that there is a generally agreed on way of doing\nthings regarding a piercing wound in any of the organs or limbs of the\nbody, but I think that there is ijtihad in the case. The imam uses\nijtihad in it, and there is no generally agreed on way of doing things\nin our community about it.\"\n\n\nMalik said, \"What is done in our\ncommunity about the wound to the brain and the wound which splinters\nthe bone, and the wound that bares the bone is that they apply only to\nthe head and face. Whatever of that occurs in the body only has\nijtihad in it.\"\n\n\nMalik said, \"I do not think the lower jaw and\nthe nose are part of the head in their injury because they are\nseparate bones, and except for them the head is one bone.\""}},{"id":20,"idInBook":20,"chapterId":43,"bookId":7,"arabic":"وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، أَنَّ عَبْدَ اللَّهِ بْنَ الزُّبَيْرِ، أَقَادَ مِنَ الْمُنَقَّلَةِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Rabia ibn Abi Abd ar-Rahman that\nAbdullah ibn az-Zubayr allowed retaliation for a head wound which\nsplintered the bone."}},{"id":21,"idInBook":21,"chapterId":43,"bookId":7,"arabic":"وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، أَنَّهُ قَالَ سَأَلْتُ سَعِيدَ بْنَ الْمُسَيَّبِ كَمْ فِي إِصْبَعِ الْمَرْأَةِ فَقَالَ عَشْرٌ مِنَ الإِبِلِ ‏.‏ فَقُلْتُ كَمْ فِي إِصْبَعَيْنِ قَالَ عِشْرُونَ مِنَ الإِبِلِ ‏.‏ فَقُلْتُ كَمْ فِي ثَلاَثٍ فَقَالَ ثَلاَثُونَ مِنَ الإِبِلِ ‏.‏ فَقُلْتُ كَمْ فِي أَرْبَعٍ قَالَ عِشْرُونَ مِنَ الإِبِلِ ‏.‏ فَقُلْتُ حِينَ عَظُمَ جُرْحُهَا وَاشْتَدَّتْ مُصِيبَتُهَا نَقَصَ عَقْلُهَا فَقَالَ سَعِيدٌ أَعِرَاقِيٌّ أَنْتَ فَقُلْتُ بَلْ عَالِمٌ مُتَثَبِّتٌ أَوْ جَاهِلٌ مُتَعَلِّمٌ ‏.‏ فَقَالَ سَعِيدٌ هِيَ السُّنَّةُ يَا ابْنَ أَخِي ‏.‏ قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا فِي أَصَابِعِ الْكَفِّ إِذَا قُطِعَتْ فَقَدْ تَمَّ عَقْلُهَا وَذَلِكَ أَنَّ خَمْسَ الأَصَابِعِ إِذَا قُطِعَتْ كَانَ عَقْلُهَا عَقْلَ الْكَفِّ خَمْسِينَ مِنَ الإِبِلِ فِي كُلِّ إِصْبَعٍ عَشَرَةٌ مِنَ الإِبِلِ ‏.‏ قَالَ مَالِكٌ وَحِسَابُ الأَصَابِعِ ثَلاَثَةٌ وَثَلاَثُونَ دِينَارٍ وَثُلُثُ دِينَارٍ فِي كُلِّ أَنْمُلَةٍ وَهِيَ مِنَ الإِبِلِ ثَلاَثُ فَرَائِضَ وَثُلُثُ فَرِيضَةٍ ‏.‏","english":{"narrator":"ibn Abi Abd ar-Rahman said, \"I asked Said ibn al Musayyab, 'How\nmuch for the finger of a woman?' He said, 'Ten camels' I said, 'How\nmuch for two fingers?' He said, 'Twenty camels.' I said, 'How much for\nthree?' He said, 'Thirty camels.' I said, 'How much for four?' He\nsaid, 'Twenty camels.' I said, 'When her wound is greater and her\naffliction stronger, is her blood-money then less?' He said, 'Are you\nan Iraqi?' I said, 'Rather, I am a scholar who seeks to verify things,\nor an ignorant man who seeks to learn.' Said said, 'It is the sunna,\nmy nephew.' \"\n\n\nMalik said, \"What is done in our community\nabout all the fingers of the hand being cut off is that its blood-\nmoney is complete. That is because when five fingers are cut, their\nblood-money is the blood-money of the hand:","text":"fifty camels. Each finger\nhas ten camels.\"\n\n\nMalik said, \"The reckoning of the fingers is\nthirty-three dinars for each fingertip, and that is three and a third\nshares of camels.\""}},{"id":22,"idInBook":22,"chapterId":43,"bookId":7,"arabic":"وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ مُسْلِمِ بْنِ جُنْدُبٍ، عَنْ أَسْلَمَ، مَوْلَى عُمَرَ بْنِ الْخَطَّابِ أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَضَى فِي الضِّرْسِ بِجَمَلٍ وَفِي التَّرْقُوَةِ بِجَمَلٍ وَفِي الضِّلَعِ بِجَمَلٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Zayd ibn Aslam from Muslim\nibn Jundub from Aslam, the mawla of Umar ibn al-Khattab that Umar ibn\nal-Khattab decided on a camel for a molar, a camel for a collar-bone,\nand a camel for a rib."}},{"id":23,"idInBook":23,"chapterId":43,"bookId":7,"arabic":"وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ سَمِعَ سَعِيدَ بْنَ الْمُسَيَّبِ، يَقُولُ قَضَى عُمَرُ بْنُ الْخَطَّابِ فِي الأَضْرَاسِ بِبَعِيرٍ بَعِيرٍ وَقَضَى مُعَاوِيَةُ بْنُ أَبِي سُفْيَانَ فِي الأَضْرَاسِ بِخَمْسَةِ أَبْعِرَةٍ خَمْسَةِ أَبْعِرَةٍ ‏.‏ قَالَ سَعِيدُ بْنُ الْمُسَيَّبِ فَالدِّيَةُ تَنْقُصُ فِي قَضَاءِ عُمَرَ بْنِ الْخَطَّابِ وَتَزِيدُ فِي قَضَاءِ مُعَاوِيَةَ فَلَوْ كُنْتُ أَنَا لَجَعَلْتُ فِي الأَضْرَاسِ بَعِيرَيْنِ بَعِيرَيْنِ فَتِلْكَ الدِّيَةُ سَوَاءٌ وَكُلُّ مُجْتَهِدٍ مَأْجُورٌ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that\nYahya ibn Said heard Said ibn al-Musayyab say, ''Umar ibn al-Khattab\ndecided on a camel for each molar, and Muawiya ibn Abi Sufyan decided\non five camels for each molar.\"\n\n\nSaid ibn al-Musayyab said,\n\"The blood-money is less in the judgement of Umar ibn al-Khattab and\nmore in the judgement of Muawiya. Had it been me, I would have made it\ntwo camels for each molar. That is the fair blood-money, and every one\nwho strives with ijtihad is rewarded.\""}},{"id":24,"idInBook":24,"chapterId":43,"bookId":7,"arabic":"وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ كَانَ يَقُولُ إِذَا أُصِيبَتِ السِّنُّ فَاسْوَدَّتْ فَفِيهَا عَقْلُهَا تَامًّا فَإِنْ طُرِحَتْ بَعْدَ أَنْ تَسْوَدَّ فَفِيهَا عَقْلُهَا أَيْضًا تَامًّا ‏.‏","english":{"narrator":"","text":"Yahya related to me\nfrom Malik from Yahya ibn Said that Said ibn al-Musayyab used to say,'\n'When a tooth is struck and becomes black, there is complete blood-\nmoney for it. If it falls out after it becomes black, there is also\nthe complete blood-money for it.\""}},{"id":25,"idInBook":25,"chapterId":43,"bookId":7,"arabic":"وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ دَاوُدَ بْنِ الْحُصَيْنِ، عَنْ أَبِي غَطَفَانَ بْنِ طَرِيفٍ الْمُرِّيِّ، أَنَّهُ أَخْبَرَهُ أَنَّ مَرْوَانَ بْنَ الْحَكَمِ بَعَثَهُ إِلَى عَبْدِ اللَّهِ بْنِ عَبَّاسٍ يَسْأَلُهُ مَاذَا فِي الضِّرْسِ فَقَالَ عَبْدُ اللَّهِ بْنُ عَبَّاسٍ فِيهِ خَمْسٌ مِنَ الإِبِلِ ‏.‏ قَالَ فَرَدَّنِي مَرْوَانُ إِلَى عَبْدِ اللَّهِ بْنِ عَبَّاسٍ فَقَالَ أَتَجْعَلُ مُقَدَّمَ الْفَمِ مِثْلَ الأَضْرَاسِ ‏.‏ فَقَالَ عَبْدُ اللَّهِ بْنُ عَبَّاسٍ لَوْ لَمْ تَعْتَبِرْ ذَلِكَ إِلاَّ بِالأَصَابِعِ عَقْلُهَا سَوَاءٌ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Da'ud ibn al-Husayn that Abu\nGhatafan ibn Tarif al-Murri informed him that Marwan ibn al-Hakam sent\nhim to Abdullah ibn Abbas to ask him what there was for the molar.\nAbdullah ibn Abbas said, \"There are five camels for it.\" He said,\n\"Marwan sent me back again to Abdullah ibn Abbas.'' He said, \"Do you\nmake front teeth like molars?\" Abdullah ibn Abbas said, \"It is enough\nthat you take the fingers as the example for that, their blood-moneys\nbeing all the same.\""}},{"id":26,"idInBook":26,"chapterId":43,"bookId":7,"arabic":"وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّهُ كَانَ يُسَوِّي بَيْنَ الأَسْنَانِ فِي الْعَقْلِ وَلاَ يُفَضِّلُ بَعْضَهَا عَلَى بَعْضٍ ‏.‏ قَالَ مَالِكٌ وَالأَمْرُ عِنْدَنَا أَنَّ مُقَدَّمَ الْفَمِ وَالأَضْرَاسِ وَالأَنْيَابِ عَقْلُهَا سَوَاءٌ وَذَلِكَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ فِي السِّنِّ خَمْسٌ مِنَ الإِبِلِ ‏\"‏ ‏.‏ وَالضِّرْسُ سِنٌّ مِنَ الأَسْنَانِ لاَ يَفْضُلُ بَعْضُهَا عَلَى بَعْضٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from\nHisham ibn Urwa that his father made all the teeth the same in the\nblood-money and did not prefer any kind over others.\n\n\nMalik\nsaid, \"What is done in our community is that the front teeth, molars,\nand eye-teeth have the same blood-money. That is because the Messenger\nof Allah, may Allah bless him and grant him peace, said, 'The tooth\nhas five camels.' The molar is one of the teeth and he did not prefer\nany kind over the others.\""}},{"id":27,"idInBook":27,"chapterId":43,"bookId":7,"arabic":"وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ سَعِيدَ بْنَ الْمُسَيَّبِ، وَسُلَيْمَانَ بْنَ يَسَارٍ، كَانَا يَقُولاَنِ فِي مُوضِحَةِ الْعَبْدِ نِصْفُ عُشْرِ ثَمَنِهِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Said ibn\nal-Musayyab and Sulayman ibn Yasar said, \"The head wound of the slave\nin which the bone is bared is a twentieth of his price.\""}},{"id":28,"idInBook":28,"chapterId":43,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ مَرْوَانَ بْنَ الْحَكَمِ، كَانَ يَقْضِي فِي الْعَبْدِ يُصَابُ بِالْجِرَاحِ أَنَّ عَلَى مَنْ جَرَحَهُ قَدْرَ مَا نَقَصَ مِنْ ثَمَنِ الْعَبْدِ ‏.‏ قَالَ مَالِكٌ وَالأَمْرُ عِنْدَنَا أَنَّ فِي مُوضِحَةِ الْعَبْدِ نِصْفَ عُشْرِ ثَمَنِهِ وَفِي مُنَقَّلَتِهِ الْعُشْرُ وَنِصْفُ الْعُشْرِ مِنْ ثَمَنِهِ وَفِي مَأْمُومَتِهِ وَجَائِفَتِهِ فِي كُلِّ وَاحِدَةٍ مِنْهُمَا ثُلُثُ ثَمَنِهِ وَفِيمَا سِوَى هَذِهِ الْخِصَالِ الأَرْبَعِ مِمَّا يُصَابُ بِهِ الْعَبْدُ مَا نَقَصَ مِنْ ثَمَنِهِ يُنْظَرُ فِي ذَلِكَ بَعْدَ مَا يَصِحُّ الْعَبْدُ وَيَبْرَأُ كَمْ بَيْنَ قِيمَةِ الْعَبْدِ بَعْدَ أَنْ أَصَابَهُ الْجُرْحُ وَقِيمَتِهِ صَحِيحًا قَبْلَ أَنْ يُصِيبَهُ هَذَا ثُمَّ يَغْرَمُ الَّذِي أَصَابَهُ مَا بَيْنَ الْقِيمَتَيْنِ ‏.‏ قَالَ مَالِكٌ فِي الْعَبْدِ إِذَا كُسِرَتْ يَدُهُ أَوْ رِجْلُهُ ثُمَّ صَحَّ كَسْرُهُ فَلَيْسَ عَلَى مَنْ أَصَابَهُ شَىْءٌ فَإِنْ أَصَابَ كَسْرَهُ ذَلِكَ نَقْصٌ أَوْ عَثَلٌ كَانَ عَلَى مَنْ أَصَابَهُ قَدْرُ مَا نَقَصَ مِنْ ثَمَنِ الْعَبْدِ ‏.‏ قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا فِي الْقِصَاصِ بَيْنَ الْمَمَالِيكِ كَهَيْئَةِ قِصَاصِ الأَحْرَارِ نَفْسُ الأَمَةِ بِنَفْسِ الْعَبْدِ وَجُرْحُهَا بِجُرْحِهِ فَإِذَا قَتَلَ الْعَبْدُ عَبْدًا عَمْدًا خُيِّرَ سَيِّدُ الْعَبْدِ الْمَقْتُولِ فَإِنْ شَاءَ قَتَلَ وَإِنْ شَاءَ أَخَذَ الْعَقْلَ فَإِنْ أَخَذَ الْعَقْلَ أَخَذَ قِيمَةَ عَبْدِهِ وَإِنْ شَاءَ رَبُّ الْعَبْدِ الْقَاتِلِ أَنْ يُعْطِيَ ثَمَنَ الْعَبْدِ الْمَقْتُولِ فَعَلَ وَإِنْ شَاءَ أَسْلَمَ عَبْدَهُ فَإِذَا أَسْلَمَهُ فَلَيْسَ عَلَيْهِ غَيْرُ ذَلِكَ وَلَيْسَ لِرَبِّ الْعَبْدِ الْمَقْتُولِ إِذَا أَخَذَ الْعَبْدَ الْقَاتِلَ وَرَضِيَ بِهِ أَنْ يَقْتُلَهُ وَذَلِكَ فِي الْقِصَاصِ كُلِّهِ بَيْنَ الْعَبِيدِ فِي قَطْعِ الْيَدِ وَالرِّجْلِ وَأَشْبَاهِ ذَلِكَ بِمَنْزِلَتِهِ فِي الْقَتْلِ ‏.‏ قَالَ مَالِكٌ فِي الْعَبْدِ الْمُسْلِمِ يَجْرَحُ الْيَهُودِيَّ أَوِ النَّصْرَانِيَّ إِنَّ سَيِّدَ الْعَبْدِ إِنْ شَاءَ أَنْ يَعْقِلَ عَنْهُ مَا قَدْ أَصَابَ فَعَلَ أَوْ أَسْلَمَهُ فَيُبَاعُ فَيُعْطِي الْيَهُودِيَّ أَوِ النَّصْرَانِيَّ مِنْ ثَمَنِ الْعَبْدِ دِيَةَ جُرْحِهِ أَوْ ثَمَنَهُ كُلَّهُ إِنْ أَحَاطَ بِثَمَنِهِ وَلاَ يُعْطِي الْيَهُودِيَّ وَلاَ النَّصْرَانِيَّ عَبْدًا مُسْلِمًا ‏.‏","english":{"narrator":"","text":"Malik related to me that he had heard that Marwan ibn al-Hakam gave a\ndecision about a slave who was injured that the person who injured him\nhad to pay what he had diminished of the value of the slave.\n\n\nMalik said, \"What is done in our community is that for the head wound\nof a slave that bares the bone, there is a twentieth of his price. The\nhead wound which splinters the bone is three twentieths of his price.\nBoth the wound to the brain and the belly wound are a third of his\nprice. Besides these four, any other types of injury that decrease the\nprice of the slave are considered after the slave is better and well,\nand one sees what the value of the slave is after his injury and what\nhis value whole was before he had the injury. Then the one who injured\nhim pays the difference between the two values.\""}},{"id":29,"idInBook":29,"chapterId":43,"bookId":7,"arabic":"وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ، قَضَى أَنَّ دِيَةَ الْيَهُودِيِّ، أَوِ النَّصْرَانِيِّ - إِذَا قُتِلَ أَحَدُهُمَا - مِثْلُ نِصْفِ دِيَةِ الْحُرِّ الْمُسْلِمِ ‏.‏ قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا أَنْ لاَ يُقْتَلَ مُسْلِمٌ بِكَافِرٍ إِلاَّ أَنْ يَقْتُلَهُ مُسْلِمٌ قَتْلَ غِيْلَةٍ فَيُقْتَلُ بِهِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he heard that Umar ibn Abd\nal-Aziz gave a decision that when a jew or christian was killed, his\nblood-money was half the blood-money of a free muslim.\n\n\nMalik\nsaid, \"What is done in our community, is that a muslim is not killed\nfor a kafir unless the muslim kills him by deceit. Then he is killed\nfor it.\""}},{"id":30,"idInBook":30,"chapterId":43,"bookId":7,"arabic":"وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ سُلَيْمَانَ بْنَ يَسَارٍ، كَانَ يَقُولُ دِيَةُ الْمَجُوسِيِّ ثَمَانِي مِائَةِ دِرْهَمٍ ‏.‏ قَالَ مَالِكٌ وَهُوَ الأَمْرُ عِنْدَنَا ‏.‏ قَالَ مَالِكٌ وَجِرَاحُ الْيَهُودِيِّ وَالنَّصْرَانِيِّ وَالْمَجُوسِيِّ فِي دِيَاتِهِمْ عَلَى حِسَابِ جِرَاحِ الْمُسْلِمِينَ فِي دِيَاتِهِمُ الْمُوضِحَةُ نِصْفُ عُشْرِ دِيَتِهِ وَالْمَأْمُومَةُ ثُلُثُ دِيَتِهِ وَالْجَائِفَةُ ثُلُثُ دِيَتِهِ فَعَلَى حِسَابِ ذَلِكَ جِرَاحَاتُهُمْ كُلُّهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said\nthat Sulayman ibn Yasar said, \"The blood-money of a magian is eight\nhundred dirhams.\"\n\n\nMalik said, \"This is what is done in our\ncommunity.\"\n\n\nMalik said, \"The blood-monies of the jew,\nchristian, and magian in their injuries, is according to the injury of\nthe muslims in their blood-moneys. The head wound is a twentieth of\nhis full blood-money. The wound that opens the head is a third of his\nblood-money. The belly-wound is a third of his blood-money. All their\ninjuries are according to this calculation.\""}},{"id":31,"idInBook":31,"chapterId":43,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّهُ كَانَ يَقُولُ لَيْسَ عَلَى الْعَاقِلَةِ عَقْلٌ فِي قَتْلِ الْعَمْدِ إِنَّمَا عَلَيْهِمْ عَقْلُ قَتْلِ الْخَطَإِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa that his\nfather said, \"The tribe is not obliged to pay blood-money for\nintentional murder. They pay blood-money for accidental killing.\""}},{"id":32,"idInBook":32,"chapterId":43,"bookId":7,"arabic":"وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، أَنَّهُ قَالَ مَضَتِ السُّنَّةُ أَنَّ الْعَاقِلَةَ لاَ تَحْمِلُ شَيْئًا مِنْ دِيَةِ الْعَمْدِ إِلاَّ أَنْ يَشَاءُوا ذَلِكَ ‏.‏ \n وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، مِثْلَ ذَلِكَ ‏.","english":{"narrator":"","text":"Yahya related to me from Malik that Ibn Shihab said, \"The\nprecedent of the sunna is that the tribe are not liable for any blood-\nmoney of an intentional killing unless they wish that.\"\n\n\nYahya\nrelated to me from Malik from Yahya ibn Said the same as that."}},{"id":33,"idInBook":33,"chapterId":43,"bookId":7,"arabic":"قَالَ مَالِكٌ إِنَّ ابْنَ شِهَابٍ قَالَ مَضَتِ السُّنَّةُ فِي قَتْلِ الْعَمْدِ حِينَ يَعْفُو أَوْلِيَاءُ الْمَقْتُولِ أَنَّ الدِّيَةَ تَكُونُ عَلَى الْقَاتِلِ فِي مَالِهِ خَاصَّةً إِلاَّ أَنْ تُعِينَهُ الْعَاقِلَةُ عَنْ طِيبِ نَفْسٍ مِنْهَا ‏.‏ قَالَ مَالِكٌ وَالأَمْرُ عِنْدَنَا أَنَّ الدِّيَةَ لاَ تَجِبُ عَلَى الْعَاقِلَةِ حَتَّى تَبْلُغَ الثُّلُثَ فَصَاعِدًا فَمَا بَلَغَ الثُّلُثَ فَهُوَ عَلَى الْعَاقِلَةِ وَمَا كَانَ دُونَ الثُّلُثِ فَهُوَ فِي مَالِ الْجَارِحِ خَاصَّةً ‏.‏ قَالَ مَالِكٌ الأَمْرُ الَّذِي لاَ اخْتِلاَفَ فِيهِ عِنْدَنَا فِيمَنْ قُبِلَتْ مِنْهُ الدِّيَةُ فِي قَتْلِ الْعَمْدِ أَوْ فِي شَىْءٍ مِنَ الْجِرَاحِ الَّتِي فِيهَا الْقِصَاصُ أَنَّ عَقْلَ ذَلِكَ لاَ يَكُونُ عَلَى الْعَاقِلَةِ إِلاَّ أَنْ يَشَاءُوا وَإِنَّمَا عَقْلُ ذَلِكَ فِي مَالِ الْقَاتِلِ أَوِ الْجَارِحِ خَاصَّةً إِنْ وُجِدَ لَهُ مَالٌ فَإِنْ لَمْ يُوجَدْ لَهُ مَالٌ كَانَ دَيْنًا عَلَيْهِ وَلَيْسَ عَلَى الْعَاقِلَةِ مِنْهُ شَىْءٌ إِلاَّ أَنْ يَشَاءُوا ‏.‏ قَالَ مَالِكٌ وَلاَ تَعْقِلُ الْعَاقِلَةُ أَحَدًا أَصَابَ نَفْسَهُ عَمْدًا أَوْ خَطَأً بِشَىْءٍ وَعَلَى ذَلِكَ رَأْىُ أَهْلِ الْفِقْهِ عِنْدَنَا وَلَمْ أَسْمَعْ أَنَّ أَحَدًا ضَمَّنَ الْعَاقِلَةَ مِنْ دِيَةِ الْعَمْدِ شَيْئًا وَمِمَّا يُعْرَفُ بِهِ ذَلِكَ أَنَّ اللَّهَ تَبَارَكَ وَتَعَالَى قَالَ فِي كِتَابِهِ ‏{‏فَمَنْ عُفِيَ لَهُ مِنْ أَخِيهِ شَىْءٌ فَاتِّبَاعٌ بِالْمَعْرُوفِ وَأَدَاءٌ إِلَيْهِ بِإِحْسَانٍ‏}‏ فَتَفْسِيرُ ذَلِكَ - فِيمَا نُرَى وَاللَّهُ أَعْلَمُ - أَنَّهُ مَنْ أُعْطِيَ مِنْ أَخِيهِ شَىْءٌ مِنَ الْعَقْلِ فَلْيَتْبَعْهُ بِالْمَعْرُوفِ وَلْيُؤَدِّ إِلَيْهِ بِإِحْسَانٍ ‏.‏ قَالَ مَالِكٌ فِي الصَّبِيِّ الَّذِي لاَ مَالَ لَهُ وَالْمَرْأَةِ الَّتِي لاَ مَالَ لَهَا إِذَا جَنَى أَحَدُهُمَا جِنَايَةً دُونَ الثُّلُثِ إِنَّهُ ضَامِنٌ عَلَى الصَّبِيِّ وَالْمَرْأَةِ فِي مَالِهِمَا خَاصَّةً إِنْ كَانَ لَهُمَا مَالٌ أُخِذَ مِنْهُ وَإِلاَّ فَجِنَايَةُ كُلِّ وَاحِدٍ مِنْهُمَا دَيْنٌ عَلَيْهِ لَيْسَ عَلَى الْعَاقِلَةِ مِنْهُ شَىْءٌ وَلاَ يُؤْخَذُ أَبُو الصَّبِيِّ بِعَقْلِ جِنَايَةِ الصَّبِيِّ وَلَيْسَ ذَلِكَ عَلَيْهِ ‏.‏ قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا الَّذِي لاَ اخْتِلاَفَ فِيهِ أَنَّ الْعَبْدَ إِذَا قُتِلَ كَانَتْ فِيهِ الْقِيمَةُ يَوْمَ يُقْتَلُ وَلاَ تَحْمِلُ عَاقِلَةُ قَاتِلِهِ مِنْ قِيمَةِ الْعَبْدِ شَيْئًا قَلَّ أَوْ كَثُرَ وَإِنَّمَا ذَلِكَ عَلَى الَّذِي أَصَابَهُ فِي مَالِهِ خَاصَّةً بَالِغًا مَا بَلَغَ وَإِنْ كَانَتْ قِيمَةُ الْعَبْدِ الدِّيَةَ أَوْ أَكْثَرَ فَذَلِكَ عَلَيْهِ فِي مَالِهِ وَذَلِكَ لأَنَّ الْعَبْدَ سِلْعَةٌ مِنَ السِّلَعِ ‏.‏","english":{"narrator":"","text":"Malik said that Ibn Shihab said, \"The precedent of the sunna in\nthe intentional murder is that when the relatives of the murdered\nperson relinquish retaliation, the blood-money is owed by the murderer\nfrom his own property unless the tribe helps him with it willingly.\"\n\n\nMalik said, \"What is done in our community is that the blood-\nmoney is not obliged against the tribe until it has reached a third of\nthe full amount and upwards. Whatever reaches a third is against the\ntribe, and whatever is below a third, is against the property of the\none who did the injury.\"\n\n\nMalik said, \"The way of doing things\nabout which there is no dispute among us, in the case of someone who\nhas the blood-money accepted from him in intentional murder or in any\ninjury in which there is retaliation, is that that blood-money is not\ndue from the tribe unless they wish it. The blood-money for that is\nfrom the property of the murderer or the injurer if he has property.\nIf he does not have any property, it is a debt against him, and none\nof it is owed by the tribe unless they wish.\"\n\n\nMalik said,\n\"The tribe does not pay blood-money to anyone who injures himself,\nintentionally or accidentally. This is the opinion of the people of\nfiqh in our community. I have not heard that anyone has made the tribe\nliable for any blood-money incurred by intentional acts. Part of what\nis well-known of that is that Allah, the Blessed, and the Exalted,\nsaid in His Book, 'Whoever has something pardoned him by his brother,\nshould follow it with what is accepted and pay it with good will'\n(Sura 2 ayat 178) The commentary on that - in our view - and Allah\nknows best, is that whoever gives his brother something of the blood-\nmoney, should follow it with what is accepted and pay him with good\nwill.\"\n\n\nMalik spoke about a child who had no property and a\nwoman who had no property. He said, \"When one of them causes an injury\nbelow a third of the blood-money, it is taken on behalf of the child\nand woman from their personal property, if they have property from\nwhich it may be taken. If not, the injury which each of them has\ncaused is a debt against them. The tribe does not have to pay any of\nit and the father of a child is not liable for the blood-money of an\ninjury caused by the child and he is not responsible for it.\"\n\n\nMalik said, \"The way of doing things in our community about which\nthere is no dispute, is that when a slave is killed, the value for him\nis that of the day on which he was killed. The tribe of the murderer\nis not liable for any of the value of the slave, great or small. That\nis the responsibility of the one who struck him from his own personal\nproperty as far as it covers. If the value of the slave is the blood-\nmoney or more, that is against him in his property. That is because\nthe slave is a certain type of goods.\""}},{"id":34,"idInBook":34,"chapterId":43,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، نَشَدَ النَّاسَ بِمِنًى مَنْ كَانَ عِنْدَهُ عِلْمٌ مِنَ الدِّيَةِ أَنْ يُخْبِرَنِي ‏.‏ فَقَامَ الضَّحَّاكُ بْنُ سُفْيَانَ الْكِلاَبِيُّ فَقَالَ كَتَبَ إِلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ أُوَرِّثَ امْرَأَةَ أَشْيَمَ الضِّبَابِيِّ مِنْ دِيَةِ زَوْجِهَا ‏.‏ فَقَالَ لَهُ عُمَرُ بْنُ الْخَطَّابِ ادْخُلِ الْخِبَاءَ حَتَّى آتِيَكَ فَلَمَّا نَزَلَ عُمَرُ بْنُ الْخَطَّابِ أَخْبَرَهُ الضَّحَّاكُ فَقَضَى بِذَلِكَ عُمَرُ بْنُ الْخَطَّابِ ‏.‏ قَالَ ابْنُ شِهَابٍ وَكَانَ قَتْلُ أَشْيَمَ خَطَأً ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab that Umar ibn al-\nKhattab demanded of the people at Mina, \"If anyone has knowledge of\nblood-money, let him inform me.\" Ad-Dahhak ibn Sufyan al-Kilabi stood\nup and said, \"The Messenger of Allah, may Allah bless him and grant\nhim peace, wrote to me that the wife of Ashyam ad-Dibabi inherited\nfrom the blood-money of her husband.\" Umar ibn al-Khattab said to him,\n\"Go into the tent until I come to you.\" When Umar ibn al-Khattab came\nin, ad-Dahhak told him about it and Umar ibn al-Khattab gave a\ndecision based on that.\n\n\nIbn Shihab said, \"The killing of\nAshyam was accidental.\""}},{"id":35,"idInBook":35,"chapterId":43,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، أَنَّ رَجُلاً، مِنْ بَنِي مُدْلِجٍ - يُقَالُ لَهُ قَتَادَةُ - حَذَفَ ابْنَهُ بِالسَّيْفِ فَأَصَابَ سَاقَهُ فَنُزِيَ فِي جُرْحِهِ فَمَاتَ فَقَدِمَ سُرَاقَةُ بْنُ جُعْشُمٍ عَلَى عُمَرَ بْنِ الْخَطَّابِ فَذَكَرَ ذَلِكَ لَهُ فَقَالَ لَهُ عُمَرُ اعْدُدْ عَلَى مَاءِ قُدَيْدٍ عِشْرِينَ وَمِائَةَ بَعِيرٍ حَتَّى أَقْدَمَ عَلَيْكَ فَلَمَّا قَدِمَ إِلَيْهِ عُمَرُ بْنُ الْخَطَّابِ أَخَذَ مِنْ تِلْكَ الإِبِلِ ثَلاَثِينَ حِقَّةً وَثَلاَثِينَ جَذَعَةً وَأَرْبَعِينَ خَلِفَةً ثُمَّ قَالَ أَيْنَ أَخُو الْمَقْتُولِ قَالَ هَا أَنَا ذَا ‏.‏ قَالَ خُذْهَا فَإِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لَيْسَ لِقَاتِلٍ شَىْءٌ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me from Yahya ibn Said from Amr ibn Shuayb that\na man of the Banu Mudlij called Qatada threw a sword at his son and it\nstruck his thigh. The wound bled profusely and he died. Suraqa ibn\nJusham came to Umar ibn al-Khattab and mentioned that to him Umar said\nto him, \"At the watering place of Qudayd count one hundred and twenty\ncamels and wait until I come to you.\" When Umar ibn al-Khattab came to\nhim, he took thirty four-year-old camels, thirty five-year-old camels,\nand forty pregnant camels from them. Then he said, \"Where is the\nbrother of the slain man?\" He said, \"Here.\" He said, \"Take them. The\nMessenger of Allah, may Allah bless him and grant him peace, said,\n'The killer gets nothing.' \""}},{"id":36,"idInBook":36,"chapterId":43,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ سَعِيدَ بْنَ الْمُسَيَّبِ، وَسُلَيْمَانَ بْنَ يَسَارٍ، سُئِلاَ أَتُغَلَّظُ الدِّيَةُ فِي الشَّهْرِ الْحَرَامِ فَقَالاَ لاَ وَلَكِنْ يُزَادُ فِيهَا لِلْحُرْمَةِ ‏.‏ فَقِيلَ لِسَعِيدٍ هَلْ يُزَادُ فِي الْجِرَاحِ كَمَا يُزَادُ فِي النَّفْسِ فَقَالَ نَعَمْ ‏.‏ قَالَ مَالِكٌ أُرَاهُمَا أَرَادَا مِثْلَ الَّذِي صَنَعَ عُمَرُ بْنُ الْخَطَّابِ فِي عَقْلِ الْمُدْلِجِيِّ حِينَ أَصَابَ ابْنَهُ ‏.‏","english":{"narrator":"","text":"Malik said that he had heard\nthat Said ibn al-Musayyab and Sulayman ibn Yasar were asked, \"Does one\ndeal more harshly in taking the blood-money in the sacred month?\" They\nsaid, \"No. But it is increased in it because of violating the month.\"\nIt was said to Said, \"Does one increase for the wound as one increases\nfor the life?\" He said, \"Yes.\"\n\n\nMalik added, \"I think that\nthey meant the same as what Umar ibn al-Khattab did with respect to\nthe blood-money of the Mudliji when he struck his son.\" (i.e. giving\n120 camels instead of 100)."}},{"id":37,"idInBook":37,"chapterId":43,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، أَنَّ رَجُلاً، مِنَ الأَنْصَارِ - يُقَالُ لَهُ أُحَيْحَةُ بْنُ الْجُلاَحِ - كَانَ لَهُ عَمٌّ صَغِيرٌ هُوَ أَصْغَرُ مِنْ أُحَيْحَةَ وَكَانَ عِنْدَ أَخْوَالِهِ فَأَخَذَهُ أُحَيْحَةُ فَقَتَلَهُ فَقَالَ أَخْوَالُهُ كُنَّا أَهْلَ ثُمِّهِ وَرُمِّهِ حَتَّى إِذَا اسْتَوَى عَلَى عُمَمِهِ غَلَبَنَا حَقُّ امْرِئٍ فِي عَمِّهِ ‏.‏ قَالَ عُرْوَةُ فَلِذَلِكَ لاَ يَرِثُ قَاتِلٌ مَنْ قَتَلَ ‏.‏ قَالَ مَالِكٌ الأَمْرُ الَّذِي لاَ اخْتِلاَفَ فِيهِ عِنْدَنَا أَنَّ قَاتِلَ الْعَمْدِ لاَ يَرِثُ مِنْ دِيَةِ مَنْ قَتَلَ شَيْئًا وَلاَ مِنْ مَالِهِ وَلاَ يَحْجُبُ أَحَدًا وَقَعَ لَهُ مِيرَاثٌ وَأَنَّ الَّذِي يَقْتُلُ خَطَأً لاَ يَرِثُ مِنَ الدِّيَةِ شَيْئًا وَقَدِ اخْتُلِفَ فِي أَنْ يَرِثَ مِنْ مَالِهِ لأَنَّهُ لاَ يُتَّهَمُ عَلَى أَنَّهُ قَتَلَهُ لِيَرِثَهُ وَلِيَأْخُذَ مَالَهُ فَأَحَبُّ إِلَىَّ أَنْ يَرِثَ مِنْ مَالِهِ وَلاَ يَرِثُ مِنْ دِيَتِهِ ‏.‏","english":{"narrator":"","text":"11 Malik related to me from Yahya ibn Said from Urwa ibn az-\nZubayr that a man of the Ansar called Uhayha ibn al-Julah had a young\npaternal uncle who was younger than him and who was living with his\nmaternal uncles. Uhayha took him and killed him. His maternal uncles\nsaid, \"We brought him up from a baby to a youth till he stood firm on\nhis feet, and we have had the right of a man taken from us by his\npaternal uncle.\" Urwa said, \"For that reason a killer does not inherit\nfrom the one he killed.\"\n\n\nMalik said, \"The way of doing things\nabout which there is no dispute is that the intentional murderer does\nnot inherit anything of the blood-money of the person he has murdered\nor any of his property. He does not stop anyone who has a share of\ninheritance from inheriting. The one who kills accidentally does not\ninherit anything of the blood-money and there is dispute as to whether\nor not he inherits from the dead person's property because there is no\nsuspicion that he killed him for his inheritance and in order to take\nhis property. I prefer that he inherit from the dead person's property\nand not inherit from the blood-money.\""}},{"id":38,"idInBook":38,"chapterId":43,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، وَأَبِي، سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ جَرْحُ الْعَجْمَاءِ جُبَارٌ وَالْبِئْرُ جُبَارٌ وَالْمَعْدِنُ جُبَارٌ وَفِي الرِّكَازِ الْخُمُسُ ‏\"‏ ‏.‏","english":{"narrator":"Yahya related to me from Malik from Ibn Shihab from Said ibn al-\nMusayyab and Abu Salama ibn Abd ar-Rahman from Abu Hurayra that the\nMessenger of Allah, may Allah bless him and grant him peace, said,\n\"The wound of an animal is of no account and no compensation is due\nfor it. The well is of no account and no compensation is due for it.\nThe mine is of no account and no compensation is due for it and a\nfifth is due for buried treasures.\" (Al-kanz:","text":"see Book 17).\n\n\nMalik said, \"Everyone leading an animal by the halter, driving it, and\nriding it is responsible for what the animal strikes unless the animal\nkicks out without anything being done to it to make it kick out. Umar\nibn al-Khattab imposed the blood-money on a person who was exercising\nhis horse.\"\n\n\nMalik said, \"It is more fitting that a person\nleading an animal by the halter, driving it, or riding it incur a loss\nthan a person who is exercising his horse.\" (See hadith 4 of this\nbook).\n\n\nMalik said, \"What is done in our community about a\nperson who digs a well on a road or ties up an animal or does the like\nof that on a road used by muslims, is that since what he has done is\nincluded in that which he is not permitted to do in such a place, he\nis liable for whatever injury or other thing arises from that action.\nThe blood-money of that which is less than a third of the full blood-\nmoney is owed from his own personal property. Whatever reaches a third\nor more, is owed by his tribe. Any such things that he does which he\nis permitted to do on the muslims' road are something for which he has\nno liability or loss. Part of that is a hole which a man digs to\ncollect rain, and the beast from which the man alights for some need\nand leaves standing on the road. There is no penalty against anyone\nfor this.\"\n\n\nMalik spoke about a man who went down a well, and\nanother man followed behind him, and the lower one pulled the higher\none and they fell into the well and both died He said, \"The tribe of\nthe one who pulled him in is responsible for the blood-money.\"\n\n\nMalik spoke about a child whom a man ordered to go down into a\nwell or to climb a palm tree and he died as a result. He said, \"The\none who ordered him is liable for whatever befalls him, be it death or\nsomething else.\"\n\n\nMalik said, \"The way of doing things in our\ncommunity about which there is no dispute is that women and children\nare not obliged to pay blood-money together with the tribe in the\nblood-moneys which the tribe must pay. The blood-money is only\nobligatory for a man who has reached puberty.\"\n\n\nMalik said\nthat the tribe could bind themselves to the blood-money of mawali if\nthey wished. If they refused, they were people of the diwan or were\ncut off from their people. In the time of the Messenger of Allah, may\nAllah bless him and grant him peace, people paid the blood-money to\neach other as well as in the time of Abu Bakr as-Siddiq before there\nwas a diwan. The diwan was in the time of Umar ibn al-Khattab. No one\nother than one's people and the ones holding the wala' paid blood-\nmoney for one because the wala' was not transferable and because the\nProphet, may Allah bless him and grant him peace, said, \"The wala'\nbelongs to the one who sets free.\"\n\n\nMalik said, \"The wala' is\nan established relationship.\"\n\n\nMalik said, \"What is done in\nour community about animals that are injured is that the person who\ncauses the injury pays whatever of their value has been diminished.\"\n\n\nMalik said about a man condemned to death and one of the\nother hudud befell him, \"He is not punished for it. That is because\nthe killing overrides all of that, except for slander. The slander\nremains hanging over the one to whom it was said because it will be\nsaid to him, 'Why do you not flog the one who slandered you?' I think\nthat the condemned man is flogged with the hadd before he is killed,\nand then he is killed. I do not think that any retaliation is\ninflicted on him for any injury except killing because killing\noverrides all of that.\"\n\n\nMalik said, \"What is done in our\ncommunity is that when a murdered person is found among the main body\nof a people in a village or other place, the house or place of the\nnearest people to him is not responsible. That is because the murdered\nperson can be slain and then cast at the door of some people to shame\nthem by it. No one is responsible for the like of that.\"\n\n\nMalik said about a group of people who fight with each other and when\nthe fight is broken up, a man is found dead or wounded, and it is not\nknown who did it, \"The best of what is heard about that is that there\nis blood-money for him, and the blood-money is against the people who\nargued with him. If the injured or slain person is not from either of\nthe two parties, his blood-money is against both of the two parties\ntogether.\""}},{"id":39,"idInBook":39,"chapterId":43,"bookId":7,"arabic":"وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَتَلَ نَفَرًا خَمْسَةً أَوْ سَبْعَةً بِرَجُلٍ وَاحِدٍ قَتَلُوهُ قَتْلَ غِيلَةٍ وَقَالَ عُمَرُ لَوْ تَمَالأَ عَلَيْهِ أَهْلُ صَنْعَاءَ لَقَتَلْتُهُمْ جَمِيعًا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said from Said ibn\nal-Musayyab that Umar ibn al-Khattab killed five or seven people for\none man whom they had killed secretly by trickery. Umar said, \"Had all\nthe people of Sana joined forces against him, I would have killed them\nall.\""}},{"id":40,"idInBook":40,"chapterId":43,"bookId":7,"arabic":"وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ سَعْدِ بْنِ زُرَارَةَ، أَنَّهُ بَلَغَهُ أَنَّ حَفْصَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَتَلَتْ جَارِيَةً لَهَا سَحَرَتْهَا وَقَدْ كَانَتْ دَبَّرَتْهَا فَأَمَرَتْ بِهَا فَقُتِلَتْ ‏.‏ قَالَ مَالِكٌ السَّاحِرُ الَّذِي يَعْمَلُ السِّحْرَ وَلَمْ يَعْمَلْ ذَلِكَ لَهُ غَيْرُهُ هُوَ مَثَلُ الَّذِي قَالَ اللَّهُ تَبَارَكَ وَتَعَالَى فِي كِتَابِهِ ‏{‏وَلَقَدْ عَلِمُوا لَمَنِ اشْتَرَاهُ مَا لَهُ فِي الآخِرَةِ مِنْ خَلاَقٍ‏}‏ فَأَرَى أَنْ يُقْتَلَ ذَلِكَ إِذَا عَمِلَ ذَلِكَ هُوَ نَفْسُهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Muhammad ibn Abd ar-Rahman\nibn Sad ibn Zurara that he had heard that Hafsa, the wife of the\nProphet, may Allah bless him and grant him peace, killed one of  her\nslave-girls who had used sorcery against her. She was a mudabbara.\nHafsa gave the order, and she was killed.\n\n\nMalik said, \"The\nsorcerer is the one who uses sorcery for himself and no one else uses\nthat for him. It is like the one about whom Allah, the Blessed, the\nExalted, said in His Book, 'They know the one who devotes himself to\nit will have no share in the Next World.' (Sura 2 ayat 102) I think\nthat that person is killed if he does that himself.\""}},{"id":41,"idInBook":41,"chapterId":43,"bookId":7,"arabic":"وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عُمَرَ بْنِ حُسَيْنٍ، مَوْلَى عَائِشَةَ بِنْتِ قُدَامَةَ أَنَّ عَبْدَ الْمَلِكِ بْنَ مَرْوَانَ، أَقَادَ وَلِيَّ رَجُلٍ مِنْ رَجُلٍ قَتَلَهُ بِعَصًا فَقَتَلَهُ وَلِيُّهُ بِعَصًا ‏.‏ قَالَ مَالِكٌ وَالأَمْرُ الْمُجْتَمَعُ عَلَيْهِ الَّذِي لاَ اخْتِلاَفَ فِيهِ عِنْدَنَا أَنَّ الرَّجُلَ إِذَا ضَرَبَ الرَّجُلَ بِعَصًا أَوْ رَمَاهُ بِحَجَرٍ أَوْ ضَرَبَهُ عَمْدًا فَمَاتَ مِنْ ذَلِكَ فَإِنَّ ذَلِكَ هُوَ الْعَمْدُ وَفِيهِ الْقِصَاصُ ‏.‏ قَالَ مَالِكٌ فَقَتْلُ الْعَمْدِ عِنْدَنَا أَنْ يَعْمِدَ الرَّجُلُ إِلَى الرَّجُلِ فَيَضْرِبَهُ حَتَّى تَفِيظَ نَفْسُهُ وَمِنَ الْعَمْدِ أَيْضًا أَنْ يَضْرِبَ الرَّجُلُ الرَّجُلَ فِي النَّائِرَةِ تَكُونُ بَيْنَهُمَا ثُمَّ يَنْصَرِفُ عَنْهُ وَهُوَ حَىٌّ فَيُنْزَى فِي ضَرْبِهِ فَيَمُوتُ فَتَكُونُ فِي ذَلِكَ الْقَسَامَةُ ‏.‏ قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا أَنَّهُ يُقْتَلُ فِي الْعَمْدِ الرِّجَالُ الأَحْرَارُ بِالرَّجُلِ الْحُرِّ الْوَاحِدِ وَالنِّسَاءُ بِالْمَرْأَةِ كَذَلِكَ وَالْعَبِيدُ بِالْعَبْدِ كَذَلِكَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Umar ibn Husayn, the mawla of\nA'isha bint Qudama, that Abd al-Malik ibn Marwan imposed retaliation\nagainst a man who killed a mawla with a stick and so the mawla's\npatron killed the man with a stick.\n\n\nMalik said, \"The\ngenerally agreed on way of doing things in our community about which\nthere is no dispute is that when a man strikes another man with a\nstick or hits him with a rock or intentionally strikes him causing his\ndeath, that is an intentional injury and there is retaliation for it.\"\n\n\nMalik said, \"Intentional murder with us is that a man\nintentionally goes to a man and strikes him until his life goes. Part\nof intentional injury also is that a man strikes a man in a quarrel\nbetween them. He leaves him while he is alive, and he bleeds to death\nand so dies. There is retaliation for that.\"\n\n\nMalik said,\n\"What is done in our community is that a group of free men are killed\nfor the intentional murder of one free man, and a group of women for\none woman, and a group of slaves for one slave.\""}},{"id":42,"idInBook":42,"chapterId":43,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ مَرْوَانَ بْنَ الْحَكَمِ، كَتَبَ إِلَى مُعَاوِيَةَ بْنِ أَبِي سُفْيَانَ يَذْكُرُ أَنَّهُ أُتِيَ بِسَكْرَانَ قَدْ قَتَلَ رَجُلاً فَكَتَبَ إِلَيْهِ مُعَاوِيَةُ أَنِ اقْتُلْهُ بِهِ ‏.‏ قَالَ يَحْيَى قَالَ مَالِكٌ أَحْسَنُ مَا سَمِعْتُ فِي تَأْوِيلِ هَذِهِ الآيَةِ قَوْلِ اللَّهِ تَبَارَكَ وَتَعَالَى ‏{‏الْحُرُّ بِالْحُرِّ وَالْعَبْدُ بِالْعَبْدِ ‏}‏ فَهَؤُلاَءِ الذُّكُورُ ‏{‏وَالأُنْثَى بِالأُنْثَى‏}‏ أَنَّ الْقِصَاصَ يَكُونُ بَيْنَ الإِنَاثِ كَمَا يَكُونُ بَيْنَ الذُّكُورِ وَالْمَرْأَةُ الْحُرَّةُ تُقْتَلُ بِالْمَرْأَةِ الْحُرَّةِ كَمَا يُقْتَلُ الْحُرُّ بِالْحُرِّ وَالأَمَةُ تُقْتَلُ بِالأَمَةِ كَمَا يُقْتَلُ الْعَبْدُ بِالْعَبْدِ وَالْقِصَاصُ يَكُونُ بَيْنَ النِّسَاءِ كَمَا يَكُونُ بَيْنَ الرِّجَالِ وَالْقِصَاصُ أَيْضًا يَكُونُ بَيْنَ الرِّجَالِ وَالنِّسَاءِ وَذَلِكَ أَنَّ اللَّهَ تَبَارَكَ وَتَعَالَى قَالَ فِي كِتَابِهِ ‏{‏وَكَتَبْنَا عَلَيْهِمْ فِيهَا أَنَّ النَّفْسَ بِالنَّفْسِ وَالْعَيْنَ بِالْعَيْنِ وَالأَنْفَ بِالأَنْفِ وَالأُذُنَ بِالأُذُنِ وَالسِّنَّ بِالسِّنِّ وَالْجُرُوحَ قِصَاصٌ ‏}‏ فَذَكَرَ اللَّهُ تَبَارَكَ وَتَعَالَى أَنَّ النَّفْسَ بِالنَّفْسِ فَنَفْسُ الْمَرْأَةِ الْحُرَّةِ بِنَفْسِ الرَّجُلِ الْحُرِّ وَجُرْحُهَا بِجُرْحِهِ ‏.‏ قَالَ مَالِكٌ فِي الرَّجُلِ يُمْسِكُ الرَّجُلَ لِلرَّجُلِ فَيَضْرِبُهُ فَيَمُوتُ مَكَانَهُ أَنَّهُ إِنْ أَمْسَكَهُ وَهُوَ يَرَى أَنَّهُ يُرِيدُ قَتْلَهُ قُتِلاَ بِهِ جَمِيعًا وَإِنْ أَمْسَكَهُ وَهُوَ يَرَى أَنَّهُ إِنَّمَا يُرِيدُ الضَّرْبَ مِمَّا يَضْرِبُ بِهِ النَّاسُ لاَ يَرَى أَنَّهُ عَمَدَ لِقَتْلِهِ فَإِنَّهُ يُقْتَلُ الْقَاتِلُ وَيُعَاقَبُ الْمُمْسِكُ أَشَدَّ الْعُقُوبَةِ وَيُسْجَنُ سَنَةً لأَنَّهُ أَمْسَكَهُ وَلاَ يَكُونُ عَلَيْهِ الْقَتْلُ ‏.‏ قَالَ مَالِكٌ فِي الرَّجُلِ يَقْتُلُ الرَّجُلَ عَمْدًا أَوْ يَفْقَأُ عَيْنَهُ عَمْدًا فَيُقْتَلُ الْقَاتِلُ أَوْ تُفْقَأُ عَيْنُ الْفَاقِئِ","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Marwan ibn\nal-Hakam wrote to Muawiya ibn Abi Sufyan to mention to him that a\ndrunkard was brought to him who had killed a man. Muawiya wrote to him\nto kill him in retaliation for the dead man.\n\n\nYahya said that\nMalik said, \"The best of what I have heard on the interpretation of\nthis ayat, the word of Allah, the Blessed, the Exalted, 'The free man\nfor the free man and the slave for the slave - these are men and the\nwoman for the woman,' (Sura 2 ayat 178) is that retaliation is between\nwomen as it is between men. The free woman is killed for the free\nwoman as the free man is killed for the free man. The slave-girl is\nslain for the slave-girl as the slave is slain for the slave.\nRetaliation is between women as it is between men. That is because\nAllah, the Blessed, the Exalted, said in His Book, 'We have written\nfor them in it that it is a life for a life and an eye for an eye, a\nnose for a nose, and an ear for an ear, and a tooth for a tooth, and\nfor wounds there is retaliation.' (Sura 5 ayat 48) Allah, the Blessed,\nthe Exalted, mentioned that it is a life for a life. It is the life of\na free woman for the life of a free man, and her injury for his\ninjury.\"\n\n\nMalik said about a man who held a man fast for\nanother man to hit, and he died on the spot, \"If he held him and he\nthought that he meant to kill him, the two of them are both killed for\nhim. If he held him and he thought that he meant to beat him as people\nsometimes do, and he did not think that he meant to kill him, the\nmurderer is slain and the one who held him is punished with a very\nsevere punishment and jailed for a year. There is no killing against\nhim.\"\n\n\nMalik said about a man who murdered a man intentionally\nor gouged out his eye intentionally, and then was slain or had his eye\ngouged out himself before retaliation was inflicted on him, \"There is\nno blood-money nor retaliation against him. The right of the one who\nwas killed or had his eye gouged out goes when the thing which he is\nclaiming as retaliation goes. It is the same with a man who murders\nanother man intentionally and then the murderer dies. When the\nmurderer dies, the one seeking blood-revenge has nothing of blood-\nmoney or anything else. That is by the word of Allah, the Blessed the\nExalted, 'Retaliation is written for you in killing. The free man for\nthe free man and the slave for the slave.' \"\n\n\nMalik said, \"He\nonly has retaliation against the one who killed him. If the man who\nmurdered him dies, he has no retaliation or blood-money.\"\n\n\nMalik said, \"There is no retaliation held against a free man by a\nslave for any injury. The slave is killed for the free man when he\nintentionally murders him. The free man is not slain for the slave,\neven if he murders him intentionally. It is the best of what I have\nheard.\""}},{"id":43,"idInBook":43,"chapterId":43,"bookId":7,"arabic":"وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ أَبَا بَكْرِ بْنَ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، أَقَادَ مِنْ كَسْرِ الْفَخِذِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he saw whomever he was\nsatisfied with among the people of knowledge say about a man who\nwilled that his murderer be pardoned when he murdered him\nintentionally, \"That is permitted for him. He is more entitled to the\nman's blood than any of his relatives after him.\"\n\n\nMalik said\nabout a man who pardoned murder, after he had claimed his right and it\nwas obliged for him, \"There is no blood-money against the murderer\nunless the one who pardons him stipulates that when he pardons him.\"\n\n\nMalik said about the murderer when he was pardoned, \"He is\nflogged one hundred lashes and jailed for a year.\"\n\n\nMalik\nsaid, \"When a man murders intentionally and there is a clear proof of\nthat, and the murdered man has sons and daughters and the sons pardon\nand the daughters refuse to pardon, the pardon of the sons is\npermitted in opposition to the daughters and there is no authority for\nthe daughters with the sons in demanding blood and pardoning.\""}},{"id":44,"idInBook":44,"chapterId":43,"bookId":7,"arabic":"","english":{"narrator":"","text":"Yahya said that Malik said, \"The generally agreed on way of doing\nthings in our community is that retaliation is taken from someone who\nbreaks someone's hand or foot intentionally and not blood-money.\"\n\n\nMalik said, \"Retaliation is not inflicted on anyone until the\nwound of the injured party has healed. Then retaliation is inflicted\non him. If the wound of the person on whom the retaliation has been\ninflicted is like the first person's wound when it heals, it is\nretaliation. If the wound of the one on whom the retaliation has been\ninflicted becomes worse or he dies, there is nothing held against the\none who has taken retaliation. If the wound of the person on whom the\nretaliation has been inflicted heals and the injured party is\nparalysed or his injury has healed but he has a scar, defect, or\nblemish, the person on whom the retaliation has been inflicted does\nnot have his hand broken again and further retaliation is not taken\nfor his injury.\"\n\n\nHe said, \"But there is blood-money from him\naccording to what he has impaired or maimed of the hand of the injured\nparty. The bodily injury is also like that.\"\n\n\nMalik said,\n\"When a man intentionally goes to his wife and gouges out her eye or\nbreaks her hand or cuts off her finger or such like, and does it\nintentionally, retaliation is inflicted on him. As for a man who\nstrikes his wife with a rope or a whip and hits what he did not mean\nto hit or does what he did not intend to do, he pays blood-money for\nwhat he has struck according to this principle, and retaliation is not\ninflicted on him.\" \n\n\nYahya related to me from Malik that he\nhad heard that Abu Bakr ibn Muhammd ibn Amr ibn Hazm took retaliation\nfor the breaking of a leg."}},{"id":45,"idInBook":45,"chapterId":43,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، أَنَّ سَائِبَةً، أَعْتَقَهُ بَعْضُ الْحُجَّاجِ فَقَتَلَ ابْنَ رَجُلٍ مِنْ بَنِي عَائِذٍ فَجَاءَ الْعَائِذِيُّ أَبُو الْمَقْتُولِ إِلَى عُمَرَ بْنِ الْخَطَّابِ يَطْلُبُ دِيَةَ ابْنِهِ فَقَالَ عُمَرُ لاَ دِيَةَ لَهُ ‏.‏ فَقَالَ الْعَائِذِيُّ أَرَأَيْتَ لَوْ قَتَلَهُ ابْنِي فَقَالَ عُمَرُ إِذًا تُخْرِجُونَ دِيَتَهُ فَقَالَ هُوَ إِذًا كَالأَرْقَمِ إِنْ يُتْرَكْ يَلْقَمْ وَإِنْ يُقْتَلْ يَنْقَمْ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'z-Zinad from Sulayman ibn\nYasar that a slave was set free by one of the people on hajj and his\nmaster had abandoned the right to inherit from him. The ex-slave then\nkilled a man from the Banu A'idh tribe. An A'idhi, the father of the\nslain man came to Umar ibn al-Khattab seeking the blood-money of his\nson. Umar said, \"He has no blood-money.\" The A'idhi said, \"What would\nyou think if it had been my son who killed him?\" Umar said, \"Then you\nwould pay his blood-money.\" He said, \"He is then like the black and\nwhite Arqam snake. If it is left, it devours and if it is killed, it\ntakes revenge.\""}}],"chapter":{"id":43,"bookId":7,"arabic":"كتاب العقول","english":"Blood-Money"}}