{"metadata":{"length":6,"arabic":{"title":"موطأ مالك","author":"الإمام مالك بن أنس","introduction":"كتاب القسامة"},"english":{"title":"Muwatta Malik","author":"Imam Malik ibn Anas","introduction":"The Oath of Qasama"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":44,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي لَيْلَى بْنِ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ سَهْلٍ، عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ، أَنَّهُ أَخْبَرَهُ رِجَالٌ، مِنْ كُبَرَاءِ قَوْمِهِ أَنَّ عَبْدَ، اللَّهِ بْنَ سَهْلٍ وَمُحَيِّصَةَ خَرَجَا إِلَى خَيْبَرَ مِنْ جَهْدٍ أَصَابَهُمْ فَأُتِيَ مُحَيِّصَةُ فَأُخْبِرَ أَنَّ عَبْدَ اللَّهِ بْنَ سَهْلٍ قَدْ قُتِلَ وَطُرِحَ فِي فَقِيرِ بِئْرٍ أَوْ عَيْنٍ فَأَتَى يَهُودَ فَقَالَ أَنْتُمْ وَاللَّهِ قَتَلْتُمُوهُ ‏.‏ فَقَالُوا وَاللَّهِ مَا قَتَلْنَاهُ ‏.‏ فَأَقْبَلَ حَتَّى قَدِمَ عَلَى قَوْمِهِ فَذَكَرَ لَهُمْ ذَلِكَ ثُمَّ أَقْبَلَ هُوَ وَأَخُوهُ حُوَيِّصَةُ وَهُوَ أَكْبَرُ مِنْهُ وَعَبْدُ الرَّحْمَنِ فَذَهَبَ مُحَيِّصَةُ لِيَتَكَلَّمَ وَهُوَ الَّذِي كَانَ بِخَيْبَرَ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ كَبِّرْ كَبِّرْ ‏\"‏ يُرِيدُ السِّنَّ فَتَكَلَّمَ حُوَيِّصَةُ ثُمَّ تَكَلَّمَ مُحَيِّصَةُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِمَّا أَنْ يَدُوا صَاحِبَكُمْ وَإِمَّا أَنْ يُؤْذِنُوا بِحَرْبٍ ‏\"‏ ‏.‏ فَكَتَبَ إِلَيْهِمْ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي ذَلِكَ فَكَتَبُوا إِنَّا وَاللَّهِ مَا قَتَلْنَاهُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِحُوَيِّصَةَ وَمُحَيِّصَةَ وَعَبْدِ الرَّحْمَنِ ‏\"‏ أَتَحْلِفُونَ وَتَسْتَحِقُّونَ دَمَ صَاحِبِكُمْ ‏\"‏ ‏.‏ فَقَالُوا لاَ ‏.‏ قَالَ ‏\"‏ أَفَتَحْلِفُ لَكُمْ يَهُودُ ‏\"‏ قَالُوا لَيْسُوا بِمُسْلِمِينَ ‏.‏ فَوَدَاهُ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ عِنْدِهِ فَبَعَثَ إِلَيْهِمْ بِمِائَةِ نَاقَةٍ حَتَّى أُدْخِلَتْ عَلَيْهِمُ الدَّارَ ‏.‏ قَالَ سَهْلٌ لَقَدْ رَكَضَتْنِي مِنْهَا نَاقَةٌ حَمْرَاءُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu Layla ibn Abdullah ibn\nAbd ar-Rahman ibn Sahl from Sahl ibn Abi Hathma that some of the great\nmen of his people informed him that Abdullah ibn Sahl and Muhayyisa\nwent out to Khaybar because extreme poverty had overtaken them.\nMuhayyisa returned and said that Abdullah ibn Sahl had been killed and\nthrown in a shallow well or spring. The jews came and he said, \"By\nAllah! You have killed him.\" They said, \"By Allah! We have not killed\nhim!\" Then he made for his people and mentioned that to them. Then he,\nhis brother Huwayyisa, who was older than him, and Abd ar-Rahman, set\nout. Muhayyisa began to speak, as he had been at Khaybar. The\nMessenger of Allah, may Allah bless him and grant him peace, said to\nhim, \"The greater first, the greater first,\" meaning in age. So\nHuwayyisa spoke and then Muhayyisa spoke. The Messenger of Allah, may\nAllah bless him and grant him peace, said, \"Either they pay your\ncompanion's blood-money or we will declare war against them.\" The\nMessenger of Allah, may Allah bless him and grant him peace, wrote\nthat to them and they wrote, \"By Allah, we did not kill him!\" The\nMessenger of Allah, may Allah bless him and grant him peace, said to\nHuwayyisa, Muhayyisa, and Abd ar-Rahman, \"Do you swear and claim the\nblood of your companion?\" They said, \"No.\" He said, \"Shall the jews\nswear to you?\" They said, \"But they are not muslims.\" The Messenger of\nAllah, may Allah bless him and grant him peace, gave blood-money from\nhis own property, and sent them one hundred camels to their house.\n\n\nSahl added, \"A red camel among them kicked me.\""}},{"id":2,"idInBook":2,"chapterId":44,"bookId":7,"arabic":"قَالَ يَحْيَى عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ بُشَيْرِ بْنِ يَسَارٍ، أَنَّهُ أَخْبَرَهُ أَنَّ عَبْدَ اللَّهِ بْنَ سَهْلٍ الأَنْصَارِيَّ وَمُحَيِّصَةَ بْنَ مَسْعُودٍ خَرَجَا إِلَى خَيْبَرَ فَتَفَرَّقَا فِي حَوَائِجِهِمَا فَقُتِلَ عَبْدُ اللَّهِ بْنُ سَهْلٍ فَقَدِمَ مُحَيِّصَةُ فَأَتَى هُوَ وَأَخُوهُ حُوَيِّصَةُ وَعَبْدُ الرَّحْمَنِ بْنُ سَهْلٍ إِلَى النَّبِيِّ صلى الله عليه وسلم فَذَهَبَ عَبْدُ الرَّحْمَنِ لِيَتَكَلَّمَ لِمَكَانِهِ مِنْ أَخِيهِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ كَبِّرْ كَبِّرْ ‏\"‏ ‏.‏ فَتَكَلَّمَ حُوَيِّصَةُ وَمُحَيِّصَةُ فَذَكَرَا شَأْنَ عَبْدِ اللَّهِ بْنِ سَهْلٍ ‏.‏ فَقَالَ لَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَتَحْلِفُونَ خَمْسِينَ يَمِينًا وَتَسْتَحِقُّونَ دَمَ صَاحِبِكُمْ أَوْ قَاتِلِكُمْ ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ لَمْ نَشْهَدْ وَلَمْ نَحْضُرْ ‏.‏ فَقَالَ لَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَتُبْرِئُكُمْ يَهُودُ بِخَمْسِينَ يَمِينًا ‏\"‏ ‏.‏ فَقَالُوا يَا رَسُولَ اللَّهِ كَيْفَ نَقْبَلُ أَيْمَانَ قَوْمٍ كُفَّارٍ قَالَ يَحْيَى بْنُ سَعِيدٍ فَزَعَمَ بُشَيْرُ بْنُ يَسَارٍ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم وَدَاهُ مِنْ عِنْدِهِ ‏.‏ قَالَ مَالِكٌ الأَمْرُ الْمُجْتَمَعُ عَلَيْهِ عِنْدَنَا وَالَّذِي سَمِعْتُ مِمَّنْ أَرْضَى فِي الْقَسَامَةِ وَالَّذِي اجْتَمَعَتْ عَلَيْهِ الأَئِمَّةُ فِي الْقَدِيمِ وَالْحَدِيثِ أَنْ يَبْدَأَ بِالأَيْمَانِ الْمُدَّعُونَ فِي الْقَسَامَةِ فَيَحْلِفُونَ وَأَنَّ الْقَسَامَةَ لاَ تَجِبُ إِلاَّ بِأَحَدِ أَمْرَيْنِ إِمَّا أَنْ يَقُولَ الْمَقْتُولُ دَمِي عِنْدَ فُلاَنٍ أَوْ يَأْتِيَ وُلاَةُ الدَّمِ بِلَوْثٍ مِنْ بَيِّنَةٍ وَإِنْ لَمْ تَكُنْ قَاطِعَةً عَلَى الَّذِي يُدَّعَى عَلَيْهِ الدَّمُ فَهَذَا يُوجِبُ الْقَسَامَةَ لِلْمُدَّعِينَ الدَّمَ عَلَى مَنِ ادَّعَوْهُ عَلَيْهِ وَلاَ تَجِبُ الْقَسَامَةُ عِنْدَنَا إِلاَّ بِأَحَدِ هَذَيْنِ الْوَجْهَيْنِ ‏.‏ قَالَ مَالِكٌ وَتِلْكَ السُّنَّةُ الَّتِي لاَ اخْتِلاَفَ فِيهَا عِنْدَنَا وَالَّذِي لَمْ يَزَلْ عَلَيْهِ عَمَلُ النَّاسِ أَنَّ الْمُبَدَّئِينَ بِالْقَسَامَةِ أَهْلُ الدَّمِ وَالَّذِينَ يَدَّعُونَهُ فِي الْعَمْدِ وَالْخَطَإِ ‏.‏ قَالَ مَالِكٌ وَقَدْ بَدَّأَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْحَارِثِيِّينَ فِي قَتْلِ صَاحِبِهِمُ الَّذِي قُتِلَ بِخَيْبَرَ ‏.‏ قَالَ مَالِكٌ فَإِنْ حَلَفَ الْمُدَّعُونَ اسْتَحَقُّوا دَمَ صَاحِبِهِمْ وَقَتَلُوا مَنْ حَلَفُوا عَلَيْهِ وَلاَ يُقْتَلُ فِي الْقَسَامَةِ إِلاَّ وَاحِدٌ لاَ يُقْتَلُ فِيهَا اثْنَانِ يَحْلِفُ مِنْ وُلاَةِ الدَّمِ خَمْسُونَ رَجُلاً خَمْسِينَ يَمِينًا فَإِنْ قَلَّ عَدَدُهُمْ أَوْ نَكَلَ بَعْضُهُمْ رُدَّتِ الأَيْمَانُ عَلَيْهِمْ إِلاَّ أَنْ يَنْكُلَ أَحَدٌ مِنْ وُلاَةِ الْمَقْتُولِ وُلاَةِ الدَّمِ الَّذِينَ يَجُوزُ لَهُمُ الْعَفْوُ عَنْهُ فَإِنْ نَكَلَ أَحَدٌ مِنْ أُولَئِكَ فَلاَ سَبِيلَ إِلَى الدَّمِ إِذَا نَكَلَ أَحَدٌ مِنْهُمْ ‏.‏ قَالَ يَحْيَى قَالَ مَالِكٌ وَإِنَّمَا تُرَدُّ الأَيْمَانُ عَلَى مَنْ بَقِيَ مِنْهُمْ إِذَا نَكَلَ أَحَدٌ مِمَّنْ لاَ يَجُوزُ لَهُ عَفْوٌ فَإِنْ نَكَلَ أَحَدٌ مِنْ وُلاَةِ الدَّمِ الَّذِينَ يَجُوزُ لَهُمُ الْعَفْوُ عَنِ الدَّمِ وَإِنْ كَانَ وَاحِدًا فَإِنَّ الأَيْمَانَ لاَ تُرَدُّ عَلَى مَنْ بَقِيَ مِنْ وُلاَةِ الدَّمِ إِذَا نَكَلَ أَحَدٌ مِنْهُمْ عَنِ الأَيْمَانِ وَلَكِنِ الأَيْمَانُ إِذَا كَانَ ذَلِكَ تُرَدُّ عَلَى الْمُدَّعَى عَلَيْهِمْ فَيَحْلِفُ مِنْهُمْ خَمْسُونَ رَجُلاً خَمْسِينَ يَمِينًا فَإِنْ لَمْ يَبْلُغُوا خَمْسِينَ رَجُلاً رُدَّتِ الأَيْمَانُ عَلَى مَنْ حَلَفَ مِنْهُمْ فَإِنْ لَمْ يُوجَدْ أَحَدٌ إِلاَّ الَّذِي ادُّعِيَ عَلَيْهِ حَلَفَ هُوَ خَمْسِينَ يَمِينًا وَبَرِئَ ‏.‏ قَالَ يَحْيَى قَالَ مَالِكٌ وَإِنَّمَا فُرِقَ بَيْنَ الْقَسَامَةِ فِي الدَّمِ وَالأَيْمَانِ فِي الْحُقُوقِ أَنَّ الرَّجُلَ إِذَا دَايَنَ الرَّجُلَ اسْتَثْبَتَ عَلَيْهِ فِي حَقِّهِ وَأَنَّ الرَّجُلَ إِذَا أَرَادَ قَتْلَ الرَّجُلِ لَمْ يَقْتُلْهُ فِي جَمَاعَةٍ مِنَ النَّاسِ وَإِنَّمَا يَلْتَمِسُ الْخَلْوَةَ ‏.‏ قَالَ فَلَوْ لَمْ تَكُنِ الْقَسَامَةُ إِلاَّ فِيمَا تَثْبُتُ فِيهِ الْبَيِّنَةُ وَلَوْ عُمِلَ فِيهَا كَمَا يُعْمَلُ فِي الْحُقُوقِ هَلَكَتِ الدِّمَاءُ وَاجْتَرَأَ النَّاسُ عَلَيْهَا إِذَا عَرَفُوا الْقَضَاءَ فِيهَا وَلَكِنْ إِنَّمَا جُعِلَتِ الْقَسَامَةُ إِلَى وُلاَةِ الْمَقْتُولِ يُبَدَّءُونَ بِهَا فِيهَا لِيَكُفَّ النَّاسُ عَنِ الدَّمِ وَلِيَحْذَرَ الْقَاتِلُ أَنْ يُؤْخَذَ فِي مِثْلِ ذَلِكَ بِقَوْلِ الْمَقْتُولِ ‏.‏ قَالَ يَحْيَى وَقَدْ قَالَ مَالِكٌ فِي الْقَوْمِ يَكُونُ لَهُمُ الْعَدُوُّ يُتَّهَمُونَ بِالدَّمِ فَيَرُدُّ وُلاَةُ الْمَقْتُولِ الأَيْمَانَ عَلَيْهِمْ وَهُمْ نَفَرٌ لَهُمْ عَدَدٌ أَنَّهُ يَحْلِفُ كُلُّ إِنْسَانٍ مِنْهُمْ عَنْ نَفْسِهِ خَمْسِينَ يَمِينًا وَلاَ تُقْطَعُ الأَيْمَانُ عَلَيْهِمْ بِقَدْرِ عَدَدِهِمْ وَلاَ يَبْرَءُونَ دُونَ أَنْ يَحْلِفَ كُلُّ إِنْسَانٍ عَنْ نَفْسِهِ خَمْسِينَ يَمِينًا ‏.‏ قَالَ مَالِكٌ وَهَذَا أَحْسَنُ مَا سَمِعْتُ فِي ذَلِكَ ‏.‏ قَالَ وَالْقَسَامَةُ تَصِيرُ إِلَى عَصَبَةِ الْمَقْتُولِ وَهُمْ وُلاَةُ الدَّمِ الَّذِينَ يَقْسِمُونَ عَلَيْهِ وَالَّذِينَ يُقْتَلُ بِقَسَامَتِهِمْ ‏.‏","english":{"narrator":"","text":"Yahya said from Malik from Yahya ibn Said that Bushayr ibn Yasar\ninformed him that Abdullah ibn Sahl al-Ansari and Muhayyisa ibn Masud\nwent out to Khaybar, and they separated on their various businesses\nand Abdullah ibn Sahl was killed. Muhayyisa, and his brother Huwayyisa\nand Abd ar-Rahman ibn Sahl went to the Prophet, may Allah bless him\nand grant him peace, and Abd ar-Rahman began to speak before his\nbrother. The Messenger of Allah, may Allah bless him and grant him\npeace, said, \"The older first, the older first. \n\n\nTherefore\nHuwayyisa and then Muhayyisa spoke and mentioned the affair of\nAbdullah ibn Sahl. The Messenger of Allah, may Allah bless him and\ngrant him peace, said to them, \"Do you swear with fifty oaths and\nclaim the blood-money of your companion or the life of the murderer?\"\nThey said, \"Messenger of Allah, we did not see it and we were not\npresent.\" The Messenger of Allah, may Allah bless him and grant him\npeace, said, \"Will you acquit the jews for fifty oaths?' They said,\n\"Messenger of Allah, how can we accept the oaths of a people who are\nkafirun?\"\n\n\nYahya ibn Said said, \"Bushayr ibn Yasar claimed\nthat the Messenger of Allah, may Allah bless him and grant him peace,\npaid the blood-money from his own property.\"\n\n\nMalik said, \"The\ngenerally agreed on way of doing things in our community and that\nwhich I heard from whoever I am content with, concerning the oath of\nqasama, and upon which the past and present imams agree, is that those\nwho claim revenge begin with the oaths and swear. The oath for revenge\nis only obligatory in two situations. Either the slain person says,\n'My blood is against so-and-so,' or the relatives entitled to the\nblood bring a partial proof of it that is not irrefutable against the\none who is the object of the blood-claim. This obliges taking an oath\non the part of those who claim the blood against those who are the\nobject of the blood-claim. With us, swearing is only obliged in these\ntwo situations.\"\n\n\nMalik said, \"That is the sunna in which\nthere is no dispute with us and which is still the behaviour of the\npeople. The people who claim blood begin the swearings, whether it is\nan intentional killing or an accident.\"\n\n\nMalik said, \"The\nMessenger of Allah, may Allah bless him and grant him peace, began\nwith Banu Harith in the case of the killing of their kinsman murdered\nat Khaybar.\"\n\n\nMalik said, \"If those who make the claim swear,\nthey deserve the blood of their kinsman and whoever they swear against\nis slain. Only one man can be killed in the qasama. Two cannot be\nkilled in it. Fifty men from the blood-relatives must swear fifty\noaths. If their number is less or some of them draw back, they can\nrepeat their oaths, unless one of the relatives of the murdered man\nwho deserves blood and who is permitted to pardon it, draws back. If\none of these draws back, there is no way to revenge.\"\n\n\nYahya\nsaid that Malik said, \"The oaths can be made by those of them who\nremain if one of them draws back who is not permitted to pardon. If\none of the blood-relatives draws back who is permitted to pardon, even\nif he is only one, more oaths can not be made after that by the blood-\nrelatives. If that occurs, the oaths can be on behalf of the one\nagainst whom the claim is made. So fifty of the men of his people\nswear fifty oaths. If there are not fifty men, more oaths can be made\nby those of them who already swore. If there is only the defendant, he\nswears fifty oaths and is acquitted.\"\n\n\nYahya said that Malik\nsaid, \"One distinguishes between swearing for blood and oaths for\none's rights. When a man has a money-claim against another man, he\nseeks to verify his due. When a man wants to kill another man, he does\nnot kill him in the midst of people. He keeps to a place away from\npeople. Had there only been swearing in cases where there is a clear\nproof and had one acted in it as one acts about one's rights (i.e.\nneeding witnesses), the right of blood retribution would have been\nlost and people would have been swift to take advantage of it when\nthey learned of the decision on it. However, the relatives of the\nmurdered man were allowed to initiate swearing so that people might\nrestrain themselves from blood and the murderer might beware lest he\nwas put into a situation like that (i.e. qasama) by the statement of\nthe murdered man.' \"\n\n\nYahya said, \"Malik said about a people\nof whom a certain number are suspected of murder and the relatives of\nthe murdered man ask them to take oaths and they are numerous, so they\nask that each man swears fifty oaths on his own behalf. The oaths are\nnot divided out between them according to their number and they are\nnot acquitted unless each man among them swears fifty oaths on his own\nbehalf.\"\n\n\nMalik said, \"This is the best I have heard about the\nmatter.\"\n\n\nHe said, \"Swearing goes to the paternal relatives of\nthe slain. They are the blood-relatives who swear against the killer\nand by whose swearing he is killed.\""}},{"id":3,"idInBook":3,"chapterId":44,"bookId":7,"arabic":"قَالَ يَحْيَى قَالَ مَالِكٌ الأَمْرُ الَّذِي لاَ اخْتِلاَفَ فِيهِ عِنْدَنَا أَنَّهُ لاَ يَحْلِفُ فِي الْقَسَامَةِ فِي الْعَمْدِ أَحَدٌ مِنَ النِّسَاءِ وَإِنْ لَمْ يَكُنْ لِلْمَقْتُولِ وُلاَةٌ إِلاَّ النِّسَاءُ فَلَيْسَ لِلنِّسَاءِ فِي قَتْلِ الْعَمْدِ قَسَامَةٌ وَلاَ عَفْوٌ ‏.‏ قَالَ يَحْيَى قَالَ مَالِكٌ فِي الرَّجُلِ يُقْتَلُ عَمْدًا أَنَّهُ إِذَا قَامَ عَصَبَةُ الْمَقْتُولِ أَوْ مَوَالِيهِ فَقَالُوا نَحْنُ نَحْلِفُ وَنَسْتَحِقُّ دَمَ صَاحِبِنَا ‏.‏ فَذَلِكَ لَهُمْ ‏.‏ قَالَ مَالِكٌ فَإِنْ أَرَادَ النِّسَاءُ أَنْ يَعْفُونَ عَنْهُ فَلَيْسَ ذَلِكَ لَهُنَّ الْعَصَبَةُ وَالْمَوَالِي ‏.‏ أَوْلَى بِذَلِكَ مِنْهُنَّ لأَنَّهُمْ هُمُ الَّذِينَ اسْتَحَقُّوا الدَّمَ وَحَلَفُوا عَلَيْهِ ‏.‏ قَالَ مَالِكٌ وَإِنْ عَفَتِ الْعَصَبَةُ أَوِ الْمَوَالِي بَعْدَ أَنْ يَسْتَحِقُّوا الدَّمَ وَأَبَى النِّسَاءُ وَقُلْنَ لاَ نَدَعُ قَاتِلَ صَاحِبِنَا فَهُنَّ أَحَقُّ وَأَوْلَى بِذَلِكَ لأَنَّ مَنْ أَخَذَ الْقَوَدَ أَحَقُّ مِمَّنْ تَرَكَهُ مِنَ النِّسَاءِ وَالْعَصَبَةِ إِذَا ثَبَتَ الدَّمُ وَوَجَبَ الْقَتْلُ ‏.‏ قَالَ مَالِكٌ لاَ يُقْسِمُ فِي قَتْلِ الْعَمْدِ مِنَ الْمُدَّعِينَ إِلاَّ اثْنَانِ فَصَاعِدًا تُرَدَّدُ الأَيْمَانُ عَلَيْهِمَا حَتَّى يَحْلِفَا خَمْسِينَ يَمِينًا ثُمَّ قَدِ اسْتَحَقَّا الدَّمَ وَذَلِكَ الأَمْرُ عِنْدَنَا ‏.‏ قَالَ مَالِكٌ وَإِذَا ضَرَبَ النَّفَرُ الرَّجُلَ حَتَّى يَمُوتَ تَحْتَ أَيْدِيهِمْ قُتِلُوا بِهِ جَمِيعًا فَإِنْ هُوَ مَاتَ بَعْدَ ضَرْبِهِمْ كَانَتِ الْقَسَامَةُ وَإِذَا كَانَتِ الْقَسَامَةُ لَمْ تَكُنْ إِلاَّ عَلَى رَجُلٍ وَاحِدٍ وَلَمْ يُقْتَلْ غَيْرُهُ وَلَمْ نَعْلَمْ قَسَامَةً كَانَتْ قَطُّ إِلاَّ عَلَى رَجُلٍ وَاحِدٍ ‏.‏","english":{"narrator":"","text":"Yahya said that Malik said, \"The way of doing things in our\ncommunity about which there is no dispute is that women do not swear\nin the swearing for the intentional act. If the murdered man only has\nfemale relatives, the women have no right to swear for blood and no\npardon in murder.\"\n\n\nYahya said that Malik said about a man who\nis murdered, \"If the paternal relatives of the murdered man or his\nmawali say, 'We swear and we demand our companion's blood,' that is\ntheir right.\"\n\n\nMalik said, \"If the women want to pardon him,\nthey cannot do that. The paternal relatives and mawali are entitled to\ndo that more than them because they are the ones who demand blood and\nswear for it.\"\n\n\nMalik said, \"If the paternal relatives or\nmawali pardon after they demand blood and the women refuse and say,\n'We will not abandon our right against the murderer of our companion,'\nthe women are more entitled to that because whoever takes retaliation\nis more entitled than the one who leaves it among the women and\npaternal relatives when the murder is established and killing\nobliged.\"\n\n\nMalik said, \"At least two claimants must swear in\nmurder. The oaths are repeated by them until they swear fifty oaths,\nthen they have the right to blood. That is how things are done in our\ncommunity.\"\n\n\nMalik said, \"When people beat a man and he dies\nin their hands, they are all slain for him. If he dies after their\nbeating, there is swearing. If there is swearing, it is only against\none man and only he is slain. We have never known the swearing to be\nagainst more than one man.\"\n\n\nMalik spoke about a slave who had\nhis hand or foot broken and then the break mended . He said, \"The one\nwho injured him is not obliged to pay anything. If that break causes\nhim loss or scar, the one who injured him must pay according to what\nhe diminished of the value of the slave.\"\n\n\nMalik said, \"What\nis done in our community about retaliation between slaves is that it\nis like retaliation between freemen. The life of the slave-girl for\nthe life of the slave, and her injury for his injury. When a slave\nintentionally kills a slave, the master of the murdered slave has a\nchoice. If he wishes, he kills him, and if he wishes, he takes the\nblood-money. If he takes the blood-money, he takes the value of his\nslave. If the owner of the slave who killed wishes to give the value\nof the murdered slave, he does it. If he wishes, he surrenders his\nslave. If he surrenders him, he is not obliged to do anything other\nthan that. When the owner of the murdered slave takes the slave who\nmurdered and is satisifed with him, he must not kill him. All\nretaliations between slaves for cutting off of the hand and foot and\nsuch things are dealt with in the same way as in the murder.\"\n\n\nMalik said about a muslim slave who injures a jew or christian, \"If\nthe master of the slave wishes to pay blood-money for him according to\nthe injury, he does it. Or else he surrenders him and he is sold, and\nthe jew or christian is given the blood-money of the injury or all the\nprice of the slave if the blood-money is greater than his price. The\njew or christian is not given a muslim slave.\""}},{"id":4,"idInBook":4,"chapterId":44,"bookId":7,"arabic":"قَالَ يَحْيَى قَالَ مَالِكٌ الْقَسَامَةُ فِي قَتْلِ الْخَطَإِ يُقْسِمُ الَّذِينَ يَدَّعُونَ الدَّمَ وَيَسْتَحِقُّونَهُ بِقَسَامَتِهِمْ يَحْلِفُونَ خَمْسِينَ يَمِينًا تَكُونُ عَلَى قَسْمِ مَوَارِيثِهِمْ مِنَ الدِّيَةِ فَإِنْ كَانَ فِي الأَيْمَانِ كُسُورٌ إِذَا قُسِمَتْ بَيْنَهُمْ نُظِرَ إِلَى الَّذِي يَكُونُ عَلَيْهِ أَكْثَرُ تِلْكَ الأَيْمَانِ إِذَا قُسِمَتْ فَتُجْبَرُ عَلَيْهِ تِلْكَ الْيَمِينُ ‏.‏ قَالَ مَالِكٌ فَإِنْ لَمْ يَكُنْ لِلْمَقْتُولِ وَرَثَةٌ إِلاَّ النِّسَاءُ فَإِنَّهُنَّ يَحْلِفْنَ وَيَأْخُذْنَ الدِّيَةَ فَإِنْ لَمْ يَكُنْ لَهُ وَارِثٌ إِلاَّ رَجُلٌ وَاحِدٌ حَلَفَ خَمْسِينَ يَمِينًا وَأَخَذَ الدِّيَةَ وَإِنَّمَا يَكُونَ ذَلِكَ فِي قَتْلِ الْخَطَإِ وَلاَ يَكُونُ فِي قَتْلِ الْعَمْدِ ‏.‏","english":{"narrator":"","text":"Yahya said that Malik said, \"The way of doing things in our\ncommunity about Yahya said that Malik said, \"The procedure in swearing\nin manslaughter is that those who claim blood swear and it becomes due\nby their swearing. They swear fifty oaths, and there is blood-money\nfor them according to the division of their inheritances. If it is not\npossible to divide up the oaths which they swear between them evenly,\none looks to the one who has most of those oaths against him, and that\noath is obliged against him.\"\n\n\nMalik said, \"If the slain man\nonly has female heirs, they swear and take the blood-money. If he only\nhas one male heir, he swears fifty oaths and takes the blood-money.\nThat is only in the accidental killing, not in the intentional one.\""}},{"id":5,"idInBook":5,"chapterId":44,"bookId":7,"arabic":"قَالَ يَحْيَى قَالَ مَالِكٌ إِذَا قَبِلَ وُلاَةُ الدَّمِ الدِّيَةَ فَهِيَ مَوْرُوثَةٌ عَلَى كِتَابِ اللَّهِ يَرِثُهَا بَنَاتُ الْمَيِّتِ وَأَخَوَاتُهُ وَمَنْ يَرِثُهُ مِنَ النِّسَاءِ فَإِنْ لَمْ يُحْرِزِ النِّسَاءُ مِيرَاثَهُ كَانَ مَا بَقِيَ مِنْ دِيَتِهِ لأَوْلَى النَّاسِ بِمِيرَاثِهِ مَعَ النِّسَاءِ ‏.‏ قَالَ مَالِكٌ إِذَا قَامَ بَعْضُ وَرَثَةِ الْمَقْتُولِ الَّذِي يُقْتَلُ خَطَأً يُرِيدُ أَنْ يَأْخُذَ مِنَ الدِّيَةِ بِقَدْرِ حَقِّهِ مِنْهَا وَأَصْحَابُهُ غَيَبٌ لَمْ يَأْخُذْ ذَلِكَ وَلَمْ يَسْتَحِقَّ مِنَ الدِّيَةِ شَيْئًا قَلَّ وَلاَ كَثُرَ دُونَ أَنْ يَسْتَكْمِلَ الْقَسَامَةَ يَحْلِفُ خَمْسِينَ يَمِينًا فَإِنْ حَلَفَ خَمْسِينَ يَمِينًا اسْتَحَقَّ حِصَّتَهُ مِنَ الدِّيَةِ وَذَلِكَ أَنَّ الدَّمَ لاَ يَثْبُتُ إِلاَّ بِخَمْسِينَ يَمِينًا وَلاَ تَثْبُتُ الدِّيَةُ حَتَّى يَثْبُتَ الدَّمُ فَإِنْ جَاءَ بَعْدَ ذَلِكَ مِنَ الْوَرَثَةِ أَحَدٌ حَلَفَ مِنَ الْخَمْسِينَ يَمِينًا بِقَدْرِ مِيرَاثِهِ وَأَخَذَ حَقَّهُ حَتَّى يَسْتَكْمِلَ الْوَرَثَةُ حُقُوقَهُمْ إِنْ جَاءَ أَخٌ لأُمٍّ فَلَهُ السُّدُسُ وَعَلَيْهِ مِنَ الْخَمْسِينَ يَمِينًا السُّدُسُ فَمَنْ حَلَفَ اسْتَحَقَّ مِنَ الدِّيَةِ وَمَنْ نَكَلَ بَطَلَ حَقُّهُ وَإِنْ كَانَ بَعْضُ الْوَرَثَةِ غَائِبًا أَوْ صَبِيًّا لَمْ يَبْلُغْ حَلَفَ الَّذِينَ حَضَرُوا خَمْسِينَ يَمِينًا فَإِنْ جَاءَ الْغَائِبُ بَعْدَ ذَلِكَ أَوْ بَلَغَ الصَّبِيُّ الْحُلُمَ حَلَفَ كُلٌّ مِنْهُمَا يَحْلِفُونَ عَلَى قَدْرِ حُقُوقِهِمْ مِنَ الدِّيَةِ وَعَلَى قَدْرِ مَوَارِيثِهِمْ مِنْهَا ‏.‏ قَالَ يَحْيَى قَالَ مَالِكٌ وَهَذَا أَحْسَنُ مَا سَمِعْتُ ‏.","english":{"narrator":"","text":"Yahya said that Malik said, \"When the relatives of the deceased\naccept the blood-money then it is inherited according to the Book of\nAllah. Daughters of the dead man inherit and so do sisters, and\nwhichever women would inherit from him ordinarily.\n\n\nIf the\nwomen do not take all his inheritance, then what remains goes to the\nagnatic relations who most deserve to inherit from him in conjunction\nwith the women.\"\n\n\nMalik said, \"When one of the heirs of a man\nkilled by mistake attempts to take his due from the blood-money while\nhis companions are absent, he may not do that, and he has no right to\nany of the blood-money, however large or small, unless the qasama has\nbeen completed by him. If he swears fifty oaths then he has the right\nto his portion of the blood-money. That is because the blood-money is\nnot established as due without there being fifty oaths, and the blood-\nmoney is not established as due unless the responsibility for the\nblood is established. If any one of the heirs comes after that he\nswears a number of the oaths commensurate with his fraction of the\ninheritance and takes his right until all the heirs exact their\ncomplete right. If a maternal uncle comes he has one sixth and must\nswear one sixth of the fifty oaths. So whoever swears may take his due\nfrom the blood-money and whoever abstains annuls his right. If one of\nthe heirs is absent or is a child who has not reached puberty, those\nwho are present swear fifty oaths and if the one who was absent comes\nafter that or the child reaches puberty, they swear. and they swear\naccording to their due of the blood-money and according to their\nshares of inheritance from it.\"\n\n\nYahya said that Malik said,\n\"This is the best I have heard on the matter.\""}},{"id":6,"idInBook":6,"chapterId":44,"bookId":7,"arabic":"قَالَ يَحْيَى قَالَ مَالِكٌ الأَمْرُ عِنْدَنَا فِي الْعَبِيدِ أَنَّهُ إِذَا أُصِيبَ الْعَبْدُ عَمْدًا أَوْ خَطَأً ثُمَّ جَاءَ سَيِّدُهُ بِشَاهِدٍ حَلَفَ مَعَ شَاهِدِهِ يَمِينًا وَاحِدَةً ثُمَّ كَانَ لَهُ قِيمَةُ عَبْدِهِ وَلَيْسَ فِي الْعَبِيدِ قَسَامَةٌ فِي عَمْدٍ وَلاَ خَطَإٍ وَلَمْ أَسْمَعْ أَحَدًا مِنْ أَهْلِ الْعِلْمِ قَالَ ذَلِكَ ‏.‏ قَالَ مَالِكٌ فَإِنْ قُتِلَ الْعَبْدُ عَمْدًا أَوْ خَطَأً لَمْ يَكُنْ عَلَى سَيِّدِ الْعَبْدِ الْمَقْتُولِ قَسَامَةٌ وَلاَ يَمِينٌ وَلاَ يَسْتَحِقُّ سَيِّدُهُ ذَلِكَ إِلاَّ بِبَيِّنَةٍ عَادِلَةٍ أَوْ بِشَاهِدٍ فَيَحْلِفُ مَعَ شَاهِدِهِ ‏.‏ قَالَ يَحْيَى قَالَ مَالِكٌ وَهَذَا أَحْسَنُ مَا سَمِعْتُ ‏.","english":{"narrator":"","text":"Yahya said that Malik said, \"What is done in our community about\nslaves is that when a slave is struck intentionally or accidentally\nand the master brings a witness, he swears with his witness one oath\nand then he has the value of the slave. There is no swearing for\nrevenge in slaves, accidentally or intentionally, and I have not heard\nany of the people of knowledge say that there was.\"\n\n\nMalik\nsaid, \"If a slave is killed intentionally or accidentally, the master\nof the slave who is slain has no swearing or oath. The master cannot\ndemand his right except with a fair proof or a witness if he swears\nwith one witness.\"\n\n\nYahya said that Malik said, \"This is the\nbest of what I have heard on the matter.''"}}],"chapter":{"id":44,"bookId":7,"arabic":"كتاب القسامة","english":"The Oath of Qasama"}}