{"metadata":{"length":25,"arabic":{"title":"موطأ مالك","author":"الإمام مالك بن أنس","introduction":"كتاب الْمَدِينَةِ"},"english":{"title":"Muwatta Malik","author":"Imam Malik ibn Anas","introduction":"Madina"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":45,"bookId":7,"arabic":"وَحَدَّثَنِي يَحْيَى بْنُ يَحْيَى، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ الأَنْصَارِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ اللَّهُمَّ بَارِكْ لَهُمْ فِي مِكْيَالِهِمْ وَبَارِكْ لَهُمْ فِي صَاعِهِمْ وَمُدِّهِمْ ‏\"‏ ‏.‏ يَعْنِي أَهْلَ الْمَدِينَةِ ‏.‏","english":{"narrator":"","text":"Yahya ibn Yahya related to me from Ishaq ibn Abdullah ibn Abi\nTalha al-Ansari from Anas ibn Malik that the Messenger of Allah, may\nAllah bless him and grant him peace, said, \"O Allah! Bless them in\ntheir measure, and bless them in their sa and mudd.\" He meant the\npeople of Madina."}},{"id":2,"idInBook":2,"chapterId":45,"bookId":7,"arabic":"وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ قَالَ كَانَ النَّاسُ إِذَا رَأَوْا أَوَّلَ الثَّمَرِ جَاءُوا بِهِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَإِذَا أَخَذَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ اللَّهُمَّ بَارِكْ لَنَا فِي ثَمَرِنَا وَبَارِكْ لَنَا فِي مَدِينَتِنَا وَبَارِكْ لَنَا فِي صَاعِنَا وَبَارِكْ لَنَا فِي مُدِّنَا اللَّهُمَّ إِنَّ إِبْرَاهِيمَ عَبْدُكَ وَخَلِيلُكَ وَنَبِيُّكَ وَإِنِّي عَبْدُكَ وَنَبِيُّكَ وَإِنَّهُ دَعَاكَ لِمَكَّةَ وَإِنِّي أَدْعُوكَ لِلْمَدِينَةِ بِمِثْلِ مَا دَعَاكَ بِهِ لِمَكَّةَ وَمِثْلِهِ مَعَهُ ‏\"‏ ‏.‏ ثُمَّ يَدْعُو أَصْغَرَ وَلِيدٍ يَرَاهُ فَيُعْطِيهِ ذَلِكَ الثَّمَرَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Suhayl ibn Abi Salih from his\nfather that Abu Hurayra said, \"When people saw the first fruits of the\nseason, they brought them to the Messenger of Allah, may Allah bless\nhim and grant him peace. The Messenger of Allah, may Allah bless him\nand grant him peace, took them and said, 'O Allah! Bless us in our\nfruits. Bless us in our city. Bless us in our sa and bless us in our\nmudd. O Allah! Ibrahim is Your slave, Your Khalil and Your Prophet. I\nam Your slave and Your Prophet. He prayed to You for Makka. I pray to\nYou for Madina for the like of what He prayed to You for Makka, and\nthe like of it with it.' Then he called the smallest child he saw and\ngave him the fruits.\""}},{"id":3,"idInBook":3,"chapterId":45,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ قَطَنِ بْنِ وَهْبِ بْنِ عُمَيْرِ بْنِ الأَجْدَعِ، أَنْ يُحَنَّسَ، مَوْلَى الزُّبَيْرِ بْنِ الْعَوَّامِ أَخْبَرَهُ أَنَّهُ، كَانَ جَالِسًا عِنْدَ عَبْدِ اللَّهِ بْنِ عُمَرَ فِي الْفِتْنَةِ فَأَتَتْهُ مَوْلاَةٌ لَهُ تُسَلِّمُ عَلَيْهِ فَقَالَتْ إِنِّي أَرَدْتُ الْخُرُوجَ يَا أَبَا عَبْدِ الرَّحْمَنِ اشْتَدَّ عَلَيْنَا الزَّمَانُ ‏.‏ فَقَالَ لَهَا عَبْدُ اللَّهِ بْنُ عُمَرَ اقْعُدِي لُكَعُ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ لاَ يَصْبِرُ عَلَى لأْوَائِهَا وَشِدَّتِهَا أَحَدٌ إِلاَّ كُنْتُ لَهُ شَفِيعًا أَوْ شَهِيدًا يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Qatan ibn Wahb ibn Umayr ibn\nal-Ajda that Yuhannas, the mawla of az-Zubayr ibn al-Awwam informed\nhim that he was sitting with Abdullah ibn Umar during the troubles (at\nthe time of al-Hajaj ibn Yusuf) . A female mawla of his came and\ngreeted him. She said, \"I want to leave, Abu Abd ar-Rahman. The time\nis harsh for us.\" Abdullah ibn Umar said to her, \"Sit down, O you with\nlittle knowledge, for I have heard the Messenger of Allah, may Allah\nbless him and grant him peace, say, 'No one will be patient in hunger\nand hardship in it (Madina) except that I will be a witness or\nintercede for him on the Day of Rising.' \""}},{"id":4,"idInBook":4,"chapterId":45,"bookId":7,"arabic":"وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ أَعْرَابِيًّا، بَايَعَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَلَى الإِسْلاَمِ فَأَصَابَ الأَعْرَابِيَّ وَعْكٌ بِالْمَدِينَةِ فَأَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ أَقِلْنِي بَيْعَتِي ‏.‏ فَأَبَى رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ جَاءَهُ فَقَالَ أَقِلْنِي بَيْعَتِي ‏.‏ فَأَبَى ثُمَّ جَاءَهُ فَقَالَ أَقِلْنِي بَيْعَتِي ‏.‏ فَأَبَى فَخَرَجَ الأَعْرَابِيُّ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّمَا الْمَدِينَةُ كَالْكِيرِ تَنْفِي خَبَثَهَا وَيَنْصَعُ طِيبُهَا ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Muhammad ibn al-Munkadir from\nJabir ibn Abdullah that a Bedouin took an oath of allegiance in Islam\nwith the Messenger of Allah, may Allah bless him and grant him peace.\nA fever befell the Bedouin at Madina. He came to the Messenger of\nAllah, and said, \"Messenger of Allah, release me from my pledge.\" The\nMessenger of Allah, may Allah bless him and grant him peace, refused.\nThen he came to him again and said, \"Release me from my pledge.\" The\nMessenger of Allah may Allah bless him and grant him peace, refused.\nThen he came again and said, \"Release me from my pledge.\" He refused.\nThen he came again and said, \"Release me from my pledge.\" He refused.\nThe Bedouin left and the Messenger of Allah, may Allah bless him and\ngrant him peace, said, \"Madina is like the blacksmith's furnace. It\nremoves the impurities and purifies the good.\""}},{"id":5,"idInBook":5,"chapterId":45,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ قَالَ سَمِعْتُ أَبَا الْحُبَابِ، سَعِيدَ بْنَ يَسَارٍ يَقُولُ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ أُمِرْتُ بِقَرْيَةٍ تَأْكُلُ الْقُرَى يَقُولُونَ يَثْرِبُ ‏.‏ وَهِيَ الْمَدِينَةُ تَنْفِي النَّاسَ كَمَا يَنْفِي الْكِيرُ خَبَثَ الْحَدِيدِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me that Yahya ibn Said said, \"I heard\nAbu'l-Hubab Said ibn Yasar say that he heard Abu Hurayra say that he\nheard the Messenger of Allah, may Allah bless him and grant him peace,\nsay, 'I was ordered to a town which will eat up towns. They used to\nsay, 'Yathrib,' but it is Madina. It removes the bad people like the\nblacksmith's furnace removes impurities from the iron.' \""}},{"id":6,"idInBook":6,"chapterId":45,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَخْرُجُ أَحَدٌ مِنَ الْمَدِينَةِ رَغْبَةً عَنْهَا إِلاَّ أَبْدَلَهَا اللَّهُ خَيْرًا مِنْهُ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me from Hisham ibn Urwa from his father that the\nMessenger of Allah, may Allah bless him and grant him peace, said, \"No\none leaves Madina preferring to live elsewhere, but that Allah will\ngive it better than him in place of him .\""}},{"id":7,"idInBook":7,"chapterId":45,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، عَنْ سُفْيَانَ بْنِ أَبِي زُهَيْرٍ، أَنَّهُ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ تُفْتَحُ الْيَمَنُ فَيَأْتِي قَوْمٌ يَبِسُّونَ فَيَتَحَمَّلُونَ بِأَهْلِيهِمْ وَمَنْ أَطَاعَهُمْ وَالْمَدِينَةُ خَيْرٌ لَهُمْ لَوْ كَانُوا يَعْلَمُونَ وَتُفْتَحُ الشَّامُ فَيَأْتِي قَوْمٌ يَبِسُّونَ فَيَتَحَمَّلُونَ بِأَهْلِيهِمْ وَمَنْ أَطَاعَهُمْ وَالْمَدِينَةُ خَيْرٌ لَهُمْ لَوْ كَانُوا يَعْلَمُونَ وَتُفْتَحُ الْعِرَاقُ فَيَأْتِي قَوْمٌ يَبِسُّونَ فَيَتَحَمَّلُونَ بِأَهْلِيهِمْ وَمَنْ أَطَاعَهُمْ وَالْمَدِينَةُ خَيْرٌ لَهُمْ لَوْ كَانُوا يَعْلَمُونَ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me from Hisham ibn Urwa from his father from\nAbdullah ibn az-Zubayr that Sufyan ibn Abi Zuhayr said, \"I heard the\nMessenger of Allah, may Allah bless him and grant him peace, say,\n'Yemen will be conquered and the people will be attracted to it,\ntaking their families and whoever obeys them. Madina would have been\nbetter for them, had they but known. Ash-Sham will be conquered and\npeople will be attracted to it, taking their families and whoever\nobeys them. Madina would have been better for them, had they but\nknown. Iraq will be conquered and people will be attracted to it,\ntaking their families and whoever obeys them. Madina would have been\nbetter for them, had they but known.' \""}},{"id":8,"idInBook":8,"chapterId":45,"bookId":7,"arabic":"وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ حِمَاسٍ، عَنْ عَمِّهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لَتُتْرَكَنَّ الْمَدِينَةُ عَلَى أَحْسَنِ مَا كَانَتْ حَتَّى يَدْخُلَ الْكَلْبُ  أَوِ الذِّئْبُ فَيُغَذِّي عَلَى بَعْضِ سَوَارِي الْمَسْجِدِ أَوْ عَلَى الْمِنْبَرِ ‏\"‏ ‏.‏ فَقَالُوا يَا رَسُولَ اللَّهِ فَلِمَنْ تَكُونُ الثِّمَارُ ذَلِكَ الزَّمَانَ قَالَ ‏\"‏ لِلْعَوَافِي الطَّيْرِ وَالسِّبَاعِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Himas from his paternal\nuncle from Abu Hurayra that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"Madina will be left in the best way\nthat it is until a dog or wolf enters it and urinates on one of the\npillars of the mosque or on the mimbar.\" They asked, \"Messenger of\nAllah! Who will have the fruit at that time?\" He replied, \"Animals\nseeking food, birds and wild beasts.\""}},{"id":9,"idInBook":9,"chapterId":45,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ، حِينَ خَرَجَ مِنَ الْمَدِينَةِ الْتَفَتَ إِلَيْهَا فَبَكَى ثُمَّ قَالَ يَا مُزَاحِمُ أَتَخْشَى أَنْ نَكُونَ مِمَّنْ نَفَتِ الْمَدِينَةُ","english":{"narrator":"","text":"Malik related to me that he had heard that when Umar ibn Abd al-\nAziz left Madina, he turned towards it and wept. Then he said, \"O\nMuzahim! Do you fear that we might be among those that Madina casts\noff?\""}},{"id":10,"idInBook":10,"chapterId":45,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَمْرٍو، مَوْلَى الْمُطَّلِبِ عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم طَلَعَ لَهُ أُحُدٌ فَقَالَ ‏\n\"‏ هَذَا جَبَلٌ يُحِبُّنَا وَنُحِبُّهُ اللَّهُمَّ إِنَّ إِبْرَاهِيمَ حَرَّمَ مَكَّةَ وَأَنَا أُحَرِّمُ مَا بَيْنَ لاَبَتَيْهَا ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Amr, the mawla of al-Muttalib\nfrom Anas ibn Malik that the Messenger of Allah, may Allah bless him\nand grant him peace, saw Uhud and said, \"This is a mountain which\nloves us and we love it. O Allah! Ibrahim made Makka Haram, and I will\nmake what is between the two tracts of black stones (in Madina) a\nHaram.\""}},{"id":11,"idInBook":11,"chapterId":45,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ كَانَ يَقُولُ لَوْ رَأَيْتُ الظِّبَاءَ بِالْمَدِينَةِ تَرْتَعُ مَا ذَعَرْتُهَا قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَا بَيْنَ لاَبَتَيْهَا حَرَامٌ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me from Ibn Shihab from Said ibn al-Musayyab\nthat Abu Hurayra said, \"Had I seen a gazelle at Madina, I would have\nleft it to graze and would not have frightened it. The Messenger of\nAllah, may Allah bless him and grant him peace, said, 'What is between\nthe two tracts of black stones is a Haram.' \""}},{"id":12,"idInBook":12,"chapterId":45,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ يُونُسَ بْنِ يُوسُفَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي أَيُّوبَ الأَنْصَارِيِّ، أَنَّهُ وَجَدَ غِلْمَانًا قَدْ أَلْجَئُوا ثَعْلَبًا إِلَى زَاوِيَةٍ فَطَرَدَهُمْ عَنْهُ ‏.‏ قَالَ مَالِكٌ لاَ أَعْلَمُ إِلاَّ أَنَّهُ قَالَ أَفِي حَرَمِ رَسُولِ اللَّهِ صلى الله عليه وسلم يُصْنَعُ هَذَا","english":{"narrator":"","text":"Malik related to me from Yunus ibn Yusuf from Ata ibn Yasar that\nAbu Ayyub al-Ansari found some boys who had driven a fox into a\ncorner, and he chased them away from it.\n\n\nMalik said, \"I only\nknow that he said, 'Is this done in the Haram of the Messenger of\nAllah, may Allah bless him and grant him peace?' \""}},{"id":13,"idInBook":13,"chapterId":45,"bookId":7,"arabic":"وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ رَجُلٍ، قَالَ دَخَلَ عَلَىَّ زَيْدُ بْنُ ثَابِتٍ وَأَنَا بِالأَسْوَافِ، قَدِ اصْطَدْتُ نُهَسًا فَأَخَذَهُ مِنْ يَدِي فَأَرْسَلَهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from a man who said, \"Zayd ibn\nThabit came across me while I was at al-Aswaf (on the outskirts of\nMadina). I had captured a hawk. He took it from my hands and set it\nfree.\""}},{"id":14,"idInBook":14,"chapterId":45,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ، أَنَّهَا قَالَتْ لَمَّا قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَدِينَةَ وُعِكَ أَبُو بَكْرٍ وَبِلاَلٌ - قَالَتْ - فَدَخَلْتُ عَلَيْهِمَا فَقُلْتُ يَا أَبَتِ كَيْفَ تَجِدُكَ وَيَا بِلاَلُ كَيْفَ تَجِدُكَ قَالَتْ فَكَانَ أَبُو بَكْرٍ إِذَا أَخَذَتْهُ الْحُمَّى يَقُولُ كُلُّ امْرِئٍ مُصَبَّحٌ فِي أَهْلِهِ وَالْمَوْتُ أَدْنَى مِنْ شِرَاكِ نَعْلِهِ وَكَانَ بِلاَلٌ إِذَا أُقْلِعَ عَنْهُ يَرْفَعُ عَقِيرَتَهُ فَيَقُولُ أَلاَ لَيْتَ شِعْرِي هَلْ أَبِيتَنَّ لَيْلَةً بِوَادٍ وَحَوْلِي إِذْخِرٌ وَجَلِيلُ وَهَلْ أَرِدَنْ يَوْمًا مِيَاهَ مَجَنَّةٍ وَهَلْ يَبْدُوَنْ لِي شَامَةٌ وَطَفِيلُ قَالَتْ عَائِشَةُ فَجِئْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَأَخْبَرْتُهُ فَقَالَ ‏\n\"‏ اللَّهُمَّ حَبِّبْ إِلَيْنَا الْمَدِينَةَ كَحُبِّنَا مَكَّةَ أَوْ أَشَدَّ وَصَحِّحْهَا وَبَارِكْ لَنَا فِي صَاعِهَا وَمُدِّهَا وَانْقُلْ حُمَّاهَا فَاجْعَلْهَا بِالْجُحْفَةِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa from his\nfather that A'isha, umm al-muminin said, \"When the Messenger of Allah,\nmay Allah bless him and grant him peace, came to Madina, Abu Bakr and\nBilal came down with a fever. I visited them and said, 'Father, how\nare you? Bilal, how are you?'\" She continued, \"When Abu Bakr's fever\nworsened he would say, 'Every man is struck down among his people in\nthe morning - death is nearer than the strap of his sandal.'\"\n\n\nWhen it left Bilal, he raised his voice and said, 'Would that I knew\nwhether I will spend a night at the valley of Makka with the idhkhir\nherb and jalil herb around me. Will I go one day to the waters of\nMajinna? Will the mountains of Shama and Tafil appear to me?' \" '\n\n\nA'isha continued, \"I went to the Messenger of Allah, may Allah\nbless him and grant him peace, and informed him. He said, 'O Allah!\nMake us love Madina as much as we love Makka or even more. Make it\nsound and bless us in our sa and mudd. Remove its fever and put it in\nal-Juhfa.' \""}},{"id":15,"idInBook":15,"chapterId":45,"bookId":7,"arabic":"قَالَ مَالِكٌ وَحَدَّثَنِي يَحْيَى بْنُ سَعِيدٍ، أَنَّ عَائِشَةَ، قَالَتْ وَكَانَ عَامِرُ بْنُ فُهَيْرَةَ يَقُولُ قَدْ رَأَيْتُ الْمَوْتَ قَبْلَ ذَوْقِهِ إِنَّ الْجَبَانَ حَتْفُهُ مِنْ فَوْقِهِ ‏.‏","english":{"narrator":"","text":"Malik said that Yahya ibn Said had related to him that A'isha\nsaid that Amir ibn Fuhayra had said at the time of the epidemic, \"I\nhave seen death before tasting it, the coward's destination is from\nabove him.\""}},{"id":16,"idInBook":16,"chapterId":45,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نُعَيْمِ بْنِ عَبْدِ اللَّهِ الْمُجْمِرِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ عَلَى أَنْقَابِ الْمَدِينَةِ مَلاَئِكَةٌ لاَ يَدْخُلُهَا الطَّاعُونُ وَلاَ الدَّجَّالُ","english":{"narrator":"","text":"Yahya related to me from Malik from Nuaym ibn Abdullah al-Mujmir\nthat Abu Hurayra said, \"The Messenger of Allah, may Allah bless him\nand grant him peace, said, 'There are angels at the entries of Madina,\nand neither plague nor the Dajjal will enter it.' \""}},{"id":17,"idInBook":17,"chapterId":45,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي حَكِيمٍ، أَنَّهُ سَمِعَ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ، يَقُولُ كَانَ مِنْ آخِرِ مَا تَكَلَّمَ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ قَالَ ‏\n\"‏ قَاتَلَ اللَّهُ الْيَهُودَ وَالنَّصَارَى اتَّخَذُوا قُبُورَ أَنْبِيَائِهِمْ مَسَاجِدَ لاَ يَبْقَيَنَّ دِينَانِ بِأَرْضِ الْعَرَبِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ismail ibn Abi Hakim that he\nheard Umar ibn Abd al-Aziz say, \"One of the last things that the\nMessenger of Allah, may Allah bless him and grant him peace, said was,\n'May Allah fight the jews and the christians. They took the graves of\ntheir Prophets as places of prostration . Two deens shall not co-exist\nin the land of the Arabs.' \""}},{"id":18,"idInBook":18,"chapterId":45,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ يَجْتَمِعُ دِينَانِ فِي جَزِيرَةِ الْعَرَبِ ‏\"‏ ‏.‏ قَالَ مَالِكٌ قَالَ ابْنُ شِهَابٍ فَفَحَصَ عَنْ ذَلِكَ عُمَرُ بْنُ الْخَطَّابِ حَتَّى أَتَاهُ الثَّلْجُ وَالْيَقِينُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ يَجْتَمِعُ دِينَانِ فِي جَزِيرَةِ الْعَرَبِ ‏\"‏ فَأَجْلَى يَهُودَ خَيْبَرَ ‏.‏ قَالَ مَالِكٌ وَقَدْ أَجْلَى عُمَرُ بْنُ الْخَطَّابِ يَهُودَ نَجْرَانَ وَفَدَكَ فَأَمَّا يَهُودُ خَيْبَرَ فَخَرَجُوا مِنْهَا لَيْسَ لَهُمْ مِنَ الثَّمَرِ وَلاَ مِنَ الأَرْضِ شَىْءٌ وَأَمَّا يَهُودُ فَدَكَ فَكَانَ لَهُمْ نِصْفُ الثَّمَرِ وَنِصْفُ الأَرْضِ لأَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ صَالَحَهُمْ عَلَى نِصْفِ الثَّمَرِ وَنِصْفِ الأَرْضِ فَأَقَامَ لَهُمْ عُمَرُ نِصْفَ الثَّمَرِ وَنِصْفَ الأَرْضِ قِيمَةً مِنْ ذَهَبٍ وَوَرِقٍ وَإِبِلٍ وَحِبَالٍ وَأَقْتَابٍ ثُمَّ أَعْطَاهُمُ الْقِيمَةَ وَأَجْلاَهُمْ مِنْهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab that the Messenger\nof Allah, may Allah bless him and grant him peace, said, \"Two deens\nshall not co-exist in the Arabian Peninsula.\"\n\n\nMalik said that\nIbn Shihab said, ''Umar ibn al-Khattab searched for information about\nthat until he was absolutely convinced that the Messenger of Allah,\nmay Allah bless him and grant him peace, had said, 'Two deens shall\nnot co-exist in the Arabian Peninsula,' and he therefore expelled the\njews from Khaybar.\"\n\n\nMalik said, ''Umar ibn al-Khattab expelled the jews from Najran\n(a jewish settlement in the Yemen) and Fadak (a jewish settlement\nthirty miles from Madina). When the jews of Khaybar left, they did not\ntake any fruit or land. The jews of Fadak took half the fruit and half\nthe land, because the Messenger of Allah, may Allah bless him and\ngrant him peace, had made a settlement with them for that. So Umar\nentrusted to them the value in gold, silver, camels, ropes and saddle\nbags of half the fruit and half the land, and handed the value over to\nthem and expelled them.\""}},{"id":19,"idInBook":19,"chapterId":45,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم طَلَعَ لَهُ أُحُدٌ فَقَالَ ‏\n\"‏ هَذَا جَبَلٌ يُحِبُّنَا وَنُحِبُّهُ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa from his\nfather that the Messenger of Allah, may Allah bless him and grant him\npeace, came in view of Uhud and said, \"This is a mountain which loves\nus and we love it.\""}},{"id":20,"idInBook":20,"chapterId":45,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، أَنَّ أَسْلَمَ، مَوْلَى عُمَرَ بْنِ الْخَطَّابِ أَخْبَرَهُ أَنَّهُ، زَارَ عَبْدَ اللَّهِ بْنَ عَيَّاشٍ الْمَخْزُومِيَّ فَرَأَى عِنْدَهُ نَبِيذًا وَهُوَ بِطَرِيقِ مَكَّةَ فَقَالَ لَهُ أَسْلَمُ إِنَّ هَذَا الشَّرَابَ يُحِبُّهُ عُمَرُ بْنُ الْخَطَّابِ فَحَمَلَ عَبْدُ اللَّهِ بْنُ عَيَّاشٍ قَدَحًا عَظِيمًا فَجَاءَ بِهِ إِلَى عُمَرَ بْنِ الْخَطَّابِ فَوَضَعَهُ فِي يَدَيْهِ فَقَرَّبَهُ عُمَرُ إِلَى فِيهِ ثُمَّ رَفَعَ رَأْسَهُ فَقَالَ عُمَرُ إِنَّ هَذَا لَشَرَابٌ طَيِّبٌ فَشَرِبَ مِنْهُ ثُمَّ نَاوَلَهُ رَجُلاً عَنْ يَمِينِهِ ‏.‏ فَلَمَّا أَدْبَرَ عَبْدُ اللَّهِ نَادَاهُ عُمَرُ بْنُ الْخَطَّابِ فَقَالَ أَأَنْتَ الْقَائِلُ لَمَكَّةُ خَيْرٌ مِنَ الْمَدِينَةِ فَقَالَ عَبْدُ اللَّهِ فَقُلْتُ هِيَ حَرَمُ اللَّهِ وَأَمْنُهُ وَفِيهَا بَيْتُهُ ‏.‏ فَقَالَ عُمَرُ لاَ أَقُولُ فِي بَيْتِ اللَّهِ وَلاَ فِي حَرَمِهِ شَيْئًا ‏.‏ ثُمَّ قَالَ عُمَرُ أَأَنْتَ الْقَائِلُ لَمَكَّةُ خَيْرٌ مِنَ الْمَدِينَةِ قَالَ فَقُلْتُ هِيَ حَرَمُ اللَّهِ وَأَمْنُهُ وَفِيهَا بَيْتُهُ ‏.‏ فَقَالَ عُمَرُ لاَ أَقُولُ فِي حَرَمِ اللَّهِ وَلاَ فِي بَيْتِهِ شَيْئًا ثُمَّ انْصَرَفَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said from Abd ar-\nRahman ibn al-Qasim that Aslam, the mawla of Umar ibn al-Khattab\ninformed him that he had visited Abdullah ibn Ayyash al-Makhzumi. He\nsaw that he had some nabidh with him and he was at that moment on the\nway to Makka. Aslam said to him, ''Umar ibn al-Khattab loves this\ndrink.\" Abdullah ibn Ayyash therefore carried a great drinking bowl\nand brought it to Umar ibn al-Khattab and placed it before him. Umar\nbrought it near to him and then raised his head. Umar said, \"This\ndrink is good,\" so he drank some of it and then passed it to a man on\nhis right. When Abdullah turned to go, Umar ibn al-Khattab called him\nand asked, \"Are you the person who says that Makka is better than\nMadina?\" Abdullah said, \"I said that it was the Haram of Allah, and\nHis place of security, and His House was in it.\" Umar said, \"I am not\nsaying anything about the House of Allah or His Haram.\" Then Umar\nrepeated \"Are you the person who says that Makka is better than\nMadina?\" He replied, \"I said that it was the Haram of Allah and His\nplace of security, and His House was in it.\" Umar said, \"I am not\nsaying anything about the House of Allah and His Haram.\" Then Abdullah\nleft."}},{"id":21,"idInBook":21,"chapterId":45,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَبْدِ الْحَمِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ زَيْدِ بْنِ الْخَطَّابِ، عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ الْحَارِثِ بْنِ نَوْفَلٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، خَرَجَ إِلَى الشَّامِ حَتَّى إِذَا كَانَ بِسَرْغَ لَقِيَهُ أُمَرَاءُ الأَجْنَادِ أَبُو عُبَيْدَةَ بْنُ الْجَرَّاحِ وَأَصْحَابُهُ فَأَخْبَرُوهُ أَنَّ الْوَبَأَ قَدْ وَقَعَ بِأَرْضِ الشَّامِ قَالَ ابْنُ عَبَّاسٍ فَقَالَ عُمَرُ بْنُ الْخَطَّابِ ادْعُ لِي الْمُهَاجِرِينَ الأَوَّلِينَ ‏.‏ فَدَعَاهُمْ فَاسْتَشَارَهُمْ وَأَخْبَرَهُمْ أَنَّ الْوَبَأَ قَدْ وَقَعَ بِالشَّامِ فَاخْتَلَفُوا فَقَالَ بَعْضُهُمْ قَدْ خَرَجْتَ لأَمْرٍ وَلاَ نَرَى أَنْ تَرْجِعَ عَنْهُ ‏.‏ وَقَالَ بَعْضُهُمْ مَعَكَ بَقِيَّةُ النَّاسِ وَأَصْحَابُ رَسُولِ اللَّهِ صلى الله عليه وسلم وَلاَ نَرَى أَنْ تُقْدِمَهُمْ عَلَى هَذَا الْوَبَإِ ‏.‏ فَقَالَ عُمَرُ ارْتَفِعُوا عَنِّي ‏.‏ ثُمَّ قَالَ ادْعُ لِي الأَنْصَارَ فَدَعَوْتُهُمْ فَاسْتَشَارَهُمْ فَسَلَكُوا سَبِيلَ الْمُهَاجِرِينَ وَاخْتَلَفُوا كَاخْتِلاَفِهِمْ فَقَالَ ارْتَفِعُوا عَنِّي ‏.‏ ثُمَّ قَالَ ادْعُ لِي مَنْ كَانَ هَا هُنَا مِنْ مَشْيَخَةِ قُرَيْشٍ مِنْ مُهَاجِرَةِ الْفَتْحِ ‏.‏ فَدَعَوْتُهُمْ فَلَمْ يَخْتَلِفْ عَلَيْهِ مِنْهُمُ اثْنَانِ فَقَالُوا نَرَى أَنْ تَرْجِعَ بِالنَّاسِ وَلاَ تُقْدِمَهُمْ عَلَى هَذَا الْوَبَإِ فَنَادَى عُمَرُ فِي النَّاسِ إِنِّي مُصْبِحٌ عَلَى ظَهْرٍ فَأَصْبِحُوا عَلَيْهِ ‏.‏ فَقَالَ أَبُو عُبَيْدَةَ أَفِرَارًا مِنْ قَدَرِ اللَّهِ فَقَالَ عُمَرُ لَوْ غَيْرُكَ قَالَهَا يَا أَبَا عُبَيْدَةَ نَعَمْ نَفِرُّ مِنْ قَدَرِ اللَّهِ إِلَى قَدَرِ اللَّهِ أَرَأَيْتَ لَوْ كَانَ لَكَ إِبِلٌ فَهَبَطَتْ وَادِيًا لَهُ عُدْوَتَانِ إِحْدَاهُمَا مُخْصِبَةٌ وَالأُخْرَى جَدْبَةٌ أَلَيْسَ إِنْ رَعَيْتَ الْخَصِبَةَ رَعَيْتَهَا بِقَدَرِ اللَّهِ وَإِنْ رَعَيْتَ الْجَدْبَةَ رَعَيْتَهَا بِقَدَرِ اللَّهِ فَجَاءَ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ - وَكَانَ غَائِبًا فِي بَعْضِ حَاجَتِهِ - فَقَالَ إِنَّ عِنْدِي مِنْ هَذَا عِلْمًا سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِذَا سَمِعْتُمْ بِهِ بِأَرْضٍ فَلاَ تَقْدَمُوا عَلَيْهِ وَإِذَا وَقَعَ بِأَرْضٍ وَأَنْتُمْ بِهَا فَلاَ تَخْرُجُوا فِرَارًا مِنْهُ ‏\"‏ ‏.‏ قَالَ فَحَمِدَ اللَّهَ عُمَرُ ثُمَّ انْصَرَفَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Abd al-Hamid\nibn Abd ar-Rahman ibn Zayd ibn al-Khattab from Abdullah ibn Abdullah\nibn al-Harith ibn Nawfal from Abdullah ibn Abbas that Umar ibn al-\nKhattab set out for ash Sham and when he was at Sargh, near Tabuk, the\ncommanders of the army, Abu Ubayda ibn al-Jarrah and his companions,\nmet him and told him that the plague had broken out in ash-Sham. Ibn\nAbbas said, \"Umar ibn al-Khattab said, 'all the first Muhajir unto\nme.' He assembled them and asked them for advice, informing them that\nthe plague had broken out in ash Sham. They disagreed. Some said, 'You\nhave set out for something, and we do not think that you should leave\nit.' Others said, 'You have the companions of the Prophet, may Allah\nbless him and grant him peace, and the rest of the people with you,\nand we do not think that you should send them towards this plague.'\nUmar said, 'Leave me.'\n\n\nThen he said, 'Summon the Ansar to\nme.' They were summoned and he asked them for advice. They acted as\nthe Muhajirun had and disagreed as they had disagreed. He said, 'Leave\nme.' \"Then he said, 'Summon to me whoever is here of the aged men of\nQuraysh from the Muhajirun of the conquest.' He summoned them and not\none of them differed. They said, 'We think that you should withdraw\nthe people and not send them towards the plague.' Umar called out to\nthe people, 'I am leaving by camel in the morning,' so they set out.\nAbu Ubayda said, 'Is it flight from the decree of Allah?' Umar said,\n'Better that someone other than you had said it, Abu Ubayda. Yes. We\nflee from the decree of Allah to the decree of Allah. What would you\nthink if these camels had gone down into a valley which had two\nslopes, one of them fertile, and the other barren. If you pastured in\nthe fertile part, wouldn't you pasture them by the decree of Allah? If\nyou pastured them in the barren part, wouldn't you pasture them by the\ndecree of Allah?'\n\n\n''Abd ar-Rahman ibn Awf arrived and he had\nbeen off doing something and he said, 'I have some knowledge of this.\nI heard the Messenger of Allah, may Allah bless him and grant him\npeace, say, \"If you hear about it in a land, do not go forward to it.\nIf it comes upon a land and you are in it, then do not depart in\nflight from it.\" ' Umar praised Allah and then set off.\""}},{"id":22,"idInBook":22,"chapterId":45,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، وَعَنْ سَالِمٍ أَبِي النَّضْرِ، مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ عَنْ عَامِرِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ، عَنْ أَبِيهِ، أَنَّهُ سَمِعَهُ يَسْأَلُ، أُسَامَةَ بْنَ زَيْدٍ مَا سَمِعْتَ مِنْ، رَسُولِ اللَّهِ صلى الله عليه وسلم فِي الطَّاعُونِ فَقَالَ أُسَامَةُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ الطَّاعُونُ رِجْزٌ أُرْسِلَ عَلَى طَائِفَةٍ مِنْ بَنِي إِسْرَائِيلَ أَوْ عَلَى مَنْ كَانَ قَبْلَكُمْ فَإِذَا سَمِعْتُمْ بِهِ بِأَرْضٍ فَلاَ تَدْخُلُوا عَلَيْهِ وَإِذَا وَقَعَ بِأَرْضٍ وَأَنْتُمْ بِهَا فَلاَ تَخْرُجُوا فِرَارًا مِنْهُ ‏\"‏ ‏.‏ قَالَ مَالِكٌ قَالَ أَبُو النَّضْرِ لاَ يُخْرِجُكُمْ إِلاَّ فِرَارٌ مِنْهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Muhammad ibn al-Munkadir and\nfrom Salim ibn Abi'n-Nadr, the mawla of Umar ibn Ubaydullah that Amir\nibn Sad ibn Abi Waqqas heard his father ask Usama ibn Zayd, \"Have you\nheard anything from the Messenger of Allah, may Allah bless him and\ngrant him peace, about the plague?\" Usama said, \"The Messenger of\nAllah, may Allah bless him and grant him peace, said, 'The plague is a\npunishment that was sent down on a party of the Banu Israil or whoever\nwas before them. When you hear of it in a land, do not enter it. If it\ncomes upon a land and you are in it, do not depart in flight from it.'\n\"\n\n\nMalik said that Abu'n-Nadr said, \"That is, do not depart\nwith no other intention but flight.\""}},{"id":23,"idInBook":23,"chapterId":45,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَامِرِ بْنِ رَبِيعَةَ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، خَرَجَ إِلَى الشَّامِ فَلَمَّا جَاءَ سَرْغَ بَلَغَهُ أَنَّ الْوَبَأَ قَدْ وَقَعَ بِالشَّامِ فَأَخْبَرَهُ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا سَمِعْتُمْ بِهِ بِأَرْضٍ فَلاَ تَقْدَمُوا عَلَيْهِ وَإِذَا وَقَعَ بِأَرْضٍ وَأَنْتُمْ بِهَا فَلاَ تَخْرُجُوا فِرَارًا مِنْهُ ‏\"‏ ‏.‏ فَرَجَعَ عُمَرُ بْنُ الْخَطَّابِ مِنْ سَرْغَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Abdullah ibn\nAmir ibn Rabia that Umar ibn al-Khattab went out to ash-Sham. When he\ncame to Sargh, near Tabuk, he heard that the plague had broken out in\nash-Sham. Abd ar-Rahman ibn Awf told him that the Messenger of Allah,\nmay Allah bless him and grant him peace, said, \"If you hear that a\nland has a plague in it, do not go forward to it. If it comes upon a\nland which you are in, do not depart in flight from it.\" Umar ibn al-\nKhattab came back from Sargh."}},{"id":24,"idInBook":24,"chapterId":45,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، إِنَّمَا رَجَعَ بِالنَّاسِ مِنْ سَرْغَ عَنْ حَدِيثِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Salim ibn\nAbdullah that Umar ibn al-Khattab turned people back at Sargh\naccording to the hadith of Abd ar-Rahman ibn Awf."}},{"id":25,"idInBook":25,"chapterId":45,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ قَالَ بَلَغَنِي أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ لَبَيْتٌ بِرُكْبَةَ أَحَبُّ إِلَىَّ مِنْ عَشَرَةِ أَبْيَاتٍ بِالشَّامِ ‏.‏ قَالَ مَالِكٌ يُرِيدُ لِطُولِ الأَعْمَارِ وَالْبَقَاءِ وَلِشِدَّةِ الْوَبَإِ بِالشَّامِ ‏.‏","english":{"narrator":"","text":"Yahya related to me that Malik said, \"I heard that Umar ibn al-\nKhattab said, 'A night in Rukba (a valley near Taif,) is more\npreferable to me than ten nights in ash-Sham.' \"\n\n\nMalik said,\n\"He meant to lengthen and preserve their lives because of the severity\nof the plague in ash-Sham .\""}}],"chapter":{"id":45,"bookId":7,"arabic":"كتاب الْمَدِينَةِ","english":"Madina"}}