{"metadata":{"length":10,"arabic":{"title":"موطأ مالك","author":"الإمام مالك بن أنس","introduction":"كتاب القدر"},"english":{"title":"Muwatta Malik","author":"Imam Malik ibn Anas","introduction":"The Decree"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":46,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ تَحَاجَّ آدَمُ وَمُوسَى فَحَجَّ آدَمُ مُوسَى قَالَ لَهُ مُوسَى أَنْتَ آدَمُ الَّذِي أَغْوَيْتَ النَّاسَ وَأَخْرَجْتَهُمْ مِنَ الْجَنَّةِ فَقَالَ لَهُ آدَمُ أَنْتَ مُوسَى الَّذِي أَعْطَاهُ اللَّهُ عِلْمَ كُلِّ شَىْءٍ وَاصْطَفَاهُ عَلَى النَّاسِ بِرِسَالَتِهِ قَالَ نَعَمْ ‏.‏ قَالَ أَفَتَلُومُنِي عَلَى أَمْرٍ قَدْ قُدِّرَ عَلَىَّ قَبْلَ أَنْ أُخْلَقَ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'z-Zinad from al-Araj from\nAbu Hurayra that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"Adam and Musa argued and Adam got the better of\nMusa. Musa rebuked Adam, 'You are Adam who led people astray and\nbrought them out of the Garden.' Adam said to him, 'You are Musa to\nwhom Allah gave knowledge of everything and whom he chose above people\nwith His message.' He said, 'Yes.' He said, 'Do you then censure me\nfor a matter which was decreed for me before I was created?' \""}},{"id":2,"idInBook":2,"chapterId":46,"bookId":7,"arabic":"وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَبِي أُنَيْسَةَ، عَنْ عَبْدِ الْحَمِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ زَيْدِ بْنِ الْخَطَّابِ، أَنَّهُ أَخْبَرَهُ عَنْ مُسْلِمِ بْنِ يَسَارٍ الْجُهَنِيِّ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، سُئِلَ عَنْ هَذِهِ الآيَةِ، ‏{‏وَإِذْ أَخَذَ رَبُّكَ مِنْ بَنِي آدَمَ مِنْ ظُهُورِهِمْ ذُرِّيَّتَهُمْ وَأَشْهَدَهُمْ عَلَى أَنْفُسِهِمْ أَلَسْتُ بِرَبِّكُمْ قَالُوا بَلَى شَهِدْنَا أَنْ تَقُولُوا يَوْمَ الْقِيَامَةِ إِنَّا كُنَّا عَنْ هَذَا غَافِلِينَ‏}‏ ‏.‏ فَقَالَ عُمَرُ بْنُ الْخَطَّابِ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يُسْأَلُ عَنْهَا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى خَلَقَ آدَمَ ثُمَّ مَسَحَ ظَهْرَهُ بِيَمِينِهِ فَاسْتَخْرَجَ مِنْهُ ذُرِّيَّةً فَقَالَ خَلَقْتُ هَؤُلاَءِ لِلْجَنَّةِ وَبِعَمَلِ أَهْلِ الْجَنَّةِ يَعْمَلُونَ ثُمَّ مَسَحَ ظَهْرَهُ فَاسْتَخْرَجَ مِنْهُ ذُرِّيَّةً فَقَالَ خَلَقْتُ هَؤُلاَءِ لِلنَّارِ وَبِعَمَلِ أَهْلِ النَّارِ يَعْمَلُونَ ‏\"‏ ‏.‏ فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ فَفِيمَ الْعَمَلُ قَالَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ اللَّهَ إِذَا خَلَقَ الْعَبْدَ لِلْجَنَّةِ اسْتَعْمَلَهُ بِعَمَلِ أَهْلِ الْجَنَّةِ حَتَّى يَمُوتَ عَلَى عَمَلٍ مِنْ أَعْمَالِ أَهْلِ الْجَنَّةِ فَيُدْخِلَهُ بِهِ الْجَنَّةَ وَإِذَا خَلَقَ الْعَبْدَ لِلنَّارِ اسْتَعْمَلَهُ بِعَمَلِ أَهْلِ النَّارِ حَتَّى يَمُوتَ عَلَى عَمَلٍ مِنْ أَعْمَالِ أَهْلِ النَّارِ فَيُدْخِلَهُ بِهِ النَّارَ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Zayd ibn Abi Unaysa that Abd\nal-Hamid ibn Abd ar-Rahman ibn Zayd ibn al-Khattab informed him from\nMuslim ibn Yasar al-Juhani that Umar ibn al-Khattab was asked about\nthis ayat - \"When your Lord took their progeny from the Banu Adam from\ntheir backs and made them testify against themselves. 'Am I not your\nLord?' They said, 'Yes, we bear witness'\n\n\nLest you should say\non the Day of Rising, 'We were heedless of that.'\" (Sura 7 ayat 172)\nUmar ibn al-Khattab said, \"I heard the Messenger of Allah, may Allah\nbless him and grant him peace, being asked about it. The Messenger of\nAllah, may Allah bless him and grant him peace, said, 'Allah, the\nBlessed, the Exalted, created Adam. Then He stroked his back with His\nright hand, and progeny issued from it. He said, \"I created these for\nthe Garden and they will act with the behaviour of the people of the\nGarden.\" Then He stroked his back again and brought forth progeny from\nhim. He said, \"I created these for the Fire and they will act with the\nbehaviour of the people of the Fire.\" 'A man said, 'Messenger of\nAllah! Then of what value are deeds?' The Messenger of Allah, may\nAllah bless him and grant him peace, answered, 'When Allah creates a\nslave for the Garden, he makes him use the behaviour of the people of\nthe Garden, so that he dies on one of the actions of the people of the\nGarden and by it He brings him into the Garden. When He creates a\nslave for the Fire, He makes him use the behaviour of the people of\nthe Fire, so that he dies on one of the actions of the people of the\nFire, and by it, He brings him into the Fire.' \""}},{"id":3,"idInBook":3,"chapterId":46,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ تَرَكْتُ فِيكُمْ أَمْرَيْنِ لَنْ تَضِلُّوا مَا تَمَسَّكْتُمْ بِهِمَا كِتَابَ اللَّهِ وَسُنَّةَ نَبِيِّهِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he heard that the Messenger\nof Allah, may Allah bless him and grant him peace, said, \"I have left\ntwo matters with you. As long as you hold to them, you will not go the\nwrong way. They are the Book of Allah and the Sunna of His Prophet.\""}},{"id":4,"idInBook":4,"chapterId":46,"bookId":7,"arabic":"وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ زِيَادِ بْنِ سَعْدٍ، عَنْ عَمْرِو بْنِ مُسْلِمٍ، عَنْ طَاوُسٍ الْيَمَانِيِّ، أَنَّهُ قَالَ أَدْرَكْتُ نَاسًا مِنْ أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم يَقُولُونَ كُلُّ شَىْءٍ بِقَدَرٍ ‏.‏ قَالَ طَاوُسٌ وَسَمِعْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ كُلُّ شَىْءٍ بِقَدَرٍ حَتَّى الْعَجْزِ وَالْكَيْسِ أَوِ الْكَيْسِ وَالْعَجْزِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ziyad ibn Sad from Amr ibn\nMuslim that Tawus al-Yamani said, \"I found some of the companions of\nthe Messenger of Allah, may Allah bless him and grant him peace,\nsaying 'Everything is by decree.' \" Tawus added, \"I heard Abdullah ibn\nUmar say that The Messenger of Allah, may Allah bless him and grant\nhim peace. said, 'Everything is by decree - even incapacity and\nability,' (or 'ability and incapacity').\""}},{"id":5,"idInBook":5,"chapterId":46,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ زِيَادِ بْنِ سَعْدٍ، عَنْ عَمْرِو بْنِ دِينَارٍ، أَنَّهُ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ الزُّبَيْرِ، يَقُولُ فِي خُطْبَتِهِ إِنَّ اللَّهَ هُوَ الْهَادِي وَالْفَاتِنُ ‏.‏","english":{"narrator":"","text":"Malik related to me from Ziyad ibn Sad that Amr ibn Dinar said,\n\"I heard Abdullah ibn az-Zubayr say in a khutba, 'Allah - He is the\nGuider and the One Who Tempts Away.' \""}},{"id":6,"idInBook":6,"chapterId":46,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَمِّهِ أَبِي سُهَيْلِ بْنِ مَالِكٍ، أَنَّهُ قَالَ كُنْتُ أَسِيرُ مَعَ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ فَقَالَ مَا رَأْيُكَ فِي هَؤُلاَءِ الْقَدَرِيَّةِ فَقُلْتُ رَأْيِي أَنْ تَسْتَتِيبَهُمْ فَإِنْ تَابُوا وَإِلاَّ عَرَضْتَهُمْ عَلَى السَّيْفِ ‏.‏ فَقَالَ عُمَرُ بْنُ عَبْدِ الْعَزِيزِ وَذَلِكَ رَأْيِي ‏.‏ قَالَ مَالِكٌ وَذَلِكَ رَأْيِي ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that his paternal uncle, Abu\nSuhayl ibn Malik said, \"I was a prisoner with Umar ibn Abd al-Aziz. He\nsaid, 'What do you think about these Qadariyya (fatalists)?' I said,\n'My opinion is that one should ask them to turn from wrong action, if\nthey will do so. If not, subject them to the sword.' Umar ibn Abd al-\nAziz said, 'That is my opinion.\n\n\nMalik added, \"That is my\nopinion also.\""}},{"id":7,"idInBook":7,"chapterId":46,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تَسْأَلِ الْمَرْأَةُ طَلاَقَ أُخْتِهَا لِتَسْتَفْرِغَ صَحْفَتَهَا وَلِتَنْكِحَ فَإِنَّمَا لَهَا مَا قُدِّرَ لَهَا ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'z-Zinad from al-Araj from\nAbu Hurayra that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"A woman should not ask for the divorce of her sister\nto make her plate empty and in order to marry. She has what is decreed\nfor her.\""}},{"id":8,"idInBook":8,"chapterId":46,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَزِيدَ بْنِ زِيَادٍ، عَنْ مُحَمَّدِ بْنِ كَعْبٍ الْقُرَظِيِّ، قَالَ قَالَ مُعَاوِيَةُ بْنُ أَبِي سُفْيَانَ وَهُوَ عَلَى الْمِنْبَرِ أَيُّهَا النَّاسُ إِنَّهُ لاَ مَانِعَ لِمَا أَعْطَى اللَّهُ وَلاَ مُعْطِيَ لِمَا مَنَعَ اللَّهُ وَلاَ يَنْفَعُ ذَا الْجَدِّ مِنْهُ الْجَدُّ مَنْ يُرِدِ اللَّهُ بِهِ خَيْرًا يُفَقِّهْهُ فِي الدِّينِ ‏.‏ ثُمَّ قَالَ مُعَاوِيَةُ سَمِعْتُ هَؤُلاَءِ الْكَلِمَاتِ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم عَلَى هَذِهِ الأَعْوَادِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yazid ibn Ziyad that Muhammad\nibn Kab al-Quradhi said, ''Muawiya ibn Abi Sufyan said from the\nmimbar, 'O people! Nothing keeps away what Allah gives and nothing\ngives what Allah keeps away. The earnestness of the earnest one does\nnot profit him. When Allah desires good for him, he gives him\nunderstanding in the deen.' Then Muawiya said, 'I heard these words\nfrom the Messenger of  Allah, may Allah bless him and grant him peace,\non these blocks of wood.' \""}},{"id":9,"idInBook":9,"chapterId":46,"bookId":7,"arabic":"وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّهُ كَانَ يُقَالُ الْحَمْدُ لِلَّهِ الَّذِي خَلَقَ كُلَّ شَىْءٍ كَمَا يَنْبَغِي الَّذِي لاَ يَعْجَلُ شَىْءٌ أَنَاهُ وَقَدَّرَهُ حَسْبِيَ اللَّهُ وَكَفَى سَمِعَ اللَّهُ لِمَنْ دَعَا لَيْسَ وَرَاءَ اللَّهِ مَرْمَى ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that this was\nsaid \"Praise be to Allah who created everything as is necessary, who\ndoes not hasten anything He defers and determines. Allah is enough for\nme and sufficient. Allah hears whoever makes dua to him. Allah does\nnot have a goal.\""}},{"id":10,"idInBook":10,"chapterId":46,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّهُ كَانَ يُقَالُ إِنَّ أَحَدًا لَنْ يَمُوتَ حَتَّى يَسْتَكْمِلَ رِزْقَهُ فَأَجْمِلُوا فِي الطَّلَبِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he heard that this was said\n\"No one will die until his provision is completed for him, so behave\ncorrectly in your seeking it.\""}}],"chapter":{"id":46,"bookId":7,"arabic":"كتاب القدر","english":"The Decree"}}