{"metadata":{"length":18,"arabic":{"title":"موطأ مالك","author":"الإمام مالك بن أنس","introduction":"كتاب حسن الخلق"},"english":{"title":"Muwatta Malik","author":"Imam Malik ibn Anas","introduction":"Good Character"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":47,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّ مُعَاذَ بْنَ جَبَلٍ، قَالَ آخِرُ مَا أَوْصَانِي بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ وَضَعْتُ رِجْلِي فِي الْغَرْزِ أَنْ قَالَ ‏\n\"‏ أَحْسِنْ خُلُقَكَ لِلنَّاسِ يَا مُعَاذُ بْنَ جَبَلٍ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Muadh ibn Jabal said, \"The\nlast advice the Messenger of Allah, may Allah bless him and grant him\npeace, gave me when I put my foot in the stirrup was that he said,\n'Make your character good for the people, Muadh ibn Jabal!' \""}},{"id":2,"idInBook":2,"chapterId":47,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ مَا خُيِّرَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي أَمْرَيْنِ قَطُّ إِلاَّ أَخَذَ أَيْسَرَهُمَا مَا لَمْ يَكُنْ إِثْمًا فَإِنْ كَانَ إِثْمًا كَانَ أَبْعَدَ النَّاسِ مِنْهُ وَمَا انْتَقَمَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِنَفْسِهِ إِلاَّ أَنْ تُنْتَهَكَ حُرْمَةُ اللَّهِ فَيَنْتَقِمُ لِلَّهِ بِهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Urwa ibn az-\nZubayr that A'isha, the wife of the Prophet, may Allah bless him and\ngrant him peace, said, \"The Messenger of Allah, may Allah bless him\nand grant him peace, did not have to choose between two matters, but\nthat he chose the easier of them as long as it was not a wrong action.\nIf it was a wrong action, he was the furthest of people from it. The\nMessenger of Allah, may Allah bless him and grant him peace, did not\ntake revenge for himself unless the limits of Allah were violated.\nThen he took revenge for it for Allah.\""}},{"id":3,"idInBook":3,"chapterId":47,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَلِيِّ بْنِ حُسَيْنِ بْنِ عَلِيِّ بْنِ أَبِي طَالِبٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مِنْ حُسْنِ إِسْلاَمِ الْمَرْءِ تَرْكُهُ مَا لاَ يَعْنِيهِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Ali ibn\nHusayn ibn Ali ibn Abi Talib that the Messenger of Allah, may Allah\nbless him and grant him peace, said, \"Part of the excellence of a\nman's Islam is that he leaves what does not concern him.\""}},{"id":4,"idInBook":4,"chapterId":47,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتِ اسْتَأْذَنَ رَجُلٌ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَتْ عَائِشَةُ وَأَنَا مَعَهُ فِي الْبَيْتِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ بِئْسَ ابْنُ الْعَشِيرَةِ ‏\"‏ ‏.‏ ثُمَّ أَذِنَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏ قَالَتْ عَائِشَةُ فَلَمْ أَنْشَبْ أَنْ سَمِعْتُ ضَحِكَ رَسُولِ اللَّهِ صلى الله عليه وسلم مَعَهُ فَلَمَّا خَرَجَ الرَّجُلُ قُلْتُ يَا رَسُولَ اللَّهِ قُلْتَ فِيهِ مَا قُلْتَ ثُمَّ لَمْ تَنْشَبْ أَنْ ضَحِكْتَ مَعَهُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ مِنْ شَرِّ النَّاسِ مَنِ اتَّقَاهُ النَّاسُ لِشَرِّهِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that A'isha, the\nwife of the Prophet, may Allah bless him and grant him peace, said, \"A\nman asked permission to come in to see the Messenger of Allah, may\nAllah bless him and grant him peace. I was with him in the house and\nthe Messenger of Allah, may Allah bless him and grant him peace, said,\n'He is an evil member of his tribe.' Then the Messenger of Allah, may\nAllah bless him and grant him peace, gave him permission.\"\n\n\nA'isha continued, \"It was not long before I heard the Messenger of\nAllah, may Allah bless him and grant him peace, laughing with him.\nWhen the man left, I said, 'Messenger of Allah, you said what you said\nabout him, and then before long you were laughing with him.' The\nMessenger of Allah, may Allah bless him and grant him peace, replied,\n'Among the most evil of people is the one whom people are cautious\nwith because of his evil.' \""}},{"id":5,"idInBook":5,"chapterId":47,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَمِّهِ أَبِي سُهَيْلِ بْنِ مَالِكٍ، عَنْ أَبِيهِ، عَنْ كَعْبِ الأَحْبَارِ، أَنَّهُ قَالَ إِذَا أَحْبَبْتُمْ أَنْ تَعْلَمُوا مَا لِلْعَبْدِ عِنْدَ رَبِّهِ فَانْظُرُوا مَاذَا يَتْبَعُهُ مِنْ حُسْنِ الثَّنَاءِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from his paternal uncle, Abu\nSuhayl ibn Malik from his father that Kab al-Ahbar said, \"If you want\nto know what a slave has with his Lord, then look at whatever good\npraise follows him.\""}},{"id":6,"idInBook":6,"chapterId":47,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ قَالَ بَلَغَنِي أَنَّ الْمَرْءَ، لَيُدْرِكُ بِحُسْنِ خُلُقِهِ دَرَجَةَ الْقَائِمِ بِاللَّيْلِ الظَّامِي بِالْهَوَاجِرِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Yahya ibn Said said, \"I have\nheard that by his good character a man can reach the degree of the one\nwho stands in prayer at night and the one who is thirsty from fasting\nin the heat of the day.\""}},{"id":7,"idInBook":7,"chapterId":47,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ قَالَ سَمِعْتُ سَعِيدَ بْنَ الْمُسَيَّبِ، يَقُولُ أَلاَ أُخْبِرُكُمْ بِخَيْرٍ، مِنْ كَثِيرٍ مِنَ الصَّلاَةِ وَالصَّدَقَةِ قَالُوا بَلَى ‏.‏ قَالَ إِصْلاَحُ ذَاتِ الْبَيْنِ وَإِيَّاكُمْ وَالْبِغْضَةَ فَإِنَّهَا هِيَ الْحَالِقَةُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Yahya ibn Said said that he\nheard Said ibn al-Musayyab say, \"Shall I tell you what is better than\nmuch prayer and sadaqa?\" They said, \"Yes.\" He said, \"Mending discord.\nAnd beware of hatred - it strips you (of your deen).\""}},{"id":8,"idInBook":8,"chapterId":47,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ قَدْ بَلَغَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ بُعِثْتُ لأُتَمِّمَ حُسْنَ الأَخْلاَقِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that the\nMessenger of Allah, may Allah bless him and grant him peace, said, \"I\nwas sent to perfect good character.\""}},{"id":9,"idInBook":9,"chapterId":47,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ سَلَمَةَ بْنِ صَفْوَانَ بْنِ سَلَمَةَ الزُّرَقِيِّ، عَنْ زَيْدِ بْنِ طَلْحَةَ بْنِ رُكَانَةَ، يَرْفَعُهُ إِلَى النَّبِيِّ صلى الله عليه وسلم قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لِكُلِّ دِينٍ خُلُقٌ وَخُلُقُ الإِسْلاَمِ الْحَيَاءُ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Salama ibn Safwan ibn Salama\naz-Zuraqi that Zayd ibn Talha ibn Rukana, who attributed it to the\nProphet, may Allah bless him and grant him peace, said, \"The Messenger\nof Allah, may Allah bless him and grant him peace, said, 'Every deen\nhas an innate character. The character of Islam is modesty.' \""}},{"id":10,"idInBook":10,"chapterId":47,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم مَرَّ عَلَى رَجُلٍ وَهُوَ يَعِظُ أَخَاهُ فِي الْحَيَاءِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ دَعْهُ فَإِنَّ الْحَيَاءَ مِنَ الإِيمَانِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Salim ibn\nAbdullah from Abdullah ibn Umar that the Messenger of Allah, may Allah\nbless him and grant him peace, passed by a man who was chiding his\nbrother about modesty. The Messenger of Allah, may Allah bless him and\ngrant him peace, said, \"Leave him. Modesty is part of iman.\""}},{"id":11,"idInBook":11,"chapterId":47,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، أَنَّ رَجُلاً، أَتَى إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ عَلِّمْنِي كَلِمَاتٍ أَعِيشُ بِهِنَّ وَلاَ تُكْثِرْ عَلَىَّ فَأَنْسَى ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ تَغْضَبْ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me from Ibn Shihab from Humayd ibn Abd ar-Rahman\nibn Awf that a man came to the Messenger of Allah, may Allah bless him\nand grant him peace, and said, \"Messenger of Allah, teach me some\nwords which I can live by. Do not make them too much for me, lest I\nforget.\" The Messenger of Allah, may Allah bless him and grant him\npeace, said, \"Do not be angry.\""}},{"id":12,"idInBook":12,"chapterId":47,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لَيْسَ الشَّدِيدُ بِالصُّرَعَةِ إِنَّمَا الشَّدِيدُ الَّذِي يَمْلِكُ نَفْسَهُ عِنْدَ الْغَضَبِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Said ibn al-\nMusayyab from Abu Hurayra that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"A strong person is not the person who\nthrows his adversaries to the ground. A strong person is the person\nwho contains himself when he is angry.\""}},{"id":13,"idInBook":13,"chapterId":47,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ، عَنْ أَبِي أَيُّوبَ الأَنْصَارِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَحِلُّ لِمُسْلِمٍ أَنْ يُهَاجِرَ أَخَاهُ فَوْقَ ثَلاَثِ لَيَالٍ يَلْتَقِيَانِ فَيُعْرِضُ هَذَا وَيُعْرِضُ هَذَا وَخَيْرُهُمَا الَّذِي يَبْدَأُ بِالسَّلاَمِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Ata ibn Yazid\nal-Laythi from Abu Ayyub al-Ansari that the Messenger of Allah, may\nAllah bless him and grant him peace, said, \"It is not halal for a\nmuslim to shun his brother for more than three nights, that is they\nmeet, and this one turns away and that one turns away. The better of\nthe two is the one who says the greeting first.\""}},{"id":14,"idInBook":14,"chapterId":47,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ تَبَاغَضُوا وَلاَ تَحَاسَدُوا وَلاَ تَدَابَرُوا وَكُونُوا عِبَادَ اللَّهِ إِخْوَانًا وَلاَ يَحِلُّ لِمُسْلِمٍ أَنْ يُهَاجِرَ أَخَاهُ فَوْقَ ثَلاَثِ لَيَالٍ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Anas ibn\nMalik that the Messenger of Allah, may Allah bless him and grant him\npeace, said, \"Do not be angry with each other and do not envy each\nother and do not turn away from each other, and be slaves of Allah,\nbrothers. It is not halal for a muslim to shun his brother for more\nthan three nights.\""}},{"id":15,"idInBook":15,"chapterId":47,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِيَّاكُمْ وَالظَّنَّ فَإِنَّ الظَّنَّ أَكْذَبُ الْحَدِيثِ وَلاَ تَجَسَّسُوا وَلاَ تَحَسَّسُوا وَلاَ تَنَافَسُوا وَلاَ تَحَاسَدُوا وَلاَ تَبَاغَضُوا وَلاَ تَدَابَرُوا وَكُونُوا عِبَادَ اللَّهِ إِخْوَانًا ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'z-Zinad from al-Araj from\nAbu Hurayra that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"Beware of suspicion. Suspicion is the most untrue\nspeech. Do not spy and do not eavesdrop. Do not compete with each\nother and do not envy each other and do not hate each other and do not\nshun each other. Be slaves of Allah, brothers.\""}},{"id":16,"idInBook":16,"chapterId":47,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَطَاءِ بْنِ أَبِي مُسْلِمٍ عَبْدِ اللَّهِ الْخُرَاسَانِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ تَصَافَحُوا يَذْهَبِ الْغِلُّ وَتَهَادَوْا تَحَابُّوا وَتَذْهَبِ الشَّحْنَاءُ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ata ibn Abi Muslim that\nAbdullah al-Khurasani said, \"The Messenger of Allah, may Allah bless\nhim and grant him peace, said, 'Shake hands and rancour will\ndisappear. Give presents to each other and love each other and enmity\nwill disappear.' \""}},{"id":17,"idInBook":17,"chapterId":47,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ تُفْتَحُ أَبْوَابُ الْجَنَّةِ يَوْمَ الاِثْنَيْنِ وَيَوْمَ الْخَمِيسِ فَيُغْفَرُ لِكُلِّ عَبْدٍ مُسْلِمٍ لاَ يُشْرِكُ بِاللَّهِ شَيْئًا إِلاَّ رَجُلاً كَانَتْ بَيْنَهُ وَبَيْنَ أَخِيهِ شَحْنَاءُ فَيُقَالُ أَنْظِرُوا هَذَيْنِ حَتَّى يَصْطَلِحَا أَنْظِرُوا هَذَيْنِ حَتَّى يَصْطَلِحَا ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Suhayl ibn Abi Salih from his\nfather from Abu Hurayra that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"The doors of the Garden are opened on\nMonday and Thursday. Every muslim slave who does not associate\nanything with Allah is forgiven except for the man who has enmity\nbetween him and his brother. It is said, 'Leave these two until they\nhave made a reconciliation. Leave these two until they have made a\nreconciliation.' \""}},{"id":18,"idInBook":18,"chapterId":47,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ مُسْلِمِ بْنِ أَبِي مَرْيَمَ، عَنْ أَبِي صَالِحٍ السَّمَّانِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ قَالَ تُعْرَضُ أَعْمَالُ النَّاسِ كُلَّ جُمُعَةٍ مَرَّتَيْنِ يَوْمَ الاِثْنَيْنِ وَيَوْمَ الْخَمِيسِ فَيُغْفَرُ لِكُلِّ عَبْدٍ مُؤْمِنٍ إِلاَّ عَبْدًا كَانَتْ بَيْنَهُ وَبَيْنَ أَخِيهِ شَحْنَاءُ فَيُقَالُ اتْرُكُوا هَذَيْنِ حَتَّى يَفِيئَا ‏.‏ أَوِ ارْكُوا هَذَيْنِ حَتَّى يَفِيئَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Muslim ibn Abi Maryam from\nAbu Salih as-Samman that Abu Hurayra said, \"The actions of people are\npresented twice each week, on Monday and Thursday. Every trusting\nslave is forgiven except for a slave who has enmity between him and\nhis brother. It is said, 'Leave these two until they turn in tawba.\nLeave these two until they turn in tawba.' ''"}}],"chapter":{"id":47,"bookId":7,"arabic":"كتاب حسن الخلق","english":"Good Character"}}