{"metadata":{"length":20,"arabic":{"title":"موطأ مالك","author":"الإمام مالك بن أنس","introduction":"كتاب اللباس"},"english":{"title":"Muwatta Malik","author":"Imam Malik ibn Anas","introduction":"Dress"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":48,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ الأَنْصَارِيِّ، أَنَّهُ قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي غَزْوَةِ بَنِي أَنْمَارٍ ‏.‏ قَالَ جَابِرٌ فَبَيْنَا أَنَا نَازِلٌ تَحْتَ شَجَرَةٍ إِذَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَقُلْتُ يَا رَسُولَ اللَّهِ هَلُمَّ إِلَى الظِّلِّ ‏.‏ قَالَ فَنَزَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقُمْتُ إِلَى غِرَارَةٍ لَنَا فَالْتَمَسْتُ فِيهَا شَيْئًا فَوَجَدْتُ فِيهَا جِرْوَ قِثَّاءٍ فَكَسَرْتُهُ ثُمَّ قَرَّبْتُهُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ مِنْ أَيْنَ لَكُمْ هَذَا ‏\"‏ ‏.‏ قَالَ فَقُلْتُ خَرَجْنَا بِهِ يَا رَسُولَ اللَّهِ مِنَ الْمَدِينَةِ ‏.‏ قَالَ جَابِرٌ وَعِنْدَنَا صَاحِبٌ لَنَا نُجَهِّزُهُ يَذْهَبُ يَرْعَى ظَهْرَنَا - قَالَ - فَجَهَّزْتُهُ ثُمَّ أَدْبَرَ يَذْهَبُ فِي الظَّهْرِ وَعَلَيْهِ بُرْدَانِ لَهُ قَدْ خَلَقَا - قَالَ - فَنَظَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَيْهِ فَقَالَ ‏\"‏ أَمَا لَهُ ثَوْبَانِ غَيْرُ هَذَيْنِ ‏\"‏ ‏.‏ فَقُلْتُ بَلَى يَا رَسُولَ اللَّهِ لَهُ ثَوْبَانِ فِي الْعَيْبَةِ كَسَوْتُهُ إِيَّاهُمَا ‏.‏ قَالَ ‏\"‏ فَادْعُهُ فَمُرْهُ فَلْيَلْبَسْهُمَا ‏\"‏ ‏.‏ قَالَ فَدَعَوْتُهُ فَلَبِسَهُمَا ثُمَّ وَلَّى يَذْهَبُ ‏.‏ قَالَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا لَهُ ضَرَبَ اللَّهُ عُنُقَهُ أَلَيْسَ هَذَا خَيْرًا لَهُ ‏\"‏ ‏.‏ قَالَ فَسَمِعَهُ الرَّجُلُ فَقَالَ يَا رَسُولَ اللَّهِ فِي سَبِيلِ اللَّهِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فِي سَبِيلِ اللَّهِ ‏\"‏ ‏.‏ قَالَ فَقُتِلَ الرَّجُلُ فِي سَبِيلِ اللَّهِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Zayd ibn Aslam that Jabir ibn\nAbdullah al-Ansari said, \"We went out with the Messenger of Allah, may\nAllah bless him and grant him peace, in the raid on the Banu Ammar\ntribe.\" Jabir said, \"I was resting under a tree when the Messenger of\nAllah, may Allah bless him and grant him peace, came. I said,\n'Messenger of Allah; come to the shade.' So the Messenger of Allah,\nmay Allah bless him and grant him peace, sat down, and I stood up and\nwent to a sack of ours. I looked in it for something and found a small\ncucumber and broke it. Then I brought it to the Messenger of Allah,\nmay Allah bless him and grant him peace. He said, 'From where did you\nget this?' I said, 'We brought it from Madina, Messenger of Allah.' \"\n\n\nJabir continued, \"We had a friend of ours with us whom we\nused to equip to go out to guard our mounts. I gave him what was\nnecessary and then he turned about to go to the mounts and he was\nwearing two threadbare cloaks of his. The Messenger of Allah, may\nAllah bless him and grant him peace, looked at him and said, 'Does he\nhave two garments other than these?' I said, 'Yes, Messenger of Allah.\nHe has two garments in the bag.' I gave them to him. He said, 'Let him\ngo and put them on.' I let him go to put them on. As he turned to go,\nthe Messenger of Allah, may Allah bless him and grant him peace,\nexclaimed, 'May Allah strike his neck. Isn't that better for him?' He\nsaid (taking him literally), 'Messenger of Allah, in the way of\nAllah.' The Messenger of Allah, may Allah bless him and grant him\npeace, said, 'In the way of Allah.' \" Jabir added, \"The man was killed\nin the way of Allah.\""}},{"id":2,"idInBook":2,"chapterId":48,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ إِنِّي لأُحِبُّ أَنْ أَنْظُرَ، إِلَى الْقَارِئِ أَبْيَضَ الثِّيَابِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he heard that Umar ibn al-\nKhattab said, \"I love to look at a Qur'an reader in white garments.\""}},{"id":3,"idInBook":3,"chapterId":48,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَيُّوبَ بْنِ أَبِي تَمِيمَةَ، عَنِ ابْنِ سِيرِينَ، قَالَ قَالَ عُمَرُ بْنُ الْخَطَّابِ إِذَا أَوْسَعَ اللَّهُ عَلَيْكُمْ فَأَوْسِعُوا عَلَى أَنْفُسِكُمْ جَمَعَ رَجُلٌ عَلَيْهِ ثِيَابَهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ayyub ibn Abi Tamim that Ibn\nSirin said, ''Umar ibn al-Khattab said, 'Allah has been generous to\nyou, so be generous to yourselves. Let a man wear a combination of his\ngarments.' \""}},{"id":4,"idInBook":4,"chapterId":48,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَلْبَسُ الثَّوْبَ الْمَصْبُوغَ بِالْمِشْقِ وَالْمَصْبُوغَ بِالزَّعْفَرَانِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nwore garments dyed with red earth and dyed with saffron."}},{"id":5,"idInBook":5,"chapterId":48,"bookId":7,"arabic":"قَالَ يَحْيَى وَسَمِعْتُ مَالِكًا، يَقُولُ وَأَنَا أَكْرَهُ، أَنْ يَلْبَسَ الْغِلْمَانُ، شَيْئًا مِنَ الذَّهَبِ لأَنَّهُ بَلَغَنِي أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ تَخَتُّمِ الذَّهَبِ فَأَنَا أَكْرَهُهُ لِلرِّجَالِ الْكَبِيرِ مِنْهُمْ وَالصَّغِيرِ ‏.‏ قَالَ يَحْيَى وَسَمِعْتُ مَالِكًا يَقُولُ فِي الْمَلاَحِفِ الْمُعَصْفَرَةِ فِي الْبُيُوتِ لِلرِّجَالِ وَفِي الأَفْنِيَةِ قَالَ لاَ أَعْلَمُ مِنْ ذَلِكَ شَيْئًا حَرَامًا وَغَيْرُ ذَلِكَ مِنَ اللِّبَاسِ أَحَبُّ إِلَىَّ ‏.‏","english":{"narrator":"","text":"Yahya said that he heard Malik say, \"I disapprove of youths wearing\nany gold because I heard that the Messenger of Allah, may Allah bless\nhim and grant him peace, forbade wearing gold rings, and I disapprove\nof it for males old or young.\"\n\n\nYahya said, \"I heard Malik say\nabout men wearing wraps dyed with safflower in their houses and\ncourtyards, 'I do not know that any of that is haram but I prefer\nother garments than that.' \""}},{"id":6,"idInBook":6,"chapterId":48,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا كَسَتْ عَبْدَ اللَّهِ بْنَ الزُّبَيْرِ مِطْرَفَ خَزٍّ كَانَتْ عَائِشَةُ تَلْبَسُهُ ‏.‏","english":{"narrator":"","text":"Malik related to me from Hisham ibn Urwa from his father that\nA'isha the wife of the Prophet, may Allah bless him and grant him\npeace, dressed Abdullah ibn az-Zubayr in a shawl of silk which A'isha\nused to wear."}},{"id":7,"idInBook":7,"chapterId":48,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَلْقَمَةَ بْنِ أَبِي عَلْقَمَةَ، عَنْ أُمِّهِ، أَنَّهَا قَالَتْ دَخَلَتْ حَفْصَةُ بِنْتُ عَبْدِ الرَّحْمَنِ عَلَى عَائِشَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم وَعَلَى حَفْصَةَ خِمَارٌ رَقِيقٌ فَشَقَّتْهُ عَائِشَةُ وَكَسَتْهَا خِمَارًا كَثِيفًا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Alqama ibn Abi Alqama that\nhis mother said, \"Hafsa bint Abd ar-Rahman visited A'isha, the wife of\nthe Prophet, may Allah bless him and grant him peace, and Hafsa was\nwearing a long thin head scarf. A'isha tore it in two and made a thick\none for her.\""}},{"id":8,"idInBook":8,"chapterId":48,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ مُسْلِمِ بْنِ أَبِي مَرْيَمَ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ قَالَ نِسَاءٌ كَاسِيَاتٌ عَارِيَاتٌ مَائِلاَتٌ مُمِيلاَتٌ لاَ يَدْخُلْنَ الْجَنَّةَ وَلاَ يَجِدْنَ رِيحَهَا وَرِيحُهَا يُوجَدُ مِنْ مَسِيرَةِ خَمْسِمِائَةِ سَنَةٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Muslim ibn Abi Maryam from\nAbu Salih that Abu Hurayra said, \"Women who are naked even though they\nare wearing clothes, go astray and make others go astray, and they\nwill not enter the Garden and they will not find its scent, and its\nscent is experienced from as far as the distance travelled in five\nhundred years.\""}},{"id":9,"idInBook":9,"chapterId":48,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَامَ مِنَ اللَّيْلِ فَنَظَرَ فِي أُفُقِ السَّمَاءِ فَقَالَ ‏\n\"‏ مَاذَا فُتِحَ اللَّيْلَةَ مِنَ الْخَزَائِنِ وَمَاذَا وَقَعَ مِنَ الْفِتَنِ كَمْ مِنْ كَاسِيَةٍ فِي الدُّنْيَا عَارِيَةٌ يَوْمَ الْقِيَامَةِ أَيْقِظُوا صَوَاحِبَ الْحُجَرِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said from Ibn\nShihab that the Messenger of Allah, may Allah bless him and grant him\npeace, stood up in the night and looked at the horizon of the sky. He\nsaid, \"What treasures has the night opened? What trials have occurred?\nHow many are dressed in this world and will be naked on the Day of\nRising. Warn the women in their rooms.\""}},{"id":10,"idInBook":10,"chapterId":48,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ الَّذِي يَجُرُّ ثَوْبَهُ خُيَلاَءَ لاَ يَنْظُرُ اللَّهُ إِلَيْهِ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abdullah ibn Dinar from\nAbdullah ibn Umar that the Messenger of Allah, may Allah bless him and\ngrant him peace, said, \"A person who drags his garment in arrogance\nwill not be looked at by Allah on the Day of Rising.\""}},{"id":11,"idInBook":11,"chapterId":48,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَنْظُرُ اللَّهُ تَبَارَكَ وَتَعَالَى يَوْمَ الْقِيَامَةِ إِلَى مَنْ يَجُرُّ إِزَارَهُ بَطَرًا ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'z-Zinad from al-Araj from\nAbu Hurayra that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"On the Day of Rising, Allah the Blessed, the\nExalted, will not look at a person who drags his lower garment in\narrogance.\""}},{"id":12,"idInBook":12,"chapterId":48,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، وَعَبْدِ اللَّهِ بْنِ دِينَارٍ، وَزَيْدِ بْنِ أَسْلَمَ، كُلُّهُمْ يُخْبِرُهُ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَنْظُرُ اللَّهُ يَوْمَ الْقِيَامَةِ إِلَى مَنْ يَجُرُّ ثَوْبَهُ خُيَلاَءَ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi and Abdullah ibn Dinar\nand Zayd ibn Aslam that all of them informed him from Abdullah ibn\nUmar that the Messenger of Allah, may Allah bless him and grant him\npeace, said, \"On the Day of Rising, Allah will not look at a person\nwho drags his garment in arrogance.\""}},{"id":13,"idInBook":13,"chapterId":48,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ الْعَلاَءِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِيهِ، أَنَّهُ قَالَ سَأَلْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ عَنِ الإِزَارِ، فَقَالَ أَنَا أُخْبِرُكَ بِعِلْمٍ، سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِزْرَةُ الْمُؤْمِنِ إِلَى أَنْصَافِ سَاقَيْهِ لاَ جُنَاحَ عَلَيْهِ فِيمَا بَيْنَهُ وَبَيْنَ الْكَعْبَيْنِ مَا أَسْفَلَ مِنْ ذَلِكَ فَفِي النَّارِ مَا أَسْفَلَ مِنْ ذَلِكَ فَفِي النَّارِ لاَ يَنْظُرُ اللَّهُ يَوْمَ الْقِيَامَةِ إِلَى مَنْ جَرَّ إِزَارَهُ بَطَرًا ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from al Ala ibn Abd ar-Rahman that\nhis father said, \"I asked Abu Said al-Khudri about the lower garment.\nHe said that he would inform me with knowledge and that he had heard\nthe Messenger of Allah, may Allah bless him and grant him peace, say,\n'The lower garment of the mumin should reach to the middle of his\ncalves. There is no harm in what is between that and the ankles. What\nis lower than that is in the Fire. What is lower than that is in the\nFire. On the Day of Rising, Allah will not look at a person who trails\nhis lower garment in arrogance.' \""}},{"id":14,"idInBook":14,"chapterId":48,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي بَكْرِ بْنِ نَافِعٍ، عَنْ أَبِيهِ، نَافِعٍ مَوْلَى ابْنِ عُمَرَ عَنْ صَفِيَّةَ بِنْتِ أَبِي عُبَيْدٍ، أَنَّهَا أَخْبَرَتْهُ عَنْ أُمِّ سَلَمَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ حِينَ ذُكِرَ الإِزَارُ فَالْمَرْأَةُ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ تُرْخِيهِ شِبْرًا ‏\"‏ ‏.‏ قَالَتْ أُمُّ سَلَمَةَ إِذًا يَنْكَشِفُ عَنْهَا ‏.‏ قَالَ ‏\"‏ فَذِرَاعًا لاَ تَزِيدُ عَلَيْهِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu Bakr ibn Nafi from his\nfather Nafi, the mawla of Ibn Umar that Safiyya bint Abi Ubayd\ninformed him that Umm Salama, the wife of the Prophet, may Allah bless\nhim and grant him peace, said that when the lower garment of women was\nmentioned to the Messenger of Allah, he said, \"She lets it down a\nhandspan.\" Umm Salama said, \"If it leaves her uncovered?\" He said,\n\"Then the length of a forearm and let her not increase it.\""}},{"id":15,"idInBook":15,"chapterId":48,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَمْشِيَنَّ أَحَدُكُمْ فِي نَعْلٍ وَاحِدَةٍ لِيُنْعَلْهُمَا جَمِيعًا أَوْ لِيُحْفِهِمَا جَمِيعًا ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'z-Zinad from al-Araj from\nAbu Hurayra that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"Do not wear one sandal. Wear both of them or go with\nboth feet bare.\""}},{"id":16,"idInBook":16,"chapterId":48,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا انْتَعَلَ أَحَدُكُمْ فَلْيَبْدَأْ بِالْيَمِينِ وَإِذَا نَزَعَ فَلْيَبْدَأْ بِالشِّمَالِ وَلْتَكُنِ الْيُمْنَى أَوَّلَهُمَا تُنْعَلُ وَآخِرَهُمَا تُنْزَعُ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'z-Zinad from al-Araj from\nAbu Hurayra that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"When you put on sandals, begin with the right foot.\nWhen you take them off, begin with the left foot. The right foot is\nthe first to be put in the sandal and the last to be taken out.\""}},{"id":17,"idInBook":17,"chapterId":48,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَمِّهِ أَبِي سُهَيْلِ بْنِ مَالِكٍ، عَنْ أَبِيهِ، عَنْ كَعْبِ الأَحْبَارِ، أَنَّ رَجُلاً، نَزَعَ نَعْلَيْهِ فَقَالَ لِمَ خَلَعْتَ نَعْلَيْكَ لَعَلَّكَ تَأَوَّلْتَ هَذِهِ الآيَةَ ‏{‏فَاخْلَعْ نَعْلَيْكَ إِنَّكَ بِالْوَادِي الْمُقَدَّسِ طُوًى‏}‏ قَالَ ثُمَّ قَالَ كَعْبٌ لِلرَّجُلِ أَتَدْرِي مَا كَانَتْ نَعْلاَ مُوسَى قَالَ مَالِكٌ لاَ أَدْرِي مَا أَجَابَهُ الرَّجُلُ فَقَالَ كَعْبٌ كَانَتَا مِنْ جِلْدِ حِمَارٍ مَيِّتٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from his paternal uncle Abu Suhayl\nibn Malik from his father that Kab al-Ahbar said to a man who took off\nhis sandals, \"Why have you taken off your sandals? Perhaps you have\ninterpreted this ayat, 'Remove your sandals. You are in the pure\nvalley of Tuwa?' (Sura 20 ayat 12) Do you know what the sandals of\nMusa were?\"\n\n\nMalik (the father of Abu Suhayl) said, \"I do not\nknow what the man answered.\" Kab said, \"They were made from the skin\nof a dead donkey.\""}},{"id":18,"idInBook":18,"chapterId":48,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ لِبْسَتَيْنِ وَعَنْ بَيْعَتَيْنِ عَنِ الْمُلاَمَسَةِ وَعَنِ الْمُنَابَذَةِ وَعَنْ أَنْ يَحْتَبِيَ الرَّجُلُ فِي ثَوْبٍ وَاحِدٍ لَيْسَ عَلَى فَرْجِهِ مِنْهُ شَىْءٌ وَعَنْ أَنْ يَشْتَمِلَ الرَّجُلُ بِالثَّوْبِ الْوَاحِدِ عَلَى أَحَدِ شِقَّيْهِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'z-Zinad from al-Araj that\nAbu Hurayra said, \"The Messenger of Allah, may Allah bless him and\ngrant him peace, forbade two sales. Mulamasa, in which a man is\nobliged to buy whatever he touches without any choice in the matter,\nand munabadha, in which two men throw their garment to each other\nwithout either seeing the other's garment. He also forbade two ways of\ndressing. One in which a man sits with his legs drawn up to his chest\nwrapped in one garment that does not cover his genitals, and the other\nin which a man wraps a single garment over one arm and shoulder\nrestricting them.\""}},{"id":19,"idInBook":19,"chapterId":48,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، رَأَى حُلَّةً سِيَرَاءَ تُبَاعُ عِنْدَ بَابِ الْمَسْجِدِ فَقَالَ يَا رَسُولَ اللَّهِ لَوِ اشْتَرَيْتَ هَذِهِ الْحُلَّةَ فَلَبِسْتَهَا يَوْمَ الْجُمُعَةِ وَلِلْوَفْدِ إِذَا قَدِمُوا عَلَيْكَ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّمَا يَلْبَسُ هَذِهِ مَنْ لاَ خَلاَقَ لَهُ فِي الآخِرَةِ ‏\"‏ ‏.‏ ثُمَّ جَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْهَا حُلَلٌ فَأَعْطَى عُمَرَ بْنَ الْخَطَّابِ مِنْهَا حُلَّةً فَقَالَ عُمَرُ يَا رَسُولَ اللَّهِ أَكَسَوْتَنِيهَا وَقَدْ قُلْتَ فِي حُلَّةِ عُطَارِدٍ مَا قُلْتَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَمْ أَكْسُكَهَا لِتَلْبَسَهَا ‏\"‏ ‏.‏ فَكَسَاهَا عُمَرُ أَخًا لَهُ مُشْرِكًا بِمَكَّةَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat Umar ibn al-Khattab saw a silk robe at the door of the mosque. He\nsaid, \"Messenger of Allah, would you buy this robe and wear it on\njumua and when envoys come to you?\" The Messenger of Allah, may Allah\nbless him and grant him peace, said, \"Only a person who has no portion\nin the next world wears this.\" Then the Messenger of Allah, may Allah\nbless him and grant him peace, was brought some robes of the same\nmaterial and gave Umar ibn al-Khattab one of the robes. Umar said,\n\"Messenger of Allah, do you clothe me in it when you said what you\nsaid about the robe of Utarid?\" The Messenger of Allah, may Allah\nbless him and grant him peace, said, \"I did not give it to you to\nwear.\" Umar gave it to a brother of his in Makka who was still an\nidolater."}},{"id":20,"idInBook":20,"chapterId":48,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، أَنَّهُ قَالَ قَالَ أَنَسُ بْنُ مَالِكٍ رَأَيْتُ عُمَرَ بْنَ الْخَطَّابِ وَهُوَ يَوْمَئِذٍ أَمِيرُ الْمَدِينَةِ وَقَدْ رَقَعَ بَيْنَ كَتِفَيْهِ بِرُقَعٍ ثَلاَثٍ لَبَّدَ بَعْضَهَا فَوْقَ بَعْضٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Ishaq ibn Abdullah ibn Abi\nTalha said, \"Anas ibn Malik said, 'I saw Umar ibn al-Khattab when he\nwas the amir of Madina. Three patches were sewn between his shoulders,\none patched over the other.' ''"}}],"chapter":{"id":48,"bookId":7,"arabic":"كتاب اللباس","english":"Dress"}}