{"metadata":{"length":42,"arabic":{"title":"موطأ مالك","author":"الإمام مالك بن أنس","introduction":"كتاب صفة النبى صلى الله عليه وسلم"},"english":{"title":"Muwatta Malik","author":"Imam Malik ibn Anas","introduction":"The Description of the Prophet, may Allah Bless Him and Grant Him Peace"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":49,"bookId":7,"arabic":"حَدَّثَنِي عَنْ مَالِكٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّهُ سَمِعَهُ يَقُولُ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم لَيْسَ بِالطَّوِيلِ الْبَائِنِ وَلاَ بِالْقَصِيرِ وَلَيْسَ بِالأَبْيَضِ الأَمْهَقِ وَلاَ بِالآدَمِ وَلاَ بِالْجَعْدِ الْقَطَطِ وَلاَ بِالسَّبِطِ بَعَثَهُ اللَّهُ عَلَى رَأْسِ أَرْبَعِينَ سَنَةً فَأَقَامَ بِمَكَّةَ عَشْرَ سِنِينَ وَبِالْمَدِينَةِ عَشْرَ سِنِينَ وَتَوَفَّاهُ اللَّهُ عَزَّ وَجَلَّ عَلَى رَأْسِ سِتِّينَ سَنَةً وَلَيْسَ فِي رَأْسِهِ وَلِحْيَتِهِ عِشْرُونَ شَعْرَةً بَيْضَاءَ صلى الله عليه وسلم ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Rabia ibn Abi Abd ar-Rahman\nheard Anas ibn Malik say, \"The Messenger of Allah, may Allah bless him\nand grant him peace, was not excessively tall or short. He was not\nvery pallid nor dark. He did not have curly hair or lank hair. Allah\ncommissioned him at the age of forty. He stayed in Makka ten years and\nat Madina for ten years and Allah the Mighty, the Majestic made him\ndie when he was sixty. There were not twenty white hairs in his hair\nor beard, may Allah bless him and grant him peace.\""}},{"id":2,"idInBook":2,"chapterId":49,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَرَانِي اللَّيْلَةَ عِنْدَ الْكَعْبَةِ فَرَأَيْتُ رَجُلاً آدَمَ كَأَحْسَنِ مَا أَنْتَ رَاءٍ مِنْ أُدْمِ الرِّجَالِ لَهُ لِمَّةٌ كَأَحْسَنِ مَا أَنْتَ رَاءٍ مِنَ اللِّمَمِ قَدْ رَجَّلَهَا فَهِيَ تَقْطُرُ مَاءً مُتَّكِئًا عَلَى رَجُلَيْنِ - أَوْ عَلَى عَوَاتِقِ رَجُلَيْنِ - يَطُوفُ بِالْكَعْبَةِ فَسَأَلْتُ مَنْ هَذَا قِيلَ هَذَا الْمَسِيحُ ابْنُ مَرْيَمَ ثُمَّ إِذَا أَنَا بِرَجُلٍ جَعْدٍ قَطَطٍ أَعْوَرِ الْعَيْنِ الْيُمْنَى كَأَنَّهَا عِنَبَةٌ طَافِيَةٌ فَسَأَلْتُ مَنْ هَذَا فَقِيلَ لِي هَذَا الْمَسِيحُ الدَّجَّالُ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat the Messenger of Allah, may Allah bless him and grant him peace,\nsaid, \"I dreamt at night that I was at the Kaba, and I saw a dark man\nlike the most handsome of dark men you have ever seen. He had hair\nreaching to between his ears and his shoulders like the most excellent\nof such hair that you have seen. He had combed his hair, and water was\ndripping from it. He was leaning on two men or on the shoulders of two\nmen doing tawaf around Kaba. I asked, 'Who is this?' It was said, 'al-\nMasih ibn Maryam.' Then we were with a man with wiry hair and blind in\nhis right eye, as if it was a floating grape. I asked 'Who is this?'\nIt was said to me, 'This is al-Masih ad-Dajjal.' \""}},{"id":3,"idInBook":3,"chapterId":49,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ خَمْسٌ مِنَ الْفِطْرَةِ تَقْلِيمُ الأَظَافِرِ وَقَصُّ الشَّارِبِ وَنَتْفُ الإِبْطِ وَحَلْقُ الْعَانَةِ وَالاِخْتِتَانُ ‏.‏","english":{"narrator":"Yahya related to me from Malik from Said ibn Abi Said al-Maqburi\nfrom his father that Abu Hurayra said, \"There are five things from the\nfitra:","text":"cutting the nails, trimming the moustache, removing the hair\nfrom the armpit, shaving the pubic region and circumcision.\""}},{"id":4,"idInBook":4,"chapterId":49,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ قَالَ كَانَ إِبْرَاهِيمُ صلى الله عليه وسلم أَوَّلَ النَّاسِ ضَيَّفَ الضَّيْفَ وَأَوَّلَ النَّاسِ اخْتَتَنَ وَأَوَّلَ النَّاسِ قَصَّ الشَّارِبَ وَأَوَّلَ النَّاسِ رَأَى الشَّيْبَ فَقَالَ يَا رَبِّ مَا هَذَا فَقَالَ اللَّهُ تَبَارَكَ وَتَعَالَى وَقَارٌ يَا إِبْرَاهِيمُ ‏.‏ فَقَالَ رَبِّ زِدْنِي وَقَارًا ‏.‏ قَالَ يَحْيَى وَسَمِعْتُ مَالِكًا يَقُولُ يُؤْخَذُ مِنَ الشَّارِبِ حَتَّى يَبْدُوَ طَرَفُ الشَّفَةِ وَهُوَ الإِطَارُ وَلاَ يَجُزُّهُ فَيُمَثِّلُ بِنَفْسِهِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said that Said ibn\nal-Musayyub said, \"Ibrahim, may Allah bless him and grant him peace,\nwas the first to give hospitality to the guest and the first person to\nbe circumcised and the first person to trim the moustache and the\nfirst person to see grey hair. He said, 'O Lord! What is this?' Allah\nthe Blessed, the Exalted, said, 'It is dignity, Ibrahim.' He said,\n'Lord, increase me in dignity!' \"\n\n\nYahya said that he had\nheard Malik say, \"One takes from the moustache until the edge of the\nlip appears, that is the rim. One does not cut if off completely so\nthat one mutilates oneself.\""}},{"id":5,"idInBook":5,"chapterId":49,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ السَّلَمِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى أَنْ يَأْكُلَ الرَّجُلُ بِشِمَالِهِ أَوْ يَمْشِيَ فِي نَعْلٍ وَاحِدَةٍ وَأَنْ يَشْتَمِلَ الصَّمَّاءَ وَأَنْ يَحْتَبِيَ فِي ثَوْبٍ وَاحِدٍ كَاشِفًا عَنْ فَرْجِهِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'z-Zubayr from Jabir ibn\nAbdullah as-Salami that the Messenger of Allah, may Allah bless him\nand grant him peace, forbade a man to eat with his left hand or walk\nin one sandal or wrap a single garment around his drawn-up legs\nexposing his genitals."}},{"id":6,"idInBook":6,"chapterId":49,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي بَكْرِ بْنِ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا أَكَلَ أَحَدُكُمْ فَلْيَأْكُلْ بِيَمِينِهِ وَلْيَشْرَبْ بِيَمِينِهِ فَإِنَّ الشَّيْطَانَ يَأْكُلُ بِشِمَالِهِ وَيَشْرَبُ بِشِمَالِهِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Abu Bakr ibn\nUbaydullah ibn Abdullah ibn Umar from Abdullah ibn Umar that the\nMessenger of Allah, may Allah bless him and grant him peace, said,\n\"When you eat, eat with your right hand and drink with your right\nhand. Shaytan eats with his left hand and drinks with his left hand.\""}},{"id":7,"idInBook":7,"chapterId":49,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لَيْسَ الْمِسْكِينُ بِهَذَا الطَّوَّافِ الَّذِي يَطُوفُ عَلَى النَّاسِ فَتَرُدُّهُ اللُّقْمَةُ وَاللُّقْمَتَانِ وَالتَّمْرَةُ وَالتَّمْرَتَانِ ‏\"‏ ‏.‏ قَالُوا فَمَا الْمِسْكِينُ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ الَّذِي لاَ يَجِدُ غِنًى يُغْنِيهِ وَلاَ يَفْطُنُ النَّاسُ لَهُ فَيُتَصَدَّقَ عَلَيْهِ وَلاَ يَقُومُ فَيَسْأَلَ النَّاسَ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'z-Zinad from al-Araj from\nAbu Hurayra that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"The very poor are not the people who constantly walk\nfrom person to person and are given one or two morsels, and one or two\ndates.\" They said, \"Who are the very poor, Messenger of Allah?\" He\nsaid, \"People who do not find enough for themselves and other people\nare not aware of them to give sadaqa to them, and they do not start\nbegging from other people.\""}},{"id":8,"idInBook":8,"chapterId":49,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنِ ابْنِ بُجَيْدٍ الأَنْصَارِيِّ، ثُمَّ الْحَارِثِيِّ عَنْ جَدَّتِهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ رُدُّوا الْمِسْكِينَ وَلَوْ بِظِلْفٍ مُحْرَقٍ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Zayd ibn Aslam from Ibn\nBujayd (formerly al-Ansari) from his grandmother that the Messenger of\nAllah, may Allah bless him and grant him peace, said, \"Give to the\nvery poor, if only a roasted hoof.\""}},{"id":9,"idInBook":9,"chapterId":49,"bookId":7,"arabic":"حَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ يَأْكُلُ الْمُسْلِمُ فِي مِعًى وَاحِدٍ وَالْكَافِرُ يَأْكُلُ فِي سَبْعَةِ أَمْعَاءٍ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'z-Zinad from al-Araj that\nAbu Hurayra said, \"The Messenger of Allah, may Allah bless him and\ngrant him peace, said, 'The muslim eats in one intestine, and the\nkafir eats in seven!' \""}},{"id":10,"idInBook":10,"chapterId":49,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم ضَافَهُ ضَيْفٌ كَافِرٌ فَأَمَرَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم بِشَاةٍ فَحُلِبَتْ فَشَرِبَ حِلاَبَهَا ثُمَّ أُخْرَى فَشَرِبَهُ ثُمَّ أُخْرَى فَشَرِبَهُ حَتَّى شَرِبَ حِلاَبَ سَبْعِ شِيَاهٍ ثُمَّ إِنَّهُ أَصْبَحَ فَأَسْلَمَ فَأَمَرَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم بِشَاةٍ فَحُلِبَتْ فَشَرِبَ حِلاَبَهَا ثُمَّ أَمَرَ لَهُ بِأُخْرَى فَلَمْ يَسْتَتِمَّهَا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ الْمُؤْمِنُ يَشْرَبُ فِي مِعًى وَاحِدٍ وَالْكَافِرُ يَشْرَبُ فِي سَبْعَةِ أَمْعَاءٍ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Suhayl ibn Abi Salih from his\nfather from Abu Hurayra that the Messenger of Allah, may Allah bless\nhim and grant him peace, gave hospitality to a kafir guest. The\nMessenger of Allah, may Allah bless him and grant him peace, ordered a\nsheep to be brought for him and it was milked. He drank its milk. Then\nanother came, and he drank it. Then another came and he drank it until\nhe had drunk the milk of seven sheep. In the morning he became muslim,\nand the Messenger of Allah, may Allah bless him and grant him peace,\nordered a sheep for him. It was milked and he drank its milk. Then he\nordered another for him and he could not finish it. The Messenger of\nAllah, may Allah bless him and grant him peace, said, \"The mumin\ndrinks in one intestine, and the kafir drinks in seven intestines.\""}},{"id":11,"idInBook":11,"chapterId":49,"bookId":7,"arabic":"حَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ زَيْدِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ بْنِ الْخَطَّابِ، عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ الصِّدِّيقِ، عَنْ أُمِّ سَلَمَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ الَّذِي يَشْرَبُ فِي آنِيَةِ الْفِضَّةِ إِنَّمَا يُجَرْجِرُ فِي بَطْنِهِ نَارَ جَهَنَّمَ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi from Zayd ibn Abdullah\nibn Umar ibn al-Khattab from Abdullah ibn Abd ar-Rahman ibn Abi\nBakras-Siddiq from Umm Salama, the wife of the Prophet, may Allah\nbless him and grant him peace, that the Messenger of Allah, may Allah\nbless him and grant him peace, said, \"A person who drinks from a\nsilver vessel brings the fire of Jahannam into his belly.\""}},{"id":12,"idInBook":12,"chapterId":49,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَيُّوبَ بْنِ حَبِيبٍ، مَوْلَى سَعْدِ بْنِ أَبِي وَقَّاصٍ عَنْ أَبِي الْمُثَنَّى الْجُهَنِيِّ، أَنَّهُ قَالَ كُنْتُ عِنْدَ مَرْوَانَ بْنِ الْحَكَمِ فَدَخَلَ عَلَيْهِ أَبُو سَعِيدٍ الْخُدْرِيُّ فَقَالَ لَهُ مَرْوَانُ بْنُ الْحَكَمِ أَسَمِعْتَ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ نَهَى عَنِ النَّفْخِ فِي الشَّرَابِ فَقَالَ لَهُ أَبُو سَعِيدٍ نَعَمْ فَقَالَ لَهُ رَجُلٌ يَا رَسُولَ اللَّهِ إِنِّي لاَ أَرْوَى مِنْ نَفَسٍ وَاحِدٍ ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَأَبِنِ الْقَدَحَ عَنْ فِيكَ ثُمَّ تَنَفَّسْ ‏\"‏ ‏.‏ قَالَ فَإِنِّي أَرَى الْقَذَاةَ فِيهِ ‏.‏ قَالَ ‏\"‏ فَأَهْرِقْهَا ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ayyub ibn Habib, the mawla of\nSad ibn Abi Waqqas that Abu'l-Muthanna al-Juhani said, \"I was with\nMarwan ibn al-Hakam and Abu Said al-Khudri came to him. Marwan ibn al-\nHakam said to him, 'Have you heard that the Messenger of Allah, may\nAllah bless him and grant him peace, forbade blowing into drinks?' Abu\nSaid said to him, 'Yes.' A man said to him, 'Messenger of Allah, I am\nnot quenched from one breath.' The Messenger of Allah, may Allah bless\nhim and grant him peace, said to him, 'Remove the cup from your mouth\nand then breathe.' He said, 'Sometimes I see something floating in\nit?' He said, 'Then pour it out.'\""}},{"id":13,"idInBook":13,"chapterId":49,"bookId":7,"arabic":"حَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عُمَرَ بْنَ الْخَطَّابِ، وَعَلِيَّ بْنَ أَبِي طَالِبٍ، وَعُثْمَانَ بْنَ عَفَّانَ، كَانُوا يَشْرَبُونَ قِيَامًا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Umar ibn\nal-Khattab and Ali ibn Abi Talib and Uthman ibn Affan drank while\nstanding."}},{"id":14,"idInBook":14,"chapterId":49,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ عَائِشَةَ أُمَّ الْمُؤْمِنِينَ، وَسَعْدَ بْنَ أَبِي وَقَّاصٍ، كَانَا لاَ يَرَيَانِ بِشُرْبِ الإِنْسَانِ وَهُوَ قَائِمٌ بَأْسًا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab that A'isha, umm\nal-muminin and Sad ibn Abi Waqqas did not see any harm in a man\ndrinking while standing."}},{"id":15,"idInBook":15,"chapterId":49,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ أَبِي جَعْفَرٍ الْقَارِيِّ، أَنَّهُ قَالَ رَأَيْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ يَشْرَبُ قَائِمًا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Abu Jafar al-Qari said, \"I\nsaw Abdullah ibn Umar drink while standing.\""}},{"id":16,"idInBook":16,"chapterId":49,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَامِرِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، عَنْ أَبِيهِ، أَنَّهُ كَانَ يَشْرَبُ قَائِمًا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Amir ibn Abdullah ibn az-\nZubayr that his father used to drink while standing."}},{"id":17,"idInBook":17,"chapterId":49,"bookId":7,"arabic":"حَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أُتِيَ بِلَبَنٍ قَدْ شِيبَ بِمَاءٍ مِنَ الْبِئْرِ وَعَنْ يَمِينِهِ أَعْرَابِيٌّ وَعَنْ يَسَارِهِ أَبُو بَكْرٍ الصِّدِّيقُ فَشَرِبَ ثُمَّ أَعْطَى الأَعْرَابِيَّ وَقَالَ ‏\n\"‏ الأَيْمَنَ فَالأَيْمَنَ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Anas ibn\nMalik that the Messenger of Allah, may Allah bless him and grant him\npeace, was brought some milk which was mixed with well-water. There\nwas a Bedouin at his right side and Abu Bakr as-Siddiq on his left. He\ndrank and then gave it to the Bedouin and said, \"The right-hand to the\nright-hand.\""}},{"id":18,"idInBook":18,"chapterId":49,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي حَازِمِ بْنِ دِينَارٍ، عَنْ سَهْلِ بْنِ سَعْدٍ الأَنْصَارِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أُتِيَ بِشَرَابٍ فَشَرِبَ مِنْهُ وَعَنْ يَمِينِهِ غُلاَمٌ وَعَنْ يَسَارِهِ الأَشْيَاخُ فَقَالَ لِلْغُلاَمِ ‏\n\"‏ أَتَأْذَنُ لِي أَنْ أُعْطِيَ هَؤُلاَءِ ‏\"‏ ‏.‏ فَقَالَ الْغُلاَمُ لاَ وَاللَّهِ يَا رَسُولَ اللَّهِ لاَ أُوثِرُ بِنَصِيبِي مِنْكَ أَحَدًا ‏.‏ قَالَ فَتَلَّهُ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي يَدِهِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu Hazim ibn Dinar from Sahl\nibn Sad al-Ansari that the Messenger of Allah, may Allah bless him and\ngrant him peace, was brought a drink and he drank some of it. There\nwas a boy at his right and some old men on his left. He said to the\nboy, \"Will you give me permission to give it to these people?\" The boy\nsaid, \"No, Messenger of Allah, I will not prefer anyone to get my\nportion from you.\" He said, \"So the Messenger of Allah, may Allah\nbless him and grant him peace, placed it in his hand.\""}},{"id":19,"idInBook":19,"chapterId":49,"bookId":7,"arabic":"حَدَّثَنِي عَنْ مَالِكٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَقُولُ قَالَ أَبُو طَلْحَةَ لأُمِّ سُلَيْمٍ لَقَدْ سَمِعْتُ صَوْتَ، رَسُولِ اللَّهِ صلى الله عليه وسلم ضَعِيفًا أَعْرِفُ فِيهِ الْجُوعَ فَهَلْ عِنْدَكِ مِنْ شَىْءٍ فَقَالَتْ نَعَمْ ‏.‏ فَأَخْرَجَتْ أَقْرَاصًا مِنْ شَعِيرٍ ثُمَّ أَخَذَتْ خِمَارًا لَهَا فَلَفَّتِ الْخُبْزَ بِبَعْضِهِ ثُمَّ دَسَّتْهُ تَحْتَ يَدِي وَرَدَّتْنِي بِبَعْضِهِ ثُمَّ أَرْسَلَتْنِي إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ فَذَهَبْتُ بِهِ فَوَجَدْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم جَالِسًا فِي الْمَسْجِدِ وَمَعَهُ النَّاسُ فَقُمْتُ عَلَيْهِمْ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ آرْسَلَكَ أَبُو طَلْحَةَ ‏\"‏ ‏.‏ قَالَ فَقُلْتُ نَعَمْ ‏.‏ قَالَ ‏\"‏ لِلطَّعَامِ ‏\"‏ ‏.‏ فَقُلْتُ نَعَمْ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِمَنْ مَعَهُ ‏\"‏ قُومُوا ‏\"‏ ‏.‏ قَالَ فَانْطَلَقَ وَانْطَلَقْتُ بَيْنَ أَيْدِيهِمْ حَتَّى جِئْتُ أَبَا طَلْحَةَ فَأَخْبَرْتُهُ فَقَالَ أَبُو طَلْحَةَ يَا أُمَّ سُلَيْمٍ قَدْ جَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِالنَّاسِ وَلَيْسَ عِنْدَنَا مِنَ الطَّعَامِ مَا نُطْعِمُهُمْ ‏.‏ فَقَالَتِ اللَّهُ وَرَسُولُهُ أَعْلَمُ ‏.‏ قَالَ فَانْطَلَقَ أَبُو طَلْحَةَ حَتَّى لَقِيَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَأَقْبَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَبُو طَلْحَةَ مَعَهُ حَتَّى دَخَلاَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَلُمِّي يَا أُمَّ سُلَيْمٍ مَا عِنْدَكِ ‏\"‏ ‏.‏ فَأَتَتْ بِذَلِكَ الْخُبْزِ فَأَمَرَ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم فَفُتَّ وَعَصَرَتْ عَلَيْهِ أُمُّ سُلَيْمٍ عُكَّةً لَهَا فَآدَمَتْهُ ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم مَا شَاءَ اللَّهُ أَنْ يَقُولَ ثُمَّ قَالَ ‏\"‏ ائْذَنْ لِعَشَرَةٍ بِالدُّخُولِ ‏\"‏ ‏.‏ فَأَذِنَ لَهُمْ فَأَكَلُوا حَتَّى شَبِعُوا ثُمَّ خَرَجُوا ثُمَّ قَالَ ‏\"‏ ائْذَنْ لِعَشَرَةٍ ‏\"‏ ‏.‏ فَأَذِنَ لَهُمْ فَأَكَلُوا حَتَّى شَبِعُوا ثُمَّ خَرَجُوا ثُمَّ قَالَ ‏\"‏ ائْذَنْ لِعَشَرَةٍ ‏\"‏ ‏.‏ فَأَذِنَ لَهُمْ فَأَكَلُوا حَتَّى شَبِعُوا ثُمَّ خَرَجُوا ثُمَّ قَالَ ‏\"‏ ائْذَنْ لِعَشَرَةٍ ‏\"‏ ‏.‏ فَأَذِنَ لَهُمْ فَأَكَلُوا حَتَّى شَبِعُوا ثُمَّ خَرَجُوا ثُمَّ قَالَ ‏\"‏ ائْذَنْ لِعَشَرَةٍ ‏\"‏ ‏.‏ حَتَّى أَكَلَ الْقَوْمُ كُلُّهُمْ وَشَبِعُوا وَالْقَوْمُ سَبْعُونَ رَجُلاً أَوْ ثَمَانُونَ رَجُلاً ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Ishaq ibn Abdullah ibn Abi\nTalha heard Anas ibn Malik say that Abu Talha had said to Umm Sulaym,\n\"I have just been listening to the Messenger of Allah, may Allah bless\nhim and grant him peace, and his voice was very weak. I recognised\nhunger in it, so, do you have anything?\" She replied, \"Yes,\" and\nbrought out some barley loaves. She took her long head scarf and\nwrapped up the bread with part of it and put it into my (Anas's) hand\nand gave me part of it to wear. Then she sent me to the Messenger of\nAllah, may Allah bless him and grant him peace.\"\n\n\nAnas\ncontinued, \"I took it, and I found the Messenger of Allah, may Allah\nbless him and grant him peace, sitting in the mosque with some people.\nI watched them. The Messenger of Allah, may Allah bless him and grant\nhim peace, said, 'Did Abu Talha send you?' I replied, 'Yes.' He said,\n'For food?' I said, 'Yes.' The Messenger of Allah, may Allah bless him\nand grant him peace, said to those with him, 'Let us go.' He set off\nand I went among them until I came to Abu Talha and told him. Abu\nTalha said, 'Umm Sulaym! The Messenger of Allah, may Allah bless him\nand grant him peace, has brought people and we have no food. What\nshall we give them to eat?' She said, 'Allah and His Messenger know\nbest.' \"\n\n\nAnas continued, \"Abu Talha went out and met the\nMessenger of Allah, may Allah bless him and grant him peace, and the\nMessenger of Allah, may Allah bless him and grant him peace,\napproached with Abu Talha until they entered. The Messenger of Allah,\nmay Allah bless him and grant him peace, said, 'Come now, Umm Sulaym,\nwhat have you got?' She brought out bread. The Messenger of Allah, may\nAllah bless him and grant him peace, ordered it to be broken into\npieces, and Umm Sulaym squeezed out onto it a container of clarified\nbutter which she had seasoned. Then the Messenger of Allah, may Allah\nbless him and grant him peace, said whatever Allah wished him to say,\nand said, 'Will you give permission for ten of them to come in?' He\ngave them permission, and they ate until they were full and then left.\nHe said, 'Give permission to ten more.' He gave them permission, and\nthey ate until they were full and left. Then he said, 'Give permission\nto ten more.' He gave them permission and they ate until they were\nfull and left. Then he said, 'Give permission to ten more.' He gave\npermission and they ate until they were full and left. There were\nseventy or eighty men.\""}},{"id":20,"idInBook":20,"chapterId":49,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ طَعَامُ الاِثْنَيْنِ كَافِي الثَّلاَثَةِ وَطَعَامُ الثَّلاَثَةِ كَافِي الأَرْبَعَةِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'z-Zinad from al-Araj from\nAbu Hurayra that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"The food of two is enough for three, and the food of\nthree is enough for four.\""}},{"id":21,"idInBook":21,"chapterId":49,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزُّبَيْرِ الْمَكِّيِّ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَغْلِقُوا الْبَابَ وَأَوْكُوا السِّقَاءَ وَأَكْفِئُوا الإِنَاءَ - أَوْ خَمِّرُوا الإِنَاءَ - وَأَطْفِئُوا الْمِصْبَاحَ فَإِنَّ الشَّيْطَانَ لاَ يَفْتَحُ غَلَقًا وَلاَ يَحُلُّ وِكَاءً وَلاَ يَكْشِفُ إِنَاءً وَإِنَّ الْفُوَيْسِقَةَ تُضْرِمُ عَلَى النَّاسِ بَيْتَهُمْ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'z-Zubayr al-Makki from\nJabir ibn Abdullah that the Messenger of Allah, may Allah bless him\nand grant him peace, said, \"Lock the door, tie the waterskin, turn the\nvessel over or cover it, and put out the lamp. Shaytan does not open a\nlocked door or untie a tied knot, or uncover a vessel. A mouse may set\nfire to people's houses about them.\""}},{"id":22,"idInBook":22,"chapterId":49,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي شُرَيْحٍ الْكَعْبِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلْيَقُلْ خَيْرًا أَوْ لِيَصْمُتْ وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلْيُكْرِمْ جَارَهُ وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلْيُكْرِمْ ضَيْفَهُ جَائِزَتُهُ يَوْمٌ وَلَيْلَةٌ وَضِيَافَتُهُ ثَلاَثَةُ أَيَّامٍ فَمَا كَانَ بَعْدَ ذَلِكَ فَهُوَ صَدَقَةٌ وَلاَ يَحِلُّ لَهُ أَنْ يَثْوِيَ عِنْدَهُ حَتَّى يُحْرِجَهُ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Said ibn Abi Said al-Maqburi\nfrom Abu Shurayh al-Kabi that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"Whoever believes in Allah and the Last\nDay should speak good or be silent. Whoever believes in Allah and the\nLast Day should be generous to his neighbour. Whoever believes in\nAllah and the Last Day, should be generous to his guest. His welcome\nis for a day and a night, and his hospitality is for three days.\nWhatever is more than that is sadaqa. It is not halal for a guest to\nstay with a man until he becomes a burden.\""}},{"id":23,"idInBook":23,"chapterId":49,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ سُمَىٍّ، مَوْلَى أَبِي بَكْرٍ عَنْ أَبِي صَالِحٍ السَّمَّانِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ بَيْنَمَا رَجُلٌ يَمْشِي بِطَرِيقٍ إِذِ اشْتَدَّ عَلَيْهِ الْعَطَشُ فَوَجَدَ بِئْرًا فَنَزَلَ فِيهَا فَشَرِبَ وَخَرَجَ فَإِذَا كَلْبٌ يَلْهَثُ يَأْكُلُ الثَّرَى مِنَ الْعَطَشِ فَقَالَ الرَّجُلُ لَقَدْ بَلَغَ هَذَا الْكَلْبَ مِنَ الْعَطَشِ مِثْلُ الَّذِي بَلَغَ مِنِّي فَنَزَلَ الْبِئْرَ فَمَلأَ خُفَّهُ ثُمَّ أَمْسَكَهُ بِفِيهِ حَتَّى رَقِيَ فَسَقَى الْكَلْبَ فَشَكَرَ اللَّهُ لَهُ فَغَفَرَ لَهُ ‏\"‏ ‏.‏ فَقَالُوا يَا رَسُولَ اللَّهِ وَإِنَّ لَنَا فِي الْبَهَائِمِ لأَجْرًا فَقَالَ ‏\"‏ فِي كُلِّ ذَاتِ كَبِدٍ رَطْبَةٍ أَجْرٌ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Sumayy, the mawla of Abu Bakr\nfrom Abu Salih as-Samman from Abu Hurayra that the Messenger of Allah,\nmay Allah bless him and grant him peace, said, \"A man was walking on a\nroad when he became very thirsty. He found a well and went into it and\ndrank and came out. There was a dog panting and eating earth out of\nthirst. The man said, 'This dog has become as thirsty as I was.' He\nwent down into the well and filled his shoe and then held it in his\nmouth until he climbed out and gave the dog water to drink. Allah\nthanked him for it and forgave him.\" They said, \"Messenger of Allah,\ndo we have a reward for taking care of beasts?\" He said, \"There is a\nreward for every one with a moist liver.\""}},{"id":24,"idInBook":24,"chapterId":49,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ وَهْبِ بْنِ كَيْسَانَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّهُ قَالَ بَعَثَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَعْثًا قِبَلَ السَّاحِلِ فَأَمَّرَ عَلَيْهِمْ أَبَا عُبَيْدَةَ بْنَ الْجَرَّاحِ وَهُمْ ثَلاَثُمِائَةٍ ‏.‏ قَالَ وَأَنَا فِيهِمْ - قَالَ - فَخَرَجْنَا حَتَّى إِذَا كُنَّا بِبَعْضِ الطَّرِيقِ فَنِيَ الزَّادُ فَأَمَرَ أَبُو عُبَيْدَةَ بِأَزْوَادِ ذَلِكَ الْجَيْشِ فَجُمِعَ ذَلِكَ كُلُّهُ فَكَانَ مِزْوَدَىْ تَمْرٍ - قَالَ - فَكَانَ يُقَوِّتُنَاهُ كُلَّ يَوْمٍ قَلِيلاً قَلِيلاً حَتَّى فَنِيَ وَلَمْ تُصِبْنَا إِلاَّ تَمْرَةٌ تَمْرَةٌ فَقُلْتُ وَمَا تُغْنِي تَمْرَةٌ فَقَالَ لَقَدْ وَجَدْنَا فَقْدَهَا حِينَ فَنِيَتْ - قَالَ - ثُمَّ انْتَهَيْنَا إِلَى الْبَحْرِ فَإِذَا حُوتٌ مِثْلُ الظَّرِبِ فَأَكَلَ مِنْهُ ذَلِكَ الْجَيْشُ ثَمَانِيَ عَشْرَةَ لَيْلَةً ثُمَّ أَمَرَ أَبُو عُبَيْدَةَ بِضِلَعَيْنِ مِنْ أَضْلاَعِهِ فَنُصِبَا ثُمَّ أَمَرَ بِرَاحِلَةٍ فَرُحِلَتْ ثُمَّ مَرَّتْ تَحْتَهُمَا وَلَمْ تُصِبْهُمَا","english":{"narrator":"","text":"Yahya related to me from Malik from Wahb ibn Kaysan that Jabir\nibn Abdullah said, \"The Messenger of Allah, may Allah bless him and\ngrant him peace, sent a delegation to the coast. Abu Ubayda ibn al-\nJarrah was in command of them. There were 300 people and I was among\nthem. We went out until we had gone part of the way and our provisions\nwere finished. Abu Ubayda ordered that the provisions of the army be\ngathered up and they amounted to two containers of dates. He used to\ngive us a little provision from it each day until it was finished, and\nwe used to have only a single date each. I said, 'What use is one\ndate?' He said, 'We will certainly feel its loss when they are\nfinished.' \"\n\n\nJabir continued, \"Then we reached the sea and\nthere was a fish like a small mountain. The army ate from it for\neighteen nights. Then Abu Ubayda ordered two ribs from it to be set\nup. Then he commanded that a camel be ridden underneath them and it\ndid not touch them.\""}},{"id":25,"idInBook":25,"chapterId":49,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَمْرِو بْنِ سَعْدِ بْنِ مُعَاذٍ، عَنْ جَدَّتِهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ يَا نِسَاءَ الْمُؤْمِنَاتِ لاَ تَحْقِرَنَّ إِحْدَاكُنَّ لِجَارَتِهَا وَلَوْ كُرَاعَ شَاةٍ مُحْرَقًا ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Zayd ibn Aslam from Amr ibn\nSad ibn Muadh from his grandmother that the Messenger of Allah, may\nAllah bless him and grant him peace, said, \"O trusting women, none of\nyou must consider even a roasted sheep's trotter too small to give to\nher neighbour.\""}},{"id":26,"idInBook":26,"chapterId":49,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، أَنَّهُ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ قَاتَلَ اللَّهُ الْيَهُودَ نُهُوا عَنْ أَكْلِ الشَّحْمِ فَبَاعُوهُ فَأَكَلُوا ثَمَنَهُ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Abdullah ibn Abi Bakr said,\n\"The Messenger of Allah, may Allah bless him and grant him peace,\nsaid, 'May Allah curse the jews! They were forbidden to eat fat, so\nthey sold it and ate its price.' \""}},{"id":27,"idInBook":27,"chapterId":49,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عِيسَى ابْنَ مَرْيَمَ، كَانَ يَقُولُ يَا بَنِي إِسْرَائِيلَ عَلَيْكُمْ بِالْمَاءِ الْقَرَاحِ وَالْبَقْلِ الْبَرِّيِّ وَخُبْزِ الشَّعِيرِ وَإِيَّاكُمْ وَخُبْزَ الْبُرِّ فَإِنَّكُمْ لَنْ تَقُومُوا بِشُكْرِهِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Isa ibn\nMaryam used to say, \"O Banu Israil! You must drink pure water and the\ngreen things of the land and barley bread . Beware of wheat bread, for\nyou will not be grateful enough for it.\""}},{"id":28,"idInBook":28,"chapterId":49,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم دَخَلَ الْمَسْجِدَ فَوَجَدَ فِيهِ أَبَا بَكْرٍ الصِّدِّيقَ وَعُمَرَ بْنَ الْخَطَّابِ فَسَأَلَهُمَا فَقَالاَ أَخْرَجَنَا الْجُوعُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَأَنَا أَخْرَجَنِي الْجُوعُ ‏\"‏ ‏.‏ فَذَهَبُوا إِلَى أَبِي الْهَيْثَمِ بْنِ التَّيِّهَانِ الأَنْصَارِيِّ فَأَمَرَ لَهُمْ بِشَعِيرٍ عِنْدَهُ يُعْمَلُ وَقَامَ يَذْبَحُ لَهُمْ شَاةً فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ نَكِّبْ عَنْ ذَاتِ الدَّرِّ ‏\"‏ ‏.‏ فَذَبَحَ لَهُمْ شَاةً وَاسْتَعْذَبَ لَهُمْ مَاءً فَعُلِّقَ فِي نَخْلَةٍ ثُمَّ أُتُوا بِذَلِكَ الطَّعَامِ فَأَكَلُوا مِنْهُ وَشَرِبُوا مِنْ ذَلِكَ الْمَاءِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَتُسْئَلُنَّ عَنْ نَعِيمِ هَذَا الْيَوْمِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he heard that the Messenger\nof Allah, may Allah bless him and grant him peace, entered the mosque\nand found Abu Bakr as-Siddiq and Umar ibn al-Khattab there. He\nquestioned them and they said, \"Hunger has driven us out.\" The\nMessenger of Allah, may Allah bless him and grant him peace, said,\n\"And hunger has brought me out.\" They went to Abu'l-Haytham ibn at-\nTayyihan al-Ansari. He ordered that some barley that was in the house\nbe prepared and he got up to slaughter a sheep for them. The Messenger\nof Allah, may Allah bless him and grant him peace, said, \"Leave the\none with milk.\" He slaughtered a sheep for them and brought them sweet\nwater and it was hung on a palm-tree. Then they were brought the food\nand ate it and drank the water. The Messenger of Allah, may Allah\nbless him and grant him peace, recited, \"Then, on that day, you will\nbe asked concerning pleasure.\" (Sura 102 ayat 8)."}},{"id":29,"idInBook":29,"chapterId":49,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، كَانَ يَأْكُلُ خُبْزًا بِسَمْنٍ فَدَعَا رَجُلاً مِنْ أَهْلِ الْبَادِيَةِ فَجَعَلَ يَأْكُلُ وَيَتَّبِعُ بِاللُّقْمَةِ وَضَرَ الصَّحْفَةِ فَقَالَ عُمَرُ كَأَنَّكَ مُقْفِرٌ ‏.‏ فَقَالَ وَاللَّهِ مَا أَكَلْتُ سَمْنًا وَلاَ رَأَيْتُ أَكْلاً بِهِ مُنْذُ كَذَا وَكَذَا ‏.‏ فَقَالَ عُمَرُ لاَ آكُلُ السَّمْنَ حَتَّى يَحْيَا النَّاسُ مِنْ أَوَّلِ مَا يَحْيَوْنَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said that Umar ibn\nal-Khattab was eating bread with ghee. He summoned one of the desert\npeople and he began to eat and follow the grease in the dish with a\nmorsel of bread. Umar said, \"It is as if you were poor.\" He said, \"By\nAllah. I have not eaten ghee nor have I seen food with it since such-\nand-such a time.\" Umar declared, \"I shall not eat clarified butter\nuntil people are given life again like they were first given life,\"\n(i.e. on the Day of Rising.)"}},{"id":30,"idInBook":30,"chapterId":49,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّهُ قَالَ رَأَيْتُ عُمَرَ بْنَ الْخَطَّابِ - وَهُوَ يَوْمَئِذٍ أَمِيرُ الْمُؤْمِنِينَ - يُطْرَحُ لَهُ صَاعٌ مِنْ تَمْرٍ فَيَأْكُلُهُ حَتَّى يَأْكُلَ حَشَفَهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ishaq ibn Abdullah ibn Abi\nTalha that Anas ibn Malik said, \"I saw Umar ibn al-Khattab when he was\namir al-muminin being given a sa of dates, and he ate all of them,\neven the inferior ones.\""}},{"id":31,"idInBook":31,"chapterId":49,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ قَالَ سُئِلَ عُمَرُ بْنُ الْخَطَّابِ عَنِ الْجَرَادِ، فَقَالَ وَدِدْتُ أَنَّ عِنْدِي، قَفْعَةً نَأْكُلُ مِنْهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from\nAbdullah ibn Dinar that Abdullah ibn Umar said, ''Umar ibn al-Khattab\nwas asked about locusts. He said, 'I would like to have a basket of\nthem, from which we could eat.' \""}},{"id":32,"idInBook":32,"chapterId":49,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَلْحَلَةَ، عَنْ حُمَيْدِ بْنِ مَالِكِ بْنِ خُثَيْمٍ، أَنَّهُ قَالَ كُنْتُ جَالِسًا مَعَ أَبِي هُرَيْرَةَ بِأَرْضِهِ بِالْعَقِيقِ فَأَتَاهُ قَوْمٌ مِنْ أَهْلِ الْمَدِينَةِ عَلَى دَوَابَّ فَنَزَلُوا عِنْدَهُ - قَالَ حُمَيْدٌ - فَقَالَ أَبُو هُرَيْرَةَ اذْهَبْ إِلَى أُمِّي فَقُلْ إِنَّ ابْنَكِ يُقْرِئُكِ السَّلاَمَ وَيَقُولُ أَطْعِمِينَا شَيْئًا ‏.‏ قَالَ فَوَضَعَتْ ثَلاَثَةَ أَقْرَاصٍ فِي صَحْفَةٍ وَشَيْئًا مِنْ زَيْتٍ وَمِلْحٍ ثُمَّ وَضَعَتْهَا عَلَى رَأْسِي وَحَمَلْتُهَا إِلَيْهِمْ فَلَمَّا وَضَعْتُهَا بَيْنَ أَيْدِيهِمْ كَبَّرَ أَبُو هُرَيْرَةَ وَقَالَ الْحَمْدُ لِلَّهِ الَّذِي أَشْبَعَنَا مِنَ الْخُبْزِ بَعْدَ أَنْ لَمْ يَكُنْ طَعَامُنَا إِلاَّ الأَسْوَدَيْنِ الْمَاءَ وَالتَّمْرَ ‏.‏ فَلَمْ يُصِبِ الْقَوْمُ مِنَ الطَّعَامِ شَيْئًا فَلَمَّا انْصَرَفُوا قَالَ يَا ابْنَ أَخِي أَحْسِنْ إِلَى غَنَمِكَ وَامْسَحِ الرُّعَامَ عَنْهَا وَأَطِبْ مُرَاحَهَا وَصَلِّ فِي نَاحِيَتِهَا فَإِنَّهَا مِنْ دَوَابِّ الْجَنَّةِ وَالَّذِي نَفْسِي بِيَدِهِ لَيُوشِكُ أَنْ يَأْتِيَ عَلَى النَّاسِ زَمَانٌ تَكُونُ الثُّلَّةُ مِنَ الْغَنَمِ أَحَبَّ إِلَى صَاحِبِهَا مِنْ دَارِ مَرْوَانَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Muhammad ibn Amr ibn Halhala\nthat Humayd ibn Malik ibn Khu'haym said, \"I was sitting with Abu\nHurayra on his land at al-Aqiq. Some people rode out from Madina to\ncall upon Abu Hurayra. He told me to go to his mother, sending his\ngreetings and asking her to prepare some food.\" Humayd continued, \"She\nset down three loaves on a plate and some oil and salt. Then she put\nit on my head and I carried it to them. When I set it before them, Abu\nHurayra said, 'Allah is greater' and added, 'Praise be to Allah who\nhas filled us with bread after our food had previously been only water\nand dates,' as the people did not touch any of the food.\n\n\nWhen\nthey left, he said, 'O son of my brother, be good to your sheep and\nwipe the mucus from them and clean their pen. Pray in their quarter\nfor they are among the animals of the Garden. By He in Whose Hand my\nself is, a time is about to come upon people when a small group of\nsheep will be more beloved to their owner than the house of Marwan . '\n\""}},{"id":33,"idInBook":33,"chapterId":49,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي نُعَيْمٍ، وَهْبِ بْنِ كَيْسَانَ قَالَ أُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِطَعَامٍ وَمَعَهُ رَبِيبُهُ عُمَرُ بْنُ أَبِي سَلَمَةَ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ سَمِّ اللَّهَ وَكُلْ مِمَّا يَلِيكَ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu Nuaym that Wahb ibn\nKaysan said, \"The Messenger of Allah, may Allah bless him and grant\nhim peace, was brought food while his stepson Umar ibn Salama was with\nhim. The Messenger of Allah, may Allah bless him and grant him peace,\nsaid to him, 'Say \"Bismillah,\" and eat what is in front of you.' \""}},{"id":34,"idInBook":34,"chapterId":49,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ قَالَ سَمِعْتُ الْقَاسِمَ بْنَ مُحَمَّدٍ، يَقُولُ جَاءَ رَجُلٌ إِلَى عَبْدِ اللَّهِ بْنِ عَبَّاسٍ فَقَالَ لَهُ إِنَّ لِي يَتِيمًا وَلَهُ إِبِلٌ أَفَأَشْرَبُ مِنْ لَبَنِ إِبِلِهِ فَقَالَ ابْنُ عَبَّاسٍ إِنْ كُنْتَ تَبْغِي ضَالَّةَ إِبِلِهِ وَتَهْنَأُ جَرْبَاهَا وَتَلُطُّ حَوْضَهَا وَتَسْقِيهَا يَوْمَ وِرْدِهَا فَاشْرَبْ غَيْرَ مُضِرٍّ بِنَسْلٍ وَلاَ نَاهِكٍ فِي الْحَلْبِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Yahya ibn Said said that he\nhad heard al-Qasim ibn Muhammad say that a man came to Abdullah ibn\nAbbas and said to him, \"I have an orphan and he has camels. Can I\ndrink from the camels' milk?\" Ibn Abbas said, \"If you search for the\nlost camels of his and treat the camels' mange and fill in the cracks\nin their water basin and give it water on the day it drinks, then\ndrink it without doing harm to the suckling camels by milking them\nexcessively.\""}},{"id":35,"idInBook":35,"chapterId":49,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّهُ كَانَ لاَ يُؤْتَى أَبَدًا بِطَعَامٍ وَلاَ شَرَابٍ حَتَّى الدَّوَاءُ فَيَطْعَمَهُ أَوْ يَشْرَبَهُ إِلاَّ قَالَ الْحَمْدُ لِلَّهِ الَّذِي هَدَانَا وَأَطْعَمَنَا وَسَقَانَاوَنَعَّمَنَا اللَّهُ أَكْبَرُ اللَّهُمَّ أَلْفَتْنَا نِعْمَتُكَ بِكُلِّ شَرٍّ فَأَصْبَحْنَا مِنْهَا وَأَمْسَيْنَا بِكُلِّ خَيْرٍ نَسْأَلُكَ تَمَامَهَا وَشُكْرَهَا لاَ خَيْرَ إِلاَّ خَيْرُكَ وَلاَ إِلَهَ غَيْرُكَ إِلَهَ الصَّالِحِينَ وَرَبَّ الْعَالَمِينَ الْحَمْدُ لِلَّهِ وَلاَ إِلَهَ إِلاَّ اللَّهُ مَا شَاءَ اللَّهُ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ اللَّهُمَّ بَارِكْ لَنَا فِيمَا رَزَقْتَنَا وَقِنَا عَذَابَ النَّارِ ‏.‏ قَالَ يَحْيَى سُئِلَ مَالِكٌ هَلْ تَأْكُلُ الْمَرْأَةُ مَعَ غَيْرِ ذِي مَحْرَمٍ مِنْهَا أَوْ مَعَ غُلاَمِهَا فَقَالَ مَالِكٌ لَيْسَ بِذَلِكَ بَأْسٌ إِذَا كَانَ ذَلِكَ عَلَى وَجْهِ مَا يُعْرَفُ لِلْمَرْأَةِ أَنْ تَأْكُلَ مَعَهُ مِنَ الرِّجَالِ ‏.‏ قَالَ وَقَدْ تَأْكُلُ الْمَرْأَةُ مَعَ زَوْجِهَا وَمَعَ غَيْرِهِ مِمَّنْ يُؤَاكِلُهُ أَوْ مَعَ أَخِيهَا عَلَى مِثْلِ ذَلِكَ وَيُكْرَهُ لِلْمَرْأَةِ أَنْ تَخْلُوَ مَعَ الرَّجُلِ لَيْسَ بَيْنَهُ وَبَيْنَهَا حُرْمَةٌ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa that his\nfather never brought food or drink, nor even a remedy which he ate or\ndrank but that he said, \"Praise be to Allah who has guided us and fed\nus and given us to drink and blessed us. Allah is greater. O Allah! We\nhave found Your blessing with every evil, give us every good in the\nmorning and evening. We ask You for its completion and its gratitude.\nThere is no good except Your good. There is no god other than You, the\nGod of the salihun and the Lord of the Worlds. Praise be to Allah.\nThere is no god but Allah. What Allah wills. There is no power except\nin Allah. O Allah! Bless us in what You have provided us with and\nprotect us from the punishment of the Fire!\"\n\n\nAl-hamdu\nlillahi-lladhi hadana wa at amana wa saqana wa naamana. Allahu akbar.\nAllahumma'l fatna nimatik bi-kulli sharr. Fa asbahna minha wa amsayna\nbi-kulli khayr. Nasaluka tamamaha wa shukraha. La khayr illa khayruk.\nWa la ilaha ghayruk. Ilaha'-saliheen wa rabba'l-alameen. Al-hamdu\nlillah. Wa la ilaha illa'llah. Ma sha'Allah. Wa la quwwata illa\nbillah. Allahumma barik lana fima razaqtana. Waqina adhaba'n-nar."}},{"id":36,"idInBook":36,"chapterId":49,"bookId":7,"arabic":"","english":{"narrator":"","text":"Yahya said that Malik was asked, \"Can a woman eat with other than\nher relative or slave?\" Malik said, \"There is no harm in that if it is\nin a manner which is accepted for a woman to eat with men.\"\n\n\nMalik said, \"A woman sometimes eats with her husband and with others\nhe dines with or with her brother in the same way. It is disapproved\nof for a woman to be alone with a man when there is no relationship\nbetween them by blood, marriage or suckling that would prevent him\nmarrying her.\""}},{"id":37,"idInBook":37,"chapterId":49,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ إِيَّاكُمْ وَاللَّحْمَ فَإِنَّ لَهُ ضَرَاوَةً كَضَرَاوَةِ الْخَمْرِ ‏.‏","english":{"narrator":"","text":""}},{"id":38,"idInBook":38,"chapterId":49,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، أَدْرَكَ جَابِرَ بْنَ عَبْدِ اللَّهِ وَمَعَهُ حِمَالُ لَحْمٍ فَقَالَ مَا هَذَا فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ قَرِمْنَا إِلَى اللَّحْمِ فَاشْتَرَيْتُ بِدِرْهَمٍ لَحْمًا ‏.‏ فَقَالَ عُمَرُ أَمَا يُرِيدُ أَحَدُكُمْ أَنْ يَطْوِيَ بَطْنَهُ عَنْ جَارِهِ أَوِ ابْنِ عَمِّهِ أَيْنَ تَذْهَبُ عَنْكُمْ هَذِهِ الآيَةُ ‏{‏أَذْهَبْتُمْ طَيِّبَاتِكُمْ فِي حَيَاتِكُمُ الدُّنْيَا وَاسْتَمْتَعْتُمْ بِهَا ‏}‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said that Umar ibn\nal-Khattab said, \"Beware of meat. It has addictiveness like the\naddictiveness of wine.\"\n\n\nYahya related to me from Malik from\nYahya ibn Said that Umar ibn al-Khattab saw Jabir ibn Abdullah\ncarrying some meat. He said, \"What is this?\" He said, \"Amir al-\nmuminin. We desired meat and I bought some meat for a dirham.\" Umar\nsaid, \"Does one of you want to fill his belly apart from his neighbour\nor nephew? How can you overlook this ayat? 'You squandered your good\nthings in the life of this world and sought comfort in them.' \" (Sura\n46 ayat 20)."}},{"id":39,"idInBook":39,"chapterId":49,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَلْبَسُ خَاتَمًا مِنْ ذَهَبٍ ثُمَّ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَنَبَذَهُ وَقَالَ ‏\n\"‏ لاَ أَلْبَسُهُ أَبَدًا ‏\"‏ ‏.‏ قَالَ فَنَبَذَ النَّاسُ خَوَاتِيمَهُمْ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abdullah ibn Dinar from\n'Abdullah ibn 'Umar that the Messenger of Allah, may Allah bless him\nand grant him peace, used to wear a gold ring. Then the Messenger of\nAllah, may Allah bless him and grant him peace, stood up and threw it\naway and said, \"I will never wear it.\" He said, \"So the people threw\naway their rings.\""}},{"id":40,"idInBook":40,"chapterId":49,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ صَدَقَةَ بْنِ يَسَارٍ، أَنَّهُ قَالَ سَأَلْتُ سَعِيدَ بْنَ الْمُسَيَّبِ عَنْ لُبْسِ الْخَاتَمِ، فَقَالَ الْبَسْهُ وَأَخْبِرِ النَّاسَ، أَنِّي أَفْتَيْتُكَ بِذَلِكَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Sadaqa ibn Yasar said, \"I\nasked Said ibn al-Musayyab about wearing a ring. He said, 'Wear it,\nand tell people that I gave you that decision.' \""}},{"id":41,"idInBook":41,"chapterId":49,"bookId":7,"arabic":"باب مَا جَاءَ فِي نَزْعِ الْمَعَالِيقِ وَالْجَرَسِ مِنَ الْعُنُقِ","english":{"narrator":"","text":""}},{"id":42,"idInBook":42,"chapterId":49,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، عَنْ عَبَّادِ بْنِ تَمِيمٍ، أَنَّ أَبَا بَشِيرٍ الأَنْصَارِيَّ، أَخْبَرَهُ أَنَّهُ، كَانَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي بَعْضِ أَسْفَارِهِ - قَالَ - فَأَرْسَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم رَسُولاً قَالَ عَبْدُ اللَّهِ بْنُ أَبِي بَكْرٍ حَسِبْتُ أَنَّهُ قَالَ وَالنَّاسُ فِي مَقِيلِهِمْ ‏\n\"‏ لاَ تَبْقَيَنَّ فِي رَقَبَةِ بَعِيرٍ قِلاَدَةٌ مِنْ وَتَرٍ أَوْ قِلاَدَةٌ إِلاَّ قُطِعَتْ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abdullah ibn Abi Bakr from\nAbbad ibn Tamim that Abu Bashir al-Ansari told him that he was with\nthe Messenger of Allah, may Allah bless him and grant him peace, on\none of his journeys. He related, \"The Messenger of Allah,  may Allah\nbless him and grant him peace, sent a messenger.\" (Abdullah ibn Abi\nBakr said, (I think that he said it was while the people were in their\nresting place.) He said, \"Do not let a single-string necklace, or any\nnecklace, remain unbroken on the neck of a camel.\"\n\n\nYahya\nsaid, \"I heard Malik say, 'I think that was because of the evil eye.'\n''"}}],"chapter":{"id":49,"bookId":7,"arabic":"كتاب صفة النبى صلى الله عليه وسلم","english":"The Description of the Prophet, may Allah Bless Him and Grant Him Peace"}}