{"metadata":{"length":23,"arabic":{"title":"موطأ مالك","author":"الإمام مالك بن أنس","introduction":"كتاب الجمعة"},"english":{"title":"Muwatta Malik","author":"Imam Malik ibn Anas","introduction":"Jumu'a"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":5,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ سُمَىٍّ، مَوْلَى أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي صَالِحٍ السَّمَّانِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنِ اغْتَسَلَ يَوْمَ الْجُمُعَةِ غُسْلَ الْجَنَابَةِ ثُمَّ رَاحَ فِي السَّاعَةِ الأُولَى فَكَأَنَّمَا قَرَّبَ بَدَنَةً وَمَنْ رَاحَ فِي السَّاعَةِ الثَّانِيَةِ فَكَأَنَّمَا قَرَّبَ بَقَرَةً وَمَنْ رَاحَ فِي السَّاعَةِ الثَّالِثَةِ فَكَأَنَّمَا قَرَّبَ كَبْشًا أَقْرَنَ وَمَنْ رَاحَ فِي السَّاعَةِ الرَّابِعَةِ فَكَأَنَّمَا قَرَّبَ دَجَاجَةً وَمَنْ رَاحَ فِي السَّاعَةِ الْخَامِسَةِ فَكَأَنَّمَا قَرَّبَ بَيْضَةً فَإِذَا خَرَجَ الإِمَامُ حَضَرَتِ الْمَلاَئِكَةُ يَسْتَمِعُونَ الذِّكْرَ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Sumayy, the mawla of Abu Bakr\nibn Abd ar-Rahman, from Abu Salih as-Sammani from Abu Hurayra that the\nMessenger of Allah, may Allah bless him and grant him peace, said, \"If\nsomeone does ghusl for major ritual impurity on the day of jumua and\nthen goes in the first part of the time, it is as if he had offered up\na camel. If he goes in the second part of the time, it is as if he had\noffered up a cow. If he goes in the third part of the time, it is as\nif he had offered up a horned ram. If he goes in the fourth part of\nthe time, it is as if he had offered up a hen. If he goes in the fifth\npart of the time, it is as if he had offered up an egg. And when the\nimam comes out, the angels settle down listening to the dhikr\n(remembrance of Allah).\""}},{"id":2,"idInBook":2,"chapterId":5,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ كَانَ يَقُولُ غُسْلُ يَوْمِ الْجُمُعَةِ وَاجِبٌ عَلَى كُلِّ مُحْتَلِمٍ كَغُسْلِ الْجَنَابَةِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Said ibn Abi Said al-Maqburi\nthat Abu Hurayra used to say, \"Doing ghusl as prescribed for major\nritual impurity is incumbent (wajib) on the day of jumua on every male\nwho has reached puberty.\""}},{"id":3,"idInBook":3,"chapterId":5,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، أَنَّهُ قَالَ دَخَلَ رَجُلٌ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم الْمَسْجِدَ يَوْمَ الْجُمُعَةِ وَعُمَرُ بْنُ الْخَطَّابِ يَخْطُبُ فَقَالَ عُمَرُ أَيَّةُ سَاعَةٍ هَذِهِ فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ انْقَلَبْتُ مِنَ السُّوقِ فَسَمِعْتُ النِّدَاءَ فَمَا زِدْتُ عَلَى أَنْ تَوَضَّأْتُ ‏.‏ فَقَالَ عُمَرُ وَالْوُضُوءَ أَيْضًا وَقَدْ عَلِمْتَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَأْمُرُ بِالْغُسْلِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab that Salim ibn\nAbdullah said, \"One of the companions of the Messenger of Allah, may\nAllah bless him and grant him peace, came into the mosque on the day\nof jumua and Umar ibn al Khattab was already giving the khutba. Umar\nsaid, 'What (kind of) time is this (to arrive)?'  He said, Amir al-\nmuminin, I returned from the market and heard the call to prayer, so I\ndid no more than do wudu.' Umar said, 'You only did wudu as well? You\nknow that the Messenger of Allah, may Allah bless him and grant him\npeace, used to tell people to do ghusl.' \""}},{"id":4,"idInBook":4,"chapterId":5,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ صَفْوَانَ بْنِ سُلَيْمٍ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ غُسْلُ يَوْمِ الْجُمُعَةِ وَاجِبٌ عَلَى كُلِّ مُحْتَلِمٍ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Safwan ibn Sulaym from Ata\nibn Yasar from Abu Said al-Khudri that the Messenger of Allah, may\nAllah bless him and grant him peace, said, \"Ghusl on the day of jumua\nis incumbent on every male who has reached puberty.\""}},{"id":5,"idInBook":5,"chapterId":5,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا جَاءَ أَحَدُكُمُ الْجُمُعَةَ فَلْيَغْتَسِلْ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi from Ibn Umar that the\nMessenger of Allah, may Allah bless him and grant him peace, said,\n\"When you come to jumua, do ghusl.\"\n\n\nMalik said, \"It is not\nenough for someone to do a ghusl on the day of jumua and intend by it\nthe ghusl for jumua unless he does the ghusl and then sets off. That\nis because the Messenger of Allah, may Allah bless him and grant him\npeace, said in the hadith related by Ibn Umar, 'When you come to\njumua, do ghusl .' \"\n\n\nMalik said, \"If someone does ghusl on\nthe day of jumua and intends by it the ghusl of the day of jumua and\nthen sets out, whether early or late, and does something which breaks\nhis wudu, he only has to do wudu and his ghusl remains valid for him.\""}},{"id":6,"idInBook":6,"chapterId":5,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا قُلْتَ لِصَاحِبِكَ أَنْصِتْ وَالإِمَامُ يَخْطُبُ يَوْمَ الْجُمُعَةِ فَقَدْ لَغَوْتَ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'z Zinad from al-Araj from\nAbu Hurayra that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"Even saying to your companion 'Listen' while the\nimam is giving the khutba on the day of jumua, is to speak foolishly.\""}},{"id":7,"idInBook":7,"chapterId":5,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ ثَعْلَبَةَ بْنِ أَبِي مَالِكٍ الْقُرَظِيِّ، أَنَّهُ أَخْبَرَهُ أَنَّهُمْ، كَانُوا فِي زَمَانِ عُمَرَ بْنِ الْخَطَّابِ يُصَلُّونَ يَوْمَ الْجُمُعَةِ حَتَّى يَخْرُجَ عُمَرُ فَإِذَا خَرَجَ عُمَرُ وَجَلَسَ عَلَى الْمِنْبَرِ وَأَذَّنَ الْمُؤَذِّنُونَ - قَالَ ثَعْلَبَةُ - جَلَسْنَا نَتَحَدَّثُ فَإِذَا سَكَتَ الْمُؤَذِّنُونَ وَقَامَ عُمَرُ يَخْطُبُ أَنْصَتْنَا فَلَمْ يَتَكَلَّمْ مِنَّا أَحَدٌ ‏.‏ قَالَ ابْنُ شِهَابٍ فَخُرُوجُ الإِمَامِ يَقْطَعُ الصَّلاَةَ وَكَلاَمُهُ يَقْطَعُ الْكَلاَمَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab that Thalaba ibn\nAbi Malik al Quradhi informed him that in the time of Umar ibn al\nKhattab they used to pray on the day of jumua until Umar came out, and\nwhen Umar came out and sat on the mimbar and the muadhdhins called the\nadhan, they would sit and talk, and then when the muadhdhins were\nsilent and Umar stood to give the khutba, they would pay attention and\nno-one would speak .\n\n\nIbn Shihab said, \"The imam coming out\nstops prayer and his speaking stops conversation.\""}},{"id":8,"idInBook":8,"chapterId":5,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي النَّضْرِ، مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ عَنْ مَالِكِ بْنِ أَبِي عَامِرٍ، أَنَّ عُثْمَانَ بْنَ عَفَّانَ، كَانَ يَقُولُ فِي خُطْبَتِهِ قَلَّمَا يَدَعُ ذَلِكَ إِذَا خَطَبَ إِذَا قَامَ الإِمَامُ يَخْطُبُ يَوْمَ الْجُمُعَةِ فَاسْتَمِعُوا وَأَنْصِتُوا فَإِنَّ لِلْمُنْصِتِ الَّذِي لاَ يَسْمَعُ مِنَ الْحَظِّ مِثْلَ مَا لِلْمُنْصِتِ السَّامِعِ فَإِذَا قَامَتِ الصَّلاَةُ فَاعْدِلُوا الصُّفُوفَ وَحَاذُوا بِالْمَنَاكِبِ فَإِنَّ اعْتِدَالَ الصُّفُوفِ مِنْ تَمَامِ الصَّلاَةِ ‏.‏ ثُمَّ لاَ يُكَبِّرُ حَتَّى يَأْتِيَهُ رِجَالٌ قَدْ وَكَّلَهُمْ بِتَسْوِيَةِ الصُّفُوفِ فَيُخْبِرُونَهُ أَنْ قَدِ اسْتَوَتْ فَيُكَبِّرُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'n Nadr, the mawla of Umar\nibn Ubaydullah, from Malik ibn Abi Amir that Uthman ibn Affan used to\nsay in khutbas, and he would seldom omit it if he was giving the\nkhutba, \"When the imam stands delivering the khutba on the day of\njumua, listen and pay attention, for there is the same portion for\nsomeone who pays attention but cannot hear as for someone who pays\nattention and hears. And when the iqama of the prayer is called,\nstraighten your rows and make your shoulders adjacent to each other,\nbecause the straightening of the rows is part of the completion of the\nprayer.\" Then he would not say the takbir until some men who had been\nentrusted with straightening the rows came and told him that they were\nstraight. Then he would say the takbir."}},{"id":9,"idInBook":9,"chapterId":5,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، رَأَى رَجُلَيْنِ يَتَحَدَّثَانِ وَالإِمَامُ يَخْطُبُ يَوْمَ الْجُمُعَةِ فَحَصَبَهُمَا أَنِ اصْمُتَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nsaw two men talking while the imam was giving the khutba on the day of\njumua and he threw pebbles at them to tell them to be quiet."}},{"id":10,"idInBook":10,"chapterId":5,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ رَجُلاً، عَطَسَ يَوْمَ الْجُمُعَةِ وَالإِمَامُ يَخْطُبُ فَشَمَّتَهُ إِنْسَانٌ إِلَى جَنْبِهِ فَسَأَلَ عَنْ ذَلِكَ سَعِيدَ بْنَ الْمُسَيَّبِ فَنَهَاهُ عَنْ ذَلِكَ وَقَالَ لاَ تَعُدْ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that a man\nsneezed on the day of jumua while the imam was giving the khutba, and\na man by his side asked Allah to bless him. Said ibn al Musayyab was\nasked about it and he forbade the man to do what he had done and said,\n\"Don't do it again.\""}},{"id":11,"idInBook":11,"chapterId":5,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ سَأَلَ ابْنَ شِهَابٍ عَنِ الْكَلاَمِ، يَوْمَ الْجُمُعَةِ إِذَا نَزَلَ الإِمَامُ عَنِ الْمِنْبَرِ، قَبْلَ أَنْ يُكَبِّرَ، ‏.‏ فَقَالَ ابْنُ شِهَابٍ لاَ بَأْسَ بِذَلِكَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he asked Ibn Shihab about\ntalking in the jumua after the imam had come down from the mimbar but\nbefore he had said the takbir. Ibn Shihab said, \"There is no harm in\nthat.\""}},{"id":12,"idInBook":12,"chapterId":5,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، أَنَّهُ كَانَ يَقُولُ مَنْ أَدْرَكَ مِنْ صَلاَةِ الْجُمُعَةِ رَكْعَةً فَلْيُصَلِّ إِلَيْهَا أُخْرَى ‏.‏ قَالَ ابْنُ شِهَابٍ وَهِيَ السُّنَّةُ ‏.‏ قَالَ مَالِكٌ وَعَلَى ذَلِكَ أَدْرَكْتُ أَهْلَ الْعِلْمِ بِبَلَدِنَا وَذَلِكَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ أَدْرَكَ مِنَ الصَّلاَةِ رَكْعَةً فَقَدْ أَدْرَكَ الصَّلاَةَ ‏\"‏ ‏.‏ قَالَ مَالِكٌ فِي الَّذِي يُصِيبُهُ زِحَامٌ يَوْمَ الْجُمُعَةِ فَيَرْكَعُ وَلاَ يَقْدِرُ عَلَى أَنْ يَسْجُدَ حَتَّى يَقُومَ الإِمَامُ أَوْ يَفْرُغَ الإِمَامُ مِنْ صَلاَتِهِ إِنَّهُ إِنْ قَدَرَ عَلَى أَنْ يَسْجُدَ إِنْ كَانَ قَدْ رَكَعَ فَلْيَسْجُدْ إِذَا قَامَ النَّاسُ وَإِنْ لَمْ يَقْدِرْ عَلَى أَنْ يَسْجُدَ حَتَّى يَفْرُغَ الإِمَامُ مِنْ صَلاَتِهِ فَإِنَّهُ أَحَبُّ إِلَىَّ أَنْ يَبْتَدِئَ صَلاَتَهُ ظُهْرًا أَرْبَعًا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Ibn Shihab used to say, \"Some\none who catches a raka of the jumua prayer should pray another one\nwith it.\" Ibn Shihab said, \"That is the sunna.\"\n\n\nMalik said,\n\"I saw the people of knowledge in our city doing that. That is because\nthe Messenger of Allah, may Allah bless him and grant him peace, said,\n'Whoever catches a raka of the prayer has caught the prayer.' \"\n\n\nMalik said, concerning some one who was in a crowd on the day of\njumua and did the ruku but was not able to go into sajda until the\nimam had risen or finished his prayer, \"If he is able to do the sajda\nand has already done the ruku then he should do the sajda when the\npeople stand up. If he is unable to do thesajda until after the imam\nhas finished the prayer, then I prefer that he begins the prayeragain\nand does the four rakas of dhuhr.\""}},{"id":13,"idInBook":13,"chapterId":5,"bookId":7,"arabic":"","english":{"narrator":"","text":"Malik said, \"Someone who has a nosebleed on the day of jumua\nwhile the imam is giving the khutba and he leaves and does not come\nback until the imam has finished the prayer, should pray four rakas.''\n\n\nMalik said that someone who prayed a raka with the imam on\nthe day of jumua, then had a nosebleed and left and came back and the\nimam had prayed both rakas, should complete the prayer with another\nraka as long as he had not spoken.\n\n\nMalik said, \"If some one\nhas a nosebleed, or something happens to him and he has no alternative\nbut to leave, he does not have to ask permission of the imam if he\nwants to leave on the day of jumua.\""}},{"id":14,"idInBook":14,"chapterId":5,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ سَأَلَ ابْنَ شِهَابٍ عَنْ قَوْلِ اللَّهِ، عَزَّ وَجَلَّ ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا نُودِيَ لِلصَّلاَةِ مِنْ يَوْمِ الْجُمُعَةِ فَاسْعَوْا إِلَى ذِكْرِ اللَّهِ‏}‏ فَقَالَ ابْنُ شِهَابٍ كَانَ عُمَرُ بْنُ الْخَطَّابِ يَقْرَؤُهَا إِذَا نُودِيَ لِلصَّلاَةِ مِنْ يَوْمِ الْجُمُعَةِ فَامْضُوا إِلَى ذِكْرِ اللَّهِ ‏.‏ قَالَ مَالِكٌ وَإِنَّمَا السَّعْىُ فِي كِتَابِ اللَّهِ الْعَمَلُ وَالْفِعْلُ يَقُولُ اللَّهُ تَبَارَكَ وَتَعَالَى ‏{‏وَإِذَا تَوَلَّى سَعَى فِي الأَرْضِ‏}‏ وَقَالَ تَعَالَى ‏{‏وَأَمَّا مَنْ جَاءَكَ يَسْعَى وَهُوَ يَخْشَى‏}‏ وَقَالَ ‏{‏ثُمَّ أَدْبَرَ يَسْعَى‏}‏ وَقَالَ ‏{‏إِنَّ سَعْيَكُمْ لَشَتَّى‏}‏ قَالَ مَالِكٌ فَلَيْسَ السَّعْىُ الَّذِي ذَكَرَ اللَّهُ فِي كِتَابِهِ بِالسَّعْىِ عَلَى الأَقْدَامِ وَلاَ الاِشْتِدَادَ وَإِنَّمَا عَنَى الْعَمَلَ وَالْفِعْلَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had asked Ibn Shihab about\nthe word of Allah, the Majestic, the Mighty, \"O you who accept, when\nthe call is made for the prayer on the day of jumua, make haste to the\nremembrance of Allah.\"(Sura 62 ayat 9). Ibn Shihab said, ''Umar ibn\nal-Khattab used to recite, 'When the call is made for the prayer on\nthe day of jumua, go to the remembrance of Allah.' \"\n\n\nMalik\nsaid, \"Making haste in the Book of Allah is only deed and action.\nAllah the Blessed, the Exalted, says 'and when he turns away, he acts\nin the land' (Sura 2 ayat 205), and He, the Exalted, said, 'and as for\nthe one who comes to you acting with fear' (Sura 80 ayat 8), and He\nsaid, 'then he turned his back, and acted' (Sura 79 ayat 22),and He\nsaid, 'Your deeds are diverse' \" (Sura 92  ayat 4). Malik said, \"Thus\nmaking haste which Allah mentions in His Book is not running on the\nfeet or exertion. It only means deed and actions.\""}},{"id":15,"idInBook":15,"chapterId":5,"bookId":7,"arabic":"","english":{"narrator":"","text":"Malik said, \"If the imam stops off on a journey in a town where\njumua is obligatory and he gives a khutba and takes the jumua prayer\nfor them, then the people of the town and any other people present do\nthe jumua prayer with him.\"\n\n\nMalik said, \"If the imam gathers\npeople for prayer while he is travelling in a town where the jumua\nprayer is not obligatory, then there is no jumua for him, nor for the\npeople of the town, nor for anyone else who joins them for the prayer\nin congregation, and the people of the town and anyone else who is not\ntravelling should complete the prayer.\"\n\n\nMalik added, \"A\ntraveller does not have to do jumua \""}},{"id":16,"idInBook":16,"chapterId":5,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم ذَكَرَ يَوْمَ الْجُمُعَةِ فَقَالَ ‏\n\"‏ فِيهِ سَاعَةٌ لاَ يُوَافِقُهَا عَبْدٌ مُسْلِمٌ وَهُوَ قَائِمٌ يُصَلِّي يَسْأَلُ اللَّهَ شَيْئًا إِلاَّ أَعْطَاهُ إِيَّاهُ ‏\"‏ ‏.‏ وَأَشَارَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِيَدِهِ يُقَلِّلُهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'z Zinad from al-Araj from\nAbu Hurayra that the Messenger of Allah, may Allah bless him and grant\nhim peace, mentioned the day of jumua and said, \"There is a time in it\nwhen Allah gives to a muslim slave standing in prayer whatever he asks\nfor,\" and the Messenger of Allah, may Allah bless him and grant him\npeace, indicated with his hand how small it was."}},{"id":17,"idInBook":17,"chapterId":5,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ الْهَادِ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ الْحَارِثِ التَّيْمِيِّ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ قَالَ خَرَجْتُ إِلَى الطُّورِ فَلَقِيتُ كَعْبَ الأَحْبَارِ فَجَلَسْتُ مَعَهُ فَحَدَّثَنِي عَنِ التَّوْرَاةِ وَحَدَّثْتُهُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَكَانَ فِيمَا حَدَّثْتُهُ أَنْ قُلْتُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ خَيْرُ يَوْمٍ طَلَعَتْ عَلَيْهِ الشَّمْسُ يَوْمُ الْجُمُعَةِ فِيهِ خُلِقَ آدَمُ وَفِيهِ أُهْبِطَ مِنَ الْجَنَّةِ وَفِيهِ تِيبَ عَلَيْهِ وَفِيهِ مَاتَ وَفِيهِ تَقُومُ السَّاعَةُ وَمَا مِنْ دَابَّةٍ إِلاَّ وَهِيَ مُصِيخَةٌ يَوْمَ الْجُمُعَةِ مِنْ حِينِ تُصْبِحُ حَتَّى تَطْلُعَ الشَّمْسُ شَفَقًا مِنَ السَّاعَةِ إِلاَّ الْجِنَّ وَالإِنْسَ وَفِيهِ سَاعَةٌ لاَ يُصَادِفُهَا عَبْدٌ مُسْلِمٌ وَهُوَ يُصَلِّي يَسْأَلُ اللَّهَ شَيْئًا إِلاَّ أَعْطَاهُ إِيَّاهُ ‏\"‏ ‏.‏ قَالَ كَعْبٌ ذَلِكَ فِي كُلِّ سَنَةٍ يَوْمٌ ‏.‏ فَقُلْتُ بَلْ فِي كُلِّ جُمُعَةٍ ‏.‏ فَقَرَأَ كَعْبٌ التَّوْرَاةَ فَقَالَ صَدَقَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏ قَالَ أَبُو هُرَيْرَةَ فَلَقِيتُ بَصْرَةَ بْنَ أَبِي بَصْرَةَ الْغِفَارِيَّ فَقَالَ مِنْ أَيْنَ أَقْبَلْتَ فَقُلْتُ مِنَ الطُّورِ ‏.‏ فَقَالَ لَوْ أَدْرَكْتُكَ قَبْلَ أَنْ تَخْرُجَ إِلَيْهِ مَا خَرَجْتَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ لاَ تُعْمَلُ الْمَطِيُّ إِلاَّ إِلَى ثَلاَثَةِ مَسَاجِدَ إِلَى الْمَسْجِدِ الْحَرَامِ وَإِلَى مَسْجِدِي هَذَا وَإِلَى مَسْجِدِ إِيلْيَاءَ أَوْ بَيْتِ الْمَقْدِسِ ‏\"‏ ‏.‏ يَشُكُّ ‏.‏ قَالَ أَبُو هُرَيْرَةَ ثُمَّ لَقِيتُ عَبْدَ اللَّهِ بْنَ سَلاَمٍ فَحَدَّثْتُهُ بِمَجْلِسِي مَعَ كَعْبِ الأَحْبَارِ وَمَا حَدَّثْتُهُ بِهِ فِي يَوْمِ الْجُمُعَةِ فَقُلْتُ قَالَ كَعْبٌ ذَلِكَ فِي كُلِّ سَنَةٍ يَوْمٌ ‏.‏ قَالَ قَالَ عَبْدُ اللَّهِ بْنُ سَلاَمٍ كَذَبَ كَعْبٌ ‏.‏ فَقُلْتُ ثُمَّ قَرَأَ كَعْبٌ التَّوْرَاةَ فَقَالَ بَلْ هِيَ فِي كُلِّ جُمُعَةٍ ‏.‏ فَقَالَ عَبْدُ اللَّهِ بْنُ سَلاَمٍ صَدَقَ كَعْبٌ ‏.‏ ثُمَّ قَالَ عَبْدُ اللَّهِ بْنُ سَلاَمٍ قَدْ عَلِمْتُ أَيَّةَ سَاعَةٍ هِيَ ‏.‏ قَالَ أَبُو هُرَيْرَةَ فَقُلْتُ لَهُ أَخْبِرْنِي بِهَا وَلاَ تَضِنَّ عَلَىَّ ‏.‏ فَقَالَ عَبْدُ اللَّهِ بْنُ سَلاَمٍ هِيَ آخِرُ سَاعَةٍ فِي يَوْمِ الْجُمُعَةِ ‏.‏ قَالَ أَبُو هُرَيْرَةَ فَقُلْتُ وَكَيْفَ تَكُونُ آخِرُ سَاعَةٍ فِي يَوْمِ الْجُمُعَةِ وَقَدْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ يُصَادِفُهَا عَبْدٌ مُسْلِمٌ وَهُوَ يُصَلِّي ‏\"‏ ‏.‏ وَتِلْكَ السَّاعَةُ سَاعَةٌ لاَ يُصَلَّى فِيهَا فَقَالَ عَبْدُ اللَّهِ بْنُ سَلاَمٍ أَلَمْ يَقُلْ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ جَلَسَ مَجْلِسًا يَنْتَظِرُ الصَّلاَةَ فَهُوَ فِي صَلاَةٍ حَتَّى يُصَلِّيَ ‏\"‏ ‏.‏ قَالَ أَبُو هُرَيْرَةَ فَقُلْتُ بَلَى ‏.‏ قَالَ فَهُوَ ذَلِكَ ‏.‏","english":{"narrator":"Yahya related to me from Malik from Yazid ibn Abdullah ibn al-Had\nfrom Muhammad ibn Ibrahim ibn al-Harith at-Taymi from Abu Salama ibn\nAbd ar-Rahman ibn Awf that Abu Hurayra said, \"I went out to at-Tur\n(Mount Sinai) and met Kab al Ahbar and sat with him. He related to me\nthings from the Tawrah and I related to him things from the Messenger\nof Allah, may Allah bless him and grant him peace. Among the things I\nrelated to him was that the Messenger of Allah, may Allah bless him\nand grant him peace, said, 'The best of days on which the sun rises is\nthe day of jumua. In it Adam was created, and in it he fell from the\nGarden. In it he was forgiven, and in it he died. In it the Hour\noccurs, and every moving thing listens from morning till sunset in\napprehension of the Hour except jinn and men. In it is a time when\nAllah gives toa muslim slave standing in prayer whatever he asks for.'\nKab said, 'That is one day in every year.' I said, 'No, in every\njumua.' Then Kab recited the Tawrah and said, 'The Messenger of Allah\nhas spoken the truth.' \"\n\n\nAbu Hurayra continued, \"I met Basra\nibn Abi Basra al-Ghiffari and he said, 'Where have you come from?' I\nsaid, 'From at-Tur.' He said, 'If I had seen you before you left, you\nwould not have gone. I heard the Messenger of Allah, may Allah bless\nhim and grant him peace, say, \"Only make a special journey to three\nmosques:","text":"the mosque of the Haram (Makka), this mosque (Madina), and\nthe mosque of Ilya or the Bait al-Maqdis (two names of Jerusalem).\" '\n\" (He was not sure which expression was used.)\n\n\nAbu Hurayra\ncontinued, \"Then I met Abdullah ibn Salam and I told him that I had\nsat with Kabal-Ahbar, and I mentioned what I had related to him about\nthe day of jumua, and told him that Kab had said, 'That is one day in\nevery year.' Abdullah ibn Salam said, 'Kab lied,' and I added, 'Kab\nthen recited the Tawrah and said, \"No, it is in every jumua.''  '\nAbdullah ibn Salam said, 'Kab spoke the truth. 'Then Abdullah ibn\nSalam said, 'I know what time that is.' \"\n\n\nAbu Hurayra\ncontinued, \"I said to him, 'Let me know it - don't keep it from me.'\nAbdullah ibn Salam said, 'It is the last period of time in the dayof\njumua.' \"\n\n\nAbu Hurayra continued, \"I said, 'How can it be the\nlast period of time in the day of jumua, when the Messenger of Allah,\nmay Allah bless him and grant him peace, said, \"a muslim slave\nstanding in prayer\", and that is a time when there is no prayer?'\nAbdullah ibn Salam replied, 'Didn't the Messenger of Allah, may Allah\nbless him and grant him peace, say, \"Whoever sits waiting for the\nprayer is in prayer until he prays?\" \"'\n\n\nAbu Hurayra added, \"I\nsaid, 'Of course.' He said, 'Then it is that.' \""}},{"id":18,"idInBook":18,"chapterId":5,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ بَلَغَهُ أَنَّ رَسُولَ اللَّهِ قَالَ ‏\n\"‏ مَا عَلَى أَحَدِكُمْ لَوِ اتَّخَذَ ثَوْبَيْنِ لِجُمُعَتِهِ سِوَى ثَوْبَىْ مَهْنَتِهِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said that he had\nheard that the Messenger of Allah, may Allah bless him and grant him\npeace, said, \"There is nothing wrong in wearing two garments which are\nnot work-clothes for jumua.\""}},{"id":19,"idInBook":19,"chapterId":5,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ لاَ يَرُوحُ إِلَى الْجُمُعَةِ إِلاَّ ادَّهَنَ وَتَطَيَّبَ إِلاَّ أَنْ يَكُونَ حَرَامًا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nwould never go to jumua without wearing oil and perfume except when it\nwas forbidden (i.e. when he was muhrim)."}},{"id":20,"idInBook":20,"chapterId":5,"bookId":7,"arabic":"حَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ حَزْمٍ، عَمَّنْ حَدَّثَهُ عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ كَانَ يَقُولُ لأَنْ يُصَلِّيَ أَحَدُكُمْ بِظَهْرِ الْحَرَّةِ خَيْرٌ لَهُ مِنْ أَنْ يَقْعُدَ حَتَّى إِذَا قَامَ الإِمَامُ يَخْطُبُ جَاءَ يَتَخَطَّى رِقَابَ النَّاسِ يَوْمَ الْجُمُعَةِ ‏.‏ قَالَ مَالِكٌ السُّنَّةُ عِنْدَنَا أَنْ يَسْتَقْبِلَ النَّاسُ الإِمَامَ يَوْمَ الْجُمُعَةِ إِذَا أَرَادَ أَنْ يَخْطُبَ مَنْ كَانَ مِنْهُمْ يَلِي الْقِبْلَةَ وَغَيْرَهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi from Abdullah ibn Abi\nBakr ibn Hazm from whoever related it to him that Abu Hurayra used to\nsay, \"It is better for a man to pray on the surface of al Harra (a\nrocky area in Madina) than for him to wait until the imam stands to\ngive the khutba and then come and step over people's necks.\"\n\n\nMalik said, \"The sunna with us is that the people face the imam on the\nday of jumua when he intends to give the khutba, whether they are near\nthe qibla or elsewhere.\""}},{"id":21,"idInBook":21,"chapterId":5,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ ضَمْرَةَ بْنِ سَعِيدٍ الْمَازِنِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، أَنَّ الضَّحَّاكَ بْنَ قَيْسٍ، سَأَلَ النُّعْمَانَ بْنَ بَشِيرٍ مَاذَا كَانَ يَقْرَأُ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمَ الْجُمُعَةِ عَلَى إِثْرِ سُورَةِ الْجُمُعَةِ قَالَ كَانَ يَقْرَأُ ‏{‏هَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ‏}‏","english":{"narrator":"","text":"Yahya related to me from Malik from Damra ibn Said al-Mazini from\nUbaydullah ibn Abdullah ibn Utba ibn Masud that ad-Dahhak ibn Qays\nasked an-Numan ibn Bashir, \"What did the Messenger of Allah, may Allah\nbless him and grant him peace, use to recite on the day of jumua after\nsuratal-Jumua (Sura 62)?\" He said, \"He used to recite al-Ghashiya\n(Sura 88).\""}},{"id":22,"idInBook":22,"chapterId":5,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ صَفْوَانَ بْنِ سُلَيْمٍ، - قَالَ مَالِكٌ لاَ أَدْرِي أَعَنِ النَّبِيِّ صلى الله عليه وسلم أَمْ لاَ - أَنَّهُ قَالَ ‏\n\"‏ مَنْ تَرَكَ الْجُمُعَةَ ثَلاَثَ مَرَّاتٍ مِنْ غَيْرِ عُذْرٍ وَلاَ عِلَّةٍ طَبَعَ اللَّهُ عَلَى قَلْبِهِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Safwan ibn Sulaym said, \"If\nanyone omits jumua three times without reason or illness, Allah will\nset a seal on his heart.\" (Malik said, \"I don't know if it was from\nthe Messenger of Allah, may Allah bless him and grant him peace, or\nnot.\")"}},{"id":23,"idInBook":23,"chapterId":5,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَطَبَ خُطْبَتَيْنِ يَوْمَ الْجُمُعَةِ وَجَلَسَ بَيْنَهُمَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Jafar ibn Muhammad from his\nfather that the Messenger of Allah, may Allah bless him and grant him\npeace, gave two khutbas on the day of jumua and sat down between them."}}],"chapter":{"id":5,"bookId":7,"arabic":"كتاب الجمعة","english":"Jumu'a"}}