{"metadata":{"length":19,"arabic":{"title":"موطأ مالك","author":"الإمام مالك بن أنس","introduction":"كتاب العين"},"english":{"title":"Muwatta Malik","author":"Imam Malik ibn Anas","introduction":"The Evil Eye"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":50,"bookId":7,"arabic":"وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ، أَنَّهُ سَمِعَ أَبَاهُ، يَقُولُ اغْتَسَلَ أَبِي سَهْلُ بْنُ حُنَيْفٍ بِالْخَرَّارِ فَنَزَعَ جُبَّةً كَانَتْ عَلَيْهِ وَعَامِرُ بْنُ رَبِيعَةَ يَنْظُرُ قَالَ وَكَانَ سَهْلٌ رَجُلاً أَبْيَضَ حَسَنَ الْجِلْدِ - قَالَ - فَقَالَ لَهُ عَامِرُ بْنُ رَبِيعَةَ مَا رَأَيْتُ كَالْيَوْمِ وَلاَ جِلْدَ عَذْرَاءَ ‏.‏ قَالَ فَوُعِكَ سَهْلٌ مَكَانَهُ وَاشْتَدَّ وَعْكُهُ فَأُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَأُخْبِرَ أَنَّ سَهْلاً وُعِكَ وَأَنَّهُ غَيْرُ رَائِحٍ مَعَكَ يَا رَسُولَ اللَّهِ فَأَتَاهُ رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَخْبَرَهُ سَهْلٌ بِالَّذِي كَانَ مِنْ شَأْنِ عَامِرٍ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ عَلاَمَ يَقْتُلُ أَحَدُكُمْ أَخَاهُ أَلاَّ بَرَّكْتَ إِنَّ الْعَيْنَ حَقٌّ تَوَضَّأْ لَهُ ‏\"‏ ‏.‏ فَتَوَضَّأَ لَهُ عَامِرٌ فَرَاحَ سَهْلٌ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم لَيْسَ بِهِ بَأْسٌ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Muhammad ibn Abi Umama ibn\nSahl ibn Hunayf heard his father say, \"My father, Sahl ibn Hunayf did\na ghusl at al-Kharrar. He removed the jubbah he had on while Amir ibn\nRabia was watching, and Sahl was a man with beautiful white skin. Amir\nsaid to him, 'I have never seen anything like what I have seen today,\nnot even the skin of a virgin.' Sahl fell ill on the spot, and his\ncondition grew worse. Somebody went to the Messenger of Allah, may\nAllah bless him and grant him peace, and told him that Sahl was ill,\nand could not go with him. The Messenger of Allah, may Allah bless him\nand grant him peace, came to him, and Sahl told him what had happened\nwith Amir. The Messenger of Allah, may Allah bless him and grant him\npeace, said, 'Why does one of you kill his brother? Why did you not\nsay, \"May Allah bless you?\" (ta baraka-llah) The evil eye is true. Do\nwudu from it.' Amir did wudu from it and Sahl went with the Messenger\nof Allah, may Allah bless him and grant him peace, and there was\nnothing wrong with him.\""}},{"id":2,"idInBook":2,"chapterId":50,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ، أَنَّهُ قَالَ رَأَى عَامِرُ بْنُ رَبِيعَةَ سَهْلَ بْنَ حُنَيْفٍ يَغْتَسِلُ فَقَالَ مَا رَأَيْتُ كَالْيَوْمِ وَلاَ جِلْدَ مُخْبَأَةٍ ‏.‏ فَلُبِطَ سَهْلٌ فَأُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقِيلَ يَا رَسُولَ اللَّهِ هَلْ لَكَ فِي سَهْلِ بْنِ حُنَيْفٍ وَاللَّهِ مَا يَرْفَعُ رَأْسَهُ ‏.‏ فَقَالَ ‏\"‏ هَلْ تَتَّهِمُونَ لَهُ أَحَدًا ‏\"‏ قَالُوا نَتَّهِمُ عَامِرَ بْنَ رَبِيعَةَ ‏.‏ قَالَ فَدَعَا رَسُولُ اللَّهِ صلى الله عليه وسلم عَامِرًا فَتَغَيَّظَ عَلَيْهِ وَقَالَ ‏\"‏ عَلاَمَ يَقْتُلُ أَحَدُكُمْ أَخَاهُ أَلاَّ بَرَّكْتَ اغْتَسِلْ لَهُ ‏\"‏ ‏.‏ فَغَسَلَ عَامِرٌ وَجْهَهُ وَيَدَيْهِ وَمِرْفَقَيْهِ وَرُكْبَتَيْهِ وَأَطْرَافَ رِجْلَيْهِ وَدَاخِلَةَ إِزَارِهِ فِي قَدَحٍ ثُمَّ صُبَّ عَلَيْهِ فَرَاحَ سَهْلٌ مَعَ النَّاسِ لَيْسَ بِهِ بَأْسٌ ‏.‏","english":{"narrator":"","text":"Malik related to me from Ibn Shihab that Abu Umama ibn Sahl ibn\nHunayf said, ''Amir ibn Rabia saw Sahl ibn Hunayf doing a ghusl and\nsaid, 'I have not seen the like of what I see today, not even the skin\nof a maiden who has never been out of doors.' Sahl fell to the ground.\nThe Messenger of Allah, may Allah bless him and grant him peace, was\napproached and it was said, 'Messenger of Allah, can you do anything\nabout Sahl ibn Hunayf? By Allah, he can not raise his head.' He said,\n'Do you suspect anyone of it?' They said, 'We suspect Amir ibn Rabia.'\n\"\n\n\nHe continued, \"The Messenger of Allah, may Allah bless him\nand grant him peace, summoned Amir and was furious with him and said,\n'Why does one of you kill his brother? Why did you not say, \"May Allah\nbless you?\" Do ghusl for it.' Amir washed his face, hands, elbows,\nknees, the end of his feet, and inside his lower garment in a vessel.\nThen he poured it over him, and Sahl went off with the people, and\nthere was nothing wrong with him.\""}},{"id":3,"idInBook":3,"chapterId":50,"bookId":7,"arabic":"حَدَّثَنِي عَنْ مَالِكٍ، عَنْ حُمَيْدِ بْنِ قَيْسٍ الْمَكِّيِّ، أَنَّهُ قَالَ دُخِلَ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم بِابْنَىْ جَعْفَرِ بْنِ أَبِي طَالِبٍ فَقَالَ لِحَاضِنَتِهِمَا ‏\"‏ مَا لِي أَرَاهُمَا ضَارِعَيْنِ ‏\"‏ ‏.‏ فَقَالَتْ حَاضِنَتُهُمَا يَا رَسُولَ اللَّهِ إِنَّهُ تَسْرَعُ إِلَيْهِمَا الْعَيْنُ وَلَمْ يَمْنَعْنَا أَنْ نَسْتَرْقِيَ لَهُمَا إِلاَّ أَنَّا لاَ نَدْرِي مَا يُوَافِقُكَ مِنْ ذَلِكَ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اسْتَرْقُوا لَهُمَا فَإِنَّهُ لَوْ سَبَقَ شَىْءٌ الْقَدَرَ لَسَبَقَتْهُ الْعَيْنُ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Humayd ibn Qays al-Makki\nsaid, \"A man came to the Messenger of Allah, may Allah bless him and\ngrant him peace, with the two sons of Jafar ibn Abi Talib. He said to\ntheir nursemaid, 'Why do I see them so thin?' Their nursemaid said,\n'Messenger of Allah, the evil eye goes quickly to them. Nothing stops\nus from asking someone to make incantations (using ayats of Qur'an)\nfor them, except that we do not know what of that would agree with\nyou.' The Messenger of ,Allah, may Allah bless him and grant him\npeace, said, 'Make incantations for them. Had anything been able to\nprecede the decree, the evil eye would precede it.' \""}},{"id":4,"idInBook":4,"chapterId":50,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، أَنَّ عُرْوَةَ بْنَ الزُّبَيْرِ، حَدَّثَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم دَخَلَ بَيْتَ أُمِّ سَلَمَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم وَفِي الْبَيْتِ صَبِيٌّ يَبْكِي فَذَكَرُوا لَهُ أَنَّ بِهِ الْعَيْنَ - قَالَ عُرْوَةُ - فَقَالَ رَسُولُ اللَّهِ","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said from Sulayman\nibn Yasar that Urwa ibn az-Zubayr told him that the Messenger of\nAllah, may Allah bless him and grant him peace, entered the house of\nUmm Salama, the wife of the Prophet, may Allah bless him and grant him\npeace. There was a child weeping in the house, and they told him that\nit was from the evil eye. Urwa said, \"The Messenger of Allah, may\nAllah bless him and grant him peace, said, 'Why do you not find\nsomeone to make an incantation to protect it from the evil eye?' \""}},{"id":5,"idInBook":5,"chapterId":50,"bookId":7,"arabic":"حَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا مَرِضَ الْعَبْدُ بَعَثَ اللَّهُ تَعَالَى إِلَيْهِ مَلَكَيْنِ فَقَالَ انْظُرَا مَاذَا يَقُولُ لِعُوَّادِهِ ‏.‏ فَإِنْ هُوَ - إِذَا جَاءُوهُ - حَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ رَفَعَا ذَلِكَ إِلَى اللَّهِ عَزَّ وَجَلَّ - وَهُوَ أَعْلَمُ - فَيَقُولُ لِعَبْدِي عَلَىَّ إِنْ تَوَفَّيْتُهُ أَنْ أُدْخِلَهُ الْجَنَّةَ وَإِنْ أَنَا شَفَيْتُهُ أَنْ أُبْدِلَ لَهُ لَحْمًا خَيْرًا مِنْ لَحْمِهِ وَدَمًا خَيْرًا مِنْ دَمِهِ وَأَنْ أُكَفِّرَ عَنْهُ سَيِّئَاتِهِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Zayd ibn Aslam from Ata ibn\nYasar that the Messenger of Allah, may Allah bless him and grant him\npeace, said, \"When the slave is ill, Allah ta'ala sends two angels to\nhim.\" He said, \"They look at what he says to his visitors. If he\npraises Allah and lauds Him, when they come to him, they take that up\nto Allah, the Mighty, the Majestic, and He knows best, and He says,\n'If I make my slave die, I will make him enter the Garden. If I heal\nhim, I will replace his flesh with better flesh and his blood with\nbetter blood and I will efface his evil actions.'\""}},{"id":6,"idInBook":6,"chapterId":50,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَزِيدَ بْنِ خُصَيْفَةَ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، أَنَّهُ قَالَ سَمِعْتُ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم تَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ يُصِيبُ الْمُؤْمِنَ مِنْ مُصِيبَةٍ حَتَّى الشَّوْكَةُ إِلاَّ قُصَّ بِهَا أَوْ كُفِّرَ بِهَا مِنْ خَطَايَاهُ ‏\"‏ ‏.‏ لاَ يَدْرِي يَزِيدُ أَيَّهُمَا قَالَ عُرْوَةُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yazid ibn Khusayfa that Urwa\nibn az-Zubayr said that he heard A'isha, the wife of the Prophet, may\nAllah bless him and grant him peace, say, \"The Messenger of Allah, may\nAllah bless him and grant him peace, said, 'When a mumin is afflicted\nby something, even a thorn, it removes (or effaces) his wrong\nactions.' \" Yazid did not know which of them Urwa said."}},{"id":7,"idInBook":7,"chapterId":50,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي صَعْصَعَةَ، أَنَّهُ قَالَ سَمِعْتُ أَبَا الْحُبَابِ، سَعِيدَ بْنَ يَسَارٍ يَقُولُ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ يُرِدِ اللَّهُ بِهِ خَيْرًا يُصِبْ مِنْهُ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Muhammad ibn Abdullah ibn Abi\nSasaca said that he heard Abu'l-Hubab Said ibn Yasar say that he had\nheard Abu Hurayra say, \"The Messenger of Allah, may Allah bless him\nand grant him peace, said, 'Allah afflicts the one for whom He desires\ngood.'\""}},{"id":8,"idInBook":8,"chapterId":50,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ رَجُلاً، جَاءَهُ الْمَوْتُ فِي زَمَانِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ رَجُلٌ هَنِيئًا لَهُ مَاتَ وَلَمْ يُبْتَلَ بِمَرَضٍ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ وَيْحَكَ وَمَا يُدْرِيكَ لَوْ أَنَّ اللَّهَ ابْتَلاَهُ بِمَرَضٍ يُكَفِّرُ بِهِ مِنْ سَيِّئَاتِهِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said that death\ncame to a man in the time of the Messenger of Allah, may Allah bless\nhim and grant him peace. A man said, \"He was fortunate,\" as he had\ndied without being tried by illness. The Messenger of Allah, may Allah\nbless him and grant him peace, said, \"Alas for you, what will let you\nknow that if Allah had tried him with illness, He would have wiped out\nhis wrong actions.\""}},{"id":9,"idInBook":9,"chapterId":50,"bookId":7,"arabic":"حَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَزِيدَ بْنِ خُصَيْفَةَ، أَنَّ عَمْرَو بْنَ عَبْدِ اللَّهِ بْنِ كَعْبٍ السَّلَمِيَّ، أَخْبَرَهُ أَنَّ نَافِعَ بْنَ جُبَيْرٍ أَخْبَرَهُ عَنْ عُثْمَانَ بْنِ أَبِي الْعَاصِ، أَنَّهُ أَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ عُثْمَانُ وَبِي وَجَعٌ قَدْ كَادَ يُهْلِكُنِي ‏.‏ قَالَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ امْسَحْهُ بِيَمِينِكَ سَبْعَ مَرَّاتٍ وَقُلْ أَعُوذُ بِعِزَّةِ اللَّهِ وَقُدْرَتِهِ مِنْ شَرِّ مَا أَجِدُ ‏\"‏ ‏.‏ قَالَ فَقُلْتُ ذَلِكَ فَأَذْهَبَ اللَّهُ مَا كَانَ بِي فَلَمْ أَزَلْ آمُرُ بِهَا أَهْلِي وَغَيْرَهُمْ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yazid ibn Khusayfa that Amr\nibn Abdullah ibn Kab as-Salami told him that Nafi ibn Jubayr told him\nthat Uthman ibn Abi al-As came to the Messenger of Allah, may Allah\nbless him and grant him peace. Uthman said that he had a pain which\nwas enough to kill him. The Messenger of Allah, may Allah bless him\nand grant him peace, said, \"Rub it with your right hand seven times\nand say, 'I take refuge with the might of Allah and His power from the\nevil of what I feel.' \"\n\n\nUthman added, \"I said that, and Allah\nremoved what I had. I still command my family and others to say it.\""}},{"id":10,"idInBook":10,"chapterId":50,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا اشْتَكَى يَقْرَأُ عَلَى نَفْسِهِ بِالْمُعَوِّذَاتِ وَيَنْفِثُ ‏.‏ قَالَتْ فَلَمَّا اشْتَدَّ وَجَعُهُ كُنْتُ أَنَا أَقْرَأُ عَلَيْهِ وَأَمْسَحُ عَلَيْهِ بِيَمِينِهِ رَجَاءَ بَرَكَتِهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Urwa ibn az-\nZubayr from A'isha that the Messenger of Allah, may Allah bless him\nand grant him peace, when he had a complaint, would recite the last\nthree suras of Qur'an, over himself and blow. She said, \"When his pain\nwas great, I would recite it over him and wipe him with his right hand\nhoping for its blessing.\""}},{"id":11,"idInBook":11,"chapterId":50,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، أَنَّ أَبَا بَكْرٍ الصِّدِّيقَ، دَخَلَ عَلَى عَائِشَةَ وَهِيَ تَشْتَكِي وَيَهُودِيَّةٌ تَرْقِيهَا فَقَالَ أَبُو بَكْرٍ ارْقِيهَا بِكِتَابِ اللَّهِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said from Amra bint\nAbd ar-Rahman that Abu Bakr as-Siddiq visited A'isha while she had a\n complaint and a jewish woman was making incantation (ruqya)\nfor her. Abu Bakr said, \"Do it (incantation) with the Book of Allah.\""}},{"id":12,"idInBook":12,"chapterId":50,"bookId":7,"arabic":"حَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، أَنَّ رَجُلاً، فِي زَمَانِ رَسُولِ اللَّهِ صلى الله عليه وسلم أَصَابَهُ جُرْحٌ فَاحْتَقَنَ الْجُرْحُ الدَّمَ وَأَنَّ الرَّجُلَ دَعَا رَجُلَيْنِ مِنْ بَنِي أَنْمَارٍ فَنَظَرَا إِلَيْهِ فَزَعَمَا أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ لَهُمَا ‏\"‏ أَيُّكُمَا أَطَبُّ ‏\"‏ ‏.‏ فَقَالاَ أَوَ فِي الطِّبِّ خَيْرٌ يَا رَسُولَ اللَّهِ فَزَعَمَ زَيْدٌ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ أَنْزَلَ الدَّوَاءَ الَّذِي أَنْزَلَ الأَدْوَاءَ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Zayd ibn Aslam that a man\nreceived a wound in the time of the Messenger of Allah, may Allah\nbless him and grant him peace. The blood clotted in the wound and the\nman called two men from the Banu Ammar tribe. They looked at it and\nclaimed that the Messenger of Allah, may Allah bless him and grant him\npeace, said to them, \"Which of you is the better doctor?\" They said,\n\"Is there any good in medicine, Messenger of Allah?\" Zayd claimed that\nthe Messenger of Allah, may Allah bless him and grant him peace, said,\n\"The one who sent down the disease sent down the remedy.\""}},{"id":13,"idInBook":13,"chapterId":50,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، قَالَ بَلَغَنِي أَنَّ سَعْدَ بْنَ زُرَارَةَ، اكْتَوَى فِي زَمَانِ رَسُولِ اللَّهِ صلى الله عليه وسلم مِنَ الذُّبَحَةِ فَمَاتَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Yahya ibn Said said, \"I heard\nthat Sad ibn Zurara cauterized himself because of a pain in the throat\naccompanied by blood and he died.\""}},{"id":14,"idInBook":14,"chapterId":50,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، اكْتَوَى مِنَ اللَّقْوَةِ وَرُقِيَ مِنَ الْعَقْرَبِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\ncauterized for the palsy and he had a talisman made for a scorpion\nsting."}},{"id":15,"idInBook":15,"chapterId":50,"bookId":7,"arabic":"حَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ فَاطِمَةَ بِنْتِ الْمُنْذِرِ، أَنَّ أَسْمَاءَ بِنْتَ أَبِي بَكْرٍ، كَانَتْ إِذَا أُتِيَتْ بِالْمَرْأَةِ وَقَدْ حُمَّتْ تَدْعُو لَهَا أَخَذَتِ الْمَاءَ فَصَبَّتْهُ بَيْنَهَا وَبَيْنَ جَيْبِهَا وَقَالَتْ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَأْمُرُنَا أَنْ نُبْرِدَهَا بِالْمَاءِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa from Fatima\nbint al-Mundhir that whenever a woman who had a fever, was brought to\nAsma bint Abi Bakr, she made dua for her and took water and poured it\ninside her collar. She said, \"The Messenger of Allah, may Allah bless\nhim and grant him peace, ordered us to cool it with water.\""}},{"id":16,"idInBook":16,"chapterId":50,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ الْحُمَّى مِنْ فَيْحِ جَهَنَّمَ فَابْرُدُوهَا بِالْمَاءِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa from his\nfather that the Messenger of Allah, may Allah bless him and grant him\npeace, said, \"Fever is from the vehemence of the heat of Jahannam, so\ncool it with water.\""}},{"id":17,"idInBook":17,"chapterId":50,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْحُمَّى مِنْ فَيْحِ جَهَنَّمَ فَأَطْفِئُوهَا بِالْمَاءِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me from Nafi from Ibn\nUmar that the Messenger of Allah, may Allah bless him and grant him\npeace, said, \"Fever is from the vehemence of the heat of Jahannam, so\nput it out with water.\""}},{"id":18,"idInBook":18,"chapterId":50,"bookId":7,"arabic":"حَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا عَادَ الرَّجُلُ الْمَرِيضَ خَاضَ الرَّحْمَةَ حَتَّى إِذَا قَعَدَ عِنْدَهُ قَرَّتْ فِيهِ ‏\"‏ ‏.‏ أَوْ نَحْوَ هَذَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard from Jabir ibn\nAbdullah that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"When a man visits an invalid, he plunges into mercy\nto the extent that when he sits with him, it settles in him,\" or the\nlike of that."}},{"id":19,"idInBook":19,"chapterId":50,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ بْنِ الأَشَجِّ، عَنِ ابْنِ عَطِيَّةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ عَدْوَى وَلاَ هَامَ وَلاَ صَفَرَ وَلاَ يَحُلَّ الْمُمْرِضُ عَلَى الْمُصِحِّ وَلْيَحْلُلِ الْمُصِحُّ حَيْثُ شَاءَ ‏\"‏ ‏.‏ فَقَالُوا يَا رَسُولَ اللَّهِ وَمَا ذَاكَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّهُ أَذًى ‏\"‏ ‏.‏","english":{"narrator":"Yahya related to me from Malik that he had heard from Bukayr ibn\nAbdullah ibn al-Ashajj from Ibn Atiya that the Messenger of Allah, may\nAllah bless him and grant him peace, said:","text":"\"There is no contagion, no\nhama and no serpent in a hungry belly. However, the possessor of sick\nlivestock must not stop at the same place as the possessor of healthy\nlivestock, but the possessor of healthy livestock may stop wherever he\nwishes.\"\n\n\nThey said, \"Messenger of Allah, Why is that?\" The\nMessenger of Allah, may Allah bless him and grant him peace, said, \"It\nis harmful.\"\n\n\n\nNote: The majority of scholars interpret this to mean that these things in and of themselves do not transmit or cause harm through supernatural or hidden means but that Allah is ultimately in control and any fearful superstition around these is false."}}],"chapter":{"id":50,"bookId":7,"arabic":"كتاب العين","english":"The Evil Eye"}}