{"metadata":{"length":8,"arabic":{"title":"موطأ مالك","author":"الإمام مالك بن أنس","introduction":"كتاب الرؤيا"},"english":{"title":"Muwatta Malik","author":"Imam Malik ibn Anas","introduction":"Visions"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":52,"bookId":7,"arabic":"حَدَّثَنِي عَنْ مَالِكٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ الأَنْصَارِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ الرُّؤْيَا الْحَسَنَةُ مِنَ الرَّجُلِ الصَّالِحِ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ ‏\"‏ ‏.‏ \n وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم بِمِثْلِ ذَلِكَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ishaq ibn Abdullah ibn Abi\nTalha al-Ansari from Anas ibn Malik that the Messenger of Allah, may\nAllah bless him and grant him peace, said, \"The good dream of a man\nwho is salih is a forty-sixth part of prophecy.\"\n\n\nYahya\nrelated the like of that to me from Malik from Abu'z-Zinad from al-\nAraj from Abu Hurayra from the Messenger of Allah, may Allah bless him\nand grant him peace."}},{"id":2,"idInBook":2,"chapterId":52,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ زُفَرَ بْنِ صَعْصَعَةَ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا انْصَرَفَ مِنْ صَلاَةِ الْغَدَاةِ يَقُولُ ‏\"‏ هَلْ رَأَى أَحَدٌ مِنْكُمُ اللَّيْلَةَ رُؤْيَا ‏\"‏ ‏.‏ وَيَقُولُ ‏\"‏ لَيْسَ يَبْقَى بَعْدِي مِنَ النُّبُوَّةِ إِلاَّ الرُّؤْيَا الصَّالِحَةُ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ishaq ibn Abdullah ibn Abi\nTalha from Zufar ibn Sasaca from his father from Abu Hurayra that when\nthe Messenger of Allah, may Allah bless him and grant him peace, left\nthe morning prayer, he would say, \"Has any of you had a dream last\nnight? All that will remain of prophecy after me will be the true\ndream .\""}},{"id":3,"idInBook":3,"chapterId":52,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لَنْ يَبْقَى بَعْدِي مِنَ النُّبُوَّةِ إِلاَّ الْمُبَشِّرَاتُ ‏\"‏ ‏.‏ فَقَالُوا وَمَا الْمُبَشِّرَاتُ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ الرُّؤْيَا الصَّالِحَةُ يَرَاهَا الرَّجُلُ الصَّالِحُ أَوْ تُرَى لَهُ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Zayd ibn Aslam from Ata ibn\nYasar that the Messenger of Allah, may Allah bless him and grant him\npeace, said, \"All that will be left of prophecy after me are the\nmubashshirat.\" They said, \"What are the mubashshirat, Messenger of\nAllah?\" He said, \"The true dream which a man who is salih sees - or\nwhich is shown to him - is a forty-sixth part of prophecy.\""}},{"id":4,"idInBook":4,"chapterId":52,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّهُ قَالَ سَمِعْتُ أَبَا قَتَادَةَ بْنَ رِبْعِيٍّ، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ الرُّؤْيَا الصَّالِحَةُ مِنَ اللَّهِ وَالْحُلْمُ مِنَ الشَّيْطَانِ فَإِذَا رَأَى أَحَدُكُمُ الشَّىْءَ يَكْرَهُهُ فَلْيَنْفُثْ عَنْ يَسَارِهِ ثَلاَثَ مَرَّاتٍ إِذَا اسْتَيْقَظَ وَلْيَتَعَوَّذْ بِاللَّهِ مِنْ شَرِّهَا فَإِنَّهَا لَنْ تَضُرَّهُ إِنْ شَاءَ اللَّهُ ‏\"‏ ‏.‏ قَالَ أَبُو سَلَمَةَ إِنْ كُنْتُ لأَرَى الرُّؤْيَا هِيَ أَثْقَلُ عَلَىَّ مِنَ الْجَبَلِ فَلَمَّا سَمِعْتُ هَذَا الْحَدِيثَ فَمَا كُنْتُ أُبَالِيهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said that Abu\nSalama ibn Abd ar-Rahman said, \"I heard Abu Qatada ibn Ribiyy say that\nhe heard the Messenger of Allah, may Allah bless him and grant him\npeace, say, 'The good dream is from Allah, and the bad dream is from\nshaytan. When you see what you dislike, spit to your left side three\ntimes when you wake up, and seek refuge with Allah from its evil. It\nwill not harm you then, Allah willing.' \" Abu Salama said, \"I would\nsee dreams which weighed on me more heavily than a mountain. When I\nheard this hadith, I was not concerned about it.\""}},{"id":5,"idInBook":5,"chapterId":52,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّهُ كَانَ يَقُولُ فِي هَذِهِ الآيَةِ ‏{‏لَهُمُ الْبُشْرَى فِي الْحَيَاةِ الدُّنْيَا وَفِي الآخِرَةِ‏}‏ ‏.‏ قَالَ هِيَ الرُّؤْيَا الصَّالِحَةُ يَرَاهَا الرَّجُلُ الصَّالِحُ أَوْ تُرَى لَهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa that his\nfather said about this ayat, \"You have good news in the life of this\nworld and the next world,\" (Sura 10 ayat 64), that it was the good\ndream which the man who was salih saw or which was shown to him."}},{"id":6,"idInBook":6,"chapterId":52,"bookId":7,"arabic":"حَدَّثَنِي عَنْ مَالِكٍ، عَنْ مُوسَى بْنِ مَيْسَرَةَ، عَنْ سَعِيدِ بْنِ أَبِي هِنْدٍ، عَنْ أَبِي مُوسَى الأَشْعَرِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ لَعِبَ بِالنَّرْدِ فَقَدْ عَصَى اللَّهَ وَرَسُولَهُ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Musa ibn Maysara from Said\nibn Abi Hind from Abu Musa al-Ashari that the Messenger of Allah, may\nAllah bless him and grant him peace, said, \"Whoever plays games of\ndice has disobeyed Allah and His Messenger. \""}},{"id":7,"idInBook":7,"chapterId":52,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَلْقَمَةَ بْنِ أَبِي عَلْقَمَةَ، عَنْ أُمِّهِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ بَلَغَهَا أَنَّ أَهْلَ بَيْتٍ فِي دَارِهَا كَانُوا سُكَّانًا فِيهَا وَعِنْدَهُمْ نَرْدٌ فَأَرْسَلَتْ إِلَيْهِمْ لَئِنْ لَمْ تُخْرِجُوهَا لأُخْرِجَنَّكُمْ مِنْ دَارِي وَأَنْكَرَتْ ذَلِكَ عَلَيْهِمْ ‏.‏","english":{"narrator":"","text":"Yahya related\nto me from Malik from Alqama from his mother that A'isha, the wife of\nthe Prophet, may Allah bless him and grant him peace, heard that the\npeople who lived in a room in her house had some dice. She sent a\nmessage to them, \"If you do not remove them, I will remove you from my\nhouse,\" and she reproached them for it."}},{"id":8,"idInBook":8,"chapterId":52,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ كَانَ إِذَا وَجَدَ أَحَدًا مِنْ أَهْلِهِ يَلْعَبُ بِالنَّرْدِ ضَرَبَهُ وَكَسَرَهَا ‏.‏ قَالَ يَحْيَى وَسَمِعْتُ مَالِكًا يَقُولُ لاَ خَيْرَ فِي الشَّطْرَنْجِ ‏.‏ وَكَرِهَهَا وَسَمِعْتُهُ يَكْرَهُ اللَّعِبَ بِهَا وَبِغَيْرِهَا مِنَ الْبَاطِلِ وَيَتْلُو هَذِهِ الآيَةَ ‏{‏فَمَاذَا بَعْدَ الْحَقِّ إِلاَّ الضَّلاَلُ ‏}‏‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat when he found one of his family playing dice he beat him and\ndestroyed the dice.\n\n\nYahya said that he heard Malik say,\n\"There is no good in chess, and he disapproved of it.\" Yahya said, \"I\nheard him disapprove of playing it and other worthless games. He\nrecited this ayat, 'What is there after the truth except going the\nwrong way.' \" (Sura l0 ayat 32)."}}],"chapter":{"id":52,"bookId":7,"arabic":"كتاب الرؤيا","english":"Visions"}}