{"metadata":{"length":8,"arabic":{"title":"موطأ مالك","author":"الإمام مالك بن أنس","introduction":"كتاب السلام"},"english":{"title":"Muwatta Malik","author":"Imam Malik ibn Anas","introduction":"Greetings"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":53,"bookId":7,"arabic":"حَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ يُسَلِّمُ الرَّاكِبُ عَلَى الْمَاشِي وَإِذَا سَلَّمَ مِنَ الْقَوْمِ وَاحِدٌ أَجْزَأَ عَنْهُمْ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Zayd ibn Aslam that the\nMessenger of Allah, may Allah bless him and grant him peace, said,\n\"The one riding greets the one walking, and when one of a group of\npeople gives a greeting, it is enough for all of them.\""}},{"id":2,"idInBook":2,"chapterId":53,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ وَهْبِ بْنِ كَيْسَانَ، عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَطَاءٍ، أَنَّهُ قَالَ كُنْتُ جَالِسًا عِنْدَ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ فَدَخَلَ عَلَيْهِ رَجُلٌ مِنْ أَهْلِ الْيَمَنِ فَقَالَ السَّلاَمُ عَلَيْكُمْ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ ‏.‏ ثُمَّ زَادَ شَيْئًا مَعَ ذَلِكَ أَيْضًا ‏.‏ قَالَ ابْنُ عَبَّاسٍ وَهُوَ يَوْمَئِذٍ قَدْ ذَهَبَ بَصَرُهُ مَنْ هَذَا قَالُوا هَذَا الْيَمَانِيُّ الَّذِي يَغْشَاكَ ‏.‏ فَعَرَّفُوهُ إِيَّاهُ ‏.‏ قَالَ فَقَالَ ابْنُ عَبَّاسٍ إِنَّ السَّلاَمَ انْتَهَى إِلَى الْبَرَكَةِ ‏.‏ قَالَ يَحْيَى سُئِلَ مَالِكٌ هَلْ يُسَلَّمُ عَلَى الْمَرْأَةِ فَقَالَ أَمَّا الْمُتَجَالَّةُ فَلاَ أَكْرَهُ ذَلِكَ وَأَمَّا الشَّابَّةُ فَلاَ أُحِبُّ ذَلِكَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Wahb ibn Kaysan that Muhammad\nibn Amr ibn Ata said, \"I was sitting with Abdullah ibn Abbas when a\nYemeni man came in. He said, 'Peace be upon you, and the mercy of\nAllah and His blessing' (as-salamu alaykum wa rahmatullahi wa\nbarakatuhu), and then he added something more to that. Ibn Abbas said\n(and at that time his eyesight had gone), 'Who is this?' People said,\n'This is a Yemeni who has come to see you,' and they introduced him.\nIbn Abbas said, 'The greeting ends with the word blessing.' \"\n\n\nYahya said that Malik was asked, \"Does one greet a woman?\" He said,\n\"As for an old woman, I do not disapprove of it. As for a young woman,\nI do not like it.\""}},{"id":3,"idInBook":3,"chapterId":53,"bookId":7,"arabic":"حَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ الْيَهُودَ إِذَا سَلَّمَ عَلَيْكُمْ أَحَدُهُمْ فَإِنَّمَا يَقُولُ السَّامُ عَلَيْكُمْ ‏.‏ فَقُلْ عَلَيْكَ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abdullah ibn Dinar that\nAbdullah ibn Umar said that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"When a jew greets you, and says 'Death\nto you' (as-samu alaykum) say, 'And to you.' \"\n\n\nYahya said,\n\"Malik was asked whether a person who greeted a jew or christian,\nshould apologise for it. He said, 'No'.\""}},{"id":4,"idInBook":4,"chapterId":53,"bookId":7,"arabic":"حَدَّثَنِي عَنْ مَالِكٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَبِي مُرَّةَ، مَوْلَى عَقِيلِ بْنِ أَبِي طَالِبٍ عَنْ أَبِي وَاقِدٍ اللَّيْثِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم بَيْنَمَا هُوَ جَالِسٌ فِي الْمَسْجِدِ وَالنَّاسُ مَعَهُ إِذْ أَقْبَلَ نَفَرٌ ثَلاَثَةٌ فَأَقْبَلَ اثْنَانِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَذَهَبَ وَاحِدٌ فَلَمَّا وَقَفَا عَلَى مَجْلِسِ رَسُولِ اللَّهِ صلى الله عليه وسلم سَلَّمَا فَأَمَّا أَحَدُهُمَا فَرَأَى فُرْجَةً فِي الْحَلْقَةِ فَجَلَسَ فِيهَا وَأَمَّا الآخَرُ فَجَلَسَ خَلْفَهُمْ وَأَمَّا الثَّالِثُ فَأَدْبَرَ ذَاهِبًا فَلَمَّا فَرَغَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَلاَ أُخْبِرُكُمْ عَنِ النَّفَرِ الثَّلاَثَةِ أَمَّا أَحَدُهُمْ فَأَوَى إِلَى اللَّهِ فَآوَاهُ اللَّهُ وَأَمَّا الآخَرُ فَاسْتَحْيَا فَاسْتَحْيَا اللَّهُ مِنْهُ وَأَمَّا الآخَرُ فَأَعْرَضَ فَأَعْرَضَ اللَّهُ عَنْهُ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ishaq ibn Abdullah ibn Abi\nTalha from Abu Murra, the mawla of Aqil ibn Abi Talib from Abu Waqid\nal-Laythi that the Messenger of Allah, may Allah bless him and grant\nhim peace, was sitting in the mosque with some people when three\npeople came in. Two came toward the Messenger of Allah, may Allah\nbless him and grant him peace, and one went away. When the two stopped\nat the assembly of the Messenger of Allah, may Allah bless him and\ngrant him peace, they gave the greeting. One of them saw a gap in the\ncircle and sat in it. The other sat down behind the circle. The third\nturned away and left. When the Messenger of Allah, may Allah bless him\nand grant him peace, finished, he said, \"Shall I tell you about three\npeople? One of them sought shelter with Allah, so Allah gave him\nshelter. The other was shy, so Allah was shy to him. The other turned\naway, so Allah turned away from him.\""}},{"id":5,"idInBook":5,"chapterId":53,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّهُ سَمِعَ عُمَرَ بْنَ الْخَطَّابِ، وَسَلَّمَ، عَلَيْهِ رَجُلٌ فَرَدَّ عَلَيْهِ السَّلاَمَ ثُمَّ سَأَلَ عُمَرُ الرَّجُلَ كَيْفَ أَنْتَ فَقَالَ أَحْمَدُ إِلَيْكَ اللَّهَ ‏.‏ فَقَالَ عُمَرُ ذَلِكَ الَّذِي أَرَدْتُ مِنْكَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ishaq ibn Abdullah ibn Abi\nTalha that Anas ibn Malik heard Umar ibn al-Khattab return the\ngreeting of a man who greeted him. Then Umar asked the man, \"How are\nyou?\" He said, \"I praise Allah to you.\" (Ahmadu ilayka Allah) Umar\nsaid, \"That is what I wanted from you.\""}},{"id":6,"idInBook":6,"chapterId":53,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، أَنَّ الطُّفَيْلَ بْنَ أُبَىِّ بْنِ كَعْبٍ، أَخْبَرَهُ أَنَّهُ، كَانَ يَأْتِي عَبْدَ اللَّهِ بْنَ عُمَرَ فَيَغْدُو مَعَهُ إِلَى السُّوقِ قَالَ فَإِذَا غَدَوْنَا إِلَى السُّوقِ لَمْ يَمُرَّ عَبْدُ اللَّهِ بْنُ عُمَرَ عَلَى سَقَاطٍ وَلاَ صَاحِبِ بَيْعَةٍ وَلاَ مِسْكِينٍ وَلاَ أَحَدٍ إِلاَّ سَلَّمَ عَلَيْهِ - قَالَ الطُّفَيْلُ - فَجِئْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ يَوْمًا فَاسْتَتْبَعَنِي إِلَى السُّوقِ فَقُلْتُ لَهُ وَمَا تَصْنَعُ فِي السُّوقِ وَأَنْتَ لاَ تَقِفُ عَلَى الْبَيِّعِ وَلاَ تَسْأَلُ عَنِ السِّلَعِ وَلاَ تَسُومُ بِهَا وَلاَ تَجْلِسُ فِي مَجَالِسِ السُّوقِ قَالَ وَأَقُولُ اجْلِسْ بِنَا هَا هُنَا نَتَحَدَّثْ ‏.‏ قَالَ فَقَالَ لِي عَبْدُ اللَّهِ بْنُ عُمَرَ يَا أَبَا بَطْنٍ - وَكَانَ الطُّفَيْلُ ذَا بَطْنٍ - إِنَّمَا نَغْدُو مِنْ أَجْلِ السَّلاَمِ نُسَلِّمُ","english":{"narrator":"","text":"Yahya related to me from Malik from Ishaq ibn Abdullah ibn Abi\nTalha that at-Tufayl ibn Ubayy ibn Kab told him that he visited\nAbdullah ibn Umar one morning and went out with him to the market, and\nwhen they were out, Abdullah ibn Umar did not pass by anyone selling\npoor merchandise or selling commodities or a needy person or anyone\nbut that he greeted them.\n\n\nAt-Tufayl said, \"I came to Abdullah\nibn Umar one day and he asked me to follow him to the market. I said\nto him, 'What will you do in the market if you will not stop to sell\nnor seek any goods or barter with them or sit in any of the assemblies\nor market?' Abdullah ibn Umar said that we should sit down and talk,\nand then he explained, 'Abu Batni, (lit. father of the belly, at-\nTufayl had a prominent stomach), we go out in the morning only for the\nsake of the greeting. We greet whomever we meet.' \""}},{"id":7,"idInBook":7,"chapterId":53,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ رَجُلاً، سَلَّمَ عَلَى عَبْدِ اللَّهِ بْنِ عُمَرَ فَقَالَ السَّلاَمُ عَلَيْكَ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ وَالْغَادِيَاتُ وَالرَّائِحَاتُ ‏.‏ فَقَالَ لَهُ عَبْدُ اللَّهِ بْنُ عُمَرَ وَعَلَيْكَ أَلْفًا ‏.‏ ثُمَّ كَأَنَّهُ كَرِهَ ذَلِكَ .‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said that a man\ngreeted Abdullah ibn Umar. He said, \"Peace be upon you and the mercy\nof Allah and his barakat, on and on.\" Abdullah ibn Umar said to him,\n\"And on you, a thousand times,\" as if he disliked that."}},{"id":8,"idInBook":8,"chapterId":53,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ أَنَّهُ بَلَغَهُ إِذَا دُخِلَ الْبَيْتُ غَيْرُ الْمَسْكُونِ يُقَالُ السَّلاَمُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ ‏.‏ ‏","english":{"narrator":"","text":"Yahya related to me from Malik that he heard that when one\nentered an unoccupied house, one should say, \"Peace be upon us and on\nthe slaves of Allah, who are salih.\" (As-salamu alayna wa ala\nibadillahi's-saliheen).O"}}],"chapter":{"id":53,"bookId":7,"arabic":"كتاب السلام","english":"Greetings"}}