{"metadata":{"length":45,"arabic":{"title":"موطأ مالك","author":"الإمام مالك بن أنس","introduction":"كتاب الاستئذان"},"english":{"title":"Muwatta Malik","author":"Imam Malik ibn Anas","introduction":"General Subjects"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":54,"bookId":7,"arabic":"حَدَّثَنِي مَالِكٌ، عَنْ صَفْوَانَ بْنَ سُلَيْمٍ، عَنْ عَطَاءِ بْنِ يَسَارٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم سَأَلَهُ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ أَسْتَأْذِنُ عَلَى أُمِّي فَقَالَ ‏\"‏ نَعَمْ ‏\"‏ ‏.‏ قَالَ الرَّجُلُ إِنِّي مَعَهَا فِي الْبَيْتِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اسْتَأْذِنْ عَلَيْهَا ‏\"‏ ‏.‏ فَقَالَ الرَّجُلُ إِنِّي خَادِمُهَا ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اسْتَأْذِنْ عَلَيْهَا أَتُحِبُّ أَنْ تَرَاهَا عُرْيَانَةً ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ فَاسْتَأْذِنْ عَلَيْهَا ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me from Safwan ibn Sulaym from Ata ibn Yasar\nthat the Messenger of Allah, may Allah bless him and grant him peace,\nwas questioned by a man who said, \"Messenger of Allah, shall I ask\npermission of my mother to enter?\" He said, \"Yes \" The man said, \"I\nlive with her in the house\". The Messenger of Allah, may Allah bless\nhim and grant him peace, said \"Ask her permission.\" The man said, \"I\nam her servant.\" The Messenger of Allah. may Allah bless him and grant\nhim peace, said, \"Ask her permission. Do you want to see her naked?\"\nHe said, \"No.\" He said, \"Then ask her permission.\""}},{"id":2,"idInBook":2,"chapterId":54,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنِ الثِّقَةِ، عِنْدَهُ عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ بْنِ الأَشَجِّ، عَنْ بُسْرِ بْنِ سَعِيدٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنْ أَبِي مُوسَى الأَشْعَرِيِّ، أَنَّهُ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ الاِسْتِئْذَانُ ثَلاَثٌ فَإِنْ أُذِنَ لَكَ فَادْخُلْ وَإِلاَّ فَارْجِعْ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me from a reliable source of his from Bukayr ibn\nAbdullah ibn al-Ashajj from Basr ibn Said from Abu Said al-Khudri that\nAbu Musa al-Ashari said, \"The Messenger of Allah, may Allah bless him\nand grant him peace, said, 'One asks permission three times. If you\nare given permission, then enter. If not, go away.' \""}},{"id":3,"idInBook":3,"chapterId":54,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ غَيْرِ، وَاحِدٍ، مِنْ عُلَمَائِهِمْ أَنَّ أَبَا مُوسَى الأَشْعَرِيَّ، جَاءَ يَسْتَأْذِنُ عَلَى عُمَرَ بْنِ الْخَطَّابِ فَاسْتَأْذَنَ ثَلاَثًا ثُمَّ رَجَعَ فَأَرْسَلَ عُمَرُ بْنُ الْخَطَّابِ فِي أَثَرِهِ فَقَالَ مَا لَكَ لَمْ تَدْخُلْ فَقَالَ أَبُو مُوسَى سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ الاِسْتِئْذَانُ ثَلاَثٌ فَإِنْ أُذِنَ لَكَ فَادْخُلْ وَإِلاَّ فَارْجِعْ ‏\"‏ ‏.‏ فَقَالَ عُمَرُ وَمَنْ يَعْلَمُ هَذَا لَئِنْ لَمْ تَأْتِنِي بِمَنْ يَعْلَمُ ذَلِكَ لأَفْعَلَنَّ بِكَ كَذَا وَكَذَا ‏.‏ فَخَرَجَ أَبُو مُوسَى حَتَّى جَاءَ مَجْلِسًا فِي الْمَسْجِدِ يُقَالُ لَهُ مَجْلِسُ الأَنْصَارِ فَقَالَ إِنِّي أَخْبَرْتُ عُمَرَ بْنَ الْخَطَّابِ أَنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ الاِسْتِئْذَانُ ثَلاَثٌ فَإِنْ أُذِنَ لَكَ فَادْخُلْ وَإِلاَّ فَارْجِعْ ‏\"‏ ‏.‏ فَقَالَ لَئِنْ لَمْ تَأْتِنِي بِمَنْ يَعْلَمُ هَذَا لأَفْعَلَنَّ بِكَ كَذَا وَكَذَا ‏.‏ فَإِنْ كَانَ سَمِعَ ذَلِكَ أَحَدٌ مِنْكُمْ فَلْيَقُمْ مَعِي ‏.‏ فَقَالُوا لأَبِي سَعِيدٍ الْخُدْرِيِّ قُمْ مَعَهُ ‏.‏ وَكَانَ أَبُو سَعِيدٍ أَصْغَرَهُمْ فَقَامَ مَعَهُ فَأَخْبَرَ بِذَلِكَ عُمَرَ بْنَ الْخَطَّابِ ‏.‏ فَقَالَ عُمَرُ بْنُ الْخَطَّابِ لأَبِي مُوسَى أَمَا إِنِّي لَمْ أَتَّهِمْكَ وَلَكِنْ خَشِيتُ أَنْ يَتَقَوَّلَ النَّاسُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏","english":{"narrator":"","text":"Malik related to me from Rabia ibn Abi Abd ar-Rahman from another\nof the ulama of that time that Abu Musa al-Ashari came and asked\npermission from Umar ibn al-Khattab to enter. He asked permission\nthree times, and then went away Umar ibn al-Khattab sent after him and\nsaid, \"What's wrong with you? Why didn't you come in?\" Abu Musa said,\n\"I heard the Messenger of Allah, may Allah bless him and grant him\npeace, say, 'Ask permission to enter three times. If you are given\npermission, then enter. If not, go away.' ''Umar said, \"Who can\nconfirm this? If you do not bring me someone to confirm it, I will do\nsuch-and-such to you.\"\n\n\nAbu Musa went out until he came to an\nassembly in the mosque which was called the Majlis-al-Ansar. He said,\n\"I told Umar ibn al-Khattab that I heard the Messenger of Allah, may\nAllah bless him and grant him peace, say, 'Ask permission three times.\nIf you are given permission, then enter. If not, go away.' Umar said,\n'If you do not bring me someone who can confirm it, I will do such-\nand-such to you'. If any of you have heard that, let him come with\nme.' \" They said to Abu Said al-Khudri, \"Go with him\". Abu Said was\nthe youngest of them. He went with him and told Umar ibn al-Khattab\nabout that.\"\n\n\nUmar ibn al-Khattab said to Abu Musa, \"I did not\nsuspect you, but I feared lest people forge sayings of the Messenger\nof Allah, may Allah bless him and grant him peace.\""}},{"id":4,"idInBook":4,"chapterId":54,"bookId":7,"arabic":"حَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنْ عَطَسَ فَشَمِّتْهُ ثُمَّ إِنْ عَطَسَ فَشَمِّتْهُ ثُمَّ إِنْ عَطَسَ فَشَمِّتْهُ ثُمَّ إِنْ عَطَسَ فَقُلْ إِنَّكَ مَضْنُوكٌ ‏\"‏ ‏.‏ قَالَ عَبْدُ اللَّهِ بْنُ أَبِي بَكْرٍ لاَ أَدْرِي أَبَعْدَ الثَّالِثَةِ أَوِ الرَّابِعَةِ","english":{"narrator":"","text":"Malik related to me from Abdullah ibn Abi Bakr from his father\nthat the Messenger of Allah, may Allah bless him and grant him peace,\nsaid, \"If a man sneezes, invoke a blessing on him. Then if he sneezes,\ninvoke a blessing on him. Then if he sneezes, invoke a blessing on\nhim. Then if he sneezes, say, 'You have a cold'.\" Abdullah ibn Abi\nBakr said, \"I don't know whether it was after the third or fourth.\""}},{"id":5,"idInBook":5,"chapterId":54,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ إِذَا عَطَسَ فَقِيلَ لَهُ يَرْحَمُكَ اللَّهُ ‏.‏ قَالَ يَرْحَمُنَا اللَّهُ وَإِيَّاكُمْ وَيَغْفِرُ لَنَا وَلَكُمْ ‏.‏","english":{"narrator":"","text":"Malik related to me from Nafi that when Abdullah ibn Umar sneezed\nand someone said to him, \"May Allah have mercy on you,\"\n(Yarhamuka'llah), he said, \"May Allah have mercy on us and you, and\nforgive us and you.\" (Yarhamuna'llah wa yaghfirlana wa lakum)."}},{"id":6,"idInBook":6,"chapterId":54,"bookId":7,"arabic":"حَدَّثَنِي مَالِكٌ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، أَنَّ رَافِعَ بْنَ إِسْحَاقَ، مَوْلَى الشِّفَاءِ أَخْبَرَهُ قَالَ دَخَلْتُ أَنَا وَعَبْدُ اللَّهِ بْنُ أَبِي طَلْحَةَ، عَلَى أَبِي سَعِيدٍ الْخُدْرِيِّ نَعُودُهُ فَقَالَ لَنَا أَبُو سَعِيدٍ أَخْبَرَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَنَّ الْمَلاَئِكَةَ لاَ تَدْخُلُ بَيْتًا فِيهِ تَمَاثِيلُ أَوْ تَصَاوِيرُ ‏\"‏ ‏.‏ شَكَّ إِسْحَاقُ لاَ يَدْرِي أَيَّتَهُمَا قَالَ أَبُو سَعِيدٍ ‏.‏","english":{"narrator":"","text":"Malik related to me from Ishaq ibn Abdullah ibn Abi Talha that\nRafi ibn Ishaq, the mawla of ash-Shifa informed him that he and\nAbdullah ibn Abi Talha had gone to visit Abu Said al-Khudri while he\nwas ill. Abu Said said to them, \"The Messenger of Allah, may Allah\nbless him and grant him peace, informed us, 'The angels do not enter a\nhouse which contains pictures or images.' \" Ishaq was not sure which\nof them Abu Said said."}},{"id":7,"idInBook":7,"chapterId":54,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ أَبِي النَّضْرِ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، أَنَّهُ دَخَلَ عَلَى أَبِي طَلْحَةَ الأَنْصَارِيِّ يَعُودُهُ قَالَ فَوَجَدَ عِنْدَهُ سَهْلَ بْنَ حُنَيْفٍ فَدَعَا أَبُو طَلْحَةَ إِنْسَانًا فَنَزَعَ نَمَطًا مِنْ تَحْتِهِ فَقَالَ لَهُ سَهْلُ بْنُ حُنَيْفٍ لِمَ تَنْزِعُهُ قَالَ لأَنَّ فِيهِ تَصَاوِيرَ وَقَدْ قَالَ فِيهَا رَسُولُ اللَّهِ صلى الله عليه وسلم مَا قَدْ عَلِمْتَ ‏.‏ فَقَالَ سَهْلٌ أَلَمْ يَقُلْ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِلاَّ مَا كَانَ رَقْمًا فِي ثَوْبٍ ‏\"‏ ‏.‏ قَالَ بَلَى وَلَكِنَّهُ أَطْيَبُ لِنَفْسِي ‏.‏","english":{"narrator":"","text":"Malik related to me from Abu'n-Nasr that Ubaydullah ibn Abdullah\nibn Utba ibn Masud went to visit Abu Talha al-Ansari when he was ill.\nHe said, \"I found Sahl ibn Hunayf with him. Abu Talha summoned a man\nand removed a rug which was under him. Sahl ibn Hunayf said to him,\n'Why did you remove it?' He said, 'Because there were pictures on it,\nand the Messenger of Allah, may Allah bless him and grant him peace,\nsaid what you know about them.' Sahl replied, 'Didn't the Messenger of\nAllah, may Allah bless him and grant him peace, say, \"except for\nmarkings on a garment?\"' (A rug was considered a garment). He said,\n'Yes, but it is more pleasing to myself.' \""}},{"id":8,"idInBook":8,"chapterId":54,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا اشْتَرَتْ نُمْرُقَةً فِيهَا تَصَاوِيرُ فَلَمَّا رَآهَا رَسُولُ اللَّهِ صلى الله عليه وسلم قَامَ عَلَى الْبَابِ فَلَمْ يَدْخُلْ فَعَرَفَتْ فِي وَجْهِهِ الْكَرَاهِيَةَ وَقَالَتْ يَا رَسُولَ اللَّهِ أَتُوبُ إِلَى اللَّهِ وَإِلَى رَسُولِهِ فَمَاذَا أَذْنَبْتُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَمَا بَالُ هَذِهِ النُّمْرُقَةِ ‏\"‏ ‏.‏ قَالَتِ اشْتَرَيْتُهَا لَكَ تَقْعُدُ عَلَيْهَا وَتَوَسَّدُهَا ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ أَصْحَابَ هَذِهِ الصُّوَرِ يُعَذَّبُونَ يَوْمَ الْقِيَامَةِ يُقَالُ لَهُمْ أَحْيُوا مَا خَلَقْتُمْ ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ إِنَّ الْبَيْتَ الَّذِي فِيهِ الصُّوَرُ لاَ تَدْخُلُهُ الْمَلاَئِكَةُ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me from Nafi from al-Qasim ibn Muhammad from\nA'isha, the wife of the Prophet, may Allah bless him and grant him\npeace, that she bought a cushion which had pictures on it. When the\nMessenger of Allah, may Allah bless him and grant him peace, saw it,\nhe stopped at the door and did not enter. She recognised disapproval\non his face and said, \"Messenger of Allah, I turn in repentance to\nAllah and His Messenger. What have I done wrong?\" The Messenger of\nAllah, may Allah bless him and grant him peace, said, \"What is the\nmeaning of this cushion?\" She said, \"I bought it for you to sit and\nrecline on.\" The Messenger of Allah, may Allah bless him and grant him\npeace, said, \"Those who make such pictures will be punished on the Day\nof Rising. It will be said to them, 'Bring to life what you have\ncreated'. Then he said, 'The angels do not enter a house in which\nthere are pictures.' \""}},{"id":9,"idInBook":9,"chapterId":54,"bookId":7,"arabic":"حَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي صَعْصَعَةَ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، أَنَّهُ قَالَ دَخَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَيْتَ مَيْمُونَةَ بِنْتِ الْحَارِثِ فَإِذَا ضِبَابٌ فِيهَا بَيْضٌ وَمَعَهُ عَبْدُ اللَّهِ بْنُ عَبَّاسٍ وَخَالِدُ بْنُ الْوَلِيدِ فَقَالَ ‏\"‏ مِنْ أَيْنَ لَكُمْ هَذَا ‏\"‏ ‏.‏ فَقَالَتْ أَهْدَتْهُ لِي أُخْتِي هُزَيْلَةُ بِنْتُ الْحَارِثِ ‏.‏ فَقَالَ لِعَبْدِ اللَّهِ بْنِ عَبَّاسٍ وَخَالِدِ بْنِ الْوَلِيدِ ‏\"‏ كُلاَ ‏\"‏ ‏.‏ فَقَالاَ أَوَلاَ تَأْكُلُ أَنْتَ يَا رَسُولَ اللَّهِ فَقَالَ ‏\"‏ إِنِّي تَحْضُرُنِي مِنَ اللَّهِ حَاضِرَةٌ ‏\"‏ ‏.‏ قَالَتْ مَيْمُونَةُ أَنَسْقِيكَ يَا رَسُولَ اللَّهِ مِنْ لَبَنٍ عِنْدَنَا فَقَالَ ‏\"‏ نَعَمْ ‏\"‏ ‏.‏ فَلَمَّا شَرِبَ قَالَ ‏\"‏ مِنْ أَيْنَ لَكُمْ هَذَا ‏\"‏ ‏.‏ فَقَالَتْ أَهْدَتْهُ لِي أُخْتِي هُزَيْلَةُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَرَأَيْتِكِ جَارِيَتَكِ الَّتِي كُنْتِ اسْتَأْمَرْتِينِي فِي عِتْقِهَا أَعْطِيهَا أُخْتَكِ وَصِلِي بِهَا رَحِمَكِ تَرْعَى عَلَيْهَا فَإِنَّهُ خَيْرٌ لَكِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me from Abd ar-Rahman ibn Abdullah ibn Abd ar-\nRahman ibn Abi Sasaca that Sulayman ibn Yasar said, \"The Messenger of\nAllah, may Allah bless him and grant him peace, entered the house of\nMaimuna bint al-Harith and there was a lizard in which there were eggs\nto eat. Abdullah ibn Abbas and Khalid ibn al-Walid were with him. He\nsaid, 'From where did you get this?' She replied, 'My sister, Huzayla\nbint al-Harith, gave it to me.' He then told Abdullah ibn Abbas and\nKhalid to eat. They said, 'Won't you eat, Messenger of Allah?' He\nsaid, 'There are those who visit me from Allah.' Maimuna said,\n'Messenger of Allah, shall we give you some milk to drink which we\nhave?' He said, 'Yes.' When he drank, he said, 'From where did you get\nthis?' She said, 'My sister, Huzayla gave it to me.' The Messenger of\nAllah, may Allah bless him and grant him peace, said, 'Do you see your\nslave-girl whom you asked me for permission to free? Give her to your\nsister and bring her to your maternal relatives to take care of her.\nThat is better for you.' \""}},{"id":10,"idInBook":10,"chapterId":54,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، عَنْ خَالِدِ بْنِ الْوَلِيدِ بْنِ الْمُغِيرَةِ، أَنَّهُ دَخَلَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم بَيْتَ مَيْمُونَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم فَأُتِيَ بِضَبٍّ مَحْنُوذٍ فَأَهْوَى إِلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم بِيَدِهِ ‏.‏ فَقَالَ بَعْضُ النِّسْوَةِ اللاَّتِي فِي بَيْتِ مَيْمُونَةَ أَخْبِرُوا رَسُولَ اللَّهِ صلى الله عليه وسلم بِمَا يُرِيدُ أَنْ يَأْكُلَ مِنْهُ ‏.‏ فَقِيلَ هُوَ ضَبٌّ يَا رَسُولَ اللَّهِ ‏.‏ فَرَفَعَ يَدَهُ فَقُلْتُ أَحَرَامٌ هُوَ يَا رَسُولَ اللَّهِ فَقَالَ ‏\n\"‏ لاَ وَلَكِنَّهُ لَمْ يَكُنْ بِأَرْضِ قَوْمِي فَأَجِدُنِي أَعَافُهُ ‏\"‏ ‏.‏ قَالَ خَالِدٌ فَاجْتَرَرْتُهُ فَأَكَلْتُهُ وَرَسُولُ اللَّهِ صلى الله عليه وسلم يَنْظُرُ ‏.‏","english":{"narrator":"","text":"Malik related to me from Ibn Shihab from Abu Umama ibn Sahl ibn\nHunayf from Abdullah ibn Abbas that Khalid ibn al-Walid ibn al-Mughira\nentered the house of Maimuna, the wife of the Prophet, may Allah bless\nhim and grant him peace, with the Messenger of Allah, may Allah bless\nhim and grant him peace, and he was brought a roasted lizard. The\nMessenger of Allah, may Allah bless him and grant him peace, stretched\nhis hand toward it. One of the women who was in Maimuna's house said,\n\"Tell the Messenger of Allah, may Allah bless him and grant him peace,\nwhat he means to eat.\" Someone said, \"It is a lizard, Messenger of\nAllah.\" He withdrew his hand. Khalid said, \"Is it haram, Messenger of\nAllah?\" He said, \"No, but there were none in my people's land, and I\nfind that I dislike them.\"\n\n\nKhalid added, \"I chewed and ate it\nwhile the Messenger of Allah, may Allah bless him and grant him peace,\nwas looking.\""}},{"id":11,"idInBook":11,"chapterId":54,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَجُلاً، نَادَى رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ مَا تَرَى فِي الضَّبِّ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لَسْتُ بِآكِلِهِ وَلاَ بِمُحَرِّمِهِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me from Abdullah ibn Dinar from Abdullah ibn\nUmar that a man called the Messenger of Allah and said, \"Messenger of\nAllah, what do you think about lizards?\" The Messenger of Allah, may\nAllah bless him and grant him peace, said, \"I do not eat them, and I\ndo not forbid them.\""}},{"id":12,"idInBook":12,"chapterId":54,"bookId":7,"arabic":"حَدَّثَنِي مَالِكٌ، عَنْ يَزِيدَ بْنِ خُصَيْفَةَ، أَنَّ السَّائِبَ بْنَ يَزِيدَ، أَخْبَرَهُ أَنَّهُ، سَمِعَ سُفْيَانَ بْنَ أَبِي زُهَيْرٍ، وَهُوَ رَجُلٌ مِنْ أَزْدِ شَنُوءَةَ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَهُوَ يُحَدِّثُ نَاسًا مَعَهُ عِنْدَ بَابِ الْمَسْجِدِ فَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ مَنِ اقْتَنَى كَلْبًا لاَ يُغْنِي عَنْهُ زَرْعًا وَلاَ ضَرْعًا نَقَصَ مِنْ عَمَلِهِ كُلَّ يَوْمٍ قِيرَاطٌ ‏\"‏ ‏.‏ قَالَ آنْتَ سَمِعْتَ هَذَا مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ إِي وَرَبِّ هَذَا الْمَسْجِدِ ‏.‏","english":{"narrator":"","text":"Malik related to me from Yazid ibn Khusayfa that as-Sa'ib ibn\nYazid informed him that he heard Sufyan ibn Abi Zuhayr who was from\nthe Azd Shanua tribe and among the companions of the Messenger of\nAllah, may Allah bless him and grant him peace, speaking with some\npeople who were with him at the door of the mosque. He said, \"I heard\nthe Messenger of Allah, may Allah bless him and grant him peace, say,\n'If anyone acquires a dog which he does not use as a sheepdog or for\nhunting, a qirat will be deducted from the reward of his good deeds\neach day.' \" He was asked, \"Did you hear this from the Messenger of\nAllah, may Allah bless him and grant him peace?\" He said, \"Yes, by the\nLord of this mosque.\""}},{"id":13,"idInBook":13,"chapterId":54,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنِ اقْتَنَى كَلْبًا إِلاَّ كَلْبًا ضَارِيًا أَوْ كَلْبَ مَاشِيَةٍ نَقَصَ مِنْ عَمَلِهِ كُلَّ يَوْمٍ قِيرَاطَانِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me from Nafi from Abdullah ibn Umar that the\nMessenger of Allah, may Allah bless him and grant him peace, said,\n\"Whoever acquires a dog other than a sheepdog or hunting dog, will\nhave two qirats deducted from the reward of his good actions every\nday.\""}},{"id":14,"idInBook":14,"chapterId":54,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَمَرَ بِقَتْلِ الْكِلاَبِ ‏.‏","english":{"narrator":"","text":"Malik related to me from Nafi from Abdullah ibn Umar\nthat the Messenger of Allah, may Allah bless him and grant him peace,\nordered dogs to be killed."}},{"id":15,"idInBook":15,"chapterId":54,"bookId":7,"arabic":"حَدَّثَنِي مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ رَأْسُ الْكُفْرِ نَحْوَ الْمَشْرِقِ وَالْفَخْرُ وَالْخُيَلاَءُ فِي أَهْلِ الْخَيْلِ وَالإِبِلِ وَالْفَدَّادِينَ أَهْلِ الْوَبَرِ وَالسَّكِينَةُ فِي أَهْلِ الْغَنَمِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me from Abu'z-Zinad from al-Araj from Abu\nHurayra that the Messenger of Allah, may Allah bless him and grant him\npeace, said, \"The head of kufr is towards the east. Boasting and price\nis among people who have horses and camels. The loud-voiced people are\nthe people of tents (the Bedouins). Tranquillity is with the people\nwho have sheep.\""}},{"id":16,"idInBook":16,"chapterId":54,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي صَعْصَعَةَ، عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّهُ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ يُوشِكُ أَنْ يَكُونَ خَيْرُ مَالِ الْمُسْلِمِ غَنَمًا يَتْبَعُ بِهَا شَعَفَ الْجِبَالِ وَمَوَاقِعَ الْقَطْرِ يَفِرُّ بِدِينِهِ مِنَ الْفِتَنِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me from Abd ar-Rahman ibn Abd ar-Rahman ibn\nSasaca from his father that Abu Said al-Khudri said that the Messenger\nof Allah, may Allah bless him and grant him peace, said, \"It will soon\nhappen that the best property of a muslim will be sheep which he takes\nto the peaks of the mountains and the valleys, fleeing with his deen\nfrom trials.\""}},{"id":17,"idInBook":17,"chapterId":54,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَحْتَلِبَنَّ أَحَدٌ مَاشِيَةَ أَحَدٍ بِغَيْرِ إِذْنِهِ أَيُحِبُّ أَحَدُكُمْ أَنْ تُؤْتَى مَشْرُبَتُهُ فَتُكْسَرَ خِزَانَتُهُ فَيُنْتَقَلَ طَعَامُهُ وَإِنَّمَا تَخْزُنُ لَهُمْ ضُرُوعُ مَوَاشِيهِمْ أَطْعِمَاتِهِمْ فَلاَ يَحْتَلِبَنَّ أَحَدٌ مَاشِيَةَ أَحَدٍ إِلاَّ بِإِذْنِهِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me from Nafi from Ibn Umar that the Messenger of\nAllah, may Allah bless him and grant him peace, said, \"No one should\nmilk someone else's cow without his permission. Would any of you like\nsomeone to come to his apartment, break into his larder, and take his\nfood? The udders of cows guard their food for their owners, so no one\nshould milk someone else's cow without his permission.\""}},{"id":18,"idInBook":18,"chapterId":54,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَا مِنْ نَبِيِّ إِلاَّ قَدْ رَعَى غَنَمًا ‏\"‏ ‏.‏ قِيلَ وَأَنْتَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ وَأَنَا ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me that he had heard that the Messenger of\nAllah, may Allah bless him and grant him peace, said, \"There is no\nProphet who has not herded sheep,\" and someone asked, \"You as well,\nMessenger of Allah?\" He said, \"Myself as well.\""}},{"id":19,"idInBook":19,"chapterId":54,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، أَنَّ ابْنَ عُمَرَ، كَانَ يُقَرَّبُ إِلَيْهِ عَشَاؤُهُ فَيَسْمَعُ قِرَاءَةَ الإِمَامِ وَهُوَ فِي بَيْتِهِ فَلاَ يَعْجَلُ عَنْ طَعَامِهِ حَتَّى يَقْضِيَ حَاجَتَهُ مِنْهُ ‏.‏","english":{"narrator":"","text":"Malik related to me from Nafi that one time as Ibn Umar was\nserved his evening meal, he heard the recitation of the Imam while he\nwas in his house and he did not hurry from his food until he had\nfinished what he needed."}},{"id":20,"idInBook":20,"chapterId":54,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، عَنْ مَيْمُونَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم سُئِلَ عَنِ الْفَأْرَةِ تَقَعُ فِي السَّمْنِ فَقَالَ ‏\n\"‏ انْزِعُوهَا وَمَا حَوْلَهَا فَاطْرَحُوهُ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me from Ibn Shihab from Ubaydullah ibn Abdullah\nibn Utba ibn Masud from Abdullah ibn Abbas from Maimuna, the wife of\nthe Prophet, may Allah bless him and grant him peace, that the\nMessenger of Allah, may Allah bless him and grant him peace, was asked\nabout a mouse falling into clarified butter. He said, \"Remove it and\nthrow away what is around it \""}},{"id":21,"idInBook":21,"chapterId":54,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ أَبِي حَازِمِ بْنِ دِينَارٍ، عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنْ كَانَ فَفِي الْفَرَسِ وَالْمَرْأَةِ وَالْمَسْكَنِ ‏\"‏ ‏.‏ يَعْنِي الشُّؤْمَ ‏.‏","english":{"narrator":"","text":"Malik related to me from Abu Hazim ibn Dinar from Sahl ibn Sad\nas-Saidi that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"If it exists, it is in a horse, a woman, and a\nhouse,\" meaning ill luck."}},{"id":22,"idInBook":22,"chapterId":54,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ حَمْزَةَ، وَسَالِمٍ، ابْنَىْ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ الشُّؤْمُ فِي الدَّارِ وَالْمَرْأَةِ وَالْفَرَسِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me from Malik from Ibn Shihab from Hamza and\nSalim the sons of Abdullah ibn Umar from Abdullah ibn Umar that the\nMessenger of Allah, may Allah bless him and grant him peace, said,\n\"Ill luck is in a house, a woman and a horse.\""}},{"id":23,"idInBook":23,"chapterId":54,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ قَالَ جَاءَتِ امْرَأَةٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ دَارٌ سَكَنَّاهَا وَالْعَدَدُ كَثِيرٌ وَالْمَالُ وَافِرٌ فَقَلَّ الْعَدَدُ وَذَهَبَ الْمَالُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ دَعُوهَا ذَمِيمَةً ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me that Yahya ibn Said said, \"A woman came to\nthe Messenger of Allah, may Allah bless him and grant him peace, and\nsaid, 'Messenger of Allah, we moved into a house when our number was\ngreat and our wealth was abundant. Now our number has dwindled and the\nwealth has gone.' The Messenger of Allah, may Allah bless him and\ngrant him peace, said, 'Leave it as blameworthy.' \""}},{"id":24,"idInBook":24,"chapterId":54,"bookId":7,"arabic":"حَدَّثَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ رَسُولَ اللَّهِ قَالَ لِلَقْحَةٍ تُحْلَبُ ‏\"‏ مَنْ يَحْلُبُ هَذِهِ ‏\"‏ ‏.‏ فَقَامَ رَجُلٌ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا اسْمُكَ ‏\"‏ ‏.‏ فَقَالَ لَهُ الرَّجُلُ مُرَّةُ ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اجْلِسْ ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ مَنْ يَحْلُبُ هَذِهِ ‏\"‏ ‏.‏ فَقَامَ رَجُلٌ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا اسْمُكَ ‏\"‏ ‏.‏ فَقَالَ حَرْبٌ ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اجْلِسْ ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ مَنْ يَحْلُبُ هَذِهِ ‏\"‏ ‏.‏ فَقَامَ رَجُلٌ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا اسْمُكَ ‏\"‏ ‏.‏ فَقَالَ يَعِيشُ ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ احْلُبْ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me from Yahya ibn Said that the Messenger of\nAllah, may Allah bless him and grant him peace, asked about a milk\ncamel about to be milked, \"Who milks this camel?\" A man stood up. The\nMessenger of Allah, may Allah bless him and grant him peace, said,\n\"What is your name?\" The man said, \"Murra (bitterness).\" The Messenger\nof Allah, may Allah bless him and grant him peace, said to him, \"Sit\ndown.\" Then he said, \"Who milks this one?\" A man stood up and the\nMessenger of Allah, may Allah bless him and grant him peace, said,\n\"What is your name?\" He said, \"Harb (war).\" The Messenger of Allah,\nmay Allah bless him and grant him peace, said, \"Sit down.\" Then he\nsaid, \"Who milks this camel?\" A man stood up, and the Messenger of\nAllah, may Allah bless him and grant him peace, said to him, \"What is\nyour name?\" The man said, ''Yaish (he lives).\" The Messenger of Allah,\nmay Allah bless him and grant him peace, said to him, \"Milk!\""}},{"id":25,"idInBook":25,"chapterId":54,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ لِرَجُلٍ مَا اسْمُكَ فَقَالَ جَمْرَةُ ‏.‏ فَقَالَ ابْنُ مَنْ فَقَالَ ابْنُ شِهَابٍ ‏.‏ قَالَ مِمَّنْ قَالَ مِنَ الْحُرَقَةِ ‏.‏ قَالَ أَيْنَ مَسْكَنُكَ قَالَ بِحَرَّةِ النَّارِ ‏.‏ قَالَ بِأَيِّهَا قَالَ بِذَاتِ لَظًى ‏.‏ قَالَ عُمَرُ أَدْرِكْ أَهْلَكَ فَقَدِ احْتَرَقُوا ‏.‏ قَالَ فَكَانَ كَمَا قَالَ عُمَرُ بْنُ الْخَطَّابِ رضى الله عنه ‏.‏","english":{"narrator":"","text":"Yahya related to me from Yahya ibn Said that Umar ibn al-Khattab\nasked a man what his name was. He said, \"Jamra (live coal).\" \"The son\nof who?\" He said, \"Ibn Shihab (meteor, flame).\" \"From whom?\" He said,\n\"From al-Huraqa (burning).\" \"Where do you live?\" He said, \"At Harrat\nan-Nar (lava field of the fire). \"At which one of them?\" He said, \"At\nDhati Ladha (one with flames).\" Umar said, \"Go and look at your family\n- they have been burned.\"\n\n\nYahya added, \"It was as Umar ibn\nal-Khattab, may Allah be pleased with him, said.\""}},{"id":26,"idInBook":26,"chapterId":54,"bookId":7,"arabic":"حَدَّثَنِي مَالِكٌ، عَنْ حُمَيْدٍ الطَّوِيلِ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّهُ قَالَ احْتَجَمَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَجَمَهُ أَبُو طَيْبَةَ فَأَمَرَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم بِصَاعٍ مِنْ تَمْرٍ وَأَمَرَ أَهْلَهُ أَنْ يُخَفِّفُوا عَنْهُ مِنْ خَرَاجِهِ ‏.‏","english":{"narrator":"","text":"Malik related to me from Humayd at-Tawil that Anas ibn Malik\nsaid, \"The Messenger of Allah, may Allah bless him and grant him\npeace, was cupped. Abu Tayba cupped him, and the Messenger of Allah,\nmay Allah bless him and grant him peace, ordered him to be given a sa\nof dates and ordered his family to lessen what he paid them for his\nkitaba or kharaj.\""}},{"id":27,"idInBook":27,"chapterId":54,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنْ كَانَ دَوَاءٌ يَبْلُغُ الدَّاءَ فَإِنَّ الْحِجَامَةَ تَبْلُغُهُ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me that he heard that the Messenger of Allah,\nmay Allah bless him and grant him peace, said, \"If there is a remedy\nthat will reach the disease, then cupping will reach it.\""}},{"id":28,"idInBook":28,"chapterId":54,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنِ ابْنِ مُحَيِّصَةَ الأَنْصَارِيِّ، أَحَدِ بَنِي حَارِثَةَ أَنَّهُ اسْتَأْذَنَ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي إِجَارَةِ الْحَجَّامِ فَنَهَاهُ عَنْهَا فَلَمْ يَزَلْ يَسْأَلُهُ وَيَسْتَأْذِنُهُ حَتَّى قَالَ ‏\n\"‏ اعْلِفْهُ نُضَّاحَكَ ‏\"‏ ‏.‏ يَعْنِي رَقِيقَكَ ‏.‏","english":{"narrator":"","text":"Malik related to me from Ibn Shihab from Ibn Muhayyisa al-Ansari,\none of the Banu Haritha, that he asked permission from the Messenger\nof Allah, may Allah bless him and grant him peace, to give payment for\ncupping, and he forbade him to do it. He continued to ask and seek his\npermission until he said, \"Feed the ones who drive your water-carrying\ncamels,\" meaning \"your slaves.\""}},{"id":29,"idInBook":29,"chapterId":54,"bookId":7,"arabic":"حَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يُشِيرُ إِلَى الْمَشْرِقِ وَيَقُولُ ‏\n\"‏ هَا إِنَّ الْفِتْنَةَ هَا هُنَا إِنَّ الْفِتْنَةَ هَا هُنَا مِنْ حَيْثُ يَطْلُعُ قَرْنُ الشَّيْطَانِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me from Abdullah ibn Dinar that Abdullah ibn\nUmar said, \"I saw the Messenger of Allah, may Allah bless him and\ngrant him peace, pointing at the east and saying, 'The cause of\ndissension is here. The cause of dissension is here, from where the\nhelpers of shaytan arise.' \""}},{"id":30,"idInBook":30,"chapterId":54,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ عُمَرَ بْنَ الْخَطَّابِ، أَرَادَ الْخُرُوجَ إِلَى الْعِرَاقِ فَقَالَ لَهُ كَعْبُ الأَحْبَارِ لاَ تَخْرُجْ إِلَيْهَا يَا أَمِيرَ الْمُؤْمِنِينَ فَإِنَّ بِهَا تِسْعَةَ أَعْشَارِ السِّحْرِ وَبِهَا فَسَقَةُ الْجِنِّ وَبِهَا الدَّاءُ الْعُضَالُ ‏.‏","english":{"narrator":"","text":"Malik related to me that he heard that Umar ibn al-Khattab wanted\nto go to Iraq, and Kabal-Ahbar said to him, \"Do not go there, amir al-\nmuminin. There is nine-tenths of sorcery there and it is the place of\nthe rebellious jinn and the disease which the doctors are unable to\ncure.\""}},{"id":31,"idInBook":31,"chapterId":54,"bookId":7,"arabic":"حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنْ أَبِي لُبَابَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ قَتْلِ الْحَيَّاتِ الَّتِي فِي الْبُيُوتِ ‏.‏","english":{"narrator":"","text":"Malik related to me from Nafi from Abu Lubaba that the Messenger\nof Allah, may Allah bless him and grant him peace, forbade killing\nsnakes which were in the houses."}},{"id":32,"idInBook":32,"chapterId":54,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنْ سَائِبَةَ، مَوْلاَةٍ لِعَائِشَةَ ‏.‏ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ قَتْلِ الْجِنَّانِ الَّتِي فِي الْبُيُوتِ إِلاَّ ذَا الطُّفْيَتَيْنِ وَالأَبْتَرَ فَإِنَّهُمَا يَخْطِفَانِ الْبَصَرَ وَيَطْرَحَانِ مَا فِي بُطُونِ النِّسَاءِ ‏.‏","english":{"narrator":"","text":"Malik related to me from Nafi from Sa'iba, the female mawla of\nA'isha, that the Messenger of Allah, may Allah bless him and grant him\npeace, forbade killing the snakes which were in the houses except\nthose with two white stripes on their back and the short ones. They\nmade one go blind and caused miscarriages in women."}},{"id":33,"idInBook":33,"chapterId":54,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ صَيْفِيٍّ، مَوْلَى ابْنِ أَفْلَحَ عَنْ أَبِي السَّائِبِ، مَوْلَى هِشَامِ بْنِ زُهْرَةَ أَنَّهُ قَالَ دَخَلْتُ عَلَى أَبِي سَعِيدٍ الْخُدْرِيِّ فَوَجَدْتُهُ يُصَلِّي فَجَلَسْتُ أَنْتَظِرُهُ حَتَّى قَضَى صَلاَتَهُ فَسَمِعْتُ تَحْرِيكًا تَحْتَ سَرِيرٍ فِي بَيْتِهِ فَإِذَا حَيَّةٌ فَقُمْتُ لأَقْتُلَهَا فَأَشَارَ أَبُو سَعِيدٍ أَنِ اجْلِسْ فَلَمَّا انْصَرَفَ أَشَارَ إِلَى بَيْتٍ فِي الدَّارِ فَقَالَ أَتَرَى هَذَا الْبَيْتَ فَقُلْتُ نَعَمْ ‏.‏ قَالَ إِنَّهُ قَدْ كَانَ فِيهِ فَتًى حَدِيثُ عَهْدٍ بِعُرْسٍ فَخَرَجَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِلَى الْخَنْدَقِ فَبَيْنَا هُوَ بِهِ إِذْ أَتَاهُ الْفَتَى يَسْتَأْذِنُهُ فَقَالَ يَا رَسُولَ اللَّهِ ائْذَنْ لِي أُحْدِثُ بِأَهْلِي عَهْدًا فَأَذِنَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَالَ ‏\"‏ خُذْ عَلَيْكَ سِلاَحَكَ فَإِنِّي أَخْشَى عَلَيْكَ بَنِي قُرَيْظَةَ ‏\"‏ فَانْطَلَقَ الْفَتَى إِلَى أَهْلِهِ فَوَجَدَ امْرَأَتَهُ قَائِمَةً بَيْنَ الْبَابَيْنِ فَأَهْوَى إِلَيْهَا بِالرُّمْحِ لِيَطْعُنَهَا وَأَدْرَكَتْهُ غَيْرَةٌ فَقَالَتْ لاَ تَعْجَلْ حَتَّى تَدْخُلَ وَتَنْظُرَ مَا فِي بَيْتِكَ ‏.‏ فَدَخَلَ فَإِذَا هُوَ بِحَيَّةٍ مُنْطَوِيَةٍ عَلَى فِرَاشِهِ فَرَكَزَ فِيهَا رُمْحَهُ ثُمَّ خَرَجَ بِهَا فَنَصَبَهُ فِي الدَّارِ فَاضْطَرَبَتِ الْحَيَّةُ فِي رَأْسِ الرُّمْحِ وَخَرَّ الْفَتَى مَيِّتًا فَمَا يُدْرَى أَيُّهُمَا كَانَ أَسْرَعَ مَوْتًا الْفَتَى أَمِ الْحَيَّةُ فَذُكِرَ ذَلِكَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ إِنَّ بِالْمَدِينَةِ جِنًّا قَدْ أَسْلَمُوا فَإِذَا رَأَيْتُمْ مِنْهُمْ شَيْئًا فَآذِنُوهُ ثَلاَثَةَ أَيَّامٍ فَإِنْ بَدَا لَكُمْ بَعْدَ ذَلِكَ فَاقْتُلُوهُ فَإِنَّمَا هُوَ شَيْطَانٌ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me from Safiyy, the mawla of Ibn Aflah that\nAbu's-Saib, the mawla of Hisham ibn Zuhra said, \"I went to Abu Said\nal-Khudri and found him praying. I sat to wait for him until he\nfinished the prayer. I heard a movement under a bed in his room, and\nit was a snake. I stood up to kill it, and Abu Said gestured to me to\nsit. When he was finished he pointed to a room in the house and said,\n'Do you see this room?' I said, 'Yes.' He said, 'There was a young boy\nin it who had just got married. He went out with the Messenger of\nAllah, may Allah bless him and grant him peace, to al-Khandaq, (the\nditch which the muslims dug in the 5th year of the Hijra to defend\nMadina against the Quraysh and their allies).\n\n\nWhen he was\nthere, the youth came and asked his permission, saying, \"Messenger of\nAllah. Give me permission to return to my family.\" The Messenger of\nAllah, may Allah bless him and grant him peace, gave him permission\nand said, \"Take your weapons with you, for I fear the Banu Quraydha\ntribe. They may harm you.\" The youth went to his family and found his\nwife standing between the two doors. He lifted his spear to stab her\nas jealousy had been aroused in him. She said, \"Don't be hasty until\nyou go in and see what is in your house.\" He entered and found a snake\ncoiled up on his bed. He transfixed it with his spear and then went\nout with it and pitched it into the house. The snake stirred on the\nend of the spear and the youth fell dead. No one knew which of them\ndied first, the snake or the youth. That was mentioned to the\nMessenger of Allah, may Allah bless him and grant him peace, and he\nsaid, \"There are jinn in Madina who have become muslim. When you see\none of them, call out to it for three days. If it appears after that,\nthen kill it, for it is a shaytan.\" \"'"}},{"id":34,"idInBook":34,"chapterId":54,"bookId":7,"arabic":"حَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا وَضَعَ رِجْلَهُ فِي الْغَرْزِ وَهُوَ يُرِيدُ السَّفَرَ يَقُولُ ‏\n\"‏ بِاسْمِ اللَّهِ ‏.‏ اللَّهُمَّ أَنْتَ الصَّاحِبُ فِي السَّفَرِ وَالْخَلِيفَةُ فِي الأَهْلِ اللَّهُمَّ ازْوِ لَنَا الأَرْضَ وَهَوِّنْ عَلَيْنَا السَّفَرَ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ وَعْثَاءِ السَّفَرِ وَمِنْ كَآبَةِ الْمُنْقَلَبِ وَمِنْ سُوءِ الْمَنْظَرِ فِي الْمَالِ وَالأَهْلِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me that he heard that when the Messenger of\nAllah, may Allah bless him and grant him peace, set foot in the\nstirrup intending to travel, he would say, \"In the name of Allah. O\nAllah! You are my companion in the journey and the Khalifa of my\nfamily. O Allah! Spread out the earth for us and make the journey easy\nfor us. O Allah! I seek refuge with You from the hardship of the\njourney and from returning to sorrow and a distressing sight regarding\nproperty and family.\""}},{"id":35,"idInBook":35,"chapterId":54,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنِ الثِّقَةِ، عِنْدَهُ عَنْ يَعْقُوبَ بْنِ عَبْدِ اللَّهِ بْنِ الأَشَجِّ، عَنْ بُسْرِ بْنِ سَعِيدٍ، عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ، عَنْ خَوْلَةَ بِنْتِ حَكِيمٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ نَزَلَ مَنْزِلاً فَلْيَقُلْ أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ ‏.‏ فَإِنَّهُ لَنْ يَضُرَّهُ شَىْءٌ حَتَّى يَرْتَحِلَ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me from a reliable\nsource of his from Yaqub ibn Abdullah al-Ashajj from Bushr ibn Said\nfrom Sad ibn Abi Waqqas from Khawla bint Hakim that the Messenger of\nAllah, may Allah bless him and grant him peace, said, \"Whoever\ndismounts to rest in a place should say, 'I seek refuge with the\ncomplete words of Allah from the evil of what he created,' (audhu bi\nkalimati-llahi at-tammati min sharri ma khalaqa), and nothing will\nharm him until he remounts.\""}},{"id":36,"idInBook":36,"chapterId":54,"bookId":7,"arabic":"حَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ حَرْمَلَةَ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ الرَّاكِبُ شَيْطَانٌ وَالرَّاكِبَانِ شَيْطَانَانِ وَالثَّلاَثَةُ رَكْبٌ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me from Abd ar-Rahman ibn Harmala from Amr ibn\nShuayb from his father from his father that the Messenger of Allah,\nmay Allah bless him and grant him peace, said, \"One rider is a\nshaytan. Two riders are two shaytans, and three are a riding-party.\""}},{"id":37,"idInBook":37,"chapterId":54,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ حَرْمَلَةَ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ كَانَ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ الشَّيْطَانُ يَهُمُّ بِالْوَاحِدِ وَالاِثْنَيْنِ فَإِذَا كَانُوا ثَلاَثَةً لَمْ يَهُمَّ بِهِمْ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me from Abd ar-Rahman ibn Harmala that Said ibn\nal-Musayyab heard the Messenger of Allah, may Allah bless him and\ngrant him peace, say, \"Shaytan concerns himself with one and two. When\nthere are three, he does not concern himself with them.\""}},{"id":38,"idInBook":38,"chapterId":54,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَحِلُّ لاِمْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخَرِ تُسَافِرُ مَسِيرَةَ يَوْمٍ وَلَيْلَةٍ إِلاَّ مَعَ ذِي مَحْرَمٍ مِنْهَا ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me from Said ibn Abi Said al-Maqburi from Abu\nHurayra that the Messenger of Allah, may Allah bless him and grant him\npeace, said, \"It is not halal for a woman who believes in Allah and\nthe Last Day to travel the distance of a day and night without a man\nwho is her mahram.\""}},{"id":39,"idInBook":39,"chapterId":54,"bookId":7,"arabic":"حَدَّثَنِي مَالِكٌ، عَنْ أَبِي عُبَيْدٍ، مَوْلَى سُلَيْمَانَ بْنِ عَبْدِ الْمَلِكِ عَنْ خَالِدِ بْنِ مَعْدَانَ، يَرْفَعُهُ ‏\n\"‏ إِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى رَفِيقٌ يُحِبُّ الرِّفْقَ وَيَرْضَى بِهِ وَيُعِينُ عَلَيْهِ مَا لاَ يُعِينُ عَلَى الْعُنْفِ فَإِذَا رَكِبْتُمْ هَذِهِ الدَّوَابَّ الْعُجْمَ فَأَنْزِلُوهَا مَنَازِلَهَا فَإِنْ كَانَتِ الأَرْضُ جَدْبَةً فَانْجُوا عَلَيْهَا بِنِقْيِهَا وَعَلَيْكُمْ بِسَيْرِ اللَّيْلِ فَإِنَّ الأَرْضَ تُطْوَى بِاللَّيْلِ مَا لاَ تُطْوَى بِالنَّهَارِ وَإِيَّاكُمْ وَالتَّعْرِيسَ عَلَى الطَّرِيقِ فَإِنَّهَا طُرُقُ الدَّوَابِّ وَمَأْوَى الْحَيَّاتِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me from Abu Ubayd, the mawla of Sulayman ibn Abd\nal-Malik from Khalid ibn Madan who attributed it to the Prophet, may\nAllah bless him and grant him peace, \"Allah, the Blessed and Exalted\nis kind and loves kindness. He is pleased with it and helps you with\nit as long as it is not misplaced. When you ride dumb beasts, stop\nthem in their stopping places, and quicken their pace when the land is\nbarren. Travel by night, because the land is travelled faster at night\nthan it is during the day. Beware of pitching tents on the road, for\nit is the path of animals and the abode of snakes.\""}},{"id":40,"idInBook":40,"chapterId":54,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ سُمَىٍّ، مَوْلَى أَبِي بَكْرٍ عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ السَّفَرُ قِطْعَةٌ مِنَ الْعَذَابِ يَمْنَعُ أَحَدَكُمْ نَوْمَهُ وَطَعَامَهُ وَشَرَابَهُ فَإِذَا قَضَى أَحَدُكُمْ نَهْمَتَهُ مِنْ وَجْهِهِ فَلْيُعَجِّلْ إِلَى أَهْلِهِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me from Sumayy, the mawla of Abu Bakr from Abu\nSalih from Abu Hurayra that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"Travelling is a portion of the\ntorment. It denies you your sleep, food, and drink. When you have\naccomplished your purpose, you should hurry back to your family.\""}},{"id":41,"idInBook":41,"chapterId":54,"bookId":7,"arabic":"حَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ أَبَا هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لِلْمَمْلُوكِ طَعَامُهُ وَكِسْوَتُهُ بِالْمَعْرُوفِ وَلاَ يُكَلَّفُ مِنَ الْعَمَلِ إِلاَّ مَا يُطِيقُ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me that he heard that Abu Hurayra said that the\nMessenger of Allah, may Allah bless him and grant him peace, said, \"A\nslave has his food and clothing in the normal manner, and he is only\nobliged to do such work as he is capable of doing.\""}},{"id":42,"idInBook":42,"chapterId":54,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ عُمَرَ بْنَ الْخَطَّابِ، كَانَ يَذْهَبُ إِلَى الْعَوَالِي كُلَّ يَوْمِ سَبْتٍ فَإِذَا وَجَدَ عَبْدًا فِي عَمَلٍ لاَ يُطِيقُهُ وَضَعَ عَنْهُ مِنْهُ ‏.‏","english":{"narrator":"","text":"Malik related to me that he heard that Umar ibn al-Khattab went\nto the villages every Saturday. If he found a slave doing work which\nhe was not capable of doing, he lightened it for him."}},{"id":43,"idInBook":43,"chapterId":54,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ عَمِّهِ أَبِي سُهَيْلِ بْنِ مَالِكٍ، عَنْ أَبِيهِ، أَنَّهُ سَمِعَ عُثْمَانَ بْنَ عَفَّانَ، وَهُوَ يَخْطُبُ وَهُوَ يَقُولُ لاَ تُكَلِّفُوا الأَمَةَ غَيْرَ ذَاتِ الصَّنْعَةِ الْكَسْبَ فَإِنَّكُمْ مَتَى كَلَّفْتُمُوهَا ذَلِكَ كَسَبَتْ بِفَرْجِهَا وَلاَ تُكَلِّفُوا الصَّغِيرَ الْكَسْبَ فَإِنَّهُ إِذَا لَمْ يَجِدْ سَرَقَ وَعِفُّوا إِذْ أَعَفَّكُمُ اللَّهُ وَعَلَيْكُمْ مِنَ الْمَطَاعِمِ بِمَا طَابَ مِنْهَا ‏.‏","english":{"narrator":"","text":"Malik related to me from his paternal uncle, Abu Suhayl ibn\nMalik, that his father heard Uthman ibn Affan say in a khutba, \"Do not\noblige the slave-girl to earn money unless she has a skill. When you\noblige her to do that, she will earn money by prostitution. Do not\noblige the child to earn money. If he does not find it, he will steal.\nHave integrity since Allah has integrity with you, and you must feed\nthem good food.\""}},{"id":44,"idInBook":44,"chapterId":54,"bookId":7,"arabic":"حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْعَبْدُ إِذَا نَصَحَ لِسَيِّدِهِ وَأَحْسَنَ عِبَادَةَ اللَّهِ فَلَهُ أَجْرُهُ مَرَّتَيْنِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me from Nafi from Abdullah ibn Umar that the\nMessenger of Allah, may Allah bless him and grant him peace, said,\n\"When a slave gives good counsel to his master and worships Allah\ncorrectly, he has his reward twice over. \""}},{"id":45,"idInBook":45,"chapterId":54,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ أَمَةً، كَانَتْ لِعَبْدِ اللَّهِ بْنِ عُمَرَ بْنِ الْخَطَّابِ رَآهَا عُمَرُ بْنُ الْخَطَّابِ وَقَدْ تَهَيَّأَتْ بِهَيْئَةِ الْحَرَائِرِ فَدَخَلَ عَلَى ابْنَتِهِ حَفْصَةَ فَقَالَ أَلَمْ أَرَ جَارِيَةَ أَخِيكِ تَجُوسُ النَّاسَ وَقَدْ تَهَيَّأَتْ بِهَيْئَةِ الْحَرَائِرِ وَأَنْكَرَ ذَلِكَ عُمَرُ ‏.‏","english":{"narrator":"","text":"Malik related to me that he heard that Umar ibn al-Khattab saw a\nfemale slave belonging to Abdullah ibn Umar ibn al-Khattab. She was\ndressed like free (non-slave) women. He went to his daughter Hafsa and said, \"Didn't I\nsee your brother's slave-girl dressed like a free (non-slave) woman walking among the\npeople and causing trouble?\" Umar disapproved of that."}}],"chapter":{"id":54,"bookId":7,"arabic":"كتاب الاستئذان","english":"General Subjects"}}