{"metadata":{"length":3,"arabic":{"title":"موطأ مالك","author":"الإمام مالك بن أنس","introduction":"كتاب البيعة"},"english":{"title":"Muwatta Malik","author":"Imam Malik ibn Anas","introduction":"The Oath of Allegiance"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":55,"bookId":7,"arabic":"حَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، قَالَ كُنَّا إِذَا بَايَعْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم عَلَى السَّمْعِ وَالطَّاعَةِ يَقُولُ لَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ فِيمَا اسْتَطَعْتُمْ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me from Abdullah ibn Dinar that Abdullah ibn\nUmar said, \"When we took an oath of allegiance with him to hear and\nobey, the Messenger of Allah, may Allah bless him and grant him peace,\nsaid to us, 'In what you are able.' \""}},{"id":2,"idInBook":2,"chapterId":55,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ أُمَيْمَةَ بِنْتِ رُقَيْقَةَ، أَنَّهَا قَالَتْ أَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي نِسْوَةٍ بَايَعْنَهُ عَلَى الإِسْلاَمِ فَقُلْنَ يَا رَسُولَ اللَّهِ نُبَايِعُكَ عَلَى أَنْ لاَ نُشْرِكَ بِاللَّهِ شَيْئًا وَلاَ نَسْرِقَ وَلاَ نَزْنِيَ وَلاَ نَقْتُلَ أَوْلاَدَنَا وَلاَ نَأْتِيَ بِبُهْتَانٍ نَفْتَرِيهِ بَيْنَ أَيْدِينَا وَأَرْجُلِنَا وَلاَ نَعْصِيَكَ فِي مَعْرُوفٍ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فِيمَا اسْتَطَعْتُنَّ وَأَطَقْتُنَّ ‏\"‏ ‏.‏ قَالَتْ فَقُلْنَ اللَّهُ وَرَسُولُهُ أَرْحَمُ بِنَا مِنْ أَنْفُسِنَا هَلُمَّ نُبَايِعْكَ يَا رَسُولَ اللَّهِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنِّي لاَ أُصَافِحُ النِّسَاءَ إِنَّمَا قَوْلِي لِمِائَةِ امْرَأَةٍ كَقَوْلِي لاِمْرَأَةٍ وَاحِدَةٍ أَوْ مِثْلِ قَوْلِي لاِمْرَأَةٍ وَاحِدَةٍ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me from Muhammad ibn al-Munkadir that Umayma\nbint Ruqayqa said, \"I went to the Messenger of Allah, may Allah bless\nhim and grant him peace, with the women who took an oath of allegiance\nwith him in Islam. They said, 'Messenger of Allah! We take a pledge\nwith you not to associate anything with Allah, not to steal, not to\ncommit adultery, not to kill our children, nor to produce any lie that\nwe have devised between our hands and feet, and not to disobey you in\nwhat is known.' The Messenger of Allah, may Allah bless him and grant\nhim peace, said, 'In what you can do and are able.' \"\n\n\nUmayma\ncontinued, \"They said, 'Allah and His Messenger are more merciful to\nus than ourselves. Come, let us give our hands to you, Messenger of\nAllah!' The Messenger of Allah, may Allah bless him and grant him\npeace, said, 'I do not shake hands with women. My word to a hundred\nwomen is like my word to one woman.' \""}},{"id":3,"idInBook":3,"chapterId":55,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَتَبَ إِلَى عَبْدِ الْمَلِكِ بْنِ مَرْوَانَ يُبَايِعُهُ فَكَتَبَ إِلَيْهِ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ ‏.‏ أَمَّا بَعْدُ لِعَبْدِ اللَّهِ عَبْدِ الْمَلِكِ أَمِيرِ الْمُؤْمِنِينَ سَلاَمٌ عَلَيْكَ فَإِنِّي أَحْمَدُ إِلَيْكَ اللَّهَ الَّذِي لاَ إِلَهَ إِلاَّ هُوَ وَأُقِرُّ لَكَ بِالسَّمْعِ وَالطَّاعَةِ عَلَى سُنَّةِ اللَّهِ وَسُنَّةِ رَسُولِهِ فِيمَا اسْتَطَعْتُ ‏.‏","english":{"narrator":"","text":"Malik related to me from Abdullah ibn Dinar that Abdullah ibn\nUmar wrote to Abd al-Malik ibn Marwan, making an oath of allegiance.\nHe wrote, \"In the name of Allah, the Merciful, the Compassionate. To\nthe slave of Allah, Abd al-Malik, the amir al-muminin, Peace be upon\nyou. I praise Allah to you. There is no god but Him. I acknowledge\nyour right to my hearing and my obedience according to the sunna of\nAllah and the sunna of His Prophet, in what I am able.\""}}],"chapter":{"id":55,"bookId":7,"arabic":"كتاب البيعة","english":"The Oath of Allegiance"}}