{"metadata":{"length":28,"arabic":{"title":"موطأ مالك","author":"الإمام مالك بن أنس","introduction":"كتاب الكلام"},"english":{"title":"Muwatta Malik","author":"Imam Malik ibn Anas","introduction":"Speech"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":56,"bookId":7,"arabic":"حَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ قَالَ لأَخِيهِ يَا كَافِرُ ‏.‏ فَقَدْ بَاءَ بِهَا أَحَدُهُمَا ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me from Abdullah ibn Dinar from Abdullah ibn\nUmar that the Messenger of Allah, may Allah bless him and grant him\npeace, said, \"If a man says to his muslim brother, 'O kafir!' it is\ntrue about one of them.\""}},{"id":2,"idInBook":2,"chapterId":56,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا سَمِعْتَ الرَّجُلَ يَقُولُ هَلَكَ النَّاسُ ‏.‏ فَهُوَ أَهْلَكُهُمْ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me from Suhayl ibn Abu Salih from his father\nfrom Abu Hurayra that the Messenger of Allah, may Allah bless him and\ngrant him peace, said, \"When you hear a man say, 'The people are\nruined,' he himself is the most ruined of them all.\""}},{"id":3,"idInBook":3,"chapterId":56,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَقُلْ أَحَدُكُمْ يَا خَيْبَةَ الدَّهْرِ ‏.‏ فَإِنَّ اللَّهَ هُوَ الدَّهْرُ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me from Abu'z-Zinad from al-Araj from Abu\nHurayra that the Messenger of Allah, may Allah bless him and grant him\npeace, said, \"Let none of you complain about time, for Allah is time.'"}},{"id":4,"idInBook":4,"chapterId":56,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ عِيسَى ابْنَ مَرْيَمَ، لَقِيَ خِنْزِيرًا بِالطَّرِيقِ فَقَالَ لَهُ انْفُذْ بِسَلاَمٍ ‏.‏ فَقِيلَ لَهُ تَقُولُ هَذَا لِخِنْزِيرٍ فَقَالَ عِيسَى إِنِّي أَخَافُ أَنْ أُعَوِّدَ لِسَانِي النُّطْقَ بِالسُّوءِ ‏.‏","english":{"narrator":"","text":"Malik related to me from Yahya ibn Said that Isa ibn Maryam\nencountered a pig on the road. He said to it, \"Go in peace.\" Somebody\nasked, \"Do you say this to a pig?\" Isa said, \"I fear lest I accustom\nmy tongue to evil speech.\""}},{"id":5,"idInBook":5,"chapterId":56,"bookId":7,"arabic":"حَدَّثَنِي مَالِكٌ، عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَلْقَمَةَ، عَنْ أَبِيهِ، عَنْ بِلاَلِ بْنِ الْحَارِثِ الْمُزَنِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ الرَّجُلَ لَيَتَكَلَّمُ بِالْكَلِمَةِ مِنْ رِضْوَانِ اللَّهِ مَا كَانَ يَظُنُّ أَنْ تَبْلُغَ مَا بَلَغَتْ يَكْتُبُ اللَّهُ لَهُ بِهَا رِضْوَانَهُ إِلَى يَوْمِ يَلْقَاهُ وَإِنَّ الرَّجُلَ لَيَتَكَلَّمُ بِالْكَلَمِةِ مِنْ سَخَطِ اللَّهِ مَا كَانَ يَظُنُّ أَنْ تَبْلُغَ مَا بَلَغَتْ يَكْتُبُ اللَّهُ لَهُ بِهَا سَخَطَهُ إِلَى يَوْمِ يَلْقَاهُ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me from Muhammad ibn Amr ibn Alqama from his\nfather from Bilal ibn al-Harith al-Muzani that the Messenger of Allah,\nmay Allah bless him and grant him peace, said, \"A man speaks what is\npleasing to Allah and he does not suspect that it will have the result\nthat it does, and Allah will write for him His good pleasure for it\nuntil the day when he meets Him. And a man speaks what excites the\nwrath of Allah and he does not suspect that it will have the result\nthat it does, and Allah will write His wrath for him for it until the\nday when he meets Him.\""}},{"id":6,"idInBook":6,"chapterId":56,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ أَبِي صَالِحٍ السَّمَّانِ، أَنَّهُ أَخْبَرَهُ أَنَّ أَبَا هُرَيْرَةَ قَالَ إِنَّ الرَّجُلَ لَيَتَكَلَّمُ بِالْكَلِمَةِ مَا يُلْقِي لَهَا بَالاً يَهْوِي بِهَا فِي نَارِ جَهَنَّمَ وَإِنَّ الرَّجُلَ لَيَتَكَلَّمُ بِالْكَلَمَةِ مَا يُلْقِي لَهَا بَالاً يَرْفَعُهُ اللَّهُ بِهَا فِي الْجَنَّةِ ‏.‏","english":{"narrator":"","text":"Malik related to me from Abdullah ibn Dinar that Abu Salih as-\nSamman informed him that Abu Hurayra said, \"Truly a man utters words\nto which he attaches no importance, and by them he falls into the fire\nof Jahannam, and truly a man utters words to which he attaches no\nimportance, and by them Allah raises him into the Garden.\""}},{"id":7,"idInBook":7,"chapterId":56,"bookId":7,"arabic":"حَدَّثَنِي مَالِكٌ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ قَالَ قَدِمَ رَجُلاَنِ مِنَ الْمَشْرِقِ فَخَطَبَا فَعَجِبَ النَّاسُ لِبَيَانِهِمَا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ مِنَ الْبَيَانِ لَسِحْرًا ‏\"‏ ‏.‏ أَوْ قَالَ ‏\"‏ إِنَّ بَعْضَ الْبَيَانِ لَسِحْرٌ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me from Zayd ibn Aslam that Abdullah ibn Umar\nsaid, \"Two men from the east stood up and spoke, and people were\namazed at their eloquence. The Messenger of Allah, may Allah bless him\nand grant him peace, said, 'Some eloquence is sorcery,' or he said,\n'Part of eloquence is sorcery.' \""}},{"id":8,"idInBook":8,"chapterId":56,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ عِيسَى ابْنَ مَرْيَمَ، كَانَ يَقُولُ لاَ تُكْثِرُوا الْكَلاَمَ بِغَيْرِ ذِكْرِ اللَّهِ فَتَقْسُوَ قُلُوبُكُمْ فَإِنَّ الْقَلْبَ الْقَاسِيَ بَعِيدٌ مِنَ اللَّهِ وَلَكِنْ لاَ تَعْلَمُونَ وَلاَ تَنْظُرُوا فِي ذُنُوبِ النَّاسِ كَأَنَّكُمْ أَرْبَابٌ وَانْظُرُوا فِي ذُنُوبِكُمْ كَأَنَّكُمْ عَبِيدٌ فَإِنَّمَا النَّاسُ مُبْتَلًى وَمُعَافًى فَارْحَمُوا أَهْلَ الْبَلاَءِ وَاحْمَدُوا اللَّهَ عَلَى الْعَافِيَةِ ‏.‏","english":{"narrator":"","text":"Malik related to me that he heard that Isa ibn Maryam used to\nsay, \"Do not speak much without the mention of Allah for you will\nharden your hearts. A hard heart is far from Allah, but you do not\nknow. Do not look at the wrong actions of people as if you were lords.\nLook at your wrong actions as if you were slaves. Some people are\nafflicted by wrong action and some people are protected from it. Be\nmerciful to the people of affliction and praise Allah for His\nprotection.\""}},{"id":9,"idInBook":9,"chapterId":56,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكُ، أَنَّهُ بَلَغَهُ أَنَّ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم كَانَتْ تُرْسِلُ إِلَى بَعْضِ أَهْلِهَا بَعْدَ الْعَتَمَةِ فَتَقُولُ أَلاَ تُرِيحُونَ الْكُتَّابَ","english":{"narrator":"","text":"Malik related to me that he heard that A'isha, the wife of the\nProphet, may Allah bless him and grant him peace, sent a message to\none of her family after the evening prayer, saying, \"Will you not\nallow the recording angel to rest?\""}},{"id":10,"idInBook":10,"chapterId":56,"bookId":7,"arabic":"حَدَّثَنِي مَالِكٌ، عَنِ الْوَلِيدِ بْنِ عَبْدِ اللَّهِ بْنِ صَيَّادٍ، أَنَّ الْمُطَّلِبَ بْنَ عَبْدِ اللَّهِ بْنِ حَنْطَبَ الْمَخْزُومِيَّ، أَخْبَرَهُ أَنَّ رَجُلاً سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم مَا الْغِيبَةُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَنْ تَذْكُرَ مِنَ الْمَرْءِ مَا يَكْرَهُ أَنْ يَسْمَعَ ‏\"‏ ‏.‏ قَالَ يَا رَسُولَ اللَّهِ وَإِنْ كَانَ حَقًّا قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا قُلْتَ بَاطِلاً فَذَلِكَ الْبُهْتَانُ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me from al-Walid ibn Abdullah ibn Sayyad that\nal-Muttalib ibn Abdullah ibn Hantab al-Makhzumi informed him that a\nman asked the Messenger of Allah, may Allah bless him and grant him\npeace, \"What is backbiting?\" The Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"It is to mention about a man what he\ndoes not want to hear.\" He said, \"Messenger of Allah! Even if it is\ntrue?\" The Messenger of Allah, may Allah bless him and grant him\npeace, said, \"If you utter something false, then it is slander.\""}},{"id":11,"idInBook":11,"chapterId":56,"bookId":7,"arabic":"حَدَّثَنِي مَالِكٌ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ وَقَاهُ اللَّهُ شَرَّ اثْنَيْنِ وَلَجَ الْجَنَّةَ ‏\"‏ ‏.‏ فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ لاَ تُخْبِرْنَا ‏.‏ فَسَكَتَ رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ عَادَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ مِثْلَ مَقَالَتِهِ الأُولَى فَقَالَ لَهُ الرَّجُلُ لاَ تُخْبِرْنَا يَا رَسُولَ اللَّهِ ‏.‏ فَسَكَتَ رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم مِثْلَ ذَلِكَ أَيْضًا فَقَالَ الرَّجُلُ لاَ تُخْبِرْنَا يَا رَسُولَ اللَّهِ ‏.‏ ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم مِثْلَ ذَلِكَ أَيْضًا ‏.‏ ثُمَّ ذَهَبَ الرَّجُلُ يَقُولُ مِثْلَ مَقَالَتِهِ الأُولَى فَأَسْكَتَهُ رَجُلٌ إِلَى جَنْبِهِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ وَقَاهُ اللَّهُ شَرَّ اثْنَيْنِ وَلَجَ الْجَنَّةَ مَا بَيْنَ لَحْيَيْهِ وَمَا بَيْنَ رِجْلَيْهِ مَا بَيْنَ لَحْيَيْهِ وَمَا بَيْنَ رِجْلَيْهِ مَا بَيْنَ لَحْيَيْهِ وَمَا بَيْنَ رِجْلَيْهِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me from Zayd ibn Aslam from Ata ibn Yasar that\nthe Messenger of Allah, may Allah bless him and grant him peace, said,\n\"Whomever Allah protects from the evil of two things will enter the\nGarden.\" A man said, \"Messenger of Allah, do not tell us!\" The\nMessenger of Allah, may Allah bless him and grant him peace, was\nsilent. Then the Messenger of Allah, may Allah bless him and grant him\npeace, repeated what he had said the first time. The man said to him,\n\"Do not tell us, Messenger of Allah!\" The Messenger of Allah, may\nAllah bless him and grant him peace, was silent. Then the Messenger of\nAllah, may Allah bless him and grant him peace, said the same thing\nagain. The man said, \"Do not tell us, Messenger of Allah!\" Then the\nMessenger of Allah, may Allah bless him and grant him peace, said the\nsame thing again. Then the man began to say what he had said\npreviously and a man at his side silenced him. The Messenger of Allah,\nmay Allah bless him and grant him peace, said, \"Whomever Allah\nprotects from the evil of two things will enter the Garden. They are\nwhat is between his jaws and what is between his legs, what is between\nhis jaws and what is between his legs, what is between his jaws and\nwhat is between his legs.\""}},{"id":12,"idInBook":12,"chapterId":56,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَبِيهِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، دَخَلَ عَلَى أَبِي بَكْرٍ الصِّدِّيقِ وَهُوَ يَجْبِذُ لِسَانَهُ فَقَالَ لَهُ عُمَرُ مَهْ غَفَرَ اللَّهُ لَكَ ‏.‏ فَقَالَ أَبُو بَكْرٍ إِنَّ هَذَا أَوْرَدَنِي الْمَوَارِدَ ‏.‏","english":{"narrator":"","text":"Malik related to me from Zayd ibn Aslam from his father that Umar\nibn al-Khattab came upon Abu Bakr as-Siddiq pulling his tongue. Umar\nsaid to him, \"Stop, may Allah forgive you!\" Abu Bakr replied, \"This\nhas brought me to dangerous places.\""}},{"id":13,"idInBook":13,"chapterId":56,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، قَالَ كُنْتُ أَنَا وَعَبْدُ اللَّهِ بْنُ عُمَرَ، عِنْدَ دَارِ خَالِدِ بْنِ عُقْبَةَ الَّتِي بِالسُّوقِ فَجَاءَ رَجُلٌ يُرِيدُ أَنْ يُنَاجِيَهُ وَلَيْسَ مَعَ عَبْدِ اللَّهِ بْنِ عُمَرَ أَحَدٌ غَيْرِي وَغَيْرُ الرَّجُلِ الَّذِي يُرِيدُ أَنْ يُنَاجِيَهُ فَدَعَا عَبْدُ اللَّهِ بْنُ عُمَرَ رَجُلاً آخَرَ حَتَّى كُنَّا أَرْبَعَةً فَقَالَ لِي وَلِلرَّجُلِ الَّذِي دَعَاهُ اسْتَأْخِرَا شَيْئًا فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ لاَ يَتَنَاجَى اثْنَانِ دُونَ وَاحِدٍ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me from Abdullah ibn Dinar saying, \"Abdullah ibn\nUmar and I were at the house of Khalid ibn Uqba who was away at the\nmarket. A man came who wanted to speak to Abdullah ibn Umar and I was\nthe only other person present Abdullah ibn Umar called another man so\nthat we were four and said to me and the man whom he had called, 'Go a\nlittle way off together, because I heard the Messenger of Allah, may\nAllah bless him and grant him peace, say, \"Two do not converse\nsecretly to the exclusion of another.' \"'"}},{"id":14,"idInBook":14,"chapterId":56,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا كَانَ ثَلاَثَةٌ فَلاَ يَتَنَاجَى اثْنَانِ دُونَ وَاحِدٍ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me from Nafi from Abdullah ibn Umar that the\nMessenger of Allah, may Allah bless him and grant him peace, said,\n\"Two must not converse secretly to the exclusion of another person.\""}},{"id":15,"idInBook":15,"chapterId":56,"bookId":7,"arabic":"حَدَّثَنِي مَالِكٌ، عَنْ صَفْوَانَ بْنِ سُلَيْمٍ، أَنَّ رَجُلاً، قَالَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم أَكْذِبُ امْرَأَتِي يَا رَسُولَ اللَّهِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ خَيْرَ فِي الْكَذِبِ ‏\"‏ ‏.‏ فَقَالَ الرَّجُلُ يَا رَسُولَ اللَّهِ أَعِدُهَا وَأَقُولُ لَهَا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ جُنَاحَ عَلَيْكَ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me from Safwan ibn Sulaym that a man asked the\nMessenger of Allah, may Allah bless him and grant him peace, \"Can I\nlie to my wife, Messenger of Allah?\" The Messenger of Allah, may Allah\nbless him and grant him peace, said, \"There is no good in lying.\" The\nman said, \"Messenger of Allah! Shall I make her a promise and tell\nher?\" The Messenger of Allah, may Allah bless him and grant him peace,\nsaid, \"It will not be held against you.\""}},{"id":16,"idInBook":16,"chapterId":56,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ، كَانَ يَقُولُ عَلَيْكُمْ بِالصِّدْقِ فَإِنَّ الصِّدْقَ يَهْدِي إِلَى الْبِرِّ وَالْبِرَّ يَهْدِي إِلَى الْجَنَّةِ وَإِيَّاكُمْ وَالْكَذِبَ فَإِنَّ الْكَذِبَ يَهْدِي إِلَى الْفُجُورِ وَالْفُجُورَ يَهْدِي إِلَى النَّارِ أَلاَ تَرَى أَنَّهُ يُقَالُ صَدَقَ وَبَرَّ وَكَذَبَ وَفَجَرَ ‏.‏","english":{"narrator":"","text":"Malik related to me that he heard that Abdullah ibn Masud used to\nsay, \"You must tell the truth. Truthfulness leads to right action.\nRight action leads to the Garden. Beware of lying. Lying leads to\ncorruption, and corruption leads to the Fire. Don't you see that it is\nsaid, 'He speaks the truth and acts rightly,' and, 'He lies and is\ncorrupt.' \""}},{"id":17,"idInBook":17,"chapterId":56,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّهُ قِيلَ لِلُقْمَانَ مَا بَلَغَ بِكَ مَا نَرَى يُرِيدُونَ الْفَضْلَ ‏.‏ فَقَالَ لُقْمَانُ صِدْقُ الْحَدِيثِ وَأَدَاءُ الأَمَانَةِ وَتَرْكُ مَا لاَ يَعْنِينِي ‏.‏","english":{"narrator":"","text":"Malik related to me that he heard that someone said to Luqman,\n\"What has brought you to what we see?\" meaning his high rank. Luqman\nsaid, \"Truthful speech, fulfilling the trust, and leaving what does\nnot concern me.\""}},{"id":18,"idInBook":18,"chapterId":56,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ، كَانَ يَقُولُ لاَ يَزَالُ الْعَبْدُ يَكْذِبُ وَتُنْكَتُ فِي قَلْبِهِ نُكْتَةٌ سَوْدَاءُ حَتَّى يَسْوَدَّ قَلْبُهُ كُلُّهُ فَيُكْتَبَ عِنْدَ اللَّهِ مِنَ الْكَاذِبِينَ ‏.‏","english":{"narrator":"","text":"Malik related to me that he heard that Abdullah ibn Masud used to\nsay, \"The slave continues to lie and a black spot grows in his heart\nuntil all his heart becomes black. Then he is written, in Allah's\nsight, among the liars.\""}},{"id":19,"idInBook":19,"chapterId":56,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ صَفْوَانَ بْنِ سُلَيْمٍ، أَنَّهُ قَالَ قِيلَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم أَيَكُونُ الْمُؤْمِنُ جَبَانًا فَقَالَ ‏\"‏ نَعَمْ ‏\"‏ ‏.‏ فَقِيلَ لَهُ أَيَكُونُ الْمُؤْمِنُ بَخِيلاً فَقَالَ ‏\"‏ نَعَمْ ‏\"‏ ‏.‏ فَقِيلَ لَهُ أَيَكُونُ الْمُؤْمِنُ كَذَّابًا فَقَالَ ‏\"‏ لاَ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me that Safwan ibn Sulaym said, \"The Messenger\nof Allah, may Allah bless him and grant him peace, was asked, 'Can the\nmumin be a coward?' He said, 'Yes.' He was asked, 'Can the mumin be a\nmiser?' He said, 'Yes.' He was asked, 'Can the mumin be a liar?' He\nsaid, 'No.' \""}},{"id":20,"idInBook":20,"chapterId":56,"bookId":7,"arabic":"حَدَّثَنِي مَالِكٌ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ اللَّهَ يَرْضَى لَكُمْ ثَلاَثًا وَيَسْخَطُ لَكُمْ ثَلاَثًا يَرْضَى لَكُمْ أَنْ تَعْبُدُوهُ وَلاَ تُشْرِكُوا بِهِ شَيْئًا وَأَنْ تَعْتَصِمُوا بِحَبْلِ اللَّهِ جَمِيعًا وَأَنْ تَنَاصَحُوا مَنْ وَلاَّهُ اللَّهُ أَمْرَكُمْ وَيَسْخَطُ لَكُمْ قِيلَ وَقَالَ وَإِضَاعَةَ الْمَالِ وَكَثْرَةَ السُّؤَالِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me from Suhayl ibn Abi Salih from his father\nfrom Abu Hurayra that the Messenger of Allah, may Allah bless him and\ngrant him peace, said, \"Allah is pleased with three things from you,\nand He is angry with three things from you. He is pleased that you\nworship Him and do not associate anything with Him, and that you take\nhold of the rope of Allah altogether, and that you give good counsel\nto the one to whom Allah gives command over you. He is angry with you\nfor gossip, squandering property, and asking too many questions.\""}},{"id":21,"idInBook":21,"chapterId":56,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مِنْ شَرِّ النَّاسِ ذُو الْوَجْهَيْنِ الَّذِي يَأْتِي هَؤُلاَءِ بِوَجْهٍ وَهَؤُلاَءِ بِوَجْهٍ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me from Abu'z-Zinad from al-Araj from Abu\nHurayra that the Messenger of Allah, may Allah bless him and grant him\npeace, said, \"One of the most evil of people is the two-faced person\nwho shows one face to these people and another face to those people.\""}},{"id":22,"idInBook":22,"chapterId":56,"bookId":7,"arabic":"حَدَّثَنِي مَالِكٌ، أَنَّهُ بَلَغَهُ أَنَّ أُمَّ سَلَمَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَالَتْ يَا رَسُولَ اللَّهِ أَنَهْلِكُ وَفِينَا الصَّالِحُونَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ نَعَمْ إِذَا كَثُرَ الْخَبَثُ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me that he had heard that Umm Salama, the wife\nof the Prophet, may Allah bless him and grant him peace, said,\n\"Messenger of Allah! Shall we be destroyed while there are people who\nare salih among us?\" The Messenger of Allah, may Allah bless him and\ngrant him peace, said, \"Yes, if there is much wickedness.\""}},{"id":23,"idInBook":23,"chapterId":56,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي حَكِيمٍ، أَنَّهُ سَمِعَ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ، يَقُولُ كَانَ يُقَالُ إِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى لاَ يُعَذِّبُ الْعَامَّةَ بِذَنْبِ الْخَاصَّةِ وَلَكِنْ إِذَا عُمِلَ الْمُنْكَرُ جِهَارًا اسْتَحَقُّوا الْعُقُوبَةَ كُلُّهُمْ ‏.‏","english":{"narrator":"","text":"Malik related to me that Ismail ibn Abi Hakim heard Umar ibn Abd\nal-Aziz say, \"Some say that Allah the Blessed, the Exalted, will not\npunish the many for the wrong action of the few. However, when the\nobjectionable action is committed openly, then they all deserve to be\npunished.\""}},{"id":24,"idInBook":24,"chapterId":56,"bookId":7,"arabic":"حَدَّثَنِي مَالِكٌ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ، وَخَرَجْتُ، مَعَهُ حَتَّى دَخَلَ حَائِطًا فَسَمِعْتُهُ وَهُوَ، يَقُولُ وَبَيْنِي وَبَيْنَهُ جِدَارٌ - وَهُوَ فِي جَوْفِ الْحَائِطِ - عُمَرُ بْنُ الْخَطَّابِ أَمِيرُ الْمُؤْمِنِينَ بَخٍ بَخٍ وَاللَّهِ لَتَتَّقِيَنَّ اللَّهَ أَوْ لَيُعَذِّبَنَّكَ ‏.‏","english":{"narrator":"","text":"Malik related to me from Ishaq ibn Abdullah ibn Abi Talha that\nAnas ibn Malik said, \"I heard Umar ibn al-Khattab, when I was going\nout with him to visit an orchard, say to himself, and there was a wall\nbetween him and me and he was inside the garden, 'Umar ibn al-Khattab,\namir al-muminin! Well done! Well done! By Allah, fear Allah or he will\npunish you.' \""}},{"id":25,"idInBook":25,"chapterId":56,"bookId":7,"arabic":"قَالَ مَالِكٌ وَبَلَغَنِي أَنَّ الْقَاسِمَ بْنَ مُحَمَّدٍ كَانَ يَقُولُ أَدْرَكْتُ النَّاسَ وَمَا يَعْجَبُونَ بِالْقَوْلِ ‏.‏ قَالَ مَالِكٌ يُرِيدُ بِذَلِكَ الْعَمَلَ إِنَّمَا يُنْظَرُ إِلَى عَمَلِهِ وَلاَ يُنْظَرُ إِلَى قَوْلِهِ ‏.‏","english":{"narrator":"","text":"Malik said, \"I heard that al-Qasim ibn Muhammad used to say, 'I\nhave seen the people, (i.e. the companions), and they were not\nimpressed by speech.' \" Malik said, \"He meant that only action and\ndeeds would be looked at, not words.\""}},{"id":26,"idInBook":26,"chapterId":56,"bookId":7,"arabic":"حَدَّثَنِي مَالِكٌ، عَنْ عَامِرِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، أَنَّهُ كَانَ إِذَا سَمِعَ الرَّعْدَ، تَرَكَ الْحَدِيثَ","english":{"narrator":"","text":"Malik related to me that Amir ibn Abdullah ibn az-Zubayr would\nstop speaking when he heard thunder and say, \"Glory be to Allah whom\nthe thunder glorifies with His praise and the angels from the fear of\nHim.\" (Subhana-aladhee yusabihu ar-radu bi hamdihi wa mala'ikatu min\nkhiyfatihi.) Then he would say, \"This is a severe warning to the\npeople of the earth.\""}},{"id":27,"idInBook":27,"chapterId":56,"bookId":7,"arabic":"حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ، أَنَّ أَزْوَاجَ النَّبِيِّ، صلى الله عليه وسلم حِينَ تُوُفِّيَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَرَدْنَ أَنْ يَبْعَثْنَ عُثْمَانَ بْنَ عَفَّانَ إِلَى أَبِي بَكْرٍ الصِّدِّيقِ فَيَسْأَلْنَهُ مِيرَاثَهُنَّ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ لَهُنَّ عَائِشَةُ أَلَيْسَ قَدْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لاَ نُورَثُ مَا تَرَكْنَا فَهُوَ صَدَقَةٌ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me from Ibn Shihab from Urwa ibn az-Zubayr from\nA'isha, umm al-muminin that when the Messenger of Allah, may Allah\nbless him and grant him peace, died, the wives of the Prophet, may\nAllah bless him and grant him peace, wanted to send Uthman ibn Affan\nto Abu Bakr as-Siddiq to ask him about their inheritance from the\nMessenger of Allah, may Allah bless him and grant him peace A'isha\nsaid to them, \"Didn't the Messenger of Allah, may Allah bless him and\ngrant him peace, say, 'No one inherits from us. What we leave is\nsadaqa.' \""}},{"id":28,"idInBook":28,"chapterId":56,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَقْتَسِمُ وَرَثَتِي دَنَانِيرَ مَا تَرَكْتُ بَعْدَ نَفَقَةِ نِسَائِي وَمُؤْنَةِ عَامِلِي فَهُوَ صَدَقَةٌ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Malik related to me from Abu'z-Zinad from al-Araj from Abu\nHurayra that the Messenger of Allah, may Allah bless him and grant him\npeace, said, \"My inheritance is not divided up by the dinar. What I\nleave apart from the maintenance of my wives and provision for my\nservant is sadaqa.\""}}],"chapter":{"id":56,"bookId":7,"arabic":"كتاب الكلام","english":"Speech"}}