{"metadata":{"length":1,"arabic":{"title":"موطأ مالك","author":"الإمام مالك بن أنس","introduction":"كتاب دعوة المظلوم"},"english":{"title":"Muwatta Malik","author":"Imam Malik ibn Anas","introduction":"The Supplication of the Unjustly Wronged"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":60,"bookId":7,"arabic":"حَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَبِيهِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، اسْتَعْمَلَ مَوْلًى لَهُ يُدْعَى هُنَيًّا عَلَى الْحِمَى فَقَالَ يَا هُنَىُّ اضْمُمْ جَنَاحَكَ عَنِ النَّاسِ وَاتَّقِ دَعْوَةَ الْمَظْلُومِ فَإِنَّ دَعْوَةَ الْمَظْلُومِ مُسْتَجَابَةٌ وَأَدْخِلْ رَبَّ الصُّرَيْمَةِ وَرَبَّ الْغُنَيْمَةِ وَإِيَّاىَ وَنَعَمَ ابْنِ عَوْفٍ وَنَعَمَ ابْنِ عَفَّانَ فَإِنَّهُمَا إِنْ تَهْلِكْ مَاشِيَتُهُمَا يَرْجِعَا إِلَى نَخْلٍ وَزَرْعٍ وَإِنَّ رَبَّ الصُّرَيْمَةِ وَرَبَّ الْغُنَيْمَةِ إِنْ تَهْلِكْ مَاشِيَتُهُمَا يَأْتِنِي بِبَنِيهِ فَيَقُولُ يَا أَمِيرَ الْمُؤْمِنِينَ يَا أَمِيرَ الْمُؤْمِنِينَ ‏.‏ أَفَتَارِكُهُمْ أَنَا لاَ أَبَا لَكَ فَالْمَاءُ وَالْكَلأُ أَيْسَرُ عَلَىَّ مِنَ الذَّهَبِ وَالْوَرِقِ وَايْمُ اللَّهِ إِنَّهُمْ لَيَرَوْنَ أَنِّي قَدْ ظَلَمْتُهُمْ إِنَّهَا لَبِلاَدُهُمْ وَمِيَاهُهُمْ قَاتَلُوا عَلَيْهَا فِي الْجَاهِلِيَّةِ وَأَسْلَمُوا عَلَيْهَا فِي الإِسْلاَمِ وَالَّذِي نَفْسِي بِيَدِهِ لَوْلاَ الْمَالُ الَّذِي أَحْمِلُ عَلَيْهِ فِي سَبِيلِ اللَّهِ مَا حَمَيْتُ عَلَيْهِمْ مِنْ بِلاَدِهِمْ شِبْرًا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Zayd ibn Aslam from his\nfather that Umar ibn al-Khattab gave a mawla of his called Hunayy\ncharge over the hima. He said, \"Hunayy! Do not harm the people. Fear\nthe supplication of the wronged, for the supplication of the wronged\nis answered. Let the one with a small herd of camels and the one with\na small herd of sheep enter, but be wary of the livestock of Ibn Awf\nand the livestock of Ibn Affan. If their livestock are destroyed, they\nwill return to palm-trees and agriculture. If the livestock of the one\nwith a small herd of camels and the one with a small herd of sheep are\ndestroyed, he will bring his children to me crying, 'Amir al-muminin!\nAmir al-Muminin!' Shall I neglect them? Water and pasturage are of\nless value to me than gold and silver. By Allah, they think that I\nhave wronged them. This is their land and their water. They fought for\nit in the jahiliyya and became muslims on it in Islam. By He in whose\nhand my self is! Were it not for the mounts which I give to be ridden\nin the way of Allah, I would not have turned a span of their land into\nhima.\""}}],"chapter":{"id":60,"bookId":7,"arabic":"كتاب دعوة المظلوم","english":"The Supplication of the Unjustly Wronged"}}