{"metadata":{"length":33,"arabic":{"title":"موطأ مالك","author":"الإمام مالك بن أنس","introduction":"كتاب صلاة الليل"},"english":{"title":"Muwatta Malik","author":"Imam Malik ibn Anas","introduction":"Tahajjud"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":7,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنْ رَجُلٍ، عِنْدَهُ رِضًا أَنَّهُ أَخْبَرَهُ أَنَّ عَائِشَةَ زَوْجَ النَّبِيِّ صلى الله عليه وسلم أَخْبَرَتْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَا مِنِ امْرِئٍ تَكُونُ لَهُ صَلاَةٌ بِلَيْلٍ يَغْلِبُهُ عَلَيْهَا نَوْمٌ إِلاَّ كَتَبَ اللَّهُ لَهُ أَجْرَ صَلاَتِهِ وَكَانَ نَوْمُهُ عَلَيْهِ صَدَقَةً ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Muhammad ibn al-Munkadir from\nSaid ibn al-Jubayr that a man who has approval (as a relater of\nhadith), told him that A'isha, the wife of the Prophet, may Allah\nbless him and grant him peace, said, \"If a man prays in the night and\nsleep overcomes him during it, Allah writes for him the reward of his\nprayer, and his sleep is sadaqa for him.\""}},{"id":2,"idInBook":2,"chapterId":7,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي النَّضْرِ، مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ كُنْتُ أَنَامُ بَيْنَ يَدَىْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَرِجْلاَىَ فِي قِبْلَتِهِ فَإِذَا سَجَدَ غَمَزَنِي فَقَبَضْتُ رِجْلَىَّ فَإِذَا قَامَ بَسَطْتُهُمَا ‏.‏ قَالَتْ وَالْبُيُوتُ يَوْمَئِذٍ لَيْسَ فِيهَا مَصَابِيحُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'nNadr, the mawla of Umar\nibn 'Ubaydullah, from Abu Salama ibn Abd ar-Rahman that A'isha, the\nwife of the Prophet, may Allah bless him and grant him peace, said, \"I\nwas sleeping in front of the Messenger of Allah, may Allah bless him\nand grant him peace, and my feet were in his qibla. When he\nprostrated, he nudged me and I pulled up my feet,and when he stood up\nI spread them out.\" She added, \"There were no lamps in the house at\nthat time.\""}},{"id":3,"idInBook":3,"chapterId":7,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا نَعَسَ أَحَدُكُمْ فِي صَلاَتِهِ فَلْيَرْقُدْ حَتَّى يَذْهَبَ عَنْهُ النَّوْمُ فَإِنَّ أَحَدَكُمْ إِذَا صَلَّى وَهُوَ نَاعِسٌ لاَ يَدْرِي لَعَلَّهُ يَذْهَبُ يَسْتَغْفِرُ فَيَسُبُّ نَفْسَهُ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa from his\nfather from A'isha, the wife of the Prophet, may Allah bless him and\ngrant him peace, that the Messenger of Allah, may Allah bless him and\ngrant him peace, said, \"If you are drowsy in prayer, sleep until sleep\nleaves you, because if you pray while you are drowsy, you do not know\nwhether you may intend to ask for forgiveness but (in fact) ask for\nharm.\""}},{"id":4,"idInBook":4,"chapterId":7,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي حَكِيمٍ، أَنَّهُ بَلَغَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم سَمِعَ امْرَأَةً مِنَ اللَّيْلِ تُصَلِّي فَقَالَ ‏\"‏ مَنْ هَذِهِ ‏\"‏ ‏.‏ فَقِيلَ لَهُ هَذِهِ الْحَوْلاَءُ بِنْتُ تُوَيْتٍ لاَ تَنَامُ اللَّيْلَ ‏.‏ فَكَرِهَ ذَلِكَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى عُرِفَتِ الْكَرَاهِيَةُ فِي وَجْهِهِ ثُمَّ قَالَ ‏\"‏ إِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى لاَ يَمَلُّ حَتَّى تَمَلُّوا اكْلَفُوا مِنَ الْعَمَلِ مَا لَكُمْ بِهِ طَاقَةٌ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ismail from Ibn Abi Hakim\nthat he had heard that the Messenger of Allah, may Allah bless him and\ngrant him peace, heard a woman praying at night. He said, \"Who is\nthat?\" and someone said to him,\"It is al-Hawla bint Tuwayt, she does\nnot sleep in the night.\" The Messenger of Allah, may Allah bless him\nand grant him peace, disapproved of that and his disapproval showed in\nhis face. Then he said, \"Allah, the Blessed and Exalted, does not\nbecome weary, but you become weary. Take on whatever is within your\ncapability.\""}},{"id":5,"idInBook":5,"chapterId":7,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَبِيهِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، كَانَ يُصَلِّي مِنَ اللَّيْلِ مَا شَاءَ اللَّهُ حَتَّى إِذَا كَانَ مِنْ آخِرِ اللَّيْلِ أَيْقَظَ أَهْلَهُ لِلصَّلاَةِ يَقُولُ لَهُمُ الصَّلاَةَ الصَّلاَةَ ثُمَّ يَتْلُو هَذِهِ الآيَةَ ‏{‏وَأْمُرْ أَهْلَكَ بِالصَّلاَةِ وَاصْطَبِرْ عَلَيْهَا لاَ نَسْأَلُكَ رِزْقًا نَحْنُ نَرْزُقُكَ وَالْعَاقِبَةُ لِلتَّقْوَى‏}‏","english":{"narrator":"","text":"Yahya related to me from Malik from Zayd ibn Aslam from his\nfather that Umar ibn al-Khattab used to pray as much as Allah willed\nin the night until at the end of the night he would wake his family\nfor the prayer. He used to say to them, \"The prayer, the prayer.\" Then\nhe would recite the ayat, \"Enjoin prayer on your family and be\nconstant in it. We do not ask you for your provision. We provide for\nyou. And the end result is for taqwa.\" (Sura 20 ayat 132)"}},{"id":6,"idInBook":6,"chapterId":7,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ سَعِيدَ بْنَ الْمُسَيَّبِ، كَانَ يَقُولُ يُكْرَهُ النَّوْمُ قَبْلَ الْعِشَاءِ وَالْحَدِيثُ بَعْدَهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Said ibn\nal-Musayyab used to say, \"Sleep is disapproved of before isha and\nconversation after it.\""}},{"id":7,"idInBook":7,"chapterId":7,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقُولُ صَلاَةُ اللَّيْلِ وَالنَّهَارِ مَثْنَى مَثْنَى يُسَلِّمُ مِنْ كُلِّ رَكْعَتَيْنِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Abdullah\nibn Umar used to say, \"(Voluntary) prayer in both the day and night is\ntwo at a time with a taslim after every 2 raka'ahs.\"\n\n\nMalik said,\n\"That is the custom among us.\""}},{"id":8,"idInBook":8,"chapterId":7,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُصَلِّي مِنَ اللَّيْلِ إِحْدَى عَشْرَةَ رَكْعَةً يُوتِرُ مِنْهَا بِوَاحِدَةٍ فَإِذَا فَرَغَ اضْطَجَعَ عَلَى شِقِّهِ الأَيْمَنِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Urwa ibn az-\nZubayr from A'isha, the wife of the Prophet, may Allah bless him and\ngrant him peace, that the Messenger of Allah, may Allah bless him and\ngrant him peace, used to pray eleven rakas in the night, making them\nodd by a single one, and when he had finished he lay down on his right\nside."}},{"id":9,"idInBook":9,"chapterId":7,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، أَنَّهُ سَأَلَ عَائِشَةَ زَوْجَ النَّبِيِّ صلى الله عليه وسلم كَيْفَ كَانَتْ صَلاَةُ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي رَمَضَانَ فَقَالَتْ مَا كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَزِيدُ فِي رَمَضَانَ وَلاَ فِي غَيْرِهِ عَلَى إِحْدَى عَشْرَةَ رَكْعَةً يُصَلِّي أَرْبَعًا فَلاَ تَسْأَلْ عَنْ حُسْنِهِنَّ وَطُولِهِنَّ ثُمَّ يُصَلِّي أَرْبَعًا فَلاَ تَسْأَلْ عَنْ حُسْنِهِنَّ وَطُولِهِنَّ ثُمَّ يُصَلِّي ثَلاَثًا فَقَالَتْ عَائِشَةُ فَقُلْتُ يَا رَسُولَ اللَّهِ أَتَنَامُ قَبْلَ أَنْ تُوتِرَ فَقَالَ ‏\n\"‏ يَا عَائِشَةُ إِنَّ عَيْنَىَّ تَنَامَانِ وَلاَ يَنَامُ قَلْبِي ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Said ibn Abi Said al-Maqburi\nfrom Abu Salama ibn Abd ar-Rahman ibn Awf that he asked A'isha, the\nwife of the Prophet, may Allah bless him and grant him peace, what the\nprayer of the Messenger of Allah, may Allah bless him and grant him\npeace, was like during Ramadan. She said, \"The Messenger of Allah, may\nAllah bless him and grant him peace, did not go above eleven rakas in\nRamadan or at any other time. He prayed four - do not ask me about\ntheir beauty or length. Then he prayed another four - do not ask me\nabout their beauty and length. Then he prayed three.\"\n\n\nA'isha\ncontinued, \"I said, 'Messenger of Allah, are you sleeping before you\ndo the witr?' He said, A'isha, my eyes sleep but my heart does not\nsleep.' \""}},{"id":10,"idInBook":10,"chapterId":7,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي بِاللَّيْلِ ثَلاَثَ عَشْرَةَ رَكْعَةً ثُمَّ يُصَلِّي إِذَا سَمِعَ النِّدَاءَ بِالصُّبْحِ رَكْعَتَيْنِ خَفِيفَتَيْنِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa from his\nfather that A'isha, umm al-muminin said, \"The Messenger of Allah, may\nAllah bless him and grant him peace, used to pray thirteen rakas in\nthe night and then would pray two rakas when he heard the adhan for\nthe subh prayer.\""}},{"id":11,"idInBook":11,"chapterId":7,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ مَخْرَمَةَ بْنِ سُلَيْمَانَ، عَنْ كُرَيْبٍ، مَوْلَى ابْنِ عَبَّاسٍ أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، أَخْبَرَهُ أَنَّهُ، بَاتَ لَيْلَةً عِنْدَ مَيْمُونَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم - وَهِيَ خَالَتُهُ - قَالَ فَاضْطَجَعْتُ فِي عَرْضِ الْوِسَادَةِ وَاضْطَجَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَهْلُهُ فِي طُولِهَا فَنَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى إِذَا انْتَصَفَ اللَّيْلُ - أَوْ قَبْلَهُ بِقَلِيلٍ أَوْ بَعْدَهُ بِقَلِيلٍ - اسْتَيْقَظَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَجَلَسَ يَمْسَحُ النَّوْمَ عَنْ وَجْهِهِ بِيَدِهِ ثُمَّ قَرَأَ الْعَشْرَ الآيَاتِ الْخَوَاتِمَ مِنْ سُورَةِ آلِ عِمْرَانَ ثُمَّ قَامَ إِلَى شَنٍّ مُعَلَّقٍ فَتَوَضَّأَ مِنْهُ فَأَحْسَنَ وُضُوءَهُ ثُمَّ قَامَ يُصَلِّي - قَالَ ابْنُ عَبَّاسٍ - فَقُمْتُ فَصَنَعْتُ مِثْلَ مَا صَنَعَ ثُمَّ ذَهَبْتُ فَقُمْتُ إِلَى جَنْبِهِ فَوَضَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَدَهُ الْيُمْنَى عَلَى رَأْسِي وَأَخَذَ بِأُذُنِي الْيُمْنَى يَفْتِلُهَا فَصَلَّى رَكْعَتَيْنِ ثُمَّ رَكْعَتَيْنِ ثُمَّ رَكْعَتَيْنِ ثُمَّ رَكْعَتَيْنِ ثُمَّ رَكْعَتَيْنِ ثُمَّ رَكْعَتَيْنِ ثُمَّ أَوْتَرَ ثُمَّ اضْطَجَعَ حَتَّى أَتَاهُ الْمُؤَذِّنُ فَصَلَّى رَكْعَتَيْنِ خَفِيفَتَيْنِ ثُمَّ خَرَجَ فَصَلَّى الصُّبْحَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Makhrama ibn Sulayman from\nKurayb, the mawla of Ibn Abbas, that Abdullah ibn Abbas told him that\nhe had spent a night at the house of Maimuna, the wife of the Prophet,\nmay Allah bless him and grant him peace, who was also Ibn Abbas'\nmother's sister. Ibn Abbas said, \"I lay down with my head on the\nbreadth of the cushion, and the Messenger of Allah, may Allah bless\nhim and grant him peace, and his wife lay down with their heads on its\nlength. The Messenger of Allah, may Allah bless him and grant him\npeace, slept, until, halfway through the night or a little before or\nafter it, he awoke and sat up and wiped the sleep away from his face\nwith his hand. Then he recited the last ten ayats of sura Ali Imran\n(Sura3). Then he got up and went over to a water-skin which was\nhanging up and did wudu from it, doing his wudu thoroughly, and then\nhe stood in prayer.\"\n\n\nIbn Abbas continued, \"I stood up and did\nthe same and then went and stood by his side. The Messenger of Allah,\nmay Allah bless him and grant him peace, put his right hand on my head\nand took my right ear and tweaked it. He prayed two rakas, then two\nrakas, then two rakas, then two rakas, then two rakas, then two rakas,\nand then prayed an odd raka. Then he lay down until the muadhdhin came\nto him, and then prayed two quick rakas, and went out and prayed subh\n.\""}},{"id":12,"idInBook":12,"chapterId":7,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، عَنْ أَبِيهِ، أَنَّ عَبْدَ اللَّهِ بْنَ قَيْسِ بْنِ مَخْرَمَةَ، أَخْبَرَهُ عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ، أَنَّهُ قَالَ لأَرْمُقَنَّ اللَّيْلَةَ صَلاَةَ رَسُولِ اللَّهِ صلى الله عليه وسلم - قَالَ - فَتَوَسَّدْتُ عَتَبَتَهُ - أَوْ فُسْطَاطَهُ - فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَصَلَّى رَكْعَتَيْنِ طَوِيلَتَيْنِ طَوِيلَتَيْنِ طَوِيلَتَيْنِ ثُمَّ صَلَّى رَكْعَتَيْنِ وَهُمَا دُونَ اللَّتَيْنِ قَبْلَهُمَا ثُمَّ صَلَّى رَكْعَتَيْنِ وَهُمَا دُونَ اللَّتَيْنِ قَبْلَهُمَا ثُمَّ صَلَّى رَكْعَتَيْنِ وَهُمَا دُونَ اللَّتَيْنِ قَبْلَهُمَا ثُمَّ صَلَّى رَكْعَتَيْنِ وَهُمَا دُونَ اللَّتَيْنِ قَبْلَهُمَا ثُمَّ صَلَّى رَكْعَتَيْنِ وَهُمَا دُونَ اللَّتَيْنِ قَبْلَهُمَا ثُمَّ أَوْتَرَ فَتِلْكَ ثَلاَثَ عَشْرَةَ رَكْعَةً ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abdullah ibn Abi Bakr from\nhis father that Abdullah ibn Qays ibn Makhrama told him that Zayd ibn\nKhalid al-Juhani said one night that he was going to observe the\nprayer of the Messenger of Allah, may Allah bless him and grant him\npeace. He said, \"I rested my head on his threshold. The Messenger of\nAllah, may Allah bless him and grant him peace, got up and prayed two\nlong, long, long rakas. Then he prayed two rakas which were slightly\nless long than the two before them. Then he prayed two rakas which\nwere slightly less long than the two before them. Then he prayed two\nrakas which were slightly less long than the two before them. Then he\nprayed two rakas which were slightly less long than the two before\nthem. Then he prayed two rakas which were slightly less long than the\ntwo before them. Then he prayed an odd raka, making thirteen rakas in\nall.\""}},{"id":13,"idInBook":13,"chapterId":7,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، وَعَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَجُلاً، سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ صَلاَةِ اللَّيْلِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ صَلاَةُ اللَّيْلِ مَثْنَى مَثْنَى فَإِذَا خَشِيَ أَحَدُكُمُ الصُّبْحَ صَلَّى رَكْعَةً وَاحِدَةً تُوتِرُ لَهُ مَا قَدْ صَلَّى ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi and Abdullah ibn Umar\nthat a man asked the Messenger of Allah, may Allah bless him and grant\nhim peace, about night prayers. The Messenger of Allah, may Allah\nbless him and grant him peace, said, \"Night prayers are two by two,\nand when you are afraid that dawn is approaching, pray one raka to\nmake what you have prayed odd.\""}},{"id":14,"idInBook":14,"chapterId":7,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، عَنِ ابْنِ مُحَيْرِيزٍ، أَنَّ رَجُلاً، مِنْ بَنِي كِنَانَةَ يُدْعَى الْمُخْدَجِيَّ سَمِعَ رَجُلاً، بِالشَّامِ يُكَنَّى أَبَا مُحَمَّدٍ يَقُولُ إِنَّ الْوِتْرَ وَاجِبٌ ‏.‏ فَقَالَ الْمُخْدَجِيُّ فَرُحْتُ إِلَى عُبَادَةَ بْنِ الصَّامِتِ فَاعْتَرَضْتُ لَهُ وَهُوَ رَائِحٌ إِلَى الْمَسْجِدِ فَأَخْبَرْتُهُ بِالَّذِي قَالَ أَبُو مُحَمَّدٍ فَقَالَ عُبَادَةُ كَذَبَ أَبُو مُحَمَّدٍ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ خَمْسُ صَلَوَاتٍ كَتَبَهُنَّ اللَّهُ عَزَّ وَجَلَّ عَلَى الْعِبَادِ فَمَنْ جَاءَ بِهِنَّ لَمْ يُضَيِّعْ مِنْهُنَّ شَيْئًا اسْتِخْفَافًا بِحَقِّهِنَّ كَانَ لَهُ عِنْدَ اللَّهِ عَهْدٌ أَنْ يُدْخِلَهُ الْجَنَّةَ وَمَنْ لَمْ يَأْتِ بِهِنَّ فَلَيْسَ لَهُ عِنْدَ اللَّهِ عَهْدٌ إِنْ شَاءَ عَذَّبَهُ وَإِنْ شَاءَ أَدْخَلَهُ الْجَنَّةَ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said from Muhammad\nibn Yahya ibn Habban from Ibn Muhayriz that a man from the Kinana\ntribe called al-Mukhdaji heard a man in Syria known as Abu Muhammad\nsaying, \"The witr is obligatory (fard).\" Al-Mukhdaji said, \"I went to\nUbada ibn as-Samit and presented myself to him as he was going to the\nmosque, and told him what Abu Muhammad had said. Ubada said that Abu\nMuhammad had lied and that he had heard the Messenger of Allah, may\nAllah bless him and grant him peace, say, 'Allah the Majestic and\nMighty has written five prayers for mankind, and whoever does them and\ndoes not waste anything of them by making light of what is due to\nthem, there is a pact for him with Allah that He will admit him into\nthe Garden.Whoever does not do them, there is no pact for him with\nAllah. If He wishes, He punishes him, and if He wishes, He admits him\ninto the Garden.' \""}},{"id":15,"idInBook":15,"chapterId":7,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي بَكْرِ بْنِ عُمَرَ، عَنْ سَعِيدِ بْنِ يَسَارٍ، قَالَ كُنْتُ أَسِيرُ مَعَ عَبْدِ اللَّهِ بْنِ عُمَرَ بِطَرِيقِ مَكَّةَ - قَالَ سَعِيدٌ - فَلَمَّا خَشِيتُ الصُّبْحَ نَزَلْتُ فَأَوْتَرْتُ ثُمَّ أَدْرَكْتُهُ فَقَالَ لِي عَبْدُ اللَّهِ بْنُ عُمَرَ أَيْنَ كُنْتَ فَقُلْتُ لَهُ خَشِيتُ الصُّبْحَ فَنَزَلْتُ فَأَوْتَرْتُ ‏.‏ فَقَالَ عَبْدُ اللَّهِ أَلَيْسَ لَكَ فِي رَسُولِ اللَّهِ أُسْوَةٌ ‏.‏ فَقُلْتُ بَلَى وَاللَّهِ ‏.‏ فَقَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُوتِرُ عَلَى الْبَعِيرِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu Bakr ibn Umar that Said\nibn Yasar said, ''I was travelling with Abdullah ibn Umar on the road\nto Makka, and fearing that it was nearly dawn. I dismounted and prayed\nwitr. Abdullah said, 'Is there not a model for you in the Messenger of\nAllah, may Allah bless him and grant him peace?'  I said, 'Of course,\nby Allah!'  He said, 'The Messenger of Allah, may Allah bless him and\ngrant him peace, used to pray witr on his camel.' \""}},{"id":16,"idInBook":16,"chapterId":7,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ قَالَ كَانَ أَبُو بَكْرٍ الصِّدِّيقُ إِذَا أَرَادَ أَنْ يَأْتِيَ، فِرَاشَهُ أَوْتَرَ وَكَانَ عُمَرُ بْنُ الْخَطَّابِ يُوتِرُ آخِرَ اللَّيْلِ قَالَ سَعِيدُ بْنُ الْمُسَيَّبِ فَأَمَّا أَنَا فَإِذَا جِئْتُ فِرَاشِي أَوْتَرْتُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said that Said ibn\nal-Musayyab said, \"Abu Bakr as-Siddiq used to pray witr when he wished\nto go to bed, and Umar ibn al-Khattab used to pray witr at the end of\nthe night. As for me, I pray witr when I go to bed.\""}},{"id":17,"idInBook":17,"chapterId":7,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ رَجُلاً، سَأَلَ عَبْدَ اللَّهِ بْنَ عُمَرَ عَنِ الْوِتْرِ أَوَاجِبٌ هُوَ فَقَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ قَدْ أَوْتَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَوْتَرَ الْمُسْلِمُونَ ‏.‏ فَجَعَلَ الرَّجُلُ يُرَدِّدُ عَلَيْهِ وَعَبْدُ اللَّهِ بْنُ عُمَرَ يَقُولُ أَوْتَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَوْتَرَ الْمُسْلِمُونَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that a man asked\nAbdullah ibn Umar whether the witr was obligatory and Abdullah ibn\nUmar said, \"The Messenger of Allah, may Allah bless him and grant him\npeace, prayed witr, and the muslims prayed witr.\" The man began\nrepeating his question, and Abdullah ibn Umar kept saying, \"The\nMessenger of Allah, may Allah bless him and grant him peace, prayed\nwitr, and the muslims prayed witr.\""}},{"id":18,"idInBook":18,"chapterId":7,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم كَانَتْ تَقُولُ مَنْ خَشِيَ أَنْ يَنَامَ حَتَّى يُصْبِحَ فَلْيُوتِرْ قَبْلَ أَنْ يَنَامَ وَمَنْ رَجَا أَنْ يَسْتَيْقِظَ آخِرَ اللَّيْلِ فَلْيُؤَخِّرْ وِتْرَهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that A'isha, the\nwife of the Prophet, may Allah bless him and grant him peace, used to\nsay, \"If someone fears that he will sleep through till the morning,\nlet him pray the witr before he sleeps, and if some one hopes to wake\nfor the last part of the night, let him delay his witr.\""}},{"id":19,"idInBook":19,"chapterId":7,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّهُ قَالَ كُنْتُ مَعَ عَبْدِ اللَّهِ بْنِ عُمَرَ بِمَكَّةَ وَالسَّمَاءُ مُغِيمَةٌ فَخَشِيَ عَبْدُ اللَّهِ الصُّبْحَ فَأَوْتَرَ بِوَاحِدَةٍ ثُمَّ انْكَشَفَ الْغَيْمُ فَرَأَى أَنَّ عَلَيْهِ لَيْلاً فَشَفَعَ بِوَاحِدَةٍ ثُمَّ صَلَّى بَعْدَ ذَلِكَ رَكْعَتَيْنِ رَكْعَتَيْنِ فَلَمَّا خَشِيَ الصُّبْحَ أَوْتَرَ بِوَاحِدَةٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Nafi said, \"I was with\nAbdullah ibn Umar in Makka. The sky was clouded over and Abdullah\nfeared that dawn was approaching so he prayed one raka for witr. Then\nthe clouds cleared and he saw that it was still night, so he made his\nprayers even with one raka. Then he continued to pray two rakas at a\ntime, until when he feared the approach of dawn, he prayed one raka\nfor witr.\""}},{"id":20,"idInBook":20,"chapterId":7,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يُسَلِّمُ بَيْنَ الرَّكْعَتَيْنِ وَالرَّكْعَةِ فِي الْوِتْرِ حَتَّى يَأْمُرَ بِبَعْضِ حَاجَتِهِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nused to say the taslim between the two rakas and the one raka of witr\nso that he could order something he needed."}},{"id":21,"idInBook":21,"chapterId":7,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ سَعْدَ بْنَ أَبِي وَقَّاصٍ، كَانَ يُوتِرُ بَعْدَ الْعَتَمَةِ بِوَاحِدَةٍ ‏.‏ قَالَ مَالِكٌ وَلَيْسَ عَلَى هَذَا الْعَمَلُ عِنْدَنَا وَلَكِنْ أَدْنَى الْوِتْرِ ثَلاَثٌ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab that Sad ibn Abi\nWaqqas used to pray witr after isha with one raka.\n\n\nMalik\nsaid, \"This is not the situation with us. Rather three is the minimum\nfor witr.\""}},{"id":22,"idInBook":22,"chapterId":7,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقُولُ صَلاَةُالمغرب وتر صلاة النهار ‏.‏ قال مالك من أوتر أول الليل ثم نام ثم قام فبدا له أن يصلي فليصل مثنى مثنى فهو أحب ما سمعت إلى ‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abdullah ibn Dinar that\nAbdullah ibn Umar used to say, \"The maghrib prayer is the witr of the\ndaytime prayers.\"\n\n\nMalik said, \"If someone prays witr at the\nbeginning of the night, and goes to sleep, and then wakes up and it\nseems good to him to pray, let him pray, two rakas at a time. That is\nwhat I like most of what I have heard.\""}},{"id":23,"idInBook":23,"chapterId":7,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ الْكَرِيمِ بْنِ أَبِي الْمُخَارِقِ الْبَصْرِيِّ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، رَقَدَ ثُمَّ اسْتَيْقَظَ فَقَالَ لِخَادِمِهِ انْظُرْ مَا صَنَعَ النَّاسُ ‏.‏ وَهُوَ يَوْمَئِذٍ قَدْ ذَهَبَ بَصَرُهُ ‏.‏ فَذَهَبَ الْخَادِمُ ثُمَّ رَجَعَ فَقَالَ قَدِ انْصَرَفَ النَّاسُ مِنَ الصُّبْحِ ‏.‏ فَقَامَ عَبْدُ اللَّهِ بْنُ عَبَّاسٍ فَأَوْتَرَ ثُمَّ صَلَّى الصُّبْحَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abd al Karim ibn\nAbi'l-Mukhariq al-Basri from Said ibn Jubayr that Abdullah ibn Abbas\nslept, and when he woke up, he said to his servant, \"Go and see what\nthe people have done,\" (by that time his sight had gone.) The servant\nwent out and returned saying, \"The people have left from subh,\" so\nAbdullah ibn Abbas got up and prayed witr and then prayed subh."}},{"id":24,"idInBook":24,"chapterId":7,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، وَعُبَادَةَ بْنَ الصَّامِتِ، وَالْقَاسِمَ بْنَ مُحَمَّدٍ، وَعَبْدَ اللَّهِ بْنَ عَامِرِ بْنِ رَبِيعَةَ، قَدْ أَوْتَرُوا بَعْدَ الْفَجْرِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Abdullah\nibn Abbas and Ubada ibn as-Samit and al-Qasim ibn Muhammad and\nAbdullah ibn Amir ibn Rabia had all prayed witr after the break of\ndawn."}},{"id":25,"idInBook":25,"chapterId":7,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ، قَالَ مَا أُبَالِي لَوْ أُقِيمَتْ صَلاَةُ الصُّبْحِ وَأَنَا أُوتِرُ، ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa from his\nfather that Abdullah ibn Masud said, \"I do not mind if the iqama for\nthe subh prayer is called while I am still praying witr.\""}},{"id":26,"idInBook":26,"chapterId":7,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ قَالَ كَانَ عُبَادَةُ بْنُ الصَّامِتِ يَؤُمُّ قَوْمًا فَخَرَجَ يَوْمًا إِلَى الصُّبْحِ فَأَقَامَ الْمُؤَذِّنُ صَلاَةَ الصُّبْحِ فَأَسْكَتَهُ عُبَادَةُ حَتَّى أَوْتَرَ ثُمَّ صَلَّى بِهِمُ الصُّبْحَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Yahya ibn Said said, ''Ubada\nibn as-Samit used to lead the people in prayer. One day he came out\nfor subh and the muadhdhin began to give the iqama for the subh prayer\nUbada silenced him, prayed witr and then led them in subh.\""}},{"id":27,"idInBook":27,"chapterId":7,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، أَنَّهُ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عَامِرِ بْنِ رَبِيعَةَ، يَقُولُ إِنِّي لأُوتِرُ وَأَنَا أَسْمَعُ الإِقَامَةَ، أَوْ بَعْدَ الْفَجْرِ ‏.‏ يَشُكُّ عَبْدُ الرَّحْمَنِ أَىَّ ذَلِكَ قَالَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Abd ar-Rahman ibn al-Qasim\nsaid, \"I heard Abdullah ibn Amir ibn Rabia say, 'I sometimes pray witr\nwhile hearing the iqama, or after the break of dawn.' \" Abd ar-Rahman\nwas not certain which he said."}},{"id":28,"idInBook":28,"chapterId":7,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، أَنَّهُ سَمِعَ أَبَاهُ الْقَاسِمَ بْنَ مُحَمَّدٍ، يَقُولُ إِنِّي لأُوتِرُ بَعْدَ الْفَجْرِ ‏.‏ قَالَ مَالِكٌ وَإِنَّمَا يُوتِرُ بَعْدَ الْفَجْرِ مَنْ نَامَ عَنِ الْوِتْرِ وَلاَ يَنْبَغِي لأَحَدٍ أَنْ يَتَعَمَّدَ ذَلِكَ حَتَّى يَضَعَ وِتْرَهُ بَعْدَ الْفَجْرِ ‏.‏","english":{"narrator":"","text":"Malik related to me that Abd ar-Rahman ibn al-Qasim heard his\nfather al-Qasim ibn Muhammad say, \"I have prayed witr after dawn.\"\n\n\nMalik said, \"Only a person who oversleeps so that he does not\ndo the witr prays it after dawn. No one should intentionally make his\nwitr after dawn.\""}},{"id":29,"idInBook":29,"chapterId":7,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ حَفْصَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم أَخْبَرَتْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا سَكَتَ الْمُؤَذِّنُ عَنِ الأَذَانِ لِصَلاَةِ الصُّبْحِ صَلَّى رَكْعَتَيْنِ خَفِيفَتَيْنِ قَبْلَ أَنْ تُقَامَ الصَّلاَةُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat Hafsa, the wife of the Prophet, may Allah bless him and grant him\npeace, told him that the Messenger of Allah, may Allah bless him and\ngrant him peace, used to pray two quick rakas when the muadhdhin had\nfinished the adhan for the subh prayer, before the iqama was said for\nthe prayer."}},{"id":30,"idInBook":30,"chapterId":7,"bookId":7,"arabic":"وَحَدَّثَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَالَتْ إِنْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم لَيُخَفِّفُ رَكْعَتَىِ الْفَجْرِ حَتَّى إِنِّي لأَقُولُ أَقَرَأَ بِأُمِّ الْقُرْآنِ أَمْ لاَ","english":{"narrator":"","text":"Malik related to me from Yahya ibn Said that A'isha, the wife of\nthe Prophet, may Allah bless him and grant him peace, said, \"The\nMessenger of Allah, may Allah bless him and grant him peace, used to\npray the two rakas of the dawn (fajr) so quickly that I would say to\nmyself  'Has he recited the umm al-Qur'an or not?' \""}},{"id":31,"idInBook":31,"chapterId":7,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ شَرِيكِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي نَمِرٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّهُ قَالَ سَمِعَ قَوْمٌ الإِقَامَةَ، فَقَامُوا يُصَلُّونَ فَخَرَجَ عَلَيْهِمْ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ أَصَلاَتَانِ مَعًا أَصَلاَتَانِ مَعًا ‏\"‏ ‏.‏ وَذَلِكَ فِي صَلاَةِ الصُّبْحِ فِي الرَّكْعَتَيْنِ اللَّتَيْنِ قَبْلَ الصُّبْحِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Sharik ibn Abdullah ibn Abi\nNamir that Abu Salama ibn Abd ar-Rahman said, \"Some people heard the\niqama and started to pray. The Messenger of Allah, may Allah bless him\nand grant him peace, came out and said, 'Are you doing two prayers at\nthe same time? Are you doing two prayers at the same time?'  That was\nabout the subh prayer and the two rakas before subh.\""}},{"id":32,"idInBook":32,"chapterId":7,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، فَاتَتْهُ رَكْعَتَا الْفَجْرِ فَقَضَاهُمَا بَعْدَ أَنْ طَلَعَتِ الشَّمْسُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Abdullah\nibn Umar missed the two rakas of dawn, and then did them after the sun\nrose."}},{"id":33,"idInBook":33,"chapterId":7,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، أَنَّهُ صَنَعَ مِثْلَ الَّذِي صَنَعَ ابْنُ عُمَرَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abd ar-Rahman ibn al-Qasim\nthat al-Qasim ibn Muhammad had done the same as Ibn Umar."}}],"chapter":{"id":7,"bookId":7,"arabic":"كتاب صلاة الليل","english":"Tahajjud"}}