{"metadata":{"length":104,"arabic":{"title":"موطأ مالك","author":"الإمام مالك بن أنس","introduction":"كتاب قصر الصلاة فى السفر"},"english":{"title":"Muwatta Malik","author":"Imam Malik ibn Anas","introduction":"Shortening the Prayer"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":9,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ دَاوُدَ بْنِ الْحُصَيْنِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَجْمَعُ بَيْنَ الظُّهْرِ وَالْعَصْرِ فِي سَفَرِهِ إِلَى تَبُوكَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Da'ud ibn al-Husayn from al-\nAraj from Abu Hurayra that the Messenger of Allah, may Allah bless him\nand grant him peace, joined dhuhr and asr on his journey to Tabuk."}},{"id":2,"idInBook":2,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزُّبَيْرِ الْمَكِّيِّ، عَنْ أَبِي الطُّفَيْلِ، عَامِرِ بْنِ وَاثِلَةَ أَنَّ مُعَاذَ بْنَ جَبَلٍ، أَخْبَرَهُ أَنَّهُمْ، خَرَجُوا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم عَامَ تَبُوكَ فَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَجْمَعُ بَيْنَ الظُّهْرِ وَالْعَصْرِ وَالْمَغْرِبِ وَالْعِشَاءِ - قَالَ - فَأَخَّرَ الصَّلاَةَ يَوْمًا ثُمَّ خَرَجَ فَصَلَّى الظُّهْرَ وَالْعَصْرَ جَمِيعًا ثُمَّ دَخَلَ ثُمَّ خَرَجَ فَصَلَّى الْمَغْرِبَ وَالْعِشَاءَ جَمِيعًا ثُمَّ قَالَ ‏\"‏ إِنَّكُمْ سَتَأْتُونَ غَدًا إِنْ شَاءَ اللَّهُ عَيْنَ تَبُوكَ وَإِنَّكُمْ لَنْ تَأْتُوهَا حَتَّى يَضْحَى النَّهَارُ فَمَنْ جَاءَهَا فَلاَ يَمَسَّ مِنْ مَائِهَا شَيْئًا حَتَّى آتِيَ ‏\"‏ ‏.‏ فَجِئْنَاهَا وَقَدْ سَبَقَنَا إِلَيْهَا رَجُلاَنِ وَالْعَيْنُ تَبِضُّ بِشَىْءٍ مِنْ مَاءٍ فَسَأَلَهُمَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَلْ مَسِسْتُمَا مِنْ مَائِهَا شَيْئًا ‏\"‏ ‏.‏ فَقَالاَ نَعَمْ ‏.‏ فَسَبَّهُمَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَالَ لَهُمَا مَا شَاءَ اللَّهُ أَنْ يَقُولَ ثُمَّ غَرَفُوا بِأَيْدِيهِمْ مِنَ الْعَيْنِ قَلِيلاً قَلِيلاً حَتَّى اجْتَمَعَ فِي شَىْءٍ ثُمَّ غَسَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِيهِ وَجْهَهُ وَيَدَيْهِ ثُمَّ أَعَادَهُ فِيهَا فَجَرَتِ الْعَيْنُ بِمَاءٍ كَثِيرٍ فَاسْتَقَى النَّاسُ ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يُوشِكُ يَا مُعَاذُ إِنْ طَالَتْ بِكَ حَيَاةٌ أَنْ تَرَى هَا هُنَا قَدْ مُلِئَ جِنَانًا ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'z-Zubayr al-Makki from\nAbu't-Tufayl Amir ibn Wathila that Muadh ibn Jabal told him that they\nwent out with the Messenger of Allah, may Allah bless him and grant\nhim peace, in the year of Tabuk, and the Messenger of Allah, may Allah\nbless him and grant him peace, joined dhuhr with asr and maghrib with\nisha. Muadh said, \"One day he delayed the prayer, and then came out\nand prayed dhuhr and asr together. Then he said, 'Tomorrow you will\ncome, insha' llah, to the spring of Tabuk. But you will not get there\nuntil well into the morning. No one who arrives should touch any of\nits water until I come.' We came to it and two men had got to it\nbefore us and the spring was dripping with a little water. The\nMessenger of Allah, may Allah bless him and grant him peace, asked\nthem, 'Have you touched any of its water?' They said, 'Yes.' The\nMessenger of Allah, may Allah bless him and grant him peace, reviled\nthem and said what Allah wished him to say. Then they took water with\ntheir hands from the spring little by little until it had been\ncollected in something. Then the Messenger of Allah, may Allah bless\nhim and grant him peace, washed his face and hands in it. Then he put\nit back into the spring and the spring flowed with an abundance of\nwater and the people drew water from it. The Messenger of Allah, may\nAllah bless him and grant him peace, said, 'If you live long enough,\nMuadh, you will soon see this place filled with gardens.' \""}},{"id":3,"idInBook":3,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا عَجِلَ بِهِ السَّيْرُ يَجْمَعُ بَيْنَ الْمَغْرِبِ وَالْعِشَاءِ ‏.‏","english":{"narrator":"","text":"3 Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nsaid, \"The Messenger of Allah, may Allah bless him and grant him\npeace, used to join maghrib and isha together when it was urgent to\ntravel.\""}},{"id":4,"idInBook":4,"chapterId":9,"bookId":7,"arabic":"حَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزُّبَيْرِ الْمَكِّيِّ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، أَنَّهُ قَالَ صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم الظُّهْرَ وَالْعَصْرَ جَمِيعًا وَالْمَغْرِبَ وَالْعِشَاءَ جَمِيعًا فِي غَيْرِ خَوْفٍ وَلاَ سَفَرٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'z Zubayr al-Makki from Said ibn Jubayr that Abdullah ibn Abbas said, \"The Messenger of Allah, may Allah bless him and grant him peace, prayed dhuhr and asr together and maghrib and isha together, and not out of fear nor because of travelling.\""}},{"id":5,"idInBook":5,"chapterId":9,"bookId":7,"arabic":"","english":{"narrator":"","text":"(with regards to above) Malik said, \"I believe that was during rain.\""}},{"id":6,"idInBook":6,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ إِذَا جَمَعَ الأُمَرَاءُ بَيْنَ الْمَغْرِبِ وَالْعِشَاءِ فِي الْمَطَرِ جَمَعَ مَعَهُمْ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nused to join the prayer along with the amirs if they joined maghrib\nand isha in the rain."}},{"id":7,"idInBook":7,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، أَنَّهُ سَأَلَ سَالِمَ بْنَ عَبْدِ اللَّهِ هَلْ يُجْمَعُ بَيْنَ الظُّهْرِ وَالْعَصْرِ فِي السَّفَرِ فَقَالَ نَعَمْ لاَ بَأْسَ بِذَلِكَ أَلَمْ تَرَ إِلَى صَلاَةِ النَّاسِ بِعَرَفَةَ","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab that he had asked\nSalim ibn Abdullah, \"Can you join dhuhr and asr when travelling?\" He\nsaid, \"Yes, there is no harm in that. Haven't you seen the people pray\non Arafa?\""}},{"id":8,"idInBook":8,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ عَنْ عَلِيِّ بْنِ حُسَيْنٍ، أَنَّهُ كَانَ يَقُولُ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا أَرَادَ أَنْ يَسِيرَ يَوْمَهُ جَمَعَ بَيْنَ الظُّهْرِ وَالْعَصْرِ وَإِذَا أَرَادَ أَنْ يَسِيرَ لَيْلَهُ جَمَعَ بَيْنَ الْمَغْرِبِ وَالْعِشَاءِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that AIi ibn\nHusain used to say, \"The Messenger of Allah, may Allah bless him and\ngrant him peace, would join dhuhr and asr if he wished to travel the\nsame day, and he would join maghrib and isha if he wished to travel\nthe same night.\""}},{"id":9,"idInBook":9,"chapterId":9,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ رَجُلٍ، مِنْ آلِ خَالِدِ بْنِ أَسِيدٍ أَنَّهُ سَأَلَ عَبْدَ اللَّهِ بْنَ عُمَرَ فَقَالَ يَا أَبَا عَبْدِ الرَّحْمَنِ إِنَّا نَجِدُ صَلاَةَ الْخَوْفِ وَصَلاَةَ الْحَضَرِ فِي الْقُرْآنِ وَلاَ نَجِدُ صَلاَةَ السَّفَرِ فَقَالَ ابْنُ عُمَرَ يَا ابْنَ أَخِي إِنَّ اللَّهَ عَزَّ وَجَلَّ بَعَثَ إِلَيْنَا مُحَمَّدًا صلى الله عليه وسلم وَلاَ نَعْلَمُ شَيْئًا فَإِنَّمَا نَفْعَلُ كَمَا رَأَيْنَاهُ يَفْعَلُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from a man of the\nfamily of Khalid ibn Asid that he said to Abdullah ibn Umar, \"Abu Abd\nar-Rahman, we find the fear prayer and the prayer when settled\nmentioned in the Qur'an, but we do not find any mention of the\ntravelling prayer in it.\" Ibn Umar said, \"Son of my brother!  Allah\nthe Mighty and Majestic sent us Muhammad, may Allah bless him and\ngrant him peace, and we know nothing. We only do as we saw him doing.\""}},{"id":10,"idInBook":10,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ صَالِحِ بْنِ كَيْسَانَ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ فُرِضَتِ الصَّلاَةُ رَكْعَتَيْنِ رَكْعَتَيْنِ فِي الْحَضَرِ وَالسَّفَرِ فَأُقِرَّتْ صَلاَةُ السَّفَرِ وَزِيدَ فِي صَلاَةِ الْحَضَرِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Salih ibn Kaysan from Urwa\nibn az-Zubayr that A'isha, the wife of the Prophet, may Allah bless\nhim and grant him peace, said, \"The prayer was prescribed as two\nrakas, both when settled and when travelling. Then the travelling\nprayer was kept as it was, and an increase was made in the prayer when\nsettled. \""}},{"id":11,"idInBook":11,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ قَالَ لِسَالِمِ بْنِ عَبْدِ اللَّهِ مَا أَشَدَّ مَا رَأَيْتَ أَبَاكَ أَخَّرَ الْمَغْرِبَ فِي السَّفَرِ فَقَالَ سَالِمٌ غَرَبَتِ الشَّمْسُ وَنَحْنُ بِذَاتِ الْجَيْشِ فَصَلَّى الْمَغْرِبَ بِالْعَقِيقِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said that he said\nto Salim ibn Abdullah, \"What is the latest you have seen your father\ndelay maghrib while on a journey?\" and Salim replied, \"One time the\nsun set when we were at Dhat al-Jaysh and he prayed maghrib at al-\nAqiq.\""}},{"id":12,"idInBook":12,"chapterId":9,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ إِذَا خَرَجَ حَاجًّا أَوْ مُعْتَمِرًا قَصَرَ الصَّلاَةَ بِذِي الْحُلَيْفَةِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar,\nshortened the prayer when he left for hajj or umra at Dhu'l Hulayfa."}},{"id":13,"idInBook":13,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِيهِ، أَنَّهُ رَكِبَ إِلَى رِيمٍ فَقَصَرَ الصَّلاَةَ فِي مَسِيرِهِ ذَلِكَ ‏.‏ قَالَ مَالِكٌ وَذَلِكَ نَحْوٌ مِنْ أَرْبَعَةِ بُرُدٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Salim ibn\nAbdullah that his father rode to Rim and shortened the prayer on the\njourney.\n\n\nMalik said, \"That was about four mail-stages.\"\n(approximately forty-eight miles)."}},{"id":14,"idInBook":14,"chapterId":9,"bookId":7,"arabic":"حَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، رَكِبَ إِلَى ذَاتِ النُّصُبِ فَقَصَرَ الصَّلاَةَ فِي مَسِيرِهِ ذَلِكَ ‏.‏ قَالَ مَالِكٌ وَبَيْنَ ذَاتِ النُّصُبِ وَالْمَدِينَةِ أَرْبَعَةُ بُرُدٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi from Salim ibn Abdullah\nthat Abdullah ibn Umar rode to Dhat an-Nusub and shortened the prayer\non the journey.\n\n\nMalik said, \"There are four mail-stages\nbetween Dhat an-Nusub and Madina.\""}},{"id":15,"idInBook":15,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّهُ كَانَ يُسَافِرُ إِلَى خَيْبَرَ فَيَقْصُرُ الصَّلاَةَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi from Ibn Umar that he\nused to travel to Khaybar and he would shorten the prayer."}},{"id":16,"idInBook":16,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقْصُرُ الصَّلاَةَ فِي مَسِيرِهِ الْيَوْمَ التَّامَّ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Salim ibn\nAbdullah that Abdullah ibn Umar used to shorten the prayer when he\ntravelled for a whole day."}},{"id":17,"idInBook":17,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّهُ كَانَ يُسَافِرُ مَعَ ابْنِ عُمَرَ الْبَرِيدَ فَلاَ يَقْصُرُ الصَّلاَةَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that he used to travel\none mail-stage with Ibn Umar, and he would not shorten the prayer."}},{"id":18,"idInBook":18,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، كَانَ يَقْصُرُ الصَّلاَةَ فِي مِثْلِ مَا بَيْنَ مَكَّةَ وَالطَّائِفِ وَفِي مِثْلِ مَا بَيْنَ مَكَّةَ وَعُسْفَانَ وَفِي مِثْلِ مَا بَيْنَ مَكَّةَ وَجُدَّةَ ‏.‏ قَالَ مَالِكٌ وَذَلِكَ أَرْبَعَةُ بُرُدٍ وَذَلِكَ أَحَبُّ مَا تُقْصَرُ إِلَىَّ فِيهِ الصَّلاَةُ ‏.‏ قَالَ مَالِكٌ لاَ يَقْصُرُ الَّذِي يُرِيدُ السَّفَرَ الصَّلاَةَ حَتَّى يَخْرُجَ مِنْ بُيُوتِ الْقَرْيَةِ وَلاَ يُتِمُّ حَتَّى يَدْخُلَ أَوَّلَ بُيُوتِ الْقَرْيَةِ أَوْ يُقَارِبُ ذَلِكَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Abdullah\nibn Abbas used to shorten the prayer when he travelled a distance\nequivalent to that between Makka and Ta'if, and that between Makka and\nUsfan and that between Makka and Jedda.\n\n\nMalik said, \"That is\nfour mail-stages, and to me that is the most preferable distance for\nshortening the prayer.\"\n\n\nMalik said, \"Someone who intends to\ntravel does not shorten the prayer until he has left the houses of the\nvillage. And he does not do it in full until he comes to the first\nhouses of the village, or is nearby.\""}},{"id":19,"idInBook":19,"chapterId":9,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقُولُ أُصَلِّي صَلاَةَ الْمُسَافِرِ مَا لَمْ أُجْمِعْ مُكْثًا وَإِنْ حَبَسَنِي ذَلِكَ اثْنَتَىْ عَشْرَةَ لَيْلَةً ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Salim ibn\nAbdullah that Abdullah ibn Umar used to say, \"I pray the prayerof a\ntraveller as long as I am undecided whether to remain somewhere or\nnot, even if I am detained for twelve nights.\""}},{"id":20,"idInBook":20,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ ابْنَ عُمَرَ، أَقَامَ بِمَكَّةَ عَشْرَ لَيَالٍ يَقْصُرُ الصَّلاَةَ إِلاَّ أَنْ يُصَلِّيَهَا مَعَ الإِمَامِ فَيُصَلِّيهَا بِصَلاَتِهِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Ibn Umar stayed in\nMakka for ten nights, shortening the prayer, except when he prayed it\nbehind an imam, in which case he followed the imam's prayer."}},{"id":21,"idInBook":21,"chapterId":9,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَطَاءٍ الْخُرَاسَانِيِّ، أَنَّهُ سَمِعَ سَعِيدَ بْنَ الْمُسَيَّبِ، قَالَ مَنْ أَجْمَعَ إِقَامَةً أَرْبَعَ لَيَالٍ وَهُوَ مُسَافِرٌ أَتَمَّ الصَّلاَةَ ‏.‏ قَالَ مَالِكٌ وَذَلِكَ أَحَبُّ مَا سَمِعْتُ إِلَىَّ ‏.‏ وَسُئِلَ مَالِكٌ عَنْ صَلاَةِ الأَسِيرِ فَقَالَ مِثْلُ صَلاَةِ الْمُقِيمِ إِلاَّ أَنْ يَكُونَ مُسَافِرًا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ata al-Khurasani that he\nheard Said ibn al Musayyab say, \"A traveller who has decided to remain\nsomewhere for four nights does the prayer in full.\"\n\n\nMalik\nsaid, \"That is what I prefer most out of what I have heard.\"\n\n\nMalik when asked about the prayer of a prisoner, said, \"It is the same\nas the prayer of a person who remains in one place, except if he is\ntravelling.\""}},{"id":22,"idInBook":22,"chapterId":9,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِيهِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، كَانَ إِذَا قَدِمَ مَكَّةَ صَلَّى بِهِمْ رَكْعَتَيْنِ ثُمَّ يَقُولُ يَا أَهْلَ مَكَّةَ أَتِمُّوا صَلاَتَكُمْ فَإِنَّا قَوْمٌ سَفْرٌ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Salim ibn Abdullah from his father that Umar ibn al-Khattab, when he went to Makka, used to lead them in prayer and do two rakas and then say, \"People of Makka,complete the prayer, we are a group travelling.\""}},{"id":23,"idInBook":23,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَبِيهِ، عَنْ عُمَرَ بْنِ الْخَطَّابِ، مِثْلَ ذَلِكَ ‏.‏","english":{"narrator":"","text":"Yahya related the same as that to me from Malik from Zayd ibn Aslam from his father from Umar ibn al-Khattab."}},{"id":24,"idInBook":24,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يُصَلِّي وَرَاءَ الإِمَامِ بِمِنًى أَرْبَعًا فَإِذَا صَلَّى لِنَفْسِهِ صَلَّى رَكْعَتَيْنِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nused to pray four rakas behind the imam at Mina, and when he prayed by\nhimself he would pray two rakas."}},{"id":25,"idInBook":25,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ صَفْوَانَ، أَنَّهُ قَالَ جَاءَ عَبْدُ اللَّهِ بْنُ عُمَرَ يَعُودُ عَبْدَ اللَّهِ بْنَ صَفْوَانَ فَصَلَّى لَنَا رَكْعَتَيْنِ ثُمَّ انْصَرَفَ فَقُمْنَا فَأَتْمَمْنَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab that Safwan said,\n\"Abdullah ibn Umar used to come and visit Abdullah ibn Safwan and he\nwould pray two rakas with us, and when he went away we would stand and\ncomplete the prayer.\""}},{"id":26,"idInBook":26,"chapterId":9,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ لَمْ يَكُنْ يُصَلِّي مَعَ صَلاَةِ الْفَرِيضَةِ فِي السَّفَرِ شَيْئًا قَبْلَهَا وَلاَ بَعْدَهَا إِلاَّ مِنْ جَوْفِ اللَّيْلِ فَإِنَّهُ كَانَ يُصَلِّي عَلَى الأَرْضِ وَعَلَى رَاحِلَتِهِ حَيْثُ تَوَجَّهَتْ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nnever used to pray anything with the fard prayer, either before it or\nafter it, while travelling, except in the depths of the night. He\nwould pray on the ground or on his mount, whichever way it was facing."}},{"id":27,"idInBook":27,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ الْقَاسِمَ بْنَ مُحَمَّدٍ، وَعُرْوَةَ بْنَ الزُّبَيْرِ، وَأَبَا، بَكْرِ بْنَ عَبْدِ الرَّحْمَنِ كَانُوا يَتَنَفَّلُونَ فِي السَّفَرِ ‏.‏ قَالَ يَحْيَى وَسُئِلَ مَالِكٌ عَنِ النَّافِلَةِ فِي السَّفَرِ فَقَالَ لاَ بَأْسَ بِذَلِكَ بِاللَّيْلِ وَالنَّهَارِ وَقَدْ بَلَغَنِي أَنَّ بَعْضَ أَهْلِ الْعِلْمِ كَانَ يَفْعَلُ ذَلِكَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that al-Qasim\nibn Muhammad and Urwa ibn az-Zubayr and Abu Bakr ibn Abd ar Rahman\nused to pray nawafil when travelling.\n\n\nYahya said that Malik\nwas asked about voluntary prayers when travelling and he said, \"There\nis no harm in them, either at night or during the day. I have heard\nthat some of the people of knowledge used to do that.\""}},{"id":28,"idInBook":28,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، قَالَ بَلَغَنِي عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَرَى ابْنَهُ عُبَيْدَ اللَّهِ بْنَ عَبْدِ اللَّهِ يَتَنَفَّلُ فِي السَّفَرِ فَلاَ يُنْكِرُ عَلَيْهِ ‏.‏","english":{"narrator":"","text":"Yahya related to me that Malik said, \"I have heard from Nafi that\nAbdullah ibn Umar used to see his son, Ubaydullah ibn Abdullah, doing\nvoluntary prayers on a journey,and he would not disapprove of it.\""}},{"id":29,"idInBook":29,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَمْرِو بْنِ يَحْيَى الْمَازِنِيِّ، عَنْ أَبِي الْحُبَابِ، سَعِيدِ بْنِ يَسَارٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يُصَلِّي وَهُوَ عَلَى حِمَارٍ وَهُوَ مُتَوَجِّهٌ إِلَى خَيْبَرَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Amr ibn Yahya al-Mazini from\nAbu'l-Hubab Said ibn Yasar that Abdullah ibn Umar said, \"I saw the\nMessenger of Allah, may Allah bless him and grant him peace, praying\non a donkey while heading towards Khaybar.\""}},{"id":30,"idInBook":30,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُصَلِّي عَلَى رَاحِلَتِهِ فِي السَّفَرِ حَيْثُ تَوَجَّهَتْ بِهِ ‏.‏ قَالَ عَبْدُ اللَّهِ بْنُ دِينَارٍ وَكَانَ عَبْدُ اللَّهِ بْنُ عُمَرَ يَفْعَلُ ذَلِكَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abdullah ibn Dinar from\nAbdullah ibn Umar that the Messenger of Allah, may Allah bless him and\ngrant him peace, used to pray on his mount while travelling, whichever\nway it was facing. Abdullah ibn Dinar said, \"Abdullah ibn Umar would\nalso do that.\""}},{"id":31,"idInBook":31,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، قَالَ رَأَيْتُ أَنَسَ بْنَ مَالِكٍ فِي السَّفَرِ وَهُوَ يُصَلِّي عَلَى حِمَارٍ وَهُوَ مُتَوَجِّهٌ إِلَى غَيْرِ الْقِبْلَةِ يَرْكَعُ وَيَسْجُدُ إِيمَاءً مِنْ غَيْرِ أَنْ يَضَعَ وَجْهَهُ عَلَى شَىْءٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Yahya ibn Said said, \"I saw\nAnas ibn Malik on a journey praying on a donkey facing away from the\nqibla. He did the raka and the sajda by motioning with his head,\nwithout putting his face on anything.\""}},{"id":32,"idInBook":32,"chapterId":9,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ مُوسَى بْنِ مَيْسَرَةَ، عَنْ أَبِي مُرَّةَ، مَوْلَى عَقِيلِ بْنِ أَبِي طَالِبٍ أَنَّ أُمَّ هَانِئٍ بِنْتَ أَبِي طَالِبٍ، أَخْبَرَتْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم صَلَّى عَامَ الْفَتْحِ ثَمَانِيَ رَكَعَاتٍ مُلْتَحِفًا فِي ثَوْبٍ وَاحِدٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Musa ibn Maysara from Abu\nMurra, the mawla of Aqil ibn Abi Talib, that Umm Hani bint Abi Talib\ntold him that in the year of the conquest the Messenger of Allah, may\nAllah bless him and grant him peace, prayed eight rakas, covering\nhimself with one garment."}},{"id":33,"idInBook":33,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي النَّضْرِ، مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ أَنَّ أَبَا مُرَّةَ، مَوْلَى عَقِيلِ بْنِ أَبِي طَالِبٍ أَخْبَرَهُ أَنَّهُ، سَمِعَ أُمَّ هَانِئٍ بِنْتَ أَبِي طَالِبٍ، تَقُولُ ذَهَبْتُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم عَامَ الْفَتْحِ فَوَجَدْتُهُ يَغْتَسِلُ وَفَاطِمَةُ ابْنَتُهُ تَسْتُرُهُ بِثَوْبٍ - قَالَتْ - فَسَلَّمْتُ عَلَيْهِ فَقَالَ ‏\"‏ مَنْ هَذِهِ ‏\"‏ ‏.‏ فَقُلْتُ أُمُّ هَانِئٍ بِنْتُ أَبِي طَالِبٍ ‏.‏ فَقَالَ ‏\"‏ مَرْحَبًا بِأُمِّ هَانِئٍ ‏\"‏ ‏.‏ فَلَمَّا فَرَغَ مِنْ غُسْلِهِ قَامَ فَصَلَّى ثَمَانِيَ رَكَعَاتٍ مُلْتَحِفًا فِي ثَوْبٍ وَاحِدٍ ثُمَّ انْصَرَفَ فَقُلْتُ يَا رَسُولَ اللَّهِ زَعَمَ ابْنُ أُمِّي عَلِيٌّ أَنَّهُ قَاتِلٌ رَجُلاً أَجَرْتُهُ فُلاَنُ بْنُ هُبَيْرَةَ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ قَدْ أَجَرْنَا مَنْ أَجَرْتِ يَا أُمَّ هَانِئٍ ‏\"‏ ‏.‏ قَالَتْ أُمُّ هَانِئٍ وَذَلِكَ ضُحًى ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'n Nadr, the mawla of Umar\nibn Ubaydullah, that Abu Murra, the mawla of Aqil ibn Abi Talib, told\nhim that he had heard Umm Hani bint Abi Talib say, \"I went to the\nMessenger of Allah, may Allah bless him and grant him peace, in the\nyear of the conquest and found him doing ghusl while his daughter\nFatima, was screening him with a garment. I said to him, 'Peace be\nupon you' and he said, 'Who is that?' I replied, 'Umm Hani bint Abi\nTalib,' and he said, 'Welcome, Umm Hani!'  When he had finished his\nghusl, he stood and prayed eight rakas, covering himself with one\ngarment, and then came away. I said, 'Messenger of Allah, the son of\nmy mother, AIi, says that he is determined to kill so-and-so, son of\nHubayra, a man I have placed under my protection.'  The Messenger of\nAllah, may Allah bless him and grant him peace, said, 'We give\nprotection to whoever you have given protection to, Umm Hani.' \"\n\n\nUmm Hani related that this incident happened in the morning."}},{"id":34,"idInBook":34,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ مَا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يُصَلِّي سُبْحَةَ الضُّحَى قَطُّ وَإِنِّي لأُسَبِّحُهَا وَإِنْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم لَيَدَعُ الْعَمَلَ وَهُوَ يُحِبُّ أَنْ يَعْمَلَهُ خَشْيَةَ أَنْ يَعْمَلَ بِهِ النَّاسُ فَيُفْرَضَ عَلَيْهِمْ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Urwa ibn az-\nZubayr that A'isha, the wife of the Prophet, may Allah bless him and\ngrant him peace, said, \"I never once saw the Messenger of Allah, may\nAllah bless him and grant him peace, doing the voluntary prayer of\nduha, but I myself do it. Sometimes the Messenger of Allah, may Allah\nbless him and grant him peace, would refrain from a practice that he\nloved to do, fearing that people would do the same and it would become\nfard for them .\""}},{"id":35,"idInBook":35,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَائِشَةَ، أَنَّهَا كَانَتْ تُصَلِّي الضُّحَى ثَمَانِيَ رَكَعَاتٍ ثُمَّ تَقُولُ لَوْ نُشِرَ لِي أَبَوَاىَ مَا تَرَكْتُهُنَّ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Zayd ibn Aslam from A'isha\nthat she used to pray duha with eight rakas, and she would say, \"I\nwould never stop doing them even if my parents were to be brought back\nto life.\""}},{"id":36,"idInBook":36,"chapterId":9,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ جَدَّتَهُ، مُلَيْكَةَ دَعَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم لِطَعَامٍ فَأَكَلَ مِنْهُ ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ قُومُوا فَلأُصَلِّيَ لَكُمْ ‏\"‏ ‏.‏ قَالَ أَنَسٌ فَقُمْتُ إِلَى حَصِيرٍ لَنَا قَدِ اسْوَدَّ مِنْ طُولِ مَا لُبِسَ فَنَضَحْتُهُ بِمَاءٍ فَقَامَ عَلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم وَصَفَفْتُ أَنَا وَالْيَتِيمُ وَرَاءَهُ وَالْعَجُوزُ مِنْ وَرَائِنَا فَصَلَّى لَنَا رَكْعَتَيْنِ ثُمَّ انْصَرَفَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ishaq ibn Abdullah ibn Abi\nTalha from Anas ibn Malik that his grandmother, Mulayka, invited the\nMessenger of Allah, may Allah bless him and grant him peace, for food\nand he ate some of it. Then the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"Get up and I will lead you in prayer.\"\n\n\nAnas said, \"I stood up and took a woven mat belonging to us\nthat had become black through long use and sprinkled it with water,\nand the Messengerof Allah, may Allah bless him and grant him peace,\nstood on it. The orphan and I formed a row behind him, and the old\nwoman stood behind us. He prayed two rakas with us and then left.\""}},{"id":37,"idInBook":37,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، أَنَّهُ قَالَ دَخَلْتُ عَلَى عُمَرَ بْنِ الْخَطَّابِ بِالْهَاجِرَةِ فَوَجَدْتُهُ يُسَبِّحُ فَقُمْتُ وَرَاءَهُ فَقَرَّبَنِي حَتَّى جَعَلَنِي حِذَاءَهُ عَنْ يَمِينِهِ فَلَمَّا جَاءَ يَرْفَأُ تَأَخَّرْتُ فَصَفَفْنَا وَرَاءَهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab that Ubaydullah\nibn Abdullah ibn Utba said, \"I visited Umar ibn al-Khattab just before\nnoon and found him praying a voluntary prayer. So I stood behind him,\nbut he pulled me nearer and put me next to him, on his right hand\nside, and then Yarfa came and I moved back and we formed a row behind\nhim.\""}},{"id":38,"idInBook":38,"chapterId":9,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا كَانَ أَحَدُكُمْ يُصَلِّي فَلاَ يَدَعْ أَحَدًا يَمُرُّ بَيْنَ يَدَيْهِ وَلْيَدْرَأْهُ مَا اسْتَطَاعَ فَإِنْ أَبَى فَلْيُقَاتِلْهُ فَإِنَّمَا هُوَ شَيْطَانٌ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Zayd ibn Aslam from Abd ar-\nRahman ibn Abi Said al-Khudri from his father that the Messenger of\nAllah, may Allah bless him and grant him peace, said, \"Do not let\nanyone pass in front of you when you are praying. Repel him as much as\nyou can, and, if he refuses, fight him, for he is only a shaytan.\""}},{"id":39,"idInBook":39,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي النَّضْرِ، مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ عَنْ بُسْرِ بْنِ سَعِيدٍ، أَنَّ زَيْدَ بْنَ خَالِدٍ الْجُهَنِيَّ، أَرْسَلَهُ إِلَى أَبِي جُهَيْمٍ يَسْأَلُهُ مَاذَا سَمِعَ مِنْ، رَسُولِ اللَّهِ صلى الله عليه وسلم فِي الْمَارِّ بَيْنَ يَدَىِ الْمُصَلِّي فَقَالَ أَبُو جُهَيْمٍ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لَوْ يَعْلَمُ الْمَارُّ بَيْنَ يَدَىِ الْمُصَلِّي مَاذَا عَلَيْهِ لَكَانَ أَنْ يَقِفَ أَرْبَعِينَ خَيْرًا لَهُ مِنْ أَنْ يَمُرَّ بَيْنَ يَدَيْهِ ‏\"‏ ‏.‏ قَالَ أَبُو النَّضْرِ لاَ أَدْرِي أَقَالَ أَرْبَعِينَ يَوْمًا أَوْ شَهْرًا أَوْ سَنَةً ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'n Nadr, the mawla of Umar\nibn Ubaydullah from Busr ibn Said that Zayd ibn Khalid al-Juhani sent\nhim to Abu Juhaym to ask him what he had heard from the Messenger of\nAllah, may Allah bless him and grant him peace, about passing in front\nof someone praying. Abu Juhaym said, \"The Messenger of Allah, may\nAllah bless him and grant him peace, said, 'If the one who passes in\nfront of a man praying knew what he was bringing upon himself it would\nbe better for him to stop for forty than to pass in front of him.' \"\n\n\nAbu'n-Nadr said, \"I do not know whether he said forty days or\nmonths or years.\""}},{"id":40,"idInBook":40,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، أَنَّ كَعْبَ الأَحْبَارِ، قَالَ لَوْ يَعْلَمُ الْمَارُّ بَيْنَ يَدَىِ الْمُصَلِّي مَاذَا عَلَيْهِ لَكَانَ أَنْ يُخْسَفَ بِهِ خَيْرًا لَهُ مِنْ أَنْ يَمُرَّ بَيْنَ يَدَيْهِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Zayd ibn Aslam from Ata ibn\nYasar that Kab al-Ahbar said, \"If the person who passed in front of a\nman praying knew what he was bringing on himself, it would be better\nfor him to sink into the ground than to pass in front of him.\""}},{"id":41,"idInBook":41,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَكْرَهُ أَنْ يَمُرَّ، بَيْنَ أَيْدِي النِّسَاءِ وَهُنَّ يُصَلِّينَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Abdullah\nibn Umar used to disapprove of passing in front of women while they\nwere praying."}},{"id":42,"idInBook":42,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ لاَ يَمُرُّ بَيْنَ يَدَىْ أَحَدٍ وَلاَ يَدَعُ أَحَدًا يَمُرُّ بَيْنَ يَدَيْهِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nwould neither pass in front of anyone, nor let anyone pass in front of\nhim."}},{"id":43,"idInBook":43,"chapterId":9,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، أَنَّهُ قَالَ أَقْبَلْتُ رَاكِبًا عَلَى أَتَانٍ - وَأَنَا يَوْمَئِذٍ قَدْ نَاهَزْتُ الاِحْتِلاَمَ - وَرَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي لِلنَّاسِ بِمِنًى فَمَرَرْتُ بَيْنَ يَدَىْ بَعْضِ الصَّفِّ فَنَزَلْتُ فَأَرْسَلْتُ الأَتَانَ تَرْتَعُ وَدَخَلْتُ فِي الصَّفِّ فَلَمْ يُنْكِرْ ذَلِكَ عَلَىَّ أَحَدٌ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Ubaydullah\nibn Abdullah ibn Utba ibn Masud that Abdullah ibn Abbas said, \"I\napproached, riding on a donkey, while the Messenger of Allah, may\nAllah bless him and grant him peace, was leading the people in prayer\nat Mina, and I was, at that time, nearing puberty. I passed in front\nof part of the row, dismounted, sent the donkey off to graze, and then\njoined the row, and no one rebuked me for doing so.\""}},{"id":44,"idInBook":44,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ سَعْدَ بْنَ أَبِي وَقَّاصٍ، كَانَ يَمُرُّ بَيْنَ يَدَىْ بَعْضِ الصُّفُوفِ وَالصَّلاَةُ قَائِمَةٌ ‏.‏ قَالَ مَالِكٌ وَأَنَا أَرَى ذَلِكَ وَاسِعًا إِذَا أُقِيمَتِ الصَّلاَةُ وَبَعْدَ أَنْ يُحْرِمَ الإِمَامُ وَلَمْ يَجِدِ الْمَرْءُ مَدْخَلاً إِلَى الْمَسْجِدِ إِلاَّ بَيْنَ الصُّفُوفِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Said ibn\nAbi Waqqas used to pass in front of some of the rows while the prayer\nwas in progress.\n\n\nMalik said, \"I consider that it is\npermissible to do that if the iqama for the prayer has been said and\nthe imam has said the initial takbir and a man cannot find any way\ninto the mosque except by going between the rows.\""}},{"id":45,"idInBook":45,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَلِيَّ بْنَ أَبِي طَالِبٍ، قَالَ لاَ يَقْطَعُ الصَّلاَةَ شَىْءٌ مِمَّا يَمُرُّ بَيْنَ يَدَىِ الْمُصَلِّي ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Ali ibn Abi Talib said, \"Things that pass in front of a man praying do not break his prayer.\""}},{"id":46,"idInBook":46,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقُولُ لاَ يَقْطَعُ الصَّلاَةَ شَىْءٌ مِمَّا يَمُرُّ بَيْنَ يَدَىِ الْمُصَلِّي ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Salim ibn Abdullah that Abdullah ibn Umar used to say, \"Things that pass in front of a man praying do not break his prayer.\""}},{"id":47,"idInBook":47,"chapterId":9,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَسْتَتِرُ بِرَاحِلَتِهِ إِذَا صَلَّى ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Abdullah ibn Umar would use the animal he was riding as a sutra when he prayed."}},{"id":48,"idInBook":48,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، أَنَّ أَبَاهُ، كَانَ يُصَلِّي فِي الصَّحْرَاءِ إِلَى غَيْرِ سُتْرَةٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa that his father used to pray in the desert without a sutra."}},{"id":49,"idInBook":49,"chapterId":9,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي جَعْفَرٍ الْقَارِئِ، أَنَّهُ قَالَ رَأَيْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ إِذَا أَهْوَى لِيَسْجُدَ مَسَحَ الْحَصْبَاءَ لِمَوْضِعِ جَبْهَتِهِ مَسْحًا خَفِيفًا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Abu Jafar al-Qari said, \"I\nsaw Abdullah ibn Umar quickly brush away the small stones from the\nplace where he was going to put his forehead as he was going down into\nsajda.\""}},{"id":50,"idInBook":50,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ بَلَغَهُ أَنَّ أَبَا ذَرٍّ، كَانَ يَقُولُ مَسْحُ الْحَصْبَاءِ مَسْحَةً وَاحِدَةً وَتَرْكُهَا خَيْرٌ مِنْ حُمْرِ النَّعَمِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said that he had\nheard that Abu Dharr used to say, \"Brush away the small stones with\none sweep, but if you leave them it is better than a red camel.\""}},{"id":51,"idInBook":51,"chapterId":9,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، كَانَ يَأْمُرُ بِتَسْوِيَةِ الصُّفُوفِ فَإِذَا جَاءُوهُ فَأَخْبَرُوهُ أَنْ قَدِ اسْتَوَتْ كَبَّرَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Umar ibn al-Khattab\nused to order the rows to be straightened, and when they had come to\nhim and told him that the rows were straight he would say the takbir."}},{"id":52,"idInBook":52,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَمِّهِ أَبِي سُهَيْلِ بْنِ مَالِكٍ، عَنْ أَبِيهِ، أَنَّهُ قَالَ كُنْتُ مَعَ عُثْمَانَ بْنِ عَفَّانَ فَقَامَتِ الصَّلاَةُ وَأَنَا أُكَلِّمُهُ، فِي أَنْ يَفْرِضَ، لِي فَلَمْ أَزَلْ أُكَلِّمُهُ وَهُوَ يُسَوِّي الْحَصْبَاءَ بِنَعْلَيْهِ حَتَّى جَاءَهُ رِجَالٌ قَدْ كَانَ وَكَلَهُمْ بِتَسْوِيَةِ الصُّفُوفِ ‏.‏ فَأَخْبَرُوهُ أَنَّ الصُّفُوفَ قَدِ اسْتَوَتْ فَقَالَ لِي اسْتَوِ فِي الصَّفِّ ‏.‏ ثُمَّ كَبَّرَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from his paternal uncle, Abu\nSuhayl ibn Malik, that his father said, \"I was with Uthman ibn Affan\nwhen the iqama was said for the prayer and I was talking to him about\nbeing assigned a definite allowance by him. I continued talking to him\nwhile he was levelling some small stones with his sandals, and then\nsome men that he had entrusted to straighten the rows came and told\nhim that the rows were straight. He said to me, 'Line up in the row,'\nand then he said the takbir.\""}},{"id":53,"idInBook":53,"chapterId":9,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ الْكَرِيمِ بْنِ أَبِي الْمُخَارِقِ الْبَصْرِيِّ، أَنَّهُ قَالَ مِنْ كَلاَمِ النُّبُوَّةِ إِذَا لَمْ تَسْتَحِي فَافْعَلْ مَا شِئْتَ وَوَضْعُ الْيَدَيْنِ إِحْدَاهُمَا عَلَى الأُخْرَى فِي الصَّلاَةِ يَضَعُ الْيُمْنَى عَلَى الْيُسْرَى وَتَعْجِيلُ الْفِطْرِ وَالاِسْتِينَاءُ بِالسَّحُورِ ‏.‏","english":{"narrator":"Yahya related to me from Malik that Abd al-Karim ibn\nAbi'l-Mukhariq al-Basri said, \"Among things the Prophet, may Allah\nbless him and grant him peace, said and did are:","text":"'As long as you do\nnot feel ashamed, do whatever you wish', the placing of one hand on\nthe other in prayer (one places the right hand on the left), being\nquick to break the fast, and delaying the meal before dawn.\""}},{"id":54,"idInBook":54,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي حَازِمِ بْنِ دِينَارٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، أَنَّهُ قَالَ كَانَ النَّاسُ يُؤْمَرُونَ أَنْ يَضَعَ الرَّجُلُ الْيَدَ الْيُمْنَى عَلَى ذِرَاعِهِ الْيُسْرَى فِي الصَّلاَةِ ‏.‏ قَالَ أَبُو حَازِمٍ لاَ أَعْلَمُ إِلاَّ أَنَّهُ يَنْمِي ذَلِكَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu Hazim ibn Dinar that Sahl\nibn Sad said, \"People used to be ordered to place their right hands on\ntheir left forearms in the prayer.\"\n\n\nAbu Hazim added, \"I know\nfor sure that Sahl traces that back to the Prophet, may Allah bless\nhim and grant him peace.\""}},{"id":55,"idInBook":55,"chapterId":9,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ لاَ يَقْنُتُ فِي شَىْءٍ مِنَ الصَّلاَةِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\ndid not say qunut in any of the prayers."}},{"id":56,"idInBook":56,"chapterId":9,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّ عَبْدَ اللَّهِ بْنَ الأَرْقَمِ، كَانَ يَؤُمُّ أَصْحَابَهُ فَحَضَرَتِ الصَّلاَةُ يَوْمًا فَذَهَبَ لِحَاجَتِهِ ثُمَّ رَجَعَ فَقَالَ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِذَا أَرَادَ أَحَدُكُمُ الْغَائِطَ فَلْيَبْدَأْ بِهِ قَبْلَ الصَّلاَةِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa from his\nfather that Abdullah ibn al-Arqam used to lead his companions in\nprayer. The time for prayer came one day and he went to relieve\nhimself. When he returned, he said, \"I heard the Messenger of Allah,\nmay Allah bless him and grant him peace, say, 'If you wish to\ndefecate, you should do so before the prayer.' \""}},{"id":57,"idInBook":57,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، قَالَ لاَ يُصَلِّيَنَّ أَحَدُكُمْ وَهُوَ ضَامٌّ بَيْنَ وَرِكَيْهِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Zayd ibn Aslam that Umar ibn\nal-Khattab said, \"You should not pray while you are holding your\nbowels.\""}},{"id":58,"idInBook":58,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْمَلاَئِكَةُ تُصَلِّي عَلَى أَحَدِكُمْ مَا دَامَ فِي مُصَلاَّهُ الَّذِي صَلَّى فِيهِ مَا لَمْ يُحْدِثِ اللَّهُمَّ اغْفِرْ لَهُ اللَّهُمَّ ارْحَمْهُ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'z Zinad from al-Araj from Abu Hurayra that the Messenger of Allah, may Allah bless him and grant him peace, said, \"The angels ask for blessings on each one of you as long as he is in the place where he has prayed and has not discharged anything. They say, 'Allah, forgive him. Allah have mercy on him.' \""}},{"id":59,"idInBook":59,"chapterId":9,"bookId":7,"arabic":"","english":{"narrator":"","text":"Malik said, \"I do not consider that his words, 'has not discharged anything' refer to anything other than the discharges that break wudu.\""}},{"id":60,"idInBook":60,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَزَالُ أَحَدُكُمْ فِي صَلاَةٍ مَا كَانَتِ الصَّلاَةُ تَحْبِسُهُ لاَ يَمْنَعُهُ أَنْ يَنْقَلِبَ إِلَى أَهْلِهِ إِلاَّ الصَّلاَةُ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'z Zinad from al-Araj from\nAbu Hurayra that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"You are in prayer as long as the prayer detains you\nand there is nothing that prevents you from returning to your family\nexcept the prayer.\""}},{"id":61,"idInBook":61,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ سُمَىٍّ، مَوْلَى أَبِي بَكْرٍ أَنَّ أَبَا بَكْرِ بْنَ عَبْدِ الرَّحْمَنِ، كَانَ يَقُولُ مَنْ غَدَا أَوْ رَاحَ إِلَى الْمَسْجِدِ لاَ يُرِيدُ غَيْرَهُ لِيَتَعَلَّمَ خَيْرًا أَوْ لِيُعَلِّمَهُ ثُمَّ رَجَعَ إِلَى بَيْتِهِ كَانَ كَالْمُجَاهِدِ فِي سَبِيلِ اللَّهِ رَجَعَ غَانِمًا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Sumayy, the mawla of Abu\nBakr, that Abu Bakr ibn Abd ar-Rahman used to say, \"Someone who goes\nto the mosque in the morning or the afternoon with no intention of\ngoing anywhere else, either to learn good or teach it, is like someone\nwho does jihad in the way of Allah and returns with booty.\""}},{"id":62,"idInBook":62,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نُعَيْمِ بْنِ عَبْدِ اللَّهِ الْمُجْمِرِ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ إِذَا صَلَّى أَحَدُكُمْ ثُمَّ جَلَسَ فِي مُصَلاَّهُ لَمْ تَزَلِ الْمَلاَئِكَةُ تُصَلِّي عَلَيْهِ اللَّهُمَّ اغْفِرْ لَهُ اللَّهُمَّ ارْحَمْهُ فَإِنْ قَامَ مِنْ مُصَلاَّهُ فَجَلَسَ فِي الْمَسْجِدِ يَنْتَظِرُ الصَّلاَةَ لَمْ يَزَلْ فِي صَلاَةٍ حَتَّى يُصَلِّيَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nuaym ibn Abdullah al-Mujmir\nthat he heard Abu Hurayra say, \"If any one of you prays and then sits\ndown in the spot where he has prayed, the angels ask blessings on him\nsaying, 'Allah, forgive him. Allah, have mercy on him.' And if he\nmoves from the spot where he has prayed and sits elsewhere in the\nmosque waiting for the prayer, he remains in prayer until he prays.\""}},{"id":63,"idInBook":63,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ الْعَلاَءِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ يَعْقُوبَ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَلاَ أُخْبِرُكُمْ بِمَا يَمْحُو اللَّهُ بِهِ الْخَطَايَا وَيَرْفَعُ بِهِ الدَّرَجَاتِ إِسْبَاغُ الْوُضُوءِ عِنْدَ الْمَكَارِهِ وَكَثْرَةُ الْخُطَا إِلَى الْمَسَاجِدِ وَانْتِظَارُ الصَّلاَةِ بَعْدَ الصَّلاَةِ فَذَلِكُمُ الرِّبَاطُ فَذَلِكُمُ الرِّبَاطُ فَذَلِكُمُ الرِّبَاطُ ‏\"‏ ‏.‏","english":{"narrator":"Yahya related to me from Malik from al Ala ibn Abd ar-Rahman ibn\nYaqub from his father from Abu Hurayra that the Messenger of Allah,\nmay Allah bless him and grant him peace, said, \"Shall I tell you the\nthings by which Allah erases wrong actions and by which he raises\nranks:","text":"the complete and correct performance of wudu in adverse\nconditions, a great number of steps towards the mosque,and waiting\nafter one prayer for the next prayer. That is the firm hold, that is\nthe firm hold, that is the firm hold.\""}},{"id":64,"idInBook":64,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ سَعِيدَ بْنَ الْمُسَيَّبِ، قَالَ يُقَالُ لاَ يَخْرُجُ أَحَدٌ مِنَ الْمَسْجِدِ بَعْدَ النِّدَاءِ - إِلاَّ أَحَدٌ يُرِيدُ الرُّجُوعَ إِلَيْهِ - إِلاَّ مُنَافِقٌ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Said ibn\nal-Musayyab said, \"It is said that no-one except a hypocrite leaves\nthe mosque after the call to prayer, except for someone who intends to\nreturn.\""}},{"id":65,"idInBook":65,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَامِرِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، عَنْ عَمْرِو بْنِ سُلَيْمٍ الزُّرَقِيِّ، عَنْ أَبِي قَتَادَةَ الأَنْصَارِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا دَخَلَ أَحَدُكُمُ الْمَسْجِدَ فَلْيَرْكَعْ رَكْعَتَيْنِ قَبْلَ أَنْ يَجْلِسَ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Amir ibn Abdullah ibn az-\nZubayr from Amr ibn Sulaymaz-Zuraqi from Abu Qatadaal-Ansari that the\nMessenger of Allah, may Allah bless him and grant him peace, said,\n\"When you enter the mosque, you should pray two rakas before you sit\ndown.\""}},{"id":66,"idInBook":66,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي النَّضْرِ، مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّهُ قَالَ لَهُ أَلَمْ أَرَ صَاحِبَكَ إِذَا دَخَلَ الْمَسْجِدَ يَجْلِسُ قَبْلَ أَنْ يَرْكَعَ قَالَ أَبُو النَّضْرِ يَعْنِي بِذَلِكَ عُمَرَ بْنَ عُبَيْدِ اللَّهِ وَيَعِيبُ ذَلِكَ عَلَيْهِ أَنْ يَجْلِسَ إِذَا دَخَلَ الْمَسْجِدَ قَبْلَ أَنْ يَرْكَعَ ‏.‏ قَالَ يَحْيَى قَالَ مَالِكٌ وَذَلِكَ حَسَنٌ وَلَيْسَ بِوَاجِبٍ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'nNadr, the mawla of Umar\nibn Ubaydullah, that Abu Salama ibn Abd ar-Rahman asked him, \"Didn't I\nsee your master sit down before praying after he had entered the\nmosque?\"\n\n\nAbu'n-Nadr said, \"By that he meant Umar ibn\nUbaydullah, and he was finding fault with him for sitting down before\npraying after he had come into the mosque.\"\n\n\nYahya said that\nMalik said, \"It is good to do that but not obligatory.\""}},{"id":67,"idInBook":67,"chapterId":9,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ إِذَا سَجَدَ وَضَعَ كَفَّيْهِ عَلَى الَّذِي يَضَعُ عَلَيْهِ جَبْهَتَهُ ‏.‏ قَالَ نَافِعٌ وَلَقَدْ رَأَيْتُهُ فِي يَوْمٍ شَدِيدِ الْبَرْدِ وَإِنَّهُ لَيُخْرِجُ كَفَّيْهِ مِنْ تَحْتِ بُرْنُسٍ لَهُ حَتَّى يَضَعَهُمَا عَلَى الْحَصْبَاءِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nused to place his palms flat on the surface where he put his forehead.\nNafi said, \"I have seen him take his hands out from under his burnus\non a very cold day and place them on the ground.\""}},{"id":68,"idInBook":68,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقُولُ مَنْ وَضَعَ جَبْهَتَهُ بِالأَرْضِ فَلْيَضَعْ كَفَّيْهِ عَلَى الَّذِي يَضَعُ عَلَيْهِ جَبْهَتَهُ ثُمَّ إِذَا رَفَعَ فَلْيَرْفَعْهُمَا فَإِنَّ الْيَدَيْنِ تَسْجُدَانِ كَمَا يَسْجُدُ الْوَجْهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nused to say, \"When one of you puts his forehead on the ground he\nshould put his palms on the place where he puts his forehead. Then,\nwhen he rises, he should raise them, for the hands prostrate just as\nthe face prostrates.\""}},{"id":69,"idInBook":69,"chapterId":9,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ أَبِي حَازِمٍ، سَلَمَةَ بْنِ دِينَارٍ عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم ذَهَبَ إِلَى بَنِي عَمْرِو بْنِ عَوْفٍ لِيُصْلِحَ بَيْنَهُمْ وَحَانَتِ الصَّلاَةُ فَجَاءَ الْمُؤَذِّنُ إِلَى أَبِي بَكْرٍ الصِّدِّيقِ فَقَالَ أَتُصَلِّي لِلنَّاسِ فَأُقِيمَ قَالَ نَعَمْ ‏.‏ فَصَلَّى أَبُو بَكْرٍ فَجَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَالنَّاسُ فِي الصَّلاَةِ فَتَخَلَّصَ حَتَّى وَقَفَ فِي الصَّفِّ فَصَفَّقَ النَّاسُ وَكَانَ أَبُو بَكْرٍ لاَ يَلْتَفِتُ فِي صَلاَتِهِ فَلَمَّا أَكْثَرَ النَّاسُ مِنَ التَّصْفِيقِ الْتَفَتَ أَبُو بَكْرٍ فَرَأَى رَسُولَ اللَّهِ صلى الله عليه وسلم فَأَشَارَ إِلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنِ امْكُثْ مَكَانَكَ فَرَفَعَ أَبُو بَكْرٍ يَدَيْهِ فَحَمِدَ اللَّهَ عَلَى مَا أَمَرَهُ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ ذَلِكَ ثُمَّ اسْتَأْخَرَ حَتَّى اسْتَوَى فِي الصَّفِّ وَتَقَدَّمَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَصَلَّى ثُمَّ انْصَرَفَ فَقَالَ ‏\"‏ يَا أَبَا بَكْرٍ مَا مَنَعَكَ أَنْ تَثْبُتَ إِذْ أَمَرْتُكَ ‏\"‏ ‏.‏ فَقَالَ أَبُو بَكْرٍ مَا كَانَ لاِبْنِ أَبِي قُحَافَةَ أَنْ يُصَلِّيَ بَيْنَ يَدَىْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا لِي رَأَيْتُكُمْ أَكْثَرْتُمْ مِنَ التَّصْفِيحِ مَنْ نَابَهُ شَىْءٌ فِي صَلاَتِهِ فَلْيُسَبِّحْ فَإِنَّهُ إِذَا سَبَّحَ الْتُفِتَ إِلَيْهِ وَإِنَّمَا التَّصْفِيحُ لِلنِّسَاءِ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu Hazim Salama ibn Dinar\nfrom Sahl ibn Said as-Saidi that the Messenger of Allah, may Allah\nbless him and grant him peace, went to the tribe of Bani Amr ibn Awf\nto settle their disputes .The time for the prayer came and the\nmuadhdhin came to Abu Bakr as-Siddiq and said, \"Could you lead the\npeople in prayer and I will say the iqama?\" He said, \"Yes,\" and Abu\nBakr prayed. The Messenger of Allah, may Allah bless him and grant him\npeace, came back while the people were praying, and approached and\njoined the row. People clapped, but Abu Bakr did not turn round. The\npeople increased their clapping, and Abu Bakr turned round and saw the\nMessenger of Allah, may Allah bless him and grant him peace, and the\nMessenger of Allah, may Allah bless him and grant him peace, indicated\nto him to stay in his place. Abu Bakr raised his hands and praised\nAllah that the Messenger of Allah, may Allah bless him and grant him\npeace, had told him to do that. Then  he drew back until he was in the\nrow, and the Messenger of Allah, may Allah bless him and grant him\npeace, stepped forward and led the prayer. When he had finished he\nsaid, \"Abu Bakr, what stopped you from staying put like I told you?\"\nAbu Bakr said, \"It is not for Ibn Abi Quhafa to pray in front of the\nMessenger of Allah, may Allah bless him and grant him peace.\"\n\n\nThe Messenger of Allah, may Allah bless him and grant him peace, said,\n\"Why did I see you all clapping so much? If something happens to you\nin the prayer you should say 'Subhana-llah' (Glory be to Allah), and\nwhen you say 'Subhana-llah' you will be heard. Clapping is only for\nwomen.\""}},{"id":70,"idInBook":70,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ ابْنَ عُمَرَ، لَمْ يَكُنْ يَلْتَفِتُ فِي صَلاَتِهِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Ibn Umar would\nnever turn around when praying."}},{"id":71,"idInBook":71,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي جَعْفَرٍ الْقَارِئِ، أَنَّهُ قَالَ كُنْتُ أُصَلِّي وَعَبْدُ اللَّهِ بْنُ عُمَرَ وَرَائِي وَلاَ أَشْعُرُ فَالْتَفَتُّ فَغَمَزَنِي ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Abu Jafar al-Qari said, \"I\nwas praying, and Abdullah ibn Umar was behind me and I was not aware\nof it. Then I turned round and he prodded me (in disapproval).\""}},{"id":72,"idInBook":72,"chapterId":9,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ، أَنَّهُ قَالَ دَخَلَ زَيْدُ بْنُ ثَابِتٍ الْمَسْجِدَ فَوَجَدَ النَّاسَ رُكُوعًا فَرَكَعَ ثُمَّ دَبَّ حَتَّى وَصَلَ الصَّفَّ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab that Abu Umama ibn\nSahl ibn Hunayf said, \"Zayd ibn Thabit entered the mosque and found\nthe people in ruku, so he went into ruku and then moved slowly forward\nuntil he reached the row.\""}},{"id":73,"idInBook":73,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ، كَانَ يَدِبُّ رَاكِعًا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Abdullah\nibn Masud used to move forward while in ruku."}},{"id":74,"idInBook":74,"chapterId":9,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ حَزْمٍ، عَنْ أَبِيهِ، عَنْ عَمْرِو بْنِ سُلَيْمٍ الزُّرَقِيِّ، أَنَّهُ قَالَ أَخْبَرَنِي أَبُو حُمَيْدٍ السَّاعِدِيُّ، أَنَّهُمْ قَالُوا يَا رَسُولَ اللَّهِ كَيْفَ نُصَلِّي عَلَيْكَ فَقَالَ ‏\n\"‏ قُولُوا اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَأَزْوَاجِهِ وَذُرِّيَّتِهِ كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ وَبَارِكْ عَلَى مُحَمَّدٍ وَأَزْوَاجِهِ وَذُرِّيَّتِهِ كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abdullah ibn Abi Bakr ibn\nHazim from his father that Amr ibn Sulaym az-Zuraqi said, \"Abu Humayd\nas-Saidi told me that they asked the Messenger of Allah, may Allah\nbless him and grant him peace, how they were to ask for blessings upon\nhim and he replied that they should say, 'O Allah, bless Muhammad and\nhis wives and his descendants asYou blessed the family of Ibrahim, and\ngive baraka to Muhammad and his wives and his descendants as You gave\nbaraka to the family of Ibrahim. You are worthy of Praise and\nGlorious.'\"\n\n\nAllahumma salli ala Muhammad wa azwajihi wa alihi\nkama sallaita ala ali Ibrahim, wa barakaala Muhammad wa azwajihi wa\nalihi kama baraktaalaali Ibrahim, innaka Hamidu'm - Majid."}},{"id":75,"idInBook":75,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نُعَيْمِ بْنِ عَبْدِ اللَّهِ الْمُجْمِرِ، عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ زَيْدٍ، أَنَّهُ أَخْبَرَهُ عَنْ أَبِي مَسْعُودٍ الأَنْصَارِيِّ، أَنَّهُ قَالَ أَتَانَا رَسُولُ اللَّهِ صلى الله عليه وسلم فِي مَجْلِسِ سَعْدِ بْنِ عُبَادَةَ فَقَالَ لَهُ بَشِيرُ بْنُ سَعْدٍ أَمَرَنَا اللَّهُ أَنْ نُصَلِّيَ عَلَيْكَ يَا رَسُولَ اللَّهِ فَكَيْفَ نُصَلِّي عَلَيْكَ قَالَ فَسَكَتَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى تَمَنَّيْنَا أَنَّهُ لَمْ يَسْأَلْهُ ثُمَّ قَالَ ‏\n\"‏ قُولُوا اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَبَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ فِي الْعَالَمِينَ إِنَّكَ حَمِيدٌ مَجِيدٌ وَالسَّلاَمُ كَمَا قَدْ عَلِمْتُمْ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nuaym ibn Abdullah al-\nMujmirthat Muhammad ibn Abdullah ibn Zayd told him that Abu Masud al\nAnsari said, \"The Messenger of Allah, may Allah bless him and grant\nhim peace, came to us at the gathering of Sad ibn Ubada. Bashir ibn\nSad said to him, 'Allah has ordered us to ask for blessings on you,\nMessenger of Allah. How should we do it?' The Messenger of Allah, may\nAllah bless him and grant him peace, remained silent until we wished\nwe had not asked him. Then he told us to say, 'O Allah, bless Muhammad\nand the family of Muhammad as You blessed Ibrahim, and give baraka to\nMuhammad and the family of Muhammad as You gave baraka to the family\nof Ibrahim. In all the worlds You are worthy of Praise and Glorious,'\nand then give the taslim as you have learnt.\"\n\n\nAllahumma salli\nala Muhammad wa ali Muhammad kama sallaita Ibrahim, wa baraka ala\nMuhammad wa ali Muhammad kama baraktaala ali Ibrahim. Fi'l alamin,\ninnaka Hamidu'm - Majid."}},{"id":76,"idInBook":76,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، قَالَ رَأَيْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ يَقِفُ عَلَى قَبْرِ النَّبِيِّ صلى الله عليه وسلم فَيُصَلِّي عَلَى النَّبِيِّ صلى الله عليه وسلم وَعَلَى أَبِي بَكْرٍ وَعُمَرَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Abdullah ibn Dinar said, \"I\nsaw Abdullah ibn Umar stop by the grave of the Prophet, may Allah\nbless him and grant him peace, and ask for blessings on the Prophet,\nmay Allah bless him and grant him peace, and on Abu Bakr and Umar.\""}},{"id":77,"idInBook":77,"chapterId":9,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُصَلِّي قَبْلَ الظُّهْرِ رَكْعَتَيْنِ وَبَعْدَهَا رَكْعَتَيْنِ وَبَعْدَ الْمَغْرِبِ رَكْعَتَيْنِ فِي بَيْتِهِ وَبَعْدَ صَلاَةِ الْعِشَاءِ رَكْعَتَيْنِ وَكَانَ لاَ يُصَلِّي بَعْدَ الْجُمُعَةِ حَتَّى يَنْصَرِفَ فَيَرْكَعَ رَكْعَتَيْنِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi from Ibn Umar that the\nMessenger of Allah, may Allah bless him and grant him peace, used to\npray two rakas before dhuhr and two rakas after it, two rakas after\nmaghrib, in his house, and two rakas after isha. He did not pray after\njumua until he had left, and then he prayed two rakas."}},{"id":78,"idInBook":78,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَتَرَوْنَ قِبْلَتِي هَاهُنَا فَوَاللَّهِ مَا يَخْفَى عَلَىَّ خُشُوعُكُمْ وَلاَ رُكُوعُكُمْ إِنِّي لأَرَاكُمْ مِنْ وَرَاءِ ظَهْرِي ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'z Zinad from al-Araj from\nAbu Hurayra that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"Do you see the direction I am facing here? By Allah,\nneither your concentration nor your ruku is hidden from me. I can see\nyou behind my back.\""}},{"id":79,"idInBook":79,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَأْتِي قُبَاءً رَاكِبًا وَمَاشِيًا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi from Abdullah ibn Umar\nthat when the Messenger of Allah, may Allah bless him and grant him\npeace, used to go to Quba (to pray), he would walk as well as ride."}},{"id":80,"idInBook":80,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنِ النُّعْمَانِ بْنِ مُرَّةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَا تَرَوْنَ فِي الشَّارِبِ وَالسَّارِقِ وَالزَّانِي ‏\"‏ ‏.‏ وَذَلِكَ قَبْلَ أَنْ يُنْزَلَ فِيهِمْ ‏.‏ قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ ‏.‏ قَالَ ‏\"‏ هُنَّ فَوَاحِشُ وَفِيهِنَّ عُقُوبَةٌ وَأَسْوَأُ السَّرِقَةِ الَّذِي يَسْرِقُ صَلاَتَهُ ‏\"‏ ‏.‏ قَالُوا وَكَيْفَ يَسْرِقُ صَلاَتَهُ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ لاَ يُتِمُّ رُكُوعَهَا وَلاَ سُجُودَهَا ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said from an-Numan\nibn Murra that the Messenger of Allah, may Allah bless him and grant\nhim peace, said,\"What about drunkenness, stealing and adultery? \"That\nwas before anything had been revealed about them. They said, \"Allah\nand His Messenger know best.\" He said, \"They are excesses and in them\nis a punishment. And the worst of thieves is the one who steals his\nprayer.\" They said, \"How does he steal his prayer, Messenger of\nAllah?\" He replied, \"He does not do ruku or sajda properly.\""}},{"id":81,"idInBook":81,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ اجْعَلُوا مِنْ صَلاَتِكُمْ فِي بُيُوتِكُمْ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa from his\nfather that the Messenger of Allah, may Allah bless him and grant him\npeace, said, \"Do some of the prayers in your houses.\""}},{"id":82,"idInBook":82,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقُولُ إِذَا لَمْ يَسْتَطِعِ الْمَرِيضُ السُّجُودَ أَوْمَأَ بِرَأْسِهِ إِيمَاءً وَلَمْ يَرْفَعْ إِلَى جَبْهَتِهِ شَيْئًا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nused to say, \"When a sick man is unable to prostrate he should motion\nwith his head, and not raise anything to his forehead.\""}},{"id":83,"idInBook":83,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ إِذَا جَاءَ الْمَسْجِدَ - وَقَدْ صَلَّى النَّاسُ - بَدَأَ بِصَلاَةِ الْمَكْتُوبَةِ وَلَمْ يُصَلِّ قَبْلَهَا شَيْئًا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Rabia ibn Abi Abd ar-Rahman\nthat if Abdullah ibn Umar arrived at the mosque and the people had\nalready prayed, he would begin with the obligatory prayer and not pray\nanything before it."}},{"id":84,"idInBook":84,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، مَرَّ عَلَى رَجُلٍ وَهُوَ يُصَلِّي فَسَلَّمَ عَلَيْهِ فَرَدَّ الرَّجُلُ كَلاَمًا فَرَجَعَ إِلَيْهِ عَبْدُ اللَّهِ بْنُ عُمَرَ فَقَالَ لَهُ إِذَا سُلِّمَ عَلَى أَحَدِكُمْ وَهُوَ يُصَلِّي فَلاَ يَتَكَلَّمْ وَلْيُشِرْ بِيَدِهِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\npassed by a man who was praying and said, \"Peace be upon you,\" and the\nman replied to him. Abdullah ibn Umar returned to him and said, \"When\nsomeone says, 'Peace be upon you' to you while you are praying do not\nreply, but give a signal with your hand.\""}},{"id":85,"idInBook":85,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، كَانَ يَقُولُ مَنْ نَسِيَ صَلاَةً فَلَمْ يَذْكُرْهَا إِلاَّ وَهُوَ مَعَ الإِمَامِ فَإِذَا سَلَّمَ الإِمَامُ فَلْيُصَلِّ الصَّلاَةَ الَّتِي نَسِيَ ثُمَّ لِيُصَلِّ بَعْدَهَا الأُخْرَى ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nused to say, \"Someone who only remembers that he has forgotten a\nprayer when he is praying the next prayer behind an imam, should pray\nthe prayer he has forgotten after the imam has said the taslim, and\nthen pray the other one again.\""}},{"id":86,"idInBook":86,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، عَنْ عَمِّهِ، وَاسِعِ بْنِ حَبَّانَ، أَنَّهُ قَالَ كُنْتُ أُصَلِّي وَعَبْدُ اللَّهِ بْنُ عُمَرَ مُسْنِدٌ ظَهْرَهُ إِلَى جِدَارِ الْقِبْلَةِ فَلَمَّا قَضَيْتُ صَلاَتِي انْصَرَفْتُ إِلَيْهِ مِنْ قِبَلِ شِقِّي الأَيْسَرِ فَقَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ مَا مَنَعَكَ أَنْ تَنْصَرِفَ عَنْ يَمِينِكَ قَالَ فَقُلْتُ رَأَيْتُكَ فَانْصَرَفْتُ إِلَيْكَ ‏.‏ قَالَ عَبْدُ اللَّهِ فَإِنَّكَ قَدْ أَصَبْتَ إِنَّ قَائِلاً يَقُولُ انْصَرِفْ عَنْ يَمِينِكَ فَإِذَا كُنْتَ تُصَلِّي فَانْصَرِفْ حَيْثُ شِئْتَ إِنْ شِئْتَ عَنْ يَمِينِكَ وَإِنْ شِئْتَ عَنْ يَسَارِكَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said from Muhammad\nibn Yahya ibn Habban that his paternal uncle Wasi ibn Habban said, \"I\nwas praying, and Abdullah ibn Umar was resting his back on the wall of\nthe qibla. When I had finished the prayer I turned towards him on my\nleft hand side. Abdullah ibn Umar said, 'What stopped you from turning\naway to your right?' I replied, 'I saw you and turned towards you.'\nAbdullah said, 'You have spoken correctly. People say that you should\nturn away to your right, but when you pray, you can turn whichever way\nyou wish. If you like, to your right, and if you like, to your left.'\n\""}},{"id":87,"idInBook":87,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ رَجُلٍ، مِنَ الْمُهَاجِرِينَ لَمْ يَرَ بِهِ بَأْسًا أَنَّهُ سَأَلَ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ الْعَاصِ أَأُصَلِّي فِي عَطَنِ الإِبِلِ فَقَالَ عَبْدُ اللَّهِ لاَ وَلَكِنْ صَلِّ فِي مُرَاحِ الْغَنَمِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa from his\nfather that one of the muhajirun in whom he saw no harm asked Abdullah\nibn Amr ibn al-As, \"Can I pray in a place where camels are watered?\"\nAbdullah replied, \"No, but you can pray in a sheep-pen.\""}},{"id":88,"idInBook":88,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ قَالَ مَا صَلاَةٌ يُجْلَسُ فِي كُلِّ رَكْعَةٍ مِنْهَا ثُمَّ قَالَ سَعِيدٌ هِيَ الْمَغْرِبُ إِذَا فَاتَتْكَ مِنْهَا رَكْعَةٌ وَكَذَلِكَ سُنَّةُ الصَّلاَةِ كُلُّهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab that Said ibn al-\nMusayyab said, \"Which prayer is it when you remain in the sitting\nposition in every raka?'' Said said, \"It is maghrib when you miss one\nraka, and that is the sunna in all the prayers.\""}},{"id":89,"idInBook":89,"chapterId":9,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَامِرِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، عَنْ عَمْرِو بْنِ سُلَيْمٍ الزُّرَقِيِّ، عَنْ أَبِي قَتَادَةَ الأَنْصَارِيِّ، ‏.‏ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُصَلِّي وَهُوَ حَامِلٌ أُمَامَةَ بِنْتَ زَيْنَبَ بِنْتِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَلأَبِي الْعَاصِ بْنِ رَبِيعَةَ بْنِ عَبْدِ شَمْسٍ فَإِذَا سَجَدَ وَضَعَهَا وَإِذَا قَامَ حَمَلَهَا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Amir ibn Abdullah ibn az-\nZubayr from Amr ibn Sulaym az-Zuraqi from Abu Qutada al-Ansari that\nthe Messenger of Allah, may Allah bless him and grant him peace, used\nto pray carrying Umama, who was the daughter of his daughter Zaynab by\nAbu'l As ibn Rabia ibn Abd Shams. When he prostrated, he put her down,\nand when he got up he carried her."}},{"id":90,"idInBook":90,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ يَتَعَاقَبُونَ فِيكُمْ مَلاَئِكَةٌ بِاللَّيْلِ وَمَلاَئِكَةٌ بِالنَّهَارِ وَيَجْتَمِعُونَ فِي صَلاَةِ الْعَصْرِ وَصَلاَةِ الْفَجْرِ ثُمَّ يَعْرُجُ الَّذِينَ بَاتُوا فِيكُمْ فَيَسْأَلُهُمْ وَهُوَ أَعْلَمُ بِهِمْ كَيْفَ تَرَكْتُمْ عِبَادِي فَيَقُولُونَ تَرَكْنَاهُمْ وَهُمْ يُصَلُّونَ وَأَتَيْنَاهُمْ وَهُمْ يُصَلُّونَ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Abu'z-Zinad from al-Araj from Abu\nHurayra that the Messenger of Allah, may Allah bless him and grant him\npeace, said, \"A group of angels in the night and a group of angels in\nthe day alternate with each other among you, and gather together at\nthe time of the asr and fajr prayers. Then those that have spent the\nnight among you ascend, and He asks them, and He knows best, 'How did\nyou leave my slaves?' and they say, 'When we left them they were\npraying, and when we came to them they were praying.' \""}},{"id":91,"idInBook":91,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مُرُوا أَبَا بَكْرٍ فَلْيُصَلِّ لِلنَّاسِ ‏\"‏ ‏.‏ فَقَالَتْ عَائِشَةُ إِنَّ أَبَا بَكْرٍ يَا رَسُولَ اللَّهِ إِذَا قَامَ فِي مَقَامِكَ لَمْ يُسْمِعِ النَّاسَ مِنَ الْبُكَاءِ فَمُرْ عُمَرَ فَلِيُصَلِّيَ لِلنَّاسِ ‏.‏ قَالَ ‏\"‏ مُرُوا أَبَا بَكْرٍ فَلْيُصَلِّ لِلنَّاسِ ‏\"‏ ‏.‏ قَالَتْ عَائِشَةُ فَقُلْتُ لِحَفْصَةَ قُولِي لَهُ إِنَّ أَبَا بَكْرٍ إِذَا قَامَ فِي مَقَامِكَ لَمْ يُسْمِعِ النَّاسَ مِنَ الْبُكَاءِ فَمُرْ عُمَرَ فَلْيُصَلِّ لِلنَّاسِ فَفَعَلَتْ حَفْصَةُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّكُنَّ لأَنْتُنَّ صَوَاحِبُ يُوسُفَ مُرُوا أَبَا بَكْرٍ فَلْيُصَلِّ لِلنَّاسِ ‏\"‏ ‏.‏ فَقَالَتْ حَفْصَةُ لِعَائِشَةَ مَا كُنْتُ لأُصِيبَ مِنْكِ خَيْرًا ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa from his\nfather from A'isha, the wife of the Prophet, may Allah bless him and\ngrant him peace, that the Messenger of Allah, may Allah bless him and\ngrant him peace, said, \"Tell Abu Bakr to lead the people in prayer.\"\nA'isha said, \"Messenger of Allah, when Abu Bakr stands in your place\nhis voice does not reach the ears of the people because of his\nweeping, so tell Umar to lead the people in prayer.\" He said, \"Tell\nAbu Bakr to lead the people in prayer.\" A'isha continued, \"I told\nHafsa to tell him that when Abu Bakr stood in his place his voice did\nnot reach the ears of the people because of his weeping, and that he\nshould tell Umar to lead the people in prayer. Hafsa did so, and the\nMessenger of Allah, may Allah bless him and grant him peace, said,\n'You are the companions of Yusuf! (referring to the women who cut\ntheir hands when they saw the beauty of Yusuf). Tell Abu Bakr to lead\nthe people in prayer!' \"\n\n\nA'isha added that Hafsa said to her,\n\"I have never had anything good from you!\""}},{"id":92,"idInBook":92,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَدِيِّ بْنِ الْخِيَارِ، أَنَّهُ قَالَ بَيْنَمَا رَسُولُ اللَّهِ صلى الله عليه وسلم جَالِسٌ بَيْنَ ظَهْرَانَىِ النَّاسِ إِذْ جَاءَهُ رَجُلٌ فَسَارَّهُ فَلَمْ يُدْرَ مَا سَارَّهُ بِهِ حَتَّى جَهَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَإِذَا هُوَ يَسْتَأْذِنُهُ فِي قَتْلِ رَجُلٍ مِنَ الْمُنَافِقِينَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ جَهَرَ ‏\"‏ أَلَيْسَ يَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ ‏\"‏ ‏.‏ فَقَالَ الرَّجُلُ بَلَى وَلاَ شَهَادَةَ لَهُ ‏.‏ فَقَالَ ‏\"‏ أَلَيْسَ يُصَلِّي ‏\"‏ ‏.‏ قَالَ بَلَى وَلاَ صَلاَةَ لَهُ ‏.‏ فَقَالَ صلى الله عليه وسلم ‏\"‏ أُولَئِكَ الَّذِينَ نَهَانِي اللَّهُ عَنْهُمْ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Ata ibn Yazid\nal-Laythi that Ubaydullah ibn Adi ibnal-Khiyar said, \"Once when the\nMessenger of Allah, may Allah bless him and grant him peace, was\nsitting with some people, a man came to him and spoke secretly to him.\nNobody knew what he had said until the Messenger of Allah, may Allah\nbless him and grant him peace, disclosed that he had asked for\npermission to kill one of the hypocrites. When he disclosed this, the\nMessenger of Allah, may Allah bless him and grant him peace, said,\n'Doesn't he testify that there is no god but Allah and that Muhammad\nis the Messenger of Allah?'  The man replied, 'Of course, but he\nhasn't really done so.' He said, 'Doesn't he do the prayer?' and the\nman replied, 'Of course, but he doesn't really do the prayer.'  He\nsaid, may Allah bless him and grant him peace, 'Those are the ones\nwhom Allah has forbidden me (to kill).' \""}},{"id":93,"idInBook":93,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ اللَّهُمَّ لاَ تَجْعَلْ قَبْرِي وَثَنًا يُعْبَدُ اشْتَدَّ غَضَبُ اللَّهِ عَلَى قَوْمٍ اتَّخَذُوا قُبُورَ أَنْبِيَائِهِمْ مَسَاجِدَ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Zayd ibn Aslam from Ata ibn\nYasar that the Messenger of Allah, may Allah bless him and grant him\npeace, said, \"O Allah! Do not make my grave an idol that is\nworshipped. The anger on those who took the graves of their Prophets\nas places of prostration was terrible.\""}},{"id":94,"idInBook":94,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ مَحْمُودِ بْنِ الرَّبِيعِ الأَنْصَارِيِّ، أَنَّ عِتْبَانَ بْنَ مَالِكٍ، كَانَ يَؤُمُّ قَوْمَهُ وَهُوَ أَعْمَى وَأَنَّهُ قَالَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم إِنَّهَا تَكُونُ الظُّلْمَةُ وَالْمَطَرُ وَالسَّيْلُ وَأَنَا رَجُلٌ ضَرِيرُ الْبَصَرِ فَصَلِّ يَا رَسُولَ اللَّهِ فِي بَيْتِي مَكَانًا أَتَّخِذْهُ مُصَلًّى ‏.‏ فَجَاءَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ أَيْنَ تُحِبُّ أَنْ أُصَلِّيَ ‏\"‏ ‏.‏ فَأَشَارَ لَهُ إِلَى مَكَانٍ مِنَ الْبَيْتِ فَصَلَّى فِيهِ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Mahmud ibn\nRabi al-Ansari that Utban ibn Malik, who was a blind man, used to lead\nhis people in prayer, and he said to the Messenger of Allah, may Allah\nbless him and grant him peace, \"Sometimes it is dark and rainy and\nthere is a lot of water around outside, and I am a man who has lost\nhis sight. Messenger of Allah, pray in a certain place in my house so\nthat I can take it as a place to pray.\" The Messenger of Allah, may\nAllah bless him and grant him peace, came to him and said, \"Where\nwould you like me to pray?\" He indicated a place to him and the\nMessengerof Allah, may Allah bless him and grant him peace, prayed\nthere."}},{"id":95,"idInBook":95,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عَبَّادِ بْنِ تَمِيمٍ، عَنْ عَمِّهِ، أَنَّهُ رَأَى رَسُولَ اللَّهِ صلى الله عليه وسلم مُسْتَلْقِيًا فِي الْمَسْجِدِ وَاضِعًا إِحْدَى رِجْلَيْهِ عَلَى الأُخْرَى ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Abbad ibn Tamim from his paternal uncle that he saw the Messenger of Allah, may Allah bless him and grant him peace, lying down in the mosque with one foot on top of the other."}},{"id":96,"idInBook":96,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، وَعُثْمَانَ بْنَ عَفَّانَ، - رضى الله عنهما - كَانَا يَفْعَلاَنِ ذَلِكَ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Ibn Shihab from Said ihn al-Musayyab that Umar ibn al Khattab and Uthman ibn Affan, may Allah be pleased with them, used to do the same."}},{"id":97,"idInBook":97,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ، قَالَ لإِنْسَانٍ إِنَّكَ فِي زَمَانٍ كَثِيرٌ فُقَهَاؤُهُ قَلِيلٌ قُرَّاؤُهُ تُحْفَظُ فِيهِ حُدُودُ الْقُرْآنِ وَتُضَيَّعُ حُرُوفُهُ قَلِيلٌ مَنْ يَسْأَلُ كَثِيرٌ مَنْ يُعْطِي يُطِيلُونَ فِيهِ الصَّلاَةَ وَيَقْصُرُونَ الْخُطْبَةَ يُبَدُّونَ أَعْمَالَهُمْ قَبْلَ أَهْوَائِهِمْ وَسَيَأْتِي عَلَى النَّاسِ زَمَانٌ قَلِيلٌ فُقَهَاؤُهُ كَثِيرٌ قُرَّاؤُهُ يُحْفَظُ فِيهِ حُرُوفُ الْقُرْآنِ وَتُضَيَّعُ حُدُودُهُ كَثِيرٌ مَنْ يَسْأَلُ قَلِيلٌ مَنْ يُعْطِي يُطِيلُونَ فِيهِ الْخُطْبَةَ وَيَقْصُرُونَ الصَّلاَةَ يُبَدُّونَ فِيهِ أَهْوَاءَهُمْ قَبْلَ أَعْمَالِهِمْ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Yahya ibn Said that Abdullah\nibn Masud said to a certain man, \"You are in a time when men of\nunderstanding (fuqaha) are many and Qur'an reciters are few, when the\nlimits of behaviour defined in the Qur'an are guarded and its letters\nare lost, when few people ask and many give, when they make the prayer\nlong and the khutba short, and put their actions before their desires.\nA time will come upon men when their fuqaha are few but their Qur'an\nreciters are many, when the letters of the Qur'an are guarded\ncarefully but its limits are lost, when many ask but few give, when\nthey make the khutba long but the prayer short, and put their desires\nbefore their actions.\""}},{"id":98,"idInBook":98,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، أَنَّهُ قَالَ بَلَغَنِي أَنَّ أَوَّلَ، مَا يُنْظَرُ فِيهِ مِنْ عَمَلِ الْعَبْدِ الصَّلاَةُ فَإِنْ قُبِلَتْ مِنْهُ نُظِرَ فِيمَا بَقِيَ مِنْ عَمَلِهِ وَإِنْ لَمْ تُقْبَلْ مِنْهُ لَمْ يُنْظَرْ فِي شَىْءٍ مِنْ عَمَلِهِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that Yahya ibn Said said, \"I have\nheard that the first of the actions of a slave to be considered on the\nday of rising is the prayer. If it is accepted from him, the rest of\nhis actions will be considered, and if it is not accepted from him,\nnone of his actions will be considered.\""}},{"id":99,"idInBook":99,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ كَانَ أَحَبُّ الْعَمَلِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم الَّذِي يَدُومُ عَلَيْهِ صَاحِبُهُ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Hisham ibn Urwa from his\nfather that A'isha, the wife of the Prophet, may Allah bless him and\ngrant him peace, said, \"The actions which the Messenger of Allah, may\nAllah bless him and grant him peace, loved most were those which were\ndone most constantly.\""}},{"id":100,"idInBook":100,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ عَنْ عَامِرِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ، عَنْ أَبِيهِ، أَنَّهُ قَالَ كَانَ رَجُلاَنِ أَخَوَانِ فَهَلَكَ أَحَدُهُمَا قَبْلَ صَاحِبِهِ بِأَرْبَعِينَ لَيْلَةً فَذُكِرَتْ فَضِيلَةُ الأَوَّلِ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ أَلَمْ يَكُنِ الآخَرُ مُسْلِمًا ‏\"‏ ‏.‏ قَالُوا بَلَى يَا رَسُولَ اللَّهِ وَكَانَ لاَ بَأْسَ بِهِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَمَا يُدْرِيكُمْ مَا بَلَغَتْ بِهِ صَلاَتُهُ إِنَّمَا مَثَلُ الصَّلاَةِ كَمَثَلِ نَهْرٍ غَمْرٍ عَذْبٍ بِبَابِ أَحَدِكُمْ يَقْتَحِمُ فِيهِ كُلَّ يَوْمٍ خَمْسَ مَرَّاتٍ فَمَا تَرَوْنَ ذَلِكَ يُبْقِي مِنْ دَرَنِهِ فَإِنَّكُمْ لاَ تَدْرُونَ مَا بَلَغَتْ بِهِ صَلاَتُهُ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard from Amir ibn\nSad ibn Abi Waqqas that his father said, \"There were two brothers, one\nof whom died forty nights before the other. The merit of the first was\nbeing mentioned in the presence of the Messenger of Allah, may Allah\nbless him and grant him peace, and he said, 'Wasn't the other one a\nmuslim?'  They said, 'Of course, Messenger of Allah, and there was no\nharm in him.'  The Messenger of Allah, may Allah bless him and grant\nhim peace, said, 'What will make you realise what his prayer has\nbrought him. The prayer is like a deep river of sweet water running by\nyour door into which you plunge five times a day. How much of your\ndirtiness do you think that will leave? You do not realise what his\nprayer has brought him.' \""}},{"id":101,"idInBook":101,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عَطَاءَ بْنَ يَسَارٍ، كَانَ إِذَا مَرَّ عَلَيْهِ بَعْضُ مَنْ يَبِيعُ فِي الْمَسْجِدِ دَعَاهُ فَسَأَلَهُ مَا مَعَكَ وَمَا تُرِيدُ فَإِنْ أَخْبَرَهُ أَنَّهُ يُرِيدُ أَنْ يَبِيعَهُ قَالَ عَلَيْكَ بِسُوقِ الدُّنْيَا وَإِنَّمَا هَذَا سُوقُ الآخِرَةِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that if some one\npassed by Ata ibn Yasar in the mosque with something to trade, he\nwould call him and ask, \"What is the matter with you? What do you\nwant?\" If the man said that he wished to trade with him, he would say,\n\"You need the market of this world. This is the market of the next\nworld.\""}},{"id":102,"idInBook":102,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، أَنَّهُ بَلَغَهُ أَنَّ عُمَرَ بْنَ الْخَطَّابِ، بَنَى رَحْبَةً فِي نَاحِيَةِ الْمَسْجِدِ تُسَمَّى الْبُطَيْحَاءَ وَقَالَ مَنْ كَانَ يُرِيدُ أَنْ يَلْغَطَ أَوْ يُنْشِدَ شِعْرًا أَوْ يَرْفَعَ صَوْتَهُ فَلْيَخْرُجْ إِلَى هَذِهِ الرَّحْبَةِ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik that he had heard that Umar ibn\nal-Khattab set aside an area near the mosque called al-Butayha and\nsaid, \"Whoever wishes to talk nonsense or recite poetry or raise his\nvoice should go to that area.\""}},{"id":103,"idInBook":103,"chapterId":9,"bookId":7,"arabic":"حَدَّثَنِي يَحْيَى، عَنْ مَالِكٍ، عَنْ عَمِّهِ أَبِي سُهَيْلِ بْنِ مَالِكٍ، عَنْ أَبِيهِ، أَنَّهُ سَمِعَ طَلْحَةَ بْنَ عُبَيْدِ اللَّهِ، يَقُولُ جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم مِنْ أَهْلِ نَجْدٍ ثَائِرُ الرَّأْسِ يُسْمَعُ دَوِيُّ صَوْتِهِ وَلاَ نَفْقَهُ مَا يَقُولُ حَتَّى دَنَا فَإِذَا هُوَ يَسْأَلُ عَنِ الإِسْلاَمِ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ خَمْسُ صَلَوَاتٍ فِي الْيَوْمِ وَاللَّيْلَةِ ‏\"‏ ‏.‏ قَالَ هَلْ عَلَىَّ غَيْرُهُنَّ قَالَ ‏\"‏ لاَ إِلاَّ أَنْ تَطَّوَّعَ ‏\"‏ ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَصِيَامُ شَهْرِ رَمَضَانَ ‏\"‏ ‏.‏ قَالَ هَلْ عَلَىَّ غَيْرُهُ قَالَ ‏\"‏ لاَ إِلاَّ أَنْ تَطَّوَّعَ ‏\"‏ ‏.‏ قَالَ وَذَكَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم الزَّكَاةَ ‏.‏ فَقَالَ هَلْ عَلَىَّ غَيْرُهَا قَالَ ‏\"‏ لاَ إِلاَّ أَنْ تَطَّوَّعَ ‏\"‏ ‏.‏ قَالَ فَأَدْبَرَ الرَّجُلُ وَهُوَ يَقُولُ وَاللَّهِ لاَ أَزِيدُ عَلَى هَذَا وَلاَ أَنْقُصُ مِنْهُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَفْلَحَ الرَّجُلُ إِنْ صَدَقَ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from his paternal uncle Abu Suhayl\nibn Malik that his father heard Talha ibn Ubaydullah say, \"Once one of\nthe people of Najd came to the Messenger of Allah, may Allah bless him\nand grant him peace. He had dishevelled hair and although his voice\ncould be heard we could not make out what he was saying until he drew\nnearer and then we found he was asking about Islam. The Messenger of\nAllah, may Allah bless him and grant him peace, said to him, 'There\nare five prayers during the day and the night.' He said, 'Do I have to\ndo anything else besides that?'  The Messenger of Allah, may Allah\nbless him and grant him peace, added, 'And fasting the month of\nRamadan.'  He said, 'Is there anything else I have to do?'  He said,\n'No, except what you do of your own accord.'  The Messenger of Allah,\nmay Allah bless him and grant him peace, mentioned zakat. The man\nsaid, 'Is there anything else that I have to do?' He said, 'No, except\nwhat you do of your own accord.'\n\n\nHe continued, \"The man went\naway saying, 'By Allah, I won't do any more than this, nor will I do\nany less.' The Messenger of Allah, may Allah bless him and grant him\npeace, said, 'That man will be successful, if he is telling the\ntruth.'"}},{"id":104,"idInBook":104,"chapterId":9,"bookId":7,"arabic":"وَحَدَّثَنِي عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ يَعْقِدُ الشَّيْطَانُ عَلَى قَافِيَةِ رَأْسِ أَحَدِكُمْ إِذَا هُوَ نَامَ ثَلاَثَ عُقَدٍ يَضْرِبُ مَكَانَ كُلِّ عُقْدَةٍ عَلَيْكَ لَيْلٌ طَوِيلٌ فَارْقُدْ فَإِنِ اسْتَيْقَظَ فَذَكَرَ اللَّهَ انْحَلَّتْ عُقْدَةٌ فَإِنْ تَوَضَّأَ انْحَلَّتْ عُقْدَةٌ فَإِنْ صَلَّى انْحَلَّتْ عُقَدُهُ فَأَصْبَحَ نَشِيطًا طَيِّبَ النَّفْسِ وَإِلاَّ أَصْبَحَ خَبِيثَ النَّفْسِ كَسْلاَنَ ‏\"‏ ‏.‏","english":{"narrator":"","text":"Yahya related to me from Malik from Abu'z-Zinad from al-Araj from\nAbu Hurayra that the Messenger of Allah, may Allah bless him and grant\nhim peace, said, \"Shaytan ties three knots at the back of your head\nwhen you sleep, and he seals the place of each knot with 'You have a\nlong night ahead, so sleep.' If you wake up and remember Allah, a knot\nis untied. If you do wudu, a knot is untied. If you pray, a knot is\nuntied, and morning finds you lively and in good spirits, and if not,\nmorning finds you in bad spirits and lazy.\""}}],"chapter":{"id":9,"bookId":7,"arabic":"كتاب قصر الصلاة فى السفر","english":"Shortening the Prayer"}}