{"metadata":{"length":51,"arabic":{"title":"صحيح البخاري","author":"الإمام محمد بن إسماعيل البخاري","introduction":"كتاب الإيمان"},"english":{"title":"Sahih al-Bukhari","author":"Imam Muhammad ibn Ismail al-Bukhari","introduction":"Belief"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":2,"bookId":1,"arabic":"حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، قَالَ أَخْبَرَنَا حَنْظَلَةُ بْنُ أَبِي سُفْيَانَ، عَنْ عِكْرِمَةَ بْنِ خَالِدٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ بُنِيَ الإِسْلاَمُ عَلَى خَمْسٍ شَهَادَةِ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، وَإِقَامِ الصَّلاَةِ، وَإِيتَاءِ الزَّكَاةِ، وَالْحَجِّ، وَصَوْمِ رَمَضَانَ ‏\"‏‏.‏","english":{"narrator":"Narrated Ibn 'Umar:","text":"Allah's Messenger (ﷺ) said: Islam is based on (the following) five \n     (principles):\n\n\n     1. To testify that none has the right to be worshipped but Allah and \n     Muhammad is Allah's Messenger (ﷺ).\n\n\n     2. To offer the (compulsory congregational) prayers dutifully and \n     perfectly.\n\n\n     3. To pay Zakat (i.e. obligatory charity) .\n\n\n     4. To perform Hajj. (i.e. Pilgrimage to Mecca)\n\n\n     5. To observe fast during the month of Ramadan."}},{"id":2,"idInBook":2,"chapterId":2,"bookId":1,"arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا أَبُو عَامِرٍ الْعَقَدِيُّ، قَالَ حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الإِيمَانُ بِضْعٌ وَسِتُّونَ شُعْبَةً، وَالْحَيَاءُ شُعْبَةٌ مِنَ الإِيمَانِ ‏\"‏‏.‏","english":{"narrator":"Narrated Abu Huraira:","text":"The Prophet (ﷺ) said, \"Faith (Belief) consists of more than sixty branches\n     (i.e. parts). And Haya (This term \"Haya\" covers a large number of \n     concepts which are to be taken together; amongst them are self \n     respect, modesty, bashfulness, and scruple, etc.) is a part of \n     faith.\""}},{"id":3,"idInBook":3,"chapterId":2,"bookId":1,"arabic":"حَدَّثَنَا آدَمُ بْنُ أَبِي إِيَاسٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي السَّفَرِ، وَإِسْمَاعِيلَ، عَنِ الشَّعْبِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْمُسْلِمُ مَنْ سَلِمَ الْمُسْلِمُونَ مِنْ لِسَانِهِ وَيَدِهِ، وَالْمُهَاجِرُ مَنْ هَجَرَ مَا نَهَى اللَّهُ عَنْهُ ‏\"‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ وَقَالَ أَبُو مُعَاوِيَةَ حَدَّثَنَا دَاوُدُ عَنْ عَامِرٍ قَالَ سَمِعْتُ عَبْدَ اللَّهِ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ وَقَالَ عَبْدُ الأَعْلَى عَنْ دَاوُدَ عَنْ عَامِرٍ عَنْ عَبْدِ اللَّهِ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏","english":{"narrator":"Narrated 'Abdullah bin 'Amr:","text":"The Prophet (ﷺ) said, \"A Muslim is the one who avoids harming Muslims with\n     his tongue and hands. And a Muhajir (emigrant) is the one who gives up\n     (abandons) all what Allah has forbidden.\""}},{"id":4,"idInBook":4,"chapterId":2,"bookId":1,"arabic":"حَدَّثَنَا سَعِيدُ بْنُ يَحْيَى بْنِ سَعِيدٍ الْقُرَشِيِّ، قَالَ حَدَّثَنَا أَبِي قَالَ، حَدَّثَنَا أَبُو بُرْدَةَ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي بُرْدَةَ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى ـ رضى الله عنه ـ قَالَ قَالُوا يَا رَسُولَ اللَّهِ أَىُّ الإِسْلاَمِ أَفْضَلُ قَالَ ‏\n\"‏ مَنْ سَلِمَ الْمُسْلِمُونَ مِنْ لِسَانِهِ وَيَدِهِ ‏\"‏‏.‏","english":{"narrator":"Narrated Abu Musa:","text":"Some people asked Allah's Messenger (ﷺ), \"Whose Islam is the best? i.e. (Who\n     is a very good Muslim)?\" He replied, \"One who avoids harming the \n     Muslims with his tongue and hands.\""}},{"id":5,"idInBook":5,"chapterId":2,"bookId":1,"arabic":"حَدَّثَنَا عَمْرُو بْنُ خَالِدٍ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ يَزِيدَ، عَنْ أَبِي الْخَيْرِ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو ـ رضى الله عنهما ـ أَنَّ رَجُلاً، سَأَلَ النَّبِيَّ صلى الله عليه وسلم أَىُّ الإِسْلاَمِ خَيْرٌ قَالَ ‏\n\"‏ تُطْعِمُ الطَّعَامَ، وَتَقْرَأُ السَّلاَمَ عَلَى مَنْ عَرَفْتَ وَمَنْ لَمْ تَعْرِفْ ‏\"‏‏.‏","english":{"narrator":"Narrated 'Abdullah bin 'Amr:","text":"A man asked the Prophet (ﷺ) , \"What sort of deeds or (what qualities of) \n     Islam are good?\" The Prophet (ﷺ) replied, 'To feed (the poor) and greet \n     those whom you know and those whom you do not Know (See \n     Hadith No. 27)."}},{"id":6,"idInBook":6,"chapterId":2,"bookId":1,"arabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ شُعْبَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏\nوَعَنْ حُسَيْنٍ الْمُعَلِّمِ، قَالَ حَدَّثَنَا قَتَادَةُ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لا يُؤْمِنُ أَحَدُكُمْ حَتَّى يُحِبَّ لأَخِيهِ مَا يُحِبُّ لِنَفْسِهِ ‏\"‏‏.‏","english":{"narrator":"Narrated Anas:","text":"The Prophet (ﷺ) said, \"None of you will have faith till he wishes for his \n     (Muslim) brother what he likes for himself.\""}},{"id":7,"idInBook":7,"chapterId":2,"bookId":1,"arabic":"حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، قَالَ حَدَّثَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ فَوَالَّذِي نَفْسِي بِيَدِهِ لاَ يُؤْمِنُ أَحَدُكُمْ حَتَّى أَكُونَ أَحَبَّ إِلَيْهِ مِنْ وَالِدِهِ وَوَلَدِهِ ‏\"‏‏.‏","english":{"narrator":"Narrated Abu Huraira:","text":"\"Allah's Messenger (ﷺ) said, \"By Him in Whose Hands my life is, none of you \n     will have faith till he loves me more than his father and his \n     children.\""}},{"id":8,"idInBook":8,"chapterId":2,"bookId":1,"arabic":"حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا ابْنُ عُلَيَّةَ، عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم ح وَحَدَّثَنَا آدَمُ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ لاَ يُؤْمِنُ أَحَدُكُمْ حَتَّى أَكُونَ أَحَبَّ إِلَيْهِ مِنْ وَالِدِهِ وَوَلَدِهِ وَالنَّاسِ أَجْمَعِينَ ‏\"‏‏.‏","english":{"narrator":"Narrated Anas:","text":"The Prophet (ﷺ) said \"None of you will have faith till he loves me more \n     than his father, his children and all mankind.\""}},{"id":9,"idInBook":9,"chapterId":2,"bookId":1,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ، قَالَ حَدَّثَنَا أَيُّوبُ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ ثَلاَثٌ مَنْ كُنَّ فِيهِ وَجَدَ حَلاَوَةَ الإِيمَانِ أَنْ يَكُونَ اللَّهُ وَرَسُولُهُ أَحَبَّ إِلَيْهِ مِمَّا سِوَاهُمَا، وَأَنْ يُحِبَّ الْمَرْءَ لاَ يُحِبُّهُ إِلاَّ لِلَّهِ، وَأَنْ يَكْرَهَ أَنْ يَعُودَ فِي الْكُفْرِ كَمَا يَكْرَهُ أَنْ يُقْذَفَ فِي النَّارِ ‏\"‏‏.‏","english":{"narrator":"Narrated Anas:","text":"The Prophet (ﷺ) said, \"Whoever possesses the following three qualities \n     will have the sweetness (delight) of faith:\n\n\n     1. The one to whom Allah and His Apostle becomes dearer than anything \n     else.\n\n\n     2. Who loves a person and he loves him only for Allah's sake.\n\n\n     3. Who hates to revert to Atheism (disbelief) as he hates to be thrown\n     into the fire.\""}},{"id":10,"idInBook":10,"chapterId":2,"bookId":1,"arabic":"حَدَّثَنَا أَبُو الْوَلِيدِ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ جَبْرٍ، قَالَ سَمِعْتُ أَنَسًا، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ آيَةُ الإِيمَانِ حُبُّ الأَنْصَارِ، وَآيَةُ النِّفَاقِ بُغْضُ الأَنْصَارِ ‏\"‏‏.‏","english":{"narrator":"Narrated Anas:","text":"The Prophet (ﷺ) said, \"Love for the Ansar is a sign of faith and hatred \n     for the Ansar is a sign of hypocrisy.\""}},{"id":11,"idInBook":11,"chapterId":2,"bookId":1,"arabic":"حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي أَبُو إِدْرِيسَ، عَائِذُ اللَّهِ بْنُ عَبْدِ اللَّهِ أَنَّ عُبَادَةَ بْنَ الصَّامِتِ ـ رضى الله عنه ـ وَكَانَ شَهِدَ بَدْرًا، وَهُوَ أَحَدُ النُّقَبَاءِ لَيْلَةَ الْعَقَبَةِ ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ وَحَوْلَهُ عِصَابَةٌ مِنْ أَصْحَابِهِ ‏\n\"‏ بَايِعُونِي عَلَى أَنْ لاَ تُشْرِكُوا بِاللَّهِ شَيْئًا، وَلاَ تَسْرِقُوا، وَلاَ تَزْنُوا، وَلاَ تَقْتُلُوا أَوْلاَدَكُمْ، وَلاَ تَأْتُوا بِبُهْتَانٍ تَفْتَرُونَهُ بَيْنَ أَيْدِيكُمْ وَأَرْجُلِكُمْ، وَلاَ تَعْصُوا فِي مَعْرُوفٍ، فَمَنْ وَفَى مِنْكُمْ فَأَجْرُهُ عَلَى اللَّهِ، وَمَنْ أَصَابَ مِنْ ذَلِكَ شَيْئًا فَعُوقِبَ فِي الدُّنْيَا فَهُوَ كَفَّارَةٌ لَهُ، وَمَنْ أَصَابَ مِنْ ذَلِكَ شَيْئًا ثُمَّ سَتَرَهُ اللَّهُ، فَهُوَ إِلَى اللَّهِ إِنْ شَاءَ عَفَا عَنْهُ، وَإِنْ شَاءَ عَاقَبَهُ ‏\"‏‏.‏ فَبَايَعْنَاهُ عَلَى ذَلِكَ‏.‏","english":{"narrator":"Narrated 'Ubada bin As-Samit:","text":"who took part in the battle of Badr and was a Naqib (a person heading \n     a group of six persons), on the night of Al-'Aqaba pledge: Allah's \n     Apostle said while a group of his companions were around him, \"Swear \n     allegiance to me for:\n\n\n     1. Not to join anything in worship along with Allah.\n\n\n     2. Not to steal.\n\n\n     3. Not to commit illegal sexual intercourse.\n\n\n     4. Not to kill your children.\n\n\n     5. Not to accuse an innocent person (to spread such an accusation \n     among people).\n\n\n     6. Not to be disobedient (when ordered) to do good deed.\"\n\n\n     The Prophet (ﷺ) added: \"Whoever among you fulfills his pledge will be \n     rewarded by Allah. And whoever indulges in any one of them (except the\n     ascription of partners to Allah) and gets the punishment in this \n     world, that punishment will be an expiation for that sin. And if one \n     indulges in any of them, and Allah conceals his sin, it is up to Him \n     to forgive or punish him (in the Hereafter).\" 'Ubada bin As-Samit \n     added: \"So we swore allegiance for these.\" (points to Allah's \n     Apostle)"}},{"id":12,"idInBook":12,"chapterId":2,"bookId":1,"arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي صَعْصَعَةَ، عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّهُ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ يُوشِكُ أَنْ يَكُونَ خَيْرَ مَالِ الْمُسْلِمِ غَنَمٌ يَتْبَعُ بِهَا شَعَفَ الْجِبَالِ وَمَوَاقِعَ الْقَطْرِ، يَفِرُّ بِدِينِهِ مِنَ الْفِتَنِ ‏\"‏‏.‏","english":{"narrator":"Narrated Abu Said Al-Khudri:","text":"Allah's Messenger (ﷺ) said, \"A time will soon come when the best property of a Muslim will be sheep which he will take on the top of mountains and the places of rainfall (valleys) so as to flee with his religion from afflictions.\""}},{"id":13,"idInBook":13,"chapterId":2,"bookId":1,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، قَالَ أَخْبَرَنَا عَبْدَةُ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا أَمَرَهُمْ أَمَرَهُمْ مِنَ الأَعْمَالِ بِمَا يُطِيقُونَ قَالُوا إِنَّا لَسْنَا كَهَيْئَتِكَ يَا رَسُولَ اللَّهِ، إِنَّ اللَّهَ قَدْ غَفَرَ لَكَ مَا تَقَدَّمَ مِنْ ذَنْبِكَ وَمَا تَأَخَّرَ‏.‏ فَيَغْضَبُ حَتَّى يُعْرَفَ الْغَضَبُ فِي وَجْهِهِ ثُمَّ يَقُولُ ‏\n\"‏ إِنَّ أَتْقَاكُمْ وَأَعْلَمَكُمْ بِاللَّهِ أَنَا ‏\"‏‏.‏","english":{"narrator":"Narrated 'Aisha:","text":"Whenever Allah's Messenger (ﷺ) ordered the Muslims to do something, he used \n     to order them deeds which were easy for them to do, (according to \n     their strength and endurance). They said, \"O Allah's Messenger (ﷺ)! We are not \n     like you. Allah  has forgiven your past and future sins.\" So Allah's \n     Apostle became angry and it was apparent on his face. He said, \"I am \n     the most Allah fearing, and know Allah better than all of you do.\""}},{"id":14,"idInBook":14,"chapterId":2,"bookId":1,"arabic":"حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ ثَلاَثٌ مَنْ كُنَّ فِيهِ وَجَدَ حَلاَوَةَ الإِيمَانِ مَنْ كَانَ اللَّهُ وَرَسُولُهُ أَحَبَّ إِلَيْهِ مِمَّا سِوَاهُمَا، وَمَنْ أَحَبَّ عَبْدًا لاَ يُحِبُّهُ إِلاَّ لِلَّهِ، وَمَنْ يَكْرَهُ أَنْ يَعُودَ فِي الْكُفْرِ بَعْدَ إِذْ أَنْقَذَهُ اللَّهُ، كَمَا يَكْرَهُ أَنْ يُلْقَى فِي النَّارِ ‏\"‏‏.‏","english":{"narrator":"Narrated Anas:","text":"The Prophet (ﷺ) said, \"Whoever possesses the following three qualities \n     will taste the sweetness of faith:\n\n\n     1. The one to whom Allah and His Apostle become dearer than anything \n     else.\n\n\n     2. Who loves a person and he loves him only for Allah's sake.\n\n\n     3. Who hates to revert to disbelief (Atheism) after Allah has brought \n     (saved) him out from it, as he hates to be thrown in fire.\""}},{"id":15,"idInBook":15,"chapterId":2,"bookId":1,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ عَمْرِو بْنِ يَحْيَى الْمَازِنِيِّ، عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ يَدْخُلُ أَهْلُ الْجَنَّةِ الْجَنَّةَ، وَأَهْلُ النَّارِ النَّارَ، ثُمَّ يَقُولُ اللَّهُ تَعَالَى أَخْرِجُوا مَنْ كَانَ فِي قَلْبِهِ مِثْقَالُ حَبَّةٍ مِنْ خَرْدَلٍ مِنْ إِيمَانٍ‏.‏ فَيُخْرَجُونَ مِنْهَا قَدِ اسْوَدُّوا فَيُلْقَوْنَ فِي نَهَرِ الْحَيَا ـ أَوِ الْحَيَاةِ، شَكَّ مَالِكٌ ـ فَيَنْبُتُونَ كَمَا تَنْبُتُ الْحِبَّةُ فِي جَانِبِ السَّيْلِ، أَلَمْ تَرَ أَنَّهَا تَخْرُجُ صَفْرَاءَ مُلْتَوِيَةً ‏\"‏‏.‏ قَالَ وُهَيْبٌ حَدَّثَنَا عَمْرٌو ‏\"‏ الْحَيَاةِ ‏\"‏‏.‏ وَقَالَ ‏\"‏ خَرْدَلٍ مِنْ خَيْرٍ ‏\"‏‏.‏","english":{"narrator":"Narrated Abu Said Al-Khudri:","text":"The Prophet (ﷺ) said, \"When the people of Paradise will enter Paradise and\n     the people of Hell will go to Hell, Allah will order those who have \n     had faith equal to the weight of a grain of mustard seed to be taken \n     out from Hell. So they will be taken out but (by then) they will be \n     blackened (charred). Then they will be put in the river of Haya' \n     (rain) or Hayat (life) (the Narrator is in doubt as to which is the \n     right term), and they will revive like a grain that grows near the \n     bank of a flood channel. Don't you see that it comes out yellow and \n     twisted\""}},{"id":16,"idInBook":16,"chapterId":2,"bookId":1,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدِ اللَّهِ، قَالَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي أُمَامَةَ بْنِ سَهْلٍ، أَنَّهُ سَمِعَ أَبَا سَعِيدٍ الْخُدْرِيَّ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ بَيْنَا أَنَا نَائِمٌ رَأَيْتُ النَّاسَ يُعْرَضُونَ عَلَىَّ، وَعَلَيْهِمْ قُمُصٌ مِنْهَا مَا يَبْلُغُ الثُّدِيَّ، وَمِنْهَا مَا دُونَ ذَلِكَ، وَعُرِضَ عَلَىَّ عُمَرُ بْنُ الْخَطَّابِ وَعَلَيْهِ قَمِيصٌ يَجُرُّهُ ‏\"‏‏.‏ قَالُوا فَمَا أَوَّلْتَ ذَلِكَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ الدِّينَ ‏\"‏‏.‏","english":{"narrator":"Narrated Abu Said Al-Khudri:","text":"Allah's Messenger (ﷺ) said, \"While I was sleeping I saw (in a dream) some \n     people wearing shirts of which some were reaching up to the breasts \n     only while others were even shorter than that. Umar bin Al-Khattab was\n     shown wearing a shirt that he was dragging.\" The people asked, \"How \n     did you interpret it? (What is its interpretation) O Allah's Messenger (ﷺ)?\"\n     He (the Prophet (ﷺ) ) replied, \"It is the Religion.\""}},{"id":17,"idInBook":17,"chapterId":2,"bookId":1,"arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكُ بْنُ أَنَسٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم مَرَّ عَلَى رَجُلٍ مِنَ الأَنْصَارِ وَهُوَ يَعِظُ أَخَاهُ فِي الْحَيَاءِ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ دَعْهُ فَإِنَّ الْحَيَاءَ مِنَ الإِيمَانِ ‏\"‏‏.‏","english":{"narrator":"Narrated 'Abdullah (bin 'Umar):","text":"Once Allah's Messenger (ﷺ) passed by an Ansari (man) who was admonishing\n     his brother regarding Haya'. On that Allah's Messenger (ﷺ) said, \"Leave him \n     as Haya' is a part of faith.\" (See Hadith 9)"}},{"id":18,"idInBook":18,"chapterId":2,"bookId":1,"arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ الْمُسْنَدِيُّ، قَالَ حَدَّثَنَا أَبُو رَوْحٍ الْحَرَمِيُّ بْنُ عُمَارَةَ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ وَاقِدِ بْنِ مُحَمَّدٍ، قَالَ سَمِعْتُ أَبِي يُحَدِّثُ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَشْهَدُوا أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، وَيُقِيمُوا الصَّلاَةَ، وَيُؤْتُوا الزَّكَاةَ، فَإِذَا فَعَلُوا ذَلِكَ عَصَمُوا مِنِّي دِمَاءَهُمْ وَأَمْوَالَهُمْ إِلاَّ بِحَقِّ الإِسْلاَمِ، وَحِسَابُهُمْ عَلَى اللَّهِ ‏\"‏‏.‏","english":{"narrator":"Narrated Ibn 'Umar:","text":"Allah's Messenger (ﷺ) said: \"I have been ordered (by Allah) to fight against\n     the people until they testify that none has the right to be worshipped\n     but Allah and that Muhammad is Allah's Messenger (ﷺ), and offer the prayers \n     perfectly and give the obligatory charity, so if they perform that, \n     then they save their lives and property from me except for Islamic laws\n     and then their reckoning (accounts) will be done by Allah.\""}},{"id":19,"idInBook":19,"chapterId":2,"bookId":1,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، وَمُوسَى بْنُ إِسْمَاعِيلَ، قَالاَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، قَالَ حَدَّثَنَا ابْنُ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم سُئِلَ أَىُّ الْعَمَلِ أَفْضَلُ فَقَالَ ‏\"‏ إِيمَانٌ بِاللَّهِ وَرَسُولِهِ ‏\"‏‏.‏ قِيلَ ثُمَّ مَاذَا قَالَ ‏\"‏ الْجِهَادُ فِي سَبِيلِ اللَّهِ ‏\"‏‏.‏ قِيلَ ثُمَّ مَاذَا قَالَ ‏\"‏ حَجٌّ مَبْرُورٌ ‏\"‏‏.‏","english":{"narrator":"Narrated Abu Huraira:","text":"Allah's Messenger (ﷺ) was asked, \"What is the best deed?\" He replied, \"To \n     believe in Allah and His Apostle (Muhammad). The questioner then \n     asked, \"What is the next (in goodness)? He replied, \"To participate in\n     Jihad (religious fighting) in Allah's Cause.\" The questioner again \n     asked, \"What is the next (in goodness)?\" He replied, \"To perform Hajj \n     (Pilgrim age to Mecca) 'Mubrur, (which is accepted by Allah and is \n     performed with the intention of seeking Allah's pleasure only and not \n     to show off and without committing a sin and in accordance with the \n     traditions of the Prophet).\""}},{"id":20,"idInBook":20,"chapterId":2,"bookId":1,"arabic":"حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عَامِرُ بْنُ سَعْدِ بْنِ أَبِي وَقَّاصٍ، عَنْ سَعْدٍ، رضى الله عنه أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَعْطَى رَهْطًا وَسَعْدٌ جَالِسٌ، فَتَرَكَ رَسُولُ اللَّهِ صلى الله عليه وسلم رَجُلاً هُوَ أَعْجَبُهُمْ إِلَىَّ فَقُلْتُ يَا رَسُولَ اللَّهِ مَا لَكَ عَنْ فُلاَنٍ فَوَاللَّهِ إِنِّي لأَرَاهُ مُؤْمِنًا‏.‏ فَقَالَ ‏\"‏ أَوْ مُسْلِمًا ‏\"‏‏.‏ فَسَكَتُّ قَلِيلاً، ثُمَّ غَلَبَنِي مَا أَعْلَمُ مِنْهُ فَعُدْتُ لِمَقَالَتِي فَقُلْتُ مَا لَكَ عَنْ فُلاَنٍ فَوَاللَّهِ إِنِّي لأَرَاهُ مُؤْمِنًا فَقَالَ ‏\"‏ أَوْ مُسْلِمًا ‏\"‏‏.‏ ثُمَّ غَلَبَنِي مَا أَعْلَمُ مِنْهُ فَعُدْتُ لِمَقَالَتِي وَعَادَ رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ قَالَ ‏\"‏ يَا سَعْدُ، إِنِّي لأُعْطِي الرَّجُلَ وَغَيْرُهُ أَحَبُّ إِلَىَّ مِنْهُ، خَشْيَةَ أَنْ يَكُبَّهُ اللَّهُ فِي النَّارِ ‏\"‏‏.‏ وَرَوَاهُ يُونُسُ وَصَالِحٌ وَمَعْمَرٌ وَابْنُ أَخِي الزُّهْرِيِّ عَنِ الزُّهْرِيِّ‏.‏","english":{"narrator":"Narrated Sa'd:","text":"Allah's Messenger (ﷺ) distributed (Zakat) amongst (a group of) people while \n     I was sitting there but Allah's Messenger (ﷺ) left a man whom I thought the \n     best of the lot. I asked, \"O Allah's Messenger (ﷺ)! Why have you left that \n     person? By Allah I regard him as a faithful believer.\" The Prophet (ﷺ) \n     commented: \"Or merely a Muslim.\" I remained quiet for a while, but \n     could not help repeating my question because of what I knew about him.\n     And then asked Allah's Messenger (ﷺ), \"Why have you left so and so? By \n     Allah! He is a faithful believer.\" The Prophet (ﷺ) again said, \"Or merely \n     a Muslim.\" And I could not help repeating my question because of what \n     I knew about him. Then the Prophet (ﷺ) said, \"O Sa'd! I give to a person \n     while another is dearer to me, for fear that he might be thrown on his\n     face in the Fire by Allah.\""}},{"id":21,"idInBook":21,"chapterId":2,"bookId":1,"arabic":"حَدَّثَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ أَبِي الْخَيْرِ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، أَنَّ رَجُلاً، سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم أَىُّ الإِسْلاَمِ خَيْرٌ قَالَ ‏\n\"‏ تُطْعِمُ الطَّعَامَ، وَتَقْرَأُ السَّلاَمَ عَلَى مَنْ عَرَفْتَ وَمَنْ لَمْ تَعْرِفْ ‏\"‏‏.‏","english":{"narrator":"Narrated 'Abdullah bin 'Amr:","text":"A person asked Allah's Messenger (ﷺ) . \"What (sort of) deeds in or (what \n     qualities of) Islam are good?\" He replied, \"To feed (the poor) and \n     greet those whom you know and those whom you don't know.\""}},{"id":22,"idInBook":22,"chapterId":2,"bookId":1,"arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أُرِيتُ النَّارَ فَإِذَا أَكْثَرُ أَهْلِهَا النِّسَاءُ يَكْفُرْنَ ‏\"‏‏.‏ قِيلَ أَيَكْفُرْنَ بِاللَّهِ قَالَ ‏\"‏ يَكْفُرْنَ الْعَشِيرَ، وَيَكْفُرْنَ الإِحْسَانَ، لَوْ أَحْسَنْتَ إِلَى إِحْدَاهُنَّ الدَّهْرَ ثُمَّ رَأَتْ مِنْكَ شَيْئًا قَالَتْ مَا رَأَيْتُ مِنْكَ خَيْرًا قَطُّ ‏\"‏‏.‏","english":{"narrator":"Narrated Ibn 'Abbas:","text":"The Prophet (ﷺ) said: \"I was shown the Hell-fire and that the majority of \n     its dwellers were women who were ungrateful.\" It was asked, \"Do they \n     disbelieve in Allah?\" (or are they ungrateful to Allah?) He replied, \n     \"They are ungrateful to their husbands and are ungrateful for the \n     favors and the good (charitable deeds) done to them. If you have \n     always been good (benevolent) to one of them and then she sees \n     something in you (not of her liking), she will say, 'I have never \n     received any good from you.\""}},{"id":23,"idInBook":23,"chapterId":2,"bookId":1,"arabic":"حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ وَاصِلٍ الأَحْدَبِ، عَنِ الْمَعْرُورِ، قَالَ لَقِيتُ أَبَا ذَرٍّ بِالرَّبَذَةِ، وَعَلَيْهِ حُلَّةٌ، وَعَلَى غُلاَمِهِ حُلَّةٌ، فَسَأَلْتُهُ عَنْ ذَلِكَ، فَقَالَ إِنِّي سَابَبْتُ رَجُلاً، فَعَيَّرْتُهُ بِأُمِّهِ، فَقَالَ لِيَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ يَا أَبَا ذَرٍّ أَعَيَّرْتَهُ بِأُمِّهِ إِنَّكَ امْرُؤٌ فِيكَ جَاهِلِيَّةٌ، إِخْوَانُكُمْ خَوَلُكُمْ، جَعَلَهُمُ اللَّهُ تَحْتَ أَيْدِيكُمْ، فَمَنْ كَانَ أَخُوهُ تَحْتَ يَدِهِ فَلْيُطْعِمْهُ مِمَّا يَأْكُلُ، وَلْيُلْبِسْهُ مِمَّا يَلْبَسُ، وَلاَ تُكَلِّفُوهُمْ مَا يَغْلِبُهُمْ، فَإِنْ كَلَّفْتُمُوهُمْ فَأَعِينُوهُمْ ‏\"‏‏.‏","english":{"narrator":"Narrated Al-Ma'rur:","text":"At Ar-Rabadha I met Abu Dhar who was wearing a cloak, and his slave, \n     too, was wearing a similar one. I asked about the reason for it. He \n     replied, \"I abused a person by calling his mother with bad names.\" The\n     Prophet said to me, 'O Abu Dhar! Did you abuse him by calling his \n     mother with bad names You still have some characteristics of \n     ignorance. Your slaves are your brothers and Allah has put them under \n     your command. So whoever has a brother under his command should feed \n     him of what he eats and dress him of what he wears. Do not ask them \n     (slaves) to do things beyond their capacity (power) and if you do so, \n     then help them.' \""}},{"id":24,"idInBook":24,"chapterId":2,"bookId":1,"arabic":"حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ الْمُبَارَكِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، حَدَّثَنَا أَيُّوبُ، وَيُونُسُ، عَنِ الْحَسَنِ، عَنِ الأَحْنَفِ بْنِ قَيْسٍ، قَالَ ذَهَبْتُ لأَنْصُرَ هَذَا الرَّجُلَ، فَلَقِيَنِي أَبُو بَكْرَةَ فَقَالَ أَيْنَ تُرِيدُ قُلْتُ أَنْصُرُ هَذَا الرَّجُلَ‏.‏ قَالَ ارْجِعْ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ إِذَا الْتَقَى الْمُسْلِمَانِ بِسَيْفَيْهِمَا فَالْقَاتِلُ وَالْمَقْتُولُ فِي النَّارِ ‏\"‏‏.‏ فَقُلْتُ يَا رَسُولَ اللَّهِ هَذَا الْقَاتِلُ فَمَا بَالُ الْمَقْتُولِ قَالَ ‏\"‏ إِنَّهُ كَانَ حَرِيصًا عَلَى قَتْلِ صَاحِبِهِ ‏\"‏‏.‏","english":{"narrator":"Narrated Al-Ahnaf bin Qais:","text":"While I was going to help this man ('Ali Ibn Abi Talib), Abu Bakra met\n     me and asked, \"Where are you going?\" I replied, \"I am going to help \n     that person.\" He said, \"Go back for I have heard Allah's Messenger (ﷺ) \n     saying, 'When two Muslims fight (meet) each other with their swords, \n     both the murderer as well as the murdered will go to the Hell-fire.' I\n     said, 'O Allah's Messenger (ﷺ)! It is all right for the murderer but what \n     about the murdered one?' Allah's Messenger (ﷺ) replied, \"He surely had the \n     intention to kill his companion.\""}},{"id":25,"idInBook":25,"chapterId":2,"bookId":1,"arabic":"حَدَّثَنَا أَبُو الْوَلِيدِ، قَالَ حَدَّثَنَا شُعْبَةُ، ح‏.‏ قَالَ وَحَدَّثَنِي بِشْرٌ، قَالَ حَدَّثَنَا مُحَمَّدٌ، عَنْ شُعْبَةَ، عَنْ سُلَيْمَانَ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، قَالَ لَمَّا نَزَلَتِ ‏{‏الَّذِينَ آمَنُوا وَلَمْ يَلْبِسُوا إِيمَانَهُمْ بِظُلْمٍ‏}‏ قَالَ أَصْحَابُ رَسُولِ اللَّهِ صلى الله عليه وسلم أَيُّنَا لَمْ يَظْلِمْ فَأَنْزَلَ اللَّهُ ‏{‏إِنَّ الشِّرْكَ لَظُلْمٌ عَظِيمٌ‏}‏‏.‏","english":{"narrator":"Narrated 'Abdullah:","text":"When the following Verse was revealed: \"It is those who believe and \n     confuse not their belief with wrong (worshipping others besides \n     Allah.)\" (6:83), the companions of Allah's Messenger (ﷺ) asked, \"Who is \n     amongst us who had not done injustice (wrong)?\" Allah revealed: \"No \n     doubt, joining others in worship with Allah is a great injustice \n     (wrong) indeed.\" (31.13)"}},{"id":26,"idInBook":26,"chapterId":2,"bookId":1,"arabic":"حَدَّثَنَا سُلَيْمَانُ أَبُو الرَّبِيعِ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، قَالَ حَدَّثَنَا نَافِعُ بْنُ مَالِكِ بْنِ أَبِي عَامِرٍ أَبُو سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ آيَةُ الْمُنَافِقِ ثَلاَثٌ إِذَا حَدَّثَ كَذَبَ، وَإِذَا وَعَدَ أَخْلَفَ، وَإِذَا اؤْتُمِنَ خَانَ ‏\"‏‏.‏","english":{"narrator":"Narrated Abu Huraira:","text":"The Prophet (ﷺ) said, \"The signs of a hypocrite are three:\n\n\n     1. Whenever he speaks, he tells a lie.\n\n\n     2. Whenever he promises, he always breaks it (his promise ).\n\n\n     3. If you trust him, he proves to be dishonest. (If you keep something\n     as a trust with him, he will not return it.)\""}},{"id":27,"idInBook":27,"chapterId":2,"bookId":1,"arabic":"حَدَّثَنَا قَبِيصَةُ بْنُ عُقْبَةَ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ، عَنْ مَسْرُوقٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَرْبَعٌ مَنْ كُنَّ فِيهِ كَانَ مُنَافِقًا خَالِصًا، وَمَنْ كَانَتْ فِيهِ خَصْلَةٌ مِنْهُنَّ كَانَتْ فِيهِ خَصْلَةٌ مِنَ النِّفَاقِ حَتَّى يَدَعَهَا إِذَا اؤْتُمِنَ خَانَ وَإِذَا حَدَّثَ كَذَبَ وَإِذَا عَاهَدَ غَدَرَ، وَإِذَا خَاصَمَ فَجَرَ ‏\"‏‏.‏ تَابَعَهُ شُعْبَةُ عَنِ الأَعْمَشِ‏.‏","english":{"narrator":"Narrated 'Abdullah bin 'Amr:","text":"The Prophet (ﷺ) said, \"Whoever has the following four (characteristics) \n     will be a pure hypocrite and whoever has one of the following four \n     characteristics will have one characteristic of hypocrisy unless and \n     until he gives it up.\n\n\n     1. Whenever he is entrusted, he betrays.\n\n\n     2. Whenever he speaks, he tells a lie.\n\n\n     3. Whenever he makes a covenant, he proves treacherous.\n\n\n     4. Whenever he quarrels, he behaves in a very imprudent, evil and \n     insulting manner.\""}},{"id":28,"idInBook":28,"chapterId":2,"bookId":1,"arabic":"حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، قَالَ حَدَّثَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ يَقُمْ لَيْلَةَ الْقَدْرِ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ ‏\"‏‏.‏","english":{"narrator":"Narrated Abu Huraira:","text":"Allah's Messenger (ﷺ) said, \"Whoever establishes the prayers on the night of\n     Qadr out of sincere faith and hoping to attain Allah's rewards (not to\n     show off) then all his past sins will be forgiven.\""}},{"id":29,"idInBook":29,"chapterId":2,"bookId":1,"arabic":"حَدَّثَنَا حَرَمِيُّ بْنُ حَفْصٍ، قَالَ حَدَّثَنَا عَبْدُ الْوَاحِدِ، قَالَ حَدَّثَنَا عُمَارَةُ، قَالَ حَدَّثَنَا أَبُو زُرْعَةَ بْنُ عَمْرِو بْنِ جَرِيرٍ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ انْتَدَبَ اللَّهُ لِمَنْ خَرَجَ فِي سَبِيلِهِ لاَ يُخْرِجُهُ إِلاَّ إِيمَانٌ بِي وَتَصْدِيقٌ بِرُسُلِي أَنْ أُرْجِعَهُ بِمَا نَالَ مِنْ أَجْرٍ أَوْ غَنِيمَةٍ، أَوْ أُدْخِلَهُ الْجَنَّةَ، وَلَوْلاَ أَنْ أَشُقَّ عَلَى أُمَّتِي مَا قَعَدْتُ خَلْفَ سَرِيَّةٍ، وَلَوَدِدْتُ أَنِّي أُقْتَلُ فِي سَبِيلِ اللَّهِ ثُمَّ أُحْيَا، ثُمَّ أُقْتَلُ ثُمَّ أُحْيَا، ثُمَّ أُقْتَلُ ‏\"‏‏.‏","english":{"narrator":"Narrated Abu Huraira:","text":"The Prophet (ﷺ) said, \"The person who participates in (Holy battles) in \n     Allah's cause and nothing compels him to do so except belief in Allah \n     and His Apostles, will be recompensed by Allah either with a reward, \n     or booty (if he survives) or will be admitted to Paradise (if he is \n     killed in the battle as a martyr). Had I not found it difficult for my\n     followers, then I would not remain behind any sariya going for Jihad \n     and I would have loved to be martyred in Allah's cause and then made \n     alive, and then martyred and then made alive, and then again martyred \n     in His cause.\""}},{"id":30,"idInBook":30,"chapterId":2,"bookId":1,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ قَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ ‏\"‏‏.‏","english":{"narrator":"Narrated Abu Huraira:","text":"Allah's Messenger (ﷺ) said: \"Whoever establishes prayers during the nights \n     of Ramadan faithfully out of sincere faith and hoping to attain \n     Allah's rewards (not for showing off), all his past sins will be \n     forgiven.\""}},{"id":31,"idInBook":31,"chapterId":2,"bookId":1,"arabic":"حَدَّثَنَا ابْنُ سَلاَمٍ، قَالَ أَخْبَرَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ صَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ ‏\"‏‏.‏","english":{"narrator":"Narrated Abu Huraira:","text":"Allah's Messenger (ﷺ) said, \"Whoever observes fasts during the month of \n     Ramadan out of sincere faith, and hoping to attain Allah's rewards, \n     then all his past sins will be forgiven.\""}},{"id":32,"idInBook":32,"chapterId":2,"bookId":1,"arabic":"حَدَّثَنَا عَبْدُ السَّلاَمِ بْنُ مُطَهَّرٍ، قَالَ حَدَّثَنَا عُمَرُ بْنُ عَلِيٍّ، عَنْ مَعْنِ بْنِ مُحَمَّدٍ الْغِفَارِيِّ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ الدِّينَ يُسْرٌ، وَلَنْ يُشَادَّ الدِّينَ أَحَدٌ إِلاَّ غَلَبَهُ، فَسَدِّدُوا وَقَارِبُوا وَأَبْشِرُوا، وَاسْتَعِينُوا بِالْغَدْوَةِ وَالرَّوْحَةِ وَشَىْءٍ مِنَ الدُّلْجَةِ ‏\"‏‏.‏","english":{"narrator":"Narrated Abu Huraira:","text":"The Prophet (ﷺ) said, \"Religion is very easy and whoever overburdens \n     himself in his religion will not be able to continue in that way. So \n     you should not be extremists, but try to be near to perfection and \n     receive the good tidings that you will be rewarded; and gain strength \n     by worshipping in the mornings, the afternoons, and during the last hours of the nights.\" (See Fath-ul-Bari, Page \n     102, Vol 1)."}},{"id":33,"idInBook":33,"chapterId":2,"bookId":1,"arabic":"حَدَّثَنَا عَمْرُو بْنُ خَالِدٍ، قَالَ حَدَّثَنَا زُهَيْرٌ، قَالَ حَدَّثَنَا أَبُو إِسْحَاقَ، عَنِ الْبَرَاءِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ أَوَّلَ مَا قَدِمَ الْمَدِينَةَ نَزَلَ عَلَى أَجْدَادِهِ ـ أَوْ قَالَ أَخْوَالِهِ ـ مِنَ الأَنْصَارِ، وَأَنَّهُ صَلَّى قِبَلَ بَيْتِ الْمَقْدِسِ سِتَّةَ عَشَرَ شَهْرًا، أَوْ سَبْعَةَ عَشَرَ شَهْرًا، وَكَانَ يُعْجِبُهُ أَنْ تَكُونَ قِبْلَتُهُ قِبَلَ الْبَيْتِ، وَأَنَّهُ صَلَّى أَوَّلَ صَلاَةٍ صَلاَّهَا صَلاَةَ الْعَصْرِ، وَصَلَّى مَعَهُ قَوْمٌ، فَخَرَجَ رَجُلٌ مِمَّنْ صَلَّى مَعَهُ، فَمَرَّ عَلَى أَهْلِ مَسْجِدٍ، وَهُمْ رَاكِعُونَ فَقَالَ أَشْهَدُ بِاللَّهِ لَقَدْ صَلَّيْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم قِبَلَ مَكَّةَ، فَدَارُوا كَمَا هُمْ قِبَلَ الْبَيْتِ، وَكَانَتِ الْيَهُودُ قَدْ أَعْجَبَهُمْ إِذْ كَانَ يُصَلِّي قِبَلَ بَيْتِ الْمَقْدِسِ، وَأَهْلُ الْكِتَابِ، فَلَمَّا وَلَّى وَجْهَهُ قِبَلَ الْبَيْتِ أَنْكَرُوا ذَلِكَ‏.‏ قَالَ زُهَيْرٌ حَدَّثَنَا أَبُو إِسْحَاقَ عَنِ الْبَرَاءِ فِي حَدِيثِهِ هَذَا أَنَّهُ مَاتَ عَلَى الْقِبْلَةِ قَبْلَ أَنْ تُحَوَّلَ رِجَالٌ وَقُتِلُوا، فَلَمْ نَدْرِ مَا نَقُولُ فِيهِمْ، فَأَنْزَلَ اللَّهُ تَعَالَى ‏{‏وَمَا كَانَ اللَّهُ لِيُضِيعَ إِيمَانَكُمْ‏}‏","english":{"narrator":"Narrated Al-Bara' (bin 'Azib):","text":"When the Prophet (ﷺ) came to Medina, he stayed first with his grandfathers\n     or maternal uncles from Ansar. He offered his prayers facing \n     Baitul-Maqdis (Jerusalem) for sixteen or seventeen months, but he \n     wished that he could pray facing the Ka'ba (at Mecca). The first \n     prayer which he offered facing the Ka'ba was the 'Asr prayer in the \n     company of some people. Then one of those who had offered that prayer \n     with him came out and passed by some people in a mosque who were \n     bowing during their prayers (facing Jerusalem). He said addressing \n     them, \"By Allah, I testify that I have prayed with Allah's Messenger (ﷺ) \n     facing Mecca (Ka'ba).' Hearing that, those people changed their \n     direction towards the Ka'ba immediately. Jews and the people of the \n     scriptures used to be pleased to see the Prophet (ﷺ) facing Jerusalem in \n     prayers but when he changed his direction towards the Ka'ba, during \n     the prayers, they disapproved of it.\n\n\n     Al-Bara' added, \"Before we changed our direction towards the Ka'ba \n     (Mecca) in prayers, some Muslims had died or had been killed and we \n     did not know what to say about them (regarding their prayers.) Allah \n     then revealed: And Allah would never make your faith (prayers) to be \n     lost (i.e. the prayers of those Muslims were valid).' \" (2:143)."}},{"id":34,"idInBook":34,"chapterId":2,"bookId":1,"arabic":"قَالَ مَالِكٌ أَخْبَرَنِي زَيْدُ بْنُ أَسْلَمَ، أَنَّ عَطَاءَ بْنَ يَسَارٍ، أَخْبَرَهُ أَنَّ أَبَا سَعِيدٍ الْخُدْرِيَّ أَخْبَرَهُ أَنَّهُ، سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِذَا أَسْلَمَ الْعَبْدُ فَحَسُنَ إِسْلاَمُهُ يُكَفِّرُ اللَّهُ عَنْهُ كُلَّ سَيِّئَةٍ كَانَ زَلَفَهَا، وَكَانَ بَعْدَ ذَلِكَ الْقِصَاصُ، الْحَسَنَةُ بِعَشْرِ أَمْثَالِهَا إِلَى سَبْعِمِائَةِ ضِعْفٍ، وَالسَّيِّئَةُ بِمِثْلِهَا إِلاَّ أَنْ يَتَجَاوَزَ اللَّهُ عَنْهَا ‏\"‏‏.‏","english":{"narrator":"Narrated Abu Sa'id Al Khudri:","text":"Allah's Messenger (ﷺ) said, \"If a person embraces Islam sincerely, then Allah shall forgive all his past sins, and after that starts the settlement of accounts, the reward of his good deeds will be ten times to seven hundred times for each good deed and one evil deed will be recorded as it is unless Allah forgives it.\""}},{"id":35,"idInBook":35,"chapterId":2,"bookId":1,"arabic":"حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَ أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا أَحْسَنَ أَحَدُكُمْ إِسْلاَمَهُ، فَكُلُّ حَسَنَةٍ يَعْمَلُهَا تُكْتَبُ لَهُ بِعَشْرِ أَمْثَالِهَا إِلَى سَبْعِمِائَةِ ضِعْفٍ، وَكُلُّ سَيِّئَةٍ يَعْمَلُهَا تُكْتَبُ لَهُ بِمِثْلِهَا ‏\"‏‏.‏","english":{"narrator":"Narrated Abu Huraira:","text":"Allah's Messenger (ﷺ) said, \"If any one of you improve (follows strictly) \n     his Islamic religion then his good deeds will be rewarded ten times to\n     seven hundred times for each good deed and a bad deed will be recorded\n     as it is.\""}},{"id":36,"idInBook":36,"chapterId":2,"bookId":1,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى، عَنْ هِشَامٍ، قَالَ أَخْبَرَنِي أَبِي، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم دَخَلَ عَلَيْهَا وَعِنْدَهَا امْرَأَةٌ قَالَ ‏\"‏ مَنْ هَذِهِ ‏\"‏‏.‏ قَالَتْ فُلاَنَةُ‏.‏ تَذْكُرُ مِنْ صَلاَتِهَا‏.‏ قَالَ ‏\"‏ مَهْ، عَلَيْكُمْ بِمَا تُطِيقُونَ، فَوَاللَّهِ لاَ يَمَلُّ اللَّهُ حَتَّى تَمَلُّوا ‏\"‏‏.‏ وَكَانَ أَحَبَّ الدِّينِ إِلَيْهِ مَا دَامَ عَلَيْهِ صَاحِبُهُ‏.‏","english":{"narrator":"Narrated 'Aisha:","text":"Once the Prophet (ﷺ) came while a woman was sitting with me. He said, \"Who\n     is she?\" I replied, \"She is so and so,\" and told him about her \n     (excessive) praying. He said disapprovingly, \"Do (good) deeds which is\n     within your capacity (without being overtaxed) as Allah does not get \n     tired (of giving rewards) but (surely) you will get tired and the best\n     deed (act of Worship) in the sight of Allah is that which is done \n     regularly.\""}},{"id":37,"idInBook":37,"chapterId":2,"bookId":1,"arabic":"حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا هِشَامٌ، قَالَ حَدَّثَنَا قَتَادَةُ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ يَخْرُجُ مِنَ النَّارِ مَنْ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ، وَفِي قَلْبِهِ وَزْنُ شَعِيرَةٍ مِنْ خَيْرٍ، وَيَخْرُجُ مِنَ النَّارِ مَنْ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ، وَفِي قَلْبِهِ وَزْنُ بُرَّةٍ مِنْ خَيْرٍ، وَيَخْرُجُ مِنَ النَّارِ مَنْ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ، وَفِي قَلْبِهِ وَزْنُ ذَرَّةٍ مِنْ خَيْرٍ ‏\"‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ قَالَ أَبَانُ حَدَّثَنَا قَتَادَةُ حَدَّثَنَا أَنَسٌ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ مِنْ إِيمَانٍ ‏\"‏‏.‏ مَكَانَ ‏\"‏ مِنْ خَيْرٍ ‏\"‏‏.‏","english":{"narrator":"Narrated Anas:","text":"The Prophet (ﷺ) said, \"Whoever said \"None has the right to be worshipped \n     but Allah and has in his heart good (faith) equal to the weight of a \n     barley grain will be taken out of Hell. And whoever said: \"None has \n     the right to be worshipped but Allah and has in his heart good (faith)\n     equal to the weight of a wheat grain will be taken out of Hell. And \n     whoever said, \"None has the right to be worshipped but Allah and has \n     in his heart good (faith) equal to the weight of an atom will be taken\n     out of Hell.\""}},{"id":38,"idInBook":38,"chapterId":2,"bookId":1,"arabic":"حَدَّثَنَا الْحَسَنُ بْنُ الصَّبَّاحِ، سَمِعَ جَعْفَرَ بْنَ عَوْنٍ، حَدَّثَنَا أَبُو الْعُمَيْسِ، أَخْبَرَنَا قَيْسُ بْنُ مُسْلِمٍ، عَنْ طَارِقِ بْنِ شِهَابٍ، عَنْ عُمَرَ بْنِ الْخَطَّابِ، أَنَّ رَجُلاً، مِنَ الْيَهُودِ قَالَ لَهُ يَا أَمِيرَ الْمُؤْمِنِينَ، آيَةٌ فِي كِتَابِكُمْ تَقْرَءُونَهَا لَوْ عَلَيْنَا مَعْشَرَ الْيَهُودِ نَزَلَتْ لاَتَّخَذْنَا ذَلِكَ الْيَوْمَ عِيدًا‏.‏ قَالَ أَىُّ آيَةٍ قَالَ ‏{‏الْيَوْمَ أَكْمَلْتُ لَكُمْ دِينَكُمْ وَأَتْمَمْتُ عَلَيْكُمْ نِعْمَتِي وَرَضِيتُ لَكُمُ الإِسْلاَمَ دِينًا‏}‏‏.‏ قَالَ عُمَرُ قَدْ عَرَفْنَا ذَلِكَ الْيَوْمَ وَالْمَكَانَ الَّذِي نَزَلَتْ فِيهِ عَلَى النَّبِيِّ صلى الله عليه وسلم وَهُوَ قَائِمٌ بِعَرَفَةَ يَوْمَ جُمُعَةٍ‏.‏","english":{"narrator":"Narrated 'Umar bin Al-Khattab:","text":"Once a Jew said to me, \"O the chief of believers! There is a verse in \n     your Holy Book Which is read by all of you (Muslims), and had it been \n     revealed to us, we would have taken that day (on which it was revealed\n     as a day of celebration.\" 'Umar bin Al-Khattab asked, \"Which is that \n     verse?\" The Jew replied, \"This day I have perfected your religion For \n     you, completed My favor upon you, And have chosen for you Islam as \n     your religion.\" (5:3) 'Umar replied,\"No doubt, we know when and where \n     this verse was revealed to the Prophet. It was Friday and the Prophet (ﷺ) \n     was standing at 'Arafat (i.e. the Day of Hajj)\""}},{"id":39,"idInBook":39,"chapterId":2,"bookId":1,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكُ بْنُ أَنَسٍ، عَنْ عَمِّهِ أَبِي سُهَيْلِ بْنِ مَالِكٍ، عَنْ أَبِيهِ، أَنَّهُ سَمِعَ طَلْحَةَ بْنَ عُبَيْدِ اللَّهِ، يَقُولُ جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم مِنْ أَهْلِ نَجْدٍ، ثَائِرُ الرَّأْسِ، يُسْمَعُ دَوِيُّ صَوْتِهِ، وَلاَ يُفْقَهُ مَا يَقُولُ حَتَّى دَنَا، فَإِذَا هُوَ يَسْأَلُ عَنِ الإِسْلاَمِ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ‏\"‏ خَمْسُ صَلَوَاتٍ فِي الْيَوْمِ وَاللَّيْلَةِ ‏\"‏‏.‏ فَقَالَ هَلْ عَلَىَّ غَيْرُهَا قَالَ ‏\"‏ لاَ، إِلاَّ أَنْ تَطَوَّعَ ‏\"‏‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَصِيَامُ رَمَضَانَ ‏\"‏‏.‏ قَالَ هَلْ عَلَىَّ غَيْرُهُ قَالَ ‏\"‏ لاَ، إِلاَّ أَنْ تَطَوَّعَ ‏\"‏‏.‏ قَالَ وَذَكَرَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم الزَّكَاةَ‏.‏ قَالَ هَلْ عَلَىَّ غَيْرُهَا قَالَ ‏\"‏ لاَ، إِلاَّ أَنْ تَطَوَّعَ ‏\"‏‏.‏ قَالَ فَأَدْبَرَ الرَّجُلُ وَهُوَ يَقُولُ وَاللَّهِ لاَ أَزِيدُ عَلَى هَذَا وَلاَ أَنْقُصُ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَفْلَحَ إِنْ صَدَقَ ‏\"‏‏.‏","english":{"narrator":"Narrated Talha bin 'Ubaidullah:","text":"A man from Najd with unkempt hair came to Allah's Messenger (ﷺ) and we heard\n     his loud voice but could not understand what he was saying, till he \n     came near and then we came to know that he was asking about Islam. \n     Allah's Messenger (ﷺ) said, \"You have to offer prayers perfectly five times \n     in a day and night (24 hours).\" The man asked, \"Is there any more \n     (praying)?\" Allah's Messenger (ﷺ) replied, \"No, but if you want to offer the\n     Nawafil prayers (you can).\" Allah's Messenger (ﷺ) further said to him: \"You \n     have to observe fasts during the month of Ramadan.\" The man asked, \n     \"Is there any more fasting?\" Allah's Messenger (ﷺ) replied, \"No, but if you \n     want to observe the Nawafil fasts (you can.)\" Then Allah's Messenger (ﷺ) \n     further said to him, \"You have to pay the Zakat (obligatory charity).\"\n     The man asked, \"Is there any thing other than the Zakat for me to \n     pay?\" Allah's Messenger (ﷺ) replied, \"No, unless you want to give alms of \n     your own.\" And then that man retreated saying, \"By Allah! I will \n     neither do less nor more than this.\" Allah's Messenger (ﷺ) said, \"If what he\n     said is true, then he will be successful (i.e. he will be granted \n     Paradise).\""}},{"id":40,"idInBook":40,"chapterId":2,"bookId":1,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ عَلِيٍّ الْمَنْجُوفِيُّ، قَالَ حَدَّثَنَا رَوْحٌ، قَالَ حَدَّثَنَا عَوْفٌ، عَنِ الْحَسَنِ، وَمُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنِ اتَّبَعَ جَنَازَةَ مُسْلِمٍ إِيمَانًا وَاحْتِسَابًا، وَكَانَ مَعَهُ حَتَّى يُصَلَّى عَلَيْهَا، وَيَفْرُغَ مِنْ دَفْنِهَا، فَإِنَّهُ يَرْجِعُ مِنَ الأَجْرِ بِقِيرَاطَيْنِ، كُلُّ قِيرَاطٍ مِثْلُ أُحُدٍ، وَمَنْ صَلَّى عَلَيْهَا ثُمَّ رَجَعَ قَبْلَ أَنْ تُدْفَنَ فَإِنَّهُ يَرْجِعُ بِقِيرَاطٍ ‏\"‏‏.‏ تَابَعَهُ عُثْمَانُ الْمُؤَذِّنُ قَالَ حَدَّثَنَا عَوْفٌ عَنْ مُحَمَّدٍ عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَهُ‏.‏","english":{"narrator":"Narrated Abu Huraira:","text":"Allah's Messenger (ﷺ) said, \"(A believer) who accompanies the funeral \n     procession of a Muslim out of sincere faith and hoping to attain \n     Allah's reward and remains with it till the funeral prayer is offered \n     and the burial ceremonies are over, he will return with a reward of \n     two Qirats. Each Qirat is like the size of the (Mount) Uhud. He who \n     offers the funeral prayer only and returns before the burial, will \n     return with the reward of one Qirat only.\""}},{"id":41,"idInBook":41,"chapterId":2,"bookId":1,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَرْعَرَةَ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ زُبَيْدٍ، قَالَ سَأَلْتُ أَبَا وَائِلٍ عَنِ الْمُرْجِئَةِ،، فَقَالَ حَدَّثَنِي عَبْدُ اللَّهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ سِبَابُ الْمُسْلِمِ فُسُوقٌ، وَقِتَالُهُ كُفْرٌ ‏\"‏‏.‏","english":{"narrator":"Narrated 'Abdullah:","text":"The Prophet (ﷺ) said, \"Abusing a Muslim is Fusuq (an evil doing) and \n     killing him is Kufr (disbelief).\""}},{"id":42,"idInBook":42,"chapterId":2,"bookId":1,"arabic":"أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ، قَالَ أَخْبَرَنِي عُبَادَةُ بْنُ الصَّامِتِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَرَجَ يُخْبِرُ بِلَيْلَةِ الْقَدْرِ، فَتَلاَحَى رَجُلاَنِ مِنَ الْمُسْلِمِينَ فَقَالَ ‏\n\"‏ إِنِّي خَرَجْتُ لأُخْبِرَكُمْ بِلَيْلَةِ الْقَدْرِ، وَإِنَّهُ تَلاَحَى فُلاَنٌ وَفُلاَنٌ فَرُفِعَتْ وَعَسَى أَنْ يَكُونَ خَيْرًا لَكُمُ الْتَمِسُوهَا فِي السَّبْعِ وَالتِّسْعِ وَالْخَمْسِ ‏\"‏‏.‏","english":{"narrator":"Narrated 'Ubada bin As-Samit:","text":"\"Allah's Messenger (ﷺ) went out to inform the people about the (date of the)\n     night of decree (Al-Qadr) but there happened a quarrel between two \n     Muslim men. The Prophet (ﷺ) said, \"I came out to inform you about (the \n     date of) the night of Al-Qadr, but as so and so and so and so \n     quarrelled, its knowledge was taken away (I forgot it) and maybe it \n     was better for you. Now look for it in the 7th, the 9th and the 5th \n     (of the last 10 nights of the month of Ramadan).\""}},{"id":43,"idInBook":43,"chapterId":2,"bookId":1,"arabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا أَبُو حَيَّانَ التَّيْمِيُّ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم بَارِزًا يَوْمًا لِلنَّاسِ، فَأَتَاهُ جِبْرِيلُ فَقَالَ مَا الإِيمَانُ قَالَ ‏\"‏ الإِيمَانُ أَنْ تُؤْمِنَ بِاللَّهِ وَمَلاَئِكَتِهِ وَبِلِقَائِهِ وَرُسُلِهِ، وَتُؤْمِنَ بِالْبَعْثِ ‏\"‏‏.‏ قَالَ مَا الإِسْلاَمُ قَالَ ‏\"‏ الإِسْلاَمُ أَنْ تَعْبُدَ اللَّهَ وَلاَ تُشْرِكَ بِهِ، وَتُقِيمَ الصَّلاَةَ، وَتُؤَدِّيَ الزَّكَاةَ الْمَفْرُوضَةَ، وَتَصُومَ رَمَضَانَ ‏\"‏‏.‏ قَالَ مَا الإِحْسَانُ قَالَ ‏\"‏ أَنْ تَعْبُدَ اللَّهَ كَأَنَّكَ تَرَاهُ، فَإِنْ لَمْ تَكُنْ تَرَاهُ فَإِنَّهُ يَرَاكَ ‏\"‏‏.‏ قَالَ مَتَى السَّاعَةُ قَالَ ‏\"‏ مَا الْمَسْئُولُ عَنْهَا بِأَعْلَمَ مِنَ السَّائِلِ، وَسَأُخْبِرُكَ عَنْ أَشْرَاطِهَا إِذَا وَلَدَتِ الأَمَةُ رَبَّهَا، وَإِذَا تَطَاوَلَ رُعَاةُ الإِبِلِ الْبُهْمُ فِي الْبُنْيَانِ، فِي خَمْسٍ لاَ يَعْلَمُهُنَّ إِلاَّ اللَّهُ ‏\"‏‏.‏ ثُمَّ تَلاَ النَّبِيُّ صلى الله عليه وسلم ‏{‏إِنَّ اللَّهَ عِنْدَهُ عِلْمُ السَّاعَةِ‏}‏ الآيَةَ‏.‏ ثُمَّ أَدْبَرَ فَقَالَ ‏\"‏ رُدُّوهُ ‏\"‏‏.‏ فَلَمْ يَرَوْا شَيْئًا‏.‏ فَقَالَ ‏\"‏ هَذَا جِبْرِيلُ جَاءَ يُعَلِّمُ النَّاسَ دِينَهُمْ ‏\"‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ جَعَلَ ذَلِكَ كُلَّهُ مِنَ الإِيمَانِ‏.‏","english":{"narrator":"Narrated Abu Huraira:","text":"One day while the Prophet (ﷺ) was sitting in the company of some people, \n     (The angel) Gabriel came and asked, \"What is faith?\" Allah's Messenger (ﷺ) \n     replied, 'Faith is to believe in Allah, His angels, (the) meeting with\n     Him, His Apostles, and to believe in Resurrection.\" Then he further \n     asked, \"What is Islam?\" Allah's Messenger (ﷺ) replied, \"To worship Allah \n     Alone and none else, to offer prayers perfectly to pay the compulsory \n     charity (Zakat) and to observe fasts during the month of Ramadan.\"  \n     Then he further asked, \"What is Ihsan (perfection)?\" Allah's Messenger (ﷺ) \n     replied, \"To worship Allah as if you see Him, and if you cannot \n     achieve this state of devotion then you must consider that He is \n     looking at you.\" Then he further asked, \"When will the Hour be \n     established?\" Allah's Messenger (ﷺ) replied, \"The answerer has no better \n     knowledge than the questioner. But I will inform you about its \n     portents.\n\n\n     1. When a slave (lady) gives birth to her master.\n\n\n     2. When the shepherds of black camels start boasting and competing \n     with others in the construction of higher buildings. And the Hour is \n     one of five things which nobody knows except Allah.\n\n\n     The Prophet (ﷺ) then recited: \"Verily, with Allah (Alone) is the knowledge\n     of the Hour--.\" (31. 34) Then that man (Gabriel) left and the Prophet (ﷺ) \n     asked his companions to call him back, but they could not see him. \n     Then the Prophet (ﷺ) said, \"That was Gabriel who came to teach the people \n     their religion.\" Abu 'Abdullah said: He (the Prophet) considered all \n     that as a part of faith."}},{"id":44,"idInBook":44,"chapterId":2,"bookId":1,"arabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ حَمْزَةَ، قَالَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، أَخْبَرَهُ قَالَ أَخْبَرَنِي أَبُو سُفْيَانَ، أَنَّ هِرَقْلَ، قَالَ لَهُ سَأَلْتُكَ هَلْ يَزِيدُونَ أَمْ يَنْقُصُونَ، فَزَعَمْتَ أَنَّهُمْ يَزِيدُونَ، وَكَذَلِكَ الإِيمَانُ حَتَّى يَتِمَّ‏.‏ وَسَأَلْتُكَ هَلْ يَرْتَدُّ أَحَدٌ سَخْطَةً لِدِينِهِ بَعْدَ أَنْ يَدْخُلَ فِيهِ، فَزَعَمْتَ أَنْ لاَ، وَكَذَلِكَ الإِيمَانُ حِينَ تُخَالِطُ بَشَاشَتُهُ الْقُلُوبَ، لاَ يَسْخَطُهُ أَحَدٌ‏.‏","english":{"narrator":"Narrated 'Abdullah bin 'Abbas:","text":"I was informed by Abu Sufyan that Heraclius said to him, \"I asked you \n     whether they (followers of Muhammad) were increasing or decreasing. \n     You replied that they were increasing. And in fact, this is the way of\n     true Faith till it is complete in all respects. I further asked you \n     whether there was anybody, who, after embracing his (the Prophets) \n     religion (Islam) became displeased and discarded it. You replied in \n     the negative, and in fact, this is (a sign of) true faith. When its \n     delight enters the heart and mixes with them completely, nobody can be\n     displeased with it.\""}},{"id":45,"idInBook":45,"chapterId":2,"bookId":1,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا زَكَرِيَّاءُ، عَنْ عَامِرٍ، قَالَ سَمِعْتُ النُّعْمَانَ بْنَ بَشِيرٍ، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ الْحَلاَلُ بَيِّنٌ وَالْحَرَامُ بَيِّنٌ، وَبَيْنَهُمَا مُشَبَّهَاتٌ لاَ يَعْلَمُهَا كَثِيرٌ مِنَ النَّاسِ، فَمَنِ اتَّقَى الْمُشَبَّهَاتِ اسْتَبْرَأَ لِدِيِنِهِ وَعِرْضِهِ، وَمَنْ وَقَعَ فِي الشُّبُهَاتِ كَرَاعٍ يَرْعَى حَوْلَ الْحِمَى، يُوشِكُ أَنْ يُوَاقِعَهُ‏.‏ أَلاَ وَإِنَّ لِكُلِّ مَلِكٍ حِمًى، أَلاَ إِنَّ حِمَى اللَّهِ فِي أَرْضِهِ مَحَارِمُهُ، أَلاَ وَإِنَّ فِي الْجَسَدِ مُضْغَةً إِذَا صَلَحَتْ صَلَحَ الْجَسَدُ كُلُّهُ، وَإِذَا فَسَدَتْ فَسَدَ الْجَسَدُ كُلُّهُ‏.‏ أَلاَ وَهِيَ الْقَلْبُ ‏\"‏‏.‏","english":{"narrator":"Narrated An-Nu'man bin Bashir:","text":"I heard Allah's Messenger (ﷺ) saying, 'Both legal and illegal things are \n     evident but in between them there are doubtful (suspicious) things and\n     most of the people have no knowledge about them. So whoever saves \n     himself from these suspicious things saves his religion and his honor.\n     And whoever indulges in these suspicious things is like a shepherd who\n     grazes (his animals) near the Hima (private pasture) of someone else \n     and at any moment he is liable to get in it. (O people!) Beware! Every\n     king has a Hima and the Hima of Allah on the earth is His illegal \n     (forbidden) things. Beware! There is a piece of flesh in the body if \n     it becomes good (reformed) the whole body becomes good but if it gets \n     spoilt the whole body gets spoilt and that is the heart."}},{"id":46,"idInBook":46,"chapterId":2,"bookId":1,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ الْجَعْدِ، قَالَ أَخْبَرَنَا شُعْبَةُ، عَنْ أَبِي جَمْرَةَ، قَالَ كُنْتُ أَقْعُدُ مَعَ ابْنِ عَبَّاسٍ، يُجْلِسُنِي عَلَى سَرِيرِهِ فَقَالَ أَقِمْ عِنْدِي حَتَّى أَجْعَلَ لَكَ سَهْمًا مِنْ مَالِي، فَأَقَمْتُ مَعَهُ شَهْرَيْنِ، ثُمَّ قَالَ إِنَّ وَفْدَ عَبْدِ الْقَيْسِ لَمَّا أَتَوُا النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنِ الْقَوْمُ أَوْ مَنِ الْوَفْدُ ‏\"‏‏.‏ قَالُوا رَبِيعَةُ‏.‏ قَالَ ‏\"‏ مَرْحَبًا بِالْقَوْمِ ـ أَوْ بِالْوَفْدِ ـ غَيْرَ خَزَايَا وَلاَ نَدَامَى ‏\"‏‏.‏ فَقَالُوا يَا رَسُولَ اللَّهِ، إِنَّا لاَ نَسْتَطِيعُ أَنْ نَأْتِيَكَ إِلاَّ فِي شَهْرِ الْحَرَامِ، وَبَيْنَنَا وَبَيْنَكَ هَذَا الْحَىُّ مِنْ كُفَّارِ مُضَرَ، فَمُرْنَا بِأَمْرٍ فَصْلٍ، نُخْبِرْ بِهِ مَنْ وَرَاءَنَا، وَنَدْخُلْ بِهِ الْجَنَّةَ‏.‏ وَسَأَلُوهُ عَنِ الأَشْرِبَةِ‏.‏ فَأَمَرَهُمْ بِأَرْبَعٍ، وَنَهَاهُمْ عَنْ أَرْبَعٍ، أَمَرَهُمْ بِالإِيمَانِ بِاللَّهِ وَحْدَهُ‏.‏ قَالَ ‏\"‏ أَتَدْرُونَ مَا الإِيمَانُ بِاللَّهِ وَحْدَهُ ‏\"‏‏.‏ قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ قَالَ ‏\"‏ شَهَادَةُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، وَإِقَامُ الصَّلاَةِ، وَإِيتَاءُ الزَّكَاةِ، وَصِيَامُ رَمَضَانَ، وَأَنْ تُعْطُوا مِنَ الْمَغْنَمِ الْخُمُسَ ‏\"‏‏.‏ وَنَهَاهُمْ عَنْ أَرْبَعٍ عَنِ الْحَنْتَمِ وَالدُّبَّاءِ وَالنَّقِيرِ وَالْمُزَفَّتِ‏.‏ وَرُبَّمَا قَالَ الْمُقَيَّرِ‏.‏ وَقَالَ ‏\"‏ احْفَظُوهُنَّ وَأَخْبِرُوا بِهِنَّ مَنْ وَرَاءَكُمْ ‏\"‏‏.‏","english":{"narrator":"Narrated Abu Jamra:","text":"I used to sit with Ibn 'Abbas and he made me sit on his sitting place.\n     He requested me to stay with him in order that he might give me a \n     share from his property. So I stayed with him for two months. Once he \n     told (me) that when the delegation of the tribe of 'Abdul Qais came to\n     the Prophet, the Prophet (ﷺ) asked them, \"Who are the people (i.e. you)? \n     (Or) who are the delegate?\" They replied, \"We are from the tribe of \n     Rabi'a.\" Then the Prophet (ﷺ) said to them, \"Welcome! O people (or O \n     delegation of 'Abdul Qais)! Neither will you have disgrace nor will \n     you regret.\" They said, \"O Allah's Messenger (ﷺ)! We cannot come to you \n     except in the sacred month and there is the infidel tribe of Mudar \n     intervening between you and us. So please order us to do something \n     good (religious deeds) so that we may inform our people whom we have \n     left behind (at home), and that we may enter Paradise (by acting on \n     them).\" Then they asked about drinks (what is legal and what is \n     illegal). The Prophet (ﷺ) ordered them to do four things and forbade them \n     from four things. He ordered them to believe in Allah Alone and asked \n     them, \"Do you know what is meant by believing in Allah Alone?\" They \n     replied, \"Allah and His Apostle know better.\" Thereupon the Prophet (ﷺ) \n     said, \"It means:\n\n\n     1. To testify that none has the right to be worshipped but Allah and \n     Muhammad is Allah's Messenger (ﷺ). \n\n\n     2. To offer prayers perfectly\n\n\n     3. To pay the Zakat (obligatory charity) \n\n\n     4. To observe fast during the month of Ramadan.\n\n\n     5. And to pay Al-Khumus (one fifth of the booty to be given in Allah's\n     Cause).\n\n\n     Then he forbade them four things, namely, Hantam, Dubba,' Naqir Ann \n     Muzaffat or Muqaiyar; (These were the names of pots in which Alcoholic\n     drinks were prepared) (The Prophet (ﷺ) mentioned the container of wine and\n     he meant the wine itself). The Prophet (ﷺ) further said (to them): \n     \"Memorize them (these instructions) and convey them to the people whom\n     you have left behind.\""}},{"id":47,"idInBook":47,"chapterId":2,"bookId":1,"arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ بْنِ وَقَّاصٍ، عَنْ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ الأَعْمَالُ بِالنِّيَّةِ، وَلِكُلِّ امْرِئٍ مَا نَوَى، فَمَنْ كَانَتْ هِجْرَتُهُ إِلَى اللَّهِ وَرَسُولِهِ، فَهِجْرَتُهُ إِلَى اللَّهِ وَرَسُولِهِ، وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيبُهَا، أَوِ امْرَأَةٍ يَتَزَوَّجُهَا، فَهِجْرَتُهُ إِلَى مَا هَاجَرَ إِلَيْهِ ‏\"‏‏.‏","english":{"narrator":"Narrated 'Umar bin Al-Khattab:","text":"Allah's Messenger (ﷺ) said, \"The reward of deeds depends upon the intention \n     and every person will get the reward according to what he has \n     intended. So whoever emigrated for Allah and His Apostle, then his \n     emigration was for Allah and His Apostle. And whoever emigrated for \n     worldly benefits or for a woman to marry, his emigration was for what \n     he emigrated for.\""}},{"id":48,"idInBook":48,"chapterId":2,"bookId":1,"arabic":"حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي عَدِيُّ بْنُ ثَابِتٍ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ يَزِيدَ، عَنْ أَبِي مَسْعُودٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا أَنْفَقَ الرَّجُلُ عَلَى أَهْلِهِ يَحْتَسِبُهَا فَهُوَ لَهُ صَدَقَةٌ ‏\"‏‏.‏","english":{"narrator":"Narrated Abu Mas'ud:","text":"The Prophet (ﷺ) said, \"If a man spends on his family (with the intention \n     of having a reward from Allah) sincerely for Allah's sake then it is a\n     (kind of) alms-giving in reward for him."}},{"id":49,"idInBook":49,"chapterId":2,"bookId":1,"arabic":"حَدَّثَنَا الْحَكَمُ بْنُ نَافِعٍ قَالَ أَخْبَرَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ قَالَ حَدَّثَنِي عَامِرُ بْنُ سَعْدٍ عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ أَنَّهُ أَخْبَرَهُ  أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ \n\"إِنَّكَ لَنْ تُنْفِقَ نَفَقَةً تَبْتَغِي بِهَا وَجْهَ اللَّهِ إِلَّا أُجِرْتَ عَلَيْهَا حَتَّى مَا تَجْعَلُ فِي فَمِ امْرَأَتِكَ\"","english":{"narrator":"Narrated Sa'd bin Abi Waqqas:","text":"Allah's Messenger (ﷺ) said, \"You will be rewarded for whatever you spend for\n     Allah's sake even if it were a morsel which you put in your wife's \n     mouth.\""}},{"id":50,"idInBook":50,"chapterId":2,"bookId":1,"arabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ إِسْمَاعِيلَ، قَالَ حَدَّثَنِي قَيْسُ بْنُ أَبِي حَازِمٍ، عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ، قَالَ بَايَعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَلَى إِقَامِ الصَّلاَةِ، وَإِيتَاءِ الزَّكَاةِ، وَالنُّصْحِ لِكُلِّ مُسْلِمٍ‏.‏","english":{"narrator":"Narrated Jarir bin Abdullah:","text":"I gave the pledge of allegiance to Allah's Messenger (ﷺ) for the following:\n\n\n     1. offer prayers perfectly \n\n\n     2. pay the Zakat (obligatory charity)\n\n\n     3. and be sincere and true to every Muslim."}},{"id":51,"idInBook":51,"chapterId":2,"bookId":1,"arabic":"حَدَّثَنَا أَبُو النُّعْمَانِ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ زِيَادِ بْنِ عِلاَقَةَ، قَالَ سَمِعْتُ جَرِيرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ يَوْمَ مَاتَ الْمُغِيرَةُ بْنُ شُعْبَةَ قَامَ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ وَقَالَ عَلَيْكُمْ بِاتِّقَاءِ اللَّهِ وَحْدَهُ لاَ شَرِيكَ لَهُ، وَالْوَقَارِ وَالسَّكِينَةِ حَتَّى يَأْتِيَكُمْ أَمِيرٌ، فَإِنَّمَا يَأْتِيكُمُ الآنَ، ثُمَّ قَالَ اسْتَعْفُوا لأَمِيرِكُمْ، فَإِنَّهُ كَانَ يُحِبُّ الْعَفْوَ‏.‏ ثُمَّ قَالَ أَمَّا بَعْدُ، فَإِنِّي أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم قُلْتُ أُبَايِعُكَ عَلَى الإِسْلاَمِ‏.‏ فَشَرَطَ عَلَىَّ وَالنُّصْحِ لِكُلِّ مُسْلِمٍ‏.‏ فَبَايَعْتُهُ عَلَى هَذَا، وَرَبِّ هَذَا الْمَسْجِدِ إِنِّي لَنَاصِحٌ لَكُمْ‏.‏ ثُمَّ اسْتَغْفَرَ وَنَزَلَ‏.‏","english":{"narrator":"Narrated Ziyad bin'Ilaqa:","text":"I heard Jarir bin 'Abdullah (Praising Allah). On the day when \n     Al-Mughira bin Shu'ba died, he (Jarir) got up (on the pulpit) and \n     thanked and praised Allah and said, \"Be afraid of Allah alone Who has \n     none along with Him to be worshipped.(You should) be calm and quiet \n     till the (new) chief comes to you and he will come to you soon. Ask \n     Allah's forgiveness for your (late) chief because he himself loved to \n     forgive others.\" Jarir added, \"Amma badu (now then), I went to the \n     Prophet and said, 'I give my pledge of allegiance to you for Islam.\" \n     The Prophet (ﷺ) conditioned (my pledge) for me to be sincere and true to \n     every Muslim so I gave my pledge to him for this. By the Lord of this \n     mosque! I am sincere and true to you (Muslims). Then Jarir asked for \n     Allah's forgiveness and came down (from the pulpit)."}}],"chapter":{"id":2,"bookId":1,"arabic":"كتاب الإيمان","english":"Belief"}}