{"metadata":{"length":148,"arabic":{"title":"صحيح البخاري","author":"الإمام محمد بن إسماعيل البخاري","introduction":"كتاب الجنائز"},"english":{"title":"Sahih al-Bukhari","author":"Imam Muhammad ibn Ismail al-Bukhari","introduction":"Funerals (Al-Janaa'iz)"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا مَهْدِيُّ بْنُ مَيْمُونٍ، حَدَّثَنَا وَاصِلٌ الأَحْدَبُ، عَنِ الْمَعْرُورِ بْنِ سُوَيْدٍ، عَنْ أَبِي ذَرٍّ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَتَانِي آتٍ مِنْ رَبِّي فَأَخْبَرَنِي ـ أَوْ قَالَ بَشَّرَنِي ـ أَنَّهُ مَنْ مَاتَ مِنْ أُمَّتِي لاَ يُشْرِكُ بِاللَّهِ شَيْئًا دَخَلَ الْجَنَّةَ ‏\"‏‏.‏ قُلْتُ وَإِنْ زَنَى وَإِنْ سَرَقَ قَالَ ‏\"‏ وَإِنْ زَنَى وَإِنْ سَرَقَ ‏\"‏‏.‏","english":{"narrator":"Narrated Abu Dhar:","text":"Allah's Messenger (ﷺ) said, \"Someone came to me from my Lord and gave me the news (or good tidings) \nthat if any of my followers dies worshipping none (in any way) along with Allah, he will enter \nParadise.\" I asked, \"Even if he committed illegal sexual intercourse (adultery) and theft?\" He replied, \n\"Even if he committed illegal sexual intercourse (adultery) and theft.\""}},{"id":2,"idInBook":2,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنَا شَقِيقٌ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَنْ مَاتَ يُشْرِكُ بِاللَّهِ شَيْئًا دَخَلَ النَّارَ ‏\"‏‏.‏ وَقُلْتُ أَنَا مَنْ مَاتَ لاَ يُشْرِكُ بِاللَّهِ شَيْئًا دَخَلَ الْجَنَّةَ‏.‏","english":{"narrator":"Narrated `Abdullah:","text":"Allah's Messenger (ﷺ) said, \"Anyone who dies worshipping others along with Allah will definitely enter the \nFire.\" I said, \"Anyone who dies worshipping none along with Allah will definitely enter Paradise.\""}},{"id":3,"idInBook":3,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنِ الأَشْعَثِ، قَالَ سَمِعْتُ مُعَاوِيَةَ بْنَ سُوَيْدِ بْنِ مُقَرِّنٍ، عَنِ الْبَرَاءِ ـ رضى الله عنه ـ قَالَ أَمَرَنَا النَّبِيُّ صلى الله عليه وسلم بِسَبْعٍ، وَنَهَانَا عَنْ سَبْعٍ أَمَرَنَا بِاتِّبَاعِ الْجَنَائِزِ، وَعِيَادَةِ الْمَرِيضِ، وَإِجَابَةِ الدَّاعِي، وَنَصْرِ الْمَظْلُومِ، وَإِبْرَارِ الْقَسَمِ، وَرَدِّ السَّلاَمِ، وَتَشْمِيتِ الْعَاطِسِ‏.‏ وَنَهَانَا عَنْ آنِيَةِ الْفِضَّةِ، وَخَاتَمِ الذَّهَبِ، وَالْحَرِيرِ، وَالدِّيبَاجِ، وَالْقَسِّيِّ، وَالإِسْتَبْرَقِ‏.‏","english":{"narrator":"Narrated Al-Bara' bin `Azib:","text":"Allah's Messenger (ﷺ) ordered us to do seven things and forbade us to do other seven. He ordered us: \nto follow the funeral procession. to visit the sick, to accept invitations, to help the oppressed, to fulfill \nthe oaths, to return the greeting and to reply to the sneezer: (saying, \"May Allah be merciful on you,\" \nprovided the sneezer says, \"All the praises are for Allah,\"). He forbade us to use silver utensils and \ndishes and to wear golden rings, silk (clothes), Dibaj (pure silk cloth), Qissi and Istabraq (two kinds of \nsilk cloths)."}},{"id":4,"idInBook":4,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا مُحَمَّدٌ، حَدَّثَنَا عَمْرُو بْنُ أَبِي سَلَمَةَ، عَنِ الأَوْزَاعِيِّ، قَالَ أَخْبَرَنِي ابْنُ شِهَابٍ، قَالَ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ حَقُّ الْمُسْلِمِ عَلَى الْمُسْلِمِ خَمْسٌ رَدُّ السَّلاَمِ، وَعِيَادَةُ الْمَرِيضِ، وَاتِّبَاعُ الْجَنَائِزِ، وَإِجَابَةُ الدَّعْوَةِ، وَتَشْمِيتُ الْعَاطِسِ ‏\"‏‏.‏ تَابَعَهُ عَبْدُ الرَّزَّاقِ قَالَ أَخْبَرَنَا مَعْمَرٌ‏.‏ وَرَوَاهُ سَلاَمَةُ عَنْ عُقَيْلٍ‏.‏","english":{"narrator":"Narrated Abu Huraira:","text":"I heard Allah's Messenger (ﷺ) saying, \"The rights of a Muslim on the Muslims are five: to respond to the salaam, visiting the sick, to follow the funeral processions, to accept an invitation, and to reply to those who sneeze. (see Hadith 1239)"}},{"id":5,"idInBook":5,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا بِشْرُ بْنُ مُحَمَّدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنِي مَعْمَرٌ، وَيُونُسُ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ زَوْجَ النَّبِيِّ صلى الله عليه وسلم أَخْبَرَتْهُ قَالَتْ أَقْبَلَ أَبُو بَكْرٍ ـ رضى الله عنه ـ عَلَى فَرَسِهِ مِنْ مَسْكَنِهِ بِالسُّنْحِ حَتَّى نَزَلَ، فَدَخَلَ الْمَسْجِدَ، فَلَمْ يُكَلِّمِ النَّاسَ، حَتَّى نَزَلَ فَدَخَلَ عَلَى عَائِشَةَ ـ رضى الله عنها ـ فَتَيَمَّمَ النَّبِيَّ صلى الله عليه وسلم وَهُوَ مُسَجًّى بِبُرْدِ حِبَرَةٍ، فَكَشَفَ عَنْ وَجْهِهِ، ثُمَّ أَكَبَّ عَلَيْهِ فَقَبَّلَهُ ثُمَّ بَكَى فَقَالَ بِأَبِي أَنْتَ يَا نَبِيَّ اللَّهِ، لاَ يَجْمَعُ اللَّهُ عَلَيْكَ مَوْتَتَيْنِ، أَمَّا الْمَوْتَةُ الَّتِي كُتِبَتْ عَلَيْكَ فَقَدْ مُتَّهَا‏.‏   قَالَ أَبُو سَلَمَةَ فَأَخْبَرَنِي ابْنُ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ أَبَا بَكْرٍ ـ رضى الله عنه ـ خَرَجَ وَعُمَرُ ـ رضى الله عنه ـ يُكَلِّمُ النَّاسَ‏.‏ فَقَالَ اجْلِسْ‏.‏ فَأَبَى‏.‏ فَقَالَ اجْلِسْ‏.‏ فَأَبَى، فَتَشَهَّدَ أَبُو بَكْرٍ ـ رضى الله عنه ـ فَمَالَ إِلَيْهِ النَّاسُ، وَتَرَكُوا عُمَرَ فَقَالَ أَمَّا بَعْدُ، فَمَنْ كَانَ مِنْكُمْ يَعْبُدُ مُحَمَّدًا صلى الله عليه وسلم فَإِنَّ مُحَمَّدًا صلى الله عليه وسلم قَدْ مَاتَ، وَمَنْ كَانَ يَعْبُدُ اللَّهَ فَإِنَّ اللَّهَ حَىٌّ لاَ يَمُوتُ، قَالَ اللَّهُ تَعَالَى ‏{‏وَمَا مُحَمَّدٌ إِلاَّ رَسُولٌ‏}‏ إِلَى ‏{‏الشَّاكِرِينَ‏}‏ وَاللَّهِ لَكَأَنَّ النَّاسَ لَمْ يَكُونُوا يَعْلَمُونَ أَنَّ اللَّهَ أَنْزَلَ الآيَةَ حَتَّى تَلاَهَا أَبُو بَكْرٍ ـ رضى الله عنه ـ فَتَلَقَّاهَا مِنْهُ النَّاسُ، فَمَا يُسْمَعُ بَشَرٌ إِلاَّ يَتْلُوهَا‏.‏","english":{"narrator":"Narrated `Aisha:","text":"Abu Bakr came riding his horse from his dwelling place in As-Sunh. He got down from it, entered the \nMosque and did not speak with anybody till he came to me and went direct to the Prophet, who was \ncovered with a marked blanket. Abu Bakr uncovered his face. He knelt down and kissed him and then \nstarted weeping and said, \"My father and my mother be sacrificed for you, O Allah's Prophet! Allah \nwill not combine two deaths on you. You have died the death which was written for you.\" \nNarrated Abu Salama from Ibn `Abbas : Abu Bakr came out and `Umar , was addressing the people, \nand Abu Bakr told him to sit down but `Umar refused. Abu Bakr again told him to sit down but `Umar \nagain refused. Then Abu Bakr recited the Tashah-hud (i.e. none has the right to be worshipped but \nAllah and Muhammad is Allah's Messenger (ﷺ)) and the people attended to Abu Bakr and left `Umar. Abu \nBakr said, \"Amma ba'du, whoever amongst you worshipped Muhammad, then Muhammad is dead, \nbut whoever worshipped Allah, Allah is alive and will never die. Allah said: 'Muhammad is no more \nthan an Apostle and indeed (many) Apostles have passed away before him ..(up to the) grateful.' \" \n(3.144) (The narrator added, \"By Allah, it was as if the people never knew that Allah had revealed this \nverse before till Abu Bakr recited it and then whoever heard it, started reciting it.\")"}},{"id":6,"idInBook":6,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي خَارِجَةُ بْنُ زَيْدِ بْنِ ثَابِتٍ، أَنَّ أُمَّ الْعَلاَءِ ـ امْرَأَةً مِنَ الأَنْصَارِ ـ بَايَعَتِ النَّبِيَّ صلى الله عليه وسلم أَخْبَرَتْهُ أَنَّهُ اقْتُسِمَ الْمُهَاجِرُونَ قُرْعَةً فَطَارَ لَنَا عُثْمَانُ بْنُ مَظْعُونٍ، فَأَنْزَلْنَاهُ فِي أَبْيَاتِنَا، فَوَجِعَ وَجَعَهُ الَّذِي تُوُفِّيَ فِيهِ، فَلَمَّا تُوُفِّيَ وَغُسِّلَ وَكُفِّنَ فِي أَثْوَابِهِ، دَخَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقُلْتُ رَحْمَةُ اللَّهِ عَلَيْكَ أَبَا السَّائِبِ، فَشَهَادَتِي عَلَيْكَ لَقَدْ أَكْرَمَكَ اللَّهُ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ وَمَا يُدْرِيكِ أَنَّ اللَّهَ قَدْ أَكْرَمَهُ ‏\"‏‏.‏ فَقُلْتُ بِأَبِي أَنْتَ يَا رَسُولَ اللَّهِ فَمَنْ يُكْرِمُهُ اللَّهُ فَقَالَ ‏\"‏ أَمَّا هُوَ فَقَدْ جَاءَهُ الْيَقِينُ، وَاللَّهِ إِنِّي لأَرْجُو لَهُ الْخَيْرَ، وَاللَّهِ مَا أَدْرِي ـ وَأَنَا رَسُولُ اللَّهِ ـ مَا يُفْعَلُ بِي ‏\"‏‏.‏ قَالَتْ فَوَاللَّهِ لاَ أُزَكِّي أَحَدًا بَعْدَهُ أَبَدًا‏.‏   \nحَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، حَدَّثَنَا اللَّيْثُ، مِثْلَهُ‏.‏ وَقَالَ نَافِعُ بْنُ يَزِيدَ عَنْ عُقَيْلٍ، مَا يُفْعَلُ بِهِ وَتَابَعَهُ شُعَيْبٌ وَعَمْرُو بْنُ دِينَارٍ وَمَعْمَرٌ‏.‏","english":{"narrator":"Narrated Kharija bin Zaid bin Thabit:","text":"Um Al-`Ala', an Ansari woman who gave the pledge of allegiance to the Prophet (ﷺ) said to me, \"The \nemigrants were distributed amongst us by drawing lots and we got in our share `Uthman bin Maz'un. \nWe made him stay with us in our house. Then he suffered from a disease which proved fatal when he \ndied and was given a bath and was shrouded in his clothes, Allah's Messenger (ﷺ) came I said, 'May Allah be \nmerciful to you, O Abu As-Sa'ib! I testify that Allah has honored you'. The Prophet (ﷺ) said, 'How do you \nknow that Allah has honored him?' I replied, 'O Allah's Messenger (ﷺ)! Let my father be sacrificed for you! \nOn whom else shall Allah bestow His honor?' The Prophet (ﷺ) said, 'No doubt, death came to him. By \nAllah, I too wish him good, but by Allah, I do not know what Allah will do with me though I am \nAllah's Messenger (ﷺ). ' By Allah, I never attested the piety of anyone after that.\"\n\nAl-Laith also narrated as above."}},{"id":7,"idInBook":7,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ مُحَمَّدَ بْنَ الْمُنْكَدِرِ، قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ لَمَّا قُتِلَ أَبِي جَعَلْتُ أَكْشِفُ الثَّوْبَ عَنْ وَجْهِهِ أَبْكِي، وَيَنْهَوْنِي عَنْهُ وَالنَّبِيُّ صلى الله عليه وسلم لاَ يَنْهَانِي، فَجَعَلَتْ عَمَّتِي فَاطِمَةُ تَبْكِي، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ تَبْكِينَ أَوْ لاَ تَبْكِينَ، مَا زَالَتِ الْمَلاَئِكَةُ تُظِلُّهُ بِأَجْنِحَتِهَا حَتَّى رَفَعْتُمُوهُ ‏\"‏‏.‏ تَابَعَهُ ابْنُ جُرَيْجٍ أَخْبَرَنِي ابْنُ الْمُنْكَدِرِ سَمِعَ جَابِرًا ـ رضى الله عنه ـ‏.‏","english":{"narrator":"Narrated Jabir bin `Abdullah:","text":"When my father was martyred, I lifted the sheet from his face and wept and the people forbade me to \ndo so but the Prophet (ﷺ) did not forbid me. Then my aunt Fatima began weeping and the Prophet (ﷺ) said, \"It \nis all the same whether you weep or not. The angels were shading him continuously with their wings \ntill you shifted him (from the field). \""}},{"id":8,"idInBook":8,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَعَى النَّجَاشِيَّ فِي الْيَوْمِ الَّذِي مَاتَ فِيهِ، خَرَجَ إِلَى الْمُصَلَّى، فَصَفَّ بِهِمْ وَكَبَّرَ أَرْبَعًا‏.‏","english":{"narrator":"Narrated Abu Huraira:","text":"Allah's Messenger (ﷺ) informed (the people) about the death of An-Najashi on the very day he died. He went \ntowards the Musalla (praying place) and the people stood behind him in rows. He said four Takbirs \n(i.e. offered the Funeral prayer)."}},{"id":9,"idInBook":9,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا أَيُّوبُ، عَنْ حُمَيْدِ بْنِ هِلاَلٍ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ أَخَذَ الرَّايَةَ زَيْدٌ فَأُصِيبَ، ثُمَّ أَخَذَهَا جَعْفَرٌ فَأُصِيبَ، ثُمَّ أَخَذَهَا عَبْدُ اللَّهِ بْنُ رَوَاحَةَ فَأُصِيبَ ـ وَإِنَّ عَيْنَىْ رَسُولِ اللَّهِ صلى الله عليه وسلم لَتَذْرِفَانِ ـ ثُمَّ أَخَذَهَا خَالِدُ بْنُ الْوَلِيدِ مِنْ غَيْرِ إِمْرَةٍ فَفُتِحَ لَهُ ‏\"‏","english":{"narrator":"Narrated Anas bin Malik:","text":"The Prophet (ﷺ) said, \"Zaid took over the flag and was martyred. Then it was taken by Jafar who was \nmartyred as well. Then `Abdullah bin Rawaha took the flag but he too was martyred and at that time \nthe eyes of Allah's Messenger (ﷺ) were full of tears. Then Khalid bin Al-Walid took the flag without being \nnominated as a chief (before hand) and was blessed with victory.\""}},{"id":10,"idInBook":10,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا مُحَمَّدٌ، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، عَنْ أَبِي إِسْحَاقَ الشَّيْبَانِيِّ، عَنِ الشَّعْبِيِّ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ مَاتَ إِنْسَانٌ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَعُودُهُ فَمَاتَ بِاللَّيْلِ فَدَفَنُوهُ لَيْلاً، فَلَمَّا أَصْبَحَ أَخْبَرُوهُ فَقَالَ ‏\n\"‏ مَا مَنَعَكُمْ أَنْ تُعْلِمُونِي ‏\"‏‏.‏ قَالُوا كَانَ اللَّيْلُ فَكَرِهْنَا ـ وَكَانَتْ ظُلْمَةٌ ـ أَنْ نَشُقَّ عَلَيْكَ‏.‏ فَأَتَى قَبْرَهُ فَصَلَّى عَلَيْهِ‏.‏","english":{"narrator":"Narrated Ibn `Abbas.:","text":"A person died and Allah's Messenger (ﷺ) used to visit him. He died at night and (the people) buried him at \nnight. In the morning they informed the Prophet (about his death). He said, \"What prevented you from \ninforming me?\" They replied, \"It was night and it was a dark night and so we disliked to trouble you.\" \nThe Prophet (ﷺ) went to his grave and offered the (funeral) prayer."}},{"id":11,"idInBook":11,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ مَا مِنَ النَّاسِ مِنْ مُسْلِمٍ يُتَوَفَّى لَهُ ثَلاَثٌ لَمْ يَبْلُغُوا الْحِنْثَ، إِلاَّ أَدْخَلَهُ اللَّهُ الْجَنَّةَ بِفَضْلِ رَحْمَتِهِ إِيَّاهُمْ ‏\"‏‏.‏","english":{"narrator":"Narrated Anas:","text":"The Prophet (ﷺ) said, \"A Muslim whose three children die before the age of puberty will be granted \nParadise by Allah due to his mercy for them.\""}},{"id":12,"idInBook":12,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا مُسْلِمٌ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ الأَصْبَهَانِيِّ، عَنْ ذَكْوَانَ، عَنْ أَبِي سَعِيدٍ، رضى الله عنه أَنَّ النِّسَاءَ، قُلْنَ لِلنَّبِيِّ صلى الله عليه وسلم اجْعَلْ لَنَا يَوْمًا‏.‏ فَوَعَظَهُنَّ، وَقَالَ ‏\"‏ أَيُّمَا امْرَأَةٍ مَاتَ لَهَا ثَلاَثَةٌ مِنَ الْوَلَدِ كَانُوا حِجَابًا مِنَ النَّارِ ‏\"‏‏.‏ قَالَتِ امْرَأَةٌ وَاثْنَانِ‏.‏ قَالَ ‏\"‏ وَاثْنَانِ ‏\"‏‏.‏   وَقَالَ شَرِيكٌ عَنِ ابْنِ الأَصْبَهَانِيِّ، حَدَّثَنِي أَبُو صَالِحٍ، عَنْ أَبِي سَعِيدٍ، وَأَبِي، هُرَيْرَةَ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ أَبُو هُرَيْرَةَ ‏\"‏ لَمْ يَبْلُغُوا الْحِنْثَ ‏\"‏‏.‏","english":{"narrator":"Narrated Abu Sa`id:","text":"The women requested the Prophet, \"Please fix a day for us.\" So the Prophet (ﷺ) preached to them and \nsaid, \"A woman whose three children died would be screened from the Hell Fire by them,\" Hearing \nthat, a woman asked, \"If two died?\" The Prophet (ﷺ) replied, \"Even two (would screen her from the (Hell) \nFire. \" And Abu Huraira added, \"Those children should be below the age of puberty. \""}},{"id":13,"idInBook":13,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا عَلِيٌّ، حَدَّثَنَا سُفْيَانُ، قَالَ سَمِعْتُ الزُّهْرِيَّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ يَمُوتُ لِمُسْلِمٍ ثَلاَثَةٌ مِنَ الْوَلَدِ، فَيَلِجَ النَّارَ إِلاَّ تَحِلَّةَ الْقَسَمِ ‏\"‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ ‏{‏وَإِنْ مِنْكُمْ إِلاَّ وَارِدُهَا‏}‏‏.‏","english":{"narrator":"Narrated Abu Huraira:","text":"The Prophet (ﷺ) said, \"No Muslim whose three children died will go to the Fire except for Allah's oath \n(i.e. everyone has to pass over the bridge above the lake of fire).\""}},{"id":14,"idInBook":14,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ مَرَّ النَّبِيُّ صلى الله عليه وسلم بِامْرَأَةٍ عِنْدَ قَبْرٍ وَهِيَ تَبْكِي فَقَالَ ‏\n\"‏ اتَّقِي اللَّهَ وَاصْبِرِي ‏\"‏‏.‏","english":{"narrator":"Narrated Anas bin Malik:","text":"The Prophet (ﷺ) passed by a woman who was sitting and weeping beside a grave and said to her, \"Fear \nAllah and be patient.\""}},{"id":15,"idInBook":15,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ أَيُّوبَ السَّخْتِيَانِيِّ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أُمِّ عَطِيَّةَ الأَنْصَارِيَّةِ ـ رضى الله عنها ـ قَالَتْ دَخَلَ عَلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ تُوُفِّيَتِ ابْنَتُهُ فَقَالَ ‏\"‏ اغْسِلْنَهَا ثَلاَثًا أَوْ خَمْسًا أَوْ أَكْثَرَ مَنْ ذَلِكَ إِنْ رَأَيْتُنَّ ذَلِكَ بِمَاءٍ وَسِدْرٍ، وَاجْعَلْنَ فِي الآخِرَةِ كَافُورًا أَوْ شَيْئًا مِنْ كَافُورٍ، فَإِذَا فَرَغْتُنَّ فَآذِنَّنِي ‏\"‏‏.‏ فَلَمَّا فَرَغْنَا آذَنَّاهُ فَأَعْطَانَا حِقْوَهُ فَقَالَ ‏\"‏ أَشْعِرْنَهَا إِيَّاهُ ‏\"‏‏.‏ تَعْنِي إِزَارَهُ‏.‏","english":{"narrator":"Narrated Um 'Atiyya al-Ansariya:","text":"Allah's Messenger (ﷺ) came to us when his daughter died and said, \"Wash her thrice or five times or more, if \nyou see it necessary, with water and Sidr and then apply camphor or some camphor at the end; and \nwhen you finish, notify me.\" So when we finished it, we informed him and he gave us his waist-sheet \nand told us to shroud the dead body in it."}},{"id":16,"idInBook":16,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا مُحَمَّدٌ، حَدَّثَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، عَنْ أُمِّ عَطِيَّةَ ـ رضى الله عنها ـ قَالَتْ دَخَلَ عَلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَنَحْنُ نَغْسِلُ ابْنَتَهُ فَقَالَ ‏\"‏ اغْسِلْنَهَا ثَلاَثًا أَوْ خَمْسًا أَوْ أَكْثَرَ مِنْ ذَلِكَ بِمَاءٍ وَسِدْرٍ، وَاجْعَلْنَ فِي الآخِرَةِ كَافُورًا، فَإِذَا فَرَغْتُنَّ فَآذِنَّنِي ‏\"‏‏.‏ فَلَمَّا فَرَغْنَا آذَنَّاهُ، فَأَلْقَى إِلَيْنَا حِقْوَهُ فَقَالَ ‏\"‏ أَشْعِرْنَهَا إِيَّاهُ ‏\"‏‏.‏ فَقَالَ أَيُّوبُ وَحَدَّثَتْنِي حَفْصَةُ بِمِثْلِ حَدِيثِ مُحَمَّدٍ وَكَانَ فِي حَدِيثِ حَفْصَةَ ‏\"‏ اغْسِلْنَهَا وِتْرًا ‏\"‏‏.‏ وَكَانَ فِيهِ ‏:‏ ‏\"‏ ثَلاَثًا أَوْ خَمْسًا أَوْ سَبْعًا ‏\"‏‏.‏ وَكَانَ فِيهِ أَنَّهُ قَالَ ‏\"‏ ابْدَأْنَ بِمَيَامِنِهَا وَمَوَاضِعِ الْوُضُوءِ مِنْهَا ‏\"‏‏.‏ وَكَانَ فِيهِ أَنَّ أُمَّ عَطِيَّةَ قَالَتْ وَمَشَطْنَاهَا ثَلاَثَةَ قُرُونٍ‏.‏","english":{"narrator":"Narrated Um 'Atiyya:","text":"Allah's Messenger (ﷺ) came to us and we were giving a bath to his (dead) daughter and said, \"Wash her \nthree, five or more times with water and Sidr and sprinkle camphor on her at the end; and when you \nfinish, notify me.\" So when we finished, we informed him and he gave us his waist-sheet and told us \nto shroud her in it. Aiyub said that Hafsa narrated to him a narration similar to that of Muhammad in \nwhich it was said that the bath was to be given for an odd number of times, and the numbers 3, 5 or 7 \nwere mentioned. It was also said that they were to start with the right side and with the parts which \nwere washed in ablution, and that Um 'Atiyya also mentioned, \"We combed her hair and divided them \nin three braids.\""}},{"id":17,"idInBook":17,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا خَالِدٌ، عَنْ حَفْصَةَ بِنْتِ سِيرِينَ، عَنْ أُمِّ عَطِيَّةَ ـ رضى الله عنها ـ قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي غَسْلِ ابْنَتِهِ ‏\n\"‏ ابْدَأْنَ بِمَيَامِنِهَا وَمَوَاضِعِ الْوُضُوءِ مِنْهَا ‏\"‏‏.‏","english":{"narrator":"Narrated Um 'Atiyya:","text":"Allah's Messenger (ﷺ) , concerning his (dead) daughter's bath, said, \"Start with the right side, and the parts \nwhich are washed in ablution.\""}},{"id":18,"idInBook":18,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا يَحْيَى بْنُ مُوسَى، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ حَفْصَةَ بِنْتِ سِيرِينَ، عَنْ أُمِّ عَطِيَّةَ ـ رضى الله عنها ـ قَالَتْ لَمَّا غَسَّلْنَا بِنْتَ النَّبِيِّ صلى الله عليه وسلم قَالَ لَنَا وَنَحْنُ نَغْسِلُهَا ‏\n\"‏ ابْدَأْنَ بِمَيَامِنِهَا وَمَوَاضِعِ الْوُضُوءِ ‏\"‏‏.‏","english":{"narrator":"Narrated Um 'Atiyya:","text":"When we washed the deceased daughter of the Prophet, he said to us, while we were washing her, \n\"Start the bath from the right side and from the parts which are washed in ablution.\""}},{"id":19,"idInBook":19,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ حَمَّادٍ، أَخْبَرَنَا ابْنُ عَوْنٍ، عَنْ مُحَمَّدٍ، عَنْ أُمِّ عَطِيَّةَ، قَالَتْ تُوُفِّيَتْ بِنْتُ النَّبِيِّ صلى الله عليه وسلم فَقَالَ لَنَا ‏\"‏ اغْسِلْنَهَا ثَلاَثًا أَوْ خَمْسًا أَوْ أَكْثَرَ مِنْ ذَلِكَ إِنْ رَأَيْتُنَّ، فَإِذَا فَرَغْتُنَّ فَآذِنَّنِي ‏\"‏‏.‏ فَلَمَّا فَرَغْنَا آذَنَّاهُ فَنَزَعَ مِنْ حِقْوِهِ إِزَارَهُ وَقَالَ ‏\"‏ أَشْعِرْنَهَا إِيَّاهُ ‏\"‏‏.‏","english":{"narrator":"Narrated Um 'Atiyya:","text":"The daughter of the Prophet (ﷺ) expired, and he said to us, \"Wash her three or five times, or more if you \nsee it necessary, and when you finish, notify me.\" So, (when we finished) we informed him and he \nunfastened his waist-sheet and told us to shroud her in it."}},{"id":20,"idInBook":20,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا حَامِدُ بْنُ عُمَرَ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، عَنْ أُمِّ عَطِيَّةَ، قَالَتْ تُوُفِّيَتْ إِحْدَى بَنَاتِ النَّبِيِّ صلى الله عليه وسلم فَخَرَجَ، فَقَالَ ‏\"‏ اغْسِلْنَهَا ثَلاَثًا أَوْ خَمْسًا أَوْ أَكْثَرَ مِنْ ذَلِكَ إِنْ رَأَيْتُنَّ بِمَاءٍ وَسِدْرٍ، وَاجْعَلْنَ فِي الآخِرَةِ كَافُورًا أَوْ شَيْئًا مِنْ كَافُورٍ، فَإِذَا فَرَغْتُنَّ فَآذِنَّنِي ‏\"‏‏.‏ قَالَتْ فَلَمَّا فَرَغْنَا آذَنَّاهُ، فَأَلْقَى إِلَيْنَا حِقْوَهُ فَقَالَ ‏\"‏ أَشْعِرْنَهَا إِيَّاهُ ‏\"‏‏.‏   وَعَنْ أَيُّوبَ، عَنْ حَفْصَةَ، عَنْ أُمِّ عَطِيَّةَ ـ رضى الله عنهما ـ بِنَحْوِهِ وَقَالَتْ إِنَّهُ قَالَ ‏\"‏ اغْسِلْنَهَا ثَلاَثًا أَوْ خَمْسًا أَوْ سَبْعًا أَوْ أَكْثَرَ مِنْ ذَلِكَ إِنْ رَأَيْتُنَّ ‏\"‏‏.‏ قَالَتْ حَفْصَةُ قَالَتْ أُمُّ عَطِيَّةَ ـ رضى الله عنها ـ وَجَعَلْنَا رَأْسَهَا ثَلاَثَةَ قُرُونٍ‏.‏","english":{"narrator":"Narrated Muhammad:","text":"Um 'Atiyya said, \"One of the daughters of the Prophet (ﷺ) died and he came out and said, 'Wash her three \nor five times or more, if you think it necessary, with water and Sidr, and last of all put camphor (or \nsome camphor) and when you finish, inform me.' \" Um Atiyya added, \"When we finished we \ninformed him and he gave us his waist-sheet and said, 'Shroud her in it.' \" And Um 'Atiyya (in another \nnarration) added, \"The Prophet (ﷺ) said, 'Wash her three, five or seven times or more, if you think it \nnecessary.' \" Hafsa said that Um 'Atiyya had also said, \"We entwined her hair into three braids.\""}},{"id":21,"idInBook":21,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا أَحْمَدُ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ أَيُّوبُ وَسَمِعْتُ حَفْصَةَ بِنْتَ سِيرِينَ، قَالَتْ حَدَّثَتْنَا أُمُّ عَطِيَّةَ ـ رضى الله عنها ـ أَنَّهُنَّ جَعَلْنَ رَأْسَ بِنْتِ رَسُولِ اللَّهِ صلى الله عليه وسلم ثَلاَثَةَ قُرُونٍ نَقَضْنَهُ ثُمَّ غَسَلْنَهُ ثُمَّ جَعَلْنَهُ ثَلاَثَةَ قُرُونٍ‏.‏","english":{"narrator":"Narrated Hafsa bint Seereen:","text":"Um 'Atiyya said that they had entwined the hair of the daughter of Allah's Messenger (ﷺ) in three braids. \nThey first undid her hair, washed and then entwined it in three braids.\""}},{"id":22,"idInBook":22,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا أَحْمَدُ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَنَّ أَيُّوبَ، أَخْبَرَهُ قَالَ سَمِعْتُ ابْنَ سِيرِينَ، يَقُولُ جَاءَتْ أُمُّ عَطِيَّةَ ـ رضى الله عنها ـ امْرَأَةٌ مِنَ الأَنْصَارِ مِنَ اللاَّتِي بَايَعْنَ، قَدِمَتِ الْبِصْرَةَ، تُبَادِرُ ابْنًا لَهَا فَلَمْ تُدْرِكْهُ ـ فَحَدَّثَتْنَا قَالَتْ دَخَلَ عَلَيْنَا النَّبِيُّ صلى الله عليه وسلم وَنَحْنُ نَغْسِلُ ابْنَتَهُ فَقَالَ ‏\"‏ اغْسِلْنَهَا ثَلاَثًا أَوْ خَمْسًا أَوْ أَكْثَرَ مِنْ ذَلِكَ إِنْ رَأَيْتُنَّ ذَلِكَ بِمَاءٍ وَسِدْرٍ، وَاجْعَلْنَ فِي الآخِرَةِ كَافُورًا، فَإِذَا فَرَغْتُنَّ فَآذِنَّنِي ‏\"‏‏.‏ قَالَتْ فَلَمَّا فَرَغْنَا أَلْقَى إِلَيْنَا حَقْوَهُ فَقَالَ ‏\"‏ أَشْعِرْنَهَا إِيَّاهُ ‏\"‏‏.‏ وَلَمْ يَزِدْ عَلَى ذَلِكَ، وَلاَ أَدْرِي أَىُّ بَنَاتِهِ‏.‏ وَزَعَمَ أَنَّ الإِشْعَارَ الْفُفْنَهَا فِيهِ، وَكَذَلِكَ كَانَ ابْنُ سِيرِينَ يَأْمُرُ بِالْمَرْأَةِ أَنْ تُشْعَرَ وَلاَ تُؤْزَرَ‏.‏","english":{"narrator":"Narrated Ibn Seereen:","text":"Um 'Atiyya (an Ansari woman who gave the pledge of allegiance to the Prophet (ﷺ) ) came to Basra to \nvisit her son, but she could not find him. She narrated to us, \"The Prophet (ﷺ) came to us while we were \ngiving bath to his (dead) daughter, he said: 'Wash her three times, five times or more, if you think it \nnecessary, with water and Sidr, and last of all put camphor, and when you finish, notify me.' \" Um \n'Atiyya added, \"After finishing, we informed him and he gave us his waist sheet and told us to shroud \nher in it and did not say more than that.\""}},{"id":23,"idInBook":23,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا سُفْيَانُ، عَنْ هِشَامٍ، عَنْ أُمِّ الْهُذَيْلِ، عَنْ أُمِّ عَطِيَّةَ ـ رضى الله عنها ـ قَالَتْ ضَفَرْنَا شَعَرَ بِنْتِ النَّبِيِّ صلى الله عليه وسلم‏.‏ تَعْنِي ثَلاَثَةَ قُرُونٍ‏.‏ وَقَالَ وَكِيعٌ قَالَ سُفْيَانُ نَاصِيَتَهَا وَقَرْنَيْهَا‏.‏","english":{"narrator":"Narrated Um 'Atiyya:","text":"We entwined the hair of the dead daughter of the Prophet (ﷺ) into three braids. Waki said that Sufyan \nsaid, \"One braid was entwined in front and the other two were entwined on the sides of the head.\""}},{"id":24,"idInBook":24,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ هِشَامِ بْنِ حَسَّانَ، قَالَ حَدَّثَتْنَا حَفْصَةُ، عَنْ أُمِّ عَطِيَّةَ ـ رضى الله عنها ـ قَالَتْ تُوُفِّيَتْ إِحْدَى بَنَاتِ النَّبِيِّ صلى الله عليه وسلم فَأَتَانَا النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ اغْسِلْنَهَا بِالسِّدْرِ وِتْرًا ثَلاَثًا أَوْ خَمْسًا أَوْ أَكْثَرَ مِنْ ذَلِكَ إِنْ رَأَيْتُنَّ ذَلِكَ، وَاجْعَلْنَ فِي الآخِرَةِ كَافُورًا أَوْ شَيْئًا مِنْ كَافُورٍ، فَإِذَا فَرَغْتُنَّ فَآذِنَّنِي ‏\"‏‏.‏ فَلَمَّا فَرَغْنَا آذَنَّاهُ، فَأَلْقَى إِلَيْنَا حِقْوَهُ، فَضَفَرْنَا شَعَرَهَا ثَلاَثَةَ قُرُونٍ وَأَلْقَيْنَاهَا خَلْفَهَا‏.‏","english":{"narrator":"Narrated Um 'Atiyya:","text":"One of the daughters of the Prophet (ﷺ) expired and he came to us and said, \"Wash her with Sidr (water) \nfor odd number of times, i.e. three, five or more, if you think it necessary, and in the last, put camphor \nor (some camphor on her), and when you finish, notify me.\" So when we finished we informed him. \nHe gave his waist-sheet to us (to shroud her). We entwined the hair (of the deceased girl) in three \nbraids and made them fall at her back."}},{"id":25,"idInBook":25,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كُفِّنَ فِي ثَلاَثَةِ أَثْوَابٍ يَمَانِيَةٍ بِيضٍ سَحُولِيَّةٍ مِنْ كُرْسُفٍ، لَيْسَ فِيهِنَّ قَمِيصٌ وَلاَ عِمَامَةٌ‏.‏","english":{"narrator":"Narrated `Aisha:","text":"Allah's Messenger (ﷺ) was shrouded in three Yemenite white Suhuliya (pieces of cloth) of cotton, and in \nthem there was neither a shirt nor a turban.\""}},{"id":26,"idInBook":26,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهم ـ قَالَ بَيْنَمَا رَجُلٌ وَاقِفٌ بِعَرَفَةَ إِذْ وَقَعَ عَنْ رَاحِلَتِهِ فَوَقَصَتْهُ ـ أَوْ قَالَ فَأَوْقَصَتْهُ ـ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ اغْسِلُوهُ بِمَاءٍ وَسِدْرٍ، وَكَفِّنُوهُ فِي ثَوْبَيْنِ، وَلاَ تُحَنِّطُوهُ وَلاَ تُخَمِّرُوا رَأْسَهُ، فَإِنَّهُ يُبْعَثُ يَوْمَ الْقِيَامَةِ مُلَبِّيًا ‏\"‏‏.‏","english":{"narrator":"Narrated Ibn `Abbas:","text":"While a man was riding (his Mount) in `Arafat, he fell down from it (his Mount) and broke his neck \n(and died). The Prophet (ﷺ) said, \"Wash him with water and Sidr and shroud him in two pieces of cloth, \nand neither perfume him, nor cover his head, for he will be resurrected on the Day of Resurrection \nsaying, 'Labbaik,' (i.e. like a pilgrim).\""}},{"id":27,"idInBook":27,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ بَيْنَمَا رَجُلٌ وَاقِفٌ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم بِعَرَفَةَ إِذْ وَقَعَ مِنْ رَاحِلَتِهِ فَأَقْصَعَتْهُ ـ أَوْ قَالَ فَأَقْعَصَتْهُ ـ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ اغْسِلُوهُ بِمَاءٍ وَسِدْرٍ، وَكَفِّنُوهُ فِي ثَوْبَيْنِ، وَلاَ تُحَنِّطُوهُ وَلاَ تُخَمِّرُوا رَأْسَهُ، فَإِنَّ اللَّهَ يَبْعَثُهُ يَوْمَ الْقِيَامَةِ مُلَبِّيًا ‏\"‏‏.‏","english":{"narrator":"Narrated Ibn `Abbas:","text":"While a man was at `Arafat (for Hajj) with Allah's Messenger (ﷺ) the fell down from his Mount and broke \nhis neck (and died). So Allah's Messenger (ﷺ) said, \"Wash him with water and Sidr and shroud him in two \npieces of cloth and neither perfume him nor cover his head, for Allah will resurrect him on the Day of \nResurrection and he will be saying 'Labbaik.\""}},{"id":28,"idInBook":28,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا أَبُو النُّعْمَانِ، أَخْبَرَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهم ـ أَنَّ رَجُلاً، وَقَصَهُ بَعِيرُهُ، وَنَحْنُ مَعَ النَّبِيِّ صلى الله عليه وسلم وَهْوَ مُحْرِمٌ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ اغْسِلُوهُ بِمَاءٍ وَسِدْرٍ، وَكَفِّنُوهُ فِي ثَوْبَيْنِ، وَلاَ تُمِسُّوهُ طِيبًا، وَلاَ تُخَمِّرُوا رَأْسَهُ، فَإِنَّ اللَّهَ يَبْعَثُهُ يَوْمَ الْقِيَامَةِ مُلَبِّدًا ‏\"‏‏.‏","english":{"narrator":"Narrated Ibn `Abbas:","text":"A man was killed by his camel while we were with the Prophet (ﷺ) and he was a Muhrim. So the Prophet (ﷺ) \nsaid, \"Wash him with water and Sidr and shroud him in two pieces of cloth and neither perfume him \nnor cover his head, for Allah will resurrect him on the Day of Resurrection and he will be saying \n'Labbaik' . \""}},{"id":29,"idInBook":29,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَمْرٍو، وَأَيُّوبَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهم ـ قَالَ كَانَ رَجُلٌ وَاقِفٌ مَعَ النَّبِيِّ صلى الله عليه وسلم بِعَرَفَةَ فَوَقَعَ عَنْ رَاحِلَتِهِ ـ قَالَ أَيُّوبُ فَوَقَصَتْهُ، وَقَالَ عَمْرٌو فَأَقْصَعَتْهُ ـ فَمَاتَ فَقَالَ ‏\n\"‏ اغْسِلُوهُ بِمَاءٍ وَسِدْرٍ، وَكَفِّنُوهُ فِي ثَوْبَيْنِ، وَلاَ تُحَنِّطُوهُ وَلاَ تُخَمِّرُوا رَأْسَهُ، فَإِنَّهُ يُبْعَثُ يَوْمَ الْقِيَامَةِ ـ قَالَ أَيُّوبُ يُلَبِّي، وَقَالَ عَمْرٌو ـ مُلَبِّيًا ‏\"‏‏.‏","english":{"narrator":"Narrated Ibn `Abbas:","text":"A man fell from his Mount and died while he was with the Prophet (ﷺ) at `Arafat. The Prophet (ﷺ) said, \n\"Wash him with water and Sidr and shroud him in two pieces of cloth and neither perfume him nor \ncover his head, for he will be resurrected on the Day of Resurrection saying, 'Labbaik'.\""}},{"id":30,"idInBook":30,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ عُبَيْدِ اللَّهِ، قَالَ حَدَّثَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ عَبْدَ، اللَّهِ بْنَ أُبَىٍّ لَمَّا تُوُفِّيَ جَاءَ ابْنُهُ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ أَعْطِنِي قَمِيصَكَ أُكَفِّنْهُ فِيهِ، وَصَلِّ عَلَيْهِ وَاسْتَغْفِرْ لَهُ، فَأَعْطَاهُ النَّبِيُّ صلى الله عليه وسلم قَمِيصَهُ فَقَالَ ‏\"‏ آذِنِّي أُصَلِّي عَلَيْهِ ‏\"‏‏.‏ فَآذَنَهُ، فَلَمَّا أَرَادَ أَنْ يُصَلِّيَ عَلَيْهِ جَذَبَهُ عُمَرُ ـ رضى الله عنه ـ فَقَالَ أَلَيْسَ اللَّهُ نَهَاكَ أَنْ تُصَلِّيَ عَلَى الْمُنَافِقِينَ فَقَالَ ‏\"‏ أَنَا بَيْنَ خِيرَتَيْنِ قَالَ ‏{‏اسْتَغْفِرْ لَهُمْ أَوْ لاَ تَسْتَغْفِرْ لَهُمْ إِنْ تَسْتَغْفِرْ لَهُمْ سَبْعِينَ مَرَّةً فَلَنْ يَغْفِرَ اللَّهُ لَهُمْ‏}‏ ‏\"‏‏.‏ فَصَلَّى عَلَيْهِ فَنَزَلَتْ ‏{‏وَلاَ تُصَلِّ عَلَى أَحَدٍ مِنْهُمْ مَاتَ أَبَدًا‏}‏","english":{"narrator":"Narrated Ibn `Umar:","text":"When `Abdullah bin Ubai (the chief of hypocrites) died, his son came to the Prophet (ﷺ) and said, \"O \nAllah's Messenger (ﷺ)! Please give me your shirt to shroud him in it, offer his funeral prayer and ask for \nAllah's forgiveness for him.\" So Allah's Messenger (ﷺ) (p.b.u.h) gave his shirt to him and said, \"Inform me \n(When the funeral is ready) so that I may offer the funeral prayer.\" So, he informed him and when the \nProphet intended to offer the funeral prayer, `Umar took hold of his hand and said, \"Has Allah not \nforbidden you to offer the funeral prayer for the hypocrites? The Prophet (ﷺ) said, \"I have been given the \nchoice for Allah says: '(It does not avail) Whether you (O Muhammad) ask forgiveness for them \n(hypocrites), or do not ask for forgiveness for them. Even though you ask for their forgiveness seventy \ntimes, Allah will not forgive them. (9.80)\" So the Prophet (ﷺ) offered the funeral prayer and on that the \nrevelation came: \"And never (O Muhammad) pray (funeral prayer) for any of them (i.e. hypocrites) \nthat dies.\" (9. 84)"}},{"id":31,"idInBook":31,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا ابْنُ عُيَيْنَةَ، عَنْ عَمْرٍو، سَمِعَ جَابِرًا ـ رضى الله عنه ـ قَالَ أَتَى النَّبِيُّ صلى الله عليه وسلم عَبْدَ اللَّهِ بْنَ أُبَىٍّ بَعْدَ مَا دُفِنَ فَأَخْرَجَهُ، فَنَفَثَ فِيهِ مِنْ رِيقِهِ وَأَلْبَسَهُ قَمِيصَهُ‏.‏","english":{"narrator":"Narrated Jabir:","text":"The Prophet (ﷺ) came to (the grave of) `Abdullah bin Ubai after his body was buried. The body was \nbrought out and then the Prophet (ﷺ) put his saliva over the body and clothed it in his shirt."}},{"id":32,"idInBook":32,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ هِشَامٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كُفِّنَ النَّبِيُّ صلى الله عليه وسلم فِي ثَلاَثَةِ أَثْوَابِ سَحُولَ كُرْسُفٍ، لَيْسَ فِيهَا قَمِيصٌ وَلاَ عِمَامَةٌ‏.‏","english":{"narrator":"Narrated `Aisha:","text":"The Prophet (ﷺ) was shrouded in three pieces of cloth which were made of Suhul (a type of cotton), and \nneither a shirt nor a turban were used."}},{"id":33,"idInBook":33,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ هِشَامٍ، حَدَّثَنِي أَبِي، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كُفِّنَ فِي ثَلاَثَةِ أَثْوَابٍ، لَيْسَ فِيهَا قَمِيصٌ وَلاَ عِمَامَةٌ‏.‏","english":{"narrator":"Narrated `Aisha:","text":"Allah's Messenger (ﷺ) was shrouded in three pieces of cloth and neither a shirt nor a turban were used."}},{"id":34,"idInBook":34,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كُفِّنَ فِي ثَلاَثَةِ أَثْوَابٍ بِيضٍ سَحُولِيَّةٍ، لَيْسَ فِيهَا قَمِيصٌ وَلاَ عِمَامَةٌ‏.‏","english":{"narrator":"Narrated Aisha:","text":"Allah's Messenger (ﷺ) was shrouded in three pieces of cloth which were made of white Suhul and neither a \nshirt nor a turban were used."}},{"id":35,"idInBook":35,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ الْمَكِّيُّ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ سَعْدٍ، عَنْ أَبِيهِ، قَالَ أُتِيَ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ ـ رضى الله عنه ـ يَوْمًا بِطَعَامِهِ فَقَالَ قُتِلَ مُصْعَبُ بْنُ عُمَيْرٍ ـ وَكَانَ خَيْرًا مِنِّي ـ فَلَمْ يُوجَدْ لَهُ مَا يُكَفَّنُ فِيهِ إِلاَّ بُرْدَةٌ، وَقُتِلَ حَمْزَةُ أَوْ رَجُلٌ آخَرُ خَيْرٌ مِنِّي فَلَمْ يُوجَدْ لَهُ مَا يُكَفَّنُ فِيهِ إِلاَّ بُرْدَةٌ، لَقَدْ خَشِيتُ أَنْ يَكُونَ قَدْ عُجِّلَتْ لَنَا طَيِّبَاتُنَا فِي حَيَاتِنَا الدُّنْيَا، ثُمَّ جَعَلَ يَبْكِي‏.‏","english":{"narrator":"Narrated Sa`d from his father:","text":"Once the meal of `Abdur-Rahman bin `Auf was brought in front of him, and he said, \"Mus`ab bin \n`Umair was martyred and he was better than I, and he had nothing except his Burd (a black square \nnarrow dress) to be shrouded in. Hamza or another person was martyred and he was also better than I \nand he had nothing to be shrouded in except his Burd. No doubt, I fear that the rewards of my deeds \nmight have been given early in this world.\" Then he started weeping."}},{"id":36,"idInBook":36,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا شُعْبَةُ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِيهِ، إِبْرَاهِيمَ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ عَوْفٍ ـ رضى الله عنه ـ أُتِيَ بِطَعَامٍ وَكَانَ صَائِمًا فَقَالَ قُتِلَ مُصْعَبُ بْنُ عُمَيْرٍ وَهُوَ خَيْرٌ مِنِّي، كُفِّنَ فِي بُرْدَةٍ، إِنْ غُطِّيَ رَأْسُهُ بَدَتْ رِجْلاَهُ، وَإِنْ غُطِّيَ رِجْلاَهُ بَدَا رَأْسُهُ ـ وَأُرَاهُ قَالَ ـ وَقُتِلَ حَمْزَةُ وَهُوَ خَيْرٌ مِنِّي، ثُمَّ بُسِطَ لَنَا مِنَ الدُّنْيَا مَا بُسِطَ ـ أَوْ قَالَ أُعْطِينَا مِنَ الدُّنْيَا مَا أُعْطِينَا ـ وَقَدْ خَشِينَا أَنْ تَكُونَ حَسَنَاتُنَا عُجِّلَتْ لَنَا، ثُمَّ جَعَلَ يَبْكِي حَتَّى تَرَكَ الطَّعَامَ‏.‏","english":{"narrator":"Narrated Ibrahim:","text":"Once a meal was brought to `Abdur-Rahman bin `Auf and he was fasting. He said, \"Mustab bin \n`Umar was martyred and he was better than I and was shrouded in his Burd and when his head was \ncovered with it, his legs became bare, and when his legs were covered his head got uncovered. Hamza \nwas martyred and was better than I. Now the worldly wealth have been bestowed upon us (or said a \nsimilar thing). No doubt, I fear that the rewards of my deeds might have been given earlier in this \nworld.\" Then he started weeping and left his food."}},{"id":37,"idInBook":37,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنَا شَقِيقٌ، حَدَّثَنَا خَبَّابٌ ـ رضى الله عنه ـ قَالَ هَاجَرْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم نَلْتَمِسُ وَجْهَ اللَّهِ، فَوَقَعَ أَجْرُنَا عَلَى اللَّهِ، فَمِنَّا مَنْ مَاتَ لَمْ يَأْكُلْ مِنْ أَجْرِهِ شَيْئًا مِنْهُمْ مُصْعَبُ بْنُ عُمَيْرٍ، وَمِنَّا مَنْ أَيْنَعَتْ لَهُ ثَمَرَتُهُ فَهُوَ يَهْدِبُهَا‏.‏ قُتِلَ يَوْمَ أُحُدٍ، فَلَمْ نَجِدْ مَا نُكَفِّنُهُ إِلاَّ بُرْدَةً إِذَا غَطَّيْنَا بِهَا رَأْسَهُ خَرَجَتْ رِجْلاَهُ، وَإِذَا غَطَّيْنَا رِجْلَيْهِ خَرَجَ رَأْسُهُ، فَأَمَرَنَا النَّبِيُّ صلى الله عليه وسلم أَنْ نُغَطِّيَ رَأْسَهُ، وَأَنْ نَجْعَلَ عَلَى رِجْلَيْهِ مِنَ الإِذْخِرِ‏.‏","english":{"narrator":"Narrated Khabbab:","text":"We emigrated with the Prophet (p.b.u.h) in Allah's cause, and so our reward was then surely \nincumbent on Allah. Some of us died and they did not take anything from their rewards in this world, \nand amongst them was Mustab bin `Umar; and the others were those who got their rewards. Mustab \nbin `Umar was martyred on the day of the Battle of Uhud and we could get nothing except his Burd to \nshroud him in. And when we covered his head his feet became bare and vice versa. So the Prophet (ﷺ) \nordered us to cover his head only and to put idhkhir (a kind of shrub) over his feet."}},{"id":38,"idInBook":38,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، حَدَّثَنَا ابْنُ أَبِي حَازِمٍ، عَنْ أَبِيهِ، عَنْ سَهْلٍ ـ رضى الله عنه ـ أَنَّ امْرَأَةً، جَاءَتِ النَّبِيَّ صلى الله عليه وسلم بِبُرْدَةٍ مَنْسُوجَةٍ فِيهَا حَاشِيَتُهَا ـ أَتَدْرُونَ مَا الْبُرْدَةُ قَالُوا الشَّمْلَةُ‏.‏ قَالَ نَعَمْ‏.‏ قَالَتْ نَسَجْتُهَا بِيَدِي، فَجِئْتُ لأَكْسُوَكَهَا‏.‏ فَأَخَذَهَا النَّبِيُّ صلى الله عليه وسلم مُحْتَاجًا إِلَيْهَا، فَخَرَجَ إِلَيْنَا وَإِنَّهَا إِزَارُهُ، فَحَسَّنَهَا فُلاَنٌ فَقَالَ اكْسُنِيهَا، مَا أَحْسَنَهَا‏.‏ قَالَ الْقَوْمُ مَا أَحْسَنْتَ، لَبِسَهَا النَّبِيُّ صلى الله عليه وسلم مُحْتَاجًا إِلَيْهَا، ثُمَّ سَأَلْتَهُ وَعَلِمْتَ أَنَّهُ لاَ يَرُدُّ‏.‏ قَالَ إِنِّي وَاللَّهِ مَا سَأَلْتُهُ لأَلْبَسَهَا إِنَّمَا سَأَلْتُهُ لِتَكُونَ كَفَنِي‏.‏ قَالَ سَهْلٌ فَكَانَتْ كَفَنَهُ‏.‏","english":{"narrator":"Narrated Sahl:","text":"A woman brought a woven Burda (sheet) having edging (border) to the Prophet, Then Sahl asked \nthem whether they knew what is Burda, they said that Burda is a cloak and Sahl confirmed their reply. \nThen the woman said, \"I have woven it with my own hands and I have brought it so that you may \nwear it.\" The Prophet (ﷺ) accepted it, and at that time he was in need of it. So he came out wearing it as \nhis waist-sheet. A man praised it and said, \"Will you give it to me? How nice it is!\" The other people \nsaid, \"You have not done the right thing as the Prophet (ﷺ) is in need of it and you have asked for it when \nyou know that he never turns down anybody's request.\" The man replied, \"By Allah, I have not asked \nfor it to wear it but to make it my shroud.\" Later it was his shroud."}},{"id":39,"idInBook":39,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا قَبِيصَةُ بْنُ عُقْبَةَ، حَدَّثَنَا سُفْيَانُ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ أُمِّ الْهُذَيْلِ، عَنْ أُمِّ عَطِيَّةَ ـ رضى الله عنها ـ قَالَتْ نُهِينَا عَنِ اتِّبَاعِ الْجَنَائِزِ، وَلَمْ يُعْزَمْ عَلَيْنَا‏.‏","english":{"narrator":"Narrated Um 'Atiyya:","text":"We were forbidden to accompany funeral processions but not strictly."}},{"id":40,"idInBook":40,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، حَدَّثَنَا سَلَمَةُ بْنُ عَلْقَمَةَ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، قَالَ تُوُفِّيَ ابْنٌ لأُمِّ عَطِيَّةَ ـ رضى الله عنها ـ فَلَمَّا كَانَ الْيَوْمُ الثَّالِثُ دَعَتْ بِصُفْرَةٍ، فَتَمَسَّحَتْ بِهِ وَقَالَتْ نُهِينَا أَنْ نُحِدَّ أَكْثَرَ مِنْ ثَلاَثٍ إِلاَّ بِزَوْجٍ‏.‏","english":{"narrator":"Narrated Muhammad bin Seereen:","text":"One of the sons of Um 'Atiyya died, and when it was the third day she asked for a yellow perfume and \nput it over her body, and said, \"We were forbidden to mourn for more than three days except for our \nhusbands.\""}},{"id":41,"idInBook":41,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا أَيُّوبُ بْنُ مُوسَى، قَالَ أَخْبَرَنِي حُمَيْدُ بْنُ نَافِعٍ، عَنْ زَيْنَبَ ابْنَةِ أَبِي سَلَمَةَ، قَالَتْ لَمَّا جَاءَ نَعْىُ أَبِي سُفْيَانَ مِنَ الشَّأْمِ دَعَتْ أُمُّ حَبِيبَةَ ـ رضى الله عنها ـ بِصُفْرَةٍ فِي الْيَوْمِ الثَّالِثِ، فَمَسَحَتْ عَارِضَيْهَا وَذِرَاعَيْهَا وَقَالَتْ إِنِّي كُنْتُ عَنْ هَذَا لَغَنِيَّةً، لَوْلاَ أَنِّي سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ لاَ يَحِلُّ لاِمْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ أَنْ تُحِدَّ عَلَى مَيِّتٍ فَوْقَ ثَلاَثٍ، إِلاَّ عَلَى زَوْجٍ، فَإِنَّهَا تُحِدُّ عَلَيْهِ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا ‏\"‏‏.‏","english":{"narrator":"Narrated Zainab bint Abi Salama:","text":"When the news of the death of Abu Sufyan reached from Sham, Um Habiba on the third day, asked \nfor a yellow perfume and scented her cheeks and forearms and said, \"No doubt, I would not have been \nin need of this, had I not heard the Prophet (ﷺ) saying: \"It is not legal for a woman who believes in Allah \nand the Last Day to mourn for more than three days for any dead person except her husband, for \nwhom she should mourn for four months and ten days.\""}},{"id":42,"idInBook":42,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، عَنْ حُمَيْدِ بْنِ نَافِعٍ، عَنْ زَيْنَبَ بِنْتِ أَبِي سَلَمَةَ، أَخْبَرَتْهُ قَالَتْ، دَخَلْتُ عَلَى أُمِّ حَبِيبَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم فَقَالَتْ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ لاَ يَحِلُّ لاِمْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ تُحِدُّ عَلَى مَيِّتٍ فَوْقَ ثَلاَثٍ، إِلاَّ عَلَى زَوْجٍ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا ‏\"‏‏.‏   ثُمَّ دَخَلْتُ عَلَى زَيْنَبَ بِنْتِ جَحْشٍ حِينَ تُوُفِّيَ أَخُوهَا، فَدَعَتْ بِطِيبٍ فَمَسَّتْ ثُمَّ قَالَتْ مَا لِي بِالطِّيبِ مِنْ حَاجَةٍ، غَيْرَ أَنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَلَى الْمِنْبَرِ يَقُولُ ‏\"‏ لاَ يَحِلُّ لاِمْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ تُحِدُّ عَلَى مَيِّتٍ فَوْقَ ثَلاَثٍ، إِلاَّ عَلَى زَوْجٍ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا ‏\"‏‏.‏","english":{"narrator":"Narrated Zainab bint Abi Salama:","text":"I went to Um Habiba, the wife of Prophet, who said, \"I heard the Prophets saying, 'It is not legal for a \nwoman who believes in Allah and the Last Day to mourn for any dead person for more than three days \nexcept for her husband, (for whom she should mourn) for four months and ten days'.\" Later I went to \nZainab bint Jahsh when her brother died; she asked for some scent, and after using it she said, \"I am \nnot in need of scent but I heard Allah's Messenger (ﷺ) saying, 'It is not legal for a woman who believes in \nAllah and the Last Day to mourn for more than three days for any dead person except her husband, \n(for whom she should mourn) for four months and ten days.' \""}},{"id":43,"idInBook":43,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ مَرَّ النَّبِيُّ صلى الله عليه وسلم بِامْرَأَةٍ تَبْكِي عِنْدَ قَبْرٍ فَقَالَ ‏\"‏ اتَّقِي اللَّهَ وَاصْبِرِي ‏\"‏‏.‏ قَالَتْ إِلَيْكَ عَنِّي، فَإِنَّكَ لَمْ تُصَبْ بِمُصِيبَتِي، وَلَمْ تَعْرِفْهُ‏.‏ فَقِيلَ لَهَا إِنَّهُ النَّبِيُّ صلى الله عليه وسلم‏.‏ فَأَتَتْ باب النَّبِيِّ صلى الله عليه وسلم فَلَمْ تَجِدْ عِنْدَهُ بَوَّابِينَ فَقَالَتْ لَمْ أَعْرِفْكَ‏.‏ فَقَالَ ‏\"‏ إِنَّمَا الصَّبْرُ عِنْدَ الصَّدْمَةِ الأُولَى ‏\"‏‏.‏","english":{"narrator":"Narrated Anas bin Malik:","text":"The Prophet (ﷺ) passed by a woman who was weeping beside a grave. He told her to fear Allah and be \npatient. She said to him, \"Go away, for you have not been afflicted with a calamity like mine.\" And \nshe did not recognize him. Then she was informed that he was the Prophet (ﷺ) . so she went to the house \nof the Prophet (ﷺ) and there she did not find any guard. Then she said to him, \"I did not recognize you.\" \nHe said, \"Verily, the patience is at the first stroke of a calamity.\""}},{"id":44,"idInBook":44,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا عَبْدَانُ، وَمُحَمَّدٌ، قَالاَ أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا عَاصِمُ بْنُ سُلَيْمَانَ، عَنْ أَبِي عُثْمَانَ، قَالَ حَدَّثَنِي أُسَامَةُ بْنُ زَيْدٍ ـ رضى الله عنهما ـ قَالَ أَرْسَلَتِ ابْنَةُ النَّبِيِّ صلى الله عليه وسلم إِلَيْهِ إِنَّ ابْنًا لِي قُبِضَ فَائْتِنَا‏.‏ فَأَرْسَلَ يُقْرِئُ السَّلاَمَ وَيَقُولُ ‏\"‏ إِنَّ لِلَّهِ مَا أَخَذَ وَلَهُ مَا أَعْطَى وَكُلٌّ عِنْدَهُ بِأَجَلٍ مُسَمًّى، فَلْتَصْبِرْ وَلْتَحْتَسِبْ ‏\"‏‏.‏ فَأَرْسَلَتْ إِلَيْهِ تُقْسِمُ عَلَيْهِ لَيَأْتِيَنَّهَا، فَقَامَ وَمَعَهُ سَعْدُ بْنُ عُبَادَةَ وَمُعَاذُ بْنُ جَبَلٍ وَأُبَىُّ بْنُ كَعْبٍ وَزَيْدُ بْنُ ثَابِتٍ وَرِجَالٌ، فَرُفِعَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم الصَّبِيُّ وَنَفْسُهُ تَتَقَعْقَعُ ـ قَالَ حَسِبْتُهُ أَنَّهُ قَالَ ـ كَأَنَّهَا شَنٌّ‏.‏ فَفَاضَتْ عَيْنَاهُ‏.‏ فَقَالَ سَعْدٌ يَا رَسُولَ اللَّهِ مَا هَذَا فَقَالَ ‏\"‏ هَذِهِ رَحْمَةٌ جَعَلَهَا اللَّهُ فِي قُلُوبِ عِبَادِهِ، وَإِنَّمَا يَرْحَمُ اللَّهُ مِنْ عِبَادِهِ الرُّحَمَاءَ ‏\"‏‏.‏","english":{"narrator":"Narrated Usama bin Zaid:","text":"The daughter of the Prophet (p.b.u.h) sent (a messenger) to the Prophet (ﷺ) requesting him to come as her \nchild was dying (or was gasping), but the Prophet (ﷺ) returned the messenger and told him to convey his \ngreeting to her and say: \"Whatever Allah takes is for Him and whatever He gives, is for Him, and \neverything with Him has a limited fixed term (in this world) and so she should be patient and hope for \nAllah's reward.\" She again sent for him, swearing that he should come. The Prophet (ﷺ) got up, and so did \nSa`d bin 'Ubada, Mu`adh bin Jabal, Ubai bin Ka`b, Zaid bin Thabit and some other men. The child \nwas brought to Allah's Messenger (ﷺ) while his breath was disturbed in his chest (the sub-narrator thinks that \nUsama added: ) as if it was a leather water-skin. On that the eyes of the Prophet (p.b.u.h) started \nshedding tears. Sa`d said, \"O Allah's Messenger (ﷺ)! What is this?\" He replied, \"It is mercy which Allah has \nlodged in the hearts of His slaves, and Allah is merciful only to those of His slaves who are merciful \n(to others)."}},{"id":45,"idInBook":45,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا أَبُو عَامِرٍ، حَدَّثَنَا فُلَيْحُ بْنُ سُلَيْمَانَ، عَنْ هِلاَلِ بْنِ عَلِيٍّ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ شَهِدْنَا بِنْتًا لِرَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ وَرَسُولُ اللَّهِ صلى الله عليه وسلم جَالِسٌ عَلَى الْقَبْرِ ـ قَالَ فَرَأَيْتُ عَيْنَيْهِ تَدْمَعَانِ قَالَ ـ فَقَالَ ‏\"‏ هَلْ مِنْكُمْ رَجُلٌ لَمْ يُقَارِفِ اللَّيْلَةَ ‏\"‏‏.‏ فَقَالَ أَبُو طَلْحَةَ أَنَا‏.‏ قَالَ ‏\"‏ فَانْزِلْ ‏\"‏‏.‏ قَالَ فَنَزَلَ فِي قَبْرِهَا‏.‏","english":{"narrator":"Narrated Anas bin Malik:","text":"We were (in the funeral procession) of one of the daughters of the Prophet (ﷺ) and he was sitting by the \nside of the grave. I saw his eyes shedding tears. He said, \"Is there anyone among you who did not \nhave sexual relations with his wife last night?\" Abu Talha replied in the affirmative. And so the \nProphet told him to get down in the grave. And so he got down in her grave."}},{"id":46,"idInBook":46,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا عَبْدَانُ، حَدَّثَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ عُبَيْدِ اللَّهِ بْنِ أَبِي مُلَيْكَةَ، قَالَ تُوُفِّيَتِ ابْنَةٌ لِعُثْمَانَ ـ رضى الله عنه ـ بِمَكَّةَ وَجِئْنَا لِنَشْهَدَهَا، وَحَضَرَهَا ابْنُ عُمَرَ وَابْنُ عَبَّاسٍ ـ رضى الله عنهم ـ وَإِنِّي لَجَالِسٌ بَيْنَهُمَا ـ أَوْ قَالَ جَلَسْتُ إِلَى أَحَدِهِمَا‏.‏ ثُمَّ جَاءَ الآخَرُ، فَجَلَسَ إِلَى جَنْبِي فَقَالَ عَبْدُ اللَّهِ بْنُ عَمَرَ ـ رضى الله عنهما ـ لِعَمْرِو بْنِ عُثْمَانَ أَلاَ تَنْهَى عَنِ الْبُكَاءِ، فَإِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ الْمَيِّتَ لَيُعَذَّبُ بِبُكَاءِ أَهْلِهِ عَلَيْهِ ‏\"‏‏.‏   فَقَالَ ابْنُ عَبَّاسٍ ـ رضى الله عنهما ـ قَدْ كَانَ عُمَرُ ـ رضى الله عنه ـ يَقُولُ بَعْضَ ذَلِكَ، ثُمَّ حَدَّثَ قَالَ صَدَرْتُ مَعَ عُمَرَ ـ رضى الله عنه ـ مِنْ مَكَّةَ حَتَّى إِذَا كُنَّا بِالْبَيْدَاءِ، إِذَا هُوَ بِرَكْبٍ تَحْتَ ظِلِّ سَمُرَةٍ فَقَالَ اذْهَبْ، فَانْظُرْ مَنْ هَؤُلاَءِ الرَّكْبُ قَالَ فَنَظَرْتُ فَإِذَا صُهَيْبٌ، فَأَخْبَرْتُهُ فَقَالَ ادْعُهُ لِي‏.‏ فَرَجَعْتُ إِلَى صُهَيْبٍ فَقُلْتُ ارْتَحِلْ فَالْحَقْ أَمِيرَ الْمُؤْمِنِينَ‏.‏ فَلَمَّا أُصِيبَ عُمَرُ دَخَلَ صُهَيْبٌ يَبْكِي يَقُولُ وَاأَخَاهُ، وَاصَاحِبَاهُ‏.‏ فَقَالَ عُمَرُ ـ رضى الله عنه ـ يَا صُهَيْبُ أَتَبْكِي عَلَىَّ وَقَدْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ الْمَيِّتَ يُعَذَّبُ بِبَعْضِ بُكَاءِ أَهْلِهِ عَلَيْهِ ‏\"‏‏.‏   قَالَ ابْنُ عَبَّاسٍ ـ رضى الله عنهما فَلَمَّا مَاتَ عُمَرُ ـ رضى الله عنه ـ ذَكَرْتُ ذَلِكَ لِعَائِشَةَ ـ رضى الله عنها ـ فَقَالَتْ رَحِمَ اللَّهُ عُمَرَ، وَاللَّهِ مَا حَدَّثَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِنَّ اللَّهَ لَيُعَذِّبُ الْمُؤْمِنَ بِبُكَاءِ أَهْلِهِ عَلَيْهِ‏.‏ وَلَكِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ اللَّهَ لَيَزِيدُ الْكَافِرَ عَذَابًا بِبُكَاءِ أَهْلِهِ عَلَيْهِ ‏\"‏‏.‏ وَقَالَتْ حَسْبُكُمُ الْقُرْآنُ ‏{‏وَلاَ تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَى‏}‏‏.‏ قَالَ ابْنُ عَبَّاسٍ ـ رضى الله عنهما ـ عِنْدَ ذَلِكَ وَاللَّهُ هُوَ أَضْحَكَ وَأَبْكَى‏.‏ قَالَ ابْنُ أَبِي مُلَيْكَةَ وَاللَّهِ مَا قَالَ ابْنُ عُمَرَ ـ رضى الله عنهما ـ شَيْئًا‏.‏","english":{"narrator":"Narrated `Abdullah bin 'Ubaidullah bin Abi Mulaika:","text":"One of the daughters of `Uthman died at Mecca. We went to attend her funeral procession. Ibn `Umar \nand Ibn `Abbas were also present. I sat in between them (or said, I sat beside one of them. Then a man \ncame and sat beside me.) `Abdullah bin `Umar said to `Amr bin `Uthman, \"Will you not prohibit \ncrying as Allah's Messenger (ﷺ) has said, 'The dead person is tortured by the crying of his relatives.?\" Ibn \n`Abbas said, \"`Umar used to say so.\" Then he added narrating, \"I accompanied `Umar on a journey \nfrom Mecca till we reached Al-Baida. There he saw some travelers in the shade of a Samura (A kind \nof forest tree). He said (to me), \"Go and see who those travelers are.\" So I went and saw that one of \nthem was Suhaib. I told this to `Umar who then asked me to call him. So I went back to Suhaib and \nsaid to him, \"Depart and follow the chief of the faithful believers.\" Later, when `Umar was stabbed, \nSuhaib came in weeping and saying, \"O my brother, O my friend!\" (on this `Umar said to him, \"O \nSuhaib! Are you weeping for me while the Prophet (ﷺ) said, \"The dead person is punished by some of the \nweeping of his relatives?\" Ibn `Abbas added, \"When `Umar died I told all this to Aisha and she said, \n'May Allah be merciful to `Umar. By Allah, Allah's Messenger (ﷺ) did not say that a believer is punished by \nthe weeping of his relatives. But he said, Allah increases the punishment of a non-believer because of \nthe weeping of his relatives.\" Aisha further added, \"The Qur'an is sufficient for you (to clear up this \npoint) as Allah has stated: 'No burdened soul will bear another's burden.' \" (35.18). Ibn `Abbas then \nsaid, \"Only Allah makes one laugh or cry.\" Ibn `Umar did not say anything after that."}},{"id":47,"idInBook":47,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، عَنْ أَبِيهِ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، أَنَّهَا أَخْبَرَتْهُ أَنَّهَا، سَمِعَتْ عَائِشَةَ ـ رضى الله عنها ـ زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَالَتْ إِنَّمَا مَرَّ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى يَهُودِيَّةٍ يَبْكِي عَلَيْهَا أَهْلُهَا فَقَالَ ‏\n\"‏ إِنَّهُمْ لَيَبْكُونَ عَلَيْهَا، وَإِنَّهَا لَتُعَذَّبُ فِي قَبْرِهَا ‏\"‏‏.‏","english":{"narrator":"Narrated `Aisha:","text":"(the wife of the Prophet) Once Allah's Messenger (ﷺ) passed by (the grave of) a Jewess whose relatives were \nweeping over her. He said, \"They are weeping over her and she is being tortured in her grave.\""}},{"id":48,"idInBook":48,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ بْنُ خَلِيلٍ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، حَدَّثَنَا أَبُو إِسْحَاقَ ـ وَهْوَ الشَّيْبَانِيُّ ـ عَنْ أَبِي بُرْدَةَ، عَنْ أَبِيهِ، قَالَ لَمَّا أُصِيبَ عُمَرُ ـ رضى الله عنه ـ جَعَلَ صُهَيْبٌ يَقُولُ وَاأَخَاهُ‏.‏ فَقَالَ عُمَرُ أَمَا عَلِمْتَ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ الْمَيِّتَ لَيُعَذَّبُ بِبُكَاءِ الْحَىِّ ‏\"‏‏.‏","english":{"narrator":"Narrated Abu Burda:","text":"That his father said, \"When `Umar was stabbed, Suhaib started crying: O my brother! `Umar said, \n'Don't you know that the Prophet (ﷺ) said: The deceased is tortured for the weeping of the living'?\""}},{"id":49,"idInBook":49,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سَعِيدُ بْنُ عُبَيْدٍ، عَنْ عَلِيِّ بْنِ رَبِيعَةَ، عَنِ الْمُغِيرَةِ ـ رضى الله عنه ـ قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\"‏ إِنَّ كَذِبًا عَلَىَّ لَيْسَ كَكَذِبٍ عَلَى أَحَدٍ، مَنْ كَذَبَ عَلَىَّ مُتَعَمِّدًا فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنَ النَّارِ ‏\"‏‏.‏ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\"‏ مَنْ نِيحَ عَلَيْهِ يُعَذَّبُ بِمَا نِيحَ عَلَيْهِ ‏\"‏‏.‏","english":{"narrator":"Narrated Al-Mughira:","text":"I heard the Prophet (ﷺ) saying, \"Ascribing false things to me is not like ascribing false things to anyone \nelse. Whosoever tells a lie against me intentionally then surely let him occupy his seat in Hell-Fire.\" I \nheard the Prophet (ﷺ) saying, \"The deceased who is wailed over is tortured for that wailing.\""}},{"id":50,"idInBook":50,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا عَبْدَانُ، قَالَ أَخْبَرَنِي أَبِي، عَنْ شُعْبَةَ، عَنْ قَتَادَةَ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنِ ابْنِ عُمَرَ، عَنْ أَبِيهِ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ الْمَيِّتُ يُعَذَّبُ فِي قَبْرِهِ بِمَا نِيحَ عَلَيْهِ ‏\"‏‏.‏ تَابَعَهُ عَبْدُ الأَعْلَى حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا سَعِيدٌ حَدَّثَنَا قَتَادَةُ‏.‏ وَقَالَ آدَمُ عَنْ شُعْبَةَ ‏\"‏ الْمَيِّتُ يُعَذَّبُ بِبُكَاءِ الْحَىِّ عَلَيْهِ ‏\"‏‏.‏","english":{"narrator":"Narrated Ibn 'Umar from his father:","text":"The Prophet (ﷺ) said, \"The deceased is tortured in his grave for the \n     wailing done over him.\" \n\n\n\n\n\n\n     Narrated Shu'ba:\n\n\n     The deceased is tortured for the wailing of the living ones over him ."}},{"id":51,"idInBook":51,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا ابْنُ الْمُنْكَدِرِ، قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ جِيءَ بِأَبِي يَوْمَ أُحُدٍ، قَدْ مُثِّلَ بِهِ حَتَّى وُضِعَ بَيْنَ يَدَىْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَقَدْ سُجِّيَ ثَوْبًا فَذَهَبْتُ أُرِيدُ أَنْ أَكْشِفَ عَنْهُ فَنَهَانِي قَوْمِي، ثُمَّ ذَهَبْتُ أَكْشِفُ عَنْهُ فَنَهَانِي قَوْمِي، فَأَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَرُفِعَ فَسَمِعَ صَوْتَ صَائِحَةٍ فَقَالَ ‏\"‏ مَنْ هَذِهِ ‏\"‏‏.‏ فَقَالُوا ابْنَةُ عَمْرٍو أَوْ أُخْتُ عَمْرٍو‏.‏ قَالَ ‏\"‏ فَلِمَ تَبْكِي أَوْ لاَ تَبْكِي فَمَا زَالَتِ الْمَلاَئِكَةُ تُظِلُّهُ بِأَجْنِحَتِهَا حَتَّى رُفِعَ ‏\"‏‏.‏","english":{"narrator":"Narrated Jabir bin `Abdullah:","text":"On the day of the Battle of Uhud, my father was brought and he had been mutilated (in battle) and was placed \nin front of Allah's Messenger (ﷺ) and a sheet was over him. I went intending to uncover my father but my \npeople forbade me; again I wanted to uncover him but my people forbade me. Allah's Messenger (ﷺ) gave \nhis order and he was shifted away. At that time he heard the voice of a crying woman and asked, \n\"Who is this?\" They said, \"It is the daughter or the sister of `Amr.\" He said, \"Why does she weep? (or \nlet her stop weeping), for the angels had been shading him with their wings till he (i.e. the body of the \nmartyr) was shifted away.\""}},{"id":52,"idInBook":52,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا زُبَيْدٌ الْيَامِيُّ، عَنْ إِبْرَاهِيمَ، عَنْ مَسْرُوقٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ لَيْسَ مِنَّا مَنْ لَطَمَ الْخُدُودَ، وَشَقَّ الْجُيُوبَ، وَدَعَا بِدَعْوَى الْجَاهِلِيَّةِ ‏\"‏‏.‏","english":{"narrator":"Narrated `Abdullah:","text":"the Prophet (ﷺ) said, \"He who slaps his cheeks, tears his clothes and follows the ways and traditions of the \nDays of Ignorance is not one of us.\""}},{"id":53,"idInBook":53,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عَامِرِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ، عَنْ أَبِيهِ ـ رضى الله عنه ـ قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَعُودُنِي عَامَ حَجَّةِ الْوَدَاعِ مِنْ وَجَعٍ اشْتَدَّ بِي فَقُلْتُ إِنِّي قَدْ بَلَغَ بِي مِنَ الْوَجَعِ وَأَنَا ذُو مَالٍ، وَلاَ يَرِثُنِي إِلاَّ ابْنَةٌ، أَفَأَتَصَدَّقُ بِثُلُثَىْ مَالِي قَالَ ‏\"‏ لاَ ‏\"‏‏.‏ فَقُلْتُ بِالشَّطْرِ فَقَالَ ‏\"‏ لاَ ‏\"‏ ثُمَّ قَالَ ‏\"‏ الثُّلُثُ وَالثُّلْثُ كَبِيرٌ ـ أَوْ كَثِيرٌ ـ إِنَّكَ أَنْ تَذَرَ وَرَثَتَكَ أَغْنِيَاءَ خَيْرٌ مِنْ أَنْ تَذَرَهُمْ عَالَةً يَتَكَفَّفُونَ النَّاسَ، وَإِنَّكَ لَنْ تُنْفِقَ نَفَقَةً تَبْتَغِي بِهَا وَجْهَ اللَّهِ إِلاَّ أُجِرْتَ بِهَا، حَتَّى مَا تَجْعَلُ فِي فِي امْرَأَتِكَ ‏\"‏‏.‏ فَقُلْتُ يَا رَسُولَ اللَّهِ، أُخَلَّفُ بَعْدَ أَصْحَابِي قَالَ ‏\"‏ إِنَّكَ لَنْ تُخَلَّفَ فَتَعْمَلَ عَمَلاً صَالِحًا إِلاَّ ازْدَدْتَ بِهِ دَرَجَةً وَرِفْعَةً، ثُمَّ لَعَلَّكَ أَنْ تُخَلَّفَ حَتَّى يَنْتَفِعَ بِكَ أَقْوَامٌ وَيُضَرَّ بِكَ آخَرُونَ، اللَّهُمَّ أَمْضِ لأَصْحَابِي هِجْرَتَهُمْ، وَلاَ تَرُدَّهُمْ عَلَى أَعْقَابِهِمْ، لَكِنِ الْبَائِسُ سَعْدُ ابْنُ خَوْلَةَ، يَرْثِي لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ مَاتَ بِمَكَّةَ ‏\"‏‏.‏","english":{"narrator":"Narrated 'Amir bin Sa`d bin Abi Waqqas:","text":"That his father said, \"In the year of the last Hajj of the Prophet (ﷺ) I became seriously ill and the Prophet (ﷺ) \nused to visit me inquiring about my health. I told him, 'I am reduced to this state because of illness and \nI am wealthy and have no inheritors except a daughter, (In this narration the name of 'Amir bin Sa`d is \nmentioned and in fact it is a mistake; the narrator is `Aisha bint Sa`d bin Abi Waqqas). Should I give \ntwo-thirds of my property in charity?' He said, 'No.' I asked, 'Half?' He said, 'No.' then he added, 'Onethird, \nand even one-third is much. You'd better leave your inheritors wealthy rather than leaving them \npoor, begging others. You will get a reward for whatever you spend for Allah's sake, even for what \nyou put in your wife's mouth.' I said, 'O Allah's Messenger (ﷺ)! Will I be left alone after my companions \nhave gone?' He said, 'If you are left behind, whatever good deeds you will do will upgrade you and \nraise you high. And perhaps you will have a long life so that some people will be benefited by you \nwhile others will be harmed by you. O Allah! Complete the emigration of my companions and do not \nturn them renegades.' But Allah's Messenger (ﷺ) felt sorry for poor Sa`d bin Khaula as he died in Mecca.\" \n(but Sa`d bin Abi Waqqas lived long after the Prophet (p.b.u.h).)"}},{"id":54,"idInBook":54,"chapterId":23,"bookId":1,"arabic":"وَقَالَ الْحَكَمُ بْنُ مُوسَى حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ جَابِرٍ، أَنَّ الْقَاسِمَ بْنَ مُخَيْمِرَةَ، حَدَّثَهُ قَالَ حَدَّثَنِي أَبُو بُرْدَةَ بْنُ أَبِي مُوسَى ـ رضى الله عنه ـ قَالَ وَجِعَ أَبُو مُوسَى وَجَعًا فَغُشِيَ عَلَيْهِ، وَرَأْسُهُ فِي حَجْرِ امْرَأَةٍ مِنْ أَهْلِهِ، فَلَمْ يَسْتَطِعْ أَنْ يَرُدَّ عَلَيْهَا شَيْئًا، فَلَمَّا أَفَاقَ قَالَ أَنَا بَرِيءٌ مِمَّنْ بَرِئَ مِنْهُ رَسُولُ اللَّهِ صلى الله عليه وسلم، إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم بَرِئَ مِنَ الصَّالِقَةِ وَالْحَالِقَةِ وَالشَّاقَّةِ‏.‏","english":{"narrator":"Narrated Abu Burda bin Abi Musa:","text":"Abu Musa got seriously ill, fainted and could not reply to his wife while he was lying with his head in her lap. When he came to his senses, he said, \"I am innocent of those, of whom Allah's Messenger (ﷺ) was innocent. Allah's Messenger (ﷺ) is innocent of a woman who cries aloud (or slaps her face) who shaves her head and who tear off her clothes (on the falling of a calamity)"}},{"id":55,"idInBook":55,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ، عَنْ مَسْرُوقٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لَيْسَ مِنَّا مَنْ ضَرَبَ الْخُدُودَ، وَشَقَّ الْجُيُوبَ، وَدَعَا بِدَعْوَى الْجَاهِلِيَّةِ ‏\"‏‏.‏","english":{"narrator":"Narrated `Abdullah:","text":"The Prophet (ﷺ) said, \"He who slaps the cheeks, tears the clothes and follows the tradition of the Days of \nIgnorance is not from us.\""}},{"id":56,"idInBook":56,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ، عَنْ مَسْرُوقٍ، عَنْ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ لَيْسَ مِنَّا مَنْ ضَرَبَ الْخُدُودَ، وَشَقَّ الْجُيُوبَ، وَدَعَا بِدَعْوَى الْجَاهِلِيَّةِ ‏\"‏‏.‏","english":{"narrator":"Narrated `Abdullah:","text":"The Prophet (ﷺ) said, \"He who slaps the cheeks, tears the clothes and follows the traditions of the Days of \nIgnorance is not from us.\""}},{"id":57,"idInBook":57,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ، قَالَ سَمِعْتُ يَحْيَى، قَالَ أَخْبَرَتْنِي عَمْرَةُ، قَالَتْ سَمِعْتُ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ لَمَّا جَاءَ النَّبِيَّ صلى الله عليه وسلم قَتْلُ ابْنِ حَارِثَةَ وَجَعْفَرٍ وَابْنِ رَوَاحَةَ جَلَسَ يُعْرَفُ فِيهِ الْحُزْنُ، وَأَنَا أَنْظُرُ مِنْ صَائِرِ الْبَابِ ـ شَقِّ الْبَابِ ـ فَأَتَاهُ رَجُلٌ، فَقَالَ إِنَّ نِسَاءَ جَعْفَرٍ، وَذَكَرَ بُكَاءَهُنَّ، فَأَمَرَهُ أَنْ يَنْهَاهُنَّ، فَذَهَبَ ثُمَّ أَتَاهُ الثَّانِيَةَ، لَمْ يُطِعْنَهُ فَقَالَ انْهَهُنَّ‏.‏ فَأَتَاهُ الثَّالِثَةَ قَالَ وَاللَّهِ غَلَبْنَنَا يَا رَسُولَ اللَّهِ فَزَعَمَتْ أَنَّهُ قَالَ ‏\n\"‏ فَاحْثُ فِي أَفْوَاهِهِنَّ التُّرَابَ ‏\"‏‏.‏ فَقُلْتُ أَرْغَمَ اللَّهُ أَنْفَكَ، لَمْ تَفْعَلْ مَا أَمَرَكَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَلَمْ تَتْرُكْ رَسُولَ اللَّهِ صلى الله عليه وسلم مِنَ الْعَنَاءِ‏.‏","english":{"narrator":"Narrated `Aisha:","text":"When the Prophet (ﷺ) got the news of the death of Ibn Haritha, Ja`far and Ibn Rawaha he sat down and \nlooked sad and I was looking at him through the chink of the door. A man came and told him about \nthe crying of the women of Ja`far. The Prophet (ﷺ) ordered him to forbid them. The man went and came \nback saying that he had told them but they did not listen to him. The Prophet (p.b.u.h) said, \"Forbid \nthem.\" So again he went and came back for the third time and said, \"O Allah's Messenger (ﷺ)! By Allah, they \ndid not listen to us at all.\" (`Aisha added): Allah's Messenger (ﷺ) ordered him to go and put dust in their \nmouths. I said, (to that man) \"May Allah stick your nose in the dust (i.e. humiliate you)! You could \nneither (persuade the women to) fulfill the order of Allah's Messenger (ﷺ) nor did you relieve Allah's Messenger (ﷺ) \nfrom fatigue. \""}},{"id":58,"idInBook":58,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، حَدَّثَنَا عَاصِمٌ الأَحْوَلُ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ قَنَتَ رَسُولُ اللَّهِ صلى الله عليه وسلم شَهْرًا حِينَ قُتِلَ الْقُرَّاءُ، فَمَا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم حَزِنَ حُزْنًا قَطُّ أَشَدَّ مِنْهُ‏.‏","english":{"narrator":"Narrated Anas:","text":"When the reciters of Qur'an were martyred, Allah's Messenger (ﷺ) recited Qunut for one month and I never \nsaw him (i.e. Allah's Messenger (ﷺ)) so sad as he was on that day."}},{"id":59,"idInBook":59,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا بِشْرُ بْنُ الْحَكَمِ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، أَخْبَرَنَا إِسْحَاقُ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ ـ رضى الله عنه ـ يَقُولُ اشْتَكَى ابْنٌ لأَبِي طَلْحَةَ ـ قَالَ ـ فَمَاتَ وَأَبُو طَلْحَةَ خَارِجٌ، فَلَمَّا رَأَتِ امْرَأَتُهُ أَنَّهُ قَدْ مَاتَ هَيَّأَتْ شَيْئًا وَنَحَّتْهُ فِي جَانِبِ الْبَيْتِ، فَلَمَّا جَاءَ أَبُو طَلْحَةَ قَالَ كَيْفَ الْغُلاَمُ قَالَتْ قَدْ هَدَأَتْ نَفْسُهُ، وَأَرْجُو أَنْ يَكُونَ قَدِ اسْتَرَاحَ‏.‏ وَظَنَّ أَبُو طَلْحَةَ أَنَّهَا صَادِقَةٌ، قَالَ فَبَاتَ، فَلَمَّا أَصْبَحَ اغْتَسَلَ، فَلَمَّا أَرَادَ أَنْ يَخْرُجَ، أَعْلَمَتْهُ أَنَّهُ قَدْ مَاتَ، فَصَلَّى مَعَ النَّبِيِّ صلى الله عليه وسلم ثُمَّ أَخْبَرَ النَّبِيَّ صلى الله عليه وسلم بِمَا كَانَ مِنْهُمَا، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ لَعَلَّ اللَّهَ أَنْ يُبَارِكَ لَكُمَا فِي لَيْلَتِكُمَا ‏\"‏‏.‏ قَالَ سُفْيَانُ فَقَالَ رَجُلٌ مِنَ الأَنْصَارِ فَرَأَيْتُ لَهُمَا تِسْعَةَ أَوْلاَدٍ كُلُّهُمْ قَدْ قَرَأَ الْقُرْآنَ‏.‏","english":{"narrator":"Narrated Anas bin Malik:","text":"One of the sons of Abu Talha became sick and died and Abu Talha at that time was not at home. \nWhen his wife saw that he was dead, she prepared him (washed and shrouded him) and placed him \nsomewhere in the house. When Abu Talha came, he asked, \"How is the boy?\" She said, \"The child is \nquiet and I hope he is in peace.\" Abu Talha thought that she had spoken the truth. Abu Talha passed \nthe night and in the morning took a bath and when he intended to go out, she told him that his son had \ndied, Abu Talha offered the (morning) prayer with the Prophet (ﷺ) and informed the Prophet (ﷺ) of what \nhappened to them. Allah's Messenger (ﷺ) said, \"May Allah bless you concerning your night. (That is, may \nAllah bless you with good offspring).\" Sufyan said, \"One of the Ansar said, 'They (i.e. Abu Talha and \nhis wife) had nine sons and all of them became reciters of the Qur'an (by heart).' \""}},{"id":60,"idInBook":60,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ ثَابِتٍ، قَالَ سَمِعْتُ أَنَسًا ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الصَّبْرُ عِنْدَ الصَّدْمَةِ الأُولَى ‏\"‏‏.‏","english":{"narrator":"Narrated Anas:","text":"The Prophet (ﷺ) said, \"The real patience is at the first stroke of a calamity.\""}},{"id":61,"idInBook":61,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا الْحَسَنُ بْنُ عَبْدِ الْعَزِيزِ، حَدَّثَنَا يَحْيَى بْنُ حَسَّانَ، حَدَّثَنَا قُرَيْشٌ ـ هُوَ ابْنُ حَيَّانَ ـ عَنْ ثَابِتٍ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ دَخَلْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم عَلَى أَبِي سَيْفٍ الْقَيْنِ ـ وَكَانَ ظِئْرًا لإِبْرَاهِيمَ ـ عَلَيْهِ السَّلاَمُ ـ فَأَخَذَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِبْرَاهِيمَ فَقَبَّلَهُ وَشَمَّهُ، ثُمَّ دَخَلْنَا عَلَيْهِ بَعْدَ ذَلِكَ، وَإِبْرَاهِيمُ يَجُودُ بِنَفْسِهِ، فَجَعَلَتْ عَيْنَا رَسُولِ اللَّهِ صلى الله عليه وسلم تَذْرِفَانِ‏.‏ فَقَالَ لَهُ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ ـ رضى الله عنه ـ وَأَنْتَ يَا رَسُولَ اللَّهِ فَقَالَ ‏\"‏ يَا ابْنَ عَوْفٍ إِنَّهَا رَحْمَةٌ ‏\"‏‏.‏ ثُمَّ أَتْبَعَهَا بِأُخْرَى فَقَالَ صلى الله عليه وسلم ‏\"‏ إِنَّ الْعَيْنَ تَدْمَعُ، وَالْقَلْبَ يَحْزَنُ، وَلاَ نَقُولُ إِلاَّ مَا يَرْضَى رَبُّنَا، وَإِنَّا بِفِرَاقِكَ يَا إِبْرَاهِيمُ لَمَحْزُونُونَ ‏\"‏‏.‏ رَوَاهُ مُوسَى عَنْ سُلَيْمَانَ بْنِ الْمُغِيرَةِ عَنْ ثَابِتٍ عَنْ أَنَسٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏","english":{"narrator":"Narrated Anas bin Malik:","text":"We went with Allah's Messenger (ﷺ) (p.b.u.h) to the blacksmith Abu Saif, and he was the husband of the \nwet-nurse of Ibrahim (the son of the Prophet). Allah's Messenger (ﷺ) took Ibrahim and kissed him and \nsmelled him and later we entered Abu Saif's house and at that time Ibrahim was in his last breaths, and \nthe eyes of Allah's Messenger (ﷺ) (p.b.u.h) started shedding tears. `Abdur Rahman bin `Auf said, \"O Allah's \nApostle, even you are weeping!\" He said, \"O Ibn `Auf, this is mercy.\" Then he wept more and said, \n\"The eyes are shedding tears and the heart is grieved, and we will not say except what pleases our \nLord, O Ibrahim ! Indeed we are grieved by your separation.\""}},{"id":62,"idInBook":62,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا أَصْبَغُ، عَنِ ابْنِ وَهْبٍ، قَالَ أَخْبَرَنِي عَمْرٌو، عَنْ سَعِيدِ بْنِ الْحَارِثِ الأَنْصَارِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ اشْتَكَى سَعْدُ بْنُ عُبَادَةَ شَكْوَى لَهُ فَأَتَاهُ النَّبِيُّ صلى الله عليه وسلم يَعُودُهُ مَعَ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ وَسَعْدِ بْنِ أَبِي وَقَّاصٍ وَعَبْدِ اللَّهِ بْنِ مَسْعُودٍ ـ رضى الله عنهم ـ فَلَمَّا دَخَلَ عَلَيْهِ فَوَجَدَهُ فِي غَاشِيَةِ أَهْلِهِ فَقَالَ ‏\"‏ قَدْ قَضَى ‏\"‏‏.‏ قَالُوا لاَ يَا رَسُولَ اللَّهِ‏.‏ فَبَكَى النَّبِيُّ صلى الله عليه وسلم فَلَمَّا رَأَى الْقَوْمُ بُكَاءَ النَّبِيِّ صلى الله عليه وسلم بَكَوْا فَقَالَ ‏\"‏ أَلاَ تَسْمَعُونَ إِنَّ اللَّهَ لاَ يُعَذِّبُ بِدَمْعِ الْعَيْنِ، وَلاَ بِحُزْنِ الْقَلْبِ، وَلَكِنْ يُعَذِّبُ بِهَذَا ـ وَأَشَارَ إِلَى لِسَانِهِ ـ أَوْ يَرْحَمُ وَإِنَّ الْمَيِّتَ يُعَذَّبُ بِبُكَاءِ أَهْلِهِ عَلَيْهِ ‏\"‏‏.‏ وَكَانَ عُمَرُ ـ رضى الله عنه ـ يَضْرِبُ فِيهِ بِالْعَصَا، وَيَرْمِي بِالْحِجَارَةِ وَيَحْثِي بِالتُّرَابِ‏.‏","english":{"narrator":"Narrated `Abdullah bin `Umar:","text":"Sa`d bin 'Ubada became sick and the Prophet (ﷺ) along with `Abdur Rahman bin `Auf, Sa`d bin Abi \nWaqqas and `Abdullah bin Mas`ud visited him to inquire about his health. When he came to him, he \nfound him surrounded by his household and he asked, \"Has he died?\" They said, \"No, O Allah's \nApostle.\" The Prophet (ﷺ) wept and when the people saw the weeping of Allah's Messenger (ﷺ) (p.b.u.h) they all \nwept. He said, \"Will you listen? Allah does not punish for shedding tears, nor for the grief of the heart \nbut he punishes or bestows His Mercy because of this.\" He pointed to his tongue and added, \"The \ndeceased is punished for the wailing of his relatives over him.\" `Umar used to beat with a stick and \nthrow stones and put dust over the faces (of those who used to wail over the dead)."}},{"id":63,"idInBook":63,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ حَوْشَبٍ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، قَالَ أَخْبَرَتْنِي عَمْرَةُ، قَالَتْ سَمِعْتُ عَائِشَةَ ـ رضى الله عنها ـ تَقُولُ لَمَّا جَاءَ قَتْلُ زَيْدِ بْنِ حَارِثَةَ وَجَعْفَرٍ وَعَبْدِ اللَّهِ بْنِ رَوَاحَةَ، جَلَسَ النَّبِيُّ صلى الله عليه وسلم يُعْرَفُ فِيهِ الْحُزْنُ، وَأَنَا أَطَّلِعُ مِنْ شَقِّ الْبَابِ، فَأَتَاهُ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ نِسَاءَ جَعْفَرٍ وَذَكَرَ بُكَاءَهُنَّ فَأَمَرَهُ بِأَنْ يَنْهَاهُنَّ، فَذَهَبَ الرَّجُلُ ثُمَّ أَتَى فَقَالَ قَدْ نَهَيْتُهُنَّ، وَذَكَرَ أَنَّهُنَّ لَمْ يُطِعْنَهُ، فَأَمَرَهُ الثَّانِيَةَ أَنْ يَنْهَاهُنَّ، فَذَهَبَ، ثُمَّ أَتَى، فَقَالَ وَاللَّهِ لَقَدْ غَلَبْنَنِي أَوْ غَلَبْنَنَا الشَّكُّ مِنْ مُحَمَّدِ بْنِ حَوْشَبٍ ـ فَزَعَمَتْ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\n\"‏ فَاحْثُ فِي أَفْوَاهِهِنَّ التُّرَابَ ‏\"‏‏.‏ فَقُلْتُ أَرْغَمَ اللَّهُ أَنْفَكَ، فَوَاللَّهِ مَا أَنْتَ بِفَاعِلٍ وَمَا تَرَكْتَ رَسُولَ اللَّهِ صلى الله عليه وسلم مِنَ الْعَنَاءِ‏.‏","english":{"narrator":"Narrated Aisha:","text":"When the news of the martyrdom of Zaid bin Haritha, Ja`far and `Abdullah bin Rawaha came, the \nProphet sat down looking sad, and I was looking through the chink of the door. A man came and said, \n\"O Allah's Messenger (ﷺ)! The women of Ja`far,\" and then he mentioned their crying . The Prophet (p.b.u.h) \nordered him to stop them from crying. The man went and came back and said, \"I tried to stop them but \nthey disobeyed.\" The Prophet (p.b.u.h) ordered him for the second time to forbid them. He went again \nand came back and said, \"They did not listen to me, (or \"us\": the sub-narrator Muhammad bin \nHaushab is in doubt as to which is right). \" (`Aisha added: The Prophet (ﷺ) said, \"Put dust in their \nmouths.\" I said (to that man), \"May Allah stick your nose in the dust (i.e. humiliate you).\" By Allah, \nyou could not (stop the women from crying) to fulfill the order, besides you did not relieve Allah's \nApostle from fatigue.\""}},{"id":64,"idInBook":64,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الْوَهَّابِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، حَدَّثَنَا أَيُّوبُ، عَنْ مُحَمَّدٍ، عَنْ أُمِّ عَطِيَّةَ ـ رضى الله عنها ـ قَالَتْ أَخَذَ عَلَيْنَا النَّبِيُّ صلى الله عليه وسلم عِنْدَ الْبَيْعَةِ أَنْ لاَ نَنُوحَ، فَمَا وَفَتْ مِنَّا امْرَأَةٌ غَيْرَ خَمْسِ نِسْوَةٍ أُمِّ سُلَيْمٍ وَأُمِّ الْعَلاَءِ وَابْنَةِ أَبِي سَبْرَةَ امْرَأَةِ مُعَاذٍ وَامْرَأَتَيْنِ أَوِ ابْنَةِ أَبِي سَبْرَةَ وَامْرَأَةِ مُعَاذٍ وَامْرَأَةٍ أُخْرَى‏.‏","english":{"narrator":"Narrated Um 'Atiyya:","text":"At the time of giving the pledge of allegiance to the Prophet (ﷺ) one of the conditions was that we would \nnot wail, but it was not fulfilled except by five women and they are Um Sulaim, Um Al-`Ala', the \ndaughter of Abi Sabra (the wife of Mu`adh), and two other women; or the daughter of Abi Sabra and \nthe wife of Mu`adh and another woman."}},{"id":65,"idInBook":65,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا الزُّهْرِيُّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، عَنْ عَامِرِ بْنِ رَبِيعَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا رَأَيْتُمُ الْجَنَازَةَ فَقُومُوا حَتَّى تُخَلِّفَكُمْ ‏\"‏‏.‏ قَالَ سُفْيَانُ قَالَ الزُّهْرِيُّ أَخْبَرَنِي سَالِمٌ عَنْ أَبِيهِ قَالَ أَخْبَرَنَا عَامِرُ بْنُ رَبِيعَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ زَادَ الْحُمَيْدِيُّ ‏\"‏ حَتَّى تُخَلِّفَكُمْ أَوْ تُوضَعَ ‏\"‏‏.‏","english":{"narrator":"Narrated 'Amir bin Rabi`a:","text":"The Prophet (ﷺ) said, \"Whenever you see a funeral procession, stand up till the procession goes ahead of \nyou.\" Al-Humaidi added, \"Till the coffin leaves you behind or is put down.\""}},{"id":66,"idInBook":66,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا اللَّيْثُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ عَنْ عَامِرِ بْنِ رَبِيعَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا رَأَى أَحَدُكُمْ جَنَازَةً فَإِنْ لَمْ يَكُنْ مَاشِيًا مَعَهَا فَلْيَقُمْ حَتَّى يُخَلِّفَهَا، أَوْ تُخَلِّفَهُ أَوْ تُوضَعَ مِنْ قَبْلِ أَنْ تُخَلِّفَهُ ‏\"‏‏.‏","english":{"narrator":"Narrated 'Amir bin Rabi`a:","text":"The Prophet (ﷺ) said, \"If any one of you see a funeral procession and he is not going along with it, then he \nshould stand and remain standing till he gets behind it, or it leaves him behind, or the coffin is put \ndown before it goes ahead of him . \""}},{"id":67,"idInBook":67,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِيهِ، قَالَ كُنَّا فِي جَنَازَةٍ فَأَخَذَ أَبُو هُرَيْرَةَ ـ رضى الله عنه ـ بِيَدِ مَرْوَانَ فَجَلَسَا قَبْلَ أَنْ تُوضَعَ، فَجَاءَ أَبُو سَعِيدٍ ـ رضى الله عنه ـ فَأَخَذَ بِيَدِ مَرْوَانَ فَقَالَ قُمْ فَوَاللَّهِ لَقَدْ عَلِمَ هَذَا أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَانَا عَنْ ذَلِكَ‏.‏ فَقَالَ أَبُو هُرَيْرَةَ صَدَقَ‏.‏","english":{"narrator":"Narrated Sa`id Al-Maqburi:","text":"That his father said, \"While we were accompanying a funeral procession, Abu Huraira got hold of the \nhand of Marwan and they sat down before the coffin was put down. Then Abu Sa`id came and took \nhold of Marwan's hand and said, \"Get up. By Allah, no doubt this (i.e. Abu Huraira) knows that the \nProphet forbade us to do that.\" Abu Huraira said, \"He (Abu Sa`id) has spoken the truth.\""}},{"id":68,"idInBook":68,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا مُسْلِمٌ ـ يَعْنِي ابْنَ إِبْرَاهِيمَ ـ حَدَّثَنَا هِشَامٌ، حَدَّثَنَا يَحْيَى، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا رَأَيْتُمُ الْجَنَازَةَ فَقُومُوا، فَمَنْ تَبِعَهَا فَلاَ يَقْعُدْ حَتَّى تُوضَعَ ‏\"‏‏.‏","english":{"narrator":"Narrated Abu Sa`id Al-Khudri:","text":"The Prophet (ﷺ) said, \"When you see a funeral procession, you should stand up, and whoever \naccompanies it should not sit till the coffin is put down.\""}},{"id":69,"idInBook":69,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا مُعَاذُ بْنُ فَضَالَةَ، حَدَّثَنَا هِشَامٌ، عَنْ يَحْيَى، عَنْ عُبَيْدِ اللَّهِ بْنِ مِقْسَمٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ مَرَّ بِنَا جَنَازَةٌ فَقَامَ لَهَا النَّبِيُّ صلى الله عليه وسلم وَقُمْنَا بِهِ‏.‏ فَقُلْنَا يَا رَسُولَ اللَّهِ، إِنَّهَا جَنَازَةُ يَهُودِيٍّ‏.‏ قَالَ ‏\n\"‏ إِذَا رَأَيْتُمُ الْجَنَازَةَ فَقُومُوا ‏\"‏‏.‏","english":{"narrator":"Narrated Jabir bin `Abdullah:","text":"A funeral procession passed in front of us and the Prophet (ﷺ) stood up and we too stood up. We said, 'O \nAllah's Messenger (ﷺ)! This is the funeral procession of a Jew.\" He said, \"Whenever you see a funeral \nprocession, you should stand up.\""}},{"id":70,"idInBook":70,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا عَمْرُو بْنُ مُرَّةَ، قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ أَبِي لَيْلَى، قَالَ كَانَ سَهْلُ بْنُ حُنَيْفٍ وَقَيْسُ بْنُ سَعْدٍ قَاعِدَيْنِ بِالْقَادِسِيَّةِ، فَمَرُّوا عَلَيْهِمَا بِجَنَازَةٍ فَقَامَا‏.‏ فَقِيلَ لَهُمَا إِنَّهَا مِنْ أَهْلِ الأَرْضِ، أَىْ مِنْ أَهْلِ الذِّمَّةِ فَقَالاَ إِنَّ النَّبِيَّ صلى الله عليه وسلم مَرَّتْ بِهِ جَنَازَةٌ فَقَامَ فَقِيلَ لَهُ إِنَّهَا جَنَازَةُ يَهُودِيٍّ‏.‏ فَقَالَ ‏\n\"‏ أَلَيْسَتْ نَفْسًا ‏\"‏‏.‏   وَقَالَ أَبُو حَمْزَةَ عَنِ الأَعْمَشِ، عَنْ عَمْرٍو، عَنِ ابْنِ أَبِي لَيْلَى، قَالَ كُنْتُ مَعَ قَيْسٍ وَسَهْلٍ ـ رضى الله عنهما ـ فَقَالاَ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم‏.‏ وَقَالَ زَكَرِيَّاءُ عَنِ الشَّعْبِيِّ عَنِ ابْنِ أَبِي لَيْلَى كَانَ أَبُو مَسْعُودٍ وَقَيْسٌ يَقُومَانِ لِلْجِنَازَةِ‏.‏","english":{"narrator":"Narrated `Abdur Rahman bin Abi Laila:","text":"Sahl bin Hunaif and Qais bin Sa`d were sitting in the city of Al-Qadisiya. A funeral procession passed \nin front of them and they stood up. They were told that funeral procession was of one of the \ninhabitants of the land i.e. of a non-believer, under the protection of Muslims. They said, \"A funeral \nprocession passed in front of the Prophet (ﷺ) and he stood up. When he was told that it was the coffin of a \nJew, he said, \"Is it not a living being (soul)?\""}},{"id":71,"idInBook":71,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا اللَّيْثُ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِيهِ، أَنَّهُ سَمِعَ أَبَا سَعِيدٍ الْخُدْرِيَّ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا وُضِعَتِ الْجِنَازَةُ وَاحْتَمَلَهَا الرِّجَالُ عَلَى أَعْنَاقِهِمْ، فَإِنْ كَانَتْ صَالِحَةً قَالَتْ قَدِّمُونِي‏.‏ وَإِنْ كَانَتْ غَيْرَ صَالِحَةٍ قَالَتْ يَا وَيْلَهَا أَيْنَ يَذْهَبُونَ بِهَا يَسْمَعُ صَوْتَهَا كُلُّ شَىْءٍ إِلاَّ الإِنْسَانَ، وَلَوْ سَمِعَهُ صَعِقَ ‏\"‏‏.‏","english":{"narrator":"Narrated Abu Sa`id Al-Khudri:","text":"Allah's Messenger (ﷺ) said, When the funeral is ready and the men carry it on their shoulders, if the deceased \nwas righteous it will say, 'Present me (hurriedly),' and if he was not righteous, it will say, 'Woe to it \n(me)! Where are they taking it (me)?' Its voice is heard by everything except man and if he heard it he \nwould fall unconscious.\""}},{"id":72,"idInBook":72,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ حَفِظْنَاهُ مِنَ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَسْرِعُوا بِالْجِنَازَةِ، فَإِنْ تَكُ صَالِحَةً فَخَيْرٌ تُقَدِّمُونَهَا ‏{‏إِلَيْهِ‏}‏، وَإِنْ يَكُ سِوَى ذَلِكَ فَشَرٌّ تَضَعُونَهُ عَنْ رِقَابِكُمْ ‏\"‏‏.‏","english":{"narrator":"Narrated Abu Huraira:","text":"The Prophet (ﷺ) said, \"Hurry up with the dead body for if it was righteous, you are forwarding it to \nwelfare; and if it was otherwise, then you are putting off an evil thing down your necks.\""}},{"id":73,"idInBook":73,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، حَدَّثَنَا سَعِيدٌ، عَنْ أَبِيهِ، أَنَّهُ سَمِعَ أَبَا سَعِيدٍ الْخُدْرِيَّ ـ رضى الله عنه ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِذَا وُضِعَتِ الْجِنَازَةُ فَاحْتَمَلَهَا الرِّجَالُ عَلَى أَعْنَاقِهِمْ، فَإِنْ كَانَتْ صَالِحَةً قَالَتْ قَدِّمُونِي‏.‏ وَإِنْ كَانَتْ غَيْرَ صَالِحَةٍ قَالَتْ لأَهْلِهَا يَا وَيْلَهَا أَيْنَ يَذْهَبُونَ بِهَا يَسْمَعُ صَوْتَهَا كُلُّ شَىْءٍ إِلاَّ الإِنْسَانَ، وَلَوْ سَمِعَ الإِنْسَانُ لَصَعِقَ ‏\"‏‏.‏","english":{"narrator":"Narrated Abu Sa`id Al-Khudri:","text":"The Prophet (ﷺ) said, \"When a funeral is ready and the men carry the deceased on their necks (shoulders), \nif it was pious then it will say, 'Present me quickly', and if it was not pious, then it will say, 'Woe to it \n(me), where are they taking it (me)?' And its voice is heard by everything except mankind and if he \nheard it he would fall unconscious.\""}},{"id":74,"idInBook":74,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا مُسَدَّدٌ، عَنْ أَبِي عَوَانَةَ، عَنْ قَتَادَةَ، عَنْ عَطَاءٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم صَلَّى عَلَى النَّجَاشِيِّ، فَكُنْتُ فِي الصَّفِّ الثَّانِي أَوِ الثَّالِثِ‏.‏","english":{"narrator":"Narrated Jabir bin `Abdullah:","text":"Allah's Messenger (ﷺ) offered the funeral prayer for An-Najashi and I was in the second or third row."}},{"id":75,"idInBook":75,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ نَعَى النَّبِيُّ صلى الله عليه وسلم إِلَى أَصْحَابِهِ النَّجَاشِيَّ، ثُمَّ تَقَدَّمَ فَصَفُّوا خَلْفَهُ فَكَبَّرَ أَرْبَعًا‏.‏","english":{"narrator":"Narrated Abu Huraira:","text":"The Prophet (p.b.u.h) informed his companions about the death of An-Najashi and then he went ahead \n(to lead the prayer) and the people lined up behind him in rows and he said four Takbir."}},{"id":76,"idInBook":76,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا مُسْلِمٌ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا الشَّيْبَانِيُّ، عَنِ الشَّعْبِيِّ، قَالَ أَخْبَرَنِي مَنْ، شَهِدَ النَّبِيَّ صلى الله عليه وسلم أَنَّهُ أَتَى عَلَى قَبْرٍ مَنْبُوذٍ فَصَفَّهُمْ وَكَبَّرَ أَرْبَعًا‏.‏ قُلْتُ مَنْ حَدَّثَكَ قَالَ ابْنُ عَبَّاسٍ رضى الله عنهما‏.‏","english":{"narrator":"Narrated Ash-Shaibani:","text":"Ash Shu`bi said, \"I was informed by a man who had seen the Prophet (ﷺ) going to a grave that was \nseparate from the other graves and he aligned the people in rows and said four Takbir.\" I said, \"O Abu \n`Amr! who narrated (that) to you\"? He said, \"Ibn `Abbas. \""}},{"id":77,"idInBook":77,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامُ بْنُ يُوسُفَ، أَنَّ ابْنَ جُرَيْجٍ، أَخْبَرَهُمْ قَالَ أَخْبَرَنِي عَطَاءٌ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ يَقُولُ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ قَدْ تُوُفِّيَ الْيَوْمَ رَجُلٌ صَالِحٌ مِنَ الْحَبَشِ فَهَلُمَّ فَصَلُّوا عَلَيْهِ ‏\"‏‏.‏ قَالَ فَصَفَفْنَا فَصَلَّى النَّبِيُّ صلى الله عليه وسلم عَلَيْهِ وَنَحْنُ صُفُوفٌ‏.‏ قَالَ أَبُو الزُّبَيْرِ عَنْ جَابِرٍ كُنْتُ فِي الصَّفِّ الثَّانِي‏.‏","english":{"narrator":"Narrated Jabir bin `Abdullah:","text":"The Prophet (ﷺ) said, \"Today a pious man from Ethiopia (i.e. An Najashi) has expired, come on to offer \nthe funeral prayer.\" (Jabir said): We lined up in rows and after that the Prophet (ﷺ) led the prayer and we \nwere in rows. Jabir added, I was in the second row.\""}},{"id":78,"idInBook":78,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا الشَّيْبَانِيُّ، عَنْ عَامِرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم مَرَّ بِقَبْرٍ قَدْ دُفِنَ لَيْلاً فَقَالَ ‏\"‏ مَتَى دُفِنَ هَذَا ‏\"‏‏.‏ قَالُوا الْبَارِحَةَ‏.‏ قَالَ ‏\"‏ أَفَلاَ آذَنْتُمُونِي ‏\"‏‏.‏ قَالُوا دَفَنَّاهُ فِي ظُلْمَةِ اللَّيْلِ فَكَرِهْنَا أَنْ نُوقِظَكَ‏.‏ فَقَامَ فَصَفَفْنَا خَلْفَهُ‏.‏ قَالَ ابْنُ عَبَّاسٍ وَأَنَا فِيهِمْ فَصَلَّى عَلَيْهِ‏.‏","english":{"narrator":"Narrated Ibn `Abbas:","text":"Allah's Messenger (ﷺ) passed by a grave of a deceased who had been buried at night. He said, \"When was \nthis (deceased) buried?\" The people said, \"Yesterday.\" He said, \"Why did you not inform me?\" They \nsaid, \"We buried him when it was dark and so we disliked to wake you up.\" He stood up and we lined \nup behind him. (Ibn `Abbas said): I was one of them, and the Prophet (ﷺ) offered the funeral prayer."}},{"id":79,"idInBook":79,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنِ الشَّيْبَانِيِّ، عَنِ الشَّعْبِيِّ، قَالَ أَخْبَرَنِي مَنْ، مَرَّ مَعَ نَبِيِّكُمْ صلى الله عليه وسلم عَلَى قَبْرٍ مَنْبُوذٍ فَأَمَّنَا فَصَفَفْنَا خَلْفَهُ‏.‏ فَقُلْنَا يَا أَبَا عَمْرٍو مَنْ حَدَّثَكَ قَالَ ابْنُ عَبَّاسٍ رضى الله عنهما‏.‏","english":{"narrator":"Narrated Ash-Shaibani:","text":"Ash-Shu`bi said, \"Somebody who passed along with your Prophet (p.b.u.h) by a grave that was \nseparate from the other graves informed me (saying), \"The Prophet (ﷺ) \nled us (in the prayer) and we aligned behind him.\" We said, \"O Abu `Amr! Who told you this \nnarration?\" He replied, \"Ibn `Abbas.\""}},{"id":80,"idInBook":80,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ، قَالَ سَمِعْتُ نَافِعًا، يَقُولُ حُدِّثَ ابْنُ عُمَرَ، أَنَّ أَبَا هُرَيْرَةَ ـ رضى الله عنهم ـ يَقُولُ مَنْ تَبِعَ جَنَازَةً فَلَهُ قِيرَاطٌ‏.‏ فَقَالَ أَكْثَرَ أَبُو هُرَيْرَةَ عَلَيْنَا‏.‏   فَصَدَّقَتْ ـ يَعْنِي عَائِشَةَ ـ أَبَا هُرَيْرَةَ وَقَالَتْ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُهُ‏.‏ فَقَالَ ابْنُ عُمَرَ ـ رضى الله عنهما ـ لَقَدْ فَرَّطْنَا فِي قَرَارِيطَ كَثِيرَةٍ‏.‏ ‏{‏فَرَّطْتُ‏}‏ ضَيَّعْتُ مِنْ أَمْرِ اللَّهِ‏.‏","english":{"narrator":"Narrated Nafi`:","text":"Ibn `Umar was told that Abu Huraira said, \"Whoever accompanies the funeral procession will have a \nreward equal to one Qirat.\" Ibn `Umar said, \"Abu Huraira talks of a too enormous reward.\" Aisha \nattested Abu Huraira's narration and said, \"I heard Allah's Messenger (ﷺ) saying like that.\" Ibn `Umar said, \n\"We have lost numerous Qirats.\""}},{"id":81,"idInBook":81,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، قَالَ قَرَأْتُ عَلَى ابْنِ أَبِي ذِئْبٍ عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِيهِ، أَنَّهُ سَأَلَ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ فَقَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم‏.‏   حَدَّثَنَا أَحْمَدُ بْنُ شَبِيبِ بْنِ سَعِيدٍ، قَالَ حَدَّثَنِي أَبِي، حَدَّثَنَا يُونُسُ، قَالَ ابْنُ شِهَابٍ وَحَدَّثَنِي عَبْدُ الرَّحْمَنِ الأَعْرَجُ، أَنَّ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ شَهِدَ الْجَنَازَةَ حَتَّى يُصَلِّيَ عَلَيْهَا فَلَهُ قِيرَاطٌ، وَمَنْ شَهِدَ حَتَّى تُدْفَنَ كَانَ لَهُ قِيرَاطَانِ ‏\"‏‏.‏ قِيلَ وَمَا الْقِيرَاطَانِ قَالَ ‏\"‏ مِثْلُ الْجَبَلَيْنِ الْعَظِيمَيْنِ ‏\"‏‏.‏","english":{"narrator":"Narrated Abu Huraira:","text":"that Allah's Messenger (ﷺ) (p.b.u.h) said, \"Whoever attends the funeral procession till he offers the funeral \nprayer for it, will get a reward equal to one Qirat, and whoever accompanies it till burial, will get a \nreward equal to two Qirats.\" It was asked, \"What are two Qirats?\" He replied, \"Like two huge \nmountains.\""}},{"id":82,"idInBook":82,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا يَحْيَى بْنُ أَبِي بُكَيْرٍ، حَدَّثَنَا زَائِدَةُ، حَدَّثَنَا أَبُو إِسْحَاقَ الشَّيْبَانِيُّ، عَنْ عَامِرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ أَتَى رَسُولُ اللَّهِ صلى الله عليه وسلم قَبْرًا، فَقَالُوا هَذَا دُفِنَ، أَوْ دُفِنَتِ الْبَارِحَةَ‏.‏ قَالَ ابْنُ عَبَّاسٍ ـ رضى الله عنهما ـ فَصَفَّنَا خَلْفَهُ ثُمَّ صَلَّى عَلَيْهَا‏.‏","english":{"narrator":"Narrated 'Amir:","text":"Ibn `Abbas (who was at that time a boy) said, \"Allah's Messenger (ﷺ) came to a grave and the people said, \n'He or she was buried yesterday.' \" Ibn `Abbas added, \"We aligned behind the Prophet (ﷺ) and he led the \nfuneral prayer of the deceased.\""}},{"id":83,"idInBook":83,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، وَأَبِي، سَلَمَةَ أَنَّهُمَا حَدَّثَاهُ عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ نَعَى لَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم النَّجَاشِيَّ صَاحِبَ الْحَبَشَةِ، يَوْمَ الَّذِي مَاتَ فِيهِ فَقَالَ ‏\n\"‏ اسْتَغْفِرُوا لأَخِيكُمْ ‏\"‏‏.‏   وَعَنِ ابْنِ شِهَابٍ، قَالَ حَدَّثَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ إِنَّ النَّبِيَّ صلى الله عليه وسلم صَفَّ بِهِمْ بِالْمُصَلَّى فَكَبَّرَ عَلَيْهِ أَرْبَعًا‏.‏","english":{"narrator":"Narrated Abu Huraira:","text":"Allah's Messenger (ﷺ) informed about the news of the death of An-Najash (King of Ethiopia) on the day he \nexpired. He said, \"Ask Allah's forgiveness for your brother. \" Narrated Abu Huraira: The Prophet (ﷺ) \nmade them align in rows at the Musalla and said four Takbir."}},{"id":84,"idInBook":84,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، حَدَّثَنَا أَبُو ضَمْرَةَ، حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ الْيَهُودَ، جَاءُوا إِلَى النَّبِيِّ صلى الله عليه وسلم بِرَجُلٍ مِنْهُمْ وَامْرَأَةٍ زَنَيَا، فَأَمَرَ بِهِمَا فَرُجِمَا قَرِيبًا مِنْ مَوْضِعِ الْجَنَائِزِ عِنْدَ الْمَسْجِدِ‏.‏","english":{"narrator":"Narrated `Abdullah bin `Umar:","text":"The Jew brought to the Prophet (ﷺ) a man and a woman from amongst them who have committed \n(adultery) illegal sexual intercourse. He ordered both of them to be stoned (to death), near the place of \noffering the funeral prayers beside the mosque.\""}},{"id":85,"idInBook":85,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنْ شَيْبَانَ، عَنْ هِلاَلٍ ـ هُوَ الْوَزَّانُ ـ عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ فِي مَرَضِهِ الَّذِي مَاتَ فِيهِ ‏\n\"‏ لَعَنَ اللَّهُ الْيَهُودَ وَالنَّصَارَى، اتَّخَذُوا قُبُورَ أَنْبِيَائِهِمْ مَسْجِدًا ‏\"‏‏.‏ قَالَتْ وَلَوْلاَ ذَلِكَ لأَبْرَزُوا قَبْرَهُ غَيْرَ أَنِّي أَخْشَى أَنْ يُتَّخَذَ مَسْجِدًا‏.‏","english":{"narrator":"Narrated `Urwa:","text":"Aisha said, \"The Prophet (ﷺ) in his fatal illness said, 'Allah cursed the Jews and the Christians because \nthey took the graves of their Prophets as places for praying.\"' Aisha added, \"Had it not been for that, \nthe grave of the Prophet (p.b.u.h) would have been made prominent but I am afraid it might be taken \n(as a) place for praying."}},{"id":86,"idInBook":86,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا حُسَيْنٌ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ، عَنْ سَمُرَةَ ـ رضى الله عنه ـ قَالَ صَلَّيْتُ وَرَاءَ النَّبِيِّ صلى الله عليه وسلم عَلَى امْرَأَةٍ مَاتَتْ فِي نِفَاسِهَا، فَقَامَ عَلَيْهَا وَسَطَهَا‏.‏","english":{"narrator":"Narrated Samura bin Jundab:","text":"I offered the funeral prayer behind the Prophet (ﷺ) for a woman who had died during childbirth and he \nstood up by the middle of the coffin."}},{"id":87,"idInBook":87,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا عِمْرَانُ بْنُ مَيْسَرَةَ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا حُسَيْنٌ، عَنِ ابْنِ بُرَيْدَةَ، حَدَّثَنَا سَمُرَةُ بْنُ جُنْدُبٍ ـ رضى الله عنه ـ قَالَ صَلَّيْتُ وَرَاءَ النَّبِيِّ صلى الله عليه وسلم عَلَى امْرَأَةٍ مَاتَتْ فِي نِفَاسِهَا فَقَامَ عَلَيْهَا وَسَطَهَا‏.‏","english":{"narrator":"Narrated Samura bin Jundab:","text":"I offered the funeral prayer behind the Prophet (ﷺ) for a woman who had died during childbirth and he \nstood up by the middle of the coffin."}},{"id":88,"idInBook":88,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَعَى النَّجَاشِيَّ فِي الْيَوْمِ الَّذِي مَاتَ فِيهِ، وَخَرَجَ بِهِمْ إِلَى الْمُصَلَّى فَصَفَّ بِهِمْ، وَكَبَّرَ عَلَيْهِ أَرْبَعَ تَكْبِيرَاتٍ‏.‏","english":{"narrator":"Narrated Abu Huraira:","text":"Allah's Messenger (ﷺ) informed about the news of the death of An-Najash on the day he died. He went out \nwith us to the Musalla and we aligned in rows and he said four Takbirs for An-Najashi's funeral \nprayer."}},{"id":89,"idInBook":89,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سِنَانٍ، حَدَّثَنَا سَلِيمُ بْنُ حَيَّانَ، حَدَّثَنَا سَعِيدُ بْنُ مِينَاءَ، عَنْ جَابِرٍ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم صَلَّى عَلَى أَصْحَمَةَ النَّجَاشِيِّ فَكَبَّرَ أَرْبَعًا‏.‏ وَقَالَ يَزِيدُ بْنُ هَارُونَ وَعَبْدُ الصَّمَدِ عَنْ سَلِيمٍ أَصْحَمَةَ‏.‏ وَتَابَعَهُ عَبْدُ الصَّمَدِ‏.‏","english":{"narrator":"Narrated Jabir:","text":"The Prophet (ﷺ) offered the funeral prayer of As-Hama An-Najash and said four Takbir."}},{"id":90,"idInBook":90,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ سَعْدٍ، عَنْ طَلْحَةَ، قَالَ صَلَّيْتُ خَلْفَ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ‏.‏ حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا سُفْيَانُ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ طَلْحَةَ بْنِ عَبْدِ اللَّهِ بْنِ عَوْفٍ، قَالَ صَلَّيْتُ خَلْفَ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ عَلَى جَنَازَةٍ فَقَرَأَ بِفَاتِحَةِ الْكِتَابِ قَالَ لِيَعْلَمُوا أَنَّهَا سُنَّةٌ‏.‏","english":{"narrator":"Narrated Talha bin `Abdullah bin `Auf:","text":"I offered the funeral prayer behind Ibn `Abbas and he recited Al-Fatiha and said, \"You should know \nthat it (i.e. recitation of Al-Fatiha) is the tradition of the Prophet (ﷺ) Muhammad."}},{"id":91,"idInBook":91,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ، حَدَّثَنَا شُعْبَةُ، قَالَ حَدَّثَنِي سُلَيْمَانُ الشَّيْبَانِيُّ، قَالَ سَمِعْتُ الشَّعْبِيَّ، قَالَ أَخْبَرَنِي مَنْ، مَرَّ مَعَ النَّبِيِّ صلى الله عليه وسلم عَلَى قَبْرٍ مَنْبُوذٍ فَأَمَّهُمْ وَصَلَّوْا خَلْفَهُ‏.‏ قُلْتُ مَنْ حَدَّثَكَ هَذَا يَا أَبَا عَمْرٍو قَالَ ابْنُ عَبَّاسٍ ـ رضى الله عنهما ـ‏.‏","english":{"narrator":"Narrated Sulaiman Ash-Shaibani:","text":"I heard Ash-Shu`bi saying, \"I was told by a man who had passed with the Prophet (p.b.u.h) by a grave \nthat was separate from the other graves that he (the Prophet (ﷺ) ) led them in the prayer and they prayed \nbehind him.\" I said, \"O Abu `Amr! Who narrated that to you?\" He replied, \"Ibn `Abbas.\""}},{"id":92,"idInBook":92,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْفَضْلِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ ثَابِتٍ، عَنْ أَبِي رَافِعٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ أَسْوَدَ ـ رَجُلاً أَوِ امْرَأَةً ـ كَانَ يَقُمُّ الْمَسْجِدَ فَمَاتَ، وَلَمْ يَعْلَمِ النَّبِيُّ صلى الله عليه وسلم بِمَوْتِهِ فَذَكَرَهُ ذَاتَ يَوْمٍ فَقَالَ ‏\"‏ مَا فَعَلَ ذَلِكَ الإِنْسَانُ ‏\"‏‏.‏ قَالُوا مَاتَ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ أَفَلاَ آذَنْتُمُونِي ‏\"‏‏.‏ فَقَالُوا إِنَّهُ كَانَ كَذَا وَكَذَا قِصَّتَهُ‏.‏ قَالَ فَحَقَرُوا شَأْنَهُ‏.‏ قَالَ ‏\"‏ فَدُلُّونِي عَلَى قَبْرِهِ ‏\"‏‏.‏ فَأَتَى قَبْرَهُ فَصَلَّى عَلَيْهِ‏.‏","english":{"narrator":"Narrated Abu Huraira:","text":"A black person, a male or a female used to clean the Mosque and then died. The Prophet (p.b.u.h) did \nnot know about it . One day the Prophet (ﷺ) remembered him and said, \"What happened to that person?\" \nThe people replied, \"O Allah's Messenger (ﷺ)! He died.\" He said, \"Why did you not inform me?\" They said, \n\"His story was so and so (i.e. regarded him as insignificant).\" He said, \"Show me his grave.\" He then \nwent to his grave and offered the funeral prayer."}},{"id":93,"idInBook":93,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا عَيَّاشٌ، حَدَّثَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا سَعِيدٌ، قَالَ وَقَالَ لِي خَلِيفَةُ حَدَّثَنَا ابْنُ زُرَيْعٍ، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْعَبْدُ إِذَا وُضِعَ فِي قَبْرِهِ، وَتُوُلِّيَ وَذَهَبَ أَصْحَابُهُ حَتَّى إِنَّهُ لَيَسْمَعُ قَرْعَ نِعَالِهِمْ، أَتَاهُ مَلَكَانِ فَأَقْعَدَاهُ فَيَقُولاَنِ لَهُ مَا كُنْتَ تَقُولُ فِي هَذَا الرَّجُلِ مُحَمَّدٍ صلى الله عليه وسلم فَيَقُولُ أَشْهَدُ أَنَّهُ عَبْدُ اللَّهِ وَرَسُولُهُ‏.‏ فَيُقَالُ انْظُرْ إِلَى مَقْعَدِكَ مِنَ النَّارِ، أَبْدَلَكَ اللَّهُ بِهِ مَقْعَدًا مِنَ الْجَنَّةِ ـ قَالَ النَّبِيُّ صلى الله عليه وسلم فَيَرَاهُمَا جَمِيعًا ـ وَأَمَّا الْكَافِرُ ـ أَوِ الْمُنَافِقُ ـ فَيَقُولُ لاَ أَدْرِي، كُنْتُ أَقُولُ مَا يَقُولُ النَّاسُ‏.‏ فَيُقَالُ لاَ دَرَيْتَ وَلاَ تَلَيْتَ‏.‏ ثُمَّ يُضْرَبُ بِمِطْرَقَةٍ مِنْ حَدِيدٍ ضَرْبَةً بَيْنَ أُذُنَيْهِ، فَيَصِيحُ صَيْحَةً يَسْمَعُهَا مَنْ يَلِيهِ إِلاَّ الثَّقَلَيْنِ ‏\"‏‏.‏","english":{"narrator":"Narrated Anas:","text":"The Prophet (ﷺ) said, \"When a human being is laid in his grave and his companions return and he even \nhears their foot steps, two angels come to him and make him sit and ask him: What did you use to say \nabout this man, Muhammad ? He will say: I testify that he is Allah's slave and His Apostle. Then it \nwill be said to him, 'Look at your place in the Hell-Fire. Allah has given you a place in Paradise \ninstead of it.' \" The Prophet (ﷺ) added, \"The dead person will see both his places. But a non-believer or a \nhypocrite will say to the angels, 'I do not know, but I used to say what the people used to say! It will \nbe said to him, 'Neither did you know nor did you take the guidance (by reciting the Qur'an).' Then he \nwill be hit with an iron hammer between his two ears, and he will cry and that cry will be heard by \nwhatever approaches him except human beings and jinns.\""}},{"id":94,"idInBook":94,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا مَحْمُودٌ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ ‏\"‏ أُرْسِلَ مَلَكُ الْمَوْتِ إِلَى مُوسَى ـ عَلَيْهِمَا السَّلاَمُ ـ فَلَمَّا جَاءَهُ صَكَّهُ فَرَجَعَ إِلَى رَبِّهِ فَقَالَ أَرْسَلْتَنِي إِلَى عَبْدٍ لاَ يُرِيدُ الْمَوْتَ‏.‏ فَرَدَّ اللَّهُ عَلَيْهِ عَيْنَهُ وَقَالَ ارْجِعْ فَقُلْ لَهُ يَضَعُ يَدَهُ عَلَى مَتْنِ ثَوْرٍ، فَلَهُ بِكُلِّ مَا غَطَّتْ بِهِ يَدُهُ بِكُلِّ شَعْرَةٍ سَنَةٌ‏.‏ قَالَ أَىْ رَبِّ، ثُمَّ مَاذَا قَالَ ثُمَّ الْمَوْتُ‏.‏ قَالَ فَالآنَ‏.‏ فَسَأَلَ اللَّهَ أَنْ يُدْنِيَهُ مِنَ الأَرْضِ الْمُقَدَّسَةِ رَمْيَةً بِحَجَرٍ ‏\"‏‏.‏ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَلَوْ كُنْتُ ثَمَّ لأَرَيْتُكُمْ قَبْرَهُ إِلَى جَانِبِ الطَّرِيقِ عِنْدَ الْكَثِيبِ الأَحْمَرِ ‏\"‏‏.‏","english":{"narrator":"Narrated Abu Huraira:","text":"The angel of death was sent to Moses and when he went to him, Moses slapped him severely, spoiling \none of his eyes. The angel went back to his Lord, and said, \"You sent me to a slave who does not want \nto die.\" Allah restored his eye and said, \"Go back and tell him (i.e. Moses) to place his hand over the \nback of an ox, for he will be allowed to live for a number of years equal to the number of hairs coming \nunder his hand.\" (So the angel came to him and told him the same). Then Moses asked, \"O my Lord! \nWhat will be then?\" He said, \"Death will be then.\" He said, \"(Let it be) now.\" He asked Allah that He \nbring him near the Sacred Land at a distance of a stone's throw. Allah's Messenger (ﷺ) (p.b.u.h) said, \"Were I \nthere I would show you the grave of Moses by the way near the red sand hill.\""}},{"id":95,"idInBook":95,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنِ الشَّيْبَانِيِّ، عَنِ الشَّعْبِيِّ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ صَلَّى النَّبِيُّ صلى الله عليه وسلم عَلَى رَجُلٍ بَعْدَ مَا دُفِنَ بِلَيْلَةٍ قَامَ هُوَ وَأَصْحَابُهُ، وَكَانَ سَأَلَ عَنْهُ فَقَالَ ‏\n\"‏ مَنْ هَذَا ‏\"‏‏.‏ فَقَالُوا فُلاَنٌ، دُفِنَ الْبَارِحَةَ‏.‏ فَصَلَّوْا عَلَيْهِ‏.‏","english":{"narrator":"Narrated Ibn `Abbas:","text":"The Prophet (p.b.u.h) offered the funeral prayer of a man one night after he was buried, he and his \ncompanions stood up (for the Prayer). He had asked them about him before standing, saying, \"Who is \nthis?\" They said, \"He is so and so and was buried last night.\" So all of them offered the funeral prayer."}},{"id":96,"idInBook":96,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ لَمَّا اشْتَكَى النَّبِيُّ صلى الله عليه وسلم ذَكَرَتْ بَعْضُ نِسَائِهِ كَنِيسَةً رَأَيْنَهَا بِأَرْضِ الْحَبَشَةِ، يُقَالُ لَهَا مَارِيَةُ، وَكَانَتْ أُمُّ سَلَمَةَ وَأُمُّ حَبِيبَةَ ـ رضى الله عنهما ـ أَتَتَا أَرْضَ الْحَبَشَةِ، فَذَكَرَتَا مِنْ حُسْنِهَا وَتَصَاوِيرَ فِيهَا، فَرَفَعَ رَأْسَهُ فَقَالَ ‏\n\"‏ أُولَئِكَ إِذَا مَاتَ مِنْهُمُ الرَّجُلُ الصَّالِحُ بَنَوْا عَلَى قَبْرِهِ مَسْجِدًا، ثُمَّ صَوَّرُوا فِيهِ تِلْكَ الصُّورَةَ، أُولَئِكَ شِرَارُ الْخَلْقِ عِنْدَ اللَّهِ ‏\"‏‏.‏","english":{"narrator":"Narrated `Aisha:","text":"When the Prophet (ﷺ) became ill, some of his wives talked about a church which they had seen in \nEthiopia and it was called Mariya. Um Salma and Um Habiba had been to Ethiopia, and both of them \nnarrated its (the Church's) beauty and the pictures it contained. The Prophet (ﷺ) raised his head and said, \n\"Those are the people who, whenever a pious man dies amongst them, make a place of worship at his \ngrave and then they make those pictures in it. Those are the worst creatures in the Sight of Allah.\""}},{"id":97,"idInBook":97,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سِنَانٍ، حَدَّثَنَا فُلَيْحُ بْنُ سُلَيْمَانَ، حَدَّثَنَا هِلاَلُ بْنُ عَلِيٍّ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ شَهِدْنَا بِنْتَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَرَسُولُ اللَّهِ صلى الله عليه وسلم جَالِسٌ عَلَى الْقَبْرِ، فَرَأَيْتُ عَيْنَيْهِ تَدْمَعَانِ فَقَالَ ‏\"‏ هَلْ فِيكُمْ مِنْ أَحَدٍ لَمْ يُقَارِفِ اللَّيْلَةَ ‏\"‏‏.‏ فَقَالَ أَبُو طَلْحَةَ أَنَا‏.‏ قَالَ ‏\"‏ فَانْزِلْ فِي قَبْرِهَا ‏\"‏‏.‏ فَنَزَلَ فِي قَبْرِهَا فَقَبَرَهَا‏.‏ قَالَ ابْنُ الْمُبَارَكِ قَالَ فُلَيْحٌ أُرَاهُ يَعْنِي الذَّنْبَ‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ ‏{‏لِيَقْتَرِفُوا‏}‏ أَىْ لِيَكْتَسِبُوا‏.‏","english":{"narrator":"Narrated Anas:","text":"We were in the funeral procession of the daughter of Allah's Messenger (ﷺ) and Allah's Messenger (ﷺ) was sitting \nnear the grave and I saw his eyes full of tears. He said, \"Is there anyone amongst you who did not \nhave sexual relations with his wife last night?\" Abu Talha replied in the affirmative. And so Allah's \nApostle told him to get down in her grave and he got down in her grave and buried her."}},{"id":98,"idInBook":98,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، قَالَ حَدَّثَنِي ابْنُ شِهَابٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَعْبِ بْنِ مَالِكٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَجْمَعُ بَيْنَ الرَّجُلَيْنِ مِنْ قَتْلَى أُحُدٍ فِي ثَوْبٍ وَاحِدٍ ثُمَّ يَقُولُ ‏\"‏ أَيُّهُمْ أَكْثَرُ أَخْذًا لِلْقُرْآنِ ‏\"‏‏.‏ فَإِذَا أُشِيرَ لَهُ إِلَى أَحَدِهِمَا قَدَّمَهُ فِي اللَّحْدِ وَقَالَ ‏\"‏ أَنَا شَهِيدٌ عَلَى هَؤُلاَءِ يَوْمَ الْقِيَامَةِ ‏\"‏‏.‏ وَأَمَرَ بِدَفْنِهِمْ فِي دِمَائِهِمْ، وَلَمْ يُغَسَّلُوا وَلَمْ يُصَلَّ عَلَيْهِمْ‏.‏","english":{"narrator":"Narrated Jabir bin `Abdullah:","text":"The Prophet (ﷺ) collected every two martyrs of Uhud in one piece of cloth, then he would ask, \"Which of \nthem had (knew) more of the Qur'an?\" When one of them was pointed out for him, he would put that \none first in the grave and say, \"I will be a witness on these on the Day of Resurrection.\" He ordered \nthem to be buried with their blood on their bodies and they were neither washed nor was a funeral \nprayer offered for them."}},{"id":99,"idInBook":99,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، حَدَّثَنِي يَزِيدُ بْنُ أَبِي حَبِيبٍ، عَنْ أَبِي الْخَيْرِ، عَنْ عُقْبَةَ بْنِ عَامِرٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم خَرَجَ يَوْمًا فَصَلَّى عَلَى أَهْلِ أُحُدٍ صَلاَتَهُ عَلَى الْمَيِّتِ، ثُمَّ انْصَرَفَ إِلَى الْمِنْبَرِ فَقَالَ ‏\n\"‏ إِنِّي فَرَطٌ لَكُمْ، وَأَنَا شَهِيدٌ عَلَيْكُمْ، وَإِنِّي وَاللَّهِ لأَنْظُرُ إِلَى حَوْضِي الآنَ، وَإِنِّي أُعْطِيتُ مَفَاتِيحَ خَزَائِنِ الأَرْضِ ـ أَوْ مَفَاتِيحَ الأَرْضِ ـ وَإِنِّي وَاللَّهِ مَا أَخَافُ عَلَيْكُمْ أَنْ تُشْرِكُوا بَعْدِي، وَلَكِنْ أَخَافُ عَلَيْكُمْ أَنْ تَنَافَسُوا فِيهَا ‏\"‏‏.‏","english":{"narrator":"Narrated `Uqba bin 'Amir:","text":"One day the Prophet (ﷺ) went out and offered the funeral prayers of the martyrs of Uhud and then went up \nthe pulpit and said, \"I will pave the way for you as your predecessor and will be a witness on you. By \nAllah! I see my Fount (Kauthar) just now and I have been given the keys of all the treasures of the \nearth (or the keys of the earth). By Allah! I am not afraid that you will worship others along with \nAllah after my death, but I am afraid that you will fight with one another for the worldly things.\""}},{"id":100,"idInBook":100,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا سَعِيدُ بْنُ سُلَيْمَانَ، حَدَّثَنَا اللَّيْثُ، حَدَّثَنَا ابْنُ شِهَابٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَعْبٍ، أَنَّ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ أَخْبَرَهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَجْمَعُ بَيْنَ الرَّجُلَيْنِ مِنْ قَتْلَى أُحُدٍ‏.‏","english":{"narrator":"Narrated Jabir bin `Abdullah:","text":"The Prophet (ﷺ) buried every two martyrs in of Uhud in one grave."}},{"id":101,"idInBook":101,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا لَيْثٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَعْبٍ، عَنْ جَابِرٍ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ ادْفِنُوهُمْ فِي دِمَائِهِمْ ‏\"‏‏.‏ ـ يَعْنِي يَوْمَ أُحُدٍ ـ وَلَمْ يُغَسِّلْهُمْ‏.‏","english":{"narrator":"Narrated Jabir:","text":"The Prophet (ﷺ) said, \"Bury them (i.e. martyrs) with their blood.\" (that was) On the day of the Battle of \nUhud. He did not get them washed."}},{"id":102,"idInBook":102,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا ابْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا لَيْثُ بْنُ سَعْدٍ، حَدَّثَنِي ابْنُ شِهَابٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَعْبِ بْنِ مَالِكٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَجْمَعُ بَيْنَ الرَّجُلَيْنِ مِنْ قَتْلَى أُحُدٍ فِي ثَوْبٍ وَاحِدٍ ثُمَّ يَقُولُ ‏\"‏ أَيُّهُمْ أَكْثَرُ أَخْذًا لِلْقُرْآنِ ‏\"‏‏.‏ فَإِذَا أُشِيرَ لَهُ إِلَى أَحَدِهِمَا قَدَّمَهُ فِي اللَّحْدِ وَقَالَ ‏\"‏ أَنَا شَهِيدٌ عَلَى هَؤُلاَءِ ‏\"‏‏.‏ وَأَمَرَ بِدَفْنِهِمْ بِدِمَائِهِمْ، وَلَمْ يُصَلِّ عَلَيْهِمْ وَلَمْ يُغَسِّلْهُمْ‏.‏   وَأَخْبَرَنَا الأَوْزَاعِيُّ، عَنِ الزُّهْرِيِّ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَقُولُ لِقَتْلَى أُحُدٍ ‏\"‏ أَىُّ هَؤُلاَءِ أَكْثَرُ أَخْذًا لِلْقُرْآنِ ‏\"‏‏.‏ فَإِذَا أُشِيرَ لَهُ إِلَى رَجُلٍ قَدَّمَهُ فِي اللَّحْدِ قَبْلَ صَاحِبِهِ‏.‏ وَقَالَ جَابِرٌ فَكُفِّنَ أَبِي وَعَمِّي فِي نَمِرَةٍ وَاحِدَةٍ‏.‏   وَقَالَ سُلَيْمَانُ بْنُ كَثِيرٍ حَدَّثَنِي الزُّهْرِيُّ، حَدَّثَنَا مَنْ، سَمِعَ جَابِرًا ـ رضى الله عنه‏.‏","english":{"narrator":"Narrated Jabir bin `Abdullah:","text":"Allah's Messenger (ﷺ) shrouded every two martyrs of Uhud in one piece of cloth and then he would ask, \n\"Which of them knew more Qur'an?\" When one of them was pointed out he would put him first in the \ngrave. He said, \"I am a witness on these.\" Then he ordered them to be buried with blood on their \nbodies. Neither did he offer their funeral prayer nor did he get them washed. (Jabir bin `Abdullah \nadded): Allah's Messenger (ﷺ) used to ask about the martyrs of Uhud as to which of them knew more of the \nQur'an.\" And when one of them was pointed out as having more of it he would put him first in the \ngrave and then his companions. (Jabir added): My father and my uncle were shrouded in one sheet."}},{"id":103,"idInBook":103,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ حَوْشَبٍ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنَا خَالِدٌ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ حَرَّمَ اللَّهُ مَكَّةَ، فَلَمْ تَحِلَّ لأَحَدٍ قَبْلِي وَلاَ لأَحَدٍ بَعْدِي، أُحِلَّتْ لِي سَاعَةً مِنْ نَهَارٍ، لاَ يُخْتَلَى خَلاَهَا، وَلاَ يُعْضَدُ شَجَرُهَا، وَلاَ يُنَفَّرُ صَيْدُهَا، وَلاَ تُلْتَقَطُ لُقَطَتُهَا إِلاَّ لِمُعَرِّفٍ ‏\"‏‏.‏ فَقَالَ الْعَبَّاسُ ـ رضى الله عنه ـ إِلاَّ الإِذْخِرَ لِصَاغَتِنَا وَقُبُورِنَا‏.‏ فَقَالَ ‏\"‏ إِلاَّ الإِذْخِرَ ‏\"‏‏.‏ وَقَالَ أَبُو هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ لِقُبُورِنَا وَبُيُوتِنَا ‏\"‏‏.‏   وَقَالَ أَبَانُ بْنُ صَالِحٍ عَنِ الْحَسَنِ بْنِ مُسْلِمٍ، عَنْ صَفِيَّةَ بِنْتِ شَيْبَةَ، سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم مِثْلَهُ‏.‏ وَقَالَ مُجَاهِدٌ عَنْ طَاوُسٍ عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ لِقَيْنِهِمْ وَبُيُوتِهِمْ‏.‏","english":{"narrator":"Narrated Ibn `Abbas:","text":"The Prophet (ﷺ) said, \"Allah has made Mecca a sanctuary (sacred place) and it was a sanctuary before me \nand will be so after me. It was made legal for me (to fight in it) for a few hours of the day. None is \nallowed to uproot its thorny shrubs or to cut its trees or to chase its game or to pick up its fallen things \nexcept by a person who announces it publicly.\" On that Al-Abbas said (to the Prophet), \"Except Al- \nIdhkhir for our goldsmiths and for our graves.\" And so the Prophet (ﷺ) added, \"Except Al-Idhkhir. \" And \nAbu Huraira narrated that the Prophet (ﷺ) said, \"Except Al-Idhkhir for our graves and houses.\" And Ibn \n`Abbas said, \"For their goldsmiths and houses.\""}},{"id":104,"idInBook":104,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ عَمْرٌو سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ أَتَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَبْدَ اللَّهِ بْنَ أُبَىٍّ بَعْدَ مَا أُدْخِلَ حُفْرَتَهُ فَأَمَرَ بِهِ فَأُخْرِجَ، فَوَضَعَهُ عَلَى رُكْبَتَيْهِ، وَنَفَثَ عَلَيْهِ مِنْ رِيقِهِ، وَأَلْبَسَهُ قَمِيصَهُ، فَاللَّهُ أَعْلَمُ، وَكَانَ كَسَا عَبَّاسًا قَمِيصًا‏.‏ قَالَ سُفْيَانُ وَقَالَ أَبُو هَارُونَ وَكَانَ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم قَمِيصَانِ، فَقَالَ لَهُ ابْنُ عَبْدِ اللَّهِ يَا رَسُولَ اللَّهِ، أَلْبِسْ أَبِي قَمِيصَكَ الَّذِي يَلِي جِلْدَكَ‏.‏ قَالَ سُفْيَانُ فَيُرَوْنَ أَنَّ النَّبِيَّ صلى الله عليه وسلم أَلْبَسَ عَبْدَ اللَّهِ قَمِيصَهُ مُكَافَأَةً لِمَا صَنَعَ‏.‏","english":{"narrator":"Narrated Jabir bin `Abdullah:","text":"Allah's Messenger (ﷺ) came to `Abdullah bin Ubai (a hypocrite) after his death and he has been laid in his pit \n(grave). He ordered (that he be taken out of the grave) and he was taken out. Then he placed him on \nhis knees and threw some of his saliva on him and clothed him in his (the Prophet's) own shirt. Allah \nknows better (why he did so). `Abdullah bin Ubai had given his shirt to Al-Abbas to wear. Abu Harun \nsaid, \"Allah's Messenger (ﷺ) at that time had two shirts and the son of `Abdullah bin Ubai said to him, 'O \nAllah's Messenger (ﷺ)! Clothe my father in your shirt which has been in contact with your skin.' ' Sufyan \nadded, \"Thus people think that the Prophet (ﷺ) clothed `Abdullah bin Tubal in his shirt in lieu of what he \n(Abdullah) had done (for Al `Abbas, the Prophet's uncle.)\""}},{"id":105,"idInBook":105,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا مُسَدَّدٌ، أَخْبَرَنَا بِشْرُ بْنُ الْمُفَضَّلِ، حَدَّثَنَا حُسَيْنٌ الْمُعَلِّمُ، عَنْ عَطَاءٍ، عَنْ جَابِرٍ ـ رضى الله عنه ـ قَالَ لَمَّا حَضَرَ أُحُدٌ دَعَانِي أَبِي مِنَ اللَّيْلِ فَقَالَ مَا أُرَانِي إِلاَّ مَقْتُولاً فِي أَوَّلِ مَنْ يُقْتَلُ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم، وَإِنِّي لاَ أَتْرُكُ بَعْدِي أَعَزَّ عَلَىَّ مِنْكَ، غَيْرَ نَفْسِ رَسُولِ اللَّهِ صلى الله عليه وسلم، فَإِنَّ عَلَىَّ دَيْنًا فَاقْضِ، وَاسْتَوْصِ بِأَخَوَاتِكَ خَيْرًا‏.‏ فَأَصْبَحْنَا فَكَانَ أَوَّلَ قَتِيلٍ، وَدُفِنَ مَعَهُ آخَرُ فِي قَبْرٍ، ثُمَّ لَمْ تَطِبْ نَفْسِي أَنْ أَتْرُكَهُ مَعَ الآخَرِ فَاسْتَخْرَجْتُهُ بَعْدَ سِتَّةِ أَشْهُرٍ، فَإِذَا هُوَ كَيَوْمِ وَضَعْتُهُ هُنَيَّةً غَيْرَ أُذُنِهِ‏.‏","english":{"narrator":"Narrated Jabir:","text":"When the time of the Battle of Uhud approached, my father called me at night and said, \"I think that I \nwill be the first amongst the companions of the Prophet (ﷺ) to be martyred. I do not leave anyone after me \ndearer to me than you, except Allah's Messenger (ﷺ)'s soul and I owe some debt and you should repay it and \ntreat your sisters favorably (nicely and politely).\" So in the morning he was the first to be martyred \nand was buried along with another (martyr). I did not like to leave him with the other (martyr) so I \ntook him out of the grave after six months of his burial and he was in the same condition as he was on \nthe day of burial, except a slight change near his ear."}},{"id":106,"idInBook":106,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سَعِيدُ بْنُ عَامِرٍ، عَنْ شُعْبَةَ، عَنِ ابْنِ أَبِي نَجِيحٍ، عَنْ عَطَاءٍ، عَنْ جَابِرٍ ـ رضى الله عنه ـ قَالَ دُفِنَ مَعَ أَبِي رَجُلٌ فَلَمْ تَطِبْ نَفْسِي حَتَّى أَخْرَجْتُهُ فَجَعَلْتُهُ فِي قَبْرٍ عَلَى حِدَةٍ‏.‏","english":{"narrator":"Narrated Jabir:","text":"A man was buried along with my father and I did not like it till I took him (i.e. my father) out and \nburied him in a separate grave."}},{"id":107,"idInBook":107,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا اللَّيْثُ بْنُ سَعْدٍ، قَالَ حَدَّثَنِي ابْنُ شِهَابٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَعْبِ بْنِ مَالِكٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَجْمَعُ بَيْنَ رَجُلَيْنِ مِنْ قَتْلَى أُحُدٍ ثُمَّ يَقُولُ ‏\"‏ أَيُّهُمْ أَكْثَرُ أَخْذًا لِلْقُرْآنِ ‏\"‏‏.‏ فَإِذَا أُشِيرَ لَهُ إِلَى أَحَدِهِمَا قَدَّمَهُ فِي اللَّحْدِ فَقَالَ ‏\"‏ أَنَا شَهِيدٌ عَلَى هَؤُلاَءِ يَوْمَ الْقِيَامَةِ ‏\"‏‏.‏ فَأَمَرَ بِدَفْنِهِمْ بِدِمَائِهِمْ وَلَمْ يُغَسِّلْهُمْ‏.‏","english":{"narrator":"Narrated Jabir bin `Abdullah:","text":"The Prophet (ﷺ) collected every two martyrs of Uhud (in one grave) and then he would ask, \"Which of \nthem knew the Qur'an more?\" And if one of them was pointed out for him as having more knowledge, \nhe would put him first in the Lahd. The Prophet (ﷺ) said, \"I will be a witness on these on the Day of \nResurrection.\" Then he ordered them to be buried with their blood on their bodies and he did not have \nthem washed."}},{"id":108,"idInBook":108,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، عَنْ يُونُسَ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ، أَنَّ ابْنَ عُمَرَ ـ رضى الله عنهما ـ أَخْبَرَهُ أَنَّ عُمَرَ انْطَلَقَ مَعَ النَّبِيِّ صلى الله عليه وسلم فِي رَهْطٍ قِبَلَ ابْنِ صَيَّادٍ، حَتَّى وَجَدُوهُ يَلْعَبُ مَعَ الصِّبْيَانِ عِنْدَ أُطُمِ بَنِي مَغَالَةَ، وَقَدْ قَارَبَ ابْنُ صَيَّادٍ الْحُلُمَ فَلَمْ يَشْعُرْ حَتَّى ضَرَبَ النَّبِيُّ صلى الله عليه وسلم بِيَدِهِ ثُمَّ قَالَ لاِبْنِ صَيَّادٍ ‏\"‏ تَشْهَدُ أَنِّي رَسُولُ اللَّهِ ‏\"‏‏.‏ فَنَظَرَ إِلَيْهِ ابْنُ صَيَّادٍ فَقَالَ أَشْهَدُ أَنَّكَ رَسُولُ الأُمِّيِّينَ‏.‏ فَقَالَ ابْنُ صَيَّادٍ لِلنَّبِيِّ صلى الله عليه وسلم أَتَشْهَدُ أَنِّي رَسُولُ اللَّهِ فَرَفَضَهُ وَقَالَ آمَنْتُ بِاللَّهِ وَبِرُسُلِهِ‏.‏ فَقَالَ لَهُ ‏\"‏ مَاذَا تَرَى ‏\"‏‏.‏ قَالَ ابْنُ صَيَّادٍ يَأْتِينِي صَادِقٌ وَكَاذِبٌ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ خُلِّطَ عَلَيْكَ الأَمْرُ ‏\"‏ ثُمَّ قَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنِّي قَدْ خَبَأْتُ لَكَ خَبِيئًا ‏\"‏‏.‏ فَقَالَ ابْنُ صَيَّادٍ هُوَ الدُّخُّ‏.‏ فَقَالَ ‏\"‏ اخْسَأْ، فَلَنْ تَعْدُوَ قَدْرَكَ ‏\"‏‏.‏ فَقَالَ عُمَرُ ـ رضى الله عنه ـ دَعْنِي يَا رَسُولَ اللَّهِ أَضْرِبْ عُنُقَهُ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنْ يَكُنْهُ فَلَنْ تُسَلَّطَ عَلَيْهِ، وَإِنْ لَمْ يَكُنْهُ فَلاَ خَيْرَ لَكَ فِي قَتْلِهِ ‏\"‏‏.‏   وَقَالَ سَالِمٌ سَمِعْتُ ابْنَ عُمَرَ ـ رضى الله عنهما ـ يَقُولُ انْطَلَقَ بَعْدَ ذَلِكَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأُبَىُّ بْنُ كَعْبٍ إِلَى النَّخْلِ الَّتِي فِيهَا ابْنُ صَيَّادٍ وَهُوَ يَخْتِلُ أَنْ يَسْمَعَ مِنِ ابْنِ صَيَّادٍ شَيْئًا قَبْلَ أَنْ يَرَاهُ ابْنُ صَيَّادٍ فَرَآهُ النَّبِيُّ صلى الله عليه وسلم وَهُوَ مُضْطَجِعٌ، يَعْنِي فِي قَطِيفَةٍ لَهُ فِيهَا رَمْزَةٌ أَوْ زَمْرَةٌ، فَرَأَتْ أُمُّ ابْنِ صَيَّادٍ رَسُولَ اللَّهِ صلى الله عليه وسلم وَهُوَ يَتَّقِي بِجُذُوعِ النَّخْلِ فَقَالَتْ لاِبْنِ صَيَّادٍ يَا صَافِ ـ وَهْوَ اسْمُ ابْنِ صَيَّادٍ ـ هَذَا مُحَمَّدٌ صلى الله عليه وسلم‏.‏ فَثَارَ ابْنُ صَيَّادٍ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لَوْ تَرَكَتْهُ بَيَّنَ ‏\"‏‏.‏ وَقَالَ شُعَيْبٌ فِي حَدِيثِهِ فَرَفَصَهُ رَمْرَمَةٌ، أَوْ زَمْزَمَةٌ‏.‏ وَقَالَ إِسْحَاقُ الْكَلْبِيُّ وَعُقَيْلٌ رَمْرَمَةٌ‏.‏ وَقَالَ مَعْمَرٌ رَمْزَةٌ‏.‏","english":{"narrator":"Narrated Ibn `Umar:","text":"`Umar set out along with the Prophet (p.b.u.h) with a group of people to Ibn Saiyad till they saw him \nplaying with the boys near the hillocks of Bani Mughala. Ibn Saiyad at that time was nearing his \npuberty and did not notice (us) until the Prophet (ﷺ) stroked him with his hand and said to him, \"Do you \ntestify that I am Allah's Messenger (ﷺ)?\" Ibn Saiyad looked at him and said, \"I testify that you are the \nMessenger of illiterates.\" Then Ibn Saiyad asked the Prophet (p.b.u.h), \"Do you testify that I am \nAllah's Messenger (ﷺ)?\" The Prophet (p.b.u.h) refuted it and said, \"I believe in Allah and His Apostles.\" \nThen he said (to Ibn Saiyad), \"What do you think?\" Ibn Saiyad answered, \"True people and liars visit \nme.\" The Prophet (ﷺ) said, \"You have been confused as to this matter.\" Then the Prophet (ﷺ) said to him, \"I \nhave kept something (in my mind) for you, (can you tell me that?)\" Ibn Saiyad said, \"It is Al-Dukh \n(the smoke).\" (2) The Prophet (ﷺ) said, \"Let you be in ignominy. You cannot cross your limits.\" On that \n`Umar, said, \"O Allah's Messenger (ﷺ)! Allow me to chop his head off.\" The Prophet (p.b.u.h) said, \"If he is \nhe (i.e. Dajjal), then you cannot overpower him, and if he is not, then there is no use of murdering \nhim.\" (Ibn `Umar added): Later on Allah's Messenger (ﷺ) (p.b.u.h) once again went along with Ubai bin \nKa`b to the date-palm trees (garden) where Ibn Saiyad was staying. The Prophet (p.b.u.h) wanted to \nhear something from Ibn Saiyad before Ibn Saiyad could see him, and the Prophet (p.b.u.h) saw him \nlying covered with a sheet and from where his murmurs were heard. Ibn Saiyad's mother saw Allah's \nApostle while he was hiding himself behind the trunks of the date-palm trees. She addressed Ibn \nSaiyad, \"O Saf ! (and this was the name of Ibn Saiyad) Here is Muhammad.\" And with that Ibn Saiyad \ngot up. The Prophet (ﷺ) said, \"Had this woman left him (Had she not disturbed him), then Ibn Saiyad \nwould have revealed the reality of his case."}},{"id":109,"idInBook":109,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادٌ ـ وَهْوَ ابْنُ زَيْدٍ ـ عَنْ ثَابِتٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ كَانَ غُلاَمٌ يَهُودِيٌّ يَخْدُمُ النَّبِيَّ صلى الله عليه وسلم فَمَرِضَ، فَأَتَاهُ النَّبِيُّ صلى الله عليه وسلم يَعُودُهُ، فَقَعَدَ عِنْدَ رَأْسِهِ فَقَالَ لَهُ ‏\"‏ أَسْلِمْ ‏\"‏‏.‏ فَنَظَرَ إِلَى أَبِيهِ وَهْوَ عِنْدَهُ فَقَالَ لَهُ أَطِعْ أَبَا الْقَاسِمِ صلى الله عليه وسلم‏.‏ فَأَسْلَمَ، فَخَرَجَ النَّبِيُّ صلى الله عليه وسلم وَهْوَ يَقُولُ ‏\"‏ الْحَمْدُ لِلَّهِ الَّذِي أَنْقَذَهُ مِنَ النَّارِ ‏\"‏‏.‏","english":{"narrator":"Narrated Anas:","text":"A young Jewish boy used to serve the Prophet (ﷺ) and he became sick. So the Prophet (ﷺ) went to visit him. \nHe sat near his head and asked him to embrace Islam. The boy looked at his father, who was sitting \nthere; the latter told him to obey Abul-Qasim and the boy embraced Islam. The Prophet (ﷺ) came out \nsaying: \"Praises be to Allah Who saved the boy from the Hell-fire.\""}},{"id":110,"idInBook":110,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ قَالَ عُبَيْدُ اللَّهِ سَمِعْتُ ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ يَقُولُ كُنْتُ أَنَا وَأُمِّي، مِنَ الْمُسْتَضْعَفِينَ أَنَا مِنَ الْوِلْدَانِ، وَأُمِّي، مِنَ النِّسَاءِ‏.‏","english":{"narrator":"Narrated Ibn `Abbas:","text":"My mother and I were among the weak and oppressed. I from among the children, and my mother \nfrom among the women."}},{"id":111,"idInBook":111,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، قَالَ ابْنُ شِهَابٍ يُصَلَّى عَلَى كُلِّ مَوْلُودٍ مُتَوَفًّى وَإِنْ كَانَ لِغَيَّةٍ، مِنْ أَجْلِ أَنَّهُ وُلِدَ عَلَى فِطْرَةِ الإِسْلاَمِ، يَدَّعِي أَبَوَاهُ الإِسْلاَمَ أَوْ أَبُوهُ خَاصَّةً، وَإِنْ كَانَتْ أُمُّهُ عَلَى غَيْرِ الإِسْلاَمِ، إِذَا اسْتَهَلَّ صَارِخًا صُلِّيَ عَلَيْهِ، وَلاَ يُصَلَّى عَلَى مَنْ لاَ يَسْتَهِلُّ مِنْ أَجْلِ أَنَّهُ سِقْطٌ، فَإِنَّ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ كَانَ يُحَدِّثُ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ مَا مِنْ مَوْلُودٍ إِلاَّ يُولَدُ عَلَى الْفِطْرَةِ، فَأَبَوَاهُ يُهَوِّدَانِهِ أَوْ يُنَصِّرَانِهِ أَوْ يُمَجِّسَانِهِ، كَمَا تُنْتَجُ الْبَهِيمَةُ بَهِيمَةً جَمْعَاءَ هَلْ تُحِسُّونَ فِيهَا مِنْ جَدْعَاءَ ‏\"‏‏.‏ ثُمَّ يَقُولُ أَبُو هُرَيْرَةَ ـ رضى الله عنه – ‏{‏فِطْرَةَ اللَّهِ الَّتِي فَطَرَ النَّاسَ عَلَيْهَا‏}‏ الآيَةَ‏.‏","english":{"narrator":"Narrated Ibn Shihab:","text":"The funeral prayer should be offered for every child even if he were the son of a prostitute as he was \nborn with a true faith of Islam (i.e. to worship none but Allah Alone). If his parents are Muslims, \nparticularly the father, even if his mother were a non-Muslim, and if he after the delivery cries (even \nonce) before his death (i.e. born alive) then the funeral prayer must be offered. And if the child does \nnot cry after his delivery (i.e. born dead) then his funeral prayer should not be offered, and he will be \nconsidered as a miscarriage. Abu Huraira, narrated that the Prophet (ﷺ) said, \"Every child is born with a \ntrue faith (i.e. to worship none but Allah Alone) but his parents convert him to Judaism or to \nChristianity or to Magainism, as an animal delivers a perfect baby animal. Do you find it mutilated?\" \nThen Abu Huraira recited the holy verses: 'The pure Allah's Islamic nature (true faith i.e. to worship \nnone but Allah Alone), with which He has created human beings.' \" (30.30)."}},{"id":112,"idInBook":112,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا مِنْ مَوْلُودٍ إِلاَّ يُولَدُ عَلَى الْفِطْرَةِ، فَأَبَوَاهُ يُهَوِّدَانِهِ أَوْ يُنَصِّرَانِهِ أَوْ يُمَجِّسَانِهِ، كَمَا تُنْتَجُ الْبَهِيمَةُ بَهِيمَةً جَمْعَاءَ، هَلْ تُحِسُّونَ فِيهَا مِنْ جَدْعَاءَ ‏\"‏‏.‏ ثُمَّ يَقُولُ أَبُو هُرَيْرَةَ ـ رضى الله عنه ‏{‏فِطْرَةَ اللَّهِ الَّتِي فَطَرَ النَّاسَ عَلَيْهَا لاَ تَبْدِيلَ لِخَلْقِ اللَّهِ ذَلِكَ الدِّينُ الْقَيِّمُ‏}‏","english":{"narrator":"Narrated Abu Huraira:","text":"Allah's Messenger (ﷺ) said, \"Every child is born with a true faith of Islam (i.e. to worship none but Allah \nAlone) but his parents convert him to Judaism, Christianity or Magainism, as an animal delivers a \nperfect baby animal. Do you find it mutilated?\" Then Abu Huraira recited the holy verses: \"The pure \nAllah's Islamic nature (true faith of Islam) (i.e. worshipping none but Allah) with which He has \ncreated human beings. No change let there be in the religion of Allah (i.e. joining none in worship \nwith Allah). That is the straight religion (Islam) but most of men know, not.\" (30.30)"}},{"id":113,"idInBook":113,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا إِسْحَاقُ، أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنِي أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، عَنْ أَبِيهِ، أَنَّهُ أَخْبَرَهُ أَنَّهُ، لَمَّا حَضَرَتْ أَبَا طَالِبٍ الْوَفَاةُ جَاءَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم فَوَجَدَ عِنْدَهُ أَبَا جَهْلِ بْنَ هِشَامٍ، وَعَبْدَ اللَّهِ بْنَ أَبِي أُمَيَّةَ بْنِ الْمُغِيرَةِ، قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لأَبِي طَالِبٍ ‏\"‏ يَا عَمِّ، قُلْ لاَ إِلَهَ إِلاَّ اللَّهُ، كَلِمَةً أَشْهَدُ لَكَ بِهَا عِنْدَ اللَّهِ ‏\"‏‏.‏ فَقَالَ أَبُو جَهْلٍ وَعَبْدُ اللَّهِ بْنُ أَبِي أُمَيَّةَ يَا أَبَا طَالِبٍ، أَتَرْغَبُ عَنْ مِلَّةِ عَبْدِ الْمُطَّلِبِ فَلَمْ يَزَلْ رَسُولُ اللَّهِ صلى الله عليه وسلم يَعْرِضُهَا عَلَيْهِ، وَيَعُودَانِ بِتِلْكَ الْمَقَالَةِ، حَتَّى قَالَ أَبُو طَالِبٍ آخِرَ مَا كَلَّمَهُمْ هُوَ عَلَى مِلَّةِ عَبْدِ الْمُطَّلِبِ، وَأَبَى أَنْ يَقُولَ لاَ إِلَهَ إِلاَّ اللَّهُ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَمَا وَاللَّهِ لأَسْتَغْفِرَنَّ لَكَ، مَا لَمْ أُنْهَ عَنْكَ ‏\"‏‏.‏ فَأَنْزَلَ اللَّهُ تَعَالَى فِيهِ ‏{‏مَا كَانَ لِلنَّبِيِّ‏}‏ الآيَةَ‏.‏","english":{"narrator":"Narrated Sa`id bin Al-Musaiyab from his father:","text":"When the time of the death of Abu Talib approached, Allah's Messenger (ﷺ) went to him and found Abu Jahl \nbin Hisham and `Abdullah bin Abi Umaiya bin Al-Mughira by his side. Allah's Messenger (ﷺ) said to Abu \nTalib, \"O uncle! Say: None has the right to be worshipped but Allah, a sentence with which I shall be \na witness (i.e. argue) for you before Allah. Abu Jahl and `Abdullah bin Abi Umaiya said, \"O Abu \nTalib! Are you going to denounce the religion of `Abdul Muttalib?\" Allah's Messenger (ﷺ) kept on inviting \nAbu Talib to say it (i.e. 'None has the right to be worshipped but Allah') while they (Abu Jahl and \n`Abdullah) kept on repeating their statement till Abu Talib said as his last statement that he was on the \nreligion of `Abdul Muttalib and refused to say, 'None has the right to be worshipped but Allah.' (Then \nAllah's Messenger (ﷺ) said, \"I will keep on asking Allah's forgiveness for you unless I am forbidden (by \nAllah) to do so.\" So Allah revealed (the verse) concerning him (i.e. It is not fitting for the Prophet (ﷺ) and \nthose who believe that they should invoke (Allah) for forgiveness for pagans even though they be of \nkin, after it has become clear to them that they are companions of the fire (9.113)."}},{"id":114,"idInBook":114,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا يَحْيَى، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ مُجَاهِدٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ مَرَّ بِقَبْرَيْنِ يُعَذَّبَانِ فَقَالَ ‏\"‏ إِنَّهُمَا لَيُعَذَّبَانِ وَمَا يُعَذَّبَانِ فِي كَبِيرٍ أَمَّا أَحَدُهُمَا فَكَانَ لاَ يَسْتَتِرُ مِنَ الْبَوْلِ، وَأَمَّا الآخَرُ فَكَانَ يَمْشِي بِالنَّمِيمَةِ ‏\"‏‏.‏ ثُمَّ أَخَذَ جَرِيدَةً رَطْبَةً فَشَقَّهَا بِنِصْفَيْنِ، ثُمَّ غَرَزَ فِي كُلِّ قَبْرٍ وَاحِدَةً‏.‏ فَقَالُوا يَا رَسُولَ اللَّهِ، لِمَ صَنَعْتَ هَذَا فَقَالَ ‏\"‏ لَعَلَّهُ أَنْ يُخَفَّفَ عَنْهُمَا مَا لَمْ يَيْبَسَا ‏\"‏‏.‏","english":{"narrator":"Narrated Ibn `Abbas:","text":"The Prophet (ﷺ) once passed by two graves, and those two persons (in the graves) were being tortured. He \nsaid, \"They are being tortured not for a great thing (to avoid). One of them never saved himself from \nbeing soiled with his urine, while the other went about committing slander (to make enmity between \nfriends). He then took a green leaf of a date-palm tree split it into two pieces and fixed one on each \ngrave. The people said, \"O Allah's Messenger (ﷺ)! Why have you done so?\" He replied, \"I hope that their \npunishment may be lessened till they (the leaf) become dry.\""}},{"id":115,"idInBook":115,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا عُثْمَانُ، قَالَ حَدَّثَنِي جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ سَعْدِ بْنِ عُبَيْدَةَ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ عَلِيٍّ ـ رضى الله عنه ـ قَالَ كُنَّا فِي جَنَازَةٍ فِي بَقِيعِ الْغَرْقَدِ، فَأَتَانَا النَّبِيُّ صلى الله عليه وسلم فَقَعَدَ وَقَعَدْنَا حَوْلَهُ، وَمَعَهُ مِخْصَرَةٌ فَنَكَّسَ، فَجَعَلَ يَنْكُتُ بِمِخْصَرَتِهِ ثُمَّ قَالَ ‏\"‏ مَا مِنْكُمْ مِنْ أَحَدٍ، مَا مِنْ نَفْسٍ مَنْفُوسَةٍ إِلاَّ كُتِبَ مَكَانُهَا مِنَ الْجَنَّةِ وَالنَّارِ، وَإِلاَّ قَدْ كُتِبَ شَقِيَّةً أَوْ سَعِيدَةً ‏\"‏‏.‏ فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ، أَفَلاَ نَتَّكِلُ عَلَى كِتَابِنَا وَنَدَعُ الْعَمَلَ، فَمَنْ كَانَ مِنَّا مِنْ أَهْلِ السَّعَادَةِ فَسَيَصِيرُ إِلَى عَمَلِ أَهْلِ السَّعَادَةِ، وَأَمَّا مَنْ كَانَ مِنَّا مِنْ أَهْلِ الشَّقَاوَةِ فَسَيَصِيرُ إِلَى عَمَلِ أَهْلِ الشَّقَاوَةِ قَالَ ‏\"‏ أَمَّا أَهْلُ السَّعَادَةِ فَيُيَسَّرُونَ لِعَمَلِ السَّعَادَةِ، وَأَمَّا أَهْلُ الشَّقَاوَةِ فَيُيَسَّرُونَ لِعَمَلِ الشَّقَاوَةِ ‏\"‏، ثُمَّ قَرَأَ ‏{‏فَأَمَّا مَنْ أَعْطَى وَاتَّقَى‏}‏ الآيَةَ‏.‏","english":{"narrator":"Narrated `Ali:","text":"\" We were accompanying a funeral procession in Baqi-I-Gharqad. The Prophet (ﷺ) came to us and sat and \nwe sat around him. He had a small stick in his hand then he bent his head and started scraping the \nground with it. He then said, \"There is none among you, and not a created soul, but has place either in \nParadise or in Hell assigned for him and it is also determined for him whether he will be among the \nblessed or wretched.\" A man said, \"O Allah's Messenger (ﷺ)! Should we not depend on what has been \nwritten for us and leave the deeds as whoever amongst us is blessed will do the deeds of a blessed \nperson and whoever amongst us will be wretched, will do the deeds of a wretched person?\" The \nProphet said, \"The good deeds are made easy for the blessed, and bad deeds are made easy for the \nwretched.\" Then he recited the Verses:-- \"As for him who gives (in charity) and is Allah-fearing And \nbelieves in the Best reward from Allah. \" (92.5-6)"}},{"id":116,"idInBook":116,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا خَالِدٌ، عَنْ أَبِي قِلاَبَةَ، عَنْ ثَابِتِ بْنِ الضَّحَّاكِ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَنْ حَلَفَ بِمِلَّةٍ غَيْرِ الإِسْلاَمِ كَاذِبًا مُتَعَمِّدًا فَهُوَ كَمَا قَالَ، وَمَنْ قَتَلَ نَفْسَهُ بِحَدِيدَةٍ عُذِّبَ بِهِ فِي نَارِ جَهَنَّمَ ‏\"‏‏.‏   وَقَالَ حَجَّاجُ بْنُ مِنْهَالٍ حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ، عَنِ الْحَسَنِ، حَدَّثَنَا جُنْدَبٌ ـ رضى الله عنه ـ فِي هَذَا الْمَسْجِدِ فَمَا نَسِينَا، وَمَا نَخَافُ أَنْ يَكْذِبَ جُنْدَبٌ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ كَانَ بِرَجُلٍ جِرَاحٌ فَقَتَلَ نَفْسَهُ فَقَالَ اللَّهُ بَدَرَنِي عَبْدِي بِنَفْسِهِ حَرَّمْتُ عَلَيْهِ الْجَنَّةَ ‏\"‏‏.‏","english":{"narrator":"Narrated Thabit bin Ad-Dahhak:","text":"The Prophet (p.b.u.h) said, \"Whoever intentionally swears falsely by a religion other than Islam, then \nhe is what he has said, (e.g. if he says, 'If such thing is not true then I am a Jew,' he is really a Jew). \nAnd whoever commits suicide with piece of iron will be punished with the same piece of iron in the \nHell Fire.\" Narrated Jundab the Prophet (ﷺ) said, \"A man was inflicted with wounds and he committed \nsuicide, and so Allah said: My slave has caused death on himself hurriedly, so I forbid Paradise for \nhim.\""}},{"id":117,"idInBook":117,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ الَّذِي يَخْنُقُ نَفْسَهُ يَخْنُقُهَا فِي النَّارِ، وَالَّذِي يَطْعُنُهَا يَطْعُنُهَا فِي النَّارِ ‏\"‏‏.‏","english":{"narrator":"Narrated Abu Huraira-:","text":"The Prophet (ﷺ) said, \"He who commits suicide by throttling shall keep on throttling himself in the Hell \nFire (forever) and he who commits suicide by stabbing himself shall keep on stabbing himself in the \nHell-Fire.\""}},{"id":118,"idInBook":118,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنِي اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، عَنْ عُمَرَ بْنِ الْخَطَّابِ ـ رضى الله عنهم ـ أَنَّهُ قَالَ لَمَّا مَاتَ عَبْدُ اللَّهِ بْنُ أُبَىٍّ ابْنُ سَلُولَ دُعِيَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم لِيُصَلِّيَ عَلَيْهِ، فَلَمَّا قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَثَبْتُ إِلَيْهِ فَقُلْتُ يَا رَسُولَ اللَّهِ، أَتُصَلِّي عَلَى ابْنِ أُبَىٍّ وَقَدْ قَالَ يَوْمَ كَذَا وَكَذَا كَذَا وَكَذَا ـ أُعَدِّدُ عَلَيْهِ قَوْلَهُ ـ فَتَبَسَّمَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَالَ ‏\"‏ أَخِّرْ عَنِّي يَا عُمَرُ ‏\"‏‏.‏ فَلَمَّا أَكْثَرْتُ عَلَيْهِ قَالَ ‏\"‏ إِنِّي خُيِّرْتُ فَاخْتَرْتُ، لَوْ أَعْلَمُ أَنِّي إِنْ زِدْتُ عَلَى السَّبْعِينَ فَغُفِرَ لَهُ لَزِدْتُ عَلَيْهَا ‏\"‏‏.‏ قَالَ فَصَلَّى عَلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ انْصَرَفَ، فَلَمْ يَمْكُثْ إِلاَّ يَسِيرًا حَتَّى نَزَلَتِ الآيَتَانِ مِنْ ‏{‏بَرَاءَةٌ‏}‏ ‏{‏وَلاَ تُصَلِّ عَلَى أَحَدٍ مِنْهُمْ مَاتَ أَبَدًا‏}‏ إِلَى ‏{‏وَهُمْ فَاسِقُونَ‏}‏ قَالَ فَعَجِبْتُ بَعْدُ مِنْ جُرْأَتِي عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم يَوْمَئِذٍ، وَاللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏","english":{"narrator":"Narrated `Umar bin Al-Khattab:","text":"When `Abdullah bin Ubai bin Salul died, Allah's Messenger (ﷺ) (p.b.u.h) was called upon to offer his funeral \nprayer. When Allah's Messenger (ﷺ) stood up to offer the prayer, I got up quickly and said, \"O Allah's \nApostle! Are you going to pray for Ibn Ubai and he said so and so on such and such occasions?\" And \nstarted mentioning all that he had said. Allah's Messenger (ﷺ) smiled and said, \"O `Umar! Go away from \nme.\" When I talked too much he said, \"I have been given the choice and so I have chosen (to offer the \nprayer). Had I known that he would be forgiven by asking for Allah's forgiveness for more than \nseventy times, surely I would have done so.\" (`Umar added): Allah's Messenger (ﷺ) offered his funeral \nprayer and returned and after a short while the two verses of Surat Bara' were revealed: i.e. \"And \nnever (O Muhammad) pray for any of them who dies . . . (to the end of the verse) rebellion (9.84)\" -- \n(`Umar added), \"Later I astonished at my daring before Allah's Messenger (ﷺ) on that day. And Allah and \nHis Apostle know better.\""}},{"id":119,"idInBook":119,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ صُهَيْبٍ، قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ ـ رضى الله عنه ـ يَقُولُ مَرُّوا بِجَنَازَةٍ فَأَثْنَوْا عَلَيْهَا خَيْرًا، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ وَجَبَتْ ‏\"‏‏.‏ ثُمَّ مَرُّوا بِأُخْرَى فَأَثْنَوْا عَلَيْهَا شَرًّا فَقَالَ ‏\"‏ وَجَبَتْ ‏\"‏‏.‏ فَقَالَ عُمَرُ بْنُ الْخَطَّابِ ـ رضى الله عنه ـ مَا وَجَبَتْ قَالَ ‏\"‏ هَذَا أَثْنَيْتُمْ عَلَيْهِ خَيْرًا فَوَجَبَتْ لَهُ الْجَنَّةُ، وَهَذَا أَثْنَيْتُمْ عَلَيْهِ شَرًّا فَوَجَبَتْ لَهُ النَّارُ، أَنْتُمْ شُهَدَاءُ اللَّهِ فِي الأَرْضِ ‏\"‏‏.‏","english":{"narrator":"Narrated Anas bin Malik:","text":"A funeral procession passed and the people praised the deceased. The Prophet (ﷺ) said, \"It has been \naffirmed to him.\" Then another funeral procession passed and the people spoke badly of the deceased. \nThe Prophet (ﷺ) said, \"It has been affirmed to him\". `Umar bin Al-Khattab asked (Allah's Messenger (ﷺ) \n(p.b.u.h) ), \"What has been affirmed?\" He replied, \"You praised this, so Paradise has been affirmed to \nhim; and you spoke badly of this, so Hell has been affirmed to him. You people are Allah's witnesses \non earth.\""}},{"id":120,"idInBook":120,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا عَفَّانُ بْنُ مُسْلِمٍ، حَدَّثَنَا دَاوُدُ بْنُ أَبِي الْفُرَاتِ، عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، عَنْ أَبِي الأَسْوَدِ، قَالَ قَدِمْتُ الْمَدِينَةَ وَقَدْ وَقَعَ بِهَا مَرَضٌ، فَجَلَسْتُ إِلَى عُمَرَ بْنِ الْخَطَّابِ ـ رضى الله عنه ـ فَمَرَّتْ بِهِمْ جَنَازَةٌ فَأُثْنِيَ عَلَى صَاحِبِهَا خَيْرًا فَقَالَ عُمَرُ ـ رضى الله عنه ـ وَجَبَتْ‏.‏ ثُمَّ مُرَّ بِأُخْرَى فَأُثْنِيَ عَلَى صَاحِبِهَا خَيْرًا، فَقَالَ عُمَرُ ـ رضى الله عنه ـ وَجَبَتْ‏.‏ ثُمَّ مُرَّ بِالثَّالِثَةِ، فَأُثْنِيَ عَلَى صَاحِبِهَا شَرًّا فَقَالَ وَجَبَتْ‏.‏ فَقَالَ أَبُو الأَسْوَدِ فَقُلْتُ وَمَا وَجَبَتْ يَا أَمِيرَ الْمُؤْمِنِينَ قَالَ قُلْتُ كَمَا قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَيُّمَا مُسْلِمٍ شَهِدَ لَهُ أَرْبَعَةٌ بِخَيْرٍ أَدْخَلَهُ اللَّهُ الْجَنَّةَ ‏\"‏‏.‏ فَقُلْنَا وَثَلاَثَةٌ قَالَ ‏\"‏ وَثَلاَثَةٌ ‏\"‏‏.‏ فَقُلْنَا وَاثْنَانِ قَالَ ‏\"‏ وَاثْنَانِ ‏\"‏‏.‏ ثُمَّ لَمْ نَسْأَلْهُ عَنِ الْوَاحِدِ‏.‏","english":{"narrator":"Narrated Abu Al-Aswad:","text":"I came to Medina when an epidemic had broken out. While I was sitting with `Umar bin Al-Khattab a \nfuneral procession passed by and the people praised the deceased. `Umar said, \"It has been affirmed to \nhim.\" And another funeral procession passed by and the people praised the deceased. `Umar said, \"It \nhas been affirmed to him.\" A third (funeral procession) passed by and the people spoke badly of the \ndeceased. He said, \"It has been affirmed to him.\" I (Abu Al-Aswad) asked, \"O chief of the believers! \nWhat has been affirmed?\" He replied, \"I said the same as the Prophet (ﷺ) had said, that is: if four persons \ntestify the piety of a Muslim, Allah will grant him Paradise.\" We asked, \"If three persons testify his \npiety?\" He (the Prophet) replied, \"Even three.\" Then we asked, \"If two?\" He replied, \"Even two.\" We \ndid not ask him regarding one witness."}},{"id":121,"idInBook":121,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا حَفْصُ بْنُ عُمَرَ، حَدَّثَنَا شُعْبَةُ، عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ، عَنْ سَعْدِ بْنِ عُبَيْدَةَ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا أُقْعِدَ الْمُؤْمِنُ فِي قَبْرِهِ أُتِيَ، ثُمَّ شَهِدَ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ، وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، فَذَلِكَ قَوْلُهُ ‏{‏يُثَبِّتُ اللَّهُ الَّذِينَ آمَنُوا بِالْقَوْلِ الثَّابِتِ‏}‏ ‏\"‏‏.‏ حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا غُنْدَرٌ حَدَّثَنَا شُعْبَةُ بِهَذَا وَزَادَ ‏{‏يُثَبِّتُ اللَّهُ الَّذِينَ آمَنُوا‏}‏ نَزَلَتْ فِي عَذَابِ الْقَبْرِ‏.‏","english":{"narrator":"Narrated Al-Bara' bin 'Azib :","text":"The Prophet (p.b.u.h) said, \"When a faithful believer is made to sit \n     in his grave, then (the angels) come to him and he testifies that none\n     has the right to be worshipped but Allah and Muhammad is Allah's \n     Apostle. And that corresponds to Allah's statement: Allah will keep \n     firm those who believe with the word that stands firm . . . (14.27). \n\n\n\n\n\n\n     Narrated Shu'ba:\n\n\n     Same as above and added, \"Allah will keep firm those who believe . . .\n     (14.27) was revealed concerning the punishment of the grave.\""}},{"id":122,"idInBook":122,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنِي أَبِي، عَنْ صَالِحٍ، حَدَّثَنِي نَافِعٌ، أَنَّ ابْنَ عُمَرَ ـ رضى الله عنهما ـ أَخْبَرَهُ قَالَ اطَّلَعَ النَّبِيُّ صلى الله عليه وسلم عَلَى أَهْلِ الْقَلِيبِ فَقَالَ ‏\"‏ وَجَدْتُمْ مَا وَعَدَ رَبُّكُمْ حَقًّا ‏\"‏‏.‏ فَقِيلَ لَهُ تَدْعُو أَمْوَاتًا فَقَالَ ‏\"‏ مَا أَنْتُمْ بِأَسْمَعَ مِنْهُمْ وَلَكِنْ لاَ يُجِيبُونَ ‏\"‏‏.‏","english":{"narrator":"Narrated Ibn `Umar:","text":"The Prophet (ﷺ) looked at the people of the well (the well in which the bodies of the pagans killed in the \nBattle of Badr were thrown) and said, \"Have you found true what your Lord promised you?\" \nSomebody said to him, \"You are addressing dead people.\" He replied, \"You do not hear better than \nthey but they cannot reply.\""}},{"id":123,"idInBook":123,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا سُفْيَانُ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ إِنَّمَا قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّهُمْ لَيَعْلَمُونَ الآنَ أَنَّ مَا كُنْتُ أَقُولُ حَقٌّ وَقَدْ قَالَ اللَّهُ تَعَالَى ‏{‏إِنَّكَ لاَ تُسْمِعُ الْمَوْتَى‏}‏‏\"‏","english":{"narrator":"Narrated `Aisha:","text":"The Prophet (ﷺ) said, \"They now realize that what I used to tell them was the truth. \"And Allah said, \n'Verily! You cannot make the dead to hear (i.e. benefit them, and similarly the disbelievers) nor can \nyou make the deaf hear. (27.80)."}},{"id":124,"idInBook":124,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا عَبْدَانُ، أَخْبَرَنِي أَبِي، عَنْ شُعْبَةَ، سَمِعْتُ الأَشْعَثَ، عَنْ أَبِيهِ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ يَهُودِيَّةً، دَخَلَتْ عَلَيْهَا، فَذَكَرَتْ عَذَابَ الْقَبْرِ، فَقَالَتْ لَهَا أَعَاذَكِ اللَّهُ مِنْ عَذَابِ الْقَبْرِ‏.‏ فَسَأَلَتْ عَائِشَةُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ عَذَابِ الْقَبْرِ فَقَالَ ‏\"‏ نَعَمْ عَذَابُ الْقَبْرِ ‏\"‏‏.‏ قَالَتْ عَائِشَةُ ـ رضى الله عنها ـ فَمَا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعْدُ صَلَّى صَلاَةً إِلاَّ تَعَوَّذَ مِنْ عَذَابِ الْقَبْرِ‏.‏ زَادَ غُنْدَرٌ ‏\"‏ عَذَابُ الْقَبْرِ حَقٌّ ‏\"‏‏.‏","english":{"narrator":"Narrated Masruq:","text":"`Aisha said that a Jewess came to her and mentioned the punishment in the grave, saying to her, \"May \nAllah protect you from the punishment of the grave.\" `Aisha then asked Allah's Messenger (ﷺ) about the \npunishment of the grave. He said, \"Yes, (there is) punishment in the grave.\" `Aisha added, \"After that \nI never saw Allah's Messenger (ﷺ) but seeking refuge with Allah from the punishment in the grave in every \nprayer he prayed.\""}},{"id":125,"idInBook":125,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانَ، حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّهُ سَمِعَ أَسْمَاءَ بِنْتَ أَبِي بَكْرٍ ـ رضى الله عنهما ـ تَقُولُ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم خَطِيبًا فَذَكَرَ فِتْنَةَ الْقَبْرِ الَّتِي يَفْتَتِنُ فِيهَا الْمَرْءُ، فَلَمَّا ذَكَرَ ذَلِكَ ضَجَّ الْمُسْلِمُونَ ضَجَّةً‏.‏","english":{"narrator":"Narrated Asma' bint Abi Bakr:","text":"Allah's Messenger (ﷺ) once stood up delivering a sermon and mentioned the trial which people will face in \nthe grave. When he mentioned that, the Muslims started shouting loudly."}},{"id":126,"idInBook":126,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا عَيَّاشُ بْنُ الْوَلِيدِ، حَدَّثَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ أَنَّهُ حَدَّثَهُمْ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ الْعَبْدَ إِذَا وُضِعَ فِي قَبْرِهِ، وَتَوَلَّى عَنْهُ أَصْحَابُهُ، وَإِنَّهُ لَيَسْمَعُ قَرْعَ نِعَالِهِمْ، أَتَاهُ مَلَكَانِ فَيُقْعِدَانِهِ فَيَقُولاَنِ مَا كُنْتَ تَقُولُ فِي الرَّجُلِ لِمُحَمَّدٍ صلى الله عليه وسلم‏.‏ فَأَمَّا الْمُؤْمِنُ فَيَقُولُ أَشْهَدُ أَنَّهُ عَبْدُ اللَّهِ وَرَسُولُهُ‏.‏ فَيُقَالُ لَهُ انْظُرْ إِلَى مَقْعَدِكَ مِنَ النَّارِ، قَدْ أَبْدَلَكَ اللَّهُ بِهِ مَقْعَدًا مِنَ الْجَنَّةِ، فَيَرَاهُمَا جَمِيعًا ‏\"‏‏.‏ قَالَ قَتَادَةُ وَذُكِرَ لَنَا أَنَّهُ يُفْسَحُ فِي قَبْرِهِ‏.‏ ثُمَّ رَجَعَ إِلَى حَدِيثِ أَنَسٍ قَالَ ‏\"‏ وَأَمَّا الْمُنَافِقُ وَالْكَافِرُ فَيُقَالُ لَهُ مَا كُنْتَ تَقُولُ فِي هَذَا الرَّجُلِ فَيَقُولُ لاَ أَدْرِي، كُنْتُ أَقُولُ مَا يَقُولُ النَّاسُ‏.‏ فَيُقَالُ لاَ دَرَيْتَ وَلاَ تَلَيْتَ‏.‏ وَيُضْرَبُ بِمَطَارِقَ مِنْ حَدِيدٍ ضَرْبَةً، فَيَصِيحُ صَيْحَةً يَسْمَعُهَا مَنْ يَلِيهِ، غَيْرَ الثَّقَلَيْنِ ‏\"‏‏.‏","english":{"narrator":"Narrated Anas bin Malik:","text":"Allah's Messenger (ﷺ) said, \"When (Allah's) slave is put in his grave and his companions return and he even \nhears their footsteps, two angels come to him and make him sit and ask, 'What did you use to say \nabout this man (i.e. Muhammad)?' The faithful Believer will say, 'I testify that he is Allah's slave and \nHis Apostle.' Then they will say to him, 'Look at your place in the Hell Fire; Allah has given you a \nplace in Paradise instead of it.' So he will see both his places.\" (Qatada said, \"We were informed that \nhis grave would be made spacious.\" Then Qatada went back to the narration of Anas who said;) \nWhereas a hypocrite or a non-believer will be asked, \"What did you use to say about this man.\" He \nwill reply, \"I do not know; but I used to say what the people used to say.\" So they will say to him, \n\"Neither did you know nor did you take the guidance (by reciting the Qur'an).\" Then he will be hit \nwith iron hammers once, that he will send such a cry as everything near to him will hear, except Jinns \nand human beings. (See Hadith No. 422)."}},{"id":127,"idInBook":127,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى، حَدَّثَنَا شُعْبَةُ، قَالَ حَدَّثَنِي عَوْنُ بْنُ أَبِي جُحَيْفَةَ، عَنْ أَبِيهِ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، عَنْ أَبِي أَيُّوبَ ـ رضى الله عنهم ـ قَالَ خَرَجَ النَّبِيُّ صلى الله عليه وسلم وَقَدْ وَجَبَتِ الشَّمْسُ، فَسَمِعَ صَوْتًا فَقَالَ ‏\n\"‏ يَهُودُ تُعَذَّبُ فِي قُبُورِهَا ‏\"‏‏.‏   وَقَالَ النَّضْرُ أَخْبَرَنَا شُعْبَةُ، حَدَّثَنَا عَوْنٌ، سَمِعْتُ أَبِي، سَمِعْتُ الْبَرَاءَ، عَنْ أَبِي أَيُّوبَ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏","english":{"narrator":"Narrated Abi Aiyub:","text":"Once the Prophet (ﷺ) went out after sunset and heard a dreadful voice, and said, \"The Jews are being \npunished in their graves.\""}},{"id":128,"idInBook":128,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا مُعَلًّى، حَدَّثَنَا وُهَيْبٌ، عَنْ مُوسَى بْنِ عُقْبَةَ، قَالَ حَدَّثَتْنِي ابْنَةُ خَالِدِ بْنِ سَعِيدِ بْنِ الْعَاصِ، أَنَّهَا سَمِعَتِ النَّبِيَّ صلى الله عليه وسلم وَهُوَ يَتَعَوَّذُ مِنْ عَذَابِ الْقَبْرِ‏.‏","english":{"narrator":"Narrated Musa bin `Uqba:","text":"(From the daughter of Khalid bin Sa id bin Al-`Asi) who said that she had heard the Prophet (ﷺ) seeking \nrefuge with Allah from the punishment in the grave."}},{"id":129,"idInBook":129,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا هِشَامٌ، حَدَّثَنَا يَحْيَى، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَدْعُو ‏\n\"‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، وَمِنْ عَذَابِ النَّارِ، وَمِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، وَمِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ ‏\"‏‏.‏","english":{"narrator":"Narrated Abu Huraira:","text":"Allah's Messenger (ﷺ) used to invoke (Allah): \"Allahumma ini a`udhu bika min 'adhabi-l-Qabr, wa min \n'adhabi-nnar, wa min fitnati-l-mahya wa-lmamat, wa min fitnati-l-masih ad-dajjal. (O Allah! I seek \nrefuge with you from the punishment in the grave and from the punishment in the Hell fire and from \nthe afflictions of life and death, and the afflictions of Al-Masih Ad-Dajjal.\""}},{"id":130,"idInBook":130,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ مُجَاهِدٍ، عَنْ طَاوُسٍ، قَالَ ابْنُ عَبَّاسٍ ـ رضى الله عنهما ـ مَرَّ النَّبِيُّ صلى الله عليه وسلم عَلَى قَبْرَيْنِ فَقَالَ ‏\"‏ إِنَّهُمَا لَيُعَذَّبَانِ، وَمَا يُعَذَّبَانِ مِنْ كَبِيرٍ ـ ثُمَّ قَالَ ـ بَلَى أَمَّا أَحَدُهُمَا فَكَانَ يَسْعَى بِالنَّمِيمَةِ، وَأَمَّا أَحَدُهُمَا فَكَانَ لاَ يَسْتَتِرُ مِنْ بَوْلِهِ ‏\"‏‏.‏ قَالَ ثُمَّ أَخَذَ عُودًا رَطْبًا فَكَسَرَهُ بِاثْنَتَيْنِ ثُمَّ غَرَزَ كُلَّ وَاحِدٍ مِنْهُمَا عَلَى قَبْرٍ، ثُمَّ قَالَ ‏\"‏ لَعَلَّهُ يُخَفَّفُ عَنْهُمَا مَا لَمْ يَيْبَسَا ‏\"‏‏.‏","english":{"narrator":"Narrated Ibn `Abbas:","text":"The Prophet (ﷺ) once passed by two graves and said, \"They (the deceased persons in those graves) are \nbeing tortured not for a great thing to avoid.\" And then added, \"Yes, (they are being punished for a big \nsin), for one of them used to go about with calumnies while the other never saved himself from being \nsoiled with his urine.\" (Ibn `Abbas added): Then he took a green leaf of a date-palm) and split it into \ntwo pieces and fixed one piece on each grave and said, \"May their punishment be abated till these \n(two pieces) get dry.\""}},{"id":131,"idInBook":131,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنَّ أَحَدَكُمْ إِذَا مَاتَ عُرِضَ عَلَيْهِ مَقْعَدُهُ بِالْغَدَاةِ وَالْعَشِيِّ، إِنْ كَانَ مِنْ أَهْلِ الْجَنَّةِ فَمِنْ أَهْلِ الْجَنَّةِ، وَإِنْ كَانَ مِنْ أَهْلِ النَّارِ فَمِنْ أَهْلِ النَّارِ، فَيُقَالُ هَذَا مَقْعَدُكَ حَتَّى يَبْعَثَكَ اللَّهُ يَوْمَ الْقِيَامَةِ ‏\"‏‏.‏","english":{"narrator":"Narrated `Abdullah bin `Umar:","text":"Allah's Messenger (ﷺ) said, \"When anyone of you dies, he is shown his place both in the morning and in the \nevening. If he is one of the people of Paradise; he is shown his place in it, and if he is from the people \nof the Hell-Fire; he is shown his place there-in. Then it is said to him, 'This is your place till Allah \nresurrect you on the Day of Resurrection.\""}},{"id":132,"idInBook":132,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، عَنْ أَبِيهِ، أَنَّهُ سَمِعَ أَبَا سَعِيدٍ الْخُدْرِيَّ ـ رضى الله عنه ـ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا وُضِعَتِ الْجَنَازَةُ فَاحْتَمَلَهَا الرِّجَالُ عَلَى أَعْنَاقِهِمْ، فَإِنْ كَانَتْ صَالِحَةً قَالَتْ قَدِّمُونِي قَدِّمُونِي‏.‏ وَإِنْ كَانَتْ غَيْرَ صَالِحَةٍ قَالَتْ يَا وَيْلَهَا أَيْنَ يَذْهَبُونَ بِهَا‏.‏ يَسْمَعُ صَوْتَهَا كُلُّ شَىْءٍ إِلاَّ الإِنْسَانَ، وَلَوْ سَمِعَهَا الإِنْسَانُ لَصَعِقَ ‏\"‏‏.‏","english":{"narrator":"Narrated Abu Sa`id Al-Khudri:","text":"Allah's Messenger (ﷺ) said, \"When the funeral is ready (for its burial) and the people lift it on their shoulders, \nthen if the deceased is a righteous person he says, 'Take me ahead,' and if he is not a righteous one \nthen he says, 'Woe to it (me)! Where are you taking it (me)?' And his voice is audible to everything \nexcept human beings; and if they heard it they would fall down unconscious . \""}},{"id":133,"idInBook":133,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا ابْنُ عُلَيَّةَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ صُهَيْبٍ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ مَا مِنَ النَّاسِ مُسْلِمٌ يَمُوتُ لَهُ ثَلاَثَةٌ مِنَ الْوَلَدِ لَمْ يَبْلُغُوا الْحِنْثَ إِلاَّ أَدْخَلَهُ اللَّهُ الْجَنَّةَ بِفَضْلِ رَحْمَتِهِ إِيَّاهُمْ ‏\"‏‏.‏","english":{"narrator":"Narrated Anas bin Malik:","text":"Allah's Messenger (ﷺ) (p.b.u.h) said, \"Any Muslim whose three children died before the age of puberty will \nbe granted Paradise by Allah because of His mercy to them.\""}},{"id":134,"idInBook":134,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنْ عَدِيِّ بْنِ ثَابِتٍ، أَنَّهُ سَمِعَ الْبَرَاءَ ـ رضى الله عنه ـ قَالَ لَمَّا تُوُفِّيَ إِبْرَاهِيمُ ـ عَلَيْهِ السَّلاَمُ ـ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِنَّ لَهُ مُرْضِعًا فِي الْجَنَّةِ ‏\"‏‏.‏","english":{"narrator":"Narrated Al-Bara':","text":"When Ibrahim (the son of Prophet) expired, Allah's Messenger (ﷺ) said, \"There is a wet-nurse for him in \nParadise.\""}},{"id":135,"idInBook":135,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا حِبَّانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا شُعْبَةُ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهم ـ قَالَ سُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ أَوْلاَدِ الْمُشْرِكِينَ فَقَالَ ‏\n\"‏ اللَّهُ إِذْ خَلَقَهُمْ أَعْلَمُ بِمَا كَانُوا عَامِلِينَ ‏\"‏‏.‏","english":{"narrator":"Narrated Ibn `Abbas:","text":"Allah's Messenger (ﷺ) (p.b.u.h) was asked about the children of (Mushrikeen) pagans. The Prophet (ﷺ) replied, \n\"Since Allah created them, He knows what sort of deeds they would have done.\""}},{"id":136,"idInBook":136,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عَطَاءُ بْنُ يَزِيدَ اللَّيْثِيُّ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ يَقُولُ سُئِلَ النَّبِيُّ صلى الله عليه وسلم عَنْ ذَرَارِيِّ الْمُشْرِكِينَ فَقَالَ ‏\n\"‏ اللَّهُ أَعْلَمُ بِمَا كَانُوا عَامِلِينَ ‏\"‏‏.‏","english":{"narrator":"Narrated Abu Huraira:","text":"The Prophet (ﷺ) was asked about the offspring of pagans (Mushrikeen); so he said, \"Allah knows what \nsort of deeds they would have done.\""}},{"id":137,"idInBook":137,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا آدَمُ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ كُلُّ مَوْلُودٍ يُولَدُ عَلَى الْفِطْرَةِ، فَأَبَوَاهُ يُهَوِّدَانِهِ أَوْ يُنَصِّرَانِهِ أَوْ يُمَجِّسَانِهِ، كَمَثَلِ الْبَهِيمَةِ تُنْتَجُ الْبَهِيمَةَ، هَلْ تَرَى فِيهَا جَدْعَاءَ ‏\"‏‏.‏","english":{"narrator":"Narrated Abu Huraira:","text":"The Prophet (ﷺ) said, \"Every child is born with a true faith of Islam (i.e. to worship none but Allah Alone) \nand his parents convert him to Judaism or Christianity or Magianism, as an animal delivers a perfect \nbaby animal. Do you find it mutilated?\""}},{"id":138,"idInBook":138,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ، حَدَّثَنَا أَبُو رَجَاءٍ، عَنْ سَمُرَةَ بْنِ جُنْدَبٍ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا صَلَّى صَلاَةً أَقْبَلَ عَلَيْنَا بِوَجْهِهِ فَقَالَ ‏\"‏ مَنْ رَأَى مِنْكُمُ اللَّيْلَةَ رُؤْيَا ‏\"‏‏.‏ قَالَ فَإِنْ رَأَى أَحَدٌ قَصَّهَا، فَيَقُولُ مَا شَاءَ اللَّهُ، فَسَأَلَنَا يَوْمًا، فَقَالَ ‏\"‏ هَلْ رَأَى أَحَدٌ مِنْكُمْ رُؤْيَا ‏\"‏‏.‏ قُلْنَا لاَ‏.‏ قَالَ ‏\"‏ لَكِنِّي رَأَيْتُ اللَّيْلَةَ رَجُلَيْنِ أَتَيَانِي فَأَخَذَا بِيَدِي، فَأَخْرَجَانِي إِلَى الأَرْضِ الْمُقَدَّسَةِ، فَإِذَا رَجُلٌ جَالِسٌ، وَرَجُلٌ قَائِمٌ بِيَدِهِ كَلُّوبٌ مِنْ حَدِيدٍ ـ قَالَ بَعْضُ أَصْحَابِنَا عَنْ مُوسَى إِنَّهُ ـ يُدْخِلُ ذَلِكَ الْكَلُّوبَ فِي شِدْقِهِ، حَتَّى يَبْلُغَ قَفَاهُ، ثُمَّ يَفْعَلُ بِشِدْقِهِ الآخَرِ مِثْلَ ذَلِكَ، وَيَلْتَئِمُ شِدْقُهُ هَذَا، فَيَعُودُ فَيَصْنَعُ مِثْلَهُ‏.‏ قُلْتُ مَا هَذَا قَالاَ انْطَلِقْ‏.‏ فَانْطَلَقْنَا حَتَّى أَتَيْنَا عَلَى رَجُلٍ مُضْطَجِعٍ عَلَى قَفَاهُ، وَرَجُلٌ قَائِمٌ عَلَى رَأْسِهِ بِفِهْرٍ أَوْ صَخْرَةٍ، فَيَشْدَخُ بِهِ رَأْسَهُ، فَإِذَا ضَرَبَهُ تَدَهْدَهَ الْحَجَرُ، فَانْطَلَقَ إِلَيْهِ لِيَأْخُذَهُ، فَلاَ يَرْجِعُ إِلَى هَذَا حَتَّى يَلْتَئِمَ رَأْسُهُ، وَعَادَ رَأْسُهُ كَمَا هُوَ، فَعَادَ إِلَيْهِ فَضَرَبَهُ، قُلْتُ مَنْ هَذَا قَالاَ انْطَلِقْ‏.‏ فَانْطَلَقْنَا إِلَى ثَقْبٍ مِثْلِ التَّنُّورِ، أَعْلاَهُ ضَيِّقٌ وَأَسْفَلُهُ وَاسِعٌ، يَتَوَقَّدُ تَحْتَهُ نَارًا، فَإِذَا اقْتَرَبَ ارْتَفَعُوا حَتَّى كَادَ أَنْ يَخْرُجُوا، فَإِذَا خَمَدَتْ رَجَعُوا فِيهَا، وَفِيهَا رِجَالٌ وَنِسَاءٌ عُرَاةٌ‏.‏ فَقُلْتُ مَنْ هَذَا قَالاَ انْطَلِقْ‏.‏ فَانْطَلَقْنَا حَتَّى أَتَيْنَا عَلَى نَهَرٍ مِنْ دَمٍ، فِيهِ رَجُلٌ قَائِمٌ عَلَى وَسَطِ النَّهَرِ رَجُلٌ بَيْنَ يَدَيْهِ حِجَارَةٌ، فَأَقْبَلَ الرَّجُلُ الَّذِي فِي النَّهَرِ، فَإِذَا أَرَادَ أَنْ يَخْرُجَ رَمَى الرَّجُلُ بِحَجَرٍ فِي فِيهِ، فَرَدَّهُ حَيْثُ كَانَ، فَجَعَلَ كُلَّمَا جَاءَ لِيَخْرُجَ رَمَى فِي فِيهِ بِحَجَرٍ، فَيَرْجِعُ كَمَا كَانَ‏.‏ فَقُلْتُ مَا هَذَا قَالاَ انْطَلِقْ‏.‏ فَانْطَلَقْنَا حَتَّى انْتَهَيْنَا إِلَى رَوْضَةٍ خَضْرَاءَ، فِيهَا شَجَرَةٌ عَظِيمَةٌ، وَفِي أَصْلِهَا شَيْخٌ وَصِبْيَانٌ، وَإِذَا رَجُلٌ قَرِيبٌ مِنَ الشَّجَرَةِ بَيْنَ يَدَيْهِ نَارٌ يُوقِدُهَا، فَصَعِدَا بِي فِي الشَّجَرَةِ، وَأَدْخَلاَنِي دَارًا لَمْ أَرَ قَطُّ أَحْسَنَ مِنْهَا، فِيهَا رِجَالٌ شُيُوخٌ وَشَبَابٌ، وَنِسَاءٌ وَصِبْيَانٌ، ثُمَّ أَخْرَجَانِي مِنْهَا فَصَعِدَا بِي الشَّجَرَةَ فَأَدْخَلاَنِي دَارًا هِيَ أَحْسَنُ وَأَفْضَلُ، فِيهَا شُيُوخٌ وَشَبَابٌ‏.‏ قُلْتُ طَوَّفْتُمَانِي اللَّيْلَةَ، فَأَخْبِرَانِي عَمَّا رَأَيْتُ‏.‏ قَالاَ نَعَمْ، أَمَّا الَّذِي رَأَيْتَهُ يُشَقُّ شِدْقُهُ فَكَذَّابٌ يُحَدِّثُ بِالْكَذْبَةِ، فَتُحْمَلُ عَنْهُ حَتَّى تَبْلُغَ الآفَاقَ، فَيُصْنَعُ بِهِ إِلَى يَوْمِ الْقِيَامَةِ‏.‏ وَالَّذِي رَأَيْتَهُ يُشْدَخُ رَأْسُهُ فَرَجُلٌ عَلَّمَهُ اللَّهُ الْقُرْآنَ، فَنَامَ عَنْهُ بِاللَّيْلِ، وَلَمْ يَعْمَلْ فِيهِ بِالنَّهَارِ، يُفْعَلُ بِهِ إِلَى يَوْمِ الْقِيَامَةِ‏.‏ وَالَّذِي رَأَيْتَهُ فِي الثَّقْبِ فَهُمُ الزُّنَاةُ‏.‏ وَالَّذِي رَأَيْتَهُ فِي النَّهَرِ آكِلُو الرِّبَا‏.‏ وَالشَّيْخُ فِي أَصْلِ الشَّجَرَةِ إِبْرَاهِيمُ ـ عَلَيْهِ السَّلاَمُ ـ وَالصِّبْيَانُ حَوْلَهُ فَأَوْلاَدُ النَّاسِ، وَالَّذِي يُوقِدُ النَّارَ مَالِكٌ خَازِنُ النَّارِ‏.‏ وَالدَّارُ الأُولَى الَّتِي دَخَلْتَ دَارُ عَامَّةِ الْمُؤْمِنِينَ، وَأَمَّا هَذِهِ الدَّارُ فَدَارُ الشُّهَدَاءِ، وَأَنَا جِبْرِيلُ، وَهَذَا مِيكَائِيلُ، فَارْفَعْ رَأْسَكَ، فَرَفَعْتُ رَأْسِي فَإِذَا فَوْقِي مِثْلُ السَّحَابِ‏.‏ قَالاَ ذَاكَ مَنْزِلُكَ‏.‏ قُلْتُ دَعَانِي أَدْخُلْ مَنْزِلِي‏.‏ قَالاَ إِنَّهُ بَقِيَ لَكَ عُمْرٌ لَمْ تَسْتَكْمِلْهُ، فَلَوِ اسْتَكْمَلْتَ أَتَيْتَ مَنْزِلَكَ ‏\"‏‏.‏","english":{"narrator":"Narrated Samura bin Jundab:","text":"Whenever the Prophet (ﷺ) finished the (morning) prayer, he would face us and ask, \"Who amongst you \nhad a dream last night?\" So if anyone had seen a dream he would narrate it. The Prophet (ﷺ) would say: \n\"Ma sha'a-llah\" (An Arabic maxim meaning literally, 'What Allah wished,' and it indicates a good \nomen.) One day, he asked us whether anyone of us had seen a dream. We replied in the negative. The \nProphet said, \"But I had seen (a dream) last night that two men came to me, caught hold of my hands, \nand took me to the Sacred Land (Jerusalem). There, I saw a person sitting and another standing with \nan iron hook in his hand pushing it inside the mouth of the former till it reached the jawbone, and then \ntore off one side of his cheek, and then did the same with the other side; in the meantime the first side \nof his cheek became normal again and then he repeated the same operation again. I said, 'What is \nthis?' They told me to proceed on and we went on till we came to a man Lying flat on his back, and \nanother man standing at his head carrying a stone or a piece of rock, and crushing the head of the \nLying man, with that stone. Whenever he struck him, the stone rolled away. \nThe man went to pick it up and by the time he returned to him, the crushed head had returned to its \nnormal state and the man came back and struck him again (and so on). I said, 'Who is this?' They told \nme to proceed on; so we proceeded on and passed by a hole like an oven; with a narrow top and wide \nbottom, and the fire was kindling underneath that hole. Whenever the fire-flame went up, the people \nwere lifted up to such an extent that they about to get out of it, and whenever the fire got quieter, the \npeople went down into it, and there were naked men and women in it. I said, 'Who is this?' They told \nme to proceed on. So we proceeded on till we reached a river of blood and a man was in it, and \nanother man was standing at its bank with stones in front of him, facing the man standing in the river. \nWhenever the man in the river wanted to come out, the other one threw a stone in his mouth and \ncaused him to retreat to his original position; and so whenever he wanted to come out the other would \nthrow a stone in his mouth, and he would retreat to his original position. I asked, 'What is this?' They \ntold me to proceed on and we did so till we reached a well-flourished green garden having a huge tree \nand near its root was sitting an old man with some children. (I saw) Another man near the tree with \nfire in front of him and he was kindling it up. Then they (i.e. my two companions) made me climb up \nthe tree and made me enter a house, better than which I have ever seen. In it were some old men and \nyoung men, women and children. \nThen they took me out of this house and made me climb up the tree and made me enter another house \nthat was better and superior (to the first) containing old and young people. I said to them (i.e. my two \ncompanions), 'You have made me ramble all the night. Tell me all about that I have seen.' They said, \n'Yes. As for the one whose cheek you saw being torn away, he was a liar and he used to tell lies, and \nthe people would report those lies on his authority till they spread all over the world. So, he will be \npunished like that till the Day of Resurrection. \nThe one whose head you saw being crushed is the one whom Allah had given the knowledge of \nQur'an (i.e. knowing it by heart) but he used to sleep at night (i.e. he did not recite it then) and did not \nuse to act upon it (i.e. upon its orders etc.) by day; and so this punishment will go on till the Day of \nResurrection. And those you saw in the hole (like oven) were adulterers (those men and women who \ncommit illegal sexual intercourse). And those you saw in the river of blood were those dealing in Riba \n(usury). And the old man who was sitting at the base of the tree was Abraham and the little children \naround him were the offspring of the people. And the one who was kindling the fire was Malik, the \ngatekeeper of the Hell-fire. And the first house in which you have gone was the house of the common \nbelievers, and the second house was of the martyrs. I am Gabriel and this is Michael. Raise your head.' \nI raised my head and saw a thing like a cloud over me. They said, 'That is your place.' I said, 'Let me \nenter my place.' They said, 'You still have some life which you have not yet completed, and when you \ncomplete (that remaining portion of your life) you will then enter your place.' \""}},{"id":139,"idInBook":139,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ، حَدَّثَنَا وُهَيْبٌ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ دَخَلْتُ عَلَى أَبِي بَكْرٍ ـ رضى الله عنه ـ فَقَالَ فِي كَمْ كَفَّنْتُمُ النَّبِيَّ صلى الله عليه وسلم قَالَتْ فِي ثَلاَثَةِ أَثْوَابٍ بِيضٍ سَحُولِيَّةٍ، لَيْسَ فِيهَا قَمِيصٌ وَلاَ عِمَامَةٌ‏.‏ وَقَالَ لَهَا فِي أَىِّ يَوْمٍ تُوُفِّيَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَتْ يَوْمَ الاِثْنَيْنِ‏.‏ قَالَ فَأَىُّ يَوْمٍ هَذَا قَالَتْ يَوْمُ الاِثْنَيْنِ‏.‏ قَالَ أَرْجُو فِيمَا بَيْنِي وَبَيْنَ اللَّيْلِ‏.‏ فَنَظَرَ إِلَى ثَوْبٍ عَلَيْهِ كَانَ يُمَرَّضُ فِيهِ، بِهِ رَدْعٌ مِنْ زَعْفَرَانٍ فَقَالَ اغْسِلُوا ثَوْبِي هَذَا، وَزِيدُوا عَلَيْهِ ثَوْبَيْنِ فَكَفِّنُونِي فِيهَا‏.‏ قُلْتُ إِنَّ هَذَا خَلَقٌ‏.‏ قَالَ إِنَّ الْحَىَّ أَحَقُّ بِالْجَدِيدِ مِنَ الْمَيِّتِ، إِنَّمَا هُوَ لِلْمُهْلَةِ‏.‏ فَلَمْ يُتَوَفَّ حَتَّى أَمْسَى مِنْ لَيْلَةِ الثُّلاَثَاءِ وَدُفِنَ قَبْلَ أَنْ يُصْبِحَ‏.‏","english":{"narrator":"Narrated Hisham's father:","text":"Aisha said, \"I went to Abu Bakr (during his fatal illness) and he asked me, 'In how many garments \nwas the Prophet (ﷺ) shrouded?' She replied, 'In three Suhuliya pieces of white cloth of cotton, and there \nwas neither a shirt nor a turban among them.' Abu Bakr further asked her, 'On which day did the \nProphet die?' She replied, 'He died on Monday.' He asked, 'What is today?' She replied, 'Today is \nMonday.' He added, 'I hope I shall die sometime between this morning and tonight.' Then he looked at \na garment that he was wearing during his illness and it had some stains of saffron. Then he said, 'Wash \nthis garment of mine and add two more garments and shroud me in them.' I said, 'This is worn out.' He \nsaid, 'A living person has more right to wear new clothes than a dead one; the shroud is only for the \nbody's pus.' He did not die till it was the night of Tuesday and was buried before the morning.\""}},{"id":140,"idInBook":140,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ أَخْبَرَنِي هِشَامٌ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ‏.‏ أَنَّ رَجُلاً، قَالَ لِلنَّبِيِّ صلى الله عليه وسلم إِنَّ أُمِّي افْتُلِتَتْ نَفْسُهَا، وَأَظُنُّهَا لَوْ تَكَلَّمَتْ تَصَدَّقَتْ، فَهَلْ لَهَا أَجْرٌ إِنْ تَصَدَّقْتُ عَنْهَا قَالَ ‏\n\"‏ نَعَمْ ‏\"‏‏.‏","english":{"narrator":"Narrated Aisha:","text":"A man said to the Prophet (p.b.u.h), \"My mother died suddenly and I thought that if she had lived she \nwould have given alms. So, if I give alms now on her behalf, will she get the reward?\" The Prophet (ﷺ) \nreplied in the affirmative."}},{"id":141,"idInBook":141,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنِي سُلَيْمَانُ، عَنْ هِشَامٍ، وَحَدَّثَنِي مُحَمَّدُ بْنُ حَرْبٍ، حَدَّثَنَا أَبُو مَرْوَانَ، يَحْيَى بْنُ أَبِي زَكَرِيَّاءَ عَنْ هِشَامٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ إِنْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم لَيَتَعَذَّرُ فِي مَرَضِهِ ‏\n\"‏ أَيْنَ أَنَا الْيَوْمَ أَيْنَ أَنَا غَدًا ‏\"‏ اسْتِبْطَاءً لِيَوْمِ عَائِشَةَ، فَلَمَّا كَانَ يَوْمِي قَبَضَهُ اللَّهُ بَيْنَ سَحْرِي وَنَحْرِي، وَدُفِنَ فِي بَيْتِي‏.‏","english":{"narrator":"Narrated `Aisha:","text":"During his sickness, Allah's Messenger (ﷺ) was asking repeatedly, \"Where am I today? Where will I be \ntomorrow?\" And I was waiting for the day of my turn (impatiently). Then, when my turn came, Allah \ntook his soul away (in my lap) between my chest and arms and he was buried in my house."}},{"id":142,"idInBook":142,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ هِلاَلٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي مَرَضِهِ الَّذِي لَمْ يَقُمْ مِنْهُ ‏\n\"‏ لَعَنَ اللَّهُ الْيَهُودَ وَالنَّصَارَى، اتَّخَذُوا قُبُورَ أَنْبِيَائِهِمْ مَسَاجِدَ ‏\"‏‏.‏ لَوْلاَ ذَلِكَ أُبْرِزَ قَبْرُهُ، غَيْرَ أَنَّهُ خَشِيَ أَوْ خُشِيَ أَنَّ يُتَّخَذَ مَسْجِدًا‏.‏ وَعَنْ هِلاَلٍ قَالَ كَنَّانِي عُرْوَةُ بْنُ الزُّبَيْرِ وَلَمْ يُولَدْ لِي‏.‏","english":{"narrator":"Narrated `Aisha:","text":"Allah's Messenger (ﷺ) in his fatal illness said, \"Allah cursed the Jews and the Christians, for they built the \nplaces of worship at the graves of their prophets.\" And if that had not been the case, then the Prophet's \ngrave would have been made prominent before the people. So (the Prophet (ﷺ) ) was afraid, or the people \nwere afraid that his grave might be taken as a place for worship."}},{"id":143,"idInBook":143,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ، عَنْ سُفْيَانَ التَّمَّارِ، أَنَّهُ حَدَّثَهُ أَنَّهُ، رَأَى قَبْرَ النَّبِيِّ صلى الله عليه وسلم مُسَنَّمًا‏.‏","english":{"narrator":"Narrated Abu Bakr bin `Aiyash:","text":"Sufyan at-Tammar told me that he had seen the grave of the Prophet (ﷺ) elevated and convex."}},{"id":144,"idInBook":144,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا فَرْوَةُ، حَدَّثَنَا عَلِيٌّ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، لَمَّا سَقَطَ عَلَيْهِمُ الْحَائِطُ فِي زَمَانِ الْوَلِيدِ بْنِ عَبْدِ الْمَلِكِ أَخَذُوا فِي بِنَائِهِ، فَبَدَتْ لَهُمْ قَدَمٌ فَفَزِعُوا، وَظَنُّوا أَنَّهَا قَدَمُ النَّبِيِّ صلى الله عليه وسلم فَمَا وَجَدُوا أَحَدًا يَعْلَمُ ذَلِكَ حَتَّى قَالَ لَهُمْ عُرْوَةُ لاَ وَاللَّهِ مَا هِيَ قَدَمُ النَّبِيِّ صلى الله عليه وسلم مَا هِيَ إِلاَّ قَدَمُ عُمَرَ ـ رضى الله عنه ـ‏.‏","english":{"narrator":"Narrated `Urwa:","text":"When the wall fell on them (i.e. graves) during the caliphate of Al-Walid bin `Abdul Malik, the people \nstarted repairing it, and a foot appeared to them. The people got scared and thought that it was the foot \nof the Prophet. No one could be found who could tell them about it till I (`Urwa) said to them, \"By \nAllah, this is not the foot of the Prophet (ﷺ) but it is the foot of `Umar.\""}},{"id":145,"idInBook":145,"chapterId":23,"bookId":1,"arabic":"وَعَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّهَا أَوْصَتْ عَبْدَ اللَّهِ بْنَ الزُّبَيْرِ ـ رضى الله عنهما ـ لاَ تَدْفِنِّي مَعَهُمْ وَادْفِنِّي مَعَ صَوَاحِبِي بِالْبَقِيعِ، لاَ أُزَكَّى بِهِ أَبَدًا‏.‏","english":{"narrator":"","text":"Aisha narrated that she made a \nwill to `Abdullah bin Zubair, \"Do not bury me with them (the Prophet (ﷺ) and his two companions) but \nbury me with my companions (wives of the Prophet (p.b.u.h) ) in Al-Baqi as I would not like to be \nlooked upon as better than I really am (by being buried near the Prophet).\""}},{"id":146,"idInBook":146,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا جَرِيرُ بْنُ عَبْدِ الْحَمِيدِ، حَدَّثَنَا حُصَيْنُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ عَمْرِو بْنِ مَيْمُونٍ الأَوْدِيِّ، قَالَ رَأَيْتُ عُمَرَ بْنَ الْخَطَّابِ ـ رضى الله عنه ـ قَالَ يَا عَبْدَ اللَّهِ بْنَ عُمَرَ، اذْهَبْ إِلَى أُمِّ الْمُؤْمِنِينَ عَائِشَةَ ـ رضى الله عنها ـ فَقُلْ يَقْرَأُ عُمَرُ بْنُ الْخَطَّابِ عَلَيْكِ السَّلاَمَ، ثُمَّ سَلْهَا أَنْ أُدْفَنَ مَعَ صَاحِبَىَّ‏.‏ قَالَتْ كُنْتُ أُرِيدُهُ لِنَفْسِي، فَلأُوثِرَنَّهُ الْيَوْمَ عَلَى نَفْسِي‏.‏ فَلَمَّا أَقْبَلَ قَالَ لَهُ مَا لَدَيْكَ قَالَ أَذِنَتْ لَكَ يَا أَمِيرَ الْمُؤْمِنِينَ‏.‏ قَالَ مَا كَانَ شَىْءٌ أَهَمَّ إِلَىَّ مِنْ ذَلِكَ الْمَضْجَعِ، فَإِذَا قُبِضْتُ فَاحْمِلُونِي ثُمَّ سَلِّمُوا ثُمَّ قُلْ يَسْتَأْذِنُ عُمَرُ بْنُ الْخَطَّابِ‏.‏ فَإِنْ أَذِنَتْ لِي فَادْفِنُونِي، وَإِلاَّ فَرُدُّونِي إِلَى مَقَابِرِ الْمُسْلِمِينَ، إِنِّي لاَ أَعْلَمُ أَحَدًا أَحَقَّ بِهَذَا الأَمْرِ مِنْ هَؤُلاَءِ النَّفَرِ الَّذِينَ تُوُفِّيَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَهُوَ عَنْهُمْ رَاضٍ، فَمَنِ اسْتَخْلَفُوا بَعْدِي فَهُوَ الْخَلِيفَةُ، فَاسْمَعُوا لَهُ وَأَطِيعُوا‏.‏ فَسَمَّى عُثْمَانَ وَعَلِيًّا وَطَلْحَةَ وَالزُّبَيْرَ وَعَبْدَ الرَّحْمَنِ بْنَ عَوْفٍ وَسَعْدَ بْنَ أَبِي وَقَّاصٍ، وَوَلَجَ عَلَيْهِ شَابٌّ مِنَ الأَنْصَارِ فَقَالَ أَبْشِرْ يَا أَمِيرَ الْمُؤْمِنِينَ بِبُشْرَى اللَّهِ، كَانَ لَكَ مِنَ الْقَدَمِ فِي الإِسْلاَمِ مَا قَدْ عَلِمْتَ، ثُمَّ اسْتُخْلِفْتَ فَعَدَلْتَ، ثُمَّ الشَّهَادَةُ بَعْدَ هَذَا كُلِّهِ‏.‏ فَقَالَ لَيْتَنِي يَا ابْنَ أَخِي وَذَلِكَ كَفَافًا لاَ عَلَىَّ وَلاَ لِي أُوصِي الْخَلِيفَةَ مِنْ بَعْدِي بِالْمُهَاجِرِينَ الأَوَّلِينَ خَيْرًا، أَنْ يَعْرِفَ لَهُمْ حَقَّهُمْ، وَأَنْ يَحْفَظَ لَهُمْ حُرْمَتَهُمْ، وَأُوصِيهِ بِالأَنْصَارِ خَيْرًا الَّذِينَ تَبَوَّءُوا الدَّارَ وَالإِيمَانَ أَنْ يُقْبَلَ مِنْ مُحْسِنِهِمْ، وَيُعْفَى عَنْ مُسِيئِهِمْ، وَأُوصِيهِ بِذِمَّةِ اللَّهِ وَذِمَّةِ رَسُولِهِ صلى الله عليه وسلم أَنْ يُوفَى لَهُمْ بِعَهْدِهِمْ، وَأَنْ يُقَاتَلَ مِنْ وَرَائِهِمْ، وَأَنْ لاَ يُكَلَّفُوا فَوْقَ طَاقَتِهِمْ‏.‏","english":{"narrator":"Narrated `Amr bin Maimun Al-Audi:","text":"I saw `Umar bin Al-Khattab (when he was stabbed) saying, \"O `Abdullah bin `Umar! Go to the \nmother of the believers Aisha and say, `Umar bin Al-Khattab sends his greetings to you,' and request \nher to allow me to be buried with my companions.\" (So, Ibn `Umar conveyed the message to `Aisha.) \nShe said, \"I had the idea of having this place for myself but today I prefer him (`Umar) to myself (and \nallow him to be buried there).\" When `Abdullah bin `Umar returned, `Umar asked him, \"What (news) \ndo you have?\" He replied, \"O chief of the believers! She has allowed you (to be buried there).\" On \nthat `Umar said, \"Nothing was more important to me than to be buried in that (sacred) place. So, when \nI expire, carry me there and pay my greetings to her (`Aisha ) and say, `Umar bin Al-Khattab asks \npermission; and if she gives permission, then bury me (there) and if she does not, then take me to the \ngraveyard of the Muslims. I do not think any person has more right for the caliphate than those with \nwhom Allah's Messenger (ﷺ) (p.b.u.h) was always pleased till his death. And whoever is chosen by the \npeople after me will be the caliph, and you people must listen to him and obey him,\" and then he \nmentioned the name of `Uthman, `Ali, Talha, Az-Zubair, `Abdur-Rahman bin `Auf and Sa`d bin Abi \nWaqqas. \nBy this time a young man from Ansar came and said, \"O chief of the believers! Be happy with Allah's \nglad tidings. The grade which you have in Islam is known to you, then you became the caliph and you \nruled with justice and then you have been awarded martyrdom after all this.\" `Umar replied, \"O son of \nmy brother! Would that all that privileges will counterbalance (my short comings), so that I neither \nlose nor gain anything. I recommend my successor to be good to the early emigrants and realize their \nrights and to protect their honor and sacred things. And I also recommend him to be good to the Ansar \nwho before them, had homes (in Medina) and had adopted the Faith. He should accept the good of the \nrighteous among them and should excuse their wrongdoers. I recommend him to abide by the rules \nand regulations concerning the Dhimmis (protectees) of Allah and His Apostle, to fulfill their \ncontracts completely and fight for them and not to tax (overburden) them beyond their capabilities.\""}},{"id":147,"idInBook":147,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، عَنِ الأَعْمَشِ، عَنْ مُجَاهِدٍ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ لاَ تَسُبُّوا الأَمْوَاتَ فَإِنَّهُمْ قَدْ أَفْضَوْا إِلَى مَا قَدَّمُوا ‏\"‏‏.‏ وَرَوَاهُ عَبْدُ اللَّهِ بْنُ عَبْدِ الْقُدُّوسِ عَنِ الأَعْمَشِ، وَمُحَمَّدُ بْنُ أَنَسٍ عَنِ الأَعْمَشِ‏.‏ تَابَعَهُ عَلِيُّ بْنُ الْجَعْدِ وَابْنُ عَرْعَرَةَ وَابْنُ أَبِي عَدِيٍّ عَنْ شُعْبَةَ‏.‏","english":{"narrator":"Narrated `Aisha:","text":"The Prophet (p.b.u.h) said, \"Don't abuse the dead, because they have reached the result of what they \nforwarded.\""}},{"id":148,"idInBook":148,"chapterId":23,"bookId":1,"arabic":"حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنِي عَمْرُو بْنُ مُرَّةَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ قَالَ أَبُو لَهَبٍ ـ عَلَيْهِ لَعْنَةُ اللَّهِ ـ لِلنَّبِيِّ صلى الله عليه وسلم تَبًّا لَكَ سَائِرَ الْيَوْمِ‏.‏ فَنَزَلَتْ ‏{‏تَبَّتْ يَدَا أَبِي لَهَبٍ وَتَبَّ‏}‏ ‏.‏","english":{"narrator":"Narrated Ibn `Abbas.:","text":"Abu Lahab, may Allah curse him, once said to the Prophet (p.b.u.h), \"Perish you all the day.\" \nThen the Divine Inspiration came: \"Perish the hands of Abi Lahab! And perish he!\" (111.1)."}}],"chapter":{"id":23,"bookId":1,"arabic":"كتاب الجنائز","english":"Funerals (Al-Janaa'iz)"}}