{"metadata":{"length":3,"arabic":{"title":"صحيح البخاري","author":"الإمام محمد بن إسماعيل البخاري","introduction":"كتاب الشفعة"},"english":{"title":"Sahih al-Bukhari","author":"Imam Muhammad ibn Ismail al-Bukhari","introduction":"Shuf'a"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":36,"bookId":1,"arabic":"حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ قَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم بِالشُّفْعَةِ فِي كُلِّ مَا لَمْ يُقْسَمْ، فَإِذَا وَقَعَتِ الْحُدُودُ وَصُرِّفَتِ الطُّرُقُ فَلاَ شُفْعَةَ‏.‏","english":{"narrator":"Narrated Jabir bin `Abdullah:","text":"Allah's Messenger (ﷺ) gave a verdict regarding Shuf'a in every undivided joint thing (property). But if the \nlimits are defined (or demarcated) or the ways and streets are fixed, then there is no pre-emption."}},{"id":2,"idInBook":2,"chapterId":36,"bookId":1,"arabic":"حَدَّثَنَا الْمَكِّيُّ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي إِبْرَاهِيمُ بْنُ مَيْسَرَةَ، عَنْ عَمْرِو بْنِ الشَّرِيدِ، قَالَ وَقَفْتُ عَلَى سَعْدِ بْنِ أَبِي وَقَّاصٍ، فَجَاءَ الْمِسْوَرُ بْنُ مَخْرَمَةَ فَوَضَعَ يَدَهُ عَلَى إِحْدَى مَنْكِبَىَّ إِذْ جَاءَ أَبُو رَافِعٍ مَوْلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ يَا سَعْدُ ابْتَعْ مِنِّي بَيْتَىَّ فِي دَارِكَ‏.‏ فَقَالَ سَعْدٌ وَاللَّهِ مَا أَبْتَاعُهُمَا‏.‏ فَقَالَ الْمِسْوَرُ وَاللَّهِ لَتَبْتَاعَنَّهُمَا‏.‏ فَقَالَ سَعْدٌ وَاللَّهِ لاَ أَزِيدُكَ عَلَى أَرْبَعَةِ آلاَفٍ، مُنَجَّمَةٍ أَوْ مُقَطَّعَةٍ‏.‏ قَالَ أَبُو رَافِعٍ لَقَدْ أُعْطِيتُ بِهَا خَمْسَمِائَةِ دِينَارٍ، وَلَوْلاَ أَنِّي سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ الْجَارُ أَحَقُّ بِسَقَبِهِ ‏\"‏‏.‏ مَا أَعْطَيْتُكَهَا بِأَرْبَعَةِ آلاَفٍ، وَأَنَا أُعْطَى بِهَا خَمْسَمِائَةِ دِينَارٍ‏.‏ فَأَعْطَاهَا إِيَّاهُ‏.‏","english":{"narrator":"Narrated `Amr bin Ash-Sharid:","text":"While I was standing with Sa`d bin Abi Waqqas, Al-Miswar bin Makhrama came and put his hand on \nmy shoulder. Meanwhile Abu Rafi`, the freed slave of the Prophet (ﷺ) came and asked Sa`d to buy from \nhim the (two) dwellings which were in his house. Sa`d said, \"By Allah I will not buy them.\" Al- \nMiswar said, \"By Allah, you shall buy them.\" Sa`d replied, \"By Allah, I will not pay more than four \nthousand (Dirhams) by installments.\" Abu Rafi` said, \"I have been offered five hundred Dinars (for it) \nand had I not heard the Prophet (ﷺ) saying, 'The neighbor has more right than anyone else because of his \nnearness, I would not give them to you for four-thousand (Dirhams) while I am offered five-hundred \nDinars (one Dinar equals ten Dirhams) for them.\" So, he sold it to Sa`d."}},{"id":3,"idInBook":3,"chapterId":36,"bookId":1,"arabic":"حَدَّثَنَا حَجَّاجٌ، حَدَّثَنَا شُعْبَةُ، ح وَحَدَّثَنِي عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا شَبَابَةُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا أَبُو عِمْرَانَ، قَالَ سَمِعْتُ طَلْحَةَ بْنَ عَبْدِ اللَّهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قُلْتُ يَا رَسُولَ اللَّهِ، إِنَّ لِي جَارَيْنِ، فَإِلَى أَيِّهِمَا أُهْدِي قَالَ ‏\n\"‏ إِلَى أَقْرَبِهِمَا مِنْكِ بَابًا ‏\"‏‏.‏","english":{"narrator":"Narrated Aisha:","text":"I said, \"O Allah's Messenger (ﷺ)! I have two neighbors and would like to know to which of them I should \ngive presents.\" He replied, \"To the one whose door is nearer to you.\""}}],"chapter":{"id":36,"bookId":1,"arabic":"كتاب الشفعة","english":"Shuf'a"}}