{"metadata":{"length":183,"arabic":{"title":"صحيح البخاري","author":"الإمام محمد بن إسماعيل البخاري","introduction":"كتاب النكاح"},"english":{"title":"Sahih al-Bukhari","author":"Imam Muhammad ibn Ismail al-Bukhari","introduction":"Wedlock, Marriage (Nikaah)"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، أَخْبَرَنَا حُمَيْدُ بْنُ أَبِي حُمَيْدٍ الطَّوِيلُ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ ـ رضى الله عنه ـ يَقُولُ جَاءَ ثَلاَثَةُ رَهْطٍ إِلَى بُيُوتِ أَزْوَاجِ النَّبِيِّ صلى الله عليه وسلم يَسْأَلُونَ عَنْ عِبَادَةِ النَّبِيِّ صلى الله عليه وسلم فَلَمَّا أُخْبِرُوا كَأَنَّهُمْ تَقَالُّوهَا فَقَالُوا وَأَيْنَ نَحْنُ مِنَ النَّبِيِّ صلى الله عليه وسلم قَدْ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ وَمَا تَأَخَّرَ‏.‏ قَالَ أَحَدُهُمْ أَمَّا أَنَا فَإِنِّي أُصَلِّي اللَّيْلَ أَبَدًا‏.‏ وَقَالَ آخَرُ أَنَا أَصُومُ الدَّهْرَ وَلاَ أُفْطِرُ‏.‏ وَقَالَ آخَرُ أَنَا أَعْتَزِلُ النِّسَاءَ فَلاَ أَتَزَوَّجُ أَبَدًا‏.‏ فَجَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ أَنْتُمُ الَّذِينَ قُلْتُمْ كَذَا وَكَذَا أَمَا وَاللَّهِ إِنِّي لأَخْشَاكُمْ لِلَّهِ وَأَتْقَاكُمْ لَهُ، لَكِنِّي أَصُومُ وَأُفْطِرُ، وَأُصَلِّي وَأَرْقُدُ وَأَتَزَوَّجُ النِّسَاءَ، فَمَنْ رَغِبَ عَنْ سُنَّتِي فَلَيْسَ مِنِّي ‏\"‏‏.‏","english":{"narrator":"Narrated Anas bin Malik:","text":"A group of three men came to the houses of the wives of the Prophet (ﷺ) asking how the Prophet (ﷺ) \nworshipped (Allah), and when they were informed about that, they considered their worship \ninsufficient and said, \"Where are we from the Prophet (ﷺ) as his past and future sins have been forgiven.\" \nThen one of them said, \"I will offer the prayer throughout the night forever.\" The other said, \"I will \nfast throughout the year and will not break my fast.\" The third said, \"I will keep away from the \nwomen and will not marry forever.\" Allah's Messenger (ﷺ) came to them and said, \"Are you the same people \nwho said so-and-so? By Allah, I am more submissive to Allah and more afraid of Him than you; yet I \nfast and break my fast, I do sleep and I also marry women. So he who does not follow my tradition in \nreligion, is not from me (not one of my followers)."}},{"id":2,"idInBook":2,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا عَلِيٌّ، سَمِعَ حَسَّانَ بْنَ إِبْرَاهِيمَ، عَنْ يُونُسَ بْنِ يَزِيدَ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُرْوَةُ، أَنَّهُ سَأَلَ عَائِشَةَ عَنْ قَوْلِهِ تَعَالَى ‏{‏وَإِنْ خِفْتُمْ أَنْ لاَ تُقْسِطُوا فِي الْيَتَامَى فَانْكِحُوا مَا طَابَ لَكُمْ مِنَ النِّسَاءِ مَثْنَى وَثُلاَثَ وَرُبَاعَ فَإِنْ خِفْتُمْ أَنْ لاَ تَعْدِلُوا فَوَاحِدَةً أَوْ مَا مَلَكَتْ أَيْمَانُكُمْ ذَلِكَ أَدْنَى أَنْ لاَ تَعُولُوا‏}‏‏.‏ قَالَتْ يَا ابْنَ أُخْتِي، الْيَتِيمَةُ تَكُونُ فِي حَجْرِ وَلِيِّهَا، فَيَرْغَبُ فِي مَالِهَا وَجَمَالِهَا، يُرِيدُ أَنْ يَتَزَوَّجَهَا بِأَدْنَى مِنْ سُنَّةِ صَدَاقِهَا، فَنُهُوا أَنْ يَنْكِحُوهُنَّ إِلاَّ أَنْ يُقْسِطُوا لَهُنَّ فَيُكْمِلُوا الصَّدَاقَ، وَأُمِرُوا بِنِكَاحِ مَنْ سِوَاهُنَّ مِنَ النِّسَاءِ‏.‏","english":{"narrator":"Narrated 'Urwa:","text":"that he asked `Aisha about the Statement of Allah: 'If you fear that you shall not be able to deal justly \nwith the orphan girls, then marry (other) women of your choice, two or three or four; but if you fear \nthat you shall not be able to deal justly (with them), then only one, or (the captives) that your right \nhands possess. That will be nearer to prevent you from doing injustice.' (4.3) `Aisha said, \"O my \nnephew! (This Verse has been revealed in connection with) an orphan girl under the guardianship of \nher guardian who is attracted by her wealth and beauty and intends to marry her with a Mahr less than \nwhat other women of her standard deserve. So they (such guardians) have been forbidden to marry \nthem unless they do justice to them and give them their full Mahr, and they are ordered to marry other \nwomen instead of them.\""}},{"id":3,"idInBook":3,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، قَالَ حَدَّثَنِي إِبْرَاهِيمُ، عَنْ عَلْقَمَةَ، قَالَ كُنْتُ مَعَ عَبْدِ اللَّهِ فَلَقِيَهُ عُثْمَانُ بِمِنًى فَقَالَ يَا أَبَا عَبْدِ الرَّحْمَنِ إِنَّ لِي إِلَيْكَ حَاجَةً‏.‏ فَخَلَيَا فَقَالَ عُثْمَانُ هَلْ لَكَ يَا أَبَا عَبْدِ الرَّحْمَنِ فِي أَنْ نُزَوِّجَكَ بِكْرًا، تُذَكِّرُكَ مَا كُنْتَ تَعْهَدُ، فَلَمَّا رَأَى عَبْدُ اللَّهِ أَنْ لَيْسَ لَهُ حَاجَةٌ إِلَى هَذَا أَشَارَ إِلَىَّ فَقَالَ يَا عَلْقَمَةُ، فَانْتَهَيْتُ إِلَيْهِ وَهْوَ يَقُولُ أَمَا لَئِنْ قُلْتَ ذَلِكَ لَقَدْ قَالَ لَنَا النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ يَا مَعْشَرَ الشَّبَابِ مَنِ اسْتَطَاعَ مِنْكُمُ الْبَاءَةَ فَلْيَتَزَوَّجْ، وَمَنْ لَمْ يَسْتَطِعْ فَعَلَيْهِ بِالصَّوْمِ فَإِنَّهُ لَهُ وِجَاءٌ ‏\"‏‏.‏","english":{"narrator":"Narrated 'Alqama:","text":"While I was with `Abdullah, `Uthman met him at Mina and said, \"O Abu `Abdur-Rahman ! I have \nsomething to say to you.\" So both of them went aside and `Uthman said, \"O Abu `Abdur-Rah. man! \nShall we marry you to a virgin who will make you remember your past days?\" When `Abdullah felt \nthat he was not in need of that, he beckoned me (to join him) saying, \"O 'Alqama!\" Then I heard him \nsaying (in reply to `Uthman), \"As you have said that, (I tell you that) the Prophet (ﷺ) once said to us, 'O \nyoung people! Whoever among you is able to marry, should marry, and whoever is not able to marry, \nis recommended to fast, as fasting diminishes his sexual power."}},{"id":4,"idInBook":4,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، قَالَ حَدَّثَنِي عُمَارَةُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ، قَالَ دَخَلْتُ مَعَ عَلْقَمَةَ وَالأَسْوَدِ عَلَى عَبْدِ اللَّهِ فَقَالَ عَبْدُ اللَّهِ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم شَبَابًا لاَ نَجِدُ شَيْئًا فَقَالَ لَنَا رَسُولُ اللَّهُ صلى الله عليه وسلم ‏\n\"‏ يَا مَعْشَرَ الشَّبَابِ مَنِ اسْتَطَاعَ الْبَاءَةَ فَلْيَتَزَوَّجْ، فَإِنَّهُ أَغَضُّ لِلْبَصَرِ، وَأَحْصَنُ لِلْفَرْجِ، وَمَنْ لَمْ يَسْتَطِعْ فَعَلَيْهِ بِالصَّوْمِ، فَإِنَّهُ لَهُ وِجَاءٌ ‏\"‏‏.‏","english":{"narrator":"Narrated `Abdullah:","text":"We were with the Prophet (ﷺ) while we were young and had no wealth. So Allah's Messenger (ﷺ) said, \n\"O young people! Whoever among you can marry, should marry, because it helps him lower his gaze \nand guard his modesty (i.e. his private parts from committing illegal sexual intercourse etc.), and \nwhoever is not able to marry, should fast, as fasting diminishes his sexual power.\""}},{"id":5,"idInBook":5,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامُ بْنُ يُوسُفَ، أَنَّ ابْنَ جُرَيْجٍ، أَخْبَرَهُمْ قَالَ أَخْبَرَنِي عَطَاءٌ، قَالَ حَضَرْنَا مَعَ ابْنِ عَبَّاسٍ جَنَازَةَ مَيْمُونَةَ بِسَرِفَ، فَقَالَ ابْنُ عَبَّاسٍ هَذِهِ زَوْجَةُ النَّبِيِّ صلى الله عليه وسلم فَإِذَا رَفَعْتُمْ نَعْشَهَا فَلاَ تُزَعْزِعُوهَا وَلاَ تُزَلْزِلُوهَا وَارْفُقُوا، فَإِنَّهُ كَانَ عِنْدَ النَّبِيِّ صلى الله عليه وسلم تِسْعٌ، كَانَ يَقْسِمُ لِثَمَانٍ وَلاَ يَقْسِمُ لِوَاحِدَةٍ‏.‏","english":{"narrator":"Narrated 'Ata:","text":"We presented ourselves along with Ibn `Abbas at the funeral procession of Maimuna at a place called \nSarif. Ibn `Abbas said, \"This is the wife of the Prophet (ﷺ) so when you lift her bier, do not Jerk it or \nshake it much, but walk smoothly because the Prophet (ﷺ) had nine wives and he used to observe the \nnight turns with eight of them, and for one of them there was no night turn.\""}},{"id":6,"idInBook":6,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَطُوفُ عَلَى نِسَائِهِ فِي لَيْلَةٍ وَاحِدَةٍ، وَلَهُ تِسْعُ نِسْوَةٍ‏.‏ وَقَالَ لِي خَلِيفَةُ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، أَنَّ أَنَسًا، حَدَّثَهُمْ عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏","english":{"narrator":"Narrated Anas:","text":"The Prophet (ﷺ) used to go round (have sexual relations with) all his wives in one night, and he had nine wives."}},{"id":7,"idInBook":7,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ الْحَكَمِ الأَنْصَارِيُّ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ رَقَبَةَ، عَنْ طَلْحَةَ الْيَامِيِّ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ قَالَ لِي ابْنُ عَبَّاسٍ هَلْ تَزَوَّجْتَ قُلْتُ لاَ‏.‏ قَالَ فَتَزَوَّجْ فَإِنَّ خَيْرَ هَذِهِ الأُمَّةِ أَكْثَرُهَا نِسَاءً‏.‏","english":{"narrator":"Narrated Sa`id bin Jubair:","text":"Ibn `Abbas asked me, \"Are you married?\" I replied, \"No.\" He said, \"Marry, for the best person of this \n(Muslim) nation (i.e., Muhammad) of all other Muslims, had the largest number of wives.\""}},{"id":8,"idInBook":8,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا يَحْيَى بْنُ قَزَعَةَ، حَدَّثَنَا مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ الْحَارِثِ، عَنْ عَلْقَمَةَ بْنِ وَقَّاصٍ، عَنْ عُمَرَ بْنِ الْخَطَّابِ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ الْعَمَلُ بِالنِّيَّةِ، وَإِنَّمَا لاِمْرِئٍ مَا نَوَى، فَمَنْ كَانَتْ هِجْرَتُهُ إِلَى اللَّهِ وَرَسُولِهِ فَهِجْرَتُهُ إِلَى اللَّهِ وَرَسُولِهِ صلى الله عليه وسلم وَمَنْ كَانَتْ هِجْرَتُهُ إِلَى دُنْيَا يُصِيبُهَا أَوِ امْرَأَةٍ يَنْكِحُهَا، فَهِجْرَتُهُ إِلَى مَا هَاجَرَ إِلَيْهِ ‏\"‏‏.‏","english":{"narrator":"Narrated `Umar bin Al-Khattab:","text":"The Prophet (ﷺ) said, \"The rewards (of deeds) are according to the intention, and everybody will get the \nreward for what he has intended. So whoever emigrated for Allah's and His Apostle's sake, his \nemigration was for Allah and His Apostle; and whoever emigrated for worldly benefits, or to marry a \nwoman, then his emigration was for the thing for what he emigrated for.\" (1)"}},{"id":9,"idInBook":9,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى، حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي قَيْسٌ، عَنِ ابْنِ مَسْعُودٍ ـ رضى الله عنه ـ قَالَ كُنَّا نَغْزُو مَعَ النَّبِيِّ صلى الله عليه وسلم وَلَيْسَ لَنَا نِسَاءٌ فَقُلْنَا يَا رَسُولَ اللَّهِ أَلاَ نَسْتَخْصِي فَنَهَانَا عَنْ ذَلِكَ‏.‏","english":{"narrator":"Narrated Ibn Masud:","text":"We used to fight in the holy battles in the company of the Prophet (ﷺ) and we had no wives with us. So \nwe said, \"O Allah's Messenger (ﷺ)! Shall we get castrated?\" The Prophet (ﷺ) forbade us to do so."}},{"id":10,"idInBook":10,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، عَنْ سُفْيَانَ، عَنْ حُمَيْدٍ الطَّوِيلِ، قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، قَالَ قَدِمَ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ فَآخَى النَّبِيُّ صلى الله عليه وسلم بَيْنَهُ وَبَيْنَ سَعْدِ بْنِ الرَّبِيعِ الأَنْصَارِيِّ وَعِنْدَ الأَنْصَارِيِّ امْرَأَتَانِ، فَعَرَضَ عَلَيْهِ أَنْ يُنَاصِفَهُ أَهْلَهُ وَمَالَهُ فَقَالَ بَارَكَ اللَّهُ لَكَ فِي أَهْلِكَ وَمَالِكَ دُلُّونِي عَلَى السُّوقِ، فَأَتَى السُّوقَ فَرَبِحَ شَيْئًا مِنْ أَقِطٍ وَشَيْئًا مِنْ سَمْنٍ فَرَآهُ النَّبِيُّ صلى الله عليه وسلم بَعْدَ أَيَّامٍ وَعَلَيْهِ وَضَرٌ مِنْ صُفْرَةٍ فَقَالَ ‏\"‏ مَهْيَمْ يَا عَبْدَ الرَّحْمَنِ ‏\"‏‏.‏ فَقَالَ تَزَوَّجْتُ أَنْصَارِيَّةً‏.‏ قَالَ ‏\"‏ فَمَا سُقْتَ ‏\"‏‏.‏ قَالَ وَزْنَ نَوَاةٍ مِنْ ذَهَبٍ‏.‏ قَالَ ‏\"‏ أَوْلِمْ وَلَوْ بِشَاةٍ ‏\"‏‏.‏","english":{"narrator":"Narrated Anas bin Malik:","text":"`Abdur-Rahman bin `Auf came (from Mecca to Medina) and the Prophet (ﷺ) made a bond of brotherhood \nbetween him and Sa`d bin Ar-Rabi` Al-Ansari. Al-Ansari had two wives, so he suggested that `Abdur- \nRahman take half, his wives and property. `Abdur-Rahman replied, \"May Allah bless you with your \nwives and property. Kindly show me the market.\" So `Abdur-Rahman went to the market and gained \n(in bargains) some dried yoghurt and some butter. After a few days the Prophet (ﷺ) saw `Abdur-Rahman \nwith some yellow stains on his clothes and asked him, \"What is that, O `Abdur-Rahman?\" He replied, \n\"I had married an Ansari woman.\" The Prophet (ﷺ) asked, \"How much Mahr did you give her?\" He \nreplied, \"The weight of one (date) stone of gold.\" The Prophet (ﷺ) said, \"Offer a banquet, even with one \nsheep.\""}},{"id":11,"idInBook":11,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، أَخْبَرَنَا ابْنُ شِهَابٍ، سَمِعَ سَعِيدَ بْنَ الْمُسَيَّبِ، يَقُولُ سَمِعْتُ سَعْدَ بْنَ أَبِي وَقَّاصٍ، يَقُولُ رَدَّ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى عُثْمَانَ بْنِ مَظْعُونٍ التَّبَتُّلَ، وَلَوْ أَذِنَ لَهُ لاَخْتَصَيْنَا‏.‏","english":{"narrator":"Narrated Sa`d bin Abi Waqqas:","text":"Allah's Messenger (ﷺ) forbade `Uthman bin Maz'un to abstain from marrying (and other pleasures) and if he \nhad allowed him, we would have gotten ourselves castrated."}},{"id":12,"idInBook":12,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّهُ سَمِعَ سَعْدَ بْنَ أَبِي وَقَّاصٍ، يَقُولُ لَقَدْ رَدَّ ذَلِكَ ـ يَعْنِي النَّبِيَّ صلى الله عليه وسلم ـ عَلَى عُثْمَانَ، وَلَوْ أَجَازَ لَهُ التَّبَتُّلَ لاَخْتَصَيْنَا‏.‏","english":{"narrator":"Narrated Sa`d bin Abi Waqqas:","text":"The Prophet (ﷺ) prevented `Uthman bin Mazun from that (not marrying), and had he allowed him, we \nwould have got ourselves castrated."}},{"id":13,"idInBook":13,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَرِيرٌ، عَنْ إِسْمَاعِيلَ، عَنْ قَيْسٍ، قَالَ قَالَ عَبْدُ اللَّهِ كُنَّا نَغْزُو مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَلَيْسَ لَنَا شَىْءٌ فَقُلْنَا أَلاَ نَسْتَخْصِي فَنَهَانَا عَنْ ذَلِكَ ثُمَّ رَخَّصَ لَنَا أَنْ نَنْكِحَ الْمَرْأَةَ بِالثَّوْبِ، ثُمَّ قَرَأَ عَلَيْنَا ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا لاَ تُحَرِّمُوا طَيِّبَاتِ مَا أَحَلَّ اللَّهُ لَكُمْ وَلاَ تَعْتَدُوا إِنَّ اللَّهَ لاَ يُحِبُّ الْمُعْتَدِينَ‏}‏‏.‏","english":{"narrator":"Narrated 'Abdullah:","text":"We used to participate in the holy battles led by Allah's Messenger (ﷺ) and \n     we had nothing (no wives) with us. So we said, \"Shall we get ourselves\n     castrated?\" He forbade us that and then allowed us to marry women with\n     a temporary contract (2) and recited to us: -- 'O you who believe ! \n     Make not unlawful the good things which Allah has made lawful for you,\n     but commit no transgression.' (5.87)"}},{"id":14,"idInBook":14,"chapterId":67,"bookId":1,"arabic":"وَقَالَ أَصْبَغُ أَخْبَرَنِي ابْنُ وَهْبٍ، عَنْ يُونُسَ بْنِ يَزِيدَ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ إِنِّي رَجُلٌ شَابٌّ وَأَنَا أَخَافُ عَلَى نَفْسِي الْعَنَتَ وَلاَ أَجِدُ مَا أَتَزَوَّجُ بِهِ النِّسَاءَ، فَسَكَتَ عَنِّي، ثُمَّ قُلْتُ مِثْلَ ذَلِكَ، فَسَكَتَ عَنِّي ثُمَّ قُلْتُ مِثْلَ ذَلِكَ، فَسَكَتَ عَنِّي ثُمَّ قُلْتُ مِثْلَ ذَلِكَ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ يَا أَبَا هُرَيْرَةَ جَفَّ الْقَلَمُ بِمَا أَنْتَ لاَقٍ، فَاخْتَصِ عَلَى ذَلِكَ أَوْ ذَرْ ‏\"‏‏.‏","english":{"narrator":"Narrated Abu Huraira:","text":"I said, \"O Allah's Messenger (ﷺ)! I am a young man and I am afraid that I \n     may commit illegal sexual intercourse and I cannot afford to marry.\" \n     He kept silent, and then repeated my question once again, but he kept \n     silent. I said the same (for the third time) and he remained silent. \n     Then repeated my question (for the fourth time), and only then the \n     Prophet said, \"O Abu Huraira! The pen has dried after writing what you\n     are going to confront. So (it does not matter whether you) get \n     yourself castrated or not.\""}},{"id":15,"idInBook":15,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي أَخِي، عَنْ سُلَيْمَانَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ أَرَأَيْتَ لَوْ نَزَلْتَ وَادِيًا وَفِيهِ شَجَرَةٌ قَدْ أُكِلَ مِنْهَا، وَوَجَدْتَ شَجَرًا لَمْ يُؤْكَلْ مِنْهَا، فِي أَيِّهَا كُنْتَ تُرْتِعُ بَعِيرَكَ قَالَ ‏\n\"‏ فِي الَّذِي لَمْ يُرْتَعْ مِنْهَا ‏\"‏‏.‏ تَعْنِي أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَمْ يَتَزَوَّجْ بِكْرًا غَيْرَهَا‏.‏","english":{"narrator":"Narrated `Aisha:","text":"I said, \"O Allah's Messenger (ﷺ)! Suppose you landed in a valley where there is a tree of which something \nhas been eaten and then you found trees of which nothing has been eaten, of which tree would you let \nyour camel graze?\" He said, \"(I will let my camel graze) of the one of which nothing has been eaten \nbefore.\" (The sub-narrator added: `Aisha meant that Allah's Messenger (ﷺ) had not married a virgin besides \nherself .)"}},{"id":16,"idInBook":16,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا عُبَيْدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أُرِيتُكِ فِي الْمَنَامِ مَرَّتَيْنِ، إِذَا رَجُلٌ يَحْمِلُكِ فِي سَرَقَةِ حَرِيرٍ فَيَقُولُ هَذِهِ امْرَأَتُكَ، فَأَكْشِفُهَا فَإِذَا هِيَ أَنْتِ، فَأَقُولُ إِنْ يَكُنْ هَذَا مِنْ عِنْدِ اللَّهِ يُمْضِهِ ‏\"‏‏.‏","english":{"narrator":"Narrated `Aisha:","text":"Allah's Messenger (ﷺ) said (to me), \"You have been shown to me twice in (my) dreams. A man was carrying \nyou in a silken cloth and said to me, 'This is your wife.' I uncovered it; and behold, it was you. I said \nto myself, 'If this dream is from Allah, He will cause it to come true.' \""}},{"id":17,"idInBook":17,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا هُشَيْمٌ، حَدَّثَنَا سَيَّارٌ، عَنِ الشَّعْبِيِّ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ قَفَلْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم مِنْ غَزْوَةٍ فَتَعَجَّلْتُ عَلَى بَعِيرٍ لِي قَطُوفٍ، فَلَحِقَنِي رَاكِبٌ مِنْ خَلْفِي، فَنَخَسَ بَعِيرِي بِعَنَزَةٍ كَانَتْ مَعَهُ، فَانْطَلَقَ بَعِيرِي كَأَجْوَدِ مَا أَنْتَ رَاءٍ مِنَ الإِبِلِ، فَإِذَا النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\"‏ مَا يُعْجِلُكَ ‏\"‏‏.‏ قُلْتُ كُنْتُ حَدِيثَ عَهْدٍ بِعُرُسٍ‏.‏ قَالَ ‏\"‏ بِكْرًا أَمْ ثَيِّبًا ‏\"‏‏.‏ قُلْتُ ثَيِّبٌ‏.‏ قَالَ ‏\"‏ فَهَلاَّ جَارِيَةً تُلاَعِبُهَا وَتُلاَعِبُكَ ‏\"‏‏.‏ قَالَ فَلَمَّا ذَهَبْنَا لِنَدْخُلَ قَالَ ‏\"‏ أَمْهِلُوا حَتَّى تَدْخُلُوا لَيْلاً ـ أَىْ عِشَاءً ـ لِكَىْ تَمْتَشِطَ الشَّعِثَةُ وَتَسْتَحِدَّ الْمُغِيبَةُ ‏\"‏‏.‏","english":{"narrator":"Narrated Jabir bin `Abdullah:","text":"While we were returning from a Ghazwa (Holy Battle) with the Prophet, I started driving my camel \nfast, as it was a lazy camel A rider came behind me and pricked my camel with a spear he had with \nhim, and then my camel started running as fast as the best camel you may see. Behold! The rider was \nthe Prophet (ﷺ) himself. He said, 'What makes you in such a hurry?\" I replied, I am newly married \" He \nsaid, \"Did you marry a virgin or a matron? I replied, \"A matron.\" He said, \"Why didn't you marry a \nyoung girl so that you may play with her and she with you?\" When we were about to enter (Medina), \nthe Prophet (ﷺ) said, \"Wait so that you may enter (Medina) at night so that the lady of unkempt hair may \ncomb her hair and the one whose husband has been absent may shave her pubic region."}},{"id":18,"idInBook":18,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا مُحَارِبٌ، قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ، رضى الله عنهما يَقُولُ تَزَوَّجْتُ فَقَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا تَزَوَّجْتَ ‏\"‏‏.‏ فَقُلْتُ تَزَوَّجْتُ ثَيِّبًا‏.‏ فَقَالَ ‏\"‏ مَا لَكَ وَلِلْعَذَارَى وَلِعَابِهَا ‏\"‏‏.‏ فَذَكَرْتُ ذَلِكَ لِعَمْرِو بْنِ دِينَارٍ فَقَالَ عَمْرٌو سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ قَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَلاَّ جَارِيَةً تُلاَعِبُهَا وَتُلاَعِبُكَ ‏\"‏‏.‏","english":{"narrator":"Narrated Jabir bin `Abdullah:","text":"When I got married, Allah's Messenger (ﷺ) said to me, \"What type of lady have you married?\" I replied, \"I \nhave married a matron' He said, \"Why, don't you have a liking for the virgins and for fondling them?\" \nJabir also said: Allah's Messenger (ﷺ) said, \"Why didn't you marry a young girl so that you might play with \nher and she with you?'"}},{"id":19,"idInBook":19,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، عَنْ يَزِيدَ، عَنْ عِرَاكٍ، عَنْ عُرْوَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم خَطَبَ عَائِشَةَ إِلَى أَبِي بَكْرٍ فَقَالَ لَهُ أَبُو بَكْرٍ إِنَّمَا أَنَا أَخُوكَ، فَقَالَ ‏\n\"‏ أَنْتَ أَخِي فِي دِينِ اللَّهِ وَكِتَابِهِ وَهْىَ لِي حَلاَلٌ ‏\"‏‏.‏","english":{"narrator":"Narrated 'Urwa:","text":"The Prophet (ﷺ) asked Abu Bakr for `Aisha's hand in marriage. Abu Bakr said \"But I am your brother.\" \nThe Prophet (ﷺ) said, \"You are my brother in Allah's religion and His Book, but she (Aisha) is lawful for \nme to marry.\""}},{"id":20,"idInBook":20,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ خَيْرُ نِسَاءٍ رَكِبْنَ الإِبِلَ صَالِحُو نِسَاءِ قُرَيْشٍ، أَحْنَاهُ عَلَى وَلَدٍ فِي صِغَرِهِ وَأَرْعَاهُ عَلَى زَوْجٍ فِي ذَاتِ يَدِهِ ‏\"‏‏.‏","english":{"narrator":"Narrated Abu Huraira:","text":"The Prophet (ﷺ) said, \"The best women are the riders of the camels and the righteous among the women \nof Quraish. They are the kindest women to their children in their childhood and the more careful \nwomen of the property of their husbands.\""}},{"id":21,"idInBook":21,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا صَالِحُ بْنُ صَالِحٍ الْهَمْدَانِيُّ، حَدَّثَنَا الشَّعْبِيُّ، قَالَ حَدَّثَنِي أَبُو بُرْدَةَ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَيُّمَا رَجُلٍ كَانَتْ عِنْدَهُ وَلِيدَةٌ فَعَلَّمَهَا فَأَحْسَنَ تَعْلِيمَهَا، وَأَدَّبَهَا فَأَحْسَنَ تَأْدِيبَهَا، ثُمَّ أَعْتَقَهَا وَتَزَوَّجَهَا فَلَهُ أَجْرَانِ، وَأَيُّمَا رَجُلٍ مِنْ أَهْلِ الْكِتَابِ آمَنَ بِنَبِيِّهِ وَآمَنَ بِي فَلَهُ أَجْرَانِ، وَأَيُّمَا مَمْلُوكٍ أَدَّى حَقَّ مَوَالِيهِ وَحَقَّ رَبِّهِ فَلَهُ أَجْرَانِ ‏\"‏‏.‏ قَالَ الشَّعْبِيُّ خُذْهَا بِغَيْرِ شَىْءٍ قَدْ كَانَ الرَّجُلُ يَرْحَلُ فِيمَا دُونَهُ إِلَى الْمَدِينَةِ‏.‏ وَقَالَ أَبُو بَكْرٍ عَنْ أَبِي حَصِينٍ عَنْ أَبِي بُرْدَةَ عَنْ أَبِيهِ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ أَعْتَقَهَا ثُمَّ أَصْدَقَهَا ‏\"‏‏.‏","english":{"narrator":"Narrated Abu Burda's father:","text":"Allah's Messenger (ﷺ) said, any man who has a slave girl whom he educates properly, teaches good manners, \nmanumits and marries her, will get a double reward And if any man of the people of the Scriptures \nbelieves in his own prophet and then believes in me too, he will (also) get a double reward And any \nslave who fulfills his duty to his master and to his Lord, will (also) get a double reward.\""}},{"id":22,"idInBook":22,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا سَعِيدُ بْنُ تَلِيدٍ، قَالَ أَخْبَرَنِي ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي جَرِيرُ بْنُ حَازِمٍ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم‏.‏ حَدَّثَنَا سُلَيْمَانُ عَنْ حَمَّادِ بْنِ زَيْدٍ عَنْ أَيُّوبَ عَنْ مُحَمَّدٍ عَنْ أَبِي هُرَيْرَةَ ‏{‏قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم‏}‏ ‏\n\"‏ لَمْ يَكْذِبْ إِبْرَاهِيمُ إِلاَّ ثَلاَثَ كَذَبَاتٍ بَيْنَمَا إِبْرَاهِيمُ مَرَّ بِجَبَّارٍ وَمَعَهُ سَارَةُ ـ فَذَكَرَ الْحَدِيثَ ـ فَأَعْطَاهَا هَاجَرَ قَالَتْ كَفَّ اللَّهُ يَدَ الْكَافِرِ وَأَخْدَمَنِي آجَرَ ‏\"‏‏.‏ قَالَ أَبُو هُرَيْرَةَ فَتِلْكَ أُمُّكُمْ يَا بَنِي مَاءِ السَّمَاءِ‏.‏","english":{"narrator":"Narrated Abu Huraira:","text":"The Prophet (ﷺ) said: Abraham did not tell lies except three. (One of them was) when Abraham passed by \na tyrant and (his wife) Sara was accompanying him (Abu Huraira then mentioned the whole narration \nand said:) (The tyrant) gave her Hajar. Sara said, \"Allah saved me from the hands of the Kafir (i.e. \ninfidel) and gave me Hajar to serve me.\" (Abu Huraira added:) That (Hajar) is your mother, O Banu \nMa'-As-Sama' (i.e., the Arabs)."}},{"id":23,"idInBook":23,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ أَقَامَ النَّبِيُّ صلى الله عليه وسلم بَيْنَ خَيْبَرَ وَالْمَدِينَةِ ثَلاَثًا يُبْنَى عَلَيْهِ بِصَفِيَّةَ بِنْتِ حُيَىٍّ فَدَعَوْتُ الْمُسْلِمِينَ إِلَى وَلِيمَتِهِ فَمَا كَانَ فِيهَا مِنْ خُبْزٍ وَلاَ لَحْمٍ، أُمِرَ بِالأَنْطَاعِ فَأَلْقَى فِيهَا مِنَ التَّمْرِ وَالأَقِطِ وَالسَّمْنِ فَكَانَتْ وَلِيمَتَهُ، فَقَالَ الْمُسْلِمُونَ إِحْدَى أُمَّهَاتِ الْمُؤْمِنِينَ أَوْ مِمَّا مَلَكَتْ يَمِينُهُ، فَقَالُوا إِنْ حَجَبَهَا فَهْىَ مِنْ أُمَّهَاتِ الْمُؤْمِنِينَ، وَإِنْ لَمْ يَحْجُبْهَا فَهْىَ مِمَّا مَلَكَتْ يَمِينُهُ، فَلَمَّا ارْتَحَلَ وَطَّى لَهَا خَلْفَهُ وَمَدَّ الْحِجَابَ بَيْنَهَا وَبَيْنَ النَّاسِ‏.‏","english":{"narrator":"Narrated Anas:","text":"The Prophet (ﷺ) stayed for three days between Khaibar and Medina, and there he consummated his \nmarriage to Safiyya bint Huyai. I invited the Muslims to the wedding banquet in which neither meat \nnor bread was offered. He ordered for leather dining-sheets to be spread, and dates, dried yoghurt and \nbutter were laid on it, and that was the Prophet's wedding banquet. The Muslims wondered, \"Is she \n(Saffiyya) considered as his wife or his slave girl?\" Then they said, \"If he orders her to veil herself, \nshe will be one of the mothers of the Believers; but if he does not order her to veil herself, she will be \na slave girl. So when the Prophet (ﷺ) proceeded from there, he spared her a space behind him (on his shecamel) \nand put a screening veil between her and the people."}},{"id":24,"idInBook":24,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا حَمَّادٌ، عَنْ ثَابِتٍ، وَشُعَيْبِ بْنِ الْحَبْحَابِ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَعْتَقَ صَفِيَّةَ، وَجَعَلَ عِتْقَهَا صَدَاقَهَا‏.‏","english":{"narrator":"Narrated Anas bin Malik:","text":"Allah's Messenger (ﷺ) manumitted Safiyya and regarded her manumission as her Mahr."}},{"id":25,"idInBook":25,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، عَنْ أَبِيهِ، عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ، قَالَ جَاءَتِ امْرَأَةٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ جِئْتُ أَهَبُ لَكَ نَفْسِي قَالَ فَنَظَرَ إِلَيْهَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَصَعَّدَ النَّظَرَ فِيهَا وَصَوَّبَهُ ثُمَّ طَأْطَأَ رَسُولُ اللَّهِ صلى الله عليه وسلم رَأْسَهُ فَلَمَّا رَأَتِ الْمَرْأَةُ أَنَّهُ لَمْ يَقْضِ فِيهَا شَيْئًا جَلَسَتْ فَقَامَ رَجُلٌ مِنْ أَصْحَابِهِ فَقَالَ يَا رَسُولَ اللَّهِ إِنْ لَمْ يَكُنْ لَكَ بِهَا حَاجَةٌ فَزَوِّجْنِيهَا‏.‏ فَقَالَ ‏\"‏ وَهَلْ عِنْدَكَ مِنْ شَىْءٍ ‏\"‏‏.‏ قَالَ لاَ وَاللَّهِ يَا رَسُولَ اللَّهِ‏.‏ فَقَالَ ‏\"‏ اذْهَبْ إِلَى أَهْلِكَ فَانْظُرْ هَلْ تَجِدُ شَيْئًا ‏\"‏‏.‏ فَذَهَبَ ثُمَّ رَجَعَ فَقَالَ لاَ وَاللَّهِ مَا وَجَدْتُ شَيْئًا‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ انْظُرْ وَلَوْ خَاتَمًا مِنْ حَدِيدٍ ‏\"‏‏.‏ فَذَهَبَ ثُمَّ رَجَعَ فَقَالَ لاَ وَاللَّهِ يَا رَسُولَ اللَّهِ وَلاَ خَاتَمًا مِنْ حَدِيدٍ وَلَكِنْ هَذَا إِزَارِي ـ قَالَ سَهْلٌ مَا لَهُ رِدَاءٌ فَلَهَا نِصْفُهُ ـ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا تَصْنَعُ بِإِزَارِكَ إِنْ لَبِسْتَهُ لَمْ يَكُنْ عَلَيْهَا مِنْهُ شَىْءٌ وَإِنْ لَبِسَتْهُ لَمْ يَكُنْ عَلَيْكَ شَىْءٌ ‏\"‏‏.‏ فَجَلَسَ الرَّجُلُ حَتَّى إِذَا طَالَ مَجْلِسُهُ قَامَ فَرَآهُ رَسُولُ اللَّهِ صلى الله عليه وسلم مُوَلِّيًا فَأَمَرَ بِهِ فَدُعِيَ فَلَمَّا جَاءَ قَالَ ‏\"‏ مَاذَا مَعَكَ مِنَ الْقُرْآنِ ‏\"‏‏.‏ قَالَ مَعِي سُورَةُ كَذَا وَسُورَةُ كَذَا عَدَّدَهَا‏.‏ فَقَالَ ‏\"‏ تَقْرَؤُهُنَّ عَنْ ظَهْرِ قَلْبِكَ ‏\"‏‏.‏ قَالَ نَعَمْ‏.‏ قَالَ ‏\"‏ اذْهَبْ فَقَدْ مَلَّكْتُكَهَا بِمَا مَعَكَ مِنَ الْقُرْآنِ ‏\"‏‏.‏","english":{"narrator":"Narrated Sahl bin Sa`d As-Sa`idi:","text":"A woman came to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! I have come to give you myself in \nmarriage (without Mahr).\" Allah's Messenger (ﷺ) looked at her. He looked at her carefully and fixed his \nglance on her and then lowered his head. When the lady saw that he did not say anything, she sat \ndown. A man from his companions got up and said, \"O Allah's Messenger (ﷺ)! If you are not in need of her, \nthen marry her to me.\" The Prophet (ﷺ) said, \"Have you got anything to offer?\" The man said, \"No, by \nAllah, O Allah's Messenger (ﷺ)!\" The Prophet (ﷺ) said (to him), \"Go to your family and see if you have \nsomething.\" The man went and returned, saying, \"No, by Allah, I have not found anything.\" Allah's \nApostle said, \"(Go again) and look for something, even if it is an iron ring.\" He went again and \nreturned, saying, \"No, by Allah, O Allah's Messenger (ﷺ)! I could not find even an iron ring, but this is my \nIzar (waist sheet).\" He had no rida. He added, \"I give half of it to her.\" Allah's Messenger (ﷺ) said, \"What \nwill she do with your Izar? If you wear it, she will be naked, and if she wears it, you will be naked.\" \nSo that man sat down for a long while and then got up (to depart). When Allah's Messenger (ﷺ) saw him \ngoing, he ordered that he be called back. When he came, the Prophet (ﷺ) said, \"How much of the Qur'an \ndo you know?\" He said, \"I know such Sura and such Sura,\" counting them. The Prophet (ﷺ) said, \"Do you \nknow them by heart?\" He replied, \"Yes.\" The Prophet (ﷺ) said, \"Go, I marry her to you for that much of \nthe Qur'an which you have.\""}},{"id":26,"idInBook":26,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ أَبَا حُذَيْفَةَ بْنَ عُتْبَةَ بْنِ رَبِيعَةَ بْنِ عَبْدِ شَمْسٍ،، وَكَانَ، مِمَّنْ شَهِدَ بَدْرًا مَعَ النَّبِيِّ صلى الله عليه وسلم تَبَنَّى سَالِمًا، وَأَنْكَحَهُ بِنْتَ أَخِيهِ هِنْدَ بِنْتَ الْوَلِيدِ بْنِ عُتْبَةَ بْنِ رَبِيعَةَ وَهْوَ مَوْلًى لاِمْرَأَةٍ مِنَ الأَنْصَارِ، كَمَا تَبَنَّى النَّبِيُّ صلى الله عليه وسلم زَيْدًا، وَكَانَ مَنْ تَبَنَّى رَجُلاً فِي الْجَاهِلِيَّةِ دَعَاهُ النَّاسُ إِلَيْهِ وَوَرِثَ مِنْ مِيرَاثِهِ حَتَّى أَنْزَلَ اللَّهُ ‏{‏ادْعُوهُمْ لآبَائِهِمْ‏}‏ إِلَى قَوْلِهِ ‏{‏وَمَوَالِيكُمْ‏}‏ فَرُدُّوا إِلَى آبَائِهِمْ، فَمَنْ لَمْ يُعْلَمْ لَهُ أَبٌ كَانَ مَوْلًى وَأَخًا فِي الدِّينِ، فَجَاءَتْ سَهْلَةُ بِنْتُ سُهَيْلِ بْنِ عَمْرٍو الْقُرَشِيِّ ثُمَّ الْعَامِرِيِّ ـ وَهْىَ امْرَأَةُ أَبِي حُذَيْفَةَ ـ النَّبِيَّ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّا كُنَّا نَرَى سَالِمًا وَلَدًا وَقَدْ أَنْزَلَ اللَّهُ فِيهِ مَا قَدْ عَلِمْتَ فَذَكَرَ الْحَدِيثَ‏.‏","english":{"narrator":"Narrated `Aisha:","text":"Abu Hudhaifa bin `Utba bin Rabi`a bin `Abdi Shams who had witnessed the battle of Badr along with \nthe Prophet (ﷺ) adopted Salim as his son, to whom he married his niece, Hind bint Al-Walid bin `Utba bin \nRabi`a; and Salim was the freed slave of an Ansar woman, just as the Prophet (ﷺ) had adopted Zaid as his \nson. It was the custom in the Pre-lslamic Period that if somebody adopted a boy, the people would call \nhim the son of the adoptive father and he would be the latter's heir. But when Allah revealed the \nDivine Verses: 'Call them by (the names of) their fathers . . . your freed-slaves,' (33.5) the adopted \npersons were called by their fathers' names. The one whose father was not known, would be regarded \nas a Maula and your brother in religion. Later on Sahla bint Suhail bin `Amr Al-Quraishi Al-`Amiri-- \nand she was the wife of Abu- Hudhaifa bin `Utba--came to the Prophet (ﷺ) and said, \"O Allah's Messenger (ﷺ)! \nWe used to consider Salim as our (adopted) son, and now Allah has revealed what you know \n(regarding adopted sons).\" The sub-narrator then mentioned the rest of the narration."}},{"id":27,"idInBook":27,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا عُبَيْدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ دَخَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى ضُبَاعَةَ بِنْتِ الزُّبَيْرِ فَقَالَ لَهَا ‏\"‏ لَعَلَّكِ أَرَدْتِ الْحَجَّ ‏\"‏‏.‏ قَالَتْ وَاللَّهِ لاَ أَجِدُنِي إِلاَّ وَجِعَةً‏.‏ فَقَالَ لَهَا ‏\"‏ حُجِّي وَاشْتَرِطِي، قُولِي اللَّهُمَّ مَحِلِّي حَيْثُ حَبَسْتَنِي ‏\"‏‏.‏ وَكَانَتْ تَحْتَ الْمِقْدَادِ بْنِ الأَسْوَدِ‏.‏","english":{"narrator":"Narrated `Aisha:","text":"Allah's Messenger (ﷺ) entered upon Dubaa bint Az-Zubair and said to her, \"Do you have a desire to perform \nthe Hajj?\" She replied, \"By Allah, I feel sick.\" He said to her, \"Intend to perform Hajj and stipulate \nsomething by saying, 'O Allah, I will finish my Ihram at any place where You stop me (i.e. I am \nunable to go further).\" She was the wife of Al-Miqdad bin Al-Aswad."}},{"id":28,"idInBook":28,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، قَالَ حَدَّثَنِي سَعِيدُ بْنُ أَبِي سَعِيدٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ تُنْكَحُ الْمَرْأَةُ لأَرْبَعٍ لِمَالِهَا وَلِحَسَبِهَا وَجَمَالِهَا وَلِدِينِهَا، فَاظْفَرْ بِذَاتِ الدِّينِ تَرِبَتْ يَدَاكَ ‏\"‏‏.‏","english":{"narrator":"Narrated Abu Huraira:","text":"The Prophet (ﷺ) said, \"A woman is married for four things, i.e., her wealth, her family status, her beauty \nand her religion. So you should marry the religious woman (otherwise) you will be a losers."}},{"id":29,"idInBook":29,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا إِبْرَاهِيمُ بْنُ حَمْزَةَ، حَدَّثَنَا ابْنُ أَبِي حَازِمٍ، عَنْ أَبِيهِ، عَنْ سَهْلٍ، قَالَ مَرَّ رَجُلٌ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ مَا تَقُولُونَ فِي هَذَا ‏\"‏‏.‏ قَالُوا حَرِيٌّ إِنْ خَطَبَ أَنْ يُنْكَحَ، وَإِنْ شَفَعَ أَنْ يُشَفَّعَ، وَإِنْ قَالَ أَنْ يُسْتَمَعَ‏.‏ قَالَ ثُمَّ سَكَتَ فَمَرَّ رَجُلٌ مِنَ فُقَرَاءِ الْمُسْلِمِينَ فَقَالَ ‏\"‏ مَا تَقُولُونَ فِي هَذَا ‏\"‏‏.‏ قَالُوا حَرِيٌّ إِنْ خَطَبَ أَنْ لاَ يُنْكَحَ وَإِنْ شَفَعَ أَنْ لاَ يُشَفَّعَ، وَإِنْ قَالَ أَنْ لاَ يُسْتَمَعَ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَذَا خَيْرٌ مِنْ مِلْءِ الأَرْضِ مِثْلَ هَذَا ‏\"‏‏.‏","english":{"narrator":"Narrated Sahl:","text":"A man passed by Allah's Messenger (ﷺ) and Allah s Apostle asked (his companions) \"What do you say about \nthis (man)?\" They replied \"If he asks for a lady's hand, he ought to be given her in marriage; and if he \nintercedes (for someone) his intercessor should be accepted; and if he speaks, he should be listened \nto.\" Allah's Messenger (ﷺ) kept silent, and then a man from among the poor Muslims passed by, an Allah's \nApostle asked (them) \"What do you say about this man?\" They replied, \"If he asks for a lady's hand in \nmarriage he does not deserve to be married, and he intercedes (for someone), his intercession should \nnot be accepted; And if he speaks, he should not be listened to.' Allah's Messenger (ﷺ) said, \"This poor man \nis better than so many of the first as filling the earth.'"}},{"id":30,"idInBook":30,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنِي يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عُرْوَةُ، أَنَّهُ سَأَلَ عَائِشَةَ ـ رضى الله عنها ـ ‏{‏وَإِنْ خِفْتُمْ أَنْ لاَ تُقْسِطُوا فِي الْيَتَامَى‏}‏ قَالَتْ يَا ابْنَ أُخْتِي هَذِهِ الْيَتِيمَةُ تَكُونُ فِي حَجْرِ وَلِيِّهَا فَيَرْغَبُ فِي جَمَالِهَا وَمَالِهَا، وَيُرِيدُ أَنْ يَنْتَقِصَ صَدَاقَهَا، فَنُهُوا عَنْ نِكَاحِهِنَّ إِلاَّ أَنْ يُقْسِطُوا فِي إِكْمَالِ الصَّدَاقِ، وَأُمِرُوا بِنِكَاحِ مَنْ سِوَاهُنَّ، قَالَتْ وَاسْتَفْتَى النَّاسُ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعْدَ ذَلِكَ، فَأَنْزَلَ اللَّهُ ‏{‏وَيَسْتَفْتُونَكَ فِي النِّسَاءِ‏}‏ إِلَى ‏{‏وَتَرْغَبُونَ أَنْ تَنْكِحُوهُنَّ‏}‏ فَأَنْزَلَ اللَّهُ لَهُمْ أَنَّ الْيَتِيمَةَ إِذَا كَانَتْ ذَاتَ جَمَالٍ وَمَالٍ رَغِبُوا فِي نِكَاحِهَا وَنَسَبِهَا فِي إِكْمَالِ الصَّدَاقِ، وَإِذَا كَانَتْ مَرْغُوبَةً عَنْهَا فِي قِلَّةِ الْمَالِ وَالْجَمَالِ تَرَكُوهَا وَأَخَذُوا غَيْرَهَا مِنَ النِّسَاءِ، قَالَتْ فَكَمَا يَتْرُكُونَهَا حِينَ يَرْغَبُونَ عَنْهَا فَلَيْسَ لَهُمْ أَنْ يَنْكِحُوهَا إِذَا رَغِبُوا فِيهَا إِلاَّ أَنْ يُقْسِطُوا لَهَا وَيُعْطُوهَا حَقَّهَا الأَوْفَى فِي الصَّدَاقِ‏.‏","english":{"narrator":"Narrated 'Urwa:","text":"that he asked `Aisha regarding the Verse: 'If you fear that you shall not be able to deal justly with the \norphans (4.3) She said, \"O my nephew! This Verse refers to the orphan girl who is under the \nguardianship of her guardian who likes her beauty and wealth and wishes to (marry her and) curtails \nher Mahr. Such guardians have been forbidden to marry them unless they do justice by giving them \ntheir full Mahr, and they have been ordered to marry other than them. The people asked for the verdict \nof Allah's Messenger (ﷺ) after that, so Allah revealed: 'They ask your instruction concerning the women . . . \nwhom you desire to marry.' (4.127) So Allah revealed to them that if the orphan girl had beauty and \nwealth, they desired to marry her and for her family status. They can only marry them if they give \nthem their full Mahr. And if they had no desire to marry them because of their lack of wealth and \nbeauty, they would leave them and marry other women. So, as they used to leave them, when they had \nno interest, in them, they were forbidden to marry them when they had such interest, unless they \ntreated them justly and gave them their full Mahr Apostle said, 'If at all there is evil omen, it is in the \nhorse, the woman and the house.\" a lady is to be warded off. And the Statement of Allah: 'Truly, \namong your wives and your children, there are enemies for you (i.e may stop you from the obedience \nof Allah)' (64.14)"}},{"id":31,"idInBook":31,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ حَمْزَةَ، وَسَالِمٍ، ابْنَىْ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ الشُّؤْمُ فِي الْمَرْأَةِ وَالدَّارِ وَالْفَرَسِ ‏\"‏‏.‏","english":{"narrator":"Narrated `Abdullah bin `Umar:","text":"Allah's Messenger (ﷺ) said, \"Evil omen is in the women, the house and the horse.'"}},{"id":32,"idInBook":32,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ مِنْهَالٍ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا عُمَرُ بْنُ مُحَمَّدٍ الْعَسْقَلاَنِيُّ، عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ، قَالَ ذَكَرُوا الشُّؤْمَ عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ إِنْ كَانَ الشُّؤْمُ فِي شَىْءٍ فَفِي الدَّارِ وَالْمَرْأَةِ وَالْفَرَسِ ‏\"‏‏.‏","english":{"narrator":"Narrated Ibn `Umar:","text":"Evil omen was mentioned before the Prophet: The Prophet (ﷺ) said, \"If there is evil omen in anything, it is \nin the house, the woman and the horse.\""}},{"id":33,"idInBook":33,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِنْ كَانَ فِي شَىْءٍ فَفِي الْفَرَسِ وَالْمَرْأَةِ وَالْمَسْكَنِ ‏\"‏‏.‏","english":{"narrator":"Narrated Sahl bin Sa`d:","text":"Allah's Messenger (ﷺ) said, \"If at all there is bad omen, it is in the horse, the woman, and the house.\""}},{"id":34,"idInBook":34,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، عَنْ سُلَيْمَانَ التَّيْمِيِّ، قَالَ سَمِعْتُ أَبَا عُثْمَانَ النَّهْدِيَّ، عَنْ أُسَامَةَ بْنِ زَيْدٍ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَا تَرَكْتُ بَعْدِي فِتْنَةً أَضَرَّ عَلَى الرِّجَالِ مِنَ النِّسَاءِ ‏\"‏‏.‏","english":{"narrator":"Narrated Usama bin Zaid:","text":"The Prophet (ﷺ) said, \"After me I have not left any trial more severe to men than women.\""}},{"id":35,"idInBook":35,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ كَانَ فِي بَرِيرَةَ ثَلاَثُ سُنَنٍ عَتَقَتْ فَخُيِّرَتْ، وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الْوَلاَءُ لِمَنْ أَعْتَقَ ‏\"‏‏.‏ وَدَخَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَبُرْمَةٌ عَلَى النَّارِ، فَقُرِّبَ إِلَيْهِ خُبْزٌ وَأُدْمٌ مِنْ أُدْمِ الْبَيْتِ فَقَالَ ‏\"‏ لَمْ أَرَ الْبُرْمَةَ ‏\"‏‏.‏ فَقِيلَ لَحْمٌ تُصُدِّقَ عَلَى بَرِيرَةَ، وَأَنْتَ لاَ تَأْكُلُ الصَّدَقَةَ قَالَ ‏\"‏ هُوَ عَلَيْهَا صَدَقَةٌ، وَلَنَا هَدِيَّةٌ ‏\"‏‏.‏","english":{"narrator":"Narrated `Aisha:","text":"Three principles were established because of Barira: (i) When Banra was manumitted she was given \nthe option (to remain with her slave husband or not). (ii) Allah's Messenger (ﷺ) said \"The Wala of the slave) \nis for the one who manumits (the slave). (iii) When Allah's Messenger (ﷺ) entered (the house), he saw a \ncooking pot on the fire but he was given bread and meat soup from the soup of the home. The Prophet (ﷺ) \nsaid, \"Didn't I see the cooking pot (on the fire)?\" It was said, \"That is the meat given in charity to \nBarira, and you do not eat the (things given in) charity.\" The Prophet (ﷺ) said, \"It is an object of charity \nfor Barira, and it is a present for us.\""}},{"id":36,"idInBook":36,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا مُحَمَّدٌ، أَخْبَرَنَا عَبْدَةُ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، ‏{‏وَإِنْ خِفْتُمْ أَنْ لاَ، تُقْسِطُوا فِي الْيَتَامَى‏}‏‏.‏ قَالَتِ الْيَتِيمَةُ تَكُونُ عِنْدَ الرَّجُلِ وَهْوَ وَلِيُّهَا، فَيَتَزَوَّجُهَا عَلَى مَالِهَا، وَيُسِيءُ صُحْبَتَهَا، وَلاَ يَعْدِلُ فِي مَالِهَا، فَلْيَتَزَوَّجْ مَا طَابَ لَهُ مِنَ النِّسَاءِ سِوَاهَا مَثْنَى وَثُلاَثَ وَرُبَاعَ‏.‏","english":{"narrator":"Narrated Aisha\":","text":"(regarding) the Verse: 'And if you fear that you shall not be able to deal justly with the orphans...' \n(4.3) It is about the orphan girl who is in the custody of a man who is her guardian, and he intends to \nmarry her because of her wealth, but he treats her badly and does not manage her property fairly and \nhonestly. Such a man should marry women of his liking other than her, two or three or four. \n'Prohibited to you (for marriage) are: ...your foster-mothers (who suckled you).' (4.23) Marriage is \nprohibited between persons having a foster suckling relationship corresponding to a blood relationship \nwhich renders marriage unlawful."}},{"id":37,"idInBook":37,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، أَنَّ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم أَخْبَرَتْهَا أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ عِنْدَهَا، وَأَنَّهَا سَمِعَتْ صَوْتَ رَجُلٍ يَسْتَأْذِنُ فِي بَيْتِ حَفْصَةَ، قَالَتْ فَقُلْتُ يَا رَسُولَ اللَّهِ هَذَا رَجُلٌ يَسْتَأْذِنُ فِي بَيْتِكَ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أُرَاهُ فُلاَنًا ‏\"‏‏.‏ لِعَمِّ حَفْصَةَ مِنَ الرَّضَاعَةِ‏.‏ قَالَتْ عَائِشَةُ لَوْ كَانَ فُلاَنٌ حَيًّا، لِعَمِّهَا مِنَ الرَّضَاعَةِ دَخَلَ عَلَىَّ فَقَالَ ‏\"‏ نَعَمِ الرَّضَاعَةُ تُحَرِّمُ مَا تُحَرِّمُ الْوِلاَدَةُ ‏\"‏‏.‏","english":{"narrator":"Narrated `Aisha:","text":"(the wife of the Prophet) that while Allah's Messenger (ﷺ) was with her, she heard a voice of a man asking \npermission to enter the house of Hafsa. `Aisha added: I said, \"O Allah's Messenger (ﷺ)! This man is asking \npermission to enter your house.\" The Prophet (ﷺ) said, \"I think he is so-and-so,\" naming the foster-uncle \nof Hafsa. `Aisha said, \"If so-and-so,\" naming her foster uncle, \"were living, could he enter upon me?\" \nThe Prophet (ﷺ) said, \"Yes, for foster suckling relations make all those things unlawful which are \nunlawful through corresponding birth (blood) relations.\""}},{"id":38,"idInBook":38,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ شُعْبَةَ، عَنْ قَتَادَةَ، عَنْ جَابِرِ بْنِ زَيْدٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قِيلَ لِلنَّبِيِّ صلى الله عليه وسلم أَلاَ تَزَوَّجُ ابْنَةَ حَمْزَةَ قَالَ ‏\n\"‏ إِنَّهَا ابْنَةُ أَخِي مِنَ الرَّضَاعَةِ ‏\"‏‏.‏ وَقَالَ بِشْرُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ سَمِعْتُ قَتَادَةَ سَمِعْتُ جَابِرَ بْنَ زَيْدٍ مِثْلَهُ‏.‏","english":{"narrator":"Narrated Ibn `Abbas:","text":"It was said to the Prophet, \"Won't you marry the daughter of Hamza?\" He said, \"She is my foster niece \n(brother's daughter). \""}},{"id":39,"idInBook":39,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا الْحَكَمُ بْنُ نَافِعٍ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ زَيْنَبَ ابْنَةَ أَبِي سَلَمَةَ، أَخْبَرَتْهُ أَنَّ أُمَّ حَبِيبَةَ بِنْتَ أَبِي سُفْيَانَ أَخْبَرَتْهَا أَنَّهَا، قَالَتْ يَا رَسُولَ اللَّهِ انْكِحْ أُخْتِي بِنْتَ أَبِي سُفْيَانَ فَقَالَ ‏\"‏ أَوَتُحِبِّينَ ذَلِكَ ‏\"‏‏.‏ فَقُلْتُ نَعَمْ، لَسْتُ لَكَ بِمُخْلِيَةٍ، وَأَحَبُّ مَنْ شَارَكَنِي فِي خَيْرٍ أُخْتِي‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّ ذَلِكَ لاَ يَحِلُّ لِي ‏\"‏‏.‏ قُلْتُ فَإِنَّا نُحَدَّثُ أَنَّكَ تُرِيدُ أَنْ تَنْكِحَ بِنْتَ أَبِي سَلَمَةَ‏.‏ قَالَ ‏\"‏ بِنْتَ أُمِّ سَلَمَةَ ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ فَقَالَ ‏\"‏ لَوْ أَنَّهَا لَمْ تَكُنْ رَبِيبَتِي فِي حَجْرِي مَا حَلَّتْ لِي إِنَّهَا لاَبْنَةُ أَخِي مِنَ الرَّضَاعَةِ، أَرْضَعَتْنِي وَأَبَا سَلَمَةَ ثُوَيْبَةُ فَلاَ تَعْرِضْنَ عَلَىَّ بَنَاتِكُنَّ وَلاَ أَخَوَاتِكُنَّ ‏\"‏‏.‏ قَالَ عُرْوَةُ وَثُوَيْبَةُ مَوْلاَةٌ لأَبِي لَهَبٍ كَانَ أَبُو لَهَبٍ أَعْتَقَهَا فَأَرْضَعَتِ النَّبِيَّ صلى الله عليه وسلم فَلَمَّا مَاتَ أَبُو لَهَبٍ أُرِيَهُ بَعْضُ أَهْلِهِ بِشَرِّ حِيبَةٍ قَالَ لَهُ مَاذَا لَقِيتَ قَالَ أَبُو لَهَبٍ لَمْ أَلْقَ بَعْدَكُمْ غَيْرَ أَنِّي سُقِيتُ فِي هَذِهِ بِعَتَاقَتِي ثُوَيْبَةَ‏.‏","english":{"narrator":"Narrated Um Habiba:","text":"(daughter of Abu Sufyan) I said, \"O Allah's Messenger (ﷺ)! Marry my sister. the daughter of Abu Sufyan.\" \nThe Prophet (ﷺ) said, \"Do you like that?\" I replied, \"Yes, for even now I am not your only wife and I like \nthat my sister should share the good with me.\" The Prophet (ﷺ) said, \"But that is not lawful for me.\" I \nsaid, We have heard that you want to marry the daughter of Abu Salama.\" He said, \"(You mean) the \ndaughter of Um Salama?\" I said, \"Yes.\" He said, \"Even if she were not my step-daughter, she would \nbe unlawful for me to marry as she is my foster niece. I and Abu Salama were suckled by Thuwaiba. \nSo you should not present to me your daughters or your sisters (in marriage).\" \n\nNarrated 'Urwa:\nThuwaiba was the freed slave girl of Abu Lahb whom he had manumitted, and then she suckled the \nProphet. When Abu Lahb died, one of his relatives saw him in a dream in a very bad state and asked \nhim, \"What have you encountered?\" Abu Lahb said, \"I have not found any rest since I left you, except \nthat I have been given water to drink in this (the space between his thumb and other fingers) and that \nis because of my manumitting Thuwaiba.\""}},{"id":40,"idInBook":40,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا شُعْبَةُ، عَنِ الأَشْعَثِ، عَنْ أَبِيهِ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم دَخَلَ عَلَيْهَا وَعِنْدَهَا رَجُلٌ، فَكَأَنَّهُ تَغَيَّرَ وَجْهُهُ، كَأَنَّهُ كَرِهَ ذَلِكَ فَقَالَتْ إِنَّهُ أَخِي‏.‏ فَقَالَ ‏\n\"‏ انْظُرْنَ مَا إِخْوَانُكُنَّ، فَإِنَّمَا الرَّضَاعَةُ مِنَ الْمَجَاعَةِ ‏\"‏‏.‏","english":{"narrator":"Narrated `Aisha:","text":"that the Prophet (ﷺ) entered upon her while a man was sitting with her. Signs of answer seemed to appear \non his face as if he disliked that. She said, \"Here is my (foster) brother.\" He said, \"Be sure as to who is \nyour foster brother, for foster suckling relationship is established only when milk is the only food of \nthe child.\""}},{"id":41,"idInBook":41,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، أَنَّ أَفْلَحَ، أَخَا أَبِي الْقُعَيْسِ جَاءَ يَسْتَأْذِنُ عَلَيْهَا ـ وَهْوَ عَمُّهَا مِنَ الرَّضَاعَةِ ـ بَعْدَ أَنْ نَزَلَ الْحِجَابُ، فَأَبَيْتُ أَنْ آذَنَ لَهُ، فَلَمَّا جَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَخْبَرْتُهُ بِالَّذِي صَنَعْتُ، فَأَمَرَنِي أَنْ آذَنَ لَهُ‏.‏","english":{"narrator":"Narrated Aisha:","text":"that Aflah the brother of Abu Al-Qu'ais, her foster uncle, came, asking permission to enter upon her after the Verse of Al-Hijab (the use of veils by women) was revealed. `Aisha added: I did not allow him to enter, but when Allah's Messenger (ﷺ) came, I told him what I had done, and he ordered me to give him permission."}},{"id":42,"idInBook":42,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا أَيُّوبُ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي مُلَيْكَةَ، قَالَ حَدَّثَنِي عُبَيْدُ بْنُ أَبِي مَرْيَمَ، عَنْ عُقْبَةَ بْنِ الْحَارِثِ، قَالَ وَقَدْ سَمِعْتُهُ مِنْ، عُقْبَةَ لَكِنِّي لِحَدِيثِ عُبَيْدٍ أَحْفَظُ قَالَ تَزَوَّجْتُ امْرَأَةً، فَجَاءَتْنَا امْرَأَةٌ سَوْدَاءُ فَقَالَتْ أَرْضَعْتُكُمَا‏.‏ فَأَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فَقُلْتُ تَزَوَّجْتُ فُلاَنَةَ بِنْتَ فُلاَنٍ فَجَاءَتْنَا امْرَأَةٌ سَوْدَاءُ فَقَالَتْ لِي إِنِّي قَدْ أَرْضَعْتُكُمَا‏.‏ وَهْىَ كَاذِبَةٌ فَأَعْرَضَ، فَأَتَيْتُهُ مِنْ قِبَلِ وَجْهِهِ، قُلْتُ إِنَّهَا كَاذِبَةٌ‏.‏ قَالَ ‏\n\"‏ كَيْفَ بِهَا وَقَدْ زَعَمَتْ أَنَّهَا قَدْ أَرْضَعَتْكُمَا، دَعْهَا عَنْكَ ‏\"‏ وَأَشَارَ إِسْمَاعِيلُ بِإِصْبَعَيْهِ السَّبَّابَةِ وَالْوُسْطَى يَحْكِي أَيُّوبَ‏.‏","english":{"narrator":"Narrated `Uqba bin Al-Harith:","text":"I married a woman and then a black lady came to us and said, \"I have suckled you both (you and your \nwife).\" So I came to the Prophet (ﷺ) and said, \"I married so-and-so and then a black lady came to us and \nsaid to me, 'I have suckled both of you.' But I think she is a liar.\" The Prophet (ﷺ) turned his face away \nfrom me and I moved to face his face, and said, \"She is a liar.\" The Prophet (ﷺ) said, \"How (can you keep \nher as your wife) when that lady has said that she has suckled both of you? So abandon (i.e., divorce) \nher (your wife)."}},{"id":43,"idInBook":43,"chapterId":67,"bookId":1,"arabic":"وَقَالَ لَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ سُفْيَانَ، حَدَّثَنِي حَبِيبٌ، عَنْ سَعِيدٍ، عَنِ ابْنِ عَبَّاسٍ، حَرُمَ مِنَ النَّسَبِ سَبْعٌ، وَمِنَ الصِّهْرِ سَبْعٌ‏.‏ ثُمَّ قَرَأَ ‏{‏حُرِّمَتْ عَلَيْكُمْ أُمَّهَاتُكُمْ‏}‏ الآيَةَ‏.‏ وَجَمَعَ عَبْدُ اللَّهِ بْنُ جَعْفَرٍ بَيْنَ ابْنَةِ عَلِيٍّ وَامْرَأَةِ عَلِيٍّ‏.‏ وَقَالَ ابْنُ سِيرِينَ لاَ بَأْسَ بِهِ‏.‏ وَكَرِهَهُ الْحَسَنُ مَرَّةً ثُمَّ قَالَ لاَ بَأْسَ بِهِ‏.‏ وَجَمَعَ الْحَسَنُ بْنُ الْحَسَنِ بْنِ عَلِيٍّ بَيْنَ ابْنَتَىْ عَمٍّ فِي لَيْلَةٍ، وَكَرِهَهُ جَابِرُ بْنُ زَيْدٍ لِلْقَطِيعَةِ، وَلَيْسَ فِيهِ تَحْرِيمٌ لِقَوْلِهِ تَعَالَى ‏{‏وَأُحِلَّ لَكُمْ مَا وَرَاءَ ذَلِكُمْ‏}‏ وَقَالَ عِكْرِمَةُ عَنِ ابْنِ عَبَّاسٍ إِذَا زَنَى بِأُخْتِ امْرَأَتِهِ لَمْ تَحْرُمْ عَلَيْهِ امْرَأَتُهُ‏.‏ وَيُرْوَى عَنْ يَحْيَى الْكِنْدِيِّ عَنِ الشَّعْبِيِّ وَأَبِي جَعْفَرٍ، فِيمَنْ يَلْعَبُ بِالصَّبِيِّ إِنْ أَدْخَلَهُ فِيهِ، فَلاَ يَتَزَوَّجَنَّ أُمَّهُ، وَيَحْيَى هَذَا غَيْرُ مَعْرُوفٍ، لَمْ يُتَابَعْ عَلَيْهِ‏.‏ وَقَالَ عِكْرِمَةُ عَنِ ابْنِ عَبَّاسٍ إِذَا زَنَى بِهَا لَمْ تَحْرُمْ عَلَيْهِ امْرَأَتُهُ‏.‏ وَيُذْكَرُ عَنْ أَبِي نَصْرٍ أَنَّ ابْنَ عَبَّاسٍ حَرَّمَهُ‏.‏ وَأَبُو نَصْرٍ هَذَا لَمْ يُعْرَفْ بِسَمَاعِهِ مِنِ ابْنِ عَبَّاسٍ‏.‏ وَيُرْوَى عَنْ عِمْرَانَ بْنِ حُصَيْنٍ وَجَابِرِ بْنِ زَيْدٍ وَالْحَسَنِ وَبَعْضِ أَهْلِ الْعِرَاقِ تَحْرُمُ عَلَيْهِ‏.‏ وَقَالَ أَبُو هُرَيْرَةَ لاَ تَحْرُمُ حَتَّى يُلْزِقَ بِالأَرْضِ يَعْنِي يُجَامِعَ‏.‏ وَجَوَّزَهُ ابْنُ الْمُسَيَّبِ وَعُرْوَةُ وَالزُّهْرِيُّ‏.‏ وَقَالَ الزُّهْرِيُّ قَالَ عَلِيٌّ لاَ تَحْرُمُ‏.‏ وَهَذَا مُرْسَلٌ‏.‏","english":{"narrator":"Ibn 'Abbas further said, \"Seven types of marriages are unlawful because of blood relations, and seven because of marriage relations.\" Then Ibn 'Abbas recited the Verse:","text":"\"Forbidden for you (for marriages) are your mothers...\" (4:23). \n\n'Abdullah bin Ja'far married the daughter and wife of 'Ali at the same time (they were step-daughter and mother). Ibn Sirin said, \"There is no harm in that.\" But Al-Hasan Al-Basri disapproved of it at first, but then said that there was no harm in it. Al-Hasan bin Al-Hasan bin 'Ali married two of his cousins in one night. Ja'far bin Zaid disapproved of that because of it would bring hatred (between the two cousins), but it is not unlawful, as Allah said, \"Lawful to you are all others . (4:24).\n\nIbn 'Abbas said: \"If somebody commits illegal sexual intercourse with his wife's sister, his wife does not become unlawful for him.\"\n\nAnd narrated Abu Ja'far, \"If a person commits homosexuality with a boy, then the mother of that boy is unlawful for him to marry.\"\n\nNarrated Ibn  'Abbas, \"If one commits illegal sexual intercourse with his mother in law, then his married relation to his wife does not become unlawful.\" Abu Nasr reported to have said that Ibn  'Abbas in the above case, regarded his marital relation to his wife unlawful, but Abu Nasr is not known well for hearing Hadith from Ibn 'Abbas.\n\nImran bin Hussain, Jabir b. Zaid, Al-Hasan and some other Iraqi's, are reported to have judged that his marital relations to his wife would be unlawful. In the above case Abu Hurairah said, \"The marital relation to one's wife does not become unlawful except if one as had sexual intercourse (with her mother).\" Ibn Al-Musaiyab, 'Urwa, and Az-Zuhri allows such person to keep his wife. 'Ali said, \"His marital relations to his wife does not become unlawful.\""}},{"id":44,"idInBook":44,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا الْحُمَيْدِيُّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ زَيْنَبَ، عَنْ أُمِّ حَبِيبَةَ، قَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ هَلْ لَكَ فِي بِنْتِ أَبِي سُفْيَانَ قَالَ ‏\"‏ فَأَفْعَلُ مَاذَا ‏\"‏‏.‏ قُلْتُ تَنْكِحُ‏.‏ قَالَ ‏\"‏ أَتُحِبِّينَ ‏\"‏‏.‏ قُلْتُ لَسْتُ لَكَ بِمُخْلِيَةٍ، وَأَحَبُّ مَنْ شَرِكَنِي فِيكَ أُخْتِي‏.‏ قَالَ ‏\"‏ إِنَّهَا لاَ تَحِلُّ لِي ‏\"‏‏.‏ قُلْتُ بَلَغَنِي أَنَّكَ تَخْطُبُ‏.‏ قَالَ ‏\"‏ ابْنَةَ أُمِّ سَلَمَةَ ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ قَالَ ‏\"‏ لَوْ لَمْ تَكُنْ رَبِيبَتِي مَا حَلَّتْ لِي، أَرْضَعَتْنِي وَأَبَاهَا ثُوَيْبَةُ، فَلاَ تَعْرِضْنَ عَلَىَّ بَنَاتِكُنَّ وَلاَ أَخَوَاتِكُنَّ ‏\"‏‏.‏ وَقَالَ اللَّيْثُ حَدَّثَنَا هِشَامٌ دُرَّةُ بِنْتُ أَبِي سَلَمَةَ‏.‏","english":{"narrator":"Narrated Um Habiba:","text":"I said, \"O Allah's Messenger (ﷺ)! Do you like to have (my sister) the daughter of Abu Sufyan?\" The Prophet (ﷺ) \nsaid, \"What shall I do (with her)?\" I said, \"Marry her.\" He said, \"Do you like that?\" I said, \"(Yes), for \neven now I am not your only wife, so I like that my sister should share you with me.\" He said, \"She is \nnot lawful for me (to marry).\" I said, \"We have heard that you want to marry.\" He said, \"The daughter \nof Um Salama?\" I said, \"Yes.\" He said, \"Even if she were not my stepdaughter, she should be \nunlawful for me to marry, for Thuwaiba suckled me and her father (Abu Salama). So you should \nneither present your daughters, nor your sisters, to me.\""}},{"id":45,"idInBook":45,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ عُرْوَةَ بْنَ الزُّبَيْرِ، أَخْبَرَهُ أَنَّ زَيْنَبَ ابْنَةَ أَبِي سَلَمَةَ أَخْبَرَتْهُ أَنَّ أُمَّ حَبِيبَةَ قَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ انْكِحْ أُخْتِي بِنْتَ أَبِي سُفْيَانَ‏.‏ قَالَ ‏\"‏ وَتُحِبِّينَ ‏\"‏‏.‏ قُلْتُ نَعَمْ، لَسْتُ بِمُخْلِيَةٍ، وَأَحَبُّ مَنْ شَارَكَنِي فِي خَيْرٍ أُخْتِي‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّ ذَلِكَ لاَ يَحِلُّ لِي ‏\"‏‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ فَوَاللَّهِ إِنَّا لَنَتَحَدَّثُ أَنَّكَ تُرِيدُ أَنْ تَنْكِحَ دُرَّةَ بِنْتَ أَبِي سَلَمَةَ‏.‏ قَالَ ‏\"‏ بِنْتَ أُمِّ سَلَمَةَ ‏\"‏‏.‏ فَقُلْتُ نَعَمْ‏.‏ قَالَ ‏\"‏ فَوَاللَّهِ لَوْ لَمْ تَكُنْ فِي حَجْرِي مَا حَلَّتْ لِي إِنَّهَا لاَبْنَةُ أَخِي مِنَ الرَّضَاعَةِ، أَرْضَعَتْنِي وَأَبَا سَلَمَةَ ثُوَيْبَةُ فَلاَ تَعْرِضْنَ عَلَىَّ بَنَاتِكُنَّ وَلاَ أَخَوَاتِكُنَّ ‏\"‏‏.‏","english":{"narrator":"Narrated Um Habiba:","text":"I said, \"O Allah's Messenger (ﷺ)! Marry my sister, the daughter of Abu Sufyan.\" He said, \"Do you like that?\" \nI said, \"Yes, for even now I am not your only wife; and the most beloved person to share the good \nwith me is my sister.\" The Prophet (ﷺ) said, \"But that is not lawful for me (i.e., to be married to two \nsisters at a time.)\" I said, \"O Allah's Messenger (ﷺ)! By Allah, we have heard that you want to marry Durra, \nthe daughter of Abu Salama.\" He said, \"You mean the daughter of Um Salama?\" I said, \"Yes.\" He \nsaid, \"By Allah ! Even if she were not my stepdaughter, she would not be lawful for me to marry, for \nshe is my foster niece, for Thuwaiba has suckled me and Abu Salama; so you should neither present \nyour daughters, nor your sisters to me.\""}},{"id":46,"idInBook":46,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا عَاصِمٌ، عَنِ الشَّعْبِيِّ، سَمِعَ جَابِرًا، رضى الله عنه قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ تُنْكَحَ الْمَرْأَةُ عَلَى عَمَّتِهَا أَوْ خَالَتِهَا‏.‏ وَقَالَ دَاوُدُ وَابْنُ عَوْنٍ عَنِ الشَّعْبِيِّ عَنْ أَبِي هُرَيْرَةَ‏.‏","english":{"narrator":"Narrated Jabir:","text":"Allah's Messenger (ﷺ) forbade that a woman should be married to man along with her paternal or maternal \naunt."}},{"id":47,"idInBook":47,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، رضى الله عنه أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يُجْمَعُ بَيْنَ الْمَرْأَةِ وَعَمَّتِهَا، وَلاَ بَيْنَ الْمَرْأَةِ وَخَالَتِهَا ‏\"‏‏.‏","english":{"narrator":"Narrated Abu Huraira:","text":"Allah's Messenger (ﷺ) said, \"A woman and her paternal aunt should not be married to the same man; and \nsimilarly, a woman and her maternal aunt should not be married to the same man.\""}},{"id":48,"idInBook":48,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنِي يُونُسُ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي قَبِيصَةُ بْنُ ذُؤَيْبٍ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ نَهَى النَّبِيُّ صلى الله عليه وسلم أَنْ تُنْكَحَ الْمَرْأَةُ عَلَى عَمَّتِهَا وَالْمَرْأَةُ وَخَالَتُهَا‏.‏ فَنُرَى خَالَةَ أَبِيهَا بِتِلْكَ الْمَنْزِلَةِ‏.‏ لأَنَّ عُرْوَةَ حَدَّثَنِي عَنْ عَائِشَةَ، قَالَتْ حَرِّمُوا مِنَ الرَّضَاعَةِ مَا يَحْرُمُ مِنَ النَّسَبِ‏.‏","english":{"narrator":"Narrated Abu Huraira:","text":"The Prophet (ﷺ) forbade that a woman should be married to a man along with her paternal aunt or with \nher maternal aunt (at the same time). Az-Zuhri (the sub-narrator) said: There is a similar order for the \npaternal aunt of the father of one's wife, for 'Urwa told me that `Aisha said, \"What is unlawful because \nof blood relations, is also unlawful because of the corresponding foster suckling relations.\""}},{"id":49,"idInBook":49,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الشِّغَارِ، وَالشِّغَارُ أَنْ يُزَوِّجَ الرَّجُلُ ابْنَتَهُ عَلَى أَنْ يُزَوِّجَهُ الآخَرُ ابْنَتَهُ، لَيْسَ بَيْنَهُمَا صَدَاقٌ‏.‏","english":{"narrator":"Narrated Ibn `Umar:","text":"Allah's Messenger (ﷺ) forbade Ash-Shighar, which means that somebody marries his daughter to somebody \nelse, and the latter marries his daughter to the former without paying Mahr."}},{"id":50,"idInBook":50,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، حَدَّثَنَا ابْنُ فُضَيْلٍ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، قَالَ كَانَتْ خَوْلَةُ بِنْتُ حَكِيمٍ مِنَ اللاَّئِي وَهَبْنَ أَنْفُسَهُنَّ لِلنَّبِيِّ صلى الله عليه وسلم فَقَالَتْ عَائِشَةُ أَمَا تَسْتَحِي الْمَرْأَةُ أَنْ تَهَبَ نَفْسَهَا لِلرَّجُلِ فَلَمَّا نَزَلَتْ ‏{‏تُرْجِئُ مَنْ تَشَاءُ مِنْهُنَّ‏}‏ قُلْتُ يَا رَسُولَ اللَّهِ مَا أَرَى رَبَّكَ إِلاَّ يُسَارِعُ فِي هَوَاكَ‏.‏ رَوَاهُ أَبُو سَعِيدٍ الْمُؤَدِّبُ وَمُحَمَّدُ بْنُ بِشْرٍ وَعَبْدَةُ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ يَزِيدُ بَعْضُهُمْ عَلَى بَعْضٍ‏.‏","english":{"narrator":"Narrated Hisham's father:","text":"Khaula bint Hakim was one of those ladies who presented themselves to the Prophet (ﷺ) for marriage. \n`Aisha said, \"Doesn't a lady feel ashamed for presenting herself to a man?\" But when the Verse: \"(O \nMuhammad) You may postpone (the turn of) any of them (your wives) that you please,' (33.51) was \nrevealed, \" `Aisha said, 'O Allah's Messenger (ﷺ)! I do not see, but, that your Lord hurries in pleasing you.' \""}},{"id":51,"idInBook":51,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيلَ، أَخْبَرَنَا ابْنُ عُيَيْنَةَ، أَخْبَرَنَا عَمْرٌو، حَدَّثَنَا جَابِرُ بْنُ زَيْدٍ، قَالَ أَنْبَأَنَا ابْنُ عَبَّاسٍ ـ رضى الله عنهما ـ تَزَوَّجَ النَّبِيُّ صلى الله عليه وسلم وَهْوَ مُحْرِمٌ‏.‏","english":{"narrator":"Narrated Ibn `Abbas:","text":"The Prophet (ﷺ) got married while he was in the state of Ihram."}},{"id":52,"idInBook":52,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا ابْنُ عُيَيْنَةَ، أَنَّهُ سَمِعَ الزُّهْرِيَّ، يَقُولُ أَخْبَرَنِي الْحَسَنُ بْنُ مُحَمَّدِ بْنِ عَلِيٍّ، وَأَخُوهُ عَبْدُ اللَّهِ، عَنْ أَبِيهِمَا، أَنَّ عَلِيًّا ـ رضى الله عنه ـ قَالَ لاِبْنِ عَبَّاسٍ إِنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنِ الْمُتْعَةِ وَعَنْ لُحُومِ الْحُمُرِ الأَهْلِيَّةِ زَمَنَ خَيْبَرَ‏.‏","english":{"narrator":"Narrated `Ali:","text":"I said to Ibn `Abbas, \"During the battle of Khaibar the Prophet (ﷺ) forbade (Nikah) Al-Mut'a and the \neating of donkey's meat.\""}},{"id":53,"idInBook":53,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي جَمْرَةَ، قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ، سُئِلَ عَنْ مُتْعَةِ النِّسَاءِ، فَرَخَّصَ فَقَالَ لَهُ مَوْلًى لَهُ إِنَّمَا ذَلِكَ فِي الْحَالِ الشَّدِيدِ وَفِي النِّسَاءِ قِلَّةٌ أَوْ نَحْوَهُ‏.‏ فَقَالَ ابْنُ عَبَّاسٍ نَعَمْ‏.‏","english":{"narrator":"Narrated Abu Jamra:","text":"I heard Ibn `Abbas (giving a verdict) when he was asked about the Mut'a with the women, and he \npermitted it (Nikah-al-Mut'a). On that a freed slave of his said to him, \"That is only when it is very \nbadly needed and women are scarce.\" On that, Ibn `Abbas said, \"Yes.\""}},{"id":54,"idInBook":54,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا عَلِيٌّ، حَدَّثَنَا سُفْيَانُ، قَالَ عَمْرٌو عَنِ الْحَسَنِ بْنِ مُحَمَّدٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، وَسَلَمَةَ بْنِ الأَكْوَعِ، قَالاَ كُنَّا فِي جَيْشٍ فَأَتَانَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ إِنَّهُ قَدْ أُذِنَ لَكُمْ أَنْ تَسْتَمْتِعُوا فَاسْتَمْتِعُوا ‏\"‏‏.‏","english":{"narrator":"Narrated Jabir bin `Abdullah and Salama bin Al-Akwa`:","text":"While we were in an army, Allah's Messenger (ﷺ) came to us and said, \"You have been allowed to do the \nMut'a (marriage), so do it.\""}},{"id":55,"idInBook":55,"chapterId":67,"bookId":1,"arabic":"وَقَالَ ابْنُ أَبِي ذِئْبٍ حَدَّثَنِي إِيَاسُ بْنُ سَلَمَةَ بْنِ الأَكْوَعِ، عَنْ أَبِيهِ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَيُّمَا رَجُلٍ وَامْرَأَةٍ تَوَافَقَا فَعِشْرَةُ مَا بَيْنَهُمَا ثَلاَثُ لَيَالٍ فَإِنْ أَحَبَّا أَنْ يَتَزَايَدَا أَوْ يَتَتَارَكَا تَتَارَكَا ‏\"‏‏.‏ فَمَا أَدْرِي أَشَىْءٌ كَانَ لَنَا خَاصَّةً أَمْ لِلنَّاسِ عَامَّةً‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ وَبَيَّنَهُ عَلِيٌّ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ مَنْسُوخٌ‏.‏","english":{"narrator":"Salama bin Al-Akwa` said:","text":"Allah's Messenger (ﷺ)'s said, \"If a man and a woman \nagree (to marry temporarily), their marriage should last for three nights, and if they like to continue, \nthey can do so; and if they want to separate, they can do so.\" I do not know whether that was only for \nus or for all the people in general. Abu `Abdullah (Al-Bukhari) said: `Ali made it clear that the \nProphet said, \"The Mut'a marriage has been cancelled (made unlawful)."}},{"id":56,"idInBook":56,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا مَرْحُومٌ، قَالَ سَمِعْتُ ثَابِتًا الْبُنَانِيَّ، قَالَ كُنْتُ عِنْدَ أَنَسٍ وَعِنْدَهُ ابْنَةٌ لَهُ، قَالَ أَنَسٌ جَاءَتِ امْرَأَةٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم تَعْرِضُ عَلَيْهِ نَفْسَهَا قَالَتْ يَا رَسُولَ اللَّهِ أَلَكَ بِي حَاجَةٌ، فَقَالَتْ بِنْتُ أَنَسٍ مَا أَقَلَّ حَيَاءَهَا وَاسَوْأَتَاهْ وَاسَوْأَتَاهْ‏.‏ قَالَ هِيَ خَيْرٌ مِنْكِ رَغِبَتْ فِي النَّبِيِّ صلى الله عليه وسلم فَعَرَضَتْ عَلَيْهِ نَفْسَهَا‏.‏","english":{"narrator":"Narrated Thabit Al-Banani:","text":"I was with Anas while his daughter was present with him. Anas said, \"A woman came to Allah's \nApostle and presented herself to him, saying, 'O Allah's Messenger (ﷺ), have you any need for me (i.e. would \nyou like to marry me)?' \"Thereupon Anas's daughter said, \"What a shameless lady she was ! Shame! \nShame!\" Anas said, \"She was better than you; she had a liking for the Prophet (ﷺ) so she presented herself \nfor marriage to him.\""}},{"id":57,"idInBook":57,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، حَدَّثَنَا أَبُو غَسَّانَ، قَالَ حَدَّثَنِي أَبُو حَازِمٍ، عَنْ سَهْلٍ، أَنَّ امْرَأَةً، عَرَضَتْ نَفْسَهَا عَلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ لَهُ رَجُلٌ يَا رَسُولَ اللَّهِ زَوِّجْنِيهَا‏.‏ فَقَالَ ‏\"‏ مَا عِنْدَكَ ‏\"‏‏.‏ قَالَ مَا عِنْدِي شَىْءٌ‏.‏ قَالَ ‏\"‏ اذْهَبْ فَالْتَمِسْ وَلَوْ خَاتَمًا مِنْ حَدِيدٍ ‏\"‏‏.‏ فَذَهَبَ ثُمَّ رَجَعَ فَقَالَ لاَ وَاللَّهِ مَا وَجَدْتُ شَيْئًا، وَلاَ خَاتَمًا مِنْ حَدِيدٍ، وَلَكِنْ هَذَا إِزَارِي وَلَهَا نِصْفُهُ ـ قَالَ سَهْلٌ وَمَا لَهُ رِدَاءٌ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ وَمَا تَصْنَعُ بِإِزَارِكَ إِنْ لَبِسْتَهُ لَمْ يَكُنْ عَلَيْهَا مِنْهُ شَىْءٌ، وَإِنْ لَبِسَتْهُ لَمْ يَكُنْ عَلَيْكَ مِنْهُ شَىْءٌ ‏\"‏‏.‏ فَجَلَسَ الرَّجُلُ حَتَّى إِذَا طَالَ مَجْلَسُهُ قَامَ فَرَآهُ النَّبِيُّ صلى الله عليه وسلم فَدَعَاهُ أَوْ دُعِي لَهُ فَقَالَ ‏\"‏ مَاذَا مَعَكَ مِنَ الْقُرْآنِ ‏\"‏‏.‏ فَقَالَ مَعِي سُورَةُ كَذَا وَسُورَةُ كَذَا لِسُوَرٍ يُعَدِّدُهَا‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَمْلَكْنَاكَهَا بِمَا مَعَكَ مِنَ الْقُرْآنِ ‏\"‏‏.‏","english":{"narrator":"Narrated Sahl bin Sa`d:","text":"A woman presented herself to the Prophet (for marriage). A man said to him, \"O Allah's Messenger (ﷺ)! (If \nyou are not in need of her) marry her to me.\" The Prophet (ﷺ) said, \"What have you got?\" The man said, \n\"I have nothing.\" The Prophet (ﷺ) said (to him), \"Go and search for something) even if it were an iron \nring.\" The man went and returned saying, \"No, I have not found anything, not even an iron ring; but \nthis is my (Izar) waist sheet, and half of it is for her.\" He had no Rida' (upper garment). The Prophet (ﷺ) \nsaid, \"What will she do with your waist sheet? If you wear it, she will have nothing over her; and if \nshe wears it, you will have nothing over you.\" So the man sat down and when he had sat a long time, \nhe got up (to leave). When the Prophet (ﷺ) saw him (leaving), he called him back, or the man was called \n(for him), and he said to the man, \"How much of the Qur'an do you know (by heart)?\" The man \nreplied I know such Sura and such Sura (by heart),\" naming the Suras The Prophet (ﷺ) said, \"I have \nmarried her to you for what you know of the Qur'an .\""}},{"id":58,"idInBook":58,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ صَالِحِ بْنِ كَيْسَانَ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ، أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ يُحَدِّثُ أَنَّ عُمَرَ بْنَ الْخَطَّابِ حِينَ تَأَيَّمَتْ حَفْصَةُ بِنْتُ عُمَرَ مِنْ خُنَيْسِ بْنِ حُذَافَةَ السَّهْمِيِّ ـ وَكَانَ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَتُوُفِّيَ بِالْمَدِينَةِ ـ فَقَالَ عُمَرُ بْنُ الْخَطَّابِ أَتَيْتُ عُثْمَانَ بْنَ عَفَّانَ فَعَرَضْتُ عَلَيْهِ حَفْصَةَ فَقَالَ سَأَنْظُرُ فِي أَمْرِي‏.‏ فَلَبِثْتُ لَيَالِيَ ثُمَّ لَقِيَنِي فَقَالَ قَدْ بَدَا لِي أَنْ لاَ أَتَزَوَّجَ يَوْمِي هَذَا‏.‏ قَالَ عُمَرُ فَلَقِيتُ أَبَا بَكْرٍ الصِّدِّيقَ فَقُلْتُ إِنْ شِئْتَ زَوَّجْتُكَ حَفْصَةَ بِنْتَ عُمَرَ‏.‏ فَصَمَتَ أَبُو بَكْرٍ فَلَمْ يَرْجِعْ إِلَىَّ شَيْئًا، وَكُنْتُ أَوْجَدَ عَلَيْهِ مِنِّي عَلَى عُثْمَانَ، فَلَبِثْتُ لَيَالِيَ ثُمَّ خَطَبَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَنْكَحْتُهَا إِيَّاهُ، فَلَقِيَنِي أَبُو بَكْرٍ فَقَالَ لَعَلَّكَ وَجَدْتَ عَلَىَّ حِينَ عَرَضْتَ عَلَىَّ حَفْصَةَ فَلَمْ أَرْجِعْ إِلَيْكَ شَيْئًا‏.‏ قَالَ عُمَرُ قُلْتُ نَعَمْ‏.‏ قَالَ أَبُو بَكْرٍ فَإِنَّهُ لَمْ يَمْنَعْنِي أَنْ أَرْجِعَ إِلَيْكَ فِيمَا عَرَضْتَ عَلَىَّ إِلاَّ أَنِّي كُنْتُ عَلِمْتُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَدْ ذَكَرَهَا، فَلَمْ أَكُنْ لأُفْشِيَ سِرَّ رَسُولِ اللَّهِ صلى الله عليه وسلم وَلَوْ تَرَكَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم قَبِلْتُهَا‏.‏","english":{"narrator":"Narrated `Abdullah bin `Umar:","text":"`Umar bin Al-Khattab said, \"When Hafsa bint `Umar became a widow after the death of (her husband) \nKhunais bin Hudhafa As-Sahmi who had been one of the companions of the Prophet, and he died at \nMedina. I went to `Uthman bin `Affan and presented Hafsa (for marriage) to him. He said, \"I will \nthink it over.' I waited for a few days, then he met me and said, 'It seems that it is not possible for me \nto marry at present.' \" `Umar further said, \"I met Abu Bakr As-Siddique and said to him, 'If you wish, \nI will marry my daughter Hafsa to you.\" Abu Bakr kept quiet and did not say anything to me in reply. \nI became more angry with him than with `Uthman. I waited for a few days and then Allah's Messenger (ﷺ) \nasked for her hand, and I gave her in marriage to him. Afterwards I met Abu Bakr who said, 'Perhaps \nyou became angry with me when you presented Hafsa to me and I did not give you a reply?' I said, \n'Yes.' Abu Bakr said, 'Nothing stopped me to respond to your offer except that I knew that Allah's \nApostle had mentioned her, and I never wanted to let out the secret of Allah's Messenger (ﷺ). And if Allah's \nApostle had refused her, I would have accepted her.' \""}},{"id":59,"idInBook":59,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ عِرَاكِ بْنِ مَالِكٍ، أَنَّ زَيْنَبَ ابْنَةَ أَبِي سَلَمَةَ، أَخْبَرَتْهُ أَنَّ أُمَّ حَبِيبَةَ قَالَتْ لِرَسُولِ اللَّهِ صلى الله عليه وسلم إِنَّا قَدْ تَحَدَّثْنَا أَنَّكَ نَاكِحٌ دُرَّةَ بِنْتَ أَبِي سَلَمَةَ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَعَلَى أُمِّ سَلَمَةَ لَوْ لَمْ أَنْكِحْ أُمَّ سَلَمَةَ مَا حَلَّتْ لِي، إِنَّ أَبَاهَا أَخِي مِنَ الرَّضَاعَةِ ‏\"‏‏.‏","english":{"narrator":"Narrated Zainab bint Salama:","text":"Um Habiba said to Allah's Messenger (ﷺ) \"We have heard that you want to marry Durra bint Abu-Salama.\" \nAllah's Messenger (ﷺ) said, \"Can she be married along with Um Salama (her mother)? Even if I have not \nmarried Um Salama, she would not be lawful for me to marry, for her father is my foster brother.\""}},{"id":60,"idInBook":60,"chapterId":67,"bookId":1,"arabic":"وَقَالَ لِي طَلْقٌ حَدَّثَنَا زَائِدَةُ، عَنْ مَنْصُورٍ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عَبَّاسٍ، ‏{‏فِيمَا عَرَّضْتُمْ‏}‏ يَقُولُ إِنِّي أُرِيدُ التَّزْوِيجَ، وَلَوَدِدْتُ أَنَّهُ تَيَسَّرَ لِي امْرَأَةٌ صَالِحَةٌ‏.‏ وَقَالَ الْقَاسِمُ يَقُولُ إِنَّكِ عَلَىَّ كَرِيمَةٌ، وَإِنِّي فِيكِ لَرَاغِبٌ، وَإِنَّ اللَّهَ لَسَائِقٌ إِلَيْكِ خَيْرًا‏.‏ أَوْ نَحْوَ هَذَا‏.‏ وَقَالَ عَطَاءٌ يُعَرِّضُ وَلاَ يَبُوحُ يَقُولُ إِنَّ لِي حَاجَةً وَأَبْشِرِي، وَأَنْتِ بِحَمْدِ اللَّهِ نَافِقَةٌ‏.‏ وَتَقُولُ هِيَ قَدْ أَسْمَعُ مَا تَقُولُ‏.‏ وَلاَ تَعِدُ شَيْئًا وَلاَ يُوَاعِدُ وَلِيُّهَا بِغَيْرِ عِلْمِهَا، وَإِنْ وَاعَدَتْ رَجُلاً فِي عِدَّتِهَا ثُمَّ نَكَحَهَا بَعْدُ لَمْ يُفَرَّقْ بَيْنَهُمَا‏.‏ وَقَالَ الْحَسَنُ ‏{‏لاَ تُوَاعِدُوهُنَّ سِرًّا‏}‏ الزِّنَا‏.‏ وَيُذْكَرُ عَنِ ابْنِ عَبَّاسٍ ‏{‏الْكِتَابُ أَجَلَهُ‏}‏ تَنْقَضِي الْعِدَّةُ‏.‏","english":{"narrator":"Ibn `Abbas said:","text":"\"Hint your intention of marrying' is made by \nsaying (to the widow) for example: \"I want to marry, and I wish that Allah will make a righteous lady \navailable for me.' \" Al-Qasim said: One may say to the widow: 'I hold all respect for you, and I am \ninterested in you; Allah will bring you much good, or something similar 'Ata said: One should hint his \nintention, and should not declare it openly. One may say: 'I have some need. Have good tidings. Praise \nbe to Allah; you are fit to remarry.' She (the widow) may say in reply: I am listening to what you say,' \nbut she should not make a promise. Her guardian should not make a promise (to somebody to get her \nmarried to him) without her knowledge. But if, while still in the Iddat period, she makes a promise to \nmarry somebody, and he ultimately marries her, they are not to be separated by divorce (i.e., the \nmarriage is valid)."}},{"id":61,"idInBook":61,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ قَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ رَأَيْتُكِ فِي الْمَنَامِ يَجِيءُ بِكِ الْمَلَكُ فِي سَرَقَةٍ مِنْ حَرِيرٍ فَقَالَ لِي هَذِهِ امْرَأَتُكَ‏.‏ فَكَشَفْتُ عَنْ وَجْهِكِ الثَّوْبَ، فَإِذَا أَنْتِ هِيَ فَقُلْتُ إِنْ يَكُ هَذَا مِنْ عِنْدِ اللَّهِ يُمْضِهِ ‏\"‏‏.‏","english":{"narrator":"Narrated `Aisha:","text":"Allah's Messenger (ﷺ) said (to me), \"You were shown to me in a dream. An angel brought you to me, \nwrapped in a piece of silken cloth, and said to me, 'This is your wife.' I removed the piece of cloth \nfrom your face, and there you were. I said to myself. 'If it is from Allah, then it will surely be.' \""}},{"id":62,"idInBook":62,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا يَعْقُوبُ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، أَنَّ امْرَأَةً، جَاءَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ جِئْتُ لأَهَبَ لَكَ نَفْسِي‏.‏ فَنَظَرَ إِلَيْهَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَصَعَّدَ النَّظَرَ إِلَيْهَا وَصَوَّبَهُ، ثُمَّ طَأْطَأَ رَأْسَهُ، فَلَمَّا رَأَتِ الْمَرْأَةُ أَنَّهُ لَمْ يَقْضِ فِيهَا شَيْئًا جَلَسَتْ، فَقَامَ رَجُلٌ مِنْ أَصْحَابِهِ فَقَالَ أَىْ رَسُولَ اللَّهِ إِنْ لَمْ تَكُنْ لَكَ بِهَا حَاجَةٌ فَزَوِّجْنِيهَا‏.‏ فَقَالَ ‏\"‏ هَلْ عِنْدَكَ مِنْ شَىْءٍ ‏\"‏‏.‏ قَالَ لاَ وَاللَّهِ يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ اذْهَبْ إِلَى أَهْلِكَ فَانْظُرْ هَلْ تَجِدُ شَيْئًا ‏\"‏‏.‏ فَذَهَبَ ثُمَّ رَجَعَ فَقَالَ لاَ وَاللَّهِ يَا رَسُولَ اللَّهِ مَا وَجَدْتُ شَيْئًا‏.‏ قَالَ ‏\"‏ انْظُرْ وَلَوْ خَاتَمًا مِنْ حَدِيدٍ ‏\"‏‏.‏ فَذَهَبَ ثُمَّ رَجَعَ فَقَالَ لاَ وَاللَّهِ يَا رَسُولَ اللَّهِ وَلاَ خَاتَمًا مِنْ حَدِيدٍ، وَلَكِنْ هَذَا إِزَارِي ـ قَالَ سَهْلٌ مَا لَهُ رِدَاءٌ ـ فَلَهَا نِصْفُهُ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا تَصْنَعُ بِإِزَارِكَ إِنْ لَبِسْتَهُ لَمْ يَكُنْ عَلَيْهَا مِنْهُ شَىْءٌ، وَإِنْ لَبِسَتْهُ لَمْ يَكُنْ عَلَيْكَ شَىْءٌ ‏\"‏‏.‏ فَجَلَسَ الرَّجُلُ حَتَّى طَالَ مَجْلَسُهُ ثُمَّ قَامَ فَرَآهُ رَسُولُ اللَّهِ صلى الله عليه وسلم مُوَلِّيًا فَأَمَرَ بِهِ فَدُعِيَ فَلَمَّا جَاءَ قَالَ ‏\"‏ مَاذَا مَعَكَ مِنَ الْقُرْآنِ ‏\"‏‏.‏ قَالَ مَعِي سُورَةَ كَذَا وَسُورَةَ كَذَا وَسُورَةَ كَذَا‏.‏ عَدَّدَهَا‏.‏ قَالَ ‏\"‏ أَتَقْرَؤُهُنَّ عَنْ ظَهْرِ قَلْبِكَ ‏\"‏‏.‏ قَالَ نَعَمْ‏.‏ قَالَ ‏\"‏ اذْهَبْ فَقَدْ مَلَّكْتُكَهَا بِمَا مَعَكَ مِنَ الْقُرْآنِ ‏\"‏‏.‏","english":{"narrator":"Narrated Sahl bin Sa`d:","text":"A woman came to Allah's Messenger (ﷺ) and said, \"O Allah's Messenger (ﷺ)! I have come to you to present myself \nto you (for marriage).\" Allah's Messenger (ﷺ) glanced at her. He looked at her carefully and fixed his glance \non her and then lowered his head. When the lady saw that he did not say anything, she sat down. A \nman from his companions got up and said, \"O Allah's Messenger (ﷺ)! If you are not in need of her, then \nmarry her to me.\" The Prophet (ﷺ) said, \"Have you got anything to offer.\" The man said, 'No, by Allah, O \nAllah's Messenger (ﷺ)!\" The Prophet (ﷺ) said (to him), \"Go to your family and try to find something.\" So the \nman went and returned, saying, \"No, by Allah, O Allah's Messenger (ﷺ)! I have not found anything.\" The \nProphet said, \"Go again and look for something, even if it were an iron ring.\" He went and returned, \nsaying, \"No, by Allah, O Allah's Messenger (ﷺ)! I could not find even an iron ring, but this is my Izar (waist \nsheet).' He had no Rida (upper garment). He added, \"I give half of it to her.\" Allah's Messenger (ﷺ) said \n\"What will she do with your Izar? If you wear it, she will have nothing over herself thereof (will be \nnaked); and if she wears it, then you will have nothing over yourself thereof ' So the man sat for a long \nperiod and then got up (to leave). When Allah's Messenger (ﷺ) saw him leaving, he ordered that he e called \nback. When he came, the Prophet (ﷺ) asked (him), \"How much of the Qur'an do you know (by heart)?\" \nThe man replied, I know such Sura and such Sura and such Sura,\" naming the suras. The Prophet (ﷺ) said, \n\"Can you recite it by heart?\" He said, 'Yes.\" The Prophet (ﷺ) said, \"Go I let you marry her for what you \nknow of the Qur'an (as her Mahr)."}},{"id":63,"idInBook":63,"chapterId":67,"bookId":1,"arabic":"قَالَ يَحْيَى بْنُ سُلَيْمَانَ حَدَّثَنَا ابْنُ وَهْبٍ، عَنْ يُونُسَ،‏.‏ حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، حَدَّثَنَا عَنْبَسَةُ، حَدَّثَنَا يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم أَخْبَرَتْهُ أَنَّ النِّكَاحَ فِي الْجَاهِلِيَّةِ كَانَ عَلَى أَرْبَعَةِ أَنْحَاءٍ فَنِكَاحٌ مِنْهَا نِكَاحُ النَّاسِ الْيَوْمَ، يَخْطُبُ الرَّجُلُ إِلَى الرَّجُلِ وَلِيَّتَهُ أَوِ ابْنَتَهُ، فَيُصْدِقُهَا ثُمَّ يَنْكِحُهَا، وَنِكَاحٌ آخَرُ كَانَ الرَّجُلُ يَقُولُ لاِمْرَأَتِهِ إِذَا طَهُرَتْ مِنْ طَمْثِهَا أَرْسِلِي إِلَى فُلاَنٍ فَاسْتَبْضِعِي مِنْهُ‏.‏ وَيَعْتَزِلُهَا زَوْجُهَا، وَلاَ يَمَسُّهَا أَبَدًا، حَتَّى يَتَبَيَّنَ حَمْلُهَا مِنْ ذَلِكَ الرَّجُلِ الَّذِي تَسْتَبْضِعُ مِنْهُ، فَإِذَا تَبَيَّنَ حَمْلُهَا أَصَابَهَا زَوْجُهَا إِذَا أَحَبَّ، وَإِنَّمَا يَفْعَلُ ذَلِكَ رَغْبَةً فِي نَجَابَةِ الْوَلَدِ، فَكَانَ هَذَا النِّكَاحُ نِكَاحَ الاِسْتِبْضَاعِ، وَنِكَاحٌ آخَرُ يَجْتَمِعُ الرَّهْطُ مَا دُونَ الْعَشَرَةِ فَيَدْخُلُونَ عَلَى الْمَرْأَةِ كُلُّهُمْ يُصِيبُهَا‏.‏ فَإِذَا حَمَلَتْ وَوَضَعَتْ، وَمَرَّ عَلَيْهَا لَيَالِيَ بَعْدَ أَنْ تَضَعَ حَمْلَهَا، أَرْسَلَتْ إِلَيْهِمْ فَلَمْ يَسْتَطِعْ رَجُلٌ مِنْهُمْ أَنْ يَمْتَنِعَ حَتَّى يَجْتَمِعُوا عِنْدَهَا تَقُولُ لَهُمْ قَدْ عَرَفْتُمُ الَّذِي كَانَ مِنْ أَمْرِكُمْ، وَقَدْ وَلَدْتُ فَهُوَ ابْنُكَ يَا فُلاَنُ‏.‏ تُسَمِّي مَنْ أَحَبَّتْ بِاسْمِهِ، فَيَلْحَقُ بِهِ وَلَدُهَا، لاَ يَسْتَطِيعُ أَنْ يَمْتَنِعَ بِهِ الرَّجُلُ‏.‏ وَنِكَاحُ الرَّابِعِ يَجْتَمِعُ النَّاسُ الْكَثِيرُ فَيَدْخُلُونَ عَلَى الْمَرْأَةِ لاَ تَمْتَنِعُ مِمَّنْ جَاءَهَا وَهُنَّ الْبَغَايَا كُنَّ يَنْصِبْنَ عَلَى أَبْوَابِهِنَّ رَايَاتٍ تَكُونُ عَلَمًا فَمَنْ أَرَادَهُنَّ دَخَلَ عَلَيْهِنَّ، فَإِذَا حَمَلَتْ إِحْدَاهُنَّ وَوَضَعَتْ حَمْلَهَا جُمِعُوا لَهَا وَدَعَوْا لَهُمُ الْقَافَةَ ثُمَّ أَلْحَقُوا وَلَدَهَا بِالَّذِي يَرَوْنَ فَالْتَاطَ بِهِ، وَدُعِيَ ابْنَهُ لاَ يَمْتَنِعُ مِنْ ذَلِكَ، فَلَمَّا بُعِثَ مُحَمَّدٌ صلى الله عليه وسلم بِالْحَقِّ هَدَمَ نِكَاحَ الْجَاهِلِيَّةِ كُلَّهُ، إِلاَّ نِكَاحَ النَّاسِ الْيَوْمَ‏.‏","english":{"narrator":"Narrated 'Urwa bin Az-Zubair:","text":"'Aishah, the wife of the Prophet (ﷺ) told him that there were four types of marriage during Pre-Islamic period of Ignorance. One type was similar to that of the present day i.e. a man used to ask somebody else for the hand of a girl under his guardianship or for his daughter's hand, and give her Mahr and then marry her. The second type was that a man would say to his wife after she had become clean from her period. \"Send for so-and-so and have sexual intercourse with him.\" Her husband would then keep away from her and would never sleep with her till she got pregnant from the other man with whom she was sleeping. When her pregnancy became evident, he husband would sleep with her if he wished. Her husband did so (i.e. let his wife sleep with some other man) so that he might have a child of noble breed. Such marriage was called as Al-Istibda'. Another type of marriage was that a group of less than ten men would assemble and enter upon a woman, and all of them would have sexual relation with her. If she became pregnant and delivered a child and some days had passed after delivery, she would sent for all of them and none of them would refuse to come, and when they all gathered before her, she would say to them, \"You (all) know waht you have done, and now I have given birth to a child. So, it is your child so-and-so!\" naming whoever she liked, and her child would follow him and he could not refuse to take him. The fourth type of marriage was that many people would enter upon a lady and she would never refuse anyone who came to her. Those were the prostitutes who used to fix flags at their doors as sign, and he who would wished, could have sexual intercourse with them. If anyone of them got pregnant and delivered a child, then all those men would be gathered for her and they would call the Qa'if (persons skilled in recognizing the likeness of a child to his father) to them and would let the child follow the man (whom they recognized as his father) and she would let him adhere to him and be called his son. The man would not refuse all that. But when Muhammad (ﷺ) was sent with the Truth, he abolished all the types of marriages observed in pre-Islamic period of Ignorance except the type of marriage the people recognize today."}},{"id":64,"idInBook":64,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا يَحْيَى، حَدَّثَنَا وَكِيعٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، ‏{‏وَمَا يُتْلَى عَلَيْكُمْ فِي الْكِتَابِ فِي يَتَامَى النِّسَاءِ اللاَّتِي لاَ تُؤْتُونَهُنَّ مَا كُتِبَ لَهُنَّ وَتَرْغَبُونَ أَنْ تَنْكِحُوهُنَّ‏}‏‏.‏ قَالَتْ هَذَا فِي الْيَتِيمَةِ الَّتِي تَكُونُ عِنْدَ الرَّجُلِ، لَعَلَّهَا أَنْ تَكُونَ شَرِيكَتَهُ فِي مَالِهِ، وَهْوَ أَوْلَى بِهَا، فَيَرْغَبُ أَنْ يَنْكِحَهَا، فَيَعْضُلَهَا لِمَالِهَا، وَلاَ يُنْكِحَهَا غَيْرَهُ، كَرَاهِيَةَ أَنْ يَشْرَكَهُ أَحَدٌ فِي مَالِهَا‏.‏","english":{"narrator":"Narrated `Aisha:","text":"(as regards the Verse): 'And about what is recited unto you in the Book, concerning orphan girls to \nwhom you give not the prescribed portions and yet, whom you desire to marry.' (4.127) This Verse is \nabout the female orphan who is under the guardianship of a man with whom she shares her property \nand he has more right over her (than anybody else) but does not like to marry her, so he prevents her, \nfrom marrying somebody else, lest he should share the property with him."}},{"id":65,"idInBook":65,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا هِشَامٌ، أَخْبَرَنَا مَعْمَرٌ، حَدَّثَنَا الزُّهْرِيُّ، قَالَ أَخْبَرَنِي سَالِمٌ، أَنَّ ابْنَ عُمَرَ، أَخْبَرَهُ أَنَّ عُمَرَ حِينَ تَأَيَّمَتْ حَفْصَةُ بِنْتُ عُمَرَ مِنِ ابْنِ حُذَافَةَ السَّهْمِيِّ ـ وَكَانَ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم مِنْ أَهْلِ بَدْرٍ تُوُفِّيَ بِالْمَدِينَةِ ـ فَقَالَ عُمَرُ لَقِيتُ عُثْمَانَ بْنَ عَفَّانَ فَعَرَضْتُ عَلَيْهِ فَقُلْتُ إِنْ شِئْتَ أَنْكَحْتُكَ حَفْصَةَ‏.‏ فَقَالَ سَأَنْظُرُ فِي أَمْرِي‏.‏ فَلَبِثْتُ لَيَالِيَ ثُمَّ لَقِيَنِي فَقَالَ بَدَا لِي أَنْ لاَ أَتَزَوَّجَ يَوْمِي هَذَا‏.‏ قَالَ عُمَرُ فَلَقِيتُ أَبَا بَكْرٍ فَقُلْتُ إِنْ شِئْتَ أَنْكَحْتُكَ حَفْصَةَ‏.‏","english":{"narrator":"Narrated `Abdullah bin `Umar:","text":"When Hafsa, `Umar's daughter became a widow because of the death of her (husband) Ibn Hudhafa \nAs-Sahmi who was one of the companion of the Prophet (ﷺ) and the one of the Badr warriors and died at \nMedina, `Umar said, \"I met `Uthman bin `Affan and gave him an offer, saying, 'If you wish, I will \nmarry Hafsa to you.' He said. 'I will think it over' I waited for a few days, then he met me and said, 'I \nhave made up my mind not to marry at present' \"`Umar added, \"Then I met Abu Bakr and said to him, \n'If you wish, I will marry Hafsa to you.' \""}},{"id":66,"idInBook":66,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ أَبِي عَمْرٍو، قَالَ حَدَّثَنِي أَبِي قَالَ، حَدَّثَنِي إِبْرَاهِيمُ، عَنْ يُونُسَ، عَنِ الْحَسَنِ، ‏{‏فَلاَ تَعْضُلُوهُنَّ‏}‏ قَالَ حَدَّثَنِي مَعْقِلُ بْنُ يَسَارٍ، أَنَّهَا نَزَلَتْ فِيهِ قَالَ زَوَّجْتُ أُخْتًا لِي مِنْ رَجُلٍ فَطَلَّقَهَا، حَتَّى إِذَا انْقَضَتْ عِدَّتُهَا جَاءَ يَخْطُبُهَا، فَقُلْتُ لَهُ زَوَّجْتُكَ وَفَرَشْتُكَ وَأَكْرَمْتُكَ، فَطَلَّقْتَهَا، ثُمَّ جِئْتَ تَخْطُبُهَا، لاَ وَاللَّهِ لاَ تَعُودُ إِلَيْكَ أَبَدًا، وَكَانَ رَجُلاً لاَ بَأْسَ بِهِ وَكَانَتِ الْمَرْأَةُ تُرِيدُ أَنَّ تَرْجِعَ إِلَيْهِ فَأَنْزَلَ اللَّهُ هَذِهِ الآيَةَ ‏{‏فَلاَ تَعْضُلُوهُنَّ‏}‏ فَقُلْتُ الآنَ أَفْعَلُ يَا رَسُولَ اللَّهِ‏.‏ قَالَ فَزَوَّجَهَا إِيَّاهُ‏.‏","english":{"narrator":"Narrated Al-Hasan:","text":"concerning the Verse: 'Do not prevent them' (2.232) Ma'qil bin Yasar told me that it was revealed in \nhis connection. He said, \"I married my sister to a man and he divorced her, and when her days of 'Idda \n(three menstrual periods) were over, the man came again and asked for her hand, but I said to him, 'I \nmarried her to you and made her your bed (your wife) and favored you with her, but you divorced her. \nNow you come to ask for her hand again? No, by Allah, she will never go back to you (again)!' That \nman was not a bad man and his wife wanted to go back to him. So Allah revealed this Verse: 'Do not \nprevent them.' (2.232) So I said, 'Now I will do it (let her go back to him), O Allah's Messenger (ﷺ).\"So he \nmarried her to him again."}},{"id":67,"idInBook":67,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا ابْنُ سَلاَمٍ، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ فِي قَوْلِهِ ‏{‏وَيَسْتَفْتُونَكَ فِي النِّسَاءِ قُلِ اللَّهُ يُفْتِيكُمْ فِيهِنَّ‏}‏ إِلَى آخِرِ الآيَةِ، قَالَتْ هِيَ الْيَتِيمَةُ تَكُونُ فِي حَجْرِ الرَّجُلِ، قَدْ شَرِكَتْهُ فِي مَالِهِ، فَيَرْغَبُ عَنْهَا أَنْ يَتَزَوَّجَهَا، وَيَكْرَهُ أَنْ يُزَوِّجَهَا غَيْرَهُ، فَيَدْخُلَ عَلَيْهِ فِي مَالِهِ، فَيَحْبِسُهَا، فَنَهَاهُمُ اللَّهُ عَنْ ذَلِكَ‏.‏","english":{"narrator":"Narrated `Aisha:","text":"(regarding His Statement): 'They ask your instruction concerning the women. Say: Allah instructs you \nabout them ...' (4.127) It is about the female orphan who is under the guardianship of a man with \nwhom she shares her property and he does not want to marry her and dislikes that someone else \nshould marry her, lest he should share the property with him, so he prevents her from marrying. So \nAllah forbade such a guardian to do so (i.e. to prevent her from marrying)."}},{"id":68,"idInBook":68,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ الْمِقْدَامِ، حَدَّثَنَا فُضَيْلُ بْنُ سُلَيْمَانَ، حَدَّثَنَا أَبُو حَازِمٍ، حَدَّثَنَا سَهْلُ بْنُ سَعْدٍ، كُنَّا عِنْدَ النَّبِيِّ صلى الله عليه وسلم جُلُوسًا فَجَاءَتْهُ امْرَأَةٌ تَعْرِضُ نَفْسَهَا عَلَيْهِ فَخَفَّضَ فِيهَا النَّظَرَ وَرَفَعَهُ فَلَمْ يُرِدْهَا، فَقَالَ رَجُلٌ مِنْ أَصْحَابِهِ زَوِّجْنِيهَا يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ أَعِنْدَكَ مِنْ شَىْءٍ ‏\"‏‏.‏ قَالَ مَا عِنْدِي مِنْ شَىْءٍ‏.‏ قَالَ ‏\"‏ وَلاَ خَاتَمًا مِنْ حَدِيدٍ ‏\"‏‏.‏ قَالَ وَلاَ خَاتَمًا مِنَ حَدِيدٍ وَلَكِنْ أَشُقُّ بُرْدَتِي هَذِهِ فَأُعْطِيهَا النِّصْفَ، وَآخُذُ النِّصْفَ‏.‏ قَالَ ‏\"‏ لاَ، هَلْ مَعَكَ مِنَ الْقُرْآنِ شَىْءٌ ‏\"‏‏.‏ قَالَ نَعَمْ‏.‏ قَالَ ‏\"‏ اذْهَبْ فَقَدْ زَوَّجْتُكَهَا بِمَا مَعَكَ مِنَ الْقُرْآنِ ‏\"‏‏.‏","english":{"narrator":"Narrated Sahl bin Sa`d:","text":"While we were sitting in the company of the Prophet (ﷺ) a woman came to him and presented herself (for \nmarriage) to him. The Prophet (ﷺ) looked at her, lowering his eyes and raising them, but did not give a \nreply. One of his companions said, \"Marry her to me O Allah's Messenger (ﷺ)!\" The Prophet (ﷺ) asked (him), \n\"Have you got anything?\" He said, \"I have got nothing.\" The Prophet (ﷺ) said, \"Not even an iron ring?\" \nHe Sa`d, \"Not even an iron ring, but I will tear my garment into two halves and give her one half and \nkeep the other half.\" The Prophet; said, \"No. Do you know some of the Qur'an (by heart)?\" He said, \n\"Yes.\" The Prophet (ﷺ) said, \"Go, I have agreed to marry her to you with what you know of the Qur'an (as \nher Mahr).\""}},{"id":69,"idInBook":69,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم تَزَوَّجَهَا وَهْىَ بِنْتُ سِتِّ سِنِينَ، وَأُدْخِلَتْ عَلَيْهِ وَهْىَ بِنْتُ تِسْعٍ، وَمَكَثَتْ عِنْدَهُ تِسْعًا‏.‏","english":{"narrator":"Narrated `Aisha:","text":"that the Prophet (ﷺ) married her when she was six years old and he consummated his marriage when she \nwas nine years old, and then she remained with him for nine years (i.e., till his death)."}},{"id":70,"idInBook":70,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ، حَدَّثَنَا وُهَيْبٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم تَزَوَّجَهَا وَهْىَ بِنْتُ سِتِّ سِنِينَ، وَبَنَى بِهَا وَهْىَ بِنْتُ تِسْعِ سِنِينَ‏.‏ قَالَ هِشَامٌ وَأُنْبِئْتُ أَنَّهَا كَانَتْ عِنْدَهُ تِسْعَ سِنِينَ‏.‏","english":{"narrator":"Narrated `Aisha:","text":"that the Prophet (ﷺ) married her when she was six years old and he consummated his marriage when she \nwas nine years old. Hisham said: I have been informed that `Aisha remained with the Prophet (ﷺ) for nine \nyears (i.e. till his death)."}},{"id":71,"idInBook":71,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، قَالَ جَاءَتِ امْرَأَةٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ إِنِّي وَهَبْتُ مِنْ نَفْسِي‏.‏ فَقَامَتْ طَوِيلاً فَقَالَ رَجُلٌ زَوِّجْنِيهَا، إِنْ لَمْ تَكُنْ لَكَ بِهَا حَاجَةٌ‏.‏ قَالَ ‏\"‏ هَلْ عِنْدَكَ مِنْ شَىْءٍ تُصْدِقُهَا ‏\"‏‏.‏ قَالَ مَا عِنْدِي إِلاَّ إِزَارِي‏.‏ فَقَالَ ‏\"‏ إِنْ أَعْطَيْتَهَا إِيَّاهُ جَلَسْتَ لاَ إِزَارَ لَكَ، فَالْتَمِسْ شَيْئًا ‏\"‏‏.‏ فَقَالَ مَا أَجِدُ شَيْئًا‏.‏ فَقَالَ ‏\"‏ الْتَمِسْ وَلَوْ خَاتَمًا مِنْ حَدِيدِ ‏\"‏‏.‏ فَلَمْ يَجِدْ‏.‏ فَقَالَ ‏\"‏ أَمَعَكَ مِنَ الْقُرْآنِ شَىْءٌ ‏\"‏‏.‏ قَالَ نَعَمْ سُورَةُ كَذَا وَسُورَةُ كَذَا لِسُوَرٍ سَمَّاهَا‏.‏ فَقَالَ ‏\"‏ زَوَّجْنَاكَهَا بِمَا مَعَكَ مِنَ الْقُرْآنِ ‏\"‏‏.‏","english":{"narrator":"Narrated Sahl bin Sa`d:","text":"A woman came to Allah's Messenger (ﷺ) and said, \"I present myself (to you) (for marriage). She stayed for a \nlong while, then a man said, \"If you are not in need of her then marry her to me.\" The Prophet (ﷺ) said, \n\"Have you got anything m order to pay her Mahr?\" He said, \"I have nothing with me except my Izar \n(waist sheet).\" The Prophet (ﷺ) said, \"If you give her your Izar, you will have no Izar to wear, (so go) and \nsearch for something. He said, \"I could not find anything.\" The Prophet (ﷺ) said, \"Try (to find something), \neven if it were an iron ring But he was not able to find (even that) The Prophet (ﷺ) said (to him). \"Do you \nmemorize something of the Qur'an?\" \"Yes. ' he said, \"such Sura and such Sura,\" naming those Suras \nThe Prophet (ﷺ) said, \"We have married her to you for what you know of the Qur'an (by heart)."}},{"id":72,"idInBook":72,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا مُعَاذُ بْنُ فَضَالَةَ، حَدَّثَنَا هِشَامٌ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، أَنَّ أَبَا هُرَيْرَةَ، حَدَّثَهُمْ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ تُنْكَحُ الأَيِّمُ حَتَّى تُسْتَأْمَرَ وَلاَ تُنْكَحُ الْبِكْرُ حَتَّى تُسْتَأْذَنَ ‏\"‏‏.‏ قَالُوا يَا رَسُولَ اللَّهِ وَكَيْفَ إِذْنُهَا قَالَ ‏\"‏ أَنْ تَسْكُتَ ‏\"‏‏.‏","english":{"narrator":"Narrated Abu Huraira:","text":"The Prophet (ﷺ) said, \"A matron should not be given in marriage except after consulting her; and a virgin \nshould not be given in marriage except after her permission.\" The people asked, \"O Allah's Messenger (ﷺ)! \nHow can we know her permission?\" He said, \"Her silence (indicates her permission)."}},{"id":73,"idInBook":73,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا عَمْرُو بْنُ الرَّبِيعِ بْنِ طَارِقٍ، قَالَ أَخْبَرَنَا اللَّيْثُ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنْ أَبِي عَمْرٍو، مَوْلَى عَائِشَةَ عَنْ عَائِشَةَ، أَنَّهَا قَالَتْ يَا رَسُولَ اللَّهِ إِنَّ الْبِكْرَ تَسْتَحِي‏.‏ قَالَ ‏\n\"‏ رِضَاهَا صَمْتُهَا ‏\"‏‏.‏","english":{"narrator":"Narrated `Aisha:","text":"I said, \"O Allah's Messenger (ﷺ)! A virgin feels shy.\" He said, \"Her consent is (expressed by) her silence.\""}},{"id":74,"idInBook":74,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَبْدِ الرَّحْمَنِ، وَمُجَمِّعٍ، ابْنَىْ يَزِيدَ بْنِ جَارِيَةَ عَنْ خَنْسَاءَ بِنْتِ خِذَامٍ الأَنْصَارِيَّةِ، أَنَّ أَبَاهَا، زَوَّجَهَا وَهْىَ ثَيِّبٌ، فَكَرِهَتْ ذَلِكَ فَأَتَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم فَرَدَّ نِكَاحَهُ‏.‏","english":{"narrator":"Narrated Khansa bint Khidam Al-Ansariya:","text":"that her father gave her in marriage when she was a matron and she disliked that marriage. So she \nwent to Allah's Messenger (ﷺ) and he declared that marriage invalid."}},{"id":75,"idInBook":75,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا إِسْحَاقُ، أَخْبَرَنَا يَزِيدُ، أَخْبَرَنَا يَحْيَى، أَنَّ الْقَاسِمَ بْنَ مُحَمَّدٍ، حَدَّثَهُ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ يَزِيدَ وَمُجَمِّعَ بْنَ يَزِيدَ حَدَّثَاهُ أَنَّ رَجُلاً يُدْعَى خِذَامًا أَنْكَحَ ابْنَةً لَهُ‏.‏ نَحْوَهُ‏.‏","english":{"narrator":"Narrated `Abdur-Rahman bin Yazid and Majammi bin Yazid:","text":"The same ,Hadith above: A man called Khidam married a daughter of his (to somebody) against her \nconsent. 'If you fear that you shall not be able to deal justly with the orphan girls then marry (other) \nwomen of your choice.' (4.3) And if somebody says to the guardian (of a woman), \"Marry me to soand- \nso,\" and the guardian remained silent or said to him, \"What have you got?\" And the other said, \"I \nhave so much and so much (Mahr),\" or kept quiet, and then the guardian said, \"I have married her to \nyou,\" then the marriage is valid (legal). This narration was told by Sahl on the authority of the \nProphet."}},{"id":76,"idInBook":76,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ،‏.‏ وَقَالَ اللَّيْثُ حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّهُ سَأَلَ عَائِشَةَ ـ رضى الله عنها ـ قَالَ لَهَا يَا أُمَّتَاهْ ‏{‏وَإِنْ خِفْتُمْ أَنْ لاَ تُقْسِطُوا فِي الْيَتَامَى‏}‏ إِلَى ‏{‏مَا مَلَكَتْ أَيْمَانُكُمْ‏}‏ قَالَتْ عَائِشَةُ يَا ابْنَ أُخْتِي هَذِهِ الْيَتِيمَةُ تَكُونُ فِي حَجْرِ وَلِيِّهَا، فَيَرْغَبُ فِي جَمَالِهَا وَمَالِهَا، وَيُرِيدُ أَنْ يَنْتَقِصَ مِنْ صَدَاقِهَا، فَنُهُوا عَنْ نِكَاحِهِنَّ‏.‏ إِلاَّ أَنْ يُقْسِطُوا لَهُنَّ فِي إِكْمَالِ الصَّدَاقِ وَأُمِرُوا بِنِكَاحِ مَنْ سِوَاهُنَّ مِنَ النِّسَاءِ، قَالَتْ عَائِشَةُ اسْتَفْتَى النَّاسُ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعْدَ ذَلِكَ فَأَنْزَلَ اللَّهُ ‏{‏وَيَسْتَفْتُونَكَ فِي النِّسَاءِ‏}‏ إِلَى ‏{‏وَتَرْغَبُونَ‏}‏ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ لَهُمْ فِي هَذِهِ الآيَةِ أَنَّ الْيَتِيمَةَ إِذَا كَانَتْ ذَاتَ مَالٍ وَجَمَالٍ، رَغِبُوا فِي نِكَاحِهَا وَنَسَبِهَا وَالصَّدَاقِ، وَإِذَا كَانَتْ مَرْغُوبًا عَنْهَا فِي قِلَّةِ الْمَالِ وَالْجَمَالِ، تَرَكُوهَا وَأَخَذُوا غَيْرَهَا مِنَ النِّسَاءِ ـ قَالَتْ ـ فَكَمَا يَتْرُكُونَهَا حِينَ يَرْغَبُونَ عَنْهَا، فَلَيْسَ لَهُمْ أَنْ يَنْكِحُوهَا إِذَا رَغِبُوا فِيهَا، إِلاَّ أَنْ يُقْسِطُوا لَهَا وَيُعْطُوهَا حَقَّهَا الأَوْفَى مِنَ الصَّدَاقِ‏.‏","english":{"narrator":"Narrated 'Urwa bin Az-Zubair:","text":"that he asked `Aisha, saying to her, \"O Mother! (In what connection was this Verse revealed): \n'If you fear that you shall not be able to deal justly with orphan girls (to the end of the verse) that your \nright hands possess?\" (4.3) Aisha said, \"O my nephew! It was about the female orphan under the \nprotection of her guardian who was interested in her beauty and wealth and wanted to marry her with \na little or reduced Mahr. So such guardians were forbidden to marry female orphans unless they deal \nwith them justly and give their full Mahr; and they were ordered to marry women other than \nthem.\"`Aisha added, \"(Later) the people asked Allah's Messenger (ﷺ), for instructions, and then Allah \nrevealed: 'They ask your instruction concerning the women . . . And yet whom you desire to marry.' \n(4.127) So Allah revealed to them in this Verse that-if a female orphan had wealth and beauty, they \ndesired to marry her and were interested in her noble descent and the reduction of her Mahr; but if she \nwas not desired by them because of her lack in fortune and beauty they left her and married some \nother woman. So, as they used to leave her when they had no interest in her, they had no right to \nmarry her if they had the desire to do so, unless they deal justly with her and gave her a full amount of \nMahr.\""}},{"id":77,"idInBook":77,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلٍ، أَنَّ امْرَأَةً، أَتَتِ النَّبِيَّ صلى الله عليه وسلم فَعَرَضَتْ عَلَيْهِ نَفْسَهَا فَقَالَ ‏\"‏ مَا لِي الْيَوْمَ فِي النِّسَاءِ مِنْ حَاجَةٍ ‏\"‏‏.‏ فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ زَوِّجْنِيهَا‏.‏ قَالَ ‏\"‏ مَا عِنْدَكَ ‏\"‏‏.‏ قَالَ مَا عِنْدِي شَىْءٌ‏.‏ قَالَ ‏\"‏ أَعْطِهَا وَلَوْ خَاتَمًا مِنْ حَدِيدٍ ‏\"‏‏.‏ قَالَ مَا عِنْدِي شَىْءٌ‏.‏ قَالَ ‏\"‏ فَمَا عِنْدَكَ مِنَ الْقُرْآنِ ‏\"‏‏.‏ قَالَ عِنْدِي كَذَا وَكَذَا‏.‏ قَالَ ‏\"‏ فَقَدْ مَلَّكْتُكَهَا بِمَا مَعَكَ مِنَ الْقُرْآنِ ‏\"‏‏.‏","english":{"narrator":"Narrated Sahl:","text":"A woman came to the Prophet,, and presented herself to him (for marriage). He said, \"I am not in need \nof women these days.\" Then a man said, \"O Allah's Messenger (ﷺ)! Marry her to me.\" The Prophet (ﷺ) asked \nhim, \"What have you got?\" He said, \"I have got nothing.\" The Prophet (ﷺ) said, \"Give her something, \neven an iron ring.\" He said, \"I have got nothing.\" The Prophet (ﷺ) asked (him), \"How much of the Qur'an \ndo you know (by heart)?\" He said, \"So much and so much.\" The Prophet (ﷺ) said, \"I have married her to \nyou for what you know of the Qur'an.\""}},{"id":78,"idInBook":78,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا مَكِّيُّ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا ابْنُ جُرَيْجٍ، قَالَ سَمِعْتُ نَافِعًا، يُحَدِّثُ أَنَّ ابْنَ عُمَرَ ـ رضى الله عنهما ـ كَانَ يَقُولُ نَهَى النَّبِيُّ صلى الله عليه وسلم أَنْ يَبِيعَ بَعْضُكُمْ عَلَى بَيْعِ بَعْضٍ، وَلاَ يَخْطُبَ الرَّجُلُ عَلَى خِطْبَةِ أَخِيهِ، حَتَّى يَتْرُكَ الْخَاطِبُ قَبْلَهُ، أَوْ يَأْذَنَ لَهُ الْخَاطِبُ‏.‏","english":{"narrator":"Narrated Ibn `Umar:","text":"The Prophet (ﷺ) decreed that one should not try to cancel a bargain already agreed upon between some \nother persons (by offering a bigger price). And a man should not ask for the hand of a girl who is \nalready engaged to his Muslim brother, unless the first suitor gives her up, or allows him to ask for her \nhand."}},{"id":79,"idInBook":79,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا اللَّيْثُ، عَنْ جَعْفَرِ بْنِ رَبِيعَةَ، عَنِ الأَعْرَجِ، قَالَ قَالَ أَبُو هُرَيْرَةَ يَأْثُرُ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِيَّاكُمْ وَالظَّنَّ، فَإِنَّ الظَّنَّ أَكْذَبُ الْحَدِيثِ، وَلاَ تَجَسَّسُوا، وَلاَ تَحَسَّسُوا، وَلاَ تَبَاغَضُوا، وَكُونُوا إِخْوَانًا ‏\"‏‏.‏ وَلَا يَخْطُبُ الرَّجُلُ عَلَى خِطْبَةِ أَخِيهِ حَتَّى يَنْكِحَ أَوْ يَتْرُكَ","english":{"narrator":"Narrated Abu Huraira:","text":"The Prophet (ﷺ) said, \"Beware of suspicion (about others), as suspicion is the falsest talk, and do not spy \nupon each other, and do not listen to the evil talk of the people about others' affairs, and do not have \nenmity with one another, but be brothers. And none should ask for the hand of a girl who is already \nengaged to his (Muslim) brother, but one should wait till the first suitor marries her or leaves her.\""}},{"id":80,"idInBook":80,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ، أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ يُحَدِّثُ أَنَّ عُمَرَ بْنَ الْخَطَّابِ حِينَ تَأَيَّمَتْ حَفْصَةُ قَالَ عُمَرُ لَقِيتُ أَبَا بَكْرٍ فَقُلْتُ إِنْ شِئْتَ أَنْكَحْتُكَ حَفْصَةَ بِنْتَ عُمَرَ‏.‏ فَلَبِثْتُ لَيَالِيَ ثُمَّ خَطَبَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَلَقِيَنِي أَبُو بَكْرٍ فَقَالَ إِنَّهُ لَمْ يَمْنَعْنِي أَنْ أَرْجِعَ إِلَيْكَ فِيمَا عَرَضْتَ إِلاَّ أَنِّي قَدْ عَلِمْتُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَدْ ذَكَرَهَا فَلَمْ أَكُنْ لأُفْشِيَ سِرَّ رَسُولِ اللَّهِ صلى الله عليه وسلم وَلَوْ تَرَكَهَا لَقَبِلْتُهَا‏.‏ تَابَعَهُ يُونُسُ وَمُوسَى بْنُ عُقْبَةَ وَابْنُ أَبِي عَتِيقٍ عَنِ الزُّهْرِيِّ‏.‏","english":{"narrator":"Narrated `Abdullah bin `Umar:","text":"\"When Hafsa became a widow,\" `Umar said, \"I met Abu Bakr and said to him, 'If you wish I will \nmarry Hafsa bint `Umar to you.' I waited for a few days then Allah's Messenger (ﷺ) asked for her hand. Later \nAbu Bakr met me and said, 'Nothing stopped me from returning to you concerning your offer except \nthat I knew that Allah's Messenger (ﷺ) had mentioned (his wish to marry) her, and I could never let out the \nsecret of Allah's Messenger (ﷺ) . If he had left her, I would have accepted her.' \""}},{"id":81,"idInBook":81,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا قَبِيصَةُ، حَدَّثَنَا سُفْيَانُ، عَنْ زَيْدِ بْنِ أَسْلَمَ، قَالَ سَمِعْتُ ابْنَ عُمَرَ، يَقُولُ جَاءَ رَجُلاَنِ مِنَ الْمَشْرِقِ فَخَطَبَا فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ إِنَّ مِنَ الْبَيَانِ لَسِحْرً‏\"‏‏.‏","english":{"narrator":"Narrated Ibn `Umar:","text":"Two men came from the east and delivered speeches, and the Prophet (ﷺ) said, \"Some eloquent speech has the influence of magic.\" (e.g., some people refuse to do something and then a good eloquent speaker addresses them and then they agree to do that very thing after his speech)"}},{"id":82,"idInBook":82,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، حَدَّثَنَا خَالِدُ بْنُ ذَكْوَانَ، قَالَ قَالَتِ الرُّبَيِّعُ بِنْتُ مُعَوِّذٍ ابْنِ عَفْرَاءَ‏.‏ جَاءَ النَّبِيُّ صلى الله عليه وسلم فَدَخَلَ حِينَ بُنِيَ عَلَىَّ، فَجَلَسَ عَلَى فِرَاشِي كَمَجْلِسِكَ مِنِّي، فَجَعَلَتْ جُوَيْرِيَاتٌ لَنَا يَضْرِبْنَ بِالدُّفِّ وَيَنْدُبْنَ مَنْ قُتِلَ مِنْ آبَائِي يَوْمَ بَدْرٍ، إِذْ قَالَتْ إِحْدَاهُنَّ وَفِينَا نَبِيٌّ يَعْلَمُ مَا فِي غَدٍ‏.‏ فَقَالَ ‏\n\"‏ دَعِي هَذِهِ، وَقُولِي بِالَّذِي كُنْتِ تَقُولِينَ ‏\"‏‏.‏","english":{"narrator":"Narrated Ar-Rabi`:","text":"(the daughter of Muawwidh bin Afra) After the consummation of my marriage, the Prophet (ﷺ) came and \nsat on my bed as far from me as you are sitting now, and our little girls started beating the \ntambourines and reciting elegiac verses mourning my father who had been killed in the battle of Badr. \nOne of them said, \"Among us is a Prophet who knows what will happen tomorrow.\" On that the \nProphet said, \"Leave this (saying) and keep on saying the verses which you had been saying before.\""}},{"id":83,"idInBook":83,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، عَنْ أَنَسٍ، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ عَوْفٍ، تَزَوَّجَ امْرَأَةً عَلَى وَزْنِ نَوَاةٍ، فَرَأَى النَّبِيُّ صلى الله عليه وسلم بَشَاشَةَ الْعُرْسِ فَسَأَلَهُ فَقَالَ إِنِّي تَزَوَّجْتُ امْرَأَةً عَلَى وَزْنِ نَوَاةٍ‏.‏ وَعَنْ قَتَادَةَ عَنْ أَنَسٍ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ عَوْفٍ تَزَوَّجَ امْرَأَةً عَلَى وَزْنِ نَوَاةٍ مِنْ ذَهَبٍ‏.‏","english":{"narrator":"Narrated Anas:","text":"`Abdur Rahman bin `Auf married a woman and gave her gold equal to the weight of a date stone (as \nMahr). When the Prophet (ﷺ) noticed the signs of cheerfulness of the marriage (on his face) and asked \nhim about it, he said, \"I have married a woman and gave (her) gold equal to a date stone in weight (as \nMahr)."}},{"id":84,"idInBook":84,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، سَمِعْتُ أَبَا حَازِمٍ، يَقُولُ سَمِعْتُ سَهْلَ بْنَ سَعْدٍ السَّاعِدِيَّ، يَقُولُ إِنِّي لَفِي الْقَوْمِ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِذْ قَامَتِ امْرَأَةٌ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّهَا قَدْ وَهَبَتْ نَفْسَهَا لَكَ فَرَ فِيهَا رَأْيَكَ فَلَمْ يُجِبْهَا شَيْئًا ثُمَّ قَامَتْ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّهَا قَدْ وَهَبَتْ نَفْسَهَا لَكَ فَرَ فِيهَا رَأْيَكَ فَلَمْ يُجِبْهَا شَيْئًا ثُمَّ قَامَتِ الثَّالِثَةَ فَقَالَتْ إِنَّهَا قَدْ وَهَبَتْ نَفْسَهَا لَكَ فَرَ فِيهَا رَأْيَكَ فَقَامَ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ أَنْكِحْنِيهَا‏.‏ قَالَ ‏\"‏ هَلْ عِنْدَكَ مِنْ شَىْءٍ ‏\"‏‏.‏ قَالَ لاَ‏.‏ قَالَ ‏\"‏ اذْهَبْ فَاطْلُبْ وَلَوْ خَاتَمًا مِنْ حَدِيدٍ ‏\"‏‏.‏ فَذَهَبَ فَطَلَبَ ثُمَّ جَاءَ فَقَالَ مَا وَجَدْتُ شَيْئًا وَلاَ خَاتَمًا مِنْ حَدِيدٍ‏.‏ فَقَالَ ‏\"‏ هَلْ مَعَكَ مِنَ الْقُرْآنِ شَىْءٌ ‏\"‏‏.‏ قَالَ مَعِي سُورَةُ كَذَا وَسُورَةُ كَذَا‏.‏ قَالَ ‏\"‏ اذْهَبْ فَقَدْ أَنْكَحْتُكَهَا بِمَا مَعَكَ مِنَ الْقُرْآنِ ‏\"‏‏.‏","english":{"narrator":"Narrated Sahl bin Sa`d As-Sa`idi:","text":"While I was (sitting) among the people in the company of Allah's Messenger (ﷺ) a woman stood up and said, \n\"O Allah's Messenger (ﷺ)! She has given herself in marriage to you; please give your opinion of her.\" The \nProphet did not give her any reply. She again stood up and said, \"O Allah's Messenger (ﷺ)! She has given \nherself (in marriage) to you; so please give your opinion of her. The Prophet (ﷺ) did not give her any \nreply. She again stood up for the third time and said, \"She has given herself in marriage to you: so \ngive your opinion of her.\" So a man stood up and said, \"O Allah's Messenger (ﷺ)! Marry her to me.\" The \nProphet asked him, \"Have you got anything?\" He said, \"No.\" The Prophet (ﷺ) said, \"Go and search for \nsomething, even if it were an iron ring.\" The man went and searched and then returned saying, \"I \ncould not find anything, not even an iron ring.\" Then the Prophet (ﷺ) said, \"Do you know something of \nthe Qur'an (by heart)?\" He replied, \"I know (by heart) such Sura and such Sura.\" The Prophet (ﷺ) said, \n\"Go! I have married her to you for what you know of the Qur'an (by heart)."}},{"id":85,"idInBook":85,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا يَحْيَى، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ لِرَجُلٍ ‏\n\"‏ تَزَوَّجْ وَلَوْ بِخَاتَمٍ مِنْ حَدِيدٍ ‏\"‏‏.‏","english":{"narrator":"Narrated Sahl bin Sa`d:","text":"The Prophet (ﷺ) said to a man, \"Marry, even with (a Mahr equal to) an iron ring.\""}},{"id":86,"idInBook":86,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا أَبُو الْوَلِيدِ، هِشَامُ بْنُ عَبْدِ الْمَلِكِ حَدَّثَنَا لَيْثٌ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ أَبِي الْخَيْرِ، عَنْ عُقْبَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ أَحَقُّ مَا أَوْفَيْتُمْ مِنَ الشُّرُوطِ أَنْ تُوفُوا بِهِ مَا اسْتَحْلَلْتُمْ بِهِ الْفُرُوجَ ‏\"‏‏.‏","english":{"narrator":"Narrated `Uqba:","text":"The Prophet (ﷺ) said: \"The stipulations most entitled to be abided by are those with which you are given \nthe right to enjoy the (women's) private parts (i.e. the stipulations of the marriage contract)."}},{"id":87,"idInBook":87,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنْ زَكَرِيَّاءَ ـ هُوَ ابْنُ أَبِي زَائِدَةَ ـ عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَحِلُّ لاِمْرَأَةٍ تَسْأَلُ طَلاَقَ أُخْتِهَا لِتَسْتَفْرِغَ صَحْفَتَهَا، فَإِنَّمَا لَهَا مَا قُدِّرَ لَهَا ‏\"‏‏.‏","english":{"narrator":"Narrated Abu Huraira:","text":"The Prophet (ﷺ) said, \"It is not lawful for a woman (at the time of wedding) to ask for the divorce of her \nsister (i.e. the other wife of her would-be husband) in order to have everything for herself, for she will \ntake only what has been written for her.\""}},{"id":88,"idInBook":88,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ حُمَيْدٍ الطَّوِيلِ، عَنْ أَنَسِ بْنِ مَالِكٍ، رضى الله عنه أَنَّ عَبْدَ، الرَّحْمَنِ بْنَ عَوْفٍ جَاءَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَبِهِ أَثَرُ صُفْرَةٍ فَسَأَلَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَخْبَرَهُ أَنَّهُ تَزَوَّجَ امْرَأَةً مِنَ الأَنْصَارِ قَالَ ‏\"‏ كَمْ سُقْتَ إِلَيْهَا ‏\"‏‏.‏ قَالَ زِنَةَ نَوَاةٍ مِنْ ذَهَبٍ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَوْلِمْ وَلَوْ بِشَاةٍ ‏\"‏‏.‏","english":{"narrator":"Narrated Anas bin Malik:","text":"`Abdur-Rahman bin `Auf came to Allah's Messenger (ﷺ) and he had marks of Sufra (yellow perfume). \nAllah's Messenger (ﷺ) asked him (about those marks). `AbdurRahman bin `Auf told him that he had married \na woman from the Ansar. The Prophet (ﷺ) asked, \"How much Mahr did you pay her?\" He said, \"I paid \ngold equal to the weight of a date stone.\" Allah's Messenger (ﷺ) said to him, \"Give a wedding banquet, even \nif with one sheep.\""}},{"id":89,"idInBook":89,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ، قَالَ أَوْلَمَ النَّبِيُّ صلى الله عليه وسلم بِزَيْنَبَ فَأَوْسَعَ الْمُسْلِمِينَ خَيْرًا فَخَرَجَ ـ كَمَا يَصْنَعُ إِذَا تَزَوَّجَ ـ فَأَتَى حُجَرَ أُمَّهَاتِ الْمُؤْمِنِينَ يَدْعُو وَيَدْعُونَ ‏{‏لَهُ‏}‏ ثُمَّ انْصَرَفَ فَرَأَى رَجُلَيْنِ فَرَجَعَ لاَ أَدْرِي آخْبَرْتُهُ أَوْ أُخْبِرَ بِخُرُوجِهِمَا‏.‏","english":{"narrator":"Narrated Anas:","text":"The Prophet (ﷺ) offered a wedding banquet on the occasion of his marriage to Zainab, and provided a \ngood meal for the Muslims. Then he went out as was his custom on marrying, he came to the dwelling \nplaces of the mothers of the Believers (i.e. his wives) invoking good (on them), and they were \ninvoking good (on him). Then he departed (and came back) and saw two men (still sitting there). So \nhe left again. I do not remember whether I informed him or he was informed (by somebody else) of \ntheir departure)."}},{"id":90,"idInBook":90,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادٌ ـ هُوَ ابْنُ زَيْدٍ ـ عَنْ ثَابِتٍ، عَنْ أَنَسٍ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم رَأَى عَلَى عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ أَثَرَ صُفْرَةٍ قَالَ ‏\"‏ مَا هَذَا ‏\"‏‏.‏ قَالَ إِنِّي تَزَوَّجْتُ امْرَأَةً عَلَى وَزْنِ نَوَاةٍ مِنْ ذَهَبٍ‏.‏ قَالَ ‏\"‏ بَارَكَ اللَّهُ لَكَ، أَوْلِمْ وَلَوْ بِشَاةٍ ‏\"‏‏.‏","english":{"narrator":"Narrated Anas:","text":"The Prophet (ﷺ) saw the traces of Sufra (yellow perfume) on `Abdur-Rahman bin `Auf and said, \"What is \nthis?\" `Abdur-Rahman, said, \"I have married a woman and have paid gold equal to the weight of a \ndatestone (as her Mahr). The Prophet (ﷺ) said to him, \"May Allah bless you: Offer a wedding banquet \neven with one sheep.\""}},{"id":91,"idInBook":91,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا فَرْوَةُ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ تَزَوَّجَنِي النَّبِيُّ صلى الله عليه وسلم فَأَتَتْنِي أُمِّي فَأَدْخَلَتْنِي الدَّارَ، فَإِذَا نِسْوَةٌ مِنَ الأَنْصَارِ فِي الْبَيْتِ فَقُلْنَ عَلَى الْخَيْرِ وَالْبَرَكَةِ، وَعَلَى خَيْرِ طَائِرٍ‏.‏","english":{"narrator":"Narrated `Aisha:","text":"When the Prophet (ﷺ) married me, my mother came to me and made me enter the house where I saw some \nwomen from the Ansar who said, \"May you prosper and have blessings and have good omen.\""}},{"id":92,"idInBook":92,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، حَدَّثَنَا ابْنُ الْمُبَارَكِ، عَنْ مَعْمَرٍ، عَنْ هَمَّامٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ غَزَا نَبِيٌّ مِنَ الأَنْبِيَاءِ فَقَالَ لِقَوْمِهِ لاَ يَتْبَعْنِي رَجُلٌ مَلَكَ بُضْعَ امْرَأَةٍ وَهْوَ يُرِيدُ أَنْ يَبْنِيَ بِهَا وَلَمْ يَبْنِ بِهَا ‏\"‏‏.‏","english":{"narrator":"Narrated Abu Huraira:","text":"The Prophet (ﷺ) said, \"A prophet among the prophets went for a military expedition and said to his \npeople: \"A man who has married a lady and wants to consummate his marriage with her and he has \nnot done so yet, should not accompany me.' \""}},{"id":93,"idInBook":93,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا قَبِيصَةُ بْنُ عُقْبَةَ، حَدَّثَنَا سُفْيَانُ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ عُرْوَةَ، تَزَوَّجَ النَّبِيُّ صلى الله عليه وسلم عَائِشَةَ وَهْىَ ابْنَةُ سِتٍّ وَبَنَى بِهَا وَهْىَ ابْنَةُ تِسْعٍ وَمَكَثَتْ عِنْدَهُ تِسْعًا‏.‏","english":{"narrator":"Narrated 'Urwa:","text":"The Prophet (ﷺ) wrote the (marriage contract) with `Aisha while she was six years old and consummated \nhis marriage with her while she was nine years old and she remained with him for nine years (i.e. till \nhis death)."}},{"id":94,"idInBook":94,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ سَلاَمٍ، أَخْبَرَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ، قَالَ أَقَامَ النَّبِيُّ صلى الله عليه وسلم بَيْنَ خَيْبَرَ وَالْمَدِينَةِ ثَلاَثًا يُبْنَى عَلَيْهِ بِصَفِيَّةَ بِنْتِ حُيَىٍّ فَدَعَوْتُ الْمُسْلِمِينَ إِلَى وَلِيمَتِهِ، فَمَا كَانَ فِيهَا مِنْ خُبْزٍ وَلاَ لَحْمٍ، أَمَرَ بِالأَنْطَاعِ فَأُلْقِيَ فِيهَا مِنَ التَّمْرِ وَالأَقِطِ وَالسَّمْنِ فَكَانَتْ وَلِيمَتَهُ، فَقَالَ الْمُسْلِمُونَ إِحْدَى أُمَّهَاتِ الْمُؤْمِنِينَ أَوْ مِمَّا مَلَكَتْ يَمِينُهُ فَقَالُوا إِنْ حَجَبَهَا فَهْىَ مِنْ أُمَّهَاتِ الْمُؤْمِنِينَ، وَإِنْ لَمْ يَحْجُبْهَا فَهْىَ مِمَّا مَلَكَتْ يَمِينُهُ فَلَمَّا ارْتَحَلَ وَطَّى لَهَا خَلْفَهُ وَمَدَّ الْحِجَابَ بَيْنَهَا وَبَيْنَ النَّاسِ‏.‏","english":{"narrator":"Narrated Anas:","text":"The Prophet (ﷺ) stayed for three days at a place between Khaibar and Medina, and there he consummated \nhis marriage with Safiyya bint Huyay. I invited the Muslims to a banquet which included neither meat \nnor bread. The Prophet (ﷺ) ordered for the leather dining sheets to be spread, and then dates, dried yogurt \nand butter were provided over it, and that was the Walima (banquet) of the Prophet. The Muslims \nasked whether Safiyya would be considered as his wife or as a slave girl of what his right hands \npossessed. Then they said, \"If the Prophet (ﷺ) screens her from the people, then she Is the Prophet's wife \nbut if he does not screen her, then she is a slave girl.\" So when the Prophet (ﷺ) proceeded, he made a \nplace for her (on the camel) behind him and screened her from people."}},{"id":95,"idInBook":95,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنِي فَرْوَةُ بْنُ أَبِي الْمَغْرَاءِ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ تَزَوَّجَنِي النَّبِيُّ صلى الله عليه وسلم فَأَتَتْنِي أُمِّي فَأَدْخَلَتْنِي الدَّارَ، فَلَمْ يَرُعْنِي إِلاَّ رَسُولُ اللَّهِ صلى الله عليه وسلم ضُحًى‏.‏","english":{"narrator":"Narrated Aisha:","text":"When the Prophet (ﷺ) married me, my mother came to me and made me enter the house (of the Prophet) \nand nothing surprised me but the coming of Allah's Messenger (ﷺ) to me in the forenoon."}},{"id":96,"idInBook":96,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا مُحَمَّدُ بْنُ الْمُنْكَدِرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَلِ اتَّخَذْتُمْ أَنْمَاطًا ‏\"‏‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ وَأَنَّى لَنَا أَنْمَاطٌ‏.‏ قَالَ ‏\"‏ إِنَّهَا سَتَكُونُ ‏\"‏‏.‏","english":{"narrator":"Narrated Jabir bin `Abdullah:","text":"Allah's Messenger (ﷺ) said, \"Did you get Anmat?\" I said, 'O Allah's Messenger (ﷺ)! From where can we have \nAnmat?\" The Prophet (ﷺ) said, \"Soon you will have them (Anmat)."}},{"id":97,"idInBook":97,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا الْفَضْلُ بْنُ يَعْقُوبَ، حَدَّثَنَا مُحَمَّدُ بْنُ سَابِقٍ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّهَا زَفَّتِ امْرَأَةً إِلَى رَجُلٍ مِنَ الأَنْصَارِ فَقَالَ نَبِيُّ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ يَا عَائِشَةُ مَا كَانَ مَعَكُمْ لَهْوٌ فَإِنَّ الأَنْصَارَ يُعْجِبُهُمُ اللَّهْوُ ‏\"‏‏.‏","english":{"narrator":"Narrated 'Aisha:","text":"that she prepared a lady for a man from the Ansar as his bride and the\n     Prophet said, \"O 'Aisha! Haven't you got any amusement (during the \n     marriage ceremony) as the Ansar like amusement?\""}},{"id":98,"idInBook":98,"chapterId":67,"bookId":1,"arabic":"وَقَالَ إِبْرَاهِيمُ عَنْ أَبِي عُثْمَانَ ـ وَاسْمُهُ الْجَعْدُ ـ عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ مَرَّ بِنَا فِي مَسْجِدِ بَنِي رِفَاعَةَ فَسَمِعْتُهُ يَقُولُ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا مَرَّ بِجَنَبَاتِ أُمِّ سُلَيْمٍ دَخَلَ عَلَيْهَا فَسَلَّمَ عَلَيْهَا، ثُمَّ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم عَرُوسًا بِزَيْنَبَ فَقَالَتْ لِي أُمُّ سُلَيْمٍ لَوْ أَهْدَيْنَا لِرَسُولِ اللَّهِ صلى الله عليه وسلم هَدِيَّةً فَقُلْتُ لَهَا افْعَلِي‏.‏ فَعَمَدَتْ إِلَى تَمْرٍ وَسَمْنٍ وَأَقِطٍ، فَاتَّخَذَتْ حَيْسَةً فِي بُرْمَةٍ، فَأَرْسَلَتْ بِهَا مَعِي إِلَيْهِ، فَانْطَلَقْتُ بِهَا إِلَيْهِ فَقَالَ لِي ‏\"‏ ضَعْهَا ‏\"‏‏.‏ ثُمَّ أَمَرَنِي فَقَالَ ‏\"‏ ادْعُ لِي رِجَالاً ـ سَمَّاهُمْ ـ وَادْعُ لِي مَنْ لَقِيتَ ‏\"‏‏.‏ قَالَ فَفَعَلْتُ الَّذِي أَمَرَنِي فَرَجَعْتُ فَإِذَا الْبَيْتُ غَاصٌّ بِأَهْلِهِ، فَرَأَيْتُ النَّبِيَّ صلى الله عليه وسلم وَضَعَ يَدَيْهِ عَلَى تِلْكَ الْحَيْسَةِ، وَتَكَلَّمَ بِهَا مَا شَاءَ اللَّهُ، ثُمَّ جَعَلَ يَدْعُو عَشَرَةً عَشَرَةً، يَأْكُلُونَ مِنْهُ، وَيَقُولُ لَهُمُ ‏\"‏ اذْكُرُوا اسْمَ اللَّهِ، وَلْيَأْكُلْ كُلُّ رَجُلٍ مِمَّا يَلِيهِ ‏\"‏‏.‏ قَالَ حَتَّى تَصَدَّعُوا كُلُّهُمْ عَنْهَا، فَخَرَجَ مِنْهُمْ مَنْ خَرَجَ، وَبَقِيَ نَفَرٌ يَتَحَدَّثُونَ قَالَ وَجَعَلْتُ أَغْتَمُّ، ثُمَّ خَرَجَ النَّبِيُّ صلى الله عليه وسلم نَحْوَ الْحُجُرَاتِ، وَخَرَجْتُ فِي إِثْرِهِ فَقُلْتُ إِنَّهُمْ قَدْ ذَهَبُوا‏.‏ فَرَجَعَ فَدَخَلَ الْبَيْتَ، وَأَرْخَى السِّتْرَ، وَإِنِّي لَفِي الْحُجْرَةِ، وَهْوَ يَقُولُ ‏{‏يَا أَيُّهَا الَّذِينَ آمَنُوا لاَ تَدْخُلُوا بُيُوتَ النَّبِيِّ إِلاَّ أَنْ يُؤْذَنَ لَكُمْ إِلَى طَعَامٍ غَيْرَ نَاظِرِينَ إِنَاهُ وَلَكِنْ إِذَا دُعِيتُمْ فَادْخُلُوا فَإِذَا طَعِمْتُمْ فَانْتَشِرُوا وَلاَ مُسْتَأْنِسِينَ لِحَدِيثٍ إِنَّ ذَلِكُمْ كَانَ يُؤْذِي النَّبِيَّ فَيَسْتَحْيِي مِنْكُمْ وَاللَّهُ لاَ يَسْتَحْيِي مِنَ الْحَقِّ‏}‏‏.‏ قَالَ أَبُو عُثْمَانَ قَالَ أَنَسٌ إِنَّهُ خَدَمَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَشْرَ سِنِينَ‏.‏","english":{"narrator":"Narrated Anas bin Malik:","text":"\"Whenever the Prophet (ﷺ) passed by (my mother Um-Sulaim) he used to enter\n     her and greet her. Anas further said: Once the Prophet (ﷺ) way a \n     bridegroom during his marriage with Zainab, Um Sulaim said to me, \"Let\n     us give a gift to Allah's Messenger (ﷺ) .\" I said to her, \"Do it.\" So she \n     prepared Haisa (a sweet dish) made from dates, butter and dried \n     yoghurt and she sent it with me to him. I took it to him and he said, \n     \"Put it down,\" and ordered me to call some men whom he named, and to \n     invite whomever I would meet. I did what he ordered me to do, and when\n     I returned, I found the house crowded with people and saw the Prophet (ﷺ) \n     keeping his hand over the Haisa and saying over it whatever Allah \n     wished (him to say). Then he called the men in batches of ten to eat \n     of it, and he said to them, \"Mention the Name of Allah, and each man \n     should eat of the dish the nearest to him.\" When all of them had \n     finished their meals, some of them left and a few remained there \n     talking, over which I felt unhappy. Then the Prophet (ﷺ) went out towards \n     the dwelling places (of his wives) and I too, went out after him and \n     told him that those people had left. Then he returned and entered his \n     dwelling place and let the curtains fall while I was in (his) dwelling\n     place, and he was reciting the Verses:-- 'O you who believe! Enter not\n     the Prophet's house until leave is given you for a meal, (and then) \n     not (as early as) to what for its preparation. But when you are \n     invited, enter, and when you have taken your meals, disperse without \n     sitting for a talk. Verily such (behavior) annoys the Prophet; and he \n     would be shy of (asking) you (to go), but Allah is not shy of (telling\n     you) the Truth.' (33-53) Abu Uthman said: Anas said, \"I served the \n     Prophet for ten years.\""}},{"id":99,"idInBook":99,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنِي عُبَيْدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّهَا اسْتَعَارَتْ مِنْ أَسْمَاءَ قِلاَدَةً، فَهَلَكَتْ، فَأَرْسَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم نَاسًا مِنْ أَصْحَابِهِ فِي طَلَبِهَا، فَأَدْرَكَتْهُمُ الصَّلاَةُ فَصَلَّوْا بِغَيْرِ وُضُوءٍ، فَلَمَّا أَتَوُا النَّبِيَّ صلى الله عليه وسلم شَكَوْا ذَلِكَ إِلَيْهِ، فَنَزَلَتْ آيَةُ التَّيَمُّمِ‏.‏ فَقَالَ أُسَيْدُ بْنُ حُضَيْرٍ جَزَاكِ اللَّهُ خَيْرًا، فَوَاللَّهِ مَا نَزَلَ بِكِ أَمْرٌ قَطُّ، إِلاَّ جَعَلَ لَكِ مِنْهُ مَخْرَجًا، وَجُعِلَ لِلْمُسْلِمِينَ فِيهِ بَرَكَةٌ‏.‏","english":{"narrator":"Narrated `Aisha:","text":"That she borrowed a necklace from Asma' and then it got lost. So Allah's Messenger (ﷺ) sent some people \nfrom his companions in search of it. In the meantime the stated time for the prayer became due and \nthey offered their prayer without ablution. When they came to the Prophet, they complained about it to \nhim, so the Verse regarding Tayammum was revealed . \nUsaid bin Hudair said, \"(O `Aisha!) may Allah bless you with a good reward, for by Allah, never did a \ndifficulty happen in connection with you, but Allah made an escape from it for you, and brought \nAllah's Blessings for the Muslims.\""}},{"id":100,"idInBook":100,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا سَعْدُ بْنُ حَفْصٍ، حَدَّثَنَا شَيْبَانُ، عَنْ مَنْصُورٍ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ كُرَيْبٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ أَمَا لَوْ أَنَّ أَحَدَهُمْ يَقُولُ حِينَ يَأْتِي أَهْلَهُ بِاسْمِ اللَّهِ، اللَّهُمَّ جَنِّبْنِي الشَّيْطَانَ، وَجَنِّبِ الشَّيْطَانَ مَا رَزَقْتَنَا، ثُمَّ قُدِّرَ بَيْنَهُمَا فِي ذَلِكَ، أَوْ قُضِيَ وَلَدٌ، لَمْ يَضُرَّهُ شَيْطَانٌ أَبَدًا ‏\"‏‏.‏","english":{"narrator":"Narrated Ibn `Abbas:","text":"The Prophet (ﷺ) said, \"If anyone of you, when having sexual intercourse with his wife, says: Bismillah, \nAllahumma jannibni-Sh-Shaitan wa jannib-ish-Shaitan ma razaqtana, and if it is destined that they \nshould have a child, then Satan will never be able to harm him.\""}},{"id":101,"idInBook":101,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، قَالَ حَدَّثَنِي اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي أَنَسُ بْنُ مَالِكٍ ـ رضى الله عنه ـ أَنَّهُ كَانَ ابْنَ عَشْرِ سِنِينَ مَقْدَمَ رَسُولِ اللَّهِ صلى الله عليه وسلم الْمَدِينَةَ، فَكَانَ أُمَّهَاتِي يُوَاظِبْنَنِي عَلَى خِدْمَةِ النَّبِيِّ صلى الله عليه وسلم فَخَدَمْتُهُ عَشْرَ سِنِينَ، وَتُوُفِّيَ النَّبِيُّ صلى الله عليه وسلم وَأَنَا ابْنُ عِشْرِينَ سَنَةً، فَكُنْتُ أَعْلَمَ النَّاسِ بِشَأْنِ الْحِجَابِ حِينَ أُنْزِلَ، وَكَانَ أَوَّلَ مَا أُنْزِلَ فِي مُبْتَنَى رَسُولِ اللَّهِ صلى الله عليه وسلم بِزَيْنَبَ ابْنَةِ جَحْشٍ، أَصْبَحَ النَّبِيُّ صلى الله عليه وسلم بِهَا عَرُوسًا، فَدَعَا الْقَوْمَ فَأَصَابُوا مِنَ الطَّعَامِ، ثُمَّ خَرَجُوا وَبَقِيَ رَهْطٌ مِنْهُمْ عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَأَطَالُوا الْمُكْثَ، فَقَامَ النَّبِيُّ صلى الله عليه وسلم فَخَرَجَ وَخَرَجْتُ مَعَهُ لِكَىْ يَخْرُجُوا، فَمَشَى النَّبِيُّ صلى الله عليه وسلم وَمَشَيْتُ، حَتَّى جَاءَ عَتَبَةَ حُجْرَةِ عَائِشَةَ، ثُمَّ ظَنَّ أَنَّهُمْ خَرَجُوا فَرَجَعَ وَرَجَعْتُ مَعَهُ، حَتَّى إِذَا دَخَلَ عَلَى زَيْنَبَ فَإِذَا هُمْ جُلُوسٌ لَمْ يَقُومُوا، فَرَجَعَ النَّبِيُّ صلى الله عليه وسلم وَرَجَعْتُ مَعَهُ، حَتَّى إِذَا بَلَغَ عَتَبَةَ حُجْرَةِ عَائِشَةَ، وَظَنَّ أَنَّهُمْ خَرَجُوا، فَرَجَعَ وَرَجَعْتُ مَعَهُ فَإِذَا هُمْ قَدْ خَرَجُوا فَضَرَبَ النَّبِيُّ صلى الله عليه وسلم بَيْنِي وَبَيْنَهُ بِالسِّتْرِ، وَأُنْزِلَ الْحِجَابُ‏.‏","english":{"narrator":"Narrated Anas bin Malik:","text":"I was ten years old when Allah's Messenger (ﷺ) arrived at Medina. My mother and aunts used to urge me to \nserve the Prophet (ﷺ) regularly, and I served him for ten years. When the Prophet (ﷺ) died I was twenty years \nold, and I knew about the order of Al-Hijab (veiling of ladies) more than any other person when it was \nrevealed. It was revealed for the first time when Allah's Messenger (ﷺ) had consummated his marriage with \nZainab bint Jahsh. When the day dawned, the Prophet (ﷺ) was a bridegroom and he invited the people to a \nbanquet, so they came, ate, and then all left except a few who remained with the Prophet (ﷺ) for a long \ntime. The Prophet (ﷺ) got up and went out, and I too went out with him so that those people might leave \ntoo. The Prophet (ﷺ) proceeded and so did I, till he came to the threshold of `Aisha's dwelling place. Then \nthinking that these people have left by then, he returned and so did I along with him till he entered \nupon Zainab and behold, they were still sitting and had not gone. So the Prophet (ﷺ) again went away and \nI went away along with him. When we reached the threshold of `Aisha's dwelling place, he thought \nthat they had left, and so he returned and I too, returned along with him and found those people had \nleft. Then the Prophet (ﷺ) drew a curtain between me and him, and the Verses of Al-Hijab were revealed."}},{"id":102,"idInBook":102,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا عَلِيٌّ، حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنِي حُمَيْدٌ، أَنَّهُ سَمِعَ أَنَسًا ـ رضى الله عنه ـ قَالَ سَأَلَ النَّبِيُّ صلى الله عليه وسلم عَبْدَ الرَّحْمَنِ بْنَ عَوْفٍ وَتَزَوَّجَ امْرَأَةً مِنَ الأَنْصَارِ ‏\"‏ كَمْ أَصْدَقْتَهَا ‏\"‏‏.‏ قَالَ وَزْنَ نَوَاةٍ مِنْ ذَهَبٍ‏.‏ وَعَنْ حُمَيْدٍ سَمِعْتُ أَنَسًا قَالَ لَمَّا قَدِمُوا الْمَدِينَةَ نَزَلَ الْمُهَاجِرُونَ عَلَى الأَنْصَارِ فَنَزَلَ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ عَلَى سَعْدِ بْنِ الرَّبِيعِ فَقَالَ أُقَاسِمُكَ مَالِي وَأَنْزِلُ لَكَ عَنْ إِحْدَى امْرَأَتَىَّ‏.‏ قَالَ بَارَكَ اللَّهُ لَكَ فِي أَهْلِكَ وَمَالِكَ‏.‏ فَخَرَجَ إِلَى السُّوقِ فَبَاعَ وَاشْتَرَى فَأَصَابَ شَيْئًا مِنْ أَقِطٍ وَسَمْنٍ فَتَزَوَّجَ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَوْلِمْ وَلَوْ بِشَاةٍ ‏\"‏‏.‏","english":{"narrator":"Narrated Anas:","text":"When `Abdur-Rahman bin `Auf married an Ansari woman, the Prophet (ﷺ) asked him, \"How much Mahr \ndid you give her?\" `Abdur-Rahman said, \"Gold equal to the weight of a date stone.\" Anas added: \nWhen they (i.e. the Prophet (ﷺ) and his companions) arrived at Medina, the emigrants stayed at the \nAnsar's houses. `Abdur-Rahman bin `Auf stayed at Sa`d bin Ar-Rabi's house. Sa`d said to `Abdur- \nRahman, \"I will divide and share my property with you and will give one of my two wives to you.\" \n`Abdur-Rahman said, \"May Allah bless you, your wives and property (I am not in need of that; but \nkindly show me the way to the market).\" So `Abdur-Rahman went to the market and traded there \ngaining a profit of some dried yoghurt and butter, and married (an Ansari woman). The Prophet (ﷺ) said \nto him, \"Give a banquet, even if with one sheep.\""}},{"id":103,"idInBook":103,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادٌ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، قَالَ مَا أَوْلَمَ النَّبِيُّ صلى الله عليه وسلم عَلَى شَىْءٍ مِنْ نِسَائِهِ، مَا أَوْلَمَ عَلَى زَيْنَبَ أَوْلَمَ بِشَاةٍ‏.‏","english":{"narrator":"Narrated Anas:","text":"The Prophet (ﷺ) did not give a better wedding banquet on the occasion of marrying any of his wives than \nthe one he gave on marrying Zainab, and that banquet was with (consisted of) one sheep."}},{"id":104,"idInBook":104,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا مُسَدَّدٌ، عَنْ عَبْدِ الْوَارِثِ، عَنْ شُعَيْبٍ، عَنْ أَنَسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَعْتَقَ صَفِيَّةَ، وَتَزَوَّجَهَا وَجَعَلَ عِتْقَهَا صَدَاقَهَا، وَأَوْلَمَ عَلَيْهَا بِحَيْسٍ‏.‏","english":{"narrator":"Narrated Anas:","text":"Allah's Messenger (ﷺ) manumitted Safiyya and then married her, and her Mahr was her manumission, and he \ngave a wedding banquet with Hais (a sort of sweet dish made from butter, cheese and dates)."}},{"id":105,"idInBook":105,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا زُهَيْرٌ، عَنْ بَيَانٍ، قَالَ سَمِعْتُ أَنَسًا، يَقُولُ بَنَى النَّبِيُّ صلى الله عليه وسلم بِامْرَأَةٍ فَأَرْسَلَنِي فَدَعَوْتُ رِجَالاً إِلَى الطَّعَامِ‏.‏","english":{"narrator":"Narrated Anas:","text":"The Prophet (ﷺ) consummated his marriage with a woman (Zainab), so he sent me to invite men to the \nmeals."}},{"id":106,"idInBook":106,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ ثَابِتٍ، قَالَ ذُكِرَ تَزْوِيجُ زَيْنَبَ ابْنَةِ جَحْشٍ عِنْدَ أَنَسٍ فَقَالَ مَا رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم أَوْلَمَ عَلَى أَحَدٍ مِنْ نِسَائِهِ مَا أَوْلَمَ عَلَيْهَا أَوْلَمَ بِشَاةٍ‏.‏","english":{"narrator":"Narrated Thabit:","text":"The marriage of Zainab bint Jahash was mentioned in the presence of Anas and he said, \"I did not see \nthe Prophet (ﷺ) giving a better banquet on marrying any of his wives than the one he gave on marrying \nZainab. He then gave a banquet with one sheep.\""}},{"id":107,"idInBook":107,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ مَنْصُورِ ابْنِ صَفِيَّةَ، عَنْ أُمِّهِ، صَفِيَّةَ بِنْتِ شَيْبَةَ قَالَتْ أَوْلَمَ النَّبِيُّ صلى الله عليه وسلم عَلَى بَعْضِ نِسَائِهِ بِمُدَّيْنِ مِنْ شَعِيرٍ‏.‏","english":{"narrator":"Narrated Safiyya bint Shaiba:","text":"The Prophet (ﷺ) gave a banquet with two Mudds of barley on marrying some of his wives. (1 Mudd= 1 \n3/4 of a kilogram) ."}},{"id":108,"idInBook":108,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ ـ رضى الله عنهما ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا دُعِيَ أَحَدُكُمْ إِلَى الْوَلِيمَةِ فَلْيَأْتِهَا ‏\"‏‏.‏","english":{"narrator":"Narrated `Abdullah bin `Umar:","text":"Allah's Messenger (ﷺ) said, \"If anyone of you is invited to a wedding banquet, he must go for it (accept the \ninvitation).\""}},{"id":109,"idInBook":109,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ سُفْيَانَ، قَالَ حَدَّثَنِي مَنْصُورٌ، عَنْ أَبِي وَائِلٍ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ فُكُّوا الْعَانِيَ، وَأَجِيبُوا الدَّاعِيَ، وَعُودُوا الْمَرِيضَ ‏\"‏‏.‏","english":{"narrator":"Narrated Abu Musa:","text":"The Prophet (ﷺ) said, \"Set the captives free, accept the invitation (to a wedding banquet), and visit the \npatients.\""}},{"id":110,"idInBook":110,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا الْحَسَنُ بْنُ الرَّبِيعِ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنِ الأَشْعَثِ، عَنْ مُعَاوِيَةَ بْنِ سُوَيْدٍ، قَالَ الْبَرَاءُ بْنُ عَازِبٍ ـ رضى الله عنهما ـ أَمَرَنَا النَّبِيُّ صلى الله عليه وسلم بِسَبْعٍ، وَنَهَانَا عَنْ سَبْعٍ، أَمَرَنَا بِعِيَادَةِ الْمَرِيضِ، وَاتِّبَاعِ الْجِنَازَةِ، وَتَشْمِيتِ الْعَاطِسِ، وَإِبْرَارِ الْقَسَمِ، وَنَصْرِ الْمَظْلُومِ، وَإِفْشَاءِ السَّلاَمِ، وَإِجَابَةِ الدَّاعِي، وَنَهَانَا عَنْ خَوَاتِيمِ الذَّهَبِ، وَعَنْ آنِيَةِ الْفِضَّةِ، وَعَنِ الْمَيَاثِرِ، وَالْقَسِّيَّةِ، وَالإِسْتَبْرَقِ وَالدِّيبَاجِ‏.‏ تَابَعَهُ أَبُو عَوَانَةَ وَالشَّيْبَانِيُّ عَنْ أَشْعَثَ فِي إِفْشَاءِ السَّلاَمِ‏.‏","english":{"narrator":"Narrated Al-Bara' bin `Azib:","text":"The Prophet (ﷺ) ordered us to do seven (things) and forbade us from seven. He ordered us to visit the \npatients, to follow the funeral procession, to reply to the sneezer (i.e., say to him, 'Yarhamuka-l-lah \n(May Allah bestow His Mercy upon you), if he says 'Al-hamduli l-lah' (Praise be to Allah), to help \nothers to fulfill their oaths, to help the oppressed, to greet (whomever one should meet), and to accept \nthe invitation (to a wedding banquet). He forbade us to wear golden rings, to use silver utensils, to use \nMaiyathir (cushions of silk stuffed with cotton and placed under the rider on the saddle), the Qasiyya \n(linen clothes containing silk brought from an Egyptian town), the Istibraq (thick silk) and the Dibaj \n(another kind of silk). (See Hadith No. 539 and 753)."}},{"id":111,"idInBook":111,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، قَالَ دَعَا أَبُو أُسَيْدٍ السَّاعِدِيُّ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي عُرْسِهِ، وَكَانَتِ امْرَأَتُهُ يَوْمَئِذٍ خَادِمَهُمْ وَهْىَ الْعَرُوسُ، قَالَ سَهْلٌ تَدْرُونَ مَا سَقَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم أَنْقَعَتْ لَهُ تَمَرَاتٍ مِنَ اللَّيْلِ، فَلَمَّا أَكَلَ سَقَتْهُ إِيَّاهُ‏.‏","english":{"narrator":"Narrated Sahl bin Sa`d:","text":"Abu Usaid As-Sa'di invited Allah's Messenger (ﷺ) to his wedding party and his wife who was the bride, \nserved them on that day. Do you know what drink she gave Allah's Messenger (ﷺ)? She had soaked some \ndates for him (in water) overnight, and when he had finished his meal she gave him that drink (of \nsoaked dates)."}},{"id":112,"idInBook":112,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، رضى الله عنه أَنَّهُ كَانَ يَقُولُ شَرُّ الطَّعَامِ طَعَامُ الْوَلِيمَةِ يُدْعَى لَهَا الأَغْنِيَاءُ، وَيُتْرَكُ الْفُقَرَاءُ، وَمَنْ تَرَكَ الدَّعْوَةَ فَقَدْ عَصَى اللَّهَ وَرَسُولَهُ صلى الله عليه وسلم‏.‏","english":{"narrator":"Narrated Abu Huraira:","text":"The worst food is that of a wedding banquet to which only the rich are invited while the poor are not \ninvited. And he who refuses an invitation (to a banquet) disobeys Allah and His Apostle ."}},{"id":113,"idInBook":113,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا عَبْدَانُ، عَنْ أَبِي حَمْزَةَ، عَنِ الأَعْمَشِ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لَوْ دُعِيتُ إِلَى كُرَاعٍ لأَجَبْتُ، وَلَوْ أُهْدِيَ إِلَىَّ ذِرَاعٌ لَقَبِلْتُ ‏\"‏‏.‏","english":{"narrator":"Narrated Abu Huraira:","text":"The Prophet (ﷺ) said, \"If I am invited to a meal of trotters I will accept it; and if I am given a trotter as a \npresent I will accept it.\""}},{"id":114,"idInBook":114,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ بْنِ إِبْرَاهِيمَ، حَدَّثَنَا الْحَجَّاجُ بْنُ مُحَمَّدٍ، قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي مُوسَى بْنُ عُقْبَةَ، عَنْ نَافِعٍ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ ـ رضى الله عنهما ـ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ أَجِيبُوا هَذِهِ الدَّعْوَةَ إِذَا دُعِيتُمْ لَهَا ‏\"‏‏.‏ قَالَ كَانَ عَبْدُ اللَّهِ يَأْتِي الدَّعْوَةَ فِي الْعُرْسِ وَغَيْرِ الْعُرْسِ وَهْوَ صَائِمٌ‏.‏","english":{"narrator":"Narrated Nafi`:","text":"`Abdullah bin `Umar said, \"Allah's Messenger (ﷺ) said, 'Accept the marriage invitation if you are invited to \nit.' \" Ibn `Umar used to accept the invitation whether to a wedding banquet or to any other party, even \nwhen he was fasting."}},{"id":115,"idInBook":115,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ الْمُبَارَكِ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ صُهَيْبٍ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ أَبْصَرَ النَّبِيُّ صلى الله عليه وسلم نِسَاءً وَصِبْيَانًا مُقْبِلِينَ مِنْ عُرْسٍ، فَقَامَ مُمْتَنًّا فَقَالَ ‏\n\"‏ اللَّهُمَّ أَنْتُمْ مِنْ أَحَبِّ النَّاسِ إِلَىَّ ‏\"‏‏.‏","english":{"narrator":"Narrated Anas bin Malik:","text":"Once the Prophet (ﷺ) saw some women and children coming from a wedding party. He got up \nenergetically and happily and said, \"By Allah! You (i.e., the Ansar) are the most beloved of all people \nto me.\""}},{"id":116,"idInBook":116,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا أَخْبَرَتْهُ أَنَّهَا اشْتَرَتْ نُمْرُقَةً فِيهَا تَصَاوِيرُ، فَلَمَّا رَآهَا رَسُولُ اللَّهِ صلى الله عليه وسلم قَامَ عَلَى الْبَابِ فَلَمْ يَدْخُلْ، فَعَرَفْتُ فِي وَجْهِهِ الْكَرَاهِيَةَ فَقُلْتُ يَا رَسُولَ اللَّهِ أَتُوبُ إِلَى اللَّهِ وَإِلَى رَسُولِهِ، مَاذَا أَذْنَبْتُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَا بَالُ هَذِهِ النِّمْرِقَةِ ‏\"‏‏.‏ قَالَتْ فَقُلْتُ اشْتَرَيْتُهَا لَكَ لِتَقْعُدَ عَلَيْهَا وَتَوَسَّدَهَا‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ أَصْحَابَ هَذِهِ الصُّوَرِ يُعَذَّبُونَ يَوْمَ الْقِيَامَةِ، وَيُقَالُ لَهُمْ أَحْيُوا مَا خَلَقْتُمْ ‏\"‏‏.‏ وَقَالَ ‏\"‏ إِنَّ الْبَيْتَ الَّذِي فِيهِ الصُّوَرُ لاَ تَدْخُلُهُ الْمَلاَئِكَةُ ‏\"‏‏.‏","english":{"narrator":"Narrated Aisha:","text":"(the wife of the Prophet) I bought a cushion having on it pictures (of animals). When Allah's Messenger (ﷺ) \nsaw it, he stood at the door and did not enter. I noticed the sign of disapproval on his face and said, \"O \nAllah's Messenger (ﷺ)! I repent to Allah and His Apostle. What sin have I committed?' Allah's Messenger (ﷺ) said. \n\"What is this cushion?\" I said, \"I have bought it for you so that you may sit on it and recline on it.\" \nAllah's Messenger (ﷺ) said, \"The makers of these pictures will be punished on the Day of Resurrection, and \nit will be said to them, 'Give life to what you have created (i.e., these pictures).' \" The Prophet (ﷺ) added, \n\"The Angels of (Mercy) do not enter a house in which there are pictures (of animals)."}},{"id":117,"idInBook":117,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ، حَدَّثَنَا أَبُو غَسَّانَ، قَالَ حَدَّثَنِي أَبُو حَازِمٍ، عَنْ سَهْلٍ، قَالَ لَمَّا عَرَّسَ أَبُو أُسَيْدٍ السَّاعِدِيُّ دَعَا النَّبِيَّ صلى الله عليه وسلم وَأَصْحَابَهُ، فَمَا صَنَعَ لَهُمْ طَعَامًا وَلاَ قَرَّبَهُ إِلَيْهِمْ إِلاَّ امْرَأَتُهُ أُمُّ أُسَيْدٍ، بَلَّتْ تَمَرَاتٍ فِي تَوْرٍ مِنْ حِجَارَةٍ مِنَ اللَّيْلِ، فَلَمَّا فَرَغَ النَّبِيُّ صلى الله عليه وسلم مِنَ الطَّعَامِ أَمَاثَتْهُ لَهُ فَسَقَتْهُ، تُتْحِفُهُ بِذَلِكَ‏.‏","english":{"narrator":"Narrated Sahl:","text":"When Abu Usaid As-Sa`idi got married, he invited the Prophet (ﷺ) and his companions. None prepared \nthe food for them and brought it to them but his wife. She soaked some dates in water in a stone pot \novernight, and when the Prophet (ﷺ) had finished his food, she provided him with that drink (of soaked \ndates)."}},{"id":118,"idInBook":118,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنَا يَعْقُوبُ بْنُ عَبْدِ الرَّحْمَنِ الْقَارِيُّ، عَنْ أَبِي حَازِمٍ، قَالَ سَمِعْتُ سَهْلَ بْنَ سَعْدٍ، أَنَّ أَبَا أُسَيْدٍ السَّاعِدِيَّ، دَعَا النَّبِيَّ صلى الله عليه وسلم لِعُرْسِهِ، فَكَانَتِ امْرَأَتُهُ خَادِمَهُمْ يَوْمَئِذٍ وَهْىَ الْعَرُوسُ، فَقَالَتْ أَوْ قَالَ أَتَدْرُونَ مَا أَنْقَعَتْ لِرَسُولِ اللَّهِ صلى الله عليه وسلم أَنْقَعَتْ لَهُ تَمَرَاتٍ مِنَ اللَّيْلِ فِي تَوْرٍ‏.‏","english":{"narrator":"Narrated Sahl bin Sa`d:","text":"Abu Usaid As-Sa`idi invited the Prophet (ﷺ) to his wedding party and his wife served him on that day, \nand she was the bride. She said (or Sahl said), \"Do you know what she soaked for Allah's Messenger (ﷺ)? \nShe soaked some dates for him (in water) in a drinking bowl overnight.\""}},{"id":119,"idInBook":119,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ الْمَرْأَةُ كَالضِّلَعِ، إِنْ أَقَمْتَهَا كَسَرْتَهَا، وَإِنِ اسْتَمْتَعْتَ بِهَا اسْتَمْتَعْتَ بِهَا وَفِيهَا عِوَجٌ ‏\"‏‏.‏","english":{"narrator":"Narrated Abu Huraira:","text":"Allah's Messenger (ﷺ) said, \"The woman is like a rib; if you try to straighten her, she will break. So if you \nwant to get benefit from her, do so while she still has some crookedness.\""}},{"id":120,"idInBook":120,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا إِسْحَاقُ بْنُ نَصْرٍ، حَدَّثَنَا حُسَيْنٌ الْجُعْفِيُّ، عَنْ زَائِدَةَ، عَنْ مَيْسَرَةَ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلاَ يُؤْذِي جَارَهُ ‏\"‏‏.‏ \nوَاسْتَوْصُوا بِالنِّسَاءِ خَيْرًا فَإِنَّهُنَّ خُلِقْنَ مِنْ ضِلَعٍ وَإِنَّ أَعْوَجَ شَيْءٍ فِي الضِّلَعِ أَعْلَاهُ فَإِنْ ذَهَبْتَ تُقِيمُهُ كَسَرْتَهُ وَإِنْ تَرَكْتَهُ لَمْ يَزَلْ أَعْوَجَ فَاسْتَوْصُوا بِالنِّسَاءِ خَيْرًا","english":{"narrator":"Narrated Abu Huraira:","text":"The Prophet (ﷺ) said, \"Whoever believes in Allah and the Last Day should not hurt (trouble) his neighbor. \nAnd I advise you to take care of the women, for they are created from a rib and the most crooked \nportion of the rib is its upper part; if you try to straighten it, it will break, and if you leave it, it will \nremain crooked, so I urge you to take care of the women.\""}},{"id":121,"idInBook":121,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ كُنَّا نَتَّقِي الْكَلاَمَ وَالاِنْبِسَاطَ إِلَى نِسَائِنَا عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم هَيْبَةَ أَنْ يُنْزَلَ فِينَا شَىْءٌ فَلَمَّا تُوُفِّيَ النَّبِيُّ صلى الله عليه وسلم تَكَلَّمْنَا وَانْبَسَطْنَا‏.‏","english":{"narrator":"Narrated Ibn `Umar:","text":"During the lifetime of the Prophet (ﷺ) we used to avoid chatting leisurely and freely with our wives lest \nsome Divine inspiration might be revealed concerning us. But when the Prophet (ﷺ) had died, we started \nchatting leisurely and freely (with them)."}},{"id":122,"idInBook":122,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ، قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ كُلُّكُمْ رَاعٍ وَكُلُّكُمْ مَسْئُولٌ، فَالإِمَامُ رَاعٍ وَهْوَ مَسْئُولٌ وَالرَّجُلُ رَاعٍ عَلَى أَهْلِهِ وَهْوَ مَسْئُولٌ وَالْمَرْأَةُ رَاعِيَةٌ عَلَى بَيْتِ زَوْجِهَا وَهْىَ مَسْئُولَةٌ، وَالْعَبْدُ رَاعٍ عَلَى مَالِ سَيِّدِهِ وَهُوَ مَسْئُولٌ، أَلاَ فَكُلُّكُمْ رَاعٍ وَكُلُّكُمْ مَسْئُولٌ ‏\"‏‏.‏","english":{"narrator":"Narrated `Abdullah bin `Umar:","text":"The Prophet (ﷺ) said, \"Everyone of you is a guardian and everyone of you is responsible (for his wards). \nA ruler is a guardian and is responsible(for his subjects); a man is a guardian of his family and \nresponsible (for them); a wife is a guardian of her husband's house and she is responsible (for it), a \nslave is a guardian of his master's property and is responsible (for that). Beware! All of you are \nguardians and are responsible (for your wards)."}},{"id":123,"idInBook":123,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا سُلَيْمَانُ بْنُ عَبْدِ الرَّحْمَنِ، وَعَلِيُّ بْنُ حُجْرٍ، قَالاَ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ عَبْدِ اللَّهِ بْنِ عُرْوَةَ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ جَلَسَ إِحْدَى عَشْرَةَ امْرَأَةً، فَتَعَاهَدْنَ وَتَعَاقَدْنَ أَنْ لاَ يَكْتُمْنَ مِنْ أَخْبَارِ أَزْوَاجِهِنَّ شَيْئًا‏.‏ قَالَتِ الأُولَى زَوْجِي لَحْمُ جَمَلٍ، غَثٌّ عَلَى رَأْسِ جَبَلٍ، لاَ سَهْلٍ فَيُرْتَقَى، وَلاَ سَمِينٍ فَيُنْتَقَلُ‏.‏ قَالَتِ الثَّانِيَةُ زَوْجِي لاَ أَبُثُّ خَبَرَهُ، إِنِّي أَخَافُ أَنْ لاَ أَذَرَهُ، إِنْ أَذْكُرْهُ أَذْكُرْ عُجَرَهُ وَبُجَرَهُ‏.‏ قَالَتِ الثَّالِثَةُ زَوْجِي الْعَشَنَّقُ، إِنْ أَنْطِقْ أُطَلَّقْ وَإِنْ أَسْكُتْ أُعَلَّقْ‏.‏ قَالَتِ الرَّابِعَةُ زَوْجِي كَلَيْلِ تِهَامَةَ، لاَ حَرٌّ، وَلاَ قُرٌّ، وَلاَ مَخَافَةَ، وَلاَ سَآمَةَ‏.‏ قَالَتِ الْخَامِسَةُ زَوْجِي إِنْ دَخَلَ فَهِدَ، وَإِنْ خَرَجَ أَسِدَ، وَلاَ يَسْأَلُ عَمَّا عَهِدَ‏.‏ قَالَتِ السَّادِسَةُ زَوْجِي إِنْ أَكَلَ لَفَّ، وَإِنْ شَرِبَ اشْتَفَّ، وَإِنِ اضْطَجَعَ الْتَفَّ، وَلاَ يُولِجُ الْكَفَّ لِيَعْلَمَ الْبَثَّ، قَالَتِ السَّابِعَةُ زَوْجِي غَيَايَاءُ أَوْ عَيَايَاءُ طَبَاقَاءُ، كُلُّ دَاءٍ لَهُ دَاءٌ، شَجَّكِ أَوْ فَلَّكِ أَوْ جَمَعَ كُلاًّ لَكِ‏.‏ قَالَتِ الثَّامِنَةُ زَوْجِي الْمَسُّ مَسُّ أَرْنَبٍ، وَالرِّيحُ رِيحُ زَرْنَبٍ‏.‏ قَالَتِ التَّاسِعَةُ زَوْجِي رَفِيعُ الْعِمَادِ، طَوِيلُ النِّجَادِ، عَظِيمُ الرَّمَادِ، قَرِيبُ الْبَيْتِ مِنَ النَّادِ‏.‏ قَالَتِ الْعَاشِرَةُ زَوْجِي مَالِكٌ وَمَا مَالِكٌ، مَالِكٌ خَيْرٌ مِنْ ذَلِكِ، لَهُ إِبِلٌ كَثِيرَاتُ الْمَبَارِكِ قَلِيلاَتُ الْمَسَارِحِ، وَإِذَا سَمِعْنَ صَوْتَ الْمِزْهَرِ أَيْقَنَّ أَنَّهُنَّ هَوَالِكُ‏.‏ قَالَتِ الْحَادِيَةَ عَشْرَةَ زَوْجِي أَبُو زَرْعٍ فَمَا أَبُو زَرْعٍ أَنَاسَ مِنْ حُلِيٍّ أُذُنَىَّ، وَمَلأَ مِنْ شَحْمٍ عَضُدَىَّ، وَبَجَّحَنِي فَبَجِحَتْ إِلَىَّ نَفْسِي، وَجَدَنِي فِي أَهْلِ غُنَيْمَةٍ بِشِقٍّ، فَجَعَلَنِي فِي أَهْلِ صَهِيلٍ وَأَطِيطٍ وَدَائِسٍ وَمُنَقٍّ، فَعِنْدَهُ أَقُولُ فَلاَ أُقَبَّحُ وَأَرْقُدُ فَأَتَصَبَّحُ، وَأَشْرَبُ فَأَتَقَنَّحُ، أُمُّ أَبِي زَرْعٍ فَمَا أُمُّ أَبِي زَرْعٍ عُكُومُهَا رَدَاحٌ، وَبَيْتُهَا فَسَاحٌ، ابْنُ أَبِي زَرْعٍ، فَمَا ابْنُ أَبِي زَرْعٍ مَضْجِعُهُ كَمَسَلِّ شَطْبَةٍ، وَيُشْبِعُهُ ذِرَاعُ الْجَفْرَةِ، بِنْتُ أَبِي زَرْعٍ فَمَا بِنْتُ أَبِي زَرْعٍ طَوْعُ أَبِيهَا، وَطَوْعُ أُمِّهَا، وَمِلْءُ كِسَائِهَا، وَغَيْظُ جَارَتِهَا، جَارِيَةُ أَبِي زَرْعٍ، فَمَا جَارِيَةُ أَبِي زَرْعٍ لاَ تَبُثُّ حَدِيثَنَا تَبْثِيثًا، وَلاَ تُنَقِّثُ مِيرَتَنَا تَنْقِيثًا، وَلاَ تَمْلأُ بَيْتَنَا تَعْشِيشًا، قَالَتْ خَرَجَ أَبُو زَرْعٍ وَالأَوْطَابُ تُمْخَضُ، فَلَقِيَ امْرَأَةً مَعَهَا وَلَدَانِ لَهَا كَالْفَهْدَيْنِ يَلْعَبَانِ مِنْ تَحْتِ خَصْرِهَا بِرُمَّانَتَيْنِ، فَطَلَّقَنِي وَنَكَحَهَا، فَنَكَحْتُ بَعْدَهُ رَجُلاً سَرِيًّا، رَكِبَ شَرِيًّا وَأَخَذَ خَطِّيًّا وَأَرَاحَ عَلَىَّ نَعَمًا ثَرِيًّا، وَأَعْطَانِي مِنْ كُلِّ رَائِحَةٍ زَوْجًا وَقَالَ كُلِي أُمَّ زَرْعٍ، وَمِيرِي أَهْلَكِ‏.‏ قَالَتْ فَلَوْ جَمَعْتُ كُلَّ شَىْءٍ أَعْطَانِيهِ مَا بَلَغَ أَصْغَرَ آنِيَةِ أَبِي زَرْعٍ‏.‏ قَالَتْ عَائِشَةُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ كُنْتُ لَكِ كَأَبِي زَرْعٍ لأُمِّ زَرْعٍ ‏\"‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ قَالَ سَعِيدُ بْنُ سَلَمَةَ عَنْ هِشَامٍ وَلاَ تُعَشِّشُ بَيْتَنَا تَعْشِيشًا‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ قَالَ بَعْضُهُمْ فَأَتَقَمَّحُ‏.‏ بِالْمِيمِ، وَهَذَا أَصَحُّ‏.‏","english":{"narrator":"Narrated `Aisha:","text":"Eleven women sat (at a place) and promised and contracted that they would not conceal anything of \nthe news of their husbands. \nThe first one said, \"My husband is like the meat of a slim weak camel which is kept on the top of a \nmountain which is neither easy to climb, nor is the meat fat, so that one might put up with the trouble \nof fetching it.\" \nThe second one said, \"I shall not relate my husband's news, for I fear that I may not be able to finish \nhis story, for if I describe him, I will mention all his defects and bad traits.\" \nThe third one said, \"My husband, the \"too-tall\"! if I describe him (and he hears of that) he will \ndivorce me, and if I keep quiet, he will keep me hanging (neither divorcing me nor treating me as a \nwife).\" \nThe fourth one said, \"My husband is (moderate in temper) like the night of Tihama: neither hot nor \ncold; I am neither afraid of him, nor am I discontented with him.\" \nThe fifth one said, \"My husband, when entering (the house) is a leopard (sleeps a lot), and when going \nout, is a lion (boasts a lot). \nHe does not ask about whatever is in the house.\" \nThe sixth one said, \"If my husband eats, he eats too much (leaving the dishes empty), and if he drinks \nhe leaves nothing; if he sleeps he sleeps he rolls himself (alone in our blankets); and he does not insert \nhis palm to inquire about my feelings.\" \nThe seventh one said, \"My husband is a wrong-doer or weak and foolish. All the defects are present in \nhim. He may injure your head or your body or may do both.\" \nThe eighth one said, \"My husband is soft to touch like a rabbit and smells like a Zarnab (a kind of \ngood smelling grass).\" \nThe ninth one said, \"My husband is a tall generous man wearing a long strap for carrying his sword. \nHis ashes are abundant (i.e. generous to his guests) and his house is near to the people (who would \neasily consult him).\" \nThe tenth one said, \"My husband is Malik (possessor), and what is Malik? Malik is greater than \nwhatever I say about him. (He is beyond and above all praises which can come to my mind). Most of \nhis camels are kept at home (ready to be slaughtered for the guests) and only a few are taken to the \npastures. When the camels hear the sound of the lute (or the tambourine) they realize that they are \ngoing to be slaughtered for the guests.\" \nThe eleventh one said, \"My husband is Abu Zar` and what is Abu Zar` (i.e., what should I say about \nhim)? He has given me many ornaments and my ears are heavily loaded with them and my arms have \nbecome fat (i.e., I have become fat). And he has pleased me, and I have become so happy that I feel \nproud of myself. He found me with my family who were mere owners of sheep and living in poverty, \nand brought me to a respected family having horses and camels and threshing and purifying grain. \nWhatever I say, he does not rebuke or insult me. When I sleep, I sleep till late in the morning, and \nwhen I drink water (or milk), I drink my fill. The mother of Abu Zar and what may one say in praise \nof the mother of Abu Zar? Her saddle bags were always full of provision and her house was spacious. \nAs for the son of Abu Zar, what may one say of the son of Abu Zar? His bed is as narrow as an \nunsheathed sword and an arm of a kid (of four months) satisfies his hunger. As for the daughter of \nAbu Zar, she is obedient to her father and to her mother. She has a fat well-built body and that arouses \nthe jealousy of her husband's other wife. As for the (maid) slave girl of Abu Zar, what may one say of \nthe (maid) slavegirl of Abu Zar? She does not uncover our secrets but keeps them, and does not waste \nour provisions and does not leave the rubbish scattered everywhere in our house.\" \nThe eleventh lady added, \"One day it so happened that Abu Zar went out at the time when the milk \nwas being milked from the animals, and he saw a woman who had two sons like two leopards playing \nwith her two breasts. (On seeing her) he divorced me and married her. Thereafter I married a noble \nman who used to ride a fast tireless horse and keep a spear in his hand. He gave me many things, and \nalso a pair of every kind of livestock and said, Eat (of this), O Um Zar, and give provision to your \nrelatives.\" \nShe added, \"Yet, all those things which my second husband gave me could not fill the smallest utensil \nof Abu Zar's.\" \n`Aisha then said: Allah's Messenger (ﷺ) said to me, \"I am to you as Abu Zar was to his wife Um Zar.\""}},{"id":124,"idInBook":124,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، حَدَّثَنَا هِشَامٌ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ كَانَ الْحَبَشُ يَلْعَبُونَ بِحِرَابِهِمْ، فَسَتَرَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَنَا أَنْظُرُ، فَمَا زِلْتُ أَنْظُرُ حَتَّى كُنْتُ أَنَا أَنْصَرِفُ فَاقْدُرُوا قَدْرَ الْجَارِيَةِ الْحَدِيثَةِ السِّنِّ تَسْمَعُ اللَّهْوَ‏.‏","english":{"narrator":"Narrated 'Urwa:","text":"Aisha said, \"While the Ethiopians were playing with their small spears, Allah's Messenger (ﷺ) screened me \nbehind him and I watched (that display) and kept on watching till I left on my own.\" So you may \nestimate of what age a little girl may listen to amusement."}},{"id":125,"idInBook":125,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي ثَوْرٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ ـ رضى الله عنهما ـ قَالَ لَمْ أَزَلْ حَرِيصًا أَنْ أَسْأَلَ عُمَرَ بْنَ الْخَطَّابِ عَنِ الْمَرْأَتَيْنِ مِنْ أَزْوَاجِ النَّبِيِّ صلى الله عليه وسلم اللَّتَيْنِ قَالَ اللَّهُ تَعَالَى ‏{‏إِنْ تَتُوبَا إِلَى اللَّهِ فَقَدْ صَغَتْ قُلُوبُكُمَا‏}‏ حَتَّى حَجَّ وَحَجَجْتُ مَعَهُ، وَعَدَلَ وَعَدَلْتُ مَعَهُ بِإِدَاوَةٍ، فَتَبَرَّزَ، ثُمَّ جَاءَ فَسَكَبْتُ عَلَى يَدَيْهِ مِنْهَا فَتَوَضَّأَ فَقُلْتُ لَهُ يَا أَمِيرَ الْمُؤْمِنِينَ مَنِ الْمَرْأَتَانِ مِنْ أَزْوَاجِ النَّبِيِّ صلى الله عليه وسلم اللَّتَانِ قَالَ اللَّهُ تَعَالَى ‏{‏إِنْ تَتُوبَا إِلَى اللَّهِ فَقَدْ صَغَتْ قُلُوبُكُمَا‏}‏ قَالَ وَاعَجَبًا لَكَ يَا ابْنَ عَبَّاسٍ، هُمَا عَائِشَةُ وَحَفْصَةُ‏.‏ ثُمَّ اسْتَقْبَلَ عُمَرُ الْحَدِيثَ يَسُوقُهُ قَالَ كُنْتُ أَنَا وَجَارٌ لِي مِنَ الأَنْصَارِ فِي بَنِي أُمَيَّةَ بْنِ زَيْدٍ، وَهُمْ مِنْ عَوَالِي الْمَدِينَةِ، وَكُنَّا نَتَنَاوَبُ النُّزُولَ عَلَى النَّبِيِّ صلى الله عليه وسلم فَيَنْزِلُ يَوْمًا وَأَنْزِلُ يَوْمًا، فَإِذَا نَزَلْتُ جِئْتُهُ بِمَا حَدَثَ مِنْ خَبَرِ ذَلِكَ الْيَوْمِ مِنَ الْوَحْىِ أَوْ غَيْرِهِ، وَإِذَا نَزَلَ فَعَلَ مِثْلَ ذَلِكَ، وَكُنَّا مَعْشَرَ قُرَيْشٍ نَغْلِبُ النِّسَاءَ، فَلَمَّا قَدِمْنَا عَلَى الأَنْصَارِ إِذَا قَوْمٌ تَغْلِبُهُمْ نِسَاؤُهُمْ، فَطَفِقَ نِسَاؤُنَا يَأْخُذْنَ مِنْ أَدَبِ نِسَاءِ الأَنْصَارِ، فَصَخِبْتُ عَلَى امْرَأَتِي فَرَاجَعَتْنِي فَأَنْكَرْتُ أَنْ تُرَاجِعَنِي قَالَتْ وَلِمَ تُنْكِرُ أَنْ أُرَاجِعَكَ فَوَاللَّهِ إِنَّ أَزْوَاجَ النَّبِيِّ صلى الله عليه وسلم لَيُرَاجِعْنَهُ، وَإِنَّ إِحْدَاهُنَّ لَتَهْجُرُهُ الْيَوْمَ حَتَّى اللَّيْلِ‏.‏ فَأَفْزَعَنِي ذَلِكَ وَقُلْتُ لَهَا وَقَدْ خَابَ مَنْ فَعَلَ ذَلِكَ مِنْهُنَّ‏.‏ ثُمَّ جَمَعْتُ عَلَىَّ ثِيَابِي فَنَزَلْتُ فَدَخَلْتُ عَلَى حَفْصَةَ فَقُلْتُ لَهَا أَىْ حَفْصَةُ أَتُغَاضِبُ إِحْدَاكُنَّ النَّبِيَّ صلى الله عليه وسلم الْيَوْمَ حَتَّى اللَّيْلِ قَالَتْ نَعَمْ‏.‏ فَقُلْتُ قَدْ خِبْتِ وَخَسِرْتِ، أَفَتَأْمَنِينَ أَنْ يَغْضَبَ اللَّهُ لِغَضَبِ رَسُولِهِ صلى الله عليه وسلم فَتَهْلِكِي لاَ تَسْتَكْثِرِي النَّبِيَّ صلى الله عليه وسلم وَلاَ تُرَاجِعِيهِ فِي شَىْءٍ، وَلاَ تَهْجُرِيهِ، وَسَلِينِي مَا بَدَا لَكِ، وَلاَ يَغُرَّنَّكِ أَنْ كَانَتْ جَارَتُكِ أَوْضَأَ مِنْكِ، وَأَحَبَّ إِلَى النَّبِيِّ صلى الله عليه وسلم ـ يُرِيدُ عَائِشَةَ ـ قَالَ عُمَرُ وَكُنَّا قَدْ تَحَدَّثْنَا أَنَّ غَسَّانَ تُنْعِلُ الْخَيْلَ لِغَزْوِنَا، فَنَزَلَ صَاحِبِي الأَنْصَارِيُّ يَوْمَ نَوْبَتِهِ، فَرَجَعَ إِلَيْنَا عِشَاءً فَضَرَبَ بَابِي ضَرْبًا شَدِيدًا وَقَالَ أَثَمَّ هُوَ فَفَزِعْتُ فَخَرَجْتُ إِلَيْهِ، فَقَالَ قَدْ حَدَثَ الْيَوْمَ أَمْرٌ عَظِيمٌ‏.‏ قُلْتُ مَا هُوَ، أَجَاءَ غَسَّانُ قَالَ لاَ بَلْ أَعْظَمُ مِنْ ذَلِكَ وَأَهْوَلُ، طَلَّقَ النَّبِيُّ صلى الله عليه وسلم نِسَاءَهُ‏.‏ فَقُلْتُ خَابَتْ حَفْصَةُ وَخَسِرَتْ، قَدْ كُنْتُ أَظُنُّ هَذَا يُوشِكُ أَنْ يَكُونَ، فَجَمَعْتُ عَلَىَّ ثِيَابِي فَصَلَّيْتُ صَلاَةَ الْفَجْرِ مَعَ النَّبِيِّ صلى الله عليه وسلم فَدَخَلَ النَّبِيُّ صلى الله عليه وسلم مَشْرُبَةً لَهُ، فَاعْتَزَلَ فِيهَا، وَدَخَلْتُ عَلَى حَفْصَةَ فَإِذَا هِيَ تَبْكِي فَقُلْتُ مَا يُبْكِيكِ أَلَمْ أَكُنْ حَذَّرْتُكِ هَذَا أَطَلَّقَكُنَّ النَّبِيُّ صلى الله عليه وسلم قَالَتْ لاَ أَدْرِي هَا هُوَ ذَا مُعْتَزِلٌ فِي الْمَشْرُبَةِ‏.‏ فَخَرَجْتُ فَجِئْتُ إِلَى الْمِنْبَرِ فَإِذَا حَوْلَهُ رَهْطٌ يَبْكِي بَعْضُهُمْ، فَجَلَسْتُ مَعَهُمْ قَلِيلاً ثُمَّ غَلَبَنِي مَا أَجِدُ، فَجِئْتُ الْمَشْرُبَةَ الَّتِي فِيهَا النَّبِيُّ صلى الله عليه وسلم فَقُلْتُ لِغُلاَمٍ لَهُ أَسْوَدَ اسْتَأْذِنْ لِعُمَرَ‏.‏ فَدَخَلَ الْغُلاَمُ فَكَلَّمَ النَّبِيَّ صلى الله عليه وسلم ثُمَّ رَجَعَ فَقَالَ كَلَّمْتُ النَّبِيَّ صلى الله عليه وسلم وَذَكَرْتُكَ لَهُ، فَصَمَتَ‏.‏ فَانْصَرَفْتُ حَتَّى جَلَسْتُ مَعَ الرَّهْطِ الَّذِينَ عِنْدَ الْمِنْبَرِ، ثُمَّ غَلَبَنِي مَا أَجِدُ فَجِئْتُ فَقُلْتُ لِلْغُلاَمِ اسْتَأْذِنْ لِعُمَرَ‏.‏ فَدَخَلَ ثُمَّ رَجَعَ فَقَالَ قَدْ ذَكَرْتُكَ لَهُ فَصَمَتَ‏.‏ فَرَجَعْتُ فَجَلَسْتُ مَعَ الرَّهْطِ الَّذِينَ عِنْدَ الْمِنْبَرِ، ثُمَّ غَلَبَنِي مَا أَجِدُ فَجِئْتُ الْغُلاَمَ فَقُلْتُ اسْتَأْذِنْ لِعُمَرَ‏.‏ فَدَخَلَ ثُمَّ رَجَعَ إِلَىَّ فَقَالَ قَدْ ذَكَرْتُكَ لَهُ فَصَمَتَ‏.‏ فَلَمَّا وَلَّيْتُ مُنْصَرِفًا ـ قَالَ ـ إِذَا الْغُلاَمُ يَدْعُونِي فَقَالَ قَدْ أَذِنَ لَكَ النَّبِيُّ صلى الله عليه وسلم فَدَخَلْتُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَإِذَا هُوَ مُضْطَجِعٌ عَلَى رِمَالِ حَصِيرٍ، لَيْسَ بَيْنَهُ وَبَيْنَهُ فِرَاشٌ، قَدْ أَثَّرَ الرِّمَالُ بِجَنْبِهِ مُتَّكِئًا عَلَى وِسَادَةٍ مِنْ أَدَمٍ حَشْوُهَا لِيفٌ، فَسَلَّمْتُ عَلَيْهِ ثُمَّ قُلْتُ وَأَنَا قَائِمٌ يَا رَسُولَ اللَّهِ أَطَلَّقْتَ نِسَاءَكَ‏.‏ فَرَفَعَ إِلَىَّ بَصَرَهُ فَقَالَ ‏\"‏ لاَ ‏\"‏‏.‏ فَقُلْتُ اللَّهُ أَكْبَرُ‏.‏ ثُمَّ قُلْتُ وَأَنَا قَائِمٌ أَسْتَأْنِسُ يَا رَسُولَ اللَّهِ لَوْ رَأَيْتَنِي، وَكُنَّا مَعْشَرَ قُرَيْشٍ نَغْلِبُ النِّسَاءَ فَلَمَّا قَدِمْنَا الْمَدِينَةَ إِذَا قَوْمٌ تَغْلِبُهُمْ نِسَاؤُهُمْ، فَتَبَسَّمَ النَّبِيُّ صلى الله عليه وسلم ثُمَّ قُلْتُ يَا رَسُولَ اللَّهِ لَوْ رَأَيْتَنِي وَدَخَلْتُ عَلَى حَفْصَةَ فَقُلْتُ لَهَا لاَ يَغُرَّنَّكِ أَنْ كَانَتْ جَارَتُكِ أَوْضَأَ مِنْكِ وَأَحَبَّ إِلَى النَّبِيِّ صلى الله عليه وسلم يُرِيدُ عَائِشَةَ فَتَبَسَّمَ النَّبِيُّ صلى الله عليه وسلم تَبَسُّمَةً أُخْرَى، فَجَلَسْتُ حِينَ رَأَيْتُهُ تَبَسَّمَ، فَرَفَعْتُ بَصَرِي فِي بَيْتِهِ، فَوَاللَّهِ مَا رَأَيْتُ فِي بَيْتِهِ شَيْئًا يَرُدُّ الْبَصَرَ غَيْرَ أَهَبَةٍ ثَلاَثَةٍ، فَقُلْتُ يَا رَسُولَ اللَّهِ ادْعُ اللَّهَ فَلْيُوَسِّعْ عَلَى أُمَّتِكَ، فَإِنَّ فَارِسًا وَالرُّومَ قَدْ وُسِّعَ عَلَيْهِمْ، وَأُعْطُوا الدُّنْيَا وَهُمْ لاَ يَعْبُدُونَ اللَّهَ‏.‏ فَجَلَسَ النَّبِيُّ صلى الله عليه وسلم وَكَانَ مُتَّكِئًا‏.‏ فَقَالَ ‏\"‏ أَوَفِي هَذَا أَنْتَ يَا ابْنَ الْخَطَّابِ، إِنَّ أُولَئِكَ قَوْمٌ عُجِّلُوا طَيِّبَاتِهِمْ فِي الْحَيَاةِ الدُّنْيَا ‏\"‏‏.‏ فَقُلْتُ يَا رَسُولَ اللَّهِ اسْتَغْفِرْ لِي‏.‏ فَاعْتَزَلَ النَّبِيُّ صلى الله عليه وسلم نِسَاءَهُ مِنْ أَجْلِ ذَلِكَ الْحَدِيثِ حِينَ أَفْشَتْهُ حَفْصَةُ إِلَى عَائِشَةَ تِسْعًا وَعِشْرِينَ لَيْلَةً وَكَانَ قَالَ ‏\"‏ مَا أَنَا بِدَاخِلٍ عَلَيْهِنَّ شَهْرًا ‏\"‏‏.‏ مِنْ شِدَّةِ مَوْجِدَتِهِ عَلَيْهِنَّ حِينَ عَاتَبَهُ اللَّهُ، فَلَمَّا مَضَتْ تِسْعٌ وَعِشْرُونَ لَيْلَةً دَخَلَ عَلَى عَائِشَةَ فَبَدَأَ بِهَا فَقَالَتْ لَهُ عَائِشَةُ يَا رَسُولَ اللَّهِ إِنَّكَ كُنْتَ قَدْ أَقْسَمْتَ أَنْ لاَ تَدْخُلَ عَلَيْنَا شَهْرًا، وَإِنَّمَا أَصْبَحْتَ مِنْ تِسْعٍ وَعِشْرِينَ لَيْلَةً أَعُدُّهَا عَدًّا‏.‏ فَقَالَ ‏\"‏ الشَّهْرُ تِسْعٌ وَعِشْرُونَ ‏\"‏‏.‏ فَكَانَ ذَلِكَ الشَّهْرُ تِسْعًا وَعِشْرِينَ لَيْلَةً‏.‏ قَالَتْ عَائِشَةُ ثُمَّ أَنْزَلَ اللَّهُ تَعَالَى آيَةَ التَّخَيُّرِ فَبَدَأَ بِي أَوَّلَ امْرَأَةٍ مِنْ نِسَائِهِ فَاخْتَرْتُهُ، ثُمَّ خَيَّرَ نِسَاءَهُ كُلَّهُنَّ فَقُلْنَ مِثْلَ مَا قَالَتْ عَائِشَةُ‏.‏","english":{"narrator":"Narrated Ibn `Abbas:","text":"I had been eager to ask `Umar bin Al-Khattab about the two ladies from among the wives of the \nProphet regarding whom Allah said 'If you two (wives of the Prophet (ﷺ) namely Aisha and Hafsa) turn in \nrepentance to Allah, your hearts are indeed so inclined (to oppose what the Prophet (ﷺ) likes). (66.4) till \n`Umar performed the Hajj and I too, performed the Hajj along with him. (On the way) `Umar went \naside to answer the call of nature, and I also went aside along with him carrying a tumbler full of \nwater, and when `Umar had finished answering the call of nature, I poured water over his hands and \nhe performed the ablution. Then I said to him, \"O chief of the Believers! Who were the two ladies \nfrom among the wives of the Prophet (ﷺ) regarding whom Allah said: 'If you two (wives of the Prophet) \nturn in repentance to Allah your hearts are indeed so inclined (to oppose what the Prophet (ﷺ) likes)?\" \n(66.4) \nHe said, \"I am astonished at your question, O Ibn `Abbas. They were `Aisha and Hafsa.\" Then `Umar \nwent on narrating the Hadith and said, \"I and an Ansari neighbor of mine from Bani Umaiyya bin Zaid \nwho used to live in `Awali-al-Medina, used to visit the Prophet (ﷺ) in turn. He used to go one day and I \nanother day. When I went, I would bring him the news of what had happened that day regarding the \nDivine Inspiration and other things, and when he went, he used to do the same for me. We, the people \nof Quraish used to have the upper hand over our wives, but when we came to the Ansar, we found that \ntheir women had the upper hand over their men, so our women also started learning the ways of the \nAnsari women. I shouted at my wife and she retorted against me and I disliked that she should answer \nme back. \nShe said to me, 'Why are you so surprised at my answering you back? By Allah, the wives of the \nProphet answer him back and some of them may leave (does not speak to) him throughout the day till \nthe night.' The (talk) scared me and I said to her, 'Whoever has done so will be ruined!' Then I \nproceeded after dressing myself, and entered upon Hafsa and said to her, 'Does anyone of you keep \nthe Prophet (ﷺ) angry till night?' She said, 'Yes.' I said, 'You are a ruined losing person! Don't you fear \nthat Allah may get angry for the anger of Allah's Messenger (ﷺ) and thus you will be ruined? So do not ask \nmore from the Prophet (ﷺ) and do not answer him back and do not give up talking to him. Ask me \nwhatever you need and do not be tempted to imitate your neighbor (i.e., `Aisha) in her manners for \nshe is more charming than you and more beloved to the Prophet (ﷺ) .\" `Umar added,\"At that time a talk \nwas circulating among us that (the tribe of) Ghassan were preparing their horses to invade us. \nMy Ansari companion, on the day of his turn, went (to the town) and returned to us at night and \nknocked at my door violently and asked if I was there. I became horrified and came out to him. He \nsaid, 'Today a great thing has happened.' I asked, 'What is it? Have (the people of) Ghassan come?' He \nsaid, 'No, but (What has happened) is greater and more horrifying than that: Allah's Messenger (ﷺ); has \ndivorced his wives. `Umar added, \"The Prophet (ﷺ) kept away from his wives and I said \"Hafsa is a \nruined loser.' I had already thought that most probably this (divorce) would happen in the near future. \nSo I dressed myself and offered the morning prayer with the Prophet (ﷺ) and then the Prophet; entered an \nupper room and stayed there in seclusion. I entered upon Hafsa and saw her weeping. I asked, 'What \nmakes you weep? Did I not warn you about that? Did the Prophet (ﷺ) divorce you all?' She said, 'I do not \nknow. There he is retired alone in the upper room.' I came out and sat near the pulpit and saw a group \nof people sitting around it and some of them were weeping. I sat with them for a while but could not \nendure the situation, so I went to the upper room where the Prophet; was and said to a black slave of \nhis, 'Will you get the permission (of the Prophet (ﷺ) ) for `Umar (to enter)?' The slave went in, talked to \nthe Prophet (ﷺ) about it and then returned saying, 'I have spoken to the Prophet (ﷺ) and mentioned you but he \nkept quiet.' Then I returned and sat with the group of people sitting near the pulpit. but I could not \nbear the situation and once again I said to the slave, 'Will you get the permission for `Umar?' He went \nin and returned saying, 'I mentioned you to him but he kept quiet.' \nSo I returned again and sat with the group of people sitting near the pulpit, but I could not bear the \nsituation, and so I went to the slave and said, 'Will you get the permission for `Umar?' He went in and \nreturned to me saying, 'I mentioned you to him but he kept quiet.' When I was leaving, behold! The \nslave called me, saying, 'The Prophet (ﷺ) has given you permission.' \nThen I entered upon Allah's Messenger (ﷺ) and saw him Lying on a bed made of stalks of date palm leaves \nand there was no bedding between it and him. The stalks left marks on his side and he was leaning on \na leather pillow stuffed with date-palm fires. I greeted him and while still standing I said, 'O Allah's \nApostle! Have you divorced your wives?' He looked at me and said, 'No.' I said, 'Allah Akbar!' And \nthen, while still standing, I said chatting, 'Will you heed what I say, O Allah's Messenger (ﷺ)? We, the people \nof Quraish used to have power over our women, but when we arrived at Medina we found that the \nmen (here) were overpowered by their women.' The Prophet (ﷺ) smiled and then I said to him, 'Will you \nheed what I say, O Allah's Messenger (ﷺ)? \nI entered upon Hafsa and said to her, \"Do not be tempted to imitate your companion (`Aisha), for she \nis more charming than you and more beloved to the Prophet.' \" The Prophet (ﷺ) smiled for a second time. \nWhen I saw him smiling, I sat down. Then I looked around his house, and by Allah, I could not see \nanything of importance in his house except three hides, so I said, 'O Allah's Messenger (ﷺ)! Invoke Allah to \nmake your followers rich, for the Persians and the Romans have been made prosperous and they have \nbeen given (the pleasures of the world), although they do not worship Allah.' \nThereupon the Prophet (ﷺ) sat up as he was reclining. and said, 'Are you of such an opinion, O the son of \nAl-Khattab? These are the people who have received the rewards for their good deeds in this world.' I \nsaid, 'O Allah's Messenger (ﷺ)! Ask Allah to forgive me.' Then the Prophet (ﷺ) kept away from his wives for \ntwenty-nine days because of the story which Hafsa had disclosed to `Aisha. \nThe Prophet (ﷺ) had said, 'I will not enter upon them (my wives) for one month,' because of his anger \ntowards them, when Allah had admonished him. So, when twenty nine days had passed, the Prophet (ﷺ) \nfirst entered upon `Aisha. `Aisha said to him, 'O Allah's Messenger (ﷺ)! You had sworn that you would not \nenter upon us for one month, but now only twenty-nine days have passed, for I have been counting \nthem one by one.' The Prophet (ﷺ) said, 'The (present) month is of twenty nine days.' `Aisha added, 'Then \nAllah revealed the Verses of the option. (2) And out of all his-wives he asked me first, and I chose \nhim.' Then he gave option to his other wives and they said what `Aisha had said . \" (1) The Prophet, ' \nhad decided to abstain from eating a certain kind of food because of a certain event, so Allah blamed \nhim for doing so. Some of his wives were the cause of him taking that decision, therefore he deserted \nthem for one month. See Qur'an: (66.4)"}},{"id":126,"idInBook":126,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم ‏\n\"‏ لاَ تَصُومُ الْمَرْأَةُ وَبَعْلُهَا شَاهِدٌ إِلاَّ بِإِذْنِهِ ‏\"‏‏.‏","english":{"narrator":"Narrated Abu Huraira:","text":"The Prophet (ﷺ) said, \"A woman should not fast (optional fasts) except with her husband's permission if \nhe is at home (staying with her)."}},{"id":127,"idInBook":127,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ شُعْبَةَ، عَنْ سُلَيْمَانَ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ إِذَا دَعَا الرَّجُلُ امْرَأَتَهُ إِلَى فِرَاشِهِ فَأَبَتْ أَنْ تَجِيءَ لَعَنَتْهَا الْمَلاَئِكَةُ حَتَّى تُصْبِحَ ‏\"‏‏.‏","english":{"narrator":"Narrated Abu Huraira:","text":"The Prophet (ﷺ) said, \"If a man Invites his wife to sleep with him and she refuses to come to him, then the \nangels send their curses on her till morning.\""}},{"id":128,"idInBook":128,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَرْعَرَةَ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ زُرَارَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ إِذَا بَاتَتِ الْمَرْأَةُ مُهَاجِرَةً فِرَاشَ زَوْجِهَا لَعَنَتْهَا الْمَلاَئِكَةُ حَتَّى تَرْجِعَ ‏\"‏‏.‏","english":{"narrator":"Narrated Abu Huraira:","text":"The Prophet (ﷺ) said, \"If a woman spends the night deserting her husband's bed (does not sleep with him), \nthen the angels send their curses on her till she comes back (to her husband)."}},{"id":129,"idInBook":129,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، رضى الله عنه أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَحِلُّ لِلْمَرْأَةِ أَنْ تَصُومَ وَزَوْجُهَا شَاهِدٌ إِلاَّ بِإِذْنِهِ، وَلاَ تَأْذَنَ فِي بَيْتِهِ إِلاَّ بِإِذْنِهِ، وَمَا أَنْفَقَتْ مِنْ نَفَقَةٍ عَنْ غَيْرِ أَمْرِهِ فَإِنَّهُ يُؤَدَّى إِلَيْهِ شَطْرُهُ ‏\"‏‏.‏ وَرَوَاهُ أَبُو الزِّنَادِ أَيْضًا عَنْ مُوسَى عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ فِي الصَّوْمِ‏.‏","english":{"narrator":"Narrated Abu Huraira:","text":"Allah's Messenger (ﷺ) said, \"It is not lawful for a lady to fast (Nawafil) without the permission of her \nhusband when he is at home; and she should not allow anyone to enter his house except with his \npermission; and if she spends of his wealth (on charitable purposes) without being ordered by him, he \nwill get half of the reward.\""}},{"id":130,"idInBook":130,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا إِسْمَاعِيلُ، أَخْبَرَنَا التَّيْمِيُّ، عَنْ أَبِي عُثْمَانَ، عَنْ أُسَامَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ قُمْتُ عَلَى باب الْجَنَّةِ فَكَانَ عَامَّةَ مَنْ دَخَلَهَا الْمَسَاكِينُ، وَأَصْحَابُ الْجَدِّ مَحْبُوسُونَ، غَيْرَ أَنَّ أَصْحَابَ النَّارِ قَدْ أُمِرَ بِهِمْ إِلَى النَّارِ، وَقُمْتُ عَلَى باب النَّارِ فَإِذَا عَامَّةُ مَنْ دَخَلَهَا النِّسَاءُ ‏\"‏‏.‏","english":{"narrator":"Narrated Usama:","text":"The Prophet (ﷺ) said, \"I stood at the gate of Paradise and saw that the majority of the people who entered \nit were the poor, while the wealthy were stopped at the gate (for the accounts). But the companions of \nthe Fire were ordered to be taken to the Fire. Then I stood at the gate of the Fire and saw that the \nmajority of those who entered it were women.\""}},{"id":131,"idInBook":131,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، أَنَّهُ قَالَ خَسَفَتِ الشَّمْسُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم وَالنَّاسُ مَعَهُ، فَقَامَ قِيَامًا طَوِيلاً نَحْوًا مِنْ سُورَةِ الْبَقَرَةِ، ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً، ثُمَّ رَفَعَ فَقَامَ قِيَامًا طَوِيلاً وَهْوَ دُونَ الْقِيَامِ الأَوَّلِ، ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً وَهْوَ دُونَ الرُّكُوعِ الأَوَّلِ، ثُمَّ سَجَدَ، ثُمَّ قَامَ فَقَامَ قِيَامًا طَوِيلاً وَهْوَ دُونَ الْقِيَامِ الأَوَّلِ، ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً وَهْوَ دُونَ الرُّكُوعِ الأَوَّلِ، ثُمَّ رَفَعَ فَقَامَ قِيَامًا طَوِيلاً وَهْوَ دُونَ الْقِيَامِ الأَوَّلِ، ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً وَهْوَ دُونَ الرُّكُوعِ الأَوَّلِ، ثُمَّ رَفَعَ ثُمَّ سَجَدَ، ثُمَّ انْصَرَفَ، وَقَدْ تَجَلَّتِ الشَّمْسُ، فَقَالَ ‏\"‏ إِنَّ الشَّمْسَ وَالْقَمَرَ آيَتَانِ مِنْ آيَاتِ اللَّهِ لاَ يَخْسِفَانِ لِمَوْتِ أَحَدٍ وَلاَ لِحَيَاتِهِ، فَإِذَا رَأَيْتُمْ ذَلِكَ فَاذْكُرُوا اللَّهَ ‏\"‏‏.‏ قَالُوا يَا رَسُولَ اللَّهِ رَأَيْنَاكَ تَنَاوَلْتَ شَيْئًا فِي مَقَامِكَ هَذَا، ثُمَّ رَأَيْنَاكَ تَكَعْكَعْتَ‏.‏ فَقَالَ ‏\"‏ إِنِّي رَأَيْتُ الْجَنَّةَ ـ أَوْ أُرِيتُ الْجَنَّةَ ـ فَتَنَاوَلْتُ مِنْهَا عُنْقُودًا وَلَوْ أَخَذْتُهُ لأَكَلْتُمْ مِنْهُ مَا بَقِيَتِ الدُّنْيَا، وَرَأَيْتُ النَّارَ فَلَمْ أَرَ كَالْيَوْمِ مَنْظَرًا قَطُّ وَرَأَيْتُ أَكْثَرَ أَهْلِهَا النِّسَاءَ ‏\"‏‏.‏ قَالُوا لِمَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ بِكُفْرِهِنَّ ‏\"‏‏.‏ قِيلَ يَكْفُرْنَ بِاللَّهِ قَالَ ‏\"‏ يَكْفُرْنَ الْعَشِيرَ، وَيَكْفُرْنَ الإِحْسَانَ، وَلَوْ أَحْسَنْتَ إِلَى إِحْدَاهُنَّ الدَّهْرَ، ثُمَّ رَأَتْ مِنْكَ شَيْئًا قَالَتْ مَا رَأَيْتُ مِنْكَ خَيْرًا قَطُّ ‏\"‏‏.‏","english":{"narrator":"Narrated `Abdullah bin `Abbas:","text":"During the lifetime of Allah's Messenger (ﷺ), the sun eclipsed. Allah's Messenger (ﷺ) offered the prayer of (the) \neclipse) and so did the people along with him. He performed a long Qiyam (standing posture) during \nwhich Surat-al-Baqara could have been recited; then he performed a pro-longed bowing, then raised \nhis head and stood for a long time which was slightly less than that of the first Qiyam (and recited \nQur'an). Then he performed a prolonged bowing again but the period was shorter than the period of \nthe first bowing, then he stood up and then prostrated. Again he stood up, but this time the period of \nstanding was less than the first standing. Then he performed a prolonged bowing but of a lesser \nduration than the first, then he stood up again for a long time but for a lesser duration than the first. \nThen he performed a prolonged bowing but of lesser duration than the first, and then he again stood \nup, and then prostrated and then finished his prayer. By then the sun eclipse had cleared. \nThe Prophet (ﷺ) then said, \"The sun and the moon are two signs among the signs of Allah, and they do not \neclipse because of the death or birth of someone, so when you observe the eclipse, remember Allah \n(offer the eclipse prayer).\" They (the people) said, \"O Allah's Messenger (ﷺ)! We saw you stretching your \nhand to take something at this place of yours, then we saw you stepping backward.\" He said, \"I saw \nParadise (or Paradise was shown to me), and I stretched my hand to pluck a bunch (of grapes), and \nhad I plucked it, you would have eaten of it as long as this world exists. Then I saw the (Hell) Fire, \nand I have never before, seen such a horrible sight as that, and I saw that the majority of its dwellers \nwere women.\" The people asked, \"O Allah's Messenger (ﷺ)! What is the reason for that?\" He replied, \n\"Because of their ungratefulness.\" It was said. \"Do they disbelieve in Allah (are they ungrateful to \nAllah)?\" He replied, \"They are not thankful to their husbands and are ungrateful for the favors done to \nthem. Even if you do good to one of them all your life, when she seems some harshness from you, she \nwill say, \"I have never seen any good from you.' \""}},{"id":132,"idInBook":132,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا عُثْمَانُ بْنُ الْهَيْثَمِ، حَدَّثَنَا عَوْفٌ، عَنْ أَبِي رَجَاءٍ، عَنْ عِمْرَانَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ اطَّلَعْتُ فِي الْجَنَّةِ فَرَأَيْتُ أَكْثَرَ أَهْلِهَا الْفُقَرَاءَ، وَاطَّلَعْتُ فِي النَّارِ، فَرَأَيْتُ أَكْثَرَ أَهْلِهَا النِّسَاءَ ‏\"‏‏.‏ تَابَعَهُ أَيُّوبُ وَسَلْمُ بْنُ زَرِيرٍ‏.‏","english":{"narrator":"Narrated `Imran:","text":"The Prophet (ﷺ) said, \"I looked at Paradise and saw that the majority of its residents were the poor; and I \nlooked at the (Hell) Fire and saw that the majority of its residents were women.\""}},{"id":133,"idInBook":133,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا الأَوْزَاعِيُّ، قَالَ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ، قَالَ حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَمْرِو بْنِ الْعَاصِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَا عَبْدَ اللَّهِ أَلَمْ أُخْبَرْ أَنَّكَ تَصُومُ النَّهَارَ وَتَقُومُ اللَّيْلَ ‏\"‏‏.‏ قُلْتُ بَلَى يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ فَلاَ تَفْعَلْ، صُمْ وَأَفْطِرْ، وَقُمْ وَنَمْ، فَإِنَّ لِجَسَدِكَ عَلَيْكَ حَقًّا، وَإِنَّ لِعَيْنِكَ عَلَيْكَ حَقًّا، وَإِنَّ لِزَوْجِكَ عَلَيْكَ حَقًّا ‏\"‏‏.‏","english":{"narrator":"Narrated `Abdullah bin `Amr bin Al-`As:","text":"Allah's Messenger (ﷺ) said, \"O `Abdullah! Have I not been formed that you fast all the day and stand in \nprayer all night?\" I said, \"Yes, O Allah's Messenger (ﷺ)!\" He said, \"Do not do that! Observe the fast \nsometimes and also leave them (the fast) at other times; stand up for the prayer at night and also sleep \nat night. Your body has a right over you, your eyes have a right over you and your wife has a right \nover you.\""}},{"id":134,"idInBook":134,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا مُوسَى بْنُ عُقْبَةَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ كُلُّكُمْ رَاعٍ، وَكُلُّكُمْ مَسْئُولٌ عَنْ رَعِيَّتِهِ، وَالأَمِيرُ رَاعٍ، وَالرَّجُلُ رَاعٍ عَلَى أَهْلِ بَيْتِهِ، وَالْمَرْأَةُ رَاعِيَةٌ عَلَى بَيْتِ زَوْجِهَا وَوَلَدِهِ، فَكُلُّكُمْ رَاعٍ وَكُلُّكُمْ مَسْئُولٌ عَنْ رَعِيَّتِهِ ‏\"‏‏.‏","english":{"narrator":"Narrated Ibn `Umar:","text":"The Prophet (ﷺ) said, \"All of you are guardians and are responsible for your wards. The ruler is a guardian \nand the man is a guardian of his family; the lady is a guardian and is responsible for her husband's \nhouse and his offspring; and so all of you are guardians and are responsible for your wards.\""}},{"id":135,"idInBook":135,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، حَدَّثَنَا سُلَيْمَانُ، قَالَ حَدَّثَنِي حُمَيْدٌ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ آلَى رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ نِسَائِهِ شَهْرًا وَقَعَدَ فِي مَشْرُبَةٍ لَهُ فَنَزَلَ لِتِسْعٍ وَعِشْرِينَ فَقِيلَ يَا رَسُولَ اللَّهِ إِنَّكَ آلَيْتَ عَلَى شَهْرٍ‏.‏ قَالَ ‏\n\"‏ إِنَّ الشَّهْرَ تِسْعٌ وَعِشْرُونَ ‏\"‏‏.‏","english":{"narrator":"Narrated Anas:","text":"Allah's Messenger (ﷺ) took an oath that he would not visit his wives for one month, and he sat in an upper \nroom belonging to him. Then, on the twenty ninth day he came down. It was said, \"O Allah's Messenger (ﷺ)! \nYou had taken an oath not to visit your wives for one month.\" He said, \"The (present) month is of \ntwenty-nine days.\""}},{"id":136,"idInBook":136,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ،‏.‏ وَحَدَّثَنِي مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي يَحْيَى بْنُ عَبْدِ اللَّهِ بْنِ صَيْفِيٍّ، أَنَّ عِكْرِمَةَ بْنَ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ، أَخْبَرَهُ أَنَّ أُمَّ سَلَمَةَ أَخْبَرَتْهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم حَلَفَ لاَ يَدْخُلُ عَلَى بَعْضِ أَهْلِهِ شَهْرًا، فَلَمَّا مَضَى تِسْعَةٌ وَعِشْرُونَ يَوْمًا غَدَا عَلَيْهِنَّ أَوْ رَاحَ فَقِيلَ لَهُ يَا نَبِيَّ اللَّهِ حَلَفْتَ أَنْ لاَ تَدْخُلَ عَلَيْهِنَّ شَهْرًا قَالَ ‏\n\"‏ إِنَّ الشَّهْرَ يَكُونُ تِسْعَةً وَعِشْرِينَ يَوْمًا ‏\"‏‏.‏","english":{"narrator":"Narrated Um Salama:","text":"The Prophet (ﷺ) took an oath that he would not enter upon some of his wives for one month. But when \ntwenty nine days had elapsed, he went to them in the morning or evening. It was said to him, \"O \nAllah's Prophet! You had taken an oath that you would not enter upon them for one month.\" He \nreplied, \"The month can be of twenty nine days.\""}},{"id":137,"idInBook":137,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ، حَدَّثَنَا أَبُو يَعْفُورٍ، قَالَ تَذَاكَرْنَا عِنْدَ أَبِي الضُّحَى فَقَالَ حَدَّثَنَا ابْنُ عَبَّاسٍ، قَالَ أَصْبَحْنَا يَوْمًا وَنِسَاءُ النَّبِيِّ صلى الله عليه وسلم يَبْكِينَ، عِنْدَ كُلِّ امْرَأَةٍ مِنْهُنَّ أَهْلُهَا، فَخَرَجْتُ إِلَى الْمَسْجِدِ، فَإِذَا هُوَ مَلآنُ مِنَ النَّاسِ فَجَاءَ عُمَرُ بْنُ الْخَطَّابِ فَصَعِدَ إِلَى النَّبِيِّ صلى الله عليه وسلم وَهْوَ فِي غُرْفَةٍ لَهُ، فَسَلَّمَ فَلَمْ يُجِبْهُ أَحَدٌ، ثُمَّ سَلَّمَ فَلَمْ يُجِبْهُ أَحَدٌ، ثُمَّ سَلَّمَ فَلَمْ يُجِبْهُ أَحَدٌ، فَنَادَاهُ فَدَخَلَ عَلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ أَطَلَّقْتَ نِسَاءَكَ فَقَالَ ‏\n\"‏ لاَ وَلَكِنْ آلَيْتُ مِنْهُنَّ شَهْرًا ‏\"‏‏.‏ فَمَكَثَ تِسْعًا وَعِشْرِينَ، ثُمَّ دَخَلَ عَلَى نِسَائِهِ‏.‏","english":{"narrator":"Narrated Ibn `Abbas:","text":"One morning we saw the wives of the Prophet (ﷺ) weeping, and everyone of them had her family with \nher, I went to the mosque and found that it was crowded with people. Then `Umar bin Al-Khattab \ncame and went up to the Prophet (ﷺ) who was in his upper room. He greeted him but nobody answered. \nHe greeted again, but nobody answered. Then the gatekeeper called him and he entered upon the \nProphet, and asked, \"Have you divorced your wives?\" The Prophet, said, \"No, but I have taken an oath \nnot to go to them for one month.\" So the Prophet (ﷺ) stayed away (from his wives) for twenty nine days \nand then entered upon them."}},{"id":138,"idInBook":138,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ زَمْعَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ لاَ يَجْلِدُ أَحَدُكُمُ امْرَأَتَهُ جَلْدَ الْعَبْدِ، ثُمَّ يُجَامِعُهَا فِي آخِرِ الْيَوْمِ ‏\"‏‏.‏","english":{"narrator":"Narrated `Abdullah bin Zam`a:","text":"The Prophet (ﷺ) said, \"None of you should flog his wife as he flogs a slave and then have sexual \nintercourse with her in the last part of the day.\""}},{"id":139,"idInBook":139,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا خَلاَّدُ بْنُ يَحْيَى، حَدَّثَنَا إِبْرَاهِيمُ بْنُ نَافِعٍ، عَنِ الْحَسَنِ ـ هُوَ ابْنُ مُسْلِمٍ ـ عَنْ صَفِيَّةَ، عَنْ عَائِشَةَ، أَنَّ امْرَأَةً، مِنَ الأَنْصَارِ زَوَّجَتِ ابْنَتَهَا فَتَمَعَّطَ شَعَرُ رَأْسِهَا، فَجَاءَتْ إِلَى النَّبِيِّ صلى الله عليه وسلم فَذَكَرَتْ ذَلِكَ لَهُ، فَقَالَتْ إِنَّ زَوْجَهَا أَمَرَنِي أَنْ أَصِلَ فِي شَعَرِهَا‏.‏ فَقَالَ ‏\n\"‏ لاَ إِنَّهُ قَدْ لُعِنَ الْمُوصِلاَتُ ‏\"‏‏.‏","english":{"narrator":"Narrated `Aisha:","text":"An Ansari woman gave her daughter in marriage and the hair of the latter started falling out. The \nAnsari women came to the Prophet (ﷺ) and mentioned that to him and said, \"Her (my daughter's) husband \nsuggested that I should let her wear false hair.\" The Prophet (ﷺ) said, \"No, (don't do that) for Allah sends \nHis curses upon such ladies who lengthen their hair artificially.\""}},{"id":140,"idInBook":140,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا ابْنُ سَلاَمٍ، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ ‏{‏وَإِنِ امْرَأَةٌ خَافَتْ مِنْ بَعْلِهَا نُشُوزًا أَوْ إِعْرَاضًا‏}‏ قَالَتْ هِيَ الْمَرْأَةُ تَكُونُ عِنْدَ الرَّجُلِ، لاَ يَسْتَكْثِرُ مِنْهَا فَيُرِيدُ طَلاَقَهَا، وَيَتَزَوَّجُ غَيْرَهَا، تَقُولُ لَهُ أَمْسِكْنِي وَلاَ تُطَلِّقْنِي، ثُمَّ تَزَوَّجْ غَيْرِي، فَأَنْتَ فِي حِلٍّ مِنَ النَّفَقَةِ عَلَىَّ وَالْقِسْمَةِ لِي، فَذَلِكَ قَوْلُهُ تَعَالَى ‏{‏فَلاَ جُنَاحَ عَلَيْهِمَا أَنْ يَصَّالَحَا بَيْنَهُمَا صُلْحًا وَالصُّلْحُ خَيْرٌ‏}‏","english":{"narrator":"Narrated Aisha:","text":"regarding the Verse: 'If a wife fears cruelty or desertion on her husband's part ...') (4.128) It concerns \nthe woman whose husband does not want to keep her with him any longer, but wants to divorce her \nand marry some other lady, so she says to him: 'Keep me and do not divorce me, and then marry \nanother woman, and you may neither spend on me, nor sleep with me.' This is indicated by the \nStatement of Allah: 'There is no blame on them if they arrange an amicable settlement between them \nboth, and (such) settlement is better.\" (4.128)"}},{"id":141,"idInBook":141,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنِ ابْنِ جُرَيْجٍ، عَنْ عَطَاءٍ، عَنْ جَابِرٍ، قَالَ كُنَّا نَعْزِلُ عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم‏.‏","english":{"narrator":"Narrated Jabir:","text":"We used to practice coitus interrupt us during the lifetime of Allah's Messenger (ﷺ) ."}},{"id":142,"idInBook":142,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ عَمْرٌو أَخْبَرَنِي عَطَاءٌ، سَمِعَ جَابِرًا، رضى الله عنه قَالَ كُنَّا نَعْزِلُ وَالْقُرْآنُ يَنْزِلُ‏.‏ وَعَنْ عَمْرٍو، عَنْ عَطَاءٍ، عَنْ جَابِرٍ، قَالَ كُنَّا نَعْزِلُ عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم وَالْقُرْآنُ يَنْزِلُ‏.‏","english":{"narrator":"Narrated Jabir:","text":"We used to practice coitus interrupt us while the Qur'an was being revealed. Jabir added: We used to \npractice coitus interrupt us during the lifetime of Allah's Messenger (ﷺ) while the Qur'an was being \nRevealed."}},{"id":143,"idInBook":143,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَسْمَاءَ، حَدَّثَنَا جُوَيْرِيَةُ، عَنْ مَالِكِ بْنِ أَنَسٍ، عَنِ الزُّهْرِيِّ، عَنِ ابْنِ مُحَيْرِيزٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ أَصَبْنَا سَبْيًا فَكُنَّا نَعْزِلُ فَسَأَلْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\n\"‏ أَوَإِنَّكُمْ لَتَفْعَلُونَ قَالَهَا ثَلاَثًا مَا مِنْ نَسَمَةٍ كَائِنَةٍ إِلَى يَوْمِ الْقِيَامَةِ إِلاَّ هِيَ كَائِنَةٌ ‏\"‏‏.‏","english":{"narrator":"Narrated Abu Sa`id Al-Khudri:","text":"We got female captives in the war booty and we used to do coitus interruptus with them. So we asked \nAllah's Messenger (ﷺ) about it and he said, \"Do you really do that?\" repeating the question thrice, \"There is \nno soul that is destined to exist but will come into existence, till the Day of Resurrection.\""}},{"id":144,"idInBook":144,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ أَيْمَنَ، قَالَ حَدَّثَنِي ابْنُ أَبِي مُلَيْكَةَ، عَنِ الْقَاسِمِ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ إِذَا خَرَجَ أَقْرَعَ بَيْنَ نِسَائِهِ، فَطَارَتِ الْقُرْعَةُ لِعَائِشَةَ وَحَفْصَةَ، وَكَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا كَانَ بِاللَّيْلِ سَارَ مَعَ عَائِشَةَ يَتَحَدَّثُ، فَقَالَتْ حَفْصَةُ أَلاَ تَرْكَبِينَ اللَّيْلَةَ بَعِيرِي وَأَرْكَبُ بَعِيرَكِ تَنْظُرِينَ وَأَنْظُرُ، فَقَالَتْ بَلَى فَرَكِبَتْ فَجَاءَ النَّبِيُّ صلى الله عليه وسلم إِلَى جَمَلِ عَائِشَةَ وَعَلَيْهِ حَفْصَةُ فَسَلَّمَ عَلَيْهَا ثُمَّ سَارَ حَتَّى نَزَلُوا وَافْتَقَدَتْهُ عَائِشَةُ، فَلَمَّا نَزَلُوا جَعَلَتْ رِجْلَيْهَا بَيْنَ الإِذْخِرِ وَتَقُولُ يَا رَبِّ سَلِّطْ عَلَىَّ عَقْرَبًا أَوْ حَيَّةً تَلْدَغُنِي، وَلاَ أَسْتَطِيعُ أَنْ أَقُولَ لَهُ شَيْئًا‏.‏","english":{"narrator":"Narrated al-Qasim:","text":"Aisha said that whenever the Prophet (ﷺ) intended to go on a journey, he drew lots among his wives (so as \nto take one of them along with him). During one of his journeys the lot fell on `Aisha and Hafsa. \nWhen night fell the Prophet (ﷺ) would ride beside `Aisha and talk with her. One night Hafsa said to \n`Aisha, \"Won't you ride my camel tonight and I ride yours, so that you may see (me) and I see (you) \n(in new situation)?\" `Aisha said, \"Yes, (I agree.)\" So `Aisha rode, and then the Prophet (ﷺ) came towards \n`Aisha's camel on which Hafsa was riding. He greeted Hafsa and then proceeded (beside her) till they \ndismounted (on the way). `Aisha missed him, and so, when they dismounted, she put her legs in the \nIdhkhir and said, \"O Lord (Allah)! Send a scorpion or a snake to bite me for I am not to blame him \n(the Prophet (ﷺ) )."}},{"id":145,"idInBook":145,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيلُ، حَدَّثَنَا زُهَيْرٌ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ سَوْدَةَ بِنْتَ زَمْعَةَ، وَهَبَتْ، يَوْمَهَا لِعَائِشَةَ، وَكَانَ النَّبِيُّ صلى الله عليه وسلم يَقْسِمُ لِعَائِشَةَ بِيَوْمِهَا وَيَوْمِ سَوْدَةَ‏.‏","english":{"narrator":"Narrated `Aisha:","text":"Sauda bint Zam`a gave up her turn to me (`Aisha), and so the Prophet (ﷺ) used to give me (`Aisha) both \nmy day and the day of Sauda."}},{"id":146,"idInBook":146,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا بِشْرٌ، حَدَّثَنَا خَالِدٌ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ وَلَوْ شِئْتُ أَنْ أَقُولَ قَالَ النَّبِيُّ صلى الله عليه وسلم وَلَكِنْ قَالَ السُّنَّةُ إِذَا تَزَوَّجَ الْبِكْرَ أَقَامَ عِنْدَهَا سَبْعًا، وَإِذَا تَزَوَّجَ الثَّيِّبَ أَقَامَ عِنْدَهَا ثَلاَثًا‏.‏","english":{"narrator":"Narrated Anas:","text":"The tradition, (of the Prophet) is that if someone marries a virgin and he has already a matron wife \n(with him), then he should stay with the virgin for seven days; and if someone marries a matron (and \nhe has already a virgin wife with him) then he should stay with her for three days."}},{"id":147,"idInBook":147,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا يُوسُفُ بْنُ رَاشِدٍ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ سُفْيَانَ، حَدَّثَنَا أَيُّوبُ، وَخَالِدٌ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسٍ، قَالَ مِنَ السُّنَّةِ إِذَا تَزَوَّجَ الرَّجُلُ الْبِكْرَ عَلَى الثَّيِّبِ أَقَامَ عِنْدَهَا سَبْعًا وَقَسَمَ، وَإِذَا تَزَوَّجَ الثَّيِّبَ عَلَى الْبِكْرِ أَقَامَ عِنْدَهَا ثَلاَثًا ثُمَّ قَسَمَ‏.‏ قَالَ أَبُو قِلاَبَةَ وَلَوْ شِئْتُ لَقُلْتُ إِنَّ أَنَسًا رَفَعَهُ إِلَى النَّبِيِّ صلى الله عليه وسلم‏.‏ وَقَالَ عَبْدُ الرَّزَّاقِ أَخْبَرَنَا سُفْيَانُ عَنْ أَيُّوبَ وَخَالِدٍ قَالَ خَالِدٌ وَلَوْ شِئْتُ قُلْتُ رَفَعَهُ إِلَى النَّبِيِّ صلى الله عليه وسلم‏.‏","english":{"narrator":"Narrated Anas:","text":"It is the Prophet's tradition that if someone marries a virgin and he has already a matron wife then he \nshould stay for seven days with her (the virgin) and then by turns; and if someone marries a matron \nand he has already a virgin wife then he should stay with her (the matron) for three days, and then by \nturns."}},{"id":148,"idInBook":148,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا عَبْدُ الأَعْلَى بْنُ حَمَّادٍ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، أَنَّ أَنَسَ بْنَ مَالِكٍ، حَدَّثَهُمْ أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم كَانَ يَطُوفُ عَلَى نِسَائِهِ فِي اللَّيْلَةِ الْوَاحِدَةِ، وَلَهُ يَوْمَئِذٍ تِسْعُ نِسْوَةٍ‏.‏","english":{"narrator":"Narrated Anas bin Malik:","text":"The Prophet (ﷺ) used to pass by (have sexual relation with) all his wives in one night, and at that time he \nhad nine wives."}},{"id":149,"idInBook":149,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا فَرْوَةُ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا انْصَرَفَ مِنَ الْعَصْرِ دَخَلَ عَلَى نِسَائِهِ، فَيَدْنُو مِنْ إِحْدَاهُنَّ، فَدَخَلَ عَلَى حَفْصَةَ، فَاحْتَبَسَ أَكْثَرَ مَا كَانَ يَحْتَبِسُ‏.‏","english":{"narrator":"Narrated `Aisha:","text":"Whenever Allah's Messenger (ﷺ) finished his `Asr prayer, he would enter upon his wives and stay with one \nof them. One day he went to Hafsa and stayed with her longer than usual."}},{"id":150,"idInBook":150,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي سُلَيْمَانُ بْنُ بِلاَلٍ، قَالَ هِشَامُ بْنُ عُرْوَةَ أَخْبَرَنِي أَبِي، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَسْأَلُ فِي مَرَضِهِ الَّذِي مَاتَ فِيهِ ‏\n\"‏ أَيْنَ أَنَا غَدًا أَيْنَ أَنَا غَدًا ‏\"‏‏.‏ يُرِيدُ يَوْمَ عَائِشَةَ، فَأَذِنَ لَهُ أَزْوَاجُهُ يَكُونُ حَيْثُ شَاءَ، فَكَانَ فِي بَيْتِ عَائِشَةَ حَتَّى مَاتَ عِنْدَهَا‏.‏ قَالَتْ عَائِشَةُ فَمَاتَ فِي الْيَوْمِ الَّذِي كَانَ يَدُورُ عَلَىَّ فِيهِ فِي بَيْتِي، فَقَبَضَهُ اللَّهُ، وَإِنَّ رَأْسَهُ لَبَيْنَ نَحْرِي وَسَحْرِي، وَخَالَطَ رِيقُهُ رِيقِي‏.‏","english":{"narrator":"Narrated `Aisha:","text":"that during his fatal ailment, Allah's Messenger (ﷺ), used to ask his wives, \"Where shall I stay tomorrow? \nWhere shall I stay tomorrow?\" He was looking forward to Aisha's turn. So all his wives allowed him \nto stay where he wished, and he stayed at `Aisha's house till he died there. `Aisha added: He died on \nthe day of my usual turn at my house. Allah took him unto Him while his head was between my chest \nand my neck and his saliva was mixed with my saliva."}},{"id":151,"idInBook":151,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُلَيْمَانُ، عَنْ يَحْيَى، عَنْ عُبَيْدِ بْنِ حُنَيْنٍ، سَمِعَ ابْنَ عَبَّاسٍ، عَنْ عُمَرَ ـ رضى الله عنهم ـ دَخَلَ عَلَى حَفْصَةَ فَقَالَ يَا بُنَيَّةِ لاَ يَغُرَّنَّكِ هَذِهِ الَّتِي أَعْجَبَهَا حُسْنُهَا حُبُّ رَسُولِ اللَّهِ صلى الله عليه وسلم إِيَّاهَا ـ يُرِيدُ عَائِشَةَ ـ فَقَصَصْتُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَتَبَسَّمَ‏.‏","english":{"narrator":"Narrated Ibn `Abbas:","text":"that `Umar entered upon Hafsa and said, \"O my daughter! Do not be misled by the manners of her \nwho is proud of her beauty because of the love of Allah's Messenger (ﷺ) for her.\" By 'her' he meant `Aisha. \n`Umar added, \"Then I told that to Allah's Messenger (ﷺ) and he smiled (on hearing that)."}},{"id":152,"idInBook":152,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ هِشَامٍ، عَنْ فَاطِمَةَ، عَنْ أَسْمَاءَ، عَنِ النَّبِيِّ صلى الله عليه وسلم‏.‏ حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى، عَنْ هِشَامٍ، حَدَّثَتْنِي فَاطِمَةُ، عَنْ أَسْمَاءَ، أَنَّ امْرَأَةً، قَالَتْ يَا رَسُولَ اللَّهِ إِنَّ لِي ضَرَّةً، فَهَلْ عَلَىَّ جُنَاحٌ إِنْ تَشَبَّعْتُ مِنْ زَوْجِي غَيْرَ الَّذِي يُعْطِينِي فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ الْمُتَشَبِّعُ بِمَا لَمْ يُعْطَ كَلاَبِسِ ثَوْبَىْ زُورٍ ‏\"‏‏.‏","english":{"narrator":"Narrated Asma:","text":"Some lady said, \"O Allah's Messenger (ﷺ)! My husband has another wife, so it is sinful of me to claim that \nhe has given me what he has not given me (in order to tease her)?\" Allah's Messenger (ﷺ) said, The one who \npretends that he has been given what he has not been given, is just like the (false) one who wears two \ngarments of falsehood.\""}},{"id":153,"idInBook":153,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، عَنْ شَقِيقٍ، عَنْ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ مَا مِنْ أَحَدٍ أَغْيَرُ مِنَ اللَّهِ، مِنْ أَجْلِ ذَلِكَ حَرَّمَ الْفَوَاحِشَ، وَمَا أَحَدٌ أَحَبَّ إِلَيْهِ الْمَدْحُ مِنَ اللَّهِ ‏\"‏‏.‏","english":{"narrator":"Narrated `Abdullah bin Masud:","text":"The Prophet, said, \"There is none having a greater sense of Ghira than Allah. And for that He has \nforbidden the doing of evil actions (illegal sexual intercourse etc.) There is none who likes to be \npraised more than Allah does.\""}},{"id":154,"idInBook":154,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\n\"‏ يَا أُمَّةَ مُحَمَّدٍ مَا أَحَدٌ أَغْيَرَ مِنَ اللَّهِ أَنْ يَرَى عَبْدَهُ أَوْ أَمَتَهُ تَزْنِي يَا أُمَّةَ مُحَمَّدٍ لَوْ تَعْلَمُونَ مَا أَعْلَمُ لَضَحِكْتُمْ قَلِيلاً وَلَبَكَيْتُمْ كَثِيرًا ‏\"‏‏.‏","english":{"narrator":"Narrated `Aisha:","text":"Allah's Messenger (ﷺ) said, \"O followers of Muhammad! There is none, who has a greater sense of Ghira \n(self-respect) than Allah, so He has forbidden that His slave commits illegal sexual intercourse or His \nslave girl commits illegal sexual intercourse. O followers of Muhammad! If you but knew what I \nknow, you would laugh less and weep more!\""}},{"id":155,"idInBook":155,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا هَمَّامٌ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، أَنَّ عُرْوَةَ بْنَ الزُّبَيْرِ، حَدَّثَهُ عَنْ أُمِّهِ، أَسْمَاءَ أَنَّهَا سَمِعَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ لاَ شَىْءَ أَغْيَرُ مِنَ اللَّهِ ‏\"‏‏.‏","english":{"narrator":"Narrated Asma':","text":"I heard Allah's Messenger (ﷺ) saying, \"There is nothing (none) having a greater sense of Ghira (self-respect) \nthan Allah.\" And narrated Abu Huraira that he heard the Prophet (saying the same)."}},{"id":156,"idInBook":156,"chapterId":67,"bookId":1,"arabic":"وَعَنْ يَحْيَى، أَنَّ أَبَا سَلَمَةَ، حَدَّثَهُ أَنَّ أَبَا هُرَيْرَةَ حَدَّثَهُ أَنَّهُ، سَمِعَ النَّبِيَّ صلى الله عليه وسلم‏.‏ حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا شَيْبَانُ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ ‏\n\"‏ إِنَّ اللَّهَ يَغَارُ وَغَيْرَةُ اللَّهِ أَنْ يَأْتِيَ الْمُؤْمِنُ مَا حَرَّمَ اللَّهُ ‏\"‏‏.‏","english":{"narrator":"Narrated Abu Huraira:","text":"The Prophet; said, \"Allah has a sense of Ghira, and Allah's sense of Ghira is provoked when a believer \ndoes something which Allah has prohibited.\""}},{"id":157,"idInBook":157,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا مَحْمُودٌ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا هِشَامٌ، قَالَ أَخْبَرَنِي أَبِي، عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ ـ رضى الله عنهما ـ قَالَتْ تَزَوَّجَنِي الزُّبَيْرُ، وَمَا لَهُ فِي الأَرْضِ مِنْ مَالٍ، وَلاَ مَمْلُوكٍ، وَلاَ شَىْءٍ غَيْرَ نَاضِحٍ، وَغَيْرَ فَرَسِهِ، فَكُنْتُ أَعْلِفُ فَرَسَهُ، وَأَسْتَقِي الْمَاءَ، وَأَخْرِزُ غَرْبَهُ وَأَعْجِنُ، وَلَمْ أَكُنْ أُحْسِنُ أَخْبِزُ، وَكَانَ يَخْبِزُ جَارَاتٌ لِي مِنَ الأَنْصَارِ وَكُنَّ نِسْوَةَ صِدْقٍ، وَكُنْتُ أَنْقُلُ النَّوَى مِنْ أَرْضِ الزُّبَيْرِ الَّتِي أَقْطَعَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى رَأْسِي، وَهْىَ مِنِّي عَلَى ثُلُثَىْ فَرْسَخٍ، فَجِئْتُ يَوْمًا وَالنَّوَى عَلَى رَأْسِي فَلَقِيتُ رَسُولَ اللَّهِ صلى الله عليه وسلم وَمَعَهُ نَفَرٌ مِنَ الأَنْصَارِ فَدَعَانِي ثُمَّ قَالَ ‏\n\"‏ إِخْ إِخْ ‏\"‏‏.‏ لِيَحْمِلَنِي خَلْفَهُ، فَاسْتَحْيَيْتُ أَنْ أَسِيرَ مَعَ الرِّجَالِ، وَذَكَرْتُ الزُّبَيْرَ وَغَيْرَتَهُ، وَكَانَ أَغْيَرَ النَّاسِ، فَعَرَفَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنِّي قَدِ اسْتَحْيَيْتُ فَمَضَى، فَجِئْتُ الزُّبَيْرَ فَقُلْتُ لَقِيَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم وَعَلَى رَأْسِي النَّوَى، وَمَعَهُ نَفَرٌ مِنْ أَصْحَابِهِ، فَأَنَاخَ لأَرْكَبَ، فَاسْتَحْيَيْتُ مِنْهُ وَعَرَفْتُ غَيْرَتَكَ‏.‏ فَقَالَ وَاللَّهِ لَحَمْلُكِ النَّوَى كَانَ أَشَدَّ عَلَىَّ مِنْ رُكُوبِكِ مَعَهُ‏.‏ قَالَتْ حَتَّى أَرْسَلَ إِلَىَّ أَبُو بَكْرٍ بَعْدَ ذَلِكَ بِخَادِمٍ يَكْفِينِي سِيَاسَةَ الْفَرَسِ، فَكَأَنَّمَا أَعْتَقَنِي‏.‏","english":{"narrator":"Narrated Asma' bint Abu Bakr:","text":"When Az-Zubair married me, he had no real property or any slave or anything else except a camel \nwhich drew water from the well, and his horse. I used to feed his horse with fodder and drew water \nand sew the bucket for drawing it, and prepare the dough, but I did not know how to bake bread. So \nour Ansari neighbors used to bake bread for me, and they were honorable ladies. I used to carry the \ndate stones on my head from Zubair's land given to him by Allah's Messenger (ﷺ) and this land was two third \nFarsakh (about two miles) from my house. One day, while I was coming with the date stones on my \nhead, I met Allah's Messenger (ﷺ) along with some Ansari people. He called me and then, (directing his \ncamel to kneel down) said, \"Ikh! Ikh!\" so as to make me ride behind him (on his camel). I felt shy to \ntravel with the men and remembered Az-Zubair and his sense of Ghira, as he was one of those people \nwho had the greatest sense of Ghira. Allah's Messenger (ﷺ) noticed that I felt shy, so he proceeded. I came to \nAz-Zubair and said, \"I met Allah's Messenger (ﷺ) while I was carrying a load of date stones on my head, and \nhe had some companions with him. He made his camel kneel down so that I might ride, but I felt shy \nin his presence and remembered your sense of Ghira (See the glossary). On that Az-Zubair said, \"By \nAllah, your carrying the date stones (and you being seen by the Prophet (ﷺ) in such a state) is more \nshameful to me than your riding with him.\" (I continued serving in this way) till Abu Bakr sent me a \nservant to look after the horse, whereupon I felt as if he had set me free."}},{"id":158,"idInBook":158,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا عَلِيٌّ، حَدَّثَنَا ابْنُ عُلَيَّةَ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم عِنْدَ بَعْضِ نِسَائِهِ فَأَرْسَلَتْ إِحْدَى أُمَّهَاتِ الْمُؤْمِنِينَ بِصَحْفَةٍ فِيهَا طَعَامٌ، فَضَرَبَتِ الَّتِي النَّبِيُّ صلى الله عليه وسلم فِي بَيْتِهَا يَدَ الْخَادِمِ فَسَقَطَتِ الصَّحْفَةُ فَانْفَلَقَتْ، فَجَمَعَ النَّبِيُّ صلى الله عليه وسلم فِلَقَ الصَّحْفَةِ، ثُمَّ جَعَلَ يَجْمَعُ فِيهَا الطَّعَامَ الَّذِي كَانَ فِي الصَّحْفَةِ وَيَقُولُ ‏\n\"‏ غَارَتْ أُمُّكُمْ ‏\"‏، ثُمَّ حَبَسَ الْخَادِمَ حَتَّى أُتِيَ بِصَحْفَةٍ مِنْ عِنْدِ الَّتِي هُوَ فِي بَيْتِهَا، فَدَفَعَ الصَّحْفَةَ الصَّحِيحَةَ إِلَى الَّتِي كُسِرَتْ صَحْفَتُهَا، وَأَمْسَكَ الْمَكْسُورَةَ فِي بَيْتِ الَّتِي كَسَرَتْ فِيه.‏","english":{"narrator":"Narrated Anas:","text":"While the Prophet (ﷺ) was in the house of one of his wives, one of the mothers of the believers sent a \nmeal in a dish. The wife at whose house the Prophet (ﷺ) was, struck the hand of the servant, causing the \ndish to fall and break. The Prophet (ﷺ) gathered the broken pieces of the dish and then started collecting \non them the food which had been in the dish and said, \"Your mother (my wife) felt jealous.\" Then he \ndetained the servant till a (sound) dish was brought from the wife at whose house he was. He gave the \nsound dish to the wife whose dish had been broken and kept the broken one at the house where it had \nbeen broken."}},{"id":159,"idInBook":159,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ، حَدَّثَنَا مُعْتَمِرٌ، عَنْ عُبَيْدِ اللَّهِ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\n\"‏ دَخَلْتُ الْجَنَّةَ ـ أَوْ أَتَيْتُ الْجَنَّةَ ـ فَأَبْصَرْتُ قَصْرًا فَقُلْتُ لِمَنْ هَذَا قَالُوا لِعُمَرَ بْنِ الْخَطَّابِ‏.‏ فَأَرَدْتُ أَنْ أَدْخُلَهُ فَلَمْ يَمْنَعْنِي إِلاَّ عِلْمِي بِغَيْرَتِكَ ‏\"‏‏.‏ قَالَ عُمَرُ بْنُ الْخَطَّابِ يَا رَسُولَ اللَّهِ بِأَبِي أَنْتَ وَأُمِّي يَا نَبِيَّ اللَّهِ أَوَعَلَيْكَ أَغَارُ‏.‏","english":{"narrator":"Narrated Jabir:","text":"The Prophet, said, \"I entered Paradise and saw a palace and asked whose palace is this? They (the \nAngels) said, \"This palace belongs to `Umar bin Al-Khattab.' I intended to enter it, and nothing \nstopped me except my knowledge about your sense of Ghira (self-respect (O `Umar).\" `Umar said, \"O \nAllah's Messenger (ﷺ)! Let my father and mother be sacrificed for you! O Allah's Prophet! How dare I think \nof my Ghira (self-respect) being offended by you?\""}},{"id":160,"idInBook":160,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا عَبْدَانُ، أَخْبَرَنَا عَبْدُ اللَّهِ، عَنْ يُونُسَ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي ابْنُ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ بَيْنَمَا نَحْنُ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم جُلُوسٌ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ بَيْنَمَا أَنَا نَائِمٌ رَأَيْتُنِي فِي الْجَنَّةِ، فَإِذَا امْرَأَةٌ تَتَوَضَّأُ إِلَى جَانِبِ قَصْرٍ، فَقُلْتُ لِمَنْ هَذَا قَالَ هَذَا لِعُمَرَ‏.‏ فَذَكَرْتُ غَيْرَتَهُ فَوَلَّيْتُ مُدْبِرًا ‏\"‏‏.‏ فَبَكَى عُمَرُ وَهْوَ فِي الْمَجْلِسِ ثُمَّ قَالَ أَوَعَلَيْكَ يَا رَسُولَ اللَّهِ أَغَارُ‏.‏","english":{"narrator":"Narrated Abu Huraira:","text":"While we were sitting with Allah's Messenger (ﷺ), (he) Allah's Messenger (ﷺ) said, \"While I was sleeping, I saw a \nwoman performing ablution beside a palace. I asked, \"Whose palace is this?' It was said, 'This palace \nbelongs to `Umar.' Then I remembered his sense of Ghira and returned.\" On that `Umar started \nweeping in that gathering and said, \"O Allah's Messenger (ﷺ)! How dare I think of my self-respect being \noffended by you?\""}},{"id":161,"idInBook":161,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا عُبَيْدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ قَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنِّي لأَعْلَمُ إِذَا كُنْتِ عَنِّي رَاضِيَةً، وَإِذَا كُنْتِ عَلَىَّ غَضْبَى ‏\"‏‏.‏ قَالَتْ فَقُلْتُ مِنْ أَيْنَ تَعْرِفُ ذَلِكَ فَقَالَ ‏\"‏ أَمَّا إِذَا كُنْتِ عَنِّي رَاضِيَةً فَإِنَّكِ تَقُولِينَ لاَ وَرَبِّ مُحَمَّدٍ، وَإِذَا كُنْتِ غَضْبَى قُلْتِ لاَ وَرَبِّ إِبْرَاهِيمَ ‏\"‏‏.‏ قَالَتْ قُلْتُ أَجَلْ وَاللَّهِ يَا رَسُولَ اللَّهِ، مَا أَهْجُرُ إِلاَّ اسْمَكَ‏.‏","english":{"narrator":"Narrated Aisha:","text":"That Allah's Messenger (ﷺ) said to her, \"I know when you are pleased with me or angry with me.\" I said, \"Whence do \nyou know that?\" He said, \"When you are pleased with me, you say, 'No, by the Lord of Muhammad,' \nbut when you are angry with me, then you say, 'No, by the Lord of Abraham.' \" Thereupon I said, \n\"Yes (you are right), but by Allah, O Allah's Messenger (ﷺ), I leave nothing but your name.\""}},{"id":162,"idInBook":162,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنِي أَحْمَدُ بْنُ أَبِي رَجَاءٍ، حَدَّثَنَا النَّضْرُ، عَنْ هِشَامٍ، قَالَ أَخْبَرَنِي أَبِي، عَنْ عَائِشَةَ، أَنَّهَا قَالَتْ مَا غِرْتُ عَلَى امْرَأَةٍ لِرَسُولِ اللَّهِ صلى الله عليه وسلم كَمَا غِرْتُ عَلَى خَدِيجَةَ، لِكَثْرَةِ ذِكْرِ رَسُولِ اللَّهِ صلى الله عليه وسلم إِيَّاهَا وَثَنَائِهِ عَلَيْهَا، وَقَدْ أُوحِيَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم أَنْ يُبَشِّرَهَا بِبَيْتٍ لَهَا فِي الْجَنَّةِ مِنْ قَصَبٍ‏.‏","english":{"narrator":"Narrated `Aisha:","text":"I never felt so jealous of any wife of Allah's Messenger (ﷺ) as I did of Khadija because Allah's Messenger (ﷺ) used \nto remember and praise her too often and because it was revealed to Allah's Messenger (ﷺ) that he should \ngive her (Khadija) the glad tidings of her having a palace of Qasab in Paradise ."}},{"id":163,"idInBook":163,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنِ الْمِسْوَرِ بْنِ مَخْرَمَةَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ وَهْوَ عَلَى الْمِنْبَرِ ‏\n\"‏ إِنَّ بَنِي هِشَامِ بْنِ الْمُغِيرَةِ اسْتَأْذَنُوا فِي أَنْ يُنْكِحُوا ابْنَتَهُمْ عَلِيَّ بْنَ أَبِي طَالِبٍ فَلاَ آذَنُ، ثُمَّ لاَ آذَنُ، ثُمَّ لاَ آذَنُ، إِلاَّ أَنْ يُرِيدَ ابْنُ أَبِي طَالِبٍ أَنْ يُطَلِّقَ ابْنَتِي وَيَنْكِحَ ابْنَتَهُمْ، فَإِنَّمَا هِيَ بَضْعَةٌ مِنِّي، يُرِيبُنِي مَا أَرَابَهَا وَيُؤْذِينِي مَا آذَاهَا ‏\"‏‏.‏ هَكَذَا قَالَ‏.‏","english":{"narrator":"Narrated Al-Miswar bin Makhrama:","text":"I heard Allah's Messenger (ﷺ) who was on the pulpit, saying, \"Banu Hisham bin Al-Mughira have requested \nme to allow them to marry their daughter to `Ali bin Abu Talib, but I don't give permission, and will \nnot give permission unless `Ali bin Abi Talib divorces my daughter in order to marry their daughter, \nbecause Fatima is a part of my body, and I hate what she hates to see, and what hurts her, hurts me.\""}},{"id":164,"idInBook":164,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا حَفْصُ بْنُ عُمَرَ الْحَوْضِيُّ، حَدَّثَنَا هِشَامٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ لأُحَدِّثَنَّكُمْ حَدِيثًا سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم لاَ يُحَدِّثُكُمْ بِهِ أَحَدٌ غَيْرِي، سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\n\"‏ إِنَّ مِنْ أَشْرَاطِ السَّاعَةِ أَنْ يُرْفَعَ الْعِلْمُ، وَيَكْثُرَ الْجَهْلُ وَيَكْثُرَ الزِّنَا، وَيَكْثُرَ شُرْبُ الْخَمْرِ، وَيَقِلَّ الرِّجَالُ، وَيَكْثُرَ النِّسَاءُ حَتَّى يَكُونَ لِخَمْسِينَ امْرَأَةً الْقَيِّمُ الْوَاحِدُ ‏\"‏‏.‏","english":{"narrator":"Narrated Anas:","text":"I will narrate to you a Habith I heard from Allah's Messenger (ﷺ) and none other than I will tell you of it. I \nheard Allah's Messenger (ﷺ) saying, \"From among the portents of the Hour are the following: Religious \nknowledge will be taken away; General ignorance (in religious matters) will increase; illegal Sexual \nintercourse will prevail: Drinking of alcoholic drinks will prevail. Men will decrease in number, and \nwomen will increase in number, so much so that fifty women will be looked after by one man.\""}},{"id":165,"idInBook":165,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ أَبِي الْخَيْرِ، عَنْ عُقْبَةَ بْنِ عَامِرٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِيَّاكُمْ وَالدُّخُولَ عَلَى النِّسَاءِ ‏\"‏‏.‏ فَقَالَ رَجُلٌ مِنَ الأَنْصَارِ يَا رَسُولَ اللَّهِ أَفَرَأَيْتَ الْحَمْوَ‏.‏ قَالَ ‏\"‏ الْحَمْوُ الْمَوْتُ ‏\"‏‏.‏","english":{"narrator":"Narrated `Uqba bin 'Amir:","text":"Allah's Messenger (ﷺ) said, \"Beware of entering upon the ladies.\" A man from the Ansar said, \"Allah's \nApostle! What about Al-Hamu the in-laws of the wife (the brothers of her husband or his nephews \netc.)?\" The Prophet (ﷺ) replied: The in-laws of the wife are death itself."}},{"id":166,"idInBook":166,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا عَمْرٌو، عَنْ أَبِي مَعْبَدٍ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ يَخْلُوَنَّ رَجُلٌ بِامْرَأَةٍ إِلاَّ مَعَ ذِي مَحْرَمٍ ‏\"‏‏.‏ فَقَامَ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ امْرَأَتِي خَرَجَتْ حَاجَّةً وَاكْتُتِبْتُ فِي غَزْوَةِ كَذَا وَكَذَا‏.‏ قَالَ ‏\"‏ ارْجِعْ فَحُجَّ مَعَ امْرَأَتِكَ ‏\"‏‏.‏","english":{"narrator":"Narrated Ibn `Abbas:","text":"The Prophet (ﷺ) said, \"No man should stay with a lady in seclusion except in the presence of a Dhu- \nMuhram.\" A man stood up and said, \"O Allah's Messenger (ﷺ)! My wife has gone out intending to perform \nthe Hajj and I have been enrolled (in the army) for such-and-such campaign.\" The Prophet (ﷺ) said, \n\"Return and perform the Hajj with your wife.\""}},{"id":167,"idInBook":167,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ هِشَامٍ، قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ ـ رضى الله عنه ـ قَالَ جَاءَتِ امْرَأَةٌ مِنَ الأَنْصَارِ إِلَى النَّبِيِّ صلى الله عليه وسلم فَخَلاَ بِهَا فَقَالَ ‏\n\"‏ وَاللَّهِ إِنَّكُنَّ لأَحَبُّ النَّاسِ إِلَىَّ ‏\"‏‏.‏","english":{"narrator":"Narrated Anas bin Malik:","text":"An Ansari woman came to the Prophet (ﷺ) and he took her aside and said (to her). \"By Allah, you (Ansar) \nare the most beloved people to me.\""}},{"id":168,"idInBook":168,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ زَيْنَبَ ابْنَةِ أُمِّ سَلَمَةَ، عَنْ أُمِّ سَلَمَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ عِنْدَهَا وَفِي الْبَيْتِ مُخَنَّثٌ، فَقَالَ الْمُخَنَّثُ لأَخِي أُمِّ سَلَمَةَ عَبْدِ اللَّهِ بْنِ أَبِي أُمَيَّةَ إِنْ فَتَحَ اللَّهُ عَلَيْكُمُ الطَّائِفَ غَدًا أَدُلُّكَ عَلَى ابْنَةِ غَيْلاَنَ، فَإِنَّهَا تُقْبِلُ بِأَرْبَعٍ وَتُدْبِرُ بِثَمَانٍ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ لاَ يَدْخُلَنَّ هَذَا عَلَيْكُنَّ ‏\"‏‏.‏","english":{"narrator":"Narrated Um Salama:","text":"that while the Prophet (ﷺ) was with her, there was an effeminate man in the house. The effeminate man \nsaid to Um Salama's brother, `Abdullah bin Abi Umaiyya, \"If Allah should make you conquer Ta'if \ntomorrow, I recommend that you take the daughter of Ghailan (in marriage) for (she is so fat) that she \nshows four folds of flesh when facing you and eight when she turns her back.\" Thereupon the Prophet (ﷺ) \nsaid (to us), \"This (effeminate man) should not enter upon you (anymore)."}},{"id":169,"idInBook":169,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، عَنْ عِيسَى، عَنِ الأَوْزَاعِيِّ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتْ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يَسْتُرُنِي بِرِدَائِهِ، وَأَنَا أَنْظُرُ إِلَى الْحَبَشَةِ يَلْعَبُونَ فِي الْمَسْجِدِ، حَتَّى أَكُونَ أَنَا الَّذِي أَسْأَمُ، فَاقْدُرُوا قَدْرَ الْجَارِيَةِ الْحَدِيثَةِ السِّنِّ الْحَرِيصَةِ عَلَى اللَّهْوِ‏.‏","english":{"narrator":"Narrated `Aisha:","text":"The Prophet (ﷺ) was screening me with his Rida' (garment covering the upper part of the body) while I \nwas looking at the Ethiopians who were playing in the courtyard of the mosque. (I continued \nwatching) till I was satisfied. So you may deduce from this event how a little girl (who has not \nreached the age of puberty) who is eager to enjoy amusement should be treated in this respect."}},{"id":170,"idInBook":170,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا فَرْوَةُ بْنُ أَبِي الْمَغْرَاءِ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ خَرَجَتْ سَوْدَةُ بِنْتُ زَمْعَةَ لَيْلاً فَرَآهَا عُمَرُ فَعَرَفَهَا فَقَالَ إِنَّكِ وَاللَّهِ يَا سَوْدَةُ مَا تَخْفَيْنَ عَلَيْنَا، فَرَجَعَتْ إِلَى النَّبِيِّ صلى الله عليه وسلم فَذَكَرَتْ ذَلِكَ لَهُ، وَهْوَ فِي حُجْرَتِي يَتَعَشَّى، وَإِنَّ فِي يَدِهِ لَعَرْقًا، فَأُنْزِلَ عَلَيْهِ فَرُفِعَ عَنْهُ وَهُوَ يَقُولُ ‏\n\"‏ قَدْ أَذِنَ لَكُنَّ أَنْ تَخْرُجْنَ لِحَوَائِجِكُنَّ ‏\"‏‏.‏","english":{"narrator":"Narrated `Aisha:","text":"Once Sa`da bint Zam`a went out at night for some need, and `Umar saw her, and recognizing her, he \nsaid (to her), \"By Allah, O Sa`da! You cannot hide yourself from us.\" So she returned to the Prophet (ﷺ) \nand mentioned that to him while he was sitting in my dwelling taking his supper and holding a bone \ncovered with meat in his hand. Then the Divine Inspiration was revealed to him and when that state \nwas over, he (the Prophet (ﷺ) was saying: \"O women! You have been allowed by Allah to go out for your \nneeds.\""}},{"id":171,"idInBook":171,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا الزُّهْرِيُّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم ‏\n\"‏ إِذَا اسْتَأْذَنَتِ امْرَأَةُ أَحَدِكُمْ إِلَى الْمَسْجِدِ فَلاَ يَمْنَعْهَا ‏\"‏‏.‏","english":{"narrator":"Narrated Salim's father:","text":"The Prophet (ﷺ) said, \"If the wife of anyone of you asks permission to go to the mosque, he should not \nforbid her.\""}},{"id":172,"idInBook":172,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّهَا قَالَتْ جَاءَ عَمِّي مِنَ الرَّضَاعَةِ فَاسْتَأْذَنَ عَلَىَّ فَأَبَيْتُ أَنْ آذَنَ لَهُ حَتَّى أَسْأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَجَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَسَأَلْتُهُ عَنْ ذَلِكَ فَقَالَ ‏\"‏ إِنَّهُ عَمُّكِ فَأْذَنِي لَهُ ‏\"‏ قَالَتْ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّمَا أَرْضَعَتْنِي الْمَرْأَةُ وَلَمْ يُرْضِعْنِي الرَّجُلُ‏.‏ قَالَتْ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّهُ عَمُّكِ فَلْيَلِجْ عَلَيْكِ ‏\"‏‏.‏ قَالَتْ عَائِشَةُ وَذَلِكَ بَعْدَ أَنْ ضُرِبَ عَلَيْنَا الْحِجَابُ‏.‏ قَالَتْ عَائِشَةُ يَحْرُمُ مِنَ الرَّضَاعَةِ مَا يَحْرُمُ مِنَ الْوِلاَدَةِ‏.‏","english":{"narrator":"Narrated `Aisha:","text":"My foster uncle came and asked permission (to enter) but I refused to admit him till I asked Allah's \nApostle about that. He said, \"He is your uncle, so allow him to come in.\" I said, \"O Allah's Messenger (ﷺ)! I \nhave been suckled by a woman and not by a man.\" Allah's Messenger (ﷺ) said, \"He is your uncle, so let him \nenter upon you.\" And that happened after the order of Al-Hijab (compulsory veiling) was revealed. \nAll things which become unlawful because of blood relations are unlawful because of the \ncorresponding foster suckling relations."}},{"id":173,"idInBook":173,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ لاَ تُبَاشِرِ الْمَرْأَةُ الْمَرْأَةَ فَتَنْعَتَهَا لِزَوْجِهَا، كَأَنَّهُ يَنْظُرُ إِلَيْهَا ‏\"‏‏.‏","english":{"narrator":"Narrated `Abdullah bin Mas`ud:","text":"The Prophet (ﷺ) said, \"A woman should not look at or touch another woman to describe her to her \nhusband in such a way as if he was actually looking at her.\""}},{"id":174,"idInBook":174,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، قَالَ حَدَّثَنِي شَقِيقٌ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\n\"‏ لاَ تُبَاشِرِ الْمَرْأَةُ الْمَرْأَةَ فَتَنْعَتَهَا لِزَوْجِهَا كَأَنَّهُ يَنْظُرُ إِلَيْهَا ‏\"‏‏.‏","english":{"narrator":"Narrated `Abdullah:","text":"The Prophet (ﷺ) said, \"A woman should not look at or touch another woman to describe her to her \nhusband in such a way as if he was actually looking at her.\""}},{"id":175,"idInBook":175,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنِي مَحْمُودٌ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ ‏\"‏ قَالَ سُلَيْمَانُ بْنُ دَاوُدَ ـ عَلَيْهِمَا السَّلاَمُ ـ لأَطُوفَنَّ اللَّيْلَةَ بِمِائَةِ امْرَأَةٍ، تَلِدُ كُلُّ امْرَأَةٍ غُلاَمًا، يُقَاتِلُ فِي سَبِيلِ اللَّهِ، فَقَالَ لَهُ الْمَلَكُ قُلْ إِنْ شَاءَ اللَّهُ‏.‏ فَلَمْ يَقُلْ وَنَسِيَ، فَأَطَافَ بِهِنَّ، وَلَمْ تَلِدْ مِنْهُنَّ إِلاَّ امْرَأَةٌ نِصْفَ إِنْسَانٍ ‏\"‏‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ لَوْ قَالَ إِنْ شَاءَ اللَّهُ لَمْ يَحْنَثْ، وَكَانَ أَرْجَى لِحَاجَتِهِ ‏\"‏‏.‏","english":{"narrator":"Narrated Abu Huraira:","text":"(The Prophet) Solomon son of (the Prophet) David said, \"Tonight I will go round (i.e. have sexual \nrelations with) one hundred women (my wives) everyone of whom will deliver a male child who will \nfight in Allah's Cause.\" On that an Angel said to him, \"Say: 'If Allah will.' \" But Solomon did not say \nit and forgot to say it. Then he had sexual relations with them but none of them delivered any child \nexcept one who delivered a half person. The Prophet (ﷺ) said, \"If Solomon had said: 'If Allah will,' Allah \nwould have fulfilled his (above) desire and that saying would have made him more hopeful.\""}},{"id":176,"idInBook":176,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا آدَمُ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا مُحَارِبُ بْنُ دِثَارٍ، قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنه ـ قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَكْرَهُ أَنْ يَأْتِيَ الرَّجُلُ أَهْلَهُ طُرُوقًا‏.‏","english":{"narrator":"Narrated Jabir bin `Abdullah:","text":"The Prophet (ﷺ) disliked that one should go to one's family at night (on returning from a journey)."}},{"id":177,"idInBook":177,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا عَاصِمُ بْنُ سُلَيْمَانَ، عَنِ الشَّعْبِيِّ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ إِذَا أَطَالَ أَحَدُكُمُ الْغَيْبَةَ فَلاَ يَطْرُقْ أَهْلَهُ لَيْلاً ‏\"‏‏.‏","english":{"narrator":"Narrated Jabir bin `Abdullah:","text":"Allah's Messenger (ﷺ) said, \"When anyone of you is away from his house for a long time, he should not \nreturn to his family at night.\""}},{"id":178,"idInBook":178,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا مُسَدَّدٌ، عَنْ هُشَيْمٍ، عَنْ سَيَّارٍ، عَنِ الشَّعْبِيِّ، عَنْ جَابِرٍ، قَالَ كُنْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي غَزْوَةٍ، فَلَمَّا قَفَلْنَا تَعَجَّلْتُ عَلَى بَعِيرٍ قَطُوفٍ فَلَحِقَنِي رَاكِبٌ مِنْ خَلْفِي، فَالْتَفَتُّ فَإِذَا أَنَا بِرَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَا يُعْجِلُكَ ‏\"‏‏.‏ قُلْتُ إِنِّي حَدِيثُ عَهْدٍ بِعُرْسٍ‏.‏ قَالَ ‏\"‏ فَبِكْرًا تَزَوَّجْتَ أَمْ ثَيِّبًا ‏\"‏‏.‏ قُلْتُ بَلْ ثَيِّبًا‏.‏ قَالَ ‏\"‏ فَهَلاَّ جَارِيَةً تُلاَعِبُهَا وَتُلاَعِبُكَ ‏\"‏‏.‏ قَالَ فَلَمَّا قَدِمْنَا ذَهَبْنَا لِنَدْخُلَ فَقَالَ ‏\"‏ أَمْهِلُوا حَتَّى تَدْخُلُوا لَيْلاً ـ أَىْ عِشَاءً ـ لِكَىْ تَمْتَشِطَ الشَّعِثَةُ وَتَسْتَحِدَّ الْمُغِيبَةُ ‏\"‏‏.‏ قَالَ وَحَدَّثَنِي الثِّقَةُ أَنَّهُ قَالَ فِي هَذَا الْحَدِيثِ ‏\"‏ الْكَيْسَ الْكَيْسَ يَا جَابِرُ ‏\"‏‏.‏ يَعْنِي الْوَلَدَ‏.‏","english":{"narrator":"Narrated Jabir:","text":"I was with Allah's Messenger (ﷺ) in a Ghazwa, and when we returned, I wanted to hurry, while riding a slow \ncamel. A rider came behind me. I looked back and saw that the rider was Allah's Messenger (ﷺ) . He said (to \nme), \"What makes you in such a hurry?\" I replied, \"I am newly married.\" He said, \"Did you marry a \nvirgin or a matron?\" I replied, \"(Not a virgin but) a matron.\" He said, \"Why didn't you marry a young \ngirl with whom you could play and who could play with you?\" Then when we approached (Medina) \nand were going to enter (it), the Prophet (ﷺ) said, \"Wait till you enter (your homes) at night (in the first \npart of the night) so that the ladies with unkempt hair may comb their hair, and those whose husbands \nhave been absent (for a long time) may shave their pubic hair.\" (The sub-narrator, Hashim said: A \nreliable narrator told me that the Prophet (ﷺ) added in this Hadith: \"(Seek to beget) children! Children, O \nJabir!\")"}},{"id":179,"idInBook":179,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْوَلِيدِ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ سَيَّارٍ، عَنِ الشَّعْبِيِّ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا دَخَلْتَ لَيْلاً فَلاَ تَدْخُلْ عَلَى أَهْلِكَ حَتَّى تَسْتَحِدَّ الْمُغِيبَةُ وَتَمْتَشِطَ الشَّعِثَةُ ‏\"‏‏.‏ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَعَلَيْكَ بِالْكَيْسِ الْكَيْسِ ‏\"‏‏.‏ تَابَعَهُ عُبَيْدُ اللَّهِ عَنْ وَهْبٍ عَنْ جَابِرٍ عَنِ النَّبِيِّ صلى الله عليه وسلم فِي الْكَيْسِ‏.‏","english":{"narrator":"Narrated Jabir bin `Abdullah:","text":"The Prophet (ﷺ) said, \"If you enter (your town) at night (after coming from a journey), do not enter upon \nyour family till the woman whose husband was absent (from the house) shaves her pubic hair and the \nwoman with unkempt hair, combs her hair\" Allah's Messenger (ﷺ) further said, \"(O Jabir!) Seek to have \noffspring, seek to have offspring!\""}},{"id":180,"idInBook":180,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنِي يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا هُشَيْمٌ، أَخْبَرَنَا سَيَّارٌ، عَنِ الشَّعْبِيِّ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم فِي غَزْوَةٍ، فَلَمَّا قَفَلْنَا كُنَّا قَرِيبًا مِنَ الْمَدِينَةِ تَعَجَّلْتُ عَلَى بَعِيرٍ لِي قَطُوفٍ، فَلَحِقَنِي رَاكِبٌ مِنْ خَلْفِي فَنَخَسَ بَعِيرِي بِعَنَزَةٍ كَانَتْ مَعَهُ، فَسَارَ بَعِيرِي كَأَحْسَنِ مَا أَنْتَ رَاءٍ مِنَ الإِبِلِ، فَالْتَفَتُّ فَإِذَا أَنَا بِرَسُولِ اللَّهِ صلى الله عليه وسلم فَقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي حَدِيثُ عَهْدٍ بِعُرْسٍ‏.‏ قَالَ ‏\"‏ أَتَزَوَّجْتَ ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ قَالَ ‏\"‏ أَبِكْرًا أَمْ ثَيِّبًا ‏\"‏‏.‏ قَالَ قُلْتُ بَلْ ثَيِّبًا‏.‏ قَالَ ‏\"‏ فَهَلاَّ بِكْرًا تُلاَعِبُهَا وَتُلاَعِبُكَ ‏\"‏‏.‏ قَالَ فَلَمَّا قَدِمْنَا ذَهَبْنَا لِنَدْخُلَ، فَقَالَ ‏\"‏ أَمْهِلُوا حَتَّى تَدْخُلُوا لَيْلاً ـ أَىْ عِشَاءً ـ لِكَىْ تَمْتَشِطَ الشَّعِثَةُ، وَتَسْتَحِدَّ الْمُغِيبَةُ ‏\"‏‏.‏","english":{"narrator":"Narrated Jabir bin `Abdullah:","text":"We were with the Prophet (ﷺ) in Ghazwa, and when we returned and approached Medina, I wanted to \nhurry while riding a slow camel. A rider overtook me and pricked my camel with a spear which he \nhad, whereupon my camel started running as fast as any other fast camel you may see. I looked back, \nand behold, the rider was Allah's Messenger (ﷺ) . I said, \"O Allah's Messenger (ﷺ)! I am newly married \" He asked, \n\"Have you got married?\" I replied, \"Yes.\" He said, \"A virgin or a matron?\" I replied, \"(Not a virgin) \nbut a matron\" He said, \"Why didn't you marry a young girl so that you could play with her and she \nwith you?\" When we reached (near Medina) and were going to enter it, the Prophet (ﷺ) said, \"Wait till \nyou enter your home early in the night so that the lady whose hair is unkempt may comb her hair and \nthat the lady whose husband has been away may shave her pubic hair.\""}},{"id":181,"idInBook":181,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي حَازِمٍ، قَالَ اخْتَلَفَ النَّاسُ بِأَىِّ شَىْءٍ دُووِيَ جُرْحُ رَسُولِ اللَّهِ صلى الله عليه وسلم يَوْمَ أُحُدٍ، فَسَأَلُوا سَهْلَ بْنَ سَعْدٍ السَّاعِدِيَّ، وَكَانَ مِنْ آخِرِ مَنْ بَقِيَ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم بِالْمَدِينَةِ، فَقَالَ وَمَا بَقِيَ مِنَ النَّاسِ أَحَدٌ أَعْلَمُ بِهِ مِنِّي، كَانَتْ فَاطِمَةُ عَلَيْهَا السَّلاَمُ تَغْسِلُ الدَّمَ عَنْ وَجْهِهِ، وَعَلِيٌّ يَأْتِي بِالْمَاءِ عَلَى تُرْسِهِ، فَأُخِذَ حَصِيرٌ، فَحُرِّقَ فَحُشِيَ بِهِ جُرْحُهُ‏.‏","english":{"narrator":"Narrated Abu Hazim:","text":"The people differed about the type of treatment which had been given to Allah's Messenger (ﷺ) on the day \n(of the battle) of Uhud. So they asked Sahl bin Sa`d As-Sa`id who was the only surviving Companion \n(of the Prophet) at Medina. He replied, \"Nobody Is left at Medina who knows it better than I. Fatima \nwas washing the blood off his face and `Ali was bringing water in his shield, and then a mat of datepalm \nleaves was burnt and (the ash) was inserted into the wound.\""}},{"id":182,"idInBook":182,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا سُفْيَانُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَابِسٍ، سَمِعْتُ ابْنَ عَبَّاسٍ ـ رضى الله عنهما ـ سَأَلَهُ رَجُلٌ شَهِدْتَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم الْعِيدَ أَضْحًى أَوْ فِطْرًا قَالَ نَعَمْ لَوْلاَ مَكَانِي مِنْهُ مَا شَهِدْتُهُ ـ يَعْنِي مِنْ صِغَرِهِ ـ قَالَ خَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَصَلَّى ثُمَّ خَطَبَ، وَلَمْ يَذْكُرْ أَذَانًا وَلاَ إِقَامَةً، ثُمَّ أَتَى النِّسَاءَ فَوَعَظَهُنَّ وَذَكَّرَهُنَّ وَأَمَرَهُنَّ بِالصَّدَقَةِ، فَرَأَيْتُهُنَّ يَهْوِينَ إِلَى آذَانِهِنَّ وَحُلُوقِهِنَّ يَدْفَعْنَ إِلَى بِلاَلٍ، ثُمَّ ارْتَفَعَ هُوَ وَبِلاَلٌ إِلَى بَيْتِهِ‏.‏","english":{"narrator":"Narrated `Abdur-Rahman bin `Abis:","text":"I heard Ibn `Abbas answering a man who asked him, \"Did you attend the prayer of `Id al Adha or `Idal- \nFitr with Allah's Messenger (ﷺ)?\" Ibn `Abbas replied, \"Yes, and had it not been for my close relationship \nwith him, I could not have offered it.\" (That was because of his young age). Ibn `Abbas further said, \nAllah's Messenger (ﷺ) went out and offered the Id prayer and then delivered the sermon.\" Ibn `Abbas did not \nmention anything about the Adhan (the call for prayer) or the Iqama. He added, \"Then the Prophet (ﷺ) \nwent to the women and instructed them and gave them religious advice and ordered them to give alms \nand I saw them reaching out (their hands to) their ears and necks (to take off the earrings and \nnecklaces, etc.) and throwing (it) towards Bilal. Then the Prophet (ﷺ) returned with Bilal to his house . \""}},{"id":183,"idInBook":183,"chapterId":67,"bookId":1,"arabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ عَاتَبَنِي أَبُو بَكْرٍ وَجَعَلَ يَطْعُنُنِي بِيَدِهِ فِي خَاصِرَتِي فَلاَ يَمْنَعُنِي مِنَ التَّحَرُّكِ إِلاَّ مَكَانُ رَسُولِ اللَّهِ صلى الله عليه وسلم وَرَأْسُهُ عَلَى فَخِذِي‏.‏","english":{"narrator":"Narrated `Aisha:","text":"Abu Bakr admonished me and poked me with his hands in the flank, and nothing stopped me from \nmoving at that time except the position of Allah's Messenger (ﷺ) whose head was on my thigh."}}],"chapter":{"id":67,"bookId":1,"arabic":"كتاب النكاح","english":"Wedlock, Marriage (Nikaah)"}}