{"metadata":{"length":14,"arabic":{"title":"رياض الصالحين","author":"الإمام يحيى بن شرف النووي","introduction":"كتاب الحج"},"english":{"title":"Riyad as-Salihin","author":"Imam Yahya ibn Sharaf al-Nawawi","introduction":"The Book of Hajj"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":10,"bookId":13,"arabic":"وعن ابن عمر رضي الله عنهما أن رسول الله صلى الله عليه وسلم قال‏:‏ بني الإسلام على خمس‏:‏ شهادة أن لا إله إلى الله وأن محمدًا رسول الله، وإقام الصلاة، وإيتاء الزكاة، وحج البيت، وصوم رمضان‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","english":{"narrator":"Ibn 'Umar (May Allah be pleased with them) reported:","text":"The Messenger of Allah (ﷺ) said, \"(The superstructure of) Islam is based on five (pillars), testifying the fact that La ilaha illallah wa anna Muhammad-ar-Rasul-ullah ."}},{"id":2,"idInBook":2,"chapterId":10,"bookId":13,"arabic":"وعن أبي هريرة رضي الله عنه قال‏:‏ خطبنا رسول الله صلى الله عليه وسلم فقال‏:‏ ‏\"‏يا أيها الناس إن الله قد فرض عليكم الحج فحجوا‏\"‏ فقال رجل‏:‏ أكل عام يا رسول الله‏؟‏ فسكت، حتى قالها ثلاثًا فقال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏لو قلت نعم لوجبت، ولما استطعتم‏\"‏ ثم قال‏:‏ ‏\"‏ذروني ما تركتكم، فإنما هلك من كان قبلكم بكثرة سؤالهم، واختلافهم على أنبيائهم، فإذا أمرتكم بشيء فأتوا منه ما استطعتم، وإذا نهيتكم عن شيء فدعوه‏\"‏‏.‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) delivered a Khutbah and said, \"O people! Hajj (pilgrimage to the House of Allah) has been made incumbent upon you, so perform Hajj.\" A man inquired: \"O Messenger of Allah, is it prescribed every year?\" He (ﷺ) remained silent till the man repeated it thrice. Then he (ﷺ) said, \"Had I replied in the affirmative, it would have surely become obligatory, and you would not have been able to fulfill it.\" Afterwards he said, \"Do not ask me so long as I do not impose anything upon you, because those who were before you were destroyed on account of their frequent questioning and their disagreement with their Prophets. So when I order you to do something, do it as far as you can; and when I forbid you from doing anything, eschew it.\"."}},{"id":3,"idInBook":3,"chapterId":10,"bookId":13,"arabic":"وعنه قال‏:‏ سئل النبي صلى الله عليه وسلم أي العمل أفضل‏؟‏ قال‏:‏ ‏\"‏إيمان بالله ورسوله‏\"‏ قيل‏:‏ ثم ماذا‏؟‏ قال‏:‏ ‏\"‏الجهاد في سبيل الله‏\"‏ قيل ثم ماذا‏؟‏ قال‏:‏ ‏\"‏حج مبرور‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏  \n‏\"‏المبرور‏\"‏ هو الذي لا يرتكب صاحبه فيه معصية‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Prophet (ﷺ) was asked: \"Which deed is the best?\" He (ﷺ) replied, \"Faith in Allah and His Messenger.\" Then he was asked: \"What is next?\" He replied, \"Jihad (holy fighting) in the Cause of Allah.\" Then he was asked, \"What is after that?\" He (ﷺ) replied, \"Hajj Mabrur (an accepted pilgrimage).\"."}},{"id":4,"idInBook":4,"chapterId":10,"bookId":13,"arabic":"وعنه قال سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ ‏\n\"‏من حج، فلم يرفث ولم يفسق، رجع كيوم ولدته أمه‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"Whoever performs Hajj (pilgrimage) and does not have sexual relations (with his wife), nor commits sin, nor disputes unjustly (during Hajj), then he returns from Hajj as pure and free from sins as on the day on which his mother gave birth to him.\"."}},{"id":5,"idInBook":5,"chapterId":10,"bookId":13,"arabic":"وعنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\n\"‏العمرة إلى العمرة كفارة لما بينهما، والحج المبرور ليس له جزاء إلا الجنة‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"(The performance of) 'Umrah is an expiation for the sins committed between it and the previous 'Umrah; and the reward of Hajj Mabrur (i.e., one accepted) is nothing but Jannah.\"."}},{"id":6,"idInBook":6,"chapterId":10,"bookId":13,"arabic":"وعن عائشة رضي الله عنها قالت‏:‏ قلت يا رسول الله نرى الجهاد أفضل العمل، أفلا نجاهد‏؟‏ فقال‏:‏ ‏:‏ ‏\n\"‏لَكُنّ أفضل الجهاد حج مبرور‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","english":{"narrator":"'Aishah (May Allah be pleased with her) reported:","text":"I said: \"O Messenger of Allah! We consider Jihad as the best deed, should we not then go for Jihad?\" The Messenger of Allah (ﷺ) said, \"The best Jihad for you women is Hajj Mabrur (i.e., one accepted by Allah).\"."}},{"id":7,"idInBook":7,"chapterId":10,"bookId":13,"arabic":"وعنها أن رسول الله صلى الله عليه وسلم، قال‏:‏ ‏\n\"‏ما من يوم أكثر من أن يعتق الله فيه عبدًا من النار من يوم عرفة‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"'Aishah (May Allah be pleased with her) reported:","text":"The Messenger of Allah (ﷺ) said, \"There is no day on which Allah sets free more slaves from Hell than He does on the Day of 'Arafah.\"."}},{"id":8,"idInBook":8,"chapterId":10,"bookId":13,"arabic":"وعن ابن عباس رضي الله عنهما، أن النبي صلى الله عليه وسلم قال‏:‏ ‏\n\"‏عمرة في رمضان تعدل عمرة أو حجة معي‏\"‏‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","english":{"narrator":"Ibn 'Abbas (May Allah be pleased with them) reported:","text":"The Prophet (ﷺ) said, \"(The performance of) 'Umrah during Ramadan is equal to Hajj (pilgrimage).\" Or said, \"Equal to the performance of Hajj with me.\"."}},{"id":9,"idInBook":9,"chapterId":10,"bookId":13,"arabic":"وعنه أن امرأة قالت‏:‏ يا رسول الله إن فريضة الله على عباده في الحج، أدركت أبي شيخًا كبيرًا، لا يثبت على الراحلة، أفأحج عنه‏؟‏ قال‏:‏ ‏\n\"‏نعم‏\"‏‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","english":{"narrator":"Ibn 'Abbas (May Allah be pleased with them) reported:","text":"A woman came to the Messenger of Allah (ﷺ) and said, \"Allah's obligation upon His slaves has become obligatory on my father in his old age. My father is very old and incapable of riding. May I perform Hajj on his behalf?\" He (ﷺ) said, \"Yes.\"."}},{"id":10,"idInBook":10,"chapterId":10,"bookId":13,"arabic":"وعن لقيط بن عامر رضي الله عنه أنه أتى النبي صلى الله عليه وسلم فقال‏:‏ إن أبي شيخ كبير لا يستطيع الحج ولا العمرة، ولا الظعن قال‏:‏ ‏\n\"‏حج عن أبيك واعتمر‏\"‏ ‏(‏‏(‏رواه أبو داود والترمذي وقال‏:‏ حديث حسن صحيح‏.‏ ‏)‏‏)‏‏.‏","english":{"narrator":"Laqit bin 'Amir (May Allah be pleased with him) reported:","text":"I came to the Prophet (ﷺ) and said: \"My father is a very old man and does not have strength to perform Hajj (pilgrimage) or 'Umrah or to undertake the journey.\" The Prophet (ﷺ) said, \"Perform Hajj and 'Umrah on behalf of your father.\"."}},{"id":11,"idInBook":11,"chapterId":10,"bookId":13,"arabic":"وعن السائب بن يزيد رضي الله عنه، قال‏:‏ حج بي مع رسول الله صلى الله عليه وسلم في حجة الوداع وأنا ابن سبع سنين‏.‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","english":{"narrator":"As-Sai'b bin Yazid (May Allah be pleased with him) reported:","text":"I was seven years old when I was taken to perform Hajj (pilgrimage). This was during the time the Messenger of Allah (ﷺ) performed the Hajjat-ul-Wada' (Farewell Pilgrimage).."}},{"id":12,"idInBook":12,"chapterId":10,"bookId":13,"arabic":"وعن ابن عباس رضي الله عنهما أن النبي صلى الله عليه وسلم لقي ركبا بالروحاء فقال‏:‏ ‏\"‏من القوم‏؟‏‏\"‏ قالوا‏:‏ المسلمون‏.‏ قالوا من أنت‏؟‏ قال‏:‏ ‏\"‏رسول الله‏\"‏ فرفعت امرأة صبيًا فقالت‏:‏ ألهذا حج‏؟‏ قال ‏\"‏نعم ولك أجر‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Ibn 'Abbas (May Allah be pleased with them) reported:","text":"The Prophet (ﷺ) came across a caravan at Ar-Rauha' and asked who the people in the caravan were. They replied that they were Muslims. They asked: \"Who are you?\" He (ﷺ) said, \"I am the Messenger of Allah.\" Then a woman lifted up a boy to him and asked: \"Would this child be credited with having performed the Hajj (pilgrimage)?\" Whereupon he (ﷺ) said, \"Yes, and you will have a reward.\"."}},{"id":13,"idInBook":13,"chapterId":10,"bookId":13,"arabic":"وعن أنس رضي الله عنه، أن رسول الله صلى الله عليه وسلم حج على رحل وكانت زاملته‏.‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","english":{"narrator":"Anas (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) performed the pilgrimage on an unsaddled camel which also carried his provisions (i.e., his Zamilah).."}},{"id":14,"idInBook":14,"chapterId":10,"bookId":13,"arabic":"وعن ابن عباس رضي الله عنهما قال‏:‏ كانت عكاظ ومجنة، وذو المجاز أسواقًا في الجاهلية، فتأثموا أن يتجروا في المواسم، فنزلت‏:‏ ‏{‏ليس عليكم جناح أن تبتغوا فضلا من ربكم‏}‏ ‏(‏‏(‏البقرة‏:‏ 198‏)‏‏)‏ في مواسم الحج‏.‏‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","english":{"narrator":"Ibn 'Abbas (May Allah be pleased with them) reported:","text":"Ukaz, Mijannah and Dhul-Majaz were markets during the pre-Islamic period. The Companions disliked trading there till the following Ayat of the Noble Qur'an were revealed: \"There is no sin on you if you seek the Bounty of your Rubb (during pilgrimage by trading)...\" (2:198)."}}],"chapter":{"id":10,"bookId":13,"arabic":"كتاب الحج","english":"The Book of Hajj"}}