{"metadata":{"length":11,"arabic":{"title":"رياض الصالحين","author":"الإمام يحيى بن شرف النووي","introduction":"كتاب الصلاة على رسول الله صلى الله عليه وسلم"},"english":{"title":"Riyad as-Salihin","author":"Imam Yahya ibn Sharaf al-Nawawi","introduction":"The Book of Supplicating Allah to Exalt the Mention of Allah's Messenger"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":14,"bookId":13,"arabic":"وعن عبد الله بن عمرو بن العاص، رضي الله عنهما أنه سمع رسول الله صلى الله عليه وسلم يقول‏:‏ ‏\n\"‏من صلى علي صلاة، صلى الله عليه بها عشرًا‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"'Abdullah bin 'Amr bin Al-'As (May Allah be pleased with them) reported:","text":"I heard the Messenger of Allah (ﷺ) saying: \"Whoever supplicates Allah to exalt my mention, Allah will exalt his mention ten times.\"."}},{"id":2,"idInBook":2,"chapterId":14,"bookId":13,"arabic":"وعن ابن مسعود رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ “أولى الناس بي يوم القيامة أكثرهم علي صلاة‏\"‏ رواه الترمذي وقال حديث حسن‏.‏","english":{"narrator":"Ibn Mas'ud (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said: \"The people who will be nearest to me on the Day of Resurrection will be those who supplicate Allah more often for me.\"."}},{"id":3,"idInBook":3,"chapterId":14,"bookId":13,"arabic":"وعن أوس بن أوس، رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏\"‏إن من أفضل أيامكم يوم الجمعة، فأكثروا على من الصلاة فيه، فإن صلاتكم معروضة علي‏\"‏ فقالوا‏:‏ يا رسول الله، كيف تعرض صلاتنا عليك وقد أرمت‏؟‏ قال‏:‏ يقول‏:‏ بلىت، قال‏:‏ ‏\"‏إن الله عز وجل حرم على الأرض أجساد الأنبياء‏\"‏ رواه أبو داود بإسناد صحيح‏.‏","english":{"narrator":"Aus bin Aus (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"Among the best of your days is Friday; so supplicate Allah more often for me in it , for your supplications will be displayed to me.\" He was asked: \"O Messenger of Allah! How will our blessings be displayed to you when your decayed body will have mixed with the earth?\" He (ﷺ) replied, \"Allah has prohibited the earth from consuming the bodies of the Prophets.\"."}},{"id":4,"idInBook":4,"chapterId":14,"bookId":13,"arabic":"وعن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏\n\"‏رغم أنف رجل ذكرت عنده فلم يصلِ علي‏\"‏ رواه الترمذي وقال حديث حسن‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"May his nose soil with dust in whose presence mention is made of me and he does not supplicate for me.\"."}},{"id":5,"idInBook":5,"chapterId":14,"bookId":13,"arabic":"وعنه رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏\n\"‏لا تجعلوا قبري عيدًا وصلوا علي، فإن صلاتكم تبلغني حيث كنتم‏\"‏ رواه أبو داود بإسناد صحيح‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"Do not make my grave a place of festivity, and supplicate Allah for me, for your supplication reaches me wherever you are.\"."}},{"id":6,"idInBook":6,"chapterId":14,"bookId":13,"arabic":"وعنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\n\"‏ما من أحد يسلم علي إلا رد الله علي روحي حتى أرد عليه السلام‏\"‏ ‏(‏‏(‏رواه أبو داود بإسناد صحيح‏)‏‏)‏‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"Whenever someone greets me, Allah returns the soul to my body (in the grave) and I return his greeting.\"."}},{"id":7,"idInBook":7,"chapterId":14,"bookId":13,"arabic":"وعن علي رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏\n\"‏ البخيل من ذكرت عنده، فلم يصلِ علي‏\"‏ ‏(‏‏(‏رواه الترمذي وقال‏:‏ حديث حسن صحيح‏)‏‏)‏‏.‏","english":{"narrator":"'Ali (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"The miser is the one in whose presence I am mentioned but he does not supplicate for me.\"."}},{"id":8,"idInBook":8,"chapterId":14,"bookId":13,"arabic":"وعن فضالة بن عبيد رضي الله عنه قال‏:‏ سمع رسول الله صلى الله عليه وسلم رجلا يدعو في صلاته لم يمجد الله تعالى، ولم يصلِ على النبي صلى الله عليه وسلم، فقال رسول الله صلى الله عليه وسلم ‏\"‏عجل هذا‏\"‏ ثم دعاه فقال له -أو لغيره‏:‏ إذا صلى أحدكم فليبدأ بتحميد ربه سبحانه، والثناء عليه، ثم يصلي على النبي صلى الله عليه وسلم ثم يدعو بعد ما شاء‏\"‏ رواه أبو داود والترمذي وقال حديث صحيح‏.‏","english":{"narrator":"Fadalah bin 'Ubaid (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) heard some one supplicating after his prayer without praising Allah and without supplicating Allah for the Prophet (ﷺ). With regard to him, the Messenger of Allah (ﷺ) said, \"This man rushed.\" Then he called him and said, \"When any one of you have performed Salat (prayer) and wants to supplicate, let him praise Allah first then glorify Him in the beginning and then he should supplicate Allah for me. Then he may supplicate for whatever he likes.\"."}},{"id":9,"idInBook":9,"chapterId":14,"bookId":13,"arabic":"وعن أبي محمد كعب بن عجرة رضي الله عنه قال‏:‏ خرج علينا النبي صلى الله عليه وسلم فقلنا‏:‏ يا رسول الله، قد علمنا كيف نسلم عليك، فكيف نصلي عليك‏؟‏ قال‏:‏ ‏\n\"‏قولوا‏:‏ اللهم صلِ على محمد، وعلى آل محمد، كما صليت على آل إبراهيم، إنك حميد مجيد‏.‏ اللهم بارك على محمد وعلى آل محمد، كما باركت على آل إبراهيم، إنك حميد مجيد‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","english":{"narrator":"Abu Muhammad Ka'b bin 'Ujrah (May Allah be pleased with him) reported:","text":"The Prophet (ﷺ) came to us and we asked him, \"O Messenger of Allah, we already know how to greet you (i.e., say As-salamu 'alaikum), but how should we supplicate for you?\" He (ﷺ) said, \"Say: 'Allahumma salli 'ala Muhammadin, wa 'ala 'ali Muhammadin, kama sallaita 'ala 'ali Ibrahima, innaka Hamidum Majid. Allahumma barik 'ala Muhammadin, wa 'ala 'ali Muhammadin, kama barakta 'ala 'ali Ibrahima, innaka Hamidum Majid ."}},{"id":10,"idInBook":10,"chapterId":14,"bookId":13,"arabic":"وعن أبي مسعود بن عبادة البدري، رضي الله عنه، قال‏:‏ أتانا رسول الله صلى الله عليه وسلم، ونحن في مجلس سعد بن عبادة رضي الله عنه، فقال له بشير بن سعد‏:‏ أمرنا الله تعالى أن نصلي عليك يا رسول الله، فكيف نصلي عليك‏؟‏ فسكت رسول الله صلى الله عليه وسلم، حتى تمنينا أنه لم يسأله، ثم قال رسول الله صلى الله عليه وسلم‏:‏ ‏\n\"‏قولوا اللهم صلِ على محمد وعلى آل محمد كما صليت على آل إبراهيم وبارك على محمد وعلى آل محمد كما باركت على آل إبراهيم إنك حميد مجيد، والسلام كما قد علمتم‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Abu Mas'ud Al-Badri (May Allah be pleased with him) reported:","text":"We were sitting in the company of Sa'd bin 'Ubadah (May Allah be pleased with him), when the Messenger of Allah (ﷺ) came to us. Bashir bin Sa'd said: \"O Messenger of Allah! Allah has commanded us to supplicate for you, but how should we do that?\" The Messenger of Allah (ﷺ) kept silent. We were much perturbed over his silence and we wished he did not asked him this question. The Messenger of Allah (ﷺ) said, \"Say: 'O Allah, exalt the mention of Muhammad and the family of Muhammad as you exalted the family of Ibrahim. And bless Muhammad and the family of Muhammad as You blessed the family of Ibrahim. You are the Praised, the Glorified,' and the method of greeting (i.e., Salam) is as you know.\"."}},{"id":11,"idInBook":11,"chapterId":14,"bookId":13,"arabic":"وعن أبي حميد الساعدي رضي الله عنه قال‏:‏ قالوا‏:‏ يا رسول الله كيف نصلي عليك‏؟‏ قال‏:‏ ‏\n\"‏قولوا‏:‏ اللهم صلِ على محمد، وعلى أزواجه وذريته، كما صليت على آل إبراهيم، وبارك على محمد، وعلى أزواجه وذريته، كما باركت على إبراهيم، إنك حميد مجيد‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","english":{"narrator":"Abu Humaid As-Sa'idi (May Allah be pleased with him) reported:","text":"The Companions of the Messenger of Allah (ﷺ) said: \"O Messenger of Allah! How should we supplicate for you?\" He (ﷺ) replied, \"Say: 'Allahumma salli 'ala Muhammadin wa 'ala azwajihi wa dhurriyyatihi, kama sallaita 'ala Ibrahima; wa barik 'ala Muhammadin wa 'ala azwajihi wa dhurriyyatihi, kama barakta 'ala Ibrahima, innaka Hamidum-Majid (O Allah sent Your Salat (O Allah, exalt the mention of Muhammad and his wives and offspring as You exalted the mention of the family of Ibrahim, and bless Muhammad and the wives and the offspring of Muhammad as you blessed the family of Ibrahim. You are the Praised, the Glorious'.\"."}}],"chapter":{"id":14,"bookId":13,"arabic":"كتاب الصلاة على رسول الله صلى الله عليه وسلم","english":"The Book of Supplicating Allah to Exalt the Mention of Allah's Messenger"}}