{"metadata":{"length":57,"arabic":{"title":"رياض الصالحين","author":"الإمام يحيى بن شرف النووي","introduction":"كتاب الأذكار"},"english":{"title":"Riyad as-Salihin","author":"Imam Yahya ibn Sharaf al-Nawawi","introduction":"The Book of the Remembrance of Allah"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":15,"bookId":13,"arabic":"وعن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏\n\"‏كلمتان خفيفتان على اللسان، ثقيلتان في الميزان، حبيبتان إلى الرحمن‏:‏ سبحان الله وبحمده، سبحان الله العظيم‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"There are two statements that are light for the tongue to remember, heavy in the Scales and are dear to the Merciful: 'Subhan-Allahi wa bihamdihi, Subhan-Allahil-Azim ."}},{"id":2,"idInBook":2,"chapterId":15,"bookId":13,"arabic":"وعنه رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ لأن أقول‏:‏ سبحان الله، والحمد لله، ولا إله إلا الله، والله أكبر، أحب إلي مما طلعت عليه الشمس” ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"The uttering of the words: \"Subhan-Allah (Allah is free from imperfection), Al-hamdu lillah (all praise is due to Allah), La ilaha illallah (there is no true god except Allah) and Allahu Akbar (Allah is the Greatest)' is dearer to me than anything over which the sun rises.\"."}},{"id":3,"idInBook":3,"chapterId":15,"bookId":13,"arabic":"وعنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\"‏من قال لا إله إلا الله وحده لا شريك له، له الملك، وله الحمد، وهو على كل شيء قدير، في يوم مائة مرة كانت له عدل عشر رقاب وكتبت له مائة حسنة، ومحيت عنه مائة سيئة، وكانت له حرزًا من الشيطان يومه ذلك حتى يمسي، ولم يأتِ أحد بأفضل مما جاء به إلا رجل عمل أكثر منه‏\"‏ وقال‏:‏ ‏\"‏من قال سبحان الله وبحمده، في يوم مائة مرة حطت عنه خطاياه وإن كانت مثل زبد البحر‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"He who utters a hundred times in a day these words: 'La ilaha illallahu, wahdahu la sharika lahu, lahul-mulku wa lahul-hamdu, wa Huwa 'ala kulli sha'in Qadir (there is no true god except Allah. He is One and He has no partner with Him; His is the sovereignty and His is the praise, and He is Omnipotent),' he will have a reward equivalent to that for emancipating ten slaves, a hundred good deeds will be recorded to his credit, hundred of his sins will be blotted out from his scroll, and he will be safeguarded against the devil on that day till the evening; and no one will exceed him in doing more excellent good deeds except someone who has recited these words more often than him. And he who utters: 'Subhan-Allahi wa bihamdihi (Allah is free from imperfection and His is the praise)' one hundred times a day, his sins will be obliterated even if they are equal to the extent of the foam of the ocean.\"."}},{"id":4,"idInBook":4,"chapterId":15,"bookId":13,"arabic":"وعن أبي أيوب الأنصاري رضي الله عنه عن النبي صلى الله عليه وسلم قال‏:‏ ‏\n\"‏من قال لا إله إلا الله وحده لا شريك له، له الملك وله الحمد، وهو على كل شيء قدير، عشر مرات، كان كمن أعتق أربعة أنفس من ولد إسماعيل‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","english":{"narrator":"Abu Ayyub Al-Ansari (May Allah be pleased with him) reported:","text":"The Prophet (ﷺ) said: \"He who utters ten times: 'La ilaha illallahu, wahdahu la sharika lahu, lahulmulku wa lahulhamdu, wa Huwa 'ala kulli sha'in Qadir (there is no true god except Allah. He is One and He has no partner with Him. His is the sovereignty and His is the praise, and He is Omnipotent),' he will have a reward equal to that for freeing four slaves from the progeny of Prophet Isma'il.\"."}},{"id":5,"idInBook":5,"chapterId":15,"bookId":13,"arabic":"وعن أبي ذر رضي الله عنه قال‏:‏ قال لي رسول صلى الله عليه وسلم‏:‏ ‏\n\"‏ألا أخبرك بأحب الكلام إلى الله‏؟‏ إن أحب الكلام إلى الله‏:‏ سبحان الله وبحمده‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Abu Dharr (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said to me, \"Shall I tell you the expression that is most loved by Allah?\" It is 'Subhan-Allahi wa bihamdihi' (Allah is free from imperfection and His is the praise)'.\"."}},{"id":6,"idInBook":6,"chapterId":15,"bookId":13,"arabic":"وعن أبي مالك الأشعري رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏\n\"‏الطهور شطر الإيمان، والحمد لله تملأ الميزان، وسبحان الله، والحمد لله تملآن -أو تملأ- ما بين السماوات والأرض‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Abu Malik Al-Ash'ari (may Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said: \"Purity is half of iman (faith). ‘Al-hamdu lillah (all praise and gratitude belong to Allah)’ fills the scales, and ‘subhan-Allah (how far is Allah from every imperfection) and ‘Al-hamdulillah (all praise and gratitude belong to Allah)’ fill that which is between heaven and earth.\"\n."}},{"id":7,"idInBook":7,"chapterId":15,"bookId":13,"arabic":"وعن سعد بن أبي وقاص رضي الله عنه قال‏:‏ جاء أعرابي إلى رسول الله صلى الله عليه وسلم فقال‏:‏ علمني كلامًا أقوله‏.‏ قال‏:‏ ‏\"‏قل لا إله إلا الله وحده لا شريك له، الله أكبر كبيرا والحمد لله كثيرا وسبحان الله رب العالمين، ولا حول ولا قوة إلا بالله العزيز الحكيم” قال فهؤلاء لربي، فما لي‏؟‏ قال‏:‏ ‏\"‏قل اللهم اغفر لي، وارحمني، واهدني، وارزقني‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Sa'd bin Abu Waqqas (May Allah be pleased with him) reported:","text":"A bedouin came to the Messenger of Allah (ﷺ) and said to him, \"Teach me a few words to recite frequently.\" He (ﷺ) said, \"Say: \"La ilaha illallahu wahdahu la sharika lahu; Allahu Akbar kabiran, wal-hamdu lillahi kathiran, wa subhan-Allahi Rabbil-'alamin; wa la hawla wa la quwwata illa billahil-'Azizil-Hakim (there is no true god except Allah the One and He has no partner with Him; Allah is the Greatest and greatness is for Him. All praise is due to Him. Allah, the Rubb of the worlds is free from imperfection; there is no might and power but that of Allah, the All-Powerful and the All-Wise.)\"' The bedouin said: \"All of these for my Rubb. But what is for me?\" Thereupon he (Messenger of Allah (ﷺ)) said, \"You should say: 'Allahummaghfir li, warhamni, wahdini, warzuqni (O Allah! Grant me pardon, have mercy upon me, direct me to righteousness and provide me subsistence)'.\"."}},{"id":8,"idInBook":8,"chapterId":15,"bookId":13,"arabic":"وعن ثوبان رضي الله عنه قال‏:‏ كان رسول الله صلى الله عليه وسلم‏:‏ إذا انصرف من صلاته استغفر ثلاثا ، وقال ‏:‏ ‏\n\"‏ اللهم أنت السلام ومنك السلام تباركت يا ذا الجلال والإكرام “ قيل للأوزاعي ، وهو أحد رواة الحديث ‏:‏ كيف الاستغفار ‏؟‏ قال ‏:‏ يقول ‏:‏ أستغفر الله أستغفر الله ‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Thauban (May Allah be pleased with him) reported:","text":"Whenever the Messenger of Allah (ﷺ) concluded his prayer, he would beg forgiveness from Allah thrice and then would recite: \"Allahumma Antas- Salamu, wa minkas-salamu, tabarakta ya Dhal-Jalali wal-Ikram (O Allah, You are the Grantor of security, and security comes from You. You are Blessing, O You Who have majesty and nobility)!\" (Imam) Al-Awza'i, one of the narrators of this Hadith, was asked: \"How forgiveness is to be sought?\" He answered: \"The Messenger of Allah (ﷺ) used to say: 'Astaghfirullah! Astaghfirullah! (I beseech Allah for forgiveness, I beseech Allah for forgiveness)'.\"."}},{"id":9,"idInBook":9,"chapterId":15,"bookId":13,"arabic":"وعن المغيرة بن شعبة رضي الله عنه أن رسول الله صلى الله عليه وسلم، كان إذا فرغ من الصلاة وسلم قال ‏:‏ ‏\n\"‏لا إله إلا الله وحده لا شريك له، له الملك وله الحمد، وهو على كل شيء قدير‏.‏ اللهم لا مانع لما أعطيت، ولا معطي لما منعت، ولا ينفع ذا الجد منك الجد‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","english":{"narrator":"Al-Mughirah bin Shu'bah (May Allah be pleased with him) reported:","text":"Messenger of Allah (ﷺ) used to say at the conclusion of prayer: \"La ilaha illallahu wahdahu la sharika lahu, lahul-mulku, wa lahul-hamdu, wa Huwa 'ala kulli shai'in Qadir. Allahumma la mani'a lima a'tayta, wa la mu'tiya lima mana'ta, wa la yanfa'u dhal-jaddi, minkal-jaddu (there is no true god except Allah. He is One and He has no partner with Him, His is the sovereignty and His is the praise, and He is Omnipotent. O Allah! None can deny that which You bestow and none can bestow that which You hold back; and the greatness of the great will be of no avail to them against You).\"."}},{"id":10,"idInBook":10,"chapterId":15,"bookId":13,"arabic":"وعن عبد الله ابن الزبير رضي الله عنهما أنه كان يقول دبر كل صلاة، حين يسلم‏:‏ لا إله إلا الله وحده لا شريك له ، له الملك وله الحمد ، وهو على كل شيء قدير ‏.‏ لا حول ولا قوة إلا بالله ،لا إله إلا الله، ولا نعبد إلا إياه، له النعمة، وله الفضل وله الثناء الحسن‏.‏ لا إله إلا الله مخلصين له الدين ولو كره الكافرون ‏.‏ قال ابن الزبير‏:‏ وكان رسول الله صلى الله عليه وسلم، يهلل بهن دبر كل صلاة‏.‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"It has been reported that 'Abdullah bin Zubair (May Allah be pleased with them) used to recite after Taslim at the conclusion of every Salat (prayer):","text":"\"La ilaha illallahu wahdahu la sharika lahu, lahul- mulku, wa lahul-hamdu, wa Huwa 'ala kulli shai'in Qadir. La hawla wa la quwwata illa billah. La ilaha illallahu, wa la na'budu illa iyyahu, Lahun-ni'matu, wa lahul-fadlu, wa lahuth-thana'ul-hasan. La ilaha ilallahu, mukhlisina, lahud-dina, wa lau karihal-kafirun (there is no true god except Allah; He is One. To Him belongs the dominion and to Him is all praise, and He is Powerful over all things. There is no power and might except with (the help of) Allah. There is no God but Allah and we worship none except Him, to Him belongs the bounty and to Him belongs the grace, and to Him belongs all excellent praise; there is no deity but Allah. We reserve our devotion exclusively for Him though the disbelievers may detest it).\" Ibn Az-Zubair said: The Messenger of Allah (ﷺ) used to celebrate Allah's Greatness in those terms after every Salat (prayer).."}},{"id":11,"idInBook":11,"chapterId":15,"bookId":13,"arabic":"وعن أبي هريرة رضي الله عنه أن فقراء المهاجرين أتوا رسول الله صلى الله عليه وسلم فقالوا‏:‏ ‏\"‏ذهب أهل الدثور بالدرجات العلى، والنعيم المقيم‏:‏ يصلون كما نصلي، ويصومون كما نصوم، ولهم فضل من أموال‏:‏ يحجون، ويعتمرون، ويجاهدون، ويتصدقون‏.‏ فقال‏:‏ ‏\"‏ألا أعلمكم شيئًا تدركون به من سبقكم، وتسبقون به من بعدكم، ولا يكون أحد أفضل منكم إلا من صنع مثل ما صنعتم‏؟‏ قالوا‏:‏ بلى يا رسول الله، قال‏:‏ ‏\"‏تسبحون، وتحمدون، وتكبرون، خلف كل صلاة ثلاثًا وثلاثين قال أبو صالح الراوي عن أبي هريرة، لما سئل عن كيفية ذكرهن، قال‏:‏ يقول‏:‏ سبحان الله، والحمد لله، والله أكبر، حتى يكون منهن كلهن ثلاثًا وثلاثين‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏ \nوزاد مسلم في روايته‏:‏ فرجع فقراء المهاجرين إلى رسول الله صلى الله عليه وسلم، فقالوا‏:‏ سمع إخواننا أهل الأموال بما فعلنا، وفعلوا مثله‏؟‏ فقال رسول الله‏:‏ ‏\"‏ذلك فضل الله يؤتيه من يشاء‏\"‏‏.‏\n((الدثور))جمع دثر- بفتح الدال و اسكان الثاء المثلثة- و هو: المال الكثير.","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The poor Emigrants came to the Messenger of Allah (ﷺ) and said: \"The wealthy have gone with the highest ranks and lasting bliss.\" He asked: \"How is that?\" They replied: \"They offer Salat (prayer) as we offer it; they observe fast as we do; (and as they are wealthy) they perform Hajj and 'Umrah, and go for Jihad, and they spend in charity but we cannot, and they free the slaves but we are unable to do so.\" The Messenger of Allah (ﷺ) said, \"Shall I not teach you something with which you may overtake those who surpassed you and with which you will surpass those who will come after you? None will excel you unless he who does which you do.\" They said: \"Yes, please do, O Messenger of Allah\" He (ﷺ) said, \"You should recite: Tasbih (Allah is free from imperfection), Takbir (Allah is Greatest), Tahmid (Praise be to Allah) thirty-three times after each Salat.\".Abu Salih, the subnarrator of the Hadith said, when Abu Hurairah (May Allah be pleased with him) was asked about the manner of reciting Tasbih, Tahmid and Takbir, he said, \"Recite: \"Subhan-Allah, wal-hamdulillah, wallahu Akbar', till all are recited thirty-three times."}},{"id":12,"idInBook":12,"chapterId":15,"bookId":13,"arabic":"وعنه عن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\"‏من سبح الله في دبر كل صلاة ثلاثًا وثلاثين، وحمد الله ثلاثًا وثلاثين، وكبر الله ثلاثًا وثلاثين، وقال تمام المائة‏:‏ لا إله إلا الله وحده لا شريك له، له الملك وله الحمد، وهو على كل شيء قدير، غفرت خطاياه وإن كانت مثل زبد البحر” ‏(‏‏(‏رواه مسلم‏)‏‏)‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"He who recites after every prayer: Subhan-Allah (Allah is free from imperfection) thirty-three times; Al-hamdu lillah (praise be to Allah) thirty-three times; Allahu Akbar (Allah is Greatest) thirty-three times; and completes the hundred with: La ilaha illallahu, wahdahu la sharika lahu, lahul-mulku wa lahul-hamdu, wa Huwa 'ala kulli shai'in Qadir (there is no true god except Allah. He is One and He has no partner with Him. His is the sovereignty and His is the praise, and He is Omnipotent), will have all his sins pardoned even if they may be as large as the foam on the surface of the sea.\"."}},{"id":13,"idInBook":13,"chapterId":15,"bookId":13,"arabic":"وعن كعب بن عجرة رضي الله عنه عن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\n\"‏معقبات لا يخيب قائلهن -أو فاعلهن- دبر كل صلاة مكتوبة‏:‏ ثلاثًا وثلاثين تسبيحة وثلاثًا وثلاثين تحميدة، وأربعًا وثلاثين تكبيرة‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Ka'b bin 'Ujrah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"There are some words, the reciters of which will never be disappointed. These are: Tasbih "}},{"id":14,"idInBook":14,"chapterId":15,"bookId":13,"arabic":"وعن سعد بن أبي وقاص رضي الله عنه أن رسول الله صلى الله عليه وسلم كان يتعوذ دبر الصلوات بهؤلاء الكلمات‏:‏ ‏\"‏اللهم إني أعوذ بك من الجبن والبخل، وأعوذ بك من أن أرد إلى أرذل العمر وأعوذ بك من فتنة الدنيا، وأعوذ بك من فتنة القبر” ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","english":{"narrator":"Sa'd bin Abu Waqqas (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) used to seek (Allah's) protection after prayers in these words: \"Alla-humma inni a'udhu bika minal-jubni wal- bukhl, wa a'udhu bika min an uradda ila ardhalil-'umur, wa a'udhu bika min fitnatid-dunya, wa a'udhu bika min fitnatil-qabr (O Allah, I seek refuge with You from cowardice, miserliness and from being sent back to a feeble age; and, seek refuge with You from the trials of this life and those of the grave).\"."}},{"id":15,"idInBook":15,"chapterId":15,"bookId":13,"arabic":"وعن معاذ رضي الله عنه أن رسول الله صلى الله عليه وسلم أخذ بيده وقال‏:‏ ‏\"‏يا معاذ والله إني لأحبك‏\"‏ فقال‏:‏ ‏\"‏أوصيك يا معاذ لا تدعن في دبر كل صلاة تقول‏:‏ اللهم أعني على ذكرك، وشكرك، وحسن عبادتك‏\"‏‏.‏ رواه أبو داود بإسناد صحيح‏.‏","english":{"narrator":"Mu'adh (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) took hold of my hand and said, \"O Mu'adh! By Allah I love you, so I advise you to never forget to recite after every prayer: \"Allahumma a'inni ala dhikrika, wa shukrika, wa husni 'ibadatika (O Allah, help me remember You, to be grateful to You, and to worship You in an excellent manner).\"."}},{"id":16,"idInBook":16,"chapterId":15,"bookId":13,"arabic":"وعن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\n\"‏إذا تشهد أحدكم فليستعذ بالله من أربع، يقول‏:‏ اللهم إني أعوذ بك من عذاب جهنم، ومن عذاب القبر ومن فتنة المحيا والممات، ومن شر فتنة المسيح الدجال‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"When anyone of you has done his Tashahhud during Salat (prayer), he should seek refuge in Allah against four things and say: \"Allahumma inni a'udhu bika min 'adhabi jahannam, wa min 'adhabil-qabr, wa min fitnatil-mahya wal-mamat, wa min sharri fitnatil-masihid-dajjal (O Allah! I seek refuge in You from the torment of Hell, from the torment of the grave, from the trials of life and death, and from the mischief of Al-Masih Ad-Dajjal (Antichrist).\"."}},{"id":17,"idInBook":17,"chapterId":15,"bookId":13,"arabic":"وعن علي رضي الله عنه قال‏:‏ كان رسول الله صلى الله عليه وسلم إذا قام إلى الصلاة يكون من آخر ما يقول بين التشهد والتسليم‏:‏ ‏\n\"‏اللهم اغفر لي ما قدمت وما أخرت، وما أسررت وما أعلنت، وما أسرفت، وما أنت أعلم به مني، أنت المقدم، وأنت المؤخر، لا إله إلا أنت‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"'Ali (May Allah be pleased with him) reported:","text":"When the Messenger of Allah (ﷺ) was in Salat (prayer), he used to supplicate towards the end of prayer after Tashahhud and before the concluding salutations: \"Allahum-maghfir li ma qaddamtu wa ma akh-khartu, wa ma asrartu, wa ma a'lantu, wa ma asraftu, wa ma Anta a'lamu bihi minni. Antal-Muqqadimu, wa Antal-Mu'akh-khiru. La ilaha illa Anta (O Allah! Forgive my former and latter sins, which I have done secretly and those which I have done openly, and that I have wronged others, and those defaults of mine about which You have better knowledge than I have. You Alone can send whomever You will to Jannah, and You Alone can send whomever You will to Hell-fire. None has the right to be worshipped but You.\"."}},{"id":18,"idInBook":18,"chapterId":15,"bookId":13,"arabic":"وعن عائشة رضي الله عنه قالت‏:‏ كان النبي صلى الله عليه وسلم يكثر أن يقول في ركوعه وسجوده‏:‏ سبحانك اللهم ربنا وبحمدك، اللهم اغفر لي‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","english":{"narrator":"'Aishah (May Allah be pleased with her) reported:","text":"The Prophet (ﷺ) used to recite frequently in his bowing and prostration: \"Subhanak- Allahumma, Rabbana wa bihamdika. Allahum-maghfir li (O Allah! You are free from imperfection and I begin with praising You. Forgive my sins).\"."}},{"id":19,"idInBook":19,"chapterId":15,"bookId":13,"arabic":"وعنها أن رسول الله صلى الله عليه وسلم كان يقول في ركوعه وسجوده‏:‏ ‏\n\"‏سبوح قدوس رب الملائكة والروح‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"'Aishah (May Allah be pleased with her) reported:","text":"The Messenger of Allah (ﷺ) used to recite in his bowing and prostration: \"Subbuhun Quddusun, Rabbul-mala'ikati war-ruh ."}},{"id":20,"idInBook":20,"chapterId":15,"bookId":13,"arabic":"وعن ابن عباس رضي الله عنهما أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\n\"‏ فأما الركوع فعظموا فيه الرب، وأما السجود فاجتهدوا في الدعاء، فقمن أن يستجاب لكم‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Ibn 'Abbas (May Allah be pleased with them) reported:","text":"The Messenger of Allah (ﷺ) said: \"Glorify your Lord in Ruku' (bowing posture) and exert yourself in supplication in prostration. Thus your supplications are liable to be accepted.\"."}},{"id":21,"idInBook":21,"chapterId":15,"bookId":13,"arabic":"وعن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\n\"‏أقرب ما يكون العبد من ربه وهو ساجد، فأكثروا الدعاء‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"A slave becomes nearest to his Rubb when he is in prostration. So increase supplications while prostrating.\"."}},{"id":22,"idInBook":22,"chapterId":15,"bookId":13,"arabic":"وعنه أن رسول الله صلى الله عليه وسلم كان يقول في سجوده‏:‏ “اللهم اغفر لي ذنبي كله دقه وجله، وأوله وآخره، وعلانيته وسره‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) used to say in his prostration: Allahum-maghfir li dhanbi kullahu: diqqahu wa jillahu, wa 'awwalahu wa akhirahu, wa alaniyatahu wa sirrahu (O Allah! Forgive all my sins, the small and the great, first and the last, the open and the secret).\"."}},{"id":23,"idInBook":23,"chapterId":15,"bookId":13,"arabic":"وعن عائشة رضي الله عنها قالت‏:‏ افتقدت النبي صلى الله عليه وسلم ذات ليلة فتحسست، فإذا هو راكع‏.‏-أو ساجد- يقول‏:‏ ‏\"‏سبحانك وبحمدك لا إله إلا أنت‏\"‏ ، وفي رواية‏:‏ فوقعت يدي على بطن قدميه، وهو في المسجد، وهما منصوبتان، وهو يقول‏:‏ ‏\"‏اللهم إني أعوذ برضاك من سخطك، وبمعافاتك من عقوبتك، وأعوذ بك منك، لا أحصي ثناء عليك أنت كما أثنيت على نفسك‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"'Aishah (May Allah be pleased with her) reported:","text":"One night I missed the Messenger of Allah (ﷺ) from his bed. I searched for him. When I found him he was in bowing or prostrating posture and was reciting: Subhanaka wa bi hamdika. La ilaha illa Anta (You are free from imperfection and I begin praising You. There is no true god except You).\"Another narration is: My hand fell over his feet while he was in prostration with his feet erect. He was supplicating: \"Allahumma inni a'udhu biridaka min sakhatika, wa bi-mu'afatika min 'uqubatika, wa a'udhu bika minka, la uhsi thana'an 'alaika, Anta kama athnaita 'ala Nafsika (O Allah! I seek protection against Your Wrath in Your Pleasure. I seek protection in Your Pardon against Your chastisement, I am not capable of enumerating praise of You. You are as You have lauded Yourself).\""}},{"id":24,"idInBook":24,"chapterId":15,"bookId":13,"arabic":"وعن سعد بن أبي وقاص رضي الله عنه قال‏:‏ كنا عند رسول الله صلى الله عليه وسلم فقال‏:‏ ‏\"‏أيعجز أحدكم أن يكسب في كل يوم ألف حسنة‏!‏‏\"‏ فسأله سائل من جلسائه‏:‏ كيف يكسب ألف حسنة‏؟‏ قال‏:‏ ‏\"‏يسبح مائة تسبيحة، فيكتب له ألف حسنة، أو يحط عنه ألف خطيئة‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.\nقال الحميدي: كذا هو في كتاب مسلم : ((او يحط)) قال البرقاني: ورواه شعبة و ابو عوانة, و يحيى القطان, عن موسى الذي رواه مسلم من جهته فقالوا:((و يحط)) بغير الف.","english":{"narrator":"Sa'd bin Abu Waqqas (May Allah be pleased with him) reported:","text":"We were with the Messenger of Allah (ﷺ) when he asked, \"Is anyone of you unable to earn a thousand good deeds?\" One of those present asked: \"How can one earn thousand good deeds in a day?\" He (ﷺ) replied, \"By saying: Subhan Allah a hundred times, then one thousand good deeds will be recorded for him or one thousand sins will be blotted out from his record.\"."}},{"id":25,"idInBook":25,"chapterId":15,"bookId":13,"arabic":"وعن أبي ذر رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ “يصبح على كل سلامى من أحدكم صدقة‏:‏ فكل تسبيحة صدقة، وكل تحميدة صدقة، وكل تهليلة صدقة، وكل تكبيرة صدقة، وأمر بالمعروف صدقة، ونهي عن المنكر صدقة، ويجزي من ذلك ركعتان يركعهما من الضحى‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Abu Dharr (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"Every morning charity is due from every joint bone of the body of every one of you. Every utterance of Allah's Glorification (i.e., Subhan-Allah) is an act of charity, and every utterance of praise of Him (i.e., Al-hamdu lillah) is an act of charity, and every utterance of profession of Faith (i.e., La ilaha illallah) is an act of charity, and every utterance of His Greatness (i.e., Allahu Akbar) is an act of charity; and enjoining good is an act of charity and forbidding what is disreputable is an act of charity; and two Rak'ah prayer which one offers in the forenoon (Ad- Duha) will suffice for all this.\"."}},{"id":26,"idInBook":26,"chapterId":15,"bookId":13,"arabic":"وعن أم المؤمنيين جويرية بنت الحارث رضي الله عنها أن النبي صلى الله عليه وسلم خرج من عندها بكرة حين صلى الصبح وهي في مسجدها، ثم رجع بعد أن أضحي وهي جالسة، فقال‏:‏ ‏\"‏مازلت على الحالة التي فارقت عليها‏؟‏‏\"‏ قالت‏:‏ نعم، فقال النبي صلى الله عليه وسلم‏:‏ ‏\"‏لقد كنت بعدك أربع كلمات ثلاث مرات، لو وزنت بما قلت منذ اليوم لوزنتهن‏:‏ سبحان الله وبحمده عدد خلقه، ورضا نفسه، وزنة عرشه، ومداد كلماته‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏ \nوفي رواية له‏:‏ سبحان الله عدد خلقه، سبحان الله رضا نفسه، سبحان الله زنة عرشه، سبحان الله مداد كلماته‏\"‏‏.‏\nوفي رواية الترمذي‏:‏ ألا أعلمك كلمات تقولينها‏؟‏ سبحان الله عدد خلقه، سبحان الله عدد خلقه، سبحان الله عدد خلقه، سبحان الله رضا نفسه، سبحان الله رضا نفسه، سبحان الله رضا نفسه، سبحان الله زنة عرشه، سبحان الله زنة عرشه، سبحان الله زنة عرشه، سبحان الله مداد كلماته، سبحان الله مداد كلماته، سبحان الله مداد كلماته‏\"‏‏.‏","english":{"narrator":"Juwairiyah bint Al-Harith (May Allah be pleased with her), the Mother of the Believers, reported:","text":"The Prophet (ﷺ) came out from my apartment in the morning as I was busy in performing the dawn prayer. He came back in the forenoon and found me sitting there. The Prophet (ﷺ) said, \"Are you still in the same position as I left you.\" I replied in the affirmative. Thereupon the Prophet said, \"I recited four words three times after I had left you. If these are to be weighed against all you have recited since morning, these will be heavier. These are: Subhan-Allahi wa bihamdihi, `adada khalqihi, wa rida nafsihi, wa zinatah `arshihi, wa midada kalimatihi ."}},{"id":27,"idInBook":27,"chapterId":15,"bookId":13,"arabic":"وعن أبي موسى الأشعري رضي الله عنه عن النبي صلى الله عليه وسلم، قال‏:‏ ‏\"‏مثل الذي يذكر ربه والذي لا يذكره، مثل الحي والميت‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏ \nورواه مسلم فقال‏:‏ ‏\"‏مثل البيت الذي يذكر الله فيه، والبيت الذي لا يذكر الله فيه، مثل الحي والميت‏\"‏‏.‏","english":{"narrator":"Abu Musa Al-Ash'ari (May Allah be pleased with him) reported:","text":"The Prophet (ﷺ) said, \"The similitude of one who remembers his Rubb and one who does not remember Him, is like that of the living and the dead.\"."}},{"id":28,"idInBook":28,"chapterId":15,"bookId":13,"arabic":"وعن أبي هريرة، رضي الله عنه، أن رسول الله صلى الله عليه وسلم، قال‏:‏ ‏\n\"‏يقول الله تعالى‏:‏ أنا عند ظن عبدي بي، وأنا معه إذا ذكرني، فإن ذكرني في نفسه، ذكرته في نفسي وإن ذكرني في ملإٍ ذكرته في ملإٍ خير منهم‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"Allah the Exalted says: 'I am as my slave expects me to be, and I am with him when he remembers Me. If he remembers Me inwardly, I will remember him inwardly, and if he remembers Me in an assembly, I will remember him in a better assembly (i.e., in the assembly of angels).\"."}},{"id":29,"idInBook":29,"chapterId":15,"bookId":13,"arabic":"وعنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏\"‏سبق المفردون‏\"‏ قالوا‏:‏ وما المفردون يا رسول الله‏؟‏ قال‏:‏ ‏\"‏الذاكرون الله كثيرًا والذكرات‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏ وروي : (( المفردون )) بتشديد الراء وتخفيفها والمشهور الذي قاله الجمهور : التشديد.","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"The Mufarridun have gone ahead.\" He was asked, \"Who are the Mufarridun?\" He (ﷺ) replied, \"Those men and women who frequently celebrate the remembrance of Allah.\"."}},{"id":30,"idInBook":30,"chapterId":15,"bookId":13,"arabic":"وعن جابر رضي الله عنه قال‏:‏ سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ ‏\n\"‏أفضل الذكر‏:‏ لا إله إلا الله‏\"‏‏.‏ رواه الترمذي وقال حديث حسن‏.‏","english":{"narrator":"Jabir (May Allah be pleased with him) reported:","text":"I heard the Messenger of Allah (ﷺ) saying, \"The best way to celebrate the remembrance of Allah is to say: La ilaha illallah (there is no true god except Allah).\"."}},{"id":31,"idInBook":31,"chapterId":15,"bookId":13,"arabic":"وعن عبد الله بن بشر رضي الله عنه أن رجلا قال‏:‏ يا رسول الله، إن شرائع الإسلام قد كثرت علي، فأخبرني بشيء أتشبث به قال‏:‏ ‏\n\"‏لا يزال لسانك رطبًا من ذكر الله‏\"‏‏.‏ رواه الترمذي وقال حديث حسن‏.‏","english":{"narrator":"'Abdullah bin Busr (May Allah be pleased with him) reported:","text":"One of the Companions said, \"O Messenger of Allah. There are many injunctions of Islam for me. So tell me something to which I may hold fast.\" He said, \"Keep your tongue wet with the remembrance of Allah.\"."}},{"id":32,"idInBook":32,"chapterId":15,"bookId":13,"arabic":"وعن جابر رضي الله عنه، عن النبي صلى الله عليه وسلم قال‏:‏ ‏\n\"‏من قال‏:‏ سبحان الله وبحمده، غرست له نخلة في الجنة‏\"‏‏.‏ رواه الترمذي وقال حديث حسن‏.‏","english":{"narrator":"Jabir (May Allah be pleased with him) reported:","text":"The Prophet (ﷺ) said, \"For him who says: 'Subhan-Allahi wa bi hamdihi (Allah is free from imperfection, and I begin with praising Him, and to Him),' a palm-tree will be planted in Jannah.\"."}},{"id":33,"idInBook":33,"chapterId":15,"bookId":13,"arabic":"وعن ابن مسعود رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏\n\"‏لقيت إبراهيم صلى الله عليه وسلم ليلة أسري بي، فقال‏:‏ يا محمد أقرئ أمتك مني السلام، وأخبرهم أن الجنة طيبة التربة، عذبة الماء، وأنها قيعان، وأن غراسها‏:‏ سبحان الله، والحمد لله، ولا إله إلا الله، والله أكبر‏\"‏‏.‏ رواه الترمذي وقال حديث حسن‏.‏","english":{"narrator":"Ibn Mas'ud (May Allah be pleased with him) reported:","text":"Messenger of Allah (ﷺ) said, \"I met Ibrahim (ﷺ) on the Night of Ascension (Al-Asra), and he said to me: 'O Muhammad, convey my greetings to your Ummah, and tell them that Jannah has a vast plain of pure soil and sweet water. It is a plain levelled land. The plants grow there by uttering: Subhan-Allah, Al-hamdu lillah, La ilaha illallah and Allahu Akbar (Allah is free from imperfection; praise be to Allah; there is no true god except Allah; and Allah is Greatest).\"."}},{"id":34,"idInBook":34,"chapterId":15,"bookId":13,"arabic":"وعن أبي الدرداء، رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏\"‏ألا أنبئكم بخير أعمالكم، وأزكاها عند مليككم، وأرفعها في درجاتكم، وخير لكم من إنفاق الذهب والفضة وخير لكم من أن تلقوا عدوكم فتضربوا أعناقهم، ويضربوا أعناقكم‏؟‏‏\"‏ قالوا‏:‏ بلى، قال‏:‏ ‏\"‏ذكر الله تعالى‏\"‏‏.‏ رواه الترمذي وقال الحاكم أبو عبد الله إسناده صحيح‏.‏","english":{"narrator":"Abud-Darda (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"Shall I not inform you of the best of your actions which are the purest to your Rubb, which exalt you to the high ranks, which are more efficacious than spending gold and silver (in charity), and better for you than you should encounter your enemies whom you will smite their necks and they will smite your necks?\" They said, \"Certainly.\" He (ﷺ) said, \"Remembrance of Allah the Exalted.\"."}},{"id":35,"idInBook":35,"chapterId":15,"bookId":13,"arabic":"وعن سعد بن أبي وقاص رضي الله عنه أنه دخل مع رسول الله صلى الله عليه وسلم على امرأة وبين يديها نوى -أو حصى- تسبح به فقال‏:‏ ‏\"‏أخبرك بما هو أيسر عليك من هذا - أو أفضل‏\"‏ فقال‏:‏ ‏\"‏سبحان الله عدد ما خلق في السماء، وسبحان الله عدد ما خلق في الأرض، وسبحان الله عدد ما بين ذلك، وسبحان الله عدد ما هو خالق، والله أكبر مثل ذلك، والحمد لله مثل ذلك، ولا إله إلا الله مثل ذلك، ولا حول ولا قوة إلا بالله مثل ذلك‏\"‏‏.‏ ‏(‏‏(‏رواه الترمذي وقال‏:‏ حديث حسن‏)‏‏)‏‏.‏","english":{"narrator":"Sa'd bin Abu Waqqas (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) and I went to see a woman. She had date- stones or pebbles in front of her, and she was counting and reciting Tasbih. ."}},{"id":36,"idInBook":36,"chapterId":15,"bookId":13,"arabic":"وعن أبي موسى رضي الله عنه قال‏:‏ قال لي رسول الله صلى الله عليه وسلم‏:‏ ‏\"‏ألا أدلك على كنز من كنوز الجنة ‏؟‏‏\"‏ فقلت‏:‏ بلى يا رسول الله قال‏:‏ ‏\"‏لا حول ولا قوة إلا بالله‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","english":{"narrator":"Abu Musa (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said to me, \"Shall I not guide you to a treasure from the treasures of Jannah?\" I said: \"Yes, O Messenger of Allah!\" Thereupon he (ﷺ) said, \"(Recite) 'La hawla wa la quwwata illa billah' (There is no change of a condition nor power except by Allah).\"."}},{"id":37,"idInBook":37,"chapterId":15,"bookId":13,"arabic":"وعن عائشة رضي الله عنها قالت‏:‏ كان رسول الله صلى الله عليه وسلم يذكر الله تعالى على كل أحيانه‏.‏ رواه مسلم‏.‏","english":{"narrator":"'Aishah (May Allah be pleased with her) reported:","text":"The Messenger of Allah (ﷺ) used to remember Allah at all times.."}},{"id":38,"idInBook":38,"chapterId":15,"bookId":13,"arabic":"وعن ابن عباس رضي الله عنهما عن النبي صلى الله عليه وسلم قال‏:‏ ‏\n\"‏لو أن أحدكم إذا أتى أهله قال‏:‏ بسم الله، اللهم جنبنا الشيطان وجنب الشيطان ما رزقتنا، فقضى بينهما ولد لم يضره ‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","english":{"narrator":"Ibn 'Abbas (May Allah be pleased with them) reported:","text":"The Prophet (ﷺ) said, \"If anyone intends to have (sexual intercourse) with his wife, he should say: \"Bismillah! Allahumma janibnash-Shaitana, wa jannibish-Shaitana ma razaqtana (In the Name of Allah, O Allah! Keep us away from Satan and keep Satan away from what You have bestowed upon us);' and if Allah has ordained a child for them, Satan will never harm him.\"."}},{"id":39,"idInBook":39,"chapterId":15,"bookId":13,"arabic":"عن حذيفة، وأبي ذر رضي الله عنهما قالا‏:‏ كان رسول الله صلى الله عليه وسلم إذا أوى إلى فراشه قال‏:‏ ‏\"‏باسمك اللهم أموت وأحيا‏\"‏ وإذا استيقظ قال‏:‏ ‏\"‏الحمد لله الذي أحيانا بعد ما أماتنا وإليه النشور‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","english":{"narrator":"Hudhaifah and Abu Dharr (May Allah be pleased with him) reported:","text":"Whenever the Messenger of Allah (ﷺ) went to bed, he would supplicate: \"Bismika-Allahumma amut wa ahya (With Your Name, O Allah, I die and return to life)\"; and when he woke up, he would supplicate thus: \"Al-hamdu lillahilladhi ahyana ba'da ma amatana, wa ilaihin-nushur (All praise belongs to Allah Who has restored us back to life after causing us to die; and to Him shall we return).\"\n\n"}},{"id":40,"idInBook":40,"chapterId":15,"bookId":13,"arabic":"وعن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏\"‏إن لله تعالى ملائكة يطوفون في الطرق يلتمسون أهل الذكر، فإذا وجدوا قومًا يذكرون الله عز وجل، تنادوا‏:‏ هلموا إلى حاجتكم، فيحفونهم بأجنحتهم إلى السماء الدنيا، فيسألهم ربهم - وهو أعلم‏:‏ ما يقول عبادي‏؟‏ قال‏:‏ يقولون‏:‏ يسبحونك، ويكبرونك، ويحمدونك، ويمجدونك، فيقول‏:‏ هل رأوني‏؟‏ فيقولون‏:‏ لا لا والله ما رأوك، فيقول‏:‏ كيف لو رأوني‏؟‏‏!‏ قال‏:‏ يقولون‏:‏ لو رأوك كانوا أشد لك عبادة، وأشد لك تمجيدًا، وأكثر لك تسبيحًا فيقول‏:‏ فماذا يسألون‏؟‏ قال‏:‏ يقولون‏:‏ يسألونك الجنة‏.‏ قال‏:‏ يقول‏:‏ وهل رأوها‏؟‏ قال‏:‏ يقولون‏:‏ لا والله يا رب ما رأوها‏.‏ قال‏:‏ يقول‏:‏ فكيف لو رأوها‏؟‏‏!‏ قال‏:‏ يقولون‏:‏ لو أنهم رأوها كانوا أشد عليها حرصًا، وأشد لها طلبًا، وأعظم فيها رغبة‏.‏ قال‏:‏ فمم يتعوذون‏؟‏ قال يقولون‏:‏ يتعوذون من النار، قال‏:‏ فيقول‏:‏ وهل رأوها‏؟‏ قال‏:‏ يقولون‏:‏ ولا والله ما رأوها‏.‏ فيقول‏:‏ كيف لو رأوها‏؟‏‏!‏ قال‏:‏ يقولون‏:‏ لو رأوها كانوا أشد فرارًا، وأشد لها مخافة‏.‏ قال‏:‏ يقول‏:‏ فأشهدكم أني قد غفرت لهم، قال‏:‏ يقول ملك من الملائكة‏:‏ فيهم فلان ليس منهم، إنما جاء لحاجة، قال‏:‏ هم الجلساء لا يشقى بهم جليسهم‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏ \nوفي رواية لمسلم عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال‏:‏ ‏\"‏إن لله ملائكة سيارة فضلا يتتبعون مجالس الذكر، فإذا وجدوا مجلسًا فيه ذكر، قعدوا معهم، وحف بعضهم بعضًا بأجنحتهم حتى يملئوا ما بينهم وما بين السماء الدنيا، فإذا تفرقوا عرجوا وصعدوا إلى السماء، فيسألهم الله عز وجل - وهو أعلم‏:‏ من أين جئتم‏؟‏ فيقولون‏:‏ جئنا من عند عباد لك في الأرض‏:‏ يسبحونك، ويكبرونك، ويهللونك، ويحمدونك، ويسألونك‏.‏ قال‏:‏ وماذا يسألوني‏؟‏ قالوا‏:‏ يسألونك جنتك‏.‏ قال‏:‏ وهل رأوا جنتي‏؟‏ قالوا‏:‏ لا، أي رب‏.‏ قال‏:‏ فكيف لو رأوا جنتي‏؟‏‏!‏ قالوا‏:‏ ويستجيرونك‏.‏ قال‏:‏ ومم يستجيروني‏؟‏ قالوا‏:‏ من نارك يا رب‏.‏ قال‏:‏ وهل رأوا ناري‏؟‏ قالوا‏:‏ لا، قال‏:‏ فكيف لو رأوا ناري‏؟‏ قالوا‏:‏ ويستغفرونك، فيقول‏:‏ قد غفرت لهم، وأعطيتهم ما سألوا، وأجرتهم ما استجاروا‏.‏ قال‏:‏ فيقولون‏:‏ رب فيهم فلان عبد خطاء إنما مر، فجلس معهم، فيقول‏:‏ وله غفرت، هم القوم لا يشقى بهم جليسهم‏\"‏‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"Allah, the Exalted, has teams of angels who go about on the roads seeking those who remember Allah. When they find some people remembering Allah they call to one another and say, 'Come to what you are looking for;' and they surround them with their wings till the space between them and the lowest sky is fully covered. Allah, the Exalted and Glorious, asks them (although He is best informed about every thing): 'What are my slave saying?' They say: 'They are glorifying Your Tasbih, Tahmid, Takbir, Tamjid, (i.e., they were declaring Your Perfectness, praising, remembering the Greatness and Majesty of Allah).' He asks: 'Have they seen Me?' They reply, 'No, indeed, they have not seen You.' He asks: 'How would they act if they were to see Me?' Thereupon they reply: 'If they were to see You, they would engage more earnestly in worshipping and glorifying You and would extol You more.' He would say: 'What do they beg of Me?' They say, 'They beg You for Your Jannah.' Allah says, 'Have they seen My Jannah?' They say, 'No, our Rubb.' He says: 'How would they act if they were to see My Jannah?' They reply, 'Were they to see it, they would more intensely eager for it.' They (the angels) say, 'They seek Your Protection.' He asks, 'Against what do they seek My Protection?' They (the angels) say, 'Our Rubb, from the fire of Hell.' (He, the Rubb) says, 'Have they seen the fire of Hell?' They say, 'No. By Your Honour, they have not seen it.' He says: 'How would they act if they were to see My Fire?' They say: 'If they were to see it, they would more earnest in being away from it and fearing it. They beg of Your forgiveness.' He says: 'I call you to witness that I hereby grant pardon to them and confer upon them what they ask for; and grant them protection against what they seek protection from.' One of the angels says: 'Our Rubb, there is amongst them such and such slave who does not belong to the assembly of those who are participating in Your remembrance. He passed by them and sat down with them.' He says: 'I also grant him pardon because they are the people by virtue of whom their associates will not be unfortunate'.\".(The narration in Muslim is also the same with minor changes in wordings)."}},{"id":41,"idInBook":41,"chapterId":15,"bookId":13,"arabic":"وعنه وعن أبي سعيد رضي الله عنهما قالا‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏\n\"‏لا يقعد قوم يذكرون الله عز وجل إلا حفتهم الملائكة، وغشيتهم الرحمة ونزلت عليهم السكينة، وذكرهم الله فيمن عنده‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Abu Hurairah and Abu Sa'id Al-Khudri (May Allah be pleased with them) reported:","text":"The Messenger of Allah (ﷺ) said, \"When a group of people assemble for the remembrance of Allah, the angels surround them (with their wings), (Allah's) mercy envelops them, Sakinah, or tranquillity descends upon them and Allah makes a mention of them before those who are near Him.\"."}},{"id":42,"idInBook":42,"chapterId":15,"bookId":13,"arabic":"وعن أبي واقد الحارث بن عوف رضي الله عنه أن رسول الله صلى الله عليه وسلم، بينما هو جالس في المسجد، والناس معه، إذ أقبل اثنان إلى رسول الله صلى الله عليه وسلم، وذهب واحد، فوقفا على رسول الله صلى الله عليه وسلم، فأما أحدهما فرأى فرجة في الحلقة، فجلس فيها وأما الآخر، فجلس خلفهم، وأما الثالث فأدبر ذاهبًا‏.‏ فلما فرغ رسول الله صلى الله عليه وسلم، قال‏:‏ ألا أخبركم عن النفر الثلاثة‏:‏ أما أحدهم، فأوى إلى الله، فآواه الله ، وأما الآخر فاستحيى فاستحيى الله منه، وأما الآخر، فأعرض، فأعرض الله عنه‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","english":{"narrator":"Abu Waqid Al-Harith bin 'Auf (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) was sitting in the mosque with his Companions when three people came to him. Two of them stepped forward to the Messenger of Allah (ﷺ) and the third went away. Those two men stood by the side of Messenger of Allah (ﷺ). One of them found a space in the circle and he filled it, while the other one sat behind him. When the Messenger of Allah (ﷺ) finished, he said, \"Shall I not inform you about these three people? One of them sought refuge with Allah and Allah gave him refuge; the second one felt shy and Allah showed kindness to his shyness (and so he was accommodated in that meeting), and the last one averted, and so Allah turned away His Attention from him.\"."}},{"id":43,"idInBook":43,"chapterId":15,"bookId":13,"arabic":"وعن أبي سعيد الخدري رضي الله عنه قال‏:‏ خرج معاوية رضي الله عنه على حلقة في المسجد، فقال‏:‏ ما أجلسكم‏؟‏ قالوا‏:‏ جلسنا نذكر الله‏.‏ قال‏:‏ آلله ما أجلسكم إلا ذاك‏؟‏ قالوا‏:‏ ما أجلسنا إلا ذاك، قال‏:‏ أما إني لم أستحلفكم تهمة لكم، وما كان أحد بمنزلتي من رسول الله صلى الله عليه وسلم أقل حديثًا مني‏:‏ إن رسول الله صلى الله عليه وسلم خرج على حلقة من أصحابه فقال‏:‏ ‏\"‏ما أجلسكم‏؟‏‏\"‏ قالوا‏:‏ جلسنا نذكر الله، ونحمده على ما هدانا للإسلام، ومنَّ به علينا‏.‏ قال‏:‏ ‏\"‏آلله ما أجلسكم إلا ذاك‏؟‏‏\"‏ قالوا‏:‏ والله ما أجلسنا إلا ذلك‏\"‏‏.‏ قال‏:‏ ‏\"‏أما إني لم أستحلفكم تهمة لكم، ولكنه أتاني جبريل فأخبرني أن الله يباهي بكم الملائكة‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Abu Sa'id Al-Khudri (May Allah be pleased with him) reported:","text":"Mu'awiyah (May Allah be pleased with him) came to an assembly in the mosque and asked them: \"What has made you sit together?\" They replied, \"We are sitting here to remember Allah.\" He said, \"I adjure you by Allah to tell me whether nothing else has made you to sit together.\" They replied: \"By Allah! We are sitting only to remember Allah.\" Then he said, \"I did not adjure you because I suspected you. No one of my rank in the eyes of the Messenger of Allah (ﷺ) is the narrator of so few traditions as I am. The fact is that the Messenger of Allah (ﷺ) went out to a circle of his Companions and said, 'What has made you sit there?' When they replied that they are sitting together to remember Allah and to praise Him for guiding them to Islam and bestowing favours on them, he (ﷺ) said, 'I adjure you by Allah to tell me that nothing else has made you sit together.' On their reply that there was certainly no other purpose, he (ﷺ) said, 'I did not adjure you because I suspected you, but Jibril (Gabriel) came to me and told me that Allah was talking proudly of you to the angels.\"'."}},{"id":44,"idInBook":44,"chapterId":15,"bookId":13,"arabic":"وعن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏\n\"‏من قال حين يصبح وحين يمسي‏:‏ سبحان الله وبحمده مائة مرة، لم يأتِ أحد يوم القيامة بأفضل مما جاء به، إلا أحد قال مثل ما قال أو زاد‏\"‏ ‏(‏‏(‏ رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"He who recites in the morning and in the evening the statement: 'Subhan-Allahi wa bihamdihi (Allah is free from imperfection and I begin with praising Him)' one hundred times, will not be surpassed on the Day of Resurrection by anyone with better deeds than one who utters the same words or utters more of these words.\"."}},{"id":45,"idInBook":45,"chapterId":15,"bookId":13,"arabic":"وعنه قال‏:‏ جاء رجل إلى النبي صلى الله عليه وسلم، فقال‏:‏ يا رسول الله ما لقيت من عقرب لدغتني البارحة‏!‏ قال‏:‏ ‏\n\"‏أما لو قلت حين أمسيت‏:‏ أعوذ بكلمات الله التامات من شر ما خلق لم تضرك‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"A man came to the Prophet (ﷺ) and said, \"What a trouble I suffered from a scorpion which stung me last night!\" He (ﷺ) said, \"Had you said in the evening: 'A'udhu bikalimatillahit-tammati min sharri ma khalaqa (I seek the protection of Allah's Perfect Words from the evil of whatever He has created),' it would not have harmed you.\"."}},{"id":46,"idInBook":46,"chapterId":15,"bookId":13,"arabic":"وعنه عنه النبي، صلى الله عليه وسلم، أنه كان يقول إذا أصبح‏:‏ ‏\"‏اللهم بك أصبحنا، وبك أمسينا، وبك نحيا، وبك نموت، وإليك النشور‏\"‏‏.‏ وإذا أمسى قال‏:‏ ‏\"‏اللهم بك أمسينا، وبك نحيا، وبك نموت، وإليك المصير‏\"‏‏.‏ رواه أبو داود والترمذي وقال حديث حسن‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Prophet (ﷺ) used to say in the morning: \"Allahumma bika asbahna, wa bika amsaina, wa bika nahya, wa bika namutu, wa ilaikan-nushur (O Allah! With Your Power we have come to the morning, with Your Power we come to the evening, with Your Power we live, and we die, and to You will we return).\" In the evening he would say: \"Allahumma bika amsaina, wa bika nahya, wa bika namutu, wa ilaikan-nushur (O Allah! With Your Power, we have come to the evening, by You do we live, by You do we die, and to You is the return).\"."}},{"id":47,"idInBook":47,"chapterId":15,"bookId":13,"arabic":"وعنه أن أبا بكر الصديق رضي الله عنه قال‏:‏ يا رسول الله مرني بكلمات أقولهن إذا أصبحت وإذا أمسيت، قال‏:‏ قل‏:‏ ‏\"‏اللهم فاطر السماوات والأرض عالم الغيب والشهادة، رب كل شيء ومليكه أشهد أن لا إله إلا أنت، أعوذ بك من شر نفسي وشر الشيطان وشركه‏\"‏ قال‏:‏ ‏\"‏قلها إذا أصبحت، وإذا أمسيت، وإذا أخذت مضجعك‏\"‏‏.‏ رواه أبو داود والترمذي وقال حديث حسن صحيح‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"Abu Bakr asked, \"O Messenger of Allah! Teach me some words so that I may recite them in the morning and in the evening.\" The Messenger of Allah (ﷺ) said, \"Recite these words: 'Allahumma fatiras-samawati wal-ardi, 'alimal-ghaibi wash-shahadati, Rabba kulli shai'in wa malikahu. Ash- hadu an la ilaha illa Anta, a'udhu bika min sharri nafsi, wa sharrish- Shaitani wa shirkihi (O Allah! Creator of the heavens and the earth! Knower of the hidden and the exposed! Rubb of everything and every one. I bear witness that none has the right to be worshipped but You. I seek Your Protection from the evil of my own self from the evil of Satan and from the evil of Shirk to which he calls).\"' The Messenger of Allah (ﷺ) added: \"Recite these words in the morning and the evening and when you go to bed.\"."}},{"id":48,"idInBook":48,"chapterId":15,"bookId":13,"arabic":"وعن ابن مسعود رضي الله عنه قال‏:‏ كان نبي الله صلى الله عليه وسلم، إذا أمسى قال‏:‏ أمسينا وأمسى الملك لله، والحمد لله، لا إله إلا الله وحده لا شريك له‏\"‏ قال الراوي‏:‏ أراه قال فيهن‏:‏ ‏\"‏له الملك وله الحمد وهو على كل شيء قدير، رب أسألك خير ما في هذه الليلة، وخير ما بعدها، وأعوذ بك من شر ما في هذه الليلة وشر ما بعدها، رب أعوذ بك من الكسل، وسوء الكبر، رب أعوذ بك من شر ما في هذه الليلة، وخير ما بعدها، وأعوذ بك من شر ما في هذه الليلة وشر ما بعدها، رب أعوذ بك من الكسل، وسوء الكبر، رب أعوذ بك من عذاب النار، وعذاب في القبر‏\"‏ وإذا أصبح قال ذلك أيضًا‏:‏ ‏\"‏أصبحنا وأصبح الملك لله‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"'Abdullah bin Mas'ud (May Allah be pleased with him) reported:","text":"When it was evening, the Prophet (ﷺ) used to supplicate: \"Amsaina wa amsal-mulku lillah, wal-hamdu lillah. La 'ilaha illallahu wahdahu la sharika lahu (We have entered upon evening and the whole kingdom of Allah, too, has entered upon evening. Praise is due to Allah. There is none who has the right to be worshiped but Allah, the One who has no partner with Him).\" He (the narrator) said: I think that he (ﷺ) used to follow the recitation with these words: \"Lahul-mulku, wa lahul-hamdu, wa Huwa 'ala kulli shi'in Qadir. Rabbi as'aluka khaira ma fi hadhihil-lailati, wa khaira ma ba'daha; wa a'udhu bika min sharri ma fi hadhihil-lailati, wa sharri ma ba'daha; Rabbi a'udhu bika minal- kasali, wa su'il-kibari; Rabbi a'udhu bika min 'adhabin fin-nari, wa 'adhabin fil-qabri (His is the sovereignty and to Him is all praise due, and He is Omnipotent. My Rubb, I beg of you good that lies in this night and good that follows it, and I seek refuge in You from the evil that lies in this night and from the evil of that which follows it. My Rubb! I seek refuge in You from lethargy and the misery of old age. O Allah! I seek Your Protection from the torment of Hell-fire and the punishment of the grave).\" When it was morning, he (ﷺ) would recite the same, replacing the words: \"We have entered upon evening and the whole kingdom of Allah, too, has entered upon evening\" with \"We have entered upon morning and the whole kingdom of Allah entered upon morning.\" (Replace the words \"Amsaina, amsa, hadhihil-lailati, ma ba'daha with Asbahna, asbaha, hadhal-yaumi, ma ba'dahu, respectively.)."}},{"id":49,"idInBook":49,"chapterId":15,"bookId":13,"arabic":"وعن عبد الله بن خُبيب -بضم الخاء المعجمة- رضي الله عنه قال‏:‏ قال لي رسول الله صلى الله عليه وسلم‏:‏ ‏\n\"‏اقرأ‏:‏ قل هو الله أحد، والمعوذتين حين تمسي وحين تصبح، ثلاث مرات، تكفيك من كل شيء‏\"‏‏.‏ رواه أبو داود والترمذي وقال حديث حسن صحيح ‏.‏","english":{"narrator":"'Abdullah bin Khubaib (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said to me, \"Recite Surat Al-Ikhlas and Al- Mu'awwidhatain (Surat Al-Falaq and Surat An-Nas) three times at dawn and dusk. It will suffice you in all respects.\"."}},{"id":50,"idInBook":50,"chapterId":15,"bookId":13,"arabic":"وعن عثمان بن عفان رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏\n\"‏ما من عبد يقول في صباح كل يوم ومساء كل ليلة‏:‏ بسم الله الذي لا يضر مع اسمه شيء في الأرض ولا في السماء وهو السميع العليم، ثلاث مرات، إلا لم يضره شيء‏\"‏‏.‏ رواه أبو داود والترمذي وقال حديث حسن صحيح ‏.‏","english":{"narrator":"'Uthman bin 'Affan (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"He who recites three times every morning and evening: 'Bismillahil-ladhi la yadurru ma'as-mihi shai'un fil-ardi wa la fis-sama'i, wa Huwas-Sami'ul-'Alim (In the Name of Allah with Whose Name there is protection against every kind of harm in the earth or in the heaven, and He is the All-Hearing and All- Knowing),' nothing will harm him.\"."}},{"id":51,"idInBook":51,"chapterId":15,"bookId":13,"arabic":"وعن حذيفة وأبي ذر رضي الله عنهما أن رسول الله صلى الله عليه وسلم كان إذا أوى إلى فراشه قال‏:‏ ‏\n\"‏باسمك اللهم أحيا وأموت‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","english":{"narrator":"Hudhaifah and Abu Dharr (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) used to supplicate when he went to bed at night: \"Bismik-Allahumma ahya wa amut (With Your Name, O Allah, I expire and return to life).\"."}},{"id":52,"idInBook":52,"chapterId":15,"bookId":13,"arabic":"وعن علي رضي الله عنه أن رسول الله صلى الله عليه وسلم قال له ولفاطمة، رضي الله عنهما‏:‏ ‏\"‏إذا أويتما إلى فراشكما، أو‏:‏ إذا أخذتما مضجعكما - فكبرا ثلاثًا وثلاثين، وسبحا ثلاثًا وثلاثين، واحمدا ثلاثًا وثلاثين‏\"‏ وفي رواية‏:‏ التسبيح أربعًا وثلاثين‏\"‏ وفي رواية‏:‏ ‏\"‏التكبير أربعًا وثلاثين‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","english":{"narrator":"'Ali (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said to me and to Fatimah (May Allah be pleased with her) (Ali's wife and the Prophet's daughter), \"When you go to bed, recite: Takbir (Allahu Akbar) thirty-three times and Tasbih (Subhan-Allah) thirty-three times and Tahmid (Al-hamdu lillah) thirty-three times.\"Another narration is: The Messenger of Allah (ﷺ) said, \"Recite Tasbih thirty-four times.\"Another narration is: The Messenger of Allah(ﷺ) said, \"Recite Takbir thirty-four times.\"."}},{"id":53,"idInBook":53,"chapterId":15,"bookId":13,"arabic":"وعن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏\n\"‏إذا أوى أحدكم إلى فراشه، فلينفض فراشه بداخلة إزاره فإنه لا يدري ما خلفه عليه، ثم يقول‏:‏ باسمك ربي وضعت جنبي، وبك أرفعه؛ إن أمسكت نفسي فارحمها، وإن أرسلتها، فاحفظها بما تحفظ به عبادك الصالحين‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"When any of you goes to bed, he should shake off (or dust off) his bedsheet because he does not know what might have fallen on it after he had left it. Then he should recite: 'Bismika Rabbi wada'tu janbi, wa bika arfa'uhu, in amsakta nafsi farhamha, wa in arsaltaha fahfazha bima tahfazu bihi 'ibadakas-salihin ."}},{"id":54,"idInBook":54,"chapterId":15,"bookId":13,"arabic":"وعن عائشة، رضي الله عنه، أن رسول الله صلى الله عليه وسلم، كان إذا أخذ مضجعه نفث في يديه، وقرأ بالمعوذات ومسح بهما جسده‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏ \nوفي رواية لهما‏:‏ ‏\n\"‏أن النبي صلى الله عليه وسلم، كان إذا أوى إلى فراشه كل ليلة جمع كفيه، ثم نفث فيهما فقرأ فيهما‏:‏ قل هو الله أحد، وقل أعوذ برب الفلق، وقل أعوذ برب الناس، ثم مسح بهما ما استطاع من جسده، يبدأ بهما على رأسه ووجهه، وما أقبل من جسده، يفعل ذلك ثلاث مرات‏\"‏‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏. قال أهل اللغة : (( النفث )) نفخ لطيف بلا ريق‏","english":{"narrator":"'A ishah (May Allah be pleased with her) reported:","text":"Whenever the Messenger of Allah (ﷺ) went to bed, he would blow upon his hands recite Al-Mu'awwidhat; and pass his hands over his body.."}},{"id":55,"idInBook":55,"chapterId":15,"bookId":13,"arabic":"وعن البراء بن عازب رضي الله عنهما، قال‏:‏ قال لي رسول الله صلى الله عليه وسلم‏:‏ ‏\n\"‏إذا أتيت مضجعك فتوضأ وضوءك للصلاة، ثم اضطجع على شقك الأيمن، وقل‏:‏ اللهم أسلمت نفسي إليك، ووجهت وجهي إليك وفوضت أمري إليك، وألجأت ظهري إليك رغبة ورهبة إليك لا ملجأ ولا منجا منك إلا إليك آمنت بكتابك الذي أنزلت، وبنبيك الذي أرسلت، فإن مت، مت على الفطرة، واجعلهن آخر ما تقول‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","english":{"narrator":"Al-Bara' bin 'Azib (May Allah be pleased with them) reported:","text":"The Messenger of Allah (ﷺ) said, \"Whenever you intend to go to bed, perform Wudu' as is done for Salat (prayer); and then lie down on the right side and recite: 'Allahumma aslamtu nafsi ilaika, wa fawwadtu amri ilaika, wal-ja'tu zahri ilaika, raghbatan wa rahbatan ilaika, la malja'a wa la manja minka illa ilaika, amantu bikitabik-alladhi anzalta, wa binabiyyik-alladhi arsalta ."}},{"id":56,"idInBook":56,"chapterId":15,"bookId":13,"arabic":"وعن أنس رضي الله عنه، أن النبي صلى الله عليه وسلم، كان إذا أوى فراشه قال‏:‏ ‏\n\"‏الحمد لله الذي أطعمنا وسقانا، وكفانا وآوانا، فكم ممن لا كافي له ولا مئوي‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Anas (May Allah be pleased with him) reported:","text":"Whenever the Prophet (ﷺ) went to his bed, he would say: \"Al-hamdu lillah-illadhi at'amana wa saqana, wa kafana wa awana, fakam mimman la kafiya lahu wa la mu'wiya (Praise is due to Allah Who has fed us, provided us drink, satisfied us and gave us protection. Many are those who have no one to provide for them, or give them shelter).\"."}},{"id":57,"idInBook":57,"chapterId":15,"bookId":13,"arabic":"وعن حذيفة رضي الله عنه أن رسول الله صلى الله عليه وسلم، كان إذا أراد أن يرقد وضع يده اليمنى تحت خده، ثم يقول‏:‏ ‏\n\"‏اللهم قني عذابك يوم تبعث عبادك‏\"‏‏.‏ ‏(‏‏(‏رواه الترمذي وقال حديث حسن ورواه أبو داود من رواية حفصة رضي الله عنه وفيه أنه كان يقوله ثلاث مرات‏)‏‏)‏‏.‏","english":{"narrator":"Hudhaifah (May Allah be pleased with him) reported:","text":"Whenever the Messenger of Allah (ﷺ) intended to go to sleep, he would place his right hand under his (right) cheek and supplicate: \"Allahumma qini 'adhabaka yauma tab'athu 'ibadaka (O Allah! Guard me against Your punishment on the Day when You will resurrect Your slaves).\".In a narration in Abu Dawud, Hafsah (May Allah be pleased with her) said: Before going to sleep the Messenger of Allah (ﷺ) would recite this Du'a three times."}}],"chapter":{"id":15,"bookId":13,"arabic":"كتاب الأذكار","english":"The Book of the Remembrance of Allah"}}