{"metadata":{"length":277,"arabic":{"title":"رياض الصالحين","author":"الإمام يحيى بن شرف النووي","introduction":"كتاب الفضائل"},"english":{"title":"Riyad as-Salihin","author":"Imam Yahya ibn Sharaf al-Nawawi","introduction":"The Book of Virtues"}},"hadiths":[{"id":1,"idInBook":1,"chapterId":8,"bookId":13,"arabic":"عن أبي أمامة رضي الله عنه قال‏:‏ سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ ‏\n\"‏ اقرءوا القرآن فإنه يأتي يوم القيامة شفيعًا لأصحابه‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Abu Umamah (May Allah be pleased with him) reported:","text":"I heard the Messenger of Allah (ﷺ) saying, \"Read the Qur'an, for it will come as an intercessor for its reciters on the Day of Resurrection.\"."}},{"id":2,"idInBook":2,"chapterId":8,"bookId":13,"arabic":"وعن النواس بن سمعان رضي الله عنه قال‏:‏ سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ ‏\n\"‏يؤتى يوم القيامة بالقرآن وأهله الذين كانو يعملون به في الدنيا تقدمه سورة البقرة وآل عمران تحاجان عن صاحبهما ‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"An-Nawwas bin Sam'an (May Allah be pleased with him) reported:","text":"I heard the Messenger of Allah (ﷺ) saying, \"The Qur'an and its people who applied it, will be brought on the Day of Resurrection preceded with Surat Al-Baqarah and Surat Al-'Imran arguing on behalf of those who applied them.\"."}},{"id":3,"idInBook":3,"chapterId":8,"bookId":13,"arabic":"- وعن عثمان بن عفان رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\n\"‏خيركم من تعلم القرآن وعلمه‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","english":{"narrator":"'Uthman bin 'Affan (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"The best amongst you is the one who learns the Qur'an and teaches it.\"."}},{"id":4,"idInBook":4,"chapterId":8,"bookId":13,"arabic":"وعن عائشة رضي الله عنها قالت‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\n\"‏الذي يقرأ القرآن وهو ماهر به مع السفرة الكرام البررة، والذي يقرأ القرآن ويتتعتع فيه وهو عليه شاق له أجران‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","english":{"narrator":"'Aishah (May Allah be pleased with her) reported:","text":"The Messenger of Allah (ﷺ) said, \"The one who is proficient in the recitation of the Qur'an will be with the honourable and obedient scribes (angels) and he who recites the Qur'an and finds it difficult to recite, doing his best to recite it in the best way possible, will have two rewards.\"."}},{"id":5,"idInBook":5,"chapterId":8,"bookId":13,"arabic":"وعن أبي موسى الأشعري رضي الله عنه‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\n\"‏مثل المؤمن الذي يقرأ القرآن مثل الأترجة‏:‏ ريحها طيب، وطعمها طيب، ومثل المؤمن الذي لا يقرأ القرآن كمثل التمرة‏:‏ لا ريح لها وطعمها حلو، ومثل المنافق الذي يقرأ القرآن كمثل الريحانة‏:‏ ريحها طيب وطعمها مر، ومثل المنافق الذي لايقرأ القرآن كمثل الحنظلة‏:‏ ليس له ريح وطعمها مر‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","english":{"narrator":"Abu Musa Al-Ash'ari (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"The believer who recites the Qur'an is like a citron whose fragrance is sweet and whose taste is delicious. A believer who does not recite the Qur'an is like a date-fruit which has no fragrance but has a sweet taste. The hypocrite who recites the Qur'an is like basil whose fragrance is so sweet, but its taste is bitter. The hypocrite who does not recite the Qur'an is like a colocynth which has no fragrance and its taste is bitter.\"."}},{"id":6,"idInBook":6,"chapterId":8,"bookId":13,"arabic":"وعن عمر بن الخطاب رضي الله عنه‏:‏ أن النبي صلى الله عليه وسلم قال ‏:‏ ‏\n\"‏ إن الله يرفع بهذا الكتاب أقوامًا ويضع به آخرين‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"'Umar bin Al-Khattab (May Allah be pleased with him) reported:","text":"The Prophet (ﷺ) said, \"Verily, Allah elevates some people with this Qur'an and abases others.\"."}},{"id":7,"idInBook":7,"chapterId":8,"bookId":13,"arabic":"وعن ابن عمر رضي الله عنهما‏:‏ عن النبي صلى الله عليه وسلم قال ‏:‏‏\"‏ لا حسد إلا في اثنتين‏:‏ رجل آتاه الله القرآن، فهو يقوم به آناء الليل وآناء النهار، ورجل آتاه الله مالا، فهو ينفقه آناء الليل وآناء النهارِ‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏ (1) ‏.‏","english":{"narrator":"Ibn 'Umar (May Allah be pleased with them) reported:","text":"The Prophet (ﷺ) said: \"Envy is justified in regard to two types of persons only: a man whom Allah has given knowledge of the Qur'an, and so he recites it during the night and during the day; and a man whom Allah has given wealth and so he spends from it during the night and during the day.\"."}},{"id":8,"idInBook":8,"chapterId":8,"bookId":13,"arabic":"وعن البراء بن عازب  رضي الله عنهما قال‏:‏ كان رجل يقرأ سورة الكهف، وعنده فرس مربوط بشطنين فتغشته سحابة فجعلت تدنو، وجعل فرسه ينفر منها‏.‏ فلما أصبح أتى النبي صلى الله عليه وسلم ، فذكر له ذلك فقال ‏:‏‏\n\"‏ تلك السكينة تنزلت للقرآن‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏","english":{"narrator":"Al-Bara' bin 'Azib (May Allah be pleased with them) reported:","text":"A man was reciting Surat Al-Kahf, and a horse was tied with two ropes beside him. As he was reciting, a cloud overshadowed him, and as it began to come nearer and nearer, the horse began to trample voilently. The man came to the Messenger of Allah (ﷺ) in the morning and mentioned the incident to him. He (ﷺ) said, \"That was tranquillity which descended as a result of the recitation of the Qur'an.\"\n."}},{"id":9,"idInBook":9,"chapterId":8,"bookId":13,"arabic":"وعن ابن مسعود رضي الله عنه قال ‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\n\"‏من قرأ حرفًا من كتاب الله فله حسنة، والحسنة بعشر أمثالها لا أقول‏:‏ ألم حرف، ولكن ألف حرف، ولام حرف، وميم حرف‏\"‏‏(‏‏(‏راوه الترمذي وقال‏:‏ حديث حسن صحيح‏)‏‏)‏‏.‏","english":{"narrator":"Ibn Mas'ud (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"Whoever recites a letter from the Book of Allah, he will be credited with a good deed, and a good deed gets a ten-fold reward. I do not say that Alif-Lam-Mim is one letter, but Alif is a letter, Lam is a letter and Mim is a letter.\"."}},{"id":10,"idInBook":10,"chapterId":8,"bookId":13,"arabic":"وعن ابن عباس رضي الله عنهما قال ‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\n\"‏إن الذي  ليس في جوفه شيء من القرآن كالبيت الخرب‏\"‏‏.‏ ‏(‏‏(‏رواه الترمذي وقال‏:‏ حديث حسن صحيح‏)‏‏)‏‏.‏","english":{"narrator":"Ibn `Abbas (May Allah be pleased with them) reported:","text":"The Messenger of Allah (ﷺ) said, \"He who does not memorize any part from the Qur'an he is like the ruined house.''\n\n."}},{"id":11,"idInBook":11,"chapterId":8,"bookId":13,"arabic":"وعن عبد الله بن عمرو بن العاص رضي الله عنهماعن النبي صلى الله عليه وسلم قال‏:‏ ‏\n\"‏يقال لصاحب القرآن‏:‏ اقرأ وارتقِ ورتل كما كنت ترتل في الدنيا، فإن منزلتك عند آخر آية تقرؤها‏\"‏‏.‏ ‏(‏‏(‏رواه أبو داود والترمذي وقال‏:‏ حديث حسن صحيح‏)‏‏)‏‏.‏","english":{"narrator":"'Abdullah bin 'Amr bin Al-'As (May Allah be pleased with them) reported:","text":"The Prophet (ﷺ) said, \"The one who was devoted to the Qur'an will be told on the Day of Resurrection: 'Recite and ascend (in ranks) as you used to recite when you were in the world. Your rank will be at the last Ayah you recite.\"'."}},{"id":12,"idInBook":12,"chapterId":8,"bookId":13,"arabic":"عن أبي موسى رضي الله عنه عن النبي صلى الله عليه وسلم قال ‏\n\"‏تعاهدوا هذا القرآن فوالذي نفس محمد بيده لهو أشد تفلتًا من الإبل في عقلها‏\"‏‏.‏ ‏(‏‏(‏متفق عله‏)‏‏)‏‏.‏","english":{"narrator":"Abu Musa Al-Ash'ari (May Allah be pleased with him) reported:","text":"The Prophet (ﷺ) said, \"Read the Qur'an regularly. By the One in Whose Hand Muhammad's soul is, it escapes from memory faster than a camel does from its tying ropes.\"."}},{"id":13,"idInBook":13,"chapterId":8,"bookId":13,"arabic":"وعن ابن عمر رضي الله عنهما أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\n\"‏إنما مثل صاحب القرآن كمثل الإبل المعقلة، إن عاهد عليها أمسكها، وإن أطلقها، ذهبت‏\"‏ متفق عليه‏.‏","english":{"narrator":"Ibn 'Umar (May Allah be pleased with them) reported:","text":"The Messenger of Allah (ﷺ) said: \"The parable of one who knows the Qur'an by heart is as the parable of an owner of hobbled camel. If he remains vigilant, he will retain it; and if he neglects it, it will go away.\"."}},{"id":14,"idInBook":14,"chapterId":8,"bookId":13,"arabic":"وعن أبي هريرة رضي الله عنه قال ‏:‏سمعت رسول الله صلى الله عليه وسلم يقول‏:‏  ‏\n\"‏ما أذن الله لشيء ما أذن لنبي حسن الصوت يتغنى بالقرآن يجهر به ‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","english":{"narrator":"Abu Hurairah (may Allah be pleased with him) reported:","text":"I heard the Messenger of Allah (ﷺ) saying, \"Allah does not listen so attentively to anything as He listens to the recitation of the Qur'an by a Prophet who recites well with a melodious and audible voice.\"."}},{"id":15,"idInBook":15,"chapterId":8,"bookId":13,"arabic":"وعن أبي موسى الأشعري رضي الله عنه أن رسول الله صلى الله عليه وسلم قال له ‏:‏‏\"‏ لقد أتيت مزمارا من مزامير آل داود ‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏ \nوفي روايه لمسلم ‏:‏ أن رسول الله صلى الله عليه وسلم قال له ‏:‏ ‏\"‏ لو رأيتني وأنا أستمع لقراءتك البارحة‏\"‏‏.‏","english":{"narrator":"Abu Musa Al-Ash'ari (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said to him, \"You have been given a Mizmar (sweet melodious voice) out of the Mazamir of Prophet Dawud (David).\".\nAnd in a version narrated by Muslim \"If you would have seen me, as I was listening to your recitation last night.\""}},{"id":16,"idInBook":16,"chapterId":8,"bookId":13,"arabic":"وعن البراء بن عازب رضي الله عنهما قال ‏:‏سمعت النبي صلى الله عليه وسلم قرأ في العشاء بالتين والزيتون، فما سمعت أحدًا أحسن صوتا منه ‏.‏‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏","english":{"narrator":"Al-Bara' bin 'Azib (May Allah be pleased with them) reported:","text":"I heard the Prophet (ﷺ) reciting Surat Wat-Teen Waz-Zaitun (Chapter 95) during the 'Isha' prayer. I have never heard anyone reciting it in a more beautiful voice than his.."}},{"id":17,"idInBook":17,"chapterId":8,"bookId":13,"arabic":"وعن أبي لبابة بشير بن عبد المنذر رضي الله عنه قال، أ‏ن النبي صلى الله عليه وسلم قال‏:‏ من لم يتغنَ بالقرآن فليس منا ‏\"‏‏.‏‏(‏‏(‏رواه أبو داود بإسناد جيد‏)‏‏)‏ ‏.‏","english":{"narrator":"Abu Lubabah Bashir bin 'Abdul-Mundhir (May Allah be pleased with him) reported:","text":"The Prophet (ﷺ) said, \"He who does not recite the Qur'an in a pleasant tone is not of us.\"."}},{"id":18,"idInBook":18,"chapterId":8,"bookId":13,"arabic":"وعن ابن مسعود رضي الله عنه قال‏:‏ قال لي النبي صلى الله عليه وسلم  ‏:‏‏\"‏اقرأ علي القرآن ‏\"‏، فقلت ‏:‏ يا رسول الله، أقرأ عليك وعليك أنزل ‏؟‏‏!‏ قال ‏:‏ ‏\"‏إني أحب أن أسمعه من غيري‏\"‏ فقرأت عليه سورة النساء حتى جئت إلى هذه الآية ‏:‏ ‏{‏فكيف إذا جئنا من كل أمة بشهيد وجئنا بك على هؤلاء شهيدا‏}‏ قال‏:‏ ‏\"‏حسبك الآن‏\"‏ فالتفت إليه، فإذا عيناه تذرفان ‏.‏‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏","english":{"narrator":"Ibn Mas'ud (May Allah be pleased with him) reported:","text":"The Prophet (ﷺ) said to me, \"Recite the Qur'an to me.\" I said: \"O Messenger of Allah! Shall I recite it to you when it was revealed to you?\" He (ﷺ) said, \"I like to hear it from others.\" Then I began to recite Surat An-Nisa'. When I reached the Ayah: 'How will it be when We shall bring a witness from every people and bring you as a witness against them?' (Having heard it) he said, \"Enough! Enough!\" When I looked at him, I found his eyes were overflowing with tears.."}},{"id":19,"idInBook":19,"chapterId":8,"bookId":13,"arabic":"عن أبي سعيد رافع بن المعلى رضي الله عنه قال ‏:‏ قال لي رسول الله صلى الله عليه وسلم ‏:‏‏\"‏ألا أعلمك أعظم سورة في القرآن قبل أن تخرج من المسجد‏؟‏ فأخذ بيدي ، فلما أردنا أن نخرج قلت ‏:‏ يا رسول الله إنك قلت لأعلمنك أعظم سورة في القرآن ‏؟‏ قال‏:‏ ‏\"‏الحمد لله رب العالمين هي السبع المثاني، والقرآن العظيم الذي أوتيته ‏\"‏‏.‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","english":{"narrator":"Abu Sa'id Ar-Rafi' bin Al-Mu'alla (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"Shall I teach you the greatest Surah in the Qur'an before you leave the mosque?\" Then he (ﷺ), took me by the hand, and when we were about to step out, I reminded him of his promise to teach me the greatest Surah in the Qur'an. He (ﷺ) said, \"It is 'Alhamdu lillahi Rabbil 'Alamin (i.e., Surat Al-Fatihah) which is As-Sab' Al-Mathani (i.e., the seven oft- repeated Ayat) and the Great Qur'an which is given to me.\"."}},{"id":20,"idInBook":20,"chapterId":8,"bookId":13,"arabic":"وعن أبي سعيد الخدري رضي الله عنه أن رسول الله صلى الله عليه وسلم قال في‏:‏‏{‏ قل هو الله أحد‏}‏‏:‏‏\"‏ والذي نفسي بيده، إنها لتعدل ثلث القرآن‏\"‏‏.‏ \nوفي رواية‏:‏ أن رسول الله صلى الله عليه وسلم قال لأصحابه‏:‏‏\"‏ أيعجز أحدكم أن يقرأ بثلث القرآن في ليلة‏\"‏ فشق ذلك عليهم، وقالوا‏:‏ أينا يطيق ذلك يارسول الله‏:‏ فقال ‏:‏‏\"‏ ‏{‏قل هو الله أحد‏}‏ ثلث القرآن‏.‏‏\"‏‏.‏ ‏(‏‏(‏ رواه البخاري‏)‏‏)‏‏.‏","english":{"narrator":"Abu Sa'id Al-Khudri (May Allah be pleased with him) reported about Surat Al-Ikhlas (Chapter 112):","text":"The Messenger of Allah (ﷺ) said, \"By Him in Whose Hand my soul is, it is equivalent to one-third of the Qur'an.\"According to another version, he (ﷺ) said to his Companions, \"Is anyone of you incapable of reciting one-third of the Qur'an in one night?\" They considered it burdensome and said: \"O Messenger of Allah, which of us can afford to do that?\" He (ﷺ) said, \"Surat Al-Ikhlas ."}},{"id":21,"idInBook":21,"chapterId":8,"bookId":13,"arabic":"وعنه أن رجل سمع رجلاً يقرأ‏:‏‏{‏قل هو الله احد‏}‏ يرددها فلما أصبح جاء إلى رسول الله صلى الله عليه وسلم، فذكر ذلك له وكان الرجل يتقالها فقال رسول الله صلى الله عليه وسلم ‏:‏‏\n\"‏ والذي نفسي بيده، إنها لتعدل ثلث القرآن‏\"‏‏.‏ ‏(‏‏(‏رواه البخاري ‏)‏‏)‏‏.‏","english":{"narrator":"Abu Sa'id Al-Khudri (May Allah be pleased with him) reported:","text":"A man heard another reciting Surat Al-Ikhlas repeatedly. The next morning he came to the Messenger of Allah (ﷺ) and informed him about it as if he considered it to be of little reward. On that the Messenger of Allah (ﷺ) said, \"By Him in Whose Hand my soul is, this Surah is equal to one-third of the Qur'an.\"."}},{"id":22,"idInBook":22,"chapterId":8,"bookId":13,"arabic":"وعن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال في‏:‏‏{‏ قل هو الله أحد‏}‏  ‏\n\"‏إنها تعدل ثلث القرآن‏\"‏‏.‏‏(‏‏(‏ رواه مسلم ‏)‏‏)‏‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"Surat Ikhlas is equivalent to one-third of the Qur'an.\"."}},{"id":23,"idInBook":23,"chapterId":8,"bookId":13,"arabic":"وعن أنس رضي الله عنه أن رجلا قال‏:‏ يارسول الله إني أحب هذه السورة ‏\"‏قل هو الله أحد‏\"‏‏:‏‏\"‏إن حبها أدخلك الجنة‏\"‏ ‏(‏‏(‏رواه الترمذي وقال‏:‏ حديث حسن- رواه البخاري في صحيحه تعليقًا‏)‏‏)‏‏.‏","english":{"narrator":"Anas (May Allah be pleased with him) reported:","text":"A man said: \"O Messenger of Allah! I love Surat-Al-Ikhlas ."}},{"id":24,"idInBook":24,"chapterId":8,"bookId":13,"arabic":"وعن عقبة بن عامر رضي الله عنه أن رسول الله صلى الله عليه وسلم قال ‏:‏‏\n\"‏ ألم ترَ آيات أنزلت هذه الليلة لم يرَ مثلهن قط ‏؟‏ قل أعوذ برب الفلق، وقل أعوذ برب الناس ‏\"‏‏.‏‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"'Uqbah bin 'Amir (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said: \"Do you not know that last night certain Ayat were revealed the like of which there is no precedence. They are: 'Say: I seek refuge with (Allah) the Rubb of the daybreak' (Surah 113), and 'Say: I seek refuge with (Allah) the Rubb of mankind' (Surah 114).\"."}},{"id":25,"idInBook":25,"chapterId":8,"bookId":13,"arabic":"وعن أبي سعيد الخدري رضي الله عنه قال ‏:‏ كان رسول الله صلى الله عليه وسلم يتعوذ من الجان، وعين الإنسان، حتى نزلت المعوذتان، فلما نزلتا، أخذ بهما وترك ما سواهما ‏.‏ \n(‏‏(‏رواه الترمذي وقال ‏:‏حديث حسن ‏)‏‏)‏‏.‏","english":{"narrator":"Abu Sa'id Al-Khudri (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) used to seek protection against the evil of jinn and the evil eyes till Surat Al-Falaq and Surat An-Nas were revealed. After they were revealed, he took to them for seeking Allah's protection and left everything besides them.."}},{"id":26,"idInBook":26,"chapterId":8,"bookId":13,"arabic":"وعن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال ‏:‏‏\"‏ من القرآن سورة ثلاثون آية شفعت لرجل حتى غفرت له ،وهي‏:‏ تبارك الذي بيده الملك ‏\"‏‏.‏ ‏(‏‏(‏رواه أبو داود والترمذي وقال ‏:‏‏\"‏ حديث حسن ، وفي رواية أبي داود‏:‏ ‏\"‏تشفع ‏\"‏‏)‏‏)‏‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"I heard the Messenger of Allah (ﷺ) saying, \"There is a Surah in the Qur'an which contains thirty Ayat which kept interceding for a man until his sins are forgiven. This Surah is 'Blessed is He in Whose Hand is the dominion.' (Surat Al-Mulk 67).\"."}},{"id":27,"idInBook":27,"chapterId":8,"bookId":13,"arabic":"وعن أبي مسعود البدري رضي الله عنه عن النبي صلى الله عليه وسلم قال ‏:‏‏\n\"‏ من قرأ بالآيتين من آخر سورة البقرة في ليلة كفتاه ‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","english":{"narrator":"Abu Mas'ud Al-Badri (May Allah be pleased with him) reported:","text":"I heard the Prophet (ﷺ) saying, \"He who recites the two Ayat at the end of Surat Al-Baqarah at night, they will suffice him.\"."}},{"id":28,"idInBook":28,"chapterId":8,"bookId":13,"arabic":"وعن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال ‏:‏‏\n\"‏ لا تجعلوا بيوتكم مقابر، إن الشيطان ينفر من البيت الذي تقرأ فيه سورة البقرة‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"I heard the Messenger of Allah (ﷺ) saying: \"Do not turn your houses into graveyards. Satan runs away from the house in which Surat Al-Baqarah is recited.\"."}},{"id":29,"idInBook":29,"chapterId":8,"bookId":13,"arabic":"وعن أبي بن كعب رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏‏\"‏ يا أبا المنذر أتدري أي آية من كتاب الله معك أعظم ‏؟‏ قلت‏:‏ الله لا إله إلا هو الحي القيوم، فضرب في صدري وقال ‏:‏‏\"‏ ليهنك العلم أبا المنذر‏\"‏‏.‏ ‏(‏‏(‏رواه مسلم ‏)‏‏)‏‏.‏","english":{"narrator":"Ubayy bin Ka'b (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said: \"Abu Mundhir! Do you know which Ayah in Allah's Book is the greatest?\" I replied: \"It is 'Allah la ilaha illa Huwal-Haiyul-Qayum (Allah! none has the right to be worshipped but He, the Ever Living...)'.\" (2:256) Thereupon he (ﷺ) patted me in the chest and said, \"Rejoice by this knowledge, O Abu Mundhir!\"."}},{"id":30,"idInBook":30,"chapterId":8,"bookId":13,"arabic":"وعن أبي هريرة رضي الله عنه قال‏:‏ وكلني رسول الله صلى الله عليه وسلم بحفظ زكاة رمضان، فأتاني آتٍ، فجعل يحثو من الطعام، فأخذته فقلت‏:‏ لأرفعنك إلى رسول الله صلى الله عليه وسلم قال‏:‏ إني محتاج، وعلي عيال، وبي حاجة شديدة، فخليت عنه، فأصبحت، فقال رسول الله صلى الله عليه وسلم ‏:‏‏\"‏ يا أبا هريرة، ما فعل أسيرك البارحة‏؟‏‏\"‏ قلت‏:‏ يا رسول الله شكا حاجة وعيالا، فرحمته، فخليت سبيله‏.‏ فقال‏:‏ ‏\"‏ أما إنه قد كذبك وسيعود‏\"‏ فعرفت أنه سيعود لقول رسول الله صلى الله عليه وسلم فرصدته، فجاء يحثو من الطعام، فقلت‏:‏ لأرفعنك إلى رسول الله صلى الله عليه وسلم، قال‏:‏ دعني فإني محتاج، وعلي عيال لا أعود، فرحمته فخليت سبيله، فأصبحت فقال لي رسول الله صلى الله عليه وسلم‏:‏ ‏\"‏يا أبا هريرة، ما فعل أسيرك البارحة‏؟‏‏\"‏ قلت‏:‏ يا رسول الله شكا حاجة وعيالا فرحمته، فخليت سبيله، فقال‏:‏ ‏\"‏إنه قد كذبك وسيعود‏\"‏ فرصدته الثالثة‏.‏ فجاء يحثو من الطعام، فأخذته، فقلت‏:‏ لأرفعنك إلى رسول الله  صلى الله عليه وسلم، وهذا آخر ثلاث أنك تزعم أنك لا تعود، ثم تعود‏!‏ فقال‏:‏ دعني فإني أعلمك كلمات ينفعك الله بها، قلت‏:‏ ما هن‏؟‏ قال‏:‏ إذا أويت إلى فراشك فاقرأ آية الكرسي، فإنه لن يزال عليك من الله حافظ، ولا يقربك شيطان حتى تصبح، فخليت سبيله فأصبحت، فقال لي رسول الله  صلى الله عليه وسلم‏:‏ ‏\"‏ما فعل أسيرك البارحة‏؟‏ ‏\"‏ قلت‏:‏ يا رسول الله زعم أنه يعلمني كلمات ينفعني الله بها، فخليت سبيله‏.‏ قال‏:‏ ‏\"‏ما هي‏؟‏‏\"‏ قلت‏:‏ قال لي‏:‏ إذا أويت إلى فراشك فاقرأ آية الكرسي من أولها حتى تختم الآية‏:‏ ‏{‏الله لا إله إلا هو الحي القيوم‏}‏ وقال لي‏:‏ لا يزال عليك من الله حافظ، ولن يقربك شيطان حتى تصبح، فقال النبي صلى الله عليه وسلم‏:‏ ‏\"‏أما إنه قد صدقك وهو كذوب، تعلم من تخاطب منذ ثلاث يا أبا هريرة ‏\"‏ ‏؟‏ قلت‏:‏ لا، قال‏:‏ ‏\"‏ذاك شيطان‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) put me in charge of charity of Ramadan (Sadaqat-ul- Fitr). Somebody came to me and began to take away some food-stuff. I caught him and said, \"I must take you to the Messenger of Allah (ﷺ).\" He said, \"I am a needy man with a large family, and so I have a pressing need.\" I let him go. When I saw the Messenger of Allah (ﷺ) next morning, he asked me, \"O Abu Hurairah! What did your captive do last night?\" I said, \"O Messenger of Allah! He complained of a pressing need and a big family. I felt pity for him so I let him go.\" He (ﷺ) said, \"He told you a lie and he will return.\" I was sure, according to the saying of the Messenger of Allah (ﷺ) that he would return. I waited for him. He sneaked up again and began to steal food-stuff from the Sadaqah. I caught him and said; \"I must take you to the Messenger of Allah (ﷺ).\" He said, \"Let go of me, I am a needy man. I have to bear the expenses of a big family. I will not come back.\" So I took pity on him and let him go. I went at dawn to the Messenger of Allah (ﷺ) who asked me, \"O Abu Hurairah! What did your captive do last night?\" I replied, \"O Messenger of Allah! He complained of a pressing want and the burden of a big family. I took pity on him and so I let him go.\" He (ﷺ) said, \"He told you a lie and he will return.\" (That man) came again to steal the food-stuff. I arrested him and said, \"I must take you to the Messenger of Allah (ﷺ), and this is the last of three times. You promised that you would not come again but you did.\" He said, \"Let go of me, I shall teach you some words with which Allah may benefit you.\" I asked, \"What are those words?\" He replied, \"When you go to bed, recite Ayat-ul- Kursi (2:255) for there will be a guardian appointed over you from Allah, and Satan will not be able to approach you till morning.\" So I let him go. Next morning the Messenger of Allah (ﷺ) asked me, \"What did your prisoner do last night.\" I answered, \"He promised to teach me some words which he claimed will benefit me before Allah. So I let him go.\" The Messenger of Allah (ﷺ) asked, \"What are those words that he taught you?\" I said, \"He told me: 'When you go to bed, recite Ayat- ul-Kursi from the beginning to the end i.e.,."}},{"id":31,"idInBook":31,"chapterId":8,"bookId":13,"arabic":"وعن أبي الدرداء رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\"‏من حفظ عشر آيات من أول سورة الكهف، عصم من الدجال‏\"‏ وفي رواية‏:‏ ‏\"‏من آخر سورة الكهف‏\"‏ ‏(‏‏(‏رواهما مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Abud-Darda' (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said: \"Whoever commits to memory the first ten Ayat of the Surat Al-Kahf, will be protected from (the trial of) Ad-Dajjal (Antichrist).\".In another narration, the Messenger of Allah (ﷺ) said: \"(Whoever commits to memory) the last ten Ayat of Surat Al-Kahf, he will be protected from (the trial of) Ad-Dajjal (Antichrist).\""}},{"id":32,"idInBook":32,"chapterId":8,"bookId":13,"arabic":"-وعن ابن عباس رضي الله عنهما قال‏:‏ بينما جبريل عليه السلام قاعد عند النبي صلى الله عليه وسلم سمع نقيضًا من فوقه، فرفع رأسه فقال‏:‏ ‏\n\"‏هذا باب من السماء فتح اليوم ولم يفتح قط إلا اليوم، فنزل منه ملك فقال‏:‏ هذا ملك نزل إلى الأرض لم ينزل قط إلا اليوم، فسلم وقال‏:‏ أبشر بنورين أوتيتهما، لم يؤتهما نبي قبلك‏:‏ فاتحة الكتاب، وخواتيم سورة البقرة، لن تقرأ بحرف منها إلا أعطيته‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏\n‏‏النقيض‏:‏ الصوت‏‏.","english":{"narrator":"Ibn 'Abbas (May Allah be pleased with them) reported:","text":"While Jibril (Gabriel) was sitting with the Messenger of Allah (ﷺ), he heard a sound above him. He lifted his head, and said: \"This is a gate which has been opened in heaven today. It was never opened before.\" Then an angel descended through it, he said: \"This is an angel who has come down to earth. He never came down before.\" He sent greetings and said: \"Rejoice with two lights given to you. Such lights were not given to any Prophet before you. These (lights) are: Fatihah-til-Kitab (Surat Al-Fatihah), and the concluding Ayat of Surat Al-Baqarah. You will never recite a word from them without being given the blessings it contain s.\"."}},{"id":33,"idInBook":33,"chapterId":8,"bookId":13,"arabic":"وعن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏\n\"‏ما اجتمع قوم في بيت من بيوت الله يتلون كتاب الله، ويتدارسونه بينهم، إلا نزلت عليهم السكينة، وغشيتهم الرحمة، وحفتهم الملائكة، وذكرهم الله فيمن عنده‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"Any group of people that assemble in one of the Houses of Allah to recite the Book of Allah, learning and teaching it, tranquility will descend upon them, mercy will engulf them, angels will surround them and Allah will make mention of them to those (the angels) in His proximity.\"."}},{"id":34,"idInBook":34,"chapterId":8,"bookId":13,"arabic":"-وعن أبي هريرة رضي الله عنه قال‏:‏ سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ ‏\n\"‏إن أمتي يدعون يوم القيامة غرًا محجلين من آثار الوضوء فمن استطاع منكم أن يطيل غرته، فليفعل‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"I heard the Messenger of Allah (ﷺ) saying: \"On the Day of Resurrection, my followers (or Ummah) will be summoned 'Al-Ghurr Al-Muhajjalun' from the traces of Wudu'. Whoever can increase the area of his radiance should do so.\"."}},{"id":35,"idInBook":35,"chapterId":8,"bookId":13,"arabic":"وعنه قال‏:‏ سمعت خليلي صلى الله عليه وسلم يقول‏:‏ ‏\n\"‏تبلغ الحلية من المؤمن حيث يبلغ الوضوء‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"I heard my Khalil (the Messenger of Allah (ﷺ)) as saying, \"The adornment of the believer (in Jannah) will reach the places where the water of Wudu' reaches (his body).\"."}},{"id":36,"idInBook":36,"chapterId":8,"bookId":13,"arabic":"وعن عثمان بن عفان رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏\n\"‏من توضأ فأحسن الوضوء، خرجت خطاياه من جسده حتى تخرج من تحت أظفاره‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"'Uthman bin 'Affan (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"He who performs the Wudu' perfectly (i.e., according to Sunnah), his sins will depart from his body, even from under his nails.\"."}},{"id":37,"idInBook":37,"chapterId":8,"bookId":13,"arabic":"وعنه قال‏:‏ رأيت رسول الله  صلى الله عليه وسلم يتوضأ مثل وضوئي هذا ثم قال‏:‏ ‏\n\"‏من توضأ هكذا، غفر له ما تقدم من ذنبه، وكانت صلاته ومشيه إلى المسجد نافلة‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"'Uthman bin 'Affan (May Allah be pleased with him) reported:","text":"I saw the Messenger of Allah (ﷺ) performing Wudu' the way I have just done it and said, \"He who performs Wudu' like this, his previous sins will be forgiven and his Salat and walking to the mosque will be considered as supererogatory act of worship.\"."}},{"id":38,"idInBook":38,"chapterId":8,"bookId":13,"arabic":"-وعن أبي هريرة رضي الله عنه أن رسول الله  صلى الله عليه وسلم قال‏:‏ ‏\n\"‏إذا توضأ العبد المسلم - أو المؤمن- فغسل وجهه، خرج من وجهه كل خطيئة نظر إليها بعينيه مع الماء، أو مع آخر قطر الماء، فإذا غسل يديه، خرج من يديه كل خطيئة كان بطشتها يداه مع الماء، أو مع آخر قطر الماء، فإذا غسل رجليه، خرجت كل خطيئة مشتها رجلاه مع الماء، أو مع آخر قطر الماء، حتى يخرج نقيًا من الذنوب‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"When a Muslim, or a believer, washes his face (in the course of Wudu'), every sin which he committed with his eyes, will be washed away from his face with water, or with the last drop of water; when he washes his hands, every sin which is committed by his hands will be effaced from his hands with the water, or with the last drop of water; and when he washes his feet, every sin his feet committed will be washed away with the water, or with the last drop of water; until he finally emerges cleansed of all his sins.\"."}},{"id":39,"idInBook":39,"chapterId":8,"bookId":13,"arabic":"وعنه أن رسول الله صلى الله عليه وسلم أتى المقبرة فقال‏:‏ ‏\"‏السلام عليكم دار قوم مؤمنين وإنا إن شاء الله بكم لاحقون، وددت أنا قد رأينا إخواننا‏\"‏ قالوا‏:‏ أولسنا إخوانك يا رسول الله‏؟‏ قال‏:‏ ‏\"‏أنتم أصحابي، وإخواننا الذين لم يأتوا بعد‏\"‏ قالوا‏:‏ كيف تعرف من لم يأتِ بعد من أمتك يا رسول الله‏؟‏ فقال‏:‏ ‏\"‏أرأيت لو أن رجلا له خيل غر محجلة بين ظهري خيل دهم بهم، ألا يعرف خيله ‏؟‏‏\"‏ قالوا بلى يا رسول الله، قال‏:‏ فإنهم يأتون غرًا محجلين من الوضوء وأنا فرطهم على الحوض ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) went to the (Baqi') cemetery and said, \"May you be secured from punishment, O dwellers of abode of the believers! We, if Allah wills, will follow you. I wish we see my brothers.\" The Companions said, \"O Messenger of Allah! Are not we your brothers?\" He (ﷺ) said, \"You are my Companions, but my brothers are those who have not come into the world yet.\" They said; \"O Messenger of Allah! How will you recognize those of your Ummah who are not born yet?\" He (ﷺ) said, \"Say, if a man has white-footed horses with white foreheads among horses which are pure black, will he not recognize his own horses?\" They said; \"Certainly, O Messenger of Allah!\" He (ﷺ) said, \"They (my followers) will come with bright faces and white limbs because of Wudu'; and I will arrive at the Haud (Al-Kauthar) ahead of them.\"."}},{"id":40,"idInBook":40,"chapterId":8,"bookId":13,"arabic":"وعنه أن رسول الله صلى الله عليه وسلم قال ألا أدلكم على ما يمحو الله به الخطايا ويرفع به الدرجات قالوا بلى يارسول الله قال‏:‏ ‏\n\"‏إسباغ الوضوء على المكاره، وكثرة الخطا إلى المساجد، وانتظار الصلاة بعد الصلاة، فذلكم الرباط، فذلكم الرباط‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"","text":"Abu Hurairah (May Allah be pleased with him) reported that the Messenger of Allah (ﷺ) said, \"Shall I not tell you something by which Allah effaces the sins and elevates ranks (in Jannah)?\" The Companions said; \"Certainly, O Messenger of Allah.\" He (ﷺ) said, \"Performing the Wudu' thoroughly in spite of difficult circumstances, walking with more paces to the mosque, and waiting for the next As- Salat (the prayer) after observing Salat; and that is Ar-Ribat, and that is Ar-Ribat.\"."}},{"id":41,"idInBook":41,"chapterId":8,"bookId":13,"arabic":"وعن أبي مالك الأشعري رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏\n\"‏الطهور شطر الإيمان‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏ وقد سبق بطوله في باب الصبر‏.‏\nوفي الباب حديث عمرو بن عبسة رضي الله عنه السابق في آخر باب الرجاء، وهو حديث عظيم، مشتمل على جمل من الخيرات‏.‏","english":{"narrator":"Abu Malik Al-Ash'ari (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said: \"Purification is half the Iman.\"."}},{"id":42,"idInBook":42,"chapterId":8,"bookId":13,"arabic":"وعن عمر بن الخطاب رضي الله عنه عن النبي صلى الله عليه وسلم  قال‏:‏‏\"‏ما منكم من أحد يتوضا فيبلغ-أو فيسبغ الوضوء- ثم قال‏:‏ أشهد أن لا إله إلا الله وحده لا شريك له، وأشهد أن محمدًا عبده ورسوله، إلا فتحت له أبواب الجنة الثمانية يدخل من أيها شاء‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏ \nوزاد الترمذي‏:‏ ‏\"‏اللهم اجعلني من التوابين واجعلني من المتطهرين‏\"","english":{"narrator":"'Umar bin Al-Khattab (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"Whoever of you performs Wudu' carefully and then affirms: 'Ash-hadu an la ilaha illallahu Wahdahu la sharika Lahu, wa ash-hadu anna Muhammadan 'abduhu wa Rasuluhu .In the narration in At- Tirmidhi, it is added: \"Allahummaj-'alni minat-tawwabina, waj-'alni minal-mutatahhirin (O Allah make me among those who repent and purify themselves).\""}},{"id":43,"idInBook":43,"chapterId":8,"bookId":13,"arabic":"- عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\n\"‏لو يعلم الناس ما في النداء والصف الأول ثم لم يجدوا إلا أن يستهموا عليه لاستهموا عليه، ولو يعلمون ما في التهجير لاستبقوا إليه، ولو يعلمون ما في العتمة والصبح لأتوهما ولو حبوا‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏\n‏والاستهام‏:‏ الاقتراع‏.‏ والتهجير‏:‏ التبكير إلى الصلاة","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said: \"Were people to know the blessing of pronouncing Adhan and the standing in the first row, they would even draw lots to secure these privileges. And were they to realize the reward of performing Salat early, they would race for it; and were they to know the merits of Salat after nightfall ('Isha') and the dawn (Fajr) Salat, they would come to them even if they had to crawl.\"."}},{"id":44,"idInBook":44,"chapterId":8,"bookId":13,"arabic":"وعن معاوية رضي الله عنه قال‏:‏ سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ ‏\n\"‏المؤذنون أطول الناس أعناقًا يوم القيامة‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Mu'awiyah (May Allah be pleased with him) reported:","text":"I heard the Messenger of Allah (ﷺ) saying: \"The Mu'adhdhinun (callers to prayer) will have the longest necks on the Day of Resurrection.\"."}},{"id":45,"idInBook":45,"chapterId":8,"bookId":13,"arabic":"وعن عبد الله بن عبد الرحمن بن أبي صعصعة أن أبا سعيد الخدري رضي الله عنه قال له‏:‏ ‏\n\"‏إني أراك تحب الغنم والبادية فإذا كنت في غنمك- أو باديتك- فأذنت للصلاة، فارفع صوتك بالنداء، فإنه لا يسمع مدى صوت المؤذن جن، ولا إنس، ولا شيء، إلا شهد له يوم القيامة‏\"‏ قال أبو سعيد‏:‏ سمعته من رسول الله صلى الله عليه وسلم ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","english":{"narrator":"'Abdullah bin 'Abdur-Rahman reported:","text":"Abu Sa'id Al-Khudri (May Allah be pleased with him) said to me: \"I see that you like living among your sheep in wilderness. So whenever you are with your sheep or in wilderness and you want to call Adhan, you should raise your voice because whoever hears the Adhan, whether a human or jinn or any other creature, will testify for you on the Day of Resurrection.\" Abu Sa'id added: \"I heard this from the Messenger of Allah (ﷺ).\"."}},{"id":46,"idInBook":46,"chapterId":8,"bookId":13,"arabic":"- وعن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\n\"‏إذا نودي بالصلاة، أدبر الشيطان، له ضراط حتى لا يسمع التأذين، فإذا قضي النداء أقبل، حتى ثوب بالصلاة أدبر حتى إذا قضي التثويب أقبل حتى يخطر بين المرء ونفسه يقول‏:‏ اذكر كذا، واذكر كذا- لما لم يذكر من قبل- حتى يظل الرجل ما يدري كم صلى‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"When Adhan for Salat is pronounced, the devil takes to his heels and breaks wind with noise so as not to hear the call. When the Adhan is finished, he returns. When the Iqamah is announced, he turns his back, and after it is finished, he returns again to distract the attention of one and makes him remember things which he does not recall in his mind before the Salat, and says 'Remember this, and this,' and thus causes one to forget how many Rak'at he performed.\"."}},{"id":47,"idInBook":47,"chapterId":8,"bookId":13,"arabic":"وعن عبد الله بن عمرو بن العاص رضي الله عنهما أنه سمع رسول الله  صلى الله عليه وسلم يقول‏:‏ ‏\n\"‏إذا سمعتم النداء فقولوا مثل ما يقول، ثم صلوا علي، فإنه من صلى على صلاة صلى الله عليه بها عشرًا، ثم سلوا الله لي الوسيلة، فإنها منزلة في الجنة لا تنبغي إلا لعبد من عباد الله وأرجو أن أكون أنا هو، فمن سأل لي الوسيلة حلت له الشفاعة‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"'Abdullah bin 'Amr bin Al-'As (May Allah be pleased with them) reported:","text":"I heard the Messenger of Allah (ﷺ) saying, \"When you hear the Adhan, repeat what the Mu'adhdhin says. Then ask Allah to exalt my mention because everyone who does so will receive in return ten rewards from Allah. Then beseech Allah to grant me Al-Wasilah, which is a high rank in Jannah, fitting for only one of Allah's slaves; and I hope that I will be that man. If any one asks Al-Wasilah for me, it becomes incumbent upon me to intercede for him.\""}},{"id":48,"idInBook":48,"chapterId":8,"bookId":13,"arabic":"وعن أبي سعيد الخدري رضي الله عنه أن رسول الله  صلى الله عليه وسلم قال‏:‏ ‏\n\"‏إذا سمعتم النداء، فقولوا كما يقول المؤذن‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","english":{"narrator":"Abu Sa'id Al-Khudri (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"When you hear the Mu'adhdhin (pronouncing the call to Salat), repeat after him what he says.\"."}},{"id":49,"idInBook":49,"chapterId":8,"bookId":13,"arabic":"وعن جابر رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\n\"‏من قال حين يسمع النداء‏:‏ اللهم رب هذه الدعوة التامة، والصلاة القائمة، آت محمدًا الوسيلة والفضيلة، وابعثه مقامًا محمودًا الذي وعدته، حلت له شفاعتي يوم القيامة‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","english":{"narrator":"Jabir (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"He who says upon hearing the Adhan: 'Allahumma Rabba hadhihid-da'wati-ttammati, was-salatil-qa'imati, ati Muhammadanil-wasilata wal-fadhilata, wab'athu maqaman mahmuda nilladhi wa 'adtahu ."}},{"id":50,"idInBook":50,"chapterId":8,"bookId":13,"arabic":"وعن سعد بن أبي وقاص رضي الله عنه عن النبي صلى الله عليه وسلم أنه قال‏:‏‏\n\"‏من قال حين يسمع المؤذن‏:‏ أشهد أن لا إله إلا الله وحده لا شريك له، وأن محمدًا عبده ورسوله، رضيت بالله ربًا وبالإسلام دينًا، غفر له ذنبه‏\"‏‏(‏‏(‏رواه الترمذي وقال حديث حسن‏)‏‏)‏‏.‏","english":{"narrator":"Sa'd bin Abu Waqqas (May Allah be pleased with him) reported:","text":"The Prophet (ﷺ) said, \"He who says after the Adhan: 'Ash-hadu an la ilaha illallah Wah-dahu la sharika Lahu; wa ash-hadu anna Muhammadan 'abduhu wa Rasuluhu, radhitu Billahi Rabban, wa bi Muhammadin Rasulan, wa bil Islami Dinan ."}},{"id":51,"idInBook":51,"chapterId":8,"bookId":13,"arabic":"وعن أنس قال : قَالَ رسول الله : « الدُّعَاءُ لا يُرَدُّ بَيْنَ الأَذَانِ وَالإقَامَةِ » . رواه أَبُو داود والترمذي ، وقال : ( حَدِيثٌ حَسَنٌ )","english":{"narrator":"Anas (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said: \"The supplication made between the Adhan and the Iqamah is never rejected.\"."}},{"id":52,"idInBook":52,"chapterId":8,"bookId":13,"arabic":"وعن أبي هريرة رضي الله عنه قال‏:‏ سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ ‏\"‏أرأيتم لو أن نهرًا بباب أحدكم يغتسل منه كل يوم خمس مرات، هل يبقى من درنه شيء‏؟‏‏\"‏ قالوا‏:‏ لا يبقى من درنه شيء، قال‏:‏ ‏\"‏فذلك مثل الصلوات الخمس، يمحو الله بهن الخطايا‏\"‏‏.‏‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","english":{"narrator":"Abu Hurairahu (May Allah be pleased with him) reported:","text":"I heard the Messenger of Allah (ﷺ) saying, \"Say, if there were a river at the door of one of you in which he takes a bath five times a day, would any soiling remain on him?\" They replied, \"No soiling would left on him.\" He (ﷺ) said, \" That is the five (obligatory) Salat (prayers). Allah obliterates all sins as a result of performing them.\"."}},{"id":53,"idInBook":53,"chapterId":8,"bookId":13,"arabic":"وعن جابر رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏‏\n\"‏مثل الصلوات الخمس كمثل نهر غمر جار على باب أحدكم يغتسل منه كل يوم خمس مرات‏\"‏‏.‏‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Jabiru (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"The similitude of the five (obligatory) Salat is like a river running at the door of one of you in which he takes a bath five times a day.\"."}},{"id":54,"idInBook":54,"chapterId":8,"bookId":13,"arabic":"وعن ابن مسعود رضي الله عنه أن رجلا أصاب من امرأة قُبلةً، فأتى النبي صلى الله عليه وسلم فأخبره فأنزل الله تعالى‏:‏ ‏{‏أقم الصلاة طرفي النهار وزلفًا من الليل، إن الحسنات يذهبن السيئات‏}‏ فقال الرجل‏:‏ ألي هذا‏؟‏ قال‏:‏ ‏\n\"‏لجميع أمتي كلهم‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","english":{"narrator":"Ibn Mas'ud (May Allah be pleased with him) reported:","text":"A man kissed a woman. So he came to the Messenger of Allah (ﷺ) and informed him about it. Then Allah revealed this Ayah: \"And perform the Salat, between the two ends of the day and in some hours of the night. Verily, the good deeds efface the evil deeds (i.e., minor sins).\" (11:114) The man asked the Messenger of Allah (ﷺ) whether this applies to him only. The Messenger of Allah (ﷺ) said, \"It applies to all of my Ummah.\"."}},{"id":55,"idInBook":55,"chapterId":8,"bookId":13,"arabic":"عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏‏\n\"‏الصلوات الخمس، والجمعة إلى الجمعة، كفارة لما بينهن، ما لم تغشَ الكبائر‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"The five (daily) Salat (prayers) and the Friday (prayer) to the Friday (prayer) expiate whatever (minor sins) may be committed in between, so long as major sins are avoided.\"."}},{"id":56,"idInBook":56,"chapterId":8,"bookId":13,"arabic":"وعن عثمان بن عفان رضي الله عنه قال‏:‏ سمعت النبي صلى الله عليه وسلم يقول‏:‏ ‏\n\"‏ما من امرئ مسلم تحضره صلاة مكتوبة فيحسن وضوءها وخشوعها وركوعها إلا كانت كفارة لما قبلها من الذنوب مالم تؤتَ كبيرة وذلك الدهر كله‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"'Uthman bin 'Affan (May Allah be pleased with him) reported:","text":"I heard Messenger of Allah (ﷺ) saying, \"When the time for a prescribed Salat is due and a Muslim performs its Wudu' and its acts of bowing and prostration properly, this Salat will be an expiation for his past sins, so long as he does not commit major sins, and this applies for ever.\"."}},{"id":57,"idInBook":57,"chapterId":8,"bookId":13,"arabic":"عن أبي موسى رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏‏\n\"‏من صلى البردين دخل الجنة‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","english":{"narrator":"Abu Musa (May Allah be pleased with him) reported:","text":"Messenger of Allah (ﷺ) said, \"He who The observes Al-Bardan (i.e., Fajr and 'Asr prayers) will enter Jannah.\"."}},{"id":58,"idInBook":58,"chapterId":8,"bookId":13,"arabic":"وعن أبي زهير عمارة بن رؤيبة رضي الله عنه قال، سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ ‏\"‏لن يلج النار أحد صلى قبل طلوع الشمس وقبل غروبها‏\"‏ (11) ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Abu Zuhair 'Umarah Ruwaibah (May Allah be pleased with him) reported:","text":"I heard the Messenger of Allah (ﷺ) saying: \"He who performs Salat (prayers) before the rising of the sun and before its setting, will not enter the Hell.\"."}},{"id":59,"idInBook":59,"chapterId":8,"bookId":13,"arabic":"وعن جندب بن سفيان رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏\n\"‏من صلى الصبح فهو في ذمة الله فانظر يابن آدم، لا يطلبنك الله من ذمته بشيء‏\"‏‏.‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Jundub bin Sufyan (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"He who offers the dawn (Fajr) prayers will come under the Protection of Allah. O son of Adam! Beware, lest Allah should call you to account in any respect from (for withdrawing) His Protection.\"."}},{"id":60,"idInBook":60,"chapterId":8,"bookId":13,"arabic":"وعن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏\n\"‏يتعاقبون فيكم ملائكة بالليل، وملائكة بالنهار، ويجتمعون في صلاة الصبح وصلاة العصر، ثم يعرج الذين باتوا فيكم، فيسألهم الله -وهو أعلم بهم-‏:‏ كيف تركتم عبادي‏؟‏ فيقولون تركناهم وهم يصلون، وأتيناهم وهم يصلون‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"There are angels who take turns in visiting you by night and by day, and they all assemble at the dawn (Fajr) and the afternoon ('Asr) prayers. Those who have spent the night with you, ascend to the heaven and their Rubb, Who knows better about them, asks: 'In what condition did you leave My slaves?' They reply: 'We left them while they were performing Salat and we went to them while they were performing Salat.\"'."}},{"id":61,"idInBook":61,"chapterId":8,"bookId":13,"arabic":"- وعن جرير بن عبد الله البجلي رضي الله عنه قال‏:‏ كنا عند النبي صلى الله عليه وسلم، فنظر إلى القمر ليلة البدر فقال‏:‏ ‏\"‏إنكم سترون ربكم كما ترون هذا القمر، لاتضامون في رؤيته، فإن استطعتم أن لا تغلبو على صلاة قبل طلوع الشمس، وقبل غروبها فافعلوا‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏ ‏(‏‏(‏وفي رواية‏:‏ ‏\"‏فنظر إلى القمر ليلة أربع عشرة‏\"‏‏)‏‏)‏‏.‏","english":{"narrator":"Jarir bin 'Abdullah Al-Bajali (May Allah be pleased with him) reported:","text":"We were sitting with the Messenger of Allah (ﷺ) when he looked at the full moon and observed, \"You will see your Rubb in the Hereafter as you see this moon having no difficulty in seeing it. So try your best to perform the prayers before the rising of the sun and that before its setting.\"."}},{"id":62,"idInBook":62,"chapterId":8,"bookId":13,"arabic":"وعن بريدة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏‏\n\"‏من ترك صلاة العصر فقد حبط عمله‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","english":{"narrator":"Buraidah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"He who misses the 'Asr Salat (deliberately), his deeds will be rendered nul and void.\"."}},{"id":63,"idInBook":63,"chapterId":8,"bookId":13,"arabic":"عن أبي هريرة رضي الله عنه أن النبي صلى الله عليه وسلم قال‏:‏ ‏\n\"‏ من غدا إلى المسجد أو راح، أعد الله له في الجنة نزلا كلما غدا أو راح‏\"‏‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"He who goes to the mosque in the morning or in the evening, Allah prepares for him a place in Jannah whenever he goes to the mosque in the morning and returns from it in the evening.\"."}},{"id":64,"idInBook":64,"chapterId":8,"bookId":13,"arabic":"وعنه أن النبي صلى الله عليه وسلم قال‏:‏‏\n\"‏من تطهر في بيته، ثم مضى إلى بيت من بيوت الله، ليقضي فريضة من فرائض الله كانت خطواته، إحداها تحط خطيئة، والأخرى ترفع درجة‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Prophet (ﷺ) said, \"He who purifies (performs Wudu') himself in his house and then walks to one of the houses of Allah (mosque) for performing an obligatory Salat, one step of his will wipe out his sins and another step will elevate his rank (in Jannah).\"."}},{"id":65,"idInBook":65,"chapterId":8,"bookId":13,"arabic":"-وعن أبي بن كعب رضي الله عنه قال‏:‏ كان رجل من الأنصار لا أعلم أحدًا أبعد من المسجد منه، وكانت لا تخطئه صلاة‏!‏ فقيل له‏:‏ لو اشتريت حمارًا تركبه في الظلماء وفي الرمضاء قال‏:‏ ما يسرني أن منزلي إلى جنب المسجد إني أريد أن يكتب لي ممشاي إلى المسجد، ورجوعي إذا رجعت إلى أهلي، فقال رسول الله صلى الله عليه وسلم‏:‏ ‏\n\"‏قد جمع الله لك ذلك كله‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Ubayy bin Ka'b (May Allah be pleased with him) reported:","text":"There was a man of the Ansar whose house was the farthest from the mosque. As far as I know, he never missed Salat (in congregation). It was said to him: \"If you buy a donkey, you may ride upon it in the dark nights and in the hot days.\" He said: \"I do not like that my house should be situated close to the mosque. I desire that my walking towards the mosque and returning home be recorded to my credit.\" Upon this the Messenger of Allah (ﷺ) said, \"Allah has gathered all (rewards) for you.\"."}},{"id":66,"idInBook":66,"chapterId":8,"bookId":13,"arabic":"وعن جابر رضي الله عنه قال‏:‏ خلت البقاع حول المسجد فأراد بنو سلمة أن ينتقلوا قرب المسجد، فبلغ ذلك النبي صلى الله عليه وسلم فقال لهم‏:‏ ‏\"‏بلغني أنكم تريدون أن تنتقلوا قرب المسجد‏؟‏ قالوا‏:‏ نعم يا رسول الله قد أردنا ذلك، فقال‏:‏ ‏\"‏ بني سلمة دياركم تكتب آثاركم، دياركم تكتب آثاركم‏\"‏ فقالوا‏:‏ ما يسرنا أنا كنا تحولنا‏\"‏ ‏(‏‏(‏رواه مسلم، وروى البخاري معناه من رواية أنس‏)‏‏)‏‏.‏","english":{"narrator":"Jabir (May Allah be pleased with him) reported:","text":"There were some plots of land lying vacant around the mosque. The people of Banu Salamah decided to move to this land and come nearer to the mosque. The Messenger of Allah (ﷺ) heard about it and said to them, \"I have heard that you intend to move near the mosque.\" They said: \"Yes, O Messenger of Allah! We have decided to do that.\" Thereupon the Messenger of Allah (ﷺ) said, \"O Banu Salamah! Stay in your houses, because your footprints (when you come to the mosque) will be recorded.\" He said this twice. They said: \"We would not have liked it, had we moved near the mosque.\"."}},{"id":67,"idInBook":67,"chapterId":8,"bookId":13,"arabic":"وعن أبي موسى الأشعري رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏\n\"‏إن أعظم الناس أجرًا في الصلاة أبعدهم إليها ممشى، فأبعدهم، والذي ينتظر الصلاة حتى يصليها مع الإمام أعظم أجرًا من الذي يصليها ثم ينام‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","english":{"narrator":"Abu Musa (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"The person who will receive the highest reward for Salat (prayer) is the one who comes to perform it in the mosque from the farthest distance. And he who waits for Salat to perform it with the Imam (in congregation) will have a greater reward than the one who observes it alone and then goes to sleep.\"."}},{"id":68,"idInBook":68,"chapterId":8,"bookId":13,"arabic":"وعن بريدة رضي الله عنه عن النبي صلى الله عليه وسلم ‏:‏ ‏\n\"‏بشروا المشائين في الظلم إلى المساجد بالنور التام يوم القيامة‏\"‏ ‏(‏‏(‏رواه  أبو داود والترمذي‏)‏‏)‏‏.‏","english":{"narrator":"Buraidah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"Convey glad tidings to those who walk to the mosque in the darkness. For they will be given full light on the Day of Resurrection.\"."}},{"id":69,"idInBook":69,"chapterId":8,"bookId":13,"arabic":"وعن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\"‏ألا أدلكم على ما يمحو الله به الخطايا، ويرفع به الدرجات‏؟‏ ‏\"‏ قالوا بلى يا رسول الله‏.‏ قال‏:‏ ‏\"‏إسباغ الوضوء على المكاره، وكثرة الخطا إلى المساجد، وانتظار الصلاة بعد الصلاة، فذلكم الرباط، فذلكم الرباط‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"Shall I not tell you something by which Allah effaces the sins and elevates the ranks (in Jannah).\" The Companions said: \"Yes (please tell us), O Messenger of Allah.\" He said, \"Performing the Wudu' properly in spite of difficult circumstances, walking with more paces to the mosque, and waiting for the next Salat (prayer) after a observing Salat; and that is Ar-Ribat, and that is Ar-Ribat.\"."}},{"id":70,"idInBook":70,"chapterId":8,"bookId":13,"arabic":"وعن أبي سعيد الخدري رضي الله عنه عن النبي صلى الله عليه وسلم قال‏:‏ ‏\"‏إذا رأيتم الرجل يعتاد المساجد فاشهدوا له بالإيمان، قال الله عز وجل ‏{‏إنما يعمر مساجد الله من آمن بالله واليوم الآخر‏}‏ ‏(‏‏(‏الآية‏.‏ رواه الترمذي وقال حديث حسن‏)‏‏)‏‏.‏","english":{"narrator":"Abu Sa'id Al-Khudri (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"When you see a man frequenting the mosque, testify that he is a believer because Allah says: 'Allah's mosques are visited only by those who believe in Allah and the Last Day.\"'."}},{"id":71,"idInBook":71,"chapterId":8,"bookId":13,"arabic":"وعن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\n\"‏لا يزال أحدكم في صلاة مادامت الصلاة تحبسه لا يمنعه أن ينقلب إلى أهله إلا الصلاة‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"Everyone among you will be deemed to be occupied in Salat (prayer) constantly so long as Salat (the prayer) detains him (from worldly concerns), and nothing prevents him from returning to his family but Salat.\"."}},{"id":72,"idInBook":72,"chapterId":8,"bookId":13,"arabic":"وعنه أن رسول الله صلى الله عليه وسلم قال‏:‏ الملائكة تصلي على أحدكم ما دام في مصلاه الذي صلى فيه ما لم يحدث تقول اللهم اغفر له اللهم ارحمه‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"The angels supplicate in favour of one of you so long as he remains in the place where he has performed Salat (prayer) in a state of Wudu'. They (the angels) say: 'O Allah! Forgive him, O Allah! Have mercy on him.\"'."}},{"id":73,"idInBook":73,"chapterId":8,"bookId":13,"arabic":"وعن أنس رضي الله عنه أن رسول الله صلى الله عليه وسلم أخر ليلة صلاة العشاء إلى شطر الليل ثم أقبل علينا بوجهه بعدما صلى فقال‏:‏ ‏\n\"‏صلى الناس ورقدوا ولم تزالوا في صلاة منذ انتظرتموها‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏","english":{"narrator":"Anas (May Allah be pleased with him) reported:","text":"Once the Messenger of Allah (ﷺ) delayed the night prayer ('Isha') till midnight. He (ﷺ) turned to us after Salat (prayer) and said, \"The people slept after performing their Salat, but you who waited, will be accounted as engaged in Salat throughout the period of your waiting.\"."}},{"id":74,"idInBook":74,"chapterId":8,"bookId":13,"arabic":"وعن ابن عمر رضي الله عنهما أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\"‏صلاة الجماعة أفضل من صلاة الفذ بسبع وعشرين درجة‏)‏‏)‏‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","english":{"narrator":"Ibn 'Umar (May Allah be pleased with them) reported:","text":"The Messenger of Allah (ﷺ) said, \"Salat in congregation is twenty-seven times more meritorious than a Salat performed individually.\"."}},{"id":75,"idInBook":75,"chapterId":8,"bookId":13,"arabic":"وعن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\n\"‏صلاة الرجل في جماعة تُضعَّف على صلاته في بيته وفي سوقه خمسًا وعشرين ضعفًا، وذلك أنه إذا توضأ فأحسن الوضوء، ثم خرج إلى المسجد، لا يخرجه إلا الصلاة، لم يخطُ خطوة إلا رفعت له بها درجة، وحطت عنه بها خطيئة، فإذا صلى لم تزل الملائكة تصلي عليه ما دام في مصلاه، ما لم يحدث، تقول اللهم صلِّ عليه، اللهم ارحمه‏.‏ ولا يزال في صلاة ما انتظر الصلاة‏\"‏ ‏(‏‏(‏متفق عليه‏.‏ وهذا لفظ البخاري‏)‏‏)‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"A man's Salat in congregation is twenty-five times more rewarding than his Salat at home or in his shop, and that is because when he performs his Wudu' properly and proceeds towards the mosque with the purpose of performing Salat in congregation, he does not take a step without being raised a degree (in rank) for it and having a sin remitted for it, till he enters the mosque. When he is performing Salat, the angels continue to invoke Blessings of Allah on him as long as he is in his place of worship in a state of Wudu'. They say: 'O Allah! Have mercy on him! O Allah! Forgive him.' He is deemed to be engaged in Salat as long as he waits for it.\"."}},{"id":76,"idInBook":76,"chapterId":8,"bookId":13,"arabic":"وعنه قال‏:‏ أتى النبي صلى الله عليه وسلم رجل أعمي، فقال‏:‏ يا رسول الله، ليس لي قائد يقودني إلى المسجد، فسأل رسول الله صلى الله عليه وسلم أن يرخص له فيصلي في بيته، فرخص له، فلما ولى دعاه فقال له‏:‏ ‏\"‏هل تسمع النداء بالصلاة‏؟‏ ‏\"‏ قال نعم، قال‏:‏ ‏\"‏فأجب‏\"‏ ‏(‏‏(‏رواه  مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"A blind man came to the Messenger of Allah (ﷺ) and said: \"O Messenger of Allah! I have no one to guide me to the mosque.\" He, therefore, sought his permission to perform Salat (prayer) in his house. He (ﷺ) granted him permission. When the man turned away, he called him back, and said, \"Do you hear the Adhan (call to prayer)?\" He replied in the affirmative. The Messenger of Allah (ﷺ) then directed him to respond to it.."}},{"id":77,"idInBook":77,"chapterId":8,"bookId":13,"arabic":"وعن عبد الله- وقيل‏:‏ عمرو بن قيس المعروف بابن أم مكتوم المؤذن رضي الله عنه أنه قال‏:‏ يا رسول الله إن المدينة كثيرة الهوام والسباع‏.‏ فقال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏تسمع حي على الصلاة، حي على الفلاح، فحيهلا‏\"‏ ‏(‏‏(‏رواه  أبو داود بإسناد حسن‏.‏ (12)","english":{"narrator":"'Abdullah bin Umm Maktum, the Mu'adhdhin (May Allah be pleased with him) reported:","text":"I said to the Messenger of Allah (ﷺ): \"There are many poisonous insects and wild beasts in Al-Madinah, and I am blind. Please grant me permission to perform Salat at home.\" He (ﷺ) enquired whether he could hear the call: Hayya 'alas-Salah; Hayya 'alal-Falah (Come to the prayer, come to the salvation). When he replied in affirmative, the Messenger of Allah (ﷺ) directed him to come (to mosque) for prayer.\"."}},{"id":78,"idInBook":78,"chapterId":8,"bookId":13,"arabic":"وعن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\n\"‏والذي نفسي بيده، لقد هممت أن آمر بحطب فيحتطب، ثم آمر بالصلاة فيؤذن لها، ثم آمر رجلا فيؤم الناس، ثم أخالف إلى رجال فأحرق عليهم بيوتهم‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"By Him in Whose Hand my life is, I sometimes thought of giving orders for firewood to be collected, then for proclaiming the Adhan for Salat. Then I would appoint an Imam to lead Salat, and then go to the houses of those who do not come to perform Salat in congregation, and set fire to their houses on them.\"."}},{"id":79,"idInBook":79,"chapterId":8,"bookId":13,"arabic":"وعن ابن مسعود رضي الله عنه قال‏:‏ من سره أن يلقى الله تعالى غدًا مسلمًا، فليحافظ على هؤلاء الصلوات، حيث ينادى بهن، فإن الله شرع لنبيكم صلى الله عليه وسلم سنن الهدى، وإنهن من سنن الهدى، ولو أنكم صليتم في بيوتكم كما يصلي هذا المتخلف في بيته لتركتم سنة نبيكم، ولو تركتم سنة نبيكم لضللتم، ولقد رأيتنا وما يتخلف عنها إلا منافق معلوم النفاق، ولقد كان الرجل يؤتى به، يهادى بين الرجلين حتى يقام في الصف‏.‏ ‏(‏‏(‏رواه مسلم وفي رواية له قال‏:‏ إن رسول الله صلى الله عليه وسلم علمنا سنن الهدى، وإن من الهدى الصلاة في المسجد الذي يؤذن فيه‏)‏‏)‏‏.‏","english":{"narrator":"Ibn Mas'ud (May Allah be pleased with him) reported:","text":"He who likes to meet Allah tomorrow (i.e., on the Day of Requital) as a Muslim, should take care and observe the Salat when the Adhan is announced for them. Allah has expounded to your Prophet (ﷺ) the ways of right guidance, and these (the prayers) are part of the right guidance. If you have to perform Salat in your houses, as this man who stays away (from the mosque) and performs Salat in his house, you will abandon the Sunnah (practice) of your Prophet (ﷺ), and the departure from the Sunnah of your Prophet (ﷺ) will lead you astray. I have seen the time when no one stayed behind except a well-known hypocrite. I also saw that a man was brought swaying (on account of weakness) between two men till he was set up in a row (in the mosque).."}},{"id":80,"idInBook":80,"chapterId":8,"bookId":13,"arabic":"وعن أبي الدرداء رضي الله عنه قال‏:‏ سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ ‏\n\"‏ما من ثلاثة في قرية ولا بدو لا تقام فيهم الصلاة إلا قد استحوذ عليهم الشيطان‏.‏ فعليكم بالجماعة، فإنما يأكل الذئب من الغنم القاصية‏\"‏ ‏(‏‏(‏رواه  أبو داود بإسناد حسن‏)‏‏)‏‏.‏","english":{"narrator":"Abud-Darda' (May Allah be pleased with him)reported:","text":"I heard the Messenger of Allah (ﷺ) saying, \"If three men in a village or in the desert, make no arrangement for Salat in congregation, Satan must have certainly overcome them. So observe Salat in congregation, for the wolf eats up a solitary sheep that stays far from the flock.\"."}},{"id":81,"idInBook":81,"chapterId":8,"bookId":13,"arabic":"عن عثمان بن عفان رضي الله عنه قال‏:‏ سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ ‏\"‏من صلى العشاء في جماعة، فكأنما قام نصف الليل ومن صلى الصبح في جماعة، فكانما صلى الليل كله‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏ \nوفي رواية الترمذي عن عثمان بن عفان رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏من شهد العشاء في جماعة كان له قيام نصف ليلة، ومن شهد العشاء والفجر في جماعة، كان له كقيام ليلة‏\"‏ ‏(‏‏(‏قال الترمذي حديث حسن صحيح‏)‏‏)‏","english":{"narrator":"'Uthman bin 'Affan (May Allah be pleased with him) reported:","text":"I heard the Messenger of Allah (ﷺ) saying: \"One who performs 'Isha' prayer in congregation, is as if he has performed Salat for half of the night. And one who performs the Fajr prayer in congregation, is as if he has performed Salat the whole night.\"The narration of At-Tirmidhi says: 'Uthman bin Affan (May Allah be pleased with him) narrated that he had heard the Messenger of Allah (ﷺ) saying: \"He who attends 'Isha' in congregation, is as if he has performed Salat for half of the night; and he who attends 'Isha' and Fajr prayers in congregation, is as if he has performed Salat for the whole night.\""}},{"id":82,"idInBook":82,"chapterId":8,"bookId":13,"arabic":"وعن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\n\"‏ولو يعلمون ما في العتمة والصبح لأتوهما ولو حبوًا‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏ وقد سبق بطوله‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him)reported:","text":"The Messenger of Allah (ﷺ) said, \"If they knew the merits of Salat after nightfall ('Isha') and the morning (Fajr) Salat, they would come to them even if they had to crawl to do so.\"This is part of a long Hadith which has already been mentioned. See Hadith No. 1033."}},{"id":83,"idInBook":83,"chapterId":8,"bookId":13,"arabic":"وعنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\n\"‏ليس صلاة أثقل على المنافقين من صلاة الفجر والعشاء ولو يعلمون ما فيهما  لأتوهما ولو حبوًا‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"No Salat is more burdensome to the hypocrites than the Fajr (dawn) prayer and the 'Isha' (night) prayer; and if they knew their merits, they would come to them even if they had to crawl to do so.\"."}},{"id":84,"idInBook":84,"chapterId":8,"bookId":13,"arabic":"وعن ابن مسعود رضي الله عنه قال‏:‏ سألت رسول الله صلى الله عليه وسلم ‏:‏ أي الأعمال أفضل‏؟‏ قال‏:‏ ‏\"‏الصلاة على أوقتها‏\"‏ قلت‏:‏ ثم أي‏؟‏ قال‏:‏ ‏\"‏بر الوالدين‏\"‏ قلت ثم أي‏؟‏ قال‏:‏ ‏\"‏ الجهاد في سبيل الله‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","english":{"narrator":"Ibn Mas'ud (May Allah be pleased with him) reported:","text":"I asked the Messenger of Allah (ﷺ): \"Which act is the best?\" He (ﷺ) said, \"As-Salat at their fixed times.\" I asked, \"What next?\" He (ﷺ) said, \"Being dutiful to parents.\" I asked, \"What next?\" He (ﷺ) said, \"Striving (Jihad) in the way of Allah.\"."}},{"id":85,"idInBook":85,"chapterId":8,"bookId":13,"arabic":"وعن ابن عمر رضي الله عنهما قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏\n\"‏ بني الإسلام على خمس‏:‏ شهادة أن لا إله إلا الله وأن محمدًا رسول الله، وإقام الصلاة، وإيتاء الزكاة، وحج البيت، وصوم رمضان‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","english":{"narrator":"Ibn 'Umar (May Allah be pleased with them) reported:","text":"The Messenger of Allah (ﷺ) said, \"Islam is based on five (pillars): testifying that there is no true god except Allah and that Muhammad (ﷺ) is His slave and Messenger; performing of Salat (Iqamat-as-Salat); the payment of Zakat; performing Hajj (pilgrimage) to the House ."}},{"id":86,"idInBook":86,"chapterId":8,"bookId":13,"arabic":"وعنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏\n\"‏أمرت أن أقاتل الناس حتى يشهدوا أن لا إله إلا الله وأن محمدًا رسول الله، ويقيموا الصلاة ويؤتوا الزكاة، فإذا فعلوا ذلك، عصموا مني دماءهم وأموالهم إلا بحق الإسلام، وحسابهم على الله‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","english":{"narrator":"Ibn 'Umar (May Allah be pleased with them) reported:","text":"The Messenger of Allah (ﷺ) said, \"I have been commanded to fight against the people till they testify La ilaha illAllah (There is no true god except Allah) and that Muhammad (ﷺ) is His slave and Messenger, and to establish As-Salat (Iqamat-as-Salat), and to pay Zakat; and if they do this, then their blood and property are secured except by the rights of Islam, and their accountability is left to Allah.\"."}},{"id":87,"idInBook":87,"chapterId":8,"bookId":13,"arabic":"وعن معاذ رضي الله عنه قال‏:‏ بعثني رسول الله صلى الله عليه وسلم إلى اليمن فقال‏:‏ ‏\n\"‏إنك تأتي قومًا من أهل الكتاب، فادعهم إلى شهادة أن لا إله إلا الله وأني رسول الله، فإن هم أطاعوا لذلك، فأعلمهم أن الله تعالى افترض عليهم خمس صلوات في كل يوم وليلة، فإن هم أطاعوا لذلك، فأعلمهم أن الله تعالى افترض عليهم صدقة تؤخذ من أغنيائهم فترد على فقرائهم، فإن هم اطاعوا لذلك، فإياك وكرائم أموالهم واتقِ دعوة المظلوم فإنه ليس بينها وبين الله حجاب‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","english":{"narrator":"Mu'adh (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) sent me as a governor to Yemen and (at the time of departure) he instructed me thus: \"You will go to people of the Scripture (i.e., the Jews and the Christians). First of all invite them to testify that La ilaha ill Allah (There is no true god except Allah) and that Muhammad (ﷺ) is His slave and Messenger; and if they accept this, then tell them that Allah has enjoined upon them five Salat (prayers) during the day and night; and if they accept it, then tell them that Allah has made the payment of Zakat obligatory upon them. It should be collected from their rich and distributed among their poor; and if they agree to it, don't take (as a share of Zakat) the best of their properties. Beware of the supplications of the oppressed, for there is no barrier between it and Allah.\"."}},{"id":88,"idInBook":88,"chapterId":8,"bookId":13,"arabic":"وعن جابر رضي الله عنه قال‏:‏ سمعت رسول الله  صلى الله عليه وسلم يقول‏:‏ ‏\n\"‏إن بين الرجل وبين الشرك والكفر ترك الصلاة‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Jabir (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"Between a man and disbelief and paganism is the abandonment of Salat (prayer).\"."}},{"id":89,"idInBook":89,"chapterId":8,"bookId":13,"arabic":"وعن بريدة رضي الله عنه عن النبي صلى الله عليه وسلم قال‏:‏ ‏\n\"‏العهد الذي بيننا وبينهم الصلاة، فمن تركها فقد كفر‏\"‏ ‏(‏‏(‏رواه  الترمذي وقال‏:‏ حديث حسن صحيح‏)‏‏)‏‏.‏","english":{"narrator":"Buraidah (May Allah be pleased with him) reported:","text":"Messenger of Allah (ﷺ) said, \"That which differentiates us from the disbelievers and hypocrites is our performance of Salat. He who abandons it, becomes a disbeliever.\"."}},{"id":90,"idInBook":90,"chapterId":8,"bookId":13,"arabic":"وعن شقيق بن عبد الله التابعي المتفق على جلالته رحمه الله قال‏:‏ كان أصحاب محمد صلى الله عليه وسلم لا يرون شيئًا من الأعمال تركه كفر غير الصلاة‏.‏ ‏(‏‏(‏رواه  الترمذي في كتاب الإيمان بإسناد صحيح‏)‏‏)‏‏.‏","english":{"narrator":"Shaqiq bin 'Abdullah reported:","text":"The Companions of the Messenger of Allah (ﷺ) did not consider the abandonment of any action as disbelief except neglecting Salat.."}},{"id":91,"idInBook":91,"chapterId":8,"bookId":13,"arabic":"وعن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله  صلى الله عليه وسلم‏:‏ ‏\n\"‏إن أول ما يحاسب به العبد يوم القيامة من عمله صلاته، فإن صلحت، فقد أفلح وأنجح، وإن فسدت، فقد خاب وخسر، فإن انتقص من فريضته شيئًا، قال الرب، عز وجل‏:‏ انظروا هل لعبدي من تطوع، فيكمل منها ما انتقص من الفريضة‏؟‏ ثم يكون سائر أعماله على هذا‏\"‏ ‏(‏‏(‏رواه  الترمذي وقال حديث حسن‏)‏‏)‏‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"The first of man's deeds for which he will be called to account on the Day of Resurrection will be Salat. If it is found to be perfect, he will be safe and successful; but if it is incomplete, he will be unfortunate and a loser. If any shortcoming is found in the obligatory Salat, the Glorious and Exalted Rubb will command to see whether His slave has offered any voluntary Salat so that the obligatory Salat may be made up by it. Then the rest of his actions will be treated in the same manner.\"."}},{"id":92,"idInBook":92,"chapterId":8,"bookId":13,"arabic":"عن جابر بن سمرة، رضي الله عنهما، قال‏:‏ خرج علينا رسول الله صلى الله عليه وسلم فقال‏:‏ ‏\"‏ألا تصفون كما تصف الملائكة عند ربها‏؟‏‏\"‏ فقلنا‏:‏ يا رسول الله وكيف تصف الملائكة عند ربها‏؟‏ قال‏:‏ ‏\"‏يتمون الصفوف الأُول، ويتراصون في الصف‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Jabir bin Samurah (May Allah be pleased with them) reported:","text":"The Messenger of Allah (ﷺ) came out to us (once) and said, \"Why do you not stand in rows as the angels do before their Rubb?\" We asked: \"O Messenger of Allah! how do the angels stand in rows before their Rubb?\" He (ﷺ) replied, \"They complete each row beginning with the first and filling all the gaps.\"."}},{"id":93,"idInBook":93,"chapterId":8,"bookId":13,"arabic":"وعن أبي هريرة رضي الله عنه أن رسول الله  صلى الله عليه وسلم قال‏:‏ ‏\n\"‏لو يعلم  الناس ما في النداء والصف الأول، ثم لم يجدوا إلا أن يستهموا عليه لاستهموا‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"If people came to know the blessing of calling Adhan and the standing in the first row, they could do nothing but would draw lots to secure these privileges.\"."}},{"id":94,"idInBook":94,"chapterId":8,"bookId":13,"arabic":"وعنه قال‏:‏ قال رسول الله  صلى الله عليه وسلم‏:‏ ‏\n\"‏خير صفوف الرجال أولها، وشرها آخرها، وخير صفوف النساء آخرها، وشرها أولها‏\"‏‏.‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"The best of the men's rows (in Salat) is the first row and the worst is the last; but the best of the woman's row is the last and the worst of their rows is the first.\"."}},{"id":95,"idInBook":95,"chapterId":8,"bookId":13,"arabic":"وعن أبي سعيد الخدري، رضي الله عنه أن رسول الله  صلى الله عليه وسلم رأي في أصحابه تأخرًا، فقال لهم‏:‏ ‏\n\"‏تقدموا فَأتموا بي وليأتم بكم مَن بعدكم، لا يزال قوم يتأخرون حتى يؤخرهم الله‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Abu Sa'id Al-Khudri (May Allah be pleased with him) reported:","text":"When the Messenger of Allah (ﷺ) perceived a tendency among his Companions to stand in the back rows, he said to them, \"Come forward and be close to me and let those who come after you, follow your lead. If people continue to fall behind (i.e., in acquiring virtues), Allah puts them behind.\"."}},{"id":96,"idInBook":96,"chapterId":8,"bookId":13,"arabic":"وعن أبي مسعود رضي الله عنه قال‏:‏ كان رسول الله  صلى الله عليه وسلم يمسح مناكبنا في الصلاة، ويقول‏:‏ ‏\n\"‏استووا ولا تختلفوا فتختلف قلوبكم، ليلني منكم أولو الأحلام والنهى، ثم الذين يلونهم ثم الذين يلونهم‏\"‏‏.‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Abu Mas'ud (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) used to gently pat our shoulders when we were standing in rows at the time of Salat and say, \"Keep (the rows) straight; do not differ from each other lest your hearts should suffer from discord. Let those of you who are mature and prudent be nearer to me, and then those who are next to them.\"."}},{"id":97,"idInBook":97,"chapterId":8,"bookId":13,"arabic":"وعن أنس، رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏\"‏سووا صفوفكم، فإن تسوية الصف من تمام الصلاة‏\"‏‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏  \nوفي رواية البخاري‏:‏ ‏\"‏فإن تسوية الصفوف من إقامة الصلاة‏\"‏‏.‏","english":{"narrator":"Anas (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"Keep your rows straight (during Salat in congregation), for keeping the rows straight is part of the perfection of Salat.\"."}},{"id":98,"idInBook":98,"chapterId":8,"bookId":13,"arabic":"وعنه قال‏:‏ أقيمت الصلاة، فأقبل علينا رسول الله صلى الله عليه وسلم بوجهه فقال‏:‏ ‏\"‏أقيموا صفوفكم وتراصوا، فإني أراكم من وراء ظهري‏\"‏ ‏(‏‏(‏رواه البخاري بلفظه، ومسلم بمعناه‏)‏‏)‏‏.‏ \nوفي رواية للبخاري‏:‏ وكان أحدنا يلزق منكبه بمنكب صاحبه وقدمه بقدمه‏\"‏‏.‏","english":{"narrator":"Anas (May Allah be pleased with him) reported:","text":"When the Iqamah had been announced, the Messenger of Allah (ﷺ) turned his face towards us and said: \"Make your rows straight and stand close together, for I can see you from behind my back.\"."}},{"id":99,"idInBook":99,"chapterId":8,"bookId":13,"arabic":"وعن النعمان بن بشير رضي الله عنهما، قال‏:‏ سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ ‏\"‏لتسون صفوفكم، أو ليخالفن الله بين وجوهكم‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ \nوفي رواية لمسلم‏:‏ أن رسول الله صلى الله عليه وسلم كان يسوي صفوفنا حتى كأنما يسوي بها القداح، حتى رأى أنا قد عقلنا عنه‏.‏ ثم خرج يومًا فقام حتى كاد يكبر، فرأى رجلا باديا صدره من الصف، فقال ‏\"‏عباد الله لتسون صفوفكم، أو ليخالفن الله بين وجوهكم‏\"‏‏.‏","english":{"narrator":"An-Nu'man bin Bashir (May Allah be pleased with them) reported:","text":"I heard the Messenger of Allah (ﷺ) saying, \"Straighten your rows; otherwise, Allah will create dissension among you.\".The narration in Muslim is: An-Nu'man bin Bashir (May Allah be pleased with them) said: The Messenger of Allah (ﷺ) directed us to keep our rows as straight as arrows. He continued stressing this until he realized that we had learnt it from him (recognized its significance). One day he came into the mosque and stood up. He was just about to say Takbir (Allah is Greater) when he noticed a man whose chest was projected from the row, so he said, \"O slaves of Allah, you must straighten your rows or Allah will certainly put your faces in opposite directions.\""}},{"id":100,"idInBook":100,"chapterId":8,"bookId":13,"arabic":"وعن البراء بن عازب رضي الله عنهما، قال كان رسول الله صلى الله عليه وسلم يتخلل من ناحية إلى ناحية، يمسح صدورنا ومناكبنا ويقول،‏:‏ ‏\"‏لا تختلفوا فتختلف قلوبكم‏\"‏ وكان يقول‏:‏ ‏\"‏إن الله وملائكته يصلون على الصفوف الأُول‏\"‏ ‏(‏‏(‏رواه أبو داود بإسناد حسن‏)‏‏)‏‏.‏","english":{"narrator":"Al-Bara' bin 'Azib (May Allah be pleased with them) reported:","text":"The Messenger of Allah (ﷺ) used to pass between the rows from one end to the other, touching our chest and shoulders (i.e., arranging the rows) in line and saying, \"Do not be out of line; otherwise your hearts will be in disagreement\". He would add, \"Allah and His angels invoke blessings upon the first rows.\"."}},{"id":101,"idInBook":101,"chapterId":8,"bookId":13,"arabic":"وعن ابن عمر رضي الله عنهما، أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\n\"‏أقيموا الصفوف، وحاذوا المناكب، وسدوا الخلل، ولينوا بأيدي إخوانكم، ولا تذروا فرجات للشيطان، ومن وصل صفًا وصله الله، ومن قطع صفًا قطعه الله‏\"‏‏.‏ ‏(‏‏(‏رواه أبو داود بإسناد صحيح‏)‏‏)‏‏.‏","english":{"narrator":"Ibn 'Umar (May Allah be pleased with them) reported:","text":"The Messenger of Allah (ﷺ) said, \"Arrange the rows in order, stand shoulder to shoulder, close the gaps, be accommodating to your brothers, and do not leave gaps for Satan. Whoever joins up a row, he will be joined to Allah (i.e., to the Mercy of Allah); and whoever cuts off a row, he will be cut off from Allah (i.e., from His Mercy).\"."}},{"id":102,"idInBook":102,"chapterId":8,"bookId":13,"arabic":"وعن أنس، رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\n\"‏رصوا صفوفكم، وقاربوا بينها وحاذوا الأعناق فوالذي نفسي بيده إني لأرى الشيطان يدخل من خلل الصف، كأنها الحذف‏\"‏ ‏(‏‏(‏حديث صحيح رواه أبو داود بإسناد على شرط مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Anas (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"Stand close together in your rows, keep nearer to one another, and put your necks in line, for by Him in Whose Hands my soul is, I see the Satan entering through the opening in the row like Al- hadhaf (i.e., a type of small black sheep found in Yemen).\"."}},{"id":103,"idInBook":103,"chapterId":8,"bookId":13,"arabic":"وعنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\n\"‏أتموا الصف المقدم، ثم الذي يليه، فما كان من نقص فليكن في الصف المؤخر‏\"‏‏.‏ ‏(‏‏(‏رواه أبو داود بإسناد حسن‏)‏‏)‏‏.‏","english":{"narrator":"Anas (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"Fill (complete) the first row, then the one next to it; and if there is any deficiency (incompleteness), it should be in the last row.\"."}},{"id":104,"idInBook":104,"chapterId":8,"bookId":13,"arabic":"وعن عائشة رضي الله عنها، قالت‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏\n\"‏إن الله وملائكته يصلون على ميامن الصفوف‏\"‏ ‏(‏‏(‏رواه أبو داود بإسناد على شرط مسلم، وفيه رجل مختلف في توثيقه‏.‏ ‏)‏‏)‏‏.‏","english":{"narrator":"'Aishah (May Allah be pleased with her) reported:","text":"The Messenger of Allah (ﷺ) said, \"Allah and His angels invoke blessings upon those who are on the right side of the rows.\"."}},{"id":105,"idInBook":105,"chapterId":8,"bookId":13,"arabic":"وعن البراء، رضي الله عنه قال‏:‏ ‏\"‏كنا إذا صلينا خلف رسول الله صلى الله عليه وسلم ، أحببنا أن نكون عن يمينه، يقبل علينا بوجهه، فسمعته يقول‏:‏ ‏\"‏رب قني عذابك يوم تبعث - أو تجمع- عبادك‏\"‏‏.‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Al-Bara' (May Allah be pleased with him) reported:","text":"Whenever we performed Salat behind the Messenger of Allah (ﷺ), we liked to be on his right side so that his face might turn towards us (at the end of the Salat). One day, I heard Messenger of Allah (ﷺ) supplicating, \"O my Rubb! Shield me from Your Torment on the Day when You will gather (or said, 'resurrect') Your slaves.\"."}},{"id":106,"idInBook":106,"chapterId":8,"bookId":13,"arabic":"وعن أبي هريرة رضي الله عنه قال قال رسول الله صلى الله عليه وسلم‏:‏ ‏\n\"‏وسطوا الإمام، وسدوا الخلل‏\"‏ ‏(‏‏(‏رواه أبو داود‏)‏‏)‏‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him)reported:","text":"The Messenger of Allah (ﷺ) said, \"Let the Imam stand in the middle (so that those praying behind him should be standing both on his right and his left) and close the gaps.\"."}},{"id":107,"idInBook":107,"chapterId":8,"bookId":13,"arabic":"عن أم المؤمنين أم حبيبة رملة بنت أبي سفيان، رضي الله عنهما، قالت سمعت رسول الله صلى الله عليه وسلم، يقول‏:‏ ما من عبد مسلم يصلي لله تعالى كل يوم ثنتي عشرة ركعة تطوعًا غير الفريضة، إلا بنى الله له بيتًا في الجنة أو‏:‏ إلا بني له بيت في الجنة‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Umm Habibah (May Allah be pleased with her) the Mother of the Believers reported:","text":"I heard the Messenger of Allah (ﷺ) saying, \"A house will be built in Jannah for every Muslim who offers twelve Rak'ah of optional Salat other than the obligatory Salat in a day and a night (to seek the Pleasure of Allah).\"."}},{"id":108,"idInBook":108,"chapterId":8,"bookId":13,"arabic":"وعن ابن عمر رضي الله عنهما، قال‏:‏ صليت مع رسول الله صلى الله عليه وسلم، ركعتين قبل الظهر وركعتين بعدها، وركعتين بعد الجمعة، وركعتين بعد المغرب، وركعتين بعد العشاء‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","english":{"narrator":"Ibn 'Umar (May Allah be pleased with them) reported:","text":"I performed along with the Messenger of Allah (ﷺ) two Rak'ah of optional prayers before Zuhr and two after the Zuhr (noon prayer), and two after the Friday prayer, and two after the Maghrib (evening) prayer, and two after the 'Isha' (night) prayer.\"."}},{"id":109,"idInBook":109,"chapterId":8,"bookId":13,"arabic":"وعن عبد الله بن مغفل، رضي الله عنه، قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏\"‏بين كل أذانين صلاة، بين كل أذانين صلاة، بين كل أذانين صلاة‏\"‏ وقال في الثالثة‏:‏ ‏\"‏لمن شاء‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","english":{"narrator":"'Abdullah bin Mughaffal (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"There is a Salat (prayer) between every Adhan and Iqamah; there is a Salat between every Adhan and Iqamah.\" (While saying the same for the) third time (he (ﷺ) added), \"It is for him who desires (to perform it).\"."}},{"id":110,"idInBook":110,"chapterId":8,"bookId":13,"arabic":"عن عائشة رضي الله عنها، أن النبي صلى الله عليه وسلم كان لا يدع أربعًا قبل الظهر، وركعتين قبل الغداة ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","english":{"narrator":"'Aishah (May Allah be pleased with her) reported:","text":"The Prophet (ﷺ) never omitted four Rak'ah prayer before the Zuhr prayer and two Rak'ah prayers before dawn (Fajr) prayer.."}},{"id":111,"idInBook":111,"chapterId":8,"bookId":13,"arabic":"وعنها قالت‏:‏ لم يكن النبي، صلى الله عليه وسلم على شيء من النوافل أشد تعاهدًا منه على ركعتي الفجر‏\"‏‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","english":{"narrator":"'Aishah (May Allah be pleased with her) reported:","text":"The Prophet (ﷺ) did not attach more importance to any Nawafil prayer than the two Rak'ah of prayer before dawn (Fajr) prayer.."}},{"id":112,"idInBook":112,"chapterId":8,"bookId":13,"arabic":"وعنها عن النبي صلى الله عليه وسلم قال‏:‏ ‏\n\"‏ركعتا الفجر خير من الدنيا وما فيها‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏ وفي رواية لهما لأحب إلي من الدنيا جميعًا‏.‏","english":{"narrator":"'Aishah (May Allah be pleased with her) reported:","text":"The Prophet (ﷺ) said, \"The two Rak'ah before the dawn (Fajr) prayer are better than this world and all it contains.\"Another narration goes: \"The two Rak'ah before the dawn (Fajr) prayer are dearer to me than the whole world.\""}},{"id":113,"idInBook":113,"chapterId":8,"bookId":13,"arabic":"وعن أبي عبد الله بلال بن رباح، رضي الله عنه مؤذن رسول الله صلى الله عليه وسلم أنه أتى رسول الله صلى الله عليه وسلم ليؤذنه بصلاة الغداة، فشغلت عائشة بلالا بأمر سألته عنه، حتى أصبح جدا فقام بلال فآذنه بالصلاة، وتابع أذانه، فلم يخرج رسول الله صلى الله عليه وسلم فلما خرج صلى بالناس، فأخبره أن عائشة شغلته بأمر سألته عنه حتى أصبح جدا، وأنه أبطأ عليه بالخروج، فقال -يعني النبي صلى الله عليه وسلم -‏:‏ ‏\"‏إني كنت ركعت ركعتي الفجر‏\"‏ فقال‏:‏ يا رسول الله إنك أصبحت جدا‏؟‏ فقال‏:‏ ‏\"‏لو أصبحت أكثر مما أصبحت، لركعتهما وأحسنتهما، وأجملتهما‏\"‏‏.‏ ‏(‏‏(‏رواه أبو داود بإسناد حسن‏)‏‏)‏‏.‏","english":{"narrator":"Abu 'Abdullah Bilal bin Rabah (May Allah be pleased with him) the Mu'adhdhin of Messenger of Allah (ﷺ) reported:","text":"I went to inform the Messenger of Allah (ﷺ) about the time of the dawn (Fajr) prayer, and 'Aishah (May Allah be pleased with her) kept me busy and began to ask me about something till the day grew bright. Then I got up and informed the Messenger of Allah (ﷺ) of the time of Salat. I informed him again but he did not came out immediately to lead As- Salat. When he came out, he led As-Salat. I said to him: 'Aishah (May Allah be pleased with her) kept me busy and thus diverted my attention by asking about something and the morning grew bright. You also came out late. Upon that the Messenger of Allah (ﷺ) said, \"I was engaged in performing two Rak'ah of Fajr prayer.\" Bilal (May Allah be pleased with him)said: \"O Messenger of Allah! You delayed As-Salat so long as the morning grew bright.\" He (ﷺ) replied, \"Even if the morning had become brighter than it had, I would have performed two Rak'ah of prayer in an excellent manner.\"."}},{"id":114,"idInBook":114,"chapterId":8,"bookId":13,"arabic":"عن عائشة رضي الله عنها أن رسول الله صلى الله عليه وسلم، كان يصلي ركعتين خفيفتين بين النداء والإقامة من صلاة الصبح‏\"‏‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏  \nوفي رواية لهما‏:‏ يصلي ركعتي الفجر، إذا سمع الأذان فيخففهما حتى أقول هل قرأ فيهمابأم القرآن‏!‏‏.‏ وفي رواية لمسلم‏:‏ كان يصلى ركعتيي الفجر إذا سمع الأذان ويخففهما‏.‏\nوفي رواية‏:‏ إذا طلع الفجر‏.‏","english":{"narrator":"'Aishah (May Allah be pleased with her) reported:","text":"The Prophet (ﷺ) used to perform two Rak'ah short prayer between the Adhan (call to prayer) and the Iqamah of the dawn (Fajr) prayers.In the narration of Muslim, 'Aishah (May Allah be pleased with her) said: When the Messenger of Allah (ﷺ) used to hear the Adhan (of Fajr prayer) he would perform two supererogatory Rak'ah prayer and would make them short."}},{"id":115,"idInBook":115,"chapterId":8,"bookId":13,"arabic":"وعن حفصة رضي الله عنها أن رسول الله صلى الله عليه وسلم كان إذا أذن المؤذن للصبح، وبدا الصبح صلى ركعتين خفيفتين‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏ \nوفي رواية لمسلم‏:‏ كان رسول الله صلى الله عليه وسلم إذا طلع الفجر لا يصلى إلا ركعتين خفيفتين‏.‏","english":{"narrator":"Hafsah (May Allah be pleased with her) reported:","text":"The Messenger of Allah (ﷺ) used to perform two short Rak'ah prayer when it was dawn and the Mu'adhdhin had called Adhan (for the Fajr prayer).."}},{"id":116,"idInBook":116,"chapterId":8,"bookId":13,"arabic":"وعن ابن عمر رضي الله عنهما قال‏:‏ كان رسول الله صلى الله عليه وسلم يصلي من الليل مثنى مثنى، ويوتر بركعة من آخر الليل، ويصلي الركعتين قبل صلاة الغداة، وكأن الأذان بأذنيه‏\"‏‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","english":{"narrator":"Ibn 'Umar (May Allah be pleased with them) reported:","text":"The Messenger of Allah (ﷺ) used to perform his optional night prayers at night, two Rak'ah followed by two Rak'ah, and at the end he would conclude with an odd Rak'ah (Witr). Then he would perform two Rak'ah prayer before the dawn (Fajr) prayer after hearing the Adhan, and he would make them so brief as if he could hear the Iqamah being called.."}},{"id":117,"idInBook":117,"chapterId":8,"bookId":13,"arabic":"وعن ابن عباس رضي الله عنهما أن رسول الله صلى الله عليه وسلم، كان يقرأ في ركعتي الفجر في الأولى منهما‏:‏ ‏{‏قولوا آمنا بالله وما أنزل إلينا‏}‏ الآية التي في البقرة، وفي الآخرة منهما‏:‏ ‏{‏آمنا بالله واشهد بأنا مسلمون‏}.‏ \nوفي رواية‏:‏ في الآخرة التي في آل عمران‏:‏ ‏{‏تعالوا إلى كلمة سواء بيننا وبينكم‏}‏‏.‏ ‏(‏‏(‏رواهما مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Ibn 'Abbas (May Allah be pleased with them) reported:","text":"The Messenger of Allah (ﷺ) used to recite during the two Rak'ah of Fajr prayer: \"Say (O Muslims): We believe in Allah and that which has been sent down to us...\" (2:136) which is in Surat Al-Baqarah in the first Rak'ah and the Verse: \"We believe in Allah, and bear witness that we are Muslims (i.e., we submit to Allah.\" (3:52) in the second Rak'ah.According to another narration, he (ﷺ) recited from Surat Al-'Imran the Verses: \"Come to a word which is just between us and you...\" (3:64).."}},{"id":118,"idInBook":118,"chapterId":8,"bookId":13,"arabic":"وعن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم، قرأ في ركعتي الفجر‏:‏ ‏{‏قل يا أيها الكافرون‏}‏ و‏{‏قل هو الله أحد‏}‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) recited in the two supererogatory Rak'ah of the Fajr prayer Surat Al-Kafirun (No. 109) ."}},{"id":119,"idInBook":119,"chapterId":8,"bookId":13,"arabic":"وعن ابن عمر رضي الله عنهما، قال رمقت النبي صلى الله عليه وسلم شهرًا يقرأ في الركعتين قبل الفجر‏:‏ ‏{‏قل يا أيها الكافرون‏}‏، و‏:‏ ‏{‏قل هو الله أحد‏}‏‏.‏ ‏(‏‏(‏رواه الترمذي وقال‏:‏ حديث حسن‏)‏‏)‏‏.‏","english":{"narrator":"Ibn 'Umar (May Allah be pleased with them) reported:","text":"I observed the Prophet (ﷺ) for one month reciting in the two supererogatory Rak'ah of the Fajr prayer Surat Al-Kafirun (No. 109) ."}},{"id":120,"idInBook":120,"chapterId":8,"bookId":13,"arabic":"عن عائشة رضي الله عنها قالت‏:‏ كان النبي صلى الله عليه وسلم إذا صلى ركعتي الفجر، اضطجع على شقه الأيمن‏.‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","english":{"narrator":"'Aishah (May Allah be pleased with her) reported:","text":"When the Prophet (ﷺ) had performed two Rak'ah before the Fajr prayer, he would lie down on his right side.."}},{"id":121,"idInBook":121,"chapterId":8,"bookId":13,"arabic":"وعنها قالت‏:‏ كان النبي صلى الله عليه وسلم يصلي فيما بين أن يفرغ من صلاة العشاء إلى الفجر إحدى عشرة ركعة يسلم بين كل ركعتين، ويوتر بواحدة، فإذا سكت المؤذن من صلاة الفجر، وتبين له الفجر وجاء المؤذن، قام فركع ركعتين خفيفتين، ثم اضطجع على شقه الأيمن هكذا حتى يأتيه المؤذن للإقامة‏\"‏‏.‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏ (15)","english":{"narrator":"'Aishah (May Allah be pleased with her) reported:","text":"When the Prophet (ﷺ) finished the 'Isha prayer, he would perform eleven Rak'ah before the Fajr prayer, concluding each two Rak'ah with Taslim (i.e., saying As-Salamu 'Alaikum) and observing the Witr (odd) at the end. When the Mu'adhdhin finished proclaiming Adhan for the Fajr prayer and it was dawn, he would rise and perform two short Rak'ah, and then would lie down on his right side till the Mu'adhdhin came to (inform) him about Iqamah.."}},{"id":122,"idInBook":122,"chapterId":8,"bookId":13,"arabic":"وعن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏\n\"‏إذا صلى أحدكم ركعتي الفجر، فليضطجع على يمينه‏\"‏‏.‏ ‏(‏‏(‏رواه أبو داود، والترمذي بأسانيد صحيحة‏.‏ قال الترمذي‏:‏ حديث حسن صحيح‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"When anyone of you has performed two of Sunnah before the Fajr prayer, he should lie down on his right side.\"."}},{"id":123,"idInBook":123,"chapterId":8,"bookId":13,"arabic":"عن ابن عمر رضي الله عنهما قال‏:‏ صليت مع رسول الله صلى الله عليه وسلم ركعتين قبل الظهر، وركعتين بعدها‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","english":{"narrator":"Ibn 'Umar (May Allah be pleased with them) reported:","text":"I performed with the Messenger of Allah (ﷺ) two Rak'ah before and two after Zuhr prayers.."}},{"id":124,"idInBook":124,"chapterId":8,"bookId":13,"arabic":"وعن عائشة رضي الله عنها أن النبي صلى الله عليه وسلم كان لا يدع أربعًا قبل الظهر‏.‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","english":{"narrator":"'Aishah (May Allah be pleased with her) reported:","text":"The Prophet (ﷺ) never omitted four Rak'ah supererogatory prayer before Zuhr prayers.."}},{"id":125,"idInBook":125,"chapterId":8,"bookId":13,"arabic":"وعنها قالت‏:‏ كان النبي صلى الله عليه وسلم يصلي في بيتي قبل الظهر أربعًا، ثم يخرج فيصلي بالناس، ثم يدخل فيصلي ركعتين، وكان يصلي بالناس المغرب ثم يدخل بيتي فيصلي ركعتين، ويصلي بالناس العشاء، ويدخل بيتي، فيصلي ركعتين‏.‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"'Aishah (May Allah be pleased with her) reported:","text":"Whenever the Prophet (ﷺ) stayed in my house, he would perform four Rak'ah (supererogatory prayer) before Zuhr prayer. Then he would go out and lead Salat. He (ﷺ) would then come back and perform two Rak'ah (supererogatory prayer). He would lead the Maghrib prayer and come back and perform two Rak'ah (supererogatory prayer). When he (ﷺ) had led the 'Isha' prayer, he would enter the house and perform two Rak'ah (supererogatory prayer)."}},{"id":126,"idInBook":126,"chapterId":8,"bookId":13,"arabic":"وعن أم حبيبة رضي الله عنها قالت‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏\n\"‏من حافظ على أربع ركعات قبل الظهر وأربع بعدها، حرمه الله على النار‏\"‏‏.‏ ‏(‏‏(‏رواه أبو داود، والترمذي‏)‏‏)‏‏.‏ وقال حديث حسن صحيح‏.‏","english":{"narrator":"Umm Habibah (May Allah be pleased with her) reported:","text":"The Messenger of Allah (ﷺ) said, \"Whoever observes the practice of performing four Rak'ah before Zuhr prayer and four after the Zuhr prayer, Allah will shield him against the Fire (of Hell).."}},{"id":127,"idInBook":127,"chapterId":8,"bookId":13,"arabic":"وعن عبد الله بن السائب، رضي الله عنه أن رسول الله صلى الله عليه وسلم كان يصلى أربعًا بعد أن تزول الشمس قبل الظهر، وقال ‏\n\"‏إنها ساعة تفتح فيها أبواب السماء، فأحب أن يصعد لي فيها عمل صالح‏\"‏ ‏(‏‏(‏رواه الترمذي وقال‏:‏ حديث حسن‏)‏‏)‏‏.‏","english":{"narrator":"'Abdullah bin As-Sa'ib (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) used to perform four Rak'ah prayer after the declining of the sun before Zuhr prayer and would say, \"This is an hour at which the gates of heaven are opened, and I like that my good deeds should rise to heaven at that time.\"."}},{"id":128,"idInBook":128,"chapterId":8,"bookId":13,"arabic":"وعن عائشة رضي الله عنها أن النبي صلى الله عليه وسلم كان إذا لم يصلِ أربعًا قبل الظهر، صلاهن بعدها‏.‏ ‏(‏‏(‏رواه الترمذي وقال‏:‏ حديث حسن‏)‏‏)‏‏.‏","english":{"narrator":"'Aishah (May Allah be pleased with her) reported:","text":"If the Prophet (ﷺ) could not perform four Rak'ah before Zuhr prayer, he would perform them after it (i.e., after the obligatory prayer).."}},{"id":129,"idInBook":129,"chapterId":8,"bookId":13,"arabic":"عن علي بن أبي طالب، رضي الله عنه قال كان النبي صلى الله عليه وسلم يصلي قلب العصر أربع ركعات يفصل بينهن بالتسليم على الملائكة المقربين ومن تبعهم من المسلمين والمؤمنين‏.‏ رواه الترمذي وقال حديث حسن‏.‏","english":{"narrator":"'Ali bin Abu Talib (May Allah be pleased with him)reported:","text":"The Prophet (ﷺ) used to perform four Rak'ah before the 'Asr prayer, separating them with Taslim (i.e., offering blessings) on the favourite angels who are near Allah's proximity and the Muslims and the believers who come after them.."}},{"id":130,"idInBook":130,"chapterId":8,"bookId":13,"arabic":"وعن ابن عمر، رضي الله عنهما، عن النبي صلى الله عليه وسلم، قال‏:‏ ‏\n\"‏رحم الله امرءًا صلى قبل العصر أربعًا‏\"‏‏.‏ ‏(‏‏(‏رواه أبو داود والترمذي وقال‏:‏ حديث حسن‏)‏‏)‏‏.‏","english":{"narrator":"Ibn 'Umar (May Allah be pleased with them) reported:","text":"The Prophet (ﷺ) said, \"May Allah have mercy on a man who performs four Rak'ah before the 'Asr prayer.\"."}},{"id":131,"idInBook":131,"chapterId":8,"bookId":13,"arabic":"وعن علي بن أبي طالب رضي الله عنه أن النبي صلى الله عليه وسلم كان يصلي قبل العصر ركعتين‏.‏‏\"‏ ‏(‏‏(‏رواه أبو داود بإسناد صحيح‏)‏‏)‏‏.‏","english":{"narrator":"'Ali bin Abu Talib (May Allah be pleased with him) reported:","text":"The Prophet (ﷺ) used to perform two Rak'ah before the 'Asr prayer.."}},{"id":132,"idInBook":132,"chapterId":8,"bookId":13,"arabic":"وعن عبد الله بن مغفل، رضي الله عنه عن النبي صلى الله عليه وسلم قال‏:‏ ‏\"‏صلوا قبل المغرب‏\"‏ قال في الثالثة‏:‏ ‏\"‏لمن شاء‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","english":{"narrator":"'Abdullah bin Mughaffal (May Allah be pleased with him) reported:","text":"The Prophet (ﷺ) said, \"Perform two Rak'ah before Maghrib prayer.\" He (ﷺ) repeated it twice; when repeating it for the third time he added: \"He who may so wish.\"."}},{"id":133,"idInBook":133,"chapterId":8,"bookId":13,"arabic":"- وعن أنس، رضي الله عنه قال‏:‏ لقد رأيت كبار أصحاب رسول الله صلى الله عليه وسلم يبتدرون السواري عند المغرب‏.‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","english":{"narrator":"Anas (May Allah be pleased with him) reported:","text":"I saw the principal Companions of Messenger of Allah (ﷺ) rushing to the pillars (of the mosque) to perform two Rak'ah prayers behind them before the Maghrib prayer.."}},{"id":134,"idInBook":134,"chapterId":8,"bookId":13,"arabic":"وعنه قال‏:‏ كنا نصلي على عهد رسول الله صلى الله عليه وسلم ركعتين بعد غروب الشمس قبل المغرب، فقيل‏:‏ أكان رسول الله صلى الله عليه وسلم صلاها‏؟‏ قال‏:‏ كان يرانا نصليهما فلم يأمرنا ولم ينهنا‏\"‏‏.‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Anas (May Allah be pleased with him) reported:","text":"In the lifetime of the Messenger of Allah (ﷺ), we used to perform two Rak'ah (optional prayer) after sunset before the Maghrib prayer. It was asked: \"Did Messenger of Allah (ﷺ) perform them?\" He replied: \"He saw us performing it, but he neither ordered us to perform them nor did he forbid us from doing so.\"."}},{"id":135,"idInBook":135,"chapterId":8,"bookId":13,"arabic":"وعنه قال‏:‏ كنا بالمدينة فإذا أذن المؤذن لصلاة المغرب ابتدروا السواري، فركعوا ركعتين، حتى إن الرجل الغريب ليدخل المسجد فيحسب أن الصلاة قد صليت من كثرة من يصليهما‏.‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Anas bin Malik (May Allah be pleased with him) reported:","text":"When we were in Al-Madinah, the moment the Mu'adhdhin finished the Adhan of the Maghrib prayer, the people hastened to the pillars of the mosque and performed two Rak'ah prayer behind them. A stranger coming into the mosque would think that the obligatory prayer had already been performed because of the number of people performing them.."}},{"id":136,"idInBook":136,"chapterId":8,"bookId":13,"arabic":"عن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏\n\"‏إذا صلى أحدكم الجمعة، فليصلِ بعدها أربعًا‏\"‏‏.‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him)reported:","text":"The Messenger of Allah (ﷺ) said, \"If anyone of you performs the Friday prayer, he should perform four Rak'ah (Sunnah) after it.\"."}},{"id":137,"idInBook":137,"chapterId":8,"bookId":13,"arabic":"وعن ابن عمر رضي الله عنهما، أن النبي صلى الله عليه وسلم كان لا يصلي بعد الجمعة حتى ينصرف، فيصلي ركعتين في بيته‏. (‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Ibn 'Umar (May Allah be pleased with them) reported:","text":"The Prophet (ﷺ) would not perform any Salat (in the mosque) after the Friday prayer till he had returned to his house. He would then perform two Rak'ah there.."}},{"id":138,"idInBook":138,"chapterId":8,"bookId":13,"arabic":"عن زيد بن ثابت رضي الله عنه أن النبي صلى الله عليه وسلم قال‏:‏ ‏\n\"‏صلوا أيها الناس في بيوتكم، فإن الصلاة صلاة المرء في بيته إلا المكتوبة‏\"‏‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","english":{"narrator":"Zaid bin Thabit (May Allah be pleased with him)reported:","text":"The Prophet (ﷺ) said, \"O people! perform your (voluntary) Salat (prayers) in your homes because the best Salat of a man is the one he performs at home, except the obligatory Salat.\"."}},{"id":139,"idInBook":139,"chapterId":8,"bookId":13,"arabic":"وعن ابن عمر رضي الله عنهما عن النبي صلى الله عليه وسلم قال‏:‏ اجلعوا من صلاتكم في بيوتكم، ولا تتخذوها قبورًا‏\"‏‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","english":{"narrator":"Ibn 'Umar (May Allah be pleased with them) reported:","text":"The Prophet (ﷺ) said, \"Observe part of the ."}},{"id":140,"idInBook":140,"chapterId":8,"bookId":13,"arabic":"وعن جابر رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\n\"‏إذا قضى أحدكم صلاته في مسجده، فليجعل لبيته نصيبًا من صلاته، فإن الله جاعل في بيته صلاته خيرًا‏\"‏‏.‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Jabir (May Allah be pleased with him)reported:","text":"The Messenger of Allah (ﷺ) said, \"When you have finished your (Fard) Salat (prayer) in the mosque, you should observe some of your (Sunnah and Nawafil) Salat at home; Allah will bless your homes because of your Salat (in your homes).\""}},{"id":141,"idInBook":141,"chapterId":8,"bookId":13,"arabic":"وعن عمر بن عطاء أن نافع بن جبير أرسله إلى السائب ابن أخت نمر يسأله عن شيء رآه منه معاوية في الصلاة فقال‏:‏ نعم صليت معه الجمعة في المقصورة، فلما سلم الإمام، قمت في مقامي، فصليت فلما دخل أرسل إلي فقال‏:‏ لا تعد لما فعلت‏:‏ إذا صليت الجمعة فلا تصلها بصلاة حتى تتكلم أو تخرج، فإن رسول الله صلى الله عليه وسلم أمرنا بذلك أن لا نوصل صلاة بصلاة حتى نتكلم أو نخرج‏.‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"'Umar bin 'Ata reported that Nafi' bin Jubair sent him to Sa'ib bin Ukht Namir to ask him about something that Mu'awiyah had seen him doing in Salat (prayer). He said:","text":"\"Yes, I performed the Friday prayer along with him in the enclosure (Maqsurah), and when the Imam concluded the Salat with Taslim, I stood up in my place and performed the Sunnah prayer. When Mu'awiyah went home, he sent for me (and when I came) he said: \"Never do again what you have done. When you have observed the Friday prayer, you must not start another Sunnah prayer till you have spoken to some one or have shifted your place; because the Messenger of Allah (ﷺ) ordered us not to follow up the congregational Salat with any other Salat until we have talked (to some one) or moved from the place.\"."}},{"id":142,"idInBook":142,"chapterId":8,"bookId":13,"arabic":"عن علي رضي الله عنه قال‏:‏ الوتر ليس بختم كصلاة المكتوبة ولكن سن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\n\"‏إن الله وتر يحب الوتر، فأوتروا يا أهل القرآن‏\"‏‏.‏ ‏(‏‏(‏رواه أبو داود والترمذي‏)‏‏)‏‏.‏ وقال‏:‏ حديث حسن‏.‏","english":{"narrator":"'Ali (bin Abu Talib) (May Allah be pleased with him) reported:","text":"The Witr prayer is not obligatory as the prescribed Salat (prayers), but the Messenger of Allah (ﷺ) observed it as his regular practice (Sunnah). He (ﷺ) said, \"Allah is Witr (single, odd) and loves what is Witr. So perform Witr prayer. O followers of Qur'an, observe Witr (prayer).\"."}},{"id":143,"idInBook":143,"chapterId":8,"bookId":13,"arabic":"وعن عائشة رضي الله عنها قالت‏:‏ من كل الليل قد أوتر رسول الله صلى الله عليه وسلم‏:‏ من أول الليل ومن أوسطه، ومن آخره‏.‏ وانتهى وتره إلى السحر‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","english":{"narrator":"'Aishah (May Allah be pleased with her) reported:","text":"The Messenger of Allah (ﷺ) observed Witr prayer in every part of night at the beginning, middle and at the last part. He (ﷺ), however, would finish his Witr prayer before dawn.."}},{"id":144,"idInBook":144,"chapterId":8,"bookId":13,"arabic":"وعن ابن عمر رضي الله عنهما، عن النبي صلى الله عليه وسلم‏:‏ ‏\n\"‏ اجعلوا آخر صلاتكم بالليل وترًا‏\"‏‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","english":{"narrator":"Ibn 'Umar (May Allah be pleased with them) reported:","text":"The Prophet (ﷺ) said, \"Make Witr prayer the last of your Salat at night.\"."}},{"id":145,"idInBook":145,"chapterId":8,"bookId":13,"arabic":"وعن أبي سعيد الخدري رضي الله عنه أن النبي صلى الله عليه وسلم قال‏:‏ ‏\n\"‏أوتروا قبل أن تصبحوا‏\"‏‏.‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Abu Sa'id Al-Khudri (May Allah be pleased with him) reported:","text":"The Prophet (ﷺ) said, \"Perform Witr prayer before dawn.\"."}},{"id":146,"idInBook":146,"chapterId":8,"bookId":13,"arabic":"وعن عائشة رضي الله عنها أن النبي صلى الله عليه وسلم كان يصلي بالليل، وهي معترضة بين يديه، فإذا بقي الوتر، أيقظها فأوترت‏.‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏ \nوفي رواية له‏:‏ فإذا بقي الوتر قال‏:‏ ‏\n\"‏قومي فأوتري يا عائشة‏\"‏","english":{"narrator":"'Aishah (May Allah be pleased with her) reported:","text":"The Prophet (ﷺ) used to perform his voluntary prayer at night (i.e., Tahajjud prayer) while she was sleeping in front of him; and when the Witr prayer was yet to be observed, he would awaken her to perform her Witr prayer.."}},{"id":147,"idInBook":147,"chapterId":8,"bookId":13,"arabic":"وعن ابن عمر رضي الله عنهما أن النبي صلى الله عليه وسلم قال‏:‏ ‏\n\"‏بادروا الصبح بالوتر‏\"‏ ‏(‏‏(‏رواه أبو داود والترمذي‏)‏‏)‏‏.‏ وقال‏:‏ حديث حسن صحيح‏.‏","english":{"narrator":"Ibn 'Umar (May Allah be pleased with them) reported:","text":"The Prophet (ﷺ) said, \"Hasten to perform the Witr prayer before dawn.\"."}},{"id":148,"idInBook":148,"chapterId":8,"bookId":13,"arabic":"وعن جابر رضي الله عنه قال قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\n\"‏من خاف أن لا يقوم الليل فليوتر أوله، ومن طمع أن يقوم آخره، فليوتر آخر الليل، فإن صلاة آخر الليل مشهودة، وذلك أفضل‏\"‏‏.‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Jabir (May Allah be pleased with him)reported:","text":"The Messenger of Allah (ﷺ) said, \"He who apprehends that he may not get up in the later part of the night, should observe the Witr prayer in the first part of it; and he who is certain to get up in the last part of it, he should observe Witr at the end of the night, because Salat at the end of the night is attended (by the angels), and that is better.\"."}},{"id":149,"idInBook":149,"chapterId":8,"bookId":13,"arabic":"عن أبي هريرة رضي الله عنه قال‏:‏ أوصاني خليلي صلى الله عليه وسلم بصيام ثلاثة أيام من كل شهر، وركعتي الضحى، وأن أوتر قبل أن أرقد‏\"‏ ‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏  \nوالإيتار قبل النوم إنما يستحب لمن لا يثق باستيقاظ آخر الليل، فإن وثق فآخر الليل أفضل‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"My Khalil (the Messenger of Allah (ﷺ)) directed me to fast three days of each month, and to observe two Rak'ah Duha (optional prayer) at forenoon, and to perform the Witr prayer before going to bed.."}},{"id":150,"idInBook":150,"chapterId":8,"bookId":13,"arabic":"وعن أبي ذر رضي الله عنه عن النبي صلى الله عليه وسلم قال‏:‏ ‏\n\"‏يصبح على كل سلامى من أحدكم صدقة‏:‏ فكل تسبيحة صدقة، وكل تهليلة صدقة، وكل تكبيرة صدقة، وأمر بالمعروف صدقة، ونهي عن المنكر صدقة، ويجزئ من ذلك ركعتان يركعهما من الضحى‏\"‏‏.‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Abu Dharr (May Allah be pleased with him)reported:","text":"The Prophet (ﷺ) said, \"In the morning, charity is due on every joint bone of the body of everyone of you. Every utterance of Allah's Glorification (i.e., saying Subhan Allah) is an act of charity, and every utterance of His Praise (i.e., saying Al-hamdu lillah) is an act of charity and every utterance of declaration of His Greatness (i.e., saying La ilaha illAllah) is an act of charity; and enjoining M'aruf (good) is an act of charity, and forbidding Munkar (evil) is an act of charity, and two Rak'ah Duha prayers which one performs in the forenoon is equal to all this (in reward).\"."}},{"id":151,"idInBook":151,"chapterId":8,"bookId":13,"arabic":"وعن عائشة رضي الله عنها قالت‏:‏ كان رسول الله صلى الله عليه وسلم يصلي الضحى أربعًا ويزيد ما شاء الله ‏.‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"'Aishah (May Allah be pleased with her) reported:","text":"The Messenger of Allah (ﷺ) used to perform four Rak'ah of Duha prayer (at the forenoon) and would add to them whatever Allah wished.."}},{"id":152,"idInBook":152,"chapterId":8,"bookId":13,"arabic":"وعن أم هانئ فاختة بنت أبي طالب رضي الله عنها قالت‏:‏ ذهبت إلى رسول الله صلى الله عليه وسلم عام الفتح فوجدته يغتسل فلما فرغ من غسله صلى ثمان ركعات، وذلك ضحى‏\"‏ ‏(‏‏(‏متفق عليه وهذا مختصر لفظ إحدى روايات مسلم‏)‏‏)‏","english":{"narrator":"Umm Hani, daughter of Abu Talib (May Allah be pleased with her) reported:","text":"I went to the Messenger of Allah (ﷺ) on the day of the conquest of Makkah. He was taking a bath at that time. When he finished the bath, he performed eight Rak'ah (of optional) prayers. This was during the Duha (forenoon).."}},{"id":153,"idInBook":153,"chapterId":8,"bookId":13,"arabic":"عن زيد بن أرقم رضي الله عنه أنه رأى قومًا يصلون من الضحى، فقال‏:‏ أما لقد علموا أن الصلاة في غير هذه الساعة أفضل، إن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\n\"‏صلاة الأوابين حين ترمض الفصال‏\"‏‏.‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Zaid bin Arqam (May Allah be pleased with him) reported:","text":"I saw some people performing Duha (prayers) in the early forenoon and warned them (saying): These people must know that performing Salat a little later is better. The Messenger of Allah (ﷺ) said, \"The Salat of the penitent is to be observed when the young ones of camels feel the heat of the sun (i.e., when it becomes very hot).\"."}},{"id":154,"idInBook":154,"chapterId":8,"bookId":13,"arabic":"وعن أبي قتادة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏\n\"‏ إذا دخل أحدكم المسجد فلا يجلس حتى يصلي ركعتين‏\"‏‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","english":{"narrator":"Abu Qatadah (May Allah be pleased with him)reported:","text":"The Messenger of Allah (ﷺ) said, \"When anyone of you enters the mosque, he should perform two Rak'ah (of voluntary prayer) before sitting.\"."}},{"id":155,"idInBook":155,"chapterId":8,"bookId":13,"arabic":"وعن جابر، رضي الله عنه قال‏:‏ أتيت النبي صلى الله عليه وسلم وهو في المسجد فقال‏:‏ ‏\n\"‏صلِ ركعتين‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","english":{"narrator":"Jabir (May Allah be pleased with him) reported:","text":"I came to the Prophet (ﷺ) when he was in the mosque, and he said to me, \"Perform two Rak'ah prayer.\"."}},{"id":156,"idInBook":156,"chapterId":8,"bookId":13,"arabic":"وعن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال لبلال‏:‏ يا بلال حدثني بأرجى عمل عملته في الإسلام، فإني سمعت دف نعليك بين يدي في الجنة، قال‏:‏ ما عملت عملا أرجى عندي من أني لم أتطهر طهورًا في ساعة من ليل أو نهار إلا صليت بذلك الطهور ما كتب لي أن أصلي‏.‏ ‏(‏‏(‏متفق عليه وهذا لفظ البخاري‏)‏‏)‏‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said to Bilal (May Allah be pleased with him) \"Tell me about the most hopeful act (i.e., one which you deem the most rewarding with Allah) you have done since your acceptance of Islam because I heard the sound of the steps of your shoes in front of me in Jannah.\" Bilal said: \"I do not consider any act more hopeful than that whenever I make Wudu' (or took a bath) in an hour of night or day, I would immediately perform Salat (prayer) for as long as was destined for me to perform.\"."}},{"id":157,"idInBook":157,"chapterId":8,"bookId":13,"arabic":"وعن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏\n\"‏ خير يوم طلعت عليه الشمس يوم الجمعة‏:‏ فيه خلق آدم، وفيه أدخل الجنة، وفيه أخرج منها‏\"‏‏.‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"The best day on which the sun has risen is Friday. On that day Adam was created, he was admitted to Jannah, and he was expelled therefrom.\"."}},{"id":158,"idInBook":158,"chapterId":8,"bookId":13,"arabic":"وعنه قال‏:‏ قال رسول الله، صلى الله عليه وسلم ‏:‏ ‏\n\"‏من توضأ فأحسن الوضوء ثم أتي الجمعة، فاستمع وأنصت، غفر له ما بينه وبين الجمعة وزيادة ثلاثة أيام، ومن مس الحصى،  فقد لغا‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"If anyone performs Wudu' properly, then comes to the Friday prayer, listens to the Khutbah (religious talk) attentively and keeps silent, his (minor) sins between that Friday and the following Friday will be forgiven, with the addition of three more days; but he who touches pebbles has caused an interruption. \"."}},{"id":159,"idInBook":159,"chapterId":8,"bookId":13,"arabic":"وعنه عن النبي، صلى الله عليه وسلم قال‏:‏ ‏\n\"‏الصلوات الخمس والجمعة إلى الجمعة، ورمضان إلى رمضان، مكفرات ما بينهن إذا اجتنبت الكبائر‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him)reported:","text":"The Prophet (ﷺ) said, \"The five daily (prescribed) Salat, and Friday (prayer) to the next Friday (prayer), and the fasting of Ramadan to the next Ramadan, is expiation of the sins committed in between them, so long as major sins are avoided.\"."}},{"id":160,"idInBook":160,"chapterId":8,"bookId":13,"arabic":"وعنه وعن ابن عمر، رضي الله عنهم، أنهما سمعا رسول الله صلى الله عليه وسلم ، يقول على أعواد منبره‏:‏ ‏\n\"‏لينتهين أقوام عن وَدعهم الجمعات، أو ليختمن الله على قلوبهم، ثم ليكونن من الغافلين‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Ibn 'Umar and Abu Hurairah (May Allah be pleased with them) reported:","text":"We heard the Messenger of Allah (ﷺ) saying (while delivering Khutbah on his wooden pulpit), \"Either some people (i.e., hypocrites) stop neglecting the Friday prayers, or Allah will seal their hearts and they will be among the heedless.\"."}},{"id":161,"idInBook":161,"chapterId":8,"bookId":13,"arabic":"وعن ابن عمر رضي الله عنهما، أن رسول الله صلى الله عليه وسلم ، قال‏:‏ ‏\n\"‏إذا جاء أحدكم الجمعة، فليغتسل‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏","english":{"narrator":"Ibn 'Umar (May Allah be pleased with them) reported:","text":"The Messenger of Allah (ﷺ) said, \"When one of you intends to come for the Friday prayer, he should take a bath.\"."}},{"id":162,"idInBook":162,"chapterId":8,"bookId":13,"arabic":"وعن أبي سعيد الخدري، رضي الله عنه، أن رسول الله صلى الله عليه وسلم ، قال‏:‏ ‏\n\"‏غسل الجمعة واجب على كل محتلم‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏","english":{"narrator":"Abu Sa'id Al-Khudri (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"Taking a bath (before coming to Friday prayers) is obligatory on every adult.\"."}},{"id":163,"idInBook":163,"chapterId":8,"bookId":13,"arabic":"وعن سمرة،  رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\n\"‏من توضأ يوم الجمعة، فبها ونعمت، ومن اغتسل فالغسل أفضل‏\"‏ ‏(‏‏(‏رواه أبو داود، والترمذي وقال حديث حسن‏)‏‏)‏‏.‏","english":{"narrator":"Samurah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"It suffices to perform Wudu' properly for the Friday prayer; but it is better to take a bath.\"."}},{"id":164,"idInBook":164,"chapterId":8,"bookId":13,"arabic":"- وعن سلمان، رضي الله عنه، قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\n\"‏لا يغتسل رجل يوم الجمعة، ويتطهر ما استطاع من طهر، ويدهن من دهنه، أو يمس من طيب بيته، ثم يخرج فلا يفرق بين اثنين، ثم يصلي ما كتب له، ثم ينصت إذا تكلم الإمام، إلا غفر له ما بينه وبين الجمعة الأخرى‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","english":{"narrator":"Salman (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"If a man takes bath on Friday, (or) purifies himself as much as he can with Wudu', oils his hair, applies whatever perfume available in his house, sets forth for the mosque, does not separate two people (to make a seat for himself), performs Salat what is prescribed for him, remains silent when the Imam speaks, his (minor) sins between that Friday and the following Friday will be forgiven.\"."}},{"id":165,"idInBook":165,"chapterId":8,"bookId":13,"arabic":"وعن أبي هريرة رضي الله عنه، أن رسول الله صلى الله عليه وسلم ، قال‏:‏ ‏\n\"‏من اغتسل يوم الجمعة غسل الجنابة، ثم راح في الساعة الأولى فكأنما قرب بدنة، ومن راح في الساعة الثانية، فكأنما قرب بقرة، ومن راح في الساعة الثالثة، فكأنما قرب كبشًا أقرن، ومن راح في الساعة الرابعة، فكأنما قرب دجاجة، ومن راح في الساعة الخامسة، فكأنما قرب بيضة، فإذا خرج الإمام، حضرت الملائكة يستمعون الذكر‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"He who takes a bath on Friday, like the bath for ceremonial purity, and then goes (to the mosque), he is like one who offers a camel as a sacrifice to seek the Pleasure of Allah; and he who comes at the second hour is like one who offers a cow to win the Pleasure of Allah; and he who comes at the third hour is like one who offers a ram with horns (in sacrifice); and he who comes at the fourth hour is like one who offers a hen; and he who comes at the fifth hour is like one who offers an egg. And when the Imam ascends the pulpit, the angels (who write the names of those who come to the mosque before the coming of the Imam) close (their record) in order to listen to the Khutbah.\"."}},{"id":166,"idInBook":166,"chapterId":8,"bookId":13,"arabic":"وعنه أن رسول الله صلى الله عليه وسلم ، ذكر يوم الجمعة، فقال‏:‏ ‏\n\"‏فيها ساعة لا يوافقها عبد مسلم، وهو قائم يصلي يسأل الله شيئًا، إلا أعطاه إياه‏\"‏ وأشار بيده يقللها، ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said while talking about the merits of Friday, \"There is a time on Friday at which a Muslim, while he (or she) is performing Salat and is supplicating, will be granted whatever he (or she) is supplicating for.\" And he (ﷺ) pointed with his hand to indicate that this period of time is very short.."}},{"id":167,"idInBook":167,"chapterId":8,"bookId":13,"arabic":"وعن أبي بردة بن أبي موسى الأشعري، رضي الله عنه، قال‏:‏ قال عبد الله بن عمر رضي الله عنهما‏:‏ أسمعت أباك يحدث عن رسول الله صلى الله عليه وسلم ، في شأن ساعة الجمعة‏؟‏ قال‏:‏ قلت‏:‏ نعم، سمعته يقول‏:‏ سمعت رسول الله صلى الله عليه وسلم ، يقول‏:‏ ‏\n\"‏هي ما بين أن يجلس الإمام إلى أن تقضى الصلاة‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Abu Burdah bin Abu Musa Al-Ash'ari (May Allah be pleased with him) reported:","text":"'Abdullah bin 'Umar (May Allah be pleased with them) said to me: \"Did you hear your father narrating something from the Messenger of Allah (ﷺ) about the special moment during Friday?\" I said: \"Yes, I heard him report from the Messenger of Allah (ﷺ): 'It occurs between the time when the Imam sits down (on the pulpit after the first Khutbah) and the time Salat is over.\"'."}},{"id":168,"idInBook":168,"chapterId":8,"bookId":13,"arabic":"وعن أوس بن أوس، رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\n\"‏إن من أفضل أيامكم يوم الجمعة، فأكثروا علي من الصلاة فيه، فإن صلاتكم معروضة علي‏\"‏ ‏(‏‏(‏رواه أبو داود بإسناد صحيح‏)‏‏)‏‏.‏","english":{"narrator":"Aus bin Aus (May Allah be pleased with him)reported:","text":"The Messenger of Allah (ﷺ) said, \"Among the best of your days is Friday. On that day pray to Allah to exalt my mention frequently, for your such supplications are presented to me.\"."}},{"id":169,"idInBook":169,"chapterId":8,"bookId":13,"arabic":"عن سعد بن أبي وقاص، رضي الله عنه، قال‏:‏ خرجنا مع رسول الله صلى الله عليه وسلم من مكة نريد المدينة، فلما كنا قريبًا من عزوراء نزل ثم رفع يديه، فدعا الله ساعة، ثم خر ساجدًا، فمكث طويلا، ثم قام فرفع يديه ساعة، ثم خر ساجدًا- فعله- ثلاثًا- وقال‏:‏ ‏\n\"‏إني سألت ربي، وشفعت لأمتي، فأعطاني ثلث أمتي، فخررت ساجدًا لربي شكرًا، ثم رفعت رأسي، فسألت ربي لأمتي، فأعطاني ثلث أمتي، فخررت ساجدًا لربي شكرًا، ثم رفعت رأسي، فسألت ربي لأمتي، فأعطاني الثلث الآخر، فخررت ساجدًا لربي‏\"‏ ‏(‏‏(‏رواه أبو داود‏)‏‏)‏‏.‏","english":{"narrator":"Sa'd bin Abu Waqqas (May Allah be pleased with him) reported:","text":"We left Makkah with the Messenger of Allah (ﷺ) for Al-Madinah, and when we were near 'Azwara,' he (ﷺ) alighted (from his riding-camel) raised his hands in supplication to Allah for a while and prostrated himself. He remained for a long time in prostration. Then he stood up and raised his hands for a while, after which he prostrated himself (again), and remained for a long time in prostration. Then he stood up and raised his hands for a while, after which he prostrated himself for the third time. Then he (ﷺ) said, \"I supplicated my Rubb and made intercession for my Ummah, and He granted me one-third of them. So I again prostrated myself in gratitude to my Rubb. Then I raised my head and supplicated my Rubb for my Ummah, and He granted me another third of them. Again I raised my head and supplicated my Rubb for my Ummah and He granted me the last third of them. So I fell into prostration out of gratitude before my Rubb.\"."}},{"id":170,"idInBook":170,"chapterId":8,"bookId":13,"arabic":"وعن عائشة رضي الله عنها، قالت‏:‏ كان النبي صلى الله عليه وسلم ، يقوم من الليل حتى تتفطر قدماه، فقلت له‏:‏ لم تصنع هذا يا رسول الله، وقد غفر لك ما تقدم من ذنبك وما تأخر‏؟‏ قال‏:‏ ‏\n\"‏أفلا أكون عبدًا شكورًا‏\"‏‏.‏ ‏(‏‏(‏متفق عليه وعن المغيرة بن شعبة نحوه، متفق عليه‏)‏‏)‏‏.‏","english":{"narrator":"'Aishah (May Allah be pleased with her) reported:","text":"The Prophet (ﷺ) kept standing (in prayer) so long that the skin of his feet would crack. I asked him: \"Why do you do this, while you have been forgiven of your former and latter sins?\" He said, \"Should I not be a grateful slave of Allah?\"."}},{"id":171,"idInBook":171,"chapterId":8,"bookId":13,"arabic":"وعن علي رضي الله عنه، أن النبي صلى الله عليه وسلم، طرقه وفاطمة ليلا، فقال‏:‏ ‏\"‏ألا تصليان‏؟‏‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏ (20)","english":{"narrator":"'Ali (May Allah be pleased with him) reported:","text":"The Prophet (ﷺ) visited me and Fatimah (May Allah be pleased with her) one night and said, \"Do you not observe prayer (at night)?\"."}},{"id":172,"idInBook":172,"chapterId":8,"bookId":13,"arabic":"وعن سالم بن عبد الله بن عمر بن الخطاب، رضي الله عنهم، عن أبيه‏:‏ أن رسول الله صلى الله عليه وسلم ، قال‏:‏ ‏\n\"‏نعم الرجل عبد الله لو كان يصلي من الليل‏\"‏ قال سالم‏:‏ فكان عبد الله بعد ذلك لا ينام إلا قليلا‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","english":{"narrator":"","text":"Salim bin 'Abdullah bin 'Umar bin Al-Khattab (May Allah be pleased with them) reported, on the authority of his father, that the Messenger of Allah (ﷺ) said, \"What an excellent man 'Abdullah is! If only he could perform optional prayers at night.\" Salim said that after this, (his father) 'Abdullah slept very little at night.."}},{"id":173,"idInBook":173,"chapterId":8,"bookId":13,"arabic":"وعن عبد الله بن عمرو بن العاص، رضي الله عنهما قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\n\"‏يا عبد الله لا تكن مثل فلان‏:‏ كان يقوم الليل فترك قيام الليل‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏","english":{"narrator":"'Abdullah bin 'Amr bin Al-'As (May Allah be pleased with them) reported:","text":"The Messenger of Allah (ﷺ) said to me, \"Do not be like so-and-so O 'Abdullah! He used to pray during the night, then stopped the practice.\"."}},{"id":174,"idInBook":174,"chapterId":8,"bookId":13,"arabic":"وعن ابن مسعود رضي الله عنه ، قال‏:‏ ذكر عند النبي، صلى الله عليه وسلم رجل نام ليلة حتى أصبح‏!‏ قال‏:‏ ‏\n\"‏ذاك رجل بال الشيطان في أذنيه- أو قال‏:‏ في أذنه-‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏","english":{"narrator":"'Abdullah bin Mas'ud (May Allah be pleased with him) reported:","text":"Mention was made before the Prophet (ﷺ) of a man who slept throughout the night till morning. The Messenger of Allah (ﷺ) remarked, \"He is a man in whose ears Satan urinated.\".n"}},{"id":175,"idInBook":175,"chapterId":8,"bookId":13,"arabic":"وعن أبي هريرة رضي الله عنه، أن رسول الله صلى الله عليه وسلم ، قال‏:‏ ‏\n\"‏يعقد الشيطان على قافية، رأس أحدكم، إذا هو نام، ثلاث عقد، يضرب على كل عقدة‏:‏ عليك ليل طويل فارقد، فإن استيقظ أحدكم، فذكر الله تعالى انحلت عقدة، فإن توضأ انحلت عقدة، فإن صلى انحلت عقدة، فأصبح نشيطًا طيب النفس، وإلا أصبح خبيث النفس كسلان‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"When any one of you sleeps, Satan ties three knots at the back of his neck. He recites this incantation at every knot: 'You have a long night, so sleep.' If he awakes and remembers Allah, one knot is loosened. If he performs Wudu', the (second) knot is loosened; and if he performs prayer, (all) knots are loosened. He begins his morning in a happy and refreshed mood; otherwise, he gets up in bad spirits and sluggish state.\"."}},{"id":176,"idInBook":176,"chapterId":8,"bookId":13,"arabic":"وعن عبد الله بن سلام، رضي الله عنه ، أن النبي، صلى الله عليه وسلم ،قال‏:‏ ‏\n\"‏أيها الناس أفشوا السلام، وأطعموا الطعام، وصلوا بالليل والناس نيام، تدخلوا الجنة بسلام‏\"‏ ‏(‏‏(‏رواه الترمذي وقال‏:‏ حديث حسن صحيح‏)‏‏)‏‏.‏","english":{"narrator":"'Abdullah bin Salam (May Allah be pleased with him) reported:","text":"The Prophet (ﷺ) said, \"O people, promote the greetings, feed (the poor and needy) and perform Salat when others are asleep so that you will enter Jannah safely.\"."}},{"id":177,"idInBook":177,"chapterId":8,"bookId":13,"arabic":"وعن أبي هريرة، رضي الله عنه، قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\n\"‏أفضل الصيام بعد رمضان شهر الله المحرم، وأفضل الصلاة بعد الفريضة صلاة الليل‏\"‏‏.‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"The best month for observing Saum (fasting) after Ramadan is Muharram, and the best Salat after the prescribed Salat is Salat at night.\"."}},{"id":178,"idInBook":178,"chapterId":8,"bookId":13,"arabic":"وعن ابن عمر رضي الله عنهما، أن النبي صلى الله عليه وسلم ، قال‏:‏ ‏\n\"‏صلاة الليل مثنى مثنى، فإذا خفت الصبح فأوتر بواحدة‏\"‏‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏","english":{"narrator":"Ibn 'Umar (May Allah be pleased with them) reported:","text":"The Prophet (ﷺ) said, \"Salat during the night should consist of pairs of but if you fear that morning is near, then pray one Rak'ah as Witr.\"."}},{"id":179,"idInBook":179,"chapterId":8,"bookId":13,"arabic":"وعنه قال‏:‏ كان النبي صلى الله عليه وسلم ، يصلي من الليل مثنى مثنى، ويوتر بركعة‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏","english":{"narrator":"Ibn 'Umar (May Allah be pleased with them) reported:","text":"The Prophet (ﷺ) performed the night prayer in pairs (i.e., Rak'ah) and made it odd number by observing one Rak'ah (as Witr).."}},{"id":180,"idInBook":180,"chapterId":8,"bookId":13,"arabic":"وعن أنس رضي الله عنه، قال‏:‏ كان رسول الله صلى الله عليه وسلم ، يفطر من الشهر حتى نظن أن  لا يصوم منه، ويصوم حتى نظن أن لا يفطر منه شيئًا، وكان لا تشاء أن تراه من الليل مصليا إلا رأيته، ولا نائمًا إلا رأيته‏.‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","english":{"narrator":"Anas (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) used to leave off observing Saum (fasting) during a month until we thought that he would not observe Saum at all during it; and (sometimes) he would observe Saum till we began to think that he would not omit any day of that month. If one wished to see him performing Salat during the night, he could do that; and if one wished to see him sleeping at night, he could do that.."}},{"id":181,"idInBook":181,"chapterId":8,"bookId":13,"arabic":"وعن عائشة رضي الله عنها، أن رسول الله صلى الله عليه وسلم، كان يصلي إحدى عشرة ركعة- تعني في الليل- يسجد السجدة من ذلك قدر ما يقرأ أحدكم خمسين آية قبل أن يرفع رأسه، ويركع ركعتين قبل صلاة الفجر، ثم يضطجع على شقه الأيمن حتى يأتيه المنادي للصلاة، ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","english":{"narrator":"'Aishah (May Allah be pleased with her) reported:","text":"The Messenger of Allah (ﷺ) used to perform eleven Rak'ah (of Tahajjud) prayers at night. He (ﷺ) would prostrate so long as one of you might recite fifty Ayat (of the Qur'an). Thereafter, he would perform two Rak'ah before Fajr prayers and would lie down on his right side till the Mu'adhdhin would come and inform him about the time of (Fajr) prayer.."}},{"id":182,"idInBook":182,"chapterId":8,"bookId":13,"arabic":"وعنها قالت‏:‏ ما كان رسول الله صلى الله عليه وسلم ، يزيد- في رمضان ولا في غيره- على إحدي عشرة ركعة‏:‏ يصلي أربعًا فلا تسأل عن حسنهن وطولهن‏!‏ ثم يصلي أربعًا فلا تسأل عن حسنهن وطولهن‏!‏ ثم يصلي ثلاثًا‏.‏ فقلت‏:‏ يا رسول الله أتنام قبل أن توتر‏!‏‏؟‏ فقال‏:‏ ‏\n\"‏يا عائشة إن عيني تنامان ولا ينام قلبي‏\"‏‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏","english":{"narrator":"'Aishah (May Allah be pleased with her) reported:","text":"The Messenger of Allah (ﷺ) did not observe more than eleven Rak'ah (of Tahajjud prayers), be in Ramadan or any other month. First of all he would perform four Rak'ah. Ask not about their excellence and their length. He (ﷺ) would then perform four more Rak'ah; and do not ask about their excellence and their length. Then he would perform three Rak'ah (Witr prayer). ('Aishah (May Allah be pleased with her) added) I submitted: \"O Messenger of Allah! Do you sleep before performing the Witr prayer?\" He (ﷺ) said, \"O 'Aishah! My eyes sleep but my heart does not sleep.\"."}},{"id":183,"idInBook":183,"chapterId":8,"bookId":13,"arabic":"وعنها أن النبي صلى الله عليه وسلم، كان ينام أول الليل، ويقوم آخره فيصلي‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏","english":{"narrator":"'Aishah (May Allah be pleased with her) reported:","text":"The Prophet (ﷺ) would sleep during the early part of night and stand in Salat during the latter part.."}},{"id":184,"idInBook":184,"chapterId":8,"bookId":13,"arabic":"وعن ابن مسعود رضي الله عنه، قال‏:‏ صليت مع النبي صلى الله عليه وسلم ، ليلة، فلم يزل قائمًا حتى هممت بأمر سوء‏.‏ قيل‏:‏ ما هممت‏؟‏ قال‏:‏ هممت أن أجلس وأدعه‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏","english":{"narrator":"Ibn Mas'ud (May Allah be pleased with him) reported:","text":"One night I joined the Prophet (ﷺ) in his (optional) Salat. He (ﷺ) prolonged the Qiyam (standing) so much that I made up my mind to commit an act of wrong. He was questioned: \"What did you intend to do?\" He replied: \"I intended to sit down and stop following him (in Salat).\"."}},{"id":185,"idInBook":185,"chapterId":8,"bookId":13,"arabic":"وعن حذيفة رضي الله عنه، قال‏:‏ صليت مع النبي صلى الله عليه وسلم ، ذات ليلة فافتتح البقرة، فقلت‏:‏ يركع عند المائة، ثم مضى، فقلت‏:‏ يصلي بها في ركعة، فمضي، فقلت‏:‏ يركع بها، ثم افتتح النساء فقرأها، ثم افتتح آل عمران، فقرأها، يقرأ مترسلا‏.‏ إذا مر بآية فيها تسبيح سبح، وإذا بسؤال سأل، وإذا مر بتعوذ تعوذ، ثم ركع، فجعل يقول‏:‏ سبحان ربي العظيم، فكان ركوعه نحوًا من قيامه، ثم قال‏:‏ سمع الله لمن حمده، ربنا لك الحمد، ثم قام طويلا قريبًا مما ركع، ثم سجد فقال‏:‏ سبحان ربي الأعلى، فكان سجوده قريبًا من قيامه‏.‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Hudhaifah (May Allah be pleased with him) reported:","text":"I performed Salat with the Prophet (ﷺ) one night, and he started reciting Surat Al- Baqarah. I thought that he would go in Ruku' (bowing posture in Salat) at the end of one hundred Ayat, but he continued (reciting); and I thought that he would perhaps recite (this Surah) in the whole Rak'ah (prayer), but he continued the recitation; I thought he would perhaps bow on completing (this Surah). He (ﷺ) then started reciting Surat An-Nisa' which he followed with Surat Al-Imran. He recited leisurely. When he recited an Ayah which mentioned the tasbeeh, he would say Subhan Allah and when he recited the Ayah which tells how the Rubb is to be asked, the Messenger of Allah (ﷺ) would then ask from Him; and when he (ﷺ) recited an Ayah asking one to seek Protection Allah, he would seek Protection of Allah. Then he bowed and said, \"Subhana Rabbiyal-Azim (My Rubb the Great is free from imperfection)\"; his bowing lasted about the same length of time as his standing, (and then on returning to the standing posture after Ruku') he would say, \"Sami' Allahu liman hamidah, Rabbana lakal-hamd (Allah listens to him who praises Him. Praise be to You, Our Rubb!),\" and he would then stand about the same length of time as he had spent in bowing. He would then prostrate himself and say, \"Subhana Rabbiyal-A'la (My Rubb the Supreme is free from imperfection),\" and his prostration lasted nearly the same length of time as his standing (Qiyam).."}},{"id":186,"idInBook":186,"chapterId":8,"bookId":13,"arabic":"وعن جابر رضي الله عنه قال‏:‏ سئل رسول الله صلى الله عليه وسلم ‏:‏ أي الصلاة أفضل‏؟‏ قال‏:‏ ‏\n\"‏طول القنوت‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Jabir (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) was asked: \"Which Salat is the best?\" He replied, \" The best Salat is that in which Qiyam (the duration of standing) is longer.\"."}},{"id":187,"idInBook":187,"chapterId":8,"bookId":13,"arabic":"وعن عبد الله بن عمرو بن العاص، رضي الله عنهما، أن رسول الله صلى الله عليه وسلم ، قال‏:‏ ‏\n\"‏أحب الصلاة إلى الله صلاة داود، وأحب الصيام إلى الله صيام داود، كان ينام نصف الليل ويقوم ثلثه وينام سدسه ويصوم يومًا ويفطر يومًا‏\"‏‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏","english":{"narrator":"'Abdullah bin 'Amr (May Allah be pleased with them) reported:","text":"The Messenger of Allah (ﷺ) said, \"The Salat which is dearest to Allah is that of (Prophet) Dawud; and As-Saum (the fasting) which is dearest to Allah is that of (Prophet) Dawud. He used to sleep half the night, get up to perform Salat for one-third of it, then sleep through the remaining one-sixth of it; and he used to observe Saum on alternative days.\"."}},{"id":188,"idInBook":188,"chapterId":8,"bookId":13,"arabic":"وعن جابر رضي اللله عنه قال‏:‏ سمعت رسول الله صلى الله عليه وسلم ، يقول‏:‏ ‏\n\"‏إن في الليل لساعة، لا يوافقها رجل مسلم يسأل الله تعالى خيرًا من أمر الدنيا والآخرة، إلا أعطاه إياه، وذلك كل ليلة‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Jabir (May Allah be pleased with him) reported:","text":"I heard the Messenger of Allah (ﷺ) saying, \"Every night there is a special time during which whatever a Muslim asks Allah of any good relating to this life or the Hereafter, it will be granted to him; and this moment comes every night.\"."}},{"id":189,"idInBook":189,"chapterId":8,"bookId":13,"arabic":"وعن أبي هريرة رضي الله عنه، أن النبي صلى الله عليه وسلم، قال‏:‏ ‏\n\"‏إذا قام أحدكم من الليل فليفتتح الصلاة بركعتين خفيفتين‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Prophet (ﷺ) said, \"When one of you gets up at night to perform (Tahajjud) prayer, let him start Salat with two short Rak'ah.\"."}},{"id":190,"idInBook":190,"chapterId":8,"bookId":13,"arabic":"وعن عائشة رضي الله عنها قالت كان رسول الله صلى الله عليه وسلم إذا قام من الليل افتتح صلاته بركعتين خفيفتين ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"'Aishah (May Allah be pleased with her) reported:","text":"Whenever the Messenger of Allah (ﷺ) stood for Salat at night, he would start his prayer with two brief Rak'ah.."}},{"id":191,"idInBook":191,"chapterId":8,"bookId":13,"arabic":"وعنها رضي الله عنها، قالت‏:‏ كان رسول الله صلى الله عليه وسلم ، إذا فاتته الصلاة من الليل من وجع أو غيره، صلى من النهار ثنتي عشر ركعة‏.‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"'Aishah (May Allah be pleased with her) reported:","text":"If the Messenger of Allah (ﷺ) missed his night (Tahajjud) Salat because of indisposition or the like, he would perform twelve Rak'ah during the day.."}},{"id":192,"idInBook":192,"chapterId":8,"bookId":13,"arabic":"وعن عمر بن الخطاب، رضي الله عنه، قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\n\"‏من نام عن حزبه، أو عن شيء منه، فقرأه فيما بين صلاة الفجر وصلاة الظهر، كتب له كأنما قرأه من الليل‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"'Umar bin Al-Khattab (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said: \"If anyone falls asleep and therefore fails to observe his Hizb (share) or part of it, if he observes it between the Fajr and the Zuhr prayers, it will be recorded for him as though he had observed it during the night.\"."}},{"id":193,"idInBook":193,"chapterId":8,"bookId":13,"arabic":"وعن أبي هريرة رضي الله عنه، قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\n\"‏رحم الله رجلا قام من الليل، فصلى وأيقظ امرأته، فإن أبت نضح في وجهها الماء، ورحم الله امرأة قامت من الليل فصلت، وأيقظت زوجها فإن أبي نضحت في وجهه الماء‏\"‏ ‏(‏‏(‏رواه أبو داود بإسناد صحيح‏)‏‏)‏‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"May Allah show mercy to a man who gets up during the night and performs Salat, awakens his wife to pray and if she refuses, he sprinkles water on her face (to make her get up). May Allah show mercy to a woman who gets up during the night and performs Salat, awakens her husband for the same purpose; and if he refuses, she sprinkles water on his face.\"."}},{"id":194,"idInBook":194,"chapterId":8,"bookId":13,"arabic":"وعنه وعن أبي سعيد رضي الله عنهما، قالا‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\n\"‏إذا أيقظ الرجل أهله من الليل فصليا أو صلى ركعتين جميعًا كتب في الذاكرين والذاكرات‏\"‏ ‏(‏‏(‏رواه أبو داود بإسناد صحيح‏)‏‏)‏‏.‏","english":{"narrator":"Abu Sa'id and Abu Hurairah (May Allah be pleased with them) reported:","text":"The Messenger of Allah (ﷺ) said, \"When a man awakens his wife during the night and they both perform two Rak'ah Salat together, they are recorded among the men and women who celebrate remembrance of Allah.\"."}},{"id":195,"idInBook":195,"chapterId":8,"bookId":13,"arabic":"وعن عائشة رضي الله عنها، أن النبي صلى الله عليه وسلم قال‏:‏ ‏\n\"‏ إذا نعس أحدكم في الصلاة، فليرقد حتى يذهب عنه النوم، فإن أحدكم إذا صلى وهو ناعس، لعله يذهب يستغفر فيسب نفسه‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","english":{"narrator":"'Aishah (May Allah be pleased with her) reported:","text":"The Prophet (ﷺ) said, \"When one of you dozes off while performing Salat, he should lie down till his drowsiness has gone away from him. When one of you performs Salat while dozing, he may abuse himself instead of seeking pardon (as a result of drowsiness).\"."}},{"id":196,"idInBook":196,"chapterId":8,"bookId":13,"arabic":"وعن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\n\"‏إذا قام أحدكم، من الليل فاستعجم القرآن على لسانه، فلم يدرِ ما يقول، فليضطجع‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"When anyone of you stands up for Salat at night and finds it difficult to recite the Qur'an accurately and he is unaware of what he is reciting, he should go back to sleep.\"."}},{"id":197,"idInBook":197,"chapterId":8,"bookId":13,"arabic":"عن أبي هريرة رضي الله عنه، أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\n\"‏من قام رمضان إيمانًا واحتسابًا غفر له ما تقدم من ذنبه‏\"‏‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"He who observes optional prayer (Tarawih prayers) throughout Ramadan, out of sincerity of Faith and in the hope of earning reward will have his past sins pardoned.\"."}},{"id":198,"idInBook":198,"chapterId":8,"bookId":13,"arabic":"وعنه، رضي الله عنه قال‏:‏ كان رسول الله صلى الله عليه وسلم، يرغب في قيام رمضان من غير أن يأمرهم فيه بعزيمة، فيقول‏:‏ ‏\n\"‏من قام رمضان إيمانًا واحتسابًا غفر له ما تقدم من ذنبه‏\"‏ ‏.‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) used to urge (the people) to perform (optional Tarawih) prayer at night during the month of Ramadan. He did not order them or make it obligatory on them. He (ﷺ) said, \"Whosoever performs (optional Tarawih) prayers at night during the month of Ramadan, with Faith and in the hope of receiving Allah's reward, will have his past sins forgiven.\"."}},{"id":199,"idInBook":199,"chapterId":8,"bookId":13,"arabic":"وعن أبي هريرة رضي الله عنه، عن النبي صلى الله عليه وسلم قال‏:‏ ‏\n\"‏من قام ليلة القدر إيمانا واحتسابًا غفر له ما تقدم من ذنبه‏\"‏‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Prophet (ﷺ) said, \"Whosoever performs Qiyam during Lailat-ul-Qadr (Night of Decree), with Faith and being hopeful of Allah's reward, will have his former sins forgiven.\"."}},{"id":200,"idInBook":200,"chapterId":8,"bookId":13,"arabic":"وعن ابن عمر رضي الله عنهما أن رجالا من أصحاب النبي صلى الله عليه وسلم، أروا ليلة القدر في المنام في السبع الأواخر، فقال رسول الله صلى الله عليه وسلم ‏:‏ ‏\n\"‏أرى رؤياكم قد تواطأت في السبع الأواخر، فمن كان متحريها، فليتحرها في السبع الأواخر‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏","english":{"narrator":"Ibn 'Umar (May Allah be pleased with them) reported:","text":"Some of the Companions of the Prophet (ﷺ) saw Lailat-ul-Qadr (Night of Decree) in their dreams in the last seven nights of Ramadan, whereupon the Messenger of Allah (ﷺ) said, \"I see that your dreams all agree upon the last seven nights. Whosoever seeks it, let him seek it in the last seven nights.\"."}},{"id":201,"idInBook":201,"chapterId":8,"bookId":13,"arabic":"وعن عائشة رضي الله عنها، قالت‏:‏ كان رسول الله صلى الله عليه وسلم يجاور في العشر الأواخر من رمضان، ويقول‏:‏ ‏\n\"‏تحروا ليلة القدر في العشر الأواخر من رمضان‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏","english":{"narrator":"'Aishah (May Allah be pleased with her) reported:","text":"The Messenger of Allah (ﷺ) used to seclude himself (in the mosque) during the last ten nights of Ramadan. He would say, \"Search for Lailat-ul-Qadr (Night of Decree) in the last ten nights of Ramadan.\"."}},{"id":202,"idInBook":202,"chapterId":8,"bookId":13,"arabic":"وعنها، رضي الله عنها، أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\n\"‏تحروا ليلة القدر في الوتر من العشر الأواخر من رمضان‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","english":{"narrator":"'Aishah (May Allah be pleased with her) reported:","text":"The Messenger of Allah (ﷺ) used to observe I'tikaf in the last ten days of Ramadan and say, \"Seek Lailat-ul-Qadr (Night of Decree) in the odd nights out of the last ten nights of Ramadan.\"."}},{"id":203,"idInBook":203,"chapterId":8,"bookId":13,"arabic":"وعنها رضي الله عنها، قالت‏:‏ كان رسول الله صلى الله عليه وسلم ‏:‏ ‏\n\"‏إذا دخل العشر الأواخر من رمضان، أحيا الليلة، وأيقظ أهله، وجد وشد المئزر‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏","english":{"narrator":"'Aishah (May Allah be pleased with her) reported:","text":"When the last ten nights (of Ramadan) would begin, the Messenger of Allah (ﷺ) would keep awake at night (for prayer and devotion), awaken his family and prepare himself to be more diligent in worship.."}},{"id":204,"idInBook":204,"chapterId":8,"bookId":13,"arabic":"وعنها قالت‏:‏ كان رسول الله صلى الله عليه وسلم ، يجتهد في رمضان ما لا يجتهد في غيره، وفي العشر الأواخر منه، ما لا يجتهد في غيره‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"'Aishah (May Allah be pleased with her) reported:","text":"The Messenger of Allah (ﷺ) used to strive more in worship during Ramadan than he strove in any other time of the year; and he would devote himself more (in the worship of Allah) in the last ten nights of Ramadan than he strove in earlier part of the month.."}},{"id":205,"idInBook":205,"chapterId":8,"bookId":13,"arabic":"وعنها قالت‏:‏ قلت‏:‏ يا رسول الله أرأيت إن علمت أي ليلة القدر ما أقول فيها‏؟‏ قال‏:‏ ‏\n\"‏قولي‏:‏ اللهم إنك عفو تحب العفو فاعفُ عني‏\"‏ ‏(‏‏(‏رواه الترمذي وقال حديث حسن صحيح‏)‏‏)‏","english":{"narrator":"'Aishah (May Allah be pleased with her) reported:","text":"I asked: \"O Messenger of Allah! If I realize Lailat-ul-Qadr (Night of Decree), what should I supplicate in it?\" He (ﷺ) replied, \"You should supplicate: Allahumma innaka 'afuwwun, tuhibbul-'afwa, fa'fu 'anni (O Allah, You are Most Forgiving, and You love forgiveness; so forgive me).\"."}},{"id":206,"idInBook":206,"chapterId":8,"bookId":13,"arabic":"وعن أبي هريرة رضي الله عنه، أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\n\"‏لولا أن أشق على أمتي - أو على الناس- لأمرتهم بالسواك مع كل صلاة‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"Had I not thought it difficult for my Ummah, I would have commanded them to use the Miswak (tooth-stick) before every Salat.\"."}},{"id":207,"idInBook":207,"chapterId":8,"bookId":13,"arabic":"وعن حذيفة رضي الله عنه، قال‏:‏ كان رسول الله صلى الله عليه وسلم، إذا قام من النوم يشوص فاه بالسواك‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","english":{"narrator":"Hudaifah (May Allah be pleased with him) reported:","text":"Whenever the Messenger of Allah (ﷺ) got up (from sleep), he would rub his teeth with Miswak (tooth-stick).."}},{"id":208,"idInBook":208,"chapterId":8,"bookId":13,"arabic":"وعن عائشة رضي الله عنها، قالت‏:‏ كنا نعد لرسول الله، سواكه وطهوره، فيبعثه الله ما شاء أن يبعثه من الليل، فيتسوك ويتوضأ ويصلي‏.‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"'Aishah (may Allah be pleased with her) reported:","text":"We used to prepare for the Messenger of Allah (ﷺ) a Miswak (tooth-stick) and the water for making Wudu'. Whenever Allah wished to awaken him from sleep at night, he (ﷺ) would brush his teeth with Miswak, make Wudu', and perform Salat.."}},{"id":209,"idInBook":209,"chapterId":8,"bookId":13,"arabic":"وعن أنس رضي الله عنه، قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\n\"‏أكثرت عليكم في السواك‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","english":{"narrator":"Anas (May Allah be pleased with him)reported:","text":"The Messenger of Allah (ﷺ) said, \"I stress upon you to use Miswak (tooth- stick).\"."}},{"id":210,"idInBook":210,"chapterId":8,"bookId":13,"arabic":"وعن شريح بن هانئ قال‏:‏ قلت لعائشة، رضي الله عنها‏:‏ بأي شيء كان يبدأ النبي صلى الله عليه وسلم إذا دخل بيته‏.‏ قالت‏:‏ بالسواك‏.‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Shuraih bin Hani (May Allah be pleased with him) reported:","text":"I asked 'Aishah (may Allah be pleased with her): \"What was the first thing which the Prophet (ﷺ) would do when he entered his house?\" She replied: \"He would use Miswak (tooth-stick).\"."}},{"id":211,"idInBook":211,"chapterId":8,"bookId":13,"arabic":"وعن أبي موسى الأشعري، رضي الله عنه، قال‏:‏ دخلت على النبي صلى الله عليه وسلم، وطرف السواك على لسانه‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏ وهذا لفظ مسلم‏.‏","english":{"narrator":"Abu Musa Al-Ash'ari (May Allah be pleased with him) reported:","text":"I came to the Prophet (ﷺ) once and noticed the tip of Miswak (tooth-stick) on his tongue.."}},{"id":212,"idInBook":212,"chapterId":8,"bookId":13,"arabic":"وعن عائشة رضي الله عنها ان النبي صلى الله عليه وسلم ‏:‏ قال‏:‏ ‏\n\"‏السواك مطهرة للفم مرضاة للرب‏\"‏ ‏(‏‏(‏رواه النسائي، وابن خذيمة في صحيحه بأسانيد صحيحة‏)‏‏)‏‏.‏","english":{"narrator":"'Aishah (May Allah be pleased with her) reported:","text":"The Prophet (ﷺ) said, \"The Miswak (tooth-stick) cleanses and purifies the mouth and pleases the Rubb.\"."}},{"id":213,"idInBook":213,"chapterId":8,"bookId":13,"arabic":"وعن أبي هريرة رضي الله عنه، عن النبي صلى الله عليه وسلم قال‏:‏ ‏\"‏الفطرة خمس، أو خمس من الفطرة‏:‏ الختان، والاستحداد، وتقليم الأظفار، ونتف الإبط، وقص الشارب‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ (24)","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Prophet (ﷺ) said, \"There are five acts which conform to the pure nature: Circumcision, removing of the pubic hair, clipping the nails, plucking the underarm hair and trimming the moustache.\"."}},{"id":214,"idInBook":214,"chapterId":8,"bookId":13,"arabic":"وعن عائشة رضي الله عنها قالت‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏عشر من الفطرة‏:‏ قص الشارب، وإعفاء اللحية، والسواك، واستنشاق الماء، وقص الأظفار، وغسل البراجم، ونتف الإبط، وحلق العانة، وانتقاص الماء‏\"‏ ‏(‏‏(‏قال الراوي‏:‏ ونسيت العاشرة إلا أن تكون المضمضة، قال‏:‏ وكيع- وهو أحد رواته-‏)‏‏)‏ ‏.‏ (25) ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏‏(‏‏(‏ (26)","english":{"narrator":"'Aishah (May Allah be pleased with her) reported:","text":"The Messenger of Allah (ﷺ) said, \"There are ten demands of pure nature: trimming the moustache, letting the beard grow, using Miswak (tooth-stick), snuffing up water into the nose (in ablution), paring the nails, washing the bases of the finger joints; plucking the underarm hair, removing of the pubic hair and removing impurities with water from the affected part after a call of nature.\"The subnarrator said: I forgot the tenth but it might possibly be the rinsing of the mouth (in ablution).."}},{"id":215,"idInBook":215,"chapterId":8,"bookId":13,"arabic":"وعن ابن عمر رضي الله عنهما، عن النبي صلى الله عليه وسلم قال‏:‏ ‏\n\"‏أحفوا الشوارب وأعفوا اللحى‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏","english":{"narrator":"Ibn 'Umar (May Allah be pleased with them) reported:","text":"The Prophet (ﷺ) said, \"Trim the moustaches and let the beard grow.\"."}},{"id":216,"idInBook":216,"chapterId":8,"bookId":13,"arabic":"وعن ابن عمر رضي الله عنهما، أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\n\"‏بني الإسلام على خمس‏:‏ شهادة أن لا إله إلا الله وأن محمدًا عبده ورسوله، إقام الصلاة، وإيتاء الزكاة، وحج البيت، وصوم رمضان‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏","english":{"narrator":"Ibn 'Umar (May Allah be pleased with them) reported:","text":"The Messenger of Allah (ﷺ) said, \"(The structure of) Islam is built on five (pillars): Testification of 'La ilaha illallah' (none has the right to be worshipped but Allah), that Muhammad (ﷺ) is his slave and Messenger, the establishment of Salat, the payment of Zakat, the pilgrimage to the House of Allah (Ka'bah), and Saum during the month of Ramadan.\"."}},{"id":217,"idInBook":217,"chapterId":8,"bookId":13,"arabic":"وعن طلحة بن عبيد الله، رضي الله عنه قال‏:‏ جاء رجل إلى رسول الله صلى الله عليه وسلم، من أهل نجد، ثائر الرأس نسمع دوي صوته، ولا نفقه ما يقول، حتى دنا من رسول الله صلى الله عليه وسلم فإذا هو يسأل عن الإسلام، فقال الرسول صلى الله عليه وسلم ‏:‏ ‏\"‏خمس صلوات في اليوم والليلة‏\"‏ قال‏:‏ هل علي غيرهن‏؟‏ قال‏:‏ ‏\"‏لا، إلا أن تطوع‏\"‏ فقال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏وصيام شهر رمضان‏\"‏ قال هل على غيره‏؟‏ قال‏:‏ ‏\"‏لا إلا أن تطوع‏\"‏ قال‏:‏ وذكر له رسول الله صلى الله عليه وسلم، الزكاه فقال‏:‏ هل علي غيرها‏؟‏ قال‏:‏ ‏\"‏لا، إلا أن تطوع‏\"‏ فأدبر الرجل وهو يقول‏:‏ والله لا أزيد على هذا ولا أنقص منه، فقال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏أفلح إن صدق‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏","english":{"narrator":"Talhah bin 'Ubaidullah (May Allah be pleased with him) reported:","text":"A person with dishevelled hair, one of the people of Najd, came to the Messenger of Allah (ﷺ). We heard the humming of his voice but could not fully understand what he was saying, till he approached close to the Messenger of Allah (ﷺ). Then I came to know that he was asking about Islam. The Messenger of Allah (ﷺ) said: \"There are five (obligatory) Salat during the day and the night.\" He said: \"Am I obliged to perform any other (Salat) besides these?\" The Messenger of Allah (ﷺ) said, \"No, but whatever you observe voluntarily.\" He (ﷺ) added, \"There is the Saum of Ramadan.\" The inquirer asked: \"Am I obliged to do anything besides this?\" The Messenger of Allah (ﷺ) said, \"No, but whatever you do out of your own free will. You may observe voluntary fasting.\" And the Messenger of Allah (ﷺ) told him about the Zakat (obligatory charity). The inquirer asked: \"Am I obliged to pay anything besides this?\" The Messenger of Allah (ﷺ) said, \"No, but whatever you pay voluntarily out of your own free will.\" That man turned back saying: \"By Allah! I will neither make any addition to this nor will I decrease anything from it.\" (Upon hearing this) the Messenger of Allah (ﷺ) remarked, \"He is successful if he proves truthful (to what he is saying).\"."}},{"id":218,"idInBook":218,"chapterId":8,"bookId":13,"arabic":"وعن ابن عباس رضي الله عنه، أن النبي صلى الله عليه وسلم بعث معاذًا رضي الله عنه إلى اليمن فقال‏:‏ ‏\n\"‏ادعهم إلى شهادة أن لا إله إلا الله وأني رسول الله، فإن هم أطاعوا لذلك فأعلمهم أن الله تعالى افترض عليهم خمس صلوات في كل يوم وليلة، فإن هم أطاعوا لذلك فأعلمهم أن الله افترض عليهم صدقة تؤخذ من أغنيائهم، وترد على فقرائهم‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏","english":{"narrator":"Ibn 'Abbas (May Allah be pleased with them) reported:","text":"The Prophet (ﷺ) appointed Mu'adh (May Allah be pleased with him) as governor of Yemen, and at the time of his departure, he instructed him thus: \"First of all, call the people to testify 'La ilaha illallah' (there is no true god except Allah) and that I (Muhammad) am the Messenger of Allah, and if they accept this (declaration of Faith), then tell them that Allah has enjoined upon them five Salat during the day and night; and if they obey you, tell them that Allah has made the payment of Zakat obligatory upon them. It should be collected from their rich and distributed among their poor.\"."}},{"id":219,"idInBook":219,"chapterId":8,"bookId":13,"arabic":"وعن ابن عمر رضي الله عنهما قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\n\"‏أمرت أن أقاتل الناس حتى يشهدوا أن لا إله إلا الله وأن محمدًا رسول الله، ويقيموا الصلاة، ويؤتوا الزكاة، فإذا فعلوا ذلك، عصموا مني دماءهم وأموالهم إلا بحق الإسلام وحسابهم على الله‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","english":{"narrator":"Ibn 'Umar (May Allah be pleased with them) reported:","text":"The Messenger of Allah (ﷺ) said, \"I have been commanded to fight people till they testify 'La ilaha illallah' (there is no true god except Allah) that Muhammad (ﷺ) is his slave and Messenger, and they establish Salat, and pay Zakat; and if they do this, their blood (life) and property are secured except when justified by law, and it is for Allah to call them to account.\"."}},{"id":220,"idInBook":220,"chapterId":8,"bookId":13,"arabic":"عن أبي هريرة رضي الله عنه، قال‏:‏ لما توفي رسول الله، وكان أبو بكر، رضي الله عنه، وكفر من كفر من العرب، فقال عمر رضي الله عنه‏:‏ كيف يقاتل الناس وقد قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\n\"‏أمرت أن أقاتل الناس حتى يقولوا لا إله إلا الله، فمن قالها، فقد عصم مني ماله ونفسه إلا بحقه وحسابه على الله‏\"‏ ‏؟‏‏!‏ فقال أبو بكر‏:‏ والله لأقاتلن من فرق بين الصلاة والزكاة، فإن الزكاة حق المال‏.‏ والله لو منعوني عقال كانوا يؤدونه إلى رسول الله صلى الله عليه وسلم، لقاتلتهم على منعه، قال‏:‏ عمر رضي الله عنه‏:‏ فوالله ما هو إلا أن رأيت الله قد شرح صدر أبي بكر للقتال، فعرفت أنه الحق‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"When the Messenger of Allah (ﷺ) passed away, Abu Bakr (May Allah be pleased with him) was appointed as his successor (caliph). Amongst the Arabs some men apostatised. Abu Bakr (May Allah be pleased with him) resolved to fight them. 'Umar bin Al-Khattab (May Allah be pleased with him) said to Abu Bakr: \"How can you fight them when the Messenger of Allah (ﷺ) has declared: 'I have been commanded to fight people till they testify La ilaha illallah (there is no true god except Allah); and if they do it, their blood (life) and property are secured except when justified by law, and it is for Allah to call them to account.\" Upon this Abu Bakr (May Allah be pleased with him) said: \"By Allah, I would definitely fight him who makes distinction between Salat and the Zakat, because it is an obligation upon the rich to pay Zakat. By Allah I will fight them even to secure the piece of rope which they used to give to the Messenger of Allah (ﷺ).\" 'Umar (May Allah be pleased with him) said: \"I realized that Allah opened the heart of Abu Bakr (May Allah be pleased with him) for fighting those who refused to pay Zakat, and I fully recognized that Abu Bakr"}},{"id":221,"idInBook":221,"chapterId":8,"bookId":13,"arabic":"وعن أبي أيوب رضي الله عنه، أن رجلا قال للنبي صلى الله عليه وسلم ‏:‏ أخبرني بعمل يدخلني الجنة قال‏:‏ ‏\n\"‏تعبد الله لا تشرك به شيئًا، وتقيم الصلاة، وتؤتي الزكاة، وتصل الرحم‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏","english":{"narrator":"Abu Ayyub (May Allah be pleased with him) reported:","text":"A man said to the Prophet (ﷺ): \"Direct me to a deed which may admit me to Jannah.\" Upon this he (the Messenger of Allah (ﷺ)) said, \"Worship Allah and never associate anything with Him in worship, establish Salat, pay Zakat, and strengthen the ties of kinship.\"."}},{"id":222,"idInBook":222,"chapterId":8,"bookId":13,"arabic":"وعن أبي هريرة رضي الله عنه، أن أعرابيًا أتي النبي صلى الله عليه وسلم فقال‏:‏ يا رسول الله دلني على عمل إذا عملته، دخلت الجنة‏.‏ قال‏:‏ ‏\"‏تعبد الله ولا تشرك به شيئًا، وتقيم الصلاة، وتؤتي الزكاة المفروضة، وتصوم رمضان‏\"‏ قال‏:‏ والذي نفسي بيده، لا أزيد على هذا‏.‏ فلما ولى قال النبي صلى الله عليه وسلم ‏:‏ ‏\"‏من سره أن ينظر إلى رجل من أهل الجنة فلينظر إلى هذا‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"A bedouin came to the Prophet (ﷺ) and said: \"O Messenger of Allah! Direct me to a deed by which I may be entitled to enter Jannah.\" The Prophet (ﷺ) said, \"Worship Allah, and never associate anything with Him, establish Salat, pay the Zakat which has been enjoined upon you, and observe Saum of Ramadan.\" He (the bedouin) said: \"By Him in Whose Hand my soul is, I will never add anything to these (obligations).\" When he turned his back, the Prophet (ﷺ) said, \"He who wants to see a man from the dwellers of Jannah, let him look at him (bedouin).\"."}},{"id":223,"idInBook":223,"chapterId":8,"bookId":13,"arabic":"وعن جرير بن عبد الله، رضي الله عنه، قال‏:‏ بايعت النبي، صلى الله عليه وسلم، على إقام الصلاة، وإيتاء الزكاة، والنصح لكل مسلم‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏","english":{"narrator":"Jarir bin 'Abdullah (May Allah be pleased with him) reported:","text":"I pledged allegiance to the Prophet (ﷺ) to establish Salat, to pay the Zakat and to have the welfare of every Muslim at heart.."}},{"id":224,"idInBook":224,"chapterId":8,"bookId":13,"arabic":"وعن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ما من صاحب ذهب، ولا فضة، لا يؤدي منها حقها إلا إذا كان يوم القيامة صفحت له صفائح من نار، فأحمي عليها في نار جهنم فيكوى بها جنبه، وجبينه، وظهره، كلما بردت أعيدت له في يوم كان مقداره خمسين ألف سنة، حتى يقضى بين العباد فيرى سبيله، إما إلى الجنة، وإما إلى النار‏\"‏ قيل‏:‏ يا رسول الله فالإبل‏؟‏ قال‏:‏ ‏\"‏ولا صاحب إبل لا يؤدي منها حقها، ومن حقها حلبها يوم وردها، إلا إذ كان يوم القيامة بطح لها بقاع قرقر أوفر ما كانت، لا يفقد منها فصيلا واحدًا، تطؤه بأخفافها، وتعضه بأفواهها كلما مر عليه أُولاها، رد عليه أُخراها، في يوم كان مقداره خمسين ألف سنة، حتى يقضى بين العباد، فيرى سبيله، إما إلى الجنة، وإما إلى النار‏\"‏ قيل‏:‏ يا رسول الله فالبقر والغنم‏؟‏ قال‏:‏ ‏\"‏ولا صاحب بقر ولا غنم لا يؤدي منها حقها إلا إذا كان يوم القيامة، بطح لها بقاع قرقر، لا يفقد منها شيئًا ليس فيها عقصاء، ولا جلحاء، ولا عضباء، تنطحه بقرونها، وتطؤه بأظلافها، كلما مر عليه أُولاها، رد عليه أُخراها، في يوم كان مقداره خمسين ألف سنة حتى يقضى بين العباد، فيرى سبيله، إما إلى الجنة، وإما إلى النار‏\"‏ ‏.‏ قيل‏:‏ يا رسول الله فالخيل‏؟‏ قال‏:‏ ‏\"‏الخيل ثلاثة‏:‏ هي لرجل وزر، وهي لرجل ستر، وهي لرجل أجر، فأما التي هي له وزر فرجل ربطها رياء وفخرًا ونواء على أهل الإسلام، فهي له وزر، وأما التي هي له ستر، فرجل ربطها في سبيل الله، ثم لم ينسَ حق الله في ظهورها، ولا رقابها فهي له ستر، وأما التي هي له أجر، فرجل ربطها في سبيل الله لأهل الإسلام في مرج، أو روضة، فما أكلت من ذلك المرج أو الروضة من شيء إلا كتب له عدد ما أكلت حسنات، وكتب له عدد أرواثها وأبوالها حسنات، ولا تقطع طولها فاستنت شرفًا أو شرفين إلا كتب الله له عدد آثارها، وأرواثها حسنات، ولا مر بها صاحبها على نهر فشربت منه، ولا يريد أن يسقيها إلا كتب الله له عدد ما شربت حسنات‏\"‏  \nوالإيتار قبل النوم إنما يستحب لمن لا يثق باستيقاظ آخر الليل، فإن وثق فآخر الليل أفضل‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"Any person who possesses gold or silver and does not pay what is due on it (i.e., the Zakat); on the Day of Resurrection, sheets of silver and gold would be heated for him in the fire of Hell and with them his flank, forehead and back will be branded. When they cool down, they will be heated again and the same process will be repeated during the day the measure whereof will be fifty thousand years. (This would go on) until Judgement is pronounced among (Allah's) slaves, and he will be shown his final abode, either to Jannah or to Hell.\" It was asked, \"How about someone who owns camels and does not pay what is due on him (i.e., their Zakat)?\" He (ﷺ) replied, \"In the same way the owner of camels who does not discharge what is due in respect of them (their due includes their milking on the day when they are taken to water) will be thrown on his face or on his back in a vast desert plain on the Day of Resurrection and they will trample upon him with their hoofs and bite him with their teeth. As often as the first of them passes him, the last of them will be made to return during a day the measure whereof will be fifty thousand years, until Judgement is pronounced among (Allah's) slaves, he will be shown his final abode either to Jannah or to Hell.\" It was (again) asked: \"O Messenger of Allah, what about cows (cattle) and sheep?\" He (ﷺ) said, \"If anyone who possesses cattle and sheep and does not pay what is due on them (i.e., their Zakat); on the Day of Resurrection, he will be thrown on his face in a vast plain desert. He will find none of the animals missing with twisted horns, without horns or with a broken horn, and they will gore him with their horns and trample upon him with their hoofs. As often as the first of them passes him, the last of them will be made to return to him during a day the measure whereof will be fifty thousand years, until Judgement is pronounced among (Allah's) slaves; and he will be shown his final abode either to Jannah or to Hell.\" It was asked: \"O Messenger of Allah, what about the horses?\" Upon this he (ﷺ) said, \"The horses are of three types. One, which is a burden for the owner; another which is a shield, and another one which makes its owner entitled to reward. The one for whom these are a burden is the person who rears them for show or for pride or for causing injury to the sentiments of the Muslims. They will be a cause of torment for their owners. The one for whom these are a shield is the person who rears them for the sake of Allah but does not forget the Right of Allah concerning their backs and their necks (i.e., he lets a needy ride on them), and so they are a shield for him. Those which bring reward to the one who rears them in pastures and gardens are the ones that are used in the Cause of Allah (Jihad) by the Muslims. Whatever they eat from the meadows and the gardens will be recorded on his behalf as good deeds so much so that their droppings and urine will be counted for an equal number of good deeds for him. Even when they break their tying rope and every height from which they climb and every hoofprint which they leave will be counted as a good deed on behalf of the owner. When their owner leads them through a stream from which they drink, though he does not intend to quench their thirst, yet Allah would record for him the quantity (of water) of what they would drink on his behalf as good deeds.\" It was asked: \"O Messenger of Allah, what about the donkeys?\" Upon this he (ﷺ) said, \"Nothing has been revealed to me in regard to the donkeys in particular except this one Verse of a comprehensive nature: \"So whosoever does good equal to the weight of an atom (or a small ant) shall see it. And whosoever does evil equal to the weight of an atom (or a small ant) shall see it.\"' (99: 8,9).."}},{"id":225,"idInBook":225,"chapterId":8,"bookId":13,"arabic":"وعن أبي هريرة رضي الله عنه، قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏قال الله عز وجل‏:‏ كل عمل ابن آدم له إلا الصيام، فإنه لي وأنا أجزي به‏.‏ والصيام جُنة فإذا كان يوم صوم أحدكم فلا يرفث ولا يصخب، فإن سابه أحد أو قاتله، فليقل‏:‏ إني صائم‏.‏ والذي نفس محمد بيده لخُلوف فم الصائم أطيب عند الله من ريح المسك‏.‏  ‏\"‏للصائم فرحتان يفرحهما‏:‏ إذا أفطر فرح بفطره، وإذا لقي ربه فرح بصومه‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏‏(‏‏(‏وهذا لفظ رواية البخاري‏.‏ وفي رواية له‏:‏ يترك طعامه، وشرابه، وشهوته، من أجلي، الصيام لي وأنا أجزي به، والحسنة بعشر أمثالها‏.‏ وفي رواية لمسلم‏:‏ ‏\"‏كل عمل ابن آدم يضاعف‏:‏ الحسنة بعشر أمثالها إلى سبعمائة ضعف‏.‏ قال الله تعالى‏:‏ ‏(إلا الصوم فإنه لي وأنا أجزي به‏:‏ يدع شهوته وطعامه من أجلي‏.‏ للصائم فرحتان‏:‏ فرحة عند فطره، وفرحة عند لقاء ربه‏.‏ ولخلوف فيه أطيب عند الله من ريح المسك‏)‏‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"Allah the Exalted and Majestic said: 'Every act of the son of Adam is for him, except As-Siyam (the fasting) which is (exclusively) for Me, and I will reward him for it.' Fasting is a shield. When anyone of you is observing fast, he should neither indulge in obscene language nor should he raise his voice; and if anyone reviles him or tries to quarrel with him, he should say: 'I am fasting.' By Him in Whose Hand the soul of Muhammad is, the breath of one observing Saum is sweeter to Allah than the fragrance of musk. The one who fasts, experiences two joys: he feels pleasure when he breaks the fast. He is joyful by virtue of his fast when he meets his Rubb.\".In a narration by Al-Bukhari, the Messenger of Allah (ﷺ) said, \"Allah says: '(The person observing Saum) has abstained from food and drink, and sexual pleasures for My sake; fasting is for Me, and I will bestow its reward. Every good deed has ten times its reward'.\"In a narration by Muslim, the Messenger of Allah (ﷺ) said, \"The reward of every (good) deed of a person is multiplied from ten to seven hundred times. Allah (SWT) says: 'The reward of observing Saum is different from the reward of other good deeds; Saum is for Me, and I Alone will give its reward. The person observing Saum abstains from food and drink only for My sake.' The fasting person has two joyous occasions, one at the time of breaking his fast, and the other at the time of meeting his Rubb. Surely, the breath of one observing Saum is better smelling to Allah than the fragrance of musk.\""}},{"id":226,"idInBook":226,"chapterId":8,"bookId":13,"arabic":"وعنه أن رسول الله صلى الله عليه وسلم قال‏:‏‏\"‏ من أنفق زوجين في سبيل الله نودي من أبواب الجنة ‏:‏يا عبد الله هذا خير، فمن كان من أهل الصلاة دعي من باب الصلاة، ومن كان من أهل الجهاد دعي من باب الجهاد، ومن كان من أهل الصيام دعي من باب الريان، ومن كان من أهل الصدقة دعي من باب الصدقة ‏\"‏ قال أبو بكر، رضي الله عنه ‏:‏بأبي أنت وأمي يا رسول الله ما على من دعي من تلك الأبواب من ضرورة، فهل يدعى أحد من تلك الأبواب كلها‏؟‏ قال‏:‏ ‏\"‏ نعم وأرجو أن تكون منهم ‏(‏‏(‏متفق عليه‏)‏‏)‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"He who spends a pair in the way of Allah will be called from the gates of Jannah: 'O slave of Allah! This gate is better for you' and one who is constant in Salat (prayer), will be called from the Gate of Salat; and whoever is eager in fighting in the Cause of Allah, will be called from the Gate of Jihad; and who is regular in observing Saum will be called from Ar-Raiyan Gate. The one who is generous in charity will be called from the Gate of Charity.\" Abu Bakr (May Allah be pleased with him) said: \"O Messenger of Allah (ﷺ)! May my mother and father be sacrificed for you! Those who are called from these gates will stand in need of nothing. Will anybody be called from all of those gates?\" He replied, \"Yes, and I hope that you will be one of them.\"."}},{"id":227,"idInBook":227,"chapterId":8,"bookId":13,"arabic":"وعن سهل بن سعد رضي الله عنه عنه عن النبي صلى الله عليه وسلم قال‏:‏ ‏\n\"‏إن في الجنة بابًا يقال له‏:‏ الريان، يدخل منه الصائمون يوم القيامة لا يدخل منه أحد غيرهم يقال‏:‏ أين الصائمون‏؟‏ فيقومون  لا يدخل منه أحد غيرهم، فإذا دخلوا أغلق فلم يدخل منه أحد‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","english":{"narrator":"Sahl bin Sa'd (May Allah be pleased with him):","text":"The Prophet (ﷺ) said, \"In Jannah there is a gate which is called Ar-Raiyan through which only those who observe Saum (fasting) will enter on the Day of Resurrection. None else will enter through it. It will be called out, \"Where are those who observe fasting?\" So they will stand up and proceed towards it. When the last of them will have entered, the gate will be closed and then no one will enter through that gate.\"."}},{"id":228,"idInBook":228,"chapterId":8,"bookId":13,"arabic":"وعن أبي سعيد الخدري، رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏\n\"‏ ما من عبد يصوم يومًا في سبيل الله إلا باعد الله بذلك اليوم وجهه عن النار سبعين خريفًا‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","english":{"narrator":"Abu Sa'id Al-Khudri (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"Every slave of Allah who observes Saum (fasting) for one day for the sake of Allah, Allah will draw his face farther from Hell-fire to the extent of a distance to be covered in seventy years.\"."}},{"id":229,"idInBook":229,"chapterId":8,"bookId":13,"arabic":"وعن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال‏:‏ من صام رمضان إيمانًا واحتسابًا، غفر له ما تقدم من ذنبه ‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Prophet (ﷺ) said, \"He who observes fasting during the month of Ramadan with Faith while seeking its reward from Allah, will have his past sins forgiven.\"."}},{"id":230,"idInBook":230,"chapterId":8,"bookId":13,"arabic":"وعنه رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\n\"‏إذا جاء رمضان فتحت أبواب الجنة، وغلقت أبواب النار، وصفدت الشياطين‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"When Ramadan begins, the gates of Jannah are opened, the gates of Hell are closed, and the devils are chained.\"."}},{"id":231,"idInBook":231,"chapterId":8,"bookId":13,"arabic":"وعنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\"‏صوموا لرؤيته، وأفطروا لرؤيته، فإن غَبِيَ عليكم فأكملوا عدة شعبان ثلاثين‏\"‏ ‏(‏‏(‏متفق عليه وهذا لفظ البخاري‏)‏‏)‏‏.‏  \nوفي رواية مسلم‏:‏ ‏\"‏فإن غم عليكم فصوموا ثلاثين يومًا‏\"‏‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"Observe Saum (fast) on sighting the crescent and terminate it on sighting it (the new moon), but if the sky is cloudy before you, then complete the number (thirty days) of the month.\"."}},{"id":232,"idInBook":232,"chapterId":8,"bookId":13,"arabic":"وعن ابن عباس رضي الله عنهما‏:‏ قال‏:‏ كان رسول الله صلى الله عليه وسلم أجود الناس، وكان أجود ما يكون في رمضان حين يلقاه جبريل وكان جبريل يلقاه في كل ليلة من رمضان فيدارسه القرآن فَلَرَسول الله صلى الله عليه وسلم حين يلقاه جبريل أجود بالخير من الريح المرسلة‏\"‏ ‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","english":{"narrator":"Ibn 'Abbas (May Allah be pleased with them) reported:","text":"The Messenger of Allah (ﷺ) was the most generous of the men; and he was the most generous during the month of Ramadan when Jibril visited him every night and recited the Qur'an to him. During this period, the generosity of Messenger of Allah (ﷺ) waxed faster than the rain bearing wind.."}},{"id":233,"idInBook":233,"chapterId":8,"bookId":13,"arabic":"وعن عائشة رضي الله عنها قالت‏:‏ كان رسول الله صلى الله عليه وسلم إذا دخل العشر أحيا الليل وأيقظ أهله، وشد المئزر‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","english":{"narrator":"'Aishah (May Allah be pleased with him) reported:","text":"When the last ten nights (of Ramadan) would begin, the Messenger of Allah (ﷺ) would keep awake at night (for prayer and devotion), awaken his family and prepare himself to be more diligent in worship.."}},{"id":234,"idInBook":234,"chapterId":8,"bookId":13,"arabic":"عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال‏:‏ ‏\n\"‏لا يتقدمن أحدكم رمضان بصوم يوم أو يومين، إلا أن يكون رجل كان يصوم صومه، فليصم ذلك اليوم‏\"‏ ‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Prophet (ﷺ) said, \"Do not observe Saum (fasting) for a day or two days preceding Ramadan. However, if a person is in the habit of observing Saum on a particular day (which may fall on these dates), he may fast on that day.\"."}},{"id":235,"idInBook":235,"chapterId":8,"bookId":13,"arabic":"وعن ابن عباس رضي الله عنهما قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏\n\"‏ لا تصوموا قبل رمضان صوموا لرؤيته وأفطروا لرؤيته، فإن حالت دونه فأكملوا ثلاثين يومًا‏\"‏ ‏(‏‏(‏رواه الترمذي وقال حديث حسن صحيح‏.‏","english":{"narrator":"Ibn 'Abbas (May Allah be pleased with them) reported:","text":"The Messenger of Allah (ﷺ) said, \"Do not observe Saum (fasting) before the advent of Ramadan. Observe Saum at sighting of the crescent of Ramadan and terminate it at sighting the crescent (of Shawwal). If the sky is overcast, complete (the month as) thirty (days).\"."}},{"id":236,"idInBook":236,"chapterId":8,"bookId":13,"arabic":"وعن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏\n\"‏إذا بقي نصف من شعبان فلا تصوموا‏\"‏ ‏(‏‏(‏رواه الترمذي وقال حديث حسن صحيح‏)‏‏)‏‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"When there comes the middle of Sha'ban, don't observe Saum (fasting).\"."}},{"id":237,"idInBook":237,"chapterId":8,"bookId":13,"arabic":"وعن أبي اليقظان عمار بن ياسر، رضي الله عنهما قال‏:‏ ‏\n\"‏من صام اليوم الذي يشك فيه فقد عصي أبا القاسم، صلى الله عليه وسلم‏\"‏ ‏(‏‏(‏رواه أبو داود والترمذي وقال‏:‏ حديث حسن صحيح‏)‏‏)‏‏.‏","english":{"narrator":"'Ammar bin Yasir (May Allah be pleased with them) reported:","text":"He who observes the fast on a doubtful day, has in fact disobeyed Abul-Qasim, (i.e., Messenger of Allah (ﷺ)).."}},{"id":238,"idInBook":238,"chapterId":8,"bookId":13,"arabic":"عن طلحة بن عبيد الله رضي الله عنه أن النبي صلى الله عليه وسلم كان إذا رأى الهلال قال‏:‏ ‏\n\"‏اللهم أهله علينا بالأمن والإيمان والسلامة والإسلام، ربي وربك الله، هلال رشد وخير‏\"‏ ‏(‏‏(‏رواه الترمذي وقال‏:‏ حديث حسن‏)‏‏)‏‏.‏","english":{"narrator":"Talhah bin Ubaidullah (May Allah be pleased with him) reported:","text":"At the sight of the new moon (of the lunar month), the Prophet (ﷺ) used to supplicate: \"Allahumma ahillahu 'alaina bil-amni wal-iman, was-salamati wal-Islam, Rabbi wa Rabbuk-Allah, Hilalu rushdin wa khairin (O Allah, let this moon appear on us with security and Iman; with safety and Islam. (O moon!) Your Rubb and mine is Allah. May this moon be bringing guidance and good).\"."}},{"id":239,"idInBook":239,"chapterId":8,"bookId":13,"arabic":"عن أنس، رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏\n\"‏تسحروا فإن في السحور بركة‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","english":{"narrator":"Anas (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"Eat Suhur (predawn meal). Surely, there is a blessing in Suhur.\"."}},{"id":240,"idInBook":240,"chapterId":8,"bookId":13,"arabic":"وعن زيد بن ثابت رضي الله عنه قال‏:‏ تسحرنا مع رسول الله صلى الله عليه وسلم ثم قمنا إلى الصلاة قيل كم كان بينهما‏؟‏ قال‏:‏ خمسون آية ‏(‏‏(‏متفق عليه‏)‏‏)‏","english":{"narrator":"Zaid bin Thabit (May Allah be pleased with him) reported:","text":"We took Suhur (predawn meal) with the Messenger of Allah (ﷺ) and then we stood up for (Fajr) Salat (prayer). It was asked: \"How long was the gap between the two?\" He replied: \"The time required for the recitation of fifty Ayat.\"."}},{"id":241,"idInBook":241,"chapterId":8,"bookId":13,"arabic":"وعن ابن عمر رضي الله عنهما قال‏:‏ كان لرسول الله صلى الله عليه وسلم مؤذنان‏:‏ بلال وابن أم مكتوم‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\n\"‏ إن بلالا يؤذن بليل فكلوا واشربوا حتى يؤذن ابن أم مكتوم‏\"‏ قال ولم يكن بينهما إلا أن ينزل هذا ويرقى هذا، ‏(‏‏(‏متفق عليه‏)‏‏)‏","english":{"narrator":"Ibn 'Umar (May Allah be pleased with them) reported:","text":"The Messenger of Allah (ﷺ) had two Mu'adhdhin: Bilal and Ibn Umm Maktum (May Allah be pleased with them). The Messenger of Allah (ﷺ) said, \"Bilal proclaims Adhan ."}},{"id":242,"idInBook":242,"chapterId":8,"bookId":13,"arabic":"وعن عمرو بن العاص رضي الله عنه أن رسول الله قال‏:‏ ‏\"‏فصل ما بين صيامنا وصيام أهل الكتاب أكلة السحر‏.‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"'Amr bin Al-'As (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"The difference between our observance of Saum (fasting) and that of the people of the Scriptures is Suhur (predawn meal in Ramadan).\"."}},{"id":243,"idInBook":243,"chapterId":8,"bookId":13,"arabic":"عن سهل بن سعد رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\n\"‏لا يزال الناس بخير ما عجلوا الفطر‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","english":{"narrator":"Sahl bin Sa'd (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"People will continue to adhere to good as long as they hasten to break the Saum (fasting).\"."}},{"id":244,"idInBook":244,"chapterId":8,"bookId":13,"arabic":"وعن أبي عطية قال‏:‏ دخلت أنا ومسروق على عائشة رضي الله عنها فقال لها مسروق‏:‏ رجلان من أصحاب محمد صلى الله عليه وسلم كلاهما لا يألو عن الخير‏:‏ أحدهما يعجل المغرب والإفطار، والآخر يؤخر المغرب والإفطار‏؟‏ فقالت‏:‏ من يعجل المغرب والإفطار‏؟‏ قال‏:‏ عبد الله - يعني ابن مسعود- فقالت‏:‏ هكذا كان رسول الله صلى الله عليه وسلم يصنع‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Abu Atiyyah (May Allah be pleased with him) reported:","text":"Masruq and I visited 'Aishah (May Allah be pleased with her) and said: \"O Mother of the Believers! There are two Companions of Muhammad (ﷺ) and neither of them holds back from doing good acts; but one of them hastens to break Saum (fasting) and hastens to perform the Maghrib prayer, while the other delays breaking Saum and delays performing Salat (prayer).\" She asked, \"Who is the one who hastens to break Saum and perform the Maghrib prayer?\" Masruq said, \"It is 'Abdullah (meaning 'Abdullah bin Mas'ud).\" She said, \"The Messenger of Allah (ﷺ) used to do so.\"."}},{"id":245,"idInBook":245,"chapterId":8,"bookId":13,"arabic":"وعن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم قال الله عز وجل‏:‏ ‏\n\"‏أحب عبادي إلي أعجلهم فطرًا‏\"‏ ‏(‏‏(‏رواه الترمذي وقال حديث حسن‏)‏‏)‏‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"Allah the Most High says: 'From amongst my slaves, the quicker the one is in breaking the Saum (fasting), the dearer is he to me.\"'."}},{"id":246,"idInBook":246,"chapterId":8,"bookId":13,"arabic":"وعن عمر بن الخطاب، رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏\n\"‏إذا أقبل الليل من ههنا وأدبر النهار من ههنا، وغربت الشمس، فقد أفطر الصائم‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","english":{"narrator":"'Umar bin Al-Khattab (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said: \"When the night approaches from this side (i.e., the east) and the day retreats from that side (i.e., west) and the sun sets, then it is time for a person observing Saum (fasting) to break his fast.\"."}},{"id":247,"idInBook":247,"chapterId":8,"bookId":13,"arabic":"وعن أبي إبراهيم عبد الله بن أبي أوفى، رضي الله عنهما قال‏:‏ سرنا مع رسول الله صلى الله عليه وسلم وهو صائم فلما غربت الشمس قال لبعض القوم‏:‏ ‏\"‏يا فلان انزل فاجدح لنا، فقال‏:‏ يا رسول الله لو أمسيت‏؟‏ قال‏:‏ ‏\"‏انزل فاجدح لنا‏\"‏ قال‏:‏ إن عليك نهارًا، قال‏:‏ ‏\"‏انزل فاجدح لنا‏\"‏ قال‏:‏ فنزل فجدح لهم فشرب رسول الله صلى الله عليه وسلم ثم قال‏:‏ ‏\"‏إذا رأيتم الليل قد أقبل من ههنا، فقد أفطر الصائم‏\"‏ وأشار بيده قبل المشرق‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","english":{"narrator":"Abu Ibrahim 'Abdullah bin Abu Aufa (May Allah be pleased with them) reported:","text":"We were with the Messenger of Allah (ﷺ) on a journey and he was observing Saum (fasting). When the sun set, he (ﷺ) said to a person, \"Dismount and prepare the ground roasted barley drink for us.\" Upon this he replied, \"O Messenger of Allah, there is daylight still.\" The Messenger of Allah (ﷺ) said, \"Get down and prepare barley drink for us.\" He said, \"But it is still daytime.\" The Messenger of Allah (ﷺ) again said to him, \"Get down and prepare barely drink for us.\" So he got down and prepared a barley liquid meal for him. The Prophet (ﷺ) drank that and then said, \"When you perceive the night approaching from that side, a person observing Saum (fasting) should break the fast.\" And he (ﷺ) pointed towards the east with his hand.."}},{"id":248,"idInBook":248,"chapterId":8,"bookId":13,"arabic":"وعن سلمان بن عامر الضبي الصحابي، رضي الله عنه عن النبي صلى الله عليه وسلم قال‏:‏ ‏\n\"‏إذا أفطر أحدكم، فليفطر على تمر فإن لم يجد فليفطر على ماء فإنه طهور‏\"‏ ‏(‏‏(‏رواه أبو داود، والترمذي وقال‏:‏ حديث حسن صحيح‏)‏‏)‏‏.‏","english":{"narrator":"Salman bin 'Amir (May Allah be pleased with him) reported:","text":"I heard the Prophet (ﷺ) saying, \"When one of you breaks his Saum (fasting), let him break it on dates; if he does not have any, break his fast with water for it is pure.\"."}},{"id":249,"idInBook":249,"chapterId":8,"bookId":13,"arabic":"وعن أنس رضي الله عنه قال كان رسول الله صلى الله عليه وسلم يفطر قبل أن يصلي على رطبات، فإن لم تكن رطبات فتميرات فإن لم تكن تميرات حسا حسوات من ماء‏.‏ ‏(‏‏(‏رواه أبو داود والترمذي وقال‏:‏ حديث حسن‏)‏‏)‏‏.‏","english":{"narrator":"Anas (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) used to break his Saum (fasting) before performing Maghrib prayer with three fresh date-fruits; if there were no fresh date- fruits, he will eat three dry dates; and if there were no dry date- fruits; he would take three draughts of water.."}},{"id":250,"idInBook":250,"chapterId":8,"bookId":13,"arabic":"عن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏\n\"‏إذا كان يوم صوم أحدكم فلا يرفث ولا يصخب، فإن سابه أحد أو قاتله، فليقل‏:‏ إني صائم‏\"‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"When any one of you is observing Saum (fasting) on a day, he should neither indulge in obscene language nor should he raise the voice; and if anyone reviles him or tries to quarrel with him he should say: 'I am observing fast.\"'."}},{"id":251,"idInBook":251,"chapterId":8,"bookId":13,"arabic":"وعنه قال‏:‏ قال النبي صلى الله عليه وسلم‏:‏ ‏\n\"‏ من لم يدع قول الزور والعمل به فليس لله حاجة في أن يدع طعامه وشرابه‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Prophet (ﷺ) said, \"If one does not eschew lies and false conduct, Allah has no need that he should abstain from his food and his drink.\"."}},{"id":252,"idInBook":252,"chapterId":8,"bookId":13,"arabic":"وعن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال‏:‏ ‏\n\"‏إذا نسي أحدكم فأكل أو شرب فليتم صومه فإنما أطعمه الله وسقاه‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Prophet (ﷺ) said, \"If any one of you forgetfully eats or drinks (while observing fasting) he should complete his Saum (fasting), for Allah has fed him and given him to drink.\"."}},{"id":253,"idInBook":253,"chapterId":8,"bookId":13,"arabic":"وعن لقيط بن صبرة رضي الله عنه قال قلت يا رسول الله أخبرني عن الوضوء‏؟‏ قال‏\"‏ ‏\"‏أسبغ الوضوء، وخلل بين الأصابع، وبالغ في الاستنشاق، إلا أن تكون صائمًا‏\"‏ ‏(‏‏(‏رواه أبوداود، والترمذي وقال‏:‏ حديث حسن صحيح‏)‏‏)‏‏.‏","english":{"narrator":"Laqit bin Sabirah (May Allah be pleased with him) reported:","text":"I requested the Messenger of Allah (ﷺ) to talk to me about ablution. He said, \"Perform the Wudu' well (by washing those parts of the body, such as the face, hands and feet beyond what is required, like washing the hands up to the upper-arm instead of the elbow). Cleanse the base of your fingers and sniff water deep into the nose except when you are observing fast.\"."}},{"id":254,"idInBook":254,"chapterId":8,"bookId":13,"arabic":"وعن عائشة رضي الله عنها قالت‏:‏ كان رسول الله صلى الله عليه وسلم يدركه الفجر وهو جنب من أهله ثم يغتسل ويصوم ‏(‏‏(‏متفق عليه‏)‏‏)‏","english":{"narrator":"'Aishah (May Allah be pleased with her) reported:","text":"The Messenger of Allah (ﷺ) would wake up at Fajr time in a state of Janabah; so he would take bath before dawn and observe fasting.."}},{"id":255,"idInBook":255,"chapterId":8,"bookId":13,"arabic":"وعن عائشة وأم سلمة رضي الله عنهما قالتا‏:‏ كان رسول الله صلى الله عليه وسلم يصبح جنبًا من غير حلم ثم يصوم‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","english":{"narrator":"'Aishah, and Umm Salamah (May Allah be pleased with them) reported:","text":"The Messenger of Allah (ﷺ) would wake during Ramadan (fasting) in a state of major impurity without a wet dream, but on account of sexual intercourse and he would take a bath before dawn.."}},{"id":256,"idInBook":256,"chapterId":8,"bookId":13,"arabic":"وعن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏\n\"‏أفضل الصيام بعد رمضان‏:‏ شهر الله المحرم، وأفضل الصلاة بعد الفريضة‏:‏ صلاة الليل‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"The best month for observing Saum (fasting) next after Ramadan is the month of Allah, the Muharram; and the best Salat (prayer) next after the prescribed Salat is Salat at night (Tahajjud prayers).\"."}},{"id":257,"idInBook":257,"chapterId":8,"bookId":13,"arabic":"وعن عائشة رضي الله عنها قالت لم يكن النبي صلى الله عليه وسلم يصوم من شهر أكثر من شعبان فإنه كان يصوم شعبان كله وفي رواية‏:‏ كان يصوم شعبان إلا قليلا‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","english":{"narrator":"'Aishah (May Allah be pleased with her) reported:","text":"The Prophet (ﷺ) did not observe voluntary Saum (fasting) so frequently during any other month as he did during Sha'ban. He observed Saum throughout the month of Sha'ban.Another narration is: He (ﷺ) observed Saum during the whole month of Sha'ban except a few days.."}},{"id":258,"idInBook":258,"chapterId":8,"bookId":13,"arabic":"وعن مجيبة الباهلية عن أبيها أو عمها، أنه أتى رسول الله صلى الله عليه وسلم ثم انطلق فأتاه بعد سنة وقد تغيرت حاله وهيئته، فقال‏:‏ يا رسول الله أما تعرفني‏؟‏ قال‏:‏ ‏\"‏ومن أنت‏؟‏‏\"‏ قال‏:‏ أنا الباهلي الذي جئتك عام الأول‏.‏ قال‏:‏ ‏\"‏فما غيرك، وقد كنت حسن الهيئة‏؟‏‏\"‏ قال‏:‏ ما أكلت طعامًا منذ فارقتك إلا بليل‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏عذبت نفسك‏!‏‏\"‏ ثم قال‏:‏ ‏\"‏صم شهر الصبر، ويومًا من كل شهر‏\"‏ قال‏:‏ زدني، فإن بي قوة، قال‏:‏ ‏\"‏ صم يومين‏\"‏ قال‏:‏ زذني، قال‏:‏ ‏\"‏صم ثلاثة أيام‏\"‏ قال‏:‏ زدني‏.‏ قال‏:‏ ‏\"‏صم من الحرم واترك، صم من الحرم واترك، صم من الحرم واترك‏\"‏ وقال بأصابعه الثلاث فضمها، ثم أرسلها‏.‏ ‏(‏‏(‏رواه أبو داود‏.‏ ‏)‏‏)‏‏.‏","english":{"narrator":"Reported Mujibah Al-Bahiliyah on the authority of her father or uncle that he visited the Messenger of Allah (ﷺ) once and then went to see him again after a year. His appearance had totally changed. He asked the Messenger of Allah (ﷺ) if he had recognized him. The Messenger of Allah (ﷺ) asked, \"Who are you?\" He replied:","text":"\"I am Al- Bahili who visited you last year.\" The Messenger of Allah (ﷺ) said, \"You were quite handsome, what has changed your appearance so much?\" He replied, \"Since my departure from here, I have not eaten anything except at night.\" The Messenger of Allah (ﷺ) remarked, \"You have put yourself to torture. Observe Saum (fasting) during the Month of Patience (i.e., Ramadan) and fast one day from each month.\" He submitted, \"Permit me to observe more voluntary fasts because I have capacity to do so.\" The Messenger of Allah (ﷺ) said, \"Then observe fasts for two days in every month.\" He said, \"Permit me to observe more.\" The Messenger of Allah (ﷺ) said, \"Observe fasts on three days in every month.\" He requested that he should be allowed to observe more fasts. The Messenger of Allah (ﷺ) said, \"Fast three days during the sacred months and omit fasting for three days alternately.\" He (ﷺ) joined his three fingers together and left them apart while repeating this sentence thrice.."}},{"id":259,"idInBook":259,"chapterId":8,"bookId":13,"arabic":"وعن ابن عباس رضي الله عنهما قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏\"‏ ما من أيام العمل الصالح فيها أحب إلى الله من هذه الأيام‏\"‏ يعني أيام العشر، قالوا‏:‏ يا رسول الله ولا الجهاد في سبيل الله‏؟‏ قال‏:‏ ‏\"‏ولا الجهاد في سبيل الله، إلا رجل خرج بنفسه، وماله فلم يرجع من ذلك بشيء‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","english":{"narrator":"Ibn 'Abbas (May Allah be pleased with them) reported:","text":"The Messenger of Allah (ﷺ) said, \"There are no days during which the righteous action is so pleasing to Allah than these days (i.e., the first ten days of Dhul-Hijjah).\" He was asked: \"O Messenger of Allah, not even Jihad in the Cause of Allah?\" He (ﷺ) replied, \"Not even Jihad in the Cause of Allah, except in case one goes forth with his life and his property and does not return with either of it.\"."}},{"id":260,"idInBook":260,"chapterId":8,"bookId":13,"arabic":"وعن أبي قتادة رضي الله عنه قال‏:‏ سئل رسول الله صلى الله عليه وسلم‏:‏ عن صوم يوم عرفة‏؟‏ قال‏:‏ ‏\n\"‏يكفر السنة الماضية والباقية‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Abu Qatadah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) was asked about the observance of Saum (fasting) on the day of 'Arafah. He said, \"It is an expiation for the sins of the preceding year and the current year.\"."}},{"id":261,"idInBook":261,"chapterId":8,"bookId":13,"arabic":"وعن ابن عباس رضي الله عنهما أن رسول الله صلى الله عليه وسلم صام يوم عاشوراء، وأمر بصيامه‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","english":{"narrator":"Ibn 'Abbas (May Allah be pleased with them) reported:","text":"The Messenger of Allah (ﷺ) observed Saum (fasting) on the day of 'Ashura' and commanded us to fast on this day.."}},{"id":262,"idInBook":262,"chapterId":8,"bookId":13,"arabic":"وعن أبي قتادة رضي الله عنه أن رسول الله صلى الله عليه وسلم سئل عن صيام يوم عاشوراء فقال‏:‏ ‏\n\"‏يكفر السنة الماضية‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Abu Qatadah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) was asked about observing As-Saum (the fast) on the tenth day of Muharram, and he replied, \"It is an expiation for the sins of the preceding year.\"."}},{"id":263,"idInBook":263,"chapterId":8,"bookId":13,"arabic":"وعن ابن عباس رضي الله عنهما قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏\n\"‏لئن بقيت إلى قابل لأصومن التاسع‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Ibn 'Abbas (May Allah be pleased with them) reported:","text":"The Messenger of Allah (ﷺ) said, \"If I remain alive till the next year, I shall also observe fast on the ninth of Muharram.\"."}},{"id":264,"idInBook":264,"chapterId":8,"bookId":13,"arabic":"عن أبي أيوب رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\n\"‏من صام رمضان ثم أتبعه بست من شوال كان كصيام الدهر‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Abu Ayyub (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"He who observes As-Saum (the fasts) in the month of Ramadan, and also observes As-Saum for six days in the month of Shawwal, it is as if he has observed As-Saum for the whole year.\"."}},{"id":265,"idInBook":265,"chapterId":8,"bookId":13,"arabic":"عن أبي قتادة رضي الله عنه أن رسول الله صلى الله عليه وسلم‏:‏ سئل عن صوم يوم الاثنين فقال‏:‏ ‏\n\"‏ذلك يوم ولدت فيه، ويوم بعثت أو أنزل علي فيه‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Abu Qatadah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) was asked about fasting on Mondays. He said, \"That is the day on which I was born and the day on which I received Revelation.\"."}},{"id":266,"idInBook":266,"chapterId":8,"bookId":13,"arabic":"وعن أبي هريرة رضي الله عنه عن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\n\"‏ تعرض الأعمال يوم الاثنين والخميس، فأحب أن يعرض عملي وأنا صائم‏\"‏ ‏(‏‏(‏رواه الترمذي وقال‏:‏ حديث حسن، ورواه مسلم بغير ذكر الصوم‏)‏‏)‏‏.‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"Deeds of people are presented (to Allah) on Mondays and Thursdays. So I like that my actions be presented while I am fasting.\"."}},{"id":267,"idInBook":267,"chapterId":8,"bookId":13,"arabic":"وعن عائشة رضي الله عنها قالت‏:‏ كان رسول الله صلى الله عليه وسلم يتحرى صوم الاثنين والخميس‏.‏ ‏(‏‏(‏رواه الترمذي وقال حديث حسن‏)‏‏)‏‏.‏","english":{"narrator":"'Aishah (May Allah be pleased with her)u reported:","text":"The Messenger of Allah (ﷺ) used to observe fast on Mondays and Thursdays.."}},{"id":268,"idInBook":268,"chapterId":8,"bookId":13,"arabic":"وعن أبي هريرة رضي الله عنه قال‏:‏ أوصاني خليلي صلى الله عليه وسلم بثلاث‏:‏ صيام ثلاثة أيام من كل شهر، وركعتي الضحى وأن أوتر قبل أن أنام‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","english":{"narrator":"Abu Hurairah (May Allah be pleased with him) reported:","text":"My friend (the Messenger of Allah) (ﷺ) directed me to observe fast for three days in every month, to perform two Rak'ah (optional) Duha prayer at forenoon and to perform the Witr prayer before going to bed.."}},{"id":269,"idInBook":269,"chapterId":8,"bookId":13,"arabic":"وعن أبي الدرداء رضي الله عنه قال‏:‏ أوصاني حبيبي، صلى الله عليه وسلم بثلاث لن أدعهن ما عشت‏:‏ بصيام ثلاثة أيام من كل شهر، وصلاة الضحى، وبأن لا أنام حتى أوتر‏.‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Abud-Darda (May Allah be pleased with him) reported:","text":"My friend (the Messenger of Allah) (ﷺ) directed me to observe Saum (fasting) for three days in every month, to perform two Rak'ah (optional) Duha prayer at forenoon, and to perform the Witr prayer before going to bed.."}},{"id":270,"idInBook":270,"chapterId":8,"bookId":13,"arabic":"وعن عبد الله بن عمرو بن العاص، رضي الله عنهما، قال‏:‏ قال رسول الله‏:‏ ‏\n\"‏صوم ثلاثة أيام من كل شهر صوم الدهر كله‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","english":{"narrator":"'Abdullah bin 'Amr bin Al-'As (May Allah be pleased with them) reported:","text":"The Messenger of Allah (ﷺ) said, \"Observing Saum (fasting) on three days of every month is equivalent to a full month's fasting.\"."}},{"id":271,"idInBook":271,"chapterId":8,"bookId":13,"arabic":"وعن معاذة العدوية أنها سألت عائشة رضي الله عنها‏:‏ أكان رسول الله صلى الله عليه وسلم يصوم من كل شهر ثلاثة أيام، فقالت‏:‏ نعم‏.‏ فقلت‏:‏ من أي الشهر كان يصوم‏؟‏ قالت‏:‏ لم يكن يبالي من أي الشهر يصوم‏.‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","english":{"narrator":"Mu'adhah Al-'Adawiyah (May Allah be pleased with her) reported:","text":"I asked 'Aishah (May Allah be pleased with her). Did the Messenger of Allah (ﷺ) use to observe three days of Saum (fasting) in every month?\" She replied, \"Yes.\" I asked, \"On which days in the month did he observed fast?\" She replied that he did not mind on which days of the month he observed fast.."}},{"id":272,"idInBook":272,"chapterId":8,"bookId":13,"arabic":"وعن أبي ذر رضي الله عنه، قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏\n\"‏إذا صمت من الشهر ثلاثًا، فصم ثلاث عشرة، وأربع عشرة وخمس عشرة‏\"‏ رواه الترمذي وقال‏:‏ حديث حسن‏.‏","english":{"narrator":"Abu Dharr (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) said, \"If you want to observe Saum on three days in a month, then fast on the thirteenth, fourteenth and fifteenth of the (lunar) month.\"."}},{"id":273,"idInBook":273,"chapterId":8,"bookId":13,"arabic":"وعن قتادة بن ملحان، رضي الله عنه، قال‏:‏ كان رسول الله صلى الله عليه وسلم يأمرنا بصيام أيام البيض‏:‏ ثلاث عشرة، وأربع شعرة وخمس عشرة‏.‏ ‏(‏‏(‏رواه أبو داود‏.‏","english":{"narrator":"Qatadah bin Milhan (May Allah be pleased with him) reported:","text":"The Messenger of Allah (ﷺ) directed us to observe Saum (fasting) on the thirteenth, fourteenth and fifteenth of the (lunar) month.."}},{"id":274,"idInBook":274,"chapterId":8,"bookId":13,"arabic":"وعن ابن عباس، رضي الله عنهما، قال‏:‏ كان رسول الله صلى الله عليه وسلم ‏\n\"‏لا يفطر أيام البيض في حضر ولا سفر‏\"‏ ‏(‏‏(‏رواه النسائي بإسناد حسن‏)‏‏)‏‏.‏","english":{"narrator":"Ibn 'Abbas (May Allah be pleased with them) reported:","text":"It was the practice of the Messenger of Allah (ﷺ) to not to omit fast on 'bright days' whether he was staying at a place or on a journey.."}},{"id":275,"idInBook":275,"chapterId":8,"bookId":13,"arabic":"عن زيد بن خالد الجهني، رضي الله عنه عن النبي صلى الله عليه وسلم قال‏:‏ ‏\n\"‏من فطر صائمًا، كان له مثل أجره غير أنه لا ينقص من أجر الصائم شيء‏\"‏ ‏(‏‏(‏رواه الترمذي وقال‏:‏ حديث حسن صحيح‏)‏‏)‏‏.‏","english":{"narrator":"Zaid bin Khalid Al-Juhani (May Allah be pleased with him) reported:","text":"The Prophet (ﷺ) said, \"He who provides a fasting person something with which to break his fast, will earn the same reward as the one who was observing the fast, without diminishing in any way the reward of the latter.\"."}},{"id":276,"idInBook":276,"chapterId":8,"bookId":13,"arabic":"وعن أم عمارة الأنصارية، رضي الله عنها أن النبي صلى الله عليه وسلم دخل عليها فقدمت إليه طعامًا فقال ‏\"‏ كلي‏\"‏ فقالت‏:‏ إني صائمة، فقال رسول الله صلى الله عليه وسلم‏:‏ ‏\"‏إن الصائم تصلي عليه الملائكة إذا أكل عنده حتى يفرغوا‏\"‏ وربما قال‏:‏ ‏\"‏حتى يشبعوا‏\"‏ ‏(‏‏(‏رواه الترمذي وقال‏:‏ حديث حسن‏)‏‏)‏‏.‏","english":{"narrator":"Umm 'Umarah Al-Ansariyah (May Allah be pleased with her) reported:","text":"Once the Prophet (ﷺ) visited us and I served him some food. He (ﷺ) asked me to eat. I replied that I was observing (optional) fast. He (ﷺ) said, \"When people eat by a person observing fast, the angels keep asking Allah's forgiveness for that person until they have had their fill.\"."}},{"id":277,"idInBook":277,"chapterId":8,"bookId":13,"arabic":"وعن أنس رضي الله عنه أن النبي صلى الله عليه وسلم جاء إلى سعد بن عبادة رضي الله عنه فجاء بخبز وزيت، فأكل ثم قال النبي صلى الله عليه وسلم‏:‏ ‏\n\"‏أفطر عندكم الصائمون وأكل طعامكم الأبرار وصلت عليكم الملائكة‏\"‏‏.‏ ‏(‏‏(‏رواه أبو داود بإسناد صحيح‏)‏‏)‏‏.‏","english":{"narrator":"Anas (May Allah be pleased with him) reported:","text":"The Prophet (ﷺ) came to visit Sa'd bin 'Ubadah (May Allah be pleased with him) who presented bread and olive oil to him. The Prophet (ﷺ) ate it and said, \"The observers of fast have broken their fast with you (this is the literal translation, but the meaning is: 'May Allah reward you for providing a fasting people with food to break their fast'); the pious people have eat your food and the angels invoked blessings on you.\"."}}],"chapter":{"id":8,"bookId":13,"arabic":"كتاب الفضائل","english":"The Book of Virtues"}}